[{"category": "", "categoryclass": "", "imagename": "c4385cf4799626d7bdc8e3f456090ae1.jpg", "infoid": 1008395, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "盐湖城的Spiff宣布了一轮1000万美元的融资，以扩大其服务的销售和营销努力，该服务自动为销售人员支付佣金。\n一些初创科技公司的大牌正在使用这项服务来支付他们的销售团队，包括Brex，Workfront，Algolia，以及上市的初创公司Qualys。\nSpiff的想法是围绕销售薪酬管理创建一个新的软件类别，并得到了Norwest Venture Partners、Next World Ventures和EpicVentures投资者的支持。包括Kickstart Alignment Ventures，Pipeline Capital和Peterson Ventures在内的种子投资者也回来投资该公司。\nSpiff首席执行官杰伦·保罗(Jeron Paul)表示：“佣金是那些不理解或不信任他们的激励计划的团队焦虑的主要原因，许多团队每个月都会浪费几个小时纠正错误或与财务争执，这触及了底线。”诺西公司的投资将帮助我们自动计算佣金，这样销售团队在这个充满挑战的时期就少了一件要担心的事情。“。\nNorwest Venture Partners合伙人肖恩·雅各布森(Sean Jacobsohn)在一份声明中表示：“销售薪酬软件领域早就应该进行改造了。”由于85%的公司仍在Google Sheet或Excel中手动计算销售佣金，我很高兴能与Spiff合作，帮助改变人们对销售薪酬的看法，并为他们的销售团队提供更深层次的佣金可见性。“", "note_en": "Salt Lake City’s  Spiff has announced a $10 million round of funding to expand the sales and marketing efforts for its service that automates commission payments for sales people.\n Some of the biggest names in startup tech are using the service to pay their sales force including Brex, Workfront, Algolia, and the publicly traded startup, Qualys.\n The idea at Spiff is to create a new software category around sales compensation management and it’s gotten buy-in from investors at Norwest Venture Partners, Next World Ventures and Epic Ventures. Seed investors including Kickstart Album Ventures, Pipeline Capital and Peterson Ventures, returned to invest in the company as well.\n  “Commissions are a major cause of anxiety for teams who don’t understand or trust their incentive plan and many waste hours every month correcting mistakes or arguing with finance, which hits bottom lines,” said Spiff chief executive, Jeron Paul. “Norwest’s investment will help us automate commission calculations so sales teams have one less thing to worry about in these challenging times.”\n  “The world of sales compensation software is long overdue for a revamp,” said Sean Jacobsohn, partner at Norwest Venture Partners, in a statement. “With 85 percent of companies still calculating sales commissions manually in Google Sheets or Excel, I’m excited to partner with Spiff to help transform the way people think about sales compensation and provide  sales teams with a deeper level of  visibility into their commissions.”", "posttime": "2020-06-26 20:41:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "spiff,windfall,销售", "title": "\n公司销售队伍的自动支付为Spiff带来了1000万美元的意外之财", "title_en": "\n\t\t\t\tAutomating payments for the corporate sales force leads to a $10 million windfall for Spiff\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/automating-payments-for-the-corporate-sales-force-leads-to-a-10-million-windfall-for-spiff/", "via": "", "real_tags": ["spiff", "windfall", "销售"]}, {"category": "", "categoryclass": "", "imagename": "aa632215ea4a054cddeda2dc17d5fb3a.jpg", "infoid": 1008394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球，每周|免费：202年6月18日https://supercomputingfrontiers.eu/2020/seminars/计算机和计算科学虚拟ICM研讨会.", "note_en": "WORLDWIDE, WEEKLY | FREE OF CHARGE: https://supercomputingfrontiers.eu/2020/seminars/ VIRTUAL ICM SEMINARS IN COMPUTER AND COMPUTATIONAL SCIENCE June 18, 202...", "posttime": "2020-06-26 20:24:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算,surprises,计算机", "title": "应用计算范式的新惊喜--斯蒂芬·沃尔弗拉姆", "title_en": "Emerging Surprises in Applying the Computational Paradigm – Stephen Wolfram", "transed": 1, "url": "https://youtu.be/SBhyCKhOXEE", "via": "", "real_tags": ["计算", "surprises", "计算机"]}, {"category": "", "categoryclass": "", "imagename": "e3c3c6b5a9b402a4e38f4cffaf172c63.png", "infoid": 1008392, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "面向程序员的数值线性代数：使用GPU、CUDA、OpenCL、MKL、JAVA和ClojureBasic…的交互式教程。*一本面向程序员的书*交互式、动态*从理论到实现的直接链接*难以置信的速度*NVIDIA GPU(CUDA和cuBLAS)*AMD GPU(是的，也是OpenCL！)*英特尔和AMD CPU(MKL)*Clojure(神奇！)*Java虚拟机(没有Java样板！)*完整的源代码*漂亮的排版(参见下面的示例章节)", "note_en": "Numerical Linear Algebra for Programmers: An Interactive Tutorial with GPU, CUDA, OpenCL, MKL, Java, and Clojurebasically…* a book for programmers* interactive & dynamic* direct link from theory to implementation* incredible speed* Nvidia GPU (CUDA and cuBLAS)* AMD GPU (yes, OpenCL too!)* Intel & AMD CPU (MKL)* Clojure (magic!)* Java Virtual Machine (without Java boilerplate!)* complete source code* beautiful typesetting (see sample chapters below)", "posttime": "2020-06-26 20:04:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,程序员,linear,java", "title": "程序员手册中的数值线性代数", "title_en": "Numerical Linear Algebra for Programmers Book", "transed": 1, "url": "https://aiprobook.com/numerical-linear-algebra-for-programmers?release=0.9.0", "via": "", "real_tags": ["程序", "程序员", "linear", "java"]}, {"category": "", "categoryclass": "", "imagename": "74470b243e423de53adcecc02cc25ae5.jpg", "infoid": 1008390, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在经历了几个月的电影和电视剧检疫后，你可能会觉得自己被禁锢了，但你不太可能会看到这篇文章的标题，然后说，是的，我需要用精心挑选的自制色情作品来提升我的观看习惯。美国最著名的业余色情艺术节“驼峰”背后的人，肯定不希望事情是这样的。(美国最著名的业余色情艺术节“驼峰”的幕后黑手们肯定不想看到这样的事情。--编者注：美国最著名的业余色情艺术节)的幕后黑手们肯定不希望事情发展到这样的地步。美国最著名的业余色情艺术节“驼峰”的幕后黑手们肯定不希望事情变成这样。\n关于驼峰有一件事！剧集策展人、性专栏作家丹·萨维奇(Dan Savage)在西雅图的家中通过电话告诉我，如果你不能去电影院，你就不会去看它。自从第一次“驼峰”以来，人们就问，你会卖DVD吗？结果是，你能在网上看吗？但你不能。没有DVD。\n驼背！一直都应该是离线的。但就像今年几乎所有的事情一样，萨维奇的创作不得不承认冠状病毒的现实。在2020年早些时候启动试运行之后，驼峰！最热门的作品，第一卷将在接下来的三个周末作为流媒体独家视频(不是VOD)跟随他。虽然电影节从来不是为在线发行而设计的，但对于2020年互联网上的色情会是什么样子，一线希望是非常奇怪的，也令人惊讶地大开眼界。\n电影节开始时只是西雅图的一个实验，由“陌生人”周报制作，萨维奇曾在该周报担任主编。(他继续为该报的印刷版和网络版撰稿，主要是以他的全国性辛迪加“野性之爱”专栏的形式写作，该专栏也有一个广受欢迎的播客。)。陌生人已经开始推广当地的艺术和音乐活动，萨维奇认为一个只在剧院放映的老式的、全是当地的色情盛会会是一种刺激。\n它有一个口号：在电影院做一个周末的色情明星，而不是永远成为互联网上的色情明星。毕竟，那是在2005年，那时免费的、容易下载的色情已经无处不在--像网络摄像头门户网站这样的内容大多是模仿主流色情作品中最基本的内容。萨维奇想知道，如果这个行业的业余方面被引导成老式的东西，会发生什么。他的老板、前“陌生人”出版商蒂姆·凯克(Tim Keck)就不那么确定了。\n萨维奇说，他认为没有人会制作和提交电影。这项活动将不了了之，我们不得不取消它。但即使不是，人们会像他们的祖父母过去那样，在黑暗中坐在电影院里，坐在陌生人(笑)旁边看色情片吗？\n经过两年的竞选活动，萨维奇在2005年获得了组织活动的许可。事实证明，当地的陌生人读者提交了电影-30多个单独的剪辑，这让所有参与其中的人都晕倒了-而好奇的赞助人则抢走了门票。萨维奇说，第一年的电影院预订在几个小时内就销售一空。那一年，以及随后的每一年，组织者都会向公众征集带有可选内容要求的电影，以证明这部电影是专门为这场活动制作的。(第一年的主题是Beavis&amp；Butt；Head的笑声：使用当地汉堡连锁店Dick‘s的食物和包装纸。未来，流行的主题围绕着共和党政客，多年来，萨维奇在他的性别正面和对LGBTQ友好的专栏中嘲笑过这些政客，包括迈克·哈克比(Mike Huckabee)和莎拉·佩林(Sarah Palin)。)。\n在作为西雅图独家剧院活动开始之后，驼峰！开始在其他城市巡回演出，包括波特兰、温哥华和旧金山。尽管如此，原始版本的谨慎意图依然存在：每次电影节结束时，“陌生人”拥有的所有电影都会被销毁，影院管理人员禁止参观者携带手机或录音设备。此外，随着该系列的影响范围扩大，其奖金池也在扩大，因为所有参与的电影都有资格根据观众投票获得现金奖，这些类别包括最滑稽的和最佳怪诞的。\n萨维奇说，在很大程度上，陌生人工作人员早期对害羞参与者的担忧是错误的。他说，对于仅在西雅图举行的演出，如果你拍了一部电影并把它给了我们，室友、同事或(笑)父母坐在电影院看你的色情片的可能性可能很高。他说，如果你拍了一部电影并把它给了我们，那么室友、同事或(笑)父母坐在电影院看你的色情片的可能性可能很高。报社的人认为，在那种情况下，我不会制作色情作品，所以其他人都不会拍。但他们错了！在我们后来的聊天中，他承认，一些参与者联系了电影节的组织者，并重新考虑和担心，尽管这种情况在最近几年已经变得不那么频繁了。\n萨维奇说，现在世界上充斥着像FonlyFans这样的网站，在过去的15年里，人们逐渐意识到，我们所有人都有肮脏的性行为-甚至可能是我们与朋友和情人分享的肮脏的小视频剪辑，作为永久记录的一部分-如果有人被曝光，耻辱就会减少。\n这导致了今年向纯在线形式的演变，萨维奇对此非常清楚：所有相关各方，特别是今年回归了过去15年来球迷最喜欢的旧投稿，都给了驼峰！允许进行在线流媒体，因为您完全知道有人可以点击屏幕截图按钮或录制视频片段以供Twitter共享。每一场放映都包括Savage自己直接的、发自内心的呼吁观众抑制他们可能的分享冲动，而不是将他们引导到官方预告片(警告：NSFW)。萨维奇说，出于自己的担忧，一些电影制作人拒绝参加仅限在线放映的形式，这是在之前的电影节上仅获准在某些城市上映的作品之外的。\n萨维奇说，全国各地的观众都非常热衷于保护驼峰！他们想让它成为一个安全的空间，供那些可能有暴露狂倾向的人使用，或者分享他们的任何东西，关于他们的情人，关于他们的怪癖，关于他们的性别表达，无论是什么。但是他们不想让它永远出现在互联网上。\n参加过西雅图的驼峰！在过去的节日活动中，我可以证明它的独特之处。我参加的活动吸引了不同年龄和喜好的观众，可以说可以与午夜放映的洛基恐怖电影秀(Rocky Horror Picture Show)相提并论，这是一座拥挤的房子，充满了观众的参与、笑声和欢呼声，而不是你可能会期待的70年代成人电影院令人毛骨悚然的寂静。\n驼峰的魔力！萨维奇在回忆往年的成功时说，需要一个座无虚席的剧院，而我们现在不能给人们这样的机会。这让我很难过。\n但他也承认，他喜欢今年的上行趋势。来自世界各地(以及美国较为保守的飞地)的粉丝终于实现了他们的愿望，希望能有一个方便的版本的电影节，他们将参加一个主要是为了娱乐和启发而设计的系列节目(尽管，是的，它也会让人兴奋)。也就是说，这并不是典型的色情片，它的目的是为了快速而肮脏的观看。不出所料，负责Savage Love专栏和播客的人说得比我更好：\n观众(他们的投票推动了驼峰的奖金池)编辑了电影节。一些[意见书]模仿了主流色情电影的惯例，但观众大多投票给那些个人化、独具特色和……的电影。你想说利基市场，但这不是利基市场。大多数观众都会对其他人的东西做出非常个人化的反应。这就是人们所关注的。我被誉为策展人，但观众们多年来一直在策划它。\n萨维奇接着详细描述了几部引起观众共鸣的电影，是的，萨维奇的描述-出奇地清晰，即使是不在今年最佳收藏中的旧片段-也必须在这里编辑出版。萨维奇说，其中一张是一对异性恋人非常简单地做爱的单镜头，没有噱头或怪癖；我记得的是他们分享的联系的强烈程度，以及他们对彼此的热情。另一个人看到一名女子在做某事之前跳上蹦床，重复着一句古怪的话，同时盯着镜头看。很奇怪。有些人问，那算什么色情片？但对那个人来说，那就是他们的色情片。\n萨维奇滔滔不绝地说出了其他的电影描述。一个是一对穿着衣服的女同性恋夫妇简单地谈论为什么一个伴侣不会吻另一个，另一个是关于BDSM在铁丝网栅栏上上演的一幕，他明智地将这些故事以一种起伏的强度缝合在一起。他的一些描述简单、温顺、甜蜜。另一些则充满了生产价值和夸大其词。还有一些人，坦率地说，是一团糟。\n他还精明地展示了驼峰的历史，以支持它的使命。这项任务是让观众观看一系列经过仔细排序的不同类型的色情视频，并提供一些你在互联网上最受欢迎的成人胡同中找不到的东西。\n[当每个驼峰！活动开始]，人们被不适合他们的色情内容击退到座位上。[Savage接着描述了人们对不同类型内容的不同反应，很好地转向了NSFW的领域。]但随后出现了这种转变。起初，他们所能看到的都是不属于他们的东西。不是我喜欢的类型的伴侣，不是我的性别，不是我的怪癖。但很快，他们就会从看不到自己的东西，到认识到自己的东西是一样的。性别差异，千丝万缕--它们都是我们共同拥有的一切的一层薄薄的外衣：欲望、激情、脆弱、幽默感，以及对联系和亲密的渴望。所有这些都是一样的。在五到六个电影标记之后，你会看到那个转变。不管下一部电影多么出人意料，每个人都在为每一部电影欢呼。它变成了一种庆祝的、肯定的氛围。一开始你在遮住眼睛，然后你又在观看同样的内容并为之欢呼。\n找到驼峰的流媒体时间表！最热门的电影，HumpFilmFest.com第一卷，今晚，6月26日，7月初的两个晚上放映。门票扣除费用前起价25美元；内容只能作为直播源提供，而不是视频点播(VOD)。", "note_en": "However cooped up you may feel after months of bingeing films and TV series in quarantine, it&#39;s not entirely likely that you&#39;d look at this article&#39;s headline and say, &#34;Yes, I need to kick my viewing habits up a notch with a curated selection of homemade porn.&#34; The people behind  Hump!, the United States&#39; best-known amateur-pornography festival, certainly didn&#39;t want things this way, either.\n &#34;One thing about Hump! is, if you couldn&#39;t get to a theater, you weren&#39;t going to see it,&#34; series curator and sex columnist Dan Savage tells me over the phone from his Seattle home. &#34;Ever since the first Hump!, people have asked, &#39;Are you going to sell DVDs?&#39; Which turned into, &#39;Can you watch it online?&#39; But you can&#39;t. There are no DVDs, and you can&#39;t see it online.&#34;\n Hump! was always supposed to be offline. But just like pretty much everything else this year, Savage&#39;s creation had to concede to the realities of coronavirus. And after launching a test run earlier in 2020, Hump! Greatest Hits, Volume 1 is following as a streamed-video exclusive (not VOD) over the next three weekends. And while the festival was never designed for online distribution, the silver lining is a very weird, and surprisingly eye-opening, perspective on what porn on the Internet can look like in 2020.\n  The festival began life as a Seattle-only experiment, produced by The Stranger, a weekly newspaper where Savage once served as editor-in-chief. (He continues writing for the paper&#39;s print and online editions, primarily in the form of his nationally syndicated Savage Love column, which also has a popular podcast.) The Stranger had already begun promoting local arts and music events, and Savage thought an old-school, all-local porn fest, screened only in theaters, would be a gas.\n It had a slogan: &#34;Be a porn star for a weekend in a movie theater, without becoming a porn star for an eternity on the Internet.&#34; This was 2005, after all, by which time free, easily downloadable porn had already become ubiquitous—and content like webcam portals was mostly aping the basest content from mainstream porn productions. Savage wondered what would happen if the &#34;amateur&#34; aspect of the industry was channeled into something old-school. His boss, former Stranger publisher Tim Keck, wasn&#39;t so sure.\n &#34;He didn&#39;t think anyone would make and submit films,&#34; Savage says. &#34;That the event would fall on its face and we&#39;d have to cancel it. But even if not, would people come and sit in a movie theater, in the dark, next to strangers [laughs], to watch porn the way their grandparents used to?&#34;\n After two years of campaigning, Savage got the go-ahead to organize an event in 2005. As it turns out, local Stranger readers submitted films—over 30 individual clips, which floored everyone involved—while curious patrons snatched up tickets. The first year&#39;s theater booking &#34;sold out within hours,&#34; Savage says. That year, and every year that followed, saw organizers solicit films from the public with optional content requirements that would prove the film was made specifically for the event. (The first year&#39;s theme was a Beavis &amp; Butt-Head-worthy chuckle: use of food and wrappers from local hamburger chain Dick&#39;s. Future, popular themes revolved around Republican politicians that Savage had mocked in his sex-positive and LGBTQ-friendly column over the years, including Mike Huckabee and Sarah Palin.)\n  After starting as a Seattle-only theater event, Hump! began touring to other cities, including Portland, Vancouver, and San Francisco. In spite of this, the original version&#39;s careful intent remained: all of the films in The Stranger&#39;s possession were destroyed upon the conclusion of each fest, and theater management forbade attendees from having phones or recording devices out in the slightest. Also, as the series&#39; reach grew, so did its prize pool, as all participating films were eligible for cash prizes based on audience votes for categories like &#34;funniest&#34; and &#34;best kink.&#34;\n For the most part, Savage says The Stranger staff&#39;s early concerns about bashful participants were misplaced. &#34;For the Seattle-only shows, if you made a film and gave it to us, the odds that a roommate, coworker, or [laughs] parent might be sitting in the theater and watch your porn might be high,&#34; he says. &#34;People at the paper thought, &#39; I wouldn&#39;t make porn under those circumstances, so nobody else would.&#39; And they were wrong!&#34; Later in our chat, he concedes that some participants have contacted the fest&#39;s organizers with second thoughts and worries, though that has become much less frequent in more recent years.\n &#34;Now in a world of sites like OnlyFans, and the creeping, dawning awareness over the last 15 years that all of us have dirty sex—and maybe even dirty little video clips we share with friends and lovers in circulation out there, as part of the permanent record—the stigma is less if someone were to be outed,&#34; Savage says.\n    That leads to this year&#39;s evolution to an online-only format, which Savage is adamantly clear about: all involved parties, particularly in this year&#39;s return of older, fan-favorite submissions from the past 15 years, have given Hump! the go-ahead to stream online, knowing full well that someone could tap a &#34;screenshot&#34; button or record a snippet for Twitter sharing. Each screening includes Savage&#39;s own direct, heartfelt appeal to viewers to suppress their possible sharing urges, instead directing them to  an official trailer (warning: NSFW). Savage says a few filmmakers declined to be part of an online-only format due to their own concerns, and this is on top of prior festivals&#39; submissions that had been approved to only screen in certain cities.\n &#34;Audiences all over the country have been lovely and wonderful about protecting Hump!,&#34; Savage says. &#34;They want to keep it a safe space for people who may have an exhibitionist streak or share whatever their thing is, about their lover, their kink, their gender expression, whatever it is. But they don&#39;t want it on the Internet forever.&#34;\n  Having attended a Seattle Hump! festival event in the past, I can attest to its unique weirdness. The events I&#39;ve attended have drawn a diverse audience of ages and proclivities, arguably comparable to a  Rocky Horror Picture Show midnight screening, and it&#39;s a crowded house full of audience participation, laughs, and cheers, as opposed to the creepy silence you might expect from a &#39;70s adult film theater.\n &#34;The magic of Hump! requires a packed theater, and we can&#39;t give people that right now,&#34; Savage says when recalling prior years&#39; success. &#34;That makes me sad.&#34;\n But he also admits that he&#39;s fond of this year&#39;s upside. Fans from around the world (and the USA&#39;s more conservative enclaves) have finally gotten their wish for an accessible version of the festival, and they&#39;ll be in for a series that&#39;s designed primarily to entertain and enlighten (though, yes, it also titillates). As in, this isn&#39;t your typical porn, meant for quick-and-dirty viewing. The man responsible for Savage Love&#39;s column and podcast, unsurprisingly, says it better than I possibly could:\n &#34;The audiences [whose votes drive Hump!&#39;s prize pool] edited the festival. Some [submissions] aped the conventions of mainstream porn, but audiences mostly voted films that were personal, idiosyncratic, and... you want to say &#39;niche,&#39; but it wasn&#39;t niche. Audiences responded to what was deeply personal about other people&#39;s stuff. That&#39;s what people vibed on. I&#39;m credited as a curator, but audiences really curated it over the years.&#34;\n  Savage goes on to describe at length a few films that resonated with viewers, and, yes, Savage&#39;s descriptions—uncannily clear, even for old clips not in this year&#39;s &#34;best-of&#34; collection—have to be edited for publication here. One was a single-camera shot of a heterosexual couple very simply having sex, without gimmicks or kinks; &#34;What I remember is the intensity of their connection that they shared, their passion for each other,&#34; Savage says. Another saw a woman stare down the camera while jumping on a trampoline and repeating a kinky phrase before doing something... strange. &#34;Some people asked, &#39;How is that porn?&#39; But for that person, that&#39;s their porn.&#34;\n Savage rattles off other film descriptions. One involves a clothed lesbian couple simply chatting about why one partner won&#39;t kiss the other, while another follows a BDSM scene playing out against a chain-link fence, and he&#39;s wise to stitch these stories together with a rise-and-fall of intensity. Some of his descriptions are simple, tame, and sweet. Others are full of production value and bombast. And still others are, to be frank, messed up.\n He is also savvy about presenting Hump!&#39;s history to champion its mission. That mission is to ask viewers to watch a carefully sequenced series of different types of erotic videos and deliver something you just won&#39;t find on the Internet&#39;s most popular adult alleyways.\n &#34;[When each Hump! event begins], people are knocked back in their seats by the porn that isn&#39;t for them.&#34; [Savage proceeds to describe different reactions to different kinds of content, veering well into NSFW territory.] &#34;But then there&#39;s this shift. At first, all they can see is what&#39;s not theirs. Not my preferred kind of partner, not my gender, not my kinks. But in a moment, they go from not seeing what&#39;s theirs to recognizing what&#39;s the same. Gender differences, kinks—they&#39;re all a thin veneer laid upon everything we have in common: desire, passion, vulnerability, a sense of humor, and a desire for connection and intimacy. All of that is the same. After the five-to-six film mark, you see that shift. No matter how off-the-wall the next film is, everyone&#39;s cheering for each film. It becomes this celebratory, affirming vibe. You&#39;re shielding your eyes at first, then you&#39;re watching and cheering at the same content.&#34;\n Find the streaming schedule for Hump! Greatest Hits, Volume 1 at  HumpFilmFest.com, with screenings happening tonight, June 26, and two evenings in early July. Tickets start at $25 before fees; the content is only available as a livestreamed feed, not video on demand (VOD).", "posttime": "2020-06-26 19:44:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "隔离,porn,萨维奇", "title": "驼峰！，没有隔离就不会发生的在线色情盛会", "title_en": "Hump!, the online porn fest that wouldn’t have happened without quarantine", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/dan-savages-first-online-only-hump-yeah-its-porn-but-theres-more-to-it/", "via": "", "real_tags": ["隔离", "porn", "萨维奇"]}, {"category": "", "categoryclass": "", "imagename": "02f6674848b55cd4e81ffc682971484a.jpg", "infoid": 1008389, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两名员工卡洛斯·加布里埃尔(Carlos Gabriel)和杰西卡·纳罗(Jessica Naro)表示，他们上周收到了特斯拉的解雇通知，此前他们为了避免冠状病毒而休了无薪假期。“圣何塞水星新闻”上周最先报道了加布里埃尔的解约通知。\n这两名员工都表示，特斯拉人力资源部本周联系了他们。如果纳罗承诺一个回归日期，她就有机会重返工作岗位。她拒绝了，因为她6岁的儿子的健康状况使他面临更高的风险。\n在特斯拉代表拒绝他录制后，加布里埃尔结束了通话。自那以后，他再也没有收到过回复，他相信自己已经不在特斯拉的工资单上了。\n上个月，特斯拉不顾公共卫生官员的要求，在工厂所在的阿拉米达县开设了弗里蒙特旗舰工厂。为了帮助解决安全问题，特斯拉高管强调，如果任何人觉得这样做不安全，他们都不会被迫重返工作岗位。\n在特斯拉重新开工之前，马斯克在5月份的一封电子邮件中告诉员工，如果你在这个时候回来工作感到不舒服，请不要觉得有义务这么做。\n特斯拉人力资源经理瓦莱丽·沃克曼更详细地阐述了特斯拉的政策。如果你生病或担心安全上班，请呆在家里，她写道。您可以使用您可用的PTO，或者如果您没有PTO，可以将这段时间视为未付费用而不受处罚。我们尊重您的决定。\n但是，当加布里埃尔和纳罗收到特斯拉的官方通知时，他们并没有感觉到他们的决定得到了尊重，他们被解雇的原因是“未能重返工作岗位”。\n这两名工人都呆在家里，因为他们觉得公司在保护工人免受致命病毒感染方面做得不够。据“华盛顿邮报”报道，这两名被解雇的工人并不是唯一担心的人：\n接受《华盛顿邮报》采访的六名员工也表达了他们对安全的担忧，其中一些人因为担心丢掉工作而不愿透露姓名。他们说，特斯拉没有遵循社会疏远的指导方针，对口罩和机器卫生的规定执行松懈。他们还抱怨该公司对新感染病例及其反应的透明度很低。\n在终止通知发出的前一天，加布里埃尔在特斯拉弗里蒙特工厂外的一个集会上发表了讲话，他在会上批评该公司的安全协议不够充分。他举着一块牌子，上面写着特斯拉不在乎人命。加布里埃尔认为他被解雇是对他的激进主义的报复。\n但这并不是特斯拉对此举的解释。在加布里埃尔与“水星新闻”分享的解雇电子邮件中，特斯拉提到加布里埃尔没有回复询问加布里埃尔何时重返工作岗位的电子邮件和语音邮件。加布里埃尔说，他觉得没有必要回应，因为有人告诉他，如果他觉得不安全，可以呆在家里。加布里埃尔和纳罗告诉华盛顿邮报，在解雇通知之前，他们都与他们的经理保持着定期联系。", "note_en": "Two workers, Carlos Gabriel and Jessica Naro, say that they  received termination notices from Tesla last week after taking unpaid time off in an effort to avoid the coronavirus. The San Jose Mercury News first  reported Gabriel&#39;s termination notice last week.\n Both workers say that they were contacted this week by Tesla&#39;s HR department. Naro was given the opportunity to come back to work if she committed to a return date. She declined because her 6-year-old son has a health condition that puts him at heightened risk.\n Gabriel ended his call after the Tesla rep refused to allow him to record it. He hasn&#39;t heard back since and believes he is no longer on Tesla&#39;s payroll.\n Last month, Tesla opened its flagship Fremont factory in  defiance of public health officials in Alameda County, where the factory is located. To help address safety concerns, Tesla executives emphasized that no one would be forced to come back to work if they felt unsafe doing so.\n &#34;If you feel uncomfortable coming back to work at this time, please do not feel obligated to do so,&#34;  Musk told employees in a May email prior to Tesla re-opening its factory.\n Tesla HR boss Valerie Workman spelled out Tesla&#39;s policy in more detail. &#34;if you are sick or have concerns with safely coming to work, please stay home,&#34; she wrote. &#34;You may use your available PTO or if you have none, may take the time as unpaid without penalty. We respect your decision.&#34;\n But Gabriel and Naro didn&#39;t feel like their decision was being respected when they received official notices from Tesla informing them that they were being terminated for “failure to return to work.”\n  Both workers have been staying home because they don&#39;t feel that the company has done enough to shield workers from contracting the deadly virus. The Washington Post reports that the two fired workers aren&#39;t alone in their concerns:\n Their concerns about safety are shared by a half-dozen workers who spoke with The Post, some on the condition of anonymity for fear of losing their jobs. They said that Tesla is failing to follow social distancing guidelines, with lax enforcement of rules concerning masks and sanitation of machinery. They also complain of little transparency by the company about new cases of infection, as well as its response.\n The day before the termination notices were sent out, Gabriel spoke at a rally outside Tesla&#39;s Fremont plant, where he criticized the company&#39;s safety protocols as inadequate. He carried a sign that said &#34;Tesla doesn’t care about human life.&#34; Gabriel believes his termination was retaliation for his activism.\n But that&#39;s not how Tesla explained the move. In its termination email, which Gabriel  shared with the Mercury News, Tesla cited Gabriel&#39;s failure to respond to emails and voicemails inquiring when Gabriel would return to work. Gabriel said he didn&#39;t feel a need to respond because he had been told he could stay home if he felt unsafe. Gabriel and Naro told The Washington Post that they had both been in regular contact with their managers prior to the termination notices.", "posttime": "2020-06-26 19:44:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,covid,factory,安全", "title": "因担心COVID而呆在家里的特斯拉工厂工人面临解雇", "title_en": "Tesla factory workers who stayed home due to COVID fears face termination", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/tesla-factory-workers-who-stayed-home-due-to-covid-fears-face-termination/", "via": "", "real_tags": ["特斯拉", "covid", "factory", "安全"]}, {"category": "", "categoryclass": "", "imagename": "620dae4229626ee37a27475f04dbbf53.png", "infoid": 1008388, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一款将您的日常工作应用程序融合为一体的新工具。它是您和您的团队的一体化工作区", "note_en": "A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team", "posttime": "2020-06-26 19:42:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ipad,working", "title": "在iPad上工作", "title_en": "Working on iPad", "transed": 1, "url": "https://www.notion.so/vercel/Working-on-iPad-ccefea4f9e06455da169c97b3fe054c1", "via": "", "real_tags": ["ipad", "working"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008387, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索意想不到的悬吊悖论或意外测试悖论悖论是关于一个人对未来事件发生时间的预期的悖论，他们被告知将在意想不到的时间发生。这一悖论适用于囚犯的绞刑，或突如其来的学校考试。\n没有就其确切性质达成共识，因此没有商定一项规范的决议。[1]逻辑分析的重点是真值，例如，把它认定为自我指涉的悖论。相反，对这一悖论的认识论研究集中在与知识相关的问题上；[2]例如，一种解释将其简化为摩尔悖论。[3]有些人认为这是哲学的一个重大问题。[4]。\n法官告诉一名被判刑的囚犯，他将在下周的某个工作日的中午被绞死，但处决会让囚犯大吃一惊。直到当天中午刽子手敲响他牢房的门，他才会知道绞刑的那一天。\n囚犯反思了他的判刑后得出结论，他将从绞刑中逃脱。他的推理分为几个部分。他首先得出结论，令人惊讶的绞刑不可能在周五，就好像他在周四还没有被绞死一样，只剩下一天了--所以如果他在周五被绞死，也不会令人惊讶。由于法官的判决规定绞刑会让他大吃一惊，他得出的结论是绞刑不可能在周五发生。\n然后，他解释说，意外绞刑也不能在周四，因为周五已经被取消了，如果他在周三中午之前还没有被绞死，绞刑肯定发生在周四，所以周四的绞刑也不会令人惊讶。按照类似的推理，他得出结论，绞刑也不可能发生在周三、周二或周一。他欣喜若狂地回到牢房，确信绞刑根本不会发生。\n下个星期，刽子手在周三中午敲响囚犯的门--尽管如此，他还是大吃一惊。法官说的一切都成真了。\n这一悖论的其他版本用突击消防演习、考试、突击测验、A/B测试启动或门后的狮子取代了死刑判决。[1]。\n由于出其不意这个词的含糊含义，很难将法官的声明表述成形式逻辑。[1]配方的尝试可能是：\n囚犯将于下周被绞死，根据绞刑将发生在(A)周的假设，(绞刑的)日期将不能从前一天晚上推断出来。[1]。\n根据这一声明，囚犯可以推断绞刑不会发生在一周的最后一天。然而，为了重现辩论的下一阶段(取消了一周的倒数第二天)，囚犯必须辩称，他从陈述(A)中推断绞刑不会发生在最后一天的能力意味着倒数第二天的绞刑并不令人惊讶。[1]但由于令人惊讶的含义已被限制为不能从绞刑将发生在一周内的假设中推断出来，而不是从语句(A)中推断出来，因此该论点被阻止了。[1]。\n这名囚犯将于下周被绞死，其日期将不能用这一陈述作为公理(B)的前一天晚上推断出来。[1]。\n惠誉已经证明，这一说法仍然可以用形式逻辑表达。[6]他使用悖论的一种等价形式，将一周的长度减少到只有两天，证明了虽然自我参照并不是在所有情况下都是非法的，但在这种情况下是非法的，因为这一陈述是自相矛盾的。\n已经提出了各种认识论公式，表明囚犯关于他未来将知道什么的默示假设，以及几个关于知识的似是而非的假设，是不一致的。\nChow(1998)[7]对这一悖论的一个版本进行了详细的分析，在这种悖论中，突然的绞刑发生在两天中的一天。将周的分析应用到意外绞刑的案例中(同样，为了简单起见，一周缩短为两天)，我们首先观察到，法官的声明似乎肯定了三件事：\nS2：如果绞刑发生在周一，那么囚犯在周日晚上就不会知道绞刑会发生在周一。\n学生3：如果绞刑发生在星期二，那么囚犯在星期一晚上不会知道绞刑会在星期二发生。\n作为第一步，囚犯认为周二绞刑的情景是不可能的，因为这导致了一个矛盾：一方面，到了S3，囚犯将无法预测星期一晚上的星期二绞刑；但另一方面，通过S1和消除过程，囚犯将能够预测星期一晚上的星期二绞刑。\n周的分析指出了囚犯推理中的一个微妙缺陷。不可能的不是星期二的绞刑。相反，不可能的情况是，绞刑发生在周二，尽管囚犯在周一晚上知道法官的断言S1、S2和S3都是真实的。\n囚犯的推理产生了悖论，之所以能够成功，是因为囚犯心照不宣地假设，在周一晚上，他会(如果他还活着的话)知道S1、S2和S3是真的。基于几个不同的理由，这一假设似乎是没有根据的。有人可能会争辩说，法官宣判某事是真的永远不能成为囚犯知道它是真的的充分理由。此外，即使囚犯现在知道某件事是真的，未知的心理因素也可能在未来抹去这一知识。最后，周建议，因为囚犯应该知道的陈述是关于他无法知道某些事情的陈述，所以有理由相信，意想不到的绞刑悖论只是摩尔悖论的一个更复杂的版本。一个合适的类比可以通过将一周的长度减少到只有一天来实现。然后，法官的判决变成：你明天将被绞死，但你不知道这一点。\n有人建议，囚犯的合理清除使一周中的任何一天都是有效的行刑日。\n蒂索特对我的教学表现出了类似的误解，当时我对他持续的闷闷不乐和几乎永久占用我的写字台感到恼火，我对他说，下周我要把你的妻子带到这里来，这样你就可以当面和她交谈，解决你的困难。我知道你不想见她，所以我不会告诉你她哪一天到；但你可以肯定，这周结束前你会见到她的。\n蒂索特知道他的妻子下周五不会被带到他面前，因为那样的话，他可以在周四晚上之前确定她一定会来，他可以让自己缺席。但同样，我也必须避免周四，否则当周三过去没有任何场面时，他会得到预先警告。蒂索特每隔一天就以类似的方式打发时间，他得出结论，他的妻子永远不会出人意料地出现在他面前喋喋不休；但在周四，他开门迎接的不仅是她，还有她的母亲，在我躲避的时候，两人都狠狠地打了他耳光，悄悄地判断，一个如此贫穷的逻辑学家理应得到他得到的一切。\n这一悖论也出现在路易斯·萨查尔(Louis Sachar)的儿童小说“路边算术”中。在其中一个故事中，老师朱尔斯女士计划在下周进行突击测验，但不会提前让全班同学知道。与经典的悖论不同的是，学生们一个接一个地取消日子，导致朱尔斯夫人放弃了这个想法。\n^a b c d e f g Chow，T.Y.(1998)。突如其来的考试或意想不到的吊死悖论(PDF)。美国数学月刊。105(1)：41-51。arxiv：数学/9903160。10.2307/2589525。联合包裹服务公司股价上涨2589525。\n罗伯特·宾克利(1968)。模态逻辑中的突击检查。“哲学杂志”。65(5)：127-136。10.2307/2024556。联合包裹服务公司股价上涨2024556。\n^Fitch，F.(1964)。预测悖论的歌德化表述。上午。菲尔。问题1(2)：161-164。联合包裹服务公司股价上涨20009132。\n^Chow，Ty.(1998)。突如其来的考试或意想不到的吊死悖论(PDF)。美国数学月刊。105(1)：41-51。arxiv：数学/9903160。10.2307/2589525。联合包裹服务公司股价上涨2589525。\nLevy，Ken(2009)。出其不意的考试悖论之解。南方哲学杂志。47(2)：131-158。CiteSeerX：10.1.1.1027.1486.。doi：10.1111/j.2041-6962.2009.tb00088.x.。上证综指上涨1435806。于2017年3月20日从原件存档。\n赖特，C.&&萨德伯里，A.(1977)。意外考试的悖论。“澳大拉西亚哲学杂志”。55：41-58。10.1080/00048407712341031。\nMargalit，A.&Amp；Bar-Hillel，M.(1983)。&#34；期待着意想不到的&#34；。菲罗索菲亚。13(3-4)：337-344。DOI：10.1007/BF02379182.。S2CID为143848294。\nChihara，C.S.(1985)。奥林、奎因和突击考试。哲学研究。47(2)：19-26。DOI：10.1007/bf00354146.。\n柯克汉姆，R.(1991)。关于悖论和一场出人意料的考试。菲罗索菲亚。21(1-2)：31-51。DOI：10.1007/bf02381968.\n弗朗西斯基，P.(2005)。分析悖论的二分法，考试出乎意料。哲学(法语)。32(2)：399-421。DOI：10.7202/011875ar.。英语翻译。\n加德纳，M.(1969)。意外绞死的悖论。意想不到的绞刑和其他*数学消遣。\n奎因，W.V.O.(1953)。关于一个所谓的悖论。思想。62(245)：65-66。DOI：10.1093/Mind/lxii.245.65.。\n索伦森，R.A.(1982)。预测悖论的顽固版本。“澳大拉西亚哲学杂志”。69(4)：355-362。10.1080/00048408212340761。\n克劳德·卡塞(1986)。论意想不到的吊死悖论。“美国物理学杂志”。54(4)：296-297。密码：1986AmJPh..54..296K。10.1119/1.14658。S2CID为120607488。", "note_en": "Jump to navigation  Jump to search  The  unexpected hanging paradox or  surprise test paradox is a  paradox about a person&#39;s expectations about the timing of a future event which they are told will occur at an unexpected time. The paradox is variously applied to a prisoner&#39;s hanging, or a surprise school test.\n There is no consensus on its precise nature and consequently a canonical resolution has not been agreed on.  [1]  Logical analyses focus on &#34;truth values&#34;, for example by identifying it as paradox of self-reference.  Epistemological studies of the paradox instead focus on issues relating to   knowledge;  [2] for example, one interpretation reduces it to  Moore&#39;s paradox.  [3] Some regard it as a &#34;significant problem&#34; for philosophy.  [4]\n    A judge tells a condemned prisoner that he will be hanged at noon on one weekday in the following week but that the execution will be a surprise to the prisoner. He will not know the day of the hanging until the executioner knocks on his cell door at noon that day.\n Having reflected on his sentence, the prisoner draws the conclusion that he will escape from the hanging. His reasoning is in several parts. He begins by concluding that the &#34;surprise hanging&#34; can&#39;t be on Friday, as if he hasn&#39;t been hanged by Thursday, there is only one day left - and so it won&#39;t be a surprise if he&#39;s hanged on Friday. Since the judge&#39;s sentence stipulated that the hanging would be a surprise to him, he concludes it cannot occur on Friday.\n He then reasons that the surprise hanging cannot be on Thursday either, because Friday has already been eliminated and if he hasn&#39;t been hanged by Wednesday noon, the hanging must occur on Thursday, making a Thursday hanging not a surprise either. By similar reasoning, he concludes that the hanging can also not occur on Wednesday, Tuesday or Monday. Joyfully he retires to his cell confident that the hanging will not occur at all.\n The next week, the executioner knocks on the prisoner&#39;s door at noon on Wednesday — which, despite all the above, was an utter surprise to him. Everything the judge said came true.\n Other versions of the paradox replace the death sentence with a surprise fire drill, examination, pop quiz, A/B test launch or a lion behind a door.  [1]\n  Formulation of the judge&#39;s announcement into  formal logic is made difficult by the vague meaning of the word &#34;surprise&#34;.  [1] An attempt at formulation might be:\n The prisoner will be hanged next week and the date (of the hanging) will not be deducible the night before from the assumption that the hanging will occur during the week (A).  [1]\n Given this announcement the prisoner can deduce that the hanging will not occur on the last day of the week. However, in order to reproduce the next stage of the argument, which eliminates the penultimate day of the week, the prisoner must argue that his ability to deduce, from statement (A), that the hanging will not occur on the last day, implies that a second-to-last-day hanging  would not be surprising.  [1] But since the meaning of &#34;surprising&#34; has been restricted to  not deducible from the assumption that the hanging will occur during the week  instead of  not deducible from statement (A), the argument is blocked.  [1]\n  The prisoner will be hanged next week and its date will not be deducible the night before using this statement as an axiom (B).  [1]\n Fitch has shown that this statement can still be expressed in formal logic.  [6] Using an equivalent form of the paradox which reduces the length of the week to just two days, he proved that although self-reference is not illegitimate in all circumstances, it is in this case because the statement is self-contradictory.\n  Various epistemological formulations have been proposed that show that the prisoner&#39;s tacit assumptions about what he will know in the future, together with several plausible assumptions about knowledge, are inconsistent.\n Chow (1998)  [7] provides a detailed analysis of a version of the paradox in which a surprise hanging is to take place on one of two days. Applying Chow&#39;s analysis to the case of the unexpected hanging (again with the week shortened to two days for simplicity), we start with the observation that the judge&#39;s announcement seems to affirm three things:\n S2:  If the hanging occurs on Monday, then the prisoner will not know on Sunday evening that it will occur on Monday.\n S3:  If the hanging occurs on Tuesday, then the prisoner will not know on Monday evening that it will occur on Tuesday.\n As a first step, the prisoner reasons that a scenario in which the hanging occurs on Tuesday is impossible because it leads to a contradiction: on the one hand, by  S3, the prisoner would not be able to predict the Tuesday hanging on Monday evening; but on the other hand, by  S1 and process of elimination, the prisoner  would be able to predict the Tuesday hanging on Monday evening.\n Chow&#39;s analysis points to a subtle flaw in the prisoner&#39;s reasoning. What is impossible is not a Tuesday hanging. Rather, what is impossible is a situation in which  the hanging occurs on Tuesday despite the prisoner knowing on Monday evening that the judge&#39;s assertions  S1,  S2, and  S3 are all true.\n The prisoner&#39;s reasoning, which gives rise to the paradox, is able to get off the ground because the prisoner tacitly assumes that on Monday evening, he will (if he is still alive) know  S1,  S2, and  S3 to be true. This assumption seems unwarranted on several different grounds. It may be argued that the judge&#39;s pronouncement that something is true can never be sufficient grounds for the prisoner  knowing that it is true. Further, even if the prisoner knows something to be true in the present moment, unknown psychological factors may erase this knowledge in the future. Finally, Chow suggests that because the statement which the prisoner is supposed to &#34;know&#34; to be true is a statement about his  inability to &#34;know&#34; certain things, there is reason to believe that the unexpected hanging paradox is simply a more intricate version of  Moore&#39;s paradox. A suitable analogy can be reached by reducing the length of the week to just one day. Then the judge&#39;s sentence becomes:  You will be hanged tomorrow, but you do not know that.\n It has been suggested that the prisoner’s logical elimination makes any day of the week a valid day for the execution.\n    Tissot showed a similar misunderstanding of my teaching when, exasperated by his continuing moroseness and his near-permanent occupancy of my writing desk, I said to him, &#39;Next week I am going to bring your wife here so that you can speak to her in person and sort out your difficulties. I know you don&#39;t want to see her, and so I shall not tell you which day she will arrive; but you can be sure that you&#39;ll meet her before the week is out.&#39;\n Tissot knew his wife would not be brought to confront him next Friday, because in that case he could be certain by Thursday evening that she must be coming, and he could make himself absent. But equally, I would also have to avoid Thursday, since otherwise he would be forewarned when Wednesday passed without a scene. Dismissing every other day in a similar manner, Tissot concluded that his wife could never show up unexpectedly to harangue him; but on Thursday he answered the door to be greeted not only by her, but also by her mother, both of whom boxed him soundly about the ears while I made myself scarce, quietly judging that so poor a logician deserved everything he got.\n The paradox also appears in the children’s novel   More Sideways Arithmetic From Wayside School by  Louis Sachar. In one of the stories, the teacher, Mrs. Jewls, plans on having a pop quiz the following week, but will not let the class know in advance. Unlike in the classic paradox, the students eliminating the days one by one causes Mrs. Jewls to abandon the idea.\n    ^     a     b     c     d     e     f     g   Chow, T. Y. (1998).  &#34;The surprise examination or unexpected hanging paradox&#34;  (PDF).  The American Mathematical Monthly.  105 (1): 41–51.  arXiv:  math/9903160.  doi: 10.2307/2589525.  JSTOR  2589525.\n  ^   Binkley, Robert (1968). &#34;The Surprise Examination in Modal Logic&#34;.  The Journal of Philosophy.  65 (5): 127–136.  doi: 10.2307/2024556.  JSTOR  2024556.\n   ^   Fitch, F. (1964). &#34;A Goedelized formulation of the prediction paradox&#34;.  Am. Phil. Q.  1 (2): 161–164.  JSTOR  20009132.\n ^   Chow, T. Y. (1998).  &#34;The surprise examination or unexpected hanging paradox&#34;  (PDF).  The American Mathematical Monthly.  105 (1): 41–51.  arXiv:  math/9903160.  doi: 10.2307/2589525.  JSTOR  2589525.\n  Levy, Ken (2009).  &#34;The Solution to the Surprise Exam Paradox&#34;.  Southern Journal of Philosophy.  47 (2): 131–158.  CiteSeerX   10.1.1.1027.1486.  doi: 10.1111/j.2041-6962.2009.tb00088.x.  SSRN   1435806. Archived from  the original on 20 March 2017 .\n   Wright, C. &amp; Sudbury, A. (1977). &#34;the Paradox of the Unexpected Examination&#34;.  Australasian Journal of Philosophy.  55: 41–58.  doi: 10.1080/00048407712341031.\n Margalit, A. &amp; Bar-Hillel, M. (1983). &#34;Expecting the Unexpected&#34;.  Philosophia.  13 (3–4): 337–344.  doi: 10.1007/BF02379182.  S2CID  143848294.\n Chihara, C. S. (1985). &#34;Olin, Quine, and the Surprise Examination&#34;.  Philosophical Studies.  47 (2): 19–26.  doi: 10.1007/bf00354146.\n Kirkham, R. (1991). &#34;On Paradoxes and a Surprise Exam&#34;.  Philosophia.  21 (1–2): 31–51.  doi: 10.1007/bf02381968.\n Franceschi, P. (2005).  &#34;Une analyse dichotomique du paradoxe de l&#39;examen surprise&#34;.  Philosophiques (in French).  32 (2): 399–421.  doi:  10.7202/011875ar.    English translation.\n Gardner, M. (1969). &#34;The Paradox of the Unexpected Hanging&#34;.  The Unexpected Hanging and Other * Mathematical Diversions.\n Quine, W. V. O. (1953). &#34;On a So-called Paradox&#34;.  Mind.  62 (245): 65–66.  doi: 10.1093/mind/lxii.245.65.\n Sorensen, R. A. (1982). &#34;Recalcitrant versions of the prediction paradox&#34;.  Australasian Journal of Philosophy.  69 (4): 355–362.  doi: 10.1080/00048408212340761.\n Kacser, Claude (1986). &#34;On the unexpected hanging paradox&#34;.   American Journal of Physics.  54 (4): 296–297.  Bibcode: 1986AmJPh..54..296K.  doi: 10.1119/1.14658.  S2CID  120607488.", "posttime": "2020-06-26 19:41:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "吊吊,hanging,囚犯", "title": "意想不到的吊吊悖论", "title_en": "Unexpected Hanging Paradox", "transed": 1, "url": "https://en.wikipedia.org/wiki/Unexpected_hanging_paradox", "via": "", "real_tags": ["吊吊", "hanging", "囚犯"]}, {"category": "", "categoryclass": "", "imagename": "1cf54b72f995d878760d0659a17dfb0b.jpg", "infoid": 1008385, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家美国公司的最新尝试被称为“智能商店”(Smart Stores)。在这个项目中，亚马逊为实体店提供了软件，以维护他们在商店中的库存的数字日志，并向他们提供二维码。\n当消费者走到商店，用亚马逊应用程序扫描这个二维码时，他们会看到商店提供的一切，以及顾客的任何折扣和过去的评论。他们可以选择商品并使用Amazon Pay付款。印度的Amazon Pay支持一系列支付服务，包括广受欢迎的UPI，以及借记卡和信用卡。\n亚马逊告诉TechCrunch，它在两个月前就试行了这个项目，在看到早期的吸引力后，现在正式推出了这个项目。该公司表示，从夫妻店到包括Big Bazaar，MedPlus在内的大型零售连锁店，以及更多的超市，已经有1万多家商店部署了该公司的系统。\n该公司表示，这些“数字店面”对消费者和店主都是双赢的。消费者不需要呆在商店里担心处理塑料卡或现金-他们使用Amazon Pay也会获得奖励。\n客户还可以使用亚马逊的稍后付款功能，该功能使他们能够分期付款。所有这一切都意味着商家的客流量增加了，销售额也在提高。亚马逊表示，它不会从商家或客户那里收取任何提成。\n最近几个季度，该公司一直在积极与印度的实体店合作，利用它们在印度的巨大影响力来扩大其配送网络和仓库，甚至仅仅依靠它们的库存来推动销售。\n该公司进军占印度绝大多数销售额的实体零售市场之际，Facebook、Flipkart、谷歌和Reliance Jio平台最近筹集了152亿美元，也在争先恐后地抢占这一市场。周四，谷歌表示，计划在今年年底前向印度的商家提供贷款。\n这些夫妻店提供各式各样的商品，都是家庭式经营，工资很低，租金很低，甚至没有租金。由于它们无处不在(据行业估计，印度有超过3000万家社区商店)，没有零售巨头能提供更快的送货速度。最重要的是，他们的经济状况往往比大多数数字同行更好。\n本地化是新的全球商业计划。在印度，#O2O将以比在线零售更快的速度成为主流。https://t.co/NHIeFr2nJ6。\n亚马逊支付已经被数百万家当地商店接受，我们正试图通过Smart Stores让客户在当地商店的购买体验变得更加方便和安全。此外，通过EMIS、银行优惠和奖励，我们寻求使这些购买对客户来说更实惠和更有价值，并帮助增加商家的销售额。“。Amazon Pay首席执行官Mahendra Nerurkar在声明中称。\n亚马逊对印度实体零售市场的兴趣虽然迟缓，但日益增长，这并不令人意外。该公司通常比大多数公司需要更长的时间来研究市场，然后增加自己的宣传来应对这些挑战。最近的另一个例子是：它进军印度的外卖市场。\n尽管人们对实体零售市场普遍感兴趣，但有一件事还没有公司谈论，那就是他们计划如何从商业上激励这些商家。这些公司建立的技术解决方案无疑推动了它们的销售，但这些小企业中有相当一部分采取现金和少报收入的方式来节省税收。对于他们中的许多人来说，这种激励是任何其他激励的倍数。", "note_en": "The American firm’s latest attempt is called “ Smart Stores.” For this program, Amazon is providing physical stores with software to maintain a digital log of the inventory they have in the shop, and supplying them with a QR code.\n When consumers walk to the store and scan this QR code with the Amazon app, they see everything the shop has to offer, as well as any discounts and past reviews from customers. They can select the items and pay for it using Amazon Pay. Amazon Pay in India supports a range of payments services including the popular UPI, and debit and credit cards.\n  Amazon told TechCrunch that it piloted this project two months ago and is formally launching it now after seeing the early traction. More than 10,000 stores, ranging from mom and pop stores to big retail chains including Big Bazaar, MedPlus and More Supermarkets have deployed the company’s system, it said.\n The company said these “digital storefronts” are a win-win for both consumers and shop owners. Consumers do not need to stay inside the store and worry about handling plastic cards or cash — and they will also get rewards for using Amazon Pay.\n  Customers also get the ability to use Amazon’s Pay Later feature that enables them to pay in installments. All of this means that merchants are increased footfalls and improving their sales. Amazon said it is not taking any cut from merchants or customers.\n The company has been aggressively engaging with physical stores in India in recent quarters, using their vast presence in the nation to  expand its delivery network and warehouses and even just  relying on their inventory to drive sales.\n The company’s push in the physical retails, which accounts for the vast majority of sales in India, comes as Facebook, Flipkart, Google, and Reliance Jio Platforms, which  recently raised $15.2 billion, also  race to capture this market. On Thursday, Google said  it plans to offer loans to merchants in India by the end of this year.\n These mom-and-pop stores offer all kinds of items, are family-run and pay low wages and little to no rent. Since they are ubiquitous (there are more than 30 million neighborhood stores in India, according to industry estimates), no retail giant can offer a faster delivery. And on top of that, their economics are often better than most of their digital counterparts.\n Local is new global business plan.  #O2O will be mainstream faster than &#34;online retail&#34; in India.  https://t.co/NHIeFr2nJ6\n “Amazon Pay is already accepted at millions of local shops, we are trying to make customers’ buying experience at local shops even more convenient and safe through Smart Stores. Further, through EMIs, bank offers and rewards, we seek to make these purchases more affordable and rewarding for customers, and help increase sales for merchants.” said Mahendra Nerurkar, chief executive of Amazon Pay, in a statement.\n Amazon’s tardy but increasingly growing interest in the Indian physical retails market is not surprising. The company often takes longer than most firms to study the market and then adds its own spin to tackle those challenges. Another recent case in point: Its  foray into food delivery market in India.\n Despite ubiquitous interest in the physical retails market, one thing that  that no company is talking about yet is just how they plan to commercially incentivize these merchants. The technology solutions built by these companies is unarguably driving sales for them, but a significant number of these small businesses take cash and under report their revenue to save tax. That incentive is multifold of any other incentive for many of them.", "posttime": "2020-06-26 19:21:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,推出,launches,商店", "title": "\n亚马逊在印度推出“智能商店”赢得夫妻店", "title_en": "\n\t\t\t\tAmazon launches ‘Smart Stores’ in India to win mom and pop\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/amazon-launches-smart-stores-in-india-to-win-mom-and-pop/", "via": "", "real_tags": ["amazon", "亚马逊", "推出", "launches", "商店"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008384, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "维珍澳大利亚航空的管理人员表示，他们已承诺将这家遭受重创的航空公司出售给美国私募股权集团贝恩资本(Bain Capital)。\n上周五达成的这笔交易，将使债权人对该航空公司的未来几乎没有发言权，除非他们采取法律行动推翻该交易。\n管理人员是会计师事务所德勤(Deloitte)的合伙人，他们表示，他们在周五上午与贝恩签署了一项协议，该协议将保留数千个工作岗位，并对航空公司进行资本重组。\n如果交易得以进行，昆士兰最终还将获得该航空公司高达5%的股份，此前该公司同意提供约2亿美元的现金和税费减免-此举旨在防止该航空公司的总部在新南威尔士州的竞争报价下迁往悉尼。\n由于工会周四公开支持这笔交易，剩下的最后一个绊脚石是一群欠下约20亿美元的债券持有人，他们在本周晚些时候提出了收购该航空公司的报价。\n该组织的一名发言人抨击管理人员没有考虑这项提议，他表示，该组织将继续推动这一提议。\n“否则，由于管理人今天的决定，贝恩提议的必然结果是给投资者留下一个非常糟糕的复苏，这显然是一个不公平的结果，”他说.。\n首席行政官沃恩·斯特劳布里奇(Vaughan Strawbridge)告诉澳大利亚卫报(Guardian Australia)，出售过程于8周前开始，已经“创造了结果的确定性，不仅是为了出售，也是为了航空公司和就业机会”。\n他表示，贝恩与竞争对手赛勒斯资本合伙公司(Cyrus Capital Partners)之间的谈判一直很困难，并驳斥了赛勒斯的指控，即管理人没有与之接触，也没有回复电话。\n为了解决维珍澳大利亚航空迫在眉睫的现金危机，贝恩已同意向该航空公司提供1.25亿美元贷款，斯特劳布里奇表示，这笔钱应该足以让维珍澳大利亚航空度过8月份，届时债权人将举行会议。\n但债权人(包括该航空公司1万名员工和欠下20亿美元的债券持有人)将没有发言权，无法决定出售过程是否会继续进行。\n斯特劳布里奇说：“我们已经同意出售这项业务，我们有这种销售力。”\n“我们一直说我们在寻找6月底前达成有约束力的协议，这就是我们所做的。\n“如果我们不走上具有约束力的销售协议的道路，那么我们就不会为航空公司实现结果的确定性，也不会实现就业的确定性。”\n他表示，债权人将在会上投票决定这笔交易是否通过一种名为公司安排契约的机制完成，但他补充称：“这不是我们完成交易的唯一途径”。\n斯特劳布里奇拒绝透露贝恩总共将支付多少，新的维珍澳大利亚将保留多少工作岗位，以及债权人将获得多少68亿美元的欠款。\n在此之前，竞争对手赛勒斯资本合伙公司(Cyrus Capital Partners)于周五上午戏剧性地退出了竞选，抨击管理人员未能与其接触并回复电话。\nCyrus表示，它上周提交了报价，但“自那以后，管理人员没有回复过电话、电子邮件，也没有与Cyrus进行有意义的接触，以推进其报价”。\n该公司表示，在周四的竞标之后，又推出了一项更优惠的方案，将“提高交易价值，提高无担保债券持有人的回报，并为管理人提供更多确定性”。\n赛勒斯说：“除了收到确认函外，这封信也没有收到任何回应。”\n尽管提出了实质性的改进，但管理人员仍未与Cyrus就其报价进行接触。\n斯特劳布里奇说，赛勒斯的团队是“一群伟大的人”。\n他说：“在整个过程中，我们真的很喜欢与他们合作，我们花了很多时间与他们在一起。”\n“我们四位行政人员和我们的顾问周二花了两个多小时与他们一起审阅他们的商业计划，审阅他们的提案。\n“我对他们的评论感到失望--我理解他们的不安，我完全理解。”\n此举还将债券持有人拒之门外，他们本周提出了一项最新提议，拟向该航空公司注入10亿美元，并将其在证券交易所重新上市。\n斯特劳布里奇说，这项提议也经过了审查，但它是高度有条件的，不具约束力。\n他们表示，这笔交易“支持保罗·斯库拉(Paul Scurrah)目前领导的管理团队，以及他们对航空公司的改进计划”，表明斯库拉至少在短期内将继续担任首席执行官。\n在冠状病毒旅行限制大幅削减乘客数量，莫里森政府拒绝了其一再提出的纾困请求后，维珍澳大利亚航空于4月份崩溃进入破产管理程序。\n斯特劳布里奇说：“贝恩资本对这项业务提出了强有力的、令人信服的报价，这将确保澳大利亚第二家航空公司、数千名员工及其家人的未来，并确保澳大利亚继续享受竞争激烈的航空业带来的好处。”\n从我们被任命的第一天起，我们就专注于实现一家重组后的、可持续的和盈利的航空公司能够向所有利益相关者提供的可能的最佳结果。\n“在短短八周多一点的时间里，这是一个非常积极的结果。我们当然对各方表现出的兴趣程度感到鼓舞，尽管当时的市场环境令人眼花缭乱，我们的最后两家集团是如何接近他们的出价的，以及对业务的支持是如何得到如此多方面的支持。“\n选择贝恩资本作为优先竞标者对以运输工人工会(Transport Workers Union)为首的工会是一个打击，因为这家投资集团计划成立一家规模小于其他竞标者的航空公司，而且在美国有破坏工会的记录。\n然而，TWU全国秘书迈克尔·凯恩(Michael Kaine)表示，“贝恩提出了一个坚实的报价，以确保行政官员的建议，我们很高兴与他们合作，制定让航空公司重新站稳脚跟的计划”。\n他再次呼吁莫里森政府帮助遭受冠状病毒危机重创的航空业，引入一项“航空保管员”一揽子计划，以便在9月份按计划切断支付给工人的“工作保管员”工资的情况下，保持资金流动。\n维珍澳大利亚航空(Virgin Australia)规模更大的竞争对手澳航(Qantas)周四裁员6000人，并宣布融资19亿美元。该公司告诉市场，国际航班至少在一年内不会恢复。\n凯恩说：“维珍航空和澳航都需要政府的财政援助、支持和指导，以渡过未来几个月的困难时期，因为航空旅行举步维艰。”", "note_en": "Virgin Australia’s administrators say they have committed to selling the stricken airline to US private equity group Bain Capital.\n The deal, agreed on Friday, would leave creditors owed $6.8bn with little say in the future of the airline unless they take legal action to overturn the deal.\n The administrators, partners at accounting firm Deloitte, said they signed a deal with Bain on Friday morning that would retain thousands of jobs and recapitalise the airline.\n Queensland will also end up with as much as 5% of the airline if the deal goes ahead after agreeing to tip in about $200m in cash and tax and fee breaks – a move that acts to prevent the airline’s headquarters shifting to Sydney under a rival offer from NSW.\n With unions publicly backing the deal on Thursday, the last remaining stumbling block is a group of bondholders owed about $2bn, who lobbed a late bid for the airline during the week.\n A spokesman for the group slammed the administrators for failing to consider the proposal, which he said the group would continue to push for.\n “Otherwise, as a result of the administrator’s decision today, the inevitable outcome of the Bain proposal is that investors are left with a very poor recovery, which is a manifestly unjust outcome,” he said.\n Lead administrator Vaughan Strawbridge told Guardian Australia the sale process, which kicked off eight weeks ago, had created “certainty of an outcome, not just for a sale but for the airline and for jobs”.\n He said between Bain and rival bidder Cyrus Capital Partners had been difficult and rejected allegations made by Cyrus that the administrators did not engage with it or return phone calls.\n To solve Virgin Australia’s immediate cash crisis, Bain has agreed to loan the airline $125m, which Strawbridge said should be enough to see the airline through until August, when creditors are due to meet.\n But creditors, who include the airline’s 10,000 staff and bondholders owed $2bn, will get no say in whether the sale process goes ahead.\n “We have agreed to sell the business, and we’ve got that power of sale,” Strawbridge said.\n “We’ve always said we were looking for binding agreements by the end of June, and that’s what we’ve done.\n “If we didn’t go down the path of a binding sale agreement then we wouldn’t achieve certainty of outcome for the airline or certainty of jobs.”\n He said creditors at the meeting would vote on whether the transaction was completed through a mechanism called a deed of company arrangement, but added: “it’s not the only way we can complete”.\n Strawbridge declined to say how much Bain would pay in total, how many jobs would be kept by the new  Virgin Australia or how much creditors owed $6.8bn would receive.\n The move came after rival bidder Cyrus Capital Partners dramatically quit the race on Friday morning, blasting the administrators for failing to engage with it and return phone calls.\n  Cyrus said it delivered a bid last week but “since then, the administrators have not returned calls, emails, or meaningfully engaged with Cyrus to progress its offer”.\n It said the bid was followed up on Thursday with a sweetened package that would “increase the value of the transaction, improve the return to unsecured bondholders and deliver more certainty for the administrators”.\n “This too received no response other than an acknowledgement of receipt,” Cyrus said.\n “Despite the material improvements put forward, the administrators have still not engaged with Cyrus on its offer.”\n Strawbridge said Cyrus’s team were “a great group of people”.\n “We’ve really enjoyed working with them throughout this process, we’ve spent a lot of time with them,” he said.\n “All four of us administrators and our advisers spent more than two hours with them on Tuesday going through their business plan, going through their proposal.\n  “I’m disappointed in their comments – I understand they’re upset, I totally get it.”\n The move also leaves out in the cold the bondholders, who this week lobbed a late proposal to tip $1bn into the airline and re-float it on the stock exchange.\n Strawbridge said this proposal had also been examined but it was highly conditional and non-binding.\n  They said the deal “supports the current management team led by Paul Scurrah and their improvement plan for the airline”, indicating Scurrah will continue as chief executive for at least the short term.\n Virgin Australia collapsed into administration in April after coronavirus travel restrictions slashed passenger numbers and the Morrison government rebuffed its repeated requests for a bailout.\n “Bain Capital has presented a strong and compelling bid for the business that will secure the future of Australia’s second airline, thousands of employees and their families and ensure Australia continues to enjoy the benefits of a competitive aviation sector,” Strawbridge said.\n “From day one of our appointment, we have focused on achieving the best possible outcomes that a restructured, sustainable and profitable airline can deliver to all stakeholders.\n “In just over eight weeks, this is a very positive outcome. We have certainly been heartened by the levels of interest shown by parties, in spite of the prevailing covid-induced market conditions, how our final two groups have approached their bids, and how support for the business has come from so many quarters.”\n The selection of Bain as preferred bidder is a blow to unions, led by the Transport Workers Union, because the investment group plans a smaller airline than other bidders and has a track record of union-busting in the US.\n However, TWU national secretary Michael Kaine said that “Bain put forward a solid bid to secure the administrator’s recommendation and we are happy to work with them on the plan for getting the airline back on its feet”.\n He repeated his call for the Morrison government to aid the airline sector, which has been devastated by the coronavirus crisis, by introducing an “aviationkeeper” package to keep money flowing if jobkeeper payments to workers are cut off as planned in September.\n  Virgin Australia’s bigger rival,  Qantas, slashed 6,000 jobs and announced a $1.9bn capital raising on Thursday, telling the market that international flights would not resume for at least a year.\n “Both Virgin and Qantas need financial assistance, support and direction from the government on weathering the difficult months ahead as air travel limps along,” Kaine said.", "posttime": "2020-06-26 19:20:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "澳大利亚,australia,航空公司", "title": "维珍澳大利亚管理人员同意将航空公司出售给贝恩资本", "title_en": "Virgin Australia administrators agree to sell airline to Bain Capital", "transed": 1, "url": "https://www.theguardian.com/business/2020/jun/26/virgin-australia-administrators-agree-to-sell-airline-to-american-private-equity-firm-bain-capital", "via": "", "real_tags": ["澳大利亚", "australia", "航空公司"]}, {"category": "", "categoryclass": "", "imagename": "68481f3d84489d8fbe7fde83b231176c.gif", "infoid": 1008383, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国最大的投资银行摩根大通(JP Morgan)再也没有Perl了。最后一个Perl代码于2019年退役。\n银行中有几个Perl脚本，大约在2018年，总计10k LOC，最初是在20年前编写的。\n这就是可以发现的一切，搜索覆盖了5000万行代码和数千台服务器的存储库，所有可以访问和解释的东西。\n我当时正在那里工作，接到了一项不幸的任务去调查这件事。(小贴士：如果你看到路过的关于一些旧系统的电子邮件，不要回复，否则人们可能会利用这个机会让你做这项工作)。\n我说的是“研究一下”，而不是升级、重写或退役，因为这些词不准确。处理旧的潜在关键系统的第一步是了解它们，然后再考虑是否可以或应该做任何事情。\n第二步(如果有)是添加日志记录，以尝试捕获正在使用的内容。最终未使用的可以退役。变得琐碎或过时的事情可以解决(例如，对getcorecount.pl的调用可以由内置API调用代替)。\n超过一半的脚本最终被证明是未使用的(或足够接近)，可以安全地退役。剩下几个脚本要处理，总共有几千行。\n生产中活跃的Perl的最后几个部分是在2006年左右编写的，根据源代码控制历史记录，从那以后几乎没有人碰过它。\n那里有一个存储子系统的建筑部件。简而言之，它类似于AWS S3。\nPerl在它的时代被认为是一种粘合语言，用于编写短小的脚本来将东西粘合在一起，就像bash脚本一样，但复杂性要高出一个档次。当Perl代码将一些低级别的东西粘合在一起时，这并不令人惊讶。\n而Perl代码从一开始就基本是原始的。“整个”的其余部分就不是了。\n存储是许多项目的基本需求。最初只是一个构建块在几周内被黑客入侵，但在整个业务中的使用量迅速增长。\n整个公司都创建了额外的集成和API来与之交互(不是在Perl中，也不一定在主repo中)。它得到了广泛的使用，并建立在更多的基础上。\n十年来，它成为存储大量和各种数据、存储每日报告、存储风险分析结果、市场数据、过去和未来交易的首选解决方案。考虑csv/xlsx/pdf可能涵盖的任何用例(并在银行带动数十亿美元)。\n[注：这意味着人工使用和程序化使用，这是最敏感的处理方式。人类依赖的系统在临界性和影响方面天生就是有限的(人类只能在物理上尽可能快地单击，并且会对未按预期工作的事情发出警报)。然而，自动化系统有无限的灾难潜力，因为它们可能会以“机器速度”无休止地反复故障，并驱动其他相关系统故障，有时甚至是静默的。]。\n当然，在依赖它的数千个应用程序和开发人员中，没有一个人意识到他们最终依赖于一堆Perl。大概有两个人会认识这个话题。(在任何组织中，无论规模有多大，只有1-3个人熟悉任何给定的系统)。\n在分析结束时，很明显Perl每天推动数十亿美元，可能是数万亿美元。它是摩根大通最关键的3个系统的竞争者，因为它的使用在摩根大通无处不在。这可能是地球上最关键的系统之一，因为世行推动了美国经济和世界的很大一部分。\n结论很简单，这是不能退役的，因为它已经被使用了。\n[我将省去导致结论的1001个因素，一些细节最好不要披露。]。\n相反，必须将其重写为开发人员积极维护和理解的内容。\n重写将在Python2.6上运行，因为Python2.6是非常棒且稳定的…。更重要的是，它是RHEL 6附带的版本，也就是它运行的地方。\n[虽然替代版本运行在python2.6上，但它也可以在python2.7和python3.7上运行。通过对细微差别的笨拙了解和对依赖项的严格管理，可以制作在任何地方都能运行的小型软件。最初的项目在十多年的时间里运行良好，重写的时间也一样长。直到可能有人不得不在2030年把它挖出来，并为RHEL 9做出调整。]。\n长话短说，剧本经过了广泛的重写和测试。(跳过关于测试如此重要的软件的叙述，否则文章将长50页)。", "note_en": "There is no more Perl at  JP Morgan, the largest investment bank in the US. The last Perl code was decommissioned in 2019.\n   There were a few Perl scripts in the bank circa 2018 totaling in the order of 10k LOC and originally written up to 2 decades ago.\n This is everything that could be discovered, the search covering repositories with 50M lines of code and thousands of servers, everything that could be accessed and accounted for really.\n I was working there at the time and got the unfortunate task to look into it. (Tip: I you see emails passing by about some old systems, don’t reply or people might take the opportunity to get you to do the work).\n I say “look into it” and not upgrade or rewrite or decommission because these words are not accurate. The first step in dealing with old potentially-critical systems is to understand them, before considering whether anything can or should be done.\n The second step, if any, is to add logging to try to capture what is being used. What is ultimately unused can be decommissioned. What became trivial or obsolete can be worked away (e.g. call to  getcorecount.pl can be replaced by a built-in API call).\n More than half of the scripts turned out to be unused (or close enough) and could be safely decommissioned. Leaving a few scripts to deal with, totaling a couple thousand lines.\n  The last bits of Perl active in production were written circa 2006 and practically untouched since, as per the source control history.\n There were building pieces of a storage subsystem. It is similar to AWS S3, to summarize in one word.\n Perl was known in its era to be a glue language, used to write short scripts to glue things together, like a bash script but one notch above in complexity. This shouldn’t come as a surprise that Perl code was gluing some low level things together there.\n While the Perl bits were mostly pristine since inception. The rest of “the whole” was not.\n Storage is a fundamental need of many projects. What started as a building block hacked in over a few weeks quickly grown in usage across the business.\n Additional integrations and API were created across the company to interface with it (not in Perl and not necessarily in the master repo). It got used extensively and built upon some more.\n Over the decade, it became the go-to solution to store numerous and various data, to store daily reports, store risk analysis results, market data, past and future transactions. Consider any use case that could be covered by a csv/xlsx/pdf (and drive billions of dollars in a bank).\n [Note: This means both human and programmatic usage, which is the most sensitive to deal with. Systems that are depended upon by humans are inherently limited in criticality and impact (humans can only click so fast as physically possible and would raise the alarm on things not working as expected). Whereas automated systems have an infinite potential for catastrophe, as they can fail endlessly and repeatedly at “machine speed” and drive other dependent systems to fail, sometimes silently.]\n Of course out of the thousands of applications and developers relying on it, none of them suspected they were ultimately depending on a bunch of Perl. There’s maybe 2 people who will recognize the topic. (In any organization, no matter how large, there are only 1-3 people who are familiar with any given system).\n At the end of the analysis, it is clear that the Perl was driving billions of dollars per day, possibly trillions. It is a contender for the top 3 most critical system in the bank as usage is ubiquitous in JP Morgan. It may be one of the most critical systems in the planet, as the bank drives a good chunk of the US economy and the world.\n The conclusion is plain and simple, this can’t be decommissioned because it’s used.\n [I will spare you the 1001 factors leading to the conclusion, some details are better left undisclosed.]\n It will have to be rewritten instead, into something that’s actively maintained and understood by developers.\n    The rewrite will work on python 2.6 because python 2.6 is great and stable… and more importantly it’s the version that’s shipped with RHEL 6 where this is running.\n [While the replacement is running on python 2.6, it is working on python 2.7 and python 3.7 too. It’s possible to make small software that work everywhere with an unwieldy knowledge of the small differences and a scrupulous management of dependencies. The original project worked well for over a decade, the rewrite was made to live as long. Until maybe somebody has to  dig it up in 2030 and make adjustments for RHEL 9.]\n Long story short, the scripts were rewritten and tested extensively. (Skipping the narrative on testing extremely critical software of that magnitude or the article will be 50 pages longer).", "posttime": "2020-06-26 19:19:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,banks", "title": "银行在2020年还在使用Perl吗？答案是否定的", "title_en": "Are Banks Still Using Perl in 2020? The answer is no", "transed": 1, "url": "https://thehftguy.com/2020/06/26/are-banks-still-using-perl-in-2020-the-answer-is-no/", "via": "", "real_tags": ["2020", "banks"]}, {"category": "", "categoryclass": "", "imagename": "a157df88d86711617fd59a219a370752.jpeg", "infoid": 1008382, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌宣布，它将开始向出版商支付授权“高质量”内容的费用，这是一项即将到来的倡议，它将其描述为一种“新闻体验”。它说，这项服务是更好地支持出版商的倡议的一部分，无疑是为了抵御有关它正在损害新闻网站的批评。这也可能证实今年早些时候的传言，即谷歌计划推出一项与Apple News+很像的新闻服务。\n到目前为止，谷歌已经与澳大利亚、德国和巴西的出版商签约。谷歌副总裁布拉德·本德(Brad Bender)在一篇博客文章中写道：“这个项目将帮助参与的出版商通过增强的讲故事体验来实现内容货币化，让人们更深入地了解更复杂的故事，了解更多信息，并接触到不同问题和兴趣的世界。”\n在一项新举措中，谷歌将向出版商支付费用，让他们允许读者访问提供订阅服务的网站上的付费文章。谷歌写道：“这将让付费出版商扩大他们的受众，并为人们打开一个阅读他们通常不会看到的内容的机会。”\n今天，我们宣布了一项许可计划，向出版商支付高质量内容的费用，以获得今年晚些时候推出的新新闻体验。这项计划将帮助参与的出版商通过增强的讲故事体验将其内容货币化，让人们更深入地了解更复杂的故事，了解更多信息，并接触到不同问题和兴趣的世界。我们将从全球多个国家的出版商开始，不久还会有更多的出版商。\n这项服务将首先在谷歌的新闻和探索网站上推出。至于具体的出版商，该公司表示，它与德国的明镜集团(Spiegel Group)、澳大利亚的昆士兰和InDaily以及巴西的Diario Associados签约。InDaily董事总经理保罗·哈姆拉(Paul Hamra)表示：“在当地新闻面临压力的情况下，在安全和精心策划的环境中，为我们的优质内容找到新的频道和新的受众是当务之急。”\n谷歌因在其搜索页面上显示新闻片段和其他内容时未能向新闻机构支付费用而受到抨击，特别是在欧洲。法国最近命令谷歌与出版商就此类支付进行谈判，而谷歌则坚称，它既不出售搜索，也不出售点击。\n谷歌表示，它正在投资新闻合作伙伴关系，并探索与出版商合作的新方式，而这一新的合资企业似乎是朝着这个方向迈出的新一步。在新冠肺炎疫情爆发后，该公司还通过新闻紧急救济基金、免收广告费和1,500万美元的活动，向5,300个地方新闻网站提供了资金。\n然而，出版商，特别是地方新闻网站继续以前所未有的速度关闭，剥夺了公民宝贵的信息资源。最近的一些关闭是由于大流行，但从长远来看，Facebook和谷歌一直在从过去流向当地每日和每周新闻服务的广告收入中获利。\n谷歌没有透露新服务将采取何种形式的其他细节，但承诺我们将在“未来几个月”了解更多信息。", "note_en": "Google has  announced that it will start paying publishers to license “high-quality” content in an upcoming initiative it’s describing as a “news experience.” It said the service is part of an initiative to better support publishers and no doubt an effort to fend off criticism that it’s harming news sites. It could also confirm rumors from  earlier this year that Google planned to launch a news service much like Apple News+.\n So far, Google has signed publishers in Australia, Germany and Brazil. “This program will help participating publishers monetize their content through an enhanced storytelling experience that lets people go deeper into more complex stories, stay informed and be exposed to a world of different issues and interests,” Google VP Brad Bender wrote in a blog post.\n  In one new initiative, Google will pay publishers to give readers access to paywalled articles on sites that offer subscription services. “This will let paywalled publishers grow their audiences and open an opportunity for people to read content they might not ordinarily see,” Google wrote.\n Today, we are announcing a licensing program to pay publishers for high-quality content for a new news experience launching later this year. This program will help participating publishers monetize their content through an enhanced storytelling experience that lets people go deeper into more complex stories, stay informed and be exposed to a world of different issues and interests. We will start with publishers in a number of countries around the globe, with more to come soon.\n The service will launch first on Google’s News and Discover sites. As for specific publishers, it said that it signed up Spiegel Group in Germany,  InQueensland and  InDaily in Australia and  Diarios Associados in Brazil. “With local news under stress, finding new channels and new audiences for our premium content, in safe and curated environments, is a high priority,” said  InDaily managing director Paul Hamra.\n Google has been  under fire for failing to pay news organizations when it shows news snippets and other content on its search pages, especially in Europe. France recently  ordered Google to negotiate with publishers over such payments, while Google maintains that it sells neither searches nor clicks.\n Google has said that it’s investing in news partnerships and exploring new ways to work with publishers, and this new venture appears to be a new step in that direction. In the wake of the COVID-19 pandemic, the company has also provided funding to 5,300 local news sites via Journalism Emergency Relief Fund, ad-serving fee waivers and a $15 million campaign.\n However, publishers and particularly local news sites  continue to close at unprecedented rates, depriving citizens of invaluable information resources. Some of the recent closures are due to the pandemic, but over the long term, Facebook and Google in particular have been taking ad revenue that used to go to local daily and weekly news services.\n Google didn’t reveal other details about what form the new service will take, but promised we’ll learn more about it “in the coming months.”", "posttime": "2020-06-26 19:18:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,出版商,pay", "title": "谷歌将向出版商支付即将推出的新闻服务中的“高质量”内容", "title_en": "Google will pay publishers for 'high-quality' content in upcoming news service", "transed": 1, "url": "https://www.engadget.com/google-pay-publishers-for-high-quality-content-084047751.html", "via": "", "real_tags": ["google", "谷歌", "出版商", "pay"]}, {"category": "", "categoryclass": "", "imagename": "8781ce98da4384873db5617acb471c13.jpg", "infoid": 1008381, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从Windows 10 2004/5月更新开始，Microsoft将取消商业用户使用Windows Update设置手动推迟Windows 10功能更新的功能。微软似乎在6月23日对其Windows102004 IT专业人员文档进行了更改，从而将这一变化公之于众。\n微软官员表示，这一变化是以减少混乱的名义发生的。这是我上周从一位读者那里听说的微软主页(多亏了WindowsTimes.com我才看到的)的解释。(上周，我以为这是一个漏洞，但现在看来，它实际上是一项功能。)去年，我们更改了Windows 10的更新安装策略，只针对运行功能更新版本且服务即将结束的设备。因此，许多设备一年只更新一次。为了使所有设备都能最大限度地利用此策略更改，并防止混淆，我们从Windows 10 2004版开始的Windows Update设置高级选项页面中删除了延迟。&#34；\n在2020/2004年5月更新发布之前，专业用户、教育用户和企业用户可以使用Windows Update设置高级选项页面手动将更新推迟365天。(有关更多信息，请参阅这篇关于如何管理Windows10功能更新的帖子。)。展望未来，对于希望保留手动推迟功能更新功能的用户，Microsoft提供以下指导：\n如果您希望继续利用延迟，您可以使用本地组策略(计算机配置&&gt;管理模板&&gt;Windows组件&&gt;Windows Update&&gt;Windows Update for Business&gt；选择何时接收预览版本和功能更新，或在接收质量更新时选择)。&#34；Microsoft一直在根据用户反馈不断调整Windows 10更新过程的工作方式，这似乎在很大程度上是投诉。微软每年提供两个Windows10功能更新。企业用户有权将这些更新推迟长达365天，除非他们的设备运行的Windows 10功能更新即将结束支持。Windows10家庭版用户去年获得了暂停功能更新长达35天的权利。许多企业和教育用户只关心秋季发布的Windows 10功能更新，因为他们获得了30个月的支持(而不是春季功能更新的18个月支持)。因此，其中一些用户每隔一年才使用秋季更新来更新他们的Windows10设备。(请参阅我的ZDNet同事Ed Bott&39；的帖子，全面了解Windows10功能更新的工作原理。)。\n微软于5月27日开始推出2020/2004年5月的更新。我问微软，公司是否有什么要说的，为什么没有提前通知用户这一变化，但没有收到任何回复。\n注册后，即表示您同意使用条款并承认隐私政策中概述的数据做法。\n您还可以免费订阅ZDNet的今日技术更新和ZDNet公告时事通讯。您可以随时取消订阅这些时事通讯。\n您同意接收来自CBS系列公司的更新、提醒和促销信息，包括ZDNet的今日技术更新和ZDNet公告时事通讯。你可以随时退订。\n通过注册，您同意接收您可以随时取消订阅的选定时事通讯。您也同意使用条款，并承认我们的隐私政策中概述的数据收集和使用做法。\n正在查找有关Windows 10版本、新功能、已知问题、故障排除和技术支持的技术信息？从这里开始。\nParallels Desktop使用年限为14年年长的,为了庆祝你现在可以抓取一个大幅打折25%订阅或升级到最新的Parallels Desktop15美元给Mac。..。\n你&#39；I‘我刚刚升级到最新版本的Windows 10.在您之前回去工作吧，使用此核对表可以确保您的隐私并且安全设置为正确无误，就是这样..。\n无论您是否有责任单个Windows 10PC或数千台\n一个发行渠道是不够的。微软刚刚重新安排了Windows内幕计划，但是公司错过了提供帮助的机会主流客户是不知不觉中..。", "note_en": "Microsoft is removing the ability for business users to defer manually   Windows 10 feature updates using Windows Update settings starting with the Windows 10 2004/May Update. Microsoft seemingly made this change public with a change in its  Windows 10 2004 for IT Pros documentation on June 23.\n    Microsoft officials say this change is happening in the name of reducing confusion. Here&#39;s the explanation from the Microsoft page (which I saw thanks to  WindowsTimes.com), and which I had heard about from a reader last week. (Last week, I assumed this was a bug, but now it seems like it&#39;s actually a &#34;feature.&#34;)   &#34;Last year, we changed update installation policies for Windows 10 to only target devices running a feature update version that is nearing the end of service. As a result, many devices are only updating once a year. To enable all devices to make the most of this policy change, and to prevent confusion,  we have removed deferrals from the Windows Update settings Advanced Options page starting on Windows 10, version 2004.&#34;\n Before the release of the May 2020/2004 update, Pro, Education and Enterprise users could manually defer updates for 365 days using the Windows Update settings Advanced Options page. (For more, see this post on  how to manage Windows 10 feature updates.)  Going forward, for users who want to retain the ability to defer feature updates manually,  Microsoft offers this guidance:\n &#34;If you wish to continue leveraging deferrals, you can use local Group Policy (Computer Configuration &gt; Administrative Templates &gt; Windows Components &gt; Windows Update &gt; Windows Update for Business &gt; Select when Preview builds and Feature Updates are received or Select when Quality Updates are received).&#34;   Microsoft has been continually tweaking the way the Windows 10 updating process works based on &#34;user feedback,&#34; which seems to be, in large part, complaints. Microsoft makes available two Windows 10 feature updates per year. Business users have had the right to defer those updates for up to 365 days unless their devices are running a Windows 10 feature update that is nearing the end of support.  Windows 10 Home users last year got the right to pause feature updates for up to 35 days.   A number of Enterprise and Education users only care about the Windows 10 feature update released in the fall because they get 30  months of support (as opposed to 18 months of support for the spring feature update). Consequently, some of those users only update their Windows 10 devices every other year using the fall update. (See my ZDNet colleague Ed Bott&#39;s post for  a full run-down of how Windows 10 feature updates work.)\n Microsoft began rolling out the May 2020/2004 update on May 27. I asked Microsoft if the company had anything to say as to why users weren&#39;t notified in advance about this change but received no word back.\n  By registering, you agree to the  Terms of Use and acknowledge the data practices outlined in the  Privacy Policy.\n  You will also receive a complimentary subscription to the ZDNet&#39;s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe from these newsletters at any time.\n         You agree to receive updates, alerts, and promotions from the CBS family of companies - including ZDNet’s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe at any time.\n      By signing up, you agree to receive the selected newsletter(s) which you may unsubscribe from at any time. You also agree to the  Terms of Use and acknowledge the data collection and usage practices outlined in our  Privacy Policy.\n       Looking for technical information about Windows 10 releases, new features, known issues, troubleshooting, and tech support? Start here.\n  Parallels\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDesktop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t14\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyears\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\told,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcelebrate\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgrab\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmassive\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t25\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpercent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toff\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsubscription\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupgrade\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlatest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tParallels\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDesktop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t15\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMac.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  You&#39;ve\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tjust\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupgraded\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmost\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trecent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tversion\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t10.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBefore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tget\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tback\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twork,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tuse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchecklist\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tensure\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprivacy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsettings\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcorrect\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Whether\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tresponsible\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsingle\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t10\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPC\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthousands\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tenterprise\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPCs,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchallenges\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmanaging\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupdates\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsame.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgoals\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinstall\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupdates\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  If\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou&#39;ve\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tspent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyears\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmastering\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tins\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\touts\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUpdate,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprepare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunlearning.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t10,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\temphasis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&#34;Windows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tservice,&#34;\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tkeeps\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trewriting\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trules\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  What attacker needs to risk burning a zero-day flaw when targets leave critical Exchange bugs unpatched for months?\n  Only Windows 10 on Arm could run on Apple&#39;s future Arm-based Macs, but Microsoft&#39;s license doesn&#39;t permit it.\n  One\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trelease\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchannel\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tisn&#39;t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tenough.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMicrosoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tjust\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trearranged\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInsider\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProgram,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcompany\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmissed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\topportunity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thelp\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmainstream\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcustomers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twho\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunwittingly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2020-06-26 19:18:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,windows,微软,update,removes", "title": "微软从Windows Update中删除手动延迟“以防止混淆”", "title_en": "Microsoft removes manual deferrals from Windows Update'to prevent confusion'", "transed": 1, "url": "https://www.zdnet.com/article/microsoft-removes-manual-deferrals-from-windows-update-by-it-pros-to-prevent-confusion/", "via": "", "real_tags": ["microsoft", "windows", "微软", "update", "removes"]}, {"category": "", "categoryclass": "", "imagename": "f312d441cdba8118e191287c162b887a.jpg", "infoid": 1008380, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一条沿着大海绵延7.5英里的很棒的自行车道。所以往返15英里。在工作日的下午，这里几乎空无一人。它非常适合全速行驶。\n因此，一周有几次，我会骑上自行车，以最快的速度完成15英里的环行。我的意思是真正的全力以赴，百分之百，头朝下，红脸冲刺。\n我会筋疲力尽地结束比赛，看看时间：43分钟。每一次。在刮风的日子里，也许会多一分钟，但基本上总是43分钟。\n几个月后，我注意到我对这次骑车的热情降低了。我想我在精神上已经把它和完全精疲力尽联系在一起了。\n所以有一天我决定做同样的骑行，但是要冷静。放轻松，慢慢来。好的，不是很慢，但把它拨回我平时努力的50%左右。\n还有啊…。多好的一次骑行啊。我很放松，面带微笑，环顾四周。我几乎没有给它任何努力。\n我看到水里有两只海豚。一只鹈鹕在玛丽娜·德尔雷正好从我身上飞过。当我抬起头说“哇！”他在我嘴里拉屎。我还记得消化贝类的味道。我不得不嘲笑它的新奇之处。\n我通常都很有干劲，总是竭尽全力地做每一件事。这一次能放松下来真是太好了。我觉得我可以永远这样做，不会筋疲力尽。\n等等-什么？！？怎么可能呢？是啊。我复核了一下：45分钟，而我通常是43分钟。\n显然，我一直在做的那些令人精疲力竭的、红脸的、全力以赴的推-推-推只给我带来了4%的提振。我可以放轻松，得到96%的结果。\n体验上有多么大的不同啊！走同样的距离，在差不多相同的时间，但一条路让我筋疲力尽，而另一条路，让我焕发青春。\n我经常想到这一点。当我注意到我对某件事感到压力很大或驾驶到筋疲力尽时，我就会想起那次骑自行车，并试着将努力减少50%。令人惊讶的是，每件事往往都能做得一样好，一样快，感觉就像是付出了一半的努力。\n这让我意识到，我的一半努力根本不是努力，而是不必要的压力，让我感觉自己在尽最大努力。", "note_en": "There’s a great bike path that goes along the ocean for seven and a half miles.\tSo, fifteen miles round trip.\tOn weekday afternoons, it’s almost empty.\tIt’s perfect for going full speed.\n So a few times a week, I’d get on  my bike and go as fast as I could for the fifteen-mile loop.\tI mean really full-on, 100 percent, head-down, red-faced sprinting.\n I’d finish exhausted and look at the time: \tforty-three minutes.\tEvery time.\tMaybe a minute more on a really windy day, but basically always forty-three minutes.\n After a few months, I noticed I was getting less enthusiastic about this bike ride.\tI think I had mentally linked it with being completely exhausted.\n So one day I decided  I would do the same ride, but just chill.\tTake it easy, nice and slow.\tOK, not  super slow, but dialing it back to about 50 percent of my usual effort.\n And ahhh… what a nice ride.\tI was relaxed and smiling and looking around.\tI was barely giving it any effort.\n I saw two dolphins in the water.\tA pelican flew right over me in Marina del Ray.\tWhen I looked up to say “wow!” he shit in my mouth.\tI can still remember that taste of digested shellfish.\tI had to laugh at the novelty of it.\n I’m usually so damn driven, always doing everything as intensely as I can.\tIt was so nice to take it easy for once.\tI felt I could do this forever, without any exhaustion.\n  Wait — what?!?\tHow could that be?\tYep.\tI double-checked: forty-five minutes, as compared to my usual forty-three.\n So apparently all of that exhausting, red-faced, full-on push-push-push I had been doing had given me only a  4 percent boost.\tI could just take it easy and get  96 percent of the results.\n And what a difference in experience!\tTo go the  same distance, in about the  same time, but one way leaves me exhausted, and the other way, rejuvenated.\n I think of this often.\tWhen I notice that I’m all stressed out about something or driving myself to exhaustion, I remember that bike ride and try dialing back my effort by 50 percent.\tIt’s been amazing how often everything gets done just as well and just as fast, with what  feels like half the effort.\n Which then makes me realize that half of my effort wasn’t effort at all, but just unnecessary stress that made me  feel like I was doing my best.", "posttime": "2020-06-26 18:56:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "放松,relax,筋疲力尽", "title": "为同样的结果放松(2015)", "title_en": "Relax for the Same Result (2015)", "transed": 1, "url": "https://sivers.org/relax", "via": "", "real_tags": ["放松", "relax", "筋疲力尽"]}, {"category": "", "categoryclass": "", "imagename": "1743e31881ab6743c8d7dd5d8adf7490.jpg", "infoid": 1008379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在著名的运河城市的其他地区，从下周三开始，度假租赁只有在获得许可的情况下才能允许，每年仍然不超过30个晚上。\n在该市收紧对Airbnb和类似平台的规定之前，该市与居民和组织进行了一段时间的咨询，市政府表示，征询了780份回复-其中整整75%的人支持禁止这些平台在三个中心区运营。\n从下周三开始，禁止在Airbnb等平台上租赁度假的三个地区是：Burgwallen-Oude Zijde，Burgwallen-Nieuwe Zijde和Grachtengordel-Zuid。\n“这次(咨询)表明，这个话题在阿姆斯特丹人中非常活跃。副市长劳伦斯·艾文斯(Laurens Ivens)在一份新闻稿中表示，令人震惊的是，不少于75%的人支持在这三个地区禁止度假租赁[使用DeepL从荷兰语翻译过来]。\n此外，艾文斯表示，咨询工作显示出对在全市范围内禁止此类平台的一些支持。然而，目前的泛欧盟规则-特别是“欧洲服务指令”(European Services Directive)-限制了城市如何应对公众对此类服务的反对情绪。因此，阿姆斯特丹将禁令适用于它已经能够证实旅游业会导致重大干扰的特定地区。\n在欧洲最高法院去年12月裁定Airbnb是一家在线中介服务公司后，“欧洲服务指令”(European Services Directive)为在该地区运营的度假平台提供的法律保障已显示出强大的抗争能力。一家法国旅游协会曾试图辩称，应该要求该平台遵守房地产法规。\n艾文斯说，阿姆斯特丹将在两年内进行另一次旅游审查-如果发现类似的问题已经迁移到那里，可能会将更多的地区添加到禁令名单中。\n这些绝不是该市对度假租赁平台施加的第一次限制。早在2018年，它就收紧了对房产可以租赁的夜晚数量的限制，将其从每年60晚压缩到30晚。\n然而，尽管有这些限制，城市当局指出，近年来游客租房经历了“强劲增长”，阿姆斯特丹每15套住房中就有一套是在线提供的。该公司还表示，各平台上的房屋供应量增加了五倍-每月约有2.5万个广告。\n议会在一份新闻稿中写道，由于这一增长，游客租赁对阿姆斯特丹各个社区的生活质量产生了越来越负面的影响。\n同时引入的许可证制度旨在帮助执行更严格的规定-规定一套房子必须有人居住；每年最多30个晚上只能租给最多四个人。该委员会还强制要求那些在度假租赁平台上租房的人在每次租房时都要向市政府报告，因此将建立自己的数据集，说明这些平台的使用情况。\n阿姆斯特丹住房法规的其他变化还包括对屡教不改的房东处以更高的罚款，比如如果他们在没有许可证的情况下租房，或者违反了假日租赁的最高夜数。\n该市还对改建进行了限制，规定只有超过100平方米的房产才能改建成两套或两套以上的小房子-这一规定似乎是针对那些试图将一处较大的房产变成两套或两套以上较小公寓以实现假日租金收入最大化的房东，从而减少适合大家庭的房屋存量。\n在城市和度假租赁平台之间与征收旅游税相关的早期小规模冲突之后，获取数据仍然是一个持续的争议焦点-城市向平台施压，要求共享数据，以便能够执行更严格的监管。与此同时，平台有明确的商业动机来避免这种透明度。\n例如，2018年，阿姆斯特丹的市政府官员呼吁Airbnb与当局分享“具体的租赁数据-谁出租了多长时间，租给了多少人”。\n我们已经要求Airbnb确认它现在与该市共享了哪些数据。\n欧盟委员会(European Commission)寻求在这里发挥调解作用，今年早些时候宣布，它已与P2P租赁平台Airbnb、Booking.com、Expedia Group和TripAdvisor达成协议，共享有限的泛欧盟数据-并表示希望鼓励该行业的“平衡”发展，同时指出，人们担心这些平台会给当地社区带来不可持续的压力。\n这些平台最初同意共享的泛欧盟数据点是预订的夜数和客人数量，汇总在“市政当局”的层面上。在安排的第二阶段，平台将分享有关出租物业的数量以及全额物业租金与自住物业中房间的比例的数据。\n然而，欧盟委员会也在通过即将出台的数字服务法案更新有关数字服务的规则。因此，有可能在度假租赁平台上提出具体的数据访问义务。\n我们联系了欧盟委员会，询问它是否正在考虑这一领域的最新情况，并将以任何回应更新这份报告。\n包括阿姆斯特丹在内的10个欧盟城市去年写了一封公开信，呼吁欧盟委员会“为平台引入强大的法律义务，要求平台在注册计划和提供在其平台上广告的每套房屋的租赁数据方面与我们合作”。因此，要求更好的平台治理的地区压力是响亮而明确的。", "note_en": "In other districts in the famous city of canals, vacation rentals will only be permitted with a permit from next Wednesday, still for a maximum of 30 nights per year.\n The latest tightening of the city’s rules on Airbnb and similar platforms comes after a period of consultation with residents and organizations which city authorities say drew 780 responses — a full 75% of which supported banning the platforms from operating in the three central districts.\n  The three districts where vacation rentals on platforms such as Airbnb are prohibited from next Wednesday are: Burgwallen-Oude Zijde, Burgwallen-Nieuwe Zijde and the Grachtengordel-Zuid.\n “This [consultation] indicates that the subject is very much alive among Amsterdammers. What is striking is that no less than 75% are in favor of a ban on holiday rentals in the three districts, said deputy mayor Laurens Ivens in a  press release [translated from Dutch using  DeepL].\n Furthermore, Ivens said the consultation exercise showed some support for a citywide ban on such platforms. However current pan-EU rules — notable the European Services Directive — limit how cities can respond to public sentiment against such services. Hence Amsterdam applying the ban to specific districts where it has been able to confirm tourism leads to major disruption.\n The legal cover afforded to vacation platforms operating in the region by the European Services Directive has show itself to be robust to challenge, after Europe’s top court ruled in  December that Airbnb is an online intermediation service. A French tourism association had sought to argue the platform should rather be required to comply with real estate regulations.\n Ivens said Amsterdam will conduct another tourism review in two years — and may add more districts to the ban list if it finds similar problems have migrated there.\n These are by no means the first restrictions the city has put on vacation rental platforms.  Back in 2018 it tightened a cap on the number of nights properties can be rented, squeezing it from 60 nights to 30 per year.\n Yet despite such restrictions city authorities note tourist rental of homes has experienced “strong growth” in recent years, with 1 in 15 homes in Amsterdam being offered online. It also said that the supply of homes on the various platforms has increased fivefold — amounting to around 25,000 advertisements per month.\n Due to this increase, tourist rental has an increasingly negative impact on the quality of life in various Amsterdam neighborhoods, the council writes in a  press release.\n The permit system which is also being brought in is intended to aid enforcement of tighter rules — with stipulations that a house must be inhabited; and that the maximum of 30 nights per year can only be rented to a maximum of four people. The council has also made it mandatory for those renting homes on vacation rental platforms to report to the municipality every time the house is rented, so will be building up its own dataset on how these platforms are being used.\n Additional  changes to Amsterdam’s housing regulations also include higher fines for repeat offender landlords, such as if they rent a property without a permit or violate the maximum number of nights for holiday rentals.\n The city has also put limits on conversions, stipulating that only properties larger than 100 m2 may be converted into two or more smaller homes — a provision that seems aimed at landlords who try to maximize holiday rental income by turning a single larger property into two or more smaller flats, and thereby reducing suitable housing stock for larger families.\n After early skirmishes between cities and vacation rental platforms related to the  collection of tourist taxes, access to data remains an ongoing bone of contention — with cities pressing platforms to share data in order that they can enforce tighter regulations. Platforms, meanwhile, have a clear commercial incentive to avoid such transparency.\n In  2018, for example, city officials in Amsterdam called for Airbnb to share “specific rental data with authorities — who is renting out for how long, and to how many people”.\n We’ve asked Airbnb to confirm what data it shares with the city now.\n The European Commission has sought to play a mediating role here, announcing  earlier this year it had secured agreement with p2p rental platforms Airbnb, Booking.com, Expedia Group and Tripadvisor to share limited pan-EU data — and saying it wanted to encourage “balanced” development of the sector while noting concerns that such platforms put unsustainable pressure on local communities.\n The initial pan-EU data points the platforms agreed to share are number of nights booked and number of guests, aggregated at the level of “municipalities.” A second phase of the arrangement will see platforms share data on the number of properties rented and the proportion that are full property rentals vs rooms in occupied properties.\n However the Commission is also in the process of updating the rules around digital services, via the forthcoming Digital Services Act. So it’s possible it could propose specific data access obligations on vacation rental platforms.\n We reached out to the Commission to ask if it’s considering updates in this area and will update this report with any response.\n Ten EU cities — including Amsterdam — penned an  open letter last year, calling on the Commission to introduce “strong legal obligations for platforms to cooperate with us in registration-schemes and in supplying rental-data per house that is advertised on their platforms”. So the regional pressure for better platform governance is loud and clear.", "posttime": "2020-06-26 18:36:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "平台,ejects", "title": "\n阿姆斯特丹在最新的P2P平台限制中将Airbnb el at驱逐出三个中心区", "title_en": "\n\t\t\t\tAmsterdam ejects Airbnb el at from three central districts in latest p2p platform limits\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/amsterdam-ejects-airbnb-el-at-from-three-central-districts-in-latest-p2p-platform-limits/", "via": "", "real_tags": ["平台", "ejects"]}, {"category": "", "categoryclass": "", "imagename": "0fcdb5073d049f1db617d0353b9148f4.jpg", "infoid": 1008378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "萨克拉门托(哥伦比亚广播公司SF)-周四，州长加文·纽瑟姆(Gavin Newsom)宣布了一个新的新冠肺炎建模网站，以及新的开源工具，旨在帮助加州居民理解数据，通知当地卫生部门，并赋予他所谓的“公民科学家”权力。\n州长介绍了位于calcat.covid19.ca.gov的新的冠状病毒建模网站，作为居民以完全透明的方式查看推动州和县官员决策的原始数据的一种方式。\n纽瑟姆指出，新冠肺炎的大流行模型将继续指导该州未来的行动。\n“未来不只是需要体验的东西。我们不是命运的受害者。我们可以展现未来。这不是我们面前的东西，而是我们内心的东西。“纽瑟姆解释说。“我经常这样说，决定我们命运和未来的是决定，而不是条件。在加利福尼亚州，我们就是证明。“。\n新网站有三个部分：“现在广播”部分，提供新冠肺炎在州和县传播速度的最新信息；“预测”部分，提供州和县对新冠肺炎的短期预测；以及“情景”部分，预测不同情景下对新冠肺炎可能产生的长期影响，同样是对全州和县。\n纽瑟姆还宣布推出加州COVID评估工具平台，该平台向县卫生合作伙伴提供工具原型，以完善洞察力和知识。纽瑟姆说，通过共享代码，该州有望促进与其他州和研究人员的合作。\n“我们想把我们的网站开放给‘网民’…。公民科学家，每天都在做编码的人，“纽瑟姆说。“我们希望通过一个开源平台让他们能够访问我们拥有的、我拥有的、我们的卫生专业人员拥有的所有可用的数据，我们认为这种方式在美国任何地方都是以前没有做过的。这是对透明度和公开性的深入研究。这是我们今天提供的一种新资源。“。\n纽瑟姆指出，开源工具将赋予居民权力，并有望利用加州人来自多个领域的专业知识，帮助该州开发新的模型和查看原始数据的方式。\n“我们正在为人们提供参与我们建模能力建设的能力。因为我们认识到的一件事是，居住在加利福尼亚州、美国各地以及世界其他地区的专业知识和人才的能力是无穷无尽的。“纽瑟姆解释说：”这是因为我们认识到，居住在加利福尼亚州、美国和世界其他地区的专业知识和人才的能力是无穷无尽的。“。“我们正在向数学家开放，我们正在向人工智能专家开放，向我们的研究人员、科学家、诺贝尔奖获得者和我们的合作伙伴开放-同样，包括那些只是拥有尚未被利用的专业知识的公民。”他说，“我们正在向数学家开放，我们正在向人工智能专家开放，向我们的研究人员、科学家、诺贝尔奖获得者和我们的合作伙伴开放。”他们没有被邀请，或者说他们没有利用这个机会参与进来。“。\n加州卫生与公众服务部部长Mark Ghaly博士说，将开源的公民数据添加到该州的建模工作中，将有助于完善地方层面的决策。\n加利博士解释说：“今天令人兴奋的机会不仅是获得全州范围的信息，而且随着我们对州长从全国各地提到的不同模式建立了理解，能够在更具地方性和县级的层面上使用这些模式。”“我们知道，县卫生官员和卫生总监正在定期使用这些信息，不是为了在某种程度上支持他们的观点，而是为了真正指导他们的决定，这些决定推动了我们的一些行动，因为这关系到我们对新冠肺炎的回应。”\n在周四早些时候的更新中，州长强调，该州仍在应对冠状病毒的第一波，加州居民需要明白，新冠肺炎目前的激增不是第二波的一部分。\n纽瑟姆指出，在过去24小时内确诊的新病例数量从7000多例大幅下降到5349例，但他说，减少的数量仍然是一个令人担忧的病例数量。在过去的7天里，该州的阳性率为5.6%。\n周四，该州的住院率继续攀升，在过去的14天里达到了32%，有4,240名患者与新冠肺炎一起住院。\n纽瑟姆说，该州ICU患者总数在过去24小时内也略有攀升。1306名ICU患者比周三增加了3%。据州长称，在过去的14天里，ICU患者增加了19%。\n该州有11个县在容量观察名单上，包括圣克拉拉。该县仍有一些缓冲，41.95%的急性护理床位开放，46%的ICU床位开放。\n斯坦福大学急诊部主任安德拉·布鲁姆卡恩斯(Andra Blomkalns)博士表示，7月4日之后可能会出现问题。\n“随着假期周或周末的临近，人们可能不会在适当的地方避难，也可能不会在社交上保持足够的距离。我们已经看到COVID病例的上升，这相当可观，这包括那些病情不是很严重的人，“Blomkalns博士通过Zoom告诉KPIX5。\n她称接下来的几周是遵守全州范围的面具授权和社会距离的关键时刻。\n“我知道这已经有很长一段时间了，这非常令人沮丧，我自己也无计可施，我想不戴面具出去和我的朋友们聚在一起，”布隆卡恩斯博士说，“我知道这已经很长时间了，这非常令人沮丧，我自己也无计可施了。”“但这一点很重要，我真的觉得，如果我们能处理好这件事，未来几周我们地区和我们国家的命运就完全掌握在国内人民手中。”", "note_en": "SACRAMENTO (CBS SF) — Gov. Gavin Newsom on Thursday announced a new COVID-19 modeling website as well as new open-source tools designed to help California residents understand the data informing local health departments and empower what he called “citizen scientists.”\n The governor introduced the new  coronavirus modeling website found at  calcat.covid19.ca.gov, as a way for residents to see the raw data that is driving the decisions of state and county officials with full transparency.\n Newsom pointed out that the COVID-19 pandemic modeling would continue to guide the state’s future actions.\n “The future is not just something to experience. We are not victims of fate. We can manifest the future. It’s not something in front of us, it’s something inside of us,” explained Newsom. “I say this often; it’s decisions, not conditions that determine our fate and our future. In the State of California, we are proof of that.”\n The  new website features three sections: a “Nowcast” section that provides the most current information on how fast COVID-19 is spreading in the state and by county; a “Forecasts” section that provides short-term COVID-19 forecasts in the state and by county; and a “Scenarios” section that projects the possible long-term impacts under different scenarios and responses to COVID-19, again for the whole state and by county.\n Newsom also announced the launch of the  California COVID Assessment Tool platform that provides tool prototypes to county health partners to refine insights and knowledge. Newsom said by sharing the code, the state would hopefully spur collaboration with other states and researchers.\n “We want to open up our site to ‘netizen-tists’ … of citizen-scientists, people that are out there doing coding every single day,” said Newsom. “We want to give them access through an open-source platform to all of the available data that we have, that I have, that our health professionals have, in a way that we don’t believe has been done before anywhere in the United States. This is a deep dive for transparency and openness. This is a new resource that we are making available today.”\n Newsom noted that the open-source tools would empower residents and hopefully tap into the expertise of Californians from multiple fields to help the state develop new models and ways of looking at the raw data.\n “We’re making available the capacity for people to participate in building our modeling capacity. Because one thing we recognize is the limitlessness of the capacity of expertise and talent that resides throughout the State of California, throughout the United States, and for that matter throughout the rest of the world,” explained Newsom. “We’re opening up to mathematicians, we’re opening up to people that are experts in AI, opening up to our researchers and scientists and our Nobel laureates and our partners across the spectrum – including, again, citizens that just have an expertise that hasn’t been tapped. They haven’t been asked, or they haven’t availed themselves to the opportunity to engage.”\n Secretary of the California Health and Human Services Dr. Mark Ghaly said adding open-source citizen data to the state’s modeling efforts will help refine decision making at a local level.\n “The exciting opportunity today is to not just have statewide information, but as we built our understanding of the different models that you heard the governor mention from across the nation, to be able to use those at a much more local, county level,” explained Dr. Ghaly. “We know that county health officers and health directors are using this information on a regular basis, not to sort of support their opinions, but to really guide their decisions that are driving some of our actions as it relates to our response to COVID-19.”\n Earlier in the Thursday update, the governor emphasized that the state was still coping with the first wave of the coronavirus and that California residents needed to understand that the current spike in COVID-19 was not part of a second wave.\n Newsom noted that the number of new cases confirmed in the past 24 hours dropped significantly from over 7,000 cases to 5,349 cases, but said the reduced number was a still troubling volume of cases. The state had a 5.6 percent positivity rate in the past 7 days.\n The state’s hospitalization rate continued to climb on Thursday, hitting 32 percent over the past 14 days with 4,240 patients hospitalized with COVID-19.\n The total number of ICU patients in the state also climbed slightly over the past 24 hours, Newsom said. The 1,306 ICU patients marked a 3 percent increase from Wednesday. There was a 19 percent increase in ICU patients over the past 14 days, according to the governor.\n  There are 11 counties the state has on a watch list for capacity, including Santa Clara. The county still has some cushion with 41.95 percent of acute care beds open and 46 percent of ICU beds open.\n Dr. Andra Blomkalns, the head of Stanford’s Emergency Department, said there is potential for problems after the Fourth of July.\n “As holiday week or weekend approaches us, people may not shelter in place and may not socially distance themselves quite enough. We’ve already seen an uptick in COVID cases, pretty substantially and that includes people who are not so ill and very ill,” Dr. Blomkalns told KPIX 5 via Zoom.\n She calls the next few weeks a critical juncture for abiding by the statewide mask mandate and social distancing.\n “I know it has been a long time and it has been very frustrating and I myself am at wits end about wanting to go outside without a mask and get together with my friends,” said Dr. Blomkalns. “But this is important, I really feel as though the fate of our region and our nation over the next few weeks, if we can get a handle on this is completely within the hands of people at home.”", "posttime": "2020-06-26 18:15:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,科学家,成立,governor,博士", "title": "加利福尼亚州州长纽瑟姆宣布成立新冠肺炎建模网站，为“公民科学家”提供开源工具", "title_en": "CA Governor Newsom Announces COVID-19 Modeling Website, Open-Source Tools For 'Citizen Scientists'", "transed": 1, "url": "https://sanfrancisco.cbslocal.com/2020/06/25/newsom-announces-new-covid-19-modeling-website-open-source-tools-for-citizen-scientists/", "via": "", "real_tags": ["开源", "科学家", "成立", "governor", "博士"]}]