[{"category": "", "categoryclass": "", "imagename": "1ba822d3deea68457c900755620e600e.jpeg", "infoid": 1005067, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你对“圣经”有一点粗略的了解，你可能会认得“腓立比书”第4章第13节中的那个半开玩笑的标题。虽然我选择它是因为我认为它朗朗上口，但公平地说，许多开发人员对某些数据库有着宗教上的亲和力。\n这篇文章的目的是阐明另一种思考发展问题的方式。正如您将看到的，这些问题都可以用灵丹妙药代码来解决。我想给出一些用数据库更好地解决问题的具体例子。\nPostgres只是更擅长解决一些问题。自20多年前推出以来，在添加功能和性能方面做了大量工作。\n此外，我还看到了很多项目，其中应用程序CPU经常处于负载状态，而DB服务器CPU徘徊在5%左右。在所有条件相同的情况下，这些技术必须对跨资源重新分配负载有好处。\n所有示例都假设您使用的是ECTO，但是这些概念可以很容易地移植到其他系统。将逻辑移入Postgres并不意味着抛弃您的ORM。值得庆幸的是，通过结合迁移和片段，我们可以少量地注入SQL来实现我们的目标。\n在本例中，模式表示一辆汽车。共有3列：engine_type、mpg和kwh。一辆车不应该在所有3个字段中都有数据。只有装有电动马达的汽车才应该有千瓦时。而且只有汽油发动机才应该有每加仑油耗。\n假设您想要确保在变更集中验证逻辑，您可以创建一个自定义验证器，如下所示：\n使用Postgres，迁移将获得新的检查约束。支持此约束只需要向变更集添加一个check_straint/3函数。使用此策略，数据库将确保遵循业务逻辑，如果不遵循，变更集将返回有用的错误。\n此外，还将验证数据库中的所有数据。即使它没有通过变更集(可能您从外部源导入了数据)。我认为，通过在前端和后端进行验证来采用一种简单的方法来验证数据是很常见的。在数据库级别添加这种类型的验证是腰带和吊带和弹性废纸带。\nCitext是Postgres的延伸。它添加了一个本质上是不区分大小写的字符串的新数据类型。安装它非常简单(如下所示)。\n在幕后，Postgres实际上将查询的两边都转换为小写。顺便说一句，这通常是您在应用程序代码中要做的事情，以实现相同的目的。\n如您所见，执行不区分大小写的搜索所需的长生不老的代码稍微复杂一些。此外，如果您决定将其添加到现有数据库，则需要迁移所有现有数据。使用Citext没有这一要求。\n假设您的用户根据价格搜索汽车。你要给他们看的车和他们要的价格完全一样，但也要给他们看一些多一点和少一点的车。在灵丹妙药中，这可能意味着获得3个结果列表并合并它们。\nPostgres已经在按顺序存储数据。使用窗口函数LAG和LEAD，您可以让Postgres确定精确匹配的目标，然后在索引中抓取它周围的行。把这想成是去一个停车场，那里每辆车都是按价格顺序停放的。如果你从5000美元的车开始，价格接近的车就会停在它旁边。\n在上面的示例中，您还可以看到CTE的用法。顶部(以“with”开头)定义查询中使用的CTE。\nCTE是一个临时结果集，您可以在另一个SQL语句中引用它，包括SELECT、INSERT、UPDATE或DELETE。它在您进行递归查询的任何时候都很有用。\n在灵丹妙药中，搜索模糊匹配的效率可能非常低。假设您想要一个文本搜索，既可以查看汽车的型号，也可以查看汽车的型号。此外，您还希望返回近匹配项，以防用户拼错名称。\n在elxir中，您可能需要加载每辆车，然后迭代每辆车(两次)以计算字符串相似度并对结果进行排序。在本例中，我们使用字符串模块中提供的jaro_Distance。\n通过将该逻辑移到数据库查询中，我们可以使用Postgres内置的函数。Postgres中提供了Levenshtein距离计算，无需任何插件。\n我只是触及了Postgres功能的皮毛。我希望我已经给了您一些关于如何利用您已经安装的这个非常强大的工具的想法。\nPostgres在组织、查询和转换数据方面有很多优势(这就是它设计的目的)。在应用程序中保留逻辑肯定是有时间和地点的，但我希望您至少能考虑一下将逻辑移入Postgres会对您有什么帮助。\n我省略的一些特性包括视图、触发器和pg_NOTIFY。如果您对这些感兴趣，请查看这篇关于缓存长生不老药应用程序的文章。", "note_en": "If you have even a cursory knowledge of the Bible, you might recognize that tongue-in-cheek title paraphrased from Philippians 4:13. While I chose it because I thought it was catchy, it is also fair to say many developers have a religious affinity for certain databases.\n  The goal of this post is to shed some light on another way of thinking about development problems. As you’ll see, these problems could all be solved with Elixir code. I want to give some concrete examples of problems that are better solved with the database.\n  There are some problems Postgres is just better at solving. Since it was introduced over 20 years ago, a lot of work has gone into adding features and performance.\n In addition, I have seen a lot of projects where the application CPUs are constantly under load and the DB server CPU hovers around 5%. All things being equal, these techniques must just be good for redistributing load across your resources.\n  All of the examples assume you are using Ecto, but the concepts can easily be ported over to other systems. Moving logic into Postgres does not mean ditching your ORM. Thankfully, through a combination of  migrations and  fragments, we can inject SQL sparingly to accomplish our goals.\n  In this example, the schema represents a car. There are 3 columns: engine_type, mpg, and kwh. A car should never have data in all 3 fields. Only a car with an electric motor should have kwh. And only a gasoline engine should have mpg.\n Let’s say you want to make sure that logic is validated in a changeset, you might create a custom validator like this:\n  Using postgres, the migration gets a new check constraint. Supporting this constraint only requires adding a  check_constraint/3 function to the changeset. With this strategy the database will ensure the business logic is followed and the changeset will return a useful error if it doesn’t.\n   In addition, all data in the database will be validated. Even if it doesn’t go through the changeset (maybe you imported data from an external source.) I think it’s common to take a belt-and-suspenders approach to data validation by validating on the front-end as well as the back-end. Adding this type of validation at the db level is belt-and-suspenders-and-an-elastic-wasteband.\n  Citext is an extension to postgres. It adds a new datatype that is essentially a case-insensitive string. Installing it is very easy (as you can see below.)\n  Under the hood, postgres is actually converting both sides of the query to lowercase. Incidentally, this is generally what you would do in your application code to achieve the same end.\n  As you can see, the elixir code required to perform a case-insensitive search is a bit more complex. In addition, if you decided to add this to an existing database you would need to migrate all of the existing data. Using Citext doesn’t have that requirement.\n  Let’s say your users search for cars based on price. You want to show them the cars that are exactly the price they asked for, but also some cars that are a little more and a little less. In elixir, that might mean getting 3 lists of results and merging them.\n  Postgres is storing data in order already. Using the window functions  lag and  lead, you can have postgres target the exact match and then just grab the rows around it in the index. Think of this like going to a car lot where every car is parked in order of price. If you start out at the $5,000 car, the ones close in price will be parked right next to it.\n  In the above example you can also see the use of CTEs. The top section (starting with “WITH”) defines the CTE used in the query.\n A  CTE is a temporary result set which you can reference within another SQL statement including SELECT, INSERT, UPDATE, or DELETE. It is useful anytime you would have a recursive query.\n  Searching for fuzzy matches can be very inefficient in elixir. Let’s say you wanted a text search that looks at both the car’s make as well as it’s model. In addition, you want to return near matches in case the user misspells the name.\n In elixir, you might need to load every car, then iterate over each (twice) to calculate the string similarity and to sort the results. In this example, we are using the  jaro_distance which is available in the String module.\n  By moving that logic into the database query we can use functions that are built in to postgres. Levenshtein distance calculation is available in postgres without the need for any plug-ins.\n  I have just scratched the surface of the capabilities of postgres. I hope I have given you some ideas on how to leverage this very powerful tool you already have installed.\n Postgres has a lot of strengths when organizing, querying, and transforming data (that’s kind of what it was designed for.) There are definitely a time and place to leave logic in your application, but I hope you will at least consider how moving logic into postgres could help you.\n Some of the features I left out include views, triggers, and pg_notify. If those interest you, check out  this article on caching an elixir app.", "posttime": "2020-06-04 07:24:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,长生不老,lessons,postgres", "title": "我可以通过Postgres做所有的事情：给长生不老的程序员上的课", "title_en": "I can do all things through Postgres: Lessons for the Elixir programmer", "transed": 1, "url": "https://medium.com/@toddresudek/i-can-do-all-things-through-postgres-lessons-for-the-elixir-programmer-400fd805c23a", "via": "", "real_tags": ["程序", "长生不老", "lessons", "postgres"]}, {"category": "", "categoryclass": "", "imagename": "13d71b857fd39b3f1e53dacd4f0aa4bf.jpg", "infoid": 1005066, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想看看能不能把机器人工程和高尔夫结合起来，让自己成为一名更好的高尔夫球手。其结果是一个机器人俱乐部，它能感觉到你的挥杆和核心.", "note_en": "I wanted to see if I could make myself a better golfer by combining robotic engineering and golf. The result is a robotic club that senses your swing and cor...", "posttime": "2020-06-04 06:54:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高尔夫,golf,机器人", "title": "自动高尔夫俱乐部取代球杆袋", "title_en": "Automatic Golf Club Replaces Bag of Clubs", "transed": 1, "url": "https://www.youtube.com/watch?v=o5Cv9fvajrc", "via": "", "real_tags": ["高尔夫", "golf", "机器人"]}, {"category": "", "categoryclass": "", "imagename": "1ef12000012e8422c0add43227dff66e.jpg", "infoid": 1005065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索与乔治·弗洛伊德被杀有关的时间，一名警察跪在弗洛伊德的脖子上。\n8‘46“(8分46秒)是与乔治·弗洛伊德被杀有关的时间长度，在警察德里克·肖文(Derek Chauvin)在此期间跪在脖子上后，弗洛伊德在警方拘留期间死亡。[1][2]在他去世后的几天里，以及随之而来的抗议活动，这一特定的时间跨度已经成为纪念和辩论的焦点，特别是在停电星期二前后。[3]。\n纽约、波士顿、费城、波特兰和丹佛的死亡者抗议活动中特别提到了这一时间，抗议者在这些地方躺下8分46秒，抗议警察的暴行和美国执法人员的种族主义杀戮。[4][5][6][7][8][9][10]。\n肖文警官把膝盖放在弗洛伊德的脖子上的时间大约从晚上8点19分38分开始。到晚上8点27分24分，在弗洛伊德被从车里带走并被明尼阿波利斯警方约束后开始。当弗洛伊德仰卧时，肖文开始绑住脖子。亨内平县检察官对肖文的控诉称：\n被告的膝盖压在弗洛伊德先生的脖子上，总共8分46秒。其中2分53秒是在弗洛伊德先生没有反应之后。警察接受过训练，知道这种将受试者放在俯卧位置的约束方式本身就是危险的。[11][12][13]。\n许多游行和集会都用这段时间来纪念默哀、守夜、祈祷或跪下的时刻。[15][16][17][18][19][20][21][22]在佛罗里达州的圣彼得堡，市政府官员宣布，从6月2日到6月9日，市民们应该每晚8点在门廊或院子外站8分46秒，共同进行一场无声的和平抗议[23]。\n效仿纽约市帝国大厦的例子，华盛顿特区的肯尼迪中心表示，为了纪念弗洛伊德被绑在脖子上近9分钟，它将熄灭9个晚上。[24]华盛顿特区的肯尼迪中心(Kennedy Center)表示，为了表彰弗洛伊德被绑在脖子上的近9分钟，它将熄灭9个晚上。[25]2020年5月31日，一个名为8m46s.com的网站创建了，用户可以玩8分46秒的计时器，并附上弗洛伊德临终遗言的部分文字记录。[26]网站主页正文如下：\n2020年5月25日，德里克·肖文(Derek Chauvin)将膝盖按在乔治·弗洛伊德(George Floyd)的脖子上8分46秒，导致弗洛伊德先生死亡。我邀请参观者安静地坐着，思考同样长的时间。感觉就像是永恒。从头到尾都提供了这起事件的部分文字记录。[27][27]\n在8分46秒的最后，网页上写着“为乔治伸张正义”，链接到了“华盛顿邮报”和“每日电讯报”关于弗洛伊德最后时刻的两个视频，以及关于他去世的英文维基百科页面。[27][27]。\n广播电台，如德克萨斯州达拉斯的KHKS，包括8分46秒的默哀，以纪念弗洛伊德。[28]在默哀结束后，KHKS主持人比利基德说，8分46秒，这就是感觉。8分46秒，又一个黑人无缘无故地结束了生命。\n主要的流媒体服务Spotify，Apple Music，Amazon Music和YouTube Music都安排了特别的相关节目来悼念弗洛伊德的逝世。[29]Spotify在播放列表中加入了长达8&39；46&34；的停顿，以声援#TheShowMustBePased音乐标签。[30][31][31]。\n维亚康姆哥伦比亚广播公司(ViacomCBS)下午5点在他们的电视频道播放了一段8分46秒的视频。美国东部时间2020年6月1日，由大写字母“我不能呼吸”组成，在黑色背景上跳动，伴随着呼吸声。[32]该公司娱乐和青年品牌部总裁克里斯·麦卡锡(Chris McCarthy)说，今天下午5点。美国东部时间，世界各地的E&amp；Y品牌和平台将熄灭8分46秒，以表示我们对黑人生命也是运动的支持，以及对警察暴行和种族不平等的斗争。播放这段视频的维亚康姆哥伦比亚广播公司的资产包括BET、CBS体育网络、CMT、喜剧中心、Logo TV、MTV、派拉蒙网络、史密森频道、TV Land和VH1。与此同时，维亚康姆哥伦比亚广播公司(ViacomCBS)旗下的另一个儿童电视频道尼克儿童频道(Nickelodeon)在支持正义、平等和人权的节目中挂出了一个橙色屏幕，其中包含该电视网于1990年6月7日首次创建的“儿童权利宣言”(宣言of Kids&39；Rights)中的文字。“儿童权利宣言”是维亚康姆哥伦比亚广播公司(ViacomCBS)的另一项资产，该频道在屏幕上挂出了一个橙色屏幕，内容是支持正义、平等和人权。[33][34][35]。\n“纽约时报”的一项调查的标题是8分46秒，该调查利用监控录像、目击者录像和官方文件重现了围绕弗洛伊德之死的事件。[36]“大西洋月刊”的特约撰稿人格雷姆·伍德写了一篇专栏文章，题为“如何跪在脖子上9分钟？”，他在专栏中模拟了实施8分46秒的颈部束缚的物理条件。他写道，我粗糙的模拟器需要一只秒表，跪在卷起的瑜伽垫上，同时记录他20秒、1分钟、3分钟甚至更久的经历。[37]。\n^希尔，埃文；铁芬纳勒，艾纳拉；特里伯特，基督徒；乔丹，德鲁；威利斯，海利；斯坦，罗宾(2020年5月31日)。8分46秒：乔治·弗洛伊德是如何在警方拘留期间被杀的。纽约时报。ISSN电话：0362-4331。\n^Pozo，Nathalie(2020年6月2日)。数以千计的抗议者在波士顿举行死亡游行，抗议乔治·弗洛伊德之死。WHDH。\n丹佛针对乔治·弗洛伊德之死的抗议活动已进入第三天。丹维尔人。2020年5月30日。\n^卡尔弗，约旦；哈克，格雷斯(2020年5月29日)。8分46秒和固有的危险：乔治·弗洛伊德案的刑事起诉书中有什么。“今日美国”。\n阅读指控前警官德里克·肖文(Derek Chauvin)与乔治·弗洛伊德(George Floyd)之死有关的起诉书。PBS新闻一小时。2020年5月29日。\n快照：锡安斯维尔聚集在一起，向乔治·弗洛伊德致敬。当前出版。2020年6月2日。\n作者：Donna M.。(2020年6月2日)。100多人聚集在法明顿，为乔治·弗洛伊德伸张正义，畅所欲言，抗议。刘易斯顿太阳报。\n^库尼，这是奥德丽。欣厄姆教堂为乔治·弗洛伊德举办烛光守夜活动。爱国者账本。马萨诸塞州昆西。\n詹妮弗·艾耶；布赖恩·罗科斯(2020年6月2日)。在尤凯帕抗议乔治·弗洛伊德之死的示威者说，祈祷是有效的。雷德兰兹每日新闻。\n^算，奥斯汀。图森在邓巴展馆纪念乔治·弗洛伊德。图森周刊。\n沉默8分46秒：乔治·弗洛伊德在休斯顿守夜。sg.news.yahoo.com。\n8分46秒：市政府官员宣布在圣彼得市展示团结。我爱死这个堡垒了。2020年6月2日。\n帝国大厦暗夜向乔治·弗洛伊德致敬，敦促大家冷静。WCBS。2020年6月1日。\n这是一个迅速走红的网站，展示了乔治·弗洛伊德(George Floyd)被膝盖压在脖子上的经历。最新新闻，突发新闻，头条新闻。2020年6月1日。\n^STATT，尼克(2020年6月1日)。Spotify、Apple Music、YouTube和亚马逊联合起来支持“停电星期二”。边缘。\n安德烈·惠勒(^Wheeler，André)(2020年6月2日)。#TheShowMustBePased：音乐界计划为乔治·弗洛伊德举行默哀日。卫报。ISSN电话：0261-3077。\n^Ramos，Dino-Ray(2020年6月1日)。维亚康姆哥伦比亚广播公司(ViacomCBS)发布8分46秒的停电视频，致敬乔治·弗洛伊德(George Floyd)-更新。截止日期。\n^Scribner，Herb(2020年6月2日)。Nickelodeon停播了，播放了8分46秒的视频“我无法呼吸”。沙漠新闻。\n^@Nickelodeon(2020年6月1日)。我们都是改变的一部分#BlacklivesMatter&#34；(推特)-通过Twitter。\n^希尔，埃文；铁芬纳勒，艾纳拉；特里伯特，基督徒；乔丹，德鲁；威利斯，海利；斯坦，罗宾(2020年5月31日)。8分46秒：乔治·弗洛伊德是如何在警方拘留期间被杀的。纽约时报。ISSN电话：0362-4331。\n格雷姆·伍德(2020年5月31日)。你怎么能跪在脖子上9分钟呢？大西洋。", "note_en": "Jump to navigation  Jump to search  Amount of time, related to the killing of George Floyd, that a police officer kneeled on Floyd&#39;s neck\n    8′46″ ( 8 minutes and 46 seconds) is the length of time associated with the  killing of George Floyd, who died in police custody after police officer Derek Chauvin knelt on his neck for that duration.  [1]  [2] In the days following his death, and the  protests that followed, that specific time span has become a focus of commemorations and debates, especially around  Blackout Tuesday.  [3]\n The time has been specifically referenced in &#34; die-in&#34; protests in  New York,  Boston,  Philadelphia,  Portland and  Denver, where protesters lay down for 8 minutes and 46 seconds to protest  police brutality and the  racialized killings by law enforcement officers in the United States.  [4]  [5]  [6]  [7]  [8]  [9]  [10]\n    The duration of Officer Chauvin placing his knee on Floyd&#39;s neck lasted from approximately 8:19:38 p.m. to 8:27:24 p.m., and started after Floyd was taken from his car and restrained by the  Minneapolis Police. Chauvin proceeded to apply a neck restraint while Floyd was lying on his stomach. The  Hennepin County Attorney&#39;s complaint against Chauvin said:\n The defendant had his knee on Mr. Floyd&#39;s neck for 8 minutes and 46 seconds in total. Two minutes and 53 seconds of this was after Mr. Floyd was non-responsive. Police are trained that this type of restraint with a subject in a prone position is inherently dangerous.  [11]  [12]  [13]\n  Numerous marches and gatherings have used the duration  [14] to mark  moments of silence, vigils, prayers, or taking a knee.  [15]  [16]  [17]  [18]  [19]  [20]  [21]  [22] In  St. Petersburg, Florida, city officials announced that from June 2 to June 9, citizens should, &#34;join together in a silent and peaceful protest by standing outside on their front porch or yard for 8 minutes and 46 seconds&#34; each night at 8:00 P.M.  [23]\n Following the example of New York City&#39;s  Empire State Building,  [24] the  Kennedy Center in  Washington, D.C. has stated that it would go dark for nine nights to acknowledge the nearly nine minutes Floyd was held with a neck restraint.  [25] On May 31, 2020, a website called  8m46s.com was created which allows a user to play a timer of 8 minutes and 46 seconds, accompanied by a partial transcript of Floyd&#39;s final words.  [26] The text of the site homepage reads:\n On May 25th, 2020, Derek Chauvin held his knee on the neck of George Floyd for 8 minutes and 46 seconds, resulting in Mr. Floyd&#39;s death. I invite visitors to sit quietly and reflect for this same length of time. It feels like an eternity. A partial transcript of the incident is provided throughout.  [27]\n At the end of the 8 minutes and 46 seconds, the page reads &#34;Justice for George&#34; and links to two videos by   The Washington Post and   The Telegraph of Floyd&#39;s final moments, along with the  English Wikipedia page  about his death.  [27]\n   Radio stations, such as  KHKS in  Dallas, Texas, included 8 minutes and 46 seconds of silence in remembrance of Floyd.  [28] After return from the airing of silence, KHKS host Billy the Kidd said, &#34;8 minutes and 46 seconds, that&#39;s what it feels like. 8 minutes and 46 seconds, another black person&#39;s life ends, for no reason.&#34;\n Major streaming services  Spotify,  Apple Music,  Amazon Music, and  YouTube Music all scheduled special related programming to pay tribute to the death of Floyd.  [29] Spotify included a 8&#39;46&#34;-long pause in playlists, in solidarity with the music  hashtag # TheShowMustBePaused.  [30]  [31]\n  ViacomCBS aired an 8-minute-46-second video on their television channels at 5 p.m.  EST on June 1, 2020, consisting of the words &#34; I can&#39;t breathe&#34; in capitals, pulsing on a black background accompanied with breathing sounds.  [32] Chris McCarthy, president of the company&#39;s Entertainment and Youth Brands division, said, &#34;Today at 5 p.m. ET, the E&amp;Y brands and platforms around the world will go dark for 8 minutes and 46 seconds to show our support for the Black Lives Matter movement, and the fight against police brutality and racial inequality.&#34; Among the ViacomCBS properties that ran the video include  BET,  CBS Sports Network,  CMT,  Comedy Central,  Logo TV,  MTV,  Paramount Network, the  Smithsonian Channel,  TV Land, and  VH1. At the same time, children&#39;s television channel  Nickelodeon, which is another ViacomCBS property, put up an orange screen for 8&#39;46&#34; in &#34;support of justice, equality, and human rights.&#34; It contained language from the Declaration of Kids&#39; Rights, which the network first created on June 7, 1990.  [33]  [34]  [35]\n  &#39; 8 Minutes and 46 Seconds&#39; was the title of a New York Times investigation which reconstructed the events surrounding Floyd&#39;s death using security footage, witness videos and official documents.  [36] Staff writer  Graeme Wood of   The Atlantic wrote a column titled, &#34;How Do You Kneel on a Neck for Nine Minutes?&#34; where he simulated the physical conditions of applying 8 minutes and 46 seconds of neck restraint. He wrote, &#34;My crude simulator involved a stopwatch and kneeling on a rolled-up yoga mat,&#34; while recording his experiences at 20 seconds, 1 minute, 3 minutes and beyond.  [37]\n  ^   Hill, Evan; Tiefenthäler, Ainara; Triebert, Christiaan; Jordan, Drew; Willis, Haley; Stein, Robin (May 31, 2020).  &#34;8 Minutes and 46 Seconds: How George Floyd Was Killed in Police Custody&#34;.  The New York Times.  ISSN  0362-4331 .\n   ^   Pozo, Nathalie (June 2, 2020).  &#34;Thousands of protesters hold die-in, march through Boston to protest death of George Floyd&#34;. WHDH .\n   ^    &#34;Denver sees a third day of protests over George Floyd&#39;s death&#34;.  Denverite. May 30, 2020 .\n    ^   Culver, Jordan; Hauck, Grace (May 29, 2020).  &#34;8 minutes, 46 seconds and &#39;inherently dangerous&#39;: What&#39;s in the criminal complaint in the George Floyd case&#34;.  USA Today .\n  ^    &#34;Read the complaint charging ex-officer Derek Chauvin with George Floyd&#39;s death&#34;.  PBS NewsHour. May 29, 2020 .\n  ^    &#34;Snapshot: Zionsville gathers in solidarity to honor George Floyd&#34;.  Current Publishing. June 2, 2020 .\n ^   Perry, Donna M. (June 2, 2020).  &#34;More than 100 people turn out in Farmington for &#39;Justice for George Floyd&#39; speakout, protest&#34;.  Lewiston Sun Journal .\n  ^   Cooney, Audrey.  &#34;Hingham church hosts candlelight vigil for George Floyd&#34;.  The Patriot Ledger. Quincy, Mass .\n  ^   Iyer, Jennifer; Rokos, Brian (June 2, 2020).  &#34; &#39;Prayer is effective&#39; demonstrator says at Yucaipa protest of George Floyd&#39;s death&#34;.  Redlands Daily Facts .\n ^   Counts, Austin.  &#34;Tucson Honors George Floyd&#39;s Memory at The Dunbar Pavilion&#34;.  Tucson Weekly .\n ^    &#34;Silence for 8 minutes, 46 seconds: a George Floyd vigil in Houston&#34;.  sg.news.yahoo.com .\n ^    &#34;8 minutes and 46 seconds: City Officials announce show of solidarity in St. Pete&#34;.  I Love the Burg. June 2, 2020 .\n ^    &#34;Empire State Building Goes Dark To Honor George Floyd, Urge Calm&#34;. WCBS. June 1, 2020 .\n  ^    &#34;a website that is going viral and shows the time that George Floyd had a knee in his neck&#34;.  Latest News, Breaking News, Top News Headlines. June 1, 2020 .\n   ^   Statt, Nick (June 1, 2020).  &#34;Spotify, Apple Music, YouTube, and Amazon unite in support of Blackout Tuesday&#34;.  The Verge .\n  ^   Wheeler, André (June 2, 2020).  &#34;#TheShowMustBePaused: music industry plans day of silence for George Floyd&#34;.  The Guardian.  ISSN  0261-3077 .\n  ^   Ramos, Dino-Ray (June 1, 2020).  &#34;ViacomCBS Unveils 8-Minute, 46-Second Blackout Video Tribute to George Floyd – Update&#34;.  Deadline .\n ^   Scribner, Herb (June 2, 2020).  &#34;Nickelodeon goes off the air and plays &#39;I Can&#39;t Breathe&#39; video for 8 minutes, 46 seconds&#34;.  Deseret News .\n ^   @nickelodeon (June 1, 2020).  &#34;we are all part of the change #blacklivesmatter&#34; (Tweet)  – via  Twitter.\n ^   Hill, Evan; Tiefenthäler, Ainara; Triebert, Christiaan; Jordan, Drew; Willis, Haley; Stein, Robin (May 31, 2020).  &#34;8 Minutes and 46 Seconds: How George Floyd Was Killed in Police Custody&#34;.  The New York Times.  ISSN  0362-4331 .\n ^   Wood, Graeme (May 31, 2020).  &#34;How Do You Kneel on a Neck for Nine Minutes?&#34;.  The Atlantic .", "posttime": "2020-06-04 06:53:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "乔治", "title": "8‘46“", "title_en": "8’46”", "transed": 1, "url": "https://en.wikipedia.org/wiki/8′46″", "via": "", "real_tags": ["乔治"]}, {"category": "", "categoryclass": "", "imagename": "9cab0786f3d3e25fe510f3778d10c0f6.jpg", "infoid": 1005064, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "万达·科尔曼(Wanda Coleman)在1983年的诗歌“我的爱带来鲜花”中写道：“我把一只鸡喂五只。”“让十年前的衣服流行起来/让一件假貂皮大衣焕发青春。”科尔曼于2013年去世，是美国诗歌中最伟大的修补者之一：她在十四行诗等旧形式中发现了额外的穿着，并在能力测试、医疗报告和招聘广告等日常材料中翻找新形式。诗人们有时会吹嘘他们可怕的转变能力；科尔曼一生中的大部分时间都被艰辛所困扰，她总是把自己的吹嘘保持在骨子里。“我勉强度日，”她写道，但她的诗却有深厚的底蕴。考虑到科尔曼近乎混乱的原创性，遇到她赤裸裸地承认债务是令人感动的：“我向朋友借钱。”当我们中的许多人都在学习-并相互传授-如何用袜子或胸罩制作面膜的时候，科尔曼的诗歌可能正是我们所需要的鼓舞人心的、欣喜若狂的节俭的典范。\n由美国诗人特伦斯·海耶斯(Terrance Hayes)主编的新一卷她精选的诗集《邪恶的魅力》(Black Sparrow Press)让似乎常常喜欢局外人地位的科尔曼成为聚光灯下的焦点。她1946年出生于洛杉矶南部的瓦茨，一生中的大部分时间都生活在这座城市及其周边地区。她的母亲是一名管家，有时为电影明星工作，包括罗纳德·里根(Ronald Reagan)。她的父亲年轻时是一名拳击手，曾担任轻量级冠军阿奇·摩尔(Archie Moore)的陪练。“他们打了他几十年的头，”科尔曼写道，“直到伤口长出肿瘤，吞噬了他的眼睛。”她父母的经历肯定塑造了她的艺术坚持的透明性，即人们做了什么才能赚到足够的钱。她选择了一种收入微薄的艺术，这意味着，在她生命的大部分时间里，有两个孩子、经常独自养育子女的科尔曼不得不非常善于经济即兴发挥。在她的整个职业生涯中，她担任过和平队的招募人员、女服务员、医疗秘书、电台主持人、编剧和大学讲师--这是一份非常洛杉矶式的简历。科尔曼因在日间肥皂剧“我们生活的日子”(Days Of Our Lives)中的写作而在1976年获得艾美奖，并在多次重播的警察伙伴节目“星空与哈奇”(Starsky&Amp；Hutch)中写了一集。不久，她更加全身心地投入到自己的创作和表演中。她的第一本长篇诗集“疯狗黑夫人”于1979年出版，随后出版了十几本，以及短篇小说、散文和一部长篇小说。诗集“水银色素”(2001)入围国家图书奖。\n在接受美国诗歌协会的采访时，科尔曼将自己定义为“通常是跨种族结婚的洛杉矶非裔美国女权主义者，母系工人阶级贫穷的粉色/白领大学辍学的婴儿潮一代地球母亲和衣橱里的吸烟者，没有受到父亲的骚扰。”这份清单是一场表演，建立在自身的基础上；第二次被问到，她可能已经制作了一份全新的清单，其中有自己辉煌、有趣和悲惨的惊喜。在早期的一首诗中，科尔曼描述了一名警察在7点出现在她的门口(“性交中断洛杉矶警察局是一种拖累。”)。她“给他们看了化名#3”，回到床上，“又开始做爱了……但情况已经改变了。”\n美国诗人经常坚持化名和多重身份：鲍勃·迪伦(Bob Dylan)在他的第二首冠状病毒惊喜单曲中摘录了惠特曼(Whitman)著名的台词“我很大，我包含众多”。对于科尔曼来说，变形不是一种审美美德，而是一种不可避免的生存手段，也是一种致命的风险。她在“沃里兰的万达”(Wanda In Worryland)一书中写道：“众所周知，我会想象一种情况，然后投入其中。”她用枪去追人，用石头和拳头去追人，也用诗去追人：\n科尔曼唤起了“追赶”的两种感觉：对抗战士，但也追随、模仿和向作家学习。向她的前辈挺身而出是一种敬意。科尔曼经常称她的诗是“事后”的，而不是“为”她的导师、英雄和朋友写的。有诗“六月乔丹之后”、“伊丽莎白·毕晓普之后”、“赫比·汉考克的歌之后”和“孙拉之后”。这些献礼的范围暗示着致敬的形式多种多样：一首诗“追随约翰·贝里曼”是一场口角；另一首“追随科尔特兰”是一场爱情盛会。\n科尔曼的作品从她的偶像和竞争对手那里收复了失地，尽管它承认了他们的天才。一首“在艾伦·金斯伯格之后”的诗修改了他著名的诗“加州的一家超市”，这首诗本身就是对大师的点头。金斯伯格写道：“沃尔特·惠特曼，今晚我对你有什么想法。”科尔曼写道：“我对你有多么博亨克式的印象。”“当我巡游寻找布丁和不含柑橘的洗手液时，我在困惑和荒谬之间摇摇欲坠。”金斯伯格对美国超市的偷偷摸摸是一种与历史的对抗；科尔曼没有偷偷摸摸的奢侈，“在挑选胡椒磨坊的同时被相机镜头发现”，并做出了自己的作品。\n科尔曼的诗并排呈现，既恼怒又欢乐。她们都符合并超越了经常破产的黑人女性的困难，她们从事的职业可能是世界上报酬最低的。在咒骂她的艺术时，她经常运用其中一些最令人难忘的语言：诗歌是“失去现金的人的摇滚乐”，因为巨人们在好莱坞的厕所里发生冲突。然而，很少有诗人如此有力地描述了在一个被操纵以击败他们的经济中可能存在的地下自由。在受个人广告启发的当代迷你诗歌体裁“招聘广告”(Want Adds)中(C·D·赖特的“Personals”就是一个有影响力的例子)，科尔曼提到她找到伴侣的几率令人望而生畏(“黑人女性的再婚率为46%，而白人女性的再婚率为76%”)，并嘲笑白人新娘的“谦逊的处女座耻骨”，她的“头发”保持着“闪闪发光，没有纠结”。这就是“十四行诗”和祈祷词的“青春气息”。科尔曼没有提供那种一本正经的、蓬头垢面的素材，而是提供了她自己身体和她的诗歌的“古怪的咆哮”。你可以在标题中听到“想要广告”，这是对她自己名字的精彩演绎：在旺达·科尔曼的诗中，是想要增加了价值。--♦", "note_en": "“I make one chicken feed five,” Wanda Coleman wrote in “My Love Brings Flowers,” a poem from 1983. “Make clothes ten years old fashionable / rejuvenate one fake sable coat.” Coleman, who died in 2013, was one of the great menders in American verse: she found the extra wear in old forms like the sonnet and rummaged for new forms in everyday material, like aptitude tests, medical reports, and want ads. Poets sometimes brag about their fearsome powers of transformation; Coleman, beset by hardship for much of her life, kept her boasts closer to the bone. “I scrape bottom,” she wrote, and yet her poetry drew on deep reserves. Given Coleman’s almost chaotic originality, it is touching to encounter her stark admissions of debt: “I borrow from friends.” At a moment when many of us are learning—and teaching one another—how to make a face mask out of a sock or a bra, Coleman’s poetry might be just the model of inspired, ecstatic thrift we need.\n  A new volume of her selected poems, “ Wicked Enchantment” (Black Sparrow Press), edited by the American poet  Terrance Hayes, has brought Coleman—who often seemed to relish the position of outsider—into the spotlight. She was born in Watts, in South Los Angeles, in 1946, and lived most of her life in and around the city. Her mother worked as a housekeeper, sometimes for movie stars, including Ronald Reagan. Her father, a boxer in his youth, worked as a sparring partner for the light-heavyweight champion Archie Moore. “They beat his / head for decades,” Coleman writes, “until / a tumor rose from the wound and devoured his eyes.” Her parents’ experiences must have shaped her art’s insistent transparency about what people do to make enough money. And her choice of an art that barely paid meant that, for much of her life, Coleman, who had two children and often parented alone, had to get very good at economic improvisation. Throughout her career, she worked as a Peace Corps recruiter, a waitress, a medical secretary, a radio host, a screenwriter, and a university lecturer—a very L.A. résumé. Coleman won an Emmy, in 1976, for her writing on the daytime soap opera “Days of Our Lives,” and wrote an episode of the much rerun buddy-cop show “Starsky &amp; Hutch.” Soon she devoted herself more fully to her own writing and performing. Her first full-length book of poetry, “Mad Dog Black Lady,” appeared in 1979, and was followed by a dozen or so more, as well as short stories, essays, and a novel. “ Mercurochrome” (2001), a volume of poetry, was a finalist for the National Book Award.\n In an interview with the Poetry Society of America, Coleman defined herself as a “Usually Het Interracially Married Los Angeles-based African American Womonist Matrilinear Working Class Poor Pink/White Collar College Drop-out Baby Boomer Earth Mother and Closet Smoker Unmolested-by-her-father.” That checklist is a performance, building upon itself; asked a second time, she might have produced an entirely new inventory with its own brilliant, funny, and tragic surprises. In an early poem, Coleman describes a police officer appearing at her door at 7   (“Coitus interruptus LAPD is a drag.”) She “showed ’em alias #3” and, returning to bed, “started fucking again / but things had changed.”\n  American poets often insist on aliases and multiple identities: Bob Dylan plucked from Whitman’s famous line “I am large, I contain multitudes” for the title of his second coronavirus surprise single. For Coleman, shape-shifting was not an aesthetic virtue but an inevitable means of survival, and also a lethal risk. “I have been known to imagine a situation / and then get involved in it,” she writes, in “Wanda in Worryland.” She has “gone after people / with guns” and rocks and fists, but also “with poems”:\n  Coleman evokes both senses of “going after”: confronting fighters but also following, imitating, and learning from writers. To stand up to her predecessors was a form of homage. Coleman often designated her poems as being “after”—not “for”—her mentors, heroes, and friends. There are poems “after June Jordan,” “after Elizabeth Bishop,” “after the song by Herbie Hancock,” and “after Sun Ra.” The range of these dedications implies the variety of shapes a tribute can take: a poem “after John Berryman” is a spat; another “after Coltrane” is a lovefest.\n  Coleman’s work recoups ground from her idols and rivals, even as it acknowledges their genius. A poem “after Allen Ginsberg” modifies his famous poem “ A Supermarket in California,” which itself is a nod to a master. “What thoughts I have of you tonight, Walt Whitman,” Ginsberg writes. “What bohunkian images i have of you,” Coleman writes. “I sputter / between the confused and the absurd as i cruise for pudding / and citrus-free hand lotion.” Ginsberg’s surreptitious queering of the American supermarket was one kind of confrontation with history; Coleman, without the luxury of being furtive, is “detected via camera / lens while picking over pepper mills” and makes her own piqued revision, returning the experience of grocery shopping to quotidian reality. For a black woman, this reality includes the fear of being accused of stealing. “The only Walt here is Disney,” Coleman writes, trying to find cheap, healthy food. “The pork chops are killing me.”\n Coleman’s one hundred “American Sonnets” are scattered throughout five books: “African Sleeping Sickness” (1990), “ Hand Dance” (1993), “American Sonnets” (1994), “ Bathwater Wine” (1998), and “Mercurochrome.” Sonnets are often at odds with their own brevity, building into their short span little interludes and pauses. Rarely does a poet seem to want to take an already brutally brief form and speed it up. But Coleman’s sonnets are sprints, which is what makes their improvisations, modelled on American blues and jazz, so compelling. “American Sonnet 61” has short lines, a jagged right margin, and a tricky tone, both barbed and passionate: “reaching down into my griot bag,” Coleman finds ancestral license (a griot is a traditional West African poet) but also the patronizing expectation that she will pull out “womanish wisdom and wily / social commentary.” Instead, she produces “bricks / with which to either reconstruct / the past or deconstruct a head.” The sonnet becomes a poem about sadness and its costs. “Dolor,” she writes:\n  That last phrase, like so many of Coleman’s, abounds with sarcasm. One of the greatest poets ever to come out of L.A., she shaped the city’s literary scene like few before her. And yet, even after she’d forged her own “infinite alphabet of afroblues / intertwinings,” she still felt that she was measured against the literary gatekeepers’ idea of her “poetic promise,” now in “ruins.”\n Coleman’s poems present, side by side, exasperation and joy. They both tally and transcend the difficulties of an often broke black woman, working in perhaps the world’s least remunerative profession. Cursing her art, she often manages some of its most memorable language: poetry is “rood music for the cash bereft / as titans clash in the space of a Hollywood toilet.” Yet few poets write so powerfully about the underground freedoms possible in an economy rigged to defeat them. In “Want Ads,” part of a contemporary mini-genre of poems inspired by personal ads (C. D. Wright’s “ Personals” is an influential example), Coleman cites her daunting odds of finding a partner (“a 46% remarriage rate for black women contrasted / with 76% for white women”) and mocks the “modest maidenly pubis” of a white bride, her “tresses” kept “glistening and tangle free.” Such is the “youthful stuff sonnets / and prayers are made of.” Instead of that prim and coiffed material, Coleman offers the “kinky snarls” of her own body and of her poems. You can hear in the title, “Want Ads,” a brilliant play on her own first name: in Wanda Coleman’s poems, it’s the want that adds the value. ♦", "posttime": "2020-06-04 06:30:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "无畏,fearless,科尔曼", "title": "洛杉矶最伟大诗人之一的无畏发明", "title_en": "The Fearless Invention of One of L.A.’S Greatest Poets", "transed": 1, "url": "https://www.newyorker.com/magazine/2020/05/18/the-fearless-invention-of-one-of-las-greatest-poets", "via": "", "real_tags": ["无畏", "fearless", "科尔曼"]}, {"category": "", "categoryclass": "", "imagename": "48fdc18b047b58198590e217d68bb0f3.jpg", "infoid": 1005062, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国人正在跳过抵押贷款、汽车贷款和其他账单的支付。通常情况下，这可能意味着大规模的止赎、驱逐、收回汽车和人们的信用被摧毁。\n但这其中的大部分都被搁置了。国会的帮助和贷款人的宽大处理让数百万人避免了迫在眉睫的金融灾难。但这可能不会持续太久。\n问题是，这些努力旨在为在大流行中失去收入的人创造一座通向未来的金融桥梁-但这座桥只建了一半。首先，很多需要帮助的人仍然没有得到帮助。\n田纳西州布鲁克顿的乔纳森·贝尔德(Jonathan Baird)说，我妻子已经提交了失业证明，每周一次，已经连续10周了，但他们什么也没做。我们一直在苦苦挣扎。\n贝尔德是一名残疾退伍军人，领取小额残疾养老金。当大流行来袭时，他的妻子失去了家庭健康助理的工作。那是他们大部分的收入。和许多其他合同工一样，她在收集失业信息方面遇到了很长时间的拖延。\n与此同时，贝尔德说，他的抵押贷款公司告诉他，他没有资格参加联邦推迟还款的计划。许多房主从贷款人那里得到了错误或误导性的信息。这似乎就是在贝尔德的案件中发生的事情。\n贝尔德还打电话给福特，试图从他的皮卡付款中分得一杯羹。当我联系他们时，他们告诉我他们无能为力，他说。基本上只需付款，否则就要承担滞纳金。\n他说，一名呼叫中心的工作人员告诉他，他没有资格获得任何帮助，因为他去年拖欠了一笔车款。当NPR联系福特时，该公司表示，这不是其政策。在审查完案件后，该公司现在让贝尔德跳过他的下一次车款付款，他说这是一个很大的帮助。\n他说：我们像大多数人一样，一张一张地领工资。当你拿走薪水时，尤其是在这段时间里，我们必须做出决定--是要车还是要食物。\n福特表示，该公司允许许多在大流行相关的停工期间经济受损的客户跳过付款。\n数以百万计的人正在从各种贷款人那里获得帮助。根据信用机构TransUnion的最新数据，大约有300万个汽车贷款和1500万个信用卡账户正在进行某种计划，让人们跳过或支付部分款项。这些可能是较低的估计。根据分析公司Black Knight的数据，475万房主-占所有抵押贷款的9%-已经进入了忍耐计划。\n立法者不希望这些延迟付款影响信用评分。国会规定，在疫情爆发前已经支付的人，在参加困难计划时，仍然应该报告他们的支付是当前的。目前看来，这是可行的。\nTransUnion副总裁马修·科莫斯(Matthew Komos)表示，我们一直看到的是，整个行业的信用评分实际上都在上升。他表示，这既是按月计算的，也是按年计算的。\n但展望未来，倡导者表示，人们可能会遇到大麻烦，因为这些困难计划的条款可能随处可见。\n信用卡、汽车贷款、分期付款贷款，都没有联邦指导方针，非营利性负责任贷款中心(Center For Responsible Lending)的董事阿拉塞利·帕纳米诺(Aracely Panameño)说。\n她说，当需要弥补所有跳过的付款时，联邦政府对住房抵押贷款的偿还计划有规定，但对许多其他类型的贷款没有规定。所以她说立法者需要保护人们。否则，她说，贷款人可能会提出超出人们负担能力的要求。帕纳米诺说，你必须有能力以负担得起的方式支付欠款。\n国家消费者法律中心的奇奇·吴(音译)对此表示赞同。专注于消费者信用问题的律师吴表示，如果没有更好的保护措施，到了弥补欠款的时候，将会有很多人遭受巨大的信用报告伤害。\n根据抵押贷款的规定，消费者权益倡导者表示，在疫情爆发期间受到经济伤害的绝大多数人，如果进入了忍耐计划，他们错过的付款应该转移到贷款期限结束时。\n这使每月还款额与以前保持不变，只是延长了偿还贷款的时间。其他一些类型的贷款人也在使用这种方法。福特告诉NPR，它正在收取拖欠的款项，并将它们转移到汽车贷款期限结束时。\n对于他们来说，许多贷款人表示，为了继续帮助人们，他们需要一个政府渠道，通过这个渠道自己借钱。比尔·辛普勒(Bill Himpler)是美国金融服务协会(American Financial Services Association)的总裁兼首席执行官，该协会代表发放汽车贷款、个人贷款和抵押贷款以及提供信用卡的贷款人。\n他说：如果我们因为事情停顿而不能让灯一直亮着，那对任何人都没有好处。它对顾客不好；对公司不好；对经济不好。\n立法者需要解决的一件大事是是否延长联邦政府扩大的失业救济金。拿到失业救济金是大多数失业的人能够支付房租和维持生计的最大原因。虽然有些人正在重返工作岗位，但还有许多人没有。\n当每周600美元的失业保险在7月底到期时，大多数人预计会有巨大的流离失所风险，保障性住房非营利组织企业社区合作伙伴(Enterprise Community Partners)的安德鲁·雅卡博维奇(Andrew Jakabovics)说。驱逐很可能会达到顶峰。\n他说，随着美国部分地区暂停驱逐的期限到期，需要立即采取行动，帮助那些在大流行持续期间无法支付房租的人。\n与此同时，与冠状病毒爆发的许多其他方面一样，在社会经济和种族界限上也存在差异。Panameño说，她的组织做了一项全国调查，看看大流行发生后，谁在支付账单方面有困难。\n她说，25%的拉丁裔已经拖欠了付款。百分之二十八的非裔美国人落后了。相比之下，落后的白人比例为12%。", "note_en": "Americans are skipping payments on mortgages, auto loans and other bills. Normally, that could mean massive foreclosures, evictions, cars repossessions and people&#39;s credit getting destroyed.\n  But much of that has been put on pause. Help from Congress and leniency from lenders have kept impending financial disaster at bay for millions of people. But that may not last for long.\n  The problem is that these efforts aim to create a financial bridge to the future for people who&#39;ve lost their income in the pandemic — but the bridge is only half-built. For one thing, the help still isn&#39;t reaching many people who need it.\n  &#34;My wife has filed, certified every week for her unemployment for 10 weeks now, and they have done nothing,&#34; says Jonathan Baird of Bruceton, Tenn. &#34;We&#39;ve struggled.&#34;\n     Baird is a disabled veteran who gets a small disability pension. When the pandemic hit, his wife lost her job as a home health aide. That was most of their income. And like many other contract workers, she has run into long delays trying to collect unemployment.\n  Meanwhile, Baird says his mortgage company told him that he didn&#39;t qualify for a federal program to postpone payments. Many homeowners have been given wrong or  misleading information from lenders about that. And it appears that is what happened in Baird&#39;s case.\n  Baird also called  Ford to try to get a break on the payments for his pickup truck. &#34;When I contacted them, they told me that there was nothing they could do,&#34; he says. &#34;Just basically make your payment or suffer the late fees.&#34;\n    He says a call center worker told him that he didn&#39;t qualify for any help because he was late on a car payment last year. When NPR contacted Ford,  the company said that is not its policy. And after reviewing the case, the company is now letting Baird skip his next car payment, which he says is a big help.\n  &#34;We&#39;re paycheck to paycheck like most people,&#34; he says. &#34;And when you take away that paycheck, especially for this length of time, we have to make the decision — a vehicle or food.&#34;\n  Ford says the company is allowing many customers hurt financially during the pandemic-related shutdowns to skip payments.\n     And millions of people are getting help from all kinds of lenders. According to the latest available numbers from the credit bureau TransUnion, about 3 million auto loans and 15 million credit card accounts are in some kind of program to let people skip or make partial payments. Those are probably low estimates. According to the analytics company Black Knight, 4.75 million homeowners — or  9% of all mortgages — have entered into forbearance plans.\n  Lawmakers don&#39;t want these delayed payments to hurt credit scores.   Congress mandated that people who were current on their payments before the outbreak should still be reported as current on their payments while in a hardship program. And that appears to working for now.\n  &#34;What we&#39;re seeing consistently across the board is actually credit scores are moving upward,&#34; says Matthew Komos, a vice president at TransUnion. He says that&#39;s both on a month-to-month and year-over-year basis.\n     But looking ahead, advocates say people could run into big trouble because the terms of these hardship programs can be all over the map.\n  &#34;Credit cards, auto loans, installment loans, there are no federal guidelines,&#34; says Aracely Panameño, a director at the nonprofit Center for Responsible Lending.\n  She says when it comes time to make up for all those skipped payments, there are federal rules for repayment plans for home mortgages but not for many other types of loans. So she says lawmakers need to protect people. Otherwise, she says, lenders could make demands beyond what people can afford. &#34;You must have a capacity to catch up with your payments in an affordable way,&#34; Panameño says.\n  Chi Chi Wu with the National Consumer Law Center agrees. Without better protections, when it comes time to make up for the missed payments, &#34;there&#39;s going to be a lot of people who could experience massive credit reporting harm,&#34; says Wu, an attorney focusing on consumer credit issues.\n  Under the rules for mortgages, consumer advocates say the vast majority of people hurt financially during the outbreak who entered a forbearance plan should have their missed payments moved to the end of the loan term.\n  That keeps monthly payments the same as they were before and just extends the amount of time to pay the loan. Some other types of lenders are using this approach. Ford tells NPR it is taking missed payments and moving them to the end of the auto loan term.\n     For their part, many lenders say that to keep helping people, they need a government conduit through which to borrow money themselves. Bill Himpler is president and CEO of the American Financial Services Association, which represents lenders who make car loans, personal loans and mortgages and offer credit cards.\n  &#34;If we can&#39;t keep the lights on because things have seized up, it&#39;s not good for anybody,&#34; he says. &#34;It&#39;s not good for the customer; it&#39;s not good for the company; it&#39;s not good for the economy.&#34;\n  One big thing lawmakers need to resolve is whether to extend the federal government&#39;s expanded unemployment benefits. Getting that unemployment money is the biggest reason most people who&#39;ve lost jobs are able to pay rent and keep a roof over their heads. And while some people are going back to work, many others are not.\n  &#34;When the $600-a-week unemployment insurance runs out at the end of July, most people expect tremendous displacement risk,&#34; says Andrew Jakabovics with the affordable housing nonprofit Enterprise Community Partners. &#34;Evictions are likely to go through the roof.&#34;\n     And with eviction moratoriums expiring in parts of the country, he says action is needed right away to help people who can&#39;t pay the rent as the pandemic drags on.\n  Meanwhile, as with many other aspects of the coronavirus outbreak, there are disparities along socioeconomic and racial lines. Panameño says her group did a national survey to see who was having trouble paying their bills after the pandemic struck.\n  &#34;Twenty-five percent of Latinos had already fallen behind with their payments,&#34; she says. &#34;Twenty-eight percent of African Americans had fallen behind. That compares to 12% of whites that had fallen behind.&#34;", "posttime": "2020-06-04 06:22:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "浪潮,americans,贷款", "title": "数百万美国人跳过付款，违约和驱逐浪潮迫在眉睫", "title_en": "Millions of Americans Skipping Payments as Wave of Defaults and Evictions Looms", "transed": 1, "url": "https://www.npr.org/2020/06/03/867856602/millions-of-americans-skipping-payments-as-tidal-wave-of-defaults-and-evictions-", "via": "", "real_tags": ["浪潮", "americans", "贷款"]}, {"category": "", "categoryclass": "", "imagename": "137b4d7bb4a601f1a44b5005211eb5b1.png", "infoid": 1005061, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考虑到你读到的所有可怕的企业、经济和社会新闻，最近股价一直在上涨，你觉得奇怪吗？是的，但这是我个人对可能发生的事情的解释。\n想象一下，我想赚一年左右的钱，而不冒资本损失的风险。我有两个基本选择。第一个选择：购买并持有一年期美国国债，每年赚取0.167%的利息。\n第二种选择稍微复杂一些：购买一只支付股息的股票，然后购买看跌期权，并在同一只股票上写下看涨期权，其中执行价(期权持有人可以买卖标的股票的价格)与股票目前的交易价格相同。这样一来，如果未来股价下跌，看跌期权的价格也会上涨同样的幅度，我的净亏损为零。如果股价上涨，那么无论是谁购买了我写的看涨期权，他都将行使该期权，而我将不会从股价上涨中获得任何好处。在这种交易中，如果股价变化，我的资本没有上行风险，也没有下行风险-只有赚取股息的权利。如果我将从股息中赚取的金额(减去我建立交易的成本)高于如果我购买一年期国债可以赚取的0.167%的收益率，那么我最终可能会通过持有股票和期权而不是债券来做得更好。反之亦然。\n事实上，如果股票的额外股息收益率足够高和足够确定，我和其他交易员可能都会愿意借入债券，卖空债券，并用出售所得购买股票，购买看跌期权和卖出看涨期权。这样，我们就可以用别人的钱赚取收益套利，而不会有资本损失的风险。如果我们中有足够多的人进行这种交易，那么净影响要么是债券价格下跌，要么是股价上涨，或者两者兼而有之。我们将继续打击这种交易，直到股价上涨(或债券价格下跌)，达到股票/期权策略的预期股息收益率不会明显高于无风险美国债券收益率的水平。\n根据Marketwatch.com的数据，长期看涨期权的价格在27.72%至25.39%之间，该期权的所有者有权在明年6月18日之前的任何时候以308.08美元的价格购买一股间谍公司的股票。为了说明起见，在本例中，我将使用28.86美元的要价作为我写看涨期权时得到的价格。看跌期权的价格使所有者有权在明年6月18日之前的任何时候以308.08美元的价格出售一股间谍股票(即使间谍崩溃的价格)在29.99美元到31.69美元之间-在这个例子中，我将使用31.2美元的出价作为我购买看跌期权的价格。\n总体而言，我将花费308.89美元购买间谍股票，卖出看跌期权赚取28.86万美元，花31.2美元购买看跌期权。我的总花销是311.23美元。从现在到明年，无论间谍的价格如何，都不会影响我的资本-截至2021年6月18日，我保证拥有价值308.89美元的资本(减去交易成本)。\n既然我现在花了311.23美元，明年肯定会有308.89美元，我的股票/期权策略肯定会损失2.34美元。我还将失去从我的311.23美元中赚取无风险利息的机会(如果你假设我可以从311美元的一年期国债投资中赚取0.167%的利息，这大约是52美分)。这意味着只有当我非常有信心能从间谍身上赚取至少2.86美元的红利时，我才会进行这笔交易。\n现在假设SPY的年度股息收益率为1.88%。这意味着，如果我购买了间谍公司的股票，并持有该公司股票约一年，直到2021年6月18日，我将赚取或累计价值约5.76美元的股息。这比我建立股票/期权交易的2.86美元支出和机会成本高出很多。这就是为什么你看到我的耳朵现在竖起了，眼睛又黑又亮，尾巴肿了。\n啊，唉，但是如果我百分之百确定那个间谍会给我5.76美元的红利，那就不需要动脑筋了。我可能会借入美国国债，卖空它们，用所得资金买入SPY，买入一年期看跌期权，卖出一年期SPY看涨期权，然后通过签订利率期货合约来防范利率变化的风险(这是为了确保我在不得不回购国债以弥补空头头寸时不会赔钱)。如果交易的总成本与额外收益相比足够低，我可能会有套利机会。像我这样贪婪的小个子，我可以向你保证，我会继续做这种交易，直到间谍的价格上升到一个水平(或者利率或期权溢价上升到一个我只能实现收支平衡的水平)为止，我可以向你保证，我会继续做这种交易，直到间谍的价格上升到一个水平(或者利率或期权溢价上升到一个水平)，我才能做到收支平衡。\n但是如果我认为那个间谍有50%的可能性会削减50%的股息呢？换句话说，我预计不会有5.76美元的股息。我预计会有4.32美元的股息。这仍然高于这笔交易2.86美元的支出和机会成本。我和其他与我一样预计标普500指数将削减股息的交易员仍会叫嚣着借入美国国债，卖空这些国债，并用所得资金购买间谍债券，买入间谍看跌期权，卖出间谍期权，并使用期货合约为利率风险提供保险(只要交易成本不会打消我们这样做的动机)。再说一次，如果有足够多的交易员这样做，那么你会预计债券价格会下跌，股价会反弹，或者两者兼而有之。\n但这就是问题所在。如果美联储(Federal Reserve)通过量化宽松计划支撑债券价格怎么办？在这种情况下，美联储花在购买债券上的每一美元最终都落入了任何抛售美国国债的人手中…。包括我和我的同类。只要股价和期权溢价足够低，足以提供足够诱人的额外收益，交易员就会拿着这些美元购买股票，同时买入和买入股票期权，直到这些股票和股票期权的价格上升到与利率一致的水平。相应地，当美联储阻止债券价格下跌，因为交易员抛售美国国债时，那么股价和/或股票期权溢价必须走高。\n因此，美联储向债券市场注入的那么多美元推高了股价和/或期权溢价，有时会让我们这些眼睁睁看着失业率螺旋式上升、致命的病毒感染在全球蔓延、伴随着内乱、企业利润下降以及似乎永无止境的可怕恐怖事件的人感到困惑。\n那么，我们今天的处境如何呢？我相对不知情的猜测是，标准普尔500指数成份股公司中的许多公司今年将削减股息。如果你问我(我真的不比你更清楚)，我会说，标准普尔500指数总股息削减约40%似乎是一个非常合理的基准。这意味着，如果我购买了间谍公司的股份，我就不会指望5.76美元的股息。我估计大概是3.5美元左右。如果我以今天的价格购买间谍公司的股份，然后将其捆绑成一只装饰着看跌期权和看涨期权的感恩节火鸡(假设总成本和机会成本为2.86美元)，我预计一年可以多赚64大便士。事实上，间谍的价格可能会再上涨几个百分点，然后我进行这笔交易的动机才会开始消失。当你停下来想一想的时候，标准普尔500指数相对于利率和期权溢价的价格实际上表明，总体来说，整个市场本身似乎预测明年的股息总体削减40%略差一些。如果实际的股息削减幅度低于这一水平，如果利率和期权价格保持不变(从来没有这样做过)，股价可能(从这次行动的角度来看，应该是)走高…。不管你每天早上在新闻上读到什么烈火和硫磺。如果今年的实际股息削减幅度大大超过40%呢？也许华尔街不会有这么漂亮的景象。\n所有这一切对我个人选择投资我自己的钱的方式有什么影响(我指出，就你可能选择如何投资自己的钱来说，这是无关紧要的)？很简单：我渴望持有我认为特别不可能削减股息的公司的股票。拥有投资级信用评级、高利润率、经久耐用的产品和服务以及竞争优势的公司已经并能够继续经受住时间的考验。我也不介意分享我拥有的公司名单(我认为这实际上是最好的做法，因为它暴露了这位特定作者有意识和无意识的偏见，毫无疑问，这些偏见很多)。另外，有时候你会看到\n自4月份以来，我的投资组合(其中一些已经出售)中有多少家公司削减了股息？根据最新统计，到目前为止略低于6%。\n就我的目标而言，这一结果是如何发挥作用的？我的目标是投资于那些比标准普尔500指数(S&P；500)中的普通公司更不容易削减股息的公司。巴伦公司(Barron&39；‘s)最近报告称，标准普尔500指数成份股公司中有58家要么削减了股息，要么宣布削减股息。据StreetInsider.com报道，在2019年支付股息的423家公司中，今年到目前为止，标准普尔500指数的股息削减幅度约为14%。只要我的投资组合股息存活率比标准普尔500指数的股息存活率保持得更好，我就会继续做我一直在做的事情，直到它停止运作……。在这一点上，我会做一些不同的事情。\n披露：我是/我们很久了。这篇文章是我自己写的，它表达了我自己的观点。我没有得到补偿(除了寻求阿尔法)。我与本文中提到的任何一家公司都没有业务关系。\n补充说明：我不是投资顾问，本文中的任何内容都不能作为投资建议。我不能保证这里写的任何一件事的准确性，除了我拥有的股票清单和每只股票在我投资组合中所占的百分比。没有理由认为我比你知道得更多或更好。是的，我做多附件图表中列出的每一个职位，除了这些职位之外，我没有其他的财务职位。", "note_en": "Do you think it odd that stock prices have been rising recently, given all the terrible corporate, economic and social news that you&#39;ve been reading about? I do, but here is my personal explanation of what might be going on.\n  Imagine that I would like to earn money for about one year without risking capital losses. I have two basic choices. Choice number one: buy and hold a one-year US Treasury and earn  .167% in interest per year.\n    Choice number two is a bit more involved: purchase a stock that pays a dividend, and then purchase a put option and write a call option on that same stock where the strike price (the price at which the option holder can buy or sell the underlying stock) is the same as the price the stock is trading at right now. That way, if the stock price falls in the future, the price of the put option rises by the same amount and my net loss is zero. If the stock price rises, then whoever bought the call option that I wrote will exercise that option and I&#39;ll earn no benefit from the rising stock price. In this trade I have no upside and no downside risk to my capital if stock prices change - only a right to earn dividends. If the amount I stand to earn in dividends (reduced by my cost for setting up the trade) is greater than the .167% yield I could earn if I bought a one-year Treasury, then I might end up doing better by owning stocks and options as opposed to bonds. And vice versa.\n  In fact, if that extra dividend yield on stocks is high enough and certain enough, both I and other traders will probably be willing to borrow bonds, sell the bonds short, and use the sales proceeds to buy stock, buy put options and sell call options. That way, we can earn a yield arbitrage using someone else&#39;s money without the risk of capital losses. If enough of us place that trade, then the net effect will be either falling bond prices, rising stock prices or both. And we will keep hitting that trade UNTIL stock prices rise (or bond prices fall) to a level where the expected dividend yield on the stock/options strategy isn&#39;t appreciably higher than the yield on risk-free US bonds.\n         According to Marketwatch.com, the price for a long-term call option that gives the owner of that call option a right to buy one share of SPY for $308.08 any time until June 18th of next year costs somewhere between $27.72 and $25.39. For illustration&#39;s sake, I&#39;ll use the ask price of  $28.86 as the price I&#39;ll get if I write a call option in this example. The price for a put option that gives the owner a right to sell one share of SPY for $308.08 anytime until June 18th of next year (even if the price for SPY crashes) is between $29.99 and $31.69 - I will use the bid price of $31.20 as the price I will pay to buy a put option in this example.\n      Overall, I will spend $308.89 to buy a share of SPY, earn $28.86 for selling a call, and spend $31.20 to buy the put. My total outlay is $311.23. No matter what the price for SPY does between now and next year cannot affect my capital - I am guaranteed to own $308.89 worth of capital as of June 18th, 2021 (minus transaction costs).\n  Since I am spending $311.23 now and will definitely have $308.89 next year, I will certainly lose $2.34 with my stock/option strategy. I&#39;ll also lose the opportunity to earn risk-free interest on my $311.23 (which is about 52 cents if you assume I could earn .167% on a $311 investment in one-year Treasuries). That means I will  only place that trade if I am highly confident that I can earn at least $2.86 in dividends on SPY.\n   Now assume that the annual dividend yield for SPY is 1.88%. That means that if I bought a share of SPY and held the stock for about one year until June 18th of 2021, I&#39;d stand to earn or accrue dividends worth about $5.76. That&#39;s quite a bit higher than my $2.86 outlay and opportunity cost to set up my stock/option trade. This is why you see that my ears are now perked up, eyes black and shiny, tail puffy.\n    Ah, alas, but if only I was 100% certain that SPY would pay me $5.76 in dividends for if I were, then it would be a no-brainer. I might borrow US Treasuries, short sell them and use the proceeds to buy SPY, buy a one-year put option and sell a one-year call option on SPY, and then insure myself against the risk of interest rate changes by entering an interest rate futures contract (that&#39;s to make sure I don&#39;t lose money when I have to buy back treasuries to cover my short position). If the total costs of the trade are low enough compared to the extra yield, I might have an arbitrage opportunity. Greedy little man that I am, I can assure you that I&#39;d keep doing that trade until the price of SPY rises to a level (or interest rates or options premiums rise to a level) where I&#39;d only be able to break even.\n  But what if I thought that it was 50% likely that SPY would cut the dividend by 50%? In other words, I don&#39;t expect $5.76 in dividends. I expect $4.32 in dividends. That&#39;s still higher than the $2.86 outlay and opportunity cost for this trade. Both I and other traders who share my projections for dividend cuts on the S&amp;P 500 would still clamor to borrow Treasuries, short sell those Treasuries and use the proceeds to buy SPY, buy put options on SPY and sell call options on SPY and insure against interest rate risk using futures contracts (as long as the transactions costs don&#39;t dissolve our incentives to do so). And again, if enough traders did that, then you&#39;d expect bond prices to fall, stock prices to rally, or both.\n   But here&#39;s the rub. What if the Federal Reserve is supporting bond prices through a quantitative easing program? In that case, every dollar that the Fed spends to buy bonds ends up in the hands of anyone who is selling US Treasuries... including me and my ilk. So long as stock prices and options premiums are low enough to offer a sufficiently enticing bit of extra yield, traders will take those dollars to buy stocks and both write and buy stock options until the price for said stocks and stock options has risen to a level somewhere in line with interest rates. Accordingly, when the Fed prevents bond prices from falling as traders sell Treasuries, then stock prices and/or stock options premiums   MUST move higher.\n  &#39;Tis thus that much and many of the dollars that the Fed is pumping into the bond market push stock prices and/or options premiums ever higher, sometimes baffling those of us who are watching unemployment figures spiral skyward, lethal viral infections spreading around the globe accompanied by civil unrest, falling corporate profits and a seemingly unending parade of horrible terrible terribles.\n  So where does that leave us today? My relatively uninformed guess is that many companies in the S&amp;P 500 will cut dividends this year. If you asked me (and I don&#39;t really know any better than you do), I&#39;d say that a total dividend cut of about 40% for the S&amp;P 500 seems like a very plausible baseline to work from. That means that if I bought a share of SPY, I wouldn&#39;t expect $5.76 in dividends. I would expect about $3.50, maybe. An extra sixty-four big shiny pennies is what I would expect to earn in a year if I bought a share of SPY at today&#39;s prices and then trussed it up like a Thanksgiving turkey garnished with put and call options (assuming a total cost and opportunity cost of $2.86). In fact, the price for SPY could rise another few percentage points before my incentive to place this trade starts to evaporate. And when you stop to think about it, the fact that the price on the S&amp;P 500 is where it is today relative to interest rates and options premiums actually suggests that overall, the overall market  itself seems to be forecasting something a bit worse than a 40% overall dividend cut over the next year. If the actual dividend cuts come in less than that, and if interest rates and options prices remain constant (which they never do), stock prices could (and from the standpoint of this exercise, SHOULD) march higher... irrespective of whatever fire and brimstone you read in the news each morning. And if actual dividend cuts this year meaningfully exceed 40%? Maybe not going to be such a pretty sight on Wall Street.\n   How does all of this impact the way that I personally choose to invest my own money (which I point out is irrelevant as far as how  you might choose to invest your own money)? Easy: I aspire to own stocks in companies that I think are particularly unlikely to cut dividends. Companies with investment grade credit ratings, high profit margins, enduring products and services and competitive advantages that have stood and can continue to stand the test of time. Nor do I mind sharing the list of companies that I own (which I think is actually best practices since it discloses this particular author&#39;s conscious and unconscious biases which, no doubt, are legion). Plus, sometimes you see what other people are doing and it might give you ideas about what you might want (or not want) to do in terms of your own investments:\n      Portfolio performance relative to the S&amp;P 500 over the last five years according to PortfolioVisualizer.com? Better - mostly due to lower losses during the Coronavirus-induced stampede that trampled stock prices earlier this year.\n    Annualized Alpha for the last five years according to PortfolioVisualizer.com (which is, after all, what we&#39;re all really talking about here at SeekingAlpha.com)? 3.49%.\n     How many companies in my portfolio (some of which I have since sold) have cut dividends since April? At last count, just under 6% so far.\n    How does that result work in terms of my goal to invest in companies that are less prone to dividend cuts than the average company on the S&amp;P 500?  Barron&#39;s recently reported that there are 58 companies in the S&amp;P 500 that have either cut dividends or announced dividend cuts. Of the  423 dividend paying companies in 2019 (reported by StreetInsider.com), that comes to something like a 14% dividend cut rate for the S&amp;P 500 so far this year. As long as my portfolio dividend survivor rate holds up better than the dividend survivor rate for the S&amp;P 500, I&#39;ll keep doing what I&#39;ve been doing until it stops working... at which point I will do something different.\n  Disclosure:  I am/we are long RY.  I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n Additional disclosure: I am not an investment advisor and nothing in this article can be relied upon as investment advice. I do not guarantee the accuracy of one single thing written here, other than the list of stocks I own and the percentage of my portfolio each of those stocks constitutes. There is no reason to assume that I know anything more or better than you do. I don&#39;t. And yes, I am long every position listed in the attached chart and have no other financial positions besides those.", "posttime": "2020-06-04 06:22:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "prices,期权", "title": "在经济和公司收益不佳的情况下，股价可能会上涨", "title_en": "Stock Prices Can Rally When the Economy and Corporate Earnings Aren't", "transed": 1, "url": "https://seekingalpha.com/article/4351713-how-stock-prices-can-rally-when-economy-and-corporate-earnings-arent", "via": "", "real_tags": ["prices", "期权"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005059, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在选择学习一门新的编程语言时，您应该寻找什么？答案可能会因您的项目或职业目标而异，但作为基本起点，您需要一种语言：\n在本文过程中，我们将向您展示长生不老药与上述所有点的关系。在我们开始之前，有必要让你稍微了解一下我。我喜欢认为自己是一个多语种开发人员。多年来，我使用过Elm、Lua、Rust、Dart、Go、Kotlin、Scala、C、C++、Perl、Ruby、PHP、Python、Java、JavaScript、Erlang和Elixir。如果让我在2020年作为一名全新的开发人员只选择一种语言学习，那就是长生不老药。\n乐趣可能不是唯一重要的考虑因素，但它是一个不应被低估的因素。ELIXIR的语法与Ruby on rails有很多相似之处；两者都是高级的、可读的、有趣的编程语言。正如Pinterest的一位资深开发人员曾经在谈到他过渡到Elixir的决定时所说的那样：“我想，‘哇，它和Ruby一样有趣，但它也有一些特点--它的性能真的很好。’”就我个人而言，我喜欢少写代码的能力。它是一种富有表现力的语言，容易理解，阅读速度也很快。例如，使用Tesla库，我可以在20行代码中实现与像Paypal这样的提供商的集成。如果需要深入这个图书馆，我很乐意安排一个实践研讨会或一对一电话。\n我们都听说过数字化转型，对吗？随着人口的增长，越来越多的服务转移到网上，系统在处理数十亿并发用户的巨大高峰方面面临着越来越大的压力。长生不老药在BEAM VM上运行。为并发而构建的系统。因此，它可以轻松地处理这些用户峰值。对于那些对并发是什么以及它是如何工作的感兴趣的人，我们有一个比较JVM和BEAM VM的博客，它很好地解释了这一点。Pinterest和Bleacher Report只是两家广受欢迎的大公司，他们为了帮助解决可伸缩性问题而转而使用Elixir。以我们的一个客户端Bleacher Report为例，他们能够从150台服务器迁移到5台服务器。他们不仅降低了这些物理基础设施要求，还能够以更快的时间处理更多流量。一种可以依赖于可伸缩、容错的语言总是会被知名公司所寻求。\n长生不老药是一种增长中的语言，正在以相当快的速度被采用。因此，Elixir的开发人员有机会为各种公司工作，如百事可乐、Pinterest、孤独星球或MBTA。而且这份名单还在继续增长。看看这份仅在过去12个月内增加的公司名单。\n正如您可能对任何新技术或编程语言所期望的那样，Elixir社区一开始规模很小。如今，Elixir拥有一个持续发展的蓬勃发展的社区，在欧洲和美国举办的ElixirConf、EMPEX、Code Elixir LDN和GIG City Elixir等精彩活动，以及世界各地的Meetups。这个社区意味着语言随着新工具的不断增长和发展，总会有人提供灵感或帮助找到问题的解决方案。\n工具使语言更通用，任务更容易。这意味着您不必在每个新的用例中都重新发明轮子。elixir已经拥有许多强大的工具，包括Phoenix LiveView，它可以让开发人员无需编写一行JavaScript或Crawly就可以构建实时的前端Web应用程序，这使得在Elixir中进行网络爬行和数据抓取变得很容易。Elixir不仅有各种各样的工具可用，而且正如我们前面提到的，还有一个充满激情的社区，人们不断地创造新的工具并改进可用的工具。\n考虑到其可伸缩性性能和起源于Erlang，Elixir成为流行的后端选择也就不足为奇了。如上所述，Phoenix LiveView为Elixir开发者提供了一种简单、省时、优雅的方式来制作前端应用程序。最后，神经框架允许在硬件端进行嵌入式软件开发。因此，Elixir是一种可以在整个技术堆栈中采用的语言。这不仅使它成为一个对企业有吸引力的选择；它还为这种语言将您带入开发人员的领域打开了大门。\n重视文档的语言和社区使知识共享变得容易。Elixir社区的高标准文档使您更容易学习该语言，但也使任何人都更容易为其改进和发展做出贡献。\n有很多来自面向对象语言的人的故事，他们发现学习长生不老药的过程使他们在自己选择的语言中成为一名更好的程序员。学习一种新的纯函数式编程范例会迫使您检查您处理编程的方式。通过这样做，它可以帮助你确定可以改进的习惯，并向你介绍新的思考问题的方式。无论您使用的是哪种语言，这种全新的观点对于您将来所做的所有开发都是无价的。对于我们使用Ruby on rails的朋友来说，这一点尤其正确，因为您将熟悉Elixir语法，使您可以轻松过渡到函数式并发编程。\n对于选择哪种编程语言，每个人都会有不同的动机和考虑。但这些都是我建议你在2020年学习长生不老药的原因，在接下来的几年里。\n有很多方法可以开始。首先，你应该进入万灵丹官方网站的入门页面。我们还提供了一些可免费下载的药剂软件包。其次，我们提供各种各样的长生不老药培训，包括我们为初学者提供的长生不老药编程培训。要开始进入社区，ElixirForum是一个很好的起点，也可以在Twitter上搜索#Elixirlang和#MyElixirStatus标签。\n回到博客", "note_en": "What should you look for when choosing to learn a new programming language? The answer might vary depending on what your project or career goals are, but as a basic starting point, you want a language that:\n  Over the course of the article, we’ll show you how Elixir rates in relation to all of the above dot points. Before we start, it’s worth letting you know a little bit about me. I like to consider myself a polyglot developer. Over the years I have worked with Elm, Lua, Rust, Dart, Go, Kotlin, Scala, C, C++, Perl, Ruby, PHP, Python, Java, JavaScript, Erlang and Elixir. If I were to only pick one language to learn as a brand new developer in 2020, it would be Elixir.\n  Fun might not be the only important consideration, but it is one that should not be underestimated. Elixir’s syntax shares a lot of similarities with Ruby On Rails; both are high-level, readable, fun programming languages. As a senior developer from Pinterest once said of his decision to transition to Elixir: “&#34;I thought, ‘Wow, it’s as fun as Ruby, but it has some chops — it actually performs really well.’” Personally, I love the ability to write less code. It is a language that is expressive enough to be understandable and fast to read. For example, using the Tesla library, I could implement integration with a provider like Paypal in 20 lines of code. I will be happy to schedule a hands-on workshop or a 1-on-1 call if there is a need for dive into this library.\n  We all heard of the digital transformation, right? As populations grow, and more services move online there is increased pressure on systems to be able to handle huge spikes with billions of concurrent users. Elixir runs on the BEAM VM. A system built for concurrency. As a result, it can handle these user spikes with ease. For those interested in what concurrency is, and how it works, we have a blog comparing the JVM and BEAM VM, which explains it well. Pinterest and Bleacher Report are just two of widely popular and big companies who moved to Elixir in order to help solve issues of scalability. In the case of Bleacher Report, one of our clients, they were able to move from 150 servers, down to 5 servers. Not only did they reduce there physical infrastructure requirements, they were also able to handle more traffic with faster times. A language that can be relied upon for scalable, fault-tolerant will always be sought out by high profile companies.\n  Elixir is a growing language which is being adopted at a significant rate. As a result, Elixir developers have the opportunity to work for wide spectrum of companies such as PepsiCo, Pinterest, Lonely Planet or MBTA. And the list is continuing to grow. Check out this list for companies added in the last 12 months alone.\n  As you might expect with any new technology or programming language, the Elixir community started out small. Nowadays Elixir has a thriving community that continues to grow, with fantastic events such as ElixirConf in Europe and in the US, EMPEX, Code Elixir LDN and Gig City Elixir, as well as Meetups all around the world. This community means the language is continuing to grow and evolve with new tooling, and that there is always someone to provide inspiration or help find solutions to a problem.\n  Tooling makes languages more versatile and tasks easier. They mean that you don’t have to reinvent the wheel with every new use case. Elixir already has a number of powerful tools, including Phoenix LiveView which enables developers to build real-time, front-end web applications without writing a line of JavaScript or Crawly which makes web crawling and Data Scraping in Elixir easy. Not only does Elixir have a wide-variety of tooling available, but as we mentioned earlier, there is also a passionate community of people continually creating new tools and improving the ones available.\n  Given its scalability performance and its origins in Erlang, it is no surprise that Elixir is a popular backend choice. As mentioned above, Phoenix LiveView has provided an easy, time-efficient and elegant way for Elixir developers to produce front-end applications. Finally, the Nerves framework allows for embedded software development on the hardware end. As a result, Elixir is a language that can be adopted right throughout the tech stack. This doesn’t just make it an attractive choice for businesses; it also opens up the door for where the language can take you as a developer.\n  A language and community where documentation is valued is one that makes knowledge sharing easy. The high standard of documentation in the Elixir community makes it easier for you to learn the language, but also, make it easier for anyone to contribute to its improvement and growth.\n  There are a number of  stories, from  people who come from object-oriented languages, who found that the process of learning Elixir made them a  better programmer in their language of choice. Learning a new purely functional programming paradigm forces you to examine the way you approach programming. In doing so, it can help you identify habits that can be improved and introduce you to new ways of thinking about problems. This fresh perspective is invaluable for all future development you do, regardless of what language you are working with. For our friends using Ruby On Rails, this is particularly true, as the Elixir syntax will be familiar to you, allowing you an easy transition into functional, concurrent programming.\n Everyone will have different motivation and considerations for what programming language to choose. But these are the reasons I would recommend you learn Elixir in 2020, for the years ahead.\n  There are many ways to start. First, you should head to the  getting started page of the official Elixir website. We also offer a number of  free downloadable packages for Elixir. Secondly, we offer a variety of Elixir training, including our  Elixir Programming Training For Beginners. To get started in the community  ElixirForum is a great place to start, as well as searching the #Elixirlang and #MyElixirStatus hashtags on Twitter.\n       Go back to the blog", "posttime": "2020-06-04 06:21:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,编程,programming,学习,elixir", "title": "为什么Elixir是您在2020年应该学习的编程语言", "title_en": "Why Elixir Is the Programming Language You Should Learn in 2020", "transed": 1, "url": "https://www.erlang-solutions.com/blog/why-elixir-is-the-programming-language-you-should-learn-in-2020.html", "via": "", "real_tags": ["2020", "编程", "学习", "elixir"]}, {"category": "", "categoryclass": "", "imagename": "1f1c5434c03ebe578895346cad065c5a.jpg", "infoid": 1005058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本世纪头十年，如果你想在笔记本电脑上安装Linux，毫无疑问，你的最佳选择是IBM。后来，又推出了联想ThinkPad。然后，在2008年，联想决定不再正式支持台式机上的Linux。此后发生了许多技术变革，其中包括联想重新全面支持Linux台式机之后的变化。也有一些故障。联想在2016年的Signature Edition个人电脑上推出了Linux操作系统，这让它一败涂地。但现在联想希望再次成为桌面Linux最好的朋友。\n联想正在采取行动，为Ubuntu和Red Hat的顶级Linux发行版认证完整的工作站产品组合--每种型号、每种配置。虽然这并不是每台联想PC--Ideapad系列都不包括--但这仍然是一个令人印象深刻的举措。\n联想不只是认证其高端笔记本电脑和台式机支持Linux；该公司还将预装其整个ThinkStation和ThinkPad P系列工作站产品组合，同时预装Red Hat Enterprise Linux(RHEL)和Ubuntu Long Term Support(LTS)。\n每年售出的电脑超过2.5亿台，据NetMarketShare报道，2.87%的用户(约720万用户)正在使用这些电脑来运行Linux。数据科学家、开发人员、应用工程师、科学家等用户群曾经被认为是一个利基IT人群，但现在他们的用户群正在增长--他们进入了多个行业的热门职位，并成为公司内不可或缺的一员。\n我认为NetMarketShare的Linux数量比应有的要高，但赫尔曼在一件事上肯定是对的：Linux已经成为高级开发人员的桌面操作系统之选。\n正如Ubuntu母公司Canonical的创始人马克·沙特尔沃思(Mark Shuttleworth)所说：我们看到一些公司签署了Linux桌面支持协议，因为他们希望为自己的人工智能工程师提供Ubuntu桌面服务。\n甚至带有Windows子系统到Linux(WSL)2的微软也在为软件工程师和系统管理员支持Linux桌面。简而言之，面向专业开发人员、工程师和系统管理员的Linux正在增长。\n为了确保轻松的Linux体验，联想工作站将.。提供全面的端到端支持-从安全补丁和更新到更好地保护和验证硬件驱动程序、固件和BIOS优化。更重要的是，联想还将直接将设备驱动程序上游到Linux内核，以帮助在工作站的整个生命周期中保持稳定性和兼容性。\n除了RHEL和Ubuntu，联想还与Fedora合作，在其ThinkPad p53和P1 Gen 2系统上提供预加载Fedora映像的试点计划。\n但是，如果您的IT员工没有能力处理Linux桌面，该怎么办呢？没问题，赫尔曼回答说：\n联想的Linux预加载降低了最终用户的复杂性，除了来自联想、红帽和Ubuntu的集成支持外，IT经理还可以更清楚地了解和自主管理其网络中的设备。这一有限的基础为IT部门提供了一条更轻松的部署路线，让他们能够更深入地了解员工正在使用的版本以及如何最好地支持他们的设备，从而帮助简化整个组织的管理。\n联想认证的工作站产品组合将从6月份开始提供完全可定制和按订单配置的产品组合。它们将在夏季推出，首先是ThinkPad P系列移动工作站。除了开箱即用，联想还将提供全面的网络支持、专门的Linux论坛和配置指导。\n注册后，即表示您同意使用条款并承认隐私政策中概述的数据做法。\n您还可以免费订阅ZDNet的今日技术更新和ZDNet公告时事通讯。您可以随时取消订阅这些时事通讯。\n您同意接收来自CBS系列公司的更新、提醒和促销信息，包括ZDNet的今日技术更新和ZDNet公告时事通讯。你可以随时退订。\n通过注册，您同意接收您可以随时取消订阅的选定时事通讯。您也同意使用条款，并承认我们的隐私政策中概述的数据收集和使用做法。\n你&#39；I‘我刚刚升级到最新版本的Windows 10.在您之前回去工作吧，使用此核对表可以确保您的隐私并且安全设置为正确无误，就是这样..。\nEliteOne 800一体机G6PC提供更高的功率而不是典型的一体机使用可选的GeForce腾讯通2070个显卡，而协作一体机具有内置缩放功能的G6房间..。\n这些笔记本电脑是惠普推出的更大规模新硬件的一部分，惠普希望利用目前在家工作的条件。\n惠普表示，个人系统净营收较上年同期下降7%，至83亿美元。\nWindows 10 2004，2020年5月的专题报道更新，开始滚动了面向主流用户，", "note_en": "In the 2000s, if you wanted Linux on a laptop, your best choice without a doubt was an IBM. Later,  Lenovo ThinkPad. Then, in 2008,  Lenovo decided to no longer officially support Linux on the desktop. There&#39;s been a lot of technological changes since, including that  Lenovo went back to fully supporting the Linux desktop. There were some hitches, too.  Lenovo blew it with Linux on its 2016 Signature Edition PCs. But now Lenovo wants to be desktop Linux&#39;s best friend again.\n Lenovo is moving to certify the full workstation portfolio for top Linux distributions from  Ubuntu and  Red Hat -- &#34;every model, every configuration.&#34; While that&#39;s not every Lenovo PC -- the  Ideapad family isn&#39;t included -- that&#39;s still an impressive move.\n Lenovo isn&#39;t just certifying its high-end laptops and desktops for Linux; the company will also preload its entire portfolio of ThinkStation and ThinkPad P Series workstations with both  Red Hat Enterprise Linux (RHEL) and  Ubuntu Long Term Support (LTS).\n  &#34;More than 250 million computers are sold each year and NetMarketShare  reports that 2.87% -- roughly 7.2 million users -- are using those computers to run Linux. Once thought of as a niche IT crowd, this user base of data scientists, developers, application engineers, scientists, and more is growing -- stepping into sought-after roles across multiple industries and becoming essential within their companies.&#34;\n I think  NetMarketShare&#39;s Linux numbers are higher than they should be, but Herman is certainly right about one thing: Linux has become the desktop operating system of choice for advanced developers.\n   As Mark Shuttleworth, founder of Ubuntu&#39;s parent company  Canonical, said: &#34;We have seen  companies signing up for Linux desktop support because they want to have fleets of Ubuntu desktop for their artificial intelligence engineers.&#34;\n Even Microsoft with  Windows SubSystem to Linux (WSL) 2 is supporting the Linux desktop for software engineers and system administrators. In short, Linux for professional developers, engineers, and sysadmins is growing.\n    &#34;To ensure an effortless Linux experience, Lenovo workstations will ... offer full end-to-end support -- from security patches and updates to better secure and verify hardware drivers, firmware and bios optimizations. What&#39;s more, Lenovo will also upstream device drivers directly to the Linux kernel, to help maintain stability and compatibility throughout the life of the workstation.&#34;\n Besides RHEL and Ubuntu,  Lenovo has also partnered with Fedora to offer a pilot program with a  preloaded Fedora image on its ThinkPad P53 and P1 Gen 2 systems.\n But what if your IT staff isn&#39;t up to dealing with Linux desktops? No problem, replied Herman:\n Lenovo&#39;s Linux preloads reduce end-user complexity, giving IT managers more visibility and autonomy over devices in their network, in addition to integrated support from Lenovo, Red Hat, and Ubuntu. This finite foundation gives IT departments an easier route of deployment and insights about which version their employees are using and how to best support their devices, helping to simplify management across the organization.\n Lenovo&#39;s certified portfolio of workstations will be available fully customizable and configured-to-order starting in June. They will be rolled out over the summer starting with the ThinkPad P Series mobile workstations. Going beyond the box, Lenovo will also offer full  web support, dedicated  Linux forums, and configuration guidance.\n  By registering, you agree to the  Terms of Use and acknowledge the data practices outlined in the  Privacy Policy.\n  You will also receive a complimentary subscription to the ZDNet&#39;s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe from these newsletters at any time.\n         You agree to receive updates, alerts, and promotions from the CBS family of companies - including ZDNet’s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe at any time.\n      By signing up, you agree to receive the selected newsletter(s) which you may unsubscribe from at any time. You also agree to the  Terms of Use and acknowledge the data collection and usage practices outlined in our  Privacy Policy.\n       You&#39;ve\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tjust\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupgraded\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmost\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trecent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tversion\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t10.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBefore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tget\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tback\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twork,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tuse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchecklist\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tensure\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprivacy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsettings\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcorrect\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEliteOne\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t800\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAll-in-One\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tG6\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPC\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toffers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpower\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttypical\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tall-in-one\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toptional\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeForce\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRTX\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t2070\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgraphics,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhile\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCollaboration\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAll-in-One\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tG6\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbuilt-in\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tZoom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRoom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The notebooks are part of a larger roll-out of new hardware from HP that looks to capitalize on the current work-from-home conditions.\n  HP said personal systems net revenue was down 7% from a year ago to $8.3 billion.\n  Windows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t10\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t2004,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMay\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t2020\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfeature\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupdate,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstarting\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\troll\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tout\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmainstream\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tusers,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbeginning\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&#39;seekers&#39;\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvia\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcertain\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbusiness\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchannels,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbeginning\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMay\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t27.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLinux\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcreator\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trecently\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tannounced\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\the&#39;d\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tupgraded\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\this\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmain\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPC\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tspeedy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAMD\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThreadripper\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t3970x-based\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprocessor.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcomputer\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCPU.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIn\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texclusive\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tconversation,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcontinuing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tquest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttry\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tget\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWin32\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdevelopers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tadopt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmore\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&#39;modern&#39;\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t10\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplatform\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\telements.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teffort\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tname,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProject\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tReunion,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfirst\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttwo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  If\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou&#39;ve\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgone\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tshopping\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tportable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPC\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlately,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tknow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsheer\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnumber\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchoices\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toverwhelming.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnarrow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toptions?\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchecklist\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tassemble\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tspecs\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2020-06-04 06:20:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,相信,believes", "title": "联想相信Linux桌面", "title_en": "Lenovo Believes in the Linux Desktop", "transed": 1, "url": "https://www.zdnet.com/article/lenovo-believes-in-the-linux-desktop/", "via": "", "real_tags": ["linux", "相信", "believes"]}, {"category": "", "categoryclass": "", "imagename": "0dc82d259f92ac07202a24fd0e7ce5d0.jpg", "infoid": 1005057, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据Business Insider报道，在意识到冠状病毒大流行导致其算法不可靠后，Coatue的3.5亿美元数据驱动型“定量基金”于4月初迅速退出市场。\n这只专注于科技的基金由亿万富翁菲利普·拉丰(Philippe Laffont)在一年多前推出，加入了越来越多由于2020年不可预测的性质而未能盈利的“量化基金”之列。\n量化基金使用复杂的算法在超级连接的数据网络中寻找隐藏的交易信号。尽管科图的量化基金将老式的选股与量化分析(一种被称为“量化”的方法)结合在一起，但据报道，高管们担心，新冠肺炎过程中收集的数据会让其内部交易程序感到困惑。\nBusiness Insider的消息来源引用了一个例子，强调了Coatue的程序解释电子商务数据的方式。据报道，随着新冠肺炎的停工在世界各地蔓延，某些零售商的网站流量激增-这对股市来说通常是一个积极的迹象-但没有考虑到他们收入的下降和实体店的关闭。\n但早在新冠肺炎出手之前，科图的量化基金就表现不佳了。今年2月，有报道显示，自2019年5月推出以来，它只公布了2%的回报率，而且在去年第四季度实际上出现了亏损(1.2%)。\n另一方面，拉丰旗下的人主导基金去年实现了10%的利润回报，超过行业平均水平。自那以后，彭博社(Bloomberg)指出，这些利润受到了打击，使其今年的亏损约为6%。\n总的来说，量化基金经历了非常艰难的一年。3月份，行业数据显示，它们的平均跌幅为1.5%，今年迄今累计亏损3.2%。\n就连神秘的文艺复兴科技公司也无法预测股市会对新冠肺炎作何反应。文艺复兴科技公司管理着一只由冷战时期著名的密码破译员吉姆·西蒙斯创立的750亿美元的秘密私募基金。\n许多人认为文艺复兴的Medallion基金是历史上最赚钱的量化基金，在1988年至2018年期间，扣除费用后的年化回报率高达39%。\n尽管如此，对于文艺复兴的股票投资组合来说，2月份仍然是十多年来表现最差的月份之一，当月下跌了7%。据英国“金融时报”报道，截至今年3月，其机构股票基金今年迄今下跌了12%。\n事实证明，至少有两只量化基金表现不错，而且它们都严重依赖人工智能。\n多伦多城堡岭资产管理公司(Castle Ridge Asset Management)的资产交易额约为1亿美元，该公司3月份凭借其与大盘股协同工作的“自我进化”人工智能系统获利2.6%。\n在瑞典，掌管着约3,000万美元资产的Volt Capital Management AB今年向投资者回报了令人发痒的24%。据报道，Volt的基金也为那些油价暴跌的人做好了准备。\n根据该公司首席策略师帕特里克·萨文布拉德(Patrik Safvenblad)的说法，Volt的成功取决于一种信念，即市场总是正确的。\n“我们认为我们并不比市场了解得更清楚。因此，当情况对我们不利时，我们就会减少对这些头寸、模型和行业的敞口。“Safvenblad告诉记者。“我们干脆结清不起作用的仓位。通过这种方式，我们可以增加到确实有效的职位。“。\n阅读我们关于科技行业如何应对冠状病毒的每日报道，并订阅我们的每周时事通讯“冠状病毒”(CoronaVirus)。\n有关远程工作的提示和诀窍，请在此处查看我们的增长季度文章或在Twitter上关注我们。", "note_en": "Coatue’s $350 million data-driven ‘quant fund’ made a swift exit from the market in early April  — having realised the coronavirus pandemic had rendered its algorithm unreliable,  Business Insider reports.\n The tech-focused fund, launched by billionaire Philippe Laffont just over one year ago, joins a growing list of “quant funds” to have failed to turn a profit due to 2020’s unpredictable nature.\n      Quant funds use complex algorithms to find hidden trade signals in a hyperconnected web of data. While Coatue’s quant fund mixes old-school stock picking with quantitative analysis (a  method dubbed “quantamental”), execs were reportedly concerned that data farmed in the midst of COVID-19 would confuse its in-house trading program.\n  One example cited by Business Insider’s sources highlighted the way Coatue’s program interpreted ecommerce data. It reportedly showed surges in website traffic for certain retailers as COVID-19 lockdowns spread across the world — usually a positive sign for stock — but failed to consider their dwindling revenues and closed physical stores.\n But Coatue’s quant fund had underperformed long before COVID-19 hit. In February,  reports surfaced showing it had posted only 2% returns since its launch in May 2019, and had actually lost money (1.2%) in last year’s fourth quarter.\n On the other hand, Laffont’s human-led fund bested the industry average to return 10% profit last year. Bloomberg has since noted that those profits  have taken a hit, bringing its losses the year to roughly 6%.\n  Quant funds, in general, have had a really tough year. In March, industry figures  indicated they were down 1.5% on average, amounting to a 3.2% loss over the year to date.\n Even the mythic Renaissance Technologies, which manages a secretive $75 billion private fund founded by famed Cold War-era codebreaker Jim Simmons, couldn’t predict how stock markets would react to COVID-19.\n Many consider Renaissance’s Medallion fund the most profitable quant fund in history, having boasted annualized post-fee returns of 39% between 1988 to 2018.\n Still, February resulted in one of its worst months in more than a decade for Renaissance’s stock portfolio, having lost 7% over the month. By March, its Institutional Equities fund  was down 12% year-to-date, according to the Financial Times.\n  Turns out there’s at least two quant funds doing just fine, and they both rely heavily on artificial intelligence.\n Toronto’s Castle Ridge Asset Management, which  trades some $100 million in assets, made 2.6% in March with its “self-evolving” AI system that works with large-cap stocks.\n Over in Sweden, Volt Capital Management AB (in charge of roughly $30 million in assets) has returned a loin-tickling 24% to investors this year. Volt’s fund was also reportedly prepared for those plunging oil prices.\n According to the firm’s chief strategist Patrik Safvenblad, Volt’s success rests on a belief that the market is always right.\n “We don’t think we know better than the market. So when something goes against us, we decrease exposure to those positions, models and sectors,” Safvenblad told reporters. “We simply close positions that don’t work. This way we can increase to positions that do work.”\n      Read our  daily coverage on how the tech industry is responding to the coronavirus and subscribe to our weekly newsletter  Coronavirus in Context.\n  For tips and tricks on working remotely, check out our Growth Quarters articles  here or follow us on  Twitter.", "posttime": "2020-06-04 06:04:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,股市,app,基金,fund", "title": "3.5亿美元的“量化基金”利用实时数据炒作股市--然后2020年就发生了", "title_en": "$350M 'Quant Fund' Played the Stock Market Using Real-Time Data -- Then 2020 Happened", "transed": 1, "url": "https://thenextweb.com/hardfork/2020/06/03/coatue-quant-fund-played-the-stock-market-using-real-time-data-then-2020-happened/", "via": "", "real_tags": ["2020", "股市", "app", "基金", "fund"]}, {"category": "", "categoryclass": "", "imagename": "b0c94e494f8d157446940b576cf73020.jpg", "infoid": 1005056, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Mozilla刚刚发布了Firefox 77.0.1，以防止DDoSing通过HTTPS(DoH)自动选择最新的DNS Over HTTPS(DoH)提供商，作为更广泛的部署和测试运行的一部分。\nFirefox 77.0.1发行说明解释说，为了以更可控的方式实现更广泛的部署，在测试期间禁用了自动选择DNS而不是HTTPS提供商。\n高级软件工程师尼汉斯·苏布拉曼亚(Nihanth Subramanya)在Mozilla的错误跟踪器上表示：我们需要能够逐步推出这项服务，这样我们就不会让任何供应商负担过重。\n即使是演练也会涉及每个客户端最多10个请求，这在整个版本群更新时可能非常重要。&#34；\n根据Beta/Release升级批准请求中包含的用户影响详细信息，默认情况下，Pref-Off自动TRR-Selection功能似乎是DDoS&39；NextDNS的首选功能，NextDNS是我们的DNS over https提供商之一。&#34；\nHTTPS上的DNS是一项新标准，它使Web浏览器能够通过加密的HTTPS连接执行DNS解析，而不是使用普通的纯文本DNS查找。\nMozilla在2019年9月宣布，他们将在Firefox浏览器中默认启用DoH，使用Cloudflare的DNS提供商作为默认DoH提供商，这导致了人们对Firefox用户数据由一家公司控制的担忧。\nNextDNS是Mozilla在2月11日火狐73.0发布时作为替代DoH提供商添加的，目的是让用户有更多选择，Mozilla于2020年2月25日宣布向所有美国Firefox用户全面推出默认的DNS-over-HTTPS服务。\n火狐77昨天发布，在更多的Windows10笔记本电脑上增加了WebRender功能，并更新了关于：证书页面。\n如果以上链接尚未更新为Firefox 77.0.1，您可以从Mozilla的FTP版本目录手动下载。", "note_en": "Mozilla just released Firefox 77.0.1 to prevent DDoSing the DNS over HTTPS (DoH) providers selected automatically as part of a wider deployment test run of the standard.\n &#34;Disabled automatic selection of DNS over HTTPS providers during a test to enable wider deployment in a more controlled way,&#34; the Firefox 77.0.1 release notes  explain.\n &#34;We need to be able to roll this out gradually so that we don&#39;t overload any providers,&#34; Senior Software Engineer Nihanth Subramanya  said on Mozilla&#39;s bug tracker.\n &#34;Even the dry-run involves up to 10 requests per client which can be very significant when the entire release population updates.&#34;\n  According to the user impact details included with the Beta/Release Uplift Approval Request for the &#39;Pref-off automatic TRR-selection by default&#39; feature, &#34;[t]his prefs-off a feature that seems to be effectively DDoS&#39;ing NextDNS, one of our DNS over HTTPs providers.&#34;\n  DNS over HTTPS is a new standard that enables web browsers to perform  DNS resolution over encrypted HTTPS connections instead of using normal plain text DNS lookups.\n Mozilla  announced in September 2019 that they would be enabling DoH by default in the Firefox browser, using Cloudflare&#39;s DNS provider as the default DoH provider which led to  concerns regarding the Firefox users&#39; data being controlled by a single company.\n NextDNS was added by Mozilla as an alternate DoH provider with the release of Firefox 73.0 on February 11 to give users more choice, and Mozilla announced the  rollout of DNS-over-HTTPS by default to all US Firefox users on February 25, 2020.\n  Firefox 77 was  released yesterday with an increased rollout of the WebRender feature to more Windows 10 laptops and an updated about:certificate page.\n   If the above links haven&#39;t yet been updated for Firefox 77.0.1, you can manually download it from Mozilla&#39;s  FTP release directory.", "posttime": "2020-06-04 05:50:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,发布,阻止,prevent,dns", "title": "Firefox 77.0.1发布以阻止DDoSing DoH DNS提供商", "title_en": "Firefox 77.0.1 released to prevent DDoSing DoH DNS providers", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/firefox-7701-released-to-prevent-ddosing-doh-dns-providers/", "via": "", "real_tags": ["firefox", "发布", "阻止", "prevent", "dns"]}, {"category": "", "categoryclass": "", "imagename": "1c0a1311f57c1a6df9aebbf324873464.jpg", "infoid": 1005054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由ITMO大学的研究人员领导的一个国际研究小组宣布，开发出了世界上最紧凑的半导体激光器，它可以在室温下工作在可见光范围内。根据研究作者的说法，这种激光器是一种只有310纳米大小的纳米粒子(小于1毫米的3000倍)，可以在室温下产生绿色相干光。\n今年，国际光学物理学家群体庆祝一个里程碑式事件的周年纪念日：60年前的5月中旬，美国物理学家西奥多·迈曼演示了第一台光学量子发生器--激光器的工作原理。60年后的今天，一个国际科学家团队发表了一项工作，他们在实验中展示了世界上最紧凑的半导体激光器，它在室温下工作在可见光范围内。这意味着它产生的相干绿光可以很容易地记录下来，甚至可以用标准光学显微镜用肉眼看到。\n值得一提的是，科学家们成功地攻克了可见光波段的绿色部分，这被认为是纳米激光器的问题。“在现代发光半导体领域，存在着绿隙”问题，“这篇文章的首席研究员、ITMO大学物理与工程学院教授谢尔盖·马卡洛夫(Sergey Makarov)说。绿隙意味着用于发光二极管的传统半导体材料的量子效率在光谱的绿色部分急剧下降。这个问题使常规半导体材料制成的室温纳米激光器的发展变得复杂起来。“。\n来自圣彼得堡的一个跨学科研究小组已经选择卤化物钙钛矿作为他们的纳米激光器的材料。传统的激光器由两个关键元件组成-一个允许产生相干受激发射的有源介质和一个有助于将电磁能量长期限制在内部的光学谐振器。钙钛矿可以提供这两种性质：特定形状的纳米颗粒既可以作为有源介质，也可以作为有效的谐振器。\n因此，科学家们成功地制造出了一种尺寸为310纳米的立方形粒子，当受到飞秒激光脉冲的光激励时，它可以在室温下产生激光辐射。\n“我们使用飞秒激光脉冲泵浦纳米激光器，”这篇文章的合著者之一、ITMO大学的初级研究员Ekaterina Tiguntseva说。“我们照射孤立的纳米粒子，直到我们达到特定泵浦强度下的激光产生阈值。在那之后，纳米粒子开始像典型的激光器一样工作。我们证明了这样的纳米激光器可以在至少一百万次激发周期内工作。“。\n所研制的纳米激光器的独特性并不局限于它的小尺寸。这种新颖的纳米颗粒设计允许有效地限制受激发射能量，以提供足够高的电磁场放大来产生激光。\n这篇文章的合著者之一、ITMO大学的初级研究员Kirill Koshelev解释说：“我们的想法是，激光的产生是一个门槛过程。”也就是说，你用激光脉冲激发纳米粒子，当外部光源的强度达到特定阈值时，粒子就开始产生激光发射。如果你不能很好地把光限制在里面，就不会有激光发射。在之前用其他材料和系统进行的实验中，但是类似的想法表明，你可以使用四阶或五阶的Mie共振，这意味着在激光产生的频率下，材料内部的波长与谐振器体积匹配四到五倍的共振。我们已经证明我们的粒子支持三阶Mie共振，这是以前从未做过的。换言之，在谐振器尺寸等于材料内部三个波长的光的条件下，我们可以产生相干受激发射。“\n另一件重要的事情是，纳米粒子不需要施加外部压力或非常低的温度就可以作为激光器工作。研究中描述的所有效果都是在正常的大气压和室温下产生的。这使得这项技术对专注于创造光学芯片、传感器和其他利用光传输和处理信息的设备(包括用于光学计算机的芯片)的专家具有吸引力。\n工作在可见光范围内的激光器的好处是，在所有其他属性相同的情况下，它们比具有相同属性的红外源和红外源要小。问题是，小型激光器的体积一般与发射波长成立方关系，由于绿光的波长比红外光的波长小三倍，所以绿光激光器的小型化极限要大得多。这对于生产用于未来光学计算机系统的超小型部件是必不可少的。", "note_en": "An international team of researchers led by researchers from ITMO University announced the development of the world’s most compact semiconductor laser that works in the visible range at room temperature. According to the authors of the research, the laser is a nanoparticle of only 310 nanometers in size (which is 3,000 times less than a millimeter) that can produce green coherent light at room temperature.\n  This year, the international community of optical physicists celebrates the anniversary of a milestone event: 60 years ago, in the middle of May, American physicist Theodor Maiman demonstrated the operation of the first optical quantum generator - a laser. Now, Sixty years later, an international team of scientists published a work where they demonstrated experimentally the world’s most compact semiconductor laser that operates in the visible range at room temperature. This means that the coherent green light that it produces can be easily registered and even seen by a naked eye using a standard optical microscope.\n It’s worth mentioning that the scientists succeeded in conquering the green part of the visible band which was considered problematic for nanolasers. “In the modern field of light-emitting semiconductors, there is the &#34;green gap” problem,“ says Sergey Makarov, principal investigator of the article and Professor at the Faculty of Physics and Engineering of ITMO University. &#34;The green gap means that the quantum efficiency of conventional semiconductor materials used for light-emitting diodes falls dramatically in the green part of the spectrum. This problem complicates the development of room temperature nanolasers made of conventional semiconductor materials.”\n An interdisciplinary team of researchers from St. Petersburg has chosen halide perovskite as the material for their nanolasers. A traditional laser consists of two key elements - an active medium that allows for generation of coherent stimulated emission and an optical resonator that helps to confine electromagnetic energy inside for a long time. The perovskite can provide both of these properties: a nanoparticle of a certain shape can act as both the active medium and the efficient resonator.\n As a result, the scientists succeeded in fabricating a cubic-shaped particle of 310 nanometers in size, which can generate laser radiation at room temperature when photoexcited by a femtosecond laser pulse.\n “We used femtosecond laser pulses to pump the nanolasers,” says Ekaterina Tiguntseva, a junior research fellow at ITMO University and one of the article’s co-authors. “We irradiated isolated nanoparticles until we reached the threshold of laser generation at a specific pump intensity. After that, the nanoparticle starts working as a typical laser. We demonstrated that such a nanolaser can operate during at least a million cycles of excitation.”\n The uniqueness of the developed nanolaser is not limited to its small size. The novel design of nanoparticles allows for efficient confinement of the stimulated emission energy to provide a high enough amplification of electromagnetic fields for laser generation.\n “The idea is that laser generation is a threshold process,” explains Kirill Koshelev, a junior research fellow at ITMO University and one of the article’s co-authors. “i.e. you excite the nanoparticle with a laser pulse, and at a specific &#34;threshold” intensity of the external source, the particle starts to generate laser emission. If you are unable to confine the light inside well enough, there will be no laser emission. In the previous experiments with other materials and systems, but similar ideas, it was shown that you can use Mie resonances of the fourth order or fifth order, meaning resonances where the wavelength of light inside the material fits the resonator volume four or five times times at the frequency of laser generation. We’ve shown that our particle supports a Mie resonance of the third order, which has never been done before. In other words, we can produce a coherent stimulated emission at the conditions when the resonator size is equal to three wavelengths of light inside the material.“\n Another important thing is that there is no need to apply external pressure or very low temperature for the nanoparticle to work as a laser. All the effects described in the research were produced at a regular atmospheric pressure and room temperature. This makes the technology attractive for specialists who focus on the creation of optical chips, sensors and other devices that use light to transfer and process information, including chips for optical computers.\n The benefit of lasers that work in the visible range is that with all other properties being equal, they are smaller than red and infrared sources with the same properties. Thing is, the volume of the small lasers generally has a cubic dependence on the emission’s wavelength, and as the wavelength of green light is three times less than that of infrared light, the limit of miniaturization is a lot greater for green lasers. This is essential for the production of ultracompact components for future optical computer systems.", "posttime": "2020-06-04 05:49:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,conceive,激光器", "title": "研究人员构思出最小的半导体激光器", "title_en": "Researchers conceive smallest semiconductor laser", "transed": 1, "url": "https://nuadox.com/post/619930090543955968/smallest-semiconductor-laser", "via": "", "real_tags": ["人员", "conceive", "激光器"]}, {"category": "", "categoryclass": "", "imagename": "540c739a172456f981680fbbd3d926ef.jpeg", "infoid": 1005052, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名。\n永久链接", "note_en": "GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up\n                Permalink", "posttime": "2020-06-04 05:19:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "shodan,审查", "title": "Shodan Dojo-通过卡塔斯学习Shodan", "title_en": "Shodan Dojo – Learning Shodan through katas", "transed": 1, "url": "https://github.com/ninoseki/shodan-dojo", "via": "", "real_tags": ["shodan", "审查"]}, {"category": "", "categoryclass": "", "imagename": "d3e38c2ac11685b7c1a8112b3d521025.jpg", "infoid": 1005051, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "令各地的BSD粉丝感到惊讶和惊愕的是，FreeNAS供应商iXsystems正在Debian Linux之上构建其核心产品TrueNAS的新版本。\n本周TrueNAS的规模声明建立在该公司3月份的声明之上，该公司宣布其商业项目TrueNAS和社区项目FreeNAS将合并为一个共同的基础。实际上，iXsystems的所有NAS项目都将是向前发展的TrueNAS变体，免费使用的版本是TrueNAS Core，基于Debian的新项目成为TrueNAS规模，商业项目保持简单的TrueNAS。\n该公司对新项目的总体目标仍然含糊其辞，主要线索是规模被用作首字母缩写。iXsystems负责项目管理和业务发展的高级副总裁摩根·利特尔伍德(Morgan Littlewood)在今天的一封电子邮件中进一步阐述了这一点：\n横向扩展：不言而喻…更高的容量和带宽。有效地提供横向扩展ZFS功能。融合：计算和存储集成..。IT是高效的开源超聚合基础架构，具有仅限计算和仅限存储的主动-主动选项：所有好的群集都不应停机Linux容器：支持本机Linux应用程序.通过Docker和Kubernetes Easy：与标准TrueNAS一样，希望简化部署和管理。\n与其他TrueNAS版本相比：TrueNAS核心：单节点，支持SAS扩展。使用插件易于部署和操作。低成本的单节点存储(通常为&lt；1 PB)TrueNAS Enterprise：双节点、共享存储，最高可扩展至10+PB。最低成本高达10PB的高可用性存储。TrueNAS规模：具有聚合功能的多节点横向扩展存储(Linux Containers和KVM VM)。成本最低的群集横向扩展存储&gt；100pb。\n所有版本都可以通过TrueCommand进行管理。同一家公司可以使用所有版本。企业和规模将拥有我们的铜牌/银牌/金牌支持选项。\n因为我们在每个版本上都使用ZFS，所以这些版本之间将会有数据移动性。所有版本都可以在我们的标准平台上运行。\n我们已经期待着新的统一TrueNAS Core即将发布；我们已经测试了工程日报，并相信我们已经看到TrueNAS和FreeNAS之间的代码库统一，这将带来更好的质量保证和对用户界面细节的关注。\n声明的TrueNAS规模的企业目标非常有趣--但我们也相信，许多社区用户可能会被基于Linux而不是BSD的ZFS的简单、有吸引力的Web界面的想法所吸引。\n感兴趣的管理员和开发人员可以仔细阅读TrueNAS Scale项目的存储库，该项目是在Debian 11上开放开发的。它包括Python的Gluster(分布式文件系统，可以使用ZFS作为后备存储)绑定，以及其他诱人的线索。", "note_en": "To the surprise—and likely consternation—of BSD fans everywhere, FreeNAS vendor iXsystems is building a new version of its core product,  TrueNAS, on top of Debian Linux.\n This week&#39;s TrueNAS Scale  announcement builds on the company&#39;s March  announcement that its commercial project TrueNAS and its community project FreeNAS would be merging into a common base. Effectively,  all the NAS projects from iXsystems will be TrueNAS variants moving forward, with the free-to-use version being TrueNAS Core, the new Debian-based project becoming TrueNAS Scale, and the commercial project remaining simply TrueNAS.\n The company is still being coy about the overall goals of the new project, with the major clue being that &#34;SCALE&#34; is used as an acronym. Morgan Littlewood, iXsystems&#39; senior vice president of project management and business development, expanded on this to Ars a little further in an email exchange today:\n Scale-out : Self explanatory...higher capacity and bandwidths. Effectively providing a scale-out ZFS capability. Converged: Compute and Storage integrated.. it&#39;s effectively Open Source Hyperconverged infrastructure with compute-only and storage-only options Active-Active: All good clusters should have no downtime  Linux Container: Support for native Linux apps...via Docker and Kubernetes  Easy: Like standard TrueNAS, want to simplify deployment and management\n Compared with other TrueNAS editions: TrueNAS CORE: Single node with SAS expansion. Simple to deploy and operate with plugins. Low cost single node storage (typically &lt; 1 PB) TrueNAS Enterprise: Dual node, shared storage, Scale-up to 10+PB. Lowest cost HA storage up to 10PB. TrueNAS SCALE: Multi-node scale-out storage with convergence (Linux containers and KVM VMs). Lowest cost clustered-scale-out storage &gt;100PB.\n All editions can be managed via  TrueCommand. The same company can use all editions. Enterprise and SCALE will have our Bronze/Silver/Gold support options.\n Because we use ZFS on each, there will be data mobility between these editions. All editions can run on our standard platforms.\n We&#39;re already looking forward to the new unified TrueNAS Core approaching release status; we&#39;ve tested engineering dailies and believe that we&#39;re already seeing the codebase unification between TrueNAS and what was FreeNAS resulting in better QA and attention to detail on the user interface.\n The stated enterprise goals for TrueNAS Scale are very interesting—but we also believe many community users may be enticed by the idea of a simple, attractive Web interface to ZFS atop a Linux base rather than BSD.\n Interested admins and developers can peruse the  repositories for the TrueNAS Scale project, which is being developed openly atop Debian 11. It includes  Gluster (distributed filesystem, which can use ZFS as backing storage) bindings for Python, among other tantalizing clues.", "posttime": "2020-06-04 05:18:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,isn,truenas", "title": "TrueNAS没有放弃BSD，但它正在采用Linux", "title_en": "TrueNAS isn’t abandoning BSD–but it is adopting Linux", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/truenas-isnt-abandoning-bsd-but-it-is-adopting-linux/", "via": "", "real_tags": ["linux", "isn", "truenas"]}, {"category": "", "categoryclass": "", "imagename": "b8734be33e65396bd84a9f3efddf78ee.jpeg", "infoid": 1005047, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-据四位知情人士透露，安然(Enron)前首席执行官杰弗里·斯基林(Jeffrey Skill)正在筹集资金，推出一个面向专业油气投资者的数字市场。斯基林因能源公司安然(Enron)倒闭而被判入狱14年，于去年获释。\n其中一位知情人士表示，这家名为Veld LLC的合资企业计划通过收取运营油气井股权的营销费用来获利，并将向对油气井股权感兴趣的投资者提供分析数据。\n不愿透露姓名的知情人士表示，投资者可以收购1至10口油井的股份，演示文稿称这些油井为“豆荚”，将作为高收益投资出售给投资者。\n目前尚不清楚斯基林寻求筹集多少资金来启动Veld。知情人士说，近几个月来，他一直在与能源投资公司举行会议。\n斯基林已经在这个项目上工作了近两年，该项目于2018年末首次由他的妻子在德克萨斯州注册成立，并于次年与特拉华州的一家同名公司合并。其中一位知情人士表示，预计该业务将在年底前启动并运营。\n然而，这位知情人士表示，至少有一位听取了他的介绍的投资者不愿投资于该合资企业，因为他曾在安然(Enron)工作过。\n斯基林没有回复寻求置评的请求，记者试图联系他的妻子也没有成功。\n其中一位知情人士说，除了斯基林，韦尔德还包括一名拥有博士学位的斯坦福数学家，帮助启动了这家企业。\n2006年，斯基林因参与能源巨头安然(Enron)的倒闭而被判犯有19项共谋、证券欺诈、内幕交易和向审计师撒谎的罪名。安然因大范围会计欺诈和腐败的曝光而崩溃。", "note_en": "(Reuters) - Former Enron CEO Jeffrey Skilling, released last year after a 14-year prison term stemming from the energy firm’s collapse, is raising funds to launch a digital marketplace catering to professional oil and gas investors, according to four people familiar with the matter.\n  The venture, called Veld LLC, plans to profit by charging a fee for marketing stakes in operating oil and gas wells, one of the people said, and will offer analytical data to investors interested in the well stakes.\n Investors can acquire holdings in between one and 10 wells, which the presentation described as “pods,” and will be sold to the investors as high-yield investments, the people familiar with the business pitch said on the condition of anonymity.\n It was not clear how much Skilling is seeking to raise to launch Veld. He has been holding meetings with energy investment firms in recent months, the people said.\n Skilling has been working nearly two years on the project, which was first incorporated by his wife in Texas in late 2018 and merged with a Delaware company with the same name the following year. The business is expected to be up and running by year-end, one of the people said.\n However, at least one investor who listened to his presentation was reluctant to invest in the venture because of his Enron past, that person said.\n Skilling did not respond to a request seeking comment and attempts to reach his wife were unsuccessful.\n In addition to Skilling, Veld consists of a Stanford mathematician with a doctoral degree helping start the venture, one of the people said.\n In 2006, Skilling was convicted of 19 counts of conspiracy, securities fraud, insider trading and lying to auditors for his part in the collapse of energy giant Enron, which imploded on the revelation of wide-spread accounting fraud and corruption.", "posttime": "2020-06-04 04:45:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "执行官,ceo,投资者", "title": "安然前首席执行官斯基林为石油投资者推出新的数字市场", "title_en": "Ex-Enron CEO Skilling launching new digital marketplace for oil investors", "transed": 1, "url": "https://uk.reuters.com/article/us-enron-skilling-new-venture-exclusive/exclusive-ex-enron-ceo-skilling-launching-new-digital-marketplace-for-oil-investors-sources-idUKKBN23A32L", "via": "", "real_tags": ["执行官", "ceo", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "276790940e7ed935db66606abf3eb369.jpg", "infoid": 1005046, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯坦福大学的研究人员设计了一种让数百架无人机使用公交车或电车的方法，试图重新设计包裹在城市中的分发方式。如果这样的解决方案能够扩大规模，它可以减少送货车拥堵和能源消耗，同时延长无人机递送包裹的距离。\n到目前为止，我们看到的大多数送货无人机都在郊区投递包裹，这是有原因的。城市中心可以是动态的环境，充满了意想不到的障碍，无人机仍然不被允许在城市中自由飞行。但研究人员表示，使用公共交通可以将无人机的航程比单独飞行增加高达360%。\n“我们的方法努力将完成任何交付的最长时间降到最低，”该团队在本周在线举行的2020年IEEE国际机器人与自动化会议(ICRA)上发表的一篇论文中写道。通过将两者的优势结合起来，我们可以获得显著的商业效益和社会影响。“。\n这种方法，包括无人机搭乘公交车和有轨电车的外部，可能有助于克服今天无人机有限的旅行能力。例如，广受欢迎的DJI Mavic 2最大飞行距离为18公里，即往返约11英里。\nVB Transform 2020 Online-7月15-17日。加入领先的人工智能高管：注册免费直播。\n斯坦福系统可以处理多达200架无人机，递送多达5000个包裹。人工智能网络是为拥有多达8000个停靠站的城市设计的，实验是专门在旧金山和华盛顿特区进行的。作为背景，旧金山市交通局(SFMTA)覆盖了150平方公里的面积，华盛顿大都会地区交通局(WMATA)覆盖了大约400平方公里的面积。\n多无人机网络不包括使用SFMTA或WMATA隧道。论文合著者Shushman Choudhury在一封电子邮件中告诉VentureBeat，模拟没有考虑任何物理基础设施，而是依赖于公交车站和无人机包裹仓库位置的开源数据。研究人员没有咨询SFMTA或WMATA官员，但在进一步研究发现额外的外部性或对城市社区的潜在影响后，这可能是有意义的。\n作者将该解决方案描述为类似于为协调多种交通方式而开发的按需移动服务算法。就像优步(Uber)、Lyft或其他将拼车选项与公共交通、电动滑板车和步行相结合的公司一样，这种模式采取了双层的方式。\n“首先，上层使用接近最优的多项式时间任务分配算法为包裹递送序列分配无人机。然后，较低层通过在公交网络上周期性地路由车队来执行分配，同时采用根据我们的设置量身定做的高效、有界、次优的多代理寻路技术，“论文写道。\n这项研究来自斯坦福智能系统实验室(SISL)和自主系统实验室。这项名为“使用运输网络的高效大规模多无人机交付”的工作被ICRA会议组织者提名为最佳多机器人系统论文。这篇论文的作者，包括Choudhury和Mykel Kochenderfer，去年发表了一项关于一种名为DREAMR的人工智能技术的研究，这种技术能够引导一架无人机，使用公交车和有轨电车来减少飞行时间和节约能源。\n本周在ICRA上详细介绍的多无人机方法假设包裹可以从任何分发站获得。它还假设无人机一次只携带一个包裹，在时间允许的情况下，无人机将在仓库充电或更换电池。下一步可能包括考虑延误和理想的出行时间窗口等问题。任何在旧金山乘坐过市政公交车的人都知道，交通和拥堵会大大占用旅行时间。\n“未来的一个关键方向是进行案例研究，估计我们框架的运营成本，评估其对道路拥堵的影响，并考虑潜在的外部性，如噪音污染和对城市社区的不同影响，”白皮书写道。", "note_en": "Researchers from Stanford University have devised a way for hundreds of drones to use the bus or trams in an effort to redesign how packages are distributed in cities. Should such a solution ever scale, it could reduce delivery van congestion and energy usage while extending the distance a drone can travel to deliver a package.\n There’s a reason most delivery drones we’ve seen thus far are  dropping packages off in the suburbs. Urban centers can be dynamic environments, full of unexpected obstacles, and drones are still not permitted to fly freely through cities. But researchers say using public transportation can increase a drone’s range up to 360% beyond travel with flight alone.\n  “Our approach strives to minimize the maximum time to complete any delivery,” the team writes in a paper published this week at the online 2020 IEEE International Conference on Robotics and Automation (ICRA). “By combining the strengths of both, we can achieve significant commercial benefits and social impact.”\n This approach, which involves the drones hitching a ride on the outside of buses and trams, could help overcome the limited travel capacity of drones today. The popular DJI Mavic 2, for example, is able to fly a maximum distance of 18 kilometers, or about 11 miles round trip.\n  VB Transform 2020 Online - July 15-17. Join leading AI executives:  Register for the free livestream.\n The Stanford system could handle up to 200 drones delivering up to 5,000 packages. The AI network is made for cities with up to 8,000 stops, and experiments were conducted specifically in San Francisco and Washington, D.C. For context, the San Francisco Municipal Transportation Agency (SFMTA) covers an area of 150km 2 and the Washington Metropolitan Area Transit Authority (WMATA) covers an area of roughly 400km 2.\n The multi-drone network does not include use of SFMTA or WMATA tunnels. Paper coauthor Shushman Choudhury told VentureBeat in an email that simulations do not take into account any physical infrastructure, and instead relied on open source data on bus stops and drone package depot locations. Researchers did not consult SFMTA or WMATA officials, but that could make sense after further research to discover additional externalities or potential impact on urban communities.\n The authors describe the solution as resembling algorithms on-demand mobility services developed to coordinate multiple modes of transportation. Like Uber, Lyft, or other companies that combine ride-sharing options with public transportation, electric scooters, and walking, the model takes a two-layered approach.\n “First, the upper layer assigns drones to package delivery sequences with a near-optimal polynomial-time task allocation algorithm. Then the lower layer executes the allocation by periodically routing the fleet over the transit network while employing efficient bounded-suboptimal multi-agent pathfinding techniques tailored to our setting,” the paper reads.\n The research comes out of the Stanford Intelligent Systems Laboratory ( SISL) and Autonomous Systems Lab. Titled “Efficient Large-Scale Multi-Drone Delivery using Transit Networks,” the work was nominated by ICRA conference organizers for best multi-robot systems paper. Authors of the paper, including Choudhury and Mykel Kochenderfer, published research last year about an  AI technique called DREAMR that’s capable of guiding a single drone, using buses and trams to reduce flight time and conserve energy.\n The multi-drone approach detailed at ICRA this week assumes packages can be acquired from any dispatch depot. It also assumes a drone will carry one package at a time and that drones will recharge or replace batteries at depots when time allows. Next steps could include factoring in issues like delays and ideal travel time windows. Anybody who’s ridden a Muni bus in San Francisco knows traffic and congestion can considerably chew into travel times.\n “A key future direction is to perform case studies that estimate the operational cost of our framework, evaluate its impact on road congestion, and consider potential externalities, like noise pollution and disparate impact on urban communities,” the paper reads.", "posttime": "2020-06-04 04:45:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "实验室,lab,无人机", "title": "斯坦福实验室设想通过乘坐公交车来节省能源的送货无人机", "title_en": "Stanford lab envisions delivery drones that save energy by taking the bus", "transed": 1, "url": "https://venturebeat.com/2020/06/03/stanford-lab-envisions-delivery-drones-that-save-energy-by-taking-the-bus/", "via": "", "real_tags": ["实验室", "lab", "无人机"]}]