[{"category": "", "categoryclass": "", "imagename": "2617887782f59f9346715eef63167b06.jpg", "infoid": 1014444, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "模拟袖珍将于美国太平洋标准时间8月3日上午8点(美国东部时间上午11点)开始接受预订，售价为199.99美元。然而，实际的发货日期比这晚了很长一段时间：Analogue估计硬件实际上应该在2021年5月开始交付给客户。据该公司称，这是由于“不幸的全球局势和我们无法控制的供应链挑战”，而且他们并不是唯一家感受到持续的新冠肺炎疫情及其对科技供应商影响的独立硬件公司。\n好消息是，只要你有耐心，Pocket几乎肯定会送货的。Analogue在这方面并不新鲜，过去已经成功发货了多种产品，包括NT mini、Super NT和Mega Sg。其中每一个都不仅仅是兑现了他们的承诺，在将经典游戏带到现代电视和显示器上提供了奇妙的性能-而不依赖于仿真。\nAnalog Pocket自去年首次推出以来已经有了一些变化，启动和选择按钮被重新安置在设备前面的底座上，根据该公司的说法，这一设计变化是为了“最佳舒适性”而设计的。您可以用来将Pocket连接到电视上以获得大屏幕游戏体验的Dock现在还具有一个凹陷的USB-C端口，使连接更加稳定。\n一如既往，在将经典游戏与现代便利相结合方面，Analogue设计了Pocket的睡眠和唤醒功能，这更像你对今天的智能手机和平板电脑的预期：按一下电源按钮，控制台就会进入低功耗挂起状态-再按一次，它就会醒到你停下来的地方。对于那些通常缺乏内部保存机制的游戏来说，这是一个令人敬畏的额外福利。\n模拟底座(99.99美元)可以同时支持多达4个控制器，使用有线、蓝牙或2.4 GHz无线连接。您还可以使用单独提供的多链路电缆连接最多四个口袋，以进行本地多人游戏。\nAnalogue还为Pocket提供了一系列其他配件，包括用于存储和运输的透明硬壳、USB-C快速充电电源块、提供与Game Gear、Neo Geo Pocket Color和Atari Lynx游戏兼容的适配器，以及用于连接Mac、PC和音乐外围设备的MIDI和Analog同步电缆，以便与该公司的Nanoloop音乐创作软件一起使用。\n该公司还展示了Pocket的一些新的软件功能，包括“原始显示模式”，它忠实地呈现了这些游戏可用的原始硬件控制台的显示(怪异和所有)。显示器本身是由大猩猩玻璃制成的，具有额外的弹性，并提供可变的刷新率和360度自定义旋转控制。\n模拟掌上电脑有一个4300毫安的内置充电电池，可以提供6到10个小时的游戏时间，在不活跃的时候提供超过10个小时的睡眠。\n这看起来绝对是Analogue迄今为止最令人印象深刻的产品，对于便携式游戏机来说，这将是一个真正令人惊叹的产品。", "note_en": "The Analogue Pocket will be available to pre-order for $199.99 on August 3, starting at 8 AM PST (11 AM EST). The actual ship date is quite a while after that, however: Analogue estimates that the hardware should actually start to be delivered to customers in May, 2021. That’s due to “the unfortunate global state of affairs and supply chain challenges outside of our control,” according to the company, and they’re hardly the only indie hardware outfit feeling the pinch of the ongoing COVID-19 pandemic and its impact on tech suppliers.\n   The good news is that so long as you’re patient, the Pocket will almost certainly deliver the goods. Analogue isn’t new to this, having successfully shipped multiple products in the past, including the Nt mini, the Super Nt and the Mega Sg. Each of these more than delivered on their promises, offering fantastic performance in bringing classic games to modern TVs and displays – without relying on emulation.\n Analogue Pocket has changed a bit since it was originally introduced last year, with the start and select button relocated to the base of the front of the device, a design change designed for “optimal comfort” according to the company. The Dock that you can use to connect the Pocket to your TV for a big-screen gaming experience also now features a recessed USB-C port to make the connection more stable.\n True to form in terms of combining classic gameplay with modern conveniences, Analogue has designed Pocket with a sleep and wake function that’s much more like what you’d expect from today’s smartphones and tablet: Press the power button once and the console enters a low-power suspended state – press it again and it wakes to right where you left off. That’s an awesome perk for games that often lack their own internal save mechanisms.\n  The Analogue Dock ($99.99) can support up to four controllers at once, using either wired, Bluetooth or 2.4ghz wireless connectivity. You can also use separately available multilink cables to connect up to four Pockets for local multiplayer action.\n Analogue is also offering a range of other accessories for the Pocket, including a transparent hard case for storage and transportation, a USB-C fast-charging power brick, adapters to provide compatibility with Game Gear, Neo Geo Pocket Color and  Atari   Lynx games, and MIDI and Analog sync cables for connecting to Mac, PC and music peripherals for use with the company’s Nanoloop music creation software.\n  The company has also revealed some new software features for the Pocket, including ‘Original Display Modes’ which provides faithful representations of the displays (quirks and all) of the original hardware consoles these games where available for. The display itself is made of Gorilla Glass for extra resilience, and offers variable refresh rates and 360-degree custom rotation control.\n Analogue Pocket has a 4,300 mAh built-in rechargeable battery that offers between 6 and 10 hours of play time, and over 10 hours of sleep when not in active use.\n This definitely looks like Analogue’s most impressive product yet, and one that will be truly amazing for portable console gaming.", "posttime": "2020-07-28 00:17:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,pocket,august", "title": "\n模拟Pocket复古便携式游戏机预购开始于8月3日，发货时间为2021年5月", "title_en": "\n\t\t\t\tPre-orders for the Analogue Pocket retro portable game console start August 3, ships May 2021\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/pre-orders-for-the-analogue-pocket-retro-portable-game-console-start-august-3-ships-may-2021/", "via": "", "real_tags": ["游戏", "pocket", "august"]}, {"category": "", "categoryclass": "", "imagename": "d42b0ec0213e4b1d0c579a98ecc28606.jpg", "infoid": 1014443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一种新设备承诺可以做到这一点，它通过超声波干扰来检查你的亚马逊Echo一直在线的麦克风。这款名为Alexagate的小玩意是炒作即服务初创公司MSCHF的最新产品。上个月，这家初创公司宣布与YouTuber Mr Beast合作，这是一款应用程序，用户只要把手指放在手机上，就可以赢得虫子奖金。比赛以多名获胜者结束，比赛从几个小时延伸到几天。\nAlexagate是一款为时代服务的产品，包含了公众和私人对大型技术的许多担忧。这个装置花了一年多的时间计划才得以复活，这是一个新奇的项目，但它确实有效，而且它需要真正的工程人员来建造。该设备有7个独立的超声波扬声器，它们被安排用声音淹没Echo设备上的扬声器，使它们听不到任何其他东西。可翻转的塑料接口使Alexagate可以无缝地安装在大多数Echo设备上。\n在我自己的实验中，这个设备完全按照它说的做，当它打开时会干扰Alexa。如果你真的想使用你的智能扬声器，你可以鼓掌并停用Alexagate，让“嘿Alexa”得到亚马逊智能扬声器的回应。\n它是专门为亚马逊Echo设备设计的，尽管Wiesner说他们选择亚马逊很大程度上是因为他们的扬声器是最常见的。然而，当你打开盒子时，你会看到一份产品指南，标题是“再见贝佐斯”，这表明这款设备在某种程度上是为了把它贴在世界首富身上。\n该产品的宣言页面播下了质疑大型科技公司是否在监听用户对话的种子，“也许你并不认同Facebook总是通过你手机的麦克风监听，但你至少要诚实地问问自己：你认为Echo的‘静音’按钮真的有什么作用吗？”\n这是一条诱人的线路，但与安全研究人员对这些硬件杀死开关的发现不一致，这些硬件杀死开关确实是通过直接切断设备麦克风的电源来工作的。事实是，这些想法之所以流行起来，是因为人们通常不相信Facebook或亚马逊会负责任地处理他们的隐私。MSCHF创意总监凯文·维斯纳(Kevin Wiesner)表示，这一想法是创造该设备的核心。\n“因此，当我们提出实物产品创意时，我们在内部为自己设定的指导方针是有观点的对象。”Wiesner在一次采访中告诉TechCrunch。“你要把它放在起居室里，在某种程度上，它几乎就像是向走进你家的人发出的美德信号，他会在你的桌子上看到它。”从这个意义上说，这是一种炫耀的隐私，因为这有点像是要开始讨论拥有一台智能设备意味着什么，以及你为此放弃了什么。“。\n智能扬声器远不是必要的设备，所以对于可能“需要”这样东西的用户来说，争论可能归结为呼吁他们拔下Echo的插头，在没有它提供的温和便利的情况下生活。虽然它是一个功能性的装置，但Alexagate更专注于它的创作背后的主题。在很多方面，来自大型科技公司的产品正变得不可避免，用户喜欢它们的一些东西，并希望他们可以避免产品的其他元素，这是没有错的。\n这是去中心化倡导者使用的论点，他们想要自由地修改他们使用的公司产品，这样他们就可以为他们想要的产品量身定做。在Alexagate的例子中，用户可能想要智能扬声器的便利性，但又想要外部公司的制衡，以确保它听不到任何东西。\nMSCHF的Alexagate设备现在可以在他们的网站上购买，售价99美元。它似乎还不能在亚马逊上购买。", "note_en": "A new device promises to do just that, placing a check on your Amazon Echo’s always-on microphones through ultrasonic jamming. The gadget, dubbed  Alexagate, is the latest drop from hype-as-a-service startup MSCHF. Last month, the startup announced a partnership with YouTuber MrBeast and an app where users could win bug bucks as long as they kept their finger on their phone. The contest ended with multiple winners as the competition stretched from hours into days.\n   Alexagate is a product for the times, encapsulating a lot of public and private fears about big tech. The device, which took over a year of planning to come to life, is a novelty item, but it does work and it required real engineering to build. The device features 7 individual ultrasonic speakers that are arranged to jam the speakers on Echo devices by overwhelming them with sound so that they can’t hear anything else. A flippable plastic interface allows the Alexagate to fit seamlessly to most of the Echo devices out there.\n In my own experiments, the device does exactly what it says, jamming Alexa when it’s turned on. If you do want to use your smart speaker, you can clap and deactivate the Alexagate, allowing “Hey Alexa” to get a response from the Amazon smart speaker.\n It was designed specifically for Amazon Echo devices, though Wiesner says they chose Amazon largely because their speakers were the most common. Nevertheless, when you open the box, you’re hit with a product guide featuring the title “BYE BYE BEZOS,” indicating that the device is in some ways meant to stick it to the world’s richest man.\n  The product’s  manifesto page sows seeds of doubt around whether big tech is listening into user conversations, “Perhaps you don’t subscribe to the notion that Facebook always listens through your phone’s mic, but ask yourself at least this in all honesty: Do you think the Echo “mute” button really does anything?”\n It’s a tantalizing line but sits at odds with what security researchers have found about these hardware kill switches which do indeed work by cutting power directly to the device’s microphones. The fact is that these ideas take off because people generally don’t trust a Facebook or Amazon to approach their privacy responsibly. This idea was central to the creation of the device,  MSCHF creative director Kevin Wiesner says.\n “So, the guideline that we set for ourselves internally when we’re coming up with physical products ideas is objects that have a point of view.” Wiesner told TechCrunch in an interview. “You’re gonna put this in your living room and, in some ways, it’s almost like a virtue signal to someone who comes into your into your house and sees it on your end table. It’s ostentatious privacy, in that sense because it is kind of like supposed to start a discussion of what it means to have a smart device and what you’re giving up for it for that.”\n Smart speakers are far from essential devices, so the argument for users who might “need” something like this might boil down to calls for them to just unplug their Echo and live without the mild conveniences it provides. Though it’s a functional device, the Alexagate is more focused on the themes its creation stands behind. In a lot of ways, products from huge tech companies are becoming unavoidable and it’s not wrong for users to like some things about them and wish that they could avoid other elements of the products.\n  It’s an argument used by decentralization advocates who want the freedom to hack around with a company’s products that they use so that they can tailor them for exactly what they want. In Alexagate’s instance, users might want the convenience of a smart speaker but want the checks and balance of an external company verifying that it can’t hear a thing.\n MSCHF’s Alexagate device is available now on their website for $99. It doesn’t appear to be available for purchase on Amazon quite yet.", "posttime": "2020-07-28 00:17:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,drops,设备", "title": "\nMSCHF为您的Amazon Echo添加了超声波干扰设备", "title_en": "\n\t\t\t\tMSCHF drops an ultrasonic jamming device add-on for your Amazon Echo\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/mschf-drops-an-ultrasonic-jamming-device-add-on-your-amazon-echo/", "via": "", "real_tags": ["amazon", "drops", "设备"]}, {"category": "", "categoryclass": "", "imagename": "a9b5a4a09c2506e3b909433e915657e8.jpg", "infoid": 1014442, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一印象就是一切，而推介平台往往是投资者和商业合作伙伴对公司的第一眼。这些资料准确、简明、有效地展示和说明公司的目标和潜力，这一点至关重要。\n我们已经得到了一些最好的风险资本家的帮助。在这些会议期间，风投们将逐一浏览每张幻灯片，讨论什么管用，什么不管用，以及需要做出哪些改变才能产生最大的影响。在此过程中，预计会听到投资者如何评估投标台的宝贵见解，以及可能导致潜在投资停摆的危险信号。\n更重要的是，我们正在寻找在这些课程中发挥作用的投球台。我们想要展示来自真实公司的真正的推销台。任何人都可以提交他们的甲板，尽管我们正在寻找来自早期公司的甲板。请在此处提交您的投球台。\n如果选中，您将收到通知，并被告知您的卡片组将出现在哪个会话中。\nPitch Deck Teardown是一个更大的活动的一部分，该活动专注于建筑技术公司的方方面面。TechCrunch一年一度的盛大活动Disrupt将于2020年完全虚拟化，这是第一次，让更多的人参加并与演讲者、投资者和创始人互动。中断将持续五天-9月14日至18日-以使每个人都更容易欣赏到所有令人惊叹的节目。本周五价格上涨，所以现在就拿到你的通行证，然后提交你的推荐卡，让我们的风险投资小组提供宝贵的反馈。", "note_en": "First impressions are everything, and pitch decks are often the first glimpse of companies by investors and business partners. It’s critical that these decks accurately present and illustrate the company’s goals and potential concisely and effectively.\n We’ve enlisted the help of some of the best venture capitalists. During these sessions, VCs will step through each slide, talking about what works, what doesn’t work, and what needs to be changed to make the most impact. Along the way, expect to hear valuable insight on how investors evaluate pitch decks and the red flags that can shut down a potential investment.\n  What’s more, we’re looking for pitch decks to feature in these sessions. We want to showcase real pitch decks from actual companies. Anyone can submit their deck though we’re looking for decks from early stage companies.   Submit your pitch deck here.\n  If selected, you’ll be notified and told which session your deck will be featured in\n   Pitch Deck Teardown is part of a much larger event focused on all aspects of building technology companies. For the first time, TechCrunch’s big yearly event,  Disrupt, is going fully virtual in 2020, allowing more people to attend and interact with speakers, investors, and founders. And  Disrupt will stretch over five days — September 14-18 — in order to make it easier for everyone to take in all the amazing programming.  Prices increase this Friday, so  get your pass now and then submit your pitch deck for invaluable feedback from our panel of VCs.", "posttime": "2020-07-28 00:16:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,甲板,deck", "title": "\n提交您的沥青甲板以扰乱2020年的沥青甲板拆卸", "title_en": "\n\t\t\t\tSubmit your pitch deck to Disrupt 2020’s Pitch Deck Teardown\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/submit-your-pitch-deck-to-disrupt-2020s-pitch-deck-teardown/", "via": "", "real_tags": ["2020", "甲板", "deck"]}, {"category": "", "categoryclass": "", "imagename": "be69efb6f3e8265ab8537a0d90a4e7c8.png", "infoid": 1014441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯坦福大学的一群研究生很清楚他们的胜算很高，他们认为他们也应该能够让同学们变现-而不仅仅是经过认可的投资者和超级富豪。\n他们已经成立了斯坦福2020，这是一个完全由斯坦福同学创建的新基金，用于投资他们同学的企业。\n这个想法是由6名学生激发的，他们与芬威克和安永西部律师事务所(Fenwick&amp；West)合作了一年，找到了一个合适的法律架构，最终创建了一个投资俱乐部--只要多方拥有某种形式的共同关系，他们就可以一起投资。\n斯坦福2020的创始成员之一、风投公司NEA前风险投资助理斯蒂芬·梅(Steph Mui)成立了这个俱乐部，无视天使投资的不可获得性，她将天使投资描述为硅谷精英地位的象征。\n她说：“特别是在硅谷，它似乎是一种地位的象征，只有经过认可的人才能做到，它让人感觉非常精英。”“我们开始更多地思考，是否真的可以让整个班级都能参与其中，或者至少让更多人能够参与，而不仅仅是像这些关起门来做这件事的小口袋里的人？”\n斯坦福2020俱乐部的会员必须支付最低3000美元才能加入投资俱乐部，任何最终的回报都将按比例分配给每个人的投资。到目前为止，梅告诉TechCrunch，已经通过175名投资者筹集了150万美元，其中50名投资者愿意在等待名单上提供50万美元。事实上，该俱乐部“超额认购”，以至于它正在努力返还资金。\n梅估计，班上大约有40%的人参加了俱乐部。创始成员被定义为“董事会成员”，他们是出于激情以及背景、专业兴趣和过去的领导经验的多样性而被招募的。\n该集团计划根据融资规模和估值，向初创企业投资5万至10万美元。\n梅认为，斯坦福2020的竞争优势很大程度上在于它与将投资的公司之间的个人关系。毕竟，成功可能只是伸手可及的事。Cloudflare首席执行官马修·普林斯(Matthew Prince)表示，臭名昭著的是，Cloudflare、Rent the Runway和ThredUP都是在分配了一个课堂项目后出生在同一间教室里的。\n她说：“我们有如此牢固的既有关系，甚至在人们筹集资金之前，我们就知道他们在做什么。”\n任何以前参加过俱乐部或球队的人都知道忠诚根深蒂固，但我们将拭目以待，看看这种亲密关系是否足以让创始人分发他们公司的股份。虽然斯坦福2020不收取任何管理费或附带费用，但股权并不随意；从这一点来看，一家著名的硅谷公司可能比你的同学更有用武之地。\n斯坦福2020的设立听起来与StartX类似，StartX是斯坦福大学试图投资于自己郁郁葱葱的后院的举措，后者于2019年关闭。StartX成立于2013年，提出投资任何一家通过辅助加速器并从专业投资者那里获得50万美元的初创公司的股权。\n看看斯坦福2020的设置，规则几乎完全相同。梅告诉TechCrunch，初创企业必须满足两个标准才能自动投资：第一，联合创始人必须是班级成员，第二，他们必须从信誉良好的机构投资者那里筹集75万美元或更多。他们将声誉定义为从业内顾问那里获得指导的80名投资者的名单。\n基于规则的自动投资策略的概念随之而来的是一个大危险信号：如果创始人有一个糟糕的想法，或者是一个坏人，而且仍然符合标准，怎么办？\n“我真的想不出一个人，我想，那个人太坏了，或者太不道德了，以至于我们不会投资他们，”梅说，“我真的想不到一个人，我觉得他太坏了，太不道德了，我们不会投资他们。“这是只投资于你的同学的部分好处。”\n但如果斯坦福出生的班级确实有一个有问题的创始人，斯坦福2020有一个否决投票机制。\n总体而言，斯坦福出生的初创公司在获得现金方面比大多数公司处于更有利的地位。他们并不迫切需要另一个基金来投资。梅对斯坦福2020的雄心壮志是，其他学校可以复制和粘贴他们花了一年时间(以及大量艰苦的工作)才弄清楚的法律结构。\n她说，他们已经从斯坦福大学的新生班级、其他斯坦福学校和本科生那里入境了。现在它已经关闭了，她希望他们也能收到其他商学院的消息。", "note_en": "One group of Stanford graduate students is well-aware of their favorable odds, and think that they should be able to cash in their classmates, too — not just accredited investors and the super-wealthy.\n They have put together, Stanford 2020, a new fund created entirely by Stanford classmates to invest in their fellow students’ ventures.\n  The idea was spurred by six students, who after a year of working with  Fenwick   &amp; West law firm to find a suitable legal structure landed on creating an investment club — multiple parties can invest together as long as they have some form of shared ties.\n Steph Mui, a founding member of Stanford 2020 and former venture capital associate at VC firm  NEA, formed the club in defiance of the inaccessibility of angel investing, which she described as an elite Silicon Valley status symbol.\n “Especially in Silicon Valley where it seems kind of a status symbol and only accredited people can do it, it feels very elite” she said. “We started thinking more about if we can actually make this something that the whole class could participate in, or at least make it more accessible to more than just like these small pockets of people that do it behind closed doors?”\n Stanford 2020 club members must put up a minimum of $3,000 to join the investment club, and any eventual returns will be distributed proportionally to the investment each makes. So far, Mui tells TechCrunch that $1.5 million has been raised across 175 investors, with 50 investors willing to give $500,000 on the waitlist. In fact, the club is so “oversubscribed” that it is working to give money back.\n Mui estimates that roughly 40% of the class is participating in the club. The founding members are being defined as “board members” who were recruited for passion and for diversity in background, professional interests, and past leadership experience.\n The group plans to invest $50,000 to $100,000 in startups depending on round size and valuation.\n Mui thinks that Stanford 2020’s competitive advantage is largely the personal relationship it has with the companies it will invest in. After all, success might be just an arms reach away. Notoriously,  Cloudflare,  Rent the Runway, and  Thredup were all born in the same classroom after being assigned a class project, according to Cloudflare CEO  Matthew Prince.\n “We have such strong pre-existing relationships, we know what people are working on way before they even raise,” she said.\n Anyone who has been part of a club or team before knows that loyalty runs deep, but we’ll see if that closeness is enough for a founder to dole out a stake in their company. While Stanford 2020 doesn’t take any management fee or carry, equity isn’t casual; in that vein, a famed Silicon Valley firm might be of better utility than your classmates.\n Stanford 2020’s set up sounds similar  to StartX, the university’s attempt at investing in its own, leafy backyard  which shut down in 2019. Launched in 2013, StartX offered to invest money in exchange for equity in any startup that went through its auxiliary accelerator and has $500,000 from professional investors.\n Looking at Stanford 2020’s set up, the rules are almost exactly the same. Mui tells TechCrunch that startups must fulfill two criteria in order to automatically invest: first, the co-founder must be a member of the class, and second, they must raise a round of $750,000 or more from a reputable institutional investor. They define reputable as a list of 80 investors they got guidance on from advisors in the industry.\n The concept of a rule-based automatic investment strategy comes with a big red flag: what if the founder has a bad idea or is a bad person, and still meets the criteria?\n “I actually literally can’t think of a single person and I’m like, that person is so bad or so immoral, that we wouldn’t invest in them,” Mui said. “That’s part of the benefit of investing only in your classmates.”\n But in case a Stanford-born class does have a problematic founder, Stanford 2020 has a veto voting mechanism.\n In the grand scheme of things, Stanford-born startups are in a better spot than most when it comes to securing cash. They don’t desperately need  another fund to invest in them. Mui’s ambition for Stanford 2020 is that other schools can copy and paste the legal structure they took a year (and a lot of hard work) to figure out.\n She says they’re already getting inbound from incoming Stanford classes, other Stanford Schools, and undergraduates. Now that it’s closed, she hopes they hear from other business schools, too .", "posttime": "2020-07-28 00:16:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大学,风险投资,学生,students,投资", "title": "\n斯坦福大学的学生通过投资于他们的同龄人而使风险投资公司短路", "title_en": "\n\t\t\t\tStanford students are short-circuiting VC firms by investing in their peers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/stanford-students-are-short-circuiting-vc-firms-by-investing-in-their-peers/", "via": "", "real_tags": ["大学", "风险投资", "学生", "students", "投资"]}, {"category": "", "categoryclass": "", "imagename": "9ab5fccb26ed9a15fe7dfc47943fb6ed.gif", "infoid": 1014440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Disrupt 2020从9月14日至18日举行，给您五天精彩的时间来会见来自世界各地的与会者，探索新技术，发现最新趋势，扩展您的创业知识，并与能够帮助您的企业发展的人建立联系。\n让我们来谈谈Disrupt 2020的两个主要功能--数字创业小巷和创业战场。前往Digital Startup Alley，发现数百家首轮之前的初创公司-包括由眼光敏锐的TechCrunch编辑挑选的优秀初创公司干部TC Top Picks-展示他们的最新技术产品、平台和服务。安排视频会议观看产品演示、与创始人交谈、发现协作、投资或就业机会。\n我们的人工智能网络平台CrunchMatch使您比以往任何时候都更容易找到与您的目标和兴趣一致的人和初创公司-或者让这些人找到您。填写几个快速问题，为高效的网络做好准备。\n“CrunchMatch网络平台基本上是技术人员的快速约会平台，它非常有帮助。我安排了至少10次简短而精确的会议。我了解了秘密模式下的初创企业，了解了大公司在做什么-媒体还没有注意到的事情。这很棒，我跟进了其中的三四个联系。“--SAP技术主管兼产品经理延斯·莱曼(Jens Lehmann)。\n不要错过每一场颠覆性赛事的精华--创业战场投球大赛(Startup Battlefield Pitch)。来自世界各地的早期初创公司申请，只有一小部分干部符合TechCrunch编辑的严格标准。他们将只有6分钟的时间向一个由专家评委组成的严苛的评审团展示他们最好的推介和演示。\n有什么利害关系？令人垂涎的颠覆杯，对全球媒体和投资者的大量曝光率，以及-请鼓点-10万美元的无股权现金。谁知道呢，你可能会亲眼目睹未来的科技巨头登上世界舞台。\n我们甚至还没有涉及到你可以在中断阶段享受的数十个演讲者、小组讨论和分组会议-我们每周都会宣布更多的演讲者。\nDisrupt 2020将于9月14日至18日举行。如果你想成为一个精明的储蓄者，你需要玩节拍游戏。在7月31日晚上11点59分之前购买早班票。PT最高可节省300美元。\n贵公司是否有兴趣赞助或参展Disrupt2020？请填写此表格与我们的赞助销售团队联系。", "note_en": "Disrupt 2020 runs from September 14-18 giving you five magnificent days to meet attendees from around the world, explore new technologies, discover the latest trends, expand your startup knowledge and connect with the people who can help your business grow.\n Let’s talk about two of the main features of  Disrupt 2020 —  Digital Startup Alley and the  Startup Battlefield. Head on over to  Digital Startup Alley and discover hundreds of pre-series A startups — including the  TC Top Picks, a cadre of outstanding startups selected by discerning TechCrunch editors — exhibiting their latest tech products, platforms and services. Schedule video meetings to watch product demos, talk with founders, discover opportunities for collaboration, investment or employment.\n  And  CrunchMatch, our AI-powered networking platform, makes it easier than ever to find the people and startups that align with your goals and interests — or for those folks to find you. Fill out a few quick questions and get ready for efficient networking done right.\n “The CrunchMatch networking platform, which is basically speed-dating for techies, was very helpful. I scheduled at least 10 short, precise meetings. I learned about startups in stealth mode, what big corporations were up to — things not yet picked up by the press. It was great, and I followed up on three or four of those connections.” — Jens Lehmann, technical lead and product manager, SAP.\n Don’t miss the gem of every  Disrupt event — the Startup Battlefield pitch competition. Early-stage startups from around the world applied, and only a small cadre met TechCrunch editors’ exacting standards. They’ll have just six minutes deliver their best pitch and demo to a tough panel of expert judges.\n What’s at stake? The coveted Disrupt Cup, massive exposure to global media and investors and — drumroll please — $100,000 in equity-free cash. Who knows, you just might witness future tech giants launching on a world stage.\n We haven’t even touched on the dozens of  speakers, panel discussions and breakout sessions you can enjoy across the Disrupt stages — and we’re announcing more speakers every week.\n Disrupt 2020 takes place on September 14-18. If you want to be a savvy saver, you need to play beat the clock.  Buy your early-bird pass before July 31 at 11:59 p.m. PT to  save up to $300.\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? Contact our sponsorship sales team by   filling out this form .", "posttime": "2020-07-28 00:15:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,通行证,left,创业", "title": "\n只剩下5天：最高可节省300美元的通行证，以扰乱2020年", "title_en": "\n\t\t\t\tJust 5 days left: Save up to $300 on passes to Disrupt 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/just-5-days-left-save-up-to-300-on-passes-to-disrupt-2020/", "via": "", "real_tags": ["2020", "通行证", "left", "创业"]}, {"category": "", "categoryclass": "", "imagename": "925c17cd5c3344094cc62576b8dc7028.jpg", "infoid": 1014439, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在流媒体时代，音乐是通过各种在线服务访问的，本质上是短暂的，从来不会生活在设备上。然而，随着一种非常特殊的格式的发展，在线音频革命真正拉开了序幕。作为痛苦的说唱和突破性的诉讼的主题，这一来自德国的发展改变了我们所知的音乐产业。在选择著名的“.mp3”文件名25年后，我们回顾了它是如何产生的，以及它为什么占据了世界。\n通往MP3的道路是漫长的。其目标是创建一种能够以低比特率编码高质量音频的编解码器。找到一种不影响音频质量的压缩方法是关键。在硬盘是以几十或几百兆字节为单位的时代，以每分钟10MB左右的CD质量存储未压缩的数字音频是不切实际的。\n在20世纪80年代，世界各地的研究人员都在研究各种编码方法来解决这个问题。1988年，当运动图像专家组呼吁制定音频编码标准时，事情开始升温。第二年，提交了14份提案。成立了四个工作组，开始进一步研究各种编码方法。\n这一过程中产生的主要技术之一是MUSICAM，它采用了人类听觉的心理声学模型来帮助压缩。这利用了听觉掩蔽的效果，听觉掩蔽是人类听觉的一种感知限制，其中一些声音掩盖了其他声音，使其无法同时被听到。通过消除与这些声音相对应的数据，这些声音无论如何都不会被感知到，因此可以在更小的空间中存储更多的音频，而不会对听者产生任何感知的影响。\nMUSICAM技术成为许多原始MPEG 1音频层I和II的基础。弗劳恩霍夫研究所的一组研究人员采用了心理声学编码滤波器组技术，同时将从竞争的ASPEC提案中收集到的一些想法融入到MPEG中。目标是创建能够以128 kbps提供与第二层192 kbps相同质量的第三层编解码器。最终结果于1993年在MPEG-1标准中公布。\n随着互联网的快速发展，Fraunhofer团队意识到他们的标准有可能成为平台上音频的事实上的标准。凭借其小文件大小和高质量，它非常适合在当时连接速度较慢的情况下进行共享。在1995年7月14日的一封决定性的电子邮件中，该团队决定他们的文件应该带有现在著名的.MP3扩展名。\n最初的商业计划是通过销售编码器来将这项技术货币化。这些将以高价出售给希望创建能够对MP3文件进行编码的软件或硬件的公司。为了推动对该标准的接受，用于播放MP3文件的解码器将是廉价或免费的，以鼓励消费者接受。\n虽然这最初看起来是可行的，但事情很快就分崩离析了，这要归功于弗劳恩霍夫将自己的命运寄托在互联网上。1997年，一名澳大利亚学生用偷来的信用卡购买了MP3编码软件，然后迅速在FTP服务器上在线共享。突然之间，任何人都可以很容易地创建自己的MP3文件。随着这些文件被公开，要求停止该软件传播的呼吁被置若罔闻。\n在很短的时间内，就可以很容易地下载免费的程序来从CD中翻录音频，并以几乎相同的质量存储它，大小是MP3的十分之一。网站如雨后春笋般涌现，允许用户自由下载他们选择的音乐。虽然FTP服务器是当时事实上的文件共享标准，但1999年推出了Napster，这是一个允许只有最少技术知识的用户直接与他人共享他们的数字音乐收藏的平台。音乐产业刚刚被永远地改变了。\n突然之间，花16.98美元买一张CD的想法似乎很可笑，因为在网上很容易就可以免费获得同样的音乐。唱片公司和艺术家争先恐后地提起诉讼，起诉乐迷们巨额赔偿，以阻止下载。尽管有一些高调的法律斗争，但人们对音乐的态度已经无可挽回地改变了。MP3播放器也已经上市，允许用户携带大量歌曲，而不必摆弄易碎的CD。这些都同样遇到了法律挑战，但MP3的霸主地位是无法克服的。\n即使在Napster破产之后，其他服务也在其关闭留下的真空中蓬勃发展。海盗们从这起案件中吸取了教训，权力下放成为避免法律麻烦的关键。这将犯罪的责任放在了那些共享文件的人身上，而不是那些运行只促进文件传输的点对点服务的人身上。\n销售数字音频的服务还需要很多年才能蓬勃发展。由于高昂的价格和限制性的DRM，首次推出的产品给客户的体验只是比免费提供的干净、无拘无束的MP3更糟糕。\nMP3的主导地位直到2010年代才开始减弱，当时向流媒体技术和智能手机的过渡开始提供更好的用户体验。而不是必须管理数十亿字节的歌曲集合，并将它们从一个设备拖到另一个设备，取而代之的是，用户只需点击一个按钮，就可以简单地调用几乎任何他们想要的音乐。就像Facebook击败了Myspace一样，流媒体的易用性很快就让MP3播放器和这种格式本身成为了过去。\n虽然我们中很少有人还在文件共享网络上搜索最新的专辑，但MP3是永远改变人们对音乐交付方式以及人们愿意为其支付的价格的关键。\n在这个动荡的时期，艺术家和唱片公司的薪酬结构发生了巨大的变化。像iTunes这样的后MP3服务曾经以每首歌曲99美分的价格出售曲目，而现在艺术家们每条流只收到几分钱。然而，至少在理论上，实体媒体的重要性降低也使艺术家有可能在不需要唱片公司将产品转移到国际上的情况下取得突破。像Soundcloud说唱和Vaporwave这样的流派从允许初露头角的音乐家在网上分享他们的音乐的服务中有机地涌现出来。很容易将这种亚文化与MP3催生的在线音乐分享的曙光直接联系起来。\n虽然弗劳恩霍夫可能没有从这项技术中获得他们想要的商业胜利，但MP3无疑永远改变了音乐的面貌。艺术家们可能仍然会为过去几年吝啬的流媒体服务和专辑版税带来的回报不断减少而哭泣，唱片公司仍然会像自卡带时代以来那样，对未经许可的复制感到愤怒。然而，MP3仍然是一项使音乐的获取和创作民主化的技术，因此，它应该受到赞扬。祝MP3生日快乐，为又一个25年的高质量压缩音乐干杯！", "note_en": "In the streaming era, music is accessed from a variety of online services, ephemeral in nature and never living on board the device. However, the online audio revolution really kicked off with the development of one very special format. The subject of bitter raps and groundbreaking lawsuits, this development from Germany transformed the music industry as we know it. Twenty-five years on from the date the famous “.mp3” filename was chosen, we take a look back at how it came to be, and why it took over the world.\n    The road to MP3 was a long one. The aim was to create a codec capable of encoding high-quality audio at low bitrates. Finding a method of compression that didn’t compromise audio quality was key. In an era where hard drives were measured in tens or hundreds of megabytes, storing uncompressed digital audio at CD quality — around 10MB per minute — wasn’t practical.\n In the 1980s, researchers around the world were working on various encoding methods to solve this problem. Things began to pick up steam when, in 1988, the Moving Picture Experts Group called out for an audio encoding standard. The next year, 14 proposals were submitted. Four working groups were created, which began to work further on a variety of encoding methods.\n  One of the main techniques to come out of the process was MUSICAM, which adopted a psychoacoustic model of human hearing to aid compression. This takes advantage of the effect of  auditory masking, a perceptual limitation of human hearing where some sounds mask others from being heard at the same time. By eliminating data corresponding to these sounds that aren’t perceived anyway, it became possible to store more audio in less space without any perceived effect for the listener.\n The MUSICAM technology became the basis for much of the original MPEG 1 Audio Layers I and II. A team of researchers at the Fraunhofer Institute took the psycoacoustic coding filter bank techniques, while mixing in some ideas gleaned from the competing ASPEC proposal to MPEG. The aim was to create the Layer III codec that could deliver the same quality at 128 kbps as Layer II could at 192 kbps. The final results were published in the MPEG 1 standard in 1993.\n With the development of the Internet happening at a rapid pace, the Fraunhofer team realised their standard had the possibility of becoming a defacto standard for audio on the platform. With its small file size and high quality, it was perfect for sharing over the slow connections of the time period. In a fateful email on July 14, 1995, the team decided that their files should bear the now-famous  .MP3 extension.\n   The original business plan was to monetise the technology through sales of encoders. These would be sold at a high price to companies that wished to create software or hardware capable of encoding MP3 files. To drive acceptance of the standard, the decoders used to play the MP3 files would be cheap or free, encouraging consumer uptake.\n  While this initially seemed feasible, things quickly fell apart,  thanks to the very Internet that Fraunhofer had pinned their fortunes on. In 1997, an Australian student purchased MP3 encoding software with a stolen credit card, before quickly sharing it on an FTP server online. Suddenly it was readily possible for anyone to create their own MP3 files. With the files out in the wild, calls to stop the spread of the software fell on deaf ears.\n Within a short time, it was readily possible to download free programs to rip audio from CDs and store it in nearly the same quality at a tenth of the size as an MP3. Websites quickly sprung up, allowing users to freely download the music of their choice. While FTP servers were the defacto file sharing standard of the day, 1999 then saw the launch of Napster, a platform that allowed users with minimal technical knowledge to directly share their digital music collections with others. The music industry had just been changed forever.\n   Suddenly the idea of  paying $16.98 for a CD seemed ludicrous, when it was readily possible to get the same music for free online. Record labels and artists scrambled to file lawsuits and sue music fans huge sums to discourage downloading.  Despite some high profile legal fights, attitudes towards music had already been irrevocably altered. MP3 players had also hit the market, allowing users to carry huge numbers of songs around without having to juggle fragile CDs.  These were similarly met with legal challenges, but the juggernaut that was MP3 could not be overcome.\n Even in the wake of Napster’s bankruptcy, other services bloomed in the vacuum left by its closure. Pirates learned from the case, and decentralization became key to avoiding legal troubles. This put the onus of criminality on those sharing the files, rather than those running a peer-to-peer service which merely facilitated file transfers.\n  Services to sell digital audio would take many more years to flourish. Initial offerings lost out due to high prices and restrictive DRM that simply gave customers a worse experience than a clean, unencumbered MP3 available for free.\n MP3s dominance only began to wane in the 2010s, when a transition to streaming technology and smartphones began to offer a better user experience. Rather than having to manage a multi-gigabyte collection of songs, and shuffle them from device to device, instead users could simply call up virtually any music they wanted at the click of a button. In the same way Facebook defeated Myspace, the ease of streaming quickly relegated MP3 players and the format itself to the past.\n  While few of us still trawl file sharing networks looking for the latest albums, the MP3 was key in forever altering how people expected music to be delivered, and the price people were willing to pay for it.\n The pay structure for artists and labels changed monumentally throughout this turbulent time. While post-MP3 services like iTunes once sold tracks at 99 cents a song,  artists now receive fractions of a cent per stream. However, the lower importance of physical media has also, at least in theory, made it possible for artists to break out without needing a record label to shift product internationally. Genres like  Soundcloud rap and  Vaporwave sprung up organically from services that allowed budding musicians to share their music online. It’s easy to draw a direct link between such subcultures and the dawn of music sharing online spawned by MP3.\n While Fraunhofer may not have gotten the business win they desired from the technology, the MP3 undoubtedly changed the face of music forever. Artists likely still weep at the diminishing returns from stingy streaming services versus album royalties of years past, and record labels will still grate at unlicenced copying as they have since the cassette era. However, MP3 remains a technology that democratized the access to and creation of music, and for that, it should be lauded. Happy birthday MP3, and here’s to another 25 years of quality compressed music!", "posttime": "2020-07-28 00:15:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "mp3", "title": "MP3满25岁", "title_en": "MP3 Turns 25", "transed": 1, "url": "https://hackaday.com/2020/07/27/mp3-is-25-years-old/", "via": "", "real_tags": ["mp3"]}, {"category": "", "categoryclass": "", "imagename": "d62b6e5b19e88f5bef8149dd239d1f60.jpeg", "infoid": 1014438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家电子商务情报公司直接与零售商和市场合作，并提供行业分析，调查了沃尔玛市场在Shopify交易后的加速增长。调查发现，在6月15日宣布合作后的前六周内，沃尔玛的Marketplace增加了5000多家新卖家。\n相比之下，沃尔玛的Marketplace在2020年1月只增加了1296家卖家。这一数字在4月份增长到2290人，然后到6月份达到3296人。包括7月份的估计在内，到本月底，2020年市场将超过1.5万家新卖家。到目前为止，市场已经超过了5万家卖家-从2019年6月开始规模翻了一番。\n该公司指出，沃尔玛的市场增长比亚马逊慢得多。但这在一定程度上是因为它围绕增加卖家的过程。它的市场要求卖家通过审批程序，这是它试图避免假冒和其他问题的做法。与此同时，亚马逊每天都会增加数千家卖家。\n当然，并不是所有最近的增长都可以归功于Shopify。这场大流行促使大量顾客在网上购物，卖家正在赶到满足这一需求。但Marketplace Pulse认为，沃尔玛已经超过了年底前新增1,200家Shopify卖家的目标。\n这些新增加的Shopify商店与网站上的其他卖家没有区别，所以没有自动统计数量的方法。但该公司表示，手动检查了数十家新增加的商品，以确认它们的Shopify从属关系，并认为市场加速增长与新的电子商务交易密切相关。\n当然，卖家增长并不是判断市场成功的唯一标准。报告指出，尽管增加了所有新产品，沃尔玛的目录规模实际上还是减少了。该公司表示，自2020年初以来，产品总数减少了近1500万种，从约5000万种减少到3600万种。不过，这与少数几家大型卖家将他们的产品目录退市有关，这些产品主要是家居和图书类别的产品。沃尔玛对这一数字提出异议，称其仍有7500万人，而不是3500万人，这与去年同期相比是稳定的。\n报告还补充说，最重要的不是卖家的规模或数量，而是卖家的表现。在这方面，该公司最近发现，沃尔玛的市场虽然规模较小，但在大流行期间沃尔玛网站购物者大幅增加的推动下，表现优于亚马逊和eBay。流量的增加也得益于沃尔玛将其杂货应用程序合并到其主要应用程序中，这一过渡仍在进行中。合并开始大约一个月后，沃尔玛应用程序在5月13日成为iPhone上排名第一的购物应用程序。", "note_en": "The e-commerce intelligence firm, which works directly with retailers and marketplaces and produces industry analysis, looked into Walmart Marketplace’s accelerated growth following the Shopify deal. It found that within the first six weeks after the June 15th partnership announcement, Walmart’s Marketplace added over 5,000 new sellers.\n In comparison, Walmart’s Marketplace added only 1,296 new sellers in January 2020. That figure grew to 2,290 in April, then 3,296 by June. With July’s estimates included, the marketplace will have topped 15,000 new sellers in 2020 by this month’s end. To date, the marketplace has surpassed 50,000 sellers — which is double in size from June 2019.\n  Walmart’s marketplace growth is much slower than Amazon’s, the firm notes. But this is, in part, due to its process around adding sellers. Its marketplace requires sellers go through an approval process, which is something it does in an attempt to avoid counterfeiters and other issues. Amazon, meanwhile,  adds thousands of sellers daily.\n Of course, not all this recent growth can be attributable to Shopify. The pandemic has sent a surge of customers to shop online and sellers are arriving to meet that demand. But Marketplace Pulse believes Walmart has already surpassed its goal of 1,200 new Shopify sellers by year-end.\n These newly added Shopify stores aren’t distinguished from other sellers on the website, so there’s not an automated way to count their numbers. But the firm says manually checked dozens of new additions to confirm their Shopify affiliation and believes the accelerated marketplace growth is closely tied to the new e-commerce deal.\n Of course, seller growth is not the only metric used to judge a marketplace’s success. Walmart’s catalog size has actually decreased despite all the new additions, the report noted. Since the start of 2020, the total number of products has  shrunk by nearly 15 million, from around 50 million down to 36 million, the firm said. This was related to a few large sellers delisting their catalogs of mostly products in the Home and Books categories, though. Walmart disputes this figure, saying it still has 75 million, not ~35 million, which is stable year-over-year.\n The report also added that what matters most is not the size or the number of sellers, but rather the sellers’ performance. On that front, the firm recently found that Walmart’s marketplace, though smaller, was  outperforming both Amazon and eBay, driven by the significant increase in Walmart.com shoppers during the pandemic. That increased traffic was also aided by  Walmart’s merging of its Grocery app into its main app, a transition that is still underway. Around a month after the merge began, the Walmart app on May 13th became the number one shopping app on iPhone.", "posttime": "2020-07-28 00:07:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "月份,sellers,卖家", "title": "沃尔玛市场(Walmart Marketplace)表示，6月份增加了3000家卖家，高于4月份的2290家；沃尔玛在6月中旬宣布与Shopify合作，让中小企业卖家加入", "title_en": "Walmart Marketplace says it added 3,000 sellers in June, up from 2,290 in April; Walmart announced a partnership with Shopify to onboard SMB sellers in mid-June", "transed": 1, "url": "https://techcrunch.com/2020/07/27/walmart-marketplace-seller-additions-surge-following-shopify-deal-up-3x-from-january/", "via": "", "real_tags": ["月份", "sellers", "卖家"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "管理4个人要比管理1个人容易。造成这种情况的主要原因是经理和单一报告之间固有的过度依赖关系。让我们潜入更深的地方。\n对于第一次担任经理的人来说，只得到一个直接下属的情况并不少见。试试看。看看进展如何。下面是最终的结果：\n这位新经理过分依赖于确保他们的单一报告喜欢他们，并且做得很好。如果他们反馈说他们的经理很差劲，那么你的报告就是100%不好的反馈。如果报告做得不好，那就是100%的报告不成功。*如果报告退出，您就失去了整个团队。\n经理过度依赖直接下属的成功和快乐导致了规避风险的行为，比如不给出批判性的反馈或过度补偿。它还经常导致微观管理。\n单个报告是孤立的。他们在团队中找不到任何可以求助的同龄人。如果他们的经理不好，他们就没有任何确凿的声音。任何出错的事情都是一场他们说我说的辩论。团队内部的任何争论都是与你的经理的对峙。\n这段关系中的任何人都没有能力了解上下文。有了更多的报告，经理在他们错了的时候会得到更清晰的信号。一份报告可以指望队友来证实或劝阻他们的想法。在一份报告中，分歧几乎没有额外的证据，所以人们要么带着极度缺乏自我的态度来处理这种情况，要么就认为这是另一个人的错。猜猜哪个选项出现得最多。\n为了进一步解决问题，单一的报告往往是非常初级的员工。这使问题变得更加复杂。刚从大学毕业的人并不了解什么是行业，什么是经理，什么是一份看不到学期末的工作。而且，预计招聘人员在成长初期不会有那么大的自主权。有了这些变量，对管理者的要求就高于平均水平。\n这些关系变得糟糕并不少见。经理一如既往地犯错误。这份报告一如既往地犯了错误。手指是指向的。时局严峻。如果你曾经听到有人称他们的经理为“第一次的经理”，你就知道这段关系已经到了地狱的特殊程度。\n避免让首次管理人员的团队由1名个人贡献者组成的团队持续很长时间。团队规模是反模式的，原因不仅仅是这一点。\n尝试并确保拥有1名个人贡献者的团队的经理也是该领域的专家。有时经理在设计上显然不是领域专家，但是当您有一份报告时，缺乏领域专业知识是犯错误的必经之路之一，也是让您的报告得出您不好的想法的必经之路。\n不惜一切代价避免以下组合：新经理，1个报告，报告是新入行的，经理不是主题专家。\n*注：经理们应该对他们的报告的成功非常投入。但当经理过度投资时，会导致各种令人不快的事情，上面提到了一些事情。另一个例子是，当一份报告做得足够好，但因为经理过度依赖他们的表现，他们试图将报告推向超出他们能够或想要做的事情。", "note_en": "It’s easier to manage 4 people than it is to manage one person. The primary reason for this is the inherent over-reliance in the relationship between a manager and a single report. Let’s dive deeper.\n It’s not uncommon for a first-time manager to get a single direct report. Try it out. See how it goes. Here’s what this ends up looking like:\n The new manager is over-reliant on making sure their single report likes them and is doing well. If they give feedback that their manager stinks, that’s 100% bad feedback from your reports. If the report doesn’t do well, that’s 100% of your reports that aren’t succeeding.* If the report quits, you just lost your whole team.\n  The manager’s over-reliance on the direct report’s success and happiness leads to risk-averse behavior, like not giving critical feedback or overcompensating. It also regularly leads to micromanagement.\n  The single report is isolated. They don’t have any peers on the team to reach out to for help. If their manager is bad, they don’t have any corroborating voices. Anything that goes wrong is a they-said I-said debate. Any debate inside of the team is a faceoff with your manager.\n  No one in this relationship has the ability to get context. With more reports, a manager gets clearer signals when they’re wrong. A report could look to teammates to corroborate or dissuade their ideas. With one report, disagreements have little additional evidence, so people have to either approach the situation with a supreme lack of ego, or they can just assume it’s the other person’s fault. Guess which option happens most.\n To further the problematic conditions, the single report will often be a very junior hire. This compounds the issue. Straight-from-college hires don’t have great context for what it means to be in industry, to have a manager, to work a job with no end-of-semester in sight. And hires aren’t expected to have as much autonomy in their formative early years. With these variables, the requirements on the manager are higher than average.\n It’s not uncommon for these relationships to turn sour. The manager makes mistakes as they always do. The report makes mistakes as they always do. Fingers are pointed. Times are dire. If you ever hear someone call their manager a “first-time manager”, you know the relationship has reached a special level of hell.\n  Avoid having first time managers have a team of 1 individual contributor for a prolonged amount of time. That team size is an  anti-pattern for more reasons than just this one.\n  Try and make sure the manager of a team with 1 individual contributor is also an expert in the domain area. Sometimes managers are explicitly not the domain expert by design, but when you have 1 report, a lack of domain expertise is one of the sure-fire ways to make mistakes and a sure-fire way for your report to get the idea that you’re no good.\n  Avoid at all costs the combination of: new manager, 1 report, report is new-to-industry, manager is not a subject-matter expert.\n * Note: mangers should be very invested in their report’s success. But when the manager is  over-invested it leads to all sorts of unsavory things, some of which are called out above. Another example is when a report is doing well-enough, but because the manager is  over-reliant on their performance, they try to push the report beyond what they can or want to do.", "posttime": "2020-07-28 00:07:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "管理,manage,经理", "title": "管理4个人要比管理1个人容易", "title_en": "It’s Easier to Manage 4 People Than It Is to Manage 1 Person", "transed": 1, "url": "https://staysaasy.com/management/2020/07/24/Managing-One-Person.html", "via": "", "real_tags": ["管理", "manage", "经理"]}, {"category": "", "categoryclass": "", "imagename": "11c9262b15ec460fd3a73b8aff6480da.png", "infoid": 1014436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此块似乎没有许可证。请联系作者以请求许可。", "note_en": "This block appears to have  no license. Please contact  the author to request a license.", "posttime": "2020-07-28 00:07:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地图投影,comparison,联系", "title": "地图投影的交互比较", "title_en": "Interactive Comparison of Map Projections", "transed": 1, "url": "https://bl.ocks.org/syntagmatic/ba569633d51ebec6ec6e", "via": "", "real_tags": ["地图投影", "联系"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014435, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2020年7月26日发布的背景信息接近2019年底时，我偶然发现了程序世代研究人员阿纳斯塔西娅·奥帕拉(Anastasia Opara)的这篇演讲。在演讲中，她提出了一种新颖的算法，例如基于纹理合成的算法。基于示例的纹理合成的目标是选取一个或多个示例纹理，并合成一个新的视觉上相似的输出纹理。\n我真的对这个算法很好奇，想看看我能不能让它运行得更快，作为分析的练习。\n踏上旅程，而我不打算详细介绍算法是如何工作的(如果你很好奇，请看阿纳斯塔西娅的演讲！)。理解基本思想是有帮助的。\n我们从一个空的输出图像开始，并用示例图像中的几个随机像素作为种子。然后重复以下步骤，直到输出图像填满为止：1.在输出图像中选择一个空像素。我们称它为中心像素。2.找到输出图像中离中心最近的k个非空像素。注意：在前几个步骤中，整个输出图像中的像素可能少于k个。这k个像素相对于中心像素的位置定义了邻域。3.列出示例图像中最有希望的社区列表4.将示例图像中最有希望的候选社区与中心像素周围的社区进行比较，选择最相似的。5.用最佳匹配邻域中中心像素的颜色填充输出图像中的中心像素。\n最后一个重要细节是，该算法并行填充多个空像素，以充分利用多核CPU的优势。\n失误和微观优化现在是优化的时候了。我做的第一件事是用Xcode Instruments Profiler对几个样本输入运行程序(部分原因是它对我来说是新的)。我甚至找到了一个很酷的图书馆，它让使用锈迹斑斑的仪器变得更容易。使用仪器，我能够看到每条指令对整个程序运行时间的贡献。\n能够看到每个指令的时间对我来说是完美的，因为我正在寻找微优化。我在这里使用“微优化”这个词是指一个非常小的变化，与它的规模相比，它的影响相对较大。尽管它们并不总是一个好主意，但微优化似乎是最好的起点，因为它们对我来说不是什么投资。我也不知道项目维护人员是否会对大型代码更改感到兴奋。\n看着分析器的输出，我被画到了这一行，它看起来像是嵌套在我们的每像素一次循环中的不必要的数组大小调整操作。\n关于解释上面的数字，一个重要的注意事项是，该算法分几次运行，并在多个线程之间进行划分。上图仅显示了一个过程，约占整个程序运行时间的12.6%。但是，每个遍都包含突出显示的指令，并且行为相似。为了粗略估计这一指令的真正影响，这些百分比应该乘以大约8的系数(100/12.6)。因此，突出显示的指令实际上约占整个程序运行时间的9.5%。\n在我删除了不必要的数组大小调整指令之后，我再次通过分析器运行程序，似乎确认它快了大约10%，我认为这对于第一次尝试来说已经相当不错了。当然，分析器增加了程序的一些开销，因此为了真正确认我的优化起作用了，我需要在没有任何分析的情况下在几个示例上运行它。当我这样做的时候，我震惊地发现没有任何改善。\n那到底是怎么回事？事实证明，我正在运行的Cargo-Instruments命令在缺省情况下以调试模式编译该程序，这关闭了显着的优化。当我在发布模式下构建程序时，不必要的数组大小调整会自动删除。我从中学到了两个非常重要的教训：首先，当你进行基准测试时，你必须仔细考虑你到底要做什么基准测试。其次，编译器非常智能，可以为您进行一些微优化。\n我抓取了更多的配置文件，确保这次使用的是发布模式。在仔细研究了一些之后，我发现将源图像中的像素加载到中间缓冲区中花费了大量时间，这些缓冲区稍后用于算法的邻域比较步骤。\n同样，使用与上一个性能分析部分相同的运行时调整，此函数似乎占用了总运行时的37.6%。我怀疑缓存未命中在这里是一个重要的原因，但是不管实际的问题来源是什么，我知道读取每个候选对象的邻域像素是很昂贵的。\n当然，算法仍然需要做候选邻域比较，所以我不能完全消除读取每个候选邻域像素。对我来说幸运的是，项目中已经有了相关的优化，\n该相关优化针对寻找最佳候选邻域时的实际比较步骤。在比较步骤中，通过汇总每个候选邻域的像素与目标邻域像素之间的差异(始终为正)，为每个候选邻域分配一个分数。事实证明，如果你已经知道到目前为止这位候选人的分数将高于最好的候选人的分数，那么你通常可以提前停止总结这些不同之处。\n一旦我理解了这一点，我就扩展了这个想法，通过删除中间缓冲区并仅在需要时读取像素来避免读取不必要的比较所需的像素，这似乎极大地减少了平均读取次数。我使用存储库中的参考图像作为输入，在几台具有几种输出大小的不同笔记本电脑上测试了我的优化。根据输出纹理大小、参考图像和我使用的计算机，我的性能似乎提高了大约15-25%。\n量化性能影响比我想象的要难得多。程序有太多不同的参数可能会影响性能：参考图像的大小、输出图像的大小、线程的数量。硬件差异也是一个巨大的因素。如果我真的很严格，我会试着把一大堆图像和输出大小放在一起作为基准。由于时间和预算的限制，我没有组装一个非常严格的基准测试，但是我对性能测试问题的理解有了极大的提高。\n一旦我确信我的微优化起作用了，我就提出了我的第一个拉请求。它被接受了，但令我惊讶的是，评论家们看到的性能收益远没有我看到的那么好。当他们中的一个在AMD线程裂解器(具有64个虚拟内核)上进行基准测试时，速度提升得如此之小，以至于可能只是噪音。\n在这一点上，我决定使用我随处可见的一些Google Cloud免费试用积分来启动一些更大的机器进行测试。在使用64核的机器时，我注意到，就像在线程开膛手上一样，我的微优化并没有带来太多的性能提升。我使用不同的线程数量(从0到64)尝试了多个测试，发现随着线程数量的增加，优化带来的性能收益会下降。\n所以在我看来有两种解释。首先，当有多个线程时，我的优化没有节省那么多时间。其次，还有另一个延迟来源，它随着线程数量的增加而增加，它变得如此之大，以至于淹没了我的优化带来的任何明显影响。事实证明，第二种解释是正确的。\n延迟的另一个来源原来是线程争用。为了获得每个候选像素的k个最近邻居，该算法使用了一种称为r*树的数据结构。R*树提供了一种有效存储点以进行最近邻查找的方法。在这里，r*树的确切工作方式实际上并不特别重要。问题是整个映像中只有一棵r*树共享。为了防止出现争用情况，r*树被包装在读写锁中。这种类型的锁允许并行读取，但写入必须串行进行。当写入正在进行时，也不能进行读取。由于有大量线程，写入成为一个很大的瓶颈。查看程序运行时与内核数量的关系图也有助于说明这一效果。\n我意识到的是，在填充了几个像素之后，k个最近的邻居中的一个距离候选像素非常远的可能性可以忽略不计。所以我把图像分解成r*树的网格。基本思想是，在两个接近的单元中的写入仍然可以阻塞，但是在两个相距较远的单元中的写入现在可以并行完成。更多细节可以在我的第二个拉取请求中提供。要查看此更改带来的改进，我们可以查看下面的合成速度之前/之后的图表：\n这里需要注意的一点是，改进后的版本也不能线性扩展。在理想的世界里，也许会，但这里有几个复杂的因素在起作用。首先，该程序有一些初始化成本，并且必须连续合成前几个像素。这两个步骤不能并行化。其次，争论很复杂，可能会在很多地方突然出现。我相信我确实消除了一个很大的争论来源，但我相信还有更多的事情可以做。最后，该算法并不是令人尴尬的并行，最终必须在线程之间共享一定数量的信息。\n技巧和权衡总的来说，我对这个项目的结果相当兴奋。然而，我认为值得注意的是，在优化过程中经常会有一些权衡。我在这个项目中看到的一个常见问题是以速度换取灵活性。以前的贡献者奥斯汀·琼斯(Austin Jones)也进行了一些显著的加速。其中之一是用查找表替换一些函数求值。这导致了很大的速度提升，但代价是将输入值的范围限制在每像素8位，因为更大的数字范围将导致查找表的大小爆炸。我的树形网格优化有点类似于结构是二维的。虽然我认为它可以扩展到三维，但如果Bookk想要库生成体素模型或其他东西，它至少要做一点改变。因此，这里的教训是，在您尝试大量优化功能之前，要等到您的功能已经板上钉钉。致谢虽然我在上面说了很多关于优化和剖析的事情，但我不是专家，总是希望了解更多，所以如果您认为有些地方不正确或有任何建议，请随时联系！也非常感谢登船工作室的人，他们对我们很好。", "note_en": "Posted on  26 July 2020  Background Near the end of 2019 I stumbled across this  talk by procedural generation researcher  Anastasia Opara. In the talk she presents a novel algorithm for example based texture synthesis. The goal of example based texture synthesis is to take one or more example textures and synthesize a new visually similar output texture.\n  I was really curious about this algorithm and wanted to see if I could make it run faster as an exercise in profiling.\n Embarking on a Journey While I&#39;m not going to go into great detail about how the algorithm works (see Anastasia&#39;s talk if you&#39;re curious!) it&#39;s helpful to understand the basic idea.\n  We start with an empty output image and seed it with a few random pixels from our example images. Then repeat the following procedure until the output image is filled:    1. Choose an empty pixel in the output image. We will call this the center pixel. 2. Find the k closest non empty pixels to the center in the output image. Note in the first few steps there might be fewer than k pixels in the entire output image. The locations of these k pixels relative to the center pixel define a neighborhood. 3. Come up with a list of the most promising neighborhoods in the example image(s) 4. Compare the most promising candidate neighborhoods in the example image(s) to the neighborhood around the center pixel and pick the most similar one. 5. Fill the center pixel in the output image with the color of the center pixel in the best matching neighborhood.\n One last important detail is that the algorithm works on filling multiple empty pixels in parallel to take full advantage of multi core cpus.\n Missteps and Micro optimizations Now it was time to optimize. The first thing I did was to run the program on a few sample inputs with the xcode instruments profiler (partly because it was new to me). I even found a cool  library which made it easier to use instruments with rust. Using instruments I was able to see how much each instruction contributed to the overall runtime of the program.\n Being able to see time per instruction was perfect for me because I was looking for micro optimizations. I&#39;m using the term micro optimization here to mean a very small change which has a relatively large impact compared to its size. Even though they are not always a good idea, micro optimizations seemed like the best place to start because they would be less of an investment on my end. I also didn&#39;t know if the project maintainers would be excited about large code changes.\n Looking at the profiler output I was drawn to this line which looked like an unnecessary array resize operation nested within our once per pixel loop.\n  An important note about interpreting the numbers above is that this algorithm runs in several passes and is divided among multiple threads. The image above only shows one pass which accounts for about 12.6% of the runtime of the entire program. However each pass contains the highlighted instruction and behaves similarly. To get a rough estimate of the true impact of this instruction these percentages should be multiplied by a factor of about 8 (100/12.6). So the highlighted instruction really accounts for about 9.5% of the total program runtime.\n After I eliminated the unnecessary array resize instruction I ran the program through the profiler again which seemed to confirm that it had gotten about 10% faster which I figured was pretty good for a first try. Of course, the profiler adds some overhead to the program, so to truly confirm that my optimization worked I needed to run it on a couple of examples without any profiling. When I did this I was shocked to see no improvement.\n So what was happening? It turns out the cargo-instruments command I was running compiled the program in  debug mode by default which turned off significant optimizations. When I built the program in release mode the unnecessary array resize was automatically removed. I learned two very important lessons from this: First, of all when you benchmark you have to think carefully about what exactly you&#39;re benchmarking. Secondly, the compiler is smart and makes some micro optimizations for you.\n  I grabbed a couple more profiles making sure this time to use release mode. After poking around some more I found that a significant amount of time was being spent loading pixels from the source images into intermediate buffers which were later used for neighborhood comparisons step of the algorithm.\n  Again using the same runtime adjustment from the last profiling section this function seemed to take about 37.6% of the total runtime. I suspected cache misses were a significant contributor here, but regardless of the actual problem source I knew that reading the neighborhood pixels for each candidate was expensive.\n Of course the algorithm still needed to do the candidate neighborhood comparisons so I couldn&#39;t completely eliminate reading each candidate&#39;s neighborhood pixels. Luckily for me there was already a related optimization in the project,\n This related optimization targeted the actual comparison step when finding a best candidate neighborhood. In the comparison step each candidate neighborhood was assigned a score by summing up the differences (always positive) between it&#39;s pixels and the target&#39;s neighborhood pixels. It turned out that often you could stop summing up these differences early if you already knew this current candidate&#39;s score was going to be higher than the best candidate&#39;s score so far.\n Once I understood this I just extended the idea to avoid reading the pixels needed for the unnecessary comparisons by removing the intermediate buffers and reading pixels only as they were needed which seemed to greatly reduce the average number of reads. I tested my optimization on a few different laptops with several output sizes using references images from the repository as inputs. It seemed like I had improved performance by around 15-25% depending on the output texture size, reference images and the computer I was using.\n Quantifying performance impact was a lot harder than I thought it would be. There were so many different parameters to the program that could affect performance: size of the reference image(s), size of the output images, number of threads. Hardware differences were also a huge factor. If I were really being rigorous I would have tried to put together a large collection of images and output sizes to benchmark off of. Due to time and budget constraints I did not assemble a super rigorous benchmark but my appreciation for the problem of performance testing has grown tremendously.\n Once I was confident that my micro optimization worked I made my  first pull request. It was accepted but to my surprise the performance gains that the reviewers saw were not nearly as good as the ones I did. When one of them benchmarked it on an AMD Threadripper (with 64 virtual cores) the speed up was so small it might have just been noise.\n  At this point I decided to use some Google Cloud free trial credits I had lying around to spin up some larger machines to test on. Using a 64 core machine I noticed that just like on the thread ripper I didn&#39;t see much of a performance improvement from my micro optimization. I tried multiple tests with different numbers of threads (from 0 up to 64) and saw that as the number of threads increased the performance gain from my optimization dropped.\n So in my mind there were two explanations. First was that my optimization didn&#39;t save as much time when there were multiple threads. Second was that there was another source of latency which increased with the number of threads and that simply got so big it drowned out any noticeable effects of my optimization. It turned out this second explanation was correct.\n The additional source of latency turned out to be thread contention. To get the k nearest neighbors for each candidate pixel the algorithm was using a data structure called an r*tree. An r*tree provides a way to efficiently store points for nearest neighbor lookups. Exactly how an r*tree works is not actually super important here. The problem was that there was only one r*tree shared across the entire image. To prevent race conditions the r*tree had been wrapped in a read-write lock. This type of lock allows parallel reads but writes must happen in series. Reads also cannot occur while a write is in progress. With large numbers of threads, writing became a large bottleneck. Looking at a graph of program runtime versus number of cores also helps illustrate this effect.\n  What I realized is that after a few pixels had been filled in the chance that one of the k nearest neighbors would be super far away from the candidate pixel was negligible. So I broke the images in to a grid of r*trees. The basic idea was that writes in two close cells could still block but writes in two far away cells could now be done in parallel. More details can be dound in  my second pull request. To see the improvement from this change we can look at this graph below of synthesis speeds before / after:\n  An important note here is that the improved version does not scale linearly either. In an ideal world maybe it would but there are several complicating factors that are at play here. First of all the program has some initialization costs as well as having to synthesize the first few pixels in series. Both of these steps cannot be parallelized. Secondly contention is complicated and can crop up in many places. I believe I did eliminate a large source of contention but I&#39;m sure there is more that could be done. Finally this algorithm is not  embarrassingly parallel and will ultimately have to have some amount of informtion shared between threads.\n Tricks and Trade Offs Overall I was pretty excited by how this project turned out. However I think it&#39;s worth noting that there are often some tradeoffs which are made during optimizations. A common one that I saw in this project was trading speed for flexibility. Austin Jones, a previous contributor, had also made some significant speedups.  One of them was to replace some function evaluations with a lookup table. This resulted in a large speed up but it came at the cost of limiting the range of input values to 8 bits per pixel because larger ranges of numbers would cause the size of the lookup table to explode. My tree grid optimization was somewhat similar in the fact the structure was two dimensional. Although I think it could be extended to three dimensions, it would have to change at least a little if Embark wanted the library to generate voxel models or something. So the lesson here is to wait until your functionality is set in stone before you try to heavily optimize it.    Acknowledgements While I said many things above about optimization and profiling I am no expert and always looking to learn more so if you think something is incorrect or have any suggestions feel free to get in touch! Also a big thanks to the people at  Embark Studios who were nice enough to take the time to review my code / ideas!", "posttime": "2020-07-28 00:06:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,open,优化", "title": "优化开源纹理合成库", "title_en": "Optimizing an Open Source Texture Synthesis Library", "transed": 1, "url": "http://peterstefek.me/texture-optimization.html", "via": "", "real_tags": ["开源", "open", "优化"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们精力充沛的小本田飞度现在已经13岁了，虽然它对我们很有帮助，但我们已经开始长大了。\n我开始研究小型货车，有一家专门在网上销售的汽车销售商似乎有一个吸引人的库存。\n因此，我决定与他们一起创建一个帐户，并设置一些过滤器和警报。\n我在他们的注册页面上输入了我的电子邮件地址。输入字段立即变成红色，页面通知我我的电子邮件地址无效。\n当你使用子地址时，你需要在你的用户名和@sign：username+subaddress@domain.com之间多加一点。\n当站点向您发送电子邮件时，为了将邮件路由给您，该子地址将被忽略，但它会显示在电子邮件地址的&#34；收件人&#34；字段中。这可能非常有用。它允许您设置过滤器，以始终允许或始终拒绝包含特定子地址的邮件，有时还可用于确定站点是否有数据泄露或将您的联系信息出售给垃圾邮件发送者。\n尽管子寻址得到了包括谷歌(Google)Gmail在内的电子邮件服务提供商的广泛支持，但它继续让使用正则表达式(也称为缩写regex)执行电子邮件地址验证的网站陷入困境。\nRegex允许网站开发人员指定有效的电子邮件地址。它可以确定电子邮件地址是否包含无效字符，或者是否缺少@符号。\n问题是，有效的电子邮件地址有多种形式，许多用于验证电子邮件地址的正则表达式无法识别所有有效格式。\n在汽车销售商的表单验证的情况下，我能够检查他们的Javascript代码。电子邮件验证正则表达式中处理用户名的部分(@符号之前的部分)如下所示：\n这个正则表达式片段的关键之处在于，唯一被认为有效的字符是字母数字字符、连字符、下划线和句点。\n如果有加号，就像使用子地址时一样，它会将电子邮件地址视为无效，即使它是完全有效的-而且已经有效多年了。\n虽然令人沮丧的是，许多网站继续拒绝使用子地址的电子邮件地址，但我有一个B计划。\n取而代之的是，我使用了一个没有子地址的次要电子邮件地址，它与newlywe.Science相关，我用这个域名来宣传我的新婚实验一书。\n我在注册表中输入了那个电子邮件地址，但再次被告知它是无效的。\n我再次查看了电子邮件验证正则表达式，发现了一个更愚蠢的问题。\n以下是他们的电子邮件验证正则表达式中处理该域的部分(@符号之后的部分)：\n这段代码的相关部分在最后。它规定顶级域名(TLD)的长度必须在2到4个字母之间。\n最知名的TLD，如.com、.org、.net、.edu和.gov，通常都有三个字母。特定于国家/地区的TLD(如.uk或.de)通常有两个字母。\n但从世纪之交开始，越来越多的新TLD投入使用。例如，.Museum在2001年6月开始活跃，.Travel在2006年1月开始接受注册。\n因此，长度超过四个字母的TLD已经存在很长一段时间了。\n然而，由于此正则表达式，任何拥有与此TLD相关联的电子邮件地址的人都被锁定，不能在该汽车销售商处创建帐户。\n令人沮丧的是，各大网站继续依赖于这种劣质的电子邮件地址验证，这一次我决定把我的失望之情公之于众。\n我在网站上四处搜索联系人的电子邮件地址，但我能找到的最好的就是实时聊天功能。\n所以，在下午2点。在东部，我打开了一个实时聊天会话，并鼓励他们修复他们可怕的正则表达式。\n一位机器人应答者告诉我，不幸的是，我的消息无法处理，因为实时聊天仅在上午8点之间可用。晚上8：45。东边。", "note_en": "Our spunky little Honda Fit is now 13 years old, and although it has served us well, we have begun to outgrow it.\n  I started researching minivans, and one particular online-only auto seller seemed to have an attractive inventory.\n  So I decided to create an account with them and set up some filters and alerts.\n    I entered my email address on their sign-up page. The input field immediately turned red, and the page informed me that my email address was invalid.\n      When you use subaddressing, you tack on a little extra bit between your username and the @ sign:  username+subaddress@domain.com.\n  When the site emails you, the subaddress gets ignored for the purpose of routing the message to you, \r but it shows up in the &#34;To&#34; field of the email address. That can be tremendously useful. It allows\r you to set up filters to always allow or always deny messages that include a specific subaddress,\r and it can sometimes be used to determine whether a site has had a data breach or sold your contact\r information to spammers.\n  Although subaddressing is widely supported by email service providers, including Google&#39;s Gmail, it continues to trip up sites\r that perform email address validation using regular expressions, also known by the abbreviation regex.\n  Regex allows site developers to specify what a valid email address looks like. \r It can determine whether an email address contains invalid characters, or whether it&#39;s missing an @ sign.\n  The problem is, valid email addresses come in many forms, and many regular expressions used to validate email addresses\r are not able to recognize the full range of valid formats.\n  In the case of the auto seller&#39;s form validation, I was able to inspect their Javascript code.\r The portion of the email validation regex that deals with the username (the part before the @ sign)\r looks like this:\n    The key thing about this regex snippet is that the only characters that are considered valid are\r alphanumeric characters, hyphens, underscores, and periods.\n  If a plus sign is present, as when using subaddressing, it treats the email address as invalid, even though it is perfectly valid\r — and has been for years.\n  While it&#39;s frustrating that many sites continue to reject email addresses that use subaddressing, I have a Plan B.\n  I instead use a secondary email address without subaddressing, which is associated with  newlywed.science,\r a domain I use to promote my book  Experiments for Newlyweds.\n  I entered that email address into the sign-up form, but again I was informed that it was invalid.\n  I took another look at the email validation regex and discovered an even stupider issue.\n  Here is the portion of their email validation regex that deals with the domain (the part after the @ sign):\n    The relevant part of this snippet is at the very end. It says that the top-level domain (TLD) must be between two and four letters long.\n  The most well-known TLDs, such as .com, .org, .net, .edu, and .gov, tend to have three letters. \r Country-specific TLDs, such as .uk or .de, tend to have two letters.\n  But starting around the turn of the century, more and more new TLDs came into use. \r For instance, .museum became active in June 2001, and .travel began accepting registrations in January 2006.\n  So TLDs that exceed four letters in length have been around for quite a while.\n  Yet anyone with an email address associated with such a TLD is locked out of creating an account with this auto seller because of this regex.\n  It&#39;s frustrating that major websites continue to rely on such shoddy email address validation, and this time I decided to make my frustration known.\n  I searched around for a contact email address on the site, but the best I could find was a Live Chat feature.\n  So, at 2 p.m. Eastern, I opened a Live Chat session and encouraged them to fix their terrible regex.\n  A robo-responder informed me that unfortunately, my message could not be handled, because Live Chat is only available between 8 a.m. and 8:45 p.m. Eastern.", "posttime": "2020-07-28 00:05:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子邮件,buy", "title": "我买不到车，因为我的电子邮件地址“无效”。", "title_en": "I couldn't buy a car because my email address was 'invalid'", "transed": 1, "url": "https://shaungallagher.pressbin.com/blog/invalid-email.html?ref=hn", "via": "", "real_tags": ["电子邮件", "buy"]}, {"category": "", "categoryclass": "", "imagename": "bb362b74f789c8b898e26a55d4d03a5d.jpg", "infoid": 1014433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "生成性对抗网络(GAN)是一种神经网络，可以生成与人类生成的内容类似的材料，如图像、音乐、语音或文本。\n近几年来，GANS一直是一个活跃的研究课题。Facebook的AI研究总监Yann LeCun称对抗性训练是机器学习领域“过去10年来最有趣的想法”。下面，在实现您自己的两个生成式模型之前，您将了解GAN是如何工作的。\n免费奖励：关于Python掌握的5点想法，这是一门面向Python开发人员的免费课程，它向您展示了将Python技能提升到更高水平所需的路线图和心态。\n生成性对抗性网络是一种机器学习系统，可以学习模仿给定的数据分布。它们最早是由深度学习专家伊恩·古德费罗和他的同事在2014年发表的一篇NeurIPS论文中提出的。\nGANS由两个神经网络组成，一个被训练成生成数据，另一个被训练成区分真实数据和假数据(因此该模型具有“对抗性”性质)。尽管结构生成数据的想法并不新鲜，但当涉及到图像和视频生成时，Gans已经提供了令人印象深刻的成果，例如：\n使用CycleGAN进行样式转换，可以对图像执行大量令人信服的样式转换。\n使用StyleGan生成人脸，就像网站上演示的那样，这个人不存在。\n生成数据的结构，包括GAN，被认为是生成模型，而不是更广泛研究的判别模型。在深入了解Gans之前，您将了解这两种模型之间的差异。\n如果您研究过神经网络，那么您遇到的大多数应用程序可能都是使用区别性模型实现的。另一方面，生成性对抗性网络是称为生成性模型的另一类模型的一部分。\n判别模型是用于大多数监督分类或回归问题的模型。举个分类问题的例子，假设您想训练一个模型，将手写数字的图像从0分类到9。为此，您可以使用一个带标签的数据集，其中包含手写数字的图像及其关联的标签，这些标签指示每个图像代表哪个数字。\n在训练过程中，您将使用一种算法来调整模型的参数。目标是最小化损失函数，以便模型在给定输入的情况下学习输出的概率分布。训练阶段结束后，您可以使用该模型通过估计输入对应的最可能的数字来对新的手写数字图像进行分类，如下图所示：\n您可以将分类问题的区别性模型描述为块，这些块使用训练数据来学习类之间的边界。然后，他们使用这些边界来区分输入并预测其类别。在数学术语中，判别模型学习给定输入x的输出y的条件概率P(y|x)。\n除神经网络外，其他结构也可用作判别模型，如Logistic回归模型和支持向量机(SVMs)。\n然而，像Gans这样的生成性模型被训练成根据概率模型来描述数据集是如何生成的。通过从生成模型中采样，您能够生成新数据。虽然判别模型用于监督学习，但生成模型通常用于未标记的数据集，可以被视为一种非监督学习形式。\n使用手写数字的数据集，您可以训练生成模型来生成新的数字。在训练阶段，使用某种算法来调整模型的参数，使损失函数最小化，并学习训练集的概率分布。然后，通过训练模型，您可以生成新的样本，如下图所示：\n为了输出新的样本，生成模型通常考虑影响模型生成的样本的随机因素。用于驱动发生器的随机样本是从潜在空间中获得的，在该潜在空间中，向量表示所生成样本的一种压缩形式。\n与判别性模型不同，生成模型学习输入数据x的概率P(X)，并且通过获得输入数据的分布，它们能够生成新的数据实例。\n注意：生成性模型也可以与带标签的数据集一起使用。当它们是这样的时候，它们被训练来学习给定输出y的输入x的概率P(x|y)。它们也可以用于分类任务，但一般来说，判别模型在分类时表现得更好。\n您可以在关于区分量词与生成量词的文章：Logistic回归和朴素贝叶斯的比较中找到有关区别量词和生成量词的相对优势和劣势的更多信息。\n尽管Gans在最近几年受到了很多关注，但它们并不是唯一可以用作生成性模型的建筑。除了Gans之外，还有各种其他生成性模型体系结构，例如：\n然而，由于在图像和视频生成方面取得的令人兴奋的结果，甘斯最近吸引了最多的公众兴趣。\n现在您已经了解了生成式模型的基础知识，您将了解GAN是如何工作的，以及如何训练它们。\n生成性对抗性网络是由两个神经网络组成的整体结构，一个称为生成器，另一个称为鉴别器。\n生成器的作用是估计真实样本的概率分布，以便提供与真实数据相似的生成样本。鉴别器又被训练来估计给定样本来自真实数据而不是由生成器提供的概率。\n这些结构被称为生成性对抗网络，因为生成器和鉴别器被训练成相互竞争：生成器试图更好地欺骗鉴别器，而鉴别器试图更好地识别生成的样本。\n要了解GAN训练的工作原理，请考虑一个玩具示例，其中的数据集由二维样本(x₁，x₂)组成，其中x₁在0到2π之间，x₂=Sin(x₁)，如下图所示：\n如您所见，此数据集由位于正弦曲线上的点(x₁，x₂)组成，具有非常特殊的分布。用于生成与数据集样本相似的对(x̃₁，x̃₂)的GaN的整体结构如下图所示：\n生成器G被馈送来自潜在空间的随机数据，其作用是生成与真实样本相似的数据。在本例中，您有一个二维潜在空间，因此生成器由随机的(z₁，z₂)对馈送，并且需要对其进行变换，使其与实际样本相似。\n神经网络G的结构可以是任意的，允许您将神经网络用作多层感知器(MLP)、卷积神经网络(CNN)或任何其他结构，只要输入和输出的维度与潜在空间的维度和真实数据的维度相匹配。\n向鉴别器D馈送来自训练数据集的真实样本或由G提供的生成样本。它的作用是估计输入属于真实数据集的概率。执行训练，以便D在馈送真实样本时输出1，在馈送生成样本时输出0。\n与G一样，您可以为D选择任意的神经网络结构，只要它尊重必要的输入和输出维度。在本例中，输入是二维的。对于二进制鉴别器，输出可以是从0到1的标量。\nGAN训练过程由两人极小极大博弈组成，其中D用于最小化真实样本和生成样本之间的区分误差，G用于最大化D出错的概率。\n虽然包含真实数据的数据集没有标记，但D和G的训练过程是以有监督的方式执行的。在训练的每一步，D和G的参数都会更新。实际上，在最初的GAN方案中，D的参数更新k次，而G的参数每训练一步只更新一次。但是，为了使训练更简单，您可以认为k等于1。\n为了训练D，在每次迭代中，您将从训练数据中提取的一些实际样本标记为1，将G提供的一些生成样本标记为0。这样，您可以使用常规的监督训练框架来更新D的参数，以便最小化损失函数，如以下方案所示：\n对于包含带标签的实数样本和生成的样本的每批训练数据，您可以更新D的参数以最小化损失函数。在更新D的参数之后，您可以训练G以生成更好的生成样本。G的输出连接到D，D的参数保持冻结，如下图所示：\n您可以将由G和D组成的系统想象为单个分类系统，该系统接收随机样本作为输入并输出分类，在这种情况下，分类可以解释为概率。\n当G做得足够好来愚弄D时，输出概率应该接近于1。在这里，您也可以使用传统的监督训练框架：用于训练由G和D组成的分类系统的数据集将由随机输入样本提供，并且与每个输入样本相关联的标签将为1。\n在训练过程中，随着D和G参数的更新，预计G给出的生成样本将更接近真实数据，D将更难区分真实数据和生成数据。\n现在您已经了解了GAN的工作方式，可以使用PyTorch实现您自己的GAN了。\n作为生成性对抗性网络的第一次实验，您将实现上一节中描述的示例。\n要运行该示例，您将使用PyTorch库，您可以使用Anaconda Python发行版以及Conda包和环境管理系统安装该库。要了解更多关于蟒蛇和Conda的信息，请查看有关在Windows上为机器学习设置Python的教程。\n激活CONDA环境后，提示符将显示其名称GAN。然后，您可以在环境中安装必要的软件包：\n由于PyTorch是一个非常活跃的开发框架，因此API可能会在新版本中发生变化。为了确保示例代码能够运行，您需要安装特定的版本1.4.0。\n除了PyTorch之外，您还将使用Matplotlib处理绘图，并使用Jupyter Notebook在交互式环境中运行代码。这样做不是强制性的，但它促进了机器学习项目的工作。\n有关使用Matplotlib和Jupyter笔记本的更新，请参阅Python Ploting with Matplotlib(Guide)和Jupyter Notebook：an Introduction。\n在打开Jupyter Notebook之前，您需要注册Conda gan环境，以便可以使用它作为内核创建笔记本。为此，在激活GAN环境的情况下，运行以下命令：\n现在您可以通过运行Jupyter Notebook打开Jupyter Notebook。通过单击新建，然后选择GAN来创建新笔记本。\n在这里，您将使用TORCH导入PyTorch库。导入nn也只是为了能够以一种不太冗长的方式设置神经网络。然后导入数学以获得pi常量的值，并像往常一样将Matplotlib绘图工具作为PLT导入。\n设置随机生成器种子是一种很好的做法，这样实验就可以在任何机器上完全相同地复制。要在PyTorch中执行此操作，请运行以下代码：\n数字111表示用于初始化随机数生成器的随机种子，该随机种子用于初始化神经网络的权重。尽管实验的性质是随机的，但只要使用相同的种子，它就必须提供相同的结果。\n训练数据由对(x₁，x₂)组成，使得x₂由x₁对于x₁在0到2π的区间内的正弦值组成。您可以按如下方式实现：\n1 TRAIN_DATA_LENGTH=1024 2 TRAIN_DATA=手电筒。零((TRAIN_DATA_LENGTH，2))3 TRAIN_DATA[：，0]=2*数学。PI*火炬。RAND(TRAIN_DATA_LENGTH)4 TRAIN_DATA[：，1]=手电筒。SIN(TRAIN_DATA[：，0])5 TRAIN_LABEGS=手电筒。零(TRAIN_DATA_LENGTH)6 TRAIN_SET=[7(TRAIN_DATA[i]，TRAIN_LABESTS[i])，i在范围内(TRAIN_DATA_LENGTH)8]。\n在这里，您将使用1024对(x₁，x₂)组成一个训练集。在第2行中，您初始化了Train_Data，这是一个维度为1024行和2列的张量，全部包含零。张量是类似于NumPy数组的多维数组。\n在第3行中，使用第一列TRAIND_DATA存储0到2π间隔内的随机值。然后，在第4行中，将张量的第二列计算为第一列的正弦。\n接下来，您将需要一个标签张量，这是PyTorch的数据加载器所需的。由于Gans使用无监督学习技术，标签可以是任何东西。毕竟，它们不会被使用。\n在第5行中，您创建了Train_Labels，这是一个用零填充的张量。最后，在第6行到第8行，您将Train_Set创建为一个元组列表，每个元组中的每一行Train_Data和Train_Labels都按照PyTorch的数据加载器的预期表示。\n您可以通过绘制每个点(x₁，x₂)来检查培训数据：\n在这里，您将创建一个名为trainloader的数据加载器，它将混洗TrainSet中的数据，并返回一批32个样本，您将使用这些样本训练神经网络。\n在设置训练数据之后，您需要为构成GaN的鉴别器和生成器创建神经网络。在下一节中，您将实现鉴别器。\n在PyTorch中，神经网络模型由继承自nn.Module的类表示，因此您必须定义一个类来创建鉴别器。有关定义类的更多信息，请看一下Python3中的面向对象编程(OOP)。\n该鉴别器是具有二维输入和一维输出的模型。它将从真实数据或生成器接收样本，并将提供样本属于真实训练数据的概率。下面的代码显示了如何创建鉴别器：\n1级鉴别器(nn.。模块)：2 def__init__(Self)：3 Super()。__init__()4自身。型号=nn。顺序(5 nn.。线性(2,256)，6nn.。Relu()，7nn.。辍学(0.3)，8 nn。线性(256,128)，9 nn。Relu()，10nn。辍学(0.3)，11 nn。线性(128，64)，12nn.。Reu()，13 nn.。辍学(0.3)，14 nn。线性(64，1)，15nn.。Sigmoid()，16)17 18 def ward(self，x)：19 output=self。型号(X)20返回输出。\n您可以使用.__init__()来构建模型。首先，您需要调用Super().__init__()来从nn.Module运行.__init__()。您正在使用的鉴别器是使用nn.Sequential()以顺序方式定义的MLP神经网络。它具有以下特点：\n第5行和第6行：输入是二维的，第一个隐含层由256个具有RELU激活的神经元组成。\n第8、9、11和12行：第二和第三隐藏层分别由128个和64个神经元组成，具有RELU激活。\n第14行和第15行：输出由单个神经元组成，该神经元具有S形激活以表示概率。\n第7、10和13行：在第一个、第二个和第三个隐藏层之后，使用退出以避免过度拟合。\n最后，使用.ward()描述如何计算模型的输出。这里，x表示模型的输入，即二维张量。在此实现中，输出是通过将输入x提供给您定义的模型而获得的，而无需任何其他处理。\n鉴别器代表您已经定义并准备好训练的神经网络的一个实例。但是，在实施训练循环之前，您的GAN还需要一个发电机。您将在下一节中实现一个。\n在生成性对抗性网络中，生成器是从潜在空间中获取样本作为其输入，并生成与训练集中的数据相似的数据的模型。在本例中，它是一个具有二维输入的模型，它将接收随机点(z₁，z₂)，而二维输出必须提供与训练数据中的点相似的(x̃₁，x̃₂)点。\n该实现类似于您对鉴别器所做的操作。首先，您必须创建一个继承自nn.Module的Generator类，定义神经网络体系结构，然后需要实例化一个Generator对象：\n1类生成器(nn。模块)：2 def__init__(Self)：3 Super()。__init__()4自身。型号=nn。顺序(5 nn.。线性(2，16)，6nn.。Relu()，7nn.。线性(16，32)，8nn.。Relu()，9 nn.。线性(32，2)，10)11 12向前定义(SELF，x)：13 OUTPUT=SELF。型号(X)14返回输出15 16发生器=发电机()\n这里，生成器代表生成器神经网络。它由两个隐含层组成，分别有16个和32个神经元，都有RELU激活，还有一个线性激活层，在输出端有2个神经元。这样，输出将由具有两个元素的向量组成，这两个元素可以是从负无穷大到无穷大的任何值，这将表示(x̃₁，x̃₂)。\n既然您已经定义了鉴别器和生成器的模型，您就可以执行培训了！\n在训练模型之前，您需要设置一些参数以在训练期间使用：\n第1行设置学习率(LR)，您将使用它来调整网络权重。\n第2行设置纪元数(Num_Pechs)，它定义将使用整个训练集执行多少次重复训练。\n第3行将变量Loss_Function赋给二进制交叉熵函数BCELoss()，它是您将用来训练模型的损失函数。\n二进制交叉熵函数是用于训练鉴别器的合适的损失函数，因为它考虑了二进制分类任务。它还适用于训练生成器，因为它将其输出馈送到鉴别器，鉴别器提供二进制可观测输出。\nPyTorch在torch.optim中为模型训练实现了各种权重更新规则。您将使用ADAM算法训练鉴别器和生成器模型。要使用torch.optim创建优化器，请运行以下行：\n最后，您需要实现一个训练循环，其中将训练样本提供给模型，并更新它们的权重以最小化损失函数：\n1对于范围内的纪元(Num_Epochs)：2对于n，枚举(Train_Loader)中的(REAL_SAMPLES，_)：3#用于训练鉴别器的数据4 REAL_SAMPLES_LABEL=TORCH。1((Batch_Size，1))5潜伏期空间样本=火炬。RANDN((Batch_Size，2))6 Generated_Samples=Generator(潜在空间_Samples)7 Generated_Samples_Labels=火炬。零((Batch_Size，1))8 ALL_SAMPLES=手电筒。CAT((real_Samples，Generated_Samples))9 ALL_SAMPLES_Labels=手电筒。CAT(10(Real_Samples_Labels，Generated_Samples_Labels)11)12 13#训练鉴别器14鉴别器。Zero_grad()15输出鉴别器=鉴别器(所有样本)16损耗鉴别器=损失函数(17输出鉴别器，所有样本标签)18 LO。\n.", "note_en": "Generative adversarial networks (GANs) are  neural networks that generate material, such as images, music, speech, or text, that is similar to what humans produce.\n GANs have been an active topic of research in recent years. Facebook’s AI research director Yann LeCun called adversarial training  “the most interesting idea in the last 10 years” in the field of machine learning. Below, you’ll learn how GANs work before implementing two generative models of your own.\n    Free Bonus:  5 Thoughts On Python Mastery, a free course for Python developers that shows you the roadmap and the mindset you&#39;ll need to take your Python skills to the next level.\n  Generative adversarial networks are machine learning systems that can learn to mimic a given distribution of data. They were first proposed in a 2014  NeurIPS paper by deep learning expert Ian Goodfellow and his colleagues.\n GANs consist of two neural networks, one trained to generate data and the other trained to distinguish fake data from real data (hence the “adversarial” nature of the model). Although the idea of a structure to generate data isn’t new, when it comes to image and video generation, GANs have provided impressive results such as:\n Style transfer using  CycleGAN, which can perform a number of convincing style transformations on images\n Generation of human faces with  StyleGAN, as demonstrated on the website  This Person Does Not Exist\n Structures that generate data, including GANs, are considered  generative models in contrast to the more widely studied  discriminative models. Before diving into GANs, you’ll look at the differences between these two kinds of models.\n If you’ve studied neural networks, then most of the applications you’ve come across were likely implemented using  discriminative models. Generative adversarial networks, on the other hand, are part of a different class of models known as  generative models.\n Discriminative models are those used for most  supervised  classification or  regression problems. As an example of a classification problem, suppose you’d like to train a model to classify images of handwritten digits from 0 to 9. For that, you could use a labeled dataset containing images of handwritten digits and their associated labels indicating which digit each image represents.\n During the training process, you’d use an algorithm to adjust the model’s parameters. The goal would be to minimize a  loss function so that the model learns the  probability distribution of the output given the input. After the training phase, you could use the model to classify a new handwritten digit image by estimating the most probable digit the input corresponds to, as illustrated in the figure below:\n  You can picture discriminative models for classification problems as blocks that use the training data to learn the boundaries between classes. They then use these boundaries to discriminate an input and predict its class. In mathematical terms, discriminative models learn the conditional probability  P( y| x) of the output  y given the input  x.\n Besides neural networks, other structures can be used as discriminative models such as  logistic regression models and  support vector machines (SVMs).\n Generative models like GANs, however, are trained to describe how a dataset is generated in terms of a  probabilistic model. By sampling from a generative model, you’re able to generate new data. While discriminative models are used for supervised learning, generative models are often used with unlabeled datasets and can be seen as a form of  unsupervised learning.\n Using the dataset of handwritten digits, you could train a generative model to generate new digits. During the training phase, you’d use some algorithm to adjust the model’s parameters to minimize a loss function and learn the probability distribution of the training set. Then, with the model trained, you could generate new samples, as illustrated in the following figure:\n  To output new samples, generative models usually consider a  stochastic, or random, element that influences the samples generated by the model. The random samples used to drive the generator are obtained from a  latent space in which the vectors represent a kind of compressed form of the generated samples.\n Unlike discriminative models, generative models learn the probability  P( x) of the input data  x, and by having the distribution of the input data, they’re able to generate new data instances.\n Note: Generative models can also be used with labeled datasets. When they are, they’re trained to learn the probability  P( x| y) of the input  x given the output  y. They can also be used for classification tasks, but in general, discriminative models perform better when it comes to classification.\n You can find more information on the relative strengths and weaknesses of discriminative and generative classifiers in the article  On Discriminative vs. Generative Classifiers: A comparison of logistic regression and naive Bayes.\n Although GANs have received a lot of attention in recent years, they’re not the only architecture that can be used as a generative model. Besides GANs, there are various other generative model architectures such as:\n  However, GANs have attracted the most public interest of late due to the  exciting results in image and video generation.\n Now that you know the basics of generative models, you’ll see how GANs work and how to train them.\n Generative adversarial networks consist of an overall structure composed of two neural networks, one called the  generator and the other called the  discriminator.\n The role of the generator is to estimate the probability distribution of the real samples in order to provide generated samples resembling real data. The discriminator, in turn, is trained to estimate the probability that a given sample came from the real data rather than being provided by the generator.\n These structures are called generative adversarial networks because the generator and discriminator are trained to compete with each other: the generator tries to get better at fooling the discriminator, while the discriminator tries to get better at identifying generated samples.\n To understand how GAN training works, consider a toy example with a dataset composed of two-dimensional samples ( x₁,  x₂), with  x₁ in the interval from 0 to 2π and  x₂ = sin( x₁), as illustrated in the following figure:\n  As you can see, this dataset consists of points ( x₁,  x₂) located over a sine curve, having a very particular distribution. The overall structure of a GAN to generate pairs ( x̃₁,  x̃₂) resembling the samples of the dataset is shown in the following figure:\n  The generator  G is fed with random data from a latent space, and its role is to generate data resembling the real samples. In this example, you have a two-dimensional latent space, so that the generator is fed with random ( z₁,  z₂) pairs and is required to transform them so that they resemble the real samples.\n The structure of the neural network  G can be arbitrary, allowing you to use neural networks as a  multilayer perceptron (MLP), a  convolutional neural network (CNN), or any other structure as long as the dimensions of the input and output match the dimensions of the latent space and the real data.\n The discriminator  D is fed with either real samples from the training dataset or generated samples provided by  G. Its role is to estimate the probability that the input belongs to the real dataset. The training is performed so that  D outputs 1 when it’s fed a real sample and 0 when it’s fed a generated sample.\n As with  G, you can choose an arbitrary neural network structure for  D as long as it respects the necessary input and output dimensions. In this example, the input is two-dimensional. For a binary discriminator, the output may be a  scalar ranging from 0 to 1.\n The GAN training process consists of a two-player  minimax game in which  D is adapted to minimize the discrimination error between real and generated samples, and  G is adapted to maximize the probability of  D making a mistake.\n Although the dataset containing the real data isn’t labeled, the training processes for  D and  G are performed in a supervised way. At each step in the training,  D and  G have their parameters updated. In fact, in the  original GAN proposal, the parameters of  D are updated  k times, while the parameters of  G are updated only once for each training step. However, to make the training simpler, you can consider  k equal to 1.\n To train  D, at each iteration you label some real samples taken from the training data as 1 and some generated samples provided by  G as 0. This way, you can use a conventional supervised training framework to update the parameters of  D in order to minimize a loss function, as shown in the following scheme:\n  For each batch of training data containing labeled real and generated samples, you update the parameters of  D to minimize a loss function. After the parameters of  D are updated, you train  G to produce better generated samples. The output of  G is connected to  D, whose parameters are kept frozen, as depicted here:\n  You can imagine the system composed of  G and  D as a single classification system that receives random samples as input and outputs the classification, which in this case can be interpreted as a probability.\n When  G does a good enough job to fool  D, the output probability should be close to 1. You could also use a conventional supervised training framework here: the dataset to train the classification system composed of  G and  D would be provided by random input samples, and the label associated with each input sample would be 1.\n During training, as the parameters of  D and  G are updated, it’s expected that the generated samples given by  G will more closely resemble the real data, and  D will have more trouble distinguishing between real and generated data.\n Now that you know how GANs work, you’re ready to implement your own using  PyTorch.\n As a first experiment with generative adversarial networks, you’ll implement the example described in the previous section.\n To run the example, you’re going to use the  PyTorch library, which you can install using the  Anaconda Python distribution and the  conda package and environment management system. To learn more about Anaconda and conda, check out the tutorial on  Setting Up Python for Machine Learning on Windows.\n   After you activate the conda environment, your prompt will show its name,  gan. Then you can install the necessary packages inside the environment:\n  Since PyTorch is a very actively developed framework, the API may change on new releases. To ensure the example code will run, you install the specific version  1.4.0.\n Besides PyTorch, you’re going to use  Matplotlib to work with plots and a  Jupyter Notebook to run the code in an interactive environment. Doing so isn’t mandatory, but it facilitates working on machine learning projects.\n For a refresher on working with Matplotlib and Jupyter Notebooks, take a look at  Python Plotting With Matplotlib (Guide) and  Jupyter Notebook: An Introduction.\n Before opening Jupyter Notebook, you need to register the conda  gan environment so that you can create Notebooks using it as the kernel. To do that, with the  gan environment activated, run the following command:\n  Now you can open Jupyter Notebook by running  jupyter notebook. Create a new Notebook by clicking  New and then selecting  gan.\n   Here, you import the PyTorch library with  torch. You also import  nn just to be able to set up the neural networks in a less verbose way. Then you import  math to obtain the value of the pi constant, and you import the Matplotlib plotting tools as  plt as usual.\n It’s a good practice to set up a  random generator seed so that the experiment can be replicated identically on any machine. To do that in PyTorch, run the following code:\n  The number  111 represents the  random seed used to initialize the random number generator, which is used to initialize the neural network’s  weights. Despite the random nature of the experiment, it must provide the same results as long as the same seed is used.\n   The training data is composed of pairs ( x₁,  x₂) so that  x₂ consists of the value of the sine of  x₁ for  x₁ in the interval from 0 to 2π. You can implement it as follows:\n 1  train_data_length  =  1024  2  train_data  =  torch . zeros (( train_data_length ,  2 ))  3  train_data [:,  0 ]  =  2  *  math . pi  *  torch . rand ( train_data_length )  4  train_data [:,  1 ]  =  torch . sin ( train_data [:,  0 ])  5  train_labels  =  torch . zeros ( train_data_length )  6  train_set  =  [  7   ( train_data [ i ],  train_labels [ i ])  for  i  in  range ( train_data_length )  8  ]\n Here, you compose a training set with  1024 pairs ( x₁,  x₂). In  line 2, you initialize  train_data, a tensor with dimensions of  1024 rows and  2 columns, all containing zeros. A  tensor is a multidimensional array similar to a  NumPy array.\n In  line 3, you use the first column of  train_data to store random values in the interval from  0 to  2π. Then, in  line 4, you calculate the second column of the tensor as the sine of the first column.\n Next, you’ll need a tensor of labels, which are required by PyTorch’s data loader. Since GANs make use of unsupervised learning techniques, the labels can be anything. They won’t be used, after all.\n In  line 5, you create  train_labels, a tensor filled with zeros. Finally, in  lines 6 to 8, you create  train_set as a list of tuples, with each row of  train_data and  train_labels represented in each tuple as expected by PyTorch’s data loader.\n You can examine the training data by plotting each point ( x₁,  x₂):\n      Here, you create a data loader called  train_loader, which will shuffle the data from  train_set and return batches of  32 samples that you’ll use to train the neural networks.\n After setting up the training data, you need to create the neural networks for the discriminator and generator that will compose the GAN. In the following section, you’ll implement the discriminator.\n In PyTorch, the neural network models are represented by classes that inherit from  nn.Module, so you’ll have to define a class to create the discriminator. For more information on defining classes, take a look at  Object-Oriented Programming (OOP) in Python 3.\n The discriminator is a model with a two-dimensional input and a one-dimensional output. It’ll receive a sample from the real data or from the generator and will provide the probability that the sample belongs to the real training data. The code below shows how to create a discriminator:\n 1  class  Discriminator ( nn . Module ):  2   def  __init__ ( self ):  3   super () . __init__ ()  4   self . model  =  nn . Sequential (  5   nn . Linear ( 2 ,  256 ),  6   nn . ReLU (),  7   nn . Dropout ( 0.3 ),  8   nn . Linear ( 256 ,  128 ),  9   nn . ReLU (), 10   nn . Dropout ( 0.3 ), 11   nn . Linear ( 128 ,  64 ), 12   nn . ReLU (), 13   nn . Dropout ( 0.3 ), 14   nn . Linear ( 64 ,  1 ), 15   nn . Sigmoid (), 16   ) 17  18   def  forward ( self ,  x ): 19   output  =  self . model ( x ) 20   return  output\n You use  .__init__() to build the model. First, you need to call  super().__init__() to run  .__init__() from  nn.Module. The discriminator you’re using is an MLP neural network defined in a sequential way using  nn.Sequential(). It has the following characteristics:\n Lines 5 and 6: The input is two-dimensional, and the first hidden layer is composed of  256 neurons with  ReLU activation.\n Lines 8, 9, 11, and 12: The second and third hidden layers are composed of  128 and  64 neurons, respectively, with ReLU activation.\n Lines 14 and 15: The output is composed of a single neuron with  sigmoidal activation to represent a probability.\n Lines 7, 10, and 13: After the first, second, and third hidden layers, you use  dropout to avoid  overfitting.\n Finally, you use  .forward() to describe how the output of the model is calculated. Here,  x represents the input of the model, which is a two-dimensional tensor. In this implementation, the output is obtained by feeding the input  x to the model you’ve defined without any other processing.\n   discriminator represents an instance of the neural network you’ve defined and is ready to be trained. However, before you implement the training loop, your GAN also needs a generator. You’ll implement one in the next section.\n In generative adversarial networks, the generator is the model that takes samples from a latent space as its input and generates data resembling the data in the training set. In this case, it’s a model with a two-dimensional input, which will receive random points ( z₁,  z₂), and a two-dimensional output that must provide ( x̃₁,  x̃₂) points resembling those from the training data.\n The implementation is similar to what you did for the discriminator. First, you have to create a  Generator class that inherits from  nn.Module, defining the neural network architecture, and then you need instantiate a  Generator object:\n 1  class  Generator ( nn . Module ):  2   def  __init__ ( self ):  3   super () . __init__ ()  4   self . model  =  nn . Sequential (  5   nn . Linear ( 2 ,  16 ),  6   nn . ReLU (),  7   nn . Linear ( 16 ,  32 ),  8   nn . ReLU (),  9   nn . Linear ( 32 ,  2 ), 10   ) 11  12   def  forward ( self ,  x ): 13   output  =  self . model ( x ) 14   return  output 15  16  generator  =  Generator ()\n Here,  generator represents the generator neural network. It’s composed of two hidden layers with  16 and  32 neurons, both with ReLU activation, and a linear activation layer with  2 neurons in the output. This way, the output will consist of a vector with two elements that can be any value ranging from negative infinity to infinity, which will represent ( x̃₁,  x̃₂).\n Now that you’ve defined the models for the discriminator and generator, you’re ready to perform the training!\n Before training the models, you need to set up some parameters to use during training:\n   Line 1 sets the learning rate ( lr), which you’ll use to adapt the network weights.\n Line 2 sets the number of epochs ( num_epochs), which defines how many repetitions of training using the whole training set will be performed.\n Line 3 assigns the variable  loss_function to the  binary cross-entropy function  BCELoss(), which is the loss function that you’ll use to train the models.\n The binary cross-entropy function is a suitable loss function for training the discriminator because it considers a binary classification task. It’s also suitable for training the generator since it feeds its output to the discriminator, which provides a binary observable output.\n PyTorch implements various weight update rules for model training in  torch.optim. You’ll use the  Adam algorithm to train the discriminator and generator models. To create the optimizers using  torch.optim, run the following lines:\n  Finally, you need to implement a training loop in which training samples are fed to the models, and their weights are updated to minimize the loss function:\n 1  for  epoch  in  range ( num_epochs ):  2   for  n ,  ( real_samples ,  _ )  in  enumerate ( train_loader ):  3   # Data for training the discriminator  4   real_samples_labels  =  torch . ones (( batch_size ,  1 ))  5   latent_space_samples  =  torch . randn (( batch_size ,  2 ))  6   generated_samples  =  generator ( latent_space_samples )  7   generated_samples_labels  =  torch . zeros (( batch_size ,  1 ))  8   all_samples  =  torch . cat (( real_samples ,  generated_samples ))  9   all_samples_labels  =  torch . cat ( 10   ( real_samples_labels ,  generated_samples_labels ) 11   ) 12  13   # Training the discriminator 14   discriminator . zero_grad () 15   output_discriminator  =  discriminator ( all_samples ) 16   loss_discriminator  =  loss_function ( 17   output_discriminator ,  all_samples_labels ) 18   lo\n......", "posttime": "2020-07-28 00:04:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,adversarial,模型", "title": "生成性对抗性网络：构建您的第一个模型", "title_en": "Generative Adversarial Networks: Build Your First Models", "transed": 1, "url": "https://realpython.com/generative-adversarial-networks/", "via": "", "real_tags": ["网络", "模型"]}, {"category": "", "categoryclass": "", "imagename": "8b40408f5d26a1dc5b63c2596ed66581.jpg", "infoid": 1014432, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人们难以集中注意力的最大原因是他们不明白什么是专注。\n我们大多数人认为专注就像意志力-当一件事想要去其他地方时，你努力让自己的注意力集中在一件事上。但这只是焦点的一小部分，也是迄今为止最不重要的。\n专注不是你实施的技巧，而是你通过练习和习惯培养的技能。\n高度专注的人知道，能够长时间深度专注是随着时间的推移养成的许多习惯的结果。\n如果你想变得真正富有成效，创作出伟大的作品，你需要掌握专注的艺术。要做到这一点，你需要培养正确的习惯。\n以下是高度专注的人的6个习惯，无论你做什么工作，它们都会带来更深层次的专注和出色的结果。\n在某种程度上，保持专注总是需要努力和意志力。但是，仅仅因为专注有时需要努力，并不意味着它总是需要努力。\n如果你曾经观察到某人处于深度专注的状态，他们通常不会显得沮丧或疲惫。相反，它们通常看起来“处于区域”或“处于流动状态”。这种语言是一个线索，表明真正的专注实际上更多的是轻松而不是努力。\n我们经常谈论伟大的运动员，例如，“让它看起来很容易。”他们的注意力自然而流畅，这与我们大多数人在试图伸直高尔夫球挥杆或保持困难的瑜伽姿势时所感受到的沮丧的努力有很大的不同。\n那么他们是怎么做到的呢？高度专注的人是如何让高度集中的注意力变得容易的呢？\n就我们的目的而言，例程是一组简单的行为，它们充当通向另一组更复杂的行为的桥梁。\n例如，写这样一篇文章是一项认知要求很高的活动。对我来说，简单地到达办公室，坐在办公桌前开始写作对我来说是很困难的。所以我用一个小程序让我轻松地开始写作：\n在我开始写作之前，我先泡一杯咖啡或茶，然后一边慢慢地啜饮，一边听音乐大约5分钟。一旦我喝完了酒，听完了音乐，我就打开我的写作应用程序，开始打字。\n就像你会在举重或短跑这样的主要运动之前伸展和热身一样，一个好的例行程序可以帮助你在一项主要的脑力劳动之前“热身”。其结果是，开始工作和长时间持续工作都更容易。\n如果你很难开始工作，与其努力“逼迫自己”，不如试着建立一个小的工作前程序，让你更容易投入到工作中。\n想象力是由约束释放出来的。你通过踏入枷锁来打破框框。--乔纳·莱勒(Jonah Lehrer)\n乍一看，“富有成效”和“拖延”这两个词似乎是截然相反的。毕竟，人们举出的难以集中注意力的最大原因之一就是拖延的倾向。\n但是如果拖延本身并不是真正的问题呢？如果真正的问题是人们不知道如何正确地拖延呢？\n富有成效的拖延意味着培养一系列你可以拖延的活动，从长远来看，这些活动仍然会让你变得富有成效。\n例如：虽然我的主要工作是写作，但偶尔也会拖拖拉拉。不管那天早上我为自己设定的写作目标或任务是什么，我都会说“去他妈的”，然后沉浸在另一项看起来更有趣的活动中--通常是阅读或网页设计。\n尽管我在逃避工作，但从长远来看，阅读和网页设计对我的工作都是非常有益的。例如，阅读是未来文章的一种研究形式。虽然网页设计让我的文章更容易阅读，更有趣，更容易分享--所有这些作为一个作家都是非常有益的。\n允许自己在小事上拖拉，你很少会在大事情上拖拉。\n拖延的冲动是正常的。这通常是你头脑中对新奇和刺激的完全自然的渴望。\n当你不再浪费大量的脑力与拖延的冲动作斗争，不再为此批评自己时，你会发现，在短暂的高效拖延之后，快速轻松地回到工作岗位要容易得多。\n开始的方法是停止谈论，开始做。--沃尔特·迪士尼。\n无论是你手机上的Facebook通知，还是顺道拜访你办公室聊天的同事，还是你iPad上的一款新视频游戏，没有什么比分心更能破坏我们的注意力和专注力了。\n不幸的是，大多数人都相信分心是不可避免的，保持专注的最好方法是尝试并抵制分心。\n这意味着他们认为专注是他们必须做的事情，并对其运用意志力。但这是一个失败的策略…。\n不要试图抗拒分心，一开始就像地狱一样工作以避免分心。\n高度专注的人知道，虽然有些分心是不可避免的，但如果你愿意做出一些艰难的选择，其中许多是可以避免的。\n例如，如果我需要在早上完成一些严肃的写作，我会把手机留在车里，关闭电脑上除写作应用程序之外的所有应用程序，并关闭窗户的百叶窗。\n这可能看起来有点极端，但我们管理分心的能力比我们愿意相信的要差得多，这是人类的本性。\n经常无情地编辑你的生活。毕竟这是你的杰作。--内森·W·莫里斯。\n在生命的早期，大多数人都知道激励自己的正确方式是对自己“强硬起来”。就像一个教官对他的新兵大喊大叫一样，我们被引导去相信，除非我们对自己极其严厉和严格，否则我们最终将变得软弱无力，无法实现我们的目标。\n这是基于一种错误的信念，即恐惧是一种有效的激励因素。虽然恐惧可以暂时促使你采取行动，但从长远来看，它往往会对你产生消极的激励作用，因为它会对你的自信心产生负面影响。\n更重要的是，如果你过度依赖恐惧作为动力，随着时间的推移，它甚至会失去短期的好处。\n这让大多数人在努力保持专注时陷入了危险的境地：\n他们依靠单一的策略来激励自己。就像投资你的钱一样，把所有的鸡蛋都放在一个篮子里也不是一个好主意。\n他们的单一策略实际上已经不再奏效了。特别是当你试图专注于没有外部责任的任务时(例如，坚持节食)，基于恐惧的动机是相当无效的。\n副作用是灾难性的。持续的自我批评不仅会导致焦虑、压力和自卑，而且还会扼杀你已经拥有的微不足道的动力。\n高度专注和富有成效的人明白这一点-虽然奇怪地诱人-自我批评只会破坏你保持专注和做好工作的能力。\n你已经倒下了，…。踢自己的内脏怎么会让你更容易重新站起来呢？\n与其对自己苛刻，不如在逆境或错误面前培养自我同情心：\n如果你分心了，一时注意力不集中，轻轻地提醒自己回去工作，重新集中你的注意力。\n如果你感到有开始拖延的冲动，冷静地提醒自己，想要拖延并没有什么错。每个人都会发生这种事。\n如果有一天你忘了完成某个目标或任务，承认每个人都会犯错，并给自己做个笔记，为你的工作想出一个更好的提醒系统。\n如果一位好朋友告诉你一些分心或注意力不集中的小插曲，你会怎么回应？\n最有可能的是，你不会开始批评他们软弱和缺乏纪律；相反，你会说一两句同情的话来鼓励他们，而不会对此过于小题大做。\n不是因为我很聪明，而是我和问题相处的时间更长。--阿尔伯特·爱因斯坦。\n灵感就像额外的学分：在你可以利用的时候可以利用，但永远不能依赖。\n高度专注的人的一个特点是他们与灵感有着健康的关系。\n首先，永远不要认为这是理所当然的。不要假设你需要受到鼓舞或激励去工作，而要相信无论你感觉如何，你都可以做得很好-特别是如果你养成了正确的习惯，让你很容易开始工作并保持专注(参见上面的第一节)。\n其次，当灵感真的出现时，他们会利用这一点。例如，如果你坐下来工作，发现你真的感觉受到了鼓舞，做了很棒的工作，尽你所能保持这种状态。\n不要因为你的计划时间到了就停止工作。取消会议，推迟次要任务，通常做任何不犯罪的事情来充分利用真正的灵感。\n永远不要浪费好的灵感。它可能有一段时间不会回来了。\n最后，高度专注的人知道感觉和行动之间的关系是双向的。虽然感觉受到鼓舞显然会带来高质量的专注和出色的工作，但反过来也是正确的：专注和良好的工作往往会产生动力，甚至是灵感。\n例如，假设您想要写一本小说…。如果你只是在感觉受到启发的时候才写作，那么即使在一年的时间之后，你也很可能会有很多空页。\n另一方面，如果你承诺每天写几百个字，不管你感觉如何，那么令人惊讶的是，这些写作环节实际上会包含一些好东西，一旦你在纸上看到这些东西，你就会激励你写更多的东西。\n业余爱好者坐着等待灵感，我们其余的人只是站起来去工作。--斯蒂芬·金。\n在一天结束的时候，你可以用所有最好的集中注意力的技巧、技巧、工具和技巧武装自己，但你的工作质量比什么都重要。\n如果你一直在做你不关心的事情，保持专注永远是一件困难的事。\n做正确的工作会让你几乎毫不费力地进入焦点状态。想想看，…。\n你可能不需要努力去集中精力与你最好的朋友进行一次愉快的交谈。\n如果你喜欢打篮球，你可能不需要努力在整个比赛过程中保持你的注意力。\n现在，我们不能只把时间花在打篮球或玩电子游戏上。幸运的是，做你看重的事情并不意味着只做你完全热爱的事情。\n我们工作的许多方面都蕴含着深刻的价值，如果你愿意仔细观察并澄清它们的话。\n例如，在我作为一名作家的工作中，我通常喜欢写作本身的行为，它的价值对我来说是相当清楚的，所以专注于它并不太难。然而，营销和分发我的作品是另一回事，…。例如，我没有发现将我的工作发布到社交媒体上有什么直接或明显的价值。\n但是，当我花时间澄清我对写作的价值观时，我意识到让我的想法出现在更多的人面前是我真正看重的东西。这意味着这项任务有很强的价值，我不太喜欢。我只需要花时间澄清一下，并提醒自己这一点。当我这样做的时候，它会让我更容易集中注意力并坚持下去。\n如果你花时间去辨别和澄清你工作背后的价值，专注就会自动发挥作用。\n毫无疑问，生活提供的最好奖赏就是有机会努力工作，做一件值得做的事情。--西奥多·罗斯福(Theodore Roosevelt)。\n专注是你培养的技能，而不是你实施的技巧。如果你想要提高你的专注能力，做好你最好的工作，努力培养这些习惯：", "note_en": "The biggest reason people struggle to focus is that they don’t understand what focus really is.\n Most of us think about focus like willpower—the effort you apply to keep your mind on one thing when it wants to go somewhere else. But this is only a tiny part of focus—and by far the least important.\n  Focus isn’t a technique you implement—it’s a skill you cultivate through practice and habit.\n Highly focused people know that the ability to focus deeply and for long stretches of time is the result of many habits built up over time.\n If you want to become truly productive and produce great work, you need to master the art of focus. And to do that, you need to cultivate the right habits.\n What follows are 6 habits of highly focused people that will lead to deeper focus and outstanding results no matter what kind of work you’re doing.\n    Maintaining focus will always require effort and willpower to some extent. But just because focus sometimes requires effort, doesn’t mean it always should.\n If you’ve ever observed someone in a state of deep focus, they don’t usually appear frustrated or exhausted. On the contrary, they usually look like they’re “in the zone” or “in a flow state.” This language is a clue that true focus is actually characterized by ease more than effort.\n We often talk about how great athletes, for example, “make it look easy.” They have a naturalness and smoothness to their focus that is very different than the frustrated effortfulness most of us feel when trying to straighten out our golf swing or hold a difficult yoga position.\n  So how do they do it? How do highly focused people make intense levels of concentration easy?\n  For our purposes, a routine is a simple set of behaviors that act as a bridge to another more complex set of behaviors.\n For example, writing an article like this is a cognitively demanding activity. It’s difficult for me to simply get to my office, sit down at my desk, and start writing. So I use a small routine to  ease me into my writing:\n Before I start writing, I make a cup of coffee or tea and slowly sip on it while listening to music for about 5 minutes. Once I’m done with my drink and the music is over, I open my writing app and start typing.\n Just like you would stretch and warm up before a major exercise like weight lifting or sprinting, a good routine helps you “warm up” before a major piece of mental work. And the result is that it’s both easier to start working and stay working for long stretches of time.\n If you struggle with getting started on your work, instead of trying to “push yourself” harder, try creating a small pre-work routine that makes it easier to fall into your work.\n The imagination is unleashed by constraints. You break out of the box by stepping into shackles. ― Jonah Lehrer\n   At first glance, the terms  productive and  procrastination would appear to be opposites. After all, one of the biggest reasons people cite for their difficulty focusing is  the tendency to procrastinate.\n But what if procrastination itself isn’t really the problem? What if the real problem is that people don’t know how to procrastinate the right way?\n Productive procrastination means cultivating a set of activities you can procrastinate on that will still lead you to be productive in the long run.\n For example: While my main work is writing, occasionally I procrastinate on it. I say “screw it” to whatever writing goal or task I set myself for that morning and lose myself in another activity that seems more enjoyable—often reading or web design.\n Even though I am avoiding my work, both reading and web design are highly beneficial for my work in the long run. Reading is a form of research for future articles, for example. While web design makes my articles easier to read, more enjoyable, easier to share—all of which are hugely beneficial as a writer.\n  Allow yourself to procrastinate in small ways and you’ll rarely end up procrastinating in major ways.\n The urge to procrastinate is normal. It’s often your mind’s perfectly natural desire for novelty and stimulation.\n And when you stop wasting boatloads of mental energy fighting against the urge to procrastinate and  criticizing yourself for it, you’ll find that it’s far easier to get back to work quickly and easily after a brief session of productive procrastination.\n The way to get started is to quit talking and begin doing. — Walt Disney\n    Whether it’s a Facebook notification on your phone, a colleague dropping by your office to chat, or a new video game on your iPad, nothing sabotages our focus and concentration like a distraction.\n Unfortunately, most people resign themselves to the belief that distractions are simply inevitable and that the best way to stay focused is to try and resist distractions.\n This means that they see focus as something they have to do and apply willpower to. But this is a losing strategy…\n Stop trying to resist distractions and work like hell to avoid them in the first place.\n Highly focused people know that while some distractions are inevitable, many of them are avoidable if you’re willing to make some tough choices.\n For example, if I need to get some serious writing done in the morning, I will leave my phone in my car, close out of all the apps on my computer except my writing app, and close the shade to the window.\n This may seem a bit extreme but it’s human nature that we’re far worse at managing distractions than we like to believe.\n  Edit your life frequently and ruthlessly. It’s your masterpiece after all. — Nathan W. Morris\n   Early in life, most people learn that the proper way to  motivate yourself is to “get tough” with yourself. Like a drill sergeant yelling at his new recruits, we’re led to believe that unless we’re incredibly hard and exacting with ourselves, we’ll end up soft, weak, and unable to achieve our goals.\n This is based on the incorrect belief that fear is an effective motivator. While fear can very temporarily get you to act, it tends to have a de-motivating effect in the long-term because it negatively impacts your self-confidence.\n What’s more, if you over-rely on fear as a motivator, it tends to lose even it’s short-term benefits with time.\n This leads most people into a dangerous situation when it comes to trying to stay focused:\n They’re dependent on a single strategy to motivate themselves. And just like investing your money, it’s not a good idea to put all your eggs in one basket.\n Their one strategy doesn’t actually work anymore. Especially when you’re trying to stay focused on tasks without external accountability (sticking to a diet, for example), fear-based motivation is pretty ineffective.\n The side effects are disastrous. Constant self-criticism not only leads to anxiety, stress, and low self-esteem, but it also tends to kill what little motivation you do already have.\n Highly focused and productive people understand that—while strangely tempting— self-criticism only sabotages your ability to stay focused and do your best work.\n You’ve already fallen down… How does kicking yourself in the gut make it any easier to get back up again?\n Instead of being hard on yourself, cultivate  self-compassion in the face of adversity or mistakes:\n If you get distracted and momentarily lose focus, gently remind yourself to get back to work and refocus your attention.\n If you feel the urge to start procrastinating, calmly remind yourself that there’s nothing wrong with wanting to procrastinate. It happens to everybody.\n If you forget to work on a goal or task one day, acknowledge that everybody makes mistakes and make a note to yourself to come up with a better reminder system for your work.\n  If a good friend were to tell you about some episode of getting distracted or losing focus, how would you respond to them?\n Most likely, you wouldn’t start criticizing them for being weak and undisciplined; instead, you’d offer one or two sympathetic words of encouragement and not make too big a deal over it.\n  It’s not that I’m so smart, it’s just that I stay with problems longer. — Albert Einstein\n  Inspiration is like extra credit: Good to take advantage of when you can but never to be relied upon.\n One hallmark of highly focused people is that they have a healthy relationship with inspiration.\n First, never take it for granted. Instead of assuming that you need to feel inspired or motivated to work, believe that you can do pretty good work regardless of how you feel—especially if you build the right habits that make it easy to start working and stay focused (see Section 1 above).\n  Second, when inspiration does show up, they take extreme advantage of it. For example, if you sit down to work and find that you’re really feeling inspired and doing great work, do whatever you can to stay in that flow.\n Don’t just stop working because your planned amount of time is up. Cancel meetings, delay secondary tasks, and generally do anything short of committing a crime to take full advantage of genuine inspiration.\n Never waste a good jolt of inspiration. It might not be back for a while.\n Finally, highly focused people know that the relationship between feeling and action is a two-way street. While feeling inspired obviously leads to high-quality focus and good work, the inverse is also true: Focusing and working well tends to produce  motivation and even inspiration.\n For example, suppose you want to write a novel… If you only wrote when you felt inspired, you’d likely have a lot of empty pages even after a year’s worth of time.\n On the other hand, if you committed to writing even a few hundred words per day regardless of how you felt, a surprising number of those writing sessions would actually contain some good stuff, which—once you saw it on paper—would motivate you to write more.\n Amateurs sit and wait for inspiration, the rest of us just get up and go to work. — Stephen King\n   At the end of the day, you can arm yourself with all the best tips, tricks, tools, and techniques for focus, but the quality of your work matters more than anything else.\n If you’re consistently working on things you don’t care about, maintaining focus will always be a struggle.\n Doing  the right kind of work pulls you into states of focus almost effortlessly. Think about it…\n You probably don’t have to try hard to focus on a good conversation with your best friend.\n If you love playing basketball, you probably don’t have to try hard to maintain your focus throughout the game.\n   Now, we can’t all just spend our days playing basketball or video games. And luckily, working on things you value doesn’t mean only working on things you’re completely passionate about.\n Many aspects of our work contain deep values within them if you’re willing to look closely and clarify them.\n For example, in my work as a writer, I generally enjoy the act of writing itself and its value is pretty clear to me, so focusing on it isn’t too difficult. However, marketing and distributing my writing is another story… I don’t find a lot of immediate or obvious value in posting my work to social media, for example.\n But when I take the time to clarify what my values are with regard to writing, I realize that getting my ideas in front of more people is something I really value. Which means that there is a strong value within this task I don’t enjoy much. I just have to take the time to clarify it and remind myself of it. And when I do, it makes it much easier to focus and stick with it.\n If you take the time to identify and clarify the values behind your work, focus will take care of itself.\n Far and away the best prize that life offers is the chance to work hard at work worth doing. — Theodore Roosevelt\n   Focus is a skill you cultivate, not a technique you implement. If you want to improve your ability to focus deeply and do your best work, work to cultivate these habits:", "posttime": "2020-07-28 00:03:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高度集中,highly", "title": "高度集中的人的习惯", "title_en": "Habits of Highly Focused People", "transed": 1, "url": "https://nickwignall.com/6-habits-of-highly-focused-people/", "via": "", "real_tags": ["高度集中", "highly"]}, {"category": "", "categoryclass": "", "imagename": "192273da2ec63f6c2cfd4d92c3408cbc.png", "infoid": 1014430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Stasys Jukna是“极端组合在计算机科学中的应用”一书的作者。\n他这本书的结构很棒。这份材料很有用，而且呈现得很好。与其对他的书添加更多的一般性评论，我们认为我们可以突出一个很小的部分-关于单调电路下限的部分。开始了。下面的所有内容都直接基于他的讨论。任何错误或误导性的评论都是我们的。\n固定输入大小，并考虑的子集的某些属性。让我们确切地知道什么时候拥有房产。我们可以把它想象成一个布尔函数。你认为这个性质很难计算--你怎么证明这一点呢？\n一般来说，我们没有工具，但是如果属性是单调的，那么有一些强大的方法。召回单调意味着，如果这样，那么任何集合都仍然具有该属性。例如，可能包含至少一半的元素。元素的数量不可能是偶数。另一个例子是当以析取范式(DNF)给出时，\n其中每一项都是变量的合取。每一个都可以看作是的子集。那么如果且仅当对某些人来说。每个单调函数也有一个合取范式(CNF)。\n其中每个子句都是变量的析取。那么，如果且仅当所有的问题是，所涉及的条款和条款的数量可能是巨大的。这些条款可能有不同的大小。在给定最大子句大小的CNF的情况下，我们精确地为大小的子句的连接词编写，并为其余的子句编写。我们同样为dNFS编写和。\n下界方法是关于的单调电路的大小。也就是说电路只能使用闸门和，而不能使用其他类型的闸门，特别是不能使用闸门。当然，如果没有小的单调电路，那么它也没有小的DNF或CNF公式。\n下限技术所基于的巧妙事实是，如果确实有小的单调电路，那么我们可以用各种可定制的方式在CNF和DNF之间“包装”它：\n定理1(非正式)对于每个具有小的单调电路的人，我们可以找到最大子句大小的CNF和最大项大小的DNF，使得", "note_en": "Stasys Jukna is the author of the  book  Extremal Combinatorics With Applications in Computer Science.\n  The structure of his book is great. The material is useful and well presented. Rather than add more general comments about his book, we thought we might highlight one tiny part—the part on monotone circuit lower bounds. Here goes. All below is based directly on his discussion. Any errors or misguided comments are ours.\n Fix an input size   and consider some property of subsets   of  . Let   exactly when   has the property. We can think of   as a Boolean function. You believe that this property is hard to compute—how do you go about proving that?\n In general we have no tools, but if the property is monotone, then there are some powerful methods. Recall  monotone means that if   then any set   so that   still has the property. For example,   could be that   includes at least half of the elements of  . It cannot be that   has an even number of elements. Another example is when   is given in  disjunctive normal form (DNF),\n  where each  term   is a conjunction of variables. Each   can be regarded as a subset of  . Then   if and only if   for some  . Every monotone function also has a  conjunctive normal form (CNF)\n  where each  clause   is a disjunction of variables. Then   if and only if   for  all   The problem is that the numbers   of terms and   of clauses involved may be huge. The clauses may have different sizes. Given a CNF   of maximum clause size  , we write   for the conjunction of clauses of size exactly   and   for the rest. We similarly write   and   for DNFs  .\n The lower bound methods are on the size of a monotone circuit for  . That is the circuit can only use gates   and  , but no other types of gates, especially not   gates. Of course, if   has no small monotone circuits, then it has no small DNF or CNF formulas either.\n The neat fact on which the lower-bound technique builds is that if    does have small monotone circuits, then we can “wrap” it between a CNF and a DNF in various customizable ways:\n Theorem 1 (informal)    For every   with small monotone circuits and   we can find a CNF   of maximum clause size   and a DNF   of maximum term size   such that", "posttime": "2020-07-27 23:28:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "精彩绝伦,book,单调", "title": "一本关于组合学的精彩绝伦的书", "title_en": "A Brilliant Book on Combinatorics", "transed": 1, "url": "https://rjlipton.wordpress.com/2020/07/27/a-brilliant-book-on-combinatorics/", "via": "", "real_tags": ["精彩绝伦", "book", "单调"]}, {"category": "", "categoryclass": "", "imagename": "fbae8366a92252684fa42b8b22c473bc.png", "infoid": 1014429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apache Arrow团队很高兴地宣布发布了1.0.0版本。这涵盖了超过3个月的开发工作，包括来自100个不同贡献者的810个已解决的问题。请参阅安装页以了解如何获取适用于您的平台的库。尽管是“1.0.0”版本，但这是Apache Arrow的第18个主要版本，标志着向柱状格式(早在2017年12月就已经非正式地向后兼容)的二进制稳定性的过渡，以及向Arrow软件库的语义版本控制的过渡。下面的版本说明并不详尽，仅介绍了该版本的部分亮点。已经进行了许多其他错误修复和改进：我们向您推荐完整的ChangeLog。1.0.0栏目格式和稳定性保证1.0.0版本表明箭头栏目格式声明为稳定，具有向前和向后兼容性保证。Arrow Columnar格式最近进行了几次更改和添加，导致了1.0.0格式版本：元数据版本被升级到新版本V5，这表明UNION类型的缓冲区布局发生了不兼容的更改。所有其他类型都保持与V4中相同的布局。V5还增加了格式以帮助实现向前兼容性(检测未来库版本发送的不受支持的更改)。库与所有库从0.8.0(2017年12月)开始生成的数据保持向后兼容，并且Java和C++库能够生成与V4兼容的消息(用于向使用0.8.0到0.17.1的应用程序发送数据)。字典索引现在允许为无符号整数，而不仅仅是有符号整数。仍然不鼓励使用UInt64，因为Java支持很差。添加了一个“Feature”枚举来声明在IPC流中使用特定的可选功能，比如缓冲区压缩。此新字段尚未被任何实现使用。使用LZ4或ZStandard的可选缓冲区压缩被添加到IPC格式。DECIMAL类型现在有一个可选的“bitWidth”字段，默认为128。这将允许将来支持其他小数宽度，例如32位和64位。有效性位图缓冲区已从UNION类型中删除。UNION数组中槽的空性由组成UNION的组成数组独占确定。集成测试已经扩展到测试扩展类型和嵌套字典。有关详细信息，请参阅实施列表。社区自上次发布以来，我们增加了两名新的提交者：Liya Fan Ji Liu感谢您的所有贡献！Arrow Flight RPC Notes Flight现在在C++、Java和Python中除了doGet和DoPut之外，还提供了DoExchange，这是一个完全双向的数据端点。所有语言的中间件现在都公开二进制值标头。此外，服务器和客户端可以设置所有语言的Arrow IPC读/写选项，从而更容易与早期版本的Arrow Flight兼容。在C++和Python中，Flight现在公开了来自GRPC的更多选项，包括客户端地址(在服务器上)和设置低级GRPC客户端选项的能力。Flight还支持相互的TLS身份验证和客户端控制线路上数据消息大小的能力。C++Notes对Arrow静态链接的支持已经得到了极大的改进，包括引入了libarrow_bundled_relendencies。该库捆绑了所有外部依赖项，这些外部依赖项是由Arrow的构建系统从源代码构建的，而不是由外部包管理器安装的。这使得创建所有库都是静态链接的无依赖关系的应用程序变得非常容易。箭头格式更改后，UNION数组不能再有顶级位图。进行了许多改进，以减少Arrow库中生成的二进制文件的总体大小。方便的API GetBuildInfo允许查询Arrow库的特征。我们鼓励您对返回的信息提出任何需要的补充建议。我们向utf8proc库添加了一个可选的依赖项，用于几个计算函数(见下文)。稀疏和密集联合现在不再共享相同的具体类，而是具有独立的类(SparseUnionType和DenseUnionType，以及SparseUnionArray、DenseUnionArray、SparseUnionScalar和DenseUnionScalar)。Arrow现在可以使用正确的CMake选项集为iOS构建，尽管我们不正式支持它。有关详细信息，请参阅这篇文章。COMPUTE函数计算内核层进行了广泛的修改。它现在提供了通用的函数查找、调度和执行机制。此外，新的内部搭建使编写新函数内核变得容易得多，具有许多常见的细节，如类型检查和基于类型组合的函数分派，由框架处理，而不是由函数开发人员手动实现。添加了大约30个新的阵列计算函数。例如，符合Unicode的谓词和转换，如小写和大写", "note_en": "The Apache Arrow team is pleased to announce the 1.0.0 release. This covers over 3 months of development work and includes 810 resolved issues from 100 distinct contributors. See the Install Page to learn how to get the libraries for your platform. Despite a “1.0.0” version, this is the 18th major release of Apache Arrow and marks a transition to binary stability of the columnar format (which was already informally backward-compatible going back to December 2017) and a transition to Semantic Versioning for the Arrow software libraries. The release notes below are not exhaustive and only expose selected highlights of the release. Many other bugfixes and improvements have been made: we refer you to the complete changelog. 1.0.0 Columnar Format and Stability Guarantees The 1.0.0 release indicates that the Arrow columnar format is declared stable, with forward and backward compatibility guarantees. The Arrow columnar format received several recent changes and additions, leading to the 1.0.0 format version: The metadata version was bumped to a new version V5, indicating an incompatible change in the buffer layout of Union types. All other types keep the same layout as in V4. V5 also includes format additions to assist with forward compatibility (detecting unsupported changes sent by future library versions). Libraries remain backward compatible with data generated by all libraries back to 0.8.0 (December 2017) and the Java and C++ libraries are capable of generating V4-compatible messages (for sending data to applications using 0.8.0 to 0.17.1). Dictionary indices are now allowed to be unsigned integers rather than only signed integers. Using UInt64 is still discouraged because of poor Java support. A “Feature” enum has been added to announce the use of specific optional features in an IPC stream, such as buffer compression. This new field is not used by any implementation yet. Optional buffer compression using LZ4 or ZStandard was added to the IPC format. Decimal types now have an optional “bitWidth” field, defaulting to 128. This will allow for future support of other decimal widths such as 32- and 64-bit. The validity bitmap buffer has been removed from Union types. The nullity of a slot in a Union array is determined exclusively by the constituent arrays forming the union. Integration testing has been expanded to test for extension types and nested dictionaries. See the implementation matrix for details. Community Since the last release, we have added two new committers: Liya Fan Ji Liu Thank you for all your contributions! Arrow Flight RPC notes Flight now offers DoExchange, a fully bidirectional data endpoint, in addition to DoGet and DoPut, in C++, Java, and Python. Middlewares in all languages now expose binary-valued headers. Additionally, servers and clients can set Arrow IPC read/write options in all languages, making compatibility easier with earlier versions of Arrow Flight. In C++ and Python, Flight now exposes more options from gRPC, including the address of the client (on the server) and the ability to set low-level gRPC client options. Flight also supports mutual TLS authentication and the ability for a client to control the size of a data message on the wire. C++ notes Support for static linking with Arrow has been vastly improved, including the introduction of a libarrow_bundled_dependencies.a library bundling all external dependencies that are built from source by Arrow’s build system rather than installed by an external package manager. This makes it significantly easier to create dependency-free applications with all libraries statically-linked. Following the Arrow format changes, Union arrays cannot have a top-level bitmap anymore. A number of improvements were made to reduce the overall generated binary size in the Arrow library. A convenience API GetBuildInfo allows querying the characteristics of the Arrow library. We encourage you to suggest any desired addition to the returned information. We added an optional dependency to the utf8proc library, used in several compute functions (see below). Instead of sharing the same concrete classes, sparse and dense unions now have separated classes (SparseUnionType and DenseUnionType, as well as SparseUnionArray, DenseUnionArray, SparseUnionScalar, DenseUnionScalar). Arrow can now be built for iOS using the right set of CMake options, though we don’t officially support it. See this writeup for details. Compute functions The compute kernel layer was extensively reworked. It now offers a generic function lookup, dispatch and execution mechanism. Furthermore, new internal scaffoldings make it vastly easier to write new function kernels, with many common details like type checking and function dispatch based on type combinations handled by the framework rather than implemented manually by the function developer. Around 30 new array compute functions have been added. For example, Unicode-compliant predicates and transforms, such as lowercase and uppercase transforms, are now available. The available compute functions are listed exhaustively in the Sphinx-generated documentation. Datasets Datasets can now be read from CSV files. Datasets can be expanded to their component fragments, enabling fine grained interoperability with other consumers of data files. Where applicable, metadata is available as a property of the fragment, including partition information and (for the parquet format) per-column statistics. Datasets of parquet files can now be assembled from a single _metadata file, such as those created by systems like Dask and Spark. _metadata contains the metadata of all fragments, allowing construction of a statistics- aware dataset with a single IO call. Feather The Feather format is now available in version 2, which is simply the Arrow IPC file format with another name. IPC By default, we now write IPC streams with metadata V5. However, metadata V4 can be requested by setting the appropriate member in IpcWriteOptions. V4 as well as V5 metadata IPC streams can be read properly, with one exception: a V4 metadata stream containing Union arrays with top-level null values will refuse reading. As noted above, there are no changes between V4 and V5 that break backwards compatibility. For forward compatibility scenarios (where you need to generate data to be read by an older Arrow library), you can set the V4 compatibility mode. Support for dictionary replacement and dictionary delta was implemented. Parquet Writing files with the LZ4 codec is disabled because it produces files incompatible with the widely-used Hadoop Parquet implementation. Support will be reenabled once we align the LZ4 implementation with the special buffer encoding expected by Hadoop. Java notes The Java package introduces a number of low level changes in this release. Most notable are the work in support of allocating large arrow buffers and removing Netty from the public API. Users will have to update their dependencies to use one of the two supported allocators Netty: arrow-memory-netty or Unsafe (internal java api for direct memory) arrow-memory-unsafe. The Java Vector implementation has improved its interoperability having verified LargeVarChar, LargeBinary, LargeList, Union, Extension types and duplicate field names in Structs are binary compatible with C++ and the specification. Python notes The size of wheel packages is significantly reduced, up to 75%. One side effect is that these wheels do not enable Gandiva anymore (which requires the LLVM runtime to be statically-linked). We are interested in providing Gandiva as an add-on package as a separate Python wheel in the future. The Scalar class hierarchy was reworked to more closely follow its C++ counterpart. TLS CA certificates are looked up more reliably when using the S3 filesystem, especially with manylinux wheels. The encoding of CSV files can now be specified explicitly, defaulting to UTF8. Custom timestamp parsers can now be used for CSV files. Filesystems can now be implemented in pure Python. As a result, fsspec-based filesystems can now be used in datasets. parquet.read_table is now backed by the dataset API by default, enabling filters on any column and more flexible partitioning. R notes The R package added support for converting to and from many additional Arrow types. Tables showing how R types are mapped to Arrow types and vice versa have been added to the introductory vignette, and nearly all types are handled. In addition, R attributes like custom classes and metadata are now preserved when converting a data.frame to an Arrow Table and are restored when loading them back into R. For more on what’s in the 1.0.0 R package, see the R changelog. Ruby and C GLib notes The Ruby and C GLib packages added support for the new compute function framework, in which users can find a compute function dynamically and call it. Users don’t need to wait for a C GLib binding for new compute functions: if the C++ package provides a new compute function, users can use it without additional code in the Ruby and C GLib packages. The Ruby and C GLib packages added support for Apache Arrow Dataset. The Ruby package provides a new gem for Apache Arrow Dataset, red-arrow-dataset. The C GLib package provides a new module for Apache Arrow Dataset, arrow-dataset-glib. They just have a few features for now but we will add more in future releases. The Ruby and C GLib packages added support for reading only the specified row group in an Apache Parquet file. Ruby The Ruby package added support for column level compression in writing Apache Parquet files. The Ruby package changed the Arrow::DictionaryArray#[] behavior. It now returns the dictionary value instead of the dictionary index. This is a backwards-incompatible change. Rust notes A new integration test crate has been added, allowing the Rust implementation to participate in integration testing. A new benchmark crate has been added for benchmarking performance against popular data sets. The initial examples run SQL queries against the NYC Taxi data set using DataFusion. This is useful for comparing performance against other Arrow implementations. Rust toolchain has been upgraded to 1.44 nightly. Arrow Core Support for binary, string, and list arrays with i64 offsets to support large lists. A new sort kernel has been added. There have been various improvements to dictionary array support. CSV reader enhancements include a new CsvReadOptions struct and support for schema inference from multiple CSV files. There are significant (10x - 40x) performance improvements to SIMD comparison kernels. DataFusion There are numerous UX improvements to LogicalPlan and LogicalPlanBuilder, including support for named columns. General improvements to code base, such as removing many uses of Arc and using slices instead of &Vec as function arguments. ParquetScanExec performance improvement (almost 2x). ExecutionContext can now be shared between threads. Rust closures can now be used as Scalar UDFs. Sort support has been added to SQL and LogicalPlan.", "posttime": "2020-07-27 23:28:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,apache,arrow", "title": "Apache Arrow 1.0.0发布", "title_en": "Apache Arrow 1.0.0 Released", "transed": 1, "url": "https://arrow.apache.org/blog/2020/07/24/1.0.0-release/", "via": "", "real_tags": ["发布", "apache", "arrow"]}]