[{"category": "", "categoryclass": "", "imagename": "672c80ec836afacf0491f39ecd8ee8f8.jpg", "infoid": 1066987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenZFS创建开发人员Matthew Ahrens将于上周将ZFS History-Raidz扩展大师的最追捧的特征合并到船舶中。新功能允许ZFS用户扩展单个RAIDZ VDev的大小。例如，您可以使用新功能将三个磁盘RAIDZ1转换为四个，五个或六个RAIDZ1。\n  OpenZFS是一个复杂的文件系统，事物必然会有点咀嚼，解释了该功能的工作原理。所以，如果你＆＃39; zfs newbie，你可能想回到我们的综合zfs 101介绍。除了作为文件系统之外，ZFS还是一个存储阵列和卷管理器，这意味着您可以将其送到整个磁盘设备，而不仅仅是一个磁盘设备。 ZFS存储系统的核心是ZPool  - 这是ZFS存储最基本的级别。 ZPool又包含vdevs，Vdevs包含它们中的实际磁盘。写入拆分为称为记录或块的单位，然后在VDEV中半均匀地分发。\n 存储vdev可以是五种磁盘，镜像，RAIDZ1，RAIDZ2或RAIDZ3中的五种类型之一。您可以将更多VDEV添加到ZPool，您可以将更多磁盘附加到单个或镜像vdev。但是，通过这种方式管理存储需要一些计划，并预算 - 哪些业余爱好者和家庭主妇经常areN＆＃39; t太热情。\n 传统的RAID，不共享＆＃34;池＆＃34; ZFS的概念通常提供扩展和/或重塑阵列的能力。例如，您可以将单个磁盘添加到六个磁盘RAID6数组中，从而将其转换为七磁盘RAID6阵列。正在进行的活蛋白，特别是痛苦，特别是在几乎全阵列上;它完全可能需要这样的任务可能需要一周或更长时间，阵列性能限制在整个时间的正常常规或更少。\n 从历史上看，ZFS已经避免了这种扩展。 ZFS最初是为商业用途而开发的，而实时阵列重新塑造通常是商业世界中的非启动器。将存储＆＃39;在最终的日子中对无法使用的水平丢弃，通常在工资单和开销中的成本更多，而不是购买完全新的硬件。现场扩展也是非常危险的，因为它涉及阅读和重写所有数据并将阵列放在临时，远远良好的测试中，而＃34;一半，一半，＆＃34;条件直到它完成。\n 对于具有许多磁盘的用户来说，新的RAIDZ扩展不太可能改变它们使用ZFS的方式。将VDEVS视为完整的单位而不是尝试在它们内部捣碎，它仍然更容易且更加实用。但是，使用单个vdev运行ZFS的业余爱好者，HomeBerbers和小用户可能会在新功能中获得大量使用。\n   从实际的角度来看，Ahrens＆＃39;新的VDev扩展功能仅为现有命令添加新功能，即ZPool Attach，通常用于将磁盘添加到单个磁盘VDEV（将其转换为镜像Vdev）或将额外磁盘添加到镜子（for示例，将双磁盘镜像转换为三个磁盘镜像）。 \n使用新的代码，您也能将新磁盘附加到现有的RAIDZ VDEV。这样做扩展了宽度的vdev，但不会更改vdev类型，因此您可以将一个六磁盘RAIDZ2 VDEV转换为七磁盘RAIDZ2 VDEV，但您可以将其转换为七磁盘RAIDZ3。\n 在发出ZPool附件命令后，扩展开始。在扩展期间，每个块或记录从vdev读取正在扩展，然后重写。重写块的扇区在VDev中的所有磁盘中分发，包括新磁盘，但条带本身的宽度不会改变。因此，在扩展完成后，RAIDZ2 VDEV从六个磁盘扩展到十块仍然仍然充满六个条纹。\n 因此，虽然用户将看到新磁盘提供的额外空间，但由于新磁盘，扩展数据的存储效率不会改进。在上面的示例中，我们从一个六盘RAIDZ2开始，标称存储效率为67％（每六个扇区中的四个是数据）到一个十盘RAIDZ2。新写入十盘RAIDZ2的数据具有80％-八个扇区的标称存储效率是数据 - 但旧的扩展数据仍然用六个条纹写入，因此它仍然具有旧的储存效率旧的67％ 。\n 值得注意的是，这是一个vdev的意外或奇异的状态，因为vdev是raidz已经使用动态，变量​​条带宽宽度来占块或记录太小，以在所有磁盘上条纹。一个vdev。\n 例如，如果您编写单个元数据块 - 包含文件＆＃39; s名称，权限和磁盘上的位置的数据 - 它适合磁盘上的单个扇区。如果您将元数据块写入一个十宽的RAIDZ2，则您不会写一个完整的十宽条纹，而是写一个尺寸的块宽的块;单个数据扇区加上两个奇偶校长扇区。所以＆＃34;尺寸＆＃34;在一个新扩展的RAIDZ VDEV aren＆＃39; t的东西是zfs困惑的东西。他们＆＃39;在办公室旁边只是另一天。\n  正如我们上面所讨论的那样，一个新扩展的RAIDZ VDev Won＆＃39; t看起来非常像是那种从＆＃34那样设计的那样;诞生＆＃34;  - 至少，不是起初。虽然混合中有更多的磁盘，但数据的内部结构是＆＃39; t的变化。\n 向VDEV添加一个或多个新磁盘意味着它应该能够稍高的吞吐量。即使遗留块Don＆＃39; t跨越Vdev的整个宽度，所添加的磁盘意味着更多主轴以分配工作。这可能会赢得＆＃39; t制作了jaw滴加速度，但七碟vdev上的六个条纹意味着您仍然可以同时读取或写两个块，因此可能有任何速度改进很小。 \n对性能的净影响可能很难预测。例如，如果从六个磁盘RAIDZ2扩展到七磁盘RAIDZ2，例如，您的原始六磁盘配置并没有任何填充。可以将128kib块均匀地切成四个32kib数据片，两个32kib奇偶校验件。七个磁盘之间的相同记录拆分需要填充，因为128kib /五个数据件并未出现偶数扇区。\n    同样，在某些情况下 - 特别是小型记录或volblocksize-vollblocksize  - 每个磁盘的工作量可能在较旧的，比较更广泛的更广泛的较窄的布局中可能会显着降低。将128kib块分成32kib块，用于六个RAIDZ2，每个磁盘可以更有效地读取或写入，而不是一个分成16kib件的十宽RAIDZ2，例如它＆＃39;无论是更多磁盘但较小的碎片将提供更多吞吐量，而不是更少的磁盘，但较大的碎片。\n 您可以确定的一件事是，新扩展的配置通常应执行以及原始的非扩展版本 - 一旦大多数数据是（重新）以新宽度编写，扩展VDev Won＆＃39 ; t执行任何不同，或者与从一开始时那样的任何不那么可靠。\n  初始扩展过程似乎奇怪的是，初始扩展过程并在新的宽度上重写所有现有块，而att＃39;毕竟，它＆＃39;无论如何阅读和重新编写数据，对吧？我们要求Ahrens为什么原始宽度留下，并且答案归结为＆＃34;它更容易，更安全。＆＃34;\n 识别的一个关键因素是在技术上，扩展ISN＆＃39; T移动块;它＆＃39;只是移动扇区。它的方式＆＃39;编写的，扩展代码没有必要知道ZFS＆＃39;逻辑块边界是 - 扩展例程不知道单个扇区是否是奇偶校验或数据，更不用说它属于哪个阻止它。\n 扩展可以遍历所有块指针来定位块边界，然后它将知道哪个扇区属于哪个块以及如何重塑块，而是根据Ahrens，做任何方式对ZFS＆＃39的方式非常侵入。磁盘格式。扩展需要在MetasLabs上不断更新SpaceMaps，以解释每个块的磁盘大小的变化 - 如果块是数据集的一部分，而不是zvol，更新每位数据集和每文件空间会计出色地。\n 如果它真的让你的牙齿痒痒地知道你在新鲜五个Vdev上有四个条纹，你可以在扩展完成后立即阅读并重新编写数据。最简单的方法是使用ZFS快照，ZFS发送，ZFS接收以复制整个数据集和ZVols。如果您＆＃39;重新担心ZFS属性，简单的MV操作将完成技巧。 \n然而，在大多数情况下推荐我们在大多数情况下推荐放松和让ZFS做它的事情。来自旧数据的overmed块areN＆＃39; t真正伤害了任何东西，当您自然删除和/或改变Vdev的使用寿命时，大多数都将根据需要自然地重新编写，而无需管理员干预或者由于痴迷阅读和重新编写所有内容，长期高存储负荷。\n  Ahrens＆＃39;新的代码在OpenZFS Master中，但尚未成为任何OpenZFS发布的一部分，更不用说别的人添加到其他人和＃39;我的存储库中。当我们期望在生产中看到代码时，我们问了Ahrens，不幸的是，它将是一段时间。\n RAIDZ扩展命中硕士太晚了，即即将到来的OpenZFS 2.1发布，预计很快（现在可以使用2.1发布候选人7）。它应该包含在下一个主要的OpenZFS释放中;它＆＃39为混凝土日期太早，但主要发布通常每年发生一次。\n 广泛地说，我们预计RAIDZ扩张在2022年8月2022年8月的某个地方的ubuntu和freebsd的应用中击中了生产，但是猜测。 Truenas可能会很好地将其进入生产中的生产，因为在官方命中释放状态之前，IxSystems倾向于从Master中提取ZFS功能。 ", "note_en": "OpenZFS founding developer Matthew Ahrens merged one of the most sought-after features in ZFS history—RAIDz expansion—into master last week. The new feature allows a ZFS user to expand the size of a single RAIDz vdev. For example, you can use the new feature to turn a three-disk RAIDz1 into a four, five, or six RAIDz1.\n  OpenZFS is a complex filesystem, and things are necessarily going to get a bit chewy explaining how the feature works. So if you&#39;re a ZFS newbie, you may want to refer back to our comprehensive ZFS 101  introduction.  In addition to being a filesystem, ZFS is a storage array and volume manager, meaning that you can feed it a whole pile of disk devices, not just one. The heart of a ZFS storage system is the zpool—this is the most fundamental level of ZFS storage. The  zpool in turn contains  vdevs, and  vdevs contain actual disks within them. Writes are split into units called  records or  blocks, which are then distributed semi-evenly among the  vdevs.\n A storage  vdev can be one of five types—a single disk, mirror,  RAIDz1,  RAIDz2, or  RAIDz3. You can add more  vdevs to a  zpool, and you can  attach more disks to a single or mirror  vdev. But managing storage this way requires some planning ahead and budgeting—which hobbyists and homelabbers frequently aren&#39;t too enthusiastic about.\n Conventional  RAID, which does not share the &#34;pool&#34; concept with ZFS, generally offers the ability to expand and/or reshape an array in place. For example, you might add a single disk to a six-disk  RAID6 array, thereby turning it into a seven-disk  RAID6 array. Undergoing a live reshaping can be pretty painful, especially on nearly full arrays; it&#39;s entirely possible that such a task might require a week or more, with array performance limited to a quarter or less of normal the entire time.\n Historically, ZFS has eschewed this sort of expansion. ZFS was originally developed for business use, and live array re-shaping is generally a non-starter in the business world. Dropping your storage&#39;s performance to unusable levels for days on end generally costs more in payroll and overhead than buying an entirely new set of hardware would. Live expansion is also potentially very dangerous since it involves reading and re-writing all data and puts the array in a temporary and far less well-tested &#34;half this, half that&#34; condition until it completes.\n For users with many disks, the new  RAIDz expansion is unlikely to materially change how they use ZFS. It will still be both easier and more practical to manage  vdevs as complete units rather than trying to muck about inside them. But hobbyists, homelabbers, and small users who run ZFS with a single  vdev will likely get a lot of use out of the new feature.\n   From a practical perspective, Ahrens&#39; new  vdev expansion feature merely adds new capabilities to an existing command, namely,  zpool attach, which is normally used to add a disk to a single-disk  vdev (turning it into a  mirror vdev) or add an extra disk to a  mirror (for example, turning a two-disk  mirror into a three-disk  mirror).\n    With the new code, you&#39;ll be able to  attach new disks to an existing  RAIDz vdev as well. Doing so expands the vdev in width but does not change the  vdev type, so you can turn a six-disk  RAIDz2 vdev into a seven-disk  RAIDz2 vdev, but you  can&#39;t turn it into a seven-disk  RAIDz3.\n Upon issuing your  zpool attach command, the expansion begins. During expansion, each  block or  record is read from the  vdev being expanded and is then rewritten. The sectors of the rewritten  block are distributed among all disks in the  vdev, including the new disk(s), but the width of the stripe itself is not changed. So a  RAIDz2 vdev expanded from six disks to ten will still be full of six-wide stripes after expansion completes.\n So while the user will see the extra space made available by the new disks, the storage efficiency of the expanded data will not have improved due to the new disks. In the example above, we went from a six-disk  RAIDz2 with a nominal storage efficiency of 67 percent (four of every six sectors are data) to a ten-disk  RAIDz2. Data  newly written to the ten-disk RAIDz2 has a nominal storage efficiency of 80 percent—eight of every ten sectors are data—but the old expanded data is still written in six-wide stripes, so it still has the old 67 percent storage efficiency.\n It&#39;s worth noting that this isn&#39;t an unexpected or bizarre state for a vdev to be in— RAIDz already uses a dynamic, variable stripe width to account for  blocks or  records too small to stripe across all the disks in a single  vdev.\n For example, if you write a single metadata block—the data containing a file&#39;s name, permissions, and location on disk—it fits within a single  sector on disk. If you write that metadata block to a ten-wide  RAIDz2, you don&#39;t write a full ten-wide stripe—instead, you write an undersized  block only three disks wide; a single data  sector plus two parity  sectors. So the &#34;undersized&#34;  blocks in a newly expanded  RAIDz vdev aren&#39;t anything for ZFS to get confused about. They&#39;re just another day at the office.\n  As we discussed above, a newly expanded  RAIDz vdev won&#39;t look quite like one designed that way from &#34;birth&#34;—at least, not at first. Although there are more disks in the mix, the internal structure of the data isn&#39;t changed.\n Adding one or more new disks to the  vdev means that it should be capable of somewhat higher throughput. Even though the legacy  blocks don&#39;t span the entire width of the  vdev, the added disks mean more spindles to distribute the work around. This probably won&#39;t make for a jaw-dropping speed increase, though—six-wide stripes on a seven-disk  vdev mean that you still can&#39;t read or write two  blocks simultaneously, so any speed improvements are likely to be minor.\n The net impact to performance can be difficult to predict. If you are expanding from a six-disk  RAIDz2 to a seven-disk  RAIDz2, for example, your original six-disk configuration didn&#39;t need any padding. A 128KiB  block can be cut evenly into four 32KiB data pieces, with two 32KiB parity pieces. The same record split among  seven disks requires padding because 128KiB/five data pieces doesn&#39;t come out to an even number of sectors.\n    Similarly, in some cases—particularly with a small  recordsize or  volblocksize set—the workload per individual disk may be significantly less challenging in the older, narrower layout than in the newer, wider one. A 128KiB  block split into 32KiB pieces for a six-wide  RAIDz2 can be read or written more efficiently  per disk than one split into 16KiB pieces for a ten-wide  RAIDz2, for example—so it&#39;s a bit of a crapshoot whether more disks but smaller pieces will provide more throughput than fewer disks but larger pieces did.\n The one thing you can be certain of is that the newly expanded configuration should typically perform as well as the original non-expanded version—and that once the majority of data is (re)written in the new width, the expanded  vdev won&#39;t perform any differently, or be any less reliable, than one that was designed that way from the start.\n  It might seem odd that the initial expansion process doesn&#39;t rewrite all existing  blocks to the new width while it&#39;s running—after all, it&#39;s reading and re-writing the data anyway, right? We asked Ahrens why the original width was left as-is, and the answer boils down to &#34;it&#39;s easier and safer that way.&#34;\n One key factor to recognize is that technically, the expansion  isn&#39;t moving  blocks; it&#39;s just moving  sectors. The way it&#39;s written, the expansion code doesn&#39;t need to know where ZFS&#39; logical  block boundaries are—the expansion routine has no idea whether an individual  sector is parity or data, let alone which  block it belongs to.\n Expansion could traverse all the  block pointers to locate  block boundaries, and  then it would know which  sector belongs to what  block and how to re-shape the  block, but according to Ahrens, doing things that way would be extremely invasive to ZFS&#39; on-disk format. The expansion would need to continually update  spacemaps on  metaslabs to account for changes in the on-disk size of each  block—and if the  block is part of a  dataset rather than a  zvol, update the per-dataset and per-file space accounting as well.\n If it really makes your teeth itch knowing you have four-wide stripes on a freshly five-wide vdev, you can just read and re-write your data yourself after expansion completes. The simplest way to do this is to use  zfs snapshot,  zfs send, and  zfs receive to replicate entire  datasets and  zvols. If you&#39;re not worried about ZFS properties, a simple  mv operation will do the trick.\n However, we&#39;d recommend in most cases just relaxing and letting ZFS do its thing. Your undersized  blocks from older data aren&#39;t really hurting anything, and as you naturally delete and/or alter data over the life of the  vdev, most of them will get re-written naturally as necessary, without the need for admin intervention or long periods of high storage load due to obsessively reading and re-writing everything all at once.\n  Ahrens&#39; new code is in OpenZFS master but is not yet a part of any OpenZFS release, let alone added to anyone else&#39;s repositories. We asked Ahrens when we might expect to see the code in production, and unfortunately, it will be a while.\n RAIDz expansion hit master too late to be included in the upcoming OpenZFS 2.1 release, expected very soon (2.1 release candidate 7 is available now). It should be included in the next major OpenZFS release; it&#39;s too early for concrete dates, but major releases typically happen about once per year.\n Broadly speaking, we expect RAIDz expansion to hit production in the likes of Ubuntu and FreeBSD somewhere around August 2022, but that&#39;s just a guess. TrueNAS may very well put it into production sooner than that, since ixSystems tends to pull ZFS features from master before they officially hit release status.", "posttime": "2021-06-20 13:14:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "粉丝,fans,扩展", "title": "ZFS粉丝，Enjoice  -  Raidz扩张将很快成为一件事 ", "title_en": "ZFS fans, rejoice – RAIDz expansion will be a thing soon", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/raidz-expansion-code-lands-in-openzfs-master/", "via": "", "real_tags": ["粉丝", "fans", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066985, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "赞助的顶部网站（或“赞助瓷砖”）是目前在有限数量的市场中的少数Firefox用户进行测试的实验特征。 Mozilla与广告合作伙伴合作，在Firefox主页（或新选项卡）上为Firefox用户提供赞助的瓷砖。 当用户单击赞助瓷砖时，Mozilla是支付的。  隐私是Mozilla＆＃39;特派团的基础，我们只与符合Firefox隐私标准的广告合作伙伴合作。 我们当前的合作伙伴是Admarketplace。  点击赞助瓦片时，Firefox通过Mozilla拥有的代理服务向我们的合作伙伴发送匿名的技术数据。 此数据不包括任何个人识别信息，只有在您单击赞助的顶端站点时才共享。 ", "note_en": "Sponsored Top Sites (or “sponsored tiles”) is an experimental feature currently being tested by a small percentage of Firefox users in a limited number of markets. Mozilla works with advertising partners to place sponsored tiles on the Firefox home page (or  New Tab) that would be useful to Firefox users. Mozilla is paid when users click on sponsored tiles.\n   Privacy is fundamental to Mozilla&#39;s mission and we only work with advertising partners that meet our privacy standards for Firefox. Our current partner is  adMarketplace.\n  When you click on a sponsored tile, Firefox sends  anonymized technical data to our partner through a Mozilla-owned proxy service. This data does not include any personally identifying information and is only shared when you click on a Sponsored Top Site.", "posttime": "2021-06-20 12:32:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "firefox,begins", "title": "Firefox开始在某些用户的默认主页/新标签页上测试赞助商 ", "title_en": "Firefox Begins Testing Sponsors on Some Users' Default Home Page/New Tab Pages", "transed": 1, "url": "https://support.mozilla.org/en-US/kb/sponsor-privacy", "via": "", "real_tags": ["firefox", "begins"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066983, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据德克萨斯大学奥斯汀·奥斯汀大学的媒体参与的一项新研究，新闻消费者和社交媒体平台用户优先考虑除去亵渎的删除剧情。\n 公众对社交媒体平台和新闻机构删除了令人反感评论的情况如何？\n 我们查看了注释删除的3个方面：删除内容的类型，解释细节，＆amp;人类或算法适度。 🧵https://t.co/xd8z5voay2 @utexasmoody\n  媒体参与中心与荷兰的Erasmus大学合作，葡萄牙北方大学合作，了解公众如何在美国，荷兰和葡萄牙中察觉和中风者。他们在美国975年调查了902人，葡萄牙993年。\n 在评论模板中，旨在看起来像常见的评论平台Disqus，研究人员随机显示了调查参与者社交媒体帖子。这是他们的方式：\n 参与者接触到含有仇恨言论或亵渎的社交媒体帖子。然后，他们从主持人接触到一个帖子 - 人类或算法 - 删除了初始帖子，因为它令人反感。此消息要么专门解释为什么删除帖子，给出了一般意义，为什么它被删除为网站的社区指南，或者没有解释。之后，参与者回答了关于删除的公平或合法性的问题以及主持人是多么透明或值得透明的问题。\n  在所有国家，调查参与者认为删除仇恨的言论比消除亵渎更公平和合法，并发现了所做的主持人，并提供了对更透明的原因的详细解释。在美国和荷兰，参与者发现主持人去除仇恨言论，比那些消除亵渎的人更值得信赖。虽然删除方法 - 无论是人类还是算法 - 都没有影响美国人和荷兰人如何感受到葡萄牙的内容删除，“与算法删除相比，人类主持人的删除是更公平和合法的。” \n主持人应该更多地关注仇恨言论，因为人们认为仇恨言论更需要删除而不是亵渎。  算法主持人可以同样地观察到人类主持人，尽管应该考虑特定的文化背景，因为每个国家可能不是这种情况。 ", "note_en": "News consumers and social media platform users prioritize the removal of hate speech over the removal of profanity, according to a new study by the Center for Media Engagement at the University of Texas, Austin.\n How does the public feel about social media platforms and news organizations deleting offensive comments?\n We looked at 3 aspects of comment deletion: type of deleted content, detail of the explanation, &amp; human or algorithm moderation. 🧵 https://t.co/Xd8Z5VOay2  @UTexasMoody\n  The Center for Media Engagement partnered with Erasmus University in the Netherlands and NOVA University in Portugal to understand how the public perceives comment deletion and the moderators who do it in the United States, the Netherlands, and Portugal. They surveyed 902 people in the United States, 975 in the Netherlands, and 993 in Portugal.\n In a comment template designed to look like the common commenting platform Disqus, researchers randomly showed survey participants social media posts. Here’s how they did it:\n Participants were exposed to a social media post that contained either hate speech or profanity. Then they were exposed to a post from a moderator — either a human or an algorithm — that deleted the initial post because it was offensive. This message either explained specifically why the post was deleted, gave a general sense of why it was deleted with a clickable link to community guidelines for the site, or offered no explanation. Afterward, participants answered questions about how fair or legitimate the deletion was and how transparent or trustworthy the moderator was.\n  In all countries, survey participants thought that removing hate speech was more fair and legitimate than removing profanity, and found the moderators who did so and offered a detailed explanation of why to be more transparent. In the U.S. and the Netherlands, participants found moderators removing hate speech to be more trustworthy than those who removed profanity. While the method of removal — either by a human or an algorithm — did not impact how Americans and Dutch people felt about content removal, in Portugal, “participants perceived deletions by human moderators as more fair and legitimate compared to deletions by algorithms.”\n  Moderators should focus more on hate speech, because people see hate speech as more in need of deletion than profanity.\n  Algorithmic moderators may be perceived equally to human moderators, although specific cultural contexts should be considered because this may not be the case in every country.", "posttime": "2021-06-20 12:31:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,仇恨,speech,删除", "title": "调查：社交媒体用户看到仇恨言论的删除，比消除亵渎更具公平，他们将讨论仇恨的主持人视为更值得信赖 ", "title_en": "Survey: social media users see the removal of hate speech as more fair than removing profanity, with moderators who removed hate speech seen as more trustworthy", "transed": 1, "url": "https://www.niemanlab.org/2021/06/comment-moderators-should-focus-more-on-hate-speech-than-profanity-a-new-study-suggests/", "via": "", "real_tags": ["rust", "仇恨", "speech", "删除"]}, {"category": "", "categoryclass": "", "imagename": "20045e6910b397b737151b247891ced2.jpg", "infoid": 1066982, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在费城郊区袭击了毒贩的联邦代理人发现大麻，并令他们惊讶的是，在鱼缸下方的秘密舱内藏的现金250万美元。\n 但是，在墙壁上发现这么多艺术 -  14张艺术，他们甚至更加惊讶地发现这么多的艺术品 -  14张山上堆放在距离经销商之家，罗纳德贝西亚诺几英里的储物单元。艺术家包括Renoir，Picasso和SalvadorDalí。\n “这跳了在我们身边，”家乡安全调查费城的特别代理人Brian A. Michael说。 “这件艺术品的数量不是你在每次调查中都遇到的东西。”\n  事实证明，Belciano先生使用艺术来洗涤他的一些药物现金，从费城博物馆行附近的成熟画廊购买了作品。\n 2015年，他通过利用艺术市场之一的签名特征 - 它的透明度，他被判处了超过五年的监禁，以便打击毒品，并洗钱非法所得款项。\n 数十亿美元的艺术每年都会改变双手，几乎没有公众审查。买家通常不知道他们正在购买的工作来源。卖家在黑暗中类似于工作的地方。没有任何购买要求提交文件的文书工作，使监管机构能够轻松跟踪艺术销售或利润，从政府可以审查其他大量资产的转移，如股票或房地产的方式不同的差异。\n 但是，担心贝尔西诺案件的当局不再是奇怪的，而是一种有用的艺术如何成为洗钱者的工具的寓言，正在考虑提高市场的监督并使其更加透明。 \n1月，国会扩大联邦反洗钱法规，旨在管理银行业，古物经销商。立法要求财政部加入其他机构，研究更长的规定是否应对更广泛的艺术市场施加。美国努力遵循欧洲最近通过的法律，经销商和拍卖房屋现在必须确定客户的身份并检查其财富的来源。\n “秘密，匿名和缺乏规定创造了一个令人犯着钱和逃避制裁的环境成熟，”美国参议院的常任条例在去年7月的一份报告中表示，支持增加审查。\n  到艺术世界退伍军人，他们以自行决定，传统和班级宣传匿名，而不是重复，这一围攻是一个过度反应，将损害市场。当他们说滥用的证据时，他们担心疏远别人探讨的问题。\n “我们处于偏执狂的阶段，即美国艺术经销商协会的总裁Andrew Schoelkopf在今年的一个行业小组中表示。 “这将是一大堆文书工作，很多合规性，我认为我们不会灭亡大部分问题。”\n 他们的担忧足够大，以至于经销商协会和主要拍卖房屋的游说者一直在华盛顿塑造了对此和其他监管措施的不断变化的政策。自2019年以来，克里斯蒂，苏富比和经销商协会的游说法案已接近100万美元。\n 尽管如此，艺术市场尚无质疑，在创建海关时，艺术市场的价值和范围。绘画常规地销售1000万美元，2000万美元，往往和他们挂起的五屋一样多。虽然艺术销售的利润受到奢侈品的强劲资本增长税，但追踪谁是追踪谁准确报告意外收获的能力是一种斗争。甚至讨论谁卖掉了什么是障碍。购买的一半是私人的，而不是在公开拍卖，所以许多价格从未成为公众。\n 最近的研究预计最富有的美国人逃税，导致拜登总统提高审计计划。虽然没有涉及艺术的广泛作弊的证据，但专家表示，这是明确的市场保密，为执法制度创造脆弱性，这很少探讨审计并严重依赖于收藏家的意愿，以使他们的利润普通。 \n“唯一知道的人，”Tulane Law School教授Khrista Mccarden曾专注于税法，“你是艺术画廊和上帝。”\n  艺术界的秘密有时会在圣巴特的伊甸园岩饭店等地方腾出，2014年午餐俯瞰着圣让湾的绿松石水域，俄罗斯亿万富翁德米特里E. Rybolovlev，收藏家们，被介绍了纽约艺术顾问沙迪海尔。当然，谈话转向艺术和金钱。\n  Rybolovlev先生从一个未知的卖家裸体支付了11800万美元的Modigliani裸体。 Heller先生证实，卖方是他的客户，对冲基金经理Steven A. Cohen。但有些东西已经关闭了。科恩先生只收取了9350万美元的地狱Helder说。\n Rybolovlev先生使用了一位艺术顾问，Yves Bouvier，使其和许多其他购买，总额近20亿美元。事实证明，布维尔先生以一个价格购买了作品，并将他们的巨大标记翻转到他的客户。\n 布维尔先生表示，它总是清楚他作为一个独立卖方经营，他们可以以自己的方式购买艺术和转售。但在随后的法律战斗中，Rybolovlev先生不仅仅是他的前顾问，而是艺术世界本身。\n “如果市场更加透明，这些事情不会发生，”他说。\n  这种保密的起源是什么？专家表示，在第15世纪的第15世纪可能会达到最早的艺术市场的日期，当时圣卢克，专业贸易组织，开始规范欧洲的艺术生产和销售。在此之前，艺术并非如此被贵族或职员委员会委托出售。但作为一个商家阶级的扩大，艺术市场所以，从讲习班和城市等城市的公共摊位经营，如安特卫普等。为了遏制竞争对手，隐瞒一个人的身份是有意义的，所以他们不能被盗，或者保持他们收取一个客户的秘密，以便他们可以向另一个客户收取不同的价格，激励今天坚持的信息。 \n市场的秘密不如曾经的秘密。例如，拍卖房屋今天发布了他们希望艺术品的价格估计。但是，它仍然是不透明的，这对一个世界的神秘和浪漫的浪漫带来了一个空气，其中价值和利润可以依赖于作为关于天才的短暂共识。\n 拍卖目录说作品来自“私人收藏”，往往是更多的。绘画有时是由业主的代表带到市场，其身份未知，甚至到安排销售，专家和官员的画廊说。购买者也使用代理人。例如，当Rybolovlev先生将Leonardo da Vinci的“Salvator Mundi”销售给沙特阿拉伯的皇冠萨尔曼·穆罕默德·萨尔曼时，它是由王子的朋友买的，这掩盖了谁购物。\n 在这种情况下，画廊依赖于代理商的完整性，他们有长期的事业。有时买家和卖家根本不是个人，而是贝壳公司，不透明的投资结构经常旨在隐瞒身份。\n “很少有人购买500万张绘画作为一个人，因为他们不会那样买其他方式，”纽约艺术家Cristin Tierney说。\n 一旦购买了许多工作，其中很多，包括世界上一些最具表现力和昂贵的，最终隐藏在海绵体，不符合税收庇护的免费港口，他们的下落很大程度上都未知。\n “艺术界的各种欺诈是几乎无限的，这是艺术界在圣地亚哥大学教授的赫伯特·莱撒洛（San Diego大学教授）表示，这是无穷无尽的。”法学院。\n  现在联邦政府正在考虑使用旨在打击金融机构洗钱的法律，以进一步规范艺术市场。法律，银行保密法，要求银行报告超过10,000美元的现金交易，突出可疑活动，了解客户的身份以及他们的财富来自何处。 \n国会已经授权财政部官员定制法规，以适应古物市场，这长期以来一直受到叙利亚和伊拉克等国家贩运的非法文物的担忧。现在，古代珍宝像罗马大理石雕像或埃及救济的经销商将被视为金融机构，联邦监管机构将研究限制是否应扩展到更广泛的艺术市场。\n 古物经销商担心遵守所谓的AML（反洗钱）法规的成本。他们说他们已经知道他们的客户足以知道他们没有非法活动。\n 纽约古代经销商Randall Hixenbaugh抱怨说，小型企业将被迫聘请合规官员。 “我甚至不能在这种可怕的经济气氛中雇用全职助理，”他在一封电子邮件中说。\n  如果新的狭窄延伸到更广泛的艺术市场，法律可能需要经销商和拍卖房屋，以确定实际业主是谁，甚至刺穿了壳牌公司的面纱。\n 克里斯蒂表示，它“欢迎有机会与美国监管机构合作，并在适当和可执行的”指导方针上。苏富比表示，它“拥有长期以来的尽职调查程序，并将遵守所有适用的法律法规。”\n 拍卖房屋已经回复了欧洲的变化，也在美国更加彻底审查了美国的客户。克里斯蒂的卖家在纽约拍卖中表示必须充分披露他们的身份。对于买家来说，它表示，当有任何风险建议时，它会核实任何代理人的身份，并努力确定资金来源。\n 但去年，参议院调查人员发现了艺术市场现已到位的政策中的差距。拍卖房屋和经销商被引用允许两个俄罗斯寡头，靠近弗拉基米尔·普京总统普京，制裁，使用艺术顾问前面的壳牌公司购买和销售艺术品。小组委员会得出结论认为，拍卖房屋在2011年和2019年之间交易中，并没有确定现实主人尽管自称是否采取了保障措施。 \n参议员Rob Portman，俄亥俄州共和党和报告的赞助商表示，“艺术行业不能信任自我警察。”\n 虽然拍卖房屋宣称具有强大的反洗钱计划，但我们发现促进交易的实际员工从未询问艺术中介是谁购买的绘画或者在何处，他在一份声明中说。\n 即使采用了更严格的规则，买家和卖家的名称也不会成为公众。但经销商和拍卖房屋需要确定他们在执法询问时正在处理谁。\n  洗钱涉及艺术多少钱？似乎没有人量化它，虽然很多专家都同意艺术市场是它蓬勃发展的自然场所。 “碎片是便携式的，周围有一个高水平的保密，谁拥有他们支付的东西和价值，并且在全球证人的研究员Nienke Palstra说，这是在某种程度上辩护的。\n 尽管如此，所取得的起诉人数不会自行建议问题是普遍存在的问题。\n 在一个典型的案例中，有人使用非法利润来购买艺术，在那里停车，直到稍后的销售导致“清洁”金钱，具有合法的血统。一个着名的案例涉及金融家jho低位，世界卫生组织波尔维尔·奥尔（PROVEROUNS）说，从聘请银行账户和壳牌公司网络的马来西亚政府基金中帮助了数十亿美元。然后，他洗了钱，检察官通过消费狂欢对艺术等事情说。 2014年，他拥有的开曼岛公司从苏富比的贷款中获得了1.07亿美元的贷款，使用了一些艺术作为抵押品。 （Low先生否认任何不法行为，仍然大。）\n  苏富比的和克里斯蒂说，一旦他们知道，他们就会停止与他做生意。他们没有被指控不法行为。 \n有些专家表示，如果需要报告可疑活动，那么，如果需要报告可疑活动，那么强行努力就会过于缺乏缺乏症状的人无法染味，并且如果需要经销商和拍卖房屋，则会变得明显。\n “你不知道你不知道的是什么，”前美国检察官彼得D. Hardy说。\n 收藏家的顾问表示，他们也不认为艺术交易的不透明性导致了对资本收益报告的重大作弊，尽管经销商没有义务向政府提供独立报告销售。\n “收藏家是突出的社区突出的商界人士，”纽约艺术管理和投资公司的校长迈克尔·普拉姆说，并通过复杂的税务和法律专业人士的建议，储蓄税收不报告资本收益和犯罪直接税务欺诈只是对他们的其他业务和社会利益的风险不值得。“\n 在人们未能从艺术销售中报告利润的情况下，一些顾问认为银行系统能够销售逃税。但其他专家表示，我的队伍其他监管机构太薄，无法跟进每年有数百万人的银行警报。\n “他们得到了这么多的报道，他们不可能跟进所有这些报道，”朱莉A.山是一座阿拉巴马州法学院教授大学的朱莉A.山。\n  他被捕四个月后，罗纳德贝西亚诺返回了I. Brewster＆amp; Co.，Childelphia画廊在哪里，调查人员说，他买了他习惯于洗钱的艺术。 \n但他不是在那里为自己购物。相反，根据法院记录，他介绍了他向丽莎介绍了Lisa的Gally Owner，Nathan Isen，他被确定为一个有许多现金的毒贩，根据法院记录。\n  “就像，我愿意像这样投入这样的投资，但我不知道，”根据他们的谈话的成绩单，她说。 “我不知道如何出售这一点。汽车，其他我可以摆脱容易的东西。就像这样我很紧张。“\n “它与销售汽车不同，”他说，“因为汽车必须有登记，标题和这一切以及一切。 ......这些都没有。 ......这些可能是，这些可能是你的祖母。你跟着我？”\n “所以我可以说，'嘿，这是我继承的东西，而不是我买的'”丽莎问道。\n “正确的。 “我发现它在一个旧货店，他们是10美元的一块，”伊森先生回答道。\n 伊森先生未被指控在贝尔西亚诺的案例中被告人，并且已经否认了贝尔西诺先生正在利用艺术来解放金钱，但由于他与丽莎的谈话，谁是戴着电线的卧底特工，他稍后会在2015年收取洗钱和辩护书。他被判处320小时的社区服务，并获得了15,000美元的罚款。\n 在他们的第一次谈话之后一周，丽莎回到了伊森的画廊先生，以20,000美元购买12个萨尔瓦多达利石刻。她的棕色纸袋里有现金。它闻到了毒品，她告诉杂志，因为她把它与她的大麻藏匿处。 \n根据法院论文，他告诉她，她没有为她的购买发票。  “没有发票？ 酷，“她回答道。 “没有收据，没有发票，我很好。 这就是我喜欢做生意的方式。“ ", "note_en": "The federal agents who raided a drug dealer’s house in a suburb of Philadelphia found marijuana and, to their surprise, $2.5 million in cash stashed in a secret compartment beneath a fish tank.\n But they were even more surprised to discover so much art — 14 paintings on the walls and another 33 stacked in a storage unit a few miles away from the home of the dealer, Ronald Belciano. The artists included Renoir, Picasso and Salvador Dalí.\n “That jumped out at us,” said Brian A. Michael, special agent in charge for Homeland Security Investigations Philadelphia. “That amount of artwork was not something you come across in every investigation.”\n  It turned out, Mr. Belciano used the art to launder some of his drug cash, purchasing the works from an established gallery near Philadelphia’s Museum Row.\n In 2015, he was  sentenced to more than five years in prison for dealing drugs and for laundering the illicit proceeds by taking advantage of one of the art market’s signature features — its opacity.\n Billions of dollars of art changes hands every year with little or no public scrutiny. Buyers typically have no idea where the work they are purchasing is coming from. Sellers are similarly in the dark about where a work is going. And none of the purchasing requires the filing of paperwork that would allow regulators to easily track art sales or profits, a distinct difference from the way the government can review the transfer of other substantial assets, like stocks or real estate.\n But now authorities who fear the Belciano case is no longer an oddity, but a parable of how useful art has become as a tool for money launderers, are considering boosting oversight of the market and making it more transparent.\n In January,  Congress extended federal anti-money laundering regulations, designed to govern the banking industry, to antiquities dealers. The legislation required the Department of the Treasury to join with other agencies to study whether the stricter regulations should be imposed on the  wider art market as well. The U.S. effort follows laws recently  adopted in Europe, where dealers and auction houses must now determine the identity of their clients and check the source of their wealth.\n “Secrecy, anonymity and a lack of regulation create an environment ripe for laundering money and evading sanctions,” the U.S. Senate’s Permanent Subcommittee on Investigations said  in a report last July in support of increased scrutiny.\n  To art world veterans, who associate anonymity with discretion, tradition and class, not duplicity, this siege on secrecy is an overreaction that will damage the market. They worry about alienating customers with probing questions when they say there is scant evidence of abuse.\n “We are in the paranoid-terrified phase of what’s going to come down the pike,” Andrew Schoelkopf, then the president of the Art Dealers Association of America, said at  an industry panel this year. “It’s going to be a whole lot of paperwork and a whole lot of compliance and I don’t think we will extinguish much of a problem.”\n Their concerns are great enough that lobbyists for the dealers’ association and major auction houses have been trying in Washington to shape the evolving policy on this and other regulatory measures. Since 2019, the lobbying bill for Christie’s, Sotheby’s and the dealers’ association has approached $1 million.\n Still, there is no question the art market has exploded in value and scope from the sleepy days when its customs were created. Paintings routinely sell for $10 million, $20 million, often as much as the penthouses in which they hang. Though the profits from art sales are subject to the robust capital gains tax on luxury goods of 28 percent, the I.R.S.’s ability to track who is accurately reporting windfalls is something of a struggle. Even figuring out who sold what is a hurdle. Half the purchases are in private, not at public auction, so many prices never become public.\n Recent  studies have projected substantial tax evasion by the richest Americans, which led to President Biden’s  plan to boost audits. While there is no evidence of widespread cheating involving art, experts say it’s clear the secrecy of the market creates vulnerabilities for an enforcement system that rarely conducts audits and relies heavily on the willingness of collectors to make plain their profits.\n “The only ones who know,” said Khrista McCarden, a professor at Tulane Law School who specializes in the tax code, “are you, the art gallery and God.”\n  The secrets of the art world sometimes tumble out at places like the Eden Rock hotel on St. Barts, where in a lunch in 2014 overlooking the turquoise waters of St. Jean Bay, the Russian billionaire Dmitry E. Rybolovlev, a collector, was introduced to Sandy Heller, a New York art adviser. Naturally, the conversation turned to art, and money.\n  Mr. Rybolovlev had paid $118 million for a Modigliani nude from an unknown seller. Mr. Heller confirmed that the seller had been his client, the hedge fund manager Steven A. Cohen. But something was off. Mr. Cohen had charged only $93.5 million, Heller said.\n Mr. Rybolovlev had used an art adviser, Yves Bouvier, to make that and many other purchases, totaling nearly $2 billion. It turned out Mr. Bouvier was buying the works at one price and flipping them at huge markups to his client.\n Mr. Bouvier has said it was always clear he was operating as an independent seller who could buy the art and resell on his own terms. But  in the legal battle that has ensued, Mr. Rybolovlev has castigated not only his former adviser, but the art world itself.\n “If the market were more transparent, these things wouldn’t happen,” he said.\n  What is the origin of such secrecy? Experts say it likely dates to the earliest days of the art market in the 15th and 16th centuries when the Guilds of St. Luke, professional trade organizations, began to regulate the production and sale of art in Europe. Until then, art was not so much sold as commissioned by aristocratic or clerical patrons. But as a merchant class expanded, so did an art market, operating from workshops and public stalls in cities like Antwerp. To thwart competitors, it made sense to conceal the identity of one’s clients so they could not be stolen, or to keep secret what they charged one customer so they could charge another client a different price, incentives to guard information that persist today.\n  The market is less secretive than it once was. Auction houses, for example, today publish estimates of prices they expect artworks to achieve. But so much about it remains opaque, which lends an air of mystery and romance to a world where values and profits can rely on something as capricious as a fleeting consensus on genius.\n Auction catalogs say works are from “a private collection,” often nothing more. Paintings are at times brought to market by representatives of owners whose identities are unknown, even to the galleries arranging the sale, experts  and officials say. Purchasers use surrogates, too. When Mr. Rybolovlev sold Leonardo da Vinci’s “Salvator Mundi” to Crown Prince Mohammed bin Salman of Saudi Arabia, for example, it was bought by a friend of the prince, which obscured who was shopping.\n In these circumstances, the galleries rely on the integrity of the agents, with whom they have long done business. Sometimes the buyers and sellers are not individuals at all, but shell companies, opaque investment structures often designed to conceal identity.\n “Very rarely is anybody buying a $5 million painting as a person because they don’t buy anything else that way,” said Cristin Tierney, a New York gallerist.\n And once works are purchased, many of them, including some of the world’s most expressive and expensive, end up  hidden away in cavernous, nondescript, tax-sheltered free ports, their whereabouts largely unknown.\n “The variety of frauds in the art world is almost infinite and that is facilitated by the fact that the art world operates with a secrecy that no other investor would dream of operating in,” said Herbert Lazerow, a professor at the University of San Diego School of Law.\n  Now the federal government is considering using a law designed to combat money laundering at financial institutions to further regulate the art market. The law, the  Bank Secrecy Act, requires banks to report cash transactions of more than $10,000, highlight suspicious activity and understand the identity of their customers and where their wealth comes from.\n Congress has  already authorized Treasury officials to tailor the regulations to fit the antiquities market, which has long been burdened by worries about illicit artifacts trafficked from countries like Syria and Iraq. Now dealers of ancient treasures like Roman marble statues or Egyptian reliefs will be treated like financial institutions, and federal regulators will study whether the restrictions should be extended to the broader art market.\n Antiquities dealers are concerned about the cost of complying with the so-called AML (anti-money laundering) regulations. They say they already know their customers well enough to know they are not engaged in illicit activities.\n Randall Hixenbaugh, a New York antiquities dealer, complained that small businesses would be forced to hire compliance officers. “I can’t even afford to hire a full-time assistant in this horrible economic climate,” he said in an email.\n  If the new strictures are extended to the much broader art market, dealers and auction houses would likely be required by law to determine who the actual owners are, even pierce the veils of shell companies.\n Christie’s said it “welcomes the opportunity to work with U.S. regulators on appropriate and enforceable” guidelines. Sotheby’s said it “has long-established due diligence procedures and will comply with all applicable laws and regulations.”\n Auction houses have already responded to the changes in Europe with more thorough vetting of their customers in the United States, too. Christie’s says sellers at its New York auctions must fully disclose their identity. For buyers, it says it verifies the identity of any agent and works to identify the sources of funds when there is any suggestion of risk.\n But last year, Senate investigators found gaps in the policies the art market now has in place. Auction houses and dealers  were cited for having allowed two Russian oligarchs, close to President Vladimir V. Putin and under sanctions, to buy and sell art using shell companies fronted by an art adviser. The subcommittee concluded that the auction houses, in transactions between 2011 and 2019, did not determine who the real owners were despite professing to have adopted safeguards.\n Senator Rob Portman, an Ohio Republican and a sponsor of the report, said  “the art industry cannot be trusted to self-police.”\n “While the auction houses claimed to have robust anti-money laundering programs, we found that the actual employees who facilitated the transactions never asked who the art intermediary was buying the painting for or where the money was coming from,” he said in a statement.\n Even if the tighter rules were adopted, the names of buyers and sellers would not become public. But dealers and auction houses would need to determine who they are dealing with in case of law enforcement inquiry.\n  How much money laundering involves art? No one seems to have quantified it, though many experts agree the art market is  a natural place for it to flourish. “Pieces are portable, there is a high level of secrecy around who owns what and the value that they’re paying, and it’s debatable in some ways,” said Nienke Palstra, a researcher at Global Witness.\n Still, the number of prosecutions that have been made would not, by itself, suggest the problem is ubiquitous.\n In a typical case, someone uses illicit profits to purchase art, parking the money there until a later sale results in “clean” money with a legitimate pedigree. A famous case concerns the financier Jho Low, who  prosecutors say helped siphon billions of dollars from a Malaysian government fund employing a network of bank accounts and shell companies. He then laundered the money, prosecutors say, via a spending spree on things like art. In 2014, a Cayman Island company he owned received a $107 million  loan from Sotheby’s using some of the art as collateral. (Mr. Low denied any wrongdoing and remains at large.)\n  Sotheby’s and Christie’s said they stopped doing business with him once they knew he was under investigation. They were not accused of wrongdoing.\n Some experts say enforcement efforts have simply been too anemic to detect laundering, and that the size of the problem will become apparent if dealers and auction houses are required to report suspicious activities.\n “You don’t know what you don’t know,” said Peter D. Hardy, a former U.S. prosecutor.\n Advisers to collectors say they also do not believe that the opacity of art transactions has led to major cheating on the reporting of capital gains, even though dealers have no obligation to provide independent reporting of sales to the government.\n “Collectors are savvy business people of prominent standing in their communities,” said Michael Plummer, principal at an art management and investment firm in New York, “and advised by sophisticated tax and legal professionals — saving tax dollars by not reporting capital gains and committing outright tax fraud is just not worth the risk to their other business and social interests.”\n In cases where people fail to report the profits from art sales, some advisers think the banking system is able to flag possible tax evasion. But other experts said the ranks of I.R.S. and other regulators were too thin to follow up on the millions of banking alerts that come in each year.\n “They get so many reports, they could not possibly follow up on all of them,” said Julie A. Hill, a University of Alabama School of Law professor.\n  Four months after his arrest, Ronald Belciano returned to I. Brewster &amp; Co., the Philadelphia gallery where, investigators said, he had bought the art he used to launder money.\n But he was not there to shop for himself. Instead, he introduced the gallery owner, Nathan Isen, to Lisa, who he identified as a drug dealer with lots of cash to spend on art, according to court records.\n  “Like, I’m willing to invest in stuff like this, but this I don’t know,” she said, according to a transcript of their conversation. “I don’t know how to sell this. Cars, other things I can get rid of easy. Like this I’m nervous about.”\n “It’s different than selling a car,” he said, “’cause car has to have the registration, the title, and this and that and everything. … These are nothing. … These could have been, these could have been your grandmother’s. You follow me?”\n “So I can say, ‘hey, this is stuff that I inherited not that I bought,’” Lisa asked.\n “Right. ‘I found it at a thrift store, they were $10 a piece,’” Mr. Isen replied.\n Mr. Isen had not been accused of wrongdoing in Belciano’s case and has denied knowing Mr. Belciano was using the art to launder money, but as a result of his conversations with Lisa, who was an undercover agent wearing a wire, he would later be charged with money laundering and plead guilty in 2015. He was sentenced to 320 hours of community service and received a $15,000 fine.\n A week after their first conversation, Lisa returned to Mr. Isen’s gallery to buy 12 Salvador Dalí lithographs for $20,000. She had the cash in a brown paper bag. It smelled of drugs, she told the gallerist, because she kept it with her marijuana stash.\n He told her she was not getting an invoice for her purchases, according to the court papers.\n “No invoices? Cool,” she replied. “No receipt, no invoice, I’m good with that. That’s the way I like to do business.”", "posttime": "2021-06-20 12:30:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,美国,购买,launderers", "title": "因为洗钱者购买Dalís，美国看着艺术销售面纱 ", "title_en": "As Money Launderers Buy Dalís, U.S. Looks at Lifting the Veil on Art Sales", "transed": 1, "url": "https://www.nytimes.com/2021/06/19/arts/design/money-laundering-art-market.html", "via": "", "real_tags": ["艺术", "美国", "购买"]}, {"category": "", "categoryclass": "", "imagename": "de1f3593eda68ac27964434658234910.png", "infoid": 1066981, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Hardware里面是控制器的PCB文件，基于ESP32，搭载MPU6050，通过CAN总线连接驱动器。\n Structure里面是车身结构设计文件，step是Fusion导出的可能有些BUG，建议直接下载这个Fusion360的工程在软件里打开： https://a360.co/2TOtZRd\n 软件部分由于涉及到FOC驱动器的耦合并不是通用的所以暂时未放出，不过我后面会开源一个包括源码的迷你简化版的自行车完整方案（使用小型直流电机），大家可以等待一阵子。\n 另外，我正在整理一个机器人嵌入式开发框架（REF），会统一抽象出机器人开发中常用的一些工具和开发模式，到时候也会单独更新一个仓库。\n 修改仓库属性不小心把star都弄没了哭...各位同学劳烦再小手点一下星星~ 😘 ", "note_en": "Hardware里面是控制器的PCB文件，基于ESP32，搭载MPU6050，通过CAN总线连接驱动器。\n Structure里面是车身结构设计文件，step是Fusion导出的可能有些BUG，建议直接下载这个Fusion360的工程在软件里打开： https://a360.co/2TOtZRd\n 软件部分由于涉及到FOC驱动器的耦合并不是通用的所以暂时未放出，不过我后面会开源一个包括源码的迷你简化版的自行车完整方案（使用小型直流电机），大家可以等待一阵子。\n 另外，我正在整理一个机器人嵌入式开发框架（REF），会统一抽象出机器人开发中常用的一些工具和开发模式，到时候也会单独更新一个仓库。\n 修改仓库属性不小心把star都弄没了哭...各位同学劳烦再小手点一下星星~ 😘", "posttime": "2021-06-20 12:30:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "衣着,bike,开发", "title": "玄自行车：自行骑行，无衣着自行车 ", "title_en": "XUAN-Bike: Self-riding, riderless bike", "transed": 1, "url": "https://github.com/peng-zhihui/XUAN-Bike", "via": "", "real_tags": ["衣着", "bike", "开发"]}]