[{"category": "", "categoryclass": "", "imagename": "1b519358da1eaeaecb2008f7a313ad67.png", "infoid": 1067235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook的Clubhouse竞争对手，现场音频室，正在进行状态。该公司今天宣布，一些基于美国的公众数据以及某些团体，可以通过主Facebook iOS应用程序开始托管室。 （然而，允许的倾听者数量没有上限 - 俱乐部会所的主要镜头，这会限制房间尺寸限制。\n 它还引入了其他漂亮的功能，如通知当您的朋友或追随者加入房间以及Live Tablions时。将有一个“举手”按钮来请求加入对话，并可在整个聊天中进行交互。 Twitter Spaces，Twitter的Live Audio功能，包括标题，但俱乐部仍然没有。\n 在组中，管理员可以控制允许谁创建一个房间：主持人，团体成员或其他管理员。公共组合聊天将在本集团外部和外部访问，但私有组聊天将仅限于成员。此外，主机还可以选择非营利组织或租金，以便在与按钮进行对话期间支持，以直接捐赠聊天。同样，这感觉就像一个直接构建的功能，以解决关键的俱乐部用例并使其无摩擦。 （许多俱乐部创作者在应用程序上托管了筹款人，但必须将人们指向外面的联系，以便于捐款。）\n   此外，Facebook正在在平台上提供播客，确认早期的边缘报告。人们将能够通过迷你员或全屏播放器来侦听播客，其中包含各种播放控制，包括在屏幕关闭时侦听的能力。他们可以找到特定播客创造者的页面以及新闻源的节目，他们可以反应，评论，书签和分享他们的最爱。 Facebook团队表示计划在今年夏天晚些时候推出自动标题，以及侦听功能，侦听器可以创建和分享他们喜欢的剪辑。\n Spotify首次推出自己的现场音频应用程序，Greenthach后，所有这些功能都只有几天的时间;舞台渠道起来三个月起来;红德谈时四个月; Twitter发射空间后大约七个月;俱乐部首次发布后大约15个月。据报道，LinkedIn和Slack涉及他们自己的音频产品版本，即使下载和俱乐部本身周围的嗡嗡声已经过分衰落。\n   与俱乐部不同意，通过给予他们对硅谷热门镜头的听觉访问，Facebook希望将更广泛的影响者施放了一个带有现场音频室的更广泛。在发布会上有权访问该功能的名称公众人物中将成为音乐家（Tokimonsta，D Smoke，Kehlani）;媒体数字（Joe Budden，Deray McKesson）;和运动员（Russell Wilson，Omareloff）。 Joe Budden还将通过Facebook分发他的播客。\n 音频室可能是或可能不是真正的持续力量的功能，但Facebook似乎意图在广泛投资。 ", "note_en": "Facebook’s Clubhouse competitor,  Live Audio Rooms, is making its way stateside. The company announced today that some US-based public figures, as well as certain groups, can start hosting rooms through the main Facebook iOS app. (People can join, however, from both iOS and Android.) Anyone can be invited up as a speaker with up to 50 people able to speak at once. There’s no cap on the number of listeners allowed in — a major shot at Clubhouse, which imposes room size limitations.\n It’s also introducing other nifty features, like notifications when your friends or followers join a room, as well as live captions. There will be a “raise a hand” button to request to join the conversation, and reactions will be available to to interact throughout the chat. Twitter Spaces, Twitter’s live audio feature, includes captions, but Clubhouse still does not.\n Within groups, admins can control who’s allowed to create a room: moderators, group members, or other admins. Public group chats will be accessible both in and outside the group, but private group chats will be restricted to members. Additionally, hosts can also select a nonprofit or fundraiser to support during their conversation with a button to directly donate showing up on the chat. Again, this feels like a feature directly built to address a key Clubhouse use case and make it frictionless. (Many Clubhouse creators have hosted fundraisers on the app but have to direct people to outside links in order to facilitate donations.)\n   Additionally, Facebook is making podcasts available on the platform, confirming earlier   Verge reporting. People will be able to listen to podcasts through either a mini-player or a full-screen player with various playback controls, including the ability to listen while the screen is off. They’ll be able to find shows on specific podcast creators’ Pages, as well as in the News Feed, and they can react to, comment, bookmark, and share their favorites. The Facebook team says it plans to roll out automatic captioning later this summer, as well as a clips feature where listeners can create and share their favorite clips.\n All these features come  just days after Spotify debuted its own live audio app, Greenroom;  three months since Stage Channels came to Discord;  four months after Reddit Talk; roughly  seven months after Twitter launched Spaces; and about 15 months after Clubhouse first launched.  LinkedIn and  Slack are, reportedly, working on their own versions of an audio product, even as  downloads of and  buzz around Clubhouse itself have waned considerably.\n   Unlike Clubhouse, which drew in early listeners by giving them auditory access to Silicon Valley hot shots, Facebook is hoping to cast a broader net of influencers with Live Audio Rooms. Among the named public figures who will have access to the feature on launch will be musicians (TOKiMONSTA, D Smoke, Kehlani); media figures (Joe Budden, DeRay Mckesson); and athletes (Russell Wilson, Omareloff). Joe Budden will also distribute his podcast through Facebook.\n Audio rooms may or may not be a feature with real staying power, but Facebook seems intent on investing broadly in the space.", "posttime": "2021-06-22 00:50:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,推出,launches,功能", "title": "Facebook推出其俱乐部克隆 ", "title_en": "Facebook Launches Its Clubhouse Clone", "transed": 1, "url": "https://www.theverge.com/2021/6/21/22540508/facebook-live-audio-rooms-clubhouse-rival-spaces-greenhouse", "via": "", "real_tags": ["facebook", "推出", "launches", "功能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个想法：只要你的CI从主分支构建代码，请不要抛弃构建结果：改为发布。这使得QA工程师或错误记者提供新的构建来易于尝试。\n  我第一次在工作中经历了这个设置，我们使用Jenkins。 Jenkins不是我首选的CI系统，而是为了获得信用，它使其超级易于实现此功能：添加步骤来归档工件，或者使用ArchiveARtifacts Pipeline命令。\n 我们实际上为所有在工作中的构建执行此操作，不仅是主分支构建。它使我们的QA工程师的生活更容易。我们的工作流程如下所示：\n 当开发人员考虑它准备QA时，QA工程师下载PR构建生成的工件并使用它们来验证工作。\n  我认为将类似于我自己的项目的东西是一个很好的想法，这些项目在Github上托管并使用Gi​​tHub CI。\n 我预计这样的功能可以随时可用，但我找不到我想要的东西。 GitHub提供了一种从建筑物中下载文物的方法，但它并不理想：\n 伪像在一个大的zip中捆绑在一起，在构建多平台应用时，这是不方便的：没有人想要下载一个包含相同应用程序的acos，windows和linux应用程序。 \n一些项目使用标签来生产主分支构建，但我不喜欢这个想法。叫我一个纯票，但是使用标签，这种方式感觉像对概念来补偿丢失的github功能。\n 由于我托管vps上的博客，我最终做了什么正在vps上建立一个子域（builds.agateau.com），并将github上传到我的服务器上的ssh。\n  我设置的第一件事是HTTP服务器提供文件。在我的注册商上添加子域后，我在我的vps上创建了一个目录，并配置了nginx，以便访问＆＃34; builds.agateau.com＆＃34;可以使用nginx花式索引模块浏览和下载此目录的内容。\n   然后我在vps上创建了一个构建用户，在/srv/builds.agateau.com/html中创建了一个目录，并使构建用户成为这些目录的所有者，以便它可以写入它们。\n 最后，我为此用户创建了一个SSH键，以便GitHub Builder可以连接到它。\n  我研究了SSH上传的现有GitHub操作，但它只对SCP呼叫感到过度矫枉过正。相反，我决定保持简单：我的构建将调用shell脚本来进行上传。无论如何，我更喜欢将依赖关系保持在最小，这使得在本地测试构建脚本，而不是使用Commit-Push-and-and-34;工作流程＆＃34;\n  ＃！/ bin / bash set -euo pipefail progname = $（basename $ 0）die（）{echo＆＃34; $ progname：$ *＆＃34; ＆gt; ＆amp; 2出口1}＃检查$ 1是定义的，而不是emptycheck_var（）{local name = $ 1如果！ env | Grep -Q＆＃34; ^ $名称= .. *＆＃34; ;然后死亡＆＃34;环境变量$名称未设置或为空＆＃34; fi}用法（）{如果[＆＃34; $ *＆＃34; ！！ =＆＃34;＆＃34; ];然后回声＆＃34;错误：$ *＆＃34;回声FI猫＆lt;＆lt; EOF使用率：$ progname [选项...]＆lt; project＆gt; ＆lt; build_file＆gt; [build_file ...]上载使用scp构建一个器件到服务器。文件是上载到构建/＆lt; project＆gt; /。期望设置以下环境变量： -  Upload_Username  -  Upload_Private_Key  -  Upload_Hostname选项：-h，--help显示此用法消息和退出EOF Exit 1} Project =＆＃34;＆＃34;＆＃34; build_files =＆＃34;＆＃34;虽然[$＃-gt 0];案例＆＃34; 1美元＆＃34;在-h |  -  help）使用; -  *）使用＆＃34;未知选项＆＃39; $ 1＆＃39;＆＃34; ;; *）如果[-Z＆＃34; $项目＆＃34; ];然后项目=＆＃34; 1美元＆＃34; else build_files =＆＃34; $ build_files $ 1＆＃34; fi ;;如果[-z＆＃34; $ build_files＆＃34; ];然后用法＆＃34;没有足够的争论＆＃34; ficheck_var upload_usernamecheck_var upload_private_keycheck_var upload_hostname echo＆＃34;上传＆＃34; eval $（SSH-代理）回声＆＃34; $ upload_private_key＆＃34; | ssh-add -scp -o＆＃34; stricthostkeychecking＆＃34; $ build_files＆＃34; $ upload_username @ $ upload_hostname：builds / $ project /＆＃34; \n不可否认，它＆＃39;对于简单的SCP呼叫有点久，但是，它是因为我更喜欢至少添加至少一定量的doc，参数解析和处理到此类脚本。我发现它有助于在6个月后重新审视它们时（我前段时间在我的shell脚本模板中写道，如果您有兴趣）。\n 此脚本获取项目的名称，该项目与服务器上创建的目录匹配，以及上传文件。通过环境变量提供敏感信息（用户名，主机名和私钥）。\n 注意：我不得不禁用主机键检查（-o＆＃34; stricthostkeychecking＆＃34; scp调用中的选项），因为我无法弄清楚如何将主机键作为参数或环境变量传递。我相信这种情况，它赢得了＆＃39; t太糟糕了，可能发生的情况是，有人管理窃取帐户公钥并上传到他们的服务器而不是我的服务器。仍然是我喜欢能够通过主机键。如果你知道如何做到这一点，我很乐意收到你的来信！\n  我连接到项目github管理页面，并将用户名，主机名和私钥声明为github加密的秘密。\n 现在所做的一切都是从Github构建工作流程调用上传构建脚本。\n 以下是Git Bonsai构建工作流程，显示如何在每个推送到主分支后调用上传 - 构建。\n 名称：版本：[推，pull_request]作业：构建：策略：Fail-Fast：False Matrix：OS： -  Ubuntu-18.04  -  MacOS-10.15  -  Windows-2019 runs-on：$ {{romix.oS}}默认值：shell：bash步骤： - 用途：操作/ [电子邮件保护]  - 名称：build运行：ci / build-app  - 名称：运行静态检查运行：ci / run-static-checks  -  name：运行测试运行： CI / Run-Tests  - 名称：Create Archive Run：CI / Create-Archive  - 名称：上传IF：GitHub.ref ==＆＃39; refs / heads / master＆＃39;运行：CI / Upload-Build Git-Bonsai Artifacts / *。BZ2 ENV：Upload_Username：$ {{secrets.upload_eusername}} upload_private_key：$ {{secrets.upload_private_key}} upload_hostname：$ {{secrets.upload_hostname}} \n服务器端需要最后一件事：为确保服务器磁盘没有充满构建，并且构建列表页面不会变得太长，我添加了一个清理脚本，以保持每个项目的最新30个构建。此脚本每天都运行。\n 在这里，它再次它＆＃39;因为参数解析而比人们所期望的时间长一点：\n ＃！/ bin / bash set -euo pipefail progname = $（basename $ 0）root_dir = / srv / builds.agateau.com / html max_builds = 30＃verbose命令默认cmd =＆＃34; rm -v＆＃34; quiet_cmd =＆＃34; rm＆＃34; dry_run_cmd =＆＃34;回声将删除＆＃34; clean_project_dir（）{local project_dir =＆＃34; 1美元＆＃34; ls  -  ssort time --reverse＆＃34; $ project_dir＆＃34; \\ | awk＆＃39; nr＆gt; ＆＃39; $ max_builds＆＃39; {打印$ 1}＆＃39; \\ |虽然读名称为$ cmd＆＃34; $ project_dir / $ name＆＃34;完成}用法（）{如果[＆＃34; $ *＆＃34; ！！ =＆＃34;＆＃34; ];然后回声＆＃34;错误：$ *＆＃34;回声FI猫＆lt;＆lt; EOF使用率：$ progname [选项...]删除旧构建工件。选项：-h，--help显示此用法消息和退出-q，--quiet工作静默 - 运行打印将被删除，而不是删除任何EOF退出1}而[$＃-gt 0];案例＆＃34; 1美元＆＃34;在-h |  -  help）使用; -q | --quiet）cmd =＆＃34; $ quiet_cmd＆＃34;转移  ;; - 运行）cmd =＆＃34; $ dry_run_cmd＆＃34;转移  ;; -  *）使用＆＃34;未知选项＆＃39; $ 1＆＃39;＆＃34; ;; *）使用＆＃34;太多争论＆＃34; ;;在$ root_dir / * /中为project_dir完成esac; do clean_project_dir＆＃34; $ project_dir＆＃34;完毕\n  要使构建网站看起来有点漂亮，我配置了花式索引模块来使用平面主题。我还在降序订单中制作了它列表构建，以便最新版本始终位于页面的顶部。\n 它，你可以看看它：https://builds.agateau.com/。现在只有两个项目，我计划将来增加更多。\n  我很高兴我花了一些时间设置这个神器上传系统，因为它已经证明了让错误记者在报告问题后确认修复。让我知道这是否对您有用，或者您是否知道发布构建工件的更简单的解决方案。 ", "note_en": "The idea: whenever your CI builds the code from your main branch, do not ditch the build results: publish them instead. This makes it easy to provide QA engineers or bug reporters with new builds to try.\n  I first experienced this setup at work, where we use Jenkins. Jenkins is  not my preferred CI system, but to its credit, it makes it super easy to implement this feature: add a step to archive artifacts, either using the GUI or using the  archiveArtifacts pipeline command.\n We actually do this for all builds at work, not only master branch builds. It makes the life of our QA engineers much easier. Our workflow looks like this:\n when developers consider it ready to QA, QA engineers download the artifacts produced by the PR build and use them to validate the work.\n  I thought it would be a good idea to setup something similar for my own projects, which are hosted on GitHub and use GitHub CI.\n I expected a feature like this to be readily available, but I could not find exactly what I wanted. GitHub provides a way to download artifacts from a build but it&#39;s not ideal:\n Artifacts are all bundled together in a big zip, which is inconvenient when building multi-platform apps: no-one wants to download a single archive containing the same application for macOS, Windows and Linux.\n Some projects use tags to produce main branch builds, but I don&#39;t like this idea. Call me a purist, but using tags that way feels like subverting the concept to compensate for a missing GitHub feature.\n Since I host my blog on a VPS, what I ended up doing is setting up a subdomain for builds on the VPS ( builds.agateau.com) and making GitHub upload artifacts to my server over SSH.\n  The first thing I set up was the HTTP server to serve the files. After adding the subdomain on my registrar, I created a directory on my VPS and configured Nginx so that users visiting &#34;builds.agateau.com&#34; would be able to browse and download the content of this directory, using the  Nginx Fancy Index module.\n   I then created a  build user on the VPS, created one directory per project in  /srv/builds.agateau.com/html and made the  build user the owner of these directories so that it can write to them.\n Finally I created an SSH key for this user, so that the GitHub builder can connect to it.\n  I looked into existing GitHub actions for SSH uploads but it all felt overkill for just an  scp call. Instead I decided to keep it simple: my build is going to call a shell script to do the upload. I prefer keeping dependencies with the CI to a minimum anyway, it makes it easier to test build scripts locally instead of using the commit-push-and-pray &#34;workflow&#34;.\n  #!/bin/bash set -euo pipefail PROGNAME = $(basename  $0 )die ()  {  echo  &#34; $PROGNAME :  $* &#34; &gt; &amp; 2  exit  1 } # Check $1 is defined and not emptycheck_var ()  {  local  name = $1  if ! env  | grep -q  &#34;^ $name =..*&#34;  ;  then die  &#34;Environment variable  $name  is not set or is empty&#34;  fi }usage ()  {  if  [  &#34; $* &#34; ! =  &#34;&#34;  ]  ;  then  echo  &#34;Error:  $* &#34;  echo  fi cat  &lt;&lt; EOF Usage: $PROGNAME [OPTION ...] &lt;project&gt; &lt;build_file&gt; [build_file...] Uploads build artifacts to a server using scp. Files are upload to builds/&lt;project&gt;/. Expects the following environment variables to be set: - UPLOAD_USERNAME - UPLOAD_PRIVATE_KEY - UPLOAD_HOSTNAME Options:  -h, --help display this usage message and exit EOF  exit  1 } project = &#34;&#34; build_files = &#34;&#34; while  [  $# -gt  0  ]  ;  do  case  &#34; $1 &#34; in -h |--help ) usage  ;; -* ) usage  &#34;Unknown option &#39; $1 &#39;&#34;  ;; * )  if  [ -z  &#34; $project &#34;  ]  ;  then  project = &#34; $1 &#34;  else  build_files = &#34; $build_files   $1 &#34;  fi  ;;  esac  shift done if  [ -z  &#34; $build_files &#34;  ]  ;  then usage  &#34;Not enough arguments&#34; ficheck_var UPLOAD_USERNAMEcheck_var UPLOAD_PRIVATE_KEYcheck_var UPLOAD_HOSTNAME echo  &#34;Uploading&#34; eval  $(ssh-agent ) echo  &#34; $UPLOAD_PRIVATE_KEY &#34;  | ssh-add -scp -o  &#34;StrictHostKeyChecking off&#34;  $build_files  &#34; $UPLOAD_USERNAME @ $UPLOAD_HOSTNAME :builds/ $project /&#34;\n Admittedly, it&#39;s a bit long for a simple  scp call, but that&#39;s because I prefer adding at least a minimum amount of doc, argument parsing and error handling to such scripts. I find that it helps when revisiting them 6 months later (I wrote about my  shell script template some time ago if you are interested).\n This script takes the name of the project, which matches the directory created on the server for it, and the files to upload. Sensitive information (username, host name and private key) is provided through environment variables.\n Note: I had to disable host-key checking (the  -o &#34;StrictHostKeyChecking off&#34; option in the  scp call) because I could not figure out how to pass the host key as an argument or environment variable. I believe in that case it won&#39;t be too bad, the worse that could happen is someone managing to steal the account public key and uploading builds to their server instead of mine. Still I&#39;d prefer to be able to pass the host key. If you know how to do this, I would love to hear from you!\n  I connected to the project GitHub admin page and declared the username, host name and private keys as  GitHub encrypted secrets.\n Now all that was left to do was to call the  upload-build script from the GitHub build workflow.\n Here is  Git Bonsai build workflow, showing how to call  upload-build after each push to the master branch.\n name :  Build on :  [ push ,  pull_request ] jobs :  build :  strategy :  fail-fast :  false  matrix :  os :  -  ubuntu-18.04  -  macos-10.15  -  windows-2019  runs-on :  ${{ matrix.os }}  defaults :  run :  shell :  bash  steps :  -  uses :  actions/ [email protected]  -  name :  Build  run :  ci/build-app  -  name :  Run static checks  run :  ci/run-static-checks  -  name :  Run tests  run :  ci/run-tests  -  name :  Create archive  run :  ci/create-archive  -  name :  Upload  if :  github.ref == &#39;refs/heads/master&#39;  run :  ci/upload-build git-bonsai artifacts/*.bz2  env :  UPLOAD_USERNAME :  ${{ secrets.UPLOAD_USERNAME }}  UPLOAD_PRIVATE_KEY :  ${{ secrets.UPLOAD_PRIVATE_KEY }}  UPLOAD_HOSTNAME :  ${{ secrets.UPLOAD_HOSTNAME }}\n  One last thing was required on the server side: to ensure the server disk does not get filled with builds and the build list page does not become too long to load, I added a cleanup script to keep only the latest 30 builds for each project. This script runs every day.\n Here it is, once again it&#39;s a bit longer than what one would expect because of argument parsing:\n #!/bin/bash set -euo pipefail PROGNAME = $(basename  $0 ) ROOT_DIR =/srv/builds.agateau.com/html MAX_BUILDS = 30 # Verbose command by default CMD = &#34;rm -v&#34; QUIET_CMD = &#34;rm&#34; DRY_RUN_CMD = &#34;echo Would delete &#34;clean_project_dir ()  {  local  project_dir = &#34; $1 &#34; ls --sort  time --reverse  &#34; $project_dir &#34;  \\  | awk  &#39;NR &gt; &#39; $MAX_BUILDS &#39; { print $1 }&#39;  \\  |  while  read name  do  $CMD  &#34; $project_dir / $name &#34;  done }usage ()  {  if  [  &#34; $* &#34; ! =  &#34;&#34;  ]  ;  then  echo  &#34;Error:  $* &#34;  echo  fi cat  &lt;&lt; EOF Usage: $PROGNAME [OPTION ...] Delete old builds artifacts. Options: -h, --help display this usage message and exit -q, --quiet work silently --dry-run print what would be deleted instead of deleting anything EOF  exit  1 } while  [  $# -gt  0  ]  ;  do  case  &#34; $1 &#34; in -h |--help ) usage  ;; -q |--quiet )  CMD = &#34; $QUIET_CMD &#34;  shift  ;; --dry-run )  CMD = &#34; $DRY_RUN_CMD &#34;  shift  ;; -* ) usage  &#34;Unknown option &#39; $1 &#39;&#34;  ;; * ) usage  &#34;Too many arguments&#34;  ;;  esac done for project_dir in  $ROOT_DIR/*/  ;  do clean_project_dir  &#34; $project_dir &#34; done\n  To make the builds site look a bit nicer, I configured the Fancy Index module to use the  Flat theme. I also made it list builds in descending date order, so that the latest builds are always at the top of the page.\n That&#39;s it, you can have a look at it here:  https://builds.agateau.com/. There are only two projects for now, I plan to add more in the future.\n  I am happy I spent some time setting up this artifact upload system as it has proved useful to let bug reporters confirm a fix after they reported an issue. Let me know if this was useful to you, or if you know of simpler solutions to publish build artifacts.", "posttime": "2021-06-22 00:49:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,publishing,构建", "title": "自动发布您的构建工件 ", "title_en": "Automatically publishing your build artifacts", "transed": 1, "url": "https://agateau.com/2021/automatically-publishing-your-build-artifacts/", "via": "", "real_tags": ["发布", "构建"]}, {"category": "", "categoryclass": "", "imagename": "8ba41e0b008abde46e41f5c9e01a86db.jpg", "infoid": 1067233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是美国中世纪历史上的博士学生。我的讲话涉及美国的历史博士节目。如果你认为这是虚伪的，那就这样。\n 人文博士仍然是一个职业学位，为学生做好学科职业教学，而且没有工作。历史上没有博士学位。\n 看，我得到它。在Askhistorians的所有人中，我得到它。你不要＆＃39; t＆＃34;爱情历史;＆＃34;你喜欢你灵魂中的一切的历史，你读出你的子场外的历史书籍以获得乐趣，你花了90％的空闲时间试图让其他人尽可能多地爱历史，甚至四分之一甚至是一个季度只是想一想几分钟，你的一天是做出的。我得到它。\n 你有教授＆＃39; S告诉你你＆＃39;重复教学学院。你有一位向你保证你的教授＆＃39;重新出现并将成功。你有一个刚刚获得博士学位的朋友，并在加州大学洛杉矶分校工作。你不需要一个R1学校;你只是想教导你＆＃39; D与一个小的4年的自由艺术大学职位良好。\n 您＆＃39;在空气床垫上睡了四个或六个生存一年，并享受贫困卷饼，并工作三个兼职工作，以支付本科生。你＆＃39;再担心更多。哎呀，一个博士学位看起来像一个薪水。或者也许你有愿意介入的父母或祖父母，也许你没有从本科贷款偿还。\n 它并不重要。你不是例外。不要在历史或任何相关领域获得博士学位。\n 没有工作。历史就业市场于2008年坠毁，2011-12次恢复了一点......然后消失了。这是aha的图表。 300个全职工作，1200个新博士。加上前几年的所有人没有工作，并且具有比你更多的出版物。加上所有当前的捕鱼教授，他们拥有更多的出版物，连接和经验。减去不在您领域的所有工作。减去用于在其他地方有权的高级教授专门的所有工作。你的模糊子场不会拯救你。博物馆工作可能更具竞争力，您不会有经验或技能。没有工作。 \n因此，您的工作选项是垃圾。兼容工作是不可行的薪酬，没有福利，可再生但不能保证，并且即使涉及更高的课程课程，也消失了。 ＆＃34; postdocs＆＃34;有一个任期赛道工作的所有责任为一半的工资（如果你＆＃39;幸运的话），可能没有好处，哦，是的，你可以在1  -  3年内再次寻找工作。世界的某个地方。这是一个真正的职位广告。事实上，您的工作选择垃圾。\n ＆＃39;对女性更糟糕。因素包括：学生对浪潮更高度的男性教授更高。妇女正在社交劳动，致力于情绪劳动和＆＃34;请注意没有其他人正在做的任务＆＃34;并这样做，因为他们必须要完成。女性使用产假成为母亲;父亲使用亲子休假进行研究。疯狂的性骚扰率，包括毕业生和eni管理员，积极保护男性教授。每个阶梯的女性教师跌落的百分比是由于所有这些因素所屈服的职业阶梯。我不知道对颜色或妇女的颜色或妇女的男性（或其他性别教师）的研究，但我想象它并不是任何人的好照片。\n  历史注册正在崩溃，因为学生在高中担任历史要求（如果甚至仍然是一个）作为GPA提升，更强大的大学应用程序的AP /双重入学，并释放（美国）UNI的课堂选项。\n 学校没有取代退休教师。他们将任职线转换为辅助点，或者更常见，只需要现有的教师教授更多课程。\n 更老的教师可以＆＃39;不起，或者不想要。甚至被问及他们是否计划退休，甚至被问及更老的教师，即使它们是否无法进行教学课程。\n 历史博士不会让你对其他工作更具吸引力。您将具有惊人的软技能，但公司希望硬盘。不止于此，他们想要直接经验，你不会有。博士可能让你回归和＃34;过度资格，＆＃34;或者自动取消资格，因为公司/学区规则需要更高的PHDS薪水。\n 在学术界的其他工作？老实说，你是否认为其他1200个新博士赢得了育空中间的研究图书馆队？你真的觉得他们中的一些人赢得了＆＃39; t有mlis学位，并花了他们的博士时间得到特殊的收藏体验吗？你想在一份工作中规划你的博士，每年可能有一个开放吗？哦！或者您可以在学术管理中工作，并尽可能喜欢帮助当前的毕业生犯有你的错误。 \n你不是例外。 50％的人文学生在获得博士之前辍学。 50％的博士学生承认遭受抑郁症，焦虑和其他心理健康问题（50％的博士学生撒谎）。学术界的人比跳伞者更多。辍学或留在，你＆＃39; LL已经花了1-10岁，没有建立工作经验，薪水，退休储蓄，永久居住，正常的时间表，爱好。父母或配偶独立富裕？极好;再次享受历史悠闲制作历史博士＆＃39;职业。\n 您的计划不是例外。美国和u.k的计划目前正在授权对学生进行额外资金的承诺。大学正在改变截止日期，将当前的学生推出门，没有足够的时间来完成他们需要的研究或获得他们的技能，他们需要任何类型的历史职业工作，甚至是他们想要不同的工作，方面的经验这份工作。\n 我叫这个论文＆＃34的粗略草案;博士博士将摧毁你的未来，吃你的孩子。＆＃34;不，这不是要翻转的东西。历史上没有博士学位。\n ...但我也得到它，我知道对你们中的一些人来说，绝对没有我或任何人都可以说阻止你做出巨大糟糕的决定。而且我知道那个小组中的一些人来自本科学校，也许没有＆＃39; T有别人的声望，或者了解申请毕业生学校并获得它的教授。所以在评论中，我给出了我希望的建议，我希望我不会使用。\n 这杀了我写作。我喜欢历史。我花了我的空闲时间谈论Reddit的历史。我可以通过我找到大量的旧帖子说历史博士的所有原因都很好。不。它没有。你不是例外。您的计划不是例外。不要在人文科学中获得博士学位。 ", "note_en": "I am a PhD student in medieval history in the U.S. My remarks concern History PhD programs in the U.S. If you think this is hypocritical, so be it.\n The humanities PhD is still a vocational degree to prepare students for a career teaching in academia, and there are no jobs. Do not get a PhD in history.\n Look, I get it. Of all the people on AskHistorians,  I get it. You don&#39;t &#34;love history;&#34; you love history with everything in your soul and you read history books outside your subfield for fun and you spend 90% of your free time trying to get other people to love history as much as you do, or even a quarter as much, or even just think about it for a few minutes and your day is made. I get it.\n You have a professor who&#39;s told you you&#39;re perfect to teach college. You have a professor who has assured you you&#39;re the exception and will succeed. You have a friend who just got their PhD and has a tenure track job at UCLA. You don&#39;t need an R1 school; you just want to teach so you&#39;d be fine with a small, 4-year liberal arts college position.\n You&#39;ve spent four or six subsistence-level years sleeping on an air mattress and eating poverty burritos and working three part-time jobs to pay for undergrad. You&#39;re not worried about more. Heck, a PhD stipend looks like a pay  raise. Or maybe you have parents or grandparents willing to step in, maybe you have no loans from undergrad to pay back.\n It doesn&#39;t matter.  You are not the exception. Do not get a PhD in history or any of the allied fields.\n There are no jobs. The history job market crashed in 2008, recovered a bit in 2011-12...and then disappeared.  Here is the graph from the AHA. 300 full-time jobs, 1200 new PhDs. Plus all the people from previous years without jobs and with more publications than you. Plus all the current profs in crappy jobs who have more publications, connections, and experience than you. Minus all the jobs not in your field. Minus all the jobs earmarked for senior professors who already have tenure elsewhere. Your obscure subfield will not save you. Museum work is probably more competitive and you will not have the experience or skills. There are no jobs.\n Your job options, as such, are garbage. Adjunct jobs are unliveable pay, no benefits, renewable but not guaranteed, and *disappearing even though a higher percentage of courses are taught by adjuncts. &#34;Postdocs&#34; have all the responsibilities of a tenure track job for half the pay (if you&#39;re lucky), possibly no benefits, and oh yeah, you get to look for jobs all over again in 1-3 years. Somewhere in the world.  This is a real job ad. Your job options are, in fact, garbage.\n It&#39;s worse for women. Factors include: students rate male professors more highly on teaching evals. Women are socialized to take on emotional labor and to &#34;notice the tasks that no one else is doing&#34; and do them because they have to be done. Women use maternity leave to be mothers; fathers use paternity leave to do research. Insane rates of sexual harassment, including of grad students, and uni admins that actively protect male professors. The percentage of female faculty drops for each step up the career ladder you go due to all these factors. I am not aware of research for men of color or women of color (or other-gender faculty at all), but I imagine it&#39;s not a good picture for anyone.\n  History enrollments are crashing because students take their history requirement (if there even still is one) in high school as AP/dual enrollment for the GPA boost, stronger college app, and to free up class options at (U.S.) uni.\n Schools are not replacing retiring faculty. They convert tenure lines to adjunct spots, or more commonly now, just require current faculty to teach more classes.\n Older faculty can&#39;t afford to retire, or don&#39;t want to. Tenure protects older faculty from even being asked if they plan to retire, even if they are incapable of teaching classes anymore.\n A history PhD will not make you more attractive for other jobs. You will have amazing soft skills, but companies want hard ones. More than that, they want direct experience, which you will not have. A PhD might set you back as &#34;overqualified,&#34; or automatically disqualified because corporate/school district rules require a higher salary for PhDs.\n Other jobs in academia? Do you honestly think that those other 1200 new PhDs won&#39;t apply for the research librarianship in the middle of the Yukon? Do you really think some of them won&#39;t have MLIS degrees, and have spent their PhD time getting special collections experience? Do you want to plan your PhD around a job for which there might be one opening per year? Oh! Or you could work in academic administration, and do things like help current grad students make the same mistakes you did.\n You are not the exception. 50% of humanities students drop out before getting their PhD. 50% of PhD students admit to struggling with depression, anxiety, and other mental health issues (and 50% of PhD students are lying). People in academia drink more than  skydivers. Drop out or stay in, you&#39;ll have spent 1-10 years not building job experience, salary, retirement savings, a permanent residence, a normal schedule, hobbies. Independently wealthy due to parents or spouse? Fabulous; have fun making history the  gentlemen&#39;s profession again.\n Your program is not the exception. Programs in the U.S. and U.K. are currently reneging on promises of additional funding to students  in progress on their dissertations. Universities are changing deadlines to push current students out the door without adequate time to do the research they need or acquire the skills they&#39;d need for any kind of historical profession job or even if they want a different job, the side experience for that job.\n I called the rough draft of this essay &#34;A history PhD will destroy your future and eat your children.&#34; No. This is not something to be flip about.  Do not get a PhD in history.\n ...But I also  get it, and I know that for some of you, there is absolutely nothing I or anyone else can say to stop you from making a colossally bad decision. And I know that some of you in that group are coming from undergrad schools that maybe don&#39;t have the prestige of others, or professors who understand what it takes to apply to grad school and get it. So in comments, I&#39;m giving advice that I hope with everything I am you will not use.\n This is killing me to write. I love history. I spend my free time  talking about history on reddit. You can find plenty of older posts by me saying all the reasons a history PhD is fine. No. It&#39;s not.  You are not the exception. Your program is not the exception. Do not get a PhD in the humanities.", "posttime": "2021-06-22 00:49:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "得到,history", "title": "为什么你不应该得到历史博士 ", "title_en": "Why You Should Not Get a History PhD", "transed": 1, "url": "https://www.reddit.com/r/AskHistorians/comments/96yf9h/monday_methods_why_you_should_not_get_a_history/", "via": "", "real_tags": ["得到", "history"]}, {"category": "", "categoryclass": "", "imagename": "b4b7da2550a930d7606ecf78ec405dfa.jpeg", "infoid": 1067232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过一年加上冠状病毒引起的压力和无聊，许多美国人渴望再次旅行。\n 期待夏季旅行中的繁荣，Amtrak在旅行者中兴起了美国铁路通行证的重新启动。 Amtrak上周推出的票，让人们花一个月在Amtrak火车上花费了一个固定费用。\n 到6月22日，通行证是299美元，其通常价格为499美元。它不允许无限制的火车旅行 -  299美元超过30天内覆盖10个铁路段。\n 根据Amtrak的说法，当乘客离开火车时，一段旅行结束，所以一个连接的旅行将使用两个段，但是一个长期的骑行将只是一个段。 Amtrak＆＃39;最长的直接路线 - 就像芝加哥到圣安东尼奥 - 拉伸超过1000英里。\n      美国铁路通行者只适用于教练席位，并没有让乘客预订睡眠客舱或一流席位等高级住宿。鉴于一段可能花费数百美元，通用折价仍然是30美元的一段，提供了大量折扣。\n 例如，来自纽约到新奥尔良的1,377英里新月线上的一张往返机票可以越来越靠近500美元。美国铁路通行证将在那次独自旅行之后为自己付出代价。\n 买家在购买它后，使用美国铁路通过预订旅行120天，所以6月22日的折扣通行证将在10月下旬到期。他们有30天从他们第一次旅行时使用10个细分。 \n点击“注册”，您同意从Insider以及其他合作伙伴提供的营销电子邮件以及接受我们的服务条款和隐私政策。  形成一个＆＃39的两个交叉线; x＆＃39; 它表示封闭互动或解雇通知的方法。 ", "note_en": "After a year-plus of coronavirus-induced stress and boredom, many Americans are eager to travel again.\n Expecting a boom in summer travel, Amtrak is luring in travelers with the relaunch of its USA Rail Pass. The ticket, which Amtrak launched last week, allows people to spend a month crisscrossing the country on Amtrak trains for a flat fee.\n Through June 22, the pass is $299, 40% off its usual price of $499. It doesn&#39;t allow for unlimited train travel — the $299 covers 10 rail segments over 30 days.\n According to Amtrak, a segment of a trip ends when a passenger gets off a train, so a trip with one connection would use two segments, but one long ride would be only one segment. Amtrak&#39;s longest direct routes — like Chicago to San Antonio — stretch more than 1,000 miles.\n      The USA Rail Pass is good for only coach seats and doesn&#39;t let passengers book premium accommodations like sleeper cabins or first-class seats. Still, at $30 a segment, the pass offers massive discounts, given that one segment can cost hundreds of dollars.\n For instance, one round-trip ticket on the 1,377-mile Crescent line from New York to New Orleans can run you close to $500. The USA Rail Pass would pay for itself after that trip alone.\n Buyers have 120 days to book trips using their USA Rail Pass after purchasing it, so a discounted pass bought by June 22 would be good through late October. They have 30 days from the day of their first trip to use up the 10 segments.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n          Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-06-22 00:48:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,relaunches,旅行", "title": "Amtrak Relaunches美国铁路通行证 - 以299美元的价格旅行30天 ", "title_en": "Amtrak relaunches US Rail Pass – Travel the country for 30 days for $299", "transed": 1, "url": "https://www.businessinsider.com/amtrak-usa-rail-pass-discount-price-summer-travel-2021-6", "via": "", "real_tags": ["美国", "旅行"]}, {"category": "", "categoryclass": "", "imagename": "383a08b76ec2ee0372aa0e9086867d79.jpeg", "infoid": 1067231, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法院举行了一致的胜利，我在斗争中对阵NCAA的斗争中，它试图施加与教育有关的赔偿。\n 颁布的法官9-0确认降低法院裁决，阻止NCAA限制对运动员等物品的款项或对实习的赔偿金额限制。\n 最高法院周一举行一致的胜利，我将在他们对斗争的斗争中举行大学运动员，并试图施加与教育有关的赔偿。\n 法院投票9-0肯定了较低的法院裁决，发现反托拉斯法阻止了NCAA限制了乐器等物品的运动员的款项或作为实习的赔偿。这位司法官拒绝了NCAA＆＃39;它的参仇，它的球员＆＃39;如果他们可以获得薪酬，业余情况是不可能维持的，即使是有关的教育相关的费用。\n  ＆＃34;简单地说，这套套装涉及在被告行使垄断控制的市场中承认水平价格修复，＆＃34;尼尔·戈斯鲁奇的正义为法庭写道。\n 保守的司法是前总统唐纳德特朗普的被任命的人写道，它是＆＃34;目前不清楚NCAA寻求什么。＆＃34;\n ＆＃34;在某种程度上提出从谢尔曼的条款提出一种司法宣传的豁免权，因为他们应该忽视其限制，因为他们恰好在高等教育，体育运动的交叉口下降和金钱 - 我们不能同意，＆＃34;戈斯鲁奇写道。 \n结果在三月份口头争论后大部分预期。该决定维护了联邦地区法院的禁令，禁止NCAA限制＆＃34;与教育有关的赔偿和福利。＆＃34;早些时候上诉的第9届美国赛道法院批准了禁令。\n 在允许禁令时，戈斯鲁奇写道，NCAA可以询问立法者为它造成一个例外。\n  ＆＃34; NCAA可以自由地争辩，＆＃39;因为[其]特定行业的特点，＆＃39;它应该免于豁免反托拉斯法的惯常行动 - 但那些上诉是＆＃39;适当地发给国会，＆＃39;＆＃34;戈斯鲁奇写道。\n ＆＃34;国会也不对此类请求不敏感。它已经修改了过去某些行业的反托拉斯法律，未来可能会再次这样做，＆＃34;戈斯鲁奇写道。 ＆＃34;但直到国会所说，唯一一项要求我们向我们执行执行的法律是谢尔曼法案，该法律是独自一人的假设追求的 - ＆＃39;竞争是分配资源的最佳方法＆＃39;在国家和＃39;＆＃34;\n 案件最初是由Shawne Alston，前西弗吉尼亚州跑回和其他学生运动员带来的。争议，被称为国家大学运动股份有限公司。 v。阿尔斯顿，第20-512号，与NCAA规则的持续争议分开，这些规则限制了运动员来播放或做出认可交易。\n 后一条规则尚未进入最高法院，法院＆＃39的意见没有权衡他们的合法性。\n 然而，特朗普委任者Brett Kavanaugh建议在星期一的舆论中建议，这些规则也可能争夺反托拉斯法的原因。他写了那个＆＃34; NCAA不是在法律上的上方;那个＆＃34; NCAA＆＃39;商业模式在美国几乎任何其他行业都会被违法行为。＆＃34; \n＆＃34;每个人都同意NCAA可以要求学生运动员才能享受良好的学生。 但NCAA＆＃39;使用无偿学生运动员在大学收入中产生数十亿美元的商业模式提出了在反托拉斯法律下的严重问题，＆＃34; kavanaugh写道。  他补充说，它是＆＃34; NCAA及其成员大学的高度可疑是合理的，而不是向学生运动员支付关于循环理论的收入的公平份额，即大学体育的定义特征是大学不支付学生运动员 。＆＃34;  ＆＃34;如果这种声称的理由是无知的，目前尚不清楚NCAA如何合法捍卫其剩余的赔偿规则，＆＃34; kavanaugh写道。 ", "note_en": "The court gave a unanimous win to Division I college athletes in their fight against the NCAA over caps it sought to impose on compensation related to education.\n The justices voted 9-0 to affirm lower court rulings that prevented the NCAA from restricting payments to athletes for items such as musical instruments or as compensation for internships.\n The Supreme Court handed a unanimous victory Monday to Division I college athletes in their fight against the National Collegiate Athletic Association over caps it sought to impose on compensation related to education.\n The court voted 9-0 to affirm lower court rulings that found that antitrust law prevented the NCAA from restricting payments to athletes for items such as musical instruments or as compensation for internships. The justices rejected the NCAA&#39;s argument that its players&#39; amateur status would be impossible to maintain if they could receive pay, even for education-related expenses.\n  &#34;Put simply, this suit involves admitted horizontal price fixing in a market where the defendants exercise monopoly control,&#34; Justice Neil Gorsuch wrote for the court.\n The conservative justice, an appointee of former President Donald Trump, wrote that it was &#34;unclear exactly what the NCAA seeks.&#34;\n &#34;To the extent it means to propose a sort of judicially ordained immunity from the terms of the Sherman Act for its restraints of trade — that we should overlook its restrictions because they happen to fall at the intersection of higher education, sports, and money — we cannot agree,&#34; Gorsuch wrote.\n The outcome was largely expected following  oral argument in March. The decision upheld an injunction imposed by a federal district court that barred the NCAA from limiting &#34;compensation and benefits related to education.&#34; The 9th U.S. Circuit Court of Appeals earlier approved of the injunction.\n In allowing the injunction, Gorsuch wrote that the NCAA can ask lawmakers to carve out an exception for it.\n  &#34;The NCAA is free to argue that, &#39;because of the special characteristics of [its] particular industry,&#39; it should be exempt from the usual operation of the antitrust laws — but that appeal is &#39;properly addressed to Congress,&#39;&#34; Gorsuch wrote.\n &#34;Nor has Congress been insensitive to such requests. It has modified the antitrust laws for certain industries in the past, and it may do so again in the future,&#34; Gorsuch wrote. &#34;But until Congress says otherwise, the only law it has asked us to enforce is the Sherman Act, and that law is predicated on one assumption alone — &#39;competition is the best method of allocating resources&#39; in the Nation&#39;s economy.&#34;\n The case was originally brought by Shawne Alston, a former West Virginia running back, and other student athletes. The dispute, known as National Collegiate Athletic Assn. v. Alston, No. 20-512, is separate from the ongoing controversy over NCAA rules that restrict athletes from being paid to play or for doing endorsement deals.\n The latter rules have not yet come before the Supreme Court, and the court&#39;s opinion did not weigh on their legality.\n However, Trump appointee Justice Brett Kavanaugh suggested in a blistering concurrence to Monday&#39;s opinion that those rules may also run afoul of antitrust law. He wrote that &#34;The NCAA is not above the law&#34; and that &#34;The NCAA&#39;s business model would be flatly illegal in almost any other industry in America.&#34;\n &#34;Everyone agrees that the NCAA can require student athletes to be enrolled students in good standing. But the NCAA&#39;s business model of using unpaid student athletes to generate billions of dollars in revenue for the colleges raises serious questions under the antitrust laws,&#34; Kavanaugh wrote.\n He added that it was &#34;highly questionable whether the NCAA and its member colleges can justify not paying student athletes a fair share of the revenues on the circular theory that the defining characteristic of college sports is that the colleges do not pay student athletes.&#34;\n &#34;And if that asserted justification is unavailing, it is not clear how the NCAA can legally defend its remaining compensation rules,&#34; Kavanaugh wrote.", "posttime": "2021-06-22 00:48:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,运动员,court,ncaa", "title": "与大学运动员赔偿争夺战的最高法院规则 ", "title_en": "Supreme Court rules against NCAA in compensation fight with college athletes", "transed": 1, "url": "https://www.cnbc.com/2021/06/21/supreme-court-rules-for-college-athletes-in-compensation-dispute-with-ncaa.html", "via": "", "real_tags": ["大学", "运动员", "court", "ncaa"]}]