[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1002736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NetNewsWire之所以速度快，是因为性能是我们的核心价值之一。快速是这款应用程序定义的一部分。\n我怀疑用其他任何方式都很难做到这一点。如果你花一两个月的时间来加快速度，有时，你的应用程序总是-充其量也就是-只是朝着令人满意的方向前进，但永远不会到来。\n我能给出的最好的一般性建议就是：确保性能是你的应用程序基础的一部分。确保这是每天每个决定的一部分。\n换句话说，要确保这场表演不仅仅是一种配料，而是披萨。\n以下是NetNewsWire速度快的一些具体原因。因为NetNewsWire-就像现在的许多应用程序一样-基本上是一个花哨的数据库浏览器，数据来自网络，其中一些将适用于其他应用程序。\n解析XML最痛苦的方法是使用SAX解析器-但这也是获得最佳性能和使用最少内存的方法。因此，我们在RSParser框架中使用SAX。\n在我的2012iMac上，解析Dling Fireball Atom feed的一些过去实例的本地副本-大小相对较大，为112K-发生在0.009秒内。\n这很快，但我们还做了另一件事：在后台对串行队列运行解析器。由于解析是一个自包含的操作-我们输入一些数据并取回对象-因此不存在线程问题。\n解析器速度很快-但我们也会尽最大努力在可能的情况下完全跳过解析。我们有两种方法可以做到这一点。\n我们使用条件GET，这使服务器有机会在提要自我们上次请求后没有更改时使用304 NOT MODIFIED和NO CONTENT进行响应。显然，我们在这种情况下跳过了解析。\n每当我们下载提要时，我们还会创建原始提要内容的散列。如果散列与上次的散列匹配，那么我们知道内容没有被修改，我们跳过解析。\n解析器不是我们在串行队列上运行的唯一代码。当一个操作可以成为自包含的-当它可以只做一件事，然后回调到主线程时，没有线程问题-如果有任何机会明显阻塞主线程，我们就使用串行队列。\n当然，关键是要确保您的操作实际上是独立的。他们在工作时不应该触发KVO或其他类型的通知。\n(除了提要解析之外，背景的一个简单示例是创建提要图标的缩略图。)。\n这里有一个很容易落入陷阱的例子。假设用户正在将一篇文章标记为已读。通过KVO或通知或其他方式调用文章.read=true触发数据库更新、用户界面更新、未读计数更新、撤消堆栈维护等。\n现在，假设您正在将当前时间线中的所有文章标记为已读。您可以为每一篇文章调用titile.read=true，并为每一篇文章触发一大堆工作。这可能会非常非常慢。\n对于这样的操作，我们有特定的API，而这些API需要一个对象集合。将一篇文章标记为已读的API与将10,000篇文章标记为已读的API相同。这样，数据库更新一次，未读计数更新一次，我们只在撤消堆栈上推入一个操作。\n我们还努力把其他种类的工作结合起来。例如，在刷新期间，应用程序可以重新计算每一次更改的未读计数，但这可能意味着大量的工作。\n因此，取而代之的是，我们将这些合并在一起-我们这样做是为了使重新计算未读计数的频率不超过每0.25秒一次(例如)。这可能会带来巨大的不同。\n对于一个同样只是一个花哨的数据库浏览器的应用程序来说，这是整个事情成败的关键所在。\n虽然核心数据很棒，但我们通过FMDB更直接地使用SQLite，因为这使我们能够将数据库视为数据库。我们可以通过核心数据范围之外的方式优化我们的架构、索引和查询。(请记住，Core Data管理对象图：它不是数据库。)。\n我们使用各种工具-例如解释查询计划-来确保我们已经快速高效地进行了提取、计数和更新。\n我们自己做缓存。我们在串行队列上运行数据库，因此不会阻塞主线程。对于模型对象，我们尽可能使用结构而不是类。(不确定这对性能是否重要：我们只是碰巧喜欢结构。)。\n我可以，也许应该在这里写更多详细的文章。数据库工作是NetNewsWire速度最快的原因。\n我们经常需要查找东西-例如，给定feed的feed ID-，因此我们经常使用字典。这在Mac和iOS编程中相当常见。\n我怀疑不太常见的是套装的使用。Set是我们的默认集合类型--我们永远不想检查数组是否包含某些内容，也不想处理重复的对象。这些可能是性能杀手。\n当某些API需要数组或需要有序集合(通常用于UI)时，我们使用数组。\n我们使用Instruments中的分析器来准确地找出什么是慢的，而不是猜测什么是慢的。\n分析器经常令人惊讶！我们发现有一件事是我们没有预料到的：散列我们的一些对象一度相当慢。\n因为我们经常使用集合，所以进行了大量的散列操作。我们在一些具有大量字符串属性的对象上使用合成的等价性和哈希性-而且，事实证明，对字符串进行散列相当慢。\n因此，我们为这些对象编写了我们自己的散列函数。在许多情况下，我们可以只散列一个字符串属性-例如，一个文章ID-而不是五个、十个或更多。\n我使用堆栈视图的经验告诉我，它们非常慢。他们只是不被允许。\n当人们称赞NetNewsWire这样的基于时间轴的应用程序时，他们通常会说“它像黄油一样滚动！”(我认为黄油实际上根本不能很好地滚动，但是，是的，我知道黄油是光滑的。)。\n虽然我们大量使用Auto Layout(自动布局)--它很酷，而且我们很喜欢--但我们不允许在表格单元格视图中使用它。相反，我们编写自己的布局代码。\n这其实并不难。也许有点单调乏味，但布局表格单元格视图非常容易，真的。\n我认为优化的手动布局代码总是比约束求解器更快，这给了我们平滑滚动的优势，这是一个本来很好的应用程序可能会脱颖而出的地方之一。\n并且：因为布局代码不需要视图(只需要一个文章对象和一个宽度)，所以我们可以随时运行它。我们使用相同的代码来确定行的高度，而不必运行自动布局过程。\n文本测量很慢-慢到连手动布局都太慢了。在NetNewsWire中，我们在缓存文本测量方面做了一些聪明的事情。\n例如：如果我们知道一个给定的字符串在可用宽度为100时是20pt高，当可用宽度是200时，我们可以在不测量的情况下断定，当可用宽度是150时，它将是20pt高。\n没有什么灵丹妙药。让一款应用程序变得快速意味着要做一系列不同的事情-这意味着要持续关注性能。🍕", "note_en": "NetNewsWire is fast because performance is one of our core values.  Being fast is part of the very definition of the app.\n I suspect that it’s hard to do this any other way. If you take a month or two to speed things up, from time to time, your app will always be — at best — just kind of heading toward satisfactory, but never to arrive.\n The best general advice I can give is just this: make sure performance is part of the foundation of your app. Make sure it‘s part of every decision every day.\n Make sure, in other words, that performance isn’t just a topping — it’s the pizza.\n Below are some of the specific reasons NetNewsWire is fast. Because NetNewsWire is — like many apps these days — basically a fancy database browser where data comes from the web, some of these will apply to other apps.\n   The most painful way to parse XML is with a SAX parser — but it’s also how you’ll get the best performance and use the least memory. So we use SAX in our  RSParser framework.\n On my 2012 iMac, parsing a local copy of some past instance of the Daring Fireball Atom feed — relatively large at 112K in size — happens in 0.009 seconds.\n That’s fast, but we do another thing as well: run the parser in the background on a serial queue. Since parsing is a self-contained operation — we input some data and get back objects — there are no threading issues.\n  The parsers are fast — but we also do our best to skip parsing entirely when we can. There are two ways we do that.\n We use  conditional GET, which gives the server the chance to respond with a 304 Not Modified, and no content, when a feed hasn’t changed since the last time we asked for it. We skip parsing in this case, obviously.\n We also create a hash of the raw feed content whenever we download a feed. If the hash matches the hash from the last time, then we know the content hasn’t been modified, and we skip parsing.\n  The parser isn’t the only code we run on a serial queue. When an operation can be made self-contained — when it can just do a thing and then call back to the main thread, without threading issues — we use a serial queue if there’s any chance it could noticeably block the main thread.\n The key is, of course, making sure your operations are in fact self-contained. They shouldn’t trigger KVO or other kinds of notifications as they do their work.\n (A simple example of a background thing, besides feed parsing, is creating thumbnails of feed icons.)\n  Here’s an example of a trap that’s easy to fall into. Say a user is marking an article as read. Calling  article.read = true triggers, via KVO or notifications or something, things like database updates, user interface updates, unread count updating, undo stack maintenance, etc.\n Now say you’re marking all articles in the current timeline as read. You could call  article.read = true for each article — and, for each article, trigger a whole bunch of work. This can be very, very slow.\n We have specific APIs for actions like this, and those APIs expect a collection of objects. The same API that marks a single article as read is used to mark 10,000 articles as read. This way the database is updated once, the unread counts are updated once, and we push just one action on the undo stack.\n  We also try to coalesce other kinds of work. For instance, during a refresh, the app could recalculate the unread count on every single change — but this could mean a ton of work.\n So, instead, we coalesce these — we make it so that recalculating unread counts happens not more often than once every 0.25 seconds (for instance). This can make a huge difference.\n  For an app that is, again, just a fancy database browser, this is where the whole thing can be won or lost.\n While Core Data is great, we use SQLite more directly, via  FMDB, because this gives us the ability to treat our database as a database. We can optimize our schema, indexes, and queries in ways that are outside the scope of Core Data. (Remember that Core Data manages a graph of objects: it’s not a database.)\n We use various tools — such as  EXPLAIN QUERY PLAN — to make sure we’ve made fetching, counting, and updating fast and efficient.\n We do our own caching. We run the database on a serial queue so we don’t block the main thread. We use structs instead of classes, as much as possible, for model objects. (Not sure that matters to performance: we just happen to like structs.)\n  I could, and probably should, write more articles going into details here. The database work, more than anything else, is why NetNewsWire is fast.\n  We often need to look up things — a feed, given its feedID, for instance — and so we use dictionaries frequently. This is quite common in Mac and iOS programming.\n What I suspect is less common is use of  sets. The set is our default collection type — we never want to check to see if an array contains something, and we never want to deal with duplicate objects. These can be performance-killers.\n We use arrays when some API requires an array or when we need an ordered collection (usually for the UI).\n  Instead of guessing at what’s slow, we use the profiler in Instruments to find out exactly what’s slow.\n The profiler is often surprising! Here’s one thing we found that we didn’t expect: hashing some of our objects was, at one point, pretty slow.\n Because we use sets quite a lot, there’s a whole lot of hashing going on. We were using synthesized equality and hashability on some objects with lots of string properties — and, it turns out, hashing strings is pretty darn slow.\n So, instead, we wrote our own hash function for these objects. In many cases we could hash just one string property — an article ID, for instance — instead of five or ten or more.\n  My experience with stack views tells me that they’re excruciatingly slow. They’re just not allowed.\n  When people praise a timeline-based app like NetNewsWire, they often say something like “It scrolls like butter!” (I imagine butter as not actually scrolling well  at all, but, yes, I get that butter is smooth.)\n While we use Auto Layout plenty — it’s cool, and we like it — we don’t allow it inside table cell views. Instead, we write our own layout code.\n This is not actually difficult. Maybe a little tedious, but laying out a table cell view is pretty easy, really.\n I figure that optimized manual layout code is always going to be faster than a constraint solver, and that gives us an edge in smooth scrolling — and this is one of the places where an otherwise good app can fall on its face.\n And: because that layout code doesn’t need a view (just an article object and a width), we can run it at any time. We use that same code to determine the height of rows without having to run an Auto Layout pass.\n  Text measurement is slow — slow enough to make even manual layout too slow. In NetNewsWire we do some smart things with  caching text measurement.\n For example: if we know that a given string is 20pts tall when the available width is 100 and when the available width is 200, we can tell, without measuring, that it will be 20pts tall when the available width is 150.\n  There’s no silver bullet. Making an app fast means doing a bunch of different things — and it means paying attention to performance continuously. 🍕", "posttime": "2020-05-19 12:03:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "netnewswire", "title": "为什么NetNewsWire速度快", "title_en": "Why NetNewsWire Is Fast", "transed": 1, "url": "https://inessential.com/2020/05/18/why_netnewswire_is_fast", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "90690712ec5b262a65d4b1b3af5a2651.jpg", "infoid": 1002735, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "BuzzFeed新闻有来自五大洲的记者为您带来关于冠状病毒影响的可靠报道。为了让这条新闻保持免费，请成为我们的会员并订阅我们的时事通讯“今日爆发”。\n试图通过直接呼叫餐厅来避开GrubHub等在线送货平台的顾客，可能会拨打这些平台生成和广告的电话号码-餐厅为此收取的费用有时可能会超过订单产生的收入。餐厅老板和纽约市议会表示，这种做法进一步挤压了已经因冠状病毒大流行和封锁而捉襟见肘的企业。\n布鲁克林Gourmet Kitchen和“幽灵厨房”Palmito的共同所有者拉斐拉·内格罗(Rafaela Negrao)在接受BuzzFeed新闻采访时表示：“如果客户打电话订购咖啡，我们将支付6.42美元的费用。”她解释说，她每个电话订单都会支付固定费用。“你是在付钱请别人喝你的咖啡。如果你这样看，你会看到它有多痛。“。\n电话费的运作方式如下：GrubHub(旗下还拥有Seamless、MenuPages、Tapingo和LevelUp)在其平台上为每家餐厅生成一个唯一的电话号码；该号码会出现在餐厅的GrubHub或Seamless页面上，并重定向至餐厅自己的电话线路(餐厅不能在其GrubHub或Seamless页面上列出自己的电话号码)。重定向号码在谷歌搜索结果(包括该业务的谷歌面板)中也可能比餐厅自己的产品线显示得更高。这导致一些客户即使不打算使用GrubHub，也会打电话给它。一些餐厅老板也对Yelp提出了这种担忧，该公司列出了GrubHub的号码，据副总说，Yelp列出了GrubHub的号码。\n这是GrubHub的长期做法，该公司成立于2004年，在在线订购开始之前对电话订单收取佣金。\n当拨打GrubHub号码时，呼叫者会听到一条自动消息，上面写着“按1下单。请按2了解所有其他信息。“。它没有提到GrubHub。呼叫者接通后，平台可以向餐厅收取费用。每家餐厅的电话订餐手续费都是根据其平均销售额的百分比计算的固定美元金额。\nGrubHub使用一种算法(该算法考虑了许多因素，包括通话的长度)来收取费用-甚至在某些情况下，当它没有导致订单时也是如此。餐厅老板可以在一段时间内对电话收费提出质疑，但他们有责任看看哪些收费是错误的。\n但是，尽管多年来一直隐藏在人们的视线中，这种做法现在正受到当局的抨击。\n纽约市议员贾斯汀·布兰南在接受BuzzFeed新闻采访时表示：“大多数人甚至没有意识到，当他们在谷歌上搜索一家餐厅的电话号码时，十有八九是在调出该餐厅的GrubHub转发号码。”“在和平时期，这是不正当的。在战时，这只是丑陋的贪婪。“。\n周三，纽约市议会通过了一项法案，禁止平台对紧急状态期间没有发生交易的电话收费。它还限制了平台在紧急情况下可能向餐厅收取订单和送货的费用。\nGrubHub的一位发言人告诉BuzzFeed新闻：“当餐厅老板签署合同时，我们会向他们确切地解释这一过程是如何进行的。我们几乎即时给业主一份所有电话订单的成绩单，然后我们给他们四个月的时间来审查订单并提出问题。“。\n在去年的一次投资者电话会议上，GrubHub首席执行官马特·马洛尼(Matt Maloney)为电话佣金进行了辩护，这是一起正在进行的集体诉讼的主题，他说：“我们仍然允许餐厅通过他们的经理门户审查电话订单，所以我们是完全透明的。我们相信这是公平的。如果GrubHub是采购和推动订单的人，我们应该收取佣金。这是我们多年来的政策，并在我们的餐厅合约中有明确规定。“。他还说，电话只占“我们订单的个位数百分比”。\n但一些餐厅老板有不同的看法。“除非你继续打完所有的电话，否则你会被收费。我没时间做那件事，但你必须这么做。布鲁克林两家Patsy‘s披萨店的老板杰基·朱利亚诺告诉BuzzFeed新闻，这是无稽之谈，但却合情合理。\n在一段冠状病毒大流行期间打给Patsy‘s的电话录音中，一名顾客说，“我不想通过第三方。”但这位顾客使用的是该平台提供的电话号码-格鲁布中心向朱利亚诺的餐厅收取了7.45美元的电话费。\n朱利亚诺说：“人们没有意识到他们这样做是在做这件事，拨打一个电话号码就是向餐厅收取[几乎]8美元。”\n布鲁克林LoneStar酒吧和烧烤店的共同所有者托尼·詹蒂勒告诉BuzzFeed新闻：“你工作得太努力了，简直是疯了。..。在所有的费用之后，都没有了。“。詹蒂勒说，他正在努力让顾客拨打餐厅自己的电话，方法是在所有送货时都包括带有商店电话号码和促销活动的菜单。但这是一次艰难的攀登。\nLoneStar的共同所有者特蕾西·布莱斯在接受BuzzFeed新闻采访时表示：“当你与GrubHub签约时，基本上就是同意以企业主的身份将自己的灵魂出卖给魔鬼。”", "note_en": "BuzzFeed News has reporters across five continents bringing you trustworthy stories about the impact of the coronavirus. To help keep this news free,   become a member  and sign up for our newsletter,  Outbreak Today .\n    Customers trying to avoid online delivery platforms like Grubhub by calling restaurants directly might be dialing phone numbers generated and advertised by those very platforms — for which restaurants are charged fees that can sometimes exceed the income the order generates. Restaurant owners and the New York City Council say the practice is further squeezing businesses already stretched thin by the  coronavirus pandemic and the lockdowns.\n “If a customer calls to place a coffee order, we’re paying a $6.42 fee — for a coffee,” Rafaela Negrao, co-owner of  Gourmet Kitchen in Brooklyn and the “ ghost kitchen”  Palmito, told BuzzFeed News, explaining that she pays a flat fee per phone order. “You are paying for someone to drink your coffee. If you look at it that way, you see how much it hurts.”\n Here’s how phone fees work: Grubhub (which also owns Seamless, MenuPages, Tapingo, and LevelUp) generates a unique phone number for each restaurant on its platform; it appears on the restaurant’s Grubhub or Seamless page and redirects to the restaurant&#39;s own phone line (a restaurant cannot list its own phone number on its Grubhub or Seamless page). The redirect number can also appear higher in Google search results (including the Google panel for that business) than the restaurant’s own line. This leads some customers to call it even if they don’t intend to use Grubhub. Some restaurant owners have also raised this concern about Yelp, which lists Grubhub numbers,  according to Vice.\n    This is a long-standing practice for Grubhub, which was founded in 2004 and charged a commission for phone orders before online ordering took off.\n When a Grubhub number is dialed, the caller hears an automated message that says “Press 1 to place an order. Press 2 for all other information.” It does not mention Grubhub. After the caller is connected, the platform can charge the restaurant a fee. Each restaurant&#39;s phone order fee is a flat dollar amount based on a percentage of its average sale.\n Grubhub charges that fee using an algorithm (which factors in a number of things, including the length of the call) — even, in some cases, when it did not result in an order. A restaurant owner can challenge a phone charge within a certain period of time, but the onus is on them to see which charges are erroneous.\n    But despite hiding in plain sight for years, that practice is now coming under fire from authorities.\n    “Most people don’t even realize when they google the phone number for a restaurant, 9 times out of 10, they’re pulling up Grubhub’s forwarding number for that restaurant,” New York City Council Member Justin Brannan told BuzzFeed News. “In peacetime, it’s devious. In wartime, it’s just ugly greed.”\n On Wednesday, the New York City Council  passed a bill prohibiting platforms from charging for telephone calls in which a transaction did not take place during the state of emergency. It also capped fees that platforms may charge restaurants for orders and deliveries during an emergency.\n A Grubhub spokesperson told BuzzFeed News: “We explain exactly how the process works to restaurant owners when they sign the contract. We give owners a transcript of all phone orders almost instantaneously, and then we give them four months to review the orders and raise questions.”\n In an investor call last year, Grubhub CEO Matt Maloney defended the phone commissions, which are the subject of an ongoing  class action lawsuit, saying, “We still allow restaurants to review telephone orders via their manager portal so we are completely transparent. We believe this is fair. If Grubhub is sourcing and driving the order, we should collect a commission. This has been our policy for years and is explicitly laid out in our restaurant contracts.” He also said that calls represented a “single-digit percentage of our orders.”\n    But some restaurant owners have a different take. “Unless you go on and go through all your phone calls, you get charged. I don’t have time for that, but you have to do it. It’s nonsense, but it adds up,” Jackie Juliano, owner of two  Patsy’s Pizzeria restaurants in Brooklyn, told BuzzFeed News.\n In a recording of a phone call made to Patsy’s during the coronavirus pandemic, a customer said, “I don’t want to go through a third party.” But the customer had used the phone number supplied by the platform — and Grubhub charged Juliano’s restaurant $7.45 for that call.\n “People don’t realize they are doing this, that by dialing a phone number they’re charging the restaurant [almost] $8,” said Juliano.\n    Tony Gentile, co-owner of  LoneStar Bar &amp; Grill in Brooklyn, told BuzzFeed News, “You’re working so hard, it’s insanity. ... After all the fees, it’s all gone.” Gentile said he is trying to get customers to call the restaurant’s own line by including menus with the store’s phone number and promotions with all deliveries. But it&#39;s a hard climb.\n “When you sign up with Grubhub, you’re basically agreeing to sell your soul to the devil as a business owner,” LoneStar co-owner Tracy Blaise told BuzzFeed News.", "posttime": "2020-05-19 11:34:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收取,grubhub,餐厅", "title": "即使你试图通过直接打电话给你最喜欢的餐厅来避开GrubHub，GrubHub仍然可能会向它收取费用", "title_en": "Even If You're Trying To Avoid Grubhub By Calling Your Favorite Restaurant Directly, Grubhub Could Still Be Charging It A Fee", "transed": 1, "url": "https://www.buzzfeednews.com/article/venessawong/grubhub-phone-order-call-fee-coronavirus", "via": "", "real_tags": ["收取", "grubhub", "餐厅"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此浏览器禁用Cookie。Wiley Online Library需要Cookie来进行身份验证和使用其他站点功能；因此，必须启用Cookie才能浏览站点。有关Wiley如何使用Cookie的详细信息可在我们的隐私政策中找到。", "note_en": "Cookies are disabled for this browser. Wiley Online Library requires cookies for authentication and use of other site features; therefore, cookies must be enabled to browse the site. Detailed information on how Wiley uses cookies can be found in our  Privacy Policy.", "posttime": "2020-05-19 11:16:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "毛发,regeneration,cookie", "title": "脂肪干细胞提取液在脱发患者毛发再生中的应用", "title_en": "Hair regeneration using adipose‐derived stem cell extract in alopecia", "transed": 1, "url": "https://stemcellsjournals.onlinelibrary.wiley.com/doi/full/10.1002/sctm.19-0410", "via": "", "real_tags": ["毛发", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "7f2d2fa64ef6f63e79f189ea3a2d64aa.jpg", "infoid": 1002730, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果早在1月份就表示，它在几个小时内就提供了帮助，并将数十亿字节的信息交给了联邦调查局(FBI)。\n耳机插孔不见了，物理按键快要出来了。但是，另一个变化即将到来，它将从根本上改变我们使用iPhone的方式。\n苹果可能会给下一代iPad提供更大的10.8英寸屏幕，同时也会加大iPad mini的尺寸。\n这场流行病正在帮助安卓迎来后高端时代，三星(Samsung)和小米(Xiaomi)的手机在销量上处于领先地位。\n苹果iPhone SE是最近发布的和BodyGuardz很快就发起了几起案件和屏幕保护选项。这些案件有其独特的特点，包括集成滑出..。\nFfltter现在默认使用苹果的Metal API来访问iOS GPU，带来更快的动画效果，并且使用更少的内存。\n根据网络应用，桌面Linux正在制造激增。但Windows仍然统治着桌面和其他数据表明MacOS，Chrome OS，和Linux仍然是远远落在后面，虽然..。\n我们现在知道什么时候会看到iOS14、iPadOS14、WatchOS7和MacOS10.16。\n你对这件事犹豫不决吗？最新的价格苹果和三星的旗舰产品？考虑一下这些负担得起的其他选择。从400美元降到自由的，我们的选择甚至包括一对夫妇..。", "note_en": "Apple said back in January that it helped within hours and handed over to the FBI gigabytes of information.\n  Headphone jack is gone, physical buttons are on the way out. But there&#39;s another change coming that will radically change the way we use our iPhones.\n  Apple could be giving its next iPad a bigger, 10.8-inch screen and upsizing the iPad mini too.\n  The pandemic is helping usher in Android&#39;s post-premium era, with phones from Samsung and Xiaomi leading sales.\n  The\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tApple\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tiPhone\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSE\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trecently\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treleased\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBodyGuardz\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tquickly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlaunched\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tseveral\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcase\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscreen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprotector\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toptions.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcases\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thave\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tunique\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfeatures,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tincluding\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tintegrated\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tslide-out\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Flutter now uses Apple&#39;s Metal API for iOS GPU access by default, brings faster animations and uses less memory.\n  According\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNet\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tApplications,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdesktop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLinux\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmaking\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsurge.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trules\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdesktop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tother\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdata\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsuggests\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmacOS,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChrome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOS,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLinux\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tare\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tway\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbehind,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhile\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  We now know when we&#39;ll see iOS 14, iPadOS 14, WatchOS 7, and MacOS 10.16.\n  Are\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbalking\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprices\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlatest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tApple\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSamsung\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tflagships?\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tConsider\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tone\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taffordable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\talternatives.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t$400\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tright\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdown\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfree,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpicks\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teven\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinclude\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcouple\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2020-05-19 10:31:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,upset,苹果", "title": "人们对iPhone闪电改变的想法感到不安，这是理所当然的", "title_en": "People are upset by the idea of iPhone Lightning change, and rightly so", "transed": 1, "url": "https://www.zdnet.com/article/people-are-really-upset-by-the-idea-of-this-future-iphone-change-and-rightly-so/", "via": "", "real_tags": ["iphone", "upset", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "2eaa35a5ea5ae336f70180f84fbcceb4.jpg", "infoid": 1002729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软首席执行官萨蒂亚·纳德拉(档案图片：路透社)旧金山：由于某些科技公司，如推特，更喜欢员工永远在家工作，微软首席执行官萨蒂亚·纳德拉警告说，将远程工作永久化可能会对员工的社交和心理健康产生严重影响，因为虚拟视频通话不能取代面对面的会议。纳德拉说，全远程设置将是用一个教条取代另一个教条。倦怠是什么样子的？心理健康是什么样子的？这种连通性和社区建设是什么样子的？我感觉到的一件事是，嘿，也许我们正在烧毁我们在这个阶段建立起来的一些社会资本，我们都在远程工作。报道援引纳德拉的话说，这要采取什么措施？在他发表评论之前，Twitter允许他的员工永远在家工作，即使在冠状病毒大流行结束后也是如此。在Facebook、Alphabet(谷歌)和其他公司要求员工在家工作至年底后，Twitter加大了赌注。有关冠状病毒的更多信息，微软已经将其在家工作的政策延长到至少10月份。这家科技巨头的股价今年上涨了14%，公司拥有近1400亿美元的现金。微软最近一个季度在股票回购和派息上花费了100亿美元，较上年同期增长逾30%。纳德拉说：我们将大胆分配和收购、建造、创新、合作，不管怎样。我们还将确保我们有能力为需要帮助的小企业和其他组织提供信贷。微软(Microsoft)上周签署了一项最终协议，收购总部位于英国的Metaswitch Networks。Metaswitch Networks是一家为运营商提供虚拟化网络软件和语音、数据和通信解决方案的领先供应商，金额不详。该公司还推出了新的解决方案，旨在帮助印度中小型企业(SMB)在冠状病毒危机中保持业务连续性，并开始他们的云采用之旅。", "note_en": "Microsoft CEO Satya Nadella (File photo: Reuters)  SAN FRANCISCO: As certain tech companies like Twitter prefer their employees to work from home forever, Microsoft CEO Satya Nadella has warned that making remote work permanent could have serious consequences for social interaction and mental health for workers as virtual video calls cannot replace in-person meetings.  Nadella said that an all-remote setup would be &#34;replacing one dogma with another dogma&#34;.  &#34;What does burnout look like? What does mental health look like? What does that connectivity and the community building look like? One of the things I feel is, hey, maybe we are burning some of the social capital we built up in this phase where we are all working remote. What&#39;s the measure for that?&#34; Nadella was quoted as saying.  His comment came after Twitter granted an option to his staff to work from home &#39;forever&#39; even after the COVID-19 pandemic ends.  Twitter upped the ante after Facebook, Alphabet (Google) and others have asked their employees to work from home till year-end.   More on Covid-19   Microsoft has extended its work-from-home policy until at least October.  The tech giant&#39;s stock price is up 14 per cent this year and the company has nearly $140 billion in cash.  Microsoft spent $10 billion in its most recent quarter on share buybacks and dividends, up more than 30 per cent from the year before.  &#34;We&#39;re going to boldly allocate and acquire, build, innovate, partner, whatever,&#34; said Nadella.  &#34;We are also going to make sure that we have the ability to do credit for small businesses and other organizations that need that help&#34;.  Microsoft last week signed a definitive agreement to acquire UK-based Metaswitch Networks, a leading provider of virtualised network software and voice, data and communications solutions for operators, for an undisclosed sum.  The company also launched of new solutions designed to help Indian small and medium businesses (SMBs) maintain business continuity and embark on their Cloud adoption journeys amid the COVID-19 crisis.", "posttime": "2020-05-19 10:17:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,损害,ceo", "title": "微软首席执行官萨蒂亚·纳德拉：长期在家工作会损害心理健康", "title_en": "Microsoft CEO Satya Nadella: Permanently Working From Home Can Be Damaging For Mental Health", "transed": 1, "url": "https://timesofindia.indiatimes.com/business/india-business/permanent-work-from-home-damaging-for-workers-well-being-satya-nadella/articleshow/75798510.cms", "via": "", "real_tags": ["microsoft", "微软", "损害", "ceo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002728, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在推广开放硬件的过程中，重要的是要让设计者清楚地知道他们的许可证实际上可以控制他们的设计的程度。根据美国法律和许多其他地方的法律，版权不适用于电子或物理设计。专利可以做到这一点。其结果是，开放硬件许可通常可以用来限制计划，但不能限制制造的设备，甚至不能限制不是原始设计文本副本的相同设计的重述。美国版权法的适用条款是17.102(B)，其中规定：\n在任何情况下，对原创作品的版权保护都不会延伸到任何想法、程序、过程、系统、操作方法、概念、原则或发现，无论它是以什么形式描述、解释、说明或体现在这些作品中的。\n这样做的效果是，许可证限制了原理图或激光切割图的发布，而不是使用原理图来制造出售的设备。你可以控制人们如何用你的许可证销售这些计划，但你不能阻止他们用你的非商业许可证商业化制造和销售这些设备，除非你有专利。\n但是，硬件的某些元素是可受版权保护的，例如门阵列程序和安装在设备中的软件。当然，关于什么可以保护以及如何保护的法律因国家而异。\n我们建议所有制片人将开放硬件许可证应用于其作品，原因如下：\n法律是可以改变的，因此今天不受法律限制的东西可能是明天法律保留的所有权利。许可证的存在通过明确授予可能隐含在今天的法律中而不是明天的法律中的权利，帮助保护免受这种变化的影响。\n不同的州或民族的法律是不一样的。许可证的存在可以在地点发生变化的情况下毫不含糊地授予权利。\n开放硬件组织OpenHardware.org和编辑此内容的人员不是您的法律顾问。我们鼓励您与您的签约法律顾问一起审阅此信息。那是唯一被允许给你法律建议的人。", "note_en": "In promoting Open Hardware, it is important to make is clear to designers the extent to which their licenses actually can control their designs. Under U.S. law, and law in many other places, copyright does not apply to electronic or physical designs.  Patents do. The result is that an Open Hardware license can in general be used to restrict the plans but not the manufactured devices or even restatements of the same design that are not textual copies of the original. The applicable section of U.S. copyright law is 17.102(b), which says:\n In no case does copyright protection for an original work of authorship extend to any idea, procedure, process, system, method of operation, concept, principle, or discovery, regardless of the form in which it is described, explained, illustrated, or embodied in such work.\n  The effect of this is that the license restricts the  publication of a schematic or a laser-cutting plan, rather than the use of the schematic to make devices that are sold. You can control how people sell the plans with your license, but you can&#39;t keep them from commercially manufacturing and selling the devices with your non-commercial license, unless you have a patent.\n However, certain elements of hardware  are copyrightable, for example gate-array programs and the software that is installed in the devices. And of course laws on what can be protected, and how, differ from nation to nation.\n We recommend that all producers apply an Open Hardware License to their work, for these reasons:\n Laws can change, and thus something that is unrestricted under the law today might be &#34;all rights reserved&#34; under the law tomorrow. The presence of a license helps to protect against such a change by explicitly granting rights that might otherwise be implicit in today&#39;s law and not tomorrow&#39;s.\n Laws are not the same from one state or nation to another. The presence of a license can work to grant rights unambiguously despite changes of venue.\n  OpenHardware.org, the Open Hardware organization, and the people who edit this content are  not your legal counsel. You are encouraged to go over this information with your contracted legal counsel. That is the only person who is allowed to give you legal advice.", "posttime": "2020-05-19 10:16:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硬件,版权保护,isn,法律", "title": "硬件通常不受版权保护", "title_en": "Hardware Isn't Generally Copyrightable", "transed": 1, "url": "https://web.archive.org/web/20120114234704/http://wiki.openhardware.org/Hardware_Isn%27t_Generally_Copyrightable", "via": "", "real_tags": ["硬件", "版权保护", "isn", "法律"]}, {"category": "", "categoryclass": "", "imagename": "5e23f8e7c96e887d989aa8507a83cd5f.jpeg", "infoid": 1002727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们将发布Spleeter，以帮助音乐信息检索(MIR)研究团体利用最先进的源分离算法的力量。它以基于TensorFlow的Python库的形式出现，带有用于2、4和5个词干分离的预先训练的模型。Spleeter将在代尔夫特举行的2019年ISMIR会议上进行展示和现场演示。\n虽然不是一个广为人知的话题，但几十年来，源分离问题已经引起了大量音乐信号研究人员的兴趣。它从一个简单的观察开始：音乐录音通常是几个单独的乐器轨道(主唱、鼓、贝斯、钢琴等)的混合。音乐源分离的任务是：给定一个混合，我们可以恢复这些单独的音轨(有时称为词干)吗？这有许多潜在的应用：思考混音、混音、主动倾听、教育目的，但也有其他任务的预处理，如转录。\n有趣的是，我们的大脑非常善于分离仪器。只要专注于这首曲子中的一种乐器(比如说主唱)，你就能非常清晰地听到它与其他乐器的声音。然而，这并不是真正的分离，你仍然可以听到所有其他的部分。在许多情况下，可能无法准确恢复混合在一起的各个磁道。因此，挑战是要尽可能地接近它们，也就是说，在不造成太多扭曲的情况下，尽可能地接近原件。\n多年来，来自世界各地的数十个才华横溢的研究团队探索了许多策略。如果你对这段迷人的旅程感兴趣，你应该去阅读这篇文献概述，或者这篇。最近，进展的速度取得了一些巨大的飞跃，这主要是由于机器学习方法的进步。为了保持跟踪，人们一直在国际评估活动中比较他们的算法。这就是我们如何知道Spleeter的性能与最好的建议算法的性能相匹配的原因。\n此外，Spleeter速度非常快。如果您运行的是GPU版本，那么可以预期分离速度比实时快100倍，这使得它成为处理大型数据集的一个很好的选择。\n我要说的可不少。如果您是从事音乐信息检索的研究人员，并且一直认为源分离工件不适合作为管道中的预处理步骤……。嗯，你也许应该重新考虑一下，试试斯普莱特。如果你是一名音乐黑客，想要用Spleeter构建一些很棒的东西，那就去做吧。实际上，Spleeter是麻省理工学院授权的，所以你可以自由地以任何你想要的方式使用它。不用说，如果您计划在受版权保护的歌曲上使用Spleeter，请确保您事先获得了版权所有者的适当授权。\n在引擎盖下，Spleeter是一个相当复杂和精心制作的引擎，但我们已经努力使其真正易于使用。实际的分离可以通过单个命令行来实现，它应该可以在您的笔记本电脑上工作，而不管您的操作系统是什么。对于更高级的用户，有一个名为Separator的python API类，您可以将其直接操作到您常用的管道中。\n我们已经竭尽全力拿出一份详尽的文件。请不要犹豫通过传统的GitHub工具向我们反馈、指出问题或提出改进建议！\n我们致力于源代码分离已经有很长一段时间了(我们已经在ICASSP 2019上有了一份出版物)。我们已经将Spleeter与Open-unMix(Inria的一个研究团队最近发布的另一个开源模型)进行了基准比较，并报告了速度提高后性能略有提高(请注意，训练数据集不同)。\n和平号研究人员面临的硬限制之一是由于版权问题缺乏公开可用的数据集。在Deezer这里，我们可以访问一个相当大的目录，我们一直在利用它来构建Spleeter。因为我们不能共享这些数据，所以把它变成一个可访问的工具是我们让每个人都可以复制我们的研究的一种方式。站在更道德的立场上，我们认为研究人员之间不应该因为他们获得或缺乏受版权保护的材料而进行不公平的竞争。\n最后但并非最不重要的一点是，培训这类模型需要大量的时间和精力。通过做一次并分享结果，我们希望省去别人的一些麻烦和资源。\n自从我们发布Spleeter以来，我们已经收到了很多反馈，其中大多数都是非常积极的，我们很高兴看到人们对我们的工作给予了如此多的关注。然而，这些反应中的一些可能有点过度热情，所以让我们重申几件事。Spleeter是一个很好的工具，但是我们绝不能声称已经“解决”了源分离问题。数以百计的研究人员和工程师工作了几十年，取得了进展，并建造了Spleeter所基于的工具。这是我们对一个生动、不断增长和开放的生态系统的贡献，希望其他人也能在此基础上建立起来。\n最后，值得一提的是，混音是一门艺术，掌握音响工程师本身就是艺术家。显然，我们不打算以任何方式损害他们的工作或影响任何人的信用。当您使用Spleeter时，请负责任地使用。", "note_en": "We are releasing   Spleeter to help the research community in Music Information Retrieval (MIR) leverage the power of a state-of-the-art source separation algorithm. It comes in the form of a Python Library based on  Tensorflow, with pretrained models for 2, 4 and 5 stems separation.  Spleeter will be presented and live-demoed at the 2019  ISMIR conference in Delft.\n  While not a broadly known topic, the problem of source separation has interested a large community of music signal researchers for a couple of decades now. It starts from a simple observation: music recordings are usually a mix of several individual instrument tracks (lead vocal, drums, bass, piano etc..). The task of music source separation is: given a mix can we recover these separate tracks (sometimes called  stems)? This has many potential applications: think remixes, upmixing, active listening, educational purposes, but also pre-processing for other tasks such as transcription.\n  Interestingly, our brain is very good at isolating instruments. Just focus on one of the instrument of  this track (say the lead vocal for instance) and you will be able to  hear it quite distinctively from the others. Yet that’s not really separation, you still hear all the other parts. In many cases, it may not be possible to exactly recover the individual tracks that have been mixed together. The challenge is thus to approximate them the best we can, that is to say as close as possible to the originals without creating too much distortions.\n For years, a lot of strategies have been explored, by dozens of brilliant research teams from all over the world. If you’re interested in this fascinating journey you should go read  this literature overview, or  this one. The pace of progress has recently made some giant leaps, mainly due to advances in machine learning methods. To keep track, people have been comparing their algorithm in  international evaluation campaigns. That’s how we know that  Spleeter performances match those of the best proposed algorithms.\n Additionally,  Spleeter is  very fast. If you are running the GPU version you can expect separating  100x faster than real-time which makes it a good option to process large datasets.\n  Quite a lot I’d say. If you’re a researcher working on Music Information Retrieval and have always considered that source separation artifacts made it unsuitable as a pre-processing step in your pipeline... Well, you should probably reconsider and try  Spleeter. If you are a music hacker and want to build something awesome using  Spleeter, then go ahead. Actually  Spleeter is  MIT-Licensed so you are  really free to use it in any way you want. It goes without saying that if you plan to use  Spleeter on copyrighted songs, make sure you get proper authorization from right owners beforehand.\n  Under the hood,  Spleeter is a fairly complex and crafted engine but we’ve worked hard to make it really easy to use. The actual separation can be achieved with a  single command line, and it should work on your laptop regardless of your Operating System. For more advanced users, there is a python API class called   Separator that you can manipulate directly into your usual pipeline.\n We’ve tried hard to come up with a  thorough documentation. Don’t hesitate to give us feedback, point out issues or suggest improvement through the traditional github tools!\n  We’ve been working on source separation for a long time (and we already had a  publication at ICASSP 2019). We have benchmarked  Spleeter against  Open-Unmix -another open-source model recently released by a research team from Inria- and reported  slightly better performances with increased speed (note that the training dataset is not the same).\n One of the hard limitations faced by MIR researchers is the lack of publicly available datasets due to copyright issues. Here at  Deezer, we have access to a fairly large catalog that we’ve been leveraging to build  Spleeter. Since we can not share this data, turning it into an accessible tool is a way for us to make our research reproducible by everyone. On a more ethical standpoint, we feel there should not be an unfair competition between researchers based on their access to copyrighted material or lack thereof.\n Last but not least, training this kind of models requires a lot of time and energy. By doing it once and sharing the result, we hope to save others some trouble and resources.\n  Since we released  Spleeter, we have received numerous feedback, most of them very positive and we’re thrilled to see all that attention given to our work. A few of these reactions may however be a little over-enthusiastic, so let’s just restate a few things.  Spleeter is a neat tool, but in no way do we claim to have “ solved” source separation. Hundreds of researchers and engineers working for decades have made the advances and built the tools on which  Spleeter is based. It’s our contribution to a vivid, ever-growing and open ecosystem and hopefully something others will build upon too.\n Finally, it’s worth pointing out that music mixing is a fine art and that mastering sound engineers are artists in their own rights. Obviously we do not intend to harm their work in any manner or affect anyone’s credit. When you use  Spleeter, please do so responsibly.", "posttime": "2020-05-19 10:15:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "spleeter,music,分离", "title": "Spleeter-音乐源-分离引擎", "title_en": "Spleeter – Music Source-Separation Engine", "transed": 1, "url": "https://deezer.io/releasing-spleeter-deezer-r-d-source-separation-engine-2b88985e797e", "via": "", "real_tags": ["spleeter", "music", "分离"]}, {"category": "", "categoryclass": "", "imagename": "c77d7cdb956c2a762ec0860159260315.png", "infoid": 1002726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "\\$\\Begingroup\\$您的任务是构建一个表示数字时钟的生活游戏模拟，它满足以下属性：\n时钟以十进制(例如，12：00、3：59、7：24)显示小时和分钟，一天中的1,440分钟中的每一分钟都有不同的状态-小时将从0变为23，或者从1变为12，并带有PM指示器。\n分钟定期更新-从一次分钟更改到下一次更改需要相同的生成次数。\n一位匿名的旁观者能够一眼看出显示器应该是一个数字钟。这尤其需要：\n这些数字是可见的，并且可以清楚地区分。你必须能够一目了然地说出正在显示的时间。\n数字会在适当的位置更新。每个新数字出现在与前一个数字相同的位置，数字的边界框几乎没有移动。(具体地说，一个数字不包含位于不同位置的10个不同的数字，这些数字在每次数字更改时都会被揭开。)。\n数字紧挨着显示，它们之间没有过多的空格。\n您的计划将在以下方面按顺序评分(较低的标准充当较高标准的决胜局)：\n边界框大小-面积最小且完全包含给定解的矩形框获胜。\n\\$\\endgroup\\$。\nI‘我很确定这是B3/S23，但您能确认或否认吗？Conor O&’Brien。\n\\$\\Begingroup\\$&34；它们还必须原地更新-每个新数字必须出现在与前一个数字相同的位置。&#34；您如何定义同一位置的&#34；，因为数字不一定是矩形的。\\$\\endgroup\\$-Martin Ender。\n\\$\\Begingroup\\$我们的小数位必须有多清晰？如果你知道它是什么，并且眯着眼睛，那么你就可以分辨出0和8之间的区别了吗？或者它需要通过测试吗？匿名旁观者可以在没有提示的情况下判断出它是什么？\\$\\endgroup\\$-s SPARR。\n\\$\\Begingroup\\$这也发布在哈卡迪博客上：hackaday.com/2017/03/11/a-clock-created-with-conways-life\\$\\endgroup\\$-Anool Maidharia。\n嗯，这个设计肯定不是最优的。既不是从边界框的角度(那7段数字很大)，也不是从最初的人口计数(有一些无用的东西，还有一些肯定可以变得更简单的东西)，以及执行速度-嗯……。我不确定。\n转到在线JavaScript Conway生活模拟器。单击导入，粘贴设计文本。你应该看看设计。然后，转到设置并将生成步长设置为512或这些行附近的某个值，否则您将不得不永远等待才能看到时钟显示更新。\n请注意，使这个庞大的设计变得可用的唯一算法是hashlife。但是有了这个，您可以在几秒钟内实现整个时钟绕回。使用其他算法，即使看到时间变化也是不切实际的。\n它使用的是P30技术。只是一些基本的东西，滑翔机和轻型宇宙飞船。基本上，设计是自上而下的：\n在最上面，有一只钟。这是一个11520周期的钟。请注意，您需要大约10.000代才能确保显示器得到适当更新，但设计仍应稳定，时钟周期较小(约为5.000代-时钟需要是60的倍数)。\n然后是时钟分配阶段。时钟滑翔机被复制到一个平衡树中，所以在最后，有32个滑翔机在完全相同的时刻到达计数器阶段。\n计数器级为每个状态和每个数字使用RS锁存器(我们以十进制计数)。因此，分钟的右数字有10个状态，分钟的左数字有6个状态，小时有12个状态(两个小时数字在这里合并)。对于这些组中的每一组，计数器的行为类似于移位寄存器。\n在计数阶段之后，有查找表。它们将状态脉冲转换为显示段开/关动作。\n然后是显示器本身。这些区段简单地由多串LWSS制成。每个段都有自己的锁存器以保持其状态。我可以对数字状态进行简单的逻辑或运算，以了解某个段必须打开还是关闭，并去掉这些锁存器，但是当数字改变时(由于信号延迟)，不变的段会有故障。从查找表到数字段会有很长的滑翔机流。所以它就不会那么好看了。这是必须的。是。\n不管怎么说，这个设计其实没有什么特别之处。在这个过程中没有发现令人惊讶的反应，也没有以前没有人想到的真正聪明的组合。只是把这里和那里的一些东西放在一起(我甚至不确定我是不是按照正确的方式做的--实际上我对此完全陌生)。然而，这需要很大的耐心。让所有这些滑翔机在正确的时间在正确的位置升空是令人费解的。\n我可以将相同的时钟块复制n次(每个计数器单元一次)，而不是将相同的根时钟复制并分发到n个计数器单元。这实际上会简单得多。但那样我就不能那么容易地通过在单点上改变时钟来调整它了。我有电子学背景，在真实的电路中，这将是非常错误的。\n每个网段都有自己的RS锁存器。这要求查找表同时输出R和S脉冲。如果我们有一个锁存器，它只会从公共输入脉冲切换其状态，我们就可以使查找表变得一半大。PM点有这样一个插销，但它很大，我想不出更实用的东西。\n将显示屏缩小。但那就不会那么好看了。这是必须的。是。\n\\$\\endgroup\\$。\n\\$\\Begingroup\\$@Poke来吧，你可以试着自己添加这个.。无论如何，我已经编辑了这篇帖子的AM+PM两个版本，以供您愉快。\\$\\endgroup\\$-暗淡。\n如你所知，这个答案已经出现在Microsiervos上，这是最重要的西班牙语技术博客之一，在Twitter上有超过80万的追随者\\$\\endgroup\\$-Luis Mendo。\n罗里，你拿起你的头，用最大的力气把它砸在墙上十几次。然后您就可以开始了。\\$\\endgroup\\$-暗淡。\n所以设计过程是：，好的，我需要碰撞它，我的滑翔机在这个时候从那里滑翔过来。让我们看看用两个反射器把它拿到那里去。废话，它需要碰撞的只是两代人的步伐太快了，那里。如果我稍微移动一下反光镜，让我们看看……。糟了，太晚了。好的，让我们在别的地方与他们相撞。糟了，我没有房间让我的滑翔机去那里。好的，让我们再加两个没用的反光镜，好让它到达那里。糟了，反光板撞上了另一股滑翔机.。糟了，让我们上床睡觉吧。&#34；\\$\\endgroup\\$-224；暗淡\n…。请务必遵循挑战规范。不过，请不要钻空子。滥用任何标准漏洞的答案都被认为是无效的。如果您认为某个规范不明确或未详细说明，请改为对该问题进行评论。\n…。试着优化你的分数。例如，对挑战的回答应该尽量简短。除了竞争版本之外，您还可以随时包含代码的可读性版本。对您的答案的解释使阅读更有趣，非常鼓舞人心。\n…。包括一个简短的标题，指示您的代码的语言及其分数，如挑战所定义的。\n点击“发布您的答案”，即表示您同意我们的服务条款、隐私政策和Cookie政策。\n不是你想要的答案吗？浏览标记的其他问题或提出您自己的问题。", "note_en": "\\$\\begingroup\\$  Your task is to build a Game of Life simulation representing a digital clock, which satisfies the following properties:\n The clock displays the hours and minutes in decimal (e.g.  12:00,  3:59,  7:24) with a different state for each of the 1,440 minutes of the day — either the hours will go from 0 to 23 or from 1 to 12 with a PM indicator.\n  The minutes update at regular intervals — from one change of minute to the next takes the same number of generations.\n An anonymous bystander is able to tell at a glance that the display is supposed to be a digital clock. In particular, this entails:\n The digits are visible and clearly distinguishable. You must be able to tell with certainty at a glance what time is being displayed.\n The digits update in place. Each new number appears in the same place as the previous number, and there is little to no movement of the bounding boxes of the digits. (In particular, a digit does not contain 10 different digits in different places that get uncovered every time the digits change.)\n The digits appear next to each other, without an excessive amount of space between them.\n  Your program will be scored on the following things, in order (with lower criteria acting as tiebreakers for higher criteria):\n Bounding box size — the rectangular box with the smallest area that completely contains the given solution wins.\n      \\$\\endgroup\\$\n  \\$\\begingroup\\$  I&#39;m pretty sure this is B3/S23, but could you confirm or deny?  \\$\\endgroup\\$\r–  Conor O&#39;Brien\n  \\$\\begingroup\\$  &#34;They must also update in place — each new number must appear in the same place as the previous number.&#34; How do you define &#34;in the same place&#34;, since the digits won&#39;t necessarily be rectangular.  \\$\\endgroup\\$\r–  Martin Ender\n  \\$\\begingroup\\$  how discernable must our decimal digits be? is &#34;if you know what it is and you squint then you can tell the difference between 0 and 8&#34; enough, or does it need to pass the &#34;an anonymous bystander can tell what it is with no prompting&#34; test?  \\$\\endgroup\\$\r–  Sparr\n  \\$\\begingroup\\$  this got posted on the Hackaday blog too :  hackaday.com/2017/03/11/a-clock-created-with-conways-life  \\$\\endgroup\\$\r–  Anool Mahidharia\n  \\$\\begingroup\\$  Well, the design is certainly not optimal. Neither from the bounding box standpoint (those 7-segment digits are  huge), nor from the initial population count (there are some useless stuff, and some stuff that could certainly be made simpler), and the execution speed - well... I&#39;m not sure.\n      Go to  the online JavaScript Conway life simulator. Click  import, paste the design text. You should see the design. Then, go to  settings and set the  generation step to 512, or something around those lines, or you&#39;ll have to wait forever to see the clock display updating.\n   Note that the only algorithm that makes this huge design useable is hashlife. But with this, you can achieve the whole clock wraparound in seconds. With other algorithms, it is impractical to even see the hour changing.\n  It uses p30 technology. Just basic things, gliders and lightweight spaceships. Basically, the design goes top-down:\n At the very top, there&#39;s the clock. It is a 11520 period clock. Note that you need about 10.000 generations to ensure the display is updated appropriately, but the design should still be stable with a clock of smaller period (about 5.000 or so - the clock needs to be multiple of 60).\n Then, there is the clock distribution stage. The clock glider is copied in a balanced tree, so at the end, there are 32 gliders arriving at the exact same moment to the counters stage.\n The counter stage is made using a RS latch for each state, and for each digit (we&#39;re counting in decimal). So there is 10 states for the right digit of the minutes, 6 states for the left digit of the minuts, and 12 states for the hours (both digits of the hours are merged here). For each of these groups, the counter behaves like a shift register.\n After the counting stage, there are the lookup tables. They convert the state pulses to display segments ON/OFF actions.\n Then, the display itself. The segments are simply made with multiple strings of LWSS. Each segment has it own latch to maintain its state. I could have made a simple logical-OR of the digit states to know wether a segment must be ON or OFF, and get rid of these latches, but there would be glitches for non-changing segments, when the digits are changing (because of signal delays). And there would be long streams of gliders coming from the lookup table to the digit segments. So it wouldn&#39;t be as nice-looking. And it needed to be. Yes.\n Anyway, there is actually nothing extraordinary in this design. There are no amazing reactions that have been discovered in this process, and no really clever combinations that nobody thought of before. Just bits taken here and there and put together (and I&#39;m not even sure I did it the &#34;right&#34; way - I was actually completely new to this). It required a lot of patience, however. Making all those gliders coming up at the right time in the right position was head-scratching.\n  Instead of copying and distributing the same root clock to the  n counter cells, I could have just put the same clock block  n times (once for each counter cell). This would actually be much simpler. But then I wouldn&#39;t be able to adjust it as easily by changing the clock at a single point... And I have an electronics background, and in a real circuit, that would be horribly wrong.\n Each segment has it own RS latch. This requires the lookup tables to output both R and S pulses. If we had a latch that would just toggle its state from a common input pulse, we could make the lookup tables half as big. There is such a latch for the PM dot, but it is huge, and I&#39;m unable to come up with something more practical.\n Make the display smaller. But that wouldn&#39;t be as nice-looking. And it needed to be. Yes.\n    \\$\\endgroup\\$\n  \\$\\begingroup\\$  @Poke come on, you could have tried to add this yourself... Anyway, I have edited the post with a version with both AM+PM, for your pleasure.  \\$\\endgroup\\$\r–  dim\n  \\$\\begingroup\\$  Just so you know, this answer has been  featured in  Microsiervos, one of the most important blogs about technology in Spanish, with over 800K followers on  Twitter  \\$\\endgroup\\$\r–  Luis Mendo\n  \\$\\begingroup\\$  @Rory You take your head, smash it on the wall a dozen times as hard as you can. You are then ready to start.  \\$\\endgroup\\$\r–  dim\n  \\$\\begingroup\\$  So the design process is: &#34;Ok, I need to collide that, and my glider comes from there in this position at this time. Let&#39;s see bring it there using two reflectors. Crap, the thing it needs to collide is just two generation steps too soon, there. If I move the reflectors a bit, let&#39;s see... Crap, too late. Ok, let&#39;s collide them some place else. Crap, I don&#39;t have the room to make my glider go there. Ok, let&#39;s add two other useless reflectors just to make it arrive there instead. Crap, the reflectors collide this other stream of glider... Crap, let&#39;s go to bed.&#34;  \\$\\endgroup\\$\r–  dim\n    …Be sure to follow the challenge specification. However, please refrain from exploiting obvious loopholes. Answers abusing any of the  standard loopholes are considered invalid. If you think a specification is unclear or underspecified, comment on the question instead.\n  …Try to optimize your score. For instance, answers to   challenges should attempt to be as short as possible. You can always include a readable version of the code in addition to the competitive one.\r  Explanations of your answer make it more interesting to read and are very much encouraged.\n  …Include a short header which indicates the language(s) of your code and its score,  as defined by the challenge.\n    By clicking “Post Your Answer”, you agree to our  terms of service,  privacy policy and  cookie policy\n  Not the answer you&#39;re looking for? Browse other questions tagged     or  ask your own question.", "posttime": "2020-05-19 10:15:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,生活,digital,数字", "title": "在康威的“生活的游戏”中制作数字钟", "title_en": "Build a digital clock in Conway's Game of Life", "transed": 1, "url": "https://codegolf.stackexchange.com/questions/88783/build-a-digital-clock-in-conways-game-of-life", "via": "", "real_tags": ["游戏", "生活", "digital", "数字"]}, {"category": "", "categoryclass": "", "imagename": "0a1837bfba89f9f25c47a21efb2272b4.jpg", "infoid": 1002725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的48小时里，Windows 10的另一个更新--KB4556799--对终端用户的PC造成了严重破坏。今天早上，我醒来时发现，我正在使用的几个系统用来对PC硬件进行基准测试，这些系统充斥着问题。\n这一更新声称改进了各种安全措施，还包括存储和管理文件的更新。不幸的是，这似乎导致了蓝屏死亡(BSOD)、稳定性问题和乱码音频，因为文件实际上是被隐藏或删除的，Windows或他们使用的软件找不到这些文件。\n今天早上，我自己的问题，在更新偷偷溜进来之后，看到我的电脑处于BSOD的持续重启周期中，指向内存、显卡和其他错误。最终，我设法进入了操作系统，并使用系统还原功能获得了它们的原样，现在这个方法已经奏效了。\n在另一个系统上，几个程序声称各种文件丢失了，但前一天晚上PC工作正常-在这里，只需删除令人不快的更新就可以解决问题。其中很多都是严重的DLL文件，因此如果您再次遇到同样的问题，请检查是否已安装更新KB4556799并将其清除。\n在微软自己的论坛上已经有大量帖子，Windows最新网站也指向导致音频问题的更新，以及Reddit上关于系统减速和无法解释的软件崩溃的各种帖子。\n此外，请务必在Windows Update设置的高级选项部分关闭更新并尽可能长时间地延迟更新，直到微软解决了另一场灾难。", "note_en": "The last 48 hours has seen another Windows 10 update - KB4556799 - wreak havoc on end user&#39;s PCs and this morning, I woke to find several systems I&#39;m using to benchmark PC hardware riddled with problems.\n    The update, which claims to improve various security measures also states includes  &#39;Updates for storing and managing files.&#39; Unfortunately, this appears to have caused blue screens of death (BSOD), stability issues and garbled audio as files are literally being hidden or deleted and cannot be found by Windows or the software they use.\n  My own problems this morning, after the update sneaked in, saw my PC sit in a continual reboot cycle of BSODs pointing at memory, graphics card and other errors. Eventually I managed to get into the OS and used system restore to get things as they were and this has worked for now.\n     On another system, several programs claimed that various files were missing, yet the PC was working fine the night before - here, simply removing the offending update fixed the issue. A lot of these were critial dll files so if you&#39;re experience the same issues, check to see if update KB4556799 has been installed and get rid of it.\n  There are already numerous posts on  Microsoft&#39;s own forum with website  Windows Latest also pointing at the update causing audio issues and various posts including  this one on Reddit about system slow downs and unexplained software crashes.\n    Also be sure to switch off updates and delay them for as long as possible in the advanced options section of Windows Update&#39;s settings till Microsoft sorts out what is yet another disaster.", "posttime": "2020-05-19 10:14:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,windows-10,隐藏,hides,pc", "title": "新的Windows 10更新隐藏文件，给数百万人带来严重问题", "title_en": "New Windows 10 Update Hides Files Causing Serious Problems for Millions", "transed": 1, "url": "https://www.forbes.com/sites/antonyleather/2020/05/18/new-windows-10-update-deletes-files-causing-serious-problems-for-millions/", "via": "", "real_tags": ["windows", "隐藏", "hides", "pc"]}, {"category": "", "categoryclass": "", "imagename": "e27063594934f3e38e2b3851fa773a13.png", "infoid": 1002724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "给你学点蟒蛇。我们已经与No Stack Press合作开设了一堂Python速成课程！使用电子书快速学习基本要领，如使用Python自动化枯燥的东西，第2版：面向总初学者的实用编程，使用Python破解代码：构建和破解密码的入门，用Python发明自己的计算机游戏，第4版，Python Crash课程，第2版：动手，基于项目的编程入门，等等。另外，您的购买将支持书业慈善基金会和无淀粉出版社基金会！\n支付1美元或更多。通常情况下，捆绑在一起的电子书的总成本高达375美元。在Humble Bundle这里，您可以选择价格并增加您的贡献来升级您的捆绑包！此捆绑包的最低购买金额为1美元。\n随时随地阅读它们。此捆绑包中的电子书有PDF、MOBI和ePub格式，因此可以在您的计算机、电子阅读器、iPad、手机和各种移动设备上使用！说明和推荐阅读程序列表可以在这里找到。\n支持慈善事业。选择资金的去向-通过贝宝捐赠基金在出版商、图书行业慈善基金会(BINC)和无淀粉出版社基金会之间进行选择。如果你喜欢我们的工作，你也可以给我们一个谦虚的小费！", "note_en": "Learn you some Python. We&#39;ve teamed up with No Starch Press for a crash course on Python! Learn the essentials quickly with ebooks like  Automate the Boring Stuff with Python, 2nd Edition: Practical Programming for Total Beginners, Cracking Codes with Python: An Introduction to Building and Breaking Ciphers, Invent Your Own Computer Games with Python, 4th Edition, Python Crash Course, 2nd Edition: A Hands-On, Project-Based Introduction to Programming, and more. Plus, your purchase will support the Book Industry Charitable Foundation and No Starch Press Foundation!\n Pay US$1 or more. Normally, the total cost for the ebooks in this bundle is as much as US$375. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum US$1 purchase.\n Read them anywhere. The ebooks in this bundle are available in PDF, MOBI, and ePub formats, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found  here.\n Support charity. Choose where the money goes - between the publisher, Book Industry Charitable Foundation (Binc) and No Starch Press Foundation via  PayPal Giving Fund. If you like what we do, you can leave us a Humble Tip too!", "posttime": "2020-05-19 10:14:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,学习,book", "title": "卑微的书包：向你学习无淀粉出版社的蟒蛇", "title_en": "Humble Book Bundle: Learn You Some Python by No Starch Press", "transed": 1, "url": "https://www.humblebundle.com/books/learn-you-some-python-no-starch-press-books?mc_cid=b822cd8611&mc_eid=443b882743", "via": "", "real_tags": ["python", "学习", "book"]}, {"category": "", "categoryclass": "", "imagename": "1292324ec2db09424570c51bd61bcbda.jpg", "infoid": 1002722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新墨西哥州一对犹太退休人员的家中发现了一辆被盗的德库宁汽车。这不是他们唯一的秘密。", "note_en": "A stolen de Kooning was found in the New Mexico home of a pair of Jewish retirees. It wasn’t their only secret.", "posttime": "2020-05-19 09:58:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "painting,退休", "title": "门后的那幅画", "title_en": "The Painting Behind the Door", "transed": 1, "url": "https://www.tabletmag.com/sections/arts-letters/articles/de-kooning-art-theft", "via": "", "real_tags": ["painting", "退休"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "将您自己的脚本注入到黑盒进程中。挂钩任何函数，监视加密API或跟踪私有应用程序代码，不需要源代码。编辑，点击保存，立即看到结果。所有这些都不需要编译步骤或程序重启。\n适用于Windows、MacOS、GNU/Linux、iOS、Android和QNX。从NPM安装Node.js绑定，从PyPI获取Python包，或者通过其SWIFT绑定、.NET绑定、Qt/QML绑定或C API使用Frida。\nFrida现在是，将来也永远是自由软件(自由，就像自由一样)。我们希望支持下一代开发工具，并帮助其他自由软件开发人员通过逆向工程实现互操作性。\n我们感到自豪的是，NoowSecure正在使用Frida对大规模的移动应用进行快速、深入的分析。Frida拥有一套全面的测试套件，并在广泛的用例中通过了多年的严格测试。", "note_en": "Inject your own scripts into black box processes. Hook any function, spy on crypto APIs or trace private application code, no source code needed. Edit, hit save, and instantly see the results. All without compilation steps or program restarts.\n  Works on Windows, macOS,  GNU/Linux, iOS, Android, and QNX. Install the Node.js bindings from  npm, grab a Python package from  PyPI, or use Frida through its  Swift bindings,  .NET bindings,  Qt/Qml bindings, or  C API.\n  Frida is and will always be  free software (free as in freedom). We want to empower the next generation of developer tools, and help other free software developers achieve interoperability through reverse engineering.\n  We are proud that  NowSecure is using Frida to do fast, deep analysis of mobile apps  at scale. Frida has a comprehensive test-suite and has gone through years of rigorous testing across a broad range of use-cases.", "posttime": "2020-05-19 09:58:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,gresemonkey,greasemonkey,绑定", "title": "FRIDA-GRESEMONKEY for Native Apps", "title_en": "Frida – Greasemonkey for Native Apps", "transed": 1, "url": "https://frida.re/", "via": "", "real_tags": ["app", "绑定"]}, {"category": "", "categoryclass": "", "imagename": "5234bc4212423e66b795cbd843204fc9.jpg", "infoid": 1002720, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔·拜登(Joe Biden)被指控性侵犯，保守派人士欢欣鼓舞，因为他们发现女权主义者陷入了新的虚伪陷阱。一个女人，除了同时代的描述之外，没有任何佐证，却指控一个有权势的男人犯下了几十年的罪行？嗯，这听起来是不是和克里斯汀·布莱西·福特对最高法院提名人布雷特·卡瓦诺(Brett Kavanaugh)的控诉非常接近？然而，这一次，许多支持#MeToo运动的自由派似乎持怀疑态度？\n“新闻终结者”(NewsBusters)执行主编蒂姆·格雷厄姆(Tim Graham)：“这个故事的#MeToo运动在哪里？他们刻板的“相信所有女人”的套话怎么了？“。\n福克斯新闻主持人塔克·卡尔森：“媒体和职业女权运动令人气愤、令人作呕的伪善。“相信所有的女人！”不，他们没有。“。\n白宫顾问凯莉安·康韦(Kellyanne Conway)说：“三个神奇的词，‘相信所有女人。’我没有听到星号；我没有看到脚注，‘相信所有女性，只要她们攻击与特朗普总统结盟的人；相信所有女性，只要她们-拥有大学学位或更高学历-是支持在第九个月堕胎的。’“。\n事实上，“相信所有的女人”确实有一个星号：*它从来都不是女权主义的“样板”。我们正在目睹的是右翼谴责其想象中的美国妇女运动的另一个例子。\n花几个小时在社交媒体网站和新闻数据库上追踪“相信所有女人”的起源-就像我做的那样-你会发现语言就像病毒一样，可以在一夜之间发生变异。突然之间，昨天的语录遭受了一些外来DNA的插入，这使得它们很容易武器化。在这种情况下，外来入侵是一个词：“所有”。\n在卡瓦诺的听证会上，“全部”插入风靡一时。当从卡玛拉·哈里斯(Kamala Harris)到玛齐·希罗诺(Mazie Hirono)等参议员对布拉西博士的信任被福克斯新闻(Fox News)的权威人士提升为普遍的性别轻信时，他们实际上说的“我相信她”变成了所有女性的信条。前福克斯新闻撰稿人摩根·奥尔塔格斯在2019年2月表示：“这就是真正的标签。”“Twitter上有一个很棒的搜索功能，你可以搜索#BelieveAllWomen。对于那些不相信这一点的人来说，民主党在卡瓦诺一案中就是这样。“。\n有意义地跟踪Twitter上的标签是一件令人困惑的琐事，即使是对我咨询的专业数据刮除者来说也是如此。“这是一个非常有趣的兔子洞，”哈佛大学施莱辛格图书馆的数字档案员巴勃罗·莫拉莱斯·亨利(Pablo Morales Henry)告诉我。施莱辛格图书馆拥有3000多万条与地铁相关的推文。\n不过，还是让我们接受奥尔塔格斯的挑战吧。正如她所指出的，Twitter有一项搜索功能，虽然算不上“很棒”，但至少粗略地反映了该网站的使用情况-特别是最受欢迎的用户，他们最有可能将标签传播得更远更广。例如，输入2016年的#BlackLivesMatter或#MakeamericaGreatAain“，你就会得到无穷无尽的参考资料。输入#BelieveAllWomen for 2017，当时#MeToo运动在10月份开始，你会得到几十个参考文献，紧随其后的是2018年(卡瓦诺听证会之年)更多的参考文献。但事情是这样的：我发现，这个标签在很大程度上主要是由诋毁它的人使用的。\n似乎#BelieveAllWomen第一次出现在推特上是在2014年底，当时有三条推文--分别是安大略省的一位助产士、多伦多的一位教育家和“终身学习者”，以及“珍娜和坎普·凯拉，一对来自渥太华的双胞胎，她们在业余时间策划活动。”加起来如下：不到4000名追随者。\n然后，在2015年秋天，希拉里·克林顿发布了一条推文：“致每一位性侵…的幸存者。你有权发表意见。你有权被人相信。“。胡安妮塔·布罗德里克(Juanita Broaddrick)声称比尔·克林顿(Bill Clinton)在1978年强奸了她，2016年1月6日，她在推特上回应称，“希拉里试图让我保持沉默。”保守派编辑大卫·弗伦奇(David French)在Twitter上拥有大量追随者(截至撰写本文时，追随者超过20.9万人)，他立即转发了布罗德里克，并附上了#BelieveAllWomen(BelieveAllWomen)的标签，紧随其后的是四个问号。\n碰巧的是，这个被右翼吹成篝火的谣言，在主流媒体上成为了公认的事实，从NPR到《纽约时报》，再到加拿大的《环球邮报》(The Globe And Mail)，声明将#BelieveAllWomen描述为“#MeToo运动的战斗口号”，“当天的秩序”，以及“如果有的话，一个司法不公的公式”。\n上周，当梅根·凯利(Megyn Kelly)在接受塔拉·里德(Tara Reade)采访时说，一切都回到了原点。“一些最常吹捧‘我们必须相信所有女性’的人，比如在最高法院的卡瓦诺听证会上，当谈到你时，似乎肯定改变了语气。”\n在我的网上搜索中，我遇到了一些女权主义者，他们似乎真心支持这个短语。但压倒性的是，部署这一短语的Twitter成员是保守派，他们把它当作鞭子挥舞。为什么？\n因为右翼知道#我也是(#MeToo)积极分子应该牢记的是什么：危险在于纯洁。如果女性运动的多元性能够在公众心目中沦为僵化的样板，那么#我也是(#MeToo)的未来将从它誓言捍卫的单个不诚实的女性身上损失更多，而不是从成船的掠夺性男性身上损失更多。\n这就是为什么“相信所有的女人”不是对“相信女人”的放大，而是它的否定。正如施莱辛格图书馆的莫拉莱斯·亨利先生告诉我的那样，在对这两个标签的使用进行了几天的分析之后，“看起来#BelieveAllWomen，特别是最近，正在被用来反对#BelieveWomen。”在针对自由派政客的指控中，它的使用激增-通常伴随着谴责双重标准的配套标签。\n双标准纯度测试只在一个方向上运行。保守派人士对自己厚颜无耻的伪善并不感到不安，这不是他们在玩的游戏。凯莉安·康韦(Kellyanne Conway)声称，在走回白宫之前，“相信所有女性”是“亲女性”的？\n令人奇怪的是，保守派被他们的无耻所免疫。引用W·B·叶芝(W.B.Yeats)的话说，你是如何与“一个/谁，被证明他撒谎了/既不在自己/也不在邻居眼里蒙羞”进行斗争的？右翼反对原则，很早就知道如何将左翼的原则性表达变成阿喀琉斯的脚跟。即使当它不得不编造表达式的时候。\n女权主义确实相信很多关于“所有女性”的事情。所有妇女都应该在法律下得到平等待遇，在工作场所同工同酬，生殖健康，免受家庭暴力。女权主义者长期以来一直认为，当“所有”指的是所有类别的女性时，就应该相信“所有女性”-即，无论种族、宗教或经济地位如何，都是平等的。这就是安妮塔·希尔(Anita Hill)2017年在CNN市政厅说的话的意思，“除非我们能相信所有女性，每个女性的声音都有价值，否则我们中没有人会真正被视为平等。”阅读她的全部评论，很明显，她并不是平等地对待每一个女性，而是平等地对待“所有种族、所有年龄、各种大小、各种背景”的女性。\n祝你好运，找到任何一个认为我们应该相信所有女性所说的一切的女权主义者-即使是她们关于性侵犯的说法。历史充分证明，当一个不应该相信的女人或男人被相信时，可能会发生可怕的事情：还记得“斯科茨伯勒男孩”(Scottsboro Boys)吗？\n至少从90年代末开始，GOGCHA保守主义的专长就一直在谴责女权主义者未能兑现他们的教条主义标签。首先，将女权主义者讽刺为一群集体思维的极权主义者，然后每次他们步调一致时都指责他们虚伪。但你猜怎么着？女权主义从来没有在五分钟内步调一致。如果说有什么不同的话，那就是我们往往更多地是相互掐着喉咙，而不是列队行进。从与女性抗争的可比性到色情，再到#MeToo，从玛格丽特·阿特伍德到你们的女权主义者都在讨论比例和正当程序。女权主义内部广泛的意见是其优势之一，而不是弱点。如果女权主义者看到安妮塔·希尔、莫妮卡·莱温斯基、克里斯汀·布莱西·福特和塔拉·里德之间的区别，我会说她们是在做自己的工作。那不是虚伪，那是正直。\n最终的虚伪将是一场妇女运动，它聚集在简约标签的旗帜下，谈论每个女性的想法。女权主义诞生于一种愿望，即女性被视为个体，而不是千篇一律的理想或无名的刻板印象。当我在数据库中搜索女性关于“相信所有女性”的实际声明时，我发现的是女性呼吁不要用普遍的术语来定义-“我不相信所有的女性都有生育的愿望”或“我不相信所有女性的兴趣都是一样的”-以及对试图对自己的性别进行分类的愤怒。\n这就是为什么#我也是(#MeToo)运动的首选标签是#BelieveWomen。没有“全部”就不一样了。相信女人只不过是对古老的#DoubtWomen做法的反驳。\n因为，正如女性所见证的那样，被怀疑会导致时间的流逝。2017年，一个人在Twitter上写道，关于一名前夫在圣诞节谋杀了他的两个年幼女儿的案件，“你知道人们还应该#BelieveWomen说些什么吗？”当他们向当局报告他们虐待的前男友，并担心他们的安全和孩子的安全时。撕裂珍贵的女孩。“\n或者，另一位在一名持怀疑态度的法官拒绝向她发出保护令后，对一名妇女被丈夫殴打致死的消息做出了令人震惊的回复，恳求“怀疑论文化”“试一试”和“#bw”。不被信任的说法太多了，无法列出，而且名单越来越长。一名女子在回应媒体关于一名学生被一名被判有罪的性犯罪者跟踪并杀害的报道后写道：“当我们说#相信女人时，这对我们来说可能是生死攸关的问题。”此前，她向校园警察和911提出申诉，数周来一直没有人理睬。\n不让它的信息和使命被劫持和歪曲，对妇女运动来说是生死攸关的。女权主义存在的根本原因是将每个女性从“所有女性”的概念中解放出来。它的未来取决于对这一信念的全力捍卫。\n苏珊·法鲁迪(Susan Faludi)是一名记者和作家，最近出版了回忆录“在暗室里”(In The Darkroom)。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "Joe Biden has been accused of sexual assault, and conservatives are having a field day, exultant that they’ve caught feminists in a new hypocrisy trap. A woman, with no corroboration beyond contemporaneous accounts, charges a powerful man with a decades-old crime? Hmm, doesn’t that sound mighty close to Christine Blasey Ford’s complaint against Supreme Court nominee Brett Kavanaugh? Yet this time, many liberals who’ve championed the #MeToo movement seem skeptical?\n Tim Graham, executive editor of NewsBusters: “Where is the #MeToo movement on this story? What happened to their rigid ‘Believe All Women’ boilerplate?”\n Fox News host  Tucker Carlson: “the infuriating, the sickening hypocrisy of the media and the professional feminist movement. ‘Believe All Women!’ No they don’t.”\n White House adviser Kellyanne Conway: “Three magic words, ‘Believe All Women.’ I didn’t hear an asterisk; I didn’t see a footnote, ‘Believe All Women so long as they are attacking somebody aligned with President Trump, Believe All Women so long as they are — have a college degree or better or are — are for abortion in the ninth month.’”\n In fact, “Believe All Women” does have an asterisk: *It’s never been feminist “boilerplate.” What we are witnessing is another instance of the right decrying what it imagines the American women’s movement to be.\n Spend some mind-numbing hours tracking the origins of “Believe All Women” on social media sites and news databases — as I did — and you’ll discover how language, like a virus, can mutate overnight. All of a sudden, yesterday’s quotes suffer the insertion of some foreign DNA that makes them easy to weaponize. In this case, that foreign intrusion is a word: “all.”\n “All” insertion was all the rage during the Kavanaugh hearings. When senators from Kamala Harris to Mazie Hirono had their regard for Dr. Blasey’s credibility elevated by Fox News pundits to universal gender credulity, their actual words, “I believe her,” became  believe all women. “That’s literally the hashtag,” former Fox News contributor Morgan Ortagus said in February 2019. “There’s a great search function on Twitter, and you can search the #BelieveAllWomen. For those of you who don’t believe that’s what the Democrats had in the case of Kavanaugh.”\n  Meaningfully tracking hashtags on Twitter is a confounding chore, even for the professional data scrapers I consulted. “It’s a very interesting rabbit hole,” Pablo Morales Henry, digital archivist at Harvard University’s Schlesinger Library, which  maintains a collection of more than 30 million MeToo-related tweets, told me.\n Nevertheless, let’s take the Ortagus challenge. As she noted, Twitter has a search function that, while hardly “great,” does at least crudely reflect the site’s use — especially by its most popular users who are most likely to spread a hashtag far and wide. For instance, type in #BlackLivesMatter or #MakeAmericaGreatAgain” for 2016, and you get a bottomless well of references. Type in #BelieveAllWomen for 2017, when the #MeToo movement took off in October, and you get several dozen references, followed in 2018 (the year of the Kavanaugh hearings) by many more. But here’s the thing: I found that the hashtag is, by a wide margin, used mostly by its detractors.\n It seems that #BelieveAllWomen first appeared on Twitter in late 2014, in three tweets — by an  Ontario midwife, a Toronto educator and “ lifelong learner” and “ Jenna &amp; Kayla, twins from Ottawa who plan events in their spare time.” Combined following: fewer than 4,000 followers.\n Then, in the fall of 2015, Hillary Clinton posted a  tweet: “To every survivor of sexual assault … you have the right to be heard. You have the right to be believed.” To which Juanita Broaddrick, who alleges that Bill Clinton raped her in 1978,  responded on Twitter on Jan. 6, 2016, “Hillary tried to silence me.” Conservative editor David French, who has a large Twitter following (more than 209,000 followers as of this writing), retweeted Ms. Broaddrick at once — attaching the hashtag #BelieveAllWomen, followed by four question marks.\n  As happens, the canard, blown into a bonfire by the right, became accepted truth in mainstream media, from NPR to The New York Times to The Globe and Mail in Canada, with pronouncements characterizing #BelieveAllWomen as “the rallying cry of the #metoo movement,” “ the order of the day” and “ a formula for miscarriage of justice if ever there was one.”\n  It all came full circle last week, when Megyn Kelly  said in her interview with Tara Reade, “Some of those who touted the ‘we must believe all women’ line the most, during, for example, the Kavanaugh hearings for the Supreme Court, certainly seem to have changed their tune when it comes to you.”\n In my online searches, I encountered some feminists who seemed genuinely to subscribe to the phrase. But overwhelmingly, the Twitterati deploying the phrase were conservatives, wielding it as a whip. Why?\n Because the right knows what #MeToo activists do well to keep in mind: Peril lies in purity. If the pluralism of the women’s movement can be reduced to rigid boilerplate in the public mind, then the future of #MeToo will have more to lose from a single untruthful woman whom it’s sworn to defend than from boatloads of predatory men.\n This is why “Believe All Women” is not an amplification of “Believe Women,” but its negation. As Mr. Morales Henry at the Schlesinger Library told me, after several days of analyzing the use of the two hashtags, “It looks like #BelieveAllWomen, especially recently, is being used in opposition to #BelieveWomen.” Its use spikes on occasions when allegations are made against a liberal politician — often with companion hashtags decrying a double standard.\n The double-standard purity test operates in one direction only. Conservatives are unfazed by their own brazen hypocrisies; that’s not the game they’re playing. Kellyanne Conway claiming it’s “pro-woman” to “believe all women,” before walking back into  that White House?\n  Conservatives have been oddly immunized by their shamelessness. How do you fight, to quote W.B. Yeats, “with one/Who, were it proved he lies,/Were neither shamed in his own/Nor in his neighbours’ eyes”? The right, being averse to principle, has long known how to turn the left’s expressions of principle into Achilles’ heels. Even when it has to make up the expression.\n Feminism has, indeed, believed many things about “all women.” That all women are deserving of equal treatment under the law, equal pay in the workplace, reproductive health, freedom from domestic violence. And feminists have long held that “all women” should be believed when the “all” refers to all categories of women — i.e., equal regardless of race, religion or economic status. This is what Anita Hill meant when she said in a  CNN town hall in 2017, “And until we can believe all women, every woman’s voice has value, none of us really will be seen as equal.” Read her comments in full, and it’s clear she wasn’t giving equal credence to every individual woman, but equal standing to women of “all races, all ages, all sizes, all backgrounds.”\n Good luck finding any feminist who thinks we should believe everything all women say — even what they say about sexual assault. History offers ample evidence of the horrors that can ensue when a woman or a man is believed who shouldn’t be: Remember the  Scottsboro Boys?\n Since at least the late ’90s, gotcha conservativism’s specialty has been condemning feminists for failing to live up to their dogmatist label. First, caricature feminists as a bunch of groupthink totalitarians, then accuse them of hypocrisy every time they are not in lock step. But guess what? Feminism has never, for five minutes, been about lock step. If anything, we tend to be at each other’s throats more often than we’re marching in ranks. And that’s on subjects from comparable worth to women in combat to pornography to #MeToo, where feminists from  Margaret Atwood to  yours truly have argued for proportion and due process. The broad spectrum of opinion within feminism is one of its strengths, not a frailty. If feminists see distinctions between Anita Hill, Monica Lewinsky, Christine Blasey Ford and Tara Reade, I’d say they’re doing their jobs. That’s not hypocrisy, that’s integrity.\n The ultimate hypocrisy would be a women’s movement that rallies behind the banner of reductive hashtags about what every woman thinks. Feminism was birthed out of a desire that women be treated as individuals, not as a cookie-cutter ideal or a faceless stereotype. When I searched databases for women’s actual statements on “believe all women,” what I found were appeals by women  not to be defined in universal terms — “I do not believe all women are born with the desire to reproduce” or “I don’t believe all women’s interests are the same” — and outrage at attempts to categorize their sex.\n This is why the preferred hashtag of the #MeToo movement is #BelieveWomen. It’s different without the “all.” Believing women is simply the rejoinder to the ancient practice of #DoubtWomen.\n For to be disbelieved has consequences, as women have witnessed, time out of mind. As one person  wrote on Twitter in 2017, concerning a case in which an ex-husband murdered his two young daughters on Christmas, “You know what else people should #BelieveWomen about? When they tell authorities about their abusive ex and have concerns about their safety and the safety of their children. RIP precious girls.”\n Or another who implored the “skeptic culture” to “give it a try” and “#bw,” in a stricken reply to the news of a woman beaten to death by her husband after a doubting judge denied her a protective order. The accounts of not being believed are too legion to list, and the list grows longer. A woman, responding to press reports of a student stalked and murdered by a convicted sex offender — after her appeals to campus police and 911 went unheeded for weeks —  wrote, “When we say #believewomen, it’s because this can literally be a matter of life or death for us.”\n And not having its message and mission hijacked and distorted can be life or death for the women’s movement. Feminism’s bedrock reason for being is to free every woman from the concept of “all women.” Its future rests on a full-throated defense of that belief.\n  Susan Faludi is a journalist and an author, most recently of the memoir “In the Darkroom.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-05-19 09:57:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "右翼,wing,女性", "title": "“相信所有女人”是一个右翼陷阱", "title_en": "‘Believe All Women’ Is a Right-Wing Trap", "transed": 1, "url": "https://www.nytimes.com/2020/05/18/opinion/tara-reade-believe-all-women.html", "via": "", "real_tags": ["右翼", "wing", "女性"]}, {"category": "", "categoryclass": "", "imagename": "dcfac43dbbaee6b504aabfec4b9c3e41.jpeg", "infoid": 1002719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年12月，一名与美军一起训练的沙特阿拉伯学员在彭萨科拉海军航空站开火，造成3名士兵死亡，8人受伤。联邦调查局找回了两部iPhone，在未能访问他们的数据后，要求苹果解锁。该公司拒绝了，但最终FBI在没有苹果帮助的情况下解锁了其中至少一个，并发现枪手与恐怖组织基地组织之间存在实质性联系。美国司法部长巴尔建议迫使苹果公司在未来采取行动，他说：“……如果不是我们的联邦调查局的独创性，一些运气，以及几个小时的时间和资源，这些信息就不会被发现。底线是：我们的国家安全不能继续掌握在大公司手中，他们把钱放在合法进入和公共安全上。现在是通过立法解决问题的时候了。“。\n目前尚不清楚枪击事件是否是基地组织的命令，但数据显示，枪手与该组织保持了较长时间的联系，包括其领导层。在袭击期间，他开枪打死了两部手机，试图摧毁它们，他一直在使用端到端加密的应用程序，以便与恐怖组织沟通。尽管司法部长巴尔和联邦调查局局长克里斯·雷表示，如果苹果帮助解锁手机，结果会更快出来。\n美国公民自由联盟高级幕僚检察官布雷特·马克斯·考夫曼回应巴尔的评论说，每次发生需要对数字设备进行调查的创伤性事件时，司法部都会大声宣称需要后门进行加密，然后悄悄宣布它确实找到了一种在不威胁整个世界安全和隐私的情况下获取信息的方法。那个喊狼来了的男孩对高喊加密的机构一无所知。尽管巴尔推动后门和手机制造商的合作引起了担忧，但考夫曼的回应并没有提到司法部不是在寻求解锁手机的能力，而是希望尽快做到这一点。\n多年来，苹果拒绝与执法部门合作一直是个问题。该公司希望确保其用户对信任苹果的数据充满信心，但警方和联邦调查局表示，拒绝合作阻碍了调查，并将生命置于危险之中。听起来巴尔想要将一项制度写入法律，迫使苹果公司在未来的案件中遵守这一制度。这项计划有多现实--或者它会得到多少政客的支持--还有待观察，尽管它将迫使苹果重新考虑如何处理用户隐私。", "note_en": "Last December, a Saudi Arabian cadet training with the US military opened fire at Naval Air Station Pensacola, killing three soldiers and wounding eight others. The FBI recovered two iPhones, and after failing to access their data,  asked Apple to unlock them. The company refused, but eventually the FBI unlocked at least one of them without Apple’s help, and discovered substantial ties between the shooter and terrorist group al Qaeda.  US Attorney General Barr suggests  forcing Apple to take action in the future, saying “...if not for our FBI’s ingenuity, some luck, and hours upon hours of time and resources, this information would have remained undiscovered. The bottom line: our national security cannot remain in the hands of big corporations who put dollars over lawful access and public safety. The time has come for a legislative solution.”\n It’s not clear if the shooting was an order from al Qaeda, but the data shows that the shooter was in touch for an extended period of time with the organization, including its leadership. During the attack, he shot both phones in an attempt to destroy them, and he had been using apps with end-to-end encryption in order to communicate with the terrorist group. The FBI was able to access the data regardless, though Attorney General Barr and FBI Director Chris Wray suggest that results would have come much quicker if Apple had helped to unlock the phones.\n  ACLU Senior Staff Attorney Brett Max Kaufman responded to Barr’s comments, saying &#34;Every time there’s a traumatic event requiring investigation into digital devices, the Justice Department loudly claims that it needs backdoors to encryption, and then quietly announces it actually found a way to access information without threatening the security and privacy of the entire world. The boy who cried wolf has nothing on the agency that cried encryption.&#34; While Barr’s push for backdoors and cooperation from phone manufacturers raises concerns, Kaufman’s response doesn’t address that the DoJ isn’t seeking the ability to unlock phones, but to do so as quickly as possible.\n Apple’s refusal to work with law enforcement  has been an issue for years. The company wants to ensure its users feel confident in trusting Apple with their data, yet police and the FBI say that the refusals to cooperate hinder investigations and put lives at risk. It sounds like Barr wants to put a system into law that would oblige Apple to comply in future cases. How realistic this plan is -- or how much buy-in from politicians it will get -- remains to be seen, though it would force Apple to rethink how it approaches user privacy.", "posttime": "2020-05-19 09:28:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,barr,苹果", "title": "AG Barr寻求“立法解决方案”让公司解锁手机", "title_en": "AG Barr Seeks 'Legislative Solution' To Make Companies Unlock Phones", "transed": 1, "url": "https://www.engadget.com/barr-legislation-apple-unlock-iphones-165628162.html", "via": "", "real_tags": ["手机", "barr", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "52a1c8f3affc523bae8bc96d336a3030.png", "infoid": 1002718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "：Electronics：使用JavaScript、HTML和CSS构建跨平台桌面应用程序-电子/电子", "note_en": ":electron: Build cross-platform desktop apps with JavaScript, HTML, and CSS - electron/electron", "posttime": "2020-05-19 09:12:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子,electron", "title": "电子v9.0.0", "title_en": "Electron v9.0.0", "transed": 1, "url": "https://github.com/electron/electron/releases/tag/v9.0.0", "via": "", "real_tags": ["电子", "electron"]}]