[{"category": "", "categoryclass": "", "imagename": "1fe0f546f0ed6682c5e5782af6826d44.jpg", "infoid": 1013397, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "出于对“离线危害”的担忧，该公司解释说，它将开始区别对待平台上的QAnon内容，从其趋势页面和算法推荐中删除相关主题，并屏蔽任何相关的URL。Twitter还表示，将永久暂停任何此前已被暂停的关于Qanon的推文账户，协调针对个人的骚扰，或在多个账户之间放大相同的内容。\n我们将永久暂停有关这些话题的推文账户，我们知道这些账户违反了我们的多账户政策，协调了围绕个别受害者的辱骂，或者试图逃避之前的暂停-最近几周我们看到了更多的情况。\nTwitter表示，执法将于本周生效，该公司将在未来做出相关的平台政策选择时，继续提供透明度和额外的背景。据Twitter的一位发言人表示，该公司认为其行动将影响15万个账户，超过7000个QAnon相关账户已经因违反平台操纵、规避禁令和垃圾邮件的规定而被删除。\nQAnon出现在特朗普时代，该阴谋的追随者普遍热情支持总统，经常出现在他的集会和其他支持特朗普的活动中。QAnon的支持者认为，特朗普总统正在与被称为深州(Deep State)的秘密精英发动一场隐蔽的战斗。在他们看来，这场秘密斗争产生了许许多多的线索，他们声称这些线索被编码在散布在匿名在线账户上的信息中，并由总统本人暗示。\nQAnon最出名的是它与Pizzagate的联系，Pizzagate是一个毫无根据的阴谋，指控希拉里·克林顿(Hillary Clinton)在华盛顿特区的一家披萨店外运行性交易团伙。这一阴谋激发了一名武装信徒出现在披萨店，在那里他在餐厅内开枪，尽管没有人受伤。\n虽然阴谋论是精心设计的，奇怪的，而且大多语无伦次，但它已经在其他主流地方涌现出来。上周，纽约市最著名的警察工会之一的负责人埃德·穆林斯(Ed Mullins)在福克斯新闻(Fox News)上发表了现场讲话，他的杯子上印着QAnon的标志，镜头清晰可见。在俄勒冈州，QAnon的一名支持者赢得了她的初选，成为该州的共和党参议院提名人。", "note_en": "Citing concerns about “offline harm,” the company explained that it would begin treating QAnon content on the platform differently, removing related topics from its trending pages and algorithmic recommendations and blocking any associated URLs. Twitter also said that it would permanently suspend any accounts tweeting about QAnon that have previously been suspended, coordinate harassment against individuals or amplify identical content across multiple accounts.\n We will permanently suspend accounts Tweeting about these topics that we know are engaged in violations of our multi-account policy, coordinating abuse around individual victims, or are attempting to evade a previous suspension — something we’ve seen more of in recent weeks.\n Twitter says the enforcement will go into effect this week and that the company would continue to provide transparency and additional context as it makes related platform policy choices going forward. According to a Twitter spokesperson, the company believes its action will affect 150,000 accounts and more than 7,000 QAnon-related accounts have already been removed for breaking the rules around platform manipulation, evading a ban and spam.\n QAnon  emerged in the Trump era and the conspiracy’s adherents generally fervently support the president, making frequent appearances at his rallies and other pro-Trump events. QAnon’s supporters believe that President Trump is waging a hidden battle against a secretive elite known as the Deep State. In their eyes, that secret battle produces many, many clues that they claim are encoded in messages sprinkled across anonymous online accounts and hinted at by the president himself.\n QAnon is best known for its connection to Pizzagate, a baseless conspiracy that accused Hillary Clinton of running a sex trafficking ring out of a Washington D.C. pizza place. The conspiracy inspired an armed believer to show up to the pizza shop, where he fired a rifle inside the restaurant, though no one was injured.\n While the conspiracy theory is elaborate, odd, and mostly incoherent, it’s been popping up in other mainstream places. Last week, Ed Mullins, the head of one of New York City’s most prominent police unions, spoke live on Fox News with a  mug featuring the QAnon logo within clear view of the camera. In Oregon, a QAnon supporter won her primary to become the state’s  Republican nominee for the Senate.", "posttime": "2020-07-22 09:12:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,阴谋论,cracks,qanon", "title": "\n推特打击QAnon阴谋论，封禁7000个账号", "title_en": "\n\t\t\t\tTwitter cracks down on QAnon conspiracy theory, banning 7,000 accounts\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/twitter-qanon-ban/", "via": "", "real_tags": ["推特", "阴谋论", "cracks", "qanon"]}, {"category": "", "categoryclass": "", "imagename": "d4d7e7ab89c07ce58b3dd65eb03c3f93.jpg", "infoid": 1013393, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三大企业Linux发行公司之一的SUSE于2020年7月21日发布了其旗舰操作系统SUSE Linux Enterprise(SLE)15 Service Pack 2的下一版本及其最新的基础设施管理程序SUSE Manager 4.1。\nSLE 15 SP2可在x86-64、ARM、IBM POWER、IBM Z和LinuxONE硬件架构上使用。这个新的Linux服务器版本基于Linux5.3内核。这个新的内核版本包括上游特性，比如任务调度器中的利用率钳位支持，以及高能效的用户空间等待。\n支持从openSUSE Leap迁移到SUSE Linux Enterprise Server(SLES)。有了这个，您可以尝试免费的社区openSUSE Linux发行版，然后，如果您发现它是适合您企业的好选择，请升级到SLES。\n扩展包搜索。通过使用新的Zypper，SUSE的命令行包管理器，命令选项--zypper search-Packages--sysadmins现在可以跨所有SUSE存储库进行搜索，即使是未启用的存储库。这使得管理员更容易找到所需的软件包。\nSLE软件开发工具包(SDK)现已集成到SLE中。开发包与常规包一起打包。\nPython3：SLE 15完全支持Python3开发。SLE暂时仍支持Python2。\n存储库镜像工具(RMT)取代了订阅管理工具(SMT)。RMT允许镜像SuSE存储库和自定义存储库。然后，您可以直接向RMT注册系统。在安全性更高的环境中，RMT还可以代理其他RMT服务器。\n通过改进的SLE实时修补提高业务连续性。SuSE声称实时打补丁可将系统正常运行时间增加多达12个月。SLE Live Patching现在还可用于IBM Z和LinuxONE大型机架构。\n最新的CPU支持。这包括对富士通A64FX和下一代AMD EPYC处理器的支持。\n扩展的NVIDIA虚拟机管理程序支持，此支持有助于处理人工智能(AI)、机器学习(ML)和边缘工作负载。在低端，Raspberry PI 4设备支持可减少能量和散热，并改进安装流程。\n使用RabbitMQ、Prometheus和Maven为自动化、项目构建和面向消息的中间件提供更好的DevOps支持。\n更轻松地将SAP HANA和SAP S/4HANA服务迁移到云和混合实施。集成商可以将SAP S/4HANA迁移数据添加到部署脚本以实现自动部署。SAP Basis管理员还可以通过对服务器、群集和SAP应用程序数据进行新的监控和可视化来主动管理SAP系统。\n在此版本中，SUSE还与Microsoft合作开发了一个解决方案，以收集并以图形方式显示特定于服务器和SAP的操作数据。微软杰出工程师约翰·戈斯曼在一份声明中说：\nSUSE和微软长期致力于确保SAP系统的顺利和可靠实施。Microsoft Azure已经对SUSE的Pacemaker Monitoring Exporter进行了标准化，并很高兴看到SUSE Linux Enterprise Server for SAP Applications 15SP2支持此功能。\nSUSE工程和创新总裁托马斯·迪·贾科莫(Thomas Di Giacomo)补充说，包括SUSE Linux Enterprise在内的SUSE解决方案都是为IT转型而设计的。客户把他们的业务押在他们的IT基础设施上，我们把我们的业务押在他们的成功上。有了SuSE并使用真正的开源软件，他们可以简化现有环境并简化转型，这将使他们在加快业务创新的同时利用现代计算的优势。\n对于SUSE Manager 4.1，这是一个改进的开源基础设施管理和自动化解决方案，可在边缘、云和数据中心环境中降低成本、识别风险、增强可用性并降低复杂性。使用SUSE Manager，无论是在私有云、公共云还是混合云中，您都可以确保服务器、虚拟机、容器和群集安全、健康、合规且维护成本低。这在当今尤其重要，这要归功于冠状病毒大流行的IT员工中断。SuSE Manager 4.1还可以与Salt DevOps程序一起使用。\n它的垂直市场兄弟SUSE Manager for Retail 4.1专门针对零售业进行了优化和定制。此版本提供了针对小型商店运营的增强功能、增强的离线功能和Wi-Fi映像管理，以及增强的虚拟机管理和监控功能。同时，它可以将零售环境扩展到数万个终端设备，并帮助实现服务点部署的现代化。\n把所有这些放在一起，您就会得到一个既适用于小型企业又适用于大型企业的坚实、完整的开源软件堆栈。SLE 15SP2看起来不仅是SuSE客户的发行版，而且是任何使用Linux的公司都应该尝试的版本。", "note_en": "SUSE, one of the three major enterprise Linux distribution companies, released on July 21, 2020, the next versions of its flagship operating system,  SUSE Linux Enterprise (SLE) 15 Service Pack 2 and its latest infrastructure management program,  SUSE Manager 4.1.\n SLE 15 SP2 is available on the  x86-64,  Arm,  IBM POWER,  IBM Z, and LinuxONE hardware architectures. This new Linux server edition is based on the Linux 5.3 kernel. This new kernel release includes upstream features such as utilization clamping support in the task scheduler, and power-efficient userspace waiting.\n  Support for migration from  openSUSE Leap to SUSE Linux Enterprise Server (SLES). With this, you can try the free, community openSUSE Linux distro, and then, if you find it&#39;s a good choice for your business, upgrade to SLES.\n Extended Package Search. By using the new  Zypper, SUSE&#39;s command line package manager, command option -- zypper search-packages -- sysadmins can now search across all SUSE repositories, even unenabled ones. This makes it easier for administrators to find required software packages.\n SLE Software Development Kit (SDK) is now integrated into SLE. Development packages are packaged alongside regular packages.\n Python 3: SLE 15 offers full support for Python 3 development. SLE still supports Python 2 for the time being.\n  Repository Mirroring Tool (RMT) replaces Subscription Management Tool (SMT). RMT allows mirroring SUSE repositories and custom repositories. You can then register systems directly with RMT. In environments with tightened security, RMT can also proxy other RMT servers.\n Better business continuity with improved  SLE Live Patching. SUSE claims Live Patching increases system uptime by up to 12 months. SLE Live Patching is also now available for IBM Z and LinuxONE mainframe architectures.\n  Latest CPU support. This includes support for the Fujitsu A64FX and the next-generation AMD EPYC processor.\n Expanded NVIDIA hypervisor support, This support helps with artificial intelligence (AI), machine learning (ML), and edge workloads. On the low end, Raspberry Pi 4 device support enables reduced energy and heat dissipation and an improved installation process.\n Better DevOps support for automation, project builds, and message-oriented middleware using RabbitMQ, Prometheus, and Maven.\n Easier migration of SAP HANA and SAP S/4HANA services to cloud and hybrid implementations. Integrators can add SAP S/4HANA migration data to deployment scripts for automatic deployment. SAP Basis Administrators can also proactively manage SAP systems with new monitoring and visualization of server, cluster, and SAP applications data.\n In this release, SUSE also worked with Microsoft to develop a solution to collect and graphically display both server and SAP-specific operational data. John Gossman, Microsoft Distinguished Engineer, said in a statement:\n SUSE and Microsoft have a long-standing commitment to ensuring smooth and reliable implementations of SAP systems. Microsoft Azure has standardized on SUSE&#39;s Pacemaker Monitoring Exporter and is pleased to see this capability supported in SUSE Linux Enterprise Server for SAP Applications 15 SP2.\n   &#34;SUSE solutions, including SUSE Linux Enterprise, are designed for IT transformation,&#34; added Thomas Di Giacomo, SUSE president of engineering and innovation. &#34;Customers stake their businesses on their IT infrastructure and we stake our business on their success. With SUSE and using true open source software, they can simplify their existing environments and ease the transformation that will allow them to take advantage of modern computing as they accelerate innovation in their businesses.&#34;\n As for  SUSE Manager 4.1, this is an improved open-source infrastructure management and automation solution that lowers costs, identifies risk, enhances availability, and reduces complexity in edge, cloud, and data center environments. With SUSE Manager you can keep servers, VMs, containers, and clusters secure, healthy, compliant, and low maintenance whether in private, public, or hybrid cloud. That&#39;s especially important these days thanks to   coronavirus pandemic IT staff disruptions. SUSE Manager 4.1 can also be used with the  Salt DevOps program.\n   Its vertical-market brother,  SUSE Manager for Retail 4.1, is optimized and tailored specifically for retail. This release comes with enhancements for small store operations, enhanced offline capabilities and image management over Wi-Fi, and enhanced virtual machine management and monitoring capabilities. Simultaneously it can scale retail environments to tens of thousands of end-point devices and help modernize point-of-service rollouts.\n Put it all together and you get a solid, complete open-source software stack for both small businesses and the largest enterprises. SLE 15 SP 2 looks like a release that not only SUSE-customers, but any Linux-using company should check out.", "posttime": "2020-07-22 08:03:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,linux,suse,releases", "title": "SuSE发布主要Linux更新", "title_en": "SUSE Releases Major Linux Update", "transed": 1, "url": "https://www.zdnet.com/article/suse-releases-major-linux-update/", "via": "", "real_tags": ["发布", "linux", "suse", "releases"]}, {"category": "", "categoryclass": "", "imagename": "3cf11483891a9fc23a4c96f0bf5dd58c.png", "infoid": 1013392, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "$\\Beginggroup$在许多计算数学、运筹学中，例如优化问题的算法设计等，作者喜欢使用$$\\Langle\\CDOT，\\CDOT\\Rangle$$，而不是使用$$(\\CDOT)^T(\\CDOT)$$。\n即使空间显然是欧几里得的，运算显然是点积。这样做有什么好处或好处呢？是不是这样，这些符号就可以很好地推广到其他空间呢？\n$\\结束组$。\n$\\Beginggroup$如果空间是明确的欧几里得空间，那么也许是为了强调向量是几何对象而不只是数字数组？否则，通常会给出一个具有标量积的向量空间，但没有基数的自然选择。$\\endgroup$-2Erz。\n$\\BEGINGROUP$括号符号是Cleary对称的，而另一个不是。事实上，应该用其他方式来问这个问题：为什么使用$(\\CDOT)^T(\\CDOT)$而不是方括号？$\\endgroup$-.user1123502。\n$\\BEGINGROUP$$\\LANGE u；v\\RANGE$显式为数字，而$u^TV$为1乘1矩阵：)。$\\endgroup$-ENDGROUP KESTYA_I。\n$\\Begingroup$Also，$\\Langle\\CDOT，\\CDOT\\Rangle$看起来像一张没有嘴的好奇的脸，而$(\\CDOT)^T(\\CDOT)$...。呃，不要紧。$\\endgroup$-1费德里科·波罗尼。\n$\\Beginggroup$我已经投票决定重新开张，理由是任何可以吸引像陶渊明这样的答案的问题都肯定值得一问。$\\endgroup$-1马克·威尔登\n给定数学字段$X$中的$\\BEGINGROUP$数学符号基本上是书面页面(或黑板、电子文档等)上的数学表达式(或语句)之间的对应关系$$\\mathm{notation}：\\{\\HBox{格式良好的表达式}\\}\\到\\{\\HBox\\}X\\}$$中的抽象对象。以及我们自己、我们的合作者和我们的观众头脑中的数学对象(或概念和想法)。一个好的符号应该使这个映射$\\mathm{notation}$(及其逆)尽可能接近(自然)同构。因此，例如，以下属性是所需的(尽管不是强制的)：\n(明确)表示法中的每个格式良好的表达式都应该在$X$中有唯一的数学解释。(与此相关的是，应该尽量减少使用给定符号$\\mathm{notation}$解释表达式和使用流行的竞争符号$\\widetilde{\\mathm{notation}}$解释表达式之间可能存在的混淆。)。\n(表现力)相反，$X$中的每个数学概念或对象都应该至少以一种方式使用符号进行描述。\n(保持质量，i)$X$中的每个自然概念都应该很容易用符号来表达。\n(保持质量，ii)$X$上的每一个不自然的概念都应该很难用符号来表达。[具体地说，记号系统可能表达能力太强而不适合给定的应用程序域。]。相反，符号系统中看起来干净自然的表达式应该与$X$中的自然对象或概念相对应。\n(纠错/检测)格式良好的表达式中的打字应创建易于更正(或至少检测到)以恢复原始预期含义(或其微小扰动)的表达式。\n(暗示性，i)在$X$中相似的概念应该在符号中有相似的表达，反之亦然。\n(提示性，ii)$\\mathm{notation}$中的形式操作演算应该类似于数学家在$X$中已经熟悉的其他符号系统中的形式操作演算。(建议，ii)$\\mathm{notation}$中的形式操作演算应该类似于数学家在$X$中已经熟悉的其他符号系统中的形式操作演算。\n(变换)$X$中数学概念的自然变换(例如，坐标的改变或乘法的结合性)应对应于符号对应符号的自然操作；类似地，应用$X$中的标准结果应对应于记数法系统中干净而强大的演算。[在特别好的符号中，反之亦然：在自然的时尚中，符号的形式操作可以导致发现新的方法，自然地改变数学对象本身。]。\n要评估这些性质，必须将整个域$X$作为一个整体来评估；符号的质量不能通过检查$X$中用于单个数学概念$C$的符号$\\mathm{notation}^{-1}(C)$来以纯粹的逐点方式进行评估。特别地，对于单个概念$C$，完全可以有许多不同的符号$\\mathm{notation}_1^{-1}(C)，\\mathm{notation}_2^{-1}(C)，\\dots$，每个符号都设计用于不同的数学领域$X_1，X_2，\\dots$。(在某些情况下，例如使用Desiderata 1和7中的质量度量，为了评估该符号系统的适用性，查看整个符号系统$\\mathm{notation}$以及它与当前数学界普遍使用的其他符号系统$\\widetilde{\\mathm{notation}}$之间的关系是不够的。)，例如，使用desiderata 1和7中的质量度量标准，查看整个符号系统$\\mathm{notation}$是不够的，而且还要查看它与当前数学界流行的其他符号系统的关系，以评估该符号系统的适用性。)。\n返回到表示标量$c$等于标准向量空间${\\bf R}^n$中两个向量$u，v$的内积的概念$C$的具体示例，不仅有两个通常用于捕获$C$的符号，而且实际上有十几个(包括在其他答案中提到的几个)：\n行人符号：$c=\\sum_{i=1}^n u_i v_i$(或$c=u_1 v_1+\\dots+u_n v_n$)。\n欧几里得表示法：$c=u\\cot v$(或$c=\\vec{u}\\cot\\vec{v}$或$c=\\mathbf{u}\\cot\\mathbf{v}$)。\n黎曼几何符号：$c=\\eta(u，v)$，其中$\\eta$是欧几里得度量形式(也可以是$c=u\\neg(\\eta\\cdot v)$，或$c=\\iota_u(\\eta\\cdot v)$；也可以用$\\eta(-，v)$代替$\\eta\\cdot v$)。\n矩阵表示法：$c=u^T v$(或$c=\\mathm{tr}(vu^T)$或$c=u^*v$或$c=u^\\dagger v$)。\n爱因斯坦记数法，i(没有匹配的上标/下标要求)：$c=u_i v_i$(或$c=u^iv^i$，如果向量分量用上标表示)。\n爱因斯坦记数法，III(具有匹配的上标/下标要求和隐式升降算子)：$c=u^i v_i$(或$c=u_i v^i$或$c=\\eta_{ij}u^i v^j$)。\nPenrose抽象索引表示法：$c=u^\\alpha v_\\alpha$(或$c=u_\\alpha v^\\alpha$或$c=\\eta_{\\alpha\\beta}u^\\alpha v^\\beta$)。[在没有导数的情况下，这几乎与爱因斯坦记数法III相同，但如果存在协变导数(Penrose记法中的$\\nabla_\\alpha$，或爱因斯坦记法中的$\\Partial_I$和Christoffel符号的组合)，这两个记数系统之间的区别就会变得更加明显。]。\nHodge记法：$c=\\mathm{det}(u\\wedge*v)$(或$u\\wedge*v=c\\omega$，其中$\\omega$为卷形式)。[这里我们隐式地将$u，v$解释为协向量，而不是向量。]。\n这些符号中的每一个都是为不同的应用数学领域量身定做的。例如：\n矩阵表示法适用于使用许多其他矩阵运算和表达式的情况(例如，秩1运算符$vu^T$)。\n黎曼或抽象索引表示法适用于变量经常进行线性或非线性变化的情况。\n希尔伯特空间记号将是合适的，如果一个人打算最终将一个人的计算推广到其他希尔伯特空间，包括无限维的希尔伯特空间。\n欧几里德记数法适用于其他欧几里德运算(例如，叉积)也经常使用的上下文。\n爱因斯坦和彭罗斯抽象索引符号适用于高阶张量大量涉及的上下文。爱因斯坦一号更适合于欧几里得应用或其他不需要大量使用协变运算的情况，否则爱因斯坦三世或彭罗斯更可取(如果涉及协变导数，则后者尤其可取)。爱因斯坦二世适用于希望明确依赖度规的情况。\nClifford代数记法适用于处理任意特征的域，特别是如果希望允许特征2。\n以此类推。对于此概念，没有唯一的最佳符号选择；它取决于预期的上下文和应用程序域。例如，如果不希望读者意外地将标量积$u^Tv$与秩1运算符$vu^T$混淆，则矩阵记法将是不合适的，如果经常希望对分析中使用的向量和矩阵/线性变换执行坐标运算(例如，Hadamard积)，则希尔伯特空间记法将是不合适的，等等。\n$\\结束组$。\n$\\egingroup$几何代数记号也可以简明地写为$\\frac{1}{2}\\{u，v\\}$，其中$\\cdot，\\cdot$是反对位子。$\\endgroup$-1用户76284。\n为了它的价值，我学会了爱因斯坦求和，因为它只对上行和下行指数对求和。$\\endgroup$-Aaron Bergman。\n$\\BEGINGROUP$爱因斯坦求和的两个变体都在使用中，如果想要充分利用协方差，则使用您所说的首选公式，但更宽松的公式适用于欧几里得上下文，在欧几里得上下文中，人们不需要太多地依赖协变变换。参见en.wikipedia.org/wiki/Einstein_notation#Application。(就我个人而言，如果要大量使用协变运算，特别是协变导数，我建议改用Penrose抽象求和符号，除非出于某种原因真的喜欢Christoffel符号。)$\\endgroup$-TERRY陶渊明。\n$\\BEGINGROUP$@AaronBergman和Terry，事实上，在两个都上涨或两个都下跌的重复指数上求和与在一个上涨一个下跌的重复指数上求和是有重要区别的。这就是我对特里对爱因斯坦符号的描述的吹毛求疵。$\\endgroup$-1杨院长\n$\\BEGINGROUP$区分对偶向量和向量的收缩以及两个向量的内积通常很重要。在我的工作中，我是在没有内积的情况下工作的，所以指数是上升还是下降是相当关键的。所以在描述爱因斯坦符号时，我不认为这两种不同的符号是等价的。同时向上或向下的重复指数表示使用内积和正交基。具有一个上行和一个下行的重复指数是对偶向量与向量关于任何基的收缩。$\\endgroup$-1杨院长。\n$\\Begingroup$内积被公理化地定义为从$V\\乘V\\到k$的函数，其中$k$是域，$V$是$k$-向量空间，满足三个公理。通常的记号是$(x，y)$，所以当你想说任何关于任意内积的事情时，你可以使用这个记号(或一些类似的记号)。$(x，y)=x^*y$只是空间$\\mathbb C^n$上内积的一个例子。在同一空间上还有其他的例子，$(x，y)=x^*Ay$，其中$A$是任意厄米特正定矩阵，并且在其他向量空间上有点积。\n$\\结束组$。\n$\\Beginggroup$只是一个次要的注解：$A$必须是正定的，而不仅仅是厄米特的，才能成为内积。$\\endgroup$--纳撒尼尔·约翰斯顿。\n$\\BEGINGROUP$任意域上的向量空间$k$肯定太一般了；如何定义正定性？这似乎更像是对称或共轭对称形式的一般性。$\\endgroup$-1 LSpice。\n$\\Begingroup$@LSpice：嗯，将您自己限制在真实且复杂的字段。您仍然有足够的空间，每个空间上都有大量不同的点积。$\\endgroup$-亚历山大·埃雷门科(Alexandre Eremenko)。\n$\\BEGINGROUP$$\\LANGE\\CDOT，\\CDOT\\RANGE$的一个优点是，您不必担心基础的变化。\n假设我们有一个坐标系$\\alpha$，其中我们的(实)内积空间是显式的欧几里得，以及一个可选的坐标系$\\beta$。矢量$v$在坐标系中分别表示为列矢量$[v]_\\alpha$和$[v]_\\beta$。设$P$表示基矩阵的变化\n在坐标系$\\alpha$中的内积是$\\langle v，v\\rangle=[v]_{\\alpha}^T[v]_{\\alpha}$在第二坐标系中肯定不是一般的$[v]_\\beta^T[v]_\\beta$。(仅当$P$正交时才是如此。)。\n也就是说：给定任何Hilbert空间$V$，通过Riesz表示，存在从$V$到其对偶空间$V^*$的(反)同构。您当然可以选择将此映射称为$v\\mapstto v^*$(在黎曼几何上下文中，这通常使用音乐同构符号$\\Flat$和$\\Sharp$表示)，我认为在这种情况下没有理由偏爱其中一个。但是，如果您以这种方式进行操作，则需要注意的是，除非您是在正交基础上工作，否则不能将$v\\mapstto v^*$与矩阵上的共轭转置运算相关联。\n$\\结束组$。\n$\\Begingroup$@Federico Poloni：如果我理解正确的话，$[v]_\\alpha$是抽象向量$v$w.r.t的坐标列向量。基数$\\alpha$。因此，$[v]_\\beta$也是一个列向量，并且$[v]_\\beta=P[v]_\\alpha$(即有一个小的打字错误)。$\\endgroup$-1 Qfwfq。\n$\\Begingroup$@FedericoPoloni：感谢您指出拼写错误(并感谢Qfwfq的正确解释。)。打字错误现在已修复。$\\endgroup$-Willie Wong。\n$\\Begingroup$@LSpice：为什么？Riesz表示也适用于复希尔伯特空间，不是吗？或者，您的意思是转置符号只适用于实数符号，而对于复数符号，您需要共轭转置符号？还是我忽略了上面我打错的其他东西？$\\endgroup$-@Willie Wong。\n$\\Begingroup$@LSpice：啊，我忘了加&#34；(反)&#34；。现在就把它修好。$\\endgroup$-Willie Wong。\n$\\BEGINGROUP$$\\LANGE u，v\\RANGE$显式为数字，而$u^TV$为1乘1矩阵：)。\n虽然两者之间确实存在典范同构，但如何将$u$的展开式写在标准正交基$v_i\\$中呢？像$$u=\\sum_i u^tv_i v_i$$这样的东西让人感觉不舒服，就好像你把一切都看成矩阵一样，维度不允许乘法。因此，我至少觉得有必要插入圆括号$$u=\\sum_i(u^tv_i)v_i，$$来表示应用了规范同构。但这仍然是含糊其辞的，同时已经取消了$u^tv$的任何排版优势。\n(我也有同感，认为依赖于基础的语言是低劣的，应该在可能的情况下避免使用。)。\n$\\结束组$。\n$\\BEGINGROUP$您可以将其写为$\\sum_j v_j v_j^Tu$。在这种形式下，一切都是完全关联的，您甚至可以很好地分解出投影矩阵$(\\sum_j v_j v_j^T)u$。我也学过把标量放在列向量的左边，但现在我认为把它们放在右边要好得多，在这种情况下保持结合性要好得多。事实上，我认为正交投影为转置记法提供了一个令人信服的理由，我已经写了一个答案来讨论它。$\\endgroup$-1费德里科·波罗尼。\n$\\Begingroup$还可以使用$\\mathm{tr}()$(或更多乘法上下文，$\\mathm{det}()$)显式地编写从$1\\x 1$矩阵到标量的转换，如果您希望明确且具有学究般的精确度的话，请使用$\\mathm{tr}()$(或更多上下文，$\\mathm{det}()$)显式编写从$1\\x 1$矩阵到标量的转换。$\\endgroup$-1陶渊明。\n$\\egingroup$@FedericoPoloni，除了形式上正确之外，符号还应该反映我们的思考方式。如果将向量视为来自一维线性空间的线性映射，将标量视为该空间上的线性映射，并将标量乘以标量作为预合成，则您的符号很好。另一方面，我习惯于将向量视为线性空间的元素，并将标量乘法视为应用于这些元素的运算，如果有什么不同的话，那就是使用标量矩阵进行后期合成，而不是预先合成。$\\endgroup$-ENDGROUP KESTYA_I。\n我能理解，不同的领域需要不同的思维方式。但对我来说，在克服了最初的笨拙之后，标量-Right是最舒服的线性代数版本。例如，当写成$Av=v\\lambda$时，特征值/特征向量关系完美地推广到不变子空间关系$AV=Vb$和完全特征分解$AV=Vd$，或者矩阵-向量乘法$Ax$完美地对应于具有系数项$x_j$的列$A^j$的线性组合$\\sum_j A^j x_j$。任何人都不需要以这种方式移动标量。$\\endgroup$-1费德里科·波罗尼。\n$\\BEGINGROUP$在某种意义上，在此设置中，真正的异常值是标量矩阵乘积$\\alpha A$，它与产品中兼容维度的通常规则不匹配(而$v\\alpha$按此顺序编写时会匹配)。也许形式上正确的出路是将其视为张量(Kronecker)乘积$\\alpha\\ox A$，具有$1\\x 1$矩阵$\\alpha$...$\\endgroup$--Federico Poloni\n在我看来，括号记法的一个巨大优点是它允许空白。因此，可以将内积的符号指定为$\\langle\\，\\\\rangle$，并且给定$\\langle\\，\\rangle：v\\乘V\\right tarrow K$，可以通过$\\langle u，-\\rangle$和$\\langle-，v\\rangle$定义对偶空间$V^\\star$的元素。(在复杂情况下，其中之一仅为共轭线性。)。\n我知道更主观一些，但出于符号的原因，我更喜欢用$\\langau，v\\rangle=\\langu，A^\\dagger v\\rangle$来表示伴随映射，而不是$(Au)^tv=u^t(A^tv)$。前者还强调建设是基础独立的。它更好地推广到希尔伯特空间和其他具有非退化双线性形式(不一定是内积)的空间。\n我还会注意到，物理学家，以及最近从事量子计算工作的任何人，都把这个公式发挥到了极致，并用它以一种简洁的方式展示了相当复杂的本征矢量计算。例如，下面是用胸罩表示法的Hadamard变换：\n$$\\frac{|0\\rangle+|1\\rangle}{\\sqrt{2}}\\langle 0|+\\frac{|0\\rangle-|1\\rangle}{\\sqrt{2}}\\langle 1|。$$。\n要得到$n$量子位上的一般Hadamard变换，只需取$n$次张量次方：这与对偶空间的向量和元素的各种隐式标识是兼容的。\n最后，我恳请大家使用$\\langle u，v\\rangle$，与\\langle和\\rangle一起使用，而不是使用野蛮的$&lt；u，v&gt；$\\lt；u，v&gt；$，\\lt；u，v&gt；$，\\lt；u，v&gt；$。\n$\\结束组$。\n物理学家的胸罩符号非常令人迷惑。它不仅仅是使用标量积的合理符号$\\langle\\；.\\；|\\；。\\；\\RANGE$表示向量$v$的&#34；度量&#34；DUAL$\\LANGE V|\\；.\\；\\RANGE$，或将形式为$v\\ox u^{\\vee}$的运算符表示为$v\\langu|$，这对数学家来说是完全标准的。否，他们使用$|\\quad\\rangle$作为空格，在其中插入某些符号：在$v_{\\square}$，(...)$\\endgroup$-*Qfwfq中，用任何符号代替$|\\square\\rangle$中的方框\n$\\BegingGroup$(...)。不管这样的符号(插入到ket中)是否表示向量本身(如$|v\\rangle$)、特征值(如$|\\lambda_i\\rangle$)或索引(如$|\\spadesuit\\rangle$或$|0\\rangle$或$|uparrow\\rangle$)。$\\endgroup$-1 Qfwfq。\n$\\BEGINGROUP$我不认为这特别奇怪。这个KET就是矢量，里面的东西就是矢量的标签。如果您有一个向量$|v\\rangle$，则。\n.", "note_en": "$\\begingroup$  In a lot of computational math, operations research, such as algorithm design for optimization problems and the like, authors like to use  $$\\langle \\cdot, \\cdot \\rangle$$ as opposed to  $$(\\cdot)^T (\\cdot)$$\n Even when the space is clearly Euclidean and the operation is clearly the dot product. What is the benefit or advantage for doing so? Is it so that the notations generalize nicely to other spaces?\n      $\\endgroup$\n  $\\begingroup$  If the space is explicitly Euclidean, then perhaps to emphasise that the vectors are geometric objects rather than just arrays of numbers? Otherwise, often you are given a vector space with a scalar product, but no natural choice of a basis.  $\\endgroup$\r–  erz\n  $\\begingroup$  The bracket notation is cleary symmetrical while another is not. And, in fact, the question should be asked other way: why to use $(\\cdot)^T (\\cdot)$ instead of brackets?  $\\endgroup$\r–  user1123502\n  $\\begingroup$  $\\langle u;v\\rangle$ is explicitly a number, whereas $u^Tv$ is a 1 by 1 matrix :).  $\\endgroup$\r–  Kostya_I\n  $\\begingroup$  Also, $\\langle \\cdot,\\cdot\\rangle$ looks like a curious face without a mouth, while $(\\cdot)^T(\\cdot)$... uh, nevermind.  $\\endgroup$\r–  Federico Poloni\n  $\\begingroup$  I have voted to reopen, on the grounds that any question that can attract an answer such as Tao&#39;s is surely worth asking.  $\\endgroup$\r–  Mark Wildon\n  $\\begingroup$  Mathematical notation in a given mathematical field  $X$ is basically a correspondence $$ \\mathrm{Notation}: \\{ \\hbox{well-formed expressions}\\} \\to \\{ \\hbox{abstract objects in } X \\}$$between mathematical expressions (or statements) on the written page (or blackboard, electronic document, etc.) and the mathematical objects (or concepts and ideas) in the heads of ourselves, our collaborators, and our audience. A good notation should make this map  $\\mathrm{Notation}$ (and its inverse) as close to a (natural) isomorphism as possible. Thus, for instance, the following properties are desirable (though not mandatory):\n (Unambiguity) Every well-formed expression in the notation should have a unique mathematical interpretation in  $X$. (Related to this, one should strive to minimize the possible confusion between an interpretation of an expression using the given notation  $\\mathrm{Notation}$, and the interpretation using a popular competing notation  $\\widetilde{\\mathrm{Notation}}$.)\n (Expressiveness) Conversely, every mathematical concept or object in  $X$ should be describable in at least one way using the notation.\n (Preservation of quality, I) Every &#34;natural&#34; concept in  $X$ should be easily expressible using the notation.\n (Preservation of quality, II) Every &#34;unnatural&#34; concept on  $X$ should be  difficult to express using the notation. [In particular, it is possible for a notational system to be  too expressive to be suitable for a given application domain.] Contrapositively, expressions that look clean and natural in the notation system ought to correspond to natural objects or concepts in  $X$.\n (Error correction/detection) Typos in a well-formed expression should create an expression that is easily corrected (or at least detected) to recover the original intended meaning (or a small perturbation thereof).\n (Suggestiveness, I) Concepts that are &#34;similar&#34; in  $X$ should have similar expressions in the notation, and conversely.\n (Suggestiveness, II) The calculus of formal manipulation in  $\\mathrm{Notation}$ should resemble the calculus of formal manipulation in other notational systems  $\\widetilde{\\mathrm{Notation}}$ that mathematicians in  $X$ are already familiar with.\n (Transformation) &#34;Natural&#34; transformation of mathematical concepts in  $X$ (e.g., change of coordinates, or associativity of multiplication) should correspond to &#34;natural&#34; manipulation of their symbolic counterparts in the notation; similarly, application of standard results in  $X$ should correspond to a clean and powerful calculus in the notational system. [In particularly good notation, the converse is also true: formal manipulation in the notation in a &#34;natural&#34; fashion can lead to discovering new ways to &#34;naturally&#34; transform the mathematical objects themselves.]\n To evaluate these sorts of qualities, one has to look at the entire field  $X$ as a whole; the quality of notation cannot be evaluated in a purely pointwise fashion by inspecting the notation  $\\mathrm{Notation}^{-1}(C)$ used for a single mathematical concept  $C$ in  $X$. In particular, it is perfectly permissible to have many different notations  $\\mathrm{Notation}_1^{-1}(C), \\mathrm{Notation}_2^{-1}(C), \\dots$ for a single concept  $C$, each designed for use in a different field  $X_1, X_2, \\dots$ of mathematics. (In some cases, such as with the metrics of quality in desiderata 1 and 7, it is not even enough to look at the entire notational system  $\\mathrm{Notation}$, but also its relationship with the other notational systems  $\\widetilde{\\mathrm{Notation}}$ that are currently in popular use in the mathematical community, in order to assess the suitability of use of that notational system.)\n Returning to the specific example of expressing the concept  $C$ of a scalar quantity  $c$ being equal to the inner product of two vectors  $u, v$ in a standard vector space  ${\\bf R}^n$, there are not just two notations commonly used to capture  $C$, but in fact over a dozen (including several mentioned in other answers):\n Pedestrian notation:  $c = \\sum_{i=1}^n u_i v_i$ (or  $c = u_1 v_1 + \\dots + u_n v_n$).\n Euclidean notation:  $c = u \\cdot v$ (or  $c = \\vec{u} \\cdot \\vec{v}$ or  $c = \\mathbf{u} \\cdot \\mathbf{v}$).\n  Riemannian geometry notation:  $c = \\eta(u,v)$, where  $\\eta$ is the Euclidean metric form (also  $c = u \\neg (\\eta \\cdot v)$, or  $c = \\iota_u (\\eta \\cdot v)$; one can also use  $\\eta(-,v)$ in place of  $\\eta \\cdot v$).\n  Matrix notation:  $c = u^T v$ (or  $c = \\mathrm{tr}(vu^T)$ or  $c = u^* v$ or  $c = u^\\dagger v$).\n  Einstein notation, I (without matching superscript/subscript requirement):  $c = u_i v_i$ (or  $c=u^iv^i$, if vector components are denoted using superscripts).\n  Einstein notation, III (with matching superscript/subscript requirement and also implicit raising and lowering operators):  $c = u^i v_i$ (or  $c = u_i v^i$ or  $c = \\eta_{ij} u^i v^j$).\n Penrose  abstract index notation:  $c = u^\\alpha v_\\alpha$ (or  $c = u_\\alpha v^\\alpha$ or  $c = \\eta_{\\alpha \\beta} u^\\alpha v^\\beta$). [In the absence of derivatives this is nearly identical to Einstein notation III, but distinctions between the two notational systems become more apparent in the presence of covariant derivatives ( $\\nabla_\\alpha$ in Penrose notation, or a combination of  $\\partial_i$ and Christoffel symbols in Einstein notation).]\n Hodge notation:  $c = \\mathrm{det}(u \\wedge *v)$ (or  $u \\wedge *v = c \\omega$, with  $\\omega$ the volume form). [Here we are implicitly interpreting  $u,v$ as covectors rather than vectors.]\n Each of these notations is tailored to a different mathematical domain of application. For instance:\n Matrix notation would be suitable for situations in which many other matrix operations and expressions are in use (e.g., the rank one operators  $vu^T$).\n Riemannian or abstract index notation would be suitable in situations in which linear or nonlinear changes of variable are frequently made.\n Hilbert space notation would be suitable if one intends to eventually generalize one&#39;s calculations to other Hilbert spaces, including infinite dimensional ones.\n Euclidean notation would be suitable in contexts in which other Euclidean operations (e.g., cross product) are also in frequent use.\n Einstein and Penrose abstract index notations are suitable in contexts in which higher rank tensors are heavily involved. Einstein I is more suited for Euclidean applications or other situations in which one does not need to make heavy use of covariant operations, otherwise Einstein III or Penrose is preferable (and the latter particularly desirable if covariant derivatives are involved). Einstein II is suitable for situations in which one wishes to make the dependence on the metric explicit.\n Clifford algebra notation is suitable when working over fields of arbitrary characteristic, in particular if one wishes to allow characteristic 2.\n And so on and so forth. There is no unique &#34;best&#34; choice of notation to use for this concept; it depends on the intended context and application domain. For instance, matrix notation would be unsuitable if one does  not want the reader to accidentally confuse the scalar product  $u^T v$ with the rank one operator  $vu^T$, Hilbert space notation would be unsuitable if one frequently wished to perform coordinatewise operations (e.g., Hadamard product) on the vectors and matrices/linear transformations used in the analysis, and so forth.\n    $\\endgroup$\n  $\\begingroup$  The geometric algebra notation can also be concisely written as $\\frac{1}{2}\\{u,v\\}$ where $\\{\\cdot,\\cdot\\}$ is the anticommutator.  $\\endgroup$\r–  user76284\n  $\\begingroup$  For what it’s worth, I learned Einstein summation as only summing on pairs of up and down indices.  $\\endgroup$\r–  Aaron Bergman\n  $\\begingroup$  Both variants of Einstein summation are in use, with the formulation you state preferred if one wants to take full advantage of covariance, but the more relaxed formulation suitable for Euclidean contexts in which one will not need to rely much on covariant transformations. See  en.wikipedia.org/wiki/Einstein_notation#Application . (Personally, if one is going to make heavy use of covariant operations, and particularly covariant derivatives, I would recommend using Penrose abstract summation notation instead, unless one really likes Christoffel symbols for some reason.)  $\\endgroup$\r–  Terry Tao\n  $\\begingroup$  @AaronBergman and Terry, there is in fact an important distinction between summing over repeated indices where both are up or both are down and summing over repeated indices, where one is up and the other is down. And that&#39;s my quibble with Terry&#39;s description of Einstein notation.  $\\endgroup$\r–  Deane Yang\n  $\\begingroup$  It is often important to distinguish between the contraction of a dual vector and a vector and the inner product of two vectors. In my work, I work without an inner product, so whether the indices are up or down is quite crucial. So in the description of Einstein notation, I would not view the two different notations are being equivalent. Repeated indices that are both up or both down indicates the use of an inner product AND an orthonormal basis. Repeated indices with one up and one down is the contraction of a dual vector with a vector with respect to ANY basis.  $\\endgroup$\r–  Deane Yang\n    $\\begingroup$  Inner product is defined axiomatically, as a function from  $V\\times V\\to k$, where $k$ is a field and  $V$ is a  $k$-vector space, satisfying the three well-known axioms. The usual notation is  $(x,y)$.So when you want to say anything about an arbitrary inner product, you use this notation (or some similar one).  $(x,y)=x^*y$ is just one example of an inner product on the space  $\\mathbb C^n$. There are other examples on the same space,  $(x,y)=x^*Ay$ where  $A$ is an arbitrary Hermitian positive definite matrix, and there are dot products on other vector spaces.\n    $\\endgroup$\n  $\\begingroup$  Just a minor note: $A$ has to be positive definite, not just Hermitian, for that to be an inner product.  $\\endgroup$\r–  Nathaniel Johnston\n  $\\begingroup$  Surely vector spaces over an arbitrary field $k$ is too general; how do you define positive definiteness? This seems more like the generality for symmetric or conjugate-symmetric forms.  $\\endgroup$\r–  LSpice\n  $\\begingroup$  @LSpice: well, restrict yourself to the real and complex field. You still have plenty of spaces and plenty of different dot products on each.  $\\endgroup$\r–  Alexandre Eremenko\n    $\\begingroup$  One advantage of  $\\langle \\cdot, \\cdot \\rangle$ is that you don&#39;t have to worry about changes in basis.\n Suppose we have a coordinate system  $\\alpha$ in which our (real) inner product space is explicitly Euclidean, and an alternative coordinate system  $\\beta$. A vector  $v$ is expressed in the coordinates systems as, respectively, the column vectors  $[v]_\\alpha$ and  $[v]_\\beta$. Let  $P$ denote the change of basis matrix\n  The inner product, which in coordinate system  $\\alpha$ is  $\\langle v, v\\rangle = [v]_{\\alpha}^T [v]_{\\alpha}$ is certainly not in general  $[v]_\\beta^T[v]_\\beta$ in the second coordinate system. (It is only so if  $P$ is orthogonal.)\n  That said: given any Hilbert space  $V$, by Riesz-representation there exists an (anti-)isomorphism from  $V$ to its dual space  $V^*$. You can certainly choose to call this mapping  $v \\mapsto v^*$ (in Riemannian geometry contexts this is more usually denoted using the musical isomorphism notation  $\\flat$ and  $\\sharp$) and I don&#39;t think in this case there are reasons to prefer one to another. But a major caveat if you do things this way is that unless you are working in an orthonormal basis, you cannot associate  $v \\mapsto v^*$ to the &#34;conjugate transpose&#34; operation on matrices.\n    $\\endgroup$\n  $\\begingroup$  @Federico Poloni: if I understand correctly, $[v]_\\alpha$ is the column vector of coordinates of the abstract vector $v$ w.r.t. the basis $\\alpha$. So, $[v]_\\beta$ is a column vector too, and $[v]_\\beta = P[v]_\\alpha$ (i.e. there&#39;s a small typo).  $\\endgroup$\r–  Qfwfq\n  $\\begingroup$  @FedericoPoloni: thanks for pointing out the typo (and thanks to Qfwfq for the correct interpretation.) Typo is now fixed.  $\\endgroup$\r–  Willie Wong\n    $\\begingroup$  @LSpice: why so? Riesz representation works also for complex Hilbert spaces, no? Or do you mean that the &#34;Transpose&#34; notation only works for real ones, whereas for complex you need &#34;conjugate transpose&#34;? Or am I overlooking something else that I mistyped above?  $\\endgroup$\r–  Willie Wong\n  $\\begingroup$  @LSpice: bah, I forgot to include the &#34;(anti-)&#34;. Fixing it now.  $\\endgroup$\r–  Willie Wong\n    $\\begingroup$  $\\langle u,v\\rangle $ is explicitly a number, whereas  $u^Tv$ is a 1 by 1 matrix :).\n While it is true that there is a canonical isomorphism between the two, how do you write the expansion of  $u$ in an orthonormal base  $\\{v_i\\}$? Something like $$u=\\sum_i u^Tv_i v_i$$feels uncomfortable as if you view everything as matrices, the dimensions do not allow for multiplication. So, I would at least feel a need to insert parentheses, $$u=\\sum_i (u^Tv_i) v_i,$$to indicate that the canonical isomorphism is applied. But that is still vague-ish while already cancelling any typographical advantages of  $u^Tv$.\n (I do also share the sentiment that the basis-dependent language is inferior and should be avoided when possible.)\n    $\\endgroup$\n  $\\begingroup$  You can write it $\\sum_j v_j v_j^Tu$. In this form everything is perfectly associative, and you can even factor out nicely the projection matrix $(\\sum_j v_j v_j^T)u$. I was also taught to put scalars to the left of column vectors, but now I think it is a lot better to put them on the right, to retain associativity in cases like this one. Actually I think orthogonal projections make a compelling case for the transpose notation, and I have written an answer to discuss it.  $\\endgroup$\r–  Federico Poloni\n  $\\begingroup$  One can also use $\\mathrm{tr}()$ (or more &#34;multiplicative&#34; contexts, $\\mathrm{det}()$) to explicitly write the conversion from $1 \\times 1$ matrices to scalars if one wished to be unambiguous and pedantically precise.  $\\endgroup$\r–  Terry Tao\n  $\\begingroup$  @FedericoPoloni, besides being formally correct, the notation should reflect the way we think. Your notation is fine if one thinks of vectors as linear maps from a one-dimensional linear space, scalars as linear maps on that space, and multiplication by scalars as pre-composition. I, on the other hand, am used to thinking of vectors as elements of the linear space, and multiplication by scalars as operation applied on these elements, if anything a post-composition with a scalar matrix, not pre-composition.  $\\endgroup$\r–  Kostya_I\n  $\\begingroup$  I can understand, different fields require different ways of thought. But for me scalars-right is 100% the most comfortable version of linear algebra, after one gets over the initial awkwardness. For instance, the eigenvalue/eigenvector relation when written as $Av=v\\lambda$ generalizes perfectly to the invariant subspace relation $AV=VB$ and to the full eigendecomposition $AV=VD$, or matrix-vector multiplication $Ax$ corresponds perfectly to the linear combination $\\sum_j A^j x_j$ of the columns $A^j$ with coefficients the entries $x_j$. One never needs to move scalars around in this way.  $\\endgroup$\r–  Federico Poloni\n  $\\begingroup$  In a sense, in this setting the true outlier is the scalar-matrix product $\\alpha A$, which does not match the usual rules for compatible dimensions in a product (while $v\\alpha$ does, when written in this order). Maybe the formally correct way out is seeing it as a tensor (Kronecker) product $\\alpha \\otimes A$ with the $1\\times 1$ matrix $\\alpha$...  $\\endgroup$\r–  Federico Poloni\n    $\\begingroup$  One huge advantage, to my mind, of the bracket notation is that it admits &#39;blanks&#39;. So one can specify the notation for an inner product as  $\\langle \\ , \\ \\rangle$, and given  $\\langle \\ , \\rangle : V \\times V \\rightarrow K$, one can define elements of the dual space  $V^\\star$ by  $\\langle u , - \\rangle$ and  $\\langle -, v \\rangle$. (In the complex case one of these is only conjugate linear.)\n More subjective I know, but on notational grounds I far prefer to write  $\\langle Au, v \\rangle = \\langle u, A^\\dagger v \\rangle$ for the adjoint map than  $(Au)^t v = u^t (A^tv)$. The former also emphasises that the construction is basis independent. It generalises far better to Hilbert spaces and other spaces with a non-degenerate bilinear form (not necessarily an inner product).\n I&#39;ll also note that physicists, and more recently anyone working in quantum computing, have taken the &#39;bra-ket&#39; formulation to the extreme, and use it to present quite intricate eigenvector calculations in a succinct way. For example, here is the Hadamard transform in bra-ket notation:\n $$ \\frac{| 0 \\rangle + |1 \\rangle}{\\sqrt{2}} \\langle 0 | + \\frac{| 0 \\rangle - |1\\rangle}{\\sqrt{2}} \\langle 1 |. $$\n To get the general Hadamard transform on  $n$ qubits, just taken the  $n$th tensor power: this is compatible with the various implicit identifications of vectors and elements of the dual space.\n Finally, may I issue a plea for everyone to use  $\\langle u ,v \\rangle$, with the LaTeX  \\langle and  \\rangle rather than the barbaric  $&lt;u,v&gt;$.\n    $\\endgroup$\n  $\\begingroup$  The physicists&#39; bra-ket notation is very &#34;type confusing&#34;. It&#39;s not just making use of a reasonable symbol of scalar product $\\langle \\;.\\; |\\; . \\;\\rangle$ to denote the &#34;metric&#34; dual $\\langle v |\\; .\\; \\rangle$ of a vector $v$, or to denote an operator of the form $v\\otimes u^{\\vee}$ as $v \\langle u |$, which would be totally standard for mathematicians. No, they use $|\\quad\\rangle$ as a sort of  blank in which to insert  some symbol: substitute  any symbol in place of the box in $|\\square\\rangle$ as in $v_{\\square}$, (...)  $\\endgroup$\r–  Qfwfq\n  $\\begingroup$  (...) no matter if such a symbol (inserted inside the ket) denotes a vector itself, as in $| v \\rangle$, an eigen- value, as in $| \\lambda_i \\rangle$, or an index, as in $|\\spadesuit\\rangle$ or $| 0 \\rangle$ or $| \\uparrow \\rangle$.  $\\endgroup$\r–  Qfwfq\n  $\\begingroup$  I don’t think this is particularly strange. The ket is the vector, what goes in it is the label for the vector. If you have a vector $|v \\rangle$, th\n......", "posttime": "2020-07-22 08:00:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学,tao,符号", "title": "陶渊明谈数学记数法的一些可取性质", "title_en": "Terry Tao on some desirable properties of mathematical notation", "transed": 1, "url": "https://mathoverflow.net/questions/366070/what-are-the-benefits-of-writing-vector-inner-products-as-langle-u-v-rangle/366118#366118", "via": "", "real_tags": ["数学", "tao", "符号"]}, {"category": "", "categoryclass": "", "imagename": "a9eb8c30c9ba9aad09cf917b20369d8d.png", "infoid": 1013391, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们构建Repl.it是为了便于探索和学习语言和编程范例。我们已经成长为一个社区，和我们一样，对语言感到兴奋。然而，令我们惊讶的是，编程语言空间似乎移动得如此缓慢。鉴于软件的发展速度如此之快，难道我们不应该看到编程语言有更多的创新吗？\n我们可以把编程语言看作是一种擅长软件领域的工具，或者是一种思考和表达的媒介。如果语言确实是工具，那么对于给定的任务，某些语言会比其他语言更好。例如，如果我想构建一个性能可靠的Web服务器，我可能会使用Golang，因为它有坚实的标准库和并发原语。然而，如果我要制作一个UI，我可能希望使用JavaScript来提供对事件驱动编程的一流支持。另一方面，如果我们认为语言是表达的媒介，选择一种语言就变得更多地考虑美学和人体工程学，而不是客观质量。\n但是，如果语言是工具，我们不应该看到更多的语言变体来覆盖软件正在进入的不断增长的利基市场吗？同样，如果语言是思维的媒介，而且越来越多的人对用数字方式表达自己感兴趣，我们难道不应该期待看到更多类型的语言吗？\n一个答案可能是程序员对思考语言不是很感兴趣。或者我们今天的语言已经足够了，每个人都很高兴。但是，只要在任何编程论坛上花几分钟时间，就会清楚地看到，对语言缺乏热情和观点并不是我们看不到更多编程语言的原因。\n编程语言无疑很难制作。它们需要设计技能和技术印章的结合。但由于某些原因，语言设计者通常是单独的黑客。但是如果我们让编程语言变得更容易呢？如果我们证明对任何人来说都是可能的，即使是那些经验有限的人，也许特别是初学者，也可以创造和试验语言？难道我们不会得到更多令人兴奋和新鲜的想法吗？\n嗯，在Repl.it这里，我们专门致力于让困难的东西变得可访问，我们希望让创建编程语言变得更容易、更有趣、更令人兴奋和更具协作性。今天，我们再次宣布编程语言堵塞，并向一个设计和制作新语言原型的团队提供1万美元的拨款，重点放在新鲜的、可能是狂野的想法上。获胜的语言还将被添加到Repl.it中，在那里任何人都可以快速开始使用它来编写代码。我们也会为个人组别的获奖者颁发奖品。\n黑客马拉松从8月10日开始，一直持续到8月31日。要进入，您必须在注册开始时创建一个Repl.it团队，至少有两名团队成员。报名将于8月1日开始。要在注册开始时收到通知，请在此处留下您的电子邮件。\n玛丽·罗斯·库克(Mary Rose Cook)的语言实验从玩具Lisp口译器到儿童编程环境，应有尽有\n待定：我们正在寻找更多的评委。特别是那些对狂野的编程语言想法感兴趣的人。\n是!。您甚至不需要有任何编写语言的经验。为了帮助您入门，我们创建了以下教程和模板：\n这里还有一些指向其他网站的链接，这些网站可以帮助您学习使用自己的语言的基础知识：\n任何类型--它可以是动态的、编译的或任何形式的。我们对新鲜的想法特别感兴趣。因此，唯一的标准是它是一种您可以用来编程的语言：)。\n你可以得到5000美元的预付款，以及在堵车后的两个月内继续学习这门语言的5000美元。我们要求您在堵塞后的三个月内尝试获得要添加到Repl.it中的语言的可用版本。\n在拥堵期间，我们要求所有参与者在Repl.it上编码并提交他们的项目，以便于我们的评委运行您的项目，并让我们的用户进行互动，并有可能对您的语言进行分叉和重新混合。我们要求您制作一个易于运行和尝试的演示。\n在拥堵之后，您想在哪里完成语言编码取决于您。\n是的--通过推特或电子邮件联系我们，我们会很乐意聊天的。\n是的，只要你在添加原创的想法，并努力有意义地改变或提高语言。\n是。只要DSL在构造和语法上偏离宿主语言即可。例如，尽管GraphQL嵌入在JavaScript中，但它本身还是很有用/有趣的", "note_en": "We built Repl.it to make it easy to explore and learn languages and programming paradigms. We’ve grown a community that, like us, is  excited by languages. We were, however, surprised by how slow-moving the programming language space seems to be. Given how fast software is growing, shouldn’t we see more innovation in programming languages?\n We can think of a programming language as either a tool built to be good at a software domain or as a medium for thought and expression. If languages are indeed tools, then some languages would be better than others for a given task. For example, if I want to build a web server with reliable performance, I might use Golang because it has a solid standard library and concurrency primitives. Whereas, if I&#39;m making a UI, I might want to use JavaScript for its first-class support for event-driven programming. On the other hand, if we think about languages as mediums of expression, choosing a language becomes less about objective qualities and more about aesthetics and ergonomics.\n But if languages are tools, shouldn&#39;t we see many more language variations to cover the ever-increasings niches that software is entering? Similarly, if languages are mediums of thought, and there are more and more people interested in expressing themselves digitally, shouldn&#39;t we expect to see many more types of languages?\n One answer could be that programmers are not that interested in thinking about languages. Or that our languages today are sufficient and everyone is happy. But spend a few minutes on any programming forum, and it’ll become clear that a lack of enthusiasm and opinions on languages could not be the reason why we don’t see more programming languages.\n Programming languages are undoubtedly hard to make. They require a combination of design skills and technical chops. But for some reason, language designers are typically solo hackers. But what if we made programming languages easier to make? If we showed that it is possible for anyone, even those with limited experience, perhaps especially beginners, can create and experiment with languages? Wouldn’t we get a lot more exciting and fresh ideas?\n  Well, here at Repl.it, we specialize in making hard things accessible, and we want to make creating programming languages easier, fun, exciting, and collaborative. Today, we&#39;re announcing the programming language jam and a $10,000 grant to a team that designs and prototypes a new language with emphasis on fresh and possibly wild ideas. The winning language will also get added to Repl.it, where anyone can quickly start using it to code. We’ll have prizes for individual category winners too.\n The hackathon starts on  August 10th and runs until  August 31st. To enter, you have to create a Repl.it Team when registration opens with a minimum of two team members.  Registration will open on August 1st. To be notified when registration opens, leave your email  here.\n  Mary Rose Cook whose language experimentation spans toy Lisp interpreters to programming environments for kids\n  TBD: we&#39;re looking for more judges. Specifically people who are interested in wild programming language ideas\n   Yes! You don’t even need to have any prior experience making languages. To help you get started, we created these tutorials and templates:\n  Here also also some links to other websites that can help you learn the basics of making your own languages:\n   Any kind -- it could be dynamic, compiled, or whatever. We’re particularly interested in fresh ideas. So the only criteria are that it’s a language you can program in :)\n  You get $5,000 upfront, and $5,000 over two months to continue working on the language after the jam. We ask you to try to get to a usable version of the language to be added to Repl.it in three months after the jam.\n  During the jam, we ask all participants to code and submit their projects on Repl.it to make it easy for our judges to run your project, and for our users to interact and potentially fork and remix your language. We ask that you make one demo repl that it’s easy to run and try.\n After the jam, it’s up to you where you want to finish coding the language.\n  Yes -- reach out to us on Twitter or email, and we’d be happy to chat.\n  Yes, as long as you&#39;re adding original ideas and putting an effort to meaningfully change or improve the language.\n  Yes. As long as the DSL deviates from the host language in constructs and syntax. For example GraphQL is useful/interesting on its own despite being embedded in JavaScript", "posttime": "2020-07-22 07:59:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,hn,语言", "title": "告诉HN：编程语言Jam and Grant", "title_en": "Tell HN: The Programming Language Jam and Grant", "transed": 1, "url": "https://blog.repl.it/langjam", "via": "", "real_tags": ["编程", "hn", "语言"]}, {"category": "", "categoryclass": "", "imagename": "7b8be5fc57678108db2fbdf4f710ce24.jpg", "infoid": 1013389, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软首次允许第三方应用程序开发者集成到微软团队会议体验中。新的以开发人员为中心的功能将允许应用程序在视频通话期间集成到团队会议中，甚至在会议之前和之后。第三方应用程序将能够在Microsoft Team通话期间显示内容，甚至在通话期间显示通知。这是第三方应用程序目前在微软团队中所能做的一个很大的扩展。\n微软团队的团队产品经理Michal Lesiczka在接受The Verge采访时解释说：“应用程序可以跨越聊天和协作，现在可以很容易地拥有扩展到会议的工作流程。”\n应用程序将能够在会议邀请中添加一个选项卡，团队用户可以在会议开始前与应用程序进行交互。一旦会议开始，团队参与者将能够将应用程序添加到实时通话中。这可能包括在团队会议期间触发事件实时通知的机器人，或者在侧边栏中向参与者显示信息的应用程序。集成还包括应用程序在会议控制栏中显示为按钮的功能。\n以前，如果你想在微软团队中分享一款应用程序或网络摄像头以外的东西，唯一可用的选项是屏幕共享，如果你只想演示一款应用程序，或者避免通知或隐私问题，这并不总是理想的选择。这些新功能将允许开发人员将会议体验扩展到基础之外。\n开发人员很久以来就想要这种类型的团队集成。微软团队的团队产品经理Archana Saseetharan在接受The Verge采访时解释说：“反馈的关键之一是，‘好吧，我们可以在这些其他领域整合和启用场景，但在会议中，我们也希望在那里发挥作用。’”“微软团队”的团队产品经理阿卡纳·萨瑟兰(Archana Saseetharan)在接受The Verge采访时解释说。我们正在为开发人员提供新的API和SDK功能，以集成和瞄准这些新领域。它是相同的开发过程、相同的发布过程、相同的验证过程。一切都是一样的，但是你有这三个新的能力去实现目标。“。\nMicrosoft团队会议还提供聊天、文件、会议笔记、白板以及记录和记录会议的功能。第三方应用程序的添加意味着这些应用程序也将永久链接到各个团队的会议。\n莱斯奇卡说：“我们真的看到了很多令人兴奋的事情。”“合作伙伴一直在向我们询问有关参加会议的问题，因此人们对此非常兴奋。”开发人员将于本月晚些时候开始测试这些新的应用程序集成，微软已经看到Polly、Open Agora、iCIMS、Miro和HireVue对将集成到会议中的应用程序感兴趣。\n就像微软团队最近几周宣布的一系列其他功能一样，第三方应用程序集成也受到了正在进行的大流行的推动。“对远程工作的全部关注加快了我们在这方面的交付，”Saseetharan承认。微软还推出了一种新的“一起模式”，试图将同事变成虚拟化身，以改善会议。\n这种共同模式与会议中的第三方应用程序相结合，可能会为微软团队在远程工作时代带来一个有趣的未来。“您看到我们宣布的每一项功能都是为了增强Meetings…。我们正在考虑所有这些功能的可扩展性，“Saseetharan解释说。“团队正在做的每一件事都具有可扩展性，以及我们如何扩大开发人员越来越深入地插入产品的可能性。”\n如果开发人员确实更深入地融入微软团队，我们可以在未来的会议中看到一些创新的协作新方式。微软并不是唯一一家在大流行后的情况下试验远程工作和会议工作方式的公司。Facebook最近还调侃了自己使用增强现实和虚拟现实进行远程工作的愿景，谷歌正在迅速将其截然不同的聊天、房间和会议通信平台整合到Gmail中，以努力与微软团队和Slake竞争。就连Slake也在试图通过Slake Connect重塑商业通信的未来，这是一种让企业相互沟通和协作的更强大的方式。\n为了跟上竞争的步伐，微软正以令人难以置信的速度前进，在许多领域，将许多不同的功能整合到一个应用程序中(或者微软喜欢称之为“中心”的应用程序)。Saseetharan甚至暗示，微软正在考虑开发者是否有兴趣为团队视频通话插入背景效果和过滤器。\n近几个月来，这场流行病一直是微软团队功能背后的驱动力，将该服务的日活跃用户推高至7500万。微软主要团队的视频呼叫竞争对手Zoom也有了巨大的增长，但近几个月来，它不得不花几个月的时间来纠正有争议的隐私和安全问题，而不是推出新的功能。\n很明显，微软已经抓住机会积极推进团队，在2020年结束之前，肯定会有更多的团队功能。", "note_en": "Microsoft is allowing third-party app developers to integrate into the Microsoft Teams meeting experience for the first time. The new developer-focused features will let apps integrate into Teams meetings during video calls, and even before and after meetings. Third-party apps will be able to display content during Microsoft Teams calls, and even display notifications during calls. It’s a big expansion of what third-party apps are able to do in Microsoft Teams right now.\n “Applications can span across chat and collaboration and easily have a workflow that expands into meetings now,” explains Michal Lesiczka, a group product manager of Microsoft Teams, in an interview with  The Verge.\n Applications will be able to add a tab to meeting invites where Teams users can interact with the app before a meeting begins. Once a meeting begins, Teams participants will be able to pull apps into the live call. This could include bots that trigger live notifications about events while a Teams meeting is taking place or an app that shows information to participants in the sidebar. The integration also includes the ability for apps to appear as a button in the meeting controls bar.\n   Previously, if you wanted to share an app or something more than a webcam in Microsoft Teams, the only option available was screen sharing, which isn’t always ideal if you just want to demonstrate one app or avoid notifications or privacy headaches. These new features will allow developers to extend the meetings experience beyond the basics.\n Developers have wanted this type of Teams integration for a long time. “One of the key pieces of feedback is, ‘Okay, we can integrate and enable scenarios in these other areas, but in meetings, we want to be playing there as well,’” explains Archana Saseetharan, a group product manager of Microsoft Teams, in an interview with  The Verge. “We are enabling new APIs and SDK capabilities for developers to integrate and target these new areas. It is the same development process, the same publishing process, the same validation process. Everything is the same, but you have these three new capabilities to go target.”\n  Microsoft Teams meetings also offer a history of chat, files, meeting notes, a whiteboard, and the ability to record and transcribe meetings. The addition of third-party apps means these will also be permanently linked to individual Teams meetings.\n “We’ve really seen a ton of excitement about this,” says Lesiczka. “Partners have been asking us about plugging into meetings, so there’s a lot of excitement about this.” Developers will be able to start testing these new app integrations later this month, and Microsoft is already seeing interest from Polly, Open Agora, iCIMS, Miro, and HireVue for apps that will integrate into meetings.\n   Like the flurry of other Microsoft Teams features that have been announced in recent weeks, third-party app integration has also been driven by the ongoing pandemic. “The whole focus on remote work has accelerated our delivery on this,” admits Saseetharan. Microsoft is also rolling out  a new “Together Mode” that attempts to turn co-workers into virtual avatars to improve meetings.\n This Together Mode combined with third-party apps in meetings could lead to an interesting future for Microsoft Teams in the era of remote working. “Every single feature that you see us announcing is to amplify meetings … we’re thinking about extensibility of all of them,” explains Saseetharan. “Everything that Teams is doing has an extensibility play to it, and how we amplify the possibilities for developers to plug more and more deeply into the product.”\n If developers do plug into Microsoft Teams more deeply, we could see some innovative new ways to collaborate in future meetings. Microsoft isn’t alone in experimenting with how remote working and meetings will work in post-pandemic scenarios. Facebook also recently teased its  own vision of remote work using augmented and virtual reality, and  Google is rapidly integrating its disparate Chat, Rooms, and Meet communications platforms into Gmail in an effort to compete with Microsoft Teams and Slack. Even Slack is trying to reinvent  the future of business communications with Slack Connect, a more powerful way for businesses to communicate and collaborate with each other.\n   Microsoft is moving incredibly fast to keep pace with the competition, and in many areas, combine lots of different functionality into a single app (or “hub” as Microsoft likes to call it). Saseetharan even hints that Microsoft is looking at developer interest in plugging into background effects and filters for Teams video calls.\n The pandemic has been the driving force behind Microsoft Teams features in recent months, pushing the service  up to 75 million daily active users. Microsoft’s main Teams video calling competitor, Zoom, has also seen huge growth, but it’s had to spend recent months  rectifying controversial privacy and security issues rather than rolling out new features.\n It’s clear Microsoft has taken its opportunity to push aggressively with Teams, and there’s bound to be a whole lot more Teams features before 2020 is over.", "posttime": "2020-07-22 06:51:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,团队,teams,会议", "title": "微软团队在会议期间向第三方应用敞开大门", "title_en": "Microsoft Teams Opens Its Doors To Third-Party Apps During Meetings", "transed": 1, "url": "https://www.theverge.com/2020/7/21/21332414/microsoft-teams-third-party-apps-calls-meetings-integration-features", "via": "", "real_tags": ["microsoft", "微软", "团队", "teams", "会议"]}, {"category": "", "categoryclass": "", "imagename": "64c195e09ba006f2476224bde17cd55d.jpg", "infoid": 1013388, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "匿名消息人士告诉Business Insider，Snap已经对公司内部的种族主义和性别歧视指控展开调查。\n据消息人士透露，这家独立公司(总部设在西雅图的威廉姆斯·卡斯特纳)已经联系了现任和前任员工。这项调查似乎与前员工在6月9日Masable的一篇文章中讲述的故事有关，该文章讲述了他们在2015年至2018年期间为Snap工作的经历。\n多位消息人士告诉Masable，他们在公司工作期间经历了种族主义文化，领导层贬低了黑人在媒体上的代表性。一名员工说，他们被要求用一张“更友好的脸”取代黑人表演者的主要形象。这位经理告诉另一位员工，有一篇报道“黑人色彩太浓”，并要求将一些黑人的照片换成其他种族的人。这名员工在对经理的人力资源评估中包括了这一事件，但没有收到回复。\nSnap当时告诉Masable，它正在“调查”这起投诉。首席执行官埃文·斯皮格尔(Evan Spiegel)在最近的一次全体员工会议上告诉员工，公司正在调查Masable报告的事件。\nSnap是硅谷为数不多的几家从未发布过多元化报告的公司之一。在同一次全体会议上，明镜周刊宣布，该公司将继续保持其多样性数据的私密性。这位高管在接受CNBC采访时表示：“我们一直担心，所有这些披露的信息实际上已经使目前科技员工的构成正常化。”他声称，Snap正在研究“一种新的发布信息的方式”。\nSnap的一位发言人在给The Verge的一份声明中表示：“我们完全致力于公开公布我们的多样性数字，以及我们有意义的变革计划。”\n该公司还因发布6月19日的过滤器而招致批评，该过滤器促使用户“微笑并打破枷锁”，显示出似乎近似泛非国旗的东西。Snap负责多样性和包容性的总裁在一封全公司范围内的电子邮件中道歉，并明确表示该过滤器是黑人和白人员工合作的结果。据公司发言人称，Snap也在调查这件事。\n这并不是第一个陷入麻烦的滤镜快照-该公司早在2016年就发布了一款鲍勃·马利(Bob Marley)滤镜，它有效地创建了黑脸，以及一个受到动漫启发的镜头，一些用户觉得它把面孔变形成了种族主义的亚洲漫画。\n更新时间：美国东部时间7月21日下午6：01：故事已经更新，包含了Snap的一份声明。", "note_en": "Snap has launched an investigation into accusations of racism and sexism within the company, anonymous sources have told   Business Insider .\n Per the sources, the independent firm (Seattle-based Williams Kastner) have contacted both current and former staff. The investigation appears to concern stories that ex-employees recounted in a June 9th   Mashable  article about their experiences working for Snap between 2015 and 2018.\n Multiple sources told  Mashable that they experienced a racist culture during their time at the company, and that leadership disparaged Black representation in media. One employee said they were asked to replace a lead image of Black performers with a “friendlier face.” The same manager told another employee that a story was “too black-heavy” and asked that some snaps of Black people be replaced with people of other races. The employee included the incident in an HR review of the manager but did not hear back.\n Snap told  Mashable at the time that it was “looking into” the complaint. CEO Evan Spiegel told employees in a  recent all-hands meeting that the company was investigating the incidents that  Mashable reported.\n Snap is one of the few Silicon Valley companies that has never released a diversity report. In the same all-hands meeting, Spiegel announced that the company would continue to keep its diversity numbers private. “We’ve been worried that all these disclosures have actually normalized the current composition of the tech workforce,” the executive said in an interview with  CNBC . He claimed that Snap is working on “a new way right now to release that information.”\n ”We are fully committed to publicly releasing our diversity numbers, along with our plans for meaningful change,” a Snap spokesperson said in a statement to  The Verge.\n The company also drew criticism for releasing a  Juneteenth filter that prompted users to “smile and break the chains,” showing what appeared to be an approximation of the Pan-African flag. Snap’s president of diversity and inclusion apologized in a  companywide email, specifying that the filter was the result of a collaboration between Black and white employees. Snap is investigating that matter as well, per a company spokesperson.\n It wasn’t the first filter Snap has gotten in trouble for — the company released a  Bob Marley filter back in 2016 that effectively created blackface, as well as an anime-inspired lens that some users felt morphed faces into racist Asian caricatures.\n Update July 21st, 6:01pm ET:  The story has been updated to include a statement from Snap.", "posttime": "2020-07-22 06:50:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "领导,snap", "title": "消息来源：Snap已聘请一家律师事务所领导对公司内部种族主义和性别歧视指控的调查，此前前员工在6月发表言论", "title_en": "Sources: Snap has hired a law firm to lead an investigation into accusations of racism and sexism within the company, after former employees spoke out in June", "transed": 1, "url": "https://www.theverge.com/2020/7/21/21333151/snap-snapchat-investigation-evan-spiegel-racism-sexism-discrimination-reports?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["领导", "snap"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013387, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近意识到杰夫·贝佐斯(Jeff Bezos)在互联网时代的政策，即在亚马逊内部禁止PPT。取而代之的是，会议组织者必须写一份多页的“叙述”，并在会议开始时分发给所有与会者-拒绝任何一个人抢先一步-只有在每个人都读完之后，会议才会开始。\n这一政策尤其值得注意，因为它发现自己嵌入了一家主要由软件工程师组成的公司，而软件工程师往往对撰写散文既没有经验，也没有兴趣。当用数学和指令序列毫不含糊地描述作为算法的思想时，我们感觉最自在。我们越是背离这一点，我们就越感到不满，因为自然语言的模糊性渗透了进来，不必要地侵蚀了清晰度。\n但仔细一看，我认为这既不是关于PPT的，也不是关于阅读的，而是关于思考的。来看看为什么我们需要把目光放在标题之外。\n如果我们能仔细查看杰夫2004年的发件箱，我们会发现他最初的电子邮件：\n出发地：贝佐斯，杰夫发送：2004年6月09日(星期三)下午6：02至：[编辑]主题：Re：从现在开始不再使用PPT演示文稿更多地帮助回答这个问题&为什么。结构良好的叙事性文本才是我们要追求的，而不仅仅是文本。如果有人在Word中创建了一个项目符号列表，那将和PowerPoint一样糟糕。写一份好的4页备忘录比写一份20页的PPT更难，是因为一份好备忘录的叙事结构迫使人们更好地思考，更好地理解什么比什么更重要，以及事情是如何相关的。PowerPoint风格的演示以某种方式允许粉饰想法，淡化任何相对重要性的感觉，而忽略想法的相互关联性。杰夫。\n这一点从语言上说得很清楚：“写作”被提到了两次，而“阅读”却完全没有。重要的是创造，而不是消费。即使备忘录被写好并立即粉碎，书写的行为也不会被取消，思想和理解的改善将持续下去。\n尽管如此，对于一家试图成为地球上最以客户为中心的公司来说，很难动摇这样一种感觉，即最好把时间花在与客户互动上，而不是精心编造故事。\n但亚马逊远不是第一个认识到写作过程中的价值的公司。有些人甚至走得更远：\n写作就是思考。写得好就是要想得清楚。这就是为什么它这么难的原因。\n在这里，我认为更值得深入探讨的问题是--为什么清晰的思考很重要？显然--在我们的软件工程环境中--如果您没有清晰地思考，那么您个人制定的任何解决方案都将是次优的。\n这无疑是真的。但更重要的是，写一篇连贯而合乎逻辑的叙述会迫使你的思想形成一种易于与他人沟通并用来说服他人的形式。我们没有一个人是孤立工作的。如果你不能说服别人相信它的优点，那么得到答案就没有什么意义了。\n让我们想象一下一个工程师团队。在刚刚得知公司范围内要求从内部服务器迁移到云之后，他们必须就引入哪种技术做出影响深远的决定。为了达成共识，他们聚集在一块披萨周围，开始交换意见。\nKubernetes的人知道，只有他的解决方案才能使未来摆脱围绕已解决的身份验证和服务发现问题的乏味讨论。电池必须包括在内。右边的三片另一位工程师信心满满，信奉Nomad的优点--单一用途、正交和可组合的组件是设计良好的软件系统的基石。原则必须放在第一位。\n经过一个小时的讨论，从一个特性跳到另一个特性，从赞成到反对，再到错误，再到特性，每个人都学到了一些新东西。但没有人被说服，也没有出现共识。这种无组织的讨论虽然对知识交流很有用，但并不是达成协议的有效机制。\n打破僵局需要的是单个人1以全面、流畅和合乎逻辑的方式编造一个叙述，捕捉从业务需求到实施的实际情况的整个过程。这将是有说服力的-它将向其他人灌输信心，认为这不仅是抽象意义上的最佳技术，而且是目前我们的问题、我们的业务和我们的员工的正确选择。\n其他人阅读这篇文章会很有用。但是，即使他们不这样做，创作者新发现的头脑清晰也会让他们能够提出足够有说服力的论点，以打破想法的僵局。\n对于这种特殊的情况--技术的选择--作者可能已经考虑过并触及过：\n决定改变技术的根本原因是什么？为什么这是值得开始的，会看到什么好处？\n我们有什么理由要研究这项特殊的技术作为解决方案呢？还有什么其他的选择值得研究吗？\n赌注有多高？我们是在打大教堂的地基还是在粉刷自行车棚？如果事情不顺利，我们可以稍后很容易地换吗？\n建议的技术是否有使命声明或核心指导原则？这与我们的问题和哲学有什么关系？\n如果我们随波逐流，最终目标是什么？当实施完成后，世界会是什么样子呢？\n我们如何才能在最小干扰的情况下从我们所在的地方到达我们想要的地方？过渡期可能是什么样子的？大概多久？\n有什么风险吗？我们可以采取什么措施来减少它们？有什么未知的未知数吗？\n与基本业务需求相关，并用建议进行总结，解释为什么这是最佳选择。\n在这种情况下，叙述的内容将与技术设计文档基本重叠。但是，尽管TDD本身就是一个目的，但这篇文章的实际输出是一个令人愉快的副作用。重要的是作者头脑中留下的条理清晰的思想。\n在以前将这些想法熟练地翻译成自然语言之后，当需要时，作者将毫不费力地再次这样做，无论是口头的还是实时的。在考虑了这个问题的几个层次的分析之后--要写得好，他们必须这样做--他们会在一瞬间注意到，无论他们现有的知识如何，他们都能够调整自己的叙述，以适应任何受众。\n最后，与专门的工具不同，叙述是笼统的。它们具有伸缩性。从最狭隘的技术问题，到整个公司的使命和宗旨这一最根本的问题，都没有阻碍清晰思考的问题。\n更准确地说，我认为至少有一个人。如果多个人最初的想法相互冲突，那么我会主张他们每个人都创作自己的叙事，然后用一种对抗性的方式将他们结合在一起，前提是这符合文化。↩", "note_en": "I recently became aware of Jeff Bezos’s dotcom-era policy of  banning PowerPoint within Amazon. Instead, meeting organizers must write a multi-page “narrative” and distribute it to all attendees at the start of the meeting - denying any single person a head start - and only after everyone has finished reading do proceedings begin.\n This policy is particularly notable as it finds itself embedded in a company staffed largely by software engineers, who often have neither experience nor interest in writing prose. We feel most at home when transmitting ideas as algorithms, unambiguously described by mathematics and sequences of instructions. And the further we stray from this the more discontent we feel as the ambiguities of natural language leak through, needlessly eroding clarity.\n But on closer examination I believe this is neither about powerpoint nor about reading - it’s about thinking. To see why we need to look beyond the headline.\n If we could peer into Jeff’s 2004-era outbox we would find his original email:\n From: Bezos, Jeff  Sent: Wednesday, June 09, 2004 6:02PM  To: [REDACTED]  Subject: Re: No powerpoint presentations from now on at steam   A little more to help with the question &#34;why.&#34;  Well structured, narrative text is what we&#39;re after rather than just text. If someone builds a list of bullet points in word, that would be just as bad as powerpoint.  The reason writing a good 4 page memo is harder than &#34;writing&#34; a 20 page powerpoint is because the narrative structure of a good memo forces better thought and better understanding of what&#39;s more important than what, and how things are related.  Powerpoint-style presentations somehow give permission to gloss over ideas, flatten out any sense of relative importance, and ignore the interconnectedness of ideas.   Jeff\n The point being made is clear from the language: “writing” is mentioned twice but “reading” not at all. It’s  creation which is important, not  consumption. Even if the memo was written and immediately shredded, the act of writing would not be undone and the improvement to thought and understanding would persist.\n Still, for a company trying to be  Earth’s most customer-centric company, it is hard to shake the feeling that time would be best spent interacting with, say,  customers, rather than crafting narratives.\n But Amazon is far from the first to recognise the value in the writing process. Some go even further:\n Writing is thinking. To write well is to think clearly. That&#39;s why it&#39;s so hard.\n And here I think it’s worth digging even further to ask - why is thinking clearly important?  Obviously - in our context of software engineering - if you don’t think clearly then any solutions you craft as an individual will be suboptimal.\n That is undoubtedly true. But more importantly, writing a coherent and logical narrative forces your thoughts into a shape which can be easily communicated to others and used to persuade. None of us work in isolation. There is little point in having the answer if you cannot convince others of its merit.\n  Let’s imagine a team of engineers. Having just been informed of the firm-wide mandate to migrate from in-house servers to the cloud, they must make the impactful and long-lasting decision about which technology to introduce. In an attempt to reach consensus they’ve gathered around a pizza and begin exchanging views.\n The Kubernetes guy  knows that only his solution leads to a future free from tedious discussions around the solved problems of authentication and service discovery. Batteries must be included. Three slices to the right another engineer brims with confidence and espouses the virtues of Nomad - single-purpose, orthogonal and composable components are the  bedrock of well-engineered software systems. Principles must come first.\n After an hour of discussion bouncing from feature to feature to pro to con to bug to feature, everyone has learned something new. But no one is persuaded and no consensus has emerged. Though useful for knowledge exchange, such unstructured discussions are not an efficient mechanism for reaching agreement.\n What is needed to break the stalemate is for a single individual  1 to spin a narrative which captures the journey from business need through to practicalities of implementation, in a comprehensive, flowing and logical manner. This would be persuasive - it would instill in others the confidence that this is not just the best technology in an abstract sense, it’s the right choice for  our problem,  our business, and  our people at  this point in time.\n It would be useful for others to read this. But even if they didn’t, the newfound clarity of mind of the creator would allow them to make an argument persuasive enough to break the stalemate of ideas.\n For this particular situation - the choice of a technology - the writer will likely have thought about and touched on:\n  What were the underlying reasons for the decision to change technologies? Why is this worthwhile embarking on and what benefits will be seen?\n  What reason do we have for investigating this particular tech as a solution? What other alternatives are worth investigating?\n  How high are the stakes? Are we laying the foundations of the cathedral or painting the bike shed? Can we easily switch later if things aren’t working out?\n  Does the tech being suggested have a mission statement or core guiding principles? How does that tie in with our problem and philosophy?\n  If we roll with it, what’s the end goal? When implementation is complete, what does the world look like?\n  How might we get from where we are to where we want to be with minimal disruption? What might the transition period look like? How long, roughly?\n    Are there any risks? What steps might we take to reduce them? Any  unknown unknowns?\n  Relate back to the underlying business needs and sum up with a recommendation, explaining why this the best option\n In this case, the content of the narrative would overlap substantially with a technical design document. But whereas a TDD is an end in itself, the physical output of this writing is a pleasant side-effect. What matters are the organised thoughts left in the mind of the author.\n Having competently translated these thoughts into natural language once before, the author will have no trouble doing so again when called upon, orally and in real-time. And having considered the problem at several levels of analysis - as must be done to write well - they will, at a moments notice, be able to adapt their narrative to suit any audience, regardless of their existing knowledge.\n Finally, unlike specialised tools, narratives are general. They scale. From the narrowest of technical issues up to the most fundamental question of the mission and purpose of the company as a whole, there are no problems which resist clear-thinking.\n more precisely I’d say  at least one individual. If multiple people had conflicting initial thoughts then I would advocate they each produce their own narrative then bring them together with an  adversarial approach, provided this fits in with the culture.  ↩", "posttime": "2020-07-22 06:48:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "写作,start,技术", "title": "开始写作的时间到了(2019年)", "title_en": "It's Time to Start Writing (2019)", "transed": 1, "url": "https://alexnixon.github.io/2019/12/10/writing.html", "via": "", "real_tags": ["写作", "start", "技术"]}, {"category": "", "categoryclass": "", "imagename": "b7541f32d6db7c8391a336e208bdb93c.jpg", "infoid": 1013386, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在从这场流行病中逃脱的路线上取得了更多的好消息：周一，来自牛津大学(Oxford University)和阿斯利康(AstraZeneca)制药公司的疫苗研究人员宣布了“1/2期试验”的结果，表明他们的产品可能能够在不造成严重伤害的情况下产生免疫力。就在上周，生物技术公司Modern na与美国国立卫生研究院(U.S.National Institutes Of Health)合作生产的另一种候选疫苗也公布了类似的、但规模较小的结果。\n随着这些组织和其他组织进入测试的最后阶段，至关重要的是公众对这项工作有一个清晰而平衡的理解-一项穿越所有营销和炒作的工作。但我们并没有一个良好的开端。到目前为止的证据表明，我们被这些群体的公关迷惑了，被他们惊人速度的故事所诱惑，以至于我们正在失去对其他一切的跟踪。特别是，主流媒体和医学媒体都没有太多关注这两种疫苗的潜在负面影响-特别是它们产生严重不良影响的风险，即使它们不会危及生命。这种吹嘘不仅有助于建立错误的印象，还可能为未来散布疫苗恐惧的行为擦干火药味。\n早在5月份，美国有线电视新闻网(CNN)的一篇报道称，牛津集团在为其产品描绘“最乐观的图景”方面是“最积极的”，所以让我们从他们开始吧。牛津的图景到底有多美好？本周的新闻显示，疫苗有可能保护人们免受新冠肺炎的伤害，这是千真万确的。不过，美中不足的是，还是有苍蝇在作怪。例如，在这种疫苗的第一次临床试验于4月份开始后，研究人员增加了新的研究手臂，在注射后的24小时内，人们每6小时注射一次扑热息痛。当然，这并没有出现在他们的营销中，而且我在初夏的媒体报道中也没有看到关于这一不寻常举措的讨论。报纸只说疫苗已经被证明“对恒河猴是安全的”，并且在动物试验中没有引起任何不良反应。然而，这是一个令人担忧的信号：人们使用这种疫苗的过程有多艰难？扑热息痛的用意是退烧、头痛、不适，还是所有这些？\n牛津大学的研究小组也在给参与者服用扑热息痛，这项高级的3期试验目前也在巴西进行。在另一项涉及英国1万人的疫苗重大研究中，如果你有过敏反应或病情可能会因扑热息痛而恶化，你就不能参加。然而，在同一组在南非的试验中，没有提到额外的药物。\n记者们几个月前就可以就这个问题向他们施压。第一批接种疫苗的人被精心挑选为最不可能产生负面反应的人。如果牛津疫苗让他们大吃一惊，对我们其他人来说可能不是好兆头。不要误会我的意思：一两天的疼痛或疾病不会阻止我接种有效的新冠肺炎疫苗。但我认为，如果是这样的话，我们需要做好准备。\n周一公布牛津疫苗试验结果的新闻稿描述了参与者中“轻微副作用”的频率增加。然而，看一看实际的报纸，就会发现这是一种营销宣传，后来在媒体报道中被鹦鹉学舌。(“纽约时报”(New York Times)、“华尔街日报”(The Wall Street Journal)和路透社(Reuters)等媒体的文章中出现了“轻微副作用”或“只有轻微副作用”等短语。)。是的，轻微的反应比严重的反应要常见得多。但中度或严重的伤害-定义为严重到足以干扰日常生活或需要医疗护理-也很常见。在接种了不含对乙酰氨基酚的新冠肺炎疫苗的人中，约有三分之一的人经历了中度或重度寒战、疲劳、头痛、不适和/或发烧。近10%的人发烧至少100.4度，略多于四分之一的人出现中度或重度肌肉疼痛。对于一群年轻而健康的人来说，这是很多的-对乙酰氨基酚对这些问题中的大多数都没有多大帮助。这篇论文的作者称该疫苗是“可接受的”和“耐受的”，但我们还不知道这对大多数人来说会有多大的接受度。如果记者不开始问更尖锐的问题，这将成为反疫苗信息的完美设置：以下是他们忘记告诉你的关于Risks…的事情。\n还有另一个危险信号。其他新冠肺炎疫苗的临床试验有安慰剂组，参与者接受生理盐水注射。然而，牛津疫苗试验中只有一项采用了这种方法；其他人则将实验治疗与注射脑膜炎球菌疫苗进行了比较。这样做是有很好的理由的：非安慰剂注射可能会模仿你已经接种了活性疫苗的迹象，比如皮肤反应，使试验变得更加“盲目”。但它们的用途也\n随着上周“现代”杂志的论文发表，这群人的研究结果终于正式发表了。与此同时，该小组登记了一项30,000人的3期临床试验，指定了一对100微克的新冠肺炎疫苗注射。根据5月份的新闻稿，该特定剂量组的患者没有发生严重的不良事件。但上周的论文显示了全部结果：当他们服用两剂时，每一剂都显示出头痛、寒战或疲劳的迹象；对于至少80%的人来说，这可能足以干扰他们的正常活动。一位对特别高剂量有严重反应的参与者详细地谈到了情况有多糟糕：如果其中一些疫苗的反应即使只有一半严重，一旦到达社区就很难推销-而且可能会有很多人不愿接种第二针。\n美国社会对快速追踪的新冠肺炎疫苗已经存在很高程度的错误信息和不信任。本周，建安国和他的同事们的一份新的预印本发现，即使是相当大比例的香港护士也会犹豫要不要拿一本。该论文的作者说，我们可能很快就会有疫苗，但是“社区还没有准备好接受它。”如果显著的危害证据不断被搁置一边，这将无助于克服这种怀疑。直截了当地说出接种这些疫苗的真正感觉要好得多。否则为什么会有人相信专家呢？", "note_en": "More good news on progress towards an escape route from this pandemic: On Monday, vaccine researchers from Oxford University and the pharmaceutical company AstraZeneca announced  results from a “Phase 1/2 trial,” suggesting their product might be able to generate immunity without causing serious harm. Similar, but smaller-scale results, were  posted just last week for another candidate vaccine produced by the biotech firm Moderna, in collaboration with the U.S. National Institutes of Health.\n As both these groups and  others push ahead into the final phase of testing, it’s vital that the public has a clear and balanced understanding of this work—one that cuts through all the marketing and hype. But we’re not off to a good start. The evidence so far suggests that we’re getting blinkered by these groups’ PR, and so seduced by stories of their amazing speed that we’re losing track of everything else. In particular, neither the mainstream media nor the medical press has given much attention to the two vaccines’ potential downsides—in particular, their risk of nasty adverse effects, even if they’re not life-threatening. This sort of puffery doesn’t only help to build a false impression; it may also dry the tinder for the future spread of vaccine fear-mongering.\n   Back in May, a CNN report  described the Oxford group as being “the most aggressive in painting the rosiest picture” of its product, so let’s start with them. Just how rosy is the Oxford picture really? It’s certainly true that this week’s news shows the vaccine has the potential to provide protection from Covid-19. But there are flies in the ointment. After the first clinical trial for this vaccine began  in April, for example, the researchers  added new study arms in which people got acetaminophen every six hours for 24 hours after the injection. That’s not featured in their marketing, of course, and I saw no discussion of this unusual step in media coverage in early summer. Newspapers only said the vaccine had been proven “ safe with rhesus monkeys,” and  did not cause any adverse effects in those animal tests. It was a worrying signal though: How rough a ride were people having with this vaccine? Was the acetaminophen meant to keep down fever, headaches, malaise—or all of the above?\n The Oxford group is also giving acetaminophen to participants in an  advanced, phase 3 trial now underway in Brazil, too. In another  major study of the vaccine, involving 10,000 people in the UK, you can’t participate if you have an allergy or condition that could be made worse with acetaminophen. No mention of the extra drug, though, in the same group’s  trial in South Africa.\n  Journalists could have pressed them on this issue months ago. The first people to get vaccines are carefully picked to be the least likely to have a negative reaction. If the Oxford vaccine is knocking them around badly, it might not bode well for the rest of us. Don’t get me wrong: a day or two of pain or illness wouldn’t deter me from getting an effective Covid-19 vaccine. But I think we need to be prepared if that’s going to be the case.\n  The  press release for Monday’s publication of results from the Oxford vaccine trials described an increased frequency of “minor side effects” among participants. A look at the  actual paper, though, reveals this to be a marketing spin that has since been parroted in media reports. (The phrases “minor side effects” or “only minor side effects” appeared in writeups from the   New York Times, the   Wall Street Journal and  Reuters, among other outlets.) Yes, mild reactions were far more common than worse ones. But moderate or severe harms—defined as being bad enough to interfere with daily life or needing medical care—were common, too. Around one-third of people vaccinated with the Covid-19 vaccine without acetaminophen experienced moderate or severe chills, fatigue, headache, malaise, and/or feverishness. Close to 10 percent had a fever of at least 100.4 degrees and just over one-fourth developed moderate or severe muscle aches. That’s a lot, in a young and healthy group of people—and the acetaminophen didn’t help much for most of those problems. The paper’s authors designated the vaccine as “acceptable” and “tolerated,” but we don’t yet know how acceptable this will be to most people. If journalists don’t start asking tougher questions, this will become the perfect setup for anti-vaccine messaging:  Here’s what they forgot to tell you about the risks…\n  There is another red flag. Clinical trials for other Covid-19 vaccines have placebo groups, where participants receive saline injections. Only one of the Oxford vaccine trials is taking this approach, however; the others instead compare the experimental treatment to an injected meningococcal vaccine. There can be good reasons to do this: Non-placebo injections may  mimic telltale signs that you’ve received an active vaccine, such as a skin reaction, making the trial more truly “blind.” But their use also opens the door to doubt-sowing claims that any harms of the new vaccine are getting buried among the harms already caused by the control-group, “old” vaccines.\n Coverage of the Moderna vaccine reflects a different kind of pharma spin: the drip-feeding of selective data via press release. On May 18, Moderna  put out some patchy, positive findings on interim outcomes from their first-in-human trial. The company followed that up with a stock offering—and company executives  sold off nearly $30 million in shares into the feeding frenzy their press release created.\n   With last week’s  paper from Moderna, results from that same group of people finally had their formal publication. At the same time, the group registered a 30,000-person  phase 3 clinical trial, specifying a pair of 100-microgram injections of the Covid-19 vaccine. According to the press release from May, there were no serious adverse events for the people in that particular dosage group. But last week’s paper shows the full results: By the time they’d had two doses, every single one was showing signs of headaches, chills or fatigue; and for at least 80 percent this could have been enough to interfere with their normal activities. A participant who had a severe reaction to a particularly high dose has  talked in detail about how bad it was: If reactions even half as bad as this were to be common for some of these vaccines, they will be hard sells once they reach the community—and there could be a lot of people who are reluctant to get the second injection.\n There is already a  high level of misinformation and distrust about fast-tracked Covid-19 vaccines in the American community. This week,  a new preprint from Kin On Kwok and colleagues found that even a sizable proportion of nurses in Hong Kong would be hesitant to take one. We may have a vaccine soon, say the authors of that paper, but “communities are not ready to accept it.” It won’t help to overcome this skepticism if notable evidence of harms keeps getting pushed off to the side. It’s much better to be straight up about what it’s really like to take one of these vaccines. Why would anyone trust the experts otherwise?", "posttime": "2020-07-22 06:47:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "肺炎,minor,疫苗", "title": "新冠肺炎疫苗副作用很小，但仍可能相当糟糕", "title_en": "Covid-19 Vaccines with 'Minor Side Effects' Could Still Be Pretty Bad", "transed": 1, "url": "https://www.wired.com/story/covid-19-vaccines-with-minor-side-effects-could-still-be-pretty-bad/", "via": "", "real_tags": ["肺炎", "minor", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "268c3f398be5fc7cee05c449310471cf.jpg", "infoid": 1013385, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一旦特斯拉达到了路透社(Reuters)最先报道的6个月平均往绩市值1500亿美元，马斯克就有资格获得2018年股东批准的史无前例的薪酬方案中授予他的12个期权级别中的第二个级别。在触发归属选择权之前，董事会仍必须证明里程碑。\n这一里程碑是在特斯拉计划公布第二季度收益的前一天实现的。\n薪酬计划由2,030万股股票期权奖励组成，分为12批，每批169万股。如果特斯拉在市值、收入和调整后收益(不包括股票薪酬等某些一次性费用)方面达到特定里程碑，这些期权将以增量授予。一旦董事会认证了每个里程碑，马斯克就能够以每股350.02美元的大幅折扣价购买这169万股票。\n根据今天1,568.36美元的股价，马斯克届时可能会以约21亿美元的价格出售169万股股票。请记住，特斯拉董事会在5月份认证了第一个里程碑，解锁了第一批债券。因此，根据今天的股价，马斯克理论上将获利约42亿美元。然而，所有这些都有一个重要的警告。马斯克必须持有他在行使2018年首席执行官业绩奖时获得的任何股份，至少在行使后五年内。\n要获得第一批股票期权，特斯拉的市值必须达到1002亿美元的六个月平均水平，以及200亿美元的年收入或15亿美元的调整后EBITDA。为了达到下一个里程碑，特斯拉的市值不得不再增加500亿美元的价值和350亿美元的收入，或30亿美元的调整后EBITDA。\n要获得第三批贷款的资格，特斯拉的市值必须达到2,000亿美元的六个月平均水平，营收为550亿美元，调整后的EBITDA为45亿美元。", "note_en": "Once Tesla hit the six-month average trailing market cap of $150 billion, which  Reuters first reported, Musk became eligible to access the second of 12 levels of options granted to him in an unprecedented pay package approved by shareholders in 2018. The board must still certify the milestone before the vesting option is triggered.\n The milestone was met the day before Tesla is scheduled to report its second-quarter earnings.\n  The  compensation plan consists of 20.3 million stock option awards broken up into 12 tranches of 1.69 million shares. These options will vest in increments if Tesla hits specific milestones on market cap, revenue and adjusted earnings (excluding certain one-time charges such as stock compensation). Once the board certifies each milestone, Musk is able to buy the 1.69 million shares at a steeply discounted price of $350.02 per share.\n Based on today’s share price of $1,568.36, Musk could then sell 1.69 million shares for about $2.1 billion. Keep in mind, that  Tesla’s board certified in May the first milestone, which unlocked the first tranche. So, combined, Musk would theoretically profit about $4.2 billion, based on today’s share price. However, there is an important caveat to all of this. Musk must hold any shares that he acquires upon exercise of the 2018 CEO performance award for at least five years post-exercise.\n  To access the first tranche of stock options, Tesla’s market value had to reach a six-month average of $100.2 billion and either $20 billion in annual revenue or $1.5 billion in adjusted EBITDA. To meet the next milestone, Tesla’s market cap had to increase another $50 billion in value and $35 billion in revenue or $3 billion in adjusted EBITDA.\n To qualify for the third tranche, Tesla’s market value must reach a six-month average of $200 billion and either $55 billion in revenue or $4.5 billion in adjusted EBITDA.", "posttime": "2020-07-22 06:25:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "埃隆·马斯克,股票,马斯克,stock", "title": "\n埃隆·马斯克(Elon Musk)距离另一项21亿美元的股票期权只有一次董事会批准", "title_en": "\n\t\t\t\tElon Musk is one board approval away from another $2.1 billion in stock options\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/elon-musk-is-one-board-approval-away-from-another-2-1-billion-in-stock-options/", "via": "", "real_tags": ["埃隆·马斯克", "股票", "马斯克", "stock"]}, {"category": "", "categoryclass": "", "imagename": "873d2e5b2e674c79d911598c44ef14db.jpg", "infoid": 1013384, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Snap警告说，围绕返校季节和体育联盟第三季度运营等活动的不确定性可能会影响广告需求。\n该公司周二公布第二季度收益时表示，到目前为止，第三季度营收同比增长32%，但预计这一增长将在本季度剩余时间内放缓。\n首席财务官德里克·安德森(Derek Andersen)在该公司准备好的财报电话会议上表示，从历史上看，第三季度的广告需求一直受到一些因素的提振，这些因素似乎不太可能像前几年那样实现，包括开学季节、电影上映时间表以及各种体育联盟的运营。\nSnap警告说，围绕返校季节和体育联盟第三季度运营等活动的不确定性可能会影响广告需求。\n该公司周二公布第二季度收益时表示，到目前为止，第三季度营收同比增长32%，但预计这一增长将在本季度剩余时间内放缓。\n首席财务官德里克·安德森(Derek Andersen)在该公司的财报电话会议上表示：虽然我们对这些趋势会随着时间的推移保持谨慎乐观，但我们也意识到，运营状况可能仍然不稳定，经济状况可能会进一步恶化。\n例如，从历史上看，第三季度的广告需求一直受到一些因素的提振，这些因素似乎不太可能像前几年那样实现，包括返校季节、电影上映时间表以及各种体育联盟的运营。\n安徒生表示，很难说这些因素会对第三季度剩余时间的支出产生多大影响。\n他说：我们目前最好的估计是，我们整个季度的收入增长率可能低于本季度迄今估计的实际增长率，因此，我们基于大约20%的收入增长制定了内部投资计划。\n他补充说，该公司对下一季度日活跃用户的估计为：我们打算在第三季度继续投资于我们的业务，我们对成本结构的估计假设第三季度的日活跃用户将在2.42亿至2.44亿之间。这意味着年增长率约为15%至16%，或3200万至3400万日活跃用户。", "note_en": "Snap warned that the uncertainty around events like the back-to-school season and the operations of sports leagues in the third quarter could impact advertising demand.\n The company said while reporting second quarter earnings Tuesday that so far in Q3, revenue is up 32% from the previous year, but expects that growth to moderate through the rest of the quarter.\n &#34;Advertising demand in Q3 has historically been bolstered by factors that appear unlikely to materialize in the same way they have in prior years, including the back to school season, film release schedules, and the operations of various sports leagues,&#34; chief financial officer Derek Andersen said in the company&#39;s earnings call prepared remarks.\n Snap warned that the uncertainty around events like the back-to-school season and the operations of sports leagues in the third quarter could impact advertising demand.\n The company said  while reporting second quarter earnings Tuesday that so far in Q3, revenue is up 32% from the previous year, but it expects that growth to moderate through the rest of the quarter.\n  &#34;While we are cautiously optimistic that these trends could sustain over time, we are also conscious that operating conditions may remain volatile, and that economic conditions could further deteriorate,&#34; chief financial officer Derek Andersen said in the company&#39;s earnings call prepared remarks.\n &#34;For example, advertising demand in Q3 has historically been bolstered by factors that appear unlikely to materialize in the same way they have in prior years, including the back to school season, film release schedules, and the operations of various sports leagues.&#34;\n Andersen said it was difficult to tell how much those factors would impact spend in the rest of the third quarter.\n &#34;Our best estimate at this point is that our full quarter revenue growth rate is likely to be below our quarter to date estimated actual growth rate, and as a result we have built our internal investment plan based on revenue growth of approximately 20 percent,&#34; he said.\n He added the company&#39;s estimates for daily active users in the quarter ahead: &#34;We intend to continue to invest in our business in Q3 and our estimates for our cost structure assume that daily active users will be between 242 million and 244 million in Q3. This implies year-over-year growth of approximately 15 to 16 percent or 32 to 34 million daily active users.&#34;", "posttime": "2020-07-22 06:22:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "体育,广告,sports,预计,expects", "title": "Snap预计其增长将在第三季度剩余时间内放缓，因为围绕开学季节和体育联赛运营的不确定性影响了广告需求", "title_en": "Snap expects its growth to moderate through rest of Q3, as uncertainty around back-to-school season and operations of sports leagues impact advertising demand", "transed": 1, "url": "https://www.cnbc.com/2020/07/21/snap-q3-ads-warning-lack-of-sports-movies-back-to-school-could-hurt.html", "via": "", "real_tags": ["体育", "广告", "sports", "预计", "expects"]}, {"category": "", "categoryclass": "", "imagename": "6ce8bdf79ebc4af1d4c72e7b3d70e952.jpg", "infoid": 1013382, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司计划在2021年开始分阶段推出新的方法。它还没有公布全部细节，但目标是回应监管、平台变化和其他因素正在改变用户隐私和数据收集格局的方式(例如，越来越多的浏览器屏蔽第三方cookie的做法)。\n首席运营官Karthik Rao告诉我：“在下一章--甚至在当前一章--移动数据不再容易。”“它需要人才基础，需要技能，需要技术，需要与合适的云合作伙伴合作。”\n拉奥认为，尼尔森是唯一适合适应这个更以隐私为中心的新世界的公司，部分原因是该公司通过消费者面板收集数据的历史根源，他说这是获得对受众和消费者行为的“最有力的理解”的“最符合隐私的方式”。\nRao补充说，尼尔森的新方法论将额外强调数据和数据模型的可移植性，以及消除受众的重复，这样公司就不会无意中将相同的人计算在不同的平台上。\n他说：“我再怎么强调行业中重复数据消除的必要性也不为过。”“我们一觉醒来就会想到这一点，这是(公司)的新口头禅。它已经存在很长一段时间了，但它在这个进化过程中是一个非常重要的口头禅，而且在以后的进化中也是如此。“", "note_en": "The company plans to start rolling out the new methodology in phases in 2021. It isn’t sharing the full details yet, but the goal is to respond to the ways that regulation, platform shifts and other factors are changing landscape for user privacy and data collection (for example the growing browser practice of  blocking third-party cookies).\n “In the next chapter — even in the current chapter — moving data around is not easy anymore,” Chief Operating Officer Karthik Rao told me. “It takes a talent base, it takes skills, it takes technology, it takes partnering with the right cloud partners.”\n  Rao suggested that Nielsen is uniquely suited to adapting to this new, more privacy-centric world, partly because of the company’s historic roots in collecting data through  consumer panels, which he said are “the most privacy compliant way” to gain “the most robust understanding” of audience and consumer behavior.\n  Rao added that Nielsen’s new methodologies will place an additional emphasis on the portability of data and data models, as well as on de-duplicating audiences, so that the firm isn’t inadvertently counting the same people on different platforms.\n “I can’t stress enough the need for de-duplication in the industry,” he said. “We wake up thinking about it, it’s the [company’s] new mantra. It’s existed for a long time, but it’s a really important mantra in this evolution, and beyond as well.”", "posttime": "2020-07-22 05:58:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "revamping", "title": "\n尼尔森正在修改其衡量数字受众的方式", "title_en": "\n\t\t\t\tNielsen is revamping the way it measures digital audiences\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/nielsen-digital-methodology/", "via": "", "real_tags": ["revamping"]}, {"category": "", "categoryclass": "", "imagename": "0b95e594ab6733496016d4d96c4149b7.jpg", "infoid": 1013381, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "孟加拉国当地监管机构孟加拉电信管理委员会上周晚些时候表示，它之所以采取行动做出这一决定，是因为免费使用社交媒体服务促使一些人滥用社交媒体服务实施犯罪。当地奥特莱斯商业标准最先报道了这一发展。孟加拉国是亚洲最大的互联网市场之一，拥有超过1亿在线用户。\n过去10年，Facebook和Twitter等科技公司与多个市场的电信运营商和其他互联网提供商达成了合作伙伴关系，更广为人知的是零评级协议，以向用户免费提供服务，以加快增长。通常，作为这些交易的一部分，科技公司会为用户的数据消费成本提供资金。\n点播流媒体服务Bongo的首席执行官阿哈德在接受TechCrunch采访时表示，在孟加拉国，这样的零评级交易已经流行了几年。\n孟加拉最大的两家电信运营商Grameenphone和Robi Axiata使其移动用户即使在手机信用耗尽的情况下也能使用合作伙伴的少数服务。这两家电信公司都表示，他们正在遵守达卡的命令。\n目前尚不清楚，在孟加拉国下达命令后，Facebook在数十个市场运营的免费基础服务项目(Free Basics)是否会继续存在。通过该项目，Facebook可以免费提供无限制的精选服务。Facebook依靠电信网络为其免费基础计划提供数据访问。\n据Facebook官方网站显示，在孟加拉国，Facebook与Grameenphone和Robi Axiata达成了协议，Facebook继续在数十个免费基础服务(Free Basics)运营的市场中确定孟加拉国。\n近年来，有几个国家对零评级安排犹豫不决-尽管它们经常引用不同的原因。印度在2016年初禁止免费基础服务，理由是Facebook的倡议违反了网络中立原则。\nFree Basics还于2017年和2018年结束了在缅甸和其他几个市场的计划。Facebook没有回复记者的置评请求。", "note_en": "Bangladesh Telecommunication Regulatory Commission, the local regulator, said late last week that it had moved to take this decision because free usage of social media services had spurred their misuse by some people to commit crimes. Local outlet Business Standard first  reported about the development. Bangladesh is one of the largest internet markets in Asia with more than 100 million online users.\n Technology companies such as  Facebook   and Twitter have  struck partnerships, more popularly known as zero rating deals, with telecom operators and other internet providers in several markets in the past decade to make their services free to users to accelerate growth. Typically, tech companies bankroll the cost of data consumption of users as part of these deals.\n  In Bangladesh, such zero rating deals have been popular for several years, said Ahad, chief executive of Bongo, an  on-demand streaming service, in an interview with TechCrunch.\n Grameenphone and Robi Axiata, two of the largest telecom operators in Bangladesh, enable their mobile subscribers to access a handful of services of their partners even when their phones have run out of credit. Both telecom firms have said they are in the process to comply with Dhaka’s order.\n It remains unclear whether Free Basics, a program run by Facebook in dozens of markets through which it offers unlimited access to select services at no cost, will continue its presence in Bangladesh after the nation’s order. Facebook relies on telecom networks to offer data access for its Free Basics program.\n In Bangladesh, Facebook struck deals with Grameenphone and Robi Axiata, according to its  official website, where Facebook continues to identify Bangladesh among dozens of markets where Free Basics is operational.\n Several nations in recent years have balked at zero rating arrangements — though they have often cited different reasons. India  banned Free Basics in early 2016 on the grounds that Facebook’s initiative was violating the principles of net neutrality.\n Free Basics also  ended its program in Myanmar and several other markets in 2017 and 2018. Facebook did not respond to requests for comment.", "posttime": "2020-07-22 05:58:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,监管,regulator,facebook", "title": "\n孟加拉国监管机构命令电信公司停止提供免费访问社交媒体的服务", "title_en": "\n\t\t\t\tBangladesh regulator orders telcos to stop providing free access to social media\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/bangladesh-regulator-orders-telcos-to-stop-providing-free-access-to-social-media/", "via": "", "real_tags": ["免费", "监管", "regulator", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "3aa6ea36700b9bd0181e03098602f68b.jpeg", "infoid": 1013379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook正在组建新的团队，致力于研究和解决其核心平台和Instagram部门潜在的种族偏见问题，这与该公司之前不愿探索其产品如何影响不同的少数族裔群体的做法有所不同。\n据知情人士透露，Instagram新成立的“公平和包容团队”将调查美国黑人、西班牙裔和其他少数族裔用户受到该公司算法(包括其机器学习系统)的影响，以及这些影响与白人用户的对比情况。\nInstagram的一名代表证实了这一举措，并补充说，Facebook平台也在为其同名应用程序创建一个类似的产品团队。\nInstagram产品负责人维沙尔·沙阿(Vishal Shah)表示：“种族正义运动对我们公司来说是一个真正重要的时刻。”“我们的制度和政策中的任何偏见，都有悖于为每个人提供一个表达自我的平台。”\n此举正值广告商持续抵制这家社交媒体巨头如何监管其平台，以及员工因其处理种族问题的方式而发生骚乱之际。\n对于科技公司和政府来说，如何检测和纠正算法偏差都是一个大问题，因为研究发现，从量刑指导方针到企业招聘，软件如何推动决策存在歧视。\n潜在的算法偏差问题在Facebook内部有时一直存在争议。据知情人士透露，去年，公司官员禁止员工在未经所谓的M-Team许可的情况下研究与其平台相关的不同种族影响。M-Team是一个高级高管团体，其中包括首席执行长扎克伯格(Mark Zuckerberg)和首席运营官谢丽尔·桑德伯格(Sheryl Sandberg)。\n据一些知情人士称，大约在那个时候，随着Instagram为暂停或删除账户设定新的门槛，一项内部分析发现，根据拟议的改革，活动表明自己是黑人的用户被禁用账户的可能性比其他用户高出50%。知情人士说，Instagram官员调整了参数以减少潜在影响，但禁止对这些阈值进行进一步研究。\nFacebook没有明确收集用户的种族数据。这项分析使用了一个被称为“多元文化亲和力”的种族代理-在这种情况下是非裔美国人种族亲和力集群-基于人们在平台上参与的内容。公司可以针对这些亲和力群体投放广告，但有一些限制。\nInstagram发言人斯蒂芬妮·奥特韦(Stephanie Otway)说，内部分析存在缺陷，因为该公司现有的数据没有准确反映种族。\nFacebook在一份声明中表示，该公司一直担心使用多元文化亲和力作为种族的代理是不可靠的，并要求与种族相关的研究获得高层批准，以确保这项研究是负责任的。作为研究少数族裔用户体验的新团队的一部分，Facebook正在与外部专家和民权团体讨论如何可靠和一致地研究种族问题。\n“现在还为时过早；我们计划在接下来的几个月里分享更多关于这项工作的细节，”奥特威说。\n新的Instagram团队之前没有报道，但目前还没有领导人。该公司表示，Facebook团队将被称为包容性产品团队，并将就种族问题与黑人用户和专家委员会进行磋商。该公司表示，新的团队还将咨询其他产品团队，并可能设计旨在支持该平台少数用户的功能。\nFacebook委托并于本月发布的一项民权审计称赞该公司承认风险，并在这个问题上与外部专家接触。报告没有评估该公司现有算法中的任何潜在偏见，指出审计师没有获得内部研究和模型的访问权限。\nFacebook此举的背景是，自5月25日黑人乔治·弗洛伊德(George Floyd)被杀以来，全球正在就种族问题展开辩论。弗洛伊德是一名警察，在明尼阿波利斯一名警察将他的膝盖按在弗洛伊德的脖子上近九分钟后被杀。弗洛伊德的死在世界范围内引发了针对种族主义的抗议活动，几乎涉及社会的方方面面，包括科技行业。\nFacebook过去曾因处理种族问题而受到批评。学术研究发现，Facebook的算法和广告拍卖系统将不成比例地将黑人用户排除在某些住房或招聘广告之外-即使广告商没有寻求歧视。\n美国住房和城市发展部(Department Of Housing And Urban Development)去年指责Facebook允许房地产公司根据种族、宗教和其他因素瞄准潜在客户，这是非法的歧视。这起诉讼正在审理中，Facebook表示正在与该机构合作，以解决其担忧。\n近几个月来，Facebook面临越来越大的内部和外部压力，要求其正视其对少数族裔社区的影响，以及最高层领导人缺乏种族多样性的问题。\n一个主要的引爆点出现在5月下旬，当时扎克伯格和其他高级官员拒绝删除唐纳德·特朗普(Donald Trump)总统称抗议者为暴徒的帖子，并警告说：“当抢劫开始时，枪击就开始了。”\n许多内部人士和民权领袖认为这篇帖子是对暴力的呼吁，是对Facebook政策的违反。但Facebook官员拒绝将其删除，科技新闻网站Vox报道的一份员工市政厅记录显示，扎克伯格后来告诉员工，这句话“没有被解读为义务警员支持者自己伸张正义的历史”。\nFacebook对特朗普帖子的处理罕见地引发了员工的公开反对，其中一些人在竞争对手社交媒体网站Twitter上表达了他们的担忧，另一些人选择在6月1日举行“虚拟罢工”。\n然后，在6月下旬，包括全国有色人种协进会(NAACP)和反诽谤联盟(Anti-Defamation League)在内的民权活动家开始组织一场名为#StopHateForProfit for the Month of 7月份的Facebook广告抵制活动。本月，几家主要广告商已经停止或削减了在Facebook上的支出，包括联合利华(Unilever PLC)、星巴克福特汽车(Starbucks Ford Motor Verizon Communications)和许多小型营销者。华尔街日报稍早报导称，华特迪士尼也削减了在Facebook上的支出。\nFacebook宣布承诺在五年内将黑人和少数族裔在其领导层中的代表性提高30%。该公司还计划到2023年将其黑人和西班牙裔员工基础翻一番。\nFacebook 2020年的多样性报告显示，近4%的美国员工和3.4%的公司领导人是黑人。\n亚裔占Facebook员工总数的44.4%，占领导层的25.4%，而拉美裔占领导层的6.3%和4.3%。", "note_en": "Facebook    FB  -1.50%  is creating new teams dedicated to studying and addressing potential racial bias on its core platform and Instagram unit, in a departure from the company’s prior reluctance to explore the way its products affect different minority groups.\n  The newly formed “equity and inclusion team” at Instagram will examine how Black, Hispanic and other minority users in the U.S. are affected by the company’s algorithms, including its machine-learning systems, and how those effects compare with white users, according to people familiar with the matter.\n  An Instagram representative confirmed the move, adding that the Facebook platform is also creating a similar product team for its namesake app.\n  “The racial justice movement is a moment of real significance for our company,” said Vishal Shah, Instagram’s head of product. “Any bias in our systems and policies runs counter to providing a platform for everyone to express themselves.”\n      The move comes amid a continuing advertiser boycott related to how the social-media giant polices its platforms and employee unrest over how it deals with racial issues.\n  The question of how to detect and correct algorithmic bias is a big one for technology companies and governments alike, as  studies have found discrimination in how software drives decisions involving everything from sentencing guidelines to corporate recruiting.\n  The issue of potential algorithmic bias has been contentious at times within Facebook. Last year, company officials barred employees from studying disparate racial impacts associated with its platform without permission from the so-called M-Team, a senior group of executives that includes Chief Executive Mark Zuckerberg and Chief Operating Officer Sheryl Sandberg, according to people familiar with the matter.\n  Around that time, as Instagram was creating new thresholds for suspending or deleting accounts, an internal analysis found that users whose activity suggested they were Black were 50%  more likely to have their accounts disabled than other users under the proposed changes, according to some of the people. Instagram officials tweaked the parameters to reduce the potential effects, but prohibited further research on those thresholds, the people said.\n    Facebook doesn’t explicitly gather race data from users. The analysis used a proxy for race called “multicultural affinity”—in this case the African-American ethnic affinity cluster—based on the content people engage with on the platform.  Companies can target ads at these affinity groups, with some restrictions.\n  Stephanie Otway, an Instagram spokeswoman, said the internal analysis was flawed because the company’s existing data doesn’t accurately capture race.\n  In a statement, Facebook said the company had been concerned that using multicultural affinity as a proxy for race was unreliable, and had required high-level approval for race-related research to ensure it was done responsibly. As part of the formation of the new teams studying minority users’ experiences, Facebook is talking to outside experts and civil-rights groups about how to reliably and consistently study race.\n  “It’s early; we plan to share more details on this work in the coming months,” Ms. Otway said.\n  The new Instagram team, which hasn’t been previously reported, doesn’t yet have a leader. The Facebook team is being called the Inclusivity Product Team and will consult with a council of Black users and experts on race, the company said. The new groups will also consult with other product teams and potentially design features meant to support minority users of the platform, the company says.\n  A civil-rights audit commissioned by Facebook and released this month credited the company with acknowledging the risks and engaging with external experts on the issue  The report didn’t assess any potential bias in the company’s existing algorithms, noting that the auditors weren’t given access to internal research and models.\n  Facebook’s moves come against the backdrop of a global debate about race since the May 25 killing of George Floyd, a Black man who was killed in Minneapolis after a police officer pressed his knee on Mr. Floyd’s neck for nearly nine minutes. Mr. Floyd’s  death sparked world-wide protests over racism in nearly every aspect of society, including within the technology industry.\n  Facebook has been criticized for its handling of race in the past. Academic research has found that Facebook’s algorithms and advertising auction system would disproportionately exclude Black users from seeing certain housing or employment ads—even if the advertiser hadn’t sought to discriminate.\n  The Department of Housing and Urban Development last year accused Facebook of unlawful discrimination by allowing real-estate companies to target potential customers by race, religion and other factors. That lawsuit is pending, and Facebook has said it is working with the agency to address its concerns.\n    In recent months, there has been mounting internal and external pressure on Facebook to reckon with its impact on minority communities and the lack of racial diversity among its most senior leaders.\n  One major flashpoint came in late May when Mr. Zuckerberg and other senior officials declined to take down a post in which President Donald Trump called protesters thugs and warned: “When the looting starts, the shooting starts.”\n  Many insiders and civil-rights leaders saw the post as a call for violence and a violation of Facebook’s policies. But Facebook officials declined to take it down, and Mr. Zuckerberg later told employees that the phrase had “no history of being read as a dog whistle for vigilante supporters to take justice into their own hands,” according to a transcript of an employee town hall reported by tech news site Vox.\n  Facebook’s handling of the Trump post sparked rare public opposition from employees, some of whom aired their concerns on rival social-media site  Twitter  Others opted to stage  a “virtual walkout” on June 1.\n  Then, in late June, civil-rights activists including the NAACP and the Anti-Defamation League began organizing an ad boycott of Facebook dubbed #StopHateForProfit for the month of July. Several major advertisers have halted or cut their spending on Facebook this month, including  Unilever PLC,  Starbucks   Ford Motor   Verizon Communication  and many small marketers.  Walt Disney   has also curtailed its spending on Facebook, The Wall Street Journal earlier reported.\n  Facebook has announced commitments to  boost representation of Black people and minorities among its leadership by 30% in five years. The company also plans to double its Black and Hispanic employee base by 2023.\n  Nearly 4% of Facebook’s U.S.-based employees and 3.4% of company leaders are Black, according to its  2020 diversity report.\n  Asians make up 44.4% of Facebook’s workforce and 25.4% of leadership, while Hispanics make up 6.3% and 4.3% of leadership.", "posttime": "2020-07-22 05:57:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,facebook,creating", "title": "Facebook正在创建新的团队，致力于研究和解决其核心平台和Instagram上潜在的算法种族偏见", "title_en": "Facebook is creating new teams dedicated to studying and addressing potential algorithmic racial bias on its core platform and Instagram", "transed": 1, "url": "https://www.wsj.com/articles/facebook-creates-teams-to-study-racial-bias-on-its-platforms-11595362939?mod=djemalertNEWS", "via": "", "real_tags": ["算法", "facebook", "creating"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“Capitan et Peyrony”(1903年)唐·希区柯克(Don Hitchcock)翻译和改编：从Les Eyzies出发，沿着Beune山谷(它就在Les Eyzies下游流入Vézère)，在看到右边的第一个是Gaume角，然后是Les Combarelles之后，右边还有一个小支流山谷，那里躺着Bernifal(都是有雕刻和绘画的洞穴)，山谷变得稍微宽了一些，卢布。在距离Les Eyzies 9公里处，山谷变窄了。右边矗立着美丽的中世纪城堡科马克(Comarque)雄伟的废墟，山谷的另一边是17世纪的劳塞尔(Laussel)小城堡，至今仍有人居住，1902年，M.E.Rivière在这里挖掘并向l&#39；法国蒙托班协会(l&#39；Association FrancaiseàMontauban)报告。在上游300米处，我们发现了位于博恩河右岸的劳塞尔磨坊。就在磨坊上方，有一些大型的避难所，高出谷底约12米，平均高度为12-15米，深度为5-8米，覆盖着一块像Vézère山谷沿线的经典类型的岩石悬垂。这些避难所绵延150米。磨坊上方的部分已完全清理干净，可用作谷仓。还有一个烤箱，再往前一点，就是一间用来饲养牲畜或家禽的小石屋。但在稍上游一点的地方，避难所的地板是由50厘米到100厘米厚的史前壁炉形成的。它们的顶部或多或少受到了干扰，可能有一部分被移走了，但在下面，它们是完好无损的。一些初步的探索使我们能够收集具有索鲁特里亚特色的文物。我在这里介绍的30件作品，从一个更大的数字中挑选出来，形成了一个系统的系列，其中所有类型的索鲁特里亚都得到了很好的表现。首先，这些细胞核巧妙地结合在一起，提供了长达13厘米的叶片。原子核的边缘被仔细地重新加工，以形成背衬的叶片，我们在其中发现了一些具有大量薄叶片的很好的标本，尽管不如纯马格达林的标本那么细和不那么窄。其中一些刀片相当宽，在一条边或两条边都经过了仔细的修整，它们通常是加工到一定程度的。它是Solutrean类型之一，显示了Mousterian点的一般形状，但更薄，明显不是三角形。一把由13厘米长、5厘米宽的宽刀片制成的大刮刀和一个修整得很好的小圆盘也是同样的特点。单个墓穴，有时是两个墓穴，比完整的马格达林墓穴更大，制作也不那么熟练。它们有时会在边缘上进行润色。锥子相当多，通常修整得很好。有些是细长的，相当锋利的，另一些更宽的被用来作为铰刀，在尖端的相对两侧进行修饰。有些是在一个很大的薄片的末端成型的，相当厚，给人很好的手感。刮刀很多，有些是在薄刀片的末端重新加工的，但最多的是相当大的，修整得很好，沿着刀片的背面进行了相当大的修整。有几台刮板/焚烧机和一些双端刮板。还有一些完全呈盘状的小刮刀。还请注意方型刮刀和一把15厘米长的奇怪的刮刀，它是用核的残骸制成的，这是皮埃特很久以前在他对索卢特里亚工业的挖掘中指出的一种厚刮刀(五条突然鲑鱼)。至于尖端，它们是最纯正的索鲁特兰类型的，非常精细的月桂叶，薄，修饰得很漂亮。我们已经收集了8到10厘米的尖端的破碎部分。相切的点很常见。我们有一个完整的系列，从几乎没有标明的凹槽到背部完全经过精湛技艺修饰的样品，而且凹槽都经过了仔细的重新加工。有时修改只有一面，另一面是平的，有时两边都重新做得很漂亮。不幸的是，像往常一样，这些碎片中的大多数或多或少都是破碎的。一些几乎完好无损的标本大小为5到8厘米。我们认为这个有趣的行业相当了不起，非常纯粹。我们在任何地方都没有发现任何马格达林式矿床的踪迹，也没有发现阿舍利式或穆斯特式水平的任何痕迹。至于动物群，这没有得到很好的代表，我们只发现了一匹相当大的马的骨头和一些驯鹿的遗骸。这些研究是在去年8月至9月期间进行的。Capitan L.，Peyrony D.，1903年L&#39；abri sous-Roche du Moulin de Laussel(多尔多涅)，Bulletins et Mémoire de la Sociétéd&#39；Anthropologie de Paris，V°Série，Tome 4,1903年。第558-560页。\n科恩·C，2003：“起源的女人”。“西方女性组织图像”，巴黎贝林-赫舍尔出版社，2003年，191页。\n德博恩，南卡罗来纳州，2002，Origine du m\nMussi M.等人，2010：&#34；Les«vénus du Gravettien et de l‘Éigravettien italan，témoignages de rapports sur long gues Distance au Travers de l’Europe et de l‘Eurasie&#34；IFRAO大会，IFRAO大会，2010年9月-研讨会：更新世艺术在欧洲(Pre-ACTS)。\n高尚V.，2003：“双重女神：分享权力的女性”，“内在传统”/贝尔斯登公司，2003年7月31日。\n劳·S、诺曼·D、巴思·M、穆赫莱斯·Y、布莱克曼·C，2009：Eiszeit：Kunst and Kulturl，Thorbecke，2009,396页。ISBN：978-3-7995-0833-9", "note_en": "Capitan et Peyrony (1903)    \rTranslated and adapted by Don Hitchcock\r  \r\r\rWhen, starting from Les Eyzies, one goes up the valley of the Beune (which flows into the Vézère just downstream of Les Eyzies), and after having seen on the right, first,  Font de Gaume, then  les Combarelles then leaving on the right also the small tributary valley where lies  Bernifal (all caves with carvings and paintings), the valley becomes a little wider, rugged, very picturesque, but with a wild aspect.  \r\r\r\r\rAt 9 kilometres from Les Eyzies the valley narrows. To the right stands the imposing ruins of the beautiful medieval castle of Comarque and just across the other side of the valley the little 17th Century castle of Laussel, still inhabited, and where M. E. Rivière excavated and reported to l&#39;Association francaise à Montauban in 1902.  \r\r\rAt 300 metres upstream, we find the Laussel mill, located on the right bank of the Beune. Just above the mill, there are some large shelters, raised about 12 metres above the valley bottom and having an average height of 12-15 metres and a depth of 5 to 8 metres, covered by a rock overhang like the classic type along the Vézère Valley. \rThese shelters extend for 150 metres. The part above \rthe mill has been completely cleared for use as a barn.  \r\rThere still exists an oven and a little farther on a little masonry hut\r for livestock or poultry. But a little further upstream the floor of the shelter is formed by prehistoric hearths measuring from 50 cm to 100 cm thick. Their top was more or less disturbed, perhaps a part had been removed, but underneath they are intact.  \r\r\rSome preliminary explorations have allowed us to collect artefacts with the characteristic features of the Solutrean. The 30 pieces that I present here, chosen from a much larger number, form, \ras can be seen, a systematic series where all types of the Solutrean are well represented.  \r\rThese are, first, nuclei, cleverly knapped, which have provided blades \rmeasuring up to 13 cm in length. The edges of the nuclei are carefully re-worked so as to give backed blades and of which we have found some good specimens with a large number of thin blades, although less fine and less narrow than those of the pure Magdalenian.  \r\rSome of these blades are fairly broad, which have been carefully retouched on one edge or both edges, they are usually worked to a point. It is one of the Solutrean types showing the general shape of the Mousterian point, but thinner and notably less triangular.  \r\r\rA large scraper made from a wide blade 13 cm long by 5 cm wide, and a very well retouched small disc also very well retouched were equally characteristic.  \r\rSingle burins, sometimes double, are larger and less skilfully made than those of the full Magdalenian. They are\rsometimes retouched on the edges.  \r\rAwls are quite plentiful and usually very well retouched. Some are elongated and fairly sharp, other wider ones were used as reamers retouched on opposite sides of the tip. \r\rSome were fashioned at the end of a large flake, fairly thick, giving a good hand grip. \r  \r\rScrapers are abundant, some are re-worked at the end of a thin blade, but the largest number were quite large, \rwell retouched, the retouches going a fair way along the back of the blade.\rThere were a few scraper/burins and some double ended scrapers. There were also some small scrapers completely discoidal in shape.   \r\rAlso note the square type scraper and a curious scraper 15 cm\rlong made with the remains of a nucleus and which is a type of thick scraper (pente abrupte Salmon) pointed out long ago by Piette, in his excavations of the Solutrean industry.  \r\r\rAs for tips, they are of the most pure Solutrean type, very fine laurel leaf, thin, beautifully retouched. We have collected broken parts of tips measuring 8 to 10 cm.  \r\rTanged points are frequent. We have a whole series from the notch barely indicated to specimens whose back is completely retouched with extreme skill and the notch carefully reworked. Sometimes the alterations are only on one side, the other being flat, sometimes both sides are beautifully reworked. Unfortunately most of these pieces, as usual, are more or less broken. Some almost intact specimens have a size of 5 to 8 cm.  \r\r\rWe see the industry of this interesting gisement as quite remarkable and very pure. Nowhere did we find any trace of Magdalenian deposits, nor of Acheulean or Mousterian levels.  \r\r\rAs for fauna, this was poorly represented, we found only bones from a fairly large horse and some reindeer remains. These researches were conducted during August and September last. \r                Capitan L., Peyrony D., 1903 L&#39;abri sous-roche du moulin de Laussel (Dordogne),  Bulletins et Mémoires de la Société d&#39;anthropologie de Paris, V° Série, tome 4, 1903. pp. 558-560.\n  Cohen C., 2003:  La femme des origines. Images de la femme dans la préhistoire occidentale,, Paris, Belin-Herscher, 2003, 191 pages.\n  de Beaune, S., 2002 Origine du matériel du mouture: innovation et continuité du Paléolithique au Néolithique,   Meules à Grains, Actes du Colloque International de la Ferté-Sous-Jouarre 16 - 19 Mai 2002\n  Delporte, H., 1979  L’Image de la Femme dans l’Art Prehistorique, Picard, Paris, France, 1979.\n  Duhard J., Roussot A., 1988 Le gland pénien sculpté de Laussel (Dordogne),  Bulletin de la Société préhistorique française 1988, tome 85, N. 2. pp. 41-44.\n  Jaubert, J., 2008: L&#39;art pariétal gravettien en France : éléments pour un bilan chronologique,  Paléo, 20 | 2008, 439-474.\n  Lalanne, J., Bouyssonie J., 1946: Le gisement paléolithique de Laussel. Fouilles du Dr Lalanne,  L&#39;Anthropologie, t. 50, pp 1-163, 123 fig., 1 pl.\n  Lesure, G., 2011  Interpreting Ancient Figurines: Context, Comparison, and Prehistoric Art, Cambridge University Press, 21 Feb 2011 - Social Science\n  Mussi M. et al., 2010: &#34;Les « vénus » du Gravettien et de l’Épigravettien italien, témoignages de rapports sur longues distances au travers de l’Europe et de l’Eurasie&#34;  IFRAO Congress, IFRAO Congress, September 2010 – Symposium: Pleistocene art in Europe (Pre-Acts)\n  Noble V., 2003:  The double goddess: women sharing power, Inner Traditions / Bear &amp; Co, 31/07/2003\n  Rau, S., Naumann D., Barth M., Mühleis Y., Bleckmann C., 2009:  Eiszeit: Kunst und Kultur, Thorbecke, 2009, 396p. ISBN: 978-3-7995-0833-9", "posttime": "2020-07-22 05:54:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "女神,la,de", "title": "劳塞尔的维纳斯--“女神”和“康妮”", "title_en": "The Venus of Laussel – La Femme à La Corne", "transed": 1, "url": "https://www.donsmaps.com/lacornevenus.html", "via": "", "real_tags": ["女神", "la", "de"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013377, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Skype(或任何非自由、不可互操作的通信程序)是一个特例，因为它具有网络效应。使用Skype与其他使用Skype的人交谈，是在鼓励对方使用非自由软件。经常这样做是在迫使对方使用非自由软件。因此，我在任何情况下都拒绝使用Skype(见更多信息)。诸如Netflix和Spotify的流媒体分发服务需要施加数字限制机制(DRM)的非自由客户端程序，该数字限制机制旨在阻止用户保存通过其自己的计算机流传输的数据的副本。你不应该使用你不能破解的DRM，所以除非你能破解他们的DRM，否则你不应该使用这些服务。这些和其他流媒体客户端程序的另一个不公平之处在于，它们强加了比版权法本身更严格地限制用户的不公正合同(EULA)。我不同意EULA，到此为止，我敦促您和我一起拒绝它们。这些流媒体分发服务是恶意技术，旨在使人们反社会。(如果您没有副本，则不能共享副本。)。拒绝他们是最高的道德优先事项。一位朋友曾经让我和她一起看一段视频，她打算用Netflix在她的电脑上播放这段视频。我拒绝了，说Netflix是对自由的威胁，我只能把它当作敌人。\n每个带有数字限制管理(DRM)的产品都是对您自由的攻击。因此，一个人不应该购买或容忍任何带有DRM手铐的产品，除非他本人拥有打破手铐的手段。例如，除非你有DeCSS或其他类似的免费程序，否则不要使用加密的DVD。除非你找到打破手铐的方法，否则千万不要使用蓝光光盘。不要使用亚马逊Swindle或其他践踏读者自由的电子书阅读器。不要使用强加DRM的音乐或视频流服务。(如果他们需要非免费客户端程序，则可能是用于DRM或某种类型的用户监视。)。\n我从来没有使用过Unix(甚至一分钟也没有)，直到我决定开发一个免费的替代产品(GNU系统)。我选择了这个设计，因为它是便携的，而且看起来相当干净。我从来不是Unix的粉丝；我对它也有一些批评。但作为一个模特，总体来说还可以。\n在90年代中期，我的手痛得厉害，以至于一天中的大部分时间我只能用一根手指打字。FSF每天有一部分时间为我雇打字员，还有一部分时间我忍受着痛苦。几年后，我发现这是由于我的键盘上的硬键造成的。我换了一个按键压力较轻的键盘，这个问题基本上消失了。我的问题不是腕管综合症：我通过在打字时保持手腕相当笔直来避免这种情况。有几种类型的手部损伤可能是由反复的压力引起的；不要以为你得的就是你听说过的那一种。\n我觉得奇怪的是，人们用“编码”这个词来表示编程。几十年来，我们一直使用编码这个词来描述业务编程团队中低级别员工的工作。设计人员将编写详细的流程图，然后程序员将编写代码来实现流程图。这与我们在黑客社区的所作所为有很大的不同--在我们这里，一个人设计程序，并将其代码作为一个单独的活动来编写。当我开发GNU程序时，那是编程，但绝对不是编码。因为我不认为最近流行的编码是一种进步，所以我决定不采用它。我不会使用编码这个术语，除非我谈论的是一个拥有程序员的业务编程团队。", "note_en": "Skype (or any nonfree noninteroperable communication program) is a special case because of its network effect. Using Skype to talk with someone else who is using Skype is encouraging the other to use nonfree software. Doing so regularly is pressuring the other to use nonfree software. So I refuse to use Skype under any circumstances (See  more information.)    Streaming media dis-services such as Netflix and Spotify require nonfree client programs that impose digital restrictions mechanisms ( DRM) intended to stop the user from saving a copy of the data being streamed through her own computer. You should never use DRM that you can&#39;t break, so you should not use these dis-services unless you can break their DRM.  An additional injustice of these and other streaming client programs is that they impose unjust contracts (EULAs) which restrict the user more strictly than copyright law itself. I do not agree to EULAs, period, and I urge you to join me in rejecting them.  These streaming dis-services are malicious technology designed to make people antisocial. (If you don&#39;t have a copy, you can&#39;t share copies.) Rejecting them is of the highest ethical priority.  A friend once asked me to watch a video with her that she was going to display on her computer using Netflix. I declined, saying that Netflix was such a threat to freedom that I could not treat it as anything but an enemy.\n  Every product with  Digital Restrictions Management (DRM) is an attack on your freedom.  Therefore, one should not buy or tolerate any product with DRM handcuffs unless one personally possesses the means to break the handcuffs. For instance, don&#39;t use encrypted DVDs unless you have DeCSS or another comparable free program. And never use a Bluray disk unless you find a way to break its handcuffs. Don&#39;t use the   Amazon Swindle or other e-book readers that trample readers&#39; freedoms. Don&#39;t use music or video streaming &#34;services&#34; that impose DRM. (If they require a nonfree client program, it is probably for DRM or some sort of surveillance of users.)\n    I never used Unix (not even for a minute) until after I decided to develop a free replacement for it ( the GNU system). I chose that design to follow because it was portable and seemed fairly clean. I was never a fan of Unix; I had some criticisms of it too. But it was ok overall as a model.\n  In the mid 90s I had bad hand pain, so bad that most of the day I could only type with one finger. The FSF hired typists for me part of the day, and part of the day I tolerated the pain. After a few years I found out that this was due to the hard keys of my keyboard. I switched to a keyboard with lighter key pressure and the problem mostly went away.  My problem was not carpal tunnel syndrome: I avoid that by keeping my wrists pretty straight as I type. There are several kinds of hand injuries that can be caused by repetitive stress; don&#39;t assume you have the one you heard of.\n  I find it bizarre that people use the term &#34;coding&#34; to mean programming. For decades, we used the word &#34;coding&#34; for the work of low-level staff in a business programming team. The designer would write a detailed flow chart, then the &#34;coders&#34; would write code to implement the flow chart. This is quite different from what we did and do in the hacker community -- with us, one person designs the program and writes its code as a single activity. When I developed GNU programs, that was programming, but it was definitely not coding.  Since I don&#39;t think the recent fad for &#34;coding&#34; is an improvement, I have decided not to adopt it. I don&#39;t use the term &#34;coding&#34;, except if I were talking about a business programming team which has coders.", "posttime": "2020-07-22 05:54:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "stallman", "title": "理查德·斯托尔曼的个人网站-我是如何进行计算的", "title_en": "Richard Stallman's personal site – How I do my computing", "transed": 1, "url": "https://stallman.org/stallman-computing.html", "via": "", "real_tags": ["stallman"]}]