[{"category": "", "categoryclass": "", "imagename": "9eee82cd44609f8fe1a1cb4cc57ca40c.jpg", "infoid": 1002455, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本系列面向的是新接触Kubernetes和GKE的工程师。它提供了Kubernetes的基本概述、定义和在GKE中构建Kubernetes集群的快速入门，以及构建您的第一个多层WebApp的研讨会。如果您正在寻找更深入的Kubernetes最佳实践和帮助，请联系。\n在我们开始构建您的第一个GKE集群之前，了解一些关于Kubernetes的事情是很重要的。\nKubernetes(K8S)是一个开源系统，用于自动化容器化应用程序的部署、扩展和管理。消息来源：Kubernetes.io。\n2005年，谷歌推出了博格系统。它一开始只是一个只有两三个人参与的小项目。这是一个大规模的集群管理和资源调度系统，它引入了：\n过度承诺的装箱-如何让多个系统和进程在单个节点上不受干扰地运行。\n进程级资源隔离-如果您在单个节点上调度容器，如何确保进程需求不会干扰另一个节点的进程需求。\n库伯内斯把这一切都变成了陈述性的。这意味着您可以获取您需要调度的工作负载，在YAML文件中定义它们，然后将它们提交给API，API会告诉您它是否能够调度工作。\n2014年，谷歌引入Kubernetes作为Borg系统的开源版本。2015年，谷歌与Linux基金会联合成立了云原生计算基金会(CNCF)。同年，第一次KubeCon活动举行，CNCF开始了Kubernetes的季度发布周期。\n当您使用Kubernetes这样的容器编排程序时，您可以在许多不同的时间跨多台机器调度节点或进程。这使您可以丢失一个节点或进程，而不会看到服务的正常运行时间中断。\n如果您是系统操作员，开发人员希望您给他们一天多次部署代码的机会。Kubernetes允许您在不停机的情况下实现滚动更新的智能流程和方案。\n您可以在单个节点上调度多个进程，而不是让您全天候付费在单个云节点上运行单个进程。您的云节点还可以识别何时无法调度新进程从而需要新资源，或者何时资源空闲并需要降速。库伯内斯提供了切换这种弹性的简单方法。\nKubernetes提供了可靠性。如果容器或整个节点宕机，资源或单个进程将由Kubernetes在健康节点上重新调度。\nKubernetes允许您启动新节点并自动将它们添加到集群中。如果单个服务是资源受限的，Kubernetes会检测到这一点，并带来新的实例来处理额外的负载。", "note_en": "This series is intended for engineers new to Kubernetes and GKE. It provides a basic overview of Kubernetes,  definitions  and  a quick start for building a Kubernetes cluster in GKE  and a workshop for building your first multi-tier webapp. If you are looking for more in-depth Kubernetes best practices and help,  get in touch.\n Before we get into building your first GKE cluster, it’s important to understand a few things about Kubernetes.\n  Kubernetes (K8s) is an open-source system for automating deployment, scaling, and management of containerized applications. Source:  Kubernetes.io\n  In 2005, Google introduced the Borg System. It started as a small project with two or three people working on it. It was a large scale cluster management and resource scheduling system that introduced:\n Bin packing with over-commitment - how do we get many systems and processes running on a single node without interference\n Process level resource isolation - if you schedule a container on a single node, how do you ensure the process requirements doesn’t interfere with the process requirements of another\n Kubernetes made all of this declarative. That means you can take your workloads you need to schedule, define them in a YAML file, submit them to an API and the API tells you if it was able to schedule the work.\n  In 2014, Google introduced Kubernetes as an open source version of the Borg system. In 2015, Google joined with the Linux Foundation to form the  Cloud Native Computing Foundation (CNCF). That same year the first KubeCon event was held and the CNCF started quarterly release cycles for Kubernetes.\n   When you work with a container orchestrator like Kubernetes, you can schedule nodes or processes across many machines, many different times. This allows you to lose a node or process without seeing a disruption in uptime of your service.\n  If you are a systems operator, developers want you to give them the opportunity to deploy code multiple times a day. Kubernetes allows you to implement smart processes and schemes for rolling updates without downtime.\n  Rather than having a single process running on a single cloud node that you pay for 24/7, you can schedule many processes on a single node. Your cloud nodes can also recognize when new processes cannot be scheduled and thus require new resources, or alternatively, when resources are idle and need to be spun down. Kubernetes offers easy ways to toggle this elasticity.\n  Kubernetes provides reliability. If a container or entire node goes down, resources or a single process will be rescheduled by Kubernetes on a healthy node.\n  Kubernetes allows you to bring up new nodes and automatically add them to your cluster. If a single service is resource constrained, Kubernetes will detect this and bring up new instances to handle the additional load.", "posttime": "2020-05-17 06:52:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内斯,kubernetes", "title": "库伯内斯解决了哪些问题？", "title_en": "What Problems Does Kubernetes Solve?", "transed": 1, "url": "https://www.fairwinds.com/blog/what-problems-does-kubernetes-solve", "via": "", "real_tags": ["内斯"]}, {"category": "", "categoryclass": "", "imagename": "f3bf8287c7a47b84a51a73a9a3560e72.png", "infoid": 1002454, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我的上一篇文章中，我分享了ELK栈可以为您的应用程序带来多少价值，因为它为您提供了监控功能。\n在这篇文章中，我将带您了解如何将Go应用程序与elk集成，elk有哪些不同的部分，它们是如何工作的，以及如何为它们创建基本配置。\n对于坞站，请按照此处适用于您的平台的安装说明进行操作。对于坞站组合，请按照此处的安装说明操作。\n目前，repo只有一个main.go文件，该文件以一定的间隔记录随机日志行。有时，它会传播错误日志行。\n这是三种不同的工具，由Elastic公司创建，通常一起使用，使开发人员和系统管理员能够根据应用程序或系统日志监控生产系统。\nBeats是一组经过微调的小程序，可以收集不同类型的日志数据-例如，从文件、从操作系统日志、从Windows事件日志等。\n由于ELBK听起来没有ELK那么花哨，我们仍然将该堆栈称为ELK堆栈。\n在接下来的几节中，我们将分别研究这些组件中的每一个，并相应地安装它们(amp；Install)。\n这可以是任何JSON序列化对象。例如，这可用于在应用程序中创建面向用户的搜索栏。\n您可以将这项工作外包给ElasticSearch，这将比我们两个都做得好得多，而不是手动处理糟糕的字符串。\n但是，在我们的用例中，我们将使用Elasticsearch来存储结构化日志。结构化日志是将其内容组织到JSON对象中的日志。\n使用结构化日志，您可以稍后索引这些键，并快速无缝地分析大量日志。这正是麋鹿堆栈提供的功能。\n特别是，ElasticSearch将以优化的方式存储此日志行，以便稍后进行搜索和分析。\n要安装ElasticSearch，首先在repo的根目录下创建一个docker-compose.yml文件，并添加以下初始YAML：\n在本例中，我们只调出一个名为ElasticSearch的服务。您可以选择任何您喜欢的名称，但考虑到它的作用，这个名称最具描述性。\n这意味着我们正在使用给定的版本拉取一个已经设置好的坞站映像。\n这使我们不必费心从头开始设置图像。已经有人提供了开箱即用的功能，所以我们正在重用它。\n否则，您将不得不费心地设置环境、安装依赖项、配置它们、手动安装ElasticSearch等。\n通过此行，我们表示本地目录./config/elasticsearch.yml将挂载在/usr/Share/Elasticsearch/…上。并且它将是只读的(由ro标志指示)。\n此部分指定我们将通过运行以下命令对容器进行运行状况检查：\n我们总共将进行10次重试，如果所有重试都失败，docker会将此容器标记为不健康，并通知依赖的容器。\n配置的最后一部分将容器的内部9200端口映射到实际的9200端口：\n这就是我们需要为ElasticSearch添加到docker-compose.yml的全部内容。最后，将此配置添加到./config/astic ticsearch.yml中：\n通常，ElasticSearch在节点群集中运行，其中包含必须配置的主和从节点。\n为了使本练习简单易懂，我们将使用单个ElasticSearch节点。\n如果一切正常，您应该会在一段时间后开始看到ElasticSearch日志，并且容器应该不会显示任何错误行或任何指向问题的内容：\n此时，请记住可能会弹出一些问题。\n如果一切顺利，您可以继续堆栈中的下一个组件-logstash。\n实际上，您可以直接与ElasticSearch交互，但是logstash通常用作一个有用的中介，以节省您在应用程序端的一些工作。\n与前面一样，我们将./config/logstash.conf文件挂载到logstash的默认配置位置。\n最后，Dependers_on部分指出，只有当ElasticSearch服务启动并且运行正常时，该服务才应该启动。\n输入部分指定logstash从何处接受数据。它有一个名为beats的内置插件，可以自动与我们稍后使用的文件节拍等beats应用程序集成。\n在这里，我们表示将在端口5044上接受来自BEATS应用程序的输入。\n在筛选器部分中，您可以添加任何自定义筛选器或映射(例如，以自定义格式将一个输入字段转换为另一个)。\n在这里，我们只指定源结构化日志将来自Message字段，该字段是filebeat存储实际应用程序日志的缺省键。\n这将使我们能够索引日志中的自定义应用程序密钥，而不仅仅是通过fileBeat和/或logstash插入的密钥。\n默认情况下，它可以连接到ElasticSearch(就像我们在这里所做的那样)，并通过其默认端口9200与其集成。\n如果将ElasticSearch的默认端口更改为其他端口，则还必须修改此部分。\n现在同时运行ElasticSearch和logstash，并确保它们都启动时没有任何问题：\nFileBeat是一个BEATS应用程序(还有更多)，它负责监视日志文件中的更改并将其转发到logstash。\n如果没有fileBeat，您将不得不自己管理应用程序与logstash的集成。\n它的工作方式是-您指定它应该监视的日志的路径&它将定期处理将这些日志传播到logstash。\n大部分新的部分与我们为其余服务所做的工作非常相似。\n这两项新服务都依赖于ElasticSearch的健康状况，都依赖于各自的基线扩展底座图像。\n对于我们的Go应用程序，我们已经将当前目录挂载到容器的GOPATH的子目录中。\n除此之外，我们还在容器的标准config目录中挂载了文件节拍配置。\n对于我们的Go应用程序，我们还指定容器设置完成后，我们将通过以下命令运行我们的应用程序：\n此配置指定服务将侦听/logs中所有日志文件的更改。此外，它还将通过端口5044将所有新的日志记录信息输出到logstash。\n对于来自BEATS应用程序的输入，我们还在logstash服务配置中将该端口列入白名单。\n设置的最后一块是Kibana。它是用于分析存储在Elasticsearch中的数据的前端。\n有了它，您可以通过图形、饼图、数据表等可视化大量的数据，以便通过应用程序的日志监视应用程序中发生的事情。\n它安装基线扩展坞镜像，依赖于ElasticSearch，拥有自己的运行状况检查，并将其内部端口5601映射到机器的实际端口5601。\n除此之外，您还可以选择添加您的golang应用程序对kibana的依赖关系，以确保您的整个容器堆栈只有在kibana的服务器准备好之后才会启动：\n现在，您应该能够转到http://localhost:5601/app/kibana并看到Kibana的主页加载。\n如果您没有执行最后一个可选步骤，则可能需要等待一段时间才能启动Kibana：\n在最后一节中，我们将通过Kibana搜索我们的应用程序日志来测试一切是否正确集成。\n现在，您应该已经很好地理解了ELK堆栈是如何工作的&以及它的每个不同组件。此外，您现在应该很好地掌握了如何正确配置ELK设置&将其连接到GO应用程序。\n从这里开始，您可以根据您的数据设置有用的仪表板，开始使用Kibana。", "note_en": "In my  last post, I shared how much value the ELK stack could bring for your application in terms of the monitoring capabilities it gives you.\n In this post, I will walk you through how to integrate your Go application with ELK, what are the different parts of ELK, how they work and how to create a basic configuration for them.\n     For  docker, follow the installation instructions for your platform  here. For  docker-compose, follow the installation instructions  here.\n Currently, the repo simply has a  main.go file which logs random log lines on certain intervals. Occasionally, it propagates error log lines.\n    These are three different tools, created by the  elastic company, which are typically used together to enable developers &amp; sys admins to monitor production systems based on application or system logs.\n  Beats is a collection of small programs which are fine-tuned to gather different kinds of logging data – e.g. from files, from OS system logs, from Windows event logs, etc.\n Since ELBK doesn’t sound as fancy as ELK, we still refer to the stack as the ELK stack.\n In the following sections, we will explore each of these components separately &amp; install them accordingly.\n     This can be any JSON-serialized object. This can be used, for example, to create a user-facing search bar in your application.\n Instead of doing manual &amp; lame string processing of search terms, you can outsource this to elasticsearch which will do a much better job than both of us.\n However, in our use-case, we will use Elasticsearch for storing  structured logs. A structured log is one, which organizes its contents into a JSON object.\n   Using a structured log, you can later index into these keys and analyse bulks of your logs fast &amp; seamlessly. This is exactly what the ELK stack provides.\n Elasticsearch, in particular, will store this log line in a way optimized for search &amp; analysis later.\n  To install elasticsearch, first create a  docker-compose.yml file in the root of the repo and add this initial yaml:\n   In this case, we only bring up a single service which is called  elasticsearch. You can choose any name you like, but this one is the most descriptive, given what it does.\n  This means that we are pulling an already setup docker image with the given version.\n This enables us to not bother with setting up an image from scratch. Someone has already provided that out of the box, so we are reusing it.\n Otherwise, you will have to bother with setting up the environment, installing dependencies, configuring them, installing elasticsearch manually, etc.\n  With this line, we are indicating that the local directory  ./config/elasticsearch.yml will be mounted on  /usr/share/elasticsearch/… in the container and it will be read-only (indicated by the  ro flag).\n   This part designates that we will make health checks on the container by running the command:\n  We will do 10 retries in total and if all fail, docker marks this container as  unhealthy and notifies dependent containers.\n The final part of the configuration maps the container’s internal  9200 port to our real  9200 port:\n This is all we need to add to  docker-compose.yml for elasticsearch. Finally, add this configuration in  ./config/elasticsearch.yml:\n  Typically, elasticsearch runs in a cluster of nodes with masters &amp; slaves in them which have to be configured.\n To keep things simple &amp; digestible for this exercise, we will use a single elasticsearch node.\n    If all went well, you should start seeing the elasticsearch logs after a while and the container should not show any error lines or anything pointing to an issue:\n  At this point, have in mind that there might be some issues which might pop-up.\n   If all went went, you can continue with the next component in our stack –  logstash.\n    In reality, you can interact with elasticsearch directly, but logstash is typically used as a helpful intermediary to save yourself some work on the application side.\n     As before, we are mounting the  ./config/logstash.conf file into  logstash’s default config location.\n Finally, the  depends_on section indicates that this service should only boot up when the elasticsearch service is up and healthy.\n    The  input section specifies where logstash accepts data from. It has a built-in plugin called  beats, which automatically integrates with beats applications, such as filebeat, which we’ll use later.\n Here, we indicate that we’ll accept input from beats applications on  port 5044.\n In the  filter section, you can add any custom filters or mappings (e.g. transforming one input field to another in a custom format).\n Here, we only specify that the source structured log will come from the  message field, which is the default key where  filebeat stores the actual application log.\n This will enable us to index the custom application keys in our log, not only the ones plugged in by  filebeat and/or  logstash.\n  It can by default connect to  elasticsearch (as we’ve done here) and integrate with it via its  default port 9200.\n If you change  elasticsearch’s default port to something else, you will have to modify this section as well.\n Now run both elasticsearch and logstash and make sure they both boot up without any issues:\n    Filebeat is a beats application (there are more), which is responsible for monitoring changes in log files and forwarding them to logstash.\n Without filebeat, you would have to manage your application’s integration with  logstash yourself.\n The way it works is – you specify a path to your logs which it should monitor &amp; it will handle propagating those logs on regular intervals to logstash.\n    The bulk of the new sections are pretty similar to what we already did for the rest of our services.\n Both new services depend on  elasticsearch being healthy, both depend on their respective baseline docker images.\n  For our go app, we’ve mounted the current directory in a subdirectory of the container’s  GOPATH.\n    In addition to that, we’ve mounted the  filebeat configuration in the standard config directory on the container.\n For our Go app, we’ve also specified that once the container is setup, we’ll run our application via the command:\n  This configuration specifies that the service will listen for changes to all log files in  /logs. Additionally, It will output any new logging info to logstash via  port 5044.\n We also whitelisted that port in our  logstash service config for inputs from beats applications.\n  The final piece of the setup is  Kibana. It is a front-end for analysing the data stored in Elasticsearch.\n With it, you can visualize a huge array of data via graphs, pie charts, data tables, etc, in order to monitor what’s happening in your application via its logs.\n     It installs the baseline docker image, depends on  elasticsearch, has a health check of its own and maps its internal  port 5601 to the machine’s real  port 5601.\n In addition to this, you can, optionally, add a dependency of your golang application on  kibana to make sure your entire container stack boots up only after  Kibana’s server is ready:\n  Now, you should be able to go to  http://localhost:5601/app/kibana and see Kibana’s home page load.\n If you didn’t do that last optional step, you might have to wait awhile before Kibana boots up:\n       In the final section, we will test that everything is integrated correctly by searching through our application logs via Kibana.\n              You should now have a good understanding of how the ELK stack works &amp; each of its different components. Additionally, you should now have a good grasp of how to configure your ELK setup correctly &amp; wire it to your Go application.\n From here, you can start playing with Kibana by setting up useful dashboards based on your data.", "posttime": "2020-05-17 06:51:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务,service,elasticsearch", "title": "如何将您的围棋服务与麋鹿集成", "title_en": "How to integrate your Go service with ELK", "transed": 1, "url": "https://pmihaylov.com/go-service-with-elk/", "via": "", "real_tags": ["服务", "service"]}, {"category": "", "categoryclass": "", "imagename": "cc85999531769ba61b75a7050d6d663b.png", "infoid": 1002453, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在创建Web应用程序时，经常会要求发送电子邮件：无论是用户在我们的平台注册时必须发送电子邮件，还是忘记密码，或者购买后必须发送付款确认。电子邮件需求实际上非常重要，如果我们不从一开始就构建电子邮件服务，它可能会变得混乱不堪。\n这篇文章的目的不仅是帮助你从头开始定义一个灵活的电子邮件服务，让你可以轻松地改变电子邮件交付平台，而且在实际电子邮件内容方面也是灵活的。\n这一次我将使用Django展示一个示例，但我希望其主要思想可以传播到您可能正在使用的其他框架和编程语言。\n假设我们想要在用户注册我们的Web应用程序之后向他或她发送一封电子邮件。在运行所有验证并创建用户之后，我们可以使用Django的文档在视图中发送电子邮件。我们会想出这样的东西：\n当然，您必须在您的设置中设置一些重要的配置，如EMAIL_HOST和EMAIL_PORT，正如文档所述。\n正如我前面所说的，我们可能需要在应用程序的几个部分发送电子邮件，所以如果有一个电子邮件服务或邮件发送程序来处理所有的电子邮件请求，这会很好，这样可以更容易地添加修复或更改，因为我们不必搜索整个代码。\n现在我们已经将所有的“电子邮件代码”移到了一个地方，我们可以利用这一点了！创建知道在被调用时发送什么内容的特定邮件程序怎么样？让我们添加一个将在每次新用户注册时生效的邮件程序和另一个发送订单确认的邮件程序！\n这表明，根据不同的情况合并更多的邮件程序是非常容易的。您只需让基本邮件程序处理实现，然后由子类设置内容。\n现在，我们的注册视图将看起来干净得多，因为它不必处理所有的电子邮件内容：\n假设我们必须使用SendGrid的官方python库将电子邮件后端移动到SendGrid(一个用于交易和营销电子邮件的客户通信平台)。我们将不再使用Django的Send_Email。相反，我们将不得不使用新库的语法。井…。我们很幸运！我们将所有与电子邮件管理相关的代码都放在一个位置，这样我们就可以更轻松地重构😉。\n请注意，您必须在您的设置中设置SendGrid的API密钥，还请注意，html模板将直接从SendRID的网页进行管理，并且您需要拥有模板的ID来指定应该使用哪个模板。\n太棒了！这并不是很困难，我们不需要修改我们想要发送电子邮件的每一行代码！\n当然，当我们发送电子邮件时，很可能会使用一些域数据来填写电子邮件的模板。例如，如果我们的欢迎电子邮件中包含新用户名，会更友好。SendGrid允许您在模板中定义变量，这些变量将被从我们那里接收到的实际信息替换。那么让我们添加这个数据吧！\n我在这里看到的唯一问题是这个替换方案不太灵活。很可能会发生这样的情况，我们必须根据用户无法访问的上下文传递其他数据，例如：新订单编号、重置密码链接等。可能有相当多的这些变量，将它们作为命名参数传递可能会使代码变得更混乱、更肮脏。(=。我们需要一个关键字可变长度的参数列表，通常称为**kwargs，但为了使其更具表现力，我们将其命名为**替换：\n如果您必须向邮件程序传递额外的信息，您将执行以下操作：\n我们已经创建了一个灵活的邮件程序，它将所有与电子邮件相关的代码封装在一个位置，使其更易于维护，并且还可以接收可变的上下文参数来填充电子邮件内容！一次考虑整个方法可能很困难，但逐步实现会更简单，好处也很多。我鼓励您使用此设计在电子邮件中添加附加文件的功能！\n非常感谢您阅读这篇文章，我希望它能对您的项目有所帮助。请关注我即将发布的帖子，我祝您好运，并祝您编码愉快！", "note_en": "When creating a web application, it is frequently requested to send emails: no matter if it has to be done when users sign up in our platform, or if they forget their password, or if a payment confirmation has to be sent after a purchase. The email requirement is actually very important and it can be messy if we don’t structure an email service from the beginning.\n This post aims not only to help you define a flexible email service from scratch that allows you to change the email delivery platform easily, but also to be supple in terms of the content of the actual email.\n I will be using  Django to show an example this time, but I hope the main idea can be spread to other frameworks and programming languages you might be using.\n   Suppose we want to send an email to a user after he or she signs up to our web application. We can use  Django’s documentation to send that email in the view after all validations were run and the user was created. We will come up with something like this:\n  Of course you must set up some important configurations in your settings like EMAIL_HOST and EMAIL_PORT, as the documentation says.\n   As I said before, we will probably need to send emails in several parts of our application, so it would be nice to have an email service or mailer who handles all the email requests, making it easier to add fixes or changes, because we won’t have to search through the whole code.\n     Now that we have moved all the “email code” to a single place, we can take advantage of that! How about creating specific mailers that know what content to send when they are called? Let’s add a mailer that will get into action everytime new users sign up and another one that sends orders’ confirmations!\n  This shows that it is very easy to incorporate more mailers for different situations. You just have to let the basic mailer handle the implementation, and the subclasses set the content.\n Now our register view will look much cleaner, because it doesn’t have to handle all the email stuff:\n   Suppose that we have to move our email backend to  Sendgrid (a customer communication platform for transactional and marketing email) using its official  python library. We won’t be using Django’s  send_email any longer. Instead we will have to use the new library’s syntax. Well… We are lucky! We have all the code related to email management in just one place and it will be easier for us to do this refactor 😉\n  Be aware that you must set Sendgrid’s api key in your settings and also note that html templates will be managed directly from Sendrid’s web page, and you will need to have the templates’ ids to specify which one should be used.\n Great! It was not so difficult and we don’t have to modify each line of code where we want to send an email!\n   Of course when we send emails, it is likely to use some domain data to fill in the email’s template. For example, it would be friendlier if our welcome email had the new user’s name in it. Sendgrid allows you to define variables in the template that will be replaced with the actual information that receives from us. So let’s add this data!\n  The only problem I see here is that this substitutions scheme isn’t very flexible. It is likely to happen that we have to pass other data depending on the context that cannot be accessed via the user, for instance: new order’s number, reset password link, etc. There can be quite a lot of these variables and passing them as named parameters could make the code messier and dirtier. We want a keyworded, variable-length argument list, usually called  **kwargs, but let’s name them  **substitutions to make it more expressive:\n  In case you have to pass extra information to the mailer, you will do something like this:\n   We have created a flexible mailer which encapsulates all the code related to emails in one place, making it easier to maintain, and that also receives variable context parameters to fill in the email content! Thinking of the whole approach at once could be difficult, but making it step by step is simpler and the benefits are a lot.  I encourage you to add the feature of attaching files to an email using this design!\n Thank you very much for reading this post and I hope it helps you for your projects. Follow me for upcoming posts, and I wish you good luck and happy coding!", "posttime": "2020-05-17 06:50:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "django,simple,电子邮件", "title": "使用Django构建简单的邮件服务", "title_en": "Build a Simple Mailing Service with Django", "transed": 1, "url": "https://medium.com/python-in-plain-english/simple-mailer-with-django-2a7e2ad34b34", "via": "", "real_tags": ["django", "simple", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002452, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本页是对GCC 10中大量改进中的一些改进的简要总结。您可能还想查看我们的“移植到GCC 10”页和完整的GCC文档。\n修复了C++14和C++17之间的ABI不兼容问题。在某些目标上，带有零子对象的类在编译为C++17或C++20时会被错误传递。有关详细信息，请参阅下面的C++注释。\n非标准std：：__is_nullptr_t类型特征已弃用，将在未来版本中从libstdc++中删除。标准特征STD：：IS_NULL_POINTER应该改为。\n构建GCC所需的mpfr库的最低版本已经增加到3.1.0版(发布于2011年10月03日)。\n删除了--param allow-store-data-races内部参数，而采用了新的官方选项-falow-store-data-races。虽然默认行为没有改变，并且新的选项允许在链接时间优化期间正确地维护每个编译单元的设置，但是现在将诊断默认的via--param allow-store-data-race的更改，并且必须相应地调整构建系统。\n卸载到异构系统架构中间语言(HSAIL)已被弃用，可能会在将来的版本中删除。\n新增内置函数：可以使用__HAS_BUTHIN内置预处理器运算符查询对GCC等编译器提供的内置函数的支持情况。\n新的命令行选项：-fprofile-Partial-Training现在可以用来通知编译器，培训运行未覆盖的代码路径不应针对大小进行优化。\n-fprofile-reducable控制由-fprofile-GENERATE收集的配置文件的可重现性级别。这使得重建具有相同结果的程序成为可能，例如，这对于分发包是有用的。\n-fprofile-prefix-path可以与-fprofile-Generate=profile_dir和-fprofile-use=profile_dir组合使用，用于通知GCC构建源树的基目录在哪里，以防检测和优化构建有所不同。\n-fAnalyzer启用新的静态分析过程和相关警告。此遍对代码中的路径执行耗时的探索，希望检测各种常见错误，如双重释放的错误。此选项在此版本中应视为试验性选项。特别是，对非C代码的分析不太可能起作用。\n过程间优化改进：重新实现了聚合的过程间标量替换(IPA-SRA)传递，以便在链接时工作，现在还可以删除计算和返回未使用的返回值。\n-finline-Functions现在在-O2处启用，并重新优化以获得更好的代码大小，而不是运行时性能权衡。内联启发式也大大加快了速度，避免了对-flto-O2编译时间的负面影响。\n内联启发式和函数克隆现在可以使用值范围信息来预测单个转换的有效性。\n在链接时间优化过程中，使用C++One Definition Rule来提高基于类型的别名分析的精度。\n链接时间优化改进：添加了新的二进制LTO-DUMP。该程序可以转储有关LTO字节码目标文件的各种信息。\nLTO的并行阶段可以自动检测正在运行的make&#39；的jviewer，或者可以回退到可用核心的数量。\nLTO字节码可以用ZSTD算法进行压缩。配置脚本可以自动检测zstd支持。\nMOST--参数值现在可以按转换单元粒度指定。这包括控制内联和其他过程间优化的所有参数。与早期版本不同，GCC 10将忽略控制在链接时指定的优化的参数，并以与优化标志相同的方式应用在编译时指定的参数。\n配置文件驱动的优化改进：使用-fprofile-value，插入指令的二进制文件可以跟踪间接调用的多个值(最多4个)，并提供更精确的配置文件信息。\nC、C++和Fortran编译器现在支持openacc规范的2.6版。有关详细信息，请参阅openacc wiki页面上的实现状态部分和运行时库文档。\nGCC 10在GCC 9版本的基础上增加了多个新实现的OpenMP5.0功能，如条件lastprivate子句、扫描和循环指令、ORDER(并发)和USE_DEVICE_ADDR子句支持、SIMD构造上的IF子句或对DECLARE_DEVANT VARIANT指令的部分支持，更加接近对OpenMP 5.0标准的全面支持。\nOpenMP和openacc现在支持卸载到AMD Radeon(GCN)GPU；支持的是第三代斐济(斐济)和第五代Vega 10/Vega 20(gfx900或gfx906)。\n新属性：添加了access函数和type属性，以描述函数如何访问通过指针或引用传递给它的对象，并将此类参数与表示对象大小的整数参数相关联。该属性用于检测用户定义函数的无效访问，例如由-Wstringop-overflow诊断的函数。\nsymver属性可用于将符号绑定到ELF平台上的特定版本节点。这比将GNU作为symver指令使用内联汇编更可取，因为后者与链接时优化不兼容。\n新警告：-Wstring-Compare，由-WExtra启用，警告零与调用strcmp和strncmp的结果之间的相等和不等表达式，这是由于一个参数的长度大于另一个参数所指向的数组的大小而导致的常量。\n-WzerLength-Bound由-Warray-Bound启用，警告对可能与同一对象的其他成员重叠的零长度数组元素的访问。\n对现有警告的增强：-Warray-bound检测到更多对成员数组的越界访问以及对零长度数组元素的访问。\n-Wstringop-overflow检测到成员数组的更多越界存储，包括零长度数组、动态分配的对象和可变长度数组，以及字符串内置函数读取未终止字符数组的更多实例。该警告还检测到通过调用使用新属性访问声明的用户定义函数进行的越界访问。\n除了已经支持的UCN语法(\\uNNNN或\\UNNNNNNN)之外，现在可以在输入编码(默认情况下为UTF-8)中直接指定标识符中的扩展字符：\n使用-std=c2x和-std=gnu2x支持即将发布的ISO C标准C2X修订版中的几个新功能。在编译旧语言版本时，还支持将其中一些功能作为扩展。除了列出的功能外，在C2X模式下默认启用了一些以前支持作为扩展并现在添加到C标准中的功能，并且没有使用-std=c2x-Wpedtic进行诊断。与在C++中一样，支持[[]]属性语法。现有属性可以与此语法一起使用，格式如[[gnu：：const]]。支持标准属性[[Deproated]]、[[Fall Through]]和[[Mayse_Unussed]]。\n支持十进制浮点算术时，除以前仅在包含&lt；float.h&gt；之前定义了__STDC_WANT_DEC_FP__时才定义的宏外，&lt；float.h&gt；还定义了宏DEC32_TRUE_MIN、DEC64_TRUE_MIN和DEC128_TRUE_MIN。\n在C2X模式下，函数定义中的空括号为该函数提供了一个具有原型的类型，以供后续调用；在C2X模式下，默认情况下会诊断其他旧式函数定义。\nGCC现在默认为-fno-common。因此，对各种目标的全局变量访问效率更高。在C语言中，具有多个试探性定义的全局变量现在会导致链接器错误。使用-fcommon，这样的定义在链接期间以静默方式合并。\n新警告：-Wmismatted-Tags，默认情况下禁用，警告有关结构、类和类模板的声明及其专门化，如果未提供定义，则类键与定义或第一个声明都不匹配。提供该选项是为了简化对基于Windows的编译器的可移植性。\n-wredundant-tag默认禁用，在可以消除键而不会导致语法歧义的上下文中警告冗余的class-key和enum-key。\nGCC 10中的几个目标(包括AArch64、ARM、PowerPC ELFv2、S/390和Itanium)改变了按值传递和返回某些C++类的ABI。这些更改影响具有零大小的子对象(空基类，或具有[[NO_UNIQUE_ADDRESS]]属性的数据成员)的类，而所有其他非静态数据成员具有相同的类型(在某些ABI规范中称为同构聚合，或者如果只有一个这样的成员，即单个元素)。在-std=c++17和-std=c++20模式中，基类为空的类不会被视为具有单个元素或同构聚合，因此可能会以不同方式传递(在错误的寄存器或在错误的堆栈地址)。这可能会使使用-std=c++17和-std=c++14ABI编译的代码不兼容。此问题已更正，并且在那些ABI决策中忽略了空基，因此使用-std=c++14和-std=c++17编译的函数现在再次与ABI兼容。示例：struct Empty{}；struct S：Empty{Float f；}；void f(S)；。类似地，在包含使用C++20[[NO_UNIQUE_ADDRESS]]属性的类类型为空的非静态数据成员的类中，这些成员在传递决策的ABI参数中没有被忽略。这两种ABI变化现在都被诊断为-Wpsabi。\n现在可以从任何返回符号或元组的__特征直接创建别名。以前，需要使用AliasSeq来为它们的返回设置别名。\n现在可以使用__特征(getLinkage，.)检测为结构、类或接口指定的ABI语言。添加了对core.math.toPrec内部功能的支持。这些内部函数保证在代码中的指定点四舍五入到特定的浮点精度。\n已经实现了对杂注(内联)的支持。以前，杂注可以识别，但对编译没有影响。\nASM操作数中的可选括号已弃用，并将在将来的版本中删除。\n现在，使用-M编译时，所有内容导入的文件都包含在Make Dependency列表中。\n由gcc.attribute模块提供的编译器识别的属性现在将在应用于函数原型以及应用于完整函数声明时生效。\n添加了--enable-libphobos-check配置选项，以控制是否将运行时检查编译到D运行时库中。\n添加了--with-libphobos-druntime-only配置选项，以指示是只将核心D运行时库构建到libphobos中，还是将核心库和标准库都构建到libphobos中。\n现在支持OpenMP规范5.0版的use_device_addr。请注意，除此之外，Fortran编译器还部分支持OpenMP 4.5；缺少的最大项是结构元素映射。\n使用未格式化文件的I/O的默认缓冲区大小已增加到1048576。现在，可以在运行时通过格式化文件和未格式化文件的环境变量GFORTRAN_FORMACTED_BUFFER_SIZE和GFORTRAN_UNFORMACTED_BUFFER_SIZE分别设置的缓冲区大小。\n单个文件中的实际参数列表和伪参数列表之间的不匹配现在会被拒绝，并返回错误。使用新选项-fallow-argument-mismatch将这些错误转换为警告；此选项隐含在-std=Legacy中。-Wargument-已删除不匹配。\n对BOZ文字常量的处理进行了修改，以更好地符合Fortran 2008和2018标准。在这些Fortran标准中，BOZ文字常量是无类型和无类型的实体。作为返工的一部分，Fortran标准的有文档和无文档的扩展现在会在编译期间发出错误。其中一些扩展可以与-fallow-invalid-boz一起使用，其中错误会降级为警告，并且代码会像以前的gfortran一样进行编译。\n在除-Os之外的任何优化级别，gfortran现在对参数使用内联打包，而不是调用库例程。如果源代码包含大量需要重新打包的参数，则代码大小或编译时间可能会变得过大。如果是这种情况，可以使用-fno-inline-arg-pack来禁用内联参数打包。\n传统扩展：对于格式化的输入/输出，如果省略了数据编辑描述符I、F和G之后的显式宽度，则使用默认宽度。\n格式规范末尾的格式项目不允许为空，即最后一个逗号后不允许有任何内容。使用选项-FDEC-BLACK-FORMAT-ITEM；此选项隐含在-FDEC中。\n已扩展对自动和静态属性的现有支持，以允许在等价语句中使用具有自动属性的变量。使用-FDEC-STATIC；此选项由-FDEC隐含。\n允许在数值(整数、实数或复数)或逻辑变量的赋值和数据语句中使用字符文字。使用选项-fdec-char-Conversions；此选项隐含在-fdec中。\n十进制比较，即允许使用霍尔瑞斯常量与整数、实数、复数和字符表达式进行比较。使用选项-FDEC。\n错误和警告中的字符类型名称现在除了种类之外还包括len；*用于假定长度。如果是默认类型，则省略该类型。例如：Character(12)、Character(6，4)。\nCo_Broadcast现在支持派生类型变量，包括具有可分配组件的对象。在本例中，可选参数STAT=和ERRMSG=当前被忽略。\n对模块和子模块名称的处理进行了修改，以允许标准要求的63个字符的完整长度。以前，如果模块、子模块和函数名称的总长度超过126个字符，则符号名称会被截断。因此，此更改违反了ABI，但仅适用于超过126个字符限制的情况。\nAArch64和ARM端口现在支持串联组件中的条件标志输出约束，如__GCC_ASM_FLAG_OUTPUTS__所示。在ARM上，此功能仅适用于A32和T32目标。有关更多详细信息，请参阅文档。\n与可伸缩向量扩展(Scalable Vector Extension，SVE)相关的改进有几个：现在支持SVE Acle类型和内部函数。可以使用头文件arm_sve.h访问它们。\n现在可以使用ARM_SVE_VECTOR_BITS属性创建固定长度的SVE类型。例如：\n-MSVE-VECTOR-BITS=128现在为小端目标生成特定于向量长度的代码。它继续为大端目标生成矢量长度不可知的代码，就像以前的版本对所有目标所做的那样。\n向量化器现在可以使用扩展加载和截断存储，包括聚集加载和分散存储。\n向量化器现在比较使用SVE和Advanced SIMD进行矢量化的成本，并尝试选择最好的。以前，如果可能的话，它总是使用SVE。\n如果向量循环使用Advanced SIMD而不是SVE，那么向量化器现在会考虑使用SVE来向量化剩余元素(“标量尾”或“尾部”)。\n除了这些特定点之外，向量化器使用SVE的方式还有许多一般性的改进。\nmBranch-Protection=pac-ret选项现在接受可选的参数+b-key扩展，以使用B-key而不是A-key执行返回地址签名。\n添加了选项-mOutline-Atomics，以帮助在GNU/Linux系统上部署大型系统扩展(LSE)，该系统以面向ARMv8-A的基准架构构建。当指定该选项时，将发出代码以在运行时检测LSE指令的存在，并将其用于标准原子操作。有关详细信息，请参阅文档。\n现在通过ALE内部功能支持事务性内存扩展。它可以通过+tme选项扩展来启用(例如，-march=armv8.5-a+tme)。\nArmv8.5-A中的许多功能现在通过Acle内部功能得到支持。其中包括：可通过(GCC 9.1中已有)+RNG选项扩展启用的随机数指令。\n类似地，下面的Armv8.6-A特性现在通过Acle内部功能得到支持：bfloat16扩展。当选择Armv8.6-A时，该扩展会自动启用(例如by-march=armv8.6-a)。还可以使用+bf16选项扩展为Armv8.2-A及更高版本启用它。\n矩阵乘法扩展。此扩展分为三个部分，每个部分对应于每种支持的数据类型：支持8位整数矩阵乘法指令。选择Armv8.6-A时，此扩展会自动启用。也可以使用+i8 mm选项扩展为Armv8.2-A和更高版本启用。\n支持32位浮点矩阵乘法指令。可以使用+f32 mm选项扩展来启用此扩展，这也具有启用SVE的效果。\n支持64位浮点矩阵乘法指令。可以使用+f64 mm选项扩展来启用此扩展，这同样具有启用SVE的效果。\nSVE2现在通过ACLE内部功能和(在有限范围内)自动矢量化来支持。它可以通过+sve2选项扩展来启用(例如，-march=armv8.5-a+sve2)。可以通过+sve2-sm4、+sve2-aes、+sve2-sha3和+sve2-bitperm启用其他扩展。\n添加了对以下处理器的支持(括号中的GCC标识符)：GCC标识符可以用作-mcpu或-mtune选项的参数，例如：-mcpu=corest-a77或-mtune=cortical-a65ae或用作等效目标属性和编译指示的参数。\n添加了对FDPIC ABI的支持。它使用64位函数描述符来表示指向函数的指针，并在无MMU的系统上实现代码共享。对应的目标三元组是arm-uclinuxfdpiceabi，C库是uclibc-ng。\n在使用64位整数数据类型时，对64位整数操作的处理进行了显着的修改和改进，从而提高了性能并减少了堆栈使用量。选项-mneon-for-64位现在已弃用，并将在将来的版本中删除。\n添加了对以下处理器的支持(括号中的GCC标识符)：GCC标识符可以用作-mcpu或-mtune选项的参数，例如：-mcpu=corest-a77或-mtune=cortical-m35p。\n对ALE数据处理内部功能的支持已经扩展到包括32位SIMD、饱和算术、16位乘法和其他旨在优化DSP算法的相关内部功能。\n在Thumb-1(V6m)中添加了对-mpury-code的支持：此M-profile功能不再局限于具有movt的目标。例如，-mcpu=corcorp-m0现在支持此选项。\n添加了对MVE测试版Acle内部特性的支持。可以通过包括arm_mve.h头文件并传递+mve或+mve.fp选项扩展名来启用这些内部功能(例如：-march=armv8.1-m.main+mve)。\n中断服务例程功能保存所有使用的寄存器，包括零开销环路使用的扩展寄存器和辅助寄存器。\n通过使用多条短指令提高代码大小。\n..", "note_en": "This page is a &#34;brief&#34; summary of some of the huge number of improvementsin GCC 10.You may also want to check out our Porting to GCC 10 page and the full GCC documentation.\n  An ABI incompatibility between C++14 and C++17 has been fixed. On some targets a class with a zero-sized subobject would be passed incorrectly when compiled as C++17 or C++20. See the  C++ notes below for more details.\n    The non-standard  std::__is_nullptr_t type trait is deprecated and will be removed from libstdc++ in a future release. The standard trait  std::is_null_pointer should be instead.\n  The minimum version of the  MPFR library required for building GCC has been increased to version 3.1.0 (released 2011-10-03).\n    The  --param allow-store-data-races internal parameter has been removed in favor of a new official option  -fallow-store-data-races. While default behavior is unchanged and the new option allows to correctly maintain a per compilation unit setting across link-time optimization, alteration of the default via  --param allow-store-data-races will now be diagnosed and build systems have to be adjusted accordingly.\n  Offloading to Heterogeneous System Architecture Intermediate Language (HSAIL) has been deprecated and will likely be removed in a future release.\n  New built-in functions:  The\t  __has_builtin\tbuilt-in preprocessor operator can be used to query support\tfor built-in functions provided by GCC and other compilers\tthat support it.\n  New command-line options:  -fprofile-partial-training\t can now be used to inform the compiler that code paths not covered by the\t training run should not be optimized for size.\n  -fprofile-reproducible\t controls level of reproducibility of profile gathered by\t   -fprofile-generate.\t This makes it possible to rebuild program\t with same outcome which is useful, for example, for distribution packages.\n  -fprofile-prefix-path\t can be used in combination with  -fprofile-generate=profile_dir and\t  -fprofile-use=profile_dir to inform GCC where the base\t directory of build source tree is in case it differs between instrumentation\t and optimized builds.\n  -fanalyzer\tenables a new static analysis pass and associated warnings.\tThis pass performs a time-consuming exploration of paths through\tthe code in the hope of detecting various common errors, such as\tdouble-free bugs. This option should be regarded as\t experimental in this release. In particular, analysis of non-C\tcode is unlikely to work.\n  Inter-procedural optimization improvements:  The inter-procedural scalar replacement of aggregates (IPA-SRA) pass\t was re-implemented to work at link-time and can now also remove\t computing and returning unused return values.\n  -finline-functions\t is now enabled at  -O2 and was retuned for better code\t size versus runtime performance trade-offs. Inliner heuristics was\t also significantly sped up to avoid negative impact to  -flto\t -O2 compile times.\n  Inliner heuristics and function cloning can now use value-range\t information to predict effectivity of individual transformations.\n  During link-time optimization the C++ One Definition Rule is used to\t increase precision of type based alias analysis.\n  Link-time optimization improvements:  A new binary   lto-dump has been added. The program can dump various information about a LTO bytecode object file.\n  Parallel phase of the LTO can automatically detect a running make&#39;s\tjobserver or can fall back to number of available cores.\n  The LTO bytecode can be compressed with   zstd algorithm. Configure script can automatically detect the  zstd support.\n  Most  --param values can now be specified at\t translation unit granularity. This includes all parameters controlling\t the inliner and other inter-procedural optimizations. Unlike earlier\t releases, GCC 10 will ignore parameters controlling optimizations\t specified at link-time and apply parameters specified at compile-time\t in the same manner as done for optimization flags.\n  Profile driven optimization improvements:  Using   -fprofile-values, an instrumented binary can track multiple\tvalues (up to 4) for e.g. indirect calls and provide more precise\tprofile information.\n  Version 2.6 of the  OpenACC specification is now supported in the C, C++ and Fortran compilers. See the  implementation status section on the OpenACC wiki page and the   run-time library documentation for further information.\n  GCC 10 adds a number of newly implemented  OpenMP 5.0 features on top of the GCC 9 release such as  conditional  lastprivate clause,  scan and  loop directives,  order(concurrent) and  use_device_addr clauses support,  if clause on  simd construct or partial support for the  declare variant directive, getting closer to full support of the OpenMP 5.0 standard.\n  OpenMP and OpenACC now support  offloading to AMD Radeon (GCN) GPUs; supported are the third-generation Fiji ( fiji) and the fifth-generation VEGA 10/VEGA 20 ( gfx900 or  gfx906).\n  New attributes:  The  access function and type attribute has been added to describe how a function accesses objects passed to it by pointer or reference, and to associate such arguments with integer arguments denoting the objects&#39; sizes. The attribute is used to enable the detection of invalid accesses by user-defined functions, such as those diagnosed by  -Wstringop-overflow.\n  The  symver attribute can be used to bind symbols to specific version nodes on ELF platforms. This is preferred to using inline assembly with GNU as  symver directive because the latter is not compatible with link-time optimizations.\n  New warnings:  -Wstring-compare, enabled\tby  -Wextra, warns about equality and inequality\texpressions between zero and the result of a call to either\t strcmp and  strncmp that evaluate to\ta constant as a result of the length of one argument being greater\tthan the size of the array pointed to by the other.\n  -Wzero-length-bounds,\tenabled by  -Warray-bounds, warns about accesses to\telements of zero-length arrays that might overlap other members\tof the same object.\n  Enhancements to existing warnings:  -Warray-bounds\tdetects more out-of-bounds accesses to member arrays as well as\taccesses to elements of zero-length arrays.\n        -Wstringop-overflow\tdetects more out-of-bounds stores to member arrays including\tzero-length arrays, dynamically allocated objects and variable length\tarrays, as well as more instances of reads of unterminated character\tarrays by string built-in functions. The warning also detects\tout-of-bounds accesses by calls to user-defined functions declared\twith the new attribute  access.\n  Extended characters in identifiers may now be specified directly in the input encoding (UTF-8, by default), in addition to the UCN syntax ( \\uNNNN or  \\UNNNNNNNN) that is already supported:\n  Several new features from the upcoming C2X revision of the ISO C standard are supported with  -std=c2x and  -std=gnu2x. Some of these features are also supported as extensions when compiling for older language versions. In addition to the features listed, some features previously supported as extensions and now added to the C standard are enabled by default in C2X mode and not diagnosed with  -std=c2x -Wpedantic.  The  [[]] attribute syntax is supported, as in C++. Existing attributes can be used with this syntax in forms such as  [[gnu::const]]. The standard attributes  [[deprecated]],  [[fallthrough]] and  [[maybe_unused]] are supported.\n      When decimal floating-point arithmetic is supported,  &lt;float.h&gt; defines macros  DEC32_TRUE_MIN,  DEC64_TRUE_MIN and  DEC128_TRUE_MIN, in addition to the macros that were previously only defined if  __STDC_WANT_DEC_FP__ was defined before including  &lt;float.h&gt;.\n  In C2X mode, empty parentheses in a function definition give that function a type with a prototype for subsequent calls; other old-style function definitions are diagnosed by default in C2X mode.\n  GCC now defaults to  -fno-common. As a result, global variable accesses are more efficient on various targets. In C, global variables with multiple tentative definitions now result in linker errors. With  -fcommon such definitions are silently merged during linking.\n  New warnings:  -Wmismatched-tags,\tdisabled by default, warns about declarations of structs, classes,\tand class templates and their specializations with a class-key that\tdoes not match either the definition or the first declaration if no\tdefinition is provided. The option is provided to ease portability\tto Windows-based compilers.\n  -Wredundant-tags,\tdisabled by default, warns about redundant  class-key and\t enum-key in contexts where the key can be eliminated without\tcausing an syntactic ambiguity.\n              The ABI of passing and returning certain C++ classes by value changed on several targets in GCC 10, including  AArch64,  ARM,  PowerPC ELFv2,  S/390 and  Itanium. These changes affect classes with a zero-sized subobject (an empty base class, or data member with the  [[no_unique_address]] attribute) where all other non-static data members have the same type (this is called a &#34;homogeneous aggregate&#34; in some ABI specifications, or if there is only one such member, a &#34;single element&#34;). In  -std=c++17 and  -std=c++20 modes, classes with an empty base class were not considered to have a single element or to be a homogeneous aggregate, and so could be passed differently (in the wrong registers or at the wrong stack address). This could make code compiled with  -std=c++17 and  -std=c++14 ABI incompatible. This has been corrected and the empty bases are ignored in those ABI decisions, so functions compiled with  -std=c++14 and  -std=c++17 are now ABI compatible again. Example:  struct empty {}; struct S : empty { float f; }; void f(S);. Similarly, in classes containing non-static data members with empty class types using the C++20  [[no_unique_address]] attribute, those members weren&#39;t ignored in the ABI argument passing decisions as they should be. Both of these ABI changes are now diagnosed with  -Wpsabi.\n    Aliases can now be created directly from any  __traits that return symbols or tuples. Previously, an  AliasSeq was necessary in order to alias their return.\n  It is now possible to detect the language ABI specified for a struct, class, or interface using  __traits(getLinkage, ...).  Support for  core.math.toPrec intrinsics has been added. These intrinsics guarantee the rounding to specific floating-point precisions at specified points in the code.\n  Support for  pragma(inline) has been implemented. Previously the pragma was recognized, but had no effect on the compilation.\n  Optional parentheses in  asm operands are deprecated and will be removed in a future release.\n  All content imported files are now included in the make dependency list when compiling with  -M.\n  Compiler recognized attributes provided by the  gcc.attribute module will now take effect when applied to function prototypes as well as when applied to full function declarations.\n  Added a  --enable-libphobos-checking configure option to control whether run-time checks are compiled into the D runtime library.\n  Added a  --with-libphobos-druntime-only configure option to indicate whether to build only the core D runtime library, or both the core and standard libraries into libphobos.\n  use_device_addr of version 5.0 of the  OpenMP specification is now supported. Note that otherwise OpenMP 4.5 is partially supported in the Fortran compiler; the largest missing item is structure element mapping.\n  The default buffer size for I/O using unformatted files has been increased to 1048576. The buffer size for can now be set at runtime via the environment variables  GFORTRAN_FORMATTED_BUFFER_SIZE and  GFORTRAN_UNFORMATTED_BUFFER_SIZE for formatted and unformatted files, respectively.\n  Mismatches between actual and dummy argument lists in a single file are now rejected with an error. Use the new option  -fallow-argument-mismatch to turn these errors into warnings; this option is implied with  -std=legacy.  -Wargument-mismatch has been removed.\n  The handling of a BOZ literal constant has been reworked to provide better conformance to the Fortran 2008 and 2018 standards. In these Fortran standards, a BOZ literal constant is a typeless and kindless entity. As a part of the rework, documented and undocumented extensions to the Fortran standard now emit errors during compilation. Some of these extensions are permitted with the  -fallow-invalid-boz, where the error is degraded to a warning and the code is compiled as with older gfortran.\n  At any optimization level except -Os, gfortran now uses inline packing for arguments instead of calling a library routine. If the source contains a large number of arguments that need to be repacked, code size or time for compilation can become excessive. If that is the case,  -fno-inline-arg-packing can be used to disable inline argument packing.\n  Legacy extensions:  For formatted input/output, if the explicit widths after the data-edit descriptors  I,  F and  G have been omitted, default widths are used.\n  A blank format item at the end of a format specification, i.e. nothing following the final comma, is allowed. Use the option  -fdec-blank-format-item; this option is implied with  -fdec.\n  The existing support for  AUTOMATIC and  STATIC attributes has been extended to allow variables with the  AUTOMATIC attribute to be used in  EQUIVALENCE statements. Use  -fdec-static; this option is implied by  -fdec.\n  Allow character literals in assignments and  DATA statements for numeric ( INTEGER,  REAL, or  COMPLEX) or  LOGICAL variables. Use the option  -fdec-char-conversions; this option is implied with  -fdec.\n  DEC comparisons, i.e. allow Hollerith constants to be used in comparisons with  INTEGER,  REAL,  COMPLEX and  CHARACTER expressions. Use the option  -fdec.\n  Character type names in errors and warnings now include  len in addition to  kind;  * is used for assumed length. The kind is omitted if it is the default kind. Examples:  CHARACTER(12),  CHARACTER(6,4).\n  CO_BROADCAST now supports derived type variables including objects with allocatable components. In this case, the optional arguments  STAT= and  ERRMSG= are currently ignored.\n  The handling of module and submodule names has been reworked to allow the full 63-character length mandated by the standard. Previously symbol names were truncated if the combined length of module, submodule, and function name exceeded 126 characters. This change therefore breaks the ABI, but only for cases where this 126 character limit was exceeded.\n   The AArch64 and arm ports now support condition flag output constraints in inline assembly, as indicated by the  __GCC_ASM_FLAG_OUTPUTS__. On arm this feature is only available for A32 and T32 targets. Please refer to the documentation for more details.\n  There have been several improvements related to the Scalable Vector Extension (SVE):  The SVE ACLE types and intrinsics are now supported. They can be accessed using the header file  arm_sve.h.\n  It is now possible to create fixed-length SVE types using the  arm_sve_vector_bits attribute. For example:\n    -msve-vector-bits=128 now generates vector-length-specific code for little-endian targets. It continues to generate vector-length-agnostic code for big-endian targets, just as previous releases did for all targets.\n  The vectorizer is now able to use extending loads and truncating stores, including gather loads and scatter stores.\n  The vectorizer now compares the cost of vectorizing with SVE and vectorizing with Advanced SIMD and tries to pick the best one. Previously it would always use SVE if possible.\n  If a vector loop uses Advanced SIMD rather than SVE, the vectorizer now considers using SVE to vectorize the left-over elements (the “scalar tail” or “epilog”).\n  Besides these specific points, there have been many general improvements to the way that the vectorizer uses SVE.\n  The  -mbranch-protection=pac-ret option now accepts the optional argument  +b-key extension to perform return address signing with the B-key instead of the A-key.\n  The option  -moutline-atomics has been added to aid deployment of the Large System Extensions (LSE) on GNU/Linux systems built with a baseline architecture targeting Armv8-A. When the option is specified code is emitted to detect the presence of LSE instructions at runtime and use them for standard atomic operations. For more information please refer to the documentation.\n  The Transactional Memory Extension is now supported through ACLE intrinsics. It can be enabled through the  +tme option extension (for example,  -march=armv8.5-a+tme).\n  A number of features from Armv8.5-A are now supported through ACLE intrinsics. These include:  The random number instructions that can be enabled\tthrough the (already present in GCC 9.1)  +rng option\textension.\n  Similarly, the following Armv8.6-A features are now supported through ACLE intrinsics:  The bfloat16 extension. This extension is enabled automatically when Armv8.6-A is selected (such as by  -march=armv8.6-a). It can also be enabled for Armv8.2-A and later using the  +bf16 option extension.\n  The Matrix Multiply extension. This extension is split into three parts, one for each supported data type:\t Support for 8-bit integer matrix multiply instructions.\t This extension is enabled automatically when Armv8.6-A is\t selected. It can also be enabled for Armv8.2-A and later using\t the  +i8mm option extension.\n  Support for 32-bit floating-point matrix multiply instructions.\t This extension can be enabled using the  +f32mm\t option extension, which also has the effect of enabling SVE.\n  Support for 64-bit floating-point matrix multiply instructions.\t This extension can be enabled using the  +f64mm\t option extension, which likewise has the effect of enabling SVE.\n  SVE2 is now supported through ACLE intrinsics and (to a limited extent) through autovectorization. It can be enabled through the  +sve2 option extension (for example,  -march=armv8.5-a+sve2). Additional extensions can be enabled through  +sve2-sm4,  +sve2-aes,  +sve2-sha3 and  +sve2-bitperm.\n  Support has been added for the following processors (GCC identifiers in parentheses):   The GCC identifiers can be used as arguments to the  -mcpu or  -mtune options, for example:  -mcpu=cortex-a77 or  -mtune=cortex-a65ae or as arguments to the equivalent target attributes and pragmas.\n  Support for the FDPIC ABI has been added. It uses 64-bit function descriptors to represent pointers to functions, and enables code sharing on MMU-less systems. The corresponding target triple is  arm-uclinuxfdpiceabi, and the C library is uclibc-ng.\n    The handling of 64-bit integer operations has been significantly reworked and improved leading to improved performance and reduced stack usage when using 64-bit integral data types. The option  -mneon-for-64bits is now deprecated and will be removed in a future release.\n  Support has been added for the following processors (GCC identifiers in parentheses):   The GCC identifiers can be used as arguments to the  -mcpu or  -mtune options, for example:  -mcpu=cortex-a77 or  -mtune=cortex-m35p.\n  Support has been extended for the ACLE   data-processing intrinsics to include 32-bit SIMD, saturating arithmetic, 16-bit multiplication and other related intrinsics aimed at DSP algorithm optimization.\n  Support for  -mpure-code in Thumb-1 (v6m) has been added: this M-profile feature is no longer restricted to targets with  MOVT. For example,  -mcpu=cortex-m0 now supports this option.\n      Support for the   MVE beta ACLE intrinsics has been added. These intrinsics can be enabled by including the arm_mve.h header file and passing the  +mve  or  +mve.fp  option extensions (for example:  -march=armv8.1-m.main+mve ).\n    The interrupt service routine functions save all used registers, including extension registers and auxiliary registers used by Zero Overhead Loops.\n  Improve code size by using multiple short instructi\n......", "posttime": "2020-05-17 06:49:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "淘汰,gcc", "title": "GCC被淘汰出局", "title_en": "GCC 10.1 Is Out", "transed": 1, "url": "https://gcc.gnu.org/gcc-10/changes.html", "via": "", "real_tags": ["淘汰", "gcc"]}, {"category": "", "categoryclass": "", "imagename": "a437c9bce657fa83fcd2aaae9537d6b3.jpeg", "infoid": 1002451, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他说，美国国家航空航天局的一位推进物理学家已经解决了假设曲速驱动中的一个悖论。\nAlcubierre驱动器使用巨大的能量来制造一种折叠式的口袋尺寸。\n美国宇航局真的在研究。。。曲速驱动器？一份内部可行性报告表明，该机构可能是，或者至少在折叠空间旅行的想法是NASA星际太空飞行菜单的一部分。\n在这份报告中，高级推进物理学家哈罗德·“桑尼”·怀特解释了理论物理学家(和同行)米格尔·阿尔库比尔的观点。然后，他描述了阿尔库比埃尔工作中的一个“悖论”，以及如何解决这个悖论来建立一个工作模型。\n口语化的术语“曲速驱动”来自科幻小说，它指的是符合爱因斯坦广义相对论的亚光速(低于光速)旅行的概念，但仍然将速度推到理论上可能的绝对最大值。在“星际迷航”的经典中，渐进式的设计越来越接近一个假设的障碍--这就是真正的科学家们不断向绝对零度开凿的方式。在现实生活中，光速是障碍。\nAlcubierre驱动器的工作原理就像是经典派对把戏的物理版本。宇宙飞船坐在时空中，而科学将面料从它前面拉到它后面，就像一块桌布从铺开的盘子下面拉出来一样。怀特解释说：\n“Alcubierre所描述的操作概念是，航天器将使用一些传统的推进系统离开起始点(例如地球)，并行驶一段距离d，然后使飞船相对于出发点停下来。”磁场会打开，飞船就会迅速飞向它的恒星目的地，不会在局部突破光速，但会在任意短的时间内完成整个距离。“。\nAlcubierre的理论可以追溯到1994年，从那时起，物理学家们就一直把它作为进一步讨论的起点。通过创造一种袖珍世界，宇宙飞船似乎可以在物理之外运行，物理定律可以被回避-至少理论是这样的。\n这其中有什么矛盾之处呢？怀特是这样描述的：“能量密度启动时，+x轴方向的选择在数学上是任意的，那么航天器怎么‘知道’该往哪个方向走呢？”科幻小说通过发明一个“稳定的虫洞”解决了这个悖论，但是怀特不能驾驶一架天神(Deus Ex Machina)去半人马座阿尔法星(Alpha Centauri)。\n相反，他提出了一个略有不同的范例：“在这个修改后的操作概念中，航天器离开地球，建立一个初始的亚光速，然后启动磁场。当激活时，磁场的助推作用于初始速度，作为标量乘数，从而产生更高的表观速度，“怀特解释说。\n这艘船不会停下来，然后启动曲速驱动器，而是使用摇摆启动作为方向提示。\n我们认为曲速是实现遥远星际旅行的唯一途径。怀特将重点放在了作品中的一个数学悖论上，但这并不是唯一的障碍。\n他认为，曲速的试验场可能离我们家更近。他解释说：“曲速推进器的想法可能会在国内‘潜意识’有一些卓有成效的应用，让它在成为真正的星际推进器系统之前成熟起来。”\n如果科学家能够制造出阿尔库比尔推进器所需的所谓“负质量”，即使是一个很小的例子也可以部署在地球的大气层中。\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。您可以在piano.io上找到有关此内容和类似内容的更多信息", "note_en": "A NASA propulsion physicist has, he says,  resolved a paradox in a hypothetical warp drive.\n The Alcubierre drive  uses a huge amount of energy to make a sort of fold-like pocket dimension.\n   Is NASA really working on . . . a  warp drive? An  internal feasibility report suggests the agency might be, or at least that the idea of traveling through folded space is part of the NASA interstellar spaceflight menu.\n  In the report, advanced propulsion physicist Harold “Sonny” White explains the ideas of theoretical physicist (and peer) Miguel Alcubierre. He then describes a “paradox” in Alcubierre’s work, and how that paradox might be resolved to make a working model.\n   The colloquial term “warp drive” has come from science fiction, and it refers to the idea of sub-luminal (less than the speed of light) travel that conforms to Einstein’s theory of general relativity, but still pushes speed to absolute maximum that’s theoretically possible. In the  Star Trek canon, progressive designs come closer and closer to a hypothetical barrier—the way real scientists continue to hew closer and closer to absolute zero. In real life, light speed is the barrier.\n The Alcubierre drive works like a physics version of a classic party trick. The spaceship sits in spacetime while science pulls the fabric from in front of it to behind it, like a tablecloth pulled out from under a full spread of dishes. White explains:\n “The concept of operations as described by Alcubierre is that the spacecraft would depart the point of origin (e.g. earth) using some conventional propulsion system and travel a distance  d, then bring the craft to a stop relative to the departure point. The field would be turned on and the craft would zip off to its stellar destination, never locally breaking the speed of light, but covering the distance in an arbitrarily short period of time just the same.”\n Alcubierre’s theory dates to 1994, and physicists have used it as a jumping-off point for further discussion ever since. By creating a kind of pocket world where a spaceship can operate seemingly outside of physics, the  laws of physics can be sidestepped—or so the theory goes.\n What’s the paradox? White describes it this way: “When the energy density is initiated, the choice in direction of the +x-axis is mathematically arbitrary, so how does the spacecraft ‘know’ which direction to go?” Sci-fi has solved this paradox by inventing a “stable wormhole,” but White can’t fly a  deus ex machina to Alpha Centauri.\n  Instead, he suggests a slightly different paradigm: “In this modified concept of operations, the spacecraft departs earth and establishes an initial sub-luminal velocity, then initiates the field. When active, the field’s boost acts on the initial velocity as a scalar multiplier resulting in a much higher apparent speed,” White explains.\n Instead of coming to a stop and then engaging the warp drive, the ship would use a rolling start as a directional cue.\n   We think of warp speed as, well, the only way faraway interstellar travel will ever be feasible. And White has focused on one mathematical paradox within the work, but that’s not the only such obstacle.\n He suggests the proving ground for warp speed could be, well, closer to home. “[T]he idea of a warp drive may have some fruitful domestic applications ‘subliminally,’ allowing it to be matured before it is engaged as a true interstellar drive system,” he explains.\n If scientists can make the so-called “negative mass” required for an Alcubierre drive, even a tiny example could be deployed within Earth’s atmosphere.\n   This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2020-05-17 06:35:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,曲速,working", "title": "美国国家航空航天局真的在研究曲速驱动器吗？", "title_en": "Is NASA Actually Working On a Warp Drive?", "transed": 1, "url": "https://www.popularmechanics.com/science/a32449240/nasa-warp-drive-space-time/", "via": "", "real_tags": ["nasa", "曲速", "working"]}, {"category": "", "categoryclass": "", "imagename": "37516a74d518642ad21ef3f8455decb3.png", "infoid": 1002450, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前，Apache Kafka®使用Apache zooKeeper™来存储其元数据。分区位置和主题配置等数据存储在Kafka本身之外，存储在单独的ZooKeeper集群中。在2019年，我们概述了一个计划，打破这种依赖，将元数据管理引入卡夫卡本身。\n那么动物园管理员有什么问题呢？实际上，问题不在于动物园管理员本身，而在于外部元数据管理的概念。\n有两个系统会导致大量的重复。毕竟，Kafka是一个复制的分布式日志，上面有一个发布/订阅API。ZooKeeper是一个复制的分布式日志，上面有一个文件系统API。每种设备都有自己的网络通信、安全、监控和配置方式。对于操作员来说，拥有两个系统大致会使结果的总复杂性增加一倍。这会导致不必要的陡峭学习曲线，并增加某些错误配置导致安全漏洞的风险。\n在外部存储元数据效率不高。我们至少运行三个额外的Java进程，有时甚至更多。事实上，我们经常看到Kafka集群的ZooKeeper节点和Kafka节点一样多！另外，ZooKeeper中的数据还需要反映在Kafka控制器上，这会导致双重缓存。\n更糟糕的是，外部存储元数据限制了Kafka的可伸缩性。当Kafka集群正在启动，或者正在选择新的控制器时，控制器必须从ZooKeeper加载集群的完整状态。随着元数据数量的增加，此加载过程的长度也会增加。这限制了Kafka可以存储的分区数量。\n最后，在外部存储元数据可能会使控制器的内存内状态与外部状态不同步。控制器的活度视图(在集群中)也可能与动物园管理员的视图不同。\nKIP-500概述了在卡夫卡中处理元数据的更好方法。您可以将其视为“Kafka on Kafka”，因为它涉及到将Kafka的元数据存储在Kafka本身中，而不是存储在ZooKeeper等外部系统中。\n在后KIP-500时代，元数据将存储在Kafka内部的分区中，而不是ZooKeeper中。控制器将是此分区的领导者。将不会有外部元数据系统需要配置和管理，只有卡夫卡本身。\n我们将元数据视为日志。需要最新更新的代理只能读取日志的尾部。这类似于需要最新日志条目的使用者只需要读取日志的最末尾，而不是整个日志。代理还将能够在进程重新启动时持久保存它们的元数据缓存。\nKafka集群选举控制器节点来管理分区领导者和群集元数据。我们拥有的分区和元数据越多，控制器可伸缩性就变得越重要。我们希望最大限度地减少需要与主题或分区的数量成线性比例的时间的操作数量。\n一种这样的操作是控制器故障转移。目前，当Kafka选举新的控制器时，它需要加载完整的集群状态才能继续。随着群集元数据数量的增长，此过程需要的时间越来越长。\n相比之下，在KIP-500之后的世界中，将有几个备用控制器，它们随时准备在活动控制器离开时接手。这些备用控制器只是元数据分区的RAFT Quorum中的其他节点。这种设计确保了在选举新的控制器时，我们不需要经历漫长的加载过程。\nKIP-500将加快主题的创建和删除。目前，在创建或删除主题时，控制器必须从ZooKeeper重新加载集群中所有主题名称的完整列表。这是必要的，因为当集群中的主题集发生更改时，ZooKeeper会通知我们，但它并不确切地告诉我们添加或删除了哪些主题。相反，在后KIP-500世界中创建或删除主题只涉及在元数据分区中创建一个新条目，这是一个O(1)操作。\n元数据可伸缩性是未来扩展Kafka的关键。我们预计单个Kafka集群最终能够支持100万个或更多分区。\n作为Kafka版本的一部分提供的几个管理工具仍然允许与动物园管理员直接通信。更糟糕的是，仍然有一两个操作不能完成，除非通过这种直接的动物园管理员通信。\n我们一直在努力缩小这些差距。很快，对于以前需要动物园管理员直接访问的每个操作，都将有一个公共的Kafka API。在Kafka的下一个主要版本中，我们还将禁用或删除不必要的--zooKeeper标志。\n在后KIP-500时代，Kafka控制器将其元数据存储在Kafka分区中，而不是ZooKeeper中。但是，因为控制器依赖于此分区，所以分区本身不能依赖于控制器来进行领导者选举之类的事情。相反，管理此分区的节点必须实现自我管理的RAFT仲裁。\nKIP-595：元数据仲裁的RAFT协议概述了我们将如何使RAFT协议适应Kafka，从而使其真正感觉像是系统的本机部分。这将涉及将RAFT论文中描述的基于推送的模式更改为基于Pull的模式，这与传统的卡夫卡复制是一致的。其他节点将连接到这些节点，而不是将数据推送到其他节点。同样，我们将使用与卡夫卡一致的术语，而不是原始的筏纸--“纪元”而不是“术语”，以此类推。\n最初的实施将侧重于支持元数据分区。它不支持将常规分区转换为RAFT所需的全部操作。然而，这是我们未来可能会回到的一个话题。\n当然，这个项目最令人兴奋的部分是能够在没有动物园管理员的情况下在“KIP-500模式”下运行。当Kafka在这种模式下运行时，我们将使用RAFT Quorum来存储我们的元数据，而不是ZooKeeper。\n最初，KIP-500模式将是试验性的。大多数用户将继续使用“传统模式”，在这种模式下，ZooKeeper仍在使用。这在一定程度上是因为KIP-500模式一开始并不支持所有可能的功能。另一个原因是，我们希望在将KIP-500模式设为默认模式之前获得信心。最后，我们需要时间来完善从传统模式到KIP-500模式的升级过程。\n启用KIP-500模式的大部分工作将在控制器中完成。我们必须将与ZooKeeper交互的控制器部分与实现更多通用逻辑(如副本集管理)的部分分开。\n我们需要定义和实现更多的控制器API来取代目前涉及ZooKeeper的通信机制。这方面的一个例子是新的AlterIsr API。此API允许副本在不使用ZooKeeper的情况下通知控制器同步副本集中的更改。\nKIP-500引入了桥式版本的概念，它可以与KIP-500之前和之后的卡夫卡版本共存。桥接版本很重要，因为它们可以实现对后动物园饲养员世界的零停机升级。使用旧版本卡夫卡的用户只需升级到桥式版本即可。然后，他们可以对缺少ZooKeeper的版本执行第二次升级。顾名思义，桥梁释放就像一座通往新世界的桥梁。\n那么这是怎么运作的呢？假设一个集群处于部分升级状态，桥接版本上有几个代理，KIP-500发布后有几个代理。管制员将始终是KIP-500之后的经纪人。在这个集群中，代理不能依赖直接修改ZooKeeper来宣布他们正在进行的更改(例如配置更改或ACL更改)。KIP-500之后的经纪人不会收到这样的通知，因为他们没有监听动物园饲养员。只有控制器仍在与ZooKeeper交互，将其更改镜像到ZooKeeper。\n因此，在桥发布中，除控制器之外的所有代理都必须将ZooKeeper视为只读(除了一些非常有限的例外)。\n对于像IncrementalAlterConfigs这样的RPC，我们只需要确保调用由活动控制器处理。对于新客户来说，这很容易-他们只需将呼叫直接发送到那里即可。对于较老的客户端，我们需要在将RPC发送到活动控制器的代理上运行的重定向系统，无论它们最初位于哪个代理上。\n对于涉及代理和控制器之间复杂交互的RPC，我们将需要创建新的控制器API。一个例子是KIP-497，它指定了一个新的AlterIsrRequest API，允许代理请求更改分区同步副本(ISR)。\n将即席ZooKeeper API替换为文档齐全且受支持的RPC与删除客户端ZooKeeper访问具有许多相同的好处。维护跨版本兼容性将变得更容易。对于AlterIsrRequest的特殊情况，减少向ZooKeeper写入普通操作所需的次数也会带来好处。\nKafka是最活跃的Apache项目之一。在过去的几年里，看到它的架构的演变是令人惊叹的。正如KIP-500这样的项目所表明的那样，这种演变还没有完成。我最喜欢KIP-500的地方是它简化了整个架构-无论是管理员还是开发人员。它将允许我们使用事件日志的强大抽象来处理元数据。它将最终证明…。卡夫卡不需要看门人。\n如果您对Apache Kafka中动物园管理员的移除有任何疑问，请在5月21日上午10：00加入我们在Confluent Community Slake#普通频道的现场问答。PDT。要了解其他正在进行的使Kafka具有弹性可伸缩性的工作，请查看这篇关于“变形工程”的博客文章。\nColin McCabe目前在Confluent工作，以提高Apache Kafka的性能、可伸缩性和通用性。在此之前，他研究过ApacheHadoop®分布式文件系统(™)。科林在卡内基梅隆大学(Carnegie Mellon University)学习计算机科学和计算机工程，他喜欢自制啤酒和潜水。", "note_en": "Currently, Apache Kafka ® uses Apache ZooKeeper™ to store its metadata. Data such as the location of partitions and the configuration of topics are stored outside of Kafka itself, in a separate ZooKeeper cluster. In 2019, we outlined a  plan to break this dependency and bring metadata management into Kafka itself.\n So what is the problem with ZooKeeper? Actually, the problem is not with ZooKeeper itself but with the concept of external metadata management.\n Having two systems leads to a lot of duplication. Kafka, after all, is a replicated distributed log with a pub/sub API on top. ZooKeeper is a replicated distributed log with a filesystem API on top. Each has its own way of doing network communication, security, monitoring, and configuration. Having two systems roughly doubles the total complexity of the result for the operator. This leads to an unnecessarily steep learning curve and increases the risk of some misconfiguration causing a security breach.\n Storing metadata externally is not very efficient. We run at least three additional Java processes, and sometimes more. In fact, we often see Kafka clusters with just as many ZooKeeper nodes as Kafka nodes! Additionally, the data in ZooKeeper also needs to be reflected on the Kafka controller, which leads to double caching.\n Worse still, storing metadata externally limits Kafka’s scalability. When a Kafka cluster is starting up, or a new controller is being elected, the controller must load the full state of the cluster from ZooKeeper. As the amount of metadata grows, so does the length of this loading process. This limits the number of partitions that Kafka can store.\n Finally, storing metadata externally opens up the possibility of the controller’s in-memory state becoming de-synchronized from the external state. The controller’s view of liveness—which is in the cluster—can also diverge from ZooKeeper’s view.\n   KIP-500 outlines a better way of handling metadata in Kafka. You can think of this as “Kafka on Kafka,” since it involves storing Kafka’s metadata in Kafka itself rather than in an external system such as ZooKeeper.\n In the post-KIP-500 world, metadata will be stored in a partition inside Kafka rather than in ZooKeeper. The controller will be the leader of this partition. There will be no external metadata system to configure and manage, just Kafka itself.\n We will treat metadata as a log. Brokers that need the latest updates can read only the tail of the log. This is similar to how consumers that need the latest log entries only need to read the very end of the log, not the entire log. Brokers will also be able to persist their metadata caches across process restarts.\n  A Kafka cluster elects a controller node to manage partition leaders and cluster metadata. The more partitions and metadata we have, the more important controller scalability becomes. We would like to minimize the number of operations that require a time linearly proportional to the number of topics or partitions.\n One such operation is controller failover. Currently, when Kafka elects a new controller, it needs to load the full cluster state before proceeding. As the amount of cluster metadata grows, this process takes longer and longer.\n In contrast, in the post-KIP-500 world, there will be several standby controllers that are ready to take over whenever the active controller goes away. These standby controllers are simply the other nodes in the Raft quorum of the metadata partition. This design ensures that we never need to go through a lengthy loading process when a new controller is elected.\n KIP-500 will speed up topic creation and deletion. Currently, when a topic is created or deleted, the controller must reload the full list of all topic names in the cluster from ZooKeeper. This is necessary because while ZooKeeper notifies us when the set of topics in the cluster has changed, it doesn’t tell us exactly which topics were added or removed. In contrast, creating or deleting a topic in the post-KIP-500 world will simply involve creating a new entry in the metadata partition, which is an O(1) operation.\n Metadata scalability is a key part of scaling Kafka in the future. We expect that a single Kafka cluster will eventually be able to support a million partitions or more.\n    Several administrative tools shipped as part of the Kafka release still allow direct communication with ZooKeeper. Worse still, there are still one or two operations that can’t be done except through this direct ZooKeeper communication.\n We have been working hard to close these gaps. Soon, there will be a public Kafka API for every operation that previously required direct ZooKeeper access. We will also disable or remove the unnecessary  --zookeeper flags in the next major release of Kafka.\n  In the post-KIP-500 world, the Kafka controller will store its metadata in a Kafka partition rather than in ZooKeeper. However, because the controller depends on this partition, the partition itself cannot depend on the controller for things like leader election. Instead, the nodes that manage this partition must implement a self-managed Raft quorum.\n KIP-595: A Raft Protocol for the Metadata Quorum outlines how we will adapt the Raft protocol to Kafka so that it really feels like a native part of the system. This will involve changing the push-based model described in the  Raft paper to a pull-based model, which is consistent with traditional Kafka replication. Rather than pushing out data to other nodes, the other nodes will connect to them. Similarly, we will use terminology consistent with Kafka rather than the original Raft paper—”epochs” instead of “terms,” and so forth.\n The initial implementation will be focused on supporting the metadata partition. It will not support the full range of operations that would be needed to convert regular partitions over to Raft. However, this is a topic we may return to in the future.\n  The most exciting part of this project, of course, is the ability to run without ZooKeeper, in “KIP-500 mode.” When Kafka is run in this mode, we will use a Raft quorum to store our metadata rather than ZooKeeper.\n Initially, KIP-500 mode will be experimental. Most users will continue to use “legacy mode,” in which ZooKeeper is still in use. Partly, this is because KIP-500 mode will not support all possible features at first. Another reason is because we want to gain confidence in KIP-500 mode before making it the default. Finally, we will need time to perfect the upgrade process from legacy mode to KIP-500 mode.\n Much of the work to enable KIP-500 mode will be in the controller. We must separate out the part of the controller that interacts with ZooKeeper from the part that implements more general-purpose logic such as replica set management.\n We need to define and implement more controller APIs to replace the communication mechanisms that currently involve ZooKeeper. One example of this is the new  AlterIsr API. This API allows a replica to notify the controller of a change in the in-sync replica set without using ZooKeeper.\n  KIP-500 introduced the concept of a  bridge release that can coexist with both pre- and post-KIP-500 versions of Kafka. Bridge releases are important because they enable zero-downtime upgrades to the post-ZooKeeper world. Users on an older version of Kafka simply upgrade to a bridge release. Then, they can perform a second upgrade to a release that lacks ZooKeeper. As its name suggests, the bridge release acts as a bridge into the new world.\n So how does this work? Consider a cluster that is in a partially upgraded state, with several brokers on the bridge release and several brokers on a post-KIP-500 release. The controller will always be a post-KIP-500 broker. In this cluster, brokers cannot rely on directly modifying ZooKeeper to announce changes they are making (such as a configuration change or an ACL change). The post-KIP-500 brokers would not receive such notifications because they are not listening on ZooKeeper. Only the controller is still interacting with ZooKeeper, by mirroring its changes to ZooKeeper.\n Therefore, in the bridge release, all the brokers except the controller must treat ZooKeeper as read only (with some very limited exceptions).\n For RPCs like  IncrementalAlterConfigs, we simply need to ensure that the call is processed by the active controller. This is easy for new clients—they can simply send the calls there directly. For older clients, we need a redirection system that will run on the brokers that send the RPCs to the active controller, no matter which broker they initially end up on.\n For RPCs that involve a complex interaction between the broker and the controller, we will need to create new controller APIs. One example is  KIP-497, which specifies a new  AlterIsrRequest API that allows brokers to request changes to partition in-sync replicas (ISRs).\n Replacing ad hoc ZooKeeper APIs with well-documented and supported RPCs has many of the same benefits as removing client-side ZooKeeper access did. Maintaining cross-version compatibility will be easier. For the special case of  AlterIsrRequest, there will also be benefits to reducing the number of writes to ZooKeeper that a common operation requires.\n  Kafka is one of the most active Apache projects. It has been amazing to see the evolution in its architecture over the last few years. That evolution is not done yet, as projects like KIP-500 show. What I like most about KIP-500 is that it’s a simplification to the overall architecture—for administrators and developers alike. It will let us use the powerful abstraction of the event log for metadata handling. And it will finally prove that…Kafka needs no keeper.\n If you have any questions about ZooKeeper removal in Apache Kafka,  join our live Q&amp;A in the Confluent Community Slack #general channel on May 21st at 10:00 a.m. PDT. To learn about other work that is happening to make Kafka  elastically scalable, check out this  blog post on Project Metamorphosis.\n Colin McCabe currently works for Confluent to improve the performance, scalability, and general awesomeness of Apache Kafka. Previously, he worked on the Apache™ Hadoop® Distributed Filesystem. Colin studied computer science and computer engineering at Carnegie Mellon University, and he enjoys homebrewing and scuba diving.", "posttime": "2020-05-17 06:33:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "消除,removing,zookeeper", "title": "卡夫卡消除对ZooKeeper的依赖", "title_en": "Kafka Removing Zookeeper Dependency", "transed": 1, "url": "https://www.confluent.io/blog/removing-zookeeper-dependency-in-kafka/", "via": "", "real_tags": ["消除", "removing", "zookeeper"]}, {"category": "", "categoryclass": "", "imagename": "9dc781bbef801118e96c6cbf0331c472.jpeg", "infoid": 1002448, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Chrome Galvanizer是一款生成Chrome企业策略的工具，可帮助用户加强浏览器安全性。目前，主要支持生成策略，以限制来自明确标记为敏感的站点(例如，您的电子邮件、银行、加密权限和其他站点)的扩展访问。这允许您阻止扩展访问这些特定的站点，即使您在第一次安装它们时已经授予了访问它们的权限。\n这可以防止通过反向更新劫持的扩展，以及由于其代码中的安全漏洞而被利用的扩展。\n前一类攻击的一个很好的例子就是mega Chrome扩展被黑客攻击。基本上，发布巨型扩展的账号很可能是被网络钓鱼的，结果是一个倒退的扩展更新被推给了所有扩展用户(数百万)。根据Mega&#39；的声明，该扩展名记录并窃取了“亚马逊(Amazon.com)、live.com、github.com、google.com(用于网店登录)、myetherwallet.com、mymonero.com和idex.market等网站的凭证。”\n使用Chrome Galvanizer，您可以通过指定一个或所有扩展无法再访问的特定站点来保护自己免受此类攻击。对于超级用户来说，如果用户创建了一个限制超级扩展访问亚马逊(Amazon.com)、live.com、github.com、google.com、myetherwallet.com、mymonero.com和idex.market的策略，那么他们就可以免受攻击。\n您甚至可以配置只允许扩展访问特定站点白名单的策略，而不仅仅是将敏感站点列入黑名单。如果您想要将扩展用于一组站点，而不是Web的其余部分，则此功能非常有用。当然，您也可以分层这些政策以获得更好的效果。", "note_en": "Chrome Galvanizer is a tool to generate Chrome enterprise policies to help users harden their browser security. Currently, the main support is for generating policies to restrict extension access from sites explicitly marked as sensitive (e.g. your email, bank, cryptocurency, and other sites). This allows you to prevent extensions from accessing these specific sites even if you&#39;ve already granted them permission to do so when first installing them.\n  This protects from hijacked extensions with backdoored updates and against extensions that have been  exploited due to a security vulnerability in their code.\n One good example of the former type of attack this protects against is the case of the  MEGA Chrome extension getting hacked. Basically, the account which publishes the MEGA extension likely was phished, the result being that a backdoored extension update was pushed out to all extension users (millions). Per MEGA&#39;s statement the extension keylogged and stole  “credentials for sites including amazon.com, live.com, github.com, google.com (for webstore login), myetherwallet.com, mymonero.com, [and] idex.market.”\n Using Chrome Galvanizer, you can protect yourself from attacks like this by specifying specific sites that one or all of your extensions can no longer access. For the MEGA case, if users had created a policy restricting access for the MEGA extension to access  amazon.com,  live.com,  github.com,  google.com,  myetherwallet.com,  mymonero.com, and  idex.market then they&#39;d be protected from the attack.\n You can even configure policies that only allow an extension to access a specific whitelist of sites instead of just blacklisting sensitive ones. This is useful if you have an extension you want to use for a set of sites but not the rest of the web. Of course, you can also layer these policies to get even better results.", "posttime": "2020-05-17 06:17:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,漏洞,后门,harden,扩展", "title": "ChromeGalvanizer-针对扩展后门和漏洞强化您的浏览器", "title_en": "ChromeGalvanizer – Harden your browser against extension backdoors and exploits", "transed": 1, "url": "https://github.com/mandatoryprogrammer/ChromeGalvanizer", "via": "", "real_tags": ["chrome", "漏洞", "后门", "harden", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "2cae259de697d9f6b726d4240e81162b.jpg", "infoid": 1002447, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“毁灭永恒”成为最新一款使用内核级驱动程序来帮助检测多人比赛中的作弊者的游戏。\n这款游戏的新驱动程序和反作弊工具来自德努沃的母公司爱迪德(Irdeto)，该公司曾以近乎无与伦比的盗版保护而闻名，现在则以某种程度上有效但经常被破解的盗版保护而闻名。但新的Denuvo反作弊保护与该公司的Denuvo防篡改技术是完全不同的，后者使用代码混淆来阻止破解程序(这项技术在推出后不久就已经在Doom Etal上讨论过了)。\nIrdeto在一篇宣布推出该工具的博客文章中表示，在为期两年的提前访问计划中，新的Denuvo和反作弊工具在无数个小时和数百万次游戏会话之后，面向末日永恒的玩家推出。但与Valorant的类似Vanguard系统不同的是，Denuvo Anti-cheat Driver没有烦人的托盘图标或闪屏，让玩家可以在自己的系统上监控它的使用情况。\n为了消除任何潜在的恐惧，爱迪德写道，Denuvo Anti-cheat只在游戏活跃时运行，贝塞斯达的补丁笔记中也同样写着，内核模式驱动程序的使用在游戏启动时开始，当游戏出于任何原因停止时停止。这与Valorant的先锋系统有很大的不同，后者需要从系统启动时加载驱动程序，以便监控系统状态的完整性。\n德努沃反作弊产品负责人Michail Greshishchev通过电子邮件告诉Ars，在多人比赛之外不会进行监控或数据收集。德努沃不会试图维护系统的完整性。它不会阻止作弊、游戏mod或开发工具。德努沃反作弊只检测作弊。&#34；\nGreshishchev补充说，该公司的驱动程序已经获得了知名内核安全研究人员的认证，完成了定期的白盒和黑盒审计，并接受了独立作弊开发者的渗透测试。他说，爱迪生还设立了一个漏洞赏金计划，以发现他们可能遗漏的任何漏洞。\nGreshishchev告诉ARS，由于Denuvo Anti-cheat的设计，司机比其他可能更容易接触互联网的司机更安全。与现有的反作弊软件不同，Denuvo Anti-cheat不会从网络上流式传输外壳代码。这意味着，如果受到攻击，攻击者不能向游戏者的机器发送任意恶意软件。\n他继续说，这些游戏机已经有了一大堆不合格的(安全方面的)管理服务，而且有活跃的互联网连接。来自鼠标和键盘供应商的驱动程序、照明和超频服务等。如果攻击者真的想危害游戏者的安全，他们会通过它们，而不是通过世界上最强大的防篡改软件。\nGreshishchev告诉ARS，如果在野外发现了驱动程序漏洞，可撤销的证书和自动过期的网络密钥可以用作扼杀开关来切断它们。没有安全专家可以声称他们的解决方案是万无一失的，但我们的渗透测试、认证和安全审计远远高于任何合理的标准，他说。\n内核模式驱动程序在多人游戏反作弊工具中的使用实际上相当普遍，这有助于确保可以检测并阻止试图修改游戏代码的低权限用户模式工具。虽然作弊者仍然可以通过使用代码签名漏洞来安装他们自己的内核级作弊工具来绕过这个问题，但是这个过程更加困难。\n仅在游戏运行时加载内核模式防作弊驱动程序，就像Denuvo所做的那样，从安全角度来看，也与从启动时运行rootkit风格的防作弊驱动程序有很大不同。正如独立安全研究员萨利姆·拉希德(Saleem Rashid)在谈到Valorant的先锋安全驱动程序时告诉Ars的那样，后者为在用户不知情的情况下运行的系统级漏洞带来了更大的风险，创造了一个几乎没有好处的大攻击面。\n尽管如此，末日永恒社区的一些成员对Denuvo反作弊工具的推出方式，或者他们认为它给他们的系统带来的安全风险感到不满。\nReddit用户extant_dinero在Doom subreddit上的热门帖子中写道，任何软件，特别是反作弊软件，都不应该拥有对你的系统的内核级访问权限，如果是，我们应该在购买之前得到通知。如果我知道它会被添加，我就不会买它了。仅仅因为其他软件可以做到这一点并不意味着它就是正确的。\n但是Greshishchev告诉Ars，这样的恐惧是不必要的。他说，Denuvo Anti-cheat被设计成与NVIDIA的图形驱动程序或Steam的客户服务没有什么不同。与过去的反作弊不同，现在没有文件系统挂钩，不需要从操作系统开始，没有烦人的托盘图标或闪屏。\n害怕未知是人类的本性，我们再多的技术主张也无法解决这一问题。信任是随着时间的推移而建立起来的，我们认为，当德努沃反作弊公司在您最喜欢的游戏中禁赛一名玩家时，我们将获得您的信任。", "note_en": "Doom Eternal has become the latest game to use a kernel-level driver to aid in detecting cheaters in multiplayer matches.\n The game&#39;s new driver and anti-cheat tool come courtesy of  Denuvo parent Irdeto, a company  once known for nearly unbeatable piracy protection and now known for  somewhat effective but often cracked piracy protection. But the new Denuvo Anti-Cheat protection is completely separate from the company&#39;s Denuvo Anti-Tamper technology, which uses code obfuscation to hinder crackers (and which was  already mooted for  Doom Eternal anyway shortly after launch).\n The new Denuvo Anti-Cheat tool rolls out to  Doom Eternal players after &#34;countless hours and millions of gameplay sessions&#34; during a two-year early access program, Irdeto  said in a blog post announcing its introduction. But unlike   Valorant&#39;s similar Vanguard system, the Denuvo Anti-Cheat driver &#34;doesn’t have annoying tray icons or splash screens&#34; letting players monitor its use on their system.\n   To assuage any potential fears, Irdeto writes that Denuvo Anti-Cheat only runs when the game is active, and  Bethesda&#39;s patch notes similarly say that &#34;use of the kernel-mode driver starts when the game launches and stops when the game stops for any reason.&#34; That&#39;s a major difference from  Valorant&#39;s Vanguard system, which  requires the driver to be loaded from system startup in order to &#34;monitor system state for integrity.&#34;\n &#34;No monitoring or data collection happens outside of multiplayer matches,&#34; Denuvo Anti-Cheat Product Owner Michail Greshishchev told Ars via email. &#34;Denuvo does not attempt to maintain the integrity of the system. It does not block cheats, game mods, or developer tools. Denuvo Anti-Cheat only detects cheats.&#34;\n  Greshishchev added that the company&#39;s driver has received &#34;certification from renown[ed] kernel security researchers, completed regular whitebox and blackbox audits, and was penetration-tested by independent cheat developers.&#34; He said Irdeto is also setting up a bug bounty program to discover any flaws they might have missed.\n And because of Denuvo Anti-Cheat&#39;s design, Greshishchev says the driver is more secure than others that might have more exposure to the Internet. &#34;Unlike existing anti-cheats, Denuvo Anti-Cheat does not stream shell code from the Web,&#34; Greshishchev told Ars. &#34;This means that, if compromised, attackers can&#39;t send down arbitrary malware to gamers&#39; machines.\n &#34;These same gaming machines already have a sea of subpar (security-wise) administrative services with active Internet connections,&#34; he continued. &#34;Drivers from mouse and keyboard vendors, lighting and overclocking services, etc. If attackers really wanted to compromise gamers&#39; machines, they would go through them—not through the world&#39;s strongest anti-tamper software.&#34;\n If a driver exploit is discovered in the wild, Greshishchev told Ars that revocable certificates and self-expiring network keys can be used as &#34;kill switches&#34; to cut them off. &#34;No security expert can claim their solution is infallible, but our penetration testing, certification, and security auditing is significantly higher than any reasonable standard,&#34; he said.\n  The use of kernel-mode drivers is actually pretty common in multiplayer game anti-cheat tools, helping to ensure that lower-privileged &#34;user-mode&#34; tools that try to modify the game code can be detected and stopped. While cheaters can still get around this by using code-signing exploits to install their own kernel-level cheat tools, the process is more difficult.\n Loading a kernel-mode anti-cheat driver only when a game is running, as Denuvo does, is also very different from running a  rootkit-style anti-cheat driver from startup, from a security perspective. The latter introduces much more exposure for system-level exploits that can run without the user&#39;s knowledge, creating &#34;a large attack surface for little benefit,&#34; as independent security researcher Saleem Rashid told Ars  regarding  Valorant&#39;s Vanguard security driver.\n Still, some members of the  Doom Eternal community are not happy about the way the Denuvo Anti-Cheat tool was rolled out, or with the security risks they feel it creates on their systems.\n &#34;No piece of software, especially an anti-cheat, should have kernel-level access to your system and if it is we should have been informed before purchasing it,&#34; Reddit user extant_dinero wrote in  a popular thread on the  Doom subreddit urging people to delete the game. &#34;I would not have purchased it had I known it would be added. Just because other pieces of software do it doesn&#39;t make it right.&#34;\n But Greshishchev tells Ars such fear is misplaced. Denuvo Anti-Cheat is &#34;designed to be no different than Nvidia&#39;s graphic drivers or Steam&#39;s Client Service,&#34; he said. &#34;Unlike anti-cheats of the past, there are no filesystem hooks, no requirement to start with the OS, no annoying tray icons or splash screens.&#34;\n &#34;It&#39;s human nature to have a fear of the unknown, and no amount of technical claims by us could address that. Trust is built up over time, and we think that when Denuvo Anti-Cheat bans a player in your favorite game, we will gain your trust.&#34;", "posttime": "2020-05-17 05:47:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,denuvo,eternal,游戏", "title": "“末日永恒”使用的是Denuvo的新内核级反作弊驱动程序", "title_en": "'Doom Eternal' Is Using Denuvo's New Kernel-Level Anti-Cheat Driver", "transed": 1, "url": "https://arstechnica.com/gaming/2020/05/doom-eternal-anti-cheat-kernel-driver-is-safer-than-others-denuvo-says/", "via": "", "real_tags": ["程序", "denuvo", "eternal", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "c80b55af49940fdf19f90fe1ff1fab6b.png", "infoid": 1002446, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2011年，一名荷兰自行车记者开玩笑地提议在他的祖国修建一座人工山，引发了一系列提案和可行性研究，成为荷兰最大的创新平台。这是一个项目的Die Berg Komt er-，一个人和一座(人造)山的故事。", "note_en": "In 2011, a Dutch cycling journalist’s tongue-in-cheek proposal for an artificial mountain in his homeland sparked a flurry of proposals and feasibility studies, growing to be the biggest innovation platform in the Netherlands.   This is the story of Die Berg Komt Er – of a project, a man and a (man-made) mountain.", "posttime": "2020-05-17 05:47:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人造,man,die", "title": "荷兰人和他的(人造)山", "title_en": "A Dutchman and his (man-made) mountain", "transed": 1, "url": "https://cyclingtips.com/2020/05/a-dutchman-and-his-man-made-mountain/", "via": "", "real_tags": ["人造", "man", "die"]}, {"category": "", "categoryclass": "", "imagename": "c0977b838010da333dd2fa6d4cc99b5d.jpeg", "infoid": 1002445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一家著名的娱乐律师事务所遭到黑客攻击后，一个身份不明的网络帮派泄露了Lady Gaga的数据，他们说这是关于总统的数据。\n网络帮派在这个黑暗的网站上删除了链接到第一部分数据的链接，其中包含最无害的信息。“商业内幕”(Business Insider)查阅的文件样本包括提到总统的法律电子邮件、文件和合同，从一位学徒(An；Apprentice)在竞选期间寻求拍摄新节目的电子邮件，到就合法使用他的采访录像进行谈判的合同。\n勒索软件团伙过去曾从企业窃取数据，并将其泄露到一个黑暗的网站上，一名跟踪过去数据转储的勒索软件专家表示，很难知道他们窃取了什么数据，但他表示，这起犯罪行为加剧了一波高度公开的勒索软件勒索攻击浪潮。\n专门从事勒索软件的网络安全公司Emsisoft的威胁研究员布雷特·卡洛(Brett Clow)表示，他们可能没有什么重要的东西，可能只是试图施加额外的压力。勒索软件集团的行为正变得更加阴险和极端。他们现在将数据武器化，并用它来对付被盗的公司。\n本周，这个网络帮派侵入了顶级娱乐业律师事务所Grubman Shire Meiselas&amp；Sacks，并泄露了Lady Gaga的数千份合同和其他文件。\n黑客威胁称，如果该律师事务所不支付4200万美元的赎金，他们将公布更多名人的信息，包括布鲁斯·斯普林斯汀、克里斯蒂娜·阿奎莱拉等数十人。\n根据名人新闻网站第六页发布的一份声明，这家名为Grubman Shire Meiselas&amp；Sacks的律师事务所表示，唐纳德·特朗普总统不是客户，他们没有支付赎金，他们正在与联邦调查局合作破案。\n这个名为Revil的团伙对加密数据的企业执行勒索软件攻击，要求赎金才能释放数据，否则如果他们不这样做，就会泄露数据。\n该组织说，当他们发布他们声称是关于特朗普的数据时，律师先生说唐纳德从来就不是他们的客户。他说我们是在虚张声势。哦，好吧。第一部分，带着最无害的信息，我们将在这里张贴。&#34；\n我们读到了当局的立场。宣布这是一起恐怖主义行为。你的立场是你的选择。这对我们的工作没有任何影响。它只是可以完全删除我们仍然观察到的某些帧。但现在不是这个问题。\n律师先生说唐纳德从来不是他们的客户。他说我们是在虚张声势。哦，好吧。第一部分，带着最无害的信息，我们会在这里发布。我们很高兴明星们支持(据媒体报道)律师先生。\n但是，当狗仔队开始在媒体上发表文章时，他们的支持力度会有多大？他们什么时候开始拒绝参加某些活动、音乐会？撤回已签的合同，取消他们的演出？\n律师先生，你会受到责备的。你要自掏腰包赔偿所有损失。此外，正如正确指出的那样，您的声誉已经受损。但每个人都认为这是我们能做的最坏的事了。哦，不。远不是最坏的。我们和您都知道这一点。我们将通过两种方式获得资金：\n1.你和我找到共同语言(你甚至可以通过其他国家的中介机构，因为当地的白痴自己背后有什么东西阻止你这样做)。然后，每个人都会看到你重视客户的声誉和安全。我们承诺，在我们达成协议后，这些数据不会在其他地方发布、使用或出售。这是我们的诺言。我们的声誉是众所周知的，我们非常珍视。我们总是信守诺言。然后我们拿到钱，你归还你的声誉、数据，加强你的安全并继续生活。\n2.你继续听聪明人的话，他们当然不会赔偿你的损失。我们的行动如下：\n1)我们每周(按姓氏)在信息交易所拍卖客户数据，这些数据要么被明星自己买走，要么被各种媒体到时敲诈，或者干脆是好心人。我们不在乎。最重要的是我们会拿到钱。相应地，在这之后，人们将开始出现问题。而且，哦，是的，他们会知道这件事应该归咎于谁。他们用自己的安全和声誉来换取金钱。\n2)您的数据将保持不可用状态。让我们实话实说吧。即使是这些白痴也不能破译椭圆密码。尽管你可以继续相信他们。你每天都会蒙受损失，他们正在积极调查这起犯罪，尽管他们自己也知道自己会掉进墙里。此外，他们寻找的是表演者，而不是组织者。这是他们的事，我们看爆米花玩得很开心。\n这就是我想说的全部。如你所见，这两种选择都对我们有利。我们会得到它的。唯一的问题是，你将遭受多大的损失(原文如此)。还有那些信任你的人。", "note_en": "The unidentified cybergang who  dumped Lady Gaga&#39;s data after the hack of a prominent entertainment law firm have dumped what they say is data about the president.\n The cybergang dropped links to &#34;the first part of data, with the most harmless information,&#34; on the dark web site. A sampling of the files reviewed by Business Insider were were legal emails, documents, and contracts mentioning the president, from an &#34;Apprentice&#34; costar&#39;s emails seeking to land a new show during his campaign, to the contracts negotiating legal use of his videotaped interviews.\n The  ransomware gang has stolen data from businesses and leaked it on a dark web site in the past, and a ransomware expert who has followed past data dumps said it&#39;s difficult to know what they data they have stolen – but said the crime adds to  a wave of highly public ransomware extortion attacks.\n &#34;They may have nothing significant and could simply be attempting to apply to additional pressure,&#34; said Brett Callow, a threat researcher at Emsisoft, a cybersecurity company that specializes in ransomware. &#34;The actions of ransomware groups are becoming ever more insidious and ever more extreme. They now weaponize data and use it against the companies from which it was stolen.&#34;\n   This week, the cybergang  hacked into top entertainment law firm Grubman Shire Meiselas &amp; Sacks, and leaked thousands of contracts and other documents from Lady Gaga.\n The hackers have threatened to release more data about celebrities, including Bruce Springsteen, Christina Aguilera, and dozens of others if the law firm doesn&#39;t pay $42 million in ransom.\n The law firm,  Grubman Shire Meiselas &amp; Sacks, said that President Donald Trump is not a client, that they are not paying the ransom, and that they are working with the FBI to solve the crime, according to a statement published by the celebrity news site  Page Six.\n The gang, REvil, executes ransomware attacks on businesses in which it encrypts their data, demands a ransom to release it, otherwise leaking it if they fail to do so.\n   As they dumped data they claimed are about Trump, the group said, &#34;Mr. Lawyer says that Donald has never been their client. And he says that we are bluffing. Oh well. The first part, with the most harmless information, we will post here.&#34;\n   We read the position of the authorities. Declare this an act of terrorism. Your position is your choice. This will not affect our work in any way. It&#39;s just that it can completely erase certain frames that we still observed. But now is not about that.\n   Mr. Lawyer says that Donald has never been their client. And he says that we are bluffing. Oh well. The first part, with the most harmless information, we will post here. We are very pleased that the stars support (according to media reports) Mr. Lawyer\n But how strong will their support be when the paparazzi start publishing in the media? When will they begin to refuse to participate in certain events, concerts? Withdraw signed contracts, cancel their performances?\n Mr. lawyer, you will be to blame. And you will pay all losses from your pocket. Moreover, as correctly noted, your reputation has already suffered. But everyone believes that this is the worst we could do. Oh no. Far from the worst. Both we and you are aware of this. We will receive money in 2 ways:\n 1. You and I find a common language (you can even [sic] through intermediaries in other countries, since local idiots who themselves have something behind their backs prevent you from doing this). Then, everyone will see that you value the reputation and safety of customers. We give our word that after our agreements the data will not be published, used somewhere, or sold. This is our word. Our reputation is very well known and dear to us. We always keep our words. Then we get money, you return your reputation, data, strengthen your security and continue to live.\n   2. You continue to listen to smart guys who, of course, will not compensate you for losses. Our actions will be as follows:\n 1) We will auction customer data every week (by last name) on the information exchange.   This data will be bought either by the stars themselves, or various media and blackmail them then, or simply kind people with good intentions. We do not care. The main thing is we will get the money.  Accordingly, after this, people will begin to have problems. And, oh yes, they will know who to blame for this. And who put their safety and reputation in exchange for money.\n 2) Your data will remain unavailable. Let&#39;s be honest. Even these idiots cannot decipher elliptic cryptography. Although you can continue to believe them. You incur losses daily, and they are actively investigating this crime, although they themselves understand that they will fall into the wall. Moreover, they are looking for performers, not organizers. This is their business, we have fun watching with popcorn.\n That&#39;s all I wanted to say. As you can see, both options benefit us. And we will get it. The only question is how strong losses [sic] you will incur. And those who trusted you.", "posttime": "2020-05-17 05:46:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,黑客,gaga,gang,数据", "title": "Lady Gaga黑客背后的勒索软件团伙转储特朗普文件", "title_en": "Ransomware gang behind Lady Gaga hack dumps Trump docs", "transed": 1, "url": "https://www.businessinsider.com/ransomware-trump-lady-gaga-hack-leaks-files-presidents-2020-5", "via": "", "real_tags": ["软件", "黑客", "gaga", "gang", "数据"]}, {"category": "", "categoryclass": "", "imagename": "e486419aaf96bc43c6c9d1e6cb057466.png", "infoid": 1002444, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "XP.css是98.css的扩展。一个CSS库，用于构建看起来像旧UI的界面。请参阅GitHub上的XP.css请参阅GitHub上的98.css。\n这个库依赖于语义HTML的使用。要制作按钮，您需要使用&lt；按钮&gt；。输入元素需要标签。图标按钮依赖于咏叹调标签。本页面将指导您完成该过程，但可访问性是此项目的主要目标。\n您可以覆盖元素的许多样式，同时保持该库提供的外观。你的纽扣需要更多的衬垫吗？勇敢点儿。需要为您的输入标签添加一些颜色吗？请便。\n这个库不包含任何JavaScript，它只是用一些CSS设置HTML的样式。这意味着98.css与您选择的前端框架兼容。\n下面是将XP.css与React一起使用的示例，以及与普通JavaScript一起使用的示例。使用XP.css的最快方式是从unpkg导入它。\n命令按钮，也称为按钮，是当用户单击它时使应用程序执行某些操作的控件。\n标准按钮宽75px，高23px，外框和内框凸起。默认情况下，它们会获得12px的水平填充。\n单击按钮时，凸起的边框会下陷。以下按钮被模拟为处于按下(激活)状态。\n禁用的按钮保持相同的凸起边框，但其标签中的外观为褪色。\n按钮焦点与虚线边框通信，在按钮内容内设置4px。下面的示例被模拟为聚焦。\n复选框由一个凹陷面板表示，选中时，该面板会在指示选项的标签旁边填充一个复选图标。\n注意：必须使用&lt；label&gt；元素并将for属性指向输入的id，在复选框后包含相应的标签。这确保复选框易于与辅助技术一起使用，同时确保所有人都有良好的用户体验(使用Tab键导航，能够单击整个标签以选中该框)。\n对输入进行分组时，使用field-row类将每个输入包装在容器中。这确保了输入之间的间距一致。\n选项按钮(也称为单选按钮)表示有限的互斥选项集中的单个选项。也就是说，用户只能选择一组选项。\n可以通过在每个输入上指定共享名称属性来对选项按钮进行分组。如前所述：对输入进行分组时，使用field-row类将每个输入包装在一个容器中，以确保输入之间的间距一致。\n花生酱应该是光滑的我理解为什么人们喜欢脆脆的花生酱脆脆的花生酱是好的\n创建选项卡时，您将使用章节class=&#34；tab&#34；，然后使用标签class=&#34；tab.title&#34；和每个选项卡的内容(使用文章class=&#34；tab-content&#34；元素)。\n要将选项卡标记为可见，可以在HTML中静态地或使用JavaScript动态地将.active类添加到.tab-title和.tab-content中。当您要更改它时，不要忘记将其从其他选项卡中删除！\nTab 1 Tab 2 Tab 3选项卡内容创建选项卡时，您将使用章节class=&#34；tab&#34；，然后对于选项卡标题，使用标签class=&#34；tab.title&#34；，并使用文章class=&#34；tab-content&#34；元素显示每个选项卡的内容。要将选项卡标记为可见，可以在HTML中静态地或使用JavaScript动态地将.active类添加到.tab-title和.tab-content中。当您要更改它时，不要忘记将其从其他选项卡中删除！更多.。此选项卡包含GroupBox今日情绪克莱尔·萨菲兹·布拉德·里昂克里斯·摩洛哥·卡拉·拉利音乐选项卡3 Lorem Ipsum Dolor Site。\n分组框是可用于组织一组控件的特殊控件。分组框是具有围绕一组控件的可选标签的矩形框架。\n组框可以通过用fieldset标签包装您的元素来使用。它包含一个凹陷的外边框和一个凸起的内边框，类似于控件周围的雕刻框。\n您可以通过在字段集中放置图例元素为您的组提供标签。\n文本框(也称为编辑控件)是一个矩形控件，用户可以在其中输入或编辑文本。它可以定义为支持单行或多行文本。\n可以通过在输入元素上指定文本类型来呈现文本框。与复选框和单选按钮一样，您应该提供相应的标签，并正确设置属性，并使用field-row类将两者包装在容器中。\n此外，您可以使用字段行堆叠类将标签放置在输入的上方，而不是它的旁边。\n滑块(有时称为跟踪条控件)由定义调整范围或范围的条和显示控件当前值的指示器组成。\n您可以使用Has-box-Indicator类将默认指示器替换为框指示器，而且可以使用is-Vertical用div包装滑块以垂直显示输入。\n注意：要更改垂直滑块的长度、输入宽度和div高度。\n下拉列表框仅允许从列表中选择单个项目。在关闭状态下，控件显示控件的当前值。用户打开列表以更改该值。\n5-难以置信！4-太棒了！3-相当不错2-不太棒1-不幸。\n默认情况下，将选择第一个选项。您可以通过为其中一个选项元素指定选定属性来更改此设置。\n5-难以置信！4-太棒了！3-相当不错2-不太棒1-不幸\n在窗口的顶部边缘，在其边框内，是标题栏(也称为标题栏或标题栏)，它延伸到整个窗口的宽度。标题栏标识窗口的内容。\n在标题栏中包括与主窗口的公共命令相关联的命令按钮。这些按钮充当特定窗口命令的快捷方式。\n您可以使用三个类来构建一个完整的标题栏：Title-Bar、Title-Bar-Text和Title-Bar-Controls。\n我们使用aria-label来呈现Close按钮，让辅助技术知道该按钮的用意。您还可以使用&#34；最小化&#34；和&#34；最大化&#34；，如下所示：\n为了给我们的标题栏一个家，我们使用了Window类。这提供了一个凸起的外边界和内边界，以及一些填充。我们可以通过在容器样式中指定宽度来自由调整窗口的大小。\n要绘制窗口的内容，我们使用标题栏下面的Window-Body类。\n微软❮R❯视窗DOS❮C❯版权所有微软公司1990年至2001年。C：\\WINDOWS\\system32&gt；您可以使用窗口和前标记轻松构建命令行。\n命令提示符Microsoft&amp；#10094；R&amp；#10095；Windows DOS&amp；#10094；C&amp；#10095；版权所有Microsoft Corp.1990-2001年。C：&amp；#92；Windows&amp；#92；system32&&gt;您可以使用窗口和前标记轻松构建命令行\n一个有标签和组的窗口，音乐狗食物设置你的聆听偏好今天的心情尼基·米娜·贝尔塔斯迷人的莫妮克·恩塔斯塔(Nicki Minaj Bell Towers)，魅力十足的莫妮克·恩(Monique En)。V重置警报.。尝试这样做可以获得一些关注，您可以使用文章标签为每个选项卡创建内容。好的，取消。\n树视图控件是一种特殊的列表框控件，它根据对象的逻辑层次关系将一组对象显示为缩进轮廓。\n要呈现树视图，请将ul元素与树视图类一起使用。这个列表的子元素(li元素)可以包含您想要的任何内容。\n要使其成为树，我们可以嵌套更多的ul元素(这些元素上不需要类)。这将为他们提供一个漂亮的虚线边框和缩进，以说明树的结构。\n目录什么是Web开发？CSS选择器特定属性JavaScript不惜一切代价避免，除非不惜一切代价避免所有费用HTML特别感谢。\n请参考GitHub问题页面，查看我的CSS中的错误或报告新的错误。还要检查98.css的问题。\ncss一开始是98.css(由Jordan Scales发起的一个有趣的项目)的一个分支，现在正试图将GUI作为样板，以便能够轻松地将其作为主题。如果你想做一个主题或者做贡献，我很想看看你能把这个带到哪里去！\n希望你喜欢这个项目！🍸考虑在GitHub上主演/关注，在推特上关注我。", "note_en": "XP.css is an extention of 98.css. A CSS library for building interfaces that look like old UIs.  See  XP.css on GitHub  See  98.css on GitHub\n    This library relies on the usage of  semantic HTML. To make a button, you&#39;ll need to use a  &lt;button&gt;. Input elements require labels. Icon buttons rely on  aria-label. This page will guide you through that process, but accessibility is a primary goal of this project.\n  You can override many of the styles of your elements while maintaining the appearance provided by this library. Need more padding on your buttons? Go for it. Need to add some color to your input labels? Be our guest.\n  This library does not contain any JavaScript, it merely styles your HTML with some CSS. This means 98.css is compatible with your frontend framework of choice.\n  Here is an example of  XP.css used with React, and  an example with vanilla JavaScript. The fastest way to use XP.css is to import it from unpkg.\n              A  command button, also referred to as a push button, is a control that causes the application to perform some action when the user clicks it.\n  A standard button measures 75px wide and 23px tall, with a raised outer and inner border. They are given 12px of horizontal padding by default.\n    When buttons are clicked, the raised borders become sunken. The following button is simulated to be in the pressed (active) state.\n    Disabled buttons maintain the same raised border, but have a &#34;washed out&#34; appearance in their label.\n    Button focus is communicated with a dotted border, set 4px within the contents of the button. The following example is simulated to be focused.\n  Checkboxes are represented with a sunken panel, populated with a &#34;check&#34; icon when selected, next to a label indicating the choice.\n  Note: You  must include a corresponding label  after your checkbox, using the  &lt;label&gt; element with a  for attribute pointed at the  id of your input. This ensures the checkbox is easy to use with assistive technologies, on top of ensuring a good user experience for all (navigating with the tab key, being able to click the entire label to select the box).\n      When grouping inputs, wrap each input in a container with the  field-row class. This ensures a consistent spacing between inputs.\n  An  option button, also referred to as a radio button, represents a single choice within a limited set of mutually exclusive choices. That is, the user can choose only one set of options.\n    Option buttons can be grouped by specifying a shared  name attribute on each input. Just as before: when grouping inputs, wrap each input in a container with the  field-row class to ensure a consistent spacing between inputs.\n      Peanut butter should be smooth       I understand why people like crunchy peanut butter       Crunchy peanut butter is good\n  You create the tabs, you would use a  section class=&#34;tabs&#34; then for the tab titles you use a  label class=&#34;tab.title&#34; and the content for each tab by using an  article class=&#34;tab-content&#34; element.\n  To mark a tab as visible, add the  .active class to the  .tab-title and the  .tab-content either statically in your HTML or dynamically using JavaScript. Don&#39;t forget to remove it from the other tabs when you&#39;re changing it!\n      Tab 1   Tab 2   Tab 3     Tab Content    You create the tabs, you would use a  section class=&#34;tabs&#34;  then for the tab titles you use a  label class=&#34;tab.title&#34;  and the content for each tab by using an  article class=&#34;tab-content&#34;  element.     To mark a tab as visible, add the  .active  class to the  .tab-title  and the  .tab-content  either statically in your HTML or dynamically using JavaScript. Don&#39;t forget to remove it from the other tabs when you&#39;re changing it!        More...   This tab contains a GroupBox     Today&#39;s mood       Claire Saffitz         Brad Leone         Chris Morocco         Carla Lalli Music           Tab 3   Lorem Ipsum Dolor Sit\n  A  group box is a special control you can use to organize a set of controls. A group box is a rectangular frame with an optional label that surrounds a set of controls.\n  A group box can be used by wrapping your elements with the  fieldset tag. It contains a sunken outer border and a raised inner border, resembling an engraved box around your controls.\n    You can provide your group with a label by placing a  legend element within the  fieldset.\n  A  text box (also referred to as an edit control) is a rectangular control where the user enters or edits text. It can be defined to support a single line or multiple lines of text.\n  Text boxes can rendered by specifying a  text type on an  input element. As with checkboxes and radio buttons, you should provide a corresponding label with a properly set  for attribute, and wrap both in a container with the  field-row class.\n    Additionally, you can make use of the  field-row-stacked class to position your label above the input instead of beside it.\n  A  slider, sometimes called a trackbar control, consists of a bar that defines the extent or range of the adjustment and an indicator that shows the current value for the control...\n      You can make use of the  has-box-indicator class replace the default indicator with a box indicator, furthermore the slider can be wrapped with a  div using  is-vertical to display the input vertically.\n  Note: To change the length of a vertical slider, the  input width and  div height.\n  A  drop-down list box allows the selection of only a single item from a list. In its closed state, the control displays the current value for the control. The user opens the list to change the value.\n    5 - Incredible!   4 - Great!   3 - Pretty good   2 - Not so great   1 - Unfortunate\n  By default, the first option will be selected. You can change this by giving one of your  option elements the  selected attribute.\n  5 - Incredible!   4 - Great!   3 - Pretty good   2 - Not so great   1 - Unfortunate\n      At the top edge of the window, inside its border, is the title bar (also reffered to as the caption or caption bar), which extends across the width of the window. The title bar identifies the contents of the window.\n  Include command buttons associated with the common commands of the primary window in the title bar. These buttons act as shortcuts to specific window commands.\n  You can build a complete title bar by making use of three classes,  title-bar,  title-bar-text, and  title-bar-controls.\n    We make use of  aria-label to render the Close button, to let assistive technologies know the intent of this button. You may also use &#34;Minimize&#34; and &#34;Maximize&#34; like so:\n  To give our title bar a home, we make use of the  window class. This provides a raised outer and inner border, as well as some padding. We can freely resize the window by specifying a width in the container style.\n    To draw the contents of the window, we use the  window-body class under the title bar.\n    Microsoft❮R❯ Windows DOS ❮C❯ Copyright Microsoft Corp 1990-2001.  C:\\WINDOWS\\SYSTEM32&gt; You can build a command line easily with a window and pre tag\n      Command Prompt                    Microsoft &amp;#10094;R &amp;#10095; Windows DOS  &amp;#10094;C &amp;#10095; Copyright Microsoft Corp 1990-2001.  C: &amp;#92;WINDOWS &amp;#92;SYSTEM32&gt; You can build a command line easily with a window and pre tag\n  A Window With Tabs and Groups                      Music   Dogs   Food     Set your listening preferences     Today&#39;s mood       Nicki Minaj         Bell Towers         The Glamorous Monique         EN. V         Reset Alarm...   Try this to get some attention                You create the content for each tab by using an  article  tag.             OK   Cancel\n  A  tree view control is a special list box control that displays a set of objects as an indented outline based on their logical hierarchical relationship.\n  To render a tree view, use an  ul element with the  tree-view class. The children of this list ( li elements), can contain whatever you&#39;d like.\n    To make this a tree, we can nest further  ul elements (no class needed on these). This will provide them with a nice dotted border and indentation to illustrate the structure of the tree.\n    Table of Contents   What is web development?    CSS    Selectors   Specificity   Properties           JavaScript     Avoid at all costs       Unless     Avoid       At     Avoid   At   All   Cost         All   Cost               HTML   Special Thanks\n      Refer to  the GitHub issues page to see bugs in my CSS or report new ones. Also check the  issues for 98.css.\n  XP.css started as a fork of  98.css (a fun project started by  Jordan Scales) and is now trying to boilerplate the GUI to be able to theme it easily.   If you want to make a theme or contribute i&#39;d love to see where you can take this!\n  Hopefully you&#39;ve enjoyed this project! 🍸 Consider  starring/following along on GitHub and following me on  Twitter.", "posttime": "2020-05-17 05:00:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,css", "title": "XP.css-用于构建GUI的Windows XP CSS文件和框架", "title_en": "XP.css – Windows XP CSS file and framework for building GUIs", "transed": 1, "url": "https://botoxparty.github.io/XP.css/", "via": "", "real_tags": ["windows", "css"]}, {"category": "", "categoryclass": "", "imagename": "14a6d11e0e49572ccd576da5162faeec.png", "infoid": 1002443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pontiff做了一个核心假设/强加：一个模块是一个文件是一个编译单元在此基础上，它自动解析构建顺序，并行构建，获取和沙箱所有依赖项最终将允许用户指定依赖项版本约束它还将控制编译器和运行时，允许跨平台和所有时间的可重复构建。\nPontiff目前正在内部开发中，直到它的功能集和接口被锁定，Pull请求将被礼貌地拒绝，通过问题提出的功能请求将被考虑。非常感谢错误报告。我的目标是以向后兼容的方式开发Pontiff，可以跨Pontiff文件版本进行功能迁移，但是如果我破坏了您的项目，请随意在#FICE ON FREENODE中对我(Alicemaz)大喊大叫。\n目前，Pontiff在Linux(可能还有BSD？)上工作。并且需要lang lld和git‘我很快就会支持GCC和gnu ld。我会支持SVN，可能很快就会支持。我想支持pijul如果仅仅出于美学原因，我可能会在某一天勉强支持Windows，但不会在不久的将来的任何时候引导脚本在ArchLInux上不起作用，除非您将FICE-CSI别名为CSI，但这是一个简单的修复方法。\n依赖关系必须通过存储库和目录对象指定为长格式，但这应该不是什么大问题，因为除了我之外，没有人很快发布过PIOTFF项目。我很快就会有一个基本解析器，这样您就可以指定一个符号，然后以某种方式转换为回购。最终，我会有一种方法来发布版本化的tarball，并允许半个模式(或类似的东西)将它们拉下。\n要开始，请运行bootstrap.scm。它将构建一个最小可行Pontiff，然后使用该Pontiff正确构建PINTIFF它调用鸡肉-安装-s，因此如果从那里调用了您不喜欢的东西，请小心，将生成的(静态链接的)PANTIFF二进制文件放入某个路径PATH新的[项目名]将创建一个hello world项目，其中包含一个可执行的Pontiff Build和Pontiff run。正如您所期望的，我最终会有更多关于Pontiff.ix文件的kawaii文档，但是它的类型规范可能是相当可读的。\n记住，文件是模块是一个编译单元，更具体地说，模块的路径唯一地确定其名称：src/a/b/c.scm必须是包含一个且只包含一个模块的文件，名为a.bc。有些东西我们是故意不支持的(比如函数器；期望表格中的类型类系统迟早会出现！)。同样重要的是，不能使用宏来扰乱导入列表，因为我们必须在编译之前对它们进行解析，以便对模块进行排序。\n这是我们的第一个重要的软件版本，还有更多版本即将发布！希尔夫将主要建立在哈斯克尔计划和AGDA计划之上，我们希望尽我们所能为未来做出合理的贡献。", "note_en": "pontiff makes one core assumption/imposition: one module is one file is one compilation unit from this basis, it resolves a build order automatically, builds in parallel, fetches and sandboxes all dependencies eventually pontiff will allow users to specify dependency version constraints it will also control the compiler and runtime, allowing reproducible builds across platforms and for all time\n pontiff is presently under internal development until its featureset and interface are locked down, pull requests will be politely declined feature requests made via issue will be considered. bug reports are appreciated my goal is to develop pontiff in a backward-compatible manner, with functional migrations across pontiff file versions but if I break your project feel free to yell at me (alicemaz) in #chicken on freenode\n presently, pontiff works on linux (and probably bsd?) and requires clang lld and git I&#39;ll support gcc and gnu ld soon. I&#39;ll support svn maybe soon-ish. I&#39;d like to support pijul if only for aesthetic reasons I will probably support windows grudgingly someday but not any time in the near future the bootstrapping script won&#39;t work on archlinux unless you alias chicken-csi to csi but it&#39;s an easy fix\n dependencies must be specified longform via the repository and directory objects but this shouldn&#39;t be much of a problem since no one except me has ever released a pontiff project fairly soon I will have a barebones resolver so you can specify a symbol that will be transformed to a repo by some means eventually I&#39;ll have a way to publish versioned tarballs and allow semver patterns (or something like that) to pull them down\n to get started, run bootstrap.scm. it will build a minimum viable pontiff, then use that to build pontiff properly it invokes  chicken-install -s so be careful if that&#39;s something you dislike from there, put the resulting (statically linked) pontiff binary in PATH somewhere  pontiff new [project name] will create a hello world project with one executable  pontiff build and  pontiff run do what you expect I will have more kawaii documentation on the pontiff.ix file eventually but a fairly readable type spec of it can be found in src/prototype/file.scm\n remember, a file is a module is a compilation unit more specifically, a module&#39;s path uniquely determines its name: src/a/b/c.scm  must be a file containing one and only one module, named a.b.c there are some things we don&#39;t support on purpose (like functors; expect a typeclass system in tabulae sooner or later!) also it is very important that no macros mess with import lists, as we  must parse them  before compilation to sort modules\n this is our first nontrivial software release, with more to come! sylph will mostly be built on scheme haskell and agda and we want to contribute back whatever we reasonably can here&#39;s to the future", "posttime": "2020-05-17 05:00:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计划,haskell,pontiff", "title": "Pontiff：一种Haskell式的鸡计划构建系统", "title_en": "Pontiff: A haskell-style build system for Chicken Scheme", "transed": 1, "url": "https://github.com/sylphbio/pontiff", "via": "", "real_tags": ["计划", "haskell", "pontiff"]}, {"category": "", "categoryclass": "", "imagename": "c10321a74beaec2f442fa95738aa2911.jpg", "infoid": 1002442, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "广泛使用的JavaScript服务器端运行时Node.js的制造商发布了Deno 1.0，这是一个新的JavaScript和TypeScript运行时，解决了Node.js中的设计错误。\n在过去的两年里，Node.js的创建者Ryan Dahl一直在开发Deno JavaScript项目，他的贡献者团队现在已经发布了Deno 1.0，这对JavaScript开发人员来说可能会变得与Node.js一样重要。\nJavaScript是使用最广泛的编程语言之一，在每一台有网络浏览器的设备上都使用它。就像Node.js或Node一样，Deno运行时用于在Web浏览器之外执行JavaScript。\n然而，与Node.js不同的是，Deno为微软日益流行的TypeScript提供了一流的支持，TypeScript是为大型项目设计的JavaScript超集。\nDeno基于Google的Chromium V8 JavaScript引擎，并且是用Rust编程语言编写的，而不是Node的C++。\n除了修复Node.js的问题外，Dahl还希望Deno能够迎合JavaScript，因为与2009年他设计Node时相比，JavaScript是一种非常不同的语言。此外，由于Node的广泛使用，Node变得很难更新。\n随着JavaScript语言的不断变化，以及TypeScript等新功能的加入，构建节点项目可能会成为一项艰巨的工作，包括管理构建系统和其他繁重的工具，这些工具剥夺了动态语言脚本编写的乐趣，达尔在由Deno开发人员Bert Belder和Bartek Iwańczuk共同撰写的一篇博文中写道。\n此外，链接到外部库的机制基本上是通过NPM存储库集中起来的，这不符合Web的理想，他补充道，他指的是Node的NPM包。\nDeno核心是用Rust编写的，Deno 1.0的主要组件是Deno命令行界面(CLI)。\nDahl说，Deno不是一个单一的程序，而是一个铁锈板条箱的集合-软件包或软件库-允许在不同的层进行集成。例如，Deno核心机箱是Deno的最基本的框架，而Rusty_V8机箱提供到V8的C++应用程序编程接口(API)的Rust绑定。\n&#34；该机箱提供了在GitHub Actions CI中内置的二进制文件，但它也允许用户从头开始编译V8并调整其许多构建配置，&#34；Dahl写道。\n&#34；所有V8源代码都分发在机箱中。最后，RUSTY_V8试图成为一个安全的接口。现在还不是百分之百安全，但我们快到了。能够以安全的方式与V8这样复杂的虚拟机交互是相当令人惊讶的，这让我们在Deno本身发现了许多困难的错误。\nDahl还强调，Deno不是Node的分支，而是一个全新的实现，尽管目标与Node相似。一般来说，它也与NPM不兼容。然而，Dahl预计Deno最终将能够运行更多开箱即用的Node程序。\n根据Dahl的说法，Deno在Web服务器上的性能与Node相当，但Deno的延迟比Node更好。\nhello-world Deno HTTP服务器每秒处理大约25k个请求，最大延迟为1.3毫秒。他指出，一个类似的Node程序每秒处理34k个请求，最大延迟在2到300毫秒之间相当不稳定。", "note_en": "The makers of the widely used JavaScript server-side runtime, Node.js, have released Deno 1.0, a new runtime for JavaScript and TypeScript that addresses &#34;design mistakes&#34; in Node.js.\n The Deno JavaScript project has been under development by Node.js creator Ryan Dahl for the past two years and his team of contributors has now released Deno 1.0, which could become just as important for JavaScript developers as Node.js.\n    JavaScript is one of the most widely used programming languages, and it&#39;s employed on every device with a web browser. Just like Node.js or Node, the Deno runtime is for executing JavaScript outside a web browser.\n  However, unlike Node.js, Deno offers first-class support for  Microsoft&#39;s increasingly popular Typescript, a superset of JavaScript designed for large projects.\n   Deno is based on Google&#39;s Chromium V8 JavaScript engine and written in programming language Rust as opposed to C++ for Node.\n Besides fixing problems with Node.js, Dahl also wanted Deno to cater for JavaScript being a very different language today than it was in 2009, when he designed Node. Additionally, because of Node&#39;s wide use, Node has become difficult to update.\n   &#34;With the changing JavaScript language, and new additions like TypeScript, building Node projects can become an arduous endeavor, involving managing build systems and other heavy-handed tooling that takes away from the fun of dynamic language scripting,&#34;  writes Dahl in a blogpost co-authored by fellow Deno developers Bert Belder and Bartek Iwańczuk.\n &#34;Furthermore the mechanism for linking to external libraries is fundamentally centralized through the NPM repository, which is not in line with the ideals of the web,&#34; he adds, referring to Node&#39;s NPM packages.\n The Deno core is written in Rust, and Deno 1.0&#39;s main component is the Deno command line interface (CLI).\n Dahl says Deno is not a monolithic program, but rather a collection of Rust &#34;crates&#34; – packages or software libraries – that allow integration at different layers. For example, the Deno core crate is the &#34;very bare bones&#34; of Deno, while the rusty_v8 crate provides Rust bindings to V8&#39;s C++ application programming interface (API).\n &#34;The crate provides binaries that are built in GitHub Actions CI, but it also allows users to compile V8 from scratch and adjust its many build configurations,&#34; Dahl writes.\n &#34;All the V8 source code is distributed in the crate itself. Finally rusty_v8 attempts to be a safe interface. It&#39;s not yet 100% safe, but we&#39;re getting close. Being able to interact with a VM as complex as V8 in a safe way is quite amazing and has allowed us to discover many difficult bugs in Deno itself.&#34;\n  Dahl also stresses that Deno is not a fork of Node, but a completely new implementation, albeit with similar goals to Node. It&#39;s also not, in general, compatible with NPM. However Dahl expects Deno will eventually be able to run more Node programs out of the box.\n Deno&#39;s performance on web server is about equal to Node, according to Dahl, but Deno has better latency than Node.\n &#34;A hello-world Deno HTTP server does about 25k requests per second with a max latency of 1.3 milliseconds. A comparable Node program does 34k requests per second with a rather erratic max latency between 2 and 300 milliseconds,&#34; he notes.", "posttime": "2020-05-17 04:45:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,设计,开发,runtime,js", "title": "针对Node.js中的“设计错误”，其开发人员发布了JS/Tyescript Runtime Deno 1.0", "title_en": "Addressing 'Design Mistakes' in Node.js, Its Developers Release JS/TypeScript Runtime Deno 1.0", "transed": 1, "url": "https://www.zdnet.com/article/deno-1-0-node-js-makers-have-new-javascript-runtime-for-typescript-programming-language/", "via": "", "real_tags": ["发布", "设计", "开发", "runtime", "js"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近我读了很多关于铁锈的书。几天前，我遇到了一些用Rust编写的常见POSIX命令行工具替代工具。他们中的大多数在某些方面都更好。", "note_en": "I’ve been reading a lot about  Rust lately. A few days ago I came across a bunch of common POSIX command line tool replacements written in Rust. Most of them are better in some way.", "posttime": "2020-05-17 04:44:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,nix,命令行", "title": "用Rust编写的常见*nix命令", "title_en": "Common *nix commands written in Rust", "transed": 1, "url": "https://gcollazo.com/common-nix-commands-written-in-rust/", "via": "", "real_tags": ["rust", "nix", "命令行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "图形交换格式(GIF)已有30多年的历史，但它是网络文化中无处不在的一部分。我们使用GIF来保存短的、无声的和循环的视频，这些视频经常成为模因。存在创建和共享它们的实体服务，许多智能手机键盘都有内置的GIF支持。\n这也很容易将它们嵌入到具有简单图像标签的网站中。但GetGIF有一个很大的缺点：庞大的文件大小。一个GIF可以比一个典型的网站(超过2MB)更大。\n我不在乎任何东西是设计用来做什么的。我在乎它能做什么。\nGIF从来没有被设计成提供完整的视频。几乎与之相反的是，SteveWilhite设计了这种格式来解决有效地为简单图像提供服务的问题，比如天气图和其他图形。\nGIF中的每个图像都被限制为256色的调色板。图像也是使用LZW无损压缩的，这些因素使得GIF成为图形而不是像照片这样的图像的一个很好的选择，后者有更多的细节，更适合像JPEG这样的格式。\nGIF还允许在一个文件中存储多个图像。这一事实使得新的GIF规范(GIF89a)很容易增加图像之间的时间延迟选项，将它们变成动画的帧。\n该规范还允许使用称为应用扩展块的空间。Netscape Navigatorv2.0利用这个空间允许GIF创建者指定GIF应该循环一定次数或无限期循环。这给了我们今天通常看到的GIF。\n然而，GIF现在的大小往往是几兆字节，因为我们经常使用它们来显示由大量细节图像组成的视频。请记住，每个文件都是无损压缩的。此外，GIF不在帧之间进行任何压缩，这是典型视频压缩技术的基本基础。因为GIF不会利用这种信息冗余，所以这种格式是一种非常低效的视频服务方式。\n解决方案是使用一种实际上是为视频服务而设计的格式，如MP4或WebM。当Twitter在2014年增加对GIF的支持时，他们通过将上传的GIF转换成视频来实现这一功能。同年，Imgur开始做同样的事情。\n现在用HTML Videoelement提供视频而不是GIF很容易，几乎所有人都支持它，但是使用视频标签而不是图像标签要做更多的工作。要提供相当于GIF的视频服务，我们可以使用如下标记：\n&lt；视频自动播放循环静音播放&lt；video/webm&34；；type=&#34；video/WebM&34；&gt；&lt；source src=&#34；dyning-baby.mp4&34；type=&#34；video/mp4&34；&gt；&lt；p&gt；您的浏览器不支持此嵌入式。\n使用自动播放、循环和静音属性为我们提供了与我们从GIF中期望的相同的行为。\n元素将加载浏览器支持的第一个源。在这种情况下，如果浏览器无法播放WebM视频，它将尝试播放MP4版本。\n我们还提供了备用消息，以防浏览器不支持视频元素。这与浏览器不支持任何来源的情况不同。在这种情况下，元素会激发一个错误事件。\n我们不必为每个源提供MIMEtype，但这样做可能会允许浏览器保存网络请求。如果它无法处理该类型，则可以移到下一个源，而不是向服务器发出请求。\n用户的电源设置也会影响视频行为。例如，如果用户打开了低功率模式，则视频不会在iOS上自动播放。相反，用户应该看到控件，并且可以手动播放视频。\n虽然提供视频服务不像提供GIF服务那样简单，但文件大小的节省可能是巨大的。下面的视频大小为103KB，而我转换它的GIF为4.1MB。那是尺寸缩小了97%以上。\n为了快速将GIF转换成视频，有很多网站可以让你一次性转换。\n要在MacOS中截取视频截图，我使用的是Kap。支持将视频保存为GIF、MP4、WebM或APNG文件。QuickTime还支持屏幕录制。\n如果你使用Imgur，我遇到的一个问题是上传MP4后的视频质量很差。原因似乎是他们被重新压缩了，所以至少对Imgur来说，上传一个GIF文件让他们负责将其转换成视频会更好。\n最后一点注意：根据Wilhite的说法，gif的发音是柔和的“G”，就像“jif”一样。这为我解决了这场永无止境的辩论。", "note_en": "The Graphics Interchange Format ( GIF) isover 30 years old but is a pervasive part of internet culture. We use GIFs toserve short, silent, and looping videos, which frequently become memes.  Entireservices exist to create and share them, and manysmartphone keyboards have built-in GIF support.\n It&#39;s also easy to embed them into websites with simple image tags. YetGIFs have a significant drawback: massive file sizes. A single GIF can be largerthan a typical website ( over 2MB).\n   I don&#39;t care what anything was  designed to do. I care about what it  can do.\n GIFs  were neverdesignedto serve full videos. Almost to the contrary,  SteveWilhite designed the format tosolve the problem of efficiently serving simple images, like weather maps andother graphics.\n Each image in a GIF is limited to a color pallete of 256 colors. Images are also losslessly compressedusing  LZW.These factors made GIF a good choice for graphics rather than images likephotographs, which have much more detail and are better suited for a format like JPEG.\n GIF also allowed for storing more than one image in a file. This fact made iteasy for a new GIF specification (GIF89a) to add the option for time delaysbetween images, turning them into frames of an animation.\n The specification also allows for a space called the application extensionblock.  Netscape Navigatorv2.0 used this space to allow GIF creators to specify that a GIF should loop acertain number of times or indefinitely. This gave us the GIF as we commonly seeit today.\n However, GIFs tend to be several megabytes in size now because we frequently usethem to display videos comprised of images with a lot of detail. Remember thateach one is losslessly compressed. Furthermore, GIF doesn&#39;t do any compressionbetween frames, a basic foundation of typical  videocompression techniques.Frames of a video tend to be fairly similar. Because GIFs don&#39;t exploit thisinformation redundancy, the format is a very inefficient way to serve videos.\n The solution is to use a format that&#39;s actually designed to serve videos, like MP4 or WebM. Many services do this transparently.When Twitter  added GIFsupportin 2014, they implemented the fetaure by converting uploaded GIFs into videos toserve instead. Imgur  started doing the samething the same year.\n  Serving videos instead of GIFs is easy to do now with the HTML  videoelement, whichis supported  almost universally, but it doestake more work to use a video tag rather than an image tag. To serve the videoequivalent of a GIF, we can use markup like this:\n &lt; video  autoplay  loop  muted  playsinline&gt; &lt; source  src = &#34;dancing-baby.webm&#34;  type = &#34;video/webm&#34;&gt; &lt; source  src = &#34;dancing-baby.mp4&#34;  type = &#34;video/mp4&#34;&gt; &lt; p&gt;Your browser doesn&#39;t support this embedded video.&lt;/ p&gt;&lt;/ video&gt;\n Using the  autoplay,  loop, and  muted attributes gives us the same behaviorthat we expect from a GIF.\n  The element will load the  firstsourcethat the browser supports. In this case, if the browser can&#39;t play WebM videos,it will try to play the MP4 version instead.\n We also provide a fallback message in case the browser doesn&#39;t support the videoelement. This is distinct from the case where the browser doesn&#39;t support any ofthe sources. In that case, the element fires an error event.\n We don&#39;t have to provide the  MIMEtypefor each source, but doing so might allow the browser to  save a networkrequest.If it can&#39;t handle the type, it can move on to the next source rather thanmaking a request to the server.\n Video behavior can also be affected by the user&#39;s power settings. For example,videos won&#39;t autoplay on iOS if the user has  low powermode on. Instead, the user should seethe controls and can manually play the video.\n While serving a video is not as straightforward as serving a GIF, the file sizesavings can be tremendous. The following video is 103 KB in size, compared to4.1 MB for the GIF that I converted it from. That&#39;s a size reduction of over97%.\n   To quickly convert a GIF into a video, there are plenty of websites that let you do a one-off conversion.\n   To take video screenshots in macOS, I use  Kap. It supportssaving the videos as GIF, MP4, WebM, or APNG files. QuickTime also  supports screenrecordings.\n If you use  Imgur, one issue that I&#39;ve experienced is poorvideo quality after uploading MP4s. The reason seems to be that  they getrecompressed.So at least for Imgur, it&#39;s better to upload a GIF and let them take care ofconverting it into a video.\n One final note:  according toWilhite, GIF  ispronouncedwith a soft “G,” like “jif.” That settles the  never-endingdebatefor me.", "posttime": "2020-05-17 04:44:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供,videos,gif", "title": "提供视频而不是GIF", "title_en": "Serve Videos Instead of GIFs", "transed": 1, "url": "https://www.dannyguo.com/blog/serve-videos-instead-of-gifs/", "via": "", "real_tags": ["提供", "videos", "gif"]}]