[{"category": "", "categoryclass": "", "imagename": "1c1bd16121cd7a30b4ccc5a579fd749b.jpg", "infoid": 1013786, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当费迪南德·皮耶希在1998年复活布加迪时，他给了公司一份工程简报：制造一辆功率至少为986马力(735kW)、时速249英里(400公里/小时)的汽车。哦，而且它必须像大众高尔夫一样易于驾驶。这款车后来变成了威龙EB 16.4，当它在2005年投产时，它迎接了这一挑战，拥有1,001公制马力(987马力/736kW)和最高时速253英里(408公里/小时)，所有这些都花了100万欧元(当时约合130万美元)。\n但这只是个起点。2016年，该品牌继威龙(Veyron)之后推出了另一款中置引擎双座轿车Chron，采用另一款四涡轮增压8.0l W16发动机。入场券的价格上涨了，但动力和最高速度也上涨了，这一趋势在去年的测试中达到了几乎令人难以置信的305英里/小时(490公里/小时)，这一趋势在Chron Super Sports等衍生品中得以延续。\n超越这个数字似乎很困难，这可能就是为什么最新版本的Chron-被称为Chron Pur Sports-实际上是自90年代中期EB110以来最慢的布加迪。最慢的，至少在最高时速，因为Pur Sports的电子限制仅为218英里/小时(350公里/小时)。普尔体育可能不是最快的布加迪，但它很可能是最快的。\n1,500马力(1,119千瓦)的W16发动机已经进行了改造，以提供更快的油门响应，红线从6,700rpm延长到6,900rpm。80%的变速箱是新的，传动比比任何其他Chron都要短15%。事实上，据Bugatti的底盘开发主管Jachin Schwalbe说，PUR Sports中的第7档几乎与普通Chron中的第6档的比率相同-因此最高速度要低得多。另一方面，那些堆叠得更紧密的传动比能够更好地保持发动机的功率带。\n0到62英里每小时(100公里/小时)比普通的CHIRON快0.1秒，只需要2.3秒。0到124英里/小时(200公里/小时)比普通车又增加了十分之一，比普通车增加了一倍，达到186英里/小时(300公里/小时)-这只需要12.4秒而不是13.1秒。当你仔细想想的时候，它的速度之快令人震惊。当你猛烈发射时，你的内脏在G下移动的感觉可能会很有趣，肌肉车和特斯拉的车主都会证实这一点。但是，没有那么多的设置是适合从静止状态通过齿轮运行的-也许只有拉动带和高速公路收费站才是合适的。\n一个更好的衡量的PUR体育的提高驾驶性能显示在时间表上，当你看数字齿轮加速，特别是第六档。而且我也不是在谈论你可能只会用在德国放宽限制的高速公路的剩余部分的车速。第六名从37-62英里/小时(60-100公里/小时)出发需要5.7秒；在Pur Sports中只需要3.4秒。在Pur Sports中，时速37-75英里(60-120公里/小时)需要4.4秒，比普通赛车少3秒。其50-75英里/小时(80120公里/小时)时间的改善更令人印象深刻，PUR SPORT为2.4秒，而CHIRON为4.3秒。\n施瓦布的团队还修改了PUR Sports的暂停，目标是保持所有四个轮胎的接触补丁尽可能大。弹簧在前部的刚度为65%，在后部的刚度为35%。有了新的、更坚固的自适应减振器，施瓦布说，这让他的操控团队秉持不同的理念，告诉汽车它必须以不同的方式反应，因此车轮的弯曲度是其他Bugattis的两倍。此外，他们还增加了一种新的、更宽松的驾驶模式(称为“运动+”)，让驾驶者在介入之前可以更大程度地滑行和漂移。\n考虑到其中一辆车的新轮胎成本，这种模式很可能得到了米其林的赞助。好吧，那只是个玩笑，但这家法国轮胎制造商已经为Chron Pur Sports设计了一种独特的运动杯2R轮胎，它的抓地力提高了10%。\n与普通的Chron相比，110磅(50公斤)的重量节省看起来并不是很大，但它的目标是有价值的部分。有重量轻的镁车轮，可节省35磅(16公斤)，以及钛刹车盘保护板和碳纤维防滚杆。排气尖端是3D打印的钛，这是布加迪已经使用了几年的一项技术。该品牌已经放弃了液压驱动的后翼，取而代之的是一个巨大的固定机翼，这也增加了下压力。这是你对一辆花式跑道超级跑车的期待，比如后窗玻璃更薄，隔热材料更少，阿尔坎塔拉内部令人愉悦。\n正如你可能预料到的，PUR SPORT的操控能力已经在那个著名的赛道上磨练过了，那里有很多弯道，纽伯格林诺德施莱夫赛道(Nurburgring Nordschleife)。\n在拳击场上抛出一支PUR SPORT听起来非常有趣。不幸的是，这是很少人会经历的事情。布加迪只会制作60辆Chron Pur Sports，如果你想要一辆，起价是350万美元(300万欧元)。", "note_en": "When  Ferdinand Piech resurrected Bugatti in 1998, he gave the company an engineering brief: build a car with at least 986hp (735kW), capable of 249mph (400km/h). Oh, and it had to be as drivable as a Volkswagen Golf. That car became the Veyron EB 16.4, and when it went into production in 2005, it met that challenge, boasting 1,001 metric horsepower (987hp/736kW) and a top speed of 253mph (408km/h), all for a cool million Euros (or about $1.3 million at the time).\n But that was just the starting point.  In 2016, the brand followed up the Veyron with the Chiron, another mid-engined two-seater, powered by another quad-turbo 8.0L W16 engine. The price of admission had gone up, but so had the power and top speed, a trend that has continued with derivatives like  the Chiron Super Sport that reached  an almost unbelievable 305mph (490km/h) in testing last year.\n  Topping that number seems difficult, which may be why the latest iteration of the Chiron—called the Chiron Pur Sport—is actually the slowest Bugatti since  the EB110 of the mid-90s. Slowest as in top speed, at least, as the Pur Sport is electronically limited to a mere 218mph (350km/h). The Pur Sport might not be the fastest Bugatti, but it may well be the quickest.\n The 1,500hp (1,119kW) W16 engine has been reworked to provide a quicker throttle response, with the redline extended from 6,700rpm to 6,900rpm. And 80 percent of the gearbox is new, with 15-percent shorter gear ratios than any other Chiron. In fact, according to Jachin Schwalbe, Bugatti&#39;s head of chassis development, 7th gear in the Pur Sport is almost the same ratio as 6th gear in a regular Chiron—hence the much lower top speed. The flip side is that those more closely stacked gear ratios are better able to keep the engine in its powerband.\n Zero to 62mph (100km/h) is 0.1 seconds faster than the regular Chiron, taking just 2.3 seconds. Zero to 124mph (200km/h) gains another tenth over the regular car, and one more to 186mph (300km/h)—this takes just 12.4 vs 13.1 seconds. Which is shockingly quick, when you think about it. The feeling of your internal organs shifting under G as you violently launch can be a lot of fun, as both muscle car and Tesla owners will confirm. But there aren&#39;t that many settings where running up through the gears from a standstill is appropriate—maybe only the drag strip and the highway toll booth.\n A better measure of the Pur Sport&#39;s increased drivability shows up on the timesheet when you look at the numbers for in-gear acceleration, specifically sixth gear. And I&#39;m not talking about velocities you&#39;re only likely to use on the remaining bits of  derestricted Autobahn in Germany, either. Going from 37-62mph (60-100km/h) in sixth takes 5.7 seconds in a Chiron; in a Pur Sport it takes 3.4 seconds. 37-75mph (60-120km/h) takes 4.4 seconds in the Pur Sport, 3 seconds less than the normal car. The improvement in its 50-75mph (80120km/h) time is even more impressive, 2.4 seconds in the Pur Sport versus 4.3 seconds in a Chiron.\n  Schwalbe&#39;s team also revised the Pur Sport&#39;s suspension with the goal of keeping all four tires&#39; contact patches as large as possible. The springs are 65-percent stiffer at the front and 35-percent stiffer at the rear. There are new, firmer adaptive dampers, which Schwalbe says allowed his handling team to &#34;go with a different philosophy, telling the car that it has to react in a different way,&#34; so the wheels have twice as much camber as other Bugattis. And they&#39;ve added a new, more permissive driving mode (called Sport+) that lets the driver powerslide and drift more before intervening.\n Given the cost of new tires for one of these cars, that mode may well be sponsored by Michelin. OK, that was just a joke, but the French tire maker has come up with a unique Sport Cup 2 R tire for the Chiron Pur Sport that increases grip by 10 percent.\n The weight savings of 110lbs (50kg) compared to a regular Chiron doesn&#39;t seem huge, but it has been targeted at the bits that count. There are lightweight magnesium wheels that save 35lbs (16kg), as well as titanium brake disk protection plates and carbon-fiber antiroll bars. The exhaust tips are 3D-printed titanium, a technique that Bugatti has been playing with  for a couple of years now. The brand has ditched the hydraulically actuated rear wing in favor of a massive fixed wing, which also  boosts downforce. And there&#39;s the stuff you expect for a fancy track-focused supercar, like thinner glass in the rear window, less insulation material, and a delightful Alcantara interior.\n As you might expect, the Pur Sport&#39;s handling prowess has been honed at that famous racetrack with so many corners, the Nurburgring Nordschleife.\n  Slinging a Pur Sport around the &#39;ring sounds like an awful lot of fun. Unfortunately, it&#39;s something few will ever experience. Bugatti is only going to make 60 Chiron Pur Sports, and if you want one, they start at $3.5 million (€3 million).", "posttime": "2020-07-24 00:16:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sports,chron,chiron", "title": "布加迪价值350万美元的新Chron Pur Sports速度更慢，但也更快", "title_en": "Bugatti’s new $3.5 million Chiron Pur Sport is slower—but also quicker", "transed": 1, "url": "https://arstechnica.com/cars/2020/07/bugattis-new-3-5-million-chiron-pur-sport-is-slower-but-also-quicker/", "via": "", "real_tags": ["sports", "chron", "chiron"]}, {"category": "", "categoryclass": "", "imagename": "f4ed9df2618f472a4df3af1e228f3888.jpg", "infoid": 1013785, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在大西洋桥资本和Fortino Capital Partners的帮助下，Red River West引领了这轮融资。据该公司称，它现在总共筹集了2000万美元。\n该公司美国业务负责人蒂姆·麦克拉肯(Tim McCracken)表示，这个名字来自日语，意思是公司在那里进行所有规划的大房间。许多公司将一群人聚集在一个会议室里，在墙上贴满便条和白板，说明他们未来几周和几个月的计划。\n甚至在疫情爆发之前，这就不是记录这些有价值的商业内容的最有效的方式，iObeya已经开发了一项服务，将其置于数字领域。“因此，他们在这些房间里做的一件事是，他们有很多不同的视觉管理板，上面有张贴的便条，还有不同类型的指示器，他们将用来管理自己的业务。”所以iObeya所做的就是将这种类型的可视化管理数字化，这样你就可以从多个地点访问它，并在团队之间共享，基本上不需要在纸上和墙上做这件事，“McCracken解释说。\n这涉及数字化四个主要领域，包括精益管理、工厂车间管理、敏捷编程，最后是他们所说的数字工作场所，其中包括设计思维、虚拟白板和头脑风暴。所有这些方法都有很多与之相关的计划，并且可以从在线迁移中受益。\n他们现在接近100名员工，其中大部分在法国，在美国西雅图有一个小办公室，但他们将利用这笔钱进行扩张，计划再增加50名员工。他说，当涉及到招聘实践时，该公司一直在考虑多样性。\n他说：“我们不仅要努力吸引有经验的销售人员，以及他们周围的支持组织，还要在当地社区做尽可能多的外展工作，看看我们如何才能确保我们的员工队伍能反映社区的情况。”\n麦克拉肯说，由于新冠肺炎的原因，公司不得不关闭办公室，他们自己的软件帮助他们更顺利地实现了过渡。“我们实际上使用我们自己的软件来管理业务，所以我们的实际工作几乎没有受到干扰。与此同时，仅仅是因为对软件的需求增加，工作量可能增加了四到五倍。因此，我们不仅要处理从办公室工作到在家工作的问题，还要处理增加的工作量。“他说。\n该公司于2011年在巴黎附近成立。他们计划用这笔钱扩大在美国的业务，并通过增加销售和营销支出来建立公司的知名度。", "note_en": "Red River West led the round with help from Atlantic Bridge Capital and Fortino Capital Partners. It has now raised a total of $20 million, according to the company.\n Tim McCracken, who heads up the company’s US operations, says the name comes from the Japanese word for the large room where companies did all their planning. Many companies gather a group of people in a conference room and line the walls with sticky notes and white boards with their plans for the coming weeks and months.\n  Even before the pandemic struck, it wasn’t the most effective way to record this valuable business content, and  iObeya   has developed a service to put it in the digital realm. “And so one of the things that they did with those obeya rooms was they had lots of different visual management boards with post it notes and with different types of indicators that they would use to manage their business. And so what iObeya does is digitize that type of visual management, so that you can access it from multiple locations and share it amongst teams and basically eliminate the need for doing it on paper and on walls,” McCracken explained.\n This involves digitizing four main areas that include lean management, factory floor management, agile programming and finally what they call the digital workplace, which includes design thinking, virtual whiteboarding and brainstorming. All of these approaches have lots of planning associated with them and could benefit from being moved online.\n  They are approaching 100 employees with the majority in France right now with a small office in the U.S. in Seattle, but they will be using this money to expand with plans to add 50 more. He says that the company has always looked at diversity when it comes to its hiring practices.\n “We want to try to attract, not only experienced salespeople, as well as the support organization around them, but also really do as much outreach in the local community to see how we can ensure that our workforce reflects the community,” he said.\n As the company had to shut down offices due to COVID-19, McCracken says their own software helped them make that transition more smoothly. “We actually use our own software to manage business so we had very little disruption to our actual work. At the same time, the volume of work increased probably four to five fold, simply because of increased demand for the software. So we had to manage not only moving from working in an office to work at home, but also the increased workload,” he said.\n The company was founded near Paris in 2011. They plan to use the money to expand operations in the U.S. and build awareness of the company through greater sales and marketing spend.", "posttime": "2020-07-24 00:15:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "规划,management,管理", "title": "\nIObeya筹集1700万美元，将敏捷等管理规划流程数字化", "title_en": "\n\t\t\t\tiObeya raises $17M to digitize management planning processes like Agile\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/23/iobeya-raises-17m-to-digitize-management-planning-processes-like-agile/", "via": "", "real_tags": ["规划", "管理"]}, {"category": "", "categoryclass": "", "imagename": "8d4683efceab2084821edf31a7fa82e5.jpg", "infoid": 1013783, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴黎是世界上为数不多的几个城市之一，这些城市已经成为争夺共享微移动市场市场份额的关键战场之一。这些许可证对Dott，Lime和Tier来说是一个关键的胜利。相反，这对总部位于美国的鸟牌来说是一个重大损失，就在一年前，该公司在法国市场下了大赌注，并宣布计划在巴黎开设其最大的欧洲办事处。鸟牌当时表示，希望在2021年年中之前招聘1000人。\n这三家运营商将被允许在巴黎各部署5000辆滑板车，为期两年。该市正在为这些设备创造2500个专用停车位，以避免人行道上的混乱，这是允许共享滑板车公司开设店铺的城市的主要抱怨。\n巴黎市长安妮·伊达尔戈通过推特宣布了这一消息。下面是这三条推文的完整翻译。\n祝贺莱姆、多特和蒂尔在巴黎滑板车招标中胜出。这3家运营商将是唯一一家在巴黎每人最多部署5000辆滑板车的运营商。\n根据环境责任、使用者安全、滑板车维护和充电管理三个标准选择运营商(编辑)。\n我提醒滑板车使用者，他们在旅行中应该尊重行人和道路规则，他们应该在分配的区域停车：巴黎目前正在创造2500个专用停车位。\n这三家滑板车公司都为其在巴黎及其他地区的运营做出了各种环境和社会承诺，以努力赢得城市的支持，支持他们的商业模式。例如，Lime在周四的一篇博客文章中表示，它用当地的可再生能源为其仓库供电，利用当地劳动力实施广泛的维修和再利用计划，在生命周期结束时回收97%的材料，并根据碳中性协议运营一支经过认证的碳中性车队。\n多特和蒂尔也做出了类似的承诺。多特表示，其每辆滑板车都将配备可拆卸电池，由可再生能源充电，并完全由当地全职员工维修。Dott表示，计划在巴黎为使用其摩托车提供固定价格的门票，往返通行证价格为3.99欧元，7天无限制解锁通行证价格为2.9欧元。开锁费通常为1欧元/趟。\n本月早些时候，多特(Dott)、Tier和Voi宣布了一个可持续发展联盟，做出了10项环境和社会承诺，包括承诺从2021年起不在任何市场使用零工经济工人，从2021年起在所有新的电动滑板车中至少使用20%的回收材料，从今年开始，所有新的电动滑板车都必须配备可更换电池。", "note_en": "Paris is one of a handful of cities in the world that have become key battlegrounds over market share in the shared micromobility market. The permits are a critical win for Dott, Lime and Tier. It conversely represents a major loss for U.S.-based  Bird,   which just a year ago made a big bet on the French market and announced plans to open up its biggest European office in Paris.  Bird said at the time that it wanted to hire 1,000 people by mid-2021.\n   The three operators will each be allowed to deploy 5,000 scooters in Paris for two years. The city is creating 2,500 dedicated parking spots for the devices in an effort to avoid clutter on sidewalks, a primary complaint in cities that have allowed shared scooters companies to set up shop.\n Paris mayor Anne Hidalgo made the announcement via Twitter. A complete translation of the three tweets are below.\n Congratulations to Lime, Dott and Tier, winners of the tender for scooters in Paris. Those 3 operators will be the only ones that can each deploy a maximum of 5,000 scooters in Paris.\n Operators have been selected according to three criteria: environmental responsibility, user safety, scooter maintenance and charging management (edited)\n I remind scooter users that they should respect pedestrians and the rules of the road during their trips and that they should park in the allocated areas: 2,500 dedicated parking spots are currently being created in Paris.\n All three scooter companies have made a variety of environmental and social pledges for its operations in Paris and beyond in an effort to win over cities and shore up their business models. For instance, Lime said in a  blog post Thursday that it powers its warehouses with local renewable energy, employs an extensive repair and reuse program with local labor, recycles 97% of materials at end of life, and operates a certified CarbonNeutral fleet in accordance with the CarbonNeutral Protocol.\n Dott and Tier have made similar commitments. Dott said each of its scooters will be equipped with a removable battery, recharged with renewable energy and serviced entirely by its own local full-time employees. Dott said it plans to offer fixed-price tickets in Paris for access to its scooters with round-trip passes costing €3.99 and 7-day unlimited unlocking pass at €2.9. Unlocking fee usually €1/trip.\n Earlier this month, Dott, Tier and Voi announced a sustainability coalition that makes 10 environmental and social pledges, including commitments to not use gig economy workers in any market, use at least 20% recycled material in all new e-scooters from 2021 and as of this year, for all new scooters to have swappable batteries.", "posttime": "2020-07-24 00:15:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "市场,dott,滑板车", "title": "\n石灰，Dott和Tier赢得巴黎滑板车许可证，使鸟牌在一个关键市场亏损", "title_en": "\n\t\t\t\tLime, Dott and Tier win Paris scooter permits, delivering Bird a loss in a key market\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/23/lime-dott-and-tier-win-paris-scooter-permits-delivering-bird-a-loss-in-a-key-market/", "via": "", "real_tags": ["市场", "dott", "滑板车"]}, {"category": "", "categoryclass": "", "imagename": "ea74e68b46a9006975e1b00f2faa8d55.jpg", "infoid": 1013781, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着TikTok的人气持续增长，其名人凭借自己的能力成为主流名人，该公司正试图通过一项2亿美元的新创作者基金来留住人才。\nTikTok的一位发言人告诉The Verge，该基金旨在支持那些在这款应用上“寻找机会谋生”的雄心勃勃的创作者。这标志着TikTok为直接向创作者的内容付费的第一次重大努力。在此之前，创作者可以将直播流货币化，但新节目将直接向制作视频的人付费。创作者将在未来一年定期收到付款，该基金将随着时间的推移而增长。该公司没有证实创作者将获得资金的数量是否有限制。TikTok也没有说明支付频率或创作者能赚多少钱。\n想要申请资助的创作者必须年满18岁或以上，始终如一地发布原创视频，并创作符合TikTok社区指导方针的内容。基线粉丝数量也是必需的，但TikTok没有说明需要多少粉丝。美国的创作者可以在8月份申请资金。该公司正寻求在全球范围内扩大该基金，但没有透露何时会这样做。\nTikTok总经理瓦妮莎·帕帕斯(Vanessa Pappas)在一篇博客文章中表示：“通过TikTok创作者基金，我们的创作者将能够实现额外的收入，这些收入反映了他们在创造性地与受到他们想法启发的观众建立联系方面所投入的时间、关怀和奉献精神，”TikTok总经理凡妮莎·帕帕斯(Vanessa Pappas)在一篇博客文章中表示。\n这标志着TikTok为直接向创作者的内容付费的第一次重大努力。\n这并不是TikTok第一次为创作者设立基金；该公司在5月底推出了一项5000万美元的创意学习基金，面向平台上的教师。然而，创客基金标志着TikTok的一个重要时刻。YouTube允许拥有1000多名订户的创作者在过去12个月里积累了超过4000小时的观看时间，可以在自己的频道上投放广告，并将每段视频货币化。与YouTube不同的是，TikTok的运营方式更像是Instagram。创作者可以在他们的频道上播放赞助视频，但创作者没有直接的、持续的货币化计划。\n现在，TikTok希望定期向创作者支付费用。这是TikTok保持竞争力的一种方式，因为它的人才只会变得更受欢迎。当Vine很受欢迎的时候，该平台的许多顶级创建者开始在YouTube上花费更多的时间，因为他们可以用Vine不允许的方式将他们的内容货币化。\nTikTok不想重蹈覆辙。帕帕斯承认，无论是在这款应用上还是在应用下，它的创作者都获得了主流的成功，并指出顶尖人物已经找到了“与好莱坞一些最大的经纪公司的品牌合作伙伴关系、赞助和代理协议”。查利(Charli)和迪克西·达梅里奥(Dixie D‘Amelio)等一些创作者也在TikTok之外签署了协议。该公司知道其创建者将在平台上获得成功，但TikTok也希望尽可能长时间地留住他们。\n从战略上讲，这也在几个方面帮助了TikTok。通过选择谁接受资助，TikTok可以尽量避免YouTube发现自己陷入了有争议的、有问题的和彻头彻尾的攻击性创建者赚钱的情况。该基金还可以帮助该公司解决与美国政府正在进行的斗争，美国政府已提出可能禁止这款应用。TikTok花了几个月的时间试图让自己成为一家更美国化的公司，在洛杉矶有一个园区，是一名美国CEO，并计划在美国招聘1万人。2亿美元的创作者基金是TikTok展示其对美国承诺的另一种方式。\n不管TikTok为什么现在推出这项基金，关键是TikTok希望直接向创建者支付他们对这款应用的贡献-这款应用在过去18个月里增长了令人印象深刻的数量。创建者有望在下个月了解更多关于资格因素的信息。", "note_en": "As  TikTok continues to grow in popularity and its personalities become mainstream celebrities in their own right, the company is trying to keep talent with a new $200 million creators fund.\n The fund is meant to support ambitious creators who “are seeking opportunities to foster a livelihood” on the app, a TikTok spokesperson told  The Verge. It marks the first major effort from TikTok to pay creators directly for their content. Prior to this, creators could monetize live streams, but the new program will pay people directly for making videos. Creators will receive regular payments over the coming year, and the fund will grow over time. The company did not confirm if there’s a limit to how many creators will receive funding. TikTok also did not say how often payments will be made or how much creators can earn.\n Creators who want to apply for funding must be 18 or older, consistently post original videos, and create content that is consistent with TikTok’s community guidelines. A baseline follower count is also required, but TikTok did not state how many are needed. Creators in the United States can apply for funding in August. The company is looking to expand the fund globally, but no word on when that will happen.\n “Through the TikTok Creator Fund, our creators will be able to realize additional earnings that reflect the time, care, and dedication they put into creatively connecting with an audience that’s inspired by their ideas,” Vanessa Pappas, general manager of TikTok,  said in a blog post.\n It marks the first major effort from TikTok to pay creators directly for their content\n This isn’t the first time TikTok has created a fund for creators; the company launched a $50 million Creative Learning Fund at the end of May for teachers on the platform. The Creator Fund, however, marks a significant moment for TikTok. Unlike YouTube, which allows creators with  more than 1,000 subscribers and who have accrued more than 4,000 hours of watch time over the last 12 months to run ads on their channel and monetize each video, TikTok has operated more like Instagram. Creators can run sponsored videos on their channel, but there’s no direct, ongoing monetization program for creators.\n Now, TikTok wants to pay creators regularly. It’s a way for TikTok to remain competitive as its talent only becomes more popular. Back when Vine was popular, many of the platform’s top creators started spending more time on YouTube because they could monetize their content in a way Vine didn’t allow.\n TikTok doesn’t want to be in the same boat. Pappas acknowledged that its creators are finding mainstream success both on and off the app, noting that top personalities have found “brand partnerships, sponsorships, and representation deals with some of Hollywood’s biggest talent agencies.” Some creators, like Charli and Dixie D’Amelio, have also  signed deals outside of TikTok. The company knows its creators will find success off the platform, but TikTok also wants to keep them around for as long as possible.\n  Strategically, this also helps TikTok out in a few ways. By choosing who receives funding, TikTok can try to avoid situations that YouTube has found itself in with controversial, problematic, and downright offensive creators earning money. The fund could also help the company in its ongoing struggles with the US government, which has floated possibly banning the app. TikTok has spent months trying to make itself a more American company, with a  campus in Los Angeles, an  American CEO, and plans to hire  10,000 people in the United States. A $200 million creators fund is another way that TikTok can show its commitment to the US.\n Regardless of why TikTok is introducing the fund now, the point is that TikTok wants to pay creators directly for their contributions to the app — an app that has  grown an impressive amount over the last 18 months. Creators can expect to learn more about eligibility factors next month.", "posttime": "2020-07-24 00:13:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表示,creators,tiktok", "title": "TikTok表示，将推出一项新的2亿美元创作者基金，直接向创作者支付内容费用", "title_en": "TikTok says it is launching a new $200M creators fund to pay creators directly for their content", "transed": 1, "url": "https://www.theverge.com/2020/7/23/21335404/tiktok-creators-monetization-fund-followers-youtube-content-videos?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["表示", "creators", "tiktok"]}, {"category": "", "categoryclass": "", "imagename": "d5f91b68f8bbed8b08f3573d7524843d.jpg", "infoid": 1013780, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ET Now周四援引消息人士的话报道，亚马逊正在洽谈收购印度企业集团信实工业(Reliance Industries)零售部门9.9%的股份。该公司表示，亚马逊希望JioMart优先持有Reliance Retail的战略股份。信实零售子公司的电子商务合资企业JioMart于今年5月成立，对亚马逊(Amazon)的本地业务和沃尔玛(Walmart)的Flipkart构成了严峻的挑战。#全球首富#杰弗贝佐斯和第五大首富#穆克什·安巴尼据信正在洽谈…。Https://t.co/9og2dwnajc。\n现在使用ET(@ETNOWLIVE)1595497918000(&A；mdash；et Now)。\n今年早些时候，在印度进入封锁以遏制冠状病毒爆发后，亚马逊印度启动了一项计划，在其平台上增加当地的小商店。亚马逊的一位女发言人通过电子邮件表示，该公司对猜测不予置评，而Reliance没有立即回复记者的置评请求。信实由亚洲首富穆凯什·安巴尼(Mukesh Ambani)控制，自4月下旬以来，该公司已为其数字部门筹集了约200亿美元，包括来自Alphabet的谷歌(Google)和Facebook。", "note_en": "Amazon is in talks to buy a 9.9% stake in the retail arm of Indian conglomerate  Reliance Industries, ET Now reported on Thursday, citing sources. It said that Amazon wants a preferred, strategic stake in  Reliance Retail for  JioMart. JioMart, the e-commerce venture of Reliance&#39;s retail arm, was launched in May and poses a formidable challenge to Amazon&#39;s local unit and Walmart&#39;s Flipkart. #ETNOWMegaExclusive | World&#39;s richest man #JeffBezos and 5th richest man #MukeshAmbani are believed to be in talks… https://t.co/9og2dwnajc\n&amp;mdash; ET NOW (@ETNOWlive)  1595497918000\n Earlier this year, Amazon India  launched a program to add small local shops on its platform after India went into a lockdown to curb the spread of the coronavirus outbreak.   An Amazon spokeswoman through email said the company does not comment on speculation, while Reliance did not immediately respond to a request for comment.  Reliance, controlled by Asia&#39;s richest man, Mukesh Ambani, has raised around $20 billion since late April for its digital arm, including from Alphabet&#39;s Google and Facebook.", "posttime": "2020-07-24 00:13:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,洽谈,stake,reliance", "title": "消息人士：亚马逊正在洽谈收购Reliance Retail 9.9%的股权，以获得其电商企业JioMart的优先战略股权", "title_en": "Sources: Amazon is in talks to buy a 9.9% stake in Reliance Retail, for a preferred, strategic stake in its e-commerce venture JioMart", "transed": 1, "url": "https://tech.economictimes.indiatimes.com/news/internet/amazon-in-talks-to-buy-9-9-stake-in-reliance-retail-arm-report/77127167?redirect=1", "via": "", "real_tags": ["亚马逊", "amazon", "洽谈", "stake", "reliance"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013779, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着OpenAI的GPT-3的发布，人工智能编写代码的话题再次成为热门话题。GPT-3是一个自然语言模型，给出了一些例子，它试图为给定的文本输入预测适当的文本输出。因为代码只是文本，所以问题是，是否可以仅根据代码应该做什么的描述来使用它来生成代码。而且，在我们生活的这个令人惊叹的世界里，已经有一些关于这一点的早期技术演示。\n对这类演示的一个常见的即兴反应是，这类技术将不可避免地让软件工程师过时，因为如果人工智能或多或少能够生产出他们生产的产品，那么似乎我们就不再需要付钱让他们做这件事了。\n这类主张的理由是可以理解的。如果你的前提是软件工程师的工作是描述一些软件应该做什么，并编写代码来实现它，那么将这样的技术视为临时替代是有意义的。\n但那是不对的。软件工程师真正要做的是构建软件解决方案来适当地解决问题。这似乎是一个微妙的区别，但它确实是一个非常重要的区别。代码不是解决方案，它是解决方案的实现。解决方案当然需要编写代码，因此需要能够编写代码。但是反过来，编写代码的能力并不意味着能够为问题创建适当的解决方案。\n我认为因为编写代码本质上是一项困难的技能，对外人来说是不透明和陌生的，所以看起来构建软件的困难部分实际上就是编写代码。但事实并非如此，这才是关键所在。困难的部分是恰当地解决问题。一旦有了解决方案，在代码中实现它就相对容易了。\n这是违反直觉的，我不认为没有自己构建软件的过程就能完全欣赏它。如果没有这种洞察力，看起来确实像是人工智能编写代码打开了通才构建软件的可能性，仅仅通过描述他们的想法。但这并不比雇佣一位经验丰富的幽灵作家为任何有故事想法的人写一部伟大小说打开了可能性。\n因此，我从局外人的角度理解这些主张的基础。考虑到它们所依据的前提，它们是合理的。然而，让我有点惊讶的是，似乎来自内部人士-软件工程师自己-的常见反驳。\n主要有两种形式。第一个问题是，这永远不会奏效：指出这类事情在实践中的所有技术困难。另一个是无论如何都只是代码：任何超过一定复杂性的软件的自然语言描述都必须结构化和形式化到基本上变成代码的程度。这一概念是：任何软件的自然语言描述都必须经过结构化和形式化，才能基本上变成代码。(译者注：也就是说，任何软件的自然语言描述都必须经过结构化和形式化，才能基本上变成代码。)\n我觉得这些反驳令人惊讶，并不是因为它们一定是错的。它们实际上非常实用--在剩下的对话相关之前，这件事必须基本上起作用，毕竟，我们离这还有很长的路要走。我发现他们更令人惊讶，因为他们在自己的层面上满足了要求，似乎含蓄地接受了他们的前提。他们说，这是错误的，因为人工智能赢不了有意义的代码，而不是有意义的代码。这是错误的，因为当人工智能能够有意义地编写代码时，它不仅不会让软件工程师过时，反而会帮助他们。\n我预计会有更多的软件工程师持后一种观点的原因是，这里真的没有什么新鲜事。乍一看，使用人工智能来生成代码看起来像是一次巨大的飞跃，但它实际上更像是软件行业从第一天开始就在发生的事情的线性发展-使用软件自动化编写软件。通过自动化越来越多的繁重工作来提高软件构建效率的工具和框架是每个软件工程师都熟悉的，而且他们明白它们无疑是一件好事。为什么编写代码的人工智能应该有什么不同呢？\n此外，在这一点上已经确定，这样的工具不会导致对软件工程师的需求减少，因为对要构建的软件的需求没有固定的限制。相反，它们允许更快地构建更多更好的软件，为在以前不经济的地方应用软件解决方案打开了新的机会，促进了软件行业的发展，并实际上增加了构建软件所需技能的价值，同样，这与编写代码的能力不是一回事。\n软件工程师应该欢迎带来人工智能工具的每一项进步，这些工具有助于编写更大、更有意义的代码部分。这不是要抵制的东西，而是要推动的东西，因为这些工具不仅不会让软件工程师过时，还会进一步利用他们拥有的最有价值的技能。", "note_en": "With the release of OpenAI&#39;s  GPT-3 the topic of AI writing code is hot again. GPT-3 is a natural language model that, given some examples, tries to predict appropriate text output for a given text input. Since code is just text, there&#39;s the question of whether it can be used to produce code based only on a description of what the code should do. And, amazing world that we live in, there are already some early  tech demos of exactly that.\n  A common off-the-cuff reaction to such demos is that this sort of technology will inevitably make Software Engineers obsolete, because if an AI can produce more or less what they produce, then seemingly we won&#39;t need to pay them to do it anymore.\n The reasoning for these kinds of claims is understandable. If your premise is that a Software Engineer&#39;s job is to take a description of what some software should do, and write code to implement that, then it makes sense to view technology like this as a drop-in replacement.\n But that&#39;s not right. What a Software Engineer really does is build software solutions to solve problems appropriately. That seems like a subtle distinction, but it&#39;s a really important one. Code is not the solution, it&#39;s the implementation of a solution. The solution certainly requires that code be written, hence the ability to write code. But going the other direction, the ability to write code does not imply the ability to create appropriate solutions to problems.\n I think because writing code is intrinsically a difficult skill which is opaque and unfamiliar to outsiders, it appears like the hard part of building software is in fact writing code. But it really isn&#39;t, and that&#39;s the point. The hard part is solving the problem appropriately. Implementing that solution in code once you have it is comparatively easy.\n This is counter-intuitive, and I don&#39;t think it&#39;s something that can be fully appreciated without having gone through the process of building software yourself. Without this insight, it does indeed seem like an AI writing code opens up the possibility of generalists building software, just by describing their ideas. But that&#39;s no more true than saying that hiring a skilled ghost writer opens up the possibility for anybody with a story idea to write a great novel.\n  So, I understand the basis of these claims from an outsider&#39;s perspective. They are reasonable given the premises they&#39;re based on. What does surprise me a bit, though, is the common rebuttals that seem to come up from insiders - Software Engineers themselves.\n There are two main forms. The first is &#34;this will never work&#34;: pointing out all the technical difficulties of such a thing in practice. The other is &#34;it&#39;s all just code anyway&#34;: the notion that the natural language description of any software past a certain point of complexity would have to be structured and formalised to the extent that it basically becomes code.\n I find these rebuttals surprising not because they&#39;re necessarily wrong. They&#39;re actually very practical - the thing has to basically work before the rest of the conversation is relevant, after all, and we&#39;re still a very long way from that. I find them surprising more just because they meet the claims at their own level, seeming to implicitly accept their premise. They say &#34;this is wrong because AI won&#39;t be able to meaningfully write code&#34; rather than &#34;this is wrong because when AI  can meaningfully write code, far from making Software Engineers obsolete, it will help them&#34;.\n The reason I&#39;d expect more Software Engineers to hold the latter view is because there&#39;s really nothing new here. I guess using AI to produce code looks like some giant leap at first glance, but it&#39;s really more a linear progression of something that&#39;s been happening in the software industry since day one - using software to automate writing software. Tools and frameworks that improve efficiency in building software by automating more and more of the heavy lifting are something that every Software Engineer is familiar with, and it&#39;s understood that they&#39;re unequivocally a good thing. Why should an AI writing code be any different?\n Furthermore, it&#39;s established at this point that such tools do not lead to less need for Software Engineers, because there is not a fixed limit of demand for software to be built. Rather, they allow more and better software to be built faster, opening new opportunities to apply software solutions where they weren&#39;t previously economical, growing the software industry and actually increasing the value of the skillset needed to build software, which again, is not the same thing as the ability to write code.\n  Software Engineers should welcome every advancement that brings forward AI tools that assist in writing larger and more meaningful parts of our code. This isn&#39;t something to resist, but something to push forward, because far from making Software Engineers obsolete, these tools will further leverage the skills they have that are most valuable.", "posttime": "2020-07-24 00:13:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,软件工程师,代码,人工智能,编写", "title": "人工智能编写代码将使软件工程师更有价值", "title_en": "AI Writing Code Will Make Software Engineers More Valuable", "transed": 1, "url": "https://davnicwil.com/ai-writing-code-makes-software-engineers-more-valuable/", "via": "", "real_tags": ["软件", "软件工程师", "代码", "人工智能", "编写"]}, {"category": "", "categoryclass": "", "imagename": "ce1ba37751d9a4e523d8d4296df69a16.jpg", "infoid": 1013778, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter周三证实，上周在一场史无前例的账户泄露事件中，130名高调用户的账户被黑客入侵，其中36人的直接信息(DM)被黑客窃取。\n周三晚些时候，Twitter在一条最新消息中称，荷兰的一名民选官员是DM被攻破的人之一，这是Twitter有兴趣分享“关于攻击者对他们访问的账户做了什么的更多细节”的兴趣的一部分。\n该公司表示，目前，这名荷兰官员似乎是唯一一名私人信息遭遇这种命运的政府官员(前任或现任-乔·拜登(Joe Biden)和巴拉克·奥巴马(Barack Obama)也是最初黑客攻击的一部分)。\n推特补充说：“到目前为止，我们没有迹象表明有任何其他前任或现任民选官员访问了他们的DM。”\n该公司还在Twitter上澄清，以区分之前对黑客攻击的更新，当时他们表示，黑客从130个账户中的8个下载了“你的Twitter数据”的档案，并补充说，这些账户都不是经过验证的账户。推特此前表示，对于“绝大多数”被攻破的账户，不明身份的攻击者无法访问这些私人账户信息。\nTwitter表示，随着情况的发展，该公司将继续“积极”联系账户持有人，提供最新消息。事实上，一周多后，随着对实际情况的更多信息的了解，这家社交媒体巨头继续争先恐后地拼凑导致7月15日首次披露的史诗般的账户劫持事件的原因。\n当天，该公司表示，比尔·盖茨、埃隆·马斯克、苹果和优步等精英用户的Twitter账户都同时被劫持，以推送加密货币骗局。\nTwitter立即锁定了数千个属于知名Twitter用户和知名公司的认证账户，试图阻止黑客实施这一骗局，其中包括从每个被劫持的账户发送推文，宣传一项虚假的预付费加密货币交易，承诺将发送到一个特定钱包的比特币价值翻一番。\n最终，Twitter披露，一群身份不明的黑客侵入了公司的内部系统；他们设法获得了Twitter公司工具的访问权限，并确保了员工的特权，从而发动了广泛的社会工程攻击。\n当时，一名安全研究人员称这起事件是“百分之百史无前例的”：“我们从来没有见过如此多的Twitter账户同时被劫持，”Tenable的员工研究工程师萨特南·纳朗(Satnam Narang)告诉Threatpost。\n自那以后，关于谁可能是黑客的幕后黑手，人们进行了广泛的猜测，并报道了证据，但没有确凿的结论。\n关于潜在肇事者的一些最有力的证据发表在多份报告中，这些报告指出，痴迷于所谓的“OG句柄”的黑客出售了Twitter账户访问权限。“OG句柄”是一些简短的个人资料名称，可以在一定程度上衡量某些在线社区的地位和财富。\n另一种似是而非的理论也浮出水面，即Twitter内部工具的截图在袭击发生前出现在地下论坛上，原因是一名单独的流氓Twitter员工行贿，但Twitter后来驳斥了这一说法。\n据说，由于这起事件对隐私、立法和商业产生了巨大的影响，目前联邦调查局正在牵头调查。\n在DM爆料之后，Fight for the Future发起了一项新的努力，呼吁该公司在DM上实施默认的端到端加密。\n“鉴于推特在公开反对专制政府的记者和积极分子中特别受欢迎，我们认为可以公平地说，DM大量泄露可能会危及人们的生命，”“搏击未来”的一位发言人告诉Threatpost。“iMessage、WhatsApp、Signal甚至Facebook都提供端到端加密。推特需要尽快效仿。“", "note_en": "Hackers accessed direct messages (DMs) for 36 of the 130 high-profile users whose accounts were hacked in an  unprecedented account breach last week, Twitter confirmed Wednesday.\n An elected official in the Netherlands was one of those whose DMs were compromised, the company  tweeted in an update late Wednesday, as part of Twitter’s interest in sharing “more specifics about what the attackers did with the accounts they accessed.”\n At this time, it appears that the Dutch official was the only government official (previous or current – Joe Biden and Barack Obama were also part of the original hack) whose private messages suffered that fate, the company said.\n “To date, we have no indication that any other former or current elected official had their DMs accessed,” Twitter added.\n The company also  tweeted a clarification to differentiate between a previous update to the hack in which they said hackers downloaded an archive of “Your Twitter Data” from eight of the 130 accounts, adding that none of these were verified accounts. Twitter previously said that for the “vast majority” of compromised accounts, the unknown attackers were unable to access this private account information.\n Twitter continues to “actively” work to contact account holders with updates as the situation unfolds, the company said. Indeed, more than a week later, the social media giant continues to scramble to piece together what led to  the epic hijacking of accounts that it first revealed on July 15, as it learns more information about what actually happened.\n On that day, the company said that Twitter accounts of elite users such as Bill Gates, Elon Musk, Apple and Uber were all hijacked at the same time to push a cryptocurrency scam.\n Twitter immediately locked down thousands of verified accounts belonging to high-profile Twitter users and high-profile companies to try to prevent hackers from perpetrating the scam, which involved sending tweets from each of the hijacked accounts to promote a bogus advance-fee cryptocurrency deal, promising to double the value of Bitcoin currency sent to one specific wallet.\n Eventually, Twitter revealed that there was a compromise of the company’s internal systems by a group of unidentified hackers; they managed to gain access to Twitter company tools and secured employee privileges to mount a widespread social-engineering attack.\n At the time, one security researcher called the incident “100-percent unprecedented”: “We have never seen such a large and simultaneous number of Twitter accounts hijacked at the same time,” Satnam Narang, staff research engineer at Tenable, told Threatpost.\n Since then there has been widespread speculation and reported evidence about who may be behind the hack, but no solid conclusions.\n Some of the  strongest evidence about the potential perpetrators was published in a number of  reports pointing to the sale of Twitter account access by hackers obsessed with so-called “OG handles,” which are short-character profile names that confer a measure of status and wealth in certain online communities.\n Another plausible theory also emerged that that screenshots of Twitter’s internal tools appeared on underground forums ahead of the attacks due to a bribe of a lone rogue Twitter employee, but Twitter later refuted this claim.\n At this time the FBI is said to be taking the lead in the investigation due to the massive privacy, legislative and business ramifications of the incident.\n In the wake of the DM revelations, Fight for the Future  has launched a new effort calling for the company to implement default end-to-end encryption on DMs.\n “Given that Twitter is especially popular with journalists and activists speaking out against repressive governments, we think it’s fair to say that DMs leaking en masse could put people’s lives at risk,” a Fight the Future spokesperson told Threatpost. “iMessage, WhatsApp, Signal, and heck, even Facebook offer end-to-end encryption. Twitter needs to follow suit ASAP.”", "posttime": "2020-07-24 00:12:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,推特,私人,hackers,twitter", "title": "推特：黑客获取精英账户的私人信息", "title_en": "Twitter: Hackers Accessed Private Messages for Elite Accounts", "transed": 1, "url": "https://threatpost.com/twitter-hackers-private-messages-elite-accounts/157657/", "via": "", "real_tags": ["黑客", "推特", "私人", "hackers", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "9946a2cc3cc5f8f93643cd286abf3cbc.png", "infoid": 1013777, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个基于维基图像的GAN模型基于艺术家、风格和流派生成了一幅前所未见的画作！", "note_en": "This GAN model, trained on WikiArt images, generates a never-seen-before painting based on an artist, style, and genre!", "posttime": "2020-07-24 00:12:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "paint,painting,gan", "title": "GRadio-Paint生成器(StyleGAN)", "title_en": "Gradio – Painting Generator (StyleGAN)", "transed": 1, "url": "https://360.gradiohub.com/", "via": "", "real_tags": ["paint", "painting", "gan"]}, {"category": "", "categoryclass": "", "imagename": "d544e726a724a7e55338547cd2f52396.jpg", "infoid": 1013775, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "应用性能监测(APM)最早始于20世纪90年代末，最初的公司包括Precision(被赛门铁克收购，剥离后被Idera收购)，Wly Technology(被CA Technologies收购)和Mercury Interactive(被惠普软件事业部收购)。\n在本世纪头十年，APM工具继续被更大的供应商收购。然后在过去的十年里，APM市场变得竞争非常激烈，主要供应商-Dynatrace、AppDynamics(现在归思科所有)、CA Technologies(现在归Broadcom所有)、New Relic、太阳风和其他供应商-帮助催化了APM。\n我询问了12家领先的和新兴的APM公司，他们对2020年及以后APM的未来有何看法，以及他们在塑造APM方面的作用。请阅读下面他们的答案。\n今天，APM解决方案正在发展，以解决构建、交付和访问应用程序的方式的重大转变。在过去的一两年里，我看到我的十几个客户与APM巨头签约，或与其他解决方案签约，如Instrumental、DataDog、Appoptics、Site24x7、Raygan等。\n随着思科、Broadcom、太阳风等公司最近进行的APM业务收购，Application Performance Monitoring and Management为更多希望成为2020年及以后APM领导者的竞争对手赢得了更多关注和空间。\n这就是为什么我决定询问几家领先的和新兴的APM公司，他们对2020年及以后APM的未来有什么看法，以及他们在塑造APM方面的作用。\n关于APM的未来，2020年及以后的应用性能监控和管理将是什么样子？贵公司将如何帮助塑造APM的未来？\n自从数字化转型出现以来，应用性能监控(APM)已经走过了很长一段路，我们看到越来越多的人采用了基于SaaS的APM工具。在我看来，APM的未来是支持无服务器APM，容器编排和微服务中的APM支持，以及跨基础设施和网络层的基于人工智能的数据关联。Site24x7是一款基于SaaS的监控工具，我们已经拥有成熟的APM解决方案，可以帮助DevOps团队解决所有层上任何应用程序中的性能问题。对无服务器APM的支持已经在内部酝酿之中，我们将做好满足市场需求的准备。“\n随着业务格局的演变和应用复杂性的增加，技术专业人员将越来越多地利用APM工具来实现高水平的业务目标。这是因为人们更加关注以客户为中心，并认为停机、连接不良和性能缓慢都可能等同于业务损失。集成强大的APM应用工具提供了转变任何业务并创造强大竞争优势的机会，我们预计在2020年及以后会看到更多。SolarWinds将继续以极少数人能做到的方式解决APM的复杂性-通过我们与技术专业人士的深厚联系和承诺，并通过提供易于使用、负担得起的解决方案。“。\n“客户都在转向分布式系统--容器、微服务和无服务器功能正变得司空见惯。因此，这将需要聪明的方法来收集所有错误和高延迟跟踪，并将跟踪数据无缝地绑定到底层基础架构指标、日志、浏览器、移动设备、物联网设备，并将其显示在单一窗格中。有了所有的遥测数据在一个地方，销售商不仅可以显示相关性，还可以提出根本原因，以加快开发人员的MTTR。“。\nAPM扩展到IT、运营和业务中包括更多功能，包括：APM将变得更加开放和集成，使不同的团队能够选择一流的解决方案并轻松集成以提高洞察力；APM变得更加注重网络，因为应用程序交付依赖于与SaaS和云的集成-网络就是计算机，APM将更加众包和AI驱动，以便组织可以实时检测、修复和优化其应用程序。众包数据集通过改进的建模实现端到端系统性能预测，随着基础设施不断变化以最好地服务于业务需求，APM将专注于终端用户和网络转型。“。\n“我们肯定看到了基于云端的网络监控软件的趋势。作为一家软件公司，与时俱进、顺应市场是很重要的。进入2020年，我们完全预计NetCrunch将拥有云和人工智能能力。远程探测器也将在NetCrunch的未来发展中发挥重要作用。我们怀疑其他人也会效仿。“。\n应用程序性能监控(APM)正变得更具操作性和洞察力。在Raygan，我们提供了一种现代的智能APM解决方案，为开发人员提供答案，而不仅仅是线索。传统的APM解决方案非常善于向你提供性能瓶颈所在的提示，但Raygan更进一步，显示代码在幕后做了什么，包括所有的方法和查询。未来的APM工具也将更多地利用人工智能和机器学习，自动将您所能做出的最高价值改进提升到视图中，为您的客户提供更好的数字体验。\nAPM将继续适应日志管理、基础设施和网络监控以及SIEM产品。因此，这一统一的可观察性解决方案将提供从应用程序到基础设施的整个堆栈的可见性，甚至用户体验。这一点，再加上特定于应用程序的指标的强大功能，将允许RevOps和BizOps团队拥有他们做出更好业务决策所需的数据分析工具。Sematext将通过全栈可观察性解决方案Sematext Cloud超越传统的三大可观察性支柱，帮助塑造APM的未来。Sematext Cloud将日志、度量、跟踪和真实用户数据结合在一起，以便更快地向您提供可操作的洞察力。“。\nAIOps--通过采用机器学习和人工智能支持的AIOps方法，APM将超越监控，不仅能够更好地理解正在发生的事情，还能够自动驱动正确的智能操作。*统一、跨堆栈可见性-监控转向本机方法(即不通过扩展)的主要云平台将成为一项至关重要的要求。数据摄取的规模变得至高无上-物联网的兴起意味着设备和数据的数量远远超过了人，全球物联网的数量也在不断增加，这就是说，随着全球物联网数量的增加，数据摄取的规模变得至高无上--物联网的兴起意味着设备和数据的数量远远超过了人，全球联网物联网的数量也在不断增加。\n“APM将继续发挥主要作用，但真正找到问题根源的重要性将进一步增加。为了找到根本原因，至关重要的是将来自APM工具的信息与来自IT基础设施监控工具的信息融合，以发现堆栈中潜在的问题和瓶颈所在。因此，APM工具将需要提供此功能或与IT基础设施监控工具集成，反之亦然。例如，我们Checkmk正计划与其APM测试工具整合，帮助我们客户的运营和开发团队共同快速找出真正的根本原因。“\n“建筑和语言就像牛仔夹克和紧身牛仔裤一样反复循环。稳扎稳打前进的那一步吗？开发人员-而不是系统管理员和IT部门-比以往任何时候都更多地负责他们应用程序的性能。我们看到APM关注的是开发人员，而不是将问题与特定的代码行、GIT提交和经历性能问题的客户子集捆绑在一起。\n由于应用程序环境复杂性的增加，APM变得更加重要。这增加了复杂性，使得APM对于避免性能降级变得更加关键。此外，APM工具还需要比以往更多的人能够访问。这意味着工具的设计必须适应DevOps团队中各个角色的特定需求。APM市场有一些重大的进步，其中一些是…。\n大数据有多大？没有官方的大小可以归类为大数据。基本上，大数据是那些对于传统的APM工具来说太大而无法处理和/或分析的数据集。\n例如，需要监控的容器或节点总数、日志文件的数量和吞吐量、API通信量等都在快速增加APM工具要处理的数据量。因此，APM解决方案必须找到处理日益复杂的数据的方法，这些数据来自爆炸性的基础设施、底层硬件、虚拟层和庞大的网络。\nAIOps代表“用于IT运营的人工智能”，包括但不限于：自动化、性能监控和事件关联。“今天，APM公司必须采用AIOps方法。这意味着，使用人工智能(AI)和机器学习来获取实时洞察力，并日益自动化IT操作。\n我们不应该满足于只监控性能的解决方案-提供图表和仪表板，但让您来寻找解决方案。取而代之的是，使用人工智能，您将获得可行的建议和自动化。\n机器学习技术和大数据是AIOps平台的两个主要方面。通过自动化，我们的目标是获得持续的洞察力，为修复和改进提供可操作的分析。\n数字体验监控(DEM)通过确定第一方系统和第三方服务如何影响最终用户体验来确定用户体验的优先顺序。\n正如Gartner所定义的：“数字体验监控(DEM)是一门可用性和性能监控学科，支持数字座席(人或机器)在与企业应用程序和服务交互时的操作体验和行为的优化。就本次评估而言，它包括针对基于网络和移动终端用户的真实用户监控(RUM)和综合交易监控(STM)。\n明智的做法是不仅监控应用程序性能，而且监控最终用户体验，因为用于访问应用程序的方法和技术在不断扩展，从而影响其数字体验。\n上周，我收到一位客户发来的电子邮件，他在过去4年里一直是APM巨头之一的忠实客户：\n嗨，海登，我想这将是值得放弃(公司名称被删除)，以一个成本更低的APM替代方案。最近，我觉得[公司名称已删除]对我们的问题诊断没有太大帮助，而且它的价格昂贵(目前为250美元/月)，而且他们已经删除了我们过去使用的重要功能(例如磁盘、网络、进程跟踪)。(=。如果您不同意，请告诉我。您有其他推荐的APM吗？你以前推荐过一个替代方案，但我找不到/记得是什么了？到目前为止，我发现的两个例子是：1.每天288K笔交易的https://scoutapm.com/info/pricing$99/月2.$https://raygun.com/new-relic-alternative$79/月的250,000条/月$199/月的1,000,000条/月其中很多都是根据每天或每月的交易或跟踪数量定价的。\n随着应用程序性能监控和管理的不断发展和改进，APM公司应该明智地确保它们对企业和小型企业客户都具有同等的可访问性和价值。随着物联网(IoT)的爆炸性增长以及5G和其他技术的出现，在未来十年，我们将看到许多初创企业和小企业前所未有地需要大规模和先进的APM解决方案！也就是说，很明显，在不久的将来，每种规模和类型的APM客户都将有许多优秀的APM解决方案可供选择！", "note_en": "Application Performance Monitoring (APM) first started in the late 1990s with companies such as Precise (acquired by Symantec, spun off and then acquired by Idera), Wily Technology (acquired by CA Technologies) and Mercury Interactive (acquired by HP Software Division).\n  In the 2000s APM tools continued to be acquired by larger vendors. Then over the past decade, the APM market has become very competitive, with major vendors – Dynatrace, AppDynamics (now owned by Cisco), CA Technologies (now owned by Broadcom), New Relic, Solarwinds and others – who’ve helped to catalyze APM.\n I asked 12 leading and emerging APM companies about their thoughts on the future of APM in 2020 and beyond and their role in shaping it. Read their answers below.\n Today, APM solutions are evolving to address the transformation of the way applications are built, delivered and accessed. In the past year or two, I’ve seen more than a dozen of my clients sign with APM giants or with other solutions such as Instrumental, DataDog, Appoptics, Site24x7, Raygun and others.\n     With the recent APM business acquisitions made by Cisco, Broadcom, Solarwinds and others, Application Performance Monitoring and Management has garnered even more attention and space for additional competitors looking to be leaders of APM, 2020 and onward.\n This is why I’ve decided to ask a few of these leading and emerging APM companies about their thoughts on the future of APM in 2020 and beyond and about their role in shaping it.\n   Regarding the future of APM, what will application performance monitoring and management look like in 2020 and beyond, and how will your company help shape the future of APM?\n     “Application Performance Monitoring (APM) has come a long way since the advent of digital transformation, and we are seeing more and more adoption of SaaS based APM tools. The future of APM, according to me, is in  supporting Serverless APM, APM support in Container Orchestration &amp; Microservices, and AI based data correlation across Infrastructure &amp; Network layers. At Site24x7, a SaaS based monitoring tool, we already have a full fledged APM Solution that helps DevOps team in troubleshooting performance problems in any application across all layers. Support for Serverless APM is already brewing inside and we will be ready to meet the market demands.”\n   “As business landscapes evolve and application complexity increases,  technology professionals will increasingly leverage APM tools to achieve high-level business goals. This is due to an increased focus on customer-centricity and the idea that downtime, poor connection, and slow performance could all equate to business losses. Integrating robust APM tools presents the opportunity to transform any business and create a strong competitive advantage, which we can expect to see more of in 2020 and beyond. SolarWinds will continue to address APM complexities in a way very few can— through our deep connection and commitment to tech pros and by offering easy-to-use, affordable solutions.”\n    “ Customers are all moving to distributed systems – containers, microservices and serverless functions are becoming commonplace. As a result this will require  clever methods to collect all errors and high latency traces,    seamlessly tie  that tracing data to the underlying infrastructure metrics, logs, browsers, mobile devices, IOT devices and  surface it in a single pane of glass  . With all the telemetry data in one place, vendors can not only show correlations but also suggest root cause to speed up the MTTR for developers.”\n      “APM expands to include more functionality within IT, Ops and Business including: APM will become more Open and Integrated, enabling different teams to choose best-of-breed solutions and easily integrate for improved insight, APM becomes much more Network Focused as application delivery depends on integrating with SaaS and Cloud – the network is the computer,  APM will be more Crowd-sourced and AI-driven so organizations can detect, fix and optimize their applications in real-time. Crowd-sourced datasets enable end-to-end systems performance prediction with improved modeling and APM will focus on End-user and Network Transformations as infrastructure continuously shifts to best serve the needs of business.”\n   ” We have definitely seen a  trend towards cloud-based network monitoring software. As a software company, it is important to adapt with the times and the market. Heading into 2020, we fully expect NetCrunch will have  cloud as well as AI capabilities. Remote probes will also play a major role in the future development of NetCrunch. We suspect others will follow.”\n   “Application Performance Monitoring (APM) is becoming more actionable and more insightful. At Raygun, we’ve delivered a modern APM offering that gives developers answers instead of just clues. Traditional APM solutions are very good at giving you hints as to where performance bottlenecks lie, but Raygun takes things one step further, showing what the code was doing under the hood including all the methods and queries.  APM tools of the future will also be leveraging more heavily on AI and machine learning, automatically raising into view the highest value improvements you can make, to give your customers better digital experiences.”\n   “APM will continue to adapt with log management, infrastructure &amp; network monitoring as well as SIEM products. As a result, this unified observability solution will provide visibility into the full stack, from apps to infra, and even user experience. This, combined with the power of application-specific metrics, will allow RevOps and BizOps teams to have the data analysis tools they need to make better business decisions. Sematext will help shape the future of APM by going beyond the 3 traditional pillars of observability with the full stack observability solution, Sematext Cloud, that  combines logs, metrics, traces &amp; real user data in order to provide you with actionable insights faster.“\n   “AIOps – By taking an AIOps approach supported by machine learning and AI, APM will move beyond monitoring and gain the ability to understand what’s going on but also to ability to drive the right intelligent action, automatically.  Unified, Cross-Stack Visibility – Monitoring of major cloud platforms moving to a native approach (i.e. not through extensions) will become a crucial requirement.  Scale of Data Ingestion Becomes Paramount – The rise of IOT means there are far more devices and data than people, with the number of IoT-connected global devices expected to reach 75 billion in 2025.\n   “APM will continue to play a major role, but the importance of actually finding the root-cause of a problem will increase further. And in order to find that root cause, it will be essential to  fuse information from APM tools with information from IT infrastructure monitoring tools to uncover where in the stack potential problems and bottlenecks lie. APM tools will thus need to offer this functionality or integrate with IT infrastructure monitoring tools and vice versa. We at Checkmk, for example, are planning to integrate with APM tools to help our customers’ operations and development teams to jointly identify the true root cause quickly.”\n   “Architectures and languages cycle in-and-out like jean jackets and skinny jeans. The one steady march forward? Developers – not sys admins and IT departments – are more in charge of their app’s performance than ever before.  We see APM focusing on the developer, tying problems to specific lines-of-code, git commits, and the subset of customers experiencing performance woes.”\n    APM has become more important because of the increase in complexity of application environments. This added complexity, makes APM even more critical to avoiding performance degradation. In addition, APM tools also need to be accessible to more people than ever before. This means that tools have to be designed to adapt to the specific needs of the individual roles within DevOps teams. There are some major advancements coming to the APM market, some of these are…\n   How big is big data? There is no official size to be classified as big data. Basically, big data is data sets that are too large for traditional APM tools to process and/or analyze.\n For example, the total number of containers or nodes that need to be monitored, the number and throughput of log files, volume of API communications, etc. are all rapidly increasing the quantity of data that APM tools have to process. As such, APM solutions have to find ways to process increasingly complex data, from an exploding array of software infrastructures, underlying hardware, virtual layers and vast networks.\n   AIOps stands for “Artificial Intelligence for IT Operations” which includes but is not limited to: automation, performance monitoring and event correlations. Today, APM companies must adopt an AIOps approach. Which means, using artificial intelligence (AI) and machine learning to derive real-time insights and increasingly automate IT operations.\n We should not have to settle for solutions that only monitor performance – providing graphs and dashboards but leaving it up to you to find solutions. Instead with AI, you get actionable recommendations and automation.\n Machine learning and big data are the two main aspects of an AIOps platform. The goal, through automation, is to receive continuous insights which provide actionable analytics for fixes and improvements.\n   Digital experience monitoring (DEM) prioritizes user-experience by identifying how first-party systems and third-party services affect the end-user experience.\n As defined by Gartner: “Digital experience monitoring (DEM) is an availability and performance monitoring discipline that supports the optimization of the operational experience and behavior of a digital agent, human or machine, as it interacts with enterprise applications and services. For the purposes of this evaluation, it includes real-user monitoring (RUM) and synthetic transaction monitoring (STM) for both web and mobile based end-users.”\n It is wise to not only monitor Application performance, but to also monitor end-user experience because the methods and tech used to access applications continue to expand, thus affecting their digital experience.\n   Last week, I received the following email from a client who’s been a loyal customer of one of the APM giants, for the past 4 years:\n Hi Hayden,  I&#39;m thinking it&#39;d be worth ditching [company name removed] for a lower cost APM alternative. Lately, I feel [company name removed] hasn&#39;t been very helpful in our diagnosis of issues and it&#39;s expensive (currently $250/mo ) and they&#39;ve removed important features we used to use (e.g. disk, network, process tracking). Let me know if you disagree. Do you have any alternative APM&#39;s you&#39;d recommend? You had previously recommended an alternative, but i can&#39;t find/remember what that was? Two that I&#39;ve found so far are:  1. https://scoutapm.com/info/pricing $99/mo for 288k transactions per day 2. https://raygun.com/new-relic-alternative $79/mo for 250,000 traces/month $199/mo for 1,000,000 traces/month A lot of these are priced by number of transactions or traces per day or month.\n As application performance monitoring and management continues to evolve and improve, APM companies would be wise to ensure they remain just as accessible and valuable to both enterprise and small business customers. With the explosion of  IoT (Internet of Things) and emergence of 5G and other technologies, over the next decade we will see many startups and small businesses requiring massive and advanced APM solutions, like never before! That said, it’s very clear, that in the near future, every size and type of APM customer will have a number of great APM solutions to choose from!", "posttime": "2020-07-24 00:10:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apm", "title": "我询问了12家APM公司关于APM的未来(2019年)", "title_en": "I asked 12 APM companies about the future of APM (2019)", "transed": 1, "url": "https://haydenjames.io/asked-apm-companies-about-the-future-of-apm/", "via": "", "real_tags": ["apm"]}, {"category": "", "categoryclass": "", "imagename": "4b52b89a2d680e8e3b9781a831931090.jpg", "infoid": 1013774, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因为互联网是一个陌生而复杂的地方，此时此刻，你的数字隐私的命运与在线留言板和评论区的命运交织在一起。而且，我们很抱歉地报告，事情看起来不是那么火爆。\n争论的焦点是看似无关的“赚取IT法案”。在共和党参议员林赛·格雷厄姆(Lindsey Graham)和一系列两党共同发起人的推动下，并于上周四由参议院司法委员会(Senate Judiciary Committee)投票表决的这项措施，表面上旨在打击在线儿童性虐待材料。然而，据接受Masable采访的隐私和安全专家表示，该法案既直接威胁到端到端加密，又承诺通过削弱第230条来刺激新的、持续的在线审查制度。第230条是1996年“通信体面法”(Communication Decency Act)的一项条款，旨在保护互联网提供商免受其用户行为的责任。\n正如我们经常能发现的那样，魔鬼在于细节。电子前沿基金会(Electronic Frontier Foundation)的政策分析师乔·穆林(Joe Mullin)表示，这是因为新修订的法案实质上赋予了州议员监管互联网的能力。他分析了该措施一旦成为法律，将带来的审查风险。\n穆林在一封电子邮件中解释说，所有50个州都将能够制定新的互联网规则，在线平台和网站将必须遵守这些规则。对新规则的唯一限制是，在某种程度上，它们必须与打击儿童性虐待的斗争相联系。如果网站不遵守新的州级互联网规则，它们将面临私人诉讼，并可能面临州级刑事起诉。\n这一担忧得到了美国公民自由联盟(ACLU)的响应，该联盟在7月1日的一封公开信中警告称，允许各州为[儿童性虐待材料]设定自己的平台责任标准，[赚取IT法案]的修订版允许各州制定不适当的标准，根据这些标准判断平台对用户生成内容的责任。\n如果这一点还不够清楚，本月早些时候，在一封写给民主党参议员黛安·范斯坦(Diane Feinstein)和印度麦金尼(India McKinney)EFF联邦事务主管格雷厄姆(Graham)的公开信中，他们预测，“赚取IT法案”将导致在线平台失去第230条豁免权。换句话说，在线公司可能会对用户生成的内容承担责任。这可能会激励那些公司主动停止提供我们都认为理所当然的互联网文化中不可磨灭的服务，比如留言板。\n为什么要有评论区、论坛、电子邮件服务或文件存储服务，如果你可能会为用户做的事情惹上大麻烦-即使在你不知情的情况下，穆林问道。在线平台将通过移除或不提供这些功能来对冲风险。\n而且，即使如果“赚取IT法案”成为法律，可能会有50条不同的州级规则存在，但并不是说生活在一个相对不插手的州就一定会免除你的责任。毕竟，当一家公司可以简单地根据最严格的州政府的要求量身定做一切时，为什么要不厌其烦地制定50种不同的政策，并发布50种不同的特定地点的产品呢？\n端到端加密是数字隐私的黄金标准。如果实现得当，它可以确保只有邮件的发件人和目标收件人才能阅读其内容。基本上，这意味着像政府、私人公司和黑客这样的第三方不会阅读你的信息、银行对账单和医生笔记。\n“赚取IT法案”严格来说是“消除对交互技术的滥用和严重忽视”的首字母缩写，它有一份联合发起人名单，其中包括许多长期以来反对消费者获得端到端加密的参议员。2016年，参议员范斯坦(Feinstein)与共和党参议员理查德·伯尔(Richard Burr)共同起草了一项法案，该法案或多或少会使端到端加密变得非法。范斯坦就是这样一位收入IT法案的联合发起人。\n“赚取IT法案”可能不像之前禁止端到端加密的努力那样明确，但专家们坚称，这同样是对苹果(Apple)等公司用来保护客户数据不受黑客攻击的一项技术的威胁。\n当今年3月5日首次在参议院提出《赚取IT法案》时，它直接威胁到了端到端加密的合法性-以至于早在4月份，免费、开源、安全的即时通讯应用Signal就发表了一篇博客文章，警告称，如果该法案获得通过，它在美国的运营能力将面临风险。\n“赚取IT法案”将第230条的保护变成了一个虚伪的谈判筹码，警告信号。从更高的层面上讲，该法案提出的制度是，公司必须通过遵循一套由委员会设计的最佳实践来获得第230条的保护，而这些最佳实践极不可能允许端到端加密。\n该法案上周进行了修改，以消除部分担忧，但这些修改还不足以说服真正的隐私专家。斯坦福大学互联网与社会中心负责监控和网络安全的副主任Riana Pfefferkorn在7月6日的一篇博客文章中也明确表示了这一点。她写道，参议员帕特里克·莱希(Patrick Leahy)的修正案并不是一些人拿出的灵丹妙药，因为它回答了批评人士的担忧，即如何赚取IT可能会阻碍加密并损害网络安全。\n穆林对此表示同意，并警告说，该法案可能会导致立法者坚持要求提供商在用户的设备、信息和对话被加密之前扫描它们。\n他说，州立法者可以很容易地绕过莱希修正案，要求进行某种形式的客户端扫描，这已经是反加密部队一年来的发展方向。\n免费反恶意软件服务Objective-See的创始人、前美国国家安全局黑客、JAMF首席安全研究员帕特里克·沃德尔(Patrick Wardle)呼应了穆林的观点，他指出，反隐私人群的收益IT法案看起来更像是一样的。\n[这]似乎只是政府的最新举措。因为削弱了加密，他在推特上的一条直接消息中说。希望它不会去任何地方。\n沃德尔反对“赚取IT法案”的原因有很多，不仅仅是因为他曾为美国国家安全局工作。2017年，Wardle发现了一种恶意软件菌株，它已经感染了美国数百台电脑，并被用来通过网络摄像头监视毫无戒备的受害者。2018年初，一名俄亥俄州男子被控在数千台电脑上安装恶意软件。\n沃德尔反对“赚取IT法案”，他确实帮助将一名被控制作儿童色情作品的人绳之以法，这应该是一个巨大的警示，表明该措施并不像支持者所说的那样直截了当。\n重要的是，该法案还没有通过；它甚至还没有提交参议院进行全票表决。即使是EFF也不能说该法案何时甚至是否会获得全票。\n这并不意味着，如果它最终成为法律，它对你的隐私和我们所知的互联网构成的威胁就不会变得不那么真实。", "note_en": "Because the internet is a strange and complicated place, the fate of your digital privacy is, at this very moment, intertwined with that of online message boards and comment sections. And things, we&#39;re sorry to report, aren&#39;t looking so hot.\n At issue is the seemingly unrelated  EARN IT Act. Pushed by Republican Sen. Lindsey Graham and a host of bipartisan co-sponsors, and voted on by the Senate Judiciary Committee last Thursday, the measure ostensibly aims to combat online child sexual abuse material. However, according to privacy and security experts who spoke with Mashable, the bill both directly threatens end-to-end encryption and promises to spur new and sustained online censorship by weakening  Section 230 — a provision of the Communication Decency Act of 1996 that protects internet providers from being held liable for their users&#39; actions.\n The devil, as it so often can be found, is in the details. That&#39;s because the newly  amended version of the bill essentially gives state lawmakers the ability to regulate the internet, according to Joe Mullin, a policy analyst with the Electronic Frontier Foundation, who broke down the censorship risks posed by the measure should it become law.\n &#34;All 50 states will be able to write new Internet rules that online platforms and websites will have to follow,&#34; Mullin explained in an email. &#34;The only limit on the new rules is that they will have to relate, in some way, to the fight against child sexual abuse. If websites don&#39;t follow the new state-level internet rules, they&#39;ll be exposed to private lawsuits and potentially state-level criminal prosecutions.&#34;\n This concern is echoed by the ACLU which, in a  July 1 open letter, warned that &#34;[by] allowing states to set their own standards for platform liability for [child sexual abuse material], the amended version [of the EARN IT Act] allows states to create inappropriate standards by which platform responsibility for user-generated content should be judged.&#34;\n In case that&#39;s not clear enough, earlier this month, in an  open letter addressed to Democratic Sen. Diane Feinstein and Sen. Graham, EFF director of federal affairs, India McKinney, predicted that the EARN IT Act would lead to the &#34;loss of Section 230 immunity&#34; for online platforms. In other words, online companies could be held liable for user-generated content. This could inspire those companies to proactively discontinue offerings — like message boards — that we all take for granted as an indelible part of internet culture.\n &#34;Why have a comments section, or a discussion forum, or an email service, or file storage services,  if you could get in big trouble for something that a user did — even without your knowledge,&#34; asked Mullin. &#34;Online platforms will hedge their risk by removing or not providing these features.&#34;\n And, even though the possibility of 50 distinct state-level rules exists if the EARN IT Act becomes law, it&#39;s not like living in one relatively hands-off state would necessarily exempt you. Why would a company go to the trouble of crafting 50 different policies and releasing 50 different location-specific offerings, after all, when it could simply tailor everything to the requirements of the most restrictive state government?\n    End-to-end encryption is the gold standard in digital privacy. When implemented properly, it ensures that only a message&#39;s sender and intended recipient can read its contents. Basically, it means that third parties like governments, private companies, and hackers aren&#39;t reading your messages, bank statements, and doctors&#39; notes.\n The EARN IT Act, which technically is an acronym for the &#34;Eliminating Abusive and Rampant Neglect of Interactive Technologies,&#34; has a list of co-sponsors that include many Senators long in opposition to the idea of consumer access to end-to-end encryption. In 2016, Sen. Feinstein, one such EARN IT Act co-sponsor,  co-authored a bill with Republican Sen. Richard Burr that would have more or less made end-to-end encryption illegal.\n The EARN IT Act may not be as explicit as previous efforts to ban end-to-end encryption, but experts insist it is likewise a threat to a technology used by companies such as Apple to protect customers&#39; data from hackers.\n  When initially introduced in the Senate on March 5 of this year, the EARN IT Act directly threatened the legality of end-to-end encryption — so much so, that back in April, Signal, a free and open-source, secure messaging app,  published a blog post warning its ability to operate in the U.S. was at risk should the measure pass.\n &#34;The EARN IT act turns Section 230 protection into a hypocritical bargaining chip,&#34;  warned Signal. &#34;At a high level, what the bill proposes is a system where companies have to  earn Section 230 protection by following a set of designed-by-committee &#39;best practices&#39; that are extraordinarily unlikely to allow end-to-end encryption.&#34;\n The bill was amended last week to address some of those fears, but the changes weren&#39;t enough to convince actual privacy experts. Riana Pfefferkorn, the associate director of surveillance and cybersecurity at Stanford&#39;s Center for Internet and Society, made as much clear in  a July 6 blog post. She wrote that  the amendment by Sen. Patrick Leahy is &#34;not the silver bullet that some are holding it out as in terms of answering critics&#39; concerns about how EARN IT could potentially discourage encryption and harm cybersecurity.&#34;\n Mullin agrees, and cautions that the bill could result in lawmakers insisting providers scan users&#39; devices, messages, and conversations before they are ever encrypted.\n &#34;State lawmakers could easily get around the Leahy amendment by demanding some form of &#39;client side scanning,&#39;&#34; he said, &#34;which has been the direction of the anti-encryption forces for about a year now.&#34;\n Patrick Wardle, principal security researcher at Jamf, founder of the free anti-malware service  Objective-See, and ex-NSA hacker, echoed Mullin in noting that the EARN IT Act looks to be more of the same from the anti-privacy crowd.\n &#34;[This] seems just to be the latest push by the govt. for weakening encryption,&#34; he said in a Twitter direct message. &#34;Hopefully it doesn&#39;t go anywhere.&#34;\n Wardle&#39;s opposition to the EARN IT Act is notable for many reasons, and not just because he used to work for the NSA. In 2017,  Wardle uncovered a malware strain that had infected hundreds of computers in the U.S. and was used to spy on unsuspecting victims through their webcams. In early 2018, an  Ohio man was charged with installing the malware on thousands of computers.\n That Wardle — who literally helped bring to justice someone accused of an effort to &#34; produce child pornography&#34; — opposes the EARN IT Act should be a huge tip-off that the measure isn&#39;t as straightforward as its proponents suggest.\n  Importantly, the bill hasn&#39;t passed yet; it hasn&#39;t even been brought to the floor of the Senate for a full vote. Not even the EFF could say when or even  if the bill will get a full vote.\n That doesn&#39;t mean the threat it poses to both your privacy, and the internet as we know it, is any less real should it eventually become law.", "posttime": "2020-07-24 00:10:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,worry,法案", "title": "为什么你绝对应该担心反隐私的赚取IT法案", "title_en": "Why you should absolutely worry about the anti-privacy EARN IT Act", "transed": 1, "url": "https://mashable.com/article/earn-it-act-threatens-privacy-encryption-section-230/", "via": "", "real_tags": ["应该", "worry", "法案"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013773, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "面对许多学校将会上网的现实-只有在今年秋天，家庭才会寻找解决方案-这可能会加剧不平等。\nE Lyssa Katz是圣塔莫尼卡三个孩子的母亲，她正在发展一项婚介服务，将家庭与导师联系起来，她称之为“Zutors”-这个词她正在注册商标。\n卡茨告诉“卫报”：“Zutor的角色是家长的家教、保姆和天使。”卫报可以接手家长的要求，帮助孩子做在线作业，并在“课间休息”时带他们出去。\n卡茨的客户既有富人和名人，也有需要照看孩子的普通人，因为他们必须工作，因为他们不能照看孩子。卡茨说，她接到了远在汉普顿的父母的电话。\n相亲费从700美元到1000美元不等(GB 549到GB 785)，Katz和她的团队将面试导师候选人，进行背景和推荐人调查，然后将他们与合适的家庭进行匹配。\n家教和托儿的费用从每小时20美元到65美元(GB 15到GB 51)不等，如果聘请家教每天5小时，每周5天，那么每周的费用将达到1,625美元(1,276 GB)-尽管Katz说费用根据服务类型的不同而有所不同。\n“有些服务收费高达每小时125美元(98 GB)。这里是洛杉矶。卡茨说：“对一些人来说，钱并不是一个真正的对象，他们说‘我想为我的孩子们做这件事，我会为他们做任何我能做的事’。”\n随着美国学区敲定秋季学期的计划，一些学区的课程将继续在线上课，一些家长已经开始与其他家庭联手组成“豆荚”，并安排自己的教育形式。\n这些安排有不同的形式，从Katz昂贵的精品服务到不那么正式的安排，从考虑租用公寓空间作为DIY“微型学校”的大本营的家庭，到寻求虚拟导师帮助的不那么正式的安排，虚拟导师可以每周补充几个小时的在线教学。\n这些安排的兴起证明了在史无前例的学校停课情况下，许多家长对孩子的健康和学业发展的极度担忧。但这也引发了人们的疑问，即这些安排是否会加剧长期存在的教育隔离和不平等模式。\n并不是所有的家庭都很富有，他们总是在传统的学校系统之外寻找解决方案。例如，在家上学允许父母在公共教育系统之外合法运作。\n但与必须向所有学生提供服务的学区相比，像私人家教这样的资源对那些有能力支付费用的人来说是最容易获得的。改造公共教育中心主任罗宾·莱克(Robin Lake)表示，家庭选择其他人加入他们的豆荚的方式-归根结底是相似的社区、收入或能力水平-有可能加剧现有的不平等。\n“我认为我们将看到的是家庭自行选择加入非常相似的群体。这种隔离在我们的学校系统中已经存在了。这只会加剧它，“莱克说。\n学校按种族和收入进行了深刻的分层，收入较高的学区在每个学生的教育项目上拥有更多的预算，富裕的父母实际上能够通过在昂贵的地区拥有房子来购买高档学校。\n在加利福尼亚州，就像在每个州一样，这些差异也反映在学生的成绩上。2019年，近70%的黑人学生和60%的拉丁裔学生未能达到州政府的识字标准，而只有24%的亚裔学生和35%的白人学生未能达到标准。\n研究表明，学校关闭将导致大多数学生失去学习进展，一些学生预计将失去相当于整整一学年的学习进展。不成比例地无法接触设备和互联网的有色人种学生预计会失去最多。\n南加州大学罗西尔教育学院(Rossier School Of Education)教育政策副教授摩根·波利科夫(Morgan Polikoff)表示，虽然现在预测私人家教的兴起将如何影响差距还为时过早，但差距的扩大将取决于这一趋势变得有多普遍。\n波利科夫说：“如果这只是几%的非常富有的家庭选择他们的孩子参加这种安排的情况，我真的看不出这与他们把孩子送到一些精英私立学校有什么不同。”\n他补充说：“如果这是一种影响更多家庭的更广泛的现象，那么我认为这可能会导致有意义的成就差距的扩大。”\n旧金山一位有营销背景的家长Lian Chikako Chang最近几周看到了对辅导服务的巨大需求。“这不再是一个利基话题了，”张说。\n在为有兴趣组建豆荚和微学校的家长创建了一个Facebook群后的几秒钟内，张就有了她的第一个成员。13天后，已有1万多名家长加入或要求加入她的小组。\n张承认，该集团发展如此之快，以至于没有时间解决所有的后勤问题，也没有时间建立保护家庭不被不公平排除在外的方式，但他表示，该集团从一开始就担心对公平的影响。\n她说，重要的是努力找到一种方式，让父母以一种不存在固有歧视的方式相互询问私人问题。例如，父母可能会问彼此，家庭成员的工作是否会让他们进入社区，而没有意识到这个问题可能会排除必要工人的子女-黑人和棕色社区占据了不成比例的工作。\n“我们听到了人们对股权的担忧，并同意这是严重的。但这很艰难。家长有责任在学校做不到的时候做好安排。“张说。\n随着学校继续关闭，这些责任只会变得越来越大。例如，倡导者警告说，残疾学生在他们通常亲自接受的教育服务上可能会受到亏待。莱克说，父母想要填补这一空白是可以理解的。\n“我们是否要评判和羞辱那些孩子有特殊需要的家庭，因为他们创造了学校根本没有提供的机会？”我知道我不会，“雷克说。\n她指出，像奥克兰REACH这样的组织-由来自奥克兰表现最差的学校的学生和家长组成-就是一个团体创造自己的解决方案的例子。REACH已经创建了一个强大的在线暑期学校项目，并计划持续到本学年。\n该组织的联合创始人兼执行董事拉基莎·杨(Lakisha Young)表示，她仍然对她所在社区面临的不平等深表担忧，但她希望人们理解家长走到一起，为他们的社区创造另类教育模式的重要性。\n“这就是我感到周围有一种志趣相投的人的感觉。家长们起到了带头作用。我只是不想让人们谈论豆荚，认为这是唯一的解决方案，“她说。\n“根据我们系统的表现，这场比赛不会赢也不会输。”\n推动市场的不仅仅是父母和媒人。教育工作者，一些人失业，一些人因为担心感染而犹豫是否回到课堂，他们也在寻找发挥自己技能的方法。\n玛娅·拉扎尔(Maia Lazar)在过去四年里一直在洛杉矶地区担任代课教师，她是张的Facebook群的成员，她希望被愿意每周支付她1000美元(785 GB)的家庭或团体聘用，专门在他们的豆荚里授课-这一安排将把她接触病毒的风险降至最低。\n拉扎尔说，她也对公平表示担忧，但她不认为私下提供服务谋生的教师应该因为这样做而感到羞耻。\n“就个人而言，教师不应该因为这样做而受到批评，”她说，并补充说，她正在帮助组织愿意将自己的时间贡献给那些聘请不起家教但需要帮助的家庭的教育工作者。\n最近几天，Facebook小组的一些成员提出了创建更具包容性的豆荚的想法，包括努力从黑人或拉丁裔家庭招收学生，并赞助他们的费用。\n但拉扎尔认为这种做法令人担忧。“你看到人们说他们愿意赞助有色人种，但这也可能是有问题的，因为你假设不是所有有色人种都有钱，”她说。\n与此同时，一些教育工作者正在接受豆荚、微学校和私人家教是图景的一部分-至少在加利福尼亚州是这样，那里的大多数学校不太可能在短期内亲自恢复-并将重点转向如何让它们变得更加公平。\n教育信托-韦斯特(Education Trust-West)是一家专注于教育公平的研究和倡导组织，其执行董事伊莉莎·史密斯·阿里拉加(Elisha Smith Arrillaga)说，最近几天，她回答了很多关于豆荚的问题。\n她说：“我们不能支配家长个人的选择，但我们还没有做足够的工作来确保我们的弱势学生得到他们需要的东西，无论高收入父母在做什么。”\n“这些豆荚的出现意味着我们需要更迫切地寻找方法，让每个学生都能得到他们需要的一切。”", "note_en": "Faced with the reality that many schools will be online-only this fall, families look for solutions – which could exacerbate inequality\n   E lyssa Katz, a Santa Monica mother of three, is growing a  matchmaking service to connect families with tutors, or “Zutors”, as she calls them – a word she’s in the process of trademarking.\n “The role of a Zutor is a tutor, a nanny, and an angel for a parent,” Katz told the Guardian, someone who can take over parental demands, help children with online homework and take them outside when it’s time for “recess”.\n  Katz’s clients range from the rich and famous, to everyday people who need childcare because they can’t look after their children while they have to work. Katz said she had gotten calls from parents as far away as the Hamptons.\n For a matchmaking fee that can range from $700 to $1,000 (£549 to £785), Katz and her team will interview tutor candidates, run background and reference checks, then match them to the right families.\n  Fees for tutors and child care can range from $20 to $65 (£15 to £51) an hour, which would amount to $1,625 (£1,276) a week if a tutor was hired for five hours a day, five days a week – though Katz said fees vary by the type of service.\n “Some services are charging as much as $125 (£98) an hour. This is LA. There are some people for whom money isn’t really an object, people who say ‘I want this for my kids and I’ll do anything I can for them’,” Katz said.\n As US school districts finalize plans for the fall semester and classes in some districts are set to remain online, some parents have begun teaming up to form “pods” with other families and arrange their own forms of education.\n The arrangements come in different forms, from Katz’s expensive, boutique service to families considering renting apartment space to serve as a home base for DIY “microschools”, to less formal arrangements that enlist the help of virtual tutors who can supplement online instruction for a couple of hours a week.\n The rise of these arrangements is a testament to the desperate worry of many parents over their children’s health and academic development amid unprecedented school closures. But it has also raised questions about whether these kinds of arrangements exacerbate longstanding patterns of segregation and inequity in education.\n  Families, not all of them wealthy, have always looked for solutions outside of the traditional school system. Homeschooling, for example, allows parents to legally operate outside of the public education system.\n But in contrast to a school district that must provide services to all students, resources like private tutors are most easily accessible to those who can pay. And the ways families select others to join their pod – which come down to similar neighborhoods, incomes or ability levels – has the potential to reinforce existing inequalities, said Robin Lake, the director of the Center on Reinventing Public Education.\n “I think what we will see is families self-selecting into pretty similar groups. That kind of segregation already exists in our school system. This would just exacerbate it,”  said Lake.\n   Schools are profoundly stratified by race and income, with higher-income school districts commanding bigger budgets for education programs per student, and affluent parents effectively able to buy into exclusive schools by owning houses in expensive areas.\n In California, as in every state, those divides are reflected in student outcomes, as well. Nearly 70% of Black students and 60% of Latinos failed to meet state standards for literacy in 2019, while just 24% of Asians and 35% of white students fell below standards.\n Research suggests that school closures will result in a loss of learning progress for most students, with some expected to lose the equivalent of a full academic year. Students of color, who disproportionately lack access to devices and the internet, are expected to lose most.\n  While it’s too soon to forecast how the rise of private tutors will affect disparities, Morgan Polikoff, an associate professor of education policy at USC’s Rossier school of education, said the growth of the gap will depend on how common the trend becomes.\n “If it’s just a case of a couple percent of very wealthy families opting their kids into this kind of arrangement, I don’t really see how that’s any different from them sending their kids to some elite private school,” said Polikoff.\n “If it’s a wider-spread phenomenon that affects more families, then I think it could lead to meaningful widening of achievement gaps,” he added.\n  Lian Chikako Chang, a San Francisco-based parent with a background in marketing, has seen a huge demand for tutoring services in recent weeks. “This isn’t a niche topic any more,” Chang said.\n Within seconds of creating a Facebook group for parents interested in forming pods and microschools, Chang had her first member. Thirteen days later, more than 10,000 parents had joined or requested to join her group.\n Chang concedes that the group has grown so quickly it hasn’t had time to iron out all logistics or build in ways to protect families from being excluded unfairly, but said the group has been concerned about implications for equity from the start.\n Important, she said, is trying to find a way for parents to ask each other personal questions in a way that isn’t inherently discriminatory. Parents may ask each other, for example, whether a family member’s work brings them into the community without realizing the question can exclude children of essential workers – jobs held disproportionately by Black and brown communities.\n “We hear the concerns for equity, and agree it’s serious. But it’s tough. Parents have a responsibility to make arrangements when the schools cannot,” Chang said.\n   Those responsibilities have only grown larger as school closures continue. Advocates have warned for example that  students with disabilities  can be short-changed on the education services they typically received in person. It’s understandable for parents to want to fill that void, said Lake.\n “Are we going to pass judgment and shame families whose children have special needs for creating an opportunity their schools didn’t provide at all? I know I won’t,” Lake said.\n She points to organizations like  Oakland Reach – made up of students and parents from Oakland’s lowest-performing schools – as example of a group creating their own solutions. Reach has created a robust online summer school program it plans to continue into the academic year.\n Lakisha Young, the organization’s co-founder and executive director, says she remains deeply concerned about the inequities facing her community, but wants people to understand the importance of parents coming together to create alternative models of education that work for their communities.\n “That’s what I feel a kindred spirit around. Parents are taking the lead. I just don’t want people talking about pods and thinking that’s the only solution,” she said.\n “This game isn’t going to be won or lost based on what our systems are doing.”\n  It’s not just parents and matchmakers driving the market. Educators, some out of work, some hesitant to return to the classroom for fear of infection, are also searching for ways to put their skills to use.\n Maia Lazar, who has been a substitute teacher in the Los Angeles area for the past four years, is a member of Chang’s Facebook group and is hoping to be hired by a family or group willing to pay her $1,000 (£785) a week to teach exclusively to their pod – an arrangement that would minimize her exposure to the virus.\n Lazar said she shares a concern for equity, but doesn’t believe teachers who privately offer their services to make a living should be shamed for doing so.\n “Individually, a teacher shouldn’t be criticised for doing this,” she said, adding that she is helping to organize educators willing to donate their time to families who can’t afford to hire a tutor but want assistance.\n  In recent days, some members of the Facebook group have floated ideas for creating more inclusive pods, including efforts to recruit students from Black or Latinx families and sponsor their fees.\n But Lazar sees that approach as fraught. “You’re seeing people say that they’re willing to sponsor a person of color, but that can also be problematic, because you’re assuming all people of color don’t have means,” she said.\n Meanwhile, some educators are accepting that pods, microschools and private tutoring are part of the picture – at least in California, where the majority of schools are unlikely to resume in person anytime soon – and are turning their focus instead on how to make them more equitable.\n Elisha Smith Arrillaga, the executive director of the Education Trust – West, a research and advocacy organization focused on educational justice, said she had been fielding a lot of questions about pods in recent days.\n “We can’t dictate individual parent choices, but we haven’t done enough to make sure our vulnerable students are getting what they need regardless of what high-income parents are doing,” she said.\n “These pods arising means that we need to even more urgently look for ways to get every student everything they need.”", "posttime": "2020-07-24 00:09:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "豆荚,pandemic,学校", "title": "流行病豆荚和Zutors的兴起：父母在Covid中转向私立学校", "title_en": "Rise of pandemic pods and 'Zutors': parents turn to private schooling amid Covid", "transed": 1, "url": "https://www.theguardian.com/education/2020/jul/23/schooling-children-coronavirus-tutors-zoom", "via": "", "real_tags": ["豆荚", "pandemic", "学校"]}, {"category": "", "categoryclass": "", "imagename": "d9da379c09ae29e99b978ed596761526.png", "infoid": 1013772, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果联合创始人史蒂夫·沃兹尼亚克(Steve Wozniak)起诉YouTube，指控YouTube平台上比特币免费赠品视频泛滥。这些视频虚假地使用了沃兹尼亚克和其他名人的名字-包括埃隆·马斯克、比尔·盖茨和Etherum创始人维塔里克·布特林-以使骗局具有合法性。\n骗子劫持了流行的YouTube账号，并更改了他们的名字，使它们看起来像是沃兹尼亚克等名人或苹果等公司的官方账号。然后，他们播放了一段直播视频，视频中显示了这位名人讨论加密货币或相关话题的旧镜头。视频旁边还有一条短信，声称如果有人把比特币寄到特定的地址，这位名人会寄回两倍的金额。\n除了沃兹尼亚克，原告还包括十几名上当受骗的人，他们损失了价值从几美元到4万美元不等的比特币。总体而言，像这样的加密货币诈骗给受害者造成了数百万美元的损失。\nYouTube的一位发言人通过电子邮件告诉Ars，我们认真对待滥用我们平台的行为，当我们发现有欺诈或冒充等违反我们政策的行为时，我们会迅速采取行动。YouTube表示，在2020年第一季度，该公司删除了220万个视频，关闭了170万个垃圾邮件、诈骗和欺骗性做法的账户。\n但原告辩称，YouTube在杜绝这些加密货币骗局方面做得远远不够。沃兹尼亚克的妻子珍妮特说，自5月份以来，她已经就这些骗局联系了YouTube无数次。原告指出，YouTube拥有复杂的工具来识别令人反感的活动。然而，他们似乎并没有采取明显的措施，比如过滤掉使用比特币赠品等术语的视频。\n诉讼还指出了推特(Twitter)的例子，该公司过去一直受到此类骗局的困扰，但近年来已采取措施杜绝此类骗局。原告辩称，对Twitter的打击将诈骗者推到了YouTube，他们在过去几年里在YouTube上蓬勃发展。\n归根结底，YouTube为杜绝这些视频做了多少努力可能并不重要。这是因为“通信正义法”第230条规定在线平台对用户提交的内容享有广泛的豁免权。网站拥有豁免权，即使它们很少或根本不做任何事情来打击用户发布的令人反感的内容。\n预计到这一辩护，原告试图将他们的诉讼与普通的第230条案件区分开来。但这些论点是否会成功并不明显。例如，沃兹的律师辩称，这些诈骗视频是明目张胆的刑事犯罪行为，甚至不受美国第一修正案的保护。这可能是真的，但不太可能挽救这场诉讼。毕竟，法院维持了第230条的豁免权，即使在用户传播儿童色情作品的情况下也是如此。\n原告辩称，YouTube不仅仅是被动地托管这些视频。YouTube的推荐算法向加密货币发烧友推广这些视频，并针对这些视频销售广告--直接从诈骗中获利。但这也可能是一个艰难的推销；法院一再裁定，网站享有第230条的保护，即使它们故意推广有问题的第三方内容。\n但是，虽然沃兹的诉讼在法律上站不住脚，但它在舆论法庭上仍可能具有重大意义。被硅谷最受爱戴的人物起诉可能会迫使YouTube更加严肃地对待加密货币诈骗问题。\n更重要的是。这一点登上了头条，有望防止一些人上当受骗。此外，它还会告诉每个上当受骗的人，史蒂夫·沃兹尼亚克已经尽其所能阻止了这一事件，他们的损失完全不是他的错。", "note_en": "Apple co-founder Steve Wozniak has sued YouTube over the proliferation of &#34;bitcoin giveaway&#34; scam videos on the YouTube platform. The videos falsely use the names of Wozniak and other celebrities—including Elon Musk, Bill Gates, and Ethereum founder Vitalik Buterin—to give the scams legitimacy.\n Scammers hijack popular YouTube accounts and change their names so that they appear to be the official accounts of celebrities like Wozniak or companies like Apple. They then broadcast a &#34;live&#34; video showing old footage of the celebrity discussing cryptocurrency or related topics. Alongside the footage is text claiming that if someone sends bitcoin to a particular address, the celebrity would send back double the amount.\n Along with Wozniak, the plaintiffs include more than a dozen individuals who were taken in by the scam, losing bitcoins worth anywhere from a few dollars to more than $40,000. In total, cryptocurrency scams like this have cost victims millions of dollars.\n &#34;We take abuse of our platform seriously, and take action quickly when we detect violations of our policies, such as  scams or  impersonation,&#34; a YouTube spokesperson told Ars by email. YouTube says that in the first quarter of 2020, the company removed 2.2 million videos and disabled 1.7 million accounts for &#34;spam, scams, deceptive practices.&#34;\n But the plaintiffs argue that YouTube isn&#39;t doing nearly enough to stamp out these cryptocurrency scams. Wozniak&#39;s wife, Janet, says that she has contacted YouTube numerous times since May about the scams. The plaintiffs point out that YouTube has sophisticated tools for identifying objectionable activity. Yet they don&#39;t seem to be taking even obvious steps like filtering out videos that use terms like &#34;bitcoin giveaway.&#34;\n The lawsuit also points to the example of Twitter, which had been plagued by these kinds of scams in the past but has taken steps to stamp them out in recent years. The plaintiffs argue that the Twitter crackdown pushed scammers to YouTube, where they have thrived for the last couple of years.\n  Ultimately, it may not matter how much YouTube has done to stamp out these videos. That&#39;s because Section 230 of the Communications Decency Act provides online platforms with broad immunity for user-submitted content. Sites have immunity even if they do little or nothing to combat objectionable content posted by users.\n Anticipating this defense, the plaintiffs try to distinguish their lawsuit from run-of-the-mill Section 230 cases. But it&#39;s not obvious those arguments will be successful. For example, Woz&#39;s lawyers argue that the scam videos are &#34; blatant criminal  conduct that is not even arg uably protected by the First Amendment.&#34; That might be true, but it isn&#39;t likely to save the lawsuit. After all, the courts have  upheld Section 230 immunity even in cases where users were distributing child pornography.\n The plaintiffs argue that YouTube did more than passively host the videos. YouTube&#39;s recommendation algorithms promoted the videos to cryptocurrency enthusiasts and sold ads against the videos—directly profiting from the scams. But that could also be a hard sell; courts have  repeatedly held that sites enjoy Section 230 protections even when they deliberately promote problematic third-party content.\n But while Woz&#39;s lawsuit is on shaky ground legally, it could still be significant in the court of public opinion. Being sued by one of Silicon Valley&#39;s most beloved figures could pressure YouTube into taking the problem of cryptocurrency scams more seriously.\n  More importantly. This goes into the headlines and will hopefully prevent some from falling for this scam. Plus it will tell everyone who fell for this scam that Steve Wozniak has done everything he could to prevent it and it isn&#39;t his fault at all that they lost money.", "posttime": "2020-07-23 23:42:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,比特币,赠送,sues", "title": "沃兹起诉YouTube使用他的名字进行“比特币赠送”诈骗视频", "title_en": "Woz sues YouTube over “bitcoin giveaway” scam videos using his name", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/woz-sues-youtube-over-bitcoin-giveaway-scam-videos-using-his-name/", "via": "", "real_tags": ["youtube", "比特币", "赠送", "sues"]}, {"category": "", "categoryclass": "", "imagename": "8b5928258a74884311489dd308dae562.png", "infoid": 1013770, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "曙光健康的三位联合创始人亚历克斯·阿尔瓦拉多(Alex Alvarado)、西达斯·西丹比(Siddarth Cidambi)和卢克·默尔卡多(Luke Mercado)要么与医疗行业的初创公司合作，要么就医疗行业咨询了几年，然后决定推出他们的新初创公司。\n这位创始人在接受采访时说，对于阿尔瓦拉多来说，他的兄弟从12岁起就一直在与抑郁症作斗争，这个问题是个人的。就在两年前，阿尔瓦拉多接到一个电话，告诉他，他的兄弟在数十年的抗争之后试图结束自己的生命。\n就在那时，阿尔瓦拉多开始直面目前的治疗方法是多么地支离破碎。他的家人曾试图为阿尔瓦拉多的弟弟找到始终如一的护理，但治疗师费用昂贵，偏远，等待名单长达数周，而且与青少年(特别是非白人青少年)有关的问题也很难解决。\n阿尔瓦拉多的哥哥并不孤单。阿尔瓦拉多说，美国五分之一的青少年已经或将会有心理健康问题，而国家对新冠肺炎疫情的无效反应只会加剧这个问题。据统计，目前美国有700万青少年有心理健康问题，抑郁和焦虑的比例正在上升。\n与曙光健康公司合作的10名临床医生组成的团队在循证护理方面有着深刻的经验，Alvarado预计他们咨询的大多数患者将在这些临床医生的指导下接受某种形式的行为治疗。\n对于经历不那么严重的心理健康问题的青少年，公司有一个由“训练有素的听众”组成的团队提供支持。\nAlvarado和Cidambi都曾在咨询公司Oliver Wyman工作，Mercado和Alvarado是从Jiff认识的，Jiff是一家医疗初创公司，专注于为公司员工提供健康福利，最终被Castlight Health收购。\n为了确保他们的心理健康诚意，该公司从斯坦福头脑风暴实验室(BrainStorm Lab)请来了Neha Chaudary博士，该实验室专注于心理健康方面的创新。“他们实际上是从头开始设计我们临床项目的人，”阿尔瓦拉多说。\nAlvarado说，该公司目前正在与旧金山湾区的20所学校和儿科团体合作，专注于治疗13岁至19岁的青少年。\n目前，学校和儿科团体都在将患者转介给该公司，护理费用要么通过保险支付，要么通过每周89美元的费用支付。\n“这是一个全方位的治疗方案，”阿尔瓦拉多说。“在我们看来，(与传统疗法相比)这是一种进步，因为你不仅得到了个性化的一对一治疗，而且还获得了围绕特定时间点的课程。”\nCidambi说，对于青少年来说，这不仅仅是为了防止某些行为的具体干预。这也是为了建立应对机制，这样青少年就可以更好地应对成年后的心理健康压力。\n阿尔瓦拉多强调，该项目不是为任何感到有点压力的青少年或只是担心孩子表现的父母准备的。在青少年被录取之前，会与青少年和家长进行长达一小时的招生咨询。\n而且该公司已经拒绝了一些潜在客户，因为他们就是不需要这种治疗。“我们的目标不只是让任何人接受治疗。”\nAlvarado不愿透露目前有多少学生从旧金山湾区的合作学校接受治疗，并表示这些学校是旧金山湾区公立和私立机构的混合体。\n“我们在学校的主要触点将是学校辅导员或健康协调员，”Cidambi说。黎明健康不支付转介费用，但确实联系了学校顾问来推销其服务。\n该公司远不是唯一家试图为青少年提供在线咨询的服务，青少年咨询是一项号称拥有5000名治疗师的服务，其服务每周从80美元到100美元不等。\n阿尔瓦拉多说：“我们正在做的事情的美妙之处在于临床计划与技术的结合。”“我们总是想让治疗师参与进来。我们正在开发一款移动应用程序…。也就是沟通…。并能让患者自己做一些运动，但我们从来不相信它会是一款独立的APP。“", "note_en": "Alex Alvarado, Siddarth Cidambi, and Luke Mercado, the three co-founders of Daybreak Health, either worked with startups in the health care industry or consulted on the healthcare industry for a few years before deciding to launch their new startup.\n For Alvarado, whose brother has been struggling with depression since he was twelve years old, the issue is personal, the founder said in an interview. It was only two years ago that Alvarado received a call telling him that his brother had attempted to take his own life after his decades-long struggle.\n  It was then that Alvarado began to confront just how broken current treatment methodologies were. His family had tried to find consistent care for Alvarado’s younger brother, but therapists were expensive, remote, had waiting lists that were weeks-long, and had difficulty related to teens (especially teens who weren’t white).\n Alvarado’s brother isn’t alone. One in five teens in the US have or will have a mental health issue, Alvarado said, and the nation’s ineffectual response to the COVID-19 epidemic is only exacerbating the problem. Judging by the statistics, there are 7 million teens in the US right now with a mental health condition and rates of depression and anxiety  are going up.\n The team of ten clinicians that Daybreak Health works with have a deep experience with evidence-based care and Alvarado expects that most of the patients that they consult will be undergoing some form of behavioral therapy guided by those clinicians.\n For teens who are experiencing less acute mental health issues, there’s a team of what the company calls “trained listeners” to provide support.\n Alvarado and Cidambi both worked at the consulting firm  Oliver Wyman   and Mercado and Alvarado knew each other from  Jiff,   a healthcare startup focused on providing wellness benefits to employees at companies, which was eventually bought by Castlight Health.\n To ensure their mental health bona fides, the company brought in Dr. Neha Chaudary from Stanford’s  Brainstorm Lab, which focuses on innovation in mental health. “They’re actually the ones designing our clinical program from the ground up,” says Alvarado.\n  The company is currently working with 20 Bay Area schools and pediatric groups in the Bay area and is focused on treating teens aged thirteen to nineteen, says Alvarado.\n Currently, both schools and pediatric groups are referring patients to the company, and the cost of care is covered either through insurance or through an $89 per-week fee.\n “This is a full-stack therapy program,” says Alvarado. “It’s an improvement, in our view [on traditional therapy], because not only are you getting that invidividual one-on-one therapy, but you’re also getting curriculums around certain points in time.”\n For the teens, it’s not only about specific interventions to prevent certain behaviors, Cidambi says. It’s also to build up coping mechanisms so teens can better respond to mental health pressures as adults.\n Alvarado stresses that the program isn’t for any teen that’s feeling a bit stressed or for parents who’re just worried about their child’s performance. There’s an hour-long intake consultation conducted with both the teen and the parent before a teen can be admitted to the program.\n And the company has already turned away some potential customers because they just didn’t need the treatment. “Our goal is not to just bring anybody into treatment.”\n Alvarado would not say how many students are currently being treated from its Bay Area partner schools, and says that the schools are a mix of both public and private institutions in the Bay Area.\n “Our main touchpoint at the school will be the school counselor or the wellness coordinator,” says Cidambi. Daybreak Health doesn’t pay for referrals but does reach out to school counselors to market its services.\n The company is far from the only service out there trying to provide online counseling for teens,  TeenCounseling is one service that boasts 5,000 therapists and offers its services from $80 to $100 per week.\n “The beauty of what we’re doing is the marriage of the clinical program with the technology,” says Alvarado. “We always want to have the therapist involved. And we are developing a mobile app… that is to communicate… and enable patients to do some exercises on their own, but we never believe that it will be a standalone app.”", "posttime": "2020-07-23 23:41:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "流行,health,青少年", "title": "\n黎明健康在大流行的精神健康危机中为青少年推出在线心理健康治疗", "title_en": "\n\t\t\t\tDaybreak Health launches online mental health therapy for teens amid the pandemic’s mental health crisis\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/23/daybreak-health-launches-online-mental-health-therapy-for-teens-amid-the-pandemics-mental-health-crisis/", "via": "", "real_tags": ["流行", "health", "青少年"]}, {"category": "", "categoryclass": "", "imagename": "a53820635ed2369880b576b83d16bc8e.jpg", "infoid": 1013769, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌正在认真对待与亚马逊在网购领域的竞争-就像它在2013年、2014年、2017年和2019年所做的那样。\n但在2020年，随着冠状病毒大流行继续席卷美国，随着消费者避开商店，转向互联网来满足更多的购物需求，创建一个在线购物市场与亚马逊竞争的努力变得更加紧迫。\n周四，谷歌宣布将采取措施，通过免除销售佣金，并允许零售商使用Shopify等广受欢迎的第三方支付和订单管理服务，而不是公司自己的系统，将更多的卖家和产品引入其购物网站。目前，谷歌购物的佣金根据产品的不同从5%到15%不等。\n谷歌通常是在互联网上查找信息的起点，但当消费者搜索要购买的产品时，情况往往并非如此。越来越多的美国消费者首先转向亚马逊，寻找他们计划购买的产品。这使得亚马逊得以建立快速增长的广告业务，这对谷歌的主要金融引擎构成威胁。\n谷歌与亚马逊长达七年的较量经历了更多的低谷而非高潮。2013年，它推出了一项名为谷歌购物快递(Google Shopping Express)的购物服务，提供免费的当天送货服务。它提供95美元的年度会员资格，以加快送货速度，并尝试递送食品杂货。谷歌最终放弃了这些努力。\nGoogle Express演变成了一个在线购物中心，里面挤满了塔吉特(Target)和百思买(Best Buy)等顶级零售商。2017年，该公司将沃尔玛(Walmart)添加到其虚拟购物中心，但这种合作关系是短暂的。去年，谷歌放弃了Google Express，转而使用Google Shopping，并引入了一个购买按钮，允许购物者使用存储在该公司的信用卡完成交易，而无需离开搜索引擎。\n今年，谷歌聘请贝宝(PayPal)前高管比尔·雷迪(Bill Ready)担任商务总裁，以更成功地与亚马逊竞争。\n谷歌4月份宣布，将允许任何人在其购物网站上免费列出产品，扭转了之前要求卖家购买产品广告才能出现的政策。该公司还宣布，这些免费列表将出现在其搜索结果中。通过消除上市和销售产品的成本，谷歌的目标是让零售商更有吸引力地将产品放在搜索引擎庞大的用户群面前。\n在一次采访中，雷迪说，在疫情来袭之前，大多数零售商在电子商务方面已经落后了。近几个月来，随着越来越多的消费者转向网上购物，这一差距已经拉大，网上销售的大部分增长都被少数玩家吞下了。\n他说：“我们希望确保在线销售既简单又便宜。”\n这些变化预计将立即在美国开始，然后在今年晚些时候推广到其他国家。谷歌还表示，在亚马逊上列出产品库存的卖家可以在不改变数据格式的情况下将这些产品转移到谷歌。\n虽然谷歌的所有举动显然都是为了让亚马逊感到不安，但雷迪不愿向这家西雅图的竞争对手发表讲话，在20分钟的讨论中，他甚至拒绝说一句A字。(他甚至回避了有关南美巨大雨林的名字的问题。)。\n他说：“消费者受益于多样化和蓬勃发展的卖家生态系统。”“没有一个玩家可以满足消费者的所有需求。”", "note_en": "Google is getting serious about competing with Amazon in online shopping — just like it did in 2013, 2014, 2017 and 2019.\n But in 2020, as the coronavirus pandemic continues to grip America, the push to create an online shopping marketplace to compete with Amazon has taken on new urgency as consumers are avoiding stores and turning to the internet to fill more of their shopping needs.\n On Thursday,  Google announced that it would take steps to bring more sellers and products onto its shopping site by waiving sales commissions and allowing retailers to use popular third-party payment and order management services like Shopify instead of the company’s own systems. Currently, commissions on Google Shopping range from a 5 percent to 15 percent cut depending on the products.\n Google is usually the starting point for finding information on the internet, but that is often not the case when consumers are searching for a product to buy. More consumers in the United States are turning first to Amazon to find products that they plan to purchase. This has allowed Amazon to build a rapidly growing advertising business, which is a threat to Google’s main financial engine.\n Google’s seven-year battle to take on Amazon has had more lows than highs. In 2013, it started  a shopping service called Google Shopping Express, offering free same-day delivery. It offered $95 annual memberships for faster delivery and it tried delivering groceries. Google eventually scrapped the efforts.\n Google Express  evolved into an online shopping mall filled with top retailers like Target and Best Buy. In 2017,  it added Walmart to its virtual mall, but the partnership was short-lived. Last year, Google ditched Google Express for Google Shopping and  introduced a buy button to allow shoppers to use credit cards stored with the company to complete the transaction without leaving the search engine.\n This year, Google brought in Bill Ready, a former executive at PayPal, to be its president of commerce and to compete more successfully with Amazon.\n  Google announced in April that it would allow anyone to list products for free on its shopping site, reversing its previous policy of requiring sellers to buy an ad for products to appear. The company also announced that those free listings would appear on its search results. By eliminating the cost of listing and selling products, Google aims to make it more appealing for retailers to put products in front of the search engine’s enormous user base.\n In an interview, Mr. Ready said most retailers were already lagging behind in e-commerce before the pandemic hit. And as more consumers moved to shop online in recent months, the gap has widened with much of the growth in online sales swallowed by a handful of players.\n “We want to make sure selling online is easy and inexpensive,” he said.\n The changes are expected to start immediately in the United States before rolling out to other countries later this year. Google also said sellers that have an inventory of products listed on Amazon can move them over to Google without changing the data format.\n While all of Google’s moves are clearly aimed at unsettling Amazon, Mr. Ready wouldn’t address its Seattle rival and refused to utter the A-word even once in a 20-minute discussion. (He even dodged a question about what is the name of the giant rainforest in South America.)\n  “Consumers benefit from a diverse and thriving ecosystem of sellers,” he said. “There is no one player that can serve all the needs of consumers.”", "posttime": "2020-07-23 23:40:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,亚马逊,amazon,矛头", "title": "谷歌将矛头对准亚马逊。再来一次。", "title_en": "Google Takes Aim at Amazon. Again.", "transed": 1, "url": "https://www.nytimes.com/2020/07/23/technology/google-ecommerce-amazon.html", "via": "", "real_tags": ["google", "谷歌", "亚马逊", "amazon", "矛头"]}, {"category": "", "categoryclass": "", "imagename": "2bb6ff93bb17f985aa46698dcd3011d6.jpg", "infoid": 1013768, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿(CNN Business)Twitter首席执行官杰克·多尔西(Jack Dorsey)周四表示，Twitter正在积极探索从用户那里赚钱的其他方式，包括考虑订阅模式。此举正值推特核心广告业务大幅下滑之际。\n多尔西在讨论该公司第二季度收益业绩的投资者电话会议上告诉分析师，今年你可能会看到各种方法的一些考验。多尔西说，当我们要求消费者为Twitter的某些方面付费时，他有一个非常高的门槛，但他证实，该公司正寻求在非常、非常早期的探索阶段实现收入来源的多元化。\n本月早些时候，Twitter发布了一个职位空缺，专注于打造代号为“鹰头鹰”(Gryphon)的订阅平台，随后有关Twitter提供付费服务的传言甚嚣尘上。Twitter的股价当时飙升，表明投资者对该公司寻找新的收入来源有兴趣。\n与其竞争对手社交网络一样，Twitter一直专注于提供免费服务，并通过允许品牌向其数百万用户投放广告来赚钱。\n多尔西表示：我们希望确保任何新的收入线都能与我们的广告业务相辅相成。我们确实认为，在这个世界里，订阅是互补的，商业是互补的，帮助人们管理付费墙……。我们认为是互补的。\nTwitter的增长计划正受到密切关注，因为许多广告商因流感大流行而收缩。周四，Twitter公布第二季度广告收入为5.62亿美元，与去年同期相比下降了23%。\n该公司还受到了参与广告抵制社交媒体的广告商的打击，这与全国范围内的种族正义抗议活动有关。但Twitter高管拒绝透露抵制活动对Twitter业务产生了多大影响。\n在Twitter发布财报之前，多尔西将其描述为艰难的一周。在这一周里，Twitter争先恐后地应对一场大规模黑客攻击，这起攻击泄露了众多已验证账户，包括巴拉克·奥巴马(Barack Obama)、乔·拜登(Joe Biden)、埃隆·马斯克(Elon Musk)和杰夫·贝佐斯(Jeff Bezos)的账户。\n在财报公布前夕，Twitter宣布，作为安全事件的一部分，数十个账户--包括一名荷兰民选官员--可能被黑客窃取了他们的直接消息。\n多尔西在周四的电话会议上为上周的大规模安全漏洞道歉，称我们未能履行公司的安全义务。\n他说：我们对这次安全事件感到很难过。安全没有终点。这是一个不断的迭代。我们将继续超越这里，因为我们将继续保护我们的系统，并继续与外部公司和执法部门合作。", "note_en": "Washington (CNN Business) Twitter  (  TWTR) is actively exploring additional ways to make money from its users, including by considering a subscription model, CEO Jack Dorsey said Thursday. The move comes as Twitter suffers a sharp decline in its core advertising business.\n &#34;You will likely see some tests this year&#34; of various approaches, Dorsey told analysts on an investor call held to discuss the company&#39;s second quarter earnings results. Dorsey said he has &#34;a really high bar for when we would ask consumers to pay for aspects of Twitter,&#34; but confirmed that the company is seeking to diversify its sources of revenue in what are &#34;very, very early phases of exploring.&#34;\n Earlier this month, rumors flared about a paid Twitter option after the company  posted a job opening focused on building a subscription platform codenamed &#34;Gryphon.&#34; Twitter&#39;s stock surged at the time, signaling investor appetite for the company to find new revenue streams.\n    Like its rival social networks, Twitter has focused on offering a free service and making money by allowing brands to target ads to its millions of users.\n  &#34;We want to make sure any new line of revenue is complementary to our advertising business,&#34; Dorsey said. &#34;We do think there is a world where subscription is complementary, where commerce is complementary, where helping people manage paywalls ... we think is complementary.&#34;\n Twitter&#39;s growth plans are under close scrutiny as many advertisers pull back due to the pandemic. On Thursday, Twitter reported second-quarter ad revenues of $562 million, a 23% decrease compared to the same quarter a year ago.\n The company has also been hit by advertisers participating in an  ad boycott of social media, linked to the nationwide racial justice protests. But Twitter executives declined to say how much of an impact the boycott has had on Twitter&#39;s business.\n Twitter&#39;s earnings report follows what Dorsey described as a &#34;tough week&#34; in which the company scrambled to address a massive hack that compromised numerous verified accounts, including those of Barack Obama, Joe Biden, Elon Musk and Jeff Bezos.\n On the eve of its earnings results, Twitter announced that  dozens of accounts -- including one elected official in The Netherlands -- may have had their direct messages accessed by hackers as part of the security incident.\n   Dorsey apologized on the conference call Thursday for last week&#39;s massive security breach, saying &#34;we fell behind&#34; on the company&#39;s security obligations.\n &#34;We feel terrible about the security incident,&#34; he said. &#34;Security doesn&#39;t have an end point. It&#39;s a constant iteration ... We will continue to go above and beyond here as we continue to secure our systems and as we continue to work with external firms and law enforcement.&#34;", "posttime": "2020-07-23 23:40:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "twitter,dorsey", "title": "杰克·多尔西说，Twitter正在积极探索从用户那里赚钱的其他方式，包括通过订阅模式", "title_en": "Jack Dorsey says Twitter is actively exploring additional ways to make money from its users, including through a subscription model", "transed": 1, "url": "https://cnn.com/2020/07/23/tech/twitter-subscription-earnings/", "via": "", "real_tags": ["twitter", "dorsey"]}]