[{"category": "", "categoryclass": "", "imagename": "428c1c4af24ff387e1ed1b7bd8043982.jpg", "infoid": 1068619, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该资金来到了公司的高跟鞋，在去年看到大规模增长，公司比以往任何时候都扰乱，在一个更加混合和遥远的工作的新世界，更好地掌握如何以及哪些团队和个人是做。 Viager表示，它现在处理员工记录为8,000名客户，大型和高调的企业，如Adobe，巴斯夫，普利司通，电子艺术，McKesson，Merck Kgaa和优步，统称在75个国家/地区的大约1200万个人。\n 新的支持者高盛资产管理是领先的，上一个投资者Sorenson Capital，Foundation Capital，Summit Partners和Adams Street Partners也参加。 Visier  - 发音为“忙碌”，哪个联合创始人和主席John Schwarz开玩笑，您不应该在使用其产品时 - 现在刚刚筹集了2.220亿美元。\n  正如施瓦茨所描述的那样，Visier正在寻址的挑战是，虽然每个人都使用工作日，成功因素，任何数量的工资源和更多 - 平均每部申请，但他说 - 他说 - 以平均为本，他说 - 迄今为止基础知识员工如何运作日期或月份到月份，很多数据都留在筒仓中，因此基于所有这些数据都很难获得“360”视图，并且在考虑如何采取如何采取该信息和基准之前，这是难以获得“360”的视图它与业务之外的其他信息。\n Visier提供的解决方案提供了一个可以连接到任何和所有这些应用程序的大数据引擎的地址，可摄取它中包含的数据，使其匹配，以提供当前事物状态的可视化，以及越来越多地预测洞察力。今天，这通常是为了人力资源部门完成，但这对管理人员，财务部门和真正的员工本身就适用。\n “在未来，我们希望帮助每个人都了解今天的政策，这会影响明天的结果，”他在接受采访时说。\n 构建大型数据分析的举动目标是一个组织的特定领域一直是一个有趣的趋势，这些趋势也在其他部门出发，如销售，金融，风险分析和其他领域。这里的想法与多年来的数据科学家有多年来没有更广泛的分析问题：从不同的来源点击数据互联，互相匹配，互相匹配，为组织内的更广泛的趋势和活动提供洞察力。\n 由于数据科学变得更加民主 - 并且由于没有代码和低码工具的进步，转变为甚至非技术人员可以实施和使用的工具 - 我们可能会看到更多使用这种想法的使用情况。毕竟，数据是新的油，但与实际油不同，我们似乎这些天似乎随着无穷无尽的金额供应。 \n是的，我们已经看到了近年来的人力资源工具的真正匆忙 - 在当前的气候中看到了许多资金，因为他们的企业认为客户兴趣增长 - 他们包括希伯比比比亚，人力资源平台，特别是人力资源平台垂直像人物或因子，或者像牡蛎或遥控器一样的分布式劳动力，或者建造像Charthop这样的增压器的结构。\n 但Visier认为，没有大数据播放器，不希望来自其他平台的大数据集成商的信息。 Schwarz注意到，在大多数情况下，“竞争”将是由使用Tableau或类似的系统集成商构建的定制实现，而不是与实时分析的内容相同。\n “这一切都是关于使用来自其他来源的数据，”他说，指出它讲的是工作日试图建立类似Visier提供的东西，但是超过一半的Visier客户也使用工作日（意味着什么都没有诀窍）。\n “获取有关员工的信息和组织的健康从未如此至关重要，”高盛资产管理董事总经理霍尔格斯塔德说。 “我们在这个关键时刻与Visier抱有兴奋，并支持公司的持续增长。” ", "note_en": "The funding comes on the heels of the company seeing massive growth in particular in the last year, with companies scrambling more than ever before, in a new world of more hybrid and remote work, to get a better grip on how and what teams and individuals are doing. Visier said it now processes employee records for 8,000 customers, large and high-profile enterprises like Adobe, BASF, Bridgestone, Electronic Arts, McKesson, Merck KGaA and Uber that collectively represent some 12 million individual users across 75 countries.\n New backer Goldman Sachs Asset Management is leading the round, with previous investors Sorenson Capital, Foundation Capital, Summit Partners, and Adams Street Partners also participating. Visier — pronounced “busier,” which co-founder and chairman John Schwarz joked you are  not supposed to be when using its product — has now raised just under $220 million.\n  As Schwarz described it to me, the challenge that Visier is addressing is that while everyone uses HR management tools like Workday, Success Factors, any number of payroll applications and more — on average 20 applications per department, he said — to chart a lot of basics of how an employee works day to day or month to month, a lot of that data remains in silos and so it’s hard to get a “360” view based on all of it, and that’s before considering how to take that information and benchmark it against other information outside the business.\n The solution that Visier provides to address that is a big-data engine that it has built that can connect to any and all of those apps, ingest the data contained in it, match it up to provide visualizations of the current state of things, and increasingly also predictive insights. Today, this is done typically for HR departments, but this has applicability to managers, finance departments and really the employees themselves.\n “In the future we want to help everyone understand the policy today, which impacts the outcome tomorrow,” he said in an interview.\n The move to build big data analytics targeting particular areas of an organization has been an interesting trend that has played out in other departments too such as  sales,  finance,  risk analysis and other areas. The idea here is not unlike what data scientists have been working on for years with wider analytics questions: tapping troves of data from disparate sources to order it better, match it up with each other, to provide insight into wider trends and activities within an organization.\n As data science becomes more democratized — and thanks to advances in no-code and low-code tooling, turned into tools that even non-technical people can implement and use — we will likely see many more use cases where this idea gets applied. After all, data is the new oil, but unlike actual oil, we seem to be supplied with an endless amount of it these days.\n And yes, we’ve seen a real rush of HR tools come to the market in recent years — and see a lot of funding in the current climate as their businesses see customer interest rise — they include HR platforms like  Hibob, HR aimed at particular verticals like  Personio or  Factorial, or for distributed workforces like  Oyster or  Remote, or those that are building supercharged org-charts like  ChartHop.\n But Visier believes that there are no big-data players looking not to be primary-source repositories of information but big data integrators from other platforms. Schwarz notes that in most cases, the “competition” will be custom-made implementations built by systems integrators using Tableau or something similar but not the same as what it provides in terms of real-time analytics.\n “It’s all about using data from other sources,” he said, pointing out that it’s telling that Workday tried to build something like what Visier provides, but that more than half of Visier’s customers also use Workday (meaning whatever is there is not quite doing the trick).\n “Access to information about employees and the health of an organization has never been more critical,” said Holger Staude, managing director within Goldman Sachs Asset Management. “We’re excited to partner with Visier at this pivotal moment and support the company’s continued growth.”", "posttime": "2021-06-29 23:47:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "分析,big", "title": "Visier以1亿美元的估值为1250万美元的人力资源分析和规划筹备 ", "title_en": "\n\t\t\t\tVisier raises $125M at a $1B valuation for its big-data approach to HR analytics and planning\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/visier-raises-125m-at-a-1b-valuation-for-its-big-data-approach-to-hr-analytics-and-planning/", "via": "", "real_tags": ["分析", "big"]}, {"category": "", "categoryclass": "", "imagename": "221e6c3fff08dad92063b68e8fe4bf34.jpeg", "infoid": 1068618, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Accel和Canapi Ventures联合领导了这一轮，其中还包括参与现有的支持贝恩·伯克资本企业，启发资本，自制，ACREW，初级，时钟和箱体组。奥卢姆宣布了2100万美元系列A，融资距三个月差不多，并将其总量升至超过8200万美元。\n ORUM首席执行官Stephany Kirkpatrick于2019年推出了公司在学习工作结束后，由Alexa Von Tobel成立的个人融资遗址，该网站由2015年西北互联网获得的Alexa Von Tobel，估计为3.75亿美元。托贝尔继续形成灵感的资本，这是一个风险投资公司，该公司在奥卢姆的520万美元种子上汇款。在此之前，该公司还提供了史玛，其中“灵感检查”是本业务的第一笔资金。\n  作为一个经过认证的金融计划者，Kirkpatrick说，她在这个国家的金融基础设施中看到了她描述的是“深裂缝”。从一个银行移动到另一个银行需要数天的事实不仅对许多人来说不方便，而且不必要，但她相信。\n “大多数美国人不熟悉ACH [自动化清算房屋）的复杂性，或者为什么需要多个营业时间才能在账户之间搬款，”Kirkpatrick说。 “但我们都不能允许钱等待5-7天来击中我们的账户。它需要即时。“\n 即使它背后的技术是复杂的，她的使命也很简单。简而言之，ORUM旨在使用机器学习支持的API“在所有支付轨道上巧妙地搬家，并在这样做，提供普遍的财务访问。”\n Oreum于2020年9月推出的首次嵌入式产品，远见卓识。它是一个自动编程界面，旨在为金融机构提供一种方式实时移动资金。该平台使用机器学习和数据科学来预测资金可用并识别任何潜在风险。它的势头产品“智能地”在付款轨道上汇总资金，并由银行提供商JPMORGAN Chase和Silicon Valley Bank提供动力。\n “他们动力了我们的势头平台的后端，允许金钱在多靶中移动，”Kirkpatrick告诉TechCrunch。 “他们能够访问实时付款。” \nORUM表示，它为一系列企业合作伙伴提供了一系列的企业合作伙伴，包括合金，HM Bradley，First Horizo​​ n Bank和Zero Financial（最近被前瞻性收购）。\n Kirkpatrick说，随着ORUM进行的交易量持续100％以上增长100％。其大部分早期增长来自口中。\n 遥控公司在其员工和投资者基础上以多样性而自豪。据Kirkpatrick表示，对于一个，48％的55人前往女性，48％是“非白，”。 ORUM还加入了CAP表联盟 - 希望努力关闭种族财富差距的高增长初创公司和新兴投资者之间的伙伴关系 - 将其系列超过10％的B型转向代表性的创始人。例如，该融资包括纽接种特色基金等投资者，这是一群南亚妇女投资下一代女性创始人和多元化的团队。\n Canapi Ventures的合伙人Jeffrey Reitman（一家LPS主要由银行组成的公司），告诉TechCrunch，这些银行LPS每年进行数亿种同步交易，\n “他们需要一条途径来实现资金可以立即转移的国家，”他说。 “奥卢姆的产品为许多金融服务和金融服务业的球员铺平了道路 - 而且在不影响了重点风险原则的情况下，在更快的货币运动中参与较快的乐队。”\n 对于Reitman，该公司的主要差异化是其团队，他描述了由“最佳数据科学家和空间的工程师”组成。\n “他们的许多客户考虑该团队有助于帮助设置风险拨号，以便通过裁减历史交易数据的关键数据和见解，”他们如何通过裁减关键数据和见解，“他说。 “第二，ORUM正在建立围绕金钱运动风险的最密集和最全面的数据集之一。更好的数据意味着更好的风险模型，其他产品将很难匹配ORUM的建立这种丰富的数据集的方法。“ \nAccel Partner同名Gandhi，他作为最新融资的一部分加入Oreum的董事会，同意。 他认为，在一个18个月的时间里，Oreum建立了“更改的游戏技术和一个特殊的团队”。 ", "note_en": "Accel and Canapi Ventures co-led the round, which also included participation from existing backers Bain Capital Ventures, Inspired Capital, Homebrew, Acrew, Primary, Clocktower and Box Group. The financing comes barely three months after Orum announced a $21 million Series A, and brings  its total raised to over $82 million.\n Orum CEO Stephany Kirkpatrick launched the company in 2019 after working for  several years at LearnVest, a personal finance site founded by Alexa von Tobel that was acquired by Northwestern Mutual in 2015 for an estimated $375 million. Tobel went on to form Inspired Capital, a venture capital firm that put money in Orum’s   $5.2 million seed round  last August. Prior to that, the firm also provided Orum  with an “inspiration check” that was the first money into the business.\n  As a certified financial planner, Kirkpatrick says she saw firsthand what she describes as “deep cracks” in this country’s financial infrastructure. The fact that it takes days for money to move from one bank to another is not only inconvenient for many, but unnecessary, she believes.\n “Most Americans are not familiar with the intricacies of ACH [automated clearing house) or why it takes multiple business days to move money between accounts,” Kirkpatrick said. “But none of us can allow money to wait 5-7 days to hit our accounts. It needs to be instant.”\n Her mission with Orum is straightforward even if the technology behind it is complex. Put simply, Orum aims to use machine learning-backed APIs to “move money smartly across all payment rails, and in doing so, provide universal financial access.”\n Orum’s first embeddable product, Foresight, launched in September of 2020. It’s an automated programming interface designed to give financial institutions a way to move money in real time. The platform uses machine learning and data science to  predict when funds are available and to identify any potential risks. Its Momentum product “intelligently” routes funds across payments rails and is powered by banking providers JPMorgan Chase and Silicon Valley Bank.\n “They power the back end of our Momentum platform that allows the money to move on a multirail basis,” Kirkpatrick told TechCrunch. “They power our access to real-time payments.”\n Orum says it serves a range of enterprise partners, including Alloy, HM Bradley, First Horizon Bank and Zero Financial (which was   recently acquired by Avant ).\n The volume of transactions being conducted with Orum is growing 100% month over month, Kirkpatrick said. Most of its early growth has come from word of mouth.\n The remote-first company prides itself on diversity — in both its employee and investor base. For one, 48% of its 55-person headcount are female, and 48% are “nonwhite,” according to Kirkpatrick. Orum also recently joined the   Cap Table Coalition  — a partnership between high-growth startups and emerging investors who want to work to close the racial wealth gap — to allocate over 10% of its Series B round to underrepresented founders. For example, the financing includes investors such as the Neythri Features Fund, a group of South Asian women investing in the next generation of female founders and diverse teams.\n Jeffrey Reitman, partner at Canapi Ventures (a firm whose LPs mostly consist of banks), told TechCrunch that those bank LPs  conduct hundreds of millions of ACH transactions annually,\n “They need a path to achieving a state where funds can be transferred instantly,” he said. “Orum’s product paves the path for many players in financial services and fintech — and beyond — to partake in faster money movement without compromising key risk principles.”\n To Reitman, the company’s major differentiators are its team, which he describes as consisting of “the best group of data scientists and engineers in the space.”\n “Many of their customers consider the team to be instrumental in helping to set the risk dials on how they fund transactions by teasing out key data and insights from historical transaction data,” he said. “Second, Orum is building one of the densest and most comprehensive data sets around the risks of money movement. Better data means better risk models, and it will be hard for other offerings to match Orum’s approach to building this rich data set.”\n Accel Partner Sameer Gandhi, who joined Orum’s board as part of the latest financing, agrees. He believes that in an 18-month period, Orum has built “game-changing technology and an exceptional team.”", "posttime": "2021-06-29 23:47:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "加速,intrabank", "title": "ORUM筹集了56米，帮助加速IntraNank Transfers ", "title_en": "\n\t\t\t\tOrum raises $56M to help speed up intrabank transfers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/orum-raises-56m/", "via": "", "real_tags": ["加速", "intrabank"]}, {"category": "", "categoryclass": "", "imagename": "15deb0349ad36483767bf264122c2d07.jpg", "infoid": 1068616, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "机器人通常是大流行期间的大量流行投资目标。施工初创公司也开始升温。本月初，尘土飞扬宣布为其现场打印机设备提高了1650万美元。\n 切换自动化施工过程的完全不同部分。该公司的机器人技术专门针对钢筋，使用机器人在一小部分地区组装基础建筑材料。\n  “在全球建设加速到前所未有的步伐时，切换提供了一种增加能力的方法，同时节省一些最大类型的项目，”Cofounder和Ceo Daniel Blank在一份声明中表示，“我们尤其是感谢我们帮助我们为我们建造环境的基本建筑块带来新工具和方法的合作伙伴，重点是可再生能源和可持续的城市发展。“\n 切换说新的回合将扩大技术的生产。这包括增加头部，并将生产空间升级到新的50,000平方英尺的设施。 ", "note_en": "Robotics in general have been a massively popular investment target during the pandemic. Construction startups have also begun to heat up. Early this month, Dusty announced a $16.5 million raise for its Field Printer device.\n Toggle automates an entirely different part of the construction process. The company’s robotics technology specifically targets rebar, using robotics to assemble the foundational building material at a fraction of the time.\n  “At a time when global construction is accelerating to an unprecedented pace, Toggle offers a way to add capacity while saving time and cost on some of the largest types of projects,” cofounder and CEO Daniel Blank said in a statement, “We are especially grateful for our partners who are helping us to bring new tools and approaches to the fundamental building block of our built environment with a focus on renewable energy and sustainable urban development.”\n Toggle says the new round will go toward expanding production on the tech. That includes increasing headcount and upgrading the production space to a new 50,000 square foot facility.", "posttime": "2021-06-29 23:46:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "建筑,机器人,robotics,切换", "title": "建筑机器人公司切换筹集800万美元 ", "title_en": "\n\t\t\t\tConstruction robotics company Toggle raises $8M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/construction-robotics-company-toggle-raises-8m/", "via": "", "real_tags": ["建筑", "机器人", "robotics", "切换"]}, {"category": "", "categoryclass": "", "imagename": "16982e30c05e09500b6561011b6332e6.png", "infoid": 1068615, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每箭头首席执行官Daniel Zarick，该公司直到这一轮才被启动。这使得启动允许数十名较小的投资者参加该资金事件，包括28个微检查，它还卷入单个帽表线项 - 由于允许较小的投资组合的昂堡斯服务。\n 箭头销售给软件首席执行官和客户成功的负责人，那些最关心的人，确保新客户尽快使用新的数字产品。每个Zarick，成功的客户到新产品或服务船上可以加快采用，帮助促进基于使用的产品的收入;它还众所周知，更强大的车载也可以导致客户组织内部更好地采用，潜在地限制在后来的搅拌。\n  鉴于现代软件市场的规模，箭头销售为肥沃的地面。这就是Zarick和他的联合创始人Benedict Fritz决定停止成为一个双人的商店，并提高更多资本。他们担心，Zarick解释说，没有更多的资本窒息他们的公司。\n  幸运的是，对于箭头来说，一位投资者已经对他们的工作感到敏锐。即渐变企业的Dariar Shirazi，在初创公司甚至考虑提高外部资金之前，达到了多次达到了多次。根据箭头首席执行官，Shirazi已经在投资之前将他自己的投资组合公司发送了他自己的投资组合公司，其中一些人已成为客户。因此，当Zarick和Fritz决定追求风险投资时，已经有一个领先的名字已经手动。\n 使用275万美元的价格在单个帽子，SAN折扣时使用安全提出。\n  箭头最初在3月开始推出服务，但本周正在修改其定价，关闭其自助式模型的近期。\n 听听种子舞台启动的首席执行官很有趣，讨论从引导模型的发展到一个由大小尺寸的风险投资支持。 Zarick在面试中描述了TechCrunch，他的工作是多么不断变化，该公司正努力扩大到八个左右的团队。该公司打算留在那个人类规模一段时间。 \n根据其首席执行官，箭头可以通过目前的首都SANS收入增长相交两年; 虽然我们预计它现在已经吸引了种子资本，但其他VCS将抓住 - 这是我们在最近几周和几个月内经常看到的趋势。  箭头产品也将在未来几个月中发展。 虽然攻击客户船上的船队与现代软件的使用电子表格使用了，但启动已经提前大量计划工作，包括与外部软件的更多集成。 让我们看看我们再次听到箭头的速度。 我会在年底之前赌注那个高五。 ", "note_en": "Per Arrows CEO Daniel Zarick, the company had bootstrapped until this round. That allowed the startup to allow dozens of smaller investors to take part in this funding event, including 28 micro-checks that it rolled into a single cap-table line-item thanks to an AngelList service that allows for smaller investments to be combined.\n Arrows sells to software CEOs and heads of customer success, the people who care the most about ensuring that new customers get up and running with new digital products as quickly as possible. Per Zarick, successful customer onboarding to a new product or service can speed up adoption, helping boost revenue from usage-based products; it’s also generally known that stronger onboarding can also lead to better adoption inside of customer organizations, potentially limiting later churn.\n  Given the scale of the modern software market, Arrows is selling into fertile ground. That’s the reason that Zarick and his co-founder Benedict Fritz decided to stop being a two-person shop, and raise more capital. They were worried, Zarick explained, about suffocating their company without more capital.\n  Luckily for Arrows, one investor had already taken a keen eye to their work. Namely Gradient Ventures’  Darian Shirazi, who had reached out a number of times before the startup was even considering raising external funds. Per the Arrows CEO, Shirazi had already sent the startup his own portfolio companies as leads before he invested, some of whom have become customers. So, when Zarick and Fritz decided to pursue venture capital, there was a leading name already on hand.\n The $2.75 million round was raised using a SAFE at a single cap, sans discount.\n  Arrows initially  launched its service in March, but is revamping its pricing this week, closing its self-serve model for the near-term.\n It’s interesting to listen to the CEO of a seed-stage startup discuss evolving from a bootstrapped model to one backed by a good-sized amount of venture funding. Zarick described to TechCrunch in an interview how much his job was changing now that the company is working to scale up to a team of around eight. The company intends to stay at that human scale for a little while.\n Per its CEO, Arrows can get along for two years with its current capital sans revenue growth; though we’d expect that now that it has attracted seed capital, other VCs will look to pile on — a trend that we’ve seen often in recent weeks and months.\n The Arrows product is also going to evolve in the coming months. While attacking customer onboarding teams’ use of spreadsheets with modern software has worked thus far, the startup has lots of planned work ahead of it, including more integrations with external software. Let’s see how quickly we hear from Arrows again. I’ll wager anyone a high-five that it’s before the end of the year.", "posttime": "2021-06-29 23:46:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,箭头,customer", "title": "箭头筹集了2.75亿美元，以建立其客户船上软件 ", "title_en": "\n\t\t\t\tArrows raises $2.75M to build out its customer onboarding software\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/arrows-raises-2-75m-to-build-out-its-customer-onboarding-software/", "via": "", "real_tags": ["软件", "箭头", "customer"]}, {"category": "", "categoryclass": "", "imagename": "130d3ea1e3b5c01ba523cacec59a6e4f.png", "infoid": 1068614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但同事想要动摇在线卖家如何找到新客户，并且它希望以折扣的合作精神。本月早些时候宣布了今天早些时候收取的580万美元，证明它已经发现它的模型已经收集了500个品牌。\n 那个最终的人物很重要，因为合作社是一个几乎是独特的协作公司。标记为合作社的一部分的品牌包括其在购买后页面的技术，允许向刚刚完成购买某些东西的客户显示其他相关项目。通过包括窗口小部件，将在另一家公司的购买页面上显示公司的产品。\n 这至少听起了反资本主义，这在一个冒险的支持世界中不起作用。那么，扭曲是什么？购买后页面小部件显示了三种或四个产品，使其额外的库存可以销售给其合作品牌。 Presto，收入。\n 该公司的创始人兼首席执行官Conner Sherline告诉TechCrunch，他的初创公司可以在Facebook和其他渠道的每次成本的一半左右提供广告空间;其模型规模的经济学如何随着更多品牌的加入将着迷。\n 该启动还提供软件工具，包括购买后的调查功能，每个订单需要5美分，为客户提供杠杆。\n Sherline的初创公司似乎很快就会增长。当它去年7月筹集了预先种子资本时，它有大约20个品牌在其服务上。今天，该公司每月加入另外50到100。在此速度，它可以在今年年底之前总共达到1000个品牌，禁止任何减速，以其吸引新品牌到其网络的能力。\n 启动的早期进展吸引了糖资本领导其最新一轮，这也看到了来自Bessemer Venture Partners和在线电子商务巨头购物的参与。 Shopify Check很有趣;例如，CO-OP已经存在于ShopIfy App Store上。 TechCrunch将密切关注两家公司之间的更多一体化，这可能会扼杀起始初创公司的增长。 \n有许多地方才能扩展到。 Sherline在面试中告诉TechCrunch，它的协作网络是公司正在努力的第一件事。 但是，通过许多销售数据和丰富的合作伙伴，合作社可以建立伙伴网络，旨在轻松地瞄准电子商务销售生命周期的其他部分，我们估计。  无论如何，该公司现在拥有它之前提出的160万美元的倍数。 让我们看看它有多迅速将其品牌基础与新资金扩展。 ", "note_en": "But  co-op wants to shake up how online sellers find new customers, and it wants to do so with a spirit of collaboration at a discount. The startup announced a $5.8 million round today that closed earlier this month, evidence that it has found backers for its model that has already collected 500 brands.\n That final figure matters because co-op is an almost uniquely collaborative company. Brands that sign up to be part of co-op include its technology on their post-purchase page, allowing for other, related items to be shown to customers who just finished buying something. By including the widget, a company’s product will be shown on the post-purchase page of another company.\n That sounds anti-capitalist at the very least, which wouldn’t work in a venture-backed world. So, what’s the twist? The post-purchase page widget shows three or four products, giving it extra inventory that it can sell to its partnered brands. Presto, revenue.\n The company’s founder and CEO,  Conner Sherline, told TechCrunch that his startup can deliver advertising space at around half the cost-per-action of Facebook and other channels; how the economics of its model scale as more brands join will be fascinating to watch.\n The startup also offers software tooling, including a post-purchase survey feature that costs 5 cents per order for customers to leverage.\n Sherline’s startup appears to be growing quickly. When it raised pre-seed capital last July, it had around 20 brands onboarded to its service. Today, the company is adding another 50 to 100 each month. At that rate, it could reach 1,000 brands in total by the end of the year, barring any deceleration in its ability to attract new brands to its network.\n The startup’s early progress attracted  Sugar Capital to lead its latest round, which also saw participation from  Bessemer Venture Partners and online e-commerce giant Shopify. The Shopify check is interesting; co-op already  exists on the Shopify app store, for example. TechCrunch will keep an eye out for more integrations between the two companies, something that could turbo-charge the startup’s growth.\n There are a number of places for co-op to expand into. Sherline told TechCrunch in an interview that its collaborative network is the first thing that the company is working on. But with lots of sales data and a wealth of partners, co-op could build out partner networks aimed at other parts of the e-commerce sales life cycle pretty easily, we reckon.\n Regardless, the company now has a multiple of the $1.6 million that it had raised before. Let’s see how quickly it can scale its brand base with the new funds.", "posttime": "2021-06-29 23:45:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "op,merchants", "title": "CO-OP提高5.8米，以帮助在线商家较少 ", "title_en": "\n\t\t\t\tCo-op raises $5.8M to help online merchants land customers for less\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/co-op-raises-5-8m-round-to-help-online-merchants-land-customers-for-less/", "via": "", "real_tags": ["op", "merchants"]}, {"category": "", "categoryclass": "", "imagename": "293ff67c6da87f14c99f920499ccd94b.jpg", "infoid": 1068613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所有Alexa设备所有者都无法使用此功能，因为它需要Amazon Kids +订阅。这是每月$ 2.99订阅服务，还提供有孩子的家庭，还提供数以千计的孩子友好的书籍，电视节目，电影，教育应用程序和游戏，除了用于Echo设备的优质内容，如免费广播电台和播放列表，可听书籍和独家alexa技能。\n   一旦订阅，孩子才能直接alexa阅读它们，他们将拿起兼容的书籍或电子书即可开始。 Alexa会问他们正在阅读哪本书，孩子想要阅读多少：很多，一点点或轮流？该功能适用​​于数百名儿童书籍，适用于6至9岁，作为Amazon Kids +订阅的一部分，包括打印或数字版本。当它是孩子的​​转读。当孩子挣扎时，Alexa将倾听并提供鼓励，当孩子挣扎时会提供支持。\n 同时，为孩子们的新Alexa语音轮廓的支持也将开始推出，从今天开始推出。此选项功能允许家长或监护人为家庭中每个孩子创建语音配置文件（最多4个孩子）。启用后，Alexa的体验将是个性化的个人说话。这意味着Alexa将自动应用已配置的相应父母控制，自动过滤明确的音乐，限制呼叫和仅通过Alexa发送的消息，只能达到批准的联系人，并仅限于alexa技能父母预先批准的alexa技能。 Alexa还将为孩子提供对孩子友好的游戏，技能，音乐和视频的访问，并将为孩子们的询问提供孩子友好的回应。\n 虽然这些功能可以使Alexa能够对家庭提供更有趣和有用的功能，但是父母必须对拥有孩子的声音录制和分析并确定他们想要这些录音的录音时，父母必须权衡他们的舒适度。今天，亚马逊使用Kids的语音录制来培训其语音识别和自然语言理解系统，以提高alexa理解儿童问题和请求的能力。在某些情况下，也会手动审查这些录音。不想参与的父母可以通过Alexa App设置唯一一个或一体地删除与孩子历史相关的录制。它们还可以设置录制以在持续的3个月或18个月内自动删除，并可以通过语音请求删除录制。\n 但是，如果父母选择不保存孩子的录音，他们将无法通过历史记录返回，以便在父仪表板上看到他们的孩子已经随着时间的推移。\n 每个父母都需要决定在启用阅读SINEKICK或语音简档等功能之前对自己的家庭做出什么是正确的，或者更广泛地了解他们是否想要将任何类型的智能扬声器带入家中。\n 亚马逊表示，新的Alexa语音轮廓为7月2日星期五到达所有亚马逊客户。阅读Sidekick今天可用。 ", "note_en": "This feature isn’t available to all Alexa device owners, as it requires an  Amazon Kids+ subscription. This is the $2.99 per month subscription service that also provides families with children access to thousands of kid-friendly books, TV shows, movies, educational apps and games, in addition to premium content for Echo devices, like ad-free radio stations and playlists, Audible books, and exclusive Alexa skills.\n   Once subscribed, the child can then direct Alexa to read with them and they’ll pick up a compatible book or ebook to get started. Alexa will ask what book they’re reading and how much does the child want to read: a lot, a little, or taking turns? The feature works with the hundreds of children’s books for ages 6 to 9 that are included as part of the Amazon Kids+ subscription, including both the print or digital versions. When it’s the child’s turn reading. Alexa will listen and provide encouragement when the child is doing well, and will offer support when the child is struggling.\n Meanwhile, support for new Alexa Voice Profiles for Kids will also begin rolling out, starting today. This opt-in feature allows parents or guardians to create a voice profile for each child in their family (up to 4 kids). When enabled, the Alexa experience will be personalized to the individual speaking. That means Alexa will automatically apply the appropriate parental controls that have been configured, automatically filter explicit music, limit calls and messages sent through Alexa only to approved contacts, and restrict the child only to the Alexa skills parents have pre-approved. Alexa will also provide the child with access to kid-friendly games, skills, music, and videos and will provide kid-friendly responses to kids’ inquiries.\n While features like these can make the Alexa experience more fun and useful for families, parents have to weigh their comfort with having their children’s voices recorded and analyzed and determine how long they would want such recordings stored. Today, Amazon uses kids’ voice recordings to train its speech recognition and natural language understanding systems in order to improve Alexa’s ability to understand children’s questions and requests. In some number of cases, these recordings are also manually reviewed. Parents who don’t want to participate can delete recordings associated with their child’s history either one-by-one or all at once via the Alexa app Settings. They can also set recordings to automatically delete on an ongoing 3-month or 18-month basis and can delete recordings via voice requests.\n However, if the parent chooses not to save the child’s recordings, they’ll not be able to go back through the history to see the requests their child has made over time from the  Parent Dashboard.\n Every parent will need to make a decision about what’s right for their own household before enabling features like Reading Sidekick or Voice Profiles, or, more broadly about whether they want to bring a smart speaker of any kind into their home.\n Amazon says the new Alexa Voice Profiles for Kids should reach all Amazon customers by Friday, July 2. Reading Sidekick is available today.", "posttime": "2021-06-29 23:45:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,阅读,reading,alexa", "title": "亚马逊介绍阅读Sidekick，一个阅读伴侣的孩子，以及儿童的语音档案 ", "title_en": "\n\t\t\t\tAmazon introduces Reading Sidekick, a kids reading companion for Alexa, and Voice Profiles for Kids\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/amazon-introduces-reading-sidekick-a-kids-reading-companion-for-alexa-and-voice-profiles-for-kids/", "via": "", "real_tags": ["amazon", "亚马逊", "阅读", "reading", "alexa"]}, {"category": "", "categoryclass": "", "imagename": "b694fbe76a8b1b358974953ea46e4cbc.png", "infoid": 1068612, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Beflow是一个初创公司，今天宣布了一轮830万美元系列的收盘，正在寻求拯救蜜蜂，并在同时帮助农民更高效且有效。\n 该启动采用专有的科学技术，基本上使蜜蜂更健康，特别是在寒冷的天气中。丰富的研究领导了公司，了解某些植物的食物和分子，当送入蜜蜂时，可以将蜜蜂的死亡率降低到70％，并帮助他们在较冷的天气中表现更好。\n   蜜蜂是星球的自然粉丁师。它们将花朵变成果实，从一个着陆点传播花粉到另一个着陆点。许多农民将从养蜂人那里“租用”养蜂人在农场上闲逛，并授予他们的植物。在几乎各方面，无法测量这一点的有效性，并且蜜蜂本身无法真正控制。\n Beflow的技术确保蜜蜂健康且强大，并且可以在较冷的天气中飞得多7倍，而不是他们能够没有它。这意味着这些蜜蜂更有可能有效和有效地授予农民的农作物。\n 除了降低蜜蜂的死亡率，该公司还提供一个名为Tobee的第二种产品，该产品培训了蜜蜂针对特定作物，如蓝莓或杏仁。\n  Beeflow的商业模式是两倍。他们拥有自己的蜜蜂，他们向农民借给授粉，也与养蜂人合作，将他们带入蜂牛网。蜜蜂守护者不支付Beeflow的技术，但携带与农民关系的权利。\n 该初创公司是由来自阿根廷的Matias Viel创立，并且在拉丁美洲和美国西海岸旅游，计划扩大到东海岸和墨西哥。 \n“最大的挑战是运作和执行，”Viel说。 “有很多需求，我们需要立即扩展我们的团队和我们的运营。”  融资回合由奥斯普岛AG科学领导，参与未来企业的史蒂夫·朱尔维森，杰夫威尔克，Velt Ventures，SOSV的IndieBio和网格指数。 ", "note_en": "Beeflow, a startup that today announced the close of a $8.3 million Series A round, is looking to both save the bees and help farmers be more efficient and effective at the same time.\n The startup uses proprietary scientific technology that essentially makes bees healthier, particularly in cold weather. A wealth of research led the company to understand that certain plant-based foods and molecules, when fed to the bees, can reduce the mortality rate of bees by up to 70 percent, and help them perform better in colder weather.\n   Bees are the planet’s natural pollinators. They turn flowers into fruit, spreading pollen from one landing spot to another. Many farmers will ‘rent out’ bees from beekeepers to hang out on their farms and pollinate their plants. In almost every way, the effectiveness of this can’t be measured, and the bees themselves can’t truly be controlled.\n Beeflow’s technology ensures that the bees are healthy and strong, and can fly up to 7x more during colder weather than they’d be able to without it. This means that those bees are much more likely to effectively and efficiently pollinate crops for the farmers.\n Beyond reducing the mortality rate of bees, the company also offers a second product called ToBEE, which trains the bees to target a specific crop, such as blueberries or almonds.\n  Beeflow’s business model is two-fold. They have their own bees that they loan out to farmers for pollination, and also work with beekeepers to bring them into the Beeflow network. Bee keepers do not pay for Beeflow’s technology, but do hand over the rights to their relationships with farmers.\n The startup was founded by Matias Viel, who is from Argentina, and is mostly operational in Latin America and the West Coast of the U.S., with plans to expand to the East Coast and Mexico.\n “The greatest challenge is operational and around execution,” said Viel. “There is so much demand and we need to scale our team and our operations now.”\n The financing round was led by Ospraie Ag Science, with participation from Future Ventures’ Steve Jurvetson, Jeff Wilke, Vectr Ventures, SOSV’s IndieBio and Grid Exponential.", "posttime": "2021-06-29 23:45:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "蜜蜂,save", "title": "Beeflow筹集了830万美元来拯救蜜蜂并将它们放在工作中 ", "title_en": "\n\t\t\t\tBeeflow raises $8.3 million to save the bees AND put them to work\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/beeflow-raises-8-3-million-to-save-the-bees-and-put-them-to-work/", "via": "", "real_tags": ["蜜蜂", "save"]}, {"category": "", "categoryclass": "", "imagename": "b2fe39cba7de42376c94f84622dd811a.jpg", "infoid": 1068611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "延期由物资影响，规模风险伙伴和校准企业，并以现有的投资者特克芬州风险投资和工业机器人巨头ABB为主导。最新一轮将公司的总资金带到约5800万美元。\n 公司成立于2013年，采用新颖的采摘机器，带有柔软的气动动力夹具，非常适合可能被刚性机器人损坏的脆弱食品。当然，食品是由于劳动力短缺和疾病传播恐惧，在大流行期间对自动化兴趣的主要目标。\n   “今天的工业机器人无法处理通常在农业，食品加工和物流等领域挑战食品供应链中发现的产品变异或非结构化环境，”软机器人Coomark Chiappetta在释放中表示。 “随着我们革命性的软抓斗，3D感知和AI技术，软机器人通过增强广泛使用的工业机器人来解锁机器人自动化，具有真正的手眼协调，允许他们执行传统上只能由人工执行的任务。”\n 这一轮也看到了泰森食品的投资翼，泰森冒险加入折叠。泰森在大规模卷中生产家禽，牛肉和猪肉，是现有客户。\n “在泰森企业，我们不断探索自动化的新领域，可以提高安全性并提高我们团队成员的生产力，”泰森·福勒的Rahul Ray在释放中表示。 “软机器人专业级别的机器人技术，计算机视觉和AI平台有可能改变食品行业，并将在任何公司的自动化旅程中发挥关键作用。” ", "note_en": "The extension was led by Material Impact, Scale Venture Partners and Calibrate Ventures and featured existing investors Tekfen Ventures and industrial robotics giant ABB. The latest round brings the company’s total funding to around $58 million.\n Founded in 2013, the company takes a novel approach to picking machines, with a soft, pneumatic-powered gripper that’s ideal for fragile food stuffs that might otherwise be damaged by rigid robotics. Food, of course, has been a prime target for interest in automation during the pandemic, due to labor shortages and fears of disease transmission.\n   “Today’s industrial robots are unable to deal with product variability or unstructured environments typically found across the labor challenged food supply chain in areas such as agriculture, food processing, and logistics,” Soft Robotics COO Mark Chiappetta said in a release. “With our revolutionary soft grasping, 3D perception, and AI technologies, Soft Robotics unlocks robotic automation by augmenting widely available industrial robots with true hand-eye coordination allowing them to perform tasks that traditionally could only be performed by human workers.”\n The round also sees Tyson Food’s investment wing, Tyson Ventures joining the fold. Tyson, which produces poultry, beef and pork in massive volumes, is an existing customer.\n “At Tyson Ventures, we are continually exploring new areas in automation that can enhance safety and increase the productivity of our team members,” Tyson Ventures’ Rahul Ray said in the release. “Soft Robotics’ best-in-class robotic technology, computer vision and AI platform have the potential to transform the food industry and will play a key role in any company’s automation journey.”", "posttime": "2021-06-29 23:45:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,狂欢,robotics", "title": "软机器人筹集了另外1000万美元，引用狂欢相关的需求 ", "title_en": "\n\t\t\t\tSoft Robotics raises another $10M, citing pandemic-related demand\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/soft-robotics-raises-another-10m-citing-pandemic-related-demand/", "via": "", "real_tags": ["机器人", "狂欢", "robotics"]}, {"category": "", "categoryclass": "", "imagename": "248402875fb71b601b015f9bb8809525.jpg", "infoid": 1068610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“谢谢，陶醉，是我们在这个国家所需要的例子[...]感谢您向县城展示它可以完成如何，”星期二开幕活动的格兰霍姆说。\n Revel的SuperHub将拥有25个品牌无话的RTM75充电器，来自DC快速充电制造商氚。根据Reig的说法，这个床上的充电站24-7次开放，将成为北美最大的通用充电站。\n  超过三分之二的纽约市能源网目前由化石燃料供电，这意味着纽约市纽约市的温室气体排放量来自电力。国家有雄心勃勃的计划，要求州际电力达到70％，到2030年和100％碳含有2040年的碳。这可能很难在迫在眉睫的两个核反应堆上迫在眉睫的两个核反应堆，这是大约四分之一据2018年数据来自市长办公室，其能源。此外，大多数形式的可再生能源需要足够的空间来利用太阳能或风力，这在像纽约这样的密集和昂贵的城市中会倍增。\n 谈到权力，Superhub位于旧辉瑞制造业建筑，在潮流的大道上，一个带有七个兆瓦的电力的网站。\n “这个网站上有足够的力量，我们已经以未来的方式建立了这个网站，因此可以将来可以在未来升级每个充电器，而无需挖掘任何基础架构，”Reig告诉TechCrunch。 “所以如果我们想在两年后从现在开始250或350个充电器，从现在开始三年，因为汽车能够接受这些类型的速度，我们可以做到这一点。”\n Revel还选择将其充电站放在辉瑞建筑物，因为它是在“纽约市的城市核心”，而不是在机场或私人车库中，在理想地希望收费的大多数纽约人无法进入充电器。在街上。\n “我们在最近关于股权的一个小组上，以及陶醉的一件事是非常强烈的事情，这不仅仅是这个网站，而且在未来的任何网站，也没有停车费可以获得充电器的停车费，“杰格说。 “因此，与纽约的许多快速充电器相反，您必须支付10至20美元的停车库，以便停车您的汽车，然后您必须支付充电器，本网站完全公开可用24-7。没有入学费。你唯一支付的是电力本身就是电力。“ \n每千瓦时抵制汽车费用为39美分，全部充电将其变成约15至20美元，并且不应超过15到30分钟。虽然司机等待，他们可以访问旧辉瑞建筑内的重新设计空间，现在是初创公司和食品巨型法庭的合作空间，因为这就是布鲁克林的努力。\n  Revel的充电器将在该网站上占据第三三分之一的停车场，并举办50个特斯拉斯的舰队，弥补其陷入困境的乘车服务，也有指定的停车位，他们会在一夜之间充电。 Reig说，这使得在他们倾向于为他们的汽车充电的时间提供能源需求，这是早上，下午和傍晚。\n Reig期待着最初的充电器最大的使用是来自Revel的Ridehail舰队，而是纽约的出租车和豪华轿车委员会（TLC）上周投票赞成，以阻止电动汽车发行新的雇用车辆许可证。当雷艾4月宣布新的服务时，它希望在城市的规则中浏览漏洞，这些规则可豁免来自新的车辆的轮椅可访问和电动车辆，该概率旨在遏制新优步和新超级的金额和Lyft司机接管街道。\n “我们绝对与TLC合作，”Reig说。 “显然，我们最近的裁决对未来的豁免感到失望。但是，你知道，我们现在正在探索与他们的方式进入路上，我们将来会找到一个解决方案。我们与总是提供的每个产品系列合法运作，我们将继续在此业务中执行此操作。“ ", "note_en": "“Thank you, ⁦Revel, for being an example of what we need in this country[…] Thank you for showing the county how it can be done,” said Granholm at the opening event on Tuesday.\n Revel’s superhub will have 25 brand-agnostic, RTM75 chargers from DC fast charging manufacturer Tritium. According to Reig, this Bed-Stuy charging station, which is open 24-7, will be the largest universal charging station in North America.\n  More than two-thirds of New York City’s energy grid is currently powered by fossil fuels , meaning about a quarter of NYC’s greenhouse gas emissions come from electricity. The state has ambitious plans to require statewide electricity to be 70% renewable by 2030 and 100% carbon-free by 2040. This might be difficult to accomplish given the imminent shutting down of Indian Point’s two nuclear reactors which provide the city with about a quarter of its energy, according to 2018 data from the mayor’s office. In addition, most forms of renewable energy require plenty of space to harness solar or wind power, which will be doubly difficult in a dense and expensive city like New York.\n Speaking of power, the superhub is located at the old Pfizer manufacturing building on Flushing Avenue, a site with seven megawatts of power.\n “There’s enough power at this site and we have built this site in a future-proofing sort of way, so that every single charger can be upgraded in the future without having to dig up any infrastructure,” Reig told TechCrunch. “So if we want to put a 250 or 350 charger in two years from now, three years from now, as cars are able to accept those kinds of speeds, we can do that.”\n Revel also chose to place its charging station at the Pfizer building because it’s at “New York City’s urban core,” rather than far out at the airports or in private garages where chargers are inaccessible to the majority of New Yorkers who would ideally like to charge on the street.\n “  We were on a panel recently about equity , and one of the things that Revel feels very strongly about is making sure not just this site but any site in the future as well, there won’t be parking fees to get access to the charger,” said Reig. “So as opposed to many fast chargers in New York where you have to pay a parking garage $10 to $20 to park your car, and then you have to pay for the charger, this site is completely publicly available 24-7. There are no entrance fees. The only thing you’re paying is electricity itself.”\n  Charging up a car costs 39 cents per kilowatt hour, which turns into about $15 to $20 for a full charge, and that shouldn’t take more than 15 to 30 minutes. While drivers wait, they can access the redesigned space inside the old Pfizer building, which is now a co-working space for startups and a food giant court, because that’s what Brooklyn does.\n  Revel’s chargers will take up about a third of the parking lot at the site, and Revel’s fleet of 50 Teslas that make up its troubled ridehail service also have designated parking where they’ll charge overnight. Reig says this makes energy demand available for individual EV owners at the hours they tend to charge their cars, which is in the morning, afternoon and early evening.\n Reig is expecting the biggest usage of the chargers at first to come from Revel’s ridehail fleet, but the   NYC Taxi and Limousine Commission (TLC) voted last week to block the issuance of new for-hire vehicle licenses  for electric vehicles. When   Revel announced its new service in April , it was hoping to skirt by on a loophole in the city’s rules that exempts wheelchair-accessible and electric vehicles from the new vehicle-for-hire cap that was designed to curb the amount of new Uber and Lyft drivers taking over the streets.\n “We’re absolutely working with the TLC,” said Reig. “Obviously we’re disappointed by their recent ruling to take away the EV exemption in the future. But, you know, we’re exploring ways with them right now to get on the road, and we’re going to be finding a solution in the future. We operate legally with every product line always offered, and we’re going to continue to do that here with this business.”", "posttime": "2021-06-29 23:44:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,unveils,充电器", "title": "Revel推出电动汽车快速充电超楼，布鲁克林25个充电器 ", "title_en": "\n\t\t\t\tRevel unveils electric vehicle fast charging superhub with 25 chargers in Brooklyn\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/revel-unveils-electric-vehicle-fast-charging-superhub-with-25-chargers-in-brooklyn/", "via": "", "real_tags": ["推出", "unveils", "充电器"]}, {"category": "", "categoryclass": "", "imagename": "2ca5a0a8604e1d568738cdce72a13ccb.jpg", "infoid": 1068609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "出现资本增长伙伴Doug Landis将加入我们讨论早期公司如何为投资VCS构建正确的故事。这是一个重要的，但欠额度的方面，帮助将公司与其他初创公司争夺相同的风险资金。\n 兰迪斯知道关于讲故事的一两件事。在加入出现作为增长伙伴之前，它实际上是他的职称的一部分，作为首席讲故事者和销售生产率的VP，并在框中启动。在此之前，他曾担任谷歌和企业销售生产力高级总监培训经理的Salesforce。\n  如今，Landis推动了出现资本的投资组合公司的销售和上市战略，致力于帮助开发萨斯世界的下一个主要参与者。\n Landis正在为我们的TC初期加入堆积的阵容：营销＆amp;筹款活动。该清单包括Sequoia的Mike Vernal（产品市场适合所有关于Tempo），Coatue的Caryn Marooney（以前的Facebook的Comms负责人）和超人的Rahul Vohra（增长黑客）和设计师基金的斯科特·通（Ifttt联合创始人和前者的产品设计头部在Pinterest）。立即抓住您的票证参加Landis会议加20（包括投票）！ ", "note_en": "Emerge Capital Growth Partner Doug Landis will be joining us to discuss how early stage companies can build out the proper story for pitching VCs. It’s an important, but underdiscussed aspect of helping set your company apart from countless other startups vying for the same venture funding.\n Landis knows a thing or two about storytelling. Before joining Emergence as a growth partner, it was actually part of his job title, serving as the chief storyteller and VP of sales productivity and enablement at Box. Before that, he served as a skills training manager at Google and senior director of corporate sales productivity at Salesforce.\n  These days, Landis drives sales and go-to-market strategies for Emergence Capital’s portfolio companies, working to help develop the next major player in the SaaS world.\n Landis is joining  a stacked lineup for our  TC Early Stage: Marketing &amp; Fundraising event. The list includes Sequoia’s Mike Vernal (Product Market Fit Is All About Tempo), Coatue’s Caryn Marooney (formerly Facebook’s head of comms) and Superhuman’s Rahul Vohra (Growth Hacking) and Designer Fund’s Scott Tong (IFTTT co-founder and former head of product design at Pinterest).  Grab your ticket now to attend Landis’s session plus 20 others (including a pitch off)!", "posttime": "2021-06-29 23:44:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tc,landis", "title": "Doug Landis出现资本增长合作伙伴，将于7月份在TC早期展示TC的启动讲故事 ", "title_en": "\n\t\t\t\tDoug Landis, Emerge Capital growth partner, will talk startup storytelling at TC Early Stage in July\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/doug-landis-emerge-capital-growth-partner-will-talk-startup-storytelling-at-tc-early-stage-in-july/", "via": "", "real_tags": ["tc", "landis"]}, {"category": "", "categoryclass": "", "imagename": "fecffa2ea2ac7468e7d6db1a42e9c87d.png", "infoid": 1068608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Belli是一个小型LA的启动，一个用于挑战Gen Z如何发送数字贺卡的应用程序，正在挑选一些投资者在现代赠送的哲学中获取一些种子资金。初创公司已筹集了由Reddit联合创始人Alexis Ohanian的七七六六的300万美元种子轮，而Snap的黄色加速器也参加了加薪。\n 在放弃婚礼的身体邀请之后，妻子和丈夫联合成立队偶然发现了数字问候和礼物的世界，并探索了数字问候空间如何，并没有进化。他们已经采取了一种移动 - 首先解决了对用户只想让别人知道他们在想他们的特殊活动和时刻的问候。\n   “最初，我们认为它主要是生日和类别，如婚礼，毕业等等，我认为我们刚刚扔了一些'只是因为'卡，但随后将成为最受欢迎的类别，到目前为止，”首席执行官Nicole Emrani绿色告诉TechCrunch。 “我认为这是揭开了我们的病毒性的原因，因为明显地随着每一个撒谎发送，你已经把别人拉进来，然后谈话继续。”\n 该应用程序通过3.99美元的每月高级订阅货入，为用户提供了来自40多名艺术家的更多数字问候设计，该艺术家从中获得了许可的工作。向前支付优质订阅，用户还可以购买数字礼品卡，并与其问候一起送交。 Felli的礼品卡店面有超过150个品牌，包括亚马逊，Spotify，Nike和Doordash。\n 披露的大型销售是其定制。虽然用户被推动从数百种可用的贺卡中进行选择，但它们也可以通过添加照片或视频来补充它们，除了编写文本。目的是创建一个可通过电子邮件，文本或社交媒体服务共享的竞争对手的时刻。\n “对于一代数字原生用户来说，从我们的手机上快速刷新或拍摄快速文本的能力并不令人惊讶地成为我们与他人联系的主要方式，”俄亥俄州在新闻稿中宣布种子循环。 “首先吸引了我撒谎的是，妮可和本急性地理解这一进化并建立了一个平台，提供了提升这些互动和深化联系所需的创意工具。无论是发送数字生日礼物，还是因为 - 很明显，赐给莱邮件发出通知。“\n 其中一个团队的大挑战一直突出了他们的本机应用程序的可见性，用户将用户下载发送问候语。去年秋天，秀丽团队通过禁止搭扣搭档，它通过一口大小的捕捉迷你应用程序集成带来了Snapchat中的赠送服务。该卷展栏遵循启动的参与Snap的Yellow Accelerator程序。 \nEmrani Green表示，合作伙伴关系有助于为他们的平台带来更多用户，并且超过500万人已经使用Sli以2019年推出的应用程序发送问候。 ", "note_en": "Givingli, a small LA-based startup with an app aiming to challenge how Gen Z sends digital greeting cards, is picking up some seed funding from investors betting on their philosophy around modern gifting. The startup has raised a $3 million seed round led by Reddit co-founder Alexis Ohanian’s Seven Seven Six, while Snap’s Yellow Accelerator also participated in the raise.\n The wife and husband co-founding team stumbled into the world of digital greetings and gifts after abandoning physical invitations for their wedding and exploring how the digital greetings space had and hadn’t evolved. They’ve taken a mobile-first approach to tackling greetings for special events and moments where users just want to let someone know they’re thinking of them.\n   “Initially, we thought it would mainly be birthdays and categories like weddings, graduation, etc., and I think we just threw in some ‘just because’ cards, but then that became the most popular category, by far,” CEO Nicole Emrani Green tells TechCrunch. “I think that it’s what kicked off our virality, because obviously with every Givingli sent you’re pulling someone else in and then the conversation continues.”\n The app monetizes through a $3.99 monthly premium subscription which gives users access to a greater variety of digital greeting designs from the more than 40 artists that the startup has licensed work from. Alongside paying for premium subscriptions, users can also shop for digital gift cards to send along with their greetings. Givingli’s gift card storefront has more than 150 brands available including Amazon, Spotify, Nike and DoorDash.\n A big sell for Givingli’s offering has been its customization. Although users are pushed to select from the hundreds of available greeting cards, they can also spice them up by adding photos or videos in addition to writing text. The aim is to create a moment that rivals messages that can be shared via email, text or on social media services.\n “For a generation of digitally native users, it’s not surprising that the ability to like, swipe, upvote or shoot a quick text from our phones have become the predominant ways we connect with others,” said Ohanian in a press release announcing the seed round. “What first attracted me to Givingli is that Nicole and Ben acutely understood this evolution and built a platform that provides the creative tools needed to elevate those interactions and deepen connections. Whether it’s sending a digital birthday gift, or a note just because – it’s clear that Givingli has put snail mail on notice.”\n One of the team’s big challenges has been highlighting the visibility of their native app which users download to send greetings. Last fall, the Givingli team debuted a partnership with Snap that brought their gifting service inside Snapchat via a bite-sized Snap Mini app integration. The rollout followed the startup’s participation in Snap’s Yellow Accelerator program.\n Emrani Green says that partnership has helped bring more users to their platform, and that more than 5 million people have used Givingli to send greetings since the app launched in 2019.", "posttime": "2021-06-29 23:44:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "贺卡,greeting,数字", "title": "数字贺卡启动胶粘剂包装300万美元种子 ", "title_en": "\n\t\t\t\tDigital greeting card startup Givingli wraps $3 million seed round\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/digital-greeting-card-startup-givingli-wraps-3-million-seed-round/", "via": "", "real_tags": ["贺卡", "greeting", "数字"]}, {"category": "", "categoryclass": "", "imagename": "a2cc3137e4ee29dcbb58282675d87469.jpg", "infoid": 1068607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于两个队列，它似乎迅速系列B可以在冒险中，VCS希望早期获得资本。\n  交易所探索初创公司，市场和金钱。每天早上都在额外的紧缩或每周六获得交换时事通讯。\n  早期初创公司的拉丁美洲风险投资市场有许多类似的标志。这不应该令人惊讶。根据Seth Pierrexecont，伦敦的加权合作伙伴，“筹款动态现在不再是美国或欧洲特定的 - 他们是全球性的。”筹集了ZOOM等视频会议服务，比在各国内部不太有影响的地理距离 - 它甚至是国界，甚至海洋也不太有意义。\n 欧洲启动市场是否类似于我们在拉丁美洲和美国看到的内容 - 北美风险投资现场的一个同源，鉴于圆形计数和投资金额的全球重量授予其局限性的重量？\n 在很大程度上，是的，似乎兴起价格和人才大战的趋势。今天早上，我们正在考虑早期的风险投资市场，这次通过欧洲镜头，从大陆的少数投资者提供帮助。\n  广泛地说，欧洲的早期风险资本回合正在发生“早期，规模较大，”根据伦敦投资者的投资者的vinoth Jayakumar，根据德国·埃斯普利的vinothjayakumar。 Jayakumar的说法，初创次较年轻的较大轮次的相关性升值是估值的扩张，据jayakumar表示，价格正在上涨“因为在正常在普通 - 或在这种情况下，更大的回合是非常稀释的创始人 - 或者在这种情况下太低了 - 估值太低了。” ", "note_en": "For both cohorts, it appeared that a rapid-fire Series B could be in the offing, with VCs looking to get capital into winners early.\n  The Exchange explores startups, markets and money.   Read it  every morning on Extra Crunch or get  The Exchange newsletter every Saturday.\n  The Latin American venture capital market for early-stage startups  had a number of similar hallmarks. That shouldn’t have been surprising. According to  Seth Pierrepont, a partner at London-based Accel, “fundraising dynamics are now no longer U.S.- or European-specific — they’re global.” Fundraising over videoconferencing services like Zoom has done more than make geographical distances less impactful inside of countries — it’s even made national borders and even oceans less meaningful.\n Is the European startup market similar to what we’ve seen in Latin America and the United States — a cognate for the North American venture capital scene, given its outsized global weight by round count and amount invested?\n Largely, yes, a trend that appears to be shaking up prices and the talent wars. This morning, we’re taking a final look at the early-stage venture capital market, this time through a European lens, with an assist from a few investors from the continent.\n  Broadly, early-stage venture capital rounds in Europe are happening “earlier and are larger in size,” according to  Draper Esprit’s Vinoth Jayakumar, an investor based in London. The correlate of larger rounds being raised while startups are younger is valuation expansion, according to Jayakumar, who said that prices are going up “because larger rounds are very dilutive to founders if done at normal — or in this case too low — valuations.”", "posttime": "2021-06-29 23:44:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "级联,stage,早期", "title": "晚期资本正在欧洲VC活动中具有“级联效应” ", "title_en": "\n\t\t\t\tLate-stage capital is having a ‘cascading effect’ on European VC activity\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/late-stage-capital-is-having-a-cascading-effect-on-european-vc-activity/", "via": "", "real_tags": ["级联", "stage", "早期"]}, {"category": "", "categoryclass": "", "imagename": "c58481466e15dddd3dcc1f8ad5060b0f.gif", "infoid": 1068606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周的空间是关于预备步骤的全部 - 它看起来越来越像我们七月局面的那样，只需几天就在该月开球之前。\n    Spacex总统Gwynne Shotwell周五告诉虚拟会议与会者，该公司希望在下个月早期首次将其星舰火箭飞到轨道上。 Starship已经完成了许多测试航班到目前为止，包括可以从发射到登陆的情况下进入一个。\n Starship的第一个轨道测试是宇宙飞船的发展计划的重要里程碑，如果它确实发生在7月份，这是发射公司的令人印象深刻的转变，这一直是南德克萨斯州南德克萨斯州的星舰及其超重助推器。\n 与星舰轨道的轨道并不意味着Spacex准备好使用车辆进行商业任务;第一次尝试，如果火箭测试的历史是任何指示，可能不会那么好，只是看到原型如何处理空间。 Spacex将使用后面的测试来改进Starship的其他关键组件，包括其受控的重新入口和登陆烧伤。\n 在星舰可以试图留下地球的大气限制之前，它需要从FAA获得清关，甚至这样做，这还在等待。然而，Spacex和FAA似乎有一个有点充满了紧张的关系，特别是在星舰测试方面。\n   原始银河在始于将其付费乘客达到太空之前，靠近一系列船员测试航班。它还仅收到FAA的批准为其“间距”运营商的许可证，这就像航空公司，而是拥有空间。\n 这是对现有的商业航天许可证的适应，现在允许它进入运输支付乘客，包括空间游客和研究人员，以使用其SpaceshipTWO车辆的低地轨道。这是一个关键的成分，但公司仍将进行其系列三次测试航班，这是第一个在船上拥有完整的船员，在实际上确实开始以这种能力运行。根据当前的计划，Richard Branson将成为这三次测试航班的第二个测试航班的乘客。 \nTartup Orbion为其等离子体推进器技术筹集了2000万美元的B系列B. 等离子推进器是空间内推进的关键手段，这是诸如低地轨道成为高交通区的越来越小的航天器运营商的出现而蓬勃发展的部门。  orbion的方法可以降低生产成本，并通过扩展，其客户的成本使得该技术更适合资源受限卫星初创公司。  去年我们举办了我们的第一个专门的空间事件，这很好，我们决定在2021年再次举办它。今年，它正在发生12月14日和15日，它再次成为一个完全虚拟会议，所以人们从 世界各地都可以加入 - 而且你也可以。 ", "note_en": "Space this week was all about preparatory steps — and it’s looking more and more like we’re setting up for an out-of-this-world July, with just a few days left before the month kicks off.\n    SpaceX President Gwynne Shotwell told virtual conference attendees on Friday that the company is hoping to  fly its Starship rocket to orbit for the first time as early as next month. Starship has completed quite a few test flights to date, including one that went as well as could be expected right from launch to landing.\n The first orbital test of Starship is a significant milestone for the spacecraft’s development program, and if it does indeed happen in July that’s an impressive turnaround for the launch company, which has been working on both Starship and its Super Heavy booster in south Texas.\n Getting to orbit with Starship won’t mean that SpaceX is ready to use the vehicle for commercial missions, however; this first attempt, which if the history of rocket testing is any indication, might not go so well, will just be about seeing how the prototype handles space. SpaceX will use later tests to refine other key components of Starship, including its controlled re-entry and landing burn.\n Before Starship can attempt to leave Earth’s atmospheric confines, it needs to get clearance from the FAA to even do so, and that’s still pending. SpaceX and the FAA seem to have a somewhat fraught relationship, however, especially as regards Starship testing.\n   Virgin Galactic is gearing up for a final series of crewed test flights before it begins taking its paying passengers up to space. It also just  received approval from the FAA for its ‘spaceline’ operator’s license, which is like an airline but with space.\n This is an adaptation of its existing commercial spaceflight license that now allows it to also begin transporting paying passengers, including space tourists and researchers, to low Earth orbit using its SpaceShipTwo vehicle. That’s a key ingredient, but the company will still be doing its series of three test flights, the first ever with a full crew on board, before it actually does begin operating in that capacity. Richard Branson is set to be a passenger on the second of those three test flights, according to the current plan.\n  tartup  Orbion has raised a $20 million Series B for its plasma thruster technology. Plasma thrusters are a key means of in-space propulsion, and that’s a booming sector in light of the emergence of more and more small spacecraft operators as low Earth orbit becomes a high-traffic zone.\n Orbion’s approach reduces the cost of production and, by extension, the cost to its clients, which puts the technology more within reach for resource-constrained satellite startups.\n  Last year we held our first dedicated space event, and it went so well that we decided to host it again in 2021. This year, it’s happening December 14 and 15, and it’s once again going to be an entirely virtual conference, so people from all over the world will be able to join — and  you can, too.", "posttime": "2021-06-29 23:43:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "许可,licensed,空间", "title": "MAX问：许可空间 ", "title_en": "\n\t\t\t\tMax Q: Licensed to space\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/max-q-licensed-to-space/", "via": "", "real_tags": ["许可", "licensed", "空间"]}, {"category": "", "categoryclass": "", "imagename": "4feb8d299ddac75b8e525c87223083db.jpg", "infoid": 1068605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年，Trauma Surgeon Dr.alex Young培训了手术等高应力场景所需的培训，并将其应用于虚拟现实环境，结束，他说，一种激进和有效的培训方法。\n 他的数字训练平台Virti现在已经筹集了1000万美元的一系列由IQ Capital领导的一系列，该系列由Cedars-Sinai Medical Center和新的英国学习技术VC基金，脱口资本加入。在其他新闻中，Kurt Kratchman和Mark Ashworth分别从Oracle作为CRO和CFO / COO。\n  在英国布里斯托尔成立，Virti平台在移动或桌面设备上工作，或VR / AR耳机，并捕获所有三个的数据，以分析，衡量，并提供对员工性能的反馈，将大量主观评估的技能转化为更客观和更多可测量的数据。它甚至设法被命名为2020年的最佳发明。\n Virti声称其深度学习技术正在提高培训结果，高达230％，初创公司表示，它增加了978％的收入。它还具有基于云的无代码仿真创建套件，允许组织构建自己的定制培训模块。\n Vieti的亚历山大·杨博士博士评论了：“在Vieti，我们的目标是通过使体验学习实惠并为每个人提供能力来最大限度地提高人类性能。在人的培训始终与电子学习往往昂贵的培训往往不挂起 - 并且研究表明，员工忘记了80％的焦点训练。“\n Max Bautin，IQ Capital的管理合作伙伴说：“电子学习在过去5年中看到了强劲的增长，并且Covid驱动的遥控器的转变多次增加了需求。 Virti的Deeptech经验学习平台是迄今为止世界上最好的。“\n Virti与基于普通的桌面培训解决方案竞争。但在VR方面，斯特利尔的更多筹集了5100万美元，而穆斯森筹集了3510万美元。 \n通过一个呼叫年轻人说话，我们告诉我：“我们的系统，我们在分析方面获得专利，实际上可以跟踪他们在虚拟现实耳机中的观察。 因此，我们可以真正删除一些深入的订婚度量，有点像在营销平台上看到的热门地图数据。 结合人们如何互动和做出如在这些环境中做出决策的方式，我们可以预测如何在现实世界环境中更好地表现，并在报告仪表板上分享。 另一方面是如果你没有练习你忘记你可以学到的80％的东西。 我们的系统允许人们跳回并提醒他们，因为它可以在移动和VR，AR耳机上访问，他们会得到更多的更新和学习，以使他们备受熟练和记住的信息更长。“ ", "note_en": "In 2018, trauma surgeon Dr. Alex Young took the training required for high-stress scenarios like surgery and applied it to a virtual reality environment, ending up with, he says, a radical and effective approach to training.\n His digital training platform  Virti has now raised $10 million in a Series A round led by IQ Capital, which was joined by Cedars-Sinai Medical Center and a new, UK-based learning technology VC fund, Descenture Capital. In additional news, Kurt Kratchman and Mark Ashworth join Virti from Oracle as CRO and CFO/COO respectively.\n  Founded in Bristol, UK, the  Virti platform works across mobile or desktop devices, or VR/AR headsets and captures data across all three to analyze, measure, and give feedback on employee performance, turning a lot of subjectively assessed skills into more objective and measurable data. It’s even managed to have been named one of TIME’s Best Inventions of 2020.\n Virti claims its deep learning technology is improving training outcomes by up to 230% and the startups says it has increased revenues by 978%. It also has a cloud-based, no-code simulation creation suite allowing organizations to build their own bespoke training modules.\n Dr Alexander Young, CEO and founder of Virti, commented: “At Virti, our goal is to maximize human performance by making experiential learning affordable and accessible for everyone. In-person training has always been expensive with e-learning often unengaging – and research shows that employees forget upwards of 80% of episodic training.”\n Max Bautin, managing Partner at IQ Capital, said: “E-learning has seen strong growth over the last 5 years, and COVID-driven shift to remote work has increased demand many times over. Virti’s deeptech experiential learning platform is by far the best in the world.”\n Virti competes with normal desktop-based training solutions. But on the VR side, more so with StriVR which has raised $51 million, and Mursiun which has raised $35.1 million.\n Speaking to me over a call Young told me: “Our system, which we’ve patented in terms of the analytics, can actually track what people are looking at if they’re in a virtual reality headset. So we can really pull out some deep engagement metrics, a bit like heat map data you might see on marketing platforms. Combined with how people are interacting and doing things like making decisions in these environments, we can then predict how they may perform better in real-world environments and share that on a reporting dashboard. The other aspect is if you’re not practicing things you forget about 80% of what you can learn. Our system allows people to jump back in and reminds them and because it’s accessible on mobile as well as VR, AR headsets, they get that hit of updates and learning to keep them up-skilled and remembering information for longer.”", "posttime": "2021-06-29 23:43:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "教导,platform,培训", "title": "培训平台Virti通过IQ Capital募集了1000万美元的系列A LED，以教导VR中的软技能 ", "title_en": "\n\t\t\t\tTraining platform Virti raises $10M Series A led by IQ Capital to teach soft skills in VR\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/training-platform-virti-raises-10m-series-a-led-by-iq-capital-to-teach-soft-skills-in-vr/", "via": "", "real_tags": ["教导", "platform", "培训"]}, {"category": "", "categoryclass": "", "imagename": "bf3299a6f9ce3b392798c5fd13e9076d.jpg", "infoid": 1068604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "公司没有分享交易条款，但用风筝，公司获得了一支顶级研究人员，可以帮助加强公司学习翻译知识。 “风筝”人才队的12个研究科学家将帮助ZOOM的工程团队提前推进[机器翻译]的领域，通过为ZOOM用户提供多语言翻译功能，“公司在一份声明中表示。\n 这笔交易似乎是一项聘用，因为公司将这12名研究人员添加到Zoom Engineere Group。它打算将团队留在德国的计划，计划建立机器学习翻译R＆amp; D中心随着时间的推移，随着公司的推移，随着公司的资源进入这个领域。\n  虽然风筝网站除了地址以外，但该公司在LinkedIn上的页面表示，该公司在2015年由两名研究人员创立，他们在卡内基梅隆和卡尔斯鲁厄工业大学授课，采用了建筑机器学习翻译工具的目标。\n “风筝特派团是打破语言障碍，使无缝的跨语言互动日常生活的现实，”LinkedIn概述陈述。它声称包括谷歌和微软的少数公司之一，已经开发出“领先的语音识别和翻译技术”，这表明Zoom已获得一些关键技术。\n 它没有出现公司拥有商业产品，但该网站确实表明，在学术界和政府中有一个机器学习翻译平台。无论如何，该公司的研究结果现在属于缩放。 ", "note_en": "The companies did not share the terms of the deal, but with Kites, the company gets a team of top researchers, who can help enhance the machine learning translation knowledge at the company. “Kites’ talented team of 12 research scientists will help Zoom’s engineering team advance the field of [machine translation] to improve meeting productivity and efficiency by providing multi-language translation capabilities for Zoom users,” the company said in a statement.\n The deal appears to be an acquihire as the company adds those 12 researchers to the Zoom engineering group. It intends to leave the team in place in Germany with plans to build a machine learning translation R&amp;D center with additional hires over time as the company puts more resources into this area.\n  While the Kites website reveals little about it other than an address, the company  About page on LinkedIn indicates that the startup was founded in 2015 by two researchers who taught at Carnegie Mellon and Karlsruhe Institute of Technology with the goal of building machine learning translation tooling.\n “The Kites mission is to break down language barriers and make seamless cross language interaction a reality of everyday life,” the LinkedIn overview stated. It claims to be among a handful of companies, that include Google and Microsoft, to have developed “leading speech recognition and translation technologies,” which would suggest that Zoom has acquired some key technologies.\n It does not appear the company had a commercial product, but the site does indicate that there is a machine learning translation platform that is in use in academia and government. Regardless, the fruits of the company’s research will now belong to Zoom.", "posttime": "2021-06-29 23:43:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "获得,acquire", "title": "缩放以获得德国启动，将实时翻译与会议 ", "title_en": "\n\t\t\t\tZoom to acquire German startup to bring real-time translation to meetings\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/zoom-to-acquire-german-startup-to-bring-real-time-translation-to-meetings/", "via": "", "real_tags": ["获得", "acquire"]}]