[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1074120, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一家调查滥用权力行为的非营利新闻编辑室。我们最重要的故事一经发表，立即注册接收。\n这是一个星期五的晚上，在经历了一周特别辛苦的工作后，密西西比州玻利瓦尔县唯一的心脏病专家福卢索·法科雷德医生走进336号房。亨利·多斯特里躺在帆布床上，灰色的卷发在枕头上蓬松。法科雷德闻到了周围的环境——一股恶臭，就像死老鼠一样。他让一名护士解开多特瑞左脚的伤口，然后戴上丁腈手套检查伤口。多斯特里的小腿肿胀得几乎和大腿一样大。他的脚趾尖是黑色的；他的脚底是黄色的，渗出水来。法科雷德的肠子紧绷着。操，他想。烂透了。\n法科雷德被要求就此案进行咨询，他脱下手套，仔细阅读了多斯特里的图表：他67岁，从不吸烟。他的超声波检查结果显示他的腿部血液循环不良。不受控制的糖尿病似乎限制了他足部的血液流动，没有它，感染就无法治愈。一位外科医生把他的推荐信打了出来。它的开头是：“多特瑞的选择有限。”\n法科雷德扫视了一下房间。他有一双敏锐的眼睛，剃光头，38岁时，身材酷似业余健美运动员。多斯特里仍然很安静。他的嘴向下拱起，淡淡的眉毛高高地垂在眼睑上方，让他看起来难以置信。在他的小床旁边放着一个肉色的假肢，穿着黑色运动鞋保持平衡。\n“你是怎么失去另一条腿的？”法科雷德问道。多斯特里累了，一次中风使他的记忆力变慢了。糖尿病最近夺走了他的右腿，膝盖以下。他的左腿截肢会让他坐在轮椅上。\n法科雷德解释说，他不是那种割伤的医生。他在那里是因为他可以测试血液循环，让血液流动，试图防止任何不必要的截肢。他痛恨医生在他中风或失去双腿的时候没有对Dotsry进行筛查。“你的腿是双胞胎，”他说。“一个发生了什么，另一个也会发生什么。”\n多特瑞需要立即进行血管造影，这是一项显示动脉阻塞的成像测试。他还需要一个血管重建程序来清除斑块，用一根细导管刮除斑块，用小气球扩张血管。他的脚在快速腐烂。虽然法科雷德在附近开了一家门诊诊所，但当医生向他咨询当地医院玻利瓦尔医疗中心的住院病人时，他希望使用该中心的设施。\n他让护士安排手术时间。但是，当他开车回家到他位于小镇北边的牧场别墅时，他还没有得到答复。周六凌晨3:30醒来时，他也没有像每天早上那样醒来。日出时，他在厨房柜台前焦躁不安，给医院放射科主任发短信，解释周一马丁·路德·金日进行干预的必要性。几个小时后，他得到了回复：“我没有工作人员或物资。对不起。”\n现在，法科雷德疯了，他轻快地走进办公室，用扬声器给朋友们打电话，在会议室里踱来踱去。他在尼日利亚长大，十几岁时搬到新泽西州，五年前来到密西西比州训练。他对腿着迷，对非裔美国人截肢的人数感到愤怒。他在三角洲61号公路上的广告牌上宣布了他的抱负：“截肢预防研究所”\n1月份没人知道，但几个月后，新冠病毒将席卷美国，导致数万人死亡，其中黑人和糖尿病患者的比例过高。他们处于不利地位，受到一系列因素的威胁，从不平等的医疗保健机会到种族主义偏见，再到削减公共卫生资金。这些因素长期以来一直在推动不平等，尤其是在整个南方。观察糖尿病截肢最清晰的方法之一是追踪谁患有糖尿病截肢，从某种程度上说，糖尿病截肢是美国最可预防的手术。\n仔细观察，这些看似难以克服的障碍是由关键决定组成的，这些决定相互影响：一个专家小组决定不支持腿部血管疾病筛查；因此，法律允许保险公司不承担测试费用。联邦政府免除了服务不足地区一些医生的助学贷款，但不免除某些专家的助学贷款；因此，对治疗糖尿病并发症最关键的医生供不应求。医院、保险公司和政府制定的政策不需要外科医生在申请刀片之前考虑肢体拯救方案；截肢人数增加，尤其是在穷人中。\n尽管在糖尿病治疗方面取得了巨大的科学进步，但在2009年至2015年间，全国的截肢率增长了50%。糖尿病患者每年接受13万次截肢手术，通常发生在低收入和保险不足的社区。黑人患者失去四肢的速度是其他人的三倍。在一次手术中，这是美国医疗体系的主要罪过：节省预防性医疗费用，在后端支付高额费用，让慢性病患者和弱势群体感受到极端后果。\n法科雷德抓起车钥匙，前往医院。他径直走向实验室。正如他所怀疑的，实验室里有他所需要的所有用品。他们为什么不给我员工？他想知道。他们不会对外科医生那样做。\n他对这种违法行为几乎不能容忍。他是一个极端的军国主义者。对他来说，无法愈合的伤口就像心脏病发作。“时间就是肌肉，”他重复道。当护士们忘记检查病人的脚踝时，他会打电话给大家：“如果你还没有对双腿进行评估，我就不想走进那个房间。”他认为他的每一个步骤都是战争行为。当有人挡住他的去路时，他会发送一连串的短信，并以感叹号为标点。他用手机收集证据，证明该系统对他的病人和他的努力不利。\n他拿出iPhone，给医院的电线、导管、静脉输液器和端口保护器拍照。他向医院的放射科主任拍摄了这些照片。法科雷德的私人诊所因假日周末关闭。他估计，在多斯特里剩下的一条腿被截肢之前，他只有几天的时间来执行一些计划。\n两张地图解释了法科雷德为什么留在密西西比三角洲。其中一幅展示了美国因血管疾病而截肢的情况。第二幅展示了内战前被奴役的人口；他在一家种植园博物馆看到了它，被他们追踪得如此之近而震惊。他在手机上调出图像，显示医生、历史爱好者或任何愿意倾听的人。“面熟吗？”他问道，在地图之间切换。他看到人们意识到截肢是一种种族压迫，可以追溯到奴隶制时期。\n法科雷德最初打算在田纳西州练习时搬到三角洲。他与在密西西比州长大的医疗器械销售代表莫里斯·汉普顿成为朋友。汉普顿谈到了黑人家庭对当地医院的戒心，以及三角洲地区专门从事血管工作的黑人医生寥寥无几。他告诉法科雷德：“去沃尔玛看截肢手术或颈部烫伤是很正常的。”。“如果你没看到，那你就只呆了两分钟。”\n然后，在田纳西州工作一年多一点的时候，法科雷德发现自己陷入了困境。他担心自己的账单不是他的，并要求审计；尽管审计后来发现他工作的诊所报销了超过31.4万美元的不当费用，但他很快就被解雇了。法科雷德根据《虚假索赔法》起诉该诊所进行报复，结果败诉。（该诊所的律师表示，他的当事人对此不予置评，但法科雷德的离开有“许多”原因。）2015年春天，他有抵押贷款、25万美元的学生债务和四个月的遣散费。他也有一种理解三角洲的冲动。\n法科雷德花了四天的时间开车穿过长长的、平坦的农田，那里点缀着小城镇和猎枪房。木条房屋和崎岖不平的道路让他想起了他祖父母在尼日利亚翁多州的村庄，他小时候曾在那里度过夏天。他在密西西比高速公路上开了几十英里，一家杂货店也没看到；快餐连锁店照亮了最繁忙的十字路口。他被疾病的标志物吓了一跳——缺失的四肢和滚动的轮椅，手工建造的带金属栏杆的胶合板坡道。他认为截肢者就像“沙漏”，他说，“截肢者被截肢的那天就变成了沙漏。”手术后死亡率上升，部分原因是许多人停止行走。运动可以改善血液循环，控制血糖和体重。一个人活动越少，心脏病发作和中风的风险就越高。五年内，这些患者很可能已经死亡。\n法科雷德在北边的父母附近找了一份有利可图的工作，他的父母都被诊断出患有糖尿病。他在那里有职业关系；他曾就读于罗格斯大学罗伯特·伍德·约翰逊医学院，并在纽约长老会威尔·康奈尔医学中心实习。但他觉得南方需要他。美国大约有3000万人患有糖尿病，密西西比州的糖尿病发病率最高。绝大多数为2型；他们的身体抵抗胰岛素或胰腺分泌不足，导致血糖水平升高。遗传因素在这种情况下起了作用，但肥胖和营养获取也起了作用：高脂肪食物、含糖食物和纤维不足，以及很少锻炼。贫困会使患糖尿病的几率翻倍，同时也决定了截肢的几率。一项主要研究绘制了加利福尼亚州糖尿病患者截肢率的分布图，发现收入最低的社区截肢率是最富有社区的10倍。\n三角洲是密西西比州最贫穷的地区，健康状况最差。法科雷德花了数年时间研究健康差异：非裔美国人比白人更早患上慢性病十年；他们死于糖尿病的可能性是常人的两倍；他们平均少活三年。在三角洲，法科雷德可以治疗长得像他的病人；他在全州只能找到另外一位黑人心脏病介入医生。越来越多的证据表明，整个医疗系统中的种族偏见对非裔美国人来说意味着更糟糕的结果。他知道这项研究——黑人患者对黑人医生更敏感，也更信任他们。旅行结束后，他决定在密西西比州临时开业，并在三角洲深处租了一套公寓。\n他幻想着建立一个心血管研究所，并招募一个多学科团队，从电生理学家到足病学家。但当他研究这需要什么时，他发现了一个主要障碍。有学生债务的医学专家毕业时平均欠20万美元，除非他们在非营利或公共设施找到工作，否则通常无法从联邦贷款减免计划中受益。只有少数类型的私人执业提供者——初级保健、牙医、精神病医生——有资格获得国家贷款减免。三角洲需要许多其他医生。尽管玻利瓦尔县是糖尿病疫情的中心，但在100英里以内没有一位糖尿病专家，一位内分泌学家。\n法科雷德在克利夫兰医疗中心租了一个没有窗户的空间，这是一个以前的购物中心，后来被改建为医生办公室。人们带着心脏病来找他，但他也要求他们脱掉袜子。他们的腿吓了他一跳。他们的脚趾是黑色的，脉搏微弱。他们的小腿冰冷无毛。有些人有伤口，但并不知道；糖尿病使他们的脚麻木。许多人被误诊为关节炎或痛风，但当法科雷德对他们进行检测时，他发现了外周动脉疾病，即腿部动脉阻塞限制血液流动。\n这就是不受控制的糖尿病对你身体的影响：如果没有足够的胰岛素，或者当你的细胞不能正常使用胰岛素时，糖就会通过你的血液循环。斑块在血管壁中积聚得更快，减缓血液流向眼睛、脚踝和脚趾的速度。失明可能会随之而来，也可能是死亡组织。许多人感觉不到缺血肢体的疼痛；这种情况会破坏神经。如果颈部动脉闭塞，可能会导致中风。如果它们靠近心脏，心脏病就会发作。如果它们在腿部闭合，就会导致坏疽。\n不到一个月，玻利瓦尔医疗中心就给法科雷德颁发了资格证书，允许他在医院咨询病例和进行手术。他最复杂的病人是通过急诊室来的。有些人抵达时丝毫没有察觉到他们患了坏疽。其中一个有蛆在疮中钻洞。另一个在注意到他的狗吃了他脚趾尖上的死肉后出现了。法科雷德拍了一张照片来增加他的收藏。“这是一场公共卫生危机，”他告诉我。“没有人谈论截肢和正在发生的事情是犯罪的事实。”\n周末，法科雷德开车回他在田纳西州的五居室住宅，但在2015年8月，他决定全力攻打玻利瓦尔县。他卖掉了自己的房子和黑色梅赛德斯G型货车，并申请资金在密西西比州中部的三角洲地区建立一个机构：心血管解决方案。他把自己塑造成一名心脏病专家和水管工，负责清除动脉中的积存物。四家银行拒绝向他贷款，所以他向朋友借钱。他给了自己两年的时间来减少截肢并公布结果。\n三角洲洪泛平原沿着该州西北边缘绵延7000平方英里，在断崖和密西西比河两岸之间有着芳香的粘土状土壤。到了19世纪，原始森林已经变成了一个棉花帝国；内战开始时，许多三角洲县80%以上的人被奴役。解放后出现了佃农制，黑人农民耕种小块土地以换取一部分作物。在收获前，他们依靠信贷生活——食物、饲料和衣物——但即使在那时，他们的收入也很少能支付他们的开支。\n几十年来，南部的非裔美国人一直在努力寻找并支付医疗费用。美国医学协会排除了黑人医生，其成员协会也排除了黑人医生。一些医院通过后门接收黑人患者，并将他们安置在炎热拥挤的地下室。许多人要求他们自带床单和汤匙，甚至护士。在联邦法律规定为所有人提供紧急服务之前，医院经常拒绝非裔美国人，有些人在生命的最后时刻。\n法科雷德被吸引到玻利瓦尔县，部分是因为它的历史。当他第一次在该地区侦察时，那里的汽油用完了，那天晚上晚些时候，他用谷歌搜索了它的背景。在一个短暂的时刻，玻利瓦尔是一场公共卫生保健运动的中心，这场运动的驱动力是，如果没有卫生方面的公正，种族平等是不可能的。1964年，当一群医生活动人士前往三角洲时，来自杰克逊的黑人医生罗伯特·史密斯（Robert Smith）看到了肠道寄生虫和产妇死亡率的飙升。“我第一次明白了在密西西比州成为黑人的真正含义，”他告诉一家杂志。在林登·B·约翰逊总统的反贫困战争中，一位波士顿医生获得了资金，在玻利瓦尔开设了一家社区卫生中心，他在史密斯的帮助下发展了这家中心。临床医生与居民一起承担住房、卫生、锻炼和营养方面的工作。它的成功催生了一个全国性的项目，为服务不足的人提供了1000多个联邦合格的医疗中心。但在理查德·尼克松总统的领导下，资金减少了，这些中心的计划也缩减到了基本初级保健。\n2015年，法科雷德搬到三角洲时，该州的人均医生人数是全国最低的。它没有将医疗补助扩大到包括有工作的穷人。在全国范围内，15%的非裔美国人仍然没有保险，相比之下，美国白人只有9%。那一年，佛罗里达a&amp；M大学法学院，在《全国律师协会评论》中写道，法科雷德亲眼目睹了：“虽然非裔美国人不平等和不公平医疗的根源可以追溯到奴隶制时代，但现代医疗歧视机制已经从法律认可的隔离转变为市场力量导致的劣质或根本不存在的医疗设施。”\n法科雷德明白，要接触病人，他需要转诊，所以他在医院和诊所会见了初级保健提供者。他要求他们筛查血管疾病，测量脚踝和手臂的血压。许多人没有时间；考虑到当地医生的短缺，一些人每天要看多达70名患者。其他人不太了解外周动脉疾病，也不知道为什么诊断很重要。有些人被法科雷德的要求激怒了。家庭医生迈克尔·蒙特西（Michael Montesi）很感激他的帮助，但他发现城里的新医生开始告诉退伍军人该做什么是鲁莽的。他回忆起当时的想法：“我开业的头12年，当我需要一名心脏病专家，当我需要一名妇产科医生，当我需要一名外科医生，当我不得不在急诊室做截肢手术，或者分娩一个23周的婴儿，看着婴儿死去，因为那里没有人能照顾他，你在哪里？”\n这些拒绝让法科雷德感到不安，但当他深入挖掘时，他意识到医生们不仅不知所措；他们没有为这项血管筛查保证付款。《平价医疗法》规定，保险公司必须覆盖美国预防服务工作组（一个由预防保健专家组成的独立小组）建议的所有初级保健筛查。不过，该研究小组并没有建议对任何没有症状的人进行检测，即使是最有可能患血管疾病的人——例如患有糖尿病的老年人或吸烟者。（据信，高达50%的患者没有症状。）作为专家，如果心脏病专家筛查有风险因素的患者，他们会得到补偿。但当患者到达法科雷德时，这种疾病有时已经太远而无法治疗。许多人已经有了无法愈合的伤口，即所谓的“终末期”外周动脉疾病，这是截肢前的最后一步。\n当卢维尼亚·斯托克斯来到法科雷德时，她已经在48岁时失去了右腿。和许多三角洲居民一样，她在食物沙漠中长大，没有钱购买新鲜农产品，她很小就患上了糖尿病。她说一位足疗师在她的脚趾上留下了划痕，小伤口感染了。没有良好的血液流动，它开始分泌脓液。Stokes告诉Fakorede，没有医生做过血管造影来仔细观察血液循环，也没有医生做过血管重建来清除动脉。外科医生切除了她的第二个脚趾。然而，如果没有清除的血管，感染就会扩散。几周内，一位新外科医生为她切除了腿。\n斯托克斯和她母亲住在一辆宽大的拖车里。她的轮椅放不下门口，所以她用助行器从侧面慢慢走过。因为她几乎无法运动，她在两年内体重增加了48磅。截肢并没有治疗她的血管疾病，刺痛很快吞没了她剩下的腿，“就像有什么东西在抓你，”她说。当她最终到达法科雷德时，她告诉他一位医生给她开了神经病变药物，另一位医生诊断她患有关节炎。“我不会让他们得到另一条腿，”法科雷德告诉她。斯托克斯的祖母安妮住在附近的一辆拖车里，她因糖尿病失去了膝盖以上的双腿。她的表妹埃尔默失去了他的权利\n......", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they’re published.\n  It was a Friday evening in the hospital after a particularly grueling week when Dr. Foluso Fakorede, the only cardiologist in Bolivar County, Mississippi, walked into Room 336. Henry Dotstry lay on a cot, his gray curls puffed on a pillow. Fakorede smelled the circumstances — a rancid whiff, like dead mice. He asked a nurse to undress the wound on Dotstry’s left foot, then slipped on nitrile gloves to examine the damage. Dotstry’s calf had swelled to nearly the size of his thigh. The tops of his toes were dark; his sole was yellow, oozing. Fakorede’s gut clenched.  Fuck, he thought.  It’s rotten.\n Fakorede, who’d been asked to consult on the case, peeled off his gloves and read over Dotstry’s chart: He was 67, never smoked. His ultrasound results showed that the circulation in his legs was poor. Uncontrolled diabetes, it seemed, had constricted the blood flow to his foot, and without it, the infection would not heal. A surgeon had typed up his recommendation. It began: “Mr. Dotstry has limited options.”\n Fakorede scanned the room. He has quick, piercing eyes, a shaved head and, at 38, the frame of an amateur bodybuilder. Dotstry was still. His mouth arched downward, and faint eyebrows sat high above his lids, giving him a look of disbelief. Next to his cot stood a flesh-colored prosthetic, balancing in a black sneaker.\n    “How’d you lose that other leg?” Fakorede asked. Dotstry was tired, and a stroke had slowed his recall. Diabetes had recently taken his right leg, below the knee. An amputation of his left would leave him in a wheelchair.\n Fakorede explained that he wasn’t the kind of doctor who cuts. He was there because he could test circulation, get blood flowing, try to prevent any amputation that wasn’t necessary. He hated that doctors hadn’t screened Dotstry earlier — when he’d had the stroke or lost his leg. “Your legs are twins,” he said. “What happens in one happens in the other.”\n Dotstry needed an immediate angiogram, an imaging test that would show blockages in his arteries. He also needed a revascularization procedure to clean them out, with a thin catheter that shaves plaque and tiny balloons to widen blood vessels. His foot was decaying, fast. Though Fakorede ran an outpatient practice nearby, when doctors consulted him on inpatients at Bolivar Medical Center, the local hospital, he expected to use its facilities.\n He asked his nurse to schedule the procedures. But by the time he had driven home to his ranch house on the northern edge of town, he hadn’t received an answer. Nor had he when he woke up on Saturday at 3:30 a.m., as he did every morning. By sunrise, he was restless at his kitchen counter, texting the hospital’s radiology director, explaining the need for an intervention on Monday, Martin Luther King Jr. Day. Within a few hours, he got a response: “I don’t have the staff or the supplies. I’m sorry.”\n Now Fakorede was mad, walking briskly into his office, dialing friends on speaker phone, pacing around his conference room. He’d been raised in Nigeria, moved to New Jersey as a teenager and had come to practice in Mississippi five years earlier. He’d grown obsessed with legs, infuriated by the toll of amputations on African Americans. His billboards on Highway 61, running up the Delta, announced his ambitions: “Amputation Prevention Institute.”\n Nobody knew it in January, but within months, the new coronavirus would sweep the United States, killing tens of thousands of people, a disproportionately high number of them black and diabetic. They were at a disadvantage, put at risk by an array of factors, from unequal health care access to racist biases to cuts in public health funding. These elements have long driven disparities, particularly across the South. One of the clearest ways to see them is by tracking who suffers diabetic amputations, which are, by  one measure, the most preventable surgery in the country.\n Look closely enough, and those seemingly intractable barriers are made up of crucial decisions, which layer onto one another: A panel of experts decides not to endorse screening for vascular disease in the legs; so the law allows insurance providers not to cover the tests. The federal government forgives the student loans of some doctors in underserved areas, but not certain specialists; so the physicians most critical to treating diabetic complications are in short supply. Policies written by hospitals, insurers and the government don’t require surgeons to consider limb-saving options before applying a blade; amputations increase, particularly among the poor.\n Despite the great scientific strides in diabetes care, the rate of amputations across the country  grew by 50% between 2009 and 2015. Diabetics undergo 130,000 amputations each year, often in low-income and underinsured neighborhoods. Black patients lose limbs at a rate  triple that of others. It is the cardinal sin of the American health system in a single surgery: save on preventive care, pay big on the backend, and let the chronically sick and underprivileged feel the extreme consequences.\n    Fakorede grabbed his car keys and headed to the hospital. He walked straight to the lab. As he suspected, it had all the supplies that he needed.  Why won’t they give me staff? he wondered.  They wouldn’t do that to a surgeon.\n He has little tolerance for this kind of transgression. He is militaristic, to an extreme. To him, nonhealing wounds are like heart attacks. “Time is muscle,” he repeats. He calls huddles when nurses forget to check a patient’s ankles: “If you haven’t assessed both legs, I don’t want to walk into that room.” He considers each of his procedures an act of war. When people stand in his way, he sends a barrage of text messages, punctuated by exclamation marks. And he uses his cellphone to collect evidence that the system is working against his patients, and his efforts.\n He pulled out his iPhone and photographed the hospital’s wires and catheters, IVs and port protectors. He shot the images over to the hospital’s radiology director. Fakorede’s private practice was closed for the holiday weekend. He calculated that he had only a few days to carry out some plan before Dotstry’s remaining leg was amputated.\n   Two maps explain why Fakorede has stayed in the Mississippi Delta. One shows America’s amputations from vascular disease. The second shows the enslaved population before the Civil War; he saw it at a plantation museum and was stunned by how closely they tracked. On his phone, he pulls up the images, showing doctors, or history buffs, or anyone who will listen. “Look familiar?” he asks, toggling between the maps. He watches the realization set in that amputations are a form of racial oppression, dating back to slavery.\n    Fakorede was initially tempted to move to the Delta while practicing in Tennessee. He befriended a medical device sales rep named Maurice Hampton who had grown up in the Mississippi region. Hampton talked about how black families were leery of local hospitals and how few black doctors in the Delta specialized in vascular work. “It’s the norm to go to Walmart and see an amputation or a permacath in the neck,” he’d told Fakorede. “If you don’t see one, then you didn’t stay but two minutes.”\n Then, a little over a year into his Tennessee job, Fakorede found himself at loose ends. He’d raised concerns that he was being billed for expenses that weren’t his and asked for an audit; though the audit later found that the clinic where he worked had claimed over $314,000 in improper expenses, he was quickly terminated. Fakorede  sued the clinic for retaliation under the False Claims Act and lost. (The clinic’s lawyer said his client had no comment, but there were “numerous” reasons for Fakorede’s departure.) In the spring of 2015, he had a mortgage, a quarter of a million dollars in student debt and four months of severance pay. He also had an impulse to understand the Delta.\n    Fakorede spent four days driving through its long, flat stretches of farmland dotted with small towns and shotgun houses. The wood-slat homes and bumpy roads reminded him of his grandparents’ village in the Nigerian state of Ondo, where he’d spent summers as a kid. He drove scores of miles on the Mississippi highways without seeing a single grocery store; fast-food chains lit the busiest intersections. He was startled by the markers of disease — the missing limbs and rolling wheelchairs, the hand-built plywood ramps with metal rails. He thought of amputees like “an hourglass,” he said, “that was turned the day they had their amputation.” Mortality rates rise after the surgeries, in part, because many stop walking. Exercise improves circulation and controls blood sugar and weight. The less activity a person does, the higher the risk of heart attacks and strokes. Within five years, these patients were  likely to be dead.\n Fakorede weighed taking a lucrative job up north, near his parents, who had both been diagnosed with diabetes. He had professional connections there; he’d gone to Rutgers Robert Wood Johnson Medical School and done a residency at NewYork-Presbyterian Weill Cornell Medical Center. But the South, he felt, needed him. About 30 million people in America had diabetes, and Mississippi had some of the highest rates. The vast majority had Type 2; their bodies resisted insulin or their pancreas didn’t produce enough, making their blood sugar levels rise. Genetics played a role in the condition, but so did obesity and nutrition access: high-fat meals, sugary foods and not enough fiber, along with little exercise. Poverty can double the odds of developing diabetes, and it also dictates the chances of an amputation. One major study  mapped diabetic amputations across California, and it found that the lowest-income neighborhoods had amputation rates 10 times higher than the richest.\n The Delta was Mississippi’s poorest region, with the worst health outcomes. Fakorede had spent years studying health disparities: African Americans develop chronic diseases  a decade earlier than their white counterparts; they are  twice as likely to die from diabetes; they live, on average,  three years fewer. In the Delta, Fakorede could treat patients who looked like him; he could find only one other black interventional cardiologist in the entire state. A growing body of evidence had shown how racial biases throughout the medical system meant worse results for African Americans. And he knew the  research — black patients were more responsive to, and more trustful of, black doctors. He decided after his trip that he’d start a temporary practice in Mississippi, and he rented an apartment deep in the Delta.\n He fantasized about building a cardiovascular institute and recruiting a multidisciplinary team, from electrophysiologists to podiatrists. But as he researched what it would take, he found a major barrier. Medical specialists with student debt, who graduate owing a median of $200,000, generally could not benefit from federal loan forgiveness programs unless they got jobs at nonprofit or public facilities. Only a few types of private practice providers — primary care, dentists, psychiatrists — qualified for national loan forgiveness. The Delta needed many other physicians. Though Bolivar County was at the center of a diabetes epidemic, there wasn’t a single diabetes specialist, an endocrinologist, within 100 miles.\n    Fakorede leased a windowless space in the Cleveland Medical Mall, a former shopping center that had been converted to doctors’ offices. People came to him with heart complaints, but he also asked them to remove their socks. Their legs alarmed him. Their toes were black and their pulses weak. Their calves were cold and hairless. Some had wounds but didn’t know it; diabetes had numbed their feet. Many had been misdiagnosed with arthritis or gout, but when Fakorede tested them, he found peripheral artery disease, in which clogged arteries in the legs limit the flow of blood.\n This is what uncontrolled diabetes does to your body: Without enough insulin, or when your cells can’t use it properly, sugar courses through your bloodstream. Plaque builds up faster in your vessels’ walls, slowing the blood moving to your eyes and ankles and toes. Blindness can follow, or dead tissue. Many can’t feel the pain of blood-starved limbs; the condition destroys nerves. If arteries close in the neck, it can cause a stroke. If they close in the heart, a heart attack. And if they close in the legs, gangrene.\n Within a month, Bolivar Medical Center had credentialed Fakorede, allowing him to consult on cases and do procedures in the hospital. His most complicated patients came in through the emergency room. Some arrived without any inkling that they had gangrene. One had maggots burrowing in sores. Another showed up after noticing his dog eating the dead flesh off the tips of his toes. Fakorede took a photo to add to his collection. “It was a public health crisis,” he told me. “And no one was talking about amputations and the fact that what was happening was criminal.”\n On weekends, Fakorede had been driving back to his five-bedroom home in Tennessee, but in August of 2015, he decided to go all-in on Bolivar County. He sold his house and black Mercedes G-Wagon, and applied for funding to build a practice in the Delta: Cardiovascular Solutions of Central Mississippi. He pitched himself as a heart guy and a plumber, removing buildup in the arteries. Four banks denied him loans, so he borrowed money from friends. He gave himself a two-year window to reduce amputations and publish his outcomes.\n     The Delta flood plain runs 7,000 square miles along the northwestern edge of the state, with sweet-smelling, clay-like soil cordoned between bluffs and the banks of the Mississippi River. By the 19th century, the primeval forests had been transformed into a cotton empire; at the start of the Civil War, more than 80% of people in many Delta counties were enslaved. Sharecropping emerged after emancipation, and black farmers cultivated small plots in return for a portion of their crop. They lived on credit — for food and feed and clothing — until the harvest, but even then, their earnings rarely covered their expenses.\n For decades, African Americans in the South struggled to find and afford health care. The American Medical Association excluded black doctors, as did its constituent societies. Some hospitals admitted black patients through back doors and housed them in hot, crowded basements. Many required them to bring their own sheets and spoons, or even nurses. Before federal law mandated emergency services for all, hospitals regularly turned away African Americans, some in their final moments of life.\n Fakorede was drawn to Bolivar County, in part, because of its history. He’d run out of gas there when he was first scouting the region, and later that evening, he’d Googled its background. For a brief moment, Bolivar was the center of a movement for public health care, driven by the conviction that racial equality was not possible without justice in health. In 1964, when a group of physician activists traveled to the Delta, Robert Smith, a black doctor from Jackson, saw rocketing rates of intestinal parasites and maternal death. “I understood for the first time what it truly meant to be black in Mississippi,” he told a magazine. Under President Lyndon B. Johnson’s War on Poverty, a Boston doctor secured funding to open a community health center in Bolivar, which he grew with the help of Smith. Clinicians worked with residents to take on housing, sanitation, exercise and nutrition. Its success spawned a national project of more than a thousand Federally Qualified Health Centers for the underserved. But funding shrank under President Richard Nixon, and the centers’ initiatives were scaled back to basic primary care.\n By the time Fakorede moved to the Delta, in 2015, the state had the nation’s lowest number of physicians per capita. It had not expanded Medicaid to include the working poor. Across the country, 15% of African Americans were still uninsured, compared with 9% of white Americans. That year, Jennifer Smith, a professor at Florida A&amp;M University College of Law, wrote in the National Lawyers Guild Review what Fakorede saw firsthand: “While the roots of unequal and inequitable health care for African Americans date back to the days of slavery, the modern mechanisms of discrimination in health care has shifted from legally sanctioned segregation to inferior or non-existent medical facilities due to market forces.”\n Fakorede understood that to reach patients, he needed referrals, so he met primary care providers at hospitals and clinics. He asked them to screen for vascular disease, measuring blood pressure at the ankle and the arm. Many didn’t have the time; given the shortage of local physicians, some were seeing up to 70 patients a day. Others didn’t know much about peripheral artery disease or why it was important to diagnose. Some were offended by Fakorede’s requests. Michael Montesi, a family doctor, was grateful for the help, but he found it brash for the new doctor in town to start telling the veterans what to do. He recalled thinking, “Where were you the first 12 years of my practice, when I needed a cardiologist, when I needed an OB-GYN, when I needed a surgeon, when I had to do an amputation in the ER, or deliver a baby that was 23 weeks and watch the baby die because there was nobody there that could take care of him?”\n The brushoffs disturbed Fakorede, but when he dug deeper, he realized that the doctors weren’t only overwhelmed; they had no guaranteed payment for this vascular screening. The Affordable Care Act mandates that insurers cover all primary care screenings that are recommended by the U.S. Preventive Services Task Force, an independent panel of preventive care experts. The group, though, had not recommended testing anybody without symptoms, even the people most likely to develop vascular disease — older adults with diabetes, for example, or smokers. (Up to 50% of people who have the disease are believed to be asymptomatic.) As specialists, cardiologists are reimbursed if they screen patients with risk factors. But by the time patients got to Fakorede, the disease was sometimes too far along to treat. Many already had a nonhealing wound, what’s known as “end stage” peripheral artery disease, the last step before an amputation.\n When Luvenia Stokes came to Fakorede, she had already lost her right leg at the age of 48. Like many Delta residents, she grew up in a food desert, and without money for fresh produce, she’d developed diabetes at a young age. She said that a pedicurist nicked her toe, and the small cut developed an infection. Without good blood flow, it began bubbling with pus. Stokes told Fakorede that no doctor had performed an angiogram to get a good look at the circulation or a revascularization to clean out the arteries. A surgeon removed her second toe. Without cleared vessels, though, the infection spread. Within weeks, a new surgeon removed her leg.\n    Stokes lived in a single-wide trailer with her mother. Her wheelchair could not fit in the doorways, so she inched through sideways with a walker. Because she could hardly exercise, she gained 48 pounds in two years. The amputation hadn’t treated her vascular disease, and a stabbing pain soon engulfed her remaining leg, “like something is clawing down on you,” she said. When she finally made it to Fakorede, she told him that one doctor had prescribed neuropathy medication and another had diagnosed her with arthritis. “I’m not letting them get that other leg,” Fakorede told her. Stokes’ grandmother, Annie, who lives in a nearby trailer, had lost both her legs, above the knee, to diabetes. Her cousin Elmore had lost his right l\n......", "posttime": "2022-02-19 20:07:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,截肢,american,医生", "title": "美国黑人截肢流行病", "title_en": "The Black American Amputation Epidemic", "transed": 1, "url": "https://features.propublica.org/diabetes-amputations/black-american-amputation-epidemic/", "via": "", "real_tags": ["美国", "截肢", "american", "医生"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074119, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简单、强大、免费的工具，用于创建和使用数百万个应用程序。", "note_en": "Simple, powerful, free tools to create and use millions of apps.", "posttime": "2022-02-19 20:07:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "部署,digitalocean,工具", "title": "从故障中部署到DigitalOcean", "title_en": "Deploy to DigitalOcean from Glitch", "transed": 1, "url": "https://glitch.com/digitalocean", "via": "", "real_tags": ["部署", "工具"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074117, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据周五宣布的规则，美联储官员将被限制持有个人股票、债券和其他资产，这些规则最初是在10月份制定的。\n新法规将加密货币扩展并禁止使用，之前的公告中未包括加密货币。\n此前，去年发生了一场争议，几名官员在美联储之前进行了仓位交易&#39；美国采取了非常措施帮助经济度过新冠肺炎危机。\n美联储官员获胜&#39；根据周五正式生效的新规定，我们无法交易包括股票、债券以及加密货币在内的一系列资产。\n继10月宣布的法规之后，政策制定联邦公开市场委员会宣布，大部分限制将于5月1日生效。\n这些规定将涵盖联邦公开市场委员会成员、地区银行行长和一大批其他官员，包括参谋、债券部门经理和定期出席董事会会议的美联储雇员。它们也适用于配偶和未成年子女。\n&#34;美联储预计，在完成进一步的审查和分析后，额外的工作人员将受到这些规则的全部或部分约束；宣布规定的发布。\n规则&#34；旨在支持公众对委员会公正和正直的信心#39；通过防止出现任何利益冲突来开展工作；声明还说。\n去年，美联储披露，就在美联储在新冠疫情蔓延初期采取旨在提振经济的全面措施之前，几名美联储高级官员一直在交易个人股票和股票基金，美联储官员随后采取了行动。\n波士顿地区总统埃里克·罗森格伦（Eric Rosengren）和罗伯特·卡普兰（Robert Kaplan）在这场争议后离职。\n周五的公告将禁令扩大到比特币等加密货币，而10月份的最初公告中并未提及这些加密货币。\n根据规定，仍持有市场头寸的官员仍将有12个月的时间抛售被禁止的头寸。新的美联储官员将有六个月的时间这样做。\n未来，新规定涵盖的官员必须给予45天&#39；在进行任何允许的资产购买之前，请注意，这项限制将于7月1日生效。然后他们必须持有这些头寸至少一年，并且在&#34期间禁止任何交易；金融市场压力加剧的时期&#34; 该术语没有固定的定义，将由美联储主席和董事会决定；她是总法律顾问。\n除了股票、债券和加密证券，禁令还延伸到大宗商品、外汇、行业指数基金、衍生品、空头头寸和机构证券，或使用保证金债务购买资产。\n国会一直在讨论一项也将限制其成员持有个人股票的措施，尽管该措施尚未获得通过。", "note_en": "Federal Reserve officials will be restricted from owning individual stocks, bonds and other assets under rules announced Friday that first were set forth in October.\n The new regulations extended and ban to cryptocurrencies, which were not included in the previous announcement.\n They follow a controversy last year in which several officials traded positions just ahead of the Fed&#39;s extraordinary measures to help the economy through the Covid crisis.\n Federal Reserve officials won&#39;t be able to trade a slew of assets including stocks and bonds — as well as cryptocurrencies — under new rules that became formal Friday.\n Following up on  regulations announced in October, the policymaking Federal Open Market Committee announced that most of the restrictions will take effect May 1.\n  The rules will cover FOMC members, regional bank presidents and a raft of other officials including staff officers, bond desk managers and Fed employees who regularly attend board meetings. They also extend to spouses and minor children.\n &#34;The Federal Reserve expects that additional staff will become subject to all or parts of these rules after the completion of further review and analysis,&#34; a release announcing the rules stated.\n The rules &#34;aim to support public confidence in the impartiality and integrity of the Committee&#39;s work by guarding against even the appearance of any conflict of interest,&#34; the statement also said.\n Central bank officials acted after disclosures last year that several senior  Fed officials had been trading individual stocks and stock funds just before the time the central bank adopted sweeping measures aimed at boosting the economy in the early days of the Covid spread.\n  Regional presidents Eric Rosengren of Boston and Robert Kaplan  left their positions following the controversy.\n  The announcement Friday extended the ban to cryptocurrencies like bitcoin, which were not mentioned in  the original announcement in October.\n Under the regulations, officials still holding market positions will still have 12 months to shed prohibited positions. New Fed officials will have six months to do so.\n In the future, officials covered by the new rules must give 45 days&#39; notice before making any permissible asset purchases, a restriction that will go into effect July 1. They then will have to hold those positions for at least a year and will be banned from any trading during &#34;periods of heightened financial market stress.&#34; There is no set definition of the term, which will be determined by the Fed chair and the board&#39;s general counsel.\n Along with stocks, bonds and crypto, the ban extends to commodities, foreign currencies, sector index funds, derivatives, short positions and agency securities or using margin debt to buy assets.\n Congress has been debating a measure that also will restrict its members from owning individual stocks, though it has not been adopted yet.", "posttime": "2022-02-19 20:03:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,软件,股票,批准,approves", "title": "美联储批准了禁止其官员交易股票、债券和加密软件的规定", "title_en": "Fed approves rules banning its officials from trading stocks, bonds and crypto", "transed": 1, "url": "https://www.cnbc.com/2022/02/18/fed-approves-rules-banning-its-officials-from-trading-stocks-bonds-and-also-cryptocurrencies.html", "via": "", "real_tags": ["交易", "软件", "股票", "批准", "approves"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "**你必须启用JavaScript才能正确显示本说明中的内容**有一次，我偶然发现了一个Lisp Alien 3D模型，我以为我想要的是同一个，但更精细，更精确。随着时间的推移，这个想法也留在了记忆深处。最近，我的朋友告诉我，他开始参与3D建模。我以为这是我把旧想法付诸实践的机会。我们和他商量了一下，讨论了细节，以及最终的模型应该是什么样子，他同意承担这个项目。在项目实施过程中，观察模型的发展非常有趣，新的细节出现在模型中，灵魂出现了。从一开始，我们只想制造一个外星人，它就到此为止。但后来我们决定给它添加各种新的细节：计算机模型很有趣，我们以旧的Macintosh为基础，并将其名称稍作更改为Nushtosh（讲俄语的人会喜欢这个笑话）：在这部动画中可以看到创作瞬间的一小部分：这是一个非常有趣和有趣的项目，我们对其结果感到满意。Lisp Alien 3D模型（您可以扭曲并查看）：底座3D模型（您可以扭曲并查看）：可以放在桌面墙纸上的现成渲染：可以在此处找到本说明中的所有文件。", "note_en": "** You must have JavaScript enabled to display the content in this note correctly **  \tOnce upon a time I stumbled upon a  Lisp Alien 3D Model, I thought I wanted the same one, but more elaborate and with more detail accuracy.  \tAs time went on, the idea also remained somewhere in the depths of memory.  \tAnd recently,  my friend told me that he began to get involved in 3D modeling. I thought this was my chance to bring my old idea to life. \tWe consulted with him a bit, discussed the details, as well as how the final model should look, and he agreed to take on this project.  \tDuring the implementation of the project, it was very interesting to watch how the model develops, new details appear in it, a soul appears. \tFrom the very beginning, we wanted to make only an alien, and it will stop there.  \tBut then we decided to add various new details to it:   \tIt turned out funny with the computer model, we took the old Macintosh as a basis, and slightly changed its name to Nushtosh (Russian speakers will appreciate the joke):      \tA small cut of the moments of creation can be seen in this animation:      \tIt was a very interesting and fun project, the result of which we were pleased with.  \tLisp Alien 3D model (you can twist and see):      \tThe pedestal 3D model (you can twist and see):      \tReady-made renders that can be put on the desktop wallpaper:          \tAll files from this note can be found  here.", "posttime": "2022-02-19 20:03:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lisp,模型", "title": "Lisp Alien 3D模型", "title_en": "Lisp Alien 3D Model", "transed": 1, "url": "https://kikytokamuro.github.io/notes/lisp_alien.html", "via": "", "real_tags": ["lisp", "模型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想分享一下我最近进入PC世界的个人经历。我的旅程始于MS DOS，然后是Windows，这对很多人来说都很常见。后来我转到Linux，但只在桌面上。当我需要一台笔记本电脑的时候，我对Macintosh的硬件和软件质量非常着迷。当时，PowerPC的时代正在慢慢结束。我在2007年左右买了第一台MacBook Pro，我对它非常满意。我喜欢Mac OS X的Unix根源。Mach内核和FreeBSD用户区的结合赋予了它独特的优势和体系结构。我完全爱上了Mac OS X Tiger的Aqua界面。所有那些光滑、漂亮的按钮和滚动条真的吸引了我的心。\n在这些年里，苹果开始从这个美丽的用户界面转向一个朴素、没有灵魂、极简的用户界面世界。他们也逐渐放弃了最初的专注于培养各种第三方语言和集成，比如他们自己的Java实现。他们的Java不仅能很好地集成到桌面上，而且比Sun的标准实现性能更好。那些日子已经过去了。桌面体验变得如此乏味，失去了对用户的关注，它只是昔日辉煌的幽灵。新版本并不是在准备好的时候发布的（当时需要几年的时间），而是每年按计划发布，不管它是否带来价值。硬件本身也变得更糟。对我来说，从MacBook Pro上移除除2个USB-C端口以外的所有USB-C端口是最后一根钉在棺材上的钉子。\n然而，并不是世界上的一切都是厄运和阴郁的。去年春天，在我生活中的一段艰难时期，我请了几周假来恢复，并克服了生活中的许多枷锁。奇怪的是，也许是我重新获得内心自由的一部分，我决定在Mac上的VMware中安装FreeBSD。我立刻被操作系统架构以及基本系统和第三方软件包之间的清晰区别所吸引。我探索了ZFS文件系统的潜力，了解了它与系统本身的完美集成。我感谢FreeBSD团队为将ZFS整合到现有生态系统中所做的深思熟虑的努力。我对FreeBSD系统哲学及其UNIX遗产越来越感兴趣。我又开始做梦了。\n在某个时刻，我再也受不了我的Mac了，我开始寻找一种可以成为我的笔记本电脑的硬件。我很快意识到我对电脑硬件一无所知。我开始缠着我的朋友和同事，问我应该选择什么样的硬件，但坦率地说，他们都没有在笔记本电脑上使用FreeBSD的经验。最初，我想买一台框架笔记本电脑，因为我喜欢可修复机器的想法。但问题是，该框架没有运到英国。那是在2021，在他们开始接受英国市场的预购之前。我发现联想的硬件仍然很好，所以我决定买一台联想ThinkPad T470。我意识到我不想支付新笔记本电脑的全部价格。如果我买了一台翻新过的笔记本电脑，我不仅可以省下三分之二的价格，而且还可以得到与Mac电脑几乎相同的硬件。但也不完全是这样，因为显示屏没有苹果提供的那么好。\n在这一点上，我找到了一家英国当地的翻新硬件销售商，对笔记本电脑进行了配置，然后在几天内我就把我的笔记本电脑送到了那里。我以前安装过很多VMware，已经积累了很多经验，而且我还精心准备了所有配置和脚本文件。安装进行得很顺利，没有任何故障，大约20分钟后，我的新系统启动并运行起来。我很长一段时间都没有像那天那样开心。我不仅为自己感到骄傲，也为FreeBSD系统和笔记本电脑本身感到骄傲。\n自从我安装FreeBSD，几个月过去了。为了安全起见，我用几个补丁升级了系统，总是使用引导环境（由ZFS提供）。我从未需要重新启动和回滚任何系统升级。我使用的是季度包分支，而不是最新的，因为我更喜欢稳定性和安全性，而不是新功能。另外，我会从X.org、bspwm或vim获得什么样的新功能？我安装了很多极简主义的应用程序，开始在监狱里玩。我喜欢FreeBSD提供的开箱即用的非常轻的容器。正因为如此，我学会了如何安装DNS服务器、代理、如何使用私有IP地址空间，以及如何为监狱分配人性化的主机名。\nFreeBSD为我提供了一个稳定、干净的系统，可以按我的预期工作。它是可预测、可靠和稳定的。我可以完全按照我喜欢的方式进行配置。它给我带来了快乐、灵感，并为我提供了永无止境的学习体验。我很高兴再次看到，这么多年后，计算机为我服务，而不是反过来。我仍然不会向非技术人员推荐它，因为它需要对Unix系统的工作有很好的了解。但是，无论是谁，无论是谁，无论是谁，无论是谁，只要他想学习，并且愿意重新获得真正拥有自己系统和数据的自由，我都会发自内心地推荐他。\n注意：这篇博文至少被重写了3次。我开始描述我是如何配置系统的，然后我开始吹嘘我是多么喜欢bspwm，我是如何设置所有监狱的，等等。我可能在某个时候仍然会写，但这次不会。每次我开始写这篇文章时，我都意识到我漏掉了一点。我现在可以说，我知道我真正想说的是：我喜欢FreeBSD，我从使用它中找到了乐趣。", "note_en": "I would like to share my personal experience with my recent move to the PC world. My journey started on MS DOS and then Windows, as it’s common for many people. Later on I moved to Linux, but only on desktop. When the time came and I needed a laptop, I was fascinated by the hardware and software quality of Macintosh. Back then, it was an era of PowerPC, that was coming slowly to an end. I bought my first MacBook Pro around 2007 and I was really satisfied with it. I loved the Unix roots of Mac OS X. It was a combination of Mach kernel and FreeBSD user land that gave it it’s unique strength and architecture. I absolutely fell in love with Aqua interface of Mac OS X Tiger. All those glossy, beautiful buttons and scrollbars really captured my heart.\n During the years, Apple started turning away from this beautiful UI into a world of plain, soulless and minimalistic UI. They also gradually abandoned their original focus on nurturing various 3rd party languages and integrations, like their own Java implementation. Their Java was not only well integrated into the desktop, but also more performant than the standard implementation from Sun. Those days are gone though. Desktop experience became so dull and lost it’s focus on users that it’s just a ghost of its former glory. New releases are not shipped when they are ready (back then it took couple of years to do so), but rather on schedule every year, no matter if it brings value or not. The hardware itself also got worse. Removal of all but 2 USB-C ports from MacBook Pro was a last nail to the coffin for me.\n  Not everything in the world is doom and gloom though. During a difficult part of my life last spring, I took a few weeks off to recover and to overcome many shackles in my life. Curiously, maybe as a part of me regaining my inner freedom, I decided to install FreeBSD in VMware on my Mac. I was immediately fascinated by the OS architecture and the clean distinction between the base system and 3rd party packages. I explored the potential of ZFS file system, learned how beautifully it integrates with the system itself. I appreciated that the FreeBSD team made such thoughtful effort to integrate ZFS into the existing ecosystem. I became increasingly intrigued by the FreeBSD system philosophy and its UNIX heritage. And I started dreaming again.\n  At some point I couldn’t stand my Mac anymore and I started looking for a hardware that could become my laptop. I soon realised that I knew nothing about the PC hardware. I started pestering my friends and colleagues about what kind of hardware I should choose, but frankly none of them had experience with FreeBSD on laptop. Originally, I wanted to go for a Framework laptop, because I loved the idea of a repairable machine. But the problem was that Framework didn’t ship to the UK. That was in 2021, before they started accepting pre-orders for the UK market. I found that Lenovo still makes pretty good hardware, so I decided that I would buy a Lenovo ThinkPad T470. I realised that I didn’t want to pay the full price of a new laptop. If I bought a refurbished laptop instead, I would not only save 2/3 of the price, but I would also get almost the same hardware as I had on my Mac. Not exactly though, as the display is not as good as Apple provides.\n At this point, I found a local UK seller of refurbished hardware, did the laptop configuration and then in couple of days I had my PC laptop delivered. I had a lot of experience already from many VMware installations I did before and I had also all my configuration and script files meticulously prepared. The installation went well, without any hick-ups and roughly after 20 minutes, I had my new system up and running. I didn’t feel so happy for a long time like that day. I was really proud not only of myself, but also of the FreeBSD system and the laptop itself.\n  Couple of months passed since I installed FreeBSD. I have upgraded the system with several patches, always using Boot Environments (provided by ZFS) to be on the safe side. I have never had to reboot and rollback any system upgrade. I’m using a quarterly package branch rather than the latest one, because I prefer stability and security over new features. Also, what kind of new features would I get from X.org, bspwm or vim? I installed number of minimalistic apps and started playing around with Jails. I love the idea of very lightweight containers that FreeBSD provides out-of-the-box. Because of this, I learned how to install a DNS server, proxy, how to work with private IP address space and also how to assign jails human-friendly host names.\n FreeBSD gave me a stable, clean system that works as I expect it to. It’s predictable, reliable and stable. I can configure it exactly the way I like. It brings me joy, inspiration and provides a never ending source of learning experience. I’m happy to see that again, after so many years, the computer serves me and not the other way around. I still would not recommend it to non-technical people, because it requires quite good knowledge of Unix systems work. But whoever seeks to learn and would love to regain the freedom of truly owning their system and data, I recommend it from the bottom of my heart.\n  Note: This blog post has been rewritten at least 3 times. I started with describing how I configured the system, then I went to bragging about how I love bspwm, how I set up all my jails, etc. I might still write about it at some point, but not this time. Every time I started writing the post, I realised that I was missing a point. I can say now that I know what I really wanted to say: that I love FreeBSD and I find joy in using it.", "posttime": "2022-02-19 20:01:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "macos,笔记本电脑", "title": "从macOS到FreeBSD", "title_en": "From macOS to FreeBSD", "transed": 1, "url": "https://www.boucek.me/blog/from-mac-to-freebsd/", "via": "", "real_tags": ["macos", "笔记本电脑"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074114, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "保时捷&#39；s的下一辆赛车是如此之新，以至于它仍然没有&#39；我没有正式的名字。它&#39；它甚至不打算参加超过11个月的第一场比赛。但保时捷最重视的事情莫过于赛车项目，尤其是在代托纳、塞布林和勒芒举行的重要赛事中获胜的机会很大。那&#39；这就是为什么这款车已经在西班牙巴塞罗那附近的加泰罗尼亚赛道完成了第一次测试。\n毕竟，这辆新车是为一辆新的&#34；hypercar&#34；IMSA课程&#39；美国天气技术锦标赛和国际汽联&#39；美国的世界耐力锦标赛，有很多值得去实现。保时捷在劳力士24小时赛（Daytona）中获得22场总冠军，在赛布林12小时赛（Sebring）中获得18场总冠军，在勒芒24小时赛（Le Mans）中获得19场总冠军。\n&#34;我们&#39；你是第一个让LMDh车辆在测试模式下进行测试的人，&#34；保时捷Penske Motorsport的董事总经理乔纳森·迪吉德（Jonathan Diuguid）说。 &#34;这使我们有机会在未来几周和几个月内系统地梳理各个方面，并在2023年以尽可能最好的准备迎接竞争&#34;\n与之前赢得比赛的917、956或919混合动力车相比，保时捷&#39；s LMDh汽车代表了某种合作。LMDh的规则要求每个OEM从四个认可底盘中的一个开始。在这种情况下，保时捷使用的是Multimatic开发的底盘，该公司也为马自达和#39；最近的IMSA项目。（保时捷的兄弟品牌奥迪也将为其LMDh汽车使用多自动底盘。）\n从这一点出发，每个OEM都可以自由携带自己的发动机和电子设备，但必须使用相同的指定混合动力系统和变速箱。（博世提供电机，威廉姆斯高级工程提供锂离子动力电池，变速箱由Xtrac提供。）\n当我们看到保时捷LMDh汽车的图片时&#39；保时捷的首次测试&#39；我们报道说，这辆车将使用一款赛车版的双涡轮V8发动机，该发动机是在一些卡延和帕纳梅拉发动机罩下发现的。\n然而，在今年的比赛中&#39；保时捷汽车运动北美区新任主管沃尔克·霍尔兹迈耶（Volker Holzmeyer）在接受采访时表示，LMDh发动机不会来自公路车，这让人有些困惑。到目前为止，保时捷还没有&#39；虽然没有详细阐述，但我仍然认为我们&#39；我们将看到一款越野版双涡轮4.0升V8。\n2023年的规定也限制了汽车#39；下压力与阻力之比相对较低，为4:1，因此&#39；这就减少了追求空气动力优势的理由，增加了公路汽车造型的自由度。到目前为止&#39；在车里可以看到&#39；s前灯——自1月份首次测试以来新增的前灯，类似于Taycan和#39中的四个水平元素；汽车前灯。\n&#34;我们在a&#39上完成了第一次测试；雷亚尔&#39；赛道和管理的两倍以上的新保时捷LMDh里程超过2000公里，和#34；工厂赛车LMDh总监乌尔斯·库拉特尔说。\n&#34;这表明我们很好地利用了计划中但取消的测试后的时间来进行这项密集的准备；库拉特说&#34;包括我们的合作伙伴在内，有70多人在跑道上。从组织的角度来看，这是另一个挑战。我们不仅在汽车方面取得了重大进展，而且在保时捷Penske Motorsport内部的运营合作和流程方面也取得了重大进展。但要达到我们的目标，我们还有很长的路要走&#34;\n&#34;在巴塞罗那的第一圈比赛中取得的进步令人印象深刻；保时捷Penske Motorsport#39；是司机&#34;每天，我们都能跑更多的里程，成绩显著提高。当然，在这个早期的开发阶段，它并不是要达到极限。相反，我们的方法非常保守&#34;\n卡梅伦在韦萨克的驾驶体验让他受益匪浅，但对他的队友费利佩·纳斯尔来说，在加泰罗尼亚的测试是他第一次体验新车。\n&#34;这是我在LMDh赛车上的第一圈——一次很棒的体验，&#34；纳斯尔说&#34;虽然这辆车是全新的，但我们还是跑了很多公里。那太棒了，不应该是&#39；不要低估。我们甚至可以开始安装工作和轮胎测试。我对这辆车的印象是正面的，我将带着微笑离开巴塞罗那。我非常期待第一轮的比赛。现在我终于有机会与保时捷Penske赛车队合作，掌舵，加油。这对我来说是一次非常特别的经历，让我为未来的一切感到兴奋&#34;", "note_en": "Porsche&#39;s next race car is so new that it still doesn&#39;t have an official name. It&#39;s not even due to enter its first race for more than 11 months. But there are few things Porsche takes more seriously than a racing program, particularly one that has a good chance of victory at significant races in Daytona, Sebring, and Le Mans. That&#39;s why the car has already completed its first test at the Circuit de Catalunya near Barcelona, Spain.\n After all, this new car,  built for a new &#34;hypercar&#34; class in the IMSA&#39;s WeatherTech championship and the FIA&#39;s World Endurance Championship, has a lot to live up to. Porsche has had 22 overall wins in the Rolex 24 at Daytona, 18 overall wins at the 12 Hours of Sebring, and 19 overall wins at the 24 Hours of Le Mans.\n &#34;We&#39;re the first to put an LMDh vehicle through its paces in test mode,&#34; said Jonathan Diuguid, managing director of  Porsche Penske Motorsport . &#34;This gives us the chance to systematically sort out every aspect over the coming weeks and months and to take on the competition in 2023 with the best possible preparation.&#34;\n  In contrast to previous race-winning machines like the  917,  956, or  919 Hybrid, Porsche&#39;s LMDh car represents a collaboration of sorts. The rules for LMDh require that each OEM start off with one of four approved chassis. In this case, Porsche is using one developed by  Multimatic, which also provided the chassis for Mazda&#39;s recent IMSA program. (Porsche&#39;s sibling brand Audi will also use a Multimatic chassis for its LMDh car.)\n    From this starting point, each OEM has the freedom to bring its own engine and electronics but must use the same specified hybrid system and gearbox. (Bosch provides the electric motor, Williams Advanced Engineering supplies the lithium-ion traction battery, and the gearbox is from Xtrac.)\n When we saw images of the Porsche LMDh car&#39;s first test at Porsche&#39;s facility in Weissach, Germany, we reported that the car would use a racing version of the twin-turbo V8 found under the hood of some Cayennes and Panameras.\n  However, during the race broadcast for this year&#39;s Rolex 24, the new head of Porsche Motorsport North America, Volker Holzmeyer, introduced some confusion, telling an interviewer that the LMDh engine would not be derived from a road car. So far, Porsche hasn&#39;t elaborated, but I still think we&#39;ll see a race version of the road-going twin-turbo 4.0 L V8.\n The rules for 2023 also limit a car&#39;s downforce-to-drag ratio to a relatively low 4:1, so there&#39;s less reason to chase aerodynamic gains and more latitude for road car styling. So far, that&#39;s visible in the car&#39;s headlights—a new addition since the first test in January—which resemble the four horizontal elements in  the Taycan&#39;s headlights.\n &#34;We completed the first tests on a &#39;real&#39; race track and managed to more than double the previous mileage of the new Porsche LMDh to over 2,000 kilometers,&#34; said Urs Kuratle, the director of Factory Motorsport LMDh.\n  &#34;This shows that we used the time after the planned-but-cancelled tests very well for this intensive preparation,&#34; Kuratle said. &#34;Including our partners, more than 70 people were at the track. From an organization viewpoint, that was another challenge. We’ve made major progress, not only with the car but with the operational cooperation and processes within Porsche Penske Motorsport. But we still have a long way to go before we’re where we want to be.&#34;\n    &#34;The progress that’s been made up to our first laps at Barcelona is impressive,&#34; said Dane Cameron, one of Porsche Penske Motorsport&#39;s drivers. &#34;Each day, we managed to cover more mileage, and the performance improved noticeably. Of course, at this early development stage, it’s not about pushing to the very limit. On the contrary, our approach is very conservative.&#34;\n  Cameron had the benefit of getting behind the wheel at Weissach, but for his teammate Felipe Nasr, the test at Catalunya was his first experience with the new car.\n &#34;These were my first laps in the LMDh car—a terrific experience,&#34; Nasr said. &#34;Although the car is brand new, we managed to cover a lot of kilometers. That was great and shouldn&#39;t be underestimated. We could even begin the setup work and tire tests. My impression of the vehicle is positive, and I’ll leave Barcelona with a smile. I was very much looking forward to these first runs. Now I got the chance to finally work with the Porsche Penske Motorsport team, take the wheel, and step on the gas. It was a very special experience for me and makes me excited for everything to come in the future.&#34;", "posttime": "2022-02-19 19:26:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "西班牙,completes,保时捷", "title": "保时捷在西班牙完成首个LMDh赛道测试", "title_en": "Porsche completes its first LMDh track test in Spain", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/porsche-completes-its-first-lmdh-track-test-in-spain/", "via": "", "real_tags": ["西班牙", "completes", "保时捷"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十多年来，美国一直将乙醇与汽油混合，试图减少化石燃料汽车和卡车产生的总体碳污染。但一项新的研究表明，这种做法可能无法实现其目标。事实上，燃烧美国主要来源玉米制成的乙醇对气候的影响可能比仅仅燃烧汽油更糟糕。\n玉米推动了对土地和肥料的需求，远远高于此前的评估估计。加在一起，额外的土地和肥料增加了乙醇的碳足迹，使从种子到储罐的整个生命周期温室气体排放量高于汽油。一些研究人员预测这可能会发生，但这篇新论文全面回顾了该政策的实际结果。\n支持者长期以来一直认为，以玉米为基础的乙醇可以增加农场收入，同时提供国内可再生液体燃料来源，而批评者则表示，它作为一种减碳汽油添加剂的地位有赖于可疑的会计核算。根据这项新研究，双方可能都是对的。\n乙醇作为燃料在美国一直存在争议。它从2006年开始在全国范围内添加到汽油中，自联邦可再生燃料标准（RFS）颁布以来，这一数量逐年增加。RFS是2005年两党能源政策法案中的一个关键条款，由乔治·W·布什总统签署成为法律。如今，美国销售的大多数汽油中含有10%的乙醇，该国约三分之一的玉米作物用于生产这种燃料。该研究的作者指出，虽然其他来源（包括从纤维素中提取的乙醇）也符合条件，“大多数RFS生物燃料生产都来自传统的玉米乙醇。”。\n研究人员从多个角度研究了这个问题，包括研究种植玉米需要多少额外的土地、使用了多少额外的肥料、两者的结合对水质的影响，以及作物价格如何随着RFS而变化。该团队研究了2008年——要求该标准的法律通过后的一年——到2016年之间的这些变化。\n该法首次实施时，玉米乙醇几乎没有资格纳入RFS计划。在最初的监管影响分析中，美国土地使用变化的排放量预计将略有下降，而国外的排放量预计将大幅上升。（由于全球作物市场的供需变化，预计国际产量会增加。）\n研究人员写道：“为了遵守该政策的温室气体减排目标，RFS要求传统可再生燃料产生的生命周期温室气体比汽油至少节约20%。”。“该政策颁布后，监管分析预测，到2022年，玉米乙醇生产的生命周期排放量将刚刚超过20%的阈值，即使将[新农田]的排放量包括在内。”\n但这项新研究表示，由于新农田被耕种，旧农田没有被退耕，美国土地使用变化和化肥使用产生的排放量增加了近50%，超过了监管分析的估计值，这使得玉米乙醇几乎不合格。研究人员发现，为了应对新的需求，农民们额外耕种了280万公顷（690万英亩）的玉米，如果不是这样的话，这些玉米本可以单独耕种，增加了8.7%。由于玉米生长需要大量养分，肥料的使用量激增了3-8%。\n犁下额外的土地释放了大量的碳，足以将对玉米乙醇的评估从碳负燃料转变为碳排放燃料。最大的下降发生在新农田释放了储存在土壤和植被中的碳，包括活植物的根系。农民也不太可能进入保护区项目，该项目向农民支付费用，让他们在未使用的农田上种植多年生植被。\n施用化肥后，它会释放出大量的一氧化二氮，这是一种强大的温室气体，在100年的时间里，使大气变暖的程度是等量二氧化碳的300倍。研究人员对这种肥料的碳影响的估计可能也很低，因为作者没有计算制造过程释放了多少额外的污染，也没有计算下游河道水质恶化释放更多温室气体的程度。", "note_en": "For over a decade, the US has blended ethanol with gasoline in an attempt to reduce the overall carbon pollution produced by fossil fuel-powered cars and trucks. But a new study says that the practice may not be achieving its goals. In fact, burning ethanol made from corn—the major source in the US—may be worse for the climate than just burning gasoline alone.\n Corn drove demand for land and fertilizer far higher than previous assessments had estimated. Together, the additional land and fertilizer drove up ethanol’s carbon footprint to the point where the lifecycle greenhouse gas emissions—from seed to tank—were higher than that of gasoline. Some researchers  predicted this might happen, but the new paper provides a comprehensive and retrospective look at the real-world results of the policy.\n Proponents have long argued that corn-based ethanol bolsters farm incomes while providing a domestic source of renewable liquid fuel, while critics have said that its status as a carbon-reducing gasoline additive relies on questionable accounting. Based on the new study, both sides may be right.\n  Ethanol as a fuel has long been contentious in the US. It started being added to gasoline nationwide in 2006, and the amount has been  ramped up in the years since under the federal Renewable Fuel Standard (RFS), a key plank in the bipartisan Energy Policy Act of 2005 that was signed into law by President George W. Bush. Today, most gasoline sold in the US contains 10 percent ethanol, and about a  third of the corn crop in the country is used to produce the fuel. While other sources would qualify, including ethanol derived from cellulose, “most RFS biofuel production has come from conventional corn ethanol,” the study’s authors pointed out.\n The researchers studied the issue from several angles, including examining how much additional land was needed to grow the corn, how much extra fertilizer was used, what the combination of the two did to water quality, and how crop prices changed in response to the RFS. The team looked at those changes between 2008—the year after the law requiring the standard was passed—and 2016.\n    When the law was first implemented, corn ethanol barely qualified for inclusion in the RFS program. In the initial regulatory impact analysis, US emissions from land-use change were predicted to decline slightly, while those abroad were expected to rise significantly. (The international increase was anticipated due to supply-and-demand shifts in the global market for crops.)\n “To comply with the policy’s GHG [greenhouse gas] reduction goals, the RFS requires conventional renewable fuels to generate life cycle GHG savings of at least 20% relative to gasoline,” the researchers wrote. “Upon enactment, the policy’s regulatory analysis projected that life cycle emissions of corn ethanol production would just clear the 20% threshold by 2022, even when emissions from [new farmland] were included.”\n  But the new study says that as a result of new farmland being tilled and old farmland not being retired, emissions from land-use change and fertilizer use in the US increased nearly 50 percent above the regulatory analysis’s estimates that allowed corn ethanol to barely qualify. The researchers found that in response to the new demand, farmers tilled an additional 2.8 million hectares (6.9 million acres) for corn that otherwise would have been left alone, an 8.7 percent increase. Since corn needs a lot of nutrients to grow, fertilizer use shot up by 3–8 percent.\n The extra land put under the plow released a significant amount of carbon, enough to flip the assessment of corn ethanol from a carbon-negative fuel to a carbon-emitting one. The biggest decline came when new cropland released carbon that had been stored in soils and vegetation, including roots of living plants. Farmers were also less likely to enter a field into the Conservation Reserve Program, which pays farmers to plant perennial vegetation on unused farmland.\n After the fertilizer was applied, it released a significant amount of nitrous oxide, a potent greenhouse gas that warms the atmosphere 300 times more than the same amount of carbon dioxide over 100 years. The researchers’ estimates of the carbon impact of the fertilizer are probably low, too, since the authors didn’t calculate how much additional pollution the manufacturing process released or the extent to which degraded water quality in downstream waterways released more greenhouse gases.", "posttime": "2022-02-19 19:24:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表明,ethanol,玉米", "title": "研究表明，玉米乙醇并不比燃烧汽油更好，也可能更糟", "title_en": "Corn ethanol no better—and probably worse—than burning gasoline, study says", "transed": 1, "url": "https://arstechnica.com/tech-policy/2022/02/us-biofuel-mandate-likely-increased-carbon-emissions-inflated-crop-prices-20-30/", "via": "", "real_tags": ["表明", "ethanol", "玉米"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074112, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电动汽车会发生什么#39；一旦电池电量不足，它会有一大块电池吗？周四，Redwood Materials宣布已启动电动汽车电池回收计划，福特和沃尔沃是合作伙伴，从而推动了这一对话。\n美国法律要求EV&#39；在行驶8年或10万英里后，保持至少70%的原始充电状态。即使是对电池组进行了适当热管理的老式电动汽车，随着时间的推移也显示出了对电池退化的恢复能力。\n但最终，一个包将不再适合推动汽车，在这一点上，它可以被赋予第二次生命作为静态存储。当电池退化到一定程度后，它将&#39；是回收利用的时候了。\n我们&#39；在商业化的不同阶段，我们已经介绍了许多不同的电池回收方法，但很少有像红杉那样的方法；s、 该公司由特斯拉前首席技术官JB Straubel于2017年创立，并从亚马逊等公司获得了投资。\nRedwood正在加利福尼亚州启动其项目，并表示将通过与经销商和拆卸商合作，寻找寿命终止的电池组。然后，红木将这些包装送到其位于内华达州的工厂，在那里进行回收。一些材料将在今年晚些时候进入特斯拉电池组。\n红木、福特和沃尔沃将承担该项目的费用，红木表示将接受该州电动汽车或混合动力车的任何锂离子或镍金属氢化物电池。", "note_en": "What happens to an electric vehicle&#39;s big slab of batteries once it no longer holds a sufficient charge? On Thursday, Redwood Materials moved that conversation forward with an announcement that it has started its EV battery recycling program, with Ford and Volvo as partners.\n US law requires an EV&#39;s traction battery to maintain at least 70 percent of its original state of charge after eight years or 100,000 miles. Even older EVs—ones with proper thermal management for the battery pack— are showing resilience to battery degradation over time.\n But eventually, a pack will no longer be suitable for propelling a car, at which point it can be given  a second life as static storage. After the battery degrades enough, it&#39;s time for recycling.\n We&#39;ve covered a number of  different approaches to battery recycling at  various stages of commercialization, but few are as far along as Redwood&#39;s. The company was founded in 2017 by former Tesla CTO JB Straubel and  has seen investment from Amazon, among others.\n Redwood is starting its program in California, where it says it will find  end-of-life battery packs by working with dealers and dismantlers. Redwood will then send those packs to its facility in Nevada, where they will be recycled. Some of the materials will  find their way into Tesla battery packs later this year.\n Redwood, Ford, and Volvo are covering the cost of the program, and Redwood says it will accept any lithium-ion or nickel-metal hydride batteries from EVs or hybrids in the state.", "posttime": "2022-02-19 19:22:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,沃尔沃,volvo,电动汽车", "title": "福特、沃尔沃和红木材料开始回收电动汽车电池", "title_en": "Ford, Volvo, and Redwood Materials start recycling EV batteries", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/ford-volvo-and-redwood-materials-start-recycling-ev-batteries/", "via": "", "real_tags": ["福特", "沃尔沃", "volvo", "电动汽车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074111, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然哑光屏幕在不同的照明环境下产生一致的、防眩光的图像，但光泽替代品可以在适当的条件下提供更生动、多彩的图像。从电视到智能手机和通用PC显示器，你可以在任何东西上找到光滑的屏幕。不过，这款光鲜的游戏显示器是haven和#39；我没空。一家名为Eve的小公司计划通过生产其两款游戏显示器的闪亮版本来改变这种状况。\n周三，Eve确认将为其三款27英寸游戏显示器中的两款提供光泽涂层选项，即4K 144 Hz频谱和QHD 280 Hz频谱（之前为240 Hz）。该公司没有确认价格或发布日期。\n伊芙解释了制作光泽显示屏背后的困难。不管你在Reddit或YouTube上看到了什么，制作一个好的有光泽的屏幕并不像移除显示器那么简单；防眩光涂层。光面显示屏还需要对LCD模块进行更改#39；s偏振滤光片，用于控制光波。\n&#34;在LG Display内部经过了一系列令人信服的努力，才让这一切成为现实；夏娃&#39；该公司的声明称，这些变化意味着LG必须重新校准其全自动LCD装配线，并调整认证流程。这一过程还意味着LG必须调整颜色性能并进行耐久性测试&#34;这不是一项容易的任务；该公司表示。\n游戏显示器使用哑光饰面，因为它们&#39；你在减少眩光方面做得更好。正如显示器制造商明基（BenQ）所解释的，哑光屏幕使用&#34；塑料表面由经过蚀刻工艺的不同聚合物制成。无论是化学腐蚀还是机械腐蚀，都会在屏幕表面产生大量的凹槽或凹痕#34；散射光。\n然而，光线越少也意味着屏幕越暗。哑光屏幕可能看起来不如光面屏幕生动，因为防眩光涂层会降低对比度和颜色。使用反光玻璃或反光聚合物的光面屏幕，don&#39；我没有这个问题。\n但因为他们&#39；因为它们更容易受到眩光的影响，所以在某些照明情况下很难使用。因此，虽然在有利的条件下，光滑的屏幕看起来更具活力，但如果照明条件不理想，你可能会发现自己盯着自己的反射。一些有光泽的屏幕有防眩光处理，但哑光显示屏总是提供最好的防反射解决方案。\nTFTCentral测试了Eve和#39的预生产样品；s的光滑4K 144Hz频谱面板，并注意到其更清晰的文字和更好的整体图像质量。该出版物报道称，子像素出现&#34；更清晰、更清晰、更容易辨别，消除了…的模糊和朦胧。。。[防眩光]涂层&#34;\nTFTCentral还表示，显示器具有更强的颜色和更深的黑色，提高了对比度。然而，光泽版和哑光版显示器的测量对比度和色域是相同的。\n它&#39；值得注意的是，Eve过去在交付产品时遇到了困难。其众筹Eve V PC于2016年推出，交付时间长达数年。然而，伊芙&#39；s Spectrum gaming monitors于2020年1月通过一家新的分销商发布，发货延迟达39天；这似乎没有那么极端。Eve的一名代表告诉Ars Technica&#34；所有的监视器都已装运&#34;", "note_en": "While matte screens produce consistent, glare-resistant images in different lighting environments, glossy alternatives can provide a more vivid, colorful image in the right conditions. You can find glossy screens in everything from TVs to smartphones and general-purpose PC monitors. Glossy gaming monitors, though, haven&#39;t been available. A small company called Eve plans to change that by making shiny versions of its two gaming monitors.\n On Wednesday, Eve  confirmed that it will make a glossy coating option available for two of  its three 27-inch gaming monitors, the 4K 144 Hz Spectrum and QHD 280 Hz Spectrum ( previously 240 Hz). The company did not confirm a price or release date.\n Eve explained the difficulties behind making glossy displays. Despite what you may have seen on  Reddit or  YouTube, producing a good glossy screen is not as simple as removing a monitor&#39;s anti-glare coating. Glossy displays also require changes to the LCD module&#39;s polarizer filter, which controls the lightwaves.\n &#34;It took a bunch of convincing with the right people inside of LG Display to make this a reality,&#34; Eve&#39;s announcement said, adding that the changes meant that LG had to recalibrate its fully automated LCD assembly line and tweak the certification process. The process also meant that LG had to tune color performance and conduct durability testing. &#34;It was not an easy task,&#34; the company said.\n  Gaming monitors use matte finishes because they&#39;re much better at reducing glare. As explained by monitor-maker  BenQ, matte screens use &#34;plastic surfaces made of different polymers that undergo an etching process. Either chemical or mechanical, the etching creates an enormous number of grooves or indentations in the screen surface&#34; that scatter light.\n    However, less light also means a darker screen. Matte screens can look less vivid than glossy screens, as anti-glare finishes have a dulling effect on contrast and color. Glossy screens, which use reflective glass or reflective polymers, don&#39;t have this issue.\n But because they&#39;re more prone to glare, they can be difficult to use under certain lighting scenarios. So while a glossy screen can look more vibrant in favorable conditions, you may find yourself staring at your own reflection if your lighting situation is less than ideal. Some glossy screens have anti-glare treatments, but a matte display will always provide the best anti-reflection solution.\n   TFTCentral tested out a pre-production sample of Eve&#39;s glossy 4K 144Hz Spectrum panel and noted its sharper text and better overall image quality. The publication reported that the sub-pixels appear &#34;sharper, clearer, and more easily distinguishable, removing the blurring and haziness of ... [anti-glare] coating.&#34;\n TFTCentral also said the monitor has stronger colors and deeper blacks, improving perceived contrast. Measured contrast and color gamuts were the same between the glossy and matte versions of the monitor, however.\n   It&#39;s important to note that Eve has had trouble delivering products in the past. Its crowdfunded  Eve V PC launched in 2016 and saw years-long delivery times. However, Eve&#39;s Spectrum gaming monitors launched in January 2020 through a new distributor, and shipment delays don&#39;t seem to be nearly as extreme. An Eve representative told Ars Technica that &#34;all the monitors have been shipped.&#34;", "posttime": "2022-02-19 19:20:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,gaming,显示器", "title": "第一款光面游戏显示器承诺增强色彩，增加眩光", "title_en": "First glossy gaming monitors promise enhanced colors, more glare", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/first-glossy-gaming-monitors-promise-enhanced-colors-more-reflections/", "via": "", "real_tags": ["游戏", "gaming", "显示器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074109, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四凌晨，特斯拉和SpaceX首席执行官埃隆·马斯克（Elon Musk）在推特上发布了一条将加拿大总理贾斯汀·特鲁多（Justin Trudeau）与阿道夫·希特勒（Adolf Hitler）相比较的迷因。\n这条推特回复了加密货币爱好者，其中包括一张希特勒的照片，上面写着#34；别把我比作贾斯汀·特鲁多&#34；和&#34；我有预算&#34；指的是1940年代德国政权在灭绝集中营对数百万人的工业化谋杀。\n过去，马斯克曾在推特上表示支持&#34；自由护航队&#34；抗议活动，一个主要由美国资助的右翼运动，一直在邻国加拿大引发内乱。\n本周早些时候，特鲁多总理援引了加拿大&#39；加拿大政府有权在没有法院命令的情况下冻结支持封锁的人的银行账户。", "note_en": "In the early hours of Thursday morning, Tesla and SpaceX CEO Elon Musk tweeted a meme that compared Canadian Prime Minister Justin Trudeau with Adolf Hitler.\n The tweet, replying to cryptocurrency enthusiasts, included a photo of Hitler with the phrase &#34;stop comparing me to Justin Trudeau&#34; and &#34;I had a budget,&#34; a reference to  the industrialized murder of millions of people by the German regime in  extermination camps during the 1940s.\n  In the past, Musk has tweeted his support for the &#34;freedom convoy&#34; protests, a  right-wing movement funded mostly from the US that has been  causing civil unrest in neighboring Canada.\n Earlier this week, Prime Minister Trudeau invoked Canada&#39;s  Emergencies Act, which gives the Canadian government the power to freeze the bank accounts of people supporting the blockades without a court order.", "posttime": "2022-02-19 19:17:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,埃隆·马斯克,马斯克,musk,加拿大", "title": "埃隆·马斯克推特，然后删除，大屠杀笑话", "title_en": "Elon Musk tweets, then deletes, Holocaust joke", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/elon-musk-tweets-then-deletes-holocaust-joke/", "via": "", "real_tags": ["推特", "埃隆·马斯克", "马斯克", "musk", "加拿大"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074107, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "疫苗制造商正在2019冠状病毒疾病疫苗的使用。最初的预期是在3月份。\n疫苗的延误&#39；开发之际，奥米克罗的病例正在迅速减少，几项动物研究表明，与目前的疫苗相比，这种变体特异性配方不会带来优势。\nBioNTech首席执行官乌尔阿欣周三表示，他的公司&#39；据路透社报道，由于数据收集速度出人意料地缓慢，s omicron特异性疫苗被推迟了数周。BioT2019冠状病毒疾病疫苗公司和辉瑞公司的疫苗合作伙伴辉瑞公司上个月宣布，他们已经开始进行OmiCon特定的临床试验。\n与此同时，摩德纳首席执行官斯特凡·班塞尔周三表示，摩德纳&#39；据路透社另一篇报道，s omicron的特效疫苗现在可以在8月前准备好。Bancel没有解释较慢的时间表，但表示该公司的目标是在秋季准备好助推器，届时他认为会有更多人需要使用助推器。\n随着全球病例的减少，尤其是美国，病例数量急剧下降，病例数量也随之下降。过去两周，美国病例下降了68%。尽管住院和死亡人数仍然很高，但这些数字也呈下降趋势。\n这种下降让许多专家和官员谨慎乐观地认为，大流行最糟糕的时期已经过去。随着许多人离开2019冠状病毒疾病，免受过去的感染和/或疫苗接种，许多专家希望OmiCon将是最后一次大规模的COVID-19型流感。\n不过，其他专家更为谨慎，他们指出，新的变种仍然可能出现，免疫力可能会随着时间的推移而减弱，季节性上升也不是不可能的。\n&#34;如果波浪结束，这并不意味着它可以&#39；不要再开始，&#34；BioNTech和#39；s Sahin周三说。他指出，BioNTech准备根据需要继续开发变异特异性疫苗。\n摩德纳&#39；s Bancel也确信，大流行不是&#39；结束&#34;我们认为需要一个助推器&#34；他说&#34;我不&#39；I don’我还不知道是现有的疫苗，仅奥米克罗，还是二价的（意思是）奥米克罗和现有的疫苗，一剂两种mRNA（疫苗）&#34;\nOmicron和#39；去年11月和12月，omicron的急剧上升引发了人们的直接担忧，即需要一种omicron特异性疫苗。当这种变种席卷全球时，科学家们对它携带的一大套突变以及它明显能够阻止以前的感染和目前的疫苗所建立的免疫防御感到震惊。然而，关于疫苗真实有效性的数据表明，三剂当前的mRNA疫苗可以在很大程度上恢复对奥米克罗的高水平保护，尤其是对严重疾病、住院和死亡的保护。\n与此同时，动物研究对设计用于匹配变异关键突变的omicron特异性疫苗能否提供更好的保护提出了质疑。在本月早些时候发布的一项小型灵长类动物研究中，奥米克罗特异性增强剂对奥米克罗的保护效果并不比目前的疫苗好多少。这项研究只涉及八只猴子，但研究结果与其他几项针对小鼠的研究一致，这些研究都表明，单一的变异体特异性增强剂不会对新变异体提供扣篮保护。", "note_en": "Vaccine makers are pushing back when omicron-specific COVID-19 vaccines could be ready for use. The shots were initially expected in March.\n Delays in the vaccines&#39; development come as cases of omicron have been dropping rapidly, and several animal studies have suggested the variant-specific formulations will not offer an advantage over the current vaccines.\n BioNTech CEO Uğur Şahin on Wednesday said that his company&#39;s omicron-specific vaccine had been delayed by several weeks due to unexpectedly slow data gathering,  according to Reuters. BioNTech and its COVID-19 vaccine partner, Pfizer, had announced last month that they had  begun a clinical trial with the omicron-specific shot.\n Meanwhile, Moderna CEO Stéphane Bancel said Wednesday that Moderna&#39;s omicron-specific shot could now be ready by August, according to  a separate Reuters report. Bancel did not provide an explanation for the slower timeline but said that the company was aiming to have the booster ready for the autumn, when he thinks more people will need a booster dose.\n The slowdowns come as global cases decline and the US, in particular, is seeing a precipitous drop. US cases have fallen 68 percent in the last two weeks. Although hospitalizations and deaths are still high, those numbers are trending downward as well.\n The declines have many experts and officials cautiously optimistic that the worst of the pandemic is behind us. With so many people leaving the omicron wave with protection from past infection and/or vaccination, many experts hope that omicron will be the last big COVID-19 surge.\n     Still, other experts are more wary, noting that new variants can still arise, immunity can wane over time, and seasonal upticks are not out of the question.\n &#34;If the wave ends, that does not mean it can&#39;t begin again,&#34; BioNTech&#39;s Sahin said Wednesday. He noted that BioNTech is prepared to continue developing variant-specific vaccines as needed.\n Moderna&#39;s Bancel was also convinced that the pandemic isn&#39;t over. &#34;We believe a booster will be needed,&#34; he said. &#34;I don&#39;t know yet if it is going to be the existing vaccine, omicron-only, or bivalent—[meaning] omicron and existing vaccine, two mRNA [vaccines] in one dose.&#34;\n Omicron&#39;s dramatic rise last November and December raised immediate concern that an omicron-specific vaccine would be necessary. As the variant swept the globe, scientists were struck by the large suite of mutations it carried as well as its clear ability to thwart immune defenses built up by previous infection and current vaccines. However, data on the real-world effectiveness of vaccines made clear that three doses of current mRNA vaccines could largely restore high levels of protection from omicron, particularly from severe disease, hospitalization, and death.\n At the same time, animal studies have cast doubt on whether omicron-specific vaccines, which are designed to match critical mutations in the variant, will provide better protection. In a  small primate study released earlier this month, the omicron-specific booster did not offer significantly better protection from omicron than a current vaccine. The study only involved eight monkeys, but the findings were consistent with several other  studies in  mice, which all suggest that a single variant-specific booster will not offer slam-dunk protection against a new variant.", "posttime": "2022-02-19 19:12:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "制造商,makers,疫苗", "title": "疫苗制造商宣布降低奥米克罗特异性增强剂的生产速度", "title_en": "Vaccine makers announce slowdowns for omicron-specific booster", "transed": 1, "url": "https://arstechnica.com/science/2022/02/omicron-specific-boosters-delayed-as-cases-fall-animal-studies-disappoint/", "via": "", "real_tags": ["制造商", "makers", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074106, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员周四表示，与伊朗政府结盟的黑客正在利用关键的Log4j漏洞，用勒索软件感染未打补丁的VMware用户。\n安全公司SentinelOne将该组织命名为TunnelVision。该名称旨在强调TunnelVision对隧道工具的高度依赖，以及其独特的部署方式。在过去，TunnelVision利用了所谓的1天漏洞，即最近修补的漏洞，用于尚未安装修复程序的黑客组织。Fortinet FortiOS（CVE-2018-13379）和Microsoft Exchange（ProxyShell）中的漏洞是该集团更知名的两个目标。\n据SentinelOne报道，TunnelVision最近开始利用Log4j中的一个关键漏洞进行攻击。Log4j是一个开源日志工具，已集成到数千个应用程序中。CVE-2021-44228（或Log4Shell，该漏洞被追踪或昵称）允许攻击者轻松获得对运行Java编程语言应用程序的计算机的远程控制。这种病毒叮咬了互联网上最大的玩家，并在它被发现后在野外成为了广泛的目标。SentinelOne的研究表明，目标仍在继续，这一次的目标是运行VMware Horizon的组织，VMware Horizon是一款在Windows、macOS和Linux上运行的桌面和应用程序虚拟化产品。\n该公司的研究人员阿米泰·本·舒山·埃利希（Amitai Ben Shushan Ehrlich）和雅尔·里格夫斯基（Yair Rigevsky）在一篇帖子中写道：“隧道入侵攻击者一直在积极利用该漏洞来运行恶意的PowerShell命令、部署后门、创建后门用户、获取凭据和执行横向移动。”。“通常，威胁参与者最初利用Log4j漏洞直接运行PowerShell命令，然后通过PS reverse Shell运行进一步的命令，通过Tomcat进程执行。”\nApache Tomcat是一个开源Web服务器，VMware和其他企业软件使用它来部署和服务基于Java的Web应用。一旦安装了一个外壳，黑客就可以在被攻击的网络上远程执行他们选择的命令。此处使用的PowerShell似乎是此公开版本的变体。安装后，TunnelVision成员将使用它：\n下载并运行隧道工具，包括Plink和Ngrok，它们用于隧道远程桌面协议流量\n黑客使用多种合法服务来实现和掩盖他们的活动。这些服务包括：\n试图确定自己的组织是否受到影响的人应该寻找与这些合法公共服务部门的不明原因的联系。\n周四的报告称，隧道探测与其他研究人员多年来暴露的几个威胁团体有重叠。微软将其中一个小组称为磷。据微软报道，该组织试图侵入美国总统竞选活动，并安装勒索软件，以期创收或扰乱对手。联邦政府还表示，伊朗黑客一直在用勒索软件攻击美国的关键基础设施。Sentineone表示，TunnelVision还与安全公司CrowdStrike tracks的两个威胁组织“迷人的小猫”和“复仇女神的小猫”重叠。\n“我们以‘隧道视觉’的名义分别跟踪这个集群，”哨兵研究人员写道。“这并不意味着我们认为它们必然无关，只是目前没有足够的数据将它们视为与上述任何归因相同。”\n这篇文章提供了一个指标列表，管理员可以使用这些指标来确定自己是否受到了威胁。", "note_en": "Hackers aligned with the government of Iran are exploiting the critical Log4j vulnerability to infect unpatched VMware users with ransomware, researchers said on Thursday.\n Security firm SentinelOne has dubbed the group TunnelVision. The name is meant to emphasize TunnelVision’s heavy reliance on tunneling tools and the unique way it deploys them. In the past, TunnelVision has exploited so-called 1-day vulnerabilities—meaning vulnerabilities that have been recently patched—to hack organizations that have yet to install the fix. Vulnerabilities in Fortinet FortiOS (CVE-2018-13379) and Microsoft Exchange (ProxyShell) are two of the group’s better-known targets.\n   Recently, SentinelOne reported, TunnelVision has started exploiting a critical vulnerability in Log4j, an open source logging utility that’s integrated into thousands of apps. CVE-2021-44228 (or Log4Shell, as the vulnerability is tracked or nicknamed) allows attackers to easily gain remote control over computers running apps in the Java programming language. The bug bit the  Internet’s biggest players and was widely  targeted in the wild after it became known. The SentinelOne research shows that the targeting continues and that this time the target is organizations running VMware Horizon, a desktop and app virtualization product that runs on Windows, macOS, and Linux.\n “TunnelVision attackers have been actively exploiting the vulnerability to run malicious PowerShell commands, deploy backdoors, create backdoor users, harvest credentials, and perform lateral movement,” company researchers Amitai Ben Shushan Ehrlich and Yair Rigevsky  wrote in a post. “Typically, the threat actor initially exploits the Log4j vulnerability to run PowerShell commands directly, and then runs further commands by means of PS reverse shells, executed via the Tomcat process.”\n    Apache Tomcat is an open source Web server that VMware and other enterprise software use to deploy and serve Java-based Web apps. Once installed, a shell allows the hackers to remotely execute commands of their choice on exploited networks. The PowerShell used here appears to be a variant of  this publicly available one. Once it’s installed, TunnelVision members use it to:\n Download and run tunneling tools, including Plink and Ngrok, which are used to tunnel remote desktop protocol traffic\n The hackers use multiple legitimate services to achieve and obscure their activities. Those services include:\n  People who are trying to determine if their organization is affected should look for unexplained outgoing connections to these legitimate public services.\n   Thursday’s report said that TunnelVision overlaps with several threat groups exposed by other researchers over the years. Microsoft has dubbed one group Phosphorous. The group, Microsoft has reported, has tried to  hack a US presidential campaign and to install ransomware in an attempt to generate revenue or disrupt adversaries. The federal government has also said Iranian hackers had been  targetting critical infrastructure in the US with ransomware. SentinelOne said that TunnelVision also overlaps with two threat groups security firm CrowdStrike tracks as Charming Kitten and Nemesis Kitten.\n “We track this cluster separately under the name ‘TunnelVision,’” the SentinelOne researchers wrote. “This does not imply we believe they are necessarily unrelated, only that there is at present insufficient data to treat them as identical to any of the aforementioned attributions.”\n The post provides a list of indicators that admins can use to determine if they’ve been compromised.", "posttime": "2022-02-19 19:10:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,vmware,horizon,运行", "title": "VMware Horizon服务器正受到伊朗国家黑客的积极攻击", "title_en": "VMware Horizon servers are under active exploit by Iranian state hackers", "transed": 1, "url": "https://arstechnica.com/information-technology/2022/02/iranian-state-hackers-are-using-log4shell-to-infect-unpatched-vmware-servers/", "via": "", "real_tags": ["黑客", "vmware", "horizon", "运行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌收件箱已经死了近三年，但人们并没有忘记。谷歌承诺将收件箱的许多创新应用于其幸存的电子邮件客户端Gmail，但从未真正实现。如果你仍然怀念收件箱，以及它让管理电子邮件变得多么容易，那么也许是时候走出谷歌&#39；客户服务。\n见面&#34；短波&#34；一家新的电子邮件初创公司，由几名前谷歌员工创办，完全复制了谷歌收件箱界面。收件箱中的每一项重大创新都回来了：电子邮件被收集到&#34；捆和#34；叫做&#34；更新&#34&#34;促销和#34；和&#34；社会的&#34；信息也可以按年龄分类。关键是&#34；扫#34；按钮返回，可以将一个捆绑包中的多封电子邮件标记为&#34；完成&#34；只需点击一下。\n扫描按钮是收件箱&#39；世界上最大的生产力促进器，it#39；这仍然是Gmail从未复制过的东西。Gmail有一个&#34；检查所有&#34；按钮，但那&#39；It’他将不明智地选择页面上的所有内容。“扫描”可以轻松地清除整个区域中的任何内容。Gmail有一种按类别对电子邮件进行排序的模式，但它将这些类别放在完全不同的选项卡中，你永远无法从一个页面扫描整个收件箱。收件箱和短波将捆绑邮件和常规邮件放在一个页面中，这样你就可以看到所有内容。这两个用户界面基本上有相同的成分，但短波和收件箱侧重于提高效率，而Gmail需要在多个页面上进行多次点击。\n短波实际上不是&#39；目前还没有独立的电子邮件服务。就像收件箱一样，它&#39；这是Gmail的另一个客户机。一方面，这意味着它&#39；这非常容易尝试。另一方面，你&#39；I’我需要授予此应用访问你的Gmail帐户和所有邮件的权限。那&#39；一家新公司提出了一个可怕的建议，但短波背后的人都很有名气。该项目是由Firebase推送消息部门的一群前谷歌员工策划的。货币化战略也不是&#39；t邪恶：和Slack一样，Shortwave可以免费使用，90天内可以访问您的电子邮件历史记录。通过搜索和&#34；所有邮件&#34；页面要求注册&#34；标准&#34；这个计划是每人每月9美元。免费版没有广告和短波&#39；美国的隐私政策说它&#34；不出售个人数据&#34;\n生活质量也有很多改善，比如&#34；打盹&#34；和&#34；别针&#34；按钮（再次直接从收件箱中撕下）、撤消发送和通知的请勿打扰设置。那里&#39；这是一款iOS应用程序和桌面PWA，但你现在可以使用的一款是Android应用程序。它存在，但只作为&#34；在建工程&#34&#34;贝塔和#34；目前，该应用程序似乎主要是回收的网页代码。iOS应用程序看起来很棒，而且是本地的，但Android应用程序不是&#39；还没到呢。它&#39；如果你只想收到通知、刷走一捆捆的电子邮件或阅读一些东西，它是有用的。但安卓版本作为原生应用看起来会更好。\n我&#39；我感到惊讶的是，创业思维要求，即使你是一群前谷歌人，克隆一个死了的谷歌产品，你仍然可以&#39；不要优先考虑谷歌手机应用。Android用户的生活很艰难。\n就像Slack和谷歌应用一样，未来也有计划推出&#34；企业和#34；公司的套餐。这里的长期目标似乎是打造一家松懈的公司。而Slack则通过短信应用攻击企业电子邮件市场，告诉用户&#34；改为发送DM，&#34；短波想要从完全相反的方向攻击市场。该公司的博客上有一篇题为&#34；电子邮件：信息的未来，&#34；我&#39；我不太确定我现在能不能振作起来。不过，像Gmail和Google Talk一样，一些消息功能也在向短波传播。你可以试试看。Firebase的前员工肯定有一些信息方面的专业知识，因为他们建立了一个系统，目前为所有谷歌公司提供了动力&#39；s推送消息。我&#39；我很惊讶，一家拥有这种商业模式的公司目前没有&#39；我自己不做任何电子邮件托管，一切都通过Gmail服务运行。但我&#39；我确信公司托管的电子邮件在某个地方的路线图上。如果没有其他东西的话，这项服务很容易试用，你可以重温谷歌收件箱的辉煌岁月。如果你喜欢短波，也许你&#39；我会留下来的。", "note_en": "Google Inbox has  been dead for nearly three years, but the people have not forgotten. Google promised to bring many of the innovations of Inbox to its surviving email client, Gmail, but never really did. If you still miss Inbox and how easy it made managing email, maybe the time has come to venture outside of Google&#39;s client offerings.\n Meet &#34; Shortwave,&#34; a new email startup from a few former Googlers that exactly replicates the Google Inbox interface. Every major innovation from Inbox is back: emails get collected up into &#34;bundles&#34; called things like &#34;updates,&#34; &#34;promotions,&#34; and &#34;social,&#34; and messages can also be categorized by age. Critically, the &#34;Sweep&#34; button is back, which lets you mark multiple emails in a bundle as &#34;done&#34; with a single click.\n The sweep button was Inbox&#39;s biggest productivity booster, and it&#39;s still something Gmail has never replicated. Gmail has a &#34;check all&#34; button, but that&#39;s unintelligently going to select everything on the page. Sweep lets you easily banish anything in an entire section. Gmail has a mode that sorts email by category, but it places those categories into totally separate tabs, and you can never scan your whole inbox from one page. Inbox and Shortwave put bundled emails and regular emails in a single page, so you can see everything. The two user interfaces mostly have the same ingredients, but Shortwave and Inbox are focused on productivity, while Gmail takes multiple clicks on multiple pages.\n Shortwave actually isn&#39;t a standalone email service yet. Just like Inbox, it&#39;s an alternative client for Gmail. On one hand, this means it&#39;s super easy to try out. On the other hand, you&#39;ll need to grant this app access to your Gmail account and all your mail. That&#39;s a scary proposition coming from a new company, but the people behind Shortwave are reputable. The project was  cooked up by a bunch of ex-Googlers from the Firebase push-messaging division. The monetization strategy also  isn&#39;t evil: like Slack, Shortwave is free to use with limited 90-day access to your email history. Unlimited email history through search and the &#34;all mail&#34; page requires signing up for the &#34;standard&#34; plan, which is $9 per person, per month. The free version has no ads, and Shortwave&#39;s  privacy policy says it &#34;does not sell Personal Data.&#34;\n     There are also numerous quality-of-life improvements, like &#34;snooze&#34; and &#34;pin&#34; buttons (again ripped straight from Inbox), undo send, and a do-not-disturb setting for notifications. There&#39;s an iOS app and desktop PWA, but the one thing you can ding Shortwave for right now is the Android app. It exists but only as a &#34;work-in-progress&#34; &#34;beta&#34; app that, at the moment, mostly seems to be recycled webpage code. The iOS app looks great and native, but the Android app isn&#39;t there yet. It&#39;s serviceable if you just want to get notifications, swipe away bundles of emails, and read some things. But the Android version would look much better as a native app.\n I&#39;m amazed that the startup mindset demands that, even when you are a bunch of ex-Googlers cloning a dead Google product, you still can&#39;t prioritize the Google phone app. Life is tough out there for Android users.\n  Just like Slack and Google Apps, there are future plans for an &#34;enterprise&#34; package for companies. A Slack-like company appears to be the long-term goal here. While Slack attacks the enterprise email market via a messaging app, telling users to &#34;Send a DM instead,&#34; Shortwave wants to attack the market from the exact opposite direction. The company blog is home to a wild post titled &#34; Email: The Future of Messaging,&#34; which I&#39;m not quite sure I can wrap my head around right now. Like Gmail and Google Talk, though, some messaging features are trojan-horsing their way into Shortwave. You can give them a try. There is certainly some messaging expertise from the ex-Firebase employees since they built a system that currently powers all of Google&#39;s push messaging. I&#39;m surprised that a company with this kind of business model currently doesn&#39;t do  any email hosting of its own and runs everything through Gmail service. But I&#39;m sure company-hosted email is on the roadmap somewhere. If nothing else, the service is a breeze to try out, and you can relive the glory days of Google Inbox. If you like Shortwave, maybe you&#39;ll stick around.", "posttime": "2022-02-19 19:08:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,歌人,resurrect,电子邮件", "title": "前谷歌人将谷歌收件箱界面恢复为“短波”电子邮件", "title_en": "Ex-Googlers resurrect Google Inbox interface as “Shortwave” email", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/ex-googlers-resurrect-google-inbox-interface-as-shortwave-email/", "via": "", "real_tags": ["google", "谷歌", "歌人", "resurrect", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074102, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉本周面临新的头痛问题。美国国家公路交通安全管理局（National Highway Traffic Safety Administration）已开始对a&#34；幻影制动&#34；在收到最近的3型和Y型车主的数百起投诉后，国家公路交通安全管理局表示，总共约有41.6万辆汽车受到影响。\n2021年5月，特斯拉决定从模型3和Y型EV模型中移除前视雷达传感器。一些汽车使用了这种传感器&#39；先进的驾驶员辅助系统，如自适应巡航控制、前向碰撞警告和自动紧急制动。\n相反，为北美市场打造的新特斯拉完全依靠摄像头。在拆除时，特斯拉指出，这一变化意味着汽车&#39；国家公路交通安全管理局（NHTSA）不再对前向碰撞警告和自动紧急制动功能进行评级，但该公司预计该评级将达到34；在接下来的几周里&#34;\n2021年12月，公路安全保险研究所测试了特斯拉和第39号；他很高兴地获得了Y a和#34型号；顶级安全镐+和#34；评级国家公路交通安全管理局尚未效仿。\n特斯拉转向完全基于摄像头的方式&#39；s ADAS套件并非没有问题。具体来说，自动紧急制动功能的激活存在问题，原因是车辆将阴影视为障碍物等情况导致误报。\n在2021年11月，特斯拉发布了一个召回其魅惑制动问题的“和”34；全自动驾驶（FSD）测试版和#34；驾驶员辅助系统。此次召回影响了近1.2万台特斯拉，只有其所有者为FSD功能付费并被纳入测试计划的特斯拉才会受到影响。\n但幻影制动的问题并不局限于有争议的FSD模式。2月初，《华盛顿邮报》报道了特斯拉车主向国家公路交通安全管理局提出的越来越多的投诉。特斯拉车主告诉该机构，他们的汽车在不适当的时间（例如，以高速行驶时）猛踩刹车，误以为前方有障碍物。\n邮报上的那篇文章引起了某种滚雪球效应；周四，《华盛顿邮报》报道称，在两周的时间里，NHTSA又收到了250起业主投诉。投诉常常涉及一个场景，远处一辆大卡车正驶向特斯拉。\n投诉的数量显然足以让该机构展开调查；这将是它对特斯拉的第三次公开调查。美国国家公路交通安全管理局（NHTSA）也一直在调查早期（配备雷达的）特斯拉撞上应急车辆和另一辆撞上汽车制造商的倾向&#39；s现在禁用了允许乘客在车上玩电子游戏的功能&#39；车辆行驶时的信息娱乐屏幕。", "note_en": "Tesla is facing a new headache this week. The National Highway Traffic Safety Administration has opened an investigation into a &#34;phantom braking&#34; problem after receiving hundreds of complaints from owners of recent Models 3 and Y. In total, the NHTSA says that about 416,000 cars are affected.\n In May 2021, Tesla decided to remove the forward-looking radar sensor from the Model 3 and Model Y EVs. This sensor was used by some of the cars&#39; advanced driver-assistance systems, like adaptive cruise control, forward collision warning, and automatic emergency braking.\n Instead, new Teslas built for the North American market rely entirely on cameras. At the time of the removal,  Tesla noted that the change meant the cars&#39; forward collision warning and automatic emergency braking functions were no longer rated by the NHTSA but that the company expected that rating to happen &#34;in the coming weeks.&#34;\n In December 2021, the Insurance Institute for Highway Safety tested Tesla&#39;s camera system and came away  happy enough to award the Model Y a &#34;Top Safety Pick+&#34; rating. The NHTSA has yet to follow suit.\n The move to an entirely camera-based approach for Tesla&#39;s ADAS suite has not been without issues. Specifically, there have been problems with the automatic emergency braking function activating due to false positives caused by things like a shadow that the car interprets as an obstacle.\n    In November 2021, Tesla issued a recall for a phantom braking problem with its &#34;Full Self-Driving (FSD) Beta&#34; driver-assistance system. The recall affected nearly 12,000 Teslas—only those whose owners had paid for the FSD feature and been accepted into the beta testing program.\n But the problem of phantom braking is not limited to the controversial FSD mode. In early February,  The Washington Post reported on a growing number of complaints made to the NHTSA by Tesla owners, who told the agency about situations in which their cars slammed on the brakes at inappropriate times (for example, when driving at highway speed), mistakenly believing an obstacle was ahead.\n The article in the Post caused something of a snowball effect; on Thursday, the Post reported that the NHTSA has received another 250 complaints from owners over the course of two weeks. Frequently, the complaints involved a scenario in which a large truck in the distance was driving toward a Tesla.\n The number of complaints was evidently sufficient for the agency to open an inquiry; this will be its third open investigation into Tesla. The NHTSA has also been  conducting an investigation into the propensity of earlier (radar-equipped) Teslas to crash into emergency vehicles and yet another into the  automaker&#39;s now-disabled feature that allowed occupants to play video games on the car&#39;s infotainment screen while the vehicle was in motion.", "posttime": "2022-02-19 19:03:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,特斯拉,国家,radar,安全", "title": "投诉激增后，美国国家公路交通安全管理局对特斯拉的无雷达汽车进行了调查", "title_en": "Tesla’s radar-less cars investigated by NHTSA after complaints spike", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/teslas-radar-less-cars-investigated-by-nhtsa-after-complaints-spike/", "via": "", "real_tags": ["美国", "特斯拉", "国家", "radar", "安全"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OtterBox在发现膨胀问题后，将免费更换OtterSpot无线充电电池组。\nOtterSpot无线充电系统由36 W充电垫底座驱动，可用于Qi无线充电，您可以在顶部堆叠两个10 W、5000毫安时的OtterSpot电池，为其充电，以供移动使用。\n在OtterSpot发布大约两年半后，OtterBox现在表示电池组会膨胀&#34；在多堆栈和更高温度条件下，&#34；《边缘报》周四报道。OtterBox和#39；s的支持页面将问题称为&#34；组件缺陷&#34;\nOtterBox的一名代表告诉Verge，唯一受影响的单元是在2019年7月至8月期间生产的，当时该产品首次发布。这些装置的序列号以&#34开头；229,&#34; &#34;259,&#34; 或&#34；250.&#34;\n&#34;如果您购买了该序列号范围内的OtterSpot电池，我们建议您停止使用，并致电1-855-688-7269联系我们的客户服务部门，安排更换电池，您无需承担任何费用，&#34；OtterBox和#39；s的支持页面显示。它指出&#34；目前还没有人员受伤的报告&#34;\nOtterBox还告诉Verge，它向在相关时间段内购买了OtterSpot的客户发送了电子邮件。", "note_en": "OtterBox is replacing OtterSpot wireless charging battery packs for free after identifying a swelling issue.\n The OtterSpot wireless charging system is driven by a 36 W charging pad base that can be used for Qi wireless charging, and you can stack up to two 10 W, 5,000 mAH OtterSpot batteries on top to charge them for on-the-go use.\n   About two and a half years after the OtterSpot was released, OtterBox is now saying that the battery packs can swell &#34;under multi-stack and higher temperature conditions,&#34;  The Verge reported Thursday. OtterBox&#39;s  support page refers to the problem as a &#34;component defect.&#34;\n An OtterBox representative told The Verge that the only units affected were made between July and August 2019, when the product was first released. The units have serial numbers starting with &#34;229,&#34; &#34;259,&#34; or &#34;250.&#34;\n &#34;If you purchased an OtterSpot battery within that serial number range, we recommend you discontinue use and contact our Customer Service Department at 1-855-688-7269 to arrange for a replacement battery at no cost to you,&#34; OtterBox&#39;s support page reads. It notes that &#34;no injuries have been reported.&#34;\n OtterBox also told The Verge that it emailed customers who bought an OtterSpot during the relevant time period.", "posttime": "2022-02-19 19:01:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "无线,wireless,otterspot", "title": "OtterBox的无线充电电池存在膨胀问题", "title_en": "OtterBox’s wireless charging battery has a swelling problem", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/otterboxs-wireless-charging-battery-has-a-swelling-problem/", "via": "", "real_tags": ["无线", "wireless", "otterspot"]}]