[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1033992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Go/Golang是Google的开源编程语言，通常用于后端/系统工程。它的主要优点是静态类型、快速编译以及通过其有限的特性集实现的简单性。\n几年来，我一直在GO做内部服务的日常工作，从各种成功案例、事故事后回顾以及与其他工程师的对话中，我注意到了一些共同的主题。这篇帖子启发我写下了其中的一些经历。\nGo VET是一个静态分析器，它检查常见的缺陷，比如使用对迭代器变量的引用。\n自动将其作为Linteror或CI运行，以便在问题投入生产之前将其捕获。\nStaticcheck是另一种静态分析器，可以捕获死代码等问题。根据我的经验，在本地运行大型项目太慢了，但作为预提交的CI签入很有用。\n在实践中，通常会假设如果返回的错误为nil，则返回值为非nil，反之亦然。如果错误为nil，则尝试在所有情况下验证返回值是否为非nil会增加冗长，但好处很小。因此，如果您正在编写一个具有许多不同用例的库，那么如果err对于调用者来说是nil，那么保证一个非nil值是很有用的。我不知道有什么很好的解决方案来自动标记它，因为在某些情况下同时返回两个Nil是有效的。\n在大多数情况下，服务应该因恐慌而终止。由于死机可能源自代码库中的任何位置并暂停执行，因此不会运行错误处理代码(恢复除外)，内部状态可能会变得不一致。换句话说，“所有的赌注都取消了”。死机处理程序应该是一个顶级函数，它会尽最大努力向外部系统报告异常，然后终止。确定性恐慌应该通过SLO警报(如可用性)或在任务级别检查崩溃循环来捕获。\n按照惯例，在有效错误场景中死机的函数必须以‘Must`为前缀。这向调用者发出信号，他们正在调用的函数应该经过彻底的审查，并且在没有经过清理的情况下不能传递任意输入。我曾经遇到过任意输入导致一小部分机队崩溃的事件，这些事件很难追踪(因为我们没有通过向异常报告系统报告来处理恐慌)。\n这个问题特别值得一提的是--即使您已经在Go中工作了几年，也需要花费很多小时来调试它们，所以这是值得记住的。\nFor_，val：=范围值{go func(){fmt.Println(Val)//没有做您期望的事情}()}。\nGo提供了一个竞争检测器来捕获并发编程错误。它通常会使内存使用量翻倍，并减慢程序的运行速度。用户可以在竞争模式下在CI中运行测试以捕获问题。\n偶尔，bug在被竞争检测器捕获之前就被部署到生产中，因为它们不确定地失败了。对更改进行几个小时的“烘焙”/运行压力测试，直到某些自动化可以捕捉到这些薄片，这是很有用的。通常，竞争检测器会捕捉到仅限测试的问题，因为开发人员通常不会过多地考虑测试的并发性。\n尝试在竞争模式下部署Canary实例来主动检测问题似乎是个好主意，但这会导致显著的延迟倒退，因此再也没有尝试过。\n注意呼叫者的最后期限--他们可能没有为您的服务提供足够的时间来完成它自己的工作。例如，您的服务可能需要500ms才能完成一项操作，但调用者可能会出于任何原因将截止时间指定为100ms(通常嵌套调用者的截止时间很短)。这些将在您的服务中表现为超时，并影响其SLA。如果您的服务没有提供有意义的时间来完成工作，那么您的服务应该失败。如果到处检查这一点听起来有点过分--它值得记录调用者收到的截止日期，这样你就可以在下一次调试神秘的超时时追踪到来源。\n通过库记录错误堆栈跟踪，这样您就不会纠结于错误是从哪里来的。\n围棋是我在生产中使用的“围棋”语言。希望这些经验能为你在Go中开发下一项服务时提供一些思考的素材。", "note_en": "Go/Golang is Google’s open source programming language generally used for backend/systems engineering. Its major benefits are static typing, fast compilation times, and simplicity via its limited featureset.\n I’ve been working with Go at my day job for internal services for a few years - and have noticed some common themes from various success stories, incident post-mortems, and conversations with other engineers.  This post inspired me to write some of these experiences down.\n  go vet is a static analyzer that checks for common pitfalls, like using  references to iterator variables.\n Run this automatically as a linter or in CI to catch issues before they hit production.\n  staticcheck is another static analyzer that catches problems like dead code. In my experience, it’s too slow to run locally for large projects, but it’s useful as a pre-submit check in CI.\n     In practice, there’s often an assumption that if the returned error is nil, then the returned value is non-nil, and vice-versa. Trying to verify in all cases that the returned value is non nil if the error is nil adds verbosity for very little benefit. So if you’re writing a library that has many different use cases, it’s useful to guarantee a non nil value if err is nil to callers. I don’t know of a great solution to automatically flag this, since it’s valid to return both nils in some cases.\n  In most cases, services should terminate on panic. Since the panic can originate anywhere in the codebase and halt execution, no error handling code (except recover) is run, and internal state can become inconsistent. In other words, “all bets are off”. The panic handler should be a top level function that best effort reports an exception to an external system, and then terminates. Deterministic panics should be caught by SLO alerts like availability, or checks for crash loops at the task level.\n  By convention, functions that panic in valid error scenarios must be prefixed with `Must`. This signals to callers that the function they’re calling should be thoroughly vetted and not passed arbitrary input without sanitization. I’ve had incidents where arbitrary input causes crashes on a small percentage of the fleet that have been hard to track down (since we didn’t handle panics by reporting them to an exception reporting system).\n  This issue deserves a special mention - it will take you many hours to debug these, even if you’ve been working in Go for several years, so it’s worth remembering.\n for _, val := range values {\tgo func() {\t\tfmt.Println(val) // doesn&#39;t do what you expect\t}()}\n  Go provides a  race detector to catch concurrency programming bugs. It will often double memory usage and slow down your program. One can run tests in CI in race mode to catch issues.\n Occasionally, bugs are deployed to production before they’re caught by the race detector since they fail non deterministically. It’s useful to “bake” changes for a few hours/run a stress test until  some automation can catch these flakes. Often, the race detector catches a testonly issue, since developers often don’t think too much about concurrency for tests.\n It seemed like a good idea to try deploying canary instances in race mode to detect issues proactively, but that caused a significant latency regression and was never tried again.\n   Be careful with caller deadlines - they might not provide enough time for your service to finish its own work. For example, your service might take 500ms to complete an operation, but a caller might specify a deadline of 100ms for whatever reason (generally a tight deadline by a nested caller). These will manifest as timeouts in your service and affect its SLA. Your service should fail requests that don’t provide meaningful time to complete work. If it sounds like overkill to check this everywhere - it’s worth logging the received deadline by caller, so you can track down the source the next time you have to debug mysterious timeouts.\n  Log error stack traces via  libraries so you’re not stuck wondering where an error came from.\n  Go is my “go to” language to use in production. Hopefully these experiences provide some food for thought when you develop your next service in Go.", "posttime": "2020-11-09 15:07:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务,internal,运行", "title": "去找内部服务", "title_en": "Go for Internal Services", "transed": 1, "url": "https://reliability.substack.com/p/go-for-internal-services", "via": "", "real_tags": ["服务", "internal", "运行"]}, {"category": "", "categoryclass": "", "imagename": "e8e25c27cd16f06338165705846c1af7.jpg", "infoid": 1033991, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10月中旬，一台名为BladeBUG的六条腿的检修机器人在Fife海岸外的英国ORE Catapult公司的7兆瓦莱文茅斯示范涡轮机的叶片上反复行走。这一事件标志着机器人首次攀爬风力涡轮机叶片。\n这个问题为什么重要呢？因为这种技术可以将叶片检测技术的成本降低30%以上。这种新型机器人是BladeBUG和ORE Catapult之间价值1315750英镑(100万英镑)的合作项目的成果，该项目由Innovate UK提供部分资金。\n一旦在明年年底完成，BladeBUG将能够扫描叶片表面的裂缝和缺陷，并将其发现传达回岸上。“这是一项令人难以置信的重要技术，我们知道它正受到业界的密切关注，被视为潜在的游戏规则改变者，”ORE Catapult的运营性能总监克里斯·希尔(Chris Hill)说。\n首次在海上风力涡轮机上运行的叶片行走已经证明了机器人的多种能力。在测试过程中，它在莱文茅斯涡轮机上垂直放置的叶片上穿越了165英尺(50米)。\n这种刀片的长度为275英尺(84米)，直立时刀尖可高出海面640英尺(195米)。对于我们这个六条腿的小机器人来说，这是一个相当令人印象深刻的旅程，但更令人印象深刻的是它带来的诸多好处。\n他说：“它在削减成本、减少人员离岸部署和延长叶片寿命方面有着明显的潜力。但是，我们还没有看到机器人在海上真正的涡轮机上会有怎样的表现。我认为BladeBUG在莱文茅斯的第一次漫步是海上风能的“月球漫步”--这是该行业发展过程中的一个历史性里程碑。机器人技术将继续存在，它们将是未来几年运营不断扩大的风力发电场、更深的水域以及更快、更大的涡轮机的重要组成部分，BladeBUG首席执行官克里斯·切斯拉克(Chris Cieslak)补充道。", "note_en": "In mid-October, a six-legged inspect-and-repair robot called BladeBUG repeatedly  walked on the blades at UK&#39;s ORE Catapult’s  7MW Levenmouth Demonstration turbine off the coast of Fife. The event marked the first time ever that a robot scaled the blades of a wind turbine.\n  Why is it important? Because such technology could reduce the cost of blade inspection techniques by over  30%. The novel robot is the result of a  $1,315,750 ( £1 million) collaboration project between BladeBUG and ORE Catapult, part-funded by Innovate UK.\n Once completed by the end of the next year, BladeBUG will be able to scan  blade surfaces for cracks and imperfections and communicate its findings back to shore. “This is an incredibly significant technology that we know is being keenly watched by the industry as a potential game-changer,” said Chris Hill, ORE Catapult’s Operational Performance Director.\n   The first-ever blade walk on an operational offshore wind turbine has now proven the robot&#39;s many capabilities. During the test, it traversed  165 feet (50 meters) on a vertically positioned blade on the Levenmouth turbine.\n  This  blade has a length of  275 feet (84 meters) with the tip reaching  640 feet ( 195 meters) above the sea when upright. That&#39;s quite an impressive journey for our little six-legged robot but what is even more impressive is the many benefits it brings.\n “It has a clear potential for cutting costs, reducing human offshore deployment, and increasing blade lifetimes. But, we had yet to see how the robot would perform on a real turbine out at sea. I consider BladeBUG’s first walk at Levenmouth as offshore wind’s ‘moonwalk’ – a historic milestone in the industry’s evolution. Robotics are here to stay, and they will be an essential ingredient to operating ever-expanding  wind farms, deeper-water sites, and faster, bigger turbines in the coming years,&#34; Chris Cieslak, BladeBUG CEO added.", "posttime": "2020-11-09 14:50:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,robot,叶片", "title": "维修机器人在风力机叶片上行走，这是世界上第一次", "title_en": "Maintenance Robot Walks on a Wind Turbine's Blade in a World First", "transed": 1, "url": "https://interestingengineering.com/maintenance-robot-walks-on-a-wind-turbines-blade-in-a-world-first", "via": "", "real_tags": ["机器人", "robot", "叶片"]}, {"category": "", "categoryclass": "", "imagename": "711e4100c2057ecd3ad8b7b4924103fc.jpg", "infoid": 1033990, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在24小时内，我将在我的公寓里失明，孤身一人。我最终想试着失明一周，但我需要七天的时间，没有其他的义务，而且我暂时不会有这样的经历。就目前而言，我只需要做一些小规模的实验就足够了，另外还有一些额外的规定，以增加难度。\n我必须24小时戴着眼罩。如果眼罩掉了，或者我的视力不全，我的实验就失败了。\n我会把闹钟设为24小时。我不能设置任何其他闹钟或使用任何其他方法来确定时间。让我的手机充电是我的责任，这样闹钟就会响。\n我没有很好的理由。我只是想看看我是否有能力做到这一点，以及会发生什么。有几件事我很好奇：\n我能通过手机上的播客、有声读物和音乐来打发无聊吗？\n我会因为缺乏感官输入而进入某种冥想状态吗？\n我要吃东西吗？摄入咖啡因是一个好主意(娱乐)还是坏主意(没有方向的能量)？\n这段经历会让我对失明一周更感兴趣吗？还是更少？\n尝试一开始于上午10：30，下午1：13失败。我故意摘下了我的眼罩，因为我担心我多次输入iPhone密码的失败会导致永久锁定或数据擦除。但密码屏幕只被锁定了一分钟，一切都很正常。\n考虑到我在下午早些时候失败了，我考虑在另一天早上重新开始实验。但我已经有了24小时的时间，在这段时间里，我不会做任何工作，也不会被打扰，可能还需要一两个星期才能再次获得这个机会。\n第二次尝试成功了。2020年11月5日星期四下午1点23分，我戴上了眼罩。我在11月6日星期五下午1点28分把它移走了。\n那是一辆…。有趣的经历。我不推荐，但我很高兴我这么做了。我不知道从哪里开始描述它，特别是因为我不能做笔记，而且部分挑战是被弄糊涂了。但我会尽我最大努力打破这段经历。\n为了模拟失明，我用一条深蓝色围巾作为眼罩。有一层不够暗，所以我把它对折起来，以便更好地保护光线。\n戴上眼罩，无论眼睛是睁着还是闭着，我的视力都是一样的。我99.9%的时间都闭着眼睛，因为它通常更舒适，而且有助于限制光线。我偶尔睁开眼睛看看亮度，然后看…。我想你可以称之为拉长我的眼皮。如果你把它们关得太久，它们会感觉不舒服。\n我无法在眼睛周围围上完美的围巾，所以有时当我坐着向后仰着头的时候，我注意到有一丝光线进入了我的视线底部。为了限制这一点，我经常在那个位置捏住鼻子周围的围巾。但不管怎样，很多/大多数盲人都能看到一些光，所以我不认为这是对实验的重大违反。\n我的眼睛在围巾下面变得很干，所以我在这个眼睑和眼窝上涂了四五次保湿霜。我也想用眼药水，但要做到这一点，不通过实验是不可能的。\n起初，一切都是黑色的，但随着时间的推移，太阳落山了，即使透过两层围巾和眼皮，我也能分辨出已经是晚上了。我不确定我是否能分辨出来，因为我的眼睛已经调整到对光非常敏感，或者是否有其他微妙的信号(即。噪音、气温、昼夜节律等)。我的身体也注意到了这一点。作为后者的证据，我看不出电视是开着还是关着，冰箱是开着还是关着的，即使我就坐在这两个人的前面。\n我所看到的取决于我如何运用我的注意力。如果我真的专注于我的视力，我会看到你闭上眼睛得到的典型的黑色，但它从来都不是完全黑色的，也不是一成不变的；总是有一些奇怪的动作和偶尔的颜色(白色，淡蓝色，有时是红色)。最常见的扭曲是呈漩涡状或流动状的白色，有点像咖啡里的奶油。我希望被蒙住眼睛这么长时间会让扭曲变得更极端，但在很大程度上，它看起来与现在闭上眼睛10分钟所看到的没有什么不同。\n有一个例外。实验大概进行了20多个小时，我的眼睛发痒，所以我同时在围巾上摩擦了两只眼睛。如果你在任何时候揉揉闭上的眼睛，专注于你的视力，你就会看到一些奇怪的东西，但这比平时要极端得多。我记得我的整个视觉都充满了白色的气泡，然后这些气泡破裂了，短暂地回到了黑色。然后，白色的闪电形状延伸到我的视线上，扩大到让我的视线变得纯白，然后慢慢地淡出到黑色。最奇怪的是它的亮度。尽管我在黑暗的房间里被蒙住眼睛，但我真的感觉自己在凝视着灯光。不幸的是，它只持续了大约30秒，但我的心跳得很快。\n比我看到的更值得注意的是我没有看到的东西。默认情况下，我陷入沉思，什么都不关注。在这样的状态下，我甚至没有记录我的视力，也没有注意到黑暗。我想这让我的想象力和脑海中的想象更加敏锐。有时候，我会陷入沉思，我会再次感受到光明的感觉，因为我会在脑海中生动地想象一些东西，以至于不可避免地回到黑暗中，感觉就像关闭了我大脑中的灯。我将在三个阶段部分详细解释这一点。\n遗憾的是，我没有产生幻觉，或者至少在我所知的范围内没有。\n我读到盲人很难入睡，因为他们无法接触到任何/足够的光线来调节他们的昼夜节律。我的问题似乎正好相反。没有光线，我的身体总是认为是时候睡觉了，而且做其他任何事情都有困难。在整个实验的大部分时间里，我都感到极度昏昏欲睡、懒惰，不得不努力保持清醒。\n上午10点半，我开始了我第一次失败的实验。我足足睡了7.5个小时，前一天也没做什么累人的事，总体感觉还好。然后我戴上眼罩，不到30分钟我就睡着了。我半睡半醒地睡了两个小时，然后决定喝杯能量饮料，让自己从恐惧中解脱出来。这招奏效了，但当它一消失，我就又回到了半睡眠状态。\n即使在我清醒的时候，我通常也会感到虚弱和昏昏欲睡。当然，在公寓里走动很烦人，但我的精力水平让我的行动变得更加困难。我最终完全静止地躺在我舒适的电脑椅上，95%的时间我的脚放在桌子上。也就是说，当我没有躺在床上的时候。\n另一方面，当我在24小时后摘下眼罩时，我感受到了能量的迸发。说真的，就像我喝了两杯浓缩咖啡。就像一个开关被按了一下。迷雾和蜘蛛网瞬间消失了，我感觉到能量在我的身体里流动。我猜光线对我有很大的影响。\n在很大程度上，我慢慢地在公寓里走来走去，伸出一只手去摸墙壁和边缘。有时我会变得懒惰，爬来爬去，这样更容易些。我对我的公寓非常了解，所以四处走动并不难，但偶尔我会忘记自己身在何处，只能慢慢地挥动手臂寻找任何东西。这不是一种愉快的感觉。\n在实验之前，我曾计划在闲暇时间里四处走动找点乐子，或者甚至做些运动。但混乱，尤其是昏昏欲睡阻止了这一切。我只是坐在椅子上，一动不动，除非我需要喝一杯，去洗手间，或者睡觉。\n我有点希望我是在一个不熟悉的环境中做这个实验，以增加运动的挑战性，但是，哦，好吧。\n在食物方面，我在实验前10点吃了一顿丰盛的午餐，然后整个晚上都在大嚼黑巧克力。早在卡路里不足成为问题之前，我就感觉到了沉重的昏昏欲睡。我可能应该在冰箱里放一些预先包装好的饭菜吃，但我担心弄得一团糟，收拾不干净。我想要蚂蚁吗？因为我就是这么养蚂蚁的。\n对于饮料，我可以设法去厨房，在需要的时候加满一杯水。我从来没有把满满的杯子放回椅子上，以防撞倒(清理工作将是一场噩梦)。我还喝了一些健怡可乐作为娱乐，还在身体里放了一点咖啡因。\n在洗手间，我(一个男人)坐着撒尿。我不羞于承认这一点。\n作为实验的一部分，我从来不知道几点了。这是为了在整个24小时内迷惑我，它确实起到了作用，但它可能也起到了帮助作用。在没有时间观念的情况下，人们很容易坐下来不去想这件事。时光流逝，我存在。就是这样。\n有一次，我确实问过Siri的时间，…。实验进行得太晚了，感觉好像我很久以前就戴上了眼罩。正如你所预料的那样，当你失明且无事可做时，时间会感觉流逝得很慢。我一直在等我的手机…闹钟响。但事实并非如此。\n最后，我放弃了，并愿意通过询问Siri几点的时间来完成我的挑战的一部分。她告诉我现在是下午1点28分。警报器应该已经响了。\n后来我才发现，我是在闹钟响的那一刻不小心把闹钟弄睡了，当时我正盲目地按手机暂停一首歌。因此，我的意志失败发生在实验范围之外，我不认为这是一种取消资格的行为。\n同样，据我所知，我的其他感官也没有明显增强，但…。我确实更欣赏我的其他感官，这似乎至少增加了我对它们的享受。我发誓黑巧克力和健怡可乐的味道比以往任何时候都要好。正如我将分三个阶段解释的那样，音乐有时特别令人愉悦。\n作为实验规则的一部分，我不能与任何其他人互动，无论是面对面的还是数字的。因此，我最终避开了我最终想做的另外两个实验：\nSiri既是我最好的朋友，也是我最大的敌人。起初，我想禁止Siri，让它对我来说更具挑战性，但我觉得这太接近于“坐在房间里什么都不做”的挑战了。幸运/不幸的是，与Siri打交道本身就是一项挑战。\n首先，我想听有声读物。我读完了《凯撒：巨人的一生》的最后一个小时，然后准备开始我可听清单上的下一本书，但是…。Siri无法让我访问它。我尝试了十几种不同的语音命令。但没有奏效。\n所以我转向播客。我告诉Siri播放我的播客应用程序，它启动了一集相当长的乔·罗根体验(Joe Rogan Experience)。然后我让她演“山姆·哈里斯”，但没有奏效。我让她玩“有意义的播客”，但没有奏效。我试了更多的乔·罗根，但没用。我转到了Spotify，但我只能播放乔·罗根(Joe Rogan)那一集。\n该死的Siri。或者因为我太蠢而不能正确使用Siri。没有…。去他妈的她。如果我想不出如何让Siri播放旧播客，而我却戴着眼罩坐在黑暗中24小时无事可做，那是Siri的错，不是我的错。\n我大部分时间都求助于音乐。但我不是个音乐爱好者。我从来不听音乐，除非我在做其他能占据我大部分注意力的事情，比如写作或玩电子游戏。即使我开车或四处走动，我也会默认使用播客和有声读物。但音乐是我的全部，所以我听的就是音乐。有时我会戴上耳机，但在深夜的时候那有点诡异，…。我已经觉得很脆弱了，独自一人盲目地坐在公寓里…。孤独、失明和功能性失聪不知何故感觉更糟。\n一个额外的烦恼是，除了盲目地按下我认为暂停键可能在的空格键之外，我没有办法停止手机的音频。找到合适的地点可能需要两秒钟，也可能需要一分钟。这完全取决于显示因素，而鉴于我的失明，我对这些因素既不能控制，也不知道。\n当我每隔一段时间对音乐感到厌倦时，我就求助于问Siri问题。如果你问她任何太复杂的问题，她只会给你调出一个网页浏览器，而我看不到屏幕，所以这是没有用的。但至少她可以告诉我一些简单的事情，所以我最终了解了欧洲城市的人口规模和名人的净资产。乔·拜登比我想象的要穷得多。\n我最终考虑喝醉了，但我决定不这么做。酒精会严重扭曲原始的实验体验。\n鸟盒。这是一个显而易见的问题，但即使超越了表面层面的比较，我也真心觉得我现在对Bird Box有了更好的了解。一直戴着眼罩真的很让人气馁。你感到脆弱和无助，就像世界上的其他人从你身边走过一样。\n阿斯特拉广告公司。尤其是布拉德·皮特独自在宇宙飞船上坐了几个月，慢慢失去理智的蒙太奇镜头。在这里尽量避免剧透。\n失明。或者更确切地说，我对整部电影没有准确地将所有新盲人刻画成令人难以置信的懒惰和昏昏欲睡感到恼火。\n贫民窟的百万富翁。我想做这个实验的部分原因是为了直面我一直以来对失明的一种小小的恐惧。永久丧失看世界的能力的想法绝对是可怕的。我可能更喜欢死。\n对我来说，最能体现这种恐惧的是《贫民窟的百万富翁》中的一个场景：那个家伙把那个小乞丐打倒，用某种热液体灼伤了他的眼睛，这样他醒来后就会变成一个收入更高的乞丐，从此双目失明。在整个实验过程中，我对那一幕的思考比我想象的要多。\n“你认为黑暗是你的盟友…。但你只是接受了黑暗；我在黑暗中沉浸在其中，被它塑造。直到周四下午2点28分我才看到曙光。那时对我来说，这只是一件令人眼花缭乱的事情！“。\n我失明、孤独、困惑了24小时。除了我睡着的时间(我不能确定)，我一般经历了三个阶段的存在。\n昏迷阶段包括慢慢地进入和离开意识，并进入准梦境状态。\n如上所述，尽管我睡得很好，感觉很好，但戴上眼罩后，我变得昏昏欲睡，几乎立刻就很难保持清醒。当我累得什么都做不了的时候，我会爬上床或者靠在我舒适的电脑椅上，甚至放一些轻音乐来接受发呆阶段。然后我的大脑就会在不同的主题之间流动，不会真正抓住某件事，但也不会感到无聊。有一种愉悦的感觉，那就是…。一种不需要动脑筋的轻松。这是在不知不觉中消磨几分钟或几个小时的好方法。\n这让我想起了很多年轻的时候，在长途汽车旅行中，我会躺在后座上，试着戴着耳机，播放CD睡觉。车辆的移动和座椅的不适会让我睡不着，但普遍的疲惫和无事可做会把我推向睡眠。我的大脑会在半有意识的想法和梦境之间漂移，让我处于意识和睡眠的边缘。\n迷迷期是这种感觉的一种强化。这有点难以解释，但是…\n想想早上醒来的情景。你睡着了，…。但不是全部。你在做梦，但你能感觉到即将醒来。当你恢复意识时，你不受控制的、飘忽不定的梦境和想象会变得更弱、更零星。通常情况下，睁开眼睛看看世界，哪怕只有一小会儿，也足以让你最终睡不着觉，让你完全清醒(尽管仍然很累)。\n被蒙住眼睛会扰乱这一过程。因为当你睁开眼睛时，你几乎没有得到任何视觉输入来与梦幻般的可视化相冲突。\n结果，有时候我很难分辨什么时候在做梦，什么时候醒着。在意识和睡眠之间的朦胧空间里，我并不总是确定是我有意识地产生了一个想法，还是我潜意识的梦境为我想象了它。\n这个过程的一个奇怪的副作用是，有时我的脑海中的视觉感觉比我的物理视野更明亮。同样，这很难解释，但是…。正常情况下，戴上眼罩，我只能看到黑暗。然后，我会沉浸在思考中，在头脑中想象一些东西，无论是有意识的还是通过半睡梦的方式。最终，我会回到全意识思维状态，看到我的黑色视野。我的心理视觉和黑色视野之间的对比使前者感觉比后者更明亮，尽管两者都没有真正的亮度。\n我估计迷茫阶段大约占了实验的三分之一，而且实际上相当有趣。“。我不可能在这里充分描述它，但它似乎是你在进入或离开睡眠时有时会得到的愉悦意识漂移的一种版本，这种漂移会因视觉刺激的抑制而增强。\n有很好的证据表明，如果一个人损坏或破坏了一种感官，其他感官就会变得更强，以弥补这一点。我不确定我的视力是否抑制了足够长的时间来达到这个效果，我也不确定这是否只是一种安慰剂效应，但我主观上比平时更喜欢在失明的情况下听音乐。\n对我来说，不仅比平时更容易进入听音乐的心流状态，而且我也进入了更深层次的心流状态。这是一种轻松的流畅状态，我不在乎下一首歌是什么，只要它是好的。尽管没有视觉输入，但有几个小时，我只是坐在黑暗中听音乐，体验着高度的享受。\n在另一项实验中，我买了一些尼古丁含片。我不吸烟，也没有兴趣吸烟，但我正在调查尼古丁是否是一种被低估的嗜好。该死的是，我弹出了一个糖块，放在我的Spotify“最佳歌曲”播放列表上，然后让它继续运行。\n这是我在很长一段时间里经历过的最愉快的1-2个小时之一。我很狂热，头脑发热，我在专注地思考叙事、历史和其他我喜欢的话题，音乐放大了我脑海中的一切。我静静地坐在一片漆黑中，戴着眼罩，戴着空气舱，但我的大脑却在以每小时一百万英里的速度前进。尼古丁的刺激效果+我最喜欢的音乐+黑暗和感官剥夺=一种极度专注和愉悦的流动状态。虽然我没有太多经验，但感觉就像服用了一种强效兴奋剂。\n不，这并不全是尼古丁造成的。在前几个晚上，我吃了一些含片，我觉得它们很享受，但和那次体验相去甚远。\n我不建议大多数人做“盲目、孤独、困惑24小时的实验”，除非你对身体和精神上的剥夺非常好奇，但我建议不吸烟的人纯粹为了快乐而尝试“黑暗中的尼古丁+音乐”体验。我想从现在起一周后我会再试一次，看看我是否能捕捉到这种经历，而不是之前失明的80多个小时。\n24小时的盲目、孤独和困惑并不全是梦境的涌动和强烈的音乐狂潮。大约一半的时间是真的，真的很无聊。\n通常情况下，萎靡期是在我从迷迷期醒来之后，但在我进入狂欢期之前。我会厌倦音乐或者问Siri问题。我会又懒又累，起不来喝水或喝健怡可乐。我想知道这个愚蠢的实验还剩下多少时间，我很难不去问Siri。我会坐在黑暗中，催促时间加快脚步。\n这是W。\n.", "note_en": "For 24 hours I will be blind and alone in my apartment. I eventually want to try being blind for a week, but I’ll need seven days with no other obligations, and I won’t have that for a while. For now, I’ll suffice with a smaller-scale experiments with a few extra provisions for added difficulty.\n  I must leave my blindfold on for 24 hours. If the blindfold falls off or I can get partial sight, I have failed the experiment.\n  I will set an alarm for 24 hours. I cannot set any other alarms or use any other means to ascertain the time. It is up to me to keep my phone charged so the alarm goes off.\n    I have no good reason. I just want to see if I am capable of doing it and what will happen. Some things I’m curious about:\n Will I be able to stave off boredom with podcasts, audiobooks, and music on my phone?\n Will I enter some sort of meditative state due to a lack of sensory input?\n     Will I eat? Is consuming caffeine a good idea (for entertainment) or a bad idea (energy with no direction)?\n Will this experience make me more interested in being blind for a week? Or less?\n   Attempt One started at 10:30 AM and failed at 1:13 PM. I purposefully took off my blindfold because I was worried that my multiple failures to input my Iphone’s password had resulted in a permanent lock or data wipe. But the password screen was just locked for a minute and all was well.\n Given that I failed in the early afternoon, I considered restarting the experiment on another day in the morning. But I had already carved out a 24 hour period when I wouldn’t do any work or be disturbed, and it might have been a week or two longer before I got that opportunity again.\n    Attempt Two was successful. I put on my blindfold at 1:23 PM on Thursday, November 5, 2020. I removed it at 1:28 PM on Friday, November 6.\n It was an… interesting experience. I don’t recommend it, but I’m glad I did it. I’m not sure where to begin in describing it, especially since I couldn’t take notes, and part of the challenge was being confused. But I’ll do my best to break down the experience.\n   To simulate blindness, I used a dark blue scarf as a blindfold. One layer wasn’t quite dark enough, so I folded it in half for extra light defense.\n With the blindfold securely on, my vision was the same whether my eyes were open or closed. I kept my eyes closed 99.9% of the time since it was usually more comfortable and helped limit light. I occasionally opened my eyes to check the brightness level and to… I guess you could call it  stretch my eyelids. They don’t feel good if you leave them closed for too long.\n I couldn’t get a perfect scarf seal around my eyes, so sometimes when I tilted my head back while sitting I noticed a little light come into the bottom of my vision. To limit this, I often pinched the scarf around my nose in that position. But many/most blind people can see some light anyway, so I don’t think this was a significant violation of the experiment.\n My eyes got quite dry under the scarf, so I applied moisturizer to this lids and sockets four or five times. I wanted to use eyedrops too, but there was no way to do so without failing the experiment.\n   Initially, everything was black, but as the day went on and the sun went down, I could tell it was nighttime even through two layers of scarf and my eyelids. I’m not sure if I could tell because my eyes had adjusted to become extremely sensitive to light, or if there were other subtle signals (ie. noises, air temperature, circadian rhythms, etc.) which my body picked up on. As evidence of the latter, I could not see any difference between the tv being on or off, nor the refrigerator being opened or closed, even when I was sitting right in front of either.\n What I saw depended on how I applied my focus. If I did focus on my vision, I’d see the typical blackness you get from closing your eyes, but it was never perfectly black nor uniform; there was always some odd movement and occasional coloring (whiteness, pale blue, or sometimes red). The most common distortions were a swirling or flowing whiteness, sort of like cream in coffee. I hoped that being blindfolded for so long would make the distortions more extreme, but for the most part it looked no different than what you’d see if you closed your eyes right now for ten minutes.\n There was one exception. It must have been about 20+ hours into the experiment, and my eyes were itching, so I rubbed both of them at the same time over the scarf. If you rub your closed eyes and focus on your sight any time you can see some weird stuff, but this was far more extreme than usual. I remember my entire vision filling up with white bubbles which then broke and briefly returned to black. Then white lightning bolt shapes stretched across my sight, expanded to make my vision purely white, and then slowly faded back to black. The strangest thing about it was the  brightness. I literally felt like I was staring into lights despite being blindfolded in a dark room. Unfortunately, it only lasted about 30 seconds, but my heart was racing.\n More notable than what I saw was what I didn’t see. By default, I was lost in thought and I focused on nothing. In such a state, I didn’t even register my vision or notice the darkness. I  think this made my imagination and mental visualization more acute. On occasion, I’d be deep in thought and I’d get the  brightness sensation again because I’d be mentally picturing something so vividly that the inevitable return to darkness felt like shutting off the lights in my brain. I’ll explain more about this in the  Three Phases section.\n Sadly, I did not hallucinate, or at least not as far as I could tell.\n    I read that  blind people have trouble getting to sleep because they don’t access any/enough light for their circadian rhythms. I seem to have the exact opposite problem. Without light, my body always thinks it’s time to sleep and has trouble doing anything else. Throughout most of the experiment, I felt extremely lethargic, lazy, and had to fight to stay awake.\n I started my first failed experiment attempt at 10:30 AM. I had gotten 7.5 solid hours of sleep, I hadn’t done anything tiring the previous day, and I generally felt fine. Then I put on my blindfold, and within thirty minutes I was nodding off. I semi-slept for two hours before deciding to get an energy drink to get myself out of the funk. That worked, but as soon as it wore off, I was back in semi-sleep mode.\n Even when I was firmly awake, I generally felt weak and lethargic. Movement around the apartment was annoying of course, but made so much more difficult by my energy levels. I ended up lying perfectly still in my comfy computer chair with my feet on a table 95% of the time. That is, when I wasn’t lying in bed.\n On the other hand, when I removed my blindfold after 24 hours, I experienced a  burst of energy. Seriously, it was like I had downed a double shot of espresso. It was like a switch had been flicked. The haziness and cobwebs were gone in an instant, and I felt the energy coursing through my body. I guess light has a big impact on me.\n    For the most part, I slowly walked around my apartment with a hand out to feel for walls and edges. Sometimes I’d get lazy and crawl just so it was easier. I know my apartment well enough that it wasn’t hard to get around, but every once in awhile I’d lose track of where I was and would be left slowly swinging my arm around searching for anything. It’s not a pleasant sensation.\n Before the experiment, I had planned to pace around for fun, or maybe even do some exercise with the free time. But the confusion and especially the lethargy stopped all that. I just sat in my chair and didn’t move unless I needed to get a drink, go to the bathroom, or sleep.\n I kind of wish I had done the experiment in an unfamiliar environment to add to the movement challenge, but oh well.\n   For food, I ate a big lunch at 10 AM before the experiment and then munched on dark chocolate throughout the night. I felt the heavy lethargy well before the lack of calories was an issue. I probably should have put some prepackaged meals in my fridge to eat, but I was worried about making a mess and not being able to clean up. Do I want ants? Because that’s how I get ants.\n For drinks, I could manage to get to the kitchen and fill a cup with water when I needed to. I never took a full cup back to my chair just in case I knocked it over (clean up would be a nightmare). I also had some diet coke to serve as entertainment and put a little caffeine in me.\n For the bathroom, I (a man) peed sitting down. I’m not ashamed to admit it.\n   As part of the experiment, I never knew what time it was. This was intended to confuse me throughout the 24 hours, and it did, but it may have helped too. With no sense of time, it was easy to sit back and not think about it. Time drifted by and I existed. That was that.\n I actually did ask Siri for the time once… it was late in the experiment, and it felt like I had put on the blindfold forever ago. As you’d expect, time feels like it moves slowly when you’re blind and have little to do. I kept waiting for my alarm to go off on my phone… but it never did.\n Finally, I gave up and was willing to fail a part of my challenge by asking Siri what time it was. She told me it was 1:28 PM. The alarm was already supposed to have gone off.\n I figured out later that I had accidentally snoozed the alarm the instant it had gone off while blindly hitting my phone to pause a song. Thus, my failure of will occurred outside the boundaries of the experiment, and I do not consider it a disqualifying action.\n    Likewise, as far as I could tell, my other senses were not enhanced in any noticeable way, but… I did  appreciate my other senses more, and that seemed to enhance at least my enjoyment of them. I swear the dark chocolate and those diet cokes tasted better than ever. And as I’ll explain in  Three Phases, music was sometimes especially pleasurable.\n   As part of the rules of the experiment, I could not interact with any other people, either in person or digitally. So I ended up skirting close to two other experiments I want to do eventually:\n  Siri became both my best friend and worst enemy. Initially I wanted to ban Siri to make it more challenging for me, but I figured that would be too close to the “sit in a room and do nothing challenge.” Fortunately/unfortunately, dealing with Siri was enough of a challenge on its own.\n First, I wanted to listen to audiobooks. I finished the last hour of  Caesar: Life of a Colossus, and then got ready to start the next book on my Audible list, but… Siri couldn’t get me to it. I tried a dozen different voice commands. Didn’t work.\n So I moved on to podcasts. I told Siri to play my podcast app, and it booted up  a mercifully long Joe Rogan Experience episode. Then I told her to play “Sam Harris,” and that didn’t work. I told her to play “Making Sense podcast,” and that didn’t work. I tried more Joe Rogan, and that didn’t work. I switched over to Spotify, but I could only get the same Joe Rogan episode going.\n Fucking Siri. Or fucking me for being too stupid to use Siri properly. No… fuck her. If I can’t figure out how to get Siri to play an old podcast while I’m sitting in the dark with a blindfold on with literally nothing else to do for 24 hours, it’s Siri’s fault, not mine.\n I resorted to music most of the time. But I’m not a music person. I never listen to music unless I’m doing something else that takes up the vast majority of my attention, like writing or playing video games. Even when I’m driving or walking around, I default to podcasts and audiobooks. But music was all I had so that’s what I listened to. Sometimes I used headphones, but that was a bit eerie late at night… I already felt pretty vulnerable sitting alone and blind in an apartment… alone, blind, and functionally deaf somehow felt even worse.\n A bonus annoyance was that there was no way for me to stop my phone’s audio except to blindly press spaces where I thought the pause button might be. Finding the right spot might take two seconds, or it might take a minute. That entirely depended upon display factors over which I had no control nor knowledge given my blindness.\n When I periodically got bored of music, I resorted to asking Siri questions. If you ask her anything too complex, she just brings up a web browser for you, and I couldn’t see the screen, so that was useless. But at least she could tell me simple stuff, so I ended up learning a lot about the population sizes of European cities and the net worths of celebrities. Joe Biden is a lot poorer than I thought.\n I eventually considered getting drunk, but I decided against it. The alcohol would distort the raw experimental experience too much.\n   Bird Box. An obvious one, but even beyond the surface-level comparison, I genuinely feel like I  understand  Bird Box better now. It is truly  unnerving to wear a blindfold all the time. You feel vulnerable, helpless, like the rest of the world passes you by.\n Ad Astra. Specifically the montage when Brad Pitt sits in a spaceship for months all alone and slowly loses his mind. Trying to avoid spoilers here.\n Blindness. Or rather, I’m pissed off at the entire movie for not accurately portraying all the newly blind people as incredibly lazy and sleepy all the time.\n Slumdog Millionaire. Part of the reason I wanted to do this experiment was to confront a minor fear I’ve always had of going blind. The idea of permanently losing my ability to see the world is absolutely horrifying. I would probably prefer death.\n What best exemplifies this fear to me is the scene in  Slumdog Millionaire when the guy knocks out the little beggar kid and burns his eyes with some sort of hot liquid so he will wake up blind for the rest of his life as a higher-earning beggar. I thought about that scene more than I would have liked to throughout the experiment.\n  “You think darkness is your ally… But you merely adopted the dark; I was boooooorn in it, molded by it. I didn’t see the light until 2:28 PM on Thursday. By then it was nothing to me but BLINDING!”\n   I was blind, alone, and confused for 24 hours. Aside from the time I was asleep (which I can’t determine), I generally cycled through three phases of being.\n   The Daze Phase consisted of slowly drifting in and out of consciousness and entering a quasi-dream state.\n As mentioned, despite getting plenty of sleep and feeling fine, I became lethargic and had trouble staying awake almost immediately after putting on the blindfold. When I got too tired to do anything else, I would accept the Daze Phase by crawling into bed or leaning back in my comfy computer chair, or even putting on some light music. Then my mind would flow between topics, never really latching on to something, but never being bored either. There’s a pleasantness to the feeling… a mindless ease. It’s a good way to kill minutes or hours without noticing.\n It reminded me a lot of when I was young and would lay down in the back seat during long car rides and try to sleep with my headphones on and CD playing. The movement of the vehicle and discomfort of the seat would keep me awake, but general tiredness and having nothing else to do would push me toward sleep. My mind would drift between semi-conscious thoughts and dreams, leaving me right on the edge of consciousness and sleep.\n The Daze Phase is an intensification of this feeling. This is a bit hard to explain, but…\n Think about waking up in the morning. You’re asleep… but not entirely. You’re dreaming, but you can feel wakefulness coming. Your uncontrolled, wandering dream thoughts and visualizations become weaker and more sporadic as you regain consciousness. Typically, opening your eyes and seeing the world, even just for a moment, is enough to finally knock you out of sleep and make you fully conscious (albeit still tired).\n Being blindfolded messes with that process. Because when you open your eyes, you get almost no visual input to clash against the dreamy visualizations.\n As a result,  sometimes it was hard for me to tell when I was dreaming and when I was awake. In that hazy space between consciousness and sleep, I wasn’t always sure whether I had consciously produced a thought, or if my unconscious dreaming mind had visualized it for me.\n A weird side effect of this process was that sometimes my mental visualization felt  brighter than my physical visual field. Again, this is very hard to explain, but… normally with the blindfold on, I would see nothing but darkness. Then I would get lost in thought and mentally visualize something, either consciously or via semi-sleep dreaming. Eventually, I would come back to full conscious thought and see my black visual field. The contrast between my mental visualization and the black visual field made the former  feel brighter than the latter, even though neither had any real brightness.\n I would estimate that the Daze Phases took up about 1/3 rd of the experiment, and were actually pretty enjoyable. It’s impossible for me to adequately describe it here, but it seems to be a version of that pleasant consciousness drift you sometimes get while moving in or out of sleep which is enhanced by the suppression of visual stimuli.\n   There’s good evidence that if an individual damages or destroys one sense, other senses become stronger to compensate for it. I’m not sure if I suppressed my vision for long enough to achieve this, and I’m not sure if this is just a placebo effect, but I subjectively enjoyed listening to music while blind more than usual.\n It was not only far easier for me to get into a music-listening flow state than usual, but I also got into a  deeper flow state. And it was kind of a  relaxed flow state where I didn’t care what the next song was as long as it was good. Despite having no visual input, there were hours where I was experiencing a high level of enjoyment just sitting in darkness and listening to music.\n  For a separate experiment, I bought some nicotine lozenges. I don’t smoke and have no interest in doing so, but I’m investigating whether nicotine is an under-appreciated nootropic. For the hell of it, I popped a lozenge, put on my Spotify “best songs” playlist, and let it ride.\n That was one of the most enjoyable 1-2 hours I’ve experienced in a long time. I was manic, I had a head rush, I was thinking intently about narratives and history and other topics I love, and the music was amplifying everything in my mind. I was sitting still in complete darkness with a blindfold on and air pods in, but my mind was going a million miles per hour. The stimulating effects of the nicotine + my favorite music + the darkness and sensory deprivation = a flow state of extreme focus and pleasure. Not that I have much experience, but it felt comparable to being on a hard stimulant.\n And no, it wasn’t all due to the nicotine. I had a few lozenges over the previous nights, and I found them enjoyable, but nothing close to that experience.\n I don’t recommend that most people do the “blind, alone, and confused for 24 hours experiment” unless you’re super curious about physical and mental deprivation,  but I do recommend that non-smokers try the “nicotine + music in the dark” experience purely for the sake of pleasure. I think I will try it again a week from now to see if I can capture the experience without the 8ish hours of prior blindness.\n   Being blind, alone, and confused for 24 hours isn’t all dream flows and intense musical head rushes. About half the time was really, really boring.\n Usually the Malaise Phase would come after waking up from the Daze Phase, but before my mind would settle into the Rave Phase. I’d be bored of music or of asking Siri questions. I’d be too lazy and tired to get up and get water or a diet coke. I’d wonder how much time was left in this stupid experiment, and struggle not to ask Siri. I’d sit in the dark and urge time to move faster.\n This was w\n......", "posttime": "2020-11-09 14:43:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小时,experiment", "title": "我要做24小时失明和孤独的实验", "title_en": "I'm going to experiment by being Blind and Alone for 24 Hours", "transed": 1, "url": "https://dormin.org/2020/11/08/the-blind-alone-and-confused-for-24-hours-challenge/", "via": "", "real_tags": ["小时"]}, {"category": "", "categoryclass": "", "imagename": "df8aad83172df2b76547b5f92d4b34d2.jpg", "infoid": 1033989, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新法案带来了积极的影响安全义务，网络安全要求，例如强制性事件报告和漏洞测试，以及政府的援助。..。\n它担心的是潜在的越界可能如果政府能够提供帮助对实体的回应严重的网络攻击在澳大利亚..。\n该组织正在努力恢复其系统环境；主席贾尔·博尔索纳罗(Jair Bolsonaro)表示，作者的身份已经确定。\n这标志着一种主要的Windows勒索软件首次被移植到Linux上，以帮助黑客进行有针对性的入侵。\n研究人员分析了&#39；北极星行动(Operation North Star&#39)；并发现由于以及使用新的技术，它挑挑拣拣关注受感染目标最有价值的。..。\n如果你", "note_en": "New\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tintroduces\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpositive\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tobligation,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcybersecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trequirements\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsuch\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmandatory\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tincident\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treporting\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvulnerability\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttesting,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgovernment\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tassistance.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  It\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tworried\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tabout\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpotential\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toverstepping\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcould\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toccur\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tif\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgovernment\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\table\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprovide\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tassistance\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tentities\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tresponse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsignificant\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcyber\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tattacks\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAustralian\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  The organization is working to recover its systems environment; president Jair Bolsonaro said the authors have been identified.\n  This marks the first time a major Windows ransomware strain has been ported to Linux to aid hackers in their targeted intrusions.\n  Researchers\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thave\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tanalysed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&#39;Operation\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNorth\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tStar&#39;\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfound\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twell\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tusing\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttechniques,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpicks\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tchooses\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinfected\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttargets\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfocus\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmost\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvaluable.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  If\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twant\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tspark\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\timagination\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tkids\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhile\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsame\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttime\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgiving\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthem\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tleg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tup\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twith\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsome\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttech\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tskills\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthey&#39;ll\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tneed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tadults,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcan&#39;t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twrong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlooking\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tproducts\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Security firm Check Point reports what appears to be a targeted attack against Israeli companies.", "posttime": "2020-11-09 14:42:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,邮箱,mail,帮助", "title": "雅虎邮箱停止向免费用户自动转发电子邮件", "title_en": "Yahoo Mail discontinues automatic email forwarding for free users", "transed": 1, "url": "https://www.zdnet.com/article/yahoo-mail-discontinues-automatic-email-forwarding-for-free-users/", "via": "", "real_tags": ["免费", "邮箱", "mail", "帮助"]}, {"category": "", "categoryclass": "", "imagename": "fc790a5976024d038eda033859538afe.png", "infoid": 1033988, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我从2006年就加入了创业社区(当时MySpace还只是一件事)，我经常看到的一个问题是：“我怎么才能获得新用户？”我在哪里发帖？我应该使用哪些获取渠道来获得新用户？“。\n不幸的是，大多数答案要么是基于一次经历，要么是有人在没有证据表明你为什么应该信任他们的情况下提供建议。\n2016年对创业者来说是相当令人惊叹的一年。在这一年，独立黑客发起了开放创业计划(Open Startup Initiative)。创始人突然开始对他们的初创公司更加透明；他们分享收入数字、为他们工作的收购渠道、宝贵的经验教训等等。\n幸运的是，这一趋势仍然存在。独立黑客现在有470多次对创始人的采访，还有一大批相关网站和博客帖子，创始人们在这些网站上分享各种数据。\n回到我的观点。当我看到发生了什么(有如此多的采访和数据点)时，我认为这是一个完美的机会，最终可以可靠地回答如何获得用户的问题。所以我开始了我的研究。\n我花了将近两年的时间(作为副业)阅读了所有479个关于独立黑客的访谈(每个访谈都相当长，从1500到5000字不等)。平均而言，我花了30分钟来阅读/分析/归类每个采访，所以总共花了240个小时。\n我想回答的问题是：哪些收购渠道持续不断地对创始人起作用？这些创始人是如何从零变成用户的？\n这篇文章将涵盖这些获取渠道中的前15个(我总共找到了50多个渠道，如果这个渠道获得了吸引力，我计划做更多的帖子，如果你想在我发布它们时得到通知，请随时订阅我的Zero to User时事通讯)。\n这些渠道是按照“成功提及”的次数来排序的(意思是，创始人在采访中提到某一特定的收购渠道正在为他们工作)。现在，有些创始人只用一句话来谈论这个渠道，有些则详细地描述它(你可以在下面看到后者的语录)。\n搜索引擎优化(仅在通过另一个采集渠道获得结果之后。我在下面解释为什么这很重要)。提及次数：83次。\n当我阅读创始人采访时，我注意到有两类人提到SEO是为他们工作的收购渠道：\nA)那些立即开始搜索引擎优化的人(在其他分销渠道上没有取得太大成功)。\nB)那些首先在其他收购渠道取得成功，然后专注于搜索引擎优化的公司。这些创始人中的许多人已经注意到，搜索流量让他们获得了越来越多的用户(通常是因为另一种收购策略奏效，比如媒体提到的)，所以他们决定加倍押注于SEO。\n这里我将谈论b)下的第二组。Snipcart(33K美元/月)是一个工具，可以让你在任何网站上添加一个运货车。以下是他们在接受《独立黑客》(IndieHacker)采访时所说的话：\n随着时间的推移，我们意识到我们摇摇欲坠的、善意的博客正在推动越来越多的有机流量，甚至是一些直接的转换。尤其是我们针对特定平台的电子商务教程。所以我们决定真正拥有这个频道。(来源)。\n当我读到更多的采访时，我注意到越来越多的创始人说同样的话；他们发现搜索流量为他们带来了越来越多的客户，并在频道上加倍下注。以Creative Tim(17K美元/月) - 为例，购买一套用户界面/用户体验套件：\n我们已经看到，我们也从搜索引擎优化中获得了一些收入，约占收入的22%。所以我们决定投资于搜索引擎优化，我们聘请了一个搜索引擎优化顾问，我们每月支付500美元来提升我们的产品在谷歌的排名。(来源)。\n关于营收数据：你会注意到，在每家公司(比如上面的Snipcard&amp；Creative Tim)旁边，我都有每月的营收数据(比如3.3万美元/月)。我是从采访文本本身获得这些数据的(您可以通过单击引文末尾的“(SOURCE)”链接查看)。\n除非你看一下你的分析数据，否则很容易忽视搜索流量的力量。Instapainting(3.2万美元/月)是一项服务，可以让你把上传的照片变成真正的手绘艺术品(由真正的人类艺术家完成)，他们就是一个例子：\n帮助你取得成功最关键的因素是什么？对我来说，搜索引擎优化。我认为我花了大约5-6个月的时间才意识到，这项业务主要是靠SEO流量维持的。\n如今，Instapainting每年的收入约为40万美元。这一数字高于第一年，第一年的营收仅为89万至9万美元左右。增长的主要驱动力是内容营销带来的搜索引擎优化。(来源)。\n在某些情况下，立即开始使用SEO是有意义的(参见12号，我将详细介绍这一点)。然而，在大多数情况下，获取搜索流量需要很长时间，而且可能会导致你过早放弃。\n这就是Convertify(5000美元/月)的情况，这是一项将网站转换为移动应用的服务。起初，他们使用ProductHunt，在那里推出后获得了43笔销售。以下是后来发生的事情：\n在最初的Product Hunt发布后，我们并没有获得更多的吸引力。因此，我们决定集中精力，通过撰写高质量的、提升SEO的文章来增加有机流量。我们主要写的是如何使用Convertify解决具体问题，使用关键字如“转换网站为Android应用程序”和“转换网站为iOS应用程序”。\n2018年12月，游客数量迅速下降到1000人，2019年1月和2月达到200人的最低点。我们几乎放弃了这个项目。但搜索引擎优化需要一段时间才能生效，我们在3月份开始注意到访问量有所上升，访问量从4月份的1200人增加到400人。\n在早期专注于搜索引擎优化可以真正为你的企业未来的成功奠定基础。搜索引擎优化在我的每一项业务中都占据了很大的一部分。(来源)。\n如果你仔细想想，这是有道理的。获得稳定的搜索流量需要花费大量时间；另外，您不知道这些努力是否会得到回报(这些关键字会转换吗？)。此外，首先关注其他获取渠道(如媒体、社区推广)会让你间接获得较高排名(越来越多的人与你交谈并与你建立联系)。\n目前，我的建议是：如果你想(最终)获得搜索流量，首先要专注于间接为你带来搜索流量的获取渠道。\n我们都听说过Google Play Store或Apple App Store。拥有数十亿用户的大型平台，其中相当大一部分人使用为这些应用商店开发的应用。如果你曾经开发过移动应用程序，你就会知道这些应用程序商店将是你获得新用户的主要渠道之一。\n事情是这样的：几乎每个主要平台都有自己的“应用商店”。Shopify、Slack、QuickBooks、Chrome(浏览器)和Wordpress。它们是吸引新观众的一种很好的方式。为什么？因为该平台的大部分用户都安装了这些扩展。例如，87%的Shopify用户至少从应用商店安装了一款应用。\n与这些应用商店“集成”的方式是为它们创建一个扩展/应用/插件。我真的很惊讶有这么多的创始人发现这些平台在吸引新用户方面取得了成功。Tettra(24K美元/月)是团队记录流程和项目的沟通工具。他们首先创建了一款Slack机器人，并将自己列在了Slack应用目录中：\n另一个巨大的试验来源是Slack App Directory。根据我们的经验，我强烈建议在Slack、WordPress或Shopify这样的平台上发布。从本质上讲，你可以将一整套功能“外包”给该平台。对我们来说，这就是身份验证、用户管理和对“工作图”的访问。你还可以从母平台获得免费分发，并获得一个你可以吸引的明确目标角色。\n其他一些公司认识到了构建平台扩展的潜力，并将其提升到了一个全新的水平。以Widgetic(3.3K/月) - 为例，这是一组可以嵌入到任何网站(音频/视频播放器、图像滑块等)上的交互式小工具。\n为了与网站建设者合作，我们检查那些有App Store的网站，然后我们直接集成。大多数网站建造商的用户都不到100万，而且没有市场，因此我们直接联系他们的业务开发人员，探索整合是否有意义。一旦他们看到了价值，我们解决了技术问题，他们通常会追加销售他们的计划，他们的付费用户就可以使用我们的应用程序了。 - 这是一个双赢的局面。(来源)。\n在像WordPress或Chrome这样的平台上，你确实需要知道一种特定的编程语言(PHP和JavaScript)。但对于许多其他平台(比如Shopify)，你可以使用你现有的语言，只需与他们的API集成即可。\nProduct Hunt是(目前)世界上最大的发现新产品的网站。如果你正在寻找早期采用者，这对你来说可能是一个很棒的地方。\n“产品猎头”(Product Hunt)是这些“关键”渠道中的一种，它们对验证很有帮助，但对持续的流量不是很好。以EpicPxls(400多美元/月)为例，这是一个销售设计(用户界面工具包、模板等)的网站。以下是他们在2019年接受IndieHacker采访时所说的话：\n对我们来说，吸引用户的最好方式是在Product Hunt上推广我们的网站和产品。我们于2016年3月6日上线，最终以650次上线和5799名新用户位居第二，但在那之后不久，我们的流量就回落到了正常水平。(来源)。\n一些公司通过多次发布来解决这个问题。以Standuply(2.5万美元/月)为例，它是一款用于团队单口相声会议的Slack机器人：\n在最近的18个月里，我们在Product Hunt上8次推出了Standuply和相关的Slack BOT产品。起初，是我们最初推出的产品带来了第一批用户。这并不是很成功，因为我们最终排在了第7位。然而，它给我们带来了150支队伍。\n我们最好的产品是我们最新推出的：Standuply3.0。它成为当天排名第一的产品和本周排名第四的产品。因此，我们在每日和每周的产品搜索电子邮件列表上都收到了这封邮件。看看它是如何影响我们的注册的：(来源)。\n目前，Reddit上有544343+Subreddits。其中可能有几个与你的利基市场相关。\n从较小的次级红利开始，一路攀升到顶端可能是一个很好的策略。它适用于WriteMapper(1000美元/月)。这是一款面向作家的思维导图桌面应用：\n我在Reddit的/r/macapp上发布了WriteMapper，确保分享我认为有趣的细节，并回复每一条评论。作为一个小的子编辑网站，1)一开始不会有很多帖子，2)通常不会努力提供背景故事或原始发帖人的积极评论，我能够让我的帖子在子编辑网站的首页停留很长一段时间。(2)通常情况下，我不会努力提供背景故事或原始发帖人的积极评论，所以我能够让我的帖子在子Reddit的首页停留很长一段时间。(来源)。\n然后，他们在媒体上做了一些宣传，登上了《福布斯》(Forbes)和《苹果崇拜》(Cult Of Mac)。在这次成功之后，WriteMapper决定(再次)在Reddit上碰碰运气：\n然后我决定做得更大一点，发布到/r/apple上，它有超过60万的订户(相比之下，/r/macapps的订户只有19万)。除了确保遵守subreddit的规则，我还利用WriteMapper在/r/macapp和对Mac的崇拜上的积极反响作为社交验证，证明该产品也会引起这个社区的兴趣。这篇帖子大受欢迎，最终获得了13万人的支持，并吸引了近9000人访问WriteMapper的网站。\n累积起来，这些努力仅在WriteMapper发布后的头两周就吸引了近16K访问者，以及大约21000的页面浏览量，然后转化为实际销售额。\n在Reddit上推广你的产品最明显的方式就是把它贴出来，描述一下它是怎么回事。一种更微妙(在我看来，也更有效)的方式是把你的应用程序/服务/时事通讯的结果发布出来。这就是卡牌远征(500美元/月)，一款构建纸牌的游戏所做的事情：\n除了朋友和家人，我们最初吸引用户的主要方式是通过Reddit；我们会发布一篇关于我们游戏中很酷的东西的帖子，然后单独给每个留言的人发消息，询问他们是否愿意成为测试者。(来源)。\n如果你是一份时事通讯，也许可以展示一下你的最新一期。如果你正在做一个SaaS，展示一些很酷的东西，可以用它来完成(你按下这个，X秒内就会得到这个)。发挥创意。\n这是我们都曾尝试过的事情。对于那些生活在坚如磐石之下的人来说，冷淡的电子邮件推广基本上就是把你从未接触过的电子邮件列表，然后给他们发送一些最终会让他们购买你的产品和服务的东西。\n当潜在客户的信息在网上很容易获得时，这会有很大帮助。以Web4Realty(10万美元/月)为例，这是一款轻松创建房地产网站的工具：\n我们非常幸运地身处这样一个行业，在这个行业中，收集线索信息非常容易。对我们来说幸运的是，房地产中介把他们的电子邮件和电话号码贴得到处都是，非常方便。\n在最初的几个月里，拉扎和我一直在给线索打电话，不断收集更多的电子邮件地址和号码，并逐一发送个人营销电子邮件。有时客户想在现实生活中演示一下，所以我们就去做了。\n我们以这种方式运营了5-6个月，并努力争取到了大约200-300名付费用户。(来源)。\n我们都知道现在的人们不想被打扰。嗯，除非发生了很大的变化，他们受到了直接的影响。\nShareKit.io(1.6K美元/月)是一个定制Facebook链接预览的工具。他们是在Facebook宣布将禁用定制链接预览功能(很多人都在使用)之后推出的。很多人都很沮丧。ShareKit使用冷淡的电子邮件联系他们：\n您是如何吸引用户并发展ShareKit.io的？我们还给营销人员发了冷信，他们对Facebook在Twitter和Facebook上的举动表示失望。(来源)。\n你的观众中有没有因为没有你的产品而特别沮丧的？他们可能是冷淡电子邮件的一个很好的目标。\n世界上最大的技术/开发社区之一。很多接受采访的创始人都在黑客新闻(HackerNews)上找到了成功的帖子。\nMangools(686)(220K/mo)是一套搜索引擎优化工具(如关键词搜索、反向链接分析等)。他们利用黑客新闻(HackerNews)获得了第一批用户：\n它真正需要的只是一个催化剂， - 之类的东西，就能把它送到几个可以开始传播消息的用户手中。而这正是黑客新闻(HackerNews)和Reddit上的第一波自我推销所做的。在那之后，这个工具的受欢迎程度就有机地增长了。(来源)。\n登上黑客新闻(HackerNews)的头版可能很难，而且难以预测，但如果你的目标受众中有相当一部分人在那里，这绝对是值得的。你可以以“Show HN”的形式提交你的产品，或者写一些有用的博客文章并在那里提交。\n在构建产品之前，先要建立受众。这是我听到越来越多的创始人说的话。\nAlitu(3000美元/月)是一个播客工具，可以自动完成很多重复的任务(添加音乐、转换音频、调平等)。在发布他们的主要产品之前，他们有一个相当大的博客(ThePodCastHost.com)：\n目前，我们在ThePodCastHost.com上的流量在每月20万的独立访问量范围内。这种流量是阿里图注册的主要驱动力，将读者和听众引向该工具。\n我们的主网站ThePodcast Host.com每天接待大约5000到6000名用户，我们通过网站上的电子邮件列表、调查和聊天工具对他们进行了调查。我们问了尽可能多的人， - ，你在为什么而挣扎？就像我说的，很多人提到编辑和制作是最大的障碍。要么他们学不到这项技术，要么他们没有时间。(来源)。\n有时候你并不需要大量的观众，拥有少量合适的观众就足够了。Baremetrics(8万美元/月)是订阅&amp；财务分析(适用于条纹、Braintree等)：\n我的秘密武器 - 大多数Baremetrics首批客户 - 的来源是推特。\n当我第一次推出Baremetrics时，我认识一小群其他创始人。我联系了他们，他们成了用户，他们开始了口碑滚雪球。就这么简单。\n你的网络并不需要非常庞大才能开始。SQRL(1000美元/月)是一款移动应用，可以管理你的身体、情绪和财务状况：\n我的第一个公司客户是一家当地的小企业，我是通过个人协会找到的。(来源)\n许多创始人在为这个市场发布产品之前，已经在他们的特定市场呆了很多年。Askable(31K/月)是一个帮助您寻找参与者进行面对面可用性测试的市场：\n你的网络可能比你想象的要大。不要只想着你的家人/朋友/同事。你以前参加过什么聚会吗？或者是一门课程？你也可以利用这些关系。以AlgoExpert为例(4万美元/月)。他们正在销售课程，帮助你准备编程面试，这位创始人在创业之前曾在类似的市场参加过一些活动：\n我们已经有超过150名用户，这在很大程度上要归功于我与FullStack Academy(FSA)的联系，这是我在2016年9月至12月参加的编程训练营。(来源)。\n你一生中参加了多少门课程？你参加过几次活动？这些都是机会，一句简单的“嘿，还记得我吗？”可以带来更多的东西。\n为了让AdWords为你工作，你不需要是一家由风险投资支持的初创公司。以ScreenshotAPI为例(400美元/月)。它们是一种API，只需输入网站URL即可截取网站屏幕：\n对我来说真正起作用的是谷歌广告。我现在每月花100美元在谷歌的“截屏API”关键字上。到目前为止，20名付费用户中有13名来自谷歌的付费广告。\n如果你看看Google Analytics的报告，你会发现当我开始在谷歌广告上做广告时，用户数量激增。\n对于付费渠道，您和该渠道的所有者有相同的目标：通过他们的渠道获得更多客户(您获得报酬，他们也获得报酬)。因此，他们(付费频道)希望帮助你取得成功，通常会提供免费咨询等服务。这就是教人们如何交易密码的移动应用AltCoin Fantasy(800美元/月)所利用的：\n你可能认为你了解AdWords，但很可能你并不完全了解它，特别是考虑到谷歌不断增加的新功能。为了“破解”这一点，我请了一位AdWords专家来审核我的广告，并给出一些反馈(AdWords免费提供这项服务，这真是太棒了)。本来15分钟的聊天变成了两个小时的学习课程，因为我不让他走。每个企业家都应该利用这一点！最后，我们有了一个围绕定制意图受众的AdWords活动，它超越了预先定义的受众类别，在人们做出购买决定时接触到他们，目标是他们正在积极研究相关产品或服务。我们使用梦幻体育运动员作为我们的定制受众，在特定的比特币应用程序上投放广告。我们花的钱相对较少，它确实把相关用户吸引到了我们的平台上。(来源)。\n如果你有一点钱可以花，AdWords也可以是验证你的产品的一个很好的方式。加入它(18K美元/月)是一个帮助商家销售会员制以及管理会员制的工具。他们使用AdWords获得了第一批用户(现在是他们收购战略的一部分)：\n为了将客户从零增加到15，我们可能不得不产生大约100个注册 - 这些注册主要是通过Google AdWords和与合作伙伴的联合营销博客发布的。\n到目前为止。\n.", "note_en": "I’ve been in the startup community since 2006 (when MySpace was still a thing) and one of the questions I’ve seen constantly popping up is: “How do I get new users? Where do I post? Which acquisition channels should I use to get new users?”\n Unfortunately, most of the answers are either based on a single experience or someone providing advice without evidence of why you should trust them.\n   2016 was a pretty amazing year for founders. It’s the year when  Indie Hackers launched and  The Open Startup Initiative started to take off. Founders suddenly began to be much more transparent with their startups; they shared revenue numbers, acquisition channels that worked for them, valuable lessons, and much more.\n Luckily, this trend still lives on. Indie Hackers now has more than  470 founder interviews, and there are also a bunch of related sites &amp; blog posts where founders share all sorts of data.\n Back to my point. When I saw what was going on (with so many interviews &amp; data points), I thought it was a perfect opportunity  to finally answer the how-do-i-get-users question in a reliable way. So I started with my research.\n I’ve spent  almost 2 years (as a side project) reading all 479 interviews on Indie Hackers (each interview is quite long, ranging from 1500 to 5000 words). On average, it took me 30 minutes to read/analyze/categorize each interview, so that’s around  240 hours total.\n I wanted to answer the question:  What acquisition channels do consistently repeatedly work for founders? How did those founders go from zero to users?\n This article will cover the top 15 of those acquisition channels (I found a total of 50+ channels, and plan to do additional posts if this one gets traction, feel free to subscribe to my  Zero to Users newsletter if you want to get notified when I release them).\n The channels are sorted by the number of “successful mentions” (meaning, the founder mentioned in the interview that a particular acquisition channel is working for them). Now, some founders spend just a sentence talking about the channel, some describe it in detail (you’ll see quotes from the latter below).\n  SEO (only after getting results with another acquisition channel. I explain below why this is important).  Mentions: 83\n    As I was reading the founder interviews, I’ve noticed 2 types of people who mentioned SEO as an acquisition channel working for them:\n a) Those who started with SEO immediately (without having had much success with other distribution channels)\n b) Those who were successful with other acquisition channels first, and then focused on SEO. Many of these founders have noticed that search traffic is getting them more and more users (often as a result of another acquisition strategy working, like press mentions), so they decided to double down on SEO.\n Here I’ll be talking about the second group under b). Snipcart ($33K/mo) is a tool that enables you to add a shipping cart to any website. Here’s what they had to say in their IndieHackers interview:\n In time, we realized our shaky, well-intentioned blogging was driving more and more organic traffic and even a few direct conversions. Especially our platform-specific e-commerce tutorials. So we decided to really own that channel. ( source)\n As I was reading more interviews, I noticed more and more founders saying the same thing; they discovered that search traffic brings them more and more customers, and doubled down on the channel. Take Creative Tim ($17K/mo) — a set of UI/UX kits:\n We’ve seen that we are also getting some revenue from SEO, that is around 22% of the revenue. So we decided to invest in SEO and we’ve got an SEO consultant which we pay around $500/month to improve our products ranks in Google. ( source)\n A small note on the revenue numbers: You will notice that next to each company (like Snipcard &amp; Creative Tim above) I have the monthly revenue data ($33K/mo, for example). I got this data from the interview text itself (which you can view by clicking on the “(source)” link at the end of the quote.)\n It’s easy to overlook the power of search traffic unless you look at your analytics numbers. Instapainting ($32K/mo) is a service that lets you turn a photo upload into a real hand-painted piece of artwork (done by a real, human artist), and they’re an example of this:\n What’s been most crucial in helping you to succeed? For me, SEO. I think it took about 5–6 months for me to realize that the business was primarily sustained from SEO traffic.\n Today Instapainting is earning about $400,000 of revenue per year. This is up from the first year, which was only about $89-$90k in revenue. The main driver of the increase is improved SEO from content marketing. ( source)\n Getting started with SEO right away makes sense in some cases (see #12 where I talk more about this). Most of the time, however, getting search traffic takes a lot of time and can cause you to give up early.\n This is what happened for Convertify ($5K/mo), a service to convert a website into a mobile app. At first, they used ProductHunt and got 43 sales after launching there. Here’s what happened later:\n We didn’t get much more traction after the initial Product Hunt launch. So we decided to pivot our efforts and focus on increasing organic traffic by writing high-quality, SEO-boosting articles. We mainly wrote about how to use Convertify to solve specific problems using keywords like “convert website to android app” and “convert website to iOS app”\n Visitors quickly dropped to 1,000 in December 2018 and hit a rock bottom of 200 in January and February 2019. We almost abandoned the project. But SEO takes some time to go into effect, and we started to notice an uptick in March as visitors increased to 400 followed by 1,200 in April.\n Focusing on SEO early on can really set your business up for future success. SEO has been a huge part of each of my businesses. ( source)\n If you think about it, this makes sense. Getting consistent search traffic takes a lot of time; plus, you have no idea if the effort is going to pay off (will those keywords convert?) Plus, focusing on other acquisition channels first (like the press, community outreach) gets you high rankings indirectly (more and more people talk &amp; link to you).\n For now, my recommendation is: If you want to (eventually) get search traffic, start by focusing on acquisition channels that bring that search traffic to you indirectly.\n    We’ve all heard of the Google Play Store or Apple App Store. Huge platforms with billions of users and a fairly large % of them using the apps built for those app stores. If you’ve ever developed a mobile app, you’ll know that these app stores will be one of your primary acquisition channels to get new users.\n Here’s the thing: Almost every major platform has its own “App Store”. Shopify, Slack, QuickBooks, Chrome (the browser), and Wordpress. And they’re a pretty good way to get to a new audience. Why? Because a large % of the platform’s users install these extensions. For example,  87% of Shopify’s users have installed at least one app from the app store.\n The way you “integrate” with those app stores is by creating an extension/app/plugin for them. I was really surprised by how many founders found these platforms to be successful in driving new users. Tettra ($24k/mo) is a communication tool for teams to document processes &amp; projects. They got started by creating a Slack bot and listed themselves in the  Slack app directory:\n Another massive source of trials was the Slack App Directory. After our experience, I highly recommend launching on a platform like Slack, WordPress, or Shopify. There’s a whole chunk of functionality that you can essentially “outsource” to the platform. For us, that was authentication, user management, and access to the “work graph”. You also get free distribution from the parent platform and a clear target persona you can attract.\n Some other companies recognized the potential of building platform extensions and took it to a whole new level. Take Widgetic ($3.3K/mo) — a set of interactive widgets to embed to any website (audio/video player, image slider, etc.).\n To partner with site builders, we check those that have App Stores and we integrate directly. Most site builders have below 1M users and no marketplace, so we connect directly with their business development people to explore if an integration makes sense. Once they see the value and we work through the technical issues, they usually upsell their plans and our apps become available to their paid users — it’s a win-win situation. ( source)\n   With platforms like WordPress or Chrome, you do need to know a specific programming language (PHP &amp; JavaScript). But for many other platforms (like Shopify), you can use your existing language &amp; just integrate with their API.\n   Product Hunt is (currently) the world’s largest website for discovering new products. If you’re looking for early adopters, this might be a great place for you.\n Product Hunt is one of these “spikey” channels that are great for validation, but not so good for sustained traffic. Take EpicPxls ($400+/mo), a site selling designs (UI kits, templates, etc.). Here’s what they said in their IndieHackers interview back in 2019:\n For us, the best way to attract users was by promoting our website and products on Product Hunt. We launched on March 6, 2016, and ended up at #2 with 650 upvotes and 5,799 new users, but our traffic went down to normal shortly thereafter. ( source)\n Some companies solve this issue by having multiple launches. Take Standuply ($25K/mo), which is a Slack bot for team standup meetings:\n We launched Standuply and related Slack bot products 8 times on Product Hunt in the latest 18 months. At first, it was our initial launch that brought in our very first users. It wasn’t that successful as we ended up in 7th place. However, it brought us 150 teams.\n Our best launch was our latest one: Standuply 3.0. It became the number one product of the day and number four product of the week. So we made it to both the daily and weekly Product Hunt email lists. See how it affected our registrations: ( source)\n    Right now there are 544,343 + subreddits on Reddit. There is probably a handful of these that are relevant to your niche.\n Starting with smaller subreddits and climbing your way up to the top can be a good strategy. It worked for WriteMapper ($1K/mo). They’re a mind-mapping desktop app for writers:\n I posted WriteMapper to Reddit’s /r/macapps, making sure to share details I thought were interesting, and replied to every comment that came in. As a &gt; small subreddit that 1) doesn’t get many posts to begin with and 2) typically gets posts with no effort made to either provide a background story or active comments by the original poster, I was able to have my post stay on the front page of the subreddit for quite a while. ( source)\n They then did a bit of press outreach, landing on Forbes and Cult of Mac. After this success, WriteMapper decided to try their luck (again) with Reddit:\n I then decided to go a little bigger, and post to /r/apple, which has more than 600k subscribers (compared to /r/macapps’s 19k). Besides making sure to stick to the subreddit’s rules, I also used WriteMapper’s positive reception on /r/macapps and Cult of Mac as social validation that the product would be something of interest to this community as well. That post took off, ending up with 1.3k upvotes and attracting almost 9k visitors to WriteMapper’s website.\n Cumulatively, these efforts attracted almost 16k visitors within the first two weeks alone of WriteMapper launching, and about 21k page views, which then translated into actual sales.( source)\n The most obvious way to promote your product on Reddit is to just post it, describing what it’s about. A more subtle (and in my opinion, more effective) way is to take the output of your app/service/newsletter and post that instead. This is what Card Crusade ($500/mo), a deck-building game did:\n Besides friends and family, our primary way of attracting users in the beginning was via Reddit; we would make a post with something cool from our game and then individually message everyone who left a comment, asking if they wanted to be a beta tester. ( source)\n If you’re a newsletter, maybe show your latest issue. If you’re doing a SaaS, show something cool that can be done it with (you press this, you get this in X seconds). Get creative.\n   Something we’ve all tried to do at some point. For those of you living under a rock, cold email outreach is basically taking a list of emails you’ve never got in touch with and sending them something that would ultimately lead to them buying your product &amp; service.\n What helps a lot is when information about potential customers is easily available online. Take Web4Realty ($100K/mo), a tool to easily create real estate websites:\n We’re very lucky to be in an industry where gathering lead information is very easy. Fortunately for us, real estate agents plaster their emails and phone numbers all over the place, which is very convenient.\n Raza and I spent the first several months cold-calling leads, continuously collecting more email addresses and numbers, and sending individual marketing emails, one by one. Sometimes the client wanted a demo in real-life so we went and did it.\n We operated this way for a good 5–6 months, and grinded our way to about 200–300 paying users. ( source)\n We all know people these days do not want to be bothered. Well, except when there is a big change going on, and they’re being directly affected.\n ShareKit.io ($1.6K/mo) is a tool to customize Facebook link previews. They launched after Facebook announced they would disable the ability to customize link previews (something many people used). Many people were frustrated. ShareKit used cold email to reach out to them:\n How have you attracted users and grown ShareKit.io? We also cold-emailed marketers who expressed their frustration with Facebook’s move on Twitter and Facebook. ( source)\n Is there a segment of your audience that’s particularly frustrated about not having your product? They may be a good target for cold email.\n   One of the biggest tech/dev community in the world. Plenty of interviewed founders found success posting on HackerNews.\n Mangools(686) ($220K/mo) is a set of SEO tools (like keyword research, backlink analysis, etc.). They used HackerNews to get their first users:\n All it really needed to get off the ground was a catalyst — something to get it into the hands of a few users who could start to spread the word. And that’s precisely what that first wave of self-promotion on HackerNews (ShowHN) and Reddit did. After that, the popularity of the tool grew organically. ( source)\n Getting on HackerNews’ front page can be hard &amp; unpredictable, but if there’s a good percent of your target audience there, it’s totally worth it. You can submit your product as “Show HN,” or write useful blog posts and submit them there.\n   Build an audience before you build the product. This is something I’m hearing more and more founders say.\n Alitu ($3k/mo) is a tool for podcasting that automates a lot of repetitive tasks (adding music, converting audio, leveling, etc.). They had a pretty big blog (ThePodcastHost.com) before launching their main product:\n Right now our traffic on ThePodcastHost.com is in the 200,000 unique visitors per month range. That traffic is the main driver of sign-ups for Alitu, directing readers and listeners towards the tool.\n  Our main site, ThePodcastHost.com, receives around 5k to 6k users per day, and we canvassed them via email lists, surveys, and chat tools on the site. We asked as many people as possible — what are you struggling with? And, like I said, many mentioned editing and production as the biggest barrier. Either they can’t learn the technology or they don’t have the time. ( source)\n Sometimes you don’t need a large audience; having a small number of the  right audience is enough. Baremetrics($80k/mo) is subscription &amp; financial analytics (for Stripe, Braintree, etc.):\n My secret weapon — the source of the majority of Baremetrics’ first customers — was Twitter.\n When I first launched Baremetrics, there was a small group of other founders I knew. I reached out to them, they became users, and they started the word-of-mouth snowball. Simple as that.\n    Your network doesn’t have a be extremely big to get started. SQRL ($1K/mo) is a mobile app to manage your physical, emotional, and financial well-being:\n My first corporate customer was a small, local business that I found through personal association. ( source)\n Many founders were in their particular market for years before releasing a product for that market. Askable ($31K/mo) is a marketplace to help you find participants for face to face usability testing:\n  You probably have a bigger network than you think. Don’t just think of your family/friends/colleagues. Is there a meetup you’ve attended in the past? Or maybe a course? You could use those connections as well. Take AlgoExpert ($40K/mo). They’re selling courses to help you prepare for coding interviews, and the founder attended something in a similar market before he created his business:\n We’ve grown very organically to over 150 users, thanks in large part to my connection to Fullstack Academy (FSA), the coding bootcamp I attended between September and December 2016. ( source)\n How many courses have you attended during your lifetime? How many events have you been to? These are all opportunities and a simple “hey, remember me?” can lead to something more.\n   You don’t need to be a venture-backed startup in order to get AdWords to work for you. Take ScreenshotAPI ($400/mo). They’re an API that allows you to take website screenshots by only entering the website URL:\n The thing that really worked well for me was Google advertising. I’m currently spending $100/month on the “screenshot API” keyword on Google. And so far, 13 of the 20 paying users came from that paid Google advertisement.\n If you look at the Google Analytics report you can see a spike in users when I started advertising on Google Ads. ( source)\n  With paid channels, you and the owners of that channel have the same objective; for you to get more customers through their channel (you get paid, they get paid). Thus, they (the paid channel)  want to help you succeed and usually provide things like free consultations. This is what Altcoin Fantasy ($800/mo), a mobile app teaching people how to trade crypto, made use of:\n You might think you know AdWords, but chances are you probably don’t know everything about it, especially given the new features Google is constantly adding. To “hack” this, I requested an AdWords specialist review my ads and give some feedback (AdWords offers this as a free service, which is awesome). What was supposed to be a 15 minute chat turned into a two hour learning session because I wouldn’t let the guy go. Every entrepreneur should take advantage of this! In the end, we had an AdWords campaign built around a custom intent audience, which goes beyond pre-defined audiences categories and reaches people as they’re making a purchase decision by targeting them as they’re actively researching a related product or service. Using fantasy sports players as our custom intent audience, we placed ads in specific Bitcoin apps. We paid relatively little for it, and It really drove relevant users to our platform. ( source)\n If you got a little bit of cash to spend, AdWords can also be a great way to validate your product. Join It ($18K/mo) is a tool to help businesses sell memberships, as well as manage them. They used AdWords to get their first users (and is now part of their acquisition strategy):\n To get from zero customers to 15, we probably had to generate about 100 sign ups — these sign ups predominately came through Google AdWords and a co-marketing blog post with a partner.\n To dat\n......", "posttime": "2020-11-09 14:41:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创始人,channels,网站", "title": "我在阅读479个创始人访谈中发现的15个收购渠道", "title_en": "15 Acquisition Channels I Discovered from Reading 479 Founder Interviews", "transed": 1, "url": "https://zerotousers.substack.com/p/15-acquisition-channels-i-discovered", "via": "", "real_tags": ["创始人", "channels", "网站"]}, {"category": "", "categoryclass": "", "imagename": "a5998791bfaf6fadf5efcd12881d8f6a.png", "infoid": 1033986, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哦，My Bash不会让你成为一个10倍的开发者……但你可能会想成为一个开发者。\n一旦安装好，你的终端外壳就会成为镇上的话题或者你的退款！在命令提示符中每击一次键，您就可以利用数百个功能强大的插件和漂亮的主题。陌生人会在咖啡馆里走到你面前，问你，这太令人惊讶了！你是某种天才吗？\n最后，你会开始得到你一直认为你应得的关注。……或者你可能会利用节省下来的时间开始更频繁地用牙线清洁牙线。\n哦，我的Bash是通过在您的终端中运行以下命令之一来安装的。您可以通过命令行使用curl或wget安装它。\n哦，我的Bash有一堆他妈的插件可以利用。你可以查看插件目录和/或维基，看看目前有哪些可用的插件。\n一旦你发现了一个(或几个)你想要与“哦我的洗澡”一起使用的插件，你需要在.bashrc文件中启用它们。您将在$HOME目录中找到bashrc文件。用你最喜欢的文本编辑器打开它，你会看到一个地方，上面列出了你想要加载的所有插件。\n大多数插件(应该！我们正致力于此)包括一份自述文件，其中记录了如何使用它们。\n我们承认这一点。在《噢，我的洗礼》世界的早期，我们可能有点太过主题快乐了。我们现在捆绑了一百多个主题。他们中的大多数人在我们的维基或者哦-my-zsh维基上都有截图。\nPower Line的主题是默认主题。这不是最花哨的一款。这不是最简单的问题。(对我来说)这件正合适。\n找到要使用的主题后，需要编辑~/.bashrc文件。您将在其中看到一个环境变量(全部大写)，如下所示：\n要使用不同的主题，只需将值更改为与所需主题的名称匹配即可。例如：\n#你可能需要在主机上安装一种特殊的电力线字体才能正常工作#请参阅https://github.com/ohmybash/oh-my-bash/wiki/Themes#agnoster。\n如果您没有找到适合您需要的主题，请查看维基获取更多内容。\n如果你感觉精力旺盛，你可以让电脑在你每次打开一个新的终端窗口时随机选择一个。\n如果你是那种喜欢把手弄脏的人，这些部分可能会引起共鸣。\n一些用户可能想要更改默认路径，或手动安装Oh My Bash。\n如果您想要使用OSH环境变量更改安装目录，可以在安装前运行EXPORT OSH=/YOUR/PATH，或者在安装管道结束之前设置它，如下所示：\n您可以通过复制我们为您提供的模板来创建新的sh配置文件。\n一旦您打开一个新的终端窗口，它应该会用oh my Bash的配置加载sh。\n如果在切换到oh-my-bash后找不到某些命令，则可能需要修改~/.bashrc中的路径。\n如果手动安装或更改安装位置，请检查~/.bashrc中的OSH环境变量。\n如果要覆盖任何默认行为，只需在自定义/目录中添加一个新文件(以.sh结尾)。\n如果有许多函数配合得很好，可以将它们作为XYZ.plugin.sh文件放在自定义/plugins/目录中，然后启用该插件。\n如果您希望覆盖随oh my Bash分发的插件的功能，请在自定义/plugins/目录中创建一个同名插件，它将被加载，而不是plugins/中的插件。\n默认情况下，系统会每隔几周提示您检查升级。如果您希望oh-my-bash在不提示您的情况下自动升级自身，请在~/.bashrc中设置以下设置：\n如果你想在任何时候升级(也许有人刚刚发布了一个新插件，而你不想等一周？)。你只需要运行：\n哦，我的狂欢并不适合每个人。我们会想念你的，但我们想让这次分手变得容易。\n如果您想卸载oh-my-bash，只需从命令行运行uninstall_oh_my_bash即可。它将自动删除并恢复您之前的bash配置。\n我远不是Bash专家，我怀疑有很多方法可以改进--如果你对如何让配置更容易维护(更快)有什么想法，请毫不犹豫地分叉并发送拉请求！\n我们还需要人来测试拉出请求。因此，请看一看这些未解决的问题，并在力所能及的情况下提供帮助。\n噢，我的Bash有一个充满活力的社区，有快乐的用户和令人愉快的贡献者。如果没有我们所有的时间和贡献者的帮助，它不会如此令人敬畏。", "note_en": "Oh My Bash will not make you a 10x developer...but you might feel like one.\n Once installed, your terminal shell will become the talk of the town or your money back! With each keystroke in your command prompt, you&#39;ll take advantage of the hundreds of powerful plugins and beautiful themes. Strangers will come up to you in cafés and ask you, &#34;that is amazing! are you some sort of genius?&#34;\n Finally, you&#39;ll begin to get the sort of attention that you have always felt you deserved. ...or maybe you&#39;ll use the time that you&#39;re saving to start flossing more often.\n      Oh My Bash is installed by running one of the following commands in your terminal. You can install this via the command-line with either  curl or  wget.\n       Oh My Bash comes with a shit load of plugins to take advantage of. You can take a look in the  plugins directory and/or the  wiki to see what&#39;s currently available.\n  Once you spot a plugin (or several) that you&#39;d like to use with Oh My Bash, you&#39;ll need to enable them in the  .bashrc file. You&#39;ll find the bashrc file in your  $HOME directory. Open it with your favorite text editor and you&#39;ll see a spot to list all the plugins you want to load.\n    Most plugins (should! we&#39;re working on this) include a  README, which documents how to use them.\n  We&#39;ll admit it. Early in the Oh My Bash world, we may have gotten a bit too theme happy. We have over one hundred themes now bundled. Most of them have  screenshots on our wiki or alternatively  oh-my-zsh wiki.\n  Powerline&#39;s theme is the default one. It&#39;s not the fanciest one. It&#39;s not the simplest one. It&#39;s just the right one (for me).\n Once you find a theme that you want to use, you will need to edit the  ~/.bashrc file. You&#39;ll see an environment variable (all caps) in there that looks like:\n  To use a different theme, simply change the value to match the name of your desired theme. For example:\n OSH_THEME=  &#34;agnoster &#34;   # (this is one of the fancy ones)  # you might need to install a special Powerline font on your console&#39;s host for this to work  # see https://github.com/ohmybash/oh-my-bash/wiki/Themes#agnoster\n   In case you did not find a suitable theme for your needs, please have a look at the wiki for  more of them.\n If you&#39;re feeling feisty, you can let the computer select one randomly for you each time you open a new terminal window.\n   If you&#39;re the type that likes to get their hands dirty, these sections might resonate.\n  Some users may want to change the default path, or manually install Oh My Bash.\n   If you&#39;d like to change the install directory with the  OSH environment variable, either by running  export OSH=/your/path before installing, or by setting it before the end of the install pipeline like this:\n        You can create a new sh config file by copying the template that we have included for you.\n     Once you open up a new terminal window, it should load sh with Oh My Bash&#39;s configuration.\n   You  might need to modify your  PATH in  ~/.bashrc if you&#39;re not able to find some commands after switching to  oh-my-bash.\n If you installed manually or changed the install location, check the  OSH environment variable in  ~/.bashrc.\n  If you want to override any of the default behaviors, just add a new file (ending in  .sh) in the  custom/ directory.\n If you have many functions that go well together, you can put them as a  XYZ.plugin.sh file in the  custom/plugins/ directory and then enable this plugin.\n If you would like to override the functionality of a plugin distributed with Oh My Bash, create a plugin of the same name in the  custom/plugins/ directory and it will be loaded instead of the one in  plugins/.\n  By default, you will be prompted to check for upgrades every few weeks. If you would like  oh-my-bash to automatically upgrade itself without prompting you, set the following in your  ~/.bashrc:\n     If you&#39;d like to upgrade at any point in time (maybe someone just released a new plugin and you don&#39;t want to wait a week?) you just need to run:\n    Oh My Bash isn&#39;t for everyone. We&#39;ll miss you, but we want to make this an easy breakup.\n If you want to uninstall  oh-my-bash, just run  uninstall_oh_my_bash from the command-line. It will remove itself and revert your previous  bash configuration.\n  I&#39;m far from being a  Bash expert and suspect there are many ways to improve – if you have ideas on how to make the configuration easier to maintain (and faster), don&#39;t hesitate to fork and send pull requests!\n We also need people to test out pull-requests. So take a look through  the open issues and help where you can.\n  Oh My Bash has a vibrant community of happy users and delightful contributors. Without all the time and help from our contributors, it wouldn&#39;t be so awesome.", "posttime": "2020-11-09 14:36:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,bash,插件", "title": "噢，我的Bash是一个开源的框架，用于管理您的bash配置", "title_en": "Oh My Bash is an open source, framework for managing your bash configuration", "transed": 1, "url": "https://github.com/ohmybash/oh-my-bash", "via": "", "real_tags": ["开源", "bash", "插件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033984, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在就杰里米·霍华德在JupyterCon 2020上的主旨向NumFOCUS行为准则委员会提交的报告以及随之而来的争议之后，NumFOCUS行为准则委员会向杰里米·霍华德发表了公开道歉声明，并将案件升级到董事会。", "note_en": "Following the reports to the NumFOCUS Code-of-Conduct committee on Jeremy Howard’s keynote at JupyterCon 2020, and the controversy that followed, the NumFOCUS Code of Conduct Committee issued a  public apology to Jeremy Howard and escalated the case to the board of directors.", "posttime": "2020-11-09 14:15:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,行为准则,conduct,霍华德", "title": "JupyterCon 2020：行为准则报告", "title_en": "JupyterCon 2020: Code of Conduct Reports", "transed": 1, "url": "https://numfocus.org/blog/jupytercon2020-coc", "via": "", "real_tags": ["2020", "行为准则", "conduct", "霍华德"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033983, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Scala的一个优点是实现编程语言。即使您的目标不是实现一种全新的编程语言，这些技术仍然很有用：用于编写内存、程序分析器、查询引擎和其他类似工具。这篇博客文章将带您完成用Scala实现简单编程语言的过程，介绍一些基本概念，最后介绍一个简单编程语言的可用解释器。\n关于作者：Haoyi是一名软件工程师，也是许多开源Scala工具(如Ammonite REPL和Mill构建工具)的作者。如果你喜欢这个博客上的内容，你可能也会喜欢作者的《Scala编程实战》一书。\n本练习的目标是实现Jsonnet编程语言的一个子集：\n本地问候语=&#34；Hello&#34；；本地人员=函数(姓名){&#34；姓名&#34；：姓名，&#34；欢迎&#34；：问候语+姓名+&#34；！&#34；}；{&#34；Pers1&#34；：Person(&#34；Alice&#34；)，&#34；Person 2&#34；：Person(&#34；Bob&#34；)，&#34；Person 3&#34；：)}。\n{&#34；Person 1&#34；：{&#34；姓名&#34；：&#34；Alice&#34；，&#34；欢迎&#34；：&#34；Hello Alice！&#34；}，&#34；Person 2&#34；：{&#34；姓名&#34；：&#34；Bob&#34；，&#34；欢迎&#34；：&#34；Hello Bob！&#34；}，&#34；人物3&#34；：{&#34；姓名&#34；：&#34；查理；，&#34；欢迎&#34；：&#34；你好，查理！&#34；}}。\nJsonnet是一种用于构造JSON配置文件的简单语言：评估.jsonnet文件的输出是一个包含字典、列表、字符串、数字和布尔值的JSON结构。然后，输出的JSON可用于配置Kubernetes、CloudForformation、Terraform或其他软件系统。Google、Databricks和其他公司大量使用Jsonnet来管理其庞大而复杂的系统配置。\n本教程将引导您完成实现我们的简单解释器的所有三个阶段，让您对所涉及的技术、数据结构和算法有一个直观的了解。虽然本教程不是一个全面的或可用于生产的实现，但它有望为您提供足够的基础，让您能够开始自己的简单语言相关项目。\n在本练习中，我们将在Ammonite Scala REPL中完成所有工作。菊石可以通过以下方式安装：\n$sudo sh-c；(ECHO&#34；#！/usr/bin/env sh&34；&amp；&amp；curl-L https://github.com/lihaoyi/Ammonite/releases/download/1.6.8/2.13-1.6.8)&&gt;；/usr/LOCAL/bin/amm&amp；&amp；chmod+x/usr/LOCAL/bin/amm&39；&amp；&amp；AmmLoading...欢迎使用Ammonite Repl 1.6.8(Scala 2.13.0 Java 11.0.2)如果您喜欢Ammonite，请通过www.patreon.com/lihaoyi@支持我们的开发。\n本地问候语=&#34；Hello&#34；；本地人员=函数(姓名){&#34；姓名&#34；：姓名，&#34；欢迎&#34；：问候语+姓名+&#34；！&#34；}；{&#34；Pers1&#34；：Person(&#34；Alice&#34；)，&#34；Person 2&#34；：Person(&#34；Bob&#34；)，&#34；Person 3&#34；：)}。\nJsonnet本身类似于JSON，但引入了帮助您整理JSON配置的冗长或重复部分的构造：本地变量(如上面的问候语)、函数定义(如Person)以及基本操作(如用+连接字符串)。出于本练习的目的，我们将停止实现这三个简单的功能。进一步的特性和改进可以用同样的方式实现，我们将把彻底实现整个Jsonnet语言的任务留给像Sjsonnet这样的产品解释器。\nJsonnet有一组与JSON类似的原语。在本教程中，我们只考虑其中的一部分：\n目前，我们假设字符串不包含\\n或\\&#34；等转义序列，并省略其他数据类型，如数字、布尔值、数组或NULL。\n您可以使用LOCAL关键字、为名称分配表达式、分号；，然后使用最终表达式来定义局部变量：\n与大多数编程语言一样，调用函数时使用包含要传递的参数的圆括号。\n这里描述的语言功能可以以任意方式组合，例如，可以在字典值内调用函数：\n本快速教程只是完整Jsonnet语言的一小部分，但对本教程来说已经足够了。\n为了解析Jsonnet，我们将使用本文介绍的Fastparse库：\n让我们从定义最小Jsonnet语法的语法树开始：字符串、字典、函数和局部定义。我们将使用Scala密封的特征和案例类来实现这一点：\n密封的特征Exproject expr{case class Str(s：String)扩展expr case类Iden(name：String)扩展expr case类Plus(节点：SEQ[expr])扩展expr case类dict(配对：MAP[String，expr])扩展expr case类Local(name：string，assigned：expr，body：expr)扩展expr case类Func(argNames：SEQ[string]，body：expr)扩展expr case类调用(expr：expr。\n(要将此代码输入到Ammonite REPL中，请用一对卷边将其括起来{...}，这样它就可以作为一个单元输入)。\n这里，expr数据结构旨在表示Jsonnet语法中有意义的部分。下面是一些示例代码片段，以及我们希望它们解析到的内容。\n当然，我们希望能够解析组合在一起的这些语言功能的任意组合。\n首先，让我们为Str编写解析器。为简单起见，我们将忽略转义字符，这意味着字符串只是一个&#34；，后跟零个或多个非&#34；字符，最后是另一个&#34；字符：\n@def str[_：P]=P(&#34；\\&#34；&#34；~~/CharsWhile(_！=&#39；&#34；&#39；，0).！~~&#34；\\&#34；&#34；).map(Expr.Str)定义函数str@fast parse.parse(&#34；\\&#34；Hello\\&#34；&#34；，str(_))res10：)，7)@fast parse.parse(&#34；\\&#34；Hello world\\&#34；&#34；，str(_))res11：parsed[Str]=Success(Str(&#34；Hello world&#34；)，13)@fast parse.parse(&#34；\\&#34；\\&#34；&#34；，str(_))res12：parsed[Str]=Success(Str(&#34；，str(_))Parsed.Failure(位置1：1，找到&#34；123&#34；)。\n注意我们是如何在&#34；\\&#34；&#34；后引号后面使用~~/运算符的：~~表示我们不想在这里使用空格(因为我们在一个字符串中)，而/是Fastparse Cut，这意味着如果解析失败，我们希望避免回溯。关于削减给我们带来什么的详细讨论留给了链接的文档。\n@defident[_：P]=P(Charin(&#34；a-Za-Z_&#34；)~~CharsWhileIn(&#34；a-Za-Z0-9_&#34；，0)).！.map(Expr.Iden)定义函数ident@fast parse.parse(&#34；Hello&#34；，ident(_))res17：parsed[Iden]=Success(&#34；a-Za-Z0-9_&#34；，0)。，ident(_))分析失败(位置1：1，找到&#34；123&#34；)。\n我们将研究的下一个语法树节点是Expr.Plus，它用于对a+b语法建模。\n表示+的Expr.Plus节点以及我们语法树中的所有其他case类都稍微复杂一些：它们有一个递归定义，其中Plus是expr，但是expr可以是Plus节点。这可以通过使我们的解析器递归来解决，如下所示：\n@{def expr[_：P]：P[expr]=P(prefix Expr~plus.rep).map{case(e，Nil)=&gt；e case(e，Items)=&gt；Expr.Plus(e+：Items)}def prefix Expr[_：P]=P(str|ident)def str[_：P]=P(&#34；\\&#34；&#34；~/。&#34；).map(Expr.Str)defident[_：P]=P(Charin(&#34；a-Za-Z_&#34；)~~CharsWhileIn(&#34；a-Za-Z0-9_&#34；，0)).！.Map(Expr.Iden)def plus[_：P]=P(&#34；+&#34；~prefix Expr)}@fast parse.。，expr(_))res65：parsed[expr]=Success(Plus(List(Ident(&#34；a&#34；)，Iden(&#34；b&#34；))，5)@fast parse.parse(&#34；a+b+c&#34；，expr(_))res66：parsed[expr]=Success(Plus(List(Iden(&#34；a&#34；)，Ident(&#。)，9)@fast parse.parse(&#34；a+\\&#34；\\&#34；+c&#34；，expr(_))res67：parsed[expr]=Success(Plus(List(Ident(&#34；a&#34；)，Str(&#34；&#34；)，Ident(&#34；c&#34；))，11)。\n请注意，我们不能简单地将PLUS定义为expr~&#34；+&#34；~expr；这是因为PLUS解析器将被保留为递归，从而导致在解析时进行无限递归。相反，我们需要将plus定义为后缀&#34；+&#34；~prefix Expr，并让expr解析器通过~plus.rep执行重复plus的工作，如果不为空，则将结果聚合到Expr.Plus节点中。\nExpr.Dict节点也是递归的，每个逗号分隔的键值对包含一个Expr.Str键和一个expr值。我们可以按如下方式解析它们：\n@{def expr[_：P]：P[expr]=P(prefix Expr~plus.rep).map{case(e，Nil)=&gt；e case(e，Items)=&gt；Expr.Plus(e+：Items)}def prefix Expr[_：P]=P(str|ident|dict)def str[_：P]=P(Str0).map(Expr.Str)de。&#34；&#39；&#39；，0).~~&#34；\\&#34；&#34；)defident[_：P]=P(Charin(&#34；a-Za-Z_&#34；)~CharsWhileIn(&#34；a-Za-Z0-9_&#34；，0)).！.MAP(Expr.Iden)def plus[_：P]=P(&#34；+&##。~/(str0~&#34；：&#34；~/expr).rep(0，&#34；，&#34；)~&#34；}&#34；).map(kvs=&gt；Expr.Dict(kvs.toMap))}@fast parse.parse(&#34；&#34；&#34；a&#34；：&#34；b&#34；，&#34；cde&34。，expr(_))res84：parsed[expr]=Success(dict(Map(&#34；a&#34；-&gt；str(&#34；b&#34；)，&#34；CDE&#34；-&gt；Ident(&#34；id&#34；))，21)@fast parse.parse(&#34；&#34；&#34；{&#34；a&#34；：&#34；：id}&#34；&#34；&#34；，expr(_))res85：parsed[expr]=Success(dict(Map(&#34；a&#34；-&gt；str(&#34；b&#34；)，&#34；cde&#34；-&gt；ident(&#34；id&#34；)，21)@fast parse.parse(&#34；&#34；&#34；，&#34；cde&#34；：id，&#34；嵌套&#34；：{}}&#34；&#34；&#34；，expr(_)res86：parsed[expr]=Success(dict(&#34；a&#34；-&gt；str(&#34；b&#34；)，&#34；cde&#34；-&gt；标识(&#34；id&34；)，DICT(地图(()，35)。\n注意我们是如何从str提取str0解析器的：str0返回解析的原始字符串，而str将其包装在Expr.Str语法树节点中。由于Expr.Dict键在语法上与Expr.Strs相同，但不需要包装在Expr.Str节点中，因此我们也可以在dict解析器中重用str0解析器来解析它们。\n将函数解析器、本地解析器和调用解析器添加到此代码中，我们会得到以下结果：\n对象解析器{def expr[_：p]：P[expr]=P(prefix Expr~plus.rep).map{case(e，Nil)=&gt；e case(e，Items)=&gt；Expr.Plus(e+：Items)}def prefix Expr[_：P]：P[expr]=P(callExpr~call.rep).map{case(e，Items)=&gt；item.。Expr.Call(f，args)}def callExpr[_：P]=P(str|dict|local|func|ident)def str[_：P]=P(Str0).map(Expr.Str)def str0[_：P]=P(&#34；\\&#34；&#34；~~/CharsWhile(_！=&#39；&#34；&#39；，0).！~。)defident[_：P]=P(Ident0).map(Expr.Iden)def ident0[_：P]=P(Charin(&#34；a-Za-Z_&#34；)~~CharsWhileIn(&#34；a-Za-Z0-9_&#34；，0))。！Def dict[_：P]=P(&#34；{&#34；~/(str0~&#34；：&#34；~/expr).rep(0，&#34；，&#34；)~&#34；}&#34；).map(KVS=&gt；Expr.Dict(kvs.toMap))def local[_：P]=P(&#34；local&#34；~/ident0~&#。~expr).map(Expr.Local.tupled)def函数[_：P]=P(&#34；函数&#34；~/&#34；(&#34；~ident0.rep(0，&#34；，&#34；)~&#34；)&#34；~expr).map(Expr.Local.tupled)def plus[_：P]=P(&#34；+&#34；~prefix Expr)。~/expr.rep(0，&#34；，&#34；)~&#34；)&#34；)}。\nFunc和local相对简单：每个函数都以一个关键字开头，并且可以递归地解析它们，而不会出现问题。我们还将ident0从ident中分离出来，因为func解析器使用与ident相同的语法来解析其参数列表，但不需要将标识符装箱到Expr.Iden语法树节点中。\n请注意，call还需要我们将prefix Expr进一步拆分为callExpr，因为a()调用语法将是左递归的，类似于我们前面看到的a+b加号语法。\n@fast parse.parse(&#34；\\&#34；123\\&#34；&#34；，Parser.expr(_))res63：parsed[expr]=Success(Str(&#34；123&#34；)，5)@fast parse.parse(&#34；id&#34；，Parser.expr(_))res64：parsed[expr]=Success(Iden(&#34；id&#34；)，2)。，Parser.expr(_))res65：parsed[expr]=Success(Plus(标识(&#34；a&#34；)，标识(&#34；b&34；))，5)@fast parse.parse(&#34；a+b+c&34；，Parser.expr(_))res66：parsed[expr]=Success(Plus(标识(&#34；a&#34；)，Plus(Iden(&#34；a&#34；)，Plus。)，9)@fast parse.parse(&#34；&#34；&#34；{&#34；a&#34；：&#34；A&#34；，&#34；b&#34；：&#34；bee&#34；}&#34；&#34；&#34；，Parser.expr(_))res69：parsed[expr]=Success(dict(Map(&#34；a&#34；-&gt；B&#34；-&gt；Str(&#34；bee&#34；))，22)@fast parse.parse(&#34；&#34；&#34；f()(A)+g(b，c)&#34；&#34；&#34；，Parser.expr(_))res95：parsed[expr]=Success(Plus(List(Call(Call(Ident(&#34；f&#34；))，List(。))，呼叫(身份(&#34；g#34；)，列表(身份(&#34；b#34；)，身份(&#34；c&#34；)，16)。\n我们编程语言的语法是递归的：LOCAL、Function、PLUS和DICT表达式可以包含其他任意深度嵌套的表达式。我们可以通过将这样的嵌套示例提供给expr解析器来测试这一点：\n@fast parse.parse(&#34；&#34；&#34；局部变量=&#34；Kay&#34；；{&#34；a&#34；：&#34；A&#34；，&#34；f&#34；：函数(A)a+a，&#34；嵌套&#34；：{&#34；k&#34；：变量}}&#34；&#34；&#34；，Parser.expr(_))res74：parsed[expr]=Success(Local(&#34；Variable&34；，Str(&#34；Variable&34；)，Str(&#34；Kay&34；)，Dict(&#34；A&#34；-&gt；Str(&#34；A&#34；)，&#34；f&#34；-&&gt;；Func(List(&#34；a&#34；)，Plus(&#34；a&#34；)，))，&#34；嵌套的&34；-&gt；dict(Map(&#34；k&#34；-&gt；标识(&#34；变量&#34；)，85)。\n现在我们已经有了expr节点的语法树，下一步是解释语法树以提供值的运行时数据结构。我们将价值定义如下：\n密封特征ValueObject Value{case类Str(s：String)扩展值case类dict(配对：Map[String，Value])扩展值case类Func(call：SEQ[value]=&gt；value)扩展值}。\n(要将此代码输入到Ammonite REPL中，请用一对卷边将其括起来{...}，这样它就可以作为一个单元输入)。\n请注意，虽然expr语法树包含表示标识符、局部变量、函数应用程序等的节点，但值只能是str、dict或Func。Value.Str来自哪里并不重要：无论是源代码中的文字Expr.Str，作为函数参数传递给Expr.Func，还是通过Expr.Local绑定到局部变量，它都是相同的Value.Str。然后，整个Jsonnet程序的最终值被转换为JSON字符串，作为程序的输出。\nValue.Str和Value.Dict的内容应该是不言而喻的。Value.Func就不那么明显了：通过将其定义为Func(call：SEQ[value]=&gt；value)，我们说的是一个函数，您可以将一列参数值传递给它并返回值。稍后我们将了解如何实例化这些Value.Func节点。\n这里的基本任务是编写一个将expr转换为值的函数：\n然而，通过计算expr返回的值不仅取决于该expr的内容：它还取决于包含的作用域，因为Expr.Iden标识符的值取决于通过局部声明或函数参数绑定到该名称的值。\n在您的程序中，这种名称到值的映射通常被称为词法作用域。因此，我们可以将EVALUE定义为：\n文字字典也很简单：Expr.Dicts变成Value.Dicts，具有相同键的Dicts，只是我们需要将每个值计算成其相应的表达式：\n字典文字不会在词法作用域中添加或删除任何内容，因此传递的作用域参数没有变化。通过测试，我们可以了解到：\n@EVALUATE(fastparse.parse(&#34；&#34；&#34；{&#34；hello&#34；：&#34；WORLD&34；，&#34；KEY&#34；：&#34；VALUE&#34；}&#34；&#34；，Parser.expr(_)).get.value，Map.Empty)res81：Value=dict(Map(&#34；Hello&#34；-&gt；Str(&#34；WORLD&34；)，&#34；键&#34；-&gt；字符串(&#34；值&#34；))。\n接下来，我们将查看Expr.Plus节点。我们只定义了它们的行为来处理字符串值(Value.Str)，因此评估它们涉及到：\n定义评估(expr：expr，作用域：MAP[字符串，值])：Value=expr Match{Case Expr.Str(S)=&gt；Value.Str(S)Case Expr.Dict(Kvs)=&gt；Value.Dict(kvs.map{Case(k，v)=&gt；(k，Evaluate(v，Scope)})Case Expr.Plus(Items)=&gt；Value.Str(item.。\n@fast parse.parse(&#34；&#34；&#34；&#34；本地问候=&#34；Hello&#34；；greeting+greeting&34；&#34；&#34；&#34；，Parser.expr(_))res85：parsed[expr]=Success(Local(&#34；greting&#34；，Str(&#34；Hello&#34；)，Plus(Ident(&#34；Greeting&34；)，Iden。\nLOCAL的目的是对赋值的表达式求值，将该值赋给该名称，然后使用绑定到该名称的值计算主体表达式。我们可以用如下代码编写该代码：\n案例Expr.Local(名称，已分配，正文)=&gt；Val assignedValue=Evaluate(已分配，范围)Evaluate(正文，范围+(名称-&gt；assignedValue))。\n一旦本地将名称放入作用域，计算标识标识符节点就很简单：只需在作用域中获取该名称的值：\n@EVALUATE(fast parse.parse(&#34；&#34；&#34；local greeting=&#34；Hello&#34；；greeting+greting&#34；&#34；&#34；，expr(_)).get.value，Map.Empty)res94：value=Str(&#34；Hello&#34；)。\n@EVALUATE(fast parse.parse(&#34；&#34；&#34；local x=&#34；Hello&#34；；local y=&#34；；x+y&#34；&#34；&#34；，expr(_)).get.value，Map.Empty)res96：value=Str(&#34；Hello world&#34；)。\n@EVALUATE(Fastparse.parse(&#34；&#34；&#34；&#34；本地问候=&#34；Hello&#34；；no+nope&#34；&#34；&#34；，expr(_)).get.value，Map.Empty)java.util.NoSuchElementException：Key Not Found：nope scala.collection.immutable.Map$Map1.apply(Map.scala:242)amamite.$sess.cmd93$.valuate(cmd93.sc：10)amitite.$sess.。(cmd95.sc：3)。\n定义评估(expr：expr，作用域：MAP[字符串，值])：Value=expr Match{Case Expr.Str(S)=&gt；Value.Str(S)Case Expr.Dict(Kvs)=&gt；Value.Dict(kvs.map{Case(k，v)=&gt；(k，Evaluate(v，Scope)})Case Expr.Plus(Items)=&gt；Value.Str(item.。S}.mkString)案例Expr.Local(名称，已分配，正文)=&gt；Val assignedValue=Evaluate(已分配，范围)Evaluate(正文，范围+(名称-&gt;；assignedValue))案例经验标识(名称)=&&gt;；范围(名称)}。\n我们最后要计算的是Expr.Func函数文字和Expr.Call函数应用程序节点：\nCase类Func(params：SEQ[字符串]，Body：expr)扩展Exprcase类调用(expr：expr，args：SEQ[expr])扩展expr\n在Value.Func上计算Expr.Call应该会给出计算该函数的结果。结果可以是Value.Str、Value.Dict，甚至是另一个Value.Func。\n计算Expr.Call节点很简单：我们只需将expr：expr求值为Value.Func，将args：SEQ[expr]求值为一系列参数值，然后对求值的参数值调用Value.Func#调用函数即可给出结果。\n案例Expr.Call(expr，args)=&gt；valValue.Func(Call)=Evaluate(expr，Scope)Val EvaluatedArgs=args.map(Evaluate(_，Scope))Call(EvaluatedArgs)。\n这里的难题是：我们如何计算Expr.Func以生成一个Value.Func，它的Call属性执行我们想要的操作？\n当您思考调用函数的真正含义时，它可以归结为四个步骤：\n使用在cal传递的参数值在定义站点创建原始作用域的修改副本。\n.", "note_en": "One strength of Scala is implementing programming languages. Even if your goal is not to implement an entirely new programming language, these techniques are still useful: for writing linters, program analyzers, query engines, and other such tools. This blog post will walk you through the process of implementing a simple programming language in Scala, introduce some of the fundamental concepts involved, and finishing with a working interpreter for a simple programming language.\n    About the Author:  Haoyi is a software engineer, and the author of many open-source Scala tools such as the Ammonite REPL and the Mill Build Tool. If you enjoyed the contents on this blog, you may also enjoy the Author&#39;s book    Hands-on Scala Programming\n   The goal of this exercise will to implement a subset of the  Jsonnet programming language:\n  local greeting = &#34;Hello &#34;;local person = function(name){ &#34;name&#34;: name, &#34;welcome&#34;: greeting + name + &#34;!&#34;};{ &#34;person1&#34;: person(&#34;Alice&#34;), &#34;person2&#34;: person(&#34;Bob&#34;), &#34;person3&#34;: person(&#34;Charlie&#34;)}\n  { &#34;person1&#34;: { &#34;name&#34;: &#34;Alice&#34;, &#34;welcome&#34;: &#34;Hello Alice!&#34; }, &#34;person2&#34;: { &#34;name&#34;: &#34;Bob&#34;, &#34;welcome&#34;: &#34;Hello Bob!&#34; }, &#34;person3&#34;: { &#34;name&#34;: &#34;Charlie&#34;, &#34;welcome&#34;: &#34;Hello Charlie!&#34; }}\n Jsonnet is a simple language meant to construct JSON configuration files: the output of evaluating a  .jsonnet file is a single JSON structure containing dictionaries, lists, strings, numbers, and booleans. The output JSON can then be used to configure  Kubernetes,  CloudFormation,  Terraform, or other software systems. Jsonnet is used heavily at Google, Databricks, and other companies in order to manage their large and complex system configurations.\n   This tutorial will walk you through all three phases of implementing our simple interpreter, giving you an intuition for the techniques, data structures and algorithms involved. While not a comprehensive or production-ready implementation, this tutorial should hopefully give you enough foundation to get started with your own simple language-related projects.\n For this exercise, we will do all our work inside the Ammonite Scala REPL. Ammonite can be installed via:\n $ sudo sh -c &#39;(echo &#34;#!/usr/bin/env sh&#34; &amp;&amp; curl -L https://github.com/lihaoyi/Ammonite/releases/download/1.6.8/2.13-1.6.8) &gt; /usr/local/bin/amm &amp;&amp; chmod +x /usr/local/bin/amm&#39; &amp;&amp; ammLoading...Welcome to the Ammonite Repl 1.6.8(Scala 2.13.0 Java 11.0.2)If you like Ammonite, please support our development at www.patreon.com/lihaoyi@\n   local greeting = &#34;Hello &#34;;local person = function(name){ &#34;name&#34;: name, &#34;welcome&#34;: greeting + name + &#34;!&#34;};{ &#34;person1&#34;: person(&#34;Alice&#34;), &#34;person2&#34;: person(&#34;Bob&#34;), &#34;person3&#34;: person(&#34;Charlie&#34;)}\n Jsonnet itself is similar to JSON, but introduces the constructs that help you tidy up verbose or repetitive portions of your JSON config: local variables like  greeting above, function definitions like  person, and basic operations like concatenating strings with  +. For the purpose of this exercise, we will stop at implementing these three simple features. Further features and improvements can be implemented the same way, and we will leave the task of exhaustively implementing the entire Jsonnet language to production intepreters like  Sjsonnet.\n  Jsonnet has a similar set of primitives as JSON. For this tutorial, we will consider just a subset of them:\n  For now, we will assume strings do not contain escape sequences like  \\n or  \\&#34;, and leave out additional data types like numbers, booleans, arrays, or null.\n     You can define local variables using the  local keyword, the assignment of an expression to a name, a semicolon  ;, and then the final expression:\n      As in most programming languages, functions are called using parentheses containing the arguments you wish to pass.\n     The language features described here can be combined in arbitrary ways, e.g. a function can be called inside a dictionary value:\n      This quick tour is only a small subset of the full Jsonnet language, but will be enough for this tutorial.\n  To parse Jsonnet, we will be using the  Fastparse library introduced in this blog post:\n   Let&#39;s start by defining a syntax tree of what our minimal Jsonnet syntax looks like: strings, dictionaries, functions, and local definitions. We will do so using a Scala  sealed trait and  case classes:\n sealed trait Exprobject Expr{ case class Str(s: String) extends Expr case class Ident(name: String) extends Expr case class Plus(nodes: Seq[Expr]) extends Expr case class Dict(pairs: Map[String, Expr]) extends Expr case class Local(name: String, assigned: Expr, body: Expr) extends Expr case class Func(argNames: Seq[String], body: Expr) extends Expr case class Call(expr: Expr, args: Seq[Expr]) extends Expr}\n (To enter this code into the Ammonite REPL, wrap it in a pair of curlies  {...} so it is entered as a single unit)\n Here, the  Expr data structure is meant to represent the meaningful parts of the Jsonnet syntax. Here are some example snippets and what we expect them to parse to.\n             And of course, we expect to be able to parse any combination of these language features combined together.\n    First, let&#39;s write the parser for  Str. We will ignore escape characters for simplicity, meaning a string is simply a  &#34;, followed by zero-or-more non- &#34; characters, closed by another  &#34;:\n @ def str[_: P] = P( &#34;\\&#34;&#34; ~~/ CharsWhile(_ != &#39;&#34;&#39;, 0).! ~~ &#34;\\&#34;&#34; ).map(Expr.Str)defined function str@ fastparse.parse(&#34;\\&#34;hello\\&#34;&#34;, str(_))res10: Parsed[Str] = Success(Str(&#34;hello&#34;), 7)@ fastparse.parse(&#34;\\&#34;hello world\\&#34;&#34;, str(_))res11: Parsed[Str] = Success(Str(&#34;hello world&#34;), 13)@ fastparse.parse(&#34;\\&#34;\\&#34;&#34;, str(_))res12: Parsed[Str] = Success(Str(&#34;&#34;), 2)@ println(fastparse.parse(&#34;123&#34;, str(_)))Parsed.Failure(Position 1:1, found &#34;123&#34;)\n Note how we use the  ~~/ operator after the  &#34;\\&#34;&#34; open quote: the  ~~ means we do not want to consume whitespace here (since we are inside a string) and the  / is a  Fastparse Cut meaning we want to avoid backtracking if the parse fails. A detailed discussion of what Cuts give us is left to the linked documentation.\n  @ def ident[_: P] = P( CharIn(&#34;a-zA-Z_&#34;) ~~ CharsWhileIn(&#34;a-zA-Z0-9_&#34;, 0) ).!.map(Expr.Ident)defined function ident@ fastparse.parse(&#34;hello&#34;, ident(_))res17: Parsed[Ident] = Success(Ident(&#34;hello&#34;), 5)@ println(fastparse.parse(&#34;123&#34;, ident(_)))Parsed.Failure(Position 1:1, found &#34;123&#34;)\n  The next syntax tree node we will look into parsing is  Expr.Plus, used to model the  a + b syntax.\n The  Expr.Plus nodes representing  +, and all other  case classes in our syntax tree, are a bit more complex: they have a recursive definition where  Plus is an  Expr, but an  Expr could be a  Plus node. This can be solved by making our parsers recursive, as follows:\n @ { def expr[_: P]: P[Expr] = P( prefixExpr ~ plus.rep ).map{ case (e, Nil) =&gt; e case (e, items) =&gt; Expr.Plus(e +: items) } def prefixExpr[_: P] = P( str | ident ) def str[_: P] = P( &#34;\\&#34;&#34; ~~/ CharsWhile(_ != &#39;&#34;&#39;, 0).! ~~ &#34;\\&#34;&#34; ).map(Expr.Str) def ident[_: P] = P( CharIn(&#34;a-zA-Z_&#34;) ~~ CharsWhileIn(&#34;a-zA-Z0-9_&#34;, 0) ).!.map(Expr.Ident) def plus[_: P] = P( &#34;+&#34; ~ prefixExpr ) } @ fastparse.parse(&#34;a + b&#34;, expr(_))res65: Parsed[Expr] = Success(Plus(List(Ident(&#34;a&#34;), Ident(&#34;b&#34;))), 5)@ fastparse.parse(&#34;a + b + c&#34;, expr(_))res66: Parsed[Expr] = Success(Plus(List(Ident(&#34;a&#34;), Ident(&#34;b&#34;), Ident(&#34;c&#34;))), 9)@ fastparse.parse(&#34;a + \\&#34; \\&#34; + c&#34;, expr(_))res67: Parsed[Expr] = Success(Plus(List(Ident(&#34;a&#34;), Str(&#34; &#34;), Ident(&#34;c&#34;))), 11)\n Note that we cannot simply define  plus as  expr ~ &#34;+&#34; ~ expr; this is because the  plus parser would then be  Left Recursive, causing an infinite recursion at parse time. Instead, we need to define  plus as just the suffix  &#34;+&#34; ~ prefixExpr, and have the  expr parser do the work of repeating  plus via  ~ plus.rep and aggregating the results into a  Expr.Plus node if non-empty.\n Expr.Dict nodes are also recursive, each comma-separated key-value pair containing a  Expr.Str key and a  Expr value. We can parse those as follows:\n @ { def expr[_: P]: P[Expr] = P( prefixExpr ~ plus.rep).map{ case (e, Nil) =&gt; e case (e, items) =&gt; Expr.Plus(e +: items) } def prefixExpr[_: P] = P( str | ident | dict ) def str[_: P] = P( str0 ).map(Expr.Str) def str0[_: P] = P( &#34;\\&#34;&#34; ~~/ CharsWhile(_ != &#39;&#34;&#39;, 0).! ~~ &#34;\\&#34;&#34; ) def ident[_: P] = P( CharIn(&#34;a-zA-Z_&#34;) ~~ CharsWhileIn(&#34;a-zA-Z0-9_&#34;, 0) ).!.map(Expr.Ident) def plus[_: P] = P( &#34;+&#34; ~ prefixExpr ) def dict[_: P] = P( &#34;{&#34; ~/ (str0 ~ &#34;:&#34; ~/ expr).rep(0, &#34;,&#34;) ~ &#34;}&#34; ).map(kvs =&gt; Expr.Dict(kvs.toMap)) }@ fastparse.parse(&#34;&#34;&#34;{&#34;a&#34;: &#34;b&#34;, &#34;cde&#34;: id}&#34;&#34;&#34;, expr(_))res84: Parsed[Expr] = Success(Dict(Map(&#34;a&#34; -&gt; Str(&#34;b&#34;), &#34;cde&#34; -&gt; Ident(&#34;id&#34;))), 21)@ fastparse.parse(&#34;&#34;&#34;{&#34;a&#34;: &#34;b&#34;, &#34;cde&#34;: id}&#34;&#34;&#34;, expr(_))res85: Parsed[Expr] = Success(Dict(Map(&#34;a&#34; -&gt; Str(&#34;b&#34;), &#34;cde&#34; -&gt; Ident(&#34;id&#34;))), 21)@ fastparse.parse(&#34;&#34;&#34;{&#34;a&#34;: &#34;b&#34;, &#34;cde&#34;: id, &#34;nested&#34;: {}}&#34;&#34;&#34;, expr(_))res86: Parsed[Expr] = Success( Dict(Map(&#34;a&#34; -&gt; Str(&#34;b&#34;), &#34;cde&#34; -&gt; Ident(&#34;id&#34;), &#34;nested&#34; -&gt; Dict(Map()))), 35)\n Note how we extracted the  str0 parser from  str:  str0 returns the raw  String that was parsed, while  str wraps it in an  Expr.Str syntax tree node. Since  Expr.Dict keys are syntactically the same as  Expr.Strs, but do not need to be wrapped in  Expr.Str nodes, we can re-use the  str0 parser in our  dict parser to parse them as well.\n  Adding the parsers for  func,  local and  call to this code, we get the following:\n object Parser { def expr[_: P]: P[Expr] = P( prefixExpr ~ plus.rep ).map{ case (e, Nil) =&gt; e case (e, items) =&gt; Expr.Plus(e +: items) } def prefixExpr[_: P]: P[Expr] = P( callExpr ~ call.rep ).map{ case (e, items) =&gt; items.foldLeft(e)((f, args) =&gt; Expr.Call(f, args)) } def callExpr[_: P] = P( str | dict | local | func | ident ) def str[_: P] = P( str0 ).map(Expr.Str) def str0[_: P] = P( &#34;\\&#34;&#34; ~~/ CharsWhile(_ != &#39;&#34;&#39;, 0).! ~~ &#34;\\&#34;&#34; ) def ident[_: P] = P( ident0 ).map(Expr.Ident) def ident0[_: P] = P( CharIn(&#34;a-zA-Z_&#34;) ~~ CharsWhileIn(&#34;a-zA-Z0-9_&#34;, 0) ).! def dict[_: P] = P( &#34;{&#34; ~/ (str0 ~ &#34;:&#34; ~/ expr).rep(0, &#34;,&#34;) ~ &#34;}&#34; ).map(kvs =&gt; Expr.Dict(kvs.toMap)) def local[_: P] = P( &#34;local&#34; ~/ ident0 ~ &#34;=&#34; ~ expr ~ &#34;;&#34; ~ expr ).map(Expr.Local.tupled) def func[_: P] = P( &#34;function&#34; ~/ &#34;(&#34; ~ ident0.rep(0, &#34;,&#34;) ~ &#34;)&#34; ~ expr ).map(Expr.Func.tupled) def plus[_: P] = P( &#34;+&#34; ~ prefixExpr ) def call[_: P] = P( &#34;(&#34; ~/ expr.rep(0, &#34;,&#34;) ~ &#34;)&#34; )}\n func and  local are relatively straightforward: each one starts with a keyword, and they can be parsed recursively without issue. We have also split out  ident0 from  ident, since the  func parser uses the same syntax as  ident for parsing its parameter list but does not need the identifiers to be boxed into  Expr.Ident syntax tree nodes.\n Note that  call also needs us to split up  prefixExpr further into  callExpr, since the  a() call syntax would otherwise be left-recursive similar to the  a + b plus syntax we saw earlier.\n  @ fastparse.parse(&#34;\\&#34;123\\&#34;&#34;, Parser.expr(_))res63: Parsed[Expr] = Success(Str(&#34;123&#34;), 5)@ fastparse.parse(&#34;id&#34;, Parser.expr(_))res64: Parsed[Expr] = Success(Ident(&#34;id&#34;), 2)@ fastparse.parse(&#34;a + b&#34;, Parser.expr(_))res65: Parsed[Expr] = Success(Plus(Ident(&#34;a&#34;), Ident(&#34;b&#34;)), 5)@ fastparse.parse(&#34;a + b + c&#34;, Parser.expr(_))res66: Parsed[Expr] = Success(Plus(Ident(&#34;a&#34;), Plus(Ident(&#34;b&#34;), Ident(&#34;c&#34;))), 9)@ fastparse.parse(&#34;&#34;&#34;{&#34;a&#34;: &#34;A&#34;, &#34;b&#34;: &#34;bee&#34;}&#34;&#34;&#34;, Parser.expr(_))res69: Parsed[Expr] = Success(Dict(Map(&#34;a&#34; -&gt; Str(&#34;A&#34;), &#34;b&#34; -&gt; Str(&#34;bee&#34;))), 22)@ fastparse.parse(&#34;&#34;&#34;f()(a) + g(b, c)&#34;&#34;&#34;, Parser.expr(_))res95: Parsed[Expr] = Success( Plus( List( Call(Call(Ident(&#34;f&#34;), List()), List(Ident(&#34;a&#34;))), Call(Ident(&#34;g&#34;), List(Ident(&#34;b&#34;), Ident(&#34;c&#34;))) ) ), 16)\n The syntax of our programming language is recursive:  local,  function,  plus, and  dict expressions can contain other expressions, nested arbitrarily deeply. We can test this out by feeding such nested examples into the  expr parser:\n @ fastparse.parse( &#34;&#34;&#34;local variable = &#34;kay&#34;; {&#34;a&#34;: &#34;A&#34;, &#34;f&#34;: function(a) a + a, &#34;nested&#34;: {&#34;k&#34;: variable}}&#34;&#34;&#34;, Parser.expr(_) )res74: Parsed[Expr] = Success( Local( &#34;variable&#34;, Str(&#34;kay&#34;), Dict( Map( &#34;a&#34; -&gt; Str(&#34;A&#34;), &#34;f&#34; -&gt; Func(List(&#34;a&#34;), Plus(Ident(&#34;a&#34;), Ident(&#34;a&#34;))), &#34;nested&#34; -&gt; Dict(Map(&#34;k&#34; -&gt; Ident(&#34;variable&#34;))) ) ) ), 85)\n  Now that we have a syntax tree of  Expr nodes, the next step is to interpret the syntax tree to provide a runtime data structure of  Values. We will define  Value as follows:\n sealed trait Valueobject Value{ case class Str(s: String) extends Value case class Dict(pairs: Map[String, Value]) extends Value case class Func(call: Seq[Value] =&gt; Value) extends Value}\n (To enter this code into the Ammonite REPL, wrap it in a pair of curlies  {...} so it is entered as a single unit)\n Note that while the  Expr syntax tree contains nodes that represent identifiers, local variables, function application, and so on, a  Value can only be a  Str, a  Dict, or a  Func. It doesn&#39;t matter where a  Value.Str came from: whether a literal  Expr.Str in the source code, passed in as a function parameter to a  Expr.Func, or bound to a local variable via  Expr.Local, it is still the same  Value.Str. The final  Value for the entire Jsonnet program is then converted to a JSON string as the output of the program.\n The contents of  Value.Str and  Value.Dict should be self explanatory.  Value.Func is a bit less obvious: by defining it as  Func(call: Seq[Value] =&gt;Value), we are saying &#34;a function is something you can pass a list of argument values to and returns a value&#34;. We will see how to instantiate these  Value.Func nodes later.\n The basic task here is to write a function that converts a  Expr into a  Value:\n  However, the  Value returned by evaluating an  Expr isn&#39;t only dependent on the contents of that  Expr: it also depends on the enclosing scope, as the value of  Expr.Ident identifiers depends on what value was bound to that name, via  local declarations or  function parameters.\n This mapping of names to  Values is often known as the &#34;lexical scope&#34; within your program. Thus we might instead define  evaluate as:\n         Literal dictionaries are also straightforward:  Expr.Dicts become  Value.Dicts, with the same keys, except we need to evaluate each value into its corresponding expression:\n  Dictionary literals do not add or remove anything from the lexical scope, so the  scope parameter is passed through unchanged. Testing it gives us:\n @ evaluate( fastparse.parse(&#34;&#34;&#34;{&#34;hello&#34;: &#34;world&#34;, &#34;key&#34;: &#34;value&#34;}&#34;&#34;&#34;, Parser.expr(_)).get.value, Map.empty )res81: Value = Dict(Map(&#34;hello&#34; -&gt; Str(&#34;world&#34;), &#34;key&#34; -&gt; Str(&#34;value&#34;)))\n Next, we will look at the  Expr.Plus nodes. We have only defined their behavior to work on string values ( Value.Str), so evaluating them is involves:\n     def evaluate(expr: Expr, scope: Map[String, Value]): Value = expr match{ case Expr.Str(s) =&gt; Value.Str(s) case Expr.Dict(kvs) =&gt; Value.Dict(kvs.map{case (k, v) =&gt; (k, evaluate(v, scope))}) case Expr.Plus(items) =&gt; Value.Str(items.map(evaluate(_, scope)).map{case Value.Str(s) =&gt; s}.mkString)}\n   @ fastparse.parse( &#34;&#34;&#34;local greeting = &#34;Hello &#34;;greeting + greeting&#34;&#34;&#34;, Parser.expr(_) )res85: Parsed[Expr] = Success( Local(&#34;greeting&#34;, Str(&#34;Hello &#34;), Plus(Ident(&#34;greeting&#34;), Ident(&#34;greeting&#34;))), 45)\n   The point of  local is to evaluate the  assigned expression to a value, assign that value to the  name, and then evaluate the  body expression with that value bound to that name. We can write that in code as follows:\n case Expr.Local(name, assigned, body) =&gt; val assignedValue = evaluate(assigned, scope) evaluate(body, scope + (name -&gt; assignedValue))\n Once a  local has put a name into  scope, evaluating  Ident identifier nodes is straightforward: simply fetch the value of that name in the  scope:\n   @ evaluate( fastparse.parse(&#34;&#34;&#34;local greeting = &#34;Hello &#34;; greeting + greeting&#34;&#34;&#34;, expr(_)).get.value, Map.empty )res94: Value = Str(&#34;Hello Hello &#34;)\n  @ evaluate( fastparse.parse(&#34;&#34;&#34;local x = &#34;Hello &#34;; local y = &#34;world&#34;; x + y&#34;&#34;&#34;, expr(_)).get.value, Map.empty )res96: Value = Str(&#34;Hello world&#34;)\n  @ evaluate( fastparse.parse(&#34;&#34;&#34;local greeting = &#34;Hello &#34;; nope + nope&#34;&#34;&#34;, expr(_)).get.value, Map.empty )java.util.NoSuchElementException: key not found: nope scala.collection.immutable.Map$Map1.apply(Map.scala:242) ammonite.$sess.cmd93$.evaluate(cmd93.sc:10) ammonite.$sess.cmd93$.evaluate(cmd93.sc:5) ammonite.$sess.cmd95$.&lt;clinit&gt;(cmd95.sc:3)\n   def evaluate(expr: Expr, scope: Map[String, Value]): Value = expr match{ case Expr.Str(s) =&gt; Value.Str(s) case Expr.Dict(kvs) =&gt; Value.Dict(kvs.map{case (k, v) =&gt; (k, evaluate(v, scope))}) case Expr.Plus(items) =&gt; Value.Str(items.map(evaluate(_, scope)).map{case Value.Str(s) =&gt; s}.mkString) case Expr.Local(name, assigned, body) =&gt; val assignedValue = evaluate(assigned, scope) evaluate(body, scope + (name -&gt; assignedValue)) case Expr.Ident(name) =&gt; scope(name) }\n  The last thing we have left to evaluate are the  Expr.Func function literals and  Expr.Call function application nodes:\n case class Func(params: Seq[String], body: Expr) extends Exprcase class Call(expr: Expr, args: Seq[Expr]) extends Expr\n   And evaluating an  Expr.Call on a  Value.Func should give us the result of evaluating that function. The result could be a  Value.Str, a  Value.Dict, or even another  Value.Func.\n Evaluating an  Expr.Call node is straightforward: we simply evaluate the  expr:Expr into a  Value.Func, evaluate the  args: Seq[Expr] into a sequence of argument values, and then call the  Value.Func#call function on the evaluated argument values to give us the result\n case Expr.Call(expr, args) =&gt; val Value.Func(call) = evaluate(expr, scope) val evaluatedArgs = args.map(evaluate(_, scope)) call(evaluatedArgs)\n The trickiness here is: how do we evaluate the  Expr.Func to produce a  Value.Func whose  call attribute does what we want?\n When you think about what  calling a function really means, it boils down to four steps:\n Create a modified copy of the original scope at definition-site with the values of the arguments passed at cal\n......", "posttime": "2020-11-09 14:14:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,scala,expr", "title": "使用Scala构建您自己的编程语言", "title_en": "Build Your Own Programming Language with Scala", "transed": 1, "url": "https://www.lihaoyi.com/post/BuildyourownProgrammingLanguagewithScala.html", "via": "", "real_tags": ["编程", "scala", "expr"]}, {"category": "", "categoryclass": "", "imagename": "bcbec852e4c9b149fa58f5cd153ff653.png", "infoid": 1033982, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年8月，我在WarsawJS上发表了演讲，解释了事件循环及其工作原理。我希望你会喜欢这个演讲。", "note_en": "On august 2020 I spoke at  WarsawJS, explaining about the event loop and how it works. I hope you will enjoy this talk.", "posttime": "2020-11-09 14:14:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "javascript,java,循环,loop,演讲", "title": "事件循环在JavaScript中是如何工作的？[视频]", "title_en": "How does the event loop work in JavaScript? [video]", "transed": 1, "url": "https://yonatankra.com/how-does-the-event-loop-work/", "via": "", "real_tags": ["java", "循环", "loop", "演讲"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033980, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无法往返http请求到上游：拨号tcp4 198.136.54.115：80：I/O超时", "note_en": "Unable to round-trip http request to upstream: dial tcp4 198.136.54.115:80: i/o timeout\u0000\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u000e\u000f\u0013\u0003\u0000", "posttime": "2020-11-09 13:26:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "书籍,学习,machine,往返", "title": "超酷的机器学习书籍", "title_en": "Cool Machine Learning Books", "transed": 1, "url": "http://matpalm.com/blog/cool_machine_learning_books/", "via": "", "real_tags": ["书籍", "学习", "machine", "往返"]}, {"category": "", "categoryclass": "", "imagename": "edb4c8e37cfccbe2e7d323437fbc18a2.jpg", "infoid": 1033979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由万维网创始人蒂姆·伯纳斯-李创办的Inrupte公司今天发布了一个企业版的Solid隐私平台，它允许大型组织和政府建立应用程序，让用户控制他们的数据。\n三年前，他创办了Inrupt，这是一家建立在开源项目之上的初创公司，并聘请约翰·布鲁斯(John Bruce)来运营公司。这两家公司有着相同的愿景，即在不改变网站开发方式的情况下转移数据所有权。有了Solid，开发人员可以使用相同的标准和方法来构建站点，这些应用程序可以在任何浏览器上运行。Solid的目标是改变数据力量的平衡，并将其重新定向到用户手中。\n布鲁斯解释说：“快进到今天，我们将发布第一项重要的技术，作为我们的劳动成果，这是一个企业版的Solid，将被大型组织大规模部署。”\n这种方法背后的核心思想是，用户在称为个人在线数据存储(Personal Online Data Store，简称Pod)的在线存储实体中控制他们的数据。企业版由用于管理Pod的Solid Server组成，开发人员可以使用SDK构建应用程序，以利用Pod并访问他们完成特定工作(如纳税或与医疗保健提供者交互)所需的数据。Bruce指出，企业版与开源Solid项目规范完全兼容。\n在今天发布之前，该公司一直在与一些主要机构合作，包括英国的BBC和国家医疗服务机构以及比利时的佛兰德斯政府，因为他们一直在努力将这种产品推向市场。\n为了让你了解这是如何运作的，美国国家医疗服务体系(National Health Service)一直在为患者建立一个与他们互动的应用程序，这些患者使用Solid可以控制他们的健康数据。该公司解释说：“患者将能够允许医生、家人或居家护理员从他们的Solid Pods中读取某些数据，并添加医生可以阅读的护理笔记或观察，以改善患者的护理。”\n这款应用程序与更传统的网络或手机应用程序之间的区别在于，用户可以访问这些信息，应用程序所有者必须向用户请求许可，用户必须明确授予许可，以及在何种条件下授予许可。\n这家创业公司成立于2017年，到目前为止已经筹集了约2000万美元。Bruce和Berners-Lee明白，要想让它扎根，它必须易于使用，基于标准，并有能力处理大规模的问题。任何人都可以下载和使用Solid的开源版本，但通过拥有企业版，它为像他们一直在合作的大型组织提供了这些公司所需的支持、安全性和可扩展性。", "note_en": "Inrupt, the startup from World Wide Web founder Tim Berners-Lee, announced an enterprise version of the Solid privacy platform today, which allows large organizations and governments to build applications that put users in control of their data.\n  Three years ago he launched Inrupt, a startup built on top of the open source project, and hired John Bruce to run the company. The two shared the same vision of shifting data ownership without changing the way websites get developed. With Solid, developers use the same standards and methods of building sites, and these applications will work in any browser. What Solid aims to do is alter the balance of data power and redirect it to the user.\n  “Fast forward to today, and we’re releasing the first significant technology as the fruits of our labor, which is an enterprise version of Solid to be deployed at scale by large organizations,” Bruce explained.\n  The core idea behind this approach is that users control their data in online storage entities called Personal Online Data Stores or Pods for short. The enterprise version consists of Solid Server to manage the Pods, and developers can build applications using an SDK to take advantage of the Pods and access the data they need to do a particular job like pay taxes or interact with a healthcare provider. Bruce points out that the enterprise version is fully compatible with the open source Solid project specifications.\n The company has been working with some major organizations prior to today’s release including the BBC and National Health Service in the UK and the Government of Flanders in Belgium as they have been working to bring this to market.\n To give you a sense of how this works, the National Health Service has been building an application for patients interacting with them, who using Solid can control their health data. “Patients will be able to permit doctors, family or at-home caregivers to read certain data from their Solid Pods, and add caretaking notes or observations that doctors can then read in order to improve patient care,” the company explained.\n The difference between this and more conventional web or phone apps is that it is up to the user who can access this information and the application owner has to ask the user for permission and the user has to explicitly grant it and under what conditions.\n The startup launched in 2017 and has raised about $20 million so far. Bruce and Berners-Lee understand that for this to take root, it has to be easy to use, be standards-based and and have the capacity to handle massive scale. Anyone can download and use the open source version of Solid, but by having an enterprise version, it gives large organizations like the ones they have been working with the support, security and scale that these companies require.", "posttime": "2020-11-09 13:03:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,创业,企业,berners", "title": "\n蒂姆·伯纳斯·李(Tim Berners Lee)的创业公司Inrupt为企业发布了坚实的隐私平台", "title_en": "\n\t\t\t\tTim Berners Lee’s startup Inrupt releases Solid privacy platform for enterprises\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/08/tim-berners-lees-startup-inrupt-releases-solid-privacy-platform-for-enterprises/", "via": "", "real_tags": ["发布", "创业", "企业", "berners"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033978, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你感觉注意力不集中，拿起纸笔开始写下你的想法。\n有没有什么问题让你纠结不已？你正在努力实现的一个模棱两可的目标吗？也许是一项你知道你需要做但却总是让你分心的任务？\n如今，很容易就会有一个明确的意图，结果却被手机上纷至沓来的应用和服务转移了注意力。\n花时间训练我们的通知设置的重要性和及时性是有帮助的，但我们可以用来完成几乎任何任务的数字设备，就其提供焦点的能力而言，永远不会经得起纸笔的考验。\n我的想法像旋风一样不停，我肯定比大多数人更容易分心，与几乎任何在线服务互动只会让我火上浇油。那么，如果我无法控制自己的注意力，我怎么能完成任何事情呢？\n纸和笔。每当我发现自己被困在漩涡中，因为我知道我没有做我想做的或我应该做的事情而感到不舒服时，我就会离开，抓起纸笔开始写作。\n写作这个简单的动作就能让我的思想和注意力集中，这是其他任何东西都无法比拟的。不受干扰，只是一张可以倾倒我的想法的画布，把它们变成有方向感和目的感的东西。\n写作对我来说就像是一种超能力。如果有任何我想完成的任务，第一步总是把它写下来。每当我需要重新思考这项任务时，我都会简单地回到纸上。\n在我的一生中，我发现最简单的解决方案往往是最有效的。到目前为止，我还没有找到解决任何问题的更简单的方法，那就是简单地把它写下来，然后继续写下去。", "note_en": "tl;dr — If you feel unfocused, grab a pen and paper and start writing your thoughts down.\n Is there a question you are stuck on? A ambiguous goal you&#39;re trying to accomplish? Maybe a task you know you need to do but from which you keep getting distracted?\n  It&#39;s all too easy these days to have a clear intention only to be sidetracked by the whirlpool of apps and services clawing for our attention on our devices.\n It helps to take the time to groom our notification settings for importance and timeliness, but a digital device that we can use to complete nearly any task will never stand up to pen and paper in terms of it&#39;s ability to provide focus.\n My thoughts are a constant whirlwind, I&#39;m certainly more distractible than most, and interacting with nearly any online service only fuels that fire. So how can I get anything done if I&#39;m unable to control my focus?\n Pen and paper. Whenever I catch myself stuck in the whirlpool, feeling not-great because I  know I&#39;m not doing what I want to be doing, or what I should be doing, I step away, grab pen and paper, and start writing.\n The simple act of writing can focus my thoughts and attention in a way that nothing else can. Free from distractions, just a canvas to pour my thoughts into, and turn them into something with a sense of direction and purpose.\n Writing is like a superpower to me. If there&#39;s any task I want to accomplish, the first step is always to write it down. Anytime I need to recenter myself on that task, I simply return to paper.\n Throughout my life I&#39;ve found that the simplest solutions are often the most powerful. So far I&#39;ve found no simpler solution to start tackling any problem than to simply write it down, and then keep on writing.", "posttime": "2020-11-09 12:59:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "纸笔,pen", "title": "从纸笔开始", "title_en": "Start with pen and paper", "transed": 1, "url": "https://sethetter.com/posts/start-with-pen-and-paper/", "via": "", "real_tags": ["纸笔", "pen"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位新手拼命工作了很多天，但当他的师傅检查他的程序时，他发现它包含一个屏幕编辑器，一套通用的图形例程，以及一个人工智能界面，但没有丝毫金融方面的暗示。当师父问起这件事时，这位新手变得义愤填膺。别这么不耐烦，他说，我最终会投入资金的。一个好农民会忽视自己种的庄稼吗？一个好老师会忽视哪怕是最谦逊的学生吗？一个好父亲会允许一个孩子挨饿吗？一个优秀的程序员会拒绝维护他的代码吗？\n让程序员多，经理少--这样一切都会有效率。当经理们无休止地开会时，程序员就会写游戏。当会计师谈到季度利润时，开发预算即将被削减。当资深科学家谈论蓝天时，乌云即将滚滚而来。\n的确，这不是编程之道。当管理者做出承诺时，游戏程序会被忽略。当会计制定长期计划时，和谐和秩序即将恢复。当资深科学家解决手头的问题时，这些问题很快就会得到解决。\n的确，这就是编程之道。为什么程序员效率低下？因为他们的时间浪费在开会上。为什么程序员会叛逆？因为管理层干预太多了。为什么程序员们一个接一个地辞职？因为他们已经筋疲力尽了。在为管理不善的公司工作过后，他们不再重视自己的工作。\n一位经理即将被解雇，但一位为他工作的程序员写了一个新的程序，这个程序很受欢迎，卖得很好。结果，这位经理保住了他的工作。经理试图给程序员发奖金，但程序员拒绝了，他说：“我写这个程序是因为我觉得这是个有趣的概念，所以我不指望奖励。经理听了这句话后说，这个程序员虽然地位不高，但很清楚作为一个员工的应有职责。”让我们把他提升到管理顾问的高位吧！但当被告知这一点时，程序员再次拒绝了，他说：“我存在是为了让我能编程。”如果我升职了，我什么也不会做，只会浪费大家的时间。我现在可以走了吗？我正在做一个项目。一位经理找到他的程序员，告诉他们：关于你们的工作时间：你们必须早上9点来，下午5点离开。听到这个，他们都很生气，有几个人当场辞职。于是经理说：好吧，那样的话，你可以自己设定工作时间，只要你按时完成项目就行了。程序员们现在很满意，中午就开始上班，一直工作到凌晨。你可以为一位公司高管演示一个程序，但你不能让他懂电脑。一位新手问大师：在东方，有一座宏伟的建筑，人们称之为公司总部。由于有副总裁和会计师，公司变得臃肿不堪。它会发布大量备忘录，每份备忘录上都写着“滚开！”或“滚蛋吧！”，没有人知道这是什么意思。每年都会有新名字出现在树枝上，但都无济于事。这样一个不自然的实体怎么会存在呢？大师回答说：你看到这个巨大的结构，就会感到不安，因为它没有理性的目的。你就不能从它没完没了的旋转中得到乐趣吗？你难道不喜欢在它的掩护下轻松轻松地编程吗？为什么你要为它的无用而烦恼？在东方，有一种鲨鱼比其他所有的鱼都大。它变成了一只翅膀如云彩般布满天空的小鸟。当这只鸟飞过陆地时，它带来了来自公司总部的信息。这个信息就像一只海鸥在海滩上留下了印记，落到了程序员中间。然后，鸟儿乘风而上，背着蓝天，飞回了天空。新手程序员惊奇地盯着这只鸟，因为他不明白。普通程序员害怕这只鸟的到来，因为他害怕它传递的信息。这位高级程序员继续在Histerinal工作，没有意识到这只鸟来了又走。象牙塔的魔术师带来了他的最新发明，供高级程序员检查。魔术师推着一个黑色的大盒子走进大师的办公室，而大师则静静地等待着。这是一款集成式、分布式、通用型工作站，魔术师从人体工程学角度出发，采用独有的操作系统、第六代语言和多种最先进的用户界面进行设计。我的助手们花了几百年时间才建成。这难道不令人惊叹吗？&#34；这位高级程序员微微扬起了眉毛。这确实令人惊叹，他说。公司总部拥有指挥权", "note_en": "The novice worked furiously for many days, but when his Masterreviewed his program, he discovered it contained a screen editor, aset of generalized graphics routines, and an artificial intelligenceinterface, but not the slightest hint of anything financial. When the Master asked about this, the novice became indignant. &#34;Don&#39;tbe so impatient,&#34; he said, &#34;I&#39;ll put in the financial stuffeventually.&#34;   Does a good farmer neglect a crop he has planted? Does a good teacher overlook even the most humble student? Does a good father allow a single child to starve? Does a good programmer refuse to maintain his code?\n     &#34;Let the programmers be many and the managers few-- then all will be productive.&#34;   When managers hold endless meetings, the programmers write games. When accountants speak of quarterly profits, the development budget isabout to be cut. When senior scientists talk blue sky, the clouds are about to roll in.\nTruly, this is not the Tao of Programming. When managers make commitments, game programs are ignored. When accountants make long-range plans, harmony and order are about tobe restored. When senior scientists address the problems at hand, the problems willsoon be solved.\nTruly, this is the Tao of Programming.   Why are programmers non-productive? Because their time is wasted inmeetings. Why are programmers rebellious? Because the management interferes toomuch. Why are the programmers resigning one by one? Because they are burntout. Having worked for poor management, they no longer value their jobs.\n   A manager was about to be fired, but a programmer who worked for himwrote a new program that became popular and sold well. As a result,the manager retained his job. The manager tried to give the programmer a bonus, but the programmerrefused it, saying, &#34;I wrote the program because I thought it was aninteresting concept, and thus I expect no reward.&#34; The manager upon hearing this remarked, &#34;This programmer, though heholds a position of small esteem, understands well the proper duty ofan employee. Let us promote him to the exalted position of managementconsultant!&#34; But when told this, the programmer once more refused, saying, &#34;I existso that I can program. If I were promoted, I would do nothing butwaste everyone&#39;s time. Can I go now? I have a program that I amworking on.&#34;   A manager went to his programmers and told them: &#34;As regards to yourwork hours: you are going to have to come in at nine in the morningand leave at five in the afternoon.&#34; At this, all of them becameangry and several resigned on the spot. So the manager said: &#34;All right, in that case you may set your ownworking hours, as long as you finish your projects on schedule.&#34; Theprogrammers, now satisfied, began to come in at noon and work to thewee hours of the morning.     &#34;You can demonstrate a program for a corporateexecutive, but you can&#39;t make him computer literate.&#34;   A novice asked the Master: &#34;In the East, there is a greattree-structure that men call &#39;Corporate Headquarters&#39;. It is bloatedout of shape with vice presidents and accountants. It issues amultitude of memos, each saying &#39;Go Hence!&#39; or &#39;Go Hither!&#39; and nobodyknows what is meant. Every year new names are put onto the branches,but all to no avail. How can such an unnatural entity exist?&#34; The Master replied: &#34;You perceive this immense structure and aredisturbed that it has no rational purpose. Can you not take amusementfrom its endless gyrations? Do you not enjoy the untroubled ease ofprogramming beneath its sheltering branches? Why are you bothered byits uselessness?&#34;   In the East there is a shark which is larger than all other fish. Itchanges into a bird whose wings are like clouds filling the sky. Whenthis bird moves across the land, it brings a message from CorporateHeadquarters. This message it drops into the midst of theprogrammers, like a seagull making its mark upon the beach. Then thebird mounts on the wind and, with the blue sky at its back, returnshome. The novice programmer stares in wonder at the bird, for he understandsit not. The average programmer dreads the coming of the bird, for hefears its message. The Master Programmer continues to work at histerminal, unaware that the bird has come and gone.   The Magician of the Ivory Tower brought his latest invention for theMaster Programmer to examine. The Magician wheeled a large black boxinto the Master&#39;s office while the Master waited in silence. &#34;This is an integrated, distributed, general-purpose workstation,&#34;began the Magician, &#34;ergonomically designed with a proprietaryoperating system, sixth generation languages, and multiple state ofthe art user interfaces. It took my assistants several hundred manyears to construct. Is it not amazing?&#34; The Master Programmer raised his eyebrows slightly. &#34;It is indeedamazing,&#34; he said. &#34;Corporate Headquarters has commanded,&#34; continued the Magician, &#34;thateveryone use this workstation as a platform for new programs. Do youagree to this?&#34; &#34;Certainly,&#34; replied the Master. &#34;I will have it transported to theData Center immediately!&#34; And the Magician returned to his tower,well pleased. Several days later, a novice wandered into the office of the MasterProgrammer and said, &#34;I cannot find the listing for my new program.Do you know where it might be?&#34; &#34;Yes,&#34; replied the Master, &#34;the listings are stacked on the platformin the Data Center.&#34;   The Master Programmer moves from program to program without fear. Nochange in management can harm him. He will not be fired, even if theproject is cancelled. Why is this? He is filled with Tao.     &#34;Without the wind, the grass does not move.Without software hardware is useless.&#34;   A novice asked the Master: &#34;I perceive that one computer company ismuch larger than all others. It towers above its competition like agiant among dwarfs. Any one of its divisions could comprise an entirebusiness. Why is this so?&#34; The Master replied, &#34;Why do you ask such foolish questions? Thatcompany is large because it is large. If it only made hardware,nobody would buy it. If it only made software, nobody would use it.If it only maintained systems, people would treat it like a servant.But because it combines all of these things, people think it one ofthe gods! By not seeking to strive, it conquers without effort.&#34;   A Master Programmer passed a novice programmer one day. The Master noted the novice&#39;s preoccupation with a hand-held computergame. &#34;Excuse me,&#34; he said, &#34;may I examine it?&#34; The novice bolted to attention and handed the device to the Master.&#34;I see that the device claims to have three levels of play: Easy,Medium, and Hard,&#34; said the Master. &#34;Yet every such device hasanother level of play, where the device seeks not to conquer thehuman, nor to be conquered by the human.&#34; &#34;Pray, Great Master,&#34; implored the novice, &#34;how does one find thismysterious setting?&#34; The Master dropped the device to the ground and crushed it with hisheel. Suddenly the novice was enlightened.   There was once a programmer who wrote software for personal computers.&#34;Look at how well off I am here,&#34; he said to a mainframe programmerwho came to visit. &#34;I have my own operating system and file storagedevice. I do not have to share my resources with anyone. Thesoftware is self-consistent and easy-to-use. Why do you not quit yourpresent job and join me here?&#34; The mainframe programmer then began to describe his system to hisfriend, saying, &#34;The mainframe sits like an ancient Sage meditating inthe midst of the Data Center. Its disk drives lie end-to- end like agreat ocean of machinery. The software is as multifaceted as adiamond, and as convoluted as a primeval jungle. The programs, eachunique, move through the system like a swift-flowing river. That iswhy I am happy where I am.&#34; The personal computer programmer, upon hearing this, fell silent. Butthe two programmers remained friends until the end of their days.   Hardware met Software on the road to Changtse. Software said: &#34;Youare Yin and I am Yang. If we travel together, we will become famousand earn vast sums of money.&#34; And so they set forth together,thinking to conquer the world. Presently, they met Firmware, who was dressed in tattered rags andhobbled along propped on a thorny stick. Firmware said to them: &#34;TheTao lies beyond Yin and Yang. It is silent and still as a pool ofwater. It does not seek fame; therefore, nobody knows its presence.It does not seek fortune, for it is complete within itself. It existsbeyond space and time.&#34;", "posttime": "2020-11-09 12:59:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,tao,程序员", "title": "编程之道", "title_en": "The Tao of Programming", "transed": 1, "url": "https://www.mit.edu/~xela/tao.html", "via": "", "real_tags": ["编程", "tao", "程序员"]}, {"category": "", "categoryclass": "", "imagename": "95396440dfb0857f21b03a6688277eef.png", "infoid": 1033976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在移动浏览器中工作的WebGL流体模拟。", "note_en": "A WebGL fluid simulation that works in mobile browsers.", "posttime": "2020-11-09 12:58:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模拟,website,webgl", "title": "模拟流体的有趣网站", "title_en": "A fun website that simulates fluid", "transed": 1, "url": "https://paveldogreat.github.io/WebGL-Fluid-Simulation/", "via": "", "real_tags": ["模拟", "website", "webgl"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033975, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这款游戏目前由布里斯托尔大学网络安全集团(University Of Bristol Cyber Security Group)开发，是值得信赖的互联网络物理系统(RITICS)研究所的一部分。\n布里斯托尔大学网络安全小组是布里斯托尔网络安全研究卓越学术中心(ACE-CSR)的一部分。该组织的研究集中在三个相互关联的方面：网络物理基础设施的安全、软件安全和人类行为。\n该集团参与了多项重大举措，包括作为网络安全科学研究所(RISCS)和值得信赖的网络物理系统研究所(RITICS)的领导项目，共同领导英国物联网网络安全研究中心的安全流程，并领导建立网络安全知识体系(Cyber Security Of Knowledge)的工作计划。", "note_en": "The game is now being developed by  The University of Bristol Cyber Security Group as part of the Research Institute on Trustworthy Inter-Connected Cyber-Physical Systems (RITICS).\n The University of Bristol Cyber Security Group is part of the Academic Centre of Excellence in Cyber Security Research (ACE-CSR) at Bristol. The group’s research focuses on three over-arching but interlinked strands: security of cyber-physical infrastructures, software security and human behaviours.\n The Group participates in several major initiatives, including leading projects as part of the Research Institute on Science of Cyber Security ( RISCS) and the Research Institute on Trustworthy Cyber-Physical Systems ( RITICS), co-leading the Security and Safety stream within the UK Research Hub on Cyber Security of Internet of Things and leading the programme of work on developing a Cyber Security Body of Knowledge ( CyBOK).", "posttime": "2020-11-09 12:33:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "中断,disruptions,网络安全", "title": "决策与中断：关于工业控制系统安全的桌面RPG", "title_en": "Decisions&Disruptions: tabletop RPG about security in industrial control systems", "transed": 1, "url": "https://www.decisions-disruptions.org/", "via": "", "real_tags": ["中断", "网络安全"]}]