[{"category": "", "categoryclass": "", "imagename": "04084ea9490d3b122dc237c88aea9009.jpeg", "infoid": 1017799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个不请自来的电话是从法国打来的。或者至少我的手机是这么说的。当我接电话时，一名男子问我是否在英国版的联邦调查局--国家犯罪局工作。当我解释说，不，作为一名记者，我不会向警方提供信息时，他说他为什么联系我。\n他说，外面有这些特殊的SIM卡，他指的是插在手机里的一小块硬件。他补充说，我现在实际上是从一家公司打来的电话，后来他解释说，他经营着一个地下网站，出售这些卡片。\n这位来电者说，这张SIM卡允许他伪造任何他想要的电话号码。想让自己看起来像是你从银行打来的电话，目的是为了诈骗目标吗？很简单。想要将其更改为随机的一系列数字，这样收件人的手机就不会记录您的真实号码吗？根据网上提供的如何使用卡的教程，这只需要几秒钟的时间就可以设置好。\n你们卖加密手机还是俄罗斯SIM卡？你用它们吗？我们很高兴收到你的来信。使用非工作电话或计算机，您可以通过Signal(+44 20 8133 5190)、Wickr(Josephcox)、OTR Chat(Email：jfcox@jabber.ccc.de)或电子邮件(joseph.cox@vice.com)安全地联系约瑟夫·考克斯(Joseph Cox)。\n俄罗斯的模拟人生。加密的模拟人。白人模拟人生。这些牌在犯罪团伙中有不同的名字，在质量和特征上也有很大的不同。但所有的SIM通常都是为了给用户某种安全或隐私利益而设计的，即使那个特定的SIM所做的更多的是戏剧性的，而不是实质的。除了欺骗电话号码，一些模拟人生还允许呼叫者实时操纵他们的声音，在他们的电话中添加男中音或尖叫斗篷，这往往是无意中搞笑的。其他卡更有价值的好处是，它是全球范围内的、无限制的数据模拟器，犯罪分子可以匿名从供应商那里获得这些卡，而不必放弃识别信息，也可以用比特币支付。\nSIM卡本身并不本质上是非法的，但犯罪分子肯定会在这些公司的客户群中制造明显的一大块。NCA告诉主板，他们在调查期间从嫌疑人手中查获了所谓的俄罗斯模拟人生。这个熙熙攘攘的行业的存在突显了犯罪人物如何继续尝试和利用不同的技术，而且是在政府机构成功打击犯罪技术基础设施的其他部分之际。\n他们是犯罪界最受欢迎的模拟人生，一位接近犯罪世界的消息人士告诉主板，他指的是匿名来源的数据模拟人生。主板在这篇报道中允许多个消息来源匿名，以保护他们免受报复，或者更坦率地谈论行业做法。\n犯罪分子经常使用所谓的加密电话，也就是定制的设备，在某些情况下，这些设备会删除麦克风、GPS和摄像头功能。其中一些公司还提供俄罗斯或加密的SIM卡，让客户不仅可以购买手机，还可以购买他们实际快速使用手机所需的数据和漫游功能，如果他们愿意，还可以购买SIM卡的一些额外功能。公司或个人并不总是同时销售手机和SIM卡，但这两个行业确实存在重叠。\n为了测试获得这种SIM卡的过程，主板通过与犯罪世界关系密切的消息来源购买了一张所谓的白色SIM卡，它以没有任何品牌或标签而闻名。在向供应商发送了大约100美元的比特币后，第二天就有一个包裹到达。\n这款SIM与主板合作并共享的国家/地区包括哥伦比亚、英国、摩洛哥、墨西哥、阿联酋和美国。\n收到SIM卡并将其放入解锁的手机后，用户必须更改设备上的接入点名称或APN&#34；。APN是手机用来在运营商的蜂窝网络和更广泛的互联网之间建立连接的设置集合。从本质上讲，输入此信息会告诉用户的电话，他们想要连接到一个通常无法识别的特定电话网络。\n在4月份上传到YouTube的一段视频中，一家SIM卡供应商演示了如何用他们的产品欺骗电话号码。供应商在他们的手机上输入了一系列数字，后跟一个星号，然后是他们想要模仿的数字，然后是散列符号。暂停后，另一部电话显示来自欺骗号码的来电。\n在另一段视频中，第二个卖家，这一次戴着似乎是黑色橡胶手套的东西，演示了如何使用自己的SIM卡做同样的事情。\n&#34；联系服务器，诺基亚手机上的信息显示。片刻之后，他们接到了07777 777777打来的电话，这个号码显然是伪造的。\n诈骗者用它给人们打电话，这样它就会显示银行号码或eBay，一名据称是卖家的人告诉主板，他在即时通讯应用Telegram上的名字是“船长”。它们销往世界各地。西班牙。摩洛哥。他们补充说，欧洲的狗屎堆积如山。\n实际上，你可以选择任何你想要的号码，说他们从其中一个模拟人生给我打过电话的人说。他们补充说，我可以在每次来电时都更换号码，每次都从不同的号码继续运行，这使得拦截来电者变得很困难。\n虽然其中一些SIM卡是秘密出售的，通过即时通讯应用程序和知情人士，面向公众的公司也出售这些卡。\n在通话结束后，你的对话者会在他/她的通话记录中留下随机生成的号码，一家销售这种卡的公司Secure Sims的网站上写道。一些卖家在更明显以犯罪为重点的市场上宣传他们的SIM卡。主板访问的地下网站出售所谓的Fullz，即信用卡数据，以及访问被黑客入侵的贝宝(PayPal)和银行账户以及SIM卡。\n其他在线视频显示了类似的SIM卡及其语音转换功能。在其中一个例子中，卖家简要展示了一些可用的选项，例如#34；男人；&#34；女人，&#34；儿童，&#34；和&#34；卡通。\nSRLabs专注于电信安全的安全研究员卡斯滕·诺尔(Karsten Nohl)在一封电子邮件中告诉主板，SIM卡的运营商可能会运营自己的移动虚拟网络运营商(MVNO)，这本质上是一家电信公司，依靠更成熟网络的基础设施。存在许多MVNO，包括谷歌的Fi，它运行在T-Mobile的基础设施之上。\n据一位目前在安全通信行业工作的消息人士称，为了获得SIM卡和数据以供出售，较小的公司可以前往世界各地的不同运营商，批量购买这些数据。\n然后你就可以将这些SIM卡作为集合数据出售，消息人士说。消息人士称，要与美国或加拿大的电信公司建立关系，公司可能需要创建MVNO，但在其他一些国家可能不需要这样做。\n专注于隐私的电话公司Secure Group的首席执行官兼创始人多米尼克·金格拉斯(Dominic Gingras)在电话中告诉主板，这可能没有必要，并表示一些公司可以与提供商签署协议，并获得允许更改号码的API，因为这些API可以用于合法目的。\n队长说，SIM卡的工作方式是先连接到一个私人服务器，然后由私人服务器代表用户自己拨打电话。他们说，服务器是由一家俄罗斯公司运营的-因此被称为俄罗斯模拟人生，因为许多用户似乎认为他们的电话是通过俄罗斯路由的-但没有提供任何证据来证实服务器的实际位置。这位目前在安全手机行业工作的消息人士说，至少与类似SIM卡相关的一些号码来自爱沙尼亚。这家销售SIM卡的地下网站的所有者表示，这些电话是通过贫穷国家拨打的，在那里人们可以便宜地购买电话网络的接入。\n作为对Encrochat的调查的一部分，Encrochat是一个被有组织犯罪大量使用的加密电话网络，Motherboard获得了一些文件，其中包含对涉嫌毒贩马克不利的证据。出于法律原因，主板使用化名来指代Mark。这些文件明确地将所谓的俄罗斯模拟人与涉嫌贩卖海洛因和其他毒品的人联系起来。\n在一条信息中，马克告诉一位同事按他的俄罗斯号码，文件上写着。在另一起案件中，他请人给他打个电话，告诉他检察官写道的俄语。我的俄语死了，马克给一位同事写了一封信。\n许多出售这些卡的公司或个人除了寄送卡的送货地址外，不会要求用户提供任何身份信息。如果犯罪分子想要使用电话，而不一定要向电信公司提供真实姓名或地址，这可能会很有用。\n值得一提的是，与常规的GSM提供商不同，我们不签署任何合同，也不要求提供个人数据。这样，我们确保我们的客户的个人信息不会被传递给第三方。我们所有的SIM卡都是预付费的，这意味着我们提前接收移动数据，以确保客户的最大安全，一家名为VIP Line Read的公司的网站这样写道。\nOmerta公司的主管克雷格·巴肯(Craig Buchan)在一封电子邮件中告诉Motherboard，我们显然不会记录SIMs的使用情况。Omerta是一家销售类似SIM卡和手机的公司，并向Encrochat的前客户推销其产品。(邦昌表示，该公司不再允许欺骗某些号码前缀，以防它们在欺诈案件中被使用。)。\n不过，一些公司提出了非同寻常的、基本上未经证实的主张。这些措施包括防弹，或者能够阻止来自IMSI捕手的所有监控，IMSI捕手是执法部门使用的伪装成手机发射塔的设备，并欺骗附近的设备连接到这些设备，以便跟踪它们的物理位置。\n一位经营加密电话公司的消息人士告诉“母板”，我觉得他们是在掠夺没受过教育的人。当SIM卡连接到漫游伙伴时，比如O2[一家英国电信公司]，它们就有唯一的标识符。\n你不能就这样告诉一台设备不要连接到坚固的塔楼上。这就是这款设备的设计初衷。找到一个强烈的信号。这位消息人士补充说，抓住并使用移动数据。\nSecure Group首席执行官金格拉斯(Gingras)表示，换号码和换语音是一件新奇的事情。他们可以给你另一层隐私，也许是通过伪造一个号码，这样你就不会被叫回来，但我不认为这有那么严重。\n他补充说，他们可能有点夸大了他们的营销范围，声称这可以保护你免受政府的审查。我不认为它真的能保护你免受一个真正心烦意乱的政府的伤害。\n即使有人匿名获得了SIM卡，他们仍然在使用SIM卡，进而使用电话网络。这位目前在手机行业工作的消息人士说，你不能隐形。\n安全研究员诺尔告诉主板，纯数据SIM卡(使用IMS进行语音/文本)可以防止IMSI捕获器截获语音通话和文本。诺尔说，所有使用加密的4G和3G网络都是如此，IMSI捕手无法破解这些网络，以及许多升级到A5/3加密的2G网络。不过，在所有这些情况下，IMSI捕获器仍然可以捕获IMSI，主要用于跟踪目的。\n撇开一些更大胆的说法不谈，这些模拟人生中的一些人在地下仍然很受欢迎。\nNCA调查副主任马特·霍恩(Matt Horne)在一份电子邮件声明中告诉Motherboard，严重而有组织的犯罪分子试图通过主流安全通讯应用和专门为犯罪而设计的加密通信平台来逃避执法。\n然而，通过拿下Encrochat和我们在威尼斯行动中的工作，我们已经表明，他们的方法和工具并不是我们无法企及的。他补充说，通过与国际和英国警务伙伴的密切合作，我们将继续取得技术进步，并将目标对准那些犯罪水平最高的人。\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "The unsolicited call came from France. Or at least that&#39;s what my phone said. When I picked up, a man asked if I worked with the National Crime Agency, the UK&#39;s version of the FBI. When I explained, no, as a journalist I don&#39;t give information to the police, he said why he had contacted me.\n  &#34;There are these special SIM cards out there,&#34; he said, referring to the small piece of hardware that slips inside a cell phone. &#34;I&#39;m actually ringing from one now,&#34; he added, before later explaining he runs an underground site that sells these cards.\n  This SIM card, the caller said, allowed him to spoof any phone number he wanted. Want to look like you&#39;re calling from a bank in order to scam a target? Easy. Want to change it to a random series of digits so that the recipient&#39;s phone won&#39;t record your real number? That just takes a few seconds to set up, according to tutorials of how to use the cards available online.\n Do you sell encrypted phones or Russian SIMs? Do you use them? We&#39;d love to hear from you. Using a non-work phone or computer, you can contact Joseph Cox securely on Signal on +44 20 8133 5190, Wickr on josephcox, OTR chat on  jfcox@jabber.ccc.de  , or email  joseph.cox@vice.com  .\n  Russian SIMs. Encrypted SIMs. White SIMs. These cards go by different names in the criminal underground, and vary widely in quality and features. But all are generally designed to give the user some sort of security or privacy benefit, even if what that particular SIM does is more theatre than substance. Beyond spoofing phone numbers, some SIMs let a caller manipulate their voice in real-time, adding a baritone or shrill cloak to their phone calls that is often unintentionally funny. Other cards have the more worthwhile benefit of being worldwide, unlimited data SIMs that criminals source anonymously from suppliers without having to give up identifying information and by paying in Bitcoin.\n  The SIM cards themselves aren&#39;t inherently illegal, but criminals certainly make a noticeable chunk of the companies&#39; customer bases. The NCA told Motherboard it has seized so-called Russian SIMs from suspects during investigations. The existence of this bustling industry highlights how crime figures continue to try and leverage different technologies, and comes as government agencies successfully crack down on  other parts of criminal technical infrastructure .\n  &#34;They are the most popular SIMs in crime,&#34; a source close to the criminal world told Motherboard, referring to the anonymously sourced data SIMs. Motherboard granted multiple sources in this story anonymity to protect them from retaliation or to speak more candidly about industry practices.\n   Criminals often make use of so-called encrypted phones, customized devices that in some cases have the microphone, GPS, and camera functionality removed. Some of these companies also offer Russian or encrypted SIM cards, letting customers buy not just a handset, but the data and roaming capability they would need to actually use the phone quickly, as well as some extra features from the SIM if they like. Companies or individuals don&#39;t always sell both the phone and the SIM, but the industries do overlap.\n  To test the process of obtaining such a SIM, Motherboard purchased a so-called white SIM, known for not having any branding or labelling, through a source close to the criminal world. After sending the supplier around $100 in Bitcoin, a package arrived the next day.\n  A list of countries where this particular SIM worked and shared with Motherboard included Colombia, the UK, Morocco, Mexico, the UAE, and the U.S.\n  After receiving the SIM card and putting it into an unlocked phone, a user has to change the Access Point Name or &#34;APN&#34; on the device. An APN is a collection of settings a phone uses to set up a connection between the carrier&#39;s cell network and the wider internet. Essentially, entering this tells a user&#39;s phone that they want to connect to a particular phone network, one that it may not ordinarily recognize.\n  In one video uploaded to YouTube in April, a SIM vendor demonstrated how to spoof phone numbers with their product. The vendor typed a series of digits on their phone, followed by an asterisk, and then the number they wanted to mimic and then the hash symbol. After a pause, a second phone displayed an incoming call from the spoofed number.\n  In another video, a second vendor, this time wearing what appears to be black rubber gloves, demonstrated how to do the same with their own SIM.\n  &#34;Contacting Server,&#34; the message on a Nokia handset read. Moments later, they received a call from 07777 777777; an obviously spoofed number.\n  &#34;Scammers use [it] to to call people so it shows [a] bank number or eBay,&#34; one alleged vendor, who went by the handle Captain on the messaging app Telegram, told Motherboard. &#34;They get sold worldwide. Spain. Morocco. Europe shit loads,&#34; they added.\n  &#34;You can actually pick any number that you want,&#34; the person who said they phoned me from one of the SIMs said. &#34;I could change it every call and keep running from a different number every time,&#34; they added, making blocking a caller difficult.\n  Though some of these SIMs are sold clandestinely, through messaging apps and via people in-the-know, public facing companies also sell these cards.\n  &#34;After the call has ended, your interlocutor is left with the randomly generated number in his/her call log,&#34;  the website for Secure SIMs, one company selling the cards, reads. And some sellers advertise their SIM cards on more clearly crime-focused marketplaces. The underground site Motherboard accessed sold so-called &#34;fullz,&#34; which are pieces of credit card data, as well as access to hacked PayPal and bank accounts alongside SIM cards.\n  Other videos online show similar SIM cards and their voice changing feature. In one, a seller  briefly shows some of the options available, such as &#34;Man,&#34; &#34;Woman,&#34; &#34;Child,&#34; and &#34;Cartoon.&#34;\n  Karsten Nohl, a security researcher from SRLabs focused on telecommunications security, told Motherboard in an email that operators of the SIM cards likely run their own Mobile Virtual Network Operator (MVNO), which is essentially a telecom company piggy backing off of the infrastructure of a more established network. Many MVNOs exist, including Google&#39;s Fi,  which runs on top of T-Mobile&#39;s infrastructure.\n  In order to obtain SIMs and data to sell, smaller companies can go to different carriers around the world and buy the data in bulk, according to a source who currently works in the secure communications industry.\n  &#34;Then you start selling these SIM cards as pooled data,&#34; the source said. To enter relationships with telecos in the United States or Canada, companies will likely need to create an MVNO, but may not need to in some other countries, the source said.\n  Dominic Gingras, CEO and founder of privacy-focused phone company Secure Group, told Motherboard in a phone call this may not be necessary, and said some companies could sign a deal with providers and gain access to APIs that would allow the number changing because they can be used for legitimate purposes.\n  Captain said the SIMs work by first connecting to a private server, which then makes the call itself on the user&#39;s behalf. They said the server is run by a Russian company—hence the street term Russian SIMs, as many users appear to think their calls are being routed through the country—but did not provide any evidence to corroborate the actual location of the server. At least some of the numbers associated with similar SIM cards come from Estonia, the source who currently works in the secure phone industry said. The person who owned the underground website selling SIM cards said the calls are instead going through &#34;poor countries&#34; where people can cheaply buy access to the phone network.\n    As part of  an investigation into Encrochat, an encrypted phone network heavily used by organized crime, Motherboard obtained documents which contain evidence presented against Mark, an alleged drug dealer. For legal reasons, Motherboard is referring to Mark using a pseudonym. Those documents explicitly link so-called Russian SIMs to people allegedly trafficking heroin and other narcotics.\n  In one message, Mark told an associate &#34;to ring his Russian number,&#34; the document reads. In another he asked someone to &#34;ring him on the &#39;Russian&#39;,&#34; prosecutors write. &#34;My Russian Is Dead,&#34; Mark wrote to an associate.\n  Many of the companies or individuals selling these cards don&#39;t ask for any identifying information from a user apart from a shipping address to send the card to. This may be useful to criminals if they want to use a phone without necessarily giving their real name or address to a telecommunications company.\n  &#34;It is important to mention that unlike regular GSM providers we don‘t sign any contracts or ask for personal data. This way we ensure that none of our clients personal information will be passed to third parties. All of our SIM cards are pre-paid which means that we receive mobile data in advance to ensure maximum safety for our clients,&#34; the website for one company  called VIP Line reads.\n  Craig Buchan, the director of Omerta, a company that sells similar SIMs as well as handsets and marketed its products to former customers of Encrochat, told Motherboard in an email that &#34;one key feature is obviously we do not keep records of our SIMs usage.&#34; (Bunchan said the company stopped allowing the spoofing of certain number prefixes in case they were being used in cases of fraud).\n  Some of the companies make extraordinary, and largely unsubstantiated claims, though. These include being &#34;bulletproof,&#34; or being able to thwart all surveillance from IMSI-catchers, devices used by law enforcement that pose as cell phone towers and trick nearby devices to connect to them in order to track their physical location.\n  &#34;I feel like they are preying on the uneducated,&#34; one source who runs an encrypted phone company told Motherboard. &#34;SIMs have unique identifiers when they connect to a roaming partner like O2 [a British telecom] for example.&#34;\n  &#34;You can&#39;t just tell a device not to connect to a strong tower. That&#39;s what the device is designed to do. Find a strong signal. Latch on and use mobile data,&#34; the source added.\n  Gingras, the CEO of Secure Group, said the number changing and voice changing SIMs &#34;are a novelty thing.&#34; They can give you another layer of privacy, perhaps by spoofing a number so you don&#39;t get called back, &#34;but I don&#39;t think it&#39;s that serious.&#34;\n   &#34;They may be a bit overextending their marketing, claiming that it protects you against your government&#39;s scrutiny,&#34; he added. &#34;I don&#39;t think it&#39;s really that useful to protect you against a really upset government.&#34;\n  Even if someone obtained a SIM card anonymously, they are still using a SIM card and by extension a phone network. The source who currently works in the phone industry said &#34;you can&#39;t be invisible.&#34;\n  Nohl, the security researcher, told Motherboard, &#34;A data-only SIM (that uses IMS for voice/text) prevents IMSI catchers from intercepting voice calls and text. So do all 4G and 3G networks that use encryption, which IMSI catchers cannot break open, and many 2G networks that upgraded to A5/3 encryption,&#34; Nohl said. &#34;In all these scenarios, the IMSI catcher can still catch IMSIs, though, mainly for tracking purposes.&#34;\n  Putting some of those more bold claims aside, some of these SIMs are still popular in the underground.\n  &#34;Serious and organised criminals attempt to evade law enforcement, through both mainstream secure messaging apps and encrypted communication platforms specifically designed for criminal use,&#34; Matt Horne, Deputy Director of Investigations from the NCA, told Motherboard in an emailed statement.\n  &#34;However, through the takedown of Encrochat and our work on Operation Venetic, we’ve shown that their methods and tools are not beyond our reach. By working closely with international and UK policing partners, we’re continuing to make technological advances and targeting those operating at the highest level of criminality,&#34; he added.\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-08-13 05:08:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sim,russian,电话", "title": "来看一下所谓的俄语、加密或“白色”SIM卡，犯罪分子使用这些SIM卡来欺骗电话号码，对呼叫进行实时语音处理，等等", "title_en": "A look at so-called Russian, encrypted, or “white” SIMs, used by criminals to spoof phone numbers, add voice manipulation to calls in real-time, and more", "transed": 1, "url": "https://www.vice.com/en_us/article/n7w9pw/russian-sims-encrypted", "via": "", "real_tags": ["sim", "russian", "电话"]}, {"category": "", "categoryclass": "", "imagename": "8baa74b2621ee282e77011ffbf5a24ef.jpeg", "infoid": 1017798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lyft刚刚公布了第二季度的收益，其中收入与去年同期相比下降了61%，但对其核心叫车业务来说，这是一线希望，与4月份相比，7月份的月度叫车次数增加了78%。\nLyft总裁兼联合创始人John Zimmer周三在财报电话会议上表示，如果法院不推翻其最近的裁决，该公司可能需要暂停在加州的运营，该裁决要求该公司(及其竞争对手优步)将司机归类为有资格享受福利的员工，而不是独立承包商，这些叫车公司还有大约一周的时间对初步禁令提出上诉。\n以下是该公司在截至2020年6月30日的一段时间内的表现，与华尔街的预期相比：\n每股亏损：根据Refinitiv调查的分析师的数据，调整后每股亏损86美分，而预期调整后为99美分。\n分析师估计，Lyft调整后每股亏损50美分至1.15美元，本季度营收为2.695亿美元至5.727亿美元。\n报告发布后，股价一度高达6%，但在Lyft表示可能不得不暂停在加州的运营后，股价下跌。\nLyft第二季度的净亏损为4.371亿美元，而去年同期为6.442亿美元。\n该公司没有提供营收指引，但表示在调整后的基础上有望在明年第四季度实现盈利。预计截至2019年10月，该公司的乘车次数将比预期减少20%至25%，从而实现盈利。\nLyft通过叫车、滑板车和共享单车以及相对较新的车辆租赁业务赚钱。与其主要竞争对手优步(Uber)不同，该公司没有外卖、货运或海外投资和业务，以帮助其弥补旅行和运输方面的损失。\n为了让司机和乘客再次感到叫车舒适，尽管新冠肺炎在美国一直坚持，Lyft从5月份开始要求乘客和司机在出行期间戴口罩，此后开始向司机分发口罩和洗手液。上个月，该公司宣布，将向其顶级司机分发数万辆汽车隔断盾牌，以保护他们免受这种新型冠状病毒的侵袭。现在，该公司还向想要防护栏的司机出售防护栏。\n但加利福尼亚州监管机构希望Lyft为司机做更多事情--把他们当作员工，而不是自由职业者。\n周一，加州一家法院发布了一项初步禁令，要求优步和Lyft将司机归类为在该州享有福利的正式员工，至少在等待法院采取进一步行动之前。这样做将意味着司机将有资格获得医疗保险、带薪病假等福利。叫车公司要求在上诉过程中短暂停留，现在必须在8月20日之前做出这一改变。\n优步首席执行官Dara-Khosrowshahi周三在接受MSNBC采访时表示，如果法院不推翻这一裁决，该公司可能不得不停止在加州的服务。\nLyft和优步在美国面临多起诉讼，原因是涉嫌对司机进行错误分类和工资盗窃。他们之前曾将司机严格视为独立承包商。与零工经济中的其他公司一样，优步和Lyft辩称，员工想要的是自由和灵活性，如果他们被归类为员工，他们就得不到这种自由和灵活性。\n包括加州大学黑斯廷斯分校(UC Hastings)劳动法教授维娜·杜巴尔(Veena Dubal)在内的批评人士表示，对灵活性的渴望不应与保持独立承包商的愿望混淆。在采访司机时，杜巴尔发现，他们压倒性地希望获得员工福利，尽管他们担心公司(包括优步(Uber)、Lyft和其他公司)可能会像雇主一样行事。", "note_en": "Lyft just reported second-quarter  earnings including a 61% revenue drop versus the same period last year, but a glimmer of hope for its core ride-hailing business with monthly rides increasing 78% in July, as compared to April.\n President and co-founder of Lyft, John Zimmer, said on an earnings call Wednesday that the company may need to suspend its operations in California if a court does not overturn its recent ruling, which requires the company (and competitors Uber) to classify drivers as employees eligible for benefits, not independent contractors. The ride-hail companies have about a week left to appeal the preliminary injunction.\n  Here&#39;s how the company did versus Wall Street expectations for the period ending June 30, 2020:\n Loss per share: 86 cents, adjusted vs. an expected 99 cents, adjusted, according to analysts surveyed by Refinitiv.\n Analysts&#39; estimates ranged from losses of 50 cents per share to $1.15 per share, adjusted, for Lyft, and $269.5 million to $572.7 million in revenue for the quarter.\n Shares traded as high as 6% following the report&#39;s release, but went negative after Lyft said it may have to suspend operations in California.\n Net losses for Lyft amounted to $437.1 million during the second quarter, compared to $644.2 million in the same period last year.\n The company did not offer top line guidance, but said it is on track to achieve profitability on an adjusted basis during the fourth quarter of next year. It expects to become profitable with 20% to 25% fewer rides than it had predicted as of October 2019.\n  Lyft makes money through ride-hailing, scooter- and bike-sharing, and its relatively new vehicle rentals business. Unlike its primary competitor,  Uber, the company does not have a food delivery, freight or investments and operations overseas to help it make up for losses in travel and transportation.\n To try to make drivers and rides feel comfortable with ride-hailing again, despite the persistence of Covid-19 in the U.S, Lyft made it a requirement for riders and drivers to wear a mask during trips starting in May, and after that began to distribute masks and hand sanitizer to drivers. Last month, the company announced that it was distributing tens of thousands of vehicle partition shields to its top drivers as a protection against the novel coronavirus. Now, the company also sells its protective barriers to drivers who want them.\n But California state regulators want Lyft to do even more for drivers -- treat them like employees, not freelancers.\n On Monday, a California court issued a  preliminary injunction that requires both Uber and Lyft to classify drivers as full employees with benefits in the state, at least pending further action by the court. Doing this would mean drivers would be eligible for benefits like health insurance, paid sick leave and more. The ride-hailing companies requested a brief stay during the appeals process, and now have until August 20 to make this change.\n Uber CEO Dara Khosrowshahi said in an interview with MSNBC Wednesday that the company might have to  stop service in California if the court doesn&#39;t overturn the ruling.\n Lyft and Uber are facing multiple lawsuits in the U.S. over alleged misclassification of drivers and wage theft. They have previously treated drivers strictly as independent contractors. Like others in the &#34;gig economy,&#34; Uber and Lyft have argued that workers want freedom and flexibility that they cannot get if they are classified as employees.\n Critics including UC Hastings professor of employment law, Veena Dubal, say that a desire for flexibility should not to be confused with a desire to remain an independent contractor. Interviewing drivers,  Dubal found that they overwhelmingly wanted employee benefits, even as they feared how companies (including Uber, Lyft and others) might behave as employers.", "posttime": "2020-08-13 05:08:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "乘客,active,司机", "title": "Lyft报告第二季度收入为3.39亿美元，高于预期，但同比下降61%，活跃乘客同比下降60%，至870万人；每位活跃乘客收入为39.06美元，同比下降2%。", "title_en": "Lyft reports Q2 revenue of $339M, above expectations but down 61% YoY, as active riders drop 60% YoY to 8.7M; revenue per active rider was $39.06, down 2% YoY", "transed": 1, "url": "https://www.cnbc.com/2020/08/12/lyft-earnings-q2-2020.html", "via": "", "real_tags": ["乘客", "active", "司机"]}, {"category": "", "categoryclass": "", "imagename": "9afb23db3c3d164c8e41e3cabf85a3b0.jpeg", "infoid": 1017797, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司正在增加一个插页，让人们在分享新冠肺炎信息之前，会停下来查看有关链接的上下文。此举为帮助新冠肺炎的错误信息在脸书上疯传的过程增加了亟需的摩擦。\nFacebook产品设计总监大卫·吉利斯(David Gillis)在Twitter上说：“在重新分享之前，你会看到来源和日期的链接。”“我们希望这能帮助人们一次获得更多背景信息，并了解正在迅速演变的话题。”\n此举相当于脸书心照不宣地承认，分享按钮--人们可以不假思索地传递信息--正在导致新冠肺炎的错误信息在其平台上传播得太快。Facebook在一篇博客文章中说，来自世界卫生组织等“可信的卫生当局”的链接不会有这些插页。\n正如吉利斯所说，Facebook增加“信息性摩擦”的举措，是对社交媒体上传播信息的按钮进行广泛反思的一部分。Twitter目前正在进行一项测试，询问人们是否想在转发之前点击推文中的链接。WhatsApp的转发有限。\n上周四，大型科技公司认为，关于错误信息和愤怒的讨论应该集中在让这些帖子在社交媒体上疯传的系统。(这是关注机器与其输出的问题。)。\n在这篇报道中，麻省理工学院教授大卫·兰德建议Facebook努力减缓这种传播。他说：“我赞成测试一种干预方式，即每当任何人点击分享任何与新冠肺炎有关的内容时，他们都会被问及他们认为标题有多准确，然后又被问到是否还想分享。”", "note_en": "The company is adding an interstitial that will make people stop and review context about links with Covid-19 information before they share it. The move adds much-needed friction into a process that has helped Covid-19 misinformation go viral on Facebook.\n “Before re-sharing, you’ll see links&#39; source and date,” David Gillis, a Facebook product design director,  said on Twitter. “We hope this helps people get more context at a time and on topic that is rapidly evolving.”\n The move amounts to a tacit admission from Facebook that the Share button — which allows people to pass along information without a second thought — is causing Covid-19 misinformation to spread too fast on its platform. Links from “credible health authorities” like the WHO, will not have these interstitials, Facebook said in a  blog post.\n  Facebook’s initiative to add &#34;informative friction,” as Gillis described it, is part of a broad rethinking of the buttons that spread information on social media. Twitter is currently running a test asking people if they want to click the link in a tweet before retweeting. Whatsapp has limited forwards.\n Last Thursday, Big Technology argued the discussion about misinformation and outrage should focus on the systems that make these posts go viral on social media. (It’s a matter of focusing on  The Machine vs. its Outputs.)\n In the story, MIT professor  David Rand suggested Facebook work to slow down the spread. “I&#39;d be in favor of testing an intervention where anytime anyone clicks Share for anything related to Covid-19, they are then asked how accurate they think the headline is, and then re-asked if they still want to share it,” he said.", "posttime": "2020-08-13 05:07:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,屏幕,rolls", "title": "脸书推出了一个间隙屏幕，当用户尝试分享新冠肺炎内容时会弹出一个间隙屏幕，显示创建的来源和日期，增加了亟需的摩擦", "title_en": "Facebook rolls out an interstitial screen that pops up when users try sharing COVID-19 content, showing the source and date created, adding much-needed friction", "transed": 1, "url": "https://bigtechnology.substack.com/p/facebook-adds-speedbump-to-slow-down", "via": "", "real_tags": ["facebook", "屏幕", "rolls"]}, {"category": "", "categoryclass": "", "imagename": "60e9d133c50277fc1b4765ddaa0b6c6f.jpg", "infoid": 1017796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司表示，目前只对大约1000名用户测试这项功能。但它可能会变得更广泛-考虑到美国和全球经济的状况，可能会有很多人需要这笔钱，更不用说目前进一步刺激计划的不确定性了。\nCash App一开始提供的贷款金额在20美元到200美元之间。你需要在四周内还清贷款，另外还要付5%的固定手续费。(乘以一年，这就是60%的年利率-这听起来很高，但至少明显低于平均发薪日贷款。)。\n如果你在四周后没有还清贷款，你将获得额外的一周宽限期，那么Square和Cash App将开始每周增加1.25%(非复利)的利息。如果你以前违约过，你也不能再申请额外的贷款。\n公司发言人在一份声明中说：“我们一直在测试Cash App的新功能，最近开始测试向大约1000名Cash App客户借款的能力。”“我们期待听到他们的反馈，并从这次实验中学习。”\nSquare已经将Cash App的功能扩展到了简单的点对点转账之外，推出了Cash Card(免费借记卡)、Cash Boost(奖励)和Cash App Investment等功能。除了Cash App，Square一直通过其Square Capital部门向小企业提供贷款。", "note_en": "The company said it’s only testing the feature with around 1,000 users for now. But it could become more broadly available — and there are probably plenty of people who could use the money, given the state of the U.S. and global economy, not to mention  the current uncertainty about further stimulus plans.\n Cash App   is starting out by offering loans for any amount between $20 and $200. You’ll be expected to pay the loan back in four weeks, along with a flat fee of 5%. (Multiplied over a year, that turns into a 60% APR — which sounds high, but at least it’s significantly lower than  the average payday loan.)\n  If you don’t pay off the loan after four weeks, you’ll get an additional one-week grace period, then  Square   and Cash App will start adding 1.25% (non-compounding) interest each week. You also won’t be able to take out an additional loan if you’ve previously defaulted.\n “We are always testing new features in Cash App, and recently began testing the ability to borrow money with about 1,000 Cash App customers,” a company spokesperson said in a statement. “We look forward to hearing their feedback and learning from this experiment.”\n Square has already been expanding Cash App’s features beyond simple peer-to-peer money transfer with things like  the Cash Card (a free debit card),  Cash Boost (rewards) and  Cash App Investing. And beyond Cash App, Square has been offering loans to small businesses through  its Square Capital arm.", "posttime": "2020-08-13 05:07:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "功能,testing,cash", "title": "Square表示，它正在测试一项短期贷款功能，提供20至200美元，一个月内偿还，约有1000名用户", "title_en": "Square says it is testing a short-term loan feature, giving between $20 and $200, repayable over a month, with around 1,000 users", "transed": 1, "url": "https://techcrunch.com/2020/08/12/square-cash-app-borrowing/", "via": "", "real_tags": ["功能", "testing", "cash"]}, {"category": "", "categoryclass": "", "imagename": "e181b1b308d97fe7948eb975b9a423dc.jpeg", "infoid": 1017795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌的一位发言人告诉我们，新的ChromeOS.dev网站目前有英语和西班牙语版本，目的是“通过技术资源/教程、产品公告、代码示例等，帮助开发人员最大限度地发挥他们在平台上的能力”。正如谷歌在今天的公告中指出的那样，在上个季度，Chromebook的销量同比增长了127%，相比之下，笔记本的总体销量只有40%。\n为了帮助Android开发者在Chromebook上完成所有工作(如果他们愿意的话)，Google现在在Chrome OS上提供了完整的Android Emulator，可以直接在他们的Chromebook上测试应用程序。该团队还让在Chrome OS(M81及更新版本)上部署应用程序变得容易得多。开发者现在可以直接部署和测试应用程序，而不必使用开发者模式或通过USB连接设备。\n除了这些以Android为中心的更新外，谷歌今天还发布了一个小型但受欢迎的Linux测试版更新，重点是终端。有了这一点，Chrome OS上的Linux现在有了一个改进的终端，现在包括标签、快捷方式、主题和重新设计的终端设置。\nAndroid Studio也有了一个小更新，新的主要/细节活动模板现在更好地支持为Chromebook、平板电脑和可折叠设备等大屏幕设备构建应用程序(正好赶上微软今天发布Surface Duo)。", "note_en": "The new ChromeOS.dev site, which is available in English and Spanish for now, is meant to “help  developers maximize their capabilities on the platform through technical resources/tutorials, product announcements, code samples and more,” a Google spokesperson told us. As Google notes in today’s announcement, in the last quarter, Chromebook unit sales were up 127% year-over-year in the last quarter, compared to 40% for notebook sales in general.\n To help  Android   developers do all of their work on a Chromebook if they so desire, Google now offers the full Android Emulator on Chrome OS to test apps right on their Chromebooks. The team also made deploying apps on Chrome OS (M81 and newer) much easier. Developers can now deploy and test apps directly without having to use developer mode or connect devices via USB.\n   In addition to these Android-centric updates, Google also today launched a small but welcome update to the  Linux beta, with a focus on the terminal. With this, Linux on Chrome OS now features an improved terminal that now includes tabs, shortcuts, themes and redesigned terminal settings.\n Android Studio, too, is getting a minor update with a new  Primary/Detail Activity Template that now better supports building apps for large-screen devices like Chromebook, tablets and foldables (right in time for Microsoft’s  Surface Duo announcement today).", "posttime": "2020-08-13 05:07:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,chrome,开发,谷歌,android", "title": "谷歌推出了新的工具，使在Chrome OS上开发Android应用程序变得更容易，包括一个新的ChromeOS.dev资源网站和一个原生Android Emulator", "title_en": "Google launches new tools to make developing Android apps on Chrome OS easier, including a new ChromeOS.dev resource website and a native Android Emulator", "transed": 1, "url": "https://techcrunch.com/2020/08/12/google-makes-building-android-apps-on-chrome-os-easier/", "via": "", "real_tags": ["程序", "chrome", "开发", "谷歌", "android"]}, {"category": "", "categoryclass": "", "imagename": "9c2d4ca983007bb9cc00998fbc7b6795.jpg", "infoid": 1017794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据一位参与策划的人士透露，在这些公司为选举之夜特别考虑的数十种情况中，有一种是黑客和泄密行动，即被盗材料通过在线网络迅速传播，并解决被篡改视频的传播问题。由于不愿代表整个行业联盟发表讲话，这名人士不愿透露姓名。他们说，场景规划是候选人不可知论的。\n今天的声明是在公司和政府官员--网络安全和基础设施安全局(Cybersecurity And Infrastructure Security Agency)、联邦调查局(FBI)对外影响特别工作组(Foreign Impact Task Force)、司法部国家安全局(DoJ)国家安全局和国家情报总监办公室(Office Of The Director Of National Intelligence)--讨论这一规划后不久发表的。这位知情人士说，它建立在一系列每月会议的基础上，这些会议可以追溯到去年9月。\n硅谷在2020年的比赛为何重要：谷歌(Google)、Facebook、Twitter和其他社交平台成为2016年美国干预选举的关键载体，而这些公司正在解决当时出现的问题，比如与克林顿竞选团队和民主党全国委员会(Democratic National Committee)有关的电子邮件遭到黑客攻击的事件。但这些公司也在研究2020年的独特之处：选举是否会有赢家，既取决于新冠肺炎停摆引发的邮寄选票所起的作用，也取决于候选人是否愿意认输，而特朗普已经为宣布选举结果无效奠定了基础。\n声明吸引眼球的原因：这份文件不同寻常，因为科技公司之间的竞争往往非常激烈。在某些情况下，高管们就是不喜欢对方。对于在他们的平台上允许什么，这些公司采取了不同的方法。他们的个人规则和决策仍然适用，但他们的密切协调使他们能够分享吸取的教训和即将到来的身份威胁。这是关键，因为最近几年学到的一个重要教训是，有问题的内容经常在平台上传播，因此联合起来有助于这些公司扩大努力。\n此外，这些公司与政府机构(即国土安全部和联邦调查局)的密切协调与2016年形成了鲜明对比。由于缺乏公私沟通，硅谷的许多人认为，该行业被国家安全和执法部门抛在了脑后，而他们自己也没有意识到俄罗斯构成的威胁。\n为什么这可能还不够：快速捕捉错误信息以防止其影响选举是一个挑战。批评人士说，社交媒体公司等了太久才开始这样的努力，可能会发现现在采取必要的保障措施已经太晚了。\n下一步是什么：在选举日之前，这些公司将坚持灾难规划，届时他们的准备工作将在美国历史上最具争议的选举之一的刺眼光芒中接受考验。", "note_en": "Among dozens of scenarios being contemplated by the companies for election night in particular are a &#34;hack and leak&#34; operation where stolen materials are quickly spread through online networks and addressing the distribution of manipulated videos, according to a person involved in the planning who spoke anonymously so as to not speak on behalf of the full industry coalition. The scenario planning is &#34;candidate agnostic,&#34; they said.\n Today&#39;s statement comes shortly after a meeting among the companies and government officials — the Cybersecurity and Infrastructure Security Agency, the FBI’s Foreign Influence Task Force, the Department of Justice&#39;s National Security Division, and the Office of the Director of National Intelligence — to discuss the planning. It builds on a series of monthly meetings, the person said, that go back to September of last year.\n Why Silicon Valley gaming out 2020 matters: Google, Facebook, Twitter and other social platforms became key vectors for election meddling in the United States in 2016, and here the companies are addressing went wrong back then, like the hacking of emails tied to the Clinton campaign and Democratic National Committee. But the companies are also looking at what makes 2020 unique; whether there&#39;s a winner on election depends both the role played by mail-in ballots triggered by Covid-19 lockdowns and candidates&#39; willingness to concede, and Trump has laid the groundwork for declaring the results invalid.\n Why the statement is eye-catching: The document is unusual because the tech companies are often extraordinarily competitive with each other. In some cases, the executives simply don&#39;t like each other. And the companies have taken different approaches to what to allow on their platforms. Their individual rules and decision-making still apply, but they close coordination allows them to share both lessons learned and ID threats coming down the pike. That&#39;s key because one of the critical lessons learned in recent years is that problematic content often spreads across platforms, so combining forces helps the companies amplify their efforts.\n Also, the companies&#39; close coordination with government agencies — namely DHS and the FBI — stand in stark contrast to 2016. The lack of public-private communication led many in Silicon Valley to believe that the industry got thrown under the bus by a national security and law enforcement community that had itself missed the threat posed by Russia.\n Why it may not be enough: Catching misinformation quickly to prevent it from influencing elections is a challenge. Critics say the social media companies  have waited too long to start efforts like this and may find that it is too late to put the necessary safeguards in place.\n What&#39;s next: The companies will stick with disaster planning in the lead-up to Election Day, when their preparations will get tested in the harsh glare of one of the most controversial elections in U.S. history.", "posttime": "2020-08-13 05:07:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,谷歌,facebook,google,情景", "title": "谷歌、Facebook、Twitter、Pinterest和其他公司合作为美国选举日之前的最后三个月制定情景计划，包括缓慢的选举结果", "title_en": "Google, Facebook, Twitter, Pinterest, and others partner to scenario-plan for the last three months before US Election Day, including slow election results", "transed": 1, "url": "https://www.politico.com/news/2020/08/12/election-silicon-valley-394354", "via": "", "real_tags": ["美国", "谷歌", "facebook", "google", "情景"]}, {"category": "", "categoryclass": "", "imagename": "633907dde70c61dce2a52640df811aa1.jpg", "infoid": 1017792, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter今天发布了APIv2，这使得企业、学者和第三方开发者更容易在其平台上构建。该公司上个月宣布了新的API，但当消息在它遭到社交媒体历史上最具破坏性的黑客攻击的第二天到达时，它决定推迟发布。值得注意的是，Twitter展示的APIv2不仅是一种更快交付新功能的方式，也是它与应用程序开发者社区长期不和的关系的一种重置。\nAPI v2是Twitter自2012年以来首次完全重建API，当时该公司开始限制第三方开发者在其产品上构建的方式，这是出了名的。在此之前，外部开发人员或多或少可以在自己的客户端复制和定制Twitter体验。但随着Twitter更加专注于其广告业务，它显然决定不想分割其用户基础。它开始慢慢排挤第三方开发者，阻止他们使用投票和分组DM等新功能，并引导用户使用公司自己的应用程序。企业被扼杀，开发商也不高兴。\n不过，现在Twitter正试图重建其中的一些桥梁。API v2为第三方开发人员提供了对其客户端长期缺少的功能的访问，包括“会话线程、Twets中的投票结果、配置文件上的固定Twets、垃圾邮件过滤，以及更强大的流过滤和搜索查询语言”。它还可以访问实时推文流，而不是强迫第三方在提供新推文之前等待。\n这应该意味着，在APIv2发布后，第三方Twitter客户端，如Tweetbot和Twitderfect可以开始集成这些功能，尽管有一些警告。\n最大的问题是Twitter正在按照三个层次重组其API访问。今天只推出了基本的免费级别，这限制了开发人员可以进行的API调用次数(也就是他们的软件可以ping Twitter获取数据的频率)。下一级别的访问，Twitter称之为“提升”，将不会有同样的限制，但它会让用户付出代价，Twitter目前还没有宣布定价。不过，该公司确实表示，预计其平台上80%的开发人员的需求将由基本层满足。\nTwitter母公司IconFactory的联合创始人盖德·马休(Ged Maheux)告诉The Verge，在分享细节之前，很难说第三方客户会发生什么变化。他说，新的API“对第三方Twitter客户来说可能非常好”，但IconFactory正在采取“观望”的方式，直到他们知道细节，特别是定价。\n但Maheux表示，Twitter对开发者采取的和解方式也给他和他的同事留下了深刻印象。“在过去的几年里，Twitter表现不佳，他们知道这一点。但他们完全认识到并承认了这一点。“他说。“在推特上做了这么长时间的三四等公民之后，这让人耳目一新。”\n不过，新的API不仅仅是第三方Twitter客户端。一系列业务和服务都依赖于对Twitter数据的访问，包括Spiketrap和Social Market Analytics等分析公司，上议院Hansard机器人和Emoji Mashup机器人等一次性机器人，以及TweetDelete、Block Party和Tokimeki UnFollow等超级用户工具。Twitter还为研究大规模社会趋势的学者提供了令人难以置信的丰富数据来源。研究人员将Twitter的API用于各种目的，从测量推文的洪水水位到跟踪在线仇恨言论的传播。\nTwitter表示，它希望通过让其API生态系统更容易访问来鼓励更多这类应用程序。例如，新的入职向导将第三方获得API密钥所需填写的字段数量从10个减少到1个，而用于查找支持文档的新搜索工具和新的集中支持页面将使开发人员在需要帮助时更容易找到帮助。\n正如Twitter的Alyssa Reese在一篇关于这些变化的博客文章中所说的那样：“你看，我们希望开发人员在谈论我们的文档时变得目瞪口呆。拥有如此有用的错误消息几乎就像在邮件中收到一封手写的信一样令人愉快。我们的目标是成为一家其他开发者平台在寻找灵感时可以参考的公司(我们知道我们还有很长的路要走)。“。\n统一API访问也应该对用户有所帮助。此前，Twitter的API分为三个平台：标准版(免费)、高级版(自助付费)和企业版(定制付费)。但正如Twitter自己承认的那样，这些层之间的迁移是“单调乏味的”。新的API用单一平台中的“产品跟踪”取代了这些级别，然后将这些产品拆分成上述不同的访问级别。\n尽管APIv2无疑是Twitter的一次重大发布，但该公司强调这是一项正在进行中的工作。它将当前阶段称为“早期访问”，以强调API不断发展的本质，并鼓励开发人员审视其新的公共路线图，并提供他们对即将到来的功能的想法。因此，Twitter认识到，修复任何陷入困境的关系都是从对话开始的。", "note_en": "Twitter is making it easier for businesses, academics, and third-party developers to build on its platform with the  launch of its API v2 today. The company announced the new API  last month, but as the news arrived the day after it was hit by one of the most devastating  hacks in social media history, it decided to delay the launch. Notably, Twitter is presenting the API v2 not only as a way to deliver new features faster, but as something of a reset in its long and fractious relationship with the app’s developer community.\n The API v2 is the first complete rebuild of Twitter’s API since 2012, when the company famously  began limiting how third-party developers could build on its product. Prior to this, outside developers could more or less replicate and customize the Twitter experience in their own clients. But as Twitter focused more on its  advertising business, it apparently decided it didn’t want to split its user base. It began slowly squeezing out third-party devs, blocking them from new features like polls and group DMs, and shepherding users toward the company’s own apps. Businesses were  killed and developers  weren’t happy.\n Now, though, Twitter is trying to rebuild some of these bridges. The API v2 offers third-party developers access to features long absent from their clients, including “conversation threading, poll results in Tweets, pinned Tweets on profiles, spam filtering, and a more powerful stream filtering and search query language.” There’s also access to a real-time tweet stream, rather than forcing third parties to wait before serving new tweets.\n This should mean that, following the API v2 launch, third-party Twitter clients like Tweetbot and Twitterrific can begin integrating these features, though there are some caveats.\n The big is one is that Twitter is reorganizing its API access along three levels. Only the basic, free level is launching today, and that has limits on how many API calls developers can make (aka how frequently their software can ping Twitter for data). The next level of access, which Twitter is calling “elevated,” won’t have the same restrictions, but it will cost users, and Twitter isn’t announcing pricing just yet. The company does say, though, that it expects 80 percent of developers on its platform will have their needs met by the basic tier.\n   Before the details are shared, it’s difficult to say what changes will happen to third-party clients, Ged Maheux, co-founder of Twitterific’s parent company Iconfactory, tells  The Verge. He says the new API is “potentially very good for third party Twitter clients,” but that Iconfactory is taking a “wait and see” approach until they know details, particularly pricing.\n But Maheux says he and his colleagues have also been impressed by Twitter’s conciliatory approach to developers. “Over the last few years, Twitter hasn’t been great and they know it. But they fully recognize and admit it,” he says. “After so long being a third or fourth class citizen with Twitter, it’s refreshing.”\n The new API is about more than just third-party Twitter clients, though. A whole range of businesses and services depend on access to Twitter’s data, including analytics firms like  Spiketrap and  Social Market Analytics, single-use bots like the  House of Lords Hansard bot and  Emoji Mashup bot, and power-user tools like  TweetDelete,  Block Party, and  Tokimeki Unfollow. Twitter also offers an incredibly rich source of data for academics studying large-scale social trends. Researchers uses Twitter’s API for a variety of purposes, from  gauging flood levels from tweets to tracking the spread of  online hate speech.\n Twitter says it wants to encourage more of these sorts of applications by making its API ecosystem more accessible. A new onboarding wizard, for example, reduces the number of fields third parties have to fill out to get their hands on API keys from 10 to just one, while new search tools to find support documentation and a new centralized support page will make it easier for developers to find help when they need it.\n As Twitter’s Alyssa Reese put it in a blog post on the changes: “You see, we want developers to get moon-eyed when they talk about our documentation. To have error messages that are so helpful they’re almost as pleasant as getting a handwritten letter in the mail. Our aim is to be a company that other developer platforms reference when they are looking for inspiration (and we know we have a way to go).”\n Unifying API access should also help users. Previously, Twitter’s API was split into three platforms: standard (free), premium (self-serve paid), and enterprise (custom paid). But as Twitter itself admits, migration between these tiers was “tedious.” The new API replaces these tiers with “product tracks” in a single platform, with these products then split into the different tiers of access described above.\n Although the API v2 is undoubtedly a big launch for Twitter, the company is stressing that it’s a work in progress. It’s calling the current phase “early access” to emphasize the evolving nature of the API, and it’s encouraging developers to look over its new  public roadmap and offer their thoughts on upcoming features. Twitter, then, is recognizing that fixing any troubled relationship starts with a conversation.", "posttime": "2020-08-13 05:06:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,推特,api,twitter", "title": "推特推出API v2，这是自2012年以来首次完全重建其API，以求改善与第三方开发商的关系", "title_en": "Twitter launches API v2, the first complete rebuild of its API since 2012, in a bid to improve relations with third-party developers", "transed": 1, "url": "https://www.theverge.com/2020/8/12/21364644/twitter-api-v2-new-access-tiers-developer-portal-support-developers?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["开发", "推特", "api", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017790, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于我们对一些内容进行了四舍五入，您可能会认为我们太懒了，更仔细的分析会得出更严格的上限。但事实上，我们的上限是精确的：N位除法的幻数可能真的需要像N+1位一样大。好消息是，对于特定的除数，可能会有更小的数字适合N位。稍后会详细介绍这一点！在任何情况下，我们现在都有了幻数m。要执行除法，我们需要尽可能高效地计算$\\lFloor\\frac{mn}{2^k}\\rFloor$。M是一个33位的数字，那么32位处理器如何有效地乘以它呢？一种方法是使用bignum库，但那太慢了。更好的方法是乘以低32位，并特殊处理第33位，如下所示：$$\\BEGIN{ALIGN}m n&amp；=(m-2^{32}+2^{32})n\\\\&amp；=(m-2^{32})n+2^{32}n\\end{Align}$$这看起来非常有希望：m-232绝对是一个32位数字。此外，我们可以很容易地计算出那个232n项：我们甚至不需要移位，只需将n加到乘积的高位字即可。不幸的是，它是不正确的：32位数字乘以33位数字等于65位，因此加法溢出。但我们可以通过以下技巧在分母中分配一个2来防止溢出：$$\\Begin{Align}\\lFloor\\frac{n+q}{2^k}\\rFloor&amp；=\\lFloor\\frac{n-q+2q}{2^k}\\rFloor\\\\&amp；=\\lFloor(\\frac{n-q+2q}2)/{2^{k-1}}\\rFloor\\\\&amp；=\\lFloor(\\lFloor\\frac{n-q}2\\rFloor+q)/{2^{k-1}}\\rFloor\\end{Align}$$这里q是幻数(减去第33位)乘以n，而n正好是分子n。(所有内容都应该乘以232，但这在某种程度上是隐含的，因为我们是在包含高乘积的寄存器中工作，所以我们可以忽略它。)。减法n-q可以下溢吗？不是，因为q正好是32位幻数的n倍，然后除以232。幻数(现在没有第33位)小于232，所以我们有q&lt；n，所以n-q不能下溢。那个+Q怎么样？那会溢出吗？不，因为我们只需抛出地板就可以得到$\\frac{n+q}2$的上限，这是一个32位的数字。所以我们有一个实用的算法。给定被除数n和固定除数d，其中0&lt；d&lt；2 32和0≤n&lt；2 32：预计算$p=\\lceil log_2d\\rceil$预计算$m=\\lceil\\frac{2^{32+p}}d\\rceil$。这将是一个33位的数字，因此只保留低32位。\n计算$q=(m\\x n)\\gg 32$。大多数处理器使用一条高乘法指令就可以做到这一点。\nCOMPUTE$t=((n-q)\\gg2)+q$，这是一种溢出安全的计算(n+q)≫1的方法。此额外加法将更正删除m的第33位。\n就是这样！我们知道如何有效地用乘法代替除法。我们可以看到所有这些步骤都在起作用。以下是Clang为除以7生成的程序集，以及我的注释：_DIVIDE_BY_7：MOVL$613566757，%ecx 613566757是(2**35)/7的低32位，向上舍入movl%edi，%eax mull%ecx将被除数乘以幻数subl%edx，%edi除以%edx中的被除数减去乘积的高32位(%eax具有低)，srl%edi初始移位为1以防止溢出。%eax将结果移入返回寄存器SHRL$2，%eax最后的楼层右移(log_2(7))ret。\n对于一般情况，这个算法是我们所能做的最好的，但是对于某些因子，我们也许能够改进这个算法。关键是e项：我们为得到d的下一个倍数而添加的值。我们推断e小于d，因此我们使用$\\frac e d&lt；1$作为e的上限。但是，d的倍数可能仅略大于2的幂。在这种情况下，e将是小的，如果我们幸运的话，它将小到足以将整个错误项推到$\\frac 1 d$以下。例如，让我们尝试除数11。使用常规算法，我们需要$k=32+\\lceil log_2 11\\rceil=36$。但是如果我们选择k=35呢？235+1是11的倍数，所以我们有e=1，我们计算：$\\frac e d\\Times\\frac n{2^k}=\\frac 1d\\Times\\frac n{2^{35}}&lt；\\frac 1d$所以k=35强制误差项小于$\\frac 1d$，因此k=35是一个足够好的近似值。这是个好消息，因为然后$m=\\lceil\\frac{2^{35}}{11}\\rceil=3123612579&lt；2^{32}$，所以我们的幻数适合32位，我们不需要担心溢出！我们可以避免一般算法中的减法、加法和额外移位。实际上，clang输出：_divide_by_11：movl$-1171354717，%ecx movl%edi，%eax mull%ecx movl%edX，%eax shl$3，%eax ret。\n除以11的代码比除以7的代码要短，因为11的倍数恰好非常接近2的幂。这说明了改进算法的方法：我们可以简单地尝试2的连续幂，", "note_en": "Since we rounded some stuff, you might think that we were too lazy and a more careful analysis would produce a tighter upper bound. But in fact our upper bound is exact: the magic number for an N-bit division really may need to be as large as N+1 bits. The good news is, there may be smaller numbers that fit in N bits for specific divisors. More on that later!   In any case, we now have our magic number m. To perform the division, we need to compute $ \\lfloor \\frac {m n} {2^k} \\rfloor$ as efficiently as possible. m is a 33 bit number, so how can a 32 bit processor efficiently multiply by that? One way would be to use a bignum library, but that would be too slow. A better approach is to multiply by the low 32 bits, and handle the 33rd bit specially, like this: $$\\begin{align} m n &amp; = (m - 2^{32} + 2^{32})n \\\\&amp; = (m - 2^{32})n + 2^{32} n \\end{align}$$ This looks very promising: m - 2 32 is definitely a 32 bit number. Furthermore, we can compute that 2 32n term very easily: we don&#39;t even need to shift, just add n to the high word of the product. Unfortunately, it&#39;s not right: a 32 bit number times a 33 bit number is 65 bits, so the addition overflows. But we can prevent the overflow by distributing one of the 2s in the denominator, through the following trick:$$ \\begin{align} \\lfloor \\frac {n + q} {2^k} \\rfloor &amp; = \\lfloor \\frac {n - q + 2q} {2^k} \\rfloor \\\\ &amp; = \\lfloor ( \\frac {n - q + 2q} 2 ) / {2^{k-1}} \\rfloor \\\\&amp; = \\lfloor ( \\lfloor \\frac {n - q} 2 \\rfloor + q ) / {2^{k-1}} \\rfloor \\end{align} $$ Here q is the magic number (minus that 33rd bit) times n, and n is just n, the numerator. (Everything should be multiplied by 2 32, but that&#39;s sort of implicit in the fact that we are working in the register containing the high product, so we can ignore it.) Can the subtraction n - q underflow? No, because q is just n times the 32 bit magic number, and then divided by 2 32. The magic number (now bereft of its 33rd bit) is less than 2 32, so we have q &lt; n, so n - q cannot underflow. What about that +q? Can that overflow? No, because we can just throw out the floor to get an upper bound of $\\frac {n + q} 2$ which is a 32 bit number. So we have a practical algorithm. Given a dividend n and a fixed divisor d, where 0 &lt; d &lt; 2 32 and 0 ≤ n &lt; 2 32: Precompute $p = \\lceil log_2 d \\rceil$ Precompute $m = \\lceil \\frac {2^{32 + p}} d \\rceil$. This will be a 33 bit number, so keep only the low 32 bits.\n Compute $q = (m \\times n) \\gg 32$. Most processors can do this with one &#34;high multiply&#34; instruction.\n Compute $t = ((n - q) \\gg 2) + q$, which is an overflow-safe way of computing (n + q) ≫ 1. This extra addition corrects for dropping the 33rd bit of m.\nThat&#39;s it! We know how to efficiently replace division with multiplication. We can see all these steps in action. Here is the assembly that Clang generates for division by 7, along with my commentary: _divide_by_7: movl $613566757, %ecx  613566757 is the low 32 bits of (2**35)/7, rounded up movl %edi, %eax mull %ecx  Multiply the dividend by the magic number subl %edx, %edi  The dividend minus the high 32 bits of the product in %edx (%eax has the low) shrl %edi  Initial shift by 1 to prevent overflow addl %edx, %edi  Add in the high 32 bits again, correcting for the 33rd bit of the magic number movl %edi, %eax  Move the result into the return register shrl $2, %eax  Final shift right of floor(log_2(7)) ret\n   This algorithm is the best we can do for the general case, but we may be able to improve on this for certain divisors. The key is that e term: the value we add to get to the next multiple of d. We reasoned that e was less than d, so we used $\\frac e d &lt; 1$ as an upper bound for e. But it may happen that a multiple of d is only slightly larger than a power of 2. In that case, e will be small, and if we&#39;re lucky, it will be small enough to push the entire &#34;error term&#34; under $\\frac 1 d$. For example, let&#39;s try it for the divisor 11. With the general algorithm, we would need $k = 32 + \\lceil log_2 11 \\rceil = 36$. But what if we choose k = 35 instead? 2 35 + 1 is a multiple of 11, so we have e = 1, and we compute: $\\frac e d \\times \\frac n {2^k} = \\frac 1 d \\times \\frac n {2^{35}} &lt; \\frac 1 d$ So k = 35 forces the error term to be less than $\\frac 1 d$, and therefore k = 35 is a good enough approximation. This is good news, because then $m = \\lceil \\frac {2^{35}} {11} \\rceil = 3123612579 &lt; 2^{32}$, so our magic number fits in 32 bits, and we don&#39;t need to worry about overflow! We can avoid the subtraction, addition, and extra shifting in the general algorithm. Indeed, clang outputs: _divide_by_11: movl $-1171354717, %ecx movl %edi, %eax mull %ecx movl %edx, %eax shrl $3, %eax ret\n The code for dividing by 11 is shorter than for dividing by 7, because a multiple of 11 happens to be very close to a power of 2. This shows the way to an improved algorithm: We can simply try successive powers of 2, from 32 up to $32 + \\lfloor log_2 d \\rfloor$, and see if any of them happen to be close enough to a multiple of d to force the error term below $\\frac 1 d$. If so, the corresponding magic number fits in 32 bits and we can generate very efficient code. If not, we can always fall back to the general algorithm. The power 32 will work if $\\frac e d \\leq \\frac 1 d$, the power 33 will work if $\\frac e d \\leq \\frac 2 d$, the power 34 will work if $\\frac e d \\leq \\frac 4 d$, etc., up to $32 + \\lfloor log_2 d \\rfloor$, which will work if $\\frac e d \\leq \\frac 1 2$. By &#34;chance&#34;, we&#39;d expect this last power to work half the time, the previous power to work 25% of the time, etc. Since we only need one, most divisors actually should have an efficient, 32 bit or fewer magic number. The infinite series $\\frac 1 2 + \\frac 1 4 + \\frac 1 8$ sums to 1, so our chances get better with increasing divisors. It&#39;s interesting to note that if a divisor d has one of these more efficient magic numbers for a power $k &lt; 32 + \\lceil log_2 d \\rceil$, it also has one for all higher powers. This is easy to see: if 2 k + e is a multiple of d, then 2 k+1 + 2e is also a multiple of d.  $\\frac e d \\times \\frac n {2^k} \\leq \\frac 1 d \\implies \\frac {2e} d \\times \\frac n {2^{k+1}} \\leq \\frac 1 d $ This is good news. It means that we only have to check one case, $ \\lceil \\frac {2^{32 + \\lfloor log_2 d \\rfloor}} d \\rceil$ (a 32 bit value) to see if there is a more efficient magic number, because if any smaller power works, that one works too. If that that power fails, we can go to the 33 bit number, which we know must work. This is useful information in case we are computing magic numbers at runtime. Still, gcc and LLVM don&#39;t settle for just any magic number - both try to find the  smallest magic number. Why? There&#39;s a certain aesthetic appeal in not using bigger numbers than necessary, and most likely the resulting smaller multiplier and smaller shifts are a bit faster. In fact, in a very few cases, the resulting shift may be zero! For example, the code for diving by 641:  No shifts at all! For this to happen, we must have $\\frac e d \\le \\frac 1 d$, which of course means that e = 1, so 641 must evenly divide 2 32 + 1. Indeed it does. This inspires a way to find the other &#34;super-efficient&#34; shiftless divisors: compute the factors of 2 32 + 1. Sadly, the only other factor is 6700417. I have yet to discover an occasion to divide by this factor, but if I do, I&#39;ll be ready.  Did you skip ahead? It&#39;s OK. Here&#39;s the summary.Every divisor has a magic number, and most have more than one! A magic number for  d is nothing more than a precomputed quotient: a power of 2 divided by  d and then rounded up. At runtime, we do the same thing, except backwards: multiply by this magic number and then divide by the power of 2, rounding down. The tricky part is finding a power big enough that the &#34;rounding up&#34; part doesn&#39;t hurt anything. If we are lucky, a multiple of  d will happen to be only slightly larger than a power of 2, so rounding up doesn&#39;t change much and our magic number will fit in 32 bits. If we are unlucky, well, we can always fall back to a 33 bit number, which is almost as efficient. I humbly acknowledge the legendary  Guy Steele  Henry Warren (must have been a while) and his book Hacker&#39;s Delight, which introduced me to this line of proof. (Except his version has, you know, rigor.)", "posttime": "2020-08-13 05:05:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "劳动,labor,frac", "title": "“师的劳动”(2010)", "title_en": "Labor of Division (2010)", "transed": 1, "url": "http://ridiculousfish.com/blog/posts/labor-of-division-episode-i.html", "via": "", "real_tags": ["劳动", "labor", "frac"]}, {"category": "", "categoryclass": "", "imagename": "ffa1f28b43b4c15785cffa300db7ed34.jpg", "infoid": 1017789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在全世界都在等待疫苗来控制新冠肺炎大流行的时候，加州大学旧金山分校的科学家们设计了一种新的方法来阻止导致这种疾病的SARS-CoV-2病毒的传播。\n在加州大学旧金山分校研究生迈克尔·肖夫(Michael Schoof)的带领下，一组研究人员设计了一种完全合成的、随时可以生产的分子，它紧紧地包裹着关键的SARS-CoV-2机制，使病毒能够感染我们的细胞。据一篇新论文报道，该论文现已在预印服务器BioRxiv上获得，使用活病毒进行的实验表明，该分子是迄今发现的最有效的SARS-CoV-2抗病毒药物之一。\n在他们测试的一种被研究人员称为“AeroNabs”的气雾剂配方中，这些分子可以通过鼻腔喷雾器或吸入器自行给药。每天使用一次，AeroNabs可以提供强大、可靠的保护，防止SARS-CoV-2，直到有疫苗可用。研究小组正在与商业合作伙伴积极讨论，以加强AeroNabs的制造和临床测试。如果这些测试成功，科学家们的目标是让AeroNabs作为一种廉价的非处方药广泛使用，以预防和治疗新冠肺炎。\n加州大学旧金山分校生物化学和生物物理学教授、霍华德·休斯医学研究所研究员彼得·沃尔特博士说：“航空纳布比可穿戴形式的个人防护装备更有效，我们认为它是个人防护装备的一种分子形式，在疫苗为新冠肺炎提供更永久的解决方案之前，它可以作为一个重要的权宜之计。”沃尔特博士是加州大学旧金山分校的生物化学和生物物理学教授，也是霍华德·休斯医学研究所的研究员。沃尔特补充说，对于那些无法获得或对SARS-CoV-2疫苗没有反应的人来说，AeroNab可能是对抗新冠肺炎的一条更持久的防线。\n“我们召集了一群才华横溢的生物化学家、细胞生物学家、病毒学家和结构生物学家，在短短几个月内完成了这个项目，”沃尔特实验室成员、AeroNabs共同发明人肖夫说。\n尽管AeroNabs完全是在实验室中设计的，但它的灵感来自纳米体，即天然存在于骆驼、骆驼和相关动物中的抗体样免疫蛋白。自从20世纪80年代末在比利时的一个实验室发现纳米物体以来，纳米物体的独特性质引起了世界各地的科学家的兴趣。\n“虽然它们的功能与人类免疫系统中的抗体非常相似，但纳米体为有效治疗SARS-CoV-2提供了一些独特的优势，”共同发明人、医学博士阿希什·曼利克(Aashish Manglik)解释说。他是药物化学助理教授，经常使用纳米体作为他研究穿过细胞膜发送和接收信号的蛋白质的结构和功能的工具。\n例如，纳米抗体比人类抗体小一个数量级，这使得它们更容易在实验室中进行操作和修改。它们的体积小，结构相对简单，也使它们比其他哺乳动物的抗体更稳定。此外，与人类抗体不同的是，纳米体可以容易且廉价地批量生产：科学家将包含构建纳米体的分子蓝图的基因插入大肠杆菌或酵母中，并将这些微生物转化为高产量的纳米体工厂。几十年来，同样的方法已经被安全地用于批量生产胰岛素。\n但正如曼里克指出的那样，“纳米体只是我们的起点。虽然它们本身很有吸引力，但我们认为我们可以通过蛋白质工程来改进它们。这最终导致了AeroNabs的发展。“。\nSARS-CoV-2依靠其所谓的尖峰蛋白感染细胞。这些刺钉住了病毒的表面，在电子显微镜下观察时呈现出一种冠状的外观-因此，包括SARS-CoV-2在内的病毒家族被称为“冠状病毒”。然而，尖峰不仅仅是一种装饰--它们是让病毒进入我们细胞的关键。\n就像可伸缩的工具一样，钉子可以从关闭的非活动状态切换到打开的活动状态。当病毒颗粒的大约25个刺激物中的任何一个变得活跃时，该刺激物的三个“受体结合域”或RBD就会暴露出来，并准备附着到ACE2(发音为“ACE2”)上，ACE2是一种发现于人类细胞上的受体，排列在肺部和气道内。\n通过ACE2受体和尖峰RBD之间类似锁和钥匙的相互作用，病毒进入细胞，在那里它将其新宿主转变为冠状病毒制造商。研究人员认为，如果他们能找到阻碍Spike-ACE2相互作用的纳米体，就可以防止病毒感染细胞。\n为了找到有效的候选者，科学家们分析了曼利克实验室最近开发的一个包含20多亿个合成纳米体的库。经过连续几轮的测试，在此期间，他们施加了越来越严格的标准来排除软弱或无效的候选者，科学家们最终得到了21个纳米体，它们阻止了一种修饰形式的尖峰与ACE2相互作用。\n进一步的实验，包括使用冷冻电子显微镜来可视化纳米体-钉子界面，表明最有效的纳米体通过强烈地将自己直接附着在钉子RBDS上而阻止了钉子-ACE2的相互作用。这些纳米体的功能有点像覆盖RBD“钥匙”的护套，防止它被插入到ACE2“锁”中。\n有了这些发现，研究人员仍然需要证明这些纳米抗体可以防止真正的病毒感染细胞。巴黎巴斯德研究所Marco Vignuzzi博士实验室的病毒学家Veronica Rezelj博士测试了三种最有希望的针对活体SARS-CoV-2的纳米抗体，发现纳米抗体非常有效，即使在极低的剂量下也能防止感染。然而，这些纳米体中最有效的不仅充当RBDS的外壳，而且像一个分子捕鼠器，在关闭、不活跃的状态下抑制SPEK，这就增加了一层额外的保护，防止导致感染的SPEK-ACE2相互作用。\n然后，科学家们以多种方式设计了这种双重作用的纳米体，使其成为一种更有效的抗病毒药物。在一组实验中，他们突变了纳米体中与Spike接触的每一个氨基酸组成块，以发现两个特定的变化，这两个变化导致效价增加了500倍。\n在另一组单独的实验中，他们设计了一种可以将三个纳米体连接在一起的分子链。正如所提到的，每个刺突蛋白都有三个RBD，其中任何一个都可以与ACE2结合，使病毒进入细胞。研究人员设计的连接的三个纳米体确保了，如果一个纳米体附着在RBD上，其他两个纳米体就会附着在剩余的RBD上。他们发现，这三个纳米体的效力是单个纳米体的20万倍。\n沃尔特说，当他们利用这两种修饰的结果，将三个强大的突变纳米体连接在一起时，结果“超出了图表”。“它是如此有效，超出了我们衡量其效力的能力。”\n在最后一组实验中，研究人员对由三部分组成的纳米体进行了一系列压力测试，将它们置于高温下，将它们变成稳定货架的粉末，并制成气溶胶。这些过程中的每一个都对大多数蛋白质具有高度的破坏性，但科学家们证实，由于纳米体的固有稳定性，雾化形式的抗病毒效力没有损失，这表明AeroNabs是一种有效的SARS-CoV-2抗病毒药物，通过货架稳定的吸入器或鼻喷剂给药可能是可行的。\n“我们并不是唯一认为AeroNab是一项了不起的技术的人，”Manglik说。我们的团队正在与对制造和分销AeroNab感兴趣的潜在商业合作伙伴进行谈判，我们希望很快就能开始人体试验。如果AeroNabs被证明像我们预期的那样有效，它们可能有助于重塑世界范围内大流行的进程。“。\n作者：其他作者包括布莱恩·福斯特(Bryan Faust)、鲁本·A·桑德斯(Ruben A.Saunders)、Smriti Sangwan、尼克·霍普(Nick Hoppe)、摩根·布恩(Mgane Boone)、克里斯蒂安·贝莱斯布勒(Christian Bache Billesbølle)、马塞尔·齐曼尼(Marcell Zimani)、伊山·德什潘德(Ishan Deshpande)、梁家豪、阿迪娅·A·阿南德(Aditya A.Anand)、尼夫·多布津斯基(Niv Dobzinski)、贝丝·肖莎娜·查(Beth Shoshana Zha)、本杰明·巴尔西-莱恩(Benj。西奈山伊坎医学院的Kris M White和Adolfo García-Sastre，以及QBI冠状病毒研究小组结构生物学联合会。Schoof、Faust、Saunders、Sangwan和Rezelj是该手稿的第一作者之一。\n资助：这项工作得到了加州大学洛杉矶分校新冠肺炎响应基金的支持，这是艾伦公司的一项拨款，以及在桑德勒基金会的支持下建立的加州大学洛杉矶分校突破性生物医学研究计划的支持者。其他支助包括：美国国立卫生研究院拨款DP5OD023048、S10OD020054、S10OD021741、1R01GM126218；卓越实验室拨款ANR-10-LABX-62-IBEID；紧急新冠肺炎巴斯德研究所筹款活动；美国能源部科学办公室和生物与环境研究办公室合同DE-AC02-05CH11231；a Helen Ha。\n披露：Schoof、Faust、Saunders、Hoppe、Walter和Manglik是一项临时专利的发明人，该临时专利描述了手稿中描述的反钉纳米体。\n加州大学旧金山分校(UCSF)专门专注于健康科学，致力于通过先进的生物医学研究、生命科学和健康专业的研究生水平教育以及患者护理方面的卓越表现，在全球范围内促进健康。UCSF Health是加州大学旧金山分校的主要学术医疗中心，包括一流的专科医院和其他临床项目，并在整个旧金山湾区设有分支机构。", "note_en": "As the world awaits vaccines to bring the COVID-19 pandemic under control, UC San Francisco scientists have devised a novel approach to halting the spread of SARS-CoV-2, the virus that causes the disease.\n Led by UCSF graduate student Michael Schoof, a team of researchers engineered a completely synthetic, production-ready molecule that straitjackets the crucial SARS-CoV-2 machinery that allows the virus to infect our cells. As reported in a new paper,  now available on the preprint server bioRxiv, experiments using live virus show that the molecule is among the most potent SARS-CoV-2 antivirals yet discovered.\n In an aerosol formulation they tested, dubbed “AeroNabs” by the researchers, these molecules could be self-administered with a nasal spray or inhaler. Used once a day, AeroNabs could provide powerful, reliable protection against SARS-CoV-2 until a vaccine becomes available. The research team is in active discussions with commercial partners to ramp up manufacturing and clinical testing of AeroNabs. If these tests are successful, the scientists aim to make AeroNabs widely available as an inexpensive, over-the-counter medication to prevent and treat COVID-19.\n “Far more effective than wearable forms of personal protective equipment, we think of AeroNabs as a molecular form of PPE that could serve as an important stopgap until vaccines provide a more permanent solution to COVID-19,” said AeroNabs co-inventor  Peter Walter, PhD, professor of biochemistry and biophysics at UCSF and a Howard Hughes Medical Institute Investigator. For those who cannot access or don’t respond to SARS-CoV-2 vaccines, Walter added, AeroNabs could be a more permanent line of defense against COVID-19.\n “We assembled an incredible group of talented biochemists, cell biologists, virologists and structural biologists to get the project from start to finish in only a few months,” said Schoof, a member of the Walter lab and an AeroNabs co-inventor.\n     Though engineered entirely in the lab, AeroNabs were inspired by nanobodies, antibody-like immune proteins that naturally occur in llamas, camels and related animals. Since their discovery in a Belgian lab in the late 1980s, the distinctive properties of nanobodies have intrigued scientists worldwide.\n  “Though they function much like the antibodies found in the human immune system, nanobodies offer a number of unique advantages for effective therapeutics against SARS-CoV-2,” explained co-inventor  Aashish Manglik, MD, PhD, an assistant professor of pharmaceutical chemistry who frequently employs nanobodies as a tool in his research on the structure and function of proteins that send and receive signals across the cell’s membrane.\n For example, nanobodies are an order of magnitude smaller than human antibodies, which makes them easier to manipulate and modify in the lab. Their small size and relatively simple structure also makes them significantly more stable than the antibodies of other mammals. Plus, unlike human antibodies, nanobodies can be easily and inexpensively mass-produced: scientists insert the genes that contain the molecular blueprints to build nanobodies into E. coli or yeast, and transform these microbes into high-output nanobody factories. The same method has been used safely for decades to mass-produce insulin.\n But as Manglik noted, “nanobodies were just the starting point for us. Though appealing on their own, we thought we could improve upon them through protein engineering. This eventually led to the development of AeroNabs.”\n  SARS-CoV-2 relies on its so-called spike proteins to infect cells. These spikes stud the surface of the virus and impart a crown-like appearance when viewed through an electron microscope – hence the name “coronavirus” for the viral family that includes SARS-CoV-2. Spikes, however, are more than a mere decoration – they are the essential key that allows the virus to enter our cells.\n Like a retractable tool, spikes can switch from a closed, inactive state to an open, active state. When any of a virus particle’s approximately 25 spikes become active, that spike’s three “receptor-binding domains,” or RBDs, become exposed and are primed to attach to ACE2 (pronounced “ace two”), a receptor found on human cells that line the lung and airway.\n     Through a lock-and-key-like interaction between an ACE2 receptor and a spike RBD, the virus gains entry into the cell, where it then transforms its new host into a coronavirus manufacturer. The researchers believed that if they could find nanobodies that impede spike-ACE2 interactions, they could prevent the virus from infecting cells.\n  To find effective candidates, the scientists parsed a recently developed library in Manglik’s lab of over 2 billion synthetic nanobodies. After successive rounds of testing, during which they imposed increasingly stringent criteria to eliminate weak or ineffective candidates, the scientists ended up with 21 nanobodies that prevented a modified form of spike from interacting with ACE2.\n  Further experiments, including the use of  cryo-electron microscopy to visualize the nanobody-spike interface, showed that the most potent nanobodies blocked spike-ACE2 interactions by strongly attaching themselves directly to the spike RBDs. These nanobodies function a bit like a sheath that covers the RBD “key” and prevents it from being inserted into an ACE2 “lock.”\n With these findings in hand, the researchers still needed to demonstrate that these nanobodies could prevent the real virus from infecting cells. Veronica Rezelj, PhD, a virologist in the lab of Marco Vignuzzi, PhD, at Institut Pasteur in Paris, tested the three most promising nanobodies against live SARS-CoV-2, and found the nanobodies to be extraordinarily potent, preventing infection even at extremely low doses.   The most potent of these nanobodies, however, not only acts as a sheath over RBDs, but also like a molecular mousetrap, clamping down on spike in its closed, inactive state, which adds an additional layer of protection against the spike–ACE2 interactions that lead to infection.\n  The scientists then engineered this double-action nanobody in a number of ways to make it into an even more potent antiviral. In one set of experiments, they mutated every one of the amino-acid building blocks of the nanobody that contacts spike to discover two specific changes that yielded a 500-fold increase in potency.\n  In a separate set of experiments, they engineered a molecular chain that could link three nanobodies together. As noted, each spike protein has three RBDs, any of which can attach to ACE2 to grant the virus entry into the cell. The linked triple nanobody devised by the researchers ensured that if one nanobody attaches itself to an RBD, the other two would attach to the remaining RBDs. They found that this triple nanobody is 200,000 times more potent than a single nanobody alone.\n And when they drew on the results of both modifications, linking three of the powerful mutated nanobodies together, the results were “off the charts,” said Walter. “It was so effective that it exceeded our ability to measure its potency.”\n   In a final set of experiments, the researchers put the three-part nanobodies through a series of stress tests, subjecting them to high temperatures, turning them into a shelf-stable powder, and making an aerosol. Each of these processes is highly damaging to most proteins, but the scientists confirmed that, thanks to the inherent stability of nanobodies, there was no loss of antiviral potency in the aerosolized form, suggesting that AeroNabs are a potent SARS-CoV-2 antiviral that could be practical to administer via a shelf-stable inhaler or nasal spray.\n “We’re not alone in thinking that AeroNabs are a remarkable technology,” said Manglik. “Our team is in ongoing discussions with potential commercial partners who are interested in manufacturing and distributing AeroNabs, and we hope to commence human trials soon. If AeroNabs prove as effective as we anticipate, they may help reshape the course of the pandemic worldwide.”\n Authors: Additional authors include Bryan Faust, Reuben A. Saunders, Smriti Sangwan, Nick Hoppe, Morgane Boone, Christian Bache Billesbølle, Marcell Zimanyi, Ishan Deshpande, Jiahao Liang, Aditya A. Anand, Niv Dobzinski, Beth Shoshana Zha, Benjamin Barsi-Rhyne, Vladislav Belyy, Silke Nock and Yuwei Liu of UCSF; Camille R. Simoneau, Kristoffer Leon, Nevan J. Krogan, Danielle L. Swaney and Melanie Ott of the UCSF Quantitative Biosciences Institute (QBI) and the J. David Gladstone Institutes; Andrew W. Barile-Hill of Cytiva Life Sciences; Sayan Gupta and Corie Y. Ralston of Lawrence Berkeley National Laboratory; Kris M White and Adolfo García-Sastre of the Icahn School of Medicine at Mount Sinai; and the QBI Coronavirus Research Group Structural Biology Consortium. Schoof, Faust, Saunders, Sangwan and Rezelj are co-first authors of the manuscript.\n Funding: This work was supported by the UCSF COVID-19 Response Fund, a grant from Allen &amp; Company, and supporters of the UCSF Program for Breakthrough Biomedical Research (PBBR), which was established with support from the Sandler Foundation. Other support included National Institutes of Health (NIH) grants DP5OD023048, S10OD020054, S10OD021741, 1R01GM126218; Laboratoire d’Excellence grant ANR-10-LABX-62-IBEID; the URGENCE COVID-19 Institut Pasteur fundraising campaign; the Office of Science and Office of Biological and Environmental Research of the U.S. Department of Energy under contract DE-AC02-05CH11231; a Helen Hay Whitney postdoctoral fellowship; the Alfred Benzon Foundation; a gift from the Roddenberry Foundation; the Howard Hughes Medical Institute; the Pew Charitable Trusts; the Esther A. &amp; Joseph Klingenstein Fund; and the Searle Scholars Program.\n Disclosures: Schoof, Faust, Saunders, Hoppe, Walter and Manglik are inventors on a provisional patent describing the anti-Spike nanobodies described in the manuscript.\n The University of California, San Francisco (UCSF) is exclusively focused on the health sciences and is dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care.  UCSF Health, which serves as UCSF’s primary academic medical center, includes  top-ranked specialty hospitals and other clinical programs, and has affiliations throughout the Bay Area.", "posttime": "2020-08-13 05:05:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阻挡,promise,科学家", "title": "“空中楼阁”承诺对新冠肺炎的强大、不可阻挡的保护", "title_en": "‘AeroNabs’ Promise Powerful, Inhalable Protection Against Covid-19", "transed": 1, "url": "https://www.ucsf.edu/news/2020/08/418241/aeronabs-promise-powerful-inhalable-protection-against-covid-19", "via": "", "real_tags": ["阻挡", "promise", "科学家"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017787, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推销未来很难，我们想象一下，有一项新发明比我们现在拥有的要好得多。“这款产品比其他任何东西都要好得多，你只需要把它拿给潜在客户看就能成交。这听起来很容易卖，对吧？”\n早在1987年，制造了第一台激光打印机的佳能公司做了一项研究，发现了两类人：一类是从未听说过激光打印机的人，另一类是激光打印机的所有者。激光打印机在产量、成本、速度、声音、大小、维护和纸张处理方面都比目前的打印机技术优越，以至于任何看过一台激光打印机的人都买了一台。佳能的销售队伍非常兴奋，直到他们了解到真正引起人们注意是多么困难。-作为一个经常看过激光打印机的人。\n你可能认为每个人都会对更好的方式持开放态度，但事实并非如此。我们都经常被奇迹产品的承诺搞得焦头烂额，以至于像优秀、新和更好这样的词都变成了牙膏形容词。但如果你真的有更好的东西怎么办？你实际上需要别人的关注。\n在20世纪90年代初，我有这样一个产品。在我的公司米拉数字出版公司(Mira Digital Publishing)，已经开发出一种收集、策划和编辑科学论文的方法，这种方法比目前的过程要好得多，以至于任何听说过它的人都会买下它。这真的不涉及销售，只有演示和握手。但获得一个新客户涉及到让某人首先考虑可能有更好的方法。这是很难的。\n当时我最沮丧的是运输工程师协会(Institute Of Transportation Engineers)。ITE是华盛顿特区的一个组织，它决定了高速公路弯道的最佳半径，或者做什么颜色的红色停车标志。我的产品可以为他们节省数百万美元，但经过一年半的尝试，我无法让他们看一看。我无法安排预约；电话被置若罔闻；电子邮件被忽视。即使是身体上的陌生电话也失败了-至少我的前三次失败了。然后有一天，我发现自己在街对面，我的电话被置若罔闻，电子邮件也被忽视了。即使是身体上的陌生电话也失败了-至少我的前三次失败了。然后有一天，我发现自己在街对面。\nITE的大堂很典型：在接待员的办公桌上，Cerberus的后进者把守着两扇玻璃门，一扇通往办公室，另一扇通往会议室。还有一张沙发和椅子，你可以坐在那里，然后被告知有人太忙了要见你。这是我第四次打陌生电话，但这一次宗教人士缺席了。我独自一人在大厅里看着一群女人在会议室里开着似乎是某种派对的东西。在长方形蛋糕送来之前，我有了一个疯狂的想法。\n我穿着与政府会面的西装，提着一个皮革公文包。然后我像一个严厉的老师走进混乱的教室一样走进会议室，没有微笑，没有任何表情。然后我把公文包放在桌子中间。然后我把收音机的拨号从办公室安全的成人当代音乐调到我能找到的最前卫的嘻哈音乐台。把音量调大！\n我还是一句话也没说。我只是开始跟着音乐磨练。我的听众开始有节奏地鼓掌。我开始脱掉衣服，从领带开始往下走。我把我的夹克扔给尖叫的女人；就在我脱下衬衫的时候，我盯着我的手表，一个小小的模拟Rado。\n我说，“天哪，我把我的工作搞混了！我其实是来卖软件的！“。\n大家都哈哈大笑起来。我表现得很尴尬，把衬衫要回来。当另一位女士从灯具上取下我的领带时，我说，“哦，是的，我是米拉数字出版公司的。我们开发了自动收集和审查技术论文的软件。我是来和你们老板谈谈的。“。\n三个女人穿过大厅跑到执行董事那里。她们真的把他拖进了房间，现在我终于引起了所有人的注意。我约好了下周穿着衣服回来，她们签了一份六位数的年薪合同。\n他们有同样的需求，在过去的18个月里，我们也有同样的解决方案；但在那段时间里，我从未引起他们的注意。“为了传递一个重要的信息，几个坏了的纽扣是一个很小的代价。", "note_en": "Selling the future is hard.   Imagine a new invention that is superior to what we have now.  This product is so much better than everything else that you only need to show it to a potential customer to close the sale.  Sounds easy to sell, right?\n Back in 1987 the Canon company, who built the first laserprinters, did a study and found two types of people:  those who had never heard of laser printers,and laser printer owners.  The laserprinter was so superior to current printer technology in output, cost, speed,sound, size, maintenance, and paper handling that anyone who had seen one hadalso bought one.  The Canon salesforcewas euphoric, until they learned just how difficult it was to actually getpeople’s attention.  As someone who hasoften failed to sell truly superior products, I understood their pain.\n You might think that everyone would be open to better ways,but not really.  We have all been burnedby promises of miracle products so often that words like  superior,  new,and  better have all just become toothpaste adjectives.  But what if you really do have somethingbetter?  You actually need someone’sattention.\n In the early 1990’s, I had such a product.  My company, Mira Digital Publishing, haddeveloped a way of collecting, curating, and editing scientific papers that wasso vastly superior to the current process that anyone who heard about it wouldbuy it.  There really was no sellinginvolved, just a demonstration and a handshake. But getting a new customer involved getting someone to first considerthat there might be a better way.  Andthat was hard.\n  My greatest frustration at the time was the Institute of Transportation Engineers.  The ITE was an organization in Washington DC that decided the optimal radius for a highway curve or what shade of red to make a stop sign.  My product would save them millions of dollars, but after a year and a half of attempts I could not get them to take a look.  I could not schedule an appointment; phone calls fell on deaf ears; emails were ignored.  Even physical cold-calls failed – at least my first three did.  Then one day I found myself across the street from ITE with two hours before my next appointment.  I decided to try again.\n The ITE lobby was typical: at the receptionist’s desk adescendant of Cerberus guarded two glass doors, one leading to the offices andanother to a conference room.  There wasalso a couch and chair where you could sit before being told that someone wastoo busy to see you. This was my fourth cold call, but this time thereceptionist was absent.  I was alone inthe lobby watching a group of women having what appeared to be some sort ofparty in the conference room. Before the rectangular piece of cake arrived, Ihad a crazy idea.\n I was wearing my meet-with-the-Government suit, and carryinga leather briefcase.  I walked into theconference room like a stern teacher entering a chaotic classroom, no smile, noexpression whatever.  I put my briefcasein the middle of the table.  Then I turnedthe radio dial from office-safe adult contemporary to the edgiest hip-hopstation I could find.  Volume UP!\n I still don’t say a word. I just start grinding to the music. My audience begins to claprhythmically. I start taking off my clothes, beginning with my necktie andworking my way down. I throw my jacket to the screaming women; and just as Irip my shirt off, I stare at my watch, a tiny analog Rado.\n   And I say, “Oh my god, I’ve got my jobs confused! I’mactually here to sell you software!”\n Everybody bursts out laughing. I act embarrassed and ask formy shirt back. As another lady is retrieving my necktie from the light fixtureI say, “Oh yeah, I’m here from Mira Digital Publishing. We make software thatautomates the collection and review of technical papers. I’m here to talk toyour boss.”\n Three women run down the hall to the executive director.They literally drag him into the room and now  I’ve finally got everyone’sattention.  I set an appointment tocome back fully clothed next week, and they sign a six-figure annualcontract.\n  They have the same needs and we have had the same solution for the past eighteen months; but during that time I never had their attention.  A few busted buttons is a small price to pay to deliver an important message.", "posttime": "2020-08-13 05:04:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "注意力,moments,激光打印机", "title": "注意力时刻", "title_en": "Moments of Attention", "transed": 1, "url": "https://www.jimmckelvey.com/moments-of-attention/", "via": "", "real_tags": ["注意力", "moments", "激光打印机"]}, {"category": "", "categoryclass": "", "imagename": "d84592b16b391e77925c9798029a374f.png", "infoid": 1017784, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CONDA INSTALL-y pytorch=1.5.0 torchvision=0.6.0cudatoolkit=10.2-c pytorchconda install opencvpip install\\open3d&gt；=0.10.0.0\\triesh&gt；=3.7.6\\pyquaternion&&gt;t；=0.9.5\\pytorch-lightning&&gt;t；=0.8.5\\pyender&&gt;；=0.1.43python-m pip install distron2-f https://dl.fbaipublicfiles.com/detectron2/wheels/cu102/torch1.5/index.html。\n(如果您在运行代码时遇到问题，请尝试使用指定的确切版本...。例如，pytorch-lightning API还没有稳定下来)。\n为了便于下载和快速推理，我们提供了一个小的样例场景，将数据下载并提取到DATAROOT中。目录结构应如下所示：\nDATAROOT└───Sample│└───Sample1││Intrinsics.txt│└───COLOR│││00000001.jpg│││00000002.jpg│││...│└───Pose││00000001.txt││00000002.txt││...。\n接下来，运行我们的数据准备脚本，该脚本将原始数据格式解析为我们常用的json格式(请注意，我们将分离的数据存储在一个单独的文件夹METAROOT中，以防止原始数据受到污染)。\n按照http://www.scan-net.org/.The提供的说明下载并解压缩扫描程序。目录结构应如下所示：\nDATAROOT└───SCANNET│└───扫描│|└───scene0000_00│|└───COLOR│|││0.jpg│|││1.jpg│|││...│|│...│└───SCANS_TEST│└───COLOR│││0.jpg│││1.jpg│││...││...。\n接下来，运行我们的数据准备脚本，该脚本将原始数据格式解析为我们常用的json格式(请注意，我们将分离的数据存储在一个单独的文件夹METAROOT中，以防止原始数据受到污染)。该脚本还使用TSDF Fusion生成基本事实TSDF。\n这将需要一段时间(乘坐8台Quadro RTX6000需要几个小时)……。如果您有多个GPU，则可以使用--i和--n标志并行运行。\nPython Prepare_data.py--path DATAROOT--path_meta METAROOT--DataSet scannet--i 0--n 4&amp；python preare_data.py--path DATAROOT--path_meta METAROOT--DataSet scannet--i 1--n 4&amp；python preare_data.py--path DATAROOT--path_meta METAROOT--DataSet scannet。\n请注意，如果您不打算进行培训，您可以使用--test标志只准备测试集。\n要使用您自己的数据，您需要将其放在与示例数据相同的格式中，或者实现您自己版本的类似sample.py的内容。之后，您可以修改prepare_data.py以准备数据。请注意，预先训练的模型使用Z-up度量坐标进行训练，并且不会泛化到其他坐标(这意味着在使用姿势之前必须解决SFM方向模糊性的比例和2个轴)。\n一旦您下载并准备好数据(如上所述)，您就可以使用我们预先训练的模型(下载)或通过培训您自己的模型(见下文)来运行推理。\n如果您的GPU没有足够的内存，您可以减少voxel_dim(以可能剪切场景为代价)。\n请注意，使用默认3D网络时，voxel_dim的值必须可以被8整除。\n请注意，valuate.py使用pyender从预测网格渲染深度贴图以进行2D求值。如果使用无头渲染，还必须设置环境变量PYOPENGL_PLATFORM=osmesa(有关详细信息，请参见pyender)。\n除了下载和准备数据(如上所述)之外，您还需要下载我们预先训练好的resnet50权重(从Detectron2移植)并解压缩它。\n通过混合使用config.yaml文件和命令行参数来控制配置。我们在configs/中提供了本文中使用的几个示例配置文件。实验名称由TRAINER.NAME和TRAINER.VERSION指定，它们默认为atlas和default。有关参数的完整列表，请参见config.py。\n我们还提供了使用COLMAP运行推理和评估的脚本。请注意，您必须安装COLMAP(包含在我们的docker映像中)。\n@inProcestions{murez2020atlas，title={Atlas：根据姿势图像进行端到端3D场景重建}，作者={扎克·穆雷斯和塔伦斯·范阿斯以及詹姆斯·巴托洛齐和阿扬·辛哈以及维杰·巴德里纳拉亚南和安德鲁·拉比诺维奇}，书名={eccv}，年份={2020年}，url={https://arxiv.org/abs/2003.10432}}", "note_en": "conda install -y pytorch=1.5.0 torchvision=0.6.0 cudatoolkit=10.2 -c pytorchconda install opencvpip install \\ open3d&gt;=0.10.0.0 \\ trimesh&gt;=3.7.6 \\ pyquaternion&gt;=0.9.5 \\ pytorch-lightning&gt;=0.8.5 \\ pyrender&gt;=0.1.43python -m pip install detectron2 -f https://dl.fbaipublicfiles.com/detectron2/wheels/cu102/torch1.5/index.html\n     (If you have problems running the code try using the exact versions specified... for example the pytorch-lightning API has not settled yet).\n   We provide a small  sample scene for easy download and rapid inference.Download and extract the data to  DATAROOT. The directory structure should look like:\n DATAROOT└───sample│ └───sample1│ │ intrinsics.txt│ └───color│ │ │ 00000001.jpg│ │ │ 00000002.jpg│ │ │ ...│ └───pose│ │ 00000001.txt│ │ 00000002.txt│ │ ...\n Next run our data preperation script which parses the raw data format into our common json format (more info  here)(note that we store our derivered data in a seperate folder  METAROOT to prevent pollution of the original data).\n   Download and extract Scannet by following the instructions provided at  http://www.scan-net.org/.The directory structure should look like:\n DATAROOT└───scannet│ └───scans│ | └───scene0000_00│ | └───color│ | │ │ 0.jpg│ | │ │ 1.jpg│ | │ │ ...│ | │ ...│ └───scans_test│ └───color│ │ │ 0.jpg│ │ │ 1.jpg│ │ │ ...│ │ ...\n Next run our data preperation script which parses the raw data format into our common json format (more info  here)(note that we store our derivered data in a seperate folder  METAROOT to prevent pollution of the original data).This script also generates the ground truth TSDFs using TSDF Fusion.\n  This will take a while (a couple hours on 8 Quadro RTX 6000&#39;s)... if you have multiple gpus you can use the  --i and  --n flags to run in parallel\n python prepare_data.py --path DATAROOT --path_meta METAROOT --dataset scannet --i 0 --n 4 &amp;python prepare_data.py --path DATAROOT --path_meta METAROOT --dataset scannet --i 1 --n 4 &amp;python prepare_data.py --path DATAROOT --path_meta METAROOT --dataset scannet --i 2 --n 4 &amp;python prepare_data.py --path DATAROOT --path_meta METAROOT --dataset scannet --i 3 --n 4 &amp;\n Note that if you do not plan to train you can prepare just the test set using the  --test flag.\n  To use your own data you will need to put it in the same format as the sample data, or implement your own version of something like  sample.py. After that you can modify  prepare_data.py to also prepare your data.Note that the pretrained models are trained with Z-up metric coordinates and do not generalize to other coordinates (this means that the scale and 2 axes of the orientation ambiguity of SFM must be resolved prior to using the poses).\n  Once you have downloaded and prepared the data (as described above) you can run inference using our pretrained model ( download) or by training your own (see below).\n   If your GPU does not have enough memory you can reduce  voxel_dim (at the cost of possible clipping the scene)\n  Note that the values of voxel_dim must be divisible by 8 using the default 3D network.\n        Note that  evaluate.py uses pyrender to render depth maps from the predicted mesh for 2D evaluation.If you are using headless rendering you must also set the enviroment variable  PYOPENGL_PLATFORM=osmesa(see  pyrender for more details).\n    In addition to downloadinng and prepareing the data (as described above) you will also need to  download our pretrained resnet50 weights (ported from  detectron2) and unnzip it.\n  Configuration is controlled via a mix of config.yaml files and command line arguments.We provide a few sample config files used in the paper in  configs/.Experiment names are specified by  TRAINER.NAME and  TRAINER.VERSION, which default to  atlas and  default.See config.py for a full list of parameters.\n      We also provide scripts to run inference and evaluataion using COLMAP. Note that you must install  COLMAP (which is included in our docker image).\n        @inproceedings{murez2020atlas, title={Atlas: End-to-End 3D Scene Reconstruction from Posed Images}, author={Zak Murez and Tarrence van As and James Bartolozzi and Ayan Sinha and Vijay Badrinarayanan and Andrew Rabinovich}, booktitle = {ECCV}, year = {2020}, url = {https://arxiv.org/abs/2003.10432}}", "posttime": "2020-08-13 05:03:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图像,reconstruction", "title": "Atlas：基于姿态图像的端到端三维场景重建", "title_en": "Atlas: End-to-End 3D Scene Reconstruction from Posed Images", "transed": 1, "url": "https://github.com/magicleap/atlas", "via": "", "real_tags": ["图像"]}, {"category": "", "categoryclass": "", "imagename": "41ab7acbb1c4f10f67a725822fea4663.jpeg", "infoid": 1017783, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透纽约8月23日电-维亚康姆(ViacomCBS)和国家娱乐公司(National Amusements)周三宣布，维亚康姆(Viacom)和哥伦比亚广播公司(CBS)董事长荣休萨姆纳·雷石东(Sumner Redstone)去世，享年97岁。雷石东是一位媒体大亨，他接管了父亲的电影院连锁店，并将其打造成包括派拉蒙影业、CBS和MTV在内的帝国。\n作为维亚康姆(Viacom Inc)VIA.O和哥伦比亚广播公司(CBS Corp CBS.N)的执行主席，雷石东通过私人持股的National Amusements控制了这两家公司。但在他90岁出头时，雷石东的身心健康状况引发了企业对他所持媒体的雪崩操作，导致他于2016年辞去两家公司执行主席一职。\n哥伦比亚广播公司(CBS)和维亚康姆(Viacom)在2000年至2006年合并，当时雷石东(Redstone)分离了这两家公司，试图释放维亚康姆有线电视频道的价值。\n他作为世界领先媒体大亨之一的地位在2015年开始衰落，因为那些与他关系密切的人开始质疑他的精神能力。随之而来的旷日持久的法律战让他与前女友兼长期红颜知己菲利普·道曼(Philippe Dauman)发生了争执，但让他与一直疏远的女儿莎莉(Shari)重聚。\n莎莉·雷石东在一份声明中说：“我父亲过着非凡的生活，不仅塑造了我们今天所知的娱乐业，而且创造了令人难以置信的家族遗产。经过这一切，我们分享了彼此的伟大爱，他是一位了不起的父亲、祖父和曾祖父。作为他的女儿，我感到非常自豪，我会永远想念他。“。\n雷石东精神健康面临的挑战导致他在CBS的执行主席一职被莱斯·穆维斯(Les Moonves)接替，在维亚康姆的执行主席一职由多曼(Dauman)接替，雷石东后来失去了在他去世后决定CBS和维亚康姆方向的信托基金。\n在一位观察家将其比作“权力的游戏”的法律和幕后争吵之后，雷石东家族于2016年8月将多曼赶出维亚康姆，最终由罗伯特·巴克什(Robert Bakish)取而代之。道曼一直是质疑雷石东精神能力的人之一，在雷石东的女儿莎莉开始在他的企业中扮演更积极的角色后，他的影响力已经减弱。\n自2016年以来，沙里两次推动哥伦比亚广播公司(CBS)和维亚康姆(Viacom)合并。她还经受住了一场旨在稀释她的家族对CBS控制的诉讼，以及CBS的性行为不当丑闻，这起丑闻导致首席执行官莱斯·穆维斯(Les Moonves)于2018年9月辞职。维亚康姆和哥伦比亚广播公司于2019年重新合并。\n据知情人士透露，莎莉·雷德斯通(Shari Redstone)和她的儿子泰勒·科尔夫(Tyler Korff)现在将接管一个董事会的两个席位，该董事会控制着持有维亚康姆哥伦比亚广播公司(ViacomCBS)控股权的实体National Amusements Inc的投票权。\n雷石东于1923年5月27日出生于波士顿的一个家庭，这个家庭拥有一家免下车电影院连锁店。他以班级第一名的成绩毕业于波士顿拉丁高中，在哈佛大学学习了三年，并在第二次世界大战期间与破解日本密码的美国陆军精英部队一起工作。\n战后，他在哈佛大学获得法律学位，并在美国最高法院成功抗辩。1954年，他加入了他家族的连锁影院国家娱乐公司(National Amusements)，并于1967年成为首席执行官。\n雷石东以直言不讳、波士顿口音和大胆冒险而闻名，1987年，当他以34亿美元收购维亚康姆(Viacom)时，他60多岁，大部分是借来的钱。几年后，他以超过100亿美元的价格收购了派拉蒙，并在1999年将CBS纳入投资组合，交易价值370亿美元。\n在他的健康状况恶化之前，雷石东曾声称每天裸泳，总是喜欢被漂亮的年轻女性包围。\n作家迈克尔·沃尔夫(Michael Wolff)2002年在“纽约”(New York)杂志上写道：“雷石东留着一头醒目的橙色头发，他是一个虚荣、老派的利己主义者，他的个人生活在很大程度上无疑被媒体拒之门外，因为他控制着太多的个人生活。”\n在经历了几十年的帝国建设之后，雷石东在2014年参加公司活动的次数变得很少，他在财报电话会议上也只说了几句话。《财富》(Fortune)杂志报道称，他参加了那一年的最后一次董事会会议，并援引一名目击者的话说，他在会议期间打瞌睡和流口水，这引发了人们对他是否适合管理公司的质疑。\n尽管人们对他的健康状况感到担忧，但雷石东尽可能长时间地坚持担任主席一职。2015年6月，他在一封电子邮件中告诉“名利场”杂志，“你应该知道，我永远不会退休！”\n那一年晚些时候，华尔街日报报道说，雷石东患了轻微中风，这使得他很难说话，尽管他的精神仍然很敏锐。\n前女友曼努埃拉·赫泽在2015年11月提起的诉讼中挑战雷石东的精神能力，称他是“活着的幽灵”。\n2016年5月，加州一名法官驳回了这起诉讼，该法官裁定，雷石东的证词驳斥了赫泽的说法。赫泽对法官的裁决提出上诉，双方于2019年达成和解。\n雷石东的去世正值媒体格局经历痛苦变化之际，一批媒体高管的队伍变得稀薄，其中包括鲁珀特·默多克(Rupert Murdoch)和特德·特纳(Ted Turner)，他们用自己创建的公司改变了新闻和娱乐界。\n雷石东表现出了迫使高管下台的倾向，其中包括维亚康姆总裁弗兰克·比昂迪(Frank Biondi)；哥伦比亚广播公司(CBS)首席执行官梅尔·卡尔马津(Mel Karmazin)；以及汤姆·弗雷斯顿(Tom Freston)，后者在收购社交媒体网络MySpace的交易输给默多克后被解雇。\n在2014年1月接受“好莱坞报道”的最后一次采访中，当被问及谁会接替他时，雷石东怒气冲冲地说，“我不会讨论继任问题。你知道为什么吗？我不会死的。“", "note_en": "NEW YORK (Reuters) - Viacom and CBS Chairman Emeritus Sumner Redstone, the media mogul who took his father’s movie theater chain and built it into an empire that included Paramount Pictures, CBS and MTV, has died at 97, ViacomCBS and National Amusements said on Wednesday.\n Redstone, as executive chairman of both Viacom Inc VIA.O and CBS Corp CBS.N, had controlled the two companies through privately held National Amusements. But in his early 90s, the state of Redstone’s physical and mental health set off an avalanche of corporate maneuvering over his media holdings that resulted in him stepping down in 2016 as executive chairman of both companies.\n CBS and Viacom were combined from 2000 to 2006, when Redstone separated them in an attempt to unleash the value of Viacom’s cable channels.\n His position as one of the world’s leading media moguls had begun fading in 2015 as those close to him began questioning his mental capacity. The long-running legal battle that ensued put him at odds with a former girlfriend and long-time confidante Philippe Dauman but reunited him with his daughter Shari, from whom he had been estranged.\n Shari Redstone said in a statement: “My father led an extraordinary life that not only shaped entertainment as we know it today, but created an incredible family legacy. Through it all, we shared a great love for one another and he was a wonderful father, grandfather and great-grandfather. I am so proud to be his daughter and I will miss him always.”\n The challenges to Redstone’s mental health resulted in him being replaced as executive chairman at CBS by Les Moonves and at Viacom by Dauman, whom Redstone would later drop from the trust that was to determine the direction of CBS and Viacom after his death.\n After legal and backroom wrangling that one observer likened to “Game of Thrones,” the Redstone family ousted Dauman from Viacom in August 2016, ultimately replacing him with Robert Bakish. Dauman had been among those questioning Redstone’s mental capacity and his influence had waned after Redstone’s daughter, Shari, started taking a more active role in his business.\n Since 2016, Shari pushed twice to merge CBS and Viacom. She’s also weathered a lawsuit aimed at diluting her family’s control of CBS, and a sexual misconduct scandal at CBS, which resulted in the September 2018 resignation of CEO Les Moonves. Viacom and CBS re-merged in 2019.\n Shari Redstone and her son Tyler Korff will now take over two seats on a trustee board that controls the voting interest in an entity, National Amusements Inc, that holds the controlling stake in ViacomCBS, according to a source familiar with the matter.\n  Redstone was born on May 27, 1923, into a Boston family that owned a chain of drive-in movie theaters. He graduated first in his class at Boston Latin High School, went through Harvard in three years and worked with an elite U.S. Army unit that cracked Japanese codes during World War Two.\n  After the war, he earned a law degree at Harvard and successfully pleaded a case before the U.S. Supreme Court. He joined National Amusements, his family’s theater chain, in 1954, and became chief executive officer in 1967.\n Known for his blunt talk, Boston accent and audacious risk taking, Redstone was in his 60s in 1987 when he bought Viacom for $3.4 billion with mostly borrowed money. A few years later he acquired Paramount for more than $10 billion and added CBS to the portfolio in 1999 in a deal valued at $37 billion.\n Before his health deteriorated, Redstone had claimed to swim naked every day and always liked to be surrounded by beautiful young women.\n “With a striking head of orange hair, Redstone is a vainglorious, old-school egomaniac who has an operatic personal life that has been largely kept out of the media undoubtedly because he controls so much of it,” author Michael Wolff wrote in New York magazine in 2002.\n  After decades spent building his empire, Redstone’s participation at corporate events became minimal in 2014 and he spoke only a few words on earnings calls. Fortune magazine reported he attended his last board meetings that year and cited a witness who said he dozed and drooled during it, which raised the question about whether he was fit to run the company.\n Despite the concerns about his health, Redstone hung on to his chairmanship as long as possible. In June 2015, he told Vanity Fair in an email correspondence, “You should know that I am never retiring!!!”\n Later that year, the Wall Street Journal reported Redstone had suffered mini-strokes that made speaking difficult, although he remained mentally sharp.\n Former girlfriend Manuela Herzer challenged Redstone’s mental competence in a lawsuit filed in November 2015, referring to him as a “living ghost.”\n The suit was thrown out in May 2016 by a California judge who ruled that Redstone’s testimony had disproved Herzer’s claims. Herzer appealed the judge’s ruling, and the parties settled in 2019.\n Redstone’s death, which comes at a time the media landscape is enduring wrenching changes, thins the ranks of a group of media executives, including Rupert Murdoch and Ted Turner, who changed the world of news and entertainment with the companies they built.\n  Redstone displayed a penchant for forcing out top executives, including Viacom President Frank Biondi; Mel Karmazin, the CEO of CBS; and Tom Freston, who was canned as CEO of Viacom after losing a deal to acquire the social media network MySpace to Murdoch.\n Asked in his last interview, in January 2014, with The Hollywood Reporter, about who might succeed him, Redstone exploded, “I will not discuss succession. You know why? I’m not going to die.”", "posttime": "2020-08-13 05:03:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "首席,redstone,雷石东", "title": "维亚康姆首席媒体大亨萨姆纳·雷石东去世", "title_en": "Sumner Redstone, media mogul who headed Viacom, has died", "transed": 1, "url": "https://www.reuters.com/article/us-people-redstone/billionaire-sumner-redstone-media-mogul-who-headed-viacom-dead-at-97-idUSKCN2581K2", "via": "", "real_tags": ["首席", "redstone", "雷石东"]}, {"category": "", "categoryclass": "", "imagename": "1175d762b770fdc31c1d85fba5518862.jpg", "infoid": 1017782, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步首席执行官Dara-Khosrowshahi周三在MSNBC接受Stephanie Ruhle采访时表示，如果法院不推翻最近要求优步将司机归类为全职员工的裁决，优步可能会暂时关闭几个月。\n优步(Uber)和竞争对手Lyft都还有大约一周的时间对加州一名法官周一授予的初步禁令提出上诉，该禁令将禁止两家公司将司机归类为独立工人。\n如果上诉对优步不起作用，优步将指望选民决定其在第22号提案中的命运，该提案将免除基于APP的运输和递送公司的司机被视为员工。\n优步首席执行官Dara-Khosrowshahi周三在MSNBC接受Stephanie Ruhle采访时表示，如果法院不推翻最近要求优步将司机归类为全职员工的裁决，优步可能会暂时关闭几个月。\nKhosrowshahi说：“如果法院不重新考虑，那么在加州，很难相信我们能够迅速将我们的模式转变为全职工作。”\n优步和竞争对手Lyft都还有大约一周的时间对加州一名法官周一授予的初步禁令提出上诉，该禁令将禁止这两家公司继续将司机归类为独立工人。执行这一命令将要求优步和Lyft为工人提供福利和失业保险。\n加利福尼亚州总检察长和三名市检察官根据该州的新法律“大会法案5”(Assembly Bill 5)对这些公司提起诉讼，该法律旨在通过将零工员工归类为员工，为公司业务的核心部分提供福利。在授予初步禁令的裁决中，法官驳回了司机应该被考虑在公司业务范围之外的观点，称这一逻辑是循环推理的经典例子。\n优步和Lyft都表示，他们将在裁决生效前的10天内提出上诉。\nKhosrowshahi没有将司机归类为员工，而是倡导他所说的第三条道路，即保持司机的独立性，同时允许公司提供一些保护，而不会有被视为全职雇主的风险。在法院裁决前的一篇《纽约时报》专栏文章中，Khosrowshahi表示，优步等零工公司可以向一个基金缴费，员工可以根据工作小时数向该基金支付带薪休假或医疗福利。\nKhosrowshahi周三表示，如果优步不能在上诉中获胜，他的B计划将是暂停加州的服务。虽然他表示，优步稍后将恢复在该州的服务，但它可能会更集中在城市，这可能意味着郊区等不太集中的地区的可获得性有限。\n如果优步的上诉不起作用，它将寄望于选民来决定它的命运。Khosrowshahi表示，如果是这样的话，加州的这项服务很可能会关闭，直到11月该州选民就22号提案做出决定，该提案将免除基于APP的运输和递送公司的司机被视为员工。优步辩称，其司机更喜欢作为独立承包商工作，尽管加州股份公司泽维尔·贝塞拉(Xavier Becera)驳斥了这一说法，称其为虚假论点。\nKhosrowshahi强调，该州暂停服务将使数千名司机失去他们通常从优步获得的收入。尽管如此，不管怎么说，在流感大流行期间，乘客数量一直在下降，法官表示，这使得禁令出台的时间，对优步和Lyft来说，可能是调整其商业模式最不糟糕的时候。\n贝塞拉周二在接受CNBC采访时表示，他并不担心优步可能会因为这项命令而离开该州。\n他表示：任何依赖欺骗员工来实现目标的商业模式，可能都不应该出现在任何地方，无论是加州还是其他地方。", "note_en": "Uber would likely shut down temporarily for several months if a court does not overturn a recent ruling requiring it to classify its drivers as full-time employees, CEO Dara Khosrowshahi said in an interview with Stephanie Ruhle on Wednesday on MSNBC.\n Uber and rival Lyft both have about a week left to appeal a preliminary injunction granted by a California judge on Monday that will prohibit the companies from classifying their drivers as independent workers.\n If the appeal doesn&#39;t work out for Uber, it will bank on voters to determine its fate in voting on Proposition 22, which would exempt drivers for app-based transportation and delivery companies from being considered employees.\n Uber would likely shut down temporarily for several months if a court does not overturn a recent ruling requiring it to classify its drivers as full-time employees, CEO Dara Khosrowshahi said in an interview with Stephanie Ruhle on Wednesday on MSNBC.\n &#34;If the court doesn&#39;t reconsider, then in California, it&#39;s hard to believe we&#39;ll be able to switch our model to full-time employment quickly,&#34; Khosrowshahi said.\n  Uber and rival  Lyft both have about a week left to appeal a  preliminary injunction granted by a California judge on Monday that will prohibit the companies from continuing to classify their drivers as independent workers. Following the order will require Uber and Lyft to provide benefits and unemployment insurance for workers.\n California&#39;s attorney general and three city attorneys  brought the lawsuit against the companies under the state&#39;s new law, Assembly Bill 5, that aims to provide benefits to gig workers core to a company&#39;s business by classifying them as employees. In his decision granting the preliminary injunction, the judge rejected the notion that drivers should be considered outside the course of the companies&#39; businesses, calling the logic &#34;a classic example of circular reasoning.&#34;\n Uber and Lyft both said they would appeal the ruling during the 10-day period before it goes into effect.\n  Rather than classify drivers as employees, Khosrowshahi has advocated for what he calls a &#34;third way&#34; that would maintain drivers&#39; independence while allowing companies to provide some protections without risking being viewed as full-time employers.  In a New York Times op-ed ahead of the court ruling, Khosrowshahi said gig companies such as Uber could pay into a fund that workers could dip into for paid time off or health-care benefits based on the number of hours they work.\n Khosrowshahi said on Wednesday that his Plan B if Uber can&#39;t win on appeal would be to temporarily pause service in California. While he said Uber would later resume service in the state, it would likely be more centered in cities, which could mean limited availability in less concentrated areas such as suburbs.\n  If the appeal doesn&#39;t work out for Uber, it will be banking on voters to determine its fate. Khosrowshahi said if that&#39;s the case, the service would likely shut down in California until November, when voters in the state decide on  Proposition 22, which would exempt drivers for app-based transportation and delivery companies from being considered employees. Uber has argued its drivers prefer working as independent contractors, though  California AG Xavier Becerra rejected that claim as a &#34;bogus argument.&#34;\n Khosrowshahi emphasized that pausing service in the state would leave thousands of drivers without the income they would typically earn from Uber. Still, ridership has been down during the pandemic anyway, which the judge said made the injunction come at what is perhaps &#34;the least worst time&#34; for Uber and Lyft to adjust their business models.\n Becerra said in an interview on CNBC on Tuesday that he was unconcerned about the potential for Uber to leave the state as a result of the order.\n &#34;Any business model that relies on shortchanging workers in order to make it probably shouldn&#39;t be anywhere, whether California or otherwise,&#34; he said.", "posttime": "2020-08-13 05:02:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "首席,ceo,优步", "title": "优步首席执行官表示，其服务可能会在加州暂时关闭", "title_en": "Uber CEO says its service will probably shut down temporarily in California", "transed": 1, "url": "https://www.cnbc.com/2020/08/12/uber-may-shut-down-temporarily-in-california.html", "via": "", "real_tags": ["首席", "ceo", "优步"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1017781, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可能没有注意到这一点，但目前科技泥土上还没有第三方广告。上周晚些时候，由于谷歌的一些内容审核选择，我们把它们撤下了，因为不可能让它们留在网站上。在某种程度上，这是内容不可能规模化的又一个例子。如果我们不知道和理解大规模内容审核是如何做好的，我们可能会像联邦主义者一样，假装谷歌的内容审核决定是基于与我们的意识形态的分歧。这将允许我们制造一个虚假的故事，因为国会中的白痴们坚持认为，谷歌因为联邦党的意识形态观点而取消了对其的资助，所以这个故事仍然在新闻周期中。\n事实是，谷歌的AdSense(其第三方广告平台)的内容审核非常糟糕。在早先那些关于联邦党情况的帖子中，我们提到了大量的网站一直在处理那些来自谷歌的违反政策的通知。两周前，我们开始全力以赴：我们开始每天至少收到一次违反政策的通知，而且经常是每天多次收到。每一次，信息都是一样的，告诉我们我们违反了他们的政策(他们没有说是哪些政策)，我们必须登录我们的AdSense策略中心才能找出问题所在。(#34；AdSense Policy Center，#34；AdSense Policy Center)。在接下来的一周半里(直到我们撤下广告)，我们每天都会收到更多这样的通知，每次我们登录政策中心时，我们都会收到一份不断轮换的违规行为清单。但从来没有太多信息来解释违规行为是什么。有时是没有找到URL(这似乎更能说明AdSense的狗屎爬虫，而不是我们)。有时是危险和贬损的内容。有时是令人震惊的内容。\n但仅此而已。然而，一个不同之处是，在过去，谷歌会说我们不需要修复那些标记的URL，他们只会停止在这些页面上显示广告。这很好。他们不想让他们的广告出现在那里，没问题。但是，这些新的违反政策的行为中有许多说它们是必须解决的问题。但是，这个问题应该是什么，从来没有得到解释。令人难以置信的是，这包括一个不存在的URL(一个格式错误的URL，它只会把你带到Techdirt的首页)。这被认为是必须修复的。而且，有点可笑的是，谷歌的标签页面被认为是危险的或贬损的&34；并且必须修复&#34；：\n再说一次，你在那里看到的基本上就是给我们的所有信息。我们怎样才能解决这个问题呢？他妈的谁知道呢？再说一次，我不认为这是谷歌针对我们的观点(即使我们一直在批评谷歌或谷歌的内容审核做法)。只是内容审核似乎不可能做好，谷歌就是一个很好的例子。\n令人难以置信的是，这个有问题的URL列表会一直在变化。有些人会在没有任何解释的情况下离开名单(即使是&#34；也必须修改&#34；个)。还会增加一些新的。有些人会在&#34；必须修复&#34；和&#34；不需要修复之间切换。&#34；无需解释。没有修复的记录。例如，在7月31日星期五，我登录并看到25个被认为违反策略的URL。周六早上我登录了，结果降到了18个。没有原因。周日早上是22点。但周日晚上是27岁。\n我试图联系AdSense的人，想知道我们到底应该做什么，但没有得到任何有用的信息。\n这个时候还发生了另外三件事。首先，就在我们开始每天(或每天多次)收到这些违反政策的电子邮件的同一天，谷歌也开始声称我们每天的电子邮件(只是博客本身的快照)是钓鱼尝试，并自动从任何G Suite用户的电子邮件账户中删除它们：\n对于Gmail(而不是G Suite)的用户来说，它只是将我们的时事通讯移到了垃圾邮件，仍然声称他们是钓鱼尝试：\n同样，这些电子邮件不会要求用户做任何事情或登录任何内容。他们不是钓鱼。它们只是当天博客帖子的电子邮件版本。我们不知道这两件事(AdSense违规和网络钓鱼指控)怎么可能联系在一起，所以他们在同一天开始可能只是一个巧合--但是，再说一次，谁知道呢？\n接下来的事情是，与我们合作管理我们网站上的广告流量(并引入除谷歌广告以外的其他来源)的公司告诉我们，谷歌已经联系了他们(而不是我们)，说由于所有持续的未固定政策违规，我们将在8月底之前被踢出AdSense。此外，谷歌还告诉他们，我们通过隐藏广告，使其看起来像普通内容，这是在参与点击垃圾邮件，这一点需要立即解决。问题是--我们不这样做，而且从来没有这样做过。我们的广告总是在右手边的栏目里，清晰地标明是广告。事实上，我们关注其他网站的所作所为，当涉及到不将我们的广告推到可能被误认为是有机内容的地方时，我们比地球上几乎所有其他网站都要谨慎得多。\n最后，我们开始收到来自多个技术泥土访问者的报告(包括那些告诉我们他们故意将技术泥土从他们的广告拦截程序中列入白名单的人)，他们说谷歌投放的广告导致他们的电脑运行得很热。有多个报告称Techash上的广告无法正确加载，并导致Techdirt无法正确加载。同时也让粉丝们兴奋起来。老实说，这是我们忍无可忍的最后一根稻草。我们会尝试与谷歌合作，以了解为什么我们的内容对谷歌来说是如此有问题，但当谷歌的产品开始伤害我们的用户并对他们造成滋扰时，他们就必须下台了，这就是为什么我们的内容会给谷歌带来如此大的问题，但当谷歌的产品开始伤害我们的用户并对他们造成滋扰时，他们就必须下台了。\n考虑到这一切，我们刚刚决定暂时完全从网站上撤下广告--至少在我们找到更好的情况之前是这样。这(显然)对我们来说是一个收入打击，但这种情况已经变得不可能处理。在过去的几周里，我浪费了如此多的时间，试图弄清楚我们到底应该做什么，而不是做我需要做的工作。那么，现在就到此为止吧。我们正在寻找其他提供商，但到目前为止，我们交谈的许多提供商似乎都是粗略的，我们也没有这样做。如果任何人知道任何不粗略、不可怕的广告合作伙伴，请让我们知道。或者，如果你碰巧有一些多余的钱，只想赞助一些东西，这样我们甚至不必担心常规广告，请让我们知道。假设你们中的大多数人都不在那个位置上，我们确实有一个页面，上面有个人可以用各种方式支持我们。我们知道现在很多人的日子都很艰难，但是如果你碰巧做得不错，并且能帮我们至少换掉我们从广告中赚到的一小部分钱，我们会非常感激的。", "note_en": "You probably didn&#39;t notice it, but there are currently no third-party ads on Techdirt. We pulled them down late last week, after it became impossible to keep them on the site, thanks to some content moderation choices by Google. In some ways, this is yet another example of the impossibility of content moderation at scale. If we didn&#39;t know and understand  how impossible content moderation at scale is to do well, we might be like The Federalist and  pretend that Google&#39;s content moderation decisions were based on disagreement with our ideology. That would have allowed us to make a fake story like the one that is  still getting news cycles, thanks to idiots in Congress insisting that Google  defunded the Federalist because of its ideological viewpoints.\n The truth is that Google&#39;s AdSense (its third-party ad platform) content moderation just sucks. In those earlier posts about The Federalist&#39;s situation, we mentioned that  tons of websites deal with those &#34;policy violation&#34; notices from Google all the time. Two weeks ago, it went into overdrive for us: we started receiving policy violation notices at least once a day, and frequently multiple times per day. Every time, the message was the same, telling us we had violated their policies (they don&#39;t say which ones) and we had to log in to our &#34;AdSense Policy Center&#34; to find out what the problem was. Every day for the ensuing week and a half (until we pulled the ads down), we would get more of these notices, and every time we&#39;d log in to the Policy Center, we&#39;d get an ever rotating list of &#34;violations.&#34; But there was never much info to explain what the violation was. Sometimes it was &#34;URL not found&#34; (which seems to say more about AdSense&#39;s shit crawler than us). Sometimes it was &#34;dangerous and derogatory content.&#34; Sometimes it was &#34;shocking content.&#34;\n But that would be about it. One difference, however, was that in the past Google would say that we didn&#39;t need to fix those flagged URLs and that they would just stop showing ads on those pages. Which is fine. They don&#39;t want their ads appearing there, no problem. But, many of these new &#34;policy violations&#34; said they were &#34;must fix&#34; issues. But what that &#34;fix&#34; sould be was never explained. Incredibly, this included a non-existent URL (a malformed URL that would just take you to the front page of Techdirt). That was deemed &#34;must fix.&#34; Also, somewhat amusingly, the tag page  for Google was deemed &#34;dangerous or derogatory&#34; and &#34;must fix&#34;:\n    Again, what you see there was basically all of the information given to us. How do we &#34;fix&#34; that? Who the fuck knows? Again, I do not think that this is Google targeting us for our views (even when we have been critical of Google or Google&#39;s content moderation practices). It just seems to be that content moderation is impossible to do well, and Google is a prime example.\n Incredibly, this list of problematic URLs would just keep changing. Some would drop off the list with no explanation (even the &#34;must fix&#34; ones). Some new ones would be added. Some would switch between &#34;must fix&#34; and &#34;don&#39;t need to fix.&#34; No explanation. No record of the &#34;fixes.&#34; As an example, on Friday July 31st, I logged in and saw 25 URLs deemed to be policy violations. On Saturday morning I logged in and it was down to 18. No reason. Sunday morning it was at 22. But Sunday evening it was 27.\n I tried to reach out to people at AdSense to figure out what the hell we should do and did not get back anything useful.\n Three other things happened around this time as well. First, on the same day we started receiving these daily (or multiple times daily) policy violation emails, Google  also started claiming that our daily emails (which are just snapshots of the blog itself) were  phishing attempts, and automatically deleting them from any G Suite user&#39;s email account:\n  For users of Gmail (not G Suite) it just moved our newsletters to spam, still claiming they were  phishing attempts:\n  Again, the emails don&#39;t ask users to do anything or to log in to anything. They&#39;re not phishing. They&#39;re just an email version of the day&#39;s blog posts. We didn&#39;t see how these two things (the AdSense violations and the accusations of &#34;phishing&#34;) could possibly be connected, so it might just be a coincidence that they started the exact same day -- but, again, who knows?\n The next thing that happened was that the company we work with to manage the ad flow on our website (and to bring in other sources, beyond Google ads) told us that Google had reached out to  them (not us) to say that because of all of the ongoing unfixed &#34;policy&#34; violations, we would be kicked out of AdSense by the end of August. Also, Google told them that we were engaging in &#34;clickspam&#34; by hiding our ads to make them look like regular content, and that needed to be fixed immediately. The problem is -- we don&#39;t do that and have never done that. Our ads were always in the right hand column and clearly called out as ads. Indeed, we pay attention to what other sites do, and we are way, way, way, way more careful than basically  every other website on the planet when it comes to not shoving our ads where they might be mistaken as organic content.\n Finally, we started receiving reports from multiple Techdirt visitors (including those who told us they had purposefully whitelisted Techdirt from their ad blockers) that ads being delivered by Google were causing their computers to run hot. Multiple reports of ads on Techdirt failing to load properly, and causing Techdirt to fail to load properly. And also causing fans to turn on. And, to be honest, that&#39;s the last straw for us. We would try to work with Google to understand why our content is so problematic for it, but when Google&#39;s products start harming our users and causing a nuisance for them, that&#39;s when they&#39;ve got to go.\n Given all this, we just decided that we&#39;re pulling the ads off the site entirely for the time being -- at least until we can figure out a better situation. This (obviously) represents a revenue hit for us, but the situation had become impossible to deal with. I was wasting so much time the past few weeks trying to figure out what the hell we were supposed to do, as opposed to doing the work I needed to be doing. So, that&#39;s it for now. We&#39;re looking at other providers out there, but so far, so many of the ones we talk to appear to be sketchy, and we&#39;re not doing that either. If anyone knows of any non-sketchy, non-awful advertising partners, please  let us know. Or, if you happen to have some excess money and want to just sponsor stuff so we don&#39;t even have to worry about regular ads, let us know. Assuming most of you are not in that position, we do have a page of  various ways individuals can support us. We know that times are tough for many, many people right now, but if you happen to be doing okay, and can help us replace at least a little of what money we made from ads, that would be greatly appreciated.", "posttime": "2020-08-13 05:02:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,谷歌,google,科技", "title": "为什么目前科技泥土上没有广告？显然谷歌认为我们很危险", "title_en": "Why Are Currently No Ads on Techdirt? Apparently Google Thinks We're Dangerous", "transed": 1, "url": "https://www.techdirt.com/articles/20200810/11335745081/why-are-there-currently-no-ads-techdirt-apparently-google-thinks-were-dangerous.shtml", "via": "", "real_tags": ["广告", "谷歌", "google", "科技"]}, {"category": "", "categoryclass": "", "imagename": "d84b9e66cd3807f241a590f42a82d4d6.jpg", "infoid": 1017780, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您已经在Amazon Web Services工作了很长时间，那么您可能已经看到或使用过AWS成本分配标签来组织您团队的资源。AWS允许您以称为标记的键-值对的形式将元数据附加到大多数资源。在本指南(由三部分组成的系列中的第一部分)中，我们将介绍一些最常见的AWS成本分配标签使用案例，并了解一些用于选择和组织您的标签的最佳AWS标签最佳实践。最后，我们将探索一些真实公司使用的AWS资源标记策略示例，以提高对其在Amazon Web服务中的资源利用情况的可见性。\nAWS成本分配标签可帮助您了解和控制您的AWS成本。AWS Cost Explorer允许您使用标签来细分随时间推移的AWS资源使用情况，而CloudForecast等工具可让您主动了解您的支出情况。\n了解并控制成本并不是您应该标记AWS资源的唯一原因。您可以使用AWS成本分配标签回答各种问题，包括：\n我们有多少台服务器已使用最新版本的操作系统进行了更新？\n在您开始向您的所有AWS资源添加AWS成本分配标签之前，创建一个策略来帮助您可持续地管理您的标签非常重要。AWS标签可能会有所帮助，但如果没有始终如一的应用计划，它们可能会成为不可持续的烂摊子。\n虽然不存在适用于每个组织的完美AWS标记策略，但您应该熟悉一些AWS标记最佳实践。\nAWS列举了四类成本分配标签：技术、业务、安全和自动化。请考虑您在创建AWS标记策略时需要以下哪些类别：\n技术标签可帮助工程师识别和使用资源。这些可能包括应用程序或服务名称、环境或版本号。\n业务标签允许风险承担者分析成本以及负责每种资源的团队或业务单位。例如，您可能想知道AWS支出中用于去年发布的新产品的百分比，以便您可以确定该工作的投资回报。\n安全标签可确保整个组织符合合规性和安全标准。这些标签可用于限制访问或表示符合HIPAA或SOC的特定数据安全要求。\n自动化标记可用于自动清除、关闭或使用帐户中每个资源的使用规则。例如，您可以标记沙箱服务器，然后运行脚本在它们不再使用后将其删除。\n在您决定需要哪些AWS标签以及如何使用它们时，请设置有关其用法的规则。决定哪些AWS标记将是必填的，应使用什么字符作为分隔符，以及谁将负责创建这些标记。如果您已经拥有许多资源，则可能需要将标记分配委派给使用它们的团队。\n为您的AWS标签键和值选择一致且可扩展的AWS标签命名约定可能很复杂。关于您可以使用的字符以及AWS标记键和AWS标记值的长度，有不同的AWS标记命名约定规则。在选择AWS标签命名约定之前，请务必阅读这些标签限制。\n一种常见的AWS标签命名约定模式是在单词和冒号之间使用小写字母和连字符来命名空间。例如，您可以使用如下内容：\n其中，mifflin是您公司的名称，eng指定此标记与工程团队相关，os-version表示标记的用途，1.0是值。\n您应该使用的标签数量有技术和实际限制。首先，AWS对每个资源实施50个标签的限制。更重要的是，如果您需要太多标签，工程师将很难跟踪和记住如何正确使用标签。\n幸运的是，许多标签可以通过依赖AWS的内置资源元数据来避免。例如，您不必存储EC2实例的创建者，因为Amazon默认添加了createdBy标记。确定您需要哪些标记，并尝试限制创建新标记。\n随着您账户中AWS资源数量的增加，跟踪您的AWS标签、执行约定和更新标签将变得越来越困难。在本指南的第2部分和第3部分中，我们将介绍如何使用Terraform、CloudFortification、Cloud Custodian来管理资源中的标签。\nAmazon还提供按资源组进行标记的标记策略和资源标记API，以帮助您批量管理和分配标记。从长远来看，尽可能多地自动化标签管理过程将产生更高质量、更易维护的标签。\n毫无疑问，您需要定期重新查看您的AWS标签，以确保它们仍然有用和准确。根据您部署的资源数量，这可能意味着每季度设置一个提醒来审核您的标记，或者可能意味着创建一个委员会来每月检查和更新标记。在本指南的第3部分中，我们将介绍一些用于管理标记的工具和策略。\nAmazon Web Services提供了他们推荐的资源标记实践的综合文档。如果您是AWS标签新手，并且想要更深入地了解其中一些AWS标签最佳实践，请务必阅读本文。\n让我们看看一些现实世界中的标记策略。这些内容改编自出于各种原因使用AWS标签组织资源的真实公司。虽然它们可能与您的使用案例不同，但它们会让您深入了解如何在AWS中标记您的资源。\n标记资源的一种普遍模式是按服务和环境。例如，如果组织有两个服务(购物车和搜索)和两个环境(生产和开发)，它们可能会设置以下标记：\n如果这两个服务共享单个RDS实例，则可以将数据库标记为service=cart|search(以指示此资源同时服务于这两个服务)，体系结构可能如下所示：\n如果您选择类似于上面的AWS标签策略，您必须考虑标签将如何随时间变化。例如，如果添加共享相同RDS实例的新服务，则必须更新数据库的标记以包括新服务的名称。出于这个原因，一些团队选择使用单个标记来指示资源可以由所有服务使用(例如：service=common)。\n如果您想了解哪些服务对您的AWS成本贡献最大，这样的基于服务的标记策略通常是一个很好的起点。业务团队可以使用这些标签来查看他们为每项服务或环境支付了多少费用，并在有问题时联系适当的联系人。\nAWS成本分配标签还可以帮助组织管理治理或合规性。如果您以特定方式标记资源，CloudForecast等工具(通过其AWS标记合规性功能)可以帮助您维护标记合规性。这些AWS标签可用于限制对特定资源的访问或运行额外的安全检查。\n在本例中，该公司用user-data=true标记包含用户数据的资源，以便他们可以更频繁地审计这些资源，并确保它们符合特定标准。所有资源都有联系人和环境标签，以指定负责的团队成员，并确保有人负责使他们保持最新。\n使用合规性标记策略并不妨碍您同时使用其他策略。AWS标签的优势之一是，它们允许您以几乎无限的方式对您的AWS资源进行细分。\n我们将查看的最后一个示例是帐户细分标记策略。虽然AWS的IAM权限允许您将访问权限精细地分配给用户、角色和团队，但有些组织可能需要更进一步。\n“当跨异构逻辑环境的资源放在同一位置时，如果您在调配资源和设计网络/IAM策略时不特别小心，就很容易意外使用来自另一个环境的资源”-Cars.com的平台工程师。\n在此示例中，组织为每个资源指定了业务单位和团队标签，每个环境都有单独的AWS帐户。\n这允许他们在每个环境中生成报告，以查看他们的营销(Mktg)单元与数据仓库(数据)单元的资源成本是多少。如果团队使用这种帐户分段标记方法，他们将需要使用主帐户来查看整个组织的资源使用情况。您还可以使用CloudForecast生成多个AWS账户的定期成本报告和明细数据。\n任何大规模使用AWS的组织都需要制定适合他们的标记策略。请考虑上面的AWS标记最佳实践和示例，以及您组织的目标。\n一旦您决定了AWS标记策略，您将需要一个添加和维护AWS成本分配标记的计划。在本指南的下一部分中，我们将介绍您可以采用的工具，以确保您的工程团队在所有AWS资源中一致使用AWS标签。", "note_en": "If you’ve worked in Amazon Web Services for long, you’ve probably seen or used  AWS cost allocation tags to organize your team’s resources. AWS allows you to attach metadata to most resources in the form of key-value pairs called tags. In this guide (the first in a three-part series), we’ll cover some of the most common use-cases for AWS cost allocation tags and look at some best AWS tagging best practices for selecting and organizing your tags. Finally, we’ll explore some examples of AWS resource tagging strategies used by real companies to improve visibility into their resource utilization in Amazon Web Services.\n  AWS cost allocation tags can help you  understand and control your AWS costs.  AWS Cost Explorer allows you to use tags to break down your AWS resource usage over time, while tools like  CloudForecast keep you informed of your spending proactively.\n Understanding and controlling your costs isn’t the only reason you should tag your AWS resources. You can use AWS cost allocation tags to answer a variety of questions, including:\n How many of our servers have been updated with the latest version of our operating system?\n Before you start adding AWS cost allocation tags to all of your AWS resources, it’s essential to create a strategy that will help you sustainably manage your tags. AWS tags can be helpful, but without a consistently applied plan, they can become an unsustainable mess.\n  While there isn’t a perfect AWS tagging strategy that works for every organization, there are a few AWS tagging best practices that you should be familiar with.\n  AWS cites  four categories for cost allocation tags: technical, business, security, and automation. Consider which of these categories you will need when creating your AWS tagging strategy:\n Technical Tags help engineers identify and work with the resource. These might include an application or service name, an environment, or a version number.\n  Business Tags allow stakeholders to analyze costs and the teams or business units responsible for each resource. For example, you might want to know what percentage of your AWS spend is going towards the new product you launched last year so you can determine the return on investment of that effort.\n  Security Tags ensure compliance and security standards are met across the organization. These tags might be used to limit access or denote specific data security requirements for  HIPAA or  SOC compliance.\n  Automation Tags can be used to automate the cleanup, shutdown, or usage rules for each resource in your account. For example, you could tag sandbox servers and run a script to delete them after they’re no longer in use.\n  As you decide which AWS tags you need and how you will use them, set rules about their usage. Decide which AWS tags will be mandatory, what character should be used as a delimiter, and who will be responsible for creating them. If you already have many resources, you may have to delegate tag assignment to the teams who use them.\n  Choosing a consistent and scalable AWS tag naming convention for your AWS tag keys and values can be complicated. There are different AWS tag naming convention rules about which characters you can use and how long AWS tag keys and AWS tag values can be. Be sure to  read up on these tag restrictions before you select a AWS tag naming convention.\n A common AWS tag naming convention pattern is to use lowercase letters with hyphens between words and colons to namespace them. For example, you might use something like this:\n  Where  mifflin is the name of your company,  eng designates this tag as being relevant to the engineering team,  os-version indicates the purpose of the tag, and  1.0 is the value.\n  There are technical and practical limits to the number of tags you should use. First, AWS enforces a 50-tag limit on each resource. More importantly, engineers will have a hard time keeping track of and remembering how to properly use tags if you require too many.\n Fortunately, many tags can be avoided by relying on AWS’s built-in resource metadata. For example, you don’t have to store the creator of an EC2 instance because  Amazon adds a  createdBy tag by default. Decide which tags you need and try to limit the creation of new tags.\n  As the number of AWS resources in your account grows, keeping up with your AWS tags, enforcing conventions, and updating tags will get increasingly difficult. In Part 2 and 3 of this guide, we’ll look at how you can use  Terraform,  CloudFormation,  Cloud Custodian to manage tags across your resources.\n Amazon also offers  tag policies,  tagging by resource group, and a  resource tagging API to help you govern and assign tags in bulk. Automating as much of the tag management process as possible will result in higher quality, more maintainable tags in the long run.\n  You will undoubtedly need to revisit your AWS tags periodically to make sure they’re still useful and accurate. Depending on how many resources you deploy, this might mean setting a reminder to audit your tags every quarter, or it might mean creating a committee to review and update tags every month. We’ll look at some tools and strategies for managing your tags in Part 3 of this guide.\n Amazon Web Services provides a  comprehensive document of their recommended practices for tagging resources. Be sure to review it if you’re new to AWS tags and want to dive deeper into some of these AWS tagging best practices.\n  Let’s look at a few real-world tagging strategies. These are adapted from real companies that use AWS tags to organize their resources for various reasons. While they may differ from your use case, they’ll offer you insight into how you might tag your resources in AWS.\n  A widespread pattern for tagging resources is by service and environment. For example, if an organization has two services ( cart and  search) and two environments ( prod and  dev), they might set up the following tags:\n  If these two services share a single  RDS instance, then the database can be tagged  service=cart|search (to indicate that this resource serves both services) and the architecture might look something like this:\n  If you choose an AWS tagging strategy like the one above, you have to consider how tags will change over time. For example, if you add a new service that shares the same RDS instance, you’ll have to update the database’s tags to include the name of the new service. For this reason, some teams opt to use a single tag to indicate that a resource may be used by all services (eg:  service=common).\n Service-based tagging strategies like this are usually a good starting point if you’d like to understand which services contribute the most to your AWS costs. The business team can use these tags to see how much they’re paying for each service or environment and reach out to the appropriate contact if they have questions.\n  AWS cost allocation tags may also help organizations manage governance or compliance. Tools like  CloudForecast through their  AWS Tagging Compliance feature can help you maintain tagging compliance if you tag your resources in specific ways. These AWS tags might be used to limit access or run extra security checks on particular resources.\n In this example, the company tags resources that contain user data with  user-data=true so that they can audit them more frequently and ensure they meet specific standards. All resources have a  contact and  env tag to designate the responsible team member and ensure someone is accountable for keeping them up to date.\n  Using a compliance tagging strategy does not preclude you from using other strategies as well. One of the advantages of AWS tags is that they let you segment your AWS resources in a nearly infinite number of ways.\n  The final example we’ll look at is an account-segmented tagging strategy. While AWS’s IAM permissions allow you to assign access to users, roles, and teams granularly, some organizations may want to go a step further.\n “When resources across heterogeneous logical environments are colocated, it is deceptively easy to accidentally use resources from another environment if you’re not extraordinarily careful when provisioning resources and designing network/IAM policies” - Platform Engineer at  Cars.com\n In this example, the organization designated business unit and team tags to each resource, with each environment having a separate AWS account.\n  This allows them to generate reports in each environment to see what their resource costs are for the marketing ( mktg) unit is vs. the data warehousing ( data) unit. If the team uses this method of account-segmented tagging, they’ll need to  use a master account to see resource usage across their entire organization. You can also use  CloudForecast to generate regular cost reports and breakdowns across multiple AWS accounts.\n  Any organization that uses AWS at scale will need to develop a tagging strategy that works for them. Consider the AWS tagging best practices and examples above, as well as your organization’s goals.\n Once you decide on a AWS tagging strategy, you will need a plan for adding and maintaining AWS cost allocation tags. In the next part of this guide, we’ll look at tools you can adopt to ensure your engineering teams are using AWS tags consistently across all your AWS resources.", "posttime": "2020-08-13 05:02:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "aws,tagging,标记", "title": "AWS标记最佳实践", "title_en": "AWS Tagging Best Practices", "transed": 1, "url": "https://www.cloudforecast.io/blog/aws-tagging-best-practices/", "via": "", "real_tags": ["aws", "tagging", "标记"]}]