[{"category": "", "categoryclass": "", "imagename": "6fda0c4579c0e37b82f8e63f6f4d85a8.jpg", "infoid": 1032979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国威斯康星州阿什兰市埃利斯大道1411号诺斯兰学院环境科学与自然资源系Paula Spaeth Anich。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。\n和埃里克·R·奥尔森(Erik R.Olson)环境科学和自然资源系，美国威斯康星州阿什兰市埃利斯大道1411号诺斯兰学院(Northland College)", "note_en": "Paula Spaeth Anich   Departments of Environmental Sciences and Natural Resources, Northland College, 1411 Ellis Avenue, Ashland, WI, USA\n,  Sharon Anthony  Departments of Environmental Sciences and Natural Resources, Northland College, 1411 Ellis Avenue, Ashland, WI, USA\n,  Michaela Carlson  Departments of Environmental Sciences and Natural Resources, Northland College, 1411 Ellis Avenue, Ashland, WI, USA\n,  Adam Gunnelson  Departments of Environmental Sciences and Natural Resources, Northland College, 1411 Ellis Avenue, Ashland, WI, USA\n,  Allison M. Kohler  ,  Jonathan G. Martin  Departments of Environmental Sciences and Natural Resources, Northland College, 1411 Ellis Avenue, Ashland, WI, USA\n and  Erik R. Olson  Departments of Environmental Sciences and Natural Resources, Northland College, 1411 Ellis Avenue, Ashland, WI, USA", "posttime": "2020-11-03 22:52:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生物,biofluorescence,期刊", "title": "鸭嘴兽中的生物荧光", "title_en": "Biofluorescence in the Platypus", "transed": 1, "url": "https://www.degruyter.com/view/journals/mamm/ahead-of-print/article-10.1515-mammalia-2020-0027/article-10.1515-mammalia-2020-0027.xml", "via": "", "real_tags": ["生物", "期刊"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032978, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "快速搜索任意位置输入单词/短语/DOI/ISBN/关键字/作者/等", "note_en": "Quick Search anywhere Enter words / phrases / DOI / ISBN / keywords / authors / etc", "posttime": "2020-11-03 22:51:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "女性,feminine,任意", "title": "在求职信中使用较少女性用语的女性被录用的可能性较小", "title_en": "Women Using Less Feminine Terms in Cover Letters Are Less Likely to Get Hired", "transed": 1, "url": "https://journals.aom.org/doi/full/10.5465/amj.2018.1280.summary", "via": "", "real_tags": ["女性", "feminine", "任意"]}, {"category": "", "categoryclass": "", "imagename": "c71cf32a9b845cee62d402a50d3fb46b.jpeg", "infoid": 1032977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到目前为止，我的生活中还没有任何东西让我做好准备，因为我会故意选择迁移到.NET，但现在已经是2020年了，什么都不重要了。\n在过去的两个月左右的时间里，我一直在为Dark Backend评估新的语言。由于一系列原因，OCaml的表现有点不令人满意。\n在过去的几年里，我们总是说，当我们重写后端时，我们将在某个时候重写，这将会消失，等等。有很多新的代码需要在后端编写，以满足我们的路线图。我们真的要写一次，然后再重写吗？或者现在直接移植，然后在新堆栈中编写新代码会更快吗？\n最终，我决定，如果要做出改变，现在就是时候。更重要的是，如果不会有什么变化，那么现在是完全致力于OCaml的绝佳时机，而不是第二次猜测这个选择。\n起初，我希望去“铁锈”。Rust有很好的工具，很棒的库，一个令人愉快的社区，等等。但是在上面花了大约一个月的时间，我不能说我喜欢写Rust。尤其是，我不喜欢用Rust编写异步代码。我喜欢一种很好的高级语言，当你有一个像Dark这样大的项目要构建时，这就是你需要的。而铁锈不是那样的。接下来，我将发表“黑暗为何没有选择生锈”一书。或者我可以称之为“垃圾收集器”，你永远不会相信垃圾收集器为你做了多少事，因为这就是总结。\n当我之前从事异步基准测试时，我真正做的是评估这些OCaml替代品中有没有更好的？如果是这样的话，它们也更快吗？我进行了评估，预计不会喜欢F#。我其实挺喜欢的。它与OCaml足够接近，有很好的库支持，而且到目前为止工具也是好的和糟糕的混合在一起。90年代的微软工具仍然在那里，这个比特并不是那么好，但总的来说，它比OCaml或Rust要好得多。\n让我们从显而易见的开始，F#是OCaml。它是由世界上最大和最有经验的编程语言创建者支持的OCaml。在OCaml很棒的领域，F#也很棒！SUM类型、静态类型、急切执行、管道、不可变值，所有这些都非常棒。\n在我看来，它实际上有一个更好的类型系统。突出的一点是，OCaml使地图的使用变得非常麻烦。比如哈希表，关联数组，随便你怎么称呼它们。看起来老版的真实世界OCaml已经被撤下了，所以我不能向你展示他们一开始有多令人不快。现在，在最新版本中，它们使用起来更加不舒服。而在F#中，你有一个Map&lt；OneType，AnotherType&gt；，这就是真正的地图&lt；OneType和AnotherType&gt；。魔法！\n当然，我选择.NET的主要原因是库。它什么都有图书馆，真令人惊讶。虽然没有那么多的F#第一方库，但是每个供应商都有一个.NETSDK，您可以直接从F#使用。我期待着最终获得对Honeycomb、Rolbar和Google Cloud的第一方支持。多年来我一直告诉伊迪丝我会的，现在我甚至终于可以使用LaunchDarry了。\n我真正喜欢的另一件事是文档和社区内容有多好。很多OCaml社区内容都是关于这门语言的，以及你能用它做些什么。F#开发人员似乎只想把狗屎做完。有数以百万计的博客帖子、YouTube视频等等，来自企业软件开发人员，他们在讨论构建Web软件的最佳方式。当然，还有非常详细和有用的FSharpForAndProfit，以及托马斯·彼得里克的作品-它真的很棒。\n我认为这主要是因为社区的规模。我听人说过F#开发人员很少，大约有100万C#用户、10万VB用户和10K F#用户，或者类似的东西。我不确定到底什么才算用户，但我可以想象，在这个指标中，OCaml的用户不到100人，所以感觉我正在向一个庞大的社区进军。\n不过，并不是每件事都令人惊叹。这套建筑系统很不美观。虽然paket与esy大致相当，但msbuild比沙丘差1000倍。在沙丘中的增量构建对我来说就像1，在.NET中就像6，即使什么都没有发生。我知道他们有漂亮的.NET增量式编译器，所以这让我感到困惑；如果有人有关于用F#进行真正快速编译的提示，我将不胜感激。\n需要检查的一件重要事情是我是否可以将代码编译成JS。Dark的执行引擎也可以在编辑器中运行它，这是Dark与众不同的核心特性之一。正因为如此，我想采用未经更改的后端代码，并将其直接编译为JS。这不像Rescript(它是OCaml编译成的JS，语义和生态系统略有不同，或者是F#中的等价物，寓言)。幸运的是，F#代码可以使用Blazor编译成Wasm。Blazor将.NET运行时编译成WASM，并在其中运行您的代码。它也几乎不需要任何代码就能运行(尽管找出正确的咒语并不是一件容易的事)。\n昨天的帖子吸引了很多人发表意见。除了一些Scala和Erlang的喜爱之外，很多人还提到了F#：\n所以…我认为在这里做一个不错的选择是从OCaml切换到F#。你会得到几乎所有的好处，而大部分缺点都会消失。在大多数情况下，您可以直接将代码从OCaml转换为F#。-黑暗圣徒。\n我已经在生产中的GCP上使用F#3年了，它非常棒，而且只会变得更好。您可以利用现有的.NET库(例如，您可以从Google获得官方的GCP库)，如果您足够多地使用它们，就可以很容易地为它们编写一个函数包装器。-血管造影\n我们考虑过OCaml，但选择了F#。我高兴得不能再高兴了。很棒的库，很好的工具，在2020年，多亏了C#和.NET Core，F#成为了云中的头等公民。您可以在Linux、Windows、MacOS上进行开发，无需修改即可运行。编译时间很长。除非您想要处理Rust中的低级特性和C++影响，否则F#是从OCaml迁移到更符合逻辑的步骤。还有适用于REPL的DotNet FSI。F#可以访问C#库，并且编写将NULL转换为None的薄包装器相对容易，因此您是NULL安全的或C#样式函数到ML样式函数，这样您就可以使用|&gt；或&lt；|etc.-l1x。\n我最近将第一个F#代码合并到代码库中。它是Dark解释器核心的异步版本，连接到长颈鹿(F#39；与.NET的Kestrel Web服务器的低级接口)。\n我的计划是重新实现相同的语言，但需要学习路线图中的一些内容。例如：\nINT将是无限精确的(从技术上讲，这是一个突破性的变化，但不是AFAICT的重大变化)。\n我将致力于使其等同于现有的Dark解释器，保持语义不变。在那之后，我将从“黑暗路线图”中制作新的功能。\nDark的后台是37K行的OCaml，其中8K行是测试，10K行是Dark标准库。所以到港口大约有两万条线路。应该会很有趣的。我的实施计划是实现平价-在此之后还有足够的时间来利用生态系统：\n创建一个OCaml库来反序列化DB中的二进制操作码，并将它们转换为F#(我假设是通过JSON中介)。这将允许(可选的)将传入请求路由到F#服务。\n添加模糊器以确保OCaml和F#版本的Dark的语义相同(尤其是库函数)\n开始使用新设计记录痕迹(信不信由你，这实际上是推动整个更改的主要原因！)。\n有很多事情要做，欢迎黑暗贡献者参加。移植标准库函数可能是一个简单的入门之处，添加语言功能也是如此。除了上面提到的以外，大多数东西都是直接来自OCaml的端口。和往常一样，如果你有任何问题，请随时在“空档”或“问题”中提问。\n你可以在这里报名参加“黑暗”。欲了解更多关于Dark的信息，请关注我们的RSS，在Twitter上关注我们(或我)，加入我们的松弛社区，或观看我们的GitHub回购。", "note_en": "Nothing in my life so far would have prepared me for the fact that I would be willfully choosing to move to .NET, but it&#39;s 2020, and nothing matters anymore.\n I&#39;ve been evaluating new languages for the Dark backend over the last 2 months or so. For a  bunch of reasons, OCaml has been a little unsatisfactory.\n Over the last few years we&#39;ve always said &#34;when we rewrite the backend&#34;, &#34;at some point we&#39;ll rewrite and this will go away&#34;, etc. There&#39;s a lot of new code to be written on the backend, to meet our roadmap. Are we really going to write it once, and then rewrite it later? Or would it be faster to just port it now, and write the new code in the new stack?\n Ultimately, I decided that if there was going to be a change, now was the time. And more importantly, if there wasn&#39;t going to be a change, now was an excellent time to fully commit to OCaml, and not be second guessing the choice.\n Initially, I expected to go to Rust.  Rust has excellent tooling, great libraries, a delightful community, etc. But after spending about a month on it, I can&#39;t say I like writing Rust. Especially, I don&#39;t like writing async code in Rust. I like a nice high level language, and that&#39;s kinda what you need when you have a project as big as Dark to build. And Rust is not that. I&#39;ll publish &#34;Why Dark didn&#39;t choose Rust&#34; next. Or I might call it &#34;you&#39;ll never believe just how much a Garbage Collector does for you!&#34;, because that&#39;s the summary.\n When I was working on  Async benchmarks before, what I was really doing was evaluating &#34;are any of these OCaml alternatives better? And if so are they also faster?&#34;. I evaluated and expected not to like F#. I actually quite like it. It&#39;s close enough to OCaml, has great library support, and tooling which so far has been a mix of great and terrible. The 90&#39;s Microsoft tooling is still there, and that bit isn&#39;t all that great, but overall it&#39;s a much better situation than OCaml or Rust.\n  Let&#39;s start with the obvious, F# is OCaml. It&#39;s OCaml backed by the world&#39;s largest and most experienced creators of programming languages. And in the areas that OCaml is great, F# is also great! Sum types, static typing, eager execution, pipelines, immutable values, all of this is really great.\n It actually has a much better type system, in my opinion. One thing that sticks out is that OCaml made it really cumbersome to use maps. Like, hashtables, associative arrays, whatever you call them. It seems the old version of Real World OCaml has been taken down, so I can&#39;t show you how unpleasant they were at the start. Now, in the latest version, they are  more moderately unpleasant to use. Whereas in F#, you have a  Map&lt;OneType,AnotherType&gt; and that&#39;s really it. Magic!\n Of course, the main reason I chose .NET was the libraries. It has libraries for everything, what a surprise. While there aren&#39;t all that many F# first-party libraries, every vendor out there has a .NET SDK that you can use directly from F#. I look forward to finally having first-party support for  Honeycomb,  Rollbar, and Google Cloud. I&#39;m even finally going to get to use  LaunchDarkly, after  years of telling Edith I would.\n The other thing I&#39;ve really enjoyed is how good the docs and community content are. A lot of OCaml community content is on the language and what you can do with it. F# developers seem to just want to get shit done. There&#39;s a million blog posts, youtube videos, etc, from enterprise software developers talking about the best way to build web software. And then of course the massively detailed and useful  FSharpForForAndProfit, as well as  Tomas Petricek&#39;s work - it&#39;s really great.\n I think most of this is due to the size of the community. I&#39;ve heard people say that there are very few F# developers; something like there&#39;s 1M C# users, 100k VB users, and 10K F# users, or something like that. I&#39;m not sure exactly what counts as user, but I would imagine that OCaml has fewer than 100 &#34;users&#34; in this metric, so it feels like I&#39;m moving to a massive community.\n Not everything is amazing though. The build system is attrocious. While  paket is roughly on par with  esy, msbuild is 1000 times worse than  dune. An incremental build in dune is like 1s for me, and 6s in .NET, even if nothing is happening. I know they have fancy incremental compilers for .NET so this puzzles me; if anyone has tips on getting really fast compilation in F#,  I would appreciate them.\n An important thing to check was whether I could compile my code to JS. Dark&#39;s execution engine runs it the editor as well, and that&#39;s one of the core things that makes Dark special. Because of this, I want to take unaltered backend code and compile it directly to JS. This isn&#39;t like  Rescript (which is OCaml compiled to JS with slightly different semantics and ecosystem, or it&#39;s equivalent in F#,  Fable). Fortunately, F# code can be compiled to Wasm using  Blazor. Blazor compiles the .NET runtime to WASM and runs your code in that. It  barely took any code to get working either (though figuring out the right incantation was not trivial).\n  Yesterday&#39;s post got a lot of people to add their opinions. In addition to some  Scala and  Erlang love, a lot of people pointed to F#:\n So...I think a decent choice to make here is to switch from OCaml to F#. You&#39;ll get almost all of the benefits and most of the drawbacks go away. And for the most part, you can directly translate the code from OCaml to F#. -  darksaints\n I&#39;ve been using F# on GCP in production for 3 years now and it&#39;s fantastic and only getting better. You can leverage existing .NET libraries (for example, you get official GCP libraries from google) and if you use them enough it&#39;s easy enough to write a functional wrapper around them. -  angio\n We have considered OCaml but went for F# instead. I could not be happier. Great libraries, good tooling, in 2020 F# is a first class citizen in the cloud thanks to C# and .NET Core. You can develop on Linux, Windows, MacOS and without modification it works. Compilation times are great. Unless you want to deal with the low level nature and the C++ influence in Rust F# is a much more logical step to move from OCaml. There is dotnet fsi for REPL too. F# has access to C# libraries and it is relatively easy to write a thin wrapper that convert nulls to Nones, so you are null safe or C# style functions to ML style functions so you can use |&gt; or &lt;| etc. -  l1x\n  I recently merged the  first F# code into the codebase. It&#39;s an async version of the core of the Dark interpreter, connected to Giraffe (F#&#39;s low-level interface to .NET&#39;s Kestrel web server).\n My plan is to reimplement the same language, but with some of the learnings that are in the  roadmap. For example:\n Int will be infinite precision (this is technically a breaking change, but not a significant one AFAICT)\n I&#39;ll be working on making the equivalent to the existing Dark interpreter, keeping the semantics the same. After that, I&#39;ll be making new features from the  Dark Roadmap.\n  Dark&#39;s backend is 37K lines of OCaml, of which 8K lines are tests, and 10K lines are the Dark standard library. So there&#39;s about 20K lines to port. Should be fun. My implementation plan is to get to parity - there&#39;s plenty of time after that to take advantage of the ecosytem:\n make an OCaml library to deserialize the binary opcodes in the DB and covert them into F# (via, I presume, a JSON intermediary). This will allow incoming requests to (optionally) be routed to the F# service.\n add a fuzzer to ensure the semantics of the OCaml and F# versions of Dark are the same (especially the library functions)\n     start recording traces using  the new design (this is actually the main thing driving the whole change, believe it or not!)\n There&#39;s lots to do, and  Dark contributors are welcome to take part. Porting standard library functions might be an easy place to get started, as is adding language features. Most things are a straight port from OCaml, except as mentioned above. As always, feel free to ask in  the Slack or  issues if you&#39;ve any questions.\n  You can sign up for Dark      here    . For more info on Dark, follow our      RSS    , follow      us     (or      me    ) on Twitter, join our      Slack Community    , or watch our      GitHub repo    .", "posttime": "2020-11-03 22:51:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,dark,ocaml", "title": "Dark的新后端将在F#(2020)", "title_en": "Dark's new back end will be in F# (2020)", "transed": 1, "url": "https://blog.darklang.com/new-backend-fsharp/", "via": "", "real_tags": ["2020", "dark", "ocaml"]}, {"category": "", "categoryclass": "", "imagename": "281474ed914e8955c233718ea8a67939.png", "infoid": 1032976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌今天发布了Chrome网络浏览器的安全更新，修补了10个安全漏洞，其中包括一个零日漏洞，该漏洞目前正被广泛利用。\n被确认为CVE-2020-16009的零日是由谷歌的威胁分析小组(TAG)发现的，该小组是谷歌的一个安全团队，负责跟踪威胁参与者及其正在进行的操作。\n按照谷歌的典型方式，零日和利用该漏洞的组织的细节尚未公开-这是为了让Chrome用户有更多时间安装更新，并防止其他威胁行为者为同一零日开发自己的漏洞。\n然而，在今天发布的一份简短的ChangeLog报告中，谷歌表示，零日驻留在处理JavaScript代码的Chrome组件V8中。\n这是谷歌在过去两周内发现的第二个Chrome零日漏洞。\n10月20日，谷歌还发布了针对Chrome的安全更新，为cve-2020-15999打补丁，在Chrome的FreeType字体渲染库中为零日。\n正如谷歌上周周五透露的那样，这个Chrome零日与Windows零日版本(CVE-2020-17087)一起被广泛使用。\nChrome零日被用来在Chrome内部执行恶意代码，而Windows零日被用来提升代码的权限并攻击底层的Windows操作系统。微软预计将在11月10日，也就是公司周二发布下一个补丁时，对这个零日进行补丁。", "note_en": "Google has released a security update today for its Chrome web browser that patches ten security bugs, including one zero-day vulnerability that is currently actively exploited in the wild.\n     Identified as  CVE-2020-16009, the zero-day was discovered by Google&#39;s Threat Analysis Group (TAG), a security team at Google tasked with tracking threat actors and their ongoing operations.\n In typical Google fashion, details about the zero-day and the group exploiting the bug have not been made public — as a way to allow Chrome users more time to install the updates and prevent other threat actors from developing their own exploits for the same zero-day.\n However, in a short  changelog published today, Google said the zero-day resides in  V8, the Chrome component that handles JavaScript code.\n   This is the second Chrome zero-day that Google found exploited in the wild in the past two weeks.\n On October 20, Google also released a security update for Chrome to patch  CVE-2020-15999,  a zero-day in Chrome&#39;s FreeType font rendering library.\n   As Google revealed last week on Friday, this Chrome zero-day was  utilized together with a Windows zero-day ( CVE-2020-17087).\n The Chrome zero-day was used to execute malicious code inside Chrome, while the Windows zero-day was used to elevate the code&#39;s privileges and attack the underlying Windows OS. Microsoft is expected to patch this zero-day on November 10, during the company&#39;s next Patch Tuesday.", "posttime": "2020-11-03 22:51:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,google,谷歌,修补,patches", "title": "谷歌在两周内第二次修补Chrome零日", "title_en": "Google patches second Chrome zero-day in two weeks", "transed": 1, "url": "https://www.zdnet.com/article/google-patches-second-chrome-zero-day-in-two-weeks/", "via": "", "real_tags": ["chrome", "google", "谷歌", "修补", "patches"]}, {"category": "", "categoryclass": "", "imagename": "5cfce9df1a765e2ae57e92a402f12f24.png", "infoid": 1032975, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NPM安全团队今天从NPM网站上删除了一个恶意JavaScript库，其中包含用于打开程序员计算机后门的恶意代码。\nJavaScript库被命名为Twilio-npm，其恶意行为在上周末被Sonatype发现，Sonatype是一家监控公共软件包存储库的公司，将其作为其开发者安全操作(DevSecOps)服务的一部分。\n在今天发布的一份官方报告中，Sonatype表示，该库于周五首次发布在NPM网站上，当天被发现，并在NPM安全团队将该软件包列入黑名单后于今天删除。\n尽管NPM门户的生命周期很短，但该库被下载了超过370次，并自动包含在通过NPM(节点包管理器)命令行实用程序构建和管理的JavaScript项目中。\n发现并分析该库的Sonatype安全研究员AX Sharma表示，在伪造的Twilio库中发现的恶意代码在所有计算机上打开了一个TCP反向外壳，在JavaScript/npm/Node.js项目中下载并导入了该库。\n反向外壳打开了到&#34；4.tcp.ngrok[.]io：11425&#34；的连接，等待从该连接接收要在受感染用户计算机上运行的新命令。\nNPM安全团队今天表示，任何安装或运行该软件包的计算机都应被视为完全受到攻击，证实了Sonatype的调查。\n&#34；NPM团队补充说，存储在该计算机上的所有机密和密钥应该立即从另一台计算机轮换。\n这标志着在过去的三个月里，恶意NPM包被第四次重大拆除。\n8月下旬，NPM的工作人员删除了一个恶意的NPM(JavaScript)库，该库旨在从受感染的用户的浏览器和不和谐应用程序中窃取敏感文件。\n9月，NPM工作人员移除了四个NPM(JavaScript)库，用于收集用户详细信息，并将被盗数据上传到一个公开的GitHub页面。\n10月，NPM团队移除了三个NPM(JavaScript)包，这三个包也被发现在开发人员电脑上打开反向外壳(后门)。Sonatype也发现了这三个软件包。与上周末发现的那个不同，这三个操作系统也可以在Windows系统上运行，而不仅仅是类UNIX系统。", "note_en": "The npm security team has removed today a malicious JavaScript library from the npm website that contained malicious code for opening backdoors on programmers&#39; computers.\n     The JavaScript library was named &#34; twilio-npm,&#34; and its malicious behavior was discovered over the weekend by Sonatype, a company that monitors public package repositories as part of its developer security operations (DevSecOps) services.\n In a  report published today, Sonatype said the library was first published on the npm website on Friday, was discovered on the same day, and removed today after the npm security team blacklisted the package.\n Despite a short lifespan on the npm portal, the library was downloaded more than 370 times and automatically included in JavaScript projects built and managed via the  npm (Node Package Manager) command-line utility.\n Ax Sharma, the Sonatype security researcher who discovered and analyzed the library, said the malicious code found in the fake Twilio library opened a TCP reverse shell on all computers where the library was downloaded and imported inside JavaScript/npm/Node.js projects.\n The reverse shell opened a connection to &#34; 4.tcp.ngrok[.]io:11425&#34; from where it waited to receive new commands to run on the infected users&#39; computers.\n     &#34;Any computer that has this package installed or running should be considered fully compromised,&#34; the npm security team  said today, confirming Sonatype&#39;s investigation.\n &#34;All secrets and keys stored on that computer should be rotated immediately from a different computer,&#34; the npm team added.\n This marks the fourth major takedown of a malicious npm package over the past three months.\n In late August, the npm staff removed a malicious npm (JavaScript) library designed to  steal sensitive files from an infected users&#39; browser and Discord application.\n In September, npm staff removed four npm (JavaScript) libraries for collecting user details and  uploading the stolen data to a public GitHub page.\n In October, the npm team removed three npm (JavaScript) packages that were also  caught opening reverse shells (backdoors) on developer computers. The three packages were also discovered by Sonatype. Unlike the one discovered over the weekend, these three also worked on Windows systems, and not just UNIX-like systems.", "posttime": "2020-11-03 22:50:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,npm", "title": "恶意NPM包在程序员的计算机上打开后门", "title_en": "Malicious NPM package opens backdoors on programmers' computers", "transed": 1, "url": "https://www.zdnet.com/article/malicious-npm-package-opens-backdoors-on-programmers-computers/", "via": "", "real_tags": ["程序", "npm"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032973, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在下一个版本中，racket CS可能会成为默认的racket实现。如果在这个版本和下一个版本之间，没有发现任何比racket BC中发现的bug更严重的bug，那么racket CS将成为下一个版本的默认版本。(从v7.8版本开始就发现了严重的球拍CS错误，但它们越来越少。)。\nCracket CS现在支持并行垃圾收集，并改进了位置本地分配和增量提升。\nUNIX平台现在默认情况下对每个用户配置和库文件的位置使用XDG文件系统约定，但是在已经存在的地方仍然使用传统路径。\n除了libreadline之外，Unicode输入还可以与最新版本的libedit一起使用。在Mac OS上，racket附带了兼容版本的libedit。\n5pyd3r，A·格林，亚当·迈克尔，亚历克斯·巴塞洛缪，亚历克斯·哈兰尼，亚历克斯·克诺斯，亚历山大·B·麦克林，亚历山大·肖波夫，亚历克西斯·金，安德鲁·莫尔-奥茨，安迪·凯夫特，艾曼·奥斯曼，巴拉克·A·皮尔穆特，本·格林曼，伯特·德·凯特莱尔，鲍勃·汉堡，博迪·所罗门，波格丹·波帕，布鲁斯·米切纳，克里斯·弗里兹，克里斯蒂安·海格斯特伦，库伦·詹宁斯，丹尼尔·布伦纳，死亡之王，戴安娜·阿马利·格莱泽，多米尼克·潘特·ůč，埃文·明斯克，弗雷德·傅园慧，加文·惠兰，格雷厄姆·沃特曼，巴拉克·A·皮亚特，古斯塔夫·马西，Göran Weinholt，杰克·菲尔斯，杰米·杰森，杰森·泰勒，布鲁斯·米切纳，克里斯·弗里兹，克里斯蒂安·海格斯特伦，库伦·詹宁斯，多米尼克·潘特，埃文·明斯克，弗雷德·傅，加文·格里芬，格雷厄姆·沃特汉姆，巴拉克·A·贝亚特，古斯塔沃·马西，Göran Weinholt，杰克·菲尔斯，杰米·杰米·泰勒，布鲁斯·米切纳，克里斯·弗里兹，克里斯蒂安·哈格斯特伦。约翰·克莱门茨，Jon Zeppieri，Juan Francisco Cantero Hurtado，Jéssica Milaré，Jörgen Brandt，Laurent Orseau，Leo Uino，Matthew D.Miller，Matthew Flatt，Matthias Felleisen，Michael Lenaghan，Mike Sperber，Mohamed Akram，Neal Alexander，Nick Fitzgerald，Oscar Waddell，Paulo Matos，Pavel Panchekha，Peter Kleegin，Philip McGrath，Quentin Dufour，R.Kent Dybvig，Robby Findler，Ryan CulPepper，Sam Tobin-Hochstadt，Stephen-Hung You，Sorae Porncharowase，Stephen Chang，de Gabrielle，Steven Watson，Taekung，Neal Alexander，Nick Fitzgerald，Oscar Waddell，Paulo Matos，William Bowman，ComposatorLogic，R.Kent Dybvig，Robby Findler，Ryan CulPepper，Sam Tobin-Hochstadt，Stephen Shu-Hung，Sorae Porncharowase，Stephen Chang，de Gabrielle，Steven Watson，Taekung，Lemon，Thoro Matou，William Bowman，Composatoric，R.Kent Dybvig，Robby Findler，Ryan CulPepper，Sam Tobin-Hochstadt，Stephen-Hung-Hung，Sorae Porncharowase，Stephen Chang，de Gabrielle。陈梓立和靈", "note_en": "Racket CS may become the default Racket implementation in the next release. If, between this release and the next, no bugs are discovered in Racket CS that are more serious than those typically discovered in Racket BC, then Racket CS will become the default for the next release. (Serious Racket CS bugs were found since the v7.8 release, but they’re ever fewer and farther between.)\n      Racket CS now supports parallel garbage collection, along with improvements for place-local-allocation and incremental promotion.\n  Unix platforms now use the XDG filesystem conventions for the locations of per-user configuration and library files by default, but legacy paths are still used where they exist already.\n        Unicode input works with recent versions of libedit in addition to libreadline. On Mac OS, a compatible version of libedit is included with Racket.\n  5pyd3r, A. Green, Adam Michael, Alex Bartholomew, Alex Harsányi, Alex Knauth, Alexander B. McLin, Alexander Shopov, Alexis King, Andrew Mauer-Oats, Andy Keep, Ayman Osman, Barak A. Pearlmutter, Ben Greenman, Bert De Ketelaere, Bob Burger, Bodie Solomon, Bogdan Popa, Bruce Mitchener, Chris Frisz, Christian Häggström, Cullen Jennings, Daniel Brunner, DeathKing, Dionna Amalie Glaze, Dominik Pantůček, Evan Minsk, Fred Fu, Gavin Whelan, Graham Watt, Griffin Byatt, Gustavo Massaccesi, Göran Weinholt, Jack Firth, Jamie Taylor, Jason Felice, Jason Hemann, Jasper Pilgrim, Jay McCarthy, Jesse Alama, Jin-Ho King, John Clements, Jon Zeppieri, Juan Francisco Cantero Hurtado, Jéssica Milaré, Jörgen Brandt, Laurent Orseau, Leo Uino, Matthew D. Miller, Matthew Flatt, Matthias Felleisen, Michael Lenaghan, Mike Sperber, Mohamed Akram, Neal Alexander, Nick Fitzgerald, Oscar Waddell, Paulo Matos, Pavel Panchekha, Peter Klein, Philip McGrath, Quentin Dufour, R. Kent Dybvig, Robby Findler, Ryan Culpepper, Sam Tobin-Hochstadt, Shu-Hung You, Sorawee Porncharoenwase, Stephen Chang, Stephen De Gabrielle, Steven Watson, Taekyung, Ted Lemon, Thorsten Blum, Virgil Hou, William J. Bowman, combinatorylogic, deeglaze, evdubs, john, tokomikea, xxyzz, yjqww6, 陈梓 立, and 靈", "posttime": "2020-11-03 22:49:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "并行,garbage,racket", "title": "球拍v7.9，支持并行垃圾收集", "title_en": "Racket v7.9, with parallel garbage collection", "transed": 1, "url": "https://blog.racket-lang.org/2020/11/racket-v7-9.html", "via": "", "real_tags": ["并行", "garbage", "racket"]}, {"category": "", "categoryclass": "", "imagename": "d2db3b6adfdf5517e228d413950a9070.jpg", "infoid": 1032972, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旅行车曾经是家庭用车中最时髦的款式，但到了20世纪80年代中期，这辆古老的旅行车已经变成了令人尴尬的移动妈妈。取而代之的是，每个人都想要一种名为小型货车的新款热门车型，它不仅看起来有点像每个人刚刚购买的那种新的手持吸尘器，而且还为家长兼司机提供了更大的实用价值。最终，面包车也被涂上了不酷的妈妈光环，市场转向了SUV。\n现在，在它达到顶峰大约40年后，旅行车上的时间几乎已经用完了。尽管如此，少数原始设备制造商仍然迎合好奇的旅行车，尤其是沃尔沃那些时尚的瑞典人。该公司目前最漂亮的两款产品可以说是V90和V60旅行车，这两款车都以某种方式将肌肉车的暗示融合到了传统的两箱车形状上。但这些并不是该品牌花名册上唯一的旅行车，因为还有越野车型。这个想法以旅行车为例，然后增加几英寸的乘坐高度，使其能够更好地穿越未铺设的道路-越野，你明白吗？\n我三年前测试了V90越野，今天轮到V60越野了。具体地说，45,450美元的V60越野T5全时四轮驱动。你可以将它与普通的V60区分开来，因为越野越野车的高度要高出几英寸，它的底部边缘还装饰着未经加工的塑料保险杠，这样更好地应对在砾石上花费的时间。美丽在观者眼里，但这只眼睛看到，这两个小小的调整对这辆中型马车的外观没有任何好处。\n在内部，我没有这样的抱怨，尽管我更喜欢编织的纺织品座椅，这是一个免费的选择，而不是我们测试车附带的奶油皮革内饰。然而，从内部观看会受到驾驶员侧视镜造成的一些盲点的影响。\n这款车的数字仪表盘和9英寸的信息娱乐屏幕不再像以前那样令人惊叹，它运行的是旧版的Scount，而不是沃尔沃现在采用的基于Android Automotive的信息娱乐。这就是说，极简主义的用户界面主题是鲜明的，没有无关的信息，即使你讨厌那里的(有线)Android Auto和Apple CarPlay。\n对于美国沃尔沃来说，T5是每一款不同车型的切入点，引擎盖下装有250马力(187千瓦)2.0L涡轮增压四缸汽油发动机。这与八速自动变速器相结合，因为重点是能够在其他马车不敢涉足的地方驾驶，所以每辆越野车都配备了四轮驱动。\n出于同样的原因，V60越野坐在离地面8英寸(203毫米)的地方，只有司机在车上，比普通的V60高2.4英寸(61毫米)。这为越野提供了17˚的进场角度，18.4˚的越界角度和22.8˚的离场角度。沃尔沃还表示，它可以涉水穿过11.8英寸(300毫米)深的溪流，只要你以步行的速度这样做。\n然而，我没有测试过这些能力，因为我住在城市的中心。而在这里，不幸的是，将乘坐高度提高几英寸的效果对赛车的操控性是不利的。换取更多的离地净空是一个更高的重心，这意味着越野车柔软的弹力身体喜欢在角落里滚动一点。但是，如果你想要一辆操控精良的沃尔沃旅行车，你可能会订购插电式混合动力车V60T8。这款配备了北极星提供的小金色光环(以及金色安全带和刹车卡钳)，但它的价格也要高出22495美元。\nV60越野的能力骑在崎岖的道路上有一个权衡，当需要加油的时候。V60越野平均每加仑行驶25英里(9.4L/100公里)；相比之下，前轮驱动V60平均每加仑行驶27英里(8.7L/100公里)，插电式混合动力V60达到每加仑30英里(7.8L/100公里)。\n越野赛车在转弯时可能会比我喜欢的倾斜一点，但这可能会增加它在道路上的安全系数，因为它在弯道前强制刹车。这并不是说你在哥德堡最好的一辆车里感到不安全，它配备了最先进的驾驶员辅助系统，包括向前碰撞警告和自动紧急制动，可以识别大型四足动物、骑自行车的人和行人以及其他道路车辆。所有的盲点都会受到监控，车道保持也是标准的，但你确实需要支付Advanced套餐(1900美元)才能获得自适应巡航控制系统、360度停车摄像头、平视显示器和手机无线充电。\n到现在，你可能会有这样的印象，我并不完全迷恋V60越野。这是真的，但这也无关紧要，因为销售数字不会说谎。2020年前9个月，沃尔沃在美国售出了1048辆普通的V60旅行车，但V60越野车的数量几乎是美国的三倍-总共2903辆。但有一项统计数据会让我们所有的旅行车迷感到难过：在同一时期，有20462人购买了沃尔沃XC60 SUV。", "note_en": "The station wagon was once the most on-trend form factor for family vehicles, yet by the middle of the 1980s the venerable wagon had become an embarrassing mom-mobile. Instead, everyone wanted the new hotness called a minivan, which not only looked a bit like that new hand-held vacuum cleaner that everyone just bought, but also offered greater utility for the parent-driver. Eventually the minivan was also painted with the uncool mom aura, and the market moved to SUVs.\n Now, some 40 years after its zenith, time has almost run out on the station wagon. A handful of OEMs still pander to the wagoncurious, though, notably those stylish Swedes at Volvo. The company&#39;s two most handsome products right now are arguably the V90 and V60 wagons, which both somehow fuse a hint of muscle car to traditional two-box shape. But those aren&#39;t the only station wagons on the brand&#39;s roster, because there are the Cross Country models. The idea takes the station wagon, then adds a couple of inches of ride height, giving it the ability to better traverse unpaved roads—cross country, you see?\n I tested the  V90 Cross Country three years ago, and today it&#39;s the turn of the V60 Cross Country. Specifically, the $45,450 V60 Cross Country T5 AWD. You can distinguish it  from the regular V60 by the fact that the Cross Country rides a couple of inches higher up, and it is adorned with raw plastic bumpers around its bottom edges, the better to cope with spending time on gravel. Beauty is in the eye of the beholder and all that, but this eye beholds that those two little tweaks do the looks of this midsize wagon no favors.\n On the inside I have no such complaints, although I prefer the woven textile seats, a no-cost option, to the cream leather interior that came with our test car. However, the view from the inside suffers from a bit of a blind spot caused by the driver-side mirror.\n The digital instrument panel and nine-inch infotainment screen don&#39;t have quite the wow factor they once had, and the car runs the older version of Sensus rather than the Android Automotive-based infotainment that Volvo is now adopting. That said, the minimalist UI theme is stark and free of extraneous information, and even if you hate it there&#39;s (wired) Android Auto and Apple CarPlay.\n For US Volvos, T5 is the entry point to each different model, with a turbocharged 250hp (187kW) 2.0L four-cylinder gasoline engine under the hood. This is coupled to an eight-speed automatic transmission, and since the point is being able to drive where other wagons fear to tread, every Cross Country comes with all-wheel drive.\n For the same reason, the V60 Cross Country sits 8 inches (203mm) off the ground with just the driver onboard, 2.4 inches (61mm) higher up than the regular V60. That provides the Cross Country with an approach angle of 17˚, a breakover angle of 18.4˚, and a departure angle of 22.8˚. Volvo also says it can wade through 11.8-inch (300mm) deep streams, as long as one does that at a walking pace.\n However, I tested none of these abilities, because I live in the middle of a city. And here, unfortunately, the effect of raising the ride height by a couple of inches is detrimental to the car&#39;s handling. The trade-off for more ground clearance is a higher center of gravity, and that means the Cross Country&#39;s softly sprung body likes to roll a bit in the corners. But then if you wanted a fine-handling Volvo station wagon, you&#39;d probably order the plug-in hybrid V60 T8. That one comes with a little gold halo (and gold seat belts and brake calipers) courtesy of Polestar, but it also costs $22,495 more.\n The V60 Cross Country&#39;s ability to ride on rough roads has a tradeoff when it comes time to refuel. The V60 Cross Country averages a combined 25mpg (9.4l/100km); for comparison the front-wheel drive V60 averages 27mpg (8.7l/100km), and the plug-in hybrid V60 reaches 30mpg (7.8l/100km).\n  The Cross Country might lean a little more in the turns than I like, but that probably adds to its safety factor on the road since it enforces a &#34;brake before the corner&#34; driving style. Not that you ever feel unsafe cocooned in one of Gothenburg&#39;s finest, which come packed with the latest and greatest advanced driver assistance systems, including forward collision warning and automatic emergency braking, that recognizes large quadrupeds, cyclists, and pedestrians as well as other road vehicles. All the blind spots are monitored, and lane keeping is provided as standard, but you do need to pay for the Advanced Package ($1,900) to get adaptive cruise control, 360-degree parking cameras, a heads-up display, and wireless charging for your phone.\n By now, you might have the impression I&#39;m not entirely enamored with the V60 Cross Country. This is true, but it&#39;s also irrelevant, for the sales numbers do not lie. For the first nine months of 2020, Volvo sold 1,048 of the normal V60 station wagons here in the US, but nearly three times as many V60 Cross Countries—2,903 in all. But here&#39;s the stat that will make all us wagon fans feel bad: during the same time period, 20,462 people bought  Volvo XC60 SUVs.", "posttime": "2020-11-03 22:34:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,v60", "title": "2020沃尔沃V60越野：如何毁掉旅行车", "title_en": "The 2020 Volvo V60 Cross Country: How to ruin a station wagon", "transed": 1, "url": "https://arstechnica.com/cars/2020/11/the-2020-volvo-v60-cross-country-they-tried-to-suv-ize-a-station-wagon/", "via": "", "real_tags": ["2020", "v60"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1032971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让我们停止忽视显而易见的事实：宽带互联网接入服务是一种公用事业，需要作为一种公用事业进行监管。\n美国消费者对此表示赞同。今年早些时候的一项消费者报告调查发现，五分之四(80%)的消费者认为宽带服务与水电一样重要。事实上，宽带已经成为21世纪消费者日常生活中必不可少的服务。新冠肺炎危机突显了这一事实，因为我们许多人都依靠互联网在家工作，上虚拟教室，通过远程医疗服务接受医疗服务，与朋友和家人保持联系，以及娱乐。\n这场大流行证明了当今可靠、快速和负担得起的互联网连接是多么关键。然而，与水、电甚至电话服务不同的是，宽带互联网服务既不是普遍可用的，也不是为了保证接入、确保公平价格或促进市场竞争而进行监管。\n因此，在那些拥有和能够负担得起互联网服务的美国人和那些买不起互联网服务的美国人之间，存在着一条令人深感不安的“数字鸿沟”。这种分歧是双管齐下的，因为接入和负担能力都决定了消费者是否能够上网。接入是指连接宽带互联网的家庭，其可负担性取决于消费者是否能够支付互联网服务提供商(ISP)所要求的服务价格。\n不幸的是，事实证明，联邦通信委员会的负责人没有能力弥合这一鸿沟。事实上，数年前决定把宽频重新归类为“资讯服务”，而不是明显的“电讯服务”，实际上已令委员会失去了对互联网服务供应商有任何有意义的监管角色。下一届国会需要纠正这一错误，并制定一个新的框架来管理宽带服务，确保消费者既能接触到宽带服务，又能负担得起。\n可以肯定的是，FCC可以通过将宽带重新分类为电信服务来恢复其对宽带的监管权威。2005年最高法院对品牌X的裁决确立了欧盟委员会可以灵活地做出这样的分类决定-这些决定对消费者具有真正的后果，超出了深奥的法律程序。\n宽带是否是信息服务还是电信服务的问题本身就是目前网络中立斗争的核心，近20年来，这一问题一直是网络中立斗争的核心。冒着过度简单化的风险，信息服务分类粗略地转化为更少的法规。相反，电信服务指定有利于FCC拥有一套更强大的工具，这些工具植根于共同的运营商权限，有权更好地促进竞争，确保非歧视性接入，并对对消费者来说过于昂贵的费率设置上限。\nFCC在2015年将宽带正确归类为电信服务，作为其开放互联网命令的一部分，从而能够发布常识网络中立规则。这一行动在2016年USTelecom的裁决中得到了联邦法院的批准。不幸的是，当现任委员会一年后改弦易辙，决定再次将宽带重新分类，这一次是作为一项信息服务，作为废除2015年网络中立规则的基本部分时，所有这些都被抛弃了。尽管对我们来说宽带是一项电信服务是显而易见的，但分类辩论-阅读在恢复互联网自由秩序中解密宽带的充分理由-已经沦为中世纪的练习，目的是确定有多少天使可以在大头针头上跳舞。\n在FCC一次又一次地围绕网络中立性展开的来回争斗必须结束。毫无疑问，确保互联网开放是一项重要的政策斗争，但联邦通信委员会的失败揭示了一个更深层次的问题：我们如何才能最好地监管互联网服务提供商提供的互联网服务，而不是像反网络中立人群经常哀叹的那样，将其与监管互联网混为一谈。\n不能允许目前的现状继续下去，也不会以负担得起的价格增加更多的宽带接入。没有比脆弱的透明度要求更多的要求，互联网服务提供商不受FCC或国会强加的任何真正规则的约束。此外，康卡斯特(Comcast)和查特(Charge)等互联网服务提供商大多不受竞争影响--去年夏天发表的一项研究显示，仅这两家公司就垄断了4700万美国消费者，如果我们不考虑DSL是2020年真正具有竞争力的选择，那么就会有更多(额外的3300万人)。雪上加霜的是，互联网服务供应商收取的费用完全令人费解。同一城市内不同社区的房价各不相同，但目前还不清楚价格是如何确定的，或者价格是否一致。\n尽管FCC主席阿吉特·派(Ajit Pai)和其他人嘲笑2015年的开放互联网秩序是“公用事业式”的监管，但消费者现在认识到宽带服务就是这样：一种公用事业。它应该这样管理，以使消费者受益。不是ISP。\n新一届国会将于明年1月宣誓就职。它可以一劳永逸地解决这场争论。我们不能再忍受联邦通信委员会(FCC)摇摆不定的分类辩论，这场辩论的胜利者取决于每四年举行一次总统选举。因此，必须通过立法，授予FCC新的、明确的权力，将宽带服务作为一项基本的公共事业来管理。\n欧盟委员会有了像公用事业一样监管宽带的权力，可以通过设定价格上限来确保负担能力，特别是在没有有效竞争和价格太高的情况下。或者，FCC可以通过要求ISP拆分其网络以允许新进入者提供服务来刺激竞争。公用事业式的监管还可以用于要求部署到服务不足的地区，并标准化服务提供，以确保消费者能够负担得起套餐，以满足他们远程工作和在线学习的日常需求。最后，正如2015年的开放互联网秩序所证明的那样，公用事业监管允许FCC要求非歧视性地访问ISP网络，这是重新建立强有力的网络中立规则的基础。\n此外，国会必须资助一个大规模的互联网基础设施项目，让宽带进入每个美国家庭。据估计，到2020年，4200万美国人无法获得固定宽带服务是不可接受的。尝试在线上课的孩子们不应该开车去停车场使用图书馆、体育场或快餐店提供的免费WiFi。尽管农村地区普遍缺乏宽带接入，但这也是一个城市问题。《哥谭市公报》(The Gotham Journal)最近报道称：“根据该市的数据，该市40%的家庭--大约有340万人--既没有家庭互联网连接，也没有移动互联网连接，18%的家庭既没有家庭互联网连接，也没有移动互联网连接。”\n国会应该进一步考虑让所有美国人都买得起宽带的措施。今年早些时候的一项CR调查发现，消费者平均每月为互联网服务支付66美元。再加上其他费用和大流行带来的困难，这对许多家庭来说简直太昂贵了。借用一部非常古老的有线电视法，国会可以要求互联网服务提供商为所有消费者提供“基本服务”套餐，以今天带宽密集型应用所需的速度提供负担得起的、可靠的宽带。康卡斯特已经在以某种方式做到这一点(最初是作为2011年收购NBC环球的一个条件)，所以这个想法并不完全是一种延伸。\n这些只是增加宽带接入和负担能力的几个想法。这不是火箭科学，也不应该是党派问题。事实证明，互联网对美国人在21世纪的经济中取得成功是显而易见的，也是必不可少的。\n有了国会的资助，以及FCC新授予的权力和宗旨，将宽带视为基本的公用事业服务，政府可以-也必须-将更多的美国人连接到互联网和彼此之间。\n乔纳森·施万特斯(Jonathan Schwantes)是“消费者报告”(Consumer Reports)华盛顿办事处的高级政策顾问，主要研究影响宽带、电视、媒体和无线市场消费者的电信问题。\n感谢您阅读这篇技术污垢帖子。这几天有这么多事情争相吸引大家的注意力，我们真的很感谢您抽出时间来参加我们的活动。我们每天都在努力工作，为我们的社区提供高质量的内容。\nTechdle是为数不多的真正独立的媒体机构之一。我们背后没有一家大公司，我们在很大程度上依赖我们的社区来支持我们，在这个时代，广告商对赞助小型独立网站越来越不感兴趣-特别是像我们这样不愿在报告和分析方面出拳的网站。\n虽然其他网站已经求助于付费墙、注册要求和越来越烦人的/侵入性广告，但我们一直保持Techdle对任何人开放和可用。但是为了继续这样做，我们需要你们的支持。我们为我们的读者提供了多种方式来支持我们，从直接捐款到特别订阅和酷商品-每一点都有帮助。谢谢。", "note_en": "Let’s stop ignoring the obvious: broadband internet access service is a public utility and needs to be regulated as one.\n American consumers agree. A Consumer Reports survey from earlier this year found that four out of five (80 percent) consumers believe broadband service is as important as water and electricity. Indeed, broadband has become the essential service in the daily lives of 21st century consumers. The COVID-19 crisis has thrown this fact into sharp relief as many of us depend on an internet connection to work from home, attend virtual classrooms, receive medical care via telehealth services, stay connected with friends and family, and for entertainment.\n The pandemic has proven just how critical a reliable, fast and affordable internet connection is today. However, unlike water, electricity, or even phone service, broadband internet service is neither universally available, nor is it regulated to guarantee access, ensure fair prices, or promote competition in the marketplace.\n As a result, there exists a deeply troubling “digital divide” between those Americans who have and can afford internet service, and those who cannot. The divide is two-pronged, as both access and affordability determine whether consumers are able to get online. Access is meant as a home wired for broadband internet, and affordability is determined by whether a consumer can pay the price for service demanded by the internet service provider (ISP).\n Unfortunately, those in charge at the Federal Communications Commission have proven incapable of bridging this divide. In fact, the decision a few years ago to reclassify broadband as an “information service” instead of what it obviously is, a “telecommunications service” has practically removed the Commission from any meaningful oversight role over ISPs. The next Congress needs to rectify this wrong and enact a new framework to govern broadband service, ensuring that it is both accessible and affordable to consumers.\n To be sure, the FCC could restore its regulatory authority over broadband by reclassifying it as a telecommunication service. The 2005 Supreme Court decision in  Brand X established that the Commission has the flexibility to make such classification decisions—decisions with real consequences for consumers that extend beyond esoteric legal exercises.\n The very question of whether broadband is an information service versus a telecommunications service has been at the heart of the current net neutrality struggle for almost two decades. At the risk of gross oversimplification, an information service classification roughly translates into fewer regulations. Conversely, a telecommunications service designation avails the FCC of a stronger set of tools rooted in common carrier authority, with powers to better foster competition, ensure non-discriminatory access, and put a cap on rates that are too expensive for consumers.\n The FCC correctly classified broadband as a telecommunications service in 2015 as part of its  Open Internet Order, enabling the issuance of common sense net neutrality rules. This action was approved by a federal court in the 2016  USTelecom ruling. Unfortunately, all that was discarded when the current Commission reversed course a year later and decided to reclassify broadband once again, this time as an information service, as a fundamental part of its repeal of the 2015 net neutrality rules. Though obvious to us that broadband is a telecommunications service, the classification debate—read the l engthy justification for declassifying broadband in the Restoring Internet Freedom Order—has descended into a medieval exercise to determine  how many angels can dance on the head of a pin.\n The back-and-forth war over net neutrality fought time and time again at the FCC must end. Make no mistake, ensuring an open internet is an important policy struggle, but the FCC’s failures reveal a deeper problem: how can we best regulate internet service supplied by ISPs, which is NOT to be conflated with regulating the internet, as is so often the lament from the anti-net neutrality crowd.\n The current status quo cannot be allowed to stand and it will not increase more broadband access at an affordable price. Absent much more than flimsy transparency requirements, ISPs are free from any real rules imposed by the FCC or Congress. Moreover, ISPs like Comcast and Charter are mostly insulated from competition— a study published this past summer revealed that these two companies alone maintain a monopoly over 47 million American consumers, and even more (an extra 33 million) if we disregard DSL as a real competitive choice in 2020. Adding to the misery, the rates charged by ISPs are totally inscrutable. Prices vary from neighborhood to neighborhood within the same city, and yet there’s no clear sense how prices are determined or if they’re consistent.\n Though FCC Chairman Ajit Pai and others  ridiculed the 2015 Open Internet Order as “utility-style” regulation, consumers now recognize broadband service as exactly that: a utility. It should be governed as such to benefit consumers. Not ISPs.\n A new Congress will be sworn in next January. It can settle this debate once and for all. We can no longer endure the seesawing classification debate at the FCC, the winner of which depends upon a Presidential election every four years. Therefore, legislation must be passed to grant the FCC new, clear authority to govern broadband service as a telecommunications service, an essential utility.\n Emboldened with the power to regulate broadband like a utility, the Commission can ensure affordability by applying price caps, especially where there is not effective competition and prices are too high. Alternatively, the FCC could spur competition by requiring ISPs to unbundle their networks to allow new entrants to offer service. Utility-style regulation could also be used to require deployment to underserved areas and to standardize service offerings to make sure consumers can afford a package to meet their everyday needs of remote work and online learning. Finally, as demonstrated by the 2015 Open Internet Order, utility regulation permits the FCC to require non-discriminatory access to ISP networks, the foundation for re-establishing strong net neutrality rules.\n Additionally, Congress must fund a massive internet infrastructure project to get broadband into the home of every American family.  Estimates that 42 million Americans lack access to fixed broadband service is unacceptable in 2020. Kids trying to attend class online shouldn’t have to drive to a  parking lot to use free WiFi offered by libraries, sports arenas, or fast food restaurants. And though rural areas typically suffer a lack of broadband access, it is also an urban problem. The  Gotham Gazette recently reported that: “According to city data, 40% of households in the city -- home to roughly 3.4 million people -- don’t have both home and mobile internet connections, and 18% have neither.”\n Congress should further consider measures to make broadband affordable for all Americans. A CR survey from earlier this year found that consumers paid an average of $66 per month for internet service. Coupled with other costs and the hardships posed by the pandemic, this is simply too expensive for many families. Borrowing from  a very old cable law, Congress could require ISPs to offer a “basic service” package for all consumers that provides affordable, reliable broadband at speeds that are required for today’s bandwidth-heavy applications.  Comcast is already doing this in some fashion (originally as a condition to its acquisition of NBC Universal in 2011), so the idea is not exactly a stretch.\n These are but a few ideas to increase broadband access and affordability. This isn’t rocket science and it should not be a partisan issue. The internet has proven obvious and essential for Americans to succeed in the 21st century economy.\n With Congressional funding and a new grant of authority and purpose at the FCC to treat broadband like the essential utility service that it is, the government can—and must—connect many more Americans to the internet and to each other.\n Jonathan Schwantes is a senior policy counsel in Consumers Reports’ Washington DC office where he focuses on telecommunications issues affecting consumers in the broadband, television, media, and wireless markets.\n Thank you for reading this Techdirt post. With so many things competing for everyone’s attention these days, we really appreciate you giving us your time. We work hard every day to put quality content out there for our community.\n Techdirt is one of the few remaining truly independent media outlets. We do not have a giant corporation behind us, and we rely heavily on our community to support us, in an age when advertisers are increasingly uninterested in sponsoring small, independent sites — especially a site like ours that is unwilling to pull punches in its reporting and analysis.\n While other websites have resorted to paywalls, registration requirements, and increasingly annoying/intrusive advertising, we have always kept Techdirt open and available to anyone. But in order to continue doing so,  we need your support. We offer a variety of ways for our readers to support us, from direct donations to special subscriptions and cool merchandise — and every little bit helps. Thank you.", "posttime": "2020-11-03 22:34:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "对待,treat,服务", "title": "是时候像对待基本服务那样对待宽带了", "title_en": "Time to Treat Broadband Like the Essential Service It Is", "transed": 1, "url": "https://www.techdirt.com/articles/20201026/12050345591/time-to-treat-broadband-like-essential-service-it-is.shtml", "via": "", "real_tags": ["对待", "treat", "服务"]}, {"category": "", "categoryclass": "", "imagename": "67fe43ccc17defe6ebecb1b5c855dc25.jpg", "infoid": 1032970, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当您将加密资产留在交易所时，有人可能会登录到您的帐户，并将您的资产发送到其他钱包。当然，也有一些安全功能，比如电子邮件验证和双因素身份验证。但你实际上是在依赖你最喜欢的交易所的安全团队。\nZengo和其他非托管钱包让你负责安全。你在充当你自己的密码库。这使得创建借记卡变得更加复杂，因为Zengo无法为您发送和转换加密货币。\n曾戈加入了威士的金融科技快速通道项目，打算在2021年初推出支付卡。虽然这张卡最初只会在美国推出，但这家初创公司已经计划在其他国家发行。\n由于Zengo不知道您拥有哪些加密货币，您必须先将您的加密转换为美元。在移动应用程序中，您可以将一些资金转换为法定货币(如美元)，然后将该金额存入您的卡中。如果您计划定期使用信用卡，您可以每周兑换固定金额。\n与其他加密驱动的卡相比，有一个额外的转换步骤。“如果你像Coinbase那样自动操作，问题是你不能选择你想用来消费的密码。他们要么帮你做决定，要么强迫你在所有交易中做出一次选择。“Zengo联合创始人兼首席执行官乌里尔·奥哈扬告诉我。\n此外，你的曾戈钱包里的任何东西都不能与你的卡一起使用。即使您的卡被攻破，您的加密资产也会保持安全。\nZengo已经允许你通过与MoonPay和Coinmama的合作在应用程序中获得加密货币。多亏了借记卡，这家初创公司将同时拥有入口匝道和出口匝道，并支持法定到密码和密码到法定的转换。", "note_en": "When you leave your crypto assets on an exchange, somebody could log in to your account and send your assets to other wallets. Sure, there are some security features, such as email validation and two-factor authentication. But you’re essentially relying on the security team of your favorite exchange.\n ZenGo   and other non-custodial wallets put you in charge of security. You’re acting as your own crypto bank. It makes it more complicated to create a debit card as ZenGo can’t send and convert cryptocurrencies for you.\n  ZenGo is joining Visa’s Fintech Fast Track program with the intention to release its payment card in early 2021. While the card will initially launch in the U.S. only, the startup already plans to release it in other countries.\n As ZenGo has no idea what cryptocurrencies you own, you’ll have to convert your crypto to USD first. In the mobile app, you’ll be able to convert some funds to fiat (such as USD) and deposit that amount on your card. If you plan to use your card regularly, you’ll be able to convert a fixed amount every week.\n Compared to other crypto-powered cards, there’s an additional conversion step. “The issue if you do it automatically like Coinbase is that you can’t pick which crypto you want to use for spending. They decide for you or they force you to make a choice once for all your transactions,” ZenGo co-founder and CEO Ouriel Ohayon told me.\n Additionally, anything that remains in your ZenGo wallet can’t be used with your card. Even if your card is compromised, your crypto assets remain safe.\n ZenGo already lets you acquire cryptocurrencies in the app through partnerships with MoonPay and Coinmama. Thanks to the debit card, the startup will have both on-ramps and off-ramps with support for fiat-to-crypto and crypto-to-fiat conversions.", "posttime": "2020-11-03 22:28:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,钱包,wallet,加密", "title": "\n密码钱包应用Zengo将推出借记卡", "title_en": "\n\t\t\t\tCrypto wallet app ZenGo to launch debit card\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/crypto-wallet-app-zengo-to-launch-debit-card/", "via": "", "real_tags": ["密码", "钱包", "wallet", "加密"]}, {"category": "", "categoryclass": "", "imagename": "0fc45e322ae7f9afdf2cc678890b9ed3.jpg", "infoid": 1032968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旅行者2号探测器是美国宇航局旅行次数最多的航天器之一，在过去的8个月里一直无法与地球通信。旅行者2号一直在星际空间的边缘独自徘徊，收集距离地球约116亿英里的数据，并将其发回给我们。\n从实验室到你的收件箱。每周从CNET获取最新的科学故事。\n唯一可以与探测器通信的无线电天线是澳大利亚的深空站43号(DSS43)，在NASA完成一系列硬件升级期间，该天线一直处于离线状态。根据美国宇航局的说法，DSS43上的一些发射器已经47年没有更换过了。为了测试新的硬件，碟子在10月29日用几个命令ping了旅行者2号。这是自3月中旬以来首次向航天器发射信号。\n由于探测器距离太远，通讯团队不得不等待超过34个小时才能得到回复。\n果然，旅行者2号毫无问题地收到了命令，并发回了一个“你好”。\n在过去的8个月里，深空站43号一直在进行升级。@NASAVoyager-2一直在等待我们能够再次向它发送命令。10月30日星期五，我们发送了这些命令&amp；经过34小时48分钟的往返行程后，a&#34；hello&34；返回！#DSS43@CSIRO pic.twitter.com/qyMEc9Jkxc。\n-堪培拉DSN(@canberraDSN)2020年11月2日。\n幸运的是，旅行者2号似乎仍然幸福地没有意识到自3月份以来地球上发生的所有可怕的事情。\n美国国家航空航天局(NASA)的深空网络允许地球上的科学家与太阳系内的航天器和漫游车进行通信。该网络由位于美国、西班牙和澳大利亚的三台巨型望远镜组成。\n但由于旅行者2号的轨迹，美国和西班牙的望远镜无法与其通信。当探测器经过海王星的卫星海王星Triton时，它被弹出了太阳系的平面。如果你把太阳系想象成一个盘子，探测器就像一颗豌豆，绕着土豆滚到一边，然后开始朝地板移动。从那个位置，北半球的望远镜不能发出信号--但是DSS43可以。\n有了宇宙号召，工程师和科学家可以确信，硬件升级不会扰乱我们与深空探测器的通信能力。\nNASA喷气推进实验室的深空网络项目经理布拉德·阿诺德(Brad Arnold)说，这次与旅行者2号的试验交流明确地告诉我们，我们正在进行的工作正在进行中。升级计划于2021年完成。\n虽然探测器现在已经43岁了，但它还在继续工作。一年前，旅行者2号科学家公布了探测器进入星际空间时收集的新数据。今年早些时候，在DSS43离线之前，旅行者2号遭遇了一次故障，关闭了它的科学仪器，但它很快就恢复了在线，并准备继续进行实验。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "The   Voyager 2 probe, one of  NASA&#39;s most well-traveled spacecraft, has been unable to communicate with Earth for the past eight months. Voyager 2 has been wandering alone at the edge of interstellar space, gathering data some 11.6 billion miles from Earth and sending it back to us.\n  From the lab to your inbox. Get the latest science stories from CNET every week.\n The only radio antenna that can communicate with the probe, Deep Space Station 43 (DSS43) in Australia, has been offline while NASA completes a series of hardware upgrades. Some of the transmitters on DSS43 haven&#39;t been replaced for over 47 years,  according to NASA. To test new hardware, the dish pinged Voyager 2 on Oct. 29 with a few commands. It was the first time since mid-March that a signal was beamed to the spacecraft.\n And because the probe is so far away, the communication team had to wait over 34 hours for a reply.\n Sure enough, Voyager 2 received the commands with no problems and sent back a &#34;hello.&#34;\n For the past 8-months, Deep Space Station 43 has been undergoing upgrades.  @NASAVoyager-2 has been waiting for us to be able to send it commands once again. On Friday 30th October, we sent those commands &amp; after a 34hour 48 min round trip time, a &#34;hello&#34; came back!  #DSS43  @CSIRO  pic.twitter.com/qyMEc9Jkxc\n— CanberraDSN (@CanberraDSN)  November 2, 2020\n Fortunately, it appears Voyager 2 remains blissfully unaware of all the  terrible things that have occurred on Earth since March.\n NASA&#39;s Deep Space Network allows Earth-bound scientists to communicate with spacecraft and rovers across the solar system. The network consists of three huge telescopes located in the US, Spain and Australia.\n But the US and Spanish telescopes are unable to communicate with Voyager 2 because of its trajectory. When the probe passed by Triton, a moon of Neptune, it was shot out of the solar system&#39;s plane. If you think of the solar system like a plate, the probe is like a pea that rolled around a potato and off the side and started traveling toward the floor. From that position, the Northern Hemisphere telescopes can&#39;t send a signal -- but DSS43 can.\n With the cosmic call, engineers and scientists can be confident the hardware upgrades haven&#39;t messed with our ability to communicate with deep space probes.\n &#34;This test communication with Voyager 2 definitely tells us that things are on track with the work we&#39;re doing,&#34; said Brad Arnold, Deep Space Network project manager at NASA&#39;s Jet Propulsion Lab. The upgrades are scheduled to be completed by 2021.\n Although the probe is now 43 years old, it just keeps on truckin&#39;. A year ago, Voyager 2   scientists published new data collected by the probe as it passed into interstellar space. Earlier this year, before DSS43 was taken offline, Voyager 2   suffered a glitch that shut down its science instruments but it was quickly back online and ready to continue performing its experiments.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-11-03 22:27:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,美国,美国国家航空航天局,voyager,探测器", "title": "美国国家航空航天局旅行者2号探测器自3月以来首次收到命令", "title_en": "NASA's Voyager 2 Probe Receives First Commands Since March", "transed": 1, "url": "https://www.cnet.com/news/nasas-voyager-2-probe-receives-first-commands-since-march-sends-back-a-hello/", "via": "", "real_tags": ["nasa", "美国", "美国国家航空航天局", "voyager", "探测器"]}, {"category": "", "categoryclass": "", "imagename": "2dc4f69e661f67af2553fca7aa327f56.png", "infoid": 1032966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "效用的概念是由哲学家杰里米·边沁在一本名为“道德和立法原则导论”的书中提出的，该书于1789年首次出版。边沁将效用描述为“任何对象的财产，借此它往往会产生利益、优势、善或幸福。”\n在经济学中，效用是对产品或服务消费满意度的衡量标准。经济人是为最大限度地获得公用事业而优化的。正如迪恩·埃利斯和劳伦斯·雅各布斯所定义的那样，在市场营销中，效用创造意味着“所有的东西，无论是真实的还是想象的，这些东西都能让产品或服务更令人满意，从而对客户更有价值”。埃利斯和雅各布斯确定了8类营销工具，即形式、时间、运输、位置、形象、信心、便利和定制。这些都是为客户创造实用程序的东西。\n那么产品设计带来的效用创造呢？设计活动能创造什么价值？设计如何提高产品的可接受性和采用率？\n让我们使用上面提到的Ellis和Jacobs的定义，并将其重新用于产品设计：\n通过设计创造的效用可以被定义为所有的东西，有形的或无形的，它们使产品更容易被用户接受，从而对用户更有价值。\n该定义突出了好的产品设计的两个预期结果，即产品可接受性和用户感知价值。可接受性是用户决定使用(并继续使用)产品的结果，因为使用它可以满足需求。是有价值的东西，因为它可以收取溢价。对于免费使用的产品，较高的感知价值使其成为竞争对手的首选。\n产品设计有三类实用工具。这三个是功能性、可用性和体验性。下面概述了每种功能及其对用户的好处。\n根据奥地利经济学家卡尔·门格(Carl Menger)的说法，有用的东西是“可以与满足人类需求有因果关系的东西”。产品价值取决于产品解决用户问题和满足用户需求的程度。产品在完成工作方面越有效，就越有可能对用户有价值。如果产品是针对正确用户的正确问题的正确解决方案，那么就可以实现产品与市场的匹配。\n情境产品功能植根于实用主义哲学。哲学传统假定，只有当对象或思想有用并产生实际结果时，它才是有价值的。凡是管用的，就有它的价值。因此，为了设计有用的产品，设计师将用户放在他们所做的一切的中心-与用户共同迭代设计，为用户测试生成假设，并与用户一起执行原型评估。期望的结果是创造一个有效的工具来解决用户问题，丰富生活。或者简单地说，是有用的。\n目的：确定正确的问题以构思正确的解决方案并交付解决方案。\n用户实用：能够用解决方案(产品)解决问题，丰富日常生活。\n一款产品可能拥有尖端的功能集，但这并不意味着它也很容易使用。如果没有可用性，用户就无法体验到实际后果。布莱恩·沙克尔(Brian Shackel)写道，可用性被定义为“人类可以轻松有效地使用的能力”。产品不仅要满足用户需求，还必须提供高质量的使用。为了指定和衡量可用性，Shackel确定了创建可用产品必须达到的四个标准。这四项是：\n可学习性，即。“用户多长时间后开始使用高级功能？”，\n灵活性，即“一款应用程序在互联网信号强度不同的区域表现如何？”\n用户效用：能够以最少的认知努力和时间掌握产品的使用，并开始从中受益。\n在过去的十年里，产品的体验方面得到了很大的关注。自20世纪80年代初个人电脑革命开始以来，数字产品成为大众消费的工具。今天，我们生活在一个“也有一款应用程序可以做到这一点！”的世界里。当数字产品专门用于办公环境时，生产力是最重要的。大众在社会环境中使用数码产品，除了功能价值外，还追求刺激、愉悦、乐趣、愉悦、创新、原创等享乐体验。体验是产品使用的结果，嵌入在体验者的记忆、当前感受和文化背景中。\n用户效用：能够信任产品来完成工作，不会感到沮丧和不高兴。\n这是一种尝试，试图确定这三个主要设计实用程序。该框架将产品创建和设计活动与用户需求联系起来。它的目的是让人们一瞥产品的采用率和接受度。产品特征存在的理由往往是以商业为导向的，即收入增长、交易额和日常活动(这是理所当然的)。但要确保这些功能是公制的，取决于用户的可接受性。因此，在添加功能之前，请始终询问“在添加之后，用户是否更愿意接受(或继续接受)产品？”\n边沁，J.(1907)。道德和立法原则导论。牛津：克拉伦登出版社。从互联网上检索到2020年2月11日：https://oll.libertyfund.org/titles/278。\nEllis，D.S.&Amp；Jacobs，L.W.(1977)。营销工具：新面貌。“营销科学学院学报”冬季版，第5期(1)，21-26期。\nShackel，B.(2009)。可用性-上下文、框架、定义、设计和评估。与计算机交互，第21期(5-6期)，12月，339-346期。Https://doi.org/10.1016/j.intcom.2009.04.007", "note_en": "The concept of utility was introduced by philosopher Jeremy Bentham in a book titled  An Introduction to the Principles of Morals and Legislation, first published in 1789. Bentham described utility as “property in any object, whereby it tends to produce benefit, advantage, good, or happiness.”\n In economics, utility is a measure of satisfaction upon the consumption of a product or service.  Homo economicus is optimized for maximum utilities attainment. In marketing, utility creation is meant for “all things, real or imagined, which make a product or service more desirable and thus more valuable to the customer,” as defined by Dean Ellis and Lawrence Jacobs. Ellis and Jacobs identified 8 categories of marketing utilities, namely form, time, shipping, location, image, confidence, facilitating and customizing. These are things that create utilities for customers.\n What about the utility creation by product design? What values can design activities create? How can design enhance product acceptability and adoption?\n Let’s use the above-stated Ellis and Jacobs’ definition and repurpose it for product design:\n Utility creation by design can be defined as all things, tangibles or intangibles, which make a product more acceptable and thus more valuable to the user.\n The definition highlights the two desired consequences of a good product design i.e. product acceptability and user-perceived value. Acceptability is the consequence of user decision to use (and continue using) a product because using it leads to satisfaction of a need. Being valuable matters, as it can command premium prices. For free-to-use product, higher perceived value makes it a preferred choice over competitors.\n There are three category of utilities for product design. The three are  functional,  usability and  experience. The followings outline each function and its user benefits.\n  Useful things are, according to Austrian economist Carl Menger , “things that can be placed in a causal connection with the satisfaction of human needs.” Product value depends on how well the product solves user problems and fulfills user needs. The more effective a product is in getting the job done, the more likely it is valuable to users. If the product is the right solution for the right problem for the right user, then product-market fit becomes attainable.\n The situated product function is rooted in the philosophy of pragmatism. The philosophical tradition postulates that object or idea is valuable only if it is useful and produces practical consequences. Whatever works, hence its worth. So, in order to design useful products, designers place users at the center of everything they do — co-iterate designs with users, generate hypotheses for user testing and perform prototype evaluations with users. The desired outcome is the creation of an effective tool to solve user problems and enrich lives. Or simply,  being useful.\n Purpose: To identify a right problem to ideate a right solution and ship the solution\n User utility: Able to use the solution (product) to solve problems and enrich daily lives.\n    A product may have cutting-edge feature set but that doesn’t mean it is also easy to use. Without usability, users cannot experience the practical consequences. Usability is defined as “the capability to be used by humans easily and effectively”, wrote Brian Shackel. Not only meeting user needs, a product must provide quality of use. To specify and measure usability, Shackel identified four criteria that must be achieved in order to create usable product. The four are:\n Learnability i.e. “How soon before a user starts using the advanced features?”,\n Flexibility i.e “How does an app perform in areas with different internet signal strength?”\n  User utility: Can master the use of a product, with minimal cognitive efforts and time, and start to benefit from it.\n  The experiential aspects of a product have been getting plenty of attention in the past decade. Since the PC revolution began the early 1980s, digital products became tools of mass consumption. Today, we’re living in a world where “there’s an app for that too!” When digital products are exclusively used in office environment, productivity is paramount. When the masses use digital products in social environments, in addition to functional value, they seek a hedonic experience such as, excitement, pleasure, fun, enjoyable, innovativeness, and originality. An experience is a consequence of product usage, embedded in contexts of experiencer’s memories, current feelings and cultural settings.\n  User utility: Able to trust a product to get the job done, with the absence of frustration and unhappiness.\n  This is an attempt to identify that three primary design utilities. The framework links product creation and design activities to user needs. It aim to provide glimpses into the needle-movers of product adoption and acceptability. The raison d&#39;être of product features tend to be business-oriented i.e. revenue growth, transaction value and daily actives (and rightly so). But to ensure that the features are metric movers depends on user acceptability. So, before adding features, always ask “Are users more willing to accept (or continue to accept) the product following the addition?”\n   Bentham, J. (1907).  An Introduction to the Principles of Morals and Legislation. Oxford: Clarendon Press. Retrieved 02/11/2020 from the internet: https://oll.libertyfund.org/titles/278\n Ellis, D.S. &amp; Jacobs, L.W. (1977). Marketing Utilities: A New Look.  Journal of the Academy of Marketing Science Winter, 5(1), 21-26.\n  Shackel, B. (2009). Usability – Context, framework, definition, design and evaluation.  Interacting with Computers, 21(5-6), December, 339–346. https://doi.org/10.1016/j.intcom.2009.04.007", "posttime": "2020-11-03 22:16:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,联系,product,产品", "title": "将产品设计与人的需求联系起来", "title_en": "Linking Product Design to Human Wants", "transed": 1, "url": "https://userfriendly.substack.com/p/linking-product-design-to-human-wants", "via": "", "real_tags": ["设计", "联系", "product", "产品"]}, {"category": "", "categoryclass": "", "imagename": "dab4eda0c0593d71ee40d9f2ba0248d3.jpg", "infoid": 1032965, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我职业生涯的这个时刻，我是一名早期的Javascript全栈开发人员。我对Javascript有很好的了解，但是Reaction有时会让我更头疼才能深入理解。我是在学习基于类的组件的过程中长大的，所以后来，当钩子被引入时，我发现很难过渡到这种新的编写Reaction的方式。这就是我想上这门课的原因。\n作为我学习过程的一部分，我不会记录下每一节的所有内容，而是记下我学过的每一节。通常，我的解决方案虽然可行，但比肯特的方案更复杂，也不那么优雅。这是我希望在编码中改进的另一个方面。\n当然，你会在epicreact中找到更多的细节和研讨会本身。dev.我希望这会对除我之外的其他人有用，并原谅我在英语方面的错误(不是以英语为母语的人)。\n在第一个练习中，有必要使用普通Javascript进行一些DOM操作。由于我在日常工作中使用了这种方法，所以在第一部分中我没有遇到任何困难。事实上，在将严重依赖jQuery的代码库转换为普通Javascript的过程中，我学到了很多。\n然而，我确实不得不对额外的锻炼做了一些思考，因为我不习惯于处理身体的根元素。所以我个人并不知道-但现在我知道了，这很有意义-Document对象中有一个Body对象。我不会在这里给出解决方案，但这是一个重要的提醒，要始终检查父元素…。它们里面藏着什么：)。\n研讨会的第二个练习已经更棘手了-我对此很高兴，因为我肯定不想再学同样的东西了。我们使用React.createElement的频率很低(如果有的话)。使用JSX我们只需跳过这一部分，但这就是它在暗中工作的方式。所以在了解了jQuery在Javascript中做了什么之后，现在它在Javascript中是Reaction。\n我在这里了解到的第一件事是，在REACTION中著名的属性‘Child’对应于普通JS中的textContent。当然，这是有意义的，事实上，我们正在呈现一些用HTML可视化生成的文本。\n第二件事是createElement有三个(或更多)可以传递的参数。\n事实上，甚至不必在createElement的第二个参数中定义Child属性，但可以在方法的末尾列出。\n第三个练习是关于创建简单的JSX元素，Babel将使用React.createElement将这些元素转换为普通的JS。由于它基本上是前几次练习的反向工程，所以并不困难。但是，有趣的是，在div元素中使用了散布操作符，createElement将其放置在正确的位置：\nConst className=&#39；myClass=#39；；const Children=&#39；This is my text&#39；；const props={Children，className}element=&lt；div{...props}/&gt；\n视频中的另一个有趣之处是关于使用扩散操作符的位置优先排序。假设我们有上面的道具，但是我们想用另一个名称覆盖className，我们必须在放置道具之前放置散布道具。在综合中，右边的参数总是优先于左边的参数。\n现在，我们终于开始创建组件了。第一部分在于创建一个基本上返回div的函数，因此我们不在呈现的元素中重复div div，而是将函数与字符串一起作为“Child”传递。我知道但显式忘记的一件事是，如果我将参数作为对象传递给函数，则该参数也必须是对象。所以：\n接下来是引用相同的helloFunction，但将其作为元素直接通过babel编译，而不需要通过createElement。多亏了JSX，这是可能的，只需将函数名的第一个字母作为大写，并在Element对象中引用它就足够了。HelloFunction=()={}。\n接下来，是实现用于类型检查的proTypes的时候了，给出了具有两个参数(都是字符串)的相同的上述函数。在研讨会中，我们解释了如何制作用于手动检查类型的proTypes函数。但有趣的是，它没有利用道具类型库。诚然，对于两个道具的简单检查，导入整个库是过多的；但我认为我永远不会只使用两个检查。\n我也没有收到个性化的信息，但是标准的警告是可以理解的\n啊，我们开始吧，在下一个练习中有一个库…的实现。哎呀，我有点过头了。但好的一点是，要实现也是‘isRequired’\n在本练习中，需要以各种方式将样式应用到自定义组件。在第一部分，只需将内联样式添加到一个小div；然后添加到传递其className道具的自定义组件；最后，仅传递一个字符串作为大小道具，并在自定义组件内动态选择样式。\n第一个注意事项：在制作可重用组件时，通常最好将所有缺省值放在左侧以及用户提供的内容(扩散操作符)之后，因为我们不想强制执行某些内容。\n第二个注解：和往常一样，我把事情搞得过于复杂了。由于传递的Size属性将仅为Small、Medium和Large，并且类称为box-Small、Box-Medium、Box-Large，因此用传递给组件的Size道具替换Size就足够了。\n将其添加到一个三元运算符中，以防它不是道具，我所做的是一个嵌套的三元运算符，其中包含一个用类名创建的对象。要复杂得多，尽管它使用的是😁。\n常量大小={Small：#39；box--Small&#39；，Medium：&#39；box--Medium&#39；，Long：&#39；box--Large&39；}className={`box${size=#39；Small&#39；？尺码。小：尺码=#39；中号？Sizes.Medium：sizes.Large}`}。\n在第一个练习中，对象将创建一个提交侦听器/处理程序，它将调用作为道具传递的主组件中的函数。\n我们可以将事件(将是Reaction合成事件)放在每个元素上；但是，onSubmit进入表单内部以捕获所包含的每个字段。合成事件是响应创建的对象，其外观和行为与常规DOM事件相似。仍然可以使用event.nativeEvent访问DOM事件，但是，合成事件已优化为使用Reaction代码和虚拟DOM。\n然后，我在函数内创建了一个函数(回调)，一旦单击提交按钮就会调用该函数。我已经向该事件添加了brementDefault()，以防止页面刷新(作为表单的默认事件)。\n另一个有趣的事情是关于可访问性。屏幕阅读器需要将输入与其标签相关联。因此需要为输入提供id和标签htmlFor(与普通HTML中的=参数相同)。此外，这提供了在单击输入时将焦点放在输入上的特性。\n练习的第二部分是关于执行与上面相同的操作，但使用useRef挂钩。UseRef只是指向元素的引用指针，首先，它需要从“action”而不是“action-dom”导入。\n然后，将引用添加到Main函数(或自定义组件)中的输入&lt；input ref={usernameInput}&gt；，我们可以调用钩子：const usernameInput=useRef(Null)；为什么是null？UseRef的参数是初始值。但在本例中，我们不需要这些，只需要usernameInput中的内容。\n最后，我们可以通过以下方式访问所有引用的属性，如输入值：usernameInput.current.value。\n在下一个积分中，需要创建受控输入。受控输入是由组件状态控制的输入字段。这意味着通过以下状态设置输入值：&lt；input ref={usernameInput}value={username}onChange={handleChange}/&gt；\n然后，我们可以在组件顶部设置状态：const[username，setUsername]=useState(&#39；&#39；)；最后，使用该状态更改handleChange函数中输入值。在本例中，将每个关键点转换为小写：\n因此流程如下：来自用户的输入-&gt；更新输入状态-&gt；转换输入状态-&gt；将状态作为输入的值发送-&&gt;输入出现在屏幕上。\n在本例中，这些练习只是一个小小的演示，目的是展示在通过映射显示DOM中的元素时使用唯一索引键的重要性。不是没有，不是使用MAP函数的预置索引，而是使用一组预设的键来使用。这还允许Reaction保持输入的状态，即使在连续渲染的情况下也是如此。\n不这样做是一个错误，会导致任何类型的不可预测的行为。这是我以前做过的，在面试中也花了我很多分。\n这就是史诗反应基础部分的全部内容。我已经知道接下来的工作坊会更有挑战性，但是知道/被提醒一些基础知识是很有用的。", "note_en": "At this moment in my career, I’m a Javascript fullstack developer in the early stages. I’ve a good knowledge of Javascript, however React gives me sometimes a little more than a headache to understand deeply. I grew up in my learning with class based components, so later, when hooks were introduced, I found a little difficult to transition to this new way of writing React. That’s why I wanted this course.\n As part of my learning process, I’m going to note down not everything, but what I learnt, for each section. Often my solution was, although working, more complicated and less elegant than Kent’s one. That’s another aspect I wish to improve in my coding.\n Of course you will find many more details and, well, the workshop itself directly in  epicreact.devI hope this will be useful to somebody else apart from me, and forgive my mistakes in English (not a native speaker).\n  In the first exercise, it’s necessary to make some DOM manipulation with plain Javascript. As I’m using this method in my daily work, I had no difficulties in the first part. As a matter of fact, I’m learning a lot into transforming a codebase that is heavily relying on jQuery into plain Javascript.\n However, I did have to do some thinking on the additional exercise, as I’m not used to work with the root element of the body. So I personally didn’t know -but now that I know, it makes sense - that there’s a body object inside the document object. I won’t give here the solution, but it’s an important reminder to always check the parent elements… what are they hiding inside :)\n  The second exercise of the workshop was already trickier - which I was happy about because definitely I didn’t want to learn again the same stuff.It’s not often, if ever, that we are using the React.createElement. Using JSX we just skip this part, but that’s how it works under the hood.So after learning what jQuery is doing in Javascript, now it’s React in Javascript.\n First thing I learnt here is that the famous property ‘children’, in React, corresponds to textContent in plain JS. It makes sense, of course, as a matter of fact we are rendering some text made visually in HTML.\n The second thing is that createElement has three - or more - arguments that can be passed.\n  As a matter of fact, the children property doesn’t even have to be defined inside the second argument of createElement, but can be listed at the end of the method.\n  The third exercise was about creating simple JSX elements that Babel will transform in normal JS with React.createElement. As it’s basically almost a reverse engineering of the previous exercises, it was not difficult. However, it was interesting the use of the spread operator inside a div element, which createElement puts in the correct position:\n const className = &#39;myClass&#39;;const children = &#39;this is my text&#39;;const props = { children, className }element = &lt;div {...props}/&gt;\n  Another interesting point in the video is about prioritazion of position using the spread operator. Supposing that we have the above props, but then we want to override the className with another name, we have to place the spread props before. In synthesis, the right argument will always override the left ones.\n   So here we go finally to start creating components. The first part consists in creating a function that basically returns a div, so instead of repeating div div in the rendered element, we just pass the function with the string as “children”. One thing that I knew but forgot explicitly is that if I pass a parameter to the function as an object, the argument must be an object as well. So:\n      Following that, it’s about referring the same helloFunction but make it directly compiled through Babel as an element, without needing to pass through createElement. This is possible thanks to JSX, and it’s enough to make the function name with first letter as capital, and reference it inside the element object as that. HelloFunction = () = {}\n   Next, it was the time of implementing propTypes for typechecking, giving the same above function to have two parameters, both strings. In the workshop, it’s explained how to make a propTypes function for checking manually the type. But it’s interesting that it’s not taking advantage of the prop-types library. It is true that for a simple check of two props, importing a whole library is excessive; but I don’t think I’ll ever just use two checks.\n   I’m not getting either a personalized message, but the standard warning is understandable enough\n  Ah, here we go, in the next exercise there’s the implementation of the library… ooooops, I went a little over head. But good point, to implement also ‘isRequired’\n    In this exercise it was needed to apply style to a custom component in various ways. On a first part, just adding inline styling to a small div; then to a custom component passing its className prop; finally, passing only a string as a size prop and selecting dynamically the style inside the custom component.\n First note: when making a reusable component, normally it’s good to place all defaults on the left and what the user is providing (spread operator) after, because we don’t want to enforce something.\n Second note: as usual I overcomplicated things. As the size property passed would be only small, medium and large, and the classes are called box—small, box—medium, box—large, it’s enough to substitute the size with the size prop passed into the component.\n  adding that to a ternary operator in case it’s the prop is not present.What I did instead was a nested ternary operator with an object created with the classes names inside. Much more complicated, although it was working 😁\n const sizes = { small: &#39;box--small&#39;, medium: &#39;box--medium&#39;, large: &#39;box--large&#39;}className={`box ${size === &#39;small&#39; ? sizes.small : size === &#39;medium&#39; ? sizes.medium : sizes.large}`}\n  In the first exercise, the object is creating a submit listener/handler that will call the function in the main component, which is passed through as a prop.\n We can put events (will be React synthetic events) on each element; however, the onSubmit goes inside the form to catch every field that is contained.Synthetic events are objects that React creates that look and behave like regular DOM events.It’s still possible to access the DOM event with  event.nativeEvent, however, the synthetic one is optimized to work with React code, and the virtual DOM.\n I created then a function inside the function (a callback), called once the submit button is clicked. And I’ve added the preventDefault() to that event to prevent the page to refresh (as default event for a form).\n Another interesting thing is about accessibility. Screen readers need to associate the input with its label. So it’s needed to give the input an id and the label a htmlFor (the same for= parameter in normal HTML). Moreover, this gives the property of focusing on the input when clicking on it.\n The second part of the exercise was about doing the same as above but using the useRef hook. UseRef are simply reference pointers to an element.First, it’s needed to be imported from ‘react’ and not ‘react-dom’.\n Then, adding the reference to our input &lt;input ref={usernameInput}&gt;In the main function (or custom component), we can call the hook:  const usernameInput = useRef(null);Why null? The argument of useRef is the initial value. But in this case we don’t need that, just what will be in usernameInput.\n Finally, we can access all our referenced properties, like the input value, this way:  usernameInput.current.value\n In the next credit, it was needed to create a controlled input. A controlled input is an input field that is controlled by the component state. That means setting the value of the input by the state:  &lt;input ref={usernameInput} value={username} onChange={handleChange} /&gt;\n Then, we can set the state at the top of the component:  const [username, setUsername] = useState(&#39;&#39;);And finally, use that state to change the value of the input in the handleChange function. In this case, transforming every key to lowercase:\n  So the flow is the following:input from user —&gt; update input state —&gt; transforming input state -&gt; sending the state as value of the input —&gt; input appears on screens.\n  The exercises were just little demonstrations in this case, to show the importance of using a unique index key when showing elements in the DOM through a mapping. Not without, not with the pre-built index of the map function, but with a preset set of keys to use. This allows also React to keep the state of the inputs even with continuous rendering.\n Not doing so is a mistake that leads to any kind of unpredictable behavior. I did this time ago and it also cost me many points in an interview.\n  This is all for the Epic React Fundamentals section. I already know that the next workshops will be more challenging, but it was useful to know/be reminded of some basics.", "posttime": "2020-11-03 22:15:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基础,fundamentals,输入", "title": "反应基础：我学到了什么", "title_en": "React Fundamentals: What I’m Learning", "transed": 1, "url": "https://buaiscia.github.io/posts/learning-on-epic-react-fundamentals", "via": "", "real_tags": ["基础", "输入"]}, {"category": "", "categoryclass": "", "imagename": "1f231edd5013e09f80d4bfcec0213146.png", "infoid": 1032964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "«查看所有帖子移动通信的需求与日俱增意味着对安全和私人电话的需求也在不断增长。企业、组织和机构都使用安全设备，这在市场上产生了巨大的需求。我们经常听到的问题是，“是什么让安全设备变得安全？”这是一个重要的问题，而且Copperhead在前沿安全Android开发方面拥有直接的市场经验。为了清楚地了解是什么使设备变得安全，我们需要细分该设备被认为是安全和私有所必需的基本组件。考虑到这里需要的相关信息的数量，我们将为安全电话的每个组件提供一个由3部分组成的系列。这些组件是设备或硬件、操作系统和用户实践。下面是我们所学到的一些东西。\n这篇文章将概述安全电话解决方案中一个重要且必要的部分：硬件。\n安全电话的安全性从制造商级别开始。当设备制造商设计新电话时，他们会看到要放置在设备中的硬件选项。片上系统(SoC)的选择是Android设备的架构蓝图，它直接影响到该设备的安全容量。在SoC之后加入了安全元素，例如Pixel的Titan M芯片。这些芯片将操作系统进程锁定在安全硬件容器内，与潜在的恶意进程隔离。\n片上系统(System On Chip)被维基百科描述为“集成了计算机或其他电子系统的所有或大部分组件的集成电路(也称为芯片)”。电话使用的SoC(安全的或非安全的)确定该电话的硬件容量，然后包括其他组件。SoC支持的状态仅依赖于该领域的少数几家公司(高通、联发科、恩智浦)，这意味着设备制造商几乎没有选择。安全手机绝对需要最新的SoC版本，因为它规定了Linux内核版本，从而决定了使用SoC的操作系统的功能。当然，手机中的SoC越老，操作系统和设备的安全能力就越差。移动电话领域的Linux手机的最新版本就有这个问题(请看这里查看未发布的Linux手机正在使用的SoC的示例)。确保整个软件和操作系统堆栈启用FOSS/OSS可能意味着涉及的组件不是最新的，甚至没有通过当前的安全规范。自由软件运动的支持者可能会接受这种安全与开放的权衡，但铜头并非如此。最新的片上系统设计有助于为设备的硬件提供安全蓝图。\nAndroid使用Linux内核与手机硬件接口。较旧的SoC依赖较旧的Linux内核版本来支持Android和Linux。使用Linux内核是一把双刃剑；Linux内核的开发基于对包含的重要性的共识是什么：维基百科声明：“截至2020年，Linux内核5.6版大约有3300万行代码，大约14%的代码是核心(拱门、内核和mm目录)的一部分，而60%是驱动程序。”多亏了驱动程序的提升权限，他们通常是移动电话等端点上的第一个被利用的资源。控制驱动器意味着几乎完全控制设备。在Linux内核中添加更多驱动程序会带来更多利用漏洞的可能性，从而不必要地增加攻击面。使用稳定的长期支持(LTS)Linux内核意味着我们可以可靠地进行安全测试，并剥离未使用的驱动程序。相比之下，使用最新最好的Linux内核实际上可能会在部署中引入危险的新错误。Copperhead经常精心挑选更新的Linux安全特性，并将它们包含在针对CopperheadOS的稳定LTS内核中。\n安全元件是电话被视为安全电话的典型组件。安全元件有时称为硬件安全模块(HSM)，为在隔离的硬件环境中操作敏感进程和验证设备的引导链提供安全保护。在设备受到恶意软件危害的情况下，银行交易等流程仍可通过Android受保护的确认API在设备上免受恶意软件的影响。安全元素提供了可供验证的操作系统组件的防篡改轮廓，限制了对系统完整性的篡改或未经授权更改文件。例如，恶意软件通常被设计为持久的，在被删除甚至出厂重置后仍留在设备上。试图创建持久性的恶意软件不能造成麻烦\n并不是所有的设备都是平等的，尽管Android手机制造商已经开始采取正确的措施来保护他们的用户，但Google Pixel设备仍然是最安全的Android手机。Titan M HSM使用强大而安全的LTS Linux内核、来自高通/谷歌的更新补丁、锁定Pixel Bootloader的可用性以及包含安全操作系统(如CopperheadOS)相结合，为客户提供了成功的移动通信安全解决方案。", "note_en": "« View all posts   The ever increasing need for mobile communications equally means ever increasing need for secure and private phones. Businesses, organizations, and agencies all have a use for secure devices creating tremendous demand in the market. The question we often hear is, “What makes a secure device, secure?” This is an important question and Copperhead has direct experience in the market, on the front lines in bleeding-edge secure Android development. To paint a clear picture of what makes a device secure, we need to break down the essential components necessary for that device to be considered secure and private. In light of the quantity of information that is both relevant and required here, we’ll be presenting a 3-part series for each component of a secure phone. These components are the  device or hardware,  operating system, and  user practices. Here is a little of what we have learned.\n This post will outline an important and necessary piece of the secure phone solution: the Hardware.\n   The security of a secure phone begins at the manufacturer level. When a device manufacturer is designing a new phone they are presented with options for the hardware to be placed in the device. The System on Chip (SoC) selection, which is the architectural blueprint of the Android device directly impacts the security capacity of that device. After the SoC is the inclusion of a Secure Element such as the Pixel’s Titan M chip. These chips lock down operating system processes inside of a secure hardware container, isolated from potentially malicious processes.\n  System on Chip is described by Wikipedia as  “an integrated circuit (also known as a &#34;chip&#34;) that integrates all or most components of a computer or other electronic system.” The SoC used by a phone, secure or otherwise, determines the hardware capacity of that phone to then include other components. The state of SoC support is reliant on only a few players in the space (Qualcomm, Mediatek, NXP) meaning that there are few options for device manufacturers to choose from. Secure phones absolutely require the latest in SoC versions, as it dictates the Linux kernel version and therefore, the capabilities of the operating system utilizing the SoC. Certainly the older the SoC in a phone is, the less security capabilities the operating system and that device have. The latest iteration of Linux phones in the mobile phone space have this exact problem  (see here for an example of a SoC which a unreleased Linux Phone is using). Ensuring that the entire software, and operating system stack are FOSS/OSS enabled may mean that the involved components are not up-to-date or even pass current security specs. Proponents of the Free Software movement may be okay with this trade-off of security for openness: Copperhead is not. An updated System on Chip design helps provide the security blueprint for the device’s hardware.\n  Android uses the Linux kernel for interfacing with the hardware on the phone. Older SoCs rely on older Linux kernel versions for both Android and Linux support. Using Linux kernels is a double edged-sword; the development of the Linux kernel is based on what the consensus of importance for inclusion is: Wikipedia states that “ As of 2020, the 5.6 release of the Linux kernel had around 33 million lines of code, roughly 14% of the code is part of the &#34;core&#34; (arch, kernel and mm directories) while 60% is drivers.” Thanks to the elevated privileges of drivers they are often the first exploited resource on an endpoint such as a mobile phone. Controlling a driver means near complete control of the device. The addition of more drivers in the Linux kernel opens up more exploitation possibilities, unnecessarily increasing attack surface. Using a stable Long Term Support (LTS) Linux kernel means we can robustly security test and strip away unused drivers. In comparison, using the latest and greatest Linux kernel may actually introduce dangerous new bugs into a deployment. Copperhead has routinely cherry-picked updated Linux security features and included them in stable LTS kernels for CopperheadOS.\n  Secure Elements are the quintessential component for a phone to be considered a secure phone. Secure Elements sometimes called a Hardware Security Module (HSM), provide a safe shelter for operations inside of a secluded hardware environment for sensitive processes and verifying the boot chain of a device. In the event that a device is compromised by malware, processes such as bank transactions are still protected from malware on the device through  Android’s Protected Confirmation API. Secure Elements provide a tamper-proof outline of the operating system components to verify from, restricting tampering with system integrity or making file changes without authorization. For example malware is often designed to be persistent, to stay on the device after being deleted or even factory reset. Malware that attempts to create persistence cannot lay the groundwork to do so because the Titan M chip verifies the integrity of the device. Malware and malicious operations cannot tamper with Verified Boot, protecting the device security and ensuring a truly secure phone. Android has provided  Verified Boot since Android 4.4 and CopperheadOS has utilized this mechanism to protect our customers from since  we released CopperheadOS on the Nexus 5X.\n While not all Secure Elements are created equally, the security of the Pixel’s Titan M chip is supported by a large bug bounty and organizations such as  Project Zero. The Titan M is used in Pixel devices for Verified Boot and supporting the  hardware-backed keystore which provides unalterable security services to the OS and applications. Only recently have manufacturers begin including Secure Elements inside of their Android devices, while the  Pixel series has had a Secure Element since Pixel 2.\n The Titan M chip reigns as the supreme HSM and protects users who want a truly secure phone.\n  Not all devices are created equal and although Android phone manufacturers have begun to take the correct steps toward protecting their users, the Google Pixel device remains the most secure Android phone. With a combination of the Titan M HSM, using a robust and secure LTS Linux Kernel, updated patches from Qualcomm/Google, the availability of locking the Pixel bootloader and the inclusion of a secure operating system like  CopperheadOS give customers the winning secure solution for mobile communications.", "posttime": "2020-11-03 22:15:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "安全,phone", "title": "安全电话系列：设备安全", "title_en": "Secure Phone Series: Device Security", "transed": 1, "url": "https://copperhead.co/blog/secure-phone-series-device-security/", "via": "", "real_tags": ["安全", "phone"]}, {"category": "", "categoryclass": "", "imagename": "1b8d43f0863065c4f954f4168059ebc7.jpg", "infoid": 1032963, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "闹钟响的时候你睡得正香。现在是凌晨3点。你擦擦眼睛，看看手机。你知道有些不对劲。大错特错。\n网站瘫痪了。您的应用程序已损坏。房间里唯一的光来自你的电脑显示器。系统中的Gremlin可能隐藏在任何地方，找到它是您的团队的工作。\n作为一个为多家DevOps初创公司管理公关的人，我看到这个故事一遍又一遍地上演。即使是最有经验的工程师，光是一次重大停机的声誉成本就足以让人感到恐惧！\n但事实是，每家公司都有系统故障。我们离让在线系统看起来更像公用事业公司还有一段路要走，在这种情况下，只要轻轻一按开关，它就能正常工作。因此，分享故事和将失败正常化(例如，透明和无可指责的事后处理)是该行业的积极趋势；它让每个人都不那么害怕和孤独。\n我不打算引用有关停机成本的通用数字。对亚马逊来说，这可能是每小时数百万美元；对你的公司来说，如果处理迅速，可能只会限制在令人沮丧的客户体验上。但最终，这些情况会让企业赔钱，损害声誉，耗尽工程资源，并激发人们对竞争的兴趣。\n因此，本着万圣节的精神，更重要的是本着分享经验以更好地防止未来发生这种情况的精神，让我们来看看CTO们自己讲述的六个可怕的停电故事。\n“推盘不可能往下推。我们的推送在排队，而我正在接受推送。“。\n“已经五天了，推盘还是往下。人们正在将各种任务归档。“\n…。所以我很不情愿地开始四处打听。我们所有的推送指标看起来都比较正常，我发送的每一次测试推送都是及时交付的。然而，支持团队是对的-人们整整五天来一直在抱怨推动没有成功。到底是什么呢？\n这些都是Android推送通知，Android设备需要向服务器打开一个套接字才能订阅推送通知。我们有数以千万计的Android设备，所以我们在一个自动伸缩组中运行推送通知服务。为了在整个组中实现连接负载平衡，我们使用了循环DNS，而要增加容量，我们只需增加ASG[自动伸缩组]的大小即可。最终，我们发现投诉是在我们最后一次增加ASG大小的时候开始的，所以这是一个很好的线索。另一条线索是，所有抱怨的人似乎都在东欧。我们要求他们中的一些人运行详细的跟踪，就在那时我们了解到dns记录将以…的形式返回。失踪了吗？\n结果发现，当我们增加ASG的大小时，循环DNS记录超过了UDP数据包的大小。通常这没什么大不了的；协议说在这种情况下应该退回到使用TCP。它确实发生了，对几乎每个人来说都是如此。除了罗马尼亚一台主要路由器后面的用户。我们将该记录的DNS从route53委托给一个小型的本地python DNS服务器，该服务器允许我们返回4个Android推送通知服务器的随机子集，然后一切都恢复正常。💀。\n停电发生在一个周五的下午，当时我们正准备去万圣节欢乐时光。传来的页面显示，我们只为500提供服务-这对客户来说是一种非常非常糟糕的体验。经过一些挖掘，我们意识到我们的主机已经填满了他们的磁盘，我们开始失败，因为我们不能写日志(也很可怕，因为我们是在盲目飞行)。\n我们最终刷新了主机，实现了日志轮换以防止将来发生这种情况，并创建了警报以警告我们是否再次接近。但最有趣的是，我们让一位工程师为我们的平台编写了一个新的Gremlin：Disk Gremlin，以确保我们可以主动执行修复，确保我们不会再以这种方式失败。然后，我们自动化了该测试，而该测试仍然挥之不去，直到今天仍在我们的生产环境中随机运行。😱。\n还记得那个关于服务器每天在同一特定时间停机的都市传说吗？经过几周的调查，有人看了监控录像…。发现女佣正在断开服务器连接吸尘器！嗯，我们都知道，衣柜里的Gremlin并不总是像我们最初想象的那样可怕或神秘：)。\n每周有好几次，我们都看到后端的延迟指标达到了顶峰。每次我们调查它时，我们都会注意到其中一个表被锁定，并且所有查询都不断超时。我们想知道：我们的一个客户是否不间断地重新部署他们的应用程序？主要的疑点是一个复杂的查询，它获取我们所有客户的服务器信息的列表，这样他们就可以选择要调试的服务器。我们开始优化该查询，看到了巨大的改进，但这些延迟峰值仍在不断发生。\n几周前，在参加每周一次的“客户成功简报会”时，延迟高峰再次出现，这对我打击很大。我从应用程序的后台注意到一个我们很少使用的查询，它非常慢，因为我们从来没有优先修复它(它几乎没有使用过)。显然，我们的客户成功经理一直在为会议收集数据，每次查询返回得不够快时，他都会不停地点击刷新和重试。那个很少使用的查询锁定了我们的数据库，并挑战我们客户成功经理的理智！回顾数据，我们确认所有延迟峰值都与客户成功简报保持一致。最终，在优化该查询大约20分钟后，一切都恢复正常。🎃\n那是旧金山一个晴朗阳光灿烂的日子。我在一家小互联网公司工作，突然我们的应用程序停止为我加载。不只是一个视图，而是整个应用程序。重新装弹很辛苦，但运气不佳。我环顾四周，我的队友们也很困惑；这个应用程序也不能为他们工作。我们的用户没有抱怨(还没有吗？)。但不管怎样，我们还是开始挖坑了。那一天还没有进行任何部署，基础设施也没有改变；然而，它在各种操作系统类型和浏览器中都是一致崩溃的。会有什么改变呢？\n我们在一个关键的(但很无聊而且没有永远改变的)API调用中发现了一些错误，如果没有这些错误，应用程序将无法加载。但为什么这些错误只发生在公司的员工身上呢？为什么是现在？原来，对于内部用户，该接口返回了一些额外的数据…。额外的数据在过去几周内一直在缓慢增长，直到那天下午最终超过请求的最大有效负载大小。👻。\n我们所依赖的AddTrust Root证书颁发机构(CA)大约在凌晨4点过期。太平洋时间2020年5月30日星期六上午。\n当时，作为迁移到Kubernetes的一部分，我们正在将我们的一些基础设施过渡到一个非营利性的证书颁发机构“让我们加密”(We‘s Encrypt)。旧式系统日志客户端需要AddTrust/UserTrust/Comodo。除了为主要云合作伙伴运行多个全球环境外，我们还运行自己的SaaS环境。在我们的SaaS环境中，到处都使用单个证书链，包括我们的接收端点、系统日志端点和Web应用程序。我们认为我们已经为这个根证书过期…做好了准备。我们没有。\n证书链快速入门：所有基于证书的安全性都依赖于信任链。浏览器和操作系统附带这些根证书的信任存储区。\nLogDNA链：AddTrust Root CA(5月30日到期)-&gt；UserTrust CA-&gt；Sectigo-&gt；*。Logdna.com。\nUserTrust CA本身也是许多浏览器的根信任存储的一部分，因此即使AddTrust过期，它也会被忽略，因为通向UserTrust CA的链仍然有效。\n原来，旧的遗留系统将只看到LogDNA链，如果四个证书中的任何一个过期，它就被认为是无效的链。它们也不会将UserTrust识别为受信任的根证书。\n我们收到的所有支持票证都提到我们的v1代理不再向我们的接收端点发送日志，但是我们的v2代理和其他基于rest API的客户端的现代实现都工作得很好。\n我们错误地开始对v1代理进行更新。具有讽刺意味的是，由于相同的AddTrust Root CA到期，我们的CI/CD提供商自己也发生了故障，这进一步使我们推出该代理变得更加复杂。一旦我们意识到问题出在实际的证书链上，以及旧的遗留系统在该链上的行为如何，我们就会通过切换到一个基于“让我们加密”的新证书链来快速纠正这个问题。🧟。\n全面的站点停机是可怕的-但它们不会让您的皮肤像随机的、不可预测的故障那样爬行。我当时正在开发Twitter的移动网络版本，我们收到了一些请求，对于一些随机倒霉的露营者来说，每当他们访问该网站时，都会导致一个可怕的错误页面。对于其他人来说，天空是蓝色的，鸟儿在啁啾。但时不时地，会有其他人被击中。而且，一旦他们被击中，他们就陷入了绝望的深渊，无法阅读手机上的任何推文。\n慢慢地，随着这些受损账户数量的增加，500开始攀升到临界水平。我们可以看到，我们正在使用的新库无法解析具有特定字符的会话cookie。所以每次你重新登录的时候，你都是在掷骰子，被这个讨厌的漏洞咬了一口，如果没有重新设置手机cookie的神奇力量，你就不可能被治愈。最终，我们修复了图书馆中的错误，每个人都可以回去阅读他们的推文…。正如我们所知，这本身就是一件非常可怕的事情！🕸️", "note_en": "You’re sound asleep when the alarms go off. It’s 3 a.m. You wipe your eyes, check your phone. You know something is wrong. Very wrong.\n The website is down. Your application is broken. The only light in the room is coming from your computer monitor. The Gremlin in the system can be hiding anywhere, and it’s your team’s job to find it.\n  As someone who runs PR for various DevOps startups, I’ve seen this story play out over and over. The reputation cost alone of a major outage is enough to instill fear in even the most seasoned engineer!\n But the truth is, every company has system failure. And we’re still a bit away from getting online systems to look more like utilities, where you flip a switch and it just works. So sharing stories and normalizing failure (e.g. transparent and blameless postmortems) are positive trends for the industry; it makes everyone feel less scared and alone.\n I’m not going to cite generic numbers about the cost of downtime. For Amazon it may be millions per hour; for your company, it may be confined to a frustrating customer experience, if dealt with swiftly. But ultimately these kinds of situations lose businesses money, hurt reputations, drain engineering resources and fuel interest in the competition.\n So in the spirit of Halloween, and more importantly in the spirit of sharing experiences to better prevent them from happening in the future, let’s take a look at six scary outages stories, as told by CTOs themselves.\n      “Push can’t possibly be down. Our pushes are in a queue, and I am receiving pushes.”\n “It’s been five days, and push is STILL down. People are filing all kinds of tasks.”\n … so I reluctantly started poking around. All our push metrics looked relatively normal, every test push I sent was promptly delivered. Yet the support team was right — people had been steadily complaining for five full days about pushes not succeeding. What on earth could it be?\n These were Android push notifications, and Android devices needed to hold a socket open to the server to subscribe to push notifications. We had tens of millions of Android devices, so we ran the push notification service in an autoscaling group. To load-balance connections across the group, we used round-robin DNS, and to increase capacity we would simply increase the size of the ASG [auto-scaling group]. Eventually, we figured out that the complaints had begun right around the last time we increased the size of the ASG, so that was a good clue. Another clue was that all the people complaining seemed to be in Eastern Europe. We asked a few of them to run a verbose trace, and that’s when we learned that the DNS record was coming back as … missing?\n Turns out that when we increased the size of the ASG, the round-robin DNS record exceeded the UDP packet size. Normally this is no big deal; the protocol says it should fall back to using TCP in that instance. And it did, for almost everyone. Except for users behind one major router in Romania. We delegated DNS for that record from route53 to a small local python DNS server that let us return a random subset of four Android push notification servers, and everything was fine again. 💀\n   The outage occurred on a Friday afternoon, just as we were about to head out to Halloween Happy Hour. The page came in that we were serving exclusively 500s — a bad, bad experience for customers. After some digging, we realized that our hosts had filled up their disks, and we started failing because we couldn’t write logs (also scary because we were flying blind).\n We ended up refreshing the hosts, implementing log rotation to prevent that from happening in the future, and creating an alarm to warn us if we were ever getting close again. But the most interesting thing we did is have one of our engineers write a new Gremlin for our platform: the disk Gremlin to make sure we could proactively exercise the fixes to make sure we never failed that way again. Then we automated that test and that test still lingers, running randomly in our production environment to this very day. 😱\n   Remember that urban legend about a server going down everyday, at the same specific hour? And after weeks of investigations, someone looked at the security camera footage… and found out that the maid was disconnecting the server to connect the vacuum cleaner! Well, we all know that the Gremlin in the closet isn’t always as scary or mysterious as we initially think :)\n  Several times a week, we’d been seeing the backend’s latency metrics going through the roof. And each time we investigated it, we noticed one of the tables getting locked and queries kept timing out all over. We wondered: Is one of our customers redeploying their application non-stop? The main suspect was a complex query which fetches the list of all our customers’ servers’ information, so they’ll be able to choose which of them they would like to debug. We started optimizing that query and saw huge improvements, yet those latency spikes kept happening.\n Then a couple of weeks ago, while attending the weekly “Customer Success Briefing,” the latency spike was happening again and it hit me like a brick. I noticed a query that we barely used, from our application’s back office, that was really slow because we never prioritized fixing it (it was scarcely used). Apparently, our customer success manager had been collecting the data for the meeting, and every time the query didn’t return fast enough, he just kept hitting refresh and retrying. That rarely used query was locking up our database and challenging our customer success manager’s sanity! Looking back at the data, we confirmed that all of the latency peaks were aligned with Customer Success briefings. Eventually, after about 20 minutes of optimizing that query, everything returned to normal. 🎃\n   It was a clear, sunny day in San Francisco. I was working at a small internet company, when suddenly our app stopped loading for me. Not just one view, but the whole app. Hard reload, but no luck. I looked around and my teammates were also confused; the app wasn’t working for them either. Our users weren’t complaining (yet?) but we started digging in anyway. No deployments had happened yet that day, no infrastructure had changed; yet it was broken consistently across OS types and browsers. What could have changed?\n We found some errors in a critical (but boring-and-hadn’t-changed-in-forever) API call, without which the app wouldn’t load. But why were the errors only happening for people that worked at the company? And why now? It turned out that for internal users, the API returned some extra data…extra data that had been slowly growing over the last few weeks, until it had finally exceeded the request’s maximum payload size that afternoon. 👻\n   The AddTrust Root Certificate Authority (CA) we relied on expired at roughly 4 a.m. Pacific Time on Saturday morning, May 30, 2020.\n At the time, we were transitioning some of our infrastructure to Let’s Encrypt, a nonprofit certificate authority, as part of our move to Kubernetes. Legacy Syslog clients required AddTrust/UserTrust/Comodo. We run our own SaaS environment in addition to a number of worldwide environments for a major cloud partner. In our SaaS environment, a single certificate chain is used everywhere, including our ingestion endpoint, Syslog endpoint, and web app. We thought we were ready for this root certificate expiry… we were not.\n Quick primer on certificate chains: All certificate-based security relies on chains of trust. Browsers and operating systems ship with these trust stores of root certificates.\n LogDNA Chain: AddTrust Root CA (expired May 30) -&gt; UserTrust CA -&gt; Sectigo -&gt; *. logdna.com\n  UserTrust CA itself is also part of root trust stores of many browsers, so even if AddTrust is expired, it’s ignored since the chain leading up to the UserTrust CA is still valid.\n  Turns out, old legacy systems will only see the LogDNA chain, which is considered an invalid chain if any of the four certificates are expired. They also don’t recognize UserTrust as a trusted root certificate.\n All of the support tickets we received mentioned that our v1 agent was no longer sending logs to our ingestion endpoints, but our v2 agent and other modern implementations of REST API-based clients were all working fine.\n We erroneously started working on an update to our v1 agent. Ironically, our CI/CD provider also had an outage of their own due to the same AddTrust Root CA expiration, which further complicated our rollout of that agent. Once we realized that the issue was with the actual certificate chain and how older legacy systems behaved with that chain, we quickly rectified it by switching in a new certificate chain based on Let’s Encrypt. 🧟\n   Full-on site outages are horrible — but they don’t make your skin crawl the same way that the random, unpredictable failures really can. I was working on the mobile web version of Twitter, and we got requests that, for some random unlucky campers, caused a scary error page whenever they visited the site. For everyone else, the sky was blue and the birds were chirping. But now and again, someone else would get hit. And, once they were hit, they were stuck in a pit of despair, unable to read any tweets from their phone.\n Slowly, as the number of these tarnished accounts increased, the 500s started creeping up to critical levels. We were able to see that the new library we were using failed to parse session cookies with a specific character. So every time you logged back in, you were rolling the dice on getting bit by this pesky bug, and you couldn’t be cured without the wizardly powers to reset your cookies on a phone. Eventually, we fixed the bug in the library, and everyone was able to go back to reading their tweets… which, as we know, can be a very scary thing on its own! 🕸️", "posttime": "2020-11-03 22:14:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "停电,outage,服务器", "title": "CTO可怕的停电故事", "title_en": "Scary Outage Stories from CTOs", "transed": 1, "url": "https://thenewstack.io/6-scary-outage-stories-from-ctos/", "via": "", "real_tags": ["停电", "outage", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "5256fae0d70eba65b2ea4ec572ed543e.jpeg", "infoid": 1032962, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2009年，神经学家亨利·马克拉姆(Henry Markram)站在人群面前提出了一个大胆的主张。马克拉姆在TED的一次演讲中说：“我们的任务是建立一个现实的、详细的、人脑的计算机模型。”马克拉姆告诉观众，他相信他可以使用超级计算机重建人脑，他将在10年内做到这一点。电影制作人诺亚·赫顿(Noah Hutton)在网上观看了TED演讲，并决定记录长达十年的绘制人脑地图的斗争。\n10年后，赫顿完成了他的纪录片。这部电影叫“西里科”，现在正在电影节上热映。马克拉姆的人脑项目尚未产生人脑的模拟，尽管它在这一尝试中花费了数十亿欧元，并看到马克拉姆被赶下了该项目的领导角色。\n在西里科，一开始只关注马克拉姆和他的作品，但赫顿很快意识到他必须扩大它的范围。赫顿在一份新闻稿中说，“直到在谷歌组织的一次会议上放映之后，观众中的科学家向我提出了大量关键问题，我才意识到迫切需要扩大这个故事的范围，使其超越单一的焦点。”\n人脑计划的故事充满了争议和紧张。数百名神经学家认为这个项目是徒劳无益的。其他人认为马克拉姆问的都是错误的问题。\n“在西里科”将带观众进入这个项目的旅程，它的批评者，以及处于这一切中心的科学家。", "note_en": "In 2009, neuroscientist Henry Markram stood in front of a crowd and made a bold claim. “Our mission is to build a realistic, detailed, computer model of the human brain,” Markram  said at a TED talk. Markram told the audience that he believed he could recreate the human brain using supercomputers and that he’d do it in 10 years. Filmmaker Noah Hutton watched the TED talk online and decided to chronicle the decade long struggle to map the human brain.\n    After 10 years, Hutton has finished his documentary. It’s called  In Silico and it’s hitting film festivals right now. Markram’s Human Brain Project has yet to produce a simulation of the human brain though it’s  spent billions of euros in the attempt, and  seen Markram ousted from a leadership role on the project.\n      In Silico began with a narrow focus on Markram and his work, but Hutton quickly realized he had to expand its scope. “It was only after a screening at a conference organized by Google where scientists in the audience peppered me with critical questions that I came to see the urgent need to expand this story beyond its singular focus,” Hutton said in a press release.\n   The story of the Human Brain Project is fraught with controversy and tension.  Hundreds of neuroscientists believe the project is a boondoggle. Others believe Markram is  asking all the wrong questions.\n   In Silico will take viewers on a journey into the project, its detractors, and the scientists at the center of it all.", "posttime": "2020-11-03 22:14:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人脑,simulating", "title": "这部关于模拟人脑的纪录片已经制作了10年", "title_en": "This Documentary About Simulating the Human Brain Is 10 Years in the Making", "transed": 1, "url": "https://www.vice.com/en/article/akdd7z/this-documentary-about-simulating-the-human-brain-is-10-years-in-the-making", "via": "", "real_tags": ["人脑"]}]