[{"category": "", "categoryclass": "", "imagename": "287bda88922eed180517d34d2ee4e331.png", "infoid": 1067360, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "解决方案游戏不会在其付费VR游戏Bluston中使用Facebook广告测试向前迈进。 ", "note_en": "Resolution Games won't be moving forward with a Facebook advertising test in its paid VR game Blaston.", "posttime": "2021-06-22 12:33:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,facebook,广告,游戏,game", "title": "解决方案游戏表示，它不会在其付费VR游戏Blaston中使用Facebook VR广告测试，但会考虑在其免费捕鱼游戏诱饵中测试广告！ ", "title_en": "Resolution Games says it won't move forward with a Facebook VR ad test in its paid VR game Blaston, but will consider testing ads in its free fishing game Bait!", "transed": 1, "url": "https://uploadvr.com/blaston-ad-test/", "via": "", "real_tags": ["免费", "facebook", "广告", "游戏", "game"]}, {"category": "", "categoryclass": "", "imagename": "0074b0fe4e23783563f7c8f272bed7fa.jpg", "infoid": 1067359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的15年中，谷歌推出了十多个消息服务，跨越文本，语音和视频呼叫。本周，该公司的努力在Google Chat的一般可用性中达到了高潮，这是具有更多传统消息的松弛/不和谐室的组合。\n 这是可能预期的那种公告，它可能会给公司混乱的信使消息带来一些一致性，但是 - 在这个领域的谷歌是传统的 - 众所周知 - 周围有很大的混乱。\n  一方面，谷歌聊天是粉丝的名称，习惯于指谷歌的原始消息服务，谷歌谈话多年。这是一种巧合，它带来了谷歌的消息传递OUROBOROS全圈，或者它意味着诱使Gchat粉丝实际上使用公司的最新尝试？\n 对于另一个，谷歌聊天包含其自己的消息传递房间，这些客房以前称为房间，但即使谷歌在2016年推出了一个不同的消息传递应用程序，即使谷歌推出了一个不同的消息传递应用程序，即使谷歌将在2016年推出其他消息传递应用程序也将很快“进化”。\n 以下是多年来谷歌的主要消息传递产品的崩溃，目前以粗体为主动服务：\n 消息传递服务：Google Talk，Google Plus Huddle，Google Hoogouts，Google Allo，Google Chat，以及其他Google产品内置的Google Chat，以及我们不会提及这里的其他谷歌产品\n 在这个混乱的产品名称中是两个核心问题：谷歌对推出新服务的明显热爱，无法将产品结合在一个雨伞下。 \n像Whatsapp这样的竞争对手展示了相反的方法可以是：与用户的电话号码相关的聊天服务，允许视频和语音，从一个应用程序中获取。或者有Apple的iPhone方法，将电子邮件地址和电话号码连接到两个服务：音频和视频的文本和FaceTime的Imessage。\n 谷歌一直陷入相同的周期，遍历整个历史。它会建立新的服务，将它们集成到其产品阵容的更多领域，然后尝试擦拭Slate Clean，推出新的服务（最终）更换旧套装，并重新开始循环。\n     2004年4月1日：Gmail在Beta发射。可以说是Google的第一个通信产品，Gmail承诺了一种新的电子邮件服务，用户不必删除电子邮件，并且可以搜索与Google主站的相同电源的旧线程。最初认为是一个愚人的笑话。\n 2005年8月：谷歌谈话发射，摘要谷歌的遗传服务进入消息服务。除了即时消息之外，还通过其桌面客户端提供语音呼叫。将于2006年将Gmail集成到Gmail中，作为Gmail的“AOL”电子邮件服务的“AOL Instant Messenger”。在Gmail中的“聊天”窗口中找到，用户会调用它gchat。\n 2007年11月：Google Talk收到对小组聊天的支持，允许用户实时留言多个联系人。\n 2008年10月：谷歌推出Android为智能手机，支持谷歌谈话和常规短信发短信。\n  2009年3月：谷歌语音推出。一家名为GrandCentral的现有公司的REBrand，谷歌于2007年购买，谷歌语音让用户注册一个可以发送和接收短信并在PC和电话上呼叫的单个电话号码。谷歌语音和谷歌谈话仍然是单独的服务。 \n2009年5月：Google Wave在Google I / O宣布。作为互联网通信未来的宏伟愿景，Wave Reimagined电子邮件并作为一系列具有不同用户的分组线程，直到谷歌在一年后停止开发。虽然整体流动，Wave现在被视为团队消息传递应用程序的前体，如松弛。\n 2010年2月：谷歌推出谷歌Buzz。它主要是一个像Twitter这样的微博服务，如Gmail内存，但它也提供您可以发送给小组的私人邮件。它于2011年停产，为Google+提供了方法。\n 2010年4月：Google添加到Google文档的聊天。新的聊天功能旨在让文档编辑在编辑文档时相互通信，但它与Google的其他聊天服务分开。\n 2010年8月：Google Voice集成到Gmail中，允许Gmail用户直接从Gmail致电Google Talk语音呼叫功能的扩展。\n 2011年4月：谷歌为Android添加了Live Video Chat，带来了Google Talk的语音和互联网呼叫移动。\n    2011年6月：Google+推出。谷歌的谷歌对Facebook的社交媒体统治地位的方法，它还拥有自己的两个消息服务：遍布小组文本消息，用于组视频的电话和环聊。\n 这是谷歌消息周期的第一部分：新服务的引入，即使它需要两年的时间才能完成此处的品牌和策略。 \n2012年7月：谷歌在Gmail上推出Hoogouts，称为Gmail通过Google Talk提供的现有视频呼叫功能的更多“现代”版本。我们已经开始看到周期的第二部分，因为谷歌开始将环聊建立在其他服务中。\n  2013年5月：Google+ Concouts被重新成为谷歌的新的总体消息平台。它试图将其他Google消息传递和视频聊天应用程序合并到一个统一的服务中，替换Google Talk，Google+ Messenger和旧的Google+ Hoogouts视频聊天服务。\n  2014年9月：谷歌声音融入了环聊，继续谷歌为凝聚力的消息系统进行努力并带来一些短信支持。\n 2015年4月：Google Fi推出作为项目FI。谷歌的电话计划还与环聊融合，但鉴于这两个服务并排存在，导致与谷歌的声音进行头痛。\n 2016年6月：Android和Gmail的Google Talk（仍未正式名为Gchat或Google Chat，尽管大多数人称之为）是停止的，标志着谷歌的原始消息服务结束。\n    2016年5月：谷歌在Google I / O 2016年再次启动其周​​期，宣布allo，一个新的短信应用程序和Duo，一个新的视频聊天应用程序。两者都与环聊分开，再次泥泞水域。\n 2017年3月：Google宣布环聊正在重新安排作为环聊聊天，并致力于企业使用。谷歌还推出了环聊遇见，这是一个企业友好的视频会议应用程序，后来成为谷歌的缩放的答案。预计Allo和Duo将作为消息传递和视频聊天的新消费选项取得环聊。 \n2017年6月：Gchat终于，真的停止了。谷歌还删除了Cheacouts的SMS支持，以更好地定位它作为一个松弛的竞争对手。\n 2018年4月：谷歌“暂停投资”在Allo，侧重于RCS，替换短信的新标准。困惑地，谷歌使用短语“聊天服务”来引用Android上的启用RCS，尽管与Google Talk（通常称为Gchat）和Hoogouts Chat / Google Chat仍然无关。\n      通过谷歌的移动消息重点关注RCS，该公司将作为其旧的基于网络的沟通服务作为其旧的基于Web的服务。但在扭曲中，Covid-19大流行使企业通信工具置于松弛和变焦前和中心（不仅适用于公司），而且为人们的日常生活用于社交，学校等。\n 2020年3月：HOCKOUTS符合将作为新组视频会议选项发布给个人Google帐户。\n 2020年4月2020年潜伏在您的Gmail浏览器窗口中。\n  2021年6月：谷歌将谷歌聊天与所有客户发布，并宣布“房间”将成为“空间”。与常规组线程相比，空间类似于松弛或不和谐的房间，为更大的群体讨论提供了一个较大的群体讨论的中央地 - 也是在聊天中存在的。\n  到目前为止已经是一条漫长的道路，但随着工作空间和谷歌聊天到非企业用户，几乎可以查看谷歌的策略。 Gmail存在电子邮件;聊天是用于实时对话和群聊的Gchat / Hoopouts风格的消息系统;空间是基于特定主题或对话的更加持久性的休闲/不和谐风格的区域;并且会遇到视频聊天。 \n但是，移动消息是混乱的，并且谷歌花了多年的时间试图让自己的服务与SMS和RCS这样的运营商技术并排工作 - 并且在视线之中没有结束。 使用蜂窝载体技术来追求Apple，WhatsApp并不是一个可怕的想法，但目前尚不清楚谷歌实际上是否设法赶上。  即使RCS可能是替代SMS的强大竞争者，它也没有连接到基于网络的Google聊天 - 尽管如此，谷歌也是指RCS服务也是“聊天”。 在视频前面，目前尚不清楚为什么谷歌二重奏仍然存在于大幅度的广泛释放之后，因为这两个主要完成了同样的事情。  如果在2021年的任何内容清楚，那么谷歌的消息传递未来可能会保持混乱。 ", "note_en": "Over the past 15 years, Google has introduced more than a dozen messaging services spanning text, voice, and video calling. This week, the company’s efforts culminated in the general availability of Google Chat, a combination of Slack / Discord-style rooms with more traditional messaging.\n It’s the sort of announcement that might have been expected to bring some consistency to the company’s muddled messenger messaging, but — as is traditional for Google in this area — there’s plenty of confusion to go around.\n  For one thing, Google Chat is the name fans have affectionately used to refer to Google’s original messaging service, Google Talk, for many years. Is this a coincidence that brings Google’s messaging ouroboros full circle, or is it meant to entice GChat fans into actually using the company’s latest attempt?\n For another, Google Chat contains its own messaging rooms that were previously called Rooms but will soon “evolve” into something called Spaces, even though Google introduced  a different messaging app called Spaces in 2016.\n Here’s a breakdown of Google’s major messaging offerings over the years, with currently active services in bold:\n Messaging services: Google Talk, Google Plus Huddle, Google Hangouts, Google Allo,  Google Chat, plus innumerable chat features built into other Google products we won’t mention here\n Within that mess of product names are two core issues: Google’s apparent love of launching new services and its inability to combine products under one umbrella.\n Competitors like WhatsApp demonstrate what the opposite approach could be: a chat service tied to a user’s phone number that allows for video and voice, all from one app. Or there’s Apple’s iPhone approach, which ties email addresses and phone numbers to two services: iMessage for text and FaceTime for audio and video.\n Google keeps falling into the same cycle, though, one that has repeated itself throughout the years. It’ll build out new services, integrating them into more areas of its product lineup, then try to wipe the slate clean, launch new services that (eventually) replace the old set, and start the cycle anew.\n     April 1st, 2004: Gmail launches in beta. Arguably Google’s first communication product, Gmail promised a new kind of email service where users wouldn’t have to delete emails and could search old threads with the same power as Google’s main site.  Originally assumed to be an April Fools’ joke.\n August 2005: Google Talk launches, kicking off Google’s foray into messaging services. In addition to instant messaging, Talk also offered voice calls through its desktop client. Talk would be integrated into Gmail in 2006 as the sort of “AOL Instant Messenger” to Gmail’s “AOL” email service. Found in the “Chat” window in Gmail, users wind up calling it GChat.\n November 2007: Google Talk receives support for group chats, allowing users to message multiple contacts in real time.\n October 2008:  Google launches Android for smartphones, with support for both Google Talk and regular SMS texting.\n  March 2009:  Google Voice launches. A rebrand of an existing company called GrandCentral that Google bought in 2007, Google Voice lets users sign up for a single phone number that can send and receive text messages and calls on both PCs and phones. Google Voice and Google Talk remain separate services.\n May 2009:  Google Wave is announced at Google I/O. Pitched as a grand vision for the future of internet communication, Wave reimagined email and chat as a series of grouped threads with different users until Google stopped development a year later. While overall a flop, Wave is now seen as a precursor to team messaging apps like Slack.\n February 2010:  Google launches Google Buzz. It’s primarily a microblogging service like Twitter that lives inside Gmail, but it also offers private messages you could send to small groups. It was discontinued in 2011 to make way for Google+.\n April 2010:  Google adds chat to Google Docs. The new chat feature is designed to let document editors communicate with each other while editing a document, but it’s separate from Google’s other chat services.\n August 2010:  Google Voice gets integrated into Gmail, allowing Gmail users to call regular phone numbers directly from Gmail as an expansion of Google Talk’s voice call feature.\n April 2011: Google  adds live video chat to Android, bringing Google Talk’s voice and internet calls to mobile.\n    June 2011: Google+ launches. Ostensibly Google’s approach to Facebook’s social media dominance, it also intros two messaging services of its own: Huddle group text messaging for phones and Hangouts for group video.\n It’s the first part of Google’s messaging cycle: the introduction of new services, even though it’ll take two years for Google to finalize the branding and strategy here.\n July 2012: Google  launches Hangouts in Gmail, calling it a more “modern” version of the existing video calling feature that Gmail had offered through Google Talk. Already, we start to see the second part of the cycle, as Google starts to build out Hangouts into its other services.\n  May 2013:  Google+ Hangouts is relaunched as Google’s new overarching messaging platform. It attempts to merge other Google messaging and video chat apps into a single unified service, replacing Google Talk, Google+ Messenger, and the old Google+ Hangouts video chat service.\n  September 2014: Google Voice is integrated into Hangouts, continuing Google’s efforts for a cohesive messaging system and bringing some SMS support.\n April 2015:  Google Fi launches as Project Fi. Google’s phone plan also integrates with Hangouts but leads to headaches with Google Voice, given that the  two services exist side by side.\n June 2016: Google Talk for Android and Gmail (still not officially named GChat or Google Chat, despite what most people call it) is discontinued, marking the end of Google’s original messaging service.\n    May 2016: Google starts its cycle again at Google I/O 2016, announcing both Allo, a new texting app, and Duo, a new video chat application. Both are separate from Hangouts, muddying the waters once again.\n March 2017: Google announces Hangouts is being rebranded as Hangouts Chat, with a new focus on enterprise use. Google also launches Hangouts Meet, an enterprise-friendly videoconferencing app that later becomes Google’s answer to Zoom. Allo and Duo are expected to take the place of Hangouts as the new consumer options for messaging and video chat.\n June 2017:  GChat is finally, really discontinued. Google also  removes SMS support from Hangouts to better position it as a Slack competitor.\n April 2018:  Google “pauses investment” in Allo, focusing instead on RCS, a new standard to replace SMS. Confusingly, Google uses the phrase “chat services” to refer to enabling RCS on Android, despite being unrelated to Google Talk (commonly referred to as GChat) and Hangouts Chat / Google Chat.\n      With Google’s mobile messaging focused on RCS, the company comes back to Hangouts as its old-new web-based service for communication. But in a twist, the COVID-19 pandemic puts enterprise communication tools like Slack and Zoom front and center — not just for companies, but for the everyday life of people to use for socializing, school, and more.\n March 2020: Hangouts Meet is released to personal Google accounts as a new group videoconferencing option.\n April 2020: Hangouts Chat (which has steadily grown into a Slack / Discord-style app during the previous era) is  renamed to Google Chat — marking the return of sorts of the Google Chat name, although the slow rollout might mean you still have Hangouts lurking in your Gmail browser window.\n  June 2021: Google releases Google Chat to all customers and announces that “Rooms” will become “Spaces.” Spaces work similar to a Slack or Discord room, offering a central place for larger group discussions compared to regular group threads — which still exist in Chat, too.\n  It’s been a long road to get here, but with the launch of Workspace and Google Chat to non-enterprise users, it’s almost possible to see Google’s strategy. Gmail exists for emails; Chat is the GChat / Hangouts-style messaging system for real-time conversations and group chats; Spaces is the Slack / Discord-style area for more persistent, larger rooms based on a particular topic or conversation; and there’s Meet for video chats.\n Mobile messaging is messier, though, with Google having spent years trying to get its own services to work side by side with carrier technologies like SMS and RCS — and there’s no end in sight. Working with cellular carrier technology to pursue Apple and WhatsApp isn’t a terrible idea, but it’s not clear whether Google can actually manage to catch up.\n Even if RCS might be a strong contender to replace SMS, it doesn’t connect to the web-based Google Chat at all — even though, confusingly,  Google refers to RCS services as “chat” as well. And on the video front, it’s not clear why Google Duo still exists following the broader release of Hangouts Meet since the two largely accomplish the same things.\n If anything is clear in 2021, it’s that Google’s messaging future will likely remain muddled for quite some time.", "posttime": "2021-06-22 12:32:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,messaging", "title": "谷歌的消息传递混乱：时间表 ", "title_en": "Google’s Messaging Mess: A Timeline", "transed": 1, "url": "https://www.theverge.com/2021/6/21/22538240/google-chat-allo-hangouts-talk-messaging-mess-timeline", "via": "", "real_tags": ["google", "谷歌", "messaging"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数据采集车辆配备了顶部和七个摄像机的一个40梁激光雷达。 ", "note_en": "The data acquisition vehicle is equipped with one 40-beam LiDAR on the top and seven cameras.", "posttime": "2021-06-22 12:32:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "自动,million,采集", "title": "一旦数据集：自动驾驶的一百万场景 ", "title_en": "Once Dataset: One Million Scenes for Autonomous Driving", "transed": 1, "url": "https://once-for-auto-driving.github.io/index.html", "via": "", "real_tags": ["自动", "million", "采集"]}, {"category": "", "categoryclass": "", "imagename": "e1dc6c1204ccf3de0089d57d6f66ba1f.jpg", "infoid": 1067357, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿 - 最高法院于周一裁定，超过200个审理专利纠纷的行政法官，其中一些人超过数十亿美元，违反了宪法。\n 该解决方案是一项突破大多数法院裁定的，是向美国专利和商标办公室的董事审查法官决定的权力，以便在2011年的法律下提出，使其更容易挑战可疑专利。\n 该程序的支持者称为“缔约方之间的”拉丁语“审查，这些审查是”各方之间“的”，“这有助于打击专利”巨魔“，或获得专利，而不是使用他们的专利，而是为了要求赔偿金额和起诉。对手表示，该过程倾向于取消有效专利。\n 星期一的决定意味着挑战将在很大程度上按之前进行，而不会改变法官如何被任命。法院的缩小修复，使法官对额外监督进行额外的监督，缺乏上台当前制度。\n 案件，美国诉Arthrex，19-1434号，从史密斯＆amp提起的挑战中出现;侄子，医疗技术公司，反对竞争对手举办的专利，Arthrex在医疗设备上。关于专利审判和上诉委员会的法官小组，该委员会在2011年法律规定的行政部门的行政法庭，裁定Arthrex的专利无效。\n Arthrex向美国呼吁联邦赛道上诉，华盛顿专门法院呼吁，称，应当抛弃专利法官的决定，因为他们没有被妥善任命。\n 上诉法院同意，裁定法官在没有监督的情况下在没有监督的情况下进行了重要工作，因此“主要官员”是“宪法”，这意味着他们必须由总统委任并由参议院委任。 \n上诉法院对宪法问题的解决方案是将一部分裁减保护专利法官免于未经原因。上诉法院表示，这有效地将其从“主要官员”中解雇。\n 首席大法官John G. Roberts Jr.周一为五位司法人士写作，同意宪法问题有一个符合法官如何被任命及其职责之间的宪法问题。他写的“令人难以置信的行政权力行使”，他写道，“与他们的地位不相容。”\n “只有一名官员恰当被任命为主要办事处，可能会在我们面前的诉讼中发出最终决定，”首席司法写道。\n 正义塞缪尔A. Alito Jr.，Neil M. Gorsuch，Brett M. Kavanaugh和Amy Coney Barrett加入了首席大法官的意见。\n 首席大法官罗伯茨只在他看来的另一部分中只写了四个法官，这是法院应该如何了解它所确定的宪法问题。他表示，法官的决定必须受到董事的审查。正义戈斯鲁奇与裁决的一部分不同意，称由国会提出如何解决如何解决宪法缺陷。\n Justice Stephen G. Breyer，Justices Sonia Sotomayor和Elena Kagan加入，从首席司法的意见的第一部分失差。 “今天的决定”，“他写道，”既是前所未有的，不必要的，而且风险将司法机构进一步推动到我们缺乏行动和明智行动的能力和行动能力的领域。“\n 但是，这三个法官仍然表示，他们接受了罗伯茨的首席大法官的解决方案对大多数人发现的问题。 \nQuadice Clarence Thomas发出了一个独立的异议，由Breyer，Sotomayor和Kagan大法内加入大部分。 “法院今天绘制了一条新的线路从主体上划分了校长的官员，”他写道。 “这条线在大使的行政专利法官在大使，最高法院法官和部门的主题表明某些事情并不完全正确。” ", "note_en": "WASHINGTON — The Supreme Court  ruled on Monday that more than 200 administrative judges who hear patent disputes, some of them over billions of dollars, had been appointed in violation of the Constitution.\n The solution, a fractured majority of the court ruled, was to give the director of the U.S. Patent and Trademark Office the power to review the judges’ decisions in cases brought under a 2011  law that made it easier to challenge questionable patents.\n Supporters of the procedure, called inter partes review, which is Latin for “between the parties,” say it  helps combat patent “trolls,” or companies that obtain patents not to use them but to demand royalties and sue for damages. Opponents say the procedure is skewed toward the cancellation of valid patents.\n The decision on Monday means the challenges will largely proceed as before, without changes to how the judges are appointed. The court’s narrow fix, subjecting the judges to additional supervision, fell well short of upending the current system.\n The case, United States v. Arthrex, No. 19-1434, arose from a challenge filed by Smith &amp; Nephew, a medical technology company, against patents held by a competitor, Arthrex, on a medical device. A panel of judges on the Patent Trial and Appeal Board, an administrative tribunal in the executive branch created by the 2011 law, ruled that Arthrex’s patents were invalid.\n Arthrex appealed to the United States Court of Appeals for the Federal Circuit, a specialized court in Washington, saying that the patent judges’ decision should be thrown out because they had not been properly appointed.\n The appeals court agreed, ruling that the judges performed important work without supervision and so were “principal officers” under the Constitution, meaning that they had to be appointed by the president and confirmed by the Senate.\n The appeals court’s solution to the constitutional problem was to strike down a part of the law that protected the patent judges from being fired without cause. This effectively demoted them from “principal officers,” the appeals court said.\n Chief Justice John G. Roberts Jr., writing for five justices on Monday, agreed that there was a constitutional problem with the fit between how the judges had been appointed and their duties. “The unreviewable executive power exercised” by the judges, he wrote, “is incompatible with their status as inferior officers.”\n “Only an officer properly appointed to a principal office may issue a final decision binding the executive branch in the proceeding before us,” the chief justice wrote.\n Justices Samuel A. Alito Jr., Neil M. Gorsuch, Brett M. Kavanaugh and Amy Coney Barrett joined that part of the chief justice’s opinion.\n Chief Justice Roberts wrote for only four justices in another part of his opinion, this one concerning what the court should do about the constitutional problem it had identified. He said the judges’ decisions must be made subject to the director’s review. Justice Gorsuch did not agree with that part of the ruling, saying it was up to Congress to address how to fix the constitutional flaw.\n Justice Stephen G. Breyer, joined by Justices Sonia Sotomayor and Elena Kagan, dissented from the first part of the chief justice’s opinion. “Today’s decision,” he wrote, “is both unprecedented and unnecessary, and risks pushing the judiciary further into areas where we lack both the authority to act and the capacity to act wisely.”\n But those three justices nonetheless said they accepted Chief Justice Roberts’s solution to the problem the majority had identified.\n Justice Clarence Thomas issued a separate dissent, joined in large part by Justices Breyer, Sotomayor and Kagan. “The court today draws a new line dividing inferior officers from principal ones,” he wrote. “The fact that this line places administrative patent judges on the side of ambassadors, Supreme Court justices and department heads suggests that something is not quite right.”", "posttime": "2021-06-22 12:32:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表示,judges,法官", "title": "最高法院表示，超过200名专利法官被委任不当被委任 ", "title_en": "Over 200 Patent Judges Were Improperly Appointed, Supreme Court Says", "transed": 1, "url": "https://www.nytimes.com/2021/06/21/us/politics/supreme-court-patent-judges.html", "via": "", "real_tags": ["表示", "judges", "法官"]}, {"category": "", "categoryclass": "", "imagename": "2515f2c5c66f818491784f40be8cd6af.jpg", "infoid": 1067356, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "α-GAL综合征是最近确定的红肉和其他由哺乳动物制成的产品的食物过敏。在美国，当一个孤独的星际蜱咬某人时，最常常开始的情况。咬合将称为α-gal的糖分子传递到人体中。在某些人中，这触发了一种免疫系统反应，后来产生了对红肉的严重过敏反应，例如牛肉，猪肉或羊肉或其他哺乳动物产品。\n  Lone Star Tick主要在美国东南部发现，大多数alpha-gal综合征的病例发生在该地区。蜱也可以在美国东部和南部的美国中部发现。然而，这种情况似乎散布了南北，然而，随着鹿携带孤独的星蜱到美国的新部分。 Alpha-Gal综合征也被诊断为欧洲，澳大利亚和亚洲，其中其他类型的蜱圈携带α-Gal分子。\n 研究人员现在相信一些常见的人，不明显的过敏反应的人 - 以及为其他食物过敏测试阴性 - 可能受到α-GAL综合征的影响。除了避免哺乳动物制成的红肉和其他产品之外，没有治疗。\n 避免刻度叮咬是预防的关键。通过穿着长裤和长袖衬衫和使用昆虫，草地，草地区的昆虫障碍物来防止蜱叮咬。在外面花时间进行彻底，全身刻度检查。\n      与其他食物过敏相比，α-GAL过敏反应的迹象和症状通常会延迟。例如，对常见食品过敏原或贝类的最反应 - 例如 - 发生在曝光的几分钟内。在α-加仑综合征中，反应通常在暴露后出现约3至6小时。红肉，如牛肉，猪肉或羊肉;器官肉;和由哺乳动物制成的产品，例如明胶或乳制品，可导致反应。\n   医生认为吃红肉和开发过敏反应的时间延迟是病症被忽视的一个原因。在午夜的晚餐和荨麻疹的T骨牛排之间可能的连接远远明显。\n   如果您在进食后发现食物过敏症状，请参阅初级保健医生或专门诊断和治疗过敏（过敏症）的医生 - 甚至在进食后几个小时。不要排除红肉作为你反应的可能原因，特别是如果你在美国东南部或在世界其他地区住在户外，那么众所周知，就会发生α-加仑综合征的世界其他地区。 \n大多数开发美国在美国开发alpha-gal综合征的人开发了一个孤独的星蜱咬它们的条件。来自其他类型的蜱虫的叮咬可能导致欧洲，澳大利亚和亚洲的状况。\n   据信导致α-GAL综合征的蜱虫，从动物的血液中携带α-Gal分子，它们通常咬住，例如奶牛和羊。当载体蜱咬住人时，蜱将alpha-gal注入人的身体。\n 出于未知的原因，有些人对这些分子具有如此强烈的免疫应答，即它们不能再吃哺乳动物制成的红肉或产品而没有轻度至严重的过敏反应。随着时间的推移，接触到许多蜱叮咬的人可能会产生更严重的症状。\n   与α-GAL综合征有关的抗体的人可以对癌症药物辛酸（Erbitux）具有过敏反应。西妥昔单抗诱导这种情况的病例在具有高孤星蜱虫蜱的地区中最常见的，这表明孤星蜱叮咬和对α-GAL综合征的增加的脆弱性之间可能的联系。需要更多的研究来了解在某些地区携带alpha-gal的蜱之间的联系，并且alpha-gal综合征似乎直接链接到滴点叮咬。\n 研究人员认为，α-GAL综合征的标志时间延迟反应是由于α-GAL分子比其他过敏原在待消化并进入循环系统的情况下。\n   医生不知道为什么有些人在曝光后和其他人开发alpha-gal综合征，其他人在＆＃39; t。这种情况主要发生在美国东南部，纽约，新泽西州和新英格兰的地区。如果您在这些地区生活或花时间，您＆＃39;在这些地区生活或花时间增加风险\n  在过去的20到30年里，孤岛蜱已经发现大量的北部是缅因州，而在美国德克萨斯州中部和俄克拉荷马州。 \nAlpha-Gal综合征也可能发生在世界其他地区，如欧洲，澳大利亚和亚洲的部分地区，其中某些类型的蜱虫叮咬也似乎增加了风险的风险。\n   α-GAL综合征可导致食物诱导的过敏反应，一种需要用肾上腺素（肾上腺素）注射器（Epipen，Auvi-Q，其他）治疗和访问急诊室的医疗紧急情况。\n   基于最近的研究，医生现在认为有些人常见的是过敏性的，可能与未结识的α-GAL综合征生活。\n   预防alpha-gal综合征的最佳方法是避免蜱虫，特别是树木，浓密的浓密区域，带有长草的地区。您可以减少带有一些简单预防措施的Alpha-Gal综合征的风险：\n 掩饰。当在树木繁茂的或草地上，穿鞋，长裤塞进袜子里，一件长袖衬衫，帽子和手套。尽量坚持小径，避免走过低灌木丛和长草。把你的狗放在皮带上。\n  使用驱虫剂。用20％或更高浓度的DEET涂抹昆虫驱蚊剂到您的皮肤上。父母应该向他们的孩子申请驱除者，避免他们的手，眼睛和嘴巴。请记住，化学驱动剂可能有毒，因此仔细遵循方向。用Permethrin涂抹产品或购买预处理的衣服。\n  尽力勾选你的院子。清晰的刷子和叶子在哪里活着。让木材保持在阳光明媚的地区。 \n检查自己，您的孩子和您的宠物蜱。在树木繁茂的或草地上花时间特别警惕。\n  它＆＃39;在室内来，尽快淋浴。在附加本身之前，蜱经常留在你的皮肤上。淋浴和使用毛巾可能会删除未连接的蜱虫。\n  用镊子尽快删除勾号。轻轻抓住头部或嘴巴附近的蜱虫。不要挤压或挤压蜱，但仔细和稳定地拉动。一旦你＆＃39; ve删除了整个蜱虫，处理它并将防腐剂应用于咬合区域。\n ＆＃34;他们在一个位置。他们会爬上最近的物体，就像这片草叶一样。＆＃34;它＆＃39; s被称为任务。 ＆＃34;它伸出腿，这允许它抓住他们走路的主持人。＆＃34;你可以减少你的机会＆＃39; ll成为一个主人。 ＆＃34;使用驱虫剂是一个好主意。＆＃34;\n 梅奥诊所寄生虫疾病专家Bobbi Pritt博士为您的衣服和装备表达了Permethrin。\n  ＆＃34;你真的可以让你的装备饱和。把它们留出来干燥，然后，第二天，穿上它们。＆＃34;\n  在皮肤上使用Permethrin和Deet。在暴露的皮肤上喷洒Deet驱蚊剂，包括你的腿和手。避免你的脸，但一定要保护你的脖子。然后，把你的裤子塞进你的袜子里。而且，在您的徒步旅行中，记得避免可能栖息蜱虫的地区。 \n＆＃34;那个＆＃39;为什么要远离高大的草地。 留在中间。＆＃34;  Steinke Jw等人。 Alpha-Gal Story：从连接点的经验教训。 过敏与临床免疫学杂志。 2015; 135：589。  Platts-mills ta，等。 50年后的IgE发现。 过敏，哮喘＆amp史册; 免疫学。 2016; 116：179。  Platts-mills ta，等。 IgE在过敏性疾病的诊断和治疗中。 过敏与临床免疫学杂志。 2016; 137：1662。  卡特MC等人。 鉴定特发性过敏性的患者α-GAL敏感性。 过敏。 2017年; DOI：10.1111 /全部13366。  孤星蜱一个问题，但不是莱姆病。 疾病预防与控制中心。 https://www.cdc.gov/stari/disease/index.html。 进入2018年4月13日。  Berg Ea，等 药物过敏原和食物 - 西妥昔单抗和半乳糖-α-1,3-半乳糖故事。 过敏，哮喘＆amp史册; 免疫学。 2014; 112：97。 \nalpha-gal和红肉过敏。 美国过敏院，哮喘＆amp; 免疫学。 https://www.aaaai.org/conditions-and-treatments/library/allergy-library/alpha-gal。 访问了2020年6月2日。 ", "note_en": "Alpha-gal syndrome is a recently identified type of food allergy to red meat and other products made from mammals. In the United States, the condition most often begins when a Lone Star tick bites someone. The bite transmits a sugar molecule called alpha-gal into the person&#39;s body. In some people, this triggers an immune system reaction that later produces mild to severe allergic reactions to red meat, such as beef, pork or lamb, or other mammal products.\n  The Lone Star tick is found predominantly in the southeastern United States, and most cases of alpha-gal syndrome occur in this region. The tick can also be found in the eastern and south central United States. The condition appears to be spreading farther north and west, however, as deer carry the Lone Star tick to new parts of the United States. Alpha-gal syndrome also has been diagnosed in Europe, Australia and Asia, where other types of ticks carry alpha-gal molecules.\n Researchers now believe that some people who have frequent, unexplained anaphylactic reactions — and who test negative for other food allergies — may be affected by alpha-gal syndrome. There&#39;s no treatment other than avoiding red meat and other products made from mammals.\n Avoiding tick bites is the key to prevention. Protect against tick bites by wearing long pants and long-sleeved shirts and using insect repellents when you&#39;re in wooded, grassy areas. Do a thorough, full-body tick check after spending time outside.\n      Signs and symptoms of an alpha-gal allergic reaction are often delayed compared with other food allergies. Most reactions to common food allergens — peanuts or shellfish, for example — happen within minutes of exposure. In alpha-gal syndrome, reactions usually appear about three to six hours after exposure. Red meat, such as beef, pork or lamb; organ meats; and products made from mammals, such as gelatins or dairy products, can cause a reaction.\n   Doctors think the time delay between eating red meat and developing an allergic reaction is one reason the condition was overlooked until recently. A possible connection between a T-bone steak with dinner and hives at midnight was far from obvious.\n   See your primary care doctor or a doctor who specializes in the diagnosis and treatment of allergies (allergist) if you experience food allergy symptoms after eating — even several hours after eating. Don&#39;t rule out red meat as a possible cause of your reaction, especially if you live or spend time outdoors in the southeastern United States or in other parts of the world where alpha-gal syndrome is known to occur.\n       Most people who develop alpha-gal syndrome in the U.S. develop the condition when a Lone Star tick bites them. Bites from other types of ticks can lead to the condition in Europe, Australia and Asia.\n   Ticks that cause alpha-gal syndrome are believed to carry alpha-gal molecules from the blood of the animals they commonly bite, such as cows and sheep. When a carrier tick bites a human, the tick injects alpha-gal into the person&#39;s body.\n For unknown reasons, some people have such a strong immune response to these molecules that they can no longer eat red meat or products made from mammals without a mild to severe allergic reaction. People who are exposed to many tick bites over time may develop more-severe symptoms.\n   People with antibodies related to alpha-gal syndrome can have allergic reactions to the cancer drug cetuximab (Erbitux). Cetuximab-induced cases of this condition are most common in regions with a high population of Lone Star ticks, suggesting a possible link between Lone Star tick bites and an increased vulnerability to alpha-gal syndrome. More research is needed to understand the connection between ticks that carry alpha-gal in certain regions and cases of alpha-gal syndrome that don&#39;t seem directly linked to tick bites.\n Researchers think the hallmark time-delayed reaction of alpha-gal syndrome is due to the alpha-gal molecules taking longer than other allergens to be digested and enter your circulatory system.\n   Doctors don&#39;t yet know why some people develop alpha-gal syndrome after exposure and others don&#39;t. The condition mostly occurs in the southeastern United States and parts of New York, New Jersey and New England. You&#39;re at increased risk if you live or spend time in these regions and:\n  In the past 20 to 30 years, the Lone Star tick has been found in large numbers as far north as Maine and as far west as central Texas and Oklahoma in the United States.\n Alpha-gal syndrome can also occur in other parts of the world such as Europe, Australia and parts of Asia, where bites from certain types of ticks also appear to increase your risk of the condition.\n   Alpha-gal syndrome can cause food-induced anaphylaxis, a medical emergency that requires treatment with an epinephrine (adrenaline) injector (EpiPen, Auvi-Q, others) and a visit to the emergency room.\n   Based on recent research, doctors now believe that some people with unexplained, frequent anaphylaxis may be living with undiagnosed alpha-gal syndrome.\n   The best way to prevent alpha-gal syndrome is to avoid areas where ticks live, especially wooded, bushy areas with long grass. You can decrease your risk of getting alpha-gal syndrome with some simple precautions:\n Cover up. When in wooded or grassy areas, wear shoes, long pants tucked into your socks, a long-sleeved shirt, a hat and gloves. Try to stick to trails and avoid walking through low bushes and long grass. Keep your dog on a leash.\n  Use insect repellents. Apply insect repellent with a 20% or higher concentration of DEET to your skin. Parents should apply repellent to their children, avoiding their hands, eyes and mouths. Keep in mind that chemical repellents can be toxic, so follow directions carefully. Apply products with permethrin to clothing or buy pre-treated clothing.\n  Do your best to tick-proof your yard. Clear brush and leaves where ticks live. Keep woodpiles in sunny areas.\n  Check yourself, your children and your pets for ticks. Be especially vigilant after spending time in wooded or grassy areas.\n  It&#39;s helpful to shower as soon as you come indoors. Ticks often remain on your skin for hours before attaching themselves. Showering and using a washcloth might remove unattached ticks.\n  Remove a tick as soon as possible with tweezers. Gently grasp the tick near its head or mouth. Don&#39;t squeeze or crush the tick, but pull carefully and steadily. Once you&#39;ve removed the entire tick, dispose of it and apply antiseptic to the bite area.\n &#34;They get themselves in a position. And they will climb up the nearest object, like this blade of grass here.&#34; It&#39;s called questing. &#34;It sticks out its legs, and that allows it to grab on to hosts as they walk by.&#34; You can lessen the chances you&#39;ll become a host. &#34;Using insect repellents is a good idea.&#34;\n Mayo Clinic parasitic diseases expert Dr. Bobbi Pritt suggests permethrin for your clothing and gear.\n  &#34;You can really saturate your gear. Leave them out to dry, and, then, the next day, wear them.&#34;\n  Use permethrin on materials and DEET on skin. Spray the DEET repellent on exposed skin, including your legs and hands. Avoid your face, but be sure to protect your neck. Then, tuck your pants into your socks. And, on your hike, remember to avoid areas where those questing ticks may be perched.\n  &#34;That&#39;s why you want to stay away from the tall grasses. Stay in the middle.&#34;\n               Steinke JW, et al. The alpha-gal story: Lessons learned from connecting the dots. Journal of Allergy and Clinical Immunology. 2015;135:589.\n  Platts-Mills TA, et al. The discovery of IgE 50 years later. Annals of Allergy, Asthma &amp; Immunology. 2016;116:179.\n  Platts-Mills TA, et al. IgE in the diagnosis and treatment of allergic disease. Journal of Allergy and Clinical Immunology. 2016;137:1662.\n        Carter MC, et al. Identification of alpha-gal sensitivity in patients with a diagnosis of idiopathic anaphylaxis. Allergy. 2017; doi:10.1111/all.13366.\n  Lone star tick a concern, but not for Lyme disease. Centers for Disease Control and Prevention. https://www.cdc.gov/stari/disease/index.html. Accessed April 13, 2018.\n    Berg EA, et al. Drug allergens and food—the cetuximab and galactose-α-1,3-galactose story. Annals of Allergy, Asthma &amp; Immunology. 2014;112:97.\n        Alpha-gal and red meat allergy. American Academy of Allergy, Asthma &amp; Immunology. https://www.aaaai.org/conditions-and-treatments/library/allergy-library/alpha-gal. Accessed June 2, 2020.", "posttime": "2021-06-22 12:31:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gal", "title": "alpha-gal综合征 ", "title_en": "Alpha-Gal Syndrome", "transed": 1, "url": "https://www.mayoclinic.org/diseases-conditions/alpha-gal-syndrome/symptoms-causes/syc-20428608", "via": "", "real_tags": ["gal"]}, {"category": "", "categoryclass": "", "imagename": "4db08d6509382e617cf4904c3a7f1b2f.jpg", "infoid": 1067355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个双赢。 医院需要防止患者死亡败血症，感染并发症; 和史诗般的医疗记录最大的卖方，需要用户的新产品 - 这是一种可以预测哪种患者会培养这种情况的算法，所以医生可以介入前面。  在过去的几年里，数百家医院已经插入了算法，而无需验证其广告的80％的精度率。 然后，密歇根大学的一群研究人员开始对其表现提出问题。  STAT +是统计学和＃39; STAT＆＃39;深入的生物技术，制药，政策和生命科学覆盖和分析。 我们屡获殊荣的队伍涵盖华尔街，华盛顿政策发展，早期科学突破和临床试验结果，以及硅谷及以后的医疗保健中断。  每周机会与我们的记者和领先的行业专家参与实时视频对话 ", "note_en": "It was a win-win. Hospitals needed to prevent patient deaths from sepsis, a complication of infection; and Epic, the nation’s largest seller of medical records, needed users for its new product — an algorithm that could predict which patients would develop the condition so doctors could intervene earlier.\n Over the last few years, hundreds of hospitals have plugged in the algorithm without verifying its advertised 80% accuracy rate. Then a group of researchers at the University of Michigan started asking questions about its performance.\n  STAT+ is STAT&#39;s premium subscription service for in-depth biotech, pharma, policy, and life science coverage and analysis.\t\t\t\t\t\tOur award-winning team covers news on Wall Street, policy developments in Washington, early science breakthroughs and clinical trial results, and health care disruption in Silicon Valley and beyond.\n    Weekly opportunities to engage with our reporters and leading industry experts in live video conversations", "posttime": "2021-06-22 12:31:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,发送,algorithm", "title": "一种受欢迎的算法，用于预测Sepsis Misses大多数情况并发送错误警报 ", "title_en": "A popular algorithm to predict sepsis misses most cases and sends false alarms", "transed": 1, "url": "https://www.statnews.com/2021/06/21/epic-sepsis-prediction-tool/", "via": "", "real_tags": ["算法", "发送", "algorithm"]}, {"category": "", "categoryclass": "", "imagename": "9e6477fd1c1d4c9085d51c3205711cf6.jpg", "infoid": 1067354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是的，飞机可以使用通常被称为“autoland”的系统来降落。飞行员可以将自动飞行员编程以自动进行着陆，同时导航监控飞机。然而，当可以使用Autol和系统时存在限制。\n 自动着陆可能占商业航班上所有着陆的1％。许多飞行员实际上认为，由于监测自动加兰德和飞行阶段的汽车飞行员的自动飞行员在所有阶段都需要非常高的警惕，因此对飞行器进行手动降落飞机。\n 波音737（世界上最成功的客机）仅限于执行自动着陆（第3类/ CAT III方法）时的25公里的最大交叉风（许多航空公司15公吨）。当通常很少或没有风时，自动驾驶仪通常用于降低低可见度条件（如果它非常刮风，雾很少形成）。一旦风拾取，与汽车飞行员相比，平均飞行员在应对条件并降落飞机时远更好。\n  自动着陆需要高水平的自动化监控，需要每六个月重新培训专业飞行员。 Autoland只能在严格的条件下进行，要求在飞机上的认证（通常由于技术问题而不是技术问题而降级为无高尔兰特能力），这是飞行员和机场本身。仍然需要飞行器来配置飞机并控制它的速度并监控其飞行路径。任何数量的相对较小的技术问题都可能损害许多失败被动的汽车土地系统，需要进行错过的方法，然后进行可能转移到雾或低云的机场。\n Autoland通常被称为CAT III（3）方法。这是指仪器着陆系统（ILS）的类别，它是一种用于将飞行员指向飞行的最终方法阶段的跑道的无线电援助。并非所有机场都有一个猫III'跑道'，这意味着并非所有机场都可以支持高罗兰业务。同样，Autoland能力不是所有飞机都有的函数。\n   猫我需要手动着陆，但跑道可见度必须超过550米，飞行员必须通过海拔200英尺的海拔地区看到跑道。\n    CAT III C可能会下降到零可见性，但这实际上不会因为飞机无法从跑道零能见度上出租车而被出租。 ", "note_en": "Yes a plane can land by itself using a system that is often referred to as “autoland”. The pilots can program the auto pilot to carry out the landing automatically whilst the pilots monitor the aircraft. However there are limitations as to when the autoland system can be used.\n Automatic landings probably account for less then 1% of all landings on commercial flights. Many pilots actually think it’s much easier to land the aircraft manually, as monitoring the auto pilot in the autoland stage of flight is itself very demanding with a very high level of vigilance required at all stages.\n The  Boeing 737 (the world’s most successful airliner in terms of the number sold) is limited to a maximum crosswind of 25kts (15kts for many airlines) when carrying out an automatic landing (Category 3 / CAT III approach). The autopilot is usually used to land in low visibility conditions when there are typically little or no winds (fog will seldom form if it’s very windy). As soon as the wind picks up, the average pilot is far better at coping with the conditions and landing the aircraft when compared to the auto pilot.\n  Automatic landings require a high level of automation monitoring that needs  retraining every six months for professional pilots. Autolands can only be performed under strict conditions that require the certification of both the aircraft (often downgraded to no autoland capability due to technical issues), both of the pilots and the airport itself. The pilots are still required to configure the aircraft and control it’s speed and monitor its flight path. Any number of relatively minor technical issues can compromise many fail-passive auto land systems, requiring a missed approach to be carried out and then a possible diversion to an airport which is clear of fog or low cloud.\n An Autoland is often referred to as a CAT III (3) approach. This refers to the category of the  Instrument Landing System (ILS), which is a radio aid used to direct the pilots towards the runway on the final approach stages of flight. Not all airports have a CAT III ‘runway’ which means that not all airports can support Autoland operations. Equally, autoland capability is not a function that all aircraft have.\n   CAT I requires a manual landing but runway visibility must be more than 550 meters and pilots must be in sight of the runway by an altitude of 200ft.\n    CAT III C can potentially go down to zero visibility but this wouldn’t practically be utilised as the aircraft would be unable to taxi off the runway in zero visibility.", "posttime": "2021-06-22 12:31:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "乘客,plane,飞行员", "title": "乘客飞机可以自己自己吗？ ", "title_en": "Can a passenger plane land own its own?", "transed": 1, "url": "https://www.flightdeckfriend.com/ask-a-pilot/can-a-plane-land-automatically", "via": "", "real_tags": ["乘客", "plane", "飞行员"]}, {"category": "", "categoryclass": "", "imagename": "809c0e286c58067dc0684ca8d6fd97a4.png", "infoid": 1067353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如何定义互联网的大变化 - 谁定义它 - 正在进行中。\n 有一段时间，显而易见的是，互联网和网络标准已经在堆栈的“顶部”中停滞不前。虽然IETF一直在忙于修改HTTP并更换下方的TCP，但巨大的创新正在上面，它都是私人手中的。这是互联网上的大部分明显值所在的地方：当你问人们是什么互联网？他们没有说任何关于端到端，可靠的交付，有状态资源或浏览器平台的任何东西;他们说'社交网络，搜索和购物'，或更有可能，'Facebook，谷歌和亚马逊。\n 像社交网络，即时消息和在线市场等服务不必被委托到这些公司的手中 - 它们可以分布和/或联合系统，如互联网的下层，那里没有“扼流点” “这允许单个实体控制它们。对于许多这些功能，甚至存在现有标准，但它们没有成功。有时候，这是因为它们没有足够的能力，或者能够快速发展（见Moxie的大谈论这一点），或者因为有人使用市场力量从不符合他们商业模式的开放式解决方案将权力换掉电源（Google读者，任何人？）。\n 考虑到这一点，我一直在观看世界各地围绕世界各地的大型技术平台的竞争问题的调查。 1在我看来，一个明显的补救措施来集中的力量是通过要求市场参与者使用公开互操作性标准来分配该权力，竞争监管机构具有强迫问题的权力。当然，这不会解决大平台的所有问题，但这是一个很好的开始。\n 很多人似乎都同意;如果您有一些阅读时间，浏览器通过来自克里斯莱利，彼得瓦夏，互联网协会，Kerber＆amp等人士的论文; Schweitzer，Ian Brown，Kades＆amp;斯科特·莫顿和钦姆雅迪沙姆达 - 仅限少数人。\n 然而，建立良好的标准并不容易。平衡不同的利益相关者的观点，适用性的宽广，实施问题，安全和隐私，互操作性，即使每个人都相处，即使每个人都在困难。此外，结果需要与互联网在全球范围内相同的规模合法。我们认为，这是一个需要非常谨慎的管理的一个方面。\n 多年来，互联网社区已经发展了一系列机构和相关的建筑原则来体现这些权衡。并不是那么每个互联网或网络规范都必须通过W3C或IETF，或者这些机构产生的每一个标准都是成功的（远离它）。当您在互联网的技术标准时，这些机构提供的是一种不断增长的知识和经验，在技术和组织时，无论是技术和组织。 \n在这方面，我发现最近有关​​竞争努力的两项公告，努力在大型技术中统治有趣和讨论。\n  谷歌隐私沙箱的传奇和英国竞争和市场权威的对竞争影响的调查值得自己的纸张，但我想上周专注于CMA的公告。\n 简而言之，谷歌通过删除Chrome中的第三方Cookie的支持来提高隐私的努力吸引了CMA的注意力，因为这样做可以被视为在广告和出版市场中提供谷歌上手，因为谷歌将保留访问一方追踪信息。上周的宣布表明，谷歌对CMA作出了一些承诺，就如何发展隐私沙箱。\n CMA对这些变化对这些市场的影响的担忧是完全合理的，隐私沙箱的某些部分充其量是可疑的（例如，参见Mozilla对Floc的评估）。但是，隐私沙箱还包括以下功能：\n 删除第三方cookie：就像Firefox一样，Safari和Brave正在进行，支持从第一个cookie标准到最近的修订版。\n  打击指纹：就像Firefox一样，野生动物园和勇敢在线，在Web标准中多年来的广泛支持。\n  隐私代理：就像Firefox和Apple正在努力，在IETF Masque工作组中有相关的标准化活动，包括在其他地方。 \n这些功能 - 许多人认为是正常甚至是关键浏览器功能 - 现在须经英国竞争监管机构的批准，至少在最受欢迎的Web浏览器中。通过从谷歌提取关于它们的建立Chrome的承诺，CMA悄悄地将自己作为谷歌插入“沉默的合作伙伴”。最重要的是，谷歌现在需要在从浏览器中删除第三方cookie之前，即使其他浏览器已经完成了这么久以前，也需要在浏览器中删除第三方cookie。\n 关于CMA的一点是CMA正在创造有效的平行过程，以便通过何种标准进行，而是取代其自身的判断和观点。根据与他们选择的缔约方的磋商和英国价值观和英国隐私手段以及相对于广告生态系统的优先事项，基于与他们选择的缔约方的磋商，成果将由CMA和ICO决定。他们是否在世界其他地方得到它是有人的猜测;他们有一个非常具体的目标和激励措施，这些目标与将互联网和网络带来的人不同。\n 当然，就像其他软件供应商一样，浏览器必须符合他们拥有市场的各种司法管辖区的法律要求。这种干预也是相当“轻盈”;他们还没有告诉谷歌它必须做什么。因此，当我看到这些承诺的消息时，我担心上面的原因，但尚未令人担忧。接下来发生了什么。\n  五个旨在遏制大型技术的账单中的五个票据最近是访问法案2021。\n 本条例草案需要指定的平台（可能是候选人将是谷歌，Facebook和Amazon），符合新委员会由FTC运行的新委员会规定的互操作性标准。如果它通过，定义下一层互联网层的API不会基于广泛的社区输入，审查或参与。\n 相反，FTC将以其乐趣挑选参与者，并将保持对API的变更控制。 3.即使人们的合适组成委员会，其作用是明确的“咨询”。 4个API的4个文档仅提供给“竞争的业务或潜在的竞争业务”。5他们没有保证他们将公开。\n 很清楚，我非常高兴，Lina Khan现在是FTC椅子。有些大平台头需要踢，她的靴子被加工了。也就是说，旨在强迫大型技术互操作性的技术标准将不可避免地成为其在其内部建立的行业的事实标准，潜在的持续时间远远超过他们所设计的公司蹒跚而已（如果他们完成工作井） 。有效地使FTC成为新的互联网治理机构。 \n虽然在国内竞争法的背景下，这些发展可能是适当的，但他们可能对互联网的总体产生显着的负面影响。政府控制互联网治理，重点是经济运动员有两个可预测的影响：碎片和骨化。\n  创造政府设定的互联网职能标准将不可避免地领导其他政府，以决定他们的优先事项是不同的，或者他们只是找不到别人的标准。例如，欧盟可以决定英国在隐私沙箱上得到了棍子的错误末尾，或者巴西可以决定美国社交网络的标准不是为了它。\n 反过来，又会增加碎片的压力，以及互联网为全球社会和贸易的巨大效益的相应减少。\n 谷歌将不得不弄清楚是否拥有英国版的Chrome，或者试图强迫英国对其他人的隐私和广告的方法。 Facebook将面临在不同国家的支持不同API的可能性 - 这可能会适合它们，因为它将有助于防止建立大型竞争对手。\n 碎片的风险已被广泛认可一段时间，因此，世界各地政府都同意管理互联网的最佳方式是一个“多利益相关方”模型，以便在手中牢固地责任技术标准化的责任社区主导，行业支持的组织。\n 例如，2017年，G20（包括英国和美国）说他们是\n 重申G20数字经济发展与合作倡议对互联网治理方针的合作倡议的原则，包括各国政府，私营部门，民间社会，技术界和国际组织在各自的角色和责任中充分和积极参与。我们支持多利益相关者进程和举措，这些进程和举措是在实现数字相关的世界的所有利益相关者方面的包容性，透明和责任。 \n而且，他们可以被视为条约的约束;根据WTO关于交易技术壁垒的协议S 2.6：\n 为了尽可能广泛地协调技术规定，成员应在其资源范围内发挥全部部分，在编写适当的国际标准的国际标准，他们要么所采用，或者期望采用，技术法规。\n 我不确定这些发展与他们的承诺之间的摩擦是否尚未被认可，或者如果它只是被忽视。但是，如果IANA转型中涉及痛苦和不信任的痛苦的数量是任何指示，世界其他大部分都不是满足于允许美国（或任何其他富裕的西方国家）仅确定互联网的未来。\n  其他风险正在为未来创造摩擦，互联网的有益变化。例如，为Facebook创建API可能只能将它们（或其商业模式）将其水解（或其业务模式）作为社交网络的“胶水”，防止其他，更加分散的模型出现。\n 同样，强迫Chrome以适应第三方饼干和其他形式的跟踪来支撑第三方展示广告业可能会阻止对其他形式的广告和其他支持Web内容的方法进行自然和健康的演变。\n 在协议设计中，我们称之为骨化 - 当外部因素防止进化的能力时。强制支持特定的技术规格或特征与正在瞄准的市场权力相结合的是危险的酿造。\n 把它换成另一种方式：如果我们将互联网定义留到美国联邦贸易委员会和英国竞争和市场权力，我们不应该感到惊讶，如果结果专注于公司和竞争，而不是人和合作。公司在互联网上有一个巨大的部分，但这并不意味着我们应该将所有功能委托给他们，特别是当在权力下放进行重大进展时。 \n所有这些都提出了问题：可以在多利益相关方系统内定义这些标准吗？要另一种方式，是IETF和W3C适合此目的吗？\n 这是一个很好的问题。这些机构设立了自愿，而不是强制性标准，并为某些方面的强制执行情况具有巨大的扭曲效应。作为一个人参与互联网和网络标准化超过二十年的人，我不确定它是如何发展的，并且有很多难题需要得到解答。\n 仍然，在某些情况下，存在有现有的解决方案可以调整为互操作性标准的基础（例如，社交网络的活动日）。\n 在其他情况下，监管的威胁可能会改变动力动态，以产生有意义的变化。例如，浏览器没有强烈的激励，使他们如何处理第三方cookie迄今为止，但可能会改变CMA，ICO和其他感兴趣的监管机构是否已知其偏好。\n 除了标准化流程之外，这些组织有很多经验丰富的工程师，他们已经考虑了很长时间涉及许多相关领域的问题。只有通过“我需要谈论的大公司的镜头”，监管机构错过了有价值的替代观点。\n 但是，我们可能没有发现这些机构可以带来多少桌子：显然，许多有关决策者认为这些机构将受到大科技公司受到损害的。我认为这是两个具有许多不同参与者，激励和目标的复杂组织的简单景色。也就是说，这种观点不能被驳回;大科技公司显然在标准组织以及市场上有重大的力量，而多利益相关性可能是对自己合法性不稳定的理由。\n 所以，我认为这些治理机构需要做一些内省 - 找到他们如何维持（或建立）合法性和信任，以便像CMA和FTC这样的机构可以慰别于他们的开放，基于社区的全球技术的公开性标准化。如果是不可能的话，扣上扣：互联网标准化的方式会改变很多，并且它根本并不清楚我们最终的位置。 ", "note_en": "A big change in how the Internet is defined - and who defines it - is underway.\n For a while now, it’s been apparent that Internet and Web standards have stagnated at the ‘top’ of the stack. While the IETF has been busy  revising HTTP and  replacing TCP down below, a tremendous amount of innovation is going on up top, and it’s all in private hands. This is where most of the apparent value in the Internet now resides: when you ask people  what is the Internet? they don’t say anything about end-to-end, reliable delivery, stateful resources, or the browser platform; they say ‘social networking, search and shopping’, or more likely, ‘Facebook, Google and Amazon.’\n Services like social networking, instant messaging and online marketplaces don’t  have to be entrusted into the hands of these companies – they could be distributed and/or federated systems like the lower layers of the Internet, where there isn’t a ‘choke point’ that allows a single entity to control them. There are even existing standards for many of these functions, but they haven’t succeeded. Sometimes, that’s because they weren’t capable enough, or able to evolve quickly enough (see  Moxie’s great talk about this), or because someone used market power to shift power away from an open solution that didn’t fit their business model (Google Reader, anyone?).\n With this in mind, I’ve been watching the investigations of the competition issues surrounding big tech platforms around the world with great interest.  1 It seems to me that an obvious remedy to a concentration of power is to distribute that power by requiring market participants to use open interoperability standards, and competition regulators have the power to force the issue. This won’t solve all problems with the big platforms, of course, but it’s a great start.\n Lots of people seem to agree; if you have some reading time, browser through papers from folks like  Chris Riley,  Peter Swire, the  Internet Society,  Kerber &amp; Schweitzer,  Ian Brown,  Kades &amp; Scott Morton, and  Chinmayi Sharma - to name just a few.\n However, establishing good standards isn’t easy. Balancing different stakeholders’ views, broadness of applicability, implementation concerns, security and privacy, interoperability, and the need to actually ship something is difficult even when everyone gets along. Additionally, the outcome needs to be legitimate on the same scale that the Internet is – globally. As we’ll see, that’s an aspect that requires very careful management.\n Over the years, the Internet community has evolved a set of institutions and associated architectural principles to embody these tradeoffs. It’s not that every Internet or Web specification has to go through the W3C or the IETF, or that every standard that these bodies produce is successful (far from it). What these bodies provide is an ever-growing knowledge and experience of what  not to do, both technically and organisationally, when you’re creating technical standards for the Internet.\n In this context, I found two recent announcements about competition efforts to reign in big tech both interesting and concerning.\n  The saga of  Google’s Privacy Sandbox and the  UK Competition and Market Authority’s investigation into its competition impact deserves a paper of its own,  2 but I want to focus on the  CMA’s announcement last week.\n In a nutshell, Google’s efforts to improve privacy by removing support for third-party cookies in Chrome have attracted the CMA’s attention, because doing so can be seen to give Google an upper hand in the advertising and publishing markets, since Google will retain access to first-party tracking information. Last week’s announcement stated that Google had made some commitments to the CMA regarding how it would develop the Privacy Sandbox.\n The CMA’s concerns about the impact of these changes on those markets are entirely reasonable, and some parts of the Privacy Sandbox are dubious at best (e.g., see  Mozilla’s assessment of FLoC). However, the Privacy Sandbox also includes functions like:\n Removing third-party cookies: just like Firefox, Safari and Brave are doing, with support extending from the  very first Cookie standard through to the  most recent revision.\n  Combatting fingerprinting: just like Firefox, Safari and Brave are doing, with broad support over multiple years  in Web standards.\n  Privacy proxies: just like Firefox and Apple are working on, with relevant standardisation activity in the  IETF MASQUE Working Group among other places.\n These functions – which many consider to be normal or even critical browser functions – are now subject to approval by the UK’s competition regulator, at least in the most popular Web browser. By extracting commitments from Google regarding how they build Chrome, the CMA has quietly inserted itself as a ‘silent partner’ to Google. Most significantly, Google is now required to give the CMA 60 days notice before removing third-party cookies from the browser, even though other browsers have done so long ago.\n What’s concerning is that the CMA is creating what’s effectively a parallel process to what standards go through, but substituting its own judgement and perspective. The outcomes will be solely dictated by the CMA and the ICO, based upon consultations with those parties that they choose, and supported by British values and a  British sense of what ‘privacy’ means and its priority relative to the advertising ecosystem. Whether they get it right for the rest of the world is anybody’s guess; they have a very specific set of goals and incentives which are radically different than those that brought us the Internet and the Web.\n Of course, just like other software vendors, browsers have to conform to the legal requirements in the various jurisdictions that they have a market in. This intervention is also fairly ‘light’; they’re not yet telling Google what it must do. So when I saw the news of these commitments, I was concerned for the reasons above, but not yet alarmed. What happened next took care of that.\n  One of the  five US bills to designed to rein in big tech that have been getting a lot of press recently is the  ACCESS Act 2021.\n This bill requires designated platforms (likely candidates would be Google, Facebook and Amazon) to conform to interoperability standards set by new a new committee run by the FTC. If it passes, the APIs that define the next layer of the Internet will not be based upon broad community input, review, or participation.\n Instead, the FTC will hand-pick the participants at its pleasure, and will retain change control over the APIs.  3. Even if the right mix of people gets onto the committee, its role is explicitly ‘advisory’.  4 Documentation for those APIs is only supplied to ‘competing businesses or potential competing businesses.’  5 There’s no guarantee they’ll be public.\n To be clear, I’m super-happy that Lina Khan is now the FTC Chair. Some big platform heads need kicking, and her boots are laced. That said, technical standards defined to force interoperability on big tech will inevitably become the de facto standards for the industries that they’re established within, potentially lasting far longer than the companies they’re designed to hobble (if they do their jobs well). That effectively makes the FTC a new Internet governance institution.\n  While these developments might be appropriate in the context of domestic competition law, they’re likely to have significant negative effects on the Internet overall. Governments taking control of Internet governance with a focus on economic actors has two predictable effects:  fragmentation and  ossification.\n  Creating government-set standards for Internet functions will inevitably lead other governments to decide that their priorities are different, or that they just don’t find someone else’s standards palatable. For example, the EU could decide that the UK got the wrong end of the stick on the Privacy Sandbox, or Brazil could decide that the US standards for social networking aren’t for it.\n That, in turn, would increase the pressure towards fragmentation, and the corresponding diminishment of the enormous benefits that the Internet has for global society and trade.\n Google will have to figure out whether to have a UK version of Chrome, or try to force the UK’s approach to privacy and advertising on everyone else. Facebook will be faced with the possibility of supporting different APIs in different countries – which will probably suit them fine, because it will help prevent a large rival from being established.\n The risks of fragmentation have been widely recognised for some time, and as a result, governments all over the world have agreed that the best way to govern the Internet is with a ‘multistakeholder’ model that places responsibility for technical standardisation firmly in the hands of community-led, industry-backed organisations.\n For example, in 2017 the G20 (including the UK and US)  said that they were\n Reaffirming the principle in the G20 Digital Economy Development and Cooperation Initiative commitment to a multistakeholder approach to Internet governance, which includes full and active participation by governments, private sector, civil society, the technical community, and international organisations, in their respective roles and responsibilities. We support multistakeholder processes and initiatives which are inclusive, transparent and accountable to all stakeholders in achieving the digitally connected world.\n And, they can be viewed as bound by treaty to do so; as per the  WTO Agreement on Technical Barriers to Trade s 2.6:\n With a view to harmonizing technical regulations on as wide a basis as possible, Members shall play a full part, within the limits of their resources, in the preparation by appropriate international standardizing bodies of international standards for products for which they either have adopted, or expect to adopt, technical regulations.\n I’m not sure if the friction between these developments and their commitments haven’t been recognised, or if it’s just being ignored. However, if the amount of pain and mistrust involved in the  IANA transition is any indication, much of the rest of the world is not content to allow the US (or any other rich Western country) solely determine the future of the Internet.\n  The other risk is creating friction against future, beneficial changes to the Internet. For example, creating an API for Facebook might only serve to cement them (or their business model) into place as the ‘glue’ of social networking, preventing other, more decentralised models from emerging.\n Likewise, forcing Chrome to accommodate third-party cookies and other forms of tracking to prop up the third-party display advertising industry might prevent a natural and healthy evolution towards other forms of advertising and other means of supporting Web content.\n In protocol design, we call this  ossification – when the ability to evolve is prevented by external factors. Mandated support for specific technical specifications or features combined with the market power that is being targeted is a dangerous brew.\n To put it another way: if we leave the definition of the Internet to the US Federal Trade Commission and the UK Competition and Markets Authority, we shouldn’t be surprised if the result is focused on companies and competition, rather than people and cooperation. Companies have a huge part to play in the Internet, but it doesn’t mean we should delegate all functions to them, especially when significant advances are being made in decentralisation.\n  All of this raises the question:  can these standards be defined within the multistakeholder system? To put it another way, are the IETF and W3C fit for this purpose?\n It’s a good question. These bodies are set up for  voluntary, not mandatory standards, and the spectre of mandatory implementation for some parties has a huge distorting effect. As someone who’s been involved in Internet and Web standardisation for more than twenty years, I’m not sure how it would go, and there are a lot of hard questions that would need to be answered.\n Still, in some cases there are existing solutions that could be adapted as the basis for interoperability standards (e.g.,  ActivityStreams for social networking).\n In other cases, the  threat of regulation might change power dynamics enough to produce meaningful change. For example, browsers haven’t had a strong incentive to align how they handle third-party cookies to date, but that might change if the CMA, ICO and other interested regulators made their preferences known.\n Beyond their standardisation processes, these organisations have pools of deeply experienced engineers who have thought about the issues involved in many relevant areas for a long time. By looking only through the lens of ‘what big companies do I need to talk to?’, the regulators miss out on valuable alternative perspectives.\n However, we may not find out how much these bodies could bring to the table: apparently, many of the relevant decision-makers consider these institutions to be compromised by big tech companies. I think that’s a simplistic view of two complex organisations with many different participants, incentives and goals. That said, this view can’t be dismissed out of hand; big tech companies clearly have significant power inside standards organisations as well as in the market, and  multistakeholderism may be unstable ground for legitimacy on its own.\n So, I think that these governance institutions need to do some introspection – to find how they can maintain (or build) legitimacy and trust, so that bodies like the CMA and FTC can plausibly defer to their open, community-based global processes for technical standardisation. If that isn’t possible, buckle up: the way the Internet is standardised is going to change a lot, and it’s not at all clear where we’ll end up.", "posttime": "2021-06-22 12:30:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "互联网,internet", "title": "下一层互联网将如何标准化 ", "title_en": "How the Next Layer of the Internet Is Going to Be Standardised", "transed": 1, "url": "https://www.mnot.net/blog/2021/06/21/standards-competition-governance", "via": "", "real_tags": ["互联网", "internet"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国分析显示喝咖啡的人减少了从病情中死亡的风险降低了49％\n    从浓咖啡到即时，咖啡是数百万日常生活的一部分。现在研究表明，酿造可以与慢性肝病的发展或死亡的较低机会有关。\n 慢性肝病是世界各地的主要健康问题。根据英国肝脏信任，肝病是英国早产的第三个主要原因，死亡自1970年以来已升起400％。\n  新的研究是最新的建议饮用咖啡可以带来好处，与以前的工作表明它可能有助于避免肝癌，降低含有酒精相关肝病的风险。\n “南安普敦学习专员Paul Roderick教授说：”这是一个大型英国队的咖啡饮酒是保护性的，“南安普敦大学学习专家组织教授说。\n 在BMC公共卫生，Roderick及其同事中的写作报告了他们如何分析来自英国Biobank的494,585名参与者的数据 - 一个项目，该项目旨在帮助解除与特定条件相关的遗传和环境因素。\n 当他们签署该项目时，所有参与者均为40至69岁，符合384,818，称他们是咖啡饮用者，而109,767则为谁没有消耗饮料。 \n该团队观察了参与者的肝脏健康，在近11年的中位数，发现3,600例慢性肝病，患有301例死亡，1,839例简单的脂肪肝病。\n 该分析显示，在考虑到体重指数，酒精消费和吸烟状态等因素后，那些喝任何咖啡的人和任何类型的人患有慢性肝病或脂肪肝病的风险降低了20％ （总之）比那些没有消耗酿造的人。咖啡饮用者也从慢性肝病中死亡的风险降低了49％。\n 该团队表示，效果的幅度随着消耗的咖啡量而增加，每天大约三到四杯，“超越消费的进一步增加不提供额外的益处”。\n 当瞬间，脱咖啡因和地面咖啡分别考虑时，也发现了风险的降低 - 尽管后者与最大效果相关。\n 然而，该研究具有局限性，包括它不能证明咖啡本身降低了慢性肝病的风险，而参与者只在一个时间点慢慢喝咖啡饮用习惯。\n 然而，它确实提出了预防严重肝病的有效干预，在高风险的情况下说，“罗伯克说，罗伯克说，这是有许多成分可能对肝病产生有益作用，而且这些有效咖啡类型之间。\n 英国肝脏信托的Vanessa Hebditch表示，该研究增加了一种日益增长的证据，咖啡对肝脏健康有益。 \n“然而，重要的是，人们不仅仅是通过饮用咖啡来改善他们的肝脏健康，”她说，“但通过砍伐酒精并通过锻炼和饮食来保持健康的体重。” ", "note_en": "UK analysis shows people who drank coffee had 49% reduced risk of dying from the condition\n    From espresso to instant, coffee is part of the daily routine for millions. Now research suggests the brew could be linked to a lower chance of developing or dying from chronic liver disease.\n Chronic liver disease is a major health problem around the world.  According to the British Liver Trust, liver disease is the third leading cause of premature death in the UK, with deaths having risen 400% since 1970.\n  The new study is the latest to suggest drinking coffee could bring benefits, with previous work suggesting it may  help stave off liver cancer, and reduce the  risk of alcohol-related liver disease.\n “It confirms in a large UK cohort that coffee drinking is protective against severe liver disease,” said Prof Paul Roderick, a co-author of the study from the University of Southampton.\n Writing in the journal  BMC Public Health, Roderick and colleagues report how they analysed data from 494,585 participants in the  UK Biobank – a project designed to help unpick the genetic and environmental factors associated with particular conditions.\n All participants were aged 40 to 69 when they signed up to the project, with 384,818 saying they were coffee drinkers at the outset compared with 109,767 who did not consume the beverage.\n The team looked at the liver health of the participants over a median period of almost 11 years, finding 3,600 cases of chronic liver disease, with 301 deaths, and 1,839 cases of simple fatty liver disease.\n The analysis revealed that after taking into account factors such as body mass index, alcohol consumption, and smoking status, those who drank any amount of coffee, and of any sort, had a 20% lower risk of developing chronic liver disease or fatty liver disease (taken together) than those who did not consume the brew. The coffee drinkers also had a 49% lower risk of dying from chronic liver disease.\n The team said the magnitude of the effect increased with the amount of coffee consumed, up to about three to four cups a day, “beyond which further increases in consumption provided no additional benefit”.\n A reduction in risk was also found when instant, decaffeinated and ground coffee were considered separately – although the latter linked to the largest effect.\n However, the study has limitations, including that it cannot prove that coffee itself reduces the risk of chronic liver disease, while participants were only quizzed about their coffee drinking habits at one point in time.\n “It does, however, raise the issue that it might be an effective intervention to prevent severe liver disease, say in those at high risk,” said Roderick, noting there are numerous ingredients that may exert beneficial effects on liver disease and that these vary between types of coffee.\n Vanessa Hebditch, of the British Liver Trust, said the research added to a growing body of evidence that coffee was good for liver health.\n ““However, it’s important that people improve their liver health not just by drinking coffee,” she said, “but by also cutting down on alcohol and keeping to a healthy weight by exercising and eating well.”", "posttime": "2021-06-22 11:43:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表明,coffee,咖啡", "title": "研究表明，饮用咖啡可能会降低慢性肝病的风险 ", "title_en": "Drinking Coffee May Cut Risk of Chronic Liver Disease, Study Suggests", "transed": 1, "url": "https://www.theguardian.com/science/2021/jun/22/drinking-coffee-may-cut-risk-of-chronic-liver-disease-study-suggests", "via": "", "real_tags": ["表明", "coffee", "咖啡"]}, {"category": "", "categoryclass": "", "imagename": "f9e875478a46c0c63032e3ad14e54496.png", "infoid": 1067350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在26年的女性随访期间，在男性和20年内检查低碳水化合物饮食与死亡率的关联。\n 妇女与男性的预期队列研究，遵从1980年（女性）或1986年（男性）直到2006年。低碳水化合物饮食，基于动物（强调动物脂肪和蛋白质），或基于植物（强调蔬菜来源）脂肪和蛋白质）从随访期间评估的多个经过验证的食物频率调查问卷计算。\n  85,168名妇女（在基线34-59岁）和44,548名男性（在基线40-75岁）没有心脏病，癌症或糖尿病。\n 调查员记录了12,555名死亡（2,458名心血管，5,780名癌症）和男性的8,678名死亡（2,746名心血管，2,960癌症）。\n 整体低碳水化合物评分与集合分析中总体死亡率的较高升高有关（危险比，人力资源，比较极端甲基叶片= 1.12（95％CI = 1.01-1.24，P趋势= 0.14）。动物低碳水化合物得分与较高的全导致死亡率有关（汇集HR比较极端减法= 1.23,95％CI = 1.11-1.37，P趋势= 0.05），心血管死亡率（相应的HR = 1.14,95％CI = 1.01-1.29， p-trend = 0.029）和癌症死亡率（相应的HR = 1.28,95％CI 1.02-1.60，p用于趋势= 0.09）。相反，较高的植物低碳水化合物得分与较低的全原因有关（HR = 0.80,95％CI = 0.75-0.85，p趋势＆lt; 0.001）和心血管死亡率（HR = 0.77,95％CI = 0.68-0.87，p趋势＆lt; 0.001）。\n 通过一定程度的误差评估饮食和生活方式特征，然而，敏感性分析表明，结果不太可能受到残留或混淆的影响或未测量的混淆。此外，参与者不是美国人口的代表性样本。\n 基于动物来源的低碳水化合物饮食与男性和女性的全导致死亡率较高，而基于植物的低碳水化合物饮食与较低的全因和心血管疾病死亡率有关。 \n低碳水化合物饮食要求促进减肥，改善血液胆固醇水平和血压（1,2）。减肥试验持续6个月至2年，发现它们与具有较高碳水化合物含量的饮食有效（，）或更有效（，）。然而，将对低碳水化合物饮食的血脂曲线的影响混合，具有低碳水化合物饮食，导致高密度脂蛋白的提高，但低密度脂蛋白的低密度变化比高碳水化合物饮食（ - ）。此外，这些饮食可以在红色肉类和水果，蔬菜和整个晶粒中较高，已被证明增加了慢性疾病的风险（ - ）。另一方面，与高碳水化合物，乳清卵素素食饮食相比，“生态阿特金斯”饮食，低热量，低碳水化合物饮食，具有大量植物蛋白和油脂的饮食，具有大量的植物蛋白和油脂。 （）。由于美国心血管疾病（CVD）和癌症（CVD）和癌症（14）的主要死因多年来，需要对低碳水化合物饮食的长期研究来评估对死亡率的影响。然而，由于难以在多年内保持合规性和随访的困难，对死亡率的低碳水化合物饮食的随机试验是不可行的。\n 我们以前开发了三种分数，以根据饮食中的碳水化合物，脂肪和蛋白质的比例来表征低碳水化合物，以及来自动物或植物来源的这些常规营养素的贡献。我们发现低碳水化合物饮食成绩较高的女性没有更大的2型糖尿病和冠心病的风险，并且强调脂肪和蛋白质的低碳水化合物饮食模式与较低的两者风险较低（， ）。然而，低碳水化合物饮食和死亡率的长期数据是稀缺的。两位欧洲队列报道，低碳水化合物高蛋白质饮食与弱且统计学显着较高的死亡率（，）。这些研究仅包括几百个死亡，并且没有评估不同的蛋白质和脂肪来源。\n 因此，我们前瞻性地检查了在美国的两种大型队列中不同类型的低碳水化合物饮食和造成特异性和造成特异性死亡率之间的关系。\n 护士＆＃39;健康研究（NHS）是一项居住在1976年11月11日的121,700名女性护士的队列研究（图1A）。问卷由两年一次地发送，以收集医疗，生活方式和其他与健康相关信息（）。 1980年，参与者完成了61项食物频率调查问卷（FFQ）。这是1984年扩大到116项，而类似的FFQ已于1986年，1990年，1994年，1998年和2002年发送。\n  健康专业人士＆＃39;后续研究（HPFS）成立于1986年，51,529名雄性富牛犬，验光剂，药剂师，牙医和兽医，年龄40至75岁（图1B）。与NHS类似的问卷每两年发送每两年，并每四年发送FFQ（）。每个FFQ都包含大约130个关于食物摄入量的问题。两年期的每个2年周期都完成了随访时间超过90％。\n  对于此分析，我们在收集了第一个膳食数据时，我们使用1980年作为NHS的基线。我们包括完成1980年FFQ的女性，其中10个缺少物品和合理的总能量摄入（从FFQ计算，在500和3500千卡/日之间）（21）。对于HPFS，我们包括在基线的800至4200千卡/天的总能量摄入（从FFQ计算）的男性，并且缺少物品。除了患有癌症史的人之后（女性：1579，男性：1998）（非黑色素瘤皮肤癌除外），心脏病（女性：772人：2077）和糖尿病在基线（女性：1858年，男人： 1284），我们包括85,168名妇女从1980年至2006年的后续行动，44,548名男子从1986年到2006年随访。该研究经受Brigham和妇女的制度审查委员会批准的，波士顿的医院，嘛。\n 自我管理的半定量FFQ旨在评估前一年的平均食物摄入量。为每种食物给出了标准部分尺寸和九个可能的消费频率类别，从“从不，从未，或＆1 /月”到“6+ 6次”。通过从所有食物总结来计算总能量和营养摄入量。以前的验证研究表明，在NHS（21）和HPFS（）中，FFQ评估的能量调整后的营养成分和多个食物记录之间的能量调整的营养素之间的相关性相当良好的相关性。 \nWarning: Can only detect less than 5000 characters\n还汇集了每个群组的危险比，以使用允许 - 研究之间的无规效果模型获得概述风险估计。使用Cochran Q测试计算研究结果的异质性的p值。通过在低碳水化合物饮食评分和“月份月份”变量之间的相互作用项，对总死亡率进行比例危害总死亡率的假设。用SAS版本9.1（Cary，NC）进行统计分析。\n 作为一种敏感性分析，我们仅使用基线膳食信息重复我们的分析，并在使用NHS（21）和HPFS（）中进行的验证研究的数据进行评估，以评估总低碳水化合物饮食评分的测量误差（）。为了探索剩余混杂，我们为具有更精细的类别或单独的回归模型中的连续变量的主要混淆以及计算和调整倾向得分（）。我们还进行了敏感性分析，以检查未测量混淆（）的影响力的稳健性。我们没有观察到这些预防措施的结果中的任何重大差异，因此在原始类别中调整的协变量提出了结果。我们使用了多个归纳程序，其中20轮估算，包括所有协变量，以考虑丢失膳食和协变量数据。然后，我们使用非累积更新对我们使用最近的饮食数据来预测死亡率（29）的非累积更新来重复分析。\n 该研究得到了国家卫生研究院的支持。它在研究，分析或解释数据的设计和行为中没有作用，或在出版之前准备或最终批准稿件。\n 在高达26年的后续后，我们记录了12,555人死亡，其中2,458例是心血管死亡，5,780人是癌症死亡。在癌症死亡中，1,605名来自乳腺癌，从结肠直肠癌547分，1,280名来自肺癌。在高达20年的后续的HPF中，有8,678人死亡，其中2,746名是CVD死亡，2,960名是癌症死亡。在癌症死亡中，335例患有结直肠癌，563例来自肺癌，来自前列腺癌的416例。\n 整体和动物低碳水化合物得分更高的男性和女性都有更高的BMI，更有可能是目前的吸烟者，但水果和蔬菜的摄入量降低（表1）。相反，植物低碳水化合物评分更高的人往往具有更高的酒精和全谷物摄入量。为男女数据的一致性选择了1986年。\n *适用于生活方式特性的基线大量，1986年饮食摄入量的概要。除非另有说明，否则数据是手段。 BMI =体重指数，满足=代谢等效时间。\n 在调整潜在的混乱后，我们观察到具有动物低碳水化合物评分的全导致死亡率的适度但统计学上更高的风险（HPFS的动物评分的极端大量= 1.31,95％CI = 1.19-1.44，P趋势＆lt; 0.001;对于NHS：HR = 1.17,95％CI = 1.08-1.26，P趋势＆lt; 0.001）（表2）。汇集的人力资源为1.23（95％CI = 1.11-1.37，P趋势= 0.051）。在两个群组中，在蔬菜评分和全导致死亡率之间观察到类似的逆关联，汇集的人力资源比较极端截止值= 0.80（95％Ci = 0.75-0.85，P趋势＆lt; 0.001）。 \n*调整年龄，体育活动，BMI，能量摄入，酒精摄入，更年期状态和后绝经激素使用，高血压病史，吸烟，多种维生素使用。\n 对于CVD死亡率，仅在男性中的总低碳水化合物得分（表3）观察到适度但统计学上显着的直接关联。然而，基于动物的分数在汇总分析中显示出直接关联（HR = 1.14,95％CI = 1.01-1.29，P趋势= 0.029，用于动物评分）。对于男性和女性，基于植物的评分的结果，CVD死亡率的合并HR为0.77（95％CI = 0.68-0.87，P趋势＆lt; 0.001）。\n *调整年龄，体育活动，BMI，能量摄入，酒精摄入，更年期状态和后绝经激素使用，高血压病史，吸烟，多种维生素使用。\n 对于总癌症死亡，观察到统计学上显着的直接关联，在男性中总体低碳水化合物评分（HR比较极端甲板1.32,95％CI = 1.11-1.57，P趋势＆lt; 0.001）（表4）。用男性的动物低碳水化合物得分观察到稍微较强的关联（HR = 1.45,95％CI = 1.23-1.72，P趋势＆lt; 0.001）。然而，女性中相同的关联较弱，并且在更细的类别中建模吸烟和身体活动时没有达到敏感性分析中的统计学意义。此外，在任何男性或女性中，没有观察到植物低碳水化合物得分。\n *调整年龄，体育活动，BMI，能量摄入，酒精摄入，更年期状态和后绝经激素使用，高血压病史，吸烟，多种维生素使用。\n 在组合数据时，在动物低碳水化合物评分和结肠直肠癌死亡之间观察到直接关联（HR比较极端Quintiles = 1.31,95％CI = 1.06-1.62，P趋势= 0.048）（表5，在线附录）。在群组中，总体和动物低碳水化合物评分与肺癌死亡率正相关，汇总危险比为1.22（95％Ci = 1.05-1.42，P趋势= 0.003）比较顶部到底码（表5）。植物低碳水化合物得分与肺癌死亡无关。调整与特异性癌症相关的危险因素后，含有低碳水化合物分数与乳腺癌或前列腺癌死亡无关。\n 体育检查的额外调整，以减少晚期检测的可能性，因此更多的致命疾病显示出类似的结果。甚至在诊断慢性疾病后，我们还重复了我们的分析，即使在诊断慢性疾病后，甚至仍在诊断慢性疾病，而且调整了回归模型中的自我报告的诊断。在两个队列中，相对风险和p值都没有改变。对性别特异性分析的多种比较的Bonferroni校正没有改变全因，CVD或癌症死亡率结果的结论，并且统计上的重要协会仍然存在显着性。 \n在随访期间，不到25％的NHS或HPF参与者错过了超过2个FFQ。 然而，当使用多重撤销程序丢失数据时，动物和植物低碳水化合物分数的结果仍然存在统计学意义。 在NHS中，动物评分的10点增加的HR为1.09（P <0.0001），总死亡率和C  ...... ", "note_en": "To examine the association of low-carbohydrate diets with mortality during 26 years of follow-up in women and 20 years in men.\n A prospective cohort study of women and men, followed from 1980 (women) or 1986 (men) until 2006. Low-carbohydrate diets, either animal-based (emphasizing animal sources of fat and protein), or vegetable-based (emphasizing vegetable sources of fat and protein) were computed from multiple validated food frequency questionnaire assessed during follow-up.\n  85,168 women (aged 34-59 years at baseline) and 44,548 men (aged 40-75 years at baseline) without heart disease, cancer, or diabetes.\n Investigator documented 12,555 deaths (2,458 cardiovascular, 5,780 cancer) in women and 8,678 deaths (2,746 cardiovascular, 2,960 cancer) in men.\n The overall low-carbohydrate score was associated with a modest increase in overall mortality in pooled analysis (Hazard Ratio, HR, comparing extreme deciles=1.12 (95% CI=1.01-1.24, p-trend=0.14). The animal low-carbohydrate score was associated with a higher all-cause mortality (pooled HR comparing extreme deciles=1.23, 95% CI=1.11-1.37, p-trend=0.05), cardiovascular mortality (corresponding HR=1.14, 95% CI=1.01-1.29, p-trend=0.029), and cancer mortality (corresponding HR=1.28, 95% CI 1.02-1.60, p for trend = 0.09). In contrast, a higher vegetable low-carbohydrate score was associated with lower all-cause (HR=0.80, 95% CI=0.75-0.85, p-trend&lt;0.001) and cardiovascular mortality (HR=0.77, 95% CI=0.68-0.87, p-trend&lt;0.001).\n Diet and lifestyle characteristics were assessed with some degree of error, however, sensitivity analyses indicated that results were not unlikely to be substantially affected by residual or confounding or an unmeasured confounder. In addition, participants were not a representative sample of the U.S. population.\n A low-carbohydrate diet based on animal sources was associated with higher all-cause mortality in both men and women, whereas a vegetable-based low-carbohydrate diet was associated with lower all-cause and cardiovascular disease mortality rates.\n Low-carbohydrate diets have claimed to promote weight loss, improve blood cholesterol levels, and blood pressure( 1,  2). Weight loss trials lasting 6 months to 2 years have found them to be as effective( ,  ) or more effective( ,  ) than diets with higher carbohydrate content. However, effects on blood lipid profiles for low-carbohydrates diets with substantial animal products were mixed, with low-carbohydrate diets resulting in greater improvements in high density lipoprotein but possibly less favorable change in low density lipoprotein than higher carbohydrate diets( - ). In addition, these diets can be high in red meat and low in fruits, vegetables, and whole grains which has been shown to increase risk of chronic diseases( - ). On the other hand, the “Eco-Atkins” diet, a low-calorie, low-carbohydrate diet with high amounts of plant protein and oils has shown to improve low density lipoprotein levels when compared with a high carbohydrate, lacto-ovo vegetarian diet ( ). Because the leading causes of death in the U.S.–cardiovascular disease (CVD) and cancer( 14)–develop over many years, long-term studies of low-carbohydrate diets are needed to evaluate effects on mortality. However, randomized trials of low-carbohydrate diets on mortality are not feasible because of the difficulty in maintaining compliance and follow-up over many years.\n We previously developed three scores to characterize low-carbohydrates based on the proportion of carbohydrate, fat, and protein in the diet, and the contribution to these macronutrients from animal or vegetable sources( ). We found that women with higher low-carbohydrate diet scores did not have greater risk of type 2 diabetes and coronary heart disease and that a low-carbohydrate dietary pattern that emphasized vegetable sources of fat and protein was associated with a lower risk of both( ,  ). However, long-term data on low-carbohydrate diets and mortality are scarce. Two European cohorts reported that a low-carbohydrate-high protein diet was associated with a weak but statistical significant higher mortality( ,  ). These studies included only a few hundred deaths, and did not evaluate different sources of proteins and fat.\n Therefore, we prospectively examined the relation between different types of low-carbohydrates diets and all-cause and cause-specific mortality in two large cohorts in the U. S.\n The Nurses&#39; Health Study (NHS) is a cohort study of 121,700 female nurses aged 30-55 years living in 11 U.S. states established in 1976 (  figure 1a). Questionnaires are sent biennially to collect medical, lifestyle, and other health-related information( ). In 1980, participants completed a 61-item food frequency questionnaire (FFQ). This was expanded to 116 items in 1984 and similar FFQs were sent in 1986, 1990, 1994, 1998, and 2002.\n  The Health Professionals&#39; Follow-up Study (HPFS) was established in 1986 with 51,529 male podiatrists, optometrist, pharmacists, dentists, and veterinarians, aged 40 to 75 years (  figure 1b). Questionnaire similar to the NHS are sent every two years, and an FFQ was sent every four years( ). Each FFQ contained approximately 130 questions on food intake. Follow-up was complete for over 90% in each 2-year cycle for both cohorts.\n  For this analysis, we used 1980 as baseline for NHS when the first dietary data were collected. We included women who completed the 1980 FFQ with &lt;10 missing items and a plausible total energy intake (calculated from the FFQ, between 500 and 3500 kcal/day)( 21). For HPFS, we included men with total energy intake (calculated from the FFQ) of 800 to 4200 kcal/day at baseline and &lt;70 missing items. After excluding those with a history of cancer (women: 1579, men: 1998) (except non-melanoma skin cancer), heart disease (women: 772, men: 2077), and diabetes mellitus at baseline (women: 1858, men: 1284), we included 85,168 women with follow-up from 1980 through 2006, and 44,548 men with follow-up from 1986 to 2006. This study was approved by the Institutional Review Board of the Brigham and Women&#39;s Hospital, Boston, MA.\n Self-administered semi-quantitative FFQs were designed to assess average food intake over the preceding year. A standard portion size and nine possible consumption frequency categories, from “never, or &lt;1/month” to “6+ times per day” were given for each food. Total energy and nutrient intake was calculated by summing up from all foods. Previous validation studies revealed reasonably good correlations between energy-adjusted nutrients assessed by the FFQ and multiple food records completed over the preceding year in both NHS( 21) and HPFS( ).\n The computation of low-carbohydrate diet scores was previously described in detail( ). Briefly, percentages of energy from fat, protein, and carbohydrate were divided into deciles. For fat and protein, participants in the highest decile received 10 points for that macronutrient and participants in the ninth decile received 9 points, and so forth. For carbohydrate, the lowest decile received 10 points and the highest zero points. The fat, protein, and carbohydrate scores were summed to create the overall low-carbohydrate-diet score, which ranged from 0-30. In addition, we also created a vegetable low-carbohydrate score, based on percent of energy of carbohydrate, vegetable protein, and vegetable fat; and an animal low-carbohydrate score based on percent energy as carbohydrate, animal protein, and animal fat. Thus, each participant was given the overall, animal and vegetable scores.\n Deaths were identified from state vital statistics records, the National Death Index, reported by the families, and the postal system. Cause of death was identified from death certificates or review of medical records. For this analysis, we evaluated all-cause mortality, death from CVD (International Classification of Diseases, eighth revision [ICD-8] codes 390 through 458), cancer (ICD-8 codes 140 through 207), death from colorectal (ICD-8 codes 153-154), lung (ICD-8 code 162), breast (ICD-8 code 174), and prostate (ICD-8 code 185) cancers. The follow-up for death in both cohorts is at least 95% complete( ).\n Body mass index (BMI) was calculated from weight reported on each biennial questionnaire and height reported at the first questionnaire. Smoking status and number of cigarette use, history of hypertension, aspirin use (number of tablets and frequency of use), regular intake of multivitamin, menopausal status and use of postmenopausal hormone therapy, parity, and age at first birth were assessed every 2 years. In the NHS, hours per week of vigorous activities was collected in 1980, 1982, and 1984. Leisure-time physical activity was measured 7 times beginning in 1986 with validated questions on 10 common activities in NHS and biennially from baseline in HPFS. The information was then summed and calculated as Metabolic Equivalent Hours (METs)( ). In NHS, we inquired about physical examinations (for screening purposes or to evaluate symptoms) at baseline and in both cohorts every two years beginning in 1988. Family history (1 st degree relatives) of colorectal cancers, breast (women only), prostate cancer (men only), and information on having undergone colonoscopy and prostate specific antigen (PSA, men only) screening were also collected several times during follow-up.\n We used Cox proportional hazard models to assess the association between the three low-carbohydrate diet scores and risk of all-cause mortality during follow-up. In addition, we separately analyzed CVD mortality, overall cancer mortality, and the leading causes of cancer deaths: lung, colorectal, breast (women only), and prostate (men only). All analyses were conducted separately for each cohort.\n For analyses of all-cause, CVD, and cancer mortality, participants were divided into 10 categories (deciles) for each of the low-carbohydrate diet scores. For specific cancer deaths, participants were categorized into quintiles of low-carbohydrate diet scores because of smaller numbers of cases. To reduce random within-person variation and to best represent long-term dietary intake, we calculated cumulative averages of the 3 low-carbohydrate diet scores from our repeated FFQs ( ). For example, in NHS, the low-carbohydrate diet score in 1980 was used to predict mortality between 1980 and 1984, the average score from 1980 and 1984 was used to predict mortality from 1984 to 1986, and so forth with cumulative dietary information for the entire follow-up duration. The same procedure was used in HPFS. However, dietary intake was not updated when the participants reported a diagnosis of cancer (except non-melanoma skin cancer), diabetes, stroke, coronary heart disease, or angina because these conditions may lead to changes in diet.\n In multivariate analyses, we adjusted for age (continuous), physical activity (quintiles), BMI (5 categories), energy intake (quintiles), alcohol intake (4 categories), history of hypertension (yes/no), smoking (5 categories), and multivitamin use (yes/no) with updated information at each 2 year questionnaire cycle. In women, we also adjusted for menopausal status and post menopausal hormone use (4 categories). In secondary analysis, we also adjusted for having gone through a physical examination (yes/no) at each 2 year questionnaire cycle as this may be related to early disease detection and hence better prognosis. Individuals with missing BMI were excluded from baseline (2%). Smoking status was missing for 0.2% of the participants in NHS and 4% participants in HPFS at baseline. These individuals were represented by a missing indicator variable for smoking.\n For analyses of deaths due to specific cancers, we used multivariate models that additionally included disease-specific risk factors. For breast cancer, we additionally adjusted for family history of breast cancer (yes/no), weight change since age 18 (7 categories), history of benign breast disease (yes/no), BMI at age 18 (4 categories), and height (4 categories). For analysis of prostate cancer, we additionally adjusted for family history of prostate cancer (yes/no), history of diabetes (yes/no), ethnicity (4 categories), height (5categories), vigorous (6+ METs) physical activity (quintiles), history of vasectomy (3 categories), BMI at age 21 (5categories), PSA screening (yes/no). For analysis of colorectal cancer, we additionally adjusted for history of colorectal polyps (yes/no), family history of colorectal cancer (yes/no), history colonoscopy (yes/no), aspirin use (yes/no). Cigarette smoking was modeled as pack years (5 categories). In analysis of lung cancer, covariates used in each cohort were slightly different due to availability of data. Therefore in women, we additionally adjusted for age at smoking initiation (continuous), and smoking status was modeled using six categories. In men, we adjusted for pack years (5 categories), parental smoking in childhood (3 categories), and adult environmental tobacco smoke exposure (4 categories).\n Hazard ratios from each cohort were also pooled to obtain a summary risk estimate using a random effects model that allows for between-study heterogeneity( ). P-values for heterogeneity of study results were calculated using the Cochran Q test. Proportional hazard assumption for total mortality was tested with a time dependent variable by including an interaction term between the low carbohydrate diet score and the “month to death” variable. Statistical analysis was conducted with SAS version 9.1 (Cary, NC).\n As a sensitivity analysis, we repeated our analysis using only baseline dietary information, and corrected for measurement error ( ) in the assessment of the overall low-carbohydrate diet score using data from validation studies conducted in NHS ( 21) and HPFS ( ). To explore residual confounding, we adjusted for major confounders with finer categories or as continuous variables in separate regression models, as well as computing and adjusting for a propensity score ( ). We also conducted sensitivity analysis to examine the robustness of our results from influence of unmeasured confounding ( ). We did not observe any material difference in results from these precautionary measures and therefore presented results with covariates adjusted in their original categories. We used a multiple imputation procedure, with 20 rounds of imputation and including all covariates to account for missing dietary and covariate data. We then repeated the analysis using non-cumulative updating of dietary information in which we use the most recent diet data to predict mortality ( 29).\n This study was supported by the National Institutes of Health. It had no role in the design and conduct of the study, analysis or interpretation of the data, or preparation or final approval of the manuscript before publication.\n In NHS with up to 26 years of follow-up, we documented 12,555 deaths, of which, 2,458 were cardiovascular deaths, and 5,780 were cancer deaths. Among the cancer deaths, 1,605 were from breast cancer, 547 from colorectal cancer, and 1,280 from lung cancer. In the HPFS with up to 20 years of follow-up, there were 8,678 deaths, of which 2,746 were CVD deaths, and 2,960 were cancer deaths. Among cancer deaths, 335 cases were from colorectal cancer, 563 from lung cancer, and 416 from prostate cancer.\n Both men and women who had higher overall and animal low-carbohydrate scores had higher BMI and more likely to be current smokers, but lower intakes of fruits and vegetables (  table 1). Conversely, those with higher vegetable low-carbohydrate score tended to have higher alcohol and whole grain intake. 1986 was chosen for consistency of data for men and women.\n *Baseline deciles for lifestyle characteristics and 1986 deciles for dietary intake. Data are means unless otherwise stated. BMI=body mass index, MET=metabolic equivalent hours.\n After adjusting for potential confounders, we observed a modest but statistically higher risk for all-cause mortality with the animal low-carbohydrate score (HR comparing extreme deciles of animal score for HPFS=1.31, 95% CI=1.19-1.44, p trend&lt;0.001; for NHS: HR=1.17, 95% CI=1.08-1.26, p trend&lt;0.001) (  table 2). The pooled HR was 1.23 (95% CI=1.11-1.37, p trend=0.051). In both cohorts, similar inverse associations were observed between the vegetable score and all-cause mortality, with the pooled HR comparing extreme deciles=0.80 (95% CI=0.75-0.85, p trend&lt;0.001).\n *adjusted for age, physical activity, BMI, energy intake, alcohol intake, menopausal status and post menopausal hormone use, history of hypertension, smoking, multivitamin use.\n For CVD mortality, a modest but statistically significant direct association was observed with the overall low-carbohydrate score in men only (  table 3). However, the animal-based score showed a direct association in the pooled analysis (HR=1.14, 95% CI=1.01-1.29, p trend=0.029 for animal score). Results for the vegetable-based score were similar for men and women, and the pooled HR for CVD mortality was 0.77 (95% CI=0.68-0.87, p trend&lt;0.001) for extreme deciles.\n *adjusted for age, physical activity, BMI, energy intake, alcohol intake, menopausal status and post menopausal hormone use, history of hypertension, smoking, multivitamin use.\n For total cancer deaths, a statistically significant direct association was observed with the overall low-carbohydrate score in men (HR comparing extreme deciles1.32, 95% CI=1.11-1.57, p trend&lt;0.001) (  table 4). A slightly stronger association was observed with the animal low-carbohydrate score in men (HR=1.45, 95% CI=1.23-1.72, p trend&lt;0.001). However, the same association was weaker in women and did not reach statistical significance in the sensitivity analysis when smoking and physical activity was modeled in finer categories. In addition, no association was observed with the vegetable low-carbohydrate score in either men or women.\n *adjusted for age, physical activity, BMI, energy intake, alcohol intake, menopausal status and post menopausal hormone use, history of hypertension, smoking, multivitamin use.\n A direct association was observed between the animal low-carbohydrate score and colorectal cancer death when data were combined (HR comparing extreme quintiles=1.31, 95% CI=1.06-1.62, p trend=0.048) ( table 5, online appendix). In both cohorts, the overall and animal low-carbohydrate scores were positively associated with lung cancer mortality, with the pooled hazard ratio for the overall low-carbohydrate score of 1.22 (95% CI=1.05-1.42, p trend=0.003) comparing top to bottom quintiles ( table 5). The vegetable low-carbohydrate score was not associated with lung cancer deaths. After adjusting for risk factors relevant to specific cancers, none of the low-carbohydrate scores was associated with breast cancer or prostate cancer death.\n Additional adjustment for physical examinations to reduce the possibility of confounding by late detection and hence more fatal diseases showed similar results. We also repeated our analysis with continuous updating dietary information even after diagnosis of chronic diseases, but adjusted for the self-reported diagnosis in the regression models. In both cohorts, neither the relative risks nor the p-values were changed. Bonferroni correction for multiple comparison for gender-specific analysis did not change the conclusion of the results for all-cause, CVD, or cancer mortality, and statistically significant associations remained significant.\n Less than 25% of either NHS or HPFS participants missed more than 2 FFQs during the follow-up period. However, results for the animal and vegetable low carbohydrate scores remained statistically significant when the multiple imputation procedure was used to account for missing data. In NHS, the HR for a 10 point increase in the animal score was 1.09 (p&lt;0.0001) for total mortality and the c\n......", "posttime": "2021-06-22 11:42:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "饮食,diets", "title": "低碳水化合物饮食和全因和造成特异性死亡率 ", "title_en": "Low-carbohydrate diets and all-cause and cause-specific mortality", "transed": 1, "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2989112/", "via": "", "real_tags": ["饮食", "diets"]}, {"category": "", "categoryclass": "", "imagename": "b01aa5aee99e7f5257b0aadf1baeeafb.png", "infoid": 1067349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AWS CloudFormation和AWS云开发套件（CDK）提供了可扩展且一致地配置AWS资源（例如，计算基础架构，监控工具，数据库等）。我们已经听到许多客户，他们希望在从AWS合作伙伴网络（APN）成员，第三方供应商和开源技术的资源提供相同的一致性和可扩展性，无论它们是使用Clibformation吗？模板或已采用CDK定义其云基础架构。\n  我很高兴地宣布用于CloudFormation的新公共登记处，提供可搜索的扩展集合 - 资源类型或模块 - 由AWS，APN合作伙伴，第三方和开发人员社区发布。注册表可以轻松发现和配置CloudFormation模板和CDK应用程序中的这些扩展，以与您使用AWS提供的资源相同的方式。使用Extensions，您不再需要为第三方供应商创建和维护自定义配置逻辑以获取资源类型的资源类型。并且，您能够使用单个基础架构作为代码工具，CloudFormation，以提供和管理AWS和第三方资源，进一步简化基础架构配置过程（CDK在引擎盖下使用CloudFormation）。\n  发布合作伙伴我们很高兴通过十几个APN合作伙伴加入，以便启动注册表，其中35个扩展可供您使用今天使用。博客帖子和来自此发布会上合作的APN合作伙伴的公告，以及AWS快速开始，可以在下面找到（有些日子将在未来几天添加）。\n    2019年注册管理机构和资源类型，CloudFormation推出了对私人注册机构的支持。这些使您的帐户中的注册和使用资源提供者（Lambda函数），包括来自AWS和第三方供应商的提供商。注册提供程序后，您可以使用CloudFormation模板中的提供程序组成的资源类型。资源类型由提供商上传到Amazon简单存储服务（Amazon S3）桶，并且通过引用相关的S3 URL来使用这些类型。公共注册表提供资源类型和模块采购的一致性，您不再需要使用Amazon简单存储服务（Amazon S3）存储桶的集合。\n  公共注册表中的第三方资源类型也与漂移检测集成。从第三方资源类型创建资源后，CloudFormation将从其模板配置中检测到资源的更改，称为配置漂移，就像它与AWS资源一样。您还可以使用AWS Config来管理从注册表中消耗的第三方资源的合规性。配置AWS Config以记录它们时，资源类型将自动跟踪为配置项，并使用CloudFormation以创建，更新和删除它们。无论您使用的资源类型是第三方还是AWS资源，还可以查看它们的配置历史，除了能够编写AWS配置规则以验证配置最佳实践。\n  公共注册表还支持类型配置，使您可以使用每个帐户和区域的API键和OAuth令牌配置第三方资源类型。一定是，配置安全地存储，可以更新。这还提供了配置第三方资源类型的集中方式。\n  公共注册表扩展发布者的发布扩展必须被验证为AWS Marketplace卖方，或作为Github或Bitbucket用户，并且延长验证了最佳实践。要将扩展（资源类型或模块）发布到注册表，必须使用其中一个帐户类型首先在AWS区域中注册。 \n注册后，您接下来将其扩展名发布到同一地区的私有注册表。然后，您需要测试扩展符合发布要求。对于资源类型扩展，这意味着它必须传递为类型定义的所有合同测试。模块符合不同的要求，您可以在文档中找到更多详细信息。通过测试完成，您可以将其扩展发布到您所在地区的公共注册表。有关发布扩展的详细信息，请参阅“用户指南”。\n  使用公共注册表中的扩展我决定尝试与Kubernetes相关的几个扩展，由AWS Quick开始贡献，使配置更改为群集。就个人而言，我没有大量的kubernetes和它的API经验，因此这是探讨延伸如何拯救我的重要时间和努力的机会。在写作这篇文章的过程中，我从其他人那里学到了使用Kubernetes API的（通常的方式来实现我所遇到的变化），通常甚至涉及努力，即使是具有更多经验的人。\n  对于此示例，我需要一个kubernetes集群，因此我遵循本教程在Amazon Elastic Kubernetes服务（eks）中，使用托管节点 -  Linux节点类型设置一个。随着我的集群准备好，我想进行两个配置更改。\n  首先，我想向群集添加新命名空间。命名空间是一个分区构造，它允许我将相同的资源组部署到同一群集中的不同名称空间，而不受隔离命名空间的冲突。其次，我想设置并使用Helm，是Kubernetes的包管理器。我将使用Helm从Prometheus Helm-Charts存储库中安装Kube-State-Metrics包，用于收集群集度量标准。虽然我可以使用CloudFormation来配置群集和计算资源，以前，要执行这两个配置任务，但我必须切换到API或各种定制的工具链。使用注册表和这两个扩展，我现在可以使用CloudFormation做所有事情（当然，当我之前提到时，我也可以使用CDK的扩展，我稍后将显示）。\n  在使用扩展之前，需要在我的帐户中激活它。使用控制台的单个帐户易于执行激活，因为我们在一瞬间看到，如果我使用AWS组织，并希望在整个组织中激活各种第三方扩展，或者为特定的组织单位（OU） ），我可以使用CloudFormation中的服务管理的堆栈来实现这一点。使用资源类型AWS :: CloudFormation :: Typeagtivation在提交给服务管理的StackSet中的模板中，我可以针对整个组织，或特定的OU，传递亚马逊资源名称（ARN）识别第三方扩展名活性。扩展的激活也很容易实现（无论是使用AWS组织是否使用AWS组织）使用带有几行代码的CDK，再次利用上述的Typeactivation资源类型。\n  要激活扩展，请访问CloudFormation控制台，然后单击导航栏中的公共扩展。这将带我到注册表：公共扩展主页，其中我切换到查看第三方资源类型扩展。\n    我想要的扩展是AWSQS :: Kubernetes :: Resource和AWSQS :: Kubernetes :: Helm。资源扩展用于应用描述对群集的配置更改的清单。在我的情况下，清单请求创建命名空间。单击AWSQS :: Kubernetes :: Resource扩展名的名称将带我到一个页面，其中我可以查看扩展架构，配置详细信息和版本。 \n如果您停用要使用的扩展，则会发生什么，或者发布者已撤消扩展名？如果您停用扩展堆栈取决于，则从该扩展程序创建的任何资源都不会受到影响，但您将无法执行进一步的堆栈操作，例如读取，更新，删除和列表（直到扩展重新激活）。发布商必须请求将其扩展从注册表中取出（没有“删除”API）。如果授予请求，请在撤销之前激活扩展的客户仍然可以使用其帐户中的扩展的快照进行创建/读/更新/删除/列表操作。\n  单击“激活”将带我进入一个页面，其中我需要指定云形成运行扩展后的代码时的执行角色的ARN。我在此用户指南主题之后创建一个角色，但基本信任关系以下是参考。\n  {\r ＆＃34;版本＆＃34 ;:＆＃34; 2012-10-17＆＃34 ;,\r ＆＃34;声明＆＃34 ;: [\r {\r ＆＃34;效果＆＃34 ;:＆＃34;允许＆＃34;，\r ＆＃34;校长＆＃34 ;: {\r ＆＃34;服务＆＃34 ;:＆＃34; companess.cloudformation.amazonaws.com＆＃34;\r }，\r ＆＃34;行动＆＃34 ;:＆＃34; sts：假设＆＃34;\r }\r ]\r}\n  我还添加了我正在使用的资源类型的权限。有关我选择类型所需的权限的详细信息可以在Github上找到，用于掌舵，以及Kubernetes（注意Github示例也包括信任关系）。\n  激活扩展时，我可以选择使用默认名称，这是我将如何引用我的模板或CDK应用程序中的类型，或者我可以输入新名称。选择的名称必须在我的帐户中是唯一的，因此如果我启用了具有其默认名称的扩展版本，并且希望启用不同的版本，我必须更改名称。一旦我填写了详细信息，并选择了我的版本控制策略（扩展使用语义版本控制，并且我可以选择接受次要版本的自动更新，或者将“锁定”到特定版本）单击“激活扩展”完成该过程。\n    完成第一个扩展的过程，我遵循AWSQS :: Kubernetes :: Helm扩展的相同步骤。导航到激活的扩展我可以查看所有已启用扩展名的列表。\n    我还有一组更新的权限。资源类型代表我的呼叫拨打Kubernetes API，所以我需要更新我的群集的AWS-Auth ConfigMap来引用我刚刚使用的执行角色，否则我正在使用的资源类型所做的调用将失败。为此，我在命令提示符下运行命令kubectl编辑cm aws-auth -n kube-system。在打开的文本编辑器中，我使用引用我的cfnregisty extension xeCrole的新组更新ConfigMap，如下所示（如果您在继续，请务必更改符合您的帐户ID和角色名称以匹配您的帐户ID和角色名称）。 \napierion：v1\r数据：\r Maproles：|\r  - 组：\r  - 系统：bootstrepers\r  - 系统：节点\r Rolearn：ARN：AWS：IAM :: 111122223333：角色/肌瘤术ksnoderole\r 用户名：系统：节点：{{ec2privatednsname}}\r  - 组：\r  - 系统：大师\r Rolearn：ARN：AWS：IAM :: 111122223333：角色/ CFNRegisty extensionSexcole\r 用户名：CFNResourcetypes.\r类：configmap.\r元数据：\r CreationTimestamp：＆＃34; 2021-06-04T20：44：24Z＆＃34;\r 名称：AWS-AUTH\r 命名空间：kube-system\r ResourceVersion：＆＃34; 6355＆＃34;\r selflink：/ api / v1 / namespaces / kube-system / configmaps / aws-auth\r UID：DC91BFA8-1663-45D0-8954-1E841913B324\n  现在我已经准备好使用扩展为新的命名空间，Helm和Kube-State-Metrics包配置我的群集。我创建了一个云形成模板，使用扩展，添加我想要在创建堆栈时指定的元素的参数：要更新的群集的名称以及命名空间名称。 KubeStateMetrics资源的属性引用了我希望Helm安装的包。\n  awstemplateFormatversion：＆＃34; 2010-09-09＆＃34;\r参数：\r clustername：\r 类型：字符串\r 命名空间：\r 类型：字符串\r资源：\r KubeStateMetrics：\r 类型：AWSQS :: Kubernetes :: Helm\r 特性：\r clusterid：！ref clustername\r 名称：Kube-State-Metrics\r 命名空间：！getatt kubenamespace.name\r 存储库：https://prometheus-community.github.io/helm-charts.\r 图表：Prometheus-Community / Kube-State-Metrics\r kubenamespace：\r 类型：AWSQS :: Kubernetes ::资源\r 特性：\r clustername：！ref clustername\r 命名空间：默认值\r 表明：！次|\r apierion：v1\r 类：命名空间\r 元数据：\r 名称：$ {命名空间}\r 标签：\r 名称：$ {命名空间}\n  在CloudFormation控制台的堆栈页面上，单击“创建堆栈”，上传我的模板，然后给我的堆栈名称和所声明参数的值。\n    我单击“下一步”继续到向导的其余部分，留下其默认值的其他设置，然后创建堆栈以完成进程。\n  一旦堆栈创建完成，我使用kubectl命令行工具验证我的更改。我首先检查新的命名空间，newsblog-sample-namespace，带有命令kubectl获取命名空间。然后，我运行kubectl获取全部 - 游戏记录博客-sample-namespace命令验证kube-nature-metrics包。\n    扩展也可以与AWS云开发套件一起使用。要包装使用新注册表的此探索，我将在用相同的扩展名称中包含一个下面的CDK应用程序片段，以便使用相同的扩展，作为我之前显示的YAML模板（我也可以写入这个使用CDK  -  C＃，Java或Python支持的任何语言）。 \n导入{堆栈，构造，cfnresource}从＆＃39; @ aws-cdk / core＆＃39 ;;\r导出类unostack扩展堆栈{\r 构造函数（范围：构造，ID：String）{\r 超级（范围，ID）;\r const clustername =＆＃39; newsblog-cluster＆＃39 ;;\r const命名空间=＆＃39; newsblog-sample-namespace＆＃39 ;;\r\r const kubenamespace = new cfnresource（这个，＆＃39; kubenamespace＆＃39; {\r 类型：＆＃39; awsqs :: kubernetes ::资源＆＃39 ;,\r 特性： {\r clustername：clustername，\r 命名空间：＆＃39;默认＆＃39;，\r 清单：this.tojsonstring（{\r apierion：＆＃39; v1＆＃39 ;,\r 种类：＆＃39;名称空间＆＃39 ;,\r 元数据：{\r 名称：命名空间，\r 标签： {\r 名称：命名空间，\r }\r }，\r }），\r }，\r }）;\r \r 新的cfnresource（这个，＆＃39; kubestatemetrics＆＃39;，{\r 类型：＆＃39; awsqs :: kubernetes :: helm＆＃39 ;,\r 特性： {\r clusterid：clustername，\r 名称：＆＃39; kube-nation-metrics＆＃39;，\r 命名空间：kubenamespace.getatt（＆＃39;姓名＆＃39;）。ToString（），\r 存储库：＆＃39; https：//prometheus-community.github.io/helm-charts&#39 ;,\r 图表：＆＃39; Prometheus-Community / Kube-State-Metrics＆＃39;，\r }，\r }）;\r }\r};\n  如前前面所述，我没有Kubernetes API和Kubernetes的经验。但是，通过在公共注册表中使用资源类型，与CloudFormation结合使用，我可以使用熟悉的环境轻松配置我的群集，而无需使用API​​或定制工具链。\n  开始使用CloudFormation的CloudFormation公共注册表定价与现有注册表和私有资源类型相同。使用本机AWS资源类型没有额外的费用;对于第三方资源类型，您将根据您每月运行的处理程序操作（添加，删除，列表等）的数量来引发费用。有关详细信息，请参阅AWS CloudFormation定价页面。今天在美国东部（俄勒冈州N.弗吉尼亚州，俄亥俄州），加拿大（中央），欧洲（爱尔兰，法兰克福，伦敦，斯德哥尔摩，巴黎，米兰），亚洲，新的公共登记处提供了新的公共登记处太平洋（香港，孟买，大阪，新加坡，悉尼，首尔，东京），南美（圣保罗），中东（巴林）和非洲（开普敦）AWS地区。\n  有关更多信息，请参阅AWS CloudFormation用户指南和扩展开发的用户指南，并开始发布或使用扩展！\n   - 史蒂夫 ", "note_en": "AWS CloudFormation and the  AWS Cloud Development Kit ( CDK) provide scalable and consistent provisioning of  AWS resources (for example, compute infrastructure, monitoring tools, databases, and more). We’ve heard from many customers that they’d like to benefit from the same consistency and scalability when provisioning resources from  AWS Partner Network (APN) members, third-party vendors, and open-source technologies, regardless of whether they are using  CloudFormation templates or have adopted the  CDK to define their cloud infrastructure.\n  I’m pleased to announce a new public registry for  CloudFormation, providing a searchable collection of extensions – resource types or modules – published by  AWS, APN partners, third parties, and the developer community. The registry makes it easy to discover and provision these extensions in your  CloudFormation templates and  CDK applications in the same manner you use  AWS-provided resources. Using extensions, you no longer need to create and maintain custom provisioning logic for resource types from third-party vendors. And, you are able to use a single infrastructure as code tool,  CloudFormation, to provision and manage  AWS and third-party resources, further simplifying the infrastructure provisioning process (the  CDK uses  CloudFormation under the hood).\n  Launch Partners  We’re excited to be joined by over a dozen APN Partners for the launch of the registry, with more than 35 extensions available for you to use today. Blog posts and announcements from the APN Partners who collaborated on this launch, along with  AWS Quick Starts, can be found below (some will be added in the next few days).\n    Registries and Resource Types  In 2019,  CloudFormation launched support for private registries. These enabled registration and use of resource providers ( Lambda functions) in your account, including providers from  AWS and third-party vendors. After you registered a provider you could use resource types, comprised of custom provisioning logic, from the provider in your  CloudFormation templates. Resource types were uploaded by providers to an  Amazon Simple Storage Service (Amazon S3) bucket, and you used the types by referencing the relevant  S3 URL. The public registry provides consistency in the sourcing of resource types and modules, and you no longer need to use a collection of  Amazon Simple Storage Service (Amazon S3) buckets.\n  Third-party resource types in the public registry also integrate with  drift detection. After creating a resource from a third-party resource type,  CloudFormation will detect changes to the resource from its template configuration, known as configuration drift, just as it would with  AWS resources. You can also use  AWS Config to manage compliance for third-party resources consumed from the registry. The resource types are automatically tracked as Configuration items when you have configured  AWS Config to record them, and used  CloudFormation to create, update, and delete them. Whether the resource types you use are third-party or  AWS resources, you can view configuration history for them, in addition to being able to write  AWS Config rules to verify configuration best practices.\n  The public registry also supports Type Configuration, enabling you to configure third-party resource types with API keys and OAuth tokens per account and region. Once set, the configuration is stored securely and can be updated. This also provides a centralized way to configure third-party resource types.\n  Publishing Extensions to the Public Registry  Extension publishers must be verified as  AWS Marketplace sellers, or as GitHub or BitBucket users, and extensions are validated against best practices. To publish extensions (resource types or modules) to the registry, you must first register in an  AWS Region, using one of the mentioned account types.\n  After you’ve registered, you next publish your extension to a private registry in the same Region. Then, you need to test that the extension meets publishing requirements. For a resource type extension, this means it must  pass all the contract tests defined for the type. Modules are subject to different requirements, and you can find more details  in the documentation. With testing complete, you can publish your extension to the public registry for your Region.   See the user guide for detailed information on publishing extensions.\n  Using Extensions in the Public Registry  I decided to try a couple of extensions related to Kubernetes, contributed by  AWS Quick Starts, to make configuration changes to a cluster. Personally, I don’t have a great deal of experience with Kubernetes and its API so this was a great chance to examine how extensions could save me significant time and effort. During the process of writing this post I learned from others that using the Kubernetes API (the usual way to achieve the changes I had in mind) would normally involve effort even for those with more experience.\n  For this example I needed a Kubernetes cluster, so I followed  this tutorial to set one up in  Amazon Elastic Kubernetes Service (EKS), using the  Managed nodes – Linux node type. With my cluster ready, I want to make two configuration changes.\n  First, I want to add a new namespace to the cluster. A namespace is a partitioning construct that lets me deploy the same set of resources to different namespaces in the same cluster without conflict thanks to the isolation namespaces provide. Second, I want to set up and use  Helm, a package manager for Kubernetes. I’ll use Helm to install the  kube-state-metrics package from the  Prometheus helm-charts repository for gathering cluster metrics. While I can use  CloudFormation to provision clusters and compute resources, previously, to perform these two configuration tasks, I’d have had to switch to the API or various bespoke tool chains. With the registry, and these two extensions, I can now do everything using  CloudFormation (and of course, as I mentioned earlier, I could also use the extensions with the  CDK, which I’ll show later).\n  Before using an extension, it needs to be activated in my account. While activation is easy to do for single accounts using the console, as we’ll see in a moment, if I were using  AWS Organizations and wanted to activate various third-party extensions across my entire organization, or for a specific organization unit (OU), I could achieve this using  Service-Managed StackSets in  CloudFormation. Using the resource type  AWS::CloudFormation::TypeActivation in a template submitted to a Service-Managed StackSet, I can target an entire  Organization, or a particular OU, passing the Amazon Resource Name (ARN) identifying the third-party extension to be activated. Activation of extensions is also very easy to achieve (whether using  AWS Organizations or not) using the  CDK with just a few lines of code, again making use of the aforementioned  TypeActivation resource type.\n  To activate the extensions, I head to the  CloudFormation console and click  Public extensions from the navigation bar. This takes me to the  Registry:Public extensions home page, where I switch to viewing third party resource type extensions.\n    The extensions I want are  AWSQS::Kubernetes::Resource and  AWSQS::Kubernetes::Helm. The  Resource extension is used to apply a manifest describing configuration changes to a cluster. In my case, the manifest requests a namespace be created. Clicking the name of the  AWSQS::Kubernetes::Resource extension takes me to a page where I can view schema, configuration details, and versions for the extension.\n    What happens if you deactivate an extension you’re using, or an extension is withdrawn by the publisher? If you deactivate an extension a stack depends on, any resources created from that extension won’t be affected, but you’ll be unable to perform further stack operations, such as Read, Update, Delete, and List (these will fail until the extension is re-activated). Publishers must request their extensions be withdrawn from the registry (there is no “delete” API). If the request is granted, customers who activated the extension prior to withdrawal can still perform Create/Read/Update/Delete/List operations, using what is effectively a snapshot of the extension in their account.\n  Clicking  Activate takes me to a page where I need to specify the ARN of an execution role that  CloudFormation will assume when it runs the code behind the extension. I create a role following this  user guide topic, but the basic trust relationship is below for reference.\n  {\r &#34;Version&#34;: &#34;2012-10-17&#34;,\r &#34;Statement&#34;: [\r {\r &#34;Effect&#34;: &#34;Allow&#34;,\r &#34;Principal&#34;: {\r &#34;Service&#34;: &#34;resources.cloudformation.amazonaws.com&#34;\r },\r &#34;Action&#34;: &#34;sts:AssumeRole&#34;\r }\r ]\r}\n  I also add permissions for the resource types I’m using to my execution role. Details on the permissions needed for the types I chose can be found on GitHub,  for Helm, and  for Kubernetes (note the GitHub examples include the trust relationship too).\n  When activating an extension, I can elect to use the default name, which is how I will refer to the type in my templates or  CDK applications, or I can enter a new name. The name chosen has to be unique within my account, so if I’ve enabled a version of an extension with its default name, and want to enable a different version, I must change the name. Once I’ve filled in the details, and chosen my versioning strategy (extensions use  semantic versioning, and I can elect to accept automatic updates for minor version changes, or to “lock” to a specific version) clicking  Activate extension completes the process.\n    That completes the process for the first extension, and I follow the same steps for the  AWSQS::Kubernetes::Helm extension. Navigating to  Activated extensions I can view a list of all my enabled extensions.\n    I have one more set of permissions to update. Resource types make calls to the Kubernetes API on my behalf so I need to update the  aws-auth ConfigMap for my cluster to reference the execution role I just used, otherwise the calls made by the resource types I’m using will fail. To do this, I run the command  kubectl edit cm aws-auth -n kube-system at a command prompt. In the text editor that opens, I update the ConfigMap with a new group referencing my  CfnRegistryExtensionExecRole, shown below (if you’re following along, be sure to change the account ID and role name to match yours).\n  apiVersion: v1\rdata:\r mapRoles: |\r - groups:\r - system:bootstrappers\r - system:nodes\r rolearn: arn:aws:iam::111122223333:role/myAmazonEKSNodeRole\r username: system:node:{{EC2PrivateDNSName}}\r - groups:\r - system:masters\r rolearn: arn:aws:iam::111122223333:role/CfnRegistryExtensionExecRole\r username: cfnresourcetypes\rkind: ConfigMap\rmetadata:\r creationTimestamp: &#34;2021-06-04T20:44:24Z&#34;\r name: aws-auth\r namespace: kube-system\r resourceVersion: &#34;6355&#34;\r selfLink: /api/v1/namespaces/kube-system/configmaps/aws-auth\r uid: dc91bfa8-1663-45d0-8954-1e841913b324\n  Now I’m ready to use the extensions to configure my cluster with a new namespace, Helm, and the kube-state-metrics package. I create a  CloudFormation template that uses the extensions, adding parameters for the elements I want to specify when creating a stack: the name of the cluster to update, and the namespace name. The properties for the  KubeStateMetrics resource reference the package I want Helm to install.\n  AWSTemplateFormatVersion: &#34;2010-09-09&#34;\rParameters:\r ClusterName:\r Type: String\r Namespace:\r Type: String\rResources:\r KubeStateMetrics:\r Type: AWSQS::Kubernetes::Helm\r Properties:\r ClusterID: !Ref ClusterName\r Name: kube-state-metrics\r Namespace: !GetAtt KubeNamespace.Name\r Repository: https://prometheus-community.github.io/helm-charts\r Chart: prometheus-community/kube-state-metrics\r KubeNamespace:\r Type: AWSQS::Kubernetes::Resource\r Properties:\r ClusterName: !Ref ClusterName\r Namespace: default\r Manifest: !Sub |\r apiVersion: v1\r kind: Namespace\r metadata:\r name: ${Namespace}\r labels:\r name: ${Namespace}\n  On the  Stacks page of the  CloudFormation console, I click  Create stack, upload my template, and then give my stack a name and the values for my declared parameters.\n    I click  Next to proceed through the rest of the wizard, leaving other settings at their default values, and then  Create stack to complete the process.\n  Once stack creation is complete, I verify my changes using the  kubectl command line tool. I first check that the new namespace,  newsblog-sample-namespace, is present with the command  kubectl get namespaces. I then run the  kubectl get all --namespace newsblog-sample-namespace command to verify the  kube-state-metrics package is installed.\n    Extensions can also be used with the  AWS Cloud Development Kit. To wrap up this exploration of using the new registry, I’ve included an example below of a  CDK application snippet in TypeScript that achieves the same effect, using the same extensions, as the YAML template I showed earlier (I could also have written this using any of the languages supported by the  CDK – C#, Java, or Python).\n  import {Stack, Construct, CfnResource} from &#39;@aws-cdk/core&#39;;\rexport class UnoStack extends Stack {\r constructor(scope: Construct, id: string) {\r super(scope, id);\r const clusterName = &#39;newsblog-cluster&#39;;\r const namespace = &#39;newsblog-sample-namespace&#39;;\r\r const kubeNamespace = new CfnResource(this, &#39;KubeNamespace&#39;, {\r type: &#39;AWSQS::Kubernetes::Resource&#39;,\r properties: {\r ClusterName: clusterName,\r Namespace: &#39;default&#39;,\r Manifest: this.toJsonString({\r apiVersion: &#39;v1&#39;,\r kind: &#39;Namespace&#39;,\r metadata: {\r name: namespace,\r labels: {\r name: namespace,\r }\r },\r }),\r },\r });\r \r new CfnResource(this, &#39;KubeStateMetrics&#39;, {\r type: &#39;AWSQS::Kubernetes::Helm&#39;,\r properties: {\r ClusterID: clusterName,\r Name: &#39;kube-state-metrics&#39;,\r Namespace: kubeNamespace.getAtt(&#39;Name&#39;).toString(),\r Repository: &#39;https://prometheus-community.github.io/helm-charts&#39;,\r Chart: &#39;prometheus-community/kube-state-metrics&#39;,\r },\r });\r }\r};\n  As mentioned earlier in this post, I don’t have much experience with the Kubernetes API, and Kubernetes in general. However, by making use of the resource types in the public registry, in conjunction with  CloudFormation, I was able to easily configure my cluster using a familiar environment, without needing to resort to the API or bespoke tool chains.\n  Get Started with the  CloudFormation Public Registry  Pricing for the public registry is the same as for the existing registry and private resource types. There is no additional charge for using native  AWS resource types; for third-party resource types you will incur charges based on the number of handler operations (add, delete, list, etc.) you run per month. For details, see the  AWS CloudFormation Pricing page. The new public registry is available today in the US East (N. Virginia, Ohio), US West (Oregon, N. California), Canada (Central), Europe (Ireland, Frankfurt, London, Stockholm, Paris, Milan), Asia Pacific (Hong Kong, Mumbai, Osaka, Singapore, Sydney, Seoul, Tokyo), South America (Sao Paulo), Middle East (Bahrain), and Africa (Cape Town)  AWS Regions.\n  For more information, see the  AWS CloudFormation User Guide and  User Guide for Extension Development, and start publishing or using extensions today!\n  — Steve", "posttime": "2021-06-22 11:41:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "aws,registry", "title": "AWS CloudFormation的公共注册表 ", "title_en": "A Public Registry for AWS CloudFormation", "transed": 1, "url": "https://aws.amazon.com/blogs/aws/introducing-a-public-registry-for-aws-cloudformation/", "via": "", "real_tags": ["aws", "registry"]}, {"category": "", "categoryclass": "", "imagename": "f61bb9e5b355e9a2fbb38beb1f11eafd.jpg", "infoid": 1067347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新西兰已将劳雷尔·哈伯德（Laurel Hubbard）命名为其女性＆＃39;在东京即将到来的奥运会上举重名单，让她成为第一个公开的跨性别运动员在游戏中竞争。\n  43岁的Hubbard将在87公斤的女性范畴中竞争，约为192磅。\n  ＆＃34;我很感激，谦卑地受到这么多新西兰人的善意和支持，＆＃34;哈伯德星期一在一份声明中说。 ＆＃34;当我三年前我在英联邦比赛中打破了我的手臂时，我被告知我的体育职业可能达到了最终。但是你的支持，你的鼓励，你的aroha [爱情]带着黑暗带来了我。＆＃34;\n  但她的选择并非没有争议。有些人认为，因为哈伯德经历了男性青春期，她将对她的竞争对手带来不公平的优势。\n    哈伯德遇到了国际奥林匹克委员会，对从男性过渡到女性的运动员的要求。这些要求规定了运动员必须宣布她的性别认同是女性，可以改变体育目的的状态至少四年。运动员＆＃39; S睾酮水平必须保持在10米米以下的纳米摩尔。\n    那些从女性到男性过渡的人有资格在没有限制的情况下在男性类别中竞争。\n     哈伯德八年前在35岁的时候转向女性。在她的过渡之前，哈伯德竞争了男性竞争，根据有关的媒体，在初级竞争中设定国家纪录。 \nSchuyler Bailar表示，哈伯德·斯·贝尔尔斯（Schuyler Bailar）在哈佛大学竞争四年的竞争4年来，Schuyler Bairar表示，博伊尔·贝尔尔斯表示为跨青年的重要信号。\n  ＆＃34;包含的力量，尤其是可见夹杂物的力量，可以是救命，＆＃34; Bailar说。 ＆＃34;我对我不知道，没有看到其他跨性别运动员，特别是其他人在游泳中，只特别是各地的跨越人，我没有想到我可以存在，我没有想到和＃39;我想可以在我的运动中自己。当我觉得我觉得我可以在我的运动中待自己，我觉得我可以在任何地方＆＃39;\n    最近在英国运动医学杂志上发表的一项研究发现，即使在激素治疗年份，跨妇女平均妇女的优势在Cisbender或Nontranscender女性身上。\n    Anna Vanbellinghen是一个可能会对哈伯德竞争的比利时举重者，在竞争中可能不会公平地参加哈伯德。\n  ＆＃34;首先，我想强调我完全支持跨性别社区，那是我和＃39; t来自这个运动员的拒绝的地方， ＆＃34; Vanbellinghen在比赛里面告诉奥运会新闻网站。\n  ＆＃34;我知道，为变量参与体育的法律框架非常困难，因为有无限种类的各种情况，并且从辩论的两边达到完全令人满意的解决方案，可能是不可能的。\n    ＆＃34;然而，任何在高层举重举重的人都知道这是在他们的骨骼中的真实：这种特殊情况对这项运动和运动员来说是不公平的。＆＃34; \n新西兰奥林匹克委员会首席执行官Kereyn Smith欢迎哈伯德到队伍，同时承认紧张局势。\n  ＆＃34;以及在世界上最好的活动，Laurel符合IWF资格标准，包括基于IOC协商委员会的IWF共识声明指南。我们承认运动中的性别认同是一种高度敏感和复杂的问题，需要在戏剧领域的人权和公平之间的平衡，＆＃34;史密斯在一份声明中说。\n      Freestyle Bmx Rider Chelsea Wolfe是美国女性的替代品＆＃39; S队。如果她前面的两个车手中的一个辍学，她将成为美国团队第一个公开的跨跨界成员。上个月的网站出口报告说，至少有九个跨越或非必载运动员在奥运会和残奥会上争夺斑点。\n  前哈佛大学游泳运动员Bairar指出，在体育运动中对跨妇女的辩论常常有关公平和生物优势的问题。\n  ＆＃34;这里的事情：体育基于生物学差异，＃34;他说。 ＆＃34;当我们有像迈克尔菲尔普斯这样的运动员，谁是高大的 - 他为游泳建造了。他有一半的乳酸水平，平均运动员产生，没有人称之为不公平。＆＃34;\n  ＆＃34;当女性有生物学差异时，他们被称为不公平，而不是男人所做的，他们只是被称为优越的运动员，＆＃34; Bailar说。 ＆＃34;现实是，CIS女性甚至在体育中展出了大量差异。而且它不是不公平的。 ＆＃39;彼此的差异。＆＃34;\n  在2017年对新西兰新闻网站的采访中，Hubbard指出，她根据国际奥林匹克委员会于2003年建立的规则竞争，以允许变性运动员参加竞争。 \n＆＃34;这是一个新的东西。 也许这是因为它像我这样的人来说，这是一个如此渴望通过表明人们建议的一些问题＆＃39; t也许他们看起来可能看起来那么多的问题，而且＃34; 哈伯德说。 ", "note_en": "New Zealand has named Laurel Hubbard to its women&#39;s weightlifting roster for the upcoming Olympics in Tokyo, making her the first openly transgender athlete to compete in the games.\n  Hubbard, 43, will compete in the category for women over 87 kg, about 192 pounds.\n  &#34;I am grateful and humbled by the kindness and support that has been given to me by so many New Zealanders,&#34; Hubbard said in a  statement on Monday. &#34;When I broke my arm at the Commonwealth Games three years ago, I was advised that my sporting career had likely reached its end. But your support, your encouragement, and your aroha [love] carried me through the darkness.&#34;\n  But her selection is not without controversy. Some argue that because Hubbard went through male puberty, she will have an unfair advantage over her competitors.\n    Hubbard has met the International Olympic Committee&#39;s  requirements for athletes who transition from male to female. The requirements stipulate that the athlete must declare that her gender identity is female and can&#39;t change that status for sports purposes for at least four years. The athlete&#39;s testosterone level must stay below 10 nanomoles per liter.\n    Those who transition from female to male are eligible to compete in the male category without restriction.\n     Hubbard transitioned to female eight years ago at age 35. Before her transition, Hubbard competed in men&#39;s events, setting national records in junior competition, according to The Associated Press.\n  Hubbard&#39;s inclusion will be a vital signal for trans youth, says  Schuyler Bailar, a trans man who competed in Division I men&#39;s swimming for four years at Harvard University.\n  &#34;The power of inclusion, especially the power of visible inclusion, can be lifesaving,&#34; Bailar says. &#34;I know for me, not seeing other transgender athletes out there, especially other folks in swimming and just specifically trans people everywhere, I didn&#39;t think that I could exist, and I didn&#39;t think I could be myself in my sport. And when I felt like I couldn&#39;t be myself in my sport, I felt like I couldn&#39;t be myself anywhere.&#34;\n    A recent  study published in the  British Journal of Sports Medicine  found that even after a year of hormone therapy, trans women on average had an advantage over cisgender, or nontransgender, women.\n    Anna Vanbellinghen, a Belgian weightlifter who is likely to compete against Hubbard, said in May that Hubbard&#39;s presence in the competition would not be fair.\n  &#34;First off, I would like to stress that I fully support the transgender community and that what I&#39;m about to say doesn&#39;t come from a place of rejection of this athlete&#39;s identity,&#34; Vanbellinghen  told Olympics news site Inside the Games.\n  &#34;I am aware that defining a legal frame for transgender participation in sports is very difficult since there is an infinite variety of situations and that reaching an entirely satisfactory solution, from either side of the debate, is probably impossible.\n    &#34;However, anyone that has trained weightlifting at a high level knows this to be true in their bones: This particular situation is unfair to the sport and to the athletes.&#34;\n     New Zealand Olympic Committee CEO Kereyn Smith welcomed Hubbard to the contingent, while acknowledging the tensions.\n  &#34;As well as being among the world&#39;s best for her event, Laurel has met the IWF eligibility criteria including those based on IOC Consensus Statement guidelines for transgender athletes. We acknowledge that gender identity in sport is a highly sensitive and complex issue requiring a balance between human rights and fairness on the field of play,&#34; Smith said in a statement.\n      Chelsea Wolfe, a freestyle BMX rider, is an alternate for the U.S. women&#39;s squad. If one of the two riders ahead of her dropped out, she would be the first openly trans member of Team USA. The website Outsports  reported last month that there were at least nine trans or nonbinary athletes vying for spots on Olympic and Paralympic teams.\n  Bailar, the former Harvard swimmer, notes that the debate over trans women in sports often centers on questions of fairness and biological advantages.\n  &#34;Here&#39;s the thing: Sports are based on biological differences,&#34; he says. &#34;When we have athletes like Michael Phelps, who is tall — he&#39;s built for swimming. He has half the levels of lactic acid the average athlete produces, and nobody calls that unfair.&#34;\n  &#34;When women have biological differences, they are called unfair as opposed to when men do, they are just called superior athletes,&#34; Bailar says. &#34;The reality is that cis women even exhibit plenty of differences within sports. And that&#39;s not unfair. That&#39;s just differences in bodies.&#34;\n  In a  2017 interview with New Zealand news site Stuff, Hubbard noted that she competes under rules established by the International Olympic Committee in 2003 to allow transgender athletes to compete.\n  &#34;This isn&#39;t a new thing. Perhaps the fact that it has taken so long for someone like myself to come through indicates that perhaps some of the problems that people are suggesting aren&#39;t perhaps what they might seem,&#34; Hubbard said.", "posttime": "2021-06-22 11:41:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "举重,weightlifter,运动员", "title": "新西兰举重者将是奥运会的第一个公开的反式竞争对手 ", "title_en": "New Zealand Weightlifter Will Be the First Openly Trans Competitor at Olympics", "transed": 1, "url": "https://www.npr.org/2021/06/21/1008711240/new-zealand-weightlifter-will-be-the-first-openly-trans-competitor-at-the-olympi", "via": "", "real_tags": ["举重", "运动员"]}, {"category": "", "categoryclass": "", "imagename": "0c5a322b1b4f91bdcca3ff5e7dfcb147.jpg", "infoid": 1067346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州支付居民＆＃39;在Covid-19大流行期间累计的过去的适当租金，租房者是一个干净的石板，最近宣布宣布。\n Jason Elliott，Jason Elliott，Jason Elliott报告称，国会批准的援助包的国家和52亿美元的资金来自国会批准的援助计划的资金足以支付逾期租金。然而，据加州议会住房和社区发展报告称，迄今为止，迄今为止仅介绍了4.9亿美元的租赁援助要求3200万美元。\n ＆＃34;我们应该尽力回到2019年12月的出发点。除此之外的东西是利用危机，＆＃34;索诺玛县的物业经理Keith Becker说。他透露，14名租户没有支付价值100,000美元的租金。\n   Newsom表示加利福尼亚州将偿还全国累计的所有过去的租金，而且由于冠状病毒大流行，有希望使房东完整的堕落。\n 左侧不稳定是加利福尼亚州是否会继续禁止禁止宣传租金，以便在6月30日以后的缺乏租金，这是一个临时的大流行相关的秩序，但却证明难以撤消。\n 联邦驱逐保护也设定为6月30日到期。加利福尼亚州通过了自己的保护，这些保护适用于更多人而不是联邦保护。\n 新闻和州立法领导人私下会面，就保护国家，部分谈判，以及大约260亿美元的经营预算。驱逐禁令的延伸似乎可能会让加利福尼亚更多的时间花费所有的钱来涵盖未付租金。但房东和租户＆＃39;权利团体正在争论扩展应该持续多久。 \n＆＃34;人们对人们的期望和＃39;他们准备在7月1日支付租金是全心全意的，＆＃34;这是一位43岁的单身母亲说Kelli Lloyd，他说，自于大流行于2020年3月开始始于大流行以来，她没有始终奏效。\n Lloyd  - 社区赋权的加州加利福尼亚州的宣传团体联盟的成员 - 应该为一间两卧室，两间卫生地租用公寓在南洛杉矶的Crenshaw区支付1,924美元。但她说她＆＃39;在去年大部分时间不工作后，她的两个孩子在日托中心关心她的两个孩子后，学校停止了人们的学习。\n 政府可能会涵盖该债务。但劳埃德说，她最近在房地产经纪人失去了一份工作，尚未找到另一个。她＆＃39;如果保护到期，她可以被驱逐出众。\n ＆＃34;只是因为国家已经打开了备份并在＆＃39; t的意思是人们可以获得他们的工作，＆＃34;她说。\n Becker表示，逾期租金支付对业主对业主进行财政压力，他说的是＆＃34;辞职。＆＃34;\n 但他们已经疲惫地疲惫不堪，他指出的是旨在解决公共卫生紧急情况，并不意味着永久性。\n 分发52亿美元的国家一直很慢，它不太可能在6月30日之前将其花费它。加利福尼亚州的住房和社区发展报告并未包括12个城市和10个运行的县自己的租赁援助计划。 \n＆＃34;它的挑战在一夜之间建立一个新的，大的程序，＆＃34;萨姆斯曼大卫邱说，来自旧金山的民主党和大会房屋和社区发展委员会主席。 ＆＃34;教育数百万努力的租户和房东有挑战性。＆＃34;\n 房东指向国家的快速经济复苏，作为不延长驱逐史拉米提的原因。加利福尼亚自2月以来增加了495,000项新工作岗位。仅在4月份，加利福尼亚占美国新就业的38％。新闻报道，向企业提出了所有限制，将其括起来作为国家＆＃39;他重新开放。\n ＆＃34;我们恢复正常，＆＃34;卡尔顿说。 ＆＃34;它＆＃39;是时候回去工作了。它＆＃39;时间支付租金。＆＃34;\n 虽然中期和高工资工作的就业超过大流行水平，但由于哈佛大学的经济追踪者，自2020年1月20日，赚取不到27,000美元的人数低于27,000美元的就业率下降了38％以上。\n ＆＃34;股票市场可能很好，我们可能会在技术上重新开放，但低工资工作的人 - 这是不成比例的颜色人 - 尚未返回，＆＃34; Madeline霍华德表示，西方法律和贫困的高级律师。\n 一些住房倡导者要求国家保持驱逐禁令，直到低工资工人的失业率降至大流行水平。它类似于国家官员如何对Covid-19感染率更高的企业施加限制，而感染率较低的人可以更快地重新开放。\n 倡导者说，当Network本月早些时候在本月早些时候告知Univision时，他们受到了鼓励，他＆＃34;明确地＆＃34;希望在6月30日之后扩展驱逐保护。 \n＆＃34;我们＆＃39;重复持爽乐观，＆＃34; 弗朗西斯科·杜纳斯表示，现在加利福尼亚州的住房执行董事。 ＆＃34;我们肯定需要这些保护作为我们恢复的一部分。＆＃34; ", "note_en": "California is paying off residents&#39; past due rent that was accrued during the COVID-19 pandemic, giving renters a clean slate, Gov.  Gavin Newsom announced recently.\n The state&#39;s $5.2 billion in funds from Congressionally-approved aid packages is enough to pay off overdue rent, according to Newsom&#39;s senior counselor on housing and homelessness, Jason Elliott, the Associated Press reported. However, just $32 million out of $490 million in requests for rental assistance through May 31 have been covered so far, according to a California Department Housing and Community Development report.\n &#34;We should do our best to get back to the starting point where we were in December of 2019. Anything other than that is taking advantage of a crisis,&#34; said Keith Becker, a property manager in Sonoma County. He revealed that 14 tenants have not paid $100,000 worth of rent.\n   Newsom says California will pay off all past-due rent accumulated in the nation&#39;s most populated state because of the fallout from the coronavirus pandemic, promising to make landlords whole.\n Left unsettled is whether California will continue to ban evictions for unpaid rent beyond June 30, a pandemic-related order that was meant to be temporary but is proving difficult to undo.\n Federal eviction protections also are set to expire on June 30. California had passed its own protections that applied to more people than the federal protections.\n Newsom and state legislative leaders are meeting privately regarding the protections, part of the negotiations over the state&#39;s roughly $260 billion operating budget. An extension of the eviction ban seems likely to give California more time to spend all the money to cover unpaid rent. But landlords and tenants&#39; rights groups are arguing over how long that extension should last.\n &#34;The expectation for people to be up and at &#39;em and ready to pay rent on July 1 is wholeheartedly unfair,&#34; said Kelli Lloyd, a 43-year-old single mother who says she has not worked consistently since the pandemic began in March 2020.\n Lloyd — a member of the advocacy group Alliance of Californians for Community Empowerment — is supposed to pay $1,924 a month for a two-bedroom, two-bathroom rent-controlled apartment in the Crenshaw district of south Los Angeles. But she says she&#39;s $30,000 behind after not working for most of the last year to care for her two children as daycare centers closed and schools halted in-person learning.\n That debt will likely be covered by the government. But Lloyd said she recently lost a job at a real estate brokerage and hasn&#39;t found another one yet. She&#39;s worried she could be evicted if the protections expire.\n &#34;Simply because the state has opened back up doesn&#39;t mean people have access to their jobs,&#34; she said.\n Becker says the overdue rent payments put financial pressure on the owners, who he says have &#34;resigned themselves to it.&#34;\n But they have grown weary of the seemingly endless protections, which he noted were aimed at addressing a public health emergency and not meant to be permanent.\n The state has been slow to distribute the $5.2 billion, and it&#39;s unlikely it can spend it all by June 30. The California Department Housing and Community Development report doesn&#39;t include the 12 cities and 10 counties that run their own rental assistance programs.\n &#34;It&#39;s challenging to set up a new, big program overnight,&#34; said Assemblyman David Chiu, a Democrat from San Francisco and chair of the Assembly Housing and Community Development Committee. &#34;It has been challenging to educate millions of struggling tenants and landlords on what the law is.&#34;\n Landlords point to the state&#39;s rapid economic recovery as a reason not to extend the eviction moratorium much longer. California has added 495,000 new jobs since February. In April alone, California accounted for 38% of all new jobs in the U.S. This week, Newsom lifted all restrictions on businesses, heralding it as the state&#39;s grand reopening.\n &#34;We&#39;re getting back to normal,&#34; Carlton said. &#34;It&#39;s time to go back to work. It&#39;s time to pay the rent.&#34;\n While employment among middle- and high-wage jobs has exceeded pre-pandemic levels, employment rates for people earning less than $27,000 a year are down more than 38 percent since January 2020, according to Opportunity Insights, an economic tracker based at Harvard University.\n &#34;The stock market may be fine, we may be technically reopened, but people in low-wage jobs — which are disproportionately people of color — are not back yet,&#34; said Madeline Howard, senior attorney for the Western Center on Law and Poverty.\n Some housing advocates are asking the state to keep the eviction ban in place until the unemployment rate among low-wage workers has dropped to pre-pandemic levels. It&#39;s similar to how state officials would impose restrictions on businesses in counties where COVID-19 infection rates were higher while those with lower infection rates could reopen more quickly.\n Advocates say they were encouraged when Newsom told Univision earlier this month that he &#34;definitively&#34; wants to extend the eviction protections beyond June 30.\n &#34;We&#39;re cautiously optimistic,&#34; said Francisco Duenas, executive director of Housing Now California. &#34;We definitely need these protections as part of our recovery.&#34;", "posttime": "2021-06-22 11:40:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "偿还,pay,保护", "title": "CA偿还在Covid期间累计的所有过去的租金，给租房者清洁石板 ", "title_en": "CA to Pay Off All Past Due Rent Accrued During Covid, Giving Renters Clean Slate", "transed": 1, "url": "https://www.newsweek.com/california-pay-off-all-past-due-rent-accrued-during-covid-giving-renters-clean-slate-1602556", "via": "", "real_tags": ["偿还", "pay", "保护"]}, {"category": "", "categoryclass": "", "imagename": "2cb3186b167af4fa0d7508de110c50b3.png", "infoid": 1067345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在短期的CCTV视频中，可以看到一家小型便利店的职员，从冷却器中喝一瓶咖啡并喝它。当他返回收银机时，一个看不见的人的声音从天花板上的扬声器发出，并询问他是否扫描并支付该项目。\n    在另一个视频中，收银员站在柜台后面与刚刚出境的人交谈。有一个＆＃39; ding＆＃39;声音，从上面提问的声音关于另一个人是谁 - 他在那里给了收银员在他的转移结束时骑行 - 然后命令男人站在柜台的另一边。\n  这款视频只是华盛顿的直播眼监控用来展示其旗舰产品的一些例子：一个监控摄像头系统，使持续观看商店，让遥控器的人力操作员在看到他们认为可疑的东西时进行干预。对于足够的钱 - 每月399美元根据一个销售电子邮件主板查看 - 印度喀喇昆中的一个人将观看来自您的业务的视频源24/7。根据公司的职位挂钩，监测监测器“作为网站的虚拟主管，以确保位于海外的员工的安全性并要求他们完成分配的任务”。\n  Live Eye是在大流行期间越来越多的工作场所监测工具中获益的众多公司之一，该人权专家表示公司已经利用以安全的名义引入广泛的间谍工具。\n   “我们正在利用关于抢劫风险的不安全，作为目标工人的借口，”隐私国际的高级研究员Eva Blum-Dumontet告诉主板。 “这真的是重建我们如何工作的借口。基本上，在工作场所监督发生的是雇主试图跟踪他们的员工，以确保他们与他们的生产力概念相匹配。这对员工的心理健康非常有毒。“\n      本公司在其网站上，索赔若干主要公司作为客户，其中包括7-Eleven，Shell，乳制品Queen和Holiday Inn。这些企业中的许多企业都是特许经营的，而且没有明确的眼睛材料，无论公司是否购买了监测系统，或者如果他们被单独的特许经营业主购买。\n  一个前7-Eleven Field Consultant，他监督了多家商店告诉主板，当商店所有者向他们展示了Live Eye Surveillance的促销视频时，他担心。被要求匿名保护他们的联系的顾问仍然与本公司保持匿名，他表示，监控系统是一个“寻找问题的解决方案”，因为员工盗窃和入店行窃实际上是7-Eleven特许经营业主。 \n更糟糕的是，前外地顾问表示，特定形式的监视活眼睛销售实际上可以将商店工人置于危险之中。\n  在其中一个样本视频中，活眼睛发送潜在客户，两个携带突击步枪的两个黑人劫匪，遇到了一个7英寸的商店，并强迫柜台后面的职员。由于职员开始打开收银机，Live Eye System Dings和语音通知强盗警察被称为警察。他们用完了商店。\n  “这就是某人会被杀的方式，”前实地顾问说。 “你没有用突击步枪震惊某人。这违反了7  - 十一的政策。有一个原因是沉默的警报是沉默的“在银行和其他企业。\n  7-Eleven没有回应主板关于它是否冷却使用活眼睛系统的问题。该公司确实提供了一份声明，称：“7-Eleven，Inc。深入了解我们的员工和客户的安全。我们提供每71英寸的商店，其中包含包括CCTV和警报的基本安全系统，但是，独立的特许经营业主可以在提供的内容上安装自己的系统。＆＃34;\n  Blum-Dumontet表示，大流行推动了蓝色和白领的工作场所监控工具的蔓延，但它对低薪员工产生了不成比例的影响。\n  “有很多人失去了工作，很多人没有太多选择是否接受工作，”她说。 “这就是为什么雇主正在逃避选择这些形式的监视，这对员工进行了真正的收费。” ", "note_en": "In a  short CCTV video, a clerk at a small convenience store can be seen taking a bottle of coffee from a cooler and drinking it. When he returns to the cash register, an unseen person&#39;s voice emits from a speaker on the ceiling and interrogates him about whether he scanned and paid for the item.\n    In another  video, a cashier is standing behind the counter talking to someone just out of frame. There’s a &#39;ding&#39; sound, and the voice from above questions the cashier about who the other man is—he’s there to give the cashier a ride at the end of his shift—then orders the man to stand on the other side of the counter.\n  The videos are just a few examples that Washington-based Live Eye Surveillance uses to demonstrate its flagship product: a surveillance camera system that keeps constant watch over shops and lets a remote human operator intervene whenever they see something they deem suspicious. For enough money—$399 per month according to one sales email Motherboard viewed—a person in Karnal, India will watch the video feed from your business 24/7. The monitors “act as a virtual supervisor for the sites, in terms of assuring the safety of the employees located overseas and requesting them to complete assigned tasks,” according to a  job posting on the company&#39;s website.\n  Live Eye is one of many companies profiting from the  increasing adoption of workplace surveillance tools during the pandemic, which human rights experts say corporations have exploited to introduce a wide array of spy tools in the name of safety.\n   “We’re using insecurity about the risk of robbery as an excuse to target workers,” Eva Blum-Dumontet, a senior researcher at Privacy International, told Motherboard. “This is really an excuse to reframe how we’re working. Essentially what’s happening with workplace surveillance is employers trying to keep track of their employees to make sure they match their idea of productivity. This is very toxic for the mental health of employees.”\n      On its website, the company claims several major corporations as customers, including 7-Eleven, Shell, Dairy Queen, and Holiday Inn. Many of those businesses are franchised, and it isn’t clear from Live Eye’s materials whether the corporations have purchased the surveillance systems or if they’ve been bought by individual franchise owners.\n  A former 7-Eleven field consultant who oversaw multiple stores told Motherboard he was concerned when a store owner showed them Live Eye Surveillance’s promotional videos. The consultant, who asked to remain anonymous to protect their contacts still with the company, said that the surveillance system is a “solution in search of a problem,” because employee theft and shoplifting actually cost 7-Eleven franchise owners very little.\n  Even worse, the former field consultant said, the particular form of surveillance Live Eye is selling could actually be putting store workers in danger.\n  In  one of the sample videos Live Eye sends potential customers, two black-clad robbers, one carrying an assault rifle, run into what appears to be a 7-Eleven store and force the clerk behind the counter. As the clerk starts to open the cash register, the Live Eye system dings and a voice informs the robbers that the police have been called. They run out of the store.\n  “That’s how someone is going to get killed,” the former field consultant said. “You don’t startle someone with an assault rifle. That violates 7-Eleven policy. There’s a reason why the silent alarm is silent” at banks and other businesses.\n  7-Eleven did not respond to Motherboard’s questions about whether it condones the use of Live Eye’s systems. The company did provide a statement saying: “7-Eleven, Inc. cares deeply about the safety of our associates and customers. We provide every 7-Eleven store with a base security system that includes CCTV and alarms, however, independent franchise owners can install their own system on top of what is provided.&#34;\n  The pandemic has driven the spread of workplace surveillance tools for both blue and white collar workers, Blum-Dumontet said, but it has a disproportionate impact on low-paid employees.\n  “There are a lot of people who have lost their jobs, a lot of people who don’t have much choice whether to accept a job or not,” she said. “This is why employers are getting away with opting for these forms of surveillance that take a real toll on employees.”", "posttime": "2021-06-22 11:40:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "劫匪,company,员工", "title": "一家央视公司正在印度支付偏远工人，以武装劫匪大喊大叫 ", "title_en": "A CCTV Company Is Paying Remote Workers in India to Yell at Armed Robbers", "transed": 1, "url": "https://www.vice.com/en/article/4avnnn/a-cctv-company-is-paying-remote-workers-in-india-to-yell-at-armed-robbers", "via": "", "real_tags": ["劫匪", "company", "员工"]}, {"category": "", "categoryclass": "", "imagename": "bd14cb110cf7a57c4a1864884e578c4e.png", "infoid": 1067344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在大自然的阿森纳的自然危害中，龙卷风是最恶毒的一些。但是，虽然在建筑设计中定期考虑其他危险，但龙卷风在美国大多数结构的一部分方程之一，即使在高度龙卷风的地区。现在，即将到来的批判性建筑标准版本提供了一定需要的关注。\n 美国土木工程师协会（ASCE）发布了2022年版ASCE 7的草案，以便在12月的最终出版物之前发布公众反馈。该建筑标准有助于工程师确定其建筑物应该能够承受的负载（或力），无论是来自飓风，地震，洪水还是雪。凭借新版，由于国家标准与技术研究所（NIST）的研究，龙卷风可能很快就会加入该清单。\n 新版的草稿具有一类龙卷风危险地图，意图指导根据其尺寸和地理位置的基于其尺寸和地理位置的关键设施设计，例如学校，消防站和医院。\n “如果标准最终被采用到建筑规则中，它将为龙卷风提供一些急需的基本保护，从而减少赔偿和尤其是在美国中部和东南部的恢复，”椅子的NIST研究结构工程师Marc Levitan说任务委员会开发出ASCE 7新的Tornado负载章节。\n 龙卷风每年比地震和飓风相结合的更多死亡。和流行的龙卷风的风暴超越了飓风和热带风暴的集体年度被保险人数。但是，禁止龙卷风庇护所和核电站，建筑设计历史上没有占龙卷风。龙卷风的非凡力量和常见的看法，即被击中的风险很低，已经融入了一种误解，以便在建筑设计中寻求龙卷风将是太昂贵的。\n 这种心态开始于2011年开始转移，当时打破龙卷风季节在美国NIST上肆虐的伤害彻底调查了那个年度最糟糕的事件之一，龙卷风被评为最严重的富士群岛（EF）规模 -  EF5  - 通过密苏里州的乔普林撕裂。在龙卷风醒来的超过8,000个建筑物中，是学校，大型店铺，养老院，消防站和主要医院，最终被拆除。\n 由Levitan领导的NIST团队发现，尽管最强大的风浪费在龙卷风中心附近的建筑物，但超过70％的总伤害路径源于较低的风速。为那种风程度设计更具经济可行性。 \n“建筑规范和标准不需要设计最飓风和地震。利维坦说，我们需要为更适中和更常见的龙卷风设计速度应用同样的哲学。“\n asce 7已经包含飓风和其他风暴的危险地图，这些风暴规定了在全国各地的不同地区的建筑物设计中被考虑的风速。工程师使用这些地图来识别他们的建筑物可能会遇到的强风，然后使用标准的其他部分，计算风将适用于其建筑物的元素的压力，包括其框架，墙壁和屋顶。\n NIST研究人员，与Apply Research Associates Inc.一起使用的工程师，寻求建立类似的龙卷风过程。但首先，他们必须获得有关在地点以及扭曲者发生的大量信息以及他们的风力推动和拉动建筑部件的大量信息。\n 在其他努力中，研究人员在60多年的龙卷风记录中分析和填补了差距，研究了微型建筑如何在实验室中的小规模涡旋和进行广泛的基于计算机的结构建模。通过分析乔普林和其他龙卷风的伤害，他们能够通过现实世界的数据备份模型的性能。然后他们用他们的调查结果开发了龙卷风危险地图和方法，以帮助工程师确定他们的结构需要抵抗的力量。\n 现在出现在ASCE 7草案中，该指南仅适用于该国龙卷风地区的建筑物，距离落矶山脉以东，并且仅适用于被定义为风险类别III或IV的建筑物。 Asce描述了III类中的结构，因为如果失败，那些可能代表对人类生活的大量危害。第四类包括基本设施。\n 对于风险类别III型建筑，包括学校和其他高占用结构，该标准要求工程师使用带有风速的地图，该地图在50年内至少有一次超过3％的机会 - 这是服务生活的共同目标建筑设计。对于重要的IV类建筑，如医院或消防站，那种耐受性收紧了1.7％。该标准还提供了额外的地图，对于旨在设计超过最低要求的竞技建筑物的社区甚至更高的风速。\n 地图也用于构建大小。他们的龙卷风速度根据结构足迹的区域而变化，反映了结构越大的事实，龙卷风的可能性越大。 \n一旦2022年版ASCE 7最终确定了这一12月，龙卷风地区，其中许多可能已经被暴力扭曲者酗酒，将有指导设计新建筑物，以更好地天气下一个攻击。 如果模型建筑规范（由独立守则和标准组织维护）采用标准，那么这些代码纳入美国州和地方建筑物代码，则新实践将变得普遍，从大自然最恶毒的一个储蓄和财产拯救生命和财产 威胁。  标准草案可用于从ASCE网站下载（需要免费注册）。 个人和组织可以通过ASCE的公众意见系统提供关于标准的反馈，直到2021年7月31日。 ", "note_en": "Of the natural hazards in Mother Nature’s arsenal, tornadoes are some of the most vicious. But while other hazards are regularly considered in building designs, tornadoes have not been part of the equation for most structures in the United States, even in highly tornado-prone regions. Now, an upcoming edition of a critical building standard gives tornadoes some much needed attention.\n The American Society of Civil Engineers (ASCE) has released a draft version of the 2022 edition of ASCE 7 for public feedback ahead of its final publication in December. This  building standard helps engineers determine the loads (or forces) their building should be able to withstand, whether from a hurricane, earthquake, flood or snow. With the new edition, tornadoes may soon join that list, thanks to research spearheaded by the National Institute of Standards and Technology (NIST).\n The draft of the new edition features first-of-a-kind tornado hazard maps meant to guide the design of critical facilities, such as schools, fire stations and hospitals, based on their size and geographic location.\n “If the standard is ultimately adopted into the building code, it will provide some much-needed basic protection against tornadoes, reducing damages and accelerating recovery especially in the central and southeastern U.S.,” said NIST research structural engineer Marc Levitan, who chairs the ASCE task committee that developed ASCE 7’s new tornado load chapter.\n Tornadoes cause  more deaths per year than earthquakes and hurricanes combined. And storms spawning tornadoes surpass the collective  annual insured losses of hurricanes and tropical storms. But, barring tornado shelters and nuclear power plants, building designs have historically not accounted for tornadoes. The extraordinary strength of tornadoes and a common perception that the risk of being struck by one is low have fed into a misconception that addressing tornadoes in building designs would be far too costly.\n That mindset started to shift in 2011, when a  record-breaking tornado season wreaked havoc across the U.S. NIST  thoroughly investigated one of the worst events that year, a tornado rated as the most severe on the Enhanced Fujita (EF) Scale — an EF5 — that ripped through Joplin, Missouri. Among the more than 8,000 buildings damaged in the tornado’s wake were schools, big-box stores, nursing homes, fire stations and a major hospital, which was eventually demolished.\n The NIST team, led by Levitan, found that although the most powerful winds laid waste to buildings near the tornado center, more than 70% of the total damage path stemmed from lower wind speeds farther out. And designing for that level of wind is much more economically viable.\n “Building codes and standards don’t require design for the worst possible hurricanes and earthquakes. We need to apply that same philosophy to tornadoes and design for the more modest and more common tornado design speeds,” said Levitan.\n ASCE 7 already contains hazard maps for hurricanes and other windstorms that prescribe wind speeds to be considered in the design of buildings in different areas throughout the country. Engineers use these maps to identify strong winds their building might encounter and then, using other sections of the standard, calculate how much pressure that wind will apply to elements of their building, including its frame, walls and roof.\n NIST researchers, working with engineers from Applied Research Associates Inc., sought to establish a similar process for tornadoes. But first they had to obtain a great deal of information about where and how often twisters occur and how much their winds push and pull on building components.\n The researchers, among other efforts, analyzed and filled in gaps in more than 60 years of tornado records, studied how miniature buildings responded to small-scale vortexes in the lab and performed extensive computer-based structural modeling. And by analyzing damage from Joplin and other tornadoes they were able to back up the performance of their models with real-world data. Then they used their findings to develop tornado hazard maps and methods to help engineers determine what forces their structure would need to stand up against.\n The guidance, which now appears in the draft version of ASCE 7, is only required for buildings located in the tornado-prone region of the country, east of the Rocky Mountains, and only for buildings defined as risk categories III or IV. ASCE describes structures in category III as being those that could represent a substantial hazard to human life if they fail. Category IV includes essential facilities.\n For risk category III buildings, which include schools and other high-occupancy structures, the standard requires engineers to use maps with wind speeds that have about a 3% chance of being surpassed at least once in 50 years — a common target for service life in building design   . That tolerance tightens to 1.7% for vital category IV buildings, such as hospitals or fire stations. The standard also provides additional maps with even higher wind speeds for communities aiming to design sturdier buildings that exceed the minimum requirements.\n The maps account for building size too. Their tornado wind speeds change depending on the area of a structure’s footprint, reflecting the fact that the larger the structure is, the more likely it is to be struck by tornadoes.\n Once the 2022 edition of ASCE 7 is finalized this December, tornado-prone regions, many of which may have been brutalized by violent twisters in the past, will have the guidance to design new buildings to better weather the next assault. And if the standard is adopted by the model building codes (maintained by independent codes and standards organizations) and those codes are incorporated into U.S. state and local buildings codes, the new practices will become widespread, saving lives and property from one of nature’s most vicious threats.\n The  draft standard is available for download from the ASCE website (free registration required). Individuals and organizations can  provide feedback on the standard through ASCE’s public comment system until July 31, 2021.", "posttime": "2021-06-22 11:40:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建筑,building,龙卷风", "title": "主要的新建筑标准可以首次映射龙卷风威胁 ", "title_en": "Major New Building Standard Can Map Out Tornado Threat for the First Time", "transed": 1, "url": "https://www.nist.gov/news-events/news/2021/06/major-new-building-standard-can-map-out-tornado-threat-first-time", "via": "", "real_tags": ["建筑", "building", "龙卷风"]}]