[{"category": "", "categoryclass": "", "imagename": "03718a419f780e09f26f836ea56eb81f.jpg", "infoid": 1002945, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "electrek了解到，特斯拉已经悄悄地制造了Model 3，可能还有Model Y，为双向充电做好了准备，这应该会在不久的将来实现一些改变游戏规则的功能。\n电动汽车的出现预计会增加对电力的需求，但电动汽车也可以通过控制电力负荷提供一些优势。\n一项研究显示，电动汽车车队具有可控的负载和车辆到电网的功能，可以节省数十亿美元，并将使电网能够优化可再生能源的使用。\n可控负载，即控制电动汽车何时充电的能力，对于任何电动汽车来说都是可能的，只要它连接到智能充电站或车辆本身具有互联网连接。\n就其本身而言，它可以通过降低高峰需求和仅在需求较低时充电来对电网产生巨大影响，但研究表明，车辆到电网的技术也使车辆能够通过双向充电器将电力送回电网，将产生更大的影响。\n像和这样的几家汽车制造商一直在公开探索这项技术，但可以说是电动汽车领先者的特斯拉过去对部署双向充电一直保持沉默。\n首席执行官埃隆·马斯克(Elon Musk)和联合创始人兼前CTO JB Straubel都对特斯拉汽车启用双向充电表示担忧，因为电池加速退化的可能性，以及相对较小的车队的中等价值。\n在最近提交给德克萨斯州电力公用事业委员会(Texas Electric Utility Commission)的一份文件中，特斯拉回应了有关电动公用事业公司应该如何接近电动汽车的问题，这家汽车制造商总结了其对车辆到电网技术的看法：\n当电动汽车大规模部署而不是在早期采用者阶段时，可以更有效地认识到车辆到电网的好处。同时，任何关于电动汽车相关技术能力的讨论都必须认识到，客户体验和参与意愿是关键，这是首要原则。未来专注于先进技术集成的项目和计划肯定会有机会，比如未来电动汽车的最终聚合，以便在批发市场提供网格服务。在任何情况下，重要的是要记住，电动汽车首先是客户的交通方式。还有机会首先评估固定存储资产，以便从批发电力市场的角度提供类似的电网服务能力。\n虽然这些评论并不太鼓舞人心，但他们确实注意到，一旦电动汽车车队变得足够大，就会有从车辆到电网的价值，这一点正在开始成为事实。\n施特劳贝尔在2015年的一次演示中指出，一旦特斯拉的车队达到100万辆，它将拥有相当大的可控装载能力：\n当时，斯特劳贝尔估计特斯拉将在2019年达到100万辆，而他距离2020年3月已经不远了。\n更明确的迹象表明，特斯拉并没有完全忽视车辆到电网，马斯克表示，特斯拉可能会在2018年“重新审视”车辆到电网技术。\nelectrek了解到，特斯拉已经准备好了车载充电器，可以进行双向充电。\n马可·加西奥拉(Marco Gaxiola)是一名电气工程师，曾参与特斯拉竞争对手Model3的拆卸，他对电动汽车的充电器进行了反向工程，发现它已经准备好双向充电。\n我在逆向设计Model 3充电器时学到的是，它的设计完全是双向的。这意味着电力可以按照与上一个示例相同的方式从交流转换为直流，但也可以反向流动，来自电池并最终到达交流侧。这就是众所周知的DC-AC逆变器，当这项技术出现在车辆上时，它就被称为V2G(车辆到电网)。\n以下是Gaxiola生产的充电器的示意图，作为车辆逆向工程的一部分：\n为了补充这一点，双向设计在Model 3充电器上的同一PCB上复制了3次。冗余设计的另一个示例，即使其中一个电路发生故障也能确保工作过程。此外，它是三阶段设计，因此它可以在世界范围内使用。\nGaxiola认为，Model 3中的车辆到电网的容量可以通过空中软件更新来实现。\n这具有巨大的影响。这意味着特斯拉最终可以从其客户车队中释放出更多价值，无论是对车主还是对特斯拉本身来说都是如此。\n就车主的实用功能而言，他们可能会在停电期间用自己的特斯拉汽车为自己的房子供电，或者用自己的电动汽车给另一辆电动汽车充电。\n在所有者的许可下，特斯拉可以为电力公用事业公司提供从其他地区的网络上的车辆获取电力的能力，以抵消高峰时间的电力需求。\n特斯拉已经有能力通过其自动投标人产品，与澳大利亚和佛蒙特州的Powerwall组成的虚拟发电厂合作，做到这一点。\n唯一的区别是，特斯拉汽车将提供电力，而不是像Powerwall那样的家用电池组。\n虽然人们仍然担心，由于电池组比仅仅在路上开车更频繁地骑行，电池组的退化速度会更快，但随着特斯拉不断通过新的电池组提高电池寿命-这导致了其“百万英里电池”的问世，这一担忧正变得不那么令人担忧。\n特斯拉的车主仍然可以选择加入或退出该计划，他们还可能控制电力公用事业公司何时可以获得他们车辆中的能源。\n正如施特劳贝尔之前指出的那样，特斯拉的车队在路上有100万辆车，理论上有10GW的需求抵消能力，这对电力公用事业公司来说非常有价值。\n当然，这种能力分布在世界各地，但在特斯拉汽车很受欢迎的市场上，它仍然很重要，当地公用事业公司会非常乐意付费使用这种电力。\n车主将因公用事业公司使用他们的车辆而获得补偿，特斯拉可能会通过其自动竞标者平台获得佣金。\n现在我们知道特斯拉已经有数十万辆Model 3汽车可以双向上路了，我认为这款新产品可能会比人们想象的更早发布。\n特斯拉实现双向充电最有趣的特点之一是，他们不需要车外的逆变器，就像日产Leaf上使用的Wallbox Quasar那样。\n它可以与特斯拉自己的墙壁连接器配合使用，也可能与任何家用充电站配合使用。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从哪里开始？请查看我们的YouTube频道以了解最新的评论。", "note_en": "Electrek has learned that Tesla has quietly made Model 3, and likely Model Y, ready for bidirectional charging, which should enable some game-changing features in the near future.\n  The advent of electric vehicles is expected to increase the demand for electricity, but electric cars can also offer some advantages by controlling the power load.\n A study showed that  electric vehicle fleets could save billions of dollars with controllable load and vehicle-to-grid features, and it would enable the grid to optimize its use of renewable energy.\n Controllable load, the ability to control when an EV is charging, is possible with any electric vehicle as long as it is connected to a smart charging station or the vehicle itself has an internet connection.\n On its own, it can have a massive impact on the grid by reducing peak demand and charging only when demand is lower, but the study shows that vehicle-to-grid technology, which also enables a vehicle to send power back into the grid with a bidirectional charger, would have an even greater impact.\n Several automakers, like   and  , have been openly exploring the technology, but Tesla, who is arguably the leader in electric vehicles, has been reticent about deploying bidirectional charging in the past.\n  Both CEO Elon Musk and cofounder and former CTO JB Straubel have expressed concerns about enabling bidirectional charging in Tesla vehicles due to the potential of accelerated battery degradation and also the moderate value with a relatively small fleet.\n In a recent filing with the Texas electric utility commission in which Tesla was responding to questions about how electric utilities should approach electric vehicles, the automaker summarized its view of vehicle to grid technology:\n Vehicle to grid benefits can be recognized much more efficiently when EV deployment is at scale rather than in the early adopter phase. At the same time, any discussion regarding the capabilities of EV related technologies must recognize as a first principle that customer experience and willingness for participation is key. There certainly may be an opportunity for future projects and programs that focus on advanced technological integration, such as the eventual aggregation of EVs in the future to provide grid services in wholesale markets. In any setting, it is important to remember that EVs are modes of transportation first and foremost for customers. There is also an opportunity to evaluate stationary storage assets first to provide similar grid services capabilities from a wholesale electricity market perspective.\n While those comments are not too encouraging, they do note that there’s value in vehicle to grid once the EV fleet becomes large enough, which is starting to become the case.\n Straubel noted in a presentation in 2015 that once Tesla’s fleet reaches 1 million vehicles, it would have a significant controllable load capacity:\n  At the time, Straubel estimated that Tesla would hit a million cars in 2019, and he wasn’t too far off, since   in March 2020.\n In a clearer indication that Tesla is not completely overlooking vehicle to grid, Musk stated that  Tesla could “revisit” vehicle-to-grid technology in 2018.\n  Electrek has learned that Tesla has already prepared its onboard vehicle charger for bidirectional charging.\n Marco Gaxiola, an electrical engineer who participated in a Model 3 teardown for a Tesla competitor, reverse engineered the electric car’s charger and found it to be ready for bidirectional charging.\n  What I learned on reverse engineering the Model 3 charger, was that the design is fully bidirectional. This means power can be converted from AC to DC the same way as the previous example, but also power can flow in reverse direction, coming from the battery and ending up on the AC side. This is known as DC to AC inverter, and when this technology is present in a vehicle, it is known as V2G (Vehicle to Grid).\n Here’s a schematic of the charger that Gaxiola produced as part of the reverse-engineering of the vehicle:\n   To complement this, the bidirectional design is replicated 3 times across the same PCB on the Model 3 charger. Another example of redundant design that assures a working process even if one of the circuits fails. Additionally, it is 3 phase design, so it can be used worldwide.\n   Gaxiola believes that the vehicle to grid capacity in the Model 3 could be enabled through an over-the-air software update.\n  This has massive implications. It means that Tesla could eventually unlock a lot more value from its customer fleet, both for the vehicle owners and for Tesla itself.\n In terms of practical features for owners, they could potentially power their house with their Tesla vehicle during a power outage or charge another electric vehicle with their own.\n  With the owners’ permission, Tesla could offer electric utilities the ability to access power from the vehicles on the network in other to offset electricity demand during peak hours.\n Tesla already has the capacity to do that with  its Autobidder product operating with virtual power plants consisting of Powerwalls in Australia and Vermont.\n  The only difference is that Tesla vehicles would be providing power instead of home battery packs, like Powerwalls.\n While the concern of faster degradation due to the battery packs cycling more than by just driving on the roads is still there, it is becoming less of a concern as Tesla keeps improving battery longevity with new battery cells — leading to its “ million-mile battery.”\n Tesla owners would still have the option to opt in or out of the program, and they would also likely control when the electric utilities can access the energy in their vehicles.\n As Straubel previously pointed out, with a million vehicles on the road, Tesla’s fleet has a theoretical 10GW demand offsetting capacity, which is extremely valuable to electric utilities.\n Of course, this capacity is distributed around the world, but it is still significant in markets where Tesla vehicles are popular, and local utilities would be more than happy to pay to access that power.\n Owners would be compensated for the utility using their vehicles, and Tesla would likely get a commission through its Autobidder platform.\n  Now that we know that Tesla already has hundreds of thousands of Model 3 vehicles bidirectional-ready on the road, I think this new product could be released sooner than people think.\n One of the most interesting features of Tesla’s implementation of bidirectional charging is that they don’t require an inverter outside the vehicle, like the  Wallbox Quasar used on the Nissan Leaf.\n It would work with Tesla’s own Wall Connector or potentially with any home charging station.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-05-20 19:13:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,双向,quietly,电动汽车", "title": "特斯拉悄悄增加双向充电能力", "title_en": "Tesla quietly adds bidirectional charging capability", "transed": 1, "url": "https://electrek.co/2020/05/19/tesla-bidirectional-charging-ready-game-changing-features/", "via": "", "real_tags": ["特斯拉", "双向", "quietly", "电动汽车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002943, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电影制片人莉莉·沃卓斯基(Lilly Wachowski)回应了埃隆·马斯克(Elon Musk)和伊万卡·特朗普(Ivanka Trump)，此前两人在社交媒体上用沃卓斯基夫妇1999年热门电影“黑客帝国”(The Matrix)中的一句话开玩笑。\n马斯克在推特上发了“吃红色药丸”-指的是“黑客帝国”(Matrix)中的一个关键场景，随后产生了“红色药丸”这个短语，作为另类右翼、歧视女性的模因，以及一个通常与亚历山大·奥卡西奥-科尔特斯(Alexandria Ocasio-Cortez)和拉希达·特莱布(Rashida Tlaib)所属的美国民主社会党(Democratic Social Of America)联系在一起的红玫瑰表情符号-特朗普回复说：“吃了！”\n沃乔夫斯基随后简洁地回应道：“操你们两个”，随后又发了一条推文支持勇敢太空联盟(Brave Space Alliance)，该联盟将自己描述为“位于芝加哥南侧的第一个黑人和跨性别者领导的LGBTQIA中心”。\n出生于南非的企业家马斯克是SpaceX和特斯拉的首席执行官，他发布了自己最初的推文，没有发表其他评论，但据信这是指他与加州当局就他重新开放弗里蒙特特斯拉工厂的计划发生了冲突，在冲突中，他得到了唐纳德·特朗普的支持。\n在“黑客帝国”中，劳伦斯·菲什伯恩(Laurence Fishburne)的革命领袖莫菲斯(Morpheus)向不情愿的英雄黑客尼奥(基努·里维斯(Keanu Reeves)饰演)提供的蓝色或红色药丸被框定为一个选择，要么是蓝色药丸故意的无知--“你在床上醒来，相信任何你想相信的东西”，要么是红色药丸对“真相”的介绍：“我告诉你兔子洞有多深。”\n沃乔夫斯基于2016年出柜，此前“黑客帝国”的导演兼兄弟拉娜于2012年出柜。", "note_en": "Film-maker  Lilly Wachowski has responded to Elon Musk and Ivanka Trump after the pair bantered on social media using a phrase from the Wachowskis’ hit 1999 film,  The Matrix.\n After Musk tweeted “Take the red pill” – referring to a key scene in The Matrix, which subsequently gave rise to the phrase  “redpilling” as an alt-right, misogynist meme, along with a red rose emoji normally associated with the Democratic Socialists of America, the party to which Alexandria Ocasio-Cortez and Rashida Tlaib belong – Trump replied: “Taken!”\n Wachowski then pithily responded, “Fuck both of you”, before following up with a tweet supporting the Brave Space Alliance, which describes itself as “the first Black and trans led LGBTQIA center located on the South Side of Chicago”.\n  Musk, the South African-born entrepreneur who is CEO of SpaceX and Tesla, posted his original tweet with no other comment, but it is thought to refer to his  clash with authorities in California over his plans to reopen the Tesla factory in Fremont, in which  he was supported by Donald Trump.\n In The Matrix, the  selection of blue or red pill offered by Laurence Fishburne’s revolutionary leader Morpheus to reluctant-hero hacker Neo (played by Keanu Reeves) is framed as a choice between the blue pill’s wilful ignorance – “You wake up in your bed and believe whatever you want to believe” or the red pill’s introduction to “the truth”: “I show you how deep the rabbit hole goes.”\n Wachowski came out as trans in 2016, following fellow Matrix director and sibling  Lana, who came out in 2012.", "posttime": "2020-05-20 18:14:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,埃隆·马斯克,matrix,founder,特朗普", "title": "“黑客帝国”(The Matrix)联合创始人伊万卡·特朗普(Ivanka Trump)和埃隆·马斯克(Elon Musk)", "title_en": "'The Matrix' Co-Founder Slams Ivanka Trump and Elon Musk", "transed": 1, "url": "https://www.theguardian.com/film/2020/may/18/lilly-wachowski-ivana-trump-elon-musk-twitter-red-pill-the-matrix-tweets", "via": "", "real_tags": ["黑客", "埃隆·马斯克", "matrix", "founder", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Openrouteserservice是一款开源的路线规划软件，具有丰富的汽车、重型车辆、徒步旅行和骑自行车等功能。", "note_en": "Openrouteservice is a open source route planner with plenty of features for car, heavy vehicles, hiking and cycling.", "posttime": "2020-05-20 17:44:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,开放,open,路线", "title": "免费、开放、协作的路由服务", "title_en": "Free, open and collaborative routing service", "transed": 1, "url": "https://maps.openrouteservice.org", "via": "", "real_tags": ["免费", "开放", "open", "路线"]}, {"category": "", "categoryclass": "", "imagename": "2d2201b8e0e333a1133bcb431ce8936e.png", "infoid": 1002941, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此Git存储库托管作为IBM Equity Access Toolkit一部分的工具和支持组件。\n本自述涵盖面向开发人员的主题。对于非开发人员使用，请参阅以下各个工具的说明：\nAccessibility-Checker-Extension for Chrome：为Chrome和其他支持Chromium Web扩展API的浏览器添加自动辅助功能检查功能的Web浏览器扩展。\nFirefox的辅助功能检查器扩展：为Firefox添加自动辅助功能检查功能的Web浏览器扩展。\n现在，您可以选择要使用的工具并按照Readme.MD说明操作。\n您可以从根目录构建所有工具，也可以单独构建每个工具。\n在等同访问/可访问性检查器/包目录中，可以安装或部署为NPM包的java脚本源，它可以与Selenium、Puppeteer或Zombie等HTML解析引擎配合使用，从而允许开发人员在持续集成管道(如Travis CI)内执行集成的可访问性测试。请查看更多详细信息。", "note_en": "This Git repository hosts tools that are part of the  IBM Equal Access Toolkit and supporting components.\n  This README covers topics for developers. For non-developer usage, see the following instruction for individual tools:\n accessibility-checker-extension for Chrome : web browser extensions that adds automated accessibility checking capabilities to Chrome and other browser that support the Chromium web-extension API\n accessibility-checker-extension for Firefox : web browser extensions that adds automated accessibility checking capabilities to Firefox\n          Now you can select the tool you want to use and follow the README.MD instructions\n        You can build all the tools from the root directory or build each individual tool separately.\n     In the equal-access/accessibility-checker/package directory java script source that can be installed or deployed as npm package that works with an HTML parsing engines such as Selenium, Puppeteer, or Zombie to allow developers to perform integrated accessibility testing within a continuous integration pipeline such as Travis CI. Please view more  details.", "posttime": "2020-05-20 17:00:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "项目,accessibility", "title": "Web项目的自动辅助功能检查器", "title_en": "Automated Accessibility Checker for web projects", "transed": 1, "url": "https://github.com/IBMa/equal-access", "via": "", "real_tags": ["项目"]}, {"category": "", "categoryclass": "", "imagename": "b1c9d9245a3580c75f295b1c04fa258c.jpg", "infoid": 1002940, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软在去年发布了针对Windows10的现代命令行应用程序Windows终端。该项目在GitHub上是开源的，在过去的一年里收到了大量的更新，今天已经达到了1.0的里程碑。\n在Build 2020上，微软宣布发布Windows终端1.0。新的Windows终端几个月来一直可以稳定使用，但随着1.0版的发布，微软表示，它现在可以供企业使用。\nWindows终端为Windows 10用户提供了现代命令行应用程序。它包括一个选项卡式界面，允许用户从同一窗口在不同终端之间切换。您可以在Windows终端中运行CMD、PowerShell、Linxus发行版的Windows子系统、Azure Cloud Shell和其他命令行可执行文件。这个应用程序不仅可以让您有多个选项卡，而且您还可以并排打开不同的命令行，如上面的屏幕截图所示。您还可以访问许多不同的配置和自定义选项。\n“现在可供企业使用，Windows终端1.0为您提供了在多个选项卡和窗格中运行任何命令行可执行文件的能力，包括WSL发行版和Azure Cloud Shell。您还可以使用Unicode和UTF-8字符，拥有GPU加速文本渲染引擎，以及自定义主题、样式和配置，“微软在新闻稿中指出。\nWindows终端1.0可通过此处的Microsoft应用商店购买，您也可以从此处的GitHub手动下载。\n高级会员对新闻帖子的评论将以提升状态为特色，从而提高他们的可见性。此选项卡允许您与其他高级会员一起参与高级评论。注册以加入其他高级会员提升对话！\n注册或订阅。\n您没有登录但想要加入对话吗？成为瑟罗特高级或基本用户参与。\n登记簿", "note_en": "Microsoft  announced its modern command-line application for Windows 10, Windows Terminal, back at Build last year. The project, which is  open-source on GitHub, has received a ton of updates over the last year and is today hitting the 1.0 milestone.\n At Build 2020, Microsoft is announcing the release of Windows Terminal 1.0. The new Windows Terminal has been stable to use for months, but with the release of version 1.0, Microsoft says it’s now available for enterprise use.\n  Windows Terminal offers a modern command-line application for Windows 10 users. It includes a tabbed interface, allowing users to switch between different terminals from the same window. You can run CMD, PowerShell, Windows Subsystem for Linxus distros, Azure Cloud Shell, and other command-line executables in Windows Terminal. Not only does the application let you have multiple tabs, but you can also have the different command-lines open side-by-side as on the screenshot above. You also get access to a number of different configuration and customization options.\n “Now available for enterprise use, Windows Terminal 1.0 provides you with the ability to run any command line executable, including WSL distros and Azure Cloud Shell, inside multiple tabs, and panes. You can also use Unicode and UTF-8 characters, have a GPU accelerated text rendering engine, and custom themes, styles, and configurations,” Microsoft notes in the press release.\n Windows Terminal 1.0 is  available via the Microsoft Store here, and you can also  download it manually from GitHub here.\n Premium member comments on news posts will feature an elevated status that increases their visibility.This tab would allow you to participate in Premium comments with other premium members.Register to join the other Premium members in elevating the conversation!\n  Register or Subscribe\n  Don&#39;t have a login but want to join the conversation? Become a Thurrott Premium or Basic User to participate\n  Register", "posttime": "2020-05-20 16:59:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,microsoft,发布,微软,releases", "title": "微软发布Windows终端1.0", "title_en": "Microsoft releases windows terminal 1.0", "transed": 1, "url": "https://www.thurrott.com/dev/236298/microsoft-releases-windows-terminal-1-0", "via": "", "real_tags": ["windows", "microsoft", "发布", "微软", "releases"]}, {"category": "", "categoryclass": "", "imagename": "81f722c9fca4d7af00c0e14c3b8d6147.jpg", "infoid": 1002939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我从小在太浩湖滑雪比赛长大。我是斯阔谷滑雪队的成员，十多年来，它一直是我生活的中心。在几个月前的一次会议上，有人问我滑雪在投资方面教会了我什么。这是在舞台上，你不能思考你的答案-你必须脱口而出你能想到的任何东西。我不认为滑雪能教会我任何关于投资的知识。但有一件事浮现在我的脑海里。“好吧，让我把这件事带到一个黑暗而悲惨的地方，”我在给一群500名陌生人讲述一个我近20年来很少谈论的故事之前说。我们十几个人从小一起滑雪长大。大多数人从我们很小的时候就认识了。到了2001年，我们都快十几岁了，在过去的十年里，我们醒着的大部分时间从未远离过对方。我们一周滑雪6天，每年10个月，在山上的冰川上度过夏天。俄勒冈州的胡德和新西兰，那里的季节反映了我们的季节。滑雪是第一位的。我们中的大多数人都参加了独立学习项目，这让我们绕过了传统的高中。滑雪了一整天之后，我们在晚上读了几本书，填了几张表，令我们惊讶的是，这让我们拿到了文凭。我们在一起的时间使我们的关系更亲近于兄弟姐妹，而不是朋友。滑雪比赛是团队和个人运动的奇怪混合体。你们作为一个团队训练、旅行和吃饭，但这项运动本身是个人的。我们的比赛结果不是相互依赖的；我们每天的理智是相互依赖的。任何十几个青少年组成的团体都会找到一种方法来迎头相撞。我想我们有一半的时间都恨对方。20年后，我们中几乎没有人保持联系。但是，到2001年，在十几个与我共度大半生的青少年中，我们中有四个成了形影不离的好朋友。这是他们中的两个人--布兰登·艾伦和布莱恩·里士满的故事。当奇妙的事情变成例行公事时，你会认为它们是理所当然的。斯阔谷是北美最大的滑雪场之一，是1960年奥运会的举办地，每年吸引100万游客。它美得令人吃惊。对我们来说，这只是家的延伸。滑雪比赛每天需要四个小时的训练，这对我们来说就像是工作。剩下的时间-每天另外四个小时，一周六天-我们只是四处滑雪，没有条理，玩得很开心。我们称之为“免费滑雪”。其他人都管它叫滑雪。2001年2月15日，我们刚从科罗拉多州的一场比赛回来。我们回家的航班延误了，因为太浩湖被暴风雪袭击了，即使按照它自己的标准也很凶猛。当有一层新的雪地需要坚硬的冰时，你就不能参加比赛或训练。所以现在是免费滑雪一周的时候了。当月早些时候，塔霍收到了几英尺厚的轻盈蓬松的雪，这些雪来自北极的温度。2月中旬袭击的风暴是不同的。天气很暖和-几乎不到冰点-而且威力很大，在它之前到来的轻质粉末上留下了三英尺厚的湿重的积雪。我们当时没有想过这一点--我们在17岁的时候没有想过太多--但是大雪加上蓬松的雪创造了教科书上完美的雪崩条件。想象一下，上面有一层厚厚的沙子，上面有一层厚重的水泥。现在想象一下把这些层放在陡峭的山上。它很易碎，很容易滑下来。这就是2001年2月下旬斯阔谷的情况。滑雪场善于管理这些条件，以确保人们的安全。很少有游客意识到这一点，但如果你在暴风雪过后的清晨参观滑雪胜地，你会听到像炸弹爆炸的声音。这声音没有欺骗性。在迫击炮、手榴弹和从直升机上投下的炸药的组合下，滑雪巡逻队控制着危险球场的爆炸，在度假村空无一人时故意触发雪崩，在客人到达之前先发制人(查看一些视频)。这是一个有效的系统，使主要度假村的雪崩事故变得罕见。但是，如果你在越界滑雪--躲在“请勿穿越绳索”下滑雪，在没有被湾区游客触碰的禁地滑雪--系统就帮不了你了。越界滑雪是非法的，是非法侵入的一种形式。度假村不想让你这么做的主要原因是因为太危险了。越界区域没有巡逻，所以如果你受伤了，你要靠自己。它们通常不会通向缆车，所以你必须自己想办法再上去。它们不是为了控制雪崩而轰炸的。因此，滑雪者最有可能在这里--超出界限--发现大自然母亲滑动的愤怒。2001年2月21日上午，布兰登、布莱恩和我像以前一样，在斯阔谷滑雪队更衣室会面。几年后，布莱恩的妈妈告诉我，那天早上他离开家时的最后一句话是，“别担心，妈妈，我不会滑雪越界的。”但是我们一打开滑雪板，我们三个就这么做了。斯阔谷的背面，在", "note_en": "I grew up ski racing in Lake Tahoe. I was on the Squaw Valley Ski Team, and it was the center of my life for over a decade. At a conference a few months ago I was asked what skiing taught me about investing. This was on stage, where you can’t ponder your answer – you have to blurt out whatever you can think of. I didn’t think skiing taught me anything about investing. But one incident came to mind. “Well, let me take this to a dark and tragic place,” I said before telling a group of 500 strangers a story I hadn’t talked about much in almost 20 years. A dozen of us had grown up skiing together. Most had known each other since we were young children. By 2001 we were in our late teens, having spent the majority of our waking hours over the previous decade never far from each other. We skied six days a week, 10 months a year, spending summers on the glacier of Mt. Hood, Oregon and in New Zealand, where the seasons mirror our own. Skiing took precedence to everything. Most of us were in an independent study program that let us bypass traditional high school. After skiing all day we read a few books and filled out a few forms in the evening in what – to our amazement – led to a diploma. The amount of time we spent together created a relationship closer to siblings than friends. Ski racing is an odd hybrid between a team and individual sport. You train and travel and eat as a team, but the sport itself is individual. Our race results did not rely on each other; our daily sanity did. Any group of a dozen teenagers will find a way to butt heads. Half the time I think we hated each other. Twenty years later, few of us keep in touch. But of the dozen teenagers who, by 2001, I had spent the majority of my life with, four of us had become inseparable best friends. This is the story of two of them – Brendan Allan and Bryan Richmond. You take amazing things for granted when they become routine. Squaw Valley is one of the largest ski resorts in North America, was home to the 1960 Olympics, and attracts a million visitors a year. It’s staggeringly beautiful. To us, it was just an extension of home. Ski racing required four hours a day of training, which felt like work to us. The rest of the time – another four hours a day, six days a week – we just skied around, unstructured, having a good time. We called it “free skiing.” Everyone else just calls it skiing. On February 15th, 2001, we had just returned from a race in Colorado. Our flight home was delayed because Lake Tahoe was blasted with a blizzard vicious even by its own standards. You can’t race or train when there’s a blanket of new snow – racing requires hard-packed ice. So it was time for a week of free skiing. Earlier that month Tahoe received several feet of light, fluffy snow that comes from Arctic temperatures. The storm that hit in mid-February was different. It was warm – barely at the freezing point – and powerful, leaving three feet of heavy, wet snow on top of the light powder that came before it. We didn’t think about it at the time – we didn’t think about much at age 17 – but the combination of heavy snow on top of fluffy snow creates textbook perfect avalanche conditions. Imagine a thick layer of sand with a layer of heavy cement on top. Now imagine putting those layers on a steep hill. It’s fragile, prone to sliding down. That’s what Squaw Valley was like in late February 2001. Ski resorts are good at managing these kinds of conditions to keep people safe. Few tourists realize it, but if you visit a ski resort in the early morning hours after a blizzard you will hear what sounds like bombs going off. The sound isn’t deceiving. With a combination of mortars, grenades, and charges dropped from helicopters, ski patrol do controlled blasts of at-risk pitches to intentionally trigger avalanches when the resort is empty, preempting slides before guests arrive (check out some videos). It’s an effective system, keeping avalanche accidents at major resorts rare. But if you’re skiing out of bounds – ducking under the DO NOT CROSS ropes to ski the forbidden terrain untouched by masses of Bay Area tourists – the system won’t help you. Skiing out of bounds is illegal, a form of trespassing. The main reason resorts don’t want you doing it is because it’s dangerous. Out-of-bounds areas aren’t patrolled, so you’re on your own if you get injured. They usually don’t lead down to a chairlift, so you have to find your own way back up. And they’re not bombed for avalanche control. So it’s here – out of bounds – that a skier is most likely to discover Mother Nature’s sliding wrath. On the morning of February 21st, 2001, Brendan, Bryan, and I met in the Squaw Valley Ski Team locker room, like we had hundreds of times before. Bryan’s mom told me years later that his last words when he left his house that morning were, “Don’t worry, Mom, I won’t ski out of bounds.” But as soon as we clicked into our skis, that’s what the three of us did. The backside of Squaw Valley, behind the KT-22 chairlift, is a stretch of mountain about a mile long that separated Squaw with Alpine Meadows ski resort. It’s good skiing – steep, wide open, with rolling terrain. And since it’s out of bounds, it was completely untouched. Our private playground. Before February 21st I had skied it maybe a dozen times. It wasn’t one of our frequent spots, because it’s laborious. The end of Squaw’s backside spits you out on a back country road, where we would hitchhike back to our locker room. Brendan, Bryan, and I decided to ski it that morning. When an event becomes life-changing, all kinds of mundane details sear into your memory. Almost 20 years later I remember Brendan duct-taping his ski pants shut on the chairlift because I had broken the side zipper while wearing them the week before. I remember Bryan cackling with joy as the three of us entered barren wilderness while the rest of the resort was packed with crowds. And I vividly remember getting hit by one of the only avalanches I’ve ever experienced. It was tiny, not going over my knees. It wasn’t scary. I remember laughing. But the feeling is unforgettable. I didn’t hear or see the slide. I just suddenly realized my skis weren’t on the ground anymore – I was literally floating in a cloud of snow. You have no control in these situations, because rather than pushing back on the ground to gain traction with your skis, the ground is pushing you in all directions. I remember putting my hands up and shouting, “Wahooo” like I was on a roller coaster. I essentially was. The avalanche ended quickly. Brendan was to my left and Bryan was below us. No one stopped. We just charged to the bottom. “Holy shit, did you see that avalanche?” I remember saying when we got to the road. “Haha, that was awesome.” Brendan said. No one thought much more of it. We hitchhiked back. At first we had trouble getting a car to pick us up, so I decided if we took our shirts off in the 20-degree weather people would have sympathy for us and stop. It actually worked. Seventeen-year-old boys are resourceful. When we got back to Squaw Brendan and Bryan said they wanted to ski the backside again. I have no recollection of why, or how this came about, but I didn’t want to go. It may have been the hitchhiking, which I always hated. That, more than the out-of-bounds skiing, felt risky to me. But I had an idea. Brendan and Bryan could ski the backside themselves. Rather than hitchhiking back, I would pick them up in my truck. Everyone agreed on the plan, which we made in the Wildflour Baking Company cookie shop in the Squaw Valley lodge after lunch. This was before we had cell phones, so syncing on concrete plans ahead of time was important. Brendan and Bryan walked out and skied off. Thirty minutes after Brendan and Bryan took the chair up to ski the backside, I drove to the back-country road where I was scheduled to pick them up. They weren’t there. I waited another 30 minutes before giving up. It took maybe five minutes to ski the pitch, so I knew they weren’t coming. It didn’t occur to me that they were in danger. I figured they beat me to the bottom and hitchhiked back. I drove back to our locker room, expecting to find them. They weren’t there, either. I asked around. No one had seen them. I drove to Brendan’s house, which wasn’t far from the pick-up point. No one was home. I drove back to the locker room and called his house. It went to voicemail. I remember ending the message with, “I hope you’re OK man.” I was starting to get nervous, but not enough to make a big deal. People were more comfortable being out of touch before the texting era. Later that day, around 4 pm, Bryan’s mom called me at home. I remember every word. “Hi Morgan, Bryan didn’t show up for work. Do you know where he is?” she asked. I told her the truth. “We skied the backside of KT-22 this morning. He and Brendan did it again, I was going to pick them up on the road. But they weren’t there, and I haven’t seen them since.” “Oh my God,” she said. Click. I think in that moment she pieced together what likely happened to her son. I did, too. Later that evening, after sunset, my friend Ahren and I bought heavy duty flashlights at a drug store and drove to the pick-up spot. We shined the lights up the mountain shouting, “Brennnndan …. Bryyyyyan.” I remember Ahren and I thinking they had likely broken their legs and were stuck on the hill. In the back of my mind I knew it was more serious, but it was comforting to think we could find them. We gave up quickly and drove to the locker room. I forget who made the call, but the police were suddenly taking our information in what had become a missing-person report. I don’t fault the police for this, but they didn’t take it very seriously. I remember one saying, “99% of the time in cases like these the person is out drunk at a party, or ran off with a girl for the night.” I’m sure he was right – that was usually the case. But I knew he was wrong. “Their shoes are right there,” I said, pointing to Brendan and Bryan’s sneakers on the locker room floor. “That means their ski boots are on their feet. And it’s now 9 pm. Think about that. It’s 9 pm and they have their ski boots on their feet. They are not at a party.” Around 10 pm I was told to go to the Squaw Valley Fire Department where I met the local search and rescue team. They took it much more seriously. I explained everything Brendan, Bryan, and I did that day. The search team pulled out maps, and I showed them exactly where we entered the out-of-bounds area, where we exited, and the path we took. I told them about the small avalanche we were caught in that morning. As soon as I mentioned it I could see the dots connecting in the rescuers’ heads. These were seasoned professionals who understood the danger of mountains. When I finished talking I remember two of the rescuers looked at each other and sighed. They knew. I drove back to the locker room around midnight. The Squaw Valley parking lot can hold several thousand cars. By this time it was almost empty. Everyone had gone home, except two cars parked next to each other: Brendan’s Jeep, and Bryan’s Chevy pickup. Search and rescue teams were on the backside of Squaw by midnight. It was still a blizzard, with gusty winds and low visibility even during daylight. I remember watching them ski off in the pitchblack night. With giant floodlights, 12-foot probing poles, and a team of search dogs, they went looking for Brendan and Bryan. I later learned that as soon as the rescue team entered the out-of-bounds point where I told them we skied, they found the fresh scars of a massive avalanche field. I tried to sleep on a bench in the ski team locker room, but couldn’t shut my eyes. I remember hoping Brendan and Bryan would come bounding through the door. The hours dragged on, and felt like days. By 9 am the locker room was packed with other ski racers, parents, friends, and family, all eager to help. It became a staging area for the search. I laid back down on the bench and finally fell asleep. A few minutes later I awoke to the sound of a scream, followed by yelling and commotion. I knew what happened. No one needed to say it. I walked to the second floor of the locker room where I saw Bryan’s mom on a couch. The scream that woke me up off the bench was hers, made after she was told every parent’s worst nightmare. “I’m so sorry,” I told her, bawling. It’s hard to describe a moment like that. I didn’t know what else to say then. I don’t know what else to say now. Search dogs had honed in on a spot in the avalanche field where rescuers with probe poles found Brendan and Bryan buried under six feet of snow. They were born one day apart, and died 10 feet from each other. Later that day I drove to see my dad at work. I wanted to be around family. He met me in the parking lot and said, “I’ve never been so happy to see you.” It was the only time I’ve seen him cry. It didn’t occur to me until that moment how close I was to going with Brendan and Bryan. Why did I ski the backside with them once that morning, but then decline a second run? I’ve thought about it a million times. I have no idea. Why was the avalanche on our first run a tiny little thrill, but the second run triggered a deadly slide that killed two 17-year-olds? We’ll never know. The next evening, Tom Brokaw told Brendan and Bryan’s story on the NBC Nightly News. It was surreal to watch. We were laughing together 36 hours before. Now their death was national news. And the only thing that kept me from being a third name in the newscast I had watched religiously was a fluke decision I put no thought into. It’s been almost 20 years since this happened. Sometimes I think about everything that’s occurred since – college, marriage, career, kids – and remind myself that I’ve only experienced it because of a blind, thoughtless decision to decline another ski run. This story isn’t unique. Many people reading this have had near-death experiences. Most have lost someone dear to them. And everyone reading this has made what seemed like no-nothing, inconsequential decisions that fundamentally reshaped their lives. Sometimes those fluke decisions are positive. Sometimes they’re negative. But they’re always out of the blue, unforeseeable. It’s just how life works. After I told this story at the conference I had to tie it back to an investing lesson. It was easier than I thought. My risk tolerance plunged after Brendan and Bryan died. I broke my back skiing (no nerve damage) a few months later, which crushed it even more. I haven’t skied much since. Maybe ten times in the last 19 years. If I’m honest, it scares me. I’ve been risk-averse in other areas of life ever since, too. I drive the speed limit. I obey the seatbelt sign on airplanes. I invest in index funds. I don’t know if Brendan and Bryan’s death actually affected how I invest. But it opened my eyes to the idea that there are three distinct sides of risk: The odds you will get hit. The average consequences of getting hit. The tail-end consequences of getting hit. The first two are easy to grasp. It’s the third that’s hardest to learn, and can often only be learned through experience. We knew we were taking risks when we skied. We knew that going out of bounds was wrong, and that we might get caught. But at 17 years old we figured the consequences of “risk” meant our coaches might yell at us. Maybe we’d get our season pass revoked for the year. Never, not once, did we think we’d pay the ultimate price. But once you go through something like that, you realize that the tail-end consequences – the low-probability, high-impact events – are all that matter. In investing, the average consequences of risk make up most of the daily news headlines. But the tail-end consequences of risk – like pandemics, and depressions – are what make the pages of history books. They’re all that matter. They’re all you should focus on. We spent the last decade debating whether economic risk meant the Federal Reserve set interest rates at 0.25% or 0.5%. Then 36 million people lost their jobs in two months because of a virus. It’s absurd. Tail-end events are all that matter. Once you experience it, you’ll never think otherwise.", "posttime": "2020-05-20 16:01:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "风险,sides,滑雪", "title": "风险的三个方面", "title_en": "The Three Sides of Risk", "transed": 1, "url": "https://www.collaborativefund.com/blog/the-three-sides-of-risk/", "via": "", "real_tags": ["风险", "sides", "滑雪"]}, {"category": "", "categoryclass": "", "imagename": "b91b50d1381786f126114956ad6503fa.jpg", "infoid": 1002938, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“真相还在穿鞋的时候，谎言可以穿越半个地球”这句话经常被认为是多么贴切，但这句话很可能不是由他发明的。\n通常被认为是马克·吐温(Mark Twain)的这句话，似乎是讽刺作家乔纳森·斯威夫特(Jonathan Swift)几个世纪前发表的一句话的后裔。加森·奥图尔(Garson O‘Toole)是一名研究人员，他和吐温一样喜欢化名，他说，随着时间的推移，变体不断涌现和变异，直到维多利亚时代的一位传教士普及了这句话的现代版本。\n七年前，奥图尔创办了“引语调查”(Quote Investigator)，这是一个颇受欢迎的网站，他在这个网站上追踪著名谚语的起源。本月，他出版了“海明威没有说过：熟悉语录背后的真相”一书，在这本书中，他收集并更新了他网站上的许多帖子，并就错误语录是如何形成的提出了新的理论。\n奥图尔说，“我刚开始的时候，这些错误引用的确切来源很神秘，有趣的是，有时你可以找到这些线索，指出它们可能是如何起源的。”奥图尔是格雷戈里·F·沙利文(Gregory F.Sullivan)的化名，沙利文曾是约翰·霍普金斯大学计算机科学系的一名教师和研究员，现在正把时间花在写作上。\n在这本书中，沙利文先生提出了10种常见的“机制”，他说这些机制会导致错误引用和错误归类。\n通过一个这样的过程，他将其称为“文本接近”，一个名人仅仅通过在单词附近公布他们的名字或肖像，就错误地获得了引用的信用。在另一种说法中，“腹语术”指的是关于个人工作的陈述被认为是如此贴切，以至于最终会被他们自己的话搞糊涂。\n这两个人都可以解释俄罗斯作家安东·契诃夫(Anton Chekhov)是如何与这样一句话联系在一起的：“任何白痴都可能面临危机，让你精疲力竭的是日常生活，”正如沙利文的网站上以及现在他的书中所概述的那样。\n2013年5月，沙利文收到一位读者的来信，这位读者试图证明契诃夫的话是他写的，但没有成功，他需要帮助来揭开这段语录的真实历史。\n谷歌图书将他带到了1971年出版的教科书“剧院的传统”，这本教科书由彼得·鲍兰(Peter Bauland)和威廉·英格拉姆(William Ingram)编辑。网上只有片断可用，所以他访问了一所大学图书馆，对这本书进行了全面的评论。在里面，他发现了鲍兰先生和英格拉姆先生写的：\n20世纪50年代的一部好莱坞电影中的一个人物不经意地说出了这句话：“任何白痴都可能面临危机；正是这种日常生活让你筋疲力尽。”这部剧本是由克利福德·奥德茨(Clifford Odets)写的，他是美国契诃夫戏剧传统的主要继承人，在这一行里，他集中体现了他的大师的教训。\n尽管沙利文无法确认奥迪茨是这句话的作者，但他推测奥迪茨写了类似的东西，后来在1971年的教科书中被错误引用。沙利文能找到的将这句话归功于契诃夫的最早引证是在1981年。\n最终的归因可能是：文本接近，一位健忘的读者看到契诃夫的名字，就盲目地认为这句话是他的；腹语术，一位读者发现这句话与契诃夫的风格如此共鸣，以至于这些词被误认为是他的；或者是某种组合。\n沙利文在2013年6月发表了他的分析，但两年多后，一位读者提出了一个新的线索，让他参考了1954年的电影“乡村女孩”(The Country Girl)，这部电影是根据奥迪茨的一部戏剧改编的。\n我在波士顿遇到了一场危机，我逃脱了。几乎任何人都可能面临危机。日常生活才是艰难的。\n这部电影是根据奥迪茨的一部戏剧改编的，但在1951年版的剧本中找不到台词后，沙利文认为这句话很可能是另一个人创造的。最终，他会将“任何白痴”这句话归功于编剧乔治·西顿(George Seaton)。\n·谚语智慧，其中一句引语被提升到谚语的地位，因为它的来源不明；\n·真实世界的接近性，即一个人因为与真实作者有着现实世界的联系而错误地获得了引用的信用；\n·相似的名字，将一句引语错误地归因于与真实作者的名字相似的人；\n·历史小说，当一个人在电影、小说或其他小说作品中扮演他们的角色所说的话得到表彰时；\n·抓捕，当一位名人因附和不太知名的人的话而获得赞誉时；\n·主持人，一个人仅仅因为出名就能因从未发表过的名言而赢得赞誉，吐温和阿尔伯特·爱因斯坦(Albert Einstein)就是很受欢迎的例子。", "note_en": "How fitting that the man often credited with saying “a lie can travel halfway around the world while the truth is still putting on its shoes” most likely did not invent the phrase.\n Commonly attributed to Mark Twain, that quotation instead appears to be a descendant of a line published centuries ago by the satirist Jonathan Swift. Variants emerged and mutated over time until a modern version of the saying was popularized by a Victorian-era preacher,  according to Garson O’Toole, a researcher who, like Twain, prefers a pseudonym.\n Seven years ago, Mr. O’Toole  started Quote Investigator, a popular website where he traces the origins of well-known sayings. This month, he published “Hemingway Didn’t Say That: The Truth Behind Familiar Quotations,” a book in which he collected and updated many of the posts from his site and offers new theories on how misquotations form.\n “When I started off, it was mysterious exactly where these misquotations were coming from, and it was interesting that sometimes you could find these clues that pointed to how they may have originated,” said Mr. O’Toole, an alias for Gregory F. Sullivan, a former teacher and researcher in the Johns Hopkins computer science department who now spends his time writing.\n In the book, Mr. Sullivan offers 10 common “mechanisms” that he says lead to misquotation and incorrect attribution.\n  Through one such process, which he labels “textual proximity,” a famous person mistakenly gets credit for a quotation merely by having their name or likeness published close to the words. In another, “ventriloquy,” a statement about an individual’s work is perceived to be so apt that it is eventually confused for their own words.\n Both may explain how Anton Chekhov, the Russian writer, became associated with the saying: “Any idiot can face a crisis, it’s the day-to-day living that wears you out,” as outlined on Mr. Sullivan’s website and, now, in his book.\n In May 2013, Mr. Sullivan heard from a reader who, after a fruitless attempt to prove Chekhov’s authorship of those words, wanted help uncovering the true history of the quotation.\n Google Books led him to  “The Tradition of the Theatre,” a textbook published in 1971 and edited by Peter Bauland and William Ingram. Only snippets were available online, so he visited a university library to review the book in full. In it, he found the following, written by Mr. Bauland and Mr. Ingram:\n A character in a Hollywood film of the 1950s casually drops this line: “Any idiot can face a crisis; it’s this day-to-day living that wears you out.” The screenplay was by Clifford Odets, America’s chief inheritor of the dramatic tradition of Anton Chekhov, and in that one line, he epitomized the lesson of his master.\n Though Mr. Sullivan was unable to confirm Mr. Odets’s authorship of the sentence, he theorized that Mr. Odets wrote something similar, which was then misquoted in the 1971 textbook. The earliest citation Mr. Sullivan could find crediting the saying to Chekhov was from 1981.\n That final attribution could have been the result of: textual proximity, in which an oblivious reader saw Chekhov’s name and blindly attributed the quotation to him; ventriloquy, in which a reader found the line so resonated with Chekhov’s style that these words were mistaken for his; or some combination.\n  Mr. Sullivan published his analysis in June 2013, but more than two years later, a reader came forward with a new lead, referring him to the 1954 movie “The Country Girl,” based on a play by Mr. Odets.\n I faced a crisis up there in Boston, and I got away with it. Just about anybody can face a crisis. It’s that everyday living that’s rough.\n The movie was based on a play by Mr. Odets, but, after failing to find the line in a 1951 edition of the script, Mr. Sullivan  believes that yet another man most likely coined the phrase. Ultimately, he would credit the “any idiot” line to George Seaton, who wrote the screenplay.\n  • Proverbial wisdom, in which a quotation is elevated to the status of a proverb because its source is unknown;\n • Real-world proximity, when an individual wrongly gets credit for a quotation because they share a real-world connection to the true author;\n • Similar names, the mistaken attribution of a quotation to someone whose name resembles that of the true author;\n • Historical fiction, when an individual gets credit for words uttered by a character portraying them in a movie, novel or other work of fiction;\n • Capture, when a famous person gets credit for echoing the words of someone less well-known;\n • Host, in which an individual, simply by being famous, attracts credit for quotations they never delivered, with Mr. Twain and Albert Einstein being popular examples.", "posttime": "2020-05-20 15:45:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "吐温,mark,契诃夫", "title": "这不是马克·吐温：错误引用是如何诞生的(2017)", "title_en": "That Wasn’t Mark Twain: How a Misquotation Is Born (2017)", "transed": 1, "url": "https://www.nytimes.com/2017/04/26/books/famous-misquotations.html", "via": "", "real_tags": ["吐温", "mark", "契诃夫"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002937, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由。在“技术”项下发表。到2020年，DR图像地图仍然有用，只是用于注解而不是导航。我从一项任务开始：如何在注释图像的同时防止注释遮挡图像。由于我们希望为图像的某些部分使用可交互区域，因此问题归结为在图像中标记这些区域。当然，在HTML中没有合适的方式来做到这一点，对吗？\n21世纪初，部分可点击的图像和图像驱动的导航栏的遥远记忆浮现在我的脑海中，但我很快就对此不屑一顾，认为这显然是你在2020年不会做的事情。然而，尽管SEO赔率很高，还是出现了一篇2004年关于使用图像地图进行注释的文章，这是对html图像注释的第一个搜索结果。\n图像地图是有趣和早期HTML功能(如&lt；marquee&gt；和&lt；blink&gt；)中鲜为人知的兄弟。图像地图最初是由Mosaic Web Browser的作者在1996年使用此RFC进行标准化的，其目的是允许用户通过单击图像中的不同区域来访问不同的文档。\n这篇文章引用了一句非常相关的话，如今(2004年！)我们已经在一定程度上远离了[Imagemaps]，文章继续展示了即使在当时，图像地图至少对于作者的注释库来说仍然是相关的。16年后，在这篇文章中，我们将再次同意这一假设，并重新实现我们自己的基于图像地图的图像注释。\n让我们从语法开始吧。Imagemap语法在语法上漂亮吗？我既不同意也不反对，而是让你来评判，展示一个完整的支持矩形的图像地图是什么样子：\n&lt；map name=&#34；interface-map&#34；&gt；&lt；Area Title=&#34；Top Controls&#34；Shape=&#34；RECT&#34；cocords=&#34；0，0,1024，84&#34；nohref=&#34；nohref&#34；alt=&#34；&#34；/&gt；&lt；Area Title=&#34；资源库&#34；&#34；/&gt；&lt；区域标题=&#34；编辑视图&#34；形状=&#34；坐标=&#34；280、80、744、349&#34；nohref=&#34；nohref&#34；alt=&#34；&#34；/&gt；&lt；区域标题=&#34；预览视图和图层属性&#34；形状=&#34；矩形。&lt；Area Title=&#34；回放和时间线控件&#34；Shape=&#34；RECT&#34；COCORDS=&#34；0,350,1024,419&34；nohref=&#34；nohref&#34；alt=&#34；&#34；/&gt；&lt；Area Title=&#34；Timeline Controls&#34；Shape=&#34；RECT&#34；COCOLS=&#。当然，至少在某种程度上，从2004年的最先进技术发展而来，我们知道拥有不受W3C标记验证服务铁腕控制的特权，并且需要当时所有必要的属性(HTML5规范也发生了变化)。我们现在可以完全删除href属性，而不是在&lt；area&gt；标记中拥有nohref=&#34；nohref&34；属性。非常出色!。\n然而，我们并没有从和弦的优雅属性中解脱出来。在现代CSS中，采用四个坐标形成矩形的属性(最突出的是边距和填充)坐标是按照上|右|下|左的顺序描述的(这里希望我不是唯一一个必须不断查找这些内容的人)。相反，要声明一个图像地图矩形，您需要按左|上|右|下的顺序。\n更令人兴奋的是，在CSS中绝对定位项目时，最后两个坐标可能不是您所期望的，右和下分别表示到右边缘和下边缘的距离。在图像地图中，这是站不住脚的。相反，水平坐标从左边缘开始计数，垂直坐标从顶部边缘开始计数。\n为了找到不同顺序背后的原因，我尝试查看我能找到的第一批CSS规范草案，并将它们的日期与图像映射RFC进行比较。这份1995年底的CSS W3C草案指定了与现在Web浏览器上使用的CSS坐标顺序相同的CSS坐标顺序，并且早于1996年的图像映射RFC。我看不出图像映射实现使用不同顺序的明显原因。\n在任何情况下，为现在事后看起来像是愚蠢的事情找理由对我的任务来说都是没有用的。往前走！\n实施起来并不是很困难。(A)查询页面以查找具有usemap属性的现有图像，(B)绝对构建(但相对于图像大小，明白吗？)。定位覆盖注释，(C)使它们在悬停时显示，我们几乎重新实现了2004年的库！哦，等等，响应性设计呢？我们忘了带电话(见鬼)！\n有了系统的(谢天谢地只有触摸设备)TouchStart事件，我们可以方便地为所有被触摸的注释添加一个额外的类。如果你想自己测试一下结果，可以在这里找到图片。\n我们从这一切中学到了什么，从中受益了什么？除了从本质上重新实现遗留功能的乐趣之外，没什么。然而，如果谷歌搜索引擎排行部的某个人找到了他们2002年的旧动态HTML，我们可能只会看到图片搜索引擎优化(SEO)对其他图片地图用户的影响。至少从经验上发现，图像地图上的链接会被跟踪，尽管图像本身仍然被视为一个整体，而不是被切割成碎片。这真的会发生吗(或者我们至少会在谷歌图片结果中得到一些令人兴奋的图片模板形状剪切动作)，可能不会。\n2020年的一位新的网络开发人员将不会在他们的互联网研究中学习图像地图，那么这仅仅是在没有充分理由的情况下滥用遗留的HTML3功能吗？嗯，不完全是。正如所确定的那样，图像地图在HTML5规范中仍然是一个完全受支持的特性(有一些修改和限制)，甚至MDN也没有提到该特性所谓的过时。当然，API看起来和感觉上有点过时，它的坐标与CSS标准不同，并且依赖于name属性，但另一方面，现代的hivemind似乎正走向语义HTML元素。带有特权&lt；map&gt；和&lt；area&gt；标记的图像地图就是一个很好的例子。\n然而，就其预期目的而言，图像地图的时代可能即将结束。例如，调整图像大小会破坏图像地图，因为它们依赖于不随图像缩放的固定绝对坐标，并且HTML5规范甚至取消了将坐标指定为百分比的功能。然而，一旦那些自动调整图片大小的响应性网站过时了，我们就会重新审视这一观点。\n还在这里？查看这个网站的视频编辑器，或者在Twitter上关注我们。或者离开，我想。", "note_en": "by   . published on   under  technical .  TL;DR image maps are still useful in 2020, but for annotation instead of navigation.  I started with a task: how to annotate an image while keeping the annotations from obstructing the image. Since we&#39;ll want to go with interactable regions for parts of the image, the problem boils down to marking those regions in the image. Surely there&#39;s no proper way to do this in HTML though, right?\n  A distant memory from the early 2000s of partially clickable images and image-driven navigation bars visited my mind, but I quickly dismissed it as obviously something you would not do in 2020. However, despite the SEO odds,  an article about annotating with imagemaps from 2004 popped up as the first search result for &#34;html image annotation&#34;.\n  Image maps are the less-remembered sibling of fun and early HTML features, like    &lt;marquee&gt; and   &lt;blink&gt;. Originally standardized by the work of the authors of Mosaic web browser with  this RFC in 1996, the purpose of image maps was to  allow users to access different documents by clicking different areas in an image.\n  Armed with a very relevant quote  We&#39;ve moved away from [imagemaps] to a certain extent these days (in 2004!!), the article goes on to demonstrate how even back then image maps were still relevant for at least for the author&#39;s annotation library purposes. Sixteen years later in this article, we&#39;re gonna agree with the presumption and reimplement our own imagemap-powered image annotations.\n  Let&#39;s begin with syntax. Is imagemap syntax syntactically beautiful? I neither agree nor disagree, but will instead let you be the judge by showing what a complete rectangle-powering imagemap looks like:\n  &lt;map name=&#34;interface-map&#34;&gt; &lt;area title=&#34;Top controls&#34; shape=&#34;rect&#34; coords=&#34;0,0,1024,84&#34; nohref=&#34;nohref&#34; alt=&#34;&#34; /&gt; &lt;area title=&#34;Asset library&#34; shape=&#34;rect&#34; coords=&#34;0,80,284,349&#34; nohref=&#34;nohref&#34; alt=&#34;&#34; /&gt; &lt;area title=&#34;Edit view&#34; shape=&#34;rect&#34; coords=&#34;280,80,744,349&#34; nohref=&#34;nohref&#34; alt=&#34;&#34; /&gt; &lt;area title=&#34;Preview view and layer properties&#34; shape=&#34;rect&#34; coords=&#34;740,80,1024,349&#34; nohref=&#34;nohref&#34; alt=&#34;&#34; /&gt; &lt;area title=&#34;Playback and timeline controls&#34; shape=&#34;rect&#34; coords=&#34;0,350,1024,419&#34; nohref=&#34;nohref&#34; alt=&#34;&#34; /&gt; &lt;area title=&#34;Timeline controls&#34; shape=&#34;rect&#34; coords=&#34;0,420,1024,519&#34; nohref=&#34;nohref&#34; alt=&#34;&#34; /&gt; &lt;/map&gt;   Of course, having evolved at least by some degree from the  2004 state of the art, we know hold the privilege of not being under the iron fist of W3C Markup validation service and needing all the attribute cruft that was necessary back then (also  the HTML5 spec changed). Instead of having a  nohref=&#34;nohref&#34; attribute in our  &lt;area&gt; tag, we can now  just drop the  href attribute altogether. Brilliant!\n  However, we&#39;re not saved from the elegance of the  coords attribute. In modern CSS, attributes that take four coordinates to form a rectangular shape (most prominently  margin and  padding) the coordinates are described in the order  top | right | bottom | left (here&#39;s hoping I&#39;m not the only who keeps having to look this up). Instead, to declare an imagemap rectangle, you&#39;ll need  left | top | right | bottom order.\n    To make matters even more exciting, the last two coordinates might not be what you&#39;d expect; when absolutely positioning items in CSS,  right and  bottom indicate the distance from the right and bottom edges respectively. In image maps, this holds no water. Instead,  both horizontal coordinates are counted from the left edge and vertical coordinates from the top edge.\n  To find the reasoning behind the different order, I tried looking into the first CSS specification drafts I could find and compare their date to the image map RFC. This  CSS W3C draft from late 1995 specifies the same CSS coordinate order that is being used on web browsers today, and is earlier than the image map RFC from 1996 I see no obvious reason why image map implementation would use different ordering.\n  In any case, finding reasoning for what in hindsight now feels like inanity was of no use in my mission. Onwards!\n  Implementation was not very difficult. ( a) Querying the page for existing images with the  usemap attribute, ( b) building absolutely (but relative to the image size, get it?) positioned overlay annotations, ( c) making them show up on hover, and we&#39;ve almost reimplemented the 2004 library! Oh wait, what about responsive design? We forgot the phones ( d for damnit)!\n    With the systematic (and thankfully touch-device only)  touchstart events, we we&#39;re able to conveniently add an extra class to all touched annotations. If you&#39;d like to test out the results yourself, the image is available  here.\n    What did we learn and benefit from all this? Other than the joy of essentially reimplementing legacy features, not much. However, if someone at Google&#39;s search engine ranking department finds their old copy of  Dynamic HTML from 2002, we might just be seeing an image SEO bump for the fellow imagemap users. At least  it was empirically discovered that links from image maps are followed, although the image itself is still treated as one and not cut to pieces. Will this actually happen (or will we at least get some exciting image stencil shape cutting action in Google images results), probably not.\n  A new web developer in 2020 will not be learning about imagemaps in their studies of the internet, so is this just misusing legacy HTML3 features for no good reason? Well, not quite. As established, image maps  remain in the HTML5 specification as a fully supported feature (with some modifications and restrictions), and even MDN makes no mention of the alleged obsoleteness of the feature. Sure, the API looks and feels a bit dated, with its coordinates differing from the CSS standard and reliance on the  name attribute, but on the other hand the modern hivemind seems to be heading towards semantic HTML elements. Image map with its privileged  &lt;map&gt; and  &lt;area&gt; tags is not a bad example of that.\n  However, for their intended purposes the time of imagemaps might just be over. For instance, resizing an image breaks the imagemaps since they rely on fixed absolute coordinates that do  not scale with the image, and the HTML5 spec even removed the ability to specify coordinates as percentages. However, we&#39;ll be revisiting this opinion once responsive websites with their ( gasp) automatically resizing images are out of fashion.\n  Still here? Check out  the video editor this site is all about or  follow us on Twitter . Or leave, I guess.", "posttime": "2020-05-20 15:15:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,图像,image", "title": "现在是2020年，我用的是图像地图", "title_en": "It's 2020 and I'm using image maps", "transed": 1, "url": "https://videoinu.com/blog/image-maps-in-2020/", "via": "", "real_tags": ["2020", "图像", "image"]}, {"category": "", "categoryclass": "", "imagename": "292e77722d527a24f7bdc4bd0000b052.jpg", "infoid": 1002935, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用于台式机的下一版Chrome正在形成一个比往常更大的更新。除了标签分组和自动屏蔽电池耗电广告外，该浏览器在安全性、安全性和隐私方面也得到了很大的改进。\n当更新到达谷歌通常的“未来几周”时间表时，用户将看到几个不同的新功能：用户界面改变，更多的检查以防止用户访问恶意网站(包括一个更主动的选项，可能会与谷歌共享更多数据)，更安全的DNS，以及隐形模式下的第三方cookie拦截。\n第一个也是最明显的更新是用户界面的更改。谷歌正在移动一些按钮和设置，以使它们更容易找到。Cookie设置、隐私设置、扩展和Google同步设置都变得更加突出，并且将变得更好、更清晰的描述性标签。\n谷歌在其平台上做了很多这样的设置调整，但这里的变化比以往更有意义，因为它们与谷歌和Chrome正在进行的几个问题有关。\n谷歌正在将其扩展菜单移至一个小拼图图标，默认情况下，该图标将出现在主工具栏中。该公司似乎认为，一些有很多扩展名的用户没有意识到你不需要有一大排扩展名。不过，更重要的是，谷歌已经开始了一项长期的努力，以清理Chrome的扩展，并使其更容易限制其权限。如果您愿意，您仍然可以将扩展名固定到工具栏。\n新的菜单不仅仅是让分机更容易找到。它们将更清楚地显示每个扩展的当前状态和权限，并使选择这些内容变得更容易。期待更多的变化来改善Chrome处理扩展的方式。它们是必需的：扩展很棒，但它们一直是恶意软件的传播媒介。即使对于专家来说，也很难跟踪所有的情况。\n下一个用户界面的变化是Google将cookie带到其设置菜单的顶层，这样可以更容易地调整它们。这不是一个大的改变，但这可能是谷歌开始教育其技术含量较低的用户什么是cookie以及为什么他们应该关注它们的一种方式。\n这是因为Chrome在完全屏蔽第三方Cookie方面走得很慢，其他浏览器如Safari和Firefox已经采取了这一举措。谷歌正在放慢行动，因为它认为屏蔽这些cookie现在破坏了太多的网站。\n然而，谷歌将开始屏蔽第三方cookie，但仅限于隐姓埋名模式。在隐姓埋名中，可能会有更多的人接受这样的事实，即事情可能会以隐私的名义被打破-而且它将有可能为每个隐姓埋名会话的第三方cookie提供一次性津贴。\n设置还将采用更突出的安全检查工具。该工具已经存在，但谷歌将对其进行扩展，提供一种检查已知密码泄露的方法。如果你使用Chrome的工具保存你的密码，如果你使用的任何网站最近遭到入侵，浏览器将能够警告你。它还会检查流氓扩展、Chrome更新，以及你是否打开了谷歌的安全浏览功能。\n如果你不熟悉，安全浏览是Chrome用来检测已知钓鱼网站的工具。它维护着这类网站的数据库，每隔半小时就会将它们发送给浏览器，这样当你访问某个网站时，Chrome就会弹出一个巨大的、适当可怕的警告。\n在下一个版本的Chrome上，谷歌将提供一个名为“增强安全浏览”的新选项。如果你打开它，你会实时分享你用谷歌访问的“不寻常”网站的URL。原因是谷歌发现，诈骗者注册和部署新的钓鱼网站的速度如此之快，以至于即使是对钓鱼数据库进行30分钟的刷新也不够快。\n谷歌表示，该工具还将与从你的个人Gmail和Drive账户中挑选出来的信息相结合。例如，如果Gmail检测到一封带有粗略链接的垃圾邮件，如果你碰巧点击它，这个工具会通知Chrome它是一个钓鱼网站。\n显然，与谷歌分享更多细节--特别是像你正在访问哪些网站这样的私密信息--应该会让你严重犹豫。该公司告诉我，一旦它的安全浏览算法确定你访问的URL是安全的，它就会将数据匿名化。然后，它最终会完全删除这些匿名数据，尽管还不清楚具体会有多长时间。\n最后，Chrome将效仿Mozilla，启用基于HTTPS的DNS-over-HTTPS，这是一种更安全的方式，让你的浏览器可以解析你输入的人类可读的URL和你正在访问的网站的实际IP地址。\n显然，谷歌正在与主要的互联网服务提供商合作，在支持的地方启用它，而不仅仅是让人们转向自己选择的安全DNS。但它也不是为每个人打开这个选项，因为基于https的DNS并非没有争议。正常情况下，DNS是明文发送的，这使得网络级过滤器更容易工作。例如，加密的DNS使父母应用程序的生活变得复杂得多。\n谷歌表示，Chrome将使用该公司维护的与您的ISP匹配的加密DNS提供商列表，如果没有加密选项，则会退回到默认DNS。如果打开了家长控制，它将在Windows中关闭，在看到企业设备管理策略的情况下，它也会关闭。\n就这样。但也很多。结合其他一些变化，下一版本的Chrome看起来像是很长一段时间以来最大的一次更新，这将使浏览器为Cookie和跟踪方面的更大变化做好准备。这一更新将像谷歌所有的更新一样：在接下来的几周内推出。", "note_en": "The next version of Chrome for desktops is shaping up to be a much bigger update than usual. In addition to tab grouping and automatically blocking battery-killing ads, the browser is also getting a big set of improvements for security, safety, and privacy.\n When the update arrives in Google’s usual “coming weeks” timeline, users will see new features that fall into a few different buckets: user interface changes, more checks to prevent users from visiting malicious websites (including a more proactive option that may share more data with Google), more secure DNS, and third-party cookie blocking in Incognito mode.\n The first and most obvious update is  user interface changes. Google’s moving some buttons and settings around to make them easier to find. Cookie settings, privacy settings, extensions, and Google sync settings are all becoming more prominent and will get better and clearer descriptive labels.\n Google does a lot of these settings shuffles on its platforms, but the changes here are more meaningful than usual because they are connected to several ongoing issues with both Google and Chrome.\n Google is moving its extensions menu to a little puzzle icon that will appear by default in the main toolbar. The company seems to think that some users with a lot of extensions aren’t figuring out that you don’t have to have a massive row of them. More importantly, though, Google has embarked on a long effort to clean up Chrome’s extensions and make it easier to restrict their permissions. You’ll still be able to pin extensions to the toolbar, if you like.\n   The new menu will do more than make extensions easier to find. They’ll more clearly show each extension’s current state and permissions and make it easier to chose those things. Expect more changes to improve how Chrome handles extensions going forward. They’re needed: extensions are great, but they’ve always been a vector for malware. Even for experts, it’s hard to keep track of it all.\n The next UI change is that Google is bringing cookies out to the top level of its settings menu where it’ll be easier to adjust them. This isn’t a big change, but it might be a way for Google to start educating its less-technical users on what cookies are and why they should pay attention to them.\n That’s because Chrome is on the  slow road to fully blocking third-party cookies, a move other browsers like  Safari and Firefox have already taken. Google is moving slower because it thinks blocking those cookies breaks too many websites right now.\n   However, Google  will begin  blocking third-party cookies but only in Incognito mode. In Incognito, there may be more of an acceptance that things could break in the name of privacy — and it will be possible to grant one-time allowances for third-party cookies for each Incognito session.\n Settings will also feature a more prominent  Safety Check tool. That tool already exists, but Google will expand it with a way to check for known password breaches. If you use Chrome’s tools for saving your passwords, the browser will be able to warn you if any site you use has had a recent breach. It’ll also check for rogue extensions, Chrome updates, and whether you have Google’s Safe Browsing feature turned on.\n   If you’re not familiar, Safe Browsing is Chrome’s tool for detecting known phishing sites. It maintains a database of such sites and sends them out to browsers as often as every half-hour so that when you visit one, Chrome will pop up a huge, appropriately scary warning.\n On the next version of Chrome, Google will offer a new option called  Enhanced Safe Browsing. If you turn it on, you’ll be sharing the URL of “uncommon” websites you visit with Google in real time. The reason for that is Google is finding that scammers are registering and deploying new phishing websites at such a rapid pace that even a 30-minute refresh on a phishing database isn’t fast enough.\n Google says this tool will also combine with information culled from your personal Gmail and Drive accounts. For example, if Gmail detected a spam email with a sketchy link, this tool could inform Chrome that it’s a phishing site if you happen to click on it.\n Obviously, sharing yet more detail with Google — especially something as private as what websites you’re visiting — should give you serious pause. The company tells me that, as soon as its Safe Browsing algorithm determines the URL you’re visiting is safe, it will anonymize the data. Then, it will eventually delete that anonymized data entirely, though it’s not clear exactly how long that will be.\n   Lastly, Chrome will  follow Mozilla in  enabling DNS-over-HTTPS, a more secure way for your browser to resolve the human-readable URL you type in and the actual IP address of the site you’re visiting.\n Google is apparently working with major ISPs to turn it on where supported rather than just flipping people over to a secure DNS of its own choosing. But it’s also not turning this option on for everybody because DNS-over-HTTPs  isn’t without controversy. Normally, DNS is sent in the clear, which makes it easier for network-level filters to work. Encrypted DNS makes life for parental apps much more complicated, for example.\n   Google says that Chrome will use a list of encrypted DNS providers that the company maintains to match to your ISP, then fall back to default DNS if it doesn’t have an encrypted option. It will be turned off in Windows if parental controls are turned on, and it’ll also turn it off in cases where it sees enterprise device management policies.\n That’s it. But it’s also a lot. Combined with some of the other changes, the next version of Chrome looks like the biggest update in a long while, one that sets the browser up for the bigger changes to cookies and tracking yet to come. The update will roll out just as all of Google’s updates do: over the coming weeks.", "posttime": "2020-05-20 14:59:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,收到,ton,谷歌", "title": "Chrome很快就会收到一大堆重大的安全和安全更新", "title_en": "Chrome is getting a ton of big safety and security updates soon", "transed": 1, "url": "https://www.theverge.com/2020/5/19/21262923/google-chrome-privacy-security-safe-browsing-cookies-dns-https-extensions", "via": "", "real_tags": ["chrome", "收到", "ton", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "e21e09533e1794f43f6532c9f8b20d49.png", "infoid": 1002934, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Python是一种通用编程语言。我们可以将Python用于如此多的应用程序，包括Web应用程序。框架是模块或包的集合，它有助于编写Web应用程序或帮助开发Web应用程序。在使用框架时，我们不必担心协议、套接字、线程管理等底层细节。\n框架通过提供应用程序开发的结构，使开发人员的生活变得更智能、更容易。它们自动化了通用解决方案的实现，这为开发人员提供了灵活性，使他们可以只关注应用程序逻辑，而不是例行公事。它们提供通用的后端、快速、可靠、可伸缩、易于维护的Web应用程序。\n当你点击其他链接时，URL映射机制停留在同一个网页上。\n输入到表单中的数据需要采用正确的格式，并且某些字段是有效使用表单所必需的。\n对象关系映射器-它是一个代码库，可以自动将数据传输到关系数据库表中，并转换为应用程序中最常用的对象。\n针对跨站点的Web安全需要伪造，也称为CSRF、SQL注入、跨站点脚本等常见的恶意攻击。\n开放源码将会是公开的，库和框架我们有不同的规则和规定。\n许多试图用Python构建Web应用程序的人都会选择Django框架，这样他们就可以在更短的时间内以最好的质量构建复杂的代码。Django根据Web发展的趋势相对改变了它的功能。Django的几个主要功能包括：\n数据库模式迁移，常用数据库如PostgreSQL、MySQL、SQLite、Oracle下的第三方驱动程序。\n金字塔是铁塔项目的一部分，是Python语言中最灵活的框架之一。这个框架允许开发人员选择任何东西--DBMS、URL结构、模板样式等等。\nWeb2Py是一个开源的免费软件。它允许调试器和代码编辑器与部署工具一起编辑和调试代码。它使开发人员能够通过Web浏览器开发、修改、部署和管理Web应用程序。\n引入Flask的主要动机是构建一个强大的Web应用程序。所有的大公司都在使用烧瓶，因为它又快又安全。\n它通常被称为小规模的微型框架作品。(工业和信息化部电子科学技术情报研究所陈皓)。它主要关注Web API，并试图将所有内容捆绑到单个文档中。除了python标准库之外，它没有任何依赖项。\n单个源文件最初是用来构建API的，这意味着所有内容都在单个源文件中。\nCherryPy是一个非常流行的框架，它嵌入了自己的多串服务器。CherryPy包括一个池化的Web服务器、设置框架和模块框架。\n每年都有许多Python框架发展出新的特性和功能，尽管它们各有优缺点。开发人员根据他们的任务使用许多框架，因为每个开发人员都有不同的编码风格和偏好。\n到目前为止，根据趋势，最受欢迎的框架是Django，因为使用Django的企业数量相当多。Django的特性和特征类似于许多行业的业务需求，这可能是它流行的原因。查找更多信息，了解为什么应该为您的下一个项目选择Django。\n金字塔可以灵活地用于小型到企业级公司。金字塔中唯一的冲突是它有很多选择，这在开始项目之前造成了严重破坏。烧瓶通常被开发人员使用，因为它通常用于喷气速度较快的小型行业。合适的框架将始终适合您的业务需求。您必须考虑应用程序的主要议程、预算、时间，然后决定启动应用程序的框架类型。\n您想要找到并实现最好的Python框架吗？联系我们的定制软件开发公司。\n相关文章。\n订阅并随时更新我们在Django、Python、Machine Learning、Amazon Web Services、DevOps、Salesforce、ReactJS、AngularJS、Reaction Native上的网络研讨会、新闻和文章。", "note_en": "Python is a general-purpose programming language. We can use python for so many applications and including web applications. Framework is a collection of modules or packages, which helps in writing a web application or helps in developing a web application. We don&#39;t have to worry about low level details such as protocols, socket, thread management when working with a framework.\n Framework makes the developer’s life smarter and easier by giving a structure for application development. They automate the implementation of common solutions, which gives flexibility to developers to focus only on app logic instead of routine. They provide common backend fast reliable and scalable easily maintainable web applications.\n    Mechanism of URL mapping is staying at the same web page when you click on some other link.\n  The data entered into a form needs to be in the right format, and certain fields are mandatory for effective use of form.\n    Object relational mapper - It is a code library that automates the transfer of data into a relational database table into objects that are most commonly used in an application.\n  Web security against the cross site required forgery also known as a CSRF SQL injection cross-site scripting and other common malicious attacks.\n      Open source code is going to be public, library and framework we have different rules and regulations.\n      Many people who try to build a web application in python will opt for Django framework so that they can build a complex code in less time with best quality. Django change it’s functionality comparatively according to the trends in the web development. Few key features of Django are:\n Database schema migrations ,common database like PostgreSQL, MySQL , SQLite, Oracle under the third party drivers.\n  Pyramid is a part of Pylon project; it is one of the most flexible frameworks in Python language. This framework allows the developer to choose anything - DBMS, URL structure, template styles and much more.\n   Web2Py is an open source and free of cost. It allows debugger and code editor for editing the code and debugging the code accompanied with a deployment tool. It enables developers to develop, revise, deploy and manage web applications via web browsers.\n   The main motive for introducing flask is to build a strong web application. Flask is being used by all big companies as it fast and secure.\n   It is popularly known as small-scale microframe works. It mainly focuses on Web API’s and it tries to bundle everything in a single document. It has no dependencies apart from the python standard library.\n Single source file originally it was meant for building apis, which means everything in a single source file.\n  CherryPy is a popular framework that embeds its very own multi-strung server. CherryPy includes a pooled web server, set up framework and module framework.\n  There are many python frameworks evolving every year with new features and functionality despite of their pros and cons. Developers use many frameworks depending on their task because every developer has different style of coding and preferences.\n By far, the most popular framework according to the trends is Django because the count of enterprises using Django is pretty high. Django features and characteristics are similar to the business requirements of many industries that might be the reason behind it’s popularity. Find more information  why should choose django for your next project\n Pyramid is flexible to use for small to enterprise level companies. The only conflict in Pyramid is that it has many options, which creates a havoc before starting the project. Flask is commonly used by developer’s because it is mostly commonly used for small industries with jet speed. The suitable framework will always suit your business needs. You have to consider the main agenda of your application, budget, time and then decide the framework type to start your application.\n Do you want to find and implement the best python framework? Contact our  Custom Software Development Company\n    RELATED ARTICLES\n    Subscribe and Stay Updated about our Webinars, news and articles on Django, Python, Machine Learning, Amazon Web Services, DevOps, Salesforce, ReactJS, AngularJS, React Native.", "posttime": "2020-05-20 14:44:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,python,framework,web", "title": "哪个是最好的Web开发Python框架？", "title_en": "Which is the best Python framework for web development?", "transed": 1, "url": "https://micropyramid.com/blog/which-is-the-best-python-framework-for-web-development/", "via": "", "real_tags": ["开发", "python", "framework", "web"]}, {"category": "", "categoryclass": "", "imagename": "355b8a3a407a125fda848e2305d5ba3a.jpg", "infoid": 1002933, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你可以在这里尝试米切尔·李所见过的最非凡的谜题之一：https://cracking-the-cryptic.web.app/sudoku/tjN9LtrrTL▶*NEW*CRACKI.", "note_en": "You can try one of the most extraordinary puzzles we've ever seen by Mitchell Lee here: https://cracking-the-cryptic.web.app/sudoku/tjN9LtrrTL ▶ *NEW* CRACKI...", "posttime": "2020-05-20 14:43:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "视频,sudoku,米切尔", "title": "奇迹数独[视频]", "title_en": "The Miracle Sudoku [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=yKf9aUIxdb4", "via": "", "real_tags": ["视频", "sudoku", "米切尔"]}, {"category": "", "categoryclass": "", "imagename": "664e684556e6a1d5f4913f24836fb8ad.jpg", "infoid": 1002932, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论你是歌鸟般的嗓音，还是像搅拌机里的滚珠轴承一样的声音，唱歌都能产生一些非常积极的效果。\n在密歇根州底特律的圣马西·梅西·利沃尼亚医院(St Marcy Mercy Livonia Hospital)早班换班期间，医务人员感到疲惫。他们的手术层被改成了为冠状病毒患者服务的科室，情绪低落。\n护士Lori Marie Key被问及是否愿意在上午的简报会上为她的同事演唱《奇异的恩典》。她就是这么做的。当她的声音飙升时，她的一位护士同事拍下了她的视频，放到了网上，并在网上疯传。\n那一刻的团结和团结让歌曲的力量人格化了很多。但这不仅仅是一些抽象和空灵的事情发生，歌唱感觉良好是有科学原因的。\n也许这就是为什么，当世界上大多数地区为了遏制冠状病毒大流行而进入封锁状态时，有无数人转向歌曲作为慰藉的例子。意大利人在阳台上绑着咏叹调，著名音乐家在起居室里举行迷你音乐会，合唱团在网上参加会议，成为虚拟的演奏家。\n墨尔本大学心理科学学院院长、临床神经心理学家萨拉·威尔逊(Sarah Wilson)说，当我们唱歌时，我们大脑的很大一部分会因活动而“亮起来”。她领导了一项研究，通过让不同发声能力的志愿者在颤抖时进行MRI扫描，观察我们唱歌时大脑的反应。\n威尔逊说：“大脑中有一个歌唱网络，分布相当广泛。”不出所料，当我们说话时，大脑处理语言的半球就会亮起来。然而，当我们唱歌的时候，两边的大脑都会迸发出生命的火花。\n“我们也看到大脑的情感网络参与其中，”威尔逊补充道。控制我们产生声音和发音所需动作的区域也会变亮。\n歌唱所涉及的体力消耗-充盈我们的肺部，牢牢控制我们的声带，我们的嘴巴和身体的运动-是歌唱可以提振我们情绪的原因之一。世界音乐疗法联合会(World Federation Of Music Treatment)东南亚地区负责人白沙利·慕克吉(Baishali Of Mukherjee)表示，唱歌是一种有氧运动，可以释放内啡肽，这是大脑中让人感觉良好的化学物质。\n“内啡肽与整体提升的幸福感有关，它给人一种愉悦的感觉，所以它都与压力的减轻有关，”她说。“在任何情况下，无论是在压力下，还是在身体疾病、疾病、心理匮乏的情况下，音乐都有可能影响我们的身心。”\n慕克吉说，并不令人惊讶的是，心情好有各种各样的好处。“当你情绪高涨时，你会[增强]你的免疫系统…。，你会以更积极的方式应对压力因素，[并]改善睡眠模式。“。\n任何经历过恐慌症发作的人都会对无法喘息的可怕感觉再熟悉不过了。这种短暂而浅的呼吸会导致血液中二氧化碳的减少，因为你排出的气体比你的细胞产生的更多。二氧化碳的这种不平衡会导致头晕和焦虑等症状。相反，深呼吸或横膈式呼吸可以在肺细胞中进行充分的氧气交换，激活身体的副交感神经系统，从而减缓心率，扩张血管，从而降低血压。\n虽然深呼吸在治疗实践中的使用由来已久，但其背后的神经生理学直到最近才被探索。在最近的一项研究中，研究人员发现，专注于控制呼吸频率-唱歌的一项关键技能-激活了大脑中与情绪、注意力和身体意识相关的部分。\n是也不是。在墨尔本大学萨拉·威尔逊的研究中，歌手按能力分组--专业歌手、日常(或淋浴)歌手和那些认为自己不好的歌手。\n当扫描非歌唱者时，研究人员发现他们只是使用语言大脑网络来唱歌，而根本没有冒险进入他们的歌唱网络。\n但威尔逊说，当扫描每天或“淋浴”的歌手和专业歌手时，“我们发现大脑的歌唱和语言网络之间的差异越来越大”。所以，你唱得越好，你的专业歌唱网络就越明显。\n威尔逊说：“当我们练习和参与唱歌时，我们正在做的是发展这个专门的网络，它给我们带来生理上的奖励，让我们感到发冷，释放多巴胺，感觉很好。”我们唱得越多，我们大脑中的这个网络就越发达，感觉就越好。\n虽然歌唱本身激活了我们身体和大脑中的几个东西，但当我们与他人一起参与其中时，它又增加了一个层面。\n威尔逊的团队即将开始一项新的研究，研究音乐如何创造一种团结的感觉。“这个词是kama muta，”威尔逊说，他指的是一个梵语短语，意思是“被爱感动”。这是当你听到一首美妙的歌曲时会起鸡皮疙瘩，或者是当你第一次抱着你的新生儿时，泪水顺着你的脸滚落下来。在音乐的背景下，这项研究将着眼于“它是如何将这种共同分享的感觉汇聚在一起的”。\n威尔逊说：“有证据表明，总的来说，合唱可以增强我们的同理心和社会关系。”“我们在…足球俱乐部看到了这一点。(和)人们在教堂的会众中[唱歌]。这是一项社区建设活动，因为我们的声音是一致的。“。\n除了内啡肽在你体内奔跑，我们唱歌时释放的另一种荷尔蒙是催产素。慕克吉解释说，催产素在增强人与人之间的连通感方面有很强的作用。\n“(它)通常与母乳喂养和性行为有关，”她说。“还有一个非常有力的研究领域支持这种特殊的神经肽…。.被认为在增进人与人之间的联系和信任方面发挥了作用。“。(尽管一些研究人员怀疑催产素在信任中的作用，但最近的研究表明，催产素可以影响我们对他人信息的重视程度。)。\n这种将人们凝聚在一起的力量使歌唱在前所未有的全球形势给我们许多人留下了一丝陌生和不安的情绪的时候变得特别有力。\n伦敦大学学院的人类学家杰罗姆·刘易斯(Jerome Lewis)说：“歌曲或音乐能够捕捉到的东西，超出了我们通常在理性、有逻辑的头脑中所能表达的东西。”“它提供了一个探索快乐、困难和悲伤的机会--各种不同的情感空间，有时很难通过一系列字面上的、逻辑上的、连续的词语进入。”\n刘易斯花了许多年的时间研究中非共和国的偏远狩猎采集部落-特别是巴亚卡人。通过他的作品，他研究了巴亚卡是如何将歌曲不作为一种表演行为，而是一种深度交流的行为。\n巴亚卡社区没有领导人，没有男领队或女领队。他们的演唱来自于一个相互联系的地方，反映了社会等级制度的缺乏。\n在没有任何组织的情况下，他们的演唱充满了复调，但每个成员都必须创造自己的和声，并在歌曲中找到自己的位置。刘易斯说：“在唱歌时学会这样做可以培养一种特别的个人自主感。”“一个不自私或自我陶醉，但敏锐地意识到别人在做什么的人。\n“米兰那种从阳台到阳台的演唱非常动人，非常优美，因为它是如此平等主义。通过与他们周围公寓里的所有其他人分享这种情绪，就有了一种超越任何等级制度的社区感。…。所有的声音都是平等的。“。\n许多人在合唱团中找到了自己的声音，最近的活动中，一些团体组织了在线合唱团会议，即使是最偏远的歌唱爱好者也能接触到这种集体演唱。\n其中一个这样的团体是澳大利亚的酒吧合唱团，顾名思义，它是一个开放的团体，在冠状病毒出现之前，它会聚集在酒吧里，在简单的三声部和声中学习一首歌。虽然在大流行封锁之前，这些活动已经非常受欢迎，往往吸引了多达1500人，但将酒吧合唱团变成虚拟沙发合唱团，任何时候都有来自45个国家的多达6000人参加。就像酒吧版一样，没有会员资格，也没有试镜过程。你只需学习所选歌曲的一部分，然后拍摄自己的演唱即可。\n创始人兼导演阿斯特丽德·乔根森(Astrid Jorgensen)说：“这不是关于音乐的完美，而是关于合作。”她笑着说：“我们处理的数字太大了，如果你错过了一张纸币，其他人就会收到。”\n她说，效果是显著的。“当人们提交视频时，他们可以留言，”她说。“这几乎就像一个忏悔室。几乎每个人都会留下这样的心里话。“\n她回忆起他们从纽约一位急诊室医生那里得到的一条信息，这位医生刚刚结束了14小时的轮班，感觉特别沮丧。为了寻求喘息的机会，医生决定唱歌。乔根森说：“他们认为只要用声音坐五分钟就可以了，这让一切都感觉轻松了一点。”\n她补充说，观看人们发送的视频给人带来了“压倒性的希望”。“人们觉得在家里独自唱歌有点傻，但然后微笑着希望这能创造出一件美丽的艺术作品。”这是非常令人高兴的。“。\n除了简单的快乐，莎拉·威尔逊认为唱歌是“我们生理构成的基础”，并认为唱歌甚至可能先于讲话。\n“当我们学习唱歌的时候，我们不仅仅是学习唱歌，”她说。“我们了解使我们成为人类独一无二的东西，并洞察大脑的发展方式，为什么它会发展成现在的样子，它是如何发展的，以及我们为什么坚持音乐。”\n就像中非共和国的巴亚卡部落一样，一起唱歌是一种最原始的交流方式-一种没有等级制度或现代生活中说话的复杂性的方式。\n“我们正处于大流行中，我们该怎么办？”威尔逊说。“我们追溯到这些[天生的]东西的根源，这些东西给我们带来了联系和力量。还有什么比隔着阳台唱歌更好的方式呢？“。\n通过在Facebook上为我们点赞加入100万未来粉丝，或者在Twitter或Instagram上关注我们。\n如果你喜欢这个故事，可以注册bbc.com每周专题时事通讯，名为“基本清单”(The Essential List)。精选BBC《未来》、《文化》、《职场生活》和《旅行》中的故事，每周五发送到您的收件箱。", "note_en": "Whether you have the voice of a songbird or sound like some ball-bearings in a blender, singing can have some remarkably positive effects.\n During a morning shift change at St Marcy Mercy Livonia Hospital in Detroit, Michigan, the medical staff were feeling weary. Their surgical floor had been converted into a department for coronavirus patients and spirits were low.\n Nurse Lori Marie Key was asked if she would sing Amazing Grace for her colleagues during the morning briefing.  So she did. As her voice soared, one of her fellow nurses filmed her, put it online and it went viral.\n There was something about the solidarity and togetherness of that moment that personifies a lot about the power of song. But it wasn’t just something abstract and ethereal happening, there are scientific reasons for why singing feels good.\n   Perhaps that’s why, as most of the world went into lockdown to contain the Covid-19 pandemic, there were countless examples of people turning to song as solace.  Italians belted arias from their balconies, famous musicians performed  mini concerts from their living rooms and choirs took their sessions online to become  virtual virtuosos.\n  When we sing, large parts of our brain “light up” with activity, says Sarah Wilson, a clinical neuropsychologist and head of the School of Psychological Sciences at the University of Melbourne. She  led a study which looked at how the brain reacts when we sing by giving volunteers of varying vocal ability MRI scans as they warbled.\n “There is a singing network in the brain [which is] quite broadly distributed,” Wilson says. When we speak, the hemisphere of the brain dealing with language lights up, as we might expect. When we sing, however, both sides of the brain spark into life.\n “We also see involvement of the emotion networks of the brain,” adds Wilson. Regions that control the movements we need to produce sounds and articulation also light up.\n  The physical exertion involved in singing – filling of our lungs, the firm control of our vocal chords, the movements of our mouth and body – is among the reasons why it can boost our mood. Singing is an aerobic exercise which sees the release of endorphins, the brain’s ‘feel-good’ chemicals, says Baishali Mukherjee, the Southeast Asia regional liason for the World Federation of Music Therapy.\n “Endorphins [are] related to an overall lifted feeling of happiness, it gives a feeling of euphoria so it’s all associated with a reduction in stress,” she says. “In any situation whether it is under stress or [with] any physical ailments, illness, psychological deprivation, music has the potential to affect our body and mind.”\n  And not surprisingly, being in a better mood has all sorts of benefits says Mukherjee. “When your mood is up, you  [strengthen] your immune system…, you respond to stress factors in a more positive way [and] enhance sleep patterns.”\n  Anyone who has ever experienced a panic attack will be all too familiar with the terrifying feeling of not being able to catch your breath. This  short, shallow breathing leads to a  decrease in carbon dioxide in the bloodstream as you expel more of the gas than your cells make. This imbalance in carbon dioxide can cause dizziness and anxiety among other symptoms. Conversely, deep or diaphragmatic breathing allows a full oxygen-exchange to occur in the lung’s cells, activating the body’s parasympathetic nervous system which then slows the heart rate and dilates the blood vessels which lowers your blood pressure.\n While deep breathing has long been used in therapeutic practices, the neurophysiology behind it has only recently been explored. In a recent study, researchers found that  focusing on controlling your rate of breathing – a key skill in singing –  activates parts of the brain that are linked to emotion, attention and body awareness.\n   Well, yes and no. In Sarah Wilson’s study at the University of Melbourne, singers were grouped by ability – professional singers, everyday (or shower) singers and those who didn’t think they were any good.\n When the non-singers were scanned, the researchers found they were only using their language brain network to sing, and didn’t venture into their singing networks at all.\n  But when the everyday or “shower” singers and professional singers were scanned “we saw increasing differentiation between the singing and the language networks of the brain”, Wilson says. So, the better you are at singing, the more pronounced your specialised singing network.\n “What we are doing when we practise and engage in singing is developing this specialised network, which gives us that physiological reward hit, the chills, the dopamine release, the sense of feeling good,” says Wilson. The more we sing, the more we develop this network in our brains, and the better it feels.\n While the act of singing in itself activates several things in our bodies and brains, when we engage in it with others, it adds another layer to this.\n Wilson’s team is about to embark on a new study looking at how music creates a feeling of unity. “The term is  kama muta,” Wilson says, referring to a Sanskrit phrase meaning “moved by love”. It’s the goosebumps you get when hearing a beautiful song, or the tears that roll down your face when you hold your newborn baby for the first time. In the context of music, this study will look at “how it brings together this sense of communal sharing”.\n  “There is evidence that, in general, singing in a group  enhances our sense of empathy and social connection,” says Wilson. “We see this at football clubs… (and) people [singing] in congregations at church. It’s a community-building activity because we’re united in our voice.”\n As well as endorphins racing through your body, another hormone released when we sing is oxytocin. Mukherjee explains that oxytocin has a powerful effect in enhancing a feeling of connectedness between people.\n “[It] is often related to breastfeeding as well as sexual activity,” she says. “There is also a very strong area of research that supports that this particular neuropeptide….is believed to play a role in increasing bonds and  trust between people.” (Although some researchers doubt  oxytocin’s role in trust, more recent research has shown it can influence how  much value we place on information from others.)\n  This power to bond people together makes singing particularly potent at a time when an unprecedented global situation has left many of us with glimpses of unfamiliar and uneasy emotions.\n “Song or music is able to capture something that goes beyond what we would normally be able to articulate in our rational, logical minds,” says Jerome Lewis, an anthropologist at University College London. “It provides an opportunity for exploring joyful, difficult, sad – all sorts of different emotional spaces which are sometimes difficult to access through a literal, logical, sequential series of words that build up.”\n  Lewis has spent many years studying remote hunter-gatherer tribes in the Central Africa Republic – specifically the  BaYaka people. Through his work,  he has examined how BaYaka use song not as a performative act but one of deep communication.\n There are no leaders in the BaYaka community, no frontmen or women. The singing they do comes from a  place of connectedness that mirrors the lack of social hierarchy.\n Without any organisation, their singing is dense with polyphony, yet each member must create their own harmony and find their place in the song. “Learning to do this when singing cultivates a particular sense of personal autonomy,” says Lewis. “One that is not selfish or self-obsessed, but is keenly aware of what others are doing.\n “The type of singing that was done in Milan from balcony to balcony, was so moving and beautiful because it was so egalitarian. By sharing that emotion with all the other people in the flats around them there was a sense of community which was beyond any hierarchy… all voices are equal.”\n  Many people find their voice in a choir and recent events have seen some groups  organise online choir sessions, making this kind of group singing accessible to even the most remote singing enthusiast.\n  One such group is the Australia-based  Pub Choir which, as the name suggests, is an open group that, before Covid-19 emerged, would gather in pubs and learn a song in simple three-part harmony. While the sessions were already extremely popular prior to the pandemic lockdown, often attracting up to 1,500 people, turning Pub Choir into the virtual Couch Choir has seen up to 6,000 people across 45 countries take part at any one time. Like the pub version, there is no membership and no audition process. You simply learn a part of the chosen song and film yourself singing along.\n “It’s not about musical perfection, it’s about collaboration,” says founder and director, Astrid Jorgensen. “The numbers that we’re dealing with are so large if you miss a note someone else will have got it,” she laughs.\n  And the effect, she says, has been remarkable. “When people submit their video they can leave a message,” she says. “It’s almost like a confessional. Pretty much everybody leaves such a heartfelt comment.”\n She recalls one message they got from an emergency room doctor in New York who had just finished a 14-hour-shift and was feeling particularly despondent. Looking for some reprieve, the doctor decided to sing. “They thought they’d just sit with their voice for five minutes and [said] it made everything feel a little bit easier,” Jorgensen says.\n Watching the videos that people send in gives “an overwhelming sense of hopefulness” she adds. “People feeling a little bit silly singing at home alone but then smiling and hoping that this creates a beautiful piece of art. It’s very joyful.”\n  Beyond simple joy, Sarah Wilson argues that singing is “fundamental to our biological makeup” and believes that it may have even preceded speech.\n “When we study singing, we don’t just learn about singing,” she says. “We learn about things that make us uniquely human and gain insights into the way the brain develops, why it developed the way it has, how it develops and why we’ve held onto music.”\n Like the BaYaka tribes of the Central African Republic, singing together is a primal way to communicate – one without hierarchy or the complexities of speech in modern life.\n “We are in a pandemic and what do we do?” says Wilson. “We go back to these roots of [the] innate things that bring us connection and strength. What better way to do this than to sing across balconies.”\n  Join one million Future fans by liking us on   Facebook , or follow us on   Twitter  or   Instagram .\n If you liked this story,   sign up for the weekly bbc.com features newsletter , called “The Essential List”. A handpicked selection of stories from  BBC Future,  Culture,  Worklife, and  Travel, delivered to your inbox every Friday.", "posttime": "2020-05-20 14:42:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "减压,accessible,唱歌", "title": "唱歌是最容易得到的减压方式。", "title_en": "Singing is the most accessible stress reliever", "transed": 1, "url": "https://www.bbc.com/future/article/20200518-why-singing-can-make-you-feel-better-in-lockdown", "via": "", "real_tags": ["减压", "唱歌"]}, {"category": "", "categoryclass": "", "imagename": "db611ddd789c5d89fe3f435e964b86e4.jpg", "infoid": 1002931, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在黑暗模式和网站重新发现替代样式表的价值的新时代，现在是提出一个小的16x16像素问题的好时机。\n如果您的网站有一个收藏图标，请确保该徽标可以在各种背景颜色中区分开来。我不是色彩专家，但要做到这一点，最简单的方法是使用任何形状的彩色背景和相反的前景色。无论是灯光下的黑暗还是黑暗中的灯光。通过这样做，您将有一个标准的画布来展示您的徽标。永远不要依赖这个系统的背景。", "note_en": "In the new era of &#34;Dark Mode&#34; and website&#39;s rediscovering the value of alternative stylesheets, it&#39;s a good time to mention a small 16x16 pixel problem.\n  If your website has a favicon, please make sure the logo is distinguishable in a variety of background colours. I&#39;m no colour guru but the easiest way to do this is to use a coloured background of any shape with an opposing foreground colour. Be it dark on light or light on dark. By doing this, you&#39;ll have a standard canvas to present your logo. Never rely on the system&#39;s background.", "posttime": "2020-05-20 14:27:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "喜欢,outline,背景", "title": "勾勒出你最喜欢的图标", "title_en": "Outline Your Favicon", "transed": 1, "url": "https://jahed.dev/2020/05/20/outline-your-favicon/", "via": "", "real_tags": ["喜欢", "outline", "背景"]}, {"category": "", "categoryclass": "", "imagename": "899d7a3544f0e8274dbaba8dcc5146d9.jpg", "infoid": 1002930, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山--硅谷投资者马克·安德森(Marc Andreessen)上个月发表了一条战斗口号，迅速在科技行业引起反响。在报告中，他将美国对冠状病毒的悲观反应归咎于“沾沾自喜的自满、对现状的满足和不愿建设”。\n他提出了一个完全符合硅谷独创性精神的解决方案。他说，现在是时候建造一些东西了，比如大学、医院、摩天大楼、零排放核反应堆、送货无人机、超级回路，甚至埃隆·马斯克(Elon Musk)的“外星无畏战机”。\n“建设是我们重启美国梦的方式，”安德森在他的帖子中写道，他的帖子标题是“建设的时候到了”。\n这是一次鼓舞人心的战斗号召。但自那以后，安德森和其他硅谷风险资本家争相帮助打造的第一件东西是完全不同的东西：一款名为Club house的应用程序。\nClub house是一款社交媒体应用程序，风险资本家们在这里聚集在一起，在他们被隔离在家里时相互交流。目前，这款应用只接受邀请，而且很流行：似乎每个被允许加入早期测试版的人，从MC Hammer这样的名人到DeRay Mckesson这样的活动家，都发了推文。最近，这是硅谷风险投资中心沙山路(Sand Hill Road)上最热门的交易之一。\n上周，安德森的风险投资公司安德森·霍洛维茨(Andreessen Horowitz)赢得了投资俱乐部的交易。一位知情人士说，安德森·霍洛维茨(Andreessen Horowitz)同意投入1000万美元，外加200万美元从俱乐部现有股东手中购买股票。由于细节是保密的，这位知情人士拒绝透露姓名。\n这笔融资对今年开始、拥有两名员工的会所的估值接近1亿美元。福布斯早些时候报道了这笔交易。\n安德森·霍洛维茨(Andreessen Horowitz)的合伙人安德鲁·陈(Andrew Chen)在Twitter上说，他把安德森的“建设时间”解读为打造更多的东西，包括“新的游戏玩家、社交应用、健身等等！”\n对会所的投资热潮反映了硅谷的运作方式。虽然尖端技术和改变世界的使命是至高无上的，但近几十年来的大部分巨额资金最终都来自令人上瘾的社交媒体应用程序。因此，当谈到创建新事物时，硅谷经常求助于它所知道的-那就是更多的社交网络。\n光速风险投资公司(LightSpeed Venture Partners)的投资者杰里米·刘(Jeremy Liew)表示，最近几周，他的公司和“硅谷大部分人”都与俱乐部的创始人进行了交谈。他说，这款应用程序“在风投和创业者中获得了一些早期的吸引力，这无疑是为什么一些公司倾向于参与进来的原因。”他补充说，LightSpeed没有寻求投资。“他们从自己的正面经历中总结出来。”\n安德森·霍洛维茨拒绝就安德森的文章以及与俱乐部投资的任何联系置评。安德森、陈和他们的伴侣本·霍洛维茨(Ben Horowitz)一直是这款应用中的常客。上周，霍洛维茨回答了俱乐部用户关于他的烧烤技巧和最喜欢的就餐地点的问题，并补充说，他对这款应用的创始人建立的东西印象深刻。\n保罗·戴维森(Paul Davison)与前谷歌工程师罗汉·塞斯(Rohan Seth)共同创立了俱乐部，他拒绝置评。戴维森是一位知名的硅谷企业家，他在2012年让这款社交媒体应用大放异彩。这款应用程序允许人们与他人分享自己的位置，以创建偶然的面对面联系，但已于2016年关闭。\n由于只有几千人使用Club house作为早期测试的一部分，这款应用程序远未大获成功，也尚未公开发布。但许多拥有它的人已经上瘾了。一名女性最近讨论了每周花在这上面的时间超过40个小时；其他人也在推特上发布了类似的统计数据。\n俱乐部的运作方式是让人们加入弹出的音频聊天室，这些聊天室在聊天结束后就会消失。一旦进入房间，用户就被划分成由主持人决定的层级。用户可以加入任何聊天室，查看谁在说话或在听，点击进入个人资料页面并关注其他人。\n一些人说，会所带回了现实生活中互动的自发性，而这种互动随着冠状病毒的出现而消失了。机票预订应用Hitlist的创始人吉莉安·莫里斯(Gillian Morris)表示，登录这款应用感觉就像在咖啡馆里撞到了人，并开始了对话。\n33岁的索尼娅·巴斯切斯(Sonia Baschez)是旧金山的一名数字营销顾问，她被邀请使用会所，她说，“这就像走进一个聚会，你知道那里的人都准备好交往了。”\n巴斯切斯说，自从一周半前加入这款应用以来，她每天都会在这款应用上花费三到五个小时。“当然，你可以和别人通电话，但这看起来太奇怪了，”她说。“你不会被迫一直参与俱乐部的谈话。你可以只听别人谈论有趣的话题，什么时候想跳进去就行了。“。\n上周末，作者沙卡·森戈尔(Shaka Senghor)和活动人士麦克森分别在这款应用上花了几个小时讨论监狱改革、警察暴行和其他与他们的利益相关的话题。前联邦调查局人质谈判代表克里斯·沃斯(Chris Voss)最近在俱乐部举行了一次公开问答。贾里德·莱托(Jared Leto)和阿什顿·库彻(Ashton Kutcher。\n风险投资公司Susa Ventures的投资者利奥·波罗韦茨(Leo Polovets)表示，会所有时感觉像是一场科技会议，讨论与科技相关的话题，知名科技人士露面。“这几乎就像一个有观众参与的播客，”他说。\n那是在白天。下班后，俱乐部更像是一个喧闹的潜水酒吧。几乎每天晚上10点左右，都会有30到50人在这款应用上形成一个房间，每个人都是主持人，主持人特权是免费的，麦克风大多是非静音的，用户可以实时将他们的头像交换为与对话相关的模因和图片。\n他们自称是“公交车的后座”。28岁的瑞安·达维詹(Ryan Dawidjan)是一家科技公司的客户主管，他开庭审理，确保房间里的每个人都遵守规则：不谈论无聊的科技话题，也不谈论俱乐部。他开玩笑地把违反这些神圣条款的人从主持人的角色中除名。\n“公交车后部”的格式是流畅的。有时会有塔罗牌读卡器批评会员的Instagram账户；有时是约会建议节目；有时无聊的人会对突然出现在他们脑海中的任何事情发声。\n俱乐部已经产生了第一个有影响力的人：38岁的谢尔·莫霍特(Sheel Mohnot)，另一家风险投资公司Better Tomorrow Ventures的创始人。莫霍特是“巴士后座”中的常客，他一直是“疯狂单身女郎”(Zoom Bcherorette)的参赛者，这是一个弹出式在线约会活动，粉丝们在俱乐部举办了一个现场讨论派对。在通过这款应用与企业家兼唱片公司高管斯库特·布劳恩(Scoter Braun)建立联系后，莫霍诺出现在最近贾斯汀·比伯(Justin Bieber)和阿里安娜·格兰德(Ariana Grande)的一段音乐视频中。\n达维让说，会所“每晚都像一个神秘的盒子”。“你不知道你会得到什么，但它总是不错的。”\n32岁的亚历克斯·陶布(Alex Taub)是专业社交平台Upstream的联合创始人，他也在这款应用上。他说，“你不会想要离开会所，因为你觉得当你离开的时候，会发生一些疯狂的事情。”\n所有这些都激起了风险资本家的胃口。除了安德森·霍洛维茨(Andreessen Horowitz)的投资者，来自基准和格雷洛克合伙公司(Greylock Partners)等硅谷顶级公司的其他人也在这款应用程序中。许多人在俱乐部提供产品反馈，并宣称这是音频的未来。一些人已经与名人关系争执起来，想要尝试一下。\n然而，甚至在会所推出之前，它就遇到了较大的社交媒体公司难以解决的问题。周日，企业家斯里拉姆·克里希南(Sriram Krishnan)在应用程序上改名为苹果首席执行官蒂姆·库克(Tim Cook)，这是一个恶作剧。100多人立即加入了这个房间。\n几小时后，有人冒充特斯拉首席执行官马斯克。这导致俱乐部用户MC Hammer公开呼吁该公司实施实名政策。“真实身份！对你的言辞和意见负责，“他在推特上写道。\n会所也面临着竞争。上周末，一款模仿俱乐部界面的应用程序水冷器(WaterCooler)发布了。它甚至在宣传图片中使用了戴维森先生的照片。", "note_en": "SAN FRANCISCO — Marc Andreessen, a Silicon Valley investor, published  a rallying cry last month that quickly ricocheted around the tech industry. In it, he placed the blame for America’s dismal response to  the coronavirus on “smug complacency, this satisfaction with the status quo and the unwillingness to build.”\n He proposed a solution that fit squarely into Silicon Valley’s ethos of ingenuity. It was time to build things, he said, like universities, hospitals, skyscrapers, zero-emission nuclear reactors, delivery drones, hyperloops and even Elon Musk’s “alien dreadnoughts.”\n “Building is how we reboot the American dream,” Mr. Andreessen wrote in his post, which he titled “Time to Build.”\n It was an inspirational call to arms. But one of the first things Mr. Andreessen and other Silicon Valley venture capitalists have since rushed to help build was something else entirely: an app called  Clubhouse.\n Clubhouse is a social media app where venture capitalists have gathered to mingle with one another while they are quarantined in their homes. The app is, for now, invite-only, and buzzy: Seemingly everyone who has been allowed to join the early test version, from celebrities like MC Hammer to activists like DeRay Mckesson, has tweeted about it. And it has recently been one of the hottest deals on Sand Hill Road, Silicon Valley’s venture capital nexus.\n Last week, Mr. Andreessen’s venture firm, Andreessen Horowitz, won the deal to invest in Clubhouse. Andreessen Horowitz agreed to put in $10 million, plus pay $2 million to buy shares from Clubhouse’s existing shareholders, said a person with knowledge of the funding, who declined to be named because the details were confidential.\n The financing valued Clubhouse, which started this year and has two employees, at nearly $100 million. The deal was  reported earlier by Forbes.\n Andrew Chen, a partner at Andreessen Horowitz, said on Twitter that he interpreted Mr. Andreessen’s “Time to Build” as building more of everything, including “new gaming cos, social apps, fitness and more!”\n  The rush to invest in Clubhouse reflects the way Silicon Valley works. While cutting-edge technology and a change-the-world mission are paramount, much of the big money in recent decades has ultimately been made from addictive social media apps. So when it comes to building new things, Silicon Valley often turns to what it knows — and that is more social networks.\n Jeremy Liew, an investor at Lightspeed Venture Partners, said his firm, along with “most of Silicon Valley,” had spoken to the founders of Clubhouse in recent weeks. The app “got some early traction with V.C.s and entrepreneurs, and no doubt that is why some firms leaned in,” he said, adding that Lightspeed did not pursue an investment. “They generalized from their own positive experiences.”\n  Andreessen Horowitz declined to comment on Mr. Andreessen’s essay and any connection to the Clubhouse investment. Mr. Andreessen, Mr. Chen and their partner, Ben Horowitz, have been frequent faces in the app. Last week, Mr. Horowitz answered questions from Clubhouse’s users about his barbecue techniques and favorite dining spots, adding how impressed he was with what the app’s founders had built.\n  Paul Davison, who founded Clubhouse with Rohan Seth, a former Google engineer, declined to comment. Mr. Davison is a well-known Silicon Valley entrepreneur, having made the social media app Highlight in 2012. That app, which allowed people to share their location with others to create serendipitous in-person connections,  shut down in 2016.\n  With just a few thousand people using Clubhouse as part of an early test, the app is far from a hit and has not been publicly released. But many of those who have it are already addicted. One woman recently discussed spending more than 40 hours a week on it; others  have tweeted  similar statistics.\n Clubhouse works by letting people join pop-up audio chat rooms that disappear when they end. Once in the rooms, users are segmented into tiers determined by moderators. Users can join any chat room, see who is speaking or listening, click into a profile page and follow others.\n Some said Clubhouse had brought back the spontaneity of real-life interactions, which vanished with the coronavirus. Gillian Morris, founder of Hitlist, a flight booking app, said logging in to the app felt like bumping into people and striking up a conversation at a coffee shop.\n “It’s like walking into a party where you know people are ready to mingle,” said Sonia Baschez, 33, a digital marketing consultant in San Francisco who was invited to use Clubhouse.\n Since joining the app a week and a half ago, Ms. Baschez said, she has spent three to five hours a day on it. “Sure, you could be talking to people on the phone, but that just seems so weird,” she said. “You’re not forced to be part of the conversation the entire time on Clubhouse. You can just listen to other people talking about interesting subjects and jump in when you want.”\n Last weekend, the author Shaka Senghor and Mr. Mckesson, the activist, each spent hours on the app discussing prison reform, police brutality and other topics related to their interests. A former FBI hostage negotiator, Chris Voss, recently held an open Q. and A. on Clubhouse. Jared Leto and Ashton Kutcher are users; Kevin Hart also showed up one time.\n Leo Polovets, an investor at Susa Ventures, a venture capital firm, said Clubhouse sometimes felt like a tech conference, with discussions on tech-related topics and appearances from prominent techies. “It’s almost like a podcast with audience participation,” he said.\n  That’s during the day. After hours, Clubhouse is more like a rowdy dive bar. At around 10 nearly every night, 30 to 50 people form a room on the app where everyone is a host, moderator privileges are given freely, microphones are mostly unmuted and users swap their profile pictures in real time to memes and images related to the conversation.\n They call themselves the “Back of the Bus.” Ryan Dawidjan, 28, an account executive at a tech company, holds court and ensures everyone in the room follows the rules: no boring tech talk and no talking about Clubhouse. He playfully boots people from host roles for violating these sacred terms.\n The format of “Back of the Bus” is fluid. Sometimes there is a tarot card reader critiquing a member’s Instagram account; sometimes it is a dating advice show; sometimes bored people sound off about anything that pops into their mind.\n Clubhouse has already minted its first influencer: Sheel Mohnot, 38, founder of Better Tomorrow Ventures, another venture firm. Mr. Mohnot, a staple in “Back of the Bus,” has been a contestant on the Zoom Bachelorette, a pop-up online dating event for which fans hosted a live discussion party on Clubhouse. After connecting through the app with Scooter Braun, an entrepreneur and record executive, Mr. Mohnot was featured in a recent Justin Bieber and Ariana Grande music video.\n Clubhouse is “like a mystery box every night,” Mr. Dawidjan said. “You don’t know what you’re going to get, but it’s always good.”\n  Alex Taub, 32, a co-founder of Upstream, a professional networking platform, who is on the app, said, “You don’t want to leave Clubhouse because you feel like when you leave, something crazy is going to happen.”\n All of that has whetted the appetite of venture capitalists. Apart from the Andreessen Horowitz investors, others from top Silicon Valley firms like Benchmark and Greylock Partners are also in the app. Many have offered product feedback in Clubhouse and declared that it was the future of audio. Some have wrangled celebrity connections to try it.\n Yet even before Clubhouse launches, it has encountered issues that  larger social media companies struggle with. On Sunday, the entrepreneur Sriram Krishnan changed his name on the app to Tim Cook, Apple’s chief executive,  as a prank. More than 100 people immediately joined the room.\n Hours later, someone impersonated Mr. Musk, the Tesla chief. That led MC Hammer, a Clubhouse user, to  publicly call on the company to institute a real name policy. “Real identity !!! Be accountable for your words and opinions,” he tweeted.\n Clubhouse also faces competition. Over the weekend, an app that mimics the Clubhouse interface called  Watercooler was released. It even used a photo of Mr. Davison in its promotional images.", "posttime": "2020-05-20 14:26:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,硅谷,called,俱乐部", "title": "俱乐部硅谷的热门新事物？一款名为Club house的应用程序", "title_en": "The Hot New Thing in Clubby Silicon Valley? An App Called Clubhouse", "transed": 1, "url": "https://www.nytimes.com/2020/05/19/technology/clubby-silicon-valley-app-clubhouse.html", "via": "", "real_tags": ["程序", "app", "硅谷", "called", "俱乐部"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002929, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：1995年4月7日星期五在新墨西哥州圣达菲的圣达菲研究所演讲。讲座被录了下来，这是经过编辑的文字记录。\n来自：Gregory J.Chaitin[查看电子邮件][v1]Mon，1995 9月18日15：36：02 UTC(0KB)[v2]Wed，1995 9月20日15：26：16 UTC(15 KB)", "note_en": "Download PDF  Abstract: Lecture given Friday 7 April 1995 at the Santa Fe Institute, Santa Fe, NewMexico. The lecture was videotaped; this is an edited transcript.\n  From: Gregory J. Chaitin [ view email]     [v1] Mon, 18 Sep 1995 15:36:02 UTC (0 KB)  [v2]Wed, 20 Sep 1995 15:26:16 UTC (15 KB)", "posttime": "2020-05-20 13:42:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,algorithmic,pdf", "title": "如何在计算机上运行算法信息论(1995)", "title_en": "How to Run Algorithmic Information Theory on a Computer (1995)", "transed": 1, "url": "https://arxiv.org/abs/chao-dyn/9509014v2", "via": "", "real_tags": ["算法", "pdf"]}]