[{"category": "", "categoryclass": "", "imagename": "ba188f500461539462f709bc001bdc47.jpg", "infoid": 1068906, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于 Dish 与 T-Mobile 之间存在争执，Dish Network 已同意在 10 年内向 AT&amp;T 支付至少 50 亿美元的网络访问费用。 Dish 正处于构建 5G 网络的早期阶段，同时作为经销商使用从 T-Mobile 购买的网络容量为客户提供服务。但 Dish 和 T-Mobile 正在为 T-Mobile 比原定计划更早关闭其 3G CDMA 网络的计划发生争执，Dish 指责 T-Mobile 存在反竞争行为。在这种背景下，Dish 今天宣布“与 AT&amp;T 签署了一项变革性的长期战略网络服务协议，使 AT&amp;T 成为 Dish MVNO [移动虚拟网络运营商]客户的主要网络服务合作伙伴。” Dish 表示，AT&amp;T 网络容量将为 Dish 的“零售无线品牌，包括 Boost Mobile、Ting Mobile 和 Republic Wireless”的客户提供服务。 Dish 还表示，该协议将加速其“将零售无线分销扩展到 Dish 提供卫星电视服务的农村市场”，并且 AT&amp;T 将提供传输和漫游服务，以支持 Dish 未来的 5G 网络。 Dish 在美国证券交易委员会的一份文件中透露了 50 亿美元的价格，该文件还指出，AT&amp;T 的漫游和传输服务将不仅限于 Dish 未建立 5G 基础设施的地区。这笔交易“为 Dish 的零售无线客户提供了通过 AT&amp;T 网络在美国各地的语音和数据漫游服务以及对 AT&amp;T 网络的访问，即使在 Dish 正在部署自己的 5G 网络的市场内，”Dish 告诉美国证券交易委员会。 AT&amp;T 和 Dish 之间今天的交易是非排他性的，因此 Dish 可以同时使用 T-Mobile 和 AT&amp;T 容量来为客户提供服务。但 Dish 声明 AT&amp;T 将成为 Dish MVNO 客户的“主要”网络提供商，这表明 Dish 正试图尽量减少 T-Mobile 网络的使用。 Dish 与 T-Mobile 的 MVNO 交易持续到 2027 年。 T-Mobile/Dish 的合作伙伴关系源于 T-Mobile 收购 Sprint。当特朗普政府的司法部允许合并时，它要求 T-Mobile 出售 Dish 以前由 Sprint 拥有的 Boost Mobile 预付费业务，以及频谱许可证和对合并的 T-Mobile/Sprint 网络的批发访问权。这笔交易本应帮助 Dish 成为第四家主要运营商，以取代 T-Mobile/Sprint 合并将全国运营商的数量从四家减少到三家时失去的竞争对手。\n此后，Dish 在向联邦通信委员会提交的多份文件中指责 T-Mobile 存在反竞争行为。 Dish 在 4 月向 FCC 抱怨说，“T-Mobile 已宣布打算在 2022 年 1 月 1 日关闭 Sprint CDMA 网络——数百万 Boost 用户的家园。这比之前的三年迁移时间表要早宣布。” Dish 表示，T-Mobile 应该至少将 3G CDMA 网络维持到 2023 年 7 月，也就是 Dish 收购 Boost 三年后。 Dish 表示，T-Mobile 在 2019 年 7 月提交给美国证券交易委员会的文件和加州公用事业委员会（CPUC）的声明中说明了三年的时间表。例如，T-Mobile 告诉 CPUC，它将“在 3 年迁移期内支持前 Sprint 客户”，并且将能够“支持依赖 LTE 和 CDMA 技术的 Sprint 客户，并为手机不兼容的客户提供服务”通过迁移过程。” T-Mobile 表示它没有承诺三年的时间表，并告诉 FCC，“Dish 引用的声明只是承认 T-Mobile 有长达三年的时间来完全淘汰传统的 Sprint CDMA 网络......它是Dish 认为这三个精心挑选的声明构成了其商业计划的基础，并应被视为凌驾于 MNSA [T-Mobile 和 Dish 之间的主网络服务协议] 中包含的明确和明确的合同语言，这是荒谬的。” T-Mobile 进一步辩称，“所有 CDMA 客户，包括 Dish 的 Boost 品牌客户，都将通过按计划迁移到 T-Mobile 的新网络而获得巨大利益，这样做绝对符合他们的最佳利益。根据我们的协议，它毫无疑问，Dish 承担着及时将客户迁移到新技术的财务责任，如果他们履行这些义务，任何消费者都不会受到日落的负面影响，实际上将获得可观的收益。” Dish 然后称 T-Mobile 的回应是“无法令人信服地试图证明其公然反竞争决定过早关闭传统 Sprint CDMA 网络的运营”，并表示“CDMA 网络的加速关闭可能会伤害数百万人”是“无可争议的” Boost 消费者，其中许多人已经面临经济挑战。” “Dish 并没有要求 T-Mobile 做任何事情，除了履行它在宣誓下向监管机构做出的承诺，并至少在 2023 年 7 月之前保持 CDMA 网络的运行，”Dish 告诉 FCC。 “虽然 T-Mobile 发表这些声明是为了让监管机构感到安慰，即其收购 Sprint 不会对消费者造成伤害，但 T-Mobile 现在躲在狭隘的合同条款后面，试图实施其承诺的确切伤害不是原因。” T-Mobile 和 Dish 也不同意共享 12 GHz 频段，因为 T-Mobile 敦促 FCC 避免向拥有 MVDDS（多频道视频和数据分发服务）卫星电视许可证（包括 Dish）的公司授予地面移动权利。 T-Mobile 表示，这相当于“意外的意外收获”。 Dish 想将频段用于 5G。\n作为 T-Mobile/Sprint 合并和撤资程序的一部分，Dish 向政府承诺，到 2023 年 6 月，它将建立一个为 70% 的美国人提供服务的 5G 网络。", "note_en": "Dish Network has agreed to pay AT&amp;T at least $5 billion over 10 years for network access amid a feud between Dish and T-Mobile.\n Dish is in the early stages of building a 5G network and in the meantime is serving customers as a reseller using network capacity that it purchases from T-Mobile. But Dish and T-Mobile are fighting over T-Mobile&#39;s plan to shut down its 3G CDMA network earlier than it originally intended, with Dish accusing T-Mobile of anticompetitive behavior.\n Against that backdrop, Dish today  announced &#34;the signing of a transformative, long-term strategic Network Services Agreement with AT&amp;T, making AT&amp;T the primary network services partner for Dish MVNO [mobile virtual network operator] customers.&#34;\n The AT&amp;T network capacity will serve customers on Dish&#39;s &#34;retail wireless brands, including Boost Mobile, Ting Mobile, and Republic Wireless,&#34; Dish said. Dish also said the agreement will accelerate its &#34;expansion of retail wireless distribution to rural markets where Dish provides satellite TV services&#34; and that AT&amp;T will provide transport and roaming services to support Dish&#39;s future 5G network.\n Dish revealed the $5 billion price in a Securities and Exchange Commission  filing that also notes that the roaming and transport services from AT&amp;T will not be limited to areas where Dish doesn&#39;t build 5G infrastructure. The deal &#34;provides Dish&#39;s retail wireless customers with voice and data roaming services throughout the US on the AT&amp;T network and access to AT&amp;T&#39;s network, even within the markets where Dish is deploying its own 5G network,&#34; Dish told the SEC.\n    Today&#39;s deal between AT&amp;T and Dish is nonexclusive, so Dish can use both T-Mobile and AT&amp;T capacity to serve customers. But Dish&#39;s statement that AT&amp;T will become the &#34;primary&#34; network provider for Dish MVNO customers shows that Dish is trying to minimize the use of T-Mobile&#39;s network. Dish&#39;s MVNO deal with T-Mobile lasts until 2027.\n  The T-Mobile/Dish partnership grew out of T-Mobile&#39;s purchase of Sprint. When the Trump administration&#39;s Justice Department  allowed that merger, it required T-Mobile to  sell Dish the Boost Mobile prepaid business formerly owned by Sprint, as well as spectrum licenses and wholesale access to the combined T-Mobile/Sprint network. The deal was supposed to help Dish  become the fourth major carrier to replace the competition lost when the T-Mobile/Sprint merger reduced the number of nationwide carriers from four to three.\n Dish has since accused T-Mobile of anticompetitive behavior in multiple filings to the Federal Communications Commission.  Dish complained to the FCC in April that &#34;T-Mobile has announced its intention to turn off the Sprint CDMA network—home to millions of Boost subscribers—on January 1, 2022. This is significantly sooner than the three-year migration timeline it previously announced.&#34;\n Dish says that T-Mobile should have to maintain the 3G CDMA network until at least July 2023, which is three years after Dish&#39;s purchase of Boost. Dish said that T-Mobile stated the three-year timeline in a  July 2019 SEC filing and in statements to the California Public Utilities Commission (CPUC). For example, T-Mobile told CPUC that it would &#34;support former Sprint customers during the 3-year migration period&#34; and that it will be able to &#34;support Sprint customers who are reliant on LTE and CDMA technologies and to shepherd customers with incompatible handsets through the migration process.&#34;\n     T-Mobile said it didn&#39;t commit to a three-year timeline,  telling the FCC that &#34;the statements Dish cites were simply acknowledging that T-Mobile has up to three years to fully sunset the legacy Sprint CDMA network... It is absurd for Dish to suggest that these three cherry-picked statements formed the basis of its business plan and should be deemed to override the clear and unambiguous contractual language contained in the MNSA [the Master Network Services Agreement between T-Mobile and Dish].&#34;\n T-Mobile further argued that &#34;all CDMA customers, including Dish&#39;s Boost-branded customers, will receive enormous benefits by migrating as planned onto T-Mobile&#39;s new network, and it is absolutely in their best interest to do so. Under our agreement, it is unambiguously Dish&#39;s financial responsibility to migrate customers to the new technology in a timely manner, and if they live up to those obligations, no consumers will be negatively affected by the sunset and in fact will receive substantial benefits.&#34;\n Dish then called T-Mobile&#39;s response an &#34;unconvincing attempt to justify its blatantly anticompetitive decision to prematurely shut down the operation of the legacy Sprint CDMA network&#34; and said it is &#34;indisputable&#34; that &#34;the accelerated shutdown of the CDMA network likely will harm millions of Boost consumers, many who already face economic challenges.&#34;\n &#34;Dish is not asking for T-Mobile to do anything except honor the commitments it made to regulators under oath and keep the CDMA network operational until at least July 2023,&#34; Dish told the FCC. &#34;While T-Mobile had no problem making these statements to give comfort to regulators that its acquisition of Sprint would not result in consumer harms, T-Mobile is now hiding behind narrow contractual provisions in its attempt to perpetrate the exact harms it promised it would not cause.&#34;\n  T-Mobile and Dish also disagree on sharing the 12 GHz spectrum band, as T-Mobile  urged the FCC to avoid giving terrestrial mobile rights to companies with MVDDS [Multichannel Video and Data Distribution Service] satellite-TV licenses, which includes Dish. T-Mobile said that would amount to &#34;an undeserved windfall.&#34; Dish wants to  use the spectrum band for 5G.\n As part of the T-Mobile/Sprint merger-and-divestment proceedings, Dish committed to the government that it would build a 5G network serving 70 percent of Americans by June 2023.", "posttime": "2021-07-22 22:26:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "切换,switching,dish", "title": "调用 T-Mobile 反竞争后将 Dish 切换网络至 AT&amp;T", "title_en": "Dish Switching Network To AT&T After Calling T-Mobile Anticompetitive", "transed": 1, "url": "https://arstechnica.com/information-technology/2021/07/dish-to-pay-att-5-billion-for-network-access-amid-feud-with-t-mobile/", "via": "", "real_tags": ["切换", "switching", "dish"]}, {"category": "", "categoryclass": "", "imagename": "e43b71af5d4205c4b161ef56762bc80a.jpg", "infoid": 1068905, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想象一个宇宙，在那里你可以将一艘宇宙飞船指向一个方向并最终返回到你开始的地方。如果我们的宇宙是一个有限的甜甜圈，那么这样的运动是可能的，物理学家可能会测量它的大小。 “我们可以说：现在我们知道了宇宙的大小，”法国里昂大学天体物理研究中心的天体物理学家 Thomas Buchert 在一封电子邮件中告诉 Live Science。通过检查来自早期宇宙的光，布赫特和一组天体物理学家推断，我们的宇宙可能是多重连接的，这意味着空间在所有三个维度上都是封闭的，就像一个三维甜甜圈。这样的宇宙是有限的，根据他们的研究结果，我们整个宇宙可能只比可观测宇宙的极限大三到四倍，距离我们大约 450 亿光年。物理学家使用爱因斯坦广义相对论的语言来解释宇宙。该语言将时空的内容与时空的弯曲和扭曲联系起来，然后告诉这些内容如何交互。这就是我们如何体验重力。在宇宙学背景下，这种语言将整个宇宙的内容——暗物质、暗能量、常规物质、辐射和所有其他东西——与其整体几何形状联系起来。几十年来，天文学家一直在争论这种形状的性质：我们的宇宙是“平坦的”（意味着假想的平行线将永远保持平行）、“封闭的”（平行线最终会相交）还是“开放的”（这些线会发散） ）。宇宙的几何形状决定了它的命运。平坦而开放的宇宙将永远继续膨胀，而封闭的宇宙最终会自行坍缩。多次观测，尤其是来自宇宙微波背景（我们的宇宙只有 38 万年历史时释放的闪光）的观测，已经坚定地证明我们生活在一个平坦的宇宙中。平行线保持平行，我们的宇宙将继续膨胀。但除了几何形状，还有更多的形状。还有拓扑结构，即形状如何在保持相同几何规则的情况下发生变化。\n例如，拿一张扁平的纸。它显然是平的——平行线保持平行。现在，取那张纸的两条边，把它卷成一个圆柱体。这些平行线仍然是平行的：圆柱在几何上是平的。现在，取圆柱形纸的两端并将它们连接起来。这使得甜甜圈的形状在几何上也是平坦的。虽然我们对宇宙内容和形状的测量告诉我们它的几何形状——它是平的——但它们并没有告诉我们拓扑结构。他们没有告诉我们我们的宇宙是否是多重连接的，这意味着我们宇宙的一个或多个维度相互连接。虽然一个完美平坦的宇宙会延伸到无穷远处，但一个具有多重连接拓扑的平坦宇宙的大小是有限的。如果我们能以某种方式确定一个或多个维度是否包含在它们自身上，那么我们就会知道宇宙在那个维度上是有限的。然后我们可以使用这些观察来测量宇宙的总体积。来自德国乌尔姆大学和法国里昂大学的一组天体物理学家研究了宇宙微波背景 (CMB)。当 CMB 被释放时，我们的宇宙比今天小一百万倍，所以如果我们的宇宙确实是多重连接的，那么它更有可能在当时的宇宙可观察范围内包裹自己。今天，由于宇宙的膨胀，包裹发生的尺度超过可观测极限的可能性要大得多，因此包裹会更难被探测到。 CMB 的观测为我们提供了最好的机会，可以看到多重连接宇宙的印记。该团队专门研究了 CMB 温度中的扰动——颠簸和摆动的奇特物理学术语。如果我们宇宙中的一个或多个维度要与它们自己连接起来，那么扰动就不会比这些环周围的距离大。他们根本不适合。正如 Buchert 在一封电子邮件中向 Live Science 解释的那样，“在一个无限的空间中，CMB 辐射的温度扰动存在于所有尺度上。然而，如果空间是有限的，那么就会缺少那些比尺寸更大的波长的空间。”换句话说：扰动会有一个最大尺寸，这可以揭示宇宙的拓扑结构。\n用美国宇航局的 WMAP 和欧空局的普朗克等卫星制作的 CMB 地图已经看到了大量缺失的大尺度扰动。 Buchert 和他的合作者研究了那些缺失的扰动是否可能是由于多重连接的宇宙造成的。为此，该团队对宇宙是一个三环面时 CMB 的样子进行了许多计算机模拟，这是一个巨大的三维甜甜圈的数学名称，我们的宇宙在所有三个维度上都与自身相连. “因此，我们必须在给定的拓扑结构中进行模拟，并与观察到的情况进行比较，”Buchert 解释说。 “观察到的 CMB 波动的特性随后在超出宇宙大小的尺度上显示出‘缺失的力量’。”缺失功率意味着在这些尺度上不存在 CMB 的波动。这意味着我们的宇宙在那个尺度上是多重连接的，并且是有限的。 “与被认为是无限的标准宇宙学模型相比，我们发现与观测到的波动更好的匹配，”他补充道。 “我们可以改变空间的大小并重复这个分析。结果是宇宙的最佳大小与 CMB 观测最匹配。我们论文的答案显然是有限宇宙比无限模型更好地匹配观测。我们可以说：现在我们知道宇宙的大小了。”研究小组发现，一个比我们可观察到的气泡大三到四倍的多重连接宇宙与 CMB 数据最匹配。虽然这个结果在技术上意味着你可以朝一个方向旅行并最终回到你开始的地方，但在现实中你将无法真正做到这一点。我们生活在一个不断膨胀的宇宙中，在大尺度上，宇宙正在以超过光速的速度膨胀，所以你永远无法赶上并完成这个循环。布赫特强调，结果仍处于初步阶段。仪器效应也可以解释大尺度上缺失的波动。", "note_en": "Imagine a universe where you could point a spaceship in one direction and eventually return to where you started. If our universe were a finite donut, then such movements would be possible and physicists could potentially measure its size.\n  &#34;We could say: Now we know the size of the universe,&#34; astrophysicist Thomas Buchert, of the University of Lyon, Astrophysical Research Center in France, told Live Science in an email.\n    Examining light from the very early universe, Buchert and a team of astrophysicists have deduced that our cosmos may be multiply connected, meaning that space is closed in on itself in all three dimensions like a three-dimensional donut. Such a universe would be finite, and according to their results, our entire cosmos might only be about three to four times larger than the limits of the observable universe, about 45 billion light-years away.\n   Physicists use the language of   Einstein&#39;s general relativity to explain the universe. That language connects the contents of spacetime to the bending and warping of spacetime, which then tells those contents how to interact. This is how we experience the force of gravity. In a cosmological context, that language connects the contents of the entire universe —   dark matter, dark energy, regular matter, radiation and all the rest — to its overall geometric shape. For decades, astronomers had debated the nature of that shape: whether our universe is &#34;flat&#34; (meaning that imaginary parallel lines would stay parallel forever), &#34;closed&#34; (parallel lines would eventually intersect) or &#34;open&#34; (those lines would diverge).\n   That geometry of the universe dictates its fate. Flat and open universes would continue to expand forever, while a closed universe would eventually collapse in on itself.\n Multiple observations, especially from the cosmic microwave background (the flash of light released when our universe was only 380,000 years old), have firmly established that we live in a flat universe. Parallel lines stay parallel and our universe will just keep on expanding.\n  But there&#39;s more to shape than geometry. There&#39;s   also topology, which is how shapes can change while maintaining the same geometric rules.\n For example, take a flat piece of paper. It&#39;s obviously flat — parallel lines stay parallel. Now, take two edges of that paper and roll it up into a cylinder. Those parallel lines are still parallel: Cylinders are geometrically flat. Now, take the opposite ends of the cylindrical paper and connect those. That makes the shape of a donut, which is also geometrically flat.\n While our measurements of the contents and shape of the universe tell us its geometry — it&#39;s flat — they don&#39;t tell us about the topology. They don&#39;t tell us if our universe is multiply-connected, which means that one or more of the dimensions of our cosmos connect back with each other.\n  While a perfectly flat universe would extend out to   infinity, a flat universe with a multiply-connected topology would have finite size. If we could somehow determine whether one or more dimensions are wrapped in on themselves, then we would know that the universe is finite in that dimension. We could then use those observations to measure the total volume of the universe.\n  A team of astrophysicists from Ulm University in Germany and the University of Lyon in France looked to the cosmic microwave background (CMB). When the CMB was released, our universe   was a million times smaller than it is today, and so if our universe is indeed multiply connected, then it was much more likely to wrap in on itself within the observable limits of the cosmos back then. Today, due to the expansion of the universe, it&#39;s much more likely that the wrapping occurs at a scale beyond the observable limits, and so the wrapping would be much harder to detect. Observations of the CMB give us our best chance to see the imprints of a multiply connected universe.\n  The team specifically looked at the perturbations — the fancy physics term for bumps and wiggles — in the temperature of the CMB. If one or more dimensions in our universe were to connect back with themselves, the perturbations couldn&#39;t be larger than the distance around those loops. They simply wouldn&#39;t fit.\n As Buchert explained to Live Science in an email, &#34;In an infinite space, the perturbations in the temperature of the CMB radiation exist on all scales. If, however, space is finite, then there are those wavelengths missing that are larger than the size of the space.&#34;\n In other words: There would be a maximum size to the perturbations, which could reveal the topology of the universe.\n    Maps of the CMB made with satellites like NASA&#39;s WMAP and and the ESA&#39;s Planck have already seen an intriguing amount of missing perturbations at large scales. Buchert and his collaborators examined whether those missing perturbations could be due to a multiply-connected universe. To do that, the team performed many computer simulations of what the CMB would look like if the universe were a three-torus, which is the mathematical name for a giant three-dimensional donut, where our cosmos is connected to itself in all three dimensions.\n &#34;We therefore have to do simulations in a given topology and compare with what is observed,&#34; explained Buchert. &#34;The properties of the observed fluctuations of the CMB then show a &#39;missing power&#39; on scales beyond the size of the universe.&#34; A missing power means that the fluctuations in the CMB are not present at those scales. That would imply that our universe is multiply-connected, and finite, at that size scale.\n  &#34;We find a much better match to the observed fluctuations, compared with the standard cosmological model which is thought to be infinite,&#34; he added.\n &#34;We can vary the size of the space and repeat this analysis. The outcome is an optimal size of the universe that best matches the CMB observations. The answer of our paper is clearly that the finite universe matches the observations better than the infinite model. We could say: Now we know the size of the universe.&#34;\n The team found that a multiply-connected universe about three to four times larger than our observable bubble best matched the CMB data. While this result technically means that you could travel in one direction and end up back where you started, you wouldn&#39;t be able to actually accomplish that in reality. We live  in an expanding universe, and at large scales the universe is expanding at a rate that is faster than the speed of light, so you could never catch up and complete the loop.\n Buchert emphasized that the results are still preliminary. Instrument effects could also explain the missing fluctuations on large scales.", "posttime": "2021-07-22 22:26:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "宇宙,giant", "title": "我们的宇宙可能是一个巨大的三维甜甜圈", "title_en": "Our Universe Might Be a Giant Three-Dimensional Donut", "transed": 1, "url": "https://www.livescience.com/universe-three-dimensional-donut.html", "via": "", "real_tags": ["宇宙", "giant"]}, {"category": "", "categoryclass": "", "imagename": "18f593a2b861b368621947249be20226.jpg", "infoid": 1068904, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据消费者研究情报合作伙伴 (CIRP) 提供的数据，iOS 和 Android 设备的激活现在在美国平均分布，在过去两年中几乎没有迹象表明这两个平台占据主导地位。 CIRP 估计，在本季度结束的一年中，iOS 和 Android 各有 50% 的新智能手机激活。 iOS 在新智能手机激活中的份额从 2017 年到 2020 年攀升，但现在已连续第二年保持在最高水平。 CIRP 合伙人兼联合创始人 Josh Lowitz 表示，这一发现意义重大，因为几年来，Android 智能手机“具有显着优势，大多数季度超过 60% 的客户选择 Android 手机。不过，在过去几年中，iOS 缩小了差距，现在与 Android 瓜分市场。”历史上，Android 和 iOS 用户的忠诚度都很高。 Android 的忠诚度变化很小，在过去四年中在 90% 到 93% 的狭窄范围内。另一方面，iOS 忠诚度在过去四年中逐渐增加，从 2018 年初的 86% 低至 2021 年 6 月结束的最近一个季度的 93%。新智能手机激活份额的变化，其中 iOS 在切换数量有限的市场中获得了忠诚度。 CIRP 合伙人 Mike Levin 解释说：在最近一个季度，苹果在忠诚度方面具有优势，93% 的 iPhone 用户升级到新 iPhone，而 88% 的安卓用户继续使用安卓。几年来，iOS 的忠诚度提高了大约 5 个百分点，而 Android 保持不变。这使 Apple 能够稳步增加新智能手机激活的 iOS 份额。 CIRP 的最新数据基于对今年 4 月至 6 月期间激活新的或使用过的智能手机的 500 名美国受试者的调查。鉴于样本量较小，这些数字肯定存在一定的误差，但由于每个季度使用相同的调查，因此该数据提供了对激活和忠诚度随时间推移的可靠观察。\n真的不奇怪。 iPhone 提供了更好的长期支持——我的 iPhone 6S 将在 2022 年甚至 2023 年通过安全更新得到支持，我无法说出一款与该支持级别相匹配的 Android 手机。然后，这会影响转售价值和总拥有成本。 Android 没有什么吸引我的地方，它们可能会首先获得一些功能，例如 120Hz 显示器，但 Apple 总是做得更好。此外，他们的性能优势轻松领先 Android 一年。我还没有遇到过 iOS 恶意软件，但这在 Android 上是一个相当大的问题。 - 安全 - 更新 - 性能 - 用户体验 - 隐私 - 细化 Android 可能首先凭借新功能赢得市场，并在利润微薄的底端竞争。如果你只想要一部手机而不关心最好的，那么 SE 总是存在的。您认为福特在汽车市场上垄断是因为只有福特才能为福特汽车提供保修吗？好吧，自从您提出这个问题以来，我们一直在尝试与您联系，了解您车辆的延长保修期…… 有道理。与 5-6 年的 iPhone 相比，大多数 Android 手机的支持时间为 3 年或更短，它们的价值下降速度比 iPhone 快得多（如果您想在 eBay 上销售），当然还有隐私角度.它的 50/50 真的很棒。我认识的大多数使用 Android 的人都以高价购买它，甚至不知道如何使用他们的手机。他们总是在处理一些间谍软件或谷歌为他们一直在谈论的事情提供广告。作为 Iphone 用户，我不在乎 android 是否拥有 90% 的市场。只要我不必处理我的 android 朋友处理的废话。我使用 Android 并且不必处理您的 Android 朋友处理的废话，而且我不是超级技术人员。我同情你，因为即使使用 iPhone，你仍然需要听你的朋友讲述他们在 Android 上的悲惨故事。据彭博社记者 Mark Gurman 称，苹果有望在 9 月至 11 月之间的某个时间发布重新设计的 14 英寸和 16 英寸 MacBook Pro，作为新产品发布的又一个秋季的一部分。时事通讯，Gurman 表示，新款 MacBook Pro 将在第三季度投产，预计将在...\n继去年成功推出 iPhone 12 之后，Apple 的目标是在其即将推出的 2021 年 iPhone 上再次“大放异彩”，预计这款 iPhone 将配备更大的电池、更小的缺口、改进的性能以及更先进的显示屏永远在线模式。彭博社记者马克·古尔曼 (Mark Gurman) 在其最新发布的每周 Power On 通讯中... 苹果计划在上半年更新其 4.7 英寸入门级 iPhone iPhone SE，采用 iPhone 12 系列更新的 A14 仿生处理器明年，根据 DigiTimes 的一份报告。 DigiTimes 的报告跟随可靠的苹果分析师 Ming-Chi Kuo 的脚步，他上个月报道 iPhone SE 将在第一时间获得更新的处理器和 5G 功能......据多家媒体报道，世界各地的律师和人权活动家已成为威权政府使用以色列监控公司 NSO Group 制造的手机恶意软件的目标。 17 家媒体组织和国际特赦组织安全实验室的调查发现了大规模数据泄露，表明对商业广告的广泛而持续的滥用...... Apple 今天发布了 tvOS 14.7，这是 tvOS 14 操作系统的第七次更新，最初于 9 月首次亮相ber 2020。tvOS 14.7 在 tvOS 14.6 更新发布两个月后发布。tvOS 14.7 是免费更新，可以通过 Apple TV 上的“设置”应用程序通过无线方式下载，方法是转到“系统”&gt;“软件更新”。拥有自动软件的‌‌Apple TV‌‌所有者...... Apple 的新 MagSafe 电池组将于本周开始向全球客户提供，一位幸运的人已经抢到了一个。 来自田纳西州孟菲斯的 Steven Russell 说他设法拿到了 MagSafe 电池周末从当地一家 Apple Store 打包，此后他在 Reddit 上分享了照片，仔细观察了它的设计和厚度。Russell 分享了一些...... Apple 今天发布了 iOS 14.7，标志着 iOS 操作的第七次重大更新2020 年 9 月发布的系统。 iOS 14.7 是在 iOS 14.6 发布两个月后发布的，这是一个重大更新，增加了 Apple Card 家庭支持、播客订阅等。iOS 14.7 更新可以免费下载，软件可用在所有符合条件的设备上... Apple 最近在其在线商店中添加了几款新产品和配件，包括 Linksys Velop AX4200 网状 Wi-Fi 6 系统，其中一个节点的价格为 249.95 美元，两件装售价 399.95 美元，三件装售价 499.95 美元。Mesh 技术提供整个家庭 Wi-Fi 覆盖范围，可通过添加额外节点轻松扩展，Wi-Fi 6 提供更快的速度和更低的延迟......\n在过去的几年里，谷歌一直在推动一种称为富通信服务或 RCS 的新通信协议。 RCS 旨在取代当前的文本消息标准 SMS，它支持更高分辨率的照片和视频、音频消息、更大的文件大小、更好的加密、改进的群聊等。Verizon 今天宣布它计划采用... Apple 已明确表示，其大多数员工将无法永久远程工作，但这并不能阻止一些公司员工继续推动更宽松的远程工作规则，Recode 报道。本周发出的新请愿书，员工要求苹果允许员工更长期地在家工作。苹果已经同意混合...", "note_en": "Activations of iOS and Android devices are now evenly split in the United States, with little sign of movement toward either platform dominating over the past two years, according to data sourced by  Consumer Research Intelligence Partners (CIRP).\n CIRP estimates that iOS and Android each had 50 percent of new smartphone activations in the year ending this quarter. iOS&#39;s share of new smartphone activations climbed from 2017 to 2020, but has now remained at its peak level for a second consecutive year.\n CIRP Partner and Co-Founder Josh Lowitz said that the finding is significant because for several years, Android smartphones &#34;had a significant edge, with over 60 percent of customers opting for an Android phone in most quarters. In the past couple of years, though, iOS has closed the gap, and now splits the market with Android.&#34;\n Both Android and iOS users have had a high level of loyalty historically. Android loyalty has varied very slightly, in a narrow range of 90 to 93 percent in the past four years. iOS loyalty, on the other hand, has gradually increased over the past four years, from a low of 86 percent in early 2018 to 93 percent in the most recent quarter ending in June 2021.\n Loyalty and tendency to switch platforms may explain some of the change in the share of new smartphone activations, where iOS has gained loyalty in a market with a limited amount of switching. CIRP Partner Mike Levin explained:\n In the most recent quarter, Apple had an edge in loyalty, with 93 percent of prior  iPhone owners upgrading to a new ‌iPhone‌, compared to 88 percent of Android owners staying with Android. Over several years, iOS gained about five percentage points in loyalty, while Android remained flat. This allowed Apple to steadily increase the iOS share of new smartphone activations.\n CIRP&#39;s latest data was based on a survey of 500 U.S. subjects that activated a new or used smartphone in the period from April to June this year. Given the small sample size, there is certainly some margin of error to these numbers, but the data provides a reliable look at activations and loyalty over time as it uses the same survey each quarter.\n Not surprising really. iPhones offer much better long term support - my iPhone 6S will be supported into 2022 and even 2023 with security updates, I can&#39;t name a single Android phone that matches that level of support. This then feeds into resale value and total cost of ownership.  There&#39;s nothing appealing to me regarding Android, they might get some features first like 120Hz displays but Apple always does it better. Also their performance advantage is easily a year ahead of Android. I&#39;ve yet to come across iOS malware, yet this is a sizable problem on Android.  -Security -Updates -Performance -User Experience -Privacy -Refinement  Android wins in maybe first to market with new features and competes at the bottom end where margins are razor thin. If you just want a phone and don&#39;t care about the best there&#39;s always the SE.\n   Do you think that Ford has a monopoly in the automotive market because only Ford can provide warranties for Ford vehicles?\nWell since you brought it up, we’ve been trying to reach you about your vehicle’s extended warranty…\n Makes sense. You&#39;ve got a 3 year support time or less for most Android phones compared to 5-6 years of iPhones, their value falls off much more quickly than iPhones (if you&#39;re wanting to sell on eBay) and of course the privacy angle. It&#39;s really amazing its 50/50.\n And most of people I know with Android buy it for the price and really don&#39;t even know how to use their phone. And they are always dealing with some spyware or google coming up with ads for things they have been talking about. As an Iphone user I don&#39;t care if android has 90% of the market. As long as I don&#39;t have to deal with the crap my android friends deal with.\nI use Android and do not have to deal with the crap your Android friends deal with and I am not super techie. I feel for you though because even with your iPhone, you still have to listen to your friends relate their Android tales of woe.\n  Apple can be expected to release its redesigned 14-inch and 16-inch MacBook Pros sometime between September and November, as part of another packed fall season for new product launches, according to Bloomberg journalist Mark Gurman.In the latest edition of his Power On newsletter, Gurman says that the new MacBook Pros will go into production in the third quarter and can be expected to be...\n Following a successful supercycle launch of the iPhone 12 last year, Apple aims to make another &#34;big splash&#34; with its upcoming 2021 iPhones, which can be expected to feature larger batteries, smaller notches, improved performance, and more advanced displays that may sport an always-on mode. In the latest publication of his weekly Power On newsletter, Bloomberg journalist Mark Gurman...\n Apple plans to update the iPhone SE, its 4.7-inch entry-level iPhone, with an updated A14 Bionic processor from the iPhone 12 series in the first half of next year, according to a report from DigiTimes.DigiTimes&#39; report follows in the footsteps of reliable Apple analyst Ming-Chi Kuo, who reported last month the iPhone SE would receive an updated processor and 5G capabilities in the first...\n Journalists, lawyers, and human rights activists around the world have been targeted by authoritarian governments using phone malware made by Israeli surveillance firm NSO Group, according to multiple media reports.An investigation by 17 media organizations and Amnesty International&#39;s Security Lab uncovered a massive data leak, indicating widespread and continuing abuse of the commercial...\n Apple today released tvOS 14.7, the seventh update to the tvOS 14 operating system that initially debuted in September 2020. tvOS 14.7 comes two months after the launch of the tvOS 14.6 update.tvOS 14.7, which is a free update, can be downloaded over the air through the Settings app on the Apple TV by going to System &gt; Software Update. ‌‌Apple TV‌‌ owners who have automatic software ...\n Apple&#39;s new MagSafe Battery Pack will begin arriving to customers around the world this week, and one lucky person has already snagged one.Steven Russell from Memphis, Tennessee said he managed to pick up the MagSafe Battery Pack from a local Apple Store over the weekend, and he has since shared photos on Reddit, providing a closer look at its design and thickness.Russell shared some...\n Apple today released iOS 14.7, marking the seventh major update to the iOS operating system that came out in September 2020. iOS 14.7 comes two months after the launch of iOS 14.6, a major update that added Apple Card Family Support, Podcast Subscriptions, and more.The iOS 14.7 update can be downloaded for free and the software is available on all eligible devices over-the-air in the...\n Apple recently added several new products and accessories to its online store, including the Linksys Velop AX4200 mesh Wi-Fi 6 system, with one node priced at $249.95, a two-pack priced at $399.95, and a three-pack priced at $499.95.Mesh technology offers whole home Wi-Fi coverage that is easily expandable by adding additional nodes, with Wi-Fi 6 offering faster speeds with lower latency...\n For the last several years, Google has been pushing a new communications protocol called Rich Communication Services, or RCS. RCS is designed to replace SMS, the current text message standard, and it offers support for higher resolution photos and videos, audio messages, bigger file sizes, better encryption, improved group chat, and more.Verizon today announced that it is planning to adopt...\n Apple has made it clear that most of its employees will not be able to work remotely on a permanent basis, but that isn&#39;t stopping some corporate staff from continuing to push for more relaxed remote working rules, reports Recode.In a new petition that went out this week, employees are asking Apple to allow employees to work from home on a more permanent basis. Apple has agreed to a hybrid...", "posttime": "2021-07-22 22:26:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,ios,美国", "title": "研究表明，iOS 和 Android 激活现在在美国平均分配", "title_en": "iOS and Android Activations Now Split Evenly In the US, Research Shows", "transed": 1, "url": "https://www.macrumors.com/2021/07/19/ios-and-android-activations-now-split-evenly-in-the-u-s-research-shows/", "via": "", "real_tags": ["android", "ios", "美国"]}, {"category": "", "categoryclass": "", "imagename": "43054f0988950ef8ede49db67d1d53e1.jpg", "infoid": 1068903, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有人借你的手机你会紧张吗？不是因为他们可能会侵犯您的隐私，而仅仅是因为他们可能会掉下它并打破它的玻璃？您并不孤单，加尔各答印度科学教育与研究学院 (IISER) 的研究人员可能刚刚找到了制作智能手机屏幕的完美材料：一种坚硬且破裂时会自我修复的透明材料。几十年来，科学家们一直致力于开发可以自愈的材料，他们也取得了一些成功。例如，美国化学学会的研究人员能够开发出可以通过磁力自愈的小型游泳机器人，而新加坡国立大学的研究人员则采用了不同的方法，通过制造一种智能泡沫材料，使机器人的手能够自我修复和感知物体.然而，这些项目的一个问题是它们柔软且不透明，不太适合坚固耐用的应用。因此，据印度电讯报报道，IISER 的研究人员以及印度理工学院 (IIT) 的研究人员决定专注于开发比传统自愈材料更难的材料。根据发表在该杂志上的实验结果，研究人员使用压电有机材料，将机械能转化为电能，反之亦然，制造出长度不超过 2 毫米或宽度不超过 0.2 毫米的针状晶体。科学。由于它们在专门设计的晶体中的分子排列，两个表面之间产生了强大的吸引力。每次发生骨折时，吸引力都会重新将碎片连接起来，而无需外部刺激，例如热量或大多数自愈材料所需的其他刺激。 “我们的自修复材料比其他材料硬 10 倍，它具有有序的内部晶体结构，这在大多数电子和光学应用中受到青睐，”IISER 的首席研究员 Chilla Malla Reddy 教授说。 “我可以想象日常设备的应用，”IIT Kharagpur 团队成员 Bhanu Bhushan Khatua 说，“这种材料可用于手机屏幕，如果它们掉落并出现裂缝，它会自行修复。”\n不过，只有一个问题。当您出去购买下一部智能手机时，它可能尚未商业化和可用。", "note_en": "Do you get nervous when somebody borrows your phone? Not because they might invade your privacy, but simply because they might drop it and break its glass? You are not alone, and the researchers at the Indian Institute of Science Education and Research (IISER), Kolkata might have just found the perfect material to make a smartphone screen: A transparent material that is hard and self-heals when cracked.\n Scientists have been working for decades to develop materials that can heal themselves, and they have had some success, too. For example, American Chemical Society researchers were able to develop small, swimming robots that can  magnetically heal themselves, while researchers from the National University of Singapore took a different approach by making a smart foam material that allows robot hands to  self-repair and sense objects.\n  However, one issue with these projects is that they are soft and opaque and not very suitable for rugged applications. So the researchers at IISER, along with those at the Indian Institute of Technology (IIT), Kharagpur decided to focus on developing something that is harder than conventional self-healing material, as reported by   The Telegraph India.\n The researchers used a piezoelectric organic material, which converts mechanical energy to electrical energy and vice versa, to make needle-shaped crystals that aren&#39;t more than 2 mm long or 0.2 mm wide, according to the experimental results which were published in the journal  Science.\n Due to their molecular arrangement in the specially designed crystals, a strong attractive force developed between two surfaces. Every time a fracture occurred, the attractive forces joined the pieces back again, without needing an external stimulus such as heat or others that most self-healing materials would need.\n  &#34;Our self-healing material is 10 times harder than others, and it has a well-ordered internal crystalline structure, that is favored in most electronics and optical applications,&#34; lead researcher Professor Chilla Malla Reddy of IISER said.\n “I can imagine applications for an everyday device,” said Bhanu Bhushan Khatua, a member of the team from IIT Kharagpur.&#34; Such materials could be used for mobile phone screens that will repair themselves if they fall and develop cracks.&#34;\n There is only one problem, though. It might not be commercialized and available by the time you are out to get your  next smartphone.", "posttime": "2021-07-22 22:25:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,创造,create,材料", "title": "科学家创造了世界上最坚硬的自愈材料", "title_en": "Scientists Create the World's Toughest Self-Healing Material", "transed": 1, "url": "https://interestingengineering.com/scientists-create-the-worlds-toughest-self-healing-material", "via": "", "real_tags": ["科学家", "创造", "create", "材料"]}, {"category": "", "categoryclass": "", "imagename": "895c4bbecd9ceab3d056ef918cb36859.jpg", "infoid": 1068901, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司当时解释说，该功能仅适用于点播视频，并允许观众利用可信赖的创作者的“信誉和知识”进行明智的购买。它表示将在 2021 年期间向更多创作者推出。最近，YouTube 通过针对小型企业的一日购物活动测试了直播购物。多年来，YouTube 的视频平台一直是产品发现的强大工具，因为其每月有超过 20 亿的登录用户转向该服务观看产品评论、演示、拆箱、购物和其他可能激发未来灵感的内容购买。但是，想要通过 YouTube 视频进行销售的创作者通常必须通过视频的描述或视频内元素（如卡片或片尾画面）来宣传在线商店的附属链接。近年来，YouTube 还推出了一个商品货架，允许观众购买创作者选择的一组特定产品。同时，集成的购物体验允许观众通过点击“查看产品”按钮来购买视频中显示的产品，该按钮会显示所展示的项目列表。此功能使 YouTube 能够更好地与初创公司和竞争对手（包括 Facebook、Instagram、TikTok Pinterest、亚马逊和 Snapchat）提供的越来越多的视频购物体验竞争。其中许多还包括对直播视频的支持。例如，在过去的一年里，Bambuser、Popshop Live、Talkshoplive、Whatnot 等初创公司已经筹集了数百万美元的资金，用于投资自己的直播视频购物业务。与此同时，Facebook 最近推出了 Live Shopping Fridays，以测试美容、时尚和护肤领域的实时购物。沃尔玛已多次与 TikTok 合作举办直播购物活动。\nYouTube 自己对这一领域的兴趣也在升温，就在本周，该公司宣布收购印度视频购物应用程序 Simsim——这表明谷歌有兴趣将视频购物体验进一步整合到自己的平台中。谷歌还将视频购物整合到其购物搜索业务中，其中包括 Shoploop，这是一款从谷歌内部孵化器 Area 120 毕业的视频购物产品。今天宣布扩展 YouTube 的集成视频购物体验以及其他新的谷歌购物功能，包括在 Google 的购物标签上添加一个新的部分来组织交易和销售，这对想要列出的商家是免费的。", "note_en": "That feature was designed only for on-demand videos, and allowed viewers to tap into the “credibility and knowledge” of trusted creators in order to make informed purchases, the company explained at the time. It said it would roll out to more creators over the course of 2021.\n More recently, YouTube  tested livestreamed shopping with a one-day shopping event focused on small businesses.\n  YouTube’s video platform, for years, has been a powerful tool for product discovery, as its more than 2 billion logged-in users per month turn to the service to watch product reviews, demos, unboxings, shopping hauls and other content that could inspire future purchases. But creators who wanted to sell from their YouTube videos would often have to promote affiliate links to online stores through the video’s description or in-video elements, like  cards or end screens.\n  In more recent years, YouTube also  introduced  a merch shelf that would allow viewers to shop a set of specific products the creator selected.\n The integrated shopping experience, meanwhile, allows viewers to shop the products shown in the video itself by tapping on a “view products” button, which brings up a list of the items being featured.\n  This feature allows YouTube to better compete with the growing number of video shopping experiences becoming available from both startups and competitors, including  Facebook,  Instagram,  TikTok  Pinterest,  Amazon and Snapchat. Many of those include support for livestream videos, too.\n Over the past year, for example, startups like  Bambuser,  Popshop Live,  Talkshoplive,  Whatnot and others have raised multimillion-dollar rounds to invest in their own live video shopping businesses. Meanwhile, Facebook recently  launched Live Shopping Fridays to test live shopping within the beauty, fashion and skincare space. And Walmart has partnered with TikTok on livestream shopping events on  multiple  occasions.\n YouTube’s own interest in this space has been heating up, as well, as just this week the company announced it  was acquiring Indian video shopping app Simsim — an indication of Google’s interest in further integrating video shopping experiences into its own platform. Google also integrated video shopping into its Shopping search business,  which included one effort from  Shoploop, a video shopping product that graduated from Google’s in-house incubator, Area 120.\n The expansion of YouTube’s integrated video shopping experience was  announced today alongside other new Google Shopping features, including the addition of a new section that organizes deals and sales on Google’s Shopping tab, which will be free for merchants who want to list.", "posttime": "2021-07-22 22:25:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,表示,creators,购物", "title": "YouTube 表示将测试一项新功能，允许观众直接从直播视频中购买产品，首先是一些创作者和品牌", "title_en": "YouTube says it will test a new feature that will allow viewers to shop for products directly from livestream videos, starting with a few creators and brands", "transed": 1, "url": "https://techcrunch.com/2021/07/21/youtube-to-pilot-test-shopping-from-livestreams-with-select-creators/", "via": "", "real_tags": ["youtube", "表示", "creators", "购物"]}, {"category": "", "categoryclass": "", "imagename": "179874addd2efd62dd07a012385887f4.jpg", "infoid": 1068900, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国证券交易委员会 (SEC) 主席加里·詹斯勒 (Gary Gensler) 表示，价格取决于更传统证券的加密货币可能会受到证券法的约束。根斯勒周二对美国律师协会发表讲话时表示，一些平台正在提供“定价”证券并类似于衍生产品的加密代币。他说，在他看来，任何基于安全的产品都必须遵守贸易报告规则和其他法律。 “毫无疑问：无论是股票代币、由证券支持的稳定价值代币，还是任何其他提供对基础证券的综合敞口的虚拟产品，都没有关系，”他说。 “这些平台——无论是去中心化的还是中心化的金融领域——都受到证券法的牵连，必须在我们的证券制度内运作。”注册后，您将收到有关 CoinDesk 产品的电子邮件，并且您同意我们的条款和条件以及隐私政策。 Gensler 警告说，他的机构未来也可能会采取执法行动，并指出“我们已经提起了一些涉及零售证券掉期交易的案件”，这似乎是指美国证券交易委员会针对金融应用程序 Abra 提起的案件，后者支付了 30 万美元的罚款去年向散户投资者出售基于证券的掉期的费用。加密货币交易所 Binance 最近也宣布将关闭其股票代币业务，但从技术上讲，美国客户不应该能够访问这项服务。 Gensler 在他的演讲中没有具体说明任何代币，但他的言论是在对数字资产的监管审查增加之际发表的，尤其是稳定币在国会听证会上越来越多地出现。\n昨天，USDC 的发行人 Circle 发布了支持稳定币的资产明细。除现金外，该代币还得到货币市场基金、商业票据、公司和市政债券以及外国银行发行的存款证的支持。其中一些储备，包括货币市场基金、债券和商业票据，目前根据美国法律被视为证券。全球最大的稳定币 USDT 的发行人 Tether 也表示，其储备包括对商业票据和公司债券的投资。 Gensler 并不是唯一一个认为由证券支持的稳定币应被视为证券的人。美国众议员沃伦戴维森（R-Ohio）此前告诉 CoinDesk，“很难说”这种稳定币本身不是证券。 “我认为你可以很容易地制作出一种稳定币，它可以通过一个测试表明‘不，这不是证券’，”这位议员说。披露 作为关于加密货币、数字资产和货币未来的新闻和信息的领导者，CoinDesk 是一家致力于达到最高新闻标准并遵守一套严格的编辑政策的媒体机构。 CoinDesk 是 Digital Currency Group 的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "Securities and Exchange Commission (SEC) Chair Gary Gensler said cryptocurrencies whose prices depend on more traditional securities might fall under securities laws.\n Speaking to the  American Bar Association on Tuesday, Gensler said some platforms are offering crypto tokens “that are priced off” securities and resemble derivatives products. In his view, any security-based products will have to comply with trade reporting rules and other laws, he said.\n “Make no mistake: It doesn’t matter whether it’s a stock token, a stable value token backed by securities, or any other virtual product that provides synthetic exposure to underlying securities,” he said. “These platforms – whether in the decentralized or centralized finance space – are implicated by the securities laws and must work within our securities regime.”\n By signing up, you will receive emails about CoinDesk products and you agree to our  terms &amp; conditions and  privacy policy.\n Gensler warned that his agency may bring future enforcement actions as well, noting that “we’ve brought some cases involving retail offering of securities-based swaps,” seemingly referring to a case the SEC brought against financial app Abra,  which paid $300,000 in penalties on charges of selling security-based swaps to retail investors last year.\n Crypto exchange Binance also recently announced it was closing its stock token business, though technically U.S. customers should not have been able to access this service.\n Gensler didn’t specify any tokens in his speech, but his remarks come amid increased regulatory scrutiny around digital assets, with stablecoins in particular popping up more and more in congressional hearings.\n  Yesterday, Circle, the issuer of  USDC,  published a breakdown of the assets backing the stablecoin. In addition to cash, the token is backed by money market funds, commercial paper, corporate and municipal bonds and certificates of deposits issued by foreign banks.\n Some of these reserves, including the money market funds, bonds and commercial paper, are currently treated as securities under U.S. law.\n Tether, the issuer of the world’s largest stablecoin,  USDT, has also said its reserves included investments in commercial paper and corporate bonds.\n  Gensler isn’t alone in his view that stablecoins that are backed by securities should be treated as securities. U.S. Rep. Warren Davidson (R-Ohio) previously told CoinDesk that “it gets hard to say” that such a stablecoin isn’t itself a security.\n “I think you could easily craft a stablecoin that meets a test that says ‘no, this is not a security,’” the lawmaker said.\n     Disclosure The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups.", "posttime": "2021-07-22 22:24:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,证券,securities", "title": "SEC 主席 Gary Gensler：证券支持的股票代币和稳定币“受证券法牵连，必须在我们的证券制度内运作”", "title_en": "SEC Chairman Gary Gensler: stock tokens and stablecoins backed by securities “are implicated by the securities laws and must work within our securities regime”", "transed": 1, "url": "https://www.coindesk.com/sec-chair-hints-some-stablecoins-are-securities", "via": "", "real_tags": ["股票", "证券"]}, {"category": "", "categoryclass": "", "imagename": "8a5277f00833a767fecfb6fc0c85a04d.jpg", "infoid": 1068899, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊的 Alexa 设备是环境计算机，不是你整天使用的那种。当您向 Echo 提问或看一眼 Echo Show 的小屏幕时，语音助手只有短暂的机会给人留下深刻印象。今天，亚马逊宣布将向第三方开发商提供更多这样的机会——包括全新的小部件和特色技能卡，它们可能会占用你智能音箱的大部分宝贵空间。以下是该公司今天在其 Alexa Live 活动中宣布的那些内容以及其他所有内容。正如您在上面亚马逊的模型中看到的那样，小部件看起来与您预期的非常相似。在一篇博客文章中，亚马逊将它们描述为“丰富的、可定制的、可浏览的、自我更新的技能内容视图”，您可以在其中检查待办事项列表中的项目或激活技能的功能，而无需先说“Alexa”。目前尚不清楚它们的局限性，或者它们是否可以有效地为 Echo Show 构建触摸屏应用程序。特色技能卡可能会引起一些争议，具体取决于它们的有用程度。即使您没有要求，它也会在您的主屏幕上推广新的 Alexa 技能。 Amazon Alexa Skills 副总裁 Aaron Rubenson 告诉 The Verge，这不完全是一种广告服务，开发人员不必为此付费。 “每个人都可以举手说他们想成为其中的一部分，”他说，并补充说你会看到基于你发送给 Alexa 的其他信号的个性化结果。首批特色技能卡之一将是喜剧中心，鲁本森说他很可能会看到它，因为他每天早上已经在 Alexa Flash Briefing 中听了一些喜剧。但即使您没有带屏幕的 Echo 设备，您也可能很快会收到更多 Alexa 技能建议。亚马逊表示，它正在扩展其无名称交互工具包，当你说出“Alexa，纳斯达克今天表现如何？”之类的短语时，让技能自愿得到提升。 “我们让开发人员举手说，&#39;我的技能可以处理这个请求，&#39;”鲁本森说。如果您同意使用亚马逊建议的技能，Alexa 可以传递您的请求，而不是让您重复自己。虽然亚马逊是之前唯一一家从通过 Alexa 销售的实体商品中获利的公司，但该公司现在将让 Alexa 技能开发人员在他们的技能范围内销售产品以及 Alexa 购物行为，并从亚马逊获得高达 10% 的联盟营销佣金。正如预期的那样，您只能销售在 Amazon.com 上列出的产品，尽管它们不一定是您的产品。 （鲁本森不能说亚马逊是否会允许实际上只是商店的技能。）亚马逊还引入了付费技能，所以如果您在使用下一个 Alexa 应用程序之前必须付款而不是之后使用应用程序内购买，请不要感到惊讶.\n虽然亚马逊似乎还没有吸引竞争对手苹果、谷歌和三星参与其语音互操作性计划，但它在这方面也有一些消息。 Rubenson 表示，三星将有一个冰箱，同时 Bixby 和 Alexa“并排运行”，该公司的 Alexa 定制助手（允许品牌创建自己的 Alexa 驱动的助手）将出现在 Verizon 智能显示器中，Alexa 可以在其中处理标准的 Alexa新的 Verizon 助手可以处理诸如检查无线帐单之类的请求。 Rubenson 说，他们也可以互相传递请求。除了这些亮点之外，这里还有一个快速的项目符号列表，列出了吸引我眼球的其他 Alexa 更新：用于“高质量、送餐和取货体验”的 Food Skill API。 Domino&#39;s Pizza 会在某个时候使用它；这是一个示例：发送到电话，“客户可以在其支持 Alexa 的设备上开始体验，然后在他们的手机上继续体验。”麦当劳英国、Twitter、Husqvarna、伊比利亚航空公司、Cookpad 和 Lysol 将把他们的移动应用程序与 Alexa 技能连接起来。基于事件的触发器和主动建议：“例如，如果客户要去上班，客户可以选择主动建议他们锁家的技能。” Whole Foods 将在今年晚些时候推出“路边取货体验”。今年晚些时候，@WholeFoods 将使用基于事件的触发器和主动建议推出主动路边取货体验。 #AlexaLive pic.twitter.com/AHSBXhOIvS — Alexa 开发人员 (@alexadevs) 2021 年 7 月 21 日\nFind My 正在向更多拥有类似 Tile 的设备跟踪器的公司开放“Alexa，Find my”命令，三星和 Remote+ 将于今年晚些时候推出。 Alexa Device Discovery 将能够发现新类别的设备，如打印机和智能电视。 Alexa 实体现在允许任何技能开发人员访问 Alexa 的知识图以获得一般答案。请注意，这不是整个列表：亚马逊的完整博客文章中还有更多内容。此外，亚马逊今天宣布，几乎所有 Echo 智能音箱都将支持 Matter，这是一项雄心勃勃的智能家居设备开放标准。这些新功能都是今天公司 Alexa Live 开发者大会的一部分，它正在寻求吸引下一代程序员为其语音助手培养技能。亚马逊表示，它现在拥有 900,000 名注册开发人员和 130,000 名技能（高于一年前的 750,000 名开发人员和 2019 年 9 月的 100,000 名技能），Rubenson 告诉我们，开发人员的收入每年翻一番，一些技能开发人员的年收入超过 100 万美元。更新，美国东部时间下午 1 点 04 分：添加了一个指向亚马逊完整博客文章的链接，以及一些嵌入的视频。", "note_en": "Amazon’s Alexa devices are  ambient computers, not the kind you use all day. When you  do ask your Echo a question or glance at your Echo Show’s diminutive screen, the voice assistant only has a brief chance to impress. Today, Amazon is announcing it’s going to give more of those opportunities to third-party developers — including brand-new widgets and featured skill cards that might take up a chunk of your smart speaker’s precious real estate.\n Here’s what to expect from those and everything else the company’s announcing at its Alexa Live event today.\n As you can see in Amazon’s mockup above,  widgets look pretty much as you might expect. In a blog post, Amazon describes them as “rich, customizable, glanceable, self-updating views of skill content” where you can check items off a to-do list or activate a skill’s functions, without needing to say “Alexa” first. It’s not yet clear how limited they are or if they might effectively be a way to build a touchscreen app for an Echo Show.\n  Featured skill cards   might be slightly controversial, depending on how useful they are. It promotes new Alexa skills on your home screen, even if you haven’t asked for them. It’s not exactly an advertising service, Amazon Alexa Skills VP Aaron Rubenson tells  The Verge, not something developers will have to pay for. “It’s open to everybody to raise their hand and say they want to be part of it,” he says, adding that you’ll see personalized results based on other signals you send Alexa. One of the first featured skill cards will be Comedy Central, and Rubenson says he might well see it because he already listens to some comedy in his Alexa Flash Briefing each morning.\n But even if you don’t have an Echo device with a screen, you may get more Alexa skills suggested to you soon. Amazon says it’s expanding its  name-free interaction toolkit to let skills volunteer to be promoted when you speak phrases like “Alexa, how did the Nasdaq do today?”\n “We’re letting developers raise their hand and say, ‘My skill can handle that request,’” says Rubenson. And if you agree to use Amazon’s suggested skills, Alexa can pass along your request instead of making you repeat yourself.\n  While Amazon was the only one that previously profited from physical merchandise sold through Alexa, the company will now let Alexa skill developers sell products inside their skills as well with  Alexa shopping actions and get up to a 10 percent affiliate marketing commission from Amazon, too. As expected, you can only sell products listed on Amazon.com, though they don’t need to be  your products. (Rubenson couldn’t say whether Amazon would allow skills that are effectively just stores.) Amazon’s also introducing  paid skills, so don’t be surprised if you have to pay before using your next Alexa app instead of using an in-app purchase afterward.\n  While Amazon  still doesn’t seem to have attracted rivals Apple, Google, and Samsung to its voice interoperability initiative yet, it does have some news on that front as well. Rubenson says Samsung will have a fridge with both Bixby and Alexa “operating side by side,” and the company’s  Alexa Custom Assistant (which lets brands create their own Alexa-powered assistant) will appear in a Verizon smart display where Alexa can handle standard Alexa tasks while the new Verizon assistant can handle requests like checking your wireless bill. Rubenson says they can hand off requests to each other, too.\n In addition to those highlights, here’s a quick bulleted list of other Alexa updates that caught my eye:\n Food Skill APIs for “high-quality, food delivery and pickup experiences.” Domino’s Pizza will use it at some point; here’s an example:\n   Send to Phone where “customers can start an experience on their Alexa-enabled device, and continue it on their mobile phone.”  McDonald’s UK, Twitter, Husqvarna, Iberia Airlines, Cookpad, and Lysol will connect their mobile apps with Alexa skills.\n  Event-Based Triggers and Proactive Suggestions: “For example, if a customer is heading out for work, customers could opt in to have a skill proactively suggest that they lock their home.” Whole Foods will launch a “curbside pickup experience” later this year.\n Later this year,  @WholeFoods will launch a proactive curbside pickup experience using event-based triggers and proactive suggestions.  #AlexaLive  pic.twitter.com/AHSBXhOIvS\n— Alexa Developers (@alexadevs)  July 21, 2021\n Find My is opening up the “Alexa, Find my” command to more companies with Tile-like device trackers, with Samsung and Remote+ arriving later this year.\n Alexa Device Discovery will be able to discover new categories of devices like printers and smart TVs.\n Alexa Entities now lets any skill developer access Alexa’s knowledge graph for general answers.\n That’s not the whole list, mind you: there’s even more  in Amazon’s full blog post. In addition, Amazon is announcing today that  almost every Echo smart speaker will support Matter, a new ambitious open standard for smart home devices.\n The new features are all coming as part of the company’s Alexa Live developer conference today, where it’s seeking to attract the next generation of programmers to build skills for its voice assistant. Amazon says it now has 900,000 registered developers and 130,000 skills ( up from 750,000 developers a year ago and  100,000 skills in September 2019), and Rubenson tells us developer revenue has doubled annually, with some skill developers making over $1 million a year.\n Update, 1:04 PM ET:  Added a link to Amazon’s   full blog post , and some embedded videos.", "posttime": "2021-07-22 22:24:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,亚马逊,amazon,技能,alexa", "title": "亚马逊为 Alexa 设备推出了 50 多项新功能，以推动技能开发人员的增长，例如在主屏幕上推荐的特色技能卡", "title_en": "Amazon unveils over 50 new features for Alexa devices to drive growth for skills developers, like featured skill cards, which are recommended on the home screen", "transed": 1, "url": "https://www.theverge.com/2021/7/21/22586033/amazon-alexa-widgets-featured-skill-api-developers-echo-show-screen?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["开发", "亚马逊", "amazon", "技能", "alexa"]}, {"category": "", "categoryclass": "", "imagename": "f27c25009e46aa1cddd56fcd6fd76cb3.jpeg", "infoid": 1068898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Virtually Human Studio 是数字赛马服务 Zed Run 背后的初创公司，已经筹集了 2000 万美元的融资，突显了投资者对探索娱乐、游戏和所谓的不可替代代币行业交叉领域的公司的兴趣。专注于媒体和技术的投资公司 TCG Capital Management 领投了 A 轮融资，Andreessen Horowitz 和 Red Beard Ventures 也参与了这笔交易。 Zed Run 于 2019 年推出，使用户能够购买、出售和繁殖虚拟马匹，并在电子游戏风格的环境中与其他马匹比赛。这些马用数字货币购买并充当 NFT，本质上是具有价值的数字收藏品。 Zed Run 从用户支付的费用中收取费用，用于在网站上虚拟繁殖马匹，以及比赛报名费和这些 NFT 的销售。当他们的马匹价值上涨时，个人虚拟马主就会赚钱，从而在 Zed Run 的马匹繁殖市场和马匹转售市场上吸引更高的价格。每场比赛都会在以太坊（一种加密货币）中获得第一到第三名的奖金。 Zed 数字赛马的价格从 130 美元到 45,000 美元不等。该公司表示，包括多匹马在内的整个马厩售价超过 25 万美元，业主可以转售马匹。 《华尔街日报》将向您收取 $ + 税款（如果适用）。您可以随时在客户中心更改您的计费偏好或致电客户服务。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客户服务部取消订阅。", "note_en": "Virtually Human Studio, the startup behind digital horse racing service Zed Run, has raised $20 million in financing, highlighting investors’ appetite for companies exploring the intersection of entertainment, gaming and the so-called nonfungible token sector.\n  Media and technology-focused investment firm TCG Capital Management led the Series A funding round, with Andreessen Horowitz and Red Beard Ventures also participating in the deal.\n  Launched in 2019, Zed Run enables users to buy, sell and breed virtual horses and race them in a videogame style setting against other horses. The horses are purchased with digital currency and act as NFTs, which are essentially digital collectibles that hold value.\n  Zed Run takes a fee from the money users pay to virtually breed horses on the site, as well as from race entry fees and the sale of these NFTs. Individual virtual horse owners stand to make money when the value of their horses rises, attracting higher prices on Zed Run’s horse breeding market and on the horse resale market. Every race also pays prizes for first through third place finishes in Ethereum, a cryptocurrency.\n  The price of Zed’s digital racehorses range from $130 to $45,000. Whole stables, which include multiple horses, have sold for over $250,000 and owners can resell horses, the company said.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-07-22 22:24:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "human,led", "title": "Virtually Human Studio 是 Zed Run 背后的初创公司，它允许用户培育和比赛作为 NFT 买卖的虚拟马，在 A 轮融资中筹集了 2000 万美元，由 TCG 领投", "title_en": "Virtually Human Studio, the startup behind Zed Run, which lets users breed and race virtual horses bought and sold as NFTs, raises $20M Series A led by TCG", "transed": 1, "url": "https://www.wsj.com/articles/tcg-and-andreessen-horowitz-invest-in-startup-behind-virtual-horse-racing-platform-11626865200?mod=djemalertNEWS", "via": "", "real_tags": ["human", "led"]}, {"category": "", "categoryclass": "", "imagename": "1f029126052a78a163dca7e4e7608eb1.jpeg", "infoid": 1068897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三公布的一项新法案将使一些公司在被黑客入侵时通知政府。 “网络事件通知法”是对最近对 SolarWinds 和 Colonial Pipeline 的攻击的回应。周三公布的一项新法案将要求一些公司在遭到黑客攻击时通知政府。两党共同制定的《网络事件通知法》是对最近对 SolarWinds 和殖民管道的攻击的回应，该攻击影响了政府机构，而 Colonial Pipeline 则中断了该国大部分地区的燃料供应。从那时起，勒索软件攻击（黑客对文件进行加密直到受害者支付赎金）激增。问题是，根据联邦法律，公司不必报告这些攻击。这意味着某些攻击可能会在政府不知情的情况下发生，如果政府自己的系统受到黑客攻击的影响，这可能会产生严重影响。拟议的法案将引入一项新的披露要求，要求联邦机构、联邦承包商和关键基础设施公司在发现其系统遭到破坏时通知国土安全部。它还赋予这些公司在报告违规行为时有限的豁免权——例如，股东无法获得披露的信息以在诉讼中用作证据。它还需要国土安全部对个人身份信息进行匿名处理。这样，公司可以快速报告事件，并允许政府在需要时有效地采取行动。参议院情报特别委员会主席马克华纳（弗吉尼亚州）、副主席马可卢比奥（佛罗里达州）和高级成员苏珊柯林斯（缅因州）领导了这项立法，该立法回应了他们在早些时候的听证会上听到的关于SolarWinds 攻击。\n在听证会上，微软总裁布拉德史密斯作证说，政府和公众知道这次黑客攻击的唯一原因是因为网络安全公司 FireEye 在 12 月报告了它认为是国家支持的对其自身系统的攻击。在那次披露之后，路透社报道了通过 SolarWinds 软件更新对美国机构的潜在攻击。消息人士后来告诉路透社，这次袭击与 FireEye 入侵有关。这次攻击向立法者展示了他们很容易被重大政府黑客攻击而蒙在鼓里。它还揭示了公司在决定是否报告网络攻击时面临的障碍。 FireEye 首席执行官凯文·曼迪亚 (Kevin Mandia) 在听证会上接受 CNBC 的 Eamon Javers 采访时表示，披露是“一个该死的复杂问题”。 “这是一个复杂问题的原因是因为公司在公开披露信息时面临的所有责任，”曼迪亚说。 “他们有股东诉讼，他们有很多对业务影响的考虑。你也不想不必要地制造很多恐惧、不确定性和怀疑。”新法案旨在通过引入有限责任保护来缓解企业的这种担忧。当华纳在 6 月份取笑立法时，他说他相信商界会接受它。 “当我们在六七年前进行这场辩论时，商界并不想要任何额外的强制性报告，”他当时表示。 “我认为他们现在意识到，如果没有强制报告，他们自己就会处于危险之中。”", "note_en": "A new bill unveiled Wednesday would make some companies tell the government when they&#39;ve been hacked.\n  The &#34;Cyber Incident Notification Act&#34; is a response to the recent attacks on SolarWinds and Colonial Pipeline.\n A new bill unveiled Wednesday would make some companies tell the government when they&#39;ve been hacked.\n The bipartisan Cyber Incident Notification Act is a response to the recent  attacks on  SolarWinds, which impacted government agencies, and Colonial Pipeline, which disrupted access to fuel across a large region of the country. Since then, ransomware attacks — where hackers encrypt files until a victim pays a ransom — have proliferated.\n  The problem is, under federal law, companies don&#39;t have to report these attacks. That means some attacks may occur without the government knowing, which can have serious implications if the government&#39;s own systems are affected by the hack.\n The proposed bill would introduce a new disclosure requirement for federal agencies, federal contractors and critical infrastructure companies to notify the Department of Homeland Security when they identify a breach of their systems. It also gives those companies limited immunity when they report a breach — for instance, shareholders could not gain access to the disclosed information to use as evidence in a lawsuit. It also would require DHS to anonymize personally identifiable information. That way, companies can report incidents quickly and allow the government to act efficiently where needed.\n  Senate Select Committee on Intelligence Chairman Mark Warner, D-Va., Vice Chairman Marco Rubio, R-Fla., and senior member Susan Collins, R-Maine, led the legislation, which responds to concerns they heard at an earlier hearing about the SolarWinds attack.\n At the hearing,  Microsoft President Brad Smith  testified that the only reason the government and public were aware of the hack was because cybersecurity firm  FireEye reported what it believed to be a state-sponsored attack on its own systems in  December. After that disclosure,  Reuters reported on a potentially adversary-linked hack into U.S. agencies through SolarWinds software updates. Sources later told Reuters that attack was linked to the FireEye intrusion.\n  The attack showed lawmakers just how easily they could have been left in the dark on a major government hack. It also revealed the obstacles companies face when deciding whether to report a cyberattack.\n  FireEye CEO Kevin Mandia told CNBC&#39;s Eamon Javers in an interview at the time of that hearing that disclosure is &#34;a damn complex issue.&#34;\n &#34;The reason it&#39;s a complex issue is because of all the liabilities companies face when they go public about a disclosure,&#34; Mandia said. &#34;They have shareholder lawsuits, they have lots of considerations of business impact. You also don&#39;t want to unnecessarily create a lot of fear, uncertainty and doubt.&#34;\n The new bill aims to ease that fear for businesses by introducing the limited liability protection. When Warner  teased the legislation in June, he said he believed the business community would be receptive to it.\n &#34;When we had this debate six or seven years ago, the business community did not want any additional mandatory reporting,&#34; he said at the time. &#34;I think they now realize that they themselves are put in jeopardy if they don&#39;t have mandatory reporting.&#34;", "posttime": "2021-07-22 22:24:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,美国,companies,攻击", "title": "拟议的两党法案将要求公司在遭到黑客攻击时通知美国政府，并在报告后为公司提供有限的豁免权", "title_en": "Proposed bipartisan bill would require companies to notify the US government when they are hacked, and provides limited immunity to companies after reporting", "transed": 1, "url": "https://www.cnbc.com/2021/07/21/new-bill-would-make-some-companies-report-cyber-attacks-to-government.html", "via": "", "real_tags": ["黑客", "美国", "companies", "攻击"]}, {"category": "", "categoryclass": "", "imagename": "43d55dcbc2ef1a72d9c8ec0b124de4b6.jpg", "infoid": 1068896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十年前，许多科技工作者似乎更关心他们的股票期权，而不是组建工会。但在过去两年中，越来越多的科技工作者已经组建或试图组建工会，其中包括谷歌的一个非常强大且迅速扩张的工会——据一份报告称，现在约有一半的科技工作者有兴趣加入工会Protocol 与 Morning Consult 合作进行的调查。在 6 月 17 日至 7 月 2 日进行的调查中，50% 的被认定为技术行业工人的受访者表示，他们非常或有点有兴趣在工作场所加入工会。不到 50% 的科技行业工人也表示，他们的知识，肯定或可能有兴趣在他们的工作场所组建工会。 （要查看误差幅度和其他有关方法论的问题，请参阅协议如何设计调查的解释。）“在某些方面，这有点疯狂，因为技术工会不是一回事。而且仍然是二分之一的工人就像，这是一个好主意，”CODE-CWA 的主管 Wes McEnany 说。 CODE-CWA 是美国通信工人协会，致力于将科技行业工会化。到目前为止，CWA 以技术为重点的努力代表了 Alphabet 工人工会、Mobilize、Mapbox、纽约时报技术公会、Glitch 等，除 Glitch 外，其他所有组织都在 2021 年正式宣布了他们的工会。办公室和专业雇员国际工会也已经为较小的科技公司开始了类似的努力，称为 Tech Workers Local 1010，代表 Kickstarter 工会。 “很明显，自从我们发起 CODE 活动以来，我们已经看到了大量的兴趣。Alphabet 工人工会继续发展，这得到了很多人的参与。这里有一些非常令人鼓舞的事情，”McEnany 说。在调查中，Protocol 发现种族或民族身份对工会利益的影响很小；例如，认定为黑人或白人的人的兴趣水平几乎相同，仅高于和低于 50%。对于 McEnany 来说，这些数据帮助证实了他的理论，即种族问题与工人是否对工会感兴趣几乎没有关系。 “我认为种族在这些事情上并不重要，”麦肯尼说。 “工人有问题。科技公司有问题，对每个人来说都是问题。而且种族问题让所有工人都很恼火，因为白人工人因为无法留住有色人种工人而感到被冒犯和愤怒。”但是，虽然民族和种族认同并没有起到很大的作用，但年龄肯定有。千禧一代对加入工会的兴趣远远超过劳动力中的任何其他一代；该年龄范围内超过 60% 的调查受访者表示他们肯定或可能感兴趣，而 X 世代和 Z 世代的这一比例不到 40%（尽管 Z 世代的样本量非常小），婴儿潮一代的这一比例低于 10% .该数据与 McEnany 的经验一致，他说大多数向他咨询组建工会的人都是千禧一代或 Z 世代。“这通常与建立工会有关，年轻人通常在社会变革方面处于领先地位，”他说。 McEnany 表示，工会往往会在高压社会变革的短暂时刻形成，他说兴趣如此之高，因为目前年轻人正感受到这种压力。 “从历史上看，我们在高涨的行业中组建工会。它们有点发生在这些压缩点，这些压缩点发生的时间并不长，”他说。\n一些企业领导人将技术工人工会视为工人集体组织改变他们不喜欢的文化或环境的标志。 “我认为工会是一个非常重要的问题解决方案。但它也是承认有一个问题需要首先解决，就像任何有员工加入工会的公司一样。就像，伙计，你必须听着，” Expensify 首席执行官大卫巴雷特在周二的协议活动中说。然而，许多领导工人组织工作的人反而认为工会是一种有助于保护工人并确保良好文化保持这种状态的力量。许多新工会成立于小型、非常先进的技术工作场所，例如 Mobilize。工会的成立并不是为了解决任何一个明显的问题，而是为了编纂和保护在公司工作的文化利益。 “显然，我们在为进步的雇主工作时处于特权地位，但如果我们不这样做，那些为不那么进步的雇主工作的人怎么会去做呢？”一名 Mobilize 员工在 3 月份告诉 Protocol。 “就像 Glitch 一样，我认为我们可以作为其他雇主的榜样，让其他雇主看到这不一定是一个真正对抗性的过程，这样我们就可以共同努力找出工人想要什么，”他说。 “在接下来的 30 到 40 年里，有这么多人对工会感兴趣，这给了我们很大的希望，”麦肯尼说。 “他们认为事情已经一团糟，他们的工作应该有更多的代理权，他们的创作中存在许多与生俱来的问题，事情需要改变，对我来说，这些数据证实了这一点。”", "note_en": "A decade ago, many tech workers seemed more concerned with their stock options than forming a union. But in the last two years, a growing list of tech workers have formed unions or tried to, including  a very powerful and rapidly-expanding one at Google — and about half of all tech workers are now interested in joining a union, according to a  survey conducted by Protocol in partnership with Morning Consult.\n Fifty percent of survey respondents who identify as technology industry workers said that they are very or somewhat interested in joining a union at their workplace in the survey, conducted from June 17-July 2. Just under 50% of tech industry workers also said that to their knowledge, there is definitely or probably interest in forming a union at their workplace. (To review margins of error and other questions about methodology, see this explanation of how Protocol designed the survey.)\n  &#34;That&#39;s kind of crazy, in some ways, because unions in tech aren&#39;t a thing. And still one out of two workers are like, this is a good idea,&#34; said Wes McEnany, the director of CODE-CWA. CODE-CWA is the Communications Workers of America&#39;s dedicated effort to unionize the tech industry. So far, the CWA tech-focused effort represents the  Alphabet Workers Union,  Mobilize,  Mapbox, the  New York Times tech guild,  Glitch and others, and all but Glitch formally announced their unions in 2021. The Office and Professional Employees International Union has also embarked on a similar effort for smaller tech companies, called Tech Workers Local 1010, which represents the Kickstarter union.\n &#34;Obviously we&#39;ve seen a ton of interest since we&#39;ve launched the CODE campaign. The Alphabet Workers Union continues to grow, that&#39;s gotten a lot of play with a lot of folks. There is something really encouraging here,&#34; McEnany said.\n In the survey, Protocol found very little difference in union interest by racial or ethnic identity; people who identify as Black or white, for example, had nearly identical levels of interest, just above and below 50%. For McEnany, this data helped confirm his theory that questions of race had little relationship to whether workers are interested in unionization. &#34;I don&#39;t think race matters much in these things,&#34; McEnany said. &#34;Workers have issues. Tech companies have problems that are problems for everybody. And there&#39;s issues around race that piss off all of the workers, because white workers are offended and angry that they can&#39;t retain workers of color.&#34;\n    But while ethnic and racial identity doesn&#39;t play a very big role, age certainly does. Millennials are far more interested in joining unions than any other generation in the workforce; more than 60% of survey respondents in that age range said they are definitely or probably interested, compared to less than 40% for Generation X and Generation Z (although the Gen Z sample size was very small), and below 10% for baby boomers. That data aligns with McEnany&#39;s experience, who said that most of the people who approach him about forming a union are millennial or Gen Z. &#34;That just generally tracks with building unions, younger people generally lead the way on social change,&#34; he said.\n Unions tend to form during short moments of high-pressure social change, according to McEnany, and he said that interest is so unusually high because young people are, at the moment, feeling that pressure. &#34;Historically, we form unions in industries in upsurges. They sort of happen in these compression points that happen over not very many years,&#34; he said.\n Some corporate leaders see tech worker unionization as an indication that workers are collectively organizing to change a culture or environment they dislike. &#34;I think that the union is a really important solution to a problem. But it&#39;s also recognition that there was a problem to be solved in the first place inside, it&#39;s like any company where there are employees unionizing. It&#39;s like, man, you gotta listen,&#34; said Expensify CEO David Barrett at  a Protocol event Tuesday.\n  Yet many of the people leading worker organizing efforts instead understand unions to be a force that helps protect workers and also ensures good cultures remain that way. Many of the new unions have formed at small, very progressive tech workplaces, like Mobilize. The union didn&#39;t form to address any one glaring issue, but instead as part of an effort to codify and preserve the cultural benefits of working at the company. &#34;Obviously we have a privileged position where we work for a progressive employer, but if we don&#39;t do it, how are the people who are going to work for less progressive employers going to do it?&#34;  one Mobilize employee told Protocol in March. &#34;Like Glitch, I think that we can serve as an example for other employers to see that it doesn&#39;t have to be this really confrontational process, so that we can work together to figure out what workers want,&#34; he said.\n &#34;The fact that this many people that are going to be in the workforce for the next 30-40 years are interested in unions, it gives us a lot of hope,&#34; McEnany said. &#34;They have a perspective that things are messed up and they should have more agency at their jobs, a lot of problems that are innate to their creation, and things need to change, and for me this data is confirming that.&#34;", "posttime": "2021-07-22 22:24:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "工会,unionizing", "title": "民意调查：在 750 名科技工作者中，至少有一半对加入工会感兴趣，约 50% 表示已经有兴趣在他们的工作场所加入工会", "title_en": "Poll: of 750 tech workers, half are at least somewhat interested in joining a union, and ~50% say there is already interest of unionizing at their workplace", "transed": 1, "url": "https://www.protocol.com/workplace/workplace-survey-2021/tech-worker-unionization", "via": "", "real_tags": ["工会"]}, {"category": "", "categoryclass": "", "imagename": "11a0542db58cfce833beda7fe00577fb.jpg", "infoid": 1068895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（路透社） - 电子发现提供商 CS Disco Inc 周三在纽约证券交易所首次公开亮相，股价较开盘价上涨 28% 以上，收于 41 美元。这家总部位于奥斯汀的公司为企业法律部门和律师事务所提供用于电子发现、法律文件审查和案件管理的人工智能软件，交易代码为“LAW”。 DISCO 创始人兼首席执行官 Kiwi Camara 在股票开始交易时接受采访时表示：“我们认为软件正在进入法律职能，该软件将有助于自动化法律部门和律师事务所历来使用的许多服务。”周三。 DISCO 将其 700 万股普通股的首次公开募股定价为每股 32 美元，高于预期范围。根据公司对 IPO 后发行在外的 5628 万股股票的预期，周三收盘价为 41 美元，公司估值约为 23 亿美元。卡马拉说，DISCO 正在上市，因为该行业“处于从服务到软件过渡的早期阶段”。他说，随着 IPO 的进行，该公司计划投资并扩大其在美国、欧洲、加拿大以及最终其他地方的上市组织。 “我们决定上市，因为我们认为在法律技术领域真的有机会建立一家大型独立公司，”卡马拉说。 “而且我们认为，作为一家上市公司，我们的客户清楚地表明，DISCO 可以成为他们的长期合作伙伴，他们是世界上一些最大的公司以及世界各地许多律师事务所的总法律顾问，当他们思考技术将如何改变他们的工作时。” DISCO 于 2013 年推出，起源于 Camara &amp; Sibley，这是一家由 Camara 帮助创立的德克萨斯州诉讼精品店。他说，该公司着手“构建软件来自动化我们正在做的事情，这不是我们去法学院的原因”。 “这就是法律技术的魔力。”\n卡马拉早些时候表示，“不愿投资法律技术，因为该领域并没有真正取得本垒打的结果。” “我们希望 DISCO IPO 将成为更多早期融资和法律技术创新的催化剂，”他说。投资者一直在关注该行业，过去一年，从 Clio 到 Rocket Lawyer 再到 Reynen Court 等各种法律技术和在线法律服务领域的公司都吸引了资金。 DISCO 也是最近几周上市的最新一家法律科技相关公司，此前在线法律服务公司 LegalZoom Inc 和位于帕洛阿尔托的软件提供商 Intapp Inc 于 7 月 1 日上市。 Dealmaking 也积极参与电子发现空间。其他供应商，包括 Relativity ODA LLC 和 Exterro Inc，也吹捧了人工智能的承诺，以帮助改变法律团队的服务，在最近几个月进行收购和改进产品。 Camara 表示，DISCO 与其竞争对手的区别在于“我们使用技术的程度”，并强调 DISCO 是一项软件业务，而不是一项服务业务。他说，随着“涉及法律事务的数据量激增”，在电子取证和法律文件审查中利用自动化和人工智能的优势变得越来越重要。", "note_en": "(Reuters) - E-discovery provider CS Disco Inc made its public debut on the New York Stock Exchange on Wednesday, with shares jumping more than 28% over their opening price to close at $41.\n The Austin-based company, which provides artificial intelligence-powered software for e-discovery, legal document review and case management to corporate legal departments and law firms, listed under the trading symbol &#34;LAW.&#34;\n &#34;We think that software is coming to the legal function, that software will help automate away a lot of the services that have historically been used by legal departments and law firms,&#34; DISCO founder and CEO Kiwi Camara said in an interview as shares began trading Wednesday.\n DISCO priced the initial public offering of seven million shares of its common stock at $32 per share, above the expected range. Based on the company&#39;s expectation of 56.28 million shares outstanding after the IPO, Wednesday&#39;s ending $41 share price would value the company at about $2.3 billion.\n DISCO is going public as the industry is &#34;in early stages of this transition from services to software,&#34; Camara said. With the IPO under its belt, the company plans to invest in and scale up its go-to-market organization in the United States, Europe, Canada and eventually elsewhere, he said.\n &#34;We decided to go public because we think there&#39;s really an opportunity to build a big independent company in the legal technology space,&#34; Camara said. &#34;And we think being a public company makes clear to our customers, who are general counsel at some of the largest firms in the world, as well as many law firms around the world, that DISCO can be a long-term partner for them, as they think about how technology will transform their work.&#34;\n DISCO, which launched in 2013, grew out of Camara &amp; Sibley, a Texas litigation boutique that Camara helped found. The company set out to &#34;build software to automate the things we were doing that weren&#39;t why we went to law school,&#34; he said. &#34;That&#39;s the magic of legal tech.&#34;\n Camara said early on there was &#34;reluctance to invest in legal tech, because there had not really been a home run outcome in the space.&#34;\n &#34;We hope the DISCO IPO will be a catalyst for a lot more early stage financing and a lot more innovation in legal tech,&#34; he said.\n Investors have been eyeing the sector, with companies in a variety of legal tech and online legal services spaces from  Clio to  Rocket Lawyer to  Reynen Court attracting funding in the past year. DISCO is also the latest legal tech-related company to go public in recent weeks, after online legal services company LegalZoom Inc and Palo Alto-based software provider Intapp Inc made their  market debut July 1.  Dealmaking has also been active in the e-discovery space.\n Other providers, including  Relativity ODA LLC and  Exterro Inc, have also touted the promise of artificial intelligence to help transform services for legal teams, making acquisitions and revamping offerings in recent months.\n Camara said that what differentiates DISCO from its competitors is &#34;how much we use technology,&#34; emphasizing that DISCO is a software business rather than a services business. The advantage to utilizing automation and AI in e-discovery and legal document review is becoming more important as &#34;the volume of data that&#39;s involved in legal matters explodes,&#34; he said.", "posttime": "2021-07-22 22:23:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,软件,人工智能,debut,法律", "title": "提供基于人工智能的软件以简化法律服务的 Disco 在首次交易中收盘上涨 28%，对该公司的估值约为 $2.3B", "title_en": "Disco, which provides AI-powered software to simplify legal services, closed up 28% in its trading debut, valuing the company at ~$2.3B", "transed": 1, "url": "https://www.reuters.com/legal/transactional/disco-shares-jump-ceo-says-software-is-coming-legal-sector-2021-07-21/", "via": "", "real_tags": ["交易", "软件", "人工智能", "debut", "法律"]}, {"category": "", "categoryclass": "", "imagename": "9dab4b137d259782bc98dfc1c8d8e6d2.jpg", "infoid": 1068894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "说到混合工作，老实说：人们不知道该想什么。每周在办公室呆两天或三天是最佳选择吗？五天是交易破坏者吗？我们重复听到别人说的话或凭直觉行事，但我们中的任何人如何真正知道？这是在经历了最灾难性的世界事件之后，我们就工作灵活性进行的第一次真正的全国性对话。现在，公司正在应对压力，要求他们在有机会尝试并看看什么可行之前就提出长期计划和答案。领导者应该承认，“我们还不确定计划是什么”，但没有人想听到这个。我们需要接受一些不确定性，同时对每个人保持灵活性。随着人们的回归，每家公司都应该查看其数据，以了解需要什么以及人们喜欢什么。根据大约数百家使用办公桌的公司的 Envoy 客户使用数据，我目前看到的是，公司正在调整他们的空间，选择开放而不是永久办公桌。他们在需要时为人们提供预订办公桌或会议空间的选项，并且根据谁来的数据，他们正在调整他们的政策。现在，工作正在远程完成，据称人们比以往任何时候都更有效率。但许多人并没有那么享受他们的工作，因为他们缺少一种社区意识和内在文化，而这些在办公室中本来是自动产生的。距离很重要。团队在身体上团结在一起很重要，而现在真正实现这一点需要意图。你需要组织人们回到办公室，在特定的地方和一个时间表。您需要合适的工具来简化办公桌轮用、寻找会议室、管理办公室容量和同步日程等平凡的办公室任务，以便团队可以坐在一起、联系、发挥创造力，并且，您知道，为其他日常工作带来一些人性化——日常工作。混合工作有其后勤方面的挑战，每家公司看起来都不一样，但它使文化保持活力，社区保持强大，让人们尽其所能。在大流行期间，我们的工作方式发生了根本性的变化——而且没有回头路。员工不想回到大流行前以办公室为基础的工作文化，但他们也不想完全远离。相反，他们想要一个全新的工作模式，结合两全其美。 Slack 未来论坛的研究表明，93% 的知识工作者希望在工作时灵活，而 76% 希望在工作地点灵活。但员工不希望不惜一切代价获得灵活性。相反，他们希望在可预测的框架内具有灵活性。三分之二 (65.6%) 希望在完全灵活性和可预测框架之间取得平衡。成功实现这一转变取决于从以办公室为中心的基础设施转变为数字优先的基础设施。数字优先是关于满足员工的需求并帮助他们完成最佳工作。这意味着让人们能够在最适合他们的时间和地点工作，而实体办公室只是可用于支持协作的工具之一。例如，虽然 Slack 将始终支持需要个人空间的人的需求，但我们将专注于使用我们的实体办公室，以团队和客户为中心的工作。\n让员工长时间在中央办公室外工作或按混合时间表工作可能会很困难，因为我们可能会失去那些偶然发生的有机、自发的联系，并有助于培养社区意识。但是，通过优先考虑数字基础设施和物理基础设施——倾向于使用 Slack 等数字工具和异步通信，以确保员工拥有完成最佳工作所需的灵活性——我们可以为员工创造有意义的联系，无论他们如何或何时工作，都可以为他们建立社区。 2020 年初，全球突然转向在家工作，这迫使大多数组织采用远程工作。这意味着提供笔记本电脑，为设立家庭办公室提供津贴，并允许人们自行管理他们的日程安排（以适应护理义务和其他与 COVID 相关的挑战）。但公司没有预料到的是，员工不想回到大流行前的模式。事实上，在超过 18 个月后，员工已经适应了这种变化，他们养成了新习惯，并且更加喜欢灵活性。他们也开始对僵化的朝九晚五、每周工作五天的工作模式表示不满，因为他们缺乏包容性、多样性和信任。仅在 2021 年 4 月，就有超过 400 万美国人辞职。那么，企业如何才能留住最优秀的人才并吸引最优秀的人才呢？采用分布式工作，为团队提供更大的灵活性，并为个人提供信任。根据最近对 10,000 名知识工作者的调查，未来论坛报告说，灵活性现在是一项核心福利，在员工最看重工作的因素中，它仅次于薪酬。建立一个框架来识别脱离、倦怠、健康相关问题、离职和不满的迹象。它将允许您在内部进行更改，以保持员工的积极性、快乐和健康。投资翻新现有办公室，为团队合作、社交聚会、公司庆典和创新中心分配更多空间。根据 VergeSense 关于工作场所使用情况的报告，大流行前的工作场所过度设计用于个性化工作。\n远程工作迅速增加，并带来了构建组织和工作场所的新方法。我们看到人们希望在不同的工作环境中工作并且更喜欢混合方法。也就是说，当有些人在远程而有些人在现场时，混合团队的协作变得更加困难。知道了这一点，公司需要优先改变他们的物理环境并定义远程工作指南，以提供最佳的团队体验。现在“饮水机”谈话和到办公桌的非正式走动越来越少，员工需要能够轻松创建虚拟团队环境。公司将需要创建允许快速协作和决策的空间。我们可以通过提供更多的视频会议临时房间或不可预订且先到先得的区域来促进随意对话。公司可能还需要根据现有空间的使用频率和人流量变化来重新配置现有空间。了解空间利用并采取数据驱动的方法将是必不可少的。可能会转向办公桌式住宿或为团队聚会提供开放的协作空间。无论如何，公司需要专注于让员工更容易地说出他们是进入办公室而不是远程工作，以便工作场所团队可以提前计划。各种工具已经上市，可以帮助公司了解谁来了和空间使用情况，同时为员工提供了很好的体验。我们还需要提供有关远程友好最佳实践的学习和培训。公司应该创建一个剧本并提供培训，以确保远程和办公室员工之间的成功协作。", "note_en": "When it comes to hybrid work, let&#39;s be honest: People don&#39;t know what to think. Are two or three days a week in the office the sweet spot? Are five days a dealbreaker? We repeat what we hear others say or go with our gut, but how do any of us really know?\n This is the first real national conversation we&#39;re having about work flexibility after one of the most catastrophic world events. Now companies are dealing with the pressure to come up with long-term plans and answers before they&#39;ve had a chance to try things out and see what works. Leaders should be confessing, &#34;We&#39;re not sure what the plan is yet,&#34; but no one wants to hear this. We need to be OK with some uncertainty and, at the same time, stay flexible for everyone.\n As people return, each company should look at its data to see what&#39;s needed and what the people prefer. What I&#39;m currently seeing based on Envoy customer usage data of around several hundred Desks-using companies is that companies are adapting their spaces, opting for open over permanent desks. They&#39;re giving folks options to book desks or meeting space when needed, and based on data of who&#39;s coming in, they&#39;re adjusting their policies.\n Right now, work is getting done remotely and people are allegedly more productive than ever. But many aren&#39;t enjoying their jobs as much because they&#39;re missing a sense of community and inherent culture that&#39;d have otherwise been automatic in an office. Proximity matters. It&#39;s important for teams to be together physically, and making that actually happen now takes intention. You need to organize people coming back into the office, in specific places and on one schedule. You need the right tools that simplify the mundane office tasks of hot desking, finding meeting rooms, managing office capacity and syncing schedules so teams can sit together, connect, get creative and, you know, bring some humanity to an otherwise day-to-day job.\n Hybrid work has its logistical challenges and will look different for each company, but it keeps the culture alive and the community strong for people to do their best work.\n  During the pandemic, the way we work fundamentally changed — and there&#39;s no going back. Employees don&#39;t want to return to pre-pandemic office-based work culture, but they also don&#39;t want to remain fully remote. Instead, they want an entirely new working model that combines the best of both worlds.  Research from Slack&#39;s Future Forum shows that 93% of knowledge workers want flexibility in when they work, while 76% want flexibility in where they work. But employees don&#39;t want flexibility at all costs. Instead, they want flexibility within a predictable framework. Two-thirds (65.6%) want a balance between full flexibility and a predictable framework.\n Successfully making this transition depends on moving from office-centric infrastructure to digital-first infrastructure. Being digital-first is about meeting your employees&#39; needs and helping them do their best work. It means empowering people to work when and where is best for them, with physical offices serving as just one of the tools available to support collaboration. For example, while Slack will always support the needs of those who require individual space, we&#39;ll be focusing the use of our physical offices on work that is team- and customer-centric.\n Having employees working outside of central offices for extended periods or on hybrid schedules may be difficult because we can lose those organic, spontaneous connections that occur in passing and help foster a sense of community. But by prioritizing digital infrastructure as much as physical — leaning into digital tools like Slack and asynchronous communication to ensure workers have flexibility they need to do their best work — we can create meaningful connections and foster community for employees regardless of how or when they work.\n  The abrupt shift to work-from-home globally in early 2020 has forced most organizations to adopt remote work. It meant providing laptops, offering allowances to set up a home office and allowing people to self-manage their schedule (to accommodate caregiving obligations and other COVID-related challenges). But what companies did not anticipate is that employees would not want to revert back to the pre-pandemic model.\n Indeed, after more than 18 months, employees have adapted to the change, they have adopted new habits and they have developed a greater liking for flexibility. They&#39;ve also started to voice their dissatisfaction with the rigid 9-to-5, five days a week work mode as lacking inclusion, diversity and trust.\n In April 2021 alone, more than 4 million Americans quit their job. So what can companies do to retain their top performers and attract the best talent?\n Adopt distributed work, offer greater flexibility to teams and provide trust to individuals. According to a recent survey of 10,000 knowledge workers, Future Forum reports that flexibility is now a core benefit and it ranks second to compensation among the factors that employees value most about their jobs.\n Build a framework to identify signs of disengagement, burnout, health-related issues, turnover and dissatisfaction. It will allow you to make changes internally to keep employees motivated, happy and healthy.\n Invest in renovating existing offices to allocate more space for team work, social gatherings, company celebrations and innovation hubs. Pre-pandemic workplaces were overly designed for individualized work according to VergeSense&#39;s  report on workplace usage.\n  Remote work has increased swiftly and brought about new ways to structure organizations and workplaces. We see that people want to work from varying working environments and prefer a hybrid approach.\n That said, when some people are remote and some are on-site, it becomes harder for hybrid teams to collaborate. Knowing this, companies need to prioritize changing their physical environment and defining remote work guidelines to provide the best team experience.\n Now that there are fewer &#34;water cooler&#34; talks and informal walkovers to desks, employees need the ability to create virtual team environments easily. Companies will need to create spaces that allow for quick collaboration and decision-making. We can foster casual conversation by having more video conferencing pop-in rooms or areas that are non-bookable and first come, first served.\n Companies may also need to reconfigure existing spaces based on how often they&#39;re used and changing foot traffic. Understanding space utilization and taking a data-driven approach will be essential. There may be a shift to desk hoteling or having open collaboration spaces for team gatherings. Regardless, companies will need to focus on making it easy for employees to say that they&#39;re coming into the office versus working remotely so workplace teams can plan ahead. Various tools have come to market that can help companies understand who&#39;s coming in and space usage while providing a great experience for employees.\n We also need to provide learning and training on remote-friendly best practices. Companies should create a playbook and provide training to ensure successful collaboration between remote and in-office employees.", "posttime": "2021-07-22 22:23:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "获得,twelve", "title": "报告：只有十二分之一有资格获得 FCC 紧急宽带福利的家庭参加了 $3.2B 计划", "title_en": "Report: only one in twelve households eligible for the FCC's emergency broadband benefit are enrolled in the $3.2B program", "transed": 1, "url": "https://www.protocol.com/policy/ebb-enrollment", "via": "", "real_tags": ["获得", "twelve"]}, {"category": "", "categoryclass": "", "imagename": "30e736eb447f599d84255c54c61601ee.jpg", "infoid": 1068893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数医院管理人员会说，以医疗保险费率经营业务是不可能的。政府为老年人提供的医疗保险计划支付的服务费用低于提供服务的费用，而私人保险必须弥补差额。但艾伦·巴利并不认同成本转移的说法。这位在土耳其东南部农村长大的连续创业者认为，问题不在于费率，而在于使用旧技术的过时系统。 “有这么多浪费，因为在这个国家，供应商习惯于从屋顶充电，他们从未想过要提高效率，”37 岁的巴利说，他是 Carbon Health 的首席执行官兼联合创始人。他说，部分问题在于底层技术基础设施。许多医生都陷入了与昂贵、笨重的病历软件的持续管理斗争中，这些软件每天晚上在看完病人后会占用他们数小时的时间。尽管大多数医院在投入数千万美元用于令人沮丧的技术不足之后，都不敢撕掉他们的全部技术堆栈，但巴厘岛决定从头开始。他与 47 岁的联合创始人 Caesar Djavaherian 合作，后者是一名在伊朗革命期间移居美国的急诊医生，创建了一个与医生和患者携手合作的系统，该系统直观易用，无需小时的培训。将其与基于机器的学习相结合以显示最可能的诊断、应用程序内消息以获取第二意见、与电子处方和实验室的集成以及对患者和医生互动的每一步的详细分析，您将获得成本配方储蓄。由于这些功能，这家总部位于加利福尼亚州旧金山的公司在过去一年中治疗了超过 100 万名患者，只收取医疗保险费。 Carbon 拒绝透露收入数字，但表示 2021 年第一季度已经超过了去年全年的总收入。虽然报销结构可能不寻常，但它引起了投资者的共鸣。巴厘的业绩记录也有助于吸引投资：他是另一家独角兽公司、在线学习平台 Udemy 的联合创始人兼董事长，该平台去年价值 33 亿美元。周三，Carbon Health 宣布获得由 Blackstone 的 Horizo​​n 平台牵头的 3.5 亿美元，以推进其成为该国最大的初级保健提供商的使命。 Atreides、Homebrew、Hudson Bay Capital、Fifth Wall、Lux Capital、Silver Lake Waterman 和 BlackRock 以及回归投资者 Dragoneer Investment Group 和 Brookfield Technology Partners 参与其中。据知情人士透露，这轮融资对这家成立 6 年的公司的估值接近 33 亿美元。 Dragoneer 的合伙人埃里克琼斯说：“碳从最低成本获胜的原则开始，最低成本对消费者有利。”虽然还有其他公共初级保健公司，例如会员制的 One Medical 和专注于医疗保险患者的 Oak Street Health，但 Carbon Health 不限制其服务的患者或需要订阅。 “Carbon 是一个美丽的大众市场机会，它可以真正存在于美国的每一个角落和缝隙中——无论是弹出式、全面的诊所还是虚拟的，”琼斯说。 “这就是我认为它真正特别的原因。”当涉及到患者关系时，混合模型是关键。 “一般来说，风险资本家非常讨厌任何触及实体的东西，”巴厘岛说。 “我强烈认为，没有实际位置，就没有良好的医疗保健。”这使得筹款变得有点棘手，但后 Covid 的格局开始发生变化，特别是随着通过谷歌和 Facebook 广告上的数字广告获取客户的成本变得越来越昂贵，而且没有店面来推动有机流量。 “远程医疗的不利之处在于，您的客户获取成本实际上比我们在诊所上花费的要多得多，”他说。 Bali 说，在湾区，95% 的 Carbon 患者来自口碑和步行，而只有 5% 的新客户来自付费渠道。 Carbon 的 1,600 名员工中有 1,000 多名在提供护理的诊所工作。医生和其他人一样热爱科技。我们讨厌的是糟糕的技术。\n巴厘岛于 2014 年首次想到碳纤维，当时他的母亲经历了一次无法解释的中风，导致身体不同部位瘫痪。他最终从 Udemy 休假两个月，返回土耳其，并在他们寻找诊断时将她带到看似永无止境的专家队伍中。 “我带着数千页的文件从一个医生到另一个医生——所有的 DVD，所有的实验室记录，”他回忆道。 “我刚刚开始意识到医生必须使用的工具根本不是从他们的角度设计的。而且，作为患者，他们显然也没有设计我们的观点。”作为职业软件工程师，Bali 首先运用他的技能让教育更容易获得。很快就清楚了，他的下一个任务是为医疗保健做同样的事情。 2014 年，他辞去了 Udemy 首席执行官的职务，转而担任董事长一职。在接下来的几年里，他致​​力于开发他认为的下一代医疗保健软件：从头开始结合病历、临床医生工作流程、收入周期管理和面向患者的平台。 2017 年，他遇到了 Caesar Djavaherian，他是一名急诊医生，也是湾区几家名为 Direct Urgent Care 的急诊诊所的老板。两人是由一位在这两个地方申请工作的医生介绍的，并认识到两人都有类似的使命，以改善医疗保健技术。 Djavaherian 花了数年时间研究医学信息学，在对新技术的缓慢采用越来越感到沮丧之后，他离开了学术医学，开始了自己的诊所。他通过将来自多个不同初创公司的软件拼凑在一起，让 MacGyver 为他的诊所设计了一个新系统。巴厘岛提供了一个无缝平台。 “技术专家经常会说，&#39;医生不喜欢技术。&#39;我对此的回应是，我认识的每一位医生每天都在 Facebook 或 Instagram 上使用谷歌，”Djavaherian 说。 “医生和其他人一样热爱科技。我们讨厌的是糟糕的技术。”他开始了 Carbon 的试点项目，并在 3 个月内在他的诊所启动并运行。 2018 年，他的紧急护理业务被 Carbon 收购，形成了今天的公司。 Djavaherian 解释说，Carbon 使用机器学习来提高患者接收流程的效率，但他并不担心人工智能会取代他的工作。 “我们使用该技术作为风险缓解工具来改善临床结果，”Djavaherian 说。他举了一个进入诊所呕吐的 3 岁儿童的例子。大多数情况下，问题是简单的病毒感染。但是，在极少数情况下，这是 1 型糖尿病的第一个迹象。该软件将建议提供者订购血糖测试进行检查。但 Djavaherian 说，Carbon 平台的主要优势之一是易于使用。最初，Djavaherian 诊所的医生每晚要花大约两个小时填写病历表。 “当我们切换到 Carbon 时，这些供应商现在平均花费 15 分钟在轮班后绘制图表，最长时间约为 30 分钟，”他说。 “如果这对倦怠问题没有帮助。我不知道有什么作用。”\n巴厘岛说，在 2019 年，Carbon 有 7 家诊所，现在已经发展到 12 个州的 80 家诊所，平均每周开设 2 家新诊所。在 Covid-19 大流行期间，增长大大加速，因为 Carbon 进行了超过 140 万次 COVID-19 测试和 150 万次 COVID-19 疫苗。 “我们打算最早在明年成为一家独立的上市公司，”巴厘岛说。也有传言说他的另一家公司 Udemy 可能会在今年某个时候上市。巴厘岛的市场似乎正在调整。巴厘岛说，虽然其他公共初级保健公司已经开始关注高收入患者或年长的美国人，但“我们确实看到了对像我们这样的公司的浓厚兴趣，它既不是高风险也不是高端，但确实可以面向全体人民开放。” Bali 说，测试准备就绪的主要里程碑之一将是所有 Carbon 诊所的 EBITDA 利润率达到 25% 到 35%。一些较旧的诊所已经发生了这种情况，但他说这需要在稳定开放的新诊所中复制。目前，他专注于在全国范围内推广该模型，目标是在 10 分钟内接触到大多数美国人口。这就是他决定首先将公司命名为 Carbon Health 的原因。巴厘岛说，碳是有机生活中最常见的元素，这是他想要创建的医疗保健网络的隐喻。 “亚马逊也在做同样的事情，”他说，“就是在你仍然盈利的情况下尽可能少收费。然后你用它来建立牢固的客户关系。”", "note_en": "Most hospital executives will say it’s impossible to run a business on Medicare rates. The government health insurance program for seniors pays less for services than it costs to deliver them and private insurance has to make up the difference. But Eren Bali doesn’t buy the cost-shifting argument. The serial entrepreneur who grew up in rural southeast Turkey believes the issue isn’t the rates but an outdated system using old technology. “There&#39;s so much waste because providers are so used to charging through the roof in this country, they&#39;ve never thought about being efficient,” says Bali, 37, the CEO and cofounder of Carbon Health.\n   Part of the problem, he says, is the underlying technology infrastructure. Many doctors are locked in a constant administrative battle with expensive, clunky medical records software that sucks up hours of their time each night after they finish seeing patients. And while most hospitals are too scared to rip out their full tech stacks after having sunk tens of millions of dollars into frustratingly inadequate technology, Bali decided to start from scratch.\n He teamed up with cofounder Caesar Djavaherian, 47, an emergency medicine doctor who moved to the U.S. during the Iranian revolution, to create a system built hand-in-hand with doctors and patients that would be intuitively easy-to-use instead of requiring hours of training. Combine that with machine-based learning to surface most likely diagnoses, in-app messaging to get second opinions, integration with electronic prescribing and labs, as well as detailed analytics for every step of the patient and doctor interaction and you get a recipe for cost savings. Thanks to these features, the San Francisco, California-based company, which has treated more than 1 million patients over the past year, only charges Medicare rates. Carbon declined to disclose revenue numbers but says the first quarter of 2021 already surpassed total revenue in all of last year.\n While the reimbursement structure may be unusual, it’s resonating with investors. Also helpful in attracting investment is Bali’s track record: he is the cofounder and chairman of another unicorn, the online learning platform Udemy, which was valued at  $3.3 billion last year. On Wednesday, Carbon Health announced it secured $350 million led by Blackstone’s Horizon platform to further its mission of becoming the largest primary care provider in the country. Atreides, Homebrew, Hudson Bay Capital, Fifth Wall, Lux Capital, Silver Lake Waterman, and BlackRock participated, along with returning investors Dragoneer Investment Group and Brookfield Technology Partners. The funding round values the six-year-old company at nearly $3.3 billion, according to a person familiar with the deal.\n “Carbon starts from a principle of lowest cost wins and lowest cost is good for the consumer,” says Eric Jones, a partner at Dragoneer. While there are other public primary care companies like One Medical, which is membership-based, and Oak Street Health, which focuses on Medicare patients, Carbon Health doesn’t restrict the patients it serves or require a subscription. “Carbon is a beautiful mass market opportunity that can really exist—whether it&#39;s a pop-up or full-scale clinic or virtual—in every kind of nook and cranny of the U.S.,” says Jones. “And that&#39;s what I think makes it really special.”\n   The hybrid model is key when it comes to patient relationships. “Venture capitalists, in general, passionately hated anything that touches brick and mortar,” says Bali. “I was passionately opinionated that without physical locations, there&#39;s no great healthcare.” That made fundraising a bit trickier, but the post-Covid landscape is starting to shift, especially as the cost of acquiring customers through digital advertising on Google and Facebook ads becomes increasingly expensive with no storefronts to drive organic traffic. “The downside of telemedicine is that your customer acquisition costs are actually a lot more than what we spend on clinics,” he says. In the Bay Area, 95% of Carbon patients are from word-of-mouth and walk-bys, while only 5% of new customers are from paid channels, says Bali. More than 1,000 of Carbon’s 1,600 employees work in the clinics providing care.\n  Doctors love tech just as much as everyone else. What we hate is bad technology.\n Bali first got the idea for Carbon in 2014, when his mother experienced an unexplained stroke that paralyzed different parts of her body. He ended up taking two months off from Udemy to travel back to Turkey and take her to a seemingly never ending stream of specialists as they searched for a diagnosis. “I was going from doctor to doctor with thousands of pages of documents—all the DVDs, all the lab records,” he recalls. “I just started realizing that the tools that doctors had to use were not really designed from their perspective at all. And, as a patient, they obviously are not designing our perspective either.”\n A career software engineer, Bali first applied his skills to make education more accessible. It soon became clear his next mission was to do the same for healthcare. In 2014, he stepped down as CEO of Udemy and into the role of chairman. He spent the next few years working on what he thinks of as the next generation of healthcare software: a combination medical record, clinician workflow, revenue cycle management and patient-facing platform from the ground up.\n In 2017, he met Caesar Djavaherian, an emergency medicine doctor and owner of several Bay Area urgent care clinics called Direct Urgent Care. The two had been introduced by a doctor who was applying for jobs at both places and recognized both men had a similar mission to better technology in healthcare.\n  Djavaherian had spent years researching medical informatics and left academic medicine to start his own clinics after becoming increasingly frustrated by the sluggish pace of adopting new technology. He had MacGyvered a new system for his clinics by piecing together software from multiple different startups. Bali was offering one seamless platform.\n “Technologists will often say, ‘Doctors don&#39;t like tech.’ And my response to that is, every doctor I know is on Facebook or Instagram and uses Google every day,” says Djavaherian. “Doctors love tech just as much as everyone else. What we hate is bad technology.” He started a pilot program with Carbon and within 3 months it was up and running in his clinics. In 2018, his urgent care business was acquired by Carbon forming the company that exists today.\n  Djavaherian explains that Carbon uses machine learning to make the patient intake process more efficient, but he isn’t worried about artificial intelligence taking over his job. “We use the technology as a risk mitigation tool to improve clinical outcomes,” says Djavaherian. He gives the example of a 3-year-old who comes into the clinic vomiting. The vast majority of the time, the issue is a simple viral infection. But, on rare occasions, it’s the first sign of type one diabetes. The software will recommend the provider order a blood sugar test to check.\n But one of the main benefits of the Carbon platform, says Djavaherian, is the ease-of-use. Originally, the doctors at Djavaherian’s clinics were spending about two hours a night filling in medical record charts. “When we switched over to Carbon, those providers are now spending an average of 15 minutes charting after their shift with the maximum time of roughly 30 minutes,” he says. “If that doesn&#39;t help the burnout problem. I don&#39;t know what does.”\n In 2019, Carbon had 7 clinics, and has now grown to 80 clinics across 12 states with an average of 2 new clinics opening every week, says Bali. Growth was vastly accelerated during the Covid-19 pandemic as Carbon administered more than 1.4 million COVID-19 tests and 1.5 million COVID-19 vaccines.\n  “Our intention is to be an independent public company, as early as next year,” says Bali. Rumors have also been circulating that his other company, Udemy, could go public sometime this year. The markets seem to be aligning for Bali. While other public primary care companies have gone after higher-income patients or older Americans, says Bali, “we&#39;ve definitely seen a lot of appetite for a company like ours, which is neither high-risk nor high-end but can really be accessible to the entire population.”\n One of the major milestones to test readiness will be hitting a 25 to 35% EBITDA margin throughout all Carbon’s clinics, Bali says. It has happened for some of the older clinics, but he says that needs to be replicated across the new ones that are opening at a steady clip. For now, he’s focused on taking the model nationwide, with the goal of being within 10 minutes of access to a majority of the U.S. population. That’s why he decided to name the company Carbon Health in the first place. Carbon is the most commonly found element in organic life, says Bali, and it’s a metaphor for the healthcare network he wants to create. “Amazon does the same thing,” he says, “which is to charge as little as possible while you&#39;re still profitable. And then you use that as a way to have a strong customer relationship.”", "posttime": "2021-07-22 22:23:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,美国,虚拟,care,诊所", "title": "消息人士称，Carbon Health 在美国 12 个州的 80 家诊所提供基于应用程序的虚拟护理和面对面护理，筹集了 3.5 亿美元，估值为 3.3B 美元", "title_en": "Carbon Health, which offers app-based virtual care and in-person care at 80 clinics across 12 US states, raises $350M, source says at a valuation of $3.3B", "transed": 1, "url": "https://www.forbes.com/sites/katiejennings/2021/07/21/meet-the-immigrant-entrepreneurs-who-raised-350-million-to-rethink-us-primary-care/", "via": "", "real_tags": ["程序", "美国", "虚拟", "care", "诊所"]}, {"category": "", "categoryclass": "", "imagename": "263084eee2aa8bfbbb6caa3e4804e548.jpg", "infoid": 1068892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GudangAda 是一个位于雅加达的市场，让批发商更接近零售店和其他买家，它宣布已经完成了超过 1 亿美元的 B 轮融资。该公司表示，该轮融资超额认购，超过了其最初的 7500 万美元目标。本轮融资由 Asia Partners 和 Falcon Edge 领投，红杉资本印度、Alpha JWC 和 Wavemaker Partners 跟投。这使 GudangAda 迄今为止的总融资额达到约 1.35 亿美元。它的最后一笔资金是去年 2540 万美元的 A 轮融资，由红杉资本印度和 Alpha JWC 领投。 GudangAda 成立于 2019 年 1 月，现已被 500 万中小企业使用，覆盖印度尼西亚的 500 个城市。在筹集 B 轮融资之前，它已经通过 3500 万美元的资金增长到 60 亿美元的商品净值。该平台范围内的主要制造商和分销商包括食品公司 Sido Muncul、调味品制造商 Sasa 和英国跨国消费品集团 Reckitt Benckiser。在创办 GudangAda 之前，创始人兼首席执行官 Stevensang 在印度尼西亚的快速消费品和零售行业工作了超过 25 年。在过去的 10 年里，史蒂文桑告诉 TechCrunch，印度尼西亚的物流成本已经上升到世界最高之列，影响了整个供应链，尤其是中小企业买家。 GudangAda 通过连接主要制造商、分销商和零售商并处理 B2B 购买的几乎所有方面（包括交付）来帮助降低运营成本。它的移动应用程序包括一个销售点系统，它还可以用于管理订单、跟踪物流和付款。 Stevensang 表示，GudangAda 专注于让中小企业更容易购买库存的几件事。一是优化库存周转率，为平台上的企业增加营运资金。该公司还提供产品的市场研究和数据，并为零售商提供大量的商品选择。在同一平台上连接到多个供应商还让销售大量商品但没有购买量直接从分销商订购的小型零售店能够以具有竞争力的成本购买库存。为了降低物流成本，GudangAda 与第三方车辆和仓库供应商合作，在整个印度尼西亚建立覆盖范围。对于物流合作伙伴，它提供运输和仓库管理系统，帮助他们实现运营数字化。\n未来，GudangAda 计划与银行合作，为中小企业提供营运资金，使他们能够使用他们在平台上的数据申请贷款。这笔资金将用于扩大 GudangAda 的产品类别，现在包括快速消费品、药品、包装、家居用品和文具。它还计划开发基于人工智能的工具，可为商家客户提供个性化推荐。例如，在 COVID-19 期间，该平台会建议商店应储备多少消毒剂。 Falcon Edge 联合创始人 Navroz D. Udwadia 在一份声明中表示：“GudangAda 绝对是印度尼西亚最大的中小企业电子商务市场，拥有一流的指标。我们与利益相关者（委托人、批发商和零售商）的研究和对话使我们对 GudangAda 独特的投资回报率和整个生态系统的附加值充满信心。”更新：文章更正以反映 GudangAda 计划在未来与银行合作，目前没有这样做。", "note_en": "GudangAda, a Jakarta-based marketplace that brings wholesalers closer to retail stores and other buyers, announced it has closed a Series B of more than $100 million. The company says the round was oversubscribed, passing its initial target of $75 million. The funding was led by Asia Partners and Falcon Edge, with participation from Sequoia Capital India, Alpha JWC and Wavemaker Partners.\n This brings GudangAda’s total raised so far to about $135 million. Its last funding was a  $25.4 million Series A last year, led by Sequoia Capital India and Alpha JWC.\n  Founded in January 2019, GudangAda is now used by half a million SMEs and covers 500 cities in Indonesia. Before raising its Series B, it had already grown to $6 billion in net merchandise value on $35 million of funding. Principal manufacturers and distributors on the platform range include food products company Sido Muncul, seasoning maker Sasa and British multinational consumer goods group Reckitt Benckiser.\n Founder and chief executive officer Stevensang spent more than 25 years in Indonesia’s fast-moving consumer goods and retail industries before starting GudangAda. Over the past 10 years, Stevensang told TechCrunch that logistics costs in Indonesia have increased to among the highest in the world, impacting the whole supply chain, especially SME buyers.\n GudangAda helps lower operational costs by connecting principal manufacturers, distributors and retailers, and handling almost all aspects of B2B buying, including deliveries. Its mobile app includes a point-of-sale system and it can also be used to manage orders, track logistics and make payments.\n  Stevensang said GudangAda focuses on several things to make buying inventory easier for SMEs. One is optimizing inventory turnover to increase working capital for businesses on the platform. The company also provides market research and data for products and gives retailers a large selection of goods. Being connected to multiple suppliers on the same platform also lets small retail stores that sell a large selection of items, but don’t have the buying volume to order directly from distributors, to purchase inventory at competitive costs.\n To keep logistics costs down, GudangAda partners with third-party vehicle and warehouse providers to build its coverage throughout Indonesia. For its logistics partners, it provides transportation and warehouse management systems to help them digitize their operations.\n In the future, GudangAda plans to partner with banks that will provide working capital for SMEs, enabling them to apply for loans using their data on the platform.\n The funding will be used to expand GudangAda’s product categories, which now include fast-moving consumer goods, pharmaceuticals, packaging, homeware and stationery. It also plans to develop AI-based tools that can provide personalized recommendations for merchant customers. For example, during COVID-19, the platform suggested how much disinfectants a store should stock.\n In a statement, Falcon Edge co-founder Navroz D. Udwadia said, “GudangAda is definitively the largest SME e-commerce marketplace in Indonesia with best-in-class metrics. Our research and conversations with stakeholders (principals, wholesalers and retailers) has given us confidence on GudangAda’s distinctive ROI and value addition to the entire ecosystem.”\n Update: Article corrected to reflect that GudangAda is planning to partner with banks in the future, and does not currently do so.", "posttime": "2021-07-22 22:23:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "文具,led,gudangada", "title": "GudangAda 是一家位于雅加达的快速消费品、文具等 B2B 市场，由 Asia Partners 和 Falcon Edge 领投，B 轮融资 1 亿美元以上", "title_en": "GudangAda, a Jakarta-based B2B marketplace for fast-moving consumer goods, stationery, and more, raises $100M+ Series B led by Asia Partners and Falcon Edge", "transed": 1, "url": "https://techcrunch.com/2021/07/21/indonesian-b2b-marketplace-gudangada-raises-more-than-100m-in-new-funding/", "via": "", "real_tags": ["文具", "led", "gudangada"]}, {"category": "", "categoryclass": "", "imagename": "3306d25aa4b3c56cac95caaa27a7284b.jpeg", "infoid": 1068891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联合创始人兼首席执行官 Kiwi Camara 表示，该公司的目标是成为希望将法律行业数字化的软件公司的最前沿。成立于 2013 年的 CS Disco，隶属于 Disco（股票代码：LAW），提供旨在简化企业、律师事务所、法律服务提供商和政府的电子发现、法律文件审查和案件管理的云软件。该软件有助于将法律数据集中到一个解决方案中，同时提高客户的安全性和隐私性。 “我们正在使用自动化和人工智能来帮助律师自动化不需要人工判断的法律实践部分，”卡马拉告诉巴伦杂志。 “迪斯科的使命是利用技术加强法治。”周三，Disco 是其股票上市的五家公司之一。该股开盘价为 45.26 美元，收盘价为 42.59 美元，较发行价上涨 33%。 Disco 的估值为 42.59 美元，价值 24 亿美元。卡马拉表示，他预计软件将像颠覆其他行业一样改变法律行业。他说，软件将帮助律师事务所和律师在一些最重要的法律问题上“了解真相”，包括阿片类药物危机和 meme 库存调查。 “我们认为有机会在法律领域建立一家独立的软件公司，”同时拥有计算机科学学位的律师卡马拉说。他说，Disco 是 Discovery 的缩写，计划将 IPO 的收益用于投资其“上市引擎”和研发。这家德克萨斯州奥斯汀的公司现在决定上市，因为“[还没有] 成为法律技术领域的大赢家。我们可以声称拥有这个空间，”卡马拉说，他说 DISCO 能够获得“法律”的代码具有象征意义。 (KLTR) 也首次公开上市。这家纽约公司原计划于 4 月 1 日上市，但在 3 月下旬对冲基金 Archegos 资本管理公司倒闭导致一些 IPO 低于发行价，而另一些则推迟上市. Kaltura 首席执行官罗恩·耶库蒂尔 (Ron Yekutiel) 说：“这个笑话是在我们身上开的。” “这是新发行最糟糕的一周。”\nKaltura 直到本周才上市。股价周三开盘价为 11.50 美元，收盘价为 12 美元，较发行价上涨 20%。 Kaltura 的市值为 20 美元，约为 15 亿美元。 Kaltura 成立于 2006 年，提供了一个技术平台，支持多种形式的视频，包括视频门户、市政厅、视频消息、网络研讨会、虚拟活动和会议，以及虚拟教室。它拥有 1,000 多个客户，包括 IBM ( )、Dropbox (DBX)、博世、汤森路透 (TRI) 和 (SAP)。 Yekutiel 说，与 (ZM) 或 Microsoft Teams 等专注于视频点播的公司相比，Kaltura 提供了更强大的平台。 “我们是所有大型企业的领先虚拟活动平台，”他说。例如，亚马逊网络服务 re:Invent 2020 从现场活动转为虚拟活动，注册人数为 6,000。 Yekutiel 说，它运行在 Kultura 上。他说，任何时候公司需要一个重型视频平台来“视频化”公司学习、网络研讨会、虚拟活动和会议，他们都会求助于 Kaltura。 “我们是做复杂事情的重锤，”他说。该公司计划将大部分 IPO 收益用于增加销售和营销。 Yekutiel 说，Kaltura 拥有 650 名员工，并计划在今年年底前超过 800 名。他说，它过去进行了三项小型收购，并将寻求做更多的事情。 “拥有可以作为上市公司交易的股权是有帮助的。我们期待有新的股东，”他说。", "note_en": "is aiming to be at the forefront of software companies looking to digitize the legal sector, according to co-founder and CEO Kiwi Camara.\n  Founded in 2013, CS Disco, which goes by Disco (ticker: LAW), provides cloud software that aims to simplify ediscovery, legal document review and case management for businesses, law firms, legal services providers and governments. The software helps centralize legal data into a single solution, while improving security and privacy for clients.\n  “We’re using automation and AI to help lawyers automate the part of the practice of law that doesn’t require human judgment,” Camara told  Barron’s. “The mission of Disco is to use technology to strengthen the rule of law.”\n  On Wednesday, Disco was one of  five companies that listed its shares. The stock opened at $45.26 and closed at $42.59, up 33% from its offer price. At $42.59, Disco is valued at $2.4 billion.\n  Camara said he expects software to transform the legal sector much the same way it has disrupted other industries. Software, he said, will help law firms and attorneys “get to the truth” in some of the most important legal issues including the opioid crisis and the meme stock investigations. “We think there is an opportunity to build an independent software company in the legal space,” said Camara,  who is an attorney that also holds a degree in computer science.\n  Disco, which is short for discovery, plans to use proceeds from the IPO to invest in its “go-to market engine” and for R&amp;D, he said. The Austin, Texas company decided to go public now because “there [hasn’t] been a big winner in legal tech. We can lay claim to that space,” said Camara, who said it was symbolic that DISCO was able to get the ticker “LAW.”\n  (KLTR) also made its public equity market debut. The New York company had originally planned to list its shares on April 1. It ended up delaying the deal after the  collapse of Archegos Capital Management, a hedge fund, in late March that caused  some IPOs to drop below their offer prices and others to delay. “The joke was on us,” said Ron Yekutiel,    Kaltura   CEO. “It was the worst week for new issuance.”\n  Kaltura held off going public until this week. Shares opened Wednesday at $11.50 and closed at $12, up 20% from its offer price. At $20, Kaltura’s market capitalization was about $1.5 billion.\n  Founded in 2006, Kaltura provides a technology platform that powers several forms of videos including video portals, town halls, video messaging, webinars, virtual events and meetings, as well as virtual classrooms. It has over 1,000 customers including  IBM (   ),  Dropbox (DBX), Bosch,  Thomson Reuters (TRI) and   (SAP).\n  Kaltura provides a more robust platform than companies like   (ZM) or Microsoft Teams, which are focused on video on demand, Yekutiel said.\n  “We are a leading virtual event platform for all large corporations,” he said. For example,  Amazon Web Services re:Invent 2020 pivoted from an in-person to virtual event with 6,000 registered. It ran on Kultura, Yekutiel said. Any time a corporation needs a heavy video platform to “videofy” corporate learning, webinars, virtual events and meetings, they turn to Kaltura, he said. “We are the heavy hammer to do complex things,” he said.\n  The company plans to use much of the IPO proceeds to increase sales and marketing. Kaltura has 650 employees and plans to be north of 800 by the end of the year, Yekutiel said. It has made three small acquisitions in the past and will look to do more, he said. “Having equity you can trade as a public company is helpful. We’re looking forward to having new shareholders,” he said.", "posttime": "2021-07-22 22:22:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,活动,debut,法律", "title": "为虚拟活动和会议提供视频平台的 Kaltura 在首次公开募股中以 1.24 美元的估值筹集了 1.5 亿美元后，在首次交易中收盘上涨 20%", "title_en": "Kaltura, which offers a video platform for virtual events and meetings, closes up 20% in its trading debut after raising $150M in an IPO at a $1.24B valuation", "transed": 1, "url": "https://www.barrons.com/articles/tech-companies-cs-disco-and-kaltura-aim-to-upend-their-sectors-they-had-impressive-ipo-debuts-51626907958", "via": "", "real_tags": ["交易", "活动", "debut", "法律"]}]