[{"category": "", "categoryclass": "", "imagename": "395f48837da68a5de48c054d2402d840.jpg", "infoid": 1017690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国人正在就继续锁定美国经济以防止新冠肺炎蔓延的好处展开激烈辩论，一个官方统计数据可能掌握着解决这场争论的关键：发生在养老院和辅助生活设施的死亡人数占比高得惊人。\n210万美国人，占美国人口的0.62%，居住在疗养院和辅助生活设施中。(养老院是为需要帮助的老年人提供的住所，如洗澡或穿衣，他们也需要全天候的医疗监督；辅助生活设施是为需要帮助的老年人设计的，但不需要全职的现场医疗监督。)。\n根据格雷格·格文和我为机会均等研究基金会进行的一项分析，截至5月22日，在目前报告这类数据的43个州中，新冠肺炎死亡人数中惊人的42%发生在养老院和辅助生活设施中。\n(在报告死亡总数的州中，42%的COVID死亡发生在长期护理设施中；根据纳入未报告州的人口统计数据，我们还估计美国总人口的这一比例为42%。)。\n让我们意识到这一点：新冠肺炎死亡人数中有42%发生在占美国总人口0.62%的设施中。\n而42%可能是一个低估的数字。像纽约州这样的州将那些在医院死亡的人排除在疗养院之外，即使他们最初是在一家长期护理机构感染的。在纽约以外，新冠肺炎死亡人数的一半以上是长期护理机构的居民。\n上周之前，俄亥俄州报告说，41%的COVID死亡发生在长期护理机构。但上周五最新披露的数据显示，考虑到4月15日之前的死亡人数，这一比例上升至70%。\n在明尼苏达州，新冠肺炎死亡人数中有81%是养老院和养老院居民。从弗吉尼亚州到新罕布夏州的东海岸地区受灾尤为严重。\n另一种削减数据的方法是将疗养院和辅助生活设施的死亡人数视为生活在这些设施中的人口的一部分。在此基础上，有三个州在负面方向上脱颖而出：新泽西州、马萨诸塞州和康涅狄格州。\n在马萨诸塞州和康涅狄格州，每万名疗养院和辅助生活设施居民的COVID死亡人数分别为703人和827人。在新泽西州，近10%的长期护理机构居民-10000人中有954人-死于这种新型冠状病毒。\n可悲的是，事情本不应该是这样的。3月17日，当大流行刚刚开始加速时，斯坦福大学流行病学家John Ioannidis警告说，“几十年来，即使是一些所谓的温和或普通感冒类型的冠状病毒，当它们感染疗养院的人时，病死率也高达8%。”Ioannidis被忽略了。\n取而代之的是，像纽约州、新泽西州和密歇根州这样的州实际上命令疗养院接收正在出院的新冠肺炎活动性感染患者。\n对这些命令最仁慈的解释是，它们的设计是为了确保各州不会挤满他们的ICU。但在住院人数达到顶峰后，像纽约州长安德鲁·科莫(Andrew Cuomo)这样的州长正在加倍执行他们的命令。\n就在4月23日，Cuomo还宣布疗养院“无权反对”接收患有活动性COVID感染的老年患者。“这就是规则，这就是规则，他们必须遵守这一点。”直到5月10日-在养老院和辅助生活设施的近3000名纽约居民死亡后-库默才下台，部分撤销了他的命令。\n对于玛丽亚·波尔特斯来说，科莫的改变来得太晚了。她的父亲卡洛斯·加莱戈斯(Carlos Gallegos)于4月份在长岛的一家疗养院死于新冠肺炎，这家疗养院遵守了科莫的命令。“这是一记耳光，”她说，“因为他不会为发生在我父亲和其他那么多人身上的事情负责。”\n将库默等州长的决定与佛罗里达州州长罗恩·德桑蒂斯(Ron DeSantis)的决定进行对比。在佛罗里达州，所有疗养院工作人员在进入设施之前都被要求对新冠肺炎症状进行筛查。3月15日，在大多数州被封锁之前，德桑蒂斯签署了一项行政命令，禁止朋友和家人访问疗养院，并禁止医院将感染SARS-CoV-2的患者送进长期护理设施。\n佛罗里达州医疗管理局(Agency For Healthcare Administration)的负责人玛丽·梅休(Mary Mayhew)说：“每天在这些(与医院的)电话中，我都会听到同样的评论和问题，‘我们需要把这些人送回疗养院，’”佛罗里达州医疗管理机构的负责人玛丽·梅休(Mary Mayhew)说。他说：“我们很早就划清了一条强硬的界限。我反复对医院、首席执行官、出院计划者和首席医疗官说，‘我知道，20年来，让个人进出一直是根深蒂固的，特别是通过联邦医疗保险(Medicare)的报销政策。这不是我们今天关注的焦点。我不会把任何有丝毫积极风险的人送回疗养院。我们一直在说的是，我们不要让两个案子变成20个，或者5个变成50个。如果你在送回这个人时不对他们进行管理，你会有更多的人被转移回医院。“。\n佛罗里达州还优先考虑个人防护设备(PPE)的长期护理设施，因为他们明白，保护养老院和辅助生活设施的工人即使不是更重要，也同样重要。德桑蒂斯说：“如果我能把个人防护用品送到疗养院，他们可以防止那里爆发疫情，这将比我只给他们再送50万个N95口罩更能减轻医院的负担。”\n虽然对于已经死亡的数千名疗养院居民来说已经太晚了，但通过向佛罗里达州的榜样学习，仍然有时间保护留下来的数百万人。\n首先，每个强制要求疗养院接收活跃感染新冠肺炎的患者的州都应该立即撤销和撤销这一命令。\n其次，就像佛罗里达所做的那样，我们必须至少在未来几个月限制家人和朋友访问疗养院，可能的例外是那些可以证明他们没有积极感染这种新型冠状病毒的人。\n第三，我们必须优先安排养老院和辅助生活设施的个人防护装备，至少与医院和其他急救人员同等优先。\n第四，我们必须使用RT-PCR测试和FDA授权的其他检测方法，对所有疗养院工作人员和居民进行活动性感染检测。\n第五，我们必须尽一切可能确保疗养院工作人员在单一设施工作；在多个设施工作的工作人员很可能正在帮助传播感染。受感染的疗养院工作人员和居民应该在校外设施进行隔离。各州可以与现在空置的酒店签订合同，以协助这一进程。\n第六，到目前为止拒绝报告COVID疗养院死亡人数的七个州-夏威夷、新墨西哥州、北达科他州、南达科他州、密苏里州、密歇根州和佛蒙特州-需要开始报告他们在长期护理设施中的死亡人数。联邦政府已经对5月5日之后发生的疗养院死亡提出了这样的要求，但正如俄亥俄州告诉我们的那样，从之前几个月获得数据也很重要。\n尤其是密歇根州爆发了严重的新冠肺炎疫情，州长格雷琴·惠特默(Gretchen Whitmer)最近将该州的经济封锁延长至6月12日。密歇根州长期护理中心死亡人数的透明度对于评估她的医疗政策是否明智至关重要。\nCOVID长期护理悲剧还有一线希望--或者可能是铜线。新冠肺炎近一半的死亡发生在长期护理机构，这意味着全国99.4%没有生活在这些地方的人死于这种疾病的可能性大约是我们之前认为的一半。\n许多欧洲国家都在努力解决与我们相同的疗养院问题。但基于越来越多的证据表明新冠肺炎的重病集中在老年人，瑞士和德国已经重新开放了他们的中小学。在很大程度上，瑞典从一开始就没有关闭它们。德国的大部分工厂仍在运营，瑞典的餐厅也依然营业。所有这些国家的新冠肺炎的住院率和死亡率都是稳定到下降的。\n这些国家的结果应该会让我们更有信心，认为重新开放经济的有分寸的步骤可以在这里奏效。\n州政府对新冠肺炎大流行的深度负有的责任比许多美国人意识到的要多得多。但这也意味着各州有机会从自己的错误中吸取教训，做正确的事情：保护脆弱的老年人，让数百万美国人重返工作岗位。\n更新1：犹他州和堪萨斯州已经开始报告全州范围内的疗养院死亡人数，这使得我们估计的死亡人数比例从43%上升到42%。地图和文本已更新，以反映这一新信息。\n更新2：阿拉斯加州州长杰夫·特纳(Jeff Turner)的发言人表示，阿拉斯加没有新冠肺炎从养老院或辅助生活设施死亡的报告。怀俄明州卫生部的一位女发言人表示，在新冠肺炎死亡的14例中，怀俄明州已经经历了4例这样的死亡。地图和文本已更新，以反映此信息。\n在Twitter和YouTube上关注@avik，在Facebook上关注药剂师。或者，注册接收药剂师每周通过电子邮件发送的文章摘要。请在FREOPP.org上阅读“新冠肺炎期间让人们重返工作岗位的新战略”，这是阿维克与人合著的一项经济重新开放计划。", "note_en": "Americans are vigorously debating the merits of continuing to lock down the U.S. economy to prevent the spread of COVID-19. A single statistic may hold the key to resolving this debate: the astounding share of deaths occurring in nursing homes and assisted living facilities.\n    2.1 million Americans, representing 0.62% of the U.S. population, reside in nursing homes and assisted living facilities. (Nursing homes are residences for seniors needing help with activities of daily living, such as taking a shower or getting dressed, who also require 24/7 medical supervision; assisted living facilities are designed for seniors who need help with activities of daily living, but don’t require full-time on-site medical supervision.)\n  According to an  analysis that Gregg Girvan and I conducted for the  Foundation for Research on Equal Opportunity, as of May 22, in the 43 states that currently report such figures, an astounding 42% of all COVID-19 deaths have taken place in nursing homes and assisted living facilities.\n       (Among states reporting their death totals, 42% of COVID deaths have taken place in long-term care facilities; we also estimate the share as 42% for the full U.S. population, based on incorporating the demographics of the non-reporting states.)\n    Let that sink in: 42% of all COVID-19 deaths are taking place in facilities that house 0.62% of the U.S. population.\n  And 42% could be an undercount. States like New York exclude from their nursing home death tallies those who die in a hospital, even if they were originally infected in a long-term care facility. Outside of New York, more than half of all deaths from COVID-19 are of residents in long-term care facilities.\n    Prior to last week, Ohio reported that 41% of COVID deaths were taking place in long-term care facilities. But updated disclosures last Friday, taking deaths prior to April 15 into account,  upped that share to 70%.\n  In Minnesota, 81% of all COVID-19 deaths are of nursing home and residential care home residents. The region from the eastern seaboard from Virginia to New Hampshire has been especially hard-hit.\n      Another way to cut the data is to look at nursing home and assisted living facility deaths as a share of the population that lives in those facilities. On that basis, three states stand out in the negative direction: New Jersey, Massachusetts, and Connecticut.\n  In Massachusetts and Connecticut, COVID deaths per 10,000 nursing home and assisted living facility residents were 703 and 827, respectively. In New Jersey, nearly 10 percent of all long-term care facility residents—954 in 10,000—have died from the novel coronavirus.\n  The tragedy is that it didn’t have to be this way. On March 17, as the pandemic was just beginning to accelerate, Stanford epidemiologist John Ioannidis  warned that “even some so-called mild or common-cold-type coronaviruses have been known for decades [to] have case fatality rates as high as 8% when they infect people in nursing homes.” Ioannidis was ignored.\n    Instead, states like New York, New Jersey, and Michigan actually ordered nursing homes to accept patients with active COVID-19 infections who were being discharged from hospitals.\n  The most charitable interpretation of these orders is that they were designed to ensure that states would not overcrowd their ICUs. But well after hospitalizations peaked, governors like New York’s Andrew Cuomo were doubling down on their mandates.\n  As recently as April 23, Cuomo  declared that nursing homes “don’t have a right to object” to accepting elderly patients with active COVID infections. “That is the rule and that is the regulation and they have to comply with that.” Only on May 10—after the deaths of nearly 3,000 New York residents of nursing homes and assisted living facilities—did Cuomo stand down and partially rescind his order.\n  Cuomo’s change of heart came too late for Maria Porteus. Her father, Carlos Gallegos, died of COVID-19 in a Long Island nursing home in April that adhered to Cuomo’s mandate. “It’s a slap in the face,”  she said, “because he’s not taking responsibility for what happened to my father and so many others.”\n    Contrast the decisions by governors like Cuomo with those of Florida Gov. Ron DeSantis. In Florida, all nursing home workers were required to be screened for COVID-19 symptoms before entering a facility. On March 15, before most states had locked down, DeSantis  signed an executive order that banned nursing home visitations from friends and family, and also banned hospitals from discharging SARS-CoV-2-infected patients into long-term care facilities.\n  “Every day on these calls [with hospitals], I would hear the same comments and questions around, ‘We need to get these individuals returned back to the nursing home,’”  said Mary Mayhew, who runs Florida’s Agency for Healthcare Administration. “We drew a hard line early on. I said repeatedly to the hospital, to the CEOs, to the discharge planners, to the chief medical officers, ‘I understand that for 20 years it’s been ingrained, especially through Medicare reimbursement policy, to get individuals in and out. That is not our focus today. I’m not going to send anyone back to a nursing home who has the slightest risk of being positive.’ What we said constantly is let’s not have two cases become 20 or five become 50. If you don’t manage this individual as you return them back, you will have far more being transferred back to the hospital.”\n  Florida also prioritized long-term care facilities for personal protective equipment, or PPE, with the understanding that it was just as important, if not more so, to protect workers at nursing homes and assisted living facilities. “If I can send PPE to the nursing homes, and they can prevent an outbreak there, that’s going to do more to lower the burden on hospitals than me just sending them another 500,000 N95 masks,” said DeSantis.\n    While it is too late for thousands of nursing home residents who have already died, there is still time to protect the millions who remain, by learning from Florida’s example.\n  First, every state that has mandated that nursing homes accept actively infected COVID-19 patients should immediately rescind and reverse that mandate.\n  Second, as Florida has done, we must restrict visits to nursing homes by family and friends for at least the next several months, with the possible exception of those who can prove that they are not actively infected with the novel coronavirus.\n  Third, we must prioritize nursing homes and assisted living facilities for personal protective equipment, at an at least equal level of priority as hospitals and other first responders.\n  Fourth, we must test all nursing home workers and residents for active infections, using RT-PCR tests and other FDA-authorized methods of detection.\n  Fifth, we must strive wherever possible to ensure that nursing home staff are working at a single facility; it is likely that staff working at multiple facilities are helping to spread the infection. Infected nursing home workers and residents should be quarantined at an off-campus facility. States could contract with now-empty hotels to assist with this process.\n  Sixth, the seven states that thus far have refused to report COVID nursing home deaths—Hawaii, New Mexico, North Dakota, South Dakota, Missouri, Michigan, and Vermont—need to start reporting their death tolls in long-term care facilities. The federal government has instituted such a requirement for nursing home deaths occurring after May 5, but as Ohio teaches us, it is also important to get the data from the previous several months.\n  Michigan, in particular, has had a significant outbreak of COVID-19, and Gov. Gretchen Whitmer recently  extended the state&#39;s economic lockdown through June 12. Transparency into fatalities at long-term care centers in Michigan is essential for assessing the wisdom of her policy.\n    There is one silver lining—or perhaps bronze lining—to the COVID long-term care tragedy. The fact that nearly half of all COVID-19 deaths have occurred in long-term care facilities means that the 99.4 percent of the country that  doesn’t live in those places is roughly half as likely to die of the disease than we previously thought.\n    Many European countries have struggled with the same nursing home problems that we have. But based on the mounting evidence that serious illness from COVID-19 is concentrated in the elderly, Switzerland and Germany have reopened their primary and secondary schools. Sweden, for the most part, never closed them to begin with. Germany has kept most of its factories in operation, and Sweden’s restaurants remain open. All of these countries have stable-to-declining rates of hospitalization and death from COVID-19.\n  The results in these countries should give us increased confidence that  measured steps to reopen the economy can work here.\n  State governments bear much more of the responsibility for the depth of the COVID-19 pandemic than many Americans appreciate. But that also means that states have the opportunity to learn from their own mistakes and do the right thing: by protecting vulnerable seniors, and letting millions of Americans get back to work.\n    UPDATE 1: Utah and Kansas have begun reporting nursing home fatalities statewide, which brought our estimate of fatality share from 43% to 42%. The maps and text have been updated to reflect this new information.\n  UPDATE 2: A spokesman for Alaska Gov. Jeff Turner stated that Alaska has no COVID-19 deaths to report from nursing homes or assisted living facilities. A spokeswoman for the Wyoming Department of Health stated that Wyoming has experienced 4 such fatalities out of a total of 14 COVID-19 deaths. The maps and text have been updated to reflect this information.\n  FOLLOW  @Avik on Twitter and  YouTube, and  The Apothecary on  Facebook. Or, sign up to receive a  weekly e-mail digest of articles from  The Apothecary. Read   A New Strategy for Bringing People Back to Work During Covid-19, an economic reopening plan co-authored by Avik, at FREOPP.org.", "posttime": "2020-08-12 12:50:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,统计数据,covid,疗养院", "title": "Covid重要统计数据：美国42%的死亡来自0.6%的人口", "title_en": "Important Covid Statistic: 42% of U.S. Deaths Are from 0.6% of the Population", "transed": 1, "url": "https://www.forbes.com/sites/theapothecary/2020/05/26/nursing-homes-assisted-living-facilities-0-6-of-the-u-s-population-43-of-u-s-covid-19-deaths/#5f3044d874cd", "via": "", "real_tags": ["美国", "统计数据", "covid", "疗养院"]}, {"category": "", "categoryclass": "", "imagename": "a8d2a35fecb4d2a80f4ab419e369d902.jpeg", "infoid": 1017688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "长期以来，欧盟在隐私监管方面一直是潮流的引领者。它的一般数据保护条例(GDPR)和严格的反垄断法激发了世界各地的新立法。几十年来，欧盟一直在制定对个人数据的保护措施，并反对它认为的对私人信息的商业利用，自豪地将其法规与美国的轻度隐私政策形成对比。\n新的欧洲数据治理战略(Pdf)采取了完全不同的方法。有了它，欧盟将成为促进其公民个人数据使用和货币化的积极参与者。该战略由欧盟委员会(European Commission)于2020年2月公布，概述了未来五年将推出的政策措施和投资。\n这一新战略代表着欧盟焦点的根本转变，从保护个人隐私转向促进数据共享，将其作为一项公民义务。具体地说，它将通过一种名为数据信托的机制创建一个泛欧洲的个人数据市场。数据信托是代表人们管理数据并对其客户负有受托责任的管家。\n欧盟的新计划将个人数据视为欧洲的一项关键资产。然而，这种方法引发了一些问题。首先，欧盟从其收集的个人数据中获利的意图使欧洲各国政府在监管该行业方面处于弱势地位。其次，数据信托的不当使用实际上会剥夺公民获取自己数据的权利。\n信托项目是欧盟新政策提出的第一个倡议，将于2022年实施。有了700万欧元的预算，它将建立一个泛欧洲的个人和非个人信息池，应该会成为寻求获取公民信息的企业和政府的一站式服务。\n全球科技公司将不被允许存储或移动欧洲人的数据。取而代之的是，他们将被要求通过信托访问它。公民将收取“数据红利”，这还没有明确的定义，但可能包括使用他们个人数据的公司的货币或非货币支付。随着欧盟约5亿公民准备成为数据源，这些信托基金将创建世界上最大的数据市场。\n对于公民来说，这意味着他们创建的数据和关于他们的数据将保存在公共服务器中，并由数据信托管理。欧盟委员会(European Commission)将这些信托基金设想为一种方式，以帮助欧洲企业和政府重用整个地区产生的海量数据，并从这些数据中提取价值，并帮助欧洲公民从他们的信息中受益。然而，项目文档没有具体说明个人将如何获得补偿。\n数据信托最早是由互联网先驱蒂姆·伯纳斯·李爵士(Sir Tim Berners Lee)于2018年提出的，自那以来，这个概念吸引了相当大的兴趣。就像用来管理财产的信托一样，数据信托可能有不同的目的：它们可以是营利性企业，也可以是为了数据存储和保护而设立的，也可以是为了慈善事业而设立的。\nIBM和万事达卡(Mastercard)在爱尔兰建立了一个数据信托，以管理其欧洲客户的财务信息；英国和加拿大采用数据信托来刺激那里人工智能产业的增长；最近，印度宣布计划建立自己的公共数据信托，以刺激科技公司的增长。\n这个新的欧盟项目是以奥地利的数字系统为蓝本的，该系统通过为公民分配唯一标识符并将数据存储在公共存储库来跟踪公民产生的信息和有关他们的信息。\n不幸的是，数据信托并不能保证更高的透明度。信托受信托委托人制定的章程管辖，其规则可以将某人的利益放在首位。信托基金由董事会管理，这意味着拥有更多席位的政党获得了重大控制权。\n信托项目必然会面临自身的一些治理问题。在运营关键基础设施或管理有价值的资产方面，公共和私人行为者往往意见不一。科技公司倾向于支持为自己的产品和服务创造机会的政策。陷入利益冲突，欧洲可能会忽视隐私问题。\n在某些情况下，数据信托被用来剥夺个人控制收集到的数据的权利。2019年10月，加拿大政府拒绝了Alphabet/Sideway Labs提出的为多伦多智慧城市项目创建数据信托的提议。Sideway Labs设计这一信托基金的方式确保了该公司对公民数据的控制。印度的数据信托公司因将当局定义为“信息受托人”而给予政府不受限制的个人信息访问权限而受到批评。\n一种可能的解决方案可能是建立一个由公共和私人数据管理员组成的生态系统，每个数据管理员都服务于不同的需求。这种自下而上方式的发起人西尔维·德拉克鲁瓦(Sylvie Delacroix)和尼尔·劳伦斯(Neil Lawrence)将数据信托比作养老基金，称它们应该受到严格监管，能够为指定的群体提供不同的服务。\n当欧盟的信托项目付诸实施时，很可能会改变全球范围内的隐私格局。然而，不幸的是，这种新的方法不一定会给欧洲公民更多的隐私或对他们的信息的控制。目前还不清楚该项目将追求何种信托模式，但这些政策目前没有为公民提供任何选择退出的方式。\n在最近的美国国会反垄断听证会上，四大平台公司公开承认使用监控技术、操纵市场和强力收购来主导数据经济。从这些爆料中，最重要的一个教训是，不能相信交易个人数据的公司会存储和管理这些数据。将个人信息与平台的基础设施脱钩将是遏制其垄断力量的决定性一步。这可以通过数据管理来实现。\n理想情况下，信托项目将向世界展示一种更公平的方式来获取和分发个人数据的真正价值。我们还有时间兑现这一承诺。\n安娜·阿图什娜(Anna Artyushina)是一名公共政策学者，专门研究数据治理和智慧城市。她是多伦多约克大学科学技术研究的博士生。", "note_en": "The European Union has long been a trendsetter in privacy regulation. Its General Data Protection Regulation (GDPR) and stringent antitrust laws  have inspired new legislation around the world. For decades, the EU has codified protections on personal data and fought against what it viewed as commercial exploitation of private information, proudly positioning its regulations in contrast to the light-touch privacy policies in the United States.\n  The  new European data governance strategy (pdf) takes a fundamentally different approach. With it, the EU will become an active player in facilitating the use and monetization of its citizens’ personal data. Unveiled by the European Commission in February 2020, the strategy outlines policy measures and investments to be rolled out in the next five years.\n  This new strategy represents a radical shift in the EU’s focus, from protecting individual privacy to promoting data sharing as a civic duty. Specifically, it will create a pan-European market for personal data through a mechanism called a data trust. A data trust is a steward that manages people’s data on their behalf and has fiduciary duties toward its clients.\n  The EU’s new plan considers personal data to be a key asset for Europe. However, this approach raises some questions. First, the EU’s intent to profit from the personal data it collects puts European governments in a weak position to regulate the industry. Second, the improper use of data trusts can actually deprive citizens of their rights to their own data.\n  The Trusts Project, the first initiative put forth by the new EU policies, will be implemented by 2022. With a €7 million budget, it will set up a pan-European pool of personal and nonpersonal information that should become a one-stop shop for businesses and governments looking to access citizens’ information.\n  Global technology companies will not be allowed to store or move Europeans’ data. Instead, they will be required to access it via the trusts. Citizens will collect “data dividends,” which haven’t been clearly defined but could include monetary or nonmonetary payments from companies that use their personal data. With the EU’s roughly 500 million citizens poised to become data sources, the trusts will create the world’s largest data market.\n  For citizens, this means the data created by them and about them will be held in public servers and managed by data trusts. The European Commission  envisions the trusts as a way to help European businesses and governments reuse and extract value from the massive amounts of data produced across the region, and to help European citizens benefit from their information. The project documentation, however, does not specify how individuals will be compensated.\n  Data trusts were first proposed by internet pioneer  Sir Tim Berners Lee in 2018, and the concept has drawn considerable interest since then. Just like the trusts used to manage one’s property, data trusts may serve different purposes: they can be for-profit enterprises, or they can be set up for data storage and protection, or to work for a charitable cause.\n  IBM and Mastercard have built a data trust to manage the financial information of their European clients in Ireland; the UK and Canada have employed data trusts to stimulate the growth of the AI industries there; and recently, India announced plans to establish its own public data trust to spur the growth of technology companies.\n  The new EU project is modeled on Austria’s digital system, which keeps track of information produced by and about its citizens by assigning them unique identifiers and storing the data in public repositories.\n  Unfortunately, data trusts do not guarantee more transparency. The trust is governed by a charter created by the trust’s settlor, and its rules can be made to prioritize someone’s interests. The trust is run by a board of directors, which means a party that has more seats gains significant control.\n  The Trusts Project is bound to face some governance issues of its own. Public and private actors often  do not see eye to eye when it comes to running critical infrastructure or managing valuable assets. Technology companies tend to favor policies that create opportunity for their own products and services. Caught in a conflict of interest, Europe may overlook the question of privacy.\n  And in some cases, data trusts have been used to strip individuals of their rights to control data collected about them. In October 2019, the government of Canada rejected a proposal by Alphabet/Sidewalk Labs to create a data trust for Toronto’s smart city project. Sidewalk Labs had designed the trust in a way  that secured the company’s control over citizens’ data. And India’s data trust faced criticism for giving the government unrestricted access to personal information  by defining authorities as “information fiduciaries.”\n  One possible solution could be to set up an ecosystem of data stewards, both public and private, that each serve different needs.  Sylvie Delacroix and  Neil Lawrence, the originators of this  bottom-up approach, liken data trusts to pension funds, saying they should be tightly regulated and able to provide different services to designated groups.\n  When put into practice, the EU’s Trusts Project will likely change the privacy landscape on a global scale. Unfortunately, however, this new approach won’t necessarily give European citizens more privacy or control over their information. It is not yet clear what model of trusts the project will pursue, but the policies do not currently provide any way for citizens to opt out.\n  At a recent congressional antitrust hearing in the United States, four major platform companies publicly recognized the use of surveillance technologies, market manipulation, and forceful acquisitions to dominate the data economy. The single most important lesson from these revelations is that companies that trade in personal data cannot be trusted to store and manage it. Decoupling personal information from the platforms’ infrastructure would be a decisive step toward curbing their monopoly power. This can be done through data stewardship.\n  Ideally, the Trusts Project would show the world a more equitable way to capture and distribute the true value of personal data. There’s still time to deliver on that promise.\n  Anna Artyushina  is a public policy scholar specializing in data governance and smart cities. She is a PhD candidate in science and technology studies at York University in Toronto.", "posttime": "2020-08-12 12:26:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "launching,数据", "title": "欧盟正在推出个人数据市场", "title_en": "The EU is launching a market for personal data", "transed": 1, "url": "https://www.technologyreview.com/2020/08/11/1006555/eu-data-trust-trusts-project-privacy-policy-opinion/", "via": "", "real_tags": ["launching", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017687, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择此选项将在上下文中搜索发布者/社会的所有发布", "note_en": "Selecting this option will search all publications for the Publisher/Society in context", "posttime": "2020-08-12 12:26:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "信息,information,选项", "title": "信息大灾难", "title_en": "The Information Catastrophe", "transed": 1, "url": "https://aip.scitation.org/doi/10.1063/5.0019941", "via": "", "real_tags": ["信息", "选项"]}, {"category": "", "categoryclass": "", "imagename": "04784e85b0f074a69b7f27d809d0eaff.jpg", "infoid": 1017684, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pinterest在6月份宣布，目前其月度活跃用户约为4亿，其中大部分是女性。但它的高层管理人员都是男性。诉讼称：“具有讽刺意味的是，尽管Pinterest向女性推销自己是生活方式灵感的源泉，但公司领导班子中男性占主导地位，性别偏见的态度很普遍。”\n在2018年3月加入Pinterest之前，布劳赫曾在Square、谷歌和Charles Schawb担任过高管职位。尽管有经验，但布劳赫在诉讼中声称，她受聘时的股权薪酬方案不如她的男性同龄人优惠。布劳赫还表示，在她在公司任职期间，她被其他高管排除在关键决策之外；受到敌意的工作环境的影响；最终，当她公开反对自己受到的待遇时，首席执行官本·西尔伯曼(Ben Silbermann)解雇了她。\n在今天发表的一篇中等规模的帖子中，布劳赫写道：“我一直是个注重隐私的人，但我现在要公开我的经历，因为如果像我这样有特权和资历的人因为直言不讳地谈论这些问题而被解雇，对于职业生涯早期的人来说，情况可能会糟糕得多。”\n布劳赫起诉Pinterest的两个月前，两名黑人前雇员Ifeoma Ozoma和Aerica Shimizu Banks指控该公司不平等薪酬、种族歧视和报复。\n诉讼称，在布劳赫被聘用时，她被告知Pinterest董事会指示高管接受积压的股权拨款。她的股权授予规定，第一年只有10%的股份归属；其次是第二年20%；第三年30%；第四年40%。布劳赫认为这个授权时间表是Pinterest高管的标准。\n然而，当该公司去年申请上市时，布劳赫在查看S-1文件时意识到，她的男性同行的股权赠与并没有积压。布劳赫的薪酬在她向西尔伯曼提出担忧后进行了调整，西尔伯曼将她介绍给了Pinterest的人力资源部。\n布劳赫说，她没有被邀请参加Pinterest的首次公开募股(IPO)路演，尽管她是Pinterest的首席运营官，认识公司的许多投资者。\nBrougher表示，在Pinterest于2019年4月首次公开募股(IPO)后，她不再被邀请参加董事会会议，尽管团队成员偶尔也会参加，有时是在她不知情的情况下。“作为Pinterest的首席运营官，布劳赫女士不再与公司董事会有意义的接触，”诉讼称。\n布劳赫的诉讼还声称，她开始收到更多批判性反馈，并引用了科技高管基尔南·斯奈德(Kiernan Snyder)的一项名为“研磨性陷阱”(The Gratability Trap)的研究，该研究发现，在从28家不同规模的公司收集的248条评论中，女性的评价比男性更负面。斯奈德发现，87.9%的女性评论包含批判性反馈，而男性的这一比例为58.9%。在75.5%的女性评论中，她们的个性是批评的焦点，相比之下，男性收到的评论中只有2.4%是批评的焦点。\n诉讼称，西尔伯曼批评布劳赫“不合作，并告诉她，她没有始终如一的健康的跨职能关系。”当布劳赫问他更多细节时，她声称“他告诉她保持沉默，说她应该‘注意’自己在团队环境中的行为。”\n据称，从2020年1月开始，Pinterest的首席财务官托德·摩根菲尔德(Todd Morgenfeld)也变得对布劳赫“越来越不尊重”，无视她，直接与她的团队成员交谈，削弱了她的权威。\n在一次会议上，布劳赫声称摩根菲尔德讽刺地问道：“你到底是做什么工作的？”西尔伯曼还会在布劳赫参加的会议后等待做出关键的战略决定，在她离开后与一两名男性同事会面。\n2月份，诉讼称，布劳赫收到了摩根菲尔德撰写的同行评议，尽管她没有被要求对他进行评议。尽管布劳赫在Pinterest在欧洲的IPO、广告客户基础和货币化战略方面做了一些工作，但诉讼称，“Morgenfeld对她2019年成就的唯一评论是：”她似乎是多样性问题的捍卫者。“。\n在2020年2月21日与摩根菲尔德的视频通话中，布劳赫说，她试图回应他的反馈，但他在电话中变得愤怒，提高了声音，称她是骗子，并质疑她在挂断电话之前给Pinterest带来的价值。\n通话结束后，布劳赫说她给西尔伯曼发了短信，告诉他进展不顺利。2月24日，她会见了Pinterest的首席人力资源官乔·丹尼斯(Jo Dennis)，并表示她希望找到一种与摩根菲尔德合作的方式，但与他单独会面让她感到不舒服。诉讼称，丹尼斯没有在布劳赫和摩根菲尔德之间进行调解，而是将此事视为可能的法律问题，将其升级为Pinterest的内部法律顾问。\n当天，布劳赫还会见了西尔伯曼。诉讼称，西尔伯曼将摩根菲尔德和布劳赫之间的情况比作“一对老夫妇在为谁来煮咖啡而争吵”。\n然后在4月2日，西尔伯曼告诉布劳赫，她将被解雇，并告诉她在下个月将自己的责任移交给摩根菲尔德。他还要求她告诉她的团队，她已经决定离开，但她拒绝了。布劳赫声称，她的离职让她损失了“数千万美元的收入损失和股权补偿”。\n布劳赫的代理律师是鲁迪·埃克斯罗德·齐夫·罗威律师事务所(Rudy，Exelrod，Zieff&amp；Lowe)，该律师事务所还代表鲍康如(Ellen Pao)对凯鹏华盈(Kleiner Perkins)提起性别歧视诉讼。\nTechCrunch已联系Pinterest请其置评。在给纽约时报的一份声明中，Pinterest的一名代表表示，该公司正在对其文化、政策和做法进行独立审查。", "note_en": "Pinterest    announced in June that it currently has about 400 million monthly active users, most of whom are women. But its  top executives are all men. “Ironically, even though Pinterest markets itself to women as a source of lifestyle inspiration, the company leadership team is male dominated, and gender-biased attitudes are prevalent,” the lawsuit says.\n Before joining Pinterest in March 2018, Brougher held executive positions at Square, Google and Charles Schawb. Despite her experience, Brougher claims in her lawsuit that she was hired with a less favorable equity compensation package than her male peers. During her time at the company, Brougher also says she was left out of key decision-making by other executives; subjected to a hostile work environment; and ultimately fired by chief executive officer Ben Silbermann when she spoke up against her treatment.\n  In a  Medium post published today, Brougher writes, “I have always been a private person, but I am opening up about my experience because if someone of my privilege and seniority is fired for speaking out about these issues, the situation is likely far worse for people earlier in their careers.”\n Brougher’s case against Pinterest comes two months after two Black former employees, Ifeoma Ozoma and Aerica Shimizu Banks,  accused the company of unequal pay, racial discrimination and retaliation.\n At the time Brougher was hired, the lawsuit says she was told Pinterest’s board directed executives to receive backloaded equity grants. Her equity grant stipulated that only 10% of shares vested in the first year; followed by 20% the second year; 30% the third year; and 40% the fourth year. Brougher assumed this vesting schedule was standard for Pinterest executives.\n When the company filed to go public last year, however, Brougher realized while looking at its S-1 filing that her male peers’ equity grants were not backloaded. Brougher’s compensation was adjusted after she raised concerns with Silbermann, who directed her to Pinterest’s human resources department.\n Brougher says she was not invited on Pinterest’s IPO roadshow, despite being its COO and knowing many of the company’s investors.\n After Pinterest’s  initial public offering in April 2019, Brougher says she was no longer invited to board meetings, even though members of were team occasionally were, sometimes without her knowledge. “As COO of Pinterest, Ms. Brougher no longer had meaningful engagement with the company’s board,” the lawsuit says.\n  Brougher’s suit also claims that she began receiving more critical feedback, and cites a study by tech executive Kiernan Snyder called  “The Abrasiveness Trap,” which found women are assessed more negatively than men in 248 reviews collected from 28 companies of different sizes. Snyder found that 87.9% of reviews for women contained critical feedback, compared to 58.9% of reviews for men. Their personalities were the focus of criticism in 75.5% of critical reviews for women, compared to just 2.4% of the critical reviews received by men.\n The lawsuit claims Silbermann criticized Brougher for “not being collaborative and told her that she did not have consistently healthy cross-functional relationships.” When Brougher asked him for more details, she claims “he told her to keep quiet, saying she should ‘be mindful’ of how she acted in a group setting.”\n Pinterest’s chief financial officer Todd Morgenfeld also allegedly became “increasingly disrespectful” to Brougher beginning in January 2020, undermining her authority by ignoring her and talking directly to her team members.\n In one meeting, Brougher claims Morgenfeld sarcastically asked “What is your job anyway?” Silbermann would also wait to make key strategy decisions after meetings Brougher attended, meeting with one or two male colleagues after she had left.\n In February, the lawsuit says Brougher received a peer review written by Morgenfeld, even though she had not been asked to review him. Despite Brougher’s work on Pinterest’s IPO, advertiser base and monetization strategy in Europe, the lawsuit says the “Morgenfeld’s  only comment on her 2019 achievements was: “Seems to be a champion for diversity issues.”\n During a video call with Morgenfeld on February 21, 2020, Brougher says she tried to address his feedback, but that he became angry during the call, raised his voice, called her a liar, and questioned the value she brought to Pinterest before hanging up on her.\n After the call, Brougher says she texted Silbermann and told him it had not gone well. On February 24, she met with Pinterest’s Chief Human Resources Officer Jo Dennis and said she wanted to find a way to work with Morgenfeld, but was uncomfortable meeting alone with him. Instead of mediating between Brougher and Morgenfeld, the lawsuit alleges Dennis treated the matter as a possible legal issue, escalating it to Pinterest’s in-house counsel.\n On the same day, Brougher also met with Silbermann. The lawsuit claims that Silbermann compared the situation between Morgenfeld and Brougher to “an old couple fighting over who would make coffee.”\n Then on April 2, Silbermann told Brougher that she was being fired and told her to transfer her responsibilities to Morgenfeld over the next month. He also asked her to tell her team that she had made the decision to leave, which she refused to do. Brougher claims her termination cost her “tens of millions of dollars in lost earnings and equity compensation.”\n Brougher is being represented by law firm Rudy, Exelrod, Zieff &amp; Lowe, which also represented Ellen Pao in her  gender discrimination lawsuit against Kleiner Perkins.\n TechCrunch has reached out to Pinterest for comment. In a statement to    The New York Time s, a Pinterest representative said the company is conducting an independent review of its culture, policies, and practices.", "posttime": "2020-08-12 12:01:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "性别歧视,sues,布劳赫", "title": "\n前首席运营官起诉Pinterest，指控其性别歧视、报复和不当解雇", "title_en": "\n\t\t\t\tFormer COO sues Pinterest, accusing it of gender discrimination, retaliation and wrongful termination\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/11/former-coo-sues-pinterest-accusing-it-of-gender-discrimination-retaliation-and-wrongful-termination/", "via": "", "real_tags": ["性别歧视", "sues", "布劳赫"]}, {"category": "", "categoryclass": "", "imagename": "e113636a761397328865bd16daeb89ae.png", "infoid": 1017683, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-致力于将开源半导体技术商业化的加州初创公司SiFive Inc周二表示，它已经从SK Hynix(000660.KS)和沙特阿美等投资者那里额外筹集了6000万美元的资金。\n该公司表示，其现有投资者-包括来自英特尔公司(INTC.O)、高通公司(QCOM.O)和西部数据公司(WDC.O)的风险投资部门-也加入了这轮融资，使其自2015年成立以来筹集的总资本超过1.85亿美元。\nSiFive正在努力销售基于RISC-V架构的半导体设计，RISC-V架构是制造计算芯片的开源配方。基本架构是免费使用的，但SiFive将其投入到更容易由半导体工厂制造的设计中，并加入了一些自己的技术，以创建比单独使用免费架构更有用的处理器芯片。\nRISC-V生态系统旨在挑战软银集团的(9984.T)ARM有限公司，后者将其专有芯片架构授权给三星电子有限公司(005930.KS)和苹果公司(AAPL.O)等公司，以及SiFive的几个投资者。\n多家媒体报导称，软银正在与美国芯片供应商英伟达(NVDA.O)就可能出售ARM进行谈判。\nSiFive是一个独立于监督开源RISC-V技术的基金会的商业实体，尽管SiFive的几位创始人是该技术的联合创建者，也参与了基金会。\n该基金会去年表示，在该组织的几名外国成员对美国可能实施的贸易限制表示担忧后，该基金会将把总部迁往瑞士。", "note_en": "(Reuters) - SiFive Inc, a California startup working to commercialize an open-source semiconductor technology, said on Tuesday that it has raised an additional $60 million in funding from investors including SK Hynix (  000660.KS) and Saudi Aramco.\n The company said its existing investors - including venture capital arms from Intel Corp (  INTC.O), Qualcomm Inc (  QCOM.O) and Western Digital Corp (  WDC.O) - also joined the funding round, bringing its total capital raised since its founding in 2015 to more than $185 million.\n SiFive is working to sell designs for semiconductors based on the RISC-V architecture, an open-source recipe for making computing chips. The basic architecture is free to use, but SiFive puts it into designs that can more readily be manufactured by a semiconductor factory and adds in some of its own technologies to create a more useful processor chip than using the free architecture alone.\n The RISC-V ecosystem aims to challenge SoftBank Group Corp’s (  9984.T) Arm Ltd, which licenses out its proprietary chip architecture to firms such as Samsung Electronics Co Ltd (  005930.KS) and Apple Inc (  AAPL.O), as well as several of SiFive’s investors.\n Multiple media outlets have reported that SoftBank is in talks with U.S. chip supplier Nvidia Corp (  NVDA.O) for a potential sale of Arm.\n SiFive is a commercial entity that is separate from the foundation that oversees the open-source RISC-V technology, although several of SiFive’s founders are co-creators of the technology and are also involved with the foundation.\n The foundation last year said it was moving its headquarters to Switzerland after several of the group’s foreign members raised concerns about potential U.S. trade curbs.", "posttime": "2020-08-12 11:59:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "竞争对手,hynix,架构", "title": "ARM竞争对手SiFive从SK Hynix，Aramco筹集6000万美元", "title_en": "Arm rival SiFive raises $60M from SK Hynix, Aramco", "transed": 1, "url": "https://www.reuters.com/article/us-sifive-tech/arm-rival-sifive-raises-60-million-from-sk-hynix-aramco-idUSKCN2571UL", "via": "", "real_tags": ["竞争对手", "hynix", "架构"]}, {"category": "", "categoryclass": "", "imagename": "77e44f77a17dd25ac2a3790187f2c23c.jpg", "infoid": 1017681, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索Mozilla公司(样式为moz：//a)是Mozilla基金会的全资子公司，由全球开源开发人员社区协调和集成与Internet相关的应用程序(如Firefox Web浏览器)的开发，其中一些开放源码开发人员自己受雇于该公司。该公司还分销和推广这些产品。与非营利性的Mozilla基金会和由现已停业的Netscape通信公司创建的Mozilla开源项目不同，Mozilla公司是一个应纳税的实体。Mozilla公司将其所有利润重新投资到Mozilla项目中。[4]Mozilla公司声明的目标是努力实现Mozilla基金会的公共利益，促进互联网上的选择和创新。\nMozilla基金会将最终控制Mozilla公司的活动，并将保留其对新子公司的100%所有权。Mozilla公司获得的任何利润都将重新投资到Mozilla项目中。不会有股东，不会发行股票期权，也不会支付股息。Mozilla公司将不会在股票市场上市，任何公司都不可能接管或购买该子公司的股份。Mozilla基金会将继续拥有Mozilla商标和其他知识产权，并将把它们授权给Mozilla公司。基金会还将继续管理源代码存储库，并控制允许谁签入。[6]。\nMozilla公司成立于2005年8月3日，负责处理Mozilla基金会与收入相关的业务。作为一家非营利性组织，莫兹拉基金会在收入类型和金额方面都是有限的。Mozilla公司作为一个应税组织(本质上是一种商业经营)，并不一定要遵守这样严格的规定。创建后，Mozilla公司从Mozilla基金会接管了几个领域，包括协调和整合Firefox和Thunderbird的开发(由全球自由软件社区)，以及管理与企业的关系。\n随着Mozilla公司的成立，Mozilla基金会的其余成员缩小了关注范围，专注于Mozilla项目的治理和政策问题。2005年11月，随着Mozilla Firefox1.5的发布，Mozilla公司的网站mozilla.com作为Firefox和Thunderbird产品的在线新主页揭开了面纱。\n2006年，Mozilla公司创造了6680万美元的收入和1980万美元的开支，其中85%的收入来自谷歌，用于将[谷歌]指定为浏览器的默认搜索引擎，以及用于在随后的搜索结果页面上放置广告的点击。\n2006年3月，杰森·卡拉卡尼斯(Jason Calacanis)在他的博客上报告了一个谣言，称Mozilla公司在前一年赚了7200万美元，这主要得益于Firefox浏览器中的谷歌搜索框。[9]后来，当时的董事会成员克里斯托弗·暴雪(Christopher Blizzard)澄清了这一传言，他在博客上写道，这是不正确的，尽管没有偏离一个数量级。[10]两年后，TechCrunch写道：作为将谷歌设置为Firefox默认搜索引擎的回报，谷歌向Mozilla支付了一大笔钱-2006年，总额约为5700万美元，占该公司总收入的85%。这笔交易原定于2006年到期，但后来被延长到2008年，然后一直持续到2011年。[11]这笔交易再次延长了3年，直到2014年11月。根据协议，Mozilla将从谷歌获得另外9亿美元(每年3亿美元)，几乎是之前金额的3倍。[12]。\n2006年8月，微软在Mozilla新闻组上发布了一封信[13]，并提出在其位于华盛顿州雷蒙德的总部向Mozilla软件工程师开放一个新的开源设施。作为回应，Mozilla接受了这一提议。[14]。\n2014年3月，Mozilla在任命Brendan Eich为新的首席执行官(CEO)后受到了一些批评。2008年，艾奇捐赠了1000美元支持加州8号提案[15]，这是一项投票倡议，禁止加州法律承认同性婚姻。[16]据报道，6名Mozilla董事会成员中有3名因CEO的选择而辞职[17]，不过Mozilla表示，辞职的董事会成员有各种原因[18]，并重申将继续致力于LGBT平等[19][20]，包括同性婚姻。[21]4月1日，在线约会网站OkCupid开始向使用Mozilla Firefox的访问者显示一条消息，敦促他们切换到不同的网络浏览器，并指出OkCupid上8%的配对是同性伴侣之间的。[22]4月3日，Mozilla宣布\n2014年4月，Mozilla前首席营销官克里斯·比尔德被任命为临时首席执行官。比尔德于同年7月28日被任命为首席执行官。[29][29]。\n2017年2月27日，它收购了网络储蓄服务Pocket。[30]根据Mozilla作为默认开放模式运营的历史，以及Mozilla首席商务官Denelle Dixon-Thayer关于Pocket将成为Mozilla开源项目的一部分的评论，有报道称Pocket将成为开源。在收购之前，Pocket背后的初创公司将其作为封闭源代码的商业服务进行运营，而Mozilla将源代码作为开源向Firefox发布了添加了Save to Pocket功能的源代码。截至2019年9月，Pocket仍然是开源的，而扩展仍然是开源的。\n大众媒体[31][32]已经注意到Mozilla公司与谷歌的关系，特别是关于他们的付费推荐协议。Mozilla与谷歌(Google)最初达成的让谷歌搜索(Google Search)作为浏览器默认网络搜索引擎的协议已于2011年到期，但双方达成了一项新协议，谷歌同意在三年内向Mozilla支付略低于10亿美元，以换取谷歌继续作为其默认搜索引擎。由于微软必应(Bing)和雅虎(Yahoo！)在拍卖会上的积极出价，这一价格被推高了。尽管达成了协议，Mozilla Firefox仍与必应、雅虎、Yandex、百度、亚马逊和eBay保持着合作关系。[33][33]。\n特别是火狐2在2007年发布的反钓鱼保护功能引发了相当大的争议：[42]默认启用的反钓鱼保护基于谷歌服务器每小时更新两次的列表。[43]用户不能在GUI内改变数据提供者[44]，并且不被告知谁是默认数据提供者。浏览器还会在每次更新请求时发送谷歌的cookie。[45]一些[谁？]。互联网隐私倡导团体对谷歌可能使用这些数据表示担忧，特别是因为火狐的隐私政策规定，谷歌可能会与包括商业合作伙伴在内的第三方共享通过安全浏览收集的(非个人身份识别)信息。[46][中英文对照]。\n2009年12月，谷歌首席执行官埃里克·施密特(Eric Schmidt)在CNBC节目中就隐私问题发表评论后，Mozilla社区发展总监阿萨·多兹勒(Asa Dotzler)建议用户使用必应(Bing)搜索引擎，而不是谷歌搜索。[48]在谷歌Chrome发布之前，谷歌还通过YouTube推广火狐。2009年8月，Mozilla Security帮助谷歌指出了谷歌Chrome浏览器的一个安全漏洞。[49][49]。\n2014年11月，Mozilla与雅虎签署了为期五年的合作伙伴关系，使雅虎！在美国搜索Firefox浏览器的默认搜索引擎。[50]随着火狐Quantum于2017年11月17日发布，谷歌再次成为默认搜索引擎。[51][font=宋体]。\n微软澳大利亚业务负责人史蒂夫·瓦莫斯(Steve Vamos)在2004年底表示，他不认为火狐是一种威胁，微软用户对火狐功能集的需求也不大。[52]微软董事长比尔·盖茨用过火狐，但他评论说，火狐只是另一个浏览器，IE(微软的IE浏览器)更好。[53][font=宋体]。\nMicrosoft SEC在2005年6月30日提交的一份文件中承认，Mozilla等竞争对手提供的软件与我们Windows操作系统产品的Internet Explorer Web浏览功能相竞争。&#34；[54]Internet Explorer 7的发布速度很快，并且包括以前在Firefox和其他浏览器中提供的功能，如选项卡式浏览和RSS提要。[55][font=宋体]\n尽管受到微软最高管理层的冷遇，Internet Explorer开发团队仍与Mozilla保持着合作关系。他们定期开会讨论网络标准，例如扩展验证证书。[56]2005年，Mozilla同意允许Microsoft使用其Web提要徽标，以实现Web提要功能的通用图形表示。[57][font=宋体]。\n2006年8月，微软提出帮助Mozilla将Firefox与当时即将推出的Windows Vista集成，Mozilla接受了这个提议。[59][59]。\n2006年10月，为了祝贺Firefox2的成功发布，Internet Explorer7开发团队给Mozilla送去了一个蛋糕。[60]作为对浏览器大战的认可，一些人开玩笑地建议Mozilla在参考开源软件运动的同时，把蛋糕连同食谱一起寄回去。[62]2008年6月17日，在Firefox3成功发布之后，IE开发团队又送来了一块蛋糕，[63]2011年3月22日，针对Firefox4，[64]，再次针对Firefox5发布。[65][font=宋体]。\n2007年11月，杰夫·琼斯(微软值得信赖的计算组的安全战略总监)批评了Firefox，声称在典型的企业场景中，Internet Explorer比Firefox经历的漏洞更少，更严重的漏洞也更少。[66]Mozilla开发者Mike Shaver对这项研究不屑一顾，称微软捆绑的安全补丁和这项研究的重点是补丁，而不是漏洞，这些都是关键缺陷。[67][67]。\n2009年2月，Microsoft发布了.NET Framework 3.5版的Service Pack 1。此更新还安装了Microsoft.NET框架助手加载项(启用ClickOnce支持)。[68]在用户发现该插件无法通过插件界面卸载后，该更新受到了媒体的关注。[69]在Annoyances.org网站发布了一篇关于此更新的文章几个小时后，微软员工布拉德·艾布拉姆斯在他的博客中发布了微软为什么要安装该插件的解释，并提供了有关如何删除它的详细说明。[71]但是，消除此扩展的唯一方法是手动修改Windows注册表，如果操作不正确，这可能会导致Windows系统无法启动。[69][font=宋体]。\n2009年10月16日，Mozilla阻止所有版本的Microsoft.NET框架助手与Firefox和Mozilla附加组件服务一起使用。[72]两天后，在微软确认该加载项不是漏洞传播媒介后，该加载项被从阻止列表中删除。[73]1.1版(2009年6月10日发布给Mozilla Add-ons服务)及更高版本的Microsoft.NET Framework Assistant允许用户以正常方式禁用和卸载。[75][75]。\n自2010年起，火狐是向欧洲经济区用户提供的12款微软Windows浏览器之一-参见BrowserChoice.eu。[76][76]。\n2008年，美国国税局(Internal Revenue Service)启动了对Mozilla基金会(Mozilla Foundation)2004-2005年收入的审计，原因是该基金会的搜索版税。2009年，调查扩大到2006和2007纳税年度，尽管这部分审计已经结束。由于Mozilla的收入中至少有三分之一不是来自公众捐款，因此它不会自动成为一家公共慈善机构。[77][font=宋体]\n2012年11月，在发现Mozilla基金会欠美国国税局150万美元的和解款项后，审计结束。[78][79][79]。\n董事会由莫兹拉基金会董事会任命并对其负责。2014年3月，半数董事会成员辞职。[17]其余董事会成员为：\n艾伦·西米诺夫(Ellen Siminoff)，前董事会成员，同时也是Shmoop大学校长兼首席执行官和Efficient Frontier董事长。\n^Cimpanu，卡塔林(2020年8月11日)。Mozilla正在裁员250人，并计划将新的重点放在赚钱上。边缘。\n员工(2005年8月5日)，Mozilla基金会重组，Mozilla公司，从原件存档，2008年4月21日。\nMozillaZine文章：&#34；Mozilla基金会宣布成立Mozilla公司，于2009年3月24日通过互联网档案馆检索。\n^Keizer，Gregg(2007年10月25日)。贝克说，没有谷歌的钱，Mozilla也可以生存。计算机世界。从原件存档于2012年1月5日。\n托马斯·休斯顿(2011年12月5日)。火狐与谷歌搜索合作的未来仍不明朗。边缘。\n克里斯托弗，暴雪(2006年3月7日)。将小指涂抹在嘴角。0xDeadBeef.com。存档日期为2012年7月16日。\n^Kincaid，Jason(2008年8月28日)。Mozilla将与谷歌的利润丰厚的交易延长了3年。TechCrunch。\n戴维·墨菲(2011年12月24日)。谷歌(Google)向Mozilla支付近10亿美元购买火狐(Firefox)搜索：原因何在？PC杂志。\n^Baker，Colin(2006年8月24日)。微软向火狐伸出援手。CNet.。存档日期为2012年7月17日。\n^Silver，Nate(2014年4月4日)。硅谷的反同性恋捐款有多罕见？五三八。\n萨姆·马奇科维奇(2014年3月25日)。Gay Firefox开发者抵制Mozilla，抗议CEO聘用[更新]。ArsTechnica.。\n^a b Barr，阿利斯泰尔(2014年3月28日)。三名Mozilla董事会成员因选择新CEO辞职。华尔街日报。\n萨姆·马奇科维奇(2014年3月29日)。包括前首席执行官在内的三名Mozilla董事会成员下台。ArsTechnica.\n^Kelly，Heather(2014年4月1日)。OkCupid抗议火狐首席执行官反对同性婚姻捐赠。CNN新闻。\n^大卫·罗伯逊(2014年4月6日)。火狐没有通过耐受性测试：我们重获自由，但它可能会让我们丢掉饭碗|“今日基督教”基督教新闻(Christian News on Christian Today&34；)。克里斯汀托日网。\n^Swisher，Kara(2014年4月3日)。Mozilla联合创始人布伦丹·艾奇辞去首席执行官一职，离开基金会董事会。重新/编码。\n“吉米·阿金如何反击Mozilla/Firefox的同性恋婚姻暴行”，“国家天主教纪事报”(2014年4月6日)。\n莫兹拉首席执行官的辞职引发了言论自由问题，美联社(2016年4月4日)：虽然许多同性恋权利活动家和评论员对艾奇的离开表示欢迎，但也有持不同政见者。著名的同性恋博客写手安德鲁·沙利文(Andrew Sullivan)抨击了导致辞职的压力。\n康纳·弗里德斯多夫(Conor Friedersdorf)(2014年4月4日)。莫兹拉的同性婚姻试金石测试违反了自由主义价值观。大西洋。\nMozilla收购Pocket是为了在移动设备领域站稳脚跟。边缘。VOX媒体。\n^贡萨尔维斯，安通(2006年3月7日)。Mozilla证实火狐在谷歌上赚了数百万美元。信息周刊。\n^a b Swisher，Kara(2011年12月22日)。谷歌每年将向Mozilla支付近3亿美元的搜索费用，超过了微软和雅虎。所有的东西都是D。\n^a b Hood&amp；Strong，LLP。(2006年12月31日)。Mozilla基金会及其子公司-独立审计师报告和合并财务报表(PDF)。莫兹拉基金会。第11页。\n^Hood&amp；Strong，LLP。(2007年12月31日)。Mozilla基金会及其子公司-独立审计师报告和合并财务报表(PDF)。莫兹拉基金会。\n^Hood&amp；Strong，LLP。(2008年12月31日)。Mozilla基金会及其子公司-独立审计师报告和合并财务报表(PDF)。莫兹拉基金会。\n布莱恩·特纳(2006年10月26日)。火狐2发布隐私风暴。普拉提纳克斯。2007年1月21日从原件存档。\n^&#34；Firefox隐私策略&#34；。Mozilla.com。2006年10月。2009年1月9日从原件存档。\n^&34；如果您没有什么要隐藏的……Weblogs.mozillazine.org。2009年12月10日。2009年12月13日从原件存档。\n科塔迪亚，穆尼尔(2004年11月11日)。微软：Firefox不会威胁IE的市场份额。ZDNet。\n^韦伯，蒂姆(2005年5月9日)。对软件巨头微软的攻击。BBC新闻。\n^Keizer，Gregg(2005年9月1日)。美国证券交易委员会(SEC)的文件显示，微软担心火狐，担心漏洞诉讼。Linux Online。2010年5月2日从原件存档。\n^Weber，Tim(2005年5月10日)。微软计划如何击败竞争对手。BBC新闻。\n在IE7和其他浏览器中提供更好的网站标识和扩展验证证书&#34；。即博客。2005年11月21日。\n图标：它仍然是橙色的。RSS。2005年12月14日。2005年12月16日从原件存档。\n^Barker，Colin(2006年8月22日)。微软向火狐开发者伸出援手。CNET新闻。\n^Barker，Colin(2006年8月24日)。微软向火狐伸出援手。CNet.。CNET新闻。2013年6月15日从原件存档。\n^Wenzel，Frédéric(2006年10月24日)。&#34；来自雷德蒙德，带着爱&#34；。Fredericiana(Mozilla公司实习生的博客)。\n^Wenzel，Frédéric(2008年6月17日)。“来自爱的雷德蒙德”，第2部分&34；Fredericiana(Mozilla公司实习生的博客)。\n^&#34；Internet Explorer和Firefox漏洞分析报告&#34；。2007年11月30日。2009年4月30日从原件存档。\n计算仍然容易，批判性思维仍然出人意料地难。2007年11月30日。2008年2月26日从原件存档。\n微软可能是火狐最大的漏洞。2009年7月7日。2011年5月24日从原件存档。\n^a Microsoft Update静默安装Firefox扩展。华盛顿邮报。2009年5月29日。\n^&#34；删除Microsoft.NET Framework Assistant(ClickOnce)Firefox扩展&#34；。2009年2月27日。2009年3月10日从原件存档。\n^Shaver，Mike(2009年10月19日)。从本周末开始更新.NET Framework助手和Windows Presentation Foundation插件阻止。\n布莱恩·克雷布斯(2009年6月3日)。微软对Firefox附加组件Snafu；的修复。华盛顿邮报。\n凯瑟琳娜·博尔切特(Katharina Borchert)将加入Mozilla领导团队，担任首席创新官。莫兹拉。2015年10月12日。\n斯蒂芬·尚克兰(2015年12月10日)。Startup接过了陷入困境的Firefox操作系统的火炬。CNet.", "note_en": "Jump to navigation  Jump to search  The  Mozilla Corporation (stylized as  moz://a) is a wholly owned subsidiary of the  Mozilla Foundation that coordinates and integrates the development of  Internet-related  applications such as the  Firefox  web browser, by a global community of open-source developers, some of whom are employed by the corporation itself. The corporation also distributes and promotes these products. Unlike the  non-profit Mozilla Foundation, and the  Mozilla open source project, founded by the now defunct  Netscape Communications Corporation, the Mozilla Corporation is a  taxable entity. The Mozilla Corporation reinvests all of its profits back into the Mozilla projects.  [4] The Mozilla Corporation&#39;s stated aim is to work towards the Mozilla Foundation&#39;s  public benefit to &#34;promote choice and innovation on the Internet.&#34;  [5]\n  The Mozilla Foundation will ultimately control the activities of the Mozilla Corporation and will retain its 100 percent ownership of the new subsidiary. Any profits made by the Mozilla Corporation will be invested back into the Mozilla project. There will be no shareholders, no stock options will be issued and no dividends will be paid. The Mozilla Corporation will not be floating on the stock market and it will be impossible for any company to take over or buy a stake in the subsidiary. The Mozilla Foundation will continue to own the Mozilla trademarks and other intellectual property and will license them to the Mozilla Corporation. The Foundation will also continue to govern the source code repository and control who is allowed to check in.  [6]\n   The Mozilla Corporation was established on August 3, 2005, to handle the  revenue-related operations of the Mozilla Foundation. As a non-profit, the Mozilla Foundation is limited in terms of the types and amounts of revenue. The Mozilla Corporation, as a taxable organization (essentially, a commercial operation), does not have to comply with such strict rules. Upon its creation, the Mozilla Corporation took over several areas from the Mozilla Foundation, including coordination and integration of the development of Firefox and Thunderbird (by the global  free software community) and the management of relationships with  businesses.\n With the creation of the Mozilla Corporation, the rest of the Mozilla Foundation narrowed its focus to concentrate on the Mozilla project&#39;s governance and policy issues. In November 2005, with the release of Mozilla Firefox 1.5, the Mozilla Corporation&#39;s website at mozilla.com was unveiled as the new home of the Firefox and Thunderbird products online.\n In 2006, the Mozilla Corporation generated $66.8 million in revenue and $19.8 million in expenses, with 85% of that revenue coming from Google for &#34;assigning [Google] as the browser&#39;s default search engine, and for click-throughs on ads placed on the ensuing search results pages.&#34;  [7]  [8]\n  In March 2006,  Jason Calacanis reported a rumor on his blog that Mozilla Corporation gained $72M during the previous year, mainly thanks to the  Google search box in the Firefox browser.  [9] The rumor was later addressed by  Christopher Blizzard, then a member of the board, who wrote on his blog that, &#34;it’s not correct, though not off by an order of magnitude.&#34;  [10] Two years later,   TechCrunch wrote: &#34;In return for setting Google as the default search engine on Firefox, Google pays Mozilla a substantial sum – in 2006, the total amounted to around $57 million, or 85% of the company’s total revenue. The deal was originally going to expire in 2006, but was later extended to 2008 and then ran through 2011.&#34;  [11] The deal was extended again another 3 years, until November 2014. Under the deal, Mozilla was to have received from Google another $900 million ($300 million annually), nearly 3 times the previous amount.  [12]\n In August 2006,  Microsoft posted a letter on Mozilla newsgroups  [13] and offered to open up a new open-source facility at its headquarters in Redmond, Wash., to Mozilla software engineers. Mozilla responded by accepting the offer.  [14]\n In March 2014, Mozilla came under some criticism after it appointed  Brendan Eich as its new Chief Executive Officer (CEO). In 2008, Eich had made a $1,000 contribution in support of  California Proposition 8,  [15] a ballot initiative that barred legal recognition of  same-sex marriages in California.  [16] Three of six Mozilla board members reportedly resigned over the choice of CEO,  [17] though Mozilla said the resigning board members had &#34;a variety of reasons&#34;  [18] and reasserted its continued commitment to LGBT equality,  [19]  [20] including same-sex marriage.  [21] On April 1, the  online dating site  OkCupid started displaying visitors using  Mozilla Firefox a message urging them to switch to a different web browser, pointing out that 8% of the matches made on OkCupid are between same-sex couples.  [22] On April 3, Mozilla announced that Eich had decided to step down as CEO and also leave the board of Mozilla Foundation.  [23]  [24] This, in turn, prompted criticism from some commentators who criticized the pressure that led Eich to resign.  [25]  [26]  [27] For example,  Conor Friedersdorf argued in   The Atlantic that &#34;the general practice of punishing people in business for bygone political donations is most likely to entrench powerful interests and weaken the ability of the powerless to challenge the status quo.&#34;  [28]\n In April 2014,  Chris Beard, the former chief marketing officer of Mozilla, was appointed interim CEO. Beard was named CEO in July 28 of the same year.  [29]\n On February 27, 2017, it acquired the web saving service  Pocket.  [30] In accordance with Mozilla&#39;s history of operating as &#34; open by default&#34; and based on comments by Mozilla chief business officer Denelle Dixon-Thayer that Pocket would &#34;become part of the Mozilla open source project&#34;, it was reported that Pocket would become open source. Prior to the acquisition, the startup behind Pocket operated it as a closed source, commercial service, and Mozilla published the source code that added a &#34;Save to Pocket&#34; feature to Firefox as open source. As of September 2019  Pocket remains closed source, while the extension remains open source.\n    The Mozilla Corporation&#39;s relationship with  Google has been noted in the popular press,  [31]  [32] especially with regard to their paid referral agreement. Mozilla&#39;s original deal with Google to have  Google Search as the default  web search engine in the browser expired in 2011, but a new deal was struck, where Google agreed to pay Mozilla just under a billion dollars over three years in exchange for keeping Google as its default search engine. The price was driven up due to aggressive bidding from Microsoft&#39;s  Bing and  Yahoo!&#39;s presence in the auction as well. Despite the deal, Mozilla Firefox maintains relationships with Bing, Yahoo!,  Yandex,  Baidu,  Amazon.com and  eBay.  [33]\n  The 2007 release of the anti- phishing protection in Firefox 2 in particular raised considerable controversy:  [42] Anti-phishing protection, enabled by default, is based on a list updated twice hourly from Google&#39;s servers.  [43] The user cannot change the data provider within the GUI,  [44] and is not informed who the default data provider is. The browser also sends Google&#39;s  cookie with each update request.  [45] Some [   who?]  internet privacy advocacy groups have expressed concerns surrounding Google&#39;s possible uses for this data, especially since Firefox&#39;s privacy policy states that Google may share (non-personally identifying) information gathered through safe browsing with third parties, including business partners.  [46]\n Following Google CEO  Eric Schmidt&#39;s comments in December 2009 regarding privacy during a  CNBC show,  [47] Asa Dotzler, Mozilla&#39;s director of community development suggested that users use the  Bing search engine instead of Google search.  [48] Google also promoted Firefox through YouTube until the release of  Google Chrome. In August 2009, Mozilla Security assisted Google by pointing out a security flaw in Google&#39;s Chrome browser.  [49]\n  In November 2014, Mozilla signed a five-year partnership with Yahoo!, making  Yahoo! Search the default search engine for Firefox browsers in the US.  [50] With the release of Firefox Quantum on November 17, 2017, Google became the default search engine again.  [51]\n  Microsoft&#39;s head of Australian operations, Steve Vamos, stated in late 2004 that he did not see Firefox as a threat and that there was not significant demand for the feature-set of Firefox among Microsoft&#39;s users.  [52] Microsoft Chairman  Bill Gates has used Firefox, but has commented that &#34;it&#39;s just another browser, and IE [Microsoft&#39;s Internet Explorer] is better&#34;.  [53]\n A Microsoft  SEC filing on June 30, 2005 acknowledged that &#34;competitors such as Mozilla offer software that competes with the Internet Explorer Web browsing capabilities of our Windows operating system products.&#34;  [54] The release of Internet Explorer 7 was fast tracked, and included functionality that was previously available in Firefox and other browsers, such as tabbed browsing and RSS feeds.  [55]\n Despite the cold reception from Microsoft&#39;s top management, the Internet Explorer development team maintains a relationship with Mozilla. They meet regularly to discuss web standards such as  extended validation certificates.  [56] In 2005, Mozilla agreed to allow Microsoft to use its  Web feed logo in the interest of common graphical representation of the Web feeds feature.  [57]\n In August 2006, Microsoft offered to help Mozilla integrate Firefox with the then-forthcoming  Windows Vista,  [58] an offer Mozilla accepted.  [59]\n In October 2006, as congratulations for a successful ship of Firefox 2, the Internet Explorer 7 development team sent a cake to Mozilla.  [60]  [61] As a nod to the  browser wars, some jokingly suggested that Mozilla send a cake back along with the recipe, in reference to the  open-source software movement.  [62] The IE development team sent another cake on June 17, 2008, upon the successful release of Firefox 3,  [63] again on March 22, 2011, for Firefox 4,  [64] and yet again for the Firefox 5 release.  [65]\n In November 2007, Jeff Jones (a &#34;security strategy director&#34; in Microsoft&#39;s Trustworthy Computing Group) criticized Firefox, claiming that Internet Explorer experienced fewer  vulnerabilities and fewer higher severity vulnerabilities than Firefox in typical enterprise scenarios.  [66]Mozilla developer  Mike Shaver discounted the study, citing Microsoft&#39;s bundling of security fixes and the study&#39;s focus on fixes, rather than vulnerabilities, as crucial flaws.  [67]\n In February 2009, Microsoft released Service Pack 1 for  version 3.5 of the .NET Framework. This update also installed Microsoft .NET Framework Assistant add-on (enabling  ClickOnce support).  [68] The update received media attention after users discovered that the add-on could not be uninstalled through the add-ons interface.  [69]  [70] Several hours after the website Annoyances.org posted an article regarding this update, Microsoft employee Brad Abrams posted in his blog Microsoft&#39;s explanation for why the add-on was installed, and also included detailed instructions on how to remove it.  [71] However, the only way to get rid of this extension was to modify manually the  Windows Registry, which could cause Windows systems to fail to boot up if not done correctly.  [69]\n On October 16, 2009, Mozilla blocked all versions of Microsoft .NET Framework Assistant from being used with Firefox and from the  Mozilla Add-ons service.  [72] Two days later, the add-on was removed from the blocklist after confirmation from Microsoft that it is not a vector for  vulnerabilities.  [73]  [74] Version 1.1 (released on June 10, 2009 to the Mozilla Add-ons service) and later of the Microsoft .NET Framework Assistant allows the user to disable and uninstall in the normal fashion.  [75]\n Firefox was one of the twelve browsers offered to  European Economic Area users of  Microsoft Windows from 2010 – see  BrowserChoice.eu.  [76]\n  The  Internal Revenue Service opened an audit of the  Mozilla Foundation&#39;s 2004-5 revenues in 2008, due to its search royalties, and in 2009, the investigation was expanded to the 2006 and 2007 tax years, though that part of the audit was closed. As Mozilla does not derive at least a third of its revenue from public donations, it does not automatically qualify as a public charity.  [77]\n In November 2012, the audit was closed after finding that the Mozilla Foundation owed a settlement of $1.5 million to the IRS.  [78]  [79]\n    The  board of directors is appointed by and responsible to  Mozilla Foundation&#39;s board. In March 2014, half the board members resigned.  [17] The remaining board members are:\n        Ellen Siminoff, former board member, also President and CEO of Shmoop University and Chairman of  Efficient Frontier\n     ^   Cimpanu, Catalin (August 11, 2020).  &#34;Mozilla is laying off 250 people and planning a &#39;new focus&#39; on making money&#34;.  The Verge .\n ^   staff (August 5, 2005),   Mozilla Foundation Reorganization, Mozilla Corporation, archived from  the original on April 21, 2008\n  ^  MozillaZine article:  &#34;Mozilla Foundation Announces Creation of Mozilla Corporation&#34; Retrieved via the  Internet Archive on 03-24-2009.\n ^   Keizer, Gregg (October 25, 2007).  &#34;Mozilla can live without Google&#39;s money, Baker says&#34;.   Computerworld. Archived from  the original on January 5, 2012 .\n ^   Houston, Thomas (December 5, 2011).  &#34;Future of Firefox&#39;s Google search partnership remains uncertain&#34;.   The Verge .\n  ^   Blizzard, Christopher (March 7, 2006).  &#34;apply pinky to corner of mouth&#34;.  0xDeadBeef.com. Archived from  the original on July 16, 2012 .\n ^   Kincaid, Jason (August 28, 2008).  &#34;Mozilla Extends Lucrative Deal With Google For 3 Years&#34;.   TechCrunch .\n ^   Murphy, David (December 24, 2011).  &#34;Google Paying Mozilla Almost $1B for Firefox Search: Why?&#34;.   PC Magazine .\n  ^   Baker, Colin (August 24, 2006).  &#34;Microsoft offers helping hand to Firefox&#34;.   CNET. Archived from  the original on July 17, 2012.\n ^   Silver, Nate (April 4, 2014).  &#34;How Rare Are Anti-Gay-Marriage Donations in Silicon Valley?&#34;. FiveThirtyEight .\n ^   Machkovech, Sam (March 25, 2014).  &#34;Gay Firefox developers boycott Mozilla to protest CEO hire [Updated]&#34;. ArsTechnica .\n ^     a     b   Barr, Alistair (March 28, 2014).  &#34;Three Mozilla Board Members Resign over Choice of New CEO&#34;.  Wall Street Journal .\n ^   Machkovech, Sam (March 29, 2014).  &#34;Three Mozilla board members—including former CEOs—step down&#34;.  ArsTechnica .\n    ^   Kelly, Heather (April 1, 2014).  &#34;OkCupid protests Firefox over CEO&#39;s anti-same-sex marriage donation&#34;. CNN .\n ^   David Robertson (April 6, 2014).  &#34;Firefox fails the tolerance test: We&#39;re free but it may cost us our jobs | Christian News on Christian Today&#34;.  Christiantoday.com .\n ^   Swisher, Kara (April 3, 2014).  &#34;Mozilla Co-Founder Brendan Eich Resigns as CEO, Leaves Foundation Board&#34;. Re/code .\n  ^  Jimmy Akin  How you can push back against Mozilla/Firefox&#39;s gay marriage thuggery,  National Catholic Register (April 6, 2014).\n ^   Mozilla CEO resignation raises free-speech issues, Associated Press (April 4, 2016): &#34;While many gay-rights activists and commentators welcomed Eich&#39;s departure, there were dissenters.  Andrew Sullivan, a prominent gay blogger, railed against the pressure that led to the resignation.&#34;\n ^   Conor Friedersdorf (April 4, 2014).  &#34;Mozilla&#39;s Gay-Marriage Litmus Test Violates Liberal Values&#34;.  The Atlantic.\n  ^    &#34;Mozilla acquires Pocket to gain a foothold on mobile devices&#34;.  The Verge. Vox Media .\n  ^   Gonsalves, Antone (March 7, 2006).  &#34;Mozilla Confirms Firefox Taking In Millions Of Google Dollars&#34;.  InformationWeek .\n ^     a     b   Swisher, Kara (December 22, 2011).  &#34;Google Will Pay Mozilla Almost $300M Per Year in Search Deal, Besting Microsoft and Yahoo&#34;. All Things D .\n ^     a     b   Hood &amp; Strong, LLP. (December 31, 2006).  &#34;Mozilla Foundation and subsidiary — Independent Auditors&#39; Report and Consolidated Financial Statements&#34;  (PDF).  Mozilla Foundation .   Page 11.\n   ^   Hood &amp; Strong, LLP. (December 31, 2007).  &#34;Mozilla Foundation and Subsidiary — Independent Auditors&#39; Report and Consolidated Financial Statements&#34;  (PDF).  Mozilla Foundation .\n  ^   Hood &amp; Strong, LLP. (December 31, 2008).  &#34;Mozilla Foundation and Subsidiaries — Independent Auditors&#39; Report and Consolidated Financial Statements&#34;  (PDF).  Mozilla Foundation .\n   ^   Turner, Brian (October 26, 2006).  &#34;Firefox 2 releases privacy storm&#34;. Platinax. Archived from  the original on January 21, 2007 .\n ^    &#34;Firefox Privacy Policy&#34;. mozilla.com. October 2006. Archived from  the original on January 9, 2009 .\n     ^    &#34;If you have nothing to hide...&#34;  Weblogs.mozillazine.org. December 10, 2009. Archived from  the original on December 13, 2009 .\n    ^   Kotadia, Munir (November 11, 2004).  &#34;Microsoft: Firefox does not threaten IE&#39;s market share&#34;. ZDNet .\n ^   Weber, Tim (May 9, 2005).  &#34;The assault on software giant Microsoft&#34;. BBC News .\n ^   Keizer, Gregg (September 1, 2005).  &#34;SEC Filing Shows Microsoft Fears Firefox, Lawsuits Over Bugs&#34;. Linux Online. Archived from  the original on May 2, 2010 .\n ^   Weber, Tim (May 10, 2005).  &#34;How Microsoft plans to beat its rivals&#34;. BBC News .\n ^    &#34;Better Website Identification and Extended Validation Certificates in IE7 and Other Browsers&#34;. IE Blog. November 21, 2005 .\n ^    &#34;Icons: It&#39;s still orange&#34;. RSS. December 14, 2005. Archived from  the original on December 16, 2005 .\n ^   Barker, Colin (August 22, 2006).  &#34;Microsoft reaches out to Firefox developers&#34;.  CNET News .\n ^   Barker, Colin (August 24, 2006).  &#34;Microsoft offers helping hand to Firefox&#34;.  CNET.  CNET News. Archived from  the original on June 15, 2013 .\n ^   Wenzel, Frédéric (October 24, 2006).  &#34;From Redmond With Love&#34;. fredericiana (weblog of a Mozilla Corporation intern) .\n   ^   Wenzel, Frédéric (June 17, 2008).  &#34;From Redmond With Love, Part 2&#34;. fredericiana (weblog of a Mozilla Corporation intern) .\n   ^    &#34;Internet Explorer and Firefox Vulnerability Analysis Report&#34;. November 30, 2007. Archived from  the original on April 30, 2009 .\n ^    &#34;counting still easy, critical thinking still surprisingly hard&#34;. November 30, 2007. Archived from  the original on February 26, 2008 .\n ^    &#34;Microsoft may be Firefox&#39;s worst vulnerability&#34;. July 7, 2009. Archived from  the original on May 24, 2011 .\n ^     a     b    &#34;Microsoft Update Quietly Installs Firefox Extension&#34;.  The Washington Post. May 29, 2009 .\n ^    &#34;Remove the Microsoft .NET Framework Assistant (ClickOnce) Firefox Extension&#34;. February 27, 2009. Archived from  the original on March 10, 2009.\n    ^   Shaver, Mike (October 19, 2009).  &#34;update on the .NET Framework Assistant and Windows Presentation Foundation plugin blocking from this weekend&#34; .\n ^   Krebs, Brian (June 3, 2009).  &#34;Microsoft&#39;s Fix for the Firefox Add-on Snafu&#34;.  The Washington Post .\n       ^    &#34;Katharina Borchert to Join Mozilla Leadership Team as Chief Innovation Officer&#34;. Mozilla. October 12, 2015 .\n  ^   Shankland, Stephen (December 10, 2015).  &#34;Startup picks up the torch for troubled Firefox OS&#34;.  CNET .", "posttime": "2020-08-12 11:13:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,搜索,search,mozilla", "title": "Mozilla在2018年从搜索交易中赚取了4.36亿美元", "title_en": "Mozilla made $436M from search deals in 2018", "transed": 1, "url": "https://en.wikipedia.org/wiki/Mozilla_Corporation#Google", "via": "", "real_tags": ["交易", "搜索", "search", "mozilla"]}, {"category": "", "categoryclass": "", "imagename": "a6dc9f90643d29a832ab39bc90d96060.png", "infoid": 1017680, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Simpplr今天为其人工智能驱动的内联网平台筹集了1000万美元，该平台旨在简化通信。首席执行官Dhiraj Sharma表示，随着Simpplr开发新产品并扩大其合作伙伴生态系统，这些资金将用于推动客户在疫情期间的采用。\n随着越来越多的人在家工作，企业重新将重点放在内部网上，以便远程联系和管理员工。(“内联网”是指公司的内部网络，用于信息共享和协作工具。)。但内部网传统上存在参与度问题。根据一项有先见之明的数字媒体调查，只有13%的员工报告每天使用他们的内部网。\nSimpplr声称其人工智能技术通过根据角色、位置、任期、部门、主题兴趣和以前的搜索定制用户体验，确保内联网内容是最新的、相关的和引人注目的。端到端加密平台与Box、Google Drive、Slake和Microsoft Office 365等数字工作空间集成，允许员工从原生Android和iOS应用程序或网络中选择访问公司门户。\nSimpplr有一个员工名录，上面有个人简介，包括传记、专业领域、活动、社会关系和其他专业花絮。通过受Facebook启发的订阅源，员工可以通过共享、点赞和回复内容或关注用户并参与投票、测验和调查来与其他员工互动。他们还可以关注和喜爱某些同事，以了解内部帖子、博客、照片、日历事件、视频、公告和庆祝活动。\n管理者可以在Simpplr中为团队、部门和社区创建社交工作区，他们还可以使用完全可搜索的预格式化页面添加知识库。特权用户可以查看分析，以了解哪些内容在浏览量和参与度方面表现最好，并根据角色、位置和域个性化员工体验，同时允许他们自定义和组织其主页。\nSimpplr的自动治理引擎可以自动监控、显示和取消发布陈旧内容，并且可以审计活动或跟踪高需求的内容。它还提醒作者在内容需要刷新时采取行动，并促进审查、验证和归档过程，从其他系统提取最新内容，同时提供某些内容未被阅读的原因分析。\n管理员可以使用Simpplr发布电子邮件摘要和时事通讯，或者将一篇文章标记为“强制阅读”。与其他地方不同的是，Simpplr提供了一个搜索工具，可以快速访问人员、文件、网站等；提供一个品牌编辑器，可以自定义颜色、字体和徽标；以及一个访问控制工具，可以管理角色和用户权限，以定义经理和员工可以采取的操作。\n尽管面临Workvivo和Happeo等公司的竞争，Simpplr声称，包括AAA、福克斯、Vertex制药、DocuSign、世界经济论坛和哥伦比亚大学在内的200个组织的25万人使用其平台。(该公司去年的年度经常性收入增长了130%。)。在Workday，Simpplr的推荐算法将支持请求减少了52%。而在欧洲之星(Eurostar)和未来之州(Future State)，他们表面上提高了员工敬业度，并将员工入职沟通分别减少了253%和25%。\n今天宣布的B系列融资由Norwest Venture Partners牵头，Salesforce Ventures公司参与，使Simpplr筹集的资金总额达到近3000万美元。这家成立六年的公司总部设在加利福尼亚州红杉城，在印度古尔冈设有办事处。", "note_en": "Simpplr today raised $10 million for its AI-powered intranet platform that is designed to streamline communications. CEO Dhiraj Sharma says the funds will be used to drive customer adoption during the pandemic as Simpplr develops new products and extends its partner ecosystem.\n With people increasingly work from home, businesses have put a renewed focus on intranets to engage with and manage employees remotely. (“Intranet” refers to a company’s internal network for information sharing and collaboration tools.) But intranets have traditionally had an engagement problem. According to a Prescient Digital Media  survey, only 13% of workers report using their intranets on a daily basis.\n  Simpplr claims its AI technologies ensure intranet content is up-to-date, relevant, and compelling by tailoring users’ experiences based on role, location, tenure, department, topical interests, and previous searches. The end-to-end encrypted platform integrates with digital workspaces like Box, Google Drive, Slack, and Microsoft Office 365, allowing employees to choose from native Android and iOS apps or the web to access their company’s portal.\n Simpplr features an employee directory with profiles incorporating biographies, areas of expertise, activities, social connections, and other professional tidbits. From a Facebook-inspired feed, employees can engage with other employees by sharing, liking, and responding to content or by following users and participating in polls, quizzes, and surveys. They can also follow and favorite certain coworkers to keep up with internal posts, blogs, photos, calendar events, videos, announcements, and celebrations.\n Managers can create social workspaces within Simpplr for teams, departments, and communities, and they can add knowledge bases using preformatted pages that remain fully searchable. Privileged users can view analytics to see which content is performing best in terms of views and engagement and personalize employees’ experiences based on role, location, and domain while allowing them to customize and organize their home page.\n  Simpplr’s auto-governance engine automatically monitors, surfaces, and unpublishes stale content and can audit activities or track content that’s in high demand. It also alerts authors to act when content needs a refresh and facilitates review, validation, and archival processes, pulling the latest content from other systems while offering analytics on why certain content isn’t being read.\n Admins can publish email digests and newsletters using Simpplr or mark an article a “mandatory read.”  Elsewhere, Simpplr offers a search tool that provides quick access to people, files, sites, and more; a brand editor that customizes colors, fonts, and logos; and an access control tool that manages roles and user permissions to define what actions managers and employees can take.\n Despite competition from the likes of  Workvivo and  Happeo, Simpplr claims that 250,000 people across 200 organizations — including AAA, Fox, Vertex Pharmaceuticals, DocuSign, the World Economic Forum, and Columbia University — use its platform. (The company’s annual recurring revenue grew 130% last year.) At Workday, Simpplr’s recommendation algorithms decreased support requests by 52%. And at Eurostar and Future State, they ostensibly boosted employee engagement and decreased employee onboarding communication by 253% and 25%, respectively.\n The series B round announced today was led by Norwest Venture Partners, with participation from Salesforce Ventures, and brings Simpplr’s total raised to nearly $30 million. The six-year-old company is headquartered in Redwood City, California, with an office in Gurgaon, India.", "posttime": "2020-08-12 10:49:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,软件,人工智能,led,员工", "title": "Simpplr是一家为员工名录开发人工智能支持的内部网软件的公司，该公司在Norwest Venture Partners的牵头下筹集了1000万美元的B系列资金", "title_en": "Simpplr, which develops AI-powered intranet software for employee directories, raised $10M Series B led by Norwest Venture Partners", "transed": 1, "url": "https://venturebeat.com/2020/08/11/simpplr-raises-10-million-for-its-ai-powered-intranet-platform/", "via": "", "real_tags": ["开发", "软件", "人工智能", "led", "员工"]}, {"category": "", "categoryclass": "", "imagename": "c253eaff99d11010de720578fd0052e4.jpg", "infoid": 1017679, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Alpha补丁3.10.0已经发布，现在可以使用了！修补程序现在应显示：版本3.10.0-LIVE.5789362。\n强烈建议玩家在打补丁后删除公共客户端的用户文件夹，特别是如果您开始遇到任何奇怪的字符图形问题或加载时崩溃。用户文件夹(在默认安装中)位于C：\\Program Files\\Roberts Space Industries\\StarCitizen\\live。", "note_en": "Alpha Patch 3.10.0 has been released and is now available! Patch should now show:  VERSION 3.10.0- LIVE.5789362.\n It is strongly recommended that players delete their  USER folder for the Public client after patching, particularly if you start encountering any odd character graphical issues or crash on loading. The  USER folder can be found (in default installations) at C:\\Program Files\\Roberts Space Industries\\StarCitizen\\LIVE.", "posttime": "2020-08-12 10:49:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "公民,citizen,现在", "title": "明星公民Alpha 3.10.0", "title_en": "Star Citizen Alpha 3.10.0", "transed": 1, "url": "https://robertsspaceindustries.com/comm-link//17711-Star-Citizen-Alpha-3100", "via": "", "real_tags": ["公民", "citizen", "现在"]}, {"category": "", "categoryclass": "", "imagename": "db7527954b14c292d9a6fc714a08793a.jpeg", "infoid": 1017678, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TikTok的未来仍然悬而未决，因为它同时被视为收购目标和安全风险，现在“华尔街日报”正在报道它一直在跟踪的用户信息的细节。他们对其Android应用程序的分析深入研究了2018年至2020年的几个版本，并表示“为一款移动应用程序收集的信息并不是异常多。”\n然而，离群点是，直到去年年底，TikTok还利用一个已知的安全漏洞绕过了Android的保护措施，这些保护措施阻止应用程序通过设备的MAC地址跟踪用户。该代码识别网络上的设备，通常不会更改，因此有人可以跟踪发生在同一设备上的不同帐户的安装，以将个人ID链接到特定的硬件。\n正如“华尔街日报”解释的那样，谷歌提供了一个匿名广告ID，用户可以很容易地重新设置，而不是没有同样选择退出功能的MAC地址。还有其他不涉及MAC地址的“ID桥接”技术，根据他们的调查，TikTok在去年11月18日的一次更新中删除了它的跟踪。该公司在一份声明中表示，“当前版本的TikTok不收集MAC地址。”\n以一种很难改变的方式将用户身份与硬件捆绑在一起--特别是在没有通知他们的情况下--是令人不安的，而且移动平台并不是唯一出现这种情况的地方。去年，研究人员详细介绍了Fire TV和Roku上的电视应用程序制造商是如何绕过广告商ID收集设备上的MAC地址的，不久之后，Roku更新了软件，取消了这一功能。", "note_en": "The future of TikTok is still up in the air as it’s treated as an acquisition target and security risk all at once, and now the   Wall Street Journal is reporting a detail on the kind of information it had been tracking about users. Their analysis of its Android app dug into several versions from 2018 through 2020, and said it “wasn’t collecting an unusual amount of information for a mobile app.”\n However the outlier is that until late last year, TikTok used a known security flaw to get around Android protections that stop apps from tracking users via the MAC address of their device. That code identifies a device on a network and is usually not changed, so someone could track installations across different accounts that occur on the same device to link a person’s ID to a particular piece of hardware.\n  As the  WSJ explains, Google presents an anonymized advertising ID that users can easily reset, as opposed to the MAC address that doesn’t have the same opt-out capabilities. There are other techniques used for this “ID bridging” that don’t involve the MAC address, and according to their investigation, TikTok removed its tracking with an update on November 18th of last year. In a statement, the company said “the current version of TikTok does not collect MAC addresses.”\n Tying user identities to hardware in a way that’s tough to change — particularly without notifying them of it — is troubling, and mobile platforms aren’t the only place where it’s popped up. Last year researchers  detailed how makers of TV apps on Fire TV and Roku were bypassing advertiser IDs to collect the MAC addresses on devices, and Roku  updated its software shortly after to take away that capability.", "posttime": "2020-08-12 10:26:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "华尔街,漏洞,android,tiktok,id", "title": "《华尔街日报》：TikTok利用漏洞追踪Android上的MAC地址", "title_en": "WSJ: TikTok used a loophole to track MAC addresses on Android", "transed": 1, "url": "https://www.engadget.com/tiktok-device-identifier-001349466.html", "via": "", "real_tags": ["华尔街", "漏洞", "android", "tiktok", "id"]}, {"category": "", "categoryclass": "", "imagename": "ec7e0529f2d3214c6ef375f774f75da6.png", "infoid": 1017677, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每周一次的评论有很多好评。即使是在进行表扬的人中，每周审查的次数也明显减少了。这是一个很难保持的习惯。我们可以花很多时间深入研究为什么会出现这种情况，以及如何以系统的方式修复它。…。或者我可以告诉你，我是如何使用PredictionBook在没有任何意志力的情况下获得每周评论的许多承诺好处的。\n简而言之，当我发现自己在如何花费时间或金钱上做出选择时，这取决于某种预期，我会在PredictionBook中将预期写成预测(可能性为%)，然后它会自动提示我在设定的日期评估预测。这有如此多的好处，我正在苦苦思索从哪里开始。如果非要用一句话来概括，那就是“更多地接触现实”。但是要在…的基础上进行扩展。\n做出预测迫使我评估我的预期结果，并进行期望值计算。这反过来又迫使我明确说明我看重的是什么，以及我如何知道我是否得到了它。这也让我在做某事的时候很清楚，因为我希望中间或模态的结果是好的，而不是当我做的是不太可能但超级好的结果的长尾时。这也给了我一个机会说“哈，电动汽车没有竞争力”，然后做一些其他的事情。\n评估提示符可以让我更多地了解我的计划是如何进行的。安迪·马图恰克(Andy Matuschak)谈到了知识工作的两难境地，在这种情况下，你不能为成功制定计划，但把事情拖到尽头往往无济于事。他的解决方案是给自己无计划的时间，然后回头看看是否按照他想要的方式进行，如果没有，下次就做一些不同的事情。预测为这种反思提供了一个非常自然、轻量级的提示。\n有时我会因为措辞不好而撤回一个问题--通常是当我的答案让我的决定听起来“不好”，但我觉得它实际上是“好的”，反之亦然。这是一种简单的方式，可以发现我对自己所看重的东西的看法是错误的，并寻找真正推动我做出决定的原因。\n然后是框架的好处。如果你明确写下“5%的成功机会”，你就更容易把某件事看作是一次实验，这会让失败感觉不那么糟糕。我没有失败，我执行了正确的算法，但这一次它没有产生结果。\n做一个明确的预测并把它写下来会关闭我脑海中的开环，释放RAM用于其他事情。\n注意到这个习惯什么时候不会触发是很有帮助的。例如，我今天(当我写这篇文章的时候)有一个计划好的会议，我只是“没有感觉到”去做预测。当我仔细看的时候，我意识到这是因为我有点呃参加了这次会议，但我觉得有义务去参加，并在回避这一事实。我不知道这会有什么结果，因为我选择在解决这个问题之前先写这篇博客文章，但我仍然相信这种预测习惯是注意到的，这是朝着更好的选择迈出的第一步。\n似乎这可能会让我的预测更准确，这有各种各样的应用。但老实说，这并不是强化这一点的原因。\n所以我们是一致的，以下是一些样本预测，以及建立在这些预测之上的决定：\n阅读巴甫洛夫和他的学校将导致学习或睡眠领域的行为改变(20%)。\n我应该买一本巴甫洛夫和他的学校的纸质书，然后花时间去读吗？\n招聘人员鲍勃将描述一份我完全有能力和兴趣做的工作(3%)。\n我会判断7/28的研讨会是否值得中断流程(40%)。\n这一点上没有立竿见影的决定，但根据我能预测项目合作伙伴的生产率有多好，这看起来肯定是有用的。\n加州会着火到我需要关上窗户的程度(95%)\n补充剂S可以改善我的睡眠，直到我不需要午睡(3%)。\n如果我从头开始，下面是我想要收到的指令(我确实从雷蒙那里收到了很多指令)。\n转到“设置”以更正您的时区，并将您的预测默认值设置为“创建者可见”而不是“公众可见”(除非您希望默认情况下它们是公开的)。\n创建几个可以在下周解决的预测(PredictionBook将在应该解决它们的时候给您发电子邮件)。\n在做预测时，试着专注于与你决策相关的事情；根据预测是真是假，你会做一些不同的事情。\n当您基于预测(隐式或显式)采取更多操作时，请注意您正在这样做，并在PredictionBook中注册预测。\n一两周后，检查一下你自己以及你对这个项目的感觉。对于校准：我发现创建最初的预测有点痛苦，但在项目中工作了一周后，自然是有回报的，而且我不需要意志力。\n这应该需要&lt；30分钟，总共应该需要&lt；45分钟才能很好地了解这是否对您有效。\n最近我一直在思考心流和分心的问题。我注意到的一件事是，要进入某些任务的心态需要相当长的时间(以小时计)。这些任务会让我感觉很棒，除非我过早地退出它们，这会让我很痛苦(而且会让我下一次进入这些任务需要更长的时间)。我希望能在另一篇文章中谈到这一点的很多含义；这里的相关性是，我认为每周审查可能是那些需要大量时间才能进入所需空间的任务之一，过早离开会让人痛苦。这使它们变得昂贵-比我学会为他们的准备时间为任务开账单之前估计的要贵得多。这也是一项要么全有要么全无的任务--做50%的每周回顾并不能让你获得每周全面回顾的近50%的好处。\n但是，预测，无论是做出的还是评估的，大多数时候都会很自然地融入我的生活，而且规模也很优雅。写下来可能只需要15秒，而当时间更长时，这是因为我发现了一些重要的东西，我需要弄清楚。这样做自然符合制定计划的过程，所以我不需要花时间进入正确的头脑空间。评估它们通常是微不足道的-如果不是这样，它就突显了我的模型的一个问题。\n“我将享受X”对我来说很少是正确的预测，因为享受对我来说是一件棘手的事情。我不喜欢承认我不喜欢一些东西，有时我会耗费很多精力去做一些有趣的东西，这可能是一个糟糕的决定，即使它奏效了。我的同义词是“X会让人充满活力”\n当你试图做出预测时，想想你下周要花些什么钱和时间。你觉得这些事情会怎么样呢？什么样的结果会让你改变决定？\n我这个实验的最初灵感，雷蒙，并没有得到我所描述的好处。他更专注于提高他的预测校准和准确性，到目前为止还没有做过那么多与决策相关的预测。我鼓励他尝试我的方法，希望他在花了几个星期之后会发表评论。\nPredictionBook轻巧得令人愉快，但它的预测已经有点杂乱无章了。如果我真的要巩固这个习惯，我可能需要找到或创建一个更好的系统。\n我做这件事大约有一个月了。人们保持每周评论的时间更长，然后才让它们半途而废。我现在写这篇文章是因为巩固习惯的行为会让我写得更差。我已经为12/1设置了写更新的提醒。\n感谢Raemon在这篇文章中把我推到了一个更好的版本，并在一开始就发起了这个实验。", "note_en": "There is a lot of praise for weekly reviews. There is noticeably less doing of weekly reviews, even among the people doing the praising. It’s a very hard habit to keep up. We could spend a lot of time diving into why that is and how to fix it in a systematic way… or I could tell you how I use  PredictionBook to get many of the promised benefits of weekly reviews without any willpower.\n In a nutshell, when I find myself making a choice about how to spend time or money that’s dependent on some expectation, I write out the expectation as a prediction (with % likelihood) in PredictionBook, which then automatically prompts me to evaluate the prediction at a date I set. This has so many benefits I’m struggling to figure out where to start. If I had to sum them up in a phrase, it would be “more contact with reality”. But to expand on that…\n  Making the prediction forces me to assess my anticipated outcomes and do an expected value calculation. This in turn forces me to be explicit about what I value, and how I will know if I got it. It also makes it explicit when I’m doing something because I expect the median or modal outcome to be good, vs. when I’m doing it for the long tail of unlikely but super good outcomes. It also gives me a chance to say “huh, that EV is not competitive” and do something else.\n Evaluating the prompt gives me more information on how my plans are working out.  Andy Matuschak talks about the dilemma of knowledge work, where you can’t make a plan for success but leaving things open ended often leads nowhere. His solution to this is to give himself unstructured time, but then look back and see if it worked out the way he wanted, and if it didn’t, do something different next time. Predictions provide a really natural, lightweight prompt for this reflection.\n Sometimes I withdraw a question for being poorly phrased- often when my answer makes the decision sound “bad” but I feel like it was actually “good”, or vice versa. This is an easy way to notice I was wrong about what I valued and look for what is actually driving my decisions.\n Then there are the framing benefits. It’s easier to view something as an experiment if you’re explicitly writing down “5% chance of success”, which makes failure feel less bad. I didn’t fail to make something work, I executed the correct algorithm and it failed to produce results this particular time.\n Making an explicit prediction and writing it down closes open loops in my head, freeing RAM for other things.\n It’s helpful to notice when the habit doesn’t trigger. For example, I have a meeting planned today (when I’m writing this) that I just “didn’t feel inspired” to make a prediction for. When I looked closer I realized that’s because I was kind of eh on this meeting but felt obliged to take it, and was avoiding that fact. I don’t know how this is going to work out because I’m choosing to work on this blog post before tackling that, but I still credit the prediction habit with noticing, which is the first step towards better choices.\n Also it seems like this might make my predictions more accurate, which has all kinds of applications. But to be honest that’s not what’s reinforcing this.\n   So we’re on the same page, here are some sample predictions, and the decisions that rested on them:\n Reading Pavlov and his School will lead to behavior change in the area of learning or sleep (20%)\n Should I buy a physical copy of Pavlov and his School and spend the time to read it?\n  Bob the recruiter will describe a job that I am at all capable of and interested in doing (3%)\n I will judge the seminar on 7/28 will be worth the interruption of flow (40%)\n No immediate decision riding on this one, but it sure seems useful to calibrate on how well I can predict a project partner’s productivity.\n  California will catch fire to the point I need to keep my windows closed (95%)\n  Supplement S will improve my sleep to the point I don’t need a nap (3%)\n   If I were starting from scratch, here are the instructions I would want to receive (many of which I did receive, from  Raemon)\n Go to Settings to correct your time zone and set your prediction default to “visible to creator” rather than “visible to public” (unless you’d like them to be public by default).\n Create a handful of predictions that will resolve over the next week (PredictionBook will e-mail you when they should be resolved).\n When making predictions, try to hone in on things that are decision-relevant to you; that you would do something different based on if the prediction was true or not.\n  As you take more actions based on predictions (implicit or explicit), notice that you are doing so, and register the predictions in PredictionBook\n  After a week or two, check in with yourself and how you feel about the project. For calibration: I found creating the initial predictions kind of a pain but by a week in the project was naturally rewarding and required no will power on my part.\n This should take &lt; 30 minutes, and it should take &lt; 45 minutes total to get a good sense of whether this is working for you.\n   I’ve been thinking a lot about flow and distraction recently. One thing I’ve noticed is that it takes an awful long time, measured in hours, to get into the mindset for certain tasks. Those tasks then feel amazing, unless I’m pulled out of them prematurely, which hurts (and makes it take even longer to get into the next time). There’s a lot of implications of this that I’ll hopefully get to in some other post; the relevance here is that I think weekly reviews might be one of those tasks that requires a lot of time to get into the required headspace and hurts to leave prematurely. This makes them costly- much more costly then I would have estimated before I learned to bill tasks for their prep time. It’s also something of an all or nothing task- doing 50% of your weekly review does not get you nearly 50% of the benefits of a full weekly review.\n But predictions, both making and evaluating, integrate into my life pretty naturally most of the time, and scale gracefully. Writing them up can take as little as 15 seconds, and when it takes longer, it’s because I’ve discovered something important I need to work out. Doing this fits in naturally with the process of making plans, so I don’t need to spend time getting into the right head space. Evaluating them is usually trivial- and if it’s not, it’s highlighting a problem with my models.\n   “I will enjoy X” is very rarely the right prediction for me to make, because enjoyment is a tricky thing for me. I don’t like admitting I didn’t enjoy something, and sometimes I will burn a lot of energy trying to make something enjoyable, which can be a bad decision even if it works. My equivalent is “X will be energizing”\n When trying to create predictions, think about what you’ll be spending money and time on in the next week. How do you think those things are going to go? What outcomes would make you change your decision?\n   My original inspiration for this experiment,  Raemon, hasn’t gotten the benefits I describe. He’s more focused on improving his prediction calibration and accuracy, and so far hasn’t done as much decision-relevant predictions. I’ve encouraged him to try it my way and hopefully he’ll comment after he’s spent a few weeks on that.\n PredictionBook is pleasantly lightweight but it’s already a little cluttered with predictions. If I really do solidify this habit I may need to find or create a better system.\n I’ve been doing this for about a month. People have kept up weekly reviews for longer before letting them fall by the wayside. I’m writing this up now because the act of solidifying a habit makes me worse at writing about it. I’ve set a reminder for 12/1 to write an update.\n  Thanks to  Raemon for pushing me to a better version this post and for initiating the experiment in the first place.", "posttime": "2020-08-12 10:00:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "评论,substitute,预测", "title": "预测作为评论的替代品", "title_en": "Predictions as a Substitute for Reviews", "transed": 1, "url": "https://acesounderglass.com/2020/08/06/predictions-as-a-substitute-for-reviews/", "via": "", "real_tags": ["评论", "预测"]}, {"category": "", "categoryclass": "", "imagename": "ab0d5d6487f00a7ce19b31078645f94d.png", "infoid": 1017676, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你愿意，我们很乐意听到你的消息：创业活力，与才华横溢和充满激情的团队合作，指数增长(连续5个季度50-100%+季度环比增长)扁平的结构，以及获得高级领导层持续指导的机会。", "note_en": "We’d love to hear from you if you like: Start-up energy working with a brilliant and passionate team Exponential growth (5 straight quarters of 50-100%+ quarter over quarter growth) Flat structure and access to senior leadership for continuous mentorsh...", "posttime": "2020-08-12 10:00:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "堆叠,full,增长", "title": "高级全堆叠工程师", "title_en": "Senior Full Stack Engineer", "transed": 1, "url": "https://apply.workable.com/jerry/j/FA1F4C0876/", "via": "", "real_tags": ["堆叠", "full", "增长"]}, {"category": "", "categoryclass": "", "imagename": "76e02fa6a63ffd16f71047467f8e0717.jpg", "infoid": 1017675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "气候危机：最新气候模型预测，到2035年，北极可能没有海冰。\n上一次北极没有海冰时，河马在现在的约克郡漫步。\n“独立报”在世界各地聘请记者，为您带来真正独立的新闻报道。为了支持我们，请考虑一笔额外的捐款。\n大约12.7万年前，在最后一次间冰期，北极的温度上升到比今天高出2-6摄氏度左右，最终融化了地球北极的所有海冰。\n当时，像橡树和榛子这样的硬木树木生长得很好，形成了我们现在所说的北极圈，河马在遥远的北方漫步到利兹。\n在此期间，北极的高温让科学家们困惑了几十年-特别是变暖导致海冰消失的过程。\n但是，一个国际研究小组利用英国气象局的哈德利中心气候模型进行的一项新研究，使科学家能够将上一次间冰期的北极海冰状况与现在进行比较。\n该研究小组表示，他们发现的证据表明，北极可能会在15年内看到海冰完全消失。\n这是因为该模型揭示了强烈的春日阳光导致了大量的“融化池塘”的形成。\n这些融化的池塘很重要，因为它们决定了多少阳光被冰原吸收，有多少阳光被反射回太空。\n冰的反照率(反射率)比水高，随着融化池塘的数量和大小的增加，从太阳吸收的能量会增加-使地球进一步变暖，导致进一步融化。\n研究小组表示，这些发现对于改善对未来海冰变化的预测具有重要意义。\n使用这个模型来观察上一个间冰期的北极海冰，研究小组得出结论，强烈的春季阳光的影响创造了许多融化的池塘，这在海冰融化中起到了至关重要的作用。研究小组说，使用相同模型对未来进行的模拟表明，北极可能在2035年之前实现无海冰。\n英国南极调查局的地球系统模型师、该研究的联合主要作者玛丽亚·维多利亚·瓜里诺博士说：“几十年来，北极的高温一直困扰着科学家。\n“揭开这个谜团在技术和科学上都具有挑战性。第一次，我们可以开始看到北极是如何在上一次间冰期变得没有海冰的。\n“气候建模方面取得的进展意味着，我们可以对地球过去的气候进行更准确的模拟，这反过来又让我们对未来的模型预测更有信心。”\n英国南极调查局的古气候模型师、联合主要作者路易丝·西姆博士说：“我们知道，随着我们的星球变暖，北极正在经历重大变化。通过了解地球上一个暖期发生了什么，我们就能更好地了解未来会发生什么。\n“到2035年海冰消失的前景真的应该把我们所有的心思集中在人类可行的情况下尽快实现低碳世界。”\n雷丁大学的David Schroeder博士是气候模型中融化池塘计划的共同负责人，他补充道：“这表明像融化池塘这样的海冰过程在北极是多么重要，以及为什么它们被纳入气候模型是至关重要的。”\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应。\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n您可能不同意我们的观点，也可能不同意其他用户的观点，但请恭敬地回应。\n咒骂、人身辱骂、种族主义、性别歧视、仇视同性恋和其他歧视性或煽动性的语言是不能接受的。\n想要讨论现实世界的问题，参与最引人入胜的讨论，听取记者的意见吗？立即开始您的独立高级订阅。\n已经注册了？登录。\n独立高级评论可以由我们会员计划的成员发布，独立高级。它允许我们参与度最高的读者辩论重大问题，分享他们自己的经验，讨论现实世界的解决方案，等等。我们的记者将尝试回应，在他们可能的情况下加入这些帖子，以创造一次真正的独立溢价会议。关于所有主题的最有洞察力的评论将每天发表在专门的文章中。您也可以选择在有人回复您的评论时通过电子邮件发送。\n对于那些没有订阅独立高级的人，现有的开放评论线程将继续存在。由于这个评论社区的巨大规模，我们不能对每个帖子给予同等程度的关注，但出于公开辩论的利益，我们保留了这一区域。请继续尊重所有评论者，并进行建设性的辩论。", "note_en": "Climate crisis: Arctic could be free of sea ice by 2035, latest climate model predicts\n  Last time Arctic was free of sea ice, hippos roamed across what is now Yorkshire\n  The Independent employs reporters around the world to bring you truly independent journalism. To support us, please consider a  contribution.\n  Around 127,000 years ago, during the last interglacial period, temperatures in the  Arctic rose to around 2 - 6C above what they are today, eventually melting all the sea ice at the planet’s  North Pole.\n  At the time, hardwood trees like oak and hazel grew well into what we now call the  Arctic Circle, and hippopotamus roamed as far north as  Leeds.\n    The high temperatures in the Arctic during this period have baffled scientists for decades - in particular the processes through which the warming led to the loss of the sea ice.\n            But a new study by an international team using the UK  Met Office’s Hadley Centre climate model has allowed scientists to compare Arctic sea ice conditions during the last interglacial period with the present day.\n    The team said the evidence they have uncovered indicates the Arctic could see the complete loss of sea ice within 15 years.\n    This is because the model reveals that intense spring sunshine resulted in the creation of large numbers of “melt ponds”.\n    These melt ponds are important because they dictate how much sunlight is absorbed by the ice sheets and how much is reflected back into space.\n  Ice has a higher albedo (reflectivity) than water, and as the number and size of melt ponds grow, consequently the amount of energy absorbed from the sun rises - warming the planet further and causing further melting.\n     The research team said the findings are significant in improving predictions of future sea ice change.\n  Using the model to look at Arctic sea ice during the last interglacial epoch, the team concluded the impact of intense springtime sunshine created many melt ponds, which played a crucial role in sea ice melt. A simulation of the future using the same model indicates the Arctic may become sea ice-free by 2035, the team said.\n         Dr Maria Vittoria Guarino, Earth system modeller at the  British Antarctic Survey, and joint lead author of the study said: “High temperatures in the Arctic have puzzled scientists for decades.\n     “Unravelling this mystery was technically and scientifically challenging. For the first time, we can begin to see how the Arctic became sea ice-free during the last interglacial.\n  “The advances made in climate modelling means that we can create a more accurate simulation of the Earth’s past climate, which, in turn gives us greater confidence in model predictions for the future.”\n    Dr Louise Sime, a palaeoclimate modeller at the British Antarctic Survey and joint lead author said: “We know the Arctic is undergoing significant changes as our planet warms. By understanding what happened during Earth’s last warm period we are in a better position to understand what will happen in the future.\n     “The prospect of loss of sea ice by 2035 should really be focussing all our minds on achieving a low-carbon world as soon as humanly feasible.”\n  Dr David Schroeder from University of Reading, who co-led the implementation of the melt pond scheme in the climate model, added: “This shows just how important sea ice processes like melt ponds are in the Arctic, and why it is crucial that they are incorporated into climate models.”\n              You may not agree with our views, or other users’, but please respond to them respectfully\n  Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n    You may not agree with our views, or other users’, but please respond to them respectfully\n  Swearing, personal abuse, racism, sexism, homophobia and other discriminatory or inciteful language is not acceptable\n                 Want to discuss real-world problems, be involved in the most engaging discussions and hear from the journalists? Start your Independent Premium subscription today.\n       Already registered?  Log in\n          Independent Premium Comments can be posted by members of our membership scheme, Independent Premium. It allows our most engaged readers to debate the big issues, share their own experiences, discuss real-world solutions, and more. Our journalists will try to respond by joining the threads when they can to create a true meeting of independent Premium. The most insightful comments on all subjects will be published daily in dedicated articles. You can also choose to be emailed when someone replies to your comment.\n  The existing Open Comments threads will continue to exist for those who do not subscribe to Independent Premium. Due to the sheer scale of this comment community, we are not able to give each post the same level of attention, but we have preserved this area in the interests of open debate. Please continue to respect all commenters and create constructive debates.", "posttime": "2020-08-12 09:59:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模型,free,北极", "title": "最新气候模型预测，到2035年，北极可能没有海冰", "title_en": "Arctic could be free of sea ice by 2035, latest climate model predicts", "transed": 1, "url": "https://www.independent.co.uk/environment/arctic-sea-ice-melt-2035-met-office-climate-change-a9665046.html", "via": "", "real_tags": ["模型", "free", "北极"]}, {"category": "", "categoryclass": "", "imagename": "a1b5d3699996eaa54374b1e57d618f82.jpeg", "infoid": 1017674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-Facebook Inc.(FB.O)周二表示，它在第二季度删除了700万条帖子，原因是分享了关于这种新型冠状病毒的虚假信息，包括宣传虚假预防措施和夸大治疗方法的内容。\n它发布了这些数据，作为其第六份社区标准执行报告的一部分，该报告于2018年推出，同时推出了更严格的礼仪规则，以回应对其平台上内容监管松懈的做法引发的反弹。\n这家全球最大的社交网络表示，将于本周邀请专家提出建议，从2021年开始对报告中使用的指标进行审计。它在7月份因仇恨言论做法而进行广告抵制期间承诺进行审计。\n第二季度，该公司在其旗舰应用程序上删除了约2250万条带有仇恨言论的帖子，比第一季度的960万条大幅增加。它将这一跃升归因于检测技术的改进。\n它还删除了870万个与“恐怖”组织有关的帖子，而前一时期为630万个。它从“有组织的仇恨”群体中删除的材料较少：400万条内容，而第一季度为470万条。\n该公司没有披露其平台上仇恨内容流行程度的变化，民权组织表示，这使得有关其删除的报道变得不那么有意义。\n脸书表示，从4月份开始，它更多地依赖自动化来审查内容，因为由于新冠肺炎大流行，其办公室的审查员减少了。\n高管们在电话会议上表示，这导致针对与自我伤害和儿童性剥削相关的内容的行动减少。\nFacebook负责诚信的副总裁盖伊·罗森(Guy Rosen)表示：“老实说，在家里，人们很难在周围的人面前进行协调，这是一种图形内容。”\nFacebook表示，它正在扩大仇恨言论政策，将其纳入“描绘黑脸的内容，或关于犹太人控制世界的刻板印象。”", "note_en": "(Reuters) - Facebook Inc (  FB.O) said on Tuesday it removed 7 million posts in the second quarter for sharing false information about the novel coronavirus, including content that promoted fake preventative measures and exaggerated cures.\n  It released the data as part of its sixth Community Standards Enforcement Report, which it introduced in 2018 along with more stringent decorum rules in response to a backlash over its lax approach to policing content on its platforms.\n The world’s biggest social network said it would invite proposals from experts this week to audit the metrics used in the report, beginning in 2021. It committed to the audit during a July ad boycott over hate speech practices.\n The company removed about 22.5 million posts with hate speech on its flagship app in the second quarter, a dramatic increase from 9.6 million in the first quarter. It attributed the jump to improvements in detection technology.\n It also deleted 8.7 million posts connected to “terrorist” organizations, compared with 6.3 million in the prior period. It took down less material from “organized hate” groups: 4 million pieces of content, compared to 4.7 million in the first quarter.\n The company does not disclose changes in the prevalence of hateful content on its platforms, which civil rights groups say makes reports on its removal less meaningful.\n Facebook said it relied more heavily on automation for reviewing content starting in April as it had fewer reviewers at its offices due to the COVID-19 pandemic.\n That resulted in less action against content related to self-harm and child sexual exploitation, executives said on a conference call.\n “It’s graphic content that honestly at home it’s very hard for people to moderate, with people around them,” said Guy Rosen, Facebook’s vice president for integrity.\n Facebook said it was expanding its hate speech policy to include “content depicting blackface, or stereotypes about Jewish people controlling the world.”", "posttime": "2020-08-12 09:36:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冠状病毒,coronavirus,facebook,病毒,信息", "title": "Facebook第二季度因虚假冠状病毒信息删除700万条帖子", "title_en": "Facebook Removed Seven Million Posts In Second Quarter For False Coronavirus Info", "transed": 1, "url": "https://www.reuters.com/article/us-facebook-content/facebook-removed-seven-million-posts-in-second-quarter-for-false-coronavirus-information-idUSKCN25727M", "via": "", "real_tags": ["冠状病毒", "facebook", "病毒", "信息"]}, {"category": "", "categoryclass": "", "imagename": "ee776918c4ed4939cad12f92727a8a2b.jpg", "infoid": 1017673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卡门·桑迪(Carmen Sandi)回忆起她一开始面临的怀疑。她是洛桑瑞士联邦理工学院(Swiss Federal Institute Of Technology)的行为神经学家，她一直有一种预感，即关键神经回路中发生的某种东西可以解释焦虑行为，除了脑细胞和它们之间的突触联系之外的东西。她在2013年开始的实验显示，参与焦虑相关行为的神经元出现了异常：它们的线粒体，也就是通常被描述为细胞发电厂的细胞器，工作不好-它们产生的能量水平低得令人奇怪。\n这些结果表明，线粒体可能与动物的压力相关症状有关。但这一观点与当时许多神经科学家对大脑的“以突触为中心”的观点背道而驰。她的同事们发现很难相信桑迪的证据，即在焦虑的个体中-至少在老鼠中-关键神经元内的线粒体可能是重要的。\n桑迪说：“每当我展示数据时，他们都会告诉我，‘这非常有趣，但你搞错了。’”\n然而，在过去十年左右的时间里，越来越多的科学家加入了她的行列，想知道线粒体是否不仅对我们的身体健康至关重要，而且对我们的精神健康尤其重要。特别是，他们探索了线粒体是否会影响我们对压力以及焦虑和抑郁等情况的反应。\n尽管到目前为止的大部分证据都是初步的，但它指出了实质性的联系。线粒体似乎是应激反应存在的中心，既是应激反应的中介者，也是应激反应所能造成的损害的靶子。对于参与这项工作的一些研究人员来说，压力反应甚至看起来像是全身线粒体与神经过程相互作用的一种协调行动。\n“我认为线粒体被低估了，”纽约哥伦比亚大学欧文医学中心的马丁·皮卡德(Martin Picard)说，他的实验室帮助开创了这项研究。“它们是细胞的首席执行细胞器。”现在，科学家们可以探索细胞器的重要性对未来治疗的影响。\n线粒体是复杂(真核)细胞内的微小结构，它们制造三磷酸腺苷(ATP)，这是大多数新陈代谢过程的化学燃料。加拿大维多利亚大学负责研究的副校长丽莎·卡林丘克(Lisa Kalynchuk)说：“ATP是一种能量，在某种程度上可以让活细胞在活着的时候做他们所做的事情。”这些细胞器是古老的入侵者-大约20亿年前整合到宿主细胞中的共生细菌的残留物，专门用于能源生产。线粒体仍然携带少量的DNA，尽管只有37个基因，它们的遗传物质比任何活着的细菌都要少。\n线粒体和疾病之间的关系在1975年开始变得明显起来，当时在耶鲁大学的道格拉斯·华莱士(Douglas Wallace)和他的同事们描述了线粒体DNA和遗传疾病之间的联系。在20世纪90年代，研究人员将线粒体DNA突变的影响与其他各种情况联系起来。每5000人中就有一人患有某种遗传性线粒体疾病，后果可能包括糖尿病、视力和听力问题、学习困难和其他障碍。然而，直到过去十年左右，科学家们才认真探索线粒体对精神健康和福祉的影响，特别是当涉及到压力、焦虑和抑郁时。\n桑迪的研究源于一种直觉，即线粒体可能会改变选定的大脑通路的操作。尽管大脑只占我们体重的2%，但我们的大脑消耗了我们身体吸收的20%的氧气。她假设，关键神经回路中细胞能量产生的不足可能解释了焦虑倾向人群总体上缺乏动力和自尊的原因。\n当桑迪让老鼠进行竞争以建立社会等级时，她发现焦虑程度较低的动物更有可能获得主导地位。进一步的研究表明，这些不那么焦虑的动物在伏隔核有更大的线粒体功能，伏隔核是大脑中对动机行为和努力产生至关重要的一部分。\n许多实验室的其他研究发现了压力和线粒体之间的进一步联系。2018年，皮卡德和今年早些时候去世的压力研究先驱布鲁斯·麦克尤恩(Bruce McEwen)发表了一项对23项关于线粒体和焦虑的研究进行的荟萃分析：其中19项证明了“心理压力对线粒体的重大不利影响”，甚至其他四项研究也指出，线粒体的大小或功能在应对压力时发生了变化。\n柏林自然历史博物馆的Anke Hoffmann和慕尼黑Max Planck精神病学研究所的Dietmar Spengler在2018年发表的一篇综述文章中总结了线粒体可以调节大脑对早期生活压力的结构和功能反应的证据，并作为“编程过程中的亚细胞底物”。线粒体功能和心理健康之间联系的实验证据仍然是试探性的，具有重要的局限性，但它足够强大，足以说服科学家进行更深入的研究。\n关于线粒体在压力下会发生什么的细节，还有一个仍在调查中的谜团。皮卡德最好的猜测是，当压力的触发器促使肾上腺细胞释放荷尔蒙皮质醇时，它就开始了。在这些细胞中，线粒体通过将胆固醇转化为皮质醇来合成荷尔蒙(在另一个细胞器--内质网的帮助下)。然后皮质醇在血液中遍及全身。专门的细胞受体将皮质醇携带到细胞的细胞核中，在那里它激活了大约1000个基因，帮助细胞为“战斗或逃跑”的反应做准备。但受体也会将一些传入的皮质醇输送到线粒体，在那里它与线粒体DNA相互作用，使能量产生更有效率。\n实际上，肾上腺中的线粒体产生压力荷尔蒙，然后它传播到全身的其他线粒体，带来综合的压力反应。皮卡德说：“它在器官之间创造了一种美丽的线粒体串扰，这还没有得到太多的讨论或开发。”\n当线粒体对这些信号做出调整时，它们可能会改变形状，从豆状变成细长的意大利面状结构，分裂或相互融合。破坏这些融合和分裂过程可能会导致细胞损伤甚至死亡。皮卡德将这种破坏比作社会孤立--当线粒体不能相互交谈时，它们的表现会更糟。\n要确定压力如何影响脑细胞中的线粒体，通常需要牺牲动物--这显然不可能发生在人类身上。尽管如此，为数不多的几项研究已经找到了在人身上探索这一问题的方法，并发现了其中存在联系的迹象。\n一项是2019年发表在精神神经内分泌学上的一项研究，由皮卡德实验室的博士后研究员卡罗琳·特朗普(Caroline Trumpff)领导。她和她的合作者匹兹堡大学的安娜·马斯兰(Anna Marsland)和布雷特·考夫曼(Brett Kaufman)研究了一小部分健康的中年人，发现急性心理压力与漂浮在细胞外的线粒体DNA短片段的快速激增之间存在关联。这类线粒体DNA片段通常在与损伤或疾病相关的破坏性事件中释放。这种影响在男性身上比在女性身上更明显。\n确定这种与压力相关的线粒体损伤是如何发生的，这是一项正在进行的工作。桑迪说，一个可能的解释是，线粒体在应对压力时的过度活动使它们产生了更多被称为活性氧的分子，这对细胞可能是有毒的。\n科学家们似乎也同意ATP参与其中。皮卡德说：“身体必须对外部世界敏感，然后在内部做出反应的能力，都是由能量驱动的。”研究表明，过度紧张的动物可能会表现出ATP产生的抑制，这可能会损害许多过程，特别是细胞分裂。这与海马体特别相关，海马体是一个对记忆编码、学习、情绪和处理压力至关重要的大脑结构。它是大脑的少数几个部分之一，即使在成年哺乳动物中，也有一些证据表明可能会一直产生新的神经元。\n尽管线粒体在人体中无处不在，但正如德国海因里希大学(Heinrich Heine University)的卡门·梅纳乔(Carmen Menacho)和亚历山德罗·普里吉奥内(Alessandro Prigione)在6月份发表在《国际生物化学与细胞生物学杂志》(International Journal Of BioChemical And Cell Biology)上的一篇评论中所讨论的那样，线粒体在组织内，甚至在单个细胞内的结构和功能多样性，提供了在特定的大脑路径上感受线粒体损伤的不同方式。研究人员发现，线粒体通常锚定在神经元内的关键位置，如突触附近，显然是为了帮助它们发挥功能。线粒体效应也可能通过大脑的非神经性胶质细胞发挥作用，例如用髓鞘包裹神经元的少突胶质细胞和支持神经元健康的星形胶质细胞。神经元有时会通过将受损的线粒体传递给星形胶质细胞来清除受损的线粒体，而星形胶质细胞则会将健康的线粒体发送给它们。如果压力扰乱了伏隔核等大脑区域的这些过程中的任何一个，它可能会对焦虑症产生影响。\nKalynchuk指出，精神病学领域需要新的治疗药物，针对线粒体的干预可能会帮助易受压力、抑郁和焦虑影响的人。她的实验室正在研究一种名为reelin的大型细胞外蛋白的潜在抗抑郁作用，这种蛋白为细胞迁移提供了一个支架，并促进了细胞间的交流。压力会降低实验动物体内的卷轴蛋白水平，而这种下降似乎源于线粒体的反应。在2020年1月公布的早期结果中，reelin在雄性老鼠身上进行了测试，看起来很有希望；Kalynchuk的研究小组预计很快就会报告雌性老鼠是否有不同的反应。\n桑迪的实验室在2017年显示，抗焦虑药物地西泮增加了大鼠的线粒体功能。她和她的同事去年1月还证明了一种线粒体增强型补充剂(乙酰-L-肉碱)保护了易受人类抑郁症相关行为影响的小鼠。她目前正在与制药公司合作，对将提高线粒体产量的疗法进行进一步的临床前研究，她正在收集与线粒体功能相关的代谢物的信息。\n皮卡德对开发针对线粒体的药物疗法的潜力持更加怀疑的态度。作为另一种选择，他建议基于线粒体功能的行为干预，如运动，可能是可行的方法。他说，锻炼可能是“你能为你的线粒体做的最好的事情。”\n压力是一种太复杂的现象，不能简化为单一的原因或简单的途径。杜克大学分子生理学研究所的Matthew Hirschey怀疑皮质醇是线粒体和压力之间关系的主要驱动力，与新陈代谢有关，但也强调这些机制并不是全部。赫希在一封电子邮件中写道：“线粒体显然对正常的神经功能非常重要-神经元是非常活跃的细胞，需要大量的能量产生才能产生动作电位，因此需要线粒体来完成这一任务。”“但外界心理压力是否以及如何影响神经元线粒体功能尚不清楚。”\n对他来说，更重要的是要看到线粒体在焦虑和压力生理学这个更大的谜团中的作用。但这是一件激励了越来越多的研究人员的事情，他们将在未来几年里对此深思熟虑。", "note_en": "Carmen Sandi  recalls the skepticism she faced at first. A behavioral neuroscientist at the Swiss Federal Institute of Technology in Lausanne, she had followed a hunch that something going on inside critical neural circuits could explain anxious behavior, something beyond brain cells and the synaptic connections between them. The experiments she began in 2013 showed that neurons involved in anxiety-related behaviors showed abnormalities: Their mitochondria, the organelles often described as cellular power plants, didn’t work well — they produced curiously low levels of energy.\n Those results suggested that mitochondria might be involved in stress-related symptoms in the animals. But that idea ran contrary to the “synapto-centric” vision of the brain held by many neuroscientists at the time. Her colleagues found it hard to believe Sandi’s evidence that in anxious individuals — at least in rats — mitochondria inside key neurons might be important.\n “Whenever I presented the data, they told me, ‘It’s very interesting, but you got it wrong,’” Sandi said.\n Yet a growing number of scientists have joined her during the past decade or so in wondering whether mitochondria might be fundamental not just to our general physical well-being but specifically to our mental health. In particular, they have explored whether mitochondria affect how we respond to stress and conditions like anxiety and depression.\n  Although much of the evidence so far is preliminary, it points to a substantial connection. Mitochondria seem to be central to the very existence of a stress response, serving both as mediators of it and targets for the damage it can do. To some of the researchers involved in this work, the stress response even looks like a kind of coordinated action by mitochondria throughout the body that interacts with the neurological processing.\n “I think mitochondria are underrated,”  said   Martin Picard  of Columbia University’s Irving Medical Center in New York, whose laboratory has helped to pioneer this research. “They’re the chief executive organelle of the cell.” Now scientists can explore what the implications of the organelles’ importance might be for future therapies.\n  Mitochondria are the tiny structures inside complex (eukaryotic) cells that manufacture adenosine triphosphate, or ATP, the chemical fuel for most metabolic processes. “ATP is the energy that sort of allows for living cells to do what they do when they’re alive,” said   Lisa Kalynchuk , vice president for research at the University of Victoria in Canada. The organelles are ancient invaders — the remnants of symbiotic bacteria that integrated themselves into host cells about 2 billion years ago and specialized for energy production. Mitochondria still carry a small amount of DNA of their own, although with just 37 genes, they have less genetic material than any living bacteria.\n  A relationship between mitochondria and disease started to become apparent in 1975, when  Douglas Wallace and his colleagues, then at Yale University,  described an association between mitochondrial DNA and a genetic disorder. During the 1990s, researchers linked the effects of mutations in mitochondrial DNA to various other conditions. One in 5,000 people has an inherited mitochondrial disease of some kind, with consequences that can include diabetes, vision and hearing problems, learning difficulties and other disorders. Only in the last decade or so, however, have scientists seriously explored the influence of mitochondria on mental health and well-being, especially when it comes to stress, anxiety and depression.\n Sandi’s work sprang from an intuition that mitochondria might alter the operation of select brain pathways. Our brains eat up 20% of the oxygen our bodies take in, even though the brain accounts for only 2% of our weight. A deficit of cellular energy production in critical neural circuits, she hypothesized, might explain an overall lack of motivation and self-esteem seen in anxiety-prone people.\n When Sandi put rats in competition to establish a social hierarchy, she saw that the animals with less anxiety were more likely to acquire dominant rank. Further study showed that these less anxious animals had  greater mitochondrial function in the nucleus accumbens, a part of the brain vital to motivated behavior and the production of effort.\n  Other research in many laboratories unearthed further ties between stress and mitochondria. In 2018, Picard and the stress research pioneer  Bruce McEwen, who died earlier this year, published  a meta-analysis of 23 studies on mitochondria and anxiety: 19 demonstrated “significant adverse effects of psychological stress on mitochondria” and even the other four noted changes in mitochondrial size or function in response to stress.\n A  2018 review article by  Anke Hoffmann of the Museum of Natural History in Berlin and  Dietmar Spengler of the Max Planck Institute of Psychiatry in Munich summarized evidence that mitochondria could mediate the brain’s structural and functional responses to early life stress and serve as “a subcellular substrate in the programming process.” The experimental evidence for connections between mitochondrial function and mental health is still tentative and has important limitations, but it is strong enough to convince scientists to look deeper.\n  One mystery still under investigation surrounds the details of what happens to mitochondria under stress. Picard’s best guess is that it starts when a trigger for stress makes cells in the adrenal glands release the hormone cortisol. Within those cells, mitochondria synthesize the hormone (with the assistance of another organelle, the endoplasmic reticulum) by converting cholesterol into cortisol. Cortisol then travels throughout the body in the blood. Specialized receptors carry the cortisol into the nuclei of cells, where it activates about 1,000 genes to help cells prepare for the “fight or flight” response. But the receptors also ferry some of the incoming cortisol into the mitochondria, where it interacts with the mitochondrial DNA and makes energy production more efficient.\n  In effect, mitochondria in adrenal glands produce the stress hormone, and it travels to other mitochondria throughout the body, bringing about an integrated stress response. “It creates a beautiful mitochondrial cross-talk between organs that hasn’t been discussed or developed very much,” Picard said.\n As the mitochondria adjust in response to those signals, they may change shape, from a bean form to an elongated, spaghettilike structure, split apart or fuse with one another. Disrupting these fusion and fission processes can lead to cell damage and even death. Picard likens this disruption to social isolation — when mitochondria can’t talk to each other, they do worse.\n Determining how stress affects the mitochondria in brain cells often involves sacrificing animals — a practice that is obviously out of the question with humans. Nevertheless, the few studies that have found ways to explore the problem in people have found indications of a link.\n One was  a 2019 study in  Psychoneuroendocrinology, led by  Caroline Trumpff, a postdoctoral researcher in Picard’s lab. She and her collaborators  Anna Marsland and  Brett Kaufman at the University of Pittsburgh looked at a small sample of healthy middle-aged adults and found an association between acute psychological stress and a rapid surge in short segments of mitochondrial DNA floating outside cells. Such pieces of mitochondrial DNA are normally released during damaging events related to injury or disease. The effect was more pronounced in men than in women.\n Identifying how that kind of stress-related mitochondrial damage occurs is a work in progress. One likely explanation is that overactivity by mitochondria in response to stress makes them generate more of the molecules called reactive oxygen species, which can be toxic for cells, Sandi said.\n  Scientists also seem to agree that ATP is involved. “The ability the body has to be sensitive to the outside world, and then to mount a response internally, is all energy-driven,” Picard said. Studies suggest that overly stressed animals may show dampened ATP production, which can impair many processes but especially cell division. This is especially relevant to the hippocampus, a brain structure vital for memory-encoding, learning, emotion — and processing stress. It is one of the few parts of the brain where, even in adult mammals, there is some evidence that new neurons may be created all the time.\n And although mitochondria are ubiquitous in the body, their structural and functional diversity within tissues and even within individual cells offers ways in which mitochondrial damage could be felt differently in specific brain pathways, as  Carmen Menacho and  Alessandro Prigione of Heinrich Heine University in Germany  discussed in June in a review in the  International Journal of Biochemistry and Cell Biology. Researchers have found that mitochondria are often anchored at key positions within neurons, such as near the synapses, apparently to help their function. Mitochondrial effects might also be exerted through the brain’s non-neuronal glial cells, such as the oligodendrocytes that sheath neurons in myelin and the astrocytes that support neurons’ health. Neurons sometimes eliminate damaged mitochondria by passing them to astrocytes, and astrocytes send them healthy mitochondria. If stress disrupts any of these processes in brain areas such as the nucleus accumbens, it could have an impact on anxiety disorders.\n  The field of psychiatry needs new therapeutic drugs, Kalynchuk notes, and interventions aimed at the mitochondria may have promise for helping people vulnerable to stress, depression and anxiety. Her lab is looking at the potential antidepressant effects of a large extracellular protein called reelin, which provides a scaffold for migrating cells and facilitates intercellular communication. Stress reduces the levels of reelin in laboratory animals, and this drop seems to stem from the mitochondrial response.  Early results published in January 2020, in which reelin was tested on male rats, looked promising; Kalynchuk’s group expects to report soon on whether females respond differently.\n Sandi’s lab showed in 2017 that the anti-anxiety drug  diazepam increases mitochondrial function in rats. She and her colleagues also  demonstrated last January that a mitochondria-boosting supplement (acetyl-L-carnitine) protected mice vulnerable to behaviors associated with depression in humans. She is currently collaborating with drug companies on further preclinical investigations into therapies that would boost mitochondrial output, and she is gathering information about metabolites related to mitochondrial function.\n Picard is more skeptical about the potential of developing drug therapies aimed at mitochondria. As an alternative, he suggests that behavioral interventions based on mitochondrial function, such as exercise, could be the way to go. Exercise, he says, may be “the best thing you can do for your mitochondria.”\n  Stress is too complicated a phenomenon to be reduced to a single cause or a simple pathway.  Matthew Hirschey of Duke University’s Molecular Physiology Institute suspects that cortisol is a major driver of the relationship between mitochondria and stress and that there are links to metabolism, but also emphasizes that these mechanisms are not the whole story. “Mitochondria are clearly important for proper neurological function — neurons are tremendously active cells that require a lot of energy production to make action potentials, and therefore need mitochondria to do this,” Hirschey wrote in an email. “But if, and how, external psychological stressors influence neuronal mitochondrial function isn’t really known.”\n To him, it is more important to see the role of mitochondria as a piece in the much larger puzzle of anxiety and stress physiology. But it is a piece that has energized a growing number of researchers, who will puzzle over it intently for years to come.", "posttime": "2020-08-12 09:34:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "线粒体,hold", "title": "线粒体可能是焦虑和心理健康的关键", "title_en": "Mitochondria May Hold Keys to Anxiety and Mental Health", "transed": 1, "url": "https://www.quantamagazine.org/mitochondria-may-hold-keys-to-anxiety-and-mental-health-20200810/", "via": "", "real_tags": ["线粒体", "hold"]}, {"category": "", "categoryclass": "", "imagename": "b5ad0abd4eda54d17fd00454431114bc.jpeg", "infoid": 1017671, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "针对四名特斯拉前员工的剩余一项违约索赔没有包括在这份文件中，要求“提出异议”或解雇，因为他们与里维安没有直接关系。代表这些前雇员的律师仍有可能提出类似的论点。\n特斯拉没有回复记者的置评请求。如果公司做出回应，TechCrunch将更新这篇文章。\n今年7月，特斯拉对里维安公司和四名前雇主提起诉讼，指控他们挖走人才和窃取商业机密。具体地说，特斯拉声称里维安指示了一名最近离职的特斯拉员工需要哪些类型的机密信息。\nRivian在8月10日提交给圣克拉拉的加州高等法院(California Superior Court)的文件中表示，该公司“有严格的政策和程序，以确保在员工入职时不会从其他公司获得机密信息。”里维安表示，特斯拉起诉书中所谓的商业机密都没有在里维安或其任何系统上找到。\n里维安的主要论点是，特斯拉未能陈述足以构成诉因的事实。这种法律术语实质上意味着，特斯拉提出的索赔不足以证明有权起诉。里维安辩称，特斯拉在诉讼的基础上使用的是猜测，而不是事实。\n里维安在文件中说：“尤其是，法院不应该相信特斯拉诉讼中散布的那种真实的猜测。”\n里维安不仅驳斥了特斯拉的抱怨，还用自己的不当行为进行了更有力的反击。\nRivian的代理律师辩称，特斯拉提起诉讼并不是为了捍卫或保护合法的知识产权，而是被用来“不正当和恶意地试图减缓”该公司的发展势头，并试图损害其品牌。文件还声称，特斯拉利用这起诉讼吓唬自己的员工离开公司。\n不幸的是，诽谤里维安并不是特斯拉唯一不可告人的动机。相反，它精心设计的申诉是为了实现第二个不正当的目的-即向自己的员工发出威胁信息：不敢离开特斯拉。特斯拉明白，加州有利于员工流动的强有力的公共政策限制了竞业禁止合同的使用，因此特斯拉寻求惩罚四名离开特斯拉并加入里维安团队的前员工。\n回应还质疑了诉讼的时机，诉讼是在Rivian宣布在T.Rowe Price Associates Inc.为首的基金和账户牵头的一轮融资中筹集25亿美元后不久提起的。", "note_en": "One remaining claim of breach of contract against four former Tesla employees was not included in this filing asking for “demurrer” or a dismissal because they do not related directly to Rivian. It’s still possible that lawyers representing those former employees will make a similar argument.\n Tesla did not respond to a request for comment. TechCrunch will update the article if the company responds.\n  In July, Tesla  filed a lawsuit against Rivian and four former employers, on claims of poaching talent and stealing trade secrets. Specifically, Tesla claimed that Rivian instructed a recently departing Tesla employee about the types of confidential information it needed.\n Rivian said in its August 10 filing with the California Superior Court in Santa Clara, that it has “rigorous policies and procedures to make sure it does not obtain confidential information from other companies when on-boarding employees.” Rivian said none of the alleged trade secrets in Tesla’s complaint have been located at Rivian or on any of its systems.\n Rivian’s main argument is that Tesla failed to state facts sufficient to constitute cause of action. That legalese essentially means that the claims Tesla made aren’t sufficient to justify a right to sue. Rivian argues that Tesla is using speculation, not facts for the basis of its lawsuit.\n “In particular, the Court should not credit as true speculation of the kind scattered throughout Tesla’s complaint,” Rivian said in the filing.\n Rivian didn’t just dispute Tesla’s complaint, it pushed back harder with its own claims of impropriety.\n Lawyers representing Rivian argued that Tesla didn’t file the case to defend or protect legitimate intellectual property rights, but instead used in “improper and malicious attempt to slow” the company’s momentum and attempt to damage its brand. The filing also claimed that Tesla used the lawsuit to scare its own employees from leaving the company.\n Unfortunately, maligning Rivian was not Tesla’s only ulterior motive. Rather, it crafted its complaint to achieve second improper purpose — namely to send threatening message to its own employees: don’t dare leave Tesla. Understanding that the strong public policy favoring employee mobility in California restricts the use of non-compete contracts, Tesla’s complaint seeks to punish four of its former employees for leaving Tesla and joining the Rivian team.\n The response also questioned the timing of the lawsuit, which was filed soon after Rivian announced it had  raised $2.5 billion in a round led by funds and accounts advised by T. Rowe Price Associates Inc.", "posttime": "2020-08-12 09:11:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,诋毁,fires,里维安", "title": "\n里维安在诉讼中回击特斯拉，指控汽车制造商试图“诋毁其声誉”", "title_en": "\n\t\t\t\tRivian fires back at Tesla in lawsuit, accuses automaker of attempting to ‘malign its reputation’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/11/rivian-fires-back-at-tesla-in-lawsuit/", "via": "", "real_tags": ["特斯拉", "诋毁", "fires", "里维安"]}]