[{"category": "", "categoryclass": "", "imagename": "86a8b0e4009c0f719bf6edcea1436b5b.png", "infoid": 1006102, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "11摘要：平面接口通常使用弱指示符。在比较不同类型的可点击性线索的眼睛追踪实验中，具有弱能指的UI比具有强能指的UI需要更多的用户努力。\n平面设计在数字接口中的流行与符号的稀缺不谋而合。许多现代用户界面已经去掉了用户用来理解什么是可点击的可感知提示。\n使用眼动设备跟踪和可视化用户在界面上的眼动，我们调查了强可点击性指示符(传统的线索，如下划线、蓝色文本或光滑的3D按钮)和弱或缺失的指示符(例如，样式为静态文本或幻影按钮的链接文本)如何影响用户处理和理解网页的方式。\n影响用户与界面交互的因素很多。为了直接研究在交互元素的视觉处理中传统的、弱的和不存在的能指之间的差异，我们需要去除任何混杂的变量。\n我们从直播网站上选取了9个网页，并对它们进行了修改，为每个页面创建了两个几乎相同的版本，具有相同的布局、内容和视觉风格。这两个版本的不同之处仅在于交互元素(按钮、链接、选项卡、滑块)使用强、弱或不存在的符号。\n在某些情况下，这意味着使用已经平坦的页面，并添加阴影、渐变和文本处理来增加深度和增强可点击性指示符的强度。在其他情况下，我们取了一个已经有了强大的传统能指的页面，然后我们创建了一个超平面版本。我们小心翼翼地确保我们提供的修改是合理和现实的。\n我们之所以选择这些界面作为学习材料，是因为在很大程度上，它们都是不错的设计，代表了更好的网站。我们开始隔离有能指的界面和没有能指的界面之间的区别，而不是评估这些网站的设计。\n对于每个刺激对，我们编写了一个简短的任务，将用户的注意力引导到页面上的特定交互元素上。例如，对于酒店网站，任务是：“您将看到来自酒店网站的页面。预订这个旅馆房间。当您找到要点击的位置时，请告诉我们。“\n所有18个页面设计和所有9个任务的措辞都可以在侧边栏中找到。\n我们使用眼球跟踪设备和一台台式计算机进行了定量实验。我们招募了71名普通网民参加实验。向每位参与者展示了9个网站的一个版本，并为该页面分配了相应的任务。一旦参与者看到他们想要点击以完成任务的目标UI元素，他们就会说“我找到了”并停止。\n我们跟踪了参与者在执行这些任务时的眼球运动。我们测量了每页上的注视次数，以及任务时间。(当凝视停留在页面上的兴趣点时，就会发生注视。)。\n这两个衡量标准都反映了用户的努力：完成任务花费的注视和时间越多，处理工作量就越高，任务就越困难。此外，我们通过聚合参与者在页面上看得最多的区域来创建热图可视化。\n这项研究是作为受试者之间的设计进行的-每个参与者只看到每个页面的一个版本。我们随机分配到每个页面的任一版本，以及参与者查看页面的顺序。(有关设计定量研究的更多信息，请参阅我们关于测量用户体验的课程。)。\n所有参与者在开始真正的任务之前，都在同一刺激下开始一项练习任务，以确保他们理解了说明。特别是像这样的定量研究，使用练习任务来确保参与者理解说明是一个好主意。(最好在开始真正的研究之前进行试点测试，以解决任何方法问题。)。\n这个实验不是可用性研究。我们的目标是看看用户如何处理单个页面设计，以及他们找到目标元素的难易程度，而不是确定设计中的可用性问题。(实时网站的可用性研究很少涉及网站上的单个页面；大多数情况下，人们被要求在整个网站中导航以实现目标。)。\n当我们比较每个页面的平均注视次数和平均浏览时间时，我们发现：\n弱能指版本的平均时间显著高于强能指版本。参与者平均多花22%的时间(即，较慢的任务表现)看那些有弱能指的页面。\n弱能指版本的平均注视次数显著高于强能指版本。平均而言，人们对弱能指页面的注视增加了25%。\n(通过以地点为随机因素的配对t检验，这两个发现都是显著的，p&lt；0.05。)。\n这意味着，当查看符号较弱的设计时，用户会花更多时间查看页面，并且他们必须查看页面上更多的元素。因为这个实验使用了有针对性的可查找性任务，所以花更多的时间和精力浏览页面是不好的。这些发现并不意味着用户对页面的“参与度”更高。相反，他们认为参与者很难找到他们想要的元素，或者当他们第一次看到它时没有信心。\n对于弱能指设计来说，任务时间增加22%可能看起来很可怕。但请记住，我们的指标反映了查找点击位置所花费的时间。我们测量的任务非常具体，只代表了实际Web任务的一小部分。在经常使用网页的情况下，人们会在其他任务上花费更多时间，比如阅读页面上的信息。当你加上这些其他方面时，一项完整的任务(比如买一双新鞋)的减速通常会低于我们测量的22%。\n另一方面，弱能指设计中增加的点击不确定性有时可能会导致人们偶尔点击错误的东西-这是我们在这项研究中没有衡量的。从不正确的点击中恢复很容易耗费更多时间，特别是因为用户并不总是能立即意识到自己的错误。除了实际浪费的时间之外，不确定性增加和授权减少带来的情感影响是平庸的体验设计如何伤害品牌认知的一个例子。\n热图是一种量化可视化，它聚合了眼睛注视刺激(UI)的次数和持续时间。它们可以从许多参与者的凝视数据中产生，只要他们都看着同样的刺激，完成同样的任务。\n基于所有参与者数据的热图传达了有关与任务相关的页面区域的重要信息(假设参与者数量足够高)。在我们的颜色编码中，红色区域是那些受到最多和最长注视的区域。橙色、黄色和紫色区域受到的关注较少，没有覆盖颜色的区域没有被任何测试参与者看到。\n当比较每个页面对的两个版本(强能指与弱能指)时，我们发现页面分为两组：两个版本的用户凝视模式几乎相同的页面，以及用户凝视模式不同的页面(如热图所示)。\n在我们测试的页面中，9对中有6对具有不同的用户凝视模式。除了意符强度之外，我们消除了给定对中页面设计中的所有其他变体，因此我们可以得出结论，意符改变了用户在其任务中处理页面的方式。\n当比较这6对页面时，出现了一个主要的不同之处。这些页面的弱能指版本导致了整个页面上更广泛的注视分布：人们不得不更多地环顾四周。这一结果强化了我们的发现，即弱能指页面比强能指页面需要更多的注视和更多的时间。\n我们从来没有看到相反的模式：没有一个强能指版本比它的弱能指版本有更广泛的分布。\n这一差异表明，参与者必须在弱能指版本中考虑更多潜在的互动因素。因为目标元素(链接、标签、按钮、滑块)缺乏强有力的传统符号，所以它们没有同样的力量来吸引参与者的注意力或信心。在许多情况下，参与者专注于目标元素，然后转移到页面上的其他元素-想必是因为他们没有立即认识到它是任务的解决方案。\n在这六个网站中，有一个页面对在热图上表现出了特别显著的差异。最初用于创建刺激的界面是来自精品珠宝网站的之字形布局。页面布局有三个部分，每个部分都有一个标题、简短的文本段落、产品图像和文本链接。\n为了创建页面的强版本，文本链接被赋予了传统的链接处理：蓝色和带下划线的文本。为了创建弱版本，我们从超平面设计的常见策略中获得了灵感，并使文本链接与静态文本相同。文本链接的位置(段落下方)在两个刺激中保持相同。\n参与者被要求在现场找到珍珠首饰。预期的目标是页面底部的“珍珠商店”链接。\n弱能指版本在初级导航上显示红色区域，在3年：珍珠航向上也显示红色区域。相比之下，目标链接在强能指变体中受到的注视最多。当我们检查单个参与者的数据时，我们发现许多看到弱能指版本的用户(24个参与者中的9个)停留在副标题处，而从来没有看过文本链接。他们认为他们可以点击副标题到达珍珠首饰，而没有继续向下看到链接。\n在强意符版本中，86%(29人中有25人)的参与者首先专注于标题，然后转移到珍珠商店目标链接。在弱版本中，只有50%(24个中的12个)遵循了这一模式。(这一差异在统计上意义重大；P&lt；0.005。)。设置为静态文本样式的链接不会将用户的眼睛从副标题向下吸引，而传统风格的强链接会吸引用户的目光。\n9个位点中有3个在强能指与弱能指的凝视模式上没有差异。为什么这三个页面对几乎相同，而其他六个页面对显示出显著的差异？\n这些答案为我们提供了一些关于平面UI何时可以在不破坏交互的情况下工作的有趣信息。\n其中一个刺激对的目标元素是内联文本链接：浅紫色的无下划线链接与传统的蓝色下划线链接。在这对实验中，弱刺激热图在包含目标链接的段落上只显示了非常宽泛的注视分布。\n这表明，与普通文本相比，内联链接的低对比度呈现方式可能是一个稍弱的能指，但并不是显而易见的。然而，在“灿烂地球”的例子中，缺乏链接的对比色产生了很大的影响，如上所示。我们可以推测，这是一个对比度连续体：链接和周围文本之间的颜色对比度越强，用户认出它们的机会就越高。如果我们在Ally Bank的弱版本中使用浅灰色突出显示颜色，我们可能会看到凝视模式中更戏剧性的差异。只要内联文本链接以对比色显示，即使没有下划线，用户也会认识到它们的用途。\n另外两个在弱版本和强版本之间没有明显热图差异的刺激对与其他刺激相比有一些共同的特征：\n信息密度低。页面包含相对较少的内容和充足的空白，这意味着即使不是很突出的内容也会脱颖而出，因为它们不会与许多其他页面元素竞争。\n传统布局。元素(按钮、链接、导航)位于用户通常期望的标准位置。\n突出的、高对比度的目标。与周围的物品相比，目标元素的对比度很高，并且有足够的空间将它们与这些元素分开，使它们更引人注目。\n我们希望我们的用户拥有简单、无缝和愉快的体验。用户需要能够查看页面，并立即理解他们的选项。他们需要能够看一眼他们正在寻找的东西，并立即知道，“是的，就是这样。”\n问题不在于用户永远看不到符号较弱的UI元素。这是因为，即使他们确实看到了薄弱的元素，他们也没有信心这是他们想要的，所以他们继续在页面周围寻找。\n点击性符号较弱的设计浪费了用户的时间：人们需要查看更多的UI元素，在页面上花费更多的时间，如热图、平均注视次数和平均任务时间所反映的那样。这些发现都表明，有了弱能指，用户获得的赋权和果断的感觉就会减少。他们正在经历点击的不确定性。\n这些发现还证实，扁平或略扁平的设计在某些条件下比其他条件下工作得更好。正如我们在这个实验中看到的，当网站具有低信息密度、传统或一致的布局，并将重要的互动元素放在与周围元素脱颖而出的地方时，弱能指的潜在负面影响就会减弱。\n理想情况下，为了避免点击不确定性，这三个标准都应该满足，而不是一两个。如果站点包含大量潜在的压倒性内容，或者具有全新的页面布局或模式，则在采用超平面设计时应谨慎行事。这些特征呼应了我们的建议，即采用平面UI而不破坏站点上的交互。\n请注意，这些特征也是良好的、基本的UX设计最佳实践：视觉简单性、外部一致性、清晰的视觉层次和对比度。一般来说，如果你有一个关心用户研究的有经验的UX团队，你会比其他不关心用户研究的产品团队在平面设计上做得更好。如果你的设计已经很强大，平面设计带来的任何潜在弱点都会得到缓解。如果您正在进行常规的用户研究，您在实现平面UI时所犯的任何错误都将被识别并纠正。\n为了从这个实验中获得可比较的、可解释的结果，我们必须让用户在单个页面上完成非常集中、简短的任务。在现实生活中，用户不会这样做任务。他们到达你的网站后，并不知道你是谁，也不知道你在做什么。他们导航到页面，但不确定是否会在那里找到他们要找的东西。他们探索产品和选项。\n记住，可发现性和可发现性是有区别的。强指示符在用户关心查找特定内容的情况下很有帮助。在您关心用户发现他们不知道存在的功能的情况下，它们绝对是至关重要的。\n注：这篇文章的发表引发了关于平面设计的大量辩论。我已经写下了对我听到的关于这项研究的一些问题和关注的答复。", "note_en": "11    Summary: Flat interfaces often use weak signifiers. In an eyetracking experiment comparing different kinds of clickability clues, UIs with weak signifiers required more user effort than strong ones.\n    The popularity of  flat design in digital interfaces has coincided with a scarcity of  signifiers. Many modern UIs have ripped out the perceptible cues that users rely on to understand what is clickable.\n Using eyetracking equipment to track and visualize users’ eye movements across interfaces, we investigated how  strong clickability signifiers (traditional clues such as underlined, blue text or a glossy 3D button) and  weak or absent signifiers (for example, linked text styled as static text or a ghost button) impact the ways users process and understand web pages.\n   There are many factors that influence a user’s interaction with an interface. To directly investigate the differences between traditional, weak, and absent signifiers in the visual treatments of interactive elements, we needed to remove any confounding variables.\n We took 9 web pages from live websites and modified them to create two nearly identical versions of each page, with the same layout, content and visual style. The two versions differed only in the use of strong, weak, or absent signifiers for interactive elements (buttons, links, tabs, sliders).\n In some cases, that meant taking an already flat page and adding shadows, gradients, and text treatments to add depth and increase the strength of the clickability signifiers. In other cases, we took a page that already had strong, traditional signifiers, and we created an ultraflat version. We were careful that the modifications we provided were reasonable and realistic.\n  We chose these interfaces as study materials because, for the most part, they’re decent designs that are representative of the better sites on the web. We set out to isolate the differences between signifier-rich and signifier-poor interfaces, not to evaluate the design of these sites.\n   For each of the stimuli pairs, we wrote a short task to direct the user’s attention to a specific interactive element on the page. For example, for the hotel site, the task was: “You will see a page from a hotel website. Reserve this hotel room. Please tell us when you have found where you would click.”\n All 18 page designs and the wording of all 9 tasks are available in a sidebar.\n  We conducted a quantitative experiment using  eyetracking equipment and a desktop computer. We recruited 71 general web-users to participate in the experiment. Each participant was presented with one version of the 9 sites and given the corresponding task for that page. As soon as participants saw the target UI element that they wanted to click to complete the task, they said “I found it” and stopped.\n We tracked the eye movements of the participants as they were performing these tasks. We measured the number of fixations on each page, as well as the task time. (A fixation happens when the gaze lingers on a spot of interest on the page).\n Both of these measures reflect user effort: the more fixations and time spent doing the task, the higher the processing effort, and the more difficult the task. In addition, we created heatmap visualizations by aggregating the areas that participants looked at the most on the pages.\n The study was conducted as a between-subjects design — each participant saw only one version of each page. We randomized assignment to either version of each page, as well as the order in which participants saw the pages. (See our course on  Measuring User Experience for more on designing quantitative studies.)\n All participants began with a practice task on the same stimulus to make sure they understood the instructions before they began the real tasks. Especially with quantitative studies like this one, it’s a good idea to use a practice task to ensure that participants understand the instructions. (It’s also best to conduct  pilot testing before even starting the real study to iron out any methodology issues.)\n This experiment was not a usability study. Our goal was to see how users processed individual page designs, and how easily they could find the target elements, not to identify usability problems in the designs. (Usability studies of live sites rarely involve a single page on a website; most often, people are asked to navigate through an entire site to accomplish a goal.)\n   When we compared average number of fixations and average amount of time people spent looking at each page, we found that:\n The  average amount of time was significantly higher on the weak-signifier versions than the strong-signifier versions. On average participants spent  22% more time (i.e., slower task performance) looking at the pages with weak signifiers.\n  The  average number of fixations was significantly higher on the weak-signifier versions than the strong-signifier versions. On average, people had  25% more fixations on the pages with weak signifiers.\n (Both findings were significant by a paired t-test with sites as the random factor, p &lt; 0.05.)\n This means that, when looking at a design with weak signifiers,  users spent more time looking at the page, and they had to look at more elements on the page. Since this experiment used targeted findability tasks,  more time and effort spent looking around the page are not good. These findings don’t mean that users were more “engaged” with the pages. Instead, they suggest that participants struggled to locate the element they wanted, or weren’t confident when they first saw it.\n 22% longer task time for the weak-signifier designs may seem terrible. But remember that our metrics reflect time spent while looking for where to click. The tasks we measured were very specific and represent just a small component of real web tasks. In regular web use, people spend more time on other task aspects such as reading the information on a page. When you add in these other aspects, the slowdown for a full task (such as shopping for a new pair of shoes) would often be less than the 22% we measured.\n On the other hand, the increased click uncertainty in weak-signifier designs is likely to sometimes cause people to click the wrong thing occasionally — something we didn’t measure in this study. Recovering from incorrect clicks can easily consume more time, especially since users don’t always realize their mistake immediately. Beyond the actual time wasted, the emotional impact of increased uncertainty and decreased empowerment is an example of how mediocre  experience design can hurt brand perception.\n  Heatmaps are quantitative visualizations that aggregate the number and duration of eye fixations on a stimulus (the UI). They can be created from the gaze data of many participants, as long as they all look at the same stimulus with the same task.\n Heatmaps based on all participants’ data convey important information about the page areas that are relevant for the task (provided that the number of participants is high enough). In our color coding, the red areas were those which received the most and longest fixations. Orange, yellow, and purple areas received less attention, and areas with no overlay color were not viewed by any of the test participants.\n When comparing the two versions of each page pair (strong signifiers vs. weak signifiers) we found that the pages fell into two groups: those with nearly identical user gaze patterns for the two versions, and those with different user gaze patterns (as indicated by the heatmaps).\n  Of the pages we tested,  6 out of the 9 pairs had different user gaze patterns. With the exception of the signifier strength, we eliminated all other variations in page design within a given pair, so we can conclude that  the signifiers changed how users processed the page in their task.\n One major overarching difference emerged when comparing the 6 pairs of page. The weak-signifier versions of the pages resulted in a broader distribution of fixations across the page:  people had to look around more. This result reinforced our findings that weak-signifier pages required more fixations and more time than strong-signifier ones.\n We never saw the reverse pattern: no strong-signifier version had a more outspread distribution than its weak-signifier counterpart.\n  This difference suggests that participants had to  consider more potentially interactive elements in the weak-signifier versions. Because the target elements (links, tabs, buttons, sliders) lacked strong, traditional signifiers, they  didn’t have the same power to draw the participants’ attention or confidence. In many cases, participants fixated on the target element, but then moved on to other elements on the page — presumably because they hadn’t immediately recognized it as the solution to the task.\n    Of the six sites, one page pair displayed a particularly dramatic difference in the heatmaps. The original interface used to create the stimuli was a zig-zag layout from a fine-jewelry website. The page layout featured three sections, each with a heading, short paragraph of text, product image, and text link.\n To create the strong version of the page, the text links were given a traditional link treatment: blue color and underlined text. To create the weak version, we took inspiration from a common tactic of ultraflat designs, and made the text links identical to the static text. The placement of the text links (below the paragraphs) was left the same in both stimuli.\n  Participants were asked to find the pearl jewelry on the site. The intended target was a  Shop Pearl link at the bottom of the page.\n   The weak-signifier version showed red areas on the primary navigation, as well as on the  3 Year: Pearl heading. In contrast, the target link received most fixations in the strong-signifier variant. When we inspected the individual-participant data, we discovered that many users (9 of the 24 participants) who saw the weak signifier version stopped at the subheading, and never looked at the text link. They believed they could click on that subheading to reach the pearl jewelry and didn’t continue down to see the link.\n In the strong signifier version, 86% (25 out of 29) participants first fixated on the heading, and then moved to the  Shop Pearl target link. In the weak version, only 50% (12 out of 24) followed this pattern. (This difference is statistically significant; p &lt; 0.005.) The links styled like static text didn’t draw users’ eyes down from the subheading, while the strong, traditionally styled links did.\n  3 of the 9 sites resulted in no differences in the gaze patterns between strong and weak signifiers. Why are these three page pairs nearly identical, while the other six pairs showed substantial differences?\n The answers give us some interesting information about  when flat UIs can work without damaging interaction.\n One of the stimulus pairs had in-line text links as the target element: light purple, nonunderlined links vs. traditional blue, underlined links. In this pair, the weak-stimulus heatmap only showed a very slightly wider distribution of fixations on the paragraph containing the target link.\n  This suggests that the low-contrast presentation of in-line links, compared with regular text, may be a slightly weaker signifier, but not perceptibly so. In the case of Brilliant Earth, the lack of contrasting color for links, however, had a big impact, as shown above. We can speculate that there is a contrast continuum: the stronger the color contrast between links and surrounding text, the higher the chance that users will recognize them.  If we had used a light grey highlight color in the weak version of Ally Bank, we might expect to the see a more dramatic difference in the gaze patterns.  As long as in-line text links are   presented in a contrasting color , users will recognize their purpose, even without an underline.\n The other two stimulus pairs with no discernible heatmap differences between the weak and strong versions had some traits in common, when compared to the rest of the stimuli:\n Low information density. The pages contained relatively little content and ample white space, meaning that even things that didn’t stand out much still did stand out, because they weren’t competing with many other page elements.\n  Traditional layout. Elements (buttons, links, navigation) were located in standard positions, where users typically expect them to be.\n  Salient, high-contrast targets. The target elements were high-contrast compared to the items around them, and had plenty of space to separate them from those elements, making them more noticeable.\n  We want our users to have experiences that are easy, seamless, and enjoyable. Users need to be able to look at a page, and understand their options immediately. They need to be able to glance at what they’re looking for and know instantly, “Yep, that’s it.”\n The problem is not that users never see a weakly signified UI element. It’s that even when they do see the weak element, they don’t feel confident that it is what they want, so they keep looking around the page.\n Designs with  weak clickability signifiers waste users’ time: people need to look at more UI elements and spend more time on the page, as captured by heatmaps, average counts of fixations, and average task time. These findings all suggest that with weak signifiers, users are  getting less of that feeling of empowerment and decisiveness. They’re experiencing click uncertainty.\n  These findings also confirm that flat or flat-ish designs can work better in certain conditions than others. As we saw in this experiment, the potential negative consequences of weak signifiers are diminished when the site has a low information density, traditional or consistent layout, and places important interactive elements where they stand out from surrounding elements.\n Ideally, to avoid click uncertainty, all three of those criteria should be met, not just one or two. A site with a substantial amount of potentially overwhelming content, or radically new page layouts or patterns, should proceed with caution when adopting an ultraflat design. These characteristics echo  our recommendations for adopting a flat UI without damaging the interaction on your site.\n Notice that those characteristics are also just good,  basic UX design best practice: visual simplicity, external consistency, clear visual hierarchy, and contrast. In general, if you have an experienced UX team that cares about user research, you’ll do better with a flat design than other product teams that don’t. If your designs are already strong, any potential weakness introduced by flat design will be mitigated. If you’re conducting regular user research, any mistakes you make in implementing a flat UI will be identified and corrected.\n  To get comparable, interpretable results from this experiment, we had to ask users to do very focused, short tasks on a single page. In real life, users don’t do tasks that way. They arrive to your site, and don’t know who you are or what you do. They navigate to pages, and don’t know for sure that they’ll find what they’re looking for there. They explore offerings and options.\n Remember that there’s a difference between  findability and discoverability. Strong signifiers are helpful in situations where users care about finding something specific. They’re absolutely crucial in situations where  you care that users discover a feature that they didn’t know existed.\n  Note: This article&#39;s publication generated a significant amount of debate about flat design. I&#39;ve written  responses to some of the questions and concerns I heard about the study.", "posttime": "2020-06-11 12:51:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ui", "title": "扁平UI元素吸引的注意力较少，并造成不确定性(2017)", "title_en": "Flat UI Elements Attract Less Attention and Cause Uncertainty (2017)", "transed": 1, "url": "https://www.nngroup.com/articles/flat-ui-less-attention-cause-uncertainty/", "via": "", "real_tags": ["ui"]}, {"category": "", "categoryclass": "", "imagename": "7b94cf9ed3d34d2309909a5d98113c32.jpg", "infoid": 1006101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新冠肺炎危机期间，该非营利性组织取消了对100多万本图书的借阅限制。现在它正被出版商起诉。\n互联网档案馆删除了其国家紧急图书馆的图书等待名单，这样多名读者就可以同时下载同一份电子书。\n四大图书出版商已经以起诉互联网档案馆作为回应。如果成功，他们可能会让这家非营利性组织破产。\n出版商不仅对国家紧急图书馆有异议，而且对整个互联网档案馆也有异议。\n互联网档案馆是一项巨大的努力，它是一家在线图书馆，旨在提供对所有知识的普遍获取。它已经将数百万的网页、电影、照片、录音、软件程序和书籍数字化，否则这些东西可能会消失在历史上。\n但它既不是不可审查的，也不是超出版权法的范围。现在，开放互联网的支持者想知道如何在它消失之前拯救它。\n今年3月，随着新冠肺炎疫情的蔓延导致公共图书馆关闭，互联网档案馆创建了国家紧急图书馆，并暂停了图书等候名单-到6月底，这种名单会让你的喷气式飞机冷却12周，才能将“权力的游戏”下载到你的Kindle上。在这样做的过程中，它基本上允许一本书的单一副本被无限次下载。\n图书出版商并不高兴。上周一，阿歇特(Hachette)、哈珀柯林斯(HarperCollins)、企鹅兰登书屋(Penguin Random House)和威利(Wiley)-四家出版巨头-起诉了该组织。诉讼认为IA的行为严重超出了合法的图书馆服务，违反了“版权法”，并且在工业规模上构成了故意的数字盗版。\n也许是作为回应，今天互联网档案馆宣布将提前两周关闭国家紧急图书馆。创始人布鲁斯特·卡尔(Brewster Kahle)写道，他希望原告取消他们代价高昂的攻击。\n如果法院发现互联网档案馆故意侵犯版权，图书馆可能会承担高达15万美元的损害赔偿-140万册图书中的每本。(你自己算吧。)。\n对于档案馆来说，这可能就是游戏结束了。即使是无意的侵犯版权行为，法定损害赔偿也至少为200美元，这将导致数亿美元的损害赔偿。\n许多人都在为最坏的情况做准备，完全关闭，但这样做并不容易。多年来，许多开放互联网积极分子一直在讨论如何备份档案，使其更具弹性。诱惑力是采用分布式系统，如区块链，这种系统可以抵抗审查，也不能合法关闭。然而，数据量使得任何备份存档的尝试都变得困难。\nINTERNETARCHIVE.BAK项目的目的是探索将互联网档案馆的数据归档的可行性，这些数据以Peta字节为单位。自2016年以来，它一直处于不活跃状态。其他项目也同样停滞不前。\n一些权力下放的坚定拥护者和公开信息的倡导者正在敦促人们向该组织一边捐款或团结起来。这样做将有助于它支付法律费用，或许还能争取时间将档案的部分资源转移到其他地方。\n根据出版商的说法，侵犯版权正在损害该行业，该行业通过向图书馆和书店销售图书来赚钱。根据丹佛公共图书馆(Denver Public Library)的数据，图书馆支付的电子书访问费用是零售价的三到五倍。如果一个人的电子书许可证收费15美元，图书馆通常要为一个许可证支付50美元，甚至84美元。\n这种价格模式是有意义的，因为电子书面向多个图书馆用户。如果图书馆员对流行图书的需求很大，他们可能不得不购买多个许可证-否则读者可能会面临非常长的等待。\n卡尔敦促和解。他在该组织的博客上写道：“出版商起诉图书馆借书，在这种情况下是受保护的数字化版本，虽然学校和图书馆都关闭了，但这不符合任何人的利益。”我们希望这个问题能尽快解决。\n但鉴于诉讼的语气，出版商对互联网档案馆的整体使命提出异议，暗示他们在等待某种借口来搞垮整个组织：[互联网档案馆]在没有任何许可证或向作者或出版商支付任何费用的情况下，扫描纸质图书，将这些非法扫描的图书上传到其服务器，并通过面向公众的网站分发整本书的逐字电子版。\n由于出版商似乎在血腥袭击，所有的数字档案馆都处于危险之中。那些依赖它来保存我们世界的数字历史的人可能已经没有时间了，尽管最后一章还没有写完。", "note_en": "The non-profit removed lending restrictions on over a million books during the COVID-19 crisis. Now it&#39;s being sued by publishers.\n   The Internet Archive removed waitlists for books in its &#34;National Emergency Library&#34; so that multiple readers could simultaneously download the same digital copy.\n Four major book publishers have responded by suing the Internet Archive. If successful, they could bankrupt the nonprofit.\n The publishers take issue not only with the National Emergency Library, but with the Internet Archive as a whole.\n The  Internet Archive  is a massive endeavor—it&#39;s an  online library aiming to &#34;provide Universal Access to All Knowledge.&#34; It has digitized millions of web pages, movies, photos, recordings, software programs, and books that might otherwise be lost to history.\n But it&#39;s neither un-censorable nor outside the bounds of copyright law. And now open internet supporters are wondering how to save it before it disappears.\n In March, as the COVID-19 pandemic led to the shutdown of public libraries, the Internet Archive created the   National Emergency Library  and temporarily suspended book waitlists—the kind that make you cool your jets for 12 weeks to download &#34;A Game of Thrones&#34; onto your Kindle—through the end of June. In doing so, it essentially allowed for a single copy of a book to be downloaded an infinite number of times.\n   Book publishers weren&#39;t happy. Last Monday, Hachette, HarperCollins, Penguin Random House, and Wiley—four publishing behemoths—sued the organization. The lawsuit argues that &#34;IA’s actions grossly exceed legitimate library services, do violence to the Copyright Act, and constitute willful digital piracy on an industrial scale.&#34;\n Perhaps in response, today the Internet Archive announced it was closing the National Emergency Library two weeks early. Founder Brewster Kahle wrote that he hoped the plaintiffs would &#34;  call off their costly assault .&#34;\n If the court finds that Internet Archive   &#34;willfully&#34; infringed copyright , the library could be on the hook for up to $150,000 in damages—per   each  of the 1.4 million titles. (You do the math.)\n  That would likely be game over for the archive. Even an unintentional act of copyright infringement carries statutory damages of at least $200, which would put damages in the hundreds of millions.\n Many are preparing for the worst, a complete shutdown, but doing so is no easy feat. Many open-Internet activists have been discussing how to   back up the archive  and make it more resilient for years. The temptation would be to employ a distributed system, such as a blockchain, that would be censorship-resistant and couldn’t be legally shut down. Yet the amount of data makes any attempt at backing up the archive difficult.\n The INTERNETARCHIVE.BAK project aimed to scope out the viability of archiving the Internet Archive’s data, which numbers in the   peta bytes. It has been inactive since 2016. Other projects have similarly stalled.\n Some decentralization stalwarts and open-information advocates are urging people to donate or rally to the organization’s side. Doing so would help it pay for legal costs and perhaps buy time to move some of the archive’s resources elsewhere.\n      According to the publishers, copyright violations are damaging to the industry, which makes money off of selling to libraries and bookstores alike. According to the   Denver Public Library,  &#34;Libraries pay three-to-five times more than retail price for eBook access. If an individual is charged $15 for an eBook license, a library often pays $50 or even $84 for one license.&#34;\n That price model makes sense since eBooks make the rounds to multiple library users. And if librarians face large demand for popular titles, they may have to buy multiple licenses—otherwise readers might face a very long wait.\n Kahle has urged reconciliation. &#34;Publishers suing libraries for lending books, in this case protected digitized versions, and while schools and libraries are closed, is not in anyone’s interest,” he   wrote on the organization&#39;s blog . &#34;We hope this can be resolved quickly.&#34;\n  But given the tone of the lawsuit, the publishers take issue with Internet Archive&#39;s mission as a whole, suggesting that they were waiting for some pretext to take the entire organization down: &#34;Without any license or any payment to authors or publishers, [Internet Archive] scans print books, uploads these illegally scanned books to its servers, and distributes verbatim digital copies of the books   in whole  via public-facing websites.&#34;\n With the publishers seemingly out for blood, all of the digital archives are at risk. Those who rely on it to keep a digital history of our world may be running out of time, though the last chapter has yet to be written.", "posttime": "2020-06-11 12:51:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "威胁,rally,图书馆", "title": "诉讼威胁网站，活动人士集会拯救互联网档案", "title_en": "Activists rally to save Internet Archive as lawsuit threatens site", "transed": 1, "url": "https://decrypt.co/31906/activists-rally-save-internet-archive-lawsuit-threatens", "via": "", "real_tags": ["威胁", "rally", "图书馆"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006099, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Blosc是一款针对二进制数据进行了优化的高性能压缩器。它的设计目的是通过memcpy()OS调用将数据传输到处理器缓存，速度比传统的、非压缩的、直接内存提取方法更快。Blosc是第一个压缩器(我知道这一点)，它不仅可以减少磁盘或内存中大型数据集的大小，还可以加速内存边界计算(这在向量-向量操作中很典型)。\n它使用阻塞技术(如本文所述)尽可能减少内存总线上的活动。简而言之，分块技术的工作原理是将数据集分成小到足以容纳在现代处理器的一级高速缓存中的块，并在那里执行压缩/解压缩。它还利用了当今多核处理器中的SIMD(SSE2)和多线程功能，从而最大限度地加快了压缩/解压缩过程。\n您可以在合成基准中看到更多基准。此外，您可能还想阅读这篇关于使用下一代Blosc的Blosc2打破内存墙的文章。\nBlosc最初是为满足PyTables数据库和bcolz项目的需要而开发的，不过它也可以用于其他需要快速压缩机的地方。此外，您可能希望使用新的Bloscpack格式和参考实现，以便更轻松地从命令行访问Blosc的主要功能和优点。\n使用Blosc/Bloscpack的应用程序预计会允许I/O性能超出预期的物理限制。例如，PyTables得益于Blosc在超大型表中的索引和查询操作。内存中的计算在某些情况下也可以更快(例如，请参阅此IPython笔记本)。\nPyTables社区为测试Blosc做出了非常大的贡献，我很高兴地说，从0.9.5版本开始，它在许多不同的Windows和Unix机器上完美地压缩和解压缩了数百TB(来自Include Benchmark中的硬件套件和极限套件)，包括32位和64位。当然，这并不意味着Blosc不包含错误，只是不太可能出现严重的错误。\n此外，随着Blosc 1.0的引入，它已经被宣布为稳定的，API和格式都被冻结了，所以你应该期待你的Blosc驱动的应用程序有很大程度的稳定性。\nBloscpack是一种使用Blosc和引用实现的序列化格式，它配备了一个很好的命令行工具，可以压缩磁盘上现有的二进制数据集。它还内置了对Numpy数组的压缩和序列化支持，无论是在内存中还是在磁盘上都是如此：\n虽然格式可能仍然会发生变化，但Bloscpack正在为成为一项伟大的实用程序而做出巨大的努力。\n您的贡献对于使Blosc尽可能扎实非常重要。如果您检测到错误或希望提出改进建议，请随时打开新的票证或让您的声音出现在邮件列表中。此外，您还可以通过在自己的硬件上编译和运行不同的基准测试和测试套件来为该项目做出贡献，如SyntheticBenchmark页面中所述。\nBlosc是自由软件，在非常许可的BSD许可条款下发布，因此您可以几乎以任何您想要的方式使用它！", "note_en": "Blosc is a  high performance compressor optimized for binarydata. It has been designed to transmit data to the processor cachefaster than the traditional, non-compressed, direct memory fetchapproach via a  memcpy() OS call. Blosc is the first compressor (thatI&#39;m aware of) that is meant not only to reduce the size of largedatasets on-disk or in-memory, but also to accelerate memory-boundcomputations (which is typical in vector-vector operations).\n It uses the  blocking technique (as described in this  article) to reduceactivity on the memory bus as much as possible. In short, theblocking technique works by dividing datasets in blocks that are smallenough to fit in L1 cache of modern processor and performcompression/decompression there. It also leverages  SIMD (SSE2)and  multi-threading capabilities present in nowadays multi-coreprocessors so as to accelerate the compression/decompression processto a maximum.\n   You can see more benchmarks in  Synthetic Benchmarks. Also, you may want to check out this article on  Breaking Down Memory Walls with  Blosc2, the next generation of Blosc.\n    Blosc was initially developed for the needs of the  PyTables database and the  bcolz project, although it may be usedelsewhere where a fast compressor is needed. Also, you may want touse the new  Bloscpack format and reference implementation for much easier access to themain Blosc features and benefits, also from the command line.\n Applications using Blosc/Bloscpack are expected to allow I/Operformance to go beyond expected physical limits. For example, PyTables benefits from Blosc for itsindexing and query operations in extremely large tables. Evenin-memory computations can go faster in some cases as well (forexample, see  this IPython notebook)\n The PyTables community has contributed  testing Blosc very hard, and I&#39;m happy to say that, since version 0.9.5 on,it  worked flawlessly compressing and decompressing hundreds ofTerabytes (coming from the  hardsuite and  extremesuite in theincluded benchmark) on many different Windows and Unix boxes, both in32-bit and 64-bit. Of course, that does not mean that Blosc doesn&#39;tcontain bugs, but just that  grave bugs are unlikely.\n Moreover, with the introduction of Blosc 1.0, it has been declaredstable, and both the  API and the format have been frozen, so youshould expect a large degree of stability for your Blosc-poweredapplications.\n    Bloscpack, a serialization format using Blosc and a referenceimplementaion, is equipped with a nice command line tool which cancompress existing binary datasets on-disk. It also has built-insupport for compressing and serializing Numpy arrays, both in-memoryand on-disk:\n  Although the format may still mutate, Bloscpack is making largestrides for becoming a great utility.\n Your contribution is very important to make Blosc as solid as possible. Ifyou detect a bug or wish to propose an enhancement, feel free to open a newticket or make yourself heard on the mailinglist. Also, you can contribute tothis project by simply compiling and running different benchmark and testsuites on your own hardware, as explained in the  SyntheticBenchmarks page.\n Blosc is free software and released under the terms of the verypermissive  BSD license,so you can use it in almost any way you want!", "posttime": "2020-06-11 11:28:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,数据,high,blosc", "title": "BLOCC-一种针对二进制数据进行优化的高性能压缩器", "title_en": "Blosc – A high performance compressor optimized for binary data", "transed": 1, "url": "https://blosc.org/pages/blosc-in-depth/", "via": "", "real_tags": ["性能", "数据", "high", "blosc"]}, {"category": "", "categoryclass": "", "imagename": "a4758fdd3468efa5313eda4e177680a2.jpg", "infoid": 1006098, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我一直在想爱德华·霍珀的事。我在网上注意到，其他家庭主妇也是如此。美国孤独的视觉吟游诗人--不是孤独，而是一种伤感的投射--以偶然的辛酸诉说着我们这些天与世隔绝的状态。但他总是这么做，不管有没有大流行。孤独是他的伟大主题，象征着美国：在一个仅仅是一个抽象的民族的国家里，没有安全感的自我。“E多元统一”，一个宏伟的理想，每天在大地上敲响着“统一”的号角。只有法律-我们是一个律师政体-赋予美国团结，如果南北战争不是那么可怕，无论如何都不会取消这一选择，美国可能明智地成为一个地区主权的巴尔干国家。霍珀的地区是东北部，从纽约到新英格兰的部分地区，但他的看法从东海岸到西海岸都适用。他1882年出生于尼亚克，在华盛顿广场的一套公寓里生活了半个世纪后于1967年去世，他无法想象自己在任何其他文化中都有过这样的发展。他的主题-雾化的人，不吉利的地方-是他那个时代特有的。但他的成熟艺术，在20世纪20年代巩固之前，花了20年的时间才孕育出来，是永恒的，或者说是没有时间的：一系列冻干的、不可思议的告诉人的时刻。\n尽管霍珀被称为现实主义者，但更确切地说，他是一个象征主义者，用紧握的、忧郁的主观性赋予客观面貌。他是一位能干的绘图家，是一位精湛的光影画家，但他无情地将审美愉悦从属于对事物的紧凑描述-像铀一样密集-这些东西既能回应他的感受，又不会暴露它们。他画的几乎每一座房子给我的印象都是一幅自画像，窗户沉思，几乎从来没有一扇看得见的门，或者说是诱人的门。如果他的画有时看起来有点勉强，那不是缺陷；这是他把绘画的交流能力推到了极限，然后稍微超出了一点的保证。他让我们独自面对自己的孤独，把我们的呼吸带走，也不会还给我们。认为他的人类主体是“孤独的”，回避了他们的真理。如果我们必须成为那些人，我们可能会抓狂，但是--看！--他们过得很好，不管他们的命运多么糟糕。想想塞缪尔·贝克特(Samuel Beckett)的著名标签“我不能继续”。我会继续说下去。“。现在删除第一句话。对于霍珀来说，继续下去不是一个选择。\n我还没有看过在巴塞尔郊外最近重新开放的瑞士首屈一指的现代艺术博物馆比耶勒基金会(Beyeler Foundation)举行的大型展览“爱德华·霍珀：新看风景”(Edward Hopper：A Fresh Look of Landscape)。我认为展览策展人乌尔夫·库斯特(Ulf Küster)编辑的精美目录足以让我重新反思这位艺术家的顽强力量。我也依赖于我们可能共同经历的“夜鹰”(1942)和“周日清晨”(1930)的记忆，但实际上，也是他手中的任何东西。一旦你看到了霍珀，它就会一直留在你的脑海里，留在你的脑海里。除了严谨的观察和真实的感觉之外，原因还在于一种特殊的文体智慧。霍珀在这一点上很明确，他在1933年说：“我试图用对我来说最合适和最令人印象深刻的形式来表达我的感觉。”被问到他的作品意味着什么的问题激怒了他，他用惊呼的方式压制了一位采访者，“我在追求我。”这句话反映了他对欧洲浪漫主义和象征主义的亏欠，他在深度吸收这些东西的同时，剔除了任何风格上的相似之处。他识字很高，一生都在反复阅读19世纪的德国和法国诗歌。他在现实主义模式下的诗意自由可以追溯到他最喜欢的前任之一古斯塔夫·库尔贝(Gustave Courbet)。霍珀身上某种阴燃的激情让我想起了泰奥多·杰里科(Théodore Géricault)，除了对单调乏味的现实的静态看法。霍珀将欧洲传统的一些情感力量引进或走私到无情的美国领土上。\n他曾在纽约师从罗伯特·亨利(Robert Henri)和其他阿什坎学派(Ashcan School)的导师，他们用本土现实主义来解决现代性问题，因此他在巴黎逗留了三次。在那里，他模仿了小的后印象派画家，用不安分的色调对比和不平衡的构图进行创作。回到家乡，他在以商业插画家的身份谋生的同时，通过蚀刻找到了一条前进的道路。在1920年的“美国风景”(American Landscape)中，浓墨重彩的奶牛、铁轨和一所平庸的房子预示着一个不同于他同时代人的方向。最接近他的是他神秘倾向的熟人查尔斯·伯奇菲尔德(Charles Burchfield)，他对纽约州西部不起眼的地点的狂热处理已经很久了，这在今天年轻画家中引发了一种强有力的代表性的趋势。不太容易模仿的霍珀从未停止过影响后来艺术家的思想，至少是这样。正如库斯特在目录中描述的那样，1959年，威廉·德·库宁(Willem De Koning)在一位采访者面前称赞了他。德·库宁在“鳕鱼角早晨”(1950)的背景中注意到了草草刷过的树林的惊人效果，", "note_en": "I’ve been thinking a lot about  Edward Hopper. So have other stay-at-homes, I notice online. The visual bard of American solitude—not loneliness, a maudlin projection—speaks to our isolated states these days with fortuitous poignance. But he is always doing that, pandemic or no pandemic. Aloneness is his great theme, symbolizing America: insecure selfhoods in a country that is only abstractly a nation. “E pluribus unum,” a magnificent ideal, thuds on “unum” every day throughout the land. Only law—we’re a polity of lawyers—confers unity on the United States, which might sensibly be a Balkans of regional sovereignties had the Civil War not been so awful as to remove that option, come what may. Hopper’s region is the Northeast, from New York to parts of New England, but his perceptions apply from coast to coast. Born in Nyack in 1882, and dying in 1967 after living for half a century in an apartment on Washington Square, he couldn’t conceivably have developed as he did in any other culture. His subjects—atomized persons, inauspicious places—are specific to his time. But his mature art, which took two decades to gestate before consolidating in the nineteen-twenties, is timeless, or perhaps time-free: a series of freeze-dried, uncannily telling moments.\n  Though termed a realist, Hopper is more properly a Symbolist, investing objective appearance with clenched, melancholy subjectivity. He was an able draftsman and masterly as a painter of light and shadow, but he ruthlessly subordinated aesthetic pleasure to the compacted description—as dense as uranium—of things that answered to his feelings without exposing them. Nearly every house that he painted strikes me as a self-portrait, with brooding windows and almost never a visible or, should one be indicated, inviting door. If his pictures sometimes seem awkwardly forced, that’s not a flaw; it’s a guarantee that he has pushed the communicative capacities of painting to their limits, then a little bit beyond. He leaves us alone with our own solitude, taking our breath away and not giving it back. Regarding his human subjects as “lonely” evades their truth. We might freak out if we had to be those people, but—look!—they’re doing O.K., however grim their lot. Think of Samuel Beckett’s famous tag “I can’t go on. I’ll go on.” Now delete the first sentence. With Hopper, the going-on is not a choice.\n I haven’t seen “Edward Hopper: A Fresh Look at Landscape,” a large show at the lately reopened Beyeler Foundation, Switzerland’s premier museum of modern art, outside Basel. I take its  fine catalogue, edited by the exhibition’s curator, Ulf Küster, as occasion enough for reflecting anew on the artist’s stubborn force. I rely as well on memories that we likely share of encountering “Nighthawks” (1942) and “Early Sunday Morning” (1930), but also, really, anything from his hand. Once you’ve seen a Hopper, it stays seen, lodged in your mind’s eye. The reason, beyond exacting observation and authentic feeling, is an exceptional stylistic cleverness. Hopper was explicit on this score, saying, in 1933, “I have tried to present my sensations in what is the most congenial and impressive form possible to me.” Exasperated by questions of what his works meant, he squelched one interviewer by exclaiming, “I’m after ME.” The remark reflects his debts to European Romanticism and Symbolism, which he absorbed in depth while stripping away any stylistic resemblances. Highly literate, he read and reread nineteenth-century German and French poetry all his life. His poetic liberties in a realist mode point back to one of his favorite predecessors,  Gustave Courbet. And a certain smoldering vehemence in Hopper puts me in mind of Théodore Géricault, except tamped down to static views of drab actualities. Hopper imported, or smuggled, some emotive powers of European traditions to unforgiving American soil.\n    Having studied in New York with Robert Henri and other preceptors of the Ashcan School, who addressed modernity with vernacular realism, he had three sojourns in Paris. There he emulated minor Post-Impressionists with restless variations of tonal contrasts and off-kilter compositions. Back home, while supporting himself as a commercial illustrator, he found a way forward by way of etching. Heavily inked cows, railroad tracks, and a banal house in “American Landscape” (1920) presaged a direction unlike that of any of his contemporaries. The closest was his mystically inclined acquaintance Charles Burchfield, whose rapturous treatments of unprepossessing sites in western New York State have aged very well, informing a trend today among young painters toward potent representation. Less imitable, Hopper has never ceased to influence the thinking, at the very least, of subsequent artists.  Willem de Kooning, as Küster recounts in the catalogue, praised him to an interviewer in 1959. De Kooning noted a startling effect of the summarily brushed woods in the background of “Cape Cod Morning” (1950), in which a woman is seen from the side leaning forward at a bay window and staring at something beyond the picture’s right edge: “The forest looks real, like a forest, like you turn on it and there it is, like you turn and actually see it.” That’s on the mark with Hopper: thereness that becomes hereness, in a viewer’s eye and mind.\n  A catalogue essay by David M. Lubin, the esteemed scholar of art history in relation to popular culture, makes a connection that I’ve often thought about myself: Hopper and  Alfred Hitchcock. The Yank painter and the Brit cinéaste display remarkable parallels as visual storytellers. Hitchcock, learning American experience from scratch after immigrating to Hollywood in 1939, at the age of thirty-nine, acknowledged the influence. The Bates house in “Psycho” reproduces, with simplifications, the already suitably ominous Victorian in Hopper’s “House by the Railroad” (1925). Lubin concentrates on suspenseful narrative tactics, which I would enlarge to cover methods of composition and aspects of temperament. Hitchcock storyboarded scenes and shots for his films. Hopper (incidentally, an addicted moviegoer) as much as did the same for his paintings. I once got to inspect a stack of studies that he’d made on paper. Some sheets bore only drawn rectangles: seeking the right proportions for what he had in mind. Then there were congeries of details with which he auditioned, in effect, particular body parts, architectural features, or other elements that would be knitted into dramatic wholes. Both he and Hitchcock aimed for the soundness and the suddenness of sights that compress time in service to a pre-imagined vision. Each knew the feeling—because he felt it—that the effort would trigger in viewers.\n Hitchcock shares with Hopper a predilection for jarring relations of backgrounds to foregrounds in pictorial space: perhaps someone or something relatively innocuous is nearby and something less calming is yonder. Lubin offers the example, from “North by Northwest,” of the distant crop-dusting plane at work “where there ain’t no crops.” In certain pictures of rural dwellings by Hopper, woods (like those in “Cape Cod Morning”) or topographical formations subtly menace a human intrusion. But in Hitchcock’s work, and in Hopper’s, especially, the unnerving relation of the far to the near is often reversed, and what’s mysterious, if not sinister, becomes identical with our point of view. What are we doing here, seeing that? Voyeurism—the saddest excitement—may be suggested. The emotional tug of many of Hitchcock’s characters and all of Hopper’s requires their unawareness of being looked at. To see them is to take on a peculiar responsibility. Hopper often produces the unease even in unpeopled landscapes and views of buildings, as if catching nature and habitation defenselessly exposed in disarray, mundanity, or squalor. The New England coastlines, lighthouses, and sailboats that he painted on summer excursions get off relatively easy. He liked them. But they, too, feel taken by surprise, depicted from odd angles of vision. No judgment is passed on anyone or anything, one way or another. The naked fact of their existence is provocative enough. “Why is there something rather than nothing?” cosmologists wonder. Hopper is all ears for the answer.\n  Politically, Hopper was “a sort of McKinley conservative,” his friend the novelist John Dos Passos remarked. The artist scorned the New Deal art programs of the thirties as sops to mediocrity. Interrupting a vacation on Cape Cod in 1940, he returned to New York to register to vote in order to cast his ballot against Franklin Roosevelt. The orientation leaves no mark in his work that I can detect—Hopper’s artistic passion disallowed the trivia of opinionating—but it chimes with a wary individualism that could seem to refuse agreement about practically everything with almost everybody except his painter wife, Josephine Nivison. Having first met as art students around 1905, they married in 1924 and were symbiotically a unit. (Their closeness strikingly recalls that of Hitchcock’s taut, creatively collaborative marriage with the screenwriter Alma Reville.) Nivison supervised a detailed ledger of all Hopper’s works and served, at her insistence and with his consent, as his only model when he painted nudes. She was as vivacious as he was taciturn. (She once joked that talking with him was like dropping a rock down a well and waiting to hear it hit, in vain.) Hopper’s last painting, “Two Comedians” (1965), pictures the pair of them in commedia-dell’arte costume as Pierrot and Pierrette on a stage, taking a bow.\n Nivison aside, or standing guard, Hopper’s independence feels absolute, repelling attempts to associate him with any other artist or social group. In this, he updates and passes along to the future the spirit of a paradigmatically American text, “Self-Reliance,” minus Ralph Waldo Emerson’s optimism. The free, questing citizen has devolved into one or another of millions rattling around on a comfortless continent. Can you pledge patriotic allegiance to a void? Hopper shows how, exploring a condition in which, by being separate, we belong together. You don’t have to like the idea, but, once you’ve truly experienced this painter’s art, it is as impossible to ignore as a stone in your shoe. ♦", "posttime": "2020-06-11 11:27:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "爱德华,hopper,美国", "title": "爱德华·霍珀与“美国孤独”", "title_en": "Edward Hopper and American Solitude", "transed": 1, "url": "https://www.newyorker.com/magazine/2020/06/08/edward-hopper-and-american-solitude", "via": "", "real_tags": ["爱德华", "hopper", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用MongoDB领域直观的应用程序开发服务，在Android、iOS和Web上构建一流的应用程序。使用我们的移动数据库、同步解决方案和服务，让您的功能更快地落入用户手中，因为您知道您需要的技术最佳实践已经内置。\n“MongoDB领域极大地改变了我们解锁和构建新功能的速度。它对我们的开发人员体验和上市时间有可衡量的影响。“--CBT掘金的软件架构师Isaac Overacker。\n从财富500强的中流砥柱到领先的初创企业，现在有超过35K个应用程序可供下载，这些应用程序都是王国提供支持的。\n“我第一次使用@Realm：这不可能那么容易。我很确定我错过了什么。“。\n“我第一次使用@Realm：这不可能那么容易。我很确定我错过了什么。“", "note_en": "Build best in-class-apps across android, iOS, and web with MongoDB’s Realm’s intuitive app development services. Use our mobile database, sync solution, and services to get your features in the hands of users faster, knowing that the technical best practices you need are already built-in.\n     “MongoDB Realm drastically changes the speed at which we’re able to unlock and build new features. It has a measurable impact on our developer experience and time-to-market.”  -  Isaac Overacker, Software Architect at CBT Nuggets\n  Realm powers more than 35k apps available for download today - from Fortune 500 mainstays to leading startups\n   “Me using @realm for the first time: this CAN’T be that easy. Pretty sure I’m missing something.”\n “Me using @realm for the first time: this CAN’T be that easy. Pretty sure I’m missing something.”", "posttime": "2020-06-11 11:25:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mongodb,领域,realm,服务", "title": "MongoDB领域-Beta版", "title_en": "MongoDB Realm – Beta", "transed": 1, "url": "https://www.mongodb.com/realm", "via": "", "real_tags": ["mongodb", "领域", "realm", "服务"]}, {"category": "", "categoryclass": "", "imagename": "30350efa9b94317d741d7d3a0ad26d59.jpg", "infoid": 1006095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "员工激励我们正在经历新一代人到目前为止不得不面对的最艰难的时期之一。第一次不要把重点放在管理远程团队上，而要更多地关注成为一名真正的人民领袖。\n几个月前，大多数经理认为，他们的职责中最重要的部分是让团队保持在实现目标的轨道上。但是，时代已经变了。\n到目前为止，我们正在经历新一代人不得不面对的最艰难的时期之一。\n随着一场全球大流行的爆发，世界发生了迅速的变化-工作场所也随之发生了变化。对于我们中的许多人来说，这很难说是一切照常。即使我们能够调整和适应，仍然有很多不确定性和恐惧。作为人事经理，我们比以往任何时候都更需要关注工作中的人。\n在新冠肺炎之前，经理们把注意力转向了常见的话题，比如实现团队目标，培养个人成长和发展机会，消除拦路虎，名单还在继续。然而，现在许多人不得不突然和出人意料地将重点转向控制或削减成本，做出极其艰难的决定，并解雇他们的团队…中有才华的人。我可以补充一句，很可能是通过视频通话。\n与此同时，管理人员和他们的团队被迫在一系列健康和安全问题中导航，更不用说可能第一次在接到通知后“远程”工作，让孩子们放学回家，同时支持他们的家人度过全球流行病。\n然而，经理们可以做一些事情，让这种不确定的、往往令人恐惧的情况对所有参与其中的人来说都更容易控制一些。\n在本文中，我们将介绍一些提示，以帮助您更好地领导您的团队度过危机：\n让你自己和你的团队知道这不是(仅仅)远程工作，它正在渡过一场危机。\n如果你最近一直在上网，你会注意到很多人，我可能会补充说，他们是远程工作的新手，突然之间就成了这个领域的“专家”。有真正的远程工作专家吗？绝对一点儿没错。达娜·多斯韦尔(Dana Doswell)和马库斯·维尔穆斯(Marcus Wermuth)这样的人在远程工作方面当然是专家。但是，无可否认，他们也在这个新的工作环境中苦苦挣扎。没有人是这方面的专家。有些人可能比其他人处理得更好，但他们绝不是专家。\n提醒自己，虽然你现在不在办公室工作，但你不是在远程工作；你是在危机中工作。\n“有员工在办公桌前工作，他们的笔记本电脑放在锅里；高管们坐在折叠椅上工作。这不是远程工作。这是“工作无家可归”。所有人都被赶出了办公室。“。\n-瑞安·默克利(Ryan Merkley)，维基媒体(Wikimedia)幕僚长。\n有如此多的远程工作专家和倡导者最近承认他们也在努力做好自己的工作。您、您的团队和公司目前面临的挑战可能与您的偏远环境关系不大，更多的是与我们当前面临的压力环境有关，这可能会影响积极性和工作效率。\n别为这件事责备自己。要知道，大多数人都在经历与您相似的事情，包括那些远程工作专家。\n目前的形势对我们很多人来说都是相当艰难的！对于那些被迫在家工作，并且从未真正经历过的人，请联系我。我很乐意腾出几个时段来聊天，看看我能为您做些什么！🤗#remotework#covid19pic.twitter.com/ycv8uksMIG\n-Marcus Wermuth(@mwermuth)2020年3月10日。\n1.办理登机手续。它可以像给他们发送一条快速消息一样简单：\n嘿[名字]，我知道这感觉很艰难。我也感觉到了。现在有什么我能做的让工作更容易管理吗？很高兴随时接听电话！“。\n2.确定每天早上最容易的工作时间。也许某人的孩子有特别糟糕的一天，他们需要早上来处理这种情况。与您的团队签到，看看一天中每个人工作或开会的最佳时间是什么时候。\n早上好，队员们！我只想登记入住，看看每个人的一天都是什么样子？我希望我们今天能就X问题开个会，看看你们每个人一天中最合适的时间是什么时候。对我来说最好的时间是X，但我可以很灵活。\n有些人更善于分析，想要谈论这些数字，比如当天确认了多少新病例。其他人可能想完全忽略这个问题。考虑到你的团队是如何思考、感受和沟通的，这样，当你们真的见面时，就不会让事情变得更糟。\n不要指望你的团队现在会非常高效。请记住，我们正处于一场全球大流行之中。无论你正在经历裁员，在家里没有很好的工作，或者你只是在努力集中精力与狂吠的狗或孩子在一起，周围都有很多压力。\n经理们：请允许你们的员工做非生产性的工作。这不正常。额外的认知负荷不容易推后。\n-Natalie Nagele(@natalienagele)2020年3月13日。\n期望他们的表现达到大流行前的水平，这对你和你的团队都是不公平的。随着压力、焦虑、困惑甚至孤立的加剧，每个人的心理健康现在都处于脆弱的状态。调整你的期望值，这样你仍然可以完成出色的工作，而不会给你的团队增加不必要的压力。\n如果你不确定调整你的期望是什么样子，下面是我正在做的几件事，以将压力水平降至最低，从小胜利中获得满足感，并与团队建立联系：\n每天和团队中的每个人挑选一件事。如果成功了，就算赢了！\n庆祝赢得更多。有人给你脸上挂上笑容了吗？您是否从客户那里听到了很好的反馈？降低你们作为一个团队分享的胜利的门槛。世界上有如此多的消极因素，尽可能多地融入积极因素是一件很好的事情。\n允许自己度过糟糕的一天。让你的团队知道，他们也可以有糟糕的日子。\n鼓励人们在生产力最高的时候工作。无论是在清晨还是在晚上，团队中的每个人都需要更加灵活，按照彼此的新时间表工作。\n当全球危机发生时，每月的一对一根本不能解决问题。人们正在努力应对足够多的挑战-感觉与上司脱节或得不到经理的支持不应该是其中之一。\n你不需要强制这样做，但至少，给你的团队更多的机会来分享他们的挑战、想法，并讨论不同的方式来保持彼此的积极性。随着形势的发展和经济格局的持续变化，你的直接下属可能会有更多的问题和想法，他们会想要你来管理。不要让事情恶化。至少每周一对一的目标是。\n不知道该问什么？以下是您可以添加到您的会议议程中的一些一对一问题，它们将帮助您现在更好地领导您的团队：\n一旦这一切都结束了，你有什么期待做的事情吗？\n人类天生需要归属感，这种感觉并不局限于工作场所。人才创新中心的一项研究发现，当人们感觉自己属于工作时，他们会更有生产力，更有动力，更投入，最大限度地发挥潜力的可能性是其他人的3.5倍。\n努力检查你的团队以及他们做得怎么样会增加这种归属感。这样一个简单的手势就会让人们知道你关心他们，关心他们的福祉。这个简单的问题会有很大帮助。\n如果这看起来对你的管理风格来说是不正常的，那么你有一些主要的领域要涉及。您需要在短时间内开始通过视频通话与您的团队建立信任。\n自从我们在多伦多进行全市范围的隔离(除了基本服务)以来，我经历了一段极其艰难的时期。我没有意识到面对面的人际互动给我带来了多少动力，更不用说我的直接团队给我的工作带来了多少动力。从那以后，我一直在非常非常努力地寻找激励自己的方法。有时某些事情会奏效，有时什么都不会。\n然而，最有效的是当我和我的经理彼此坦率、脆弱的时刻；我们都压力很大，面临着大流行前我们确实没有的新挑战。我们设定了新的期望，并决定了我们可以做的使彼此每天保持动力的诀窍。相比较而言，自从进行了那次谈话后，我的动力就猛增了。这种支持和团结的感觉让我在工作中最接近于真正的人际互动。\n虽然我通常是完全敞开心扉的，但并不是每个人都是。作为一名经理，你需要明白，在你与直接下属的关系中，你处于权力的地位。所以，先做个脆弱的人吧。定下基调，当你们彼此交谈时，这是一个安全的空间来分享这些类型的东西。\n心理安全是任何一支球队都应该努力拥有的最重要的东西之一，而且可以说，现在拥有更重要。随着谷歌氧气项目的成功，他们启动了亚里士多德项目，以努力确定是什么动力构成了一个有效的团队。他们最大的关键发现是，这更多的是关于团队如何合作，而不是团队中的哪些人。\n哈佛大学教授艾米·埃德蒙森(Amy Edmonson)发表了一场关于建立心理安全工作场所的TED演讲。在她的演讲中，她强调了三个需要重点关注的关键领域：\n在您的组织或团队中，要认识到并明确地认识到前方存在巨大的不确定性，以及高度的相互依赖。使用能鼓励人们敞开心扉的语言，而不是感觉自己在为某件事受到责备。\n“我们以前从未来过这里，我们不知道会发生什么。让我们作为一个团队一起工作，找出如何最好地向前迈进。要成功做到这一点，我们需要每个人的声音和观点。“。\n换句话说，要脆弱。你不是十全十美的，你也没有理由做到完美。诚实地告诉你的团队你做得怎么样，你面临着什么挑战(以及你的胜利)。为你的团队定下基调，这样开放不仅是正常的，而且是受到鼓励的。埃德蒙森声称，像认识到你的不完美这样简单的事情会让你更安全地直言不讳。这可以是一个简单的语句，如：\n“我现在挣扎得很厉害。自从我们开始在家工作以来，我发现我白天的工作效率真的很低，但晚上工作效率非常高，因为孩子们都在床上，我可以全神贯注地工作。我知道这可能不是最理想的，但我希望我们所有人都能在这种情况下努力最大限度地相互适应。“。\n让提问成为常态。创造一个充满好奇心的环境会让你的团队参与到更开放的对话中，并且随着时间的推移，在团队中讲话会变得更加自在。提问也创造了发声的必要性。然而，要确保这些问题是出于好奇心，而不是指责性质。例如：\n🚫你真的应该和你的搭档制定一个时间表，这样你就可以参加我们的团队会议了。明天之前你能做好这件事吗？\n知道应该包括在此列表中的资源吗？联系info@soapboxhq.com。", "note_en": "Employee Motivation    We’re going through one of the toughest times newer generations have had to face to date. Focus less on managing a remote team for the first time, and more on being a true people leader.\n   A few months ago, the majority of managers felt that the most important part of their role was to  keep the team on track to achieve goals. But, times have changed.\n We’re going through one of  the toughest times newer generations have had to face to date.\n With the onset of a global pandemic, the world has rapidly changed — and the workplace right along with it. For many of us, it’s hardly business as usual. Even if we’ve been able to adjust and adapt, there’s still a lot of uncertainty and fear. As people managers, we need to focus on the  people part of our jobs more than ever before.\n Before COVID-19, managers turned their attention toward the usual topics, like hitting team goals, fostering individual growth and development opportunities, eliminating blockers, the list goes on. Now, however, many have had to make a sudden and unexpected shift in focus towards controlling or cutting costs, making extremely hard decisions and laying off talented people on their team… Most likely over a video call, I might add.\n At the same time, managers and their teams have been forced to navigate through a slew of health and safety concerns, not to mention working “remotely” possibly for the first time, at a moment’s notice, with children home from school, all the while supporting their families through a global pandemic.\n  There are, however, things managers can do to make this uncertain, often scary, situation feel a little more manageable for all those involved.\n In this article we’ll walk through some tips to help you better lead your team through a crisis:\n   Let yourself and your team know that this isn’t (just) remote work, it’s working through a crisis\n If you’ve been on the internet lately, you’ll notice that a lot of people, who are new to remote work might I add, are suddenly “experts” in this domain. Are there real remote work experts? Absolutely. People like  Dana Doswell and  Marcus Wermuth are certainly experts when it comes to remote work. But, they’re also admittedly struggling in this new working environment.  No one is an expert at this. Some people might be handling it better than others, but by no means are they experts.\n Remind yourself that although you’re not working in an office right now, you’re not working remotely; You’re working in a crisis.\n “There are employees working at a desk with their laptop on a pot; Executives working from a fold-out chair. This isn’t remote work. This is ‘work homelessness’. Everyone’s been evicted from their offices.”\n -Ryan Merkley, Chief of Staff at  Wikimedia\n There are so many remote work experts and advocates who have recently admitted they’re also struggling to do their jobs. The challenges that you, your team and company are currently facing likely has less to do with your remote setting, and more to do with the stressful environment we’re currently facing, which can take a toll on motivation and productivity.\n Don’t beat yourself up about it. Understand that most people are going through similar things to you, including those who are remote work experts.\n  The current situation is quite hard on a lot of us! For those of you that are forced to work from home, and never really experienced it – please reach out to me. I am happy to make a few time slots available to chat and see how I can be of help! 🤗 #remotework  #covid19  pic.twitter.com/ycv8uksMIG\n— Marcus Wermuth (@mwermuth)  March 10, 2020\n     1. Check-in on them. It can be as simple as sending them a quick message:\n Hey [name], I know this feels like a tough time. I’m feeling it too. Is there anything I can do to help make work a little easier to manage right now? Happy to hop on a call whenever!”\n 2. Confirm the easiest working times every morning. Maybe someone’s kids are having an extra bad day and they need the morning to manage that situation. Check-in with your team to see when the best time of day is for everyone to work or meet.\n Good morning team! I just wanted to check in and see what everyone’s day is looking like? I’m hoping that we can have a meeting about X today and want to see what the best time of day is for each of you. The best time for me is X, but I can be flexible.\n  Some people are more analytical and want to talk about the numbers, like how many new cases were confirmed that day. Others might want to ignore the issue altogether. Take into account how your team thinks, feels and communicates so that, when you do meet, you’re not making matters worse.\n   Don’t expect your team to be extremely productive right now. Remember, we’re in the middle of a global pandemic. Whether you’re experiencing layoffs, don’t have a great work from home setup, or you’re simply struggling to concentrate with barking dogs or kids in the background, there’s plenty of stress to go around.\n Managers: please give your folks permission to be unproductive. This isn’t normal. The extra cognitive load is not easily pushed back.\n— Natalie Nagele (@natalienagele)  March 13, 2020\n  It’s unfair to both you and your team to expect them to perform at the same caliber they did pre-pandemic. With the heightened level of stress, anxiety, confusion and even isolation, everyone’s mental health is in a fragile state right now. Adjust your expectations so that you’re still producing great work, without adding unnecessary strain on your team.\n  If you’re not sure what adjusting your expectations looks like, here are a few things that I’m doing to minimize stress levels, get satisfaction from small wins and connect with the team:\n Pick one thing with each person on your team every day. If that gets done, count it as a win!\n Celebrate wins  more. Did someone put a smile on your face? Did you hear great feedback from a customer? Lower your bar for the wins you share as a team. With so much negativity in the world, it’s nice to weave in as much positivity as possible.\n Allow yourself to have a bad day. Let your team know that they’re allowed to have bad days too.\n Encourage people to work when they’re most productive. Whether it’s in the early morning or at night, make it a point that everyone on the team needs to be more flexible and work around each others’ new schedules.\n  When there’s a global crisis happening, a  monthly one-on-one simply won’t cut it. Folks are struggling with enough challenges as it is — feeling disconnected or not supported by your manager shouldn’t be one of them.\n You don’t need to mandate this, but at the very least, give your team more opportunities to share their challenges, ideas and to talk about different ways to keep each other motivated. As the situation progresses and the economic landscape continues to change, your direct reports will likely have more questions and thoughts they’re going to want to run by you. Don’t let things fester. Aim for weekly  one-on-ones, at the very least.\n  Not sure what to ask? Below are some  one-on-one questions you can add to your meeting agenda, which will help you better navigate leading your team right now:\n What’s something you’re looking forward to doing once this is all over?\n  Humans innately need to belong, and that feeling doesn’t stop in the workplace. A  study by the Center for Talent Innovation found that when people feel like they belong at work, they’re more productive, motivated, engaged and 3.5 times more likely to contribute to their fullest potential.\n Making the effort to check in on your team and how they’re doing will add to that sense of belonging. A simple gesture like this will let people know that you care about them and their wellbeing. This simple question will go a long way.\n  If this seems like something that’s out of the norm for your management style, you’ve got some major ground to cover. You need to start building trust with your team—over a video call—in a short period of time.\n     I have had an extremely tough time since we went into city-wide quarantine in Toronto (except essential services). I didn’t realize how much face-to-face human interaction fueled me, let alone how much my direct team motivated me to work. Since then, I’ve been trying really,  really hard to find ways to motivate myself. Sometimes certain things will work and other times nothing will.\n However, what worked best was when my manager and I had a very candid, vulnerable moment with one another; We’re both stressed out and facing new challenges that we really hadn’t pre-pandemic. We set new expectations and decided on tricks we could do to keep one another motivated on a day-by-day basis. Since having that conversation my motivation has, comparably, skyrocketed. That sense of support and togetherness gave me the closest thing to  real human interaction at work.\n Although I’m usually a completely open book, not everyone is. As a manager, you need to understand that you’re in a position of power in your relationship with your direct reports. So,  be vulnerable first. Set the tone that when you’re speaking with one another, it’s a safe space to share these types of things.\n  Psychological safety is one of the  most important things any team should be striving to have and it’s arguably more important to have now. Following the success of Google’s Project Oxygen, they launched  Project Aristotle in an effort to identify what dynamics made up an effective team. Their biggest key finding was that it was less about who was on the team, and more about how the team worked together.\n     Amy Edmonson, a Harvard professor presented a Ted talk on  Building a Psychologically Safe Workplace. In her talk she highlighted three key areas to focus on:\n  Within your organization or team, recognize and be explicit that there’s enormous uncertainty ahead, and a high level of interdependence. Use language that will encourage people to open up, rather than feel like they’re being blamed for something.\n “We’ve never been here before and we don’t know what to expect. Let’s work together as a team to figure out how to best move forward. To do this successfully, we’re going to need everyone’s voices and perspectives.”\n  In other words, be vulnerable. You’re not perfect and there’s no reason that you need to be. Be honest with your team on how you’re doing, what challenges you’re facing (and your wins). Set the tone for your team so that opening up is something that is not only normal but encouraged. Edmonson claims that something as simple as recognizing your imperfections will create more safety for speaking up. This can be a statement that as simple as:\n “I’m struggling a lot right now. Since we’ve started to work from home, I’ve found that I’m really not productive during the day, but extremely productive at night because the kids are in bed and I’m able to give work my full, undivided attention. I know it might not be the most ideal, but I hope that we can all work to best accommodate one another in this situation.”\n   Make it the norm to ask questions. Creating an environment of curiosity will allow your team to engage in more open dialogue and, as time goes by, feel more comfortable speaking among the group. Asking questions also creates a necessity for voice. However, be sure the questions are coming from a curious nature rather than an accusatory one. For example:\n 🚫You should really figure out a schedule with your partner so that you’re available for our team meetings. Are you able to do this by tomorrow?\n       Know of a resource that should be included in this list? Reach out to  info@soapboxhq.com.", "posttime": "2020-06-11 11:24:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程工作,带领,isn,团队", "title": "经理：这不是远程工作。它正在带领我们度过一场危机", "title_en": "Managers: This isn't remote work. It's leading through a crisis", "transed": 1, "url": "https://soapboxhq.com/blog/employee-motivation/managing-in-a-crisis", "via": "", "real_tags": ["远程工作", "带领", "isn", "团队"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006094, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "矿业巨头必和必拓(BHP Billiton)准备摧毁皮尔巴拉中部至少40个(可能多达86个)重要的原住民遗址，以扩大其45亿美元的南侧铁矿石开采业务，尽管该公司自己的报告显示，该公司意识到传统所有者强烈反对此举。\n在澳大利亚卫报(Guardian Australia)看到的文件中，必和必拓的一项考古调查发现了1万至1.5万年前被占领的岩石避难所，并指出，更广泛地区的证据显示，“对周围景观的占领已经持续了大约4万年”。\n必和必拓在2019年9月的报告中确定了22个地点，其中包括文物散布、经过文化改造的树木、带有彩绘岩画的岩石避难所、石头布置和40个“Build Structures…。据信是潜在的考古遗址“。\n根据“西澳大利亚土著遗产法”第18条，传统的所有者--在本案中是班吉马人--不能提出异议，也不能防止他们的圣地受到破坏。\n他们也无法公开提出对扩张的担忧，因为他们已与必和必拓签署了全面协议，作为原住民所有权和解的一部分。必和必拓同意为班吉马人民提供财务和其他福利，而班吉马则承诺支持南侧项目。\n但班吉马原住民所有权持有者在4月份告诉西澳政府，他们不希望项目区内的86个考古遗址中的任何一个受到破坏，称对该地区的“迫在眉睫的伤害”“是对班吉马人文化价值的进一步重大累积损失”。\n澳大利亚卫报(Guardian Australia)今年4月看到了班吉马(Banjima)的一名考古顾问给西澳政府的信件，他们在信中表示，他们“绝不支持继续破坏这一重要的文化景观”，但“同样意识到”他们不能正式反对第18条的申请。\n这封信是在4月份发出的，在2019年12月发出的一封信中，土著所有权持有人在信中表示：“受通知影响的遗址对班吉马人的重要性是，班吉马人不能也不支持通知建议的破坏这些遗址，因为这样做与他们保护这些遗址的文化义务不一致。”他们将“遭受精神和身体上的伤害，如果他们被摧毁”。\n他们表示，他们“担心受到单一销毁通知的这么多地点的累积影响，没有一个地点被必和必拓认为值得就地保护”。\n必和必拓2019年的报告称，“它已考虑到Banjima代表在咨询和检查期间提供的意见和建议”，但认为必和必拓避开南侧矿山开发区的八十六(86)个潜在考古遗址“并不合理可行”。\n必和必拓表示，这些地区可以挖掘、打捞或解构，但也指出，Banjima不希望86个潜在考古遗址内的任何物品或遗产价值被移走或搬迁。\n必和必拓还提出聘请“一名有适当资质的专家，利用DPGS和无人机镜头以数字方式捕捉每一块石头排列的范围和形式，以创建三维计算机模型和视频”。\n该公司的评估报告称，“任何作为这些项目一部分被抢救出来的文化材料都应储存在必和必拓Mulla Mulla遗产办公室的文化储存库中，直到班吉马人民指定一个不同的地点。”\n必和必拓申请中确定的所有86个遗址都经过了控制遗产保护的土著文化材料委员会的评估，但ACMC认为只有40个遗址达到了保护遗产的门槛，尽管Banjima表示所有86个遗址都应该受到保护。\n必和必拓的一位发言人表示：“我们定期与Banjima社区进行交谈，并重申我们的承诺，将在南侧开发的整个生命周期内与他们密切合作，将对文化遗产的影响降至最低。”\n在此之前，力拓(Rio Tinto)铁矿石首席执行官克里斯·索尔兹伯里(Chris Salisbury)上周为摧毁朱坎峡谷的避难所而道歉。5月24日，在皮尔巴拉地区汤姆·普莱斯(Tom Price)附近的布罗克曼4号铁矿(Brockman 4)的采矿工程中，该避难所被炸毁。索尔兹伯里表示，与普图昆蒂·库拉马人(Puutu Kunti Kurrama)和皮尼库拉人(Pinikura)等传统所有者存在“误会”。\n周二，300多名抗议者戴着口罩聚集在该公司位于珀斯圣乔治露台的办公室外，要求索尔兹伯里辞职。\n抗议组织者、农加尔人罗伯特·埃金顿(Robert Eggington)表示，力拓利用了西澳已有48年历史的土著遗产法的弱点，这些法律已经审查了两年。\n埃金顿说：“他们利用这一点来对付人们，然后转而将其归咎于公司和该网站的管理员之间的误解。”\n根据西澳立法，力拓在2013年获得了部长们的同意，可以摧毁该工地。这项立法并没有给予传统所有者上诉的权利。\n必和必拓表示，南侧项目将创造约2500个建筑工作岗位，600多个持续运营的角色，并为西澳大利亚供应商创造许多机会。该项目预计将生产矿石超过25年。\n西澳大利亚州土著事务部长本·怀亚特(Ben Wyatt)证实，他在5月29日批准了南侧扩建工程，这是在巨坎峡谷被摧毁三天后登上全球头条的。\n但他敦促必和必拓在现在“情况改变”的情况下与Banjima合作。\n他说：“正如任何协议一样，某些情况可能会有所改变，包括对特定地点文物价值的理解。\n“我敦促此类协议的各方在管理这些变化的情况方面进行合作。\n“我已要求必和必拓与Banjima合作，尽其所能避免或最大限度地减少对该工地的影响，不管第18条的批准如何.”\n怀亚特说，即将对西澳土著遗产立法进行的改革将结束第18条的进程，并加强土地使用者与传统所有者直接谈判的必要性。\n怀亚特说，他希望看到对原住民遗址的影响“限于实际可能的程度”，但他“对政府干预注册的原住民所有权持有人的私人谈判持谨慎态度”。\n他表示，必和必拓等公司根据与本土产权集团达成的这些协议做出重大投资决定，进而产生实质性利益。\n他说：“我们的首要原则是透过规划和不断谘询传统拥有人的意见，避免对文化遗产造成影响。这一方法得到了我们与传统业主合作建立的个人土地使用协议的支持，而且还符合土著遗产保护法的要求。“必和必拓一位发言人说。", "note_en": "Mining giant BHP Billiton is poised to destroy at least 40 – and possibly as many as 86 – significant Aboriginal sites in the central Pilbara to expand its $4.5bn South Flank iron ore mining operation, even though its own reports show it is aware that the traditional owners are deeply opposed to the move.\n In documents seen by Guardian Australia, a  BHP archaeological survey identified rock shelters that were occupied between 10,000 and 15,000 years ago and noted that evidence in the broader area showed “occupation of the surrounding landscape has been ongoing for approximately 40,000 years”.\n BHP’s report in September 2019 identified 22 sites of artefacts scatters, culturally modified trees, rock shelters with painted rock art, stone arrangements, and 40 “built structures … believed to be potential archaeological sites”.\n  Under section 18 of the Western Australian Aboriginal Heritage Act, the traditional owners – in this case the Banjima people – are unable to lodge objections or to prevent their sacred sites from being damaged.\n They are also unable to raise concerns publicly about the expansion, having signed comprehensive agreements with BHP as part of a native title settlement. BHP agreed to financial and other benefits for the Banjima people, while the Banjima made commitments to support the South Flank project.\n But the Banjima native title holders told the WA government in April they did not want any of the 86 archaeological sites within the project area to be damaged, saying the “impending harm” to the area “is a further significant cumulative loss to the cultural values of the Banjima people”.\n Guardian Australia has seen correspondence from an archaeological advisor to the Banjima to the WA government in April this year in which they say they “in no way support the continued destruction of this significant cultural landscape” but “are equally aware” they cannot formally object to the section 18 application.\n This letter in April followed one sent in December 2019 in which the native title holders said: “The significance of the sites impacted by the notice to Banjima people is such that Banjima people cannot and do not support the destruction of those sites as proposed by the Notice as to do so would be inconsistent with their cultural obligations to protect those sites.” They would “suffer spiritual and physical harm if they are destroyed”.\n They said they were “worried about the cumulative impact of so many sites being the subject of a single notice for destruction and that not one of the sites is deemed worthy of protection in situ by BHP”.\n BHP’s 2019 report said “it had taken into account the views and recommendations provided by the Banjima representatives during the consultation and inspection” but decided it was  “not reasonably practicable for BHP to avoid the eighty-six (86) potential archaeological sites” at the South Flank mine development area.\n BHP suggested the areas could be excavated, salvaged or deconstructed but also noted the Banjima did not want any of the objects or heritage values within the 86 potential archaeological sites to be removed or relocated.\n BHP also offered to engage “a suitably qualified expert to digitally capture the extent and form of each stone arrangement using DPGS and drone footage, with a view of creating a three-dimensional computer model and video”.\n “Any cultural material salvaged as part of these programs shall be stored in the cultural repository at the BHP Mulla Mulla Heritage Office until a different location is nominated by the Banjima people,” the company’s assessment report said.\n All 86 sites identified in the BHP application were assessed by the Aboriginal Cultural Materials Committee, which controls the protection of heritage, but only 40 were considered by the ACMC to meet the threshold required to be a protected heritage site, despite the Banjima saying all 86 should be protected.\n  “We speak regularly with the Banjima community and have reiterated our commitment to working closely with them through the lifecycle of the South Flank development to minimise impacts on cultural heritage,” a spokesman for BHP said.\n  The revelations follow the  apology last week by the chief executive of Rio Tinto iron ore, Chris Salisbury, for destroying the rock shelter in Juukan Gorge, which was blown up in mining works at the Brockman 4 iron ore mine near Tom Price in the Pilbara region on 24 May,  saying there had been a “misunderstanding” with traditional owners the Puutu Kunti Kurrama and Pinikura people.\n On Tuesday, more than 300 protesters gathered in face masks outside the company’s offices on St George’s Terrace in Perth to call for Salisbury’s resignation.\n  Protest organiser Robert Eggington, a Noongar man, said  Rio Tinto had exploited the weakness of WA’s 48-year-old Aboriginal heritage laws, which have been under review for two years.\n “They used that against the people and then turned and blamed [it on] misunderstandings between the company and the custodians of that site,” Eggington said.\n Rio Tinto received ministerial consent under the WA legislation to destroy the site in 2013. That legislation  does not give traditional owners the right of appeal.\n BHP has said the South Flank project will create around 2,500 construction jobs, more than 600 ongoing operational roles and generate many opportunities for Western Australian suppliers. The project is expected to produce ore for more than 25 years.\n The Western Australian minister for Aboriginal affairs, Ben Wyatt, confirmed he approved the South Flank expansion on 29 May, three days after the destruction of Juukan Gorge made global headlines.\n But he has urged BHP to cooperate with the Banjima under what are now “changed circumstances”.\n “As with any agreement, some circumstances can change including the understanding of heritage values of particular sites.\n “I urge parties to such agreements to cooperate on management of those changed circumstances.\n “I have asked BHP to work with Banjima to do what it can to avoid or minimise the impact on this site, regardless of the section 18 approval.”\n Wyatt said impending reforms to the WA Aboriginal heritage legislation will end the section 18 process and reinforce the need for land users to negotiate directly with traditional owners.\n Wyatt said he wants to see impacts to Aboriginal sites “limited to the practical extent possible” but that he is “cautious about governments interfering in private negotiations by registered native title holders”.\n Companies such as BHP make significant investment decisions on the basis of these agreements with native title groups, which in turn generate substantial benefits, he said.\n “Our first principle is to seek to avoid impacts to cultural heritage, through planning and ongoing consultation with traditional owners. This approach is supported by the individual land use agreements we establish in partnership with traditional owners, and is in addition to meeting the requirements of Aboriginal heritage protection laws” a BHP spokesman said.", "posttime": "2020-06-11 11:08:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "土著,bhp", "title": "必和必拓将摧毁至少40个有15K年历史的土著遗址，以扩大地雷", "title_en": "BHP to destroy at least 40 Aboriginal sites, up to 15K years old, to expand mine", "transed": 1, "url": "https://www.theguardian.com/business/2020/jun/11/bhp-to-destroy-at-least-40-aboriginal-sites-up-to-15000-years-old-to-expand-pilbara-mine", "via": "", "real_tags": ["土著", "bhp"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006093, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "图表：活动、类、组件、对象、用例、序列、状态、部署、计时、GUI、Archimate、甘特图、思维导图、树、数学、实体关系", "note_en": "Diagrams: activity, class, component, object, use-case, sequence, state, deployment, timing, gui, archimate, gantt, mindmap, tree, math, entity-relationship", "posttime": "2020-06-11 10:51:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文本,text,对象", "title": "联机文本到图表工具", "title_en": "Online Text to Diagram Tools", "transed": 1, "url": "https://smusamashah.github.io/text-to-diagram", "via": "", "real_tags": ["文本", "text", "对象"]}, {"category": "", "categoryclass": "", "imagename": "da175bd3f8f86d3b60e23fbbf803c089.jpg", "infoid": 1006092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "肯塔基州路易斯维尔。-路易斯维尔地铁警察在布雷娜·泰勒(Breonna Taylor)的公寓里开枪打死她近三个月后，该部门发布了当晚的事件报告。\n这份长达四页的报告列出了时间、日期、案件编号、事发地点和受害者的名字-布雷娜·沙奎尔·泰勒(Breonna Shaquille Taylor)-以及她是一名26岁的非黑人女性的事实。\n这份报告编辑了泰勒的街道号码、公寓号码和出生日期-所有这些都已经被广泛报道。\n据她家人的律师称，名单上列出的是她的伤势，没有受伤，尽管她至少被枪击了8枪，并在走廊地板上死于血泊中。\n它列出的指控是死亡调查和LMPD涉及的，但勾选了强行进入下面的方框，即使警察用撞击锤敲了泰勒的公寓门。\n它还在报告的罪犯部分列出了在泰勒的公寓开枪打死她的三名警察-47岁的乔恩·马丁利中士、42岁的迈尔斯·科斯格罗夫和44岁的布雷特·汉克森。\n3月13日的事件叙述只说了PIU调查，报告的其余部分根本没有填写任何信息。\n泰勒在凌晨12点40分左右在她的公寓里。当地时间，作为毒品调查的一部分，这三名便衣警察使用地区法官玛丽·肖(Mary Shaw)签署的不敲门搜查令进入了她的家。\n警察说他们宣布了他们的存在，但是泰勒的男朋友肯尼斯·沃克和几个邻居说他们没有。沃克曾表示，他认为入侵者试图破门而入，并开了一枪警告，击中了马丁利的腿部。\n马丁利，汉克森和科斯格罗夫正在进行行政重新分配，等待调查。LMPD周三宣布，要求逮捕令的侦探约书亚·杰恩斯(Joshua Jaynes)也已被重新分配。\n今日美国网络路易斯维尔信使杂志(Louisville Courier Journal Of The USA Today Network)的律师乔恩·弗莱沙克(Jon Fleischaker)说：“这份文件证明，LMPD继续嘲弄透明度。”弗莱沙克是该州开放档案法的主要作者之一，该法要求在除极其罕见的情况下公布公开文件。\n弗莱沙克说：“在费舍尔执政期间，有一个一贯的政策和做法，即拒绝告诉公众警方发生了什么，无论警察的行为多么不当。”\n随着关于警察改革的辩论在全国范围内展开，弗莱沙克说，城市领导人拒绝履行他们的义务，公开路易斯维尔公民所需的基本信息，以便就哪些方面需要改变进行有意义的辩论。\n如果警察不参与，市长也不敢反抗，我们怎么能认真讨论警察改革呢？他说。\n“信使日报”正在起诉LMPD，并寻求立即公布该部门在泰勒枪击案中的调查文件。\n“信使日报”还在5月份向州总检察长办公室提出上诉，反对路易斯维尔公共机构做出的公开记录的决定，拒绝公布泰勒案件背后的记录，包括事件报告、事件中拨打的911电话和泰勒的尸检报告。\n自那以后，该市发布了沃克的911电话-但只是在泰勒家人的律师几个小时前将其交给新闻媒体之后。", "note_en": "LOUISVILLE, Ky. — Nearly three months after Louisville Metro Police officers fatally shot Breonna Taylor in her apartment, the department  has released the incident report from that night.\n  The four-page report lists the time, date, case number, incident location and the victim&#39;s name — Breonna Shaquille Taylor — as well as the fact that she is a 26-year-old black female.\n The report redacts Taylor&#39;s street number, apartment number and date of birth — all of which have been widely reported already.\n And it lists as her injuries, &#34;none,&#34; even though she was shot at least eight times and died on her hallway floor in a pool of blood, according to attorneys for her family.\n It lists the charges as &#34;death investigation — LMPD involved&#34; but checks the &#34;no&#34; box under &#34;forced entry,&#34; even though officers used a battering ram to knock in Taylor&#39;s apartment door.\n    It also lists under the &#34;Offenders&#34; portion of the report the three officers who fired in Taylor&#39;s apartment, fatally shooting her — Sgt. Jon Mattingly, 47; Myles Cosgrove, 42; and Brett Hankison, 44.\n The &#34;narrative&#34; of events March 13 says only &#34;PIU investigation.&#34; And the rest of the report has no information filled in at all.\n  Taylor was at her apartment around 12:40 a.m. local time when the three plainclothes officers used a no-knock search warrant signed by District Judge Mary Shaw to enter her home as part of a narcotics investigation.\n Officers say they announced their presence, but Taylor&#39;s boyfriend, Kenneth Walker, and several neighbors say they did not. Walker has said he thought intruders were trying to break in and fired a warning shot that struck Mattingly in the leg.\n  Mattingly, Hankison and Cosgrove are on administrative reassignment pending the investigation. The detective who requested the warrant, Joshua Jaynes, has also been reassigned, LMPD announced Wednesday.\n “This document is proof that LMPD continues to make a mockery of transparency,” said Jon Fleischaker, counsel for the Louisville Courier Journal of the USA TODAY Network and one of the principal authors of the state’s Open Records law that requires the release of public documents in all but extremely rare circumstances.\n  “Under the Fischer administration, there has been a consistent policy and practice of refusing to tell the public what is going on with the police, regardless of how inappropriate the officer conduct has been,&#34; Fleischaker said.\n  With debate about police reform taking place nationwide, Fleischaker said city leaders &#34;are refusing to honor their obligations to disclose the basic information necessary for the citizens of Louisville to have a meaningful debate about what needs to change.&#34;\n  &#34;How can we even seriously debate police reform if the police won’t engage and the mayor won’t stand up to them?&#34; he said.\n The Courier Journal is suing LMPD, seeking the immediate release of the department&#39;s investigative file in Taylor&#39;s shooting.\n  The Courier Journal also filed an appeal with the state attorney general’s office in May to object to open-records decisions Louisville public agencies made refusing to release records underlying the Taylor case, including the incident report, 911 calls made in the incident and Taylor&#39;s autopsy report.\n The city has since released Walker&#39;s 911 call — but only after an attorney for Taylor&#39;s family gave it to news media hours earlier.", "posttime": "2020-06-11 10:51:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "泰勒,taylor", "title": "布雷娜·泰勒案件：路易斯维尔警方几乎空白的事件报告", "title_en": "Breonna Taylor case: Louisville police nearly blank incident report", "transed": 1, "url": "https://www.usatoday.com/story/news/nation/2020/06/10/breonna-taylor-case-louisville-police-nearly-blank-incident-report/5335929002/", "via": "", "real_tags": ["泰勒", "taylor"]}, {"category": "", "categoryclass": "", "imagename": "57c63dfa96cc751f01c91438b0040c0a.png", "infoid": 1006091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很高兴地在一个特别的开放源码库中宣布用于Nginx的Quic+HTTP/3的技术预览版。这是预发布软件，基于IETF Quic草案，在开发分支中维护，与稳定分支和主线分支隔离。该版本是最初几个月开发的顶峰，现在已经为互操作性测试、反馈和代码贡献做好了准备。\n在这个快节奏的世界里，二十多年来，超文本传输协议(HTTP)一直是一个非常稳定的常量。HTTP/1.1标准于1999年底发布，现已成为Web应用程序和API的无处不在的传输协议。尽管用于传输的应用和服务发生了巨大变化，但该协议在接下来的21年里保持不变。\n在这一点上，精明的读者可能会问，“但是HTTP/2呢？”这是一个非常好的问题。HTTP/2标准于2015年底发布，并已稳步采用，目前约45%的面向互联网的网站支持HTTP/2。然而，这一统计数据掩盖了这样一个事实，即与“最后一英里”(运行时基础设施)相比，HTTP在公共互联网上的使用有很大不同。\n现代Internet基础设施的现实情况是，HTTP/2很少被端到端部署。它旨在解决在公共Internet上最明显的问题，在公共Internet上，延迟高得无法预测，一个HTTP请求的问题可能会延迟后续请求。在应用程序运行时环境内-例如，公共云或私有数据中心-延迟低，网络可靠性极佳，并且直接检查HTTP/1.1的基于文本的传输流的能力比HTTP/2的二进制传输流的效率更有价值。\nHTTP/2大体上改善了浏览器和移动设备上的用户体验，因为它非常适合客户机和运行时基础设施的“边缘”之间的环境。在这一点上，它通常被代理到使用HTTP/1.1的运行时环境中。边缘最有可能是CDN提供商，或者是处理进入运行时环境的流量的反向代理负载均衡器。\n这种使用HTTP/2和HTTP/1.1来交付网站和应用程序的混合方法效果很好。那么，为什么还要提出另一个新协议HTTP/3呢？\nHTTP/2的主要创新是在使用TCP作为底层传输的单个连接上多路复用多个HTTP请求。不幸的是，TCP有固有的限制，限制了网站和应用程序的性能和用户体验。TCP标准最初发布于1981年左右，作为通用传输协议取得了惊人的成功。但是，当您在同一连接上多路传输多个独立请求时，它们都会受到该连接可靠性的影响。如果只有一个请求的数据包丢失，则所有多路复用的请求都会延迟，直到首先检测到丢失的数据包，然后重新传输。\nHTTP/3基于Quic传输协议，该协议专为支持多路复用连接而设计，而不依赖于单个TCP连接。相反，QUIC使用UDP作为在客户端和服务器之间传输数据包的低级传输机制，并实现可靠的连接，在此基础上进行HTTP请求。值得注意的是，Quic还将TLS合并为一个完整的组件，而不是像HTTP/1.1和HTTP/2那样作为一个附加层。\nQuic的目标是为HTTP/3提供高性能、高可靠性、高安全性的传输协议(尽管Quic也适用于非HTTP流量)。从语义上讲，Http/3本身与Http/2非常相似。但是，没有明确的Http版本定义-https://www.example.com可能支持Http/1.1、Http/2和Http/3中的一个或多个。客户端(Web浏览器)如何知道要使用哪个版本的Http？\n版本控制问题首先出现在HTTP/2的引入中，它通过使用TLS握手来检测客户端和服务器是否能够通过HTTP/2通信来解决这个问题。这样，客户端甚至在建立连接之前就知道如何与服务器通信。然而，Quic使用UDP而不是TCP作为底层传输协议提出了一个新的挑战-客户端如何知道最初请求哪种类型的连接，TCP还是UDP？解决方案是客户端为初始HTTP请求建立TCP连接。来自支持HTTP/3的服务器的响应包括Alt-Svc标头，以指定其侦听HTTP/3流量的UDP端口。此外，浏览器还会记住哪些站点支持Quic，以消除基于Alt-Svc的发现方法的开销。\n今天，我们宣布Nginx的官方Quic和HTTP/3实现http_v3_module的初始版本。这是一个技术预览，必须被认为是试验性的-它不是用于生产的。在撰写本文时，Quic标准还没有定稿，这个初始版本是针对当前草案的子集实现的。\n经过几个月的设计和开发，http_v3_module已经准备好进行互操作性测试。我们也欢迎一般的反馈和代码贡献。请注意，http_v3_module在主线开发分支中不可用；因为它仍处于实验阶段，所以它位于https://hg.nginx.org/nginx-quic.的专用开发分支中。\n注意，这个Quic+HTTP/3实现是全新的，与Cloudflare作为其Quiche项目的一部分提供的补丁无关。\nserver{Listen 443 SSL；#TCP Listener for HTTP/1.1 Listen 443 Http3 Reuseport；#UDP Listener for Quic+HTTP/3 SSL_Protocol TLSv1.3；#Quic需要TLS 1.3 SSL_Certificate SSL/www.example.com.crt；SSL_Certificate_key SSL/www.example.com.key；add_header Alt-Svc&#39；quic=#34；：443；34；#通告该Quic。\n有关从nginx-quic repo构建nginx的更多信息，以及推荐的配置，请参阅自述文件。此外，https://quic.nginx.org/.上还提供了启用了http_v3_module的演示站点。在这里，您可以检查您的浏览器是否已经支持Quic，并将HTTP/3互操作性与您自己的nginx-quic版本进行比较。鉴于Quic的草案状态，您可能需要使用开发版本或常用浏览器的最新版本来启用Quic连接。\n感谢您尝试使用nginx-quic，我们期待在评论区或我们的邮件列表中听到您的反馈。", "note_en": "We are pleased to announce the technology preview of QUIC+HTTP/3 for NGINX at a  special open source repository. This is pre‑release software, based on the  IETF QUIC draft and is maintained in a development branch, isolated from the stable and mainline branches. The release is the culmination of several months of initial development, and is now ready for interoperability testing, feedback, and code contributions.\n   In this fast‑paced world, the Hypertext Transfer Protocol (HTTP) has been a remarkably stable constant for over two decades. The  HTTP/1.1 standard was published in 1999 and has become the ubiquitous transport protocol for web applications and APIs. The protocol remained the same over the next 21 years despite the huge changes to the apps and services it is used to transport.\n At this point the astute reader may be asking, “but what about HTTP/2?”. This is a very good question. The  HTTP/2 standard was published in 2015, and has seen steady adoption to the point where  45% of Internet‑facing websites support HTTP/2. However, this statistic belies the reality that the use of HTTP is quite different on the public Internet compared to the “ last mile” (the runtime infrastructure).\n The reality of modern Internet infrastructure is that HTTP/2 is very rarely deployed end to end. It is designed to solve problems that manifest most clearly on the public Internet, where latency is unpredictably high and  problems with one HTTP request can delay subsequent requests. Inside the application runtime environment – for example, a public cloud or private data center – latency is low, network reliability is excellent, and the ability to directly inspect HTTP/1.1’s text‑based transport stream is of more value than the efficiency of HTTP/2’s binary transport stream.\n HTTP/2 has by and large improved the user experience on browsers and mobile devices, because it’s well suited to the environment between the client and the “edge” of the runtime infrastructure. At that point it is typically proxied into a runtime environment where HTTP/1.1 is used. The edge is most likely to be a CDN provider, or a reverse‑proxy load balancer that handles traffic entering the runtime environment.\n  This hybrid approach of using HTTP/2 and HTTP/1.1 to deliver websites and applications works well. So why propose yet another new protocol, HTTP/3?\n The primary innovation of HTTP/2 is to multiplex several HTTP requests over a single connection that uses TCP as the low level transport. Unfortunately, TCP has inherent limitations that constrain the performance and user experience of website and applications. The  TCP standard was originally published in 1981 and has been astonishingly successful as a general‑purpose transport protocol. However, when you multiplex several independent requests over the same connection, they all become subject to the reliability of that connection. If a packet for just one request is lost, all of the multiplexed requests are delayed until the lost packet is first detected and then retransmitted.\n HTTP/3 is based on the  QUIC transport protocol, which is designed specifically to support multiplexed connections without depending on a single TCP connection. QUIC instead uses  UDP as the low‑level transport mechanism for moving packets between client and server, and implements a reliable connection upon which HTTP requests are made. Notably, QUIC also incorporates TLS as an integral component, not as an additional layer as with HTTP/1.1 and HTTP/2.\n  The goal of QUIC is to provide a high‑performance, high‑reliability, high‑security transport protocol for HTTP/3 (although QUIC is also suitable for non‑HTTP traffic). Semantically speaking, HTTP/3 itself is very similar to HTTP/2. However there is no explicit versioning of HTTP –  https://www.example.com might support one or more of HTTP/1.1, HTTP/2, and HTTP/3. How do clients (web browsers) know which version of HTTP to use?\n The versioning issue first arose with the introduction of HTTP/2, which solved it by using the TLS handshake to detect whether the client and server are capable of communicating over HTTP/2. That way, the client knows how to talk to the server before the connection is even established. However, QUIC’s use of UDP instead of TCP as the underlying transport protocol presents a new challenge – how does the client know which type of connection to request initially, TCP or UDP? The solution is for the client to establish a TCP connection for the initial HTTP request. The response from a server that supports HTTP/3 includes the   Alt-Svc  header to specify the UDP port on which it is listening for HTTP/3 traffic. In addition, the browser remembers which sites support QUIC to eliminate the overhead of the   Alt-Svc–based discovery method.\n  Today we announce the initial release of the official QUIC and HTTP/3 implementation for NGINX, the http_v3_module. This is a technology preview and must be considered experimental – it is not for production use. At the time of writing, the  QUIC standard is not yet finalized, and this initial release is implemented against a subset of the current draft.\n Following several months of design and development, the http_v3_module is ready for interoperability testing. We also welcome general feedback and code contributions. Note that the http_v3_module is not available in the mainline development branch; because it is still experimental, it is in a dedicated development branch at   https://hg.nginx.org/nginx-quic.\n Note that this QUIC+HTTP/3 implementation is all‑new, and not related to the patch provided by Cloudflare as part of its  quiche project.\n  server {\r listen 443 ssl; # TCP listener for HTTP/1.1\r listen 443 http3 reuseport; # UDP listener for QUIC+HTTP/3\r\r ssl_protocols TLSv1.3; # QUIC requires TLS 1.3\r ssl_certificate ssl/www.example.com.crt;\r ssl_certificate_key ssl/www.example.com.key;\r\r add_header Alt-Svc &#39;quic=&#34;:443&#34;&#39;; # Advertise that QUIC is available\r add_header QUIC-Status $quic; # Sent when QUIC was used\r}\n For more information about building NGINX from the   nginx-quic repo, and recommended configuration, see the  README. In addition, a demo site with the http_v3_module enabled is available at  https://quic.nginx.org/. From here you can check whether your browser already supports QUIC, and compare HTTP/3 interoperability with your own build of   nginx-quic. Given the draft status of QUIC, you may need to use development versions or the very latest builds of the common browsers to enable a QUIC connection.\n Thanks for trying   nginx-quic, and we look forward to hearing your feedback in the comments section, or on our  mailing lists.", "posttime": "2020-06-11 10:50:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nginx,http", "title": "Nginx对Quic和HTTP/3-Nginx支持的技术预览", "title_en": "A Technology Preview of Nginx Support for QUIC and HTTP/3 – Nginx", "transed": 1, "url": "https://www.nginx.com/blog/introducing-technology-preview-nginx-support-for-quic-http-3/", "via": "", "real_tags": ["nginx", "http"]}, {"category": "", "categoryclass": "", "imagename": "fb8971d61dcbd7031875cbce499f2737.jpg", "infoid": 1006090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1911年推出，并至少持续生产到1916-1917年。我认为罗宾斯和麦尔斯(Robbins&Amp；Myers)是那个时期最好、最简单的粉丝之一，1404&34；型号14，上面的照片显示了它的三个版本。此外，还制作了类似的16&34；风扇，名单1411和14110，除风扇大小外，与12&34；型号基本相同。\n从左到右是1911年的原始型号(我最喜欢的粉丝之一，经常是日常用户)，警卫使用的是方形背环。这与R&amp；M&34；棒棒糖风扇后来的生产版本使用的笼子相同。下面显示了一个早期的棒棒糖粉丝。1912年，1404的护罩改为两圈笼子，使用圆形钢丝背环和R&amp；M已经使用了几年的相同的普通旗笼徽章。*在1404年的最后几年，名单编号。变成了14040，基本上是和1404型一样的风扇，但有一个毛毡覆盖的底板。实际上，生产的最后一年是在R&amp；为1916年推出了新的拉制钢制风扇电机之后，似乎已经有了一个笼子，上面有上面照片右侧所示的新的、更小的实心笼子徽章。右边的风扇在底座上有它原来的感觉。*这三个风扇都有他们原来的油漆，在黄铜上抛光，和头线。\n在冲压钢马达型号问世后，14040是继续生产了一年或更长时间，还是我看到了一些笼子更换的结果？我从加拿大多伦多找到了一些新的信息，下面的电子新闻显示，旧铸铁R&AMM风扇与新的1916年冲压钢型号一起出售。这将解释最新榜单上1404款车型上的小圆形徽章。似乎1916年的12&34；和16&34；风扇，无论是旧的铸铁型号还是新的冲压钢型号，都使用了旧的国旗徽章，而只有较小的(冲压钢制)风扇使用了新的圆形实心笼子徽章。在1917年的型号中，钢铁都有较新的圆形笼子徽章和一个黄铜笼子。1918年，可能还有1919年，R&Amp；M&M的较大风扇有一个包裹的钢笼，随后是一个焊接的钢笼，公元1920年。\n如果不是准确的话，人们可以按如下方式密切地确定列表1404型和14040型的日期：\nRobbins&Amp；Myers是历史最悠久的风扇公司之一，于1897年开始在俄亥俄州斯普林菲尔德制造直流吊扇，由钱德勒·罗宾斯和詹姆斯·迈尔斯所有。直流台式风扇是在1899年增加的。在从Charles Eck那里获得摆动风扇机构的专利后，R&amp；M于1904年将其独特的直流棒棒糖振荡器投入生产，几年后又推出了交流版本。*风扇前面的薄片黄铜盘受到来自风扇的空气的作用，导致风扇来回摆动。风扇底座上的止动块被棒棒糖轴底部的销子接触，将圆盘移动到另一边，导致风扇摆动到另一边。\n直到1908年第一台交流风扇问世之前，R&Amm一直只生产直流电风扇。他们的新12&34；和16&34；AC风扇是由西屋制造的，并为R&Amm重新贴上了徽章。它们实际上与西屋的坦克风扇一模一样，但带有R&amp；M开放旗帜笼子徽章。随着西屋电气(Westinghouse)即将在1912年推出一款新的拉制钢制风扇电机，R&amp；很可能发现它将不再有交流风扇电机的来源，这促使他们设计自己的交流风扇电机，该列表1404；及其变种。\n1404取消了以前西屋电气制造的R&Amm；AC风扇的机械启动开关。1404融合了三种速度，在高、中、低速度之间有很好的分离。他们跑起来也很安静，是日常生活中很容易使用的风扇。\n更常用的敞开旗帜笼形徽章在大多数1404年和14040风扇上使用，如右图所示，1916年在12&34；和16&34；R&Amp；M风扇上使用过。下面的照片，右，是R&amp；M铸铁风扇电机生产的最后一年(大概是1917年)使用的较小的圆形徽章。我既有12&34；R&A；M 14040振荡器，也有16&34；R&A；M 11530振荡器，带有圆笼徽章。1911-1917年间的Robbins&amp；Myers汽车标签几乎没有关于它们的信息；清单编号(前两位是型号)以及电压和频率，以及直流电或交流电。但这就是你得到的所有信息-没有序列号或专利日期或其他信息。如果有专利正在申请中，它们从来没有作为实际日期出现在这些风扇的电机标签上。是的，R&Amm确实制造了1404型和14040的直流电版本。上面是较新版本的列表1505中的电机标签，该列表具有毛毡底板，使其成为列表15050。请注意30伏\n对我来说，不同寻常的是，铜翼螺栓应该表明螺栓是由黄铜制成的，而人们可能会认为，黑色的翼螺栓应该表明是铁翼螺栓。此外，人们还会认为黄铜更早，铁更晚。1911年的机型都有漆铜的机翼螺栓。在这里讨论的最新风扇上，有一个小的，实心的笼子徽章，大的翼螺栓是钢的，而小的是铜的，漆成黑色。第一张照片中央的风扇和直流风扇都有一个铜制的大螺栓，但都有一个黑色的钢制小螺栓。但这样的小细节对于老粉丝来说并不少见。*这些公司可能用了他们手头的东西。\n这些风扇从未使用过后轴承盖或后轴承盖。在没有毛毡底板的早期型号上，棕褐色纤维盖被拧到底座上，这有助于保护开关和布线。三只橡胶脚保护着风扇放置的表面。\n下面是早期(1911年)带有方形背环的笼子和后来带有两个圆形环的笼子的对比照片。双环笼子只在使用的年份(1912-1917年)中有所不同，因为1917年的笼子上有较小的实心徽章。\n笼子支柱和夹子如右图所示，历年都是用冲压钢制成的，没有什么不同。所有连接的螺钉都是实心的黄铜。\n刀片经过高度抛光和上漆。笼子和其他黄铜部件可能是浸泡和上漆的，并不像现代修复中常见的那样高度抛光。我从来没有想过蘸漆是什么意思，但我会经常在那个时期的粉丝目录中看到这个词。\n下面是一些30伏直流电源的照片，列出了15050个风扇。经过一些换向器和刷子的清洗和油杯的润滑，这台风扇运行得很好。我将电源线连接到我的压差上，将电压降低到30伏或更低，并将其插入电源条插座，我在插座中安装了一个桥式整流器，可以提供接近直流电压的电压。但是桥式整流器很小，每个大约4美元，而且很容易连接。他们可以安装在大多数早期风扇的底座内，如果底座上有空间，然后风扇可以插入常规的房屋墙壁插座。\n当直流模型的底座相同(开关不同)时，电机的直径更大、深度更深，结构不同。我想说DC比AC版本的电机更好看。从电机后侧伸出的管子是刷架。但早期版本的不同之处在于有一个螺丝上的滚花帽。直到1917年左右，才出现我们今天所知的典型的两个插头。取而代之的是风扇和其他电器使用如下所示的连接插头，允许风扇连接到灯插座。在19世纪10年代，墙壁插座开始安装在建筑物中，但连接插头一直持续到20世纪30年代，当时可以从标准的双叉插头中分离出来。直流风扇电机的排气与交流电机非常不同。直流电机上的几个大开口与交流电机上的许多较小的通风孔形成对比。油杯是由黄铜制成的，里面有弹簧加载的毛毡芯子，用来把油抽到轴承上。20磅的非洗涤剂是旧风扇使用的合适机油。这些R&AMM粉丝的稀缺性和可用性如何？我会说他们有点不常见，但并不太难找到。当然，它们甚至比1902-07年的GE煎饼，或者GE同期的大电机轭(Big Motor Yoke)和小电机轭(Small Motor Yoke)都要少得多。直流模式相当罕见，很难找到，这是有意义的，因为直流电在我们国家的大部分时间里都相当早地消失了。我打赌很多华盛顿的粉丝在两次世界大战的废品驱动器中遇到了他们的命运。\n感谢一位著名的R&amp；M粉丝收藏家为我提供了1911年1404系列粉丝的R&amp；M目录页的扫描。我遇到的唯一数字是普通110伏60循环电流的1404和1411个风扇。在榜单1404和其他铸铁R&AMM粉丝之后发生了什么？直到1916年，所有R&A&M台式风扇都是铸铁制造的。从1916年开始，R&amp；M有了由拉制钢材制成的新设计，这是西屋电气在1912年车型年率先采用的特点。似乎在1916年之后的一两年里，铸铁模型仍然可以买到，但他们的风扇主要是新压制的钢结构。新产品包括一个带四个叶片的6&#34；双速风扇、一个三速风扇、5个叶片风扇-型号26和27(交流和直流)和12&#34；和16&#34；6个叶片风扇-型号21和22(交流和直流非振荡器)以及摆动风扇，型号24和25(交流和直流)。型号是列表号的前两位，这是描述R&AM的重要数字", "note_en": "Introduced for 1911 and continued in production through at least  1916-1917 is what I consider to be one of the best and simplest fans of the period, the Robbins &amp; Myers &#34;List 1404&#34; model 14, three versions of which are shown in the photo above.  A similar 16&#34; fan was also made, the List 1411 and 14110 which, other than the fan size, was basically the same as the 12&#34; model.\n  Left to right are the original 1911 model (one of my favorite fans and often a daily user) with a guard using a square back ring.  This is the same cage used on later production versions of the R&amp;M &#34;lollipop&#34; fan.  An early lollipop fan is shown below.  For 1912 the guard of the 1404 was changed to a two ring cage using a round wire back ring and the same common flag cage badge that R&amp;M had already been using for a few years.  For the final few years of the 1404 the List No. became 14040 and was, basically, the same fan as the 1404 but with a felt covered base plate.  The last year of production was actually  after R&amp;M introduced their new drawn steel fan motors for 1916 and appears to have had a cage with the new, smaller solid cage badge as shown on the right of the photo above.   The fan on the right has its original felt on the base.  All three fans have their original paint, finish on the brass, and head wires.\n  Was the 14040 continued in production for a year or more after the stamped steel motor modles came out or am I seeing the result of some cage substitutions?  I have found some new information from the Toronto, Canada  The Electrical News, below, that shows the old cast iron R&amp;M fans were sold alongside the new 1916 stamped steel models.  This would account for the small round badge on the latest List 1404 models.  It appears that the 12&#34; and 16&#34; fans for 1916, both the old cast iron models and new stamped steel models, used the old flag badge while only the smaller (stamped steel) fans used the new round solid cage badge.  1917 models, both iron and steel had the newer round cage badge and a brass cage.   For 1918 and possibly 1919 R&amp;M&#39;s larger fans had a wrapped steel cage followed by a welded steel cage c.1920.\n     One can closely, if not exactly, date the List 1404 and 14040 models as follows:\n      Robbins &amp; Myers was one of the oldest fan companies, having begun the manufacture of direct current ceiling fans in 1897 in Springfield, Ohio under the ownership of Chandler Robbins and James Myers.  Direct current desk fans were added in 1899.  After acquiring a patent from Charles Eck for an oscillating fan mechanism, R&amp;M put into production their unique DC &#34;lollipop&#34; oscillator in 1904, followed a few years later by an AC version.  A sheet brass disk in front of the fan was acted upon by the air from the fan causing the fan to oscillate back and forth.  Stops on the base of the fan were contacted by a pin at the bottom of the lollipop shaft to shift the disc to the other side, resulting in the fan oscillating to the other side.\n    R&amp;M had been making only direct current fans until 1908 when their first AC fans were introduced.  Their new 12&#34; and 16&#34; AC fans were made by Westinghouse and re-badged for R&amp;M.  They were virtually identical to the Westinghouse &#34;tank&#34; fans but with the R&amp;M open flag cage badge.  With Westinghouse&#39;s impending introduction of a new drawn steel fan motor in 1912 it is likely that R&amp;M found it would no longer have a source of AC fan motors, prompting them to design their own AC fan motor, the &#34;List 1404&#34; and varients.\n  The 1404 did away with the mechanical start switch of the previous R&amp;M AC fans made by Westinghouse.  The 1404 incorporated three speeds with a good speed separation between high and medium and medium and low.  They also run pretty quietly and are an easy fan to live with for daily use.\n       The much more commonly used &#34;open flag&#34; cage badge as used on most 1404 and 14040 fans is shown in the top photo, right, and was used on 12&#34; and 16&#34; R&amp;M fans through 1916.  The photo below, right, is of the smaller round badge used during the last year of R&amp;M cast iron fan motor production, presumably 1917.   I have both the 12&#34; R&amp;M 14040 and a 16&#34; R&amp;M 11530 oscillator with the round cage badge.                    Robbins &amp; Myers motor tags from the 1911-1917 era have little information on them; the &#34;List No.&#34; (the first two digits are the &#34;model number&#34;) and the voltage and frequency, as well as direct or alternating current.  That is all you got- no serial numbers or patent dates or other information was included.  If there were patents pending they never were on the motor tags of these fans as an actual date.         Yes, R&amp;M did make Direct Current versions of the 1404 and 14040.  Above is the motor tag of a later version of the List 1505 with felt base plate making it a List 15050.  Note the 30 volts on the tag.  A standard 110 v. DC version is a List 1500, or List 15000 with the felt base.  Most information for R&amp;M fans is hard to come by.  I have not seen any catalogs of their earlier fans so that I might see what voltages and frequencies they made fans for or the other models that were made in this series of the Models 14 and 15.   Right:  The 1911 1404 on the left in the photo and the c.1915 14040 on the right.  Not too many fan makers pin striped their fans but R&amp;M was one who did well into the 1920s.  Usually a pair of double stripes was used, hand applied, around both the motor and the base.  A single stripe was applied to the sides of the trunnion.   R&amp;M&#39;s finish was second to none in this period and their black japan finish was very durable.  It can usually be cleaned up using acetone and a rag and Q-tips with no harm to the japan.  That finish is really tough!  Click on photos in the blog to see a larger version.     There are two wing bolts on these fans.  Here you can see them both painted black; one for the tilt adjustment on the left upper side of the trunnion and a smaller wing bolt, also painted black on this fan, at the bottom center of the trunnion to adjust for side to side position of the fan. The tilt adjustment must be the easiest to use and most secure locking of any fan ever made.  A wonderful design of a simple part.\n  What is unusual to me is that a brass wing bolt should indicate that the bolt is made of brass and, one would think, a black painted wing bolt would indicate an iron wing bolt.  Also, one would think that brass is earlier and iron is later.  The 1911 model has both wing bolts of lacquered brass.  On the newest fan discussed here, the one with the small, solid cage badge, the large wing bolt is steel but the small one is brass, painted black.  The fan in the center of the first photo and the DC fan both have a brass large bolt but a black steel small bolt.  Such minor details are not uncommon for old fans.  The companies probably used what they had on hand.\n      Rear bearing caps or covers were never used on these fans.  On the earlier models without the felt base plate a tan fiber cover was screwed to the base which helped to protect the switch and wiring.  Three rubber feet protected the surface the fan was placed on.\n    Below are comparison photos of the early (1911) cage with square back ring and the later cages with the two round rings.  The double ring cages only differed among the years used (1912- 1917) by having the smaller solid badge on the  1917 cages.\n         Cage struts and clips as shown to the right were made of stamped steel in all years and did not differ.  Attaching screws were solid brass.\n Blades were highly polished and lacquered.  Cages and other brass parts were probably dipped and lacquered and not highly polished as is commonly seen on modern restorations.  I have never figured out what the &#34;dipped&#34; part of dipped and lacquered is but will often see that term used in fan catalogs of the period.\n     Some photos, below, of the 30 volt Direct Current, List 15050 fan.  After some cleaning of the commutator and brushes and lubricating the oil cups, this fan runs very well.  I connect the power cord to my variac to reduce the voltage to 30 volts or less and plug it into a power strip socket in which I have installed a bridge rectifier which gives a close approximation of direct current voltage.  The bridge rectifiers are small, about $4 each, and are easy to hook up.  They can be installed inside the base of most early fans if there is room in the base and the fan can then be plugged into a regular house wall outlet.\n    While the base of the DC models is the same (the switch is not the same) the motor is larger in diameter and deeper, with different construction.   I would say the DC has a better looking motor than the AC versions.  The tubes sticking out from the rear sides of the motor are the brush holders.  Earlier versions differ somewhat in having a screw-on knurled cap.   There were no typical two prong plugs as we know them today until about 1917.  Instead fans and other electrical appliances used &#34;attachment plugs&#34; as shown below allowing the fan to be connected to a light socket.  In the nineteen teens wall outlets began to be installed in buildings but the attachment plugs persisted into the 1930s, by then separable from a standard two prong plug.          Venting on the DC fan motors is very different from the AC motors.  A few large openings on the DC motors contrast with many smaller vent holes on the AC motors.  Oil cups are made of brass and have spring loaded felt wicks in them to wick oil to the bearings.  20 wt. non-detergent is the proper oil to use on old fans.      What about rarity and availability of these R&amp;M fans?  I would say they are a bit uncommon but not too hard to find.   Certainly they are much less common than even the 1902-07 GE pancakes, or the GE &#34;Big Motor Yoke&#34; and &#34;Small Motor Yoke&#34;  models of about the same period.  DC models are fairly rare and hard to find which makes sense since Direct Current power disappeard for the most part from our country fairly early.  I bet a lot of DC fans met their fate in the scrap drives of the two world wars.\n  Thanks goes to a noted collector of R&amp;M fans for providing me with this scan of an R&amp;M catalog page for the 1911 year List 1404 series of fans. The only numbers I have encountered are the List 1404 and 1411 fans for the common 110 volt 60 cycle current.     What came after the List 1404 and other CAST IRON R&amp;M fans?   Up until 1916 all R&amp;M desk fans were made of cast iron.  Beginning in 1916 R&amp;M had new designs made of drawn steel, a feature that Westinghouse pioneered for the 1912 model year.  It appears that the cast iron models were still available for a year or two after 1916 but, predominately, their fans would be of the new pressed steel construction.  The new offerings included a 6&#34; two speed fan with four blades, a three speed 9&#34;, 5 blade fan- Models 26 and 27 (AC and DC), and 12&#34; and 16&#34; 6 blade fans- Model 21 and 22 (AC and DC non-oscillators) as well as oscillating fans, Models 24 and 25 (AC and DC).  The model numbers were the first two digits of the &#34;List Number&#34; which is the important number in describing R&amp;M fans.  For several years the 12&#34; and 16&#34; fans were available only with 6 blades.  A brass cage was used on 1916-17 fans with a change to wrapped steel cages for one or two years more before the cages went to welded steel.   Before the welded steel cages appeared the four blade fans returned and the 6 blade may have been discontinued.  As R&amp;M information is hard to come by I will leave it at this for now until I can update the details.                                                                                            Pictured at left is a 1916 R&amp;M 6 wing oscillating Model 24 (List 2404).  This is probably the last year for the large, open flag cage badge to be used and followed in 1917 by the smaller, solid, round flag cage badge, still on a brass cage and with a 6 wing blade.                (To be continued)  I have not yet covered or even mentioned that there are 16&#34; versions of the 1404; the List 1411, 14110, etc.  The size difference is about the only notable difference although the first year model 1411 (1911) used a square back ring cage but with a front (round) ring that the 12&#34; fan did not use, it had no front ring on the cage.   8-24-16  R&amp;M Flag cage badges- new reproductions: Often the original cage badge is missing from early R&amp;M fans.  It was a thin stamped sheet brass &#34;flag&#34; as you see pictured in this blog.   Fortunately for those who have a missing badge, which is a very common occurrence, AFCA member Darryl Hudson makes excellent die stamped reproductions that are nearly impossible to tell from the originals.  Darryl made a run of flag badges then ran out. Fortunately he did made another batch around 2014 and I think they are still available.  If you need a badge don&#39;t dally, they may sell out again and you don&#39;t know if they will be made again.  Darryl does excellent work.  He makes the badges in the original thickness of .010 and the same in a thicker and slightly more durable 0.015&#34; thickness for the same price of $40.00 each plus shipping.   That&#39;s a bargain for the quality and intricateness of his badges.   Darryl Hudson  68 Bluegrass Drive, Aiken, SC 29803  (803) 649-6641  http://www.hudsonscustommachining.com  Many high quality reproduction parts supplies: grommets, feet, brush caps, gears, plugs and various hardware. Also custom machining and some restoration services. See Web page or email for complete list.                    Above:  Darryl had dies made to stamp out new R&amp;M cage badges.  Quality is excellent with relief on both sides as per the originals.                  Left:  Darryl Hudson  reproduction R&amp;M cage badge that has seen some use and had one corner bent some.  What you get form him are perfect and an unpolished bright brass.  Above right;  original R&amp;M cage badge with original &#34;dipped and lacquered&#34; finish.    Blades were highly polished and lacquered but not on cages or badges.      Here is a brand new Darryl Hudson reproduction as you will receive them showing the front and the back sides.    Click on any photo to enlarge; two clicks to supersize on many photos.", "posttime": "2020-06-11 10:34:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "早期,electric,风扇", "title": "早期的电扇", "title_en": "Early electric fans", "transed": 1, "url": "https://earlyfans.blogspot.com/2011/10/robbins-myers-list-1404-desk-fans-1911.html", "via": "", "real_tags": ["早期", "electric", "风扇"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "木工YouTube频道", "note_en": "Woodworking YouTube channels", "posttime": "2020-06-11 10:33:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工程师,woodworking,youtube", "title": "工程师用的木工", "title_en": "Woodworking for Engineers", "transed": 1, "url": "https://woodgears.ca/", "via": "", "real_tags": ["工程师", "youtube"]}, {"category": "", "categoryclass": "", "imagename": "b4870c53e6815ee09b4b01987698ca04.jpg", "infoid": 1006088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名软件开发人员在推特上发帖称，每天戴几个小时的虚拟现实头盔会损害他的视力。\n在一位医生将他的视力问题归咎于这项技术后，一次去眼镜店的旅行让他对我未来的VR使用感到担忧。\n他在推特上写道，眼镜应该可以解决这个问题，但通常只会开给40岁的人。\n视光师协会表示，没有看到VR头盔会造成永久性眼睛损伤的证据。\nFacebook旗下的Oculus在其手册中表示，每4000人中就有一人可能会出现头晕、癫痫、眼睛或肌肉抽搐。该公司建议出现这些症状的用户停止使用耳机并去看医生。\n医生此前曾警告称，虚拟现实是对真实或想象环境的计算机生成模拟，可能会导致眼睛疲劳，因为大脑被迫以不同于正常的方式处理视觉刺激。\n用户抱怨使用耳机时会感到恶心和头晕，这通常会降低用户感知周围空间的方式，从而导致晕动病。\n丹尼·比特曼(Danny Bittman)已经做了四年的虚拟现实开发人员，他认为这可能会影响他的视力。\n我三年来第一次去看眼科医生。现在我非常担心我未来的虚拟现实使用。我有一个新的眼球会聚问题，表现得像诵读困难症。医生是一位耳机拥有者，他相信这是我使用VR造成的。他在推特上写道：我们通常会给40岁的人配这种眼镜。\n他接着描述了这个问题：当我看屏幕或书之类的东西时，我的眼睛会跳起来。我一直都有一小部分这样的症状，但现在更严重了。它还与头痛和眩晕有关。\n他说，这个问题是关于长时间使用耳机的问题，并承认他每天最多可以戴6个小时的耳机，分成30分钟的疗程。\n验光师协会的Ceri Smith-Jaynes告诉BBC：目前我们没有任何可靠的证据表明虚拟现实头盔会导致儿童或成人视力永久性下降。已经有一些研究着眼于只短期使用VR头盔的影响；这些研究并没有显示视力下降。\n然而，有些人确实会出现暂时性的症状，如恶心、干涩、眼睛易怒、头痛或眼睛疲劳。&#34；\n但她确实有一些使用建议：如果你整天都呆在虚拟现实中，没有休息时间，你需要时间重新适应光线和现实世界不同的视觉环境。我建议每小时休息5到10分钟，利用这段时间四处走动，眨眼，看看窗外，或者散散步。\n一个人可以轻松忍受的耳机使用小时数取决于你的双眼视觉状态(问问你的验光师)和你在VR中所做的任务。&#34；\nVR耳机已经被改造，以帮助提高视力。初创公司GiveVision发明了一种名为SightPlus的设备，旨在通过将现实世界的视频投射到视网膜的工作部分来恢复视力，这些人的视力已经恶化到无法修复的地步。\n穆尔菲尔德眼科医院的一项临床试验表明，在60名参与者中，有59人的视力得到了改善，近一半的人表示，他们会在看电视、阅读或去剧院时佩戴这种设备。该公司正在与索尼合作开发其下一款设备。", "note_en": "A software developer has tweeted about how wearing a VR headset for hours a day has damaged his eyesight.\n A visit to the opticians left him &#34;worried about my future VR use&#34; after a doctor blamed the technology for a problem with his vision.\n Glasses should correct the issue but would normally only &#34;be prescribed to 40-year-olds&#34;, he tweeted.\n The Association of Optometrists said it had not seen evidence that VR headsets could cause permanent eye damage.\n Facebook-owned Oculus states in its handbook that one in 4,000 may suffer &#34;dizziness, seizures, eye or muscle twitching.&#34; It recommends users suffering these symptoms discontinue using the headset and see a doctor.\n  Doctors have previously warned that virtual reality, which is the computer-generated simulation of a real or imaginary environment, can cause eye strain because the brain is forced to process visual stimuli in a different way to normal.\n And users have complained about nausea and dizziness when using headsets, which is generally put down the the way a user perceives space around them, leading to motion sickness.\n Danny Bittman, who has worked as a virtual reality developer for four years, suggested it could have affected his eyesight.\n &#34;Just had my first eye doctor visit in three years. Now I&#39;m very worried about my future VR use. I have a new eye convergence problem that acts like dyslexia. The doc, a headset owner, is convinced my VR use caused this. He said &#34;these glasses we usually prescribe to 40-year-olds&#34;, he tweeted.\n  He went on to describe the problem: &#34;My eyes jump when I read things like a screen or books. I&#39;ve always had a small level of this but it&#39;s greatly intensified now. It&#39;s also linked to headaches and vertigo.&#34;\n He said that the issue was about &#34;prolonged use&#34;, and admitted that he could spend up to six hours a day wearing a headset, split into 30-minute sessions.\n Ceri Smith-Jaynes, from the Association of Optometrists, told the BBC: &#34;We currently do not have any reliable evidence that VR headsets cause permanent deterioration in eyesight in children or adults. There have been some studies looking into the effects of short-term use of VR headsets only; these did not reveal a deterioration in eyesight.\n &#34;However, some people do suffer from temporary symptoms such as nausea, dry, irritable eyes, headache or eyestrain. &#34;\n But she did have some advice about usage: &#34;If you spend all day in VR without a break, you&#39;ll need time to readjust to the light and the different visual environment of the real world. I would suggest taking a five-to-ten minute break each hour, using that time to move about, blink and look out of a window, or take a short walk.\n &#34;The number of hours of headset use a person can comfortably tolerate will vary depending on your binocular vision status (ask your optometrist) and the task you are doing in VR.&#34;\n VR headsets have been adapted to help improve eyesight. Start-up GiveVision created a device called SightPlus, that aims to restore vision to people whose eyesight has deteriorated beyond repair by projecting a video of the real world into the working part of the retina.\n A clinical trial at Moorfields Eye Hospital suggested it improved eyesight in 59 of the 60 participants, with nearly half saying they would wear the device for watching TV, reading or going to the theatre. The firm is partnering with Sony to develop its next device.", "posttime": "2020-06-11 10:17:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,警告,warns,问题", "title": "开发人员警告VR耳机损害视力", "title_en": "Developer Warns VR Headset Damaged Eyesight", "transed": 1, "url": "https://www.bbc.com/news/technology-52992675", "via": "", "real_tags": ["开发", "警告", "warns", "问题"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着时间的推移，玩游戏中使用的骰子在形状和大小上都发生了变化，并随着对公平、机会和概率的考虑而演变。\n无论是在赌场玩掷骰子，还是在家里和家人玩简单的棋盘游戏，掷骰子都会给每一场游戏带来一点机会或运气。我们希望骰子是公平的，每个数字掷出的概率都是相等的。\n但一项新的研究表明，情况并不总是如此。在罗马时代，许多骰子明显是倾斜的，不像今天的完美立方体。在中世纪早期，骰子在数字排列上通常是不平衡的，1与2相对，3与4相对，5与6相对。无论这些物体是由什么材料制成的(金属、粘土、骨头、鹿角和象牙)，也不管它们的大小或形状是否完全对称或一致，因为就像天气一样，滚动是由神或其他超自然因素预先决定的。\n加州大学戴维斯分校(University of California，Davis)人类学教授、最近一项关于骰子的研究的主要作者杰尔默·埃肯斯(Jelmer Eerkens)解释说，这一切在1450年左右开始改变，当时骰子制造者和玩家似乎意识到了这种形式会影响功能。\n一种新的世界观正在兴起--文艺复兴。伽利略和布莱斯·帕斯卡(Blaise Pascal)等人正在形成关于机会和概率的概念，我们从书面记录中知道，在某些情况下，他们实际上是在咨询赌徒，他说。我们认为骰子的使用者在游戏中也接受了关于公平、机会或概率的新想法。\nEerkens说，标准化骰子的属性，如对称性和数字的排列，可能是降低无良玩家操纵骰子改变特定掷骰子赔率的可能性的一种方法。\n骰子在考古遗址中并不常见。Eerkens说，它们通常在垃圾、居民区或墓地中发现，经常作为遗址中的孤零零的物品被发现。许多都没有准确的日期。\n在查看了荷兰各地数十个博物馆和考古仓库的数百个骰子后，埃肯斯和他的合著者、纽约美国自然历史博物馆的亚历克斯·德沃格特(Alex De Voogt)能够组装和分析一套110个仔细标注日期的立方体形状的骰子。他们的发现发表在12月的“考古学报”杂志上。\n--400年前或罗马时代制造的骰子，在形状、大小、材料和数字配置上都有很大的变化。--当骰子在1100年左右再次出现时，它们主要是质数配置，其中相反的数字与质数(1-2；3-4；5-6)相一致，这种编号方式在古代美索不达米亚和埃及也很流行。中世纪早期的骰子与他们的罗马前身相比也往往很小。\n--1450年左右，编号系统很快变成了7，对边加起来就是7(6-1；5-2；3-4)。骰子的形状也变得高度标准化，而且又变得更大了。标准化在一定程度上可能是大规模生产的副产品。\n埃肯斯说，他研究骰子是因为它们是一种方便的物品，可以将功能与风格分开，而不是考古遗址中发现的其他文物，比如用于狩猎的功能物品箭头。作为考古学家，我们研究的许多文物将这两者混为一谈。。我们知道，对于骰子来说，它们纯粹是有风格的。\nEerkens说，这项研究还表明，骰子和许多实物一样，反映了人们不断变化的世界观。\n研究人员在他们的文章中总结道，赌徒可能认为掷骰子不再是命运决定的，而是随机决定的。\n资料由加州大学戴维斯分校提供。原著：Karen Nikos-Rose。注意：内容可以根据样式和长度进行编辑。\n杰尔默·W·埃肯斯，亚历克斯·德·沃格特。三方骰子的演变。考古学报，2017年；88(1)：163doi：10.1111/j.1600-0390.2017.12182.x。\n下面是您可能感兴趣的相关文章。科学日报与TrendMD网络中的学术出版物共享链接，并根据需要从第三方广告商那里赚取收入。", "note_en": "Over time, dice used in playing games have changed in shape and size and evolved with considerations about fairness, chance and probability.\n Whether at a casino playing craps or engaging with family in a simple board game at home, rolling the dice introduces a bit of chance or &#34;luck&#34; into every game. We expect dice to be fair, where every number has equal probability of being rolled.\n    But a new study shows this was not always the case. In Roman times, many dice were visibly lopsided, unlike today&#39;s perfect cubes. And in early medieval times, dice were often &#34;unbalanced&#34; in the arrangement of numbers, where 1 appears opposite 2, 3 opposite 4, and 5 opposite 6. It did not matter what the objects were made of (metal, clay, bone, antler and ivory), or whether they were precisely symmetrical or consistent in size or shape, because, like the weather, rolls were predetermined by gods or other supernatural elements.\n  All that began to change around 1450, when dice makers and players seemingly figured out that form affected function, explained Jelmer Eerkens, University of California, Davis, professor of anthropology and the lead author of a recent study on dice.\n &#34;A new worldview was emerging -- the Renaissance. People like Galileo and Blaise Pascal were developing ideas about chance and probability, and we know from written records in some cases they were actually consulting with gamblers,&#34; he said. &#34;We think users of dice also adopted new ideas about fairness, and chance or probability in games.&#34;\n  &#34;Standardizing the attributes of a die, like symmetry and the arrangement of numbers, may have been one method to decrease the likelihood that an unscrupulous player had manipulated the dice to change the odds of a particular roll,&#34; Eerkens said.\n     Dice are not common finds in archaeological sites. They are typically found in garbage, domestic areas, or cemeteries, and frequently are recovered as lone objects in a site, Eerkens said. Many are not accurately dated.\n After looking at hundreds of dice in dozens of museums and archaeological depots across the Netherlands, Eerkens and his co-author, Alex de Voogt, of the American Museum of Natural History, New York, were able to assemble and analyze a set of 110 carefully dated, cube-shaped dice. Their findings were published in the journal  Acta Archaeologica in December.\n  -- Dice made before 400, or in Roman times, are highly variable in shape, size, material and configuration of numbers.    -- When dice reappear around 1100 they are predominantly in the &#34;primes&#34; configuration, where opposite numbers tally to prime numbers (1-2; 3-4; 5-6), a numbering style that was also popular in ancient Mesopotamia and Egypt. Early medieval dice also tend to be quite small relative to their Roman predecessors.\n     -- Around 1450 the numbering system quickly changed to &#34;sevens&#34; where opposite sides add up to seven (6-1; 5-2; 3-4). Dice also became highly standardized in shape, and also were made larger again. Standardization may be, in part, a byproduct of mass production.\n Eerkens said he studied dice because they are a convenient item in which to isolate the function from the style, as opposed to other artifacts found in archaeological sites, such as arrowheads, a functional item used for hunting. &#34;A lot of artifacts we study as archaeologists conflate the two... . We know for dice they are purely stylistic.&#34;\n The study also shows that dice, like many material objects, reflect a lot about people&#39;s changing worldviews, Eerkens said.\n  The researchers conclude in their article, &#34;Gamblers may have seen dice throws as no longer determined by fate, but instead as randomizing objects governed by chance.&#34;\n    Materials provided by   University of California - Davis. Original written by Karen Nikos-Rose.  Note: Content may be edited for style and length.\n    Jelmer W. Eerkens, Alex de Voogt.  THE EVOLUTION OF CUBIC DICE.  Acta Archaeologica, 2017; 88 (1): 163 DOI:  10.1111/j.1600-0390.2017.12182.x\n  Below are relevant articles that may interest you. ScienceDaily shares links with scholarly publications in the  TrendMD network and earns revenue from third-party advertisers, where indicated.", "posttime": "2020-06-11 10:16:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发生变化,dice,骰子", "title": "骰子如何在两千年的时间里发生变化，变得更加公平(2018年)", "title_en": "How dice changed over 2k years to be more fair (2018)", "transed": 1, "url": "https://www.sciencedaily.com/releases/2018/01/180130140246.htm", "via": "", "real_tags": ["发生变化", "dice", "骰子"]}, {"category": "", "categoryclass": "", "imagename": "232994280b26429c840ea2e0e88a1b29.jpeg", "infoid": 1006086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一篇关于一个发展中事件的帖子。我将不再遵循我早先的发帖模式。在这些困难的时刻，我会写下我得到的东西。如果你喜欢我以前写的任何一篇文章，并想帮助这个项目继续下去，请订阅下面的内容或成为patreon.com/ForwardBlog的赞助人。\n国会山自治区(CHAZ)很可能是西雅图当地社会主义者和无政府主义者的一个短暂的公共项目。但这是一堂有趣的课，讲述了如何建立社区社会，以及它们可以为一大群人带来什么好处。在对西雅图警察局进行了一周的强硬抗议后，当地无政府主义者开始在西雅图国会山地区及其周围设置路障，一旦该部门从他们的东区撤退。查兹是在西雅图警局放弃该辖区后才成立的。国会山是一个豪华的LGBTQ社区，很多年轻的城市专业人士已经在那里生活过。6月8日，他们正式宣布六个街区的半径在他们的完全控制之下，并给它起了一个新的名字，国会山自治区(CHAZ)，也就是“自由国会山”。无政府主义者用“自由国会山”这个绰号来向北爱尔兰城市德里的博格赛德社区竖立的“自由德里”招牌致敬，德里在动乱期间成为一座四面楚歌的城市。当你考虑到在短短两周内，三个不同的警区要么被废弃，要么被烧毁(明尼阿波利斯2个，西雅图1个)，这些发展是令人惊讶的。我们在美国以前从未见过这种情况，它确实表明，通过数字和坚定的决心可以实现什么。现在，很明显，我们的目标不是接管警察局，而是取消对各部门的资助，并试图从头开始重建警察。有些人可能会遵循“改革”的路线，但这个国家的无政府主义者和社会主义者知道的远不止这些。CHAZ是当地的一项实验，但值得借鉴，在一个不人道的时代，它是一股新鲜的空气。\n6月7日，西雅图市长珍妮·杜尔坎(Jenny Durkan)宣布，今后不能再使用催泪瓦斯，只能使用缓和局势的技术。那天晚上和6月8日晚上，她的部门决定无论如何都要使用催泪瓦斯，因为像这个国家的大多数市长一样，他们无法控制他们野蛮和不负责任的警察部门。6月8日深夜，催泪瓦斯充斥国会山地区整条街道的视频浮出水面。这段视频在网上疯传，但没有走红的是西雅图警察局在深夜进行的战术撤退，以及随后当地无政府主义者和社会主义者在该地区获得的完全控制权。到6月9日早上，六个街区的半径已经完全在他们的控制之下。人们设置了路障，竖起了标语，艺术家们进来在社区打上了他们的印记。至于内部治理，当然没有。这是一个非中央集权治理的实验，作为一个事实上的无政府主义地区运作。它可能与丹麦哥本哈根克里斯汀斯哈文区的弗里敦克里斯蒂安尼亚最为相似，弗里敦克里斯蒂安尼亚是一个有意设立的公社。\n废弃的警察局旁边搭起了帐篷，当地医务人员、艺术家、公务员和餐馆老板纷纷涌入该地区，以提供他们的服务。据估计，目前约有200名居民占领了查兹，他们来自西雅图全市。6月9日，他们成立了“无警察合作社”，免费发放水、洗手液、零食、口罩和烤肉串。一个十字路口被封锁，以提供“讲解”，基本上就是关于如何经营合作社和如何建立有效的公社的讲演。其他演讲者教育人们警察的暴行和向前推进的抗议策略。一个带有大投影仪的大屏幕户外电影院被设置起来，西雅图交通部捐赠了移动厕所。此外，正在制作自制的防暴盾牌，并分发给公社的每个人。展望未来，当地的分区居民也希望建立一场能够蔓延到西北地区的有凝聚力的劳工运动。像CODEPINK这样的全国性组织支持公社声明“警察才是真正的煽动者”。查兹的当地积极分子决定用一把粉色的雨伞作为他们的象征，以表示与香港人的团结，这些人的技术被世界各地的抗议者效仿。正如前面提到的，街头医务人员已经淹没了该地区，并发挥了重要作用。他们中的许多人都受过大学教育，有在抗议期间在现场工作的经验。他们还建造了医疗帐篷，以应对未来肯定会与警方发生的冲突。\n6月9日，查兹代表发布了一份由该地区许多集体声音提出的要求清单。其中大多数都是非常现实的，如果西雅图真的有代表的话，就可以实现。", "note_en": "This is a post about a developing event. I will no longer be following my earlier model of posting. I will write what comes to me during these difficult times. If you like any of my past writings and want to help keep this project going, please subscribe below or become a patron at  patreon.com/ForwardBlog\n   The Capitol Hill Autonomous Zone (CHAZ) will most likely be a short lived communal project of local socialists and anarchists in Seattle. But it’s fascinating lesson in how to build communal societies and what benefits they can provide to a large group of people. After a week of tough protesting against the Seattle PD, local anarchists began to create roadblocks in and around the Capitol Hill area of Seattle once the department retreated from their East Precinct. CHAZ was established only after the Seattle PD abandoned that precinct. Capitol Hill is a posh, LGBTQ community where a lot of younger urban professionals already lived. On June 8th, they officially declared a six block radius under their complete control and gave it a new name, The Capitol Hill Autonomous Zone (CHAZ), aka “Free Capitol Hill.” Anarchists used the moniker “Free Capitol Hill” in homage to the “Free Derry” sign erected in the Bogside neighborhood of the Northern Ireland city of Derry, which became an embattled city during the Troubles. These developments are amazing when you consider that in just two weeks, three different police precincts were either abandoned or burned down (2 in Minneapolis, 1 in Seattle). We’ve never seen this before in America and it does signal what can be possible through numbers and sheer determination. Now, obviously the goal is not to take over police stations, but to defund departments and attempt to rebuild policing from the ground up. Some may toe the line of “reform” but anarchists and socialists in this country know that much more than that is needed. CHAZ is a local experiment, but one worth taking lessons from and it’s a breath of fresh air during a time of inhumanity.\n      On June 7, the mayor of Seattle, Jenny Durkan announced that no more tear gas can be used and only de-escalation techniques going forward. That night and the night of June 8th, her department decided to use tear gas anyway because like most mayors in the country, they have no control of their brutish and unaccountable police departments. Video surfaced late on the night of June 8th of tear gas filling an entire street in the Capitol Hill district. This video went viral, but what didn’t go viral was the Seattle PD’s tactical retreat that happened later in the night and the subsequent complete control that was gained in the district by local anarchists and socialists. By the morning of June 9th, that six block radius was in their complete control. Roadblocks were erected, signs were put up and artists came in to put their stamp on the community. As far as internal governance goes, there is none of course. It’s an experiment in de-centralized governance operating as a  de facto anarchist region. It’s probably most similar to Freetown Christiania which is an intentional commune in the borough of Christianshavn in the city of Copenhagen, Denmark.\n      Tents have been pitched next to the abandoned police station and local medics, artists, civil servants and restauranteurs have flooded the zone in order to provide their services. It’s estimated that about 200 residents are currently occupying CHAZ and have come from all over the city of Seattle. On June 9th, they established the “No Cop Co-op”, which hands out free water, hand sanitizer, snacks, masks and kebabs. An intersection was cordoned off to provide “teach-ins” which are basically soapbox lectures on how to run a co-op and how to build effective communes. Other speakers educate people on police brutality and protesting tactics moving forward. A large screen outdoor cinema was set up with a large projector and portable toilets were donated from the Seattle Transportation Department. Additionally, homemade riot shields are being made and distributed to everyone in the commune. Going forward, local zoners also hope to build a cohesive labor movement that can spread across the Northwest. National  organizations like CODEPINK support the commune stating “police are the real instigators.” Local activists in CHAZ have decided to use a pink umbrella as their symbol to show solidarity with those in Hong Kong whose techniques have been copied by protestors all over the world. As mentioned earlier, street medics have flooded the zone and play a major role. Many of them are college educated and have experience being in the field during protests. They also have created medic tents in order to deal with the future conflicts that they will surely have with the police.\n      On June 9th, CHAZ representatives  released a list of demands that were authored by many of the collective voices in the zone. Most of them are extremely realistic and can be accomplished if Seattle actually had a representative government instead of one that works for Amazon. The list of demands falls under four categories: economics, education, the justice system and health and human services. The authors stated further that the zone was on land taken from the local Native American Duwamish people over a century ago. The Pacific Northwest has a long history with native tribes and the collective voices of the zone realize that. Additionally, they have requested no violence be used in attempts to remove the zoners and that they be allowed to operate in a communal structure in order to “show the country what is possible through collective voices.” CHAZ has been praised by the IWW’s  Industrial Worker publication as an effective way to distribute badly needed social services. The irony behind the creation of CHAZ is that austerity measures have been put in many American cities since the CARES bailout back in March. This is expected during crises and it’s not acceptable to those not just in CHAZ but protesting within the BLM movement. Austerity has been a prime focus during these protests because while police departments across the country see their budgets increase every year, every other line item of public services continue to be cut. Anarchists in the zone realize they need to do more planning going forward. They have already began deputizing scouts and are working on expanding their perimeter even more. Smoking areas have been designated and local marijuana growers have flooded the zone to provide free marijuana. The anti-capitalist views of the inhabitants will create an atmosphere of brainstorming that will only serve the commune for the better going forward. As an example of this, many have began talking about black-owned banks, divesting from local corporations and prison reform. Local activists even gave a soapbox speech  criticizing the American Legislative Exchange Council (ALEC), and how their representatives in conservative state legislatures write laws without “any clue” as to who they represent. The opportunity is there to create a flourishing commune in a short term project that will ultimately likely be destroyed at some point. The main goal is to provide a glimpse for Americans what can be possible though communal action when you operate outside of the system of government that many Americans take for granted. This is not a country that is used to communal action and most citizens probably don’t even know the definition of a co-op. Kshama Sawant is a Seattle City Council member and member of the Trotskyist Socialist Alternative Party (SA). She visited the zone on June 9th and asked the residents to turn it into a community center for restorative justice. She agreed that there needs to be long term goals and that the method of going beyond policing (police abolition) needs to be analyzed and discoursed in the mainstream. Sawant did suggest caution though on pushing the city too far. She, along with the residents want to avoid future violence if the police do eventually move in to tear down the commune. The development of CHAZ is a real time education in community organizing and anarchist alternatives. Amazon and Boeing weren’t going to provide the people of Seattle with basic life necessities. Those in CHAZ hope they can demonstrate that social services can be provided in a vacuum. They have stated they will continue to build the commune and will continue until they are forced out. Long live the commune!", "posttime": "2020-06-11 10:16:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "来到,hill,西雅图", "title": "欢迎来到国会山自治区(CHAZ)", "title_en": "Welcome to the Capitol Hill Autonomous Zone (CHAZ)", "transed": 1, "url": "https://forwardblog.substack.com/p/welcome-to-the-capitol-hill-autonomous?r=5iwv9&utm_campaign=post&utm_medium=web&utm_source=hackernews", "via": "", "real_tags": ["来到", "hill", "西雅图"]}]