[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1072609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当您在自然保护区工作时，每天都有不同的，但没有任何内容可以在卢特兰水自然保护区举行的储备团队在他们使古绿语发现一生中的一天。", "note_en": "Every day is different when you work on a nature reserve, but nothing could have prepared our reserves team at Rutland Water Nature Reserve for the day when they made the palaeontological discovery of a lifetime.", "posttime": "2022-01-10 19:27:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英国,largest,自然保护区", "title": "英国最大的“海龙”在英国最小的县发现", "title_en": "Britain's largest 'Sea Dragon' discovered in UK's smallest county", "transed": 1, "url": "https://www.lrwt.org.uk/seadragon", "via": "", "real_tags": ["英国", "largest", "自然保护区"]}, {"category": "", "categoryclass": "", "imagename": "99b914602dae1449ee970d836ee480ad.jpeg", "infoid": 1072608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近两年，我们有 - 新闻界和人口 - 当局的每日冠状动脉几乎催眠。\n换句话说，这里有一些不值得“超级”一词。无论是疫苗，医院还是它的混合，每个人的出价都是。但潮力人士与人口的沟通通常应该不应该“超级”一词。相反。", "note_en": "I NÆSTEN to år har vi – pressen og befolkningen – været nærmest hypnotisk optagede af myndighedernes daglige coronatal.\n VI HAR STIRRET på tal-pendulets svingninger, når det gjaldt smittede, indlagte og døde med corona. Og vi har fået betydningen af pendulets mindste bevægelser udlagt af eksperter, politikere og myndigheder, som konstant har advaret os om det slumrende corona-monster under vores senge. Et monster, der bare venter på, at vi falder i søvn, så det kan slå til i nattens mulm og mørke.\n DET KONSTANTE mentale alarmberedskab har slidt enormt på os alle sammen. Derfor må vi – pressen – også gøre status over vores egen indsats. Og vi har fejlet.\n  VI HAR IKKE været vakse nok ved havelågen, når myndighederne skulle afkræves svar på, hvad det konkret betød, at folk er indlagt med corona og ikke på grund af corona. For det gør en forskel. En stor forskel. Helt præcist har de officielle indlæggelsestal vist sig at være 27 procent højere end det reelle tal for, hvor mange der er på sygehuset, alene fordi de har corona. Det ved vi først nu.\n DET ER SELVFØLGELIG først og fremmest myndighederne, der har ansvaret for at oplyse befolkningen korrekt, præcist og ærligt. Tallene for, hvor mange der er syge og døde af corona, skulle af indlysende grunde have været offentliggjort for længst, så vi fik det klareste billede af monstret under sengen.\n I DET HELE TAGET lader myndighedernes og politikernes beskeder til befolkningen i denne historiske krise meget tilbage at ønske. Og derfor ligger de, som de har redt, når dele af befolkningen mister tillid til dem.\n ET ANDET eksempel: Vaccinerne bliver konsekvent omtalt som vores ’supervåben’. Og vores sygehuse kaldes ’supersygehuse’. Ikke desto mindre er disse supersygehuse åbenbart maksimalt pressede, selvom næsten hele befolkningen er bevæbnet med et supervåben. Selv børn er vaccineret i enormt omfang, hvilket man ikke har gjort i vore nabolande.\n DER ER MED ANDRE ord et eller andet her, der ikke fortjener betegnelsen ’super’. Om det er vaccinerne, sygehusene eller en blanding af det hele, er hver mands bud. Men magthavernes kommunikation til befolkningen fortjener i hvert fald på ingen måde betegnelsen ’super’. Tværtimod.", "posttime": "2022-01-10 19:25:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,danish,人口", "title": "主要丹麦报纸仅为政府Covid叙述道歉", "title_en": "Major Danish newspaper apologises for only covering government Covid narrative", "transed": 1, "url": "https://ekstrabladet.dk/nyheder/lederen/vi-fejlede/9072013", "via": "", "real_tags": ["covid", "danish", "人口"]}, {"category": "", "categoryclass": "", "imagename": "ab8f4a70a3515e6d7e1f429e370f003e.jpg", "infoid": 1072607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "采矿比特币是植物上最有利可图的业务之一 - 但它也消耗了太多的能源，以便不断增长的国家名单。", "note_en": "Mining Bitcoin is one of the most profitable businesses on the plant—but it also consumes too much energy for a growing list of nations.", "posttime": "2022-01-10 19:24:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,采矿,mining,业务", "title": "比特币采矿正在全球各国被禁止", "title_en": "Bitcoin mining is being banned in countries across the globe", "transed": 1, "url": "https://fortune.com/2022/01/05/crypto-blackouts-bitcoin-mining-bans-kosovo-iran-kazakhstan-iceland/", "via": "", "real_tags": ["比特币", "采矿", "mining", "业务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "律师说，维尔纽斯黑色网站允许酷刑的薪酬拨款表明，律师说\n“当您向某人和全世界支付100,000欧元时，Zubaydah Zubaydah的法律团队之一向监护人表示，当您支付10万欧元的情况时，情况较少。\n欧洲法官听说Zubaydah在立陶宛时不太可能遭受最严重的酷刑形式。但他受到仍然酷刑的技术，律师争论，包括感官和睡眠剥夺，单独监禁，大声噪音和苛刻的光线。", "note_en": "Compensation for allowing torture at Vilnius black site indicates changing attitudes in Washington, lawyers say\n    Lithuania has paid more than $110,000 to Abu Zubaydah, the Guantánamo detainee  known as the “forever prisoner”, in compensation for having allowed the CIA to hold him at a secret site outside Vilnius where he was subjected to forms of torture.\n   The €100,000 ($113,500) payment comes more than three years after the European Court of Human Rights  ordered the Lithuanian government to pay compensation for violating European laws banning the use of torture.\n It marks a significant shift in the treatment of Zubaydah, who has been detained by the US without charge for more than 20 years.\n Zubaydah was captured in Pakistan six months after 9/11. The  CIA and lawyers for the Bush administration attempted to justify his torture by claiming he was a very senior figure in al-Qaida. It emerged that he was not a member of the organisation and he has never been charged with involvement in 9/11.\n For much of the time since his arrest, Zubaydah has been held incommunicado, at the insistence of the CIA as part of its efforts to prevent details of his torture from becoming public.\n Lawyers for Zubaydah believe it is highly unlikely that  Lithuania would have made the compensation payment without approval from Washington.\n “The situation is a lot less incommunicado when you pay €100,000 to someone and the whole world knows about it,” Mark Denbeaux, one of Zubaydah’s legal team based in the US, told the Guardian.\n  “This move is consistent with the idea that the US is softening its position on the detention of the forever prisoners. The US could clearly have kept Lithuania from handing over this money and the question is, why didn’t they?”\n News of the Lithuanian payment comes just days before the 20th anniversary of the military prison at Guantánamo, which  received its first detainees on 11 January 2002. In recent months there have been other signs of a shifting attitude towards Zubaydah and the torture that was inflicted upon him by CIA agents and contractors.\n In October, the US supreme court  heard arguments in a case in which the US government is seeking to block two CIA contractors from testifying in Poland about torture Zubaydah suffered in 2002 and 2003 at a secret or “black” site in that country. In the course of the hearing, several of the justices, including conservatives, broke a legal taboo by  openly using the word “torture”.\n In Zubaydah’s case against Lithuania, which was led on the European side by his lawyer Helen Duffy, the European Court of Human Rights  heard that Zubaydah was held at a CIA black site in that country from February 2005 to March 2006. The site, codenamed Violet, was on the outskirts of Vilnius.\n The most brutal forms of torture endured by Zubaydah occurred in 2002 when he was held at a CIA black site in Thailand. An entire program of torture, euphemistically referred to by the CIA as “enhanced interrogation techniques”, was devised for the prisoner by two psychologists under contract to the agency.\n  Zubaydah was waterboarded – a type of controlled drowning – at least 83 times in August 2002, as well as being placed in a coffin-sized box for days on end.\n European judges heard that Zubaydah was unlikely to have suffered from the harshest forms of torture while in Lithuania. But he was subjected to techniques that still amounted to torture, lawyers argued, including sensory and sleep deprivation, solitary confinement, loud noise and harsh light.\n The money transferred by Lithuania is now in a bank account. Zubaydah is unable to receive the sum given his detention in Guantánamo and because his assets have been frozen by the US treasury.\n A similar freezing of his assets by the United Nations security council was reversed two years ago, after a petition by his lawyers.", "posttime": "2022-01-10 19:24:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "abu,pays,zubaydah", "title": "立陶宛支付Guanteránamo永远囚犯Abu Zubaydah€100000在CIA酷刑", "title_en": "Lithuania pays Guantánamo forever prisoner Abu Zubaydah €100000 over CIA torture", "transed": 1, "url": "https://www.theguardian.com/us-news/2022/jan/10/lithuania-pays-guantanamo-forever-prisoner-abu-zubaydah-100000-cia-torture", "via": "", "real_tags": ["abu", "pays", "zubaydah"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我Saac Newton Apocryphally发现了他的第二律 - 关于引力的一个 - 在苹果摔倒在他的脑袋之后。稍后的实验和数据分析，他意识到了力量，质量和加速之间存在基本关系。他制定了一个理论来描述这种关系 - 可以表达为等式的关系，f = ma  - 并用它来预测苹果以外的物体的行为。他的预测结果是对的（如果并不总是足够精确，因为那些稍后的人）。\n第二个是人类对无理论科学来说非常不舒服。我们不喜欢处理黑匣子 - 我们想知道为什么。\n普林斯顿心理学家在现有理论中延伸仍然可以解释的是可解释的。但随着他们揭示越来越复杂的，它将变得更少 - 这一过程的逻辑高潮是Facebook或alphafold体现的无论是无论无论是无论如何的预测发动机。\nAi Sumit Chopra是一个考虑机器学习在纽约大学的医疗保健的科学家，给出了MRI图像的例子。它需要很多原始数据 - 因此扫描时间 - 产生这样的图像，这不一定是您的目标是准确检测，例如癌症的最佳使用该数据。您可以培训AI以确定原始数据的较小部分足以产生准确的诊断，而是通过其他方法验证，并且实际上是Chopra的组已经这样做。但放射科医生和患者仍然依赖于图像。 “我们人类更舒适地对我们的眼睛可以解释的2D形象，”他说。", "note_en": "I saac Newton apocryphally discovered his second law – the one about gravity – after an apple fell on his head. Much experimentation and data analysis later, he realised there was a fundamental relationship between force, mass and acceleration. He formulated a theory to describe that relationship – one that could be expressed as an equation, F=ma – and used it to predict the behaviour of objects other than apples. His predictions turned out to be right (if not always precise enough for those who came later).\n Contrast how science is increasingly done today. Facebook’s  machine learning tools predict your preferences better than any psychologist. AlphaFold, a program built by DeepMind, has produced the most  accurate predictions yet of protein structures based on the amino acids they contain. Both are completely silent on why they work: why you prefer this or that information; why this sequence generates that structure.\n   You can’t lift a curtain and peer into the mechanism. They offer up no explanation, no set of rules for converting this into that – no theory, in a word. They just work and do so well. We witness the social effects of Facebook’s predictions daily. AlphaFold has yet to make its impact felt, but  many are convinced it will change medicine.\n Somewhere between Newton and Mark Zuckerberg, theory took a back seat. In 2008, Chris Anderson, the then editor-in-chief of  Wired magazine,  predicted its demise. So much data had accumulated, he argued, and computers were already so much better than us at finding relationships within it, that our theories were being exposed for what they were – oversimplifications of reality. Soon, the old scientific method – hypothesise, predict, test – would be relegated to the dustbin of history. We’d stop looking for the causes of things and be satisfied with correlations.\n  With the benefit of hindsight, we can say that what Anderson saw is true (he wasn’t alone). The complexity that this wealth of data has revealed to us cannot be captured by theory as traditionally understood. “We have leapfrogged over our ability to even write the theories that are going to be useful for description,” says computational neuroscientist Peter Dayan, director of the Max Planck Institute for Biological Cybernetics in Tübingen, Germany. “We don’t even know what they would look like.”\n But Anderson’s prediction of the end of theory looks to have been premature – or maybe his thesis was itself an oversimplification. There are several reasons why theory refuses to die, despite the successes of such theory-free prediction engines as  Facebook and AlphaFold. All are illuminating, because they force us to ask: what’s the best way to acquire knowledge and where does science go from here?\n The first reason is that we’ve realised that artificial intelligences (AIs), particularly a form of machine learning called neural networks, which learn from data without having to be fed explicit instructions, are themselves fallible. Think of the prejudice that has been documented in  Google’s search engines and  Amazon’s hiring tools.\n The second is that humans turn out to be deeply uncomfortable with theory-free science. We don’t like dealing with a black box – we want to know  why.\n And third, there may still be plenty of theory of the traditional kind – that is, graspable by humans – that usefully explains much but has yet to be uncovered.\n So theory isn’t dead, yet, but it is changing – perhaps beyond recognition. “The theories that make sense when you have huge amounts of data look quite different from those that make sense when you have small amounts,” says Tom Griffiths, a psychologist at Princeton University.\n Griffiths has been using neural nets to help him improve on existing theories in his domain, which is human decision-making. A popular theory of how people make decisions when economic risk is involved is prospect theory, which was formulated by behavioural economists Daniel Kahneman and Amos Tversky in the 1970s (it later won Kahneman a Nobel prize). The idea at its core is that people are sometimes, but not always, rational.\n  In  Science last June,  Griffiths’s group described how they trained a neural net on a vast dataset of decisions people took in 10,000 risky choice scenarios, then compared how accurately it predicted further decisions with respect to prospect theory. They found that prospect theory did pretty well, but the neural net showed its worth in highlighting where the theory broke down, that is, where its predictions failed.\n These counter-examples were highly informative, Griffiths says, because they revealed more of the complexity that exists in real life. For example, humans are constantly weighing up probabilities based on incoming information, as prospect theory describes. But when there are too many competing probabilities for the brain to compute, they might switch to a different strategy – being guided by a rule of thumb, say – and a stockbroker’s rule of thumb might not be the same as that of a teenage  bitcoin trader, since it is drawn from different experiences.\n “We’re basically using the machine learning system to identify those cases where we’re seeing something that’s inconsistent with our theory,” Griffiths says. The bigger the dataset, the more inconsistencies the AI learns. The end result is not a theory in the traditional sense of a precise claim about how people make decisions, but a set of claims that is subject to certain constraints. A way to picture it might be as a branching tree of “if… then”-type rules, which is difficult to describe mathematically, let alone in words.\n  What the Princeton psychologists are discovering is still just about explainable, by extension from existing theories. But as they reveal more and more complexity, it will become less so – the logical culmination of that process being the theory-free predictive engines embodied by Facebook or AlphaFold.\n Some scientists are comfortable with that, even eager for it. When voice recognition software pioneer Frederick Jelinek said: “Every time I fire a linguist, the performance of the speech recogniser goes up,” he meant that theory was holding back progress – and that was in the 1980s.\n Or take protein structures. A protein’s function is largely determined by its structure, so if you want to design a drug that blocks or enhances a given protein’s action, you need to know its structure. AlphaFold was trained on structures that were derived experimentally, using techniques such as X-ray crystallography and at the moment its predictions are considered more reliable for proteins where there is some experimental data available than for those where there is none. But its reliability is improving all the time, says Janet Thornton, former director of the EMBL European Bioinformatics Institute (EMBL-EBI) near Cambridge, and it isn’t the lack of a theory that will stop drug designers using it. “What AlphaFold does is also discovery,” she says, “and it will only improve our understanding of life and therapeutics.”\n  Others are distinctly less comfortable with where science is heading. Critics point out, for example, that neural nets can throw up spurious correlations, especially if the datasets they are trained on are small. And all datasets are biased, because scientists don’t collect data evenly or neutrally, but always with certain hypotheses or assumptions in mind, assumptions that worked their way damagingly into Google’s and Amazon’s AIs. As philosopher of science Sabina Leonelli of the University of Exeter explains: “The data landscape we’re using is incredibly skewed.”\n But while these problems certainly exist, Dayan doesn’t think they’re insurmountable. He points out that humans are biased too and, unlike AIs, “in ways that are very hard to interrogate or correct”. Ultimately, if a theory produces less reliable predictions than an AI, it will be hard to argue that the machine is the more biased of the two.\n A tougher obstacle to the new science may be our human need to explain the world – to talk in terms of cause and effect. In 2019, neuroscientists Bingni Brunton and Michael Beyeler of the University of Washington, Seattle,  wrote that this need for interpretability may have prevented scientists from making novel insights about the brain, of the kind that only emerges from large datasets. But they also sympathised. If those insights are to be translated into useful things such as drugs and devices, they wrote, “it is imperative that computational models yield insights that are explainable to, and trusted by, clinicians, end-users and industry”.\n “ Explainable AI”, which addresses how to bridge the interpretability gap, has become a hot topic. But that gap is only set to widen and we might instead be faced with a trade-off: how much predictability are we willing to give up for interpretability?\n Sumit Chopra, an AI scientist who thinks about the application of machine learning to healthcare at New York University, gives the example of an MRI image. It takes a lot of raw data – and hence scanning time – to produce such an image, which isn’t necessarily the best use of that data if your goal is to accurately detect, say, cancer. You could train an AI to identify what smaller portion of the raw data is sufficient to produce an accurate diagnosis, as validated by other methods, and indeed Chopra’s group has  done so. But radiologists and patients remain wedded to the image. “We humans are more comfortable with a 2D image that our eyes can interpret,” he says.\n  The final objection to post-theory science is that there is likely to be useful old-style theory – that is, generalisations extracted from discrete examples – that remains to be discovered and only humans can do that because it requires intuition. In other words, it requires a kind of instinctive homing in on those properties of the examples that are relevant to the general rule. One reason we consider Newton brilliant is that in order to come up with his second law he had to ignore some data. He had to imagine, for example, that things were falling in a vacuum, free of the interfering effects of air resistance.\n In  Nature last month, mathematician Christian Stump, of Ruhr University Bochum in Germany,  called this intuitive step “the core of the creative process”. But the reason he was writing about it was to say that for the first time, an AI had pulled it off. DeepMind had built a machine-learning program that had prompted mathematicians towards new insights – new generalisations – in the mathematics of knots.\n In 2022, therefore, there is almost no stage of the scientific process where AI hasn’t left its footprint. And the more we draw it into our quest for knowledge, the more it changes that quest. We’ll have to learn to live with that, but we can reassure ourselves about one thing: we’re still asking the questions. As Pablo Picasso put it in the 1960s, “computers are useless. They can only give you answers.”", "posttime": "2022-01-10 19:22:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "目睹,dawn,预测", "title": "我们是否目睹了理论后科学的曙光？", "title_en": "Are we witnessing the dawn of post-theory science?", "transed": 1, "url": "https://www.theguardian.com/technology/2022/jan/09/are-we-witnessing-the-dawn-of-post-theory-science", "via": "", "real_tags": ["目睹", "dawn", "预测"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专家谨慎，国防部的保障措施不会走得得足够远，而且我们在我们所知道的东西上落后于球\n1995年俄克拉荷马城市轰炸造成168人，650多人受伤650岁时，当一份早晨的前军士兵蒂莫西·麦克风和连贯的人泰科尔斯停放了一个租赁卡车，里面装满了美联机外的自制炸药并引爆了。它仍然是美国历史中最致命的国内恐怖主义行为。两名男子题联反政府和种族主义者的信念。\n2018年海洋兰斯兰氏兰斯法利斯瓦西奥·巴斯托斯在2017年夏洛斯维尔的人民袭击人民“团结”反弹之后被监禁。在吹牛与其他atomwaffen成员的聊天中吹牛之后，发现手枪的是Neo-Nazi Group Atomwaffen，最终泄露。\n“严重地？你想和一个股票的家伙一起散步，kkk的成员？这真的是我们想在这里做什么吗？“伊顿说。 “服务成员的想法必须靠近卡片携带骄傲的男孩的成员，只要他们不'3月”，那就是没有得到它。“他加了。\n金匠看到反民主党，白色至高无上的和法西斯主义者，以与国外对手的原因相同。 “退伍军人是一个经济上有效的竞选目标，因为如果你得到一个，他们经常带他们直接的社交圈，”金匠说。", "note_en": "Experts caution the defense department’s safeguards don’t go far enough and that ‘we’re behind the ball on what we know’\n    Fears are growing among experts, politicians, and former generals about the rise of rightwing extremism in the  US military and the potential threat it could pose to American democracy.\n Even as the US Department of Defense issues new policies to root out extremism in its ranks, some experts caution that the safeguards don’t go far enough, leaving the next election vulnerable to attack as well as fears about a broader violent “insurgency” by rightwing radicals.\n   “We’re behind the ball on what we know about domestic terrorists in the United States,” Paul Eaton, a retired US army major general and senior adviser to the non-profit VoteVets, said.\n Eaton and two other retired army generals recently wrote an op-ed in the Washington Post last month warning of the threat of a coup in the 2024 election. The generals warned that it could succeed with the aid of rogue military elements. They contemplated the possibility of a breakdown of the chain of command, along partisan lines, in the aftermath of a contested election with “rogue units organizing among themselves to support the ‘rightful’ commander in chief”.\n Eaton said in an interview that the American military and law enforcement have a history of underestimating the threat from the far right.\n “It’s the Timothy McVeigh problem: what did we know about McVeigh and what were we doing about it?” said Eaton.\n The 1995 Oklahoma City bombing killed 168 people and injured over 650 when one morning ex-army soldiers Timothy McVeigh and co-conspirator Terry Nichols parked a rental truck filled with homemade explosives outside a federal building and detonated it. It remains the deadliest act of domestic terrorism in US history. The two men harbored anti-government and racists beliefs.\n “The McVeighs of the world are still there, we had about 4,500 of them crawling all over the nation’s capitol [during the 6 January attack],” said Eaton, who added that the increased power of the internet and rise of social media had boosted the threat massively since McVeigh’s attack.\n  “The infection of extremism into our state and local police and our armed forces is a very serious concern that needs to be monitored,” said Eaton.\n Eaton added: “There’s a recruiting effort going on locally, they’re going to school boards, like missionaries sent to the islands to convert people. The Proud Boys and Oath Keepers are definitely recruiting.””\n In many ways the aftermath of the attack on the Capitol in Washington DC laid bare the vulnerability of US service members to extremism. The  727 defendants charged in the 6 January Capitol riot include  81 with ties to the military, while five were active duty service members. A 35-year-old woman, air force veteran Ashli Babbitt, was fatally shot while attempting to break the doors into the House chamber.\n The appeal of extremism among active duty and veterans is a longstanding issue with a track record of violent incidents.\n Last year army  private Ethan Phelan Melzer confessed to prosecutors in the southern district of New York to plotting an attack on fellow soldiers in his unit. The federal indictment states that Melzer confessed to sharing sensitive information about his soon-to-deploy unit with members of a neo-Nazi group in order to facilitate an attack that would “result in the deaths of as many of his fellow service members as possible”.\n In 2018 marine lance corporal Vasillios Pistolis was imprisoned after assaulting people at the 2017 Charlottesville “Unite The Right” rally. Pistolis was discovered to belong the neo-Nazi group Atomwaffen after bragging about violence in  chats with other Atomwaffen members, which were eventually leaked.\n From 1990 to July 2021 there have been at least 354 people with military backgrounds that have committed criminal acts motivated by “political, economic, social, or religious goals” according to data collected by  the National Consortium for the Study of Terrorism and Responses to Terrorism at the University of Maryland.\n The data suggest the problem is growing in the US as from 1990-2010 there was an average of six cases a year, but over the last decade “that number has more than tripled to nearly 21 subjects per year”.\n  The generals’ public call for elections safeguards in the military comes as the Pentagon issued new guidelines aimed at rooting out extremism in its ranks. The defense chief, Lloyd Austin, ordered a 60-day “stand down” early last year to come up with rules to stomp out extremism among the military’s various branches. The new rules adopted by the Pentagon last month specify that service members are prohibited from engaging in extremist activities and could face disciplinary action for even “liking” extremist content on social media.\n The new guidance specifies that commanders must not be “indifferent” and hold service members who participate in extremist activity accountable. The Pentagon defines extremism as advocacy for violence to achieve goals that are “political, religious, discriminatory, or ideological in nature”. It includes efforts to overthrow the government and advocating widespread unlawful discrimination “based on race, color, national origin, religion, sex (including pregnancy), gender identity, or sexual orientation”.\n Bu the Pentagon’s effort towards stomping out extremism in the military may not go far enough. An  Associated Press investigation found the new guidelines fail to account for racism among the ranks, membership in groups such as the KKK, and longstanding racial disparities in military justice.\n The new guidelines don’t prohibit membership in extremist groups like the KKK as long as they are not “actively participating”. The new rules attempt to police acts rather than associations or beliefs. Some former military figures say it’s absurd to allow service members to also be members of violent extremist groups.\n “Seriously? You want to be in a foxhole with a guy whose a member of the KKK? Is that really what we want to do here?” said Eaton. “The idea of service members having to be in close proximity to card carrying members of the Proud Boys, as long as they don’t ‘march’, that just doesn’t get it.” he added.\n Some experts also criticize the approach as ignoring the very real threat of white supremacists. “It reflects the institutional bias that permeates all of our government, that even calling out white supremacy is politically fraught,” said Mike German, a former FBI special agent and current Fellow at the Brennan Center for Justice.\n German is concerned the classification has the potential for unintended consequences. “It opens the door to a strange political ‘both sides-ism’,” he said. “The consequence is that somebody expressing anti-racism can be seen as an extremist under that description.”\n Experts see the far-right and other extremists as actively trying to recruit members of the military, including foreign agents seeking to promote disruption within the US.\n “We’re in the early stages of an insurgency in the Untied States,” said Kristofer Goldsmith, an Iraq war veteran and researcher.\n In a 200-page report published by Vietnam Veterans of America, Goldsmith found that between 2017 and 2019 foreign entities, such as Russian hackers, “coordinated online targeting of American service members, veterans, and their families” in an effort to disrupt American democracy.\n “We found 10 different ways foreign entities were targeting veterans online,” said Goldsmith, including through ads, fake veteran accounts that sent friend request to other veterans in order to penetrate the “relatively small community of veteran advocates, and found large social media pages run by foreign admins that spread disinflation tailored to veterans in a effort to influence the election”.\n Goldsmith sees anti-democratic, white supremacist and fascists movements targeting veterans for the same reason as foreign adversaries. “Veterans are an economically efficient target for campaigns, because if you get one, they often bring their immediate social circle with them,” said Goldsmith.\n Goldsmith warns that the coming election is vulnerable to a rising insurgency. “We saw a violent insurrection, we did not experience a peaceful transfer of power. It was an attempted coup. Every failed coup is just practice for the next one,” said Goldsmith.", "posttime": "2022-01-10 19:22:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,军队,rightwing,成员", "title": "美国军队的右翼极端主义的崛起引起了对民主的恐惧", "title_en": "Rise of rightwing extremism in US military sparks fears over democracy", "transed": 1, "url": "https://www.theguardian.com/us-news/2022/jan/10/us-military-rightwing-extremism-american-democracy", "via": "", "real_tags": ["美国", "军队", "rightwing", "成员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072603, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器将很快重定向到所要求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2022-01-10 18:29:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免疫,autoimmune", "title": "新手自身免疫现象后Covid-19疫苗接种", "title_en": "New‐onset autoimmune phenomena post‐Covid‐19 vaccination", "transed": 1, "url": "https://onlinelibrary.wiley.com/doi/10.1111/imm.13443", "via": "", "real_tags": ["免疫"]}, {"category": "", "categoryclass": "", "imagename": "3a941f6e6c28b6fd14f4190e981fd9c2.jpg", "infoid": 1072602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过避免常见的错误，从右脚右脚开始你的自由职业者业务。\n花一些时间来弄清楚。对我来说，我使用咨询作为另一个收入流。截至本文，我的大多数收入来自咨询工作和销售软件开发人员相关课程的混合，但并不总是这样。\n他们关心你为自己的生活增加了多少价值。这可能是如何帮助他们解决问题的方式，或者使其金钱。他们不在乎2年前，你为Acme融入了一个网站。\n当他们遇到需要一个技能的工作时，他们没有达到谷歌寻找某人。他们将直接到他们的朋友网络。\n当然，机修工有一本可以参考保证价格的书。他们会保证让你的轮胎旋转它会花费XYZ金额并采取XYZ分钟。\n“我应该花一大堆一生成为我的工艺中的专家，然后我同意我的隐私，而我争夺底部并削弱了我的竞争，因为我将在哪里积极地将自己放在哪里我有最高的竞争，以确保我收到最低价格。最后，我会破坏我的屁股并弯曲世界，以满足利用我的客户。“\n本地聚会很棒。您可以在寻找雇用的初创企业中找到人们的初创公司，其他开发人员希望建立他们的网络，在某些情况下举办活动的场地将招聘（您可以接近合同工作）。\n我唯一知道的是，正如我一直在调整我的沟通技巧，我发现人们喜欢谈论自己。你不能出错。", "note_en": "Start your freelance business on the right foot by avoiding common mistakes that you will hold you back from victory.\n  Before we get into things, I just want to say that I’m not interested in writing about “5 quick tips to get freelance clients!” or similar topics you’ll find in hundreds of articles sprawled across the internet.\n What I want to talk about today is how to start your freelance adventure off on the right foot and avoid being taken advantage of or get discouraged. You will most definitely learn how to get your first client but if you’re looking for a get rich quick scheme while you work in your underwear, please hit back on your browser.\n I promise you, if you take action on what you read in this article you could potentially have your first client tomorrow without spending a penny.\n  So, you’ve recently decided that you want to take a shot at doing freelance or consulting work. That’s great, and in this article I’m going to give you a few tips on how to find your first freelance client but before that, you need to figure out what type of freelance worker you want to be.\n What I mean by that is, how much time are you looking to invest into freelancing? Are you looking to do it full time to replace a standard 9-5 job or as a side gig to create some extra income on the side?\n There is a very big difference between needing a check to pay rent when freelancing is your only source of income vs hoping to get some extra cash this month to either invest, enjoy life or help you climb out of debt just a little bit faster.\n Take some time to figure that out. For me, I use consulting as another revenue stream. As of this article, most of my income comes from a mixture of doing consulting work and selling software developer related courses but it wasn’t always like that.\n Before I decided to create courses, it was all about freelancing and consulting for me. I made a lot of mistakes and left a ton of money on the table, so now I’d like to write about how you can avoid those mistakes and start your business off on the right foot.\n   You might hear a lot of people say,  “oh you need a portfolio website and business cards before you can do anything, so step one is to do that!”.\n Don’t listen to them, you’re going to waste money and time. This is just a  procrastination tactic. It’s busy work that delays you from actually getting clients and making money.\n While I do think having a personal brand is important, I don’t think having a portfolio site is all that important. I didn’t even launch my own site until recently and if you look around, you won’t find a portfolio of prior work. At most you’ll find a few testimonials.\n That sounds almost impossible right? How could you possibly get clients without having a site, or a strong web presence. Simple, it comes down to how you find your clients.\n Trust me, no one is going to Google “find developer freelancer in NY” and then find you. That’s not how it works. You need to reach out to people, and the people you reach out to won’t care about your portfolio.\n They care about how much value you add to their life. This could be how you can help them solve a problem, or make them money. They don’t care that 2 years ago you put up a site for Acme Incorporated.\n   As a self taught programmer who didn’t goto university, I missed out on a lot of opportunities to network with peers. So my first tip to you is, if you’re at university right now, you should make a very conscious effort to build up a network of friends who have similar goals as you.\n You might be thinking  “Nick, how is my awkward programming wizard buddy going to help me land a freelance client?”.\n You never know what will happen in the future. Maybe you graduate as close friends and 3 months later he calls you because he needs your expertise or is overwhelmed by work. Congrats, you just got a new client.\n But it gets much better. Each person you add to your network expands your overall reach exponentially. I’ve had strings of freelance gigs for years that originated from a single connection.\n Person A may reach out to you to complete a job, and if you do a good job then person A may refer you to his friend for another job. The next thing you know, you’re doing another job for a friend of a friend, all while the original people in your network continue to provide you opportunities.\n This is how real life works, and you often see this happen in other trade skills like plumbing and electricians. I know a few people in this field and they all have a network of friends who fill in skill gaps and cover for each other when they are unable to fulfill work due to time issues or other reasons.\n When they run into a job that requires a skill they don’t have, they are not reaching for Google to find someone. They are going straight to their network of friends.\n I do the same exact thing too. In case you couldn’t tell by my blog post images (I make / arrange almost all of them myself), I’m not an artist, but when I need “serious business” custom graphics made I reach to my inner circle of friends and associates.\n The world outside of my personal network never gets a chance to even see the job opening.\n   Think about it from your POV as someone who works as a freelancer on sites like e-lance or upwork. We just finished talking about networks and how people tend to form circles of trust where they share jobs with each other.\n That typically means only the shitty jobs are available outside of these circles, and even worse they are jobs being managed by someone who might be difficult to work with. Not all people who hire freelancers on these sites are bad but in my experience, more often than not they end up being bad clients.\n They are the type of clients who will lurch over your shoulder, watching every move you make and ensure they pay the absolute minimum while demanding top tier results.\n Hell, even some of these platforms mandate that you keep an app running that randomly takes screenshots of your desktop to make sure you’re working, so that your hourly quotes are “accurate”.\n  Sure, a mechanic has a book that they can reference to for guaranteed prices. They will guarantee that to get your tires rotated it will cost XYZ amount and take XYZ minutes.\n However, a skilled mechanic will be able to do it in half the time, so he’s rewarded due to being able to rotate more tires per day than an unskilled mechanic. It’s a win / win. The mechanic makes more money per day and you get your car back faster.\n This type of cost guarantee proves that the service being done is so well known and discovered that it’s a commodity. It won’t be long until robots can perform those steps exactly, with an efficiency that crushes even the best mechanic.\n However, the skilled mechanic won’t be out of a job. He’ll be first in line to buy one of those robots because the “skill factor” is not so much rotating the tires, but figuring out that they need rotating in the first place.\n Freelance platforms who spy on you by invading your privacy do nothing but punish you for being skilled.\n In what world should you make less money for being an expert at your craft?\n I’ll tell you, it’s the world driven by freelance platforms that exploit workers by putting them into some type of passive fear driven mindset. If you really think about it, it’s insane.\n  “I should spend a large portion of my life to become an expert in my craft, and then I should agree to have my privacy stripped away from me while I race to the bottom and undercut my competition because I will actively place myself into situations where I have the highest competition to ensure I receive the lowest rates. Lastly, I will bust my butt and bend the world to satisfy clients who take advantage of me.”\n Sadly when you sign up to these sites, that’s exactly what you’re saying. To add insult to injury, they also take a chunk of your income. If you ask me, they are comparable to  Dante’s 9 circles of Hell.\n My recommendation is to stay away from these sites at all costs. You’re just going to get jaded early on by crappy clients and think that freelancing is too depressing to get into.\n   Instead of depending on freelance platforms, you should go and explore the world. I know, it’s scary. I’m “introverted” too (whatever the hell that’s supposed to mean), but you’re allowed to step outside of your comfort zone, and trust me, the reward is worth it.\n Take action and build up your own personal network using any strategy you can think of. It’s ok if you spend all day (or longer) thinking of ways to do this. That sure beats looking at WP themes for 7 hours for your “portfolio site”.\n  If you’re at university, try connecting with as many of your fellow students as possible. Don’t be lazy, because you’re in an excellent position right now (you’re making me jealous). There’s a fuster cluck of like-minded individuals who are one “hi” away from joining your networking circle which will lead to freelance gigs and more.\n The next best thing is to goto local meetups. If you have none in your area for what you’re interested in, then start one yourself. Sites like  meetup.com make it really easy to do this.\n Local meetups are awesome. You’ll find people in start-ups looking to hire, other developers looking to build their network and in some cases the venue hosting the event will be recruiting (you can approach them for contract work).\n It’s important to understand that your peers at meetups are your allies, not your competition. It’s counter intuitive because by default you might be thinking  “how can I find freelance work for development in a room full of developers?”, but that’s not how it works.\n First off, not everyone there will be a developer and secondly, you’ll find people with very wide skill sets and agendas. 8 out of 50 people in the room might be there for the sole purpose of finding another developer to work on something with them. You just need to find them.\n You might be thinking  “what am I supposed to say?”. It doesn’t need to be complicated. For students, try approaching Bob outside of one of your classes and be like  “Hey Bob, I’m Nick. We’re in CS101 together. If you don’t mind me asking, what got you interested in computers?”.\n At meetups, I usually just open with something that’s relevant to the situation, such as:  “Hi, what brings you to a Docker meetup?” and go from there.\n Remember, you’re not going to find an answer book for all problems you’ll face in life so you better get used to figuring things out on your own while doing self guided research, especially as a software developer.\n  By the way, I have no idea if the above university script works. Go test it and let me know in the comments.\n The only thing I do know is, as I’ve been  leveling up my communication skills, I have found out that people love talking about themselves. You can’t go wrong.\n Everyone can start calling local businesses to find freelance work too. You will find plenty of opportunities here. Sure you have to pick up a phone, but if it lands you a $2,000 deal that requires 10-20 hours of work, then why are you upset?\n Here’s a story for you. If you’ve been following my blog then you know that I do a lot of walking. Usually I walk 3 miles a day. I find it very relaxing and it helps me think, but it’s also a source of freelance clients.\n Yep, as I walk around town, there are vans and other work vehicles that drive by. They have phone numbers and website URLs plastered on their vehicles. You don’t need to have an eidetic memory like Wesley Crusher on the U.S.S Enterprise to capitalize on this.\n The next time you see one of these vehicles, jot down, take a picture or make a voice recording memo of their phone number and website address. Bam, you have a new lead to contact and at the same time, you’ve strengthened your leg muscles by walking.\n  I know you might be skeptical, and perhaps you were hoping for an article that told you to do 20 hours of research and busy work before you can get started but the reality of the situation is, as long as you have the technical skills to do the job, you can have your first client tomorrow. Heck, you don’t even need the technical skills, but that’s a story for another day.\n Once you get your first client, you’ll want to come up with a plan on how to get paid without getting crushed by fees. Here’s a  payment method breakdown.", "posttime": "2022-01-10 18:28:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开发,开展,successful", "title": "如何以成功的自由职业者开展软件开发人员", "title_en": "How to Start a Successful Freelance Business as a Software Developer", "transed": 1, "url": "https://nickjanetakis.com/blog/how-to-start-a-successful-freelance-business-as-a-software-developer", "via": "", "real_tags": ["软件", "开发", "开展"]}, {"category": "", "categoryclass": "", "imagename": "6749c7cc928dac02d1da4b4c850972bd.png", "infoid": 1072601, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有些信息涉及在释放之前可能会显着修改的预级产品。根据这里提供的信息，Microsoft没有保证，表达或暗示。", "note_en": "Some information relates to prerelease product that may be substantially modified before it’s released. Microsoft makes no warranties, express or implied, with respect to the information provided here.\n  public object Run (object Macro, object Arg1, object Arg2, object Arg3, object Arg4, object Arg5, object Arg6, object Arg7, object Arg8, object Arg9, object Arg10, object Arg11, object Arg12, object Arg13, object Arg14, object Arg15, object Arg16, object Arg17, object Arg18, object Arg19, object Arg20, object Arg21, object Arg22, object Arg23, object Arg24, object Arg25, object Arg26, object Arg27, object Arg28, object Arg29, object Arg30);\n  Public Function Run (Optional Macro As Object, Optional Arg1 As Object, Optional Arg2 As Object, Optional Arg3 As Object, Optional Arg4 As Object, Optional Arg5 As Object, Optional Arg6 As Object, Optional Arg7 As Object, Optional Arg8 As Object, Optional Arg9 As Object, Optional Arg10 As Object, Optional Arg11 As Object, Optional Arg12 As Object, Optional Arg13 As Object, Optional Arg14 As Object, Optional Arg15 As Object, Optional Arg16 As Object, Optional Arg17 As Object, Optional Arg18 As Object, Optional Arg19 As Object, Optional Arg20 As Object, Optional Arg21 As Object, Optional Arg22 As Object, Optional Arg23 As Object, Optional Arg24 As Object, Optional Arg25 As Object, Optional Arg26 As Object, Optional Arg27 As Object, Optional Arg28 As Object, Optional Arg29 As Object, Optional Arg30 As Object) As Object\n                                                                         The  Run method returns whatever the called macro returns. Objects passed as arguments to the macro are converted to values (by applying the  Value property to the object). This means that you cannot pass objects to macros by using the  Run method.", "posttime": "2022-01-10 18:27:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "对象,object,信息", "title": "_application.run（对象，对象，对象，对象，对象，对象，对象，对象", "title_en": "_Application.Run(Object, Object, Object, Object, Object, Object, Object, Object", "transed": 1, "url": "https://docs.microsoft.com/en-us/dotnet/api/microsoft.office.interop.excel._application.run?view=excel-pia", "via": "", "real_tags": ["对象", "object", "信息"]}, {"category": "", "categoryclass": "", "imagename": "2bc8f9c6a9a13414ce2f2bcc473f05ca.png", "infoid": 1072600, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Grafana Labs致力于为我们的客户和社区教育我们的所有开源技术和产品，以及我们的社区休闲，网络研讨会，会议，文档，以及当然，这篇博客。\n在进行课程后，我们非常有兴趣听取您可能拥有，积极或消极的任何意见或反馈，因此如果您有待分享，请给我们发电子邮件。", "note_en": "Grafana Labs has had a long commitment to educating our customers and community about all of our open source technologies and products, with our community  Slack,  webinars,  conferences,  documentation, and of course, this blog.\n In 2021, we decided that it was time to create a formal education program to provide more structured, repeatable, and scalable learning experiences – all while providing the same compelling and quality content our community is accustomed to.\n  In September 2021, the Customer Education team was assembled: me (Director of Customer Education), Matthew Helmke (Instructional Designer), and Séan Bogaard (Senior Trainer). Our mission was to build an education platform for the 21st century, with engaging content delivered in bite-size modules that can be consumed anytime, anywhere, and at your own pace.\n I am happy to announce that  Grafana University is now live with our first learning playlist,  Introduction to the three pillars of observability. This playlist has four modules:  Introduction to observability,  Introduction to metrics,  Introduction to logs, and  Introduction to traces. It is aimed at anyone who is new to the world of  observability and the Grafana stack, giving both a solid foundation in the concepts of observability and a chance to get hands-on with Grafana.\n  One of the coolest things about the platform we’ve built is the ability to provide hands-on experiences with the Grafana stack easily and quickly. With a single click of a button, you can spin up a Grafana instance, pre-configured with connections to our sample data sources. The lab environments are temporary sandboxes so they only exist for the duration of the lab, and they are not connected to your Grafana Cloud account. So you can feel free to explore and experiment all you want!\n From this humble beginning with our first learning playlist, Grafana University will grow to include more courses aimed at all the different users of the Grafana stack, from the people viewing and building dashboards to the teams responsible for installing, configuring, and administering the tools. Over the coming months, we’ll be adding more learning playlists on the basics of building Grafana dashboards and working with  LogQL and  PromQL. (Got an idea about what we should cover? Email us at  education@grafana.com.)\n  Class is officially in session!  Grafana University is available for free to anyone in the world — simply log in with your Grafana Cloud account and get started. (Don’t have a  Grafana Cloud account?  Sign up for free today!)\n After taking a course, we’re very interested in hearing any comments or feedback you may have, positive or negative, so if you have something to share, please  email us.\n  I would like to thank Matthew and Séan for all their work on this, as well as Heds Simons from our Field Engineering team for his assistance in getting the hands-on environments up and running. And of course, a big thank you to all the Grafanistas who supported us with comments, reviews, and contributions!", "posttime": "2022-01-10 18:25:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,格拉纳,grafana,社区", "title": "格拉纳纳大学", "title_en": "Grafana University", "transed": 1, "url": "https://grafana.com/blog/2022/01/03/introducing-grafana-university-our-virtual-hands-on-education-platform-thats-free-and-easy-to-use/", "via": "", "real_tags": ["大学", "格拉纳", "grafana", "社区"]}, {"category": "", "categoryclass": "", "imagename": "17b21ee7588eb216fa10bb2456128b02.jpeg", "infoid": 1072599, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "瑞典的一个男人今天活着，感谢 - 部分 - 无人机。 71岁的孩子在12月铲雪的同时心脏病发作，并在一名过渡者在一个除颤器中飞入除颤器后，在一个除颤器后，普通的医生复苏，周二。", "note_en": "A man in Sweden is alive today thanks to — in part — a drone. The 71-year-old had a heart attack while shoveling snow in December and was resuscitated by a nearby doctor after a drone flew in a defibrillator, Everdrone  reported Tuesday.\n Someone having a heart attack needs help within 10 minutes in order to survive. Everdrone’s Emergency Medical Aerial Delivery (EMADE) service is designed to deliver help as quickly as possible — it allows emergency dispatchers to send a drone carrying the device to a caller’s home, kickstarting the lifesaving process before the ambulance arrives at their home. In this particular patient’s case, it took three minutes for the services to deliver the defibrillator to his home. A bystander, who happened to be a doctor on the way to his job, used the AED on the patient after providing CPR.\n The drone was developed with the Center for Resuscitation Science at Karolinska Institutet, SOS Alarm, and Region Västra Götaland.\n   “This is an excellent real-world example of how Everdrone’s cutting edge drone technology, fully integrated with emergency dispatch, can minimize the time for access to live-saving AED equipment,” Everdrone CEO Mats Sällström said.\n In a four-month  pilot study testing the EMADE program, the service got 14 heart attack alerts that would be eligible for drones. Drones took off in 12 of those cases, and 11 successfully delivered the defibrillators. Seven of those defibrillators were delivered before the ambulance arrived.\n In Europe, about 275,000 patients suffer from cardiac arrest annually with approximately 70 percent of those arrests occurring in a private home without a defibrillator on site, according to Everdrone. The survival rate is  around 10 percent.\n Currently, the EMADE service can reach 200,000 Swedish residents. The company said it plans to expand to more locations in Europe this year.", "posttime": "2022-01-10 17:24:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发作,carrying,除颤", "title": "携带除颤器的无人机拯救了瑞典的第一个心脏病发作患者", "title_en": "Drone Carrying a Defibrillator Saves Its First Heart Attack Patient in Sweden", "transed": 1, "url": "https://www.theverge.com/2022/1/5/22868777/everdrone-drone-defibrillator-health-tech-sweden", "via": "", "real_tags": ["发作", "carrying", "除颤"]}, {"category": "", "categoryclass": "", "imagename": "242abf39635cbe25fc7dda03c5ff364f.jpeg", "infoid": 1072598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有一个忏悔：在过去的八年里，我一直在避免使用Docker。并不是说我不明白容器的价值，这是我第一次拿起码头我有一个非常糟糕的经历。如此糟糕，它确信我这项技术对我来说太难了。我稍后会发现，因为我的性质......", "note_en": "I have a confession: for the last eight years I have been avoiding using Docker. It’s not that I don’t understand the value of containers, it’s that the first time I picked up Docker I had a   really bad experience. So bad it convinced me that this technology was too difficult for me to master. I would find out later that because of the nature of what I…", "posttime": "2022-01-10 17:19:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,docker,编程,停止,过去", "title": "停止编程语言", "title_en": "Dockerizing a Programming Language", "transed": 1, "url": "https://bellmar.medium.com/dockerizing-a-programming-language-b39bf7574d19", "via": "", "real_tags": ["docker", "编程", "停止", "过去"]}, {"category": "", "categoryclass": "", "imagename": "c1a7360c817210c719ed9a35836d40ec.jpg", "infoid": 1072597, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然而，通过连接的分析在2018年推出的平台，已经通过连接的分析来茁壮成长，证明并非所有人都在交易，优惠券和奖励业务中黯淡。在去年宣布未披露的七位种子宣布的初创公司终于关闭了530万美元。\n在抓住500件初创公司，谷歌推出板和其他当地投资者等加速器的关注后，该企业筹集了320,000美元的预装种子。\n现在的购买有点，后来付费现在是模糊的，因为只有在非洲的少数突出的BNPL服务。然而，该公司似乎在全球购买时蓬勃发展的这种服务的迫在眉睫的这种服务的定位，即支付后期的服务，由于大流行引起的消费者行为而言，支付的薪水。\n“自2019年经过500个全球加速器以来，我们对Simeon和Shublicuarash团队留下了深刻的印象，即实施为尼日利亚消费者工作的奖励系统，无论现金或信用卡或在线或离线付款，校长表示。 “对于企业和银行来说，这是一个双赢，因为TUC给了他们所需的工具和数据。”", "note_en": "Yet,  ThankUCash, a platform launched in 2018 by  Connected Analytics, has managed to thrive, proving that not all is gloom in the deals, coupon and rewards business .  And to that end, the startup, which announced an undisclosed seven-figure seed last year, has finally closed the round at $5.3 million .\n VC firms 500 Global and Unicorn Growth Capital co-led the Lagos-based company’s seed round . It saw participation from U.S.-based accelerator Expert Dojo, Predictive VC, SaaS Growth Ventures, Betatron Venture Group, Accelerex Holdings. Individual investors like Andrew Dell, former CEO of HSBC and Craig Fenton of Google UK also took part.\n  The company plans to use the investment to expand within its home market Nigeria — where it operates in Lagos, Port Harcourt and Abuja — and outside to Ghana and Kenya. It also wants to improve its product offerings and add more staff.\n For years, store-like businesses in Nigeria such as supermarkets and restaurants have operated offline, relying on bookkeeping and head knowledge to record their customers’ activities in their shops. This made it difficult to offer cash back and loyalty points to customers .\n Online platforms like ThankUCash present these merchants with an opportunity to delve into rewards and help them retain loyalty and increase revenue.\n CEO  Simeon Ononobi started ThankUCash with Suraj Supekar, Madonna Ononobi and Harshal Gandole, who act as a chief technical officer, chief operating officer and senior vice president of engineering,  respectively .\n  The multi-merchant rewards platform (which means customers can hop on from one merchant to another to earn loyalty points in another) allows customers to earn rewards anytime they shop with thousands of merchants listed on its app.\n The business raised a $320,000 pre-seed after grabbing the  attention of accelerators such as 500 Startups, Google Launchpad and other local investors like  Microtraction and  Ventures Platform.\n Up until this point, ThankUCash said it has recorded over 600,000 users and onboarded over 1,000 stores on its platform . Also, it claims to have processed over $80 million in transaction volume.\n Having matured as a business, Ononobi and his team want to take on a more complicated task: building infrastructure for companies that want to offer akin services.\n “We are creating solutions that help SMEs succeed while increasing consumer buying power and opportunities.  We want to build an infrastructure for rewards, loyalty, deals, buy now, pay later, cashback,” he said to TechCrunch on a call .\n “Cashback was our low hanging fruit and an entry point. We’re still going to go into deals, couponing, gift cards, buy now, pay later, anything that will help the business grow, but at the same time, allowing the consumer increase in opportunities of buying.”\n Ononobi, a serial entrepreneur who previously built a payments company and also apps for Nigerian banks and the government, reckons that ThankUCash will do to rewards the same thing Flutterwave and Paystack did to payments in Africa.\n Some companies such as banks have launched cashback programs via debit cards to users in the past . But most of them have been generally inefficient, from setup down to collections and redeeming of points, and Ononobi argues that their inefficiencies boil down to no technical support.  ThankUCash sees a gold mine to provide plugins banks and fintechs can tap into to offer cashback and rewards .\n  The bit about buy now, pay later is fuzzy now since  only a handful of prominent BNPL services in Africa.  However , the company seems to be positioning itself for the imminent proliferation of such services buoyed by similar happenings globally where buy now, pay later services have seen an uptake as a result of pandemic-induced consumer behaviour.\n “The technology is such that we have our machines in stores.  So as customers request loans, we generate a code for it, customers input it into the POS machine and the merchant gets credited  directly . The code can only  be used  in the store chosen and only for the loan amount requested, such that at the end of the day the customer is buying straight from the merchants,” explained the founder, who also mentioned that his startup might venture into offering buy now, pay later services itself in the future.\n ThankUCash’s consumer-facing platform will remain operational. But to set the infrastructure play in motion, it has signed a partnership with payments company Interswitch to onboard its merchants.\n The company, which is also  in the process of  making integrations with payments gateways, said a couple of bank partnerships are in its pipeline.\n In terms of how ThankUCash makes money, merchants pay the company a fee on every  purchase  made in their stores.  For instance, ThankUCash gets a 1.5% commission for every customer it brings into the store to redeem a 5% cashback item.  The Lagos-based company also takes commissions for deals and plans to charge a “heavy onboarding fee” for businesses that want to use its APIs for its services, including buy now, pay later.\n ThankUCash has perfected one offering: the cashback product where merchants can get more walk-in customers. It’s improving the deals category, allowing merchants to sell products fast  (by hiring  ex-managers of DealDey, a Nigerian defunct deals company).  And while currently building out its buy now pay later infrastructure (which gives businesses a chance to sell products regardless of whether customers have money or not), ThankUCash plans to add a fourth offering soon: a remittance product where merchants can sell  directly  to the diaspora.\n The chief executive doesn’t give details about this product. Meanwhile , its investors, who have doubled down while privy to information like this,  are enthused  about “the continued evolution of the company”, a remark made by Amit Bhatti, the principal at co-lead investor 500 Global.\n “Since going through 500 Global’s accelerator in 2019, we’ve  been impressed by  Simeon and the ThankUCash team’s progress in implementing a rewards system that works for Nigerian consumers, regardless of cash or credit or online or offline payment,” said the principal. “It’s a win-win for businesses and banks, too, as TUC gives them the tools and data they need to grow.”\n The 45-man team has hired Aaron Tindiseega to lead its expansion into Kenya and the eastern Africa region .  The Ugandan professional has experience working for banks and tech companies like Uber, Standard Chartered Bank and Stanbic IBTC . For its expansion into Ghana, Kiki Anku, who has worked at Apple and a couple of startups, will spearhead the task.", "posttime": "2022-01-10 16:33:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrenthucash,thankucash,奖励", "title": "尼日利亚的Chrenthucash确保5.3米为现金返还，优惠和BNPL服务建立基础设施", "title_en": "\n\t\t\t\tNigeria’s ThankUCash secures $5.3M to build infrastructure for cashback, deals and BNPL services\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/10/nigerias-thankucash-secures-5-3m-to-build-infrastructure-for-cashback-deals-and-bnpl-services/", "via": "", "real_tags": ["奖励"]}, {"category": "", "categoryclass": "", "imagename": "ffc44112c6548ec442935518bfbb229f.jpg", "infoid": 1072596, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该股票于周一开放₹1,226，印度标准时间下跌5.3％。 PayTM一直在努力提高其股票价格以来，自首次亮相以来，其发行价格略高4,150（28.9美元）。该公司在出版时的市场概率为102亿美元，近一半在首次亮相和低于2019年底筹集了融资的160亿美元的估值。\n“巨大的谭，印度独特的科技建筑和规范支持性伙伴关系方法是关键的推动因素，我们相信。印度在金融服务中受到渗透，跨领域我们期望强劲增长。更重要的是，金融服务的第三方数字分配的渗透率明显较低，我们将在未来五年内看到强烈的加速 - 这将由印度的独特路轨周围的身份，付款和数据共享，“他们写入12月18日给客户的报告。", "note_en": "The stock, which opened Monday at ₹1,226, dropped 5.3% at 1.55 pm India standard time. Paytm, which has been struggling to improve its stock price ever since its debut, has slid 45% from its issue price of ₹2,150 ($28.9). The firm’s market cap, at the time of publishing, was $10.2 billion, nearly half of what it had sought during the debut and below the $16 billion valuation at which it raised a financing round in late 2019.\n The plunge in price follows brokerage house Macquarie’s report on Monday in which it retained its lowest rating on One97 Communications, the parent firm of Paytm, and cut its target price to ₹900 ($12.14), down from ₹1,200 that it had assigned ahead of the market debut on November 18.\n  Macquarie was the only brokerage firm which had such a grim view on Paytm’s outlook at the time of market debut. Analysts at Bernstein, in comparison, had estimated that Paytm valuation will range between $21 billion to $24 billion. (A Bernstein spokesperson did not respond to a request for comment in November.)\n “Post the various business updates and results, we believe our revenue projections, particularly on the distribution side, is at risk and hence we pare down our revenue CAGR from 26% to 23% for FY21- 26E. We are roughly cutting revenue estimates for FY21-26E on an average by 10% every year due to lower distribution and commerce/cloud revenues offset partially by higher payment revenues,” Macquarie analysts wrote Monday.\n “We cut our earnings (increase our loss projections) by 16-27% for FY22-25E owing to lower revenues and higher employee and software expenses. We cut our TP sharply by ~25% owing to lower target multiple of 11.5x (Price to Sales ratio) (from 13.5x earlier) and lower sales numbers. Maintain UP with a revised TP of Rs900.”\n The brokerage firm said RBI’s proposed digital payments regulations could cap wallet charges, which would hurt Paytm’s business, where payments side still accounts for 70% of the firm’s overall gross revenue. Macquarie also cited departure of senior Paytm executives and the shrinking ticket size for loans disbursed by Paytm as other factors that could impact the firm’s future outlook.\n  In a report in the second half of December, analysts at Morgan Stanley labeled Paytm’s stock as “overweight,” and assigned a target price of ₹1,875 ($25.2), saying the firm was “well positioned to capitalize on upcoming acceleration in digital distribution of financial services/commerce in India.”\n “Huge TAM, India’s distinctive tech architecture and regula- tory supportive partnership approach are key enablers, we believe. India is under-penetrated in financial services, and across segments we expect strong growth. More importantly, the penetration of third party digital distribution of financial services is significantly low and we will see strong acceleration over the next five years – this will be helped by the distinctive rails in India around identity, payments and data sharing,” they wrote in a report to clients on December 18.\n “Also, we believe that PAYTM’s cial services is synergistic, in line with the regulatory thought process and scalable. Balance sheet risk is low, and PAYTM’s technology capabilities to leverage alternative data sets as well as design customized products are some key value adds against the above backdrop.”", "posttime": "2022-01-10 16:33:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "库存,stock,印度", "title": "Paytm库存滴下降到历史低", "title_en": "\n\t\t\t\tPaytm stock drops to record low\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/10/paytm-stock-drops-to-record-low/", "via": "", "real_tags": ["库存", "stock", "印度"]}, {"category": "", "categoryclass": "", "imagename": "06af23f627f3a0ef10daa9352c723d19.jpeg", "infoid": 1072595, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Historian Amanda Foreman在过去的目的中搜索了今天世界的起源。在此阅读以前的列。", "note_en": "Historian Amanda Foreman searches the past for the origins of today’s world. Read previous columns  here.\n  The New Year has arrived, and if you’re like me, you’ve promised yourself a slimmer, fitter and healthier you in 2022. But in the meantime there is the old you to deal with—the you who overindulged at Thanksgiving and didn’t stop for the next 37 days. No miracle diet or resolution can instantaneously eradicate five weeks of wild excess. Fortunately, modern science has provided the next best thing to a miracle: the elasticated waistband.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-01-10 16:21:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "腰带,waistband,世界", "title": "咀嚼物：腰带如何伸展", "title_en": "The Masticator: How the Waistband Got Its Stretch", "transed": 1, "url": "https://www.wsj.com/articles/how-the-waistband-got-its-stretch-11641581952", "via": "", "real_tags": ["腰带", "waistband", "世界"]}]