[{"category": "", "categoryclass": "", "imagename": "020e1c5b86b8f10e6ba14b18b42b2ec8.jpg", "infoid": 1008110, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳过文章标题。跳至：文章开头。泰德·赖特对音乐有非常特殊的品味。这位亚特兰大一家营销机构的创始人兼首席执行官喜欢Pylon和R.E.M.这样的乐队，这是一种另类摇滚音乐，于20世纪80年代在佐治亚州雅典成形(他在发行当天就购买了最新的R.E.M.的CD)。他更喜欢听丹麦消费电子公司Bang&amp；Olufsen设计的产品上的音乐。赖特B&amp；O系列的核心产品是BeoSound 9000 CD播放机--赖特称之为“经典”。这款设备与你见过的任何其他CD播放机都不一样：它安装在墙上，是一条闪闪发光的金属条，上面有烟熏玻璃，长约一码(或高，取决于你如何定位)。它拿着六张光盘，这样它们的标签就可以朝外，通过玻璃窗可以看到。本机的“CD夹持器”可来回滑动至您选择的任何一张光盘。赖特大约在1996年首次亮相的时候就拥有了它，B&amp；O一直卖到今年8月-该公司的网站将它描述为一件“动态雕塑”。\n赖特的CD播放机连接着一个同样引人注目的BeoLab 3500扬声器，这是一个4英尺长的管子，其底座使其看起来像在半空中盘旋。他还拥有一部BeoCom 1401有线模拟电话。1993年推出，它的特点是一个超薄的矩形手机，从楔形接收器伸出，就像一个库布里克巨石。与许多B&Amp；O产品一样，这些产品中的每一件都醒目地被指定为拉丝铝或哑光黑色，而且每件都非常昂贵：CD播放器的价格为5250美元，扬声器为2175美元，手机为159美元。\n赖特对这些价格标签不屑一顾。对他来说，B&amp；O Gear就像他的3000美元西装中的一套：做得更好，看起来更好，而且比其他任何东西都耐用。“他们的东西太酷了，”他说。“声音太棒了，设计精美，而且不显眼。”\n不引人注目吗？那个CD播放机看起来像是巴克·罗杰斯(Buck Rogers)在新芝加哥的单身汉公寓里的东西。事实上，在B&amp；O 86年历史的大部分时间里，一种常见的赞美和抱怨一直是它的产品与科幻电影中的道具有多么相似。回到模拟时代，每一次新的B&amp；发行都是一种自给自足的世界博览会，是通往光鲜乌托邦未来的窗口。该公司吸引了一群发烧友和鉴赏家，其中大部分在欧盟，那里大约有500家专门的Bang&Amp；Olufsen精品店。(全球有700多家。)。漫步在其41家美国门店中的一家，这些门店往往没有顾客，你会看到复古未来主义风格和超现实主义定价的令人费解的组合。1100美元的无绳电话，薄而尖，像布兰库西雕塑或海象的象牙；2.3万美元的一对3英尺高的扬声器，看起来像神秘博士(Doctor Who)的戴立克(Dalek)；8.5万美元的3-D电视，6英尺宽，底座有一个三角形扬声器。产品名称通常以Beo开头，以数字结尾：BeoVox 1、BeoSound 2、BeoSystem 3、BeoVision 4。\n百安居独特的产品系列带来了丰厚的利润--尽管它似乎承诺的未来从未实现。当这家丹麦公司追求自己的设计狂热时，其他公司，如苹果，则制定了一种新的美学，考虑到了图形用户界面和摩尔定律。随着iPod和iTunes的腾飞，对话类家庭娱乐产品似乎越来越无关紧要。事实证明，明天的音响系统不是一个优雅的5000美元的设备，可以让你立即访问6张CD；而是一个400美元的小玩意儿，可以让你把数千首歌曲塞进你的臀部口袋。音频发烧友输给了音频文件。\n在这场消费性电子产品的剧变中，Bang&amp；Olufsen仍然坚定不移地、勤奋地、有点讨人喜欢地致力于走自己的道路。但在2008年，全球金融危机让B&Amo面临了自1945年纳粹同情者炸毁其工厂以来最严重的生存威胁。在2008至2009年间，其年收入从8.53亿美元暴跌至5.28亿美元，其股价也从52美元暴跌至8.50美元。制造商不能再忽视当前的紧迫现实。它被迫削减产品线，对首席执行官进行改组，并解雇数百名员工。\n然而，值得注意的是，B&Amo坚持了下来。这家看起来与当前趋势格格不入的古怪公司，甚至在去年恢复了盈利。这证明了它的产品的神秘性，也证明了几十年来它们激发的热情忠诚。B&amp；O现在足够健康，可以再次思考未来，并准确地找出未来的位置。\n1924年，一位名叫斯文德·奥卢夫森(Svend Olufsen)的年轻丹麦人开始摆弄一项相对较新的技术-无线电。他很快就与彼得·邦(Peter Bang)合作，彼得·邦是一名才华横溢的工程师，也是他的前同学，刚刚从美国回来，当时小说广播媒体正在美国蓬勃发展。这两个人成立了一个临时组织。\n第二次世界大战后，B&amp；O拥抱了电视机，到1960年，该公司开始努力成为一个独特的全球品牌。它的明星设计师亨宁·莫尔登哈沃(Henning Moldenhawer)和雅各布·詹森(Jacob Jensen)定义了一种全新的家用电子产品愿景，一种陶醉于精确度和精确度的标志性表现的愿景。Beomaster 1200调谐器有一个让人联想到计算尺的表盘。Beig4000转盘上的耳机自动滑行到位，感觉非常流畅，就像一架准备完美着陆的飞机。Beovision 8800电视拥有红外线遥控器和当时非常纤细的外形。1978年，纽约现代艺术博物馆举办了一场展览，全部由Bang&amp；Olufsen设计作品组成。每一种产品似乎都象征着其类别中的一种柏拉图式的理想。\n“B&amp；O绝对统治着世界，”40岁的BeoWorld发烧友网站老板李·万豪(Lee Marriott)表示。在该网站上，聊天板上充斥着B&amp；O的八卦和关于其新旧产品的提示。“一旦你拥有了一件作品，其他任何作品都无法与之相比。”他在英国的公共住房长大，记得一位富有的朋友家里的B&amp；O系统让他眼花缭乱--特别是当他被命令不要碰它的时候。\n“你有没有体验过经典时期的B&amp；O产品？”蒂姆·贾曼(Tim Jarman)问道，他在不运营另一个粉丝网站Beocentral时翻新了公司的产品。“哦，它们真是太棒了。由实心金属和合适的硬木制成，性能令人难以置信。“。他说，该品牌的产品非常昂贵，但在很长一段时间内运作良好，与其说是挥霍，不如说是一种投资。\n“如果你回顾10年、20年或30年前，Bang&amp；Olufsen的职位非常棒，”图·曼托尼(Tue Mantoni)表示同意。这位36岁的男子今年3月回到祖国丹麦，成为该公司的总裁兼首席执行官，此前他帮助垂死的英国摩托车制造商Triumph成功重组了自行车和形象，赢得了赞誉。但他将很难重振B&amp；O在设计和工程方面的卓越光环。摩托车在今天的车主生活中扮演着与十年甚至一代人之前相同的角色；一件消费电子产品的功能与其形式的变化速度一样快。“Bang&amp；Olufsen制造了一些非常棒的产品，赚了很多钱。在某种程度上，他们只是变得自满。“曼托尼说。\n这种自满与便携式音频播放器、联网计算机和数字媒体的兴起不谋而合。(与此同时，亚洲竞争对手正在学习制造画质足够好的超薄电视，其价格甚至只有最便宜的BeoVisions的一小部分。)。新的产品类别带来了新的进步速度，不断的升级使得娱乐设备看起来几乎是一次性的。这一新兴模式的一切都令这家自豪的丹麦公司深恶痛绝。\nB&amp；O试图一如既往地竞争，在每个类别中都创造出最优雅和奢华的产品。有BeoSound 2数字音乐播放器，没有显示器的不锈钢光盘，没有内置硬盘，标价460美元。然后是一部1275美元的手机。这些产品承认了数字革命，但它们的质量也不怎么样。此外，创新的速度使得让设备感觉像是面向未来的投资变得越来越困难-如果你怀疑几年后必须升级，为什么要花这么多钱买MP3播放器或手机呢？\nB&amp；完全摆脱了手机和MP3设备，这些削减帮助它挺过了全球金融危机。但该公司仍在努力适应当代的产品、软件和服务领域。曼托尼说：“这是为了在一个已经完全改变的市场中开拓我们的利基市场--我们的理由，真的。”\n如今，百安居产品所投射出的形象是否令人向往还有待商榷。专门研究奢侈品市场的品牌咨询公司Agenda的创始人卢西恩·詹姆斯(Lucian James)说，这种装备“给邻居留下了深刻的印象”。“如今，对很多人来说，这是一个令人尴尬的概念。”路易丝·罗森(Louise Rosen)是巴黎的一名40岁的品牌顾问，她从消费者的角度阐述了这个问题。她说，她的丹麦母亲是渴望拥有该公司产品的那一代人：“她家里的每一台电子设备都是邦安奥鲁夫森(Bang&amp；Olufsen)的。”但罗森从未收购过B&Amo，认为它的美学令人反感。“对我来说，”她说，“这是胡说八道。”\n品味好在丹麦可不是小事。哥本哈根的社会人类学家和消费文化专家Jeppe Trolle Linnet说：“我们非常清楚，丹麦的设计是世界了解我们的东西。”为了证明这一点，你可以去该市的Stroget购物大道，走进IllumsBolighus，这是一家拥有四层家居设计产品的令人惊叹的商场。你会看到丹麦久负盛名的产品，比如格奥尔格·詹森(Georg Jensen)的精致家居用品和保尔·亨宁森(Pul Henningsen)的传奇PH灯，它们的嵌套色调通过发射反射光来驯服眩光；它们大约是在B&amp；O成立的时候设计的，至今仍在销售。你还会在斯堪的纳维亚的设计场景中看到新的到来：诺曼哥本哈根有趣的圆底平底杯，Muuto的巧妙的茶杯架，其特点是有一个狭缝来容纳火柴。这些引人入胜的产品共同阐述了“物性”，这是一种显而易见的感觉，即每一件物品，无论其功能多么微不足道，都应该得到认真对待，并建造成耐用的。\n这种物质文化的观点指导着B&Amo，每个人都会在斯特鲁尔村的公司总部告诉你，斯特鲁尔村距离哥本哈根约4小时车程，距离彼得·邦(Peter Bang)和斯文德·奥卢夫森(Svend Olufsen)86年前辛勤工作的房子只有很短的车程。这里的参观从一个展示BeoLiving概念的高端模拟家庭娱乐室开始。Beo6遥控器-一个银色的球，顶部安装了一个小屏幕-可以操作房间里的每一件设备。随后，参观者扑通一声坐在半吨重、103英寸的BeoVision 4等离子高清电视前，电视旋转着，6个轰鸣的BeoLab 5扬声器(看起来像Dalek的扬声器)环绕着观众。整个B&amp；O的沉浸感觉实际上就像是在一部科幻电影中，一部触发你战斗或逃跑反应的恐怖电影。\n在附近的斯特鲁尔博物馆(Struer Museum)，第三代B&amp；O员工带领我们参观了一个专门介绍该公司产品的侧厅。从早期包豪斯风格的收音机到电动剃须刀(短暂的B&amp；O进军)，所有东西都展示了该品牌独特的形式和优质功能的标志性组合。该指南指出了20世纪90年代立体声音响上的滚轮控制，并侧身评论了苹果的想法是从哪里来的。丹麦人很有礼貌，但不一定谦虚。\n但在穿越B&amp；O世界的旅程中，真正令人印象深刻的时刻来自于窥视其过程。你期望一家销售极其昂贵的产品的公司会投入大量的时间、精力、技能和工艺来制造它们。但在一个外包和成本效益高的时代，这仍然是值得见证的。在十几个微调B&amp；O汽车音响的隔音车库中，工程师们正在用一辆奥迪Q7(AudiQ7)测试音频，这辆奥迪Q7配备了大约50个扬声器。在其他地方，鲁布·戈德堡(Rube Goldberg)的机器会燃烧香烟，并向电视发射烟雾，以确保它们的屏幕能够承受这种虐待。最棒的是整洁的第五工厂，机器人和人类在这里按照极其精确的标准研磨和抛光铝。该指南指出了一台瑞士制造的大型Niederberger磨床，该磨床用于在BeoVision 7电视的框架上创建纹理。就像工厂里的一切一样，这条流水线经过精心组织，将设计师们严格的愿景变成了现实。\n“在每个人都在做设计的时候，我们必须考虑真正的设计，”托尔斯滕·瓦莱尔(Torsten Valeur)说。现年45岁的他代表着Bang&amp；Olufsen的未来；他与公司长期的设计大师、72岁的大卫·刘易斯(David Lewis)密切合作，并将在他的导师退休后接任。瓦莱尔以售价23,000美元的BeoLab 5扬声器为例，解释了他所说的“真正的设计”是什么意思。“我非常喜欢他们，”瓦莱尔说。每个扬声器独特的圆锥形由其功能决定-2500瓦的数字放大，带有低音控制，可以读取房间的声学信息并进行相应的调整。Valeur钦佩他们是独一无二的，而不是其他东西的微调版本。“我们为Bang&amp；Olufsen推出的每一款新产品，”瓦莱尔说，“都应该让人大吃一惊。”\n无论怎么说，B&amp；O给了设计师们多少自由都不为过。2005年，时任首席执行官托本·布拉加德·索伦森(Torben Bregaard Sorensen)几乎向Fast Company吹嘘，当刘易斯反对调整电视设计时，他几乎是屈服了，尽管它本来可以容纳可以将电视机的生命周期延长到新兴的高清时代的技术。由于坚持刘易斯的品味只会花费B&amp；O；1000万美元的现金流，因此投降显然是轻而易举的。据报道，索伦森说：“我对设计没有任何影响。”\n我从新任首席执行官那里听不到这样的吹嘘。事实上，曼托尼听起来很想促使百安居对市场采取一种不那么冷漠的态度。“我们需要走出去与客户交谈，”他说。他最近告诉他的30名高管，他们将在百安居门店工作一段时间，与客户面对面交流。这里有一条关于设计的信息\n罗布·沃克(Consumer@robwalker.net)是“Buy In：The Secret Dialog Better What We Buy and Who We Are”一书的作者。\n回到顶部。跳至：文章开头。", "note_en": "Skip Article Header. Skip to: Start of Article.    Ted Wright has very specific taste in music. The founder and CEO of a marketing agency in Atlanta adores bands like Pylon and R.E.M., an alt-rock sound that took shape in Athens, Georgia, in the 1980s (he bought the latest R.E.M. on CD the day it was released). And he prefers to listen to his music on products designed by the Danish consumer electronics company Bang &amp; Olufsen. The centerpiece of Wright’s B&amp;O collection is a BeoSound 9000 CD player — “the classic,” Wright calls it. This device isn’t like any other CD player you’ve seen: Mounted on a wall, it’s a glittering strip of metal and smoked glass about a yard long (or tall, depending on how you orient it). It holds a half-dozen compact discs in such a way that their labels face outward, visible through the pane of glass. The unit’s “CD clamper” slides back and forth to whichever disc you select. Wright has had it since around the time it debuted in 1996, and B&amp;O sold it until August of this year — the company’s site describes it as a “kinetic sculpture.”\n Wright’s CD player is connected to an equally eye-catching BeoLab 3500 speaker, a 4-foot-long tube with a base that makes it appear to hover in midair. He also owns a BeoCom 1401 corded analog telephone. Introduced in 1993, it features an impossibly slim rectangular handset that juts from the wedge-shaped receiver like a Kubrick monolith. Like many B&amp;O offerings, each of these objects is strikingly appointed in brushed aluminum or matte black, and each is strikingly expensive: The CD player will set you back $5,250, the speaker $2,175, and the phone $159.\n  Wright shrugs off those price tags. To him, B&amp;O gear is like one of his $3,000 suits: It is made better, looks better, and lasts longer than anything else. “Their stuff is so cool,” he says. “The sound is awesome, it’s beautifully designed, and it’s unobtrusive.”\n Unobtrusive? That CD player looks like something from Buck Rogers’ bachelor pad in New Chicago. In fact, for much of B&amp;O’s 86-year history, a common compliment — and complaint — has been how much its products resemble props in sci-fi films. Back in the analog era, each new B&amp;O offering was a kind of self-contained world’s fair, a window into a sleek utopian future. The company attracted a coterie of audiophiles and connoisseurs, mostly in the EU, where there are around 500 dedicated Bang &amp; Olufsen boutiques. (There are more than 700 worldwide.) Wander through one of its 41 US stores, which are often devoid of customers, and you’ll see a baffling mix of retro-futurist style and surrealist pricing. An $1,100 cordless phone that’s thin and tapered like a Brancusi sculpture or a walrus tusk, a $23,000 pair of 3-foot-tall loudspeakers that look like Daleks from Doctor Who, an $85,000, 6-foot-wide, 3-D TV with a triangular speaker that juts from its base. Product names generally begin with Beo and end with a number: the BeoVox 1, the BeoSound 2, the BeoSystem 3, the BeoVision 4.\n B&amp;O’s distinct menagerie of wares has brought handsome profits — even though the future that it seemed to promise never came to pass. While the Danish company pursued its own cult of design, others like Apple formulated a new aesthetic that took into account the graphical user interface and Moore’s law. As the iPod and iTunes took off, conversation-piece home-entertainment objects seemed less and less relevant. It turned out that the sound system of tomorrow wasn’t an elegant $5,000 device that gave you instant access to six CDs; it was a $400 gadget that allowed you to slip thousands of songs into your hip pocket. Audiophiles lost out to audio files.\n In the midst of this consumer electronics upheaval, Bang &amp; Olufsen remained adamantly, diligently, and somewhat endearingly committed to following its own path. But in 2008, the global financial crisis confronted B&amp;O with perhaps its gravest existential threat since Nazi sympathizers blew up its factory in 1945. Between 2008 and 2009, annual revenue plunged from $853 million to $528 million, and its stock price plummeted from $52 to $8.50. The manufacturer could no longer ignore the urgent realities of the present. It was forced to shed product lines, shuffle CEOs, and lay off hundreds of workers.\n Yet remarkably, B&amp;O endured. This eccentric company, which seems so out of sync with current trends, even returned to profitability last year. It’s a testament to the mystique of its products and to the ardent loyalty they have inspired over many decades. B&amp;O is now healthy enough to contemplate the future again and to figure out exactly what its place there will be.\n In 1924, a young Dane named Svend Olufsen started tinkering with a relatively new piece of technology — the radio. He soon teamed up with Peter Bang, a gifted engineer and former classmate who had just returned from a stint in the U.S., where the novel broadcast medium was taking off. The two set up a makeshift laboratory in the Olufsen family’s 300-year-old home. Olufsen became the business guy, while Bang dreamed up new products. In 1927, Bang and Olufsen borrowed money from their fathers to build a factory and quickly established the reputation that their company lives on today: quality media delivery via striking objects. Early products included the Five Lamper, a sumptuous radio in a walnut and maple cabinet. It took its aesthetic cues from furniture, a radical departure at a time when most radios were purely functional. This attention to design as well as engineering found an audience that was willing to pay the price premium it entailed.\n  After World War II, B&amp;O embraced television sets, and by 1960 the company had started a push to become a distinct global brand. Its star designers, Henning Moldenhawer and Jacob Jensen, defined a whole new vision of home electronics, one that reveled in iconic representations of accuracy and precision. The Beomaster 1200 tuner featured a dial suggestive of the slide rule. The tonearm on the Beogram 4000 turntable glided automatically into place with sensuous smoothness, like a plane coming in for a perfect landing. The Beovision 8800 TV boasted an infrared remote control and a profile that at the time was remarkably slender. In 1978, New York’s Museum of Modern Art held an exhibition consisting entirely of Bang &amp; Olufsen designs. Each product seemed to symbolize a sort of platonic ideal of its category.\n “B&amp;O absolutely ruled the world,” says Lee Marriott, the 40-year-old owner of enthusiast site BeoWorld, where chat boards crackle with B&amp;O gossip and tips about its products old and new. “Once you have one piece, nothing else compares.” He grew up in public housing in the UK and remembers being dazzled by a B&amp;O system at a wealthy friend’s home — especially when he was ordered not to touch it.\n “Have you ever experienced any B&amp;O products from the classic period?” asks Tim Jarman, who refurbishes the company’s wares when he’s not running another fan site, Beocentral. “Oh, they are absolutely fantastic. Made out of solid metal and proper hardwood, and the performance is just unbelievable.” The brand’s offerings were spectacularly expensive, he says, but worked so well for so long that they were more of an investment than a splurge.\n “If you look back 10, 20, 30 years, Bang &amp; Olufsen had a fantastic position,” Tue Mantoni agrees. The 36-year-old returned to his native Denmark to become president and CEO of the company in March after earning praise for helping the moribund British motorcycle maker Triumph successfully retool its bikes and image. But he’ll have a harder time reviving B&amp;O’s aura of design and engineering superiority. A motorcycle plays the same role in an owner’s life today as it did a decade or even a generation ago; the function of a piece of consumer electronics morphs as quickly as its form. “Bang &amp; Olufsen made some fantastic products, made a lot of money. And at some point, they simply became complacent,” Mantoni says.\n That complacency coincided with the rise of portable audio players, networked computers, and digital media. (At the same time, Asian competitors were learning to make slim TVs with good-enough picture quality that cost a fraction of the price of even the cheapest BeoVisions.) New product categories ushered in a new rate of progress, one in which continuous upgrades made entertainment devices seem practically disposable. Everything about this emerging paradigm was anathema to the proud Danish company.\n B&amp;O tried to compete as it always had, by creating the most elegant and luxe offering in each category. There was the BeoSound 2 digital music player, a stainless steel disc with no display, no built-in hard drive, and a $460 price tag. Then there was a $1,275 mobile phone. These products acknowledged the digital revolution, but they had a me-too quality. Also, the pace of innovation made it increasingly difficult to make the devices feel like future-proof investments — why pay so much for an MP3 player or a mobile phone if you suspect you’ll have to upgrade in a few years?\n B&amp;O got out of mobile phones and MP3 devices entirely, and those cutbacks have helped it survive the global financial crisis. But the company is still struggling to adjust to the contemporary universe of products, software, and services. “This is about carving out our niche — our reason to be, really — in a market that has completely changed,” Mantoni says.\n It’s open to debate whether the image projected by B&amp;O’s products is even desirable nowadays. “There’s an ‘impress the neighbors’ quality” to this gear, says Lucian James, founder of brand consultancy Agenda, which specializes in the luxury market. “And that’s an embarrassing concept to a lot of people these days.” Louise Rosen, a 40-year-old brand consultant in Paris, illustrates the problem from the consumer’s point of view. Her Danish mother, she says, is of a generation that aspired to own the company’s wares: “Every electronic device in her house is Bang &amp; Olufsen.” But Rosen has never bought B&amp;O, finding its aesthetic off-putting. “For me,” she says, “it’s nonsense.”\n Good taste is no minor matter in Denmark. “We are very aware that Danish design is something the world knows us for,” says Jeppe Trolle Linnet, a social anthropologist and consumer-culture expert in Copenhagen. For proof, go to the city’s Stroget shopping thoroughfare and step into Illums Bolighus, a stunning emporium with four floors of home-design products. You’ll see long-celebrated Danish creations like the refined housewares of Georg Jensen and the legendary PH lamps of Poul Henningsen, with their nested shades that tame glare by emitting reflected light; they were devised around the time B&amp;O was founded and are still sold today. You’ll also see newer arrivals on the Scandinavian design scene: Normann Copenhagen’s amusing round-bottomed tumblers, Muuto’s clever tea-light holders that feature a slot to accommodate a match. These engaging wares make a collective statement about “thingness,” a palpable feeling that every object, no matter how trivial its function, ought to be treated seriously and built to last.\n That view of material culture guides B&amp;O, as everyone will tell you at company headquarters in the hamlet of Struer, about four hours outside of Copenhagen and just a short drive from the house where Peter Bang and Svend Olufsen toiled 86 years ago. A visit here begins in a high-end simulacrum of a family room displaying the BeoLiving concept. The Beo6 remote control — a silvery ball with a small screen mounted on top — can operate every piece of gear in the room. Later, the visitor is plopped in front of the half-ton, 103-inch BeoVision 4 plasma HDTV, which swivels while six booming BeoLab 5 speakers (the ones that look like Daleks) surround the viewer. The total B&amp;O immersion feels like actually  being in a science fiction movie, a scary one that triggers your fight-or-flight response.\n In the nearby Struer Museum, a third-generation B&amp;O employee leads a tour through a wing devoted to the company’s products. Everything from an early Bauhaus-inspired radio to electric shavers (a brief B&amp;O foray) displays the brand’s signature mix of unique form and quality function. The guide points out a scroll-wheel control on a 1990s stereo and makes a sideways remark about where Apple gets its ideas. Danes are polite but not necessarily modest.\n  But the genuinely impressive moments in a journey through B&amp;O’s world come from peeking at its process. You expect a company that sells incredibly expensive products to pour tremendous time, effort, skill, and craft into making them. But in an age of outsourcing and cost efficiencies, it’s still something to witness. In one of the dozen soundproof garages where B&amp;O car stereos are fine-tuned, engineers are testing the audio in an Audi Q7 tricked out with some 50 speakers. Elsewhere, a Rube Goldberg machine burns cigarettes and shoots the smoke at TVs to make sure their screens can withstand such abuse. Best of all is the tidy Factory Five, where robots and humans mill and polish aluminum to insanely precise standards. The guide points out an enormous Swiss-made Niederberger grinding machine used to create the grain on the frame of the BeoVision 7 TV. Like everything in the factory, this assembly line was meticulously organized to turn designers’ exacting visions into reality.\n “At a time when everybody’s doing design, we have to think about true design,” Torsten Valeur says. The 45-year-old represents the future of Bang &amp; Olufsen; he works closely with the company’s longtime design guru, 72-year-old David Lewis, and will take over when his mentor retires. Valeur explains what he means by “true design” by citing the $23,000 BeoLab 5 speakers. “I’m very much in love with them,” Valeur says. Each speaker’s unique conical shape is dictated by its function — 2,500 watts of digital amplification, with bass control that reads the acoustics of a room and adjusts accordingly. Valeur admires that they are sui generis, not a tweaked version of something else. “Every new product we do for Bang &amp; Olufsen,” Valeur says, “should come as a surprise.”\n It’s hard to overstate how much free rein B&amp;O has given its designers. In 2005, then-CEO Torben Ballegaard Sorensen practically bragged to Fast Company about caving in when Lewis objected to tweaking the design of a TV, even though it would have accommodated technology that could have extended the set’s life cycle into the emerging hi-def era. Since adhering to Lewis’ taste would have cost B&amp;O “only” $10 million in cash flow, it was evidently a no-brainer to capitulate. “I have no influence on design,” Sorensen is reported to have said.\n I hear no such boasts from the new CEO. In fact, Mantoni sounds intent on prodding B&amp;O toward a less aloof attitude about the marketplace. “We need to go out and talk to customers,” he says. He recently told 30 of his top executives that they would be working in B&amp;O stores for a while to meet customers face-to-face. There’s a message here about design: Of course the company has to keep producing distinctive wares — but these also have to fit shoppers’ actual lives. “We need to get the core of our target customer group really interested in the brand again,” Mantoni says, “so they’ll say, ‘Bang &amp; Olufsen is back.&#39;”\n Consider one of its latest products: the BeoSound 8, a docking device for iPods, iPhones, and iPads. This is a first for B&amp;O, which took until 2010 to finally concede that we’re all now living in a future of Apple’s making. Granted, at $999, the BeoSound 8 is about 10 times the price of most iPod docks. And it looks otherworldly and obtrusive, with two plate-sized speakers joined by a brushed-aluminum bridge. But audiophiles rave about its sound quality. “Pin sharp, tight, and precise,” declares brand-obsessive site BeoWorld. According to Zean Nielsen, president of B&amp;O’s American division, the dock already accounts for up to 14 percent of US sales and is bringing in customers who may have previously regarded its products as mere curiosities. B&amp;O seems to see a future here. This summer, the company announced plans for a line of products designed for a distinctly non-B&amp;O retail venue: Apple stores.\n Rob Walker ( consumed@robwalker.net)  is the author of Buying In: The Secret Dialogue Between What We Buy and Who We Are.\n  Go Back to Top. Skip To: Start of Article.", "posttime": "2020-06-25 15:28:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bang,产品", "title": "Bang和Olufsen崇拜能持久吗？(2011)", "title_en": "Can the Cult of Bang and Olufsen Last? (2011)", "transed": 1, "url": "https://www.wired.com/2011/09/ff_bando/", "via": "", "real_tags": ["bang", "产品"]}, {"category": "", "categoryclass": "", "imagename": "2f66aeea1dbb8b3533bec4e4aa7c454c.png", "infoid": 1008109, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "支持新基金的是现有和新有限合伙人的组合，其中包括Top Tier Capital Partners、Ismer Capital、英国纳税人的英国患者资本、De Agostini、Big Society Capital、Draper ESPRIT和Korelya Capital。Connect的上一只基金是在2016年募集的，根据今天的汇率，大约是6200万美元，所以这是一个略大的可部署资本数额。\nConnect Ventures成立于2012年，当时欧洲的种子阶段机构资本供应仍然非常有限(当时种子支票通常被称为A系列！)，Connect Ventures是泛欧洲的，投资于B2B和消费软件类别，包括SaaS、金融科技、数字健康和“工作的未来”。\n贯穿该公司投资主题的是产品焦点，他们相信“产品导向的软件创业者”是最有可能改变我们规模化生活和工作方式的那种创始人。\n你可以看到这种数字产品在它的许多投资组合公司中都是弯曲的。例如，就B2B SaaS公司而言，Typeform就像它们一样以产品为重点。更明显的是，消费者金融科技扮演的金融应用艾玛和一卡通应用曲线也是由各自的应用决定的-这一主题将在这第三只基金中继续下去。\nConnect Ventures普通合伙人西塔尔·泰利(Sitar Teli)在一份声明中表示：“我们有兴趣与创始人建立长期关系，这些创始人拥有打造产品导向型公司所需的痴迷和专注，并有打造品类领先者的雄心。”\nConnect Ventures的另一件值得注意的事情是，它每年的交易量一直并将继续少于许多种子期公司-即今天经常被称为“信念投资”的公司。换言之，这与有利于多元化的喷雾祈祷方式相反。这不仅意味着将更大(因此风险更高)的赌注投向数量较少的初创公司，还意味着为这些投资提供更多支持，包括获得董事会席位，以帮助天平向成功倾斜。\n“我们有意创建了一家低交易量、高信心、高支持率的投资公司来支持这些创始人，”泰利补充道。这就是为什么我们将通过这只基金瞄准同样数量的种子投资，利用更大的基金规模在我们的共同旅程中提供合适的资本和支持。\n在这方面，Connect表示，它已经开始用最近的投资部署这只基金。它们包括bsit(基于订阅的育儿和保姆平台)，Oyster(分布式人才支持平台)，以及前面已经提到的金融科技·艾玛。\n除了Teli，Connect Ventures的另外两名普通合伙人是皮埃特罗·贝扎(Pietro Bezza)和罗里·斯特林(Rory Stirling)(参见TechCrunch之前对斯特林招聘的报道)。到目前为止，该公司已经投资了50多家初创公司。", "note_en": "Backing the new fund is a combination of existing and new LPs including Top Tier Capital Partners, Isomer Capital, the U.K. taxpayer’s British Patient Capital, De Agostini, Big Society Capital, Draper Esprit and Korelya Capital. Connect’s last fund, raised in 2016, was around $62 million based on today’s exchange rate, so this is a slightly larger amount of deployable capital.\n Launched back in 2012 when there was still a very limited supply of institutional capital at seed-stage in Europe (and when seed cheques were often called Series A!), Connect Ventures is pan-European and invests in B2B and consumer software categories including SaaS, fintech, digital health and “future of work”.\n  Running throughout the firm’s investment thesis is a product focus, with the belief that “product-led, software entrepreneurs” are the kinds of founders most likely to transform the way we live and work at scale.\n You can see this digital product bent throughout a lot of its portfolio companies. For example, as B2B SaaS companies go, Typeform is about as product-focused as they come. More obviously, consumer fintech plays such as finance app Emma, and all-your-cards-in-one app Curve, also live and die by their respective apps — a theme that will continue going forward with this third fund.\n “We’re interested in building long term relationships with founders who have the obsession and focus required to build product-led companies, and the ambition to build category leaders,” says Sitar Teli, general partner at Connect Ventures, in a statement.\n One other notable thing about Connect Ventures is that it has always and continues to do fewer deals per year than many seed-stage firms — so-called “conviction investing”, as it is often referred to today. In other words, the opposite to a spray ‘n’ pray approach that favours diversification. That means not only placing bigger (and therefore riskier) bets in a smaller number of early-stage companies, but also throwing more support behind those investments, including taking a board seat, in a bid to help tip the scales towards success.\n “We’ve intentionally created a low volume, high conviction, high support investment firm to back these founders,” adds Teli. “That’s why we’ll be targeting the same curated number of seed investments with this fund, using the larger fund size to provide the right capital and support on our journey together”.\n On that note, Connect says it has already started deploying this fund with recent investments. They include BSit (the subscription-based childcare and babysitting platform), Oyster (the distributed talent enablement platform), and, as already mentioned,  fintech Emma.\n Alongside Teli, Connect Ventures’ two other general partners are Pietro Bezza and Rory Stirling (see TechCrunch’s  previous coverage of Stirling’s recruitment). The firm has backed over 50 startups to date.", "posttime": "2020-06-25 15:08:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ventures,投资", "title": "\nConnect Ventures拿出8000万美元的第三只基金支持“以产品为主导”的种子期创始人", "title_en": "\n\t\t\t\tConnect Ventures outs $80M third fund to back ‘product-led’ seed-stage founders\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/connect-ventures-three/", "via": "", "real_tags": ["ventures", "投资"]}, {"category": "", "categoryclass": "", "imagename": "6457ae7ff12a6daacd02bb6d0b4709eb.jpg", "infoid": 1008108, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "品牌收购是3-5秒的广告，可以是视频，也可以是图像。输入视频最长可达60秒，并在打开声音的情况下运行。标签挑战允许品牌通过邀请TikTok用户围绕他们选择的标签创建内容来参与用户社区。这包括hashtag Plus，它还为这种体验增加了购物功能。\n同时，品牌效应允许品牌更直接地将自己插入到内容创作体验中。该效果允许在视频的前景或背景中以2D、3D或现在的AR格式将品牌或产品添加到视频中。这些也可以与标签挑战结合起来，以提高与品牌的参与度。\n今天，随着TikTok for Business本身的正式发布，新的AR效果“品牌扫描”也被添加进来。Digiday此前抢占了TikTok的AR广告计划，指出这些计划将如何直接挑战Snapchat的赞助镜头和Word镜头的AR格式。\n除了AR效应，TikTok for Business上的大部分营销产品都是在今天之前提供的，但新平台将它们组织在一个屋檐下，并提供了一个介绍新产品的地方。\n此外，该平台还将推出一个新的电子学习中心，帮助营销人员了解TikTok及其广告产品。该中心将包括产品指南、资源和创造性最佳实践，以帮助他们发起成功的活动或了解品牌效果合作伙伴计划。\nTikTok没有公开披露其广告工具和解决方案的定价，但表示定价是基于品牌想要实现的目标和活动范围。它自己的网站详细说明了一些预算要求，例如，每天的竞选预算和总预算都不低于50美元。Digiday最近报告说，与Facebook相比，TikTok在经济衰退期间的广告费率以CPM为基础一直很便宜。\n今天，这些品牌在购买和管理他们的活动以及业绩报告方面与TikTok密切合作。但TikTok正在努力推出新的解决方案，使这一过程变得更容易。\n新平台的推出旨在将TikTok从一个营销人员可以进行实验的地方，转变为一个需要与Facebook、Instagram、Twitter和Snapchat等其他社交平台并驾齐驱的平台。\n该公司将于今天下午晚些时候在IAB的NewFronts向品牌和广告商展示该平台，在那里它将把自己定位为一个营销人员创造工作的地方，成为TikTok社区的一部分，而不是独立于社区。例如，在TikTok上，一些营销活动非常成功，以至于TikTok用户制作了他们自己的版本。\n演讲还将提出这样的观点，即TikTok平台是一个在全球范围内创造和分享文化和趋势的地方，在这里，内容可以在几个小时内在不同的受众中像病毒一样传播。\n与此相关的是，TikTok还指出，它正在选定的地区测试一个名为Creator Marketplace的新平台。这个平台于去年推出，允许品牌发现TikTok内容创作者并与其合作开展付费品牌活动，类似于YouTube的BrandConnect(最近从FameBit更名)。\nTikTok的营收在今天其面向营销人员的平台首次亮相之前就一直在增长。今年1月，有报道称，到2020年第四季度，其收入有望飙升300%以上。“信息报”(The Information)最近报道称，TikTok今年在美国的收入预计将达到5亿美元。\nTikTok负责全球商业营销的董事总经理凯蒂·普里斯(Katie Puris)在一份声明中表示：“随着TikTok for Business的推出，我们开始拥抱创意、积极和真实的时刻，这些时刻让我们的社区变得如此特别，为企业提供了解决方案，让他们与我们极具表现力的社区联系起来并发展壮大。”\n她补充说：“随着我们继续建立一个平台，让品牌为用户体验带来巨大的价值，我们很高兴继续投资于解决方案，为品牌提供一个激励他人、被发现并与TikTok社区建立有意义联系的平台。”", "note_en": "Brand Takeovers are the 3-5 second ads that can be either a video or image. In-Feed Videos can be up to 60 seconds in length and run with the sound on. Hashtag Challenges allow brands to participate in the user community by inviting TikTok users to create content around a hashtag of their choice. This includes Hashtag Plus, which also adds a shopping feature to this experience.\n Meanwhile, Branded Effects allow brands to insert themselves more directly into the content creation experience. The effects allow a brand or product to be added to a video in a 2D, 3D, or now AR format in either the foreground or background of the video. These can also be combined with Hashtag Challenges to boost engagement with the brand.\n  The new AR effect, “Brand Scan,” is being added today alongside the formal launch of TikTok For Business itself.  Digiday had previously scooped TikTok’s AR ad plans, noting how these would present a direct challenge to Snapchat’s Sponsored Lens and Word Lenses AR formats.\n Except for the AR effect, most of the marketing products on TikTok For Business were offered before today, but the new platform organizes them under one roof and provides a place to introduce new products, as they arrive.\n In addition, the platform is launching a new e-learning center that will help marketers learn about TikTok and its ad offerings. This center will include product guides, resources and creative best practices to help them launch successful campaigns or learn about the Branded Effects Partner Program.\n TikTok doesn’t publicly disclose the pricing for its ad tools and solutions, but says pricing is based on what the brand wants to achieve and the scope of its campaign. Its own website  details some of its budgeting requirements, like a $50 minimum on both daily campaign budgets and total budgets, for example. Digiday  recently reported TikTok’s ad rates on a CPM basis have been cheap amid the recession, in comparison with Facebook.\n  Today, the brands work closely with TikTok on buying and managing their campaigns and on performance reporting. But TikTok is working to roll out new solutions that will make this process easier.\n The launch of the new platform aims to move TikTok from being a place where marketers can experiment, to one that demands a seat at the table alongside other social platforms, like Facebook, Instagram, Twitter and Snapchat.\n The company will present the platform to brands and advertisers at the IAB’s NewFronts later this afternoon, where it will position itself as a place where marketers create work that becomes a part of the TikTok community, instead of being separate from it. On TikTok, some marketing campaigns were so successful that TikTok users made their own version of it, for instance.\n The presentation will also pitch the idea that the TikTok platform is a place where culture and trends are created and shared globally, and where content can go viral in hours across a diverse audience.\n Related to this, TikTok also noted it’s testing a new platform called  Creator Marketplace in select regions. This platform, introduced last year, allow brands to discover and partner with TikTok content creators on paid brand campaigns, similar to YouTube’s BrandConnect (which  recently changed its name from FameBit).\n TikTok’s revenue had been growing ahead of today’s format debut of its platform for marketers. This January, reports claimed its revenue was on track to  skyrocket over 300% by Q4 2020.  The Information more recently reported TikTok’s U.S. revenue was expected to hit $500 million this year.\n “With the launch of TikTok For Business, we set out to embrace the creative, positive, and real moments that make our community so special with solutions for businesses to connect and grow with our wonderfully expressive community,” said TikTok’s Managing Director for Global Business Marketing, Katie Puris, in an announcement.\n “As we continue to build a platform where brands bring immense value to the user experience, we’re excited to continue investing in solutions that give brands a platform to inspire others, be discovered, and meaningfully connect with the TikTok Community,” she added.", "posttime": "2020-06-25 15:08:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,tiktok", "title": "\nTikTok为营销人员推出TikTok for Business，通过新的AR广告与Snapchat展开竞争", "title_en": "\n\t\t\t\tTikTok launches TikTok For Business for marketers, takes on Snapchat with new AR ads\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/tiktok-launches-tiktok-for-business-for-marketers-takes-on-snapchat-with-new-ar-ads/", "via": "", "real_tags": ["广告", "tiktok"]}, {"category": "", "categoryclass": "", "imagename": "ac43b5085ade6b2370765dfbd2559220.jpg", "infoid": 1008107, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "引力波探测器发现了一场宇宙碰撞，在这场碰撞中，一个巨大的黑洞吞噬了一个看似太重而不是中子星，但又太轻而不是黑洞的神秘物体。该天体的质量是太阳的2.6倍，落入了一些理论预测的最重的中子星和最轻的黑洞之间的一个假想的“质量缺口”，这表明这个缺口并不存在，这些理论需要修正。\n“当然，那些认为存在质量鸿沟的人将不得不重新考虑，”没有参与观测的马里兰大学帕克分校的天体物理学家科尔·米勒(Cole Miller)说。然而，他补充说，“人们不会加入邪教，因为他们无法在世界观的这种变化中生存下来。”\n这些数据来自激光干涉仪引力波天文台(LIGO)的物理学家，这是路易斯安那州和华盛顿州的一对探测器，以及意大利的处女座(Virgo)类似的探测器。这三种仪器都由巨大的、灵敏的光学仪器组成，它们可以探测到当两个大质量物体(如黑洞)相互旋转时，空间本身短暂的伸展。自从LIGO在2015年首次探测到这种引力波以来，物理学家已经发现了数十次合并。LIGO-Virgo联合合作昨天宣布，2019年8月14日，LIGO和处女座探测器发现了质量分别是太阳23倍和2.6倍的物体的合并。\n西北大学的天体物理学家和LIGO团队成员Vicky Kalogera说，这个2.6太阳质量的天体令人惊讶，因为它正好落在质量间隙中。“现在，我们第一次看到这样的物体，”她说。她说，由于只感知碰撞产生的引力波，LIGO和处女座不能确切地分辨出这个物体是什么。但是，米勒说，核物理表明，一颗重于大约2.2个太阳质量的中子星不能支撑自己的重量，所以这个天体“几乎可以肯定”是一个黑洞。\n然而，亚利桑那大学的天体物理学家费尔亚尔·厄泽尔解释说，要在这种光线下形成黑洞并不容易。在LIGO和室女座出现之前，关于黑洞的唯一观测证据来自于对我们银河系中大约30个黑洞的研究，每个黑洞都绕着一颗伴星运行，向其输送热物质。厄泽尔和他的同事在2010年注意到，这些黑洞的质量都没有小于5个太阳质量。因此，他们假设了一个大约2.5到5个太阳质量之间的质量间隙，在这个间隙中应该既不存在中子星，也不存在黑洞。但厄泽尔强调，这一观点是建立在观察的基础上的。“黑洞不能在低于5太阳质量的地方形成，这是不是有根本的物理原因？”我们当然不这么认为，“她说。“但是，在大质量恒星演化的浪潮中，一定有什么东西让它变得非常困难。”\n随后，理论家们解释了为什么会这样。当一颗大质量恒星耗尽氢燃料，其核心开始坍塌时，中子星或黑洞都可能形成。如果恒星足够轻，核心将在超新星爆炸中坍塌为中子星，吹走恒星的其余部分。然而，如果这颗恒星太大，它的核心将收缩到一个无穷小的点，只剩下它的超强引力场：一个黑洞。理论表明，对于这些重恒星，除了最外层以外的所有层都会坠落，将黑洞的质量提高到5个太阳质量或更多。\n新的观察结果可能会削弱这一理论-米勒说，这一理论已经遭到了一些质疑。“做真实模型的超新星理论家基本上会说，‘看，向我们证明确实存在质量鸿沟，我们会努力解决的。’”他说。奥泽尔是质量差距的最初支持者之一，他似乎对这一发现并未感到不安。“这非常令人兴奋，”她说。更重要的是，LIGO和处女座已经证明了以不同的方式形成低质量黑洞是可能的。2017年8月，他们发现了两颗中子星的合并，据推测，这产生了一个2.7太阳质量的黑洞。\n哥伦比亚大学的理论天体物理学家布莱恩·梅茨格(Brian Metzger)没有参与这项工作，他说，真正的谜团可能是新观测中黑洞质量的极端不匹配。就在几周前，LIGO和处女座宣布了一个事件，其中一个黑洞的重量比另一个大四比一。在新的活动中，比例是9比1。“有趣的是极端的质量比，这很难通过人们关注的大多数(型号)来生产，”梅茨格说。\n没有人知道一开始就有几对黑洞形成了多么紧密的轨道。梅茨格说，大多数理论家主要关注两种情况：一种是围绕轨道运行的恒星对，它们都塌陷形成黑洞；另一种是单个黑洞，它们在被称为球状星团的微小的古老星系中嘎嘎作响，不知何故设法配对。这两种情况都倾向于使黑洞具有相似质量的对子。因此，梅茨格说，理论家们可能不得不为不平衡的黑洞对设想新的孵化室，或许可以从大型星系的致密中心开始。", "note_en": "Gravitational wave detectors have spotted a cosmic collision in which a giant black hole swallowed up a mystery object seemingly too heavy to be a neutron star, but too light to be a black hole. Weighing in at 2.6 times the mass of the Sun, the object falls into a hypothetical “mass gap,” a desert between the heaviest neutron star and the lightest black hole that some theories predict—suggesting the gap doesn’t exist and that those theories need to be amended.\n “People who thought there was a mass gap will have to rethink it, for sure,” says Cole Miller, an astrophysicist at the University of Maryland, College Park, who was not involved in the observation. He adds, however, “People aren’t going to be joining cults because they cannot survive this change in their worldview.”\n The data come from physicists working with the Laser Interferometer Gravitational-Wave Observatory (LIGO), a pair of detectors in Louisiana and Washington state, and Virgo, a similar detector in Italy. All three consist of huge, exquisitely sensitive optical instruments that can detect the fleeting stretching of space itself set off when two massive objects, such as black holes, swirl into each other. Since  LIGO first sensed such gravitational waves in 2015, physicists have spotted dozens of mergers. And on 14 August 2019, the LIGO and Virgo detectors spotted  a merger of objects with masses 23 and 2.6 times that of the Sun, the joint LIGO-Virgo collaboration announced yesterday.\n It’s the 2.6–solar-mass object that raises eyebrows because it falls squarely in the mass gap, says Vicky Kalogera, an astrophysicist and LIGO team member from Northwestern University. “Now, for the first time, we have seen such an object,” she says. By sensing only the gravitational waves from the collision, LIGO and Virgo cannot tell for sure what the object is, she says. But nuclear physics suggests a neutron star heavier than about 2.2 solar masses cannot support its own weight, so the object is “almost certainly” a black hole, Miller says.\n Yet it’s not easy to form a black hole this light, explains Feryal Özel, an astrophysicist at the University of Arizona. Prior to the advent of LIGO and Virgo, the only observational evidence for black holes came from the study of about 30 in our own galaxy, each of which orbits a companion star that feeds hot matter into it. None of these black holes weighs less than five solar masses,  Ozel noted and colleagues noted in 2010. So they posited a mass gap between about 2.5 and five solar masses in which there should exist neither neutron stars nor black holes. But that notion rests on observation, Özel stresses. “Is there are a fundamental physics reason black holes can’t form below five solar masses? We certainly don’t think so,” she says. “But, there must be something in the wave massive stars evolve that makes it very hard.”\n Subsequently, theorists explained why that may be so. Either a neutron star or a black hole can form when a massive star runs out of hydrogen fuel and its core begins to collapse. If the star is light enough, the core will collapse to a neutron star in a supernova explosion that blows away the rest of the star. If the star is too massive, however, its core will shrink to an infinitesimal point, leaving behind only its superintense gravitational field: a black hole. Theories suggest that, for these heavy stars, all but the outermost layers of the star fall in, boosting the black hole’s mass to five solar masses or more.\n The new observation may put a dent in that theory—which Miller says has already met with some skepticism. “The supernova theorists who do the real modeling basically say, ‘Look, show us for sure there’s a mass gap and we’ll work on it,’” he says. And Özel, one of the original proponents of the mass gap, seems unperturbed by the find. “It’s very exciting,” she says. What’s more, LIGO and Virgo have shown that it’s possible to form a low-mass black hole in a different way. In August 2017, they spotted  the merger of two neutron stars, which produced, presumably, a black hole of 2.7 solar masses.\n The real puzzle may be the extreme mismatch in the masses of the black holes in the new observation, says Brian Metzger, a theoretical astrophysicist at Columbia University who was not involved in the work. Just a few weeks ago, LIGO and Virgo announced an event in which  one black hole outweighed the other by a ratio of four to one. In the new event, the ratio is nine to one. “The interesting thing is the extreme mass ratio, which is hard to produce through most [models] people have focused on,” Metzger says.\n Nobody knows how tightly orbiting pairs of black holes form in the first place. Most theorists have focused on two general scenarios, Metzger says: either orbiting pairs of stars that both collapse to form black holes or individual black holes that rattle around in tiny, old galaxies called globular clusters that somehow manage to pair up. Both scenarios tend to make pairs in which the black holes have similar masses. So theorists may have to dream up new hatcheries for lopsided black hole pairs, Metzger says, perhaps by starting in the dense centers of large galaxies.", "posttime": "2020-06-25 15:07:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "揭示,waves,质量", "title": "引力波揭示了观测到的最轻的黑洞", "title_en": "Gravitational Waves Reveal Lightest Black Hole Ever Observed", "transed": 1, "url": "https://www.sciencemag.org/news/2020/06/gravitational-waves-reveal-lightest-black-hole-ever-observed", "via": "", "real_tags": ["揭示", "waves", "质量"]}, {"category": "", "categoryclass": "", "imagename": "4b7d9ecba1881eda1176c27aaa7da297.png", "infoid": 1008106, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Alex是ML增强的范围索引，在功能上类似于B+树。我们的实现几乎是std：：map或std：：multimmap的临时替代品。您可以在我们的SIGMOD 2020文章中了解有关Alex的更多信息。\nAlex可以用作头文件。所有相关的头文件都在src/core中。你需要至少用C++14标准编译你的程序(例如，-std=c++14)。\n一个简单的基准测试，用于测量Alex上运行点查找和插入的吞吐量(下面将详细说明)。\n在Windows上，只需将此存储库作为CMake项目加载到Visual Studio中即可。在Linux/Mac上，使用以下命令：\n#使用CMake构建，这将创建一个新的构建目录。/build.sh#运行示例程序。/build/example#运行单元测试。/build/test_alex。\n但是，要观察Alex的真实性能，我们必须在更大的数据集上运行。您可以从Google Drive下载200M密钥(1.6 GB)的数据集。要在此数据集上运行一个工作负载示例：\n您还可以在您自己的数据集上运行此基准测试。您的键需要为二进制格式或文本格式(每行一个键)。如果键的数据类型不是DOUBLE，则需要在src/Benchmark/main.cpp中将#DEFINE KEY_TYPE DOUBLE修改为#DEFINE KEY_TYPE[您的数据类型]。\n与B+树一样，ALEX是一种索引排序数据的数据结构，并支持混合了点查找、短范围查询、插入、更新和删除的工作负载。在内部，ALEX使用分层组织成树的线性回归集合来模拟键的分布。ALEX使用此模型按键高效地搜索数据记录。ALEX还自动调整其内部模型和树结构，以有效地支持写入。\nAlex的灵感来自于Kraska等人的原始学习索引。然而，该工作只支持读取(即，点查找和范围查询)，而Alex还有效地支持写入(即，插入、更新和删除)。\n在只读工作负载上，Alex超过了Kraska等人最初学习到的索引。性能提高高达2.2倍，索引大小最多减小15倍。\n在各种读写工作负载中，Alex最多可将B+树(由STX B+Tree实施)的性能提高4.1倍，同时将索引大小降低2000倍。\nAlex目前在内存、单线程和数字键上操作，我们正在考虑如何向Alex添加对持久性、并发性和字符串键的支持。\nAlex的前提是使用一组线性回归对密钥分布进行建模，因此，当密钥分布很难用线性回归建模时，即密钥分布在小范围内高度非线性时，Alex的性能较差，未来可能的研究方向是使用更广泛的建模技术(例如，也考虑多项式回归模型)。\nAlex在存在极端异常值的情况下性能可能很差，这可能会导致键域和Alex的树深度变得不必要地大(请参阅本文的第5.1节)。未来可能的研究方向是添加特殊的逻辑来处理极端异常值，或者采用对稀疏密钥空间具有健壮性的建模策略。\nAlex是同时支持AlexMap和AlexMultimap的内部实现。它提供了稍微多一点的功能。\n键和有效负载(即映射的类型)是分开存储的，因此取消引用迭代器将返回键/有效负载对的副本，而不是引用。我们的迭代器具有直接分别返回对键或有效负载的引用的方法。\n目前我们只支持数字键类型，不支持任意的自定义键类型，所以不能更改类模板中的默认比较函数。\n这个项目欢迎大家提供意见和建议。大多数投稿需要您同意贡献者许可协议(CLA)，声明您有权并且实际上确实授予我们使用您的投稿的权利。欲了解详情，请访问https://cla.opensource.microsoft.com.。\n当您提交Pull请求时，CLA机器人将自动确定您是否需要提供CLA并适当地装饰PR(例如，状态检查、评论)。只需按照机器人提供的说明操作即可。使用我们的CLA，您只需在所有报告中执行此操作一次。\n此项目已采用Microsoft开放源代码准则。有关更多信息，请参阅行为准则常见问题解答，或联系opencode@microsoft.com提出任何其他问题或意见。", "note_en": "ALEX is a ML-enhanced range index, similar in functionality to a B+ Tree.Our implementation is a near drop-in replacement for std::map or std::multimap.You can learn more about ALEX in our  SIGMOD 2020 paper.\n    ALEX can be used as a header-only library.All relevant header files are found in  src/core.You will need to compile your program with at least the C++14 standard (e.g.,  -std=c++14).\n  A  simple benchmark that measures the throughput of running point lookups and inserts on ALEX (explained in detail below).\n On Windows, simply load this repository into Visual Studio as a CMake project.On Linux/Mac, use the following commands:\n # Build using CMake, which creates a new build directory./build.sh# Run example program./build/example# Run unit tests./build/test_alex\n   However, to observe the true performance of ALEX, we must run on a much larger dataset.You can download a 200M-key (1.6GB) dataset from  Google Drive.To run one example workload on this dataset:\n  You can also run this benchmark on your own dataset.Your keys will need to be in either binary format or text format (one key per line).If the data type of your keys is not  double, you will need to modify  #define KEY_TYPE double to #define KEY_TYPE [your data type] in  src/benchmark/main.cpp.\n  Like the B+ Tree, ALEX is a data structure that indexes sorted data and supports workloads that contain a mix of point lookups, short range queries, inserts, updates, and deletes.Internally, ALEX uses a collection of linear regressions, organized hierarchically into a tree, to model the distribution of keys.ALEX uses this model to efficiently search for data records by their key.ALEX also automatically adapts its internal models and tree structure to efficiently support writes.\n ALEX is inspired by the  original learned index from Kraska et al..However, that work only supports reads (i.e., point lookups and range queries), while ALEX also efficiently supports write (i.e., inserts, updates, and deletes).\n  On read-only workloads, ALEX beats the  original learned index from Kraska et al. byup to 2.2X on performance with up to 15X smaller index size.\n Across the spectrum of read-write workloads, ALEX beatsB+ Trees (implemented by  STX B+ Tree) by up to 4.1X while never performing worse, withup to 2000X smaller index size.\n   ALEX currently operates in memory, single threaded, and on numerical keys.We are considering ways to add support for persistence, concurrency, and string keys to ALEX.\n  The premise of ALEX is to model the key distribution using a collection of linear regressions.Therefore, ALEX performs poorly when the key distribution is difficult to model with linear regressions, i.e., when the key distribution is highly nonlinear at small scales.A possible future research direction is to use a broader class of modeling techniques (e.g., also consider polynomial regression models).\n ALEX can have poor performance in the presence of extreme outlier keys, which can cause the key domain and ALEX&#39;s tree depth to become unnecessarily large(see Section 5.1 of  our paper).A possible future research direction is to add special logic for handling extreme outliers, or to have a modeling strategy that is robust to sparse key spaces.\n   Alex is the internal implementation that supports both AlexMap and AlexMultimap. It exposes slightly more functionality.\n  Keys and payloads (i.e., the mapped type) are stored separately, so dereferencing an iterator returns a copy of the key/payload pair, not a reference.Our iterators have methods to directly return references to the key or payload individually.\n  Currently, we only support numerical key types.We do not support arbitrary user-defined key types.As a result, you should not change the default comparison function in the class template.\n   This project welcomes contributions and suggestions. Most contributions require you to agree to aContributor License Agreement (CLA) declaring that you have the right to, and actually do, grant usthe rights to use your contribution. For details, visit  https://cla.opensource.microsoft.com.\n When you submit a pull request, a CLA bot will automatically determine whether you need to providea CLA and decorate the PR appropriately (e.g., status check, comment). Simply follow the instructionsprovided by the bot. You will only need to do this once across all repos using our CLA.\n  This project has adopted the  Microsoft Open Source Code of Conduct.For more information see the  Code of Conduct FAQ orcontact  opencode@microsoft.com with any additional questions or comments.", "posttime": "2020-06-25 15:06:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ml,alex", "title": "ALEX：ML-增强的范围索引，功能类似于B+树", "title_en": "Alex: ML-enhanced range index, similar in functionality to a B+ Tree", "transed": 1, "url": "https://github.com/microsoft/ALEX#introduction", "via": "", "real_tags": ["ml", "alex"]}, {"category": "", "categoryclass": "", "imagename": "4d24d4d4a4335206bbc3f5fdb30b2dc8.png", "infoid": 1008105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "免责声明：这是一篇高度自以为是的文章，得到了我和其他人寻找程序员人才的个人经验的支持。\n在12个月的时间里，我进行了数百次采访。在过去的5年里，我浏览和评估了数百份潜在的求职者简历--所有这些都是在积极领导前端和后端开发团队的同时。\n因此，我认为公平地说，我看到了相当多的人才获取行动。这可能使我有资格陈述我即将展示的一些经验，说明为什么你的GitHub个人资料很重要。\n正如许多千禧一代和Z世代逐渐认识到的那样，找到工作并不是最直接的成就。我们可能会觉得自己只是老一辈棋局中的棋子，但我们必须了解的是，这真的是关于你如何通过推销自己来玩这个游戏。\n我们为什么要做我们作为程序员所做的事情呢？因为我们是建设者和创造者。\n为了实现您作为程序员的任何目标，我们需要找到对需要我们服务的人可见的方法。毫无疑问，谋生不是自然而然的-现在有新冠肺炎在我们身后，这就更加困难了。\n为了给自己制定一个战略计划，开始学习是必不可少的。掌握自己的命运最终会帮助你在提升技能和展示你作为软件开发人员的才华时所面临的未知领域。\n设计师和艺术家使用一个文件夹来展示过去的作品和他们创造性的一面来推销自己。同样，topcoder.com、具有星级的自由职业者网站简介和gihub简介等网站也是程序员的投资组合。这是一个通过展示我们擅长的东西来打开大门的机会。\n在Github上拥有个人资料并不能保证你得到梦想中的工作，但至少它为更多的机会铺平了道路。动摇招聘者思想的额外激励是一个机会。\n不要积极争做自己的品牌。让它自然地引起你的共鸣。让它成为一种习惯。\n我全心全意地相信这是真的-如果我没有尽可能以最好的方式宣传我的品牌，我就不会有今天的成就。每天，我们都有机会展示我们能做什么和我们能做什么。能够很好地展示这些东西可以确保机会之门为我们敞开。\nGitHub不仅仅是一个源代码存储库。这比它各部分的总和还多。你有没有想过Git是像Facebook或Twitter一样的社交网络？它们的特点是相似的-你建立一个个人资料，上传项目分享，并通过“关注”其他用户的账户与他们联系。\n可以共享的内容不一定要是代码-没有什么可以阻止您在项目文件夹中保留pdf、Word或文本文档或任何其他文件类型。\n许多机构大约10%-20%的时间都在创新。剩下的工作通常是单调的，这需要一些基本的编程知识来处理乏味而又必需的任务。最好的公司还雇佣了大量不太熟练的开发人员，他们处理一般单调的活动。20/80规则适用--尽管我们可能不想承认这一点，因为这是一颗难以下咽的药丸！\n找到脱颖而出的方法至关重要。GitHub为招聘人员提供了关于以下方面的各种见解：\n你问问题的方式或者。回答有关GitHub问题部分的问题。在我看来，他的解决了一些最棘手的问题(还有Stackoverflow)。\n拥有Git配置文件会有所帮助，因为我们至少可以在一定程度上衡量您是否遵循最佳实践或编码原则。是的，我们中的一些招聘经理会在谷歌上搜索你，以检查你是否为开源项目做出了贡献，或者是否在StackOverflow这样的地方积极参与了在线讨论。\n技术招聘人员倾向于从你的社交媒体个人资料中寻找关于你的信息-你的GitHub个人资料也不例外。\n让我们来看看如何让你的GitHub为求职做好准备。\n拥有完整的个人资料会给招聘者留下你是自我组织的印象。你可能会争辩说，简历或LinkedIn个人资料就足够了，但它们并不能清楚地描述你的能力-证据就在代码中。\n有一个目标或愿景很重要，在优化你的Github个人资料时，根据你希望接触的目标受众优化和定制你的个人资料是很重要的。\n一旦你确定了你的目标受众是谁，就该开始决定你想要如何展示自己了。\n让我们在你的Github个人资料上浏览一下你需要的最低限度。\n添加你的照片，后面跟着一段简短的个人简介，并链接到任何其他展示你所做工作的相关网站。\n如果你在找工作，你必须打扮得漂漂亮亮的；看起来不整洁是无济于事的。招聘过程仍然是一个人的过程，第一印象有很长的路要走。避免通常不会不惜一切代价寄给雇主的照片。\n你要确保的一件事是，你在GitHub的个人资料上看起来很放松，避免过度正式的照片，但要保持专业。当你不确定的时候，尽量选择半休闲的。\n使用@提及链接到您希望招聘人员注意到的其他Git存储库。这可能是您的公司、组或您正在参与或管理的其他存储库。\n包括你的网站的URL-如果你有一个并且看起来不错的话。例如，如果你在StackOverflow或CodePen上很活跃，可以添加指向它们的链接来展示你的热情，以及你在帮助其他软件开发人员方面的投入程度。\n你需要意识到的一件事是，谷歌是一个很棒的链接生成器。在多个社交媒体网站上重复使用同一用户名可以让招聘人员很容易找到你。我们最不想让他们发现的是，你的副业与你在Upwork上的日常工作直接竞争，或者你在Instagram上有不合适的图片。你关起门来或在你的社交圈里做什么是你的特权-但你也需要意识到，并不是每个人都会对此抱有不加评判的心态，特别是一些可能有严厉政策的公司。\n如果你碰巧在找工作，出现在你个人资料顶部的固定储存库应该向招聘人员展示你想要突出显示的储存库，这应该是相关的，并显示已经完成的工作。\n技术招聘人员不是盲人。我们中的一些人确实会花时间仔细检查你的GitHub个人资料和简历，不管网上一些高度自以为是的文章可能会说些什么。如果你的回购来自教程，很有可能像我这样的招聘人员之前已经看过几次了。复制粘贴了过于简单的项目，这些项目都是关于CRUD的，这些项目都来自于您刚刚填空的教程，这并不能说明您的能力。无论出于什么原因，如果您有很多复制粘贴的代码，最好不要固定并调用它们。\n如果你要固定技术演示，一定要在使用过时技术的大型项目之前固定那些与相关技术相关的技术。\n如果您在市场上寻找一份SPA开发人员的工作，那么可以将相关技术(例如，角度、Vue JS技术演示)与您五年前从事的遗留JSP+jQuery项目联系起来。\n如果您和大多数程序员一样，您可能没有以任何身份运行一个成功的开放源码项目。您的大部分日常代码生产都是高度专有的，但这不应该成为展示一个或多个令人印象深刻的项目的障碍。\n如果您属于这一类，请将重点放在您选择的框架中一些有趣的小演示上。\n如果你碰巧没有想法，试着想一个你已经解决的问题，这会成为一个有趣的演示。也许您可以快速重写一些部分。或者更好的做法是，请求你的雇主授权出版不侵犯所有权和版权的文章。\n作为开发人员，我们要做的一件关键事情就是派生公共存储库，然后向原始存储库发送拉请求。\n这种方法往往会导致开发人员拥有包含数百个零贡献分叉存储库的概要文件。这会让你看起来前后不一致，到处都是。仅当您做出的贡献最终在根存储库中时才派生存储库。\n这可能会让很多人百思不得其解。星级存储库向招聘人员和访问者表明您的兴趣，因此它们应该反映您的技能。你主演的东西会影响人们对你的看法。\n对于这一次，听我把话说完。寻找高级职位的人应该主演包含更复杂项目的存储库，避免太多的初学者教程存储库-当然，除非你是有原因的。如果您正在申请初级入门级职位，或者您已经表示您目前正在学习某项新技术，那么将这两个存储库列为主角是“有意义的”。\n一旦您选择了几个要展示的存储库，请确保它们是可公开访问的，并且没有被密码锁定。\n所有项目都应该有一个自述文件。我想我们都明白自述文件的目的。至少要向您的项目添加说明。这可能听起来很明显，但它值得重申，因为对一些人来说，显而易见的事情并不总是那么明显。\n描述：对于只有一分钟时间的人来说，这是一种让人容易理解的描述。让复杂的事情变得困难是容易的，让复杂的事情变得容易是困难的。\n堆栈是什么？列出使项目工作的所有核心相关框架和库。这让可能不熟悉每一个框架的技术招聘人员一眼就知道什么是重要的。\n这个项目的愿景是什么？清楚地说明这个项目的发展方向。\n项目处于什么阶段？指明您在项目中所处的位置。例如，它是完成的还是正在进行的？如果工作正在进行，清楚地说明已经完成了什么、等待完成了什么，或者什么没有奏效。我喜欢放一条免责声明，以防人们想要使用在生产环境中完成的工作。如果突出显示了一些不起作用的东西，这是完全没有问题的。\n如果你计划展示一个大型项目，可能会有很多没有趣味的样板或“管道”。请毫不犹豫地指出最酷的部分在哪里。\n如果你的项目是分叉的，并且你正在积极地为它做贡献，那么要非常清楚地表明你在做什么，已经完成了什么。\n尽一切努力确保运行项目的演示版本是一项单行活动。活动，如NPM运行、分级服务、码头运行或您的框架使用的任何东西。\n在今天这个时代，几乎没有理由有一长串手动依赖项和预先设置来运行任何东西。\n#在本地主机上使用热重新加载服务：8080 npm run dev#使用最小化npm run build构建用于生产的版本。\n现在是2020年了-您可能已经听过很多次了-单元测试是程序员需要养成的关键习惯之一。如果您要将任何有意义的东西放在那里，而项目没有单元测试，那么您可能不应该引用它-它会给您带来负面影响。没有任何借口。\n我们都知道，对于大多数开发人员来说，编写单元测试用例是一种很难养成的习惯。编写单元测试用例说明了很多关于您的情况--像我这样的招聘人员肯定希望看到这一点，并提供关于如何执行测试用例的明确说明。\n就像谚语“一张图片胜过千言万语”一样，拥有现场演示的链接也是如此。例如，一些关于你的项目词语如何能给人一种专业感的东西。\n您可以利用其他选择，例如GitLab和Bitbucket-每个都有其独特的卖点。由于GitHub的采用率和网络效应，在社会证明方面，GitHub仍然是一个更好的选择。GitHub上还公开托管了更多高价值的开源项目，这些项目在谷歌搜索中排名相当靠前。\n我们已经看到，你可以做一些可行的事情来提升自己的地位和获得理想工作的可能性。这不仅仅是创建一个漂亮的Github账户，它确实能告诉你很多关于你的思维过程的信息。\n我们应该始终记住，面试过程不仅是关于你创建了多少项目或你懂多少语言，也是关于人际交往技能和文化契合度。\n仅仅因为您没有GitHub配置文件并不意味着您不是一个好的开发人员。我们中的许多人都有多年的商业专有项目，这些项目都是用保密协议(NDA)叠层的，我们希望可以展示，但不能-这并不意味着我们不能花一些时间在副业上做一些事情。\n在另一个频谱上拥有Github个人资料可能会给你带来优势。有优势总比没有强。有一个好的问题并不意味着你知道自己的东西，你仍然可能在空洞的问题上可怕地失败，但有一个也意味着-隔壁可能在等着你。\n雇主们明白很难在工作和个人喜爱的项目之间保持平衡。那些拥有最新的GitHub个人资料和摄像头的人展示了有意义的开源项目，确实表明他们愿意投入时间-付出更多的努力来帮助开源社区，或者通过他们的贡献为社会提供更广泛的价值。\n加强你的Github账户只是你作为一名程序员可以在你的自我品牌武器库中保留的工具之一，可以给你带来额外的优势。", "note_en": "Disclaimer:  This is a highly opinionated piece backed up by my and other people’s personal experience sourcing programmer talent.\n I’ve conducted hundreds of interviews over a span of 12 months. I’ve browsed and evaluated hundreds of potential candidate resumes over 5 years — all while actively leading a team of front and back end developers.\n So, I think it’s fair to say, I’ve seen quite a lot of talent acquisition action. This probably makes me qualified to state some of the experiences which I am about to present on why your GitHub profile matters.\n As many millennials and Gen Z are getting to understand, finding a job isn’t the most straightforward feat to accomplish. We may feel as though we’re simply pawns in an older generation’s game of chess, but what we must learn is that it’s truly about how you play the game by marketing yourself.\n Why do we do the things we do as programmers? Because we’re builders and creators.\n  To achieve any of your goals as a programmer, we need to find ways to be visible to the people that need our services. There is no doubt that making a living is not natural —and it’s hard so much more now that we have Covid-19 lurking over our shoulder.\n It’s essential to start learning in order to create a strategic plan for yourself. Being in control of your fate will ultimately help you navigate the uncharted territories you’ll face when upskilling and showcasing your talent as a software developer.\n Designers and artists use a portfolio to showcase past work and their creative side to sell themselves. Similarly, places like topcoder.com, freelance website profiles with star ratings, and GitHub profiles are portfolios for programmers. They’re an opportunity to open the doors by presenting what we’re good at.\n Having a profile on Github, does not guarantee you the job of your dreams but it at least paves the way for more opportunities. An extra incentive to sway a recruiter&#39;s mind is an opportunity.\n  Don’t actively strive to be your own brand. Let it be something that resonates with you naturally. Let it become a habit.\n I wholeheartedly believe this to be true — I would not have got where I am today if I did not put my brand forward in the best light possible. Every day we’re presented with opportunities to showcase what we can do and what we’re capable of. Being able to present these things well ensures the doors of opportunity open for us.\n  GitHub is more than just a source code repository. It’s more than the sum of its parts. Have you ever thought of Git as a social network like Facebook or Twitter? The characteristics are similar — you build a profile, upload projects to share, and connect with other users by “following” their accounts.\n Content that can be shared does not necessarily have to be code — nothing is preventing you from keeping pdf, word or text documents, or any other file types in your project folders.\n Many agencies innovate about 10–20% of the time. The rest of the work is often monotonous, which requires some basic programming knowledge in handling the tedious yet required tasks. The best companies also employ a good number of not-so-skilled developers who deal with generic monotonous activities. The 20/80 rule applies — as much as we may not want to admit this as it’s a hard pill to swallow!\n It’s vitally important to find ways to stand out. Github gives recruiters various insights on:\n How you ask questions or. respond to question on the GitHub issues section. his, in my opinion, is where some of the hardest problems are solved (Along with Stackoverflow).\n Having a Git profile helps because we can at least gauge to a certain extent if you follow best practices or coding principles. Yes, some of us hiring managers do Google you to check whether you contribute to open-source projects or actively participate in online discussions in places like StackOverflow.\n Technical recruiters tend to scout for information about you from your social media profiles — your GitHub profile is no exception to that.\n Let’s take a look at how to prep your GitHub for job seeking.\n  Having a complete profile gives recruiters the impression that you’re self-organized. You may argue that CV or LinkedIn profiles are sufficient, but they don’t give a clear picture of your abilities — the proof is in the code.\n Having a target goal or vision is important, and optimizing and tailoring your profile to the target audience your wishing to reach out to is important when optimizing your Github profile.\n  Once you have decided who your target audience is, it’s time to start making decisions about how you want to present yourself.\n Let’s walk through at the bare minimum you need on your Github profile.\n  Add your picture, followed by a short bio, and links to any other relevant websites that showcase what you do.\n If you’re job-seeking, you must look groomed; looking unkept won’t help. The recruitment process is still a human one and first impressions go a long way. Avoid pictures you wouldn’t usually send to an employer at al costs.\n One of the things you want to ensure is that you look relaxed on your GitHub profile and that you avoid overly formal pictures but stay professional. When in doubt, aim for semi-casual.\n  Use an @ mention to link to other Git repositories that you want the recruiter to notice. That could be your company, group, or other repositories you’re participating in or managing.\n  Include the URL to your site — if you have one and it looks decent. If you’re active on StackOverflow or CodePen, for example, add links to these to showcase your passions and how engaged you are in assisting other software developers.\n One of the things you need to realize is that Google is a great link generator. Reusing the same username on multiple social media sites makes it easy for recruiters to find you. The last thing we need is for them to discover that your side hustles are in direct competition with your current day job on Upwork, or that you have inappropriate images on Instagram. What you do behind closed doors or within your social circles is your prerogative—but you also need to realize that not everyone will have an unjudging mindset about it, especially some corporations that may have draconian policies.\n  If you do happen to be looking for a job, the pinned repositories that appear at the top of your profile should showcase repositories that you want to highlight to the recruiter, which should be relevant and show work that has been done.\n   Technical recruiters aren’t blind. Some of us do take time to scrutinize your GitHub profiles and CVs regardless of what some highly opinionated articles might say online. If your repo is from a tutorial, there’s a high probability that a recruiter such as myself has seen it a few times before. Having copy-pasted overly simple projects that are all about CRUD, all coming from tutorials where you’ve just filled in the blanks, doesn’t tell much about your abilities. If for whatever reason, you have a lot of copy-pasted code it’s probably in your best interest not to pin and to call them out.\n If you’re going to pin tech demos, do pin those with relevant technologies before larger projects with outdated technology.\n If you’re on the market for a SPA developer job, then pin related tech, e.g., Angular, Vue JS tech demos over that legacy JSP + jQuery projects you were working on five years ago.\n If you’re like most programmers, you’re probably not running a successful open source project in any capacity. Most of your day to day production of code is highly proprietary, But this shouldn’t be a blocker to having one or more impressive projects to showcase.\n If you fall into this category, focus on some interesting small demos in your framework of choice.\n If you happen to run out of ideas try to think about a problem that you solved that would make for an interesting demo. Perhaps you can quickly rewrite some parts. Or even better, ask your employer for authorization to publish pieces that do not violate ownership and copyrights.\n  One of the key things we do as developers is forking public repositories and then sending pull requests to the original repo.\n What tends to happen with this approach is that developers have profiles containing hundreds of forked repositories with zero contributions. This can make you look inconsistent and all over the place. Only fork a repository if you’ve made contributions that ended up in the root repositories.\n  This will probably grind many people’s gears. Starred repositories indicate to recruiters and visitors your interests, so they should reflect your skills. The things you have starred influences how you are perceived.\n  For this one, hear me out. People looking for a senior position should be starring repositories containing more complex projects and avoiding too many beginners tutorial repositories — unless, of course, you’re contributing for a reason. If you’re applying for a junior entry-level position or you’ve indicated that you’re currently learning a certain new piece of technology, then having starred those two repositories “makes sense.”\n  Once you’ve selected a few repositories to showcase, make sure they’re publicly accessible and not locked under a password.\n All projects should have a README file. I think we all understand the purpose of a README file. At a minimum, add a description to your project. This may sound obvious, but it’s worth reiterating as the obvious is not always so obvious for some.\n  A description: One that makes it easy to understand for someone who has only a minute. Making complicated things hard is easy, making complex things easy is hard.\n  What’s the stack? List all the core relevant frameworks and libraries that make the project work. This gives technical recruiters, who may not be familiar with every single framework, a glimpse of what’s important right off the bat.\n What’s the vision of the project? Clearly illustrate where this project is heading.\n At what stage is the project? Indicate where you are with the project. For example, is it complete or work in progress? If work in progress, state clearly what is done and what is pending or what’s not working. I like to put a disclaimer in case people want to use work done in a production environment. It’s perfectly fine to have stuff that does not work if it’s been highlighted.\n  If you plan on showcasing a large project, there is probably a lot of boilerplate or “plumbing” that’s uninteresting. Don’t hesitate to indicate where the cool parts are.\n If your project has been forked and you’re actively contributing to it make it abundantly clear what you’re working on and what has been completed.\n   Try, by all means, to ensure running a demo version of your project is a one-line activity. Activities such as  npm run,  graddle serve,  docker run or whatever is used by your framework.\n In this day and age, there’s very little reason to have a long list of manual dependencies and pre-setup to run anything.\n  # serve with hot reload at localhost:8080 npm run dev # build for production with minification npm run build\n  It’s 2020— you have probably heard it said many times — unit testing is one of the key habits a programmer needs to develop. If you’re going to put anything meaningful out there and the project does not have unit tests, then you probably shouldn’t reference it — it reflects poorly on you. There are no excuses.\n We all know that writing unit test cases is a habit that, for most developers, is hard to develop. Writing unit test cases says a lot about you — recruiters such as myself would definitely like to see this showcased, with clear instructions on how to execute your test cases.\n  Like the adage “a picture is worth a thousand words,” the same goes for having a link to a live demo. For example, something about how your project words can give a sense of professionalism.\n  There are alternatives that you can leverage, such as GitLab and bitbucket — each with its unique selling point. Github is still a better alternative when it comes to social proof, due to its adoption and network effect. There are also more high-value opensource projects hosted publicly on GitHub, which rank pretty high on google searches.\n  We’ve seen actionable things you can do to elevate your status and the likelihood of getting your dream job. There’s more to it than just creating a pretty-looking Github account, but it does tell you a lot about your thought processes.\n We should always remember that the interview process is not only about how many projects you’ve created or how many languages you know, it’s also about interpersonal skills, and cultural fit.\n Just because you don’t have a GitHub profile doesn’t mean you’re not a good developer. Many of us have years of commercial proprietary projects under our belt that are laminated with NDA’s that we wish we could show but can’t — that doesn’t mean we can’t take some time to do a little on the side.\n Having a Github profile on the other spectrum may give you an edge. Having an edge is better than not having one. Having a good one doesn’t also mean you know your stuff, you could still fail horribly on fizz buzz questions, but having one also means — the next door may be waiting for you.\n Employers understand its hard to keep a balance between work and personal pet projects. Those that have up-to-date GitHub profiles and cam demonstrate meaningful opensource projects do show that they’re willing to put in the time — to go the extra mile to help the opensource community or to provide value to society more generally through their contributions.\n Beefing up your Github account is just one of the tools you can keep in your arsenal of self-branding as a programmer to give you that extra edge.", "posttime": "2020-06-25 15:04:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,开发,品牌,branding,项目", "title": "个人品牌作为开发者，你的GitHub个人资料比你想象的要重要得多", "title_en": "Personal Branding as a Developer Your GitHub Profile Matters More Than You Think", "transed": 1, "url": "https://medium.com/better-programming/personal-branding-as-a-developer-why-your-github-profile-matters-more-than-you-think-c4367c0f4db1", "via": "", "real_tags": ["github", "开发", "品牌", "branding", "项目"]}, {"category": "", "categoryclass": "", "imagename": "88199ebc649435de89528e4b6dd301a0.png", "infoid": 1008104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着黑人领导的反对种族主义和警察暴行的运动继续推动政客们重新考虑警务在我们生活中扮演的角色，最大限度地减少政府使用监控技术追踪和监视人们的权力的努力已经升温。多亏了马萨诸塞州和全国各地活动人士和组织(包括EFF)的不懈努力，本周波士顿加入了禁止政府使用面部监控的城市行列。\n波士顿将成为美国第十个禁止政府使用人脸识别技术的城市，去年，加利福尼亚州通过了一项为期三年的禁令，禁止警察佩戴和手持摄像头使用FRT。\n然而，尽管公共卫生和隐私专家一致认为，公众信任对于有效应对新冠肺炎大流行至关重要，但世界各国政府都在史无前例地使用包括面部监控技术在内的监测工具来应对新冠肺炎大流行；以及。\n然而，面部监控技术已被证明对非裔美国人和AAPI面孔不太准确，面部监控中的种族偏见有可能伤害已经面临更高水平的监控和骚扰的有色人种社区；以及。\n然而，马萨诸塞州的几个市政当局，包括斯普林菲尔德、萨默维尔、布鲁克林和剑桥，已经通过了当地立法，禁止面部监控…。\nEFF负责社区组织的副主任内森·谢尔德在波士顿市议会就面部监控的危害作证。“面部监控是非常危险的，”他告诉委员会，“首先，在跟踪我们的面部时，这是一个我们无法改变的独特标记，它侵犯了我们的隐私。”第二，政府在公共场所使用这项技术将使人们不敢从事第一修正案保护的活动…。第三，监控技术对有色人种、移民和其他弱势群体有不公平的影响。“。\nEFF给波士顿市议会发了一封信[PDF]，建议对该条例进行三项改进。理事会通过了所有三项法案。其中一个堵住了一个漏洞，该漏洞可能允许警方要求第三方为他们收集人脸识别证据。另一项变化是向成功起诉伦敦金融城违反政府使用面部监控禁令的个人提供律师费。否则，只有资金充裕的组织或富人才能执行这项关键的新禁令。\n并非巧合的是，这项禁令在波士顿市议会一致通过的同一天，纽约时报发表了一篇关于罗伯特·朱利安-博尔恰克·威廉姆斯(Robert Julian-Borchak Williams)案件的长篇文章，在人脸识别技术错误地将他识别为一起盗窃案的嫌疑人后，他被底特律警方逮捕。问题不仅仅是研究发现，当涉及到与有色人种的面孔匹配时，面孔识别的准确性令人震惊且截然不同。更大的担忧是，在警方手中，这项技术对脆弱社区构成了威胁，因为警察部门本身对这些社区进行了不成比例的监视和巡逻。\nEFF长期以来一直主张在全国范围内禁止政府使用面部监控。你可以通过加入我们的斗争，告诉你的民选官员禁止这项技术，或者让你的当地代表提出我们的示范法案，在你所在的城镇禁止面部监控，从而提供帮助。", "note_en": "The push to minimize the government’s power to track and spy on people with surveillance technology has picked up steam as the Black-led movement against racism and police brutality continues to push politicians to reconsider the role policing plays in our lives. Thanks to the tireless efforts of activists and organizations in Massachusetts and around the country, including EFF, this week Boston joins the ranks of cities that have banned government use of face surveillance.\n Boston will become the   tenth city  in the United States to ban government use of face recognition technology. Last year, the state of California passed a   three-year moratorium  on the use of FRT on police body-worn and hand-held cameras.\n  Whereas,  Governments around the world are responding to the COVID-19 pandemic with an unprecedented use of surveillance tools, including face surveillance technology, despite public health and privacy experts agreeing that public trust is essential to an effective response to the pandemic; and\n Whereas,  Facial surveillance technology has been proven to be less accurate for African American and AAPI faces, and racial bias in facial surveillance has the potential to harm communities of color who are already facing increased level of surveillance and harassment; and\n Whereas,  Several municipalities in Massachusetts, including Springfield, Somerville, Brookline, and Cambridge, have passed local legislation to ban face surveillance…\n Nathan Sheard, EFF’s Associate Director of Community Organizing, testified before the Boston City Council on the hazards of face surveillance. “Face surveillance is profoundly dangerous,” he told the council, “First, in tracking our faces, a unique marker that we cannot change, it invades our privacy. Second, government use of the technology in public places will chill people from engaging in first-amendment protected activities… Third, surveillance technologies have an unfair, disparate impact against people of color, immigrants, and other vulnerable populations.”\n EFF sent a letter [  PDF ] to the Boston City Council suggesting three improvements to the ordinance. The Council adopted all three. One closed a loophole that might have allowed police to ask third parties to collect face recognition evidence for them. Another change provides attorney fees to a  person who brings a successful suit against the City for violating this ban on government use of face surveillance. Otherwise, only well-funded organizations or wealthy individuals would be able to enforce this critical new ban.\n It is no coincidence that this ban passed unanimously through Boston’s city council on the same day that the   New York Times   published a long piece  on the case of Robert Julian-Borchak Williams, who was arrested by Detroit police after face recognition technology wrongly identified him as a suspect in a theft case. The problem isn’t just that studies have found face recognition staggeringly and disparately   inaccurate  when it comes to matching the faces of people of color. The larger concern is that in the hands of police, the technology poses a threat to vulnerable communities by virtue of the fact that police departments themselves disproportionately surveil and patrol those neighborhoods.\n EFF has long advocated for a nation-wide ban on the government’s use of face surveillance. You can help by   joining our fight ,   telling  your elected officials to ban the technology, or getting your local representatives to introduce our   model bill  that will ban face surveillance in your town.", "posttime": "2020-06-25 15:03:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "波士顿,boston", "title": "胜利波士顿禁止政府使用面部监控", "title_en": "Victory Boston Bans Government Use of Face Surveillance", "transed": 1, "url": "https://www.eff.org/deeplinks/2020/06/victory-boston-bans-government-use-face-surveillance", "via": "", "real_tags": ["波士顿", "boston"]}, {"category": "", "categoryclass": "", "imagename": "3a06146f69cafaed4f35a7323b40c707.jpg", "infoid": 1008101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "孙正义表示，他认为此举是从阿里巴巴集团董事会“毕业”，这是他迄今最成功的投资。他迅速采取行动，为这家日本集团的投资战略辩护。最近几个季度，阿里巴巴集团的投资战略一直受到密切关注和公众嘲笑。\n孙正义说，他的企业集团的持股已经恢复到冠状病毒爆发前的水平。在电信运营商阿里巴巴集团与T-Mobile合并后，该公司受益于阿里巴巴集团价值的上升及其在Sprint的股份。孙正义说，他的公司的互联网回报率(IRR，风投基金用来展示业绩的流行指标)达到了25%。\n在今天的股东大会上，他说他担心很多人认为软银已经“完蛋了”，并称之为“SoftPunku”，这是日语中的一个口语用法，意思是坏了的东西。他说，所有这些加在一起，软银的股东价值现在达到2,180亿美元。\n孙正义坚称，他将以良好的关系离开阿里巴巴集团董事会，他自2005年以来一直担任这一职位，他与马云之间没有任何分歧。\n孙正义此举之前，阿里巴巴集团的联合创始人马云在上任13年后于上月离开了软银董事会。20年前，孙正义向阿里巴巴投资了2000万美元，这是出了名的。今年早些时候，软银仍持有价值1000亿美元的阿里巴巴股份。\n软银最近的一系列投资惊动了投资界。这家以开大额支票而闻名的公司公开表示，它对叫车巨头优步(Uber)、办公空间管理公司WeWork和其他一系列初创公司的投资并没有提供它希望的回报。\n其中几家公司，包括Oyo，一家预算低廉的印度初创公司，更是受到了大流行的沉重打击。\n孙正义通过出售T-Mobile股份筹集了200亿美元，他说，考虑到他最近的其他交易，软银已经积累了350亿美元，占计划出售投资总额的80%。", "note_en": "Son said he sees the move as “graduating” from  Alibaba Group’s   board, his most successful investment to date, as he swiftly moved to defend the Japanese group’s investment strategy, which has been the subject of scrutiny and public mockery in recent quarters.\n Son said his conglomerate’s holding has recovered to the pre-coronavirus outbreak levels. The firm has benefited from the rising value of Alibaba Group and its stake in Sprint, following the telecom operator’s merger with T-Mobile. Son said his firm has seen an internet rate of return (or IRR, a popular metric used by VC funds to demonstrate their performance) of 25%.\n  In a shareholder meeting today, he said he was worried that many people think that SoftBank is “finished” and are calling it “SoftPunku,” a colloquial used in Japan which means a broken thing. All combined, SoftBank’s shareholder value now stands at $218 billion, he said.\n Son insisted that he was leaving the board of Alibaba Group, a position he has held since 2005, on good terms and that there hadn’t been any disagreements between him and Ma.\n Son’s move follows Jack Ma, who co-founded Alibaba Group, leaving the board of SoftBank last month after assuming the position for 13 years. Son famously invested $20 million in Alibaba 20 years ago. Early this year, SoftBank still owned shares worth $100 billion in Alibaba.\n A range of SoftBank’s recent investments has spooked the investment world. The firm, known for writing big checks, has publicly stated that its investment in ride-hailing giant  Uber,   office space manager  WeWork,   and a range of other startups has not provided the return it had hoped.\n Several of these firms, including Oyo, a budget-lodging Indian startup, has moreover  been hit hard by the pandemic.\n Son, who has raised $20 billion by selling T-Mobile stake, said after factoring in other of his recent deals SoftBank had accumulated $35 billion or 80% of the total planned unloading of investments.", "posttime": "2020-06-25 14:05:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "集团,board", "title": "\n孙正义辞去阿里巴巴董事会职务；为软银集团投资战略辩护", "title_en": "\n\t\t\t\tMasayoshi Son resigns from board of Alibaba; defends SoftBank Group’s investment strategy\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/24/masayoshi-son-resigns-from-board-of-alibaba-defends-softbank-groups-investment-strategy/", "via": "", "real_tags": ["集团", "board"]}, {"category": "", "categoryclass": "", "imagename": "8711627a8f7390a8242786fb1f5fc559.jpg", "infoid": 1008100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对齐马内参与者和美国参与者进行比较的计算机分析发现，两组参与者通常都保留了演奏给他们的音符之间的音高间隔-例如，保持中C和中A之间的差异。两组人也都能很好地区分最高只有4000赫兹的音高，接近钢琴上的最高音调C8。对于比这更高的音符，每个人似乎都很难描述不同之处。\n然而，在他们如何回唱音符方面，出现了一个奇怪的不同之处。当演奏的音符很高或很低时，美国参与者会在他们的音域内准确地将音符转换成八度。齐马内人没有。对他们来说，似乎不清楚在他们的音域内哪些音符最符合他们听到的音符。他们的反应似乎根本没有反映出对八度结构的看法。\n研究人员甚至指导齐马内人转换八度音阶。他们会给出反馈，比如“太棒了！”(Tsimané中的ANIC jäm‘)或“OK”(Dam’jäm‘)，取决于他们的回答与提示笔记的距离有多近。然而，村民们并没有走近。看起来，不同八度的音符，比如高C和中C，在齐马内人听起来并不像在美国人听起来一样。\n研究人员在研究中承认，结果可能反映了人们唱歌方式的差异，而不是人们对音高的感知。但他们认为，收集到的全部数据，包括一些更直接的八度感知测量，使证据的权重偏向于感性解释。齐马内人以前也表现出了感知上的差异：在麦克德莫特和他的同事们早先的一项研究中，齐马内人对不和谐的音高组合进行了评级，西方听众认为这种组合很刺耳，与更和谐的和弦一样令人愉悦。\n此外，根据麦克德莫特和他的同事们的说法，如果齐马内在测试中的表现更多地与唱歌能力有关，而不是他们的感性经验，那么这将意味着所有人都有绝对的音调-这一想法在实验上没有得到很好的支持。取而代之的是，研究人员推测，大脑识别音高的默认方法是基于音符之间的相对差异，而绝对音高可以帮助识别分散在八度上的音符，这是通过经验学习的。他们暗示，齐马内通常没有这些经历。\n齐马内人有不同寻常的音乐习惯，通常独自演唱歌曲，不带乐器。在演唱和演奏多声部音乐的文化中，音乐家们经常跨越八度改变旋律和音符，以包括不同的音域和乐器。一些专家认为，齐马内人缺乏这些做法可能会为八度等值的发展提供基础。\n庆应大学CompMusic实验室主任帕特里克·萨维奇(Patrick Savage)听说这个团队的结果时，“我非常惊讶，”他说。他在研究文献中寻找其他方法来解释这些发现，但一无所获。“我认为他们是对的。”\n神经科学几乎没有提供关于八度音阶等值如何在大脑中发挥作用的具体想法，但八度音阶的物理基础让许多研究人员似乎相信，我们对八度音阶的感知可能是固定在听觉皮质中的。然而，来自Tsimané的结果表明，基于文化经验，这个系统可能会有不同的发展，这表明大脑的听觉处理系统比预期的更具可塑性。\n这些结果与悠久的人种学研究传统很好地契合，说明了音乐在不同文化中的许多不同之处。马古利斯说：“如果你走遍世界，向人们询问他们自己文化中的音乐，人们通常会认为这是某种程度上的自然现象。”她补充说，像这样的研究有助于强调生活经验在我们的基本感觉中的作用。\n这将包括我们对八度音阶等价感的培养。这项研究的合著者、智利教皇天主教大学政府学助理教授爱德华多·翁杜拉加(Eduardo Undurraga)说，“你真的需要接触到这一点--从某种程度上说，是经过训练的--才能让你的大脑适应这两者都是一个音符的想法。”\n康涅狄格大学音乐动力学实验室的博士后Ji Chul Kim将这个过程比作他从韩国搬来时沉浸在英语中。起初，他可以分辨出英语元音，特别是说美语的人发出的元音，不是他从小就带着的，但他甚至无法对感知到的差异进行分类。有了接触和经验，他发现识别和复制声音变得自动了。齐马内的研究指出了类似的学习方式，只是用八度而不是元音。“这是我们理解文化如何发展的一个非常重要的基石。不仅仅是音乐文化--文化如何发展，以及文化中的个人如何发展自己的能力，“Kim说。\n萨维奇说，需要用更多的文化进行研究。仅仅通过两种文化的比较就可以确定感知的某些特征并不是通用的，但随着研究人员揭开生物学与经验的相互作用，还有更多的东西需要了解。\n然而，为这种跨文化研究寻找机会并适当地进行可能是具有挑战性的。科技和商业使西方文化几乎无处不在；像齐马内这样与之隔绝的群体极其罕见。此外，涉及与世隔绝的部落和其他外来文化的科学研究历史充满了伦理和科学问题；玛格丽特·米德(Margaret Mead)近一个世纪前对萨摩亚人的有缺陷的研究只是一个例子。(为了避免误解和剥削的问题，麦克德莫特的团队聘请了当地的翻译来解释任务，并用钓鱼线等商品补偿唱歌志愿者。)。但是，对于希望了解我们的行为和感知有多少是与生俱来的科学家来说，除了这些比较之外，几乎没有其他选择。\n虽然在先天与后天之间经常发生冲突，但生物学和经验实际上是深深交织在一起的，音乐为两者提供了一个科学揭示的交叉点。这项研究的主要作者、马克斯·普朗克经验美学研究所的研究小组组长诺里·雅各比(Nori Jacoby)说：“从定义上讲，音乐认知是一种文化产物，同时它依赖于我们的听觉系统。”他补充说，更多的数据将有助于澄清这种循环关系。“我们将发现的情况要微妙得多。”", "note_en": "Computer analyses that compared the Tsimané participants with those in the United States found that both groups generally preserved the pitch intervals between the notes played to them — for example, maintaining the difference between a middle C and middle A. Both groups could also discriminate well between pitches only up to about 4,000 hertz, near the highest key on a piano, C8. For pairs of notes higher than that, everyone seemed to have trouble characterizing the differences.\n A curious difference emerged, however, in how they sang the notes back. When the notes played were very high or low, U.S. participants accurately shifted the notes into an octave within their vocal range. The Tsimané didn’t. To them, it seemingly wasn’t clear what notes in their range best corresponded to the ones they heard. Their responses didn’t seem to reflect a perception of octave structure at all.\n  The researchers went so far as to coach the Tsimané to switch octaves. They gave feedback, like “excellent!” ( Anic jäm’ in Tsimané) or “OK” ( Dam’ jäm’), depending on how close their responses were to the notes of the prompt. The villagers did not get closer, however. It appeared that the same notes in different octaves, like high C and middle C, didn’t sound alike to the Tsimané as they did to people in the U.S.\n The researchers acknowledged in the study that the results might reflect differences in how people sing, and not in how people perceive pitch. But they argued that the totality of collected data, including some more direct measures of octave perception, put the weight of evidence on the side of a perceptual explanation. The Tsimané have shown perceptual differences before: In  an earlier study by McDermott and his colleagues, the Tsimané rated dissonant combinations of pitches, which Western listeners find grating, to be just as pleasant as more consonant chords.\n Moreover, if the Tsimané’s performance in the tests has more to do with singing ability than their perceptual experience, then it would mean that all people have absolute pitch — an idea that is not well supported experimentally, according to McDermott and his colleagues. Instead, the researchers speculate that the brain’s default approach to identifying pitch is based on relative differences between notes, while absolute pitch, which can help with recognizing notes scattered across octaves, is something learned through experience. They suggest that Tsimané have generally not had those experiences.\n  The Tsimané have unusual musical habits, usually performing songs solo and without instruments. In cultures that sing and play music with multiple parts, the musicians often shift melodies and notes across octaves to include different vocal ranges and instruments. In the view of some experts, the absence of those practices among the Tsimané might provide a foundation for the development of octave equivalence.\n When  Patrick Savage, the director of the CompMusic Lab at Keio University, heard about the team’s results, “I was very surprised,” he said. He scoured the research literature for other ways to explain the findings but came up empty. “I think they’re right.”\n Neuroscience has offered few concrete ideas about how octave equivalence might operate in the brain, but the physical basis for octaves made it seem credible to many researchers that our perception of them might be hard-wired into the auditory cortex. Results from the Tsimané, however, indicate that this system may develop differently based on cultural experience, suggesting that the brain’s auditory processing system is more malleable than expected.\n The results mesh well with a long tradition of ethnographic research illuminating the many ways music differs across cultures. “If you go around the world and you ask people about the music in their own culture, people often think that it’s somehow natural,” Margulis said. Studies like this one help to underscore the role of life experience in even our basic senses, she added.\n That would include our development of a sense of octave equivalence. “You really have to be exposed to this — in a way, trained — to attune your brain to this idea that both are the same note,” said  Eduardo Undurraga, an assistant professor of government at the Pontifical Catholic University of Chile and a co-author of the study.\n  Ji Chul Kim, a postdoctoral fellow at the University of Connecticut’s Music Dynamics Laboratory, likened the process to his immersion in English when he moved from South Korea. Initially, he could tell that English vowels, especially as voiced by American speakers, were not what he had grown up with, but he couldn’t even categorize the perceived differences. With exposure and experience, he found that identifying and replicating the sounds became automatic. The Tsimané study points to a similar kind of learning, only with octaves instead of vowels. “It’s a very important building block in our understanding of how cultures develop. Not just musical culture — how cultures develop, and then how individuals within that culture develop their abilities,” Kim said.\n Research with more cultures is needed, Savage said. Comparisons of just two cultures can establish that certain features of perception aren’t universal, but there is far more to learn as researchers unravel how biology interacts with experience.\n  Finding opportunities for such cross-cultural studies and conducting them properly can be challenging, however. Technology and commerce make Western culture almost universally pervasive; groups like the Tsimané who are somewhat insulated against it are extremely rare. Moreover, the history of scientific studies involving isolated tribes and other outsider cultures is fraught with ethical and scientific issues; Margaret Mead’s flawed studies of the Samoan people almost a century ago are only one example. (To help avoid problems with misunderstanding and exploitation, McDermott’s team hired local interpreters to explain the tasks and compensated the singing volunteers with goods like fishing line.) But there are few alternatives to these comparisons for scientists hoping to understand how much of our behavior and perception is innate.\n Though often pitted against each other as nature versus nurture, biology and experience are actually deeply entwined, and music provides a scientifically revealing intersection of the two. “Music cognition is by definition some kind of a product of culture, and at the same time it relies on our auditory system,” said  Nori Jacoby, research group leader at the Max Planck Institute for Empirical Aesthetics and lead author of the study. More data will help clarify this circular relationship, he added. “The picture we’ll find is much more nuanced.”", "posttime": "2020-06-25 14:03:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "八度,musical,研究", "title": "对音乐八度的感知是后天习得的，而不是大脑中的连线", "title_en": "Perceptions of Musical Octaves Are Learned, Not Wired in the Brain", "transed": 1, "url": "https://www.quantamagazine.org/perceptions-of-musical-octaves-are-learned-not-wired-in-the-brain-20191030/", "via": "", "real_tags": ["八度", "musical", "研究"]}, {"category": "", "categoryclass": "", "imagename": "46db4c76147dfdb5920056181d5ba13d.jpg", "infoid": 1008098, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，当苏·谢弗(Sue Schafer)得知“华盛顿邮报”(The Washington Post)计划发表一篇关于她所做过的最愚蠢的事情之一的报道时，她对这篇3000字的文章提出了与许多读者相同的问题：“抗议活动中，华盛顿邮报漫画家2018年万圣节派对复兴会上的黑脸事件”：为什么这有新闻价值？\n“华盛顿邮报”新闻编辑部的读者也在问这个问题。“邮报”的一位知名记者说：“我在”华盛顿邮报“采访过的人都不知道我们为什么要发表这篇报道。”“我们无缘无故地毁了这个女人的生活。”\n2018年，谢弗参加了在邮报普利策奖获奖社论漫画家汤姆·托尔斯家中举行的万圣节派对。谢弗服装的基础是时下流行的。美国全国广播公司(NBC)最近解雇了梅根·凯利(Megyn Kelly)，因为她在广播中表示，她不明白为什么人们把黑脸作为万圣节服装的一部分必然被认为是种族主义的。谢弗是白人，她决定扮成黑脸梅根·凯利来讽刺这位主播。\n这不是一个好主意，而且，可以预见的是，它不会被很好地接受。那天晚上，谢弗多次就这件带有种族攻击性的服装与她对质-送她去托尔斯家的出租车司机；派对的联合主持人史蒂夫·罗克林(Steve Rochlin)，他告诉“华盛顿邮报”，他指示她“要么洗掉，要么离开”；派对上的几位客人，其中一位会在近两年后向报纸揭发她的行为，导致事件“重新浮出水面”，正如“华盛顿邮报”的标题所说。聚会后的第二天，谢弗打电话给托尔斯，为她的着装道歉。\n这是一个关于一个女人无知的令人羞愧的故事，但为什么它会出现在一家主要的全国性报纸上？“华盛顿邮报”的编辑标准宣称“公平包括相关性”。非公众人物最近的、非犯罪的不良行为通常不被认为是新闻，在6月17日之前，谢弗是一名平面设计师，没有公开形象，也没有明显的权力或野心来获得它。除了导致谢弗丢掉工作外，把这篇报道以相当长的篇幅刊登在该报“时尚”版块的头版，并配以一位备受赞誉的专业摄影师的原创照片，还有什么意义呢？\n邮报说，谢弗的违规行为是新闻，因为它发生在托尔斯面前，可能发生在专栏作家达娜·米尔班克附近的某个地方。\n该报发言人克里斯·科拉蒂(Kris Coratti)说，“”华盛顿邮报“的员工，包括一位知名主持人，都卷入了这起事件，这迫使我们自己彻底、准确地讲述故事，同时让所有相关人员都有自己的发言权，”该报发言人克里斯·科拉蒂(Kris Coratti)说。“这篇文章以细微的差别和敏感地传达了两年前媒体人物参加的派对上复杂而令人担忧的情况，当时一个黑脸的人没有被及时告知离开。”美国与种族主义的斗争已经进入一个阶段，那些曾经认为应该保持沉默的人现在开始在公共场合发出自己的声音。这个故事是这个国家现在正在经历的一个缩影。“。\n出版物自我报道并不少见，尽管通常他们这样做是因为他们已经在新闻中了。先发制人的报道引起了人们对利益冲突的严重担忧：如果“华盛顿邮报”塑造了一篇关于自己的新故事的叙述，它可能会以一种旨在保护该报利益的方式这样做。当政客们这样做时，记者们愤世嫉俗地将其称为“走在故事的前面”-其想法是，新信息对公众认知的影响比澄清、更正或增加已经公开的信息更大。\n如果这篇文章所谓的新闻目的是审问“华盛顿邮报”员工的行为，那么它在几个方面是失败的。\n这篇文章表明，“华盛顿邮报”唯一一名甚至知道黑脸服装的员工是托尔斯。米尔班克的出席和服装-布雷特·卡瓦诺(Brett Kavanaugh)戴着啤酒头盔-都在文章中提到，但没有引用他的话，文章也没有说他被问到了任何问题，包括他是否看到了谢弗的服装或反对它。(米尔班克告诉纽约，他从来没有见过黑脸的人。)。文章中没有提到其他“华盛顿邮报”员工--事实上，根本没有其他“媒体人物”--尽管科拉蒂证实有更多的“华盛顿邮报”员工出席了会议。他们是谁？他们是否比米尔班克更“卷入这起事件”？他们有没有告诉谢弗黑脸是错的？谁能说呢-科拉蒂说，她所说的“参与”，只是指员工参加了派对，“华盛顿邮报”没有报道更多细节。\n“华盛顿邮报”将这篇报道视为对其员工和其他媒体人物行为的必要解释的理论的另一个问题是，该报在发表后是如何处理这篇报道的。据我们统计，6月17日这篇文章在网上发布后不久，共有四名“华盛顿邮报”员工在推特上分享了这篇文章。其中一名员工将这篇文章描述为“显然是一团糟”，并承认在推特上发布之前没有完整阅读。这篇文章的两位作者马克·费舍尔和西德尼·特伦特都没有在Twitter或Facebook上分享过这篇文章，尽管费舍尔在这两个平台上都很活跃，他本月写的每一篇文章都是在这两个平台上发布的。(费舍尔拒绝就这篇报道发表评论。在回应置评请求时，特伦特说：“我会请您参考我们公司的回应。我期待着读你的故事。“)。\n在发表后的几个小时内，这篇报道开始在社交媒体上受到记者的广泛批评，理由是它让主题被解雇了，而且缺乏新闻价值。(读者必须读完故事的85%才能了解到，当谢弗告诉她的雇主故事将会播出时，她已经失业了。)。这篇文章现在已经吸引了2000多条网络评论，这些评论本质上是压倒性的负面。然而，除了向报道“华盛顿邮报”报道的媒体发表公关声明外，“华盛顿邮报”对这篇报道的批评一直保持沉默。如果这是“华盛顿邮报”感到“被迫”报道的一篇“细微差别和敏感”的报道，那么为什么只有一位非记者发言人为“邮报”的新闻进行了热情洋溢的辩护呢？在为这篇报道采访了10名现任“华盛顿邮报”记者后，我们得出的答案是，该报的员工通常认为这篇报道是站不住脚的。\n“和大家一样，我的反应是，见鬼，怎么回事？为什么这是一个故事？“。邮报的一位特写作家告诉纽约。“我的第二个反应是，为什么这是一部3000字的特写？”这位特写作家补充说，“这不是由‘风格’部分起草的。”\n“Style”的两名知情员工表示，“Style”的员工对这篇文章在他们的地盘上运行感到困惑和不满。“Style”是该报长篇故事的首发地点。费舍尔和特伦特都不在“时尚”办公桌工作，尽管随着报纸越来越专注于数字发行，报纸版面之间的墙壁变得更加漏洞百出。\n虽然这篇文章作为对华盛顿特区“媒体人物”文化的新闻调查失败了，但它通过一个不同的衡量标准取得了成功：它确保了谢弗在文章中首当其冲地受到批评-例如，描述了她在去派对的路上在出租车上的麻木不仁的互动，这一事件发生在任何媒体人物在场的情况下-在组织上对“华盛顿邮报”的曝光率最低。如果泄露的是《华盛顿邮报》疏于追查一篇关于黑脸的报道，或者如果把消息带到邮报的女性把它带到了另一个渠道，或者只是在推特上谈论了这件事，谁知道这篇报道可能会走向何方。\n这个故事最初是通过管理顾问莱克西·格鲁伯(Lexie Gruber)传到《华盛顿邮报》的，她和她的朋友、艺术家莱里克·普林斯(Lyric Prince)在2018年当晚与谢弗对峙。活动结束后，普林斯立即在Facebook上发布了关于这次交流的消息。派对上的另一位客人也与谢弗对质，很快就在Medium上写下了这件事。与此同时，格鲁伯试图确认谢弗的身份，他在派对上戴着一个名牌，上面写着“你好，我的名字是梅根·凯利。”19个月后的6月9日，格鲁伯联系了她不认识的托尔斯，请求帮助确认这名女子的身份。(格鲁伯是作为客人的客人出席派对的。)。她附上了一张聚会上谢弗的照片。托尔斯谎称认不出她来。\n在没有确认黑脸女子身份的情况下，格鲁伯联系了“华盛顿邮报”的媒体专栏作家玛格丽特·沙利文(Margaret Sullivan)。(报道本身指出，格鲁伯发送了一封“电子邮件，寻求”华盛顿邮报“对这一事件的报道”。)。\n6月14日，格鲁伯给沙利文发了一条信息，“暗示那个穿着黑脸的人可能是”华盛顿邮报“的制片人，”沙利文告诉纽约。沙利文将这条消息转发给了几个特写部门的编辑，她说，“在那之后，几乎就失去了它的踪迹，直到它发表。”这条消息没有提到具体的“华盛顿邮报”员工是黑脸嫌疑人。但没过多久，“华盛顿邮报”的记者们就证实，戴过黑脸的不是他们的同事-费舍尔在6月15日之前就和谢弗通了电话。\n谢弗告诉纽约，当她问费舍尔-一名和特伦特一样在邮报工作了20多年的记者-为什么这个故事是新闻时，他回答说，“我们必须这么做，否则他们会去另一个媒体。”格鲁伯也说，特伦特问她是否在与其他媒体交谈。\n对于从事尚未报道的报道的记者来说，询问消息来源或主题是否在与其他媒体交谈并不少见；记者是好胜心强的，往往看重第一。邮报否认费舍尔将该报对报道的兴趣与消息可能在其他地方传播的可能性联系在一起。邮报发言人科拉蒂说，费舍尔只是告诉谢弗，把这个故事带到邮报的两位派对嘉宾可能会把它带到其他地方，以回答谢弗关于他们是否会这样做的问题。\n但另一位接受费舍尔采访的人士称，“他向我表达了他对这个故事的疑虑.”这位人士说，费舍尔给人的印象是，他被告知要做这篇报道，这不是他的决定。\n费舍尔采访的第三个人讲述了类似的交流。“他告诉我，从个人的角度来看，他认为这个故事不一定有必要出现在那里，这是他个人的观点，”这位人士说。“他把这件事归功于”华盛顿邮报“的其他高级编辑，说它必须去掉，而且他声称这件事不是他能控制的，尽管是他写的。”(“我们的编辑不会‘强迫’人们写故事，”科拉蒂说。)。\n巧合的是，当这篇黑脸故事在6月18日出版时，它被定位在沙利文的媒体专栏旁边，专栏的标题是“坏消息判断和我学到的教训”。格鲁伯和普林斯在华盛顿马尔科姆X公园(Malcolm X Park)的圣女贞德(Joan Of Arc)雕像前摆姿势，照片中有一张与这篇印刷和在线文章配套的照片-由自1993年以来一直担任邮报员工摄影师的迈克尔·S·威廉姆森(Michael S.Williamson)拍摄。但在6月22日，也就是这篇报道在网上发表的五天后，以及这张照片以印刷形式流传的四天后，它被从邮报的网站上删除了，没有更换图片，也没有解释这一决定的编辑说明。\n科拉蒂说：“一旦我们得知受到了人身威胁，我们就把它取了下来--我们在其他情况下也出于同样的原因采取了类似的措施。”\n谢弗黑脸的照片一直保留在文章正文中，直到6月24日，它也消失了。邮报没有回应为什么这张照片被删除的问题。\n“华盛顿邮报”的编辑指导方针规定，“作为编辑政策，我们不会批准删除请求。”虽然指导方针允许在受到威胁的情况下删除“公开可获得的个人数据”，但它们并不意味着“华盛顿邮报”会取消发布一篇“华盛顿邮报”的编辑工作产品-一张照片-因为它伴随着一篇导致威胁的报道。科拉蒂没有回答“华盛顿邮报”是否曾在类似情况下未刊登过一名工作人员摄影师的新闻照片，而这张照片的拍摄对象是自愿摆姿势的。值得注意的是，“华盛顿邮报”两次违反了自己的编辑政策，显然是为了安抚格鲁伯和普林斯：尽管由此产生的报道违反了“华盛顿邮报”关于相关性的编辑标准，但仍对这一事件进行了报道，然后删除了报道中的一个编辑部分，违反了“华盛顿邮报”关于删除请求的编辑标准。\n格鲁伯告诉纽约，她对这个故事的反应“感到震惊”，她说，其中包括严重的骚扰和威胁，以至于她获得了安全。她说，她最近读了乔恩·朗森写的“让你当众羞愧”，这本书讲述了那些在互联网上被拖走的人会发生什么。6月7日，在“华盛顿邮报”的报道和余波促使她将自己的社交媒体账户设为私人账户之前，格鲁伯在推特上写道：“我理解取消种族主义者的冲动。但事实是-我们都是种族主义者，这就是问题所在。我们都应该得到学习和改变的恩典。让我们利用这些时刻来改变心意，而不是公开羞愧。“。\n格鲁伯对记者们将如此多的注意力转移到谢弗-以及她自己和普林斯-而不是派对上更知名的人身上表示惊讶。“我可以理解人们的好奇心：他们为什么要写一篇如此关注普通公民的文章？”她说。“但汤姆(托尔斯)是一名普通公民。对我来说，这是一个更大的问题，人们去游行，然后和黑脸的人喝酒跳舞。“。\n托尔斯的漫画继续每天播出，科拉蒂说，托尔斯没有因为故事中讨论的任何行为而受到邮报的纪律处分。任何雇主都很难为雇员过去私人未能纠正非雇员令人反感的行为而证明职业后果是正当的。但对托尔斯来说，没有任何管理后果似乎会削弱该报关于这个故事具有新闻价值的理由：托尔斯未能迅速命令谢弗离开他的房子，怎么可能同时如此重要，以至于值得在报纸上进行长篇报道，而不够重要，不足以值得工作场所纪律呢？这篇报道还清楚地表明，托尔斯误导了格鲁伯和“华盛顿邮报”的一名记者-首先，他告诉格鲁伯，“很多人出现在我不认识的人面前，我不认识你询问的那个女人”，然后告诉一名记者，他并不是声称不认识谢弗，只是说他“没有意识到任何不良意图”。\n谢弗的报道发生在邮报编辑管理因与多样性和新闻哲学相关的问题而面临巨大压力的时候。该报执行主编马蒂·巴伦(Marty Baron)与两名记者-韦斯利·洛厄里(Wesley Lowery)和费利西亚·桑梅斯(Felicia Sonmez)-围绕社交媒体上的客观性问题发生了冲突。韦斯利·洛厄里高调主张报纸在报道时采取更明确的道德立场，后来他离开了邮报，加入了哥伦比亚广播公司新闻(CBS News)。据纽约查阅的一封电子邮件显示，随着两年前万圣节派对的报道，邮报的高级经理们最近收到了32页的员工故事，这些故事是由员工工会收集的，内容涉及公司内部的种族主义和歧视。邮报员工要求改变招聘和编辑做法的请愿书在48小时内吸引了近500人签名。基本上，这是“华盛顿邮报”发生“黑脸丑闻”最糟糕的时候，特别是它无法控制框架的时候。\n洛厄里说：“从外部看，似乎很明显有人向”华盛顿邮报“投诉了这起愚蠢的事件，他们认为最好的公关方式是通过自己报道来体现透明度，而不是把它作为人力资源问题来处理。”“但似乎没有人想到的是，对涉及普通公民的愚蠢事件给予大量关注，肯定会带来微不足道的好处，造成巨大的伤害-包括对”华盛顿邮报“本身的伤害。”\n在美国报纸面临员工压力的同时，它们也面临着来自新闻消费者的压力，这些消费者对他们对公平的承诺持怀疑态度。一个挑战是，“公平”对不同的人意味着不同的东西，并朝着洛厄里在“道德清晰度”中所说的“道德清晰度”迈进。\n就像经常发生的情况一样，如果“华盛顿邮报”只是遵循自己出版的“公平包括相关性”的编辑指导，它就会做出正确的决定，并将这一故事传递出去。当被反复要求给这个词下定义时，新闻编辑部的领导层没有回应纽约。\n提交您的电子邮件，即表示您同意我们的条款和隐私通知，并接受我们的电子邮件通信。", "note_en": "Last week, when Sue Schafer learned that the Washington  Post planned to publish a story about one of the dumbest things she had ever done, she had the same question that many readers would have about the resulting 3,000-word  article, “Blackface Incident at  Post Cartoonist’s 2018 Halloween Party Resurfaces Amid Protests”:  Why is this newsworthy?\n  Readers within the  Post newsroom were asking the question, too. “No one I’ve spoken with at the  Post can figure out why we published this story,” said one prominent reporter at the paper. “We blew up this woman’s life for no reason.”\n      In 2018, Schafer attended a Halloween party at the home of Tom Toles, the  Post’s Pulitzer Prize–winning editorial cartoonist. The basis for Schafer’s costume was topical. NBC had recently fired Megyn Kelly after she said, on the air, that she didn’t understand why it was necessarily considered racist for people to wear blackface as part of a Halloween costume. Schafer, who is white, decided to lampoon the anchor by dressing as Megyn Kelly–in–blackface.\n    It wasn’t a good idea, and, predictably, it didn’t go over well. That night, Schafer was repeatedly confronted about the racially offensive costume — by the cabdriver who took her to Toles’s house; by the party’s co-host, Steve Rochlin, who told the  Post he instructed her to “wash that off or go”; and by several guests at the party, one of whom would tip the newspaper to her actions nearly two years later, causing the incident to “resurface,” as the  Post’s headline put it. The day after the party, Schafer called Toles and apologized for what she had worn.\n      This is a mortifying tale about one woman’s cluelessness, but why did it end up in a major national newspaper? The  Post’s editorial standards declare that “fairness includes relevance.” The non-recent, non-criminal bad acts of non-public figures are not ordinarily considered news, and before June 17, Schafer was a graphic designer with no public profile and no apparent power or ambitions to obtain it. What was the point of publishing this story — at considerable length, accompanied by original photography from an acclaimed staff photographer, on the front page of the paper’s “Style” section — besides causing Schafer to lose her job?\n  The  Post said Schafer’s transgression was news because it happened in front of Toles and somewhere possibly in the vicinity of columnist Dana Milbank.\n  “Employees of the Washington  Post, including a prominent host, were involved in this incident, which impelled us to tell the story ourselves thoroughly and accurately while allowing all involved to have their say,” said Kris Coratti, a spokesperson for the paper. “The piece conveys with nuance and sensitivity the complex, emotionally fraught circumstances that unfolded at the party attended by media figures only two years ago where an individual in blackface was not told promptly to leave. America’s grappling with racism has entered a phase in which people who once felt they should keep quiet are now raising their voices in public. The story is a microcosm of what the country is going through right now.”\n        It’s not unusual for publications to report on themselves, though ordinarily they do so because they are already in the news. Proactive reporting creates significant concerns about conflicts of interest: If the  Post shapes the narrative of a new story about itself, it may do so in a way that is designed to protect the paper’s interests. When politicians do this, reporters cynically refer to it as “getting out ahead of the story” — the idea being that new information has more impact on public perception than a clarification or correction or addition to already public information.\n  And if the supposed journalistic purpose of the article was to interrogate the actions of employees of the  Post, it failed in a few ways.\n  The only  Post employee the article demonstrates to have even had knowledge of the blackface costume is Toles. Milbank’s attendance and costume — Brett Kavanaugh with beer helmet — are noted in the article, but he’s not quoted, nor does the article say he was asked any questions, including whether he saw Schafer’s costume or objected to it. (Milbank tells  New York he never saw anyone in blackface.) No other  Post employees — in fact, no other “media figures” at all — are named in the article, though Coratti confirms there were additional  Post employees in attendance. Who were they? Were they any more “involved in this incident” than Milbank was? Did they tell Schafer blackface is wrong? Who can say — Coratti said that by “involved,” she meant only that the employees attended the party, and no further details were reported in the  Post.\n      Another problem with the theory that the  Post saw the story as a necessary accounting of the behavior of its employees and other media figures is how the paper handled the story after publication. By our count, a total of four  Post employees shared the article on Twitter shortly after its publication online on June 17. One of those employees characterized the story to  New York as “obviously a mess” and admitted to not having read it in full before tweeting it. Neither of the article’s authors, Marc Fisher and Sydney Trent, has shared it on Twitter or Facebook, even though Fisher is active on both platforms, where he has posted every other article he wrote this month. (Fisher declined to speak on the record for this story. In response to a request for comment, Trent said , “I would refer you to our corporate response. I look forward to reading your story.”)\n    In the hours after publication, the story started to  receive  widespread  criticism from journalists on social media on the grounds that it got its subject fired while lacking news value. (Readers had to get 85 percent of the way through the story to even learn that Schafer had lost her job when she told her employer the story would be running.) The article now has drawn over 2,000 web comments, which are overwhelmingly negative in nature. Yet aside from PR statements to outlets covering the Post’s coverage, the  Post’s response to the criticism of this story has been silence. If this is a story with “nuance and sensitivity” that the  Post felt “impelled” to run, why is a spirited defense of the Post’s journalism coming only from a non-journalist spokesperson for the paper? The answer we reached, after interviewing ten current  Post journalists for this story, is that the paper’s staff generally does not consider the story to be defensible.\n      “My reaction, like everybody, was,  What the hell? Why is this a story?” a feature writer at the  Post told  New York. “My second reaction was,  Why is this a 3,000-word feature?” The feature writer added, “This was not drawn up by the ‘Style’ section.”\n  Employees at “Style” — the paper’s premiere location for long-form storytelling — were confused and displeased to see the piece running on their turf, two  Post employees with knowledge of the situation said. Neither Fisher nor Trent works for the “Style” desk, though as newspapers have gotten increasingly focused on digital distribution, the walls between newspaper sections have become more porous.\n  While the piece failed as a journalistic investigation of the culture of Washington, D.C.’s “media figures,” it succeeded by a different metric: It ensured that Schafer bore the brunt of the criticism in the piece — for example, describing her insensitive interaction in the taxi en route to the party, an incident that occurred outside the presence of any media figures — with minimum organizational exposure to the  Post. If it had leaked that the  Post had neglected to pursue a story about blackface, or if the women who brought the tip to the  Post had taken it to another outlet or simply tweeted about it, who knows what direction the story might have taken.\n          The story first arrived at the  Post via management consultant Lexie Gruber, who, along with her friend Lyric Prince, an artist, had confronted Schafer that night in 2018. Immediately after the event, Prince posted about the exchange on Facebook. Another guest at the party, who also confronted Schafer, soon wrote about it on  Medium. Meanwhile, Gruber tried and failed to identify Schafer, who, at the party, had worn a name tag that read “Hello, My Name Is Megyn Kelly.” Nineteen months later, on June 9, Gruber contacted Toles, whom she didn’t know, to ask for help identifying the woman. (Gruber had attended the party as a guest of a guest.) She attached a photo of Schafer from the party. Toles claimed, falsely, not to recognize her.\n  Without confirmation of the identity of the woman in blackface, Gruber reached out to Margaret Sullivan, the  Post’s media columnist. (The story itself notes that Gruber sent an “email seeking  Post coverage of the incident.”)\n  On June 14, Gruber sent Sullivan a message that “suggested the person wearing blackface might be a producer at the  Post,” Sullivan told  New York. Sullivan forwarded the message (which didn’t name a specific  Post employee as the blackface suspect) to a couple of features-department editors, she said, “and pretty much lost track of it after that until it published.” But it didn’t take long for  Post reporters to establish that it was not one of their colleagues who had worn blackface — Fisher was on the phone with Schafer by June 15.\n      Schafer told  New York that when she asked Fisher — a reporter who, like Trent, has worked at the  Post for more than 20 years — why the story was news, he replied, “We have to do it or they will go to another outlet.” Gruber, too, said that Trent asked if she was speaking to other media outlets.\n    It isn’t unusual for a reporter working on an as-yet-unreported story to ask sources or subjects if they are talking to other outlets; reporters are competitive and tend to value being first. And the  Post denied that Fisher linked the paper’s interest in running the story to the likelihood that the news would otherwise get out elsewhere. Coratti, the  Post spokesperson, said Fisher only told Schafer that the two party guests who brought the story to the  Post might take it elsewhere in response to a question from Schafer about whether they might do so.\n  But a second person interviewed by Fisher said, “He expressed his misgivings about the story to me.” This person said that the impression Fisher left was that he had been told to do the story and that it was not his decision.\n      A third person interviewed by Fisher recounted a similar exchange. “He told me that from a personal perspective, he didn’t think this story necessarily warranted being out there, and that was his personal opinion,” this person said . “He chalked it up to other senior editors at the  Post saying it has to go, and he claimed it was out of his hands even though he wrote it.” (“Our editors don’t ‘force’ people to write stories,” Coratti said.)\n    Serendipitously, when the blackface story ran in print on June 18, it was positioned next to Sullivan’s media column, which was headlined “Bad News Judgment and the Lessons I Learned.” In a photo accompanying the piece in print and online — shot by Michael S. Williamson, who has been a  Post staff photographer since 1993 — Gruber and Prince pose in front of a statue of Joan of Arc in Malcolm X Park in Washington. But on June 22, five days after the story’s publication online, and four days after the image was circulated in print, it was removed from the  Post’s website without a replacement image or an editor’s note explaining the decision.\n          “We took it down once we learned that physical threats had been made — we have taken similar measures for the same reason in other instances,” Coratti said.\n  The photo of Schafer in blackface remained in the body of the article until June 24, when it also disappeared. The  Post did not respond to a question about why that picture was removed.\n  The  Post’s editorial guidelines state that “as a matter of editorial policy, we do not grant take-down requests.” While the guidelines allow for the removal of “publicly available personal data” in cases of threats, they don’t suggest that the  Post would unpublish a piece of  Post editorial work product — a photograph — because it ran with a story that led to threats. Coratti did not answer a question about whether the  Post had ever in a similar situation unpublished a news photograph by a staff photographer for which a subject willingly posed. Remarkably, the  Post twice violated its own editorial policy in an apparent effort to appease Gruber and Prince: reporting on the incident even though the resulting story violated the  Post’s editorial standard about relevance, then removing an editorial component of the story in violation of the  Post’s editorial standard about take-down requests.\n        Gruber told  New York she’s been “shocked by the reaction” to the story, which she said has included harassment and threats so severe that she’s acquired security. She said that she’d recently read  So You’ve Been Publicly Shamed, by Jon Ronson, a book about what happens to those who are dragged on the internet. On June 7, before the  Post story and the fallout prompted her to make her social-media accounts private, Gruber tweeted, “I understand the urge to cancel racists. But truth is — we’re ALL racist, that’s the problem. And we all deserve the grace to learn and change. Let’s use these moments to change hearts and minds, not publicly shame.”\n  Gruber expressed surprise that the reporters directed so much attention to Schafer — and to herself and Prince — instead of the more notable people at the party. “I can understand people being curious:  Why did they write a piece so focused on a private citizen?” she said. “But Tom [Toles] is a public citizen. To me, it’s about a larger problem, where people go to marches and then drink and dance with people in blackface.”\n  Toles’s cartoons have continued to run daily, and Coratti said that Toles had not been disciplined by the  Post for any of his actions discussed in the story. Any employer would have a hard time justifying professional consequences for an employee’s past private failure to correct a non-employee’s objectionable behavior. But the lack of any managerial consequences for Toles would seem to undermine the newspaper’s case that the story was newsworthy: How can Toles’s failure to promptly order Schafer out of his house be simultaneously so important that it merits feature-length coverage in the paper and not important enough to merit workplace discipline? The story also makes clear that Toles misled both Gruber and a  Post reporter — first by telling Gruber that “a lot of people show up who I don’t know, and I don’t recognize the woman you’re inquiring about,” then by telling a reporter that he wasn’t claiming not to recognize Schafer and just meant that he “didn’t recognize any bad intent.”\n          The Schafer story ran at a time of severe pressure on editorial management at the  Post over issues related to diversity and news philosophy. Conflicts between the paper’s executive editor, Marty Baron, and two reporters — Wesley Lowery, who made  high-profile arguments for newspapers to take clearer moral stances in their reporting and has since left the  Post for CBS News, and Felicia Sonmez — over issues of objectivity on social media have spilled into public view. As the story about the two-year-old Halloween party was being reported, senior managers at the  Post had recently received 32 pages of employees’ stories about racism and discrimination within the company, gathered by the employee union, according to an email reviewed by  New York. A  Post employee petition demanding changes in hiring and editorial practices drew nearly 500 signatures in 48 hours. Basically, it was the worst possible time for the  Post to have a “blackface scandal,” especially one whose frame it did not control.\n  “From the outside, it seems clear someone complained to the  Post about this stupid incident and rather than handling it as an HR matter, they decided the best thing for public relations would be to project transparency by reporting on it themselves,” said Lowery. “But what no one appears to have thought of is the way giving a massive amount of attention to a dumb incident involving private citizens would invariably do negligible good and cause massive amounts of harm—including to the  Post itself.”\n  At the same time as U.S. newspapers face staff pressure, they face pressure from news consumers who are skeptical about their commitment to fairness. A challenge is that “fairness” means different things to different people, and a move toward what Lowery  calls “moral clarity” in the news pages will appeal to some readers while alienating others. But one key element of fairness that is shared across competing visions of journalism is the news pages should be used for news, not as a PR shield to protect the newspaper’s business.\n        As is so often the case, if the  Post had simply followed its own published editorial guidance that “fairness includes relevance,” it would have made the right decision and passed on this story. Asked repeatedly to define that phrase, newsroom leadership didn’t respond to  New York.\n  By submitting your email, you agree to our  Terms and  Privacy Notice and to receive email correspondence from us.", "posttime": "2020-06-25 14:01:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解雇,post,华盛顿邮报", "title": "为什么“华盛顿邮报”要解雇这个女人？", "title_en": "Why Did the Washington Post Get This Woman Fired?", "transed": 1, "url": "https://nymag.com/intelligencer/2020/06/why-did-the-washington-post-get-this-woman-fired.html", "via": "", "real_tags": ["解雇", "post", "华盛顿邮报"]}, {"category": "", "categoryclass": "", "imagename": "35ba2122a60288df177a25b37f6f7c72.jpg", "infoid": 1008097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Charge Communications已请求联邦监管机构允许从明年开始对宽带用户实施数据上限，并向大型在线视频提供商寻求互联支付。\n与其他互联网服务提供商不同的是，由于2016年收购时代华纳有线电视(Time Warner Cable)的相关条件，Charge不允许设置数据上限，并面临互联支付费用限制。这些条件由联邦通信委员会(Federal Communications Commission)强加了七年，计划于2023年5月到期。上周，查特提交了一份请愿书，要求FCC让这些条件在2021年5月18日到期。FCC正在就请愿书征求公众意见。\nCharge以Spectrum品牌提供互联网、电视和电话服务，经常指出其缺乏数据上限是客户友好政策的一个例子。当它寻求联邦通信委员会的合并许可时，它告诉联邦通信委员会，它提供的服务没有任何数据上限、基于使用的定价或调制解调器费用，而且它没有卷入任何明显的流量管理纠纷，长期以来一直实行网络中立。\n当ARS昨天与Charge联系时，Charge表示，它目前不打算设置数据上限或改变其互联政策，但它希望有这样做的选项：\n一旦条件到期，Charge将像我们做出任何商业决定一样权衡各种选择，但目前甚至没有考虑实施数据上限或互联收费，也没有这样做的计划。查特寻求的是一个公平的竞争环境，这样我们才能继续发展，并为全国各地的客户提供优质的服务。\n查特在其FCC请愿书中辩称，这些条件不再是促进在线流媒体视频和有线电视之间竞争的必要条件，因为在线视频提供商在过去四年里蓬勃发展。\n查特在给ARS的声明中提到了该公司千兆位的速度、网络投资和农村地区的宽带部署。查特说，查特的首要任务是向我们的客户提供优质的产品，这一结果(联邦通信委员会批准查特的请愿书)将使我们在一个不断变化的市场中灵活地做到这一点。\n查特的请愿书很可能会得到联邦通信委员会主席阿吉特·派(Ajit Pai&2)3比2的共和党多数派的积极回应。当这些条件在当时的FCC主席汤姆·惠勒(Tom Wheeler)的领导下强加时，派投了反对票。惠勒是奥巴马政府的提名人。帕伊称合并条件是试图对互联网经济进行微观管理，并于2017年1月被特朗普总统从专员提升为董事长。共和党人迈克尔·里利(Michael O&#39；Rielly)也在FCC任职，他部分批准了合并令，但反对数据上限和互联条件。\n尽管施加了7年的条件，惠勒联邦通信委员会2016年的合并令称，查特可能会申请在5年后取消这些条件。这就是“宪章”要求与2021年5月挂钩的原因。\n“宪章”的请愿书写道，认识到市场正在迅速变化，而且这些条件的变化方式可能会使这些条件变得没有必要，欧盟委员会为这些条件提供了一种机制，使其在5年内而不是7年内有效。事实上，自从这些条件实施以来，市场已经发生了迅速而戏剧性的变化。\n查特表示，它并没有试图伤害在线视频提供商，而是在积极努力增加订户获得在线视频服务的机会。因此，取消这些条件将是进步，而不是阻碍已经取得的竞争优势，给予查特所需的灵活性，以最好地满足所有订户的数据使用需求，并配置其网络，以尽可能高效的方式提供数据。该公司表示，这将是一种进步，而不是阻碍已经取得的竞争优势，给予查特所需的灵活性，以最好地满足所有订户的数据使用需求，并配置其网络，以尽可能高效的方式提供数据。\n消费者权益倡导团体肯定会敦促联邦通信委员会拒绝“宪章”的请愿书。Charge建议它应该因行为平庸而休假，这充分说明了公司的意图和索赔的诚意-无论是在合并时还是今天，自由新闻政策副总裁兼总法律顾问马特·伍德(Matt Wood)告诉Ars。伍德还表示，对于一家有线电视公司来说，不合理的数据上限显然是一种竞争优势，因为它想要阻止传统电视客户割断电缆，或者至少想确保其互联网客户有胆量使用宽带连接进行流媒体内容的话额外付费。\n查特收购了巨型的时代华纳有线电视公司和规模较小的光明之家网络公司，使查特成为仅次于康卡斯特的美国第二大有线电视公司。联邦通信委员会的条款旨在防止查特阻碍与查特的有线电视服务竞争的在线视频提供商。\n为期七年的数据上限禁令允许Charge客户使用Netflix和其他在线视频服务，而不可能产生巨额超额费用。对某些互连支付的禁令阻止了Charge向直接连接Charge宽带网络的视频提供商收取巨额成本。时代华纳有线此前曾向Netflix索要互联费用。\n合并条件并不是完全禁止互联支付。取而代之的是，该条件要求Charge向向Charge客户提供一定数量数据流量的公司提供免费互联。", "note_en": "Charter Communications has asked federal regulators for permission to impose data caps on broadband users and to seek interconnection payments from large online video providers, starting next year.\n Charter, unlike other ISPs, isn&#39;t allowed to impose data caps and faces limits on charges for interconnection payments because of conditions applied to its 2016  purchase of Time Warner Cable. The conditions were imposed by the Federal Communications Commission for seven years and are scheduled to elapse in May 2023. Last week, Charter submitted a  petition asking the FCC to let the conditions run out on May 18, 2021 instead. The FCC is  seeking public comment on the petition.\n Charter, which offers Internet, TV, and phone service under the Spectrum brand name, has frequently pointed to its lack of data caps as an example of a customer-friendly policy. When it sought FCC permission for the merger, it  told the FCC that it provides service &#34;without any data caps, usage-based pricing, or modem fees&#34; and that it &#34;has been involved in no notable disputes over traffic management and has long practiced network neutrality.&#34;\n When contacted by Ars yesterday, Charter said it doesn&#39;t &#34;currently&#34; plan to impose data caps or change its interconnection policy, but it wants the option to do so:\n Once the conditions expire, Charter will weigh the options as we would any business decision, but is currently not even considering implementing data caps or charging for interconnection and has no plan to do so. What Charter seeks is a level playing field so that we can continue to grow and provide superior service to our customers across the country.\n Charter argued in its FCC petition that the conditions are no longer necessary to promote competition between online streaming video and cable TV because online video providers have flourished over the past four years.\n Charter&#39;s statement to Ars pointed to the company&#39;s gigabit speeds, network investments, and deployment of broadband in rural areas. &#34;Charter&#39;s top priority is delivering a superior product to our customers and this result [the FCC approving Charter&#39;s petition] will give us the flexibility to do just that in an ever-changing market,&#34; Charter said.\n  Charter&#39;s petition is likely to see a favorable response from FCC Chairman Ajit Pai&#39;s 3-2 Republican majority. Pai voted against the conditions when they were  imposed under then-FCC Chairman Tom Wheeler, an Obama nominee. Pai, who called the merger conditions an attempt to &#34;micromanage the Internet economy,&#34; was promoted from commissioner to chairman by President Trump in  January 2017. Republican Michael O&#39;Rielly, who is also still on the FCC, approved the merger order in part but objected to the data-cap and interconnection conditions.\n Despite imposing the conditions for seven years, the Wheeler FCC&#39;s 2016 merger order said Charter could petition for the conditions to be lifted after five years. That&#39;s why Charter&#39;s request is pegged to May 2021.\n &#34;Recognizing that the market was changing rapidly and in ways that could render the conditions unnecessary, the commission provided a mechanism for these conditions to be in place for five instead of seven years,&#34; Charter&#39;s petition said. &#34;The market has, in fact, changed quickly and dramatically since the conditions were imposed.&#34;\n Instead of trying to harm online video providers, Charter said it is &#34;actively working to increase its subscribers&#39; access to online video services.&#34; Eliminating the conditions &#34;will therefore advance, rather than thwart the competitive gains that have been made, giving Charter the flexibility it needs to best meet the data usage needs of all of its subscribers and to configure its network to deliver data in the most efficient way possible,&#34; the company said.\n Consumer-advocacy groups are certain to urge the FCC to reject Charter&#39;s petition. &#34;Charter&#39;s suggestion that it should get time off for mediocre behavior speaks volumes about the company&#39;s intent and the sincerity of its claims—both at the time of the merger and today,&#34; Free Press VP of Policy and General Counsel Matt Wood told Ars. Wood also said that &#34;unjustified data caps are clearly a competitive advantage for a cable company that wants to keep its legacy TV customers from cutting the cord, or at the very least wants to make sure its Internet customers pay extra if they have the audacity to actually use their broadband connections for streaming content.&#34;\n  Charter&#39;s purchase of the giant Time Warner Cable and the smaller Bright House Networks made Charter the second largest cable company in the US, after Comcast. The FCC conditions were aimed at preventing Charter from hindering online video providers that compete against Charter&#39;s cable TV service.\n The seven-year ban on data caps lets Charter customers use Netflix and other online video services without the possibility of huge overage fees. The ban on certain interconnection payments prevents Charter from imposing a big cost on video providers that connect directly to Charter&#39;s broadband network. Time Warner Cable had previously  demanded fees from Netflix for interconnection.\n The merger condition isn&#39;t a complete ban on interconnection payments. Instead, the condition requires Charter to provide free interconnection to companies that deliver a certain amount of data traffic to Charter customers.", "posttime": "2020-06-25 13:59:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "寻求,seeks,条件", "title": "Charge寻求FCC同意对视频服务设定数据上限并收取费用", "title_en": "Charter seeks FCC OK to impose data caps and charge fees to video services", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/charter-seeks-fcc-ok-to-impose-data-caps-and-charge-fees-to-video-services/", "via": "", "real_tags": ["寻求", "seeks", "条件"]}, {"category": "", "categoryclass": "", "imagename": "adf06c4984b944627a542420def7cfd0.jpeg", "infoid": 1008096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有好习惯、坏习惯和令人遗憾的习惯。选择你想要的生活方式。\n你不可能在一夜之间改变你的生活，但你可以开始每天养成小习惯。在不到一年的时间里，你就会看到不同之处。\n与“21天”的神话相反，习惯的养成实际上需要2个多月的时间。看起来很长吗？不用谢。\n随着时间的推移，你新的微小行为改变的结果将滚雪球般变成巨大的影响。把它想象成生活的复利。\n在我们的一生中，我们下意识地养成了许多习惯，有些习惯是好的，有些习惯是…的。没那么多。有时，我们甚至没有注意到这些坏习惯的影响，直到它造成了巨大的痛苦。\n我养成了把事情控制在心里的习惯，这很快就导致了工作团队内部的许多沟通不畅、不信任和愤怒。我花了一段时间才把它改了。但在我养成新习惯之前，我必须首先找出哪里出了问题。\n如果你想改善你的生活，你需要摆脱那些糟糕的东西。这听起来比实际情况容易。改变很难，改掉坏习惯更难。\n首先，你需要知道这个习惯是什么，为什么你要改掉它。\n事件：整夜不洗碗碟。你为什么要扔掉它：没洗的盘子会招致啮齿动物和害虫。改掉这个习惯会为你和你刚出生的孩子创造一个更干净、更健康的生活空间。\n我们人类不喜欢复杂化。人们倾向于做对他们来说容易的事情。当他们看到一些复杂的事情时，他们会经常找借口解释为什么他们不能处理这个问题。这是许多人未能实现目标的主要原因。\n如果你想改善你的生活，你需要告诉自己，“这是阻碍我成就的东西，我有意愿去改变它。”\n成功的关键是不要再找借口了。通过养成积极的习惯来致力于你的成功。\n言辞得体可以改变你看待自己和他人的方式。它还会改变你周围的整个“氛围”。你将能够吸引更好的结果。\n你可以说，“我要接受别人和我自己，因为我们是谁”，而不是上面的说法。如果你一辈子都在说负面的含义，今天就试着改变你的方式。与其把生活看作一个满是废话的世界，不如接受它是你看待它的方式，但要继续前进，让它变得更好。", "note_en": "There are good habits, bad habits and regrettable habits. Choose how you want to live your life.\n  You can’t change your life overnight but you can start implementing microhabits every day. In less than a year, you will see the differences.\n Contrary to the “21 days” myth, it actually takes  more than 2 months for habits to form. Seems long? Not at all.\n The results from your new tiny behaviour shift will snowball into a huge impact as time goes by. Think of it as the compound interest of life.\n We subconsciously acquire a lot of habits throughout our life, which some are good while others… not so much. Sometimes, we don’t even notice the effects of those bad habits until it causes a huge pain.\n I had a habit of keeping things in and it soon led to a lot of miscommunication, distrust and anger within a work team. It took a while for me to change it. But before I could create new habits, I had to identify what was wrong in the first place.\n    If you want to better your life, you need to get rid of the terrible ones. It sounds easier than it actually is. Change is hard, eliminating bad habits harder.\n First, you need to know what is the habit and why you are getting rid of it.\n  What: Leaving dishes unwashed overnight.  Why are you getting rid of it: Unwashed dishes can attract rodents and pests. Getting rid of this habit will create a cleaner, healthier living space for you and your newborn child.\n  Us humans don’t like complication. People tend to do what’s easy for them. When they see something complicated, they’ll frequently make excuses why they can’ deal with the issue. This is the main reason why many people fail to accomplish their goals.\n If you want to improve your life, you need to tell yourself, “This is something that blocks me from accomplishment and I’ve the will to change it.”\n The key to success is to quit making excuses. Commit to your success by building positive habits.\n  Having the right words can change the way you see yourself and others. It also changes the whole “vibe” around you. You will be able to attract better results.\n    Instead of the above statement, you may say, “I’m going to accept people and myself for who we are”. If you spend your life stating negative connotations, attempt changing your ways today. Rather than seeing life as a world full of bunk, accept it as how you see it yet move forward to make it better.", "posttime": "2020-06-25 13:58:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "改变,live", "title": "想要过更好的生活吗？改变你的习惯", "title_en": "Want to Live a Better Life? Change Your Habits", "transed": 1, "url": "https://medium.com/change-becomes-you/want-to-live-a-better-life-change-your-habits-9ef88cdbd0f0", "via": "", "real_tags": ["改变", "live"]}, {"category": "", "categoryclass": "", "imagename": "75ddc8444c8449858995f56e4338b6a3.jpg", "infoid": 1008095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二，三名共和党参议员提出立法，要求美国的服务提供商和设备制造商在获得法院颁发的逮捕令时，帮助联邦政府绕过加密。\n这项法律法案[PDF]被称为“合法访问加密数据法案”(Legal Access To Encrypted Data Act)，这一法案不能一反常态地缩写为迎合他人的首字母缩写。这项旨在使加密数学不安全的最新立法尝试，不应与另一项提交美国国会审议的法案，即“赚取-IT法案”混为一谈，该法案威胁服务提供商要承担支持私人通信(也就是加密的通信)的责任。\n莱达由美国参议员林赛·格雷厄姆(R-SC)、汤姆·科顿(R-AR)和玛莎·布莱克本(R-TN)赞助。格雷厄姆是“赚取IT法案”的发起人之一。布莱克本是特朗普政府规则改革的先驱，允许互联网服务提供商营销人们的在线数据。\n科顿最近还因为一篇未经审查的纽约时报专栏文章而受到关注，这篇专栏文章呼吁对警察杀害乔治·弗洛伊德(George Floyd)的公众抗议活动做出军事回应。\n该法案要求任何持有授权证的公司--设备制造商、操作系统提供商、远程计算服务提供商或其他人--帮助当局访问存储在电子设备上的信息或访问远程存储的电子信息。\n低巴尔：别跟我说什么安全的废话，只要把后门放在加密里就行了，美国司法部长咆哮着说。\n多读。\n它没有具体说明加密应该如何处理，只是在给当局带来不便时应该是可以撤销的。\n设备制造商、操作系统提供商和远程计算服务提供商这两个术语仅适用于年销售量超过100万或客户/订户超过100万的公司。法律中包括的任何电子设备都必须有1 GB或更多的存储空间。另一个人这个词在正文中不合格。\n该法案使那些为加密破解责任起草的人有权免除责任，并获得因遵守命令而直接产生的合理费用的补偿，但不超过300美元。\n通过网络处理移动数据的服务提供商还应帮助当局访问加密数据，并承担维护其强制加密解锁系统的成本。\n此外，该法案还呼吁设立一项竞赛，由不超过5000万美元的税款资助，由美国司法部长酌情颁发一个或多个奖项，奖励任何开发能够破解加密并向当局提供数据访问的系统的人。然而，比赛获胜者只能获得不超过100万美元的奖金。\n科顿在一份声明中表示，科技公司对加密的日益依赖，已经将他们的平台变成了一个新的、无法无天的犯罪活动场所。\n从儿童掠夺者到恐怖分子的犯罪分子都在充分利用这一点。这项法案将确保执法部门可以根据可能的原因使用搜查令获取加密材料，并有助于结束互联网上的野蛮西部犯罪。\n应该说，加密通过保持网上银行账户和网络浏览等内容的合理安全，还可以防止相当数量的犯罪。强制设立后门，从数学上讲，任何人都能找到，这可能不是最明智的举措。\n为了证明这样的立法是必要的，参议员们引用了一个案例，在没有法律强制的行业帮助的情况下，加密被绕过了。他们指出，2019年12月佛罗里达州彭萨科拉彭萨科拉海军航空站发生恐怖袭击，涉及沙特皇家空军的一名成员。\n他们表示，美国联邦调查局(FBI)在花费了4个月的时间和一些被描述为巨额税款的资金后，在没有苹果任何帮助的情况下，从攻击者的手机中找回了信息。苹果否认了这一指控。\n不出所料，隐私权和公民自由倡导者对拟议中的立法感到震惊，并厌倦了不得不从20世纪90年代开始一次又一次地与快艇芯片(Clipper Chip)的斗争。\n斯坦福互联网与社会中心(Stanford Center For Internet And Society)负责监控和网络安全的副主任丽安娜·费弗科恩(Riana Pfefferkorn)在给“登记册”的一封电子邮件中表示，这是对加密以及美国人隐私和安全的全面攻击，而此时我们大部分时间都在离家上网，这意味着我们负担不起。\n该法案毫不含糊地包含了长期令人畏惧的设备和在线服务的后门授权，从云存储到电子邮件，再到应用程序，比如端到端的加密消息应用程序。\nEFF高级职员律师安德鲁·克罗克(Andrew Crocker)在给“登记册”的一封电子邮件中表示，这项法案简直是对现实视而不见。\n它对这样一个事实视而不见，那就是，当我们数以百万计的人在街上游行，避难所就位时，我们从未像现在这样依赖安全的通讯和设备。它对专家的共识视而不见，即没有后门就无法提供对安全加密数据的访问，这是为神奇的解决方案立法获奖不能改变的。而且它对公众舆论视而不见。\n克罗克说，几十年来，美国人压倒性地拒绝了政府要求在技术上存在安全缺陷的企图，从Clipper芯片到苹果圣贝纳迪诺案，再到参议员格雷厄姆的另一个误入歧途的法案，即“赚取IT法案”，该法案将允许政府特别工作组取缔端到端加密。我们不应该再花一秒钟来辩论这些小说。\n当被问及Laeda如果获得批准是否会根据第一修正案受到法律挑战时，Pfefferkorn表示，该法案将把互联网和计算设备纳入CALEA[执法通信援助法案]规则之下，电信公司目前受到这些规则的约束。\n她说：虽然我不知道第一修正案在20世纪90年代通过时可能给CALEA带来了什么挑战，但我相信这一预先设计可解密的任务与圣贝纳迪诺的摊牌略有不同，当时苹果确实提出了第一修正案的论点。\n话虽如此，如果苹果仍将被迫创建它不想创建的代码，并对它并不真正站得住脚的代码进行密码签名(即担保)，那么是的，苹果在圣贝纳迪诺一案中提出的论点可能也会在这里被提出，她说。®。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "A trio of Republican senators on Tuesday proposed legislation that requires service providers and device makers in America to help the Feds bypass encryption when presented with a court-issued warrant.\n  The  law bill [PDF] is dubbed the Lawful Access to Encrypted Data Act, which uncharacteristically cannot be condensed into a pandering acronym. This latest legislative attempt to make encryption – math – insecure on-demand should not be confused with another bill up for consideration in the United States&#39; Congress, the  EARN-IT Act, which threatens service providers with liability for supporting private, aka encrypted, communications.\n    LAEDA is sponsored by US Senators Lindsey Graham (R-SC), Tom Cotton (R-AR), and Marsha Blackburn (R-TN). Graham is one of the sponsors of the EARN-IT Act. And Blackburn  pioneered the Trump administration&#39;s rule changes that allowed ISPs to market people&#39;s online data.\n  Cotton also received attention recently for an unvetted  New York Times op-ed that called for a military response to public protests over the police killing of George Floyd.\n    The bill requires any corporate presented with a warrant – &#34;device manufacturer, an operating system provider, a provider of remote computing service, or another person&#34; – to help authorities &#34;access information stored on an electronic device or to access remotely stored electronic information.&#34;\n  Low Barr: Don&#39;t give me that crap about security, just put the backdoors in the encryption, roars US Attorney General\n  READ MORE\n  It doesn&#39;t specify how encryption should be dealt with, just that it should be undoable when inconvenient to authorities.\n  The terms &#34;device manufacturer,&#34; &#34;operating system provider,&#34; and &#34;provider of remote computing service,&#34; apply only to firms with unit sales over one million annually or one million customers/subscribers. Any electronic devices included in the law must have 1GB of storage or more. The term &#34;another person&#34; is not qualified in the text.\n  The bill entitles those drafted for encryption-cracking duty to liability exemption and to compensation &#34;for reasonable expenses directly incurred in complying with the order,&#34; but not more than $300.\n  Service providers that handle data in motion – over a network – are also expected to help authorities access encrypted data and to bear the cost of maintaining their mandated encryption-dissolving systems.\n  What&#39;s more, the bill calls for the creation of a competition, funded with no more than $50m in tax dollars, to pay out one or more prizes, awarded at the discretion of the US Attorney General, for anyone developing a system capable of undoing encryption and providing authorities with access to data. The competition winner can be awarded no more than $1m however.\n  &#34;Tech companies’ increasing reliance on encryption has turned their platforms into a new, lawless playground of criminal activity,&#34; said Cotton in  a statement.\n  &#34;Criminals from child predators to terrorists are taking full advantage. This bill will ensure law enforcement can access encrypted material with a warrant based on probable cause and help put an end to the Wild West of crime on the Internet.&#34;\n    Encryption, it should be said, also prevents a fair amount of crime by keeping things like online bank accounts and web browsing reasonably secure. Mandating a backdoor, which mathematically  anyone could find, might not be the wisest move.\n  In an effort to show that such legislation is needed, the Senators cite a case where encryption was bypassed without legally-compelled industry help. They point to the December 2019 terrorist attack at the Pensacola Naval Air Station in Pensacola, Florida, involving a member of the Royal Saudi Air Force.\n  The FBI, they said, recovered information from the attacker&#39;s phone without any help from Apple after spending four months and some amount of money described as &#34;large sums of tax dollars.&#34; Apple  denies the claim.\n  Privacy and civil liberties advocates predictably are aghast at the proposed legislation and are weary of having to fight the  Clipper Chip battle from the 1990s over and over again.\n  &#34;This is a full-frontal assault on encryption and on Americans&#39; privacy and security, just when the shift to living much of our lives online from home means we can least afford it,&#34; said Riana Pfefferkorn, associate director of surveillance and cybersecurity at the Stanford Center for Internet and Society, in an email to  The Register.\n  &#34;The bill unambiguously contains the long-dreaded backdoor mandate for devices and online services alike, from cloud storage to email to apps, such as end-to-end encrypted messaging apps.&#34;\n  &#34;This bill is simply blind to reality,&#34; said EFF senior staff attorney Andrew Crocker in an email to  The Register.\n  &#34;It is blind to the fact that as millions of us march in the streets and shelter in place, we&#39;ve never been more dependent on secure communications and devices. It is blind to the expert consensus that there is no way to provide access to securely encrypted data without a backdoor, something that legislating a prize for a magical solution cannot change. And it is blind to public opinion.&#34;\n  &#34;For decades, Americans have overwhelmingly rejected government attempts to require security flaws in technology, from the Clipper Chip, to the Apple San Bernardino case, up to Senator Graham&#39;s other misguided bill, the EARN IT Act, which would allow a government task force to outlaw end-to-end encryption,&#34; Crocker said. &#34;We shouldn&#39;t spend one second more debating these fictions.&#34;\n  Asked about whether LAEDA, if approved, might be subject to a legal challenge under the First Amendment, Pfefferkorn said the bill would bring internet and computing devices under the CALEA [Communications Assistance for Law Enforcement Act] rules to which telcos are currently subject.\n  &#34;While I am not aware of what First Amendment challenges may have been brought to CALEA when it was passed in the 1990s, I believe this up-front, design-for-decryptability mandate is a little different than the situation in the San Bernardino showdown, where Apple did bring First Amendment arguments,&#34; she said.\n  &#34;With that said, to the degree that Apple would still be forced to create code it does not want to create, and cryptographically sign – i.e., vouch for – code it does not truly stand by, then yes, the arguments Apple raised in the San Bernardino case could putatively be raised here as well,&#34; she said. ®\n        The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-06-25 13:58:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察,blow,加密", "title": "法律将用警察后门摧毁加密房子", "title_en": "Law to blow the encryption house down with police backdoors", "transed": 1, "url": "https://www.theregister.com/2020/06/24/us_encryption_backdoor/", "via": "", "real_tags": ["警察", "blow", "加密"]}, {"category": "", "categoryclass": "", "imagename": "8d560b64fa7cf4ca6ea1ef046902f267.jpg", "infoid": 1008092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "波士顿市议会周三一致投票禁止包括警察在内的市政府使用面部识别技术，使波士顿成为东海岸最大的这样做的城市。\n这项法律规定，市政府官员获取、保留、拥有、访问或使用面部识别技术是非法的。现在，市政府签订允许使用面部识别技术的合同也是非法的。\n马萨诸塞州的其他五个城市-包括斯普林菲尔德、剑桥、北安普顿、布鲁克林和萨默维尔-在过去一年里已经禁止政府使用面部识别。旧金山和奥克兰也通过了类似的禁令。\n该法令指出，面部识别技术“对非裔美国人和(亚裔美国人和太平洋岛民)面孔的准确性较低”，而且“面部监控中的种族偏见有可能伤害已经面临更高水平的监控和骚扰的有色人种社区。”\n议员利兹·布雷登(Liz Breadon)在周三的会议上表示：“我认为现在有充分的理由禁止这项技术-因为它不可靠-未来，我们还必须考虑是否仅仅因为某事是可能的，这是正确的做法。”“监视我们的总体人口和进行面部识别不一定是我们在自由社会中想要的方式。”\n这项法律仍然允许波士顿警方和官员跟进来自其他执法机构的任何可能是通过面部识别产生的线索。例如，如果FBI与波士顿警察局共享一份在面部识别的帮助下生成的嫌疑人名单，该部门可以使用这些信息。\n这项法令是在美国公民自由联盟(American Civil Liberties Union)的帮助下出台的，该联盟一直在通过“新闻暂停面部监控”(Press Pause Face SurveMonitoring)运动来倡导反对面部识别，该运动的重点是在全市范围内通过对面部识别技术的限制。\n马萨诸塞州ACLU执行主任卡罗尔·罗斯(Carol Rose)在一份声明中表示：“为了有效解决警察滥用职权和系统性种族主义的问题，我们必须解决加剧这些长期危机的工具。”“面对监控，黑人和棕色社区的治安会变得超级强势，每个人的匿名权和隐私权都会遭到践踏。”\n美国公民自由联盟2018年的一份报告发现，亚马逊出售给警方的面部识别工具Rekognition错误地将28名国会议员与面部照片中的人进行了匹配。本月早些时候，该公司表示，将暂停向执法部门出售面部识别一年，但拒绝透露有多少警察部门已经或目前使用Rekognition。\nBriefCam是一家帮助警方分析监控录像并识别人脸的公司，该公司在营销材料中声称，它帮助警方调查了波士顿马拉松爆炸案。目前还不清楚该公司在逮捕嫌疑人方面发挥了什么作用(如果有的话)。\n根据BuzzFeed News查看的文件，波士顿大都市区的企业和警察部门也使用了Clearview AI，这是一家提供面部识别软件的公司，该软件由从Facebook、Twitter和Instagram等社交媒体网站拍摄的30多亿张照片提供支持。BuzzFeed新闻在2月份的一项调查显示，超过2200家实体使用Clearview进行了搜查，范围从司法部和移民和海关执法局的联邦官员到当地警察局和私营公司，包括梅西百货和科尔百货。\n其中一些实体的总部设在波士顿地区。例如，根据BuzzFeed News查看的文件，截至2月份，房地产公司波士顿地产(Boston Properties)已经运行了数十次Clearview搜索。这些文件显示，邻近的剑桥警察局进行了100多次搜查，里维尔警察局进行了70多次搜查，萨默维尔警察局至少进行了一次Clearview扫描。", "note_en": "The Boston City Council voted unanimously on Wednesday to ban the city government, including the police, from using facial recognition technology, making Boston the largest city on the East Coast to do so.\n The law makes it illegal for city officials to &#34;obtain, retain, possess, access, or use&#34; facial recognition technology. It&#39;s also now illegal for the city government to enter into contracts that permit the use of facial recognition technology.\n Five other cities in Massachusetts — including  Springfield,  Cambridge,  Northampton,  Brookline, and  Somerville — have banned the governmental use of facial recognition in the past year.  San Francisco and  Oakland have passed similar bans.\n The  ordinance noted that facial recognition technology is “less accurate for African American and [Asian American and Pacific Islander] faces” and that “racial bias in facial surveillance has the potential to harm communities of color who are already facing increased levels of surveillance and harassment.&#34;\n “I think that there’s a good reason to ban this technology right now — because it’s unreliable — and moving forward, we have to also consider whether just because something is possible, that it’s the right thing to do,” Councillor Liz Breadon said in Wednesday’s meeting. “Surveilling our population at large and doing facial identification is not necessarily the way we want to go in a free society.”\n The law still allows Boston police and officials to follow up on any tips from other law enforcement agencies that may have been generated through facial recognition. For instance, if the FBI shared a list of suspects with the Boston Police Department that was generated with the help of facial recognition, the department could use that information.\n The ordinance was introduced with the help of the American Civil Liberties Union, which has been advocating against facial recognition with its “ Press Pause Face Surveillance” campaign, which concentrates on passing citywide restrictions on facial recognition technology.\n “To effectively address police abuses and systemic racism, we must address the tools that exacerbate those long-standing crises,” Carol Rose, executive director of the ACLU of Massachusetts, said in a statement. “Face surveillance supercharges the policing of Black and brown communities, and tramples on everyone’s rights to anonymity and privacy.”\n A 2018 ACLU report found that Rekognition, a facial recognition tool that Amazon sells to police,  falsely matched 28 members of Congress with people in mugshots. Earlier this month, the company said it would  pause selling facial recognition to law enforcement for one year but  refused to say how many police departments have used or currently use Rekognition.\n BriefCam — a company that helps police  analyze surveillance footage and recognize faces —  claimed in marketing materials that it helped police investigate the Boston Marathon bombing. It’s unclear what, if any, role the company played in arresting the suspects.\n According to documents viewed by BuzzFeed News, businesses and police departments in the Boston metropolitan area have also used Clearview AI, a company that offers facial recognition software powered by more than 3 billion photos taken from social media sites including Facebook, Twitter, and Instagram.  A BuzzFeed News investigation in February revealed that more than 2,200 entities have run searches with Clearview, ranging from federal officials at the Justice Department and Immigration and Customs Enforcement to local police departments and private companies, including Macy’s and Kohl’s.\n Some of those entities are based in the Boston area. For instance, Boston Properties, a real estate company, had run dozens of Clearview searches as of February, based on documents reviewed by BuzzFeed News. The neighboring Cambridge Police Department ran over 100 searches, the Revere Police Department ran more than 70 searches, and the Somerville Police Department ran at least one Clearview scan, according to those documents.", "posttime": "2020-06-25 13:17:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "政府,banned,波士顿", "title": "波士顿刚刚禁止其政府使用面部识别技术", "title_en": "Boston Just Banned Its Government From Using Facial Recognition Technology", "transed": 1, "url": "https://www.buzzfeednews.com/article/carolinehaskins1/boston-vote-ban-facial-recognition", "via": "", "real_tags": ["政府", "banned", "波士顿"]}, {"category": "", "categoryclass": "", "imagename": "d9b7158395b8d4eff5ae4e52f47cbf1f.jpg", "infoid": 1008091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌周三宣布，将在18个月后开始自动删除用户的位置历史和网络活动。\n以前，如果用户不想让谷歌无限期地存储他们的数据，就必须打开这一设置。\n此举允许谷歌仍然保留信息，并根据你以前的位置或浏览历史向你推荐你可能喜欢的东西，但它不会拥有年复一年的私人数据。\n默认情况下，谷歌位置历史跟踪功能仍处于关闭状态，但如果你想让谷歌地图等产品根据你过去去过的地方向你提供个性化的推荐，比如你可能喜欢的餐厅，打开它会很有用。或者，谷歌可能会从你的位置历史记录中了解到，你通常在早上8点离开去工作，并可以建议你提前一点离开，以避免在特定的一天发生交通堵塞。\n然而，当位置跟踪开启时，谷歌会以精确的细节跟踪你的位置-如果你查看你的谷歌地图时间轴，你就会看到这一点。\n现在，如果你打开位置历史记录，谷歌将在18个月后自动删除该数据。你还可以将谷歌位置历史设置为每三个月或每36个月自动删除一次。\n网络和应用程序活动也将每18个月自动删除一次，但仅适用于新账户。新的YouTube账户也将在三年后删除他们的历史记录。\n对于现有用户，网络和应用程序活动跟踪以及YouTube历史记录在默认情况下是无限期的。但是，你可以通过谷歌活动控制页面打开去年推出的网络和应用程序活动自动删除功能。\n谷歌和Alphabet首席执行官桑达尔·皮查伊在一份新闻稿中表示：我们继续挑战自己，用更少的资源做更多的事情，今天我们正在改变我们的数据保留做法，使自动删除成为我们核心活动设置的默认设置。\n谷歌正在使在精选的应用程序上更容易进入隐姓埋名模式。该模式允许您私下浏览或使用应用程序，而且Google不会保存您的浏览历史记录、cookie或网站数据。在谷歌地图中，当你打开隐姓埋名模式时，谷歌不会保存你去过的地方的历史记录。\niPhone将于周三推出一项功能，随后将为Android和其他应用程序推出一项功能，用户可以在谷歌搜索、地图和YouTube中长时间按下个人资料图片，打开隐姓埋名模式。谷歌表示，很快它就可以在其所有系列应用程序中保持隐身模式，这样你就不必在每个单独的应用程序中都打开它了。\n谷歌表示，它还将提供更积极主动的隐私控制，并帮助指导用户管理他们的隐私设置。此外，用户将能够通过搜索访问关键的谷歌账户控制。", "note_en": "Google announced Wednesday it will start to automatically delete users&#39; location history and web activity after 18 months.\n Previously, users had to turn this setting on if they didn&#39;t want Google to store their data for an indefinite amount of time.\n  The move allows Google to still hold on to information and recommend things you might like based on your previous location or browsing history, but it won&#39;t have years and years worth of private data.\n   Google location history tracking is still off by default, but turning it on can be useful if you want products like Google Maps to offer personalized recommendations, like restaurants you might like, based on where you&#39;ve been in the past. Or, Google might know from your location history that you typically leave for work at 8 a.m., and can recommend that you leave a bit earlier to avoid traffic on a particular day.\n When location tracking is on, however, Google follows your location with precise detail — something you can see if you  view your Google Maps Timeline.\n Now, if you turn location history on, Google will auto-delete that data after 18 months. You can also set Google location history to automatically delete every three months or every 36 months.\n   Web and app activity will also be deleted automatically every 18 months, but only for new accounts. New YouTube accounts also will have their history deleted after three years.\n Web and app activity tracking, and YouTube history, is logged by default for an indefinite period of time for existing users.  But, you can turn turn on web and app activity auto-delete, which rolled out last year, through the  Google Activity Controls page.\n &#34;We continue to challenge ourselves to do more with less, and today we&#39;re changing our data retention practices to make auto-delete the default for our core activity settings,&#34; Google and Alphabet CEO Sundar Pichai said in a release.\n   Google is making it easier to access incognito mode on select apps. The mode lets you browse or use apps privately, and  Google won&#39;t save your browsing history, cookies, or site data. In Google Maps,  Google won&#39;t keep a history of where you&#39;ve been when you have incognito mode on.\n A feature rolling out to iPhone on Wednesday, and later for Android and other apps, will let users long press on their profile picture in Google Search, Maps and YouTube to turn on incognito mode. Google said it will soon make it possible to stay in incognito mode across its family of apps, so you won&#39;t have to turn it on in each individual app.\n Google said it will also offer more  proactive privacy controls and help guide users through managing their privacy settings. Additionally, users will be able to access key Google Account controls through search.", "posttime": "2020-06-25 13:17:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,默认,announced", "title": "谷歌刚刚宣布，默认情况下，它将自动删除你的位置历史记录", "title_en": "Google just announced it will automatically delete your location history by default", "transed": 1, "url": "https://www.cnbc.com/2020/06/24/google-will-automatically-delete-location-history-by-default.html", "via": "", "real_tags": ["谷歌", "google", "默认", "announced"]}]