[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1068471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "图片：在开发周期结束时，您的游戏爬行，但您没有看到探查器中的任何明显的热点。罪魁祸首？随机内存访问模式和常量缓存未命中。为了尝试提高性能，您尝试并行化代码的部分，但它需要英勇的工作，并且到底，由于您必须添加的所有同步，您几乎没有速度速度。要将其关闭，代码非常复杂，修复错误会产生更多问题，并立即丢弃添加新功能的想法。听起来有点熟？\n 这种情况非常准确地描述了我过去10年所涉及的每场比赛。原因不是我们正在使用的编程语言，也不是开发工具，也没有缺乏纪律。在我的经验中，它是面向对象的编程（OOP）和围绕它的文化，这在很大程度上归咎于这些问题。 OOP可能会阻碍你的项目而不是帮助它！\n  OOP在目前的游戏开发文化中被加入，在考虑比赛时很难在物体上思考。毕竟，我们一直在创建多年来代表车辆，玩家和国家机器的课程。什么是替代品？程序编程？功能语言？异国情调的编程语言？\n 以数据为导向的设计是一种方法，可以解决解决所有这些问题的程序设计。程序编程侧重于过程调用作为其主要元素，OOP主要与对象交易。请注意，这两种方法的主要焦点是代码：在一个案例中的普通程序（或函数），并在另一个内部状态相关联的分组代码。面向数据的设计将编程从对象的编程视角转移到数据本身：数据的类型，如何在内存中布置，以及如何在游戏中读取和处理。\n 根据定义编程是关于转换数据：它是创建一系列机器指令的行为，描述了如何处理输入数据并创建一些特定的输出数据。游戏只不过是一个以交互式率有效的程序，因此我们主要在那个数据上集中注意力而不是操纵它的代码是有意义的？\n 我想清理潜在的混乱和压力，以至于数据导向的设计并不意味着某些东西是数据驱动的。数据驱动的游戏通常是一个游戏，该游戏在代码之外暴露大量功能，并允许数据确定游戏的行为。这是对数据面向设计的正交概念，并且可以与任何类型的编程方法一起使用。\n  如果我们从数据的角度查看程序，理想的数据是什么样的？这取决于数据以及它是如何使用的。通常，理想数据是我们可以与最少量的努力一起使用的格式。在最佳情况下，格式将与输出相同，因此处理仅限于刚刚复制该数据。非常经常，我们理想的数据布局将是我们可以顺序地处理的大块连续性的均匀数据块。在任何情况下，目标是最大限度地减少转换量，并尽可能最大限度地释放您的数据，在资产建设过程中脱离此理想格式。 \n由于以数据为导向的设计首先将数据置于数据，我们可以围绕理想的数据格式构建整个程序。我们将永远无法使其完全理想（同样的方式，代码几乎没有逐字oop），但这是牢记的主要目标。一旦我们实现了这一点，列在列开始时提到的大多数问题都倾向于融化（更多关于下一部分的信息）。\n 当我们考虑对象时，我们立即想到树木继承树，遏制树或消息传递树，我们的数据自然地排列。因此，当我们对对象执行操作时，它通常会导致该对象依次进一步访问树中的其他对象。在执行相同操作的一组对象上迭代，在每个对象处生成级联，完全不同的操作（参见图1A）。\n 为了实现最佳的数据布局，将每个对象分解为不同的组件，以及在内存中的同一类型的组组件，无论它们来自哪些对象，都会有助于它们。该组织导致大块的同类数据块，允许我们顺序处理数据（见图1B）。一种关键原因，为什么数据导向设计如此强大，是因为它在大群对象上工作得很好。 OOP，根据定义，在一个对象上工作。退后一分钟，想想你工作的最后一场比赛：你的代码中有多少个地方你只有一个东西？一个敌人？一辆车？一个路径文件节点？一个子弹？一个颗粒？绝不！哪里有一个，有很多。 OOP忽略了它并以隔离的每个对象处理。相反，我们可以轻松地为我们和硬件制作东西，并组织我们的数据来处理具有许多相同类型的常见情况。\n 这听起来像是一种奇怪的方法吗？你猜怎么着？您可能已经在代码的某些部分中执行此操作：粒子系统！以数据为导向的设计将我们的整个CodeBase转化为巨大的粒子系统。也许是游戏程序员更熟悉的这种方法的名称将是粒子驱动的编程。\n  关于数据的第一和架构程序基于这促成了大量优势。\n  这些天，我们需要处理多个核心的事实。任何尝试使用一些OOP代码和并行化的人都可以证明易于困难，容易出错，并且可能不是很高效。通常，您最终添加了许多同步原语来防止从多个线程中并发访问数据，通常很多线程最终idling，相当于等待其他线程完成。结果，性能改善可能是非常强大的。\n 当我们应用数据设计时，并行化变得更简单：我们有输入数据，一个小功能来处理它，以及一些输出数据。我们可以轻松地采取类似的东西，并在多个线程中拆分，它们之间的同步最小。我们甚至可以进一步获取并在具有本地存储器的处理器上运行该代码（如单元处理器上的spus），而无需以不同的方式执行任何操作。 \n除了使用多个核心外，还有一个以实现现代硬件在现代硬件中实现良好性能的键，其深度指令管道和具有多个级别高速缓存的慢速存储器系统，具有缓存友好的内存访问。面向数据的设计导致非常有效地使用指令高速缓存，因为同一代码一遍又一遍地执行。此外，如果我们在大型连续块中铺设数据，我们可以顺序处理数据，近乎完美的数据缓存使用和卓越的性能。可能的优化。当我们考虑对象或函数时，我们倾向于在功能甚至算法水平时陷入优化;重新排序某些函数调用，更改排序方法，甚至用程序集重新编写一些C代码。\n 这种优化肯定是有益的，但通过首先思考数据，我们可以更进一步回来并制作更大，更重要的优化。请记住，所有游戏都可以将一些数据（资产，输入，状态）转换为其他数据（图形命令，新游戏状态）。通过牢记数据流动，我们可以基于如何转换数据的方式进行更高级别，更智能的决策，以及如何使用它。通过更传统的OOP方法实现，这种优化可能是非常困难和耗时的。\n  到目前为止，所面向数据设计的所有优点都是基于性能：高速缓存利用率，优化和并行化。毫无疑问，作为游戏程序员，表现是我们的一个极为重要的目标。技术之间通常有冲突，从而提高了有助于可读性和易于发展的性能和技术。例如，在汇编语言中重写一些代码可能会导致性能提升，但通常会使代码更加难以读取和维护。\n 幸运的是，面向数据的设计有利于性能和易于发展。当您专门编写代码以转换数据时，您最终可以使用小功能，在代码的其他部分上具有很少的依赖性。 CodeBase最终非常“平坦”，具有许多叶片功能，没有许多依赖项。这种模块化级别和缺乏依赖性使得更容易理解，更换和更新代码。\n  数据导向设计的最后一个主要优点是易于测试。正如我们在6月和8月内在产品栏中所看到的，写入单元测试以检查对象交互并不琐碎。您需要立即设置模拟和测试事物。坦率地说，这有点痛苦。另一方面，在直接与数据交换时，写入单元测试不能更容易：创建一些输入数据，调用变换函数，并检查输出数据是我们期望的。没有别的东西。这实际上是一个巨大的优势，并使代码非常易于测试，无论您是否正在进行测试驱动的开发或代码后的写入单元测试。\n  面向数据的设计不是游戏开发中所有问题的银弹。它确实有助于大量编写高性能代码，并使节目更加可读，更易于维护，但它确实有了几个缺点。\n 有针对性设计的主要问题是它与大多数程序员在学校习惯或学习的不同之处。它需要将我们的精神模型转化为90度，并改变了我们如何考虑它。在它成为第二个性质之前，它需要一些练习。 \n此外，因为它是一种不同的方法，它可能具有挑战性地与现有代码接口，以更多OOP或程序方式编写。在隔离中写一个函数很难，但只要您可以将数据面向设计的设计应用于整个子系统，您应该能够获得很多好处。\n  足够的理论和概述。您如何实际上启用数据设计设计？首先，只需选择代码中的特定区域：导航，动画，碰撞或其他东西。后来，当大多数游戏引擎都以数据为中心时，您可以从帧的开始直到结束时一直担心数据流。\n 下一步是清楚地识别系统所需的数据输入，以及它需要生成的数据类型。现在可以在OOP条款中思考它，只是为了帮助我们识别数据。例如，在动画系统中，一些输入数据是骨架，基本姿势，动画数据和当前状态。结果不是“代码播放动画”，但是当前播放的动画生成的数据。在这种情况下，我们的输出将是一组新的姿势和更新状态。\n 重要的是要进一步迈出一步并基于它的使用方式对输入数据进行分类。它是只读，读写还是只写？该分类将帮助指导关于存储它的位置的设计决策，以及何时根据程序的其他部分的依赖项来处理它。\n 此时，请停止思考单个操作所需的数据，并根据将其应用到几十或数百个条目方面进行思考。我们不再有一个骨架，一个基本姿势和当前状态，而是我们在每个块中具有许多实例的每个类型的块。\n 非常仔细地仔细考虑如何在转换过程中使用数据从输入到输出。您可能会意识到您需要在结构中扫描特定字段以执行数据的传递，然后您需要使用结果进行另一个传递。在这种情况下，将初始字段拆分为可以独立处理的单独存储器块可能更有意义，允许更好的高速缓存利用率和潜在的并行化。或者也许您需要向量化代码的某些部分，这需要从不同位置获取数据以将其放入相同的向量寄存器中。在这种情况下，可以连续地存储数据，使得可以直接应用矢量操作，而没有任何额外的变换。\n 现在，您应该对您的数据非常了解。编写代码转换它会更简单。这就像通过填写空白来编写代码。与相同的OOP代码所在的相比，您甚至会感到惊喜地意识到代码比在第一位置更简单和更小。 \n如果您思考过去一年的大部分主题，您会发现他们都领导了这种类型的设计。现在是时候要注意数据如何对齐（2008年12月和2009年12月），以便将数据直接烘烤到您可以有效使用的输入格式（OCT和2008年11月），或者使用数据之间的非指针引用块，因此它们可以很容易地重新安置（9月2009年9月）。\n  这是否意味着OOP是无用的，你永远不应该在你的程序中应用它？我不准备好这么做。当对象的思考时，当每个对象（图形设备，日志管理器等中的一个中只有一个时，虽然在这种情况下，但您可能会用简单的C样式函数和文件级静态数据写入。即使在这种情况下，这些对象仍然是在转换数据中设计的。\n 我仍然发现自己使用OOP的另一个情况是GUI系统。也许是因为你正在使用已经以面向对象方式设计的系统，或者可能是因为性能和复杂性并不是与GUI代码的重要因素。在任何情况下，我更喜欢亮起的GUI API，并尽可能多地使用遏制（Cocoa和Cocoatouch是良好的例子）。这是可以编写的数据导向的GUI系统，以便与之合作，但我还没有见过。\n 最后，如果这是你喜欢考虑游戏的方式，那么没有什么能阻止你的物体的心理图片。这只是敌人实体不会在内存中的相同物理位置。相反，它将被分成较小的子组件，每个子组件，每个形成类似组件的较大数据表的一部分。\n 以数据为导向的设计有点偏离传统的编程方法，而是始终思考数据以及如何转换，您将能够在性能和易于发展方面获得巨大的利益。\n 感谢Mike Acton和Jim Tilander多年来挑战我的想法，并为他们的反馈提供了对本文的反馈。\n 图片：在开发周期结束时，您的游戏爬行，但您没有看到探查器中的任何明显的热点。罪魁祸首？随机内存访问模式和常量缓存未命中。为了尝试提高性能，您尝试并行化代码的部分，但它需要英勇的工作，并且到底，由于您必须添加的所有同步，您几乎没有速度速度。要将其关闭，代码非常复杂，修复错误会产生更多问题，并立即丢弃添加新功能的想法。听起来有点熟？ \n这种情况非常准确地描述了我过去10年所涉及的每场比赛。原因不是我们正在使用的编程语言，也不是开发工具，也没有缺乏纪律。在我的经验中，它是面向对象的编程（OOP）和围绕它的文化，这在很大程度上归咎于这些问题。 OOP可能会阻碍你的项目而不是帮助它！\n  OOP在目前的游戏开发文化中被加入，在考虑比赛时很难在物体上思考。毕竟，我们一直在创建多年来代表车辆，玩家和国家机器的课程。什么是替代品？程序编程？功能语言？异国情调的编程语言？\n 以数据为导向的设计是一种方法，可以解决解决所有这些问题的程序设计。程序编程侧重于过程调用作为其主要元素，OOP主要与对象交易。请注意，这两种方法的主要焦点是代码：在一个案例中的普通程序（或函数），并在另一个内部状态相关联的分组代码。面向数据的设计将编程从对象的编程视角转移到数据本身：数据的类型，如何在内存中布置，以及如何在游戏中读取和处理。\n 根据定义编程是关于转换数据：它是创建一系列机器指令的行为，描述了如何处理输入数据并创建一些特定的输出数据。游戏只不过是一个以交互式率有效的程序，因此我们主要在那个数据上集中注意力而不是操纵它的代码是有意义的？\n 我想清理潜在的混乱和压力，以至于数据导向的设计并不意味着某些东西是数据驱动的。数据驱动的游戏通常是一个游戏，该游戏在代码之外暴露大量功能，并允许数据确定游戏的行为。这是对数据面向设计的正交概念，并且可以与任何类型的编程方法一起使用。\n   如果我们从数据的角度查看程序，理想的数据是什么样的？这取决于数据以及它是如何使用的。通常，理想数据是我们可以与最少量的努力一起使用的格式。在最佳情况下，格式将与输出相同，因此处理仅限于刚刚复制该数据。非常经常，我们理想的数据布局将是我们可以顺序地处理的大块连续性的均匀数据块。在任何情况下，目标是最大限度地减少转换量，并尽可能最大限度地释放您的数据，在资产建设过程中脱离此理想格式。\n 由于以数据为导向的设计首先将数据置于数据，我们可以围绕理想的数据格式构建整个程序。我们将永远无法使其完全理想（同样的方式，代码几乎没有逐字oop），但这是牢记的主要目标。一旦我们实现了这一点，列在列开始时提到的大多数问题都倾向于融化（更多关于下一部分的信息）。 \n当我们考虑对象时，我们立即想到树木继承树，遏制树或消息传递树，我们的数据自然地排列。因此，当我们对对象执行操作时，它通常会导致该对象依次进一步访问树中的其他对象。在执行相同操作的一组对象上迭代，在每个对象处生成级联，完全不同的操作（参见图1A）。\n  为了实现最佳的数据布局，将每个对象分解为不同的组件，以及在内存中的同一类型的组组件，无论它们来自哪些对象，都会有助于它们。该组织导致大块的同类数据块，允许我们顺序处理数据（见图1B）。一种关键原因，为什么数据导向设计如此强大，是因为它在大群对象上工作得很好。 OOP，根据定义，在一个对象上工作。退后一分钟，想想你工作的最后一场比赛：你的代码中有多少个地方你只有一个东西？一个敌人？一辆车？一个散文赛\n...... ", "note_en": "Picture this: Toward the end of the development cycle, your game crawls, but you don’t see any obvious hotspots in the profiler. The culprit? Random memory access patterns and constant cache misses. In an attempt to improve performance, you try to parallelize parts of the code, but it takes heroic efforts, and, in the end, you barely get much of a speed-up due to all the synchronization you had to add. To top it off, the code is so complex that fixing bugs creates more problems, and the thought of adding new features is discarded right away. Sound familiar?\n That scenario pretty accurately describes almost every game I’ve been involved with for the last 10 years. The reasons aren’t the programming languages we’re using, nor the development tools, nor even a lack of discipline. In my experience, it’s object- oriented programming (OOP) and the culture that surrounds it that is in large part to blame for those problems. OOP could be hindering your project rather than helping it!\n  OOP is so ingrained in the current game development culture that it’s hard to think beyond objects when thinking about a game. After all, we’ve been creating classes representing vehicles, players, and state machines for many years. What are the alternatives? Procedural programming? Functional languages? Exotic programming languages?\n Data-oriented design is a different way to approach program design that addresses all these problems. Procedural programming focuses on procedure calls as its main element, and OOP deals primarily with objects. Notice that the main focus of both approaches is code: plain procedures (or functions) in one case, and grouped code associated with some internal state in the other. Data-oriented design shifts the perspective of programming from objects to the data itself: The type of the data, how it is laid out in memory, and how it will be read and processed in the game.\n Programming, by definition, is about transforming data: It’s the act of creating a sequence of machine instructions describing how to process the input data and create some specific output data. A game is nothing more than a program that works at interactive rates, so wouldn’t it make sense for us to concentrate primarily on that data instead of on the code that manipulates it?\n I’d like to clear up potential confusion and stress that data-oriented design does not imply that something is data- driven. A data-driven game is usually a game that exposes a large amount of functionality outside of code and lets the data determine the behavior of the game. That is an orthogonal concept to data-oriented design, and can be used with any type of programming approach.\n  If we look at a program from the data point of view, what does the ideal data look like? It depends on the data and how it’s used. In general, the ideal data is in a format that we can use with the least amount of effort. In the best case, the format will be the same we expect as an output, so the processing is limited to just copying that data. Very often, our ideal data layout will be large blocks of contiguous, homogeneous data that we can process sequentially. In any case, the goal is to minimize the amount of transformations, and whenever possible, you should bake your data into this ideal format offline, during your asset-building process.\n Because data-oriented design puts data first and foremost, we can architect our whole program around the ideal data format. We won’t always be able to make it exactly ideal (the same way that code is hardly ever by-the-book OOP), but it’s the primary goal to keep in mind. Once we achieve that, most of the problems I mentioned at the beginning of the column tend to melt away (more about that in the next section).\n When we think about objects, we immediately think of trees— inheritance trees, containment trees, or message-passing trees, and our data is naturally arranged that way. As a result, when we perform an operation on an object, it will usually result in that object in turn accessing other objects further down in the tree. Iterating over a set of objects performing the same operation generates cascading, totally different operations at each object (see Figure 1a).\n To achieve the best possible data layout, it’s helpful to break down each object into the different components, and group components of the same type together in memory, regardless of what object they came from. This organization results in large blocks of homogeneous data, which allow us to process the data sequentially (see Figure 1b). A key reason why data-oriented design is so powerful is because it works very well on large groups of objects. OOP, by definition, works on a single object. Step back for a minute and think of the last game you worked on: How many places in the code did you have only one of something? One enemy? One vehicle? One pathfinding node? One bullet? One particle? Never! Where there’s one, there are many. OOP ignores that and deals with each object in isolation. Instead, we can make things easy for us and for the hardware and organize our data to deal with the common case of having many items of the same type.\n Does this sound like a strange approach? Guess what? You’re probably already doing this in some parts of your code: The particle system! Data-oriented design is turning our whole codebase into a gigantic particle system. Perhaps a name for this approach that would be more familiar to game programmers would have been particle-driven programming.\n  hinking about data first and architecting the program based on that brings along lots of advantages.\n  These days, there’s no way around the fact that we need to deal with multiple cores. Anyone who has tried taking some OOP code and parallelizing it can attest how difficult, error prone, and possibly not very efficient that is. Often you end up adding lots of synchronization primitives to prevent concurrent access to data from multiple threads, and usually a lot of the threads end up idling for quite a while waiting for other threads to complete. As a result, the performance improvement can be quite underwhelming.\n When we apply data-oriented design, parallelization becomes a lot simpler: We have the input data, a small function to process it, and some output data. We can easily take something like that and split it among multiple threads with minimal synchronization between them. We can even take it further and run that code on processors with local memory (like the SPUs on the Cell processor) without having to do anything differently.\n  In addition to using multiple cores, one of the keys to achieving great performance in modern hardware, with its deep instruction pipelines and slow memory systems with multiple levels of caches, is having cache-friendly memory access. Data-oriented design results in very efficient use of the instruction cache because the same code is executed over and over. Also, if we lay out the data in large, contiguous blocks, we can process the data sequentially, getting nearly perfect data cache usage and great performance. Possible optimizations. When we think of objects or functions, we tend to get stuck optimizing at the function or even the algorithm level; Reordering some function calls, changing the sort method, or even re-writing some C code with assembly.\n That kind of optimization is certainly beneficial, but by thinking about the data first we can step further back and make larger, more important optimizations. Remember that all a game does is transform some data (assets, inputs, state) into some other data (graphics commands, new game states). By keeping in mind that flow of data, we can make higher-level, more intelligent decisions based on how the data is transformed, and how it is used. That kind of optimization can be extremely difficult and time- consuming to implement with more traditional OOP methods.\n  So far, all the advantages of data-oriented design have been based around performance: cache utilization, optimizations, and parallelization. There is no doubt that as game programmers, performance is an extremely important goal for us. There is often a conflict between techniques that improve performance and techniques that help readability and ease of development. For example, re-writing some code in assembly language can result in a performance boost, but usually makes the code harder to read and maintain.\n Fortunately, data-oriented design is beneficial to both performance and ease of development. When you write code specifically to transform data, you end up with small functions, with very few dependencies on other parts of the code. The codebase ends up being very “flat,” with lots of leaf functions without many dependencies. This level of modularity and lack of dependences makes understanding, replacing, and updating the code much easier.\n  The last major advantage of data-oriented design is ease of testing. As we saw in the June and August Inner Product columns, writing unit tests to check object interactions is not trivial. You need to set up mocks and test things indirectly. Frankly, it’s a bit of a pain. On the other hand, when dealing directly with data, it couldn’t be easier to write unit tests: Create some input data, call the transform function, and check that the output data is what we expect. There’s nothing else to it. This is actually a huge advantage and makes code extremely easy to test, whether you’re doing test-driven development or just writing unit tests after the code.\n  Data-oriented design is not the silver bullet to all the problems in game development. It does help tremendously writing high-performance code and making programs more readable and easier to maintain, but it does come with a few drawbacks of its own.\n The main problem with data-oriented design is that it’s different from what most programmers are used to or learned in school. It requires turning our mental model of the program ninety degrees and changing how we think about it. It takes some practice before it becomes second-nature.\n Also, because it’s a different approach, it can be challenging to interface with existing code, written in a more OOP or procedural way. It’s hard to write a single function in isolation, but as long as you can apply data-oriented design to a whole subsystem you should be able to reap a lot of the benefits.\n  Enough of the theory and overview. How do you actually get started with data-oriented design? To start with, just pick a specific area in your code: navigation, animations, collisions, or something else. Later on, when most of your game engine is centered around the data, you can worry about data flow all the way from the start of a frame until the end.\n The next step is to clearly identify the data inputs required by the system, and what kind of data it needs to generate. It’s OK to think about it in OOP terms for now, just to help us identify the data. For example, in an animation system, some of the input data is skeletons, base poses, animation data, and current state. The result is not “the code plays animations,” but the data generated by the animations that are currently playing. In this case, our outputs would be a new set of poses and an updated state.\n It’s important to take a step further and classify the input data based on how it is used. Is it read- only, read-write, or write-only? That classification will help guide design decisions about where to store it, and when to process it depending on dependencies with other parts of the program.\n At this point, stop thinking of the data required for a single operation, and think in terms of applying it to dozens or hundreds of entries. We no longer have one skeleton, one base pose, and a current state, and instead we have a block of each of those types with many instances in each of the blocks.\n Think very carefully how the data is used during the transformation process from input to output. You might realize that you need to scan a particular field in a structure to perform a pass on the data, and then you need to use the results to do another pass. In that case, it might make more sense to split that initial field into a separate block of memory that can be processed independently, allowing for better cache utilization and potential parallelization. Or maybe you need to vectorize some part of the code, which requires fetching data from different locations to put it in the same vector register. In that case, that data can be stored contiguously so vector operations can be applied directly, without any extra transformations.\n Now you should have a very good understanding of your data. Writing the code to transform it is going to be much simpler. It’s like writing code by filling in the blanks. You’ll even be pleasantly surprised to realize that the code is much simpler and smaller than you thought in the first place, compared to what the equivalent OOP code would have been.\n If you think back about most of the topics we’ve covered in this column over the last year, you’ll see that they were all leading toward this type of design. Now it’s the time to be careful about how the data is aligned (Dec 2008 and Jan 2009), to bake data directly into an input format that you can use efficiently (Oct and Nov 2008), or to use non- pointer references between data blocks so they can be easily relocated (Sept 2009).\n  Does this mean that OOP is useless and you should never apply it in your programs? I’m not quite ready to say that. Thinking in terms of objects is not detrimental when there is only one of each object (a graphics device, a log manager, etc) although in that case you might as well write it with simpler C-style functions and file-level static data. Even in that situation, it’s still important that those objects are designed around transforming data.\n Another situation where I still find myself using OOP is GUI systems. Maybe it’s because you’re working with a system that is already designed in an object-oriented way, or maybe it’s because performance and complexity are not crucial factors with GUI code. In any case, I much prefer GUI APIs that are light on inheritance and use containment as much as possible (Cocoa and CocoaTouch are good examples of this). It’s very possible that a data-oriented GUI system could be written for games that would be a pleasure to work with, but I haven’t seen one yet.\n Finally, there’s nothing stopping you from still having a mental picture of objects if that’s the way you like to think about the game. It’s just that the enemy entity won’t be all in the same physical location in memory. Instead, it will be split up into smaller subcomponents, each one forming part of a larger data table of similar components.\n Data-oriented design is a bit of a departure from traditional programming approaches, but by always thinking about the data and how it needs to be transformed, you’ll be able to reap huge benefits both in terms of performance and ease of development.\n Thanks to Mike Acton and Jim Tilander for challenging my ideas over the years and for their feedback on this article.\n Picture this: Toward the end of the development cycle, your game crawls, but you don’t see any obvious hotspots in the profiler. The culprit? Random memory access patterns and constant cache misses. In an attempt to improve performance, you try to parallelize parts of the code, but it takes heroic efforts, and, in the end, you barely get much of a speed-up due to all the synchronization you had to add. To top it off, the code is so complex that fixing bugs creates more problems, and the thought of adding new features is discarded right away. Sound familiar?\n That scenario pretty accurately describes almost every game I’ve been involved with for the last 10 years. The reasons aren’t the programming languages we’re using, nor the development tools, nor even a lack of discipline. In my experience, it’s object- oriented programming (OOP) and the culture that surrounds it that is in large part to blame for those problems. OOP could be hindering your project rather than helping it!\n  OOP is so ingrained in the current game development culture that it’s hard to think beyond objects when thinking about a game. After all, we’ve been creating classes representing vehicles, players, and state machines for many years. What are the alternatives? Procedural programming? Functional languages? Exotic programming languages?\n Data-oriented design is a different way to approach program design that addresses all these problems. Procedural programming focuses on procedure calls as its main element, and OOP deals primarily with objects. Notice that the main focus of both approaches is code: plain procedures (or functions) in one case, and grouped code associated with some internal state in the other. Data-oriented design shifts the perspective of programming from objects to the data itself: The type of the data, how it is laid out in memory, and how it will be read and processed in the game.\n Programming, by definition, is about transforming data: It’s the act of creating a sequence of machine instructions describing how to process the input data and create some specific output data. A game is nothing more than a program that works at interactive rates, so wouldn’t it make sense for us to concentrate primarily on that data instead of on the code that manipulates it?\n I’d like to clear up potential confusion and stress that data-oriented design does not imply that something is data- driven. A data-driven game is usually a game that exposes a large amount of functionality outside of code and lets the data determine the behavior of the game. That is an orthogonal concept to data-oriented design, and can be used with any type of programming approach.\n   If we look at a program from the data point of view, what does the ideal data look like? It depends on the data and how it’s used. In general, the ideal data is in a format that we can use with the least amount of effort. In the best case, the format will be the same we expect as an output, so the processing is limited to just copying that data. Very often, our ideal data layout will be large blocks of contiguous, homogeneous data that we can process sequentially. In any case, the goal is to minimize the amount of transformations, and whenever possible, you should bake your data into this ideal format offline, during your asset-building process.\n Because data-oriented design puts data first and foremost, we can architect our whole program around the ideal data format. We won’t always be able to make it exactly ideal (the same way that code is hardly ever by-the-book OOP), but it’s the primary goal to keep in mind. Once we achieve that, most of the problems I mentioned at the beginning of the column tend to melt away (more about that in the next section).\n When we think about objects, we immediately think of trees— inheritance trees, containment trees, or message-passing trees, and our data is naturally arranged that way. As a result, when we perform an operation on an object, it will usually result in that object in turn accessing other objects further down in the tree. Iterating over a set of objects performing the same operation generates cascading, totally different operations at each object (see Figure 1a).\n  To achieve the best possible data layout, it’s helpful to break down each object into the different components, and group components of the same type together in memory, regardless of what object they came from. This organization results in large blocks of homogeneous data, which allow us to process the data sequentially (see Figure 1b). A key reason why data-oriented design is so powerful is because it works very well on large groups of objects. OOP, by definition, works on a single object. Step back for a minute and think of the last game you worked on: How many places in the code did you have only one of something? One enemy? One vehicle? One pathfin\n......", "posttime": "2021-06-29 22:42:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,数据,oriented", "title": "面向数据的设计或为什么您可以使用OOP（2009） ", "title_en": "Data-oriented design or why you might shoot yourself in the foot with OOP (2009)", "transed": 1, "url": "https://gamesfromwithin.com/data-oriented-design", "via": "", "real_tags": ["设计", "数据", "oriented"]}, {"category": "", "categoryclass": "", "imagename": "0eafd44e569585eb494172cb58b47d97.jpg", "infoid": 1068469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "墨西哥＆＃39;最高法院已经将大麻的私人娱乐用法汇编成了成年人，呼吁目前的禁止违宪。\n 在8-3个决定中，法院裁定成年人能够申请培养和消费自己的大麻的许可证。在公共和孩子面前禁止吸烟。\n      墨西哥联队反对犯罪，这是一个非政府组织，表示决定＆＃34;并没有将所需的活动减少，以开展消费和＃34;如占有和运输。\n 墨西哥＆＃39;下楼批准了一项法案在3月份合法化大麻的娱乐使用，但仍需要参议院的最终批准。\n 立法会让许可证的用户携带高达28克，并在家中长达八个植物供个人使用。目前，携带超过五克是违法的。\n 合法化的支持者希望它可以减少与非法毒品贸易有关的一些暴力，这在每年都声称该国成千上万的人的生活。 ", "note_en": "Mexico&#39;s Supreme Court has decriminalised the private recreational use of cannabis by adults, calling the current prohibition unconstitutional.\n In an 8-3 decision, the court ruled that adults would be able to apply for permits to cultivate and consume their own cannabis. Smoking in public and in front of children is banned.\n      Mexico United Against Crime, a non-governmental organisation, said the decision &#34;does not decriminalise the activities necessary to carry out consumption&#34; such as possession and transportation.\n Mexico&#39;s lower house  approved a bill legalising the recreational use of cannabis in March, but it still needs final approval by the Senate.\n The legislation would let users with a permit carry up to 28g and grow as many as eight plants at home for personal use. At present, it is illegal to carry more than five grams.\n Supporters of legalisation hope it could reduce some of the violence related to illegal drugs trade, which claims the lives of thousands of people in the country every year.", "posttime": "2021-06-29 22:41:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "汇编,supreme,大麻", "title": "墨西哥最高法院已通过成年人汇编私人使用大麻 ", "title_en": "Mexico's Supreme Court has decriminalised the private use of cannabis by adults", "transed": 1, "url": "https://www.bbc.co.uk/news/world-latin-america-57645016", "via": "", "real_tags": ["汇编", "supreme", "大麻"]}, {"category": "", "categoryclass": "", "imagename": "e63f36e68e5cd3e176f1834ea629ca47.jpg", "infoid": 1068468, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Youtube周一表示，它恢复了由右翼手表运行的渠道，该频道编目了一些突出保守派的一些最极端的陈述，几个小时后，谷歌拥有的视频平台禁止违反其规则的渠道。\n ＆＃34;右翼手表＆＃39; youtube频道被错误地暂停，但在进一步审查后，现已恢复，＆＃34;科技公司在一份声明中表示。\n  它将错误归因于其网站上的大量视频。 YouTube为每分钟上传的超过500小时内容自动化大部分内容审核，并且它表示，当渠道被错误地删除渠道时，它会尝试快速行动。\n   右翼腕表是美国方式的人口，一个自由主义倡导集团成立于1981年，基于华盛顿特区，该项目已从政客，传教士和其他数字汇款超过10年以上的youtube，雕刻观众约有47,000名订阅者。\n 周一早些时候，右翼手表表示已收到与IT职位的视频片段中违反规则违规的永久禁令通知，这通常显示涉嫌仇恨言论，阴谋理论和其他禁止内容的例子。\n 该集团表示，禁令是youtube的讽刺意见，试图执行其规则，因为公司不仅仅是诸如阴谋理论等原始材料来源，而且还有那些寻求记录的材料。\n ＆＃34;我们努力揭露右翼活动家传播的巨大视图和危险的阴谋理论，现在导致@youtube禁止我们的频道并删除了数千个视频，＆＃34;右翼手表周一早些时候在一份声明中说。 \n一些保守的活动家在删除中很高兴，注意到推特上的帖子，右翼手表经常呼吁YouTube禁止他们或他们的盟友违规。但其他人表示，禁令表明YouTube无法区分禁止内容的创造者和反击它的人。\n  在极端主义视频的存在下，YouTube和右翼手表已经在历史数年中奋斗。\n 10月，右翼手表表示，YouTube将其中一节记录了与Qanon阴谋理论相关的内容，但留下了本集团找到内容的原始YouTube频道。它报告了4月份的类似动态，内容与2020年总统选举有关。\n  右翼手表的高级研究员Kyle Mantyla在接受采访时表示，该项目有两个＆＃34;罢工＆＃34;来自4月的YouTube进行关于选举相关的阴谋理论的剪辑。他说，YouTube交付了第三次和最终＆＃34;罢工＆＃34;本月早些时候是一位八十岁的宗教广播公司的视频，他们正在谴责同性恋者。\n  ＆＃34;他们无法区分那些试图倡导这种东西的人和那些试图记录和抵消它的人在这里的核心，＆＃34;他说。\n 他周一早些时候表示，从2019年开始，该集团开始切换到竞争对手的Vimeo作为视频主机。\n  ＆＃34;没有准确描绘危险行为的能力，有意义的新闻和公共教育就该行为将停止存在，＆＃34;右翼观察主任阿德利斯坦在一份声明中说。 \n＆＃34;我们希望这是与YouTube斗争的结束，了解我们工作的本质，＆＃34; 她说。  记者和研究人员多年来一直警告社交媒体网络无意中抹去极端主义或暴力的证据，因为他们试图摆脱他们的令人反感材料的服务。 在去年的一份报告中，一个调查全世界滥用的非营利组织的人权观察，警告说，YouTube和其他科技公司未能归档包括在内的严重罪行的潜在证据。 ", "note_en": "YouTube said Monday that it had reinstated a channel run by Right Wing Watch that cataloged some of the most extreme statements of prominent conservatives, hours after the Google-owned video platform had banned the channel for violating its rules.\n &#34;Right Wing Watch&#39;s YouTube  channel was mistakenly suspended, but upon further review, has now been reinstated,&#34; the tech company said in a statement.\n  It attributed the mistake to the large volume of videos on its site. YouTube automates much of the content moderation for the more than 500 hours of content that it says are uploaded every minute, and it said it tries to act quickly when a channel is mistakenly removed.\n   Right Wing Watch is a project of People for the American Way, a liberal advocacy group founded in 1981 and based in Washington, D.C. The project had been posting video clips from politicians, preachers and other figures for more than 10 years on YouTube, carving out an audience of about  47,000 subscribers.\n Earlier Monday, Right Wing Watch said it had received a notice of a permanent ban related to rules violations in the video clips that it posts, which often show examples of alleged hate speech, conspiracy theories and other prohibited content.\n The group said the ban was an ironic outcome of YouTube trying to enforce its rules, as the company targeted not just the original source of material such as conspiracy theories, but also those who seek to document it.\n &#34;Our efforts to expose the bigoted view and dangerous conspiracy theories spread by right-wing activists has now resulted in @YouTube banning our channel and removing thousands of our videos,&#34; Right Wing Watch had said in a  statement  early Monday.\n  Some conservative activists had  delighted in the removal, noting in posts on Twitter that Right Wing Watch had often called on YouTube to ban them or their allies for rules violations. But others said the ban showed a troubling inability by YouTube to distinguish between creators of prohibited content and those countering it.\n  YouTube and Right Wing Watch have battled for years over the presence of extremist videos.\n In October, Right Wing Watch said that YouTube  removed one of its videos documenting content related to the QAnon conspiracy theory, but had left up the original YouTube channel where the group found the content. It reported a similar  dynamic in April with content related to the 2020 presidential election.\n  Kyle Mantyla, a senior fellow at Right Wing Watch, said in an interview that the project got two &#34;strikes&#34; from YouTube in April for clips about election-related conspiracy theories. He said YouTube delivered a third and final &#34;strike&#34; earlier this month for an eight-year-old video of a religious broadcaster who was denouncing gays.\n  &#34;Their inability to differentiate between the people who are trying to advocate this stuff and those who are trying to document and counter it is at the heart of the problem here,&#34; he said.\n He said early Monday that, beginning in 2019, the group began switching to the rival service Vimeo as its video host.\n  &#34;Without the ability to accurately portray dangerous behavior, meaningful journalism and public education about that behavior would cease to exist,&#34; Right Wing Watch Director Adele Stan said in a statement.\n  &#34;We hope this is the end of a years-long struggle with YouTube to understand the nature of our work,&#34; she said.\n Journalists and researchers have warned for years about social media networks inadvertently erasing evidence of extremism or violence as they try to rid their services of objectionable material. In a report last year, Human Rights Watch, a nonprofit group that investigates abuses worldwide,  warned that YouTube and other tech companies were failing to archive potential evidence of serious crimes including war crimes.", "posttime": "2021-06-29 22:41:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,恢复,reinstates", "title": "YouTube恢复了右翼手表 ", "title_en": "YouTube reinstates Right Wing Watch", "transed": 1, "url": "https://www.nbcnews.com/tech/tech-news/youtube-reinstates-channel-devoted-exposing-conservative-extremism-rcna1286", "via": "", "real_tags": ["youtube", "恢复"]}, {"category": "", "categoryclass": "", "imagename": "9895536060bdbda218c9640d64556e35.jpg", "infoid": 1068467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "激光成为整个光线的整个粉丝席卷，然后感觉好像屏幕开始扩大。\n 我看到了老石建筑......就像一座城堡......我在它上面飞行。\n   实际上，他们是观看＆＃34; Ganzflicker＆＃34之后的不同人报告的陈述;在他们的计算机上 - 一个激烈的全屏，红光闪烁，任何人都可以在线访问，我们在我们的实验中使用。\n 在不到十分钟的时间内，它创造了改变的意识状态，对大脑没有持久的影响。在开始看它时，几乎可以在视觉体验中设置。\n 但是我们在皮质出版的新研究表明，虽然有些人在Ganzflicker看到城堡或分形，但其他人都看不见。我们提出了那些个人差异来自的地方的理论。\n 与计算机屏幕一样，您的大脑的一部分处理可视信息（Visual Cortex）具有刷新＆＃34;按钮＆＃34;这有助于它对环境进行采样 - 快速连续拍摄世界的快照。\n 换句话说，您的大脑以一定的频率收集感官信息。然而，由于您的大脑填补了空白的精致能力，因此您认为世界视为连续和动态。 \n例如，你的眼睛在视力中心外面有一个盲点，但你不在你看的地方看到一片黑暗。您的Visual Cortex从周围的视觉信息外推开，以便您的整个视野​​似乎是完整的。如果正在处理的感官信息是Ganzflicker，这将与您的大脑相互作用，并自己的节奏互动，以改变您填写或解释您所看到的内容。\n   众所周知，Ganzflicker在外部环境中引发了外部环境中异常感官信息的体验，称为伪幻觉。 ＆＃34;简单＆＃34;像看到激光或虚幻颜色一样的经验 - 先前已经被解释为你的大脑在甘兹弗里克和大脑之间发生冲突。\n   大脑由许多不同的地区组成，彼此相互作用，包括＆＃34;低级＆＃34;感觉区域和与＆＃34的区域;高级＆＃34;认知过程。例如，区分线是垂直或水平的，被认为是低水平的感官过程，而确定面部是否友好或生气是一种高级别的认知过程。后者更加开放解释。\n 视觉心理图像，或感官信息的精神仿真 - ＆＃34;心灵＆＃39;眼睛＆＃34; - 是这些高级认知过程之一。高级进程可以与低级流程互动以塑造您的大脑＆＃39;对您所看到的内容的解释。\n 如果有人在Ganzflicker中看到简单的伪幻觉，他们的大脑可能会自动将该信息解释为与他们的思想的帮助和掌声更加有意义或现实。\n   大多数人都在＆＃39; t意识到的是每个人和＃39;图像不同。有些人有图像，如同实际看到他们面前的东西。一小部分人有一个＆＃34;盲目的心灵＆＃39;眼睛＆＃34;甚至无法想象他们朋友或家人的面孔。这种情况被称为喇叭性，在过去几年中吸引了越来越大的关注。\n   很难描述和比较图像经验，因为它们是私人的，内部的主观事件。但事实证明，Ganzflicker可以帮助。 \n我们发现图像能力可以反映在一个人的描述中，并在与Ganzflicker的一个十分钟的经验描述中反映。几乎一半的人在甘兹弗莱克绝对没有看到任何东西。\n 另一半看到大多数简单的模式，如几何形状或虚幻的颜色。将其与视觉心理图像的人进行比较，其中大多数人看到有意义的复杂物体，例如动物和面孔。有些人甚至看到整个伪幻觉环境，如暴风雨的海滩或中世纪城堡。\n   回到脑子节奏的想法，它可能是看到图像的人们在视觉皮质 - 更接近Ganzflicker频率的情况下具有自然较低的频率节律 - 这使得它们易于体验伪幻觉。\n 另一方面，患有喇叭花的人们在视觉皮层中具有自然更高的频率节律 - 这可能会给他们一个缓冲措施抵抗Ganzflicker的影响。\n 我们的理论是Ganzflicker引发的精神图像和伪幻觉在大脑中挖掘成相同的过程。这意味着Ganzflicker捕获了人们的动态投影＆＃39;想象的经历，就像打开一个窗户到心灵＆＃39;眼睛。\n 因此，Ganzflicker是一个有希望的工具，用于了解心理图像的个体差异及其与视觉环境的互动。\n 实验可以帮助人们彼此共享他们独特的经验 - 最终将主观经验带入现实世界。 \n本文以创造性的公共许可下的谈话中重新发布。 阅读原始文章。 ", "note_en": "Lasers became entire fans of light sweeping around, and then it felt as if the screen began to expand.\n I saw old stone buildings … like a castle … I was flying above it.\n   In reality, they are statements that different people reported after viewing the &#34;Ganzflicker&#34; on their computers – an intense full-screen, red-and-black flicker  that anyone can access online and that we use in our experiments.\n In less than ten minutes, it creates altered states of  consciousness, with no lasting effects for the brain. Visual experiences set in almost as soon as you start looking at it.\n But our new study,  published in  Cortex, shows that while some people see castles or fractals in the Ganzflicker, others see nothing. We have come up with a theory of where those individual differences come from.\n Like a computer screen, the part of your brain that processes visual information (the visual cortex) has a refresh &#34;button&#34; which helps it sample the environment –  taking snapshots of the world in quick succession.\n In other words, your brain collects sensory information with a certain frequency. Yet you see the world as continuous and dynamic, thanks to your brain&#39;s sophisticated ability to fill in the blanks.\n For example, your eyes have a blind spot right outside the center of vision, but you don&#39;t see a patch of blackness everywhere you look. Your visual cortex extrapolates from the surrounding visual information so that your whole field of view  appears to be complete. If the sensory information being processed is the Ganzflicker, this will interact with your brain&#39;s own rhythms to alter how you fill in or interpret what you are seeing.\n   Ganzflicker is known to elicit the experience of anomalous sensory information in the external environment, called pseudo-hallucinations. &#34;Simple&#34; experiences - like seeing lasers or illusory colours - have previously been explained as your brain reacting to  clashes between Ganzflicker and the brain&#39;s rhythms.\n   The brain is composed of many different regions interacting with each other, including &#34;low-level&#34; sensory regions and regions that correspond to &#34;high-level&#34; cognitive processes. Discriminating whether a line is vertical or horizontal, for example, is considered a low-level sensory process, whereas determining whether a face is friendly or annoyed is a high-level cognitive process. The latter is more open to interpretation.\n Visual mental imagery, or the mental simulation of sensory information – the &#34;mind&#39;s eye&#34; – is one of these high-level cognitive processes. High-level processes can interact with low-level processes to shape your brain&#39;s interpretation of what you are seeing.\n If someone sees simple pseudo-hallucinations in the Ganzflicker, their brains may automatically interpret that information as more meaningful or realistic with help from their mind&#39;s eye.\n   What most people don&#39;t realise is that everyone&#39;s imagery is different. Some people have imagery that is as vivid as actually seeing something in front of them. A small proportion of people have a &#34;blind mind&#39;s eye&#34; and cannot even visualize the faces of their friends or family. This condition  is called aphantasia, and has attracted an increasing amount of attention in the last few years.\n   It is very difficult to describe and compare imagery experiences, since they are private, internal, subjective events. But it turns out that the Ganzflicker can help.\n We discovered that imagery ability can be reflected in an individual&#39;s description of a ten-minute experience with Ganzflicker. Almost half of people with aphantasia see absolutely nothing in the Ganzflicker.\n The other half see mostly simple patterns like geometric shapes or illusory colors. Compare that to people with visual mental imagery, for whom the majority see meaningful complex objects, such as animals and faces. Some even see entire pseudo-hallucinatory environments, like a stormy beach or a medieval castle.\n   Going back to the idea of brain rhythms, it&#39;s possible that people who see imagery have naturally lower-frequency rhythms in visual cortex - closer to the Ganzflicker frequency - which makes them susceptible to experiencing pseudo-hallucinations.\n People with aphantasia, on the other hand, have naturally higher-frequency rhythms in the visual cortex – which may give them a buffer against the effects of the Ganzflicker.\n Our theory is that mental imagery and pseudo-hallucinations elicited by Ganzflicker are tapping into the same processes in the brain. This means that Ganzflicker captures a dynamic projection of people&#39;s imagined experiences, like opening a window to the mind&#39;s eye.\n Ganzflicker is therefore a promising tool for understanding individual differences in mental imagery and its interaction with the visual environment.\n The experiment can help people share their unique experiences with each other – ultimately bringing subjective experience into the real world.\n  This article is republished from  The Conversation under a Creative Commons license. Read the  original article.", "posttime": "2021-06-29 22:40:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "显示,test,ganzflicker", "title": "简单的测试显示，如果您的心理图像比其他人更生动 ", "title_en": "Simple test reveals if your mental images are more vivid than other people's", "transed": 1, "url": "https://www.sciencealert.com/this-simple-test-reveals-if-your-mental-images-are-more-vivid-than-other-people-s", "via": "", "real_tags": ["显示", "test"]}, {"category": "", "categoryclass": "", "imagename": "26b452efb899772289a29e0b89542e3c.jpeg", "infoid": 1068466, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "教育技术公司2u Inc.运行了几十大大学的研究生课程，正在购买由哈佛大学和马萨诸塞州理工学院成立的基于网络的课程供应商EDX，以8亿美元。\n  该交易将在线教学中的两位主要参与者结合在线教学中，作为世界各地的大学，更积极地进入数字产品。许多学校在去年大流行关闭校园时争抢在线转换课程，现在预计将建立策划和波兰语。\n  销售收益将由哈佛大学和麻省理工学院进行一项非营利组织，学校表示将重点关注减少获得教育的不平等。学校说，它将维持由EDX，研究在线和混合学习模型构建的开放式接入课程平台，并努力最大限度地减少作为许多年幼学生和成人的障碍的数字鸿沟。\n  “这是早期的教育转型中的早期局，”2U CEO芯片Paucek表示，他补充说他预计“在线教育正常，简单地教育”。\n  EDX由哈佛大学和麻省理工学院成立于2012年，其目的是将精英教育民主化，以自由课程为主教授，为全球学生提供。随着时间的推移，它增加了完成证书，可用于费用，当堆叠在一起时，课程序列可能导致凭证并最终是一定程度。它还开始在包括企业家精神和网络安全的主题中提供公司培训。\n  您将收取$ +税（如果适用）为华尔街日记。您可以随时在客户中心的任何时间更改帐单偏好或致电客户服务。您将在率或条款的任何变化提前通知您。您可以随时通过调用客户服务来取消订阅。 ", "note_en": "Education-technology company 2U Inc., which runs graduate programs for dozens of top universities, is buying web-based course provider edX, a nonprofit founded by Harvard University and the Massachusetts Institute of Technology, for $800 million.\n  The deal combines two major players in online instruction as universities around the world push more aggressively into digital offerings. Many schools scrambled to shift courses online when the pandemic shut campuses last year, and they are now expected to build on—and polish—the programs.\n  The sale proceeds will go to a nonprofit, to be run by Harvard and MIT, that the schools say will focus on reducing inequalities in access to education. It will maintain the open-access course platform built by edX, research online and hybrid-learning models, and work to minimize the digital divide that still serves as a barrier for many younger students and adults, the schools said.\n  “This is early innings in the digital transformation of education,” said 2U CEO Chip Paucek, adding that he anticipates a time when “online education is normalized as, simply, education.”\n  EdX was founded by Harvard and MIT in 2012, its aim to democratize elite education with free classes, taught by top professors, available to students globally. Over time, it added completion certificates, available for a fee, and course sequences that, when stacked together, could lead to credentials and ultimately a degree. It also began  providing corporate training in subjects including entrepreneurship and cybersecurity.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-06-29 22:40:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,哈佛大学,mit,课程", "title": "哈佛大学，麻省理工学院的一部分，可以推动在线教育 ", "title_en": "Harvard, MIT Part of $800M Deal to Push Access to Online Education", "transed": 1, "url": "https://www.wsj.com/articles/harvard-mit-part-of-800-million-deal-to-push-access-to-online-education-11624964401", "via": "", "real_tags": ["大学", "哈佛大学", "mit", "课程"]}]