[{"category": "", "categoryclass": "", "imagename": "f07dd4f36da174a72ae607aa8c176480.jpeg", "infoid": 1034962, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "柏林(路透社)-大众汽车(Volkswagen)将未来五年在数字和电动汽车技术上的计划投资提高到730亿欧元(860亿美元)，以求在新的绿色时代保住世界最大汽车制造商的桂冠。\n根据周五提交的一份计划，大众汽车(Volkswagen)表示，将把1500亿欧元的投资预算的近一半用于电动汽车、混合动力汽车、基于软件的无缝车辆操作系统和自动驾驶技术。\n在去年的计划中，这家拥有大众(VW)、奥迪(Audi)、保时捷(Porsche)、西雅特(Seat)和斯柯达(Skoda)等品牌的德国汽车和卡车制造商，从1500亿欧元的预算中拨出600亿欧元用于电动和自动驾驶汽车。\n在一定程度上由2015年大众柴油污染丑闻引发的全球减排行动，迫使汽车制造商加快了低排放技术的开发，即便是利润率较低的主流车型也是如此。\n大众汽车监事会主席汉斯·迪特尔·波奇(Hans Dieter Poetsch)表示：“公司及其品牌的转型以及对核心移动领域的战略关注将始终如一地实施。”\n杰富瑞(Jefferies)分析师菲利普·豪乔斯(Philippe Houchois)表示，尽管总体投资预算没有变化，但大众的优先事项已经“有意义地重新分配到软件和数字化领域，并继续优先考虑德国”。\n大众汽车曾表示，欧盟更严格的排放目标将迫使其在2030年之前将混合动力汽车和电动汽车在其欧洲汽车销量中的比例提高至60%，高于此前40%的目标。\n在占美国汽车销量11%的加州9月表示，计划从2035年起禁止销售新的汽油动力轿车和卡车后，改造工厂以生产电动汽车的压力也有所增加。\n限制排放已导致大众(Volkswagen)重新审视其兰博基尼(Lamborghini)、布加迪(Bugatti)和杜卡迪(Ducati)品牌的未来，该公司正寻求为转向批量生产电动汽车增加规模经济。\n在新的计划中，大众将把数字化支出增加一倍，达到270亿欧元，以开发新的汽车操作系统和自动驾驶技术。\n该公司表示，约350亿欧元的支出预算资金将投资于电子移动，110亿欧元已指定用于开发新的混合动力汽车。", "note_en": "BERLIN (Reuters) - Volkswagen has raised its planned investment on digital and electric vehicle technologies to 73 billion euros ($86 billion) over the next five years as it seeks to hold onto its crown as the world’s largest carmaker in a new green era.\n  Under a plan presented on Friday, Volkswagen said it would allocate nearly half its investment budget of 150 billion euros on e-mobility, hybrid cars, a seamless, software-based vehicle operating system and self-driving technologies.\n In last year’s plan, the German car and truck maker, which owns brands including VW, Audi, Porsche, Seat and Skoda, had earmarked 60 billion euros for electric and self-driving vehicles out of the 150 billion budget.\n A global clampdown on emissions, partly triggered by VW’s diesel pollution scandal in 2015, has forced carmakers to accelerate the development of low-emission technology, even for their low-margin mainstream models.\n “The transformation of the company and its brands as well as the strategic focus on the core mobility areas will be consistently implemented,” Volkswagen’s supervisory board Chairman Hans Dieter Poetsch said.\n  Jefferies analyst Philippe Houchois said while the overall investment budget had remained unchanged, VW’s priorities had seen a “meaningful re-allocation to software and digitisation and a continued priority on Germany”.\n Volkswagen has said the European Union’s more stringent emissions targets will force it to boost the proportion of hybrid and electric vehicles in its European car sales to 60% by 2030, up from a previous target of 40%.\n Pressure to retool factories to build electric cars has also increased after California, which accounts for 11% of U.S. car sales, said in September that it plans to ban the sale of new gasoline-powered cars and trucks from 2035.\n The emissions clampdown has already led Volkswagen to review the future of its Lamborghini, Bugatti and Ducati brands as it seeks to increase economies of scale for the shift to mass producing electric cars.\n  In its new plan, Volkswagen is doubling its spending on digitalisation to 27 billion euros, to develop its new vehicle operating system and self-driving technologies.\n About 35 billion euros of the spending budget money will be invested in e-mobility and 11 billion euros has been earmarked for the development of new hybrid cars, it said.", "posttime": "2020-11-14 08:29:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电动汽车,car", "title": "大众将电动汽车和自动驾驶汽车技术投资提升至860亿美元", "title_en": "VW Boosts Investment in Electric and Autonomous Car Technology To $86 Billon", "transed": 1, "url": "https://www.reuters.com/article/us-volkswagen-strategy/volkswagen-boosts-investment-in-electric-and-autonomous-car-technology-to-86-billon-idUSKBN27T1NB", "via": "", "real_tags": ["电动汽车", "car"]}, {"category": "", "categoryclass": "", "imagename": "7052df7659e9262ece8dfa42ce737d3b.jpg", "infoid": 1034961, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌的研究人员声称，他们已经开发出一种机器学习模型，只需对目标声源进行一小段采样，就可以将声源从嘈杂的单声道音频中分离出来。他们在一篇论文中说，他们的SoundFilter系统可以进行调整，以过滤任意的声源，即使是那些在培训期间没有见过的声源。\n研究人员相信，像SoundFilter这样的噪音消除系统可以用来创造一系列有用的技术。例如，谷歌利用自己数千次会议和YouTube视频中的音频来训练Google Meet中的噪音消除算法。与此同时，卡内基梅隆大学的一组研究人员创建了一个“声音-动作-视觉”语料库，以预测物体在受到物理力量时会移动到哪里。\nSoundFilter将声音分离任务视为一次性学习问题。该模型接收要过滤的音频混合物和要过滤出的声音类型的单个简短示例作为输入。一旦经过训练，SoundFilter有望从混合物中提取这种声音(如果存在)。\nSoundFilter采用了所谓的波到波神经网络结构，可以使用音频样本进行训练，而不需要标明信号源的类型。条件编码器获取条件音频并计算相应的嵌入(即，数值表示)，而条件生成器将混合音频和条件嵌入作为输入并产生经滤波的输出。系统假设原始音频集合由许多几秒长的剪辑组成，这些剪辑在整个持续时间内包含相同类型的声音。除此之外，SoundFilter假定每个这样的剪辑都包含一个音频源，例如一个扬声器、一个乐器或一只鸟在唱歌。\n在给定混合音频和调节音频作为输入的情况下，对模型进行训练以产生目标音频。SoundFilter培训示例由三部分组成：\n条件音频信号，这是包含与目标音频相同类型的声音的另一个示例。\n在实验中，研究人员在两个开源数据集上对SoundFilter进行了训练：FSD50L(超过5万个声音的集合)和LibriSpeech(大约1000小时的英语语音)。他们报告说，条件化编码器学会了产生代表条件化音频的声学特征的嵌入，使SoundFilter能够成功地将语音从扬声器的混合中分离出来，将声音从声音的混合中分离出来，并将单独的扬声器/声音从扬声器和声音的混合中分离出来。\nHttps://venturebeat.com/wp-content/uploads/2020/11/download-1.wav https://venturebeat.com/wp-content/uploads/2020/11/download.wav https://venturebeat.com/wp-content/uploads/2020/11/download-6.wav https://venturebeat.com/wp-content/uploads/2020/11/download-7.wav写道：“我们的工作可以通过探索如何使用作为声音过滤器一部分的嵌入来作为音频事件分类器的表示来扩展。”研究人员写道：“我们的工作可以通过探索如何使用作为声音过滤器一部分的嵌入来作为音频事件分类器的表示来扩展。”“此外，将我们的方法从”一次击发“扩展到”多次击打“也是有意义的。”\n成功打造AI卓越中心的最佳实践：\r\r有关COE和业务部门访问的指南，请访问此处", "note_en": "Researchers at Google claim to have developed a machine learning model that can separate a sound source from noisy, single-channel audio based on only a short sample of the target source. In a  paper, they say their SoundFilter system can be tuned to filter arbitrary sound sources, even those it hasn’t seen during training.\n The researchers believe a noise-eliminating system like SoundFilter could be used to create a range of useful technologies. For instance, Google drew on audio from thousands of its own meetings and YouTube videos to train the  noise-canceling algorithm in Google Meet. Meanwhile, a team of Carnegie Mellon researchers created a “ sound-action-vision” corpus to anticipate where objects will move when subjected to physical force.\n  SoundFilter treats the task of sound separation as a one-shot learning problem. The model receives as input the audio mixture to be filtered and a single short example of the kind of sound to be filtered out. Once trained, SoundFilter is expected to extract this kind of sound from the mixture if present.\n SoundFilter adopts what’s known as a wave-to-wave neural network architecture that can be trained using audio samples without requiring labels that denote the type of source. A conditioning encoder takes the conditioning audio and computes the corresponding embedding (i.e., numerical representation), while a conditional generator takes the mixture audio and the conditioning embedding as input and produces the filtered output. The system assumes that the original audio collection consists of many clips a few seconds in length that contain the same type of sound for the whole duration. Beyond this, SoundFilter assumes that each such clip contains a single audio source, such as one speaker, one musical instrument, or one bird singing.\n The model is trained to produce the target audio, given the mixture and the conditioning audio as inputs. A SoundFilter training example consists of three parts:\n A conditioning audio signal, which is another example containing the same kind of sound as the target audio\n In experiments, the researchers trained SoundFilter on two open source datasets: FSD50L (a collection of over 50,000 sounds) and LibriSpeech (around 1,000 hours of English speech). They report that the conditioning encoder learned to produce embeddings that represent the acoustic characteristics of the conditioning audio, enabling SoundFilter to successfully separate voices from mixtures of speakers, sounds from mixtures of sounds, and individual speakers/sounds from mixtures of speakers and sounds.\n    https://venturebeat.com/wp-content/uploads/2020/11/download-1.wav    https://venturebeat.com/wp-content/uploads/2020/11/download.wav    https://venturebeat.com/wp-content/uploads/2020/11/download-6.wav    https://venturebeat.com/wp-content/uploads/2020/11/download-7.wav “Our work could be extended by exploring how to use the embedding learned as part of SoundFilter as a representation for an audio event classifier,” the researchers wrote. “In addition, it would be of interest to extend our approach from one-shot to many-shot.”\n Best practices for a successful AI Center of Excellence:\r\rA guide for both CoEs and business units  Access here", "posttime": "2020-11-14 08:29:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,soundfilter,音频", "title": "谷歌的SoundFilter AI可以将任何声音或语音从混合音频录音中分离出来", "title_en": "Google's SoundFilter AI Separates Any Sound or Voice From Mixed-Audio Recordings", "transed": 1, "url": "https://venturebeat.com/2020/11/11/googles-soundfilter-ai-separates-any-sound-or-voice-from-mixed-audio-recordings/", "via": "", "real_tags": ["google", "谷歌", "音频"]}, {"category": "", "categoryclass": "", "imagename": "82bef04d814df2d4b6c79932f1fa4606.jpg", "infoid": 1034960, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AXIOM太空公司已经与三名私人宇航员签约，与前NASA宇航员迈克尔·洛佩斯·阿雷格里亚一起乘坐Ax-1，这是第一次进入轨道和前往国际空间站的私人任务。\n任务：今年3月，Axiom太空公司宣布计划发射“历史上第一次完全私人的载人航天任务，前往国际空间站。”这项名为Ax-1的任务将使用SpaceX的乘员龙飞船将私人宇航员运送到国际空间站至少8天。\n在上个月的国际宇航大会上，Axiom首席执行官迈克尔·苏弗雷迪尼(Michael Suffredini)表示，该公司的目标是在2021年第四季度发射。\n摄制组：细节仍然很少。我们知道前NASA宇航员Michael López-Alegría将是此次任务的一部分，但其他三名宇航员还没有公布。Axiom周三发布的宣传图片中有三个男性侧影，这表明飞船上将没有女性宇航员。\n推特和其他地方有一些令人兴奋的闲聊，暗示另外两名宇航员可能是演员汤姆·克鲁斯和导演道格·利曼，他们一直在与美国宇航局就在国际空间站拍摄电影一事进行谈判。NASA局长吉姆·布里登斯汀(Jim Bridenstine)在6月份提到，Axiom参与了这些谈判。\n更广泛的影响：除了电影制作，Ax-1还将是NASA目标的一个里程碑，即在2030年计划寿命结束之前，向私营行业开放国际空间站，并利用空间站作为平台，推动近地轨道更多的商业化。AXIOM计划在2024年发射一个与国际空间站相连的栖息舱，预计这只是在本十年剩下的时间里建造和组装的更大的私人空间站的第一部分。", "note_en": "Axiom Space has  signed three private astronauts to join former NASA astronaut Michael López-Alegría on Ax-1, the first private mission into orbit and to the International Space Station.\n  The mission: In March, Axiom Space  announced plans to launch “history’s first fully private human spaceflight mission to the International Space Station.” The mission, dubbed Ax-1, would go forward using SpaceX’s Crew Dragon vehicle to deliver private astronauts to the ISS for at least eight days.\n  At the International Astronautical Congress last month, Axiom CEO Michael Suffredini said the company was aiming to launch in the fourth quarter of 2021.\n  The crew: Details are still sparse. We know that former NASA astronaut Michael López-Alegría will be part of the mission, but the three other astronauts have not been announced yet. The promotional image Axiom  posted Wednesday features three male silhouettes, suggesting there will be no female astronauts on board.\n  There is some excitable  chatter on Twitter and other places suggesting that two of the other astronauts might be actor Tom Cruise and director Doug Liman, who have been in talks with NASA about  filming a movie on the ISS. NASA administrator Jim Bridenstine mentioned  in June that  Axiom was involved in those talks.\n  Broader implications: Beyond moviemaking, Ax-1 would be a milestone for NASA’s goal of  opening up the ISS to private industry activity, and using the space station as a platform to spur increased commercialization of low Earth orbit, before its planned life span ends by 2030. Axiom plans to launch  a habitat module to attach to the ISS in 2024, which is supposed to be just the first part of a larger private space station to be constructed and assembled throughout the rest of the decade.", "posttime": "2020-11-14 08:29:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "明年,company,国际", "title": "一家私人公司有一个机组人员明年将前往国际空间站。", "title_en": "A Private Company Has a Crew Going To the ISS Next Year", "transed": 1, "url": "https://www.technologyreview.com/2020/11/12/1012014/axiom-space-private-company-crew-iss-ax-1-mission-2021/", "via": "", "real_tags": ["明年", "company", "国际"]}, {"category": "", "categoryclass": "", "imagename": "e9e3a681555152d2b813f5b09921a10c.jpg", "infoid": 1034959, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，亚马逊AWS的一篇博文宣布，该公司已经将其Alexa个人助理的大部分云处理从Nvidia GPU转移到自己的Inferania和专用集成电路(ASIC)上。亚马逊开发人员Sebastien Stormacq介绍了Inferania的硬件设计如下：\nAWS Inferania是一款定制芯片，由AWS构建，用于加速机器学习推理工作负载并优化其成本。每个AWS Inferania芯片包含四个独立的NeuronCore。每个NeuronCore都实现了高性能的脉动阵列和矩阵乘法引擎，大大加快了卷积和变换等典型深度学习操作的速度。NeuronCores还配备了大型片上高速缓存，这有助于减少外部存储器访问，从而显著缩短延迟并提高吞吐量。\n当亚马逊的客户--通常是拥有Echo或Echo圆点的人--使用Alexa个人助理时，设备本身的处理过程很少。典型Alexa请求的工作负载如下所示：\n一个人类对亚马逊的回声说：亚历克莎，格雷伯爵茶中的特殊成分是什么？\n在亚马逊数据中心内，语音流被转换为音素(推理AI工作负载)。\n意图被路由到适当的履行服务，该服务以JSON文档的形式返回响应。\n自然语音音频回传到Echo设备进行播放--这是它的佛手柑橘子油。\n正如您所看到的，在满足Alexa请求时，几乎所有的实际工作都发生在云中--而不是在Echo或Echo Dot设备本身。绝大多数的云计算工作不是由传统的如果-那么逻辑完成的，而是推理--这是神经网络处理中提供答案的那一面。\n根据Stormacq的说法，将推断工作从Nvidia GPU硬件转移到亚马逊自己的Inferania芯片上，使得Alexa的文本到语音工作负载的端到端延迟降低了30%，端到端延迟缩短了25%。亚马逊并不是唯一一家使用Inferania处理器的公司，该芯片支持亚马逊AWS Inf1实例，这些实例面向普通大众，与亚马逊搭载GPU的G4实例展开竞争。\n亚马逊的AWS Neuron软件开发包允许机器学习开发者使用Inferania作为流行框架的目标，包括TensorFlow、PyTorch和MXNet。\n当我刚开始从事计算机行业时，大多数大公司都是自己制造硅的，而且大部分都是基于RISC的。IBM有自己版本的PowerPC芯片。当然是太阳。Sun拥有SPARC处理器。惠普有自己的PA-RISC芯片。这就是你从竞争对手中脱颖而出的原因。他们一个接一个地放弃了芯片，转而采用英特尔的i86CISC架构。苹果是2007年最后一家这样做的公司。他们这样做的原因都是一样的：尽管RISC应该更快、更高效，但英特尔有足够的力量从被认为是劣质的架构中挖掘出性能。英特尔拥有的最大优势是巨大的销售额和利润。惠普只能卖出几千块PA-RISC芯片。太阳可能有几万个。PowerPC被IBM抛弃了，苹果是主要客户，可能会有100万左右。英特尔的销售额高达数亿美元，可以将这笔钱直接投入研发，以制造更快、更强大的芯片。没有人能与之竞争。苹果和亚马逊拥有数十亿部iPhone和数十亿台AWS服务器，它们有足够的规模将所需的巨额资金投入到定制芯片的研发中。因此，在20年来定制RISC让位于英特尔的i86 CISC芯片之后，我们现在再次看到定制硅和RISC的增长。我想知道微内核是否会卷土重来。\n当我刚开始从事计算机行业时，大多数大公司都是自己制造硅的，而且大部分都是基于RISC的。IBM有自己版本的PowerPC芯片。当然是太阳。Sun拥有SPARC处理器。惠普有自己的PA-RISC芯片。这就是你从竞争对手中脱颖而出的原因。他们一个接一个地放弃了芯片，转而采用英特尔的i86CISC架构。苹果是2007年最后一家这样做的公司。他们这样做的原因都是一样的：尽管RISC应该更快、更高效，但英特尔有足够的力量从被认为是劣质的架构中挖掘出性能。英特尔拥有的最大优势是巨大的销售额和利润。惠普只能卖出几千块PA-RISC芯片。太阳可能有几万个。PowerPC被IBM抛弃了，苹果是主要客户，可能会有100万左右。英特尔的销售额高达数亿美元，可以将这笔钱直接投入研发，以制造更快、更强大的芯片。没有人能与之竞争。苹果和亚马逊拥有数十亿部iPhone和数十亿台AWS服务器，它们有足够的规模将所需的巨额资金投入到定制芯片的研发中。因此，在20年来定制RISC让位于英特尔的i86 CISC芯片之后，我们现在再次看到定制硅和RISC的增长。我想知道微内核是否会卷土重来。\n你忘了全能的DEC Alpha！但是你的故事有点不正确。这些CPU确实比英特尔销售的任何产品都要快。但他们的死亡还有其他原因：*IBM电力线从未消失。*斯帕克死于甲骨文之手。*惠普被英特尔愚弄了，当PA RISC加入到安腾的研发中时，惠普杀死了他们。*当DEC被康柏(Compaq)收购时，阿尔法去世了，并陷入了与惠普相同的谎言。*不记得MIPS和他们的CPU系列发生了什么，就像在所有SGI上使用的那样。后来安腾被证明是垃圾，在他们创建AMD64扩展时被AMD杀死了。", "note_en": "On Thursday, an Amazon AWS blogpost  announced that the company has moved most of the cloud processing for its Alexa personal assistant off of Nvidia GPUs and onto its own  Inferentia Application Specific Integrated Circuit (ASIC). Amazon dev Sebastien Stormacq describes the Inferentia&#39;s hardware design as follows:\n AWS Inferentia is a custom chip, built by AWS, to accelerate machine learning inference workloads and optimize their cost. Each  AWS Inferentia chip contains four  NeuronCores. Each NeuronCore implements a high-performance  systolic array matrix multiply engine, which massively speeds up typical deep learning operations such as convolution and transformers. NeuronCores are also equipped with a large on-chip cache, which helps cut down on external memory accesses, dramatically reducing latency and increasing throughput.\n When an Amazon customer—usually someone who owns an Echo or Echo dot—makes use of the Alexa personal assistant, very little of the processing is done on the device itself. The workload for a typical Alexa request looks something like this:\n A human speaks to an Amazon Echo, saying: &#34;Alexa, what&#39;s the special ingredient in Earl Grey tea?&#34;\n   Within the Amazon data center, the voice stream is converted to phonemes (Inference AI workload)\n    Intent is routed to an appropriate fulfillment service, which returns a response as a JSON document\n   Natural speech audio is streamed back to the Echo device for playback—&#34;It&#39;s bergamot orange oil.&#34;\n As you can see, almost all of the actual work done in fulfilling an Alexa request happens in the cloud—not in an Echo or Echo Dot device itself. And the vast majority of that cloud work is performed not by traditional if-then logic but inference—which is the answer-providing side of  neural network processing.\n According to Stormacq, shifting this inference workload from Nvidia GPU hardware to Amazon&#39;s own Inferentia chip resulted in 30-percent lower cost and 25-percent improvement in end-to-end latency on Alexa&#39;s text-to-speech workloads. Amazon isn&#39;t the only company using the Inferentia processor—the chip powers Amazon AWS Inf1 instances, which are available to the general public and compete with Amazon&#39;s GPU-powered G4 instances.\n Amazon&#39;s AWS Neuron software development kit allows machine-learning developers to use Inferentia as a target for popular frameworks, including TensorFlow, PyTorch, and MXNet.\n  When I first started in computers, most of the big companies made their own silicon and much of it was RISC based. IBM had its own version of the PowerPC chip. Sun, of course. Sun had the SPARC processor. HP had their own PA-RISC chips. It was what distinguished you from your competitors.  One by one, they all dropped their chips in favor of Intel&#39;s i86 CISC architecture. Apple was the last company to do so in 2007.  And they all did so for the same reason: Although RISC was supposed to be faster and more efficient, Intel had the muscle to wring performance out of what was supposed to be an inferior architecture.  The big advantage Intel had was massive sales and profits. HP could only sell a few thousand PA-RISC chips. Sun maybe tens of thousands. The PowerPC was abandoned by IBM, and Apple was the main customer will maybe a million or so. Intel had hundreds of millions in sales and could plow that money right back into research and development to make even faster and more powerful chips. No one could compete.  With billions of iPhones and billions of AWS servers, Apple and Amazon have the scale they need to put the massive funds needed into the research and development for their custom chips. So after 20 years of custom RISC giving way to Intel&#39;s i86 CISC chips, we now see the rise once again for custom silicon and RISC.   I wonder if Microkernels are going to make a comeback.\n  When I first started in computers, most of the big companies made their own silicon and much of it was RISC based. IBM had its own version of the PowerPC chip. Sun, of course. Sun had the SPARC processor. HP had their own PA-RISC chips. It was what distinguished you from your competitors.  One by one, they all dropped their chips in favor of Intel&#39;s i86 CISC architecture. Apple was the last company to do so in 2007.  And they all did so for the same reason: Although RISC was supposed to be faster and more efficient, Intel had the muscle to wring performance out of what was supposed to be an inferior architecture.  The big advantage Intel had was massive sales and profits. HP could only sell a few thousand PA-RISC chips. Sun maybe tens of thousands. The PowerPC was abandoned by IBM, and Apple was the main customer will maybe a million or so. Intel had hundreds of millions in sales and could plow that money right back into research and development to make even faster and more powerful chips. No one could compete.  With billions of iPhones and billions of AWS servers, Apple and Amazon have the scale they need to put the massive funds needed into the research and development for their custom chips. So after 20 years of custom RISC giving way to Intel&#39;s i86 CISC chips, we now see the rise once again for custom silicon and RISC.   I wonder if Microkernels are going to make a comeback.\n  You forgot the all mighty DEC Alpha!  But your story is a bit incorrect.  Those CPU were indeed faster than anything sold by Intel.  But they died for other reasons:  * IBM POWER line never went away.  * Sparc died at the hands of Oracle.  * HP was &#34;fooled&#34; by Intel and killed the PA RISC when they joined to work on Itanium.  * Alpha died when DEC was bought by Compaq and fell for the same lie as HP.  * Dont remember what happened to MIPS and their line of CPU&#39;s, like what was used on all SGI&#39;s.   And then Itanium proved to be crap and was killed by AMD when they created the AMD64 extensions.", "posttime": "2020-11-14 08:28:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,亚马逊,amazon,转向,begins", "title": "亚马逊开始将Alexa的云人工智能转向自己的硅片", "title_en": "Amazon Begins Shifting Alexa's Cloud AI To Its Own Silicon", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/11/amazon-begins-shifting-alexas-cloud-ai-to-its-own-silicon/", "via": "", "real_tags": ["人工智能", "亚马逊", "amazon", "转向", "begins"]}, {"category": "", "categoryclass": "", "imagename": "444fee0a5106d6947d7c8471a93516ab.jpg", "infoid": 1034958, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "YouTube表示，由于全球疫情，该公司今年不会制作年度年终回放视频。\n自2010年以来，这家视频分享平台每年都会制作一场回顾展，由知名YouTube明星引用重要的病毒式时刻。\n但该公司在一份声明中表示：2020年有所不同。而且它也不觉得继续下去是正确的，就好像它不是。\nYouTube的倒带视频经常让粉丝产生分歧，2018年的这段视频成为YouTube上最不受欢迎的视频。\n2019年，该公司改变了这段视频的格式，制作了一份年度最受欢迎视频剪辑，通过点击点赞按钮来衡量。\n报道YouTube和其他社交平台的记者克里斯·斯托克尔-沃克(Chris Stokel-Walker)表示，倒带被取消令人遗憾，因为YouTube已成为疫情期间人们娱乐和支持的主要来源。\n但他补充说：今年YouTube上发布的新内容并不多。它已经过时，被TikTok等更灵活的应用取代，成为潮流的发源地。\n自2010年推出以来，ReWind一直都有类似的角色阵容，但与其他平台相比，到2020年，他们可能会展示的潜在人物名单看起来更加陈旧。", "note_en": "YouTube says it will not produce its annual end-of-year &#34;Rewind&#34; video this year, due to the global pandemic.\n The video-sharing platform has produced an annual retrospective since 2010, featuring well-known YouTube stars referencing big viral moments.\n But, in a statement it said: &#34;2020 has been different. And it doesn&#39;t feel right to carry on as if it weren&#39;t.&#34;\n YouTube&#39;s Rewind videos have often divided fans, and 2018&#39;s effort became the most-disliked video on YouTube.\n In 2019, the business changed the format of the video and produced a compilation of the year&#39;s &#34;most-liked&#34; clips, gauged by clicks of the &#34;like&#34; button.\n  Journalist Chris Stokel-Walker, who writes about YouTube and other social platforms, said it was a shame that Rewind had been cancelled because YouTube had become &#34;a major source of entertainment and support for people during the pandemic&#34;.\n But he added: &#34;There&#39;s just not that much new that&#39;s come out of YouTube this year. It&#39;s been outmoded and overtaken as the place that trends begin, by more nimble apps like TikTok.\n &#34;Rewind has always featured a similar cast of characters since it started in 2010, but the potential list of people they could feature would look even more stale in 2020 in comparison to other platforms.&#34;", "posttime": "2020-11-14 08:28:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,疫情,cancels", "title": "YouTube在疫情肆虐之际取消倒带视频", "title_en": "YouTube Cancels Rewind Video Amid Pandemic", "transed": 1, "url": "https://www.bbc.com/news/technology-54931875", "via": "", "real_tags": ["youtube", "疫情", "cancels"]}, {"category": "", "categoryclass": "", "imagename": "10b0c5a7897ca3b06aa0ee7690228450.jpg", "infoid": 1034957, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新版，晚上7点15分：据CBC报道，引发警方反应的911报警电话是一场恶作剧。蒙特利尔警方只是证实，警方的行动已经结束，没有发现任何威胁，也没有人员受伤的报告。SPVM补充说，随后将进行调查，以揭示这一重要警力部署背后的原因。\n周五，育碧蒙特利尔游戏工作室的紧张局势结束，工作人员在警方的正式护送下离开了大楼。有一段时间，数十名工作人员在屋顶上封锁了两个多小时。\n据当地(法语)媒体LCN报道，故事始于一群嫌疑人据报道在育碧蒙特利尔劫持了数十人作为人质。据报道，这一情况始于美国东部时间下午1点30分左右。\n蒙特利尔警方证实，在育碧蒙特利尔所在的十字路口，警方正在进行一次行动。该部门在推特上建议人们避开这一区域。&#34；SPVM目前正在验证信息，后续将提供更多详细信息。&#34；\n蒙特利尔市长瓦莱里·普兰特(Valérie Plante)证实，她的办公室正在与警方协调，并监控事态发展。她响应了警方要求所有人避开该地区的请求。\n据加拿大广播电台(法语报道)报道，在接到911报警电话报告附近一座商业建筑发生抢劫案后，警方被派往现场。\n来自LCN直升机的直播画面显示，一群人聚集在大楼的屋顶平台上，后面是一个临时路障，似乎是由靠在出入口门上的折叠桌建造的。开发商埃里克·波普在推特上证实，屋顶上的人确实是育碧的员工，他说，这太疯狂了。这是我在屋顶上的团队。\n大约在美国东部时间下午3：30，工作人员被护送离开大楼较低的楼层，而其他工作人员仍被封锁在大楼屋顶，当地警方完成了对大楼的正式搜查。大楼屋顶上的员工最终被护送出去，尽管是在被看到举手并与明显的特警队官员商量之后。截至记者发稿时，尚不清楚这起事件是由该公司蒙特利尔办公室内或附近的人身入侵引发的，还是一切都是从虚假威胁开始的。在周五晚些时候的更新中，SPVM表示还没有发现任何威胁。\n当被问及这些报道时，育碧的一名代表向Ars Technica提供了以下声明：我们了解情况，并正在与地方当局合作。", "note_en": "Update, 7:15pm: The 911 call that set the police response in motion  was a hoax, the CBC reports. Montreal police  confirmed only that the police operation is over, with no threat detected and no injuries reported. &#34;An investigation will follow to shed light on the call behind this important police force deployment,&#34; the SPVM added.\n  A tense situation at the Ubisoft Montreal game studio ended on Friday with staffers being formally escorted out of the building by police. At one point, dozens of staffers had been barricading themselves on the roof for over two hours.\n The story began with a group of suspects reportedly holding tens of people hostage at Ubisoft Montreal, according to local (French-language)  media outlet LCN. The situation reportedly began around 1:30pm Eastern Time.\n Montreal police  confirmed that there was an &#34;ongoing police operation&#34; at the intersection where Ubisoft Montreal sits. &#34;We ask people to avoid the area,&#34; the department advised on Twitter. &#34;The SPVM is currently validating information and more details will follow.&#34;\n    Montreal mayor Valérie Plante  confirmed that her office is coordinating with the police and monitoring the situation. She echoed the police&#39;s request for everyone to avoid the area.\n According to  Radio-Canada (story in French), police were dispatched to the scene following a 911 call reporting a robbery in a nearby commercial building.\n Live-streamed footage from an LCN helicopter showed a group of people together on the roof deck of the building behind a makeshift barricade seemingly constructed of folding tables leaning against the access door. Developer Eric Pope  confirmed in a Tweet that the individuals on the roof were indeed Ubisoft employees, saying, &#34;This is insane. This is my team on the roof.&#34;\n Staffers were escorted from the building&#39;s lower floors at roughly 3:30pm Eastern Time, while other staffers remained barricaded on the building&#39;s roof as local police completed a formal sweep of the building. The employees on the building&#39;s roof were eventually escorted out, albeit only after being seen holding up their hands and conferring with apparent SWAT officials. It is still unclear as of press time whether the incident was prompted by a physical intrusion in or near the studio&#39;s Montreal offices, or whether everything began with a false threat.  In a later update on Friday, SPVM indicated that  &#34;no threat has been identified.&#34;\n When asked about the reports, an Ubisoft representative offered the following statement to Ars Technica: &#34;We are aware of the situation and working with local authorities.&#34;", "posttime": "2020-11-14 08:28:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "育碧,设置,montreal,警方", "title": "育碧蒙特利尔员工在可能的人质情况下在屋顶设置路障[更新版]", "title_en": "Ubisoft Montreal Staffers Barricade on Roof Amid Possible Hostage Situation [Updated]", "transed": 1, "url": "https://arstechnica.com/gaming/2020/11/ubisoft-montreal-staffers-barricade-on-roof-amid-possible-hostage-situation/", "via": "", "real_tags": ["育碧", "设置", "montreal", "警方"]}, {"category": "", "categoryclass": "", "imagename": "87932a5879cd5338db400221090fdfa6.jpg", "infoid": 1034956, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "强大、灵活、复杂：C++的起源可以追溯到40年前，但它仍然是今天使用最广泛的编程语言之一。TechRepublic采访了C++的创建者Bjarne Stroustrup，找出了原因。\nC++的起源可以追溯到1979年，当时编程语言Bjarne Stroustrup的创建者Bjarne Stroustrup第一次开始开发当时被称为C语言的类。该语言最初是作为对C编程语言的改进而设计的，C编程语言添加了基于面向对象编程的功能。\n斯特罗斯特鲁普在接受TechRepublic采访时表示，C++的成功显然令人意外。我认为C++的成功得益于其最初的设计目标--高效使用硬件，外加强大的抽象机制--以及基于实际使用反馈的谨慎演变。如今，C++语言是最受开发人员欢迎的语言之一，并支撑着世界各地的系统和服务。\n斯特劳斯特鲁普解释说：我想打造一个多计算机系统，它的通信系统既可以是共享内存，也可以是网络。\n我的重点是软件。我需要编写低级的、接近硬件的代码，例如内存管理器、进程调度程序和设备驱动程序，以分离软件组件，这样它们就可以运行在以明确定义的方式通信的不同计算机上。\n当时的任何语言都不能胜任这项任务，所以斯特劳斯特鲁普致力于建立一些能够胜任这项任务的东西。他说，C++类结合了C++接近硬件的能力和Simula类在抽象和代码组织方面的高效变体。\n从很早的时候起，斯特劳斯特鲁普就意识到他不能独断专行地控制语言。虽然C++的早期工作只涉及他和贝尔实验室的几个同事，但当标准化语言的努力开始时，这一工作激增到几十个。\n如今，C++标准委员会大约有400名成员，此外还有更广泛的用户群体，他们关注并试图影响语言的发展方向。\n那么，在如此热情的情况下，如何保持一门编程语言的连贯性呢？斯特罗斯特鲁普说，这既是一个机遇，也是一个巨大的问题。\n最困难的部分是决定什么是重要的，并保持连贯性。一旦你知道你想要什么，最终你会找到一个很好的技术方法来实现它。\n1998年是C++正式标准化并成为可靠的主力的一年。在这一点上，C++是世界上最常用的编程语言之一，这一地位一直保持到今天。\n然而，斯特鲁斯特鲁普说，正是13年后C++11的出现为这门语言的未来发展奠定了基础。他说，C++11让C++感觉像是一门新语言。\n对并发性的类型安全支持是必不可少的。C++11提供了一个由相互支持的特性组成的密集网络，例如用于编译时计算的[常量表达式]函数、lambdas、自动类型推断和各种模板。&#34；\n虽然C++11引入了几个新的特性和功能，使这种语言更简单、更快速、更有表现力，但它仍然保持着难以掌握的名声--它的创建者很容易证明这一点。\n斯特罗斯特鲁普说，C++确实很复杂，要学会很好地使用它是需要付出努力的。不幸的是，人们不仅仅想要简单，他们想要的是一些不可能实现的东西：一种更简单的语言，有更多的功能，并且不会破坏他们现有的代码。\nStroustrup对此的答案是增加一些功能，让简单的事情变得容易做--例如，通过泛化或直接支持常见用例--同时保持兼容性和稳定性。这就是他所说的“三难困境”。\n对于像C++或任何主要编程语言这样大的东西来说，这说起来容易做起来难。Stroustrup解释说，最大的挑战之一是就决定采用和省略哪些新功能达成共识，这本身就需要大量的努力、讨论、时间和耐心。\n即便如此，也不是所有的好功能都能被带上船。他解释说，你必须试着只添加真正对人有帮助的东西，然后只添加几个这样的东西--因为如果我们接受了每一个能帮助别人的功能，语言就会被它自己的重量压垮。\nStroustrup指的是17世纪一艘宏伟的瑞典战舰瓦萨号(Vasa)，由于设计拙劣，它在首航中在斯德哥尔摩港口沉没。\n在国王(最高管理层)的坚持下，不顾技术人员更好的判断，它被高高地堆起了美丽的雕像和大炮。船顶沉甸甸的，被一阵风吹翻了。\n我反复谈论和撰写关于VASA的文章，以告诫那些热衷于通过添加功能来改进C++的人们：记住Vasa！到目前为止，C++还没有失败过。\n这么多年后让C++继续运行的秘诀是什么？你从小事做起，阐明基本原则，阐明长期理想，并根据实际使用的反馈进行发展。\n事实上，在C++首次出现35年后，它仍然很强大。今天的C++比早期的C++强大得多，表现力也更强。然而，即使到了今天，最初的设计仍然可见。\n斯特罗斯特鲁普说，早些年--40年前--有一些简单的项目至今仍在运行。\n稳定性是用于必须工作数十年的系统的语言的一个重要特征。事实上，许多早期的想法只有在C++20中才有。我从一开始就知道我不能构建理想的语言，所以我必须以循序渐进的发展为目标--进化。事实上，我并不相信完美语言的概念--完美的语言是什么？为谁？&#34；\n他补充说：进化对于应对不断变化的世界的挑战和吸收新思想是必要的。\n截至2020年9月，C++是全球第四大最受欢迎的编程语言，仅次于C、Java和Python，而且--根据最新的TIOBE指数--也是增长最快的。C++是一种通用编程语言，因其强大和灵活而受到开发人员的青睐，这使其成为操作系统、网页浏览器、搜索引擎(包括谷歌)、游戏、商业应用程序等的理想选择。\nStroustrup总结道：如果你有一个需要高效使用硬件和处理巨大复杂性的问题，那么C++是一个明显的选择。如果你没有这两种需求，低级的高效语言或者高级的浪费语言都可以。\n然而，尽管C++广受欢迎，但Stroustrup指出，很难准确指出C++在哪里使用，以及为什么使用。\n在任何大型系统中，您通常会发现C++位于较低级别和性能关键的部分。系统的这些部分通常是终端用户看不到的，甚至系统其他部分的开发人员也看不到，所以我有时把C++称为一切事物的无形基础。\n他还强调了开发人员调查在评估给定编程语言的受欢迎程度方面的相对不可靠性：计算程序员人数既难又简单。网络调查通常只衡量噪音，也就是说，人们谈论的是什么，而不是正在使用的是什么。\n如今，斯特罗斯特鲁普是摩根士丹利(Morgan Stanley)的技术研究员。他在国际标准化组织(ISO)的C++标准和C++核心准则方面的工作被认为是他在这家金融巨头的工作的一部分，他仍然非常参与C++的开发。\n最值得注意的是，Stroustrup是方向小组的一部分，该小组提出并讨论关于编程语言未来的建议。他还关注进化组，并参与有关新语言特性的讨论。\n然而，当涉及到C++的日常运行时，Stroustrup很乐意扮演更重要的角色。我关注行政活动，但在那里尽量少做些事情。我不是一个伟大的管理者，他承认。\n在大流行之前，Stroustrup会跑很多地方去传授知识，并通过他的书籍、文章和采访向全世界解释C++-尽管和世界其他地方一样，2020年暂时结束了这种情况。\n斯特罗斯特鲁普说：对于我的工作，我非常依赖于与人们交谈，以了解他们的问题，倾听我的想法对他们有何帮助。\n在这个大流行的时刻，我被剥夺了急需的反馈。虚拟谈话和访谈是不一样的，在讨论设计和想法时，Zoom会议的活力不如真正的面对面会议。\n新冠肺炎的流行也阻碍了C++20和C++23语言的下两个迭代的进展，尽管Stroustrup确认几乎所有的C++20都将在2020年发布。\n除此之外，还有Unicode、数字、游戏开发和低延迟、工具、人工智能等方面的工作，他说。\n当一个特性(语言和库)准备好时，我们会发布它，并且我们每三年发布一次修订后的标准。C++14、C++17和C++20按时发货。值得注意的是，标准工作和主要实现者非常同步。\n从最热门的编程语言到薪水最高的工作，获取你需要知道的开发者新闻和小贴士。每周。\n今天报名", "note_en": "Powerful, flexible, complex: The origins of C++ date back 40 years, yet it remains one of the most widely used programming languages today. TechRepublic spoke to C++ creator, Bjarne Stroustrup, to find out why.\n  C++&#39;s origins date back to 1979, when Bjarne Stroustrup, the programming language&#39;s creator, first began work on the language that was then known as &#34;C with Classes&#34;. The language was initially designed as an improvement on the C programming language that added features based on object-oriented programming.\n    &#34;C++&#39;s success was obviously a surprise,&#34; Stroustrup tells TechRepublic. &#34;I see C++&#39;s success as a function of its original design aims – efficient use of hardware, plus powerful abstraction mechanisms – and its careful evolution based on feedback from real-world use.&#34; Now the language is the one of the most popular with developers and underpins systems and services around the world.\n  &#34;I wanted to build a multi-computer system with a communication system that could be either shared-memory or a network,&#34; Stroustrup explains.\n &#34;My focus was on the software. I needed to write low-level, close-to-hardware code, such as memory managers, process schedulers, and device drivers to separate software components, so that they could be running on separate computers communicating in well-defined ways.&#34;\n   No language of the time was up to the task, so Stroustrup committed himself to building something that was. &#34;C with Classes combined C&#39;s ability to work close to the hardware with an efficient variant of Simula&#39;s classes for abstraction and code organization,&#34; he says.\n From fairly early on, Stroustrup realized he didn&#39;t have dictatorial control of the language. Whereas early work on C++ involved just him and a handful of colleagues at Bell Labs, this ballooned to several dozen when efforts to standardize the language began.\n Today, there are around 400 members in C++&#39;s standards committee, in addition to a wider community of users who follow and try to influence the language&#39;s direction.\n So how does one keep a programming language coherent given so much enthusiasm? &#34;That&#39;s an opportunity and a huge problem,&#34; says Stroustrup.\n  &#34;The hardest part is to decide what&#39;s important and maintain a coherency. Once you know what you want, eventually, you find a good technical way of doing it.&#34;\n  1998 marked the year C++ was formally standardized and became a solid workhorse. By this point, C++ was one of the most commonly used programming languages in the world, a position it retains to this day.\n Yet it was the arrival of C++11 thirteen years later that laid the foundations for the language&#39;s future evolution, says Stroustrup. &#34;C++11 made C++ feel like a new language,&#34; he says.\n &#34;The type-safe support for concurrency was essential. C++11 supplied a dense web of mutually supporting features such as [constant expression] functions for compile-time computation, lambdas, automatic type deduction, and variadic templates.&#34;\n While C++11 introduced several new features and capabilities that made the language simpler, faster and more expressive, the language maintains its reputation for being difficult to master – a fact its creator readily attests to.\n &#34;C++ is indeed complex, and it takes effort to learn to use it well,&#34; says Stroustrup. &#34;Unfortunately, people don&#39;t just want simplicity, they what something impossible: a simpler language, with more features, and no breakage of their existing code.&#34;\n Stroustrup&#39;s answer to this &#34;trilemma&#34;, as he calls it, is adding features that &#34;make simple things simple to do&#34; – for example, though generalization or direct support for common use cases – while also maintaining both compatibility and stability.\n That&#39;s easier said than done with a beast as large as C++, or any major programming language for that matter. One of the biggest challenges is reaching a consensus on deciding which new features to adopt and omit, Stroustrup explains, which in itself takes a great deal of hard work, discussion, time and patience.\n  Even then, not all the good features can be taken onboard. &#34;You must try to add only what really helps people and then only a few such things – because if we accepted every feature that would help someone, the language would sink under its own weight,&#34; he explains.\n Stroustrup refers to  the Vasa, a grand 17th century Swedish battleship that sank in Stockholm harbor on its maiden voyage because of its poor design.\n &#34;At the insistence of the King – the highest management – and against the better judgement of the technical people, it had been piled high with beautiful statues and great guns. Top heavy, it was overturned by a gust of wind.\n &#34;I repeatedly talked and wrote about the Vasa as a caution to people enthusiastically wanting to improve C++ by adding features: remember the Vasa! So far, C++ hasn&#39;t tumbled over.&#34;\n His secret to keeping C++ afloat after all these years? &#34;You start small, articulate fundamental principles, articulate long-term ideals, and develop based on feedback from real-world use.&#34;\n Indeed, C++ is still going strong more than 35 years after it first appeared on the scene. Today&#39;s C++ is far more powerful and expressive than the early C++. However, the original design remains visible, even to this day.\n &#34;There are simple programs from the early years – 40 years ago – that would still run today,&#34; Stroustrup says.\n &#34;Stability is an important feature for a language used for systems that have to work for decades. In fact, many of the early ideas became available only in C++20. I knew from the start that I couldn&#39;t build the ideal language, so I had to aim for gradual development – evolution. In fact, I did not believe in the idea of a perfect language – perfect for what? For whom?&#34;\n He adds: &#34;Evolution is necessary to meet the challenges of a changing world and to incorporate new ideas.&#34;\n  As of September 2020, C++ is the fourth most popular programming language globally behind C, Java and  Python, and – according to the latest TIOBE index – is also  the fastest growing. C++ is a general-purpose programming language favored by developers for its power and flexibility, which makes it ideal for operating systems, web browsers, search engines (including Google&#39;s), games, businesses applications and more.\n Stroustrup summarizes: &#34;If you have a problem that requires efficient use of hardware and also to handle significant complexity, C++ is an obvious candidate. If you don&#39;t have both needs, either a low-level efficient language or a high-level wasteful language will do.&#34;\n  Yet even with its widespread popularity, Stroustrup notes that it is difficult to pinpoint exactly where C++ is used, and for what.\n  &#34;In any large system, you typically find C++ in the lower-level and performance-critical parts. Such parts of a system are often not seen by end-users or even by developers of other parts of the system, so I sometimes refer to C++ as an invisible foundation of everything.&#34;\n He also highlights the relative unreliability of developer surveys in estimating the popularity of a given programming language: &#34;Counting programmers is hard and simple. Web surveys typically just measure &#39;noise&#39;; that is, what is being talked about as opposed to what is being used.&#34;\n  Today, Stroustrup is a Technical Fellow at Morgan Stanley. His work with the International Organization for Standardization (ISO) for the C++ standard and on the C++ Core Guidelines are considered part of his role with the finance giant, and he remains very much involved in the development of C++.\n Most notably, Stroustrup forms part of the direction group, which presents and discusses recommendation about the future of the programming language. He also follows the evolution group, and takes part in discussions about new language features.\n When it comes to the day-to-day running of C++, however, Stroustrup is happy to take more of a backseat role. &#34;I follow administrative activities but try to do as little as possible there. I am not a great administrator,&#34; he admits.\n Before the pandemic, Stroustrup would travel a lot to teach, and to explain C++ to the world at large through his books, articles, and interviews – though much like the rest of the world, 2020 has put a temporary end to this.\n  &#34;For my work, I depend critically on talking with people to learn about their problems and hear how my ideas might help them,&#34; Stroustrup says.\n &#34;In this time of the pandemic, I am deprived of much-needed feedback. Virtual talks and interviews are not the same, and the dynamic of Zoom meetings are inferior to real face-to-face meetings when it comes to discussing design and ideas.&#34;\n The COVID-19 pandemic has also hindered progress with the next two iterations of the language, C++20 and C++23, though Stroustrup affirms that &#34;almost all&#34; of  C++20 will ship in 2020.\n &#34;Beyond that, there is work on Unicode, numerics, game development and low latency, tooling, AI, and much more,&#34; he says.\n &#34;We ship a feature (language and library) when it is ready, and we issue a revised standard every three years. C++14, C++17, and C++20 shipped on time. It is worth noting that the standards effort and the major implementors are very much in sync.\n  From the hottest programming languages to the jobs with the highest salaries, get the developer news and tips you need to know. Weekly\n        Sign up today", "posttime": "2020-11-14 08:27:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "programming,编程,c++,编程语言", "title": "C++编程语言是如何成为一切事物的无形基础的，接下来会发生什么", "title_en": "How C++ Programming Language Became the Invisible Foundation For Everything, and What's Next", "transed": 1, "url": "https://www.techrepublic.com/article/c-programming-language-how-it-became-the-invisible-foundation-for-everything-and-whats-next/", "via": "", "real_tags": ["编程", "c++", "编程语言"]}, {"category": "", "categoryclass": "", "imagename": "252311d30dff2a0e560adc30245e6686.jpg", "infoid": 1034955, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软鼓吹Xbox Series X和S的发布是其有史以来最大的一次Xbox发布，但没有提供任何具体的销售数字。\nXbox老板菲尔·斯宾塞今天在推特上宣布了这一消息，他指出，Xbox游戏机在更多的国家售出，比以往任何时候都多，而且还有更多的Xbox游戏机即将售出。\nXbox Series X/S在很多地方都销售一空，这使得它--就像许多游戏机发布一样--仅仅是微软可以在发布当天向零售商注入多少游戏机盒子来销售的问题。\n这一次提到更多国家也很重要。Xbox Series S/X在同一天在37个市场上市，相比之下，Xbox One只有13个。\n不过，正如视频游戏分析师丹尼尔·艾哈迈德(Daniel Ahmad)所指出的那样，目前Xbox有史以来最大的总销量意味着，它高于微软(Microsoft)在Xbox One发布时管理的100万台--在一场流行病肆虐之际，这可不是一件容易的壮举。\n此内容托管在外部平台上，只有当您接受目标Cookie时，该平台才会显示此内容。请启用Cookie以查看。\n微软已经多年没有公布游戏机数量了--它表示，这是因为它自己衡量成功的标准与个人电脑、游戏机、移动设备和云端的用户挂钩，而不是因为PlayStation领先。\n也别指望未来任何时候都会有销售数据--即使Xbox在这一代超越了PlayStation。\n我可以向你保证，我不会这么做的，斯宾塞昨天告诉《卫报》(The Guardian)。去年，我们有谷歌(Google)和亚马逊(Amazon)，现在又有Facebook宣布它们将进入我们的游戏领域。我不会以Xbox Series X的销量来与他们的数字竞争。(谷歌)永远不会透露他们卖出了多少Chromecast Pro。他们将谈论他们有多少球员。\n我认为，那些想要让我们与索尼竞争的人，基于谁卖出了最多的游戏机，失去了对当今游戏的理解。今天，地球上有30亿人在玩游戏，但可能只有2亿家庭拥有视频游戏机。在某种程度上，游戏机空间在整个游戏蛋糕中所占的比例正变得越来越小。", "note_en": "Microsoft has trumpeted the release of Xbox Series X and S as its biggest Xbox launch ever, though not provided any specific sales figures.\n Xbox boss Phil Spencer broke the news on  Twitter today, noting that &#34;more Xbox consoles had been sold, in more countries, than ever before&#34; and that many more were on the way.\n Xbox Series X/S are sold out in many places, making this - like many console launches - simply a matter of how many console boxes Microsoft can inject into retailers to sell on launch day.\n The mention of more countries this time around is also important. Xbox Series S/X arrived on the same day in 37 markets, compared to just 13 for the Xbox One.\n Still, as video games analyst  Daniel Ahmad points out, any total now the largest ever for Xbox means it was higher than the 1m units Microsoft managed at the Xbox One&#39;s launch - which is no mean feat in the middle of a pandemic.\n  This content is hosted on an external platform, which will only display it if you accept targeting cookies. Please enable cookies to view.\n Microsoft has not published console numbers for years - it says because its own metrics for success are tied to users across PC, console, mobile and the cloud, and not because PlayStation is ahead.\n Don&#39;t expect sales numbers any time in the future either - even if Xbox overtakes PlayStation this generation.\n &#34;I can promise you that I won&#39;t do that,&#34; Spencer told  The Guardian just yesterday. &#34;In the last year we&#39;ve had Google and Amazon and now Facebook announcing they&#39;re coming into our gaming space. I&#39;m not gonna go compete with their numbers based on how many Xbox Series X I&#39;ve sold. [Google] is never gonna talk about how many Chromecast Pros they sold. They&#39;re gonna talk about how many players they have.\n &#34;I think the people who want to pit us against Sony based on who sold the most consoles lose the context of what gaming is about today. There are 3 billion people who play games on the planet today, but maybe [only] 200 million households that have a video game console. In a way, the console space is becoming a smaller and smaller percentage of the overall gaming pie.&#34;", "posttime": "2020-11-14 08:27:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,xbox", "title": "Xbox Series X/S是Xbox有史以来最大的一次发布", "title_en": "Xbox Series X/S Was the Biggest Xbox Launch Ever", "transed": 1, "url": "https://www.eurogamer.net/articles/2020-11-12-xbox-series-x-s-was-the-biggest-xbox-launch-ever", "via": "", "real_tags": ["发布", "xbox"]}, {"category": "", "categoryclass": "", "imagename": "360813f9a18b65df170c07d3f4e66c24.jpg", "infoid": 1034954, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一些用户抱怨iMessage，甚至Apple Pay等苹果服务不能为他们服务。对于那些想要下载和安装苹果公司针对Mac的名为MacOS Big Sur的重大更新的人来说，他们也遇到了问题。苹果显然已经承认了这个问题，其员工夜以继日地工作，以确保所有服务的及时恢复。\n如果你访问苹果的系统状态页面，看看各种产品都有哪些服务可用，你就能监控到你的设备或Mac电脑无法正常工作的确切原因。其中一个问题恰好出现在MacOS软件更新工具上。考虑到世界各地的Mac用户都想体验MacOS Big Sur今天的一切，现在对苹果来说根本不是一个好时机。\n在撰写本文时，苹果的系统状态页面显示其服务已恢复正常活动。然而，当我们不断更新推特时，我们注意到有相当多的推文谈论同样的问题。除了MacOS软件更新工具，苹果还遇到了Apple Card的问题，用户无法通过网站管理他们的信用卡。Apple Pay也遇到了问题，还有地图流量和地图路线导航。\n值得庆幸的是，对于那些仍在经历问题的人来说，可能会有解决这个问题的方法，尽管它不是来自苹果，这意味着它可能会对你起作用，也可能不会。\n杰夫·汤普森(Jeff Thompson)在推特上的账号是@rapcatsoft，他表示，一个涉及一款名为Little Snitch的付费应用的临时修复程序似乎有助于解决这个问题。汤普森强调了下面要遵循的步骤，但我们也建议我们的读者，如果他们继续遇到问题，请仔细阅读整个帖子。\n如果你现在遇到在Mac上启动应用程序挂起的问题，我用小飞贼解决了这个问题。\n如果你现在遇到在Mac上启动应用程序挂起的问题，我用小飞贼解决了这个问题。\n如果你仍然遇到问题，我们建议等到苹果完全解决了手头的问题。希望情况在一段时间内会正常化。", "note_en": "Several users have complained about Apple services such as iMessage, or even Apple Pay, not working for them. For those wanting to download and install the company’s major update for Macs titled  macOS Big Sur, they’re experiencing problems with that too. Apple has apparently acknowledged the issue, with its employees working around the clock to ensure timely restoration of all services.\n If you visit Apple’s  System Status page to see which services are available for a wide range of products, you’ll be able to monitor why exactly your device or Mac aren’t functioning properly. One of those problems happens to be with the macOS Software Update tool. Considering that Mac owners all around the world wanted to experience what macOS Big Sur was all about today, this isn’t great timing for Apple at all.\n   At the time of writing, Apple’s System Status page shows that its services have resumed normal activity. However, when we kept on refreshing Twitter, we noticed a significant number of Tweets talked about the same issue. In addition to the macOS Software Update tool, Apple was experiencing issues with Apple Card, with owners not managing their credit card via the website. Apple Pay was also experiencing issues, along with Maps Traffic and Maps Routing &amp; Navigation.\n Thankfully, for those who are still experiencing issues, there might be a fix for this, though it’s not from Apple, meaning it may or may not work for you.\n  According to Jeff Thompson, who goes by the Twitter handle @lapcatsoftware, a temporary fix involving a paid app called  Little Snitch appears to help fix the problem. Thompson has highlighted the steps to follow below, though we also recommend our readers to go through the entire thread if they continue running into hiccups.\n If you&#39;re now experiencing hangs launching apps on the Mac, I figured out the problem using Little Snitch.\n If you&#39;re now experiencing hangs launching apps on the Mac, I figured out the problem using Little Snitch.\n  If you’re still experiencing issues, we recommend waiting until Apple has completely resolved the issue at hand. Hopefully, things will normalize in a while.", "posttime": "2020-11-14 07:37:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "slashdot,upgrade", "title": "问Slashdot：你升级到MacOS Big Sur了吗？", "title_en": "Ask Slashdot: Did You Upgrade To macOS Big Sur?", "transed": 1, "url": "https://wccftech.com/apple-macos-big-sur-download-issues-services-problems/", "via": "", "real_tags": ["slashdot", "upgrade"]}, {"category": "", "categoryclass": "", "imagename": "4f0858b1937a558941dcc2f5690832ee.png", "infoid": 1034953, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司正式发布了MacOS的最新版本：MacOS Big Sur(也被称为MacOS 11.0)，只要你有兼容的Mac，现在就可以下载。\nBig Sur是苹果笔记本电脑和台式机软件多年来最大的更新之一，它对界面、图标和菜单栏进行了自上而下的重新设计，新的控制中心用户界面借鉴了iOS，Widget(也借鉴了iOS)，以及各种其他改进(参见此处查看完整列表)。这是一个如此巨大的变化，以至于苹果实际上正在放弃它在Mac上使用了近20年的OS X/OS 10品牌。\n苹果还增加了一些注重隐私的新功能，包括在Safari中更好地跟踪信息，以及在Mac App Store中为你下载的任何应用程序提供新的隐私数据。\n但Big Sur不仅仅是因为它为现有的Mac带来的功能而令人兴奋。苹果最新发布的搭载M1操作系统的MacBook Air、MacBook Pro和Mac迷你电脑将于11月17日发布。苹果公司表示，它专门优化了Big Sur，以便在这些基于ARM的新系统上运行，这将提供英特尔版本所没有的一个主要功能：能够运行iOS和iPad应用程序。\n可能运行MacOS Catalina的设备没有进入Big Sur更新的行列，包括2012年的MacBook Air、2012年年中和2013年初的MacBook Pros、2012和2013年的Mac Mini，以及2012和2013年的iMac。如果你不确定你的Mac是否兼容，你可以按照苹果的指南进行识别。", "note_en": "Apple has  officially released the latest version of macOS: macOS Big Sur (also known as  macOS 11.0), which is available to download now assuming you have a  compatible Mac.\n Big Sur is one of the biggest updates to Apple’s laptop and desktop software in years, featuring a top-to-bottom redesign of the interface, icons, and menu bar, a new control center UI borrowed from iOS, widgets (also borrowed from iOS), and a variety of other improvements (see here for the full list). It’s such a big change that Apple is actually moving on from the OS X / OS 10 branding that it’s been using for Macs for almost 20 years.\n Apple’s also adding some new privacy-focused features, including better tracking information in Safari and new privacy data in the Mac App Store for any apps you download.\n   But Big Sur isn’t just exciting for the features it brings to existing Macs. It’ll also be the operating system that runs on Apple’s newly announced M1-powered MacBook Air, MacBook Pro, and Mac mini computers when they release on November 17th. Apple says that it’s specifically optimized Big Sur to run on those new, ARM-based systems, which will offer a major feature not found on the Intel versions: the ability to run iOS and iPad apps.\n   Devices that could run macOS Catalina that aren’t making the cut for the Big Sur update include the 2012 MacBook Airs, the mid-2012 and early-2013 MacBook Pros, the 2012 and 2013 Mac minis, and 2012 and 2013 iMacs. If you’re not sure whether your Mac is compatible, you can  identify it by following Apple’s guide here.", "posttime": "2020-11-14 07:32:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "下载,big,mac", "title": "MacOS Big Sur现在可以下载", "title_en": "macOS Big Sur is Now Available To Download", "transed": 1, "url": "https://www.theverge.com/2020/11/12/21562585/macos-11-big-sur-apple-mac-download-available-now", "via": "", "real_tags": ["下载", "big", "mac"]}, {"category": "", "categoryclass": "", "imagename": "80cec209a6f73127ced4609498a9c848.jpg", "infoid": 1034952, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "企业风险投资公司康卡斯特风险投资公司(Comcast Ventures)将并入康卡斯特的业务开发部门，并将其战略转变为只专注于战略投资。\n据知情人士透露，合作伙伴本周被告知了这一变化。由于讨论是私下进行的，这些知情人士要求不具名。虽然康卡斯特风险投资公司将继续在康卡斯特首席业务发展官萨姆·施瓦茨的领导下运营，但它将不再投资于一系列广泛的公司，而是只专注于能够支持康卡斯特举措的初创企业。知情人士表示，这一变化，再加上该基金独立于康卡斯特(Comcast)的独立性降低，可能会导致多名合作伙伴叛逃。\n康卡斯特风险投资公司(Comcast Ventures)的一位发言人告诉CNBC，康卡斯特风险投资公司一直是一条有价值的创新渠道，提供了对邻近行业和投资机会的洞察。我们正在将我们的风险投资方法与我们的业务部门更紧密地结合起来，并将康卡斯特风险投资公司及其基金重新定位为康卡斯特有线电视的战略业务开发团队。我们整个公司的业务开发团队将继续投资于新技术和新业务，我们相信这将为康卡斯特和我们投资的公司带来更多战略机会和利益。我们将继续通过投资和战略合作伙伴关系支持我们现有的投资组合公司。\n康卡斯特风险投资公司(Comcast Ventures)的基金主管艾米·班斯(Amy Banse)在9月份宣布退休。在康卡斯特风险投资公司(Comcast Ventures)工作了15年的戴夫·齐尔伯曼(Dave Zilberman)本周表示，他将加盟Norwest Venture Partners。\n当班斯宣布离职时，康卡斯特表示，首席财务官迈克尔·卡瓦纳(Michael Cavanagh)将接管康卡斯特风险投资公司(Comcast Ventures)的领导权。其中一位知情人士表示，在过去两个月里，卡瓦纳和康卡斯特前首席财务官迈克尔·安杰拉基斯(Michael Angelakis)评估了该基金的战略，认为它更适合施瓦茨的业务发展部门。安杰拉基斯现在用康卡斯特提供的资金管理着私人投资公司Atairos。\n施瓦茨是20多年前康卡斯特风险投资公司(Comcast Ventures)的创始合伙人之一。他将决定康卡斯特是收购公司，还是进行种子、风险投资或后期投资，哪个更好。康卡斯特将继续支持现有的康卡斯特风险投资组合。\n知情人士表示，康卡斯特风险投资公司(Comcast Ventures)多年来表现最好的许多投资都是战略性投资，包括本月早些时候被Melody Investment Advisors收购的CTI Towers。随着软银(SoftBank)的愿景基金(Vision Fund)、通用大西洋(General Atlantic)和洞察合伙人(Insight Partners)等更多基金为初创企业筹集数百亿美元资金，争夺收购目标变得越来越困难。根据美国国家风险投资协会(National Venture Capital Association)的数据，过去两年，投资于美国公司的风险资金创下了纪录。\n将康卡斯特风险投资公司(Comcast Ventures)的重点重新放在支持宽带分销和流媒体视频的公司上，可能有助于康卡斯特走在趋势的前列，同时在该公司最了解的投资上更加自律。", "note_en": "Comcast Ventures, the corporate venture capital firm, is folding into  Comcast&#39;s business development division and shifting its strategy to focus only on strategic investments.\n Partners were informed of the change this week, according to people familiar with the matter, who asked not to be named because the discussions were private. While Comcast Ventures will continue to operate under Comcast chief business development officer  Sam Schwartz, it will no longer invest in a broad array of companies, instead focusing only on start-ups that can support Comcast initiatives. That change, combined with the fund&#39;s decreased independence from Comcast, will likely lead to a number of partner defections, the people said.\n  &#34;Comcast Ventures has been a valuable innovation pipeline, providing insight into adjacent industries and investment opportunities&#34; a spokesperson told CNBC. &#34;We are aligning our approach to venture investing more closely with our business units and repositioning Comcast Ventures and its fund under the strategic business development team at Comcast Cable. Our business development teams across the company continue to invest in new technology and businesses, which we believe will yield more strategic opportunities and benefits for Comcast and the companies in which we invest. We will continue to support our existing portfolio companies through investment and strategic partnership.&#34;\n Amy Banse, the head of funds for Comcast Ventures,  announced her retirement in September. Dave Zilberman, a 15-year Comcast Ventures veteran,  said this week he was leaving for Norwest Venture Partners.\n When Banse announced her departure, Comcast said CFO Michael Cavanagh would take over leadership of Comcast Ventures. In the past two months, Cavanagh and former Comcast CFO Michael Angelakis, who now runs the private investment firm Atairos with capital from Comcast, reviewed the fund&#39;s strategy and decided it&#39;s a better fit within Schwartz&#39;s business development unit, one of the people said.\n Schwartz was one of the founding partners of Comcast Ventures more than 20 years ago. He will decide if Comcast is better served acquiring companies or making seed, venture or later-stage investments. Comcast will continue to support the existing Comcast Ventures portfolio.\n Many of Comcast Ventures&#39; best performing investments through the years have been strategic in nature, including CTI Towers, which Melody Investment Advisors  acquired earlier this month, said the people. It has become increasingly difficult to compete for targets as more funds, such as  SoftBank&#39;s Vision Fund, General Atlantic and Insight Partners, raise tens of billions of dollars for start-ups. The last two years have been record setting in terms of  venture dollars invested in U.S. companies, according to The National Venture Capital Association.\n  Refocusing Comcast Ventures on companies that support broadband distribution and streaming video could help Comcast stay ahead of trends while being more disciplined on investments the company understands best.", "posttime": "2020-11-14 07:26:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,战略,strategic", "title": "康卡斯特正在将康卡斯特风险投资公司(Comcast Ventures)合并为企业业务部门，并正在转变战略，只专注于战略投资", "title_en": "Comcast is folding Comcast Ventures into corporate business division and is shifting its strategy to focus only on strategic investments", "transed": 1, "url": "https://www.cnbc.com/2020/11/13/comcast-to-narrow-focus-of-comcast-ventures-leading-to-partner-defections.html", "via": "", "real_tags": ["风险投资", "战略", "strategic"]}, {"category": "", "categoryclass": "", "imagename": "8a96beaea0625ddd0c2dad28dc59cf67.jpg", "infoid": 1034951, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Aurora Innovation是一家初创公司，由自动驾驶汽车行业的三名资深人士创立，他们领导了谷歌、特斯拉和优步的项目。该公司正在就收购优步ATG进行谈判。交易条款仍不得而知，但消息人士称，两家公司自去年10月以来一直在进行谈判，而且谈判进展得很顺利。\n优步发言人拒绝置评，称公司的总体政策是不对此类调查发表评论。Aurora的一位发言人说，该公司对猜测不予置评。\n谈判可能会受挫。但如果成功，他们有可能将极光的员工人数增加两倍，并使优步能够剥离一项代价高昂的长期业务，而这项业务在其短暂的生命周期内一直饱受争议。\n在剥离优步ATG之前，近几个月来发生了一系列剥离或其他交易，这些交易将优步的重点和成本缩小到叫车和送货这两个核心领域。两年前，优步的商业模式可以被描述为“所有上述方式”，押注于从所有形式的交通工具中获得收入，包括叫车、微移动、物流、包裹和食品递送，甚至有朝一日自动驾驶机器人出租车。\n自从优步上市以来，这一战略发生了变化，随着新冠肺炎疫情颠覆了经济，从根本上改变了人们的生活方式，这一战略进一步加速。在过去11个月里，优步出售了共享微移动部门Jump，出售了其不断增长但仍未盈利的物流部门优步货运(Uber Freight)的部分股份，并收购了Postmate。(对PostMates的收购预计将在2020年第四季度完成)。\n优步ATG一直是该公司最后一大笔昂贵的股份。Uber ATG拥有很多长期承诺和高昂的当前成本；Uber去年11月报告称，在截至2020年9月30日的9个月里，ATG和其他技术(包括Uber Elevate)净亏损3.03亿美元。优步在S-1文件中表示，其ATG和其他技术项目的研发费用为4.57亿美元。\n四位业内消息人士告诉TechCrunch，优步今年一直在向包括汽车制造商在内的几家公司收购ATG。消息人士还告诉TechCrunch，Uber ATG可能面临一轮下行，这可能是与Aurora谈判背后的另一个动机。\nAurora成立于2017年，专注于打造全自动驾驶系统，这项基础技术将允许车辆在没有人工驾驶的情况下在高速公路和城市街道上导航。Aurora吸引了Greylock Partners、红杉资本(Sequoia Capital)、亚马逊(Amazon)和T.Rowe Price等知名风险投资公司的关注和投资，部分原因是它的创始人斯特林·安德森(Sterling Anderson)、德鲁·巴格内尔(Drew Bagnell)和克里斯·厄姆森(Chris Urmson)。\n厄姆森曾领导过谷歌的自动驾驶项目，后来该项目剥离成了Alphabet公司的Waymo。安德森最出名的是领导特斯拉Model X和该汽车制造商的自动驾驶计划的开发和推出。巴格内尔是卡内基梅隆大学(Carnegie Mellon)的副教授，帮助启动了优步在自主方面的努力，最终领导了匹兹堡高级技术中心(Advanced Technologies Center)的自主与感知团队。\nAurora已经从一家小型初创公司成长为一家拥有600名员工的公司，业务遍及旧金山湾区、德克萨斯州匹兹堡和蒙大拿州博兹曼(Bozeman)，后者是Aurora在2019年收购的激光雷达公司Blackmore的总部所在地。根据领英(LinkedIn)的记录，奥罗拉目前约有12%的员工曾在优步(Uber)工作。\n尽管有这样的增长，但与优步(Uber)持有多数股权的自动驾驶子公司优步ATG(Uber ATG)相比，极光仍然相形见绌。优步ATG拥有1200多名员工，在匹兹堡、旧金山和多伦多等多个地点开展业务。根据提交给美国证券交易委员会(Securities And Exchange Commission)的文件，优步(Uber)持有优步ATG 86.2%的股份(在完全稀释的基础上)。其投资者合计持有优步ATG 13.8%的股份。\n优步向自动驾驶汽车技术的公开飞跃始于2015年初，当时该公司宣布与卡内基梅隆大学(Carnegie Mellon University)国家机器人中心(National Robotics Center)建立战略合作伙伴关系。这项致力于开发无人驾驶汽车技术的协议导致优步挖走了数十名NREC的研究人员和科学家。一年后，随着内部反病毒开发项目的启动，当时由联合创始人特拉维斯·卡兰尼克(Travis Kalanick)领导的优步收购了一家名为Otto的自动驾驶卡车初创公司。\n这笔收购几乎从一开始就陷入了困境。当年早些时候，谷歌的明星工程师安东尼·莱万多夫斯基(Anthony Levandowski)和另外三名谷歌资深人士：利奥尔·罗恩(Lior Ron)、克莱尔·德劳奈(Claire Delaunay)和唐·伯内特(Don Burnette)共同创立了。不到八个月后，优步收购了奥托。\n收购两个月后，谷歌对莱万多夫斯基和罗恩提出了两项仲裁要求。优步并未参与这两项仲裁。在仲裁进行的同时，Waymo在2017年2月单独对优步提起诉讼，指控其窃取商业机密和侵犯专利。Waymo在这起诉讼中声称，Levandowski窃取了商业机密，然后这些商业机密被优步使用。诉讼经过审判，但在2018年以和解告终。\n根据和解协议，优步同意不将Waymo的机密信息纳入他们的硬件和软件。优步还同意支付一项财务和解协议，其中包括0.34%的优步股权，根据其G-1系列融资720亿美元的估值。当时计算的优步股本约为2.448亿美元。\n在收购奥托的初期，优步估计，到2019年，它可能会有7.5万辆自动驾驶汽车上路，到2022年，它将在13个城市运营无人驾驶出租车服务，这份文件是由TechCrunch公布的，最先报道了这份文件。为了实现这些雄心勃勃的目标，这家叫车公司每月花费2000万美元开发自动驾驶技术。\n优步从未接近达到这些目标，这一任务因技术障碍、与Waymo的诉讼、与莱万多夫斯基的麻烦关系，以及2018年3月该公司一辆自动驾驶测试车辆在亚利桑那州坦佩发生的致命撞车事故而脱轨。\n事故发生后，优步暂停了所有测试，并在过去18个月里缓慢加大了面向公众的业务。开发自动驾驶汽车的成本高昂，促使优步在2019年春天剥离了该公司，此前该公司完成了来自丰田(Toyota)、汽车零部件制造商电装(Denso)和软银(Softbank)愿景基金(Vision Fund)的10亿美元融资。\n剥离事件发生在优步上市前一个月左右，几个月来一直是外界猜测的对象。这被视为优步与其他投资者分担昂贵负担的一种方式，并使其能够专注于核心竞争力和更近期的利润目标。\n撇开麻烦不谈，优步ATG有两个重要而关键的特点，使它对奥罗拉具有吸引力：人才和丰田。\n在2019年注资之前，这家日本汽车巨头已经向优步投资了5亿美元。当时，两家公司宣布，他们打算在2021年将基于丰田Sienna的自动化拼车的试点规模部署到优步拼车网络中，“利用优步ATG的自动驾驶技术和丰田卫士先进的安全支持系统的优势。”\n2019年对优步ATG部门的投资加深了丰田与该公司的关系。\n“当优步在商业秘密诉讼中与Waymo对峙时，Aurora轰动一时。在18个月内，奥拉与现代、拜顿和大众集团达成了几种合作伙伴关系。有些失败了，但也有新的收益，特别是菲亚特克莱斯勒汽车(Fiat Chrysler Automobiles)。这种音乐椅般的变化突显了自动驾驶业务中充满希望的参与者的绝对数量--这个市场仍然充满了商业和技术上的未知数--以及现有汽车制造商在寻找最好的技术和交易方面的反复无常。\n大众集团曾在2018年1月吹捧其与Aurora的合作伙伴关系，该集团在2019年6月向TechCrunch证实，“我们合作伙伴关系下的活动已经结束。”大众集团(VW Group)最终将其资本投入了另一家自动驾驶汽车技术开发商Argo AI，后者已锁定了对福特的支持，并与福特达成了一项客户协议。\n尽管现代确实拥有极光的少数股权，但它也在2019年秋季与自动驾驶技术公司Aptiv成立了一家合资企业。根据与Aptiv的协议，双方在新的合资公司(现在称为Motional)中持有50%的股权。两家公司对Motional的投资总额将达到40亿美元(包括综合工程服务、研发和知识产权的价值)。\n尽管如此，奥罗拉还是取得了胜利。去年春天，该公司在红杉资本(Sequoia)牵头的B轮融资中筹集了5.3亿美元，亚马逊(Amazon)和T·罗威·普莱斯(T.Rowe Price)进行了“重大投资”。奥罗拉当时的估值为25亿美元。最近，业内消息人士表示，奥罗拉的活动非常活跃，尤其是围绕该公司新任业务发展副总裁大卫·马迪(David Maday)的办公室。马迪曾领导通用汽车(General Motors)的企业发展和并购团队长达21年之久。\nAurora一直表示，其全套驾驶系统--为无人机提供大脑的软硬件组合--将与车辆无关，但它的一些早期测试和合作表明，它专注于机器人出租车应用，而不是物流。奥罗拉去年开始更公开地谈论将其技术应用于长途卡车运输，并对这一应用变得更加看好，特别是在收购Blackmore之后。\n奥罗拉在2020年7月宣布，它正在向德克萨斯州扩张，并计划在达拉斯-沃斯堡地区测试商业路线，混合使用菲亚特克莱斯勒太平洋小型货车和8级卡车。一小支太平洋舰队预计将最先抵达。据该公司称，这些卡车将在今年年底前在德克萨斯州上路。\n目前尚不清楚的是，收购优步ATG的交易可能是如何安排的；更重要的是，它是否会保留对该企业的任何兴趣。即使Uber ATG的估值预计将出现下降，但除非Aurora能够获得额外的外部投资，或者以一种允许Uber保留部分股权的方式安排交易，否则Aurora的估值似乎超出了范围。\n后者是有先例的。今年早些时候，优步(Uber)牵头向Lime进行了一轮1.7亿美元的投资。作为这一复杂安排的一部分，优步将自行车和滑板车共享部门Jump出售给了Lime。\n在过去的一年里，关于优步首席执行官Dara Khosrowshahi热衷于摆脱Uber ATG的传言不时出现。但随着新冠肺炎疫情的蔓延，Khosrowshahi和其他高管开始专注于其叫车服务的核心竞争力，并在送货方面加倍努力。除了微移动部门和优步货运(Uber Freight)的剥离，优步还在国际上剥离了一些地区业务，事实证明，这些业务成本太高，无法在与强大的本土竞争对手的竞争中增长。\n据两位消息人士透露，正是在Jump交易之后，出售优步ATG的兴趣与日俱增。\n一位业内投资者将其描述为优步的一个有趣的b计划，这笔交易将允许该公司将ATG从账面上剥离，同时可能受益于一点好处。", "note_en": "Aurora Innovation,   the startup founded by three veterans of the autonomous vehicle industry who led programs at Google, Tesla and Uber, is in negotiations to buy Uber ATG. Terms of the deal are still unknown, but sources say the two companies have been in talks since October and it is far along in the process.\n An Uber spokesperson declined to comment, citing that the company’s general policy is not to comment on these sorts of inquiries. An Aurora spokesperson said it doesn’t comment on speculation.\n The talks could falter. But if successful, they have the potential to triple Aurora’s headcount and allow Uber to unload an expensive long-term play that has sustained several controversies in its short life.\n  Shedding Uber ATG would follow a string of spin offs or other deals in recent months that has narrowed Uber’s focus and costs into core areas of ride-hailing and delivery. Two years ago, Uber’s business model could be described as an “all of the above approach,” a bet on generating revenue from all forms of transportation, including ride-hailing, micromobility, logistics, package and food delivery and someday even autonomous robotaxis.\n That strategy has changed since Uber went public and has further accelerated as the COVID-19 pandemic has upended the economy and fundamentally changed how people live. In the past 11 months, Uber has dumped shared micromobility unit Jump, sold a stake in its growing but still unprofitable logistics arm, Uber Freight and acquired Postmates. (The Postmates acquisition is expected to close in the fourth quarter of 2020).\n Uber ATG has been the company’s last big, expensive holding. Uber ATG holds a lot of long-term promise and high present-day costs; Uber reported in November that ATG and “other technologies” (which includes Uber Elevate) had a net loss of $303 million in the nine months that ended September 30, 2020. In its S-1 document, Uber said it incurred $457 million of research and development expenses for its ATG and “other Technology Programs” initiatives.\n Four sources within the industry told TechCrunch that Uber “has been shopping” ATG to several companies, including automakers this year. Sources have also told TechCrunch that Uber ATG was facing a potential down round, which might have been an additional motivator behind the talks with Aurora.\n Aurora, which was founded in 2017, is focused on building the full self-driving stack, the underlying technology that will allow vehicles to navigate highways and city streets without a human driver behind the wheel. Aurora has attracted attention and investment from high-profile venture firms, management firms and corporations such as Greylock Partners, Sequoia Capital, Amazon and T. Rowe Price, in part because of its founders Sterling Anderson, Drew Bagnell and Chris Urmson.\n Urmson led the former Google self-driving project before it spun out to become the Alphabet business Waymo. Anderson is best known for leading the development and launch of the Tesla Model X and the automaker’s Autopilot program. Bagnell, an associate professor at Carnegie Mellon, helped launch Uber’s efforts in autonomy, ultimately heading the autonomy and perception team at the Advanced Technologies Center in Pittsburgh.\n Aurora has grown from a small upstart to a company with 600 employees and operations in the San Francisco Bay Area, Pittsburgh, Texas and Bozeman, Montana, home of Blackmore, the lidar company it acquired in 2019. About 12% of Aurora’s current workforce previously worked at Uber, according to records on LinkedIn.\n  Despite that growth, Aurora is still dwarfed by Uber ATG, the self-driving subsidiary that is majority owned by Uber. Uber ATG has more than 1,200 employees with operations in several locations, including Pittsburgh, San Francisco and Toronto. Uber holds an 86.2% stake (on a fully diluted basis) in Uber ATG, according to filings with the  U.S. Securities and Exchange Commission. Its investors hold a combined stake of 13.8% in Uber ATG.\n Uber’s public leap into autonomous vehicle technology began in earnest in early 2015 when the company announced a strategic partnership with Carnegie Mellon University’s National Robotics Center. The agreement to work on developing driverless car technology resulted in  Uber poaching dozens of NREC researchers and scientists.  A year later, with the beginnings of an in-house AV development program, Uber, then led by co-founder Travis Kalanick, acquired a self-driving truck startup called Otto.\n The acquisition was troubled almost from the start. Otto was founded earlier that year by one of Google’s star engineers Anthony Levandowski, along with three other Google veterans: Lior Ron, Claire Delaunay and Don Burnette. Uber acquired Otto less than eight months later.\n Two months after the acquisition, Google made two arbitration demands against Levandowski and Ron. Uber wasn’t a party to either arbitration. While the arbitrations played out, Waymo separately filed a lawsuit against Uber in February 2017 for trade secret theft and patent infringement. Waymo alleged in the suit, which went to trial but ended in a settlement in 2018, that Levandowski stole trade secrets, which were then used by Uber.\n Under the settlement, Uber agreed not to incorporate Waymo’s confidential information into their hardware and software. Uber also agreed to pay a financial settlement that included 0.34% of Uber equity, per its Series G-1 round $72 billion valuation. That was calculated at the time to be about $244.8 million in Uber equity.\n In the early days of the Otto acquisition, Uber estimated it could have 75,000 autonomous vehicles on the roads by 2019 and be operating driverless taxi services in 13 cities by 2022, according to court documents unsealed and first reported on by TechCrunch. To reach those ambitious goals, the ride-hailing company was spending $20 million a month on developing self-driving technologies.\n  Uber never came close to hitting those targets, a mission that was derailed by technical hurdles as well as the lawsuit with Waymo, its troubled relationship with Lewandowski and the fatal crash in March 2018 involving one of its self-driving test vehicles in Tempe, Arizona.\n Uber halted all testing following the crash and has been slowly ramping up its more public-facing operations over the past 18 months. The expensive undertaking of developing autonomous vehicles prompted Uber to spin out the company in spring 2019 after it closed $1 billion in funding from Toyota, auto parts maker Denso and Softbank’s Vision Fund.\n The spin out, which occurred about one month before Uber’s debut as a publicly traded company, had been the subject of speculation for months. It was seen as a way for Uber to share the expensive load with other investors and allow it to focus on its core competencies and nearer term profit goals.\n  Troubles aside, Uber ATG has two important and critical features that make it attractive to Aurora: talent and Toyota.\n The Japanese car giant had already invested $500 million into Uber prior to the 2019 injection of cash. At the time, the two companies announced their intention to bring pilot-scale deployments of automated Toyota Sienna-based ridesharing vehicles to the Uber ridesharing network in 2021, “leveraging the strengths of Uber ATG’s self-driving technology alongside the Toyota Guardian advanced safety support system.”\n The 2019 investment into the Uber ATG unit deepened Toyota’s relationship with the company.\n “While Uber was facing off against Waymo in the trade secrets lawsuit, Aurora launched with a bang. Within 18 months, Auora had secured several kinds of partnerships with Hyundai, Byton and VW Group. Some have fizzled, while there have been new gains, notably with Fiat Chrysler Automobiles. The musical chair-like changes underscores the sheer number of hopeful players in the self-driving business — a market that is still full of commercial and technical unknowns — and the fickleness of incumbent car makers in search of the best tech and deal.”\n VW Group, which had touted its Aurora partnership in January 2018,  confirmed to TechCrunch in June 2019 that “activities under our partnership have been concluded.” VW Group ultimately put its capital behind Argo AI, another autonomous vehicle technology developer that had locked up backing and a customer deal with Ford.\n While Hyundai does have a minority stake in Aurora, it also went ahead and locked in a joint venture in fall 2019 with autonomous driving technology company Aptiv. Under the deal with Aptiv, both parties took a 50% ownership stake in the new joint company that is now called Motional. The combined investment in Motional from both companies will total $4 billion in aggregate value (including the value of combined engineering services, R&amp;D and IP).\n Still, Aurora has had its wins. The company raised $530 million last spring in a Series B round led by Sequoia with “significant investment” from Amazon and T. Rowe Price. Aurora’s post-money valuation at the time was $2.5 billion. More recently, sources  in the industry say that Aurora is abuzz with activity, particularly around the office of David Maday, the company’s new vice president of business development who led General Motors’ corporate development and mergers and acquisitions team for 21 years.\n Aurora has always stated that its full driving stack — the combined suite of software and hardware that provides the brains for an AV — would be vehicle agnostic, but some of its early testing and partnerships suggested it was focused on robotaxi applications, not logistics. Aurora started talking more openly last year about applying its technology to long-haul trucking and has become more bullish on that application, particularly following its Blackmore acquisition.\n Aurora announced in July 2020 that it was expanding into Texas and planned to test commercial routes in the Dallas-Fort Worth Area with a mix of Fiat Chrysler Pacifica minivans and Class 8 trucks. A small fleet of Pacificas were expected to arrive first. The trucks will be on the road in Texas by the end of the year, according to the company.\n  What’s unclear is how an acquisition of Uber ATG might be structured; and more importantly, if it will retain any interest in the enterprise. Even with the expected depletion in Uber ATG’s valuation, it would be seemingly out-of-range for Aurora unless it was able to secure additional outside investment or structure the deal in a way that would allow Uber to keep some equity.\n There is precedent for the latter. Earlier this year, Uber led a $170 million investment round into Lime. As part of the complex arrangement, Uber offloaded Jump, the bike and scooter-sharing unit, to Lime.\n Rumors that Uber CEO Dara Khosrowshahi was keen to get rid of Uber ATG have popped up from time to time in the past year. But as the COVID-19 pandemic took hold, Khosrowshahi and other executives began to focus on its core competency of ride-hailing and double down on delivery. In addition to its micromobility unit and the Uber Freight spinoff, it has divested itself internationally of a number of regional operations that were proving too costly to grow in competition with strong local rivals.\n It was on the heels of the Jump deal that interest in selling off Uber ATG ramped up, according to two sources.\n One investor in the industry described it as an interesting plan b for Uber, a deal that would allow the company to take ATG off the books, while potentially getting to benefit from a little of upside.", "posttime": "2020-11-14 07:20:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "旗下,uber,优步", "title": "消息人士：优步自10月以来一直在洽谈将旗下自动驾驶汽车部门Advanced Technologies Group出售给Aurora Innovation", "title_en": "Sources: Uber has been in talks since October to sell its self-driving car unit, Advanced Technologies Group, to Aurora Innovation", "transed": 1, "url": "https://techcrunch.com/2020/11/13/uber-in-talks-to-sell-atg-self-driving-unit-to-aurora/", "via": "", "real_tags": ["旗下", "uber", "优步"]}, {"category": "", "categoryclass": "", "imagename": "c595137908dc3a18e3a828f232b4bec1.png", "infoid": 1034949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最新的进展之一是，Udemy在F轮融资中筹集了至多1亿美元，这轮融资对该公司的估值最高可达33.2亿美元。Udemy提供的市场目前有约13万门基于视频的课程，涉及65种语言，从学习Python或如何更好地拍照，到掌握正念和商业分析。\n该公司已经在特拉华州提交了筹款文件，最初是由贾斯汀·拜尔斯(Justin Byers)和Prime独角兽指数(Prime Unicorn Index)的团队发现的。目前还不清楚这轮融资是否已经结束，以及是否筹集了全部资金(或者确实更多)。\n记者联系乌德米寻求回应，他没有否认这一报道，但也拒绝暂时发表任何言论。一位发言人通过电子邮件对我说：“我们公司的政策是不对猜测发表评论。”“我们目前无可奉告，但如果有任何变化，我会联系你的。”\n此次融资对Udemy来说将是一个强有力的举措，该公司今年早些时候才结束了E系列融资-这轮融资将该公司的估值推高至20亿美元以上。\n但那是在2月份，在这种新型冠状病毒真正席卷世界之前。自那以后，从今年春季开始，专注于教育的初创企业的业务激增，因此，看到了支持后起之秀的好时机的投资者的关注也随之激增。\n看看最近的一些交易，上周，Udacity宣布了一轮7500万美元的债务融资，并表示终于实现了盈利。去年10月，Kahoot宣布从软银(SoftBank)获得2.15亿美元的融资。今年9月，OutSchool筹集了4500万美元(现在已经盈利)；荷马筹集了5000万美元(来自一群令人印象深刻的战略支持者)；Unacademy筹集了1.5亿美元；巨头Byju‘s从银湖获得了5亿美元。\n这些只是较大规模的交易中的一部分；除此之外，还有许多规模较小的融资、新的教育技术初创公司的推出以及其他势头的迹象。(顺便说一句，Prime Unicorn还指出，Duolingo也在筹集资金，如果所有股票都发行的话，估值高达22.1亿美元，最高可达3500万美元。我们仍在挖掘这一线索。)。\nUdemy上一次融资是在今年早些时候，当时业务部的总裁告诉我，已经有5000万名学生按单点选购课程，而企业客户--包括阿迪达斯(Adidas)、通用磨坊(General Mills)、丰田(Toyota)、维普罗(Wipro)、Pinterest和Lyft--使用的是订阅模式。\n根据其网站上的数据，它的商业用户看起来已经增长了，现在有超过7000人，到目前为止，课程注册总人数达到4亿人。这可能表明，Udemy现在正在用更多的资本探索机会。\n但需要明确的是，申请文件没有详细说明谁参与了最新一轮融资，也没有详细说明融资的目的是什么。\n正如我们在2月份融资时所写的那样，这笔资金来自一个单一的战略投资者，即与日本Udemy合作的日本教育出版商Benesse Holdings。Benesse更大的业务包括为儿童开发教育内容，为成人开发在线和面对面的课程，以及为其拥有的其他教育品牌(如Berlitz)开发教育内容，Udemy帮助Benesse为这些努力开发内容。\n该公司的其他投资者包括Stripe、Naspers(现为Prosus)、Learn Capital、Insight Partners和Norwest Venture Partners等。\nPrime独角兽指数(Prime Unicorn Index)指出，围绕最新的F系列的条款包括“与所有其他优先股和传统可转换股享有同等的清算优先权，这意味着如果有剩余收益，它们将不会参与普通股。”它还指出，Udemy的最新每股价格为24.13美元，高于E系列股票的定价为15.57美元。", "note_en": "In one of the latest developments,  Udemy — which provides a marketplace currently numbering some 130,000 video-based courses across 65 languages, ranging from learning Python or how to photograph better, through to mastering mindfulness and business analytics — is raising up to $100 million in a Series F round of funding that would value the company at up to $3.32 billion.\n The company has filed paperwork for the fundraise in Delaware, first discovered by Justin Byers and the team at  Prime Unicorn Index. It’s not clear if the round has closed, and whether the full amount was raised (or indeed, more).\n  Contacted for a response,  Udemy   didn’t deny the report but also declined to say anything for the moment. “We have a company policy where we don’t comment on speculations,” a spokesperson said to me via email. “We don’t have a comment at this time but I’ll reach out if anything changes.”\n The fundraise would be a strong move for Udemy, which only closed its Series E earlier this year — a  $50 million round that catapulted the company to a $2 billion+ post-money valuation.\n But that was in February, before the novel coronavirus really took hold of the world. Since then, startups focused on education have been seeing a surge of business starting in the spring of this year, and as a result, also a surge of attention from investors who see a good moment to back rising stars.\n Just looking at some of the most recent deals, last week,  Udacity announced a $75 million debt round and said it was finally profitable. In October,  Kahoot announced a $215 million round from SoftBank. And in September, Outschool  raised $45 million (and is now profitable); Homer  raised $50 million (from an impressive group of strategic backers); Unacademy  raised $150 million and the juggernaut that is Byju’s picked up  $500 million from Silver Lake.\n  And these are just some of the bigger deals; there have been many  smaller fundraises, new  edtech startup launches and other  signs of momentum alongside  this. (And Prime Unicorn, incidentally, also noted that  Duolingo is also raising money, up to $35 million at a valuation of $2.21 billion if all shares are issued. We’re still digging on that lead.)\n When Udemy last raised money, earlier this year, the president of the business division told me it had clocked up 50 million students that purchase courses in an à la carte format, while enterprise customers — which include Adidas, General Mills, Toyota, Wipro, Pinterest and Lyft in a list of some 5,000 in all — use a subscription model.\n It looks like its business users have grown and now number over 7,000, according to  figures on its site, with total course enrollments now totalling 400 million to date. That could point to the opportunity that Udemy is now exploring with more capital.\n But to be clear, the filing does not detail who is in this latest round, nor what the purpose of the fundraising is.\n As we wrote at the time of the round in February, that fundraise came from a single, strategic investor, the Japanese educational publisher Benesse Holdings, which partners with Udemy in Japan. Benesse’s bigger business includes developing educational content for children and courses for adults, both online and in-person, and for other educational brands that it owns, such as  Berlitz, and Udemy helps Benesse develop content for those various efforts.\n  Other investors in the company include Stripes, Naspers (now Prosus), Learn Capital, Insight Partners and Norwest Venture Partners, among others.\n Prime Unicorn Index notes that the terms surrounding this latest Series F include a “pari passu liquidation preference with all other preferred, and conventional convertible, meaning they will not participate with common stock if there are remaining proceeds.” It also noted that Udemy’s most recent price per share is $24.13, an up round from the Series E, which priced shares at $15.57.", "posttime": "2020-11-14 07:20:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "估值,udemy", "title": "申请：在线学习市场Udemy正在筹集最多1亿美元的F系列资金，估值为33.2亿美元；Udemy在2月份筹集了5000万美元的E系列资金，估值超过20亿美元。", "title_en": "Filing: Online learning marketplace Udemy is raising up to $100M Series F at a $3.32B valuation; Udemy raised $50M Series E in February at a $2B+ valuation", "transed": 1, "url": "https://techcrunch.com/2020/11/13/filing-online-learning-marketplace-udemy-is-raising-up-to-100m-at-a-3-32b-valuation/", "via": "", "real_tags": ["估值", "udemy"]}, {"category": "", "categoryclass": "", "imagename": "8fea5522c34f80e093bc158fd6abd85f.jpg", "infoid": 1034948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "保险软件提供商Vertafort本周披露了一起数据泄露事件，承认有第三方获取了2770万名德克萨斯州司机的详细信息。\n这起事件据信发生在3月11日至8月1日之间，是人为错误导致的，当时三个数据文件被无意中存储在不安全的外部存储服务中。\nVertafort表示，这些文件是从外部存储系统中删除的，但经过调查后，他们发现这些文件是在未经授权的情况下被访问的。\n据该软件提供商称，这三个文件包含了2019年2月之前发放的驾照信息，该公司在其保险评级软件解决方案中使用了这些驾照。\n曝光的数据包括德克萨斯州的驾照号码、姓名、出生日期、地址和车辆登记历史。\nVertafort在本周发布在其网站上的一份公开数据泄露通知中表示，社保号码或金融账户信息不包括在内。\nVertafort表示，它已将安全漏洞通知了相关当局，包括德克萨斯州总检察长、德克萨斯州公共安全部、德克萨斯州机动车管理局和联邦执法部门。\n调查正在进行中。该公司现在还在通知德克萨斯州的司机，他们的数据在这次入侵中被泄露了。\nVertafort表示，它曾与一家情报公司合作，但没有发现任何证据表明泄露的数据被滥用或误用。\nVertafort说，尽管该公司没有发现任何证据，但出于对所有得克萨斯州驾照获得者的考虑，出于充分的谨慎，Vertafort向他们提供了一年的免费信用监控和身份恢复服务，以承认这些服务在此次活动以外的其他情况下提供了有价值的保护。\n尽管如此，德克萨斯州的司机并不是这些天来唯一处理个人信息泄露的数据泄露事件的人。今年9月，数以千计的新南威尔士州驾照持有者的信息也在澳大利亚曝光，此前超过10万张图片同样被留在了一个不安全的亚马逊网络服务(AWS)云存储文件夹中。", "note_en": "Vertafore, a provider of insurance software, has disclosed this week a data breach, admitting that a third-party accessed the details of 27.7 million Texas drivers.\n     The incident is believed to have taken place sometime between March 11 and August 1, and happened as a result of human error when three data files were inadvertently stored in an unsecured external storage service.\n Vertafore said the files were removed from the external storage system, but after an investigation, they discovered that the files had been accessed without authorization.\n According to the software provider, the three files contained information on driver&#39;s licenses issued before February 2019, which the company was using for its insurance rating software solution.\n Exposed data included Texas driver license numbers, names, dates of birth, addresses, and vehicle registration histories.\n Social Security numbers or financial account information was not included, Vertafore said in a  data breach notification published on its website this week.\n Vertafore said it notified relevant authorities about the security breach, including the Texas Attorney General, the Texas Department of Public Safety, the Texas Department of Motor Vehicles, and federal law enforcement.\n   An investigation is underway. The company is now also notifying Texas drivers whose data was exposed in the breach.\n Vertafore said it has worked with an intelligence firm but has not found any evidence that the leaked data has been abused or misused.\n &#34;Although that firm did not find any evidence, to be considerate of all Texas driver license recipients and out of an abundance of caution, Vertafore is offering them one year of free credit monitoring and identity restoration services in recognition that these services offer valuable protection in other contexts beyond this event,&#34; Vertafore said.\n Still, Texas drivers aren&#39;t the only ones dealing with a data breach that exposed their personal information these days. The information of  thousands of New South Wales driver&#39;s license holders was also exposed in Australia in September after more than 100,000 images were similarly left in an unsecured Amazon Web Services (AWS) cloud storage folder.", "posttime": "2020-11-14 07:15:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,司机,external,驾照", "title": "保险软件提供商Vertafort披露，在一项不安全的外部存储服务上的2770万名德克萨斯州司机的数据被外部方访问后，数据被泄露", "title_en": "Insurance software provider Vertafore discloses breach after data of 27.7M Texas drivers on an unsecured external storage service was accessed by external party", "transed": 1, "url": "https://www.zdnet.com/article/info-of-27-7-million-texas-drivers-exposed-in-vertafore-data-breach/", "via": "", "real_tags": ["软件", "司机", "external", "驾照"]}, {"category": "", "categoryclass": "", "imagename": "5b694ae333206419f9c4a9d4cfa7cf5d.jpeg", "infoid": 1034947, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "领英(LinkedIn)周四表示，它发现了两个测量错误，导致40多万广告商在这个专业社交平台上为广告支付了过高的费用。\n微软(Microsoft Corp.)旗下的这家公司在一篇博客文章中说，其工程团队在其广告产品中发现并修复了两个测量问题，这两个问题导致赞助内容活动中视频浏览量和广告印象的过度报道。该公司表示，在两年多的时间里，这些漏洞影响了41.8万多个广告商。\nLinkedIn发现，通过视频广告，一些有机视频和视频广告可以在苹果公司(Apple Inc.)iOS设备上的屏幕外播放。\n例如，如果LinkedIn用户在视频缓冲期间滚动经过视频广告，即使在看不到的情况下，该广告也会自动播放，但仍会被跟踪并记录为视频观看或完成。\nLinkedIn的一位发言人表示，这可能导致视频点击量和点击率等措施被夸大，并向按点击量付费的广告商收取过高费用。\n这位发言人说，该公司还表示，它可能在LinkedIn订阅源中夸大了赞助内容宣传活动的印象--例如，当用户旋转手机或快速移动到应用程序的其他部分时。\n总体而言，该公司表示，超过90%的受影响广告商多付了不到25美元，并补充说，它将为他们未来的广告活动提供积分。\n多年来，广告商一直要求提高社交媒体巨头提供的指标的透明度，并对其进行第三方审计，LinkedIn出现了这一错误。2016年，在广告商了解到Facebook两年来高估了该平台上视频广告的平均观看时间后，Facebook遭到了抨击。Facebook只统计了持续时间至少3秒的视频点击量，忽略了持续时间较短的视频点击量，因此人为地推高了点击量的平均时长。在某些情况下，早期的统计方法可能将观看视频的平均时间高估了60%到90%。\nFacebook最终解决了一群小广告商就错误计算的视频指标提起的诉讼。\nLinkedIn表示，该公司已于6月份开始与该行业的衡量监督机构--媒体评级委员会(Media Rating Council)就其衡量指标的审计进行谈判。LinkedIn的一位发言人表示：“我们正在与他们合作，对我们的指标进行审计。”\n该公司还与甲骨文(Oracle)旗下的测量公司Moat合作，测量所谓的可看性-视频在其平台上显示的部分和持续时间。", "note_en": "LinkedIn said Thursday it discovered a pair of measurement errors that led to more than 400,000 advertisers overpaying for campaigns on the professional networking platform.\n  In a blog post, the Microsoft Corp.-owned company said its engineering team found and fixed two measurement issues in its ad products, which led to overreporting of video views and ad impressions on sponsored-content campaigns. The bugs affected more than 418,000 advertisers over the course of more than two years, it said.\n  With video ads, LinkedIn discovered that some organic videos and video ads would play while they were off-screen on Apple Inc.’s iOS devices.\n  If a LinkedIn user scrolled past a video ad while the video was buffering, for example, the ad would autoplay even when out of view, but still be tracked and logged as a video view or completion.\n    That may have resulted in overstated measures including video views and view-through rates, as well as overcharging advertisers paying by the view, according to a LinkedIn spokesman.\n    The company also said it may have been overreporting impressions on sponsored-content campaigns in the LinkedIn feed—for example, in cases when users would rotate their phones or quickly move to other parts of the app, the spokesman said.\n    Overall, the company said more than 90% of the advertisers affected overpaid by less than $25, adding that it would provide them with credits for future ad campaigns.\n    LinkedIn’s error comes after years of advertisers demanding more transparency and third-party auditing of the metrics provided by social-media giants. In 2016,  Facebook  came under fire after advertisers learned that it had  overestimated average viewing time for video ads on the platform for two years. Facebook had only been counting video views that lasted for at least three seconds, ignoring those of shorter duration and therefore artificially pushing the average length of a view higher. In some cases, the earlier counting method likely overestimated average time spent watching videos by between 60% and 90%.\n  Facebook eventually  settled a lawsuit from a group of small advertisers over the miscalculated video metrics.\n  LinkedIn said it began talks in June with the Media Rating Council, the industry’s measurement watchdog, on an audit of its metrics. “We are working with them to proceed with an audit of our metrics,” a LinkedIn spokesman said.\n  The company is also working with  Oracle  -owned measurement firm Moat to measure so-called viewability—the portion of the video that appears on screen and for how long—on its platforms.", "posttime": "2020-11-14 07:15:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,overpaying,视频", "title": "LinkedIn表示，它发现了两个视频和广告指标测量错误，导致41.8万广告商在两年多的时间里为广告支付了过高的费用", "title_en": "LinkedIn says it discovered a pair of video and ad metrics measurement errors that led to 418K advertisers overpaying for campaigns for over two years", "transed": 1, "url": "https://www.wsj.com/articles/linkedin-finds-measurement-errors-that-inflated-video-and-ad-metrics-11605228577?mod=djemalertNEWS", "via": "", "real_tags": ["广告", "视频"]}]