[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1014710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我今天要说的第二个问题。现在，您可以在WSL2中运行.NET Core控制台和Web应用程序，并直接从Visual Studio 2019对其进行调试！\n以下是安装该扩展时在Visual Studio 2019中的体验。它可以正常工作，并且可以非常轻松地在Windows(在IIS或Kestrel Web服务器下，或者在您的默认Linux发行版下的Kestrel下)上运行。\n检查一下，您可以看到，从Linux/WSL2的角度来看，.NET Core已经从/usr/share/dotnet/share加载出来，但是我的源代码仍然在我的/mnt/d驱动器上(我的Windows D：)，并且调试正常。", "note_en": "It&#39;s the second one that I&#39;m talking about today. You can now  run .NET Core console and web apps in WSL2 and debug them directly from Visual Studio 2019!\n      Here&#39;s the experience in Visual Studio 2019 when the extension is installed. It &#34;just works&#34; and it makes it super easy to switch between running on Windows (under IIS or the Kestrel web server or under Kestrel under your default Linux distribution.\n   Check this out, you can see that .NET Core, from the Linux/WSL 2 perspective, is loaded out of /usr/share/dotnet/shared but my source remains on my /mnt/d drive (my Windows D:) and debugging Just Works.", "posttime": "2020-07-29 00:06:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,程序,windows,core,wsl2", "title": "从Windows上的Visual Studio远程调试WSL2中的.NET Core Linux应用程序", "title_en": "Remote Debugging a .NET Core Linux App in WSL2 from Visual Studio on Windows", "transed": 1, "url": "https://www.hanselman.com/blog/OfficialSupportForRemoteDebuggingANETCoreLinuxAppInWSL2FromVisualStudioOnWindows.aspx", "via": "", "real_tags": ["linux", "程序", "windows", "core", "wsl2"]}, {"category": "", "categoryclass": "", "imagename": "1fec832c3f57d8721ec9275176faa966.jpg", "infoid": 1014709, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "布莱恩·坎特里尔氧化物计算机公司2020年2月26日虽然我们的软件系统已经变得越来越有弹性，但可供运行的物理衬底...", "note_en": "Bryan Cantrill Oxide Computer Company February 26, 2020 While our software systems have become increasingly elastic, the physical substrate available to run ...", "posttime": "2020-07-29 00:06:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算机,machine", "title": "新机器的灵魂：重新思考计算机[视频]", "title_en": "The Soul of a New Machine: Rethinking the Computer [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=vvZA9n3e5pc&list=PLoROMvodv4rMWw6rRoeSpkiseTHzWj6vu", "via": "", "real_tags": ["计算机", "machine"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个演讲是关于一种特殊的媒介，它是用来思考的媒介，它是关于一种特殊的思维，那就是理解系统。\n科学就是理解世界上的一个系统。工程学是在世界上建立一个系统，其中的挑战往往是理解我们正在建设的是什么。\n媒体是我们思考的工具。我们对系统的表述就是我们理解它的方式。\n为了理解或构建新的复杂系统，我们需要强大的新表示法，我们需要一种强大的新媒介来处理这些表示法。\n今天&#39；的陈述是为纸张媒介设计的。本讲座将展示系统的新表示法的示例，并提供有关新媒体可能是什么样子的提示。\n第一个例子显示了一篇科学论文。该示例是关于显示系统行为的。(有关详细信息，请参阅作为顺序艺术的科学传播。)。\n作者的脑海中有一幅丰富的图画，他们想把它传递给读者的脑海。但是纸张是一个低带宽的频道，很多信息都会丢失。\n这篇论文的重新设计使用了文字和图片，紧密地交织在一起。文字描述算法的结构，图片描述算法的行为。\n向读者展示算法每一步的系统状态，而不是在他们的大脑中模拟它。\n向读者展示变量之间的关系，而不是从表达式中在他们的头脑中重构它们。\n此示例显示了使用电子电路的环境。(有关详细信息，请参阅按原则发明，23：22。)。\n要理解一个系统，一次只看到一个变量是不够的。这个示例是关于一次查看所有变量。\n在此环境中，设计者可以一次查看所有电压，直观地将任何电压叠加在所有其他电压上进行比较，并调整参数以查看行为如何响应。\n为了显示当前内容，每个组件的符号表示将替换为组件数据的可视化表示。\n此表示传达了与传统原理图相同的结构信息，但也传达了行为。它是由实时数据构建的，而不是死的符号。\n理查德·汉明认为，就像我们听不到的声音一样，可能会有我们无法思考的想法。\n但是我们怎么知道这些声音呢？我们制造的工具可以使听不见的声音适应人类的感官。\n同样，思维工具使不可想象的想法适应人类的思维。其中最伟大的两个工具是书写和数学记法。\n要建立一个思考工具，了解人们是如何思考的是很有帮助的。杰罗姆·布鲁纳考虑了三种心态--交互性、视觉性和象征性。\n铅笔和纸把我们限制在大多数简单的符号表示上。在新的媒介中，表现可以同时利用这三种心态。\n此示例来自信号处理，并且是关于同一行为的多个表示。(有关详细信息，请参阅可浏览的说明。)。\n当设计者调整参数时，会同时显示解释行为的五种不同方式。每一种表现形式都提供了自己独特的见解。\n通过观察不同的表现形式如何在一起跳舞，设计师在它们之间建立了联系。这会导致直觉--在一个系统中摸索自己的方式的能力。\n此示例显示了使用差分方程的环境。该示例是关于直接与行为交互的，而不仅仅是参数。\n并根据任何参数绘制任何测量值。这对参数进行了抽象，不仅给出了一个特定系统的表示，而且给出了整个系统系列的表示。(有关详细信息，请参阅抽象阶梯的上下。)。\n此示例显示了使用尼罗河编程语言工作的环境。这个例子是关于链接在一起的表示法。(有关详细信息，请参见Github上的尼罗河。)。\n这是矢量图形引擎的代码。语言和代码都设计得很好，但是仍然很难理解，因为你看不到系统的行为。\n指向任何对象都会突出显示它在前几个阶段的来源、在后几个阶段的去向以及生成它的代码行。所有的表示都在一起工作。\n不同类型的数据使用不同的可视化效果。通过忽略代码，只需查看数据是如何转换的，您就可以理解系统如何工作的要点。\n用于处理许多动态表示的媒介必须提供创建所有这些表示的好方法。(有关详细信息，请参见绘制动态可视化。)。\n形象化应该通过视觉思维来创造。手绘是直接和富有表现力的，但不是动态的。代码是动态的，但编码是间接的、象征性的、不可视的。\n此示例是设计者通过直接在画布上绘制来指定图片的工具，如Illustrator中所示。但是绘图操作随后可以用变量表达式参数化。\n因此，图片可以依赖于数据。对于不同的数据，我们看到了不同的图景。因此，这些图片可以用作系统中的表示。\n设计人员并不局限于标准的图表类型，而是可以绘制即席表示法来探索他们需要了解的关于特定系统的任何内容。\n我在这里展示的所有例子都是提示。他们正在蚕食一个大问题的一角--理解系统的新媒介是什么？\n我们必须摆脱纸上谈兵的思维。即使在电脑上工作时，我们仍然在为纸的媒介而发明的表示法中思考。\n我们有机会重塑我们对系统的看法，创造一种新的媒介。我不知道那个媒介是什么，但如果你想帮忙找，请告诉我。\n有关本次演讲背后的更多信息，请参见关于思考不可想象的媒体的一篇不明智的个人笔记。\n我出版Talks是因为这部作品通过现场演示-展示和讲述-是最好的传达方式，而Talk&#34；Talk就是支持这一点的一种媒介。\n但是演讲是一个贫乏的知识容器。它是不透明的。观众不能浏览、浏览或一瞥要领。想法不能根据需要查阅，它们感觉转瞬即逝。媒体很适合娱乐-观看和享受-但不是工具箱。\n这个页面试图将演示驱动的演讲分解成一种可略读、可浏览、可展示的形式，以便以后可以快速引用个人想法。\n从另一个方向来看问题--一篇设计良好的论文可以略读和参考，但通常不能展示和讲述。有关将现场演示合并到散文中的尝试，请参阅可学习编程。", "note_en": "This talk is about a particular kind of media, which is &#34;media for thinking in.&#34; And it&#39;s about a particular kind of thinking, which is  understanding systems.\n  &#34;Science&#34; is understanding a system in the world. &#34;Engineering&#34; is building a system in the world, where the challenge is often understanding what we&#39;re building.\n  Media are our thinking tools. Our  representations of a system are how we understand it.\n  To understand or build new complex systems, we need powerful new representations, and we need a powerful new medium in which to work with these representations.\n  Today&#39;s representations were designed for the medium of paper. This talk will show examples of new representations for systems, and offer hints as to what a  new medium might be like.\n This first example shows a scientific paper. The example is about  showing the behavior of a system.  (For more information, see  Scientific Communication As Sequential Art.)\n  The authors have a rich picture in their heads, which they&#39;d like to transmit to the reader&#39;s head. But paper is a &#34;low-bandwidth channel&#34;, and much information is lost.\n  This redesign of the paper uses words and pictures, tightly intertwined. Words describe the  structure of the algorithm, and pictures depict the  behavior of the algorithm.\n  Readers are shown the state of the system at each step of the algorithm, instead of simulating it in their heads.\n  Readers are shown relationships between variables, instead of reconstructing them in their heads from expressions.\n This example shows an environment for working with electronic circuits.  (For more information, see  Inventing on Principle, 23:22.)\n  To understand a system, it&#39;s not enough to see one variable at a time. This example is about  seeing all variables at once.\n  In this environment, the designer can see all voltages at once, visually overlay any voltage on all other voltages to  compare, and adjust parameters to see how the behavior responds.\n  To show current, the symbolic representation of each component is replaced with a  visual representation of the component&#39;s data.\n  This representation conveys the same structural information as a conventional schematic, but it conveys behavior as well. It&#39;s built out of live data, not dead symbols.\n Richard Hamming suggested that, like sounds we cannot hear, there could be  thoughts we cannot think.\n  But how do we even know about such sounds? We  build tools which adapt unhearable sounds to our human senses.\n  Likewise, thinking tools  adapt unthinkable thoughts to our human minds. Two of the greatest such tools are writing and mathematical notation.\n  To build a thinking tool, it helps to understand how people think. Jerome Bruner considered three mentalities —  interactive, visual, and symbolic.\n  Pencil-and-paper constrained us to mostly simple symbolic representations. In the new medium, representations can draw on all three mentalities simultaneously.\n This example is from signal processing, and is about  multiple representations for the same behavior.  (For more information, see  Explorable Explanations.)\n  As the designer adjusts parameters, five different ways of interpreting the behavior are shown simultaneously. Each representation offers its own unique insights.\n  By seeing how the different representations dance together, the designer builds  associations between them. This leads to  intuition — the ability to &#34;feel your way&#34; around a system.\n This example shows an environment for working with difference equations. The example is about  directly interacting with behavior as opposed to just parameters.\n        And plotting any measurement against any parameter. This  abstracts over the parameter, giving a representation of not just one particular system, but an entire family of systems.  (For more information, see  Up and Down the Ladder of Abstraction.)\n This example shows an environment for working in the Nile programming language. The example is about representations  linked together.  (For more information, see  Nile on Github.)\n  This is the code for a vector graphics engine. Both the language and code are well-designed, but it&#39;s still difficult to understand them because you can&#39;t see the behavior of the system.\n    Pointing to any object highlights  where it came from in previous stages,  where it went in later stages, and the  lines of code that produced it. The representations all work together.\n  Different types of data use  different visualizations. You can understand the gist of the how the system works by ignoring the code and just looking at how the data was transformed.\n A medium for working with many dynamic representations must provide a good way to create all these representations.  (For more information, see  Drawing Dynamic Visualizations.)\n  Visualizations should be created by  thinking visually. Hand-drawing is direct and expressive, but not dynamic. Code is dynamic, but coding is indirect, symbolic, non-visual.\n  This example is a tool in which the designer specifies a picture by  directly drawing on a canvas, as in Illustrator. But drawing actions can then be parameterized with variable expressions.\n  The picture can therefore  depend on data. With different data, we see a different picture. These pictures can thus be used as representations in systems.\n  Designers aren&#39;t confined to standard chart types, but can draw ad-hoc representations to explore whatever they need to understand about a particular system.\n All of the examples I&#39;ve shown here are  hints. They are nibbling at the corners of a big problem — what is this new medium for understanding systems?\n  We must get away from pencil-and-paper thinking. Even when working on the computer, we still think in representations that were invented for the medium of paper.\n    We have an opportunity to reinvent how we think about systems, to  create a new medium. I don&#39;t know what that medium is, but if you&#39;d like to help find it, let me know.\n For more information on the context behind this talk, see  An Ill-Advised Personal Note about &#34;Media for Thinking the Unthinkable&#34;.\n    I publish talks because this work is best conveyed through live demos — show-and-tell — and the &#34;talk&#34; is a medium that supports that.\n  But a talk is a poor knowledge-container. It&#39;s opaque. The viewer can&#39;t skim, browse, or get a gist at a glance. Ideas can&#39;t be looked up as needed; they feel fleeting. The medium works well for entertainment — watch and enjoy — but not for a toolbox.\n  This page is an attempt to &#34;explode&#34; a demo-driven talk into a skimmable, browsable, gistable form, where individual ideas can be quickly referenced later.\n  Coming at the problem from the other direction — a well-designed paper can be skimmed and referenced, but typically can&#39;t show and tell. For an attempt to incorporate live demos into prose, see  Learnable Programming.", "posttime": "2020-07-29 00:05:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不可,thinking,系统", "title": "思考不可想象的媒体(2013)", "title_en": "Media for Thinking the Unthinkable (2013)", "transed": 1, "url": "http://worrydream.com/MediaForThinkingTheUnthinkable/", "via": "", "real_tags": ["不可", "thinking", "系统"]}, {"category": "", "categoryclass": "", "imagename": "477b972c57ac92f280f586685c6f3c8c.jpg", "infoid": 1014707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "果酱是保存水果的一种非常自然的方式。这种水果一年中只有一小部分成熟，你想全年都能吃到，所以你要用足够的糖来烹调它，这样它就不会在很长一段时间内变质。但是现在我们有了冰箱，果酱就过时了。当你做果酱时，你总是在几个方面改变水果的味道和质地：*挤压水果使它的质地更一致，适合涂抹。*加糖会使果酱更甜，也不太健康。*热度改变水果风味，更多挥发性风味蒸发。*热量蒸发了部分水，使其变稠(减少)。*加热释放果胶，或者你加入额外的果胶，使果酱凝胶化。有些人制作冰柜果酱，跳过加热的步骤，给你带来更接近新鲜水果的味道。因为它还没有煮透，所以你需要把它放在冰箱里，但既然现在已经有了冰柜，那就不成问题了。不过，我们可以更进一步，只用冷冻水果。拿出冰冻的树莓，解冻，然后用叉子把它们挤扁：放在鸡蛋华夫饼上，加上坚果，解冻大约需要一分钟，挤压大约需要10分钟，这比果酱要好得多。不那么甜，味道更好，而且更便宜，也更健康！传统果酱一打开就可以放在冰箱里，这是一个优势，但我认为这是暂时的。随着时间的推移，我预计，随着冷冻食品质量的持续提高，家庭将转向更多的冷藏空间，而不是冰箱空间。我们的房子上了网后不久就有了一个冷柜，我很高兴我们做到了！[1]我们的杂货店有树莓果酱，每磅2.75美元，冷冻树莓，每磅4.39美元，果酱大约40%是水果。[1]我们的杂货店有树莓果酱，每磅2.75美元，冷冻树莓每磅4.39美元，果酱中水果含量约为40%。虽然我们有很多像山莓这样的冰柜空间，但我一直在网上购买，每磅30磅，发货价3.08美元。一批货物装满了6-8个1加仑的拉链，这取决于它最终是大部分是完整的还是大部分是碎片。公司", "note_en": "Jam is a very natural way to preserve fruit. The fruit is ripe only a smallfraction of the year, you'd like to be able to eat it all year long, so you cookit with enough sugar that it won't go bad for a long time. But now that we havefreezers, jam is obsolete.When you make jam, you change the taste and texture of the fruit in severalways: * Squishing the fruit makes it into a more consistent texture, suitable for   spreading. * Adding sugar makes the jam sweeter, and also much less healthy. * Heat changes the flavor of the fruit, With more volatile flavors evaporating. * Heat evaporates some of the water, thickening it (reducing). * Heat releases pectin, or you add additional pectin, which gels the jam.Some people make freezer jam, which skips the heated steps, and gives you aflavor much closer to fresh fruit. Because it hasn't been cooked thoroughly, youneed to store it in the freezer, but since freezers are a thing now, that's nota problem.We can go a step further, though, and just use frozen fruit. Take frozenraspberries, defrost them, and squish them up with a fork:on eggy waffles, with nutellaThis takes about a minute for defrosting, 10s for squishing, and is far superiorto jam. Not so sweet, better flavor, and it's cheaper [1] and healthier as well!Being able to store traditional jam in the refrigerator once you've opened it isan advantage, but I think it's a temporary one. Over time, I expect householdswill shift towards more freezer space relative to refrigerator space, as thequality of frozen food continues to rise. We got a chest freezer soon after webought our house, and I'm glad we did![1] Our grocery store has raspberry jam for $2.75/lb, frozen raspberries for$4.39/lb, and jam is ~40% fruit. Though since we have the freezer space likeraspberries a lot I've been buying them online,30lbat $3.08/lb shipped. Ashipment fills 6-8 one-gallon ziplocs depending on whether it ends up mostlywhole or mostly pieces. Co", "posttime": "2020-07-29 00:04:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "果酱,jam", "title": "果酱已经过时了", "title_en": "Jam Is Obsolete", "transed": 1, "url": "https://www.lesswrong.com/posts/STaFzyajfm3XK43Hj/jam-is-obsolete", "via": "", "real_tags": ["果酱", "jam"]}, {"category": "", "categoryclass": "", "imagename": "1b2882e4f234e65ce00bb031ff845186.gif", "infoid": 1014706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年秋天，True Manufacturing完成了一个酝酿已久的项目。这家专门从事商业制冷系统的公司决定放弃密苏里州总部包裹客服人员的中性隔间，转而选择重新设计，其特点是现在现代办公室中随处可见的集群式、无隔断的座椅。几个月后，随着冠状病毒迫使美国人了解社交距离和呼吸道飞沫的细节，该公司开始着手另一项倡议，这项倡议的执行要仓促得多：将员工重新划分为带有透明有机玻璃隔板的隔间。\nTrue Manufacturing的销售和市场总监史蒂文·普罗科特(Steven Proctor)告诉我：“哦，天哪，说要后退10步。”“我们刚刚推出了大型开放式办公室的概念；我们把每个人都放在办公桌上，把它们放在一起。”该公司的办公室及其突然出现的问题可能是全新的，但普罗科特和他的同事们的担忧远非独一无二。今年春天，数百万美国人试图限制他们与同事的互动，或者在家里与室友或家人一起工作，他们被迫环顾四周，想知道所有的墙都到哪里去了。根据预感，True不仅仅止步于自己的隔断-该公司订购了更多有机玻璃，确定了一些标准尺寸，并联系了当地商会，提供定制工作，相信许多其他企业也会发现自己陷入了同样的困境。订单几乎立刻就开始进来了。\n在过去的几十年里，以前细分的工作和家庭内部空间变得更加开放。私人办公室让位于性价比高的小隔间，一旦加州的科技公司成为新一代有影响力的雇主，他们的开放计划就是私人工作空间终结的开始-甚至连不起眼的小隔间也是如此。在家里，一支由HGTV房屋鳍状物和豪华翻新师组成的车队指示观众拆除那些墙壁，追求一个开放概念的生活空间。开放的计划对一些人来说是如此诱人，以至于他们催生了自己的名人：奇普(Chip)和乔安娜·盖恩斯(Joanna Gaines)这对德克萨斯州的福音派父母，通过拆除韦科的每一面内墙，成为巨星，拥有自己的生产线、商店和餐馆。\n但今年春天，无论是部分墙还是永久墙都得到了他们需要的代言人：大流行。\n在过去的几个月里，在通风、非人性化的前时代空间中展开的生活发生了变化。协作和团结已经成为疾病的媒介，更不用说开放式平面图不那么致命的问题了，比如两次Zoom通话之间没有墙是不可能发生的。一旦作为时尚和现代出售，大规模放弃限定的空间有时会让人感觉比最大的问题是听同事在电话里喋喋不休时考虑得更不周到。早在3月份，设计师、制造商和建筑师就开始为他们猜测的日常生活中的急剧变化制定计划和产品。他们是对的。个人空间终于重新流行起来，但在它被摧毁了20年后，重新创造它并不是一件简单的任务。我们必须首先决定我们想从墙里得到什么。疾病的威胁和延长的房屋隔离使平面图走出了哲学的领域，并提醒所有参与其中的人，几千年来人类一直在修建墙的必要功能原因：让其他人远离墙。\n迈向开放式计划的过程中，一切都是断断续续的。在20世纪初，弗兰克·劳埃德·赖特(Frank Lloyd Wright)的“草原”风格为开放式建筑赋予了一种视觉上的方言，随着世纪的推移，随着家政服务变得越来越负担不起，墙壁开始倒塌。如果中产阶级的母亲在照看孩子的同时不能把厨房里的厨师隔离起来，那么隐蔽的厨房就不能再用了。我的同事伊恩·博格斯特(Ian Bogost)在2018年的这一风格历史中写道：“当时，就像现在一样，(开放计划)承诺拆除障碍，促进联系。”“母亲被降级到厨房，需要看到孩子们在院子里玩耍的地方。这一关键原则将演变成更普遍地证明开放计划的合理性，但更多地考虑到母亲对室内安全范围的看法。“。HGTV的特色是大量拆除墙壁，因为拆除能造就一台好电视，它卖的不仅仅是一种设计理论-它还卖出了一个顽固的神话，即如果女性买了合适的东西，她们真的可以拥有一切。\n办公室接受完全开放的计划的速度更快。许多办公室最初部分开放给本世纪中叶的秘书人员，但随着谷歌(Google)和苹果(Apple)等硅谷科技公司及其未来主义、超休闲工作场所的崛起，这种设计在21世纪初开始被各种上班族广泛采用。它们会影响\n因此，美国发现自己在2020年初几乎没有障碍来阻止“联系”-或者打个喷嚏。到那时，无论是在工作场所还是在家里，开放式计划的局限性都已经显而易见：高天花板、硬木地板、人口稠密的办公室的嘈杂，帮助刺激了Apple AirPods的迅速采用。洗碗机现在配备了分贝等级，以确保美国“大房间”的居住者在清理晚餐时能听到蒙面歌手的声音。在其2019年的工作场所调查中，Gensler发现65%的受访者希望至少有半私人工作空间；另有四分之一的受访者希望按需访问私人空间。在国内，美国建筑师协会(American Institute Of Architects)对住宅建筑师的年度调查发现，与前一年相比，2019年和2020年对开放式布局的兴趣都出现了两位数的下降。\n尽管观点在变化，但城墙的回归并没有被广泛预测到。墙壁，甚至是新的办公室分隔物或办公桌分隔物，都既昂贵又笨重。原本没有它们就能正常运作的工作空间很难扩展到容纳它们，而那些在过去十年里花了数千美元和几个月的时间拆毁了太多房屋部分的人，可能不愿再花更多的时间和金钱来再次拥有单独的房间。\n尽管如此，以这样或那样的方式，城墙已经开始爬回它们被驱逐的地方。你可能已经看到了True Manufacturing的一些工作，但没有意识到这一点-该公司已经完成了有机玻璃隔板的订单，这些隔板通过其冷藏业务为其服务的餐饮服务和酒店客户服务，也为银行、学校系统、警察局、疗养院和NBC体育转播最近的Mecum汽车拍卖提供服务，True为此定制了带有网络标志的透明隔板。全国对隔断和隔板的需求如此之大，以至于最常用于制造隔断和隔板的材料(如有机玻璃)的供应量已经开始减少。\n对于为突然废弃的空间(餐厅、酒店、办公室)生产产品的公司来说，转向隔断也有助于他们继续削减工程师、设计师、制造商和销售人员的工资。Stylex是一家总部位于新泽西州的办公家具公司，它在3月下旬凭直觉开始计划重新修建墙壁。“我开始想，有些出于绝望，我们能做些什么，让人们在今年年底和明年真正需要做些什么呢？”Stylex的联席首席执行官布鲁斯·戈尔登告诉我。“他们可能有足够的椅子。他们可能有足够的办公桌。“。\n为了回答这个问题，他的公司推出了一款名为Quick Screens的产品-脚轮上高大、简单、覆盖着织物的隔板。当下个月该系列推出时，订单将在10天内发货，而Stylex的典型发货时间为6至8周，这是该公司有史以来最快的产品周转速度。戈尔德说，虽然新的隔断引起了一些兴趣，但冠状病毒扰乱的不仅仅是办公室的设置。商业家具行业仍在努力调整其销售技术，以适应新的常态。戈登告诉我：“通常情况下，销售人员会出去打电话--展示产品，面对面地谈论产品。”“设计师和经销商确实会登陆我们的网站，但让他们了解产品并不那么容易。但消息会传开的。“。\n在詹斯勒，豪德已经在计划让他的客户重返工作岗位。“我们看到一些有趣的动向，这些东西既不是办公室，也不是开放的环境，”他告诉我，并强调90年代的立方体农场不会再回来了。相反，豪德正在预测他的公司所称的“办公室”的崛起。它不完全是一个私人办公室，不完全是一个开放的工作区，也不完全是一个小会议室--但可能是所有这些东西。这个形象可能很难想象；这是一个狭小的、部分开放的空间，至少从理论上讲，在你努力完成最后期限的同时，你不必在几个小时内听你的办公桌邻居谈论他们的配偶。如果员工在冠状病毒感染的威胁仍然存在的情况下回到办公室，这些空间也将有助于将他们分开。豪德说，在做出更永久性的改变之前，这意味着重新组织开放式的公共区域，有时会使用Gensler的供应商之一Stylex制造的隔断。从长远来看，这意味着-是的-墙。\n在家里，事情做得比较慢。预算是个人的，而不是公司的。当员工在厨房桌子旁敲打笔记本电脑时，办公室可以很容易地改变，但没有人想同时生活在建筑工地和流行病中。尽管如此，一些住宅建筑师已经开始看到生命的迹象。美国建筑师协会主席简·弗雷德里克说，虽然生意较慢\n虽然这些选择是富人的专属领域，但拥有大量选择的人的偏好最终往往反映在收入较低的美国人的家中。“开放式厨房”和他们巨大的、大理石顶的岛屿被缩小到预算大小，用廉价的材料重新制作，塞进出租公寓的角落里，最后贴上了地铁瓷砖的背板。没有专用泥室的人会买鞋架和壁钩，把门边的区域装扮成自己的“房间”。它不是一堵墙，但在大流行期间，墙开始显得相当奢华。要有墙，你需要空间。\n在空间不足或时间紧迫的情况下，我采访过的两家制造商都希望隔断业务至少在未来六个月到一年内(如果不是更长的话)吸引新的客户和竞争对手。正如这个国家今年已经了解到的那样，有问题的口罩和假冒的洗手液，大流行恐慌性购买可能会吸引一些臭名昭著的经营者，并给绝望的公众带来意想不到的风险-即使是切下一张有机玻璃，然后把它栓到桌子或柜台上，也不像看起来那么简单。True Manufacturing的零部件营销经理史蒂夫·亚历山大(Steve Alexander)说：“丙烯酸会进入你的皮肤，割伤你，我想你宁愿用玻璃割伤。”所有的墙体都是不一样的：仓促购买的嵌板边缘没有正确完成，厚度不够坚固，或者底座相对于高度来说太窄，可能会造成比解决问题更多的问题，特别是在医院或教室等敏感环境中。亚历山大指出：“如果三四年级的学生回到学校，你不能让这些事情落在他们身上。”“这将是一个大问题。”\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。", "note_en": "Last fall, True Manufacturing completed a project long in the making. The company, which specializes in commercial refrigeration systems, had decided to abandon the neutral cubicles that had encased customer-service workers at its Missouri headquarters, opting instead for a redesign that featured the clustered, partitionless seating now ubiquitous in modern offices. A few months later, as the coronavirus forced Americans to learn the details of social distancing and respiratory droplets, the company got to work on another initiative, this one executed with considerably more haste: redividing its workers into cubicles with clear plexiglass partitions.\n   “Oh my gosh, talk about taking 10 steps back,” Steven Proctor, True Manufacturing’s director of sales and marketing, told me. “We just did the big open-office concept; we put everybody in desk shares that were right on top of each other.” The company’s office and the problems it suddenly presented might have been brand new, but the concerns of Proctor and his co-workers were far from unique. This spring, millions of Americans trying to limit their interactions with colleagues or working from home alongside roommates or family members were forced to look around and wonder where all the walls had gone. On a hunch, True didn’t stop at just its own partitions—the company ordered more plexiglass, settled on some standard sizes, and contacted the local chamber of commerce to offer itself up for custom jobs, sure that lots of other businesses would find themselves in the same bind. Orders began coming in almost immediately.\n    Over the past few decades, the formerly subdivided interior spaces of work and home got a lot more open. Private offices gave way to cost-effective cubicles, and once California tech companies became the influential employers of a new generation, their open plans were the beginning of the end of private workspaces—even the humble cubicle. At home, a cavalcade of HGTV house flippers and luxury renovators instructed viewers to  tear down those walls in pursuit of an  open-concept living space. Open plans were so tantalizing to some people that they spawned their own celebrities: Chip and Joanna Gaines, a pair of evangelical Texas parents,  became huge stars, complete with their own product lines, shops, and restaurants, by demolishing seemingly  every interior wall in Waco.\n   But this spring, walls both partial and permanent got the advocate they needed: the pandemic.\n In the past few months, the lives that unfolded in the airy, impersonal spaces of the Before Times have changed. Collaboration and togetherness have become disease vectors, to say nothing of open floor plans’ less deadly problems, such as the impossibility of two Zoom calls happening without a wall between them. Once sold as chic and modern, the wholesale abandonment of defined spaces feels at times even more ill-considered than it did when the biggest issue was listening to your co-workers yak on the phone. As early as March, designers, manufacturers, and architects started building plans and products for what they guessed might be a precipitous change in daily life. They were right. Personal space is finally back in style, but re-creating it after two decades of its destruction is hardly a straightforward task. We have to decide what we want from walls in the first place. The threat of illness and extended home quarantine took floor plans out of the realm of philosophy and reminded all involved of the necessary functional reason humans have been building walls for millennia: to keep other people away from them.\n   The march toward open-plan everything came in fits and starts. In the early 1900s, Frank Lloyd Wright’s  “Prairie” style helped give open plans a visual vernacular, and as the century progressed, walls began to fall away as domestic help became less affordable. If middle-class mothers couldn’t sequester the cook in the kitchen while they tended to the kids, then the hidden kitchen would no longer do. “Then, as now, [open plans] promised to tear down obstruction and facilitate connection,” my colleague Ian Bogost wrote in a  2018 history of the style. “The mother, relegated to the kitchen, needed to have a view of where the children were playing in the yard. This key principle would evolve to justify open plans more generally, but with a mother’s view of the safe confines of the indoors more in mind.” HGTV, which features lots of wall removal because  demolition makes for great TV, isn’t selling just a theory of design—it’s selling the persistent myth that if women buy the right things, they really  can have it all.\n    The office’s embrace of fully open plans was faster. Many offices were first partially opened for mid-century secretarial pools, but the design’s wide adoption for office workers of all kinds began in the early 2000s, with the ascendance of Silicon Valley tech companies such as Google and Apple and their futuristic, super-casual workplaces. They influence the American workplace today in much the same way that companies such as General Motors and General Electric did in the previous century.\n Randy Howder, a co-managing director of the San Francisco office for the design and architecture firm Gensler, thinks that open plans can be very effective when they’re well designed by architects who understand a particular workplace’s culture and needs, though he admits that’s not the only reason they’ve proliferated. “The angel on my left shoulder says they’re popular because there was a lot of belief in the fact that an open office engendered greater collaboration and more lateral awareness of what other colleagues are doing,” he said. “The devil on my right shoulder says it was sometimes cheaper and more cost-effective and faster to build” an open-plan office, which resulted in squished-together desks and no privacy in workplaces where people need quiet and focus. And that belief that open offices would foster teamwork?  The opposite now appears to be true.\n   So America found itself with few barriers to prevent “connection”—or to catch sneezes—at the beginning of 2020. By then, the limitations of open plans had already become clear both at work and at home: The noisiness of high-ceilinged, hardwood-floored, densely populated offices had helped spur the  rapid adoption of Apple AirPods. Dishwashers now come with decibel ratings to ensure that the occupants of America’s “great rooms” can hear  The Masked Singer over dinner cleanup. In its  2019 workplace survey, Gensler found that 65 percent of respondents wanted at least semiprivate workspaces; another quarter wanted on-demand access to private spaces. At home, the American Institute of Architects’ annual survey of residential architects found double-digit declines in interest in open layouts compared with the previous year in both  2019 and  2020.\n Despite this changing tide of opinion, the return of walls had not been widely predicted. Walls, or even new office partitions or desk dividers, are expensive and bulky. Workspaces that had been built to function without them can’t be easily expanded to accommodate them, and people who had spent thousands of dollars and months of their life knocking down too many parts of their house in the past decade might be loath to spend even more time and money to have individual rooms once again.\n  Still, in one way or another, walls have started to creep back into the places whence they had been banished. You might have already seen some of True Manufacturing’s work without realizing it—the company has filled orders for plexiglass dividers for the food-service and hospitality clients it serves through its refrigeration business, but also for banks, school systems, police departments, care homes, and the NBC Sports broadcast of a recent Mecum automotive auction, for which True customized the clear partitions with the network’s logo. Partitions and dividers have been in such demand nationwide that supplies of the materials most often used to make them, like plexiglass, have  begun to run low.\n    For companies that make products for spaces that have suddenly fallen into disuse—restaurants, hotels, offices—pivoting to partitions has also helped them continue to cut paychecks to engineers, designers, manufacturers, and salespeople. Stylex, an office-furniture company based in New Jersey, began planning for the return of walls on a hunch in late March. “I started to think, somewhat out of desperation, what could we do that people are actually going to need toward the end of this year and into next year?” Bruce Golden, Stylex’s co-CEO, told me. “They probably have enough chairs. They probably have enough desks.”\n  To answer that question, his company came up with a product called Quick Screens—tall, simple, fabric-covered partitions on casters. When the line launches next month, orders will ship in 10 days as opposed to Stylex’s typical six to eight weeks, the fastest the company has ever turned around a product. Golden said that although the new partitions have generated some interest, the coronavirus has disrupted more than just office setups. The commercial-furniture industry is still trying to adjust its sales techniques to the new normal. “Usually, the salespeople go out and they make calls—present the products, talk about the products person to person,” Golden told me. “The designers and the dealers do go onto our website, but making them aware of the products is not that easy. But the word will get out there.”\n At Gensler, Howder is already planning for his clients’ return to work. “We see some interesting movement toward things that are neither an office nor an open environment,” he told me, emphasizing that the cube farm of the ’90s is not coming back. Instead, Howder is predicting the rise of what his firm calls the “officle.” It’s not exactly a private office, not exactly an open work area, not exactly a small conference room—but maybe it’s all those things. The image can be hard to conjure; it’s a small, partially open space where, at least theoretically, you don’t have to listen to your desk neighbors talk about their spouse for a couple of hours while you try to hit a deadline. These spaces would also help separate workers if they  return to the office while the threat of coronavirus infection remains. Before more permanent changes can be made, Howder said, that means reorganizing open-plan common areas, sometimes with partitions such as those made by Stylex, which is one of Gensler’s suppliers. In the long term, that means—yes—walls.\n   In homes, things work more slowly. The budgets are personal instead of corporate. Offices can be altered with ease while employees clack away on laptops at their kitchen tables, but no one wants to live in a construction site and a pandemic simultaneously. Still, some residential architects have started to see signs of life. Jane Frederick, the president of the American Institute of Architects, says that although business is slower than normal at her Beaufort, South Carolina, residential-design firm, the phone has started to ring again. “We’re getting quite a few calls because I think people are pent up in their houses, and they’re going crazy,” Frederick told me. “But they’re very nervous to pull the trigger.” She wasn’t shocked to hear that people wanted to renovate after staring at their own walls for months on end. “If you moved into an existing space, you just made your life work around whatever rooms were there,” Frederick said. “You might have been using the dining room as an office, but it doesn’t really work now, because if someone is in the kitchen grinding coffee, you can hear it on your Zoom call.” Even amid a worsening pandemic in the state, the small firm has booked a handful of new projects.\n    Frederick told me that, at least in her practice, interest in open plans was never quite as extreme as the transformations frequently depicted on HGTV, a channel she said she doesn’t watch, because of the unrealistic expectations it engenders in novice renovators. But the past few years have seen a definite uptick in desire for more defined rooms—just not at the front of the house. “You used to have one room that was sort of your mudroom, laundry room, and pantry, and now those typically are three different rooms” in the home’s rear, Frederick told me. In new homes and high-end renovations, unsightly chores have gotten their own dedicated spaces, away from the presentation area of the open kitchen. Frederick expects demand for these kinds of spaces to continue to rise during and immediately after the pandemic, as people prize a separation between the “dirty” and “clean” areas of a home. The same search for separation (but without the cleanliness concern) has happened with the living room—more of Frederick’s clients have started to request spaces for yoga, reading, or meditation elsewhere in their home, seeking seclusion for activities that might have previously been done in the now-open area.\n   Although these choices are the province of the wealthy, the preferences of people with lots of choices often end up reflected in the homes of Americans with more modest means down the line. “Open kitchens” and their immense, marble-topped islands get shrunk down to budget sizes and remade in cheap materials, tucked into the corners of rental apartments and finished with a subway-tile backsplash. People without a dedicated mudroom buy shoe racks and wall hooks to dress up the area near their door as a “room” unto itself. It isn’t a wall, but during a pandemic, walls have started to seem pretty luxurious. To have walls, you need space.\n Where space isn’t available, or when time is of the essence, both manufacturers that I spoke with expect the partition business to attract new customers and competitors for at least the next six months to a year, if not longer. And as the country has already learned this year with  faulty masks and  fake hand sanitizer, pandemic panic-buying can attract some unsavory operators and pose unforeseen risks to a desperate public—even cutting into a sheet of plexiglass and bolting it to a desk or counter isn’t as straightforward as it might seem. “That acrylic gets in your skin and cuts you, and I think you’d rather get cut with glass,” said Steve Alexander, True Manufacturing’s parts-marketing manager. Walls, in all their variations, aren’t created equally: Hastily purchased panels that haven’t been properly finished at the edges, that aren’t thick enough to stand rigidly, or whose bases are too narrow for their height could cause more problems than they solve, especially in sensitive environments such as hospitals or classrooms. “You can’t have these things fall on third or fourth graders if they go back to school,” Alexander noted. “That would be a big problem.”\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.", "posttime": "2020-07-29 00:04:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "规划,open,办公室", "title": "开放式规划万物的终结", "title_en": "The End of Open-Plan Everything", "transed": 1, "url": "https://www.theatlantic.com/technology/archive/2020/07/walls-pandemic-open-plan/614590/", "via": "", "real_tags": ["规划", "open", "办公室"]}, {"category": "", "categoryclass": "", "imagename": "23cf4ba8195954440926540340ade45e.png", "infoid": 1014704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有多少人注意到WSL2对于从Windows10开发新软件应用程序的开发者来说是多么重要，使它成为一个真正的开发箱，其中不再需要双引导，也不再需要为Linux操作系统使用那些GB的未使用空间而有一个单独的分区，担心以后升级或修补该分区，或者在你的HD中没有使用这些GB的空间。我们现在是在一个新的世界里，微软已经完全接受了Linux及其对社区的好处，我现在也相信微软喜欢开源和Linux，我相信集装化肯定是我们带来这种势头的原因，所以感谢Linux、Ubuntu、Docker、Kubernetes和微软的这件艺术品。\n我在这里的目标只是向你展示如何使用WSL2快速启动和运行环境，另外还有一个GUI环境，如果你有任何问题，请在评论中让我知道，这样我就可以尝试帮助你，如果你喜欢的话，也一定要让我知道。\nWindows10的版本是2004年，最低版本是19041，通常在Windows10的更新中提供，甚至家庭版也是如此。键入Windows+R，然后运行Winver&#34；。如果你还不在那里，那就继续运行你会得到的Windows更新。\n我会把来自微软的说明URL留在这里，他们已经很好地覆盖了它。\n在Linux方面，我个人推荐微软商店提供的最新Ubuntu版本，现在就是Ubuntu20.04LTS。\n任何时候你想要在Windows端看到一个gui应用程序，你都需要运行这个配置，这样你就可以保存它，如果你想从linux IDE可视化任何东西，比如浏览器或任何其他软件，只要在需要的时候运行配置文件即可。\n现在，您可以在Ubuntu上安装Docker或不安装Docker，这取决于您是否拥有NodeJS、.Net Core、Java、Python或任何您想要的东西，并开始使用您的新开发环境。VSCode WSL扩展也可以与Docker容器一起使用，通过我提供的设置，我们不仅可以处理服务器代码，还可以处理任何与桌面相关的代码，您可能还想在Windows和Linux上使用许多项目来测试和调试这些代码，或者您可能想要查看Web项目在Linux浏览器上的外观和呈现方式，IDE也会考虑调试方面，这有更多的可能性。", "note_en": "Not a lot of people noticed what a big deal WSL2 is for developers of new software applications from a Windows 10 and making it a true dev box in which there&#39;s no more need for dual-boot or having a separate partition for that Linux OS with those GBs of unused space, being worried about upgrading or patching that Partition later on or having those GBs unused in your HD. We are in a new world now and Microsoft has fully embraced Linux and its benefits for the community, I now also believe that Microsoft loves open source and Linux and I believe that Containerization is certainly what has brought us to this momentum so thank you Linux, Ubuntu, Docker, Kubernetes and Microsoft for this piece of art.\n My objective here is to just show you how to get and environment up and running quickly with WSL2 and plus having a GUI environment with it, if you have any issues please let me know in the comments so I can try to help, if you like it make sure to let me know too.\n    Windows 10 with the version 2004 and at least build 19041, which is generally available in the Windows 10 update of even a Home Edition. Type in Windows+R and then run &#34;winver&#34;. If you&#39;re not there yet keep on running the windows updates that you&#39;ll get there.\n   I will leave the instructions URL from microsoft here they have it very well covered.\n  On the linux side I personally recommend from the Microsoft Store the latest Ubuntu version available, right now Ubuntu 20.04 LTS.\n          Any time you want to see a gui application on the Windows side you will need to run this configuration so you can save it and just run the configuration file when needed if you want to visualize anything from Linux IDE like browser or any other software.\n                             You can now install Docker on Ubuntu or not, up to you and have NodeJS, .Net Core, Java, Python or whatever you want and start working with your new dev environment. The VSCode WSL Extension works with Docker containers as well, with the setup I provided you&#39;re not limited to working in server code but also on working on Any Desktop related code that maybe you also want to test and debug on Windows and Linux with many projects or maybe you want to see the look and feel of a web project on how it looks and renders on a Linux browser instead, many more possibilities with IDE also thinking about debugging aspects.", "posttime": "2020-07-29 00:03:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,windows-10,windows,环境,environment", "title": "Windows 10开发环境-带WSL2和GUI环境的VScode", "title_en": "The Windows 10 Dev Environment – VSCode with WSL2 and GUI Environment", "transed": 1, "url": "https://www.linkedin.com/pulse/windows-10-dev-environment-vscode-wsl2-gui-ramon-lima", "via": "", "real_tags": ["开发", "windows", "环境"]}, {"category": "", "categoryclass": "", "imagename": "3b9a98321111f37a3b8736fa15ef7e69.jpg", "infoid": 1014703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在开发汽车的过程中，我们面临着不断变化的规格和不稳定的数据。在这次演讲中，我将展示我们是如何使用泛函概念的。", "note_en": "While working on a development cars we face constantly changing specifications with unstable data. In this talk, I will show how we used Functional concept t...", "posttime": "2020-07-29 00:03:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "驾驶,transformers,汽车", "title": "自动驾驶图像处理中的单点变压器和类型类", "title_en": "Monad Transformers and Type Classes in Autonomous Driving Image Processing BMW", "transed": 1, "url": "https://www.youtube.com/watch?v=ScSRn-UOIv0", "via": "", "real_tags": ["驾驶", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "d096278d982cd1f7b67ef457cc34788b.jpg", "infoid": 1014702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编者按：“大西洋月刊”正在向所有读者提供有关冠状病毒的重要报道。在这里找到收藏品。\n随着疫情的蔓延，消灭新冠肺炎的所有希望都寄托在一种仍然是假设的疫苗上。因此，一种呼声开始流行起来：我们可能不得不呆在家里--直到我们有了疫苗。关闭学校--直到我们有了疫苗。戴上口罩--但只有在我们有疫苗之前。在这几个月的苦难中，这句咒语带来了一线希望。正常的生活在另一边，我们只需要等待--直到我们有了疫苗。\n特朗普政府早在10月份就对疫苗做出了极其乐观的预测，媒体对疫苗试验的详细报道也助长了这些希望。每周都会传来“早期成功”、“有希望的初步结果”的消息，股票也会因为“疫苗乐观”而上涨。但新冠肺炎疫苗不太可能满足所有这些高期望。疫苗可能不会使疾病消失。它肯定不会立即让生活恢复正常。\n从生物学上讲，新冠肺炎病毒的疫苗不太可能提供完全的保护。在后勤方面，制造商将不得不生产数亿剂疫苗，同时可能依赖以前从未用于疫苗的技术，并竞争玻璃瓶等基本供应。然后，联邦政府将不得不分配剂量，可能是通过州和地方卫生部门拼凑起来的，目前还没有为成年人大规模接种疫苗的基础设施。疾病控制和预防中心(Centers For Disease Control And Prevention)过去曾领导过疫苗分发工作，但到目前为止，该中心在讨论中明显缺席-这一令人担忧的迹象表明，以美国大流行为特征的领导层失误也可能阻碍这一进程。让事情更复杂的是，已经有20%的美国人表示他们将拒绝接种新冠肺炎疫苗，另外还有31%的人不确定，要达到群体免疫力可能要困难得多。\n好消息，因为值得一提的是，专家认为会有新冠肺炎疫苗。导致新冠肺炎的病毒似乎并不像艾滋病病毒那样是异类。科学家们已经在创纪录的时间内从发现病毒到超过165种候选疫苗，其中27种疫苗已经在人体试验中。人体试验至少包括三个阶段：安全性的第一阶段，有效性和剂量的第二阶段，以及对数万人的庞大群体的有效性的第三阶段。至少有六种新冠肺炎疫苗正在或即将进入三期试验，这还需要几个月的时间。\n假设临床试验取得了完美的效果，我们已经进入大流行将近五个月了，可能还会有五个月的时间来自安全有效的疫苗。美国食品和药物管理局(Food And Drug Administration)前首席科学家杰西·古德曼(Jesse Goodman)说：“即使引入了疫苗，我认为我们也会有几个月的重大感染，或者至少有感染的风险值得期待。”\n所有这一切意味着，我们可能要在冠状病毒的威胁下忍受比我们已经存活的更多的几个月。如果没有在欧洲和亚洲大部分地区击退病毒的措施，未来将继续有更多的疫情爆发，更多的学校关闭，更多的孤独，更多的死亡。一种疫苗，当它可用时，将只标志着一个漫长而缓慢的下降的开始。而减少疫苗需要多长时间，将取决于疫苗的效力，能否成功提供数亿剂疫苗，以及人们是否愿意接种疫苗。一想到前面还有苦难，真是太可怕了。更容易想到疫苗的前景。\n“这些疫苗带来了很大的希望，”世界卫生组织墨尔本流感合作中心主任坎塔·苏巴拉奥(Kanta Subbarao)说，他也致力于其他冠状病毒疫苗的研究。“没有人愿意听到它不是就在拐角处。”\nV，本质上是一种激活免疫系统而不生病的方法。它们可以用弱化的病毒、灭活的病毒、来自病毒的蛋白质、移植到无害病毒上的病毒蛋白，甚至只是编码病毒蛋白的mRNA制成。接触疫苗有点像是从疾病中幸存了一次，没有任何缺点。关于新冠肺炎的长期免疫反应仍有很多未知之处，但正如我的同事德里克·汤普森所解释的那样，我们有充分的理由相信，接种新冠肺炎将在某种程度上预防未来的感染。\n然而，疫苗诱导的免疫力往往比感染后产生的免疫力弱。疫苗通常是直接注射到肌肉中。一旦你的身体识别到外来入侵者，它就会产生免疫反应，例如，产生在血液中循环的持久抗体。\n但是呼吸道病毒通常不会进入肌肉。毕竟，它们会感染呼吸系统，而且它们通常会通过鼻子和喉咙的粘膜潜入。虽然疫苗注射会在血液中诱导抗体，但不会在粘膜中诱导很多抗体，这意味着它们不太可能阻止病毒进入人体。但它们仍然可以保护身体深处的组织，如肺部，从而防止感染恶化。“接种疫苗的主要好处将是预防严重疾病，”苏巴拉奥说。新冠肺炎疫苗不太可能达到科学家所说的“无菌免疫”，即完全预防疾病。\n提高呼吸道病毒疫苗效力的一种方法是模仿自然感染，将活的但减弱的病毒喷洒到鼻子里。例如，FluMist含有减弱的流感病毒，少数研究小组正在研究新冠肺炎的策略。但是活病毒疫苗风险更大，因为病毒是活的。马里兰大学疫苗发展和全球健康中心主任凯瑟琳·诺伊尔说：“我们不想在人们的鼻子上喷洒冠状病毒，直到我们完全确定它实际上是一种不会在人与人之间传播的病毒，也不会让人生病。”“这只需要时间。”\n然而，对于第一代疫苗来说，速度是至关重要的。最初的疫苗可能会限制新冠肺炎的严重程度，但不会完全阻止其传播。考虑接种流感疫苗，而不是脊髓灰质炎疫苗。美国食品药品监督管理局的新冠肺炎疫苗指南承认，它可能远不是100%有效；该机构说，要获得批准，疫苗应该预防或减少至少50%的接种者的严重疾病。“这显然并不理想，”曾担任国家免疫项目主任的埃默里大学疫苗研究员沃尔特·奥伦斯坦(Walter Orenstein)说。“但这总比零要好。”\n第一，多个疫苗组织已经发布了有希望的数据，表明他们的候选疫苗可以在实验室测试中诱导出中和冠状病毒的抗体。他们的下一个挑战是规模：在有数万人参加的第三阶段试验中测试疫苗，以证明它可以防止现实世界中的感染，然后，如果它有效，就会生产数亿剂，甚至数十亿剂。这就是为什么即使是已经在少数人身上进行了测试的疫苗也还需要几个月的时间。\n第三阶段试验是三个阶段中规模最大、持续时间最长的--通常情况下，它们需要数年时间，但由于大流行，它们正被压缩到几个月。尽管如此，疫苗制造商需要招募数万人来确认有效性，并寻找罕见的长期副作用。招募参与者需要时间，需要等待他们自然接触新冠肺炎的时间，需要任何长期副作用显现的时间，也需要简单分析所有数据的时间。\n反常的是，新冠肺炎在美国的高比率和不断上升的比率确实让这里的候选疫苗测试变得更容易。任何给定的参与者都更有可能在某个时候接触到病毒。“无论如何，这对我们的国家都不是好消息，但…。约翰·霍普金斯大学免疫研究中心主任Ruth Karron说，她也是现代疫苗第二阶段试验的数据和安全监测委员会的成员，她说：“这使得积累病例成为可能。”她是约翰·霍普金斯大学免疫研究中心的主任，也是现代疫苗第二阶段试验的数据和安全监测委员会的成员。美国现代制药公司正在美国进行第三阶段试验。牛津大学的一个团队正与总部位于英国的生物技术公司阿斯利康合作，正在英国、巴西和南非进行试验，后两个国家之所以被选中，是因为后两个国家的新冠肺炎病例数量较多。*\n在美国，特朗普政府的“翘曲速度行动”(Operation Warp Speed)正在帮助几家疫苗制造商在这些试验进行期间投资于生产设施。这可以缩短疫苗批准和上市之间的滞后时间，因为公司可能会在扩大生产之前等待FDA的批准。但是，制造数亿剂疫苗仍然是一个相当大的挑战，特别是对于一种新型疫苗来说。\n领先的新冠肺炎候选疫苗依赖于以前从未在批准的疫苗中使用过的技术。例如，摩德纳的疫苗是一段编码冠状病毒蛋白的RNA。牛津和阿斯利康的疫苗将冠状病毒蛋白附着在黑猩猩的腺病毒上。这两种产品以前都没有按必要的规模生产。\n想想2009年发生的事情，那是最近一次全世界动员起来生产疫苗来阻止大流行。这种疾病是H1N1，通常被称为“猪流感”，疫苗制造商有一个简单得多的任务，就是将H1N1毒株亚种到他们每年生产的季节性流感疫苗中。尽管在制造流感疫苗方面有很多年的经验，但制造商遇到了意想不到的障碍。大多数流感疫苗是由鸡蛋中生长的病毒制成的，出于某种原因，H1N1毒株一开始在鸡蛋中生长得不是很好。2009年领导FDA大流行应对的古德曼说：“从给定数量的鸡蛋中产生的数量比正常水平要低得多。”“所以这真的耽误了时间。”古德曼说，然后，一旦数百万剂疫苗投入使用，就没有足够的设施可以将散装疫苗装进单独的瓶子里。\n卫生与公众服务部创建了一个填充式设施网络，以在未来解决这个问题。目前，“翘曲速度行动”还在授予合同，生产包装新冠肺炎疫苗所需的数以百万计的注射器和玻璃瓶。如果在这些方面没有仔细的规划，美国可能会陷入一种士气低落的情况，即可以获得疫苗，但没有办法将疫苗实际送到人们手中。\n这一切进展顺利-最早的候选疫苗有效，试验迅速结束，技术奏效-另一项艰巨的任务摆在面前：当疫苗获得批准时，3亿剂疫苗不会一下子全部获得，需要一个系统向公众分发有限的供应。事实证明，这正是美国政府在这场大流行中毫无准备的那种挑战。\n在甲型H1N1流感大流行期间，美国政府购买了疫苗，并将剂量分配给州和地方卫生部门，这些部门又通过大众诊所以及雇主、学校、医院、药房和医生办公室为人们接种疫苗。在全国范围内，该计划最终为大约四分之一的美国人接种了疫苗-需求下降，因为大流行本身在疫苗上市后不久就达到了顶峰。\n2009年的疫苗接种计划建立在儿童疫苗计划的基础设施上，根据该计划，疾控中心为通常没有保险或接受医疗补助的儿童购买疫苗，并向各州分发疫苗。在这些项目中工作的免疫经理非常精通疫苗储存和分发的错综复杂，比如为可能在室温下失效的疫苗维持冷链。但由于他们从事儿童疫苗的工作，他们主要与儿科医生的办公室打交道。“我们与医院、内科医生和给成年人接种疫苗的人没有关系，”2009年田纳西州免疫项目主任凯利·摩尔(Kelly Moore)说。同年8月，在他们收到第一批疫苗的两个月前，摩尔的团队在州免疫登记上创建了一个注册，并在每周五发送一份时事通讯，上面有处理疫苗的更新和培训模块。\n“不幸的是，”摩尔说，“这个网络没有得到维护，因为我们已经11年没有其他疫苗可以送到他们那里了。”联系信息已过期。对于新冠肺炎来说，为成年人重建这个网络将更加重要。尽管H1N1疫苗被推荐给所有年龄段的人，但重点是儿童，对他们来说，流感特别危险。新冠肺炎的情况正好相反，它更多的是对老年人的威胁。\n一些领先的新冠肺炎候选疫苗也可能带来新的后勤挑战，如果它们需要在零下80摄氏度或多剂的温度下储存才能有效。事实上，新冠肺炎疫苗很可能需要两剂；第一剂启动免疫系统，允许第二剂诱导更强的免疫反应。官员们将不得不平衡给尽可能多的人一剂和给那些已经有一剂的人第二剂。“这是我们在2009年没有面对的复杂情况，我们非常感激，”摩尔说。\n尽管疾控中心在2009年率先发放甲流疫苗，但免疫管理者协会的执行董事克莱尔·汉南说，该机构自4月份以来一直对新冠肺炎疫苗的计划保持奇怪的沉默。她说：“起初，我们马上就与疾控中心进行了计划通话。”“然后就什么都没有了。”她曾试图联系“翘曲速度行动”(Operation Warp Speed)，但未获成功，该行动暗示国防部也可能参与疫苗分发。“我们继续问疾控中心很多很多问题。他们不知道，“她说。\n疾控中心的免疫实践咨询委员会通常也负责就如何优先接种疫苗提出建议。该委员会由外部专家组成，上一次开会是在6月下旬，当时他们讨论了优先为医护人员、老年人和有潜在疾病的人接种疫苗。考虑到新冠肺炎病例中的种族差异，他们还考虑按种族优先接种疫苗。但现在，美国国家医学科学院(National Academy Of Medicine)正就同一主题召开一个小组会议，这再次引起了对谁应该负责做出这些决定的困惑。\n2009年，摩尔的工作是将疾控中心顾问委员会的建议付诸实践。每周两三次，她都会收到疾控中心疫苗分销商的电子邮件，告诉她整个州可用的剂量。然而，在实践中，即使是最优先的群体，如卫生保健工作者，第一批疫苗可能也不足以覆盖所有人。这是由像摩尔这样的人来决定哪家医院得到了多少剂量，并承诺下周会有更多的剂量。然后，个别医院根据优先状态给员工实际接种疫苗。\n这一系统旨在灵活应对当地情况，但它也意味着疫苗的可用性似乎因地而异。例如，德克萨斯州立大学(Texas State University)研究疫苗的人类学家艾米丽·布伦森(Emily Brunson)表示，2009年有这样的案例，一个学区严格解读建议，只给高优先级群体接种疫苗，而邻近的学区则向任何想要疫苗的人提供疫苗。通过纽约的员工健康中心分发疫苗的决定，碰巧包括几家华尔街公司，也引起了巨大的反弹。“有很多方式可以曲解事情，”布伦森说。在最初的短缺期间，这些决定可能会让人感觉不公平-特别是考虑到疫情早些时候播下的紧张局势，当时富人和名人接受新冠肺炎检测，而普通人在诊所被拒之门外。\n如果到目前为止的大流行有任何迹象的话，那么疫苗接种计划很可能是在党派偏见和错误信息的背景下进行的。关于新冠肺炎疫苗的阴谋论已经在传播，其中一些完全是离奇的。但是，对速度的强调-就像“扭曲速度行动”中的那样-也引发了人们对疫苗仓促上市的真正担忧。在周二与五家疫苗制造商举行的国会听证会上，该公司官员不得不反复驳斥该行业可能为新冠肺炎疫苗偷工减料的想法。\n“我们将面临这样一种情况，一些人会不顾一切地想要接种疫苗，一些人会害怕接种疫苗。可能会有很多介于两者之间或不太确定的人，“乔治敦大学的公共卫生研究员迈克尔·斯托托说。一种疫苗，特别是一种不能对新冠肺炎提供完全保护的新型疫苗，需要就风险进行仔细的沟通。他补充说：“事实上，我们不能直接面对戴口罩的问题，这会让我们更难做到这一点。”鉴于目前有很多美国人不确定或反对接种新冠肺炎疫苗，美国国家过敏和传染病研究所所长安东尼·福奇警告称，如果太多人拒绝接种疫苗，即使是疫苗也可能无法让国家产生群体免疫力。\n对于寄希望于疫苗的美国人来说，拙劣的推出可能会让人觉得这是新冠肺炎时代又一个失败的例子。这可能会产生灾难性的后果，其持续时间远远超出大流行本身。布伦森担心这样的\n对于新冠肺炎疫苗仍然存在的所有不确定性，几位专家愿意做出一个预测。“我认为容易回答的问题是，‘这个病毒会消失吗？’答案是，‘不，’“约翰霍普金斯大学的疫苗专家卡伦说。这种病毒已经传播得太广了。疫苗仍然可以减轻严重病例；它可以让新冠肺炎更容易相处。病毒很可能会留在这里，但最终，大流行将会结束。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。", "note_en": "Editor’s Note:  The Atlantic is making vital coverage of the coronavirus available to all readers. Find the collection  here.\n   N  into the pandemic, all hopes of extinguishing COVID-19 are riding on a still-hypothetical vaccine. And so a refrain has caught on: We might have to stay home—until we have a vaccine. Close schools—until we have a vaccine. Wear masks—but only until we have a vaccine. During these months of misery, this mantra has offered a small glimmer of hope. Normal life is on the other side, and we just have to wait—until we have a vaccine.\n   Feeding these hopes are the Trump administration’s exceedingly rosy projections of a  vaccine as early as October, as well as the media’s blow-by-blow coverage of vaccine trials. Each week brings news of “ early success,” “ promising initial results,” and stocks rising because of “ vaccine optimism.” But a COVID-19 vaccine is unlikely to meet all of these high expectations. The vaccine probably won’t make the disease disappear. It certainly will not immediately return life to normal.\n Biologically, a vaccine against the COVID-19 virus is unlikely to offer complete protection. Logistically, manufacturers will have to make hundreds of millions of doses while relying, perhaps, on technology never before used in vaccines and competing for basic supplies such as glass vials. Then the federal government will have to allocate doses, perhaps through a patchwork of state and local health departments with no existing infrastructure for vaccinating adults at scale. The Centers for Disease Control and Prevention, which has led vaccine distribution efforts in the past, has been strikingly absent in discussions so far—a worrying sign that the leadership failures that have characterized the American pandemic could also hamper this process. To complicate it all,  20 percent of Americans already say they will refuse to get a COVID-19 vaccine, and with another 31 percent unsure, reaching herd immunity could be that much more difficult.\n    The good news, because it is worth saying, is that experts think there will be a COVID-19 vaccine. The virus that causes COVID-19 does not seem to be an outlier like HIV. Scientists have gone from discovery of the virus to more than 165 candidate vaccines in record time, with  27 vaccines already in human trials. Human trials consist of at least three phases: Phase 1 for safety, Phase 2 for efficacy and dosing, and Phase 3 for efficacy in a huge group of tens of thousands of people. At least six COVID-19 vaccines are in or about to enter Phase 3 trials, which will take several more months.\n  We are almost five months into the pandemic and  probably another five from a safe and effective vaccine—assuming the clinical trials work out perfectly. “Even when a vaccine is introduced,” says Jesse Goodman, the former chief scientist at the Food and Drug Administration, “I think we will have several months of significant infection or at least risk of infection to look forward to.”\n  All of this means that we may have to endure more months under the threat of the coronavirus than we have already survived. Without the measures that have beat back the virus in much of Europe and Asia, there will continue to be more outbreaks, more school closings, more loneliness, more deaths ahead. A vaccine, when it is available, will mark only the beginning of a long, slow ramp down. And how long that ramp down takes will depend on the efficacy of a vaccine, the success in delivering hundreds of millions of doses, and the willingness of people to get it at all. It is awful to contemplate the suffering still ahead. It is easier to think about the promise of a vaccine.\n “There’s a lot of hope riding on these vaccines,” says  Kanta Subbarao, the director of the World Health Organization’s flu collaborating center in Melbourne, who has also worked on other coronavirus vaccines. “Nobody wants to hear it’s not just right around the corner.”\n V , in essence, a way to activate the immune system without disease. They can be made with weakened viruses, inactivated viruses, the proteins from a virus, a viral protein grafted onto an innocuous virus, or even just the mRNA that encodes a viral protein. Getting exposed to a vaccine is a bit like having survived the disease once, without the drawbacks. A lot remains unknown about the long-term immune response to COVID-19, but,  as my colleague Derek Thompson has explained, there are good reasons to believe getting COVID-19 will protect against future infections in some way.\n  Vaccine-induced immunity, though, tends to be weaker than immunity that arises after an infection. Vaccines are typically given as a shot straight into a muscle. Once your body recognizes the foreign invader, it mounts an immune response by, for example, producing long-lasting antibodies that circulate in the blood.\n    But respiratory viruses don’t normally fling themselves into muscle. They infect respiratory systems, after all, and they usually sneak in through the mucous membranes of the nose and throat. Although vaccine shots induce antibodies in the blood, they don’t induce many in the mucous membranes, meaning they’re unlikely to prevent the virus from entering the body. But they could still protect tissues deeper in the body such as the lungs, thus keeping an infection from getting worse. “The primary benefit of vaccination will be to prevent severe disease,” says Subbarao. A COVID-19 vaccine is unlikely to achieve what scientists call “sterilizing immunity,” which prevents disease altogether.\n  One way to boost the effectiveness of a respiratory-virus vaccine is to mimic a natural infection, by spraying live but weakened virus into the nose. FluMist, for example, contains weakened flu viruses, and  a handful of research groups are looking into the strategy for COVID-19. But live virus vaccines are riskier because, well, the virus is live. “We don’t want to be spraying coronavirus up people’s noses until [we] are absolutely sure that it’s actually a virus that can’t spread from person to person and that it can’t make somebody sick,” says  Kathleen Neuzil, the director of the University of Maryland’s Center for Vaccine Development and Global Health. “It will just take time.”\n With this first generation of vaccines, though, speed is of the essence. An initial vaccine might limit COVID-19’s severity without entirely stopping its spread. Think flu shot, rather than polio vaccine.  The FDA’s guidelines for a COVID-19 vaccine recognize it may be far from 100 percent effective; to win approval, the agency says, a vaccine should prevent or reduce severe disease in at least 50 percent of people who get it. “That’s obviously not ideal,” says  Walter Orenstein, a vaccine researcher at Emory University who previously worked as the director of the National Immunization Program. “But it’s better than zero percent.”\n  I , multiple vaccine groups have  released promising data that show their candidates can induce  antibodies  that neutralize  the coronavirus  in lab tests. Their next challenges are about scale: testing the vaccine in a Phase 3 trial with tens of thousands of people to prove it prevents infection in the real world, and then, if it works, manufacturing hundreds of millions, even billions, of doses. This is why even a vaccine that has already been tested in small numbers of people is still many months away.\n Phase 3 trials are the largest and longest of the three phases—normally, they would take years, but they’re being compressed into months because of the pandemic. Still, vaccine makers need to enroll tens of thousands of people to confirm efficacy and to look for rare and long-term side effects. It will take time to recruit participants, time to wait for them to be naturally exposed to COVID-19, time for any long-term side effects to show up, and time to simply analyze all of the data.\n    Perversely, the high and rising rates of COVID-19 in the United States do make it easier to test vaccine candidates here. Any given participant is more likely to get exposed to the virus at some point. “It’s not good news for our country in any way, shape, or form, but … it makes it possible to accumulate cases,” says  Ruth Karron, the director of the Center for Immunization Research at Johns Hopkins University, who also served on the Data and Safety Monitoring Board for Moderna’s Phase 2 vaccine trial. Moderna, an American company, is conducting its Phase 3 trial in the U.S. A group based at the University of Oxford, which is collaborating with the U.K.-headquartered biotech company AstraZeneca, is running trials in Britain, Brazil, and South Africa—the latter two countries chosen specifically  because of their high numbers of COVID-19 cases . *\n  In the U.S., the Trump administration’s  Operation Warp Speed is helping several vaccine makers invest in manufacturing facilities while these trials are ongoing. This could reduce the lag time between the approval and the availability of a vaccine, since companies might otherwise wait for FDA approval before scaling up manufacturing. But making hundreds of millions of doses is still a considerable challenge, especially for a novel vaccine.\n  The leading COVID-19 vaccine candidates rely on technology that’s never been used before in approved vaccines. Moderna’s vaccine, for example, is a piece of RNA that encodes a coronavirus protein. Oxford and AstraZeneca’s vaccine attaches a coronavirus protein to a chimpanzee adenovirus. Neither has been manufactured before on the necessary scale.\n Consider what happened in 2009, the most recent time the world mobilized to produce vaccines to stop a pandemic. The disease was H1N1, more commonly known as the “swine flu,” and vaccine makers had the much simpler task of subbing the H1N1 strain into the seasonal flu vaccine they make every year. Despite many, many years of experience in making flu vaccines, the manufacturers hit an unexpected snag. Most flu vaccines are made from viruses grown in chicken eggs, and for some reason, the  H1N1 strain did not grow very well in the eggs at first. “The amounts produced from a given amount of eggs were much lower than normal,” says Goodman, who led the FDA’s pandemic response in 2009. “So that really delayed things.” Then, once millions of doses were in the works, Goodman says, there weren’t enough facilities that could package the bulk vaccine into individual vials.\n  The Department of Health and Human Services created a network of  fill-and-finish facilities to address this problem in the future. Right now, Operation Warp Speed is  also awarding contracts to make the millions of syringes and glass vials needed to package a COVID-19 vaccine. Without careful planning on these fronts, the U.S. could run into a demoralizing scenario where vaccines are available, but there is no way to physically get them to people.\n    E  of this goes well—the earliest candidates are effective, the trials conclude quickly, the technology works—another huge task lies ahead: When vaccines are approved, 300 million doses will not be available all at once, and a system is needed to distribute limited supplies to the public. This is exactly the sort of challenge that the U.S. government has proved unprepared for in this pandemic.\n In the H1N1 pandemic, the U.S. government purchased the vaccines and allocated doses to state and local health departments, which in turn vaccinated people through mass clinics as well as employers, schools, hospitals, pharmacies, and doctor’s offices. Nationwide, the program eventually vaccinated about  a quarter of all Americans—demand fell because the pandemic itself peaked not long after the vaccine became available.\n  The 2009 vaccination program was built on the infrastructure of the  Vaccines for Children Program, in which the CDC buys and distributes vaccines to states for children who usually are uninsured or on Medicaid. Immunization managers who work in these programs are well versed in the intricacies of vaccine storage and distribution, such as maintaining a cold chain for vaccines that could become ineffective at room temperature. But because they work with children’s vaccines, they deal mostly with pediatrician’s offices. “We didn’t have relationships with hospitals and internists and people who vaccinated adults,” says  Kelly Moore, who was the director of the Tennessee Immunization Program in 2009. In August that year, two months before they got their first shipment of the vaccine, Moore’s team created a sign-up on the state immunization registry and sent out a newsletter every Friday with updates and training modules for handling vaccines.\n “Unfortunately,” says Moore, “that network has not been maintained because we haven’t had other vaccines to send them in 11 years.” Contact information is out of date. Rebuilding this network for adults will be even more important with COVID-19. Although the H1N1 vaccine was recommended for all ages, the focus was on kids, for whom the flu was particularly dangerous. The opposite is true of COVID-19, which is more of a threat to older adults.\n  Some of the leading COVID-19 vaccine candidates could also pose new logistical challenges, if they require storage at  temperatures as low as –80 degrees Celsius or multiple doses to be effective. In fact, a COVID-19 vaccine is quite likely to  require two doses; the first primes the immune system, allowing the second to induce a stronger immune response. Officials would have to balance giving one dose to as many people as possible with giving a second dose to those who already had one. “That was a complication we didn’t face in 2009, and we were so grateful,” says Moore.\n    Although the CDC took the lead in distributing H1N1 vaccines in 2009, Claire Hannan, the executive director of the Association of Immunization Managers, says the agency has been oddly silent about plans for a COVID-19 vaccine since April. “Initially, we were having planning calls with CDC right away,” she says. “And then nothing.” She has unsuccessfully tried to get in touch with Operation Warp Speed, which  has suggested the Department of Defense may also get involved in vaccine distribution. “We continue to ask CDC these many, many questions. And they don’t know,” she says.\n  The CDC’s Advisory Committee on Immunization Practices is also normally responsible for recommendations on how to prioritize vaccines. The committee, which is composed of outside experts, last met in late June, when they  discussed prioritizing vaccines for health-care workers, the elderly, and those with underlying conditions. They also considered prioritizing vaccination by race, given the  racial disparities in COVID-19 cases. But now the National Academy of Medicine is convening a panel on the same topic, which is  again causing confusion about who is responsible for making these decisions.\n In 2009, Moore’s job was to put the CDC advisory committee’s recommendations into practice. Two or three times a week, she would get an email from the CDC’s vaccine distributor letting her know the number of doses available for her entire state. In practice, though, an initial shipment of vaccines might not be enough to cover everyone in even the highest priority group, such as health-care workers. It was up to people like Moore to decide which hospital got how many doses, with the promise of more on the way next week. Then individual hospitals administered the actual vaccines to their employees based on priority status.\n  This system is meant to be flexible and responsive to local conditions, but it also means the availability of a vaccine might seem to vary from place to place. For example,  Emily Brunson, an anthropologist at Texas State University who studies vaccines, says that in 2009 there were cases in which one district interpreted recommendations strictly, giving the vaccine only to high-priority groups, and a neighboring district offered it to anyone who wanted it. The decision to distribute the vaccine through employee health centers in New York, which happened to include several Wall Street firms,  also caused a big backlash. “There are many ways that things can be misinterpreted,” Brunson says. And during an initial shortage, these decisions can feel unfair—especially given tensions seeded earlier in the pandemic when  the rich and the famous were getting COVID-19 tests while ordinary people were being turned away at clinics.\n If the pandemic so far is any indication, a vaccination program is likely to take place against a backdrop of partisanship and misinformation. Already,  conspiracy theories are spreading about a COVID-19 vaccine, some of them downright outlandish. But the emphasis on speed—as in “Operation  Warp Speed”—has also created real worries about vaccines being rushed to market. At a congressional hearing with five vaccine makers on Tuesday, company officials had to  repeatedly push back against the idea that the industry might cut corners for a COVID-19 vaccine.\n    “We’re going to be in a situation where some people will be desperate to get the vaccine and some people will be afraid to get the vaccine. And there’ll be probably a lot of people in between who are a little bit of both or not sure,” says  Michael Stoto, a public-health researcher at Georgetown University. A vaccine, especially a novel one that doesn’t offer complete protection against COVID-19, will require careful communication about risk. “The fact that we can’t get ourselves straight about wearing masks will make that harder,” he adds. Given the number of Americans who are currently unsure of or opposed to getting a COVID-19 vaccine, Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases,  has warned that even a vaccine might not get the country to herd immunity if too many people refuse it.\n  For the Americans pinning their hopes on a vaccine, a botched rollout could feel like yet another example of failure in the time of COVID-19. That could have disastrous consequences that last well beyond the pandemic itself. Brunson worries that such a scenario could undermine trust in public-health expertise and in all vaccines. “Both of those would be disasters,” she says, “in addition to the COVID itself being a disaster.” It could mean, for example, further resurgences of vaccine-preventable diseases such as measles and an even bigger challenge when battling future pandemics.\n  For all the uncertainties that remain ahead for a COVID-19 vaccine, several experts were willing to make one prediction. “I think the question that is easy to answer is, ‘Is this virus going to go away?’ And the answer to that is, ‘ No,’” says Karron, the vaccine expert at Johns Hopkins. The virus is already too widespread. A vaccine could still mitigate severe cases; it could make COVID-19 easier to live with. The virus is likely here to stay, but eventually, the pandemic will end.\n   We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.", "posttime": "2020-07-29 00:02:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "真实性,reality,疫苗", "title": "疫苗的真实性检验", "title_en": "A Vaccine Reality Check", "transed": 1, "url": "https://www.theatlantic.com/health/archive/2020/07/covid-19-vaccine-reality-check/614566/", "via": "", "real_tags": ["真实性", "reality", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "cbec1fbf8e9c8e953233544f91759da0.jpg", "infoid": 1014701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二上午，年轻的特朗普在分享了这段病毒式视频的链接后，他的账户被限制了，他在推特上写道：“这是一场非常[原文如此]的观看！与每个人都在奔跑的叙述截然不同。“。\n推特的一位发言人告诉TechCrunch：“这条推文违反了我们新冠肺炎的错误信息政策。”该公司表示，这条推文违反了其针对新冠肺炎虚假信息的规定，必须删除。特朗普的账号没有被暂停，但其功能将被限制12小时。\n此帐户尚未被永久暂停。根据截图，这条推文需要删除，因为它违反了我们的规定(分享关于新冠肺炎的错误信息)，该账号的功能在12小时内将受到限制。我们的规则中有更多内容：https://t.co/0wHWVV5QS4 https://t.co/0gq7rlaNw7。\n这段视频被布莱巴特新闻广泛宣传，视频中有一些穿着实验室大衣的人，他们自称是“美国的前线医生”。在视频中，这些人鼓吹各种虚假和危险的说法，包括口罩不能阻止病毒传播的说法，以及另一种对药物羟基氯喹的辩护，事实证明，羟基氯喹在治疗病毒方面没有效果。\n据“每日野兽”的威尔·萨默尔报道，这段视频的核心人物之一斯特拉·伊曼纽尔过去曾发表过离奇而不科学的言论。这些指控包括断言“外星人DNA”目前正在用于一些医疗，一些妇科问题是患者与恶魔般的“精神丈夫”和“精神妻子”发生性关系的结果。\n周一晚上，特朗普总统在推特上多次分享了这段视频，现在这些推文在他的时间表上似乎“不再可用”。现在被删除的推文夹在一些剩余的推文之间，这些转发为羟基氯喹辩护，称其为“黄金标准”和“游戏规则改变者”。这些转发还攻击了白宫流行病顾问安东尼·福奇(Anthony Fuci)博士的可信度。\nFacebook和YouTube也在努力清理这段病毒式视频的实例。在Facebook上，它获得了超过1400万的浏览量，在公司采取行动删除它之前，它成为了该平台上最受欢迎的帖子之一。", "note_en": "The younger Trump’s account was restricted Tuesday morning after he shared a link to the viral video, tweeting “This is a much [sic] watch!!! So different from the narrative that everyone is running with.”\n “The Tweet referenced was in violation of our COVID-19 misinformation policy,” a Twitter spokesperson told TechCrunch. The company said that the tweet violated its rules against COVID-19 misinformation and must be deleted. Trump’s account was not suspended, but its functionality will be restricted for 12 hours.\n  This account has not been permanently suspended. Per the screenshot, the Tweet requires deletion because it violates our rules (sharing misinformation on COVID-19), and the account will have limited functionality for 12 hours. More in our rules:  https://t.co/0wHWVV5QS4  https://t.co/0gq7rlaNw7\n The video was widely publicized by Breitbart News and features a number of people in lab coats who refer to themselves as “America’s Frontline Doctors.” In the video, the individuals push various false and dangerous claims, including the claim that masks don’t prevent the spread of the virus and yet another defense of the drug hydroxychloroquine, which hasn’t proven effective in treating the virus.\n Stella Immanuel, one figure central to the video, has made outlandish unscientific claims in the past, the  Daily Beast’s Will Sommer reports. Those claims include the assertion that “alien DNA” is currently in use for some medical treatments and that some gynecological problems are a result of a patient having sex with demon-like  “spirit husbands” and “spirit wives.”\n President Trump shared the video multiple times on Monday night in tweets that now appear as “no longer available” on his timeline. The now-removed tweets are wedged in between a number of remaining retweets that defend hydroxychloroquine as a “gold standard” and a “game changer.” The retweets also attack White House pandemic advisor Dr. Anthony Fauci’s credibility.\n Facebook   and YouTube are  also working to scrub instances of the viral video. On Facebook, it collected more than  14 million views and became one of the platform’s most popular posts before the company took action to remove it.", "posttime": "2020-07-28 23:40:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,特朗普,sharing,视频", "title": "\n推特限制小唐纳德·特朗普分享新冠肺炎错误信息的账号", "title_en": "\n\t\t\t\tTwitter restricts Donald Trump Jr.’s account for sharing COVID-19 misinformation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/28/twitter-donald-trump-jr-frontline-doctors-viral-video-misinformation/", "via": "", "real_tags": ["推特", "特朗普", "sharing", "视频"]}, {"category": "", "categoryclass": "", "imagename": "d1889d7495e7945f20909001d5d8da37.gif", "infoid": 1014700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于大流行期间人们对自动化和机器人的兴趣增加，已经写了很多-我知道，因为我写了很多东西。这些讨论大多围绕物流、送货和食品准备等问题展开。但对于陪伴也有一个令人信服的理由。出于这个原因，Petit Qoobo众筹活动发起的时机再好不过了。\n更小、更便携的古怪猫枕头明天将在美国Indiegogo上市，此前该公司在日本本土成功开展了一项活动，为该项目带来了12.5万美元的收入。这一次，宇凯工程希望再净赚5万美元。价格从60美元到80美元不等，这取决于层级和所有的好东西。预计它将于12月开始发货，对于易过敏的动物爱好者来说，这将是一份相当可靠的节日礼物。\n首席执行官青木顺介在一份新闻稿中表示：“日本众筹的成功确实表明，人们越来越多地求助于机器人来寻求情感上的安慰，以及‘收养’机器人进入他们的生活正变得‘常态化’，”首席执行官青木顺介(Shunsuke Aoki)在一份新闻稿中表示。“在自我隔离期间，人们似乎也更乐于接受这种新的人-机器人关系。”\n最新版本的机器猫枕头包括标准的摇尾巴，可以让你更快地抚摸它。它还会根据声音和声音开始摇摆，并提供一种微妙的心跳感觉。当然，机器人同伴在日本已经成为一种现象已经有一段时间了，部分原因是人口老龄化。社会疏远带来的长期孤立肯定会被证明是采用它们的另一个关键驱动因素。\n据该公司称，与去年同期相比，最初的Qoobo的销量增长了约30-40%。到目前为止，Qoobo已经存在了几年，所以很有可能这种新的兴趣在很大程度上是由社会疏远可能产生的强烈孤立感推动的。", "note_en": "A lot has been written about increased interest around automation and robotics during the pandemic — I know because I’ve done  a lot of the writing. Most of these discussions tend to revolve around things like logistics, delivery and food preparation. But there’s also a compelling case to be made for companionship. And for that reason, the Petit Qoobo crowdfunding campaign couldn’t have launched at a better time.\n  The smaller, more portable of the quirky cat pillow  goes up on Indiegogo in the U.S. tomorrow, following a successful campaign in its native Japan that netted the project $125,000. This time out, Yukai Engineering is hoping to net an additional $50,000. Prices will range from $60 to $80, depending on tiers and all of the good stuff. It’s expected to start shipping in December, making it a pretty solid holiday gift for allergy-prone animal lovers.\n   “The crowdfunding success in Japan really goes to show how people are increasingly turning to robots for emotional comfort and how it’s becoming ‘normal’ to ‘adopt’ robots into their lives,” CEO Shunsuke Aoki said in a release. “People also seem to be embracing this new human-robot relationship more while in self-quarantine.”\n The latest version of the robot cat pillow includes the standard wagging tail, which speeds us you pet it. It will also start wagging in response to voices and sound and offer a subtle heartbeat sensation. Robotic companions have, of course, been a phenomenon in Japan for some time, owing in part to an aging population. The long stretches of isolation brought up by social distancing could certainly prove to be another key driver in their adoption.\n According to the company, sales of the original Qoobo are up up ~30-40% versus the same two-month period last year. Qoobo has been around for a few years now, so it seems entirely likely that much of that renewed interest has been driven by the intense sense of isolation social distancing can engender.", "posttime": "2020-07-28 23:39:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,发布,qoobo,机器人", "title": "\n小Qoobo猫枕头将于12月在美国发布，此前开展了众筹活动", "title_en": "\n\t\t\t\tPetit Qoobo cat pillow set for December US release, following crowdfunding campaign\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/28/petit-qoobo-cat-pillow-set-for-december-us-release-following-crowdfunding-campaign/", "via": "", "real_tags": ["美国", "发布", "qoobo", "机器人"]}, {"category": "", "categoryclass": "", "imagename": "44c97546e95c21fdb4e4033fea5e7794.jpg", "infoid": 1014699, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家旅游聚合公司称此次注资是对其战略的“强烈信任票”，该战略旨在通过调整对国内和短途旅行和活动的关注，来适应它所说的旅游“新常态”。这轮融资由一家未透露姓名的全球金融机构牵头。Traveloka还表示，“一些”现有投资者也参与其中(EV Growth是它命名的一个投资者)。\n根据Crunchbase的数据，在最近一次融资之前，Traveloka自2012年成立以来，已在5轮融资中吸引了约9.5亿美元。早在2017年，在从Expedia获得3.5亿美元以换取该业务少数股权后，该公司通过了独角兽估值。但不久之后，该公司失去了一名联合创始人-在他看来，这名联合创始人以目标冲突为由离职，因为公司转向了更多的商业思维。\n快进几年后，大流行对整个旅游业造成了严重破坏。自从疫情肆虐，摧毁了该行业的“一切照旧”以来，旅行社做出了回应，推出了一系列举措，以求安抚和吸引客户-包括捆绑新冠肺炎检测的航班；酒店灵活的开放日期代金券(也就是“以后购买”)；在线体验；闪电销售直播流；以及大力推动清洁，为度假住宿制定标准化的卫生协议，可以通过其平台预订。\nTraveloka表示，最新的注资不仅将用于充实其资产负债表，还将用于在“选定的优先领域”加强努力和深化产品供应，包括在关键市场打造其所称的“更强大、更一体化的旅游生活方式组合”。\nTraveloka联合创始人兼首席执行官Ferry Unardi在一份声明中发表评论称：“毫无疑问，Traveloka深受新冠肺炎疫情的影响。我们经历了自我们成立以来的最低营业率。然而，我们始终相信，通过迅速调整我们的战略，与我们的行业和生态系统合作伙伴合作，以及继续为我们的用户创新，这是我们的终极关注点，公司将取胜。“。\n据Per Ferry称，旅行社在越南的业务正在“接近”新冠肺炎之前的稳定水平，而他表示，其泰国业务“在路上”将超过50%。\n他补充说：“印度尼西亚和马来西亚仍处于早期阶段，但他们继续显示出良好的势头，每周都有强劲的改善，特别是在住宿方面，出现了较短距离的居留行为。”“我们承认，在引领新浪潮的过程中，该行业可能会经历进一步的动荡，但我们觉得我们已准备好迎接挑战，并站在正确的一边。”\n“旅游业正面临前所未有的时代，包括Traveloka，”EV Growth的管理合伙人Willson Cuaca在另一份支持声明中补充道。“领导班子采取了艰难但值得称赞的措施，包括重组和优化，将金融健康风险降至最低。我们有信心，在这场危机过后，该公司将变得更加强大。“", "note_en": "The travel aggregator dubs the capital injection a “strong vote of confidence” in its strategy to adjust to what it couches as a ‘new normal’ for travel by retooling its focus on domestic and short hop excursions and activities. The funding round is led by an unnamed global financial institution.  Traveloka   also says “some” existing investors also participated (EV Growth being one it has named).\n Prior to this latest raise, Traveloka had pulled in around $950M across five funding rounds since being founded back in 2012, according to  Crunchbase. Back in  2017 it passed unicorn valuation after bagging  $350 million from Expedia in exchange for a minority stake in the business. But, shortly afterwards, it lost one of its co-founders — who departed  citing a clash of goals as the business switched to more of a commercial mindset, as he saw it.\n  Fast forward a few years and the pandemic is playing havoc with the travel industry as a whole. Since the pandemic landed to  decimate ‘business as usual’ in the sector, Traveloka has responded by launching a number of initiatives in a bid to reassure and woo back customers — including flights that bundle COVID-19 tests; flexible open-date vouchers for hotels (aka, ‘Buy Now Stay Later’); online experiences; flash sale livestreams; and a big push around cleanliness with standardized hygiene protocols for vacation accommodation that can be booked via its platform.\n Traveloka says the latest capital injection will be used not only to beef up its balance sheet but to boost efforts and deepen offerings in “select priority areas” — including building out what it describes as “a more robust and integrated Travel &amp; Lifestyle portfolio” in key markets.\n  Commenting in a statement, Ferry Unardi, Traveloka co-founder and CEO, said: “Without a doubt, Traveloka has been profoundly affected by the COVID-19 pandemic. We have experienced the lowest business rate that we have ever seen since our inception. However, we always believed that the company will prevail by rapidly adjusting our strategy, working with our industry and ecosystem partners, as well as continuing to innovate for our users, our ultimate focus.”\n Per Ferry, Traveloka’s business in Vietnam is “approaching” steady pre-COVID-19 levels, while he says its Thailand business is “on its way” to surpassing 50%.\n “Indonesia and Malaysia are still in the early stage, but they continue to demonstrate promising momentum with strong week-to-week improvement, especially in accommodation with the emergence of shorter distance staycation behavior,” he added. “We acknowledge that the sector may go through further turbulence as it navigates new waves, but we feel we are prepared to take on the challenge and emerge on the right side of it.”\n “The travel industry is facing unprecedented times, including Traveloka,” added  Willson Cuaca,   managing partner of EV Growth, in another supporting statement. “The leadership team has taken difficult yet commendable measures including restructuring and optimization to minimize financial health risks. We are confident that the company will emerge even stronger after this crisis.”", "posttime": "2020-07-28 23:39:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "coronavirus,冠状病毒,病毒,traveloka", "title": "\n在冠状病毒危机中，Traveloka最高获得2.5亿美元", "title_en": "\n\t\t\t\tTraveloka tops up with $250M amid the coronavirus crisis\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/28/traveloka-tops-up-with-250m-amid-the-coronavirus-crisis/", "via": "", "real_tags": ["冠状病毒", "病毒", "traveloka"]}, {"category": "", "categoryclass": "", "imagename": "52d7889c9ad4273c090e3de122b5e916.jpg", "infoid": 1014697, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CES 2021今年将实现全数字化，因为其组织者认为这是他们在大流行期间保护与会者的唯一方式。\n消费者技术协会(CTA)举办了今年最大的科技贸易展，每年1月吸引约18万人来到拉斯维加斯。但CTA首席执行官加里·夏皮罗(Gary Shapiro)在接受VentureBeat采访时表示，2021年不会有体育赛事。这对依赖CES在吸引了大量媒体、技术爱好者和买家的活动上展示即将推出的产品的技术营销者来说，将是一个沉重的打击。\n夏皮罗说，数字展会的新形式仍然将使参展商、参观者、媒体和科技领袖能够通过在线演讲和虚拟会议相互参与。CTA的成员雇用了1800多万人。最近几周，CTA咨询了1万多名与会者和其他利益相关者，发现有大量人不想参加，之后做出了这一决定。夏皮罗说，他与数十名首席执行官进行了交谈，每个人都理解大流行的挑战。\n夏皮罗说：“随着每个月的过去，我们希望这个问题能在一月份前以某种方式得到解决。”“但我们的假设是，到明年1月，将不会有一种被广泛获得并被认为是安全的疫苗。在我们的董事会会议上，议题是‘做什么才是正确的？’我们是基于要做的正确事情来做决定，而不是基于我们要做的最好的财务事情。“。\n夏皮罗指出，他的妻子在一家医院当医生，生了新冠肺炎，尽管他自己还没有。他说，他理解美国的情况有多严重，那里已有超过440万人感染，超过15万人死亡。\n他说：“我们意识到，如果没有疫苗，就不可能有体检CES。”他说：“我们的活动主要是室内活动。如果这是一个财务决定，我们会继续前进。(但这一决定)让参展商和参会者有机会制定自己的计划，重新想象活动和他们的数字存在。“。\n他说，CTA不想为进一步传播疫情负责，尽管它已经有数千家参展商签约，而且可能有数万人。\n“随着时间的推移，我们越来越不舒服，情况并没有好转，”他说。\nCTA也认为它应该尽早转向。夏皮罗指出，谷歌刚刚宣布将让员工在家工作，直到2021年夏天。今年夏天病毒的卷土重来迫使企业和协会更加谨慎，接受暂时聚集并不安全的事实。\n数字展览仍将以重要的主旨演讲者为特色，您将能够在舒适和安全的家中或办公室观看它们。这是一个很大的转变，因为这个节目从来没有在线过-只是在它50多年的运营中。该活动将于2021年1月的第一周举行，CES 2022将是一场物理和数字相结合的活动。\n夏皮罗说：“2022年，我们的计划是在拉斯维加斯举办一场混合活动，并在我们从2021年开始学习的基础上举办一场超级增强的数字活动。”\n他说，该团队花了大量时间研究保护措施，如消毒剂、口罩要求、测试和设置物理屏障。但他指出，随着越来越多的公司准备让工人重返工作岗位，检测工具短缺。该团队从3月份开始积极进行数字扩张，但取消物理元素的决定花了更长的时间。\n(VentureBeat是CES的媒体合作伙伴，我建议CES取消实体活动。)。\n夏皮罗说：“我们对数字活动的可能性感到非常兴奋。”“它让每个人都能参加，5G、人工智能、自动驾驶汽车、无人机和健康技术在我们这个行业发生了这么多事情。”\n与此同时，CTA周一表示，它已召集多家科技和卫生公司发起公共卫生技术倡议(Public Health Tech Initiative)，旨在开发应对未来流行病的技术。\n夏皮罗说：“我们在医疗保健技术方面取得了很多成功。”“这次会议的重点是我们如何为这次大流行之后的下一次全球卫生危机做计划。”\n一些人在社交媒体上猜测，考虑到来自世界各地的182,000多人参加了CES2020，是否是CES2020在美国传播了新冠肺炎。但夏皮罗对此表示怀疑。他的组织对此进行了调查，发现拉斯维加斯本身最早的确诊病例是在3月份，也就是在CES之后很久。\n他说：“这肯定是我们担心的事情，因为没有人想要与这种类型的传播联系在一起。”\n至于这一决定对合作伙伴和拉斯维加斯这座城市的影响，夏皮罗说，“我们感到心碎。”他承认有多少供应商依赖会议和会议获得收入，更不用说航空公司和酒店了。\n“这对参与其中的人来说是有意义的。这显然是有影响的，“夏皮罗说。\n夏皮罗没有说CTA是否预料到了与市政府或供应商的任何合同问题。但他指出，大多数合同都有“不可抗力”条款，允许合同因大流行等特殊事件而破裂。他表示，在接下来的一周左右，CTA将进行后续对话。但底线是明确的。\n他说：“在这种情况下，举办一场安全的赛事是不可能的。”", "note_en": "CES 2021 will go all-digital this year since its organizers feel that’s the only way they can protect attendees during the pandemic.\n The Consumer Technology Association (CTA) stages the biggest technology trade show of the year, drawing around 180,000 people to Las Vegas each January. But there will be no physical event in 2021, said CTA CEO Gary Shapiro in an interview with VentureBeat. That’s going to be a severe blow to tech marketers who rely on CES to showcase upcoming products at an event that draws tons of press, tech enthusiasts, and buyers.\n  The digital show’s new format will still enable exhibitors, attendees, the press, and tech leaders to engage with each other through online talks and virtual meetings, Shapiro said. The CTA — whose members employ more than 18 million people — made the decision after consulting with more than 10,000 attendees and other stakeholders in recent weeks and finding that a large number of people didn’t want to attend. Shapiro said he talked to scores of CEOs and everyone understood the challenge of the pandemic.\n “As every month went by, it was our hope that somehow this would resolve by January,” Shapiro said. “But the assumption is there will not be a vaccine that will be widely available and considered safe by January. At our board meeting, the issue was, ‘What is the right thing to do?’ We are making a decision based on the right thing to do, not on the best financial thing for us to do.”\n Shapiro noted that his wife, who works as a doctor in a hospital, had COVID-19, though he himself hasn’t had it. He said he understood how serious the situation is in the U.S., where more than 4.4 million have been infected and over 150,000 have died.\n “We realized with no vaccine it’s just not possible to have a physical CES,” he said. “Our event has been primarily an indoor event. If it were a financial decision, we would go forward. [But this decision] gives exhibitors and attendees the opportunity to make their own plans and reimagine the event and their digital presence.”\n He said the CTA didn’t want to be responsible for spreading the pandemic further, even though it had thousands of exhibitors already signed up and a likely crowd of tens of thousands of people.\n “We were getting increasingly uncomfortable as time went on and things didn’t get better,” he said.\n The CTA also thought it should pivot early. Shapiro noted that  Google just announced it would have employees work from home until the summer of 2021. The resurgence of the virus this summer is forcing companies and the association to be more cautious and accept the fact that it won’t be safe to gather for a while.\n   The digital show will still feature important keynote speakers, and you’ll be able to watch them from the comfort and safety of your home or office. That’s a big shift, as the show has never been online-only in its more than 50 years of operation. The event will take place during the first week of January 2021, and CES 2022 will be a hybrid physical and digital event.\n “In 2022, our plan is to have a hybrid event in Las Vegas and a super-enhanced digital event based on our learnings from 2021,” Shapiro said.\n He said the team spent a lot of time looking at protective measures, such as disinfectants, mask requirements, testing, and  physical barriers. But he noted that there’s a shortage of testing kits as more companies prepare to bring workers back to work. The team started working aggressively on a digital expansion in March, but the decision to cancel the physical element took longer.\n (VentureBeat is a media partner for CES, and I advised CES to cancel the physical event.)\n “We are pretty excited about the possibilities of the digital event,” Shapiro said. “It allows everyone to attend, and there is so much going on in our industry with 5G, AI, self-driving cars, drones, and health tech.”\n Meanwhile, the CTA said on Monday that it had convened a number of tech and health companies to launch the Public Health Tech Initiative, aimed at developing technologies to deal with future pandemics.\n “We’ve had a lot of successes in health care technology,” Shapiro said. “This one is focused on how we could plan for the next global health crisis after this pandemic.”\n   Some people have wondered on social media whether CES 2020 was responsible for spreading COVID-19 in the U.S., considering it brought together more than 182,000 people from all over the world. But Shapiro doubts that was the case. His organization looked into it and found that the earliest confirmed case in Las Vegas itself was in March, long after CES.\n “That certainly was something that concerned us because no one wants to be associated with that type of spreading,” he said.\n As for the impact of the decision on partners and the city of Las Vegas, Shapiro said, “We’re heartbroken.” He acknowledged how many vendors rely on meetings and conventions for revenue, not to mention the airlines and the hotels.\n “It’s meaningful to the people involved. It obviously has an impact,” Shapiro said.\n Shapiro didn’t say whether the CTA anticipated any contract problems with the city or vendors. But he noted that most contracts have “force majeure” clauses that allow contracts to be broken due to extraordinary events like a pandemic. During the next week or so, he said the CTA would have follow-up conversations. But the bottom line is clear.\n “In this case, it’s just not possible to have a safe event,” he said.", "posttime": "2020-07-28 23:31:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ces,技术", "title": "相反，CES表示，计划于2021年1月举行的活动将全数字化，使用面向供应商、与会者和媒体的虚拟会议形式", "title_en": "In a reversal, CES says its event planned for January 2021 will be going all-digital, using a virtual meeting format for vendors, attendees, and the press", "transed": 1, "url": "https://venturebeat.com/2020/07/28/ces-2021-will-be-an-all-digital-event-in-january-2021/", "via": "", "real_tags": ["ces", "技术"]}, {"category": "", "categoryclass": "", "imagename": "f1e40bdd6720e794e0b962c4883fa027.jpg", "infoid": 1014695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国秘密情报局(Secret Intelligence Service，简称MI6)被控试图篡改一家本应监督和监管该机构的法院。昨日，一则非同寻常的故事浮出水面。\n来自这个秘密机构的两名间谍试图阻止调查权力法庭(IPT)主席拉宾德·辛格勋爵(Lord Rabinder Singh)阅读间谍机构审计师调查权力专员办公室(IPCO)的秘密调查报告。\n这些信息是在昨天法庭正在审理的一起案件的听证会上披露的，听证会涉及军情六处线人在国家调查和惩罚这些罪行之前被允许犯下哪些罪行。去年，一起IPT案件确立了间谍和线人可以触犯法律而不受惩罚。\nIPCO的一份机密报告包括在一堆法庭文件中，辛格大法官打算在2019年初阅读。军情六处决定阻止辛格阅读这份报告，其中包含批评该机构的材料。\n两名间谍打电话给IPT，要求不要让法官看到这份报告。据英国“每日邮报”和英国广播公司报道，IPT秘书苏珊·科布回信说：你们的员工试图以他们想要的方式干预正在进行的法律程序，这是不合适的。\n秘密间谍法庭称，英国人的窥探行为触犯法律是很酷的。稍等一下，我们来点法律柔术让军情五处逍遥法外...。\n多读。\n当这件事昨天在法庭上被披露时，辛格勋爵(Lord Justice Singh)告诉法庭：法庭的秘书做出了完全恰当的回应，并提请我注意这些问题。这个审裁处实质上是一个完全独立於政府、情报机构和其他任何人的法庭。2019年3月，人们认识到直接沟通是不合适的。\n人权压力组织Reprieve的负责人玛雅·福阿(Maya Foa)表示：英国的安全部门在维护国家安全方面发挥着关键作用，但他们无权决定法庭应该看到什么证据。Reprieve是该案的起诉方。军情六处道歉是正确的。\nIlia Siatitsa是Privacy International的法律官员，他补充道：这种对司法程序的干预在任何成熟的民主国家都是绝对没有立足之地的。在2017年提交同一审裁处的另一宗私隐案件中，据透露，GCHQ也曾向专员提供类似性质的预付款。令人担忧的是，(间谍)机构还没有学会这些基本原则。\n据说法庭对道歉采取了表面上的态度，没有采取进一步的行动来调查为什么间谍们有足够的信心向法庭施压。然而，目前还不清楚为什么军情六处一开始就感觉到了威胁。\n批评人士认为，IPT是一块遮羞布，允许内政部和外交部声称间谍机构的活动是受法律监管的。只有经过政府审查的律师才能向其陈述案件；提交给法庭的大多数证据都不会与投诉人分享，IPT之前的大部分法律听证会都是在投诉人(和媒体)被排除在法庭之外的情况下秘密举行的。\n因此，IPT主要做出有利于间谍机构的裁决，对它们不利的裁决非常罕见，以至于每当它们发生时都会产生密集的新闻报道。®。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "The UK&#39;s Secret Intelligence Service, aka MI6, has been accused of trying to tamper with a court that is supposed to oversee and regulate it after an extraordinary tale emerged yesterday.\n  Two spies from the secretive agency attempted to prevent  Lord Justice Rabinder Singh, president of the Investigatory Powers Tribunal (IPT), from reading a secret investigation report from spy agency auditor the Investigatory Powers Commissioner&#39;s Office (IPCO).\n  The revelations came during a hearing in an ongoing case before the tribunal yesterday, over exactly what crimes MI6 informants are allowed to commit before the state investigates and punishes those crimes. Last year an IPT case  established that spies and informants can break the law with impunity.\n  A classified report from IPCO was included in a bundle of court papers intended to be read by Lord Justice Singh in early 2019. MI6 decided it wanted to stop Singh from reading the report, which contained material critical of the agency.\n  Two spies phoned the IPT to demand that the report was kept away from the judge&#39;s eyes. IPT secretary Susan Cobb wrote back to say: &#34;It was inappropriate for your staff to seek to intervene in ongoing legal proceedings in the way that they sought to do,&#34;  the Daily Mail and BBC reported.\n  It&#39;s cool for Brit snoops to break the law, says secretive spy court. Just hold on while we pull off some legal jujitsu to let MI5 off the hook...\n  READ MORE\n  When this was revealed in court yesterday, Lord Justice Singh told the room: &#34;The tribunal&#39;s secretary acted entirely appropriately in responding the way she did and by drawing these matters to my attention. This tribunal is, in substance, a court which is completely independent of the Government, the intelligence agencies and everybody else. In March 2019, it was recognised that the direct communication was inappropriate.&#34;\n  Maya Foa, director of human rights pressure group Reprieve, which brought the case being heard, said: &#34;Britain&#39;s security services play a crucial role in keeping this country safe, but they do not get to decide what evidence a court should see. MI6 was right to apologise.&#34;\n  Ilia Siatitsa, a legal officer with Privacy International, added: &#34;Such an interference with judicial proceedings has absolutely no place in any mature democracy. In another PI case before the same tribunal in 2017, it was revealed that GCHQ had also made advances of similar nature to the Commissioner. It is troubling the [spy] agencies have not yet learned these basic principles.&#34;\n  The tribunal was said to have taken the apology at face value and taken no further action to investigate why the spies felt confident enough to pressure the tribunal. It is unclear, however, why MI6 felt threatened in the first place.\n    The IPT is seen by critics as a fig leaf that allows the Home and Foreign Offices to claim that spy agencies&#39; activities are regulated by law. Only barristers vetted by the government are allowed to present cases before it; most evidence shown to the tribunal is not shared with complainants, and large parts of legal hearings before the IPT take place in secret with complainants (and the press) excluded from the courtroom.\n  As a result, the IPT mainly rules in favour of the spy agencies, with rulings against them being so rare as to generate intense news coverage whenever they occur. ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-07-28 23:30:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阻止,intervene,法庭", "title": "军情六处试图通过阻止法官查看法律文件来干预独立法院", "title_en": "MI6 tried to intervene independent court by stopping judge seeing legal papers", "transed": 1, "url": "https://www.theregister.com/2020/07/28/mi6_investigatory_powers_tribunal_interference/", "via": "", "real_tags": ["阻止", "intervene", "法庭"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我主要在AppleMacBooks上进行开发。最近，我给自己造了一台处理器快、内存大的新PC。我想把我的一些开发任务转移到那台机器上。我仍然喜欢笔记本电脑给我的自由，让我可以在任何我想要的地方工作。无论是坐在家里的沙发上，还是在我居住的城市里随便找个咖啡馆，我只是喜欢每隔几个小时换一换环境，而不是整天坐在办公桌前。我已经将近10年没有使用Windows作为我的主要操作系统了。但是，由于Windows10(仍然)附带了RDP和WSL2，RDP在性能上比VNC更好，WSL2提供了“真正的”和良好集成的Linux体验，我很好奇是否可以创建一个在新机器上远程工作的设置。它还会给我一个调试Windows特定问题的环境，这对我的副业项目(如Babashka和CLJ-Kondo)应该很有用。如果不起作用，我总是可以使用Ubuntu作为主开发操作系统进行双引导，如果我需要做任何图形化的事情，可以使用VNC。不管怎样，这里有一份我经历过的设置过程的报告。\n一台新电脑的原始气味和美感与我家混乱的现实形成了鲜明对比。Pic.twitter.com/3zLIzYg4XB。\n-(λ.。Borkdud)(@borkdud)2020年7月8日。\n因为我家里没有其他的Windows机器，所以我试着根据这篇博客文章在MacOS中创建一个USBWindows安装驱动器。无论我尝试什么，在安装过程结束时，Windows都会抱怨。\nWindows安装遇到意外错误。验证安装源是否可访问，然后重新启动安装。\n在新PC上安装Ubuntu。安装程序出人意料地流畅，可以检测到我的wifi，甚至显然还能检测到nvidia显卡。而Windows类似于pic.twitter.com/FQNzeJ6V2X。\n-(λ.。Borkdud)(@borkdud)2020年7月8日。\n一位好朋友提供了帮助，并在他的Windows Home安装上使用Rufus创建了一个安装驱动器，确实起到了作用。\n一旦安装了Windows，我就启用了RDP，并安装了WSL2、Ubuntu 20.04、Windows Terminal和Docker Desktop for WSL2。\n为了能够运行WSL2，我必须先在BIOS中启用虚拟化选项。\n我打算在这台机器上使用Ubuntu WSL2作为我的主要开发环境，因此调整终端配置以默认打开Ubuntu而不是PowerShell是有意义的。我发现终端中的Ubuntu启动于Windows home目录(/mnt/c/Users/borkdud)很烦人，所以我在Ubuntu配置文件中设置了&#34；startingDirectory&#34；：&#34；//wsl$/Ubuntu-20.04/home/borkdude&#34；。\n我在MacOS上使用zsh作为我的默认shell，并希望在WSL2中也是如此，所以我安装了使用sudo apt update&amp；&amp；sudo apt安装zsh，然后使用chsh-s$(Whichzsh)。我还安装了ohmyzsh并启用了我日常使用的仅有的两个插件：GIT和JUMP。\n然后我开始移植我在MacBook上使用的dev设置，主要由Docker映像、几个Clojure项目和一些bash脚本组成。我使用几个shell脚本来设置所有的开发环境变量和别名，以便轻松设置ssh隧道。仅做了几处调整(例如，以太网卡在MacOS和WSL2中的Ubuntu中的名称不同)，就可以正常工作了(例如，以太网卡在MacOS中的名称与在WSL2中的Ubuntu不同)。当然，我需要安装git来克隆我的工作项目。为了运行Clojure项目，我通过APT安装了OpenJDK版本8和11。我使用jenv在项目基础上管理Java版本，这非常有效：\n我还安装了boot、Clojure构建工具和Clojure CLI，它们在Linux中都得到了很好的支持。\n在运行我的工作项目之前，我想使用rsync从我的MacBook复制一个PostgreSQL数据库和其他数据。在此之前，我需要在Ubuntu中启用ssh。我发现我可以通过运行sudo service sshstart来做到这一点，但我仍然无法从MacBook登录。原来您还必须转发并打开Windows防火墙中的端口。我找到了这个PowerShell脚本，它可以让您做到这一点。正如评论所建议的那样，我还创建了一个在Windows登录时运行此脚本的计划任务。对于使用wsl-u root sudo服务ssh start运行ssh服务，我执行了相同的操作。确保选择使用最高权限运行。我确信在WSL2中有一种更好的方法可以通过systemd来实现这一点，但是这个方法对我来说很有效。所以现在我可以将数据从MacOS重新同步到WSL2。我启动了Docker Containers和Clojure项目，它成功了！作为堆栈的一部分，我们有一个相当密集的I/O进程，这似乎在WSL2中执行得很好。\n在WSL中启用SSH还允许我在笔记本电脑上使用Emacs，并使用Tramp模式在远程机器上编辑文件。伊朗在这件事上有一个问题。由于我在zsh中使用了非标准提示符，emacstramp无法解析来自远程shell的输出。因此，我添加了这条黑客命令，我将其添加到了Tomy~/.zshc中：\n当使用tramp打开文件时，Emacs将TERM设置为&#34；umb&#34；。在这种情况下，我只调用bash，而不是继续使用zsh。也许有更好的解决方案，但这是可行的。\n当然，我也希望能够在机器本身上运行Emacs。我首先尝试在Windows本机运行Emacs，但我在某处读到不推荐直接从Windows编辑WSL2文件。此外，您可能会遇到结束Windows和Linux/MacOS之间差异的行。我决定稳妥行事，使用apt在WSL2中安装emacs。如果您确实决定使用Windows原生Emacs，并且在查找emacs需要配置文件的位置时遇到困难，您可以使用M-xDescribe-Variable user-init-file找到它。在我的机器上，那是C：\\Users\\borkdude\\AppData\\Roaming\\.config\\emacs\\init.el..。要获得从WSL2开始的emacs的图形UI，我需要在Windows上安装X-server。有很多免费和开源的解决方案可供选择，但我选择了以9.99美元的价格购买X4100，而不是49.99美元。它似乎正在积极地工作，并且有很好的文档。为了在Windows启动时自动启动X410，我按照以下说明操作。启动时，托盘中有一个X图标，您可以在其中修改X410的设置。我已经启用了窗口应用程序、允许公共访问、DPIScaling(高质量)和共享剪贴板。要为WSL2中的GUI应用程序导出正确的显示值，我的.zshenv中包含以下内容：\n然后使用zsh会话中的setsid emacs运行emacs(我在.zshenv中为此创建了一个别名)。\n我使用的emacs配置与在MacOS上使用的完全相同，它基于@bbatsov的前奏。它看起来和感觉上都和onmacOS一样，尽管现在我可能不得不学习“真正的”emacs键绑定强制复制(M-w)和粘贴(C-y)，而不是使用MacOS键绑定，这实际上可能是这个实验的一个很好的副作用。\n即使用苹果酒连接到nREPL服务器，从mylaptop也能正常工作，前提是我如上所述在Windows防火墙中转发并打开端口。\nWSL2的内存使用存在一个已知问题。由于Linux使用未分配的内存进行文件系统缓存，因此Windows认为该内存已真正使用。随着时间的推移，Windows最终可能会将所有系统内存分配给WSL2。为了对此进行限制，我在C：\\Users\\borkdud\\.wslconfig中使用此配置：\n我的PC有惊人的128 GB内存，所以这仍然给Windows留下了36 GB的内存。\n因为我将主要使用这台电脑来工作，所以我在晚上和周末都会把它关掉。为了回到我离开的地方，而不是从头开始我所有的开发过程，我使用Hibernateset。\n我使用Tailscale在我的笔记本和Windows机器之间设置VPN，这样当我出门时就可以通过RDP、emacs tramp和/或nREPL进行连接。\n对于RDP，我使用Microsoft Remote Desktop.app。因为我有视网膜屏幕，所以我启用了“针对视网膜显示进行优化”设置，该设置提供了更好的分辨率。\n作为奖励，我可以为我正在使用的onmacOS：Beyond Compare和Acronis True Image应用程序重复使用我已经拥有的一些许可证。\n我对WSL2、终端应用程序和Docker集成感到惊喜。我使用这个设置只有一周的时间，但到目前为止还不错。\n新机器(Ryzen 3950X)上Windows上WSL2中的#Babashka启动时间相当不错：平均4ms@graalvm pic.twitter.com/TKPPoeFZlL。\n-(λ.。Borkdud)(@borkdud)2020年7月10日", "note_en": "In the last few years I’ve been developing predominantly on AppleMacBooks. Recently I built myself a new PC with a fastprocessor and lots of memory. I wanted to move some of my development tasks tothat machine. I still like the freedom that laptops give me to work fromwherever I want. Be it from the couch in my own home or from a random coffeeplace in the city where I live, I just like to change environment every fewhours and not sit behind my desk all day long. I hadn’t used Windows as myprimary OS for almost 10 years. But since Windows 10 (still) comes with RDP,which is better than VNC in terms of performance, and with WSL2, which offers a“real” and well integrated linux experience, I was curious if I could create asetup for remotely working on the new machine. It also would give me anenvironment to debug Windows specific problems on, which should come in handyfor my side projects like  babashka and clj-kondo. If it didn’t work out, Icould always go dual boot with Ubuntu as the primary dev OS and use VNC if Ineeded to do anything graphical. For what it is worth, here is a report ofsetup process I went through.\n The pristine smell and beauty of a new PC contrasted with the chaotic reality of my home.  pic.twitter.com/3zLIzYg4XB\n— (λ. borkdude) (@borkdude)  July 8, 2020\n  Because I had no other Windows machines in my home, I tried creating a USBWindows installation drive in macOS based on thisblog post. No matter what I tried, at the end of the installation processWindows  would complain with\n Windows installation encountered an unexpected error. Verify that theinstallation sources are accessible, and restart the installation.\n Installing Ubuntu on new PC. The installer is surprisingly smooth, detects my wifi, even nvidia video card apparently. Whereas Windows be like  pic.twitter.com/FQNzeJ6V2X\n— (λ. borkdude) (@borkdude)  July 8, 2020\n  A good friend offered help and created an installation drive using Rufus on his Windows Home installation, which did work.\n Once Windows was installed, I  enabled RDP and installed WSL2,  Ubuntu 20.04,  Windows Terminaland  Docker Desktop for WSL2.\n To be able to run WSL2, I had to enable a virtualization option in my BIOSfirst.\n I intend to use Ubuntu WSL2 as my primary dev environment on this machine, so itmade sense to tweak the  Terminal configurationto open Ubuntu by default, instead of PowerShell. I found it annoying thatUbuntu in Terminal starts in the Windows home directory ( /mnt/c/Users/borkdude), so I set  &#34;startingDirectory&#34;:&#34;//wsl$/Ubuntu-20.04/home/borkdude&#34; in my Ubuntu profile.\n I use zsh as my default shell on macOS and wanted that in WSL2 as well so Iinstalled that using  sudo apt update &amp;&amp; sudo apt install zsh followed by  chsh -s $(whichzsh). I also installed  ohmyzsh and enabled theonly two plugins I use on a daily basis:  git and  jump.\n Then I started porting the dev setup I use for work on my MacBook, mainlyconsisting of Docker images, a couple of Clojure projects, knitted together withsome bash scripts. I use a couple of shell scripts to set all my developmentenvironment variables and aliases for easily setting up ssh tunnels. Theseworked after only making a few tweaks (for example, the ethernet card is calleddifferently in macOS and Ubuntu in WSL2). Of course I needed to install  git toclone my work projects. To run Clojure projects I installed OpenJDK version 8and 11 via  apt. I use  jenv to manage Java versions on a projectbasis, which worked perfectly:\n  Also I installed  boot, a Clojure build tool and the Clojure CLI which are all wellsupported in linux.\n Before running my work projects, I wanted to copy over a PostgreSQL database andother data from my MacBook using  rsync. Before I could do that, I needed toenable  ssh in Ubuntu. I found out I could do this by running  sudo service sshstart but I still could not log in from my MacBook. It turns out you also haveto forward and open up the port in the Windows Firewall. I found thisPowerShell script that lets you do that. As the comment suggests, I also createda scheduled task that runs this script upon Windows login. I did the same thingfor running the  ssh service using  wsl -u root sudo service ssh start. Besure to select  Run using the highest privileges. I’m sure there is a betterway to do this via  systemd in WSL2, but this works for me. So now I could rsync my the data from macOS to WSL2. I started the Docker containers, theClojure projects and it worked! We have a fairly I/O intensive process as partof our stack, which seems to perform well in WSL2.\n Enabling SSH in WSL also lets me use Emacs from my laptop and edit files on theremote machine using  tramp mode. Iran into one issue with this. Since I use a non-standard prompt in zsh, emacstramp could not parse the output from the remote shell. So I added this hack tomy  ~/.zshrc:\n  Emacs sets  TERM to  &#34;dumb&#34; when opening files using  tramp. When this is thecase, I just invoke  bash instead of continuing with  zsh. There may be abetter solution, but this works.\n Of course I also wanted to be able to run Emacs on the machine itself. I firsttried to run Emacs in Windows  natively,but I read somewhere that editing WSL2 files directly from Windows is notrecommended. Also you might run into the line ending differences between Windowsand linux/macOS. I decided to play it safe and install emacs inside WSL2 using apt. If you do decide to use the Windows-native Emacs and have trouble findingwhere emacs expects configuration files, you can find this using  M-xdescribe-variable user-init-file. On my machine that was C:\\Users\\borkdude\\AppData\\Roaming\\.config\\emacs\\init.el.. To get a graphicalUI for the emacs started from WSL2, I needed to install an X-server onWindows. There are plenty of free and open source solutions to choose from, butI chose to buy X410on sale for $9.99 instead of $49.99. It seems to be actively worked on and has good documentation. Toautomatically start X410 on Windows startup I followed theseinstructions. When started, in the tray there is an X icon where you can modifysettings for X410. I have enabled Windowed Apps, Allow Public Access, DPIScaling (High Quality) and Shared Clipboard. To export the right  DISPLAY valuefor GUI applications in WSL2 I have this in my  .zshenv:\n  and then run emacs using  setsid emacs from a zsh session (I created an aliasfor this in my  .zshenv).\n I’m using the exact same emacs config I use on macOS, which is based on @bbatsov’s prelude. It looks and feels the same as onmacOS, although now I probably have to learn the “real” emacs keybindings forcopying ( M-w) and pasting ( C-y) instead of using the macOS keybindings,which may be in fact a nice side effect of this experiment.\n Even connecting to an nREPL server with  cider-connect works seemlessly from mylaptop, provided that I forward and open up the port in Windows Firewall likedescribed above.\n  There is a known  issue withmemory usage of WSL2. Since linux uses non-allocated memory for filesystemcaching, Windows thinks this memory is really used. As time goes by, Windowscould end up allocating all your system’s memory to WSL2. To put a limit tothis, I use this config in  C:\\Users\\borkdude\\.wslconfig:\n  My PC has a whopping 128GB of memory so this still leaves 36GB of memory toWindows.\n As I will mainly use this PC for work, I turn it off at night and during theweekends. To get back where I left, without restarting all my developmentprocesses from scratch, I use the Hibernatesetting.\n I use  Tailscale to set up a VPN between my laptop andWindows machine so I can connect through RDP, emacs tramp and/or nREPL when I gooutside of my home.\n For RDP I use  Microsoft Remote Desktop.app. Since I have a Retina screen, I enabled the “optimize for Retina displays” setting which gives a better resolution.\n As a bonus I can re-use some licenses I already owned for apps I am using onmacOS: Beyond Compare and Acronis True Image.\n I’m pleasantly surprised with WSL2, the Terminal app and Dockerintegration. I’ve only been using this setup for week but so far so good.\n Pretty good startup time of  #babashka in WSL2 on Windows on new machine (Ryzen 3950X): 4ms on average @graalvm  pic.twitter.com/TKPPoeFZlL\n— (λ. borkdude) (@borkdude)  July 10, 2020", "posttime": "2020-07-28 23:29:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,windows,clojure,macos", "title": "将MacOS Clojure Dev安装程序移植到Windows WSL2", "title_en": "Porting a macOS Clojure Dev Setup to Windows WSL2", "transed": 1, "url": "https://blog.michielborkent.nl/2020/07/26/remote-wsl2-clojure/", "via": "", "real_tags": ["程序", "windows", "clojure", "macos"]}, {"category": "", "categoryclass": "", "imagename": "4c6191e8e0770a5a8c172870d0d22db7.png", "infoid": 1014693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(Gdb)b ml_performance_stack_walkBreakpoint 1在0x1c9b8：file stack_walker.c，第64行。(Gdb)runBreakpoint 1，C：64#1 0x0000aaaaad7a0 in caml_c_call()#2 0x0000aaaaac3760 in camlMylib__baz_aaaac3760 in caml_c_call()#2 0x0000aaaaac3760 in caml_c_call()#2 0x0000aaaaaac3760 in caml_c_call()#2 0x0000aaaaaac3760 in camlMylib__baz_121()#3 0x0000。CamlMylib__Baz_121+160&gt；，pooling=&lt；在start_nat.c：163#7 0x0000aaaaadf158中的caml_start_exn(argv=&lt；优化出&gt；)在start_nat.c：173#8 caml_start(argv=；优化出&gt；)在start_nat.c：173#8 caml_start(argv=&lt；优化出&gt；)在start_nat.c：173#8 caml_start(argv=&lt；优化出&gt；)在start_nat.c：173#8 caml_start(argv=&lt；优化出&gt；)", "note_en": "(gdb) b ml_perform_stack_walkBreakpoint 1 at 0x1c9b8: file stack_walker.c, line 64.(gdb) runBreakpoint 1, ml_perform_stack_walk () at stack_walker.c:6464\t if (perform_stack_walk(0) != 0) {(gdb) bt#0 ml_perform_stack_walk () at stack_walker.c:64#1 0x0000aaaaaaade7a0 in caml_c_call ()#2 0x0000aaaaaaac3760 in camlMylib__baz_121 ()#3 0x0000aaaaaaac35a0 in camlDriver__entry ()#4 0x0000aaaaaaac2104 in caml_program ()#5 0x0000aaaaaaade818 in caml_start_program ()#6 0x0000aaaaaaadf114 in caml_startup_common ( argv=0xaaaaaaac3760 &lt;camlMylib__baz_121+160&gt;, pooling=&lt;optimized out&gt;, pooling@entry=0) at startup_nat.c:163#7 0x0000aaaaaaadf158 in caml_startup_exn (argv=&lt;optimized out&gt;) at startup_nat.c:173#8 caml_startup (argv=&lt;optimized out&gt;) at startup_nat.c:173#9 0x0000aaaaaaac1f80 in main (argc=&lt;optimized out&gt;, argv=&lt;optimized out&gt;) at main.c:44(", "posttime": "2020-07-28 23:29:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,添加,add,caml", "title": "OCaml：添加对IOS/Mac ARM64的支持", "title_en": "OCaml: Add support to iOS/Mac ARM64", "transed": 1, "url": "https://github.com/ocaml/ocaml/pull/9699", "via": "", "real_tags": ["ios", "添加", "add", "caml"]}]