[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1009435, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：引文经常被用来衡量科学出版物的影响力。在这里，我们研究从Sci-Hub下载的数量以及出版物及其作者的各种特征如何预测未来的阅读。使用经济学、消费者研究、神经科学和多学科研究的12种主要期刊的数据，我们发现从Sci-Hub下载的文章被引用的次数是从Sci-Hub下载的文章的1.72倍，从Sci-Hub下载的数量是对未来复习的有力预测。在出版物的其他特征中，一份手稿中的人物数量一致地预测了它未来的被引用情况。结果表明，有限的出版物获取可能会限制一些科学研究发挥其全部影响。", "note_en": "Download PDF  Abstract: Citations are often used as a metric of the impact of scientificpublications. Here, we examine how the number of downloads from Sci-hub as wellas various characteristics of publications and their authors predicts futurecitations. Using data from 12 leading journals in economics, consumer research,neuroscience, and multidisciplinary research, we found that articles downloadedfrom Sci-hub were cited 1.72 times more than papers not downloaded from Sci-huband that the number of downloads from Sci-hub was a robust predictor of futurecitations. Among other characteristics of publications, the number of figuresin a manuscript consistently predicts its future citations. The results suggestthat limited access to publications may limit some scientific research fromachieving its full impact.", "posttime": "2020-07-02 15:19:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "下载,hub,出版物", "title": "Sci-Hub效应：SCI-Hub下载导致更多的文章被引用", "title_en": "The Sci-Hub Effect: Sci-Hub downloads lead to more article citations", "transed": 1, "url": "https://arxiv.org/abs/2006.14979", "via": "", "real_tags": ["下载", "hub", "出版物"]}, {"category": "", "categoryclass": "", "imagename": "ddc43c2860664d97ac65d9a882f4617a.jpeg", "infoid": 1009434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二，最高法院以5比4的压倒性裁决，迫使大多数州资助私立宗教学校，迫使数百万美国纳税人补贴基督教教育-即使资助另一种宗教违反了他们自己的信仰。令人难以置信的是，这一最大主义决定对两名保守派法官来说还不够深入，他们显然会让各州建立官方宗教。在异议中，大法官索尼娅·索托马约尔(Sonia Sotomayor)称多数人的决定是“反常的”。这可能是轻描淡写的：它的决定是对世俗治理长达数年的攻击的高潮，预示着未来会有更激进的裁决。\n周二埃斯皮诺莎诉蒙大拿州一案的裁决依据源于蒙大拿州立法机构设计的一项创造性计划，该计划旨在为宗派学校提供资金。蒙大拿州宪法包含一项“无援助”条款，禁止该州向宗教机构提供公共资金，其他37个州宪法也是如此。为了绕过这一规定，立法机构向向大天空奖学金捐款的居民提供税收抵免，大天空奖学金支付学生上私立学校的费用，无论是世俗的还是宗派的。(蒙大拿州的人口结构确保了参加的唯一宗派学校是基督教学校。)。换句话说，当居民帮助孩子们获得包括宗教灌输在内的私立教育时，他们会从国家获得资金。2018年，蒙大拿州最高法院认定该项目违反了州宪法的无援助条款。但法院非但没有排除宗派学校，反而推翻了所有私立教育的整个计划。\n周一，首席大法官约翰·罗伯茨(John Roberts)重启了蒙大拿州的税收抵免计划，这一观点令人费解，它宣布了一项令人震惊的新宪法原则：一旦州政府资助私立教育，“不能仅仅因为一些私立学校是宗教学校就取消它们的资格。”29个州、哥伦比亚特区和波多黎各都为送孩子上私立学校的家庭提供税收抵免或代金券。在埃斯皮诺萨的领导下，他们现在必须将这些项目扩展到私立宗教学校。\n结果是：美国大部分地区的纳税人将很快开始资助公开的宗教教育-包括向儿童灌输一种可能与他们自己的良知相冲突的信仰。例如，参与蒙大拿州奖学金计划的多所学校向学生灌输一种恶毒的反LGBTQ意识形态，将同性恋比作兽交和乱伦。但许多有信仰的蒙大拿州人相信LGBTQ人应该得到尊重和平等，因为他们是按照上帝的形象创造的。对于那些不希望资助与自己信仰相矛盾的宗教灌输的蒙大拿州人，最高法院有什么要说的？简而言之，太糟糕了：你的权利根本无关紧要。这一决定颠覆了第一修正案。修正案的自由行使条款保护宗教自由，而建立条款则命令政府不制定“尊重宗教建立”的法律。就在18年前，在泽尔曼诉西蒙斯-哈里斯案(Zelman v.Simmons-Harris)中，最高法院的微弱多数裁定，根据建立条款，各州可以通过代金券或税收抵免为私立学校提供资金，而不是四名自由派法官的强烈异议。现在最高法院宣布，根据自由行使条款，大多数州都有义务资助私立宗教学校。保守派的多数派在创纪录的时间内彻底改革了教会-国家法律。\n法院是如何描绘这一灾难性进程的呢？当五名法官允许国家资助泽尔曼的宗派学校时，教会和州之间的壁垒受到了打击。当法院在2017年的Trinity Lutheran v.Comer案中扩大宗教机构获得纳税人资金的渠道时，它几乎崩溃了，该案认为，各州不能因为宗教机构是宗教机构而拒绝向它们提供公共福利。法院声称在第一修正案的自由行使条款中发现了这一危险的规则-尽管正如索托马约尔在她激烈的异议中指出的那样，将教会和国家分开并不限制任何人行使其宗教的能力。她在结束时发出警告：“最终，今天的决定是否合理，可能不如它明天可能带来的影响重要。”\n明天已经到来，正如索托马约尔预测的那样荒谬。罗伯茨的多数意见遵循三位一体路德教会的逻辑，得出了令人震惊的结论：首席大法官写道，当一个州基于“学校的宗教性质”而“歧视学校”时，它就违反了自由行使。罗伯茨解释说，除了第一修正案的要求之外，政府在保持政教分离方面没有令人信服的兴趣。政府也没有任何利益来保护纳税人不资助侵犯自己信仰的宗教活动的权利。“我们看不到无援助条款是如何\n在他自己的观点中，阿利托抨击了包括蒙大拿州在内的38个州宪法中的“不援助”条款，他声称这些条款的动机是反天主教的敌意，诚然，19世纪的本土主义者支持这些条款。但阿利托忽略了这样一个事实，即普及教育的倡导者在本土主义者团结起来支持这些条款之前，也出于完全合法的理由鼓励这些条款。他对蒙大拿州在1972年重新选择不援助条款的事实不屑一顾，这一条款的明确目的是保护宗教免受州政府的纠缠。阿利托不会让令人不快的事实阻碍他的竞选活动，他要废除38个州的宪法保证，不允许国家补贴宗教。\n如果说罗伯茨的观点还有一线希望的话，那就是他没有采纳托马斯、戈尔萨奇或阿利托的激进立场。至少，现在还没有。罗伯茨提出的唯一限制原则是，各州“不需要首先补贴私立教育”--因此，从理论上讲，各州可以完全取消对私立学校的公共资助，以避免资助宗教学校。但这就是蒙大拿州最高法院在这里所做的，然而罗伯茨谴责它的决定是“对宗教学校的歧视”。如果立法机构试图根据埃斯皮诺莎法案终止一项代金券计划，最高法院的保守派可以很容易地找到更多反宗教“歧视”的证据，并迫使其重启该计划。由于破坏了对宗教建立的保护，大多数人只受到自己能逃脱惩罚的感觉的限制。\n有关Slate的更多新闻报道，请订阅苹果播客或收听下面的内容。\n像您这样的读者使我们的工作成为可能。帮助我们继续提供您在其他地方找不到的报道、评论和批评。\n加入Slate Plus。\n会合", "note_en": "On Tuesday, in a sweeping 5–4 decision, the Supreme Court forced a majority of states to fund private religious schools in a ruling that compels millions of U.S. taxpayers to subsidize Christian education—even if financing another religion violates their own beliefs. Incredibly, this maximalist decision did not go far enough for two conservative justices who would apparently let states establish an official religion. In dissent, Justice Sonia Sotomayor described the majority’s decision as “perverse.” That may be an understatement: Its decision is the culmination of a yearslong assault on secular governance and augurs even more radical rulings down the road.\n    The basis for Tuesday’s decision in   Espinoza v. Montana  originated in a creative scheme devised by the Montana Legislature to fund sectarian schools. The Montana Constitution contains a “no-aid” provision that bars the state from providing public funds to religious institutions, as do 37 other state constitutions. To work around this rule, the Legislature granted tax credits to residents who donate money to Big Sky Scholarships, which pays for students to attend private schools, both secular and sectarian. (Montana’s demographics  ensure that the only sectarian schools that participate are Christian.) In other words, residents get money from the state when they help children obtain a private education, including religious indoctrination. In 2018, the Montana Supreme Court  found that this program violated the state constitution’s no-aid clause. But instead of excluding sectarian schools, the court struck down the whole scheme for all private education.\n        Chief Justice John Roberts revived Montana’s tax credit scheme on Monday in a convoluted opinion that announces a startling new constitutional principle: Once a state funds private education, “it cannot disqualify some private schools solely because they are religious.” Twenty-nine states, the District of Columbia, and Puerto Rico all provide tax credits or vouchers to families that send their children to private schools. Under  Espinoza, they must now extend these programs to private  religious schools.\n  The upshot: Taxpayers in most of the country will soon start funding overtly religious education—including the indoctrination of children into a faith that might clash with their own conscience. For example, multiple schools that participate in Montana’s scholarship program  inculcate students with a virulent anti-LGBTQ ideology that compares homosexuality to bestiality and incest. But many Montanans of faith believe LGBTQ people deserve respect and equality because they are made in the image of God. What does the Supreme Court have to say to Montanans  who do not wish to fund  religious indoctrination that contradicts their own beliefs? In short, too bad: Your rights just don’t matter as much. This decision flips the First Amendment on its head. The amendment’s free exercise clause protects religious liberty, while its establishment clause commands that the government make no law “respecting an establishment of religion.” Just 18 years ago in   Zelman v. Simmons-Harris, a bare majority of the Supreme Court ruled that, under the establishment clause, states were  allowed to fund private schools through vouchers or tax credits, over vigorous dissents from the four liberal justices. Now the court has declared that, under the free exercise clause, most states are  compelled to fund private religious schools. The conservative majority has revolutionized church-state law in record time.\n      How did the court chart this catastrophic course? The barrier between church and state took a hit when five justices permitted state financing of sectarian schools in  Zelman. It nearly collapsed when the court expanded religious institutions’ access to taxpayer money in 2017’s   Trinity Lutheran v. Comer, which held that states cannot deny public benefits to religious institutions because they are religious. The court claimed to find this  dangerous rule in the First Amendment’s free exercise clause—even though, as Sotomayor pointed out in her searing dissent, separating church and state does not limit anyone’s ability to exercise their religion. She closed with a warning: “In the end, the soundness of today’s decision may matter less than what it might enable tomorrow.”\n    Tomorrow has arrived, and it is as absurd as Sotomayor predicted. Roberts’ majority opinion follows  Trinity Lutheran to its logical, outrageous conclusion: A state violates free exercise, the chief justice wrote, when it “discriminate[s] against schools” based on “the religious character of the school.” The government, Roberts explained, has no compelling interest in preserving the separation of church and state beyond what the First Amendment requires. Nor does the government have  any interest in protecting  taxpayers’ right not to fund religious exercise that infringes upon their own beliefs. “We do not see how the no-aid provision promotes religious freedom,” the chief justice wrote tersely.\n      Perhaps Roberts can’t see it, but James Madison certainly could. As Justice Stephen Breyer wrote in dissent, Madison famously opposed a Virginia bill that would have taxed residents to support teachers of “the Christian Religion,” condemning it as “a signal of persecution” that violates religious liberty. Montana’s Christians-schools-only program illustrates how states that fund religion wind up funding the faith shared by a majority of residents. Breyer, quoting Madison, noted that state funding of a particular religion may “destroy that moderation and harmony” among different faiths that is a hallmark of America’s religious tolerance.\n    This extreme outcome was not enough for Justices Clarence Thomas, Neil Gorsuch, and Samuel Alito. Thomas, joined by Gorsuch, asserted that the very concept of separating church and state “communicates a message that religion is dangerous and in need of policing, which in turn has the effect of tilting society in favor of devaluing religion.” According to Thomas, enforcing church-state separation amounts to “religious hostility” and must end immediately. The justice reached this conclusion by reiterating his  conviction that the First Amendment’s establishment clause was “likely” designed to  preserve states’ ability to establish official religions.\n    In his own separate opinion, Alito attacked the “no-aid” clauses in 38 state constitutions, including Montana’s. He claimed that these provisions were motivated by anti-Catholic animus, and it is true that nativists supported them in the 19 th century. But Alito omitted the fact that advocates for universal education  also encouraged these provisions for perfectly legitimate reasons  before nativists rallied around them. And he waved away the fact that Montana readopted its no-aid clause in 1972  for the express purpose of shielding religion from state entanglement. Alito will not let inconvenient facts stand in the way of his campaign to invalidate 38 states’ constitutional guarantees against state subsidization of religion.\n      If there is any silver lining to Roberts’ opinion, it is that he did not adopt Thomas’, Gorsuch’s, or Alito’s radical positions. At least, not yet. The only limiting principle Roberts lays out is that states “need not subsidize private education” in the first place—so, in theory, states can abolish public funding of private schools entirely to avoid funding religious ones. But that’s what the Montana Supreme Court did here, yet Roberts condemned its decision as “discrimination against religious schools.” If a legislature tries to end a voucher program in light of  Espinoza, the Supreme Court’s conservatives could easily find more proof of anti-religious “discrimination” and force it to revive the program. Having gutted protections against the establishment of religion, the majority is limited only by its own sense of what it can get away with.\n  For more of Slate’s news coverage,    subscribe   to What Next on Apple Podcasts or listen below.\n    Readers like you make our work possible. Help us continue to provide the reporting, commentary, and criticism you won’t find anywhere else.\n  Join Slate Plus\n   Join", "posttime": "2020-07-02 15:18:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学校,court,宗教", "title": "最高法院的裁决迫使纳税人支付私立宗教学校的费用。", "title_en": "Supreme Court ruling forces taxpayers to pay for private religious schools.", "transed": 1, "url": "https://slate.com/news-and-politics/2020/06/supreme-court-espinoza-montana-religious-schools.html", "via": "", "real_tags": ["学校", "court", "宗教"]}, {"category": "", "categoryclass": "", "imagename": "c7da3f57541b2bb64749eccb44ce2b4b.jpg", "infoid": 1009432, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "名为BigSpender的漏洞可能会导致您钱包上的余额不正确，因为您的总余额中会计入未经确认的交易。攻击者可能会在确认事务之前撤销该事务，这可能会导致一些混乱。\n即使您不熟悉加密货币，这种类型的攻击在点对点市场上也很流行，比如Craigslist。比方说你想卖一部手机。有人可能会告诉你，他们想买你的设备，然后给你发一封假的贝宝交易电子邮件。如果你只看这封电子邮件，你可能会认为买家已经把钱寄给你了。但是如果你加载了你的PayPal账户，你可能会注意到买家从来没有给你发过任何东西--那是一封假的付款通知电子邮件。\nBigSpender也可以以同样的方式使用，但与加密货币一起使用。潜在攻击者利用比特币协议中名为按费用替换的功能。此功能允许您发送一些交易费较低的比特币，然后发送相同的加密资产，但交易费较高。\n原来的交易被取消，取而代之的是新的交易。这样一来，新的交易应该会得到更快的确认，因为矿商首先会处理交易费较高的交易。\n但一些加密货币钱包将未经确认的交易视为理所当然，速度有点太快了。当你检查你的余额时，看起来你收到了一些比特币，但发送者可能已经取消了它，以将这笔交易替换为对另一个钱包的另一笔交易-他们控制的钱包。即使交易已经取消，余额仍然反映了那些虚假的交易。\n如果攻击者试图假买一些非常昂贵的东西，他们可以多次使用BigSpender攻击，即使他们没有很多钱。例如，他们可以发起10笔交易，每个交易价值0.1BTC，即使他们收到0BTC，收件人也会看到1BTC的余额。\n由于钱包计算错了余额，攻击者还可以利用BigSpender漏洞冻结您使用的加密资产，并进行“拒绝服务”攻击。当受害者在收到大量虚假交易后试图发送一些比特币时，钱包可能会试图发送从未到达的加密资产。交易失败。\n需要说明的是，您现有的比特币仍然安全。通常，清除应用程序缓存并将钱包与比特币区块链重新同步可以解决这个问题。但你可能不明白为什么你不能使用你的加密资产。\nBigSpender并不是比特币协议中的漏洞--因为它不允许你窃取比特币。但它可能会被用来迷惑用户。展望未来，钱包应该在不增加钱包余额的情况下，清楚地用一个大的“待定”标签标记未确认的交易。使用按费用替换的交易也应标识为失败。\nZengo在90天前已经通过Ledger，Edge和BRD披露了这个漏洞。Ledger和BRD已经向Zengo颁发了错误赏金奖。BRD已经发布了一个修复程序，而BRD和Ledger正在进行修复工作。Zengo还发布了一个开源工具，可以针对BigSpender测试您的钱包，以查看其行为。", "note_en": "Named BigSpender, the vulnerability might lead to an incorrect balance on your wallet as unconfirmed transactions are taken into account in your total balance. The attacker could revoke the transaction before it is confirmed, which could lead to some confusion.\n Even if you’re not familiar with cryptocurrencies, that type of attacks is quite popular on peer-to-peer marketplaces, such as Craigslist. Let’s say you’re trying to sell a phone. Somebody might tell you that they want to buy your device and send you a fake PayPal transaction email. If you just look at the email, you might think the buyer has already sent you the money. But if you load your PayPal account, you might notice that the buyer never sent you anything — it was a fake payment notification email.\n  BigSpender could be used in the same way, but with cryptocurrencies. The potential attacker leverages a feature in the bitcoin protocol called  Replace-by-Fee. This feature lets you send some bitcoins with a low transaction fee and then send the same crypto assets but with a higher transaction fee.\n The original transaction is canceled and replaced with the new one. This way, the new transaction should be confirmed more quickly as miners process transactions with higher transaction fees first.\n But some cryptocurrency wallets take unconfirmed transactions for granted a bit too quickly. When you check your balance, it looks like you’ve receive some bitcoins, but the sender may have canceled it to replace that transaction with another one to  another wallet — a wallet that they control. Even though the transaction has been canceled, the balance still reflects those fake transactions.\n If the attacker is trying to fake-buy something really expensive, they can use the BigSpender attack multiple times even if they don’t have a lot of money. For instance, they could initiate ten transactions each worth 0.1 BTC, the recipient would see a balance of 1 BTC even though they received 0 BTC.\n And because the wallet has miscalculated the balance, attackers could also leverage the BigSpender vulnerability to freeze your crypto assets using with a “denial-of-service” attack. When the victim tries to send some bitcoins after receiving a ton of fake transactions, the wallet might try to send crypto assets that never arrived. The transaction fails.\n To be clear, your existing bitcoins remain safe. Usually, clearing the app cache and resyncing your wallet with the bitcoin blockchain solves that issue. But you might not understand why you can’t use your crypto assets.\n BigSpender isn’t a vulnerability in the bitcoin protocol — it doesn’t let you steal bitcoins. But it can be used to confuse users. Going forward, wallets should clearly mark unconfirmed transactions with a big “pending” label without increasing the balance of the wallet. Transactions that have been replaced using Replace-by-Fee should also be identified as failed.\n ZenGo   has disclosed the vulnerability with Ledger, Edge and BRD 90 days ago. Ledger and BRD have handed bug bounty awards to ZenGo. BRD has released a fix already while BRD and Ledger are working on fixes. ZenGo also  released an open-source tool to test your wallet against BigSpender to see the behavior.", "posttime": "2020-07-02 14:04:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "漏洞,比特币,夸大,bitcoin,交易", "title": "\n某些比特币钱包中的漏洞会导致双重支出攻击和夸大余额", "title_en": "\n\t\t\t\tA vulnerability in some bitcoin wallets leads to double spend attacks and inflated balance\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/01/a-vulnerability-in-some-bitcoin-wallets-leads-to-double-spend-attacks-and-inflated-balance/", "via": "", "real_tags": ["漏洞", "比特币", "夸大", "bitcoin", "交易"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我最近的帖子将Fios家庭路由器的SSID设置为表情符号后，我决定将我的WiFis SSID设置为“̶̛̛́̓̿̈͐͆̐̇̒̑̈́͘͝aaa”。该名称是36个八位字节，超过了2012年标准802.11第6.3.11.2.2节规定的最大32个八位字节。我的路由器只是将名称减少到32个八位字节，但为了保持顺从。这是根据iw a\\xcc\\xb6\\xcc\\x81\\xcc\\x93\\xcc\\xbf\\xcc\\x88\\xcc\\x9b\\xcc\\x9b\\xcd\\x90\\xcd\\x98\\xcd\\x86\\xcc\\x90\\xcd\\x9d\\xcc\\x87\\xcc\\x92\\xcc\\x91\\xcd发送的，原始十六进制为97ccb6cc81cc93ccbfcc88cc9bcc9bcd90cd98cd86cc90cd9dcc87cc92cc91cd.。\n我决定看看它是如何在不同的设备上显示的，并得到了一些相当奇怪的结果。下面是经过测试的设备，大致按照它们的操作方式进行了分类。\nS8和Firestick都以我认为正确的方式呈现了结果，只显示了一些垂直字符截断的名称。\n接下来是iPhone和Apple TV。起初，我不知道他们把这些人物描绘成什么样子。起初我以为它只是扩展的ASCII，但是第三个字符∂不在扩展的ASCII中。在Apple Discorde服务器上打听了一番后，有人说它可能使用的是Mac OS罗马字符集。事实证明，这很奇怪，因为iOS内部使用的是UTF-8，而不是Mac OS Roman，因为随着MacOSX的发布，UTF-8已经被逐步淘汰。\n说到苹果设备，将不会有任何MacOS的照片，尽管不是因为没有尝试过。我无法让我的任何一台Macbook承认这个WiFi网络的存在。无论是Wifi下拉菜单还是机场命令行实用程序都不会显示它。\nWindows10正在使用我认为是每个八位字节的UTF-8字符来呈现它。这与将wifi名称分割成8位字节并将其用作UTF-8字符时的原始十六进制相匹配。\nChromeOS只是被吓坏了，不知道如何呈现除了单数a之外的任何字符。\nKindle和Vizio TV都显示了与a一起返回的ic，然后转义的十六进制字符。", "note_en": "After my recent post  Setting the SSID of a Fios Home Router to an emoji I decided to set my WiFis SSID to “á̶̛̛̓̿̈͐͆̐̇̒̑̈́͘͝aaa”. That name is  36 octets making it over the 32 octets maxium specified in the 2012 standard of 802.11 Section 6.3.11.2.2. My router just cut the name down to 32 octets though to stay complient. This was what was being sent according to  iw  a\\xcc\\xb6\\xcc\\x81\\xcc\\x93\\xcc\\xbf\\xcc\\x88\\xcc\\x9b\\xcc\\x9b\\xcd\\x90\\xcd\\x98\\xcd\\x86\\xcc\\x90\\xcd\\x9d\\xcc\\x87\\xcc\\x92\\xcc\\x91\\xcd with the raw hex being  97ccb6cc81cc93ccbfcc88cc9bcc9bcd90cd98cd86cc90cd9dcc87cc92cc91cd.\n  I decided to see how this showed up on different devices and got some pretty strange results. Below are the devices tested sorted rougly to how they acted.\n      Both the s8 and the Firestick are rendering the result in what I deem as the correct way with it showing the name just with some of the vertical characters cutoff.\n      Next comes the iPhone and Apple TV. At first I had no idea what they were rending these characters as. At first I thought it was just extended ascii but that third character, ∂, was not in extended ASCII. After asking around on the Apple discord server someone said it might be using the  Mac OS Roman character set. It turns out it which is strange because iOS used UTF-8 internally and not Mac OS Roman as that was phased out with the release of Mac OS X.\n  Speaking of Apple devices, there will not be any photos of MacOS though not from a lack of trying. I could not get either of my Macbook to acknowledge that this WiFi network existed. Neither the Wifi dropdown nor the airport commandline utility would show it.\n    Windows 10 is rendering it using what I believe to be the UTF-8 characters of each octet. This matches what the raw hex of the wifi name would become if you split it up into 8bit bytes and used that as UTF-8 chars.\n    ChromeOS is just freaking out not knowing how to render any of the charaters besides the singular a.\n      Both the Kindle and Vizio TV are showing what  ic returned with the a and then escaped hexademical characters.", "posttime": "2020-07-02 13:43:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "显示,devices,xcc", "title": "比较不同设备如何显示ssid“á̶̛̛̓̿̈͐͆̐̇̒̑̈́͘͝aaa”", "title_en": "Comparing how different devices display the SSID “á̶̛̛̓̿̈͐͆̐̇̒̑̈́͘͝aaa”", "transed": 1, "url": "https://hamptonmoore.com/posts/weird-wifi-name-display/", "via": "", "real_tags": ["显示", "devices", "xcc"]}, {"category": "", "categoryclass": "", "imagename": "40e54b947e49397d1e2df6ec72b805aa.jpg", "infoid": 1009429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "勒索软件的威胁可能看起来无处不在，但自从4年前第一款成熟的Mac勒索软件浮出水面以来，还没有太多专门为感染苹果Mac电脑而量身定做的病毒。因此，当K7实验室(K7 Lab)的恶意软件研究员迪内什·德瓦多斯(Dinesh Devadoss)周二发布关于Mac勒索软件新示例的发现时，这一事实本身就意义重大。然而，事实证明，研究人员现在称之为ThiefQuest的恶意软件从那里变得更有趣了。(研究人员最初将其命名为EvilQuest，直到他们发现了同名的蒸汽游戏系列。)。\n除了勒索软件，ThiefQuest还有一整套间谍软件功能，允许它从受感染的计算机中渗出文件，在系统中搜索密码和加密货币钱包数据，并在用户键入密码、信用卡号码或其他财务信息时运行强大的键盘记录程序来获取密码、信用卡号码或其他财务信息。间谍软件组件还一直潜伏在受感染设备上作为后门，这意味着即使在计算机重新启动后，它也会继续存在，并可能被用作额外或第二阶段攻击的发射台。考虑到勒索软件在Mac电脑上非常罕见，这一双重打击尤其值得注意。\n看一下代码，如果您将勒索软件逻辑从所有其他后门逻辑中分离出来，那么这两部分作为单独的恶意软件是完全有意义的。但是把它们汇总在一起，你会觉得怎么样呢？Mac管理公司JAMF的首席安全研究员帕特里克·沃德尔(Patrick Wardle)说。我目前对这一切的直觉是，基本上有人在设计一款Mac恶意软件，让他们能够完全远程控制受感染的系统。然后，他们还添加了一些勒索软件功能，作为赚取额外收入的一种方式。\n尽管ThiefQuest功能非常强大，但除非你下载盗版、未经审查的软件，否则它不太可能在短期内感染你的Mac电脑。安全公司Malwarebytes的Mac和移动平台总监托马斯·里德(Thomas Reed)发现，ThiefQuest正在捆绑了名牌软件的Torrent网站上分发，比如安全应用程序Little Snitch、DJ软件Mixed in Key和音乐制作平台Ableton。K7&39；的Devadoss指出，恶意软件本身被设计成看起来像谷歌软件更新程序。不过，研究人员表示，到目前为止，它的下载量似乎并不高，也没有人为攻击者提供的比特币地址支付赎金。\n要想让你的Mac受到感染，你需要破解一个被攻破的安装程序，然后无视苹果发出的一系列警告才能运行它。这是一个很好的提醒，要从值得信赖的来源获得你的软件，比如那些代码由苹果签署以证明其合法性的开发者，或者从苹果的App Store本身获得。但是，如果你是一个已经泛滥程序的人，并且习惯了忽视苹果的旗帜，那么ThiefQuest就说明了这种方法的风险。\n尽管ThiefQuest拥有一套广泛的功能，可以将勒索软件与间谍软件融合在一起，但最终结果如何尚不清楚，特别是因为勒索软件组件似乎不完整。恶意软件显示了一张要求付款的赎金纸条，但它只列出了受害者可以汇款的静态比特币地址。鉴于比特币的匿名特性，打算在收到付款后解密受害者系统的攻击者将无法分辨谁已经付款，谁没有付款。此外，这张便条没有列出受害者可以用来与攻击者就收到解密密钥进行通信的电子邮件地址，这是恶意软件可能实际上并不打算用作勒索软件的另一个迹象。JAMF的Wardle在他的分析中还发现，虽然恶意软件拥有解密文件所需的所有组件，但它们似乎没有设置为在野外实际运行。\n研究人员还强调，希望用间谍软件进行秘密侦察的攻击者通常希望尽可能地分散和不引人注目。将勒索软件添加到混搭中只会宣布恶意软件的存在，并可能会改变用户在设备上的行为，因为他们的所有文件都被加密了，而且他们在屏幕上看到了戏剧性的赎金字条。在这种情况下，你不可能随便网购或登录你的银行账户。出于同样的原因，勒索软件通常不需要在设备上建立持久性并持续到重新启动，因为它只需要启动加密过程。当程序宣布自己为恶意软件并持续存在时，这只会使安全社区更有可能在将来标记和分析该软件以阻止它。\n我想，如果你的主要目标是数据外泄，你会想留在后台。\n该恶意软件确实包括一些模糊功能，以帮助其隐藏起来。如果检测到某些安全工具，如Norton Antivirus，恶意软件将不会运行。如果它是在经常用于安全测试的数字环境(如沙盒或虚拟机)中打开，也会显得很低调。在分析代码本身时，研究人员说，有些组件被小心地遮蔽了，因此很难理解它们的作用。然而，奇怪的是，其他人却被遗漏在开放的地方，让任何人都能看到。\n沃德尔推测，恶意软件可能是为了先悄悄运行其间谍软件模块，收集有价值的数据，然后才启动嘈杂的勒索软件，作为在继续前进之前从受害者那里收集一些资金的最后努力。在测试中，一些研究人员发现比其他人更难诱导恶意软件开始加密文件作为其勒索软件功能的一部分，这可能支持沃德尔的理论。但该恶意软件有漏洞，目前尚不清楚开发者的真正意图是什么。\n鉴于恶意软件是通过洪流传播的，似乎专注于偷钱，而且仍然存在一些漏洞，研究人员表示，它很可能是由犯罪黑客创建的，而不是寻求进行间谍活动的民族国家间谍。在Windows恶意软件领域，将勒索软件伪装成分散注意力或虚假标志的情况并不少见。NotPetya恶意软件造成了历史上影响最大、代价最高的网络攻击，毕竟它伪装成了勒索软件。尽管如此，考虑到Mac勒索软件是如此罕见，看到ThiefQuest采取如此晦涩的方法是令人惊讶的。\n也许恶意软件正在使用勒索软件的标志性文件加密作为破坏性工具，试图永久地将用户锁定在他们的计算机之外。或者，也许ThiefQuest只是希望从受害者那里获得尽可能多的钱。和往常一样，Mac勒索软件的真正问题是，接下来会发生什么？\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "The threat of ransomware may seem ubiquitous, but there haven&#39;t been too many strains tailored specifically to infect Apple&#39;s Mac computers since the  first full-fledged Mac ransomware surfaced only four years ago. So when Dinesh Devadoss, a malware researcher at the firm K7 Lab,  published findings on Tuesday about a new example of Mac ransomware, that fact alone was significant. It turns out, though, that the malware, which researchers are now calling ThiefQuest, gets more interesting from there. (Researchers originally dubbed it EvilQuest, until they discovered the Steam game series of the same name.)\n In addition to ransomware, ThiefQuest has a whole other set of spyware capabilities that allow it to exfiltrate files from an infected computer, search the system for passwords and cryptocurrency wallet data, and run a robust keylogger to grab passwords, credit card numbers, or other financial information as a user types it in. The spyware component also lurks persistently as a backdoor on infected devices, meaning it sticks around even after a computer reboots, and could be used as a launchpad for additional, or &#34;second stage,&#34; attacks. Given that ransomware is so rare on Macs to begin with, this one-two punch is especially noteworthy.\n &#34;Looking at the code, if you split the ransomware logic from all the other backdoor logic the two pieces completely make sense as individual malware. But compiling them together you’re kind of like what?&#34; says Patrick Wardle, principal security researcher at the Mac management firm Jamf. &#34;My current gut feeling about all of this is that someone basically was designing a piece of Mac malware that would give them the ability to completely remotely control an infected system. And then they also added some ransomware capability as a way to make extra money.&#34;\n  Though ThiefQuest is packed with menacing features, it&#39;s unlikely to infect your Mac anytime soon unless you download pirated, unvetted software. Thomas Reed, director of Mac and mobile platforms at the security firm Malwarebytes,  found that ThiefQuest is being distributed on torrent sites bundled with name-brand software, like the security application Little Snitch, DJ software Mixed In Key, and music production platform Ableton. K7&#39;s Devadoss notes that the malware itself is designed to look like a &#34;Google Software Update program.&#34; So far, though, the researchers say that it doesn&#39;t seem to have a significant number of downloads, and no one has paid a ransom to the Bitcoin address the attackers provide.\n  For your Mac to become infected, you would need to torrent a compromised installer and then dismiss a series of warnings from Apple in order to run it. It&#39;s a good reminder to get your software from trustworthy sources, like developers whose code is &#34;signed&#34; by Apple to prove its legitimacy, or from Apple&#39;s App Store itself. But if you&#39;re someone who already torrents programs and is used to ignoring Apple&#39;s flags, ThiefQuest illustrates the risks of that approach.\n   Though ThiefQuest has an extensive suite of capabilities in fusing ransomware with spyware, it&#39;s unclear for what ends, particularly because the ransomware component seems incomplete. The malware shows a ransom note that demands payment, but it only lists a static Bitcoin address where victims can send money. Given Bitcoin&#39;s anonymity features, attackers who intended to decrypt a victim&#39;s systems upon receiving payment would have no way to tell who had paid already and who hadn&#39;t. Additionally, the note doesn&#39;t list an email address that victims can use to correspond with the attackers about receiving a decryption key—another sign that the malware may not actually be intended as ransomware. Jamf&#39;s Wardle also found in  his analysis that while the malware has all the components it would need to decrypt the files, they don&#39;t seem to be set up to actually function in the wild.\n  The researchers also emphasize that attackers looking to conduct clandestine reconnaissance with spyware usually want to be as discrete and inconspicuous as possible. Adding ransomware into the mix simply announces the malware&#39;s presence and would likely change a user&#39;s behavior on the device, because all of their files are being encrypted and they&#39;re seeing a dramatic ransom note on their screen. It&#39;s not a situation where you would be likely to do some casual online shopping or log into your bank account. By the same token, ransomware doesn&#39;t usually need to establish persistence on a device and endure through reboots, because it simply needs to initiate the encryption process. When a program announces itself as malware and then persists, it simply makes it more likely that the security community will flag and analyze the software to block it in the future.\n &#34;I would think if your main goal was data exfiltration you would want to stay in the background, do that as silently as possible, and have the best chance of going undetected,&#34; Malwarebytes&#39; Reed says. &#34;So I don’t really understand the point of this very noisy ransomware. When I installed it for testing, every 30 seconds the computer was screaming at me, beeping at me all the time. It&#39;s really noisy in both the literal and digital sense.&#34;\n The malware does include some obfuscation features to help it hide out. The malware won&#39;t run if it detects certain security tools like Norton Antivirus. It also lays low if it&#39;s being opened in a digital environment that&#39;s often used for security testing, like a sandbox or virtual machine. And when analyzing the code itself, the researchers say that some components were carefully obscured so it would be difficult to understand what they do. Strangely, though, others were left out in the open for anyone to see.\n Wardle theorizes that the malware may have been intended to quietly run its spyware module first, collect valuable data, and only launch the noisy ransomware as a last-ditch effort to gather some funds from a victim before moving on. In testing, some researchers found it harder than others to induce the malware to start encrypting files as part of its ransomware functionality, which may support Wardle&#39;s theory. But the malware is buggy and for now it&#39;s unclear what the developers&#39; true intent is.\n Given that the malware is being distributed through torrents, seems to focus on stealing money, and still has some kinks, the researchers say it was likely created by criminal hackers rather than nation state spies looking to conduct espionage. It&#39;s not entirely uncommon in the realm of Windows malware to don a ransomware guise as a distraction or false flag. The NotPetya malware, which caused the  most impactful and costly cyberattack in history, pretended to be ransomware, after all. Still, given how rare Mac ransomware is, it&#39;s surprising to see ThiefQuest take such a murky approach.\n Perhaps the malware is using ransomware&#39;s hallmark file encryption as a destructive tool in an attempt to permanently lock users out of their computers. Or maybe ThiefQuest is just looking to get as much money out of victims as possible. The real question with Mac ransomware, as always, is what will come next?\n   👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-07-02 13:25:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,ransomware,恶意软件", "title": "新的Mac勒索软件比看起来更险恶", "title_en": "New Mac Ransomware Is Even More Sinister Than It Appears", "transed": 1, "url": "https://www.wired.com/story/new-mac-ransomware-thiefquest-evilquest/", "via": "", "real_tags": ["软件", "恶意软件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一段时间以来，我一直有一种理论，认为苹果的推送通知政策对开源软件体系结构以及项目的成功程度有非常重要的影响。这对于像啤酒一样免费的模式和去中心化的模式来说是最具挑战性的。如果iOS聊天应用程序想要监控服务器的实时更新，它会被阻止在后台保持打开的TCP连接。它还被禁止轮询任何一致性的更新。它获得这些实时更新的唯一可靠方式是通过APNS，这是一项基于互联网的苹果服务。唯一可以触发这些更新的人是应用程序的创建者。如果您的体系结构意味着不同的人负责客户端应用程序和包含您的数据的服务器，则会产生一系列不良后果。如果你找不到令人满意的解决方案，你实际上就会被iOS市场拒之门外。几年前，我在Matrix如何解决它的上下文中详细讨论了这一点。\n这么长时间以来，当我看到某个WWDC20视频时，我做了一个小翻拍。它声称，在iOS14中，你可以“在没有互联网连接的情况下，将通知从你的应用服务器发送到网络上的设备”。等待-这意味着APNS不在考虑范围之内，现在有一些自托管的方式来传递可靠的推送通知。这是不是每个XMPP和FEDITY服务器都有权在一旁实现自己的推送通知呢？不行!。一定有什么圈套。\n当然有个圈套。主要的限制是，只有当你连接到WiFi网络时，它才能工作。如果你只有蜂窝互联网，那么你就只能回到APNS了。另一个是您必须能够用代码指定将在其中激活本地推送通知的网络SSID列表。也许您在想您可以动态地填写这些信息吗？嗯，也许吧，但是获取当前连接的SSID本身可能是个问题。\n他们在视频中反复表示，它针对的是非常具体的使用案例，特别是游轮上的即时通讯应用程序。在这种情况下，这些限制是有意义的。这只有足够的回旋余地来解决问题，仅此而已。\n令我惊讶的是，App扩展获得了如此大的自由。虽然我自己还没有测试过测试版，但它似乎可以在您使用SSID的整个过程中运行，并且它可以实现它想要与您的专有服务器对话的任何协议。这在保护应用程序不会耗尽你的电池方面是一个相当重要的开拓。它需要一项授权，我认为这将是App Store特别关注的一面旗帜。否则，我可以想象一个邪恶的应用程序，它已经可以使用CNCopyCurrentNetworkInfo进行位置访问，并且在用户在家、工作等任何时候都可以跟踪这个新功能，而不是主动使用位置权限。\n分散的项目可能会为此找到合适的用途。如果您的家庭局域网上有一项自我托管的服务，您完全可以构建一个客户端，在您在家时向您提供推送通知。然而，如果这样的应用程序让你输入你的SSID，没有什么可以说它会通过App Store的审查，除非你恰好住在一艘游轮上。", "note_en": "For a while I’ve had a theory that Apple’s push notification policies have a weirdly significant effect on open source software architecture and how successful projects can be. This is most challenging for free-as-in-beer and decentralised models. If an iOS chat app wants to monitor the server for realtime updates, it’s prevented from holding a TCP connection open in the background. It’s also prevented from polling for updates with any consistency. Its only reliable way to get those realtime updates is through  APNs, a internet-based Apple service. The only person who can  trigger those updates is the creator of the app. If your architecture means that different people are responsible for the client app and for the server containing your data, this creates a range of undesirable consequences. If you don’t find a satisfactory solution you’re effectively locked out of the iOS market. I discussed this in detail  a few years ago in the context of how  Matrix works around it.\n It’s been this way for so long that I did a small double take when I spotted  a certain WWDC20 video. It claims that in iOS 14 you can “deliver notifications from your application server to devices on networks without an internet connection”. Hold up—this means APNs is out of the picture and there is now some  self-hosted way to deliver reliable push notifications. Is this  carte blanche for every XMPP and fediverse server to implement their own push notifications on the side? No way! There has to be some catch.\n Of course there’s a catch. The main limitation is that it only works when you’re connected to a WiFi network. If you only have cell internet then you’re back to APNs only. The other is that you have to be able to specify, in code, the list of network SSIDs where local push notifications will be active. Perhaps you’re thinking you could fill in this information dynamically? Well, maybe, but getting the currently connected SSID  can be a problem in itself.\n They say repeatedly in the video that it’s targeted at very specific use cases, messaging apps on cruise ships in particular. In this context the restrictions make sense. It’s just enough wiggle room to solve the problem and not much more.\n What did surprise me was how much freedom the App Extension gets. While I haven’t tested the beta myself, it appears it gets to run the whole time you’re on that SSID and it can implement whatever protocol it wants to talk to your proprietary server. That’s a pretty significant carve-out in the protection against apps draining your battery. It requires an entitlement, which I assume will be a flag for special attention at the App Store. Otherwise I could imagine a nefarious app that already has location access using  CNCopyCurrentNetworkInfo together with this new feature to track whenever a user is at home, work, etc., without actively using the location permission.\n It’s possible that decentralised projects will find niche uses for this. If you had a service self-hosted on your home LAN, you could absolutely build a client that gives you push notifications while you’re at home. However if such an app lets you type in your SSID, there’s nothing to say it will pass App Store review, unless you happen to live on a cruise ship.", "posttime": "2020-07-02 13:24:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推送,area,应用程序", "title": "局域网推送通知", "title_en": "Local area network push notifications", "transed": 1, "url": "https://thomask.sdf.org/blog/2020/07/01/local-area-network-push-notifications.html", "via": "", "real_tags": ["推送", "area", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于大多数用户将在不同的应用程序之间重复使用密码，因此即使应用程序或数据库遭到破坏，存储密码的方式也要防止攻击者获取密码，这一点很重要。与密码学的大多数领域一样，需要考虑许多不同的因素，但幸运的是，大多数现代语言和框架都提供了内置功能来帮助存储密码，这处理了大部分复杂性。\n本小抄就需要考虑的与存储密码相关的各个方面提供了指导。简而言之：\n散列和加密是经常混淆或使用不当的两个术语。它们之间的关键区别在于散列是单向函数(即，不可能解密散列并获得原始值)，而加密是双向函数。\n在几乎所有情况下，密码都应该是散列的，而不是加密的，因为这会使攻击者很难或不可能从散列中获取原始密码。\n只有在需要能够获取原始密码的边缘情况下才应使用加密。以下是可能需要这样做的一些示例：\n如果应用程序需要使用密码针对不支持SSO的外部旧系统进行身份验证。\n解密密码的能力存在严重的安全风险，因此应该对其进行全面的风险评估。在可能的情况下，应使用替代体系结构，以避免需要以加密形式存储密码。\n此小抄重点介绍密码散列-有关加密密码的进一步指导，请参阅加密存储小抄。\n虽然无法解密密码散列以获得原始密码，但在某些情况下可以破解散列。基本步骤包括：\n然后对大量潜在候选密码重复此过程，直到找到匹配项。有大量不同的方法可用于选择候选密码，包括：\n不能保证破解过程一定会成功，成功率将取决于多个因素：\n用现代散列算法存储的强密码应该是攻击者实际上不可能破解的。\n盐是作为散列过程的一部分添加到每个密码的唯一的、随机生成的字符串。由于盐对于每个用户都是唯一的，所以攻击者必须使用各自的盐一次破解一个散列，而不是一次计算一次散列并将其与每个存储的散列进行比较。这使得破解大量散列变得非常困难，因为所需的时间与散列的数量成正比增长。\nSalting还提供保护，防止攻击者使用彩虹表或基于数据库的查找预先计算散列。最后，加盐意味着在不破解散列的情况下无法确定两个用户是否具有相同的密码，因为即使密码相同，不同的加盐也会导致不同的散列。\n现代散列算法(如Argon2或bcrypt)会自动对密码进行加密，因此在使用它们时不需要额外的步骤。但是，如果您使用的是传统密码散列算法，则需要手动实施加盐。执行此操作的基本步骤包括：\n除了腌制之外，还可以使用胡椒来提供额外的保护层。它类似于盐，但有两个主要区别：\n胡椒在所有存储的密码之间共享，而不是像盐一样是唯一的。\n如果攻击者只有访问数据库的权限(例如，如果他们利用了SQL注入漏洞或获得了数据库的备份)，则Pepper的用途是防止攻击者能够破解任何散列。\n胡椒的长度应至少为32个字符，并且应随机生成。应使用操作系统提供的安全存储API将其存储在应用程序配置文件中(使用适当的权限进行保护)，或存储在硬件安全模块(HSM)中。\n传统上，胡椒的使用方式类似于盐，在散列之前将其与密码连接在一起，使用诸如hash($Pepper)这样的结构。$PASSWORD)。\n另一种方法是像往常一样对密码进行散列，然后使用对称加密密钥对散列进行加密，然后将其存储在数据库中，密钥充当胡椒。这避免了传统胡椒方法的一些问题，而且如果胡椒被认为是受损的，它可以更容易地旋转胡椒。\n辣椒的主要问题是它们的长期维护。更改使用中的胡椒将使存储在数据库中的所有现有密码无效，这意味着在胡椒被泄露的情况下不能轻易更改密码。\n一种解决方案是将胡椒的ID与相关的密码散列一起存储在数据库中。当需要更新胡椒时，可以使用新胡椒更新此ID以获取散列。尽管应用程序需要存储当前正在使用的所有辣椒，但这确实提供了一种替换受损辣椒的方法。\n工作因子实质上是为每个密码执行的散列算法的迭代次数(通常实际上是2^工作迭代)。工作因数的目的是使计算哈希的计算成本更高，从而降低攻击者尝试破解密码哈希的速度。功因数通常存储在散列输出中。\n在选择工作因素时，需要在安全性和性能之间取得平衡。较高的工作系数将使攻击者更难破解散列，但也会使验证登录尝试的过程变慢。如果工作因数过高，这可能会降低应用程序的性能，还可能被攻击者用来通过大量登录尝试耗尽服务器的CPU来执行拒绝服务攻击。\n理想的工作因子没有金科玉律-它将取决于服务器的性能和应用程序上的用户数。确定最佳工作因数需要在应用程序使用的特定服务器上进行实验。一般来说，计算一个散列应该不到一秒，尽管在流量较高的站点上，计算散列的时间应该比这少得多。\n具有功因数的一个关键优点是，随着硬件变得更强大和更便宜，它可以随着时间的推移而增加。以摩尔定律(即，给定价格点的计算能力每18个月翻一番)为粗略近似值，这意味着功因数应该每18个月增加1。\n升级工作因数最常见的方法是等待用户下次进行身份验证，然后使用新的工作因数重新散列其密码。这意味着不同的哈希将具有不同的工作因子，如果用户不重新登录到应用程序，可能会导致哈希永远不会升级。根据应用程序的不同，可能适合删除较旧的密码散列，并要求用户下次需要登录时重置其密码，以避免存储较旧且安全性较低的散列。\n在某些情况下，可以在没有原始密码的情况下增加散列的工作因子，尽管bcrypt和PBKDF2等常见散列算法不支持这一点。\n某些散列算法(如bcrypt)具有输入的最大长度，对于大多数实现来说是72个字符(有一些报告称其他实现具有较低的最大长度，但在撰写本文时还没有确定)。在使用bcrypt的情况下，应该强制输入最大长度为64个字符，因为这提供了足够高的限制，同时仍然允许字符串终止问题，并且不会显示应用程序使用bcrypt。\n此外，由于现代散列函数在计算上非常昂贵，如果用户可以提供非常长的密码，则存在潜在的拒绝服务漏洞，例如2013年发布在Django上的漏洞。\n为了防止这两个问题，应该强制使用最大密码长度。对于bcrypt，此字符数应为64个字符(由于算法和实现中的限制)，对于其他算法，此字符数应介于64到128个字符之间。\n另一种方法是使用诸如SHA-256之类的快速算法来预散列用户提供的密码，然后使用诸如bcrypt(即，bcrypt(sha256($password)之类的更安全的算法来散列所得到的散列。虽然此方法解决了用户对速度较慢的散列算法的任意长度输入的问题，但它也引入了一些漏洞，使攻击者能够更容易地破解散列。\n如果攻击者能够从两个不同的来源获取密码散列，其中一个来源使用bcrypt(sha256($password))存储密码，另一个来源将密码存储为纯sha256($password)，并且攻击者可以使用来自第二个站点的未破解的SHA-256散列作为候选密码，尝试破解来自第一个(更安全的)站点的散列。如果在两个站点之间重复使用密码，这可以有效地允许攻击者剥离bcrypt层，并破解容易得多的SHA-256密码。\n使用SHA-256进行预散列还意味着攻击者暴力强制散列的密钥空间是2^256，而不是上限为64个字符的密码的2420(尽管这两个密钥都足够大，不会产生任何实际影响)。\n最后，在使用预散列时，请确保第一个散列算法的输出安全地编码为十六进制或base64，因为如果输入包含空字节，某些散列算法(如bcrypt)可能会以不受欢迎的方式运行。\n因此，首选选项通常应该是限制最大密码长度。密码的预散列应仅在有特定要求且已采取适当步骤缓解上述问题的情况下执行。\n有许多专门为安全存储密码而设计的现代散列算法。这意味着它们应该很慢(不同于MD5和SHA-1等被设计为快速的算法)，它们的速度可以通过更改工作因子来配置。\nArgon2是2015年密码散列大赛的获胜者。该算法有三个不同的版本，应该在可用的情况下使用Argon2id变体，因为它提供了一种平衡的方法来抵抗旁路攻击和基于GPU的攻击。\n与其他算法不同的是，Argon2有三个可以配置的不同参数，这意味着要针对环境进行正确的调优要复杂得多。该规范包含选择适当参数的指导，但是，如果您不能适当地调优它，那么更简单的算法(如bcrypt)可能是更好的选择。\nPBKDF2是NIST推荐的，具有经过FIPS-140验证的实施。因此，当需要这些时，它应该是首选算法。此外，它在.NET框架中受到开箱即用的支持，因此通常在ASP.NET应用程序中使用。\nPBKDF2可以与基于多种不同散列算法的HMAC一起使用。HMAC-SHA-256受到广泛支持，并由NIST推荐。\nPBKDF2的工作因子是通过迭代计数实现的，迭代计数应至少为10,000(尽管在安全性较高的环境中，最大值可能为100,000)。\nbcrypt是最受支持的算法，除非对PBKDF2有特定要求，或者有适当的知识来调优Argon2，否则应该将其作为默认选择。\nbcrypt的默认工作因子是10，除非在较旧或功率较低的系统上运行，否则通常应该将其提高到12。\n在某些情况下，通常由于使用遗留语言或环境，不可能使用现代散列算法。在可能的情况下，应该使用第三方库来提供这些算法。但是，如果唯一可用的算法是MD5和SHA-1等传统算法，则可以采取许多步骤来提高存储密码的安全性。\n使用加密安全的随机数生成器生成的每个密码使用唯一的SALT。\n使用非常多的算法迭代次数(至少10,000次，根据硬件的速度可能更多)。\n应该强调的是，这些步骤不如使用现代散列算法，并且只有在没有其他选择的情况下才应该采取这种方法。\n对于使用不太安全的散列算法(如MD5或SHA-1)构建的较旧的应用程序，这些散列应该升级到更现代、更安全的散列。当用户下一次输入他们的密码时(通常通过在应用程序上进行身份验证)，应该使用新算法对其进行重新散列。让用户当前密码过期并要求他们输入新密码也是一种好做法，这样他们密码的任何较旧(安全性较低)的散列对攻击者都不再有用。\n但是，这种方法意味着旧的(不太安全的)密码散列将存储在数据库中，直到用户下次登录，并且可能会无限期存储。可以采取两种主要方法来解决此问题。\n一种方法是过期并删除长期不活动的用户的密码散列，并要求他们重新设置密码才能再次登录。虽然安全，但这种方法对用户不是特别友好，并且大量用户的密码过期可能会给支持人员带来问题，或者可能被用户解释为入侵的指示。但是，如果在登录时实现密码散列升级代码与删除旧密码散列之间存在合理的延迟，则大多数活动用户应该已经更改了他们的密码。\n另一种方法是使用现有密码散列作为更安全算法的输入。例如，如果应用程序最初将密码存储为MD5($PASSWORD)，则可以轻松将其升级为bcrypt(MD5($PASSWORD))。以这种方式分层散列避免了知道原始密码的需要，但是它可以使散列更容易被破解，如预散列一节中所讨论的那样。因此，这些散列应该在用户下次登录时替换为用户密码的直接散列。\n编写自定义加密代码(如散列算法)真的很难，永远不应该在学术练习之外完成。使用未知或定制的算法可能带来的任何潜在好处都会被其中存在的弱点所掩盖。", "note_en": "As the majority of users will re-use passwords between different applications, it is important to store passwords in a way that prevents them from being obtained by an attacker, even if the application or database is compromised. As with most areas of cryptography, there are many different factors that need to be considered, but fortunately, the majority of modern languages and frameworks provide built-in functionality to help store passwords, which handles much of the complexity.\n This Cheat Sheet provides guidance on the various areas that need to be considered related to storing passwords. In short:\n    Hashing and encryption are two terms that are often confused or used incorrectly. The key difference between them is that hashing is a  one way function (i.e, it is not possible to &#34;decrypt&#34; a hash and obtain the original value), whereas encryption is a two-way function.\n In almost all circumstances, passwords should be hashed rather than encrypted, as this makes it difficult or impossible for an attacker to obtain the original passwords from the hashes.\n Encryption should only be used in edge cases where it is necessary to be able to obtain the original password. Some examples of where this might be necessary are:\n If the application needs to use the password to authenticate against an external legacy system that doesn&#39;t support SSO.\n The ability to decrypt passwords represents a serious security risk, so it should be fully risk assessed. Where possible, an alternative architecture should be used to avoid the need to store passwords in an encrypted form.\n This Cheat Sheet is focused on password hashing - for further guidance on encrypting passwords see the  Cryptographic Storage Cheat Sheet.\n  Although it is not possible to &#34;decrypt&#34; password hashes to obtain the original passwords, in some circumstances it is possible to &#34;crack&#34; the hashes. The basic steps are:\n  This process is then repeated for a large number of potential candidate passwords until a match is found. There are a large number of different methods that can be used to select candidate passwords, including:\n  The cracking process is not guaranteed to be successful, and the success rate will depend on a number of factors:\n  Strong passwords stored with modern hashing algorithms should be effectively impossible for an attacker to crack.\n   A salt is a unique, randomly generated string that is added to each password as part of the hashing process. As the salt is unique for every user, an attacker has to crack hashes one at a time using the respective salt, rather than being able to calculate a hash once and compare it against every stored hash. This makes cracking large numbers of hashes significantly harder, as the time required grows in direct proportion to the number of hashes.\n Salting also provides protection against an attacker pre-computing hashes using rainbow tables or database-based lookups. Finally, salting means that it is not possible to determine whether two users have the same password without cracking the hashes, as the different salts will result in different hashes even if the passwords are the same.\n Modern hashing algorithms such as Argon2 or Bcrypt automatically salt the passwords, so no additional steps are required when using them. However, if you are using a  legacy password hashing algorithm then salting needs to be implemented manually. The basic steps to perform this are:\n   A  pepper can be used in addition to salting to provide an additional layer of protection. It is similar to a salt but has two key differences:\n The pepper is shared between all stored passwords, rather than being unique like a salt.\n The purpose of the pepper is to prevent an attacker from being able to crack any of the hashes if they only have access to the database, for example if they have exploited a SQL injection vulnerability or obtained a backup of the database.\n The pepper should be at least 32 characters long and should be randomly generated. It should be stored in an application configuration file (protected with appropriate permissions) using the secure storage APIs provided by the operating system, or in a Hardware Security Module (HSM).\n The pepper is traditionally used in a similar way to a salt by concatenating it with the password prior to hashing, using a construct such as  hash($pepper . $password).\n An alternative approach is to hash the passwords as usual and then encrypt the hashes with a symmetrical encryption key before storing them in the database, with the key acting as the pepper. This avoids some of the issues with the traditional approach to peppering, and it allows for much easier rotation of the pepper if it is believed to be compromised.\n  The main issues with peppers is their long term maintenance. Changing the pepper in use will invalidate all of the existing passwords stored in the database, which means that it can&#39;t easily be changed in the event of the pepper being compromised.\n One solution to this is to store the ID of the pepper in the database alongside the associated password hashes. When the pepper needs to be updated, this ID can updated for hashes using the new pepper. Although the application will need to store all of the peppers that are currently in use, this does provide a way to replace a compromised pepper.\n  The work factor is essentially the number of iterations of the hashing algorithm that are performed for each password (usually it&#39;s actually  2^work iterations). The purpose of the work factor is to make calculating the hash more computationally expensive, which in turn reduces the speed at which an attacker can attempt to crack the password hash. The work factor is typically stored in the hash output.\n When choosing a work factor, a balance needs to be struck between security and performance. Higher work factors will make the hashes more difficult for an attacker to crack, but will also make the process of verifying a login attempt slower. If the work factor is too high, this may degrade the performance of the application, and could also be used by an attacker to carry out a denial of service attack by making a large number of login attempts to exhaust the server&#39;s CPU.\n There is no golden rule for the ideal work factor - it will depend on the performance of the server and the number of users on the application. Determining the optimal work factor will require experimentation on the specific server(s) used by the application. As a general rule, calculating a hash should take less than one second, although on higher traffic sites it should be significantly less than this.\n  One key advantage of having a work factor is that it can be increased over time as hardware becomes more powerful and cheaper. Taking Moore&#39;s Law (i.e, that computational power at a given price point doubles every eighteen months) as a rough approximation, this means that the work factor should be increased by 1 every eighteen months.\n The most common approach to upgrading the work factor is to wait until the user next authenticates, and then to re-hash their password with the new work factor. This means that different hashes will have different work factors, and may result in hashes never being upgraded if the user doesn&#39;t log back in to the application. Depending on the application, it may be appropriate to remove the older password hashes and require users to reset their passwords next time they need to login, in order to avoid storing older and less secure hashes.\n In some cases, it may be possible to increase the work factor of the hashes without the original password, although this is not supported by common hashing algorithms such as Bcrypt and PBKDF2.\n  Some hashing algorithms such as Bcrypt have a maximum length for the input, which is 72 characters for most implementations (there are some  reports that other implementations have lower maximum lengths, but none have been identified at the time of writing). Where Bcrypt is used, a maximum length of 64 characters should be enforced on the input, as this provides a sufficiently high limit, while still allowing for string termination issues and not revealing that the application uses Bcrypt.\n Additionally, due to how computationally expensive modern hashing functions are, if a user can supply very long passwords then there is a potential denial of service vulnerability, such as the one published in  Django in 2013.\n In order to protect against both of these issues, a maximum password length should be enforced. This should be 64 characters for Bcrypt (due to limitations in the algorithm and implementations), and between 64 and 128 characters for other algorithms.\n  An alternative approach is to pre-hash the user-supplied password with a fast algorithm such as SHA-256, and then to hash the resultant hash with a more secure algorithm such as Bcrypt (i.e,  bcrypt(sha256($password))). While this approach solves the problem of arbitrary length user inputs to slower hashing algorithms, it also introduces some vulnerabilities that could allow attackers to crack hashes more easily.\n If an attacker is able to obtain password hashes from two different sources, one of which is storing passwords with  bcrypt(sha256($password)) and the other of which is storing them as plain  sha256($password), and attacker can use uncracked SHA-256 hashes from the second site as candidate passwords to try and crack the hashes from the first (more secure) site. If passwords are re-used between the two sites, this can effectively allow the attacker to strip off the Bcrypt layer, and to crack the much easier SHA-256 passwords.\n Pre-hashing with SHA-256 also means that the keyspace for an attacker to brute-force the hashes is  2^256, rather than  2^420 for passwords capped at 64 characters (although both of these are big enough to make no practical difference).\n Finally, when using pre-hashing ensure that the output for the first hashing algorithm is safely encoded as hexadecimal or base64, as some hashing algorithms such as Bcrypt can behave in undesirable ways if the  input contains null bytes.\n As such, the preferred option should generally be to limit the maximum password length. Pre-hashing of passwords should only be performed where there is a specific requirement to do so, and appropriate steps have been taking to mitigate the issues discussed above.\n   There are a number of modern hashing algorithms that have been specifically designed for securely storing passwords. This means that they should be slow (unlike algorithms such as MD5 and SHA-1 which were designed to be fast), and how slow they are can be configured by changing the  work factor.\n   Argon2 is the winner of the 2015  Password Hashing Competition. There are three different versions of the algorithm, and the Argon2 id variant should be used where available, as it provides a balanced approach to resisting both side channel and GPU-based attacks.\n Rather than a simple work factor like other algorithms, Argon2 has three different parameters that can be configured, meaning that it&#39;s more complicated to correctly tune for the environment. The specification contains  guidance on choosing appropriate parameters, however, if you&#39;re not in a position to properly tune it, then a simpler algorithm such as  Bcrypt may be a better choice.\n  PBKDF2 is recommended by  NIST and has FIPS-140 validated implementations. So, it should be the preferred algorithm when these are required. Additionally, it is supported out of the box in the .NET framework, so is commonly used in ASP.NET applications.\n PBKDF2 can be used with HMACs based on a number of different hashing algorithms. HMAC-SHA-256 is widely supported and is recommended by NIST.\n The work factor for PBKDF2 is implemented through the iteration count, which should be at least 10,000 (although values of up to 100,000 may be appropriate in higher security environments).\n  Bcrypt is the most widely supported of the algorithms and should be the default choice unless there are specific requirements for PBKDF2, or appropriate knowledge to tune Argon2.\n The default work factor for Bcrypt is 10, and this should generally be raised to 12 unless operating on older or lower-powered systems.\n  In some circumstances it is not possible to use  modern hashing algorithms, usually due to the use of legacy language or environments. Where possible, third party libraries should be used to provide these algorithms. However, if the only algorithms available are legacy ones such as MD5 and SHA-1, then there are a number of steps that can be taken to improve the security of stored passwords.\n Use a unique  salt for each password, generated using a  cryptographically secure random number generator.\n Use a very large number of iterations of the algorithm (at least 10,000, and possibly significantly more depending on the speed of the hardware).\n It should be emphasised that these steps  are not as good as using a modern hashing algorithm, and that this approach should only be taken where no other options are available.\n  For older applications that were built using less secure hashing algorithms such as MD5 or SHA-1, these hashes should be upgraded to more modern and secure ones. When the user next enters their password (usually by authenticating on the application), it should be re-hashed using the new algorithm. It would also be good practice to expire the users&#39; current password and require them to enter a new one, so that any older (less secure) hashes of their password are no longer useful to an attacker.\n However, this approach means that old (less secure) password hashes will be stored in the database until the user next logs in and may be stored indefinitely. There are two main approaches that can be taken to solve this.\n One method is to expire and delete the password hashes of users who have been inactive for a long period, and require them to reset their passwords to login again. Although secure, this approach is not particularly user friendly, and expiring the passwords of a large number of users may cause issues for the support staff, or may be interpreted by users as an indication of a breach. However, if there is a reasonable delay between implementing the password hash upgrade code on login and removing old password hashes, most active users should have changed their passwords already.\n An alternative approach is to use the existing password hashes as inputs for a more secure algorithm. For example if the application originally stored passwords as  md5($password), this could be easily upgraded to  bcrypt(md5($password)). Layering the hashes in this manner avoids the need to known the original password, however it can make the hashes easier to crack, as discussed in the  Pre-Hashing section. As such, these hashes should be replaced with direct hashes of the users&#39; passwords next time the users login.\n  Writing custom cryptographic code such as a hashing algorithm is  really hard and should  never be done outside of an academic exercise. Any potential benefit that you might have from using an unknown or bespoke algorithm will be vastly overshadowed by the weaknesses that exist in it.", "posttime": "2020-07-02 13:24:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,password", "title": "胡椒(密码存储)", "title_en": "Peppering (Password Storage)", "transed": 1, "url": "https://cheatsheetseries.owasp.org/cheatsheets/Password_Storage_Cheat_Sheet.html#peppering", "via": "", "real_tags": ["密码", "password"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1009426, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几周里，parler已经成为特朗普主义者的话题，承诺将建立一个支持言论自由的社交媒体网站。该网站的首页坚称，其内容审查是基于美国联邦通信委员会(FCC)和美国最高法院的标准：\n当然，这是无稽之谈。联邦通信委员会关于言论的规定不适用于互联网，只适用于公共频谱上的电视和广播。当然，在上个世纪左右的时间里，最高法院关于第一修正案保护言论的既定参数已经相当直接地制定出来了，但它们的写作方式让它听起来像是任何需要在谈判桌上进行审查的内容都将首先经过最高法院的审查，而这并不是所有这些都是如何运作的。事实上，根据最高法院的先例，这些天很少有言论超出第一修正案的范围，我们指出，帕勒的服务条款并没有反映出对最高法院关于第一修正案的判例细微差别的太多理解。相反，它似乎展示了一个20多岁的科技兄弟的知识水平，他浏览了维基百科(Wikipedia)上一篇关于第一修正案例外的文章，只是抓起章节标题，而不费心阅读细节(或者与第一修正案的律师交谈)。\n此外，正如我们所指出的，parler的服务条款允许他们以任何理由禁止用户或内容--这表明他们在背后没有太大的说服力。我们只是根据联邦通信委员会(FCC)和最高法院进行调解。在其他地方，parler的首席执行官说，如果你能在纽约街头说出这句话，你就可以在parler上说。或者说，这是无稽之谈：\n“他们可以提出任何他们想要的主张，但他们会遇到很多评论者，很多人不会同意他们的观点，”马茨说。“社会就是这样运作的，对吧？如果你提出主张，人们就会来对你进行有机的事实核查。“。\n“你不需要一个由专家组成的编辑委员会来判断什么是真的，什么是假的，”他补充说。“第一修正案给了我们，这样我们都可以讨论问题，没有一个单一的权威来决定什么是正确的，什么是不正确的。”\n因此，不管怎样，在周一，我们注意到，parler实际上出于各种各样的原因禁止了大量用户--其中大多数可以简单地贴上“游戏厅人”的标签。人们继续前往parler，看看怎样才能让自己被禁止。这是巨魔游戏。帕勒禁止了他们中的一大批。这导致parler&#39；首席执行官约翰·马茨(John Matze)发表了一份声明，说明了parler禁止的其他事情：\n从字面上看，没有人会抱怨在谈判桌上被禁止。他们嘲笑谈判者没有实现其伪装的目标，即只禁止你发表第一修正案保护之外的言论。\n以下是我们需要你在谈判桌上遵守的几条基本规则。如果您不喜欢这些内容，我们深表歉意，但我们将强制执行：\n祝贺你。重要的是要认识到，正如我们所说的那样，任何托管第三方内容的网站最终都必须拿出一些计划来强制实施某种程度的内容审核。你说过你不会那么做的。事实上，就在几天前，你还说过，人们可以提出他们喜欢的任何主张，而且你将遵循最高法院对第一修正案的限制，而不是你自己的内容审查规则。\n当你不同意某人的意见时，在评论区发布你排泄物的照片是不被容忍的。\n关于这一点，我有几点想法。首先，我知道Matze在这里是想搞笑，但这不是那样的。它真正做的就是暗示他已经被一群张贴狗屎照片的巨魔所拥有。此外，嗯，合同上，这似乎意味着它的权利张贴照片的其他人的粪便。也许该找个律师来审阅这堆狗屎，约翰。\n此外，更重要的是，我花了几个小时挖掘最高法院关于第一修正案的先例，但我没有找到一项裁决，即发布你拉屎的照片违反了第一修正案。我是说，我知道这不太好。但是，谈判者向我保证，这是由最高法院的先例裁决的。\n再一次，我的一长串法律学者没有找到最高法院在这方面的先例。\n问题是，根据美国最高法院的解释，大多数色情作品都受到第一修正案的保护。因此，我们再次看到谈判者的规则并不像最初声明的那样。\n我们不会允许您在每条评论中使用无关的评论(如操您)向其他试图发言的人发送垃圾邮件。这太愚蠢了。这是没有意义的，成熟点。\n我同意这是愚蠢的，人们应该长大，但这是所有其他互联网平台要么从一开始就认识到的，要么很快就会学会的：你会有一些不成熟的巨魔出现，你需要弄清楚你想要如何处理他们。但是，那些垃圾邮件发送者和巨魔言论又一次(我觉得我在重复自己的话)非常受第一修正案的保护。\n你不能在评论区威胁要杀任何人。抱歉，永远都不会没事的。\n同样，这非常依赖于背景，尽管马茨说他不会雇佣任何烦人的专家来决定什么是允许的，什么是不允许的，但根据最高法院的先例，要想弄清楚什么是真正的威胁，通常至少需要一些了解真正威胁实际运作的专家。\n但是，老实说，这整件事让人联想到任何其他托管第三方内容学习内容审核的网站。这就是帕勒的情况，因为它提醒人们注意它不会缓和的说法，它不得不在创纪录的时间内经历学习曲线。请记住，在早期，Twitter称自己为言论自由党的言论自由之翼。然后，它开始充斥着垃圾邮件、辱骂和骚扰。还有恐怖分子。事情变得很棘手。或者，Facebook。正如Facebook首位内容政策负责人戴夫·威尔纳(Dave Willner)在几年前的一次会议上所说的那样，Facebook的原创内容审核政策是让我们感到讨厌吗？如果让我们觉得讨厌，它就会被撤下。但这并不管用。\n当然，随着这些平台变得更大、更强大，挑战也变得越来越棘手和复杂。几年前，因为谷歌创建了一份内部文件，在内容审核方面的最大问题上苦苦挣扎，布莱巴特在其中加入了一句关于优秀审查员的话，因此布莱巴特掀起了一场更大的狂热。在那之后的几个月里，特朗普主义者/布莱巴特的所有工作人员都在尖叫，抱怨好的审查员，以及科技公司如何认为自己的工作是审查保守派(这份文件实际上并不是这么说的)。它只是对内容审核方面的各种挑战进行了分析，以及如何制定公平合理的政策。\n帕勒似乎在大约一周的时间里经历了这个成长过程。首先是每个人的言论自由。然后他们突然开始意识到这实际上行不通--特别是当人们开始欺骗你的时候。所以，他们开始即兴表演。目前，parler的政策似乎更类似于Facebook的标准，尽管它更接近于目前的基础：因此，确实让现在正在庆祝该平台的特朗普派感到不安。这就是一项政策，但它让我们感到厌烦，因为它更接近于目前的基础：因此，这确实让现在正在庆祝该平台的特朗普派感到不安。这就是一项政策，尽管它更接近于目前的基础：因此，它确实让正在庆祝该平台的特朗普派感到不安。这就是一项政策。它不是我们仅根据第一修正案进行的温和派，它不支持言论自由，也不具有可伸缩性。\n所以人们被禁止了，也许是有很好的理由的。以下是让埃德·博特(Ed Bott)被禁的一条信息：\n我不明白这怎么会违反到目前所说的谈判者规则中的任何一条，但这违反了众多不成文规则中的一条：如果你取笑谈判者，谈判者不会喜欢这样。当然，这是该公司的选择。我要顺便提一下，这比Twitter的限制要大得多，Twitter每天都有大量的人嘲笑Twitter，我还没有听说过有任何人因为嘲笑Twitter而被禁止使用Twitter的案例。老实说，如果你将这两个网站进行比较，你会发现Twitter比Parler正在考虑的现行政策更愿意主持演讲，这一点很有说服力。\n如果parler真的壮大了，它可能会效仿其他所有社交媒体平台的做法，制定更彻底的内容审核规则、政策和程序。但是，当然，这使得它就像其他所有的社交媒体平台一样，尽管它可能会划定不同的界限。而且，正如我通过所有这些帖子所说的那样(与过去几天对我发起的攻击相反)，我非常高兴帕勒尔的存在。我希望今天的社交媒体网站能有更多的竞争。我希望有更多的实验。我真的希望他们中的一些人能成功。这就是创新的运作方式。\n我只是不喜欢他们完全虚伪的样子。事实上，Parler的首席执行官马茨现在似乎已经决定，任何支持安提法的人都不能在谈判者面前发言，而不是支持第一修正案，也不是支持你在纽约街头可以说的话(比如，为了抗议警察的暴力行为)，而是决定不支持第一修正案，而不是支持你在纽约街头可以说的话(比如，为了抗议警察的暴行)，任何支持安蒂法的人都不允许在谈判者身上：\n我不太清楚安提法的支持者属于哪项谈判者政策(或第一修正案例外)，但嘿，规则不是我制定的。\n与此同时，看到parler的一小群狂热支持者试图继续证明该网站的误导性说法是件有趣的事情。一群人一直对我大喊大叫，说谈判者支持任何受第一修正案保护的言论自由的谎言。其他人则坚持认为，这当然不适用于混蛋(我猜，这是最高法院1A教条著名的混蛋推论)。但老实说，我最喜欢的是这位现在为Mediaite撰稿的前福克斯新闻(Fox News)记者--他花了几天时间坚称，所有取笑帕勒虚伪的人，不知何故都对被踢出帕莱尔感到愤怒--他决定直截了当地说，帕莱尔很好，因为它做了正确的禁止。你看，帕勒是个好的审查员：\n因此，我们又回到了优秀的审查员身上，只不过当谷歌文件使用这一短语时，它用它来讨论节制的不可能的权衡，而不是接受这一角色。(译者注：当谷歌文件使用这句话时，它用来讨论节制的不可能的权衡，而不是接受这个角色)。然而，在这里，一位谈话者粉丝正在接受这一角色，这与该网站的公开声明完全相反。不知何故，我有一种感觉，布莱巴特/特朗普主义团队不会像对待谷歌文档那样，对谈判者成为优秀的审查员做出同样的反应，后者刚刚强调了内容审核的不可能挑战。\n听着，如果帕勒一开始就这么说，那就太酷了。那是一个选择。如果他们只是说想为愤愤不平的特朗普粉丝创造一个安全的空间，没有人会指出任何虚伪。相反，该网站正试图两全其美：仍然声称它支持第一修正案的规定，同时加大了有点武断的禁止程序。当然，滑稽的是，它的许多支持者一直坚称，他们对Twitter的真正抱怨是，它的内容审核是武断的，或者是应用不均的。帕勒现在也是如此，这一事实似乎被巨大的宇宙认知失调盾牌挡住了进入他们大脑的障碍。\n人们指出的唯一问题是，parler不应该如此傲慢地将其整个身份挂在我们不温和的网站上，除非法律要求。希望这也能给其他平台一个教训。内容审核会发生。你无法避免它。假装你可以用有关言论自由的模糊陈词滥调来置之不理，这是行不通的。而且最好从一开始就明白这一点，而不是看起来像谈判者一样愚蠢，因为每个人的注意力都会转移到你身上。", "note_en": "Over the last few weeks Parler has become the talk of Trumpist land, with promises of a social media site that &#34;supports free speech.&#34; The front page of the site insists that its content moderation is based on the standards of the FCC and the Supreme Court of the United States:\n  Of course, that&#39;s nonsensical. The FCC&#39;s regulations on speech do not apply to the internet, but just to broadcast television and radio over public spectrum. And, of course, the Supreme Court&#39;s well-established parameters for 1st Amendment protected speech have been laid out pretty directly over the last century or so, but the way this is written they make it sound like any content to be moderated on Parler will first be reviewed by the Supreme Court, and that&#39;s not how any of this works. Indeed, under Supreme Court precedent, very little speech is outside of the 1st Amendment these days, and we pointed out that Parler&#39;s terms of service  did not reflect much understanding of the nuances of Supreme Court jurisprudence on the 1st Amendment. Rather, it appeared to demonstrate the level of knowledge of a 20-something tech bro skimming a  Wikipedia article about exceptions to the 1st Amendment and just grabbing the section headings without bothering to read the details (or talk to a 1st Amendment lawyer).\n Besides, as we pointed out, Parler&#39;s terms of service allow them to ban users or content for any reason whatsoever -- suggesting they didn&#39;t have much conviction behind their &#34;we only moderate based on the FCC and the Supreme Court.&#34; Elsewhere, Parler&#39;s CEO says that  &#34;if you can say it on the street of New York, you can say it on Parler.&#34; Or  this nugget of nonsense:\n “They can make any claim they’d like, but they’re going to be met with a lot of commenters, a lot of people who are going to disagree with them,” Matze said. “That’s how society works, right? If you make a claim, people are going to come and fact check you organically.”\n “You don’t need an editorial board of experts to determine what’s true and what’s not,” he added. “The First Amendment was given to us so that we could all talk about issues, not have a single point of authority to determine what is correct and what’s not.”\n  So, anyway, on Monday, we noted that Parler was  actually banning a ton of users for a wide variety of reasons -- most of which could be labeled simply as &#34;trolling Parler.&#34; People were going on to Parler to see what it would take to get themselves banned. This is trolling. And Parler banned a bunch of them. That resulted in Parler&#39;s CEO, John Matze, putting out a statement about other things that are banned on Parler:\n    Literally no one is &#34;complaining&#34; about being banned on Parler. They&#39;re mocking Parler for not living up to it&#39;s pretend goals of only banning you for speech outside of 1st Amendment protections.\n Here are the very few basic rules we need you to follow on Parler. If these are not to your liking, we apologize, but we will enforce:\n Good for you. It&#39;s important to recognize -- just as we said -- that any website that hosts 3rd party content will eventually have to come up with some plan to enforce some level of content moderation. You claimed you wouldn&#39;t do that. Indeed, just days earlier you had said that people could &#34;make any claim they&#39;d like&#34; and also that you were going to follow the Supreme Court&#39;s limits on the 1st Amendment, not your own content moderation rules.\n When you disagree with someone, posting pictures of your fecal matter in the comment section WILL NOT BE TOLERATED\n So, a couple thoughts on this. First of all, I get that Matze is trying to be funny here, but this is not that. All it really does is suggest that he&#39;s been owned by a bunch of trolls posting shit pics. Also, um, contractually, this seems to mean it&#39;s okay to post pictures of other people&#39;s fecal matter. Might want to have a lawyer review this shit, John.\n Also, more importantly, I&#39;ve spent a few hours digging through Supreme Court precedents regarding the 1st Amendment and I&#39;ve failed to find the ruling that says that posting a picture of your shit violates the 1st Amendment. I mean, I get that it&#39;s  not nice. But, I was assured by Parler that it was ruled by Supreme Court precedent.\n  Again, my litany of legal scholars failed to turn up the Supreme Court precedent on this.\n  Thing is, most pornography is very much protected under the 1st Amendment as interpreted by the Supreme Court of the United States. So again, we see that Parler&#39;s rules are not as initially stated.\n We will not allow you to spam other people trying to speak, with unrelated comments like &#34;Fuck you&#34; in every comment. It&#39;s stupid. It&#39;s pointless, Grow up.\n I agree that it&#39;s stupid and that people should grow up, but this is the kind of thing that every other internet platform either recognizes from the beginning or learns really quickly: you&#39;re going to have some immature trolls show up and you need to figure out how you want to deal with them. But those spammers&#39; and trolls&#39; speech is, again (I feel like I&#39;m repeating myself) very much protected by the 1st Amendment.\n You cannot threaten to kill anyone in the comment section. Sorry, never ever going to be okay.\n Again, this is very context dependent, and, despite Matze saying that he won&#39;t employ any of those annoying &#34;experts&#34; to determine what is and what is not allowed, figuring out what is a &#34;true threat&#34; under the Supreme Court&#39;s precedent usually requires at least some experts who understand how true threats actually work.\n But, honestly, this whole thing is reminiscent of any other website that hosts 3rd party content learning about content moderation. It&#39;s just that in Parler&#39;s case, because it called attention to the claims that it would not moderate, it&#39;s having to go through the learning curve in record time. Remember, in the early days, Twitter called itself &#34;the free speech wing of the free speech party.&#34; And then it started filling with spam, abuse, and harassment. And terrorists. And things got tricky. Or, Facebook. As its first content policy person, Dave Willner, said at a conference a few years ago, Facebook&#39;s original content moderation policy was &#34;does it make us feel icky?&#34; And if it did, it got taken down. But that doesn&#39;t work.\n And, of course, as these platforms became bigger and more powerful, the challenges became thornier and more and more complicated. A few years ago, Breitbart went on an extended rampage because Google had created an internal document struggling over the biggest issues in content moderation, in which it included a line about  &#34;the good censor&#34;. For months afterwards, all of the Trumpist/Breitbart crew was screaming about &#34;the good censor&#34; and how tech believed its job was to censor conservatives (which is not what the document actually said). It was just an analysis of all the varied challenges in content moderation, and how to set up policies that are fair and reasonable.\n Parler seems to be going through this growth process in the course of about a week. First it was &#34;hey free speech for everyone.&#34; Then they suddenly start realizing that that doesn&#39;t actually work -- especially when people start trolling you. So, they start ad libbing. Right now, Parler&#39;s policy seems more akin to Facebook&#39;s &#34;does it make us feel icky&#34; standard, though tuned more towards its current base: so &#34;does upset the Trumpists who are now celebrating the platform.&#34; That&#39;s a policy. It&#39;s not &#34;we only moderate based on the 1st Amendment.&#34; And it&#39;s not &#34;free speech supportive.&#34; It&#39;s also not scaleable.\n So people get banned and perhaps for good reason. Here&#39;s the single message that  got Ed Bott banned:\n  I don&#39;t see how that violates any of the so far stated rules of Parler, but it&#39;s violating one of the many unwritten rules: Parler doesn&#39;t like it if you make fun of Parler. Which is that company&#39;s choice of course. I will note, just in passing, that that is significantly more restrictive than Twitter, which has tons of people mocking Twitter every damn day, and I&#39;ve yet to hear of a single case of anyone being banned from Twitter for mocking Twitter. Honestly, if you were to compare the two sites, one could make a very strong case that Twitter is way more willing to host speech than Parler is considering its current policies.\n Should Parler ever actually grow bigger, it might follow the path of every other social media platform out there and institute more thorough rules, policies, and procedures regarding content moderation. But, of course, that makes it just like every other social media platform out there, though it might draw the lines differently. And, as I&#39;ve said through all these posts (contrary to the attacks that have been launched at me the last few days), I&#39;m very happy that Parler exists. I want there to be more competition to today&#39;s social media sites. I want there to be more experimentation. And I&#39;m truly hopeful that some of them succeed. That&#39;s how innovation works.\n I just don&#39;t like it when they&#39;re totally hypocritical. Indeed, it seems that Parler&#39;s CEO Matze has now decided that rather than being supportive of the 1st Amendment, and rather than being supportive of what you can say on a NY street (say, in a protest of police brutality), anyone who supports Antifa is not allowed on Parler:\n  I&#39;m not quite clear on what Parler policy (or 1st Amendment exception) &#34;Antifa supporter&#34; falls under, but hey, I don&#39;t make the rules.\n In the meantime, it&#39;s been fun to watch Parler&#39;s small group of rabid supporters try to continue to justify the site&#39;s misleading claims. A bunch keep screaming at me the falsehood that Parler supports any 1st Amendment protected free speech. Others insist that &#34;of course&#34; that doesn&#39;t apply to assholes (the famed &#34;asshole corollary&#34; to Supreme Court 1A doctrine, I guess). But, honestly, my favorite was this former Fox News reporter who now writes for Mediaite -- who spent a couple days insisting that everyone making fun of Parler&#39;s hypocrisy were somehow &#34;mad&#34; at being kicked off Parler -- who decided to just straight up say that Parler is good because it does  the right kind of banning. You see, Parler is  the good censor:\n  And, thus, we&#39;re right back to &#34;the good censor.&#34; Except that when the Google document used that phrase, it used it to discuss the impossible tradeoffs of moderation, not to embrace the role. Yet here, a Parler fan is embracing this role that is entirely opposite of the site&#39;s public statements. Somehow, I get the feeling that the Breitbart/Trumpist crew isn&#39;t going to react the same way to Parler becoming &#34;the good censor&#34; as it did to a Google document that just highlighted the impossible challenges of content moderation.\n And, look, if Parler had come out and said that from the beginning, cool. That&#39;s a choice. No one would be pointing out any hypocrisy if they just said that they wanted to create a safe space for aggrieved Trump fans. Instead, the site is trying to have it both ways: still claiming it&#39;s supportive of 1st Amendment rules, while simultaneously ramping up its somewhat arbitrary banning process. Of course, what&#39;s hilarious is that many of its supporters keep insisting that their real complaint with Twitter is that its content moderation is &#34;arbitrary&#34; or &#34;unevenly applied.&#34; The fact that the same thing is now true of Parler seems blocked from entering their brains by the great cosmic cognitive dissonance shield.\n The only issue that people are pointing out is that Parler shouldn&#39;t have been so cavalier in hanging its entire identity on &#34;we don&#39;t moderate, except as required by law.&#34; And hopefully it&#39;s a lesson to other platforms as well. Content moderation happens. You can&#39;t avoid it. Pretending that you can brush it off with vague platitudes about free speech doesn&#39;t work. And it&#39;s better to understand that from the beginning rather than look as foolish as Parler just as everyone&#39;s attention turns your way.", "posttime": "2020-07-02 13:04:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内容,speedruns,parler", "title": "Parler快速运行内容审核学习曲线", "title_en": "Parler Speedruns the Content Moderation Learning Curve", "transed": 1, "url": "https://www.techdirt.com/articles/20200630/23525844821/parler-speedruns-content-moderation-learning-curve-goes-we-allow-everything-to-were-good-censors-days.shtml", "via": "", "real_tags": ["内容", "speedruns", "parler"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009425, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据“信息报”周三报道，马克·扎克伯格告诉员工，Facebook不会改变，以回应越来越多的广告商对其仇恨言论政策的抵制。\n据The Information报道，扎克伯格称抵制活动是一个声誉问题，称它只威胁到Facebook营收的一小部分，并预测广告商很快就会重返该平台。\n上周有500多家公司加入了抵制活动，其中包括可口可乐、福特、星巴克和威瑞森等大品牌。\n本月早些时候，在扎克伯格拒绝对特朗普关于种族正义抗议的有争议的帖子采取行动后，民权组织呼吁广告商放弃该平台。\n据The Information周三报道，Facebook首席执行官马克·扎克伯格告诉员工，尽管本月有500多家广告商抵制该平台，但公司不会改变对仇恨言论的态度。\n据The Information报道，扎克伯格上周在一次虚拟市政厅中表示，我们不会因为威胁到我们一小部分收入，或任何一个百分比的收入而改变我们的政策或做法。\n据“信息报”报道，他表示：我猜测，所有这些广告商很快就会重返该平台。他补充称，抵制活动是一个声誉问题和合作伙伴问题，而不是财务问题，因为Facebook的大部分收入来自小企业而不是大品牌。\n本周早些时候，随着各大品牌加入抵制行动，Facebook的市值在短短两天内就蒸发了600亿美元，但此后其股价基本上出现了反弹。\n本月早些时候，美国全国有色人种协进会(NAACP)、反诽谤联盟(Anti-Defamation League)和改变之色(Color Of Change)等民权组织呼吁广告商抵制Facebook，原因是扎克伯格对唐纳德·特朗普(Donald Trump)总统发表的有争议的帖子没有采取行动，暗示对抗议警察暴行和系统性种族主义的人采取暴力行动。\n自活动启动以来，包括可口可乐、福特、星巴克、威瑞森、阿迪达斯和联合利华等大品牌在内的500多家公司已经从社交媒体平台上撤下了广告。\n上周五，随着抵制行动愈演愈烈，Facebook表示，将对违反其仇恨言论政策的政客发布的有新闻价值的帖子贴上标签-这对该公司来说是一个重大逆转-并收紧了对广告商的规定。\n据路透社(Reuters)报道，Facebook高管也曾多次私下讨论，试图解决广告商的担忧，但最终谈判破裂，广告商称Facebook的努力根本不动，抵制活动的组织者要求扎克伯格亲自出席，因为他是终极权威。\nADL发言人托德·古特尼克(Todd Gutnick)告诉Business Insider，扎克伯格最终同意与全国有色人种协进会(NAACP)、变化之色(Color Of Change)和反诽谤联盟(Anti-Defamation League)的领导人会面。\n然而，扎克伯格周五的言论表明，他可能已经下定决心，抵制行动实际上可能适得其反。\n根据The Information，扎克伯格告诉员工，如果有人走出去威胁你要做某事，这实际上会让你陷入困境，在某种程度上，他们想要做的事情就更难做到了，因为现在看起来你又投降了，这会建立起糟糕的长期激励机制，促使其他人也这么做(对你来说)。“信息”显示，扎克伯格告诉员工，在某种程度上，他们更难做到他们想做的事情，因为现在看起来你又投降了，这会建立起不良的长期激励机制，让其他人也[对你]做同样的事情。\n在给Business Insider的一封电子邮件中，Facebook的一位发言人表示：我们非常认真地对待这些问题，并尊重合作伙伴的反馈。我们正在取得真正的进展，将仇恨言论从我们的平台上移除，我们不会从这类内容中受益。但正如我们已经说过的那样，我们是基于原则而不是收入压力来进行政策调整的。", "note_en": "Mark Zuckerberg told employees that Facebook is &#34;not gonna change&#34; in response to the growing advertiser boycott over its hate speech policies,  The Information reported Wednesday.\n Zuckerberg called the boycott a &#34;reputational&#34; issue, saying it threatened only a &#34;small percent&#34; of Facebook&#39;s revenue and predicting advertisers would return to the platform &#34;soon enough,&#34; according to The Information.\n More than 500 companies have joined the boycott in the last week, including major brands like Coca-Cola, Ford, Starbucks, and Verizon.\n CIvil rights groups called on advertisers to  abandon the platform earlier this month after Zuckerberg  refused to take action on controversial posts by Trump about racial justice protests.\n Facebook CEO Mark Zuckerberg told employees that the company would not change its approach on hate speech despite more than 500 advertisers boycotting the platform this month,  The Information reported Wednesday.\n &#34;We&#39;re not gonna change our policies or approach on anything because of a threat to a small percent of our revenue, or to any percent of our revenue,&#34; Zuckerberg said during a virtual town hall last week, according to The Information.\n &#34;My guess is that all these advertisers will be back on the platform soon enough,&#34; he said, according to The Information, adding that the boycott was a &#34;reputational and a partner issue&#34; rather than a financial one because most of Facebook&#39;s revenue comes from small businesses vs large brands.\n Facebook saw  $60 billion in market value erased in just two days earlier this week as major brands joined the boycott, but its shares have largely rebounded since then.\n Earlier this month, civil rights groups including the NAACP, Anti-Defamation League, and Color of Change called for advertisers to  boycott Facebook following Zuckerberg&#39;s inaction on  controversial posts by President Donald Trump suggesting violence against people protesting police brutality and systemic racism.\n  Since the campaign launched,  more than 500 companies, including major brands like Coca-Cola, Ford, Starbucks, Verizon, Adidas, and Unilever, have pulled ads from the social media platform.\n On Friday, as the boycott gained steam, Facebook said it would  attach labels to &#34;newsworthy&#34; posts from politicians that violate its hate speech policies — a significant reversal for the company — and tighten up its rules for advertisers.\n Facebook executives also have tried in multiple private discussions to address advertisers&#39; concerns, but those talks ultimately broke down, with advertisers calling Facebook&#39;s efforts &#34;simply not moving&#34; and the boycott&#39;s organizers demanding that Zuckerberg personally attend because &#34;he is the ultimate authority,&#34;  Reuters reported.\n Zuckerberg eventually agreed to meet with leaders of the NAACP, Color of Change, and the Anti-Defamation League, ADL spokesperson Todd Gutnick told Business Insider.\n However, Zuckerberg&#39;s comments Friday suggest that he may have already made up his mind and that the boycott may actually be backfiring.\n &#34;If someone goes out there and threatens you to do something, that actually kind of puts you in a box where in some ways it&#39;s even harder to do what they want because now it looks like you&#39;re capitulating, and that sets up bad long-term incentives for others to do that [to you] as well,&#34; Zuckerberg told employees, according to The Information.\n In an email to Business Insider, a Facebook spokesperson said: &#34;We take these matters very seriously and respect the feedback from our partners. We&#39;re making real progress keeping hate speech off our platform, and we don&#39;t benefit from this kind of content. But as we&#39;ve said, we make policy changes based on principles, not revenue pressures.&#34;", "posttime": "2020-07-02 12:28:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,facebook,company", "title": "据报道，马克·扎克伯格(Mark Zuckerberg)表示，Facebook“不会改变”，以回应500多家广告商对该公司仇恨言论政策的抵制", "title_en": "Mark Zuckerberg reportedly said Facebook is 'not gonna change' in response to a boycott by more than 500 advertisers over the company's hate speech policies", "transed": 1, "url": "https://news.yahoo.com/mark-zuckerberg-reportedly-said-facebook-005102267.html", "via": "", "real_tags": ["广告", "facebook", "company"]}, {"category": "", "categoryclass": "", "imagename": "535f82bf18daa5c1754ea778837992fc.jpg", "infoid": 1009424, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您玩Forza Horizon或Forza MotorSports，您可以在游戏中对汽车进行个性化设置，甚至可以添加您自己的定制设计。一个受欢迎的例子是：至少从2007年开始，玩家在几乎每一场Forza游戏中都使用了这一功能来重现1969年哈扎德公爵(The Dukes Of Hazzard)中的李将军(General Lee)，即道奇充电器(Dodge Charger)。但是众所周知，李将军的背面包括有争议的邦联旗帜--微软刚刚宣布将禁止在游戏中使用该标志的玩家(以及其他人)。\n在上周五发布在Twitter上的一份声明中，微软更新了执法指导方针，对任何使用南部邦联旗帜或其他象征“臭名昭著的肖像”的玩家采取零容忍政策，包括纳粹形象和旭日东升，这可能是日本帝国主义的象征。微软不会自动禁止玩家使用这些有争议的图片进行设计；相反，需要通过提交罚单来报告原始设计者。\n虽然一些玩家已经注意到了这一禁令，但它还没有引发明显的反弹。此外，如果你想把你1969年的道奇充电器变成李将军，你不需要一面旗帜就可以做到这一点。(还有，这是“蜜蜂将军”。)。即使是现实生活中的李将军的车也不再佩戴邦联旗帜；车主兼职业高尔夫球手布巴·沃森(Bubba Watson)表示，他在2015年将其移除。\n最近几周，在美国反对系统性种族主义的抗议活动中，围绕现代展示南部邦联旗帜的辩论重新浮出水面。此前允许展示国旗的几家机构，包括美国海军陆战队(US Marine Corps)和纳斯卡(NASCAR)，已全面禁止展示国旗和对国旗的描绘，而密西西比州的立法者周一投票决定将国旗从州国旗上删除。", "note_en": "If you play  Forza Horizon or  Forza Motorsport, you have some freedom to personalize cars in the game, even adding your own custom designs. One popular example: players have used the feature to recreate the  General Lee, the 1969 Dodge Charger from  The Dukes of Hazzard, in almost every single Forza game  since at least 2007. But the General Lee famously includes the controversial confederate flag on its back — and Microsoft has just announced it will ban players who use that symbol (among others) in the game.\n In a  statement posted on Twitter last Friday, Microsoft updated its enforcement guidelines to have a zero-tolerance policy for any player using the confederate flag or other symbols that represent “ notorious iconography,” including Nazi imagery and the rising sun, which can be  a symbol of Japanese imperialism. Microsoft will not automatically ban players that create designs with these controversial images; instead, the original designer will need to be reported by  submitting a ticket.\n  While some players have  noticed the ban, it hasn’t sparked a significant backlash yet. Besides, if you want to turn your 1969 Dodge Charger into a General Lee, you don’t need a flag to do that. (Also, here’s the “ General Bee.”) Even the real-life General Lee car  no longer wears the confederate flag; owner and pro golfer Bubba Watson says he had them removed in 2015.\n  In recent weeks, debates surrounding the  modern display of the confederate flag have resurfaced amid protests in the US against systemic racism. Several institutions, which previously allowed displays of the flag, including the  US Marine Corps and  NASCAR, have banned the flag and depictions of it in its entirety, while lawmakers in Mississippi voted on Monday to  remove the emblem from its state flag.", "posttime": "2020-07-02 12:28:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,microsoft,邦联,ban,包括", "title": "微软将禁止Forza玩家在其数字汽车上添加邦联旗帜", "title_en": "Microsoft Will Ban Forza Players Who Add The Confederate Flag To Their Digital Cars", "transed": 1, "url": "https://www.theverge.com/2020/6/30/21308677/microsoft-forza-player-ban-confederate-flag-hate-symbols", "via": "", "real_tags": ["微软", "microsoft", "邦联", "ban", "包括"]}, {"category": "", "categoryclass": "", "imagename": "fb228d80a1637185f43797037de3c463.jpg", "infoid": 1009423, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一种观察身体内部、揭示肿瘤或胎儿的方法，超声波是行之有效的。但神经科学家对这项技术有一个更新的抱负：对大脑进行修补。在频率低于超声波，但仍超出人类听觉范围的情况下，超声波可以穿透颅骨，促进或抑制大脑活动。如果研究人员能够证明超声波可以安全和可预测地改变人类的大脑功能，它可能成为一种强大的、非侵入性的研究工具和治疗大脑疾病的新手段。\n超声波是如何对大脑起作用的仍然是个谜。但最近的实验提供了关于安全性的保证，小型研究暗示了对人类的有意义的影响-例如，抑制疼痛，或微妙地增强知觉。“我看到了很多诱人的数据，”加州大学洛杉矶分校(UCLA)的神经学家马克·科恩(Mark Cohen)说。“虽然挑战很大，但这件事的潜力要大得多，我们真的要去追求它.”\n科学家已经可以通过在头骨上传送电流或磁脉冲来非侵入性地调节大脑。美国食品和药物管理局(FDA)已批准经颅磁刺激(TMS)治疗抑郁症、偏头痛和强迫症(OCD)。\n但与磁场或电场不同的是，声波可以像通过放大镜的光一样聚焦在大脑深处的一个点上，而不会影响较浅的组织。目前，这种深度和焦点的结合只有通过手术植入的钢丝才可能实现。但超声波可能会暂时扰乱人类大脑深处的区域例如杏仁状的杏仁核(驱动情绪反应的区域)或丘脑(疼痛的中继站和警觉性的调节器)，以测试其功能或治疗疾病。\n在动物身上的结果令人鼓舞。20世纪50年代的实验首次表明，超声波可以抑制猫脑视觉区域的神经活动。在啮齿类动物中，将超声波对准运动区会引发爪子或胡须抽搐等运动。将其集中在猴子大脑的前额区域可以改变动物在眼动任务中的表现。\n但从技术上讲，要将超声波对准厚实的头骨并显示其能量已经落在预定的点上是很棘手的。而且超声波对大脑的影响可能很难预测。它在多大程度上促进或抑制神经活动取决于许多参数，包括超声脉冲的时间和强度，甚至目标神经元本身的特征。“我对这种潜力感到非常兴奋，”美国国家精神卫生研究所研究非侵入性神经调节的精神病学家莎拉·霍林斯沃斯·利桑比说。“我们还需要承认，我们还有很多东西需要学习，”她说。\n首先，研究人员在很大程度上对声波和脑细胞是如何相互作用的一无所知。加州理工学院的生化工程师米哈伊尔·夏皮罗(Mikhail Shapiro)说：“这是这个领域的百万美元问题。”在高强度下，超声波可以加热并杀死脑细胞-神经外科医生利用这一特征烧毁了导致震颤的大脑部分。\n即使在不会显著升高温度的强度下，超声波也会对细胞施加机械力。一些研究表明，这种力量改变了神经元上的离子通道，改变了细胞向邻居发射信号的可能性。如果超声波主要通过离子通道起作用，“这是个好消息，”夏皮罗说，“因为这意味着我们可以观察这些通道在哪里表达，并对哪些类型的细胞会被激发做出一些预测。”在上个月BioRxiv上的一份预印本中，夏皮罗的团队报告说，将培养皿中的小鼠神经元暴露在超声波下，会打开一组特定的钙离子通道，使某些细胞更容易兴奋。\n但是哈佛大学的神经学家Yoo Seung-Schik Yoo说，仅靠这些渠道并不能解释超声波的效果。他指出，超声波似乎也会影响被称为胶质细胞的非神经性脑细胞上的受体。“很难(发展)任何关于超声波确切机制的统一理论”，他说。\n不管机制如何，超声波开始在人类身上显示出明显的(如果是微妙的)影响。2014年，弗吉尼亚理工学院和州立大学的一个研究小组表明，聚焦超声波可以增加人脑感觉处理区域的电活动，并提高参与者识别手指被触摸点数的能力。牛津大学的神经学家克里斯托弗·巴特勒(Christopher Butler)和他的同事们在一项更复杂的感官任务中测试了超声波：判断屏幕上漂移、抖动的圆点的运动。上个月，在认知神经科学协会的在线年会上，他报告说，刺激一个叫做MT的运动处理视觉区域可以提高受试者判断大多数圆点漂移方向的能力。\n南卡罗来纳医科大学的精神病学家马克·乔治(Mark George)帮助开发和改进了这项技术，他说，到目前为止，超声波的效果比TMS更微妙。对于TMS，“你把它戴在头上，然后打开它，你的拇指就会移动，”他说。但促使老鼠爪子抽搐的超声波实验使用的强度“太高了，太高了，远远高于我们被允许在人类身上使用的强度。”\n监管机构限制了人体研究，部分原因是超声波有可能煮熟大脑或通过空化-在组织中产生微小气泡-造成损害。2015年，Yoo和他的同事在反复暴露在超声波下的绵羊大脑中发现了微量出血，这是血管损伤的迹象。“这是一个巨大的减速带，”斯坦福大学生物物理学家金·巴茨·保利说。但在2月份的脑刺激中，她的研究小组报告了对照组动物也出现了微量出血，这表明这种损害可能是大脑解剖造成的。但保利和俞敏洪现在表示，他们相信这项技术可以安全使用。\n科恩和他的合作者最近通过将超声波对准手术切除的区域来治疗癫痫，测试了人体的安全性。在FDA同意的情况下，他们使用的强度高达诊断超声极限的8倍。正如他们在4月份MedRxiv上的一份预印本中所报道的那样，他们没有发现对脑组织或血管的重大损害。然而，科恩说，为了找到安全的极限，研究人员可能需要一直走到损害组织的水平。\n几个团队正在谨慎地进行超声波治疗的测试。2016年，加州大学洛杉矶分校(UCLA)神经科学家马丁·蒙蒂(Martin Monti)和他的同事报告称，一名处于最低意识状态的男子在对丘脑进行超声波刺激后恢复了意识。蒙蒂正在准备一份出版物，内容是对三名患有慢性意识障碍的人进行后续研究。蒙蒂说，在超声波之后，他们在一段时间内表现出更高的反应性-比预期的要快得多，尽管这项研究没有包括对照组。\n这项研究和对癫痫患者的测试使用了BrainSonix公司开发的超声波设备。它的创始人、加州大学洛杉矶分校(UCLA)的神经精神病学家亚历山大·拜斯特里茨基(Alexander Bystritsky)希望超声波可以扰乱导致强迫症症状的神经回路。他说，马萨诸塞州总医院和贝勒医学院的一个研究小组正在计划一项使用BrainSonix设备的人体研究。\n哥伦比亚大学生物医学工程师ELISA Konofagou希望使用超声波治疗阿尔茨海默病。在新冠肺炎中断参与者招募之前，她和同事们正在准备一项试点研究，将微小的充气气泡注入六名阿尔茨海默氏症患者的血液中，并使用超声波脉冲振荡大脑内血管中的微泡。这些振动的机械力可以暂时将这些血管内的细胞拉开。研究人员希望，打开这种血脑屏障将有助于大脑清除有毒蛋白。(科诺法古的团队和其他人也在探索这种超声波-微泡的组合，将药物输送到大脑。)\n在研究TMS多年后的第一次超声波测试中，乔治希望能减轻疼痛。他的团队对19名参与者的手臂进行了不断增加的加热，这些参与者在重复测试时往往会变得更加敏感，在最后一次测试中报告说，他们在较低的温度下感到疼痛。但是，如果在第一次和最后一次测试之间，他们将超声波脉冲对准丘脑，他们的痛阈下降了一半。乔治说，要继续追求这项技术，“这绝对是一个双重的绿灯”。\n乔治定期治疗患有经颅多发性硬化的抑郁症患者，并见证了这项技术拯救生命。“但每个人都在想，我们是否可以用一种不同的技术深入研究-那将是游戏规则的改变者，”他说。“超声波有这样的承诺，但问题是它真的能做到吗？”", "note_en": "As a way to see inside the body, revealing a tumor or a fetus, ultrasound is tried and true. But neuroscientists have a newer ambition for the technology: tinkering with the brain. At frequencies lower than those of a sonogram but still beyond the range of human hearing, ultrasound can penetrate the skull and boost or suppress brain activity. If researchers can prove that ultrasound safely and predictably changes human brain function, it could become a powerful, noninvasive research tool and a new means of treating brain disorders.\n How ultrasound works on the brain remains mysterious. But recent experiments have offered reassurance about safety, and small studies hint at meaningful effects in humans—dampening pain, for example, or subtly enhancing perception. “I’ve seen a lot of tantalizing data,” says Mark Cohen, a neuroscientist at the University of California, Los Angeles (UCLA). “While the challenges are very large, the potential of this thing is so much larger that we really have to pursue it.”\n Scientists can already modulate the brain noninvasively by delivering electric current or magnetic pulses across the skull. The U.S. Food and Drug Administration (FDA) has approved transcranial magnetic stimulation (TMS) to treat depression, migraine pain, and obsessive-compulsive disorder (OCD).\n But unlike magnetic or electric fields, sound waves can be focused—like light through a magnifying glass—on a point deep in the brain without affecting shallower tissue. For now, that combination of depth and focus is possible only with a surgically implanted wire. But ultrasound could temporarily disrupt a deep human brain region—the almond-shaped amygdala, a driver of emotional responses, for example, or the thalamus, a relay station for pain and regulator of alertness—to test its function or treat disease.\n Results in animals are encouraging. Experiments in the 1950s first showed ultrasound waves could suppress neural activity in a visual region of the cat brain. In rodents, aiming ultrasound at motor regions has triggered movements such as a twitch of a paw or whisker. And focusing it on a frontal region of monkey brains can change how the animals perform at eye movement tasks.\n But it’s technically tricky to aim ultrasound through thick, dense skull bone and to show its energy has landed at the intended point. And ultrasound’s effects on the brain can be hard to predict. How much it boosts or suppresses neural activity depends on many parameters, including the timing and intensity of ultrasound pulses, and even characteristics of the targeted neurons themselves. “I have tremendous excitement about the potential,” says Sarah Hollingsworth Lisanby, a psychiatrist at the National Institute of Mental Health who studies noninvasive neuromodulation. “We also need to acknowledge that there’s a lot we have to learn,” she says.\n For one thing, researchers are largely in the dark about how sound waves and brain cells interact. “That’s the million-dollar question in this field,” says Mikhail Shapiro, a biochemical engineer at the California Institute of Technology. At high intensities, ultrasound can heat up and kill brain cells—a feature neurosurgeons have exploited to burn away sections of brain responsible for tremors.\n Even at intensities that don’t significantly increase temperature, ultrasound exerts a mechanical force on cells. Some studies suggest this force alters ion channels on neurons, changing the cells’ likelihood of firing a signal to neighbors. If ultrasound works primarily via ion channels, “That’s great news,” Shapiro says, “because that means we can look at where those channels are expressed and make some predictions about what cell types will be excited.” In a preprint on bioRxiv last month, Shapiro’s team reported that exposing mouse neurons in a dish to ultrasound opens a particular set of calcium ion channels to render certain cells more excitable.\n But these channels alone won’t explain ultrasound’s effects, says Seung-Schik Yoo, a neuroscientist at Harvard University. He notes that ultrasound also appears to affect receptors on nonneuronal brain cells called glia. “It’s very hard to [develop] any unifying theory about the exact mechanism” of ultrasound, he says.\n Regardless of mechanism, ultrasound is starting to show clear, if subtle, effects in humans. In 2014, a team at Virginia Polytechnic Institute and State University showed focused ultrasound could increase electrical activity in a sensory processing region of the human brain and improve participants’ ability to discern the number of points being touched on their fingers. Neurologist Christopher Butler at the University of Oxford and colleagues have tested ultrasound during a more complex sensory task: judging the motion of drifting, jiggling dots on a screen. Last month at the Cognitive Neuroscience Society’s annual meeting online, he reported that stimulating a motion-processing visual region called MT improved subjects’ ability to judge which way the majority of the dots drifted.\n Ultrasound’s effects have so far been subtler than those of TMS, says Mark George, a psychiatrist at the Medical University of South Carolina, who helped develop and refine that technology. With TMS, “you put it on your head and turn it on and your thumb moves,” he says. But the ultrasound experiments that prompted paw twitches in mice used intensities “so, so, so much higher than what we’re being allowed to use in humans.”\n Regulators have limited human studies in part because ultrasound has the potential to cook the brain or cause damage through cavitation—the creation of tiny bubbles in tissue. In 2015, Yoo and colleagues found microbleeds, a sign of blood vessel damage, in sheep brains repeatedly exposed to ultrasound. “This was a huge speed bump,” says Kim Butts Pauly, a biophysicist at Stanford University. But in February in  Brain Stimulation, her group reported microbleeds in control animals as well, suggesting this damage might result from dissection of the brains. Butts Pauly and Yoo now say they’re confident the technology can be used safely.\n Cohen and collaborators recently tested safety in people by aiming ultrasound at regions slated for surgical removal to treat epilepsy. With FDA’s OK, they used intensities up to eight times as high as the limit for diagnostic ultrasound. As they reported in a preprint on medRxiv in April, they found no significant damage to brain tissue or blood vessels. However, to find the limit of safety, researchers will likely need to go all the way to levels that damage tissue, Cohen says.\n Several teams are cautiously moving into tests of ultrasound as treatment. In 2016, UCLA neuroscientist Martin Monti and colleagues reported that a man in a minimally conscious state regained consciousness following ultrasound stimulation of his thalamus. Monti is preparing a publication on a follow-up study of three people with chronically impaired states of consciousness. After ultrasound, they showed increased responsiveness over a period of days—much faster than expected, Monti says, although the study included no control group.\n That research and the tests in epilepsy patients used an ultrasound device developed by BrainSonix Corporation. Its founder, UCLA neuropsychiatrist Alexander Bystritsky, hopes ultrasound can disrupt neural circuits that drive symptoms of OCD. A team at Massachusetts General Hospital and Baylor College of Medicine is planning a study in humans using the BrainSonix device, he says.\n Columbia University biomedical engineer Elisa Konofagou hopes to use ultrasound to treat Alzheimer’s disease. Before COVID-19 interrupted participant recruitment, she and colleagues were preparing a pilot study to inject tiny gas-filled bubbles into the bloodstream of six people with Alzheimer’s and use pulses of ultrasound to oscillate the microbubbles in blood vessels lining the brain. The mechanical force of those vibrations can temporarily pull apart the cells lining these vessels. The researchers hope opening this blood-brain barrier will help the brain clear toxic proteins. (Konofagou’s team and others are also exploring this ultrasound-microbubble combination to deliver drugs to the brain.)\n In his first test of ultrasound after years of studying TMS, George looked to reduce pain. His team applied increasing heat to the arms of 19 participants, who tended to become more sensitive over repeated tests, reporting pain at lower temperatures by the last test. But if, between the first and last test, they had pulses of ultrasound aimed at the thalamus, their pain threshold dipped half as much. “This is definitely a double green light” to keep pursuing the technology, George says.\n George regularly treats depressed patients with TMS and has seen the technology save lives. “But everybody wonders if we could go deep with a different technology—that would be a game changer,” he says. “Ultrasound holds that promise, but the question is can it really deliver?”", "posttime": "2020-07-02 12:26:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "对准,ultrasound,超声波", "title": "将超声波对准大脑提高了新疗法的希望", "title_en": "Aiming ultrasound at the brain raises hope of new treatments", "transed": 1, "url": "https://www.sciencemag.org/news/2020/06/aiming-ultrasound-brain-raises-hope-new-treatments?MvBriefArticleId=9389", "via": "", "real_tags": ["对准", "超声波"]}, {"category": "", "categoryclass": "", "imagename": "fe7a183426822d1ee0e3647b99b4cc77.png", "infoid": 1009422, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新冠肺炎推动了数以百万计的人在家工作，一大批提供跟踪工人的软件的公司已经涌入，向全国各地的雇主推销他们的产品。\n这些服务听起来往往相对无害。一些供应商将他们的工具标榜为“自动时间跟踪”或“工作场所分析”软件。其他公司则向担心数据泄露或知识产权盗窃的公司进行营销。我们将这些工具统称为“BOSS WARE”。虽然Bossware旨在帮助雇主，但它通过记录每一次点击和击键，秘密收集诉讼信息，以及使用远远超出管理员工所需和比例的其他间谍功能，将员工的隐私和安全置于危险之中。\n这是不对的。当家变成办公室时，它仍然是家。工人不应该受到非双方同意的监视，也不应该感到有压力在自己家里接受审查，以保住自己的工作。\n博世通常生活在一台电脑或智能手机上，并有权访问该设备上发生的一切数据。大多数BOSS软件或多或少都会收集用户所做的一切。我们查看了营销材料、演示和客户评论，以了解这些工具是如何工作的。这里要列出的单个监控类型太多了，但我们将尝试将这些产品可以监控的方式细分为一般类别。\n最广泛和最常见的监测类型是“活动监测”。这通常包括员工使用哪些应用程序和网站的日志。它可能包括他们发送电子邮件或消息的人-包括主题行和其他元数据-以及他们在社交媒体上发布的任何帖子。大多数BOSS软件还记录来自键盘和鼠标的输入级别-例如，许多工具提供用户输入和点击量的每分钟细目，将其作为生产力的替代。生产力监测软件将试图将所有这些数据组合成简单的图表或图形，让经理们对员工的工作有一个更高层次的了解。\n我们看到的每一种产品都可以频繁地截取每个员工设备的屏幕截图，有些产品还提供直接的、实时的屏幕视频源。这些原始图像数据通常排列在时间线上，这样老板们就可以回顾工作日，看看他们在任何给定的时间点都在做什么。有几种产品还可以充当键盘记录器，记录员工的每一次按键操作，包括未发送的电子邮件和私人密码。有几个甚至让管理员参与进来，接管用户桌面的远程控制。这些产品通常不区分与工作相关的活动和个人账户凭证、银行数据或医疗信息。\n一些老板软件甚至走得更远，深入员工设备周围的物理世界。为移动设备提供软件的公司几乎总是使用GPS数据进行位置跟踪。至少有两项服务-StaffCop Enterprise和CleverControl-允许雇主秘密激活员工设备上的网络摄像头和麦克风。\n大体上，有两种方式可以部署BOSS软件：作为对员工可见(甚至可能由员工控制)的应用程序，或者作为员工看不到的秘密后台进程。我们调查的大多数公司都允许雇主选择以任何一种方式安装他们的软件。\n有时，员工可以看到监控他们的软件。他们可以选择打开或关闭监控，通常被框定为“打卡”和“打卡离开”。当然，工人关闭监控的事实会让他们的雇主看到。例如，使用Time Doctor，员工可以选择从他们的工作会话中删除特定的屏幕截图。但是，删除屏幕截图也会删除关联的工作时间，因此员工只能在被监控的时间内获得积分。\n员工可能会被授予访问收集到的有关他们的部分或全部信息的权限。WorkSmart背后的Crossver公司将其产品比作电脑工作的健身跟踪器。它的界面允许工作人员看到系统对他们自己的活动的结论，并以一系列图形和图表的形式呈现出来。\n不同的老板用具公司向员工提供不同程度的透明度。有些公司允许员工访问其经理拥有的所有或大部分信息。其他人，如Teramind，表示他们正在打开并收集数据，但不会透露他们正在收集的所有信息。在任何一种情况下，用户通常都不清楚正在收集的确切数据是什么，而没有向其雇主提出具体要求，也没有对软件本身进行仔细的检查。\n大多数开发可见监控软件的公司也生产试图对他们监控的人隐藏自己的产品。Teramind、Time Doctor、StaffCop和其他公司制造的BOSS软件被设计成尽可能难以检测和移除。在技术层面上，这些产品与跟踪器没有什么区别。事实上，一些公司要求雇主在安装产品之前专门配置杀毒软件，这样工人的杀毒软件就不会检测到并阻止监控软件的活动。\n这类软件是为一个特定的目的而销售的：监控工人。然而，这些产品中的大多数实际上只是通用的监控工具。StaffCop提供了他们产品的一个版本，专门为监控孩子在家中使用互联网而设计，ActivTrak表示，他们的软件也可以被家长或学校官员用来监控孩子的活动。客户对其中一些软件的评论表明，许多客户确实在办公室之外使用这些工具。\n大多数提供隐形监控的公司建议只将其用于雇主拥有的设备。然而，许多公司也提供远程和“静默”安装等功能，可以在员工不知情的情况下将监控软件加载到员工计算机上，而他们的设备不在办公室。这之所以有效，是因为许多雇主对他们分发的计算机拥有管理权限。但对于一些员工来说，他们使用的公司笔记本电脑是他们唯一的电脑，因此公司监控无时无刻不存在。雇主、校方和亲密伙伴滥用该软件的可能性很大。而受害者可能永远不会知道他们受到了这样的监控。\n下表显示了一小部分BOSS软件供应商提供的监视和控制功能。这不是一个全面的名单，可能不能代表整个行业；我们查看了行业指南和搜索结果中提到的公司，这些公司拥有面向公众的信息营销材料。\n根据这些公司的营销材料，介绍了几种工人监控产品的特点。我们调查的10家公司中有9家提供“静默”或“隐形”监控软件，这种软件可以在员工不知情的情况下收集数据。\n工人监测业务并不新鲜，在全球大流行爆发之前就已经相当大了。虽然很难评估老板用具有多常见，但毫无疑问，由于新冠肺炎的原因，工人们被迫在家工作，这种情况无疑变得更加常见。拥有InterGuard的意识技术公司声称，在疫情爆发后的最初几周内，其客户群就增长了300%以上。我们看到的许多供应商在向公司推销产品时都利用了新冠肺炎。\n世界上一些最大的公司使用的是老板用的餐具。HubStaff的客户包括Insta、Groupon和Ring。时代医生声称有83,000名用户；它的客户包括好事达、爱立信、威瑞森和Re/Max。ActivTrak被6500多个组织使用，包括亚利桑那州立大学、埃默里大学以及丹佛和马里布两个城市。像StaffCop和Teramind这样的公司没有披露他们客户的信息，但声称为医疗保健、银行、时尚、制造业和呼叫中心等行业的客户提供服务。客户对监控软件的评论提供了有关如何使用这些工具的更多示例。\n我们不知道有多少这样的组织选择使用隐形监控，因为雇主自己并不倾向于做广告。此外，没有可靠的方式让员工自己知道，因为有这么多看不见的软件是明确设计来逃避检测的。一些工人签订了合同，授权进行某些类型的监控或阻止其他类型的监控。但对于许多工人来说，可能无法判断他们是否被监视。对于担心监控可能性的员工来说，假设雇主提供的任何设备都在跟踪他们，这可能是最安全的。\n博士威尔供应商将他们的产品推向各种用途。其中一些最常见的是时间跟踪、工作效率跟踪、遵守数据保护法和防止知识产权盗窃。一些用例可能是正确的：例如，处理敏感数据的公司通常有法律义务确保数据不会从公司计算机中泄露或被盗。对于非现场员工，这可能需要一定级别的设备监控。但是雇主不应该为了这样的安全目的而进行任何监控，除非他们能证明这是必要的，相称的，并且是针对它试图解决的问题的。\n不幸的是，许多用例涉及雇主对工人行使过大的权力。也许我们观察到的最大类别的产品是为“生产力监控”或增强的时间跟踪而设计的，也就是说，记录员工所做的一切，以确保他们足够努力。一些公司将他们的工具框定为对经理和工人都有潜在的好处。他们声称，收集员工一天中每一秒的信息不仅对老板有好处，据说对员工也有帮助。其他供应商，如Work Examer和StaffCop，直接向不信任员工的经理推销自己。这些公司经常建议将裁员或奖金与源自其产品的业绩指标捆绑在一起。\n一些公司还将他们的产品作为惩罚性工具进行营销，或者作为为潜在的工人诉讼收集证据的方式。InterGuard广告称，它的软件“可以静默地远程安装，这样你就可以(对你的员工)进行秘密调查，并收集防弹证据，而不会惊动嫌疑的不法分子。”它继续说，这些证据可以用来对抗“不当解雇诉讼”。换句话说，InterGuard可以向雇主提供天文数字的私人、秘密收集的信息，试图消除工人对不公平待遇的法律追索权。\n所有这些用例，即使是上面讨论的那些不太烦人的用例，都不能保证Bossware通常收集的信息量。而且没有任何理由隐瞒监视正在发生的事实。\n大多数产品都会定期截屏，但很少有产品允许员工选择要分享的截图。这意味着敏感的医疗、银行或其他个人信息与工作电子邮件和社交媒体的屏幕截图一起被捕获。包括键盘记录程序在内的产品甚至更具侵入性，最终往往会窃取工人个人账户的密码。\n不幸的是，过度收集信息通常不是偶然的，而是一种特征。Work Examer特别宣传其产品能够捕获私人密码。另一家公司Teramind会报告输入电子邮件客户端的每一条信息-即使这些信息随后被删除。几款产品还可以从社交媒体上的私人消息中解析出一串串文本，这样雇主就可以知道员工私人对话的最私密细节。\n让我们明确一下：这个软件是专门为帮助雇主在员工不知情或未经他们同意的情况下阅读他们的私人信息而设计的。无论以什么标准衡量，这都是不必要的，也是不道德的。\n根据美国现行法律，雇主在自己的设备上安装监控软件的回旋余地太大。此外，他们几乎不能阻止他们强迫员工在自己的设备上安装软件(只要在工作时间以外可以禁用监控)。不同的州对雇主可以做什么和不可以做什么有不同的规定。但针对侵入性监控软件，工人的法律追索权往往有限。\n这种情况可以而且必须改变。随着州和国家立法机构继续通过消费者数据隐私法，它们还必须建立关于雇主的对工人的保护。要开始，请执行以下操作：\n工具应该最大限度地减少它们收集的信息，并避免清理私人消息和密码等个人数据。\n工人需要一项私人诉讼权利，这样他们就可以起诉违反这些法定隐私保护的雇主。\n与此同时，知道自己受到监控的员工-并对这样做感到放心-应该与雇主进行对话。采用了BOSS软件的公司必须考虑他们的目标是什么，并且应该尝试以较少干扰的方式实现这些目标。博世软件经常激励错误的生产力-例如，强迫人们每隔几分钟就摇晃鼠标和打字，而不是阅读或停下来思考。持续的监督可能会扼杀创造力，减少信任，并导致倦怠。如果雇主担心数据安全，他们应该考虑专门针对真实威胁量身定做的工具，并将过程中捕获的个人数据降至最低。\n许多员工会觉得说话不舒服，或者可能怀疑雇主在秘密监视他们。如果他们不知道监控范围，他们应该考虑到工作设备可能收集所有信息-从Web历史记录到私人消息再到密码。如果可能，他们应该避免使用工作设备做任何私人事情。如果员工被要求在他们的个人设备上安装监控软件，他们或许可以要求雇主提供一个单独的、专门针对工作的设备，这样私人信息就可以更容易地被隔离开来。\n最后，在失业率创历史新高的时期，出于对继续受雇的担忧，工人们可能会感到不舒服，因为他们会直言不讳地说出自己被监视的情况。在侵入性的、过度的监测和失业之间做出选择根本不是一个选择。\n新冠肺炎给我们大家带来了新的压力，很可能也会从根本上改变我们的工作方式。但是，我们不能让它开启一个更加无处不在的监测的新时代。我们比以往任何时候都更多地通过我们的设备生活。这使得我们有权对我们的数字生活保密--不受政府、科技公司和我们的雇主的影响，这一点比以往任何时候都更加重要。", "note_en": "COVID-19 has pushed millions of people to work from home, and a flock of companies offering software for tracking workers has swooped in to pitch their products to employers across the country.\n The services often sound relatively innocuous. Some vendors bill their tools as “automatic time tracking” or “workplace analytics” software. Others market to companies concerned about data breaches or intellectual property theft. We’ll call these tools, collectively, “bossware.” While aimed at helping employers, bossware puts workers’ privacy and security at risk by logging every click and keystroke, covertly gathering information for lawsuits, and using other spying features that go far beyond what is necessary and proportionate to manage a workforce.\n This is not OK. When a home becomes an office, it remains a home. Workers should not be subject to nonconsensual surveillance or feel pressured to be scrutinized in their own homes to keep their jobs.\n  Bossware typically lives on a computer or smartphone and has privileges to access data about everything that happens on that device. Most bossware collects, more or less, everything that the user does. We looked at marketing materials, demos, and customer reviews to get a sense of how these tools work. There are too many individual types of monitoring to list here, but we’ll try to break down the ways these products can surveil into general categories.\n The broadest and most common type of surveillance is “activity monitoring.” This typically includes a log of which applications and websites workers use. It may include who they email or message—including subject lines and other metadata—and any posts they make on social media. Most bossware also records levels of input from the keyboard and mouse—for example, many tools give a minute-by-minute breakdown of how much a user types and clicks, using that as a proxy for productivity. Productivity monitoring software will attempt to assemble all of this data into simple charts or graphs that give managers a high-level view of what workers are doing.\n Every product we looked at has the ability to take frequent screenshots of each worker’s device, and some provide direct, live video feeds of their screens. This raw image data is often arrayed in a timeline, so bosses can go back through a worker’s day and see what they were doing at any given point. Several products also act as a   keylogger , recording every keystroke a worker makes, including unsent emails and private passwords. A couple even let administrators jump in and take over remote control of a user’s desktop. These products usually don’t distinguish between work-related activity and personal account credentials, bank data, or medical information.\n  Some bossware goes even further, reaching into the physical world around a worker’s device. Companies that offer software for mobile devices nearly always include   location tracking using GPS data . At least two services—StaffCop Enterprise and CleverControl—let employers   secretly activate webcams and microphones on worker devices .\n There are, broadly, two ways bossware can be deployed: as an app that’s visible to (and maybe even controllable by) the worker, or as a secret background process that workers can’t see. Most companies we looked at give employers the option to install their software either way.\n  Sometimes, workers can see the software that is surveilling them. They may have the option to turn the surveillance on or off, often framed as “clocking in” and “clocking out.” Of course, the fact that a worker has turned off monitoring will be visible to their employer. For example, with Time Doctor, workers may be given the option to   delete particular screenshots  from their work session. However, deleting a screenshot will also delete the associated work time, so workers only get credit for the time during which they are monitored.\n Workers may be given access to some, or all, of the information that’s collected about them. Crossover, the company behind WorkSmart,   compares its product  to a fitness tracker for computer work. Its interface allows workers to see the system’s conclusions about their own activity presented in an array of graphs and charts.\n Different bossware companies offer different levels of transparency to workers. Some give workers access to all, or most, of the information that their managers have. Others, like   Teramind , indicate that they are turned on and collecting data, but don’t reveal everything they’re collecting. In either case, it can often be unclear to the user what data, exactly, is being collected, without specific requests to their employer or careful scrutiny of the software itself.\n  The majority of companies that build visible monitoring software also make products that try to hide themselves from the people they’re monitoring. Teramind, Time Doctor, StaffCop, and others make bossware that’s designed to be as difficult to detect and remove as possible. At a technical level, these products are indistinguishable from   stalkerware . In fact, some companies require employers to   specifically configure antivirus software  before installing their products, so that the worker’s antivirus   won’t detect and block  the monitoring software’s activity.\n  This kind of software is marketed for a specific purpose: monitoring workers. However, most of these products are really just general purpose monitoring tools. StaffCop offers a   version of their product  specifically designed for monitoring children’s use of the Internet at home, and   ActivTrak states  that their software can also be used by parents or school officials to monitor kids’ activity.   Customer reviews for some of the software  indicate that many customers do indeed use these tools outside of the office.\n Most companies that offer invisible monitoring recommend that it only be used for devices that the employer owns. However, many also offer features like remote and “silent” installation that can load monitoring software on worker computers, without their knowledge,   while their devices are outside the office . This works because many employers have administrative privileges on computers they distribute. But for some workers, the company laptop they use is their only computer, so company monitoring is ever-present. There is great potential for misuse of this software by employers, school officials, and intimate partners. And the victims may never know that they are subject to such monitoring.\n The table below shows the monitoring and control features available from a small sample of bossware vendors. This isn’t a comprehensive list, and may not be representative of the industry as a whole; we looked at companies that were referred to in   industry guides  and search results that had informative publicly-facing marketing materials.\n   Features of several worker-monitoring products, based on the companies’ marketing material. 9 of the 10 companies we looked at offered “silent” or “invisible” monitoring software, which can collect data without worker knowledge.\n  The worker surveillance business is not new, and it was already quite large before the outbreak of a global pandemic. While it’s difficult to assess how common bossware is, it’s undoubtedly become   much more common  as workers are forced to work from home due to COVID-19. Awareness Technologies, which owns InterGuard,   claimed to have grown its customer base  by over 300% in just the first few weeks after the outbreak. Many of the vendors we looked at exploit COVID-19 in their marketing pitches to companies.\n Some of the biggest companies in the world use bossware.   Hubstaff customers  include Instacart, Groupon, and Ring.   Time Doctor  claims 83,000 users; its customers include Allstate, Ericsson, Verizon, and Re/Max.   ActivTrak  is used by more than 6,500 organizations, including Arizona State University, Emory University, and the cities of Denver and Malibu. Companies like StaffCop and Teramind do not disclose information about their customers, but   claim to serve clients  in industries like health care, banking, fashion, manufacturing, and call centers.   Customer reviews  of monitoring software give more examples of how these tools are used.\n  We don’t know how many of these organizations choose to use invisible monitoring, since the employers themselves don’t tend to advertise it. In addition, there isn’t a reliable way for workers themselves to know, since so much invisible software is explicitly designed to evade detection. Some workers have contracts that authorize certain kinds of monitoring or prevent others. But for many workers, it may be impossible to tell whether they’re being watched. Workers who are concerned about the possibility of monitoring may be safest to assume that any employer-provided device is tracking them.\n  Bossware vendors market their products for a wide variety of uses. Some of the most common are time tracking, productivity tracking, compliance with data protection laws, and IP theft prevention. Some use cases may be valid: for example, companies that deal with sensitive data often have legal obligations to make sure data isn’t leaked or stolen from company computers. For off-site workers, this may necessitate a certain level of on-device monitoring. But an employer should not undertake any monitoring for such security purposes unless they can show it is necessary, proportionate, and specific to the problems it’s trying to solve.\n Unfortunately, many use cases involve employers wielding excessive power over workers. Perhaps the largest class of products we looked at are designed for “productivity monitoring” or enhanced time tracking—that is, recording everything that workers do to make sure they’re working hard enough. Some companies frame their tools as   potential boons for both managers and workers . Collecting information about every second of a worker’s day isn’t just good for bosses, they claim—it supposedly helps the worker, too. Other vendors, like   Work Examiner  and   StaffCop , market themselves directly to managers who don’t trust their staff. These companies often recommend tying   layoffs  or   bonuses  to performance metrics derived from their products.\n  Some firms also market their products as punitive tools, or as ways to gather evidence for potential worker lawsuits. InterGuard   advertises  that its software “can be silently and remotely installed, so you can conduct covert investigations [of your workers] and bullet-proof evidence gathering without alarming the suspected wrongdoer.” This evidence, it continues, can be used to fight “wrongful termination suits.” In other words, InterGuard can provide employers with an astronomical amount of private, secretly-gathered information to try to quash workers’ legal recourse against unfair treatment.\n None of these use cases, even the less-disturbing ones discussed above, warrant the amount of information that bossware usually collects. And nothing justifies hiding the fact that the surveillance is happening at all.\n Most products take periodic screenshots, and few of them allow workers to choose which ones to share. This means that sensitive medical, banking, or other personal information are captured alongside screenshots of work emails and social media. Products that include keyloggers are even more invasive, and often end up capturing passwords to workers’ personal accounts.\n  Unfortunately, excessive information collection often isn’t an accident, it’s a feature. Work Examiner specifically advertises its product’s ability to capture private passwords. Another company, Teramind, reports on every piece of information typed into an email client—even if that information is subsequently deleted. Several products also parse out strings of text from private messages on social media so that employers can know the most intimate details of workers’ personal conversations.\n Let’s be clear: this software is specifically designed to help employers read workers’ private messages without their knowledge or consent. By any measure, this is unnecessary and unethical.\n  Under current U.S. law, employers have too much leeway to install surveillance software on devices they own. In addition, little prevents them from coercing workers to install software on their own devices (as long as the surveillance can be disabled outside of work hours). Different states have different rules about what employers can and can’t do. But workers often have limited legal recourse against intrusive monitoring software.\n That can and must change. As state and national legislatures continue to adopt   consumer data privacy laws , they must also establish protections for workers with respect to their employers. To start:\n Tools should minimize the information they collect, and avoid vacuuming up personal data like private messages and passwords.\n  And workers need a   private right of action , so they can sue employers that violate these statutory privacy protections.\n In the meantime, workers who know they are subject to surveillance— and feel comfortable doing so—should engage in conversations with their employers. Companies that have adopted bossware must consider what their goals are, and should try to accomplish them in less-intrusive ways. Bossware often incentivizes the wrong kinds of productivity—for example, forcing people to jiggle their mouse and type every few minutes instead of reading or pausing to think. Constant monitoring can stifle creativity, diminish trust, and contribute to burnout. If employers are concerned about data security, they should consider tools that are specifically tailored to real threats, and which minimize the personal data caught up in the process.\n Many workers won’t feel comfortable speaking up, or may suspect that their employers are monitoring them in secret. If they are unaware of the scope of monitoring, they should consider that work devices may collect everything—from web history to private messages to passwords. If possible, they should avoid using work devices for anything personal. And if workers are asked to install monitoring software on their personal devices, they may be able to ask their employers for a separate, work-specific device from which private information can be more easily siloed away.\n Finally, workers may not feel comfortable speaking up about being surveilled out of concern for staying employed in a time with   record unemployment . A choice between invasive and excessive monitoring and joblessness is not really a choice at all.\n COVID-19 has put new stresses on us all, and it is likely to fundamentally change the ways we work as well. However, we must not let it usher in a new era of even-more-pervasive monitoring. We live more of our lives through our devices than ever before. That makes it more important than ever that we have a right to keep our digital lives private—from governments, tech companies, and our employers.", "posttime": "2020-07-02 12:26:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "跟踪,secretive,员工", "title": "侵入性的、秘密的“博斯瓦”跟踪工作人员", "title_en": "Invasive, Secretive “Bossware” Tracking Workers", "transed": 1, "url": "https://www.eff.org/deeplinks/2020/06/inside-invasive-secretive-bossware-tracking-workers", "via": "", "real_tags": ["跟踪", "secretive", "员工"]}, {"category": "", "categoryclass": "", "imagename": "c08dd76af8715a25e2ca0fb072ea571e.jpg", "infoid": 1009419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新冠肺炎大流行期间，病例数量和住院人数迅速上升，美国社会中有一小部分人坚决拒绝戴口罩，但他们的声音令人难以置信。他们中的许多人都是男性，他们似乎认为口罩是阉割脸部的避孕套，必须拒绝。例如，看看唐纳德·特朗普(Donald Trump)6月20日在俄克拉何马州塔尔萨(Tulsa)集会上的惨败，就会发现他的选民中的人，像特朗普自己一样，避免戴口罩。相比之下，像伊万卡·特朗普(Ivanka Trump)这样的女性可以选择戴不戴面具，因为她们没有男子汉气概需要保护。\n在现实中，无论是口罩还是避孕套，对这些屏障保护方法的抵抗力-这两种方法都可以防止佩戴者将病毒传播给其他人-显然会对公共健康构成威胁。一个不戴口罩的人拒绝堵住他的唾液和可能含有的病毒，这是在故意危及他周围的人。他为什么要对自己和他人冒这些风险呢？\n当艾滋病病毒在美国出现时，公共卫生反应的一个关键部分是敦促坚持使用避孕套。尽管这个建议很有道理，但在一些人口的口袋里，人们抵制它。研究人员开始挖掘促使这种抵抗的社会因素。他们发现，在与女性发生性关系的男性中，“男性意识”与拒绝使用避孕套有关。\n在进行这项研究的时候，有三个因素被认为是这一意识形态的支柱：地位、坚韧和反女性。今天，这个概念已经扩展了一点，可以包含其他功能。美国心理协会将这种意识形态定义为一种“特殊的标准星座”，要求男性将其归因于“冒险、冒险和暴力”。当然，选择在大流行期间不穿最简单的防护装备既是一种风险，也是一种冒险。\n也许并不令人惊讶的是，在这种男子气概的概念盛行的地方，体现这种概念的主要化身是有着史诗般的大摇大摆的白人男性。正如一位研究人员所描述的那样，这种在银幕上四处走动的“赛璐璐男性气概”，可能最著名的形式是阿诺德·施瓦辛格(Arnold Schwarzenegger)扮演的角色，代表了“西方男性气概的主要典范”。你看，尽管这些角色在他们的电影中随身携带着丰富的防弹衣和武器，但他们永远不会，永远不会戴上简单的屏障保护装置，因为病毒可以感觉到恐惧。\n在今天拒绝戴口罩的情况下，我们看到了这种拒绝避孕套的呼应，这种拒绝避孕套的想法根植于白人男性意识形态中。在首席男子气概表演者的带领下，这些男子正在做出越来越像是赛璐璐男子气概的最后一站。就像在另一个臭名昭著的“最后一战”中一样，他们冒着死在他们坚持制造的战场上的风险，以及他们带来的伤亡。\n许多人对这种行为感到困惑-对如此基本的东西犹豫不决，一种获得门槛如此之低的疾病传播预防药物。为什么这些男人在面对威胁时要表现出这种不戴面具的“赛璐璐男子气概”？原因是，避免戴面具发出了强烈的社会信号，其中裸露的脸就是表演者。但是观众是谁呢？\n要理解这一行为，就需要了解这些男性在他们的男性意识形态中所做的投资水平。尽管现实如此，特朗普还是这一意识形态的最高祭司。当他拒绝面具时，他的表演就成了模仿。这些人做出了深深的承诺，可能还进行了一些故意的自欺欺人，以保持对特朗普的忠诚。戴上面具将意味着浪费他们的投资和所有自我妥协的预期成果。\n所以，他们不戴面具。在这样做的过程中，他们希望自己的男性意识形态集团会接受他们，尊重他们，而不是拒绝他们。\n具有讽刺意味的是，这些人认为他们正在体现粗犷、个人主义的美国人的理想，而他们的拒绝在一定程度上是因为担心别人会怎么看他们。他们沉醉在利己主义和阳刚思想的有毒酝酿中，将拒绝保护自己和他人误认为是性格的标志，而这反而是性格上的标志。\n一些想要减轻这些行为危害的人已经清楚地认识到转向赛璐璐男子气概人格化的价值。6月18日，加利福尼亚州州长加文·纽瑟姆(Gavin Newsom)在全州范围内发布命令，要求人们在公共场所佩戴口罩。如果他要求所有加州人领养一条眼镜蛇幼崽，那么他引起的激烈反应将是合适的。推特上甚至有一个短暂流行的标签“召回纽瑟姆”。\n纽瑟姆可能预料到了这种奇怪的世界的反弹，他与他在世的前任-杰里·布朗(Jerry Brown)、格雷·戴维斯(Gray Davis)、皮特·威尔逊(Pete Wilson)和阿诺德·施瓦辛格(Arnold Schwarzenegger)-联手发表了一份公共服务公告，敦促人们戴口罩。每个州长都有几句话要说。施瓦辛格的台词，带着他的赛璐璐英雄约翰·矩阵的所有超级男子汉的庄严神情被说出：“这不是关于软弱的…。。你只管去做就行了。“", "note_en": "In the midst of  rapidly rising case counts and hospitalizations during the COVID-19 pandemic, a small but incredibly loud segment of U.S. society has adamantly  refused to wear masks. Many of them are men, who seem to view masks as emasculating face condoms that must be rejected. For example, a look at Donald Trump’s debacle of a rally in Tulsa, Oklahoma, on June 20, shows that men in his base, like Trump himself,  avoid wearing masks. Women like Ivanka Trump, by contrast, can choose a mask or not because they have no masculinity to protect.\n  In reality, whether it’s a mask or a condom, resistance to these barrier methods of protection—both of which keep the wearer from transmitting a virus to someone else—clearly presents a danger to public health. A man without a mask is willfully endangering people around him by refusing to block his spit and the viruses it could contain. Why would he take these risks to himself and to others?\n  When HIV emerged in the United States, a key part of the public health response was to urge consistent condom use. Although the advice made obvious sense, in some pockets of the population, people resisted it. Researchers began to dig into the social factors that motivated this resistance. They found that among men who were having sex with women,  “masculine ideology” was associated with rejection of condom use.\n  At the time the research was being conducted, three factors were cited as the pillars of this ideology: status, toughness and anti-femininity. Today, the concept has been expanded a bit to encompass other features. The American Psychological Association has defined this ideology as a “ particular constellation of standards” that demands that men ascribe to “adventure, risk, and violence.” Certainly, choosing not to wear the simplest of protective gear during a pandemic is both a risk and an adventure.\n  Perhaps not surprisingly, where this conceptualization of manliness prevails, the dominant avatars who embody it are white men with epic swagger. As one researcher described it, this “ celluloid masculinity” muscling around on screens, perhaps most famously in the form of characters played by Arnold Schwarzenegger, represents a “dominant Western exemplar of manhood.” These characters, you see, despite the copious body armor and weaponry they tote around in their films, would never, ever don simple barrier protection devices because viruses can sense fear.\n  In today’s refusal to wear a mask, we see echoes of this condom rejection embedded in white masculine ideology. Led by the Masculinity Performer in Chief, these men are making what increasingly looks like the last stand for that celluloid masculinity. As in another infamous “ last stand,” they risk ending up dead on the battlefield they insisted on creating, along with the casualties they take with them.\n  A lot of people are baffled at this behavior—at balking at something so basic, a disease transmission preventative that has such a low barrier to access. Why do these men perform this mask-free “celluloid masculinity” in the literal face of a threat? The reason is that eschewing a mask sends a strong social signal, in which the bare face is the performance. But who is the audience?\n  Understanding this behavior requires understanding the level of investment that these men have made in their masculine ideology. Trump, reality notwithstanding, is  the high priest of this ideology. When he rejected masks, his became the performance to imitate. These men have made a deep commitment and probably engaged in some willful self-deception to remain loyal to Trump. Donning a mask would mean wasting their investment and the perceived fruits of all that self-compromise.\n  So, they go maskless. In doing so, they expect that their masculine ideology group will accept them, respect them and not reject them.\n  The irony is that these men think they&#39;re manifesting the ideal of the rugged, individualistic American, when their refusal really traces in part to a fear of what other people will think about them. Drunk on a toxic brew of self-interest and that masculine ideology, they mistake their refusal to protect themselves and others as a mark of character when instead, it&#39;s a mark  on their characters.\n  Some people who would like to mitigate the harm of these behaviors have clearly recognized the value of turning to those personifications of celluloid masculinity. On June 18, California Governor Gavin Newsom  issued a statewide order requiring that people wear masks in public places. The hot reaction he drew would have been suitable if he’d, say, required all Californians to adopt a baby cobra. There was even a briefly trending “recall Newsom” hashtag on Twitter.\n  Likely anticipating this bizarro-world backlash, Newsom joined forces with his surviving predecessors—Jerry Brown, Gray Davis, Pete Wilson and Arnold Schwarzenegger—to make a public service  announcement urging people to wear masks. Each governor had a couple of lines to deliver. Schwarzenegger’s lines, were spoken with all the hypermasculine gravitas of his celluloid hero John Matrix: “This is not about being weak…. Just do it.”", "posttime": "2020-07-02 11:49:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "避孕套,face,男性", "title": "脸部的避孕套：为什么有些男人拒绝戴口罩", "title_en": "The Condoms of the Face: Why Some Men Refuse to Wear Masks", "transed": 1, "url": "https://www.scientificamerican.com/article/the-condoms-of-the-face-why-some-men-refuse-to-wear-masks/", "via": "", "real_tags": ["避孕套", "face", "男性"]}, {"category": "", "categoryclass": "", "imagename": "e7c34325adbe1ea5bfde25a34efd2783.jpg", "infoid": 1009417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据路透社报道，英国监管机构正在仔细审查苹果和谷歌就iPhone制造商的移动Safari浏览器中的默认搜索引擎达成的一项长期协议。\n根据英国政府竞争和市场管理局编制的一份最新报告，谷歌每年仅在英国就为所谓的默认职位向苹果支付12亿GB(约合15亿美元)的“大部分”，换言之，即谷歌付钱给一家公司，让其搜索引擎成为浏览器或其他平台上的首选搜索引擎。\n报告称，这笔交易给谷歌的竞争对手制造了“进入和扩张的巨大障碍”。该报告还建议，要么限制苹果将此类交易货币化的能力，要么让用户在设置时选择搜索引擎。\n“这些支付的规模令人震惊，显示出谷歌对这些违约头寸的重视。”\n多年来，移动Safari一直依赖谷歌搜索，使iPhone成为谷歌移动广告业务的重要收入来源，并使谷歌在竞争中拥有竞争优势。2014年，法庭文件显示，谷歌支付了10亿美元，以确保美国移动Safari的违约地位。分析人士估计，在那之后的几年里，这一数字只会增加。苹果从中受益匪浅，估计每年可从此类配售交易中获利90亿美元，不过该公司从未披露过具体数字。\n监管机构现在担心，这笔大规模的英国交易可能会扼杀竞争。去年，谷歌为一个人口多得多的地区在美国配售支付的价格比六年多前高出50%。谷歌的竞争对手--虽然很少有像微软的必应(Bing)和DuckDuckGo这样真正留下来的--可能没有能力为默认iPhone浏览器的黄金位置支付如此大的费用。以下是第13页有关这笔交易的报告节选：\n在搜索领域，谷歌已与苹果(Apple)和许多最大的手机制造商谈判达成协议，根据协议，谷歌向这些合作伙伴支付搜索广告收入的一部分，以换取谷歌搜索(Google Search)占据设备上的默认搜索位置。这些支付的规模令人震惊，表明了谷歌对这些默认头寸的重视。2019年，谷歌仅在英国就支付了约12亿英镑来换取默认头寸，其中大部分支付给了苹果，因为苹果是Safari浏览器的默认头寸。与我们交谈过的谷歌的竞争对手强调，这些默认支付是抑制搜索市场竞争的最重要因素之一。消费者主要通过移动设备访问互联网，移动设备占普通搜索的三分之二以上，这一份额近年来大幅增长，未来可能还会继续增长。\n欧盟和美国的监管机构都在越来越多地关注大型科技公司，担心硅谷公司的规模和实力会使它们成为反竞争企业，尽管欧盟在实际执行此类规则和征收罚款方面要积极得多。在过去的十年里，欧盟已经给谷歌开了无数次数十亿美元的罚单，监管机构现在正在调查苹果对App Store的管理，以及它向开发者收取的费用。", "note_en": "UK regulators are scrutinizing a longstanding deal between Apple and Google over the default search engine in the iPhone maker’s mobile Safari browser,  reports  Reuters.\n According to an  updated report compiled by the UK government’s Competition and Markets Authority, Google pays Apple a “substantial majority” of the £1.2 billion (roughly $1.5 billion) it pays every year in the UK alone for so-called default positions, in other words when Google pays a company to make its search engine the go-to one in a browser or other platform.\n The report says the deal creates a “significant barrier to entry and expansion” for Google competitors. The report also suggests either limiting Apple’s ability to monetize such deals or to give users a choice of search engine upon setup.\n “The scale of these payments is striking and demonstrates the value that Google places on these default positions.”\n For years, mobile Safari has relied on Google search, making the iPhone a substantial revenue-generator for Google’s mobile ad business and giving Google a competitive edge over the competition. In 2014,  court documents revealed a $1 billion payment Google made to secure default position on mobile Safari in the US. Analysts estimate that amount has  only increased in the years since. Apple benefits greatly from this, with an  estimated $9 billion a year from such placement deals, though the company has never disclosed concrete figures.\n Regulators are now concerned this massive UK deal, which last year was 50 percent higher than what Google paid for US placement more than six years ago for a far more populous region, may stifle competition. Google competitors — though few, like Microsoft’s Bing and DuckDuckGo, actually remain — may not be in a position to pay such a large sum for prime placement on the default iPhone browser. Here’s the excerpt from the report, found on page 13, regarding the deal:\n In search, Google has negotiated agreements with Apple and with many of the largest mobile phone manufacturers under which it pays a share of search advertising revenues to these partners in return for Google Search occupying the default search positions on the device. The scale of these payments is striking and demonstrates the value that Google places on these default positions. In 2019, Google paid around £1.2 billion in return for default positions in the UK alone, the substantial majority of which was paid to Apple for being the default on the Safari browser. Rival search engines to Google that we spoke to highlighted these default payments as one of the most significant factors inhibiting competition in the search market. Consumers primarily access the internet through mobile devices, which account for over two-thirds of general searches, a share which has grown substantially in recent years and is likely to continue to grow in the future.\n Regulators in both the EU and the US are increasingly looking at Big Tech over concerns that the size and power Silicon Valley companies make them anticompetitive, although the EU has been far more aggressive with regards to actually enforcing such rules and levying fines. The EU has  handed Google numerous multibillion-dollar fines over the last decade, and  regulators are now looking into Apple over its management of the App Store and the fees it charges developers.", "posttime": "2020-07-02 10:52:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,google,谷歌,safari", "title": "谷歌仍在向苹果支付数十亿美元，以成为Safari的默认搜索引擎", "title_en": "Google is still paying Apple billions to be the default search engine in Safari", "transed": 1, "url": "https://www.theverge.com/2020/7/1/21310591/apple-google-search-engine-safari-iphone-deal-billions-regulation-antitrust", "via": "", "real_tags": ["苹果", "apple", "google", "谷歌", "safari"]}, {"category": "", "categoryclass": "", "imagename": "31033c905a4d40487332bbe3c724d5f2.jpg", "infoid": 1009415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "富士胶片估计它可以使用锶铁氧体(SrFe)介质制造400TB的磁带盒。这比目前的LTO-8墨盒大33倍，到2028年甚至更久，我们又多了四代LTO。\n富士胶片向我们简要介绍了最近的一次IT记者之旅。富士胶片是仅有的两家磁带介质制造商之一，索尼是另一家，而LTO是占主导地位的磁带格式。磁带是归档存储的首选介质-磁盘成本太高。但数据仍在不断增长。因此，需要增加容量。\n2017年，IBM和索尼展示了201 Gb/in²和246,200条/英寸的面密度。这意味着330TB的磁带盒在理论上是可能的-今天的LTO-8磁带可以容纳12TB。\n目前的磁带都涂有钡铁氧体(BaFE)，并且每一代LTO都使用形成较窄数据磁道的较小颗粒。这导致盒式磁带内部的每个磁带盘具有更大的容量。但是，如果BAFE颗粒变得太小，磁带驱动器的读/写头就不能再可靠地读取磁带上的位值[磁极性]。信噪比不足。\n再往前走一步，富士胶片将使锶铁氧体(SrFe)介质达到约224Gbit/in²的面密度和400TB的容量。它说：“SrFe的大部分磁性都优于BaFe，这将使我们在进一步减小颗粒尺寸的同时达到更高的性能水平。”\n如果我们查看LTO几代磁带的表，我们会发现我们目前在第8代(LTO-8)上，有96TB原始容量的盒式磁带。连续几代LTO的容量通常是原来的两倍。流向LTO-12，我们有192TB的子弹。\nLTO财团偶尔会宣布路线图延期。LTO-7和LTO-8格式于2010年公布。2014年，当LTO-6发货时，该联盟宣布了LTO第9代和第10代LTO。注册中心设想在2015年推出LTO-11，并于2017年10月宣布实际的LTO-11和LTO-12代。\nBlock&amp；Files预计，到2021年底，LTO财团将根据这一路线图扩展历史，将其路线图扩展到LTO-12以外。继续我们到目前为止看到的每代容量翻一番的进程，因此潜在的LTO-13将拥有384 TB的容量。\n建议的LTO-14的容量为768TB，超过了富士400TB的SrFE介质盒容量。如果我们愿意进一步预测，LTO-15的容量将是1.53PB。\nBlock&Amp；Files认为富士胶片可能需要比LTO-13晚一代的后锶铁氧体技术。\n那是什么时候？假设两到三年；假设2019年LTO-8发货的LTO世代之间间隔2.5年。我们将在2030年看到LTO-12，如果发生的话，在2032/33年看到LTO-13。\n我们将使用HDD作为参考点，因为该技术还将磁化位存储在沉积在基板上的记录介质层中；与磁带带形成对比的是盘片。\n硬盘的最大面密度为700 Gbit/in²或更大，有些驱动器的面密度要高得多。希捷Skyhawk AI磁盘达到867 Gbits/in²。东芝的MQ012.5英寸仍然以更高的密度存储数据；1.787 Tbits/in²。换句话说，硬盘钻头比磁带钻头小得多。\n这意味着在它们达到盘记录介质材料的当前播放状态之前，磁带介质面密度改进具有很大的净空空间。\n实际的读写头技术大致相当于磁盘和磁带。由于磁盘读/写头可以读取和写入如此小的位，那么理论上，磁带读/写头可以做同样的事情。因此，我们可以继续将越来越多的旧数据扔到磁带存档中，而技术也会跟上。", "note_en": "Fujifilm reckons it can build a 400TB tape cartridge using Strontium Ferrite (SrFe) media. This is 33 times larger than the current LTO-8 cartridge and takes us out four more LTO generations to 2028 and beyond\n We were briefed by Fujifilm on a recent IT Press Tour. Fujifilm is one of just two manufacturers of tape media – Sony is the other – and LTO is the dominant magnetic tape format. Tape is the preferred medium for archive storage – disk costs too much. But data keeps growing. Hence the need for capacity increases.\n In 2017, IBM and Sony demoed areal density of 201Gb/in² and 246,200 tracks per inch. This means 330TB tape cartridges are theoretically possible – today’s LTO-8 tapes hold 12TB.\n Current magnetic tapes are coated with Barium Ferrite (BaFe) and each LTO generation uses smaller particles formed into narrower data tracks. That results in more capacity per tape reel inside the cartridge. But if BaFe particles get too small a tape drive’s read/write head can no longer reliably read the bit values [magnetic polarity] on the tape. The signal to noise ratio is insufficient.\n  Step forward, Fujifilm which sees Strontium Ferrite (SrFe) media achieving around 224Gbit/in² area density and 400TB capacity.  It says “the majority of the magnetic properties of SrFe are superior to those of BaFe, which will enable us to reach a higher level of performance whilst further reducing the size of the particles.”\n If we look at a table of LTO tape generations we see we’re currently on gen 8 (LTO-8) with 96TB raw capacity cartridges. Successive LTO generations  generally double capacity. Stream forward to LTO-12 and we have 192TB cartridges.\n    Every so often the LTO consortium announces a roadmap extension. The  LTO-7 and LTO-8 formats were announced in 2010. In 2014, when LTO-6 was shipping, the consortium announced  LTO generations 9 and 10.  The Register envisaged an LTO-11 in 2015 and the actual LTO-11 and LTO-12 generations were announced in October 2017.\n Blocks &amp; Files expects the LTO consortium, by the end of 2021, to extend its roadmap beyond LTO-12, based on this roadmap extension history. Continuing the capacity doubling per generation progression we have seen so far, so a potential LTO-13 would have 384TB capacity.\n A suggested LTO-14 would have 768TB capacity, beyond Fujifilm’s 400TB SrFE media cartridge. If we care to project further, an LTO-15 would have a 1.53PB capacity.\n Blocks &amp; Files thinks Fujifilm may need a post-Strontium Ferrite technology one generation past LTO-13.\n When will that be? Assume two years to three years; say 2.5 years between LTO generations with  LTO-8 shipping in 2019. We’ll see LTO-12 in 2030 and LTO-13, if it happens, in 2032/33.\n   We will use HDDs as a reference point, since that technology also stores magnetised bits in a recording medium layer deposited on a substrate; a platter in contrast to a tape ribbon.\n Maximum HDD areal density is in the 700 Gbits/in² or greater area, with some drives having far higher areal density. A Seagate Skyhawk AI disk achieving 867 Gbits/in². Toshiba’s 2.5-inch MQ01 stores data at a higher density still; 1.787 Tbits/in². Put another way, HDD bits are a lot smaller than tape bits.\n This implies tape media areal density improvements have a lot of headroom before they reach the current state of play in disk recording media material.\n The actual read-write head technology is roughly equivalent between disk and tape. Since disk read/write heads can read and write such small bits then, in theory, tape read and write heads could do the same. So, we can keep on throwing more and more old data at tape archives and the technology will keep up.", "posttime": "2020-07-02 10:33:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fujifilm,tape,lto", "title": "Fujifilm指向即将出现的400TB磁带盒", "title_en": "Fujifilm points to 400TB tape cartridge on the horizon", "transed": 1, "url": "https://blocksandfiles.com/2020/06/29/fujifilm-400tb-magnetic-tape-cartridge-future/", "via": "", "real_tags": ["fujifilm", "tape", "lto"]}]