[{"category": "", "categoryclass": "", "imagename": "593d450de7bf3669422adf1ff024276d.jpg", "infoid": 1071202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在剑桥大学动物学系的网站上，Arik Kershenbaum 的页面列出了他的三个主要研究领域，其中一个领域脱颖而出。 Kershenbaum 研究“狼和其他犬科动物”、“海豚和鲸类动物”以及“外星人”。诚然，科学还没有发现任何可以研究的外星人，但 Kershenbaum 说，我们仍然可以合理确定地说出某些关于它们的事情。榜首：他们进化了。 “归根结底——动物为什么做它们所做的事情，为什么它们是它们现在的样子——是因为进化，”该大学格顿学院的讲师兼自然科学研究主任克森鲍姆说。他认为，进化是一条普遍的自然法则，就像万有引力一样——因此，这里对植物和动物的研究可以告诉我们一些关于地球以外世界潜在居民的有用信息。他在进化趋同过程中找到了这方面的证据，在进化趋同过程中，不相关的生物谱系进化出类似的特征，以适应类似的环境挑战。这是他在他的新书《银河系动物学家指南：地球上的动物揭示了外星人——以及我们自己》中详细提出的一个论点，该书借鉴了动物身体适应性的比较以及他自己的研究（以及其他人的研究） ) 进入动物交流。广达最近在他位于剑桥的家中通过视频会议与 Kershenbaum 进行了交谈。为清楚起见，对采访进行了压缩和编辑。你是动物学家；你在我们自己的星球上学习生活。是什么让你想写一本关于外星生命的书？当动物学家研究地球上的生命时，我们正在研究机制。我们正在研究生活是如何变成现在这样的。因为进化是世界各地生命的解释机制，所以我们在地球上发现的原理应该适用于宇宙的其他地方。思考其他星球上的生命如何进化和行为只是我与地球上动物工作的自然延伸。如果我们在这个星球上发现了一个失落的岛屿，我们就会从我们对生命进化的总体了解的角度来研究它的动物。你可以肯定，如果我们在另一个星球上发现了外星生命，我们会用同样的方法来询问为什么它们的外观和行为如此，以及它们是如何进化的。你认为自然选择——进化背后的关键机制——是不可避免的，而且它普遍适用。是什么让你如此自信？没有一个星球会拥有一种复杂的生命形式，它会完全独立存在。无论外星球上的生命是什么样的，它都一定是简单地开始的。现在，它可能仍然很简单；这是可能的。甚至在许多行星上都有可能。但是，如果生命要达到任何一种复杂性，那么复杂性积累的唯一方法就是保留有利的变化和创新，而失去不利的变化和创新——这正是自然选择的进化。\n你书中的一个关键思想是“趋同进化”的概念。那是什么，为什么重要？如果你观察到两种具有相似特征的动物——例如羽毛——你可能会假设它们从一个共同的祖先那里继承了它们：有羽毛的恐龙，它是所有现代鸟类的祖先。这只是常规的进化，孩子们有相似之处，因为他们继承了父母的特征。但有时你会看到动物具有它们不可能从共同祖先那里遗传的特征。例如，鸟类的翅膀与蝙蝠的翅膀的工作方式几乎相同。但是鸟类和蝙蝠的共同祖先是一种生活在 3 亿多年前的小型蜥蜴类生物，甚至比恐龙还早。它当然没有翅膀，而且它的大多数后代，包括大象和鳄鱼，都没有翅膀（谢天谢地）。所以那些翅膀一定是在不同的后代中分别进化的。有时，特征的这种“融合”是为了一些明显有用的东西，比如翅膀。但有时融合会产生具有如此多特征的奇异相似的生物，很难相信它们之间没有密切关系。例如，最近灭绝的袋狼 [一种原产于塔斯马尼亚和澳大利亚大陆的大型掠食性有袋动物]，很容易被误认为是一种特殊的狗，但它与袋鼠的关系要密切得多！然而，过着与现代土狼或豺狼相似的生活，意味着它会趋同地进化出许多相似的特征。您认为无论生物体在何处面临类似的环境挑战，它们都可能会提出类似的适应性解决方案。你希望在整个宇宙中看到这一点吗？考虑飞行，因为这是收敛的最著名的例子。如果你生活在一个有大气层，甚至有海洋或其他流体的星球上，如果你想通过这种流体从一个地方到另一个地方，只有几种方法可以做到。你可以跳。你可以漂浮，如果你比你所处的介质轻。唯一的另一种方法是通过空气动力学，用机翼来产生升力。这些是在流体介质中移动的机制。在地球上，飞行在四个不同的群体中进化了四个不同的时间：鸟类和蝙蝠以及翼龙和昆虫。它们都使用翅膀的事实并不是因为它们是在地球上进化而来的；这是因为飞行是有利的，而翅膀几乎是唯一的飞行方式。因此，我们可以预期这些约束在宇宙中的任何地方都在起作用。\n然而，这种洞察力能带我们走多远？正如你所说，任何需要飞行的生物都可能进化出翅膀。但是大黄蜂、蓝鸟和蝙蝠的翅膀却大不相同。是的，蝙蝠翅膀和蜜蜂翅膀是不同的，但只是在细节上，而不是原则上。两者都由刚性结构支撑的膜组成。两者都通过在膜上产生气流来产生升力。事实上，蜜蜂翅膀和蝙蝠翅膀的主要区别不在于它们的结构，而在于它们使用它们的方式。昆虫的体型小意味着它们不能像蝙蝠一样简单地扇动翅膀并期望飞翔。它们需要嗡嗡作响，在翅膀向前和向后的时候产生升力——鸟类和蝙蝠都做不到这一点。因此，与其在我们的星球上实现的多样性混淆我们的比较，我们实际上可以对我们的预测更有信心，因为我们可以看到这些解决方案的真正限制是多么严格。是的，鸟类、蝙蝠和蜜蜂有不同的翅膀，但它们都实现了相同的最终结果——空气动力学翅膀——尽管作用在它们身上的物理限制截然不同。进化（甚至宇宙）历史的巧合总会影响动物形状和外观的细节。我们有四肢只是因为它是一条四鳍鱼，大约在 4 亿年前从海里爬出来。如果进化史以不同的方式发展，我们很容易拥有六个肢体，甚至八个。因此，我们与外星行星上的同类物种之间永远不会真正有密切的相似性。但是有些事情受到如此严格的限制，以至于没有很多替代方法可以做事情。著名古生物学家和进化理论家斯蒂芬·杰伊·古尔德 (Stephen Jay Gould) 曾写过“重播生命的磁带”并让生命重新进化的想法。古尔德想象结果会有所不同；例如，我们不太可能最终得到智人。但这听起来像是在争论，虽然任何一个特定的结果都不太可能发生，但同样的创新会一次又一次地出现？这是完全正确的。斯蒂芬杰伊古尔德和西蒙康威莫里斯[剑桥大学的]之间有一个很大的争论：每次重播录音带都会有所不同吗？每次都会一样吗？但显然，正确答案是：会有所不同，但很多事情会相同。那些将是相同的事物是那些受物理定律或进化定律约束的事物。有一些数学规则支配着进化的运作方式。我[在书中]谈论的一件事是社交。社会性的进化是因为进化的特殊特征，而不是因为物理学。这类事情也是约束。无论您重播生活磁带的频率如何，它们都将继续成为约束。\n什么样的限制或压力推动了地球上的社会性，我们如何期望它们适用于其他地方？合作和交流在地球上非常普遍。乍一看，这令人困惑：为什么两个生​​物会合作？但是你不用考虑很长时间就会意识到如果他们都从中受益，他们就会合作。这条规则适用于任何星球。其他星球上的动物可能只是出于互惠互利的原因而合作，因为这对他们双方都有好处。但是地球上的大部分合作，大部分社会性，都是由相关性驱动的。我们合作是因为我们有关系。我们喂养我们的孩子，我们帮助我们的父母，我们与我们的兄弟姐妹交朋友。所有这些都在进化论中有很好的基础。我们的特征、我们的特征、我们的行为代代相传的方式是通过我们的基因。如果我们的基因让我们倾向于与我们的兄弟姐妹合作，那么我们会更成功，他们也会如此，我们都会传递我们的相关基因。问题是，我们不知道外星人有什么基因。因此，我们不能说这与地球上生物学的其他一些限制条件一样普遍。可能是外星生命形式彼此之间的联系方式完全不同，因此它们的社会性也可能完全不同。你的大部分个人研究都是关于动物交流的——狼、海豚和其他动物。您在该领域的工作如何影响您的思考？地球上动物交流的普遍特征是否适用于理解外星人的交流，无论是智能的还是其他的？有时，非常不同的动物的共同特征会跳起来打你的脸。它们隐藏在表面之下，但是当您看到它们时，它是如此明显。在我之前研究过海豚哨声之后，当我开始与狼一起工作时，我看到了这一点。当您使用称为频谱图的数学变换以视觉方式表示这些声音时，除了音阶之外，它们看起来几乎相同：海豚哨声更短，音调更高。所以我试着放慢海豚的哨声，瞧，它听起来很像狼嚎。这两种声音是如此不同，但它们具有相似的基本结构。问题是为什么？\n嗯，答案不难找到。在声音被扭曲和吸收的环境中，海豚和狼都使用这些声音进行长距离交流。在这些条件下，使用它们不同的音调是保存消息中信息的有效方法。同样的事情会发生在外星球上吗？我认为这是一个完全合理的提议。假设你的物种足够聪明，想要建造一艘宇宙飞船或射电望远镜——一些复杂的东西。您必须能够将大量想法传达给与您一起工作的许多其他人。如果你打算拥有一个足够灵活的交流系统来交流非常多的概念，它可能会无限灵活，因此它会满足语言的定义。像人类语言这样的交流需要复杂，但又不能太复杂。在所有人类语言以及许多动物交流中都可以找到复杂性和简单性之间的平衡。 SETI 研究最有前途的方向之一是在信号中寻找语言的统计指纹，因为像这样的一些限制似乎可能对无处不在的智能通信起作用。在您的书中，您写道：“好奇心将推动哲学，社交互动将推动艺术，而复杂的交流将推动文学。真的，这些特征几乎不可避免地来自我们，可能还有其他外星物种所拥有的智能技能的结合。”听起来这些假想的外星人几乎是人类。有些行星上只会有简单的生命。许多，甚至可能是大多数。但是让我们假设我们发现了一颗行星，我们称之为智能生命。没有人仅仅因为拥有它是一件很酷的事情而获得智能；他们的祖先一定从这种智慧中受益。如果他们达到了可以建造射电望远镜的阶段，那么他们一定已经经历了好奇有好处，交流有好处的阶段。但哲学、艺术和文学之类的东西给你带来了什么生存优势似乎不太明显。认知心理学家和语言学家史蒂文·平克 (Steven Pinker) 曾著名地辩称，音乐的发展是一种意外，它本身没有生存价值。我们是否有可能找到拥有技术——火箭和望远镜——但没有哲学、艺术和文学的外星人？这当然是可能的。但似乎不太可能。因为我们认为理所当然的所有这些特征——比如好奇心、交流、语言——它们并没有进化到我们可以建造射电望远镜。它们进化来支持我们的社交。我们的祖先早在撰写科学研究论文之前就开始唱歌跳舞讲故事了。这些技能的进化并不是为了离开地球并寻找外星人。他们进化只是因为他们对社会有利。\n人们很容易认为，先进的外星文明可能会放弃——或者可能从来不需要——哲学和文学之类的东西。但它们是从前技术物种进化而来的。如果那个前技术物种继续发展我们现在拥有的所有东西，那么它们很可能是建立在服务于社会目的的基石上的——比如群体成员之间的联系、群体成员之间的信息和有用想法的传输.一个前技术外星文明可以像前技术人类文明一样唱歌跳舞和讲故事，因为它有同样的目的。一些科学家对基于进化趋同的论点持怀疑态度，尤其是在涉及智力等属性时。例如，我们惊叹人类、海豚和章鱼进化出某种程度的智能，但这三种动物在它们彼此分离之前有一个共同的祖先，可以追溯到数亿年前。你会如何回应？让我们考虑人类和章鱼。他们共同的祖先生活在大约 8 亿年前。那是一个小粘液球。所有这些小粘液球的后代几乎是地球上的每一种动物，除了珊瑚和水母之类的东西。地球上几乎所有生物都拥有人类和章鱼的共同祖先。如果他们都拥有共同的祖先，为什么只有少数人是聪明的？答案是这些东西都是独立开发的。智力不是从那个共同祖先那里继承来的。当然，鸟类和蝙蝠有共同的祖先。但并非他们共同祖先的所有后代都会飞。他们中几乎没有人这样做。他们没有翅膀。翅膀独立进化。我们现在拥有的特征依赖于我们共同的祖先，仅仅因为我们有一个共同的祖先，这种想法是不正确的。如你所知，SETI 开始被认为是天文学的一个主流分支，在我们自己的太阳系中，我们正在使用机器人航天器在火星上寻找过去生命的迹象，我们可能很快就会探索土卫二和其他卫星.对于那些积极尝试在地球之外寻找生命——无论是简单生命还是智能生命的人来说，你的研究有哪些关键的收获？我认为到目前为止，这种努力还不是很重要。突然之间，它变得令人难以置信。那是因为我们现在即将接近我们将不得不开始思考外星生命的生物学和生态学是什么样子的阶段。当我们这样做时，我们必须考虑它们的进化轨迹。我给你举个例子。你会记得最近关于金星磷化氢信号的大惊小怪。让我们说它是真实的，它是生活的象征。下一个问题是：生命是如何进化的？假设我们在大气的温带地区有这些漂浮的微生物。他们是怎么到那里的？他们是如何演化出这种复杂性的？我们即将拥有足够灵敏的技术来检测其他行星上的生命。但这并没有告诉我们他们是如何到达那里的。它没有告诉我们任何关于它们的生态，它们如何与地球上的其他生物以及非生物环境相互作用。但最重要的是，它没有告诉我们它们是如何进化的。这就是天体生物学家必须开始思考的问题。", "note_en": "On the website for the department of zoology of the University of Cambridge, the page for  Arik Kershenbaum lists his three main areas of research, one of which stands out from the others. Kershenbaum studies “Wolves &amp; other canids,” “Dolphins &amp; cetaceans” — and “Aliens.” Granted, science hasn’t yet found any aliens to study, but Kershenbaum says that there are certain things we can still say about them with reasonable certainty. Topping the list: They evolved.\n “The bottom line — why animals do the things that they do, why they are the things that they are — is because of evolution,” said Kershenbaum, a lecturer and director of studies in the natural sciences at the university’s Girton College. He argues that evolution is a universal law of nature, like gravity — and that studies of plants and animals here can therefore tell us something useful about potential inhabitants of worlds far beyond Earth. He finds evidence for this in the process of evolutionary convergence, in which unrelated lineages of organisms evolve similar features as adaptations to similar environmental challenges. It’s an argument he presents in detail in his new book,   The Zoologist’s Guide to the Galaxy: What Animals on Earth Reveal About Aliens — and Ourselves, which draws on comparisons of animals’ physical adaptations as well as his own research (and that of others) into animal communications.\n Quanta recently spoke with Kershenbaum at his home in Cambridge via videoconference. The interview has been condensed and edited for clarity.\n You’re a zoologist; you study life here on our own planet. What made you want to write a book about alien life?\n When zoologists study life on Earth, we’re studying mechanisms. We’re studying how life became the way it is. And because evolution is the explanatory mechanism for life everywhere, then the principles that we uncover on Earth should be applicable in the rest of the universe. Thinking about how life on other planets evolves and behaves is just a natural extension of my work with animals on Earth. If we discovered a lost island on this planet, we’d be examining its animals from the perspective of what we know about the evolution of life in general. You can be sure that if we discovered alien life on another planet, we’d be using the same methods to ask why they look and behave the way they do, and how they evolved.\n  You argue that natural selection — the key mechanism behind evolution — is inevitable, and that it applies universally. What makes you so confident about that?\n No planet will have a complex form of life that popped into existence all on its own. Whatever life is like on an alien planet, it must have begun simply. Now, it could be that it remained simple; that’s possible. Probable, even, on many planets. But if life is to achieve any kind of complexity, the only way that complexity can accumulate is if favorable changes and innovations are retained and unfavorable ones are lost — and that’s precisely evolution by natural selection.\n One of the key ideas in your book is the notion of “convergent evolution.” What is that, and why is it important?\n If you observe two animals with similar features — feathers, for instance — you might presume that they inherited them from a common ancestor: the feathered dinosaur that was the ancestor of all modern birds. That’s just regular evolution, where children have similarities because they inherit the characteristics of their parents.\n But sometimes you see animals with traits that they couldn’t possibly have inherited from a common ancestor. For instance, the wings of birds work in pretty much the same way as the wings of bats. But the common ancestor of birds and bats was a small lizardlike creature that lived over 300 million years ago, long before even the dinosaurs. It certainly didn’t have wings, and the large majority of its descendants, including elephants and crocodiles, don’t have wings (thankfully). So those wings must have evolved separately in different lines of descendants.\n Sometimes this “convergence” of traits is for something obviously useful, like wings. But sometimes convergence produces bizarrely similar creatures that share so many characteristics, it can be hard to believe they’re not closely related. The recently extinct thylacine [a large predatory marsupial native to Tasmania and mainland Australia], for example, could easily be mistaken for a peculiar breed of dog, but it’s much more closely related to a kangaroo! And yet living a life similar to that of modern coyotes or jackals meant that it evolved many similar characteristics convergently.\n  You’re arguing that wherever organisms confront similar environmental challenges, they may come up with similar adaptive solutions. And you expect to see this throughout the universe?\n Consider flight, since that’s the most famous example of convergence. If you live on a planet with an atmosphere, or even with an ocean or some other fluid, if you want to get from one place to another through that fluid, there’s only a handful of ways to do it. You can jump. You can float, if you’re lighter than the medium that you’re in. The only other way is aerodynamically, with a wing, to generate lift. Those are the mechanics of moving through a fluid medium.\n On Earth, flight evolved four different times in four different groups: in birds and bats and pterosaurs and insects. The fact that they all use wings isn’t because they evolved on Earth; it’s because it was advantageous to fly, and wings are just about the only way to fly. And so we can expect these constraints to be operating everywhere in the universe.\n How far can that insight take us, though? As you said, organisms anywhere that need to fly are likely to evolve wings. But the wings of bumblebees, bluebirds and bats are very different.\n Yes, bat wings and bee wings are different, but only in detail, not in principle. Both consist of a membrane supported by rigid structures. Both generate lift by creating airflow over that membrane. In fact, the main difference between bee wings and bat wings is not in their structure, it’s in the way they use them. The small size of insects means that they cannot simply flap their wings like bats and expect to fly. They need to buzz, generating lift both on the forward stroke of their wings and on the backward stroke — something that neither birds nor bats do.\n So rather than the diversity of implementations on our planet confounding our comparisons, we can actually be more confident about our predictions, because we can see how tightly constrained these solutions really are. Yes, birds, bats and bees have different wings, but they’ve all achieved the same end result — an aerodynamic wing — despite the hugely different physical constraints acting on them.\n Coincidences of evolutionary (and even cosmic) history will always affect the details of animal shape and appearance. We have four limbs only because it was a four-finned fish that crawled out of the sea almost 400 million years ago. We could easily have had six limbs, or even eight, if evolutionary history had played out differently. So there will never really be close similarity between us and our equivalent species on an alien planet. But some things are just so tightly constrained that there aren’t really many alternative ways to do things.\n Stephen Jay Gould, the noted paleontologist and evolutionary theorist, famously wrote about the idea of “ replaying the tape of life” and letting life evolve over again. Gould imagined that the outcomes would be different; we would be unlikely to end up with Homo sapiens, for example. But it sounds like you’re arguing that, while any one specific outcome is unlikely, the same kinds of innovations would crop up again and again?\n That’s absolutely right. There’s this big argument between Stephen Jay Gould and  Simon Conway Morris [of Cambridge]: Is it going to be different every time you replay the tape? Is it going to be the same every time? But obviously, the correct answer is: It will be different, but many things will be the same. And the things that will be the same are those things that are constrained either by the laws of physics or by the laws of evolution.\n There are mathematical rules that govern the way evolution works. One of the things I talk about [in the book] is sociality. Sociality evolves because of the particular characteristics of evolution, not because of physics. Those sorts of things are constraints too. They will continue to be constraints no matter how often you replay the tape of life.\n  What kinds of constraints or pressures drive sociality on Earth, and how might we expect them to apply elsewhere?\n Cooperation and communication are very widespread on Earth. At first glance, that’s perplexing: Why would two organisms cooperate? But you don’t have to think about it for very long to realize that they’ll cooperate if they both benefit from it.\n And that rule will apply on any planet. It could be that animals on other planets will cooperate simply for mutualistic reasons, because it benefits them both. But much of the cooperation on Earth, much of the sociality, is driven by relatedness. We cooperate because we’re related. We feed our children, we help our parents, we befriend our siblings. All of these things are well founded in evolutionary theory. The way our characteristics, our traits, our behaviors are passed down from generation to generation is through our genes. And if our genes make us tend to cooperate with our siblings, then we’ll be more successful, and so will they, and we’ll all pass on our related genes.\n The trouble is, we don’t know what aliens have for genes. So this is something we can’t say is quite as universal as some of the other constraints of biology on Earth. It may be that the way that alien life forms are related to each other is completely different, and so their sociality may be completely different as well.\n Much of your personal research has been on animal communication — in wolves, dolphins and other animals. How did your work in that area inform your thinking? Are there universal features of animal communication on Earth that would apply to understanding alien communications, intelligent or otherwise?\n Sometimes, common features in very different animals just jump up and hit you in the face. They’re hiding under the surface, but when you see them, it’s just so obvious. I saw this when I started working with wolves, after previously studying dolphin whistles.\n When you represent those sounds visually, using a mathematical transformation called a spectrogram, they look almost identical, apart from the scale: Dolphin whistles are much shorter and higher pitched. So I tried slowing down a dolphin whistle, and lo and behold, it sounded rather like a wolf howl. These two sounds are so different, but they have a similar underlying structure. The question is why?\n Well, the answer isn’t hard to find. Both dolphins and wolves use these sounds for long-range communication in an environment where sounds get distorted and absorbed. Using their kind of varying pitch is the effective way to preserve the information in the message under those conditions. Would the same thing happen on an alien planet? I think that’s a perfectly reasonable proposal.\n  Let’s say your species is intelligent enough to want to build a spaceship, or a radio telescope — something complicated. You will have to be able to communicate a very large number of ideas to a lot of other individuals working on it with you. And if you’re going to have a communication system that’s flexible enough to communicate a very large number of concepts, it will probably be infinitely flexible, and therefore it will meet the definition of language.\n Communication like human language needs to be complex, but not too complex. That balance between complexity and simplicity is found in all human languages, and in a lot of animal communication as well. One of the most promising directions for SETI   research is to look for statistical fingerprints of language in a signal, because it seems likely that some constraints like these operate on intelligent communication everywhere.\n  In your book, you write: “Curiosity will drive philosophy, social interaction will drive art, and complex communication will drive literature. Really, these traits arise almost inevitably from the combination of intelligent skills that we, and presumably other alien species, possess.” It’s beginning to sound like these hypothetical aliens are almost human.\n Some planets are just going to have simple life on them. Many, maybe even most. But let’s assume that we found a planet with something we would call intelligent life. No one gets intelligence just because it would be a cool thing to have; their ancestors must have benefited from that intelligence. If they reached the stage where they can build a radio telescope, then they must have been through the stages where it was advantageous to be curious, where it was advantageous to communicate.\n But it seems less obvious what survival advantage things like philosophy and art and literature give you. The cognitive psychologist and linguist  Steven Pinker has famously argued that  music developed as a kind of accident, that it doesn’t have survival value on its own. Is it possible that we’d find aliens who have the technological stuff — the rockets and the telescopes — but not the philosophy and art and literature?\n It certainly is possible. But it doesn’t seem likely. Because all of these traits that we take for granted — things like curiosity, communication, language — they didn’t evolve so that we could build a radio telescope. They evolved to support our sociality. Our ancestors were singing and dancing and telling stories long before they were writing scientific research papers. Those skills didn’t evolve for the purpose of leaving planet Earth and finding aliens. They evolved only because they were advantageous to the society.\n It’s tempting to think that an advanced alien civilization may just dispense with — or may have never needed — things like philosophy and literature. But they evolved from a pre-technological species. And if that pre-technological species went on to develop all the things that we have now, chances are that they were built on building blocks that served that social purpose — things like bonding between group members, transmission of information and useful ideas between group members. A pre-technological alien civilization could be singing and dancing and telling stories just like pre-technological human civilization did, because it serves the same purpose.\n Some scientists are skeptical of arguments based on evolutionary convergence, especially where  attributes like intelligence are concerned. We marvel that humans, dolphins and octopuses evolved some degree of intelligence, for example, but the three animals have a common ancestry that goes back hundreds of millions of years before they split off from one another. How might you respond to that?\n Let’s consider humans and octopuses. Their common ancestor lived around 800 million years ago. It was a little slime ball. And the descendants of all of those little slime balls are just about every single animal on Earth, with the exception of corals and jellyfish and things like that. The common ancestry of humans and octopuses is shared by almost every creature on the planet. Why are only a few of them intelligent, if they all share that common ancestry?\n The answer is that these things developed independently. Intelligence is not inherited from that common ancestor. Birds and bats share a common ancestor, sure. But not all of the descendants of their common ancestor fly. Hardly any of them do. They didn’t have wings. Wings evolved independently. The idea that the traits we have now are dependent on our common ancestors, just because we have a common ancestor, is not correct.\n As you know, SETI is beginning to be recognized as a mainstream branch of astronomy, and here in our own solar system we’re using robotic spacecraft to search for signs of past life on Mars, and we may soon be exploring Enceladus and other moons. What are some of the key takeaways from your research, for those who are actively trying to find life — either simple life or intelligent life — beyond Earth?\n  I think that up until now, that effort hasn’t been very relevant. All of a sudden, it’s become unbelievably relevant. That’s because we’re now just about approaching the stage where we’re going to have to start to think about what the biology and ecology of alien life is like. And the moment we do that, we have to think about their evolutionary trajectories.\n I’ll give you an example. You’ll remember the recent fuss about the signal of  phosphine on Venus. Let’s say it’s real, and that it’s indicative of life. The next question is: How did that life evolve? Let’s assume we have these floating microscopic organisms in the temperate region of the atmosphere. How did they get there? How did they evolve that complexity? We’re coming to the point where we have sufficiently sensitive technology to  detect life on other planets. But that doesn’t tell us how they got there. It doesn’t tell us anything about their ecology, how they interact with the other organisms on the planet, with the abiotic environment. But most importantly, it doesn’t tell us how they evolved. And that’s the question that astrobiologists have to start thinking about.", "posttime": "2021-08-03 00:26:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生命,life,进化", "title": "为什么外星生命可能看起来并不陌生", "title_en": "Why extraterrestrial life may not seem alien", "transed": 1, "url": "https://www.quantamagazine.org/arik-kershenbaum-on-why-alien-life-may-be-like-life-on-earth-20210318/", "via": "", "real_tags": ["生命", "life", "进化"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071201, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一旦您开始使用 Varnish 源代码，您会注意到 Varnish 不是您的工厂应用程序的平均运行。我在 FreeBSD 内核上工作了很多年，我很少涉足用户态编程，但是当我有机会这样做时，我总是发现人们编程就像 1975 年一样。所以当我接触到 Varnish 项目时，我是直到我意识到这将是一个很好的机会来尝试充分利用我对硬件和内核如何工作的一些知识时才真正感兴趣，现在我们已经达到了 alpha 阶段，我可以说我真的很喜欢它。真正简短的回答是计算机不再有两种存储方式。曾经是你拥有主要存储，它是任何东西，从充满水银的声学延迟线到小型磁性甜甜圈，再到晶体管触发器，再到动态 RAM。然后是二级商店，纸带，磁带，房子大小的磁盘驱动器，然后是洗衣机的大小，现在小到女孩们如果认为她们拥有的不是你口袋里的 MP3 播放器的东西，就会感到失望.它们在“内存”中有变量，并将数据移入和移出“磁盘”。\n以 Squid 为例，如果我见过一个 1975 年的程序：你告诉它它可以使用多少 RAM 以及它可以使用多少磁盘。然后它将花费过多的时间来跟踪哪些 HTTP 对象在 RAM 中以及哪些在磁盘上，并且它将根据流量模式来回移动它们。好吧，今天的计算机实际上只有一种存储，通常是某种磁盘，操作系统和虚拟内存管理硬件已将 RAM 转换为磁盘存储的缓存。因此，squid 精心设计的内存管理会发生什么，它会与内核精心设计的内存管理发生冲突，就像任何内战一样，它永远不会完成任何事情。发生的事情是这样的：squid 在“RAM”中创建了一个 HTTP 对象，并在创建后迅速使用了几次。然后一段时间后它不再有点击并且内核会注意到这一点。然后有人试图从内核中获取内存用于某些东西，内核决定将那些未使用的内存页面推出以交换空间，并更明智地将（缓存 RAM）用于某些程序实际使用的数据。然而，这是在squid 不知道的情况下完成的。squid 仍然认为这些http 对象在RAM 中，并且它们将在它尝试访问它们的那一秒中存在，但在那之前，RAM 用于一些有生产力的事情。如果squid什么都不做，一切都会好起来的，但这就是1975年的编程开始的地方。一段时间后，squid也会注意到这些对象没有被使用，它决定将它们移动到磁盘，以便RAM可以用于更繁忙的数据.所以squid 出去，创建一个文件，然后将http 对象写入文件。这里我们切换到高速摄像头：squid 调用 write(2)，我给出的地址是“虚拟地址”，内核将其标记为“不在家”。\n因此，CPU 硬件分页单元将引发陷阱，一种对操作系统的中断，告诉它“请修复内存”。内核试图找到一个空闲页面，如果没有，它会从某处获取一些使用过的页面，可能是另一个使用过的小对象，当写入完成时将其写入磁盘上的分页轮询空间（“交换区”） ，它将从分页池的另一个地方读取它“调出”到现在未使用的RAM页中的数据，修复分页表，并重试失败的指令。所以现在squid在RAM中的一个页面中拥有对象并写入磁盘的两个位置：操作系统分页空间中的一个副本和文件系统中的一个副本。 Squid 现在将此 RAM 用于其他用途，但一段时间后，HTTP 对象受到攻击，因此 squid 需要将其取回。首先squid 需要一些RAM，因此它可能决定将另一个HTTP 对象推送到磁盘（重复上述操作），然后将文件系统文件读回RAM，然后在网络连接套接字上发送数据。 Varnish 分配一些虚拟内存，它告诉操作系统用磁盘文件中的空间来备份该内存。当它需要将对象发送给客户端时，它只是引用那块虚拟内存，而将其余部分留给内核。如果/当内核决定它需要将 RAM 用于其他用途时，页面将被写入后备文件，并且 RAM 页面将在其他地方重用。\n当 Varnish 下次引用虚拟内存时，操作系统会找到一个 RAM 页，可能会释放一个，并从备份文件中读取内容。就是这样。 Varnish 并没有真正尝试控制什么是缓存内存，什么不是，内核有代码和硬件支持来做好这方面的工作，而且它做得很好。 Varnish 在磁盘上也只有一个文件，而 squid putsone 对象在它自己的单独文件中。 HTTP 对象不需要作为文件系统对象，所以没有必要在文件系统命名空间（目录、文件名和所有这些）中为每个对象浪费时间，我们在 Varnish 中需要的只是一个指向虚拟内存的指针和一个长度，内核剩下的。当数据大于物理内存时，虚拟内存旨在使编程更容易，但人们仍然没有接受。但是周围有更多的缓存，硅黑手党更多或更少地停滞在 4GHz 的 CPU 时钟上，为了达到那个程度，他们不得不在 CPU 和 RAM 之间放置 1、2 甚至 3 级缓存（这是 4 级缓存），还涉及写入缓冲区、管道和页面模式提取等内容，所有这些都是为了降低从内存中获取内容的速度。由于它们已经达到了 4GHz 的极限，但是不断减小的硅特征尺寸使它们可以使用越来越多的晶体管，因此多 CPU 设计已经成为世界的幻想，尽管它们作为一种编程模型很糟糕。多 CPU 系统并不是什么新鲜事，但是编写一次使用多个 CPU 的程序一直很棘手，现在仍然如此。\n为此，它读取 n_foo，然后将 n_foo 写回。它可能会也可能不会涉及到 CPU 寄存器的加载，但这并不重要。读取内存位置意味着检查我们是否在 CPU 级别 1 缓存中。除非经常使用，否则不太可能。接下来检查二级缓存，让我们假设它也有问题。如果这是一个单 CPU 系统，游戏到此结束，我们从 RAM 中取出它并继续。在多 CPU 系统上，无论 CPU 是共享套接字还是拥有自己的套接字都没有关系，我们首先必须检查其他 CPU 中是否有任何其他 CPU 的缓存中存储了 n_foo 的修改副本，因此特殊的总线事务会发生找出这一点，如果某些 cpu 返回并说“是的，我有它”，则 cpu 可以将其写入 RAM。在良好的硬件设计中，我们的 CPU 将在写入操作期间监听总线，在糟糕的设计中，它必须在之后进行内存读取。现在 CPU 可以增加 n_foo 的值，并将其写回。但它不太可能直接回到内存，我们可能很快又需要它，所以修改后的值会存储在我们自己的 L1 缓存中，然后在某个时候，它会最终在 RAM 中。现在想象另一个 CPU 同时想要 n_bar+++，它可以做到吗？不。缓存不是在字节上运行，而是在一些“行大小”的字节上运行，通常每行从 8 到 128 个字节。因此，由于第一个 CPU 忙于处理 n_foo，第二个 CPU 将尝试获取相同的缓存行，所以它必须等待，即使它是一个不同的变量。当我们需要处理 HTTP 请求或响应时，我们有一个指针数组和一个工作区。我们不会为每个标头调用 malloc(3)。我们为整个工作区调用一次，然后从那里为标题选择空间。这样做的好处是我们通常一次性释放整个标题，我们可以简单地通过重置指向工作区开头的指针来做到这一点。\n当我们需要将 HTTP 标头从一个请求复制到另一个（或从响应到另一个）时，我们不复制字符串，我们只是复制指向它的指针。如果我们不更改或释放源头，这是完全安全的，一个很好的例子是从客户端请求复制到我们将发送到后端的请求。当新头的生命周期比源头的生命周期长时，我们必须复制它。例如，当我们将标头存储在缓存对象中时。但是在这种情况下，我们在工作区中构建新头，一旦我们知道它将有多大，我们就执行单个 malloc(3) 来获取空间，然后我们将整个头放在该空间中。工作线程以“最近最忙”的方式使用，当工作线程空闲时，它会进入最有可能获得下一个请求的队列的前面，以便它已经缓存的所有内存、堆栈空间、变量等，可以在缓存中重用，而不是从 RAM 中进行昂贵的提取。我们还为每个工作线程提供了一组可能需要的私有变量，所有这些变量都分配在线程的堆栈上。这样我们就可以确定它们在 RAM 中占据了一个页面，只要该线程在自己的 CPU 上运行，其他 CPU 都不会考虑接触该页面。这样他们就不会因为缓存线而争吵。如果所有这些对你来说听起来很陌生，让我向你保证它是有效的：我们花费不到 18 个系统调用来处理缓存命中，甚至其中许多都是调用 tog get timestamps for statistics。这些技术也不是什么新鲜事，我们已经在内核中使用它们十多年了，现在轮到你学习它们了 :-)", "note_en": "Once you start working with the Varnish source code, you will noticethat Varnish is not your average run of the mill application.\n  I have spent many years working on the FreeBSD kernel, and onlyrarely did I venture into userland programming, but when I hadoccation to do so, I invariably found that people programmed likeit was still 1975.\n So when I was approached about the Varnish project I wasn’t reallyinterested until I realized that this would be a good opportunityto try to put some of all my knowledge of how hardware and kernelswork to good use, and now that we have reached alpha stage, I cansay I have really enjoyed it.\n The really short answer is that computers do not have two kinds ofstorage any more.\n It used to be that you had the primary store, and it was anythingfrom acoustic delaylines filled with mercury via small magneticdougnuts via transistor flip-flops to dynamic RAM.\n And then there were the secondary store, paper tape, magnetic tape,disk drives the size of houses, then the size of washing machinesand these days so small that girls get disappointed if think theygot hold of something else than the MP3 player you had in yourpocket.\n  They have variables in “memory” and move data to and from “disk”.\n Take Squid for instance, a 1975 program if I ever saw one: You tellit how much RAM it can use and how much disk it can use. It willthen spend inordinate amounts of time keeping track of what HTTPobjects are in RAM and which are on disk and it will move them forthand back depending on traffic patterns.\n Well, today computers really only have one kind of storage, and itis usually some sort of disk, the operating system and the virtualmemory management hardware has converted the RAM to a cache for thedisk storage.\n So what happens with squids elaborate memory management is that itgets into fights with the kernels elaborate memory management, andlike any civil war, that never gets anything done.\n What happens is this: Squid creates a HTTP object in “RAM” and itgets used some times rapidly after creation. Then after some timeit get no more hits and the kernel notices this. Then somebody triesto get memory from the kernel for something and the kernel decidesto push those unused pages of memory out to swap space and use the(cache-RAM) more sensibly for some data which is actually used bya program. This however, is done without squid knowing about it.Squid still thinks that these http objects are in RAM, and theywill be, the very second it tries to access them, but until then,the RAM is used for something productive.\n  If squid did nothing else, things would be fine, but this is wherethe 1975 programming kicks in.\n After some time, squid will also notice that these objects areunused, and it decides to move them to disk so the RAM can be usedfor more busy data. So squid goes out, creates a file and then itwrites the http objects to the file.\n Here we switch to the high-speed camera: Squid calls write(2), theaddress i gives is a “virtual address” and the kernel has it markedas “not at home”.\n So the CPU hardwares paging unit will raise a trap, a sort ofinterrupt to the operating system telling it “fix the memory please”.\n The kernel tries to find a free page, if there are none, it willtake a little used page from somewhere, likely another little usedsquid object, write it to the paging poll space on the disk (the“swap area”) when that write completes, it will read from anotherplace in the paging pool the data it “paged out” into the now unusedRAM page, fix up the paging tables, and retry the instruction whichfailed.\n  So now squid has the object in a page in RAM and written to thedisk two places: one copy in the operating systems paging space andone copy in the filesystem.\n Squid now uses this RAM for something else but after some time, theHTTP object gets a hit, so squid needs it back.\n First squid needs some RAM, so it may decide to push another HTTPobject out to disk (repeat above), then it reads the filesystemfile back into RAM, and then it sends the data on the networkconnections socket.\n   Varnish allocate some virtual memory, it tells the operating systemto back this memory with space from a disk file. When it needs tosend the object to a client, it simply refers to that piece ofvirtual memory and leaves the rest to the kernel.\n If/when the kernel decides it needs to use RAM for something else,the page will get written to the backing file and the RAM pagereused elsewhere.\n When Varnish next time refers to the virtual memory, the operatingsystem will find a RAM page, possibly freeing one, and read thecontents in from the backing file.\n And that’s it. Varnish doesn’t really try to control what is cachedin RAM and what is not, the kernel has code and hardware supportto do a good job at that, and it does a good job.\n Varnish also only has a single file on the disk whereas squid putsone object in its own separate file. The HTTP objects are not neededas filesystem objects, so there is no point in wasting time in thefilesystem name space (directories, filenames and all that) foreach object, all we need to have in Varnish is a pointer into virtualmemory and a length, the kernel does the rest.\n Virtual memory was meant to make it easier to program when data waslarger than the physical memory, but people have still not caughton.\n But there are more caches around, the silicon mafia has more orless stalled at 4GHz CPU clock and to get even that far they havehad to put level 1, 2 and sometimes 3 caches between the CPU andthe RAM (which is the level 4 cache), there are also things likewrite buffers, pipeline and page-mode fetches involved, all to makeit a tad less slow to pick up something from memory.\n And since they have hit the 4GHz limit, but decreasing siliconfeature sizes give them more and more transistors to work with,multi-cpu designs have become the fancy of the world, despite thefact that they suck as a programming model.\n Multi-CPU systems is nothing new, but writing programs that usemore than one CPU at a time has always been tricky and it still is.\n     To do that, it read n_foo and then write n_foo back. It may or maynot involve a load into a CPU register, but that is not important.\n To read a memory location means to check if we have it in the CPUslevel 1 cache. It is unlikely to be unless it is very frequentlyused. Next check the level two cache, and let us assume that is amiss as well.\n If this is a single CPU system, the game ends here, we pick it outof RAM and move on.\n On a Multi-CPU system, and it doesn’t matter if the CPUs share asocket or have their own, we first have to check if any of the otherCPUs have a modified copy of n_foo stored in their caches, so aspecial bus-transaction goes out to find this out, if if some cpucomes back and says “yeah, I have it” that cpu gets to write it toRAM. On good hardware designs, our CPU will listen in on the busduring that write operation, on bad designs it will have to do amemory read afterwards.\n Now the CPU can increment the value of n_foo, and write it back.But it is unlikely to go directly back to memory, we might need itagain quickly, so the modified value gets stored in our own L1 cacheand then at some point, it will end up in RAM.\n Now imagine that another CPU wants to n_bar+++ at the same time,can it do that ? No. Caches operate not on bytes but on some“linesize” of bytes, typically from 8 to 128 bytes in each line.So since the first cpu was busy dealing with n_foo, the second CPUwill be trying to grab the same cache-line, so it will have to wait,even through it is a different variable.\n When we need to handle a HTTP request or response, we have an arrayof pointers and a workspace. We do not call malloc(3) for eachheader. We call it once for the entire workspace and then we pickspace for the headers from there. The nice thing about this is thatwe usually free the entire header in one go and we can do thatsimply by resetting a pointer to the start of the workspace.\n When we need to copy a HTTP header from one request to another (orfrom a response to another) we don’t copy the string, we just copythe pointer to it. Provided we do not change or free the sourceheaders, this is perfectly safe, a good example is copying from theclient request to the request we will send to the backend.\n When the new header has a longer lifetime than the source, then wehave to copy it. For instance when we store headers in a cachedobject. But in that case we build the new header in a workspace,and once we know how big it will be, we do a single malloc(3) toget the space and then we put the entire header in that space.\n  The worker threads are used in “most recently busy” fashion, whena workerthread becomes free it goes to the front of the queue whereit is most likely to get the next request, so that all the memoryit already has cached, stack space, variables etc, can be reusedwhile in the cache, instead of having the expensive fetches fromRAM.\n We also give each worker thread a private set of variables it islikely to need, all allocated on the stack of the thread. That waywe are certain that they occupy a page in RAM which none of theother CPUs will ever think about touching as long as this threadruns on its own CPU. That way they will not fight about the cachelines.\n If all this sounds foreign to you, let me just assure you that itworks: we spend less than 18 system calls on serving a cache hit,and even many of those are calls tog get timestamps for statistics.\n These techniques are also nothing new, we have used them in thekernel for more than a decade, now it’s your turn to learn them :-)", "posttime": "2021-08-03 00:25:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建筑,建筑师,notes,cpu", "title": "清漆：建筑师的笔记", "title_en": "Varnish: Notes from the Architect", "transed": 1, "url": "http://varnish-cache.org/docs/trunk/phk/notes.html", "via": "", "real_tags": ["建筑", "建筑师", "notes", "cpu"]}, {"category": "", "categoryclass": "", "imagename": "0d2d274e03f7e130e95423ff60436554.jpg", "infoid": 1071200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "互动 每年，全球经济、贸易政策、并购以及其中的企业动荡等一系列因素都会在全球 500 强排名中推波助澜。为了帮助您快速了解每个国家/地区在列表中的代表情况，我们将全球 500 强放在了世界地图上。现在您可以一目了然地看到每个公司的位置、收入和利润。我们还邀请您了解每家全球 500 强公司在过去二十年中的排名变化。", "note_en": "Interactive  Each year a whole host of factors—the global economy, trade policies, mergers and acquisitions, and corporate upheaval among them—push and pull at the Global 500 rankings. To help you quickly see how each country is represented on the list, we put the Global 500 on a world map. Now you can see each company&#39;s location, revenue and profit at a glance. We also invite you to take a look at how each Global 500 company has moved around in the ranks over the past two decades.", "posttime": "2021-08-03 00:25:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "财富,fortune,全球", "title": "财富全球 500 强 2021 版", "title_en": "Fortune Global 500 2021 Edition", "transed": 1, "url": "https://fortune.com/global500/", "via": "", "real_tags": ["财富", "fortune", "全球"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在没有专用导入器的情况下将您的相机参数输入到应用程序中是可能的，并且涉及将 fSpy 参数值一一复制并将它们粘贴到目标应用程序中。以下是该过程的概述：", "note_en": "Getting your camera parameters into an applications without a dedicated importer is likely possible and involves copying the fSpy parameter values one by one and pasting them into the target application. Here&#39;s an outline of the process:", "posttime": "2021-08-03 00:25:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "相机,开源,open,涉及", "title": "fSpy：开源静止图像相机匹配", "title_en": "fSpy: Open-source still image camera matching", "transed": 1, "url": "https://fspy.io/", "via": "", "real_tags": ["相机", "开源", "open", "涉及"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "背景说明：我大约在一年前（2020 年 9 月）开始写这篇文章，但我在某个时候放弃了它。它的最终版本远没有我最初的计划那么雄心勃勃，主要是因为我忘记了当时想到的一些事情。不过，总比没有好。很久以前（在 2011 年），我写了一篇关于我对 Linux 的挫败感，这导致我在花了很多时间之后放弃了该操作系统。在这篇文章之后，我尝试转换到 Windows 失败了，最终我选择了 macOS 近十年。虽然大部分时间我对 macOS 感到相当满意，但它从来没有像家一样的感觉，我一直渴望重温 Linux。我也有一段时间想念拥有一台定制的台式电脑，所以我很想得到一台并在其上运行 Linux。由于各种原因（例如很多与工作有关的旅行和过度的懒惰），我从来没有这样做过。到现在。 2020 年在许多层面上都是可怕的一年，但它为我提供了一个独特的机会来贯彻我的 Linux PC 计划，因为我终于在家中接地并有一些额外的时间。在本文中，我将分享我重新审视 Linux 并重新发现控制操作系统和硬件的乐趣的经验。 macOS 在软件开发中的衰落 我不会在这里详细介绍，因为我希望每个人都注意到 macOS 的转变更像 iOS。这对大多数用户来说是好事，但对软件工程师来说却不是。大约 15 年前，Apple 曾经花费大量时间来吸引开发人员使用他们的操作系统，但现在他们似乎只关心 macOS 和 iOS 开发人员。他们很少更新 macOS 附带的 Unix 工具，他们仍然没有创建包管理器（每个人基本上都在使用自制软件）等等。在这一点上，我很清楚 macOS 并不意味着成为修补匠的操作系统，而是对于消费者。这不是一件坏事，它只是不适合我。从更实际的角度来说，以下是近年来困扰我 macOS 的一些事情： 积极推动 App Store 的使用，这限制了应用程序的功能。操作系统极力劝阻您不要使用任何外部采购的应用程序。将一些应用程序和奇怪的功能从 iOS 带到 macOS（有没有人使用过启动板？）。每次 macOS 升级后都需要重新安装 XCode。几乎每个主要的操作系统升级都会破坏 Homebrew 或我使用的一些工具（例如 Karabiner，一个键盘重新映射实用程序）。 macOS 默认随 Emacs 22 一起提供。这不是一个错字。如上所述，macOS 附带了许多过时的 Unix 工具。掩盖一些问题的廉价技巧，例如隐藏剩余电池寿命估计。我可以继续，但我会在这一点上停下来。我希望你能明白。新硬件 这是我在 2020 年 7 月上旬获得的硬件（我花了将近 3 个月的时间来解决所有部件的问题）： CPU AMD RYZEN 7 3700X GPU ASUS DUAL Radeon RX 5500 XT EVO OC 8G 主板 AORUS X570 ULTRA SSD 960GB M .2 2280 Corsair Force 系列 MP510 RAM 32GB (2x16GB) DDR4 3200MHz Corsair Vengeance LPX 机箱分形设计定义 7 PSU 分形设计 Ion+ 660W Platinum 如您所见，它没有什么特别之处。我想建立一个像样的工作站，而不是游戏装备。尽管如此，我还是选择了一个不错的独立 GPU，因为我希望最终能玩一些 PC 游戏（星际争霸 II、古墓丽影、暗黑破坏神 III 等）。我选择 Radeon 主要是因为 AMD（据说很棒）的 Linux 开源 GPU 驱动程序。事后看来，这是一个很大的错误，但我稍后会扩展这个主题。注意：我知道内置 GPU 的 Intel CPU 是驱动程序支持方面最安全的选择，但我真的想要 Ryzen CPU 和相当强大的谨慎 GPU。我不得不说，这款 1,600 欧元的台式机完全以我更昂贵的 MacBook Pro 的方式出水。当然，台式机总是比大多数笔记本电脑提供更好的价值/性能，但近年来我们都完全沉迷于笔记本电脑/平板电脑。虽然便携性绝对是台式机的一个问题，但它们也有一些很酷的优点，例如： 它们不会过热 它们不会耗尽果汁 您实际上可以修复/升级它们 它们迫使您在办公桌上工作（意味着人体工程学通常是更好）结束这个关于更复杂时代的古代技术优点的轻微抒情绕道。发行版 我决定谨慎行事，我选择了 Ubuntu 20.04，这是当时的最新版本。过去我更喜欢 Arch Linux 和 Fedora，但我想尽量减少设置工作。当我年轻的时候，我喜欢花很多时间来调整我的设置的各个方面（例如构建自定义内核、调整我的包的编译标志、从第三方存储库获取专有驱动程序等），但现在我年纪大了，更懒，更实用。我仍然很喜欢修改我的设置，但我不想被迫修改（Gentoo 方式）。我观察到的一个普遍趋势是 Linux 发行版现在比以前更复杂。在 System V init 的日子里，生活似乎相当美好和简单，但今天 systemd 主宰了一切并使其更难以理解。至少对于像我这样完全错过向 systemd 过渡的人来说是这样。 systemd 是一个软件套件，可为 Linux 操作系统提供一系列系统组件。它的主要目标是统一跨 Linux 发行版的服务配置和行为； systemd 的主要组件是“系统和服务管理器”——一个用于引导用户空间和管理用户进程的初始化系统。它还提供各种守护程序和实用程序的替代品，包括设备管理、登录管理、网络连接管理和事件记录。单一职责原则到此为止。驱动程序一切都开箱即用，但不幸的是，并非一切都运行良好。我的 wi-fi 出现了一些间歇性问题，由于 GPU 驱动程序的一些问题，X.org 不断崩溃。快速的谷歌搜索显示，我并不是唯一面临这些 GPU 问题的人。无论我尝试什么（我尝试了很多东西——更新的内核、Mesa、我在这里和那里找到的随机补丁等等）我都无法解决 GPU 问题，我的计算机每天都会崩溃 1-2 次。可以想象，这非常令人沮丧。有趣的是，每次更改后，崩溃会变得更频繁或更不频繁。但是，永远不会完全消失。 wi-fi 问题更容易解决——我只是切换到以太网，从来没有费心去调查。过去，我也一直在努力让我的打印机正常工作，但我不再拥有打印机，所以这是自行解决的问题之一。硬件支持是我十年前离开 Linux 的主要原因，遗憾的是那里的情况并没有太大改善。也许 Nvidia GPU 的情况会更好，但我希望避免使用专有驱动程序。 1 应用程序在过去 10 年中几乎没有变化，更不用说我不使用那么多应用程序——主要是浏览器（Chrome 和Firefox)、Emacs 和一个终端 (Guake)。简而言之 - 一切都比我记忆中的要好，但没有什么是美妙的。 GNOME 及其应用程序（例如 Nautilus）仍然有很多粗糙的地方，但它们已经完成了工作。 Albert 是 Alfred（我最喜欢的 macOS 工具之一）的绝佳替代品。这可能是我这次使用的唯一新应用程序。我工作所需的一些专有应用程序（如 Zoom、Slack 和 Dropbox）不工作/看起来很棒（尤其是与它们的 macOS/Windows 版本相比时），但这无论如何都是我所期望的。尽管如此，他们的工作比我记忆中的要好。鉴于桌面 Linux 的市场份额很小，我从没想过大公司会开始大量投资于 Linux 支持。我记得 5 年前，Zoom 在 Linux 上不断崩溃（使用 Linux 的同事经常退出 Zoom 调用，这就是我所知道的），但至少它对我来说是可靠的。回到那天我抱怨 Linux 版 Skype 有多糟糕，但幸运的是我不再需要使用 Skype，所以这个问题自己解决了。我还抱怨 OpenOffice 的质量——另一个我不再需要的应用程序，因为我最近主要使用 Google Docs。一般来说，从原生桌面应用程序转向基于 Web 的应用程序的趋势对于 Linux 用户来说绝对是一个好处。在某些情况下，我实际上更喜欢具有 Linux 桌面版本的应用程序的网络版本，因为它们对我来说似乎更好用（例如 Slack 和 Spotify）。如果您碰巧需要，Skype 现在也有一个不错的网络应用程序。还有一件事——我很高兴看到 Steam 中有很多游戏（按照 Linux 标准），尽管 Valve 的 Steam Machine 项目（运行 Linux 的游戏机）失败了。我尝试了几个较旧的游戏，它们运行良好，除了由于 GPU 驱动程序问题而导致的视频崩溃。开发体验绝对是神圣的。合适的包管理器。正确的服务管理。 Emacs 在 GTK 的所有荣耀中！所有出色的 GNU 实用程序。 Docker 在其家中。没有更多的 XCode 安装。没有比这更好的了。我 100% 肯定 Linux 为大多数软件工程师提供了最好的开发体验。当没有硬件问题对其产生负面影响时，就是这样。结语“回到 Linux”有点用词不当，因为这篇文章在我的后备箱中停留了很长时间。到我包装它时，我不再使用 Linux，至少不是本地的。由于 GPU 驱动程序问题，最后我选择切换到 Windows 10 和 WSL（基本上是在 Windows 中运行的 Linux VM）。一年后，我仍然是一个快乐的露营者。使用 Windows 10 我得到了两全其美：没有驱动程序问题 适当的 Linux 开发体验 作为奖励 - 我也有机会玩更多游戏。 2 Windows 仍然有它的怪癖，但它的体验肯定胜过体验我用过Linux。所有专有应用程序都运行良好，驱动程序可靠，而且我基本上一直在 Linux 上工作。 macOS 中我唯一真正缺少的是所有 Apple 设备之间良好的协作/同步 - 例如，您在手机上拍照，然后它会立即发送到您的计算机。您会在手机和计算机上收到一条短信。没什么大不了的，但是这个有围墙的 Apple 花园让我继续使用 macOS，尽管我对它越来越感到沮丧。我讨厌围墙花园！简而言之，硬件支持仍然是 Linux 作为桌面操作系统的最大弱点，一如既往。非常令人失望的是，即使在为 Linux 兼容性仔细选择了硬件之后，我仍然得到了一个不能可靠工作的 GPU。我有理由相信，如果我选择了较旧的 GPU，它会工作得更好，但我真的不想做出太多妥协。谁知道呢，现在困扰我的问题可能已经解决了，虽然我不确定是否急于检查这个。从好的方面来说 - 经过这么多年，组装一台新 PC 是一件很有趣的事情。你应该已经看到当这东西从第一次尝试启动时我是多么高兴！很高兴检查 Linux 世界取得的进展并找到给 Windows 另一个机会的理由。这就是我今天为你准备的全部内容。继续黑客！我碰巧是 AMD 的忠实粉丝。 ↩ 不确定这是否真的是奖金。 ↩", "note_en": "Background Note: I’ve started writing this article about one year ago (September 2020), but I dropped it at some point. Its final version is way less ambitious than my original plans for it, mostly because I forgot some of things that were on mind back then. Still, better than nothing. A long time ago (in 2011) I wrote about my frustrations with Linux that led me to abandon the OS after having spent quite a lot of time on it. After this article I made one failed attempt to convert to Windows and eventually I settled on macOS for almost a decade. While I was reasonably happy with macOS for most of the time, it never felt like home and I kept longing to revisit Linux. I was also missing having a custom-built desktop PC for a while, so I was very tempted to get one and run Linux on it. For various reasons (e.g. a lot of work-related travel and excessive laziness) I never got to doing so. Until now. 2020 has been a horrible year on many levels, but it presented me with an unique opportunity to follow through with my Linux PC plans, as I was finally grounded at home and had some extra time on my hands. In this article I’ll share my experience revisiting Linux and rediscovering the joy of being in control of your operating system and your hardware. The Downfall of macOS for Software Development I won’t go into much details here, as I hope everyone has noticed the shift in macOS to be something more like iOS. That’s good for most users, but not really for software engineers. Apple used to spend a lot of time courting developers to their OS some 15 years ago, but now they only seem to care about macOS and iOS devs. They rarely update the Unix tools that ship with macOS, they still haven’t created a package manager (everyone’s basically using homebrew), etc. At this point it’s clear to me that macOS is not meant to be an OS for tinkerers, but rather for consumers. That’s not a bad thing, it just doesn’t sit very well with me. On a more practical note, here are a few things that have bothered me with macOS in recent years: Pushing aggressively for the use of the App Store, which limits what applications can do. The OS tries hard to dissuade you from using any externally procured applications. Bringing some applications and weird features from iOS to macOS (has anyone ever used the launchpad?). The need to reinstall XCode after each macOS upgrade. Almost every major OS upgrade breaks Homebrew or some tool that I use (like Karabiner, a keyboard remapping utility). macOS ships by default with Emacs 22. That’s not a typo. As noted above there are plenty of outdated Unix tools that ship with macOS. Cheap tricks to obscure some problems, like hiding the remaining battery life estimation. I can go on, but I’ll stop at this point. I hope you get the idea. The New Hardware Here’s the hardware that I got in early July 2020 (it took me almost 3 months to settle on all the parts): CPU AMD RYZEN 7 3700X GPU ASUS DUAL Radeon RX 5500 XT EVO OC 8G Motherboard AORUS X570 ULTRA SSD 960GB M.2 2280 Corsair Force Series MP510 RAM 32GB (2x16GB) DDR4 3200MHz Corsair Vengeance LPX Case Fractal Design Define 7 PSU Fractal Design Ion+ 660W Platinum As you can see there’s nothing fancy about it. I wanted to build a decent workstation, not a gaming rig. Still, I opted to get a decent discrete GPU, as there were a few PC games that I was hoping to eventually play (StarCraft II, Tomb Raider, Diablo III, etc). I went for the Radeon mostly because of the AMD’s (supposedly great) open-source GPU driver for Linux. In hindsight this was a big mistake, but I’ll expand on this topic later. Note: I knew that an Intel CPU with built-in GPU was the safest option in terms of driver support, but I really wanted a Ryzen CPU and a reasonably powerful discreet GPU. I have to say that this 1,600 EUR desktop completely blew out of the water my way more expensive MacBook Pro. Of course, desktops always offered better value/performance than most laptops, but in recent years we’ve all became completely obsessed with laptop/tablets. While portability is definitely a problem with desktops, they also have some cool advantages like: They don’t overheat They don’t run out of juice You can actually fix/upgrade them They force you to work on desk (meaning the ergonomics are usually better) End of this slight lyrical detour on the merits of ancient technology from more sophisticated times. The Distro I decided to play it safe and I went with Ubuntu 20.04, which was the latest release at the time. Historically I preferred Arch Linux and Fedora, but I wanted to minimize the setup efforts. When I was younger I loved spending lots of time to tweak every aspect of my setup (e.g. building a custom kernel, tuning the compilation flags for my packages, obtaining proprietary drivers from third-party repos, etc), but now I’m older, lazier and more practical. I still enjoy tinkering with my setup a lot, but I don’t want to be forced to tinker (the Gentoo way). One general trend I’ve observed is that Linux distros are now more complex than they used to be. Life seemed pretty good and simple in the days of System V init, but today systemd dominates everything and makes it harder to comprehend. At least to someone like me, who completely missed the transition to systemd. systemd is a software suite that provides an array of system components for Linux operating systems. Its main aim is to unify service configuration and behavior across Linux distributions; systemd’s primary component is a “system and service manager”—an init system used to bootstrap user space and manage user processes. It also provides replacements for various daemons and utilities, including device management, login management, network connection management, and event logging. So much for the single-responsibility principle. The Drivers Everything worked out of the box, but unfortunately not everything worked well. I was getting some intermittent issues with my wi-fi and X.org kept crashing due to some issues with the GPU drivers. A quick Google search revealed I wasn’t the only person facing these GPU issues. No matter what I tried (and I tried a lot of things - updated kernels, Mesa, random patches I found here and there, etc) I couldn’t solve the GPU issue and my computer kept crashing 1-2 times per day. As you can imagine this was quite frustrating. Funny enough, after each change the crashes would get more frequent or less frequent. Never completely disappear, though. The wi-fi problem was much easier to address - I just switched to ethernet and never bothered to investigate it. In the past I also struggled with getting my printer to work properly, but I no longer have a printer, so that’s one of those problems that solved itself. Hardware support was the main reason I left Linux a decade ago and sadly the situation there hasn’t improved much. Perhaps the situation is better with Nvidia GPUs, but I was hoping avoid dealing with a proprietary driver.1 The Apps Little has changed in the past 10 years, not to mention I don’t use that many apps - mostly a browser (Chrome and Firefox), Emacs and a terminal (Guake). In short - everything was better than I remembered it, but nothing was fantastic. GNOME and its apps (e.g. Nautilus) still have plenty of rough edges, but they get the job done. Albert was a great alternative to Alfred (one of my favorite macOS tools). That’s probably the only new app that I used this time around. Some proprietary apps that I need for work (like Zoom, Slack and Dropbox) didn’t work/look great (especially when compared to their macOS/Windows versions), but this is what I expected anyways. Still, they were working better than I remembered them to. Given the small market share that desktop Linux has, I never expected big corporations to start investing heavily in Linux support. I recall that 5 years ago Zoom kept crashing constantly on Linux (colleagues using Linux were often dropping out of Zoom calls, that’s how I know this), but at least it was working reliably for me. Back in the day I complained about how bad Skype for Linux was, but fortunately I no longer have to use Skype, so this is a problem that solved itself. I also complained about the quality of OpenOffice - another application I no longer needed, as I’m using mostly Google Docs these days. In general the trend to move from native desktop applications to web based applications is definitely a benefit for Linux users. In some cases I actually preferred the web versions of applications that have a Linux desktop version as they seemed to work better to me (e.g. Slack and Spotify). Skype also has a nice web app these days, if you happen to need it. One more thing - I was happy to see that there were a lot of games (by Linux standards) in Steam, despite the failure of Valve’s Steam Machine project (a gaming console running Linux). I tried out a couple of older games and they worked fine, apart from the video crashes I was getting because of the GPU driver issues. The Development Experience Absolutely divine. Proper package manager. Proper service management. Emacs in all its GTK glory! All the fantastic GNU utils. Docker at its home. No more XCode installations. It doesn’t get better than this. I’m 100% certain that Linux offers the best development experience for most software engineers. When there aren’t hardware issues to affect it negatively, that is. Epilogue “Back to Linux” is a bit of a misnomer, because of the long period in which this article stayed on my backburner. By the time I wrapped it, I’m no longer using Linux, at least not natively. Due to the GPU driver issues, in the end I’ve opted to switch to Windows 10 and WSL (basically a Linux VM running in Windows). One year later I’m still a happy camper. With Windows 10 I got the best of both worlds: no driver issues proper Linux development experience As a bonus - I also got the opportunity to play a lot more games.2 Windows still has its quirks, but the experience with it certainly beats the experience I had with Linux. All proprietary apps work great, the drivers are solid and I’m essentially working in Linux all of the time. The only thing from macOS I’m really missing is the nice collaboration/sync between all Apple devices - e.g. you take a picture on your phone and it immediately goes to your computer. You get an SMS on your phone and it’s also on your computer. Not a big deal, but this walled Apple garden kept me on macOS even though I was getting more and more frustrated with it. I hate walled gardens! In short, hardware support remains the biggest weakness of Linux as desktop operating system, just as always. It’s super disappointing that even after carefully choosing hardware for Linux compatibility I still ended up with a GPU that didn’t work reliably. I’m reasonably sure that if I had opted for an older GPU it would have worked better, but I didn’t really want to make too many compromises. Who knows, probably by now the problems that plagued me have been fixed, although I’m not sure eager to check this. On the bright side - it was a ton of fun to assemble a new PC, after all those years. You should have seen how happy I was when the thing booted from the first try! And it was nice to check in on the progress made in the world of Linux and to find a reason to give Windows another chance. That’s all I have for you today. Keep hacking! And I happen to be a huge AMD fan. ↩ Not sure if that’s really a bonus though. ↩", "posttime": "2021-08-03 00:24:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,回到", "title": "回到 Linux", "title_en": "Back to Linux", "transed": 1, "url": "http://metaredux.com/posts/2021/07/31/back-to-linux.html", "via": "", "real_tags": ["linux", "回到"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "拉丁美洲和加勒比区域办事处", "note_en": "Regional Office for Latin America and the Caribbean", "posttime": "2021-08-03 00:24:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,多样性,knowledge,区域", "title": "土壤生物多样性知识状况（2020 年）", "title_en": "State of knowledge of soil biodiversity (2020)", "transed": 1, "url": "http://www.fao.org/documents/card/en/c/cb1928en/", "via": "", "real_tags": ["2020", "多样性", "knowledge", "区域"]}, {"category": "", "categoryclass": "", "imagename": "41fd9cc43f870e100b9c9fbdf170e3ba.jpg", "infoid": 1071196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌正在为 YouTube 试行一个更实惠的高级订阅层，提供无广告观看，而没有 YouTube Premium 的其他功能，如离线下载或后台播放。用户在 ResetEra 上发现了新的“Premium Lite”计划，YouTube 随后在给 The Verge 的一份声明中确认了该测试产品。 Premium Lite 目前正在比利时、丹麦、芬兰、卢森堡、荷兰、挪威和瑞典进行测试。 “在北欧和比荷卢经济联盟（冰岛除外），我们正在测试一种新产品，为用户提供更多选择：Premium Lite 每月收费 6.99 欧元（或当地等价物每月），其中包含 YouTube 上的无广告视频，” YouTube 发言人在一份声明中说。相比之下，YouTube 现有的高级计划在欧洲每月的费用约为 11.99 欧元。 “我们正在测试一种新产品，为用户提供更多选择” Premium Lite 包括在网络、iOS、Android、智能电视和游戏机上的 YouTube 主应用程序以及 YouTube Kids 应用程序中的无广告观看。但是，它不包括任何 YouTube Music 的好处，例如无广告收听，也不包括 Premium 的其他功能，例如后台播放（当您想切换到另一个应用程序同时继续收听 YouTube 视频中的音频时） ，或离线下载。作为一个讨厌 YouTube 上大量广告但对 Premium 的其他功能（如离线下载）不太感兴趣的人，Premium Lite 听起来很诱人。但按照目前的定价，它的成本是普通高级订阅价格的 60% 左右，而仅提供其大约四分之一的好处。 YouTube 表示，目前的订阅处于试验阶段，并且正在考虑根据观众的反馈推出更多计划。", "note_en": "Google is piloting a more affordable premium subscription tier for YouTube that offers ad-free viewing without YouTube Premium’s other features like offline downloads or background playback. The new “ Premium Lite” plan was  spotted by a user on ResetEra, and YouTube subsequently confirmed the test offering in a statement given to  The Verge. Premium Lite is currently being tested in Belgium, Denmark, Finland, Luxembourg, the Netherlands, Norway, and Sweden.\n “In Nordics and Benelux (except for Iceland), we’re testing a new offering to give users even more choice: Premium Lite costs €6.99/month (or local equivalent per month) and it includes ad-free videos on YouTube,” a YouTube spokesperson said in a statement. In comparison, YouTube’s existing Premium plan costs around €11.99 a month in Europe.\n “We’re testing a new offering to give users even more choice”\n Premium Lite includes ad-free viewing across YouTube’s main app on web, iOS, Android, smart TVs, and games consoles, as well as in the YouTube Kids app. However, it doesn’t include any YouTube Music benefits like ad-free listening, and it doesn’t include  Premium’s other features like background playback (for when you want to switch to another app while continuing to listen to audio from a YouTube video), or offline downloads.\n Speaking as someone who hates the amount of ads on YouTube, but isn’t too interested in Premium’s other features like offline downloads, Premium Lite sounds like a tempting proposition. But at its current pricing, it costs around 60 percent of the price of a regular Premium subscription, while only offering around a quarter of its benefits. YouTube says that the current subscription is in an experimental phase, however, and that it’s considering rolling out more plans based on audience feedback.", "posttime": "2021-08-03 00:19:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,youtube,premium", "title": "YouTube“Premium Lite”订阅以更低的价格提供无广告观看", "title_en": "YouTube ‘Premium Lite’ subscription offers ad-free viewing for less", "transed": 1, "url": "https://www.theverge.com/2021/8/2/22605455/youtube-premium-lite-pilot-benelux-nordics-experiment-ad-free-subscription", "via": "", "real_tags": ["广告", "youtube", "premium"]}, {"category": "", "categoryclass": "", "imagename": "a9f03d2762cb4e25580164553eba9e4e.jpg", "infoid": 1071195, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位安全研究人员发布了 Linux 内核 eBPF（扩展伯克利数据包过滤器）中一个高危漏洞的利用代码，该漏洞可以让攻击者在 Ubuntu 机器上获得更高的权限。该错误被跟踪为 CVE-2021-3490。它在 5 月份被披露并且是一种特权升级，因此利用它需要在目标机器上进行本地访问。 eBPF 是一种技术，它使用户提供的程序能够在操作系统内核中以沙盒方式运行，由特定事件或功能（例如系统调用、网络事件）触发。与趋势科技零日计划合作的 RedRocket CTF 团队的 Manfred Paul 报告了该错误。他们发现 CVE-2021-3490 可能会变成内核中的越界读写。问题在于用户提供的程序在执行之前没有经过适当的验证过程。如果利用得当，本地攻击者可以获得内核权限，在机器上运行任意代码。在本周的一篇博文中，漏洞利用开发人员 Valentina Palmiotti 描述了 CVE-2021-3490 背后的技术细节及其在 Ubuntu 短期版本 20.10 (Groovy Gorilla) 和 21.04 (Hirsute Hippo) 上的利用。 Palmiotti 是 Grapl 的首席安全研究员，该公司为事件检测和响应提供基于图形的平台。\n她对这个错误的研究还涵盖了触发漏洞以利用它来提升特权以及通过锁定所有可用内核线程在目标系统上创建拒绝服务 (DoS) 条件的具体细节。研究人员为 CVE-2021-3490 创建了概念验证漏洞利用代码，并将其发布在 GitHub 上。下面提供了演示漏洞利用有效性的视频： 今年早些时候，微软宣布了一个名为 ebpf-for-windows 的新开源项目，该项目允许开发人员在 Windows 之上使用 eBPF 技术。这可以通过为现有 eBPF 项目添加兼容层来实现，以便它们可以在 Windows 10 和 Windows Server 中充当子模块。将 eBPF 移植到 Windows 仍然是一个早期的项目，有很多发展前景。 Palmiotti 对 CVE-2021-3490 的研究仅限于 Linux 实现。研究人员告诉 BleepingComputer，因此，她的漏洞在当前形式的 Windows 上无法运行。 PoC 是为 Groovy Gorilla 内核 5.8.0-25.26 到 5.8.0-52.58 和 Hirsute Hippo 内核版本 5.11.0-16.17 设计的。两个 Ubuntu 版本都发布了补丁。", "note_en": "A security researcher released exploit code for a high-severity vulnerability in Linux kernel eBPF (Extended Berkeley Packet Filter) that can give an attacker increased privileges on Ubuntu machines.\n The bug is tracked as CVE-2021-3490. It was disclosed in May and is a privilege escalation, so leveraging it requires local access on the target machine.\n eBPF is a technology that enables user-supplied programs to run sandboxed inside the operating system’s kernel, triggered by a specific event or function (e.g. system call, network events).\n  Manfred Paul of the  RedRocket CTF team working with Trend Micro&#39;s Zero Day Initiative reported the bug. They found that CVE-2021-3490 could be turned into out-of-bounds reads and writes in the kernel.\n The issue consists of the fact that user-supplied programs do not go through a proper validation process before they’re executed. If properly exploited, a local attacker could get kernel privileges to run arbitrary code on the machine.\n In a  blog post this week, exploit developer  Valentina Palmiotti, describes the technical details behind CVE-2021-3490 and its exploitation on Ubuntu short-term releases 20.10 (Groovy Gorilla) and 21.04 (Hirsute Hippo).\n Palmiotti is a lead security researcher at Grapl, a company that offers a graphical-based platform for incident detection and response.\n Her research into this bug also covers the specifics for triggering the vulnerability to leverage it for elevated privileges and to create a denial-of-service (DoS) condition on the target system by locking up all available kernel threads.\n The researcher created proof-of-concept exploit code for CVE-2021-3490 and  published it on GitHub. A video demonstrating the validity of the exploit is available below:\n  Earlier this year, Microsoft announced a new open-source project called  ebpf-for-windows that allows developers to use the eBPF technology on top of Windows.\n This would be achieved by adding a compatibility layer for existing  eBPF projects so they can function as submodules in Windows 10 and Windows Server.\n Porting eBPF to Windows is still an early project that has a lot of development ahead. Palmiotti’s research into CVE-2021-3490 was limited to the Linux implementation. The researcher told BleepingComputer that because of this, her exploit would not work on Windows in the current form.\n The PoC is designed for Groovy Gorilla kernels 5.8.0-25.26 through 5.8.0-52.58, and Hirsute Hippo kernel version 5.11.0-16.17.  Patches were released for both Ubuntu versions.", "posttime": "2021-08-03 00:19:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,漏洞,ubuntu,发布,ebpf", "title": "Linux eBPF 漏洞在 Ubuntu 上获得 root 权限——漏洞利用已发布", "title_en": "Linux eBPF bug gets root privileges on Ubuntu – Exploit released", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/linux-ebpf-bug-gets-root-privileges-on-ubuntu-exploit-released/", "via": "", "real_tags": ["linux", "漏洞", "ubuntu", "发布", "ebpf"]}, {"category": "", "categoryclass": "", "imagename": "19d9a31446bd145c72eab82cfc4256e2.jpg", "infoid": 1071194, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们都知道狼人和海洋潮汐都受到月球的影响，但我们可以在列表中添加另一个项目：特斯拉的全自动驾驶功能，这是该公司的 NHTSA 2 级驾驶员辅助功能。一位特斯拉用户最近在推特上发布了一段视频，显示他的车辆一直将低悬的月亮误认为是交通灯。您可以在下面观看：在此剪辑中，月亮在天空中显得特别黄且低，这可能是导致此问题的原因。这不是一个常见的问题，但它绝对是一个足够司机想要解决的问题——毕竟，我相信我们都看过外面的月亮看起来比平时更时髦。这个问题是在特斯拉宣布任何特斯拉用户可以以每月 99 至 199 美元的价格订阅 Autopilot 的 FSD 功能之后出现的，而不是在购买车辆时支付全额 10,000 美元。自推出以来，特斯拉的 Autopilot 系统就面临着相当多的挑战。例如，它混淆了道路车道标记，并且无法识别停在车道上的消防车。也就是说，这些问题完全在新技术的理解范围内。工程师可以预见很多问题，但他们无法预见所有问题。结果，这些怪癖大部分都得到了解决。而且，公平地说，特斯拉并不是唯一一家在正确响应交通信号灯方面遇到困难的制造商。某些交叉路口可能特别复杂，或者具有与该特定交叉路口相关的独特灯光模式。我已经看到我的相当一部分野生动物开车穿过波士顿和费城。一些十字路口有特定车道的灯。在您实际接近主灯之前，有些灯会带有初步灯。其他灯只是以奇怪的角度放置，或者灯光很时髦，比如当一个灯比平时闪烁或暗淡时。一系列复杂的现实世界问题在这里发挥作用，但我们很可能会看到特斯拉很快解决月球问题。", "note_en": "We all know that werewolves and ocean tides are both impacted by the moon, but we can add another item to the list: Tesla’s Full Self-Driving feature, which is the company’s NHTSA Level 2 driver assistance feature.\n  One Tesla user recently posted a video clip on Twitter that showed his vehicle consistently mistaking the low-hanging moon for a traffic light. You can watch below:\n     In this clip, the moon appears to be especially yellow and low in the sky, which likely contributes to this issue. It’s not a regular issue, but it’s definitely issue enough that drivers would want it taken care of — after all, I’m sure we’ve all looked outside to see the moon looking funkier than usual.\n  This issue comes after Tesla has announced that any Tesla user can   subscribe to Autopilot’s FSD feature for $99 to $199 per month rather than paying the full $10,000 at the time of buying the vehicle.\n  Tesla’s Autopilot system has faced its fair share of challenges since its introduction. It has confused road lane markings and has had trouble recognizing a fire truck is parked in a traffic lane, for example. That said, these issues are well within the realm of understanding for a new technology. Engineers can anticipate plenty of problems, but they can’t anticipate them all. As a result, most of these quirks have been sorted out.\n  And, to be fair to Tesla, it isn’t the only manufacturer that has struggled with correctly responding to traffic lights. Some intersections can be especially complex or have unique light patterns that relate to that specific intersection. I’ve seen my fair share of wild ones driving through Boston and Philadelphia. Some intersections have lights for a specific lane. Some feature preliminary lights before you actually approach the main light. Other lights are just positioned at weird angles, or the light is just funky, like when one is flickering or dimmer than usual.\n  A complex array of real-world concerns come into play here, but we’re likely to see Tesla resolve the moon situation soon.", "posttime": "2021-08-02 23:30:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,月亮,moon", "title": "特斯拉的全自动驾驶功能将月亮误认为黄色交通灯——这意味着汽车会因为看到月亮而减速。", "title_en": "Tesla's Full Self-Driving Feature Mistakes Moon For Yellow Traffic Light - That means the car will slow down because it sees the moon.", "transed": 1, "url": "https://jalopnik.com/teslas-full-self-driving-feature-mistakes-moon-for-yell-1847355050", "via": "", "real_tags": ["特斯拉", "月亮", "moon"]}, {"category": "", "categoryclass": "", "imagename": "17fc0b65066fe60754f721ca374b8e44.jpg", "infoid": 1071192, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于隐含溢价，交易宣布​​后 Afterpay 的股价大幅上涨，而 Square 的股价在早盘交易中上涨了 7%。在过去的一年里，我们写了大量关于 BNPL 市场的文章，通常是从该领域公司收益的角度来看的。 Afterpay 与尚未公开的 Klarna 和美国公共 BNPL 机构 Affirm 一样，一直是一个关键的数据来源。回想一下，每家公司最近都取得了强劲的增长，美国成为主要竞争市场。最近，据报道，消费硬件和服务巨头苹果正准备进军 BNPL 领域。我们当时读到的是，库比蒂诺的任何此类运动都会影响大众市场 BNPL 参与者，而不是专注于利基市场的公司。 Apple 拥有金融科技基础和广泛的 IRL 支付接受度，使其成为面向消费者的 BNPL 服务的潜在强大竞争对手；针对特定行业或利基市场的 BNPL 服务可能会减少来自 Apple 的竞争。从这个角度来看，让我们探索 Square-Afterpay 交易。我们想知道 Afterpay 在收入、增长和覆盖面方面给 Square 带来了什么。我们还想对 Square 愿意为公司支付的价格进行一些计算——以及这可能会告诉我们更广泛的 BNPL 和金融科技收入的价值。然后我们将关注这些数字并尝试确定 Square 是否为 Afterpay 支付了过高的费用。与如今的大多数重大交易一样，Square 和 Afterpay 发布了一份投资者报告，详细说明了他们支持合并的论点。让我们深入了解一下。 Square 是一家由两部分组成的公司。它通过 Cash App 拥有庞大的消费者业务，并且拥有一个大型业务部门，为企业客户提供支付技术和其他金融科技服务。回想一下，Square 还在为其商业客户构建银行服务，并且 Cash App 还为消费者提供一些银行和投资功能。", "note_en": "Shares of Afterpay are sharply higher after the deal was announced thanks to its implied premium, while shares of Square are up 7% in early-morning trading.\n     Over the past year, we’ve written extensively about the BNPL market, usually from the  perspective of earnings from companies in the space. Afterpay has been a key data source, along with the yet-private Klarna and U.S. public BNPL outfit Affirm. Recall that each company has  posted strong growth in recent periods, with the United States arising as a prime competitive market.\n Most recently, consumer hardware and services giant Apple is reportedly  preparing a move into the BNPL space. Our read at the time was that any such movement by Cupertino would impact mass-market BNPL players more than niche-focused companies. Apple has a fintech base and broad IRL payment acceptance, making it a potentially strong competitor for BNPL services aimed at consumers; BNPL services targeted at particular industries or niches would likely see less competition from Apple.\n From that landscape, let’s explore the Square-Afterpay deal. We want to know what Afterpay brings to Square in terms of revenue, growth and reach. We also want to do some math on the price Square is willing to pay for the company — and what that might tell us about the value of BNPL and fintech revenues more broadly. Then we’ll eyeball the numbers and try to decide if Square is overpaying for Afterpay.\n  As with most major deals these days, Square and Afterpay released an  investor presentation detailing their argument in favor of their combination. Let’s dig through it.\n Square is a two-part company. It has a large consumer business via Cash App, and it has a large business division that offers payments tech and other fintech services to corporate customers. Recall that Square is  also building out banking services for its business customers and that Cash App also serves some banking and  investing functionality for consumers.", "posttime": "2021-08-02 23:30:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "bnpl,square", "title": "为什么 Square 斥资 29B 美元来抢夺 BNPL 玩家 Afterpay", "title_en": "\n\t\t\t\tWhy Square is shelling out $29B to snag BNPL player Afterpay\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/why-square-is-shelling-out-29b-to-snag-bnpl-player-afterpay/", "via": "", "real_tags": ["bnpl", "square"]}, {"category": "", "categoryclass": "", "imagename": "cff3b70230b2c78091607347353ae7c2.jpg", "infoid": 1071191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2019 年，该机构聘请前奥巴马时代的反垄断官员夏皮罗 (Shapiro) 协助其对 Facebook 提起诉讼。根据 POLITICO 对联邦合同的分析，该机构已经向他担任高级顾问的经济咨询公司支付了 570 万美元。数据。这几乎是 FTC 在过去两年中为任何其他专家服务支付的费用的两倍，当时该机构告诉国会它手头拮据。尽管 FTC 保留了夏皮罗及其同事完成的任何工作，但专家表示，该机构聘请的任何新经济团队都需要重新完成大部分工作，以便在法庭上为其充分辩护。这是美国联邦贸易委员会越来越头疼的问题，因为它试图对 Facebook 提起诉讼，并对亚马逊展开反垄断调查——这两家公司都是美国最有价值的五家公司之一。这两家科技巨头要求汗从他们的案件中回避，引发了关于 FTC 应该如何回应的内部辩论，她面临着共和党立法者的攻击，他们指责她让该机构的两名共和党委员边缘化。 “FTC 不会对任何特定专家参与的内部审议发表评论，”发言人 Lindsay Kryzak 告诉 POLITICO。 “但该机构会定期审查其专家支持需求，包括确保该机构在履行执法义务的同时充分利用有限的公共资金。”该机构于 12 月起诉 Facebook，指控该公司通过收购 Instagram 和 WhatsApp 并切断其他潜在竞争对手的数据访问权，垄断了社交网络市场。一名联邦法官上个月驳回了 FTC 的投诉，发现检察官没有证明 Facebook 控制了超过 60% 的市场。该机构必须在 8 月 19 日之前提出新的投诉。 FTC 还一直在寻找夏皮罗的替代者，夏皮罗是奥巴马和克林顿政府司法部的顶级反垄断经济学家，也是反垄断诉讼中的知名人物。在过去八年中，他曾在六起 FTC 或 DOJ 案件中担任作证专家，其中包括特朗普时代的司法部未能阻止 AT&amp;T 与时代华纳的合并，以及州检察长试图阻止 Sprint 和 T-Mobile 的失败从合并。他还为谷歌提供咨询服务。 FTC 女发言人 Kryzak 拒绝评论该机构在专家证人身上花费了多少。\n该机构已请求国会提供更多资金，称其 3.31 亿美元的预算不足以应对其在监管合并、商业行为、消费者隐私和数据安全方面迅速增长的工作量。在财务报告中，该机构将不断膨胀的专家证人费用列为其“最大风险”之一。与 POLITICO 交谈的个人不知道夏皮罗退出的原因，也不知道这是否与关于案件未来、成本或夏皮罗和汗之间意识形态差异的历史分歧有关。这些人要求匿名以谈论内部机构的审议。 Shapiro 一直批评 Khan 的反垄断方法，特别是她认为执法者过于关注所谓的消费者福利标准，该标准强调价格是缺乏竞争的主要标志。 （科技行业的批评者表示，该标准不适合处理像 Facebook 和谷歌这样向消费者免费提供主要产品的公司。）在 6 月 28 日与记者的对话中，汗说以前的反垄断执法者过于依赖经济分析，使他们的情况。她引用了各州对 Sprint-T-Mobile 合并的挑战——夏皮罗代表总检察长作证——法官说，决斗的经济专家“基本上相互抵消”，并要求他从“竞争水晶球。” “在过去的几十年里，反垄断已经变得依赖于一种特定类型的经济理论，”汗说。 “反垄断法规相当稀少。他们很一般。里面没有关于使用什么计量经济学分析。关于特权的分析类型有多种选择。”熟悉该机构 Facebook 案件的另外两名人士为 FTC 迄今为止花费的金额辩护，并指出像针对社交网络的垄断案件是出了名的昂贵。其中一位知情人士说，新主席寻求更换高调案件中的高级职员或专家，以更好地与他们的优先事项保持一致，这也并不罕见。两人都匿名讨论内部机构动态。在 2019 年的一次审计中，FTC 的监察长发现该机构每小时为专家支付约 750 美元，涉及公司商业行为的案件——比如针对 Facebook 的反垄断诉讼——是最昂贵的。在监察长审计的 15 份合同中，行为案件占 2000 万美元支出中的 600 万美元。\n调查人员建议 FTC 在更多案件中寻求使用其内部经济学家作为专家证人。与此同时，Facebook 有资源进行激烈的法庭斗争。它报告最近一个季度的收入为 290 亿美元，市值约为 1 万亿美元。 FTC 在 2 月份拒绝了 POLITICO 要求提供与 Facebook 案件相关的专家证人合同信息的公共记录请求，称其披露将干扰该机构的诉讼。但使用 FTC 向联邦政府合同数据库报告的公共数据，POLITICO 能够识别与 Facebook 相关的专家证人合同。在 9 月 30 日结束的财政年度中，FTC 花费了 2130 万美元用于专家证人服务。根据联邦政府的合同记录，本财年到目前为止，联邦贸易委员会已经花费了 2500 万美元。根据所需的工作，支付的金额从几千美元到几百万美元不等。这份价值 570 万美元的合同是迄今为止最大的，几乎是该机构为专家证人服务支付的任何其他合同金额的两倍。 “专家必须审查、使用和吸收的数据和文件信息量随着时间的推移呈天文数字增长，这导致专家成本上升，”从 2017 年到 2019 年担任 FTC 顶级竞争工作人员的布鲁斯霍夫曼说。霍夫曼现在是 Cleary Gottlieb 律师事务所的合伙人，他说，联邦贸易委员会在内部完成了一些工作，但没有承担所有这些工作所需的计算能力或基础设施。大部分费用可能不是来自夏皮罗本人——他向政府提供了他向企业客户收取的费用的折扣——而是来自协助他的 Charles River Associates 同事。协助夏皮罗的个人对调查中公司提供的数据进行标准化，并进行夏皮罗要求的经济计算。 CRA 向该机构收取夏皮罗及其员工的工作时间费用。\n两位要求匿名发言的经济顾问表示，咨询公司与其专家之间的合同条款各不相同，但夏皮罗的报酬是他的工作时间加上他助理总账单的一部分，可能在 10% 到 25% 之间讨论该机构和咨询公司都认为保密的计费做法。两位顾问都表示，鉴于 Facebook 案件才刚刚开始，他们对 FTC 迄今为止所花费的金额感到惊讶。反垄断诉讼中最昂贵的部分通常发生在案件的后期，当时专家准备的书面报告可能长达数百页。他们说，这些在法庭上提交的专家证人报告的准备费用可能在 100 万至 200 万美元之间。顾问们表示，虽然 FTC 聘请的任何新专家都可以重复使用夏皮罗及其团队编制的数据，但该人会坚持重新进行经济分析，以便能够在法庭上为其辩护。但在 Facebook 案件真正开始之前就离开了该机构的霍夫曼表示，他对这笔费用并不感到惊讶。 “这是一个复杂的案例。我可以想象有令人难以置信的大量数据，”他说。 “有点讽刺的是，全国各地的人们都在尖叫着 FTC 应该更加活跃，另一方面又担心它花了太多钱。如果你想让 FTC 活跃起来，你就必须给他们钱来做到这一点。”", "note_en": "The agency hired Shapiro, a former Obama-era antitrust official, to aid in its suit against Facebook in 2019. It has already paid out $5.7 million to the economics consulting firm where he is a senior consultant, according to a POLITICO analysis of federal contracting data. That is nearly double what the FTC has paid for any other expert services over the past two years at a time the agency has told Congress it is strapped for cash.\n While the FTC retains any work Shapiro and his associates have completed, experts said much of the work will need to be redone by any new economic team hired by the agency in order to adequately defend it in court.\n That’s on top of a growing pile of headaches for the FTC as it attempts to press its case against Facebook and pursues an antitrust probe of Amazon — both of which rank among the five most valuable U.S. companies. The two tech giants have demanded that Khan recuse herself from their cases,  prompting an internal debate on how the FTC should respond, and she faces attacks from GOP lawmakers who accuse her of sidelining the agency’s two Republican commissioners.\n   “The FTC does not comment on internal deliberations over any particular expert engagement,” spokesperson Lindsay Kryzak told POLITICO. “But the agency routinely reviews its expert support needs, including to ensure that the agency is making the best use of limited public funds while carrying out its law enforcement obligations.”\n The agency sued Facebook in December, alleging the company monopolized the social networking market by buying up Instagram and WhatsApp and cutting off data access to other potential rivals. A federal judge threw out the FTC’s complaint last month, finding prosecutors didn’t show Facebook controls more than 60 percent of the market. The agency has until Aug. 19 to file a new complaint.\n The FTC has also been seeking a replacement for Shapiro, the top antitrust economist at the Justice Department in both the Obama and Clinton administrations and a well-known figure in antitrust litigation. He has served as the testifying expert in six FTC or DOJ cases over the past eight years, including the Trump-era Justice Department’s failed bid to stop AT&amp;T’s merger with Time Warner and an unsuccessful attempt by state attorneys general to block Sprint and T-Mobile from merging. He also consults for Google.\n Kryzak, the FTC spokeswoman, declined to comment on how much the agency has spent on expert witnesses.\n The agency has pleaded with Congress for more money, arguing that its $331 million budget isn’t sufficient for its burgeoning workload of policing mergers, business conduct, consumer privacy and data security.  In financial reports, the agency has cited ballooning expert witness costs as among its “top risks.”\n  The individuals who spoke to POLITICO didn’t know the reason for Shapiro’s exit and whether it related to disagreements about the future of the case, the costs or the history of ideological differences between Shapiro and Khan. The individuals requested anonymity to speak about internal agency deliberations.\n Shapiro  has been critical of Khan’s approach to antitrust, particularly  her view that enforcers focus too heavily on a so-called consumer welfare standard that emphasizes price as the main sign of a lack of competition. (Critics of the tech industry say the standard is ill-suited to handling companies like Facebook and Google that offer their main products free of charge to consumers.)\n In a conversation with reporters on June 28, Khan said previous antitrust enforcers relied too heavily on economic analysis to make their cases. She cited the states’ challenge to the Sprint-T-Mobile merger — in which Shapiro testified on behalf of the attorneys general — where the judge said the dueling economic experts “essentially cancel each other out” and required him to tell the future from “competing crystal balls.”\n “Antitrust over the last few decades has become dependent on a particular type of economic theory,” Khan said. “The antitrust statutes are quite sparse. They are very general. There’s nothing in there about what econometric analysis to use. There’s been choices about what types of analysis to privilege.”\n  Two other individuals familiar with the agency’s Facebook case defended the amount of money the FTC has spent so far, noting that monopolization cases like the one against the social network are notoriously expensive. It also isn’t unusual for a new chair to seek to replace top staffers or experts in high-profile cases to better align with their priorities, one of the people said. Both spoke anonymously to discuss internal agency dynamics.\n In a 2019 audit,  the FTC’s inspector general found the agency pays about $750 per hour for experts and that cases involving company business conduct — like the antitrust suit against Facebook — are among the most expensive. Of the 15 contracts the inspector general audited, conduct cases accounted for $6 million of the $20 million spent.\n The investigators recommended the FTC seek to use its in-house economists as expert witnesses in more cases.\n Facebook, meanwhile, has the resources to put up a hefty court fight. It  reported $29 billion in revenue in the most recent quarter and has a market value of about $1 trillion.\n  The FTC denied a public records request from POLITICO in February seeking information on expert witness contracts related to the Facebook case, saying its disclosure would interfere with the agency’s litigation. But using public data that the FTC reported to a federal government contracting database, POLITICO was able to identify  the expert witness contract related to Facebook.\n In the fiscal year that ended on Sept. 30, the FTC spent $21.3 million for expert witness services. So far this fiscal year, the FTC has already spent $25 million, according to federal government contracting records. The amounts paid vary between a few thousand dollars and several million depending on the work required. The $5.7 million contract is by far the largest, nearly double the amount of any other contract the agency has paid for expert witness services.\n “The quantity of information both data and documents that experts have to review, use and assimilate has grown astronomically over time and that has caused expert costs to rise,” said Bruce Hoffman, who served as the FTC’s top competition staffer from 2017 through 2019.\n The FTC does some of the work in-house but doesn’t have the computing power or infrastructure needed to take on all of it, said Hoffman, now a partner at the law firm Cleary Gottlieb.\n Most of the expenses are probably not from Shapiro himself — who offers the government a discount on the rate he charges to corporate clients — but from the Charles River Associates colleagues assisting him. The individuals assisting Shapiro standardize data provided by companies in the investigation and do the economic calculations Shapiro requests. CRA bills the agency for the hours worked by Shapiro and its employees.\n The contract terms between a consulting firm and its experts vary, but Shapiro would be paid for the time he worked plus a percentage of his assistants’ total billings, probably somewhere between 10 and 25 percent, according to two economic consultants who asked to speak anonymously to discuss what both the agency and the consulting firms consider confidential billing practices.\n Both consultants said they were surprised at the amount the FTC had spent so far given that the Facebook case is just beginning. The most expensive part of antitrust litigation usually takes place later in a case, when experts prepare written reports that can run into the hundreds of pages. Those expert witness reports, which are filed in court, can cost between $1 million and $2 million to prepare, they said.\n While any new expert the FTC hires could reuse the data that Shapiro and his team compiled, the consultants said, that person would insist on redoing the economic analysis to be able to defend it in court.\n But Hoffman, who left the agency before the Facebook case was really underway, said he wasn’t surprised by the expense.\n “It’s a complicated case. I could imagine there’s mind bogglingly large quantities of data,” he said. “There’s a little bit of irony that people all over the country are screaming that the FTC should be more active and on the other hand concerned it’s spending too much money. If you want the FTC to be active, you have to give them the money to do that.”", "posttime": "2021-08-02 23:18:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "经济学,facebook,rust,来源,case", "title": "资料来源：FTC 在其针对 Facebook 的反垄断案件中的首席经济学专家 Carl Shapiro 在准备重新提起诉讼时已与该机构分道扬镳", "title_en": "Sources: FTC's lead economics expert in its antitrust case against Facebook, Carl Shapiro, has parted ways with the agency as it prepares to refile its case", "transed": 1, "url": "https://www.politico.com/news/2021/07/30/facebook-antitrust-suit-carl-shapiro-501825", "via": "", "real_tags": ["经济学", "facebook", "rust", "来源", "case"]}, {"category": "", "categoryclass": "", "imagename": "3608bd78e5734cd92178d9f02f4b0480.jpg", "infoid": 1071190, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿特区——今天，众议员 Mark Takano（加利福尼亚州民主党）提出立法，通过降低《公平劳工标准法》规定的非豁免员工加班费的最高工时门槛，将每周标准工作时间从 40 小时减少到 32 小时(FLSA)。缩短工作周对雇主和雇员都有利。由全球政府和企业开展的试点项目已显示出可喜的成果，因为生产力提高，工人报告说工作与生活的平衡更好，病假更少，士气提高，育儿费用降低，因为他们有更多的时间陪伴家人和孩子.在其中一些研究中，更短的工作周也被证明可以进一步降低雇主的医疗保险费，降低企业的运营成本，并对环境产生积极的影响。 “在工作性质迅速变化的时代，我们有责任探索所有可能的方法，以确保我们的现代商业模式优先考虑生产力、公平薪酬和改善工人的生活质量，”众议员 Mark Takano 说。 “我正在引入这项立法，将标准的每周工作时间减少到 32 小时，因为——现在比以往任何时候都多——人们继续工作更长的时间，而他们的工资仍然停滞不前。我们不能继续接受这是我们的现实。许多尝试过每周工作四天的国家和企业发现，随着生产力的提高和工资的增加，它取得了压倒性的成功。在 COVID-19 大流行导致数百万美国人失业或就业不足之后，更短的工作周将使更多人能够以更高的工资参与劳动力市场。这是一项开创性的立法，我感谢坚定支持它的组织和同事。我期待继续在这个问题上开展工作，以便人们可以体验到最好的工作条件——他们应得的工作条件。” AFL-CIO 总裁 Richard Trumka 说：“随着工人的生产力越来越高，我们理应获得更高的薪酬和更多的休假时间。” “在不降低工资的情况下减少总体工作时间——通过缩短工作日和每周工作四天——在世界上都是有意义的，因为它可以将工作时间分配给更多的工人并最大限度地减少失业。这可能是帮助确保技术进步的好处被劳动人民广泛分享的关键机制。” “工作时间非常不平等。数以百万计的人希望工作更多时间来赚取更多收入，而其他人希望减少工作时间以实现更健康的工作/生活平衡。每周工作 32 小时将直接帮助那些试图实现更好的工作/生活平衡的人，同时腾出一些非全职员工可以利用的时间。除此之外，更短的工作周具有重要的环境效益。减少美国人的平均每周工作时间是实现更美好社会的关键一步，”经济政策研究所说。该法案已得到美国劳工联合会和工业组织大会 (AFL-CIO)、经济政策研究所 (EPI)、服务业雇员国际联盟 (SEIU)、国家就业法项目 (NELP) 和联合食品和商业工人工会 (UFCW)。该立法的原始共同提案人包括众议员 Rashida Tlaib (MI-13)、众议员 Jan Schakowsky (IL-9) 和众议员 Chuy Garcia (IL-4)。", "note_en": "Washington, DC – Today, Rep. Mark Takano (D-Calif.) introduced legislation that would reduce the standard workweek from 40 hours to 32 hours by lowering the maximum hours threshold for overtime compensation for non-exempt employees under the Fair Labor Standards Act (FLSA).\n  A shorter workweek would benefit both employers and employees alike. Pilot programs run by governments and businesses across the globe have shown promising results as productivity climbed and workers reported better work-life balance, less need to take sick days, heightened morale, and lower childcare expenses because they had more time with their family and children. Shorter workweeks have also been shown to further reduce healthcare premiums for employers, lower operational costs for businesses, and have a positive environmental impact in some of these studies.\n  “At a time when the nature of work is rapidly changing, it’s incumbent upon us to explore all possible means of ensuring our modern business model prioritizes productivity, fair pay, and an improved quality of life for workers,”  said Rep. Mark Takano. “I am introducing this legislation to reduce the standard workweek to 32 hours because – now more than ever – people continue to work longer hours while their pay remains stagnant. We cannot continue to accept this as our reality. Many countries and businesses that have experimented with a four-day workweek found it to be an overwhelming success as productivity grew and wages increased. After the COVID-19 pandemic left so many millions of Americans unemployed or underemployed, a shorter workweek will allow more people to participate in the labor market at better wages. This is a groundbreaking piece of legislation and I’m grateful to the organizations and colleagues that firmly stand behind it. I look forward to continuing the work on this issue so that people may experience the best possible working conditions – the working conditions they deserve.”\n  “As workers become more and more productive, we deserve better pay and more time off,”  said Richard Trumka, President of the AFL-CIO. “Reducing overall working time without any reduction in pay – through shorter workdays and a four-day workweek – makes all the sense in the world because it spreads work hours to more workers and minimizes unemployment. This could be a key mechanism to help ensure that the benefits of technological progress are shared broadly by working people.”\n  “Work hours are highly unequal. Millions of people want to work more hours to earn more income while others want to work less to achieve a healthier work/life balance. A 32-hour work week will directly help those trying to achieve greater work/life balance, while freeing up hours that can be picked up by involuntarily part-time workers. In addition to that, shorter work weeks have important environmental benefits. Reducing Americans’ average work week is a key step towards achieving a better society,”  said the Economic Policy Institute.\n  This bill has been endorsed by the American Federation of Labor and Congress of Industrial Organizations (AFL-CIO), the Economic Policy Institute (EPI), Service Employees International Union (SEIU), the National Employment Law Project (NELP), and the United Food and Commercial Workers Union (UFCW).\n  Original co-sponsors of this legislation include Rep. Rashida Tlaib (MI-13), Rep. Jan Schakowsky (IL-9), and Rep. Chuy Garcia (IL-4).", "posttime": "2021-08-02 23:17:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "standard", "title": "高野众议员通过立法将标准工作周减少到 32 小时", "title_en": "Rep. Takano Introduces Legislation to Reduce the Standard Workweek to 32 Hours", "transed": 1, "url": "https://takano.house.gov/newsroom/press-releases/rep-takano-introduces-legislation-to-reduce-the-standard-workweek-to-32-hours", "via": "", "real_tags": ["standard"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章是对涉及该主题的论文内容的总结，大部分引用自 1983 年、1993 年和 1997 年的论文，并有一些版本，对现在和未来的引用取决于论文，但应该很容易推断。请参阅来源部分结尾。 1981 年，日本出现了名为第五代计算机系统 (FGCS) 的政府工业项目，这是出乎意料和戏剧性的。国际贸易和工业部 (MITI) 及其在电工实验室 (ETL) 的一些科学家计划了一个规模非凡的项目，预测技术上的大胆和对经济和社会的重大影响。这个项目激发了日本人的想象力（例如，Junichiro Uemae 的一本讲述其诞生的日文书名为“日本梦”）。它还引起了美国和欧洲的政府和计算机行业的注意，他们已经对日本对重要行业的收购持谨慎态度。 Feigenbaum 和 McCorduck 合着的《第五代》一书是这种关注的广泛阅读表现。日本的计划宏伟但不切实际，并立即被负责该项目的MITI规划人员和ETL科学家视为如此。\n1982 年 5 月发布了修订后的规划文件，为第五代项目设定了更现实的目标。第四代：IBM E 系列，于 1979 年推出，以及其他使用超大规模集成电路的 VLSI，其计算能力大幅增加，但仍基于冯诺依曼架构，需要特定和精确的命令来执行任务。 FGCS 被设想为一台计算机，它可以利用它在其数据库中积累的知识，从不完整的指令中进行推断。 FGCS 基于一种不同于前四代计算机的架构，该架构由冯诺依曼发明并由 IBM 等进行商业开发。增加智能和易用性，使它们能够更好地帮助人类。使用语音、语音、图形、图像和文档进行输入和输出，使用日常语言，将知识存储到实际应用以及学习和推理能力中。减轻软件生成的负担，使高层次的需求规范足以进行自动处理，使程序验证成为可能，从而提高软件的可靠性。此外，必须改进编程环境，同时还应该可以使用现有的软件资产。提升整体功能和性能，满足社会需求。构建轻巧、紧凑、高速、大容量的计算机，能够满足日益多样化和适应性的提高，具有高度的可靠性和复杂的功能。\n该项目的目标是实现新的计算机系统，以满足 1990 年代的预期要求。每个人都会在日常生活中不假思索地使用计算机。为此，必须创建一个环境，在该环境中，人和计算机可以轻松地使用多种信息媒体（例如语音、文本和图形）进行自由交流。智能界面功能必须能够处理自然语言、语音、图形和图像的人/机通信，以便信息可以以人类自然的方式进行交换。还将研究和开发专用硬件处理器和高性能接口设备，以有效执行语音、图形和图像数据的处理。将开发几个基本应用系统，以展示 FGCS 的有用性和系统评估。它们是机器翻译系统、咨询系统、智能编程系统和智能 VLSI-CAD 系统。在硬件中实现推理、关联和学习的基本机制，使其成为第五代计算机的核心功能。优势利用模式识别和人工智能研究成果，实现人机自然的人机界面。\n有必要开发能够用作使用规则和断言来处理知识信息的核心处理器的高性能推理机。现有的人工智能技术已经发展为主要基于 LISP。然而，由于以下考虑，采用类似Prolog的逻辑编程语言作为软件和硬件之间的接口似乎更合适：VLSI技术的引入使得在硬件中实现高级功能成为可能；为了进行并行处理，需要采用适合并行处理的新语言；这些语言必须与关系数据模型有很强的亲和力。将研究和开发用于并行处理新知识库的并行处理硬件架构，该架构基于包含高性能分层存储系统的关系数据库机器，以及并行关系操作和知识操作的机制。由于关系数据模型与逻辑程序设计有很强的亲和力，知识库系统有望在第五代计算机系统中具有一些知识库设施的关系数据库机上实现。关系演算与一阶谓词逻辑关系密切。关系代数在描述查询方面具有与关系演算相同的能力。这些是将关系代数机视为知识库机器的主要候选者的原因。这种创新和大规模的研发在世界任何地方都没有先例。因此，我们将不得不通过漫长的试错过程向目标系统迈进，在此过程中产生许多独创的想法。对于 1990 年代在众多应用程序级别上使用的计算机，它们必须从以数值计算为中心的机器发展为能够评估信息的含义并理解要解决的问题的机器。\n与数字数据相比，非数字数据（如句子、演讲、图表和图像）将被大量使用。预计计算机将主要在未来的应用中处理非数字数据。然而，目前的计算机在非数字数据处理方面的能力远低于数字数据处理能力。导致重新思考刚刚描述的传统计算机设计理念的必要性的关键因素包括： VLSI 的出现大大降低了硬件成本，并且允许使用尽可能多的硬件的环境将很快变得可行。要利用超大规模集成电路量产的效果，就必须追求并行处理。目前的计算机在处理语音、文本、图形、图像等非数值数据的基本功能，以及推理、联想、学习等人工智能类型的处理方面，表现极差。 FGCS的研发目标是解决问题和推理系统、知识库系统等知识信息处理的核心功能，这些功能在常规计算机系统的框架内是无法处理的。\n随着 1992 年 6 月 1 日至 5 日在日本东京举行的第四代第五代计算机系统会议，一个时代结束了。从那时起十年过去了，ICOT 发展到大约 100 名研究人员，花费了大约 540 亿日元，约合 4.5 亿美元。在这十年中，已经构建了各种各样的机器，从专用 PSI 机器，即个人顺序推理机，到处理器和内存的多个星座，范围从 16 到 512 个处理元件共同形成 PIM 系列，即并行推理机。有些人反应过度，甚至谈到技术战争。今天又有人反应过度了。当他们看到他们的恐惧没有成为现实时，他们认为这个项目是失败的。 PIM 代表了一个研究并行符号计算权衡的机会，这在其他地方是不存在的。 KL1 是一种有趣的并行符号计算模型，但不太可能引起美国研究人员的想象。 PIMOS 在控制分配和通信方面有一些有趣的想法，美国研究人员应该认真评估。 ICOT 已经显示出非规则计算（即那些不适合矢量化流水线的数据并行性）的显着（即接近线性）加速。\nICOT 为人工智能、基于知识的系统和创新的计算机架构创造了积极的氛围。由于ICOT的存在，一些最优秀的年轻研究人员进入了这些领域。 ICOT 在推进基于知识的系统或人工智能本身的状态方面做得很少。 ICOT 在自然语言领域的目标要么被放弃，要么被转移到 EDR。 ICOT的努力与AI​​技术的商业应用几乎没有关系。语言的选择至关重要。 ICOT 的架构一直在商业上失败。需要开关编程模型和购买成本低的硬件。 ICOT 硬件落后于美国的硬件创新（例如 MIT LispMachine 及其后代和 MIT Connection Machine 及其后代）。早期的文件讨论了非常大的知识库、大规模自然语言理解和图像理解的管理，重点是知识的获取和学习。这些方向中的每一个似乎都已被放弃，降级为次要地位，被吸收到并行性工作中或转移到其他研究计划中。\nICOT 的工作往往是一个封闭的世界。在他们研究的这些连续和并行阶段，都开发了一种新语言，该语言只能在 ICOT 硬件上使用。此外，ICOT 硬件一直是实验性的，不符合成本效益。这阻止了ICOT技术对实际工作产生任何影响或丰富。值得注意的是，并行处理的概念很少受到关注，而事实证明，这个概念对整个项目非常重要。首先，在我看来，FGCS 项目的最初目标将其重点从上面描述的主要是知识信息处理系统 KIPS，在人机交互方面具有很强的能力，例如自然语言处理，转变为以下内容：将问题转化为该问题的解决方案的过程应该很简单。通过利用复杂的（并行处理）技术，计算机应该很快。日本确实证明了它有为世界其他地区带头的远见。他们采取了明智的行动，将成果提供给国际公众免费使用，从而成为造福人类而不仅仅是为了自身利益的领导者。 FGCS 项目的主要成果和成功之一是它对日本信息技术研发基础设施的影响。\nICOT的技术成果令人瞩目。考虑到方法的新颖性，缺乏背景，需要解决的困难，完成的工作量带来了一些有趣的东西，这纯粹是惊人的；这在硬件和软件中都是如此。远景的实现，应该说是搞“大计划”，造福社会，绝对不是项目启动时某些人所预期的水平。这对我来说一点也不意外，也就是说，我从来不相信这个宏伟计划中非常重要的部分可以成功解决。总体而言，该项目产生了重大的科学影响，促进了全世界有关如何构建高级计算系统的知识。我同意该项目的国际影响并不像一开始希望的那么大。我想我们所有相信这个项目的方向的人，即开发基于逻辑编程的集成并行计算机系统，都希望在 10 年的时间结束时，逻辑编程方法的优越性将毋庸置疑地展现出来，商业应用这项技术的进展顺利。不幸的是，情况并非如此。尽管 ICOT 已经达到了技术目标，但它开发的应用程序足以证明该方法的实用性，但不能证明其具有决定性的优越性。请注意，政府支持的工业财团可能无法“解读市场”，尤其是从长远来看。有远见。愿景很重要：人们需要一个伟大的梦想，让早上起床变得值得。然而，我期待在项目结束时看到某些技术的“实际使用”。这可能以三种方式发生。\n第一种方法是拥有真实世界的应用程序，就用户而言；在现阶段只能看到其中的一小部分，尽管开发演示的努力不容小觑。第二个是为了计算机系统本身的利益。这似乎不会直接发生，至少现在不会，这令人失望，因为日本制造商至少作为人力资源提供者和分包商参与了 FGCS 项目。第三种方式是在研究发生的直接领域之外影响计算机科学：例如影响人工智能，影响软件工程等；目前还看不到很多，但有一些有希望的迹象。这个非凡项目的科学成就给我留下了深刻的印象。在我们的领域中，第一次通过单一语言实现硬件和软件设计的统一方法，即。 KL1。几乎令人难以置信的是，在大约两年半的时间里，有多少软件是直接或间接用 KL1 编写的。首先，语言本身是一种有趣的并行编程语言。 KL1 弥合了并行硬件和基于知识的应用程序之间的抽象差距。它也是一种旨在支持符号（与严格数字相反）并行处理的语言。它是一种扩展的逻辑编程语言，包括现实编程所需的功能（如数组）。但是，还应该指出的是，与许多其他逻辑编程语言一样，KL1 对一些贫困的牙友来说会显得很笨拙。\n其次是为此类语言开发一套优化技术。 KL1 等语言的有效实现需要全新的编译器优化技术。第三个成就是注意到硬件在哪些方面可以在支持语言实现方面发挥重要作用。参与该项目的主要公司有富士通、日立、三菱电机、NEC、冲、东芝、松下电机工业和夏普。最常引用的原因是：ICOT 硬件成本高、选择 Prolog 作为语言以及对并行性的关注。然而，我们的主持人几乎经常提到 ICOT 的间接影响：建立一个以“第五代技术”为重点的国家项目引起了人工智能和知识型技术的极大关注。一些网站评论了这样一个事实，即这吸引了更好的人进入该领域，并为以前被视为深奥的事物增添了一种受人尊敬的光环。在项目的前 3 年阶段，构建了个人序列推理机 (PSI 1) 并为其开发了一个相当丰富的编程环境。\n与 MIT 机器一样，PSI 是一种微程序处理器，旨在支持非符号处理语言。符号处理语言为机器发挥了广泛的“内核语言”的作用，涵盖从低级操作系统细节到应用软件的范围。硬件及其微代码旨在高效执行内核语言。这台机器是一个相当高性能的工作站，具有良好的图形、网络和复杂的编程环境。使PSI与众不同的是语系的选择。与面向数字处理的更传统的机器或面向 LISP 的 MIT 机器不同，为 PSI 选择的语言是 Prolog。为内核语言选择逻辑编程框架是一种激进的选择，因为基本上没有任何地方使用逻辑编程作为实现核心系统功能的框架的经验。在 ICOT 和合作设施中建造并安装了数百台 PSI 机器；而且这台机器也被商业化了。然而，即使与美国的专业 Lisp 硬件相比，PSI 机器也非常昂贵。 PSI（和其他 ICOT）机器有许多功能，其目的是支持实验，但其成本/收益权衡并未作为设计的一部分进行评估；这些机器本质上是非商业性的。第二个 3 年阶段见证了 PSI 2 机器的开发，它比 PSI 1 提供了显着的加速。在第 2 阶段即将结束时，构建了一个并行机器（多 PSI）以允许对 FGHC 范式进行实验。这包括一个 8 × 8 网格的 PSI 2 处理器，运行 ICOTFlat Guarded Horn Clause 语言 KL1。所有 PIM 的抽象模型由松散耦合的网络连接紧密耦合的处理器集群组成。每个集群实际上都是一个共享内存多处理器；集群中的处理器共享内存总线并实现缓存一致性协议。其中三个 PIM 是大型并行机。即使承认 PIM 处理器芯片的特殊架构特性可能会导致显着的加速（说 3 倍是非常慷慨的），但与商业最先进的技术相比，这些芯片令人失望。另一个性质完全不同的最重要的问题是，ICOT 是否明智地将如此多的精力集中在构建用于逻辑编程的专用硬件上，而不是构建或使用现成的、不针对任何特定用途的通用硬件。语言或编程范式。设计专用实验硬件的问题在于，任何可以获得的性能优势很可能会被商用机器（顺序和并行）的持续快速发展所取代。 ICOT 的 PSI 机器现在即使没有通过先进的 RISC 处理器在 Prolog 和 CCL 性能方面得到改善，也可以与之匹敌。\n许多人对专用处理器和语言专用机器的需求持怀疑态度。 LISP 机器失败，因为 LISP 与通用机器上的良好编译器一样快或几乎一样快。PSI 机器肯定没有市场，因为最新的 Prolog 编译器，编译成 RISC 指令并使用抽象解释来帮助优化代码，提供可比的性能。将 PIM 与 Thinking Machines Inc. 的 CM-5 进行比较很有趣；这是一个大规模并行机器，它是麻省理工学院 ConnectionMachine 项目的后代。 CM-5 是该开发线中的第三款商用机器。虽然连接机项目......", "note_en": "This post is a summary of content from papers covering the topic, it&#39;s mostlyquotes from the papers from 1983, 1993 and 1997 with some edition, referencesto the present and future depend on the paper but should be easy to deduce.See the Sources section at the end.\n  In 1981, the emergence of the government-industry project in Japan known asFifth Generation Computer Systems (FGCS) was unexpected and dramatic.\n The Ministry of International Trade and Industry (MITI) and some of itsscientists at Electrotechnical Laboratory (ETL) planned a project of remarkablescope, projecting both technical daring and major impact upon the economy andsociety.\n This project captured the imagination of the Japanese people (e.g. a book inJapanese by Junichiro Uemae recounting its birth was titled The Japanese Dream).\n It also captured the attention of the governments and computer industries ofthe USA and Europe, who were already wary of Japanese takeovers of importantindustries.\n A  book by Feigenbaum and McCorduck, The Fifth Generation, was a widely-readmanifestation of this concern.\n The Japanese plan was grand but it was unrealistic, and was immediately seen tobe so by the MITI planners and ETL scientists who took charge of the project.\n A revised planning document was issued in May 1982 that set more realisticobjectives for the Fifth Generation Project.\n Fourth generation: IBM E Series, introduced in 1979, and others that usedvery large-scale integrated circuits, VLSI which have massively increasedcomputational capacity but are still based on the Von Neumann architectureand require specific and precise commands to perform a task.\n FGCS was conceived as a computer that can infer from an incomplete instruction,by making use of the knowledge it has accumulated in its database.\n FGCS was based on an architecture distinct from that of the previous fourgenerations of computers which had been invented by Von Neumann andcommercially developed by IBM among others.\n Increased intelligence and ease of use so that they will be better able toassist man.  Input and output using speech, voice, graphics, images anddocuments, using everyday language, store knowledge to practical use and to the ability to learn and reason.\n To lessen the burden of software generation in order that  a high levelrequirements specification is sufficient for automatic processing, so thatprogram verification is possible thus increasing the reliability ofsoftware. Also the programming environment has to be improved while itshould also be possible to use existing software assets.\n To improve overall functions and performance to meet social needs. Theconstruction of light, compact, high-speed, large capacity computers whichare able to meet increased diversification and adaptability, which arehighly reliable and offer sophisticated functions.\n The objective of this project is to realise new computer systems to meet theanticipated requirements of the 1990s.\n Everybody will be using computers in daily life without thinking anything ofit. For this objective, an environment will have to be created in which  a manand a computer find it easy to communicate freely using multiple informationmedia, such as speech, text, and graphs.\n   The intelligent interface function will have to be capable of  handlingman/machine communication in natural languages, speeches, graphs, and images sothat information can be exchanged in a way natural to a man.\n There will also be research into and development of  dedicated hardwareprocessors and high-performance interface equipment for efficiently executingprocessing of speech, graph, and image data.\n Several basic application systems will be developed with the intention ofdemonstrating the usefulness of the FGCS and the system evaluation. These are machine translation systems, consultation systems, intelligent programmingsystems and an intelligent VLSI-CAD system.\n Realisation of basic mechanisms for  inference, association, and learning inhardware, making them the core functions of the Fifth Generation computers.\n  Advantageous use of pattern recognition and artificial intelligence researchachievements, in order to realise man/machine interfaces that are natural toman.\n It will be necessary to develop high performance inference machines capable ofserving as core processors that use rules and assertions to process knowledgeinformation.\n Existing artificial intelligence technology has been developed to be basedprimarily on LISP. However,  it seems more appropriate to employ a Prolog-likelogic programming language as the interface between software and hardware dueto the following considerations: the introduction of VLSI technology madepossible the implementation of high level functions in hardware; in order toperform parallel processing, it will be necessary to adopt new languagessuitable for parallel processing; such languages will have to have a strongaffinity with relational data models.\n Research and development will be conducted for  a parallel processing hardwarearchitecture intended for parallel processing of new knowledge bases, and whichis based on a relational database machine that includes a high-performancehierarchical memory system, and  a mechanism for parallel relational operationsand knowledge operations.\n The knowledge base system is expected to be implemented on a relationaldatabase machine which has some knowledge base facilities in the FifthGeneration Computer System, because the relational data model has a strongaffinity with logic programming.\n Relational calculus has a close relation with the first order predicate logic.Relational algebra has the same ability as relational calculus in thedescription of a query. These are reasons for considering a relational algebramachine as the prime candidate for a knowledge base machine.\n There is no precedent for this innovative and large-scale research anddevelopment anywhere in the world. We will therefore be obliged to move towardthe target systems through a lengthy process of trial and error, producing manyoriginal ideas along the way.\n  For computers to be employed at numerous application levels in the 1990s,  theymust evolve from machines centered around numerical computations to machinesthat can assess the meaning of information and understand the problems to be solved.\n Non-numeric data such as sentences, speeches, graphs, and images will be usedin tremendous volume compared to numerical data.\n Computers are expected to deal with non-numeric data mainly in futureapplications. However, present computers have much less capability innon-numeric data processing than in numeric data processing.\n The key factors leading to the necessity for rethinking the conventionalcomputer design philosophy just described include the following:\n The emergence of VLSI reduces hardware costs substantially, and anenvironment permitting the use of as much hardware as is required willshortly be feasible.\n To take advantage of the effect of VLSI mass production, it will benecessary to pursue parallel processing.\n Current computers have extremely poor performance in basic functions forprocessing speeches, texts, graphs, images and other nonnumerical data, andfor artificial intelligence type processing such as inference, association,and learning.\n The research and development targets of the FGCS are such core functions ofknowledge information processing as problem-solving and inference systems andknowledge-base systems that cannot be handled within the framework ofconventional computer systems.\n With the Fourth Conference on Fifth Generation Computer Systems, held June 1-5,1992 in Tokyo, Japan, an era came to an end.\n  Since then ten years have passed in which ICOT grew to about  100 researchersand spent about 54 billion Yen, that is some  450 million US$. In these tenyears  a large variety of machines have been built ranging from the specialpurpose PSI machine, that is a personal sequential inference machine, toseveral constellations of processors and memory ranging from 16 to 512processing elements together forming the PIM family, that is the ParallelInference Machine.\n Some people overreacted and spoke even of a technological war. Today somepeople again overreact. As they see that their fears have not materialized,they regard the project as a failure.\n  The PIMs represent an opportunity to study tradeoffs in parallel symboliccomputing which does not exist elsewhere.\n KL1 is an interesting model for parallel symbolic computation, but one whichis unlikely to capture the imagination of US researchers.\n PIMOS has interesting ideas on control of distribution and communicationwhich US researchers should evaluate seriously.\n   ICOT has shown significant (i.e. nearly linear) acceleration of non regularcomputations (i.e. those not suitable for data parallelism of vectorizedpipelining).\n ICOT created a positive aura for AI, Knowledge Based Systems, and innovativecomputer architectures. Some of the best young researchers have entered thesefields because of the existence of ICOT.\n ICOT has done little to advance the state of knowledge based systems, orArtificial Intelligence per se.\n ICOT&#39;s goals in the area of natural language were either dropped or spun outto EDR.\n   ICOT&#39;s efforts have had little to do with commercial application of AItechnology. Choice of language was critical.\n ICOT&#39;s architectures have been commercial failures. Required both a switch inprogramming model and the purchase of cost ineffective hardware.\n ICOT hardware has lagged behind US hardware innovation (e.g. the MIT LispMachine and its descendants and the MIT Connection Machine and itsdescendants).\n The early documents discuss the management of very large knowledge bases, oflarge scale natural language understanding and image understanding with astrong emphasis on knowledge acquisition and learning. Each of these directionsseems to have been either dropped, relegated to secondary status, absorbed intothe work on parallelism or transferred to other research initiatives.\n The ICOT  work has tended to be a world closed in upon itself. In both thesequential and parallel phases of their research, there has been a new languagedeveloped which is only available on the ICOT hardware. Furthermore, the ICOT hardware has been experimental and not cost effective. This has prevented theICOT technology from having any impact on or enrichment from the practicalwork.\n It is remarkable how little attention is given to the notion of parallelprocessing, while this notion turned out to be of such great importance for thewhole project.\n First, in my opinion the original goal of the FGCS project changed its emphasisfrom what has been described above as primarily a knowledge informationprocessing system, KIPS, with very strong capabilities in man-machineinteraction, such as natural language processing, into the following:\n     The intellectual process of translating a problem into the solution of thatproblem should be simple. By exploiting sophisticated (parallel processing)techniques the computer should be fast.\n Japan has indeed proved that it has the vision to take a lead for the rest ofthe world.\n They acted wisely and offered the results to the international public for freeuse, thus acting as a leader to the benefit of mankind and not only for its ownself-interest.\n One of the major results and successes of the FGCS project is its effect on theinfrastructure of Japanese research and development in information technology.\n The technical achievements of ICOT are impressive. Given the novelty of theapproaches, the lack of background, the difficulties to be solved, the amountof work done which has delivered something of interest is purely amazing; thisis true in hardware as well as in software.\n The fulfillment of the vision, should I say working on the &#34;grand plan&#34; andbringing benefits to the society, is definitely not at the level that somepeople anticipated when the project was launched. This is not, to me, asurprise at all, i.e. I have never believed that very significant parts ofthis grand plan could be successfully tackled.\n Overall, the project has had a major scientific impact, in furthering knowledgethroughout the world of how to build advanced computing systems.\n I agree that the international impact of the project was not as large as onehoped for in the beginning.  I think all of us who believed in the directiontaken by the project, i.e. developing integrated parallel computer systemsbased on logic programming, hoped that by the end of the 10 years&#39; period thesuperiority of the logic programming approach will be demonstrated beyonddoubt, and that commercial applications of this technology will be well ontheir way. Unfortunately, this has not been the case. Although ICOT has reachedits technological goals, the applications it has developed were sufficient todemonstrate the practicality of the approach, but not its conclusivesuperiority.\n Be aware that government-supported industrial consortia may not be able to&#39;read the market&#39;, particularly over the long term.\n   Have vision. The vision is critical: people need a big dream to make itworthwhile to get up in the morning.\n I  was expecting however to see &#39;actual use&#39; of some of the technology at theend of the project. There are three ways in which this could have happened.\n The first way would have been to have real world applications, in user terms;only little of that can be seen at this stage, even though the efforts todevelop demonstrations are not be underestimated.\n The second would have been to the benefit of computer systems themselves. Thisdoes not appear to be directly happening, at least not now and this isdisappointing if only because the Japanese manufacturers have been involved inthe FGCS project, at least as providers of human resources and assubcontractors.\n The third way would have been to impact computer science outside of the directfield in which this research takes place: for example to impact AI, to impactsoftware engineering, etc.; not a lot can yet be seen, but there are promisingsigns.\n I am genuinely impressed by the scientific achievements of this remarkableproject.  For the first time in our field, there is a uniform approach to bothhardware and software design through a single language, viz. KL1.\n It is nearly unbelievable how much software was produced in about two and ahalf years written directly or indirectly in KL1.\n  First the language itself is an interesting parallel programming language. KL1bridges the abstraction gap between parallel hardware and knowledge basedapplication programs. Also it is a language designed to support symbolic (asopposed to strictly numeric) parallel processing. It is an extended logicprogramming language which includes features needed for realistic programming(such as arrays).\n However, it should also be pointed out that like many other logicprogramming languages, KL1 will seem awkward to some and impoverished toothers.\n Second is the development of a body of optimization technology for suchlanguages. Efficient implementation of a language such as KL1 required a wholenew body of compiler optimization technology.\n The third achievement is noticing where hardware can play a significant role insupporting the language implementation.\n The main Companies involved in the project were  Fujitsu, Hitachi, MitsubishiElectric, NEC, Oki, Toshiba, Matsushita Electric Industrial and Sharp.\n  The reasons most frequently cited were: The high cost of the ICOT hardware, thechoice of Prolog as a language and the concentration on parallelism.\n However, nearly as often our hosts cited the indirect effect of ICOT: theestablishment of a national project with a focus on &#39;fifth generationtechnology&#39; had attracted a great deal of attention for Artificial Intelligenceand knowledge based technology.\n Several sites commented on the fact that this had attracted better people intothe field and lent an aura of respectability to what had been previouslyregarded as esoteric.\n During the first 3 year phase of the project, the Personal Sequential Inferencemachine (PSI 1) was built and a reasonably rich programming environment wasdeveloped for it.\n Like the MIT machine, PSI was a microprogrammed processor designed to support asymbolic processing language. The symbolic processing language played the roleof a broad spectrum &#39;Kernel language&#39; for the machine, spanning the range fromlow level operating system details up to application software. The hardware andits microcode were designed to execute the kernel language with highefficiency. The machine was a reasonably high performance work station withgood graphics, networking and a sophisticated programming environment. Whatmade PSI different was the choice of language family. Unlike more conventionalmachines which are oriented toward numeric processing or the MIT machine whichwas oriented towards LISP the language chosen for PSI was Prolog.\n The choice of a logic programming framework for the kernel language was aradical one since there had been essentially no experience anywhere with usinglogic programming as a framework for the implementation of core systemfunctions.\n Several hundred PSI machines were built and installed at ICOT and collaboratingfacilities; and the machine was also sold commercially. However, even comparedto specialized Lisp hardware in the US, the PSI machines were impracticallyexpensive. The PSI (and other ICOT) machines had many features whose purposewas to support experimentation and whose cost/benefit tradeoff had not beenevaluated as part of the design; the machines were inherently non-commercial.\n The second 3 year phase saw the development of the PSI 2 machine which provideda significant speedup over PSI 1. Towards the end of Phase 2 a parallel machine(the Multi-PSI) was constructed to allow experimentation with the FGHCparadigm. This consisted of an 8 × 8 mesh of PSI 2 processors, running the ICOTFlat Guarded Horn Clause language KL1.\n The abstract model of all PIMs consists of a loosely coupled network connectingclusters of tightly coupled processors. Each cluster is, in effect, a sharedmemory multiprocessor; the processors in the cluster share a memory bus andimplement a cache coherency protocol. Three of the PIMs are massively parallelmachines.\n  Even granting that special architectural features of the PIM processor chipsmay lead to a significant speedup (say a factor of 3 to be very generous),these chips are disappointing compared to the commercial state of the art.\n Another most important issue, of a completely different nature, is  the questionof whether ICOT was wise to concentrate so much effort on building specialisedhardware for logic programming, as opposed to building, or using off the shelf,more general purpose hardware not targeted at any particular language orprogramming paradigm. The problems with designing specialised experimentalhardware is that any performance advantage that can be gained is likely to berapidly overtaken by the ever-continuing rapid advance of commerciallyavailable machines, both sequential and parallel. ICOT&#39;s PSI machines are nowequalled if not bettered for Prolog and CCL performance by advanced RISCprocessors.\n Many are skeptical about the need for special purpose processors and languagededicated machines. The LISP machines failed because LISP was as fast, ornearly as fast, implemented via a good compiler on a general purpose machine.The PSI machines surely do not have a market because the latest Prologcompilers, compiling down to RISC instructions and using abstractinterpretation to help optimize the code, deliver comparable performance.\n It is interesting to compare the PIMs to Thinking Machines Inc.&#39;s CM-5; this isa massively parallel machine which is a descendant of the MIT ConnectionMachine project. The CM-5 is the third commercial machine in this line ofdevelopment.\n Although the Connection Machine proj\n......", "posttime": "2021-08-02 23:16:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,generation,机器", "title": "日本的第五代计算机系统：成功还是失败？", "title_en": "Japan's Fifth Generation Computer Systems: Success or Failure?", "transed": 1, "url": "https://instadeq.com/blog/posts/japans-fifth-generation-computer-systems-success-or-failure/", "via": "", "real_tags": ["日本", "机器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071188, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法国情报调查人员证实，在三名记者的电话中发现了 Pegasus 间谍软件，其中包括该国国际电视台 France 24 的一名高级工作人员。 Pegasus 项目的调查——一个由 17 家媒体机构组成的财团，包括卫报。总部位于巴黎的非营利媒体组织 Forbidden Stories 和国际特赦组织最初可以访问泄露的 50,000 个号码列表，据信自 2016 年以来，这些号码已被以色列公司 NSO Group 的客户确定为感兴趣的人，并且与他们的媒体合作伙伴共享访问权限。法国国家信息系统安全机构 (Anssi) 在电视记者的电话上发现了 NSO Group 黑客间谍软件的数字痕迹，并将其调查结果传达给巴黎检察官办公室，后者正在监督对可能的黑客行为的调查。 Anssi 还在法国调查网站 Mediapart 的调查记者 Lénaïg Bredoux 和该网站的主管 Edwy Plenel 的电话上找到了 Pegasus。数据泄露是一份包含 50,000 多个电话号码的清单，自 2016 年以来，据信这些电话号码已被 NSO Group 的政府客户选为感兴趣的人，该集团销售监控软件。数据还包含选择数字或输入系统的时间和日期。位于巴黎的非营利新闻组织 Forbidden Stories 和国际特赦组织最初可以访问该列表，并与包括卫报在内的 16 家媒体组织共享访问权限。作为 Pegasus 项目的一部分，80 多名记者在几个月的时间里一起工作。该项目的技术合作伙伴大赦国际安全实验室进行了取证分析。该财团认为，数据表明 NSO 的政府客户在可能的监视之前确定的潜在目标。虽然数据表明了意图，但数据中是否存在数字并不能表明是否有人试图用 Pegasus（公司的签名监视工具）等间谍软件感染手机，或者是否有任何尝试成功。数据中存在极少数固定电话和美国号码，NSO 表示使用其工具“技术上不可能”访问这些数据，这表明 NSO 客户选择了一些目标，即使它们不会被 Pegasus 感染。然而，对名单上有数字的一小部分手机样本的法医检查发现，数据中某个数字的时间和日期与 Pegasus 活动的开始之间存在紧密的相关性——在某些情况下，只有几秒钟。国际特赦组织检查了 67 部疑似受到攻击的智能手机。其中，23 人被成功感染，14 人表现出企图渗透的迹象。对于剩下的 30 个，测试没有定论，在几个案例中是因为手机已被更换。其中 15 部手机是 Android 设备，没有一部显示成功感染的证据。但是，与 iPhone 不同的是，使用 Android 的手机不会记录大赦国际侦探工作所需的各种信息。三款 Android 手机显示出定位迹象，例如与 Pegasus 相关的 SMS 消息。\n国际特赦组织与多伦多大学专门研究 Pegasus 的研究小组 Citizen Lab 共享了四部 iPhone 的“备份副本”，后者证实它们显示出 Pegasus 感染的迹象。 Citizen Lab 还对 Amnesty 的法医方法进行了同行评审，发现它们是合理的。虽然数据被组织成集群，表示单个 NSO 客户，但它没有说明哪个 NSO 客户负责选择任何给定的数字。 NSO 声称向 40 个国家/地区的 60 个客户出售其工具，但拒绝透露他们的身份。通过仔细检查泄露数据中个人客户的目标模式，媒体合作伙伴能够确定被认为负责选择目标的 10 个政府：阿塞拜疆、巴林、哈萨克斯坦、墨西哥、摩洛哥、卢旺达、沙特阿拉伯、匈牙利、印度，和阿拉伯联合酋长国。 Citizen Lab 还发现了所有 10 人都是 NSO 客户的证据。您可以在此处阅读 NSO Group 的完整声明。该公司一直表示无法访问其客户目标的数据。 NSO 通过其律师表示，该财团对哪些客户使用该公司的技术做出了“错误的假设”。它说 50,000 的数字被“夸大了”，该列表不能是“政府使用 Pegasus 的目标”的数字列表。律师们表示，NSO 有理由相信该财团访问的列表“不是政府使用 Pegasus 定位的数字列表，而是可能是 NSO 集团客户用于其他目的的更大数字列表的一部分。目的”。他们说这是一个数字列表，任何人都可以在开源系统上搜索。在进一步提问后，律师们表示，该财团的调查结果是“基于对来自可访问和公开的基本信息的泄露数据的误导性解释，例如 HLR 查找服务，这些信息与 Pegasus 的客户目标清单或任何其他NSO 产品......我们仍然没有看到这些列表与任何与 NSO 集团技术使用相关的内容有任何关联”。发布后，他们解释说，他们认为“目标”是被 Pegasus 成功或尝试（但失败）感染的手机，并重申 50,000 部手机的列表太大，无法代表“目标”。 ”的飞马。他们说，名单上出现一个数字这一事实绝不能表明它是否已被选择使用 Pegasus 进行监视。术语 HLR 或归属位置寄存器是指操作移动电话网络所必需的数据库。此类寄存器记录电话用户的网络及其大致位置，以及在路由呼叫和短信中常规使用的其他识别信息。电信和监控专家表示，有时可以在监控尝试的早期阶段使用 HLR 数据，以确定是否可以连接到电话。联盟了解 NSO 客户有能力通过 Pegasus 系统上的接口进行 HLR 查找查询。目前尚不清楚 Pegasus 运营商是否需要通过其界面进行 HRL 查找查询才能使用其软件；一位 NSO 消息人士强调，其客户可能有不同的原因——与 Pegasus 无关——通过 NSO 系统进行 HLR 查找。 Forbidden Stories 认为，在 NSO 的政府客户可能进行监视之前，全球至少有 180 名记者可能已被选为感兴趣的人。 France 24 的一位消息人士称，该广播公司发现其一名员工可能受到监控，“非常震惊”。 “我们对记者可能成为间谍的对象感到震惊和愤怒。我们不会躺着接受这个。将采取法律行动，”消息人士说。\n据《世界报》报道，这位常驻巴黎的法国 24 记者因“最终受到监视”而被选中。该报称，警方专家发现该间谍软件曾三度被用于针对记者的电话：2019 年 5 月、2020 年 9 月和 2021 年 1 月。 Bredoux 告诉卫报，调查人员在她和 Plenel 的手机上都发现了 Pegasus 间谍软件的痕迹。她说，长期怀疑他们已成为目标的证实与那些被认为是企图监视他们的人的一再否认相矛盾。 “它结束了一切都是谎言和假新闻的想法。这是我们需要的证据，”布雷杜说。在泄露的数据中出现了总统埃马纽埃尔·马克龙、前总理爱德华·菲利普和包括司法和外交事务在内的 14 名在职部长的手机号码后，法国政界人士表示震惊。 Pegasus 项目的研究表明，摩洛哥可能是对马克龙及其高级团队感兴趣的国家，这引发了人们担心他们的手机被法国的亲密外交盟友之一选中。国家统计局表示，马克龙不是，也从来不是“其任何客户的目标”，这意味着该公司否认他被选中进行监视或使用 Pegasus 进行监视。该公司补充说，名单上出现一个数字的事实绝不表明该数字是否被选择用于使用 Pegasus 进行监控。摩洛哥“断然”拒绝并谴责它所谓的“毫无根据和虚假的指控”，即它使用飞马座监视国际知名人物。政府的律师上周表示，它已在巴黎对大赦国际和 Forbidden Stories 提出诽谤诉讼。 Bredoux 补充说：“意识到这一点需要一些时间，但想到有人被监视，你丈夫和孩子的照片，你的朋友——他们都是间接受害者——被人查看，这令人非常不快；”没有你可以逃脱的空间。这非常令人不安。”\n但布雷杜在 2015 年写了一系列关于摩洛哥内部情报局局长阿卜杜拉蒂夫·哈穆奇 (Abdellatif Hammouchi) 的文章，她表示，她主要担心的是记者的接触。 “作为记者，更令人担忧的是消息来源和联系人可能已被泄露，这不仅侵犯了您的隐私和私人生活，而且侵犯了新闻自由。 “我们的处境与摩洛哥的记者不同，而是像特洛伊木马一样被利用来对付他们，所以我的想法与我们在摩洛哥的同事同在。 “我的电话可以用来帮助攻击这些每天打架的记者，这让我非常生气。”上个月，当 Pegasus 项目的消息传出时，马克龙下令进行多项调查。法国总理让·卡斯特克斯 (Jean Castex) 表示，爱丽舍宫在发誓要“揭露所有真相”后，已“下令进行一系列调查”。上周在以色列，当局检查了国家统计局的办公室。周日，以色列报纸 Haaretz 报道称，网络公司已经召开了一次“紧急”会议，以评估这些披露对国内部门的影响。目前尚不清楚哪些公司将参加会议。 Pegasus 是由 NSO Group 开发、销售并授权给世界各地政府的黑客软件或间谍软件。该恶意软件能够感染数十亿部运行 iOS 或 Android 操作系统的手机。它使间谍软件的操作员能够提取消息、照片和电子邮件、记录通话并秘密激活麦克风。\n泄露列表中出现的数字并不意味着它受到了企图或成功的黑客攻击。根据对大规模数据泄露的调查，世界各地的人权活动家、记者和律师已被威权政府选为可能使用黑客软件进行侵入性监视的候选人。调查表明 Pegasus 被广泛且持续地滥用，NSO 坚称其仅用于打击犯罪分子和恐怖分子。", "note_en": "French intelligence investigators have confirmed that Pegasus spyware has been found on the phones of three journalists, including a senior member of staff at the country’s international television station  France 24.\n It is the first time an independent and official authority has corroborated the findings of an international investigation by  the Pegasus project – a consortium of 17 media outlets, including the Guardian. Forbidden Stories, a Paris-based nonprofit media organisation, and Amnesty International initially had access to a leaked list of 50,000 numbers that, it is believed, have been identified as those of people of interest by clients of Israeli firm NSO Group since 2016, and shared access with their media partners.\n  France’s national agency for information systems security (Anssi) identified digital traces  of NSO Group’s hacking spyware on the television journalist’s phone and relayed its findings to the Paris public prosecutor’s office, which is overseeing the investigation into possible hacking.\n Anssi also found Pegasus on telephones  belonging to Lénaïg Bredoux, an investigative journalist at the French investigative website Mediapart, and the site’s director, Edwy Plenel.\n The data leak is a list of more than 50,000 phone numbers that, since 2016, are believed to have been selected as those of people of interest by government clients of NSO Group, which sells surveillance software. The data also contains the time and date that numbers were selected, or entered on to a system. Forbidden Stories, a Paris-based nonprofit journalism organisation, and Amnesty International initially had access to the list and shared access with 16 media organisations including the Guardian. More than 80 journalists have worked together over several months as part of the Pegasus project. Amnesty’s Security Lab, a technical partner on the project, did the forensic analyses.\n  The consortium believes the data indicates the potential targets NSO’s government clients identified in advance of possible surveillance. While the data is an indication of intent, the presence of a number in the data does not reveal whether there was an attempt to infect the phone with spyware such as Pegasus, the company’s signature surveillance tool, or whether any attempt succeeded. The presence in the data of a very small number of landlines and US numbers, which NSO says are “technically impossible” to access with its tools, reveals some targets were selected by NSO clients even though they could not be infected with Pegasus. However, forensic examinations of a small sample of mobile phones with numbers on the list found tight correlations between the time and date of a number in the data and the start of Pegasus activity – in some cases as little as a few seconds.\n  Amnesty examined 67 smartphones where attacks were suspected. Of those, 23 were successfully infected and 14 showed signs of attempted penetration. For the remaining 30, the tests were inconclusive, in several cases because the handsets had been replaced. Fifteen of the phones were Android devices, none of which showed evidence of successful infection. However, unlike iPhones, phones that use Android do not log the kinds of information required for Amnesty’s detective work. Three Android phones showed signs of targeting, such as Pegasus-linked SMS messages.\n Amnesty shared “backup copies” of four iPhones with Citizen Lab, a research group at the University of Toronto that specialises in studying Pegasus, which confirmed that they showed signs of Pegasus infection. Citizen Lab also conducted a peer review of Amnesty’s forensic methods, and found them to be sound.\n  While the data is organised into clusters, indicative of individual NSO clients, it does not say which NSO client was responsible for selecting any given number. NSO claims to sell its tools to 60 clients in 40 countries, but refuses to identify them. By closely examining the pattern of targeting by individual clients in the leaked data, media partners were able to identify 10 governments believed to be responsible for selecting the targets: Azerbaijan, Bahrain, Kazakhstan, Mexico, Morocco, Rwanda, Saudi Arabia, Hungary, India, and the United Arab Emirates. Citizen Lab has also found evidence of all 10 being clients of NSO.\n  You can read NSO Group’s  full statement here. The company has always said it does not have access to the data of its customers’ targets. Through its lawyers, NSO said the consortium had made “incorrect assumptions” about which clients use the company’s technology. It said the 50,000 number was “exaggerated” and that the list could not be a list of numbers “targeted by governments using Pegasus”. The lawyers said NSO had reason to believe the list accessed by the consortium “is not a list of numbers targeted by governments using Pegasus, but instead, may be part of a larger list of numbers that might have been used by NSO Group customers for other purposes”. They said it was a list of numbers that anyone could search on an open source system. After further questions, the lawyers said the consortium was basing its findings “on misleading interpretation of leaked data from accessible and overt basic information, such as HLR Lookup services, which have no bearing on the list of the customers&#39; targets of Pegasus or any other NSO products ... we still do not see any correlation of these lists to anything related to use of NSO Group technologies”. Following publication, they explained that they considered a &#34;target&#34; to be a phone that was the subject of a successful or attempted (but failed) infection by Pegasus, and reiterated that the list of 50,000 phones was too large for it to represent &#34;targets&#34; of Pegasus. They said that the fact that a number appeared on the list was in no way indicative of whether it had been selected for surveillance using Pegasus.\n  The term HLR, or home location register, refers to a database that is essential to operating mobile phone networks. Such registers keep records on the networks of phone users and their general locations, along with other identifying information that is used routinely in routing calls and texts. Telecoms and surveillance experts say HLR data can sometimes be used in the early phase of a surveillance attempt, when identifying whether it is possible to connect to a phone. The consortium understands NSO clients have the capability through an interface on the Pegasus system to conduct HLR lookup inquiries. It is unclear whether Pegasus operators are required to conduct HRL lookup inquiries via its interface to use its software; an NSO source stressed its clients may have different reasons – unrelated to Pegasus – for conducting HLR lookups via an NSO system.\n Forbidden Stories believes at least 180 journalists worldwide may have been selected as people of interest in advance of possible surveillance by government clients of NSO.\n A source at France 24 said the broadcaster had been “extremely shocked” to discover one of its staff had potentially been monitored.\n “We are stupefied and angry that journalists could be the object of spying. We will not be taking this lying down. There will be legal action,” the source said.\n Le Monde reported that the France 24 journalist, based in Paris, had been selected for “eventually putting under surveillance”. Police experts discovered the spyware had been used to target the journalist’s phone three times: in May 2019, September 2020 and January 2021, the paper said.\n Bredoux told the Guardian that investigators had found traces of Pegasus spyware on both her and Plenel’s mobile phones. She said the confirmation of long-held suspicions that they had been targeted contradicted the repeated denials of those who were believed to be behind the attempt to spy on them.\n “It puts an end to the idea that this is all lies and fake news. It’s the proof we need,” Bredoux said.\n French politicians expressed shock after the mobile numbers of the president, Emmanuel Macron, former prime minister Édouard Philippe and 14 serving ministers, including those for justice and foreign affairs, appeared in the leaked data. Research by the Pegasus project suggests that Morocco was the country that may have been interested in Macron and his senior team, raising fears that their phones were selected by one of France’s close diplomatic allies.​\n NSO said Macron was not and never had been a “target” of any of its customers, meaning  the company denies he was selected for surveillance or was surveilled using Pegasus. The company added that the fact that a number appeared on the list was in no way indicative of whether that number was selected for surveillance using Pegasus.\n Morocco has “categorically” rejected and condemned what it called “unfounded and false allegations” that it had used Pegasus to spy on high-profile international figures. Lawyers for the government said last week that it had filed defamation claims in Paris against Amnesty International and Forbidden Stories.\n Bredoux added: “It takes a bit of time to realise it, but it’s extremely unpleasant to think that one is being spied on, that photos of your husband and children, your friends – who are all collateral victims – are being looked at; that there is no space in which you can escape. It’s very disturbing.”\n But Bredoux, who in 2015 wrote a series of articles on Abdellatif Hammouchi, the director general of Moroccan internal intelligence, said her main concern was for the journalists’ contacts.\n “As journalists, what is even more worrying is that sources and contacts may have been compromised, that these are violations not just of your privacy and private life, but of the freedom of the press.\n “We are not in the same situation as the journalists in Morocco but are being used like Trojan horses to get at them, so my thoughts are with our colleagues in Morocco.\n “That my telephone could be used to help attack these journalists who fight every day makes me very angry.”\n Last month when news of the  Pegasus project broke,  Macron ordered  multiple investigations. The French p​rime minister, Jean Castex, said the Élysée had “ordered a series of investigations”, after vowing to “shed all light on the revelations”.​\n In Israel last week,  authorities inspected NSO’s offices. And on Sunday, the Israeli newspaper Haaretz  reported an “emergency” conference had been called for cyber-firms to assess the impact of the revelations on the domestic sector. It is not clear which companies will attend the meeting.\n Pegasus is the hacking software – or spyware – that is developed, marketed and licensed to governments around the world by NSO Group. The malware has the capability to infect billions of phones running either iOS or Android operating systems. It enables operators of the spyware to extract messages, photos and emails, record calls and secretly activate microphones.\n The appearance of a number on the leaked list does not mean it was subject to an attempted or successful hack.\n  Human rights activists, journalists and lawyers around the world have been selected as possible candidates for potential invasive surveillance by authoritarian governments using the hacking software, according to the investigation into the massive data leak.\n The investigation suggests widespread and continuing abuse of Pegasus, which  NSO insists is only intended for use against criminals and terrorists.", "posttime": "2021-08-02 23:16:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,手机,间谍,spyware,pegasus", "title": "法国情报部门证实，记者手机上发现 Pegasus 间谍软件", "title_en": "Pegasus spyware found on journalists’ phones, French intelligence confirms", "transed": 1, "url": "https://www.theguardian.com/news/2021/aug/02/pegasus-spyware-found-on-journalists-phones-french-intelligence-confirms", "via": "", "real_tags": ["软件", "手机", "间谍", "spyware", "pegasus"]}, {"category": "", "categoryclass": "", "imagename": "4b7ac8904a410c94bee0c521137fad3c.jpg", "infoid": 1071187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "聆听由 XavierUniversityLibrary 策划的播放列表量子力学基础会议 (1962) |桌面和移动设备上的泽维尔大学图书馆。", "note_en": "Listen to Conference on the Foundations of Quantum Mechanics (1962), a playlist curated by XavierUniversityLibrary | Xavier University Library on desktop and mobile.", "posttime": "2021-08-02 23:16:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "量子力学,lecture,移动", "title": "狄拉克量子力学基础讲座（1962）", "title_en": "Dirac Lecture on the Foundations of Quantum Mechanics (1962)", "transed": 1, "url": "https://soundcloud.com/xavieruniversitylibrary/sets/conference-on-the-foundations", "via": "", "real_tags": ["量子力学", "lecture", "移动"]}]