[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1070253, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来源：美国能源信息署 (EIA)，每月能源评论 注：该图显示了所有部门（电力、工业、商业和住宅）的净发电量，包括公用事业规模和小规模（客户现场、小于 1 兆瓦）太阳能。 2020 年，可再生能源（包括风能、水电、太阳能、生物质能和地热能）产生了创纪录的 8340 亿千瓦时（kWh）电力，约占美国总发电量的 21%。 2020 年，在美国，只有天然气（16170 亿千瓦时）的发电量超过了可再生能源。可再生能源有史以来首次超过核能（7900 亿千瓦时）和煤炭（7740 亿千瓦时）。 2020 年的这一结果主要是由于美国发电中煤炭的使用显着减少，而风能和太阳能的使用稳步增加。 2020 年，美国所有行业的煤炭发电量比 2019 年下降了 20%，而包括小规模太阳能在内的可再生能源增长了 9%。风能是目前美国最普遍的可再生电力来源，2020 年比 2019 年增长了 14%。公用事业规模的太阳能发电（来自 1 兆瓦以上的项目）增长了 26%，小规模太阳能，如电网连接屋顶太阳能电池板，增长 19%。美国的燃煤发电量在 2007 年达到 20160 亿千瓦时的峰值，此后大部分容量已被天然气发电取代或转换为天然气发电。在 2016 年之前，煤炭是美国最大的电力来源，而 2020 年是可再生能源和核能发电量超过煤炭发电量的第一年（根据我们可追溯到 1949 年的数据系列）。从 2019 年到 2020 年，核电下降了 2%，因为几座核电站退役，其他核电站经历了与维护相关的停电略多。我们预计 2021 年美国的燃煤发电量将增加，因为天然气价格继续上涨，煤炭在经济上更具竞争力。根据我们的短期能源展望 (STEO) 中的预测，我们预计 2021 年所有行业的燃煤发电量将比 2020 年的水平增加 18%，然后在 2022 年下降 2%。我们预计美国所有行业的可再生能源发电量将增加2021 年为 7%，2022 年为 10%。因此，我们预测煤炭将成为 2021 年第二大最流行的电力来源，而可再生能源将成为 2022 年第二大最流行的能源。我们预计核电将下降 2随着运营商退役多台发电机，2021 年和 2022 年分别下降 % 和 3%。资料来源：美国能源信息署、每月能源评论和短期能源展望 (STEO) 注：该图显示了所有部门（电力、工业、商业和住宅）的净发电量，包括公用事业规模和小型规模（客户现场，小于 1 兆瓦）太阳能。", "note_en": "Source: U.S. Energy Information Administration (EIA),   Monthly Energy Review   Note: This graph shows electricity net generation in all sectors (electric power, industrial, commercial, and residential) and includes both utility-scale and small-scale (customer-sited, less than 1 megawatt) solar.\n    In 2020,  renewable energy sources (including wind, hydroelectric,  solar, biomass, and geothermal energy) generated a record 834 billion kilowatthours (kWh) of electricity, or about 21% of all the electricity generated in the United States. Only  natural gas (1,617 billion kWh) produced more electricity than renewables in the United States in 2020. Renewables surpassed both  nuclear (790 billion kWh) and  coal (774 billion kWh) for the first time on record. This outcome in 2020 was due mostly to significantly less coal use in U.S. electricity generation and steadily increased use of wind and solar.\n  In 2020, U.S. electricity generation from coal in all sectors declined 20% from 2019, while renewables, including  small-scale solar, increased 9%.  Wind, currently the most prevalent source of renewable electricity in the United States, grew 14% in 2020 from 2019.  Utility-scale solar generation (from projects greater than 1 megawatt) increased 26%, and  small-scale solar, such as grid-connected rooftop solar panels, increased 19%.\n  Coal-fired electricity generation in the United States peaked at 2,016 billion kWh in 2007 and much of that capacity has been  replaced by or converted to natural gas-fired generation since then. Coal was the largest source of electricity in the United States until 2016, and 2020 was the first year that more electricity was generated by renewables and by  nuclear power than by coal (according to our data series that dates back to 1949). Nuclear electric power declined 2% from 2019 to 2020 because several nuclear power plants retired and other nuclear plants experienced slightly more maintenance-related outages.\n  We expect  coal-fired electricity generation to increase in the United States during 2021 as  natural gas prices continue to rise and as coal becomes more economically competitive. Based on forecasts in our   Short-Term Energy Outlook (STEO), we expect coal-fired electricity generation in all sectors in 2021 to  increase 18% from 2020 levels before falling 2% in 2022. We expect U.S. renewable generation across all sectors to increase 7% in 2021 and 10% in 2022. As a result, we forecast coal will be the second-most prevalent electricity source in 2021, and renewables will be the second-most prevalent source in 2022. We expect nuclear electric power to decline 2% in 2021 and 3% in 2022 as operators  retire several generators.\n    Source: U.S. Energy Information Administration,   Monthly Energy Review and   Short-Term Energy Outlook (STEO)  Note: This graph shows electricity net generation in all sectors (electric power, industrial, commercial, and residential) and includes both utility-scale and small-scale (customer-sited, less than 1 megawatt) solar.", "posttime": "2021-07-29 21:53:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,美国,电力,renewables,太阳能", "title": "可再生能源成为 2020 年美国第二大最流行的电力来源", "title_en": "Renewables became the second-most prevalent U.S. electricity source in 2020", "transed": 1, "url": "https://www.eia.gov/todayinenergy/detail.php?id=48896", "via": "", "real_tags": ["2020", "美国", "电力", "太阳能"]}, {"category": "", "categoryclass": "", "imagename": "7b030f03a5405a6f7f3210fbe21d7574.jpg", "infoid": 1070252, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很快就会有一天没有提醒，每天，当你走在街上时，你遇到的每个人都有一个原创的观点。备受喜爱的儿童动画节目将于 2022 年初结束，也就是第 25 季和最后一季之后。该剧的执行制片人卡罗尔·格林沃尔德 (Carol Greenwald) 在一份声明中说：“亚瑟是历史上播出时间最长的儿童动画系列，以通过许多开创性时刻向几代观众传授善良、同情和包容而闻名。”她补充说，该节目将在未来几年继续在 PBS KIDS 上播放。亚瑟跟随其名义上的角色，一只八岁的土豚，在家人、朋友和学校中度过。该节目擅长展示来自不同文化、阶级和家庭背景的角色。有时它是边界推动 - 该节目的衍生剧集，来自巴斯特的明信片，因 2005 年以女同性恋父母为特色的剧集而受到当时的教育部长玛格丽特·斯佩林的批评，而阿拉巴马州公共电视台拒绝播出 2019 年的剧集，该剧集显示一场同性婚礼。本月早些时候，在播客《Finding DW》的 7 月 13 日一集中的一次采访中，节目结束的消息首次浮出水面，亚瑟作家凯西·沃透露，该节目不再制作，最后一集在几年前完成. “我认为亚瑟应该回来，”她说。 “我知道我并不是唯一一个认为他们犯了错误的人。”尽管如此，这可能不是亚瑟的终结：格林沃尔德的声明补充说，“制片人 GBH 和 PBS KIDS 将继续合作制作亚瑟的更多内容，以新的方式分享亚瑟和他的朋友们的经验教训。”", "note_en": "There will soon be a day without the reminder that every day, when you&#39;re walking down the street, everybody that you meet has an original point of view.\n    The much beloved animated kids show is coming to an end in early 2022, after its 25th and final season.\n  &#34;Arthur is the longest-running kids animated series in history and is known for teaching kindness, empathy and inclusion through many groundbreaking moments to generations of viewers,&#34; said the show&#39;s executive producer, Carol Greenwald, in a statement. She added that the show will continue to be available on PBS KIDS for years to come.\n     Arthur followed its titular character, an eight-year-old aardvark, as he navigated life among family, friends and school. The show had a knack for featuring characters from different cultures, classes and family backgrounds. At times it was boundary pushing — an episode of the show&#39;s spin-off,  Postcards from Buster, received criticism from then-Education Secretary Margaret Spelling for a  2005 episode that featured lesbian parents, and  Alabama Public Television refused to air a 2019 episode that showed a  same-sex wedding.\n  The news of the show ending was first floated earlier this month in an interview featured in the July 13 episode of the podcast   Finding D.W. , where  Arthur writer Kathy Waugh revealed that the show was no longer in production, and the final episode was completed years ago. &#34;I think  Arthur should come back,&#34; she said. &#34;I know I&#39;m not alone in thinking they made a mistake.&#34;\n    Still, this might not be the end of Arthur: The statement from Greenwald adds that &#34;producer GBH and PBS KIDS are continuing to work together on additional Arthur content, sharing the lessons of Arthur and his friends in new ways.&#34;", "posttime": "2021-07-29 21:53:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "儿童,longest,节目", "title": "时间最长的儿童动画系列“亚瑟”即将结束", "title_en": "'Arthur,' the longest-running kids animated series, is ending", "transed": 1, "url": "https://www.npr.org/2021/07/28/1021687616/pbs-kids-show-arthur-ending", "via": "", "real_tags": ["儿童", "longest", "节目"]}, {"category": "", "categoryclass": "", "imagename": "9630a45f23a11d31483858bf77502d0d.jpg", "infoid": 1070251, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两个红色的东西藏在太阳系不应该存在的地方。由日本宇航局 JAXA 的 Sunao Hasegawa 领导的科学家周一在《天体物理学杂志快报》上报道说，在火星和木星之间的小行星带中发现的两个物体似乎起源于海王星之外。这些发现有朝一日可能为早期太阳系中存在的混乱提供直接证据。 “如果这是真的，那将是一笔大买卖，”科罗拉多州西南研究所的行星科学家哈尔·莱维森 (Hal Levison) 说，他并未参与这项研究。地球的恒星邻域今天相当稳定。但是在 40 亿年前，木星和其他巨行星的轨道可能已经发生了变化，混乱统治着。这种行星之舞造成的重力破坏很可能将岩石和冰块扔得到处都是。 “这是非常有活力的，”哈佛大学太阳系演化专家卡琳·奥伯格说，他没有参与这项新研究。其中一些岩石落入火星和木星之间的缝隙中，成为小行星带。大多数材料被认为是相当相似的未形成行星的不活动岩石大块。它们的轨道大约是地球-太阳距离的 2.7 倍和 2.6 倍，正好位于小行星带内。大约 70 英里宽的 203 Pompeja 似乎在结构上完好无损，而只有 35 英里左右的 269 Justitia 可能是先前碰撞的碎片。两者都有稳定的圆形轨道，这意味着它们一定很久以前就已经进入这个空间了。\n两者也有不寻常的颜色。太阳系内部的物体往往反射更多的蓝光，因为它们没有有机物质——比如碳和甲烷——而太阳系外部的物体则更红，因为它们有很多有机物，也许是生命的基石地球。该论文的合著者、麻省理工学院的迈克尔·马塞特 (Michaël Marsset) 说：“为了拥有这些有机物，您最初需要在表面形成大量冰。” “所以它们一定是在非常寒冷的环境中形成的。然后冰的太阳辐射会产生那些复杂的有机物。”事实证明，这两块岩石非常红——比小行星带中看到的任何岩石都要红。虽然已经发现了其他红色小行星的初步迹象，但这两个似乎很特别。这一发现如果正确的话，将为早期太阳系中的行星迁移提供证据，特别是支持一种称为尼斯模型的想法，土星、天王星和海王星都向外移动，而木星稍微向内移动，历时数亿年.这会扰乱行星形成过程中遗留下来的富含有机物的小行星，让它们在太阳系周围嗡嗡作响。 “这是一个令人兴奋的发现，对生命起源有影响，”奥伯格博士说。今天这些剩余的物体中的大多数被称为跨海王星物体，并且在海王星之外的柯伊伯带中运行。许多都是红色的，比如 Arrokoth，NASA 的新视野号任务在 2019 年近距离拍摄了这块岩石。 203 Pompeja 和 269 Justitia 似乎都与它们相匹配。未参与该论文的北亚利桑那大学行星科学家乔什·埃默里 (Josh Emery) 说：“人们一直在谈论来自柯伊伯带的部分小行星已经有一段时间了。”他说，这项研究“肯定向前迈出了一步”，以寻找支持该假设的证据。\n并非所有人都对此深信不疑。莱维森博士也没有参与该论文，他说物体在接近太阳时应该变得不那么红。即使在木星轨道上被捕获的被称为特洛伊小行星，被认为可能是跨海王星的物体，也不是这个红色的。 “这似乎与我们的模型不一致，”美国宇航局露西任务的负责人列维森博士说，该任务计划于 10 月发射以研究木星的特洛伊木马。 Marsset 博士同意，目前尚不清楚为什么它们会如此红，但这可能与它们被植入小行星带所需的时间有关。有些木马也可能是红色的，但还没有被发现。为了真正确认 203 Pompeja 和 269 Justitia 的起源，航天器可能需要访问它们。这样的任务有可能让我们一瞥外太阳系，但无需花费十年或更长时间飞到那里。 “你可以飞越这些奇怪的小行星中的一个，和一个更典型的小行星进行比较，”埃​​默里博士说。 “那将是一次非常引人注目的航天器任务。”", "note_en": "Two red things are hiding in a part of the solar system where they shouldn’t be.\n Scientists led by Sunao Hasegawa from JAXA, the Japanese space agency, reported in  The Astrophysical Journal Letters on Monday that two objects spotted in the asteroid belt between Mars and Jupiter appear to have originated beyond Neptune. The discoveries could one day provide direct evidence of the chaos that existed in the early solar system.\n “If true it would be a huge deal,” says Hal Levison, a planetary scientist at the Southwest Research Institute in Colorado, who was not involved in the research.\n Earth’s stellar neighborhood is fairly stable today. But 4 billion years ago, chaos reigned as the orbits of Jupiter and other giant planets beyond it may have shifted. The gravitational havoc caused by this planetary dance likely threw pieces of rock and ice all over the place.\n “It was very dynamic,” said Karin Öberg, an expert in solar system evolution from Harvard University who was not involved in the new study.\n Some of those rocks settled into the gap between Mars and Jupiter and became the asteroid belt. Most of the material is believed to be fairly similar hunks of inactive rock that failed to form planets.\n  They orbit at about 2.7 and 2.6 times the Earth-sun distance, well within the asteroid belt. 203 Pompeja, at about 70 miles across, appears to be structurally intact, whereas 269 Justitia, only 35 miles or so, is likely a fragment of a previous collision. Both have stable circular orbits, meaning they must have settled into this space long ago.\n Both also have an unusual color. Objects in the inner solar system tend to reflect more blue light because they are devoid of organic material — things like carbon and methane — whereas objects in the outer solar system are redder because they have a lot of organics, perhaps the building blocks of life on Earth.\n “In order to have these organics, you need to initially have a lot of ice at the surface,” said Michaël Marsset from the Massachusetts Institute of Technology, a co-author on the paper. “So they must have formed in a very cold environment. Then the solar irradiation of the ice creates those complex organics.”\n These two rocks, as it turns out, are extremely red — more red than anything else seen in the asteroid belt. While tentative hints of other red asteroids have been found, these two appear to be special.\n The finding, if correct, would offer evidence for planetary migration in the early solar system, particularly in support of an idea called  the Nice Model, with Saturn, Uranus and Neptune all moving outward, and Jupiter inward slightly, over a few hundred million years. This would have perturbed organic-laden asteroids leftover from the formation of the planets, sending them pinging around the solar system.\n “It’s an exciting discovery with implications for the origins of life,” Dr. Öberg said.\n Most of these leftover objects in the present day are known as trans-Neptunian objects and orbit in the Kuiper belt beyond Neptune. Many are red in color, like Arrokoth, the rock that NASA’s New Horizons mission  got a close-up of in 2019. 203 Pompeja and 269 Justitia both appear to match them.\n “People have been talking about some fraction of asteroids coming from the Kuiper belt for quite a while now,” said Josh Emery, a planetary scientist from Northern Arizona University who was not involved in the paper. He said the research “definitely takes a step” toward finding evidence to support that hypothesis.\n Not everyone is convinced just yet. Dr. Levison, who was also not involved in the paper, says objects should become less red as they approach the sun. Even captured asteroids in Jupiter’s orbit known as Trojans, thought to possibly be trans-Neptunian objects, aren’t this red. “It seems to be inconsistent with our models,” said Dr. Levison, who is the head of NASA’s  Lucy mission, which is scheduled to launch in October to study Jupiter’s Trojans.\n Dr. Marsset agrees that it’s not clear why they would be so red, but it is possibly related to how long it took them to become implanted into the asteroid belt. Some Trojans may also be as red, but haven’t been found yet.\n To truly confirm the origin of 203 Pompeja and 269 Justitia, a spacecraft would likely need to visit them. Such a mission could potentially offer a glimpse at the outer solar system, but without spending a decade or more to fly there.\n “You could flyby one of these strange asteroids, and a more typical asteroid for comparison,” Dr. Emery said. “That would be a really compelling spacecraft mission.”", "posttime": "2021-07-29 21:52:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "红色,objects,可能", "title": "在小行星带中发现红色物体。他们不应该在那里", "title_en": "Red Objects Were Found in the Asteroid Belt. They Shouldn’t Be There", "transed": 1, "url": "https://www.nytimes.com/2021/07/28/science/red-asteroids-belt.html", "via": "", "real_tags": ["红色", "objects", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070250, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的文章最近促使一位匿名评论者宣称像我这样的人是世界的错。哦快乐！ ——终于，做了这么多年的恶事，得到了一些认可！兴奋的我决定分享我经过实战考验的邪恶技巧之一，它从来没有让我失望过。一个简单的事情是正面他们赢，反面你输的情况。在容易的事情上失败是可耻的；成功是不起眼的。处理困难的事情要好得多——正面是你赢，反面是输。失败是不幸的，但也是意料之中的；成功使你成为英雄。认真对待这件事，因为它滚雪球。在“困难”的事情上工作的人会得到很多帮助和资源，从而更容易成功——也更容易转移到下一个“困难”的事情上。做“简单”任务的人得不到帮助，所以更难成功。到处都是引号，因为当然重要的是感知，而不是它到底有多难或有多容易。最糟糕的工作是那些被认为容易的困难的事情——困难的“容易”的事情。最好的事情是简单的“困难”。我多年来对低级编程的偏爱，部分是因为它是一个非常困难的领域，在实践中，它需要一点知识和大量纪律——但不需要任何出色的技能。 （那么为什么很多人害怕低级编程？只是因为它最初几次咬你有多难。感到痛苦和退缩的人尊重那些已经超越它并达到生产力的人。现在你知道人们为什么接受肯·汤普森和莱纳斯·托瓦兹之类的狗屎，然后乞求更多。）真正邪恶的地方不是当一个勇敢的行动者决定表现得像托瓦兹时。这比邪恶更愚蠢。成为 Torvalds 的人会侥幸成功，但它总是需要一些善意，因此最终还是要花钱。所以目标导向的恶人总是试图表现出最好的行为。不，当你让他们失败时，这才是真正邪恶的地方。当他们来找你时，认为这很容易，而你知道这实际上很难，你拒绝了他们，让他们失败了几次，然后你等到他们以重新调整的态度回来时——那是邪恶的。\n在这里，恶人需要取得微妙的平衡，牢记恶人的黄金法则：在困难的“容易”的事情上工作——所有的麻烦，没有信用——对你来说将是可怕的。你会体会到一个好人短暂而悲惨的生活。但是，如果这件事如此重要以至于失败会危及组织，那么也许您应该成为行善者并自费使他们免于误解。可能是。也许不是。一定要考虑清楚。结果是，有时作恶者会成为行善者，但您应该知道这对您的健康有害。有时，您无法避免做一些“简单”的事情。对于这些情况，一个有趣的策略是将简单的事情推迟到变得紧急为止。这一次完成了两件事：紧急的事情自动变得更难，一个匆忙的人更重要。做的越晚，越容易得到帮助（同时保持“英雄”的地位在所有促成这件事的人的中心。）在时间压力下，范围缩小，使以前的“容易”和现在正式“困难”的事情真的更容易。这对于真正恶心但不可避免的工作特别有用。\n但这是一个策略，因为将事情推迟到变得紧急时是公然邪恶的。 （逃避简单的事情不是——为什么，寻找更难的工作是爱国和英雄主义的！）为了逃避推迟，你需要一个借口：或者甚至你真的低估了困难，因此很遗憾，推迟了太多– 你很抱歉。 （这最后一个借口的缺点是你必须承认错误。但如果紧迫性会使范围变小，错误也会变小。）你要防止的一件事是人们学会更早地提醒你。当他们迟到时，实现它的方式非常好。如果人们因为提醒太晚而感到受到惩罚，他们下次会早点来，并且怀着报复的心情，所以会有更多不必要的任务。但如果他们迟到了，而你急切地“在这种情况下尽力做到最好”，你不仅将自己作为爱国英雄置于聚光灯下，而且将健忘的罪魁祸首从聚光灯下移开。所以他们会对事件形成美好的回忆，而不是了解早点到来的价值——这正是我们想要的。使推迟策略相对安全的一件事是管理层对人们玩它的想法感到震惊，如以下现实生活对话中所示： 胡言乱语的管理顾问：许多组织都有一个问题，他们只在工作紧急的事情以重要但不太紧急的事情为代价。下级妖孽经理（一时失策）：当然啊！我实际上推迟了事情以在这里获得优先权。看？有时，如果你当面说，他们不会相信。所以他们不太可能怀疑你。 （向我汇报的人会玩推迟的策略吗？有时他们会玩，我并不因此而怨恨他们；他们的优先事项不是我的。但在最坏的情况下，你应该期待很多怨恨——这实际上是叛国罪– 所以你应该有合理的否认。）\n在很大程度上，您的生产力取决于您选择从事的工作。将被认为容易的事情排除在该列表之外。当你做不到的时候，推迟一件“容易”的事情会让它变得“更难”和更小。同一作者的另一本书“有点邪恶”对你来说也应该很有趣。保持邪恶。听说过，没有读过/看到过，我不是研究人员的理论（在这里我可以放一个悲伤或快乐的笑脸。）这有关系吗？ （这里我说的是对你的工作的看法，而不是你的实际工作；我有点希望讨论研究的人不要去那里，或者至少主要讨论其他事情。）我不认识你，但从阅读您的博客，我认为您和汉明在高层次上有相似的方法。举个例子，考虑一下他演讲的摘录：现在 Alan Chynoweth 提到我曾经在物理桌上吃饭。我和数学家一起吃饭，我发现我已经知道了相当多的数学；事实上，我并没有学到太多。正如他所说，物理桌是一个令人兴奋的地方，但我认为他夸大了我的贡献。听 Shockley、Brattain、Bardeen、JB Johnson、Ken McKay 和其他人的演讲非常有趣，我学到了很多东西。但不幸的是，诺贝尔奖来了，升职来了，剩下的就是渣滓。没有人想要剩下的。好吧，和他们一起吃饭也没有用！餐厅的另一边是一张化学桌。我曾与其中一位研究员 Dave McCall 共事；此外，他当时正在向我们的秘书求爱。我走过去说：“你介意我加入你吗？”他们不能拒绝，所以我开始和他们一起吃饭。我开始问，“你所在领域的重要问题是什么？”大约一周后，“你在解决什么重要问题？”又过了一段时间，有一天我进来说：“如果你所做的事情并不重要，而且如果你认为它不会导致一些重要的事情，那么你为什么要在贝尔实验室工作呢？”在那之后我没有受到欢迎；我得找个人一起吃饭！那是在春天。秋天，戴夫·麦考尔 (Dave McCall) 在大厅里拦住我说：“汉明，你的那句话深深刺痛了我。我整个夏天都在想，即我所在领域的重要问题是什么。我没有改变我的研究，”他说，“但我认为这很值得。”我说，“谢谢你戴夫，”然后继续。我注意到几个月后他被任命为部门负责人。前几天我注意到他是美国国家工程院院士。我注意到他成功了。我从未听说过科学界和科学界提到的那张桌子上其他任何人的名字。他们无法自问：“我所在领域的重要问题是什么？”\n哦，这对我来说听起来太好了，我可能会赞美自己我是那个人的 5%，但大多数情况下我不是那个人，两次：*首先我在这里讨论的是寻找“硬”事情——那些被认为是困难的，这与重要不同（即使“困难”实际上很难，也不一样。）我明确地说，我真诚地相信，通常你不想工作重要的东西，因为它被认为是容易的，而且对你来说没有什么，而且，它被认为是容易的，因此实际上很难成功；我在那里说是的，如果它真的很重要，也许你会去做，我会补充说，有时你会去做，因为它会在以后被认为是困难和值得的，但这些是例外，而不是规则– 至少不是我的规则。 * ...其次，我经常觉得我没有足够的能力来解决真正重要的问题（在我的情况下，我的借口之一是我真的很难专注于任何一件事，因为我被无数次卷入其中一直在指导；但这是一个借口，另一部分是我特意选择广度而不是深度，因为深度钻探需要太多的颅骨马力。）所以我主要做的是（A）在大部分深度上依靠其他人(B) 对于我最直接参与的领域，我选择“点球”——这些很重要，很多优秀的球员会比我做得更糟，因为我在心理上很适合它。但是点球类型的工作在行业中比在学术界更普遍，也更受重视。所以这是我不是汉明的另一部分。结果是我通常既太邪恶又太愚蠢，无法去追求重要的东西；我会自鸣得意地说，有时我会做一些“重要”的事情，就像学者在谈论学术领域时会使用的一样——有时我在做一些超前的事情，或者让我们说在教科书路径之外.但再说一次，说这是 5% 的时间是在赞美我。祝贺 TPU 公告 BTW。 （出于显而易见的原因，我避免对此发表评论，但能够进行研究并公开宣布这是一件很酷的事情。）很高兴知道 H 是同一个人，距离的名称就是以这个名字命名的。他的名字巧合地出现在我昨天正在研究的“硅谷”理查德编写的混淆代码中：嗯，这取决于你如何阅读“重要”。我认为他的“重要”和你的“听起来很难”一样。我想这是您声称要解决的问题的超集，因为您声称要解决“听起来很难，很容易”的问题，而汉明则没有资格。\n回复：TPU 的东西，谢谢！虽然我认为那只是在正确的时间出现在正确的地方的问题。碰巧我加入了谷歌，当时那个项目正从一个 20% 的项目转变为一个全职项目，所以自从我是第一个雇员以来，我必须做很多有趣的事情（除了那个提出这个想法的人）当然是）。似乎每个人都在分享这篇文章提醒他们的东西，我也会这样做。 《普特定律与成功的技术官僚》一书充满了这样的邪恶秘诀。事实上，这本书更进一步：其中一项建议是将危机级别提高到使晋升率最大化的正确点。如果失败迫在眉睫，这本书提醒“创新组织厌恶小失败，奖励大失败”，因此理性的行动方针是将失败尽可能地放大。为了制造危机而成为英雄，系统地做一个糟糕的工作确实是一个可行的策略，至少在一段时间内，但对我来说太邪恶了；我认为，一个健康的组织，即使是在文化上很容易受到这类事情影响并暗中鼓励它的组织，也会随着时间的推移摆脱这种人。也许我会读那本书。 Kindle 版 28 美元，想象一下。谈版权改革的迫切需要！哇，这对于一本相当薄的书来说太贵了！是的，它有时有点过头了。还是把我逗笑了。并哭泣。嗯，这里有一个问题。如果经理监控你花时间做什么，并从经验中了解什么对你来说是困难的，什么不是？他知道一些关于 PM 和 HRM 的基本知识吗？您描述的那种恶行只有在您的经理对管理一无所知的情况下才有可能发生。\n补充一点，其中一本书包含改变生活的见解：“系统的目的，就是它的作用。” [注：实际上归因于斯塔福德啤酒，请参阅 WLL biog。在上面的链接上。] 免责声明：你从这些书中得到了什么，可能取决于你的心态。你好。非常有趣的内容，但很难在搜索结果中找到 yosefk.com。你在谷歌的前 10 名之外，所以你不能指望大流量。您需要高质量的反向链接才能在 serps 中排名。而且你可以免费获得它们，只需在谷歌搜索：forbesden&#39;s tools 你好。我检查了你的 yosefk.com，我看到你有一些重复的内容，所以这可能是你没有在谷歌中排名 hi 的原因。但是您可以快速解决此问题。有一个工具可以像人类一样重写内容，只需在谷歌中搜索：miftolo&#39;s tools 感谢您分享您的信息。我真的很感谢你的努力，我在等待你的下一篇文章，再次感谢。 5/16/2019 @ 8:48:59 AM 在我看来，yosefk.com 在处理此类问题方面做得很好。即使经常故意争论，这些帖子通常也写得很好且具有挑战性。我想你提到了一些非常有趣的细节，感谢你的帖子。\n我印象深刻，我不得不承认。我真的很少会遇到既具有教育意义又具有娱乐性的博客，让我告诉您，您可能已经一针见血了。你的想法很出色；问题是没有足够的人明智地谈论的一个因素。我很高兴我们在寻找与此有关的东西时遇到了这一点。我喜欢通读，我相信这个网站上有一些真正实用的东西！ .我印象深刻，我不得不承认。我真的很少会遇到既具有教育意义又具有娱乐性的博客，让我告诉您，您可能已经一针见血了。你的想法很出色；问题是没有足够的人明智地谈论的一个因素。我很高兴我们在寻找与此有关的东西时遇到了这一点。我很高兴成为这个伟大网站的访问者之一（：，感谢您发帖。我认为您提到了一些非常有趣的细节，感谢您的帖子。但他仍然在尝试。我一直在使用 Movable -在一些网站上输入了大约一年，并且担心切换到另一个平台。我听说 blogengine.net 非常好。有没有办法可以将我所有的 wordpress 帖子导入其中？任何形式的帮助都会不胜感激！我真的很喜欢在这个网站上检查，它有很多好东西。\n我想你提到了一些非常有趣的细节，感谢你的帖子。后期写作也是一种乐趣，熟了之后就可以写了，不然就很难写了。不可否认，考虑到你所说的。您最喜欢的原因似乎是网络上最简单的要记住的因素。我对你说，即使其他人想到他们显然不知道的担忧，我当然也会生气。你设法击中了最高点，并定义了整个事情，不需要副作用，人们可以接受信号。可能会回来获得更多。谢谢 在忙碌的生活中，收听电视新闻其实很复杂，所以我只是因为这个原因使用网络，并获取最热门的新闻。我什至不明白我是怎么在这里停下来的，但我认为这个贴子很棒。我不认识你可能是谁，但你肯定会为那些还没有的人去一个著名的博主。干杯!我在这里读了几个恰到好处的东西。当然价格书签重新访问。我想知道您为创建这些精彩的信息网站之一付出了多少努力。我真的很感谢这个网页的所有者此时分享了这篇令人印象深刻的帖子。\n您是否考虑过在其他博客上撰写电子书或客座作者？我有一个基于您讨论的相同主题的博客，希望您分享一些故事/信息。我知道我的用户会喜欢你的工作。如果您甚至对远程感兴趣，请随时给我发送电子邮件。很高兴每隔一段时间看到一个博客，它不是相同的不需要的重复材料。优秀的阅读！我已经保存了您的网站，并且正在将您的 RSS 提要添加到我的 Google 帐户中。我必须告诉你，你有一个优秀而独特的网站，我必须说很喜欢阅读。嗨，朋友们，它关于教育的精彩段落和完整的解释，一直保持下去。今天，我和孩子们去了海滨。我找到了一个贝壳，把它交给了我 4 岁的女儿，她说：“如果你把它放在耳边，你就能听到大海的声音。”她把贝壳放到耳边，然后叫了起来。里面有一只寄居蟹，它夹住了她的耳朵。她再也不想回去了！大声笑我知道这完全是题外话，但我不得不告诉别人！我必须告诉你，你有一篇优秀而独特的帖子，我有点喜欢阅读。\n我必须说，尽管我很喜欢阅读您所说的内容，但一段时间后我忍不住失去了兴趣。很棒的信息。幸运的是我偶然发现了你的博客（stumbleupon）。我已经保存它以备后用！我必须说，尽管我很喜欢阅读您所说的内容，但一段时间后我忍不住失去了兴趣。只是想输入一些一般的东西，网站布局很完美，文章非常棒：D。我真的很喜欢你的网站..令人愉快的颜色和主题。这个网站是你自己做的吗？请回复，因为我正在寻找创建我自己的网站，并想知道您从哪里得到这个或主题的确切名称。谢谢！只是想输入一些一般的东西，网站布局很完美，文章非常棒：D。我有点进入这个网站。我发现它很有趣，并且充满了独特的兴趣点。\n我在这个网站上看了你的一些文章，我相信这个网站真的很有启发性！继续发帖。我每天都会花半个小时阅读这个网站的文章或评论，同时喝杯咖啡。我想你已经提到了一些非常我......", "note_en": "My writing has recently prompted an anonymous commenter to declare that people like me are what&#39;s wrong with the world. Oh joy! – finally, after all these years of doing evil, some recognition! Excited, I decided to share one of my battle-tested evil tips, which never ever failed evil me.\n  An easy thing is a heads they win, tails you lose situation. Failing at easy things is shameful; succeeding is unremarkable. Much better to work on hard things – heads  you win, tails  they lose. Failure is unfortunate but expected; success makes you a hero.\n Treat this seriously, because it snowballs. The guy working on the &#34;hard&#34; thing gets a lot of help and resources, making it  easier to succeed – and easier to move on to the next &#34;hard&#34; thing. The guy doing the &#34;easy&#34; tasks gets no help, so it&#39;s  harder to succeed.\n Quotation marks all over the place, because of course what counts is perception, not how hard or easy it really is. The worst thing to work on is the hard one that&#39;s  perceived as easy – the hard &#34;easy&#34; thing. The best thing is the easy &#34;hard&#34; one. My years-long  preference for low-level programming results, in part, from its reputation of a very hard field, when in practice, it takes a little knowledge and a lot of discipline – but not any outstanding skills.\n (Why then do many people fear low-level programming? Only because of how hard it bites you the first few times. People who felt that pain and recoiled respect those who&#39;ve moved past it and reached productivity. Now you know why people take shit from the likes of Ken Thompson and Linus Torvalds, and then beg for more.)\n The point where this gets really evil is  not when a heroic doer of hard things decides to behave like a Torvalds. That&#39;s more stupid than evil. You&#39;ll get away with being a Torvalds, but it always costs some goodwill and hence, ultimately, money. So the goal-oriented evildoer always tries to be on their best behavior.\n No, the point where this gets really evil is when you let them fail. When they come to you  thinking that it&#39;s easy, and you know it&#39;s actually  very hard, and you turn them down, and you let them fail a few times, and you wait until they come back with a readjusted attitude -  that&#39;s evil.\n Here, the evildoer needs to strike a delicate balance, keeping in mind The Evildoer&#39;s Golden Rule:\n   Working on the hard &#34;easy&#34; thing – all trouble, no credit – is going to be  terrible for you. You&#39;ll get a taste of a do-gooder&#39;s short, miserable life.\n However, if this thing is so important that a failure would endanger the org,  maybe you should be the do-gooder and save them from their misconceptions at your own expense.  Maybe. And maybe  not. Be sure to think about it.\n The upshot is, sometimes the evildoer gets to be the do-gooder, but you should know that it&#39;s hazardous to your health.\n  Sometimes you can&#39;t weasel out of doing something &#34;easy.&#34; An interesting gambit for these cases is to postpone the easy thing until it becomes urgent. This accomplishes two things at a time:\n Urgent things automatically become harder, a person in a hurry more important. The later it&#39;s done, the easier it is to get help (while retaining the status of &#34;the&#34; hero in the center of it all who made it happen.)\n Under time pressure, the scope shrinks, making the formerly &#34;easy&#34; and now officially &#34;hard&#34; thing genuinely easier. This is particularly useful for the really disgusting, but unavoidable work.\n But it is a gambit, because postponing things until they become urgent is  openly evil. (Avoiding easy things is  not – why, it&#39;s patriotic and heroic to look for the harder work!) To get away with postponing, you need an excuse:\n or even you having sincerely underestimated the difficulty and hence, regrettably, having postponed it too much – you&#39;re  so sorry. (This last excuse has the drawback of you having to admit an error. But to the extent that urgency will make the scope smaller,  the error will become smaller, too.)\n One thing you want to prevent is people learning to remind you earlier. The way to accomplish it is being very nice when they come late. If people feel punished for reminding too late, they&#39;ll come earlier next time, and in a vengeful mood, so with more needless tasks. But if they&#39;re late and you eagerly &#34;try to do the best under the circumstances&#34;, not only do you put yourself under the spotlight as a patriotic hero, you move the forgetful culprit  out of the spotlight. So they&#39;ll form a rosy memory of the incident, and  not learn the value of coming earlier – precisely what we want.\n One thing making the postponing gambit relatively safe is that management is shocked by the very thought of people playing it, as can be seen in the following real-life conversation:\n Babbling management consultant: A lot of organizations have a problem where they only work on urgent things at the expense of important, but less urgent ones.\n Low-ranking evildoer manager (in a momentary lapse of reason): Why, of course! I actually postpone things to get priority around here.\n See? Sometimes they won&#39;t believe it if you say to their face. So they&#39;re unlikely to suspect you. (Do people reporting to me play the postponing gambit? Sometimes they do, and I don&#39;t resent them for it;  their priorities aren&#39;t mine. But at the worst case, you should expect  a lot of resentment – it&#39;s practically high treason – so you should have plausible deniability.)\n  To a very large extent,  your productivity is a result of what you choose to work on. Keep things perceived as easy out of that list. When you can&#39;t, postponing an &#34;easy&#34; thing can make it both &#34;harder&#34; and smaller.\n   The other book by the same author, &#34;Be Slightly Evil&#34; should also be a lot of fun for you. Stay evil.\n                Heard about it, didn&#39;t read/see, on the theory that I&#39;m not a researcher (here I could put a sad or a happy smiley.) Is it related? (Here I&#39;m talking about perception of your work more than your actual work; I&#39;d kinda hope that someone discussing research would not go there, or at least would mostly discuss other things.)\n        I don&#39;t know you, but from reading your blog I think that you and Hamming have, at a high-level, similar approaches. Just for example, consider this excerpt from his talk:\n Now Alan Chynoweth mentioned that I used to eat at the physics table. I had been eating with the mathematicians and I found out that I already knew a fair amount of mathematics; in fact, I wasn&#39;t learning much. The physics table was, as he said, an exciting place, but I think he exaggerated on how much I contributed. It was very interesting to listen to Shockley, Brattain, Bardeen, J. B. Johnson, Ken McKay and other people, and I was learning a lot. But unfortunately a Nobel Prize came, and a promotion came, and what was left was the dregs. Nobody wanted what was left. Well, there was no use eating with them!\n Over on the other side of the dining hall was a chemistry table. I had worked with one of the fellows, Dave McCall; furthermore he was courting our secretary at the time. I went over and said, &#34;Do you mind if I join you?&#34; They can&#39;t say no, so I started eating with them for a while. And I started asking, &#34;What are the important problems of your field?&#34; And after a week or so, &#34;What important problems are you working on?&#34; And after some more time I came in one day and said, &#34;If what you are doing is not important, and if you don&#39;t think it is going to lead to something important, why are you at Bell Labs working on it?&#34; I wasn&#39;t welcomed after that; I had to find somebody else to eat with! That was in the spring.\n In the fall, Dave McCall stopped me in the hall and said, &#34;Hamming, that remark of yours got underneath my skin. I thought about it all summer, i.e. what were the important problems in my field. I haven&#39;t changed my research,&#34; he says, &#34;but I think it was well worthwhile.&#34; And I said, &#34;Thank you Dave,&#34; and went on. I noticed a couple of months later he was made the head of the department. I noticed the other day he was a Member of the National Academy of Engineering. I noticed he has succeeded. I have never heard the names of any of the other fellows at that table mentioned in science and scientific circles. They were unable to ask themselves, &#34;What are the important problems in my field?&#34;\n    Oh, that sounds too great for it to be me, I&#39;ll maybe compliment myself that I&#39;m 5% that guy, but mostly I&#39;m not that guy, twice:\n * Firstly what I discussed here was looking for &#34;hard&#34; things – those perceived as hard, this is not the same as important (and it&#39;s not the same even if &#34;hard&#34; is really actually hard.) I explicitly say there, and I sincerely believe it, that often you want to NOT work on important stuff because it&#39;s considered easy and there&#39;s nothing in it for you, moreover, it being considered easy makes it unnecessarily hard to actually succeed; I said there that yes if it&#39;s truly important maybe you go do it, and I&#39;ll add that sometimes you go do it on the theory that it&#39;ll get recognized as hard and worthy later, but these are the exceptions, not the rule – not my rule at least.\n * …And secondly often I feel that I don&#39;t have the cranial horsepower for the really important problems (in my case one of my excuses is it&#39;s really hard for me to focus deeply on any one thing because I&#39;m getting pulled in umpteen directions all the time; but this is an excuse, the other part is I specifically choose breadth over depth because drilling for depth requires too much cranial horsepower.) So what I mainly do is (A) rely on other people for much of the depth and (B) for areas where I&#39;m most directly involved, I pick &#34;penalty kicks&#34; – these are important alright and many good players will do them worse than I do because I&#39;m psychologically well-built for it. But penalty kick type of work is more prevalent and more valued in the industry than in the academia. So this is the other part of me not being a Hamming.\n The upshot is that I&#39;m usually both too evil and too stupid to go after the important stuff; I&#39;ll flatter myself and say that sometimes I get to do something &#34;important&#34; in the same sense that an academic would use when talking about an academic field – sometimes I&#39;m doing something ahead or let&#39;s say outside of well-trodden textbook paths. But again, saying it&#39;s 5% of the time compliments me.\n Congrats on that TPU announcement BTW. (I refrain from commenting on it for obvious reasons, but a cool thing to have worked on, and to have it publicly announced.)\n    Cool to know H is the same guy after which the distance was named. His name coincidently appears in the obfuscated code supposedly written by Richard from &#34;Silicon Valley&#34; I was poring over just yesterday :\n    Well, it depends on how you read &#34;important&#34;. I take his &#34;important&#34; to be the same as your &#34;sounds hard&#34;. I suppose that&#39;s a superset of what you claim to work on, since you claim to work on &#34;sounds hard, is easy&#34; problems and Hamming doesn&#39;t make that qualification.\n Re: the TPU thing, thanks! Although I think that was just a matter of being in the right place at the right time. It just happened that I joined Google when that project was transitioning from a 20%-time project to a full-time thing, so I got to do a lot of interesting stuff since I was the first hire (other than the guy whose idea it was, of course).\n    Seems like everybody is sharing stuff that this post reminded them of and I will do it too. The book &#34;Putt&#39;s Law and the Successful Technocrat&#34; is full of evil recipes like this one.\n In fact the book goes even further: one of the suggestions is to inflate crisis level to just the right point where rate of promotion is maximized. And if the failure is imminent, the book reminds that &#34;Innovative organizations abhor little failures but reward big ones&#34; so the rational course of action is to make the failure as big as possible.\n    To systematically do a shitty job in order to generate crises and become the hero is indeed a workable strategy, at least for a time, but too evil for me; I think that a healthy organization, even one that is culturally very vulnerable to this sort of thing and implicitly encourages it, rids itself of this sort of people over time.\n    Maybe I&#39;ll read that book. $28 for a Kindle edition though, imagine that. Talk about an urgent need of a copyright reform!\n    Wow, that&#39;s expensive for a rather slim book! And yes it is a bit over the top at times. Still made me laugh. And cry.\n                    Well, there is a catch here. What if the manager monitors what you spend your time on and leans from experience what is hard for you and what isn&#39;t? And he knows some basic stuff about PM and HRM? The kind of evildoing you describe is only possible if your manager doesn&#39;t have a clue about management.\n    Just to add, one of these books, contains the life-changing insight: &#34;The Purpose of a System, is What it Does.&#34; [Note: Actually attributed to Stafford Beer, see WLL biog. on the link above.]\n Disclaimer: What you get out of these books, may depend on your state of mind.\n    Hello. Very interesting content but it&#39;s hard to find yosefk.com in search results. You are out of google&#39;s top 10, so you can&#39;t expect big traffic. You need hi quality backlinks to rank in serps. And you can get them for free, just search in google: forbesden&#39;s tools\n    Hello. I have checked your yosefk.com and i see you&#39;ve got some duplicate content so probably it is the reason that you don&#39;t rank hi in google. But you can fix this issue fast. There is a tool that rewrites content like human, just search in google: miftolo&#39;s tools\n    Thank you for sharing your info. I truly appreciate your efforts and I am waiting for your next post thanks once again.\n            5/16/2019 @ 8:48:59 AM In my opinion, yosefk.com does a good job of dealing with issues of this sort. Even if frequently deliberately polemic, the posts are generally well-written and challenging.\n                        I conceive you have mentioned some very interesting details , appreciate it for the post.\n    I’m impressed, I have to admit. Genuinely rarely should i encounter a weblog that’s both educative and entertaining, and let me tell you, you may have hit the nail about the head. Your idea is outstanding; the problem is an element that insufficient persons are speaking intelligently about. I am delighted we came across this during my look for something with this.\n    I love reading through and I believe this website got some genuinely utilitarian stuff on it! .\n    I’m impressed, I have to admit. Genuinely rarely should i encounter a weblog that’s both educative and entertaining, and let me tell you, you may have hit the nail about the head. Your idea is outstanding; the problem is an element that insufficient persons are speaking intelligently about. I am delighted we came across this during my look for something with this.\n                                    I am glad to be one of the visitors on this great website (:, appreciate it for posting .\n                            I conceive you have mentioned some very interesting details , appreciate it for the post.\n    But he&#39;s tryiong none the less. I&#39;ve been using Movable-type on a number of websites for about a year and am concerned about switching to another platform. I have heard very good things about blogengine.net. Is there a way I can import all my wordpress posts into it? Any kind of help would be greatly appreciated!\n        I really enjoy examining on this internet site , it has got great goodies .\n                I conceive you have mentioned some very interesting details , appreciate it for the post.\n                Post writing is also a fun, if you be acquainted with afterward you can write otherwise it is difficult to write.\n        Undeniably consider that that you stated. Your favorite reason appeared to be on the web the simplest factor to keep in mind of. I say to you, I certainly get annoyed even as other folks think about worries that they plainly don&#39;t recognize about. You managed to hit the nail upon the highest as well as defined out the entire thing with no need side effect , folks could take a signal. Will likely be back to get more. Thank you\n            It&#39;s actually very complicated in this busy life to listen news on Television, therefore I just use the web for that reason, and take the hottest news.\n    I don&#39;t even understand how I stopped up right here, however I assumed this put up was great. I do not recognize who you might be however definitely you&#39;re going to a famous blogger for those who aren&#39;t already. Cheers!\n    I have read several just right stuff here. Certainly price bookmarking for revisiting. I wonder how a lot attempt you put to create one of these fantastic informative web site.\n            I am really thankful to the owner of this web page who has shared this impressive post at at this time.\n    Have you ever considered writing an e-book or guest authoring on other blogs? I have a blog based upon on the same topics you discuss and would love to have you share some stories/information. I know my subscribers would appreciate your work. If you are even remotely interested, feel free to send me an email.\n        It&#39;s nice to come across a blog every once in a while that isn&#39;t the same unwanted rehashed material.\n Excellent read! I&#39;ve saved your site and I&#39;m adding your RSS feeds to my Google account.\n    I simply must tell you that you have an excellent and unique website that I must say enjoyed reading.\n            Hi there friends, its wonderful paragraph about educationand completely explained, keep it up all the time.\n    Today, I went to the beach front with my children. I found a sea shell and gave it to my 4 year old daughter and said &#34;You can hear the ocean if you put this to your ear.&#34; She put the shell to her ear and screamed. There was a hermit crab inside and it pinched her ear. She never wants to go back! LoL I know this is totally off topic but I had to tell someone!\n        I simply must tell you that you have an excellent and unique post that I kinda enjoyed reading.\n                I must say, as a lot as I enjoyed reading what you had to say, I couldnt help but lose interest after a while.\n                Great information. Lucky me I found your blog by chance (stumbleupon). I have saved it for later!\n    I must say, as a lot as I enjoyed reading what you had to say, I couldnt help but lose interest after a while.\n        Just wanna input on few general things, The website layout is perfect, the articles is very superb : D.\n    I seriously love your website.. Pleasant colors &amp; theme. Did you make this site yourself? Please reply back as I&#39;m looking to create my very own website and would like to know where you got this from or exactly what the theme is called. Thank you!\n        Just wanna input on few general things, The website layout is perfect, the articles is very superb : D.\n                I kinda got into this website. I found it to be interesting and loaded with unique points of interest.\n                I was looking at some of your articles on this site and I believe this internet site is really instructive! Keep on posting .\n                    I every time spent my half an hour to read this web site&#39;s articles or reviews everyday along with a mug of coffee.\n    I conceive you have mentioned some very i\n......", "posttime": "2021-07-29 21:52:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,提示,programmer", "title": "邪恶程序员的提示：避免“简单”的事情（2016）", "title_en": "Evil programmer's tip: avoid “easy” things (2016)", "transed": 1, "url": "http://yosefk.com/blog/evil-tip-avoid-easy-things.html", "via": "", "real_tags": ["程序", "提示"]}, {"category": "", "categoryclass": "", "imagename": "ce42198129e3555c8b048958ebe39b3b.jpg", "infoid": 1070249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两名嫌疑人因入侵欧洲各地的取款机而被盗取近 25 万欧元后被捕。波兰警方于 7 月 17 日在波兰首都华沙逮捕了这两名来自白俄罗斯的嫌疑人。据称，他们通过钻孔或熔化机器的部件以将电线连接到笔记本电脑，从而获得了进入 ATM 机的权限。然后他们能够远程告诉自动提款机取钱。据协助调查的欧洲刑警组织称，欧洲有数十台自动取款机成为目标，估计总共被盗了 230,000 欧元。盗窃案至少发生在七个欧洲国家，犯罪分子总是针对同一品牌和型号的 ATM。来自波兰、德国、奥地利、瑞士、捷克共和国和斯洛伐克等六个国家的警察部队参与了调查。", "note_en": "Two suspects have been arrested after nearly a quarter of a million euros were stolen by hacking into cash machines across Europe.\n  Polish police arrested the two suspects, who are both from Belarus, in the Polish capital Warsaw on July 17.\n They had allegedly been gaining access to ATM machines by drilling holes or melting parts of the machines to physically connect wires to a laptop. Then they were able to remotely tell the cash machine to dispense money.\n   Dozens of ATMs across Europe were targeted, with an estimated €230,000 stolen in total, according to Europol, which helped with the investigation.\n The thefts occurred in at least seven European countries, and the criminals always targeted the same brand and model of ATM.\n Police forces from six countries took part in the investigation, including Poland, Germany, Austria, Switzerland, the Czech Republic and Slovakia.", "posttime": "2021-07-29 21:51:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,清空,cashpoints,欧洲", "title": "警方称，黑客通过清空欧洲各地的现金点窃取了 23 万欧元", "title_en": "Hackers stole €230k by emptying cashpoints across Europe, say police", "transed": 1, "url": "https://www.euronews.com/2021/07/29/hackers-stole-230-000-by-emptying-cashpoints-across-europe-say-police", "via": "", "real_tags": ["黑客", "清空", "欧洲"]}, {"category": "", "categoryclass": "", "imagename": "a25f49334704778cca8fd96b07c5ba33.jpg", "infoid": 1070248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿拉斯加的惠蒂尔是威廉王子湾西侧的一个沉睡小镇，坐落在风景如画的群山之间。但是，如果您正在想象一小堆房子，请再想一想。取而代之的是，在城镇的边缘，矗立着一座名为 Begich Towers 的 14 层建筑——一个前军营，类似于一家老旧的旅馆，该镇 200 名居民中的大多数都住在那里。作家 Erin Sheehy 和摄影师 Reed Young 访问了惠蒂尔，以便在《加利福尼亚星期日杂志》上发表一篇题为“市政厅”的报道。当他们第一次走进 Begich Towers 时，Sheehy 说那感觉就像她高中的大厅。 “走廊入口处有布告栏，”她说。 “这是看起来像煤渣砌块的混凝土砌块，它们都涂成淡黄色。”邮局就在入口附近，警察局就在大厅的正下方。找到通往偏远城镇的路并不容易。您可以通过海路到达惠蒂尔，也可以选择一条穿过山脉的长单车道隧道，在任何时候都只能走一条路。\n“它仍然是一个相当难以进入的城镇，”杨说。 “另外，到了晚上，他们会完全关闭隧道。”然后是天气：每小时 60 英里的冬季风是残酷的。这就是为什么 Begich Towers 内的居民在一个屋檐下拥有他们需要的一切。 “还有一家便利店，”里德说。 “有卫生所。”这不是医院，但他们可以处理小病。惠蒂尔的一位居民琼·米勒 (June Miller) 在大楼的顶部两层拥有一家住宿加早餐旅馆。 “她以拥有全城最高档、最漂亮、室内设计最好的公寓出租而自豪，”杨说。 “她为所有住宿加早餐 [房间] 配备了双筒望远镜。......镇上的大多数人，尤其是建筑物的海港一侧，似乎都有双筒望远镜，”Sheehy 说。 “很多人把它们留在那里观看鲸鱼突破和山羊吃草之类的事情，”杨说。 “但六月总是告诉我们，这些基本上是为了查明你丈夫是否在酒吧。”\n“这家商店并不是一直都很忙，”杨说。 “所以他花了很多时间在那台电脑上。我记得加里说他的一个痴迷是跟上前 40 名的广播。” Sheehy 说，像 Gary Carr 这样的居民完全知道他们的城镇对外人来说是多么有趣。 “当我们设置我们的肖像时，他说，&#39;哦，伙计，也许我应该刮胡子，&#39;”她说。 “和他一起在商店里的那个人就像，&#39;没有人，他们想要阿拉斯加的赃物，你知道吗？他们想要那个真正的阿拉斯加。&#39; ” 住在 Begich Towers 的老师 Erika Thompson 说，惠蒂尔的生活很正常。 “对我来说，这就是家，”她说。 “在大多数情况下，你认识每个人。这是一个屋檐下的社区。我们拥有我们需要的一切。”她已经在那里住了五年了。她说每个人都有一个关于他们如何在惠蒂尔结束的故事。 “有些人喜欢它，因为它可以真正具有社交性，”她说。 “有些人喜欢它，因为它可以隐居。”\n在 Young 和 Sheehy 两周的报道之旅之后，他们说他们对自己的家乡有了全新的看法。 “景色太不真实了。你有这个海湾，然后是这些巨大的山脉。很难想象人们每天都能醒来，”杨说。 “实在太棒了。” “回到纽约，我看到了我们所有人妥协的方式，”希伊说。 “对于惠蒂尔的很多人来说，在那里比在下面的某个地方更有意义。”", "note_en": "Whittier, Alaska, is a sleepy town on the west side of Prince William Sound, tucked between picturesque mountains. But if you&#39;re picturing a small huddle of houses, think again.\n  Instead, on the edge of town, there stands a 14-story building called Begich Towers — a former Army barracks, resembling an aging hotel, where most of the town&#39;s 200 residents live.\n    Writer Erin Sheehy and photographer Reed Young visited Whittier for a report, &#34;Town Hall,&#34; in  The California Sunday Magazine.\n  When they first stepped inside Begich Towers, Sheehy says it felt like the halls of her high school.\n    &#34;There were bulletin boards along the hallway entrance,&#34; she says. &#34;It&#39;s concrete blocks that look like cinder block, and they were all painted pale yellow.&#34;\n  The post office is near the entrance and the police station is right down the hall.\n    Finding your way to the remote town isn&#39;t easy. You can get to Whittier by sea or take a long, one-lane tunnel through the mountains, which at any given time only runs one way.\n  &#34;It&#39;s still a fairly inaccessible town,&#34; Young says. &#34;Plus, at night, they close the tunnel completely.&#34;\n    Then there&#39;s the weather: The 60 mph winter winds are brutal. That&#39;s why residents inside Begich Towers have everything they need under one roof.\n    &#34;And there&#39;s a convenience store,&#34; Reed says. &#34;There is a health clinic.&#34; It&#39;s not a hospital, but they can handle minor ailments.\n      One Whittier resident, June Miller, owns a bed and breakfast on the building&#39;s top two floors.\n  &#34;She prides herself on having the fanciest and prettiest, best interior-designed condos for rent in the whole town,&#34; Young says.\n    &#34;She outfitted all of the bed and breakfast [rooms] with binoculars. ... Most people in town, particularly on the harbor side of the building, seem to have binoculars,&#34; Sheehy says.\n  &#34;A lot of people keep them there to watch whales breaching and mountain goats grazing and things like that,&#34; Young says. &#34;But June always told us that these are basically for finding out if your husband&#39;s at the bar.&#34;\n    &#34;The store isn&#39;t so busy all the time,&#34; Young says. &#34;So he spends a lot of time on that computer. And I remember Gary saying that one of his obsessions was keeping up with Top 40 radio.&#34;\n    Sheehy says residents like Gary Carr were fully aware of how interesting their town was to outsiders.\n    &#34;When we were setting up our portrait, he said, &#39;Oh, man, maybe I should shave my beard,&#39; &#34; she says. &#34;And this guy who was in the store with him was like, &#39;No man, they want that Alaska swag, you know? They want that real Alaska.&#39; &#34;\n    Erika Thompson, a teacher who lives in Begich Towers, says life is pretty normal in Whittier.\n  &#34;For me it&#39;s just home,&#34; she says. &#34;For the most part, you know everybody. It&#39;s a community under one roof. We have everything we need.&#34;\n       She&#39;s lived there for five years now. She says everyone has a story of how they ended up in Whittier.\n  &#34;Some people love it because it can be really social,&#34; she says. &#34;And some people love it because it can be reclusive.&#34;\n  After Young and Sheehy&#39;s two-week reporting trip, they say they have a whole new perspective on their own hometowns.\n  &#34;The views were just unreal. You have this bay, and then these giant mountains. It&#39;s hard to imagine that people get to wake up to that every day,&#34; Young says. &#34;It was incredible.&#34;\n  &#34;Coming back to New York, I see the ways that all of us compromise things,&#34; Sheehy says. &#34;And for a lot of people in Whittier, it makes more sense to be there than somewhere down here.&#34;", "posttime": "2021-07-29 21:51:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "屋檐下,alaska,惠蒂尔", "title": "阿拉斯加惠蒂尔，一个屋檐下的社区（2015）", "title_en": "Whittier, Alaska, a community under one roof (2015)", "transed": 1, "url": "https://www.npr.org/2015/01/18/378162264/welcome-to-whittier-alaska-a-community-under-one-roof", "via": "", "real_tags": ["屋檐下", "alaska", "惠蒂尔"]}, {"category": "", "categoryclass": "", "imagename": "de8edb6e248a076d1312f57ae981391a.jpg", "infoid": 1070247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018 年底，在谷歌工作了四年的研究员 Chelsey Glasson 搬到了一个新团队。当时她怀孕了，她说她立刻觉得自己受到了歧视。她的新老板暗示她即将休的产假可能会“动摇”，她实际上被剥夺了管理职责。当她向人力资源部提出投诉时，她获得了 10 次免费咨询，该咨询师与 Google 签约并在校园内有空。当时，她想，“多么棒的资源，我当然要利用它。”一年多后，当格拉森女士对谷歌提起怀孕歧视诉讼时，她的顾问告诉格拉森女士，在谷歌要求访问他们的会话记录后，她看到她“真的很紧张和不舒服”。 “她担心与我合作会损害她与谷歌的合同，”格拉森女士说。 “在我的经历中，那是一个令人难以置信的低落、令人沮丧的时刻，”她说。西雅图大学咨询项目副教授克里斯蒂·李 (Kristi Lee) 表示，辅导员建议在格拉森女士提起诉讼后立即结束他们的咨询，这听起来像是“放弃客户”，这可能违反了正式的辅导员道德准则。格拉森女士的顾问没有回应一再提出的置评请求。格拉森女士说，谷歌已经在使用这些传票记录表明她因为个人原因而感到痛苦，而不是因为潜在的有毒工作环境或歧视。她说她曾被“问到非常私密的问题”，了解她的心理健康状况以及她最初寻求治疗的原因。在接受《泰晤士报》采访时，六名前任和现任谷歌员工回忆说，当他们公开反对工作场所的不当行为时，他们也获得了免费的短期咨询——称为员工援助计划 (EAP)——或病假。这种模式最初是由 NBC 新闻在 3 月份报道的，其中引用了十多名现任和前任员工。\n一位因不允许与记者交谈而要求匿名的谷歌高管表示，当员工报告与同事的工作有困难时，谷歌的人力资源官员会被指示提醒这些员工，公司提供多达 20 种治疗一年的会议。 （谷歌最近将福利扩大到 25 次。）当然，提供咨询不一定是坏事。 2018 年，在 YouTube 位于加利福尼亚州圣布鲁诺的总部发生枪击事件后，YouTube 的母公司谷歌为员工提供了短期咨询，以帮助他们应对创伤。这种咨询也不是谷歌独有的。许多行业的大公司，包括金融和物流，都提供类似的服务。但人力资源专家埃里卡·斯科特 (Erica Scott) 表示，如果将咨询用作权宜之计或解决紧张的工作场所情况的快速解决方案，这些情况在法律上可能不会被视为骚扰或欺凌，但仍然是不可接受的，因此可能会出现问题。她说，在指导员工接受咨询计划的同时容忍糟糕的经理是一种“令人震惊的”方式，可以“保护雇主免于承担责任”。 “这些是雇主有义务处理的雇员事务，而不是第三方。”一些提出担忧的谷歌员工表示，虽然病假和咨询是有用的资源，但对他们投诉的内部调查要么没有进行，要么最终拖了几个月。 “我们认为，提供员工可以选择使用的免费第三方咨询和支持是雇主为支持员工所做的正确选择，而且这对许多员工来说非常有益，”Shannon Newberry 说。谷歌发言人在一封电子邮件中说。 “我们永远不会提供员工援助计划来代替调查，”她补充说，并指出去年在全公司范围内实施的投诉调查方式的变化。该公司拥有超过 140,000 名员工，还补充说，在 2020 年使用过咨询服务的谷歌调查受访者中，90% 对这项服务感到满意或高度满意。\n在大多数情况下，当公司引导员工接受咨询时，该人会被要求与咨询师分享他们的医疗和心理健康史，这与去看新医生没什么两样。但 Mizrahi Law 的创始人 Ramit Mizrahi 表示，这可能会使他们陷入一种情况，即在工作场所或办公室校园中会出现有关他们过去的敏感信息。就业律师 Ann Hull 表示，在过去五年左右的时间里，滥用短期咨询服务的现象在各行各业开始变得越来越普遍。她对顾问（通常是与多家公司合作的承包商）会在多大程度上保护员工的隐私表示担忧。米兹拉希女士说，如果员工继续起诉公司要求精神损失，这样可以获得比仅起诉经济损失更多的赔偿，雇主可能会利用这些私人记录，就像谷歌在格拉森女士的案件中所做的那样.治疗或咨询越新，笔记就越有可能被使用。 “如果一个潜在客户打电话给我说：‘我在工作中受到骚扰，我会感到非常紧张和焦虑。你认为我应该使用我公司的 EAP 吗？&#39;” Mizrahi 女士说，“我会建议他们不要这样做。” 2018 年夏天，时任谷歌员工的埃米·尼特菲尔德 (Emi Nietfeld) 向人力资源部提起了对其直接主管的性骚扰投诉。几个月来，他一直在对她发表不恰当的评论，她在《泰晤士报》的一篇客座文章中写道，并以让她感到不舒服的方式触摸她。调查持续了近三个月。在此期间，尼特菲尔德女士仍然坐在骚扰者旁边，与他进行一对一的会谈。她感到紧张、不安，经常无法入睡。每当她询问调查时间表时，谷歌都会为她提供三个相同的选择：免费咨询、在家工作或病假。 “这让我觉得问题出在我身上，”她说。在她与时报分享的那段时间的日记中，她写道：“我讨厌公司对待我的方式，就像我生病了一样。”\n当时，谷歌已与 Concern Health 签约提供咨询服务，此后它转而使用 Lyra Health。在 Google 员工与《纽约时报》共享的 Lyra 隐私协议中，该公司表示，除非“法院命令或其他法律要求有此要求”，否则未经客户许可，不会与 Google 共享信息。不清楚在这种情况下“其他法律要求”是什么意思，但法律有时会要求治疗师和顾问在未经患者同意的情况下分享私人信息，例如，如果患者对他人构成可信的威胁或披露儿童正在遭受虐待. Lyra Health 在其他公司提供咨询服务，包括 eBay、Facebook 和星巴克，没有回应置评请求。工作场所的心理健康咨询已经存在了一段时间：它可以追溯到 1930 年代后期，当时它主要用于帮助公司识别生产力下降的酗酒员工，后来在 1940 年代扩展到咨询。它通常与通过健康保险提供的心理健康治疗分开。然而，这两种形式的咨询和治疗都应遵守健康保险流通和责任法案，或 HIPAA，这是一项确保患者隐私的联邦法律。 Nietfeld 女士已经在看外部治疗师，但在提出性骚扰投诉后，她考虑与现场顾问预约，认为他们可能会更好地了解谷歌的“非常特殊的文化”。她被告知要等待三到四个月才能找到顾问，这表明该服务的使用范围有多广。最终，她在调查期间没有使用咨询服务。后来，当人力资源部证实了她的说法时，她再次接受了咨询，但表示仍希望她坐在骚扰她的人旁边。 “Alphabet 似乎将 EAP 视为有人在工作中遇到问题时的首选。他们似乎在调查开始之前、在人力资源过程中甚至在结果之后都建议使用 EAP，”Alphabet 工人工会发言人克里斯施密特在一封电子邮件中说。 “但这不是一个经过深思熟虑的选择：每当有人提到任何情绪时，它都是默认的回退，而没有真正考虑它是否真的会帮助受影响的人，”他说。 “他们正在有效地将心理健康服务武器化。”格拉森女士——她对谷歌的诉讼将于 12 月开庭审理——她说，作为一名经理，她被指示鼓励一名陷入困境的员工使用咨询服务。她收到了一个带有心理健康选项的电子邮件模板，可以转发给她的直接下属，《泰晤士报》对其副本进行了审查。格拉森女士说，当她后来发现自己受到主管的歧视时，她收到了一封来自人力资源部的类似电子邮件，这次是鼓励她使用咨询服务。但人力资源部并没有调查她的主张，正如她在法庭文件中所声称的那样。 “当你去人力资源部寻求帮助时，你被告知，&#39;你考虑过咨询吗？&#39;这最终是在传达你是问题所在，”她说。\n“它的目的是让你停下脚步，让你沉默——这当然让我停下来停顿一下，”她补充道。 Alphabet 工人工会本月发布了一份在线请愿书——与一名谷歌员工的新指控有关，该员工称她在 5 月被一名同事强奸，然后休病假——敦促该公司“停止推动员工在面临骚扰或其他工作场所虐待时接受 EAP 治疗。”另一位因仍在公司工作而要求匿名的谷歌员工回忆说，当她抱怨一名种族主义和有毒的经理时，她被告知也许她需要弹性培训。她也得到了同样的选择：咨询或带薪病假。她选择了后者。一位驻伦敦的前谷歌员工表示，当她提出性侵犯指控时，她也得到了咨询。她在一封电子邮件中说，当谷歌道德人工智能团队的前联合负责人蒂姆尼特·格布鲁 (Timnit Gebru) 对这家科技巨头的人工智能存在偏见表示担忧时，她还获得了“关于正念的资源”。她拒绝了这个提议，告诉人力资源部，“再多的正念也无法解决充满敌意的工作环境。” “当我有新客户时，我的第一个问题是，&#39;你在前几年见过治疗师吗？&#39;”米兹拉希女士说。如果某人很久以前因为与当前案件无关的原因看过治疗师并且在他们的工作环境变得具有挑战性之前精神健康，那么律师可以争辩说这些以前的记录是无关紧要的，不应在诉讼中交给公司的律师.但是当有同期治疗的记录时，就很难争辩说它们与手头的案件无关。 （当然，在某些情况下，这些证据实际上可能最终支持员工的案子。）当顾问或治疗师收到传票时，他们可以采取行动取消传票，或者他们可能会寻求交出“尽可能少的信息” ，”西雅图大学的李博士说。然而，当涉及传唤 EAP 顾问时，“我可以看出可能存在潜在的利益冲突，”她补充道。\n就业律师赫尔女士说，辅导员所在的位置也可能暗示违反独立性。 “我真的很怀疑 EAP 顾问和人力资源部在同一栋楼里，有时和人力资源部在同一间套房里，”她补充道。她回忆说，她的一个与谷歌无关的客户告诉雇主提供的顾问，她正在考虑聘请一位对她的工作环境有投诉的律师。第二天，据赫尔女士说，人力资源部把这名员工拉到一边，问她为什么要聘请律师——除了她的顾问，她没有向任何人透露过这一事实。米兹拉希女士说，在许多情况下，当原告意识到他们的咨询和医疗记录可能会在情绪困扰案件中公开时，他们决定要么和解或放弃索赔。", "note_en": "In late 2018, Chelsey Glasson, a researcher at  Google who had worked there for four years, moved to a new team. She was pregnant at the time and said she immediately felt she was being discriminated against. Her new boss suggested that her forthcoming maternity leave might  “rock the boat,” and she was effectively stripped of her management responsibilities.\n When she filed a complaint with human resources, she was offered 10 free sessions with a mental health counselor who was contracted by Google and available on campus.\n At the time, she thought, “What a great resource, of course I’m going to take advantage of this.”\n More than a year later, when Ms. Glasson filed a pregnancy discrimination lawsuit against Google, her counselor told Ms. Glasson that she was “really nervous and uncomfortable” seeing her after Google had asked for access to records of their sessions. “She was concerned that affiliating with me would compromise her contract with Google,” Ms. Glasson said.\n “That was an incredibly low, deflating moment in my experience,” she said. That the counselor suggested ending their sessions as soon as Ms. Glasson had filed a lawsuit sounds like “client abandonment,” said Kristi Lee, associate professor for Seattle University’s counseling program, which is potentially a violation of a formal ethical code for counselors. Ms. Glasson’s counselor did not respond to repeated requests for comment.\n Ms. Glasson said that already Google has been using those subpoenaed records to suggest that she was distressed for personal reasons, not because of a potentially toxic work environment or discrimination. She said she had been “asked very intimate questions” about her mental health and why she sought treatment in the first place.\n In interviews with The Times, six former and current Google employees recalled that when they spoke up against workplace misconduct, they, too, were offered free short-term counseling — called the Employee Assistance Program (E.A.P.) — or medical leave. This pattern was  originally reported by NBC News in March, which cited over a dozen current and former employees.\n A Google executive, who asked not to be identified because he is not permitted to speak to reporters, said that when employees report difficulties at work with a colleague, Google’s human resources officers are instructed to remind those employees that the company offers up to 20 therapy sessions a year. (Google  recently expanded the benefit to 25 sessions.)\n Of course, offering counseling isn’t necessarily a bad thing. In 2018, after a shooting at YouTube’s headquarters in San Bruno, Calif., Google — YouTube’s parent company — offered employees short-term counseling to help deal with the trauma.\n Nor is this kind of counseling unique to Google. Large companies in lots of industries, including finance and logistics, offer something similar.\n But counseling can become problematic when it’s used as a stopgap or a quick fix to resolve tense workplace situations that might not legally be considered harassment or bullying but that are nonetheless unacceptable, said Erica Scott, a human resources expert.\n Tolerating bad managers while directing employees to a counseling program is a “shocking” way to “shield the employer from accountability,” she said. “These are employee matters that are the employer’s obligation to deal with, not a third party.”\n Some Google staff members who raised concerns said that while medical leave and counseling were helpful resources, an internal investigation into their complaints either didn’t take place, or ended up dragging on for months.\n “We think that offering free third-party counseling and support that employees can choose to use if they want is the right thing for an employer to do to support people, and they’ve been extremely beneficial for many employees,” Shannon Newberry, a Google spokeswoman, said in an email. “Our Employee Assistance Program would never be offered in place of an investigation,” she added, pointing to companywide  changes put in effect last year to how complaints are investigated. The company, which has more than 140,000 employees, also added that 90 percent of Google survey respondents who had used counseling services in 2020 were satisfied or highly satisfied with the service.\n In most cases, when a company steers an employee to counseling, that person would be asked to share their medical and mental health history with the counselor, not unlike seeing a new doctor. But that may put them in a situation in which sensitive information about their past is surfaced within a workplace context or on the office campus, said Ramit Mizrahi, founder of  Mizrahi Law.\n Ann Hull, an employment lawyer, said the misuse of short-term counseling started becoming more common across industries in the past five years or so. She expressed concern around how much the counselors — who are often contractors working with multiple companies — would protect an employee’s privacy.\n And if an employee goes on to sue the company for emotional damages, which can yield more compensation than suing only for economic losses, employers may be able to leverage those private records, Ms. Mizrahi said, as Google has done in Ms. Glasson’s case. The more recent the therapy or counseling, the more likely it is that the notes can be used.\n “If a potential client called me and said: ‘I’m being harassed at work, I feel really stressed and anxious. Do you think I should use my company’s E.A.P.?’” Ms. Mizrahi said, “I would advise them against it.”\n  In the summer of 2018, Emi Nietfeld, then a Google employee, filed a sexual harassment complaint with human resources against her direct supervisor. For months, he had been making inappropriate comments about her, she wrote  in a Guest Essay for The Times and touching her in ways that made her uncomfortable.\n The investigation lasted almost three months. During this time, Ms. Nietfeld was still sitting next to her harasser and having one-on-one meetings with him. She felt on edge, restless, often unable to sleep. Whenever she asked for a timeline on the investigation, Google offered her the same three options: free counseling, work from home or medical leave. “It made me feel like the problem was me,” she said.\n In her diary from that time, which she shared with The Times, she wrote: “I hated the way the company treated me like I was sick.”\n At that time, Google had contracted Concern Health to provide the counseling services, and it has since switched to Lyra Health. In Lyra’s privacy agreement, which Google employees shared with The Times, the company states that it would not share information with Google without a client’s permission unless “required to do so by a court order or other legal requirement.” It’s unclear what “other legal requirement” means in this context, but therapists and counselors are sometimes required by law to share private information without the patient’s consent, for example if the patient poses a credible threat to others or discloses that a child is being abused. Lyra Health, which provides counseling services at other companies, including eBay, Facebook and Starbucks, did not respond to requests for comment.\n Mental health counseling in the workplace has been around for a while: it can be traced back to the late 1930s when it was primarily used to help companies identify alcoholic employees  whose productivity was dipping, later expanding to counseling in the 1940s. It is usually separate to mental health therapy that would be available through health insurance. Both forms of counseling and therapy are, however, expected to adhere to Health Insurance Portability and Accountability Act, or HIPAA, a federal law that ensures a patient’s confidentiality.\n Ms. Nietfeld was already seeing an external therapist but, after filing the sexual harassment complaint, she considered making an appointment with an on-site counselor, believing they might better understand Google’s “very specific culture.” She was told it would be a three- to four-month wait before a counselor would be available, an indication of how widely used the service is. In the end, she didn’t use the counseling services during the investigation. Later, when human resources substantiated her claims, she was offered counseling again but said that she was still expected to sit next to her harasser.\n “Alphabet seems to view E.A.P. as the go-to any time someone has an issue at work. They seem to suggest E.A.P. before an investigation begins, during the H.R. process and even after an outcome,” Chris Schmidt, spokesman for the Alphabet Workers Union, said in an email. “But it’s not a carefully considered option: It’s a default fallback whenever someone mentions any emotion, without any real consideration of whether it will actually help the person affected,” he said. “They’re effectively weaponizing mental health services.”\n Ms. Glasson — whose  lawsuit against Google will go to trial in December — said that, as a manager, she was instructed to encourage a distressed employee to use the counseling services. She received an email template with mental health options to forward on to her direct report, a copy of which was reviewed by The Times.\n Ms. Glasson said that when she later found herself on the receiving end of discrimination from her director, she received a similar email from human resources, this time encouraging  her to use the counseling services. But human resources didn’t investigate her claims, as claimed  in her court filing.\n “When you go to H.R. to seek help and you’re told, ‘Well have you considered counseling?’ that ultimately is communicating that you’re the problem,” she said.\n “It’s meant to stop you in your tracks and silence you — it certainly made me stop and pause,”she added.\n The Alphabet Workers Union this month published an  online petition — related to new allegations from a Google worker who said that she was raped by a co-worker in May and then put on medical leave — urging the company to “cease the insidious process of pushing workers into E.A.P. therapy when they face harassment or other workplace abuses.”\n Another Google employee, who asked to remain anonymous because she still works at the company, recalled that when she complained about a racist and toxic manager, she was told that perhaps she needed resilience training. She was also offered the same options: counseling or paid medical leave. She chose the latter. A former Google employee based in London said she was also offered counseling when she came forward with sexual assault claims.\n When  Timnit Gebru, a former co-leader of Google’s Ethical A.I. team, raised concerns about bias in the technology giant’s artificial intelligence, she was also offered “resources on mindfulness,” she said in an email. She declined the offer, telling human resources that “no amount of mindfulness fixes a hostile work environment.”\n  “One of my first questions when I have new clients is, ‘Have you seen a therapist in the prior years?’” Ms. Mizrahi said. If someone had seen a therapist a long time ago for reasons unrelated to the current case and was otherwise mentally healthy until their work environment became challenging, lawyers can argue that those previous records are irrelevant and should not be handed over to the company’s lawyers in litigation.\n But when there are records of contemporaneous treatment, it becomes much harder to argue that they are irrelevant to the case at hand. (Of course, in some cases, that evidence might actually end up bolstering an employee’s case.)\n When a counselor or therapist receives a subpoena, they can move to have that quashed or they may seek to turn over the “minimal amount of information possible,” said Dr. Lee, of Seattle University. However, when it comes to subpoenaing an E.A.P. counselor, “I could see how there could be a potential conflict of interest,” she added.\n Where counselors are located might also suggest a breach of independence, said Ms. Hull, an employment attorney. “I get really suspicious of E.A.P. counselors who are in the same building as human resources, sometimes in the same suite as human resources,” she added.\n She recounted that one of her clients, not affiliated with Google, told an employer-provided counselor that she was considering hiring an attorney with complaints about her work environment. The next day, according to Ms. Hull, human resources pulled the employee aside to ask her why she was looking to hire a lawyer — a fact that she hadn’t disclosed to anyone except her counselor.\n In many cases, when plaintiffs realize that their counseling and medical records might be made public in emotional distress cases, they decide to either settle or drop their claims, Ms Mizrahi said.", "posttime": "2021-07-29 21:51:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,员工", "title": "“你是问题所在”：谷歌员工称不当行为被忽视", "title_en": "‘You’re the Problem’: Google Workers Say Misconduct Was Ignored", "transed": 1, "url": "https://www.nytimes.com/2021/07/28/us/google-workplace-complaints-counseling.html", "via": "", "real_tags": ["谷歌", "google", "员工"]}, {"category": "", "categoryclass": "", "imagename": "41a72292c070fe07a20144e3e1620c78.jpeg", "infoid": 1070246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是什么让人类独一无二？科学家们又迈出了一步，用一种新工具来解决一个持久的谜团，该工具可能允许更精确地比较现代人的 DNA 和我们已灭绝的祖先的 DNA。根据周五发表在《科学进展》杂志上的一项研究，我们的基因组中只有 7% 是与其他人类唯一共享的，而不是其他早期祖先共享的。 “这是一个很小的百分比，”研究的主要作者、现在在加州大学旧金山分校的计算生物学家 Nathan Schaefer 说。 “这种发现就是为什么科学家们不再认为我们人类与尼安德特人有如此大的不同。”该研究利用了从可追溯到大约 40,000 或 50,000 年前的现已灭绝的尼安德特人和丹尼索瓦人的化石遗骸中提取的 DNA，以及来自世界各地的 279 名现代人。科学家们已经知道现代人与尼安德特人共享一些 DNA，但不同的人共享基因组的不同部分。新研究的一个目标是确定现代人类独有的基因。这是一个困难的统计问题，研究人员“开发了一种有价值的工具，可以考虑古代基因组中缺失的数据，”威斯康星大学麦迪逊分校的古人类学家约翰霍克斯说，他没有参与这项研究。研究人员还发现，我们基因组的一小部分——仅 1.5%——既是我们物种独有的，也是当今所有活着的人共享的。这些 DNA 碎片可能包含着最重要的线索，可以真正区分现代人类。\n“我们可以看出基因组的这些区域高度富集与神经发育和大脑功能有关的基因，”加州大学圣克鲁斯分校计算生物学家理查德格林说，他是该论文的合著者。 2010 年，格林帮助制作了尼安德特人基因组的第一稿序列。四年后，遗传学家约书亚·阿基 (Joshua Akey) 与他人共同撰写了一篇论文，表明现代人类携带了一些尼安德特人 DNA 的残余物。从那时起，科学家们不断改进从化石中提取和分析遗传物质的技术。 “更好的工具使我们能够提出关于人类历史和进化的越来越详细的问题，”目前在普林斯顿大学并没有参与这项新研究的阿基说。他赞扬了这项新研究的方法论。然而，圣路易斯华盛顿大学的人口遗传学家艾伦邓普顿质疑作者的假设，即人类基因组的变化是随机分布的，而不是聚集在基因组内的某些热点周围。研究结果强调“我们实际上是一个非常年轻的物种，”Akey 说。 “不久前，我们与其他人类血统共享了这个星球。”", "note_en": "What makes humans unique? Scientists have taken another step toward solving an enduring mystery with a new tool that may allow for more precise comparisons between the DNA of modern humans and that of our extinct ancestors.\n Just 7% of our genome is uniquely shared with other humans, and not shared by other early ancestors, according to a study published Friday in the journal Science Advances.\n “That’s a pretty small percentage,” said study lead author  Nathan Schaefer, a computational biologist now at UC San Francisco. “This kind of finding is why scientists are turning away from thinking that we humans are so vastly different from Neanderthals.”\n The research draws upon DNA extracted from fossil remains of now-extinct Neanderthals and Denisovans dating back to around 40,000 or 50,000 years ago, as well as from 279 modern people from around the world.\n   Scientists already know that modern people  share some DNA with Neanderthals, but different people share different parts of the genome. One goal of the new research was to identify the genes that are exclusive to modern humans.\n It’s a difficult statistical problem, and the researchers “developed a valuable tool that takes account of missing data in the ancient genomes,” said  John Hawks, a paleoanthropologist at the University of Wisconsin-Madison who was not involved in the research.\n The researchers also found that an even smaller fraction of our genome — just 1.5% — is both unique to our species and shared among all people alive today. Those slivers of DNA may hold the most significant clues as to what truly distinguishes modern human beings.\n  “We can tell those regions of the genome are highly enriched for genes that have to do with neural development and brain function,” said UC Santa Cruz computational biologist  Richard Green, a coauthor of the paper.\n  In 2010, Green helped produce the first  draft sequence of a Neanderthal genome. Four years later, geneticist  Joshua Akey co-wrote a paper showing that  modern humans carry some remnants of Neanderthal DNA. Since then, scientists have continued to refine techniques to extract and analyze genetic material from fossils.\n “Better tools allow us to ask increasingly more detailed questions about human history and evolution,” said Akey, who is now at Princeton and was not involved in the new research. He praised the methodology of the new study.\n  However,  Alan Templeton, a population geneticist at Washington University in St. Louis, questioned the authors’ assumption that changes in the human genome are randomly distributed, rather than clustered around certain hot spots within the genome.\n The findings underscore “that we’re actually a very young species,” said Akey. “Not that long ago, we shared the planet with other human lineages.”", "posttime": "2021-07-29 21:50:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dna,人类", "title": "由于杂交，我们只有 7% 的 DNA 是现代人类独有的：研究", "title_en": "Thanks to interbreeding, just 7% of our DNA is unique to modern humans: study", "transed": 1, "url": "https://www.latimes.com/science/story/2021-07-16/thanks-to-interbreeding-just-7-of-our-dna-is-unique-to-modern-humans-study-shows", "via": "", "real_tags": ["dna", "人类"]}, {"category": "", "categoryclass": "", "imagename": "b86596d08ce6d39dc25547f9857cf491.jpg", "infoid": 1070245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你不能像一个优秀的炼金术士那样把水变成金子，那么接下来最好的事情可能就是把水本身变成一种闪亮的金属材料。研究人员通过在共享电子的碱金属周围形成一层薄水层来实现这一壮举。水在金属状态下只停留了几秒钟，但实验不需要通常需要将非金属材料转化为导电金属所需的高压。合著者、布拉格捷克科学院物理化学家 Pavel Jungwirth 说，看到水呈现出金色的光芒是他职业生涯的一大亮点。该团队于 7 月 28 日在 Nature 1 上发表了他们的研究结果。“这是一个最重要的进步，”英国牛津大学的化学家 Peter Edwards 说。 “谁能想到……青铜，金属水？”理论上，如果承受足够的压力，大多数材料都能变成金属。原子或分子可以紧紧地挤在一起，以至于它们开始共享它们的外部电子，然后它们可以像在一块铜或铁中一样移动和导电。地球物理学家认为，海王星或天王星等大质量行星的中心含有金属状态的水，高压金属氢甚至可以成为超导体，能够在没有任何阻力的情况下导电。 Jungwirth 说，以这种方式将水转化为金属需要 1500 万个大气压，这是当前实验室技术无法达到的。但他怀疑水可以以另一种方式导电：通过从碱金属中借用电子。元素周期表第 1 族中的这些反应性元素（包括钠和钾）倾向于提供最外层的电子。去年，Jungwirth 和他的同事 Phil Mason（一位化学家也以在 YouTube 上制作科学视频而闻名）领导的一个团队在氨 2 中展示了类似的效果。 英国人知道氨在这种条件下会发光的事实爱德华兹指出，十九世纪初的化学家汉弗莱·戴维（Humphry Davy）。该团队想用水代替氨来尝试相同的方法，但面临一个挑战：碱金属与水混合时往往会发生爆炸性反应。解决方案是设计一种实验装置，可以显着减慢反应速度，使其不会爆炸。研究人员用钠和钾（一种在室温下为液体的混合物）填充注射器，然后将其放入真空室中。然后他们使用注射器形成金属混合物的液滴，并将它们暴露在少量水蒸气中。水凝结在每个液滴上，形成了十分之一微米厚的一层。然后，液滴中的电子与正金属离子一起迅速扩散到水中，几秒钟内，水层变成了金色。\n柏林同步加速器的实验证实，金色反射产生了金属水的预期特征。 Jungwirth 说，避免爆炸的关键是找到一个时间窗口，在这个窗口中，电子的扩散速度比水和金属之间的反应速度快。 “他们已经成功地达到了准稳态，这样金属化的物理学就战胜了化学分解，”爱德华兹说。 “我们完全不确定我们会找到它，”Jungwirth 说。 “这太棒了，就像 [when] 你发现了一个新元素。” Jungwirth 说，这个实验是他日常工作中的一个令人耳目一新的休息，即在有机化学中运行计算机模拟，并提醒人们科学可以很有趣。 “这不是你可以获得补助金的事情，而是你可以在周末做的事情，”他说。这不是他第一次与梅森合作进行实际实验：2015 年，两位研究人员和他们的同事揭示了钠与水接触时发生爆炸的机制 3——他们在研究所的阳台上设置的一项实验，因为他们无法进入实验室。 “这让每个人都很生气，因为那里是人们吸烟的地方，”他回忆道。 “我们说：我们可以有爆炸的阳台吗？”", "note_en": "If you can’t turn water into gold like a good alchemist would, the next best thing might be to transform water itself into a shiny, metallic material. Researchers have achieved that feat by forming a thin layer of water around electron-sharing alkali metals.\n The water stayed in a metallic state for a only few seconds, but the experiment did not require the high pressures that are normally needed to turn non-metallic materials into electrically conductive metals.\n Co-author Pavel Jungwirth, a physical chemist at the Czech Academy of Sciences in Prague, says that seeing the water take on a golden shine was a highlight of his career. The team published its findings on 28 July in  Nature  1.\n “This is a most important advance,” says Peter Edwards, a chemist at the University of Oxford, UK. “Who would have thought it … bronze, metallic water?”\n  In theory, most materials are capable of becoming metallic if put under enough pressure. Atoms or molecules can be squeezed together so tightly that they begin to share their outer electrons, which can then travel and conduct electricity as they do in a chunk of copper or iron. Geophysicists think that the centres of massive planets such as Neptune or Uranus host water in such a metallic state, and that high-pressure  metallic hydrogen can even  become a superconductor, able to conduct electricity without any resistance.\n Turning water into a metal in this way would require an expected 15 million atmospheres of pressure, which is out of reach for current lab techniques, says Jungwirth. But he suspected that water could become conductive in an alternative way: by borrowing electrons from alkali metals. These reactive elements in group 1 of the periodic table, which includes sodium and potassium, tend to donate their outermost electron. Last year, Jungwirth and his colleague Phil Mason — a chemist who is also known for making  science videos on YouTube — led a team that demonstrated a similar effect in ammonia  2. The fact that ammonia can turn shiny in such conditions was known to the British chemist Humphry Davy in the early nineteenth century, Edwards points out.\n  The team wanted to try the same approach with water instead of ammonia, but faced a challenge: alkali metals tend to react explosively when mixed with water. The solution was to design an experimental set-up that would dramatically slow the reaction so that it would not be explosive. The researchers filled a syringe with sodium and potassium, a mixture that is liquid at room temperature, and placed it in a vacuum chamber. They then used the syringe to form droplets of the metal mixture and exposed them to small amounts of water vapour. The water condensed onto each droplet and formed a layer one-tenth of a micrometre thick. Electrons from the droplet then quickly diffused into the water — together with positive metallic ions — and, within a few seconds, the water layer turned golden.\n  Experiments at a synchrotron in Berlin confirmed that the gold reflections produced the signatures expected of metallic water. The key to avoiding an explosion, Jungwirth says, was to find a window of time in which the diffusion of electrons was faster than the reaction between the water and the metals. “They have managed to get to a quasi-steady state such that the physics of metallization wins over chemical decomposition,” Edwards says.\n “We were not sure at all that we would find it,” Jungwirth says. “It was amazing, like [when] you discover a new element.”\n Jungwirth says the experiment was a refreshing break from his day job, which is to run computer simulations in organic chemistry, and a reminder that science can be fun. “It’s not something you can get grant money for, but something you can do on your weekends,” he says. It’s not the first time he has collaborated with Mason on a practical experiment: in 2015, the two researchers and their colleagues revealed the mechanism that makes  sodium explode when it touches water  3 — an experiment they set up on a balcony at their institute, because they didn’t have access to a lab. “That pissed everybody off, because that was where people went smoking,” he recalls. “We said: could we have the balcony for explosions?”", "posttime": "2021-07-29 21:50:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变成,transformed,金属", "title": "水变成闪亮的金色金属", "title_en": "Water transformed into shiny, golden metal", "transed": 1, "url": "https://www.nature.com/articles/d41586-021-02065-w", "via": "", "real_tags": ["变成", "金属"]}, {"category": "", "categoryclass": "", "imagename": "5513df16258896e93e8bc175add04646.jpg", "infoid": 1070244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几十年来，口香糖是叛逆的象征，是青春焦虑的代名词，赋予咀嚼者大胆、虚张声势和性感的光环。 Rockstars 在舞台上咀嚼。青少年电影中的角色有态度咀嚼：“早餐俱乐部”（1985）中的高中生蔑视口香糖；在“油脂”（1978）中，Frenchy 吹大粉红色气球（据说演员在片场吹过 100,000 片口香糖）。现在泡沫破灭了。口香糖经历了一场严重的流行病：由于口罩遮住了嘴巴、约会推迟和泡吧取消，2020 年全球口香糖的销量比上一年下降了 14%。然而，甚至在疫情爆发之前，销售额就一直在下降。为什么口香糖脱落了？为了咀嚼而咀嚼有着悠久的历史。古希腊人咀嚼树皮。几个世纪以来，玛雅人和阿兹特克人一直在咀嚼菊苣，这是一种来自墨西哥人心果树的树脂，于 19 世纪抵达纽约。是美国人找到了一种出售粘性东西的方法。当地的口香糖企业家开始添加不同的口味，以巧克力为基础。在 1950 年代，制造商将巧克力换成了更便宜的合成橡胶和塑料。他们还推出了无糖口香糖。据报道，《油脂》的演员在片场用了 100,000 片口香糖，很少有产品像口香糖一样毫无意义，因此营销人员必须发挥创意。正如同名品牌创始人小威廉·瑞格利 (William Wrigley Junior) 指出的那样：“任何人都可以制作口香糖。卖掉是个问题。”答案是制作任何你想要的口香糖。 Kis-Me口香糖的卖点很明显（口号：“Far Better Than A Kiss”）； Vassar 是箭牌早期以一所精英女子学院命名的品牌，其目标是女性市场。当口香糖在第二次世界大战中通过口粮包加入战争时，它也变得爱国了。但口香糖真正的成功在于咀嚼它成为对权威的挑战。污名是上诉的一部分。咀嚼是一种削弱长辈的微妙方式：年轻女性被告知口香糖不淑女；在学校咀嚼成了一种蔑视的象征。\n到 1940 年代，好莱坞明星开始在世界各地制作口香糖。战时英国的年轻人模仿美国人的咀嚼方式，希望效仿他们的大摇大摆和无忧无虑的态度。流行文化，包括 1970 年代的银幕明星，巩固了这一形象。名人骄傲地咀嚼着。 2004 年，布兰妮斯皮尔斯吐出的一块口香糖在 eBay 上以 14,000 美元的价格拍卖。千年之后，事情变得很棘手。尽管白色的斑点仍然溅满了人行道（新加坡在 1992 年禁止口香糖除外），但十年前销量开始下降，并且一直在下降。有些人认为智能手机是有责任的：人们在超市结账时有其他东西可以分散他们的注意力（许多人一时冲动购买口香糖）。网上购物的激增也是一个因素。其他人则指责替代口气清新剂的兴起，例如薄荷糖。口香糖的文化表征也变得不那么突出：1990 年代的垃圾、非愤世嫉俗的流行文化，以叛逆的咀嚼者为代表，让位于健康饮食和有机食品的趋势。在素食主义兴起且可持续性成为卖点的时代，口香糖似乎不合时宜和复古。咀嚼塑料制品，或将它弄得满脸都是，对于仔细检查人造成分产品标签的年轻人来说，根本没有吸引力。过去很酷，不在乎。现在正好相反。咀嚼塑料，或把它弄得满脸都是，对年轻人没有吸引力 “大口香糖”现在面临着来自向幻灭的咀嚼者推销的新型环保、无塑料替代品的竞争。许多由千禧一代创立的新品牌，包括Simply Gum、True Gum 和Nuud Gum，都可以追溯到咀嚼的根源：这些新产品的核心成分是chicle。到目前为止，可生物降解的品牌卖得很好：它们肯定让消费者有一些咀嚼的东西。 ■", "note_en": "For decades, chewing gum was a symbol of rebellion, synonymous with youthful angst, bestowing the chewer with an aura of boldness, bravado and sex appeal. Rockstars masticated on stage. Characters in teen movies chewed with attitude: high-schoolers in “The Breakfast Club” (1985) popped gum with defiance; in “Grease” (1978) Frenchy blows big pink balloons (the cast reportedly got through 100,000 pieces of gum on set).\n  Now the bubble has burst. Gum has had a bad pandemic: with mouths cloistered by masks, dates delayed and clubbing cancelled, sales of gum fell by 14% worldwide in 2020 over the previous year. Yet sales had been in decline even before covid struck. Why has gum come unstuck?\n Chewing for chewing’s sake has a long history. Ancient Greeks munched bark. For centuries the Mayans and Aztecs chewed chicle, a resin from the Mexican sapodilla tree that arrived in New York in the 19th century. It was the Americans who found a way to sell the sticky stuff. Local gum entrepreneurs began to add different flavours, using chicle as a base. In the 1950s manufacturers swapped chicle for synthetic rubber and plastic, which were cheaper. They also introduced sugar-free gum.\n The cast of “Grease” reportedly got through 100,000 pieces of gum on set\n Few products are as pointless as chewing gum, so marketers had to get creative. As William Wrigley junior, founder of the eponymous brand, pointed out: “Anyone can make gum. Selling it is the problem.”\n  The answer was to make gum whatever you wanted it to be. The selling point of Kis-Me gum was obvious (slogan: “Far Better Than A Kiss”); Vassar, an early Wrigley’s brand named after an elite women’s college, was aimed at the female market. When gum joined the war effort via ration packs in the second world war, it became patriotic too.\n  But the real success of gum was when chewing it became a challenge to authority. Stigma was part of the appeal. Chewing was a subtle way to undermine your elders: young women were told that gum was unladylike; chewing in school became a symbol of defiance.\n By the 1940s Hollywood stars were making gum hip the world over. Youths in wartime Britain copied the chewing of American  s, hoping to emulate their swagger and carefree attitude. Pop culture, including on-screen stars of the 1970s, consolidated that image. Celebrities chewed with pride. In 2004 a piece of gum spat out by Britney Spears was auctioned on eBay for $14,000.\n Things got sticky after the millennium. Though splodges of white still splattered pavements (apart from in Singapore, which outlawed gum in 1992), sales started declining a decade ago and have kept on falling. Some reckon smartphones are responsible: people had something else to distract them at the supermarket checkout (many people buy gum on impulse). A surge in online shopping was also a factor. Others blamed the rise of alternative breath fresheners, such as mints.\n  Cultural representations of gum grew less prominent too: the trashy, uncynical pop culture of the 1990s, embodied by rebellious chewers, gave way to a trend for healthy eating and organic foods. In an age when veganism was on the rise and sustainability became a selling point, gum seemed anachronistic and retro. Chewing on plastic, or popping it all over your face, simply doesn’t appeal to youngsters who scrutinise product labels for artificial ingredients. It used to be cool not to care. Now the opposite is true.\n Chewing on plastic, or popping it all over your face, doesn’t appeal to youngsters\n “Big Gum” now faces competition from new eco-friendly, plastic-free alternatives pitched at disillusioned chewers. A number of new brands, including Simply Gum, True Gum and Nuud Gum, started by millennials go back to the roots of chewing : the core ingredient in these new products is chicle. So far, the biodegradable brands are selling well: they’ve definitely given consumers something to chew over.  ■", "posttime": "2021-07-29 21:50:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "破灭,bubble,咀嚼", "title": "泡沫破灭：口香糖是如何失去凉爽的", "title_en": "Bursting the bubble: how gum lost its cool", "transed": 1, "url": "https://www.economist.com/1843/2021/07/26/bursting-the-bubble-how-gum-lost-its-cool", "via": "", "real_tags": ["破灭", "bubble", "咀嚼"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我决定分担我女儿 Sterling 住院时间最短的一次住院费用。我的小女孩在 2021 年 5 月 11 日因先天性心脏病引起的并发症而失去了战斗。为什么我要分享她的一张（保险前）账单？因为，为什么不呢？如果我不能立即改变这个问题，我至少可以尝试引起人们的注意，毫无疑问，在大流行中它是多么的疯狂。斯特林于 2020 年 9 月 8 日出生时患有一种罕见的心脏病，称为左心发育不全综合征。她最终在三个月大时被诊断出患有一种非常罕见的遗传病，称为歌舞伎综合征。像其他综合症一样，歌舞伎综合症的特征可以是轻微的或严重的。不幸的是，斯特林受到了她的严重影响。斯特林在儿科 ICU 住了 207 天，4 次入住 ICU。值得庆幸的是，我们能够和我们的小女孩一起体验在家的生活，尽管时间不长。她必须见到她的（毛皮）兄弟，她的房间，她的婴儿床，密歇根湖/芝加哥/加里，印第安纳州的美丽日落，洗澡时间，一些家庭等等。甚至医生对 Sterling 接受的少量药物（例如 0.5 毫升/小时）的评论也很可笑。 Sterling 是低渗、胰岛素血症和其他内分泌问题。她只有一个功能正常的肾脏，患有中度/重度听力损失和髋关节发育不良。她一共做了9次手术。她是 G（胃/胃）和 J（空肠/小肠）喂养。她的耳朵里插着管子。她每周接受 IgG 治疗来治疗她的免疫缺陷，不幸的是，这甚至不是 Sterling 的全部情况。歌舞伎综合症对斯特林的影响远不止于此。我要分享的账单来自我们最短和最不必要的重症监护病房之一。 Sterling 在定期/定期检查后入院，因为她的血液检查显示她的钠含量极低。后来我们发现，这可能是由于我和我的妻子试图治疗 Sterling 的反流造成的，但正如我们现在所知，胃酸中含有大量的钠。在我们被重新录取后不久，一旦最初的录取过程平静下来，Sterling 稳定了，几毫升钠之后，我们就在回家的路上（又过了 9 天，然后再次被重新录取）。在第一张账单超过 2,500,000 美元之后，260,000 美元应该是在公园里散步......对吧？\n谢天谢地，我有保险，但这并没有让我担心，因为我知道自己可能会面临破产的风险。向在大流行（或任何其他原因）期间失去工作并因此失去保险的人大喊大叫，他们要么自己生病，要么生了病的孩子，因为没有保险（或保险不足），有人怎么能/怎么能负担得起？", "note_en": "I&#39;ve decided to share a hospital bill from one of my daughter Sterling&#39;s shortest ICU stays. My little girl lost her battle to complications arising from her congenital heart disease on May 11th 2021. Why am I sharing one of her (pre-insurance) bills? Because, why not? If I can&#39;t change the issue immediately, I can at least try to bring attention to how insane it&#39;s been, in a pandemic, no doubt.\n  Sterling was born with a rare variant of a heart disease called Hypoplastic Left Heart Syndrome on September 8th, 2020. She was ultimately diagnosed with a very rare genetic condition called Kabuki syndrome at three months old. Like other syndromes, features of Kabuki syndrome can be mild or severe. Unfortunately, Sterling was severely affected by hers.\n  Sterling was in a pediatric ICU for 207 days, through 4 ICU admissions. Thankfully, we were able to experience life at home with our little girl, albeit not for long. She got to meet her (fur) brothers, her room, her crib, the beautiful sunsets of Lake Michigan/Chicago/Gary, Indiana, bath times, some family, etc.\n    We knowingly walked a fine line with Sterling&#39;s condition; even doctors commented on the small amounts of medication Sterling was receiving (such as 0.5ml/hr) were laughable. Sterling was hypotonic, insulinemic and had other endocrine issues. She had only had one functioning kidney, she suffered from moderate/severe hearing loss and hip dysplasia. She had a total of 9 surgeries. She was G (gastro/stomach) and J (jejunum/small intestine) fed. She had tubes in her ears. She received weekly IgG treatments to treat her immunodeficiency, and unfortunately, that isn&#39;t even all of Sterling&#39;s conditions. Kabuki syndrome affected Sterling much more than that.\n  The bill I am sharing is from one of our shortest and most unnecessary ICU stays. Sterling was admitted after a regular/scheduled checkup because her blood work showed she had extremely low sodium levels. As we later found out, this was likely caused by my wife and I trying to treat Sterling&#39;s reflux, but as we now know, stomach acid contains a lot of your body&#39;s sodium.\n  Not long after we were re-admitted, once the initial admission process calmed down, and Sterling was stabilised, a few millilitres of sodium later, and we were on our way home (for another nine days before being re-admitted again).\n  After the first bill of $2,500,000+, $260,000 should be a walk in the park... right?\n  Thank goodness I have insurance, but it didn&#39;t stop me worrying knowing that I&#39;m an admission away from potential bankruptcy.\n  Shout out to the people who lost their jobs during the pandemic (or any other reason) and therefore their insurance, and were either sick themselves or had sick children, because without insurnace (or underinsured), how can/could someone afford this?", "posttime": "2021-07-29 21:49:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "婴儿,weeks,sterling", "title": "儿科/婴儿 ICU 两周的费用", "title_en": "The cost of two weeks in an pediatric/infant ICU", "transed": 1, "url": "https://kingsley.sh/posts/2021/two-weeks-in-the-icu-as-a-baby-with-heart-disease", "via": "", "real_tags": ["婴儿", "weeks", "sterling"]}, {"category": "", "categoryclass": "", "imagename": "bd589be12598777580d50e956e6b1738.jpg", "infoid": 1070242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "凭借其明显的六边形图案，蜂窝是动物工程的奇迹。为了实现在生活中罕见的几何规律，蜜蜂通过排列一排一排相同的六边形细胞来构建梳子，这些六边形细胞本身以六边形对称的互锁图案排列——因此，如果将其旋转 60°，则该图案看起来完全相同和以前一样。该设计最大限度地扩大了蜂蜜的储存面积，同时最大限度地减少了所需的蜡量。蜜蜂已经进化到即使在形状奇特的生活区（例如树干内部）也能制作普通的梳子。现在，多亏了计算机成像的一些帮助，科学家们对他们如何做到这一点有了更好的了解。奥本大学的行为生态学家、团队负责人迈克尔史密斯说：“这些女孩有一些诡计。”制造蜂巢的挑战之一来自它们的集体和无人监督的建造，在那里储存食物和蜜蜂生长。蜜蜂开始同时在蜂巢的不同位置建造蜂巢，向下工作。昆虫最终必须加入这些部分，这些部分通常不会均匀排列。那么蜜蜂如何将这些碎片连接成一个坚固的梳子呢？为了找到答案，史密斯和他的同事分析了 23 个蜡梳的照片，并使用计算机测量了其中 19,000 多个单独蜡细胞的大小、形状和方向。研究中的梳子不同于蜜蜂在商业蜂巢中制作的梳子，后者包含压花模板以鼓励一致的构造。由于缺乏这些辅助工具，研究中的蜜蜂会产生像自然界中的蜂巢一样的蜂巢，各个部分分别以不同的角度建造。当这些部分彼此靠近时，它们会在不规则的间隙处相遇，标准问题的六边形不适合。相反，蜜蜂通过建造大小和形状不规则的细胞来填补空白。研究小组本周在《美国国家科学院院刊》上报告说，这些细胞的范围从四个边到多达九个，比蜜蜂通常采用的几何多样性要多得多。科学家们已经知道蜜蜂会制造这些不寻常的细胞，但测量它们很乏味。自动化图像分析使团队能够寻找和量化模式。而且，事实证明，蜜蜂不仅仅用不同形状的细胞的随机分类来填补空白。相反，奇数单元的某些组合经常出现，例如由一个五边单元和一个七边单元组成的对。这种对的链也出现在自然界另一种引人注目的六边形图案中，即石墨烯中原子的排列，石墨烯是一种由单层碳原子组成的晶体。在一片石墨烯中，五七对出现在“晶粒”之间的边界处，其中六边形图案的方向不同。\n在石墨烯中，五对七对链减少了材料中被压抑的能量，巧合的是，使晶体更硬、更坚固。史密斯及其同事现在正试图找出蜜蜂是否采用相同的模式来增加梳子的强度，或者因为从几何角度来看，这是最容易做的事情。昆虫有时还必须加入一个用于容纳较小类型的雌性幼虫（那些将成熟为工蜂）的梳子和另一个用于容纳较大类型的雄性幼虫（那些长大成为生殖雄蜂的幼虫） .为此，六足工程师采取了不同的策略。研究小组发现，它们将两种类型的部分连接在一起，成排的六边形尺寸逐渐增加。这项研究“显示了整个蜜蜂系统的灵活性，”比勒陀利亚大学的行为生态学家 Christian Pirk 说，他没有参与这项研究。他说，未知的是蜜蜂在多大程度上通过远见和总体计划或在每一步应用的简单规则集来解决架构挑战。 Pirk 认为这些构建技术涉及无意识的决策。最少量的信息（不是主蓝图）用于构建复杂的结构，类似于按数字着色。 “即使你不知道你在画什么，图片仍然会出现。”他指出，这也可能部分来自反复试验，因为如果蜡细胞不合适，蜜蜂会迅速拆除它们。乌迪内大学的昆虫学家弗朗西斯科·纳齐（Francesco Nazzi）没有参与这项研究，他说，更多的见解可能来自观察蜜蜂建造蜡梳的情况。这很难做到，因为昆虫在黑暗中工作，但史密斯说这是他实验室的优先事项。研究人员摆弄蜡细胞以破坏建筑的实验可能会揭示可能涉及多少行为灵活性和规划。 Orawan Duangphakdee 是 King Mongkut 的吞武里技术大学的蜜蜂生物学家，没有参与这项工作，她说她已经对证据和蜜蜂印象深刻。 “蜜蜂的认知能力多棒啊。”", "note_en": "With its unmistakable hexagonal pattern, the honeycomb is a marvel of animal engineering. Achieving a geometric regularity rare in the living world, bees construct the comb by making row after row of identical six-sided cells, themselves arranged in an interlocking pattern with hexagonal symmetry—so that if you turn it by 60°, the pattern looks exactly the same as it did before. The design maximizes the storage area for honey while minimizing the amount of wax needed. And bees have evolved to make regular comb even in oddly shaped living quarters, such as the inside of tree trunks.\n Now, thanks to some help from computer imaging, scientists have a better idea of how they do it. “The gals have got some tricks up their sleeves,” says team leader Michael Smith, a behavioral ecologist at Auburn University.\n One of the challenges of making honeycombs, where food is stored and bees develop, comes from their collective and unsupervised construction. Bees start to build combs in different spots in the hive simultaneously, working their way downward. The insects eventually have to join these sections, which often do not line up evenly. So how do the bees connect the pieces into a single, sturdy comb?\n To find out, Smith and his colleagues analyzed photographs of 23 wax combs, using a computer to measure the size, shape, and orientation of more than 19,000 individual wax cells in them. The combs in the study differed from the sheets of comb that bees make in commercial hives, which contain embossed templates to encourage consistent construction. Lacking those aids, the bees in the study produced combs like those in nature, with various sections built separately and at different angles.\n As those sections grow toward one another, they meet at irregular gaps that standard-issue hexagons won&#39;t fit. Instead, the bees filled the gaps by building cells of irregular sizes and shapes. The  cells ranged from four sides to as many as nine, a lot more geometric diversity than bees typically employ, the team reports this week in  Proceedings of the National Academy of Sciences.\n Scientists already knew that bees make these unusual cells, but measuring them is tedious. The automated image analysis allowed the team to look for and quantify patterns. And, it turns out, the bees do not merely fill the gaps with random assortments of differently shaped cells. Instead, certain combinations of odd cells occur frequently, such as pairs consisting of a five-sided cell next to a seven-sided one.\n Chains of such pairs also show up in another of nature’s striking hexagonal patterns, the arrangement of atoms in graphene, a type of crystal made of a single layer of carbon atoms. In a sheet of graphene, the five-seven pairs appear at the boundaries between “grains,” regions in which the orientations of the hexagonal patterns differ.\n In graphene, the chains of five-seven pairs reduce the pent-up energy in the material and, coincidentally, make the crystal stiffer and stronger. Smith and colleagues are now trying to find out whether the bees employ the same pattern to increase the strength of the comb or because, geometrically, it’s the easiest thing to do.\n The insects must also sometimes join a section of comb built to house a smaller type of female larvae (those that will mature into worker bees) with another section built to house a larger type of male larvae (those that grow up to be reproductive drones). To do that, the six-legged engineers take a different tack. They join the two types of sections with rows of hexagons that gradually increase in size, the team found.\n The study “shows how flexible the whole honey bee system is,” says Christian Pirk, a behavioral ecologist at the University of Pretoria, who was not involved with the research. What’s not known is the degree to which bees are solving the architectural challenges with foresight and an overall plan or with sets of simple rules that they apply at each step of the way, he says.\n Pirk thinks these construction techniques involve unconscious decision-making. A minimal amount of information—not a master blueprint—is used to build complex structures, akin to coloring by numbers. &#34;The picture will still emerge even if you do not have a clue what you are drawing.&#34; It might also result in part from trial and error, he notes, as bees will quickly tear down wax cells if they don&#39;t fit.\n More insights might come from observing the bees building wax combs, says Francesco Nazzi, an entomologist at the University of Udine, who was not involved with the study. That&#39;s difficult to do, as the insects work in the dark, but Smith say it&#39;s a priority for his lab. Experiments in which researchers fiddle with the wax cells to disrupt construction might reveal how much behavioral flexibility and perhaps planning might be involved.\n Orawan Duangphakdee, a bee biologist at King Mongkut&#39;s University of Technology Thonburi, who was not involved with the work, says she&#39;s already impressed by the evidence—and by the bees. &#34;How wonderful the bee&#39;s cognitive ability is.&#34;", "posttime": "2021-07-29 21:49:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帮助,carpentry,蜜蜂", "title": "聪明的木工帮助蜜蜂修复野生蜂巢", "title_en": "Clever carpentry helps bees fix wild honeycombs", "transed": 1, "url": "https://www.sciencemag.org/news/2021/07/clever-carpentry-helps-bees-fix-wild-honeycombs", "via": "", "real_tags": ["帮助", "carpentry", "蜜蜂"]}, {"category": "", "categoryclass": "", "imagename": "e74351c4b905d080db2cea2aa33e572d.png", "infoid": 1070241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想人们可能熟悉那些通常相对微不足道的带有水果方程式的模因，同时声称“95% 的人无法解决这个问题！”有时这会导致有趣的模仿。然而，有人反其道而行之，只使用自然数创建了一个真实的、可解决的问题实例，其最小解是……非常大。我喜欢这种类型的问题可以真正开启数学如何真正开放式、创造性和未完成的对话的方式。将一个水果方程问题设计成一个过滤器，让人们要么因为不理解它而感到愚蠢（毕竟它基本上是代数），要么因为得到它而自鸣得意和优越，是非常无益的。但是，解释看似简单的问题实际上需要大量工作，并且会难倒专业数学家（参见费马大定理），这是一个很好的对话开始。它还可以涉及诸如几何如何处理代数问题（反之亦然！），解决方案如何使用问题中不存在的方法等问题。因此，为了纪念这一点，我想我在撰写本文时采用了目前尚未解决的最简单的丢番图方程（即：多变量多项式，并且只寻找整数解），并将其转化为水果方程。我们可以将其视为尝试数水果：这里的“最简单”是根据此 MathOverflow 问题中定义的“大小”概念，基本上它是衡量多元多项式的所有幂和系数的大小。给定大小的多项式只有有限多个。图片中的多项式为 ，大小为 29。每个大小为 28 及以下的多项式要么已经解出，要么没有解。这个想法是（通过实验）看到方程之间的粗略阈值在哪里，而不是以或多或少的基本方式解决，以及真正严重的技术或障碍真正发挥作用，这里概述的那种。我很高兴人们尽可能广泛地分享上面的图片。如果不出意外，说不定真的会有人解出上面的等式，贡献一份新知识！", "note_en": "I guess people may be familiar with the sorts of  memes with equations involving fruit that are generally relatively trivial, while claiming something like “95% of people can’t solve this!” Sometimes this leads to  amusing parodies. However someone  went the whole other way and created an real, solvable instance of the problem using only natural numbers whose smallest solution is …  very large.\n I like the way this type of problem can actually open up a dialogue of how mathematics is really open ended, creative and unfinished. Framing a fruit equation problem as a filter that makes people either feel stupid for not understanding it (it is basically algebra, after all), or smug and superior for getting it, is extremely unhelpful. But explaining that what can seem like an easy problem actually requires a lot of work, and would stump professional mathematicians (cf Fermat’s last theorem), is a good conversation starter. It can also touch on things like how geometry is brought to bear on algebraic problems (and vice versa!), how the solution can use methods not present in the problem and so on.\n So, in honour of this, I thought I take what seems to be, at time of writing, the simplest currently unsolved Diophantine equation (that is: a multivariable polynomial, and looking only for whole-number solutions), and turn it into a fruit equation. We can think of it as trying to count fruit:\n  Here ‘simplest’ is according to the notion of “size” defined in  this MathOverflow question, basically it’s a measure of how large all the powers and coefficients of a multivariable polynomial is. There are only finitely many polynomials of a given size. The polynomial from the picture is  , and has size 29. Every polynomial of size 28 and smaller has either  been  solved or shown to have no solutions. The idea is to see (experimentally) where the rough threshold is between equations than be solved in a more-or-less elementary way, and where really serious techniques or obstructions really kick in, of the sort outlined  here.\n I’m happy for people to share the above image as widely as they can. If nothing else, maybe someone will actually solve the equation above, and contribute a piece of new knowledge!", "posttime": "2021-07-29 21:49:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "diophantine", "title": "丢番图果实", "title_en": "Diophantine Fruit", "transed": 1, "url": "https://thehighergeometer.wordpress.com/2021/07/27/diophantine-fruit/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一些人使用乐高气动装置设计了布尔逻辑设备，并继续开发基本的计算机设备，如全加器和触发器。这些已经在 LUGNET 上进行了大量讨论。我曾怀疑会有大量使用机械原理的逻辑设备，但是（早在 2004 年）搜索机械逻辑设备并没有得到很多点击。一个机械逻辑页面详细介绍了使用杆来制作逻辑门。令我惊讶的是，我只看到了两个乐高网页，其中提供了机械逻辑门的任何细节。第一页有乐高非门的详细信息。遗憾的是，第二页现在都已不复存在，有一个极其复杂的与门的照片，使用顺时针和逆时针旋转来表示逻辑状态。如果您制作了任何机械逻辑门，请与我联系。终于有人接听了电话，尽管他们不是乐高，而是 K&#39;NEX，我会给你链接到 William Hilton 的 K&#39;NEX 逻辑门视频。他们仍然使用像我这样的推拉系统，但设计却大不相同。从那以后，谷歌进行了无数次尝试，但总的来说，他们的灵感最终来自这些和我自己的。最初我考虑将轴顺时针旋转用于逻辑 1，逆时针旋转用于逻辑 0。这是我发现的其他乐高逻辑门中使用的方法。但是，除了非门（我现在已经开发了一种方法来执行此操作，正如我在本页中所描述的那样），我实在想不出任何将轴运动从两个输入解耦到单个输出的方法。我决定尝试使用推/拉杆来表示逻辑状态。推入轴为逻辑 1，拉出轴为逻辑 0。这种方法的优点是您可以同时使用线性和旋转运动。我的机械逻辑门将运动的一个螺柱长度转换为另一个线性运动的螺柱。我现在已经设计了所有基本门的工作版本，即非门、或门、或非门、与门和与非门。最近，我制作了一个 XOR 门，它本身就是一个门，即不是 AND、OR 和 NOT 的组合。使用两个与非门，我创建了一个与非门锁存器或触发器。这些自然的后续是时钟逻辑、半加器和全加器，最终成为真正的“计算机”设备。这些大门只是示威者。它们可以工作，但由于齿轮滑动和惯性引起的限制，实际可行的用途是有限的。 NOT 门是第一个也是最容易设计的门。您所要做的就是确保一个推杆与另一个推杆相反，如图所示。原始的非门设计过度，在很多方面，非门作为一个实体是多余的。在所有非输入的逻辑门上，您只需要反转驱动机架向前或向后的齿轮的方向。这很容易受到影响，只需将输入推杆放在齿轮的底部或顶部，具体取决于您需要机架移动的方式。齿轮的方向在每种情况下都不同，因此齿轮作用在其上的任何齿条也将沿相反方向移动。这正是我们在注意输入时需要的动作。唯一需要对输出进行 NOTd 的情况是，如果我们不打算将其用作另一个门的输入，即使这样，对于可用的门，也不需要非门。缓冲门实际上是对非门的修改，有几种构造它们的方法。我选择了一个由不同大小的齿轮（24 和 8 齿）组成的简单系统，但杠杆也同样有效。这个想法是采用半螺柱输入并将其转换为单螺柱输出，从而创建一个在线放大，尽管是被动的。图片应该更清楚地显示这一点，或者您可以观看正在运行的缓冲区的视频。 OR 和 NAND 门相关，一个只是另一个带有 NOTd 输入的，这就是为什么它们都在本节中。 OR 门是我设计的第一个实际执行某些操作的逻辑门。我决定在 NOT 门之后制作 OR 门，因为有了这两个门，您可以制作 NAND、AND 和 NOR 门。或门的关键机制是其中一根横梁的旋转。这允许输入杆分别向后或向前移动，而无需改变输出杆的位置。轴另一端的固定横梁无论是由一根还是两根输入杆推动，都会向前移动。四种输入和输出状态如下图所示。有关如何构建模型的分步说明可供下载。如果您渴望看到它的实际效果，还可以观看视频。从逻辑上讲，与非门与具有 NOTd 输入的或门相同。这是一个非常有用的等价方法。我可以通过两种方式对我的 OR 门执行此操作。最简单的方法是在每个输入处使用非门。另一种方法是通过认识到不是输入只需要在每个齿轮系中有一个额外的齿轮，以反转齿条的运动。从照片中显示的四种逻辑状态应该可以清楚地看出这一点。不幸的是，通过使用额外的齿轮，门会受到齿轮微小松弛的影响。这减少了推杆的线性运动，以至于在两个门串联后，一切都停止了。有关如何构建模型的分步说明可供下载。还有一个视频可以观看。正如 OR 门和 NAND 门是相关的，AND 门和 NOR 门也是相关的，因此这两个门都在本节中介绍。\n只是非&gt;NAND门的输出并获得AND门似乎是一件简单的事情。但是，如果反转或门的内部轴机构，将固定梁和旋转梁的位置互换，那么或门就变成了与门！更重要的是，这意味着现在可以用比以前更少的部件来制作与非门（一个非+与，对比两个非+或）。有关如何构建模型的分步说明可供下载。还有一个视频可以观看。与与非门一样，或非门可以通过对或门输出进行非操作来简化。然而，正如与非门也可以通过对或门的输入进行非运算来制作，如果与门的输入是非门，那么你就会得到一个或非门。同样，这可以通过使用非门或在齿轮系中添加额外的齿轮来实现。有关如何构建模型的分步说明可供下载。还有一个视频可以观看。 XOR 门与普通 OR 门的不同之处在于 1,1 输入给出零输出。 XOR 门非常重要，因为它是加法器的基本组件。这是最难构建的门，主要是因为它是由两个 AND、两个 NOT 和一个 OR 门组成的复合门。当然我可以这样做，但这并不令人满意，并且考虑到惯性和齿轮滑动，这意味着半加器可能永远不会发生。但在 1 月 5 日左右，我终于破解了它。门使用了一种杠杆系统。它们是从顶部或底部推动的，如果仅从其中一个推动，它们将围绕其中心旋转。这就是诀窍，如果同时从顶部和底部推动杠杆，它将横向移动。好吧，这不是最清楚的解释，但希望下面的照片显示了处于四种可能状态的门以及显示内部工作原理的剖切照片将使事情变得更加清晰。如果失败，请查看可供下载的 XOR 门视频。触发器是一个复合逻辑门，通常由 NAND 或 NORS 制成。与半加器一样，没有触发器，现代计算将不存在。一旦你有了一个很好的简单工作的 NOR 或 NAND 门，那么构建触发器 (FF) 就变得很简单了。在计算中，FF 非常重要，因为它们构成了内存的基础。 FF 是由两个 NOR 或两个 NAND 门制成的设备。大多数 FF 是使用与非门制造的，并且有几种不同的类型。基本操作将一个门的输出作为另一个门的输入，反之亦然。这意味着 FF 有两个输入和两个输出。乐高 FF 的图片应显示正在发生的事情以及下面的描述。 FF 的初始设置为 Set=1、Clear=1 和 Q=1、Qbar=0。脉冲清除为 0。这使得 Q=0 和 Qbar=1，现在请注意，由于右侧的 NAND 输出为 1，因此清除对 Q 或 Qbar 都没有影响。现在脉冲设置为 0。这将变为 Q=1 和 Qbar=0。在这种情况下，左手与非门输出为 1，因此更改 Set 的值不会做任何事情。如果您查看任何数字电子书，您很快就会发现任何有用的东西都倾向于使用时钟脉冲来同步所有内容。时钟输入与逻辑输入分开，但它们是相关的。实现时钟的一种简单方法是使用两个与非门。这样做会将设置和清除操作从处理 0 到 1 的转换更改为处理 0 到 1 的转换。时钟触发器示例应该显示正在发生的事情以及下面的描述。 FF、Set、Clock (clk)、Clear 和 Qbar 的初始设置处于逻辑电平 0 且 Q 为 1。脉冲清除为 1，然后脉冲到时钟 (clk) 为 1。这使得 Q=0并且 Qbar=1。就像之前右手边的 NAND 输出为 1 一样，Clear 不会对 Q 或 Qbar 产生影响。时钟变为 0，然后清除变为 0。必须按此顺序完成以防止输出变得不确定。现在脉冲设置为 1，时钟设置为 1。这将变为 Q=1 和 Qbar=0。左边的与非门输出是 1，所以改变 Set 的值不会做任何事情。 Clock 变为 0，然后 Set 变为 0。就像之前一样，它必须按此顺序进行以呈现不确定的输出。可以为时钟信号构建一个边沿检测器。它需要更多的与非门。这样做的好处是，时钟信号何时回到 0 并避免不确定状态不再重要。半加器是计算的基本构建块。该器件由异或门和与门组成。有两个输入，分别输入 XOR 和 AND 门。还有两个输出，一个来自异或门，一个来自与门。 XOR 输出称为和，S，AND 输出称为进位，C。顾名思义，该设备添加二进制数！即在两位相加的情况下，0+0之和=0，进位0； 0+1 = 1，进位 0； 1+0 = 1，进位0，1+1 = 0，进位1。可惜只能加两位，显然限制了它的用处。然而，通过组合两个半加器，可以得到一个全加器，然后可以级联产生任何大小的二进制加法器。上图显示了处于四种不同状态的乐高半加器，其中 A 和 B 是输入，S 是总和，C 是进位位。还有一个正在运行的视频。推挽逻辑门有两个重大问题。第一个是惯性，第二个是输出衰减。增加的惯性意味着随着添加更多的门，需要对第一个门的输入施加越来越大的力来影响最后一个门的输出。输出衰减是机构（例如齿轮）滑动的结果。这种 slippage 错误是累积性的，这意味着在几个门之后，第一个逻辑状态的变化可能不会改变最后一个。为了克服这两个问题，需要一种为门供电的方法。为了实现这一点，我使用了线性执行器来获取旋转输入来驱动推挽逻辑机制。然后逻辑切换输出旋转的方向，从而改变电路中下一个门输入的旋转逻辑状态。实际上，推挽系统和旋转系统之间是统一的，这允许创建更复杂的反馈门，如翻转。\n推挽逻辑门有一个很大的缺点，那就是惯性。解决这个问题的唯一方法是使用某种放大器，电路板上 +ve 线的机械等效物。不幸的是，对于推拉系统，这几乎是不可能的。相反，我已经回到绘图板并考虑使用旋转来表示逻辑状态。我已经将轴在任何方向上的旋转都表示为逻辑一，而没有旋转（即轴是静止的）则为逻辑零。这意味着缓冲更容易实现。除了提出供讨论的想法之外，我没有发现其他网页详细说明使用旋转来表示逻辑。似乎没有人真正构建过任何东西，如果他们有，就我所知，它不在互联网上。好吧，这不太正确，网页上有乐高非门的详细信息。这个页面有一个旋转与门 os\\f 排序，但与我自己的相比，它非常复杂。我的旋转逻辑门背后的基本概念是旋转的加法和减法。这不是一个新想法，还有其他网站有这样的例子，好心的人向我建议了它。本质上，这种加法和减法允许建立一系列输出来表示您喜欢的一组输入的任何内容。每个逻辑门页面都显示了所涉及的基本代数。我最近获得了一本绝版书——Antonin Svoboda 所著的“计算机制和链接”，它说明并解释了许多机械计算的原理和技术，包括我使用的方法。如果您使用旋转制作任何机械逻辑门，请与我联系。旋转逻辑门的详细信息都可以在此页面上找到。用于构建旋转逻辑门的底层机制无非是增加或减少轴的旋转。我已经将轴在任何方向上的旋转都表示为逻辑一，而没有旋转（即轴是静止的）则表示为逻辑零。虽然旋转方向并不重要，但单一机构中的混合方向可能会导致各种问题。本节包含三种与轴旋转有关的数学运算：加法、减法和绝对值。最后一个特别有用，因为减法会导致等效逻辑输出沿不同方向旋转的情况，这会完全破坏任何后续门的操作。加法和减法的数学运算是通过使用差速器实现的，这是解耦和/或耦合轴旋转的唯一有效方法。绝对值是使用单向齿轮机制创建的。还演示了一个简单的开/关切换开​​关。由于它用于启动逻辑零/单状态，因此将其包含在本节中。使用本页描述的机制，理论上，可以创建和操作您可能想要的任何布尔逻辑函数（当然还有其他功能！）。当连接到差速齿轮内齿轮的两个轴同向旋转时，外壳也随之旋转。它以等于单个轴速度总和的一半的速度这样做，因此输出必须加倍。使用 16 齿和 8 齿齿轮很容易。这是加法表：这看起来很像 OR 门的真值表！几乎是，就像旋转或门部分所描述的那样，只要多一点力学和数学的知识就可以让我们到达那里。通过观看操作视频可能更容易理解加法机制。从加法到减法只是反转输入轴之一的旋转方向。当连接到差速齿轮内齿轮的轴之一反转时，外壳保持静止。当输入以相反方向旋转时，外壳就会转动。在下表中，您可以将 + 读为顺时针，- 读为逆时针。就像加法器一样，当外壳确实旋转时，它的旋转速度等于各个轴速度之和的一半，因此输出必须加倍。同样，这对于 16 和 8 齿齿轮来说很容易。这是减法表：现在那个表看起来不像异或门的真值表吗？！所要做的就是将输出旋转速度加倍，使其与输入相同，并且除了讨厌的符号变化之外，它是一个 XOR 门，如本页 XOR 门部分所述。如果您希望看到减法机制的实际效果，可以观看视频。为了获得旋转的绝对值，可以使用一种称为单向或单向齿轮的机制。多年来，在网络上发布了许多此类示例。从本质上讲，该机构所做的就是接受任何方向的输入旋转并提供始终沿相同方向旋转的输出。有两种方法（我知道）可以做到这一点。第一个，如此处所示，使用两组齿轮（见下面的视频）。一组是枢转的，将根据输入旋转的方式驱动不同的齿轮。第二种使用蜗轮而不是枢轴齿轮系。我怀疑后者更健壮，但当输入改变方向时，它会遭受相当长的滞后。可以在此处找到对第二种方法的很好解释。该站点也有旋转加法器/减法器的详细信息。您可以使用这些说明来构建该机制的一个版本。输入到输出值的表格很简单！", "note_en": "A few people have designed boolean logic devices using LEGO pneumatics and gone\t\t\t\t on to develop fundamental computer devices such as full-adders and flip-flops.\t\t\t\t These have been discussed greatly on  LUGNET.\t\t\t\t  \t\t\t\t I had suspected that there would be a large number of logic devices using\t\t\t\t mechanic principals, but (back in 2004) a search for mechanical logic devices didn&#39;t get many hits.\t\t\t\t One  mechanical logic page detailed the use of rods to make logic gates.\t\t\t\t  \t\t\t\t To my surprise I only came across two LEGO webpages that gave any details of\t\t\t\t mechanical logics gates. The  first page, has details of a LEGO NOT gate. And the\t\t\t\t  second page,\t\t\t\t sadly both are now defunct, had photos of an extremely complicated AND gate using clockwise and anti-clockwise rotation to represent the logic states.\t\t\t\t If you made any mechanical logic gates then please  contact me.\t\t\t\t  \t\t\t\tFinally some one answered the call and even though they&#39;re not LEGO, but K&#39;NEX, I&#39;ll give you\t\t\t\tthe link to William Hilton&#39;s video of his  K&#39;NEX logic gates.\t\t\t\tThey still use a push-pull system like mine, but the design is quite different. Since then there have been numerous attempts as google will tell, but in\t\t\t\tgeneral their inspiration is ultimately drawn from these and my own.\t\t\t\t \t\t\t\t Originally I considered using a clockwise rotation of an axle for logical 1 and\t\t\t\t anti-clockwise rotation for logical 0. This is the method used in the other LEGO\t\t\t\t logic gates I found. However, I simply couldn&#39;t conceive of\t\t\t\t any way to decouple the axle motions from two inputs to a single output - other\t\t\t\t than a NOT gate (I have now developed a method of doing this as I describe on this page). I decided to try using push/pull-rods to represent the\t\t\t\t logic states. Pushing an axle in would be logical 1, and pulling an axle out\t\t\t\t would be a logic 0. The advantage of this method is that you can used both\t\t\t\t linear and rotational motion. My mechanical logic gates take one-stud length\t\t\t\t of motion and convert it to another one-stud of linear motion.\t\t\t\t \t\t\t\t I have now designed working versions of all the basic gates,\t\t\t\t the NOT, OR, NOR, AND, and NAND gates. More recently\t\t\t\t I&#39;ve produced an XOR gate that is a single gate in its own right, i.e.\t\t\t\t not a composition of ANDs, ORs and NOTs. Using two NAND\t\t\t\t gates I created a NAND gate latch or Flip-Flop. The natural follow on\t\t\t\t from these is clocked logic, half and full adders and ultimately a\t\t\t\t genuine &#34;computer&#34; device. These gates are\t\t\t\t just demonstrators. They work, but because of the limitations that\t\t\t\t arise through gear slippage\t\t\t\t and inertia, the real practicable use is limited.\n  The NOT gate was the first and easiest gate to design. All you have to do\t\t\t\t\t is ensure that one push-rod does the opposite of the other as can be seen in the\t\t\t\t\t pictures.\t\t\t\t\t \t\t\t\t\t The original NOT gate is very over-engineered and in many ways the NOT gate as an entity is\t\t\t\t\t redundant. On all the logic gates to\t\t\t\t\t NOT an input you only need to reverse the direction of the\t\t\t\t\t cog that drives the rack forward or backward. This is easily affected by simply having the input push-rod acting\t\t\t\t\t at the bottom or the top of the cog depending on which way you need the rack to move.\t\t\t\t\t \t\t\t\t\t The cog&#39;s direction is different in each case, so any rack that the cog acts on will also move in an opposite direction.\t\t\t\t\t This is exactly the motion we require when NOTing an input. The only time an output needs to be NOTd is if we are&#39;t going\t\t\t\t\t to use it as an input to another gate, even then, with the available gates, a NOT gate shouldn&#39;t be required.\n  The buffer gate is effectively a modification of the NOT\t\t\t\t\t \tgate and there are several ways to construct them. I chose a simple\t\t\t\t\t \tsystem of differently sized cogs (24 and 8 tooth), but levers would work equally\t\t\t\t\t \twell. The idea is to take a half-stud input and convert it to a\t\t\t\t\t \tone-stud output, thereby creating an in-line amplification, albeit\t\t\t\t\t \tpassively. The pictures should show this more clearly, alternatively you \t\t\t\t can watch the video of the buffer in action.\n  The  OR and  NAND\t\t\t\t gate related, one is simply the other with NOTd\t\t\t\t inputs, which is why they&#39;re both in this section.\n  The OR gate was the first logic gate I designed that actually does something. I\t\t\t\t\t decided to make the OR gate after the NOT gate because with these two you can\t\t\t\t\t make NAND, AND, and NOR gates.\t\t\t\t\t \t\t\t\t\t The key mechanism in the OR gate is the rotation of one of the cross-beams. This\t\t\t\t\t allows either input rod to go back or forward, separately, without changing the\t\t\t\t\t position of the output rod. The fixed cross-beam at the other end of the shaft will\t\t\t\t\t move forward regardless of whether it is pushed by one or both input rods.\t\t\t\t\t The four input and output states are shown on the figures below.\t\t\t\t\t \t\t\t\t\t The\t\t\t\t\t  step-by-step instructions on how to build the model are available for downloading.\t\t\t\t\t \t\t\t\tAnd if you&#39;re keen to see it in action there is also a video available to watch.\n  Logically a NAND gate is the same as an OR gate with NOTd inputs. This is a\t\t\t\t\t very useful equivalence. There are two ways I could have done this to my OR\t\t\t\t\t gate. The easiest is to use the NOT gate at each input. The other way was by\t\t\t\t\t recognising that to NOT the inputs just requires an extra cog in each gear train,\t\t\t\t\t to reverse the motion of the racks. This should be clear from the four logic\t\t\t\t\t states shown in the photos.\t\t\t\t\t \t\t\t\t\t Unfortunately, by using extra cogs, the gate suffers from\t\t\t\t\t the tiny amount of slack in the gears. This reduces the linear motion of the\t\t\t\t\t push-rods to the extent that after two gates in series everything grinds to a\t\t\t\t\t halt.\t\t\t\t\t \t\t\t\t\t The\t\t\t\t\t  step-by-step instructions on how to build the model are available for downloading.\t\t\t\t\t \t\t\t\tThere is also a video available to watch.\n  Just as the OR gate and NAND gates are related, so to are\t\t\t\t the  AND gate and  NOR gate,\t\t\t\t and as such both are featured in this section.\n  It might appear to be a simple matter to just NOT the output of the &gt;NAND gate\t\t\t\t\t and get an AND gate. But, if you reverse the internal shaft mechanism of the OR\t\t\t\t\t gate, interchanging the position the fixed and rotating beam, then the OR gate\t\t\t\t\t becomes an AND gate! What&#39;s more it means that a NAND gate can now be made with\t\t\t\t\t fewer parts than previously (one NOT+AND,versus two NOTs+OR).\t\t\t\t\t \t\t\t\t\t The\t\t\t\t\t  step-by-step instructions on how to build the model are available for downloading.\t\t\t\t\t \t\t\t\tThere is also a video available to watch.\n  Like the NAND gate, the NOR gate can be made simple by NOTing the OR gate output.\t\t\t\t\t However, just as the NAND gate can also be made by NOTing the inputs of the OR\t\t\t\t\t gate, if the inputs of the AND gate are NOTd then you get a NOR gate. Again\t\t\t\t\t this can be achieved by using the NOT gates or by adding an additional cog into\t\t\t\t\t the gear train.\t\t\t\t\t \t\t\t\t\t The\t\t\t\t\t  step-by-step instructions on how to build the model are available for downloading.\t\t\t\t\t \t\t\t\tThere is also a video available to watch.\n  The XOR gate differs from a normal OR gate in that the 1,1\t\t\t\t\t input gives a zero out. The XOR gate is of great importance as it is a fundamental component of the adder.\t\t\t\t\t  \t\t\t\t\t This was the most difficult gate to build, mainly because it is a\t\t\t\t\t composite gate made from two ANDs, two NOTs and an OR gate. Sure I could have made it that way, but this\t\t\t\t\t isn&#39;t satisfactory and given the inertia and gear slippage, it meant that a half adder was probably never\t\t\t\t\t going to happen. But around Jan 05 I finally cracked it.\t\t\t\t\t \t\t\t\t\t The gate makes use of a sort of lever system. These are pushed from their top or bottom and will rotate\t\t\t\t\t about their centre if pushed only from either. Here&#39;s the trick, if the lever is pushed from the top and bottom at the same time\t\t\t\t\t it will move laterally. OK that&#39;s not the clearest of explanations, but hopefully the photos below, which\t\t\t\t\t show the gate in its four possible states along with a cut away photo showing the internal workings will make\t\t\t\t\t things more lucid. Failing that have a look at the XOR gate video that is available to download.\n  The flip-flop is a composite logic gate usually made from NANDs or NORS. As\t\t with the half adder, without flip-flops modern computing wouldn&#39;t exist.\t\t\t  \t\t\t\tOnce you have a nice simple working NOR or NAND gate then building Flip-Flops\t\t\t\t\t (FF) becomes a simple matter. In computing FFs are pretty important\t\t\t\t\t since they form the basis of memory. A FF is a device made with either two NOR or two\t\t\t\t\t NAND gates. Most FFs are made using NAND gates and there are several different\t\t\t\t\t types. The basic operation takes the output of one gate as the\t\t\t\t\t input of the other gate and vice versa. This means a FF has two inputs and two\t\t\t\t\t outputs. The pictures of the LEGO FF should show what&#39;s going on along with the description below.\t\t\t\t\t  \t\t\t\t\t The initial set up of the FF is Set=1, Clear=1 and Q=1, Qbar=0.\t\t\t\t\t  \t\t\t\t\t Pulse Clear to 0. This makes Q=0 and Qbar=1, notice now that since the right hand\t\t\t\t\t NAND output is 1, Clear will have no effect on either Q or Qbar.\t\t\t\t\t   \t\t\t\t\t Now pulse Set to 0. This turns Q=1 and Qbar=0. In this case the left hand\t\t\t\t\t NAND gate output is 1 and so changing the value of Set will not do anything.\n  If you look at any digital electronic book, you&#39;ll soon see that anything\t\t\t\t\t useful tends to make use of a clock pulse to synchronise everything. The clock\t\t\t\t\t input is separate from the logic inputs, but they are related. A simple way to\t\t\t\t\t implement a clock is by using two NAND gates. Doing this changes the set and\t\t\t\t\t clear operations from working on a 0 to 1 transition to working on a 0 to 1\t\t\t\t\t transition. The clocked Flip-Flop examples should show what&#39;s happening along with their descriptions below.\t\t\t\t\t \t\t\t\t\t The initial set up of the FF, Set, Clock (clk), Clear and Qbar are at a logic level of 0 and Q is 1.\t\t\t\t\t \t\t\t\t\t Pulse Clear to 1, then pulse to Clock (clk) to 1. This makes Q=0 and Qbar=1.\t\t\t\t\t Just as before the right hand NAND output is 1, so the Clear will have no effect\t\t\t\t\t on either Q or Qbar.\t\t\t\t\t \t\t\t\t\t The Clock goes to 0 and then Clear goes to 0. It has to be done in this order\t\t\t\t\t to prevent the outputs becoming indeterminate.\t\t\t\t\t \t\t\t\t\t Now pulse Set to 1 and the clk to 1. This turns Q=1 and Qbar=0. The left hand\t\t\t\t\t NAND gate output is 1 and so changing the value of Set will not do anything.\t\t\t\t\t \t\t\t\t\t The Clock goes to 0 and then Set goes to 0. Just as before it has to be done in this order\t\t\t\t\t to present the outputs becoming indeterminate.\t\t\t\t\t \t\t\t\t\t It is possible to build an edge detector for the Clock signal. It requires a\t\t\t\t\t few more NAND gates. The advantage of doing this is that it no longer matters\t\t\t\t\t when the Clock signal goes back to 0 and the indeterminate state is avoided.\n  The half adder is a fundamental building block of computing.\t\t\t\t\t The device is made from an XOR gate and an AND gate. There\t\t\t\t\t are two inputs, which are fed into both the XOR and the AND gate.\t\t\t\t\t There are also two outputs, one from the XOR gate and one from the AND\t\t\t\t\t gate. The XOR output is called the sum, S and the AND output is\t\t\t\t\t called the carry, C.\t\t\t\t\t \t\t\t\t\t The device adds binary numbers, as the name\t\t\t\t\t suggests! That is, in the case of adding two bits together, the sum\t\t\t\t\t of 0+0 = 0, carry 0; 0+1 = 1, carry 0; 1+0 = 1, carry\t\t\t\t\t 0 and 1+1 = 0, carry 1. Unfortunately it can only add two\t\t\t\t\t bits, which obviously limits its usefulness. However, by combining\t\t\t\t\t two half adders, one can get a full adder, which in turn can be\t\t\t\t\t cascaded to produce a binary adder of any size.\t\t\t\t\t \t\t\t\t\t The pictures above show the LEGO half adder in its\t\t\t\t\t four different states, where A and B are the inputs, S is the sum and C is the carry bit.\t\t\t\t\t  \t\t\t\t\t There is also a video available of it being operated.\n  The push-pull logic gates suffer from two significant problems. The first is inertia,\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe second is output attenutaion. Icreased inertia means that as more gates are added\t\t\t\t\t\t\t\t\t\t\t\t\t\ta greater and greater force on the first gate&#39;s input is required to affect the last gate&#39;s output.\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe output attenutation is a consequence of slippage in the mechanism, such as in the gears. This\t\t\t\t\t\t\t\t\t\t\t\t\t\tsplippage error is cumulatative meaning that after a few gates a change in logical state in the first\t\t\t\t\t\t\t\t\t\t\t\t\t\tmay not change anything in the last.\t\t\t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t\t\t\tTo overcome both these problems a means to power the gates is necessary. To achieve this I&#39;ve used\t\t\t\t\t\t\t\t\t\t\t\t\t\tlinear accuators to take a rotational input to drive the push-pull logic mechanism. The logic\t\t\t\t\t\t\t\t\t\t\t\t\t\tthen switches the driection of the output rotation hence changing the rotating logic state on the\t\t\t\t\t\t\t\t\t\t\t\t\t\tinputs of the next gate in the circuit.\t\t\t\t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t\t\t\tIn effect there is a unification between the push-pull system and the rotational system which\t\t\t\t\t\t\t\t\t\t\t\t\t\tallows for more complicated feedback gates like flip-flips to be created.\n   The push-pull logic gates suffer from a great disadvantage, that\t\t\t\t\tis inertia. The only way round this is to have some sort of amplifier, the mechanical equivalent of\t\t\t\t\tthe +ve line on a circuit board. Unfortunately with the push-pull system this is virtually impossible.\t\t\t\t\tInstead I&#39;ve gone right back to the drawing board and considered using rotation to represent the logic states.\t\t\t\t  \t\t\t\t\tI&#39;ve taken the rotation of an axle, in any direction, to represent a logical one and the absence of rotation\t\t\t\t\t(i.e. the axle is stationary) to be a logical zero. This has meant buffering is much more easy to achieve.\t\t\t\t  \t\t\t\t\tI&#39;ve found no other web pages detailing using rotation to represent logic other than ideas presented for discussion. No\t\t\t\t\tone it seems has actually built anything and if they have it isn&#39;t on the internet as far as I am aware.\t\t\t\t\tOk that&#39;s not quite true, the  web page, has details of a LEGO NOT gate. And\t\t\t\t  this page\t\t\t\t has a rotational AND gate os\\f sorts, but it is exceedingly complex compared to my own.\t\t\t\t  \t\t\t\t\tThe underlying concept behind my rotational logic gates is the addition and subtraction of rotations. This isn&#39;t a\t\t\t\t\tnew idea, there are other sites that have examples of this and people in their kindness have suggested it to me. Essentially,\t\t\t\t\tsuch additions and subtractions allows one to build up a series of outputs to represent, probably, anything you like for a\t\t\t\t\tset of inputs. Each of the logic gate pages shows the basic algebra involved.\t\t\t\t\t \t\t\t\t\tI&#39;ve recently obtained an out-of-print book -  \t\t\t\t\t&#34;Computing mechanisms and Linkages&#34;  by Antonin Svoboda, which illustrates and\t\t\t\t\texplains many principles and techniques of mechanical computation, including the methods I&#39;ve used.\t\t\t\t  \t\t\t\t If you made any mechanical logic gates using rotation then please  contact me.\t\t\t\t\t \t\t\t\t The details of the rotational logic gates can all be found on the this page.\n  The underlying mechanisms used in the construction of the rotational logic gates do nothing more than\t\t\t\t\tadd or subtract the rotations of axles.\t\t\t\t  \t\t\t\t\tI&#39;ve taken the rotation of an axle, in any direction, to represent a logical one and the\t\t\t\t\tabsence of rotation (i.e. the axle is stationary)\t\t\t\t\tto be a logical zero. Whilst the direction of rotation is unimportant, mixing directions\t\t\t\t\tin a single mechanism can cause all sorts of problems.\t\t\t\t  \t\t\t\t\tThere are three mathematical operations with axle rotations in this section:\t\t\t\t\t addition,  subtraction and\t\t\t\t\t absolute value. The last, is particularly useful since subtraction\t\t\t\t\tcan lead to the situation where equivalent logic outputs are\t\t\t\t\trotating in different directions and this can completely screw up the operation of any subsequent gate.\t\t\t\t\t \t\t\t\t\tThe mathematics for addition and subtraction is achieved by using a differential gear,\t\t\t\t\tthis is about the only effective way to decouple and/or couple axle\t\t\t\t\trotations. The absolute value is created using a one-way-gear mechanism.\t\t\t\t\t \t\t\t\t\tAlso demonstrated is a simple on/off  toggle switch. It&#39;s included in this\t\t\t\t\tsection due to its use in initiating logical zero/sone states.\t\t\t\t\t \t\t\t\t\tWith the mechanisms describe on this page it is, in theory, possible to create and operate any boolean\t\t\t\t\tlogic function you might want (amongst\t\t\t\t\tother things of course!).\n  When the two axles that link to the internal gears of a differential gear rotate in the same direction,\t\t\t\t\tthe housing also rotates. It does so at speed equal to half the sum of the individual axle speeds, hence\t\t\t\t\tthe output must be doubled. Easy enough with 16 and 8 tooth cogs. Here is the addition table:\t\t\t\t      \t\t\t\tThat looks suspiciously like the truth table for an OR gate! It nearly is, just a little more in the \t\t\t\tway of mechanics and maths will get us there as the Rotational OR gate section describes.\t\t\t\t  \t\t\t\t\tIt is probably easier to understand the addition mechanism by watching a video of it in action.\n  To move from addition to subtraction is just a matter of reversing the direction\t\t\t\tof rotation for one of the input axles. When one of the axles that link to the\t\t\t\tinternal gears of a differential gear is reversed, the housing stays stationary.\t\t\t\tWhen the inputs rotate in opposite directions, the housing then turns. In the table\t\t\t\tbelow you can read + as clockwise and - as counter-clockwise. Just as with the adder,\t\t\t\twhen the housing does rotate, it does so at speed equal to half the sum of the individual\t\t\t\taxle speeds, hence the output must be doubled. Again, this is easy enough with 16 and 8\t\t\t\ttooth cogs. Here is the subtraction table:\t\t\t\t     \t\t\t\tNow doesn&#39;t that table look like the truth table for an XOR gate?! All that has to\t\t\t\tbe done is to double the output rotation speed so it is the same as the input and other than\t\t\t\tthe pesky sign changes, it is an XOR gate as explained in the XOR gate section on this page.\t\t\t\t  \t\t\t\t\tAnd if you&#39;re keen to see the subtraction mechanism in action there is a video available to watch.\n  To get the absolute value of a rotation a mechanism know as a one-way or\t\t\t\tunidirectional gear can be used. There have been many examples of these published\t\t\t\ton the web over the years. Essentially, all the mechanism does is take an input\t\t\t\trotation of any direction and supply an output that always rotates in the same\t\t\t\tdirection. There are two ways (that I know of) that this can be done. The\t\t\t\tfirst,  as\t\t\t\tshown here, uses two sets of gears (see the video below). One set is pivoted and will drive\t\t\t\ta different gear depending on which way the input is rotating. The second uses a worm gear\t\t\t\trather than a pivoted gear train. I suspect the latter is more robust, but it suffers from\t\t\t\t quite a long lag when the input changes direction. A nice explanation of the second method\t\t\t\t can be found  here. This site also has details of\t\t\t\t a rotational adder/subtractor too.\t\t\t\t  \t\t\t\t You can use these  instructions to build a version of the mechanism.\t\t\t\t  \t\t\t\t The table of input to out values is straight forward!", "posttime": "2021-07-29 21:48:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "逻辑,logic,输入", "title": "乐高逻辑门和机械计算", "title_en": "Lego logic gates and mechanical computing", "transed": 1, "url": "https://www.randomwraith.com/logic.html", "via": "", "real_tags": ["逻辑", "logic", "输入"]}, {"category": "", "categoryclass": "", "imagename": "190db8acdbcd2800fedf54a395451c79.jpg", "infoid": 1070239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代超市提供水果和蔬菜的彩虹聚宝盆。辣椒、鳄梨、草莓、黄瓜——它们都是蜜蜂培育出来的。但是，格林威治大学的生态学家莎拉·阿诺德 (Sarah Arnold) 表示，“自然界中没有足够的传粉媒介”来照顾我们的全球作物负荷。因此，农民将数以千计的商业饲养的蜜蜂投放到他们的田地里，这些昆虫在那里勤奋地嗡嗡作响，每年为价值数十亿美元的作物授粉。当蜜蜂潜入花中寻找食物时，它们毛茸茸的小身体会拾取粉状花粉，当它们访问下一朵花、下一朵花、下一朵花时，这些花粉就会散开。但是，商业蜜蜂有时会从农田里流浪到附近的野花上。现在，科学家们发现——就像对许多人类一样——少量的咖啡因有助于蜜蜂专注于任务并更有效地完成工作。阿诺德和她的同事表明，给大黄蜂喂咖啡因，同时让它们接触目标花香，会鼓励它们在离开巢穴时寻找那种气味。与没有额外刺激的蜜蜂相比，含咖啡因的蜜蜂更快、更频繁地访问目标香味的花朵。该研究小组周三在《当代生物学》杂志上报道说，这些发现可以应用于工业化农业，以训练蜜蜂更接近正轨。弗吉尼亚大学的生态学家杰萨明·曼森（Jessamyn Manson）没有参与这项新研究，他说，人们已经知道传粉者通过接触巢内的气味来了解应该访问哪些花。阿诺德指出，之前的研究表明，蜜蜂喜欢造访产生咖啡因的人造花——但咖啡因本身如何影响蜜蜂的行为尚不清楚。其他研究表明，被拴系的蜜蜂在吃咖啡因时暴露在目标气味中会伸出舌头做出更长的反应，但这些蜜蜂无法自由选择访问哪些花。为了进行更深入的调查，阿诺德和她的团队建立了三组大黄蜂。一个人喝了含咖啡因的糖水和一股草莓花的气味。另一个收到纯糖水和气味，另一个只收到纯糖水。这些蜜蜂之前都没有遇到过任何类型的花香或花香。每组都从蜂巢中释放出来，进入一个点缀着机器人花的实验室舞台，其中一些散发出相同的草莓气味，而另一些则释放出完全不同的“干扰”花香。所有的假花都含有糖水（不含咖啡因），供蜜蜂在选择时舔舐。含咖啡因的蜜蜂对人造草莓花表现出明显的偏好，其中 70.4 只蜜蜂立即访问目标花朵。只有 60% 的不含咖啡因但闻到气味的受试者首先直奔塑料草莓，而既没有咖啡因也没有闻到气味的蜜蜂有不到一半的时间访问了草莓花，这是一个预期的结果，因为他们从来没有“学习”首先要尝试哪些植物。阿诺德说，暴露在咖啡因和气味中的蜜蜂在两者之间形成了“超强关联”，这表明蜜蜂可能会想：“当我过去有这种气味时，我得到了非常好的[含咖啡因的]糖，我记得这真的很清楚。”随着每一次连续访问花卉，这些蜜蜂的速度也比不含咖啡因的蜜蜂的速度增加得更快——这表明咖啡因可能会额外增强它们的运动技能。尽管这种积极的联系很强烈，但它最终还是消失了：在参观了几十朵花后，含咖啡因的蜜蜂也开始研究干扰花，阿诺德指出实验室设置是一个原因。 “找到彼此相距仅几英寸的塑料花……对于蜜蜂来说，这是一项非常容易解决的任务，”她说。 “蜜蜂迟早会尝试干扰花，并意识到它们同样有益。”但在草莓植物领域，现实生活中的“干扰者”花会更远，蜜蜂可能需要更长的时间才能偏离他们的任务。阿诺德说，在农业环境中，咖啡因可以与商业蜂巢中特定植物的引发气味一起提供。农民可以将含咖啡因的蜂箱放在他们的田里，让蜜蜂更有效地授粉。\n曼森说，这种策略可能更适用于英国的农场而不是美国的农场。英国的农场往往较小，如果未经训练，授粉者更容易四处游荡。她补充说，由蜜蜂授粉的美国​​作物通常种植在难以远离的大田中，或者种植在蜜蜂无法逃脱的温室中。无论新发现可能导致何种工业应用，曼森说，这些使用咖啡因作为启动兴奋剂的实验特别具有启发性。人类积极寻找咖啡因，“我希望传粉媒介也会这样做，”她说。 “它很好吃，很棒。”但因为这项研究在巢中给予咖啡因而不是作为对花的奖励，她说，该实验是咖啡因如何帮助教导蜜蜂为哪些植物授粉的“有力证明”。", "note_en": "The modern supermarket offers a rainbow cornucopia of fruits and vegetables. Peppers, avocadoes, strawberries, cucumbers—they’re all  made possible by bees. But “there just aren’t  enough pollinators in the natural world” to take care of our global crop load, says Sarah Arnold, an ecologist at the University of Greenwich. So farmers release commercially reared bees by the thousands onto their fields, where the insects buzz along diligently and pollinate  billions of dollars’ worth of crops every year. As bees dip into flowers to find food, their fuzzy little bodies pick up powdery pollen that gets spread when they visit the next flower, and the next, and the next.\n  But commercial bees sometimes stray from farm fields to peruse nearby wildflowers. Now, scientists have found that—like for many humans—a jolt of caffeine helps bees stay on task and get the job done more efficiently. Arnold and her colleagues showed that feeding bumblebees caffeine while exposing them to a target floral scent encourages them to seek out that smell when they leave the nest. The caffeinated bees  visit the target-scented flowers more quickly and often than those without that extra boost. The findings could be applied to industrial agriculture to train bees to stay more on track, the team reported Wednesday in  Current Biology.\n  Pollinators had already been known to learn which flowers to visit by being exposed to scents inside the nest, says Jessamyn Manson, an ecologist at the University of Virginia who was not involved with the new research. And previous studies had shown that bees like to visit artificial flowers that produce caffeine, Arnold notes—but how the caffeine itself might impact bees’ actions was unclear. Other research shows that tethered honeybees exposed to a target scent while eating caffeine stick out their tongues in response for longer periods of time, but those bees were unable to freely choose which flowers to visit.\n  To investigate more deeply, Arnold and her team set up three groups of bumblebees. One got caffeinated sugar water and a blast of strawberry-flower odor. Another received plain sugar water and the odor, and yet another got just the plain sugar water. None of the bees had previously encountered any type of flower or floral scent. Each group was released from its hive and into a laboratory arena dotted with robotic flowers, some of which puffed out the same strawberry smell and others that released a completely different “distractor” floral scent. All of the fake flowers contained reservoirs of sugar water (without caffeine) for the bees to lap up upon selection.\n  The caffeinated bees showed a clear preference for the faux strawberry flowers, with 70.4 of them visiting the target blossoms right away. Just 60 percent of the noncaffeinated but odor-primed subjects made a beeline for the plastic strawberries first, and the bees that received neither caffeine nor the priming scent visited the strawberry flowers a little under half of the time, an expected result because they had never “learned” which plants to try in the first place.\n  Bees exposed to both caffeine and odor formed a “super strong association” between the two, Arnold says, suggesting that a bee might think: “When I had that odor in the past, I got this really nice [caffeinated] sugar and I remember that really clearly.” With each consecutive flower visit, these bees’ pace also increased faster than that of the noncaffeinated bees—indicating that caffeine might additionally enhance their motor skills.\n  Though the positive association was strong, it eventually wore off: After visiting dozens of flowers the caffeinated bees started investigating the distractor flowers too, and Arnold points to the laboratory setup as one cause. “Finding plastic flowers that are just a few inches apart from each other … it’s quite an easy task for the bees to solve,” she says. “The bees would sooner or later try out the distractor flowers and realize that they’re equally as rewarding.” But in a field of strawberry plants, real-life “distractor” flowers would be much farther away, and it might take the bees longer to stray from their task. In an agricultural setting, caffeine could be supplied alongside priming scents for specific plants in commercial hives, Arnold says. Farmers could place the caffeinated hives in their fields for the bees to pollinate more efficiently.\n  Manson says this strategy might be more applicable to farms in the United Kingdom than to those in the United States; U.K. farms tend to be smaller, and it is easier for the pollinators to wander off if untrained. U.S. crops pollinated by bees are often planted in huge fields that are harder to stray from, or grown in greenhouses from which bees cannot escape, she adds.\n  Whatever industrial application the new findings might lead to, Manson says these experiments’ use of caffeine as a priming stimulant is particularly revelatory. Humans actively seek out caffeine, “and I expect pollinators do, too,” she says. “It’s delicious and awesome.” But because this study had caffeine given in the nest rather than being doled out as a reward at the flower, she says, the experiment is a “strong demonstration” of how caffeine can help teach bees which plants to pollinate.", "posttime": "2021-07-29 21:48:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提高,boosts,蜜蜂", "title": "咖啡因提高蜜蜂的注意力并帮助它们学习", "title_en": "Caffeine Boosts Bees’ Focus and Helps Them Learn", "transed": 1, "url": "https://www.scientificamerican.com/article/caffeine-boosts-bees-focus-and-helps-them-learn/", "via": "", "real_tags": ["提高", "boosts", "蜜蜂"]}]