[{"category": "", "categoryclass": "", "imagename": "1e8c252fb77f6fa83cb3f38f4dfd02e1.jpg", "infoid": 1068661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Cape Canaveral，Fla。 - 圣母银河终于拥有联邦政府的批准，开始向新墨西哥州推出客户进入​​太空。\n Richard Branson的Rocketship公司周五宣布联邦航空管理局的更新许可。\n  这是处女银河龙龙派遣乘客在短桅顶啤酒花的最后障碍是最终的障碍。\n 该公司今年夏天和秋季秋季努力走向三个空间测试航班，然后在享受客户的推广门前。原始计划呼吁公司工程师推出旁边的评估设备，其次是与布兰森的飞行，然后是意大利空军军官的科学使命。\n 与此同时，蓝色产地的杰夫·贝佐斯本月早些时候宣布计划从德克萨斯州7月20日骑着自己的火箭进入太空。\n 维尔京银河官员承认，布兰森是否会试图击败太空的越来越多的喋喋不休。\n “清楚地，Richard Branson的航班日期爵士一直受到猜测。此时，我们没有关于即将到来的航班日期的进一步细节，＆＃34;公司发言人安娜娜起重机在一封电子邮件中写道。 \n与蓝色＆＃39; s和spacex＆＃39;由可重复使用的火箭从地面发射的全自动胶囊，原始银河用一艘飞行的航天器从飞机的腹部发射，并需要一双飞行员。自2018年以来，它达到了三次的空间。第二次旅行携带第三家公司员工。\n  该公司审查了5月份的第三次飞往太空的第三次航班 - 这达到了55英里（89公里）的高度 - 显示一切顺利，为必要的FAA许可铺平了道路。\n “今天＆＃39;我们的全部商业发布许可的FAA批准，与5月22日的测试航班一起成功，让我们充满信心，因为我们今年夏天对我们的第一个全面的测试航班进行了信心，”首席执行官Michael Collazier在一份声明中说。\n 超过600人已经保留了乘车到空间。门票最初造成250,000美元，但预计一旦处女银河开始再次接受预订，价格将上涨。\n 蓝色起源还尚未向公众卖出门票或者说出它的成本。贝佐斯在7月20日乘坐他的兄弟和其他两国骑行，第一个人为月亮登陆的52周年。\n  相关的新闻保健和科学部门获得了霍华德休斯医学院科学教育部的支持。 AP仅对所有内容负责。 ", "note_en": "CAPE CANAVERAL, Fla. -- Virgin Galactic finally has the federal government’s approval to start launching customers into space from New Mexico.\n Richard Branson’s rocketship company announced the  Federal Aviation Administration’s updated license on Friday.\n  It’s the final hurdle in Virgin Galactic’s yearslong effort to send paying passengers on short space hops.\n The company is working toward three more space test flights this summer and early fall, before opening the rocketship&#39;s doors to paying customers. The original plans called for company engineers to launch next to evaluate equipment, followed by a flight with Branson and then a science mission by Italian Air Force officers.\n In the meantime, Blue Origin’s Jeff Bezos earlier this month announced plans to ride his own rocket into space July 20 from Texas.\n Virgin Galactic officials acknowledged the growing chatter over whether Branson will try to beat Bezos into space.\n “Clearly, Sir Richard Branson’s flight date has been subject to speculation for some time. At this time we do not have any further details on the upcoming flight dates,&#34; company spokeswoman Aleanna Crane wrote in an email.\n Unlike Blue Origin&#39;s and SpaceX&#39;s fully automated capsules launched from the ground by reusable rockets, Virgin Galactic uses a winged spacecraft that launches from the belly of an airplane and requires a pair of pilots. It&#39;s reached space three times since 2018. The second trip carried a third company employee.\n  A review of the company&#39;s third flight to space in May — which reached an altitude of 55 miles (89 kilometers) — showed everything went well and paved the way for the necessary FAA permission.\n “Today&#39;s approval by the FAA of our full commercial launch license, in conjunction with the success of our May 22 test flight, give us confidence as we proceed toward our first fully crewed test flight this summer,” chief executive officer Michael Colglazier said in a statement.\n More than 600 people already have reserved a ride to space. Tickets initially cost $250,000, but the price is expected to go up once Virgin Galactic starts accepting reservations again.\n Blue Origin has yet to sell tickets to the public or say what it will cost. Bezos is taking his brother and two others along for the ride on July 20, the 52nd anniversary of the first human moon landing.\n  The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "posttime": "2021-06-30 00:43:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "空间,space,科学", "title": "处女银河播放空间发射。 Richard Branson会击败Jeff Bezos吗？ ", "title_en": "Virgin Galactic Okayed For Space Launches.  Will Richard Branson Beat Jeff Bezos?", "transed": 1, "url": "https://abcnews.go.com/Technology/wireStory/virgin-galactic-faas-launch-customers-space-78488941", "via": "", "real_tags": ["空间", "space", "科学"]}, {"category": "", "categoryclass": "", "imagename": "3bf05b7ddfa9e2225bd8ca7f9edaff72.jpg", "infoid": 1068660, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊已宣布其儿童加上消防片和呼应智能扬声器的新功能，称为阅读侧面。旨在帮助孩子们提高阅读技巧和能力，阅读Sidekick允许孩子们通过在用数字助手朗读书籍时阅读物理或数字书籍以及Alexa。阅读助手包括在儿童加上的服务中，儿童版消防片和回声扬声器或每月2.99美元（没有亚马逊Prime的4.99美元）或每年69美元（没有Prime 99美元）订阅计划，可在6月29日开始。\n 阅读Sidekick与最alexa的设备配合使用，包括回声，回声点，回声点小孩，回声加和echo展示。一旦智能扬声器或智能显示器（通过Alexa智能手机应用程序）启用了亚马逊儿童模式，那么一个孩子可以说“Alexa，让我们阅读”开始阅读Sidekick。然后将提示他们选择一本书，在消防平板电脑上或在其他设备上的儿童和儿童中的应用程序;选择读得很多，一点点或轮流;然后开始阅读这本书。亚马逊表示，现在系统提供“超过700”的书籍，每周都有更多的释放。\n 一旦开始一本书，Alexa将收听孩子的阅读，并在阅读书籍时自动协助发音或其他挑战。它将通过像“好工作！”这样的短语提供鼓励当孩子完成一本书或通过一个特别棘手的部分。在“读一点”模式中，它将采取狮子的阅读份额，期待孩子在书中遵循，然后每隔几页阅读一页或段落。 “读取很多”模式是相反的：孩子将期望连续阅读四页，alexa之后阅读。 “轮流”模式简单地读取子和Alexa之间的单页或段落。\n Sidekick不做的是跟进任何理解问题，以了解书中保留或理解的孩子。没有测试或测验组件;最好将此视为养护者而不是替代适当的学习课程。\n  阅读Sidekick与Alexa智能扬声器和智能显示器一起使用，但它不会在智能显示屏的屏幕上显示一本书的文本，而是使用该房地产进行书籍建议。 Alexa还可以在基本回波扬声器上提供建议，因此没有必要使用阅读SINEKICK与屏幕。父母可以查看他们的孩子们一直在孩子们读上的孩子和网络仪表板。\n 亚马逊表示，本周还开始为儿童推出Alexa语音档案。这将允许回声识别特定儿童的声音，然后个性化对它们的体验，当多个儿童共享单个回声设备时都会有所帮助。如果孩子们发言并没有启用儿童模式的回声和alexa认识到他们的声音，它将切换到儿童模式并提供适当的答案，过滤显式音乐，将呼叫和消息限制为批准的联系人和限制获得批准的技能。父母将能够为他们的孩子们提供四个独特的语音配置文件在Alexa应用程序中。\n  在今天的宣布之前，亚马逊亚历克萨学习和教育负责人的面谈说，阅读Sidekick是“意味着在儿童中建立流利和阅读”，因为亚马逊由于阅读技能密切相关与学校和社会生活的成功相关。 \n该公司表示，建立此功能几乎一年，调整alexa的耐心，检测孩子何时发出困难的单词并了解孩子的发音，更多。 Mierow表示，该公司汇集了教师，科学研究人员和课程专家的咨询委员会，以帮助指导在建造时的服务的发展。它现在正在释放这个功能，希望它将有助于打击“夏季幻灯片”在读书时发生的阅读能力，在等级之间六到八周的时间。\n Mierow表示，阅读Sidekick的“甜蜜点”年龄范围是六到九，因为孩子需要有一些阅读能力跟随alexa，即使在最简单的模式中也是如此。支持的图书馆中的大多数书籍都针对这些开始读者，尽管有一些想要使用该服务的年龄较大的孩子的高级书籍。\n   我有机会在今天的宣布之前尝试阅读Sidekick。我们能够在标准的回声点上使用Alexa进行alexa测试的物理和数字图书，其中包含儿童模式，最近发布的Echo Show 5 Kids Edition。\n 根据我们的经验，阅读Sidekick的理想设置是一个消防高清儿童平板电脑（或iPad或类似设备上的孩子们）和一个音频回声扬声器。虽然阅读Sidekick与物理书籍合作，但我的孩子在读取的时候努力保持alexa，因为转动页面需要vifter dexterity，而不是只是像平板电脑上的数字预订一样刷到屏幕。此外，该平板电脑可以访问与服务兼容的整个书库，而它可能会在家里的书中击中或错过。 （虽然亚马逊将在其商店中突出显示与阅读Sidekick兼容的商店。）\n 在Echo Show，阅读Sidekick应用程序经常戒断主屏幕并开始显示时钟或天气，即使alexa还在聆听我的孩子阅读。这对他们来说很困惑，因为当他们注意到屏幕改变时，他们会停止阅读。屏幕上的建议也是对平板电脑本身的建议的重复，渲染屏幕主要是MOOIC  - 对于仅扬声器的回声，经验更好。当然，它在一个安静的房间里工作，亚历克雅可以听到孩子的声音最容易。\n 阅读Sidekick在两家设备上读一本书中间坠毁 -  Alexa只会停止听这本书，我们必须重新开始整个过程​​。我们能够在我们离开的地方捡起来，但这是一个令人讨厌的过程，我不确定我的孩子在没有我帮助他们的情况下，我的孩子就会能够解决这个问题。亚马逊表示，这不是它在阅读Sidekick的测试版中看到的东西，但它可能与公司扩展到Preview组的功能的可用性有关，我进入了呼应业主的一般人群。\n Sidekick确实通过困难的部分自动和纠正了少数单词的发音 \n当Sidekick按预期工作时，它确实通过部分自动读取的部分并尝试纠正他们的一些奇怪发音的部分来帮助我的孩子。它还为他们奖励完成一本关于鼓励信息的书。但是一旦我们完成测试该功能，我的孩子就想在消防平板电脑上玩应用程序和游戏，并且对阅读更多书籍没有太多兴趣。\n 当然，有一些与您的孩子用机器人读取的立即关注。一个是隐私，但如果您在家中已经有了回声扬声器，那就不是那么不同。\n 较大的关切可能是阅读Sidekick，Alexa正在教授教学阅读中的父母或教师的传统位置。许多父母珍惜教孩子们读取的时间阅读并将其视为发展和粘合活动。\n 尽管如此，由于现代生活的许多义务，很多父母都会爱他们的孩子才能阅读更多并没有时间致力于投入到它。让他们的孩子练习他们的阅读与Alexa的阅读能力，以补充他们可能会在家庭中吸引人的任何阅读。与父母不同，alexa不会在又一遍地读同一本书。\n 父母将不得不估计他们对隐私的焦虑和一个亚马逊动力的机器人教育孩子，但他们也必须应对非常合理的硬件要求。此服务至少需要一个亚马逊设备和儿童加服务的订阅。当您拥有回声扬声器和消防高清平板电脑（或带有儿童加应用程序的另一个平板电脑）时，它真的很有效，您需要购买或已经拥有的设备数量，以充分利用它。\n 阅读Sidekick是亚马逊的一个例子，弄清楚了更多的方法可以在我们的生活中制作alexa及其人工智能，而当然也尽可能地保持亚马逊生态系统内的东西。它也不太可能成为alexa的最后一个教育工具：许多孩子已经使用虚拟助手来帮助简单的数学和其他琐事问题。这不是一个思考，这是亚历克萨学习和教育团队接下来的地方。 ", "note_en": "Amazon has announced a new feature for its Kids Plus service on Fire tablets and Echo smart speakers called Reading Sidekick. Designed to help kids improve their reading skills and ability, the Reading Sidekick allows kids to read either physical or digital books along with Alexa by taking turns at reading the books aloud with the digital assistant. The Reading Assistant is included in the  Kids Plus service that comes with the  Kids edition Fire tablets and  Echo speakers or as a $2.99 per month ($4.99 without Amazon Prime) or $69 per year ($99 without Prime) subscription plan and is available starting June 29th.\n The Reading Sidekick works with most Alexa-enabled devices, including the  Echo,  Echo Dot,  Echo Dot Kids,  Echo Plus, and  Echo Show. Once the Amazon Kids mode is enabled on the smart speaker or smart display (through the Alexa smartphone app), a child can then say “Alexa, let’s read” to start the Reading Sidekick. They will then be prompted to choose a book, either physical or digital on a Fire tablet or in the Kids Plus app on other devices; opt to read a lot, a little, or take turns; and then begin reading the book. Amazon says that “over 700” books are available in the system now, with more releasing each week.\n Once a book is started, Alexa will listen to the child’s reading and automatically assist with pronunciations or other challenges while reading the book. It will provide encouragement through phrases like “good job!” when a child finishes a book or gets through a particularly tricky section. In the “read a little” mode, it will take the lion’s share of the reading, expecting the child to follow along in the book and then read one page or paragraph every few pages. The “read a lot” mode is the opposite: the child will be expected to read four pages consecutively, with Alexa reading one after that. The “take turns” mode is simple alternation of reading a single page or paragraph between the child and Alexa.\n What the Sidekick doesn’t do is follow up with any sort of comprehension questions to see how much the child retained or understood from the book. There’s no test or quiz component; it’s best to think of this as edutainment than a replacement for a proper learning curriculum.\n  The Reading Sidekick works with both Alexa smart speakers and smart displays, but it won’t show the text of a book on a smart display’s screen, and instead uses that real estate for book recommendations. Alexa can also provide recommendations on a basic Echo speaker, so it’s not necessary to use the Reading Sidekick with a screen. Parents can view the books their kids have been reading on the Kids Plus web dashboard.\n Amazon says that it is also starting to roll out  Alexa Voice Profiles for Kids this week. This will allow the Echo to recognize the voice of a specific child and then personalize the experience to them, which can be helpful when multiple children are sharing a single Echo device. If the child is speaking to an Echo that doesn’t have the Kids mode enabled and Alexa recognizes their voice, it will switch into Kids mode and provide age-appropriate answers, filter explicit music, limit calls and messages to approved contacts, and limit access to approved skills. Parents will be able to set up to four unique voice profiles for their kids in the Alexa app.\n  In an interview ahead of today’s announcement, Marissa Mierow, Amazon’s head of Alexa learning and education, said that the Reading Sidekick is “meant to build fluency and a love of reading” within children and that Amazon developed it because of how closely reading skills are related to success in academics and social life after school.\n The company says it took nearly a year to build this feature, adjusting Alexa’s patience, ability to detect when a child is sounding out a difficult word and understand kids’ pronunciations, and more. Mierow says the company put together an advisory council of teachers, science researchers, and curriculum experts to help guide the development of the service as it was being built. It’s releasing the feature now in a hope that it will help combat the “summer slide” in reading ability that happens when kids are out of school for six to eight weeks between grades.\n Mierow says the “sweet spot” age range for the Reading Sidekick is six to nine, as the child needs to have some reading ability to follow along with Alexa, even in the most simple modes. Most of the books in the supported library are aimed at these beginning readers, though there are some more advanced books for older kids who want to use the service.\n   I had an opportunity to try out the Reading Sidekick with my six-year-old ahead of today’s announcement. We were able to test reading physical and digital books with Alexa on both a standard Echo Dot with Kids mode enabled and the recently released Echo Show 5 Kids Edition.\n Based on our experience, the ideal setup for Reading Sidekick is a Fire HD Kids tablet (or the Kids Plus app on an iPad or similar device) and an audio-only Echo speaker. Though the Reading Sidekick works with physical books, my child had a hard time keeping up with Alexa as it read, since turning the page requires swifter dexterity than just swiping the screen like they can do with a digital book on a tablet. Additionally, the tablet can access the entire library of books that are compatible with the service, whereas it might be hit-or-miss with the books you have at home. (Though Amazon will highlight physical books in its store that are compatible with the Reading Sidekick.)\n On the Echo Show, the Reading Sidekick app would frequently quit to the homescreen and start displaying a clock or the weather, even though Alexa was still listening to my kid reading. This was confusing for them, as they’d stop reading when they noticed that the screen changed. The recommendations on the screen are also duplicative of the recommendations on the tablet itself, rendering the screen mostly moot — the experience was just better with the speaker-only Echo. Naturally, it works best in a quiet room where Alexa can hear a child’s voice easiest.\n The Reading Sidekick crashed in the middle of reading a book on both devices — Alexa would just stop listening to the book and we’d have to start the whole process all over again. We were able to pick up where we left off, but it’s an annoying process and I’m not sure my kid would have been able to figure it out without me there helping them through it. Amazon says this isn’t something it saw during beta testing of the Reading Sidekick, but it’s possible that it’s related to the company expanding availability of the feature from the preview group I was in to the general population of Echo owners.\n The Sidekick did help my child through difficult sections automatically and corrected pronunciations on a handful of words\n When the Sidekick was working as expected, it did help my child through sections they were having trouble reading automatically and attempted to correct some of their odd pronunciations. It also rewarded them for finishing a book with a message of encouragement. But once we were done testing the feature, my kid just wanted to play with the apps and games on the Fire tablet and didn’t have much interest in reading more books.\n There are, of course, some immediate concerns with having your kid read with a robot. One is privacy, though if you already have an Echo speaker in your home, this isn’t really any different from that.\n The larger concern might be that with the Reading Sidekick, Alexa is taking the traditional place of a parent or teacher in teaching reading. Many parents cherish the time spent teaching their children to read and see it as both a developmental and bonding activity.\n Still, plenty of parents would love their kids to read more than they do and just don’t have the time to devote to it due to the many obligations of modern life. The ability to have their child practice their reading with Alexa to supplement any reading they might do together as a family might be appealing. Unlike a parent, Alexa won’t ever tire of reading the same book over and over.\n Parents will have to reckon with their anxieties over privacy and an Amazon-powered robot teaching their child, but they’ll also have to deal with the decently hefty hardware requirements. This service requires at least one Amazon device and a subscription to the Kids Plus service. It really works best when you have both an Echo speaker and a Fire HD tablet (or another tablet with the Kids Plus app), doubling the number of devices you need to buy or already own to get the most out of it.\n The Reading Sidekick is an example of Amazon figuring out more ways to make Alexa and its artificial intelligence useful in our lives, while of course keeping things within the Amazon ecosystem as much as possible. It’s also unlikely to be the last educational tool given to Alexa: many kids already use the virtual assistant to help with simple mathematics and other trivia questions. It’s not a leap to think that’s where the Alexa learning and education team might be headed next.", "posttime": "2021-06-30 00:42:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,阅读,fire,孩子", "title": "亚马逊首次亮相阅读Sidekick，它从700多岁的目录中大声朗读了，为儿童加上了在消防片和回声装置上 ", "title_en": "Amazon debuts Reading Sidekick, which reads physical and digital books aloud from a catalog of over 700, for Kids Plus on Fire tablets and Echo devices", "transed": 1, "url": "https://www.theverge.com/2021/6/29/22554428/amazon-reading-sidekick-alexa-echo-skill-kids-voice-profiles?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["amazon", "亚马逊", "阅读", "fire", "孩子"]}, {"category": "", "categoryclass": "", "imagename": "dfc8228e9bc4c71f06563799d54aea99.jpg", "infoid": 1068659, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦当局需要像特斯拉和字母所有的Waymo这样的公司报告涉及驾驶员碰撞的一天内涉及驾驶员援助和自动化系统的事件，这是一个主要的变化，即监管机构的立场。\n  周二国家公路交通管理局宣布改变，涵盖从所谓的2级到5级的系统，包括先进的驾驶员援助系统，如特斯拉自动驾驶仪和自动化驾驶系统，如自主车辆由硅谷部署的自动车辆和其他地方。\n NHTSA在新闻发布中表示，公司将被要求报告“在崩溃之前或在崩溃之前或立即订婚”的崩溃。\n  “访问[自动化驾驶系统]数据可能会显示无驱动车辆中是否存在常见模式，”该机构说。\n   虽然许多自治车辆部署在有关于书籍上的规定，但自动驾驶仪等驾驶员援助系统经常落入一个监管灰色区域，允许事故逃脱进一步检查。根据新规则，一家公司必须迅速报告涉及医院治疗的死亡或受伤的崩溃，车辆拖走，空气袋部署或行人或骑车者的参与。\n  NHTSA表示，公司还必须提交所有碰撞或涉及自动化系统的财产损失的每次撞车的报告。\n 由于公司越来越多地将其掌握在司机手中并在公共道路上部署它们，因此该系统受到审查。优步在其中一个SUV击中并杀死了一名49岁的女子，在2018年击败了一辆49岁的女子，在一条路上推着一辆骑自行车。 \n并且特斯拉因涉及Autopilot的崩溃而受到审查，其驾驶员援助系统包括允许汽车从高速公路上越来越远离坡道导航的功能，以及检测停止标志和红绿灯，并自动停车和召唤车辆。在一种情况下，在自动驾驶仪模式下操作的特斯拉犁到拖拉机拖车的侧面，杀死驾驶员。国家运输安全委员会表示，此案涉及对驾驶员援助功能的过度影响。\n     “通过授权崩溃报告，原子能机构将获得关键数据，这将有助于快速识别这些自动化系统中可能出现的安全问题，”斯图文·克里夫（NHTSA的代理管理员）在一份声明中表示。 “事实上，收集数据将有助于灌输公众信心，即联邦政府密切关注自动化车辆的安全。”\n 根据NHTSA的说法，未能遵守任务可能导致每天罚款高达22,992美元，最高罚款总额超过1亿美元。 NHTSA表示，在这种情况下，此事也可以提交司法部以迫使反应。\n     当天最重要的新闻故事，由邮政编辑策划并每天早上交付。 ", "note_en": "Federal authorities will require companies like Tesla and Alphabet-owned Waymo to report incidents involving driver-assistance and automated systems within one day of a learning of a crash, a major change that signals a tougher stance by regulators.\n  The National Highway Traffic Administration on Tuesday announced the change, which covers systems ranging from so-called Level 2 to Level 5, encompassing advanced driver-assistance systems such as Tesla Autopilot and automated driving systems like the autonomous vehicles being deployed by companies in Silicon Valley and elsewhere.\n Companies will be required to report crashes where the “system was engaged during or immediately before the crash,” NHTSA said in a news release.\n  “Access to [automated driving system] data may show whether there are common patterns in driverless vehicle crashes or systematic problems in operation,” the agency said.\n   While many autonomous vehicles are deployed in states that have regulations on the books, driver assistance systems such as Autopilot have often fallen into a regulatory gray area that allowed incidents to escape further examination. Under the new rules, a company must quickly report crashes involving a death or injury treated at the hospital, a vehicle towed away, an air bag deployment or the involvement of a pedestrian or cyclist.\n  Companies must also submit monthly reports of all crashes with injuries or property damage that involve automated systems, NHTSA said.\n The systems have come under scrutiny as companies have increasingly put them in the hands of drivers and deployed them on public roads. Uber halted its self-driving vehicle program after one of its SUVs struck and killed a 49-year-old woman pushing a bike across a road in 2018.\n  And Tesla has come under scrutiny for crashes involving Autopilot, its driver-assistance system that includes features allowing cars to navigate from highway on-ramp to off-ramp, along with detecting stop signs and traffic lights, and automatically parking and summoning the vehicles. In one case, a Tesla operating in Autopilot mode plowed into the side of a tractor-trailer, killing the driver. The National Transportation Safety Board said the case involved overreliance on the driver-assistance features.\n     “By mandating crash reporting, the agency will have access to critical data that will help quickly identify safety issues that could emerge in these automated systems,” Steven Cliff, NHTSA’s Acting Administrator, said in a statement. “In fact, gathering data will help instill public confidence that the federal government is closely overseeing the safety of automated vehicles.”\n According to NHTSA, failure to comply with the mandate could result in fines of up to $22,992 per day and a maximum penalty totaling more than $100 million. In such cases, the matter could also be referred to the Justice Department to compel a response, NHTSA said.\n     The most important news stories of the day, curated by Post editors and delivered every morning.", "posttime": "2021-06-30 00:42:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,表示,require,车辆", "title": "NHTSA表示，需要在一天内涉及驾驶员援助和自动化系统等特斯拉和Waymo报告事件 ", "title_en": "NHTSA says it will require that companies like Tesla and Waymo report incidents involving driver-assistance and automated systems within one day", "transed": 1, "url": "https://www.washingtonpost.com/technology/2021/06/29/nhtsa-safety-reporting-autopilot/", "via": "", "real_tags": ["特斯拉", "表示", "require", "车辆"]}, {"category": "", "categoryclass": "", "imagename": "93ad2b069d427a29eb8eb3bf26c09bc7.jpg", "infoid": 1068657, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于一件事，这是一个孤独的胜利，距离Kin的英里，在潮湿的气候中茁壮成长。它的大量根源夹在混凝土墙和铁轨之间。它占据了煤炭和柴油烟雾，以多个世纪以来。它幸存下来的地震和录制干旱，以及一种较少的破坏性的人为力量：涂鸦。\n 埃尔帕洛阿尔托 - 一棵长期以来一直担任帕洛阿尔托的120英尺高的象征的1,081岁的红木树，这是一个占据了它的名字的城市 - 可以说是硅谷的原始禁令。\n 它仍然在近11世纪经过近11世纪，因为它被挑选出来，人们倾向于与魅力梅戈拉有一个情感联系，故事来自中东的黎巴嫩的雪松到据称拥有罗宾的主要橡树引擎盖和他的男人在舍伍德森林里。这是萨洛阿尔托市官方标志的埃尔帕洛阿尔托，斯坦福大学的官方印章。那是埃尔帕洛阿尔托，有点，在斯坦福游戏中跳舞，作为非官方校园吉祥物，一只眼镜般的古怪的古怪的盛大树木，与软盘分支。\n “它体现了Palo Alto的先驱精神，”这座城市的前城市林师沃尔特·克斯莫尔说，他在5月份留下了九年后照顾树。 “Palo Alto一直在为创新者，领导和创造性思维的家乡而自豪。这就是一些人在树中看到的。“\n 经过几十年的近死经历，埃尔帕洛阿尔托正在等待最后一次救援努力，即Passmore先生和其他人说会保证高大的树木的未来。 Caltrain是一条通勤轨道线，一直计划将柴油列车电气地从树上隆隆约25英尺，这是一项可以消除每天喷出它的污染的移动。\n 但是大树将不得不抵挡城市地点的吊索和箭头较长。 Caltrain项目将从柴油切换到电动电机，应该是今年发生的，但官员决定推迟它 - 直到2024年。\n   在最近的访问中，Passmore先生走了El Palo Alto的分支机构，潮湿和辛辣的土地，填充了小溪边公园，作为树的基地距离市政厅不到一英里。当他发言时，他不得不暂停。闪烁的红灯和铁路交叉门的混乱钟声中断。一两分钟后，一个Caltrain柴油，烟雾拖尾，嗖嗖嗖。 \n埃尔帕洛阿尔托非常存在，有一个侥幸。 Redwoods是可满足的雨水和雾饮用者，在年降雨量为5到10英尺的地方蓬勃发展。在Palo Alto，少于两英尺的降水是常见的。这棵树比曾经是越来越短的 - 它在19世纪大约是162英尺高，但顶部的部分是死亡的，可能来自煤和柴油烟雾 - 而且它是一个与其他人相比的pipsqueak，更高的红木的方法400英尺。它仍然只有中年人 - 该国最古老的红木估计为期2500岁。\n Passmore先生认为，San Francisquito Creek的山脉越来越多地从山上被扫过，并在克里克沃特人养了几个世纪。\n 在过去的几十年里，人口增长和一连串的井在溪流的水桌上脱落，剥夺了树的水。白蚁和压实的土壤增加了下降。在20世纪50年代，树似乎憔悴，病了。乔治·博德，当时是一个城市树木树山脉，加入了一个管道系统，将水送到水后备箱，在雾状的雾中沐浴着埃尔帕洛阿尔托。\n “他称之为”愚弄红木“计划，”David Dockter是一座退休的城市树荫师，一家有助于照顾树两十多年，仍然监测其健康。 “红木从他们的王冠和根源一起喝酒，他想愚弄红木的思考它在海岸上，每天都在雾进来时每天喝一杯水。”\n 井被盖住，以使水位备份。引入地面渗透雷达检查树内部的健康状况。将相机安装的无人机飞到冠部以进行检查。并且将棱镜放在树顶上，以便测量师可以监控其稳定性。\n “到目前为止，它还没有移动，”诺克斯特先生说。 “这将是那里有地面运动的第一个迹象。”\n 尽管如此，紧急备份计划是在议案中设立的：El Palo Alto的种子于2004年在由非营利组织美国森林经营的历史悠久的树苗圃中被收集并种植，以防树龙头并死亡。 \n埃尔帕洛阿尔托在曾经属于奥赫隆·斯坦诺恩埃莱森国家的土地上生长。它于1769年进入录制的历史，当时西班牙军官加斯帕尔德波尔托拉和63名他的男人骑入该地区，以驱逐加利福尼亚州的耶稣队。他们从遥远的地方窥探了孤独，双局的红木并露营。他们首先将其称为Palos Colorados，它松散地转化为“红树”，因为红木的红树皮。后来，当第二个后备箱在1880年代下来时，这棵树被称为el palo alto，西班牙语意思是“高棍子”。\n El Palo Alto历史的一个未解决的奥秘之一是树可能是一个伪装者。\n “我们所知道的树是埃尔帕洛阿尔托可能不是树野营的树野营，”帕洛阿托历史协会的历史学家史蒂夫斯塔格说。 “它可能是一棵树的进一步下游，由西班牙军工队砍下来迫使溪流。”\n 李兰斯坦福州南太平洋铁路和加利福尼亚州长的总统购买了这棵树的土地，在1876年为他的家庭住宅和他的帕洛阿尔托股票农场成立，李兰斯坦福大学。学院以他唯一的儿子命名，他在15岁时从欧洲的旅行中取决于伤寒。\n 在1880年代失去第二个行李箱后，斯坦福先生指示建造一个粗壮的墙壁来保护剩余的行李箱，使用日志和铁路领带。他的寡妇Jane Stanford，后来有一个更大，25英尺高的混凝土墙，以保持小溪拿出根并旋转树。\n 斯坦福大学每年曾经举办竞赛，将类旗帜固定到树顶。最后一次攀登于1909年的入学日前一天晚上。这是学生高丛经常去：相当不好。\n 根据帕洛阿尔托市报道，“学生在黑暗之后被淘汰了，并需要由同学救出。” \n在20世纪70年代，一个新的传统出生 - 让学生装扮成Zany el Palo alto，在体育赛事中提升学校精神。 叫做斯坦福树的行军乐队的不尊者吉祥物已经尊敬，过去的树服装储存在大学绿色图书馆档案中的气候控制室内。  目前的斯坦福树是Grayson Armor，21，初级学习航空航天计算工程。 他被选中从一群争吵“萌芽”，在逍遥游戏中，并已经采用了他的狼吞领表演服装敬意的树的相同非传统的战斗精神。  “如果你是U.C.L.A的Bruin，那么你应该跟随一个人格预订，并扮演角色，”Armor先生说。 “我们没有像许多吉率一样的人格书。 我可以做任何我想做的事。“ ", "note_en": "For one thing, it’s a loner, miles from kin that thrive in far wetter climates. Its massive roots are sandwiched between a concrete wall and railroad tracks. It has weathered coal and diesel smoke from passing trains for more than a century. It has survived earthquakes and record-breaking droughts, and a less destructive man-made force: graffiti.\n El Palo Alto — a 1,081-year-old redwood tree that has long served as the 120-foot-tall symbol of Palo Alto, the city that took its name — is arguably Silicon Valley’s original no-tech start-up.\n It still stands after nearly 11 centuries because it has been singled out for veneration, and people tend to have an emotional connection to charismatic megaflora with a story to tell, from the cedars of Lebanon in the Middle East to the major oak that supposedly housed Robin Hood and his men in Sherwood Forest. That’s El Palo Alto on the official emblem of the City of Palo Alto and the official seal of Stanford University. And that’s El Palo Alto, sort of, that dances around at Stanford games as the unofficial campus mascot, a googly-eyed oddball costumed tree with floppy branches.\n “It embodies the pioneer spirit of Palo Alto,” said Walter Passmore, the city’s former urban forester, who cared for the tree for nine years until he left the position in May. “Palo Alto has always prided itself on being home to innovators, leaders and creative thinking. That is what some people see in the tree.”\n After decades of near-death experiences, El Palo Alto was awaiting one last rescue effort that Mr. Passmore and others said would assure the future of the tall tree. Caltrain, a commuter rail line, has been planning to electrify the diesel trains that rumble about 25 feet away from the tree, a move that would eliminate the pollution that spews onto it daily.\n But the big tree will have to fend off the slings and arrows of its urban location for a while longer. The Caltrain project to switch from diesel to electric was supposed to happen this year, but officials decided to postpone it — until 2024.\n   On a recent visit, Mr. Passmore walked beneath El Palo Alto’s branches, a damp and spicy earthiness filling the small creekside park that serves as the tree’s base less than a mile from City Hall. As he spoke, he had to pause. The blinking red lights and clanging bells of a railroad crossing gate interrupted. A minute or two later, a Caltrain diesel, smoke trailing, whizzed by.\n El Palo Alto’s very existence there has been a fluke. Redwoods are insatiable rain and fog drinkers, thriving in places where the annual rainfall is five to 10 feet. In Palo Alto, less than two feet of precipitation is common. The tree is shorter than it used to be — it was about 162 feet tall in the 19th century but parts of the top died, likely from coal and diesel smoke — and as a result it is a pipsqueak compared with other, taller redwoods that approach 400 feet. And it is still only middle-aged — the oldest redwood in the country is estimated to be some 2,500 years old.\n Mr. Passmore believes that a coast redwood seed may have been swept down from the mountains by San Francisquito Creek, took purchase and was nourished over the centuries by the creek waters.\n Population growth and a flurry of wells drew down the creek’s water table in past decades, depriving the tree’s roots of water. Termites and compacted soil added to the decline. In the 1950s, the tree appeared gaunt and sickly. George Hood, a city arborist at the time, concocted a plumbing system that sent water up the trunk that bathed El Palo Alto in fog-like mist.\n “He called it a ‘Fool the Redwood’ plan,” said David Dockter, a retired city arborist who helped care for the tree for more than two decades and still monitors its health. “Redwoods drink from their crown as well as their roots, and he wanted to fool the redwood into thinking it was on the coast, getting a drink of water every day when the fog came in.”\n Wells were capped to bring the water table back up. Ground-penetrating radar was brought in to check the health of the tree’s interior. A camera-mounted drone was flown to the crown for an inspection. And a prism was placed at the top of the tree so surveyors can monitor its stability.\n “So far it hasn’t moved,” Mr. Dockter said. “That would be the first sign there’s ground movement.”\n Nevertheless, an emergency backup plan was set in motion: El Palo Alto’s seeds were collected and planted in 2004 in a historic tree nursery run by the nonprofit group American Forests, in case the tree keeled over and died.\n  El Palo Alto grows on the land that once belonged to the Ohlone Costanoan Esselen Nation. It entered recorded history in 1769, when the Spanish military officer Gaspar de Portola and 63 of his men rode into the region on a mission to expel the Jesuits from California. They spied the lone, double-trunked redwood from far off and camped near it. They first referred to it as Palos Colorados, which loosely translates to “red trees,” because of the redwood’s red bark. Later, when the second trunk came down in the 1880s, the tree became known as El Palo Alto, a Spanish phrase meaning “the tall stick.”\n One of the unsolved mysteries of El Palo Alto’s history is that the tree might be a pretender of sorts.\n “The tree we know as El Palo Alto might not be the tree Portola camped under,” said Steve Staiger, a historian for the Palo Alto Historical Association. “It may have been a tree that was further downstream that was chopped down by a Spanish military engineer to ford the creek.”\n Leland Stanford, the president of the Southern Pacific Railroad and a governor of California, purchased the land where the tree stood in 1876 for his family home and his Palo Alto stock farm, where he later founded Leland Stanford Junior University. The college was named after his only son, who died from typhoid on a trip to Europe at the age of 15.\n After the loss of the second trunk in the 1880s, Mr. Stanford directed that a stout wall be built to protect the remaining trunk, using logs and railroad ties. His widow, Jane Stanford, later had a larger, 25-foot-tall concrete wall built to keep the creek from taking out the roots and toppling the tree.\n Stanford University students used to hold a contest each year to fix the class flag to the top of the tree. The last climb was on the night before Admission Day in 1909. It went as student high jinks often go: rather poorly.\n According to a City of Palo Alto report, “the student became marooned in the crown after dark, and needed to be rescued by fellow students.”\n In the 1970s, a new tradition was born — having students dress up as a zany El Palo Alto to boost school spirit at sporting events. The irreverent mascot of the marching band, called the Stanford Tree, has become so revered that past tree costumes are stored in a climate-controlled room in the archives of the university’s Green Library.\n The current Stanford Tree is Grayson Armour, 21, a junior studying aerospace computational engineering. He was chosen from a group of vying “sprouts” to perform at games with uninhibited dancing, and has already adopted the same unconventional fighting spirit of the tree to which his googly-eyed costume pays homage.\n “If you’re the Bruin at U.C.L.A., there’s a personality book you are supposed to follow, and play the character,” Mr. Armour said. “We don’t have a personality book like a lot of mascots have. I can do whatever the hell I want.”", "posttime": "2021-06-30 00:41:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "el,redwood,红木", "title": "1,081岁的红木el Palo Alto不太可能生存 ", "title_en": "The Unlikely Survival of the 1,081 Year-Old Redwood El Palo Alto", "transed": 1, "url": "https://www.nytimes.com/2021/06/26/us/palo-alto-redwood.html", "via": "", "real_tags": ["el", "redwood", "红木"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AMG：此页面介绍了一个CARSER，它发现并描述了全局变量和类型。不是一切都是实现的，例如函数指针和位字段，但它确实走得很远。 yeti和ylex用于实现语法和扫描仪。输出处于DICT格式和SQLITE数据库，以适合您的应用程序的工作。您的本地C编译器用于获得数值数据，例如大小，偏移，对齐和枚举值。\n    CPARSER.TCL将令牌序列转换为描述全局变量和类型的DICT。\n  ＆＃34;编译＆＃34; cscanner.tcl和cparser.tcl使用yeti和ylex，缓存结果以加快后续调用。\n 在删除所有#include指令后，在源代码上运行c pre处理器，以剥离宏，条件和评论。\n 运行扫描仪和解析器以获取描述全局变量和类型的DICT。\n  driver.tcl假设你在lib子目录中有yeti，但如果它在任何标准tcl库安装目录中，它也会找到它。\n 剥夺的原因是删除的原因是避免通常使用编译器扩展的系统头文件，例如，内置函数，这段代码没有知道如何解析。您的申请可能需要不同的方法。 \nWarning: Can only detect less than 5000 characters", "note_en": "AMG: This page presents a  C parser which finds and describes global variables and types. Not everything is implemented, for example function pointers and bit fields, but it does go quite far.  Yeti and  ylex are used to implement the grammar and scanner. The output is in  dict format and an  SQLite database, whichever works better for your application. Your local C compiler is used to obtain numeric data such as sizes, offsets, alignments, and enumeration values.\n    cparser.tcl converts the sequence of tokens into a dict describing the global variables and types.\n  &#34;Compile&#34;  cscanner.tcl and  cparser.tcl using yeti and ylex, caching the result to speed up subsequent invocations.\n Run the C preprocessor on the source code, after removing all  #include directives, to strip away macros, conditionals, and comments.\n Run the scanner and parser to get the dict describing the global variables and types.\n  driver.tcl assumes you have yeti in the lib subdirectory, though if it&#39;s in any standard Tcl library installation directories, it&#39;ll be found there too.\n The reason  #include is stripped is to avoid system header files which typically use compiler extensions, e.g. built-in functions, that this code doesn&#39;t know how to parse. Your application may require a different approach.\n  # cscanner.tclpackage require ylex# Create the object used to assemble the scanner.yeti::ylex CScannerGenerator -name CScanner# On error, print the filename, line number, and column number.CScannerGenerator code error { if {$file ne {}} { puts -nonewline $verbout $file: } puts $verbout &#34;$line:$column: $yyerrmsg&#34;}# Define public variables and methods.CScannerGenerator code public { variable file {} ;# Current file name, or empty string if none. variable line 1 ;# Current line number. variable column 1 ;# Current column number. variable typeNames {} ;# List of TYPE_NAME tokens. # addTypeName -- # Adds a typedef name to the list of names treated as TYPE_NAME. method addTypeName {name} { lappend typeNames $name }}# Define internal methods.CScannerGenerator code private { # result -- # Common result handler for matches. Updates the line and column counts, # and (if provided) returns the arguments to the caller&#39;s caller. method result {args} { set text [string map {\\r {}} $yytext] set start 0 while {$start &lt; [string length $text]} { regexp -start $start {([^\\n\\t]*)([\\n\\t]?)} $text chunk body space incr column [string length $body] if {$space eq &#34;\\n&#34;} { set column 1 incr line } elseif {$space eq &#34;\\t&#34;} { set column [expr {(($column + 7) &amp; ~3) + 1}] } incr start [string length $chunk] } if {[llength $args]} { return -level 2 $args } } # lineDirective -- # Processes #line directives. method lineDirective {} { if {[regexp -expanded { ^[\\ \\t\\v\\f]*\\#[\\ \\t\\v\\f]*(?:line[\\ \\t\\v\\f]+)? (\\d+)(?:[\\ \\t\\v\\f]+&#34;((?:[^\\\\&#34;]|\\\\.)+)&#34;)? } $yytext _ line newFile] &amp;&amp; $newFile ne &#34;&#34;} { set file [subst -nocommands -novariables $newFile] } } # tokenType -- # Decides if a token is TYPE_NAME or IDENTIFIER according to $typeNames. method tokenType {} { if {$yytext in $typeNames} { return TYPE_NAME } else { return IDENTIFIER } }}# Define useful abbreviations for upcoming regular expressions.CScannerGenerator macro { EXP {[eE][+-]?\\d+} INT_SUFFIX {[uU]?[lL]{0,2}|[lL]{0,2}[uU]?} WHITESPACE {[ \\t\\v\\n\\f]} C_COMMENT {/\\*.*?\\*/} C99_COMMENT {//(?:\\\\.|[^\\n\\\\])*(?:\\n|$)} IGNORE {&lt;WHITESPACE&gt;|&lt;C_COMMENT&gt;|&lt;C99_COMMENT&gt;} DECIMAL {\\d+&lt;INT_SUFFIX&gt;\\M} OCTAL {0[0-7]+&lt;INT_SUFFIX&gt;\\M} HEXADECIMAL {0x[[:xdigit:]]+&lt;INT_SUFFIX&gt;\\M} CHAR_LITERAL {L?&#39;(?:[^\\\\&#39;]|\\\\.)+&#39;} INTEGER {&lt;DECIMAL&gt;|&lt;OCTAL&gt;|&lt;HEXADECIMAL&gt;|&lt;CHAR_LITERAL&gt;} REAL {(?:\\d+&lt;EXP&gt;|\\d*\\.\\d+&lt;EXP&gt;?|\\d+\\.\\d*&lt;EXP&gt;?)[fFlL]?\\M} STRING_LITERAL {L?&#34;(?:[^\\\\&#34;]|\\\\.)+&#34;} CONSTANT {&lt;INTEGER&gt;|&lt;REAL&gt;}}# Generate a regular expression matching any simple token. The value of such# tokens is the uppercase version of the token string itself.foreach token { auto bool break case char const continue default do double else enum extern float for goto if int long register return short signed sizeof static struct switch typedef union unsigned void volatile while ... &gt;&gt;= &lt;&lt;= += -= *= /= %= &amp;= ^= |= &gt;&gt; &lt;&lt; ++ -- -&gt; &amp;&amp; || &lt;= &gt;= == != ; \\{ \\} , : = ( ) [ ] . &amp; ! ~ - + * / % &lt; &gt; ^ | ?} { lappend pattern [regsub -all {[][*+?{}()&lt;&gt;|.^$\\\\]} $token {\\\\&amp;}]}set pattern [join $pattern |]# Match simple tokens.CScannerGenerator add $pattern {result [string toupper $yytext]}# Match and decode more complex tokens.CScannerGenerator add { {&lt;IGNORE&gt;} {result} {(?n)^[ \\t\\v\\f]*#.*$\\n} {lineDirective} {[a-zA-Z_]\\w*\\M} {result [tokenType] $yytext} {&lt;CONSTANT&gt;} {return CONSTANT} {&lt;STRING_LITERAL&gt;} {result STRING_LITERAL} {.} {error &#34;invalid character \\&#34;$yytext\\&#34;&#34;}}# vim: set sts=4 sw=4 tw=80 et ft=tcl:\n  # cparser.tclpackage require yeti# Create the object used to assemble the parser.yeti::yeti CParserGenerator -name CParser -start translation_unit# Define internal variables and methods.CParserGenerator code private { # Database of global symbols and types. This value is returned as the # result of the parse method. # # The top-level keys are core, enum, struct, union, typedef, and variable. # enum, struct, and union only describe explicitly tagged types, not those # used anonymously in a field, variable, or typedef. # # The second-level keys are the tag names of the types or variables being # described. Anonymous types are not present at this level of the database. # For core types, the names are sorted lists of type specifiers, e.g. &#34;int # short unsigned&#34; or &#34;int long long&#34;, and int is automatically added to the # list if none of char, int, float, or double are explicitly given by the # source code. # # The third-level keys describe type-/variable-wide data, and different # keys will be present depending on the category or other particulars of the # data being described, though several keys are common. # # Further nesting below the third level is possible. For example, anonymous # types are defined at point of use, not at the top level. # # The caller is invited to augment data at and below the third level with # information such as enumerator values, array size, and memory layout. # # Elements in all nested lists and dicts are in the order they are found in # the source file. # # Two keys will always appear at the third (type-/variable-wide) level. # These simply repeat the first and second level keys. This makes it easy # to operate on extracts from the overall data structure, and it facilitates # recursive use of the third-level structure within nested type dicts. # # - category: Type category. Repeats the first level key. Can be core, # enum, struct, union, typedef, or variable. # # - name: enum/struct/union type tag or typedef/variable name. Repeats the # second level key. # # The core category has no additional keys because the source code being # parsed uses but does not define the core types. # # The enum category has one more key, enumerators, giving the enumerator # list. Each element in the enumerator list is a dict containing the name # subkey which supplies the symbolic name for the enumerator. # # The struct and union categories provide a fields key which gives the list # of fields in the aggregate. Each element of the field list is a dict with # the following keys: # # - name: Name of the field. # # - type: Type of the field. Defined the same as any other third-level dict # in the database. It always has the category subkey, and the presence of # other subkeys depends on whether or not the field type is an anonymous # enum/struct/union. If anonymous, the name subkey is omitted, and the # type-specific subkeys (enumerators, fields, type, index) are present. # If not anonymous, or if this field is a core type or typedef, the name # subkey is present, and the type-specific subkeys are omitted. # # - reuse: Facility for using an anonymous struct, union, or enum to # declare more than one variable, typedef, or aggregate field. If this # key is present, the type key is omitted. Its value gives the name of # the prior entry in the same list of variables, typedefs, or fields as # the current entry which has the type key. Reuse is distinct from simply # repeating the type definition because C considers identical anonymous # types to be incompatible, whereas C allows an anonymous type definition # to be used several times in a row to produce variables, typedefs, or # fields with compatible types. It&#39;s quite possible for reused types to # have different indexing. # # - index: List of indirections used to access the field. Each element of # the list is a dict with the method subkey whose value is either pointer # or array. The first element in the list corresponds to the innermost # indirection, so the index value of &#34;int (*x)[]&#34; would be the two-element # list: {{method pointer} {method array}}. This list does not include any # indirections which may additionally be applied by typedefs. This key is # omitted if no indirections are being used. # # The typedef and variable categories include the type, reuse, and index # keys, which have the same definition as the like-named keys inside the # struct and union field list elements. # # Here is an example showing C code and its corresponding database dict: # # typedef struct {int a; enum T {E1, E2} *b;} S, (*P)[3]; # P x, *y[5]; # # core { # int {category core name int} # } enum { # T {category enum name T enumerators {{name E1} {name E2}}} # } typedef { # S { # category typedef name S # type {category struct fields { # {name a type {category core name int}} # {name b type {category enum name T} index {{method pointer}}} # }} # } P { # category typedef name P reuse S # index {{method pointer} {method array}} # } # } variable { # x { # category variable name x # type {category typedef name P} # } y { # category variable name y # type {category typedef name P} # index {{method array} {method pointer}} # } # } variable database {} # Nonzero if the typedef storage class specifier was encountered within the # current declaration. variable typedef 0 # registerTypedef -- # If this declarator is part of a typedef, registers the identifier as a # type name. This must be done as early as possible because the parser # maintains one token of lookahead. If this processing were to be deferred # until the declaration is complete, the next token, which could be this # new type name, will have already been read ahead and miscategorized as an # identifier. method registerTypedef {declarator} { if {$typedef} { $scanner addTypeName [dict get $declarator name] } } # registerDecl -- # Saves the current variable or typedef declaration in the database, and # prepares for the next. method registerDecl {decls} { foreach decl $decls { if {[dict exists $decl name]} { set category [lindex {variable typedef} $typedef] dict set decl category $category dict set database $category [dict get $decl name] $decl } } set typedef 0 } # appendArray -- # Appends one level of array indexing to an index list in a declarator. method appendArray {decl} { dict lappend decl index [dict create method array] } # mergeType -- # Combines two type specifiers, concatenating their name lists and merging # all other dict keys. method mergeType {lhs rhs} { if {[dict exists $lhs name] &amp;&amp; [dict exists $rhs name]} { dict set rhs name [lsort [concat\\ [dict get $lhs name] [dict get $rhs name]]] } dict merge $lhs $rhs } # mergeDeclType -- # Merges declaration specifiers with a list of initial declarators. # Specially handles the case of an anonymous type being used to declare # multiple fields, variables, or typedefs. method mergeDeclType {type decls} { # Default to int if no type given. if {![dict size $type]} { set type [newCore int] } # Assemble the declarators, complete with type. if {[dict exists $type name] || [llength $decls] &lt; 2} { # Normal situation: merge the specifiers into each declarator. lmap decl $decls {dict replace $decl type $type} } else { # Complex situation: merge the specifiers only into the first # declarator, then omit type specifier data from each subsequent # merged declarator, instead referring back to the first. set decls [lassign $decls first] dict set first type $type set name [dict get $first name] list $first {*}[lmap decl $decls {dict replace $decl reuse $name}] } } # newCore -- # Creates a core type given its name list, and stores it into the database # if not already present. method newCore {name} { if {![dict exists database core $name]} { dict set database core $name category core dict set database core $name name $name } dict create category core name $name } # newAgg -- # Creates a struct or union given category, name, and field list. Either # name or fields can be empty string if not directly specified. Stores the # struct or union in the database if it has both a name and a field list. method newAgg {category name fields} { if {$name eq {}} { dict create category $category fields $fields } else { if {[llength $fields]} { dict set database $category $name name $name dict set database $category $name category $category dict set database $category $name fields $fields } dict create category $category name $name } } # newEnum -- # Creates an enumeration given its name and enumerator list. Either can be # empty string if not directly specified. Stores the enum in the database # if it has both a name and an enumerator list. method newEnum {name enumerators} { if {$name eq {}} { dict create category enum enumerators $enumerators } else { if {[llength $enumerators]} { dict set database enum $name name $name dict set database enum $name category enum dict set database enum $name enumerators $enumerators } dict create category enum name $name } }}# On error, print the filename, line number, and column number.CParserGenerator code error { if {[set file [$scanner cget -file]] ne {}} { puts -nonewline $verbout $file: } puts $verbout &#34;[$scanner cget -line]:[$scanner cget -column]: $yyerrmsg&#34;}# Reset handler.CParserGenerator code reset { set database {} set typedef 0}# Disable the default {return $1} behavior.CParserGenerator code returndefault {}# Define the grammar and parser behavior.CParserGenerator add { optional_comma {} - | {,} - primary_expression {IDENTIFIER} - | {CONSTANT} - | {STRING_LITERAL} - | {( expression )} - postfix_expression {primary_expression} - | {postfix_expression [ expression ]} - | {postfix_expression ( )} - | {postfix_expression ( argument_expression_list )} - | {postfix_expression . IDENTIFIER} - | {postfix_expression -&gt; IDENTIFIER} - | {postfix_expression ++} - | {postfix_expression --} - argument_expression_list {assignment_expression} - | {argument_expression_list , assignment_expression} - unary_expression {postfix_expression} - | {++ unary_expression} - | {-- unary_expression} - | {unary_operator cast_expression} - | {SIZEOF unary_expression} - | {SIZEOF ( type_name )} - unary_operator {&amp;} - | {*} - | {+} - | {-} - | {!} - | {~} - cast_expression {unary_expression} - | {( type_name ) cast_expression} - multiplicative_expression {cast_expression} - | {multiplicative_expression * cast_expression} - | {multiplicative_expression / cast_expression} - | {multiplicative_expression % cast_expression} - additive_expression {multiplicative_expression} - | {additive_expression + multiplicative_expression} - | {additive_expression - multiplicative_expression} - shift_expression {additive_expression} - | {shift_expression &lt;&lt; additive_expression} - | {shift_expression &gt;&gt; additive_expression} - relational_expression {shift_expression} - | {relational_expression &lt; shift_expression} - | {relational_expression &gt; shift_expression} - | {relational_expression &lt;= shift_expression} - | {relational_expression &gt;= shift_expression} - equality_expression {relational_expression} - | {equality_expression == relational_expression} - | {equality_expression != relational_expression} - and_expression {equality_expression} - | {and_expression &amp; equality_expression} - exclusive_or_expression {and_expression} - | {exclusive_or_expression ^ and_expression} - inclusive_or_expression {exclusive_or_expression} - | {inclusive_or_expression | exclusive_or_expression} - logical_and_expression {inclusive_or_expression} - | {logical_and_expression &amp;&amp; inclusive_or_expression} - logical_or_expression {logical_and_expression} - | {logical_or_expression || logical_and_expression} - conditional_expression {logical_or_expression} - | {logical_or_expression ? expression : conditional_expression} - assignment_expression {conditional_expression} - | {unary_expression assignment_operator assignment_expression} - assignment_operator {=} - | {*=} - | {/=} - | {%=} - | {+=} - | {-=} - | {&lt;&lt;=} - | {&gt;&gt;=} - | {&amp;=} - | {^=} - | {|=} - expression {assignment_expression} - | {expression , assignment_expression} - constant_expression {conditional_expression} - declaration {declaration_specifiers ;} {return $1} | {declaration_specifiers init_declarator_list ;} {mergeDeclType $1 $2} declaration_specifiers {storage_class_specifier} - | {storage_class_specifier declaration_specifiers} {return $2} | {type_specifier} {return $1} | {type_specifier declaration_specifiers} {mergeType $1 $2} | {type_qualifier} - | {type_qualifier declaration_specifiers} {return $2} init_declarator_list {init_declarator} {list $1} | {init_declarator_list , init_declarator} {concat $1 [list $3]} init_declarator {declarator} {registerTypedef $1; return $1} | {declarator = initializer} {return $1} storage_class_specifier {TYPEDEF} {set typedef 1} | {EXTERN} - | {STATIC} - | {AUTO} - | {REGISTER} - type_specifier {VOID} {newCore void} | {CHAR} {newCore char} | {SHORT} {newCore short} | {INT} {newCore int} | {LONG} {newCore long} | {FLOAT} {newCore float} | {DOUBLE} {newCore double} | {SIGNED} {newCore signed} | {UNSIGNED} {newCore unsigned} | {struct_or_union_specifier} {return $1} | {enum_specifier} {return $1} | {TYPE_NAME} {dict create category typedef name $1} struct_or_union_specifier {struct_or_union IDENTIFIER \\{ struct_declaration_list \\}} {newAgg $1 $2 $4} | {struct_or_union \\{ struct_declaration_list \\}} {newAgg $1 {} $3} | {struct_or_union IDENTIFIER} {newAgg $1 $2 {}} struct_or_union {STRUCT} {return struct} | {UNION} {return union} struct_declaration_list {struct_declaration} {return $1} | {struct_declaration_list struct_declaration} {concat $1 $2} struct_declaration {specifier_qualifier_list struct_declarator_list ;} {mergeDeclType $1 $2} specifier_qualifier_list {type_specifier specifier_qualifier_list} {mergeType $1 $2} | {type_specifier} {return $1} | {type_qualifier specifier_qualifier_list} {return $2} | {type_qualifier} - struct_declarator_list {struct_declarator} {list $1} | {struct_declarator_list , struct_declarator} {concat $1 [list $3]} struct_declarator {declarator} {return $1} | {: constant_expression} - | {declarator : constant_expression} {return $1} enum_specifier {ENUM \\{ enumerator_list optional_comma \\}} {newEnum {} $3} | {ENUM IDENTIFIER \\{ enumerator_list optional_comma \\}} {newEnum $2 $4} | {ENUM IDENTIFIER} {newEnum $2 {}} enumerator_list {enumerator} {list [dict create name $1]} | {enumerator_list , enumerator} {concat $1 [list [dict create name $3]]} enumerator {IDENTIFIER} {return $1} | {IDENTIFIER = constant_expression} {return $1} type_qualifier {CONST} - | {VOLATILE} - declarator {pointer direct_declarator} {dict lappend 2 index {*}$1} | {direct_declarator} {return $1} direct_declarator {IDENTIFIER} {dict create name $1} | {( declarator )} {return $2} | {direct_declarator [ constant_expression ]} {appendArray $1} | {direct_declarator [ ]} {appendArray $1} | {direct_declarator ( parameter_type_list )} {retur\n......", "posttime": "2021-06-30 00:41:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解析,types,tcl", "title": "在TCL中解析C类型（2016） ", "title_en": "Parsing C Types in Tcl (2016)", "transed": 1, "url": "https://wiki.tcl-lang.org/page/Parsing+C+Types", "via": "", "real_tags": ["解析", "types", "tcl"]}, {"category": "", "categoryclass": "", "imagename": "3bf14b941f26dd0397a74766592070a5.jpeg", "infoid": 1068655, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在会议中，我一直是一个相当勤奋的笔记。采取笔记有助于我跟踪对话和任何结果的行动项目，保留信息，并充当我的日志 - 这是一种轻松回顾过去的会议和讨论的方式，以便慢跑我的记忆或拉出特定的背景。多年来我经历了各种各样的票据。在过去，我使用了Evernote要记笔记，然后我在笔记本中切换到手写笔记，然后转到Google文档。现在我对我的会议说明使用了题目。\n 我也经历了各种技巧，我如何写下笔记。事实证明还有很少的注意方法。我已经尝试了自己的句子方法的变体，在那里你基本上捕获了以抄本格式的讨论。我会以人称的名称或姓名为前缀每个对话块。我的会议票据最终会看到这样的东西：\n MT：我们是否以速度或效率优化？赋予了自主权和灵活性的赋权，但碎片和效率低下可能需要一些平衡，例如，也许共享群集团队部署到\n KM：我们有一个治理问题 - 在安全方面没有任何重大缺陷，不明确的角色/职责使得难以规范化\n  正如您所见，它更捕捉到删节格式的突出点，而不是在会议中所说的完整句子。我发现在发生会议时写下（甚至打字）完整的句子几乎是不可能的，而不是那么有用，特别是如果是我需要从事的讨论。我通常只需要足够的背景来慢跑我的记忆，而不是回想起逐字的内容。\n 我还尝试了概述的票据方法。有了这个，讨论更像是一本书大纲而不是成绩单。这种风格一直对我感到更自然，这就是我倾向于倾向于习惯的东西。我大量使用嵌套子弹列表。这些注释通常如下所示：\n     我发现嵌套列表灵活且易于快速抖动笔记并在讨论点添加进一步的上下文，但嵌套有很容易离开手。我试图通过“大想法”来保持分组的东西。这种技术的另一个挑战是会议倾向于徘徊。很少讨论通过会议议程线性移动。相反，他们击中了一个议程项目，然后圈回到上一个项目，然后向前跳到另一个议程项目等等。同样，“议程”并不总是明确定义的 - 主题添加，删除，更改。这意味着它并不总是很容易知道“大想法”是什么或者谈话的特定部分落入轮廓。相反，您必须在飞行中确定这一点，可以采取一些认知负载。最后，我发现它真的很有价值，了解谁在会议中的关键讨论点是什么。例如，从上面的摘录中取出这条线： \n在这种情况下，了解谁在做出这一点至关重要，以及恰恰是如何提出要求。\n 出于这些原因，我已经解决了我的纸张用杂交方法，将抄本式笔记的元素与大纲式相结合。我倾向于将大型想法分组成轮廓格式，因为我能够为删除删节，转录式的讨论点，以了解谁在那里知道谁说是什么意思或使用的特定词语是重要的（他们经常是但是总结会议票据的重要性可能会丢失。通过这种方法，上面的例子如下所示：\n    制定替换身份系统的决定Cl：我认为Azure AD是最终用户Auth的正确选择\n 我发现这种方法在灵活性之间攻击了舒适的平衡（在能够根据会议的自然流动适应我的笔记的结构），准确性（在捕获重要的背景和细节方面）和效率（就我在剩余的谈判时捕获笔记的能力而言的方面。\n  我没有触动的一个部分是我如何组织我的笔记。当我是一个经理和我曾经采取手写笔记时，我将在我的笔记本电脑或甚至单独的笔记本中有一个专门的部分 - 对于我的每个直接报告。这给了我一个关于我的每两周一次的长期上下文线程。它使得很容易迅速参考我们先前讨论过的内容，问题空间，团队成员目前在工作中，他们遇到了浮出水面或挑战，或者只是普遍值得注意的“生活”的事情（毕竟，良好的一致） -ones不仅仅是状态检查）。\n 我很快意识到这种与人们关联的技术更广泛有用。这些会议中的人民索引​​会议票据有很多价值，所以我开始在我的笔记中包含会议的与会者，这样我就可以更轻松地维护和导航这些上下文线程。然而，这被证明是有点挑战，而这一原因有点挑战。\n 首先，我会发现自己疯狂地试图在每次会议开始时记下所有与会者的名字。当会议将包括我之前没有满足的人（在咨询中比我在软件公司工作时更频繁）时，这尤其困难。在轮队介绍期间，我会试图击败人们的名字和一些关于他们的其他信息。我经常以错误的姓名，拼写错误的姓名，部分名称，或者完全缺少名称。 \n其次，拍摄应用程序的很多笔记并不是那么有利于这种方法。我经常使用映射到与会者的标签来创建此组织结构，但标签通常不是为此类型的用例而设计，而是用于大型主题或主题，例如在Evernote中。我的意思是在支持它们的大多数生产力应用中，标签旨在将内容组织成类别。例如，您可能有十几个左右的标签，您涉及的不同项目。每个人都有数百个标签 - 通常导致UX或可用性问题。标签的另一个问题是它需要大量的护理和维护，以确保正确的标记应用于每个音符。任何错误都会导致系统分开。\n 这就是为什么我们在您的日历和会议中更多地致力于中心设计。这也是为什么我们在产品中非常早期将标签作为特征丢弃。我们发现，通过自动组织人们和时间，标记变得更加有用。\n  在过去，我常常不会回顾我所采取的先前注释。不是因为这些笔记没有用，但因为通常很难找到即将到来的会议的相关票据。相反，我不会出现在没有真正做好准备的情况下会议。从经验中，我怀疑大多数人都是这种情况。会议经常从几分钟开始让每个人都恢复速度，因为没有人真的在他们的脑海里新鲜。以前的讨论和决定经常迷失。\n 我将在会议期间捕获动作项的方式将是强调（如果手写）或粗体（如果键入）在备注中的一部分并将其提交给内存。重要的事情总是被重要的本质所记住的，但略有重要的重要但仍然有价值的物品通常会忽略我的思想。这是对我工作的好和伟大之间的区别。这是错过的东西，没有人真正通知，但是当你在它的顶部时，人们认为你是超人的。\n 然而，通过这种新的组织方法以及举行的事实，通过人员和会议系列自动组织我的笔记，我现在通常通过快速审查以前的相关票据来准备会议。我使用这些笔记来建立即将举行的会议的议程或通过将其提醒自己通过将其提醒到即将召开的会议的票据来提醒自己。在会议期间，很容易迅速释放重要的背景或者审查以前到达的决定。在诙谐的情况下，我通过简单地添加“!!”捕获一个动作项目在一条线的结束时让我知道，充满信心地，它不会穿过裂缝。\n  我从来没有真正找到了一个似乎是为了会议目的而建造的笔记应用程序。谷歌文档甚至不是一个Notes应用程序，坦率地说，坦率地区暂时只是一个可怕的经验，从拍摄（而Google Drive令人惊讶地来自在搜索上建立的公司的搜索）。 Evernote，以及我尝试过的许多其他拍摄的应用程序，感觉太过普遍，臃肿，也没有觉得有利于在会议周围更具各种各样的工作流程。这是我们构建诙谐的原因的一部分，为什么它不仅仅是另一个Notes应用程序。我们希望在会议票据周围建立更好的工作流程，以便工作围绕他们的日历围绕其工作的人可以感受到他们的工作。 ", "note_en": "I’ve always been a fairly diligent note taker in meetings. Taking notes helps me track the conversation and any resulting action items, retain information, and act as a journal for my day—a way to easily look back at past meetings and discussions in order to jog my memory or pull out a specific piece of context. I’ve gone through various note taking systems over the years. In the past, I used Evernote to take notes, then I switched to handwritten notes in a notebook, then to Google Docs. Now I use  Witful for my meeting notes.\n I’ve also gone through various techniques for how I  write notes themselves. It turns out there are quite a few  methods of note taking. I’ve tried my own variation of the sentence method, where you’re basically capturing the discussion in transcript format. I would prefix each block of conversation with the name or initials of the person saying it. My meeting notes would end up looking something like this:\n MT: Are we optimizing for velocity or efficiency? Empowered teams with autonomy and flexibility but fragmentation and inefficiencies Probably need some balance, e.g. maybe shared cluster teams deploy stuff to\n KM: We’ve had an issue with governance—there isn’t any Major deficiency on security side Unclear roles/responsibilities has made it difficult to standardize\n  As you can see, it’s more capturing the salient points in an abridged format rather than complete sentences as they were said in the meeting. I’ve found that writing down (or even typing) full sentences while a meeting is happening is nearly impossible, and not that useful, especially if it’s a discussion that I am needing to be engaged in. I usually just need enough context to jog my memory, not recall what was said verbatim.\n I’ve also tried the outline method of taking notes. With this, the discussion looks more like a book outline than a transcript. This style has always felt more natural to me and it’s what I tend to gravitate towards out of habit. I make heavy use of nested bullet lists. These notes typically look like the following:\n     I find nested lists flexible and easy to quickly jot down notes and add further context to a discussion point, but it’s easy for the nesting to get out of hand. I try to keep things grouped by the “big ideas.” Another challenge with this technique is that meetings tend to wander. Rarely do discussions move linearly through a meeting agenda. Rather, they hit an agenda item, then circle back to a previous item, then jump forward to another agenda item, and so forth. Similarly, the “agenda” is not always well defined—topics get added, removed, changed. This means it’s not always easy to know what the “big ideas” are or where a particular part of the conversation falls into the outline. Instead, you have to determine this on the fly which can take some cognitive load. Lastly, I’ve found it can be really valuable to know who is saying what  for key discussion points in a meeting. For example, taking this line from the excerpt above:\n  In this case, it would be critical to know  who is making this ask as well as precisely  how the ask was made.\n For these reasons, I’ve come to settle on a hybrid approach to my note taking which combines elements of the transcript-style notes with the outline-style. I tend to group the big ideas into outline format as I’m able to in addition to capturing abridged, transcript-style notes for  key discussion points where knowing  who is saying  what matters or if the specific words used are important (they often are but that importance can get lost with summarized meeting notes). With this approach, the above example looks more like this:\n    Making decision on replacing identity system CL: I don’t think Azure AD is the right choice for end user auth\n I’ve found this method strikes a comfortable balance between flexibility (in terms of being able to adapt the structure of my notes based on the natural flow of a meeting), accuracy (in terms of capturing important context and details), and efficiency (in terms of my ability to capture notes while remaining engaged in the conversation).\n  One part I haven’t touched on is how I  organize my notes. When I was a manager and I used to take handwritten notes, I would have a dedicated section in my notebook—or even  separate notebooks—for each of my direct reports. This gave me a long-running contextual thread for each of my biweekly one-on-ones. It made it easy to quickly reference what we had previously discussed, the problem space the team member was currently working in, concerns they had surfaced or challenges they were facing, or just general noteworthy “life” things (after all, good one-on-ones are more than just status checks).\n I soon realized  this technique of associating notes with people was much more broadly useful. There is a lot of value in indexing meeting notes by the people in those meetings, so I began to include the attendees of a meeting in my notes such that I could more easily maintain and navigate those contextual threads. This proved to be a bit challenging for a couple of reasons, however.\n First, I would find myself frantically trying to write down the names of all the attendees at the start of every meeting. This was especially difficult when meetings would include people I had not met before (which is more frequent in consulting than it was when I worked at a software company). I’d be trying to jot down people’s names and some additional information about them during rounds of introductions. I’d often end up with incorrect names, misspelled names, partial names, or simply missing names altogether.\n Second, a lot of note taking apps aren’t really all that conducive to this approach. I’d frequently use tags that were mapped to attendees to create this organizational structure, but tags are usually not designed for this type of use case and instead are intended for large topics or themes, such as in Evernote. What I mean by this is in most productivity apps that support them, tags are intended for organizing content into categories. For example, you might have a dozen or so tags for different projects you are involved in. Having  hundreds of tags—one for every person—often caused UX or usability problems. Another issue with tags is that it requires a lot of care and maintenance to make sure the correct tags get applied to every note. Any mistake causes the system to fall apart.\n This is why we designed Witful to center more around your calendar and the  people in your meetings. It’s also why we dropped tags as a feature very early on in the product. We found that by automatically organizing notes by people and time, tagging became a lot less useful.\n  In the past, I would often not actually look back at previous notes I had taken. Not because those notes weren’t useful, but because it was usually difficult to find the relevant notes for an upcoming meeting. Instead, I would just show up to a meeting without really doing any prep. From experience, I suspect this is the case for most people. Meetings frequently start with several minutes of getting everyone back up to speed because no one really has the context fresh in their mind. Previous discussions and decisions often get lost.\n The way I would capture an action item  during a meeting would be to underline (if handwritten) or bold (if typed) the part in the note and commit it to memory. Important things would always get remembered by the very nature of being important, but the slightly-less-important-but-still-valuable items would often slip my mind. This was the difference between being good and great at my job. It’s the stuff that, when missed, no one really notices, but when you’re on top of it, people think you’re superhuman.\n However, with this new organizational approach and the fact that Witful automatically organizes my notes by people and meeting series, I now usually prepare for a meeting by quickly reviewing previous relevant notes. I use these notes to build out an agenda for upcoming meetings or to remind myself of key discussion points by adding them to the note for the upcoming meeting. During a meeting, it’s easy to quickly pull out important pieces of context or to review how a decision was arrived at previously. In Witful, I capture an action item by simply adding “!!” to the end of a line which lets me know, with confidence, it won’t slip through the cracks.\n  I’ve never really found a notes app that seemed to be built for the purpose of meetings. Google Docs isn’t even a notes app, and is frankly just a terrible experience when it comes to note taking (and Google Drive has surprisingly awful search coming from a company built on search). Evernote, along with many other note-taking apps I’ve tried, feels too generic and bloated, nor does it feel conducive to a more opinionated workflow around meetings. It’s part of the reason why we built Witful and why it’s not  just another notes app. We want to build a better  workflow around meeting notes so that people whose work revolves around their calendar can feel superhuman at their job.", "posttime": "2021-06-30 00:40:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "笔记,notes,会议", "title": "我在会议中采取笔记的方法 ", "title_en": "My approach to taking notes in meetings", "transed": 1, "url": "https://blog.witful.com/how-i-take-notes-in-meetings/", "via": "", "real_tags": ["笔记", "notes", "会议"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068654, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谈判一直是我职业生涯的支柱之一。我已经在世界各地的软件活动中给出了keynotes。这些谈判中的一些甚至甚至数百人在YouTube上有成千上万的意见。我一直被要求回来，所以我认为我做了一个非常不错的工作。但是当他们学到我的口语职业最重要的事情时，那些不认识我的人往往很惊讶。\n  我更喜欢去牙医的旅行来完成馅料。经常发言的未来的前景是唯一严重的事情让我考虑留下思考。\n 这并不总是这样。当我在学校是个孩子的时候，我觉得对公众的恐惧说，其他人谈到了。我喜欢在舞台上，响亮的声音和充足的信心，我感觉很好在那里。一旦我进入工作世界，我仍然是真的，我的舒适度达到了我的职业生涯。但随着时间的推移，这改变了。在我的三十多岁，我厌倦了多日培训课程，并举办了我的培训材料，以单日事务。当我加入思考的时候，我的一个幸福的想法是，没有渴望他们让我再做培训课程。那时会议和客户谈话不是问题，但这也是改变。\n 我真的非常肯定是一个恐慌的攻击，但在我上舞台之前，我会感到恐惧的激烈，一个压倒逃离的欲望 - 将自己锁在厕所里或迷失在一些陌生的城市。我的心率通过快速火灾爆发，我觉得我的胸部紧绷，我的肌肉都是紧张的。我现在习惯了这个，所以我试图应对稳定的呼吸，并试图找到一些分散我的注意力。这并没有阻止我发言，我太自豪了一个专业让事情发生，而且我不想让那些来到我的人。毕竟我父亲在一家毁了他的肺部的工厂工作后，无数人在日常工作中造成严重的健康风险 - 相比我不觉得我可以抱怨这些焦虑的爆发。\n 虽然这些感受在谈话前定期发生，但他们也会在其他时候弹出。我经常在飞机上驶向该位置时得到它们。我拍在安全带上，穿上我的耳机，并尝试专注于音乐，而不是在飞机上运行的诱惑。他们也可以早点罢工，通常在我离开家之前的几天里，把我的睡眠扔掉或分散我的注意力。甚至写这件事我觉得我的胸部紧绷，正在注意稳步深呼吸。\n 一旦我实际上在舞台上，恐慌通常会在一两分钟内消失。肾上腺素踢了，这就是推动我通过谈话的原因。 （这是在线谈判的问题，我发现找到尾风更难。）肾上腺素也有助于我应对谈话后提出问题的人。之后有不可避免的崩溃，我觉得几个小时才会，疲惫不堪，但无法睡觉。\n 这种反应很常见，很多人认为公众说是他们最可怕的事件之一。当然，我的经历让我了解为什么这么多人在表演艺术中与吸毒成瘾斗争。这是一个诱惑的诱惑，也许只是啤酒，将有助于处理前的前恐慌。因此，我小心翼翼地遵循在发言前从不喝酒。 \n所有这一切肯定会在思考的意见中的关系很复杂。毕竟，我的一部分是一个公共面孔，将人们吸引到一个活动中。我相信如果我想要，我可以每周花费我们的客户和营销团队的活动，许多人发现我努力蠕动令人难以置信，以便摆脱这样的机会。但是，我也很感激多年来从思想署领导中获得的支持，如我觉得在我的立场矛盾的危机中被困的时间，这是该公司鼓励我设定的两个高级人士在我的口语周围清晰坚定的限制（再次感谢，乍得和戴夫）。\n 在Covid休眠期间，我真的很感激不经历所有这些。我已经设法避免在线谈判，几乎完全没有这种压力。当我们回到新的正常时，我不想回到它。所以，在未来，我将尝试拒绝几乎每一个请求谈话。我不确定那些会锻炼的努力，但我已经达到了我的生活中，我很幸运能够避免让我悲惨的东西，并希望利用我的好运。我会错过我在会议电路上做出的成立和越来越多的关系，但我不会错过舞台上的恐惧。对于那些希望邀请我在活动中发言的人来说，这就是为什么我会说“不”。那里有很多好的发言者可以尽可能多地做到这一点，其中许多是我的同事。\n 那么我能做的时间和能量如何做我拯救的时间？主要是指专注于写作，特别是与同事合作，帮助他们写下他们的课程和想法。由于我稳步与软件开发日常生活中断地断开连接，我觉得我通过帮助改善那些与那些联系的人的沟通来提供最大的价值。 Martinfowler.com上的许多最好的文章由其他人写。其中一些文章对我来说需要很少的帮助，但其他物品允许我贡献很多 - 主要是在选择和组织材料的流动时。我越来越享受那种工作，希望读者继续发现它很有用。 （我也会补充一点，我也试图减慢一点，因为我年纪大了，我感到更倾向于沉迷于一些懒惰的愿望。） ", "note_en": "Giving talks has been one of the pillars of my career. I’ve given keynotes at software events all over the world. Some of these talks have tens, even hundreds, of thousands of views on youtube. I keep being asked back, so I assume I do a pretty decent job. But those who don’t know me well are often surprised when they learn the most important thing about my speaking profession.\n  I far prefer a trip to the dentist to have fillings done. The prospect of a future of frequent speaking was the only thing that’s seriously made me consider leaving ThoughtWorks.\n It’s not always been this way. When I was a kid at school I felt none of the fear of public speaking that others talked about. I enjoyed being on stage, and with my loud voice and plenty of confidence, I felt good about being there. That continued to be true once I entered the world of work, and my comfort on-stage did much to boost my career. But over time, this changed. In my thirties I got sick of multi-day training courses and organized my training materials to be single-day affairs. When I joined ThoughtWorks one of my happy thoughts was that there was no desire for them to have me do training courses any more. At that time conference and client talks weren’t a problem, but that too was to change.\n I’m not really sure what counts as a panic attack, but before I go on stage I get intense feels of dread, an overwhelming desire to flee - to lock myself in a toilet or lose myself in some strange city. My heart rate goes through rapid fire bursts, I feel a tightness in my chest and my muscles all tense up. I’m used to this now, so I try to cope with steady breathing, and try to find something to distract me. It’s not stopped me from giving a talk, I’m too proud a professional to let that happen, and I don’t want to let down the people who have come to listen to me. After all my father worked in a factory that ruined his lungs, countless people take serious health risks in their daily work - compared to that I don’t feel I can complain too much about these bursts of anxiety.\n While these feelings occur regularly right before a talk, they also pop up at other times. Often I get them while getting on the airplane to head out to the location. I slap on the seat belt, put on my headphones and try to concentrate on the music, not giving in to the temptation of running off the airplane. They can also strike earlier, usually in the few days before I leave home, throwing my sleep off or distracting me from other work. Even writing this I feel a tightness in my chest and am taking care to take steady deep breaths.\n Once I’m actually on stage, the panics usually disappear within a minute or two. Adrenaline kicks in, and that’s what propels me through the talk. (That’s a problem with online talks, I find it much harder to find that tailwind.) That adrenaline also helps me cope with people who come up after the talk to ask questions. Afterwards there is the inevitable crash, and I feel walloped for hours, tired out but unable to sleep.\n This kind of reaction is pretty common, many people consider public speaking to be one of their most frightening events. Certainly my experience has given me an understanding of why so many people in the performing arts struggle with drug addictions. It’s such a temptation to think that something, maybe just a beer, will help deal with the pre-event panics. Consequently I’m careful, and follow a rule of never drinking before giving a talk.\n All of this certainly makes my relationships here at ThoughtWorks rather complicated. After all, part of my role is to be a public face, to draw people into an event. I’m sure that if I wanted, I could spend every week doing events for our clients and marketing teams, and many find it frustrating that I work so hard to wriggle out of such opportunities. But I’m also grateful to the support I’ve received from ThoughtWorks leaders over the years, such as the time I felt trapped in the crises of the contradiction of my position and it was two senior folks in the company who encouraged me to set clear and firm limits around my speaking (thanks again, Chad and Dave).\n During the Covid hibernation, I’ve really appreciated not going through all this. I’ve managed to avoid online talks and had a year almost entirely free of this kind of stress. I don’t want to go back to it as we return to a new normal. So, in the future, I am going to try to refuse almost every request to do talks. I’m not sure how well that will work out, but I’ve reached the point in my life where I’m lucky enough to be able to avoid things that make me miserable, and want to take advantage of my good fortune. I will miss forming and growing relationships that I’ve made on the conference circuit, but I won’t miss the dread of going on stage. For those looking to invite me to speak at events, this is why I’ll be saying “no”. There are plenty of good speakers out there who can do at least as good a job as I can, many of which are my colleagues at ThoughtWorks.\n So what will I do with the time and energy I’m saving? Primarily it means focusing on writing, in particular working with colleagues to help them write about their lessons and ideas. As I steadily get more disconnected from the day-to-day of software development, I feel I provide my greatest value by helping improve communication from those who have that connection. Many of the best articles on martinfowler.com are written by other people. Some of those articles need little help from me, but others allow me to contribute a lot - mostly in choosing and organizing the flow of the material. I’m increasingly enjoying that kind of work and hope readers continue to find it useful. (I’ll also add that I’m trying to slow down a bit as well, as I get older I feel a greater desire to indulge in some laziness.)", "posttime": "2021-06-30 00:40:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "讲话,stepping,觉得", "title": "踩到讲话 ", "title_en": "Stepping Back from Speaking", "transed": 1, "url": "https://martinfowler.com/articles/202106-reducing-speaking.html", "via": "", "real_tags": ["讲话", "stepping", "觉得"]}, {"category": "", "categoryclass": "", "imagename": "f912c4a920a763ac89ddb5733d2d10f8.png", "infoid": 1068653, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用GitHub CopIlot，在编辑器内部提供全线或整个函数的建议。\n   Github Copilot培训了数十亿行公告，将您需要的知识放在触手可及，节省您的时间并帮助您保持专注。\n GitHub Copilot今天可用作为Visual Studio代码扩展名。它在Visual Studio代码工作的任何地方 - 在您的计算机上或GitHub代码空间上的云中。它足以在您键入时使用。\n GitHub Copilot使用广泛的框架和语言。技术预览尤其适用于Python，JavaScript，Cyperscript，Ruby以及Go，但它理解了数十种语言，可以帮助您几乎任何东西都找到您的方式。\n 使用GitHub CopIlot，您总是负责。您可以通过替代建议循环，选择接受或拒绝，并手动编辑建议的代码。 GitHub Copilot适应您所做的编码，匹配您的编码风格。\n GitHub Copilot由Codex提供动力，由Openai创建的新AI系统。 GitHub Copilot比大多数代码助理更明显地理解更多的上下文。因此，无论是在DocString，注释，功能名称还是代码本身中，Github Copilot都使用您提供的上下文并综合代码来匹配。与Openai一起，我们设计GitHub Copilot在制作安全和有效的代码时更聪明，因为开发人员使用它。\n  跳过文档并停止搜索示例。 GitHub CopIlot有助于您在您的编辑中重点关注。 \n将评论转换为代码。写一个描述所需逻辑的注释，并让GitHub Copilot为您组装代码。\n   用于重复码的自动夹。 GitHub Copilot非常适合快速生产样板和重复码模式。喂它一些例子，让它生成其余的！\n 没有辛劳的测试。测试是任何强大的软件工程项目的骨干。导入单元测试包，让GitHub CopIlot建议符合实现代码的测试。\n 告诉我替代品。想评估一些不同的方法吗？ GitHub Copilot可以向您展示一个解决方案列表。使用所提供的代码或编辑以满足您的需求。\n 无论您是新的语言或框架，还是只是学习代码，Github Copilot都可以帮助您找到自己的方式。解决错误，或者学习如何使用新框架，而无需花费大部分时间都会通过文档剥夺或搜索网络。\n 数百名工程师，包括许多人，每天都在使用GitHub Copilot。它＆＃39;在他们工作的方式转变 - 这里他们所说的话：\n 试图通过Googling代码以不熟悉的语言代码一切都喜欢用短语浏览一个外国。使用github copilot就像雇用翻译。 \n它让我感到惊讶于它是如何准确理解我的评论和生成准确的建议。选择10个不同的建议的能力是顶部的樱桃。\n 在第一天，GitHub Copilot已经教会了JavaScript对象比较中的细微差别，并与我的数据库模式一样舒适。这是我见过的ml的最大思想吹嘘。\n 我＆＃39; M留下的Github Copilot如何完全了解我想要输入的内容。 GitHub CopIlot在在反应组件上工作时特别有用，在那里它令人生意的准确预测。 GitHub Copilot已成为我的程序员工具包的不可或缺的一部分。\n GitHub Copilot发现我在工作中的测试文件缺少特定测试并建议并为我写了测试。\n  GitHub CopIlot是AI对程序员，可帮助您更快地编写代码和更少的工作。 github copilot从评论和代码中绘制上下文，并立即建议单个线条和整个函数。 GitHub Copilot由Openai Codex提供动力，是由Openai创建的新AI系统。 GitHub CopIlot技术预览可作为Visual Studio代码扩展名可用。\n Openai Codex培训了公开的源代码和自然语言，因此它理解编程和人类。 GitHub Copilot Editor扩展将您的评论和代码发送到GitHub Copilot服务，然后使用Openai Codex来合成和建议单个线条和整个功能。\n 我们最近在开源repos中对一组Python函数进行了基准测试，该函数具有良好的测试覆盖范围。我们消失了函数体，并要求GitHub CopIlot填补它们。该模型在第一次尝试时43％的时间得到了43％，而57％的时间允许10次尝试。它一直都更聪明。 \n不可以。github copilot试图了解你的意图并生成它可以的最好的代码，但它表明的代码可能并不总是有效，甚至有意义。虽然我们正在努力使GitHub CopIlot更好地，但应仔细测试GitHub Copilot建议的代码，如任何其他代码一样仔细测试，审查和审核。作为开发人员，您总是负责。\n 将代码划分为小功能时，它最佳工作，使用有意义的名称参数，并根据您的方式写入好的文档和评论。当它帮助您导航不熟悉的库或框架时，它似乎也是最好的。\n github copilot在提出建议时使用当前文件作为上下文。它还没有将项目中的其他文件作为合成的输入。这意味着，例如，将类型声明复制/粘贴到您正在处理的文件中，可以改善GitHub Copilot的建议。这是我们将来会改善的事情。\n github copilot实际上并不测试它所暗示的代码，因此代码甚至可能无法编译或运行。 GitHub CopIlot只能持有非常有限的上下文，因此甚至剪切了超过几百行的单源文件，并且仅使用立即上下文。和GitHub Copilot可能会建议图书馆和语言的旧或已弃用的用途。您可以在任何地方使用代码，但您可以自行承担风险。\n 贡献的最佳方法是注册技术预览。通过使用GitHub CopIlot并共享您的反馈，您可以帮助改进电源GitHub Copilot的模型。\n 当然！请使用#githubcopilot当您发布时，我们可以看到您的产品！\n GitHub Copilot由Openai Codex提供动力，是由Openai创建的新AI系统。它已经接受了各种英语语言和源代码的培训，包括Github上的公共存储库中的代码。 \n培训机器在公开数据上学习模型现在是整个机器学习界的常见做法。模型从公共集体智能增强了洞察力和准确性。但这是一个新的空间，我们热衷于与这些主题的开发人员进行讨论，并在制定适当的培训AI模型方面的行业。\n 当第一次启动新平台或API时，开发人员最不熟悉它。还有很少使用的公共代码使用该API，并且机器学习模型不太可能在没有微调的情况下生成代码。在未来，我们将提供突出较新的API和样本的方法，以提高他们在Github Copilot的建议中的相关性。\n GitHub Copilot是代码合成器，而不是搜索引擎：绝大多数代码是唯一生成的，从未见过。我们发现约0.1％的时间，建议可能包含一些来自训练集的逐字的片段。以下是对模型的行为进行深入研究。当您不提供足够的上下文时（特别是在编辑空文件时）时，发生了许多这些情况，或者当存在常见的情况下，可能甚至是通用的，解决问题。我们正在构建原始跟踪器，以帮助检测从培训集重复的罕见代码实例，以帮助您对GitHub Copilot的建议提供良好的实时决策。\n 您负责在GitHub Copilot的帮助下创建的内容。我们建议您仔细测试，查看和验证代码，根据您自己写的任何代码。\n 不，虽然每个友好的机器人喜欢偶尔的谢谢，但你绝不有义务义务信用GitHub Copilot。\n 由于GitHub Copilot在公开可用的代码上培训，因此其培训集包括该代码中包含的公共个人数据。从我们的内部测试来看，我们发现它非常罕见，即Github Copilot建议包括从训练集中逐字的个人数据。在某些情况下，该模型将建议似乎是个人数据 - 电子邮件地址，电话号码，访问密钥等 - 但实际上是从训练数据中的模式合成的构成信息。对于技术预览，我们已经实施了一个基本的过滤器，该过滤器会在标准格式中显示时阻止电子邮件，但如果您努力努力，仍然可以提出这种内容。\n 世界上有很多具有不安全的编码模式，错误或对过时的API或习语的引用的公共代码。当GitHub Copilot基于此数据合成代码建议时，它还可以合成包含这些不期望的模式的代码。这是我们在GitHub的很多关于Github的事情，近年来我们提供了诸如操作，依赖和CodeQL等工具来开源项目，以帮助提高代码质量。同样，随着GitHub Copilot改进，我们将努力排除培训集中的不安全或低质量代码。当然，您应该始终使用GitHub CopIlot以及测试实践和安全工具以及您自己的判断。 \n技术预览包括筛选器来阻止攻击性词语，避免在敏感上下文中综合建议。由于底层技术的预发布性，GitHub Copilot有时可能产生不希望的输出，包括偏置，歧视，滥用或令人反感的产出。如果您看到冒犯性输出，请直接向CopIlot-safety@Github.com报告它们，以便我们可以改善我们的保障措施。 GitHub非常认真地提出这一挑战，我们致力于使用GitHub Copilot来解决它。\n 带入更智能的系统有可能对开发人员体验带来巨大的变化。我们预计这项技术将使现有工程师能够更加富有成效，减少手动任务，并帮助他们专注于有趣的工作。我们还认为GitHub Copilot有可能降低进入障碍，使更多人能够探索软件开发并加入下一代开发人员。\n 为了生成建议，Github CopIlot将您正在编辑的文件的一部分传输到服务。此上下文用于综合您的建议。 GitHub Copilot还记录了建议是否被接受或拒绝。此遥测用于改善AI系统的未来版本，以便GitHub Copilot将来可以为所有用户提供更好的建议。在未来，我们将为用户提供控制如何使用遥测的选项。有关我们使用遥测的更多信息可以在这里找到。\n 所有数据都被安全地发送和存储。对遥测的访问严格限于个人的必要性。检查收集的源代码将主要是自动的，当人类读取它时，它专门用于改善模型或检测滥用。\n 不可以。我们使用遥测数据，包括关于哪些建议用户接受或拒绝的信息，以改善模型。为其他用户生成代码时，我们不会引用您的私人代码。\n GitHub Copilot需要最先进的AI硬件。在技​​术预览期间，我们将GitHub Copilot提供给有限数量的测试人员。当我们推出商业产品时，我们将尽可能广泛地提供。\n 如果技术预览成功，我们的计划是在将来建立GitHub Copilot的商业版本。我们希望使用预览来了解人们如何使用GitHub Copilot以及在规模上运行它所需的内容。 \n还没有。 目前，我们专注于仅在Visual Studio代码中提供最佳体验。 ", "note_en": "With GitHub Copilot, get suggestions for whole lines or entire functions right inside your editor.\n   Trained on billions of lines of public code, GitHub Copilot puts the knowledge you need at your fingertips, saving you time and helping you stay focused.\n GitHub Copilot is available today as a Visual Studio Code extension. It works wherever Visual Studio Code works — on your machine or in the cloud on  GitHub Codespaces. And it’s fast enough to use as you type.\n GitHub Copilot works with a broad set of frameworks and languages. The technical preview does especially well for Python, JavaScript, TypeScript, Ruby, and Go, but it understands dozens of languages and can help you find your way around almost anything.\n With GitHub Copilot, you’re always in charge. You can cycle through alternative suggestions, choose which to accept or reject, and manually edit suggested code. GitHub Copilot adapts to the edits you make, matching your coding style.\n GitHub Copilot is powered by Codex, the new AI system created by OpenAI. GitHub Copilot understands significantly more context than most code assistants. So, whether it’s in a docstring, comment, function name, or the code itself, GitHub Copilot uses the context you’ve provided and synthesizes code to match. Together with OpenAI, we’re designing GitHub Copilot to get smarter at producing safe and effective code as developers use it.\n  Skip the docs and stop searching for examples. GitHub Copilot helps you stay focused right in your editor.\n Convert comments to code. Write a comment describing the logic you want, and let GitHub Copilot assemble the code for you.\n   Autofill for repetitive code. GitHub Copilot works great for quickly producing boilerplate and repetitive code patterns. Feed it a few examples and let it generate the rest!\n Tests without the toil. Tests are the backbone of any robust software engineering project. Import a unit test package, and let GitHub Copilot suggest tests that match your implementation code.\n Show me alternatives. Want to evaluate a few different approaches? GitHub Copilot can show you a list of solutions. Use the code as provided, or edit it to meet your needs.\n Whether you’re working in a new language or framework, or just learning to code, GitHub Copilot can help you find your way. Tackle a bug, or learn how to use a new framework without spending most of your time spelunking through the docs or searching the web.\n Hundreds of engineers, including many of our own, have been using GitHub Copilot every day. It&#39;s transformed the way they work – here&#39;s what they have to say:\n Trying to code in an unfamiliar language by googling everything is like navigating a foreign country with just a phrase book. Using GitHub Copilot is like hiring an interpreter.\n It surprised me with how precisely it understood my comment and generated accurate suggestions. The ability to choose from 10 different suggestions was the cherry on top.\n In the first day, GitHub Copilot already taught me about a nuance in Javascript object comparison and is as comfortable with our database schema as I am. This is the single most mind-blowing application of ML I’ve ever seen.\n I&#39;m impressed by how GitHub Copilot seems to know exactly what I want to type next. GitHub Copilot is particularly helpful when working on React components, where it makes eerily accurate predictions. GitHub Copilot has become an indispensable part of my programmer toolbelt.\n GitHub Copilot discovered that a test file I was working in was missing a specific test and suggested and wrote the test for me.\n  GitHub Copilot is an AI pair programmer that helps you write code faster and with less work. GitHub Copilot draws context from comments and code, and suggests individual lines and whole functions instantly. GitHub Copilot is powered by OpenAI Codex, a new AI system created by OpenAI. The GitHub Copilot technical preview is available as a Visual Studio Code extension.\n OpenAI Codex was trained on publicly available source code and natural language, so it understands both programming and human languages. The GitHub Copilot editor extension sends your comments and code to the GitHub Copilot service, which then uses OpenAI Codex to synthesize and suggest individual lines and whole functions.\n We recently benchmarked against a set of Python functions that have good test coverage in open source repos. We blanked out the function bodies and asked GitHub Copilot to fill them in. The model got this right 43% of the time on the first try, and 57% of the time when allowed 10 attempts. And it’s getting smarter all the time.\n No. GitHub Copilot tries to understand your intent and to generate the best code it can, but the code it suggests may not always work, or even make sense. While we are working hard to make GitHub Copilot better, code suggested by GitHub Copilot should be carefully tested, reviewed, and vetted, like any other code. As the developer, you are always in charge.\n It works best when you divide your code into small functions, use meaningful names for functions parameters, and write good docstrings and comments as you go. It also seems to do best when it’s helping you navigate unfamiliar libraries or frameworks.\n GitHub Copilot uses the current file as context when making its suggestions. It does not yet use other files in your project as inputs for synthesis. This means that, for example, copy/pasting a type declaration into the file you’re working on may improve suggestions from GitHub Copilot. This is something we will improve in the future.\n GitHub Copilot doesn’t actually test the code it suggests, so the code may not even compile or run. GitHub Copilot can only hold a very limited context, so even single source files longer than a few hundred lines are clipped and only the immediately preceding context is used. And GitHub Copilot may suggest old or deprecated uses of libraries and languages. You can use the code anywhere, but you do so at your own risk.\n The best way to contribute is to sign up for the technical preview. By using GitHub Copilot and sharing your feedback, you help to improve the models that power GitHub Copilot.\n Of course! Please use  #GitHubCopilot when you post so we can see what you produce!\n GitHub Copilot is powered by OpenAI Codex, a new AI system created by OpenAI. It has been trained on a selection of English language and source code from publicly available sources, including code in public repositories on GitHub.\n Training machine learning models on publicly available data is now common practice across the machine learning community. The models gain insight and accuracy from the public collective intelligence. But this is a new space, and we are keen to engage in a discussion with developers on these topics and lead the industry in setting appropriate standards for training AI models.\n When a new platform or API is launched for the first time, developers are the least familiar with it. There is also very little public code available that uses that API, and a machine learning model is unlikely to generate the code without fine tuning. In the future, we will provide ways to highlight newer APIs and samples to raise their relevance in GitHub Copilot’s suggestions.\n GitHub Copilot is a code synthesizer, not a search engine: the vast majority of the code that it suggests is uniquely generated and has never been seen before. We found that about 0.1% of the time, the suggestion may contain some snippets that are verbatim from the training set.  Here is an in-depth study on the model’s behavior. Many of these cases happen when you don’t provide sufficient context (in particular, when editing an empty file), or when there is a common, perhaps even universal, solution to the problem. We are building an origin tracker to help detect the rare instances of code that is repeated from the training set, to help you make good real-time decisions about GitHub Copilot’s suggestions.\n You are responsible for the content you create with the assistance of GitHub Copilot. We recommend that you carefully test, review, and vet the code, as you would with any code you write yourself.\n No. While every friendly robot likes the occasional word of thanks, you are in no way obligated to credit GitHub Copilot.\n Because GitHub Copilot was trained on publicly available code, its training set included public personal data included in that code. From our internal testing, we found it to be extremely rare that GitHub Copilot suggestions included personal data verbatim from the training set. In some cases, the model will suggest what appears to be personal data – email addresses, phone numbers, access keys, etc. – but is actually made-up information synthesized from patterns in training data. For the technical preview, we have implemented a rudimentary filter that blocks emails when shown in standard formats, but it’s still possible to get the model to suggest this sort of content if you try hard enough.\n There’s a lot of public code in the world with insecure coding patterns, bugs, or references to outdated APIs or idioms. When GitHub Copilot synthesizes code suggestions based on this data, it can also synthesize code that contains these undesirable patterns. This is something we care a lot about at GitHub, and in recent years we’ve provided tools such as Actions, Dependabot, and CodeQL to open source projects to help improve code quality. Similarly, as GitHub Copilot improves, we will work to exclude insecure or low-quality code from the training set. Of course, you should always use GitHub Copilot together with testing practices and security tools, as well as your own judgment.\n The technical preview includes filters to block offensive words and avoid synthesizing suggestions in sensitive contexts. Due to the pre-release nature of the underlying technology, GitHub Copilot may sometimes produce undesired outputs, including biased, discriminatory, abusive, or offensive outputs. If you see offensive outputs, please report them directly to  copilot-safety@github.com, so that we can improve our safeguards. GitHub takes this challenge very seriously and we are committed to addressing it with GitHub Copilot.\n Bringing in more intelligent systems has the potential to bring enormous change to the developer experience. We expect this technology will enable existing engineers to be more productive, reducing manual tasks and helping them focus on interesting work. We also believe that GitHub Copilot has the potential to lower barriers to entry, enabling more people to explore software development and join the next generation of developers.\n In order to generate suggestions, GitHub Copilot transmits part of the file you are editing to the service. This context is used to synthesize suggestions for you. GitHub Copilot also records whether the suggestions are accepted or rejected. This telemetry is used to improve future versions of the AI system, so that GitHub Copilot can make better suggestions for all users in the future. In the future we will give users the option to control how their telemetry is used. More information about our use of telemetry can be found  here.\n All data is transmitted and stored securely. Access to the telemetry is strictly limited to individuals on a need-to-know basis. Inspection of the gathered source code will be predominantly automatic, and when humans read it, it is specifically with the aim of improving the model or detecting abuse.\n No. We use telemetry data, including information about which suggestions users accept or reject, to improve the model. We do not reference your private code when generating code for other users.\n GitHub Copilot requires state-of-the-art AI hardware. During the technical preview, we are offering GitHub Copilot to a limited number of testers for free. When we launch a commercial product, we will make it available as broadly as possible.\n If the technical preview is successful, our plan is to build a commercial version of GitHub Copilot in the future. We want to use the preview to learn how people use GitHub Copilot and what it takes to operate it at scale.\n Not yet. For now, we’re focused on delivering the best experience in Visual Studio Code only.", "posttime": "2021-06-30 00:40:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,github,copilot,代码", "title": "github copilot：您的AI对程序员 ", "title_en": "GitHub Copilot: your AI pair programmer", "transed": 1, "url": "https://copilot.github.com/", "via": "", "real_tags": ["程序", "github", "copilot", "代码"]}, {"category": "", "categoryclass": "", "imagename": "dd10ba5660ee165b98cc47ffafc0c795.jpg", "infoid": 1068652, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "检察官星期一宣布，缅因州一名缅因州通过使用男孩的社会安全号码来获得账户和债务的账户和财产，欺诈地获得超过225,000美元的资金和财产。\n 美国司法部的新罕布什尔州地区办公室在一份新闻发布中表示，38岁的大卫凯恩队已向金属欺诈收费签订了一条内疚，并计划在10月份被判刑。\n 据称，Keene曾曾使用他已知的未成年人的社会安全号码，他在法庭文件和陈述中被称为John Doe。\n  律师的办公室表示，Doe的法律监护人报告了罗切斯特警察局的钦斯特·凯恩，据据称，2016年12月至2019年8月期间，据称将DOE的社会安全号码与“收购，”公用事业服务和几张信用卡。“\n 检察官还认为，记录显示Keene使用了Doe的社会安全号码，以获得购买雪地摩托车，摩托车和几辆汽车的贷款，包括购买BMW SUV的56,000美元以上。\n 根据律师的办公室的说法，当据称肯定使用社会安全号码开始时，DoE只有7岁。\n  代理美国律师John Farley在一份声明中说：“那些滥用社会安全号码的人犯下欺诈的人正在犯下严重的联邦犯罪。” \n“我们与我们的执法伙伴密切合作，以保护社会保障制度的诚信，并识别和起诉那些使用其他人身份犯下欺诈的人，”他补充说。  杰勒曼杰克，负责督察将军的波士顿办事处社会保障管理办公室的特殊代理人表示，Keene的有罪请求“展示了我们担任符合责任人的承诺，他们故意滥用他人的社会安全人数的个人获得。”  根据有关新闻界的说法，Keene的律师已同意一个三年的试用判决，其中18个月在家庭限制下作为辩诉协议的一部分。  该协议指出，虽然Keene已经开始偿还金钱，但他仍然欠102,000美元，AP报告。 ", "note_en": "Prosecutors announced Monday that a Maine man has pleaded guilty to fraudulently obtaining more than $225,000 in funds and property by using a boy’s Social Security number to obtain accounts and incur debt.\n The U.S. Attorney’s Office for the District of New Hampshire said in  a press release that 38-year-old David Keene had entered into a guilty plea to a wire fraud charge and is scheduled to be sentenced in October.\n Keene had allegedly used the Social Security number of a minor he had known, who is referred to in court documents and statements only as John Doe.\n  The attorney’s office said that Doe’s legal guardian had reported Keene to the  Rochester Police Department, with credit reports showing that between December 2016 and August 2019, several accounts were opened in which Keene allegedly used Doe’s Social Security number to “acquire, among other things, utility services and several credit cards.”\n Prosecutors also argued that records showed Keene had used Doe’s Social Security number to obtain loans to purchase a snowmobile, motorcycle and several cars, including more than $56,000 to purchase a BMW SUV.\n When Keene allegedly began using the Social Security number, Doe was only 7 years old, according to the attorney’s office.\n  Acting U.S. Attorney John Farley said in a statement, “Those who misuse Social Security numbers to commit fraud are committing a serious federal crime.”\n “We work closely with our law enforcement partners to protect the integrity of the Social Security system and to identify and prosecute those who use other people’s identities to commit fraud,” he added.\n   Jermaine Jack, acting special agent in charge of the Social Security Administration Office of the Inspector General’s Boston office, said that Keene’s guilty plea “demonstrates our commitment to hold accountable those who intentionally misuse the Social Security numbers of others for their own personal gain.”\n According to  The Associated Press, Keene’s lawyers have agreed to a three-year probation sentence with 18 months under home confinement as part of the plea deal.\n The agreement noted that while Keene has started paying back the money, he still owes roughly $102,000, the AP reported.", "posttime": "2021-06-30 00:40:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "号码,number,keene", "title": "缅因文使用男孩的社会安全号码在欺诈中筹集超过225美元 ", "title_en": "Maine man used boy's Social Security number to commit more than $225K in fraud", "transed": 1, "url": "https://thehill.com/homenews/state-watch/560699-maine-man-used-boys-social-security-number-to-commit-more-than-225k-in", "via": "", "real_tags": ["号码", "number", "keene"]}, {"category": "", "categoryclass": "", "imagename": "07e1a87f1755f9a72a064ac67cb5d592.jpg", "infoid": 1068651, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本系列中的前一集中，我开始使用设置NZCV标志的指令来控制如何控制流，然后是标签的条件分支。给出的示例是最简单的，如果是......否则，如果...语句或小型交换机语句。可以在图中概括：\n  本文介绍了查看其他主要的控制类型，条件循环。\n 虽然条件循环可以使用像SWIFT这样的高级语言以几种不同的方式编写，但是有两个基本模式，具体取决于测试是否在循环的头部或尾部进行。\n  在SWIFT中，最广泛使用的循环形式，测试是否在尾部满足条件是for语句：用于索引在1 ... 100 {}中\n ARM64汇编语言中的典型实现可能首先设置包含开始索引值和结束索引的寄存器，然后在循环中执行代码，递增索引值，并测试它是否仍然小于或等于最终索引。如果它确实，然后分支回循环再次执行它;如果没有，则继续使用以下操作。\n 以下是索引存储在寄存器x5中的示例，以及x4：mov x5，＃1 // start index = 1 mov x4，＃100 // endex = 100 for_loop：//执行所需的索引在循环// ...添加x5，x5，＃1 //递增1 cmp x5，x4 //检查是否已达到终端索引B.Le for_loop //，如果index＆lt; = end index，循环回/ /下一个循环后的代码\n  修改为计算下降的变体，这很简单，例如，通过将索引从上限递减直到达到下限。 \n在Swift中，一种常见的循环形式，其在头部使用的是：而x＆lt; 100 {}\n ARM64汇编语言中的典型实现可能首先设置包含X和最终限制的初始值的寄存器，然后检查x是否已达到该终端值。如果它有，则在循环后分支到下一个代码。否则执行循环代码并在执行无条件循环回到起始测试并再次通过循环之前递增X值。\n 这是一个例子，其中x值存储在寄存器x5中，x4：mov x5，＃1 // start值= 1 mov x4，＃100 // end值= 100 wher_loop：cmp x5，x4 / /检查是否已达到终端值B.gehing and_done //如果值＆gt;终端值，结束循环//执行循环中所需的内容// ...添加x5，x5，＃1 //增量值（或在终止中所需的任何东西）b with_loop //无条件循环返回white_done：// next循环后的代码\n  经典示例的迭代通过返回空终止的ASCII字符串中的每个字节字符迭代。\n 在SWIFT中，这可能被称为：VAR输出：[CCHAR] =阵列（重复：0，count：255）让S：String =＆＃34;样本字符串＆＃34; ascii_copy（s，＆amp;输出）调用：extern int ascii_copy的c头（const char *，char *）;\n 注册用法遵循：// x1  - 输出字符串的地址// x0  - 输入字符串的地址/// x4  - 长度计算的原始输出字符串。 // W5  - 正在处理的当前字符和汇编代码是：_ascii_copy：mov x4，x1 //循环，直到x1指向的字节是非零环：ldrb w5，[x0]，＃1 //加载ASCII字符和递增指针//使用W5 STRB W5，[x1]，＃1 //存储字符到输出str cmp w5，＃0 //停止击中空字符B.NE循环//循环如果字符ISN＆＃39; t null sub x0，x1，x4 //通过减去read //返回呼叫者来获得长度\n  可以使用设置NZCV标志的指令来实现控制传输语句，如继续，中断，返回和抛出，然后是一个条件分支，例如循环：// do cmp x5，x4 //比较两个寄存器b.gt break_loop //突破循环// do其他内容b循环//重复循环break_loop：//断开循环并继续下一个代码 \n这些成语中的所有四个都在当今的撕裂PDF中收集：ARMControlflow1\n 在下一篇文章中，我将开始查看一些常见的通用注册说明。\n 上面的示例ASCII字符串代码是基于以下修改代码的Alexander VON，以伴随斯蒂芬史密斯的书。\n  1：构建一个应用程序以开发装配例程，包括解释从SWIFT调用汇编语言，完整的Xcode项目2：寄存器解释3：使用指针4：控制流程\n    手术呼叫标准用于ARM 64位架构（ARM）从GitHub写作ARM64代码用于Apple平台（Apple）Stephen Smith（2020）用64位ARM汇编语言编程，APRess，ISBN 978 1 4842 5880 4. Daniel Kusswurm（ 2020）现代ARM汇编语言编程，APRess，ISBN 978 1 4842 6266 5. ARM64指令集参考（ARM）。\n  发布在Mac，技术和标记的Apple硅，臂，汇编器，汇编语言，M1，Xcode。书签永久链接。 ", "note_en": "In  the previous episode in this series, I started to look at how to control flow using an instruction which sets the NZCV flags, followed by a conditional branch to a label. The example given there is among the simplest, a series of  if … else if … statements or a small  switch statement. That can be summarised in the diagram:\n  This article moves on to look at the other main type of control, conditional loops.\n Although conditional loops can be written in several different ways using high-level languages like Swift, there are two basic patterns, depending on whether the test is made in the head or tail of the loop.\n  In Swift, the most widely used form of loop which tests whether the condition is met in the tail is the  for statement:  for index in 1...100 { }\n A typical implementation in ARM64 assembly language might start by setting up registers containing the start index value and the end index, then perform the code in the loop, incrementing the index value, and testing whether it remains less than or equal to the end index. If it does, then branch back to the loop to perform it again; if it doesn’t, then continue with the following operations.\n Here’s an example in which the index is stored in register X5, and the maximum index in X4:  \tMOV\tX5, #1 // start index = 1 MOV X4, #100 // end index = 100 for_loop:\t// do what you need in the loop // … ADD\tX5, X5, #1 // increment the index by 1 CMP\tX5, X4 // check whether end index has been reached B.LE for_loop // if index &lt;= end index, loop back // next code after loop\n  It’s simple to modify that for variants which count down, for example, by decrementing the index from an upper limit until it reaches the lower limit.\n  In Swift, a common form of loop which performs testing at the head uses  while:  while x &lt; 100 { }\n A typical implementation in ARM64 assembly language might start by setting up registers containing the initial value of x and the end limit, then check whether x has reached that end value. If it has, then branch to the next code after the loop. Otherwise perform the loop code and increment the x value before performing an unconditional loop back to the starting test and passing through the loop again.\n Here’s an example in which the x value is stored in register X5, and the end value in X4:  \tMOV\tX5, #1 // start value = 1 MOV X4, #100 // end value = 100 while_loop:\tCMP\tX5, X4 // check whether end value has been reached B.GE\t\twhile_done // if value &gt; end value, end loop // do what you need to in the loop // … ADD X5, X5, #1 // increment value (or whatever needed to progress towards termination) B\twhile_loop // unconditional loop back while_done: // next code after loop\n  A classic example of that is iterating through each of the single-byte characters in a null-terminated ASCII string.\n In Swift, this might be called as:  var output: [CChar] = Array(repeating: 0, count: 255) let s: String = &#34;Sample string&#34; ascii_copy(s, &amp;output) which calls the C header of:  extern int ascii_copy(const char *, char *);\n Register usage follows:  // X1 - address of output string // X0 - address of input string // X4 - original output string for length calc. // W5 - current character being processed and the assembly code is:  _ascii_copy:\tMOV \tX4, X1 // loop until the byte pointed to by X1 is non-zero loop:\tLDRB\t\tW5, [X0], #1 // load ASCII character and increment pointer // do whatever you need to the character in W5 STRB\t\tW5, [X1], #1 // store character to output str CMP\t\tW5, #0 // stop on hitting a null character B.NE\t\tloop // loop if character isn&#39;t null SUB\t\tX0, X1, X4 // get the length by subtracting the pointers RET\t\t// Return to caller\n  Control transfer statements such as  continue, break, return and  throw can be implemented using an instruction which sets the NZCV flags, then a conditional branch, such as  loop: // do things CMP\tX5, X4 // compare the two registers B.GT break_loop // break out of loop // do other things B\tloop // repeat loop break_loop:\t// break out of loop and continue with next code\n  All four of these idioms are collected together in today’s tear-out PDF:  ARMcontrolflow1\n In the next article, I’ll start looking at some common general-purpose register instructions.\n The example ASCII string code above is based on Alexander von Below’s modified code to accompany Stephen Smith’s book.\n  1: Building an app to develop assembly routines, including an explanation of calling assembly language from Swift, with a complete Xcode project  2: Registers explained  3: Working with pointers  4: Controlling flow\n    Procedure Call Standard for the Arm 64-bit Architecture (ARM) from  Github  Writing ARM64 Code for Apple Platforms (Apple) Stephen Smith (2020)  Programming with 64-Bit ARM Assembly Language, Apress, ISBN 978 1 4842 5880 4. Daniel Kusswurm (2020)  Modern Arm Assembly Language Programming, Apress, ISBN 978 1 4842 6266 5.  ARM64 Instruction Set Reference (ARM).\n  Posted in  Macs,  Technology and tagged  Apple silicon,  ARM,  assembler,  assembly language,  M1,  Xcode. Bookmark the  permalink.", "posttime": "2021-06-30 00:39:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,条件,arm,循环", "title": "ARM组件中的代码：条件循环 ", "title_en": "Code in ARM Assembly: Conditional Loops", "transed": 1, "url": "https://eclecticlight.co/2021/06/29/code-in-arm-assembly-conditional-loops/", "via": "", "real_tags": ["代码", "条件", "arm", "循环"]}, {"category": "", "categoryclass": "", "imagename": "82a97e1df33f144e6b8c1a7c595d2577.jpg", "infoid": 1068650, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索，也被称为大海豹错误，是第一个封面听力设备（或＆＃34; bug＆＃34;）使用被动技术来传输音频信号。它在1945年8月4日，美国大使苏联到W.Verell Harriman提供的礼物内容。因为它是被动的，需要来自外部来源的电磁能量，以发动和活跃，它被认为是射频识别（RFID）技术的前身。 [1] [2] [3]\n   这件事是由苏联俄罗斯发明人LéonTheremin设计的，为他的发明发明，电子乐器最为熟悉。\n  苏联人使用嵌入式雕刻在美国的雕刻木质斑块的装置，苏联人窥探美国。 1945年8月4日，第二次世界大战结束前几周，苏联年轻先锋组织的代表团向哈里曼大使雕刻雕刻，作为A＆＃34;友谊的姿态＆＃34;到苏联＆＃39;战争盟友。它在大使和＃39;莫斯科居民学习中挂了七年，直到1952年在1952年在大使乔治·肯纳的任期内暴露。 [5]\n   该物品由连接到小四分之一波长天线的微小电容膜组成;它没有电源或有源电子元件。仅当从外部发射器发送到设备的正确频率的无线电信号时，该器件是无源腔谐振器。在NSA Parlance中称为＆＃34;照明＆＃34;无源设备。声波（来自大使和＃39内的声音）通过薄薄的木箱，撞击膜并导致它振动。膜的运动变化了电容＆＃34;看到＆＃34;由天线，其又调制了击中的无线电波并且被物质重新传输。接收器解调信号，使得可以听到麦克风拾取的声音，就像普通的无线电接收器解调无线电信号并输出​​声音一样。\n Theremin＆＃39; S设计使听力装置非常难以检测，因为它非常小，没有电源或有源电子元件，并且除非它积极照射远程照射，否则没有辐射任何信号。这些相同的设计功能以及设备的整体简单性，使其非常可靠，并给予了可能无限的操作寿命。\n  该装置包括9英寸长（23厘米）单极天线（四分之一波，用于330兆赫兹[MHz]频率，但它也能够充当半波[以660 MHz]或全波[AT 1320 MHz];账户有所不同。鉴于当时的无线电技术，330 MHz的频率很可能）。它使用直线杆，通过将绝缘衬套引入腔，其中它终止于形成电容器的一个板的圆盘。腔是高Q圆形镀银铜＆＃34;罐子＆＃34;，内径为0.775英寸（19.7毫米）和约11/16英寸（17.5毫米）长，具有约10纳霍亨的电感。 [7]其前侧用非常薄的（3密耳或75微米）和脆弱的导电膜关闭。在腔的中间是一个蘑菇形的平面调谐柱，其顶部可调，使得可以设定膜后距离;膜和柱形成可变电容器作用作用作为冷凝器麦克风并提供振幅调制（AM），具有用于重新辐射信号的寄生频率调制（FM）。该柱子将机加工槽和径向线进入其面部，可能提供用于空气流动的通道，以减少膜的气动阻尼。天线通过其盘形端电容地连接到柱。包括天线在内的单位的总重量为1.1盎司（31克）。\n 设计天线的长度和腔的尺寸以使重新广播信号成为照明频率更高的谐波。 \n原装设备位于鹰的喙下方的鹰喙上呈现给W.Verell Harriman（见下文）;账户是否有所不同，是否孔钻入喙，以允许声波到达膜。其他消息人士称，喙后面的木材毫不漂亮，但足够薄的是通过声音，或者空洞的空间用作声音板，将声音从房间集中在麦克风上。\n  在英国大使馆的英国无线电运营商中，在1951年，在英国大使馆上无意中发现了这个错误的存在，他在苏维埃在大使＆＃39; S Office＆＃39; s办公室的广播无线电流量渠道上无人知的美国对话。 [9]美国国务院员工能够使用具有简单二极管检测器/解调器的未经过的宽带接收器来再现结果，[10]类似于一些场强仪表。\n 1951年3月，两个额外的国务院雇员John W. Ford和Joseph Bezjian派往莫斯科，调查英国和加拿大大使馆建筑物的其他疑似虫子。他们进行了技术监测柜台＆＃34;扫掠＆＃34;大使和＃39; S Office，在设置音频反馈的设置中使用信号发生器和接收器，如果房间的声音在给定频率上传输。在这次扫描期间，Bezjian发现了雕刻雕刻中的装置。 [10]：2\n 联邦调查局即将分析设备，并聘请来自英国马可尼公司的人们帮助分析。 Marconi Technician Peter Wright，英国科学家和后来的MI5违反官员，训练了调查。 [10]他能够以800 MHz的照明频率可靠地完成工作。已经发现该设备的发电机被调整为1800 MHz。\n 事情的膜极薄，在美国人处理过程中受损;赖特不得不取代它。\n 设备的简单性在分析过程中引起了一些初始混淆;除了其主要一个之外，天线和谐振器还具有若干谐振频率，并且调制部分是幅度调制和频率调制。该团队在假设膜与调谐柱之间需要增加以增加共振时，该团队也丢失了一些时间。\n  Wright＆＃39;考试导致了一个类似的英国系统代号，在整个20世纪50年代使用的英国人，美国人，加拿大人和澳大利亚人使用。 \n还有后面的装置模型，一些内部结构更复杂（中心柱在膜上连接到螺旋下，可能增加Q）。最大化Q系数是工程优先级之一，因为这使得对照明信号频率的选择性更高，因此更高的操作距离以及更高的声学灵敏度。 [10]\n CIA在荷兰Noordwijk的荷兰雷达实验室（NRP）中的秘密研究计划于1954年到大约1967年，根据具有探测器二极管和小型麦克风放大器的偶极天线创建自己的隐蔽聆听设备。该器件是在简单的椅子研究合同下开发的[11]，并且被称为简单的椅子标记I（1955），Mark II（1956），Mark III（1958），Mark IV（1961）和Mark V（1962）。 [12]尽管最初他们无法获得谐振腔话可以可靠地工作，但由于研究，为中央情报局开发了几种涉及被动元素（PES）的产品。 1965年，NRP终于得到了一个可靠的脉冲腔谐振器，但到那时CIA不再对被动装置感兴趣，主要是因为所涉及的高水平的RF能量。 [13]\n 1960年5月，在联合国安全理事会的第四天会议上提到了这件事，由苏联于1960年的U-2事件召开，美国间谍飞机已进入其领土并被击中。美国大使Henry Cabot Lodge Jr.展示了巨大的印章中的嗡嗡声装置，以说明两国之间的间谍事件是相互的，并且据称Nikita Khrushchev将这一特殊事件放大作为中止1960年巴黎峰会的借口。 [14] [15]\n    ^ hacking暴露的Linux：Linux安全秘密＆amp;解决方案（第三编辑）。麦格劳山奥斯本媒体。 2008. p。 298. ISBN 978-0-07-226257-5。\n ^ Harford，蒂姆（2019年8月21日）。 ＆＃34;我们所有使用的冷战间谍技术＆＃34;英国广播公司的新闻 。\n   ^乔治F. Kennan，Memoirs，1950-1963，第II卷（Little，Brown＆amp; Co.，1972），PP。155,156\n ^ Poorglove，S. David（1966年）。 ＆＃34;伟大的海豹虫＆＃34;电子设计。海登出版公司。 14（14-17）：35。 \n^棕色（？），罗伯特。 M.（1967）。 ＆＃34;电子烟檐＆＃34。 电子世界。 Ziff-Davis出版公司。 77（3-6）：23。  ^ a b c d murray，凯文。 ＆＃34;伟大的海豹虫子故事＆＃34。 违反责任。 违反责任。 2020年12月12日从原件存档。  ^联合国安全理事会Verbatim报告860. S / PV.860 Page 15. 1960年5月26日。检索2008-08-29。  ^ Maurits Martijn（2015年9月24日）。 ＆＃34;操作扶手椅：一家小型荷兰公司如何帮助CIA听俄罗斯人和＃34; （在荷兰）。 通讯员。  苏联如何在美国大使馆举办7年，哈克达，亚当法比奥，2015年12月 ", "note_en": "Jump to navigation  Jump to search  The Thing, also known as  the Great Seal bug, was one of the first  covert listening devices (or &#34;bugs&#34;) to use passive techniques to transmit an audio signal. It was concealed inside a gift given by the  Soviet Union to  W. Averell Harriman, the  United States Ambassador to the Soviet Union, on August 4, 1945. Because it was passive, needing electromagnetic energy from an outside source to become energized and active, it is considered a predecessor of radio-frequency identification ( RFID) technology.  [1]  [2]  [3]\n   The Thing was designed by Soviet Russian inventor  Léon Theremin,  [4] best-known for his invention of the  theremin, an electronic musical instrument.\n  The device, embedded in a carved wooden plaque of the  Great Seal of the United States, was used by the Soviets to spy on the US. On August 4, 1945, several weeks before the end of  World War II, a delegation from the  Young Pioneer organization of the Soviet Union presented the bugged carving to Ambassador Harriman, as a &#34;gesture of friendship&#34; to the Soviet Union&#39;s  war ally. It hung in the ambassador&#39;s  Moscow residential study for seven years, until it was exposed in 1952 during the tenure of Ambassador  George F. Kennan.  [5]\n   The Thing consisted of a tiny capacitive membrane connected to a small  quarter-wavelength  antenna; it had no power supply or  active electronic components. The device, a passive  cavity resonator, became active only when a  radio signal of the correct frequency was sent to the device from an external transmitter. This is referred to in NSA parlance as &#34;illuminating&#34; a passive device. Sound waves (from voices inside the ambassador&#39;s office) passed through the thin wood case, striking the membrane and causing it to vibrate. The movement of the membrane varied the  capacitance &#34;seen&#34; by the antenna, which in turn  modulated the radio waves that struck and were re-transmitted by the Thing. A receiver  demodulated the signal so that sound picked up by the microphone could be heard, just as an ordinary radio receiver demodulates radio signals and outputs sound.\n Theremin&#39;s design made the listening device very difficult to detect, because it was very small, had no power supply or active electronic components, and did not radiate any signal unless it was actively being irradiated remotely. These same design features, along with the overall simplicity of the device, made it very reliable and gave it a potentially unlimited operational life.\n  The device consisted of a 9-inch-long (23 cm)  monopole antenna (quarter-wave for 330  megahertz [MHz] frequencies, but it was also able to act as half-wave [at 660 MHz] or full-wave [at 1320 MHz]; the accounts differ. Given the radio technology of the time, the frequency of  330 MHz is most likely).  [6] It used a straight rod, led through an insulating bushing into a cavity, where it was terminated with a round disc that formed one plate of a capacitor. The cavity was a  high-Q round silver-plated copper &#34;can&#34;, with the internal diameter of 0.775 in (19.7 mm) and about 11/16 in (17.5 mm) long, with  inductance of about 10  nanohenry.  [7] Its front side was closed with a very thin (3  mil, or 75 micrometers) and fragile conductive membrane. In the middle of the cavity was a mushroom-shaped flat-faced tuning post, with its top adjustable to make it possible to set the membrane-post distance; the membrane and the post formed a variable capacitor acting as a  condenser microphone and providing  amplitude modulation (AM), with parasitic  frequency modulation (FM) for the re-radiated signal. The post had machined grooves and radial lines into its face, probably to provide channels for air flow to reduce pneumatic damping of the membrane. The antenna was capacitively coupled to the post via its disc-shaped end. The total weight of the unit, including the antenna, was 1.1 ounces (31 grams).\n The length of the antenna and the dimensions of the cavity were engineered in order to make the re-broadcast signal a higher  harmonic of the illuminating frequency.\n The original device was located with the can under the beak of the eagle on the Great Seal presented to W. Averell Harriman (see below); accounts differ on whether holes were drilled into the beak to allow sound waves to reach the membrane. Other sources say the wood behind the beak was undrilled but thin enough to pass the sound, or that the hollowed space acted like a  soundboard to concentrate the sound from the room onto the microphone.\n  The existence of the bug was discovered accidentally in 1951 by a British radio operator at the British embassy who overheard American conversations on an open radio Soviet air force radio traffic channel as the Soviets were beaming radio waves at the ambassador&#39;s office.  [9] An American State Department employee was then able to reproduce the results using an untuned wideband receiver with a simple diode detector/demodulator,  [10] similar to some field strength meters.\n Two additional State Department employees, John W. Ford and Joseph Bezjian, were sent to Moscow in March 1951 to investigate this and other suspected bugs in the British and Canadian embassy buildings. They conducted a  technical surveillance counter-measures &#34;sweep&#34; of the ambassador&#39;s office, using a  signal generator and a receiver in a setup that generates  audio feedback (&#34;howl&#34;) if the sound from the room is transmitted on a given frequency. During this sweep, Bezjian found the device in the Great Seal carving.  [10] : 2\n The  Federal Bureau of Investigation set about to analyze the device, and hired people from the British  Marconi Company to help with the analysis. Marconi technician  Peter Wright, a British scientist and later  MI5  counterintelligence officer, ran the investigation.  [10] He was able to get The Thing working reliably with an illuminating frequency of 800 MHz. The generator which had discovered the device was tuned to 1800 MHz.\n The membrane of the Thing was extremely thin, and was damaged during handling by the Americans; Wright had to replace it.\n The simplicity of the device caused some initial confusion during its analysis; the antenna and resonator had several resonant frequencies in addition to its main one, and the modulation was partially both amplitude modulated and frequency modulated. The team also lost some time on an assumption that the distance between the membrane and the tuning post needed to be increased to increase resonance.\n  Wright&#39;s examination led to development of a similar British system codenamed SATYR, used throughout the 1950s by the British, Americans, Canadians and Australians.\n There were later models of the device, some with more complex internal structure (the center post under the membrane attached to a helix, probably to increase  Q). Maximizing the Q-factor was one of the engineering priorities, as this allowed higher selectivity to the illuminating signal frequency, and therefore higher operating distance and also higher acoustic sensitivity.  [10]\n The  CIA ran a secret research program at the Dutch Radar Laboratory (NRP) in  Noordwijk in the  Netherlands from 1954 to approximately 1967 to create its own covert listening devices based on a  dipole antenna with a  detector diode and a small microphone amplifier. The devices were developed under the  Easy Chair research contract  [11] and were known as Easy Chair Mark I (1955), Mark II (1956), Mark III (1958), Mark IV (1961) and Mark V (1962).  [12] Although initially they could not get the resonant cavity microphone to work reliably, several products involving Passive Elements (PEs) were developed for the CIA as a result of the research. In 1965, the NRP finally got a reliably working pulsed cavity resonator, but by that time the CIA was no longer interested in passive devices, largely because of the high levels of RF energy involved.  [13]\n In May 1960, The Thing was mentioned on the fourth day of meetings in the  United Nations Security Council, convened by the Soviet Union over the  1960 U-2 incident where a U.S. spy plane had entered their territory and been shot down. The U.S. ambassador  Henry Cabot Lodge Jr. showed off the bugging device in the Great Seal to illustrate that spying incidents between the two nations were mutual and to allege that  Nikita Khrushchev had magnified this particular incident as a pretext to abort the  1960 Paris Summit.  [14]  [15]\n    ^      Hacking Exposed Linux: Linux Security Secrets &amp; Solutions (third ed.). McGraw-Hill Osborne Media. 2008. p.  298.  ISBN   978-0-07-226257-5.\n ^    Harford, Tim (21 August 2019).  &#34;The Cold War spy technology which we all use&#34;. BBC News .\n   ^  George F. Kennan, Memoirs, 1950–1963, Volume II (Little, Brown &amp; Co., 1972), pp. 155, 156\n ^    Pursglove, S. David (1966).  &#34;Great Seal Bug&#34;.  Electronic Design. Hayden Publishing Company.  14 (14–17): 35 .\n ^    Brown(?), Robert. M. (1967).  &#34;Electronic Eavesdroping&#34;.  Electronics World.  Ziff-Davis Publishing Company.  77 (3–6): 23 .\n   ^     a     b     c     d    Murray, Kevin.  &#34;THE GREAT SEAL BUG STORY&#34;.  CounterEspionage. counterespionage.com. Archived from  the original on December 12, 2020 .\n    ^   United Nations Security Council  Verbatim Report  860.   S/PV.860 page 15. 26 May 1960. Retrieved 2008-08-29.\n ^    Maurits Martijn (24 September 2015).  &#34;Operatie Leunstoel: hoe een klein Nederlands bedrijf de CIA hielp om de Russen af te luisteren&#34; (in Dutch). De Correspondent.\n     How the Soviet Union spied on the US embassy for 7 years, Hackaday, Adam Fabio, December 2015", "posttime": "2021-06-30 00:39:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "听力,listening,设备", "title": "事情（听力设备） ", "title_en": "The Thing (Listening Device)", "transed": 1, "url": "https://en.wikipedia.org/wiki/The_Thing_(listening_device)", "via": "", "real_tags": ["听力", "listening", "设备"]}, {"category": "", "categoryclass": "", "imagename": "fd052027e7ca54e52026111560cb9809.jpg", "infoid": 1068649, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么全国各地的人太害怕公开承认，他们认为罗宾D'Angelo的“白脆”是胡说八道吗？或者IBRAM KENDI的“抗拉科主义”版本是来自种族主义的解释的最远的东西？为什么这么多害怕支持以色列存在的权利？甚至谴责抗梗阻？或捍卫那些不公平地诽谤上述任何人的人？\n   当批判理论取代批判性思维时，它侵蚀道德，降低护理，并创造敌对环境。最近对斯坦福大学的诉讼说明了如何。\n 关于不平等，歧视，偏见和正义的合法担忧是普遍的，并且有很多方法可以解决这些问题。无论有人对上述命题的思考，没有人应该担心表达他们。但是，在美国享受的自由表达文化是通过综合，邪教的思想改变了，这具有几乎魔法能力，以创造流行的解释不受欢迎，以贬低。它似乎在各个领域施放了一个隐喻的咒语，包括教育，媒体，新闻，技术，甚至心理治疗和精神病学。\n  建立现在的流行术语“醒来”，我来电这个意识形态，W okecraft。我使用一个咒语的隐喻，因为信徒是依赖逻辑，理性和科学的领域的人，但仍然似乎无法看到许多沃科夫＆＃39;包括种族主义和抗拉科主义的新定义 - 是太敬的而且其许多基本概念（例如白脆性，白色特权和微不足道）是不合体的。\n  科学要求其术语具有线性定义及其房屋才能伪造 - 换句话说，必须有条件，其中一个命题可以证明错误。另一方面，思想楼宇不需要伪造性。例如，秃发被定义为全部或部分缺乏头发的头皮。一个人是秃头的逻辑命题可以通过头发的头部存在伪造（经过验证的错误）。另一方面，意识形态可能将秃头重新定义为“关于产生和正常化秃头的秃头的想法”。信徒可能声称所有的头都是秃头，无论有长豪华的头发。事实上，头发可能是拒绝接受一个＆＃39的秃头的证据。\n  尽管有不合理的命题，凭借认知扭曲的沃科夫，正在进入心理科学和临床实践。这是腐败的能力和侵蚀职业道德。\n 例如，在2018年，APA制作了它的第一组“与男子和男子的心理实践指南”，其中讨厌“传统阳刚地”是“有害的”。 APA后来澄清说，所谓的伤害是由“极端陈规定型行为”产生的危害。但这仅说明了这个命题的不明性性质。 （“传统男性气质”如何以及何时以及“极端陈规定型行为”的定义？） \n更糟糕的是，指导方针呼吁临床医生在他们的男性客户中发展“对[男性]特权的认识以及维持父权制权力的信仰和行为的有害影响。”我争辩说，这不仅是这种反驳 - 因为客户需要相信他们的会议不会致力于他们的治疗师的意识形态 - 但是指导方针违反了APA自己的道德要求，包括临床心理学家“尊重尊严和价值所有人“并尊重每个人的”自决权“。\n  现在斯坦福大学的咨询和心理服务（帽子）来自Wokecraft＆＃39; s咒语。当CAPS发起多样性，公平和纳入程序时，白脆性是所选的书籍，人员被隔离成“亲和力组”，每个人都分别举行了。那些不适合沃科夫的人＆＃39;如果无论是被识别为“白色”或感受到的那样，那些不适合沃科夫的非白色类别所需的非白色类别“亲和力。”\n   犹太精神科医生罗恩·阿尔布凯尔，MD和犹太心理治疗师和饮食障碍专家Shilea Levin推回，但是与反义石头（犹太人）遇到了犹太人，凭借他们的财富和特权，躲在他们的“白色”身份后面。\n 在包括种族主义和反义的图像中包含的zoombombing之后，Albucher和Levin被告知只有种族主义，而不是反犹太主义值得来。当奥尔福彻们拒绝概念时，在这些会议中不应讨论反犹太主义，工作人员指责他成为一个“白色特权”的人，试图从反黑色种族主义中拉焦点。即使校园内出现反义石英涂鸦，他们的讨论抗溃疡的要求也被否认。\n  对于对Diangelo的争论表示担忧，希望讨论一个人的祖先的斗争为种族主义做出贡献，并且是白脆弱性的证据，Levin被标记为“犹太人，白人，即巨大的特权和权力”，他允许她“脆弱”来防止她从“真正的自我反思”。\n  莱文的两个大屠杀幸存者的孩子对被剥夺了自己的权利的经验具有强烈而消极的反应。在20世纪，由于非犹太人被强制被归类为非白色，“我的人民被谋杀，因为我们被视为白人种族的污染物，”她说。在21世纪，当白人时，现在是道德污染的类别，斯坦福的非犹太人被强制地分类为白色。\n  与此同时，反犹太主义情绪和反犹太人的仇恨犯罪增加，而不是斯坦福精神卫生专业人员，而不是准备对待犹太学生争取这种现实的犹太学生，他们正在接受培训，如何使其延续。 \nAlbucher和Levin找到了私人支持，但没有人愿意公开发言。取消文化，伟大的执法者，做了工作。\n  “取消文化”的批评者常常注意到很少有人真正取消。然而，真正的问题是文化。也许一个更准确的描述符是一种不当影响的文化。\n 美国医学协会的道德规范要求医疗专业人员不要使用不当影响。具体而言，他们不得迫使同事们参与宣传活动，不应惩罚同事，公然或隐瞒，以便决定不参加。 Levin和Albucher发生了什么，似乎是对该标准的明确违反 - 更不用说违反上述APA道德标准。\n  莱佛士和阿尔布彻师都通知了人力资源，但DEI计划的反义石头只会恶化，最终明确断言“犹太人与白色至上”。经过一年多的一个不受欢迎和敌对的气候，Levin和Albucher终于为斯坦福提出了民权案件。\n  斯坦福州＆＃39; S咨询中心可能导致包装违反其道德义务，但它远离单独的伦理义务。直到不当影响的文化结束或足够的人打破沃科夫的咒语 - 并愿意遭受演讲的后果 - 我们可能会看到精神病学和精神病素质的持续下降以​​及持续的专业腐败腐败伦理。 ♦ ", "note_en": "Why are people across the country too afraid to publicly admit that they think Robin D’Angelo’s “ white fragility” is nonsense? Or that Ibram Kendi’s version of “ antiracism” is the farthest thing from an antidote to racism? Why are so many afraid to support Israel’s right to exist? Or even condemn antisemitism? Or defend those who are unfairly maligned for doing any of the above?\n   When critical theory replaces critical thinking, it erodes  ethics, degrades care, and creates a hostile environment. A recent lawsuit against Stanford University illustrates how.\n Legitimate concerns about inequality,  discrimination, bigotry, and justice, are widespread, and there are many ways to address those concerns. Regardless of what anyone thinks about the above propositions, no one should  fear expressing them. But the culture of free expression once enjoyed in the U.S. has been transformed by a totalizing, cult-like ideology that has an almost magical ability to create popular interpretations impervious to disconfirmation. It appears to have cast a metaphorical spell over various fields, including  education, media, journalism, technology, and even  psychotherapy and psychiatry.\n  Building on the now-popular term “woke,” I have come to call this ideology, w okecraft. I use the metaphor of a spell because among believers are people in fields that rely on logic, reason, and science but who nonetheless appear unable to see that many of wokecraft&#39;s definitions — including new definitions of    racism and  antiracism — are tautological, and many of its foundational concepts (such as  white fragility,  white privilege, and   microaggressions) are unfalsifiable.\n  Science requires its terms to have linear definitions and its premises to be falsifiable  — in other words, there must be conditions under which a proposition can be proven wrong. Ideological premises, on the other hand, do not require falsifiability. Baldness, for example, is defined as a scalp wholly or partly lacking hair. The logical proposition that a person is bald can be falsified (proven wrong) by the presence of a full head of hair. An  ideology, on the other hand, might redefine baldness as “ideas about baldness that produce and normalize baldness.” Believers might claim that all heads are bald regardless of the presence of long and luxurious hair. In fact, hair might be evidence of a refusal to accept one&#39;s baldness.\n  Despite its unfalsifiable propositions, wokecraft, which relies on  cognitive distortions, is making its way into psychological science and clinical practice. And this is corrupting competence and eroding professional ethics.\n In 2018, for example, the APA produced its first set of “ Guidelines for Psychological Practice with Boys and Men,” which infamously declared “traditional masculinity” to be “harmful.” The APA later clarified that the alleged harm resulted from “extreme stereotypical behaviors.” But that only illustrated the unempirical nature of the proposition. (How and when did “traditional masculinity” come to be defined by “extreme stereotypical behaviors”?)\n  To make matters worse, the guidelines called on clinicians to develop in their male clients “awareness of [male] privilege and the harmful impacts of beliefs and behaviors that maintain patriarchal power.” I  argued then that not only was this  countertherapeutic — because clients need to trust that their sessions will not be devoted to their therapists’ ideologies — but that the guidelines violated the APA’s own  ethical requirements, including that clinical psychologists “respect the dignity and worth of all people” and respect each individual’s right to “self-determination.”\n  Now Stanford University’s Counseling and Psychological Services (CAPS) has come under wokecraft&#39;s spell. When CAPS initiated a Diversity, Equity, and Inclusion program,  White Fragility was the chosen book, and personnel were segregated into “affinity groups,” each of which met separately. Those who did not fit neatly into wokecraft&#39;s non-white categories were required to participate in a “whiteness accountability” group for “staff who hold privilege via white  identity” — regardless of whether they identified as “white” or felt such “affinity.”\n   Jewish psychiatrist Ron Albucher, MD, and Jewish psychotherapist and eating disorders specialist Sheila Levin pushed back, but were met with antisemitic tropes: Jews, with their wealth and privilege, were hiding behind their “white” identity.\n After a  zoombombing that included both racist and antisemitic images, Albucher and Levin were informed that only the racism, not antisemitism, was worth addressing. When Albucher vocally rejected the notion that antisemitism should not be discussed in these meetings, staff accused him of being a person with “white privilege” attempting to pull focus from anti-black racism. Even when antisemitic graffiti appeared on campus, their requests to discuss antisemitism were denied.\n  For expressing concern about DiAngelo’s contention that wanting to discuss one’s ancestors’ struggles contributes to racism and is evidence of white fragility, Levin was labeled a “Jewish, white, cisgendered woman of great privilege and power” who allowed her “fragility” to prevent her from “true self-reflection.”\n  The child of two Holocaust survivors, Levin had a strong and negative reaction to the experience of being denied the right to define herself. In the 20th century, having been forcibly classified as  non-white by non-Jews, “my people were murdered because we were seen as contaminants to the white race,” she said. In the 21st century, when being white is now the morally contaminated category, non-Jews at Stanford forcibly classified Jews as  white.\n  Meanwhile, amid alarming increases in anti-Jewish sentiment and antisemitic hate crimes, rather than Stanford mental health professionals preparing themselves to treat Jewish students struggling with this reality, they are being trained in how to perpetuate it.\n Albucher and Levin found private support, but no one else was willing to publicly speak up. Cancel culture, the great enforcer, did its job.\n  Critics of the “cancel culture” moniker often note that few people are truly  canceled. The real problem, however, is the  culture. Perhaps a more accurate descriptor is  a culture of undue influence.\n The American Medical Association’s  code of ethics requires medical professionals to   refrain from using undue influence. Specifically, they are not allowed to  pressure colleagues to participate in advocacy activities and should not punish colleagues, overtly or covertly, for deciding not to participate. What happened to Levin and Albucher appears to be a clear violation of that standard — not to mention a violation of the APA ethical standards mentioned above.\n  Both Levin and Albucher notified HR, but the antisemitic nature of the DEI program only worsened, eventually explicitly asserting that “Jews are connected to white supremacy.” After more than a year of an unwelcoming and hostile climate, Levin and Albucher finally brought a civil rights case against Stanford.\n  Stanford&#39;s counseling center may lead the pack in breaching its ethical obligations, but it is far from alone. Until either the culture of undue influence ends or enough people break the spell of wokecraft — and are willing to suffer the consequences of speaking up — we are likely to see a continued decline in  psychiatric and psychotherapeutic quality of care along with a continued corruption of professional ethics. ♦", "posttime": "2021-06-30 00:39:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "心理健康,health,可能", "title": "心理健康专业人士已经开始起诉斯坦福 ", "title_en": "Mental Health Professionals Have Begun Suing Stanford", "transed": 1, "url": "https://www.psychologytoday.com/us/blog/happiness-and-the-pursuit-leadership/202106/mental-health-professionals-bring-lawsuit-against", "via": "", "real_tags": ["心理健康", "health", "可能"]}, {"category": "", "categoryclass": "", "imagename": "429d852881df42f9a20d4f496ff71855.jpg", "infoid": 1068648, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Xbox，我们的使命很简单：为这个星球上的每个人带来游戏的快乐和社区。为实现这一目标，我们渴望让每个人都玩你想要的游戏，你想要的人，你想要的任何地方。\n 我们正在创建一个结合Xbox的游戏遗产和Azure的力量的未来。我们将高保真度，沉浸式游戏带到全球3亿名人的未来。现在我们向达到这一愿景迈出了一大步：从今天开始，Xbox Cloud游戏可以通过两个国家的Windows 10 PC和Apple手机和平板电脑，通过浏览器，Xbox Cloud Gaming可供所有22个国家使用。如果您是会员或想要成为会员，只需转到PC或移动设备上的Microsoft Edge，Chrome或Safari上的Xbox.com/play即可从Xbox游戏传递库开始播放数百场比赛。\n 借助数十亿个活跃的Windows 10 PC，iOS设备和Android手机，我们希望您在您选择的任何地方玩最深，最沉浸式游戏的新机会。简单地说，我们正在将Xbox体验直接带到您最常使用的设备上。\n 我们还对整体体验进行了重大改进：Xbox Cloud Gaming现在支持自定义Xbox系列X硬件。我们已经通过最快，最强大的Xbox硬件升级了全球的Microsoft DataCenters，为您提供更快的负载时间，提高帧率，以及新一代游戏的体验。为确保最低延迟，最宽的设备上的最高质量体验，我们将以1080p和高达60fps流流。前进我们将继续创新并添加更多功能以增强您的云游戏体验。\n Cloud Gaming在您的设备上提供无缝播放。当您在PC或移动设备上流式传输游戏时，您的游戏正在Microsoft DataCenter中的Xbox Hardware播放。这意味着您可以跳入游戏，与您的朋友联系，并在您始终完成时播放Xbox网络。这是对的，你的游戏节省在你玩的任何时候都一样，所以你可以从你离开的地方捡起来。\n 因此，使用已保存的游戏抓取您的PC和流队的outliders或Doom。或者，当您有一个免费的半小时后，您可以触发Xbox.com/play，并在MLB展示中获取游戏。\n 当我们为更多设备带来游戏时，我们也在演变如何玩游戏。今天关于从云中播放的一六个球员专门使用已启用的自定义触控控制超过50场比赛 - 我个人的爱是MINECRAFT Dungeons。当然，您还可以使用兼容的Xbox无线控制器或许多支持的控制器和移动游戏配件之一来玩云中的游戏，包括用于iOS的全新骨干网。今天标志着我们在我们的旅程中为所有游戏玩家带来Xbox体验的关键里程碑，我们不能等待你开始玩。我记得大约三年前，我第一次拿起电话并播放云游戏，只使用触摸控制。这是我永远不会忘记的那一刻，图形的美丽与技术的创造性混合在一起创造真正神奇的东西。所以，从团队Xbox到你，我们希望您能够通过任何地方和各处游戏来遇到更多的快乐和连接。 ", "note_en": "At Xbox, our mission is simple: bring the joy and community of gaming to everyone on the planet. To achieve that, we aspire to empower everyone to play the games you want, with the people you want, anywhere you want.\n We are  creating a future that combines the gaming heritage of Xbox and the power of Azure. A future where we bring high fidelity, immersive games to the 3 billion players around the world. Now we’re taking a big step forward to reaching that vision:  Starting today, Xbox Cloud Gaming is available to all Xbox Game Pass Ultimate members with Windows 10 PCs and Apple phones and tablets, via browser, across 22 countries. If you’re a member or want to become a member, simply go to  xbox.com/play on Microsoft Edge, Chrome, or Safari on your PC or mobile device to start playing hundreds of games from the Xbox Game Pass library.\n With billions of active Windows 10 PCs, iOS devices and Android phones, we want you to have new opportunities to play the deepest, most immersive games whenever and wherever you choose. Simply put,  we’re bringing the Xbox experience directly to the devices you use most.\n We’re also making significant improvements to the overall experience:  Xbox Cloud Gaming is now powered by custom Xbox Series X hardware. We’ve been upgrading Microsoft datacenters around the globe with the fastest, most powerful Xbox hardware to give you faster load times, improved frame rates, and an experience of a new generation of gaming. To ensure the lowest latency, highest quality experience across the broadest set of devices, we will be streaming at 1080p and up to 60fps. Going forward we’ll continue to innovate and add more features to enhance your cloud gaming experience.\n Cloud gaming provides seamless play across your devices. When you’re streaming games on a PC or mobile device, your game is playing from Xbox hardware in a Microsoft datacenter. This means you can jump into a game, connect with your friends, and play through the Xbox network just as you’ve always done. That’s right, your game saves are just the same wherever and whenever you play, so you can pick right back up from where you left off.\n So grab your PC and stream   Outriders  or   Doom  on your iPad using your saved game. Or, when you have a free half-hour, you can fire up  xbox.com/play and get a game in on   MLB The Show 21.\n As we bring games to more devices, we’re also evolving how you can play your games. Today about one-in-six players who play from the cloud are exclusively using custom touch controls that are enabled for  more than 50 games – one I personally love is   Minecraft Dungeons. And of course, you can also play games from the cloud using a compatible Xbox Wireless Controller, or one of the many  supported controllers and  mobile gaming accessories,  including the all-new Backbone One for iOS.  Today marks a key milestone in our journey to bring the Xbox experience to all gamers, and we can’t wait for you to begin playing. I remember about three years ago, the first time I picked up a phone and played a cloud game, using nothing but touch controls. It’s a moment I’ll never forget, where the beauty of the graphics mixed with the creativity of technology to create something truly magical. So, from Team Xbox to you, we hope you experience more joy and connection through gaming anywhere and everywhere.", "posttime": "2021-06-30 00:38:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,cloud", "title": "Xbox Cloud游戏 ", "title_en": "Xbox Cloud Gaming", "transed": 1, "url": "https://news.xbox.com/en-us/2021/06/28/xbox-cloud-gaming-now-running-on-xbox-series-x/", "via": "", "real_tags": ["游戏", "cloud"]}, {"category": "", "categoryclass": "", "imagename": "c2a6f341de999619b42b2c9bc4484951.png", "infoid": 1068647, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你已经看到了Quentin Tarantino的电影inclourious Basterds，你可能会记得那个带有纳粹官员的英国间谍卧底的酒吧场景，通过无意识的姿态下降他的面具。\n 虽然他穿着纳粹制服并讲得德语，但他通过一个小细节来赋予自己：他的手指。订购三个品脱时，而不是使用他的拇指，指数和中指（作为德国人），他使用他的环，中间和食指。桌子上的另一名官员立即将这种微妙的细节视为令人无法理解的Anglophone。\n  我们在网上工作的任何一个都一样。如果您忽略了一些次要的生命值，请放弃守卫并发出您的身份很容易。在本文中，我们将介绍设备检测的世界，并展示为什么以及模仿设备几乎不可能。\n 在潜入之前，让我们快速查看为什么系统尝试检测设备 - 这也是人们试图检测或模拟设备的答案。\n  在浏览器的早期和整个后续的“浏览器战争”中，无数的浏览器供应商意味着开发人员需要了解供应商连接到其网站的哪个客户，并且他们开始根据检测到的浏览器定制和优化响应。从这个意义上讲，这是一个技术性必需品。\n 如果您忽略了一些次要的生命值，请放弃守卫并发出您的身份很容易。\n 我们的旧朋友用户 - 代理字符串是从这几天的生存 - 但现在检测和预防技术现在都更先进。 \n在检测侧，大多数网站采用检测机制来帮助他们的客户服务。例如，Netflix为每个设备的各种分辨率提供了数百种不同的视频格式，从移动设备到智能电视。没有设备检测，那将如何？\n 同样地，考虑为笔记本电脑和桌面设备提供完全有能力的产品的公司，它们只提供给移动用户的有限版本。\n  到目前为止我们要求的问题让我们在这里，答案是问题。想要获得特定于某些设备的更多元素的人或机器人，或者想要突破所谓的“设备河岸”（例如，他们不想因移动设备而有限制的可能性）。同样，一些威胁演员希望利用一些安全措施对某些设备不那么紧张。\n 谁可以阻止人们利用设备欺骗，如果网站不能向移动设备显示验证码，即使超过了速率限制，或者公司仅提供特定的折扣或仅适用于某些类型的设备？\n  这将我们带来了今天的一天：一个隐喻的“军备竞赛”在试图检测设备的人之间出来的顶部和试图防止该检测的人。虽然这导致了更高的机器学习或AI的高级技术投资，但还有一些其他方法令人惊讶地没有引起大量关注，如谷歌的设备分类方法，毕加索。我们很快就会详细介绍它，但首先，让我们不要忘记那些可以让你离开的小细节。\n  从修改用户代理字符串以采用更高级的技术，设备欺骗以不同的方式可以实现 - 但这也意味着不同的发现方式。\n  许多人认为，欺骗设备和更改用户委托字符串一样简单：我们对他们说，“声称很便宜;展示你的证明！“ \n例如，大多数欺骗尝试声称该设备是移动的，立即让游戏远离游戏。他们忘记了模仿设备特定的功能，例如回答关于触摸支持的问题。\n   var touch_capable =（＆＃39; ontouchstart＆＃39;在窗口）|| （Navigator.maxTouchPoints＆gt; 0）|| （Navigator.msmaxTouchPoints＆gt; 0）;如果（touch_capable）{警报（＆＃34;支持＆＃34;）;}否则{警报（＆＃34;不支持＆＃34;）;}\n 正如我们所说，特定于设备的功能和信息都是必不可少的。如果您声称您的设备是Apple iPhone 6，则必须知道特定于设备的详细信息，至少至少是iPhone 6的屏幕大小。\n 你有没有见过iPhone 6，其屏幕分辨率为1920×1080？我们还没有，也没有检测系统！\n  另一个例子：如果您已成功传递Navigator.platform测试，则没有人会发现它奇怪的是您有MacBook的奇怪：\n  但是，您不能声称您正在使用Max OS X和Windows同时使用！\n 在欺骗设备时，有更多的异常忽略。如果您曾使用过移动浏览器（当然是），您知道您无法调整浏览器窗口的大小。它总是打开，最大化，覆盖整个屏幕。这意味着检测系统，窗口的x和y值应该始终为0，如果不是.. \n关于设备特定属性的例子可以继续，但现在是时候微笑了一点。\n  您是否意识到Emojis，同时键入相同的方式，在不同的设备中可视化不同？\n 例如，这里是一个微笑的表情符号，使用：和），您的系统将其转换为甜蜜的图片。 🙂\n   假设您的客户声明它在Android操作系统上运行。检测系统可以获得EMOJI的散列值，并将其与真正的Android系统中获得的散列值进行比较。如果结果不一样，它会突出显示您的设备。这是真正的魔法！只需使用U + 1F600，同时生成可视化，添加一个定义其他人的值。\n   这里SHA256在Windows 10 OS上从不同版本的Google Chrome获得的相同表情符号中。\n   每个系统都附带了一些预先安装的字体，具有默认使用某些特定的字体。例如，虽然iOS 13 Academy雕刻了：1.0字体预装，但它没有Al Bayan Bold。但是，麦斯卡塔利娜做了！\n 同样，而Tahoma是Windows XP中的默认字体，因为Vista，它是Segoe UI。 Microsoft的Windows 10的最新字体列表附带： \n“请注意：并非所有桌面字体都将在Windows 10的非桌面版本中，如Xbox，Hololens，SurfaceHub等。”\n 因此，如果探测字体可以立即决定，检测系统可以立即决定，如果他们没有看到字体列出的Microsoft的页面，那么您不是正常的Windows 10。\n  截至目前，我们审查了一些问题，欺骗了，但并不难以找到解决方法。通过覆盖浏览器和运输字体，表情符号和二进制属性，这是一个问题，即您可以解决，尽管需要大量的努力和成本。\n Google Picasso通过执行一些严重依赖于OS和图形硬件的渲染操作来了解浏览器的设备分类。\n  2006年，谷歌反滥用团队的Elie Bursztein分享了他的工作，公开分享了毕加索的工作，详细介绍了Google在Google Play中争夺设备欺骗的尝试。\n Picasso旨在通过在大量依赖于浏览器的操作系统和图形硬件来了解浏览器的设备分类。通过使用种子，Picasso在每轮随机地在画布上创建几何符号。种子，圆形，宽度和高度等值是毕加索运行的成分。因此，Picasso可以获得由客户端的不可分布的功能生成的图形输出，如操作系统和图形硬件。除非S /他在手中具有相同的设置，否则对扬声器无法防止这种情况。\n  除非数据库具有通过使用正版设备获得的预先计算值，否则该系统并不意味着任何内容。此数据库稍后将其用作真实引用。 \n我们必须注意毕加索在这里的一些重要观点。例如，它通过使用HTML画布产生图形工作。人们倾向于认为画布用于增加指纹熵以获得唯一性。随着多年前的MultiLogin工程师，而不是有前途的独特指纹，Canvas Hash在设置中与硬件相同的成分相同。 2006年，Google Guys开始使用Canvas指纹的此功能来对设备进行分类以了解设备欺骗尝试。\n  虽然这相当古老的工作（2006年），但它已经由CloudFlare改编。当我们考虑他们的市场份额有多重大时间时，毕加索将作为设备欺骗企图的不可辩护机制。\n 只要对侧具有由正版设备获得的预先计算的散列组成的数据库，似乎难以逃离毕加索的设备和操作系统欺骗尝试。难道你认为谷歌和CloudFlare有足够的数据集来检查设备真实性吗？\n  来自诗人Rumi的这句话可以为我们的情况进行量身定制。长期以来，我们建议我们的用户在Multilogin中创建浏览器配置文件时，请务必选择浏览器配置文件工作的正确操作系统。\n  虽然Multilogin采用一些步骤来防止通过带有配置文件的字体来防止检测系统，但提供正宗的Canvas结果默认值等;最好的是尽可能地留下真实。离开操作系统并不意味着检测系统的任何内容;但是，检测假设设置之间的错配意味着很多！\n 关键规则在人群中混合，以免成为手指指向的人。从一个设备欺骗的角度来看，正如Rumi所说，我们建议：似乎是你的或似乎就像你一样！ ", "note_en": "If you’ve seen Quentin Tarantino’s film Inglourious Basterds, you probably remember the bar scene where a British spy undercover as a Nazi officer drops his mask through an unconscious gesture.\n Although he wears a Nazi uniform and speaks German well, he gives himself by a minor detail: his fingers. When ordering three more pints, instead of using his thumb, index and middle fingers (as Germans do), he uses his ring, middle and index finger. Another officer at the table immediately recognizes this subtle detail as unmistakably Anglophone.\n  The same goes for any of us working online. Dropping your guard and giving out your identity is easy if you overlook some minor-looking vital points. In this article, we will take a journey into the world of device detection, and show why and how  mimicking a device is getting almost impossible.\n Before diving in, let’s have a quick look at why systems try to detect devices – which is also the answer to why people try to detect or emulate devices.\n  In the early days of browsers and throughout the subsequent ‘browser wars’, the myriad of browser vendors meant developers needed to understand which client developed by which vendor was connecting to their websites, and they started customizing and optimizing the response according to the browser detected. In this sense, it was a technical necessity.\n Dropping your guard and giving out your identity is easy if you overlook some minor-looking vital points.\n Our old friend the User-Agent string is a survival from these days – but nowadays detection and prevention techniques are both now much more advanced.\n On the detection side, most sites adopt detection mechanisms to help serve their clients. For example, Netflix supports hundreds of different video formats in various resolutions for each device, from mobile devices to smart TVs. Without device detection, how would that be possible?\n Likewise, think about companies who offer fully capable products to laptop and desktop devices, they offer only a limited version to mobile users.\n  The questions we asked so far brought us here, and the answer is the question. People or bots who want to get more elements specific to certain devices, or who want to break out of so-called ‘device ghettoes’ (eg they don’t want to have restricted possibilities due to being a mobile device). Likewise, some threat actors want to take advantage of the fact that some security measures are not as tight for some devices.\n Who can stop people from utilizing device spoofing if a website cannot show captcha to mobile devices even if some rate limits are exceeded, or if a company offers specific discounts or products only to some types of devices?\n  This brings us to the present day: a metaphorical ‘arms race’ to come out top between those trying to detect devices and those trying to prevent that detection. While this has led to greater investment in advanced tech like machine learning or AI, there are some other methods that have surprisingly not drawn much attention, like Google’s device classification method, Picasso. We’ll look at it in detail at this shortly, but first, let’s not forget those tiny details that can give you away in a second.\n  From modifying User-Agent strings to employing more advanced techniques, device spoofing is possible in different ways – but this also means different ways of discovery.\n  Many people think that spoofing a device is as easy as changing the User-Agent string: we say to them, “claiming is cheap; show your proof!”\n For example, most spoofing attempts claiming that the device is mobile give the game away immediately. They forget to mimic device-specific features, such as answering questions about touch support negatively.\n   var touch_capable = ( &#39;ontouchstart&#39; in window ) || ( navigator.maxTouchPoints &gt; 0 ) || ( navigator.msMaxTouchPoints &gt; 0 );if(touch_capable) { alert(&#34;Supported&#34;);} else {\talert(&#34;Not Supported&#34;);}\n As we said, device-specific features and information are essential. If you claim that your device is Apple iPhone 6, you have to know device-specific details, at least the screen size of the iPhone 6.\n Have you ever seen an iPhone 6 that has a screen resolution of 1920×1080? We have not and nor have detection systems!\n  Another example: no-one would find it odd that you have a MacBook, if you pass the navigator.platform test successfully:\n  However, you cannot claim that you’re using Max OS X and Windows simultaneously!\n There are more anomalies overlooked while spoofing a device. If you have ever used a mobile browser (of course you have), you know you cannot resize the browser window. It’s always opened, maximized, covering the whole screen. This means for a detection system that the X and Y values of the window should always be 0, and if not..\n Examples regarding device-specific attributes can go on, but it’s time to smile a little.\n  Did you realize that emojis, while typed the same way, are visualized differently in different devices?\n For example, here is a smile emoji, using : and ) for it, and your system converts it to a sweet picture. 🙂\n   Let’s say your client claims that it runs on Android OS. A detection system can obtain the hash value of the emoji and compare it with one obtained from a genuine Android system. If the result is not the same, it highlights that you are spoofing your device. It is real magic! Just use a  U+1F600 and while producing visualization, add a value that defines you amongst others.\n   Here sha256 hashed out of same emoji obtained from different version of Google Chrome on Windows 10 OS.\n   Each system comes with some preinstalled fonts, with certain specific ones used as default. For example, while iOS 13 Academy has Engraved LET Plain:1.0 font preinstalled, it doesn’t have Al Bayan Bold. However, macOS Catalina does!\n Likewise, while Tahoma was the default font in Windows XP, since Vista, it’s been Segoe UI. Microsoft’s  latest font list for Windows 10 comes with a note:\n “ Please note: Not all of the Desktop fonts will be in non-desktop editions of Windows 10 such as Xbox, HoloLens, SurfaceHub, etc.”\n So detection systems that probe fonts can decide immediately you’re not a normal Windows 10 if they don’t see fonts listed Microsoft’s page.\n  Up to this point, we examined some issues which give spoofing away, but are not to difficult to find a workaround for. By overriding the browser and shipping font, emoji and binary attributes, it’s a problem that you can tackle, albeit requiring a lot of effort and cost to you.\n Google Picasso understands the browser’s device classification by doing some rendering operations heavily dependent on the OS and graphic hardware.\n  In 2006, Elie Bursztein from the Google anti-abuse team shared his work called Picasso publicly to detail how Google fights device spoofing attempts in Google Play.\n Picasso is designed to understand the browser’s device classification by doing some rendering operations heavily dependent on the browser’s operating system and graphic hardware. By using a seed, Picasso creates geometric symbols on a canvas randomly in each round. Values like seed, round, width, and height are ingredients of Picasso’s operation. In a result, Picasso can get a graphical output produced by the client’s unclonable features like operating system and graphic hardware. The spoofer cannot prevent this unless s/he has the same setup in hand.\n  This system does not mean anything unless a database has precalculated values obtained by using genuine devices. This database is used as a true reference later on.\n  We have to note some important points of Picasso’s work here. For example, it produces graphical work by using HTML canvas. Folks tend to think that canvas is used to increase fingerprint entropy to attain uniqueness.  As Multilogin engineers proved years ago, instead of promising unique fingerprints, canvas hash would be identical in setups with the same ingredients as hardware. In 2006, Google guys started to use this feature of canvas fingerprint to classify devices for understanding device spoofing attempts.\n  Although this is considerably old work (2006), it has been adapted by Cloudflare. When we think about how significant their market share is, Picasso would stand as an unpreventable mechanism for device spoofing attempts.\n As long as opposite sides have a database consisting of precalculated hashes obtained by genuine devices, it seems difficult to escape from Picasso for device and operating system spoofing attempts. Don’t you think Google and Cloudflare have enough datasets to check device authenticity?\n  This quote from poet Rumi could have be tailor-made for our situation. For a long time, we have advised our users when creating browser profiles in Multilogin to be sure to select the correct operating system that the browser profiles work on.\n  Although Multilogin takes some steps to prevent detection systems by shipping fonts with profiles, deliver authentic canvas result default, etc.; the best is to stay authentic as it could be. Leaving operating systems does not mean anything to detection systems; however, detecting a mismatch between supposed settings means a lot!\n The key rule is blending in the crowd for not being the person pointed to by finger. From a device spoofing perspective, as Rumi says, we would suggest: Seem as you are or be as you seem!", "posttime": "2021-06-30 00:38:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设备,device", "title": "模仿设备变得几乎不可能 ", "title_en": "Mimicking a device is becoming almost impossible", "transed": 1, "url": "https://multilogin.com/why-mimicking-a-device-is-almost-impossible/", "via": "", "real_tags": ["设备", "device"]}, {"category": "", "categoryclass": "", "imagename": "6fe6716aeb4784a13640f8db6d127319.jpg", "infoid": 1068645, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Levc是电力范围 - 扩展器伦敦黑色驾驶室的公司，推出了它的第一台电动Campervan。电子露营者基于品牌现有的VN5范围扩展范围。\n 它可以容纳多达四个人，在弹出屋顶上有两个睡眠空间，而第二排台座椅可以折叠起来以营造一张双人床。在后部，电子露营车还设有一体式电动厨房和中央折叠桌。\n 新的Campervan不仅与VN5分享造型线索，还使用与其商业兄弟姐妹相同的Ecity动力系，技术上使电子露营者成为扩展器。这意味着，与典型的电池 - 电动车（BEV）类似于日产叶片或TESLA型号3，E-CAMPER在其阀罩下具有汽油发动机发生器，可以在需要时为31kWh电池充电。\n  由于电池尺寸相对较小，电子露营机具有60英里的纯电气范围。然而，Levc声称Campervan在使用范围扩展器时的总范围可达304英里。此动力总成的主要优点在于涉及范围并且需要充值时的限制较少，但当然这种解决方案仍然需要使用化石燃料。\n Levc Ceo Jofmann概述了即将举行的电子露营者：“Campervan市场正在迅速增长，尽管这些车辆用于沿海和乡村冒险，但通常包括国家公园和保护区，他们仍然由汽油供电或柴油发动机。“他补充说：“我们的零排放能力的电子露营者提供了完美的解决方案，并配备了高质量的功能，可根据满足一系列客户要求来定制。”\n 英国电子露营者的价格从62,250英镑（不包括增值税）开始，随时预计将开始于今年年底。\n 新的2021 eV6电动SUV：详情，图片，价格和销售日期Kia＆＃39; S旗舰电动车在一次充电中最多可达316英里，仅在18分钟内从10-80％充电;可在...中订购 \n2021年达卡春季电动汽车：英国发射仍被认为是达卡的削减电动城市汽车是欧洲最便宜的零排放模式之一，从政府拨款后的刚刚超过10,500英镑。  EcoTricity电气公路充电网络的完整指南需要在Ecotricity电气公路网络上向电动车充电？ 这是它的工作原理，它的成本是多少以及如何支付 ", "note_en": "LEVC, the company behind the  electric range-extender London black cab, has unveiled its first electric campervan. The e-Camper is based on the brand’s existing  VN5 range-extender van.\n It can accommodate up to four people, with sleeping space for two in the pop-up roof, while the second-row bench seats can be folded down to create a double bed. In the rear, the e-Camper also features an integrated electric kitchenette and central folding table.\n Not only does the new campervan share styling cues with the  VN5, but it also uses the same eCity powertrain as its commercial sibling, technically making the e-Camper a  range-extender. That means, unlike a typical  battery-electric vehicle (BEV) like a  Nissan Leaf or  Tesla Model 3, the e-Camper has a petrol-engine generator under its bonnet that can recharge the 31kWh battery when needed.\n  Due to that relatively small battery size, the e-Camper has a pure-electric range of 60 miles. However, LEVC claims the campervan has a total range of up to 304 miles when the range-extender is employed. The main advantage of this powertrain is there are fewer limitations when it comes to range and needing to recharge, but of course this solution does still require the use of fossil fuels.\n LEVC CEO Joerg Hofmann said of the forthcoming e-Camper: “The campervan market is growing rapidly and, despite these vehicles being used for coastal and countryside adventures, which often include national parks and protected areas, they&#39;re still powered by petrol or diesel engines.” He added: “Our zero-emissions-capable e-Camper offers the perfect solution and is well equipped with high-quality features that can be tailored to meet a range of customer requirements.”\n Prices for the e-Camper in the UK start from £62,250 (excluding VAT), with deliveries expected to begin towards the end of the year.\n New 2021 Kia EV6 electric SUV: details, pictures, price and on-sale date  Kia&#39;s flagship electric car is capable of up to 316 miles on a single charge and recharging from 10-80% in just 18 minutes; available to order in the …\n 2021 Dacia Spring electric car: UK launch still being considered  Dacia’s cut-price electric city car is one of the cheapest zero-emissions models in Europe, starting from just over £10,500 after government grants in…\n Complete guide to the Ecotricity Electric Highway charging network  Need to charge your electric vehicle on the Ecotricity Electric Highway network? Here’s how it works, how much it costs and how to pay", "posttime": "2021-06-30 00:37:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推出,camper,范围", "title": "Levc推出E-Camper Range-Extender电动露台 ", "title_en": "LEVC unveils e-Camper range-extender electric camper", "transed": 1, "url": "https://www.drivingelectric.com/levc/40669/levc-unveils-e-camper-range-extender-electric-camper", "via": "", "real_tags": ["推出", "camper", "范围"]}]