[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1069781, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想在纽约市每天赚 200 美元吗？赶到发生谋杀、三声警报或交通事故的现场——然后拿出你的手机开始拍摄。 《华盛顿邮报》了解到，这是来自 Citizen 的宣传，这是一款备受争议的邻里监视应用程序，该应用程序正在悄悄地聘请纽约人直播犯罪现场和其他公共紧急情况，显然是为了鼓励更多普通公民这样做。 Citizen 已经从 Peter Thiel 以及硅谷风险投资公司 Sequoia Capital 和 Greycroft 等知名支持者那里筹集了 1.33 亿美元，承诺为用户在他们生活和工作的地方提供实时安全警报。这些警报中的绝大多数，包括视频，似乎都来自刚好在正确时间出现在正确地点的志愿者。而这种商业模式——在记者对当地新闻报道的减少之际出现——为公司节省了资金。但是，这个以前自称为“Vigilante”的应用程序——现在在 30 个城市拥有超过 700 万用户——也在新闻工作网站上悄悄招募“现场团队成员”，在城市周围追逐紧急情况。一位名叫 Chris 的用户 @cgutter_ 周四在布朗克斯区骑自行车，遇到了至少六种不同的紧急情况，其中包括莫里斯大道上发生的血腥巴士事故和东 175 街发生枪击事件的报告。根据他的个人资料，克里斯已经播放了 1,600 个视频，观看次数达到了 152 万次。当被问及克里斯经常在该应用程序上播放时，公民发言人上周承认他为该公司工作。\n尽管如此，Chris 并未在应用程序上被标记为 Citizen 的员工。相反，他似乎只是另一个关注的纽约人。这位发言人说：“公民在一些可以使用该应用程序的城市设有团队，以展示该平台的工作原理，并在事件实时展开的情况下为负责任的广播实践建模。”西铁城表示，它并没有隐瞒其对付费现场团队成员的使用。该公司也不会在自己的网站上发布招聘信息。周四，Citizen 的名字没有出现在职业委员会 JournalismJobs.com 上被删除的招聘帖中，该招聘帖寻求“现场团队成员”为一家未命名的“拥有用户生成内容的科技公司”工作。 “你将直接从手机直播到应用程序，将事件作为新闻报道，”阅读第三方选角机构 Flyover Entertainment 发布的招聘信息。该帖子称，现场团队成员将被“派遣”报道事件，包括“狗被锁在车里”或房屋火灾。 “如果有目击者、警察 [原文如此] 或其他接受采访的各方，您必须主动为应用程序查看者采访他们，”该清单补充道。纽约现场团队成员每 8 小时轮班每天可赚取 200 美元，而洛杉矶的工人每 10 小时轮班每天可赚取 250 美元。上市称，西铁城计划很快将其现场团队扩展到“其他前 10 大市场”。\nFlyover 的所有者迈克尔·耶茨 (Michael Yates) 拒绝确认该清单是为西铁城提供的，称“我违反了保密协议，他们理所当然地解雇了我。”在 The Post 的质疑下，该帖子从 JournalismJobs.com 上删除后，一名公民发言人证实，耶茨是代表该公司受雇的。该发言人还向 The Post 发送了一个链接，该链接指向同样在 JournalismJobs.com 上的仍然活跃且几乎相同的列表。今年 6 月，互联网文化网站 Daily Dot 报道了西铁城在洛杉矶使用现场团队的情况，但该公司向纽约和其他地区的扩张此前似乎没有报道。长期以来，《公民》一直饱受争议。 2019 年，纽约市议员贾斯汀·布兰南 (Justin Brannan) 在 BuzzFeed 新闻专栏中猛烈抨击该应用程序，指责 Citizen 在未经证实的情况下根据 911 电话发出警报“吓坏了人们”。今年 5 月，Vice 报道说，Citizen 首席执行官 Andrew Frame 悬赏 30,000 美元，以获取导致在洛杉矶逮捕一名男性纵火嫌疑人的信息，并敦促员工在内部消息中“找到这个 F-K” - 在确定该男子之前悬赏赏金是无辜的。 Citizen 于 2016 年以“Vigilante”这个绰号首次发布，但在发布一周后就被苹果的 App Store 下架，因为有人批评它鼓励了警惕性。", "note_en": "Want to make $200 a day in New York City? Rush to the scene of a murder, a three-alarm fire or a traffic accident — then pull out your phone and start filming.\n That’s the pitch from Citizen, a controversial neighborhood watch app that’s quietly hiring New Yorkers to livestream crime scenes and other public emergencies in an apparent effort to encourage more ordinary citizens to do the same, The Post has learned.\n Citizen has raised $133 million from  high-profile backers like Peter Thiel, as well as the Silicon Valley venture firms Sequoia Capital and Greycroft, by promising real-time safety alerts for users right where they live and work.\n The vast majority of those alerts, including videos, appear to come from volunteers who just happened to be in the right place at the right time. And that business model — which comes amid declining coverage of local news by journalists — saves the company money.\n  But the app that formerly called itself “Vigilante” — and which now boasts more than 7 million users across 30 cities — is also quietly recruiting “field team members” on journalism job sites to run around the city chasing emergencies.\n A user named Chris who goes by @cgutter_, spent Thursday biking around the Bronx to at least six different emergencies, including a bloody bus wreck on Morris Avenue and a report of gunshots on East 175th Street. Chris has streamed 1,600 videos that have racked up 1.52 million views, according to his profile.\n  Asked about Chris’ frequent streaming on the app, a Citizen spokeswoman acknowledged last week that he works for the company.\n Nevertheless, Chris is not flagged as an employee of Citizen on the app. Instead, he appears to be just another concerned New Yorker.\n “Citizen has teams in place in some of the cities where the app is available to demonstrate how the platform works, and to model responsible broadcasting practices in situations when events are unfolding in real time,” the spokeswoman said.\n Citizen says that it doesn’t hide its use of paid field team members.\n The company also doesn’t post the jobs on its own Web site. And Citizen’s name was not included in a  since-deleted job posting Thursday on career board JournalismJobs.com seeking “field team members” to work for an unnamed “tech company with user-generated content.”\n “You will be live-streaming from your phone straight to the app, covering the event as news,” read the job listing posted by third-party casting agency Flyover Entertainment.\n The posting said field team members would be “dispatched” to cover events, including “dog locked in car” or house fires. “In the event that witnesses, police officeials [sic] or other parties to interview are available, you must take the initiative to interview them for app viewers,” the listing added.\n New York field team members stand to make $200 per day for eight-hour shifts, while workers in Los Angeles are offered $250 per day for 10-hour shifts. Citizen plans to expand its field team to “other top 10 markets” soon, the listing said.\n  Flyover’s owner, Michael Yates, would not confirm the listing was for Citizen, saying “I’d violate my NDA and they’d rightfully fire me.”\n After the posting was removed from JournalismJobs.com amid questioning by The Post, a Citizen spokesperson confirmed that Yates had been hired on behalf of the company. The spokesperson also sent The Post a link to a still-active and  nearly identical listing, also on JournalismJobs.com.\n  In June, internet culture site the Daily Dot  reported on Citizen’s use of field teams in Los Angeles, but the company’s expansion into New York and other areas does not appear to have been previously reported.\n Citizen has long been controversial. In 2019, New York City Councilman Justin Brannan  slammed the app in a BuzzFeed News op-ed, accusing Citizen of “scaring the hell out of people” for sending out alerts based on 911 calls without corroboration.\n And in May,  Vice reported that Citizen CEO Andrew Frame put out a $30,000 reward for information leading to the arrest of a male arson suspect in Los Angeles, urging employees to “FIND THIS F—K” in internal messages — before ascertaining that the man with a bounty on his head was innocent.\n Citizen was first released in 2016 under the “Vigilante” moniker, but was  kicked off Apple’s App Store one week after launch amid criticisms that it encouraged vigilantism.", "posttime": "2021-07-26 21:42:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "轮班,hour", "title": "现已删除的工作清单表明，Citizen 正在向纽约和洛杉矶的人们支付高达 250 美元的费用，用于 10 小时轮班直播犯罪现场和其他紧急情况", "title_en": "Now-deleted job listings suggest Citizen is paying people in NYC and LA up to $250 for a ten-hour shift live streaming crime scenes and other emergencies", "transed": 1, "url": "https://nypost.com/2021/07/25/citizen-pays-new-yorkers-25-an-hour-to-livestream-crime-scenes/", "via": "", "real_tags": ["轮班", "hour"]}, {"category": "", "categoryclass": "", "imagename": "744aed308224581f26be85122828e031.jpg", "infoid": 1069780, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透社 7 月 26 日 - 由 Facebook (FB.O) 和微软 (MSFT.O) 等一些美国最大科技公司组成的反恐组织正在大幅扩展关键数据库中公司之间共享的极端主义内容类型，旨在该组织告诉路透社，打击来自白人至上主义者和极右翼民兵的材料。迄今为止，全球互联网反恐论坛 (GIFCT) 的数据库侧重于来自联合国名单上的恐怖组织的视频和图像，因此主要由伊斯兰极端组织（例如伊斯兰国、基地组织和塔利班）的内容组成。在接下来的几个月里，该组织将添加攻击者宣言——通常由白人至上主义暴力后的同情者分享——以及联合国倡议技术反恐怖主义标记的其他出版物和链接。它将使用来自情报共享组五眼的列表，添加来自更多组的 URL 和 PDF，包括骄傲的男孩、三个 Percenters 和新纳粹。包括 Twitter (TWTR.N) 和 Alphabet Inc (GOOGL.O) YouTube 在内的这些公司共享“哈希”，这是已从其服务中删除的原始内容的独特数字表示。其他平台使用这些来识别自己网站上的相同内容，以便对其进行审查或删除。虽然该项目有助于打击主流平台上的极端主义内容，但团体仍然可以在许多其他网站和互联网上发布暴力图片和言论。 GIFCT 的执行董事 Nicholas Rasmussen 在接受路透社采访时表示，该科技集团希望应对更广泛的威胁。拉斯穆森说：“任何关注恐怖主义或极端主义局势的人都必须意识到，还有其他部分……现在需要关注。”他提到了极右翼或出于种族动机的暴力极端主义的威胁。\n这些科技平台长期以来一直因未能监管暴力极端主义内容而受到批评，尽管它们也面临审查制度的担忧。 1 月 6 日美国国会大厦发生致命骚乱后，包括白人至上主义和民兵组织在内的国内极端主义问题再次变得紧迫起来。阅读更多 14 家公司可以访问 GIFCT 数据库，包括 Reddit、Snapchat 所有者 Snap (SNAP.N)、Facebook 旗下的 Instagram、Verizon (VZ.N) Media、微软的 LinkedIn 和文件共享服务 Dropbox (DBX.O)。 GIFCT 现在是一个独立组织，在巴黎和布鲁塞尔发生一系列致命袭击后，在美国和欧洲政府的压力下于 2017 年成立。它的数据库主要包含与联合国安理会综合制裁名单上的团体有关的视频和图像的数字指纹，以及一些特定的直播攻击，例如 2019 年新西兰基督城的清真寺枪击事件。 GIFCT 面临一些人权和数字权利组织对审查的批评和担忧。拉斯穆森说：“这方面的过度成就会让你走向侵犯某人在互联网上进行言论自由的权利。”该组织希望继续扩大其数据库以包括音频文件或某些符号的哈希值并扩大其成员资格。它最近增加了房屋租赁巨头 Airbnb (ABNB.O) 和电子邮件营销公司 Mailchimp 作为成员。", "note_en": "July 26 (Reuters) - A counterterrorism organization formed by some of the biggest U.S. tech companies including Facebook  (FB.O) and Microsoft  (MSFT.O) is significantly expanding the types of extremist content shared between firms in a key database, aiming to crack down on material from white supremacists and far-right militias, the group told Reuters.\n Until now, the Global Internet Forum to Counter Terrorism&#39;s (GIFCT) database has focused on videos and images from terrorist groups on a United Nations list and so has largely consisted of content from Islamist extremist organizations such as Islamic State, al Qaeda and the Taliban.\n Over the next few months, the group will add attacker manifestos -- often shared by sympathizers after white supremacist violence -- and other publications and links flagged by U.N. initiative Tech Against Terrorism. It will use lists from intelligence-sharing group Five Eyes, adding URLs and PDFs from more groups, including the Proud Boys, the Three Percenters and neo-Nazis.\n The firms, which include Twitter  (TWTR.N) and Alphabet Inc&#39;s  (GOOGL.O) YouTube, share &#34;hashes,&#34; unique numerical representations of original pieces of content that have been removed from their services. Other platforms use these to identify the same content on their own sites in order to review or remove it.\n While the project helps combat extremist content on mainstream platforms, groups can still post violent images and rhetoric on many other sites and parts of the internet.\n The tech group wants to combat a wider range of threats, said GIFCT&#39;s Executive Director Nicholas Rasmussen in an interview with Reuters.\n &#34;Anyone looking at the terrorism or extremism landscape has to appreciate that there are other parts...that are demanding attention right now,&#34; Rasmussen said, citing the threats of far-right or racially motivated violent extremism.\n The tech platforms have long been criticized for failing to police violent extremist content, though they also face concerns over censorship. The issue of domestic extremism, including white supremacy and militia groups, took on renewed urgency following the deadly Jan. 6 riot at the U.S. Capitol.   read more\n Fourteen companies can access the GIFCT database, including Reddit, Snapchat-owner Snap  (SNAP.N), Facebook-owned Instagram, Verizon  (VZ.N) Media, Microsoft&#39;s LinkedIn and file-sharing service Dropbox  (DBX.O).\n GIFCT, which is now an independent organization, was created in 2017 under pressure from U.S. and European governments after a series of deadly attacks in Paris and Brussels. Its database mostly contains digital fingerprints of videos and images related to groups on the U.N. Security Council&#39;s consolidated sanctions list and a few specific live-streamed attacks, such as the 2019 mosque shootings in Christchurch, New Zealand.\n GIFCT has faced criticism and concerns from some human and digital rights groups over censorship.\n &#34;Over-achievement in this takes you in the direction of violating someone&#39;s rights on the internet to engage in free expression,&#34; said Rasmussen.\n The group wants to continue to broaden its database to include hashes of audio files or certain symbols and grow its membership. It recently added home-rental giant Airbnb  (ABNB.O) and email marketing company Mailchimp as members.", "posttime": "2021-07-26 21:42:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据库,microsoft,facebook,youtube,微软", "title": "Facebook、Twitter、微软、YouTube 和其他公司现在将把来自白人至上主义者和极右翼民兵的内容添加到一个关键的反恐数据库中", "title_en": "Facebook, Twitter, Microsoft, YouTube, and others will now add content from white supremacist and far-right militias to a key counterterrorism database", "transed": 1, "url": "https://www.reuters.com/technology/exclusive-facebook-tech-giants-target-manifestos-militias-database-2021-07-26/", "via": "", "real_tags": ["数据库", "microsoft", "facebook", "youtube", "微软"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069779, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "方法论 The Wanderer 从 1993 年 6 月到 1995 年 6 月每月运行一次。虽然 Wanderer 肯定不会到达每个站点，但它以一致的方法运行，希望为 Web 的发展产生一致的数据。背景 互联网总体上发展得相当快。对 Web 增长的任何观察都必然会检查整个 Internet 的增长。这样做，特别是通过查看 ZONE 收集的数据", "note_en": "Methodology The Wanderer was run on a monthly basis from June 1993 to June 1995. While the Wanderer certainly did not reach every site, it was run with consistent methodology, hopefully yielding consistent data for the growth of the Web. Context The Internet in general has grown quite fast. Any look at the growthof the Web necessarily examines the growth of the Internet at large.Doing so, particularly by looking at the data collected by  ZONE", "posttime": "2021-07-26 21:42:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,growth,增长", "title": "衡量网络的增长：1993 年 6 月至 1995 年 6 月 (1995)", "title_en": "Measuring the Growth of the Web: June 1993 to June 1995 (1995)", "transed": 1, "url": "https://www.mit.edu/people/mkgray/growth/", "via": "", "real_tags": ["网络", "growth", "增长"]}, {"category": "", "categoryclass": "", "imagename": "aae70c1c367035f326f276a91d759cc5.jpeg", "infoid": 1069778, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周我注意到很多关于奥运会的广告。显然，开幕式在上周五晚上 7:30 左右进行了现场直播，考虑到东京的上午 8:30，这有点奇怪。事实证明那只是假的 NBC 时间来创建一个人为的“事件”让我参与。但我还是试着去看看。毫无疑问，这样一个盛大的场面会在 YouTube 直播、CNN 网站、纽约时报和奥运会主网站上“直播”，作为下个月奥运会节目的预告片。但我找不到。我尝试通过我父母的有线电视提供商登录，但进入了一个扼杀循环，在那里我选择了我的提供商，被重定向，登录，然后被送回再次选择我的提供商。然而，今天早上检查奇怪的循环已经关闭。我猜我不会看到他们“现场直播”。我只好等到星期六。如果您搜索 2021 年奥运会开幕式的推荐短语，这就是今天 YouTube 上的内容：除了显示象形图的视频外，我观看了所有视频，但我并不满意。以上观看次数来自周一早上，仍然很低。越来越多的人看到蒂姆·狄龙 (Tim Dillon) 的推特上一位假冒 NBC 制片人的推文被一个热门麦克风捕捉到：我认为开幕式会因为奢侈和费用而得到更多宣传。这是一种快速贬值的资产，因为很多人都想观看现场直播或接近现场直播，但很少有人愿意在一周后观看。有人关心 2016 年里约开幕式在 Youtube 上直播达到 600 万次观看吗？甚至 2012 年也进行了现场直播。事实上，我发现每一个开幕式都可以追溯到 1972 年。在此之前你可以找到更短的剪辑，但自 1972 年以来每场开幕式的所有 3 小时以上都可以在 Youtube 上观看。我也对一些事件感兴趣。奥运会营销团队在《华尔街日报》和《纽约时报》上刊登有关塞尔维亚 3x3 篮球的报道方面做得非常出色。这是一个很棒的故事。篮球是一项非常受欢迎的运动，3x3 而非 5x5 增加了一个新的维度。这场比赛是如此不同，以至于美国强队甚至没有资格参加比赛。塞尔维亚有一位大多数人从未听说过的超级明星运动员。\n不是最好的布局。它集男子和女子比赛于一体。它没有搜索。你必须向下滚动才能找到我们现在的位置。没有排名或汇总数据。但是当我点击进入游戏时会发生什么？我得到了对游戏的逐个描述，但没有视频。在侧边栏上有这个：这会将您带到另一个站点，在那里您可以实际观看直播。而且他们有重播……预赛：比赛甚至没有被相关球队标记。如果您在网站上搜索塞尔维亚篮球，您会看到：也许我遗漏了一些东西。也许有一些网站已经存在，但我不擅长谷歌搜索。也许这个站点上有一些隐藏的页面，可以以合理的方式提供所有内容。但在这一点上，我放弃了。我想要一个网站，您可以在其中放置一个国家或运动，并获得涉及该国家或运动的游戏的时间顺序列表。您可以过滤男性和女性。您还可以查看观看次数最多的视频和其他直播视频部分。亮点或评论也会很好。我希望每项运动都有一页排名和一页解释这项运动的规则、得分和历史。我希望每个国家都有一个类似的页面。\n我想在不订阅任何新服务的情况下观看开幕比赛。你仍然可以向我展示广告。事实上，您可以向我展示的广告可能对我个人而言非常专业。也许我不是目标受众。老实说，即使在最好的情况下，我也不认为自己总共观看了几个小时。当你的目标市场在下午 5 点回家时，为什么要专注于接触像我这样的人，打开 NBC 并让它在后台运行到晚上 11 点。如果你给他们太多的选择，他们只会看他们关心的东西，你卖的广告就会少很多。我确定这个人是存在的。我个人认识几个。但这些人有越来越好的选择。看 NBC 和 FOX 不是一个选择。它正在观看 NBC 或从您策划的 Netflix 蒸汽中流式传输任何节目或电影，或玩无缝下载到您的控制台的视频游戏，或无休止的社交媒体提要。这很难卖。但别担心，CNN 表示没有什么可担心的“这可能会成为有史以来收视率最低的夏季奥运会，”福克斯体育前高管转型为媒体顾问的帕特里克·克拉克斯 (Patrick Crakes) 说。 “他们无法避免媒体碎片化的加剧，这使每个人都可以将更多时间花在各种内容上。”流媒体和数字平台为观众提供了比以往更多的观看奥运会的方式——现场赛事、精彩集锦、采访、故事和其他可分享的剪辑。这就是为什么本届奥运会可以看到其收视率下降到传统电视意义上的历史最低点，但仍然比以往任何时候都吸引更多眼球。", "note_en": "I’ve noticed a lot of ads about the Olympics over the last week. Apparently the opening ceremonies were broadcast live last Friday, around 7:30 PM, which is kind of weird considering that would be 8:30 AM in Tokyo. Turns out that was just fake NBC time to create an artificial “event” for me to participate in.\n But I tried to check it out anyway. Surely such a big spectacle would be “streaming” on YouTube live, CNN’s website, NY Times and the Olympics main website as a teaser for the next month of Olympic programming. But I couldn’t find it. I tried logging in through my parent’s cable provider, but got into a strangle loop where I choose my provider, got redirected, logged in, and was then sent back to choosing my provider again. However, checking this morning the strange loop has been closed.\n Guess I wasn’t going to be seeing them “live”. I just had to wait until Saturday. This is what’s on YouTube today if you search the recommended phrase  Olympics opening ceremony 2021:\n  I watched all but the videos but the one displaying pictograms, but I didn’t feel satisfied. View counts above are from Monday morning and are still pretty low. More people saw Tim Dillon’s tweet of a fake NBC producer caught on a hot mic:\n    I would think opening ceremonies would be more publicized due to the extravagance and expense that went into them. It’s a quickly depreciating asset since many people want to watch them live or near live, but very few would want to watch them even a week later. Does anyone care about the  2016 Rio Opening Ceremony which was streamed live on Youtube to 6 million views? Even 2012 was live  streamed live.\n In fact, I found every single opening ceremonies dating back to 1972. Before then you can find shorter clips, but all 3+ hours of every ceremony since 1972 can be viewed on Youtube.\n  I was also interested in some events. The Olympics marketing team did a great job at planting stories about Serbian 3x3 basketball in both the  Wall Street Journal and  NY Times. It’s a great story. Basketball is a very popular sport and 3x3 as opposed to 5x5 adds a new dimension. The game is so different that the American powerhouse didn’t even qualify for the event. And Serbia has a superstar athlete most have never heard of.\n     Not the best layout. It lumps men’s and women’s games. It has no search. You have to scroll down to find where we are now. No standings or aggregate data. But what happens when I click into a game?\n  I get a play by play description of the game, but no video. On the sidebar there is this:\n   This takes you to another  site where you can actually watch live. And they have replays… of preliminary matches:\n  The matches aren’t even labeled by the teams involved. If you search for Serbia basketball on the site, you’ll see this:\n  Maybe I’m missing something. Maybe there’s some website that exists that has all this and I’m just bad at googling. Maybe there’s some hidden away page on this site that has everything available in a reasonable manner. But at this point I’m giving up.\n  I would like a website where you put in a country or sport and get a chronological list of games involving that country or sport. You can filter on men’s vs women’s. You can also see most viewed videos and another section for live video. Highlights or commentary would be nice as well.\n I would like each sport to have a page of rankings and a page explaining the rules, scoring and history of the sport. I would like a similar page for each country.\n I would like to watch the opening games without subscribing to any new service. You can still show me ads. In fact, the ads you can show me could be hyper specialized to me personally.\n  Maybe I’m not the target audience. I’ll be honest, even under best case scenario, I don’t see myself watching more than a few hours total. Why focus on reaching someone like me when your target market comes home at 5 PM, flips on NBC and has it running in the background until 11 PM. If you give them too many options, they’ll just watch what they care about and you’ll sell a lot fewer ads.\n I’m sure this person exists. I know a few personally. But these people have increasingly better options. It’s not a choice between watching NBC and FOX. It’s watching NBC or streaming any shows or movies from your curated Netflix steam or playing video games seamlessly downloaded to your console, or endless social media feeds. And that’s a lot harder sell. But don’t worry, CNN  says its nothing to worry about\n &#34;This is probably going to be the lowest-rated summer Olympics of all time,&#34; said Patrick Crakes, a former Fox Sports executive turned media consultant. &#34;They can&#39;t avoid the increased media fractionalization that&#39;s enabling everyone to spend more time with all sorts of content.&#34;\n  Streaming and digital platforms provide viewers with more ways to watch the Olympics than ever — live events, highlights, interviews, stories and other shareable clips. That&#39;s why this Olympics could see its viewership fall to a record low in the traditional TV sense yet still reach more eyeballs than ever.", "posttime": "2021-07-26 21:41:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "观看,difficult,奥运会", "title": "为什么NBC让观看奥运会如此困难？", "title_en": "Why does NBC make it so difficult to watch the Olympics?", "transed": 1, "url": "https://mleverything.substack.com/p/why-does-nbc-make-it-so-difficult", "via": "", "real_tags": ["观看", "difficult", "奥运会"]}, {"category": "", "categoryclass": "", "imagename": "09d964fe44c0b1d047e16ada3211a973.png", "infoid": 1069777, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从今天开始也有这个问题，我在 v4.2.5。试图通过磁铁启动 torrent，它给了我一些关于没有磁铁客户端的错误（真的不记得了）。然后我尝试手动启动 qBitTorrent，但它没有响应。重新启动我的 PC 并注意到我的 Windows Defender 在侧边栏中给了我一些弹出窗口。我使用的是 Windows 10 教育版 20H2 内部版本 19041.804。", "note_en": "Been having this issue since today too, and I&#39;m on v4.2.5. Tried to start a torrent via magnet, and it gave me some error about not having a client for the magnet (don&#39;t really remember). Then I tried starting qBitTorrent manually and it just wouldn&#39;t respond. Restarted my PC and noticed my Windows Defender had given me some pop ups in the sidebar. I&#39;m on Windows 10 Education version 20H2 build 19041.804.", "posttime": "2021-07-26 21:41:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,defender,磁铁", "title": "Windows Defender 阻止 qBittorrent", "title_en": "Windows Defender blocks qBittorrent", "transed": 1, "url": "https://github.com/qbittorrent/qBittorrent/issues/14489", "via": "", "real_tags": ["windows", "defender", "磁铁"]}, {"category": "", "categoryclass": "", "imagename": "3d0f41fca53141b40559e22d1908ae1d.jpg", "infoid": 1069776, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专栏 您可以在一英里外发现浏览器大战的老手。并非 20 年前，这些可怕的冲突在世界各地的桌面上展开，留下了深深的伤痕。只需在 95 年代的任何人群中低声说“在 IE6 中观看效果最佳”，然后看着成年男女像婴儿一样哭泣，因为他们的手抓住一只无形的鼠标点击那个久违的关闭窗口。到 Gen XP，一切都结束了，Internet 桌面完全处于 Empire 的控制之下。然后是 Chrome 和 Firefox 的 Rebel Alliance，在短短几年内我们就被解放了。像和平时期的每一代人一样，此后的人们已经忘记了冲突。他们认为自由是理所当然的。桌面是一个古老的战场，就像波罗的海战舰一样陈旧。我们是移动的，我们是云，所有访问锁定都被淘汰的地方。坏消息。 Windows 11 将改变这一切。抓住那个 Lee-Enfield .303，士兵。宿敌再次苏醒。 Internet Explorer 通过服务包集成到 Windows 95 中这一简单的权宜之计，将与 Netscape 相比 5% 的市场份额变成了 90+ 的杀手级分数。 Windows 11 肯定非常非常渴望您使用 Edge，即使您将默认浏览器设置为其他东西，它也会像在 Win 10 中一样在系统搜索中弹出，但没有迹象表明它会成为 Chrome 安装小程序以外的任何东西。不，您将免费获得的新超级武器是 Microsoft Teams，它现在超级紧密地安装在 Windows 11 桌面上，只需单击一下即可轻松登录 Empire。 MS 真正想让你使用的其他所有东西——OneDrive、Office 365、那些爆破的小部件——你可以扔掉。团队？啊，没有那么多。从表面上看，Teams 是用来与其他人交谈的，如果他们在 Teams 上，您也必须使用它。文档、电子表格、各种文件 - OneDrive、Office 365 用户可以与您的 Google Drive 和应用程序交换内容。在这些 WFH 时代，您必须通过互联网与其他人交谈。过时的战场是实体办公室，新的闪亮冲突区是承载我们所有工作互动的中介渠道。\n而这一次，甚至没有根深蒂固的反对派。谷歌的会议系统是一个不知道自己名字的烂摊子，唯一的防线是Salesforce和刚刚动员起来的Slack。对于 Slack 来说，它看起来并不好，它知道这一点——一年前，它开始投诉微软将 Teams 包含在 Office 中。毫无疑问，它将扩展到 Windows 11，但没有人在法庭上赢得世界大战。是什么让会议空间像美索不达米亚油田那样对列强来说是一种诱人的资源？这和浏览器大战一样——控制人与数字之间对话的人控制着世界。您共享的每个文件、建立的每个连接、交换的每个链接，都是要收集的宝藏。这一切都是自动汇集在一起​​的。观看团队内访问渠道在各个企业中涌现的帮助热线、内容收集器、特价渠道、支付系统。会议系统用户之间、彼此之间以及他们的资源之间的长期互动产生了丰富的准备挖掘行为，因为它如此以任务为中心，因此可以大量货币化。微软服务器上的所有元数据——以及真实数据——准备好供给 AI/ML 机器的原材料，只需点击 EULA。微软在这里比 Salesforce 获得的收益要多得多，因为它将默认安装在世界上几乎所有的企业中，并且有更多的东西可以卖给你；如果它让家庭用户养成 Teams 的习惯，那么它又回到了 IE6 的快乐狩猎场。这是一个可怕的前景，不仅对 Slack 来说，而且对每个人来说都是如此。 IE6 的统治以停滞为标志；所有公司都认为将开发资源用于垄断服务是浪费。它的奴隶军队在工厂里辛勤劳作，他们应该对得到的东西心存感激。如果你认为 Teams 不如给正在腐烂的大菱鲆的扁桃体挠痒痒那么有趣，那就等到微软安顿下来享受它的新垄断吧。拯救世界的是互联网开放标准——微软无法管理这种锁定，尽管它尝试过如此艰难。这一次，标准不存在或存在的地方，它们没有被端到端控制整个链条的大玩家使用。不允许使用第三方端点。因此，无论您使用的是非 MS 台式机还是移动设备，都必须使用 Microsoft 应用程序。没有锁定云？帮我们一个忙。可能为时已晚； Windows 11 很快就会无处不在。该行业的其余部分处于混乱状态。但是，如果谷歌和 Salesforce 以及亚马逊和苹果决定生活在一个州联邦中，而不是看到整个地段回到旧的四窗格标志下，那么可以建立一个新的反叛联盟。如果微软赢的最多，那么它输的也最多——Salesforce 的 Slack 爱是作为 CRM 渠道，无论如何它最终都会获得指标和聚合渠道。谷歌和亚马逊拥有在开放市场上销售会议服务和开放接入点的影响力和基础设施。与微软不同，它们是基于开放标准构建的生物。谷歌通过开放赢得了移动业务。如果它显示出任何理解会议的迹象，那就太好了。在一个专注的对手已经获胜之前，将你的希望寄托在一个不稳定的联盟上，这不是任何理智的人都会创造一个更美好世界的方式。但希望的证据就在那里。问问上次战争的老兵，听他们说——有更好的方法。 ®\n考虑升级到 Debian Bullseye？注意 Exim 和任何使用 Python 2.x 的变化 Debian 项目已将 Debian 11（也称为 Bullseye）的发布日期设置为 8 月 14 日。 Debian 本身就是一个重要的发行版，但也有影响力，因为它是许多其他发行版的基础，包括 Ubuntu、Mint、Devuan、Knoppix、Tails、Raspbian、Pop!_OS、SteamOS 等。在开发者公告邮件列表的帖子中，发布团队表示：“我们计划于 2021 年 8 月 14 日发布。”自 Debian 10 “Buster”于 2019 年 7 月 6 日发布以来已经过去了两年多。除了“紧急错误修复”之外，测试版本现在“完全冻结”。继续阅读 简而言之，Deepmind 和欧洲生物信息学研究所发布了一个数据库，其中包含由该公司的 AI 模型 AlphaFold 预测的 350,000 多个 3D 蛋白质结构。该数据涵盖了人体内 20,000 种左右的蛋白质，可供任何人研究。我们被告知，从斑马鱼到大肠杆菌等 20 种其他生物的蛋白质组也在其中，随着时间的推移，还会增加数亿个结构。\nDeepMind 的首席执行官 Demis Hassabis 表示：“在世界各地的科学家手中，这种新的蛋白质年鉴将促进和加速研究，从而促进我们对这些生命组成部分的理解。”他希望它将成为一种宝贵的资源，用于发现新药和我们对疾病的了解。继续阅读为了真正展示财富，在耳后轻轻涂抹打印机墨水，而不是香奈儿 5 升办公室必需品的成本高达 2,410 英镑——高于 2003 年的 1,700 英镑，发现哪个？打印机墨水继续被列为最昂贵的液体之一，一升家庭办公室必需品的成本与一瓶非常高端的起泡酒或橡木陈酿干邑的价格相同。消费者倡导者哪个？发现从打印机制造商处购买的墨水比第三方替代品的价格高出 286%。将笔尖浸入一个墨水瓶中，然后在吸墨纸上轻轻擦去多余的笔尖，哪个？发现用于 WorkForce WF-7210DTW 打印机的彩色墨水（青色、品红色、黄色）的合装包售价为 75.49 英镑，来自爱普生。\n继续阅读 BORK!BORK!BORK! Windows XP 即将迎来 20 岁生日，但令人振奋的是，该操作系统仍然可以保证取代其作为世界末日三骑士之一的地位。虽然实际上不是在蓝色屏幕上，但 Windows XP 的丑陋面孔已经显示出它位于 CMOS 错误和另一个屏幕之间，它只是决定结束这一切。继续阅读在之前看过悬崖之后，肯特郡议会再次考虑将 5 亿英镑用于外包 肯特郡议会正在邀请 IT 服务公司和 BPO 专家竞标一项 5 亿英镑的框架协议，该协议旨在为企业提供一系列外包服务英国公共当局。在本周发布的一份合同通知中，该委员会通知他们市场参与这项价值 5 亿美元的交易，希望供应商能够“提高效率，提供灵活可靠的解决方案，实现转型并满足 [...理事会的] 业务目标。”\n通知称，托管服务框架协议旨在将“日常管理职责和职能的外包作为一种战略方法，通过提高效率、有效性和降低运营成本来转变和改进业务流程”。继续阅读你最大的弱点是什么？您将在 Hell Feature 中遇到的多种面试官的最终名单 在向您展示了一些关于人们如何搞砸他们的简历和面试的重要提示后，我们现在转向最薄弱的环节：面试官。这篇文章借鉴了我自己从grunt程序员、CTO到猎头在招聘游戏中多年的经验。为了保护有罪的人，名字被掩盖了。继续阅读俄罗斯的 Pirs ISS 模块计划拆除，就像莫斯科对空间站 Troubled Nauka 的兴趣可能会在四次轨道修正后真正实现——自从我们周五下班以来\n俄罗斯航天局整个周末都在试图将一个模块送到国际空间站，并决定放弃另一个模块。莫斯科想要的模块是 Nauka，它在因推进系统问题、油箱污染和组件过期导致数十年延迟后于上周发射。继续阅读谁，我？欢迎来到谁，我？，当读者无意中清理高级职员的集体行为时，神圣的土地被践踏。我们的故事，由“苏珊”告诉我们，让我们回到 25 年前她为英国一家著名的抵押贷款卖家工作的时间（这家公司，由于显而易见的原因，将保持匿名。） Susan 表面上是一名 Visual Basic 6 和 Microsoft SQL Server 开发人员，因为——让我们面对现实吧——我们中的很多人当时都在工作。客户端/服务器就是它所在的位置，而 Cloud Native 还没有给管理员带来麻烦。继续阅读\n还记得镇上唯一的数据库是关系数据库吗？事情在 20 年间发生了变化。今天，古老的关系数据库管理系统 (RDBMS) 仍然占据主导地位，但市场上也充斥着为不同类型的工作设计的新数据库类型。数据库概念早于 RDBMS，以分层和网络数据库的形式出现，甚至以穿孔卡片集合的形式出现。但真正开创了现代数据库计算时代的是 EF Codd 于 1970 年发表的关系概念。他的表和行概念将逻辑数据模型与底层物理存储巧妙地分开，并导致了从 70 年代中期开始的一系列数据库引擎。几十年来，RDBMS 完全适用于大多数应用程序，但变革的种子已经播下。就在 Codd 发表他的第一篇论文的前一年，斯坦福研究所和加州大学洛杉矶分校交换了第一条互联网信息。这最终会改变一切，创造一个永远改变计算的互联网，增加应用程序的规模和范围。继续阅读 Tom Corn 前往开放系统，因为 Virtzilla 暗示其 SmartNIC 推动已取得成果 Tom Corn，直到上周该公司的安全产品高级副总裁周四在推特上发布了这一消息。继续阅读\nDEF CON 今年提供初学者级别的 Spot the Fed：他将在舞台上发表主题演讲 简而言之，今年 DEF CON 的“Spot the Fed”游戏将比往常容易一些：美国政府国土负责人安全正在发表主题演讲。周五，信息安全会议组织者确认亚历杭德罗·马约卡斯将于 8 月 6 日周五发表演讲。这一消息让一些 DEF CON 老手感到不安。继续阅读 The Register - 技术社区的独立新闻和观点。部分情况发布", "note_en": "Column You can spot a veteran of the Browser Wars a mile off. These fearsome conflicts, fought across the desktops of the world not 20 years ago, left deep scars. Just whisper &#34;Best viewed in IE6&#34; in any crowd of Generation 95&#39;ers, and watch grown men and women weep like babies as their hands grasp for an invisible mouse to click on that long-gone Close Window.\n By Gen XP, it was all over and the internet desktop was under total Empire control. Then came the Rebel Alliance of Chrome and Firefox, and in a few short years we were liberated.\n Like every peacetime generation, those since have forgotten the conflict. They assume that freedom is here by right. The desktop is an antique battleground, as obsolete as warships in the Baltic. We are mobile, we are cloud, all places where access lock-in is baked out.\n   Bad news. Windows 11 is going to change all that. Grab that Lee-Enfield .303, soldier. An old enemy reawakens.\n     Internet Explorer turned a 5 per cent market share against Netscape into a 90+ killer score by the simple expedient of getting integrated into Windows 95 through a service pack. Windows 11 is certainly very, very keen for you to use Edge, which as in Win 10 pops up in system search even if you make your default browser something else, but there&#39;s no sign it&#39;ll become anything more than the Chrome Install applet.\n No, the new superweapon you&#39;ll get for free is Microsoft Teams, which is now super-snugly  installed on the Windows 11 desktop and just a click away from easy-peasy sign-on to the Empire. Everything else that MS really wants you to use – OneDrive, Office 365, those blasted widgets – you can do away with. Teams? Ah, not so much. Teams is there, ostensibly, to talk to other people, and if they&#39;re on Teams you have to use it too. Documents, spreadsheets, files of all sorts – a OneDrive, Office 365 user can swap stuff with your Google Drive and apps.\n   In these WFH days, you have to talk to other people over the internet. The out-of-date battlefield is the physical office, the new shiny conflict zone is the mediation channel that carries all our work interactions.\n And this time, there&#39;s not even an entrenched opposition. Google&#39;s conferencing system is a shambles that doesn&#39;t know its own name, and the only defensive line being drawn up is  by Salesforce and the freshly mobilised Slack. It doesn&#39;t look good for Slack, which knows it – a year ago it started  a complaint against Microsoft for including Teams in Office. No doubt it&#39;ll extend that to Windows 11, but nobody wins a world war in a courtroom.\n  What makes the conferencing space as tempting a resource as Mesopotamian oil fields to the Great Powers? It&#39;s the same as the Browser Wars – those who control the conversation between humans and the digital control the world. Every file you share, every connection made, every link swapped, is treasure to be collected. It&#39;s all funnelled together automatically. Watch as in-Teams access channels spring up across businesses for helplines, content accumulators, special offer conduits, payment systems.\n The long trail of interactions between conferencing system users, each other, and their resources, produces a rich seam of ready-to-mine behaviour that, because it is so task-focused, is massively monetisable. All that metadata – and real data – on Microsoft&#39;s servers, raw material ready to feed the AI/ML machines, just a EULA click away. Microsoft stands to gain a lot more than Salesforce here as it will be installed as default across just about every business in the world, and has a lot more stuff to sell you; if it gets home users into the Teams habit, it&#39;s back in the happy hunting grounds of IE6.\n This is a terrible prospect, not just for Slack but for everyone. IE6&#39;s reign was marked by stagnation; all companies see spending development resources for a monopoly service as waste. It had its slave army toiling in the factory, they should be grateful for what they get. And if you think Teams is less fun than tickling the tonsils of a decomposing turbot, wait until Microsoft has settled in to enjoy its new monopoly.\n   What saved the world were internet open standards – Microsoft couldn&#39;t manage that lock-in, hard as it tried. This time, the standards don&#39;t exist or where they do, they&#39;re not used by the big players, who control the whole chain end-to-end. Third-party endpoints are not allowed. So it doesn&#39;t matter if you&#39;re on a non-MS desktop or a mobile device, you&#39;ll have to use the Microsoft app. No lock-in on the cloud? Do us a favour.\n It may be too late; Windows 11 will be everywhere soon. The rest of the industry is in disarray. But a new Rebel Alliance could be built, if the Googles and Salesforces and Amazons and Apples decide that living in a federation of states is preferable to seeing the whole lot go back under the four-pane logo of old. If Microsoft has the most to win, it also has the most to lose – Salesforce&#39;s Slack love is as a CRM channel, where it will end up getting the metrics and aggregated channels anyway. Google and Amazon have the reach and the infrastructure to sell conferencing services on the open market, with open access points. And they are creatures built from open standards, unlike Microsoft. Google won mobile by being open. If it showed any sign of understanding conferencing, that&#39;d be nice.\n Pinning your hopes on an uneasy alliance getting on a war footing before a focused opponent has already won is not how any sane person would make a better world. But the evidence for hope is there. Just ask the veterans of the last war, and listen when they say – there is a better way. ®\n    Thinking about upgrading to Debian Bullseye? Watch out for changes in Exim and anything using Python 2.x\n     The Debian Project has set a release date of 14 August for Debian 11, also known as Bullseye.\n  Debian is an important distribution in its own right, but also influential since it is the basis for many others including Ubuntu, Mint, Devuan, Knoppix, Tails, Raspbian, Pop!_OS, SteamOS and more.\n  In a post to the developer announcements mailing list, the release team  said: &#34;We plan to release on 2021-08-14.&#34; This is a little over two years since the release of Debian 10 &#34;Buster,&#34; which came out 6 July 2019. The testing release is now &#34;completely frozen&#34; other than to &#34;emergency bug fixes.&#34;\n  Continue reading\n  In brief Deepmind and the European Bioinformatics Institute released a database of more than 350,000 3D protein structures predicted by the biz&#39;s AI model AlphaFold.\n  That data covers the 20,000 or so proteins made in the human body, and is  available for anyone to study. The proteomes of 20 other organisms, from Zebrafish to E.coli bacteria, are also in there, too, and hundreds of millions of more structures will be added over time, we&#39;re told.\n  “In the hands of scientists around the world, this new protein almanac will enable and accelerate research that will advance our understanding of these building blocks of life,”  said DeepMind’s CEO Demis Hassabis. He hopes that it will be a valuable resource that will be used in the discovery of new drugs and our understanding of diseases.\n  Continue reading\n  For a true display of wealth, dab printer ink behind your ears instead of Chanel No. 5\n  Litre of the office essential costs as much as £2,410 – up from £1,700 in 2003, finds Which?\n     Printer ink continues to rank as one of the most expensive liquids around with a litre of the home office essential costing the same as a very high-end bottle of bubbly or an oak-aged Cognac.\n  Consumer advocate Which? has found that ink bought from printer manufactures can be up to  286 per cent more expensive than third-party alternatives.\n  Dipping its nib in one inkwell before delicately wiping off the excess on some blotting paper, Which? found that a multipack of colour ink (cyan, magenta, yellow) for the WorkForce WF-7210DTW printer costs £75.49 from Epson.\n  Continue reading\n  BORK!BORK!BORK! Windows XP is coming up to a 20th birthday yet it is heartening to see that the OS can still be guaranteed to take its place as one of the three horsemen of the borkpocalypse.\n  While not actually on a screen of blue, the ugly face of Windows XP has shown itself nestled between a CMOS error and another screen that has simply decided to end it all.\n  Continue reading\n  After staring over the precipice once before, Kent County Council considers £500m in outsourcing again\n     Kent County Council is inviting IT services companies and BPO specialists to bid for places on a £500m framework agreement set to offer a range of outsourcing services to the English public authority.\n  In  a contract notice published this week, the council put them market on notice to bid to be part of the cool half-billion deal, in the hope suppliers can &#34;improve efficiency, provide an agile and reliable solution that will transform and meet [the council&#39;s] business objectives.&#34;\n  The Framework Agreement for Managed Services is set to see &#34;the outsourcing [of] day-to-day management responsibilities and functions as a strategic method for transforming and improving business processes, through efficiencies, effectiveness and cutting operating costs,&#34; the notice said.\n  Continue reading\n  What is your greatest weakness? The definitive list of the many kinds of interviewer you will meet in Hell\n     Feature Having shown you some top tips on how people screw up their  CVs and  interviews, we now move to the weakest link: the interviewer. This article draws on my own experiences from grunt programmer, CTO to headhunter with many years in the recruitment game. Names have been obscured to protect the guilty.\n  Continue reading\n  Russia&#39;s Pirs ISS module scheduled to fall away, much like Moscow&#39;s interest in the space station\n  Troubled Nauka might actually make it after four orbit corrections – since we left work Friday\n     Russia&#39;s space agency spent the weekend trying to get one module to the International Space Station and deciding to ditch another.\n  The module Moscow wants is Nauka, which launched last week after decades of delays caused by problems with its propulsion systems, tank contamination, and component expiration.\n  Continue reading\n  Who, Me? Welcome to  Who, Me?, where hallowed ground gets trampled as a reader inadvertently cleans up the collective act of the senior staff.\n  Our story, told to us by &#34;Susan&#34; takes us back a quarter of a century to her time working for a well-known seller of mortgages in the UK (a firm that, for reasons that will become clear, will remain anonymous.)\n  Susan was ostensibly employed as a Visual Basic 6 and Microsoft SQL Server developer, as – let&#39;s face it – an awful lot of us were back then. Client/Server was where it was at, and Cloud Native was yet to trouble administrators.\n  Continue reading\n  Sponsored Remember when the only database in town was relational? Things have changed in 20 years. Today, the venerable old relational database management system (RDBMS) still presides, but the market is also filled with new database types designed for different kinds of jobs.\n  Database concepts predate the RDBMS, in the form of hierarchical and network databases, and even further back in the form of punched card collections. But it was really E.F Codd&#39;s relational concept, published in 1970, that ushered in the era of modern database computing. His concept of tables and rows separated the logical data model neatly from the underlying physical storage, and led to a flurry of database engines from the mid-seventies onwards.\n  The RDBMS was perfectly adequate for most applications for decades, but the seeds of change had already been planted. Just a year before Codd published his first paper, the Stanford Research Institute and UCLA exchanged the first ever internet message. That would eventually change everything, creating an internet that would morph computing forever, increasing applications&#39; scale and scope.\n  Continue reading\n  Tom Corn heads to Open Systems as Virtzilla hints its SmartNIC push has borne fruit\n     Tom Corn, until last week the company&#39;s Senior Vice President of Security Products, tweeted the news on Thursday.\n  Continue reading\n  DEF CON offers beginner-level Spot the Fed this year: He&#39;ll be on stage giving a keynote\n     In brief DEF CON&#39;s &#34;Spot the Fed&#34; game is going to be a little easier than usual this year: the head of the US government&#39;s Homeland Security is giving a keynote.\n  On Friday, the infosec conference organizers  confirmed Alejandro Mayorkas will give a talk on Friday, August 6. The news has left some DEF CON veterans perturbed.\n  Continue reading\n  The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2021-07-26 21:40:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,带有,thaas,teams", "title": "Windows 11 带有 THAAS，特洛伊木马即服务", "title_en": "Windows 11 comes bearing THAAS, Trojan Horse as a service", "transed": 1, "url": "https://www.theregister.com/2021/07/26/windows_11_comes_bearing_thaas/", "via": "", "real_tags": ["windows", "带有", "thaas", "teams"]}, {"category": "", "categoryclass": "", "imagename": "ddc91bf958930811152e9364c29dff7e.png", "infoid": 1069775, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在夏天，李子是我唯一的药膏。我不断被它的香味所吸引，花香多于果香。没有什么比咬一口又甜又凉的软李子更能让人恢复活力的了。我一直在种一棵李子树，这是我还能用一棵李子避暑的唯一原因。排水后，我把这些坑放在口袋里，我把它们种在分配给我的小后院里。只长了一个，但我的梅树每年夏天都会结果，每年夏天我都会从梅树上摘下来。我欣赏李子的本质，而不是它让我想起的东西。或者我不想忘记。我不想继续排水了。工业排水导致人死亡，而不是直接死亡。但是一旦你筋疲力尽，你就会进入一种先于存在的轻率状态。换句话说，这是死前的死。饥饿和口渴是不存在的。欲望被摧毁。之后，身体就无法运作。我看到它发生过一次。在我的第一天，一名年长的男子被推出设施。他的眼睛有些呆滞，仿佛一进一出的光都停止了。他已经完全清空了。排水是人类的自然过程。不可能抓住一切，每一个想法，每一个记忆。我们认为这些东西天生就是转瞬即逝的，但大脑实际上在幕后工作，选择放手和握住什么。但就像所有事情一样，有人学会了利用大脑浪费并收获智慧。人类自然的遗忘过程变成了人为的，而人为之后的往往是危险的。在你排水之前，你会积累。没有人会为一个没有受过教育的大脑买单，所以长大后，我们追逐智力。他们会说，一个空虚的大脑不能被清空。学校很残酷。每个人都想在班级中名列前茅。从事排水事业是赚大钱的最可靠方式，足以养活自己和家人，甚至未来的孩子。没有人知道你在精疲力竭的生活中没有机会生孩子。根本没有足够的思想能量来消耗。有时，我会在精神上延迟醒来——思想无法到达，有那么一瞬间，我完全空虚。这是一种可怕的感觉，就好像你漂浮在深渊中或只是从夜空中坠落。我从床上起来，我的腿因眩晕而冻僵。坠落的冲击让我的思绪回到原位。我吃一个李子，记住了甜蜜。我的脑海里充满了记忆，我突然想到明天是工作日，我将被带回另一次抽水。", "note_en": "In the summertime, plums are my only salve. I’m continually captivated by its fragrance, more flower than fruit. There is nothing more life-restoring than biting into a soft plum that’s sweet and cold.\n I’ve been growing a plum tree, the only reason I can still stave off the scorching heat with a plum. I kept the pits in my pocket after draining, and I planted them in the small backyard that was allotted to me. Only one grew, but my plum tree bears fruit every summer, and every summer I take from the plum tree. I appreciate the plum for what it is, and not what it reminds me of. Or perhaps I don’t want to forget. I don’t want to continue draining.\n Industrial draining killed people, not in a direct way. But once you’re drained, you enter a state of thoughtlessness that precedes existence. In other words, it’s death before death. Hunger and thirst do not exist. Desire is decimated. Afterwards, there is no way for the body to function.\n I saw it happen once. On my first day, and an older man was being wheeled out of the facility. His eyes were glassy, as if the light stopped entering and exiting all out once. He’d been fully emptied.\n Draining is a natural process for humans. It is impossible to hold onto everything, every thought, every memory. We think that these things are innately ephemeral but the brain is actually working behind the scenes, choosing what to let go and what to hold. But like everything, someone learned to capitalize on brain waste and harvest intelligence. The natural human process of forgetting becomes artificial, and often what follows the artificial is something dangerous.\n Before you drain, you accumulate. No one will pay for an uneducated brain, so growing up, we chased after intelligence. An empty brain can’t be emptied, they’d say. School was cutthroat. Everyone wanted to score top of the class. A career in draining was the surest way to make good money, enough to support oneself and one’s family and maybe even one’s future children. No one knew that you had no chance at children in a life of draining. There’s simply not enough thought energy to expend.\n Sometimes, I wake up with a mental delay – thoughts fail to arrive and for a brief moment, I am completely empty. It’s a scary feeling, as if you’re floating in an abyss or simply falling through the night sky. I get out of bed and my legs jello with vertigo. The shock of falling snaps my thoughts back in place. I eat a plum, and remember sweetness. My mind fills with memory, and it briefly occurs to me that tomorrow is a weekday, and I will be taken back for another draining.", "posttime": "2021-07-26 21:40:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "回忆,recollections,李子", "title": "甜蜜回忆——科幻小说", "title_en": "Sweet Recollections – A Science Micro Fiction", "transed": 1, "url": "https://twopagesdoublespaced.substack.com/p/sweet-recollections-fiction", "via": "", "real_tags": ["回忆", "李子"]}, {"category": "", "categoryclass": "", "imagename": "8707dbeb2d4c0c8cb68cc7883af7f28e.jpg", "infoid": 1069774, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "棒球有一个窃取标志的问题——或者至少是一个技术问题，看到阅读另一支球队的投球在技术上是合法的，但使用 Apple Watch 或长焦相机然后怀疑地敲打垃圾桶是非常不合法的。但很快，美国职业棒球大联盟可能会尝试用火扑灭：据 ESPN 报道，8 月 3 日，它计划开始测试一种加密的无线通信设备，该设备用按钮轻敲取代传统的手指闪光。该设备来自一家名为 PitchCom 的初创公司，将首先在 Low-A West 小联盟中进行测试。正如您对中继极其基本信号的东西所期望的那样，它并不是一个特别复杂的套件：一个用于接球手的腕带发射器，带有九个按钮来发出“所需的音高和位置”信号，它将加密的音频信号发送给接收器，可以挤进投手帽和接球手头盔。接收器使用骨传导技术，因此它们不一定需要贴在耳朵上，而且理论上可能更难窃听。 （骨传导会刺激您头部的骨骼，而不是发出可听见的声音。）话虽如此，但听起来引入这项技术可能会带来其他风险。以下是 ESPN 引用的限制清单： 发现在击球时佩戴接收器的球员将被驱逐；只允许主动接球手，其他球员或教练员不得使用发射器；提供备用发射器，但在比赛期间必须留在手提箱中；如果球员和教练因为设备问题而需要协商，他们可以通知裁判，而不会被收取参观土墩的费用。到目前为止，美国职业棒球大联盟似乎对这个想法持乐观态度。美联社获得的一份内部备忘录中写道：“PitchCom 设备在大联盟春季训练期间的边赛中进行了测试，球员、教练和前台工作人员的反馈非常积极。” “基于这些初步结果，我们乐观地认为，这些设备有可能成为一种可行的长期选择，以降低标志窃取风险并提高比赛节奏，尤其是对于二垒跑者。”我找不到一家名为 PitchCom 的初创公司的记录，但它的创始人之一 Craig Filicetti 似乎就是为魔术师和心理学家销售“ProMystic”无线技术的人，例如一盒蜡笔可以无线发送与某人取下的蜡笔相对应的信号。 ESPN 称 Craig Filicetti 和 John Hankins 是 Pitchcom 的共同所有人，两个同名的人于 2020 年 11 月成立了“JHCF, LLC”。 ProMystic 和 JHCF 都有一个共同的亚利桑那州斯科茨代尔地址。", "note_en": "Baseball has a sign stealing problem — or at least, a technological one, seeing how reading another team’s pitches  is technically legal, but  using Apple Watches or telephoto cameras and then  suspiciously banging on trash cans is very much not. But soon the MLB may try fighting fire with fire: on August 3rd, it plans to begin testing an encrypted wireless communication device that replaces the traditional flash of fingers with button taps,  according to  ESPN.\n The device, from a startup called PitchCom, will be tested in the Low-A West minor league first. As you’d expect from something that’s relaying extremely basic signals, it’s not a particularly complicated piece of kit: one wristband transmitter for the catcher with nine buttons to signal “desired pitch and location,” which sends an encrypted audio signal to receivers that can squeeze into a pitcher’s cap and a catcher’s helmet.\n The receivers use  bone-conduction technology, so they don’t necessarily need to be up against an ear, and might theoretically be harder to eavesdrop on. (Bone conduction stimulates bones in your head instead of emitting audible sound.) That said, it sounds like introducing the tech may come with other risks. Here’s a list of restrictions as cited by  ESPN:\n Players found to be wearing a receiver while batting will be ejected; only the active catcher, and no other players or coaches, is allowed to use the transmitter; a backup transmitter is provided, but it must remain in the carrying case during games; and if players and coaches need to confer because of an issue with the device, they can notify the umpires and not be charged a mound visit.\n MLB seems optimistic about the idea so far. “The PitchCom devices were tested in side-sessions during major league spring training, and the feedback from players, coaches, and front office staff was extremely positive,” reads part of an internal memo  obtained by the Associated Press. “Based on those preliminary results, we are optimistic that these devices have the potential to be a viable long-term option to reduce sign-stealing risk and improve pace of play, particularly with runners on second base.”\n   I wasn’t able to find records for a startup named PitchCom, but one of its founders, a Craig Filicetti, appears to be the same one  who sells “ProMystic” wireless tech for magicians and mentalists, such as a box of crayons that can wirelessly send a signal corresponding to the crayon that someone removes. ESPN cites Craig Filicetti and John Hankins as co-owners of Pitchcom, and two men by those names formed a “JHCF, LLC” in November 2020. Both ProMystic and JHCF have a Scottsdale, Arizona address in common.", "posttime": "2021-07-26 12:19:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "作弊,newest,设备", "title": "棒球最新的防作弊技术：用于接球手信号的加密发射器", "title_en": "Baseball's Newest Anti-Cheating Technology: Encrypted Transmitters for Catchers' Signals", "transed": 1, "url": "https://www.theverge.com/2021/7/25/22593363/mlb-baseball-sign-stealing-transmitter-pitchcom", "via": "", "real_tags": ["作弊", "newest", "设备"]}, {"category": "", "categoryclass": "", "imagename": "9fac4c0d8bdde5878b8a352da4ae2bb4.png", "infoid": 1069773, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周五，联邦贸易委员会要求联邦法官给它更多时间重新提起针对 Facebook 的反垄断诉讼，这是该机构控制大型科技力量的最大考验。在向美国哥伦比亚特区地方法院提交的文件中，该机构要求延长三周或至 8 月 19 日，以修改法院上个月驳回的诉讼。美国联邦贸易委员会在其请求中表示，它已与 Facebook 就拟议的延期达成协议。上个月，联邦法院的法官 James E. Boasberg 驳回了 FTC 的一项核心论点，称检察官未能提供足够有说服力的事实来支持这一说法——Facebook 垄断了社交网络。但法官给了 FTC 30 天的时间来重新提起诉讼。新的诉讼将是 FTC 新任主席、Facebook、谷歌和亚马逊的批评者莉娜·汗 (Lina Khan) 采取的第一个重大行动，她主张拆分数字平台。", "note_en": "The Federal Trade Commission on Friday asked a federal judge to give it more time to refile  an antitrust suit against Facebook that is the agency’s biggest test in reining in the power of big tech.\n In a filing with the U.S. District Court for the District of Columbia, the agency asked for a three-week extension, or until Aug. 19, to amend  a lawsuit that the court dismissed last month. The F.T.C. said in its request that it had reached an agreement with Facebook over the proposed extension.\n Last month, Judge James E. Boasberg of the federal court  knocked down a core argument made by the F.T.C., saying prosecutors had failed to provide enough persuasive facts to back up the claim — that Facebook holds a monopoly over social networking. But the judge gave the F.T.C. a 30-day window to refile its lawsuit.\n The new lawsuit will be the first major action by Lina Khan, the new chair of the F.T.C. and a critic of  Facebook, Google and Amazon who has advocated for the breakup of the digital platforms.", "posttime": "2021-07-26 12:19:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,facebook,法官", "title": "FTC 要求联邦法官延期至 8 月 19 日，以对 Facebook 提起最新的反垄断诉讼，并表示 Facebook 已同意该提议", "title_en": "FTC asks a federal judge for an extension until August 19 to file an updated antitrust suit against Facebook and says Facebook has agreed to the proposal", "transed": 1, "url": "https://www.nytimes.com/2021/07/23/technology/ftc-facebook-antitrust-lawsuit.html", "via": "", "real_tags": ["rust", "facebook", "法官"]}, {"category": "", "categoryclass": "", "imagename": "79d75208739ede5a29e67776c465102b.jpg", "infoid": 1069771, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据美联社报道，亚马逊的 Key for Business 系统已安装在美国各地的数千座建筑物中，该系统允许其送货司机进入公寓大楼而无需被人打扰。据报道，该公司正在推动将该系统安装在更多建筑物中，使用免费安装和 100 美元礼品卡的组合作为奖励。该系统旨在让亚马逊的司机更容易向公寓楼送货。司机无需被居民或礼宾人员蜂拥而至，而是可以使用该系统通过 Amazon Flex 应用程序临时访问大厅。然后包裹可以直接交付给居民或安全地留在邮件室或门卫。在 2019 年发布的系统技术故障中，亚马逊表示在一项试点计划中，该系统将首次交付的成功率从 96% 提高到 98% 左右。该技术于 2018 年作为试点推出，并于次年正式推出。但与亚马逊为房主安装在私人物业中的类似系统不同，商业钥匙是由建筑经理安装的，据报道，他们没有义务在系统使用时告诉他们的租户。这引发了居民对联网入口设备的潜在安全担忧，该设备可让经过亚马逊审查的司机轻松进入他们的建筑物。据报道，亚马逊正在努力扩大安装该系统的建筑物数量。据美联社报道，它正在向建筑物经理推销 Key for Business，并与锁匠合作提供安装服务，有时是免费的。亚马逊发言人无法立即回复 The Verge 的置评请求，并拒绝向美联社确认安装总数。除了使交付更容易和可能更快，该系统还可以让亚马逊的送货司机比竞争对手更具竞争优势。建筑物不太可能为多家快递公司安装类似的系统，最终会激励居民使用亚马逊。", "note_en": "Amazon’s  Key for Business, a system that allows its delivery drivers to gain access to apartment buildings without having to be buzzed in, has been installed in thousands of buildings across the US, according to  the  Associated Press. The company is reportedly pushing to get the system installed in more buildings, using a combination of free installations and $100 gift cards as incentives.\n The system is designed to make it easier for Amazon’s drivers to make deliveries to apartment buildings. Rather than having to be buzzed in by residents or a concierge, a driver can use the system to gain temporary access to lobbies via the Amazon Flex app. Then packages can be delivered directly to residents or safely left behind in a mail room or with a doorman. In a technical breakdown of the system  published in 2019, Amazon says in a pilot program the system increased the success of first time deliveries from 96 to around 98 percent.\n  The technology arrived as a pilot in 2018 before getting an official launch  the following year. But unlike a  similar system from Amazon for homeowners to install in private properties, Key for Business is installed by building managers who reportedly aren’t under any obligation to tell their tenants when the system is in use. This raises potential security concerns for residents about an internet-connected entry device that gives drivers, vetted by Amazon, easy access to their buildings.\n Amazon is reportedly pushing hard to expand the number of buildings the system is installed in. According to the  Associated Press, it’s pitching Key for Business to building managers and partnering with locksmiths to offer installations, sometimes free of charge. A spokesperson from Amazon was not immediately available to respond to a request for comment from  The Verge, and declined to confirm a total number of installations to  AP.\n As well as making deliveries easier and potentially quicker, the system may give Amazon’s delivery drivers a competitive advantage over its rivals. Buildings are unlikely to install similar systems for multiple delivery companies, ultimately incentivizing their residents to use Amazon.", "posttime": "2021-07-26 12:18:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,amazon,亚马逊,拥有,reportedly", "title": "据报道，亚马逊拥有美国数千栋公寓楼的“钥匙”", "title_en": "Amazon reportedly has a ‘key’ to thousands of apartment buildings in US", "transed": 1, "url": "https://www.theverge.com/2021/7/26/22593871/amazon-key-for-business-thousands-of-buildings-us-installation-incentives-privacy-concerns", "via": "", "real_tags": ["美国", "amazon", "亚马逊", "拥有"]}, {"category": "", "categoryclass": "", "imagename": "004cddb06cd4a9492d09279f495ed899.png", "infoid": 1069770, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在经济福利的背景下，网络保险将其与其他任何保险类型区分开来的关键事实是，它可以通过高效和经济的事件响应来限制和减少损失，就像没有消防队的消防队一样服务呢。然而，正如最新的 RUSI 报告 ( ) 所指出的那样，网络保险的理论福利增强特性在很大程度上尚未得到经验证明。从行业索赔方面的相同经验观点来看，一篇新论文分析了网络保险公司协调的事件响应的当前格局。作者丹尼尔伍兹在他在cyber-economics.com 上的第一篇客座文章中向我们提供了一份执行摘要。我们发现了一系列观点，认为保险公司已经创建了一个相当于 1833 年保险公司设立的统一消防队的网络安全队，以保护伦敦的（主要是投保的）财产，并且在 1865 年才作为公共服务和开支被接管。在网络保险的背景下，该行业通过为被保险人创建热线电话来发现攻击。然后，热线接线员组建了一个响应团队，涵盖法医调查、法律咨询和公共关系，他们迅速遏制了攻击并恢复了公司的业务运营。这些团队的效率特别高，因为保险公司会将工作交给少数几家建立信任并了解彼此流程的公司。我们称这种观点为事件响应的民主化。一种不同的观点集中在保险公司如何将工作引入其事件响应公司小组，通常不到 10 家公司。我们的研究发现，同样为数不多的 IR 公司重新出现在保险公司的面板上。那么为什么那些投资者关系公司会得到这么多工作呢？这些公司被加入专家组是因为它们同意以较低的小时费率提供服务，甚至为某些调查提供固定价格，并通过采用各种策略与保险公司建立了关系。一些投资者关系从业者认为，这些价格是不可持续的，并将质量赶出​​市场。事实上，许多内部投资者关系公司确实在使用风险投资资金运营。他们也往往是基于服务的公司，他们没有预先存在对受害者网络的访问权限，这使得数据捕获和保存变得棘手。这种担忧可以用“事件响应的商品化”一词来概括。保险公司是否既增加了对事件响应的访问，同时又降低了调查的平均质量？保险公司是否使事件响应民主化或商品化？我们如何调和这两种观点？像典型的学者一样，我认为两者都可以为保险公司提供有效的分类。政府设立应急热线，有效分配应急资源。操作员派出一个紧急程度不高的消防队从树上救出一只猫，但在接到发电厂火灾报告后，派出了一支包括预备役人员在内的消防队。保险公司在网络事件方面提供相同的功能。\n如果一家小型企业拨打热线电话询问企业电子邮件遭到入侵，则以固定价格聘请低成本的远程调查员。如果 MSSP 供应商受到威胁，导致数百家公司可能感染勒索软件，则需要更复杂的事件响应。这似乎是常识，但不清楚在网络保险出现之前是谁在协调这件事。事实上，小企业似乎有些束手无策。主流 IR 公司通常通过提供集成监控和响应解决方案来为拥有大量安全预算的公司提供服务。这些公司专门应对复杂的攻击，并且可以利用在受害者环境中安装产品所提供的复杂数据处理能力。公平的评论是，为网络保险公司工作的基于服务的公司无法轻易达到这种响应水平。但是，小型企业也无法承受这种程度的响应。因此，我们的研究发现，网络保险在两个主要方面影响了事件响应：（1）建立事件热线，通过对网络事件进行分类来协调响应资源； (2) 使 IR 业务模型成为可能，该模型可以为 IT 成熟度较低的公司提供服务，并且不依赖于预先存在的网络访问。这个故事应该值得庆祝，它确实类似于保险公司在 1800 年代创建了一个统一的伦敦消防队。然而，必须注意保险公司如何运作这种分类功能。首先，保险公司将 IR 公司添加到小组的内部流程通常是不透明的，这阻止了 IR 工作的公开竞争，导致少数公司获得大部分工作。其次，热线通常由律师事务所运营，他们在事件响应方面有自己的动机，可能优先考虑降低诉讼风险而不是技术风险。第三，与遵循事前计划相比，拨打热线可能不是最佳选择，尤其是因为在事件发生后无法建立数据收集和保存。 {2414728:GEMGH36Z};{2414728:B6N48DLF} 作者 asc 1 2265 MacColl、Jamie、Jason RC Nurse 和 James Sullivan。 2021. “网络保险和网络安全挑战”。 https://rusi.org/explore-our-research/publications/occasional-papers/cyber-insurance-and-cyber-security-challenge（2021 年 6 月 28 日）。伍兹、丹尼尔和雷纳·伯梅。 2021. 网络保险如何塑造事件响应：混合方法研究。 https://informationsecurity.uibk.ac.at/pdfs/DW2021_HowInsuranceShapes_WEIS.pdf。", "note_en": "In the context of economic welfare, the key fact of cyber insurance that sets it apart from likely any other insurance type is the possibility through efficient and economic incident response to limit and reduce damages acting as  the equivalent of a fire brigade where there is no such service yet. However, as pointed out by, for example, the latest RUSI Report ( ), the theoretical welfare enhancing properties of cyber insurance have for the most part yet to manifest empirically.\n Taking the same empirical view of the claims side of the industry, a new paper by   analyzes the current landscape of incident response coordinated by cyber insurance carriers. Author Daniel Woods is giving us in his first guest post on cyber-economics.com an executive summary.\n   We discovered set of perspectives arguing that insurers have created a cybersecurity equivalent of the unified fire brigade set up by insurance companies in 1833 to protect (mostly insured) properties in London and was only taken over as a public service and expense in 1865. In the context of cyber insurance, the industry did so by creating hotlines for insureds to call upon discovering an attack.  The hotline operator then assembles a team of responders spanning forensic investigation, legal advice, and public relations who rapidly contain the attack and restore the firm’s business operations.  These teams are especially efficient because insurers send work to a small number of firms who build up trust and knowledge of each other’s processes.  We call this perspective the democratization of incident response.\n A dissenting view focuses on how insurers funnel work to its panel of incident response firms, generally less than ten firms.  Our research discovered the same few IR firms re-appear on insurers’ panels.  So why do those IR firms get so much work?  Such firms are added to panels because they agree to provide services at a low hourly rate, even fixed prices for some investigations, and have built a relationship with insurers by employing various strategies.\n Some IR practitioners argue that these prices are unsustainable and drive quality out of the market.  Indeed, it is true that many insider IR firms are operating with venture capital funding.  They also tend to be service based firms who have no pre-existing access to the victim’s network, which makes data capture and preservation tricky.  Such concerns can be summarised by the term “the commoditisation of incident response.”\n  Did insurers both increase access to incident response while simultaneously have reducing the average quality of investigation?  Did insurers democratise or commoditise incident response?  How can we reconcile the two perspectives?  Like a typical academic, I argue both can be true providing insurers triage effectively.\n Governments set up emergency hotlines in order to effectively distribute emergency resources.  The operator sends one fire brigade with low urgency to rescue a cat from a tree, but sends a fleet of fire brigades including reservists upon a report of a power plant fire.  Insurers are providing the same function when it comes to cyber incidents.\n If a small business calls the hotline about a business email compromise, then a low-cost remote investigator is engaged at a fixed price.  If a MSSP vendor is compromised leading to the potential of ransomware infections at hundreds of firms, then a more sophisticated incident response is required.  This seems like common sense but it is not clear who was coordinating this before cyber insurance came along. In fact, it seems like small businesses were left somewhat stranded.  Mainstream IR firms commonly served companies with large security budgets, often by offering integrated monitoring and response solutions.  Such firms specialised in responding to sophisticated attacks and could draw on the sophisticated data processing capabilities provided by having products installed in the victim’s environment.  It is a fair comment that service-based firms working for cyber insurers cannot easily match this level of response.  But it is also true that small businesses cannot afford this level of response.\n  Thus, our study finds that cyber insurance has shaped incident response in two main ways: (1) establishing incident hotlines that coordinate response resources by triaging cyber incidents; (2) making possible an IR business model that can serve firms with low IT maturity and that does not rely on pre-existing network access.  This story should be celebrated and is indeed similar to insurers’ creating a unified London fire brigade in the 1800s.\n Nevertheless, attention must be paid to how insurers operate this triage function.  First, the internal processes by which insurers add IR firms to panels are often opaque and this prevents open competition for IR work leading a small number of firms to get the majority of work.  Secondly, hotlines are often operated by law firms who have their own incentives when it comes to incident response, likely prioritising mitigating litigation risk over technical risk.  Thirdly, calling a hotline is likely sub-optimal compared to following an ex-ante plan, not least because data collection and preservation cannot be established after the incident has already occurred.\n   {2414728:GEMGH36Z};{2414728:B6N48DLF}    author  asc                1        2265 MacColl, Jamie, Jason R C Nurse, and James Sullivan. 2021. “Cyber Insurance and the Cyber Security Challenge.”  https://rusi.org/explore-our-research/publications/occasional-papers/cyber-insurance-and-cyber-security-challenge (June 28, 2021).\n Woods, Daniel, and Rainer Böhme. 2021.  How Cyber Insurance Shapes Incident Response: A Mixed Methods Study.  https://informationsecurity.uibk.ac.at/pdfs/DW2021_HowInsuranceShapes_WEIS.pdf.", "posttime": "2021-07-26 12:17:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "保险,insurance", "title": "网络保险事件响应：市场趋于商品化", "title_en": "Cyber Insurance Incident Response: Market tends towards commoditization", "transed": 1, "url": "https://www.cyber-economics.com/2021/07/26/cyber-insurance-incident-response-market-tends-towards-commoditization-with-competitive-prices-increasing-vc-and-m-cyber-insurance-has-built-an-overall-effective-system-to-help-especial/", "via": "", "real_tags": ["保险", "insurance"]}, {"category": "", "categoryclass": "", "imagename": "91b1321138ef2cc47063b556aa6f6dde.png", "infoid": 1069769, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从我开始下国际象棋以来，成为国际象棋大师是我的梦想。这个称号得到了广泛的认可，甚至在国际象棋界之外。几乎无论你走到哪里，人们都会听说“国际象棋大师”是一个精英和享有盛誉的头衔。虽然大多数人都知道宗师头衔享有盛誉，但许多人并不知道它的具体内容。最后，我会给你一些关于你获得 GM 头衔的个人建议 特级大师 (GM) 头衔是国际象棋中存在的最高头衔。它由国际象棋联合会（FIDE）颁发给棋手，国际象棋联合会是国际象棋的管理机构。一旦达到，大师称号将终身持有。国际大师 (IM)、Fide 大师 (FM) 和候选大师 (CM) 等鲜为人知的头衔也是如此。这些头衔的获得方式类似，但标准更简单。在成为特级大师之前，通常会先获得 Fide Master 和 International Master 的称号。虽然女性和男性都可以成为大师，但也有专为女性指定的头衔。\n这些是女子特级大师 (WGM)、女子国际大师 (WIM)、女子 Fide 大师 (WFM) 和女子候选大师 (WCM)。获得这些头衔的障碍较低，因为参加国际象棋比赛的女性人数要少得多。虽然第一个需要一致性，但第二个需要在 3 个不同的锦标赛中取得出色的成绩。也有国家评级，就像网球一样，但对于国际冠军头衔，如特级大师头衔，只有 FIDE 评级才算数。正常的起始评级约为 1400 FIDE。该参赛等级取决于玩家在参加的第一级锦标赛中的表现。从那时起，每个玩家在他们玩的每场锦标赛游戏中都会赢得或失去等级分。在国际象棋生涯开始时，每场比赛最多可以赢或输 40 个评分点。从 2400 FIDE 开始，每场比赛最多只能赢或输 9.2 个评分点。\n一个人输或赢的点数取决于对手各自的等级。对手的评分越高，赢得的评分点数就越多。对手等级越低，输的越多！要获得特级大师头衔的第一个标准，球员在职业生涯的任何时候都需要拥有 2500 或更高的 FIDE 评分！在撰写本文时，2500 FIDE 评级将使您在世界排名中排名第 800。所有在线国际象棋爱好者的重要免责声明：2500 FIDE 不等于任何在线国际象棋比赛网站上的 2500。在线帐户数以百万计，这些评级被高度夸大了！除了 2500 国际棋联评级，一个人必须得分 3 宗师规范。此规则有一些例外。事实上，FIDE 手册中有一个完整的章节专门用于国际冠军规则（包括规范）。所以总的来说，一个玩家至少需要在2600级上玩27场比赛（3×9）才能获得大师称号！这远高于人们需要达到的 FIDE 评级 2500。这意味着特级大师必须展现出巨大的潜力并超越他们的评级才能获得享有盛誉的头衔。\n您可以借助对手的平均评分和您的分数来计算评分表现。一个简单的例子如下：如果你对着平均评分为 2600 的对手得分为 50%（9 场比赛中的 4.5 分），那么你的表现就是 2600。当你的得分与他们相等时，你的表现就等于他们的平均评分！您的对手的评分越低，您需要获得更多的分数才能获得 2600 的评分表现。反之亦然。在撰写本文时，世界上有 1939 位大师。我从维基百科的一篇文章中获取了此信息，该文章似乎更新得很好：2021 年新增了 9 名。世界排名前 27 位的球员获得了这一享有盛誉的称号。其中一位是前世界冠军米哈伊尔·博特维尼克，他是我有史以来最喜欢的国际象棋选手之一。直到 1967 年，第 100 位国际象棋大师才加冕用了 17 年的时间。在最初的 50 年（直到 1999 年），有 774 名棋手能够达到国际象棋冠军的顶峰。这意味着从 2000 年到 2021 年，共有 1165 名玩家获得了特级大师称号。这是每年大约 60 位新大师的速度！\n尽管如此，我们谈论的活跃国际象棋玩家的比例非常小。据估计，全世界有 5 亿甚至 10 亿国际象棋棋手。随着当前的在线国际象棋热潮，这些数字很可能正在上升。在这数以百万计的国际象棋爱好者中，真正下棋的只有一小部分。在撰写本文时，超过 360&#39;000 名玩家正在积极下棋！准确地说，在 FIDE 数据库中可以找到 367&#39;398 名成员。这意味着大约 0.5% 的活跃国际象棋玩家获得了大师称号。在这里，我们只计算 2021 年所有活跃的国际象棋棋手。 考虑到自 1950 年以来的所有棋手并且不再活跃，可以公平地说，可能只有不到 0.1% 的棋手曾经下过棋。 FIDE 赛事正在达到特级大师称号。关于为什么女性国际象棋大师如此之少，有很多理论。仅此一项就可以填充未来的文章，所以我现在不想进入它。我只想指出两点：\n女性棋手少得多，所以女性 GM 的减少是合乎逻辑的，我绝对不相信这与生物学有关。那些说“女性只是不那么聪明”或诸如此类的胡说八道的人生活在岩石下，而不是在 21 世纪。第一个是 GM Maurice Ashley（美国）。我只能在我最喜欢的播客 The Tim Ferriss Show 上推荐他的采访。其他三个是 Pontus Carlsson (SWE)、Amon Simutowe (ZAM) 和 Kenny Solomon (RSA)。很遗憾不得不提，但这绝对与他们的种族无关，而是与机会有关。我相信，有了更多的机会，更多的非洲出生的棋手会尝试克服成为国际象棋大师的挑战。大多数活跃的大师都住在俄罗斯。多达 256 位大师在俄罗斯国旗下注册。美国有 101 位现役特级大师，而德国有 96 名特级大师。随着互联网带来的新可能性以及所有不同语言版本的好书，许多国家至少有一位大师。\n在 FIDE 最佳国家名单中，我统计了 88 个（！）不同国家至少拥有一名特级大师的数量之多。尽管俄罗斯仍然拥有最多的国际象棋大师。他们在整体 GM 中的比例越来越小。世界上最年轻的特级大师的记录刚刚被美国阿比曼尤·米什拉打破，年仅 12 岁 4 个月零 25 天。只需再读一遍并考虑一下。一个12岁的男孩达到了国际象棋世界的最高称号！虽然我自己也是宗师，但这也远超我的想象。当我和他一样大的时候，我刚开始的 FIDE 评分是 1918 年。我又花了 8 年时间才获得特级大师头衔。如果你想了解更多关于破纪录的年轻人，你可以阅读这篇文章。正如我所说，我花了大约 8 年的时间才获得特级大师称号。而具有讽刺意味的是，这实际上是一项全国纪录！我是有史以来最年轻的瑞士国际象棋特级大师，只有 20 岁零 6 个月。这显示了国际象棋竞技文化的巨大差距。\n如果您已超过 20 岁，但仍希望获得更多希望，那么还有其他极端情况。 Enrico Paoli 被授予荣誉特级大师称号，享年 88 岁！ Janis Klovans 在 62 岁时赢得了高级世界锦标赛，从而获得了特级大师称号。这只是绅士们在晚年达到事业顶峰的两个非凡故事。如果您有动力争取国际象棋最高冠军头衔，我想给您一些建议。这是我向您推荐的内容，以便有机会获得世界上最高的头衔。距离大师称号还有很长的路要走。准备好面对许多挫折、障碍和失望。如果它很容易，那么会有更多的人到达它！这就是为什么你需要与你的训练保持一致。不是一两个星期，而是多年一致。甚至可能是十年或更长时间。我接触到我的第一块棋子的那一刻是在 2006 年左右。 10 多年后，我在 2017 年获得了特级大师称号。这些年来，我几乎没有一周没有下国际象棋。不过，我并没有完全沉迷于它。\n我仍然完成了高中的学习，做了一些正常的青少年事情。你不必放弃其他一切，但你应该不断地紧张你的大脑以提高你的国际象棋。如果你每天工作 10 小时 2 个月，没有人会在意。那不会持久。确保每天工作 2 小时，持续 10 年。然后你会看到真正的进步！您可能会想考虑中间的所有步骤，并开始关注您的评级。但这是错误的做法。在如此漫长的旅程中，过程和学习曲线比立竿见影的结果重要得多。告诉自己：如果我能拿到 GM 的头衔，我不在乎如果我在 3 年前赢得这场比赛/锦标赛会怎样。我只会关心让我获得 GM 头衔的知识。因此，与其执着于短期结果，不如开始考虑过程和您的学习曲线。做出的决定可能会在短期内付出一定的代价，但会在以后为您提供宝贵的学习经验。只有采取长期的方法，您才有机会达到国际象棋特级大师头衔这样大的目标。\n如果您想了解更多关于这种方法的信息，我已经写了一篇关于该主题的非常个人化的文章。努力工作这么长时间可能会失去乐趣。不要让这种情况发生。如果你不喜欢这个过程，那么实现目标就不值得。我再说一遍：如果你不喜欢这个过程，即使达到目标也不值得。如果你继续这个旅程，那么一定要带上一些人。这可以是培训伙伴、教练、心理学家、朋友、家人的形式，或者只是通过阅读书籍。这将是一段很长的路，如果你不是一个人在旅途中会更有趣。在糟糕的日子或可怕的失误之后，你会喜欢有一个能理解你情绪的人陪着你。有一句古老的非洲谚语说：如果你想走得快，就一个人走。想走远，就一起走。戈尔\n最重要的是，当您可以与他人分享您的成功时，生活会变得更加有趣。因此，请确保以书籍为导师，与您一起训练的人，获得可以指导您的教练，并与朋友和家人一起寻求情感支持。最终目标不是达到大师称号，而是过上有价值的生活。如果这包括大师称号，那么我祝你好运！如果您有任何问题，请通过邮件与我联系。我通过邮件回答所有问题。没有例外。或者继续阅读博客上的其他文章。我相信你会找到适合你的情况和个性的东西。 PS：如果你喜欢这篇文章，你也会喜欢我的免费指南来组织你的国际象棋训练。在此处获取。", "note_en": "Since I started to play Chess, it was my dream to become a Chess Grandmaster. This title has wide recognition, even outside the Chess World. Nearly wherever you go, people will have heard of “Chess Grandmaster” as an elite and prestigious title.\n While most people know the Grandmaster title is prestigious, many do not know the specifics about it.\n  And to finish it off I will give you some personal advice on your journey to the GM title\n   The Grandmaster (GM) title is the highest title that exists in Chess. It is given to a Player by the  International Chess Federation (FIDE), the governing body of competitive Chess.\n Once achieved, the Grandmaster title is held for life. The same goes for the less known titles of International Master (IM), Fide Master (FM), and Candidate Master (CM).\n These titles are earned similarly but simply have easier criteria. Before becoming a Grandmaster, one usually gets the titles of Fide Master and International Master first.\n While both Women and Men can become Grandmasters, there are also exclusive titles designated only for Women.\n Those are Women Grandmaster (WGM), Women International Master (WIM), Women Fide Master (WFM), and Woman Candidate Master (WCM).\n The barriers to reach those titles are lower since there are much fewer Women playing Chess competitively.\n   While the first one needs consistency, the second one needs spectacular results in 3 different tournaments.\n     There are also national ratings, much like in Tennis, but for international titles such as the Grandmaster title, only the FIDE rating counts.\n A normal starting rating is around 1400 FIDE. This entry rating depends on the performance in the first-rated tournament that a player participates in.\n From then on, each player wins or loses rating points with every tournament game they play.\n At the beginning of a Chess career, one can win or lose up to 40 rating points per game. From 2400 FIDE onwards, one can win or lose only up to 9.2 rating points per game.\n  The amount of points one loses or wins depends on the respective rating of the opponent. The higher-rated the opponent, the more rating points one can win. The lower-rated the opponent, the more one can lose!\n To get the first criteria for the Grandmaster title, a player needs to have a 2500 or higher FIDE rating at any point in their career!\n At the moment of writing, 2500 FIDE rating would place you at number 800 on the World rankings.\n     Important disclaimer for all Online Chess addicts: 2500 FIDE does not equal 2500 on any online Chess-playing site. With millions of accounts online, these ratings are highly inflated!\n    In addition to the 2500 FIDE rating, one has to score 3 Grandmaster norms. There are some exceptions to this rule. As a matter of fact, there is a full  chapter in the FIDE Handbook designated for international title regulations (including norms).\n     So in total, a player needs to play at least 27 games (3×9) on the level of 2600 to achieve the Grandmaster title! This is considerably higher than the FIDE rating of 2500 that one needs to achieve.\n This means a Grandmaster must show a big potential and over-perform their rating to get the prestigious title.\n You can calculate the rating performance with the help of the average opponent rating and your score. An easy example is the following:\n If you score 50% (4.5 points out of 9 games) against opponents with an average rating of 2600, you performed at 2600. As you equaled them in the score, your performance equals their average rating!\n The lower your opponents are rated, the more points you need to score to achieve a 2600 rating performance. And vice versa.\n     At the time of writing, there are 1939 Grandmasters in the World. I took this information from a  Wikipedia article that seems very well updated: there are 9 additions in 2021.\n  The top 27 Players in the World got awarded this prestigious title. One of them is former World Champion Mikhail Botvinnik, one of my favorite Chess Players of all time.\n  It took 17 years until 1967 for the 100th Chess Grandmaster to be crowned. In the first 50 years (until 1999), 774 players were able to reach the pinnacle of Chess titles.\n This means that from the year 2000-2021 a massive 1165 players got awarded the Grandmaster title. This is a rate of around 60 new Grandmasters every year!\n Still, we are talking about a very tiny percentage of active Chess players. Estimations go from 500 Million to even 1 Billion Chess players all over the World. With the current online-Chess boom, these numbers are most probably on the rise.\n Of those millions of chess enthusiasts, only a tiny percentage is really playing competitive Chess. At the time of writing, over 360’000 players are actively playing Chess!\n To be precise 367’398 members are to be found in the  FIDE database.\n This means that around 0,5% of the active Chess players get the Grandmaster title. And here we are only counting all the active Chess players in 2021.\n Taking into account all the players that played since 1950 and are not active anymore,\n it is fair to say that probably less than 0,1% of Chess players that ever played a FIDE event are reaching the Grandmaster title.\n    There are many theories as to why there are so few female Chess Grandmasters. This alone could fill a future article, so I don’t want to get into it now. Only two things I want to point out:\n There are much fewer female Chess players, so it is logical that there are less female GM’s\n I am definitely not believing that is has to do something with Biology. People telling “female are just less smart” or some bullshit like that are living under a rock and not in the 21st century.\n     The first was  GM Maurice Ashley (USA). I can only recommend his  interview on my favorite podcast,  The Tim Ferriss Show. The other three are Pontus Carlsson (SWE), Amon Simutowe (ZAM), and Kenny Solomon (RSA).\n It is sad that I have to mention it, but it has absolutely nothing to do with their race, but with opportunities.\n I am sure that with more opportunities, more African-born players will try and overcome the Challenge of being a Chess Grandmaster.\n    Most active Grandmasters are living in Russia. A whopping  256 Grandmasters are registered under the Russian Flag. The United States of America has 101 active Grandmasters, while 96 Grandmasters are playing for Germany.\n With the new possibilities via the Internet and great books available in all different languages, many countries have at least one Grandmaster to their name.\n In the  FIDE list of best countries, I counted an incredible amount of 88(!) different countries that have at least one Grandmaster.\n Even though Russia still has the most Chess Grandmasters. their percentage of overall GM’s is getting smaller and smaller.\n     The record of the youngest Grandmaster in the World has just been broken on by  Abhimanyu Mishra (USA) at the tender age of 12 years, 4 months, and 25 days.\n Just read it again and think about it. A 12-year-old boy reached the highest title in the Chess World! Even though I am a Grandmaster myself, this is way beyond my imagination.\n When I was his age I just started out with a FIDE rating of 1918. It took me another 8 years to reach the Grandmaster title. If you want to know more about record-breaking youngsters, you can read  this article.\n As I said, it took me about 8 years longer to get the Grandmaster title. And the irony of it is that this is actually a national record!\n I am the youngest ever Swiss Chess Grandmaster with 20 years and 6 months. This shows the huge gap in chess competitive cultures.\n If you are over 20 and would still like some more hope, there are other extremes as well.\n Enrico Paoli was awarded the honorary Grandmaster title at age 88!  Janis Klovans won the Senior World Championship aged 62 and thus got awarded the Grandmaster title.\n These are just two exceptional stories of gentlemen that have been able to reach the pinnacle of their careers very late in their lives.\n    In the case you are feeling the motivation to work towards the highest title in Chess, I want to give you some advice. Here is what I would recommend to you in order to have a chance at the highest title in the World.\n    It will be a long road until the Grandmaster title. Be prepared to face a lot of setbacks, roadblocks, and disappointments. If it was easy, then many more people would have reached it!\n That is why you need to be consistent with your training. Not for a week or two, but consistent for years. Maybe even for a decade or more.\n The moment I touched my first Chess piece was around 2006. More than 10 years later, in 2017 I achieved the Grandmaster title. Over these years, I barely spent a week without Chess. I was not totally obsessed with it though.\n I still finished High-school and did some normal teenage things. You don’t have to abandon everything else, but you should consistently strain your brain in order to improve your Chess.\n Nobody cares if you work 10 hours/day for 2 months. That does not last. Make sure to work 2 hours/day for 10 years. Then you will see real progress!\n    You might get tempted to think about all the steps in between and start to obsess about your rating. But that is the wrong way of going at it.\n On such a long journey, the process and the learning curve are so much more important than immediate results.\n Tell yourself: If I ever reach the GM title, I will not care what if I won this game/tournament 3 years ago. I will only care what I learned that brought me to the GM title.\n So instead of obsessing about short-term results, start to think about the process and your learning curve. Take decisions that might cost some rating in the short-term, but will give you invaluable learning experience later on.\n Only by taking the long-term approach, will you ever have a chance of reaching a goal so big as the Grandmaster title in Chess.\n If you want to know more about this approach, I have written  a very personal article on that topic.\n    Working hard for such a long time might take the fun out of things. Don’t let that happen. If you do not enjoy the process, reaching the goal will not make it worth it.\n    I say it again: if you don’t like the process, even reaching the goal will NOT make it worth it.\n    If you go on this journey, then make sure to take some people with you. This can be in a form of Training Partners, Coaches, Psychologists, Friends, Family, or simply by reading books.\n It will be a long way and it is much more fun if you are not alone on your journey. On bad days or after horrible blunders, you will love to have someone with you that can understand your emotions.\n There’s an old african proverb that says: if you want to go quickly, go alone. If you want to go far, go together.\n Al Gore\n Above all, life is more fun when you can share your success with somebody else.\n So make sure to take books as your mentors, have people you train with, get a Coach that can guide you, and take along friends and family members for emotional support.\n The end goal isn’t reaching the Grandmaster title, it is living a worthwhile life. And if that includes the Grandmaster title, then I wish you the best of luck!\n If you have any questions, just contact me via Mail. I answer all questions via Mail. No exceptions. Or just continue reading other articles on the Blog. I am sure you will find something that fits your situation and personality.\n  PS: If you like this article, you will also like my  FREE Guide to organize your Chess Training. Get it  HERE.", "posttime": "2021-07-26 12:17:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "国际象棋,chess", "title": "成为国际象棋大师", "title_en": "Becoming a Chess Grandmaster", "transed": 1, "url": "https://nextlevelchess.blog/how-to-become-a-grandmaster-in-chess/", "via": "", "real_tags": ["国际象棋", "chess"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069764, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "避免使用设备制造商知道您的私钥的设备。例如 Keyois Capsule、Cold Storage Coins 和 Ballet Crypto。在某些情况下，制造商可以创建安全的 BIP38 加密备份。您是希望我测试您的产品的设备制造商吗？给我发一条信息！", "note_en": "Avoid using devices where the device manufacturer knows your private key. Such as Keyois Capsule, Cold Storage Coins, and Ballet Crypto. In some cases it’s possible to have a manufacturer create a BIP38 encrypted backup, which is safe.\n Are you a device manufacturer who would like me to test your product?  Send me a message!", "posttime": "2021-07-26 11:29:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "储存,storage,设备", "title": "种子储存设备 - 压力测试和评论", "title_en": "Seed storage devices - stress tests and reviews", "transed": 1, "url": "https://jlopp.github.io/metal-bitcoin-storage-reviews/", "via": "", "real_tags": ["储存", "storage", "设备"]}, {"category": "", "categoryclass": "", "imagename": "acf5445dc188f08b0545a9555f974c71.jpg", "infoid": 1069763, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "天气是一门棘手的科学——在非常高的高度更是如此，混合了等离子体和中性粒子。在平流层突然变暖 (SSWs) 中——与极地涡旋相关的大型气象扰动，其中极地平流层温度随着极地周围风的影响而升高——极地涡旋减弱。 SSW 在很远的地方也会对大气产生深远的影响，导致与原始 SSW 位置相反的半球发生变化——变化一直延伸到热层和电离层的上部。麻省理工学院海斯塔克天文台的 Larisa Goncharenko 及其同事于 7 月 16 日在《地球物理研究快报》上发表的一项研究通过研究在北美和欧洲上空观察到的高层大气变化，研究了最近一次主要的南极 SSW 对北半球的影响。在 SSW 引起的异常中，极点的变化会导致对侧半球的变化。这种重要的半球间联系被确定为海拔超过 100 公里的剧烈变化——例如，总电子含量 (TEC) 测量以及热层 O/N 2 比率的变化。 SSW 在北极上空更为频繁；这些导致南半球的 TEC 和其他相关异常，因此对这种联系进行了更多观察。由于南极 SSW 不太常见，因此研究其对北半球影响的机会较少。然而，北半球较高密度的 TEC 观测地点允许在这些高层大气异常确实发生时对其进行精确测量。 2019 年 9 月，南极洲发生了一次破纪录的极端 SSW 事件。 Goncharenko 及其同事发现，此次事件发生后，北半球中纬度地区的高层大气发生了重大变化；该地区的观测数据比南半球多。这些变化不仅在严重性上显着，而且因为它们仅限于狭窄的（20-40 度）经度范围，在北美和欧洲之间有所不同，并且持续了很长时间。在上图中，红色区域显示了下午 TEC 水平在北美和欧洲上空的变化；红色表示与基线常规水平相比最多增加 80%，蓝色表示与常规水平相比最多下降 –40%。这种 TEC 转变在整个 2019 年 9 月在美国西部持续存在，但在欧洲是短暂的，表明存在不同的机制。作者认为，热层纬向（东西）风的变化是区域之间差异的原因之一。另一个因素是磁偏角的差异；在赤纬较大的地区，纬向风可以更有效地将等离子体输送到更高或更低的高度，从而导致等离子体密度的增加或减少。\n需要更多的研究来确定这些因素在多大程度上影响极地平流层事件与相反的近地空间之间的联系。鉴于南极 SSW 的相对稀有性和南半球电离层数据的稀少性，这些研究仍然是一个挑战。更多信息：Larisa P. Goncharenko 等人，2019 年 9 月南极平流层突然变暖对北美和欧洲中纬度电离层和热层的影响，地球物理研究快报（2021 年）。 DOI：10.1029/2021GL094517", "note_en": "Weather is a tricky science—even more so at very high altitudes, with a mix of plasma and neutral particles.    In sudden stratospheric warmings (SSWs)—large meteorological disturbances related to the polar vortex in which the polar stratosphere temperature increases as it is affected by the winds around the pole—the polar vortex is weakened. SSWs also have profound atmospheric effects at great distances, causing changes in the hemisphere opposite from the location of the original SSW—changes that extend all the way to the upper thermosphere and ionosphere.\n  A study published on July 16 in  Geophysical Research Letters by MIT Haystack Observatory&#39;s Larisa Goncharenko and colleagues examines the effects of a recent major Antarctic SSW on the Northern Hemisphere by studying changes observed in the upper atmosphere over North America and Europe.\n  In an SSW-caused anomaly, changes over the pole cause changes in the opposite hemisphere. This important interhemispheric linkage was identified as drastic shifts at altitudes greater than 100 km—for example, in total electron content (TEC) measurements as well as variations in the thermospheric O/N 2 ratio.\n  SSWs are more frequent over the Arctic; these cause TEC and other related anomalies in the Southern Hemisphere, and thus more observations have been made on this linkage. Since the Antarctic SSWs are less common, there are fewer opportunities to study their effects on the Northern Hemisphere. However, the greater density of TEC observation locations in the Northern Hemisphere allows for precise measurement of these upper atmospheric anomalies when they do occur.\n  In September 2019, an extreme, record-breaking SSW event occurred over Antarctica. Goncharenko and colleagues found significant resulting changes in the upper atmosphere in mid-latitudes over the Northern Hemisphere following this event; more observations are available for this region than in the Southern Hemisphere. The changes were notable not only in severity, but also because they are limited to a narrow (20–40 degrees) longitude range, differ between North America and Europe, and persist for a long time.\n  In the figure above, red areas show where TEC levels are shifted over North America and Europe in the afternoon; red indicates an increase of up to 80 percent versus the baseline regular levels, and blue indicates a decrease of up to –40 percent versus regular levels. This TEC shift persisted throughout September 2019 over the western United States, but was short-lived over Europe, indicating different mechanisms at play.\n  The authors suggest that a change in the thermospheric zonal (east–west) winds are one reason for the variance between regions. Another factor is differences in magnetic declination angles; in areas with greater declination, the zonal winds can more efficiently transport plasma to higher or lower altitudes, leading to the build-up or depletion of plasma density.\n  More study is needed to determine the precise extent to which these factors affect the linkage between polar stratospheric events and near-Earth space in the opposite  . These studies remain a challenge, given the relative rarity of Antarctic SSWs and sparse availability of ionospheric data in the Southern Hemisphere.        More information:\t\t\t\t\t\t\t\t\t\t\t\tLarisa P. Goncharenko et al, Impact of September 2019 Antarctic Sudden Stratospheric Warming on Mid‐Latitude Ionosphere and Thermosphere over North America and Europe,  Geophysical Research Letters (2021).  DOI: 10.1029/2021GL094517", "posttime": "2021-07-26 11:29:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "影响,stratospheric,变化", "title": "平流层突然变暖如何影响北半球", "title_en": "How a sudden stratospheric warming affected the Northern Hemisphere", "transed": 1, "url": "https://phys.org/news/2021-07-sudden-stratospheric-affected-northern-hemisphere.html", "via": "", "real_tags": ["影响", "变化"]}, {"category": "", "categoryclass": "", "imagename": "b81313d3b326dc31542a94949f9aebb8.jpg", "infoid": 1069761, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "丰富的娱乐资源，共有 10,711 张打孔卡。 — 由大众提供：werk 数字图书馆。有趣的事实：您实际上可以在 Virtual Card Read-Punch 中将这些卡片扫描回文本。如果你喜欢这个东西，你可以考虑通过喝一点咖啡来支持我的努力：", "note_en": "A lush source of entertainment, in 10,711 punch cards total. — Brought to you by mass:werk Digital Library.\n          Fun fact: You may actually scan these cards back to text at the the  Virtual Card Read-Punch.\n  If you like this stuff, you may consider supporting my efforts by fueling me by a bit of coffee:", "posttime": "2021-07-26 10:42:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "书呆子,nerdy,资源", "title": "书呆子阅读", "title_en": "Nerdy Reading", "transed": 1, "url": "https://www.masswerk.at/nowgobang/2021/nerdy-reading", "via": "", "real_tags": ["书呆子", "nerdy", "资源"]}]