[{"category": "", "categoryclass": "", "imagename": "49030cad6d75dc90e6a7bcbebd540a3c.jpeg", "infoid": 1070953, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据公司博客文章称，Mercury 是一家为初创公司提供软件和银行服务的公司，宣布筹集由 Coatue 领投的 1.2 亿美元 B 轮融资。该公司表示将利用这笔资金扩大其团队，并继续开发帮助客户扩展业务的产品。目前，Mercury 在 14 个城市拥有 150 多名员工，比去年同期增加了 35 名。据《财富》杂志报道，Mercury 还为未经认证的投资者预留了 500 万美元的资金，监管机构从 3 月份的 100 万美元筹集了资金。考虑到 B 系列推动 Mercury 超过 10 亿美元的估值并进入独角兽状态，该公司无疑将迅速填补该社区部分（可在 Wefunder 获得）。 Andreesen Horowitz (a16z)、CRV 和 Sapphire Ventures 也参与了本轮融资，个人投资者 Dylan Field（Figma 首席执行官）、Mathilde Collins（Front 首席执行官）、Akshay Kothari（Notion 首席运营官）、Jack Altman（首席执行官）在 Lattice）、Hunter Walk 和 Satya Patel（Homebrew 的合伙人）和 Elizabeth Yin（Hustle Fund 的合伙人）。 Mercury&#39;s 使小型企业和初创公司能够将一系列金融服务纳入其业务，包括 FDIC 保险账户、实体和虚拟卡、电汇、ACH、支票、现金管理和 API 集成。该公司目前与 200 多个国家的客户合作，有超过 40,000 家企业使用其服务，并通过其持有的超过 40 亿美元的客户存款产生收入。当使用借记卡时，它还可以减少交换费，并获得国库存款的回报。 Mercury 有一个标准的、免费的选项，它提供银行账户、国内和国际电汇，没有最低余额，还有一个“茶室”定价选项，供存款超过 250,000 美元的企业使用，提供封闭测试功能、资金选项、访问内部活动和免费茶（字面意思）。\n在最近的其他金融科技新闻中，基于 API 的金融基础设施提供商 Prime Trust 筹集了 6400 万美元的 A 系列。PayPal 还在本周的电话会议上发布了其第二季度的收益，并宣布了其新超级应用程序的计划。", "note_en": "Mercury, a company which offers software and banking services for scaling startups, announced raising a $120 million Series B led by  Coatue,  according to a company blog post.\n The company says it will use the funding to expand its team and continue developing products that help customers scale their businesses. Mercury currently has over 150 employees in 14 cities, 35 more than at this time last year.\n Mercury also set aside $5 million of the fundraise aside for unaccredited investors, with regulators  raising that amount up from $1 million in March, according to Fortune. The company will no doubt fill that community portion quickly ( available at Wefunder), considering the Series B pushed Mercury over a $1 billion valuation and into unicorn status.\n Andreesen Horowitz (a16z),  CRV and  Sapphire Ventures also invested in the funding round, with participation from individual investors Dylan Field (CEO at  Figma), Mathilde Collins (CEO at  Front), Akshay Kothari (COO at  Notion), Jack Altman (CEO at  Lattice), Hunter Walk and Satya Patel (Partners at  Homebrew), and Elizabeth Yin (Partner at  Hustle Fund).\n Mercury’s enables small businesses and startups to include a range of financial services into their businesses, including FDIC-insured accounts, physical and virtual cards, wires, ACH, checks, cash management and API integrations.\n The company currently works with customers in over 200 countries, has over 40,000 businesses using its service and generates revenue through the over $4 billion it holds in customer deposits. It also gets a cut of interchange fees when its debit cards are used and a return on Treasury deposits.\n Mercury has a  standard, free option which offers bank accounts, domestic and international wires and no minimum balances, as well as a “Tea Room” pricing option for businesses depositing over $250,000 that offers closed beta features, a treasury option, access to inside events and free tea (literally).\n In other recent fintech news, API-based financial infrastructure provider  Prime Trust  raised a $64 million Series A.  PayPal also released its 2Q earnings during a call this week, and  announced plans for its new super app.", "posttime": "2021-08-01 11:46:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "拨款,crowdfunding", "title": "为初创公司提供银行服务的 Mercury 筹集了 1.2 亿美元的 B 轮融资，其中包括 500 万美元的众筹拨款，由 Coatue 领投，估值为 1.62B 美元", "title_en": "Mercury, which offers banking services to startups, raises $120M Series B, including a $5M allotment for crowdfunding, led by Coatue at a $1.62B valuation", "transed": 1, "url": "https://finledger.com/2021/07/30/startup-service-provider-mercury-raises-120m-series-b/", "via": "", "real_tags": ["拨款"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070952, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，我在 10 天内为 Newgrounds 主办的游戏果酱制作了一款名为 Death&#39;s Clutch 的游戏。制作它很有趣，因为它涉及许多自定义渲染，例如制作以 3D 移动的 DOOM 风格的 2D 广告牌，或者破解 PlayCanvas 的材质系统以获得风格化的照明。我希望这篇“它是如何制作的”文章对寻求风格化 PlayCanvas 游戏的其他人有用，我很好奇是否有读者知道实现这些效果的更好方法（特别是想与其他引擎/工作流程进行比较）。我想记录这个过程的另一个原因是提醒自己美丽的东西是如何制作的——一层一层。当您滚动浏览此部分时，您将看到添加到下面实时演示中的每种效果及其说明。来回滚动以切换效果并查看其影响。我们将从一个基本的 PlayCanvas 场景开始，然后从那里构建恐怖游戏的美感。这个演示是互动的！单击右下角的锁定图标以启用轨道控制。用鼠标滚轮或捏合缩放。通过单击并拖动或触摸并拖动来旋转）。我们做的第一件事是在相机上安装聚光灯。每个游戏资产都作为应用于平面的 2D 纹理添加。接下来，我们使这些平面始终旋转以面向相机。一些物体，如附着在墙上的鸡蛋，旋转偏离其原始角度不超过 30 度。\n我们还应用了不透明纹理，使它们看起来不再像在平面上绘制的图像。接下来，我们通过将其颜色设置为黑色来关闭环境光。这将所有不在聚光灯范围内的东西完全变黑。尝试放大和缩小使光线离墙壁和物体更近或更远。即使将环境光设置为黑色，场景仍然不会像预期的那样在灯光范围之外的所有地方都漆黑一片。这是因为相机的默认透明颜色不是黑色。所以任何间隙/空白空间都会有这种深灰色。这里默认照明的一个大问题是，当光线直接照射到它时，所有东西看起来都褪色了。当光线直射墙壁或大怪物时，这一点最为明显。发生这种情况是因为我们使用了基于物理的光照模型，但我们的材质都是这些简单的 2D 图像，只有漫反射颜色。预期的结果是这些对象应始终使用其原始颜色进行渲染，而不管有多少光线到达它们。这通常是通过创建一个“未点亮”的材料来完成的。但我们也希望它们在没有光线到达的情况下不可见。\n为了实现这一点，我们创建了一个自定义材质，它的行为类似于标准的基于物理的材质，但只是根据接收到的光量在原始颜色和黑色之间进行插值。这消除了我们不想要的任何逼真的照明效果，如反射和镜面反射。接下来，我们将发光纹理应用于每个对象，以定义哪些区域应该在黑暗中发光，例如墙壁上的灯光或怪物的眼睛。这有助于玩家在灯光关闭的情况下也能看到一点，并且它创造了一种非常酷的效果，在完整的怪物出现之前，您只能看到眼睛在黑暗中发光。尝试将光线移近和移开鸡蛋，看看它在黑暗中的发光效果。使用自发光纹理比向所有这些对象添加灯光要高效得多。无论是否有光线到达，发光区域都会表现得好像有更多的光到达它们一样。这确实产生了一个问题，即使在很长的黑暗走廊的尽头，玩家也可以看到发光的物体，这破坏了惊喜。为了通过自发光解决这个问题并限制玩家可以看到发光物体的距离，我们添加了雾。\n雾会根据它们与相机的距离使颜色变暗，无论它们是否自发光。重要的是聚光灯的最大范围小于雾让您看到的最大范围。这种差异使得发光的眼睛在接近你时，在完整的怪物出现之前会出现片刻。迷雾对于制造悬念也很重要。玩家在黑暗中移动，不知道前方是什么，这让关卡感觉比实际更大。创建的最具挑战性的效果是这种对光线有反应但主要保持原始图像颜色的自定义材质。 PlayCanvas 确实提供了创建自定义材质的方法，请参阅 BasicMaterial，您可以在其中创建完全自定义的着色器。任何材质还具有“customFragmentShader”属性，可以覆盖现有材质的着色器。如果您想保留所有现有的输入（例如附加的纹理），您需要使用全新的材质重新设置这些输入，这很好。我们的问题是我们需要保留标准材质的所有复杂功能（因此它可能会受到雾、自发光和我们将来添加的任何效果的影响），但只需调整它计算最终颜色的方式。我们不能只是复制它并使用 customFragmentShader，因为着色器是在运行时生成的。例如，它会根据场景中的灯光数量或雾是否处于活动状态而变化。这是 PlayCanvas 源代码中的一个示例，其中仅在使用雾时才在运行时注入雾的着色器代码。我最终在最终生成的着色器上进行了字符串替换以对其进行自定义。这非常脆弱，因为：\n我不得不等待编译正确版本的着色器。当应用程序首次加载时，某些对象可能具有纯白色材料，直到加载纹理。在着色器的第一个版本中，我要替换的代码不存在。当您使用 customFragmentShader 替换着色器时，它会将您的代码插入到现有着色器定义的常量/统一等之下。但是我正在复制的着色器已经包含所有这些常量！所以我需要弄清楚这些定义在哪一行结束，所以我不会复制它们（这只是在运行时知道）。更好的解决方案是制作 StandardMaterial 类的副本并对其进行调整，但对我而言，如果不修改引擎会变得多么容易，我并不明显。一个更好的解决方案是我在写这篇文章时才了解到的，是传入一个自定义块对象来覆盖任何默认的材料块。这样你就可以调整照明系统的任何部分，而不必重写整个材质，也不必担心它如何与所有其他功能交互。这是我第一次使用 PlayCanvas 完成的游戏，总体上给我留下了深刻的印象！能够直接在浏览器中与我的队友协作真是太好了。他们以前从未使用过编辑器，但很容易为他们设置一个沙箱，艺术家可以在其中调整材料设置和位置，音乐家可以看到所有位置音效和背景音乐层次在他处理它们时听起来如何，而无需我每次他们想在游戏中看到他们的更新时更新游戏的版本。所以它感觉以这种方式赋予了力量。在 PlayCanvas 中设置空间音频是多么容易给我留下了深刻的印象，特别是考虑到这是这款游戏的重要组成部分（能够在黑暗中听到怪物的脚步声）。你只是检查一个“位置？”框上您的声音组件，你就完成了！我们遇到了一个 Firefox 错误，从图像中读取像素返回的颜色与原始颜色略有不同。这是一个大问题，因为我们通过为单个像素着色来创建关卡，其中绿色表示玩家生成位置，黑色表示墙壁等。解决方案是直接在 JavaScript 中解码 PNG 图像，而不是依赖浏览器对其进行解码.\n我们遇到了在 Newgrounds 上托管游戏时天空盒消失的问题。这是因为它缺少天空盒 (DDS) 的 mime 类型。解决方案是强制 PlayCanvas 将其加载为 PNG 图像。请参阅此处的解决方案。我使用 TexturePacker 为动画创建精灵表。要将其与 PlayCanvas 一起使用，您需要此自定义插件。我希望你觉得这很有用！我很想听听你的想法。在 Twitter 上找到我 @Omar4ur 或在 omarshehata.me 上查看更多联系我的方式。", "note_en": "Last week I made a game called  Death&#39;s Clutch in 10 days for a game jam hosted by Newgrounds. Making it was a lot of fun because it involved a lot of customized rendering like making DOOM-inspired 2D billboards that move in 3D, or hacking PlayCanvas&#39;s material system to get stylized lighting.\n  I hope this &#34;how it&#39;s made&#34; article will be useful for others seeking to stylize their PlayCanvas games, and I&#39;m curious if any readers know of better ways to implement these effects (especially curious about comparing with other engines/workflows).\n  The other reason I wanted to document this process was as a reminder to myself of how beautiful things are made — layer by layer.\n        As you scroll through this section you&#39;ll see each effect added to the live demo below along with its explanation. Scroll back and forth to toggle the effects and see their impact. We&#39;ll start with a basic PlayCanvas scene and build up the horror game aesthetic from there.\n This demo is interactive! Click the lock icon   in the bottom right to enable orbit controls. Zoom with mousewheel or pinch. Rotate with click &amp; drag, or touch &amp; drag).\n      The first thing we did was attach a spotlight to the camera. Each game asset was added as a 2D texture applied to a flat plane.\n      Next we made these flat planes always rotate to face the camera. Some objects, like the eggs attached to the walls, do not rotate more than 30 degrees away from their original angle.\n  We also applied an opacity texture so they no longer look like images drawn on a flat plane.\n      Next we turned off the ambient light by setting its color to black. This turns everything not directly in range of the spotlight completely black.\n  Try zooming in and out to bring the light closer or farther from the walls and objects.\n      Even with ambient light set to black, the scene still isn&#39;t pitch black everywhere outside of the light&#39;s range as expected. This is because the camera has a default clear color that isn&#39;t black. So any gaps/empty space will have this dark gray color.\n        One big problem with the default lighting here is that everything looks washed out when the light hits it directly. This is most obvious when shining the light straight at a wall, or at the big monster.\n  This happens because we&#39;re using a physically based lighting model, but our materials are all these simple 2D images that only have a diffuse color.\n  The desired outcome is that these objects should always render using their original colors, regardless of how much light reaches them. This is usually done by creating an &#34;unlit&#34; material. But we also want them to NOT be visible if NO light reaches them.\n  To achieve this, we created a custom material that behaves just like a standard physically based material, but just interpolates between the original color and black based on the amount of light received. This removes any realistic lighting effects like reflection and specular that we don&#39;t want.\n        Next we applied an emissive texture to each object to define which areas should glow in the dark, such as lights on the walls or the eyes of the monsters.\n  This helps the player see a little bit even if their light is turned off, and it creates a very cool effect where you see just the eyes glowing in the dark before the full monster comes into view.\n  Try moving your light towards and away from the egg to see how it appears to glow in the dark.\n  The use of an emissive texture is significantly more efficient than adding lights to all these objects. The emissive areas will just behave as if they have more light reaching them, regardless of whether any light is reaching them.\n  This does create a problem where the player can see a glowing object even at the end of a very long dark hallway, which ruins the surprise.\n      To fix this issue with emissive and limit how far the player can see glowing objects, we add fog.\n  The fog darkens the colors based on their distance to the camera, regardless of whether they are emissive or not.\n  It&#39;s important that the maximum range of the spotlight is shorter than the maximum range that the fog lets you see. This difference is what allows the glowing eyes to appear for a few moments before the full monsters comes into view when it is approaching you.\n  The fog is also critical for creating suspense. The player moves in the darkness not knowing what lies ahead, and it makes the levels feel bigger than they are.\n The most challenging effect to create was this custom material that responds to light but mainly keeps the original image color.\n  PlayCanvas does provide ways to create custom materials, see  BasicMaterial where you can create a completely custom shader. Any material also has a &#34; customFragmentShader&#34; property that can override an existing material&#39;s shader. This is nice in cases when you want to keep all existing inputs (such as the attached textures) which you&#39;d need to re-setup with a completely new material.\n  Our problem was that we needed to keep all the complex functionality of the Standard Material (so it can be affected by fog, emissive, and any effects we add in the future), but just tweak how it computes the final color. We couldn&#39;t just copy it and use  customFragmentShader because the shader is generated at runtime. For example, it changes based on how many lights are in the scene, or whether fog is active.  Here is an example in the PlayCanvas source where the shader code for the fog is injected at runtime only if fog is in use.\n  I ended up essentially doing a string replacement on the final generated shader to customize it. This was very fragile because:\n  I had to wait for the right version of the shader to be compiled. When the app first loads, some objects may have a plain white material until the textures are loaded. In the first version of the shader, the code I&#39;m trying to replace doesn&#39;t exist.\n  When you replace a shader using  customFragmentShader, it inserts your code beneath the existing shader&#39;s defined constants/uniforms etc. But the shader I am copying already includes all those constants! So I needed to figure out at what line those definitions ended so I don&#39;t copy them over (and this was only known at runtime).\n  A better solution would have been to make a copy of the StandardMaterial class and tweak it, but it wasn&#39;t obvious to me how easy that would be without modifying the engine.\n  An even better solution which I&#39;ve only learned about as I&#39;m writing this, is to pass in  a custom chunks object to override any default material chunks. That way you can tweak any part of the lighting system without having to rewrite the whole material, or worry about how it interacts with all the other features.\n    This was my first complete game using PlayCanvas, and I am overall really impressed! It was really nice to be able to collaborate with my teammates directly in the browser. They had never used the editor before but it was easy to set up a sandbox for them where the artist could tweak material settings and placement, and the musician could see how all the positional sound effects and layers of background music sounded as he worked on them, without me having to update a build of the game every time they wanted to see their updates in the game. So it felt empowering in that way.\n    I was impressed with how easy it was to set up spatial audio in PlayCanvas, especially given that was a huge part of this game (to be able to hear monsters&#39; footsteps in the dark). You just check a &#34; positional?&#34; box on your sound component and you&#39;re done!\n  We ran into a  Firefox bug where reading pixels from an image returned colors that were slightly off from the original. This was a big problem because we were creating levels by coloring individual pixels, where green meant player spawn position, black meant walls etc. The solution was to switch to decoding the PNG image directly in JavaScript, instead of relying on the browser to decode it.\n  We ran into an issue where the skybox disappeared when hosting the game on Newgrounds. This is because it was missing the mime type for the skybox (DDS). The solution was to force PlayCanvas to load it as PNG images instead. See  solution here.\n    I used TexturePacker to create the spritesheets for the animations. To use it with PlayCanvas, you need  this custom plugin.\n    I hope you found this useful! I&#39;d love to hear your thoughts. Find me  @Omar4ur on Twitter or see more ways to reach me at  omarshehata.me.", "posttime": "2021-08-01 11:45:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "风格,doom,颜色", "title": "用 PlayCanvas 创造一种 DOOM 风格的美学——一篇互动文章", "title_en": "Creating a DOOM-inspired aesthetic with PlayCanvas – an interactive article", "transed": 1, "url": "https://omarshehata.me/html/playcanvas-horror-aesthetic/", "via": "", "real_tags": ["风格", "doom", "颜色"]}, {"category": "", "categoryclass": "", "imagename": "e298681aed515bcbe0d5af1b175a113c.png", "infoid": 1070951, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它们几乎不可见，但包含一个隐藏的代码——现在它们出现在一份泄露的文件中，引发了人们对它们对 FBI 调查人员有用的猜测。 BBC Future 为您带来了深入而严谨的故事，以帮助您应对当前的流行病，但我们知道您想阅读的不止这些。所以现在我们专门推出了一个系列来帮助你逃脱。我们将在 Lockdown Longreads 中重新审视过去三年中最受欢迎的功能。从关于世界上最伟大的太空任务的故事到关于我们的猫是否真的爱我们的真相，将非法渔民绳之以法的史诗般的狩猎，以及让埋藏已久的第二次世界大战坦克复活的小团队，您将找到一切.你不会找到的是任何参考，嗯，你知道什么。享受。 2017 年 6 月 3 日，联邦调查局特工抵达乔治亚州奥古斯塔政府承包商 Reality Leigh Winner 的家。过去两天，他们一直在调查一份据称泄露给媒体的绝密机密文件。为了追踪温纳，特工声称他们仔细研究了在线新闻网站 The Intercept 提供的文件副本，并注意到折痕表明这些页面是打印出来的，并且是“在安全的空间中手工携带”的。在一份宣誓书中，联邦调查局声称温纳承认打印了国家安全局 (NSA) 的报告并将其发送给 The Intercept。在有关泄密的故事发表后不久，对温纳的指控就被公开了。那时，专家们开始仔细研究该文件，该文件现已在网络上公开发布。他们发现了其他有趣的东西：在整个页面中重复出现的大致矩形图案的黄点。它们肉眼几乎看不见，但形成了编码设计。经过一些快速分析，他们似乎揭示了打印相关页面的确切日期和时间：2017 年 5 月 9 日 06:20——至少，这可能是当时打印机内部时钟的时间。这些点还编码了打印机的序列号。这些“微点”为安全研究人员和公民自由活动家所熟知。许多彩色打印机将它们添加到文档中，而人们根本不知道它们在那里。\n在这种情况下，联邦调查局没有公开表示这些微点是用来帮助识别他们的嫌疑人的，该局拒绝对本文发表评论。公布了对温纳的指控消息的美国司法部也拒绝提供进一步的澄清。 The Intercept 在一份声明中说：“获胜者面临未经证实的指控。联邦调查局关于如何逮捕温纳的说法也是如此。”但是，现在一份备受瞩目的文件（违背了 NSA 的意愿）上出现的微点引起了极大的兴趣。 “放大文档，它们非常明显，”编目平台 Document Cloud 的 Ted Han 说，他是第一个注意到它们的人之一。 “有趣且值得注意的是，这些东西就在那里。”另一位观察者是安全研究员 Rob Graham，他发表了一篇博文，解释了如何识别和解码这些点。根据它们在网格上绘制时的位置，它们表示特定的小时、分钟、日期和数字。几位对这些点进行解码的安全专家得出了相同的打印时间和日期。微点已经存在多年。电子前沿基金会 (EFF) 维护着一个已知使用它们的彩色打印机列表。下面的图片由 EFF 拍摄，展示了如何解码它们：除了可能对间谍感兴趣之外，微点还有其他潜在用途，软件咨询公司 Vector 5 的数据分析师蒂姆·贝内特说，他还检查了据称泄露的 NSA文档。\n“人们可以用它来检查伪造品，”他解释说。 “如果他们得到一份文件并且有人说它是 2005 年的，[微点可能会显示]它是最近几个月的。”如果您在某个时候确实在文档上遇到了微点，EFF 有一个在线工具可以显示该模式编码的信息。类似的隐写术——隐藏在明显视线中的秘密信息——已经存在了很长时间。稍微更出名的是，世界各地的许多纸币都有一种特殊的五点图案，称为 Eurion 星座。为了避免伪造，许多复印机和扫描仪被编程为在识别出这种图案时不生成钞票的副本。美国国家安全局本身指出了一个由小点形成信息的迷人历史例子——来自第二次世界大战。墨西哥的德国间谍被发现在信封内贴了小点，其中隐藏着里斯本联系人的备忘录。当时，这些间谍从事卧底活动，试图从德国获取无线电设备和秘密墨水等材料。然而，盟军拦截了这些信息，并中断了任务。德国人使用的小点通常只是一些未加密的文本，缩小到一个句号大小。这种通信在二战及之后被广泛使用，特别是在冷战期间。有报道称特工为苏联工作，但在西德进行卧底，并使用信件传送这些信息。\n今天，任何人都可以尝试使用缩微文本来保护他们的财产——一些公司，例如英国的 Alpha Dot，出售装满针头大小点的永久性粘合剂小瓶，这些点上覆盖着包含唯一序列号的微观文本。如果警方追回了被盗物品，理论上可以使用该号码将其与所有者进行匹配。这些微型消息的许多示例不像许多彩色打印机的输出那样涉及编码模式，但它们仍然是很好的例子，说明实际应用于文档或对象的微型调度如何可以留下识别痕迹。某些形式的基于文本的隐写术甚至根本不使用字母数字字符或符号。萨里大学的安全专家艾伦·伍德沃德 (Alan Woodward) 提到了“雪”的例子——空白的隐写性质——它在一段文本的行尾放置了空格和制表符。这些空白的特定数量和顺序可用于编码不可见的消息。 “在文本中定位尾随空格就像在暴风雪中找到北极熊，”Snow 网站解释道。不过，伍德沃德指出，通常有多种方法可以将文档追溯到打印或访问文档的人。 “NSA 等组织在每次打印某些东西时都有记录，而不仅仅是跟踪纸张打印后的方法，”他说。 “他们知道人们知道黄点，因此他们不依赖它进行可追溯性。”关于打印机在用户不知情的情况下将此信息附加到文档是否合乎道德的争论由来已久。事实上，甚至有人认为这是对人权的侵犯，麻省理工学院的一个项目已经跟踪了超过 45,000 份向印刷公司提出的有关该技术的投诉。\n尽管如此，许多人认为在某些情况下仍然有必要使用秘密措施来确保机密文件的机密性。 “有些事情政府应该能够保密，”泰德汉说。然而，他补充道，“我希望人们考虑他们的操作安全以及记者如何保护自己——以及他们的消息来源。”如果您喜欢这个故事，请注册每周 bbc.com 专题通讯，名为“如果您本周只阅读 6 件事”。从 BBC Future、Earth、Culture、Capital 和 Travel 中精心挑选的故事，每周五发送到您的收件箱。", "note_en": "They’re almost invisible but contain a hidden code – and now their presence on a leaked document has sparked speculation about their usefulness to FBI investigators.\n BBC Future has brought you in-depth and rigorous stories to help you navigate the  current pandemic, but we know that’s not all you want to read. So now we’re dedicating a series to help you escape. We’ll be revisiting our most popular features from the last three years in our   Lockdown Longreads .\n You’ll find everything from the story about the  world’s greatest space mission to the truth about whether  our cats really love us, the epic hunt to bring  illegal fishermen to justice and the small team which brings  long-buried World War Two tanks back to life. What you won’t find is any reference to, well, you-know-what. Enjoy.\n On 3 June 2017, FBI agents arrived at the house of government contractor Reality Leigh Winner in Augusta, Georgia. They had spent the last two days  investigating a top secret classified document that had allegedly been leaked to the press. In order to track down Winner, agents claim they had carefully studied copies of the document provided by online news site The Intercept and noticed creases suggesting that the pages had been printed and “hand-carried out of a secured space”.\n In an affidavit, the FBI alleges that Winner admitted printing the National Security Agency (NSA) report and sending it to The Intercept. Shortly after a story about the leak was published, charges against Winner were made public.\n  At that point, experts began taking a closer look at the document, now publicly available on the web. They discovered something else of interest: yellow dots in a roughly rectangular pattern repeated throughout the page. They were barely visible to the naked eye, but formed a coded design.  After some quick analysis, they seemed to reveal the exact date and time that the pages in question were printed: 06:20 on 9 May, 2017 – at least, this is likely to be the time on the printer’s internal clock at that moment. The dots also encode a serial number for the printer.\n These “microdots” are well known to security researchers and civil liberties campaigners. Many colour printers add them to documents without people ever knowing they’re there.\n  In this case, the FBI has not said publicly that these microdots were used to help identify their suspect, and the bureau declined to comment for this article. The US Department of Justice, which published news of the charges against Winner, also declined to provide further clarification.\n In  a statement, The Intercept said, “Winner faces allegations that have not been proven. The same is true of the FBI’s claims about how it came to arrest Winner.”\n But the presence of microdots on what is now a high-profile document (against the NSA’s wishes) has sparked great interest.\n  “Zooming in on the document, they were pretty obvious,” says Ted Han at cataloguing platform  Document Cloud, who was one of the first to notice them. “It is interesting and notable that this stuff is out there.”\n Another observer was security researcher Rob Graham, who published  a blog post explaining how to identify and decode the dots. Based on their positions when plotted against a grid, they denote specific hours, minutes, dates and numbers. Several security experts who decoded the dots came up with the same print time and date.\n Microdots have existed for many years. The Electronic Frontier Foundation (EFF) maintains a list of colour  printers known to use them. The images below, captured by the EFF, demonstrate how to decode them:\n  As well as perhaps being of interest to spies, microdots have other potential uses, says Tim Bennett, a data analyst at software consultancy Vector 5 who also examined the allegedly leaked NSA document.\n  “People could use this to check for forgeries,” he explains. “If they get a document and someone says it’s from 2005, [the microdots might reveal] it’s from the last several months.”\n If you do encounter microdots on a document at some point,  the EFF has an online tool that should reveal what information the pattern encodes.\n  Similar kinds of steganography – secret messages hidden in plain sight – have been around for much longer.\n Slightly more famously, many banknotes around the world feature  a peculiar five-point pattern called the Eurion constellation. In an effort to avoid counterfeiting, many photocopiers and scanners are programmed not to produce copies of the banknotes when this pattern is recognised.\n  The NSA itself points to a fascinating historical example of tiny dots forming messages – from World War Two. German spies in Mexico were found to have  taped tiny dots inside the envelope concealing a memo for contacts in Lisbon.\n At the time, these spies were operating undercover and were  trying to get materials from Germany, such as radio equipment and secret ink. The Allies intercepted these messages, however, and disrupted the mission. The tiny dots used by the Germans were often simply bits of unencrypted text miniaturised to the size of a full-stop.\n This sort of communication was widely used during WWII and afterwards, notably during the Cold War. There are reports of agents operating for the Soviet Union, but based undercover in West Germany and  using letter drops to transmit these messages.\n  And today, anyone can try using microtext to protect their property – some companies,  such as Alpha Dot in the UK, sell little vials of permanent adhesive full of pin-head sized dots, which are covered in microscopic text containing a unique serial number. If the police recover a stolen item, the number can in theory be used to match it with its owner.\n Many examples of these miniature messages do not involve a coded pattern as with the output of many colour printers, but they remain good examples of how miniscule dispatches physically applied to documents or objects can leave an identifying trail.\n  Some forms of text-based steganography don’t even use alphanumeric characters or symbols at all. Alan Woodward, a security expert at the University of Surrey, notes the example of ‘Snow’ –  Steganographic Nature Of Whitespace – which places spaces and tabs at the end of lines in a piece of text. The particular number and order of these white spaces can be used to encode an invisible message.\n “Locating trailing whitespace in text is like finding a polar bear in a snowstorm,”  the Snow website explains.\n Woodward points out, though, that there are usually multiple ways of tracing documents back to whoever printed or accessed them.\n “Organisations such as the NSA have logs of every time something is printed, not just methods of tracking paper once printed,” he says. “They know that people know about the yellow dots and so they don’t rely upon it for traceability.”\n There is a long-running debate over whether it is ethical for printers to be attaching this information to documents without users knowing. In fact, there has even been a suggestion that it is  a violation of human rights and  one MIT project has tracked more than 45,000 complaints to printer companies about the technology.\n Still, many believe that the use of covert measures to ensure the secrecy of classified documents remains necessary in some cases.\n “There are things that governments should be able to keep secret,” says Ted Han.\n However, he adds, “I hope that folks think about their operational security and also about how journalists can protect themselves – and their sources as well.”\n  If you liked this story,    sign up for the weekly bbc.com features newsletter , called “If You Only Read 6 Things This Week”. A handpicked selection of stories from BBC Future, Earth, Culture, Capital, and Travel, delivered to your inbox every Friday.", "posttime": "2021-08-01 11:45:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,添加,add,文档", "title": "为什么打印机要添加秘密跟踪点", "title_en": "Why printers add secret tracking dots", "transed": 1, "url": "https://www.bbc.com/future/article/20170607-why-printers-add-secret-tracking-dots", "via": "", "real_tags": ["打印", "添加", "add", "文档"]}, {"category": "", "categoryclass": "", "imagename": "a43145d95cd12605430d2f8ed6c29db6.jpg", "infoid": 1070950, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "心理健康初创公司 Rey 的首席执行官兼创始人 Deepak Gopalakrishna 表示，技术可以而且应该在弥合对心理健康服务迅速增长的需求与优质专业人士有限供应之间的差距方面发挥关键作用。这家支持 VR 的心理健康公司周二宣布，它已经筹集了 1000 万美元的新投资，使其 A 轮融资总额达到 2600 万美元。该轮融资由 Optum Ventures 和 Oxford Sciences Innovation 领投，在该公司于 4 月推出三个月后进行。尽管 Rey 还处于起步阶段，但 Gopalakrishna 已经在健康科技行业工作了近 20 年。首先是一名医生，然后是一名创办多家生物技术初创公司的企业家，以及 BCG Digital Ventures 的投资者。 Gopalakrishna 说，心理健康服务的供需失衡给刚从大学毕业的年轻临床医生造成了不应有的负担。 “这就像让一名大四学生参加一系列背靠背的行政级别会议，并要求他们改变情境并解决问题。”根据 Crunchbase 的数据，在在线治疗的扩张和大流行驱动的对心理健康服务的绝望的刺激下，自 2016 年以来，已有 26 亿美元涌入该行业。但是，尽管心理健康公司激增，但心理健康保健工作者却是从一小群治疗师中抽取出来的。根据美国心理学会的数据，每 100,000 名美国人中大约有 34 名获得许可的专业人士。 “从本质上讲，你有点像 Uber 司机。这也是一次可怕的临床临床医生经历，”首席商务官 Mike Desjadon 告诉福布斯。使这个问题更加复杂的是客户对医生帮助患者的能力的信任问题。 “这是技术可以解决的，”Gopalakrishna 说。\nRey 使用认知行为疗法、谈话疗法、药物和临床验证的技术工具（如虚拟现实）的个性化组合来帮助其客户实现心理健康。 Desjadon 说：“我们希望在实现良好护理的民主化方面发挥重要作用，这对人们来说现在仍然难以实现。”通过使用虚拟现实和增强等数字集成，该公司旨在优化临床心理学家的宝贵时间。 Gopalakrishna 说，我们的目标不是取代治疗师，而是使精神保健的日常日常工作自动化。此外，该公司计划使用自动化来监控和管理患者的护理并跟踪进度。在心理保健中使用 VR 等沉浸式工具的另一个好处是能够在合适的环境中提供治疗。例如，对于有恐高症的人，可以通过虚拟现实在摩天大楼顶部的模拟环境中提供最好的护理，而不是在封闭的房间或缩放屏幕上进行会议，Gopalakrishna 解释说。 Gopalakrishna 解决精神卫生系统结构性低效率问题的动机来自他祖母患精神疾病的经历以及她接受的不充分、有时是残酷的治疗。他说：“我对我祖母的了解只是她是一个疯狂的老太太，一年中大约有六个月的时间睡觉，并且在一年中的其他六个月里非常虐待和暴力。” “我不知道的是，她是医学院班级的佼佼者，并且是 1950 年代和 1960 年代印度的一流医生，这真是太神奇了，”他回忆起他的祖母说，他的祖母接受了野蛮的治疗方法早期电休克疗法。 . “从那时起，医疗保健已经取得了长足的进步，但我们仍然对人们过度用药，我们仍然没有为人们提供正确的心理治疗。我只想改变我们提供护理的方式，”他告诉福布斯。\nRey 承诺其客户可以获得按需的个性化心理保健服务和尖端技术。借助新的 VC 资金，该公司计划扩大其在美国和国际上的消费者影响力。雷伊的技术诞生于牛津学术界。其母公司 OxfordVR 由牛津大学精神病学系教授 Daniel Freeman 创立。", "note_en": "Technology can, and should, play a pivotal role in bridging the gap between the burgeoning demand for mental health services and limited supply of quality professionals, says Deepak Gopalakrishna, CEO and founder of mental health and wellness startup  Rey.\n    The VR-empowered mental health company announced Tuesday that it has raised $10 million in new investment, bringing its total series A funding round to $26 million. The round was led by Optum Ventures and Oxford Sciences Innovation and comes three months after the company launched in April.\n  Though Rey is in its nascent stages, Gopalakrishna has been in the health tech industry for nearly two decades; first as a medical doctor, then as an entrepreneur who launched multiple biotech startups and also as an investor at BCG Digital Ventures.\n    The supply and demand imbalance of mental health services has caused undue burden on young clinicians coming straight out of college, Gopalakrishna says. “It&#39;s like giving a college senior a full load of back-to-back executive level meetings and asking them to context change and problem solve.”\n    Spurred by the expansion of online therapy and pandemic-driven desperation for mental health services, $2.6 billion have been poured into the sector since 2016, according to  Crunchbase. But while mental health companies have proliferated, mental health care workers are being drawn from a small pool of therapists. There are roughly 34 licensed professionals for every 100,000 Americans, according to  American Psychological Association.\n    “Essentially, you kind of feel like an Uber driver. That&#39;s a horrible clinical clinician experience as well,” Chief Commercial Officer Mike Desjadon tells  Forbes.\n  Compounding that problem is the issue of a client’s trust in the physician’s ability to help a patient. “And that is technology solvable,” Gopalakrishna says.\n    Rey uses a personalized combination of cognitive behavioral therapy, talk therapy, medication, and clinically validated tech tools such as virtual reality to help its clients achieve mental wellness.\n  “We want to play a big part in democratizing access to good care, which is right now still elusive for people,” Desjadon says.\n  By using digital integrations like virtual reality and augmentation, the company aims to optimize a clinical psychologist’s precious time. The goal is not to replace the therapist but to automate the routine day-to-day aspect of mental healthcare, Gopalakrishna says. Additionally, the company plans to use automation to monitor and manage a patient’s care and track progress.\n  Another perk of using immersive tools such as VR in mental healthcare is the ability to provide therapy in the right environment. For example, for someone with a fear of heights, the best care can be provided in the simulated setting of the top of a skyscraper through virtual reality rather than conducting a session in a closed room or over a Zoom screen, Gopalakrishna explains.\n  Gopalakrishna’s motivation to tackle the structural inefficiencies in the mental health system comes from his grandmother’s experience with mental illness and the inadequate, sometimes brutal treatment she received. “All I knew of my grandma was that she was a crazy old lady who slept for like six months of the year and was extremely abusive, and violent, for the other six months of the year,” he says.\n  “What I didn&#39;t know was that she was the top of a medical school class and was a top notch doctor in 1950s and 1960s India, which is pretty freaking amazing,” he says recalling his grandmother, who was treated using barbaric methods of early electroconvulsive therapy. .\n  “Medical care has come a long way since then but we&#39;re still overmedicating people, and we still don&#39;t provide people with the right psychological therapies. I just want to change the way we deliver care,” he tells  Forbes.\n  Rey promises its customers access to on-demand personalized mental health care services and cutting-edge technologies. With the new VC funding, the company plans to expand its consumer reach within the U.S. and internationally. Rey’s technology is born out of the academic circles of Oxford. Its parent company, OxfordVR, was founded by Daniel Freeman, a professor at the Oxford University Department of Psychiatry.", "posttime": "2021-08-01 10:52:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "提供,months", "title": "Rey 使用由 OxfordVR 提供支持的基于 VR 的工具来提供按需心理保健服务，在推出三个月后筹集了 2600 万美元的 A 系列", "title_en": "Rey, which uses VR-based tools powered by OxfordVR to provide on-demand mental health care services, raises $26M Series A, three months after launching", "transed": 1, "url": "https://www.forbes.com/sites/rashishrivastava/2021/07/27/mental-health-startup-rey-raises-10-million-to-bring-augmentation-to-the-clinic/", "via": "", "real_tags": ["提供", "months"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些估计不一定反映实际表现；相反，绘制了力估计值以显示设备可能承受的最大力范围。这些力估计跨越了登山者产生的力的范围。登山者可以预期的最大力约为 12,000N，而悬挂在锚上的登山者会施加约 1500N 的力。根据弹性模型，较大的 SLCD 可以承受较大的力，而较小的设备预计会在登山者经常遇到的情况下发生故障。即使在弹性模型中加入了一些估计和简化，性能预期的范围仍然很大。施加力范围的下限特别重要，因为较小的设备在标称条件下可能会发生故障。完美的 SLCD 重量轻且经久耐用，适合各种裂缝尺寸，可靠地锚定在最滑的岩石上，具有允许放置在浅裂缝中的窄轮廓（宽度），并且可以承受坠落的登山者可以施加的最大作用力。这些最佳特性只能通过凸轮的几何形状和材料属性的变化获得：凸轮角度、半径、宽度、杨氏模量、泊松比和剪切屈服。 Everycam 是一种妥协；减轻或缩小凸轮的努力降低了耐用性和最大负载，更大的范围被换来了更少的摩擦保持能力。这些折衷隐含在公式 2 中，该公式将凸轮角度限制为小于摩擦系数的反正切，而公式 5 则定义了在剪切破坏开始之前可以施加的最大载荷。尽管这些方程仅提供凸轮性能的估计值，但该模型预测了不同 SLCD 之间性能的广泛差异以及某些 SLCD（尤其是较小的 SLCD）在通常由坠落的登山者产生的力下失效的可能性。已发布的剪切屈服力和摩擦保持力的测量值将提供信息，使登山者能够做出有关 SLCD 的智能决策。最重要的是，攀登者应该意识到设备的摩擦保持能力低到危险程度或剪切失效的最大负载。同样重要的是，对凸轮限制的明确认识使登山者能够更安全、更有信心地放置设备。最后，性能信息将为登山者提供一种比较不同制造商生产的 SLCD 的方法。迄今为止，这些信息要么没有明确说明，要么根本无法提供给登山社区。提供性能信息将提醒登山者 SLCD 限制的存在，并为登山者提供成功解决这些限制所需的信息。 2 from Ball and Roller Bearings, Eschmann, Hasbargen, Weigand, JWiley and Sons, pg 113. 3 文献表明非压缩力的影响很小（Contact Mechanics, KL Johnson, Cambridge UniversityPress, 1985）。 4 Luke Sosnowski 的有限元分析工作表明对数曲率和圆曲率之间的差异可以忽略不计。", "note_en": "These estimates do not necessarily reflect actual performance; rather,the force estimates are plotted to show the wide range of maximumforces that devices might be expected to sustain. These forceestimates span the range of forces that climbers generate. Thehighest force that a climber can expect is about 12,000N and a climberhanging from an anchor applies a force of about 1500N. According tothe elastic model, larger SLCDs can sustain larger forces and thesmaller devices are expected to fail under conditions commonlyexperienced by climbers. Even though several estimations andsimplifications are incorporated into the elastic model, the range ofperformance expectations remains large. The lower end of the appliedforce range is of particular importance because the smaller devices mayfail under nominal conditions. The perfect SLCD is light weight and durable, fits in a wide range ofcrack sizes, anchors reliably to the most slippery rock, has a narrowprofile (width) that allows placement in shallow cracks, and cansustain the largest applied forces a falling climber can exert. Theseoptimal characteristics can only be obtained through variation of thecam&#39;s geometry and material properties: the camming angle, radius,width, Young&#39;s Modulus, Poisson&#39;s Ratio, and the shear yield. Everycam is a compromise; efforts to lighten or narrow the cam reduce bothdurability and maximum load, and greater range is traded for lessfrictional holding ability. These compromises are implicit in Equation 2, which constrains the camming angle tobe less than the arctan of the friction coefficient, and Equation 5, which defines the maximum load that can beapplied before the onset of shear failure. Even though theseequations provide only estimates of cam performance, the modelpredicts both the wide variation of performance among different SLCDsand the likelihood that some SLCDs, especially smaller ones, fail atforces commonly produced by falling climbers. Published measurements of force to shear yield and frictional holdingability would provide information that allows climbers to makeintelligent decisions concerning SLCDs. Most importantly, climberswould be aware when devices have dangerously low frictional holdingability or maximum load to shear failure. Of similar importance, anexplicit awareness of cam limitations allows climbers to place thedevices more securely and with greater confidence. Finally,performance information would provide climbers with a way of comparingSLCDs made by different manufacturers. To date, this information iseither not explicitly stated or simply not available to the climbingcommunity. Making performance information available would alertclimbers to the existence of SLCD limitations and provide climberswith the information required to successfully work around theselimitations. 2from  Ball and Roller Bearings, Eschmann, Hasbargen, Weigand, JWiley and Sons, pg 113.  3 The literature suggests that the effect of the non-compressive forceis small ( Contact Mechanics, KL Johnson, Cambridge UniversityPress, 1985). 4Finite element analysis work by Luke Sosnowski suggests a negligibledifference between logarithmic and circular curvature.", "posttime": "2021-08-01 10:52:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "锚固,model,登山者", "title": "攀岩锚固力的弹性模型", "title_en": "An Elastic Model of the Holding Power of Rock Climbing Anchors", "transed": 1, "url": "http://web.mit.edu/custer/www/rocking/cams/cams.body.html", "via": "", "real_tags": ["锚固", "model", "登山者"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，如果我操这个模特 她只是漂白了她的混蛋 而我的 T 恤上也有漂白剂 我感觉自己像个混蛋 2018 年。如果你和我一样，你的头脑会时不时带你去坎耶永恒的“巴勃罗的生活”中那些光彩夺目的台词。作为一名程序员，这句 if 语句结构的机器般的合理性让我觉得是纯粹的天才。显而易见的问题是：我们能否将这节经文的逻辑结论转化为 Javascript 脚本？当然，我们可以。 // 让我们从定义我们宇宙的本体开始。 const BLEACH_TRANSFERENCE_RATIO = 0.5 class TShirt { constructor() { // 默认情况下，T 恤是干净的。这。污渍 = [] } addStain(stain) { 这个。污点.push（污点）} } 类人{ 构造函数（名称，职业，服装）{ 这个。名称 = 命名这个。占领=占领这个。衣服=衣服这个。 isFucking = null 这个。 isBeingFuckedBy = null } get tShirt() { 返回这个。服装.find((piece) =&gt;piece instanceof TShirt) } fuck(person) { // 更新混蛋和混蛋的状态。这。 isFucking = 人人。 isBeingFuckedBy = this // 根据业务逻辑进行混蛋内容的传输。 const isFuckingModel = person instanceof Model const isWearingTShirt = Boolean(this.tShirt) const sheJustBleachedHerAsshole = person. assholeContent.includes( &#39;bleach&#39;) if (isFuckingModel &amp;&amp; isWearingTShirt &amp;&amp; sheJustBleachedHerAsshole) { // 注意：每次你操模型时，你的 T 恤上都不会漂白。请注意，这行是“我的 T 恤上有漂白剂”，而不是“然后我的 T 恤上有漂白剂”。暗示结果不可预测。 if ( Math.random() &gt;= BLEACH_TRANSFERENCE_RATIO) { this.tShirt.addStain( &#39;bleach&#39;) } } } } class Rapper extends Person { 构造函数(名字，衣服) { 超级(名字，&#39;说唱歌手&#39;，衣服) } 得到Feel() { if ( this.tShirt.stains.includes( &#39;bleach&#39;)) { return &#39;like an asshole&#39; } else { return &#39;ok&#39; } } } class Model extends Person { constructor() { // 默认情况下，模特是无名和裸体的（根据 Kanye 的说法）。 super(null, &#39;model&#39;, []) 这个。 assholeContent = [] }bladeAsshole() { if (! this.assholeContent.includes(&#39;bleach&#39;)) { this. assholeContent.push(&#39;bleach&#39;) } } } // 表演时间！ const kanye = new Rapper( &#39;Kanye&#39;, [ new TShirt()]) const model = new Model() model.bleachAsshole() console.log(kanye.feeling) // &#39;ok&#39; kanye.fuck(model) console. log(kanye.feeling) // &#39;像个混蛋&#39;", "note_en": "Now, if I fuck this model And she just bleached her asshole And I get bleach on my T-shirt I’ma feel like an asshole\n  Ah, 2018. If you are at all like me, your mind takes you from time to time to those glorious lines in Kanye’s timeless “The Life of Pablo”. As a programmer, the machine-like rationality of the if-statement structure of the verse struck me as pure genius.\n The obvious question is: can we take the verse to its logical conclusion and turn it into a Javascript script? Of course, we can.\n  // Let&#39;s start by defining the Ontology of our universe.  const  BLEACH_TRANSFERENCE_RATIO = 0.5   class TShirt {  constructor() {   // By default, a T-shirt is clean.   this. stains = []  }   addStain(stain) {   this. stains.push(stain)  } }   class Person {  constructor(name, occuppation, clothing) {   this. name = name   this. occuppation = occuppation   this. clothing = clothing   this. isFucking =  null  this. isBeingFuckedBy =  null  }    get tShirt() {   return this. clothing.find((piece) =&gt; piece  instanceof TShirt)  }   fuck(person) {   // Update fucking status of the fucker and the fuckee.   this. isFucking = person  person. isBeingFuckedBy =  this    // Perform transference of asshole content based on business logic.   const isFuckingModel = person  instanceof Model   const isWearingTShirt =   Boolean( this.tShirt)   const sheJustBleachedHerAsshole = person. assholeContent.includes( &#39;bleach&#39;)   if (isFuckingModel &amp;&amp; isWearingTShirt &amp;&amp; sheJustBleachedHerAsshole) {   // Note: You don&#39;t get bleach on your T-Shirt every time you fuck the model. Observe that the line is &#34;And I get bleach on my T-shirt&#34; instead of &#34;Then I get bleach on my T-shirt&#34;. Suggesting that the outcome is not predictable.   if (  Math.random() &gt;=   BLEACH_TRANSFERENCE_RATIO) {   this.tShirt.addStain( &#39;bleach&#39;)  }  }  } }   class Rapper  extends Person {  constructor(name, clothing) {   super(name,  &#39;rapper&#39;, clothing)  }    get feeling() {   if ( this.tShirt. stains.includes( &#39;bleach&#39;)) {   return &#39;like an asshole&#39;  }  else {   return &#39;ok&#39;  }  } }   class Model  extends Person {  constructor() {   // By default, models are unnamed and naked (according to Kanye).   super( null,  &#39;model&#39;, [])    this. assholeContent = []  }   bleachAsshole() {   if (! this. assholeContent.includes( &#39;bleach&#39;)) {   this. assholeContent.push( &#39;bleach&#39;)  }  } }   // Showtime!   const  kanye =  new Rapper( &#39;Kanye&#39;, [ new TShirt()])  const  model =  new Model()   model.bleachAsshole()    console.log(  kanye.feeling)  // &#39;ok&#39;    kanye.fuck(  model)    console.log(  kanye.feeling)  // &#39;like an asshole&#39;", "posttime": "2021-08-01 10:51:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,漂白,ontology,混蛋", "title": "Kanye 和漂白 T 恤的本体论。 JavaScript 实现", "title_en": "Kanye and the ontology of bleached T-shirts. A JavaScript implementation", "transed": 1, "url": "https://medium.com/@sebaaa1754/kanye-and-the-ontology-of-bleached-t-shirts-a-javascript-implementation-dcc7013b14bf", "via": "", "real_tags": ["java", "漂白", "ontology", "混蛋"]}, {"category": "", "categoryclass": "", "imagename": "0901b66940940046f23e9a8ba05ddca7.jpg", "infoid": 1070947, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "寻求休息：睡眠可能是对抗阿尔茨海默氏症的关键——也是一个巨大的商机", "note_en": "The quest for rest: Sleep could be the key to fighting Alzheimer’s—and a huge business opportunity", "posttime": "2021-08-01 10:51:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大数据,google,brain,buy,阿尔茨海默氏症", "title": "Google Brain 的联合创始人说，不要购买“大数据”炒作", "title_en": "Don’t buy the ‘big data’ hype, says cofounder of Google Brain", "transed": 1, "url": "https://fortune.com/2021/07/30/ai-adoption-big-data-andrew-ng-consumer-internet/", "via": "", "real_tags": ["大数据", "google", "brain", "buy", "阿尔茨海默氏症"]}, {"category": "", "categoryclass": "", "imagename": "e79863ae01f3161766ab75a160c1007e.jpg", "infoid": 1070946, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "独家——共和党众议员凯茜·麦克莫里斯·罗杰斯和吉姆·乔丹起草了一项立法，将取消对大型科技公司的第 230 条保护，并要求他们向联邦贸易委员会报告任何内容审核决定，熟悉该措施草案的消息人士称《通信规范法》的“有力”改革。由福克斯新闻独家获得的由众议院能源和商业委员会最高共和党人麦克莫里斯罗杰斯和众议院司法委员会最高共和党人乔丹起草的“讨论草案”立法将阻止大型科技公司使用第 230 条“沉默保守派”的责任保护。该法案将修订《通信法》第 230 条，规定豁免不适用于“某些公司”，并要求互联网平台公司“实施并维护合理且用户友好的上诉程序，以就平台上的内容做出决定。” 《通信规范法》第 230 条目前规定“任何交互式计算机服务的提供者或用户均不得被视为另一信息内容提供者提供的任何信息的发布者或发言人。”该部分在当今社交媒体巨头的崛起中起到了关键作用，因为它不仅允许互联网服务提供商——而且还允许谷歌、推特、Facebook、YouTube 和其他公司——免于承担第三方在其平台上发布的内容的责任，在大多数情况下案件。但一些右翼批评人士认为，如果科技巨头审查保守观点，他们不应再受益于第 230 条的保护。该法案草案将把谷歌、脸书、推特、亚马逊和微软等大公司从第 230 条全面责任保护中删除，并将它们置于拟议的“第 230A 条”之下，该条将要求公司对其“放大、宣传或推广的内容负责”。建议。”该法案草案还提议将公司的责任保护范围缩小到“不受第一修正案保护”的温和言论，并在五年内取消新的第 230A 条。\n该法案还要求这些公司每季度向联邦贸易委员会提交关于“内容执法决定和上诉以及其他目的”的文件。一位熟悉立法草案的消息人士告诉福克斯新闻，两位共和党立法者正在“联手”并公布这项立法草案，将其描述为剥夺大公司第 230 条保护的“最有力”的处理方式。 “不能再允许大型科技公司躲在第 230 条后面，”麦克莫里斯·罗杰斯告诉福克斯新闻，他说立法草案是他们“将大型科技公司从第 230 条中完全删除并赋予他们新的义务，让他们承担更多责任的解决方案”因为审查美国人。” “是时候揭露大型科技公司的偏见并确保他们公平对待受宪法保护的言论，”她说。乔丹补充说，大型科技公司“正在争取保守派”，并称该立法草案“建立在我们会议之前的工作基础上，旨在取消大型科技公司为逃避责任而隐藏的法律豁免权。”乔丹告诉福克斯新闻：“我们想听听我们的同事关于我们如何共同前进，最终停止审查互联网上保守派声音的消息。”", "note_en": "EXCLUSIVE – Republican Reps. Cathy McMorris Rodgers and Jim Jordan have drafted legislation that would remove Section 230 protections from  Big Tech companies and require them to report any content moderation decisions to the Federal Trade Commission, in what sources familiar with the draft measure say would be a &#34;robust&#34; reform of the Communications Decency Act.\n  The &#34;discussion draft&#34; legislation, penned by McMorris Rodgers, the top Republican on the House Energy and Commerce Committee, and Jordan, the top Republican on the House Judiciary Committee, exclusively obtained by Fox News, would prevent Big Tech  companies from using Section 230 liability protections to &#34;silence conservatives.&#34;\n The bill would amend Section 230 of the Communications Act to provide that immunity does not apply to &#34;certain companies&#34; and would require internet platform companies to &#34;implement and maintain reasonable and user-friendly appeals processes for decisions about content on the platforms.&#34;\n Section 230 of the Communications Decency Act currently states that &#34;no provider or user of an interactive computer service shall be treated as the publisher or speaker of any information provided by another information content provider.&#34;\n     The section has been pivotal in the rise of today&#39;s social media giants by allowing not only Internet service providers –­ but also Google, Twitter, Facebook, YouTube and others –to be shielded from liability from content posted on their platforms by third parties, in most cases. But some critics on the right believe that tech giants should no longer benefit from protections of Section 230 if they censor conservative viewpoints.\n The draft bill would remove large companies, like Google, Facebook, Twitter, Amazon and Microsoft, from Section 230 blanket liability protections and would place them under a proposed &#34;Section 230A,&#34; which would hold companies accountable for content they &#34;amplify, promote or suggest.&#34;\n  The draft bill also proposes narrowing companies’ liability protections to only moderate speech &#34;not protected by the First Amendment,&#34; and sunsets the new Section 230A in five years.\n The bill would also require the companies to submit quarterly filings to the Federal Trade Commission regarding &#34;content enforcement decisions and appeals and for other purposes.&#34;\n A source familiar with the draft legislation told Fox News that the two GOP lawmakers are &#34;joining forces&#34; and unveiling this draft legislation, characterizing it as &#34;the most robust&#34; treatment of stripping away Section 230 protections from major companies.\n &#34;Big Tech can no longer be allowed to hide behind Section 230,&#34; McMorris Rodgers told Fox News, saying that the draft legislation is their &#34;solution to remove Big Tech altogether from Section 230 and put them under new obligations that will hold them more accountable for censoring Americans.&#34;\n &#34;It’s time to expose Big Tech’s bias and make sure they treat constitutionally protected speech fairly,&#34; she said.\n  Jordan added that Big Tech is &#34;out to get conservatives,&#34; saying the draft legislation &#34;builds upon previous work by our conference to undo the legal immunity that Big Tech hides behind to evade accountability.&#34;\n &#34;We want to hear from our colleagues about how we can move forward together to finally stop the censoring of conservative voices on the internet,&#34; Jordan told Fox News.", "posttime": "2021-08-01 10:04:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "共和党人,republicans", "title": "众议院共和党人提出法案草案，以剥夺大型科技公司的第 230 条保护", "title_en": "House Republicans introduce draft bill to strip Big Tech companies of Section 230 protections", "transed": 1, "url": "https://www.foxbusiness.com/politics/house-republicans-draft-bill-to-strip-big-tech-companies-of-section-230-protections", "via": "", "real_tags": ["共和党人"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编写异步 javascript 时，您的代码将包含一堆 await 和 async、Promises 和回调。这是我们获取页面并计算 div 元素数量的示例：随着您编写越来越多的异步代码，您最终会编写大量的 await。在像 Python 和 Go 这样的语言中，你编写异步代码就好像它是同步的一样。如果我们可以在 Javascript 中做同样的事情呢？我厌倦了调用一个函数只是为了发现它返回一个 Promise 而不是一个真正的值。 n/async Javascript 使用您编写的代码，并将 await 放在每个表达式的前面。这听起来很疯狂，确实如此，但这里有一个演示：单击代码下方的 &gt; Show transpiled code 按钮以查看转换后的版本。正如您所看到的，插入了很多（不必要的）等待，但至少我们不必再自己编写它们，这肯定会将我们的生产力提高 10 倍。这种风格的 Javascript 允许我们编写异步代码，就好像它是同步的一样，但实际上它当然仍然是异步的。使用这种风格的 Javascript，您不能再同时执行两个异步任务，一切都将同步执行。例如，如果您想使用 fetch 发出请求，但只愿意等待两秒钟的结果，那么您就不走运了。其次，现在的编译器真的很聪明，但是在任何地方（包括它什么都不做的地方）散布在 await 中的用户代码可能不是编译器设计者优化的优先事项。\n使用它是为了好玩，在笔记本中的实验代码中使用它（如上面的示例），但请不要将其投入生产。不等待成员访问表达式（因为这会导致调用成员函数时出现问题）。例如： // n/async javascript input const x = myObject. abc(); // 转译输出 ( async () =&gt; { const x = await ( await myObject).ab c();})(); // 你可能会期待 ( async () =&gt; { const x = await ( await ( await ( await ( await myObject). a ). b ). c )();})();在实践中，这可能是你想要的。如果您确实需要等待成员变量，您可以自己编写等待。", "note_en": "When writing asynchronous javascript your code will contain a bunch of  await and  async,  Promises and maybe callbacks.\n Here’s an example where we fetch a page and count the amount of  div elements:\n  As you write more and more code that is asynchronous, you will end up writing  await quite a bit. In languages like Python and Go you write asynchronous code as if it’s synchronous. What if we could do the same in Javascript? I’m tired of calling a function only to find out it returns a Promise instead of a real value.\n  n/async Javascript takes the code you write, and puts  await in front of every expression. That sounds crazy, and it is, but here’s a demo:\n  Click the   &gt; Show transpiled code button below the code to see the transpiled version. As you can see a lot of (unnecessary) awaits got inserted, but at least we don’t have to write them ourselves anymore surely increasing our productivity 10x.\n   This flavor of Javascript allows us to write asynchronous code as if it is synchronous, but in reality of course it is still asynchronous. With this flavor of Javascript you can no longer do two asynchronous tasks at the same time, everything will be executed synchronously. For example if you want to make a request using  fetch, but are only willing to wait for two seconds for the result, you’re out of luck.\n Secondly, compilers these days are really smart, but user code sprinkling in  await everywhere (including places where it does nothing) likely was not a priority in optimization for the compiler designers.\n  Use it for fun, use it in experimental code in a notebook (like the above examples), but please don’t put this into production.\n  Member access expressions are not awaited (as  this would lead to issues when calling a member function). For example:\n // n/async javascript input  const  x  =  myObject. a. b. c(); // Transpiled output ( async () =&gt; { const  x  =  await ( await  myObject). a. b. c();})(); // What you may expect ( async () =&gt; { const  x  =  await ( await ( await ( await ( await  myObject). a). b). c)();})();\n In practice this likely what you want anyway. If you do need to await member variables you can just write await yourself.", "posttime": "2021-08-01 09:52:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,synchronous,编写", "title": "如果 JavaScript 具有同步异步风格会怎样？", "title_en": "What if JavaScript had a synchronous async flavor?", "transed": 1, "url": "https://guido.io/posts/nasync-javascript/", "via": "", "real_tags": ["java", "编写"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070943, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "相机双分辨率", "note_en": "Camera double resolution", "posttime": "2021-08-01 09:52:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ascii,分辨率", "title": "ASCII 码播放", "title_en": "ASCII Play", "transed": 1, "url": "https://play.ertdfgcvb.xyz/", "via": "", "real_tags": ["ascii", "分辨率"]}, {"category": "", "categoryclass": "", "imagename": "fa73f3d1244f57aec00b7b3bd57dfafc.jpeg", "infoid": 1070942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佛罗里达州奥兰多（美联社）-根据周六发布的联邦健康数据，佛罗里达州报告了 21,683 例新的 COVID-19 病例，这是该州自大流行开始以来的最高单日总数，因为其主题公园度假村再次开始要求游客在室内戴口罩。该州已成为该病毒的新国家震中，随着冠状病毒的高传染性三角洲变种继续传播，该州约占美国所有新病例的五分之一。佛罗里达州共和党州长 Ron DeSantis 拒绝强制实施口罩规定和疫苗要求，并且与州立法机构一起限制了地方官员实施旨在阻止 COVID-19 传播的限制的能力。德桑蒂斯周五禁止学区要求学生在下个月复课时戴口罩。最新数字于周五记录并于周六在美国疾病控制与预防中心的网站上发布。这些数字显示了阳光州病例数的上升速度：仅在一天前，佛罗里达州每天报告 17,093 例新病例。在疫苗接种普及之前，佛罗里达州之前的高峰是 1 月 7 日报告的 19,334 例病例。该州本周报告有 409 人死亡，自 2020 年 3 月首次死亡以来，总死亡人数超过 39,000。该州的高峰发生在 2020 年 8 月中旬，当时 7 天内有 1,266 人死亡。死亡通常会随着住院人数的增加而增加几周。德桑蒂斯将激增归咎于季节性增加——由于天气炎热，空调在传播病毒，更多的佛罗里达人待在室内。大约 60% 的 12 岁及以上的佛罗里达人接种了疫苗，在各州中排名中等。佛罗里达州医院协会周五表示，全州 COVID-19 住院人数接近去年的峰值，该州最大的医疗保健系统之一 AdventHealth 的佛罗里达州中部分部本周建议将不再进行非紧急手术以腾出资源对于 COVID-19 患者。\n周六，奥兰多环球影城度假村和海洋世界成为佛罗里达州最新的主题公园度假村，再次要求游客在室内戴口罩，环球影城还命令其员工戴上口罩，以防止在全州范围内激增的 COVID-19。周六，环球影城佛罗里达公园的所有员工都开始被要求在室内戴口罩，因为员工们重新开始保持社交距离。哈利波特与神偷奶爸的游乐设施还要求游客在室内自愿戴口罩，遵守联邦和当地的健康指南。 “客人和团队成员的健康和安全始终是我们的首要任务，”环球影业在一份声明中说。卫生官员周五宣布，佛罗里达州的冠状病毒病例在过去一周增加了 50%，该州的 COVID-19 住院人数接近去年的峰值。海洋世界周六在其网站上发布消息称，它建议游客遵循最近更新的联邦建议，并在室内戴上口罩。本周主题公园度假村的政策发生变化之前，美国疾病控制与预防中心建议每个人在室内戴口罩，无论疫苗接种情况如何。 Crosstown 的竞争对手沃尔特迪斯尼世界周五开始要求员工和 2 岁以上的客人戴口罩，但它也更进了一步。华特迪士尼公司在一份声明中表示，它将要求美国所有在现场工作的受薪和非工会小时工全面接种疫苗。\n尚未接种疫苗的迪士尼员工将有 60 天的时间进行接种，而那些仍在家里工作的员工在返回之前需要出示接种疫苗的证明。迪士尼表示正在与工会讨论疫苗要求，并补充说，所有新员工在开始工作之前都必须完全接种疫苗。", "note_en": "ORLANDO, Fla. (AP) — Florida reported 21,683 new cases of COVID-19, the state’s highest one-day total since the start of the pandemic, according to federal health data released Saturday, as its theme park resorts again started asking visitors to wear masks indoors.\n The state has become the new national epicenter for the virus, accounting for around a fifth of all new cases in the U.S. as the highly contagious delta variant of the coronavirus continues to spread.\n Republican Florida Gov. Ron DeSantis has resisted mandatory mask mandates and vaccine requirements, and along with the state Legislature, has limited local officials’ ability to impose restrictions meant to stop the spread of COVID-19. DeSantis on Friday barred school districts from requiring students to wear masks when classes resume next month.\n The latest numbers were recorded on Friday and released on Saturday on the U.S. Centers for Disease Control and Prevention’s  website. The figures show how quickly the number of cases is rising in the Sunshine State: only a day earlier, Florida reported 17,093 new daily cases. The previous peak in Florida had been 19,334 cases reported on Jan. 7, before the availability of vaccinations became widespread.\n  The state reported 409 deaths this week, bringing the total to more than 39,000 since its first in March 2020. The state’s peak happened in mid-August 2020, when 1,266 people died over a seven-day period. Deaths usually follow increases in hospitalizations by a few weeks.\n DeSantis has blamed the surge on a seasonal increase — more Floridians are indoors because of the hot weather with air conditioning circulating the virus. About 60% of Floridians 12 and older are vaccinated, ranking it about midway among the states.\n The Florida Hospital Association said Friday that statewide COVID-19 hospitalizations are nearing last year’s peak, and one of the state’s largest health care systems, AdventHealth’s Central Florida Division, this week advised it would no longer be conducting nonemergency surgeries in order to free up resources for COVID-19 patients.\n Universal Orlando Resort and SeaWorld on Saturday became the latest theme park resorts in Florida to again ask visitors to wear masks indoors, with Universal also ordering its employees to wear face coverings to protect against COVID-19, which has been surging across the state.\n All workers at Universal’s Florida park on Saturday started being required to wear masks while indoors as the employees returned to practicing social distancing. The home to Harry Potter and Despicable Me rides also asked visitors to follow federal and local health guidelines by voluntarily wearing face coverings indoors.\n “The health and safety of our guests and team members is always our top priority,” Universal said in a statement.\n Health officials on Friday announced that coronavirus cases in Florida had jumped 50% over the past week with COVID-19 hospitalizations in the state nearing last year’s peak.\n SeaWorld on Saturday posted on its website that it was recommending that visitors follow recently updated federal recommendations and wear face coverings while indoors.\n The change in policy this week at the theme park resorts came after the U.S. Centers for Disease Control and Prevention recommended that everyone wear masks indoors, regardless of vaccination status.\n Crosstown rival Walt Disney World started requiring employees and guests older than 2 to wear masks on Friday, but it also went a step further. The  Walt Disney Co. said in a statement that it will be requiring all salaried and non-union hourly employees in the U.S. who work on site to be fully vaccinated.\n Disney employees who aren’t already vaccinated will have 60 days to do so and those still working from home will need to show proof of vaccination before returning. Disney said it was discussing the vaccine requirements with the union, and added that all new hires will be required to be fully vaccinated before starting work at the company.", "posttime": "2021-08-01 09:51:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,breaks", "title": "佛罗里达州以超过 21,000 例新的 Covid 病例打破记录", "title_en": "Florida breaks record with more than 21,000 new Covid cases", "transed": 1, "url": "https://apnews.com/article/lifestyle-health-business-arts-and-entertainment-florida-01fa89e1d9491ab075c5deb689af1ea8", "via": "", "real_tags": ["covid", "breaks"]}, {"category": "", "categoryclass": "", "imagename": "21a9fc447e2c5f69724be9d2ea666d27.jpg", "infoid": 1070941, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名联邦法官对联邦调查局试图揭露其中一名匿名受害者的身份发出严厉谴责，该行动在 3 月份突袭中从加利福尼亚州比佛利山庄的保险箱中缴获了超过 8,600 万美元的现金、珠宝和其他贵重物品。现在，一项新的法律努力正试图迫使政府解释其对突袭行动的保密理由。在上周发布的一项裁决中，美国地区法官加里·克劳斯纳 (Gary Klausner) 拒绝了检察官要求驳回 Box 904 所有者提起的诉讼的请求，Box 904 是 3 月 22 日对美国私人金库的突击搜查期间联邦调查局查获的 600 多个保险箱之一。在法庭文件中化名“Charles Coe”的箱子持有人声称丢失了超过 900,000 美元的现金和其他贵重物品。在试图驳回诉讼的过程中，检察官还要求克劳斯纳强迫科在归还被扣押的财产之前公开表明自己的身份。克劳斯纳写道：“如果政府认为原告没有合法拥有第 904 号盒子的内容，政府当然可以在此基础上为这起诉讼辩护。” “但政府没有表明原告非法拥有从 904 号箱子中查获的物品。”后来，他补充说，政府对 Coe 的诉讼并非基于“纯粹的猜测，即原告可能非法拥有从 904 号箱子中查获的物品。”政府针对从美国私人金库中没收的数百个保险箱提起的大部分案件都是如此。当联邦调查局于 3 月 22 日突击搜查该设施时，特工手持一份手令，明确禁止他们没收保管在那里的保险箱内的物品。但联邦调查局还是将他们拘留了。 5 月，联邦调查局对没收的近 800 个箱子中的 369 个提起行政没收诉讼，其中包括超过 8500 万美元的现金和其他贵重物品。一个联邦大陪审团以多项罪名起诉美国私人金库，包括串谋洗钱和贩卖毒品。美国私人金库的共同所有人之一迈克尔·波利亚克 (Michael Poliak) 有着长期的犯罪历史，包括洗钱，并且可能使用“脏”钱购买了该公司的股份，根据一名卧底警察和本周早些时候由 The Daily Beast 发表。正如 Reason 先前报道的那样，检察官试图争辩说，公司所有者所谓的不当行为也应该将他们的客户变成嫌疑人。在法庭文件中，检察官说美国私人保险库的“一些”客户是“诚实的公民”，但争辩说“大多数盒子持有人是利用 USPV 的匿名性来隐藏其不义之财的犯罪分子。”\n但是，正如克劳斯纳所指出的，所有这些猜测还不足以对美国私人金库的客户在突袭中被洗劫一空的贵重物品进行实际起诉。 Poliak 也没有面临刑事指控。代表部分突袭受害者的律师表示，联邦调查局全面没收保险箱严重违反了第四修正案——类似于搜查公寓楼中的每个单元，因为管理公司被指控犯有某些罪行。与此同时，检察官坚持要求美国私人金库的匿名客户在寻求法律补救之前先表明身份，这违反了第五修正案对自证其罪的保护。联邦调查局已经归还了一些被扣押的保险箱中的物品，但只是在厚颜无耻地翻阅私人文件并可能错放一些保管箱持有人的贵重物品以寻找犯罪活动的证据之后才这样做的。美国私人金库传奇的一个主要部分仍然隐藏着，因为政府只开封了它声称首先用来证明突袭正当性的两个逮捕令中的一个。米歇尔·弗里德曼·格里斯 (Michelle Friedman Gerlis) 是 3 月 22 日在美国私人金库突袭行动中被没收财产的箱子持有人之一，本周向联邦地方法院提交了一项动议，要求公开所有搜查令和支持宣誓书。 “毫无疑问，Gerlis 女士有权获得政府在搜查和没收她的保险箱中的物品时声称依赖的文件副本，”代表 Gerlis（和其他受害者）的加州律师本杰明·格鲁克（Benjamin Gluck）说。突袭）在法庭文件中写道。 “事实上，法律明确规定，根据第四修正案，她享有获得这些权利的宪法权利。”围绕仍然保密的逮捕令的法律问题超出了 Gerlis 和美国私人金库传奇中其他原告所面临的严重法律问题。这些文件应该公开，因为它们可以揭示联邦调查局如何为其无耻突袭构建理由，导致数百名美国人在没有被指控犯罪的情况下可能损失金钱和宝贵资产。\n“ Reason 打算继续报道政府从美国私人保险库的客户那里扣押财产的情况，并主张第一修正案有权审查和告知公众有关授权材料的内容，” Reason 的出版商 Mike Alissi 在法庭文件中写道。星期。检察官似乎已经接近美国私人金库，假设他们可以强迫无辜的保险箱所有者披露他们的身份，以确保他们的财产归还 - 所有这些都无需提供不当行为的索赔。他们可以做到这一点，同时对自己的法律理由保密。联邦法院应继续以健康的怀疑态度关注这些论点。编者注：我们邀请评论并要求它们是文明的和主题的。我们不对评论进行审核或承担任何责任，这些评论归发表评论的读者所有。评论不代表 Reason.com 或 Reason Foundation 的观点。我们保留随时以任何理由删除任何评论的权利。举报滥用行为。每个人在家工作的绝佳机会……每天工作 3 到 8 人，并开始获得每月 17,000-19,000 美元的报酬……每周付款 了解更多详情 祝您好运……那个密码箱是国会的另一款三卡蒙特游戏从入门开始。那个密码箱里除了更多的借据外什么都没有。每个人在家工作的绝佳机会……每天工作 3 到 8 人，然后开始以每月 17,000 到 19,000 美元的汉族收入开始领取工资……每周付款 了解更多详情 祝你好运…… “当联邦调查局于 3 月突击搜查该设施时10 月 22 日，特工持有一份手令，明确禁止他们没收保管在那里的保险箱内的物品。”\n然而，不知何故，没有一个参与这种公然蔑视法庭的人受到惩罚。更不用说那种允许秘密搜查令的法官了。警察闯错房子杀人会受到惩罚吗？不。那么，为什么这些特工会因公然无视搜查令并窃取数百万现金和其他物品而受到惩罚？杀人更惨。让他们为此负责，很快人们就会要求他们对谋杀负责。天啊。是的，任何被发现违反法官明确书面指示的普通公民迟早都会发现自己在法官面前。这位法官似乎并不介意被忽视，这比单纯的好奇更糟糕。一个真正的记者甚至可能会走近他，问他为什么人们不理会他。法官知道如果他太用力地阻止联邦调查局会发生什么。这是自禁酒令以来建立的。对于拜登管理员和司法部来说，这是一个不错的开始。侵犯公民权利，无视法官的命令，再次强制戴口罩，使货币膨胀，输入病人并将他们转移到全国各地，重复冲洗泡沫。\n当您将个人财产存储在云中时，就会发生这种情况。云存储是一个由间谍机构支持的巨大骗局，因此他们可以自由地在国内进行间谍活动，甚至不会像在本地存储数据时一样获得授权。虽然确实应该责备的不是技术而是政府，但技术只是让政府更容易违反宪法。我当然希望他们在这样做时遵守 CA 的口罩规定。每一个公然违反他们的搜查令并搜查他们被明确禁止搜查的保险箱的联邦调查局特工都应该面临重大盗窃和侵犯公民权利的指控。在其他新闻中，由于最近退休的一大群特工，洛杉矶联邦调查局办公室有多个职位空缺。似乎有很多联邦调查局特工需要被监禁、被敲掉牙齿或两者兼而有之。分钟手为类似的罪行开枪射击。如果有人对这些联邦调查局小偷做了同样的事情，幸存下来并接受审判。那个人应该被无罪释放。需要让更多人了解陪审团无效。\n显然，美国宪法还没有进入联邦调查局的培训手册。原来是这样，但胡佛让他们撕掉了书页，死诗人协会的风格。 “根据卧底警官提交的一份宣誓书，迈克尔·波利亚克是美国私人金库的共同所有人之一，他的犯罪历史很长，包括洗钱，并可能用“脏”钱购买了该公司的股份。下一步：下次 A 的 B 被指控劫持其客户时，FBI 将没收其所有客户的所有账户，因为他们显然参与了……某事。联邦调查局已成为流氓犯罪组织，必须根据 RICO 的规定解散和起诉。整个机构中似乎没有一个诚实的代理人。他们无视宪法和誓言，他们就像政客一样，但更腐败。我们已经输了。最好尝试在 FBI 找到一份工作，或者露齿而笑（我们没有润滑的漏洞）。 “政府已经记录了至少 12 名协助庞大调查的机密线人。BuzzFeed News 对案件的审查还表明，其中一些线人在 FBI 的指导下发挥了比以前更大的作用报道。他们秘密工作，不仅仅是被动地观察和报告嫌疑人的行为。相反，他们几乎参与了所谓阴谋的各个方面，从一开始就参与其中。他们的参与程度引发了一个问题，即如果没有他们，是否还会有阴谋……\n这个说法是基于对法庭文件、笔录、证物、录音和其他文件的分析，以及对两打直接了解案件的人的采访，其中包括一些出席会议和培训课程的人检察官说，阴谋已经策划。除了 14 名原始被告中的一名外，其他所有人都表示不认罪，他们坚决否认自己参与了绑架任何人的阴谋……自 113 年前成立以来，联邦调查局一直依靠并经常向机密线人提供帮助刑事调查。 . .该战术的记录明显好坏参半。线人帮助制造了避免可怕暴力的案件。但线人在为联邦调查局工作期间也胁迫无辜者，伪造证据，甚至谋杀。该局对线人的依赖，在 1970 年代备受批评，在 9/11 之后受到了新的审查，当时他们被用来调查穆斯林团体涉嫌参与伊斯兰恐怖主义……如果国防能够破坏用于建造的方法密歇根案，它可能会增加关于政府正在对激进组织进行追捕的理论的重要性 - 并且，推而广之，即 1 月 6 日的起义是由联邦调查局设计的黑色行动。”我为加里·克劳斯纳法官及其家人的安全祈祷。如果他进一步阻挠联邦调查局，他家中的计算机上可能会神秘地发现儿童代言人。联邦调查局已成为联邦政府的有组织犯罪部门。需要关闭整个群体，将来公民会要求关闭。中央情报局也需要去。两者都腐败到核心并且失控。我们需要有联邦调查局官员的名字，他们认为简单地拿走别人的钱是合适的。那些是需要进监狱的人。", "note_en": "A federal judge issued a sharp rebuke to the FBI&#39;s attempt to expose the identity of one of the anonymous victims of a March raid that seized more than $86 million in cash, jewelry, and other valuables from safe deposit boxes in Beverly Hills, California. Now a new legal effort is seeking to force the government to explain its own still-secret justification for the raid.\n In a ruling issued last week, U.S. District Judge Gary Klausner  rejected prosecutors&#39; request to dismiss a lawsuit filed by the owner of Box 904, one of more than 600 safe deposit boxes  seized by the FBI during the March 22 raid of U.S. Private Vaults. The box-holder, identified in court documents under the pseudonym &#34;Charles Coe,&#34; claims to have lost more than $900,000 in cash and other valuables. In trying to get the lawsuit dismissed, prosecutors also asked Klausner to force Coe to identify himself publicly before returning the seized property.\n &#34;If the government believes that plaintiff did not lawfully possess the contents of box number 904, the government can, of course, defend this suit on that basis,&#34; Klausner  wrote. &#34;But the government has made no showing that plaintiff possessed the items seized from box number 904 unlawfully.&#34;\n Later, he added that the government&#39;s case against Coe has not been based on &#34;anything more than pure conjecture that plaintiff  might have unlawfully possessed the items seized from box number 904.&#34;\n That&#39;s been true for much of the government&#39;s case against the hundreds of safe deposit boxes seized from U.S. Private Vaults. When the FBI raided the facility on March 22, agents were armed with a warrant that  explicitly forbade them from  seizing the contents of the safe deposit boxes kept there. But the FBI took them into custody anyway. In May, the FBI filed administrative forfeiture proceedings against 369 of the nearly 800 boxes seized—including more than $85 million in cash and other valuables.\n A federal grand jury indicted U.S. Private Vaults on a number of charges, including conspiracy to launder money and sell drugs. Michael Poliak, one of the co-owners of U.S. Private Vaults, has a lengthy criminal history that includes money laundering and may have used &#34;dirty&#34; money to purchase a stake in the company, according to an affidavit filed by an undercover police officer and  published earlier this week by  The Daily Beast.\n As  Reason has  previously reported, prosecutors have  tried to argue that the alleged misdeeds of the company&#39;s owners should turn their customers into suspects, too. In court filings, prosecutors have said &#34;some&#34; of U.S. Private Vaults&#39; customers were &#34;honest citizens,&#34; but contended that &#34;the majority of the box-holders are criminals who used USPV&#39;s anonymity to hide their ill-gotten wealth.&#34;\n But all that conjecture, as Klausner noted, has not yet added up to much in the way of actual prosecutions against U.S. Private Vaults&#39; customers who had their valuables swept up in the raid. Poliak is not facing criminal charges either.\n Lawyers representing some of the raid&#39;s victims say the FBI&#39;s sweeping seizure of the safe deposit boxes was a serious violation of the Fourth Amendment—akin to searching every unit in an apartment building because the management company stands accused of some crime. Meanwhile, prosecutors&#39; insistence that U.S. Private Vaults&#39; anonymous clients identify themselves before being able to seek a legal remedy runs afoul of the Fifth Amendment&#39;s protections against self-incrimination.\n The FBI has  returned the contents from some of the seized safe deposit boxes, but only after brazenly rifling through private documents and  potentially misplacing some box-holders&#39; valuables in an apparent attempt to find evidence of criminal activity.\n A major piece of the U.S. Private Vaults saga remains hidden, as the government has unsealed only one of the two warrants that it claims were used to justify the raid in the first place.\n Michelle Friedman Gerlis, one of the box-holders whose property was seized as part of the March 22 raid at U.S. Private Vaults, filed a motion in federal district court this week requesting that all warrants and supporting affidavits be made public.\n &#34;There is no question that Ms. Gerlis is entitled to copies of the documents that the government purported to rely on when it searched and seized the contents of her safety deposit boxes,&#34; Benjamin Gluck, the California attorney representing Gerlis (and other victims of the raid)  wrote in court filings. &#34;Indeed, the law is clear that she has a constitutional right of access to them under the Fourth Amendment.&#34;\n The legal issues surrounding the still-secret warrant go beyond the acute legal issues facing Gerlis and the other plaintiffs in the U.S. Private Vaults saga. Those documents should be made public because of what they could reveal about how the FBI constructed a rationale for its brazen raid that resulted in hundreds of Americans potentially losing money and valuable assets despite not being charged with a crime.\n  &#34; Reason intends to continue reporting on the Government&#39;s seizure of property from customers of U.S. Private Vaults and asserts a First Amendment right to review and inform the public about the content of the warrant material,&#34; writes Mike Alissi,  Reason&#39;s publisher,  in court filings this week.\n Prosecutors seem to have approached the U.S. Private Vaults under the assumption that they can force innocent safe deposit box owners to disclose their identities in order to secure the return of their property—all without providing claims of wrongdoing. And that they can do that while keeping their own legal justifications secret. Federal courts should continue to eye those arguments with a healthy degree of skepticism.\n    Editor&#39;s Note: We invite comments and request that they be civil and on-topic. We do not moderate or assume any responsibility for comments, which are owned by the readers who post them. Comments do not represent the views of Reason.com or Reason Foundation. We reserve the right to delete any comment for any reason at any time.  Report abuses.\n  Fantastic work-from-home opportunity for everyone… Work for three to eight a day and startING getting paid ind the range of 17,000-19,000 dollars a month… Weekly payments Learn More details Good luck…\n  That lockbox was another of Congress’s Three Card Monte games from the get-to. There’s nothing in that lockbox except more IOUs.\n    Fantastic work-from-home opportunity for everyone… Work for three to eight a day and start getting paid inSd the Han range of 17,000-19,000 dollars a m0nth… Weekly payments Learn More details Good luck…\n  “When the FBI raided the facility on March 22, agents were armed with a warrant that explicitly forbade them from seizing the contents of the safe deposit boxes kept there.”\n  And yet, somehow, not a single person engaged in this blatant contempt of court has been punished. Not to mention the kind of judge that allows secret warrants.\n Are cops punished when they raid the wrong house and kill people? No. So why should these agents be punished for blatantly ignoring a warrant and stealing millions in cash and other goods? Killing people is a lot worse. Hold them accountable for this and soon people will demand they be held accountable for murder. Jeez.\n  Yep, any ordinary citizen found violating the expressed written directives of a judge is going to find himself in front of that judge sooner rather than later.\n  That this judge doesn’t seem to mind being ignored is something worse than a mere curiosity.\n  An actual journalist might even approach him and ask why he’s ok with people ignoring him.\n The judge knows what happens if he cock-blocks the feds too hard. That’s been established since Prohibition.\n  Not a bad start for the Biden admin and DOJ. Violate civil rights, ignore orders from judges, make masking mandatory again, inflate currency, import sick people and move them around the country, lather rinse repeat.\n  This is the kind of shit that happens when you store your personal property in the cloud.\n Cloud storage is a huge scam supporting by spying agencies so then they can freely spy domestically and not even both getting a warrant like they still have to if its data stored locally.\n  While its true that its not the tech that is to blame but the government, the tech is just making it easier government to get away with violating the constitution.\n  I sure hope they complied with CA’s mask mandate when they did this.\n    Every FBI agent that brazenly violated their warrant and searched the safety deposit boxes that they were explicitly forbidden from searching should be facing charges of grand theft and violation of civil rights.\n    In other news, the Los Angeles FBI office has multiple openings as a large group of agents recently retired.\n  There appears to be a lot of FBI agents that need to be incarcerated, have their teeth knocked out or both. The minutemen shot redcoats for similar offenses. Should someone have done the same to these fbi thieves, survived and stood trial. That person should be acquitted. More folks need to be made aware of jury nullification.\n  Apparently the u s constitution hasn’t made it into the FBI training manual yet.\n It originally was, but Hoover made them tear the pages out, Dead Poets Society style.\n  “Michael Poliak, one of the co-owners of U.S. Private Vaults, has a lengthy criminal history that includes money laundering and may have used “dirty” money to purchase a stake in the company, according to an affidavit filed by an undercover police officer”\n  Next step: The next time B of A is accused of shellacking its customers, the FBI will seize all the accounts of all their customers, since they were obviously involved in… something.\n  The FBI has become a rogue criminal organization, that must be disbanded and prosecuted under the RICO statues. There doesn’t seem to be an honest agent in the entire agency. They ignore the Constitution and the oath they swore, they’re just like politicians but more corrupt.\n We already lost. Best to try to get a job with the FBI or grin and bare it (our unlubed a-holes).\n  “The government has documented at least 12 confidential informants who assisted the sprawling investigation.. An examination of the case by BuzzFeed News also reveals that some of those informants, acting under the direction of the FBI, played a far larger role than has previously been reported. Working in secret, they did more than just passively observe and report on the actions of the suspects. Instead, they had a hand in nearly every aspect of the alleged plot, starting with its inception. The extent of their involvement raises questions as to whether there would have even been a conspiracy without them…\n  This account is based on an analysis of court filings, transcripts, exhibits, audio recordings, and other documents, as well as interviews with more than two dozen people with direct knowledge of the case, including several who were present at meetings and training sessions where prosecutors say the plot was hatched. All but one of the 14 original defendants have pleaded not guilty, and they vigorously deny that they were involved in a conspiracy to kidnap anyone…\n  Since its founding 113 years ago, the FBI has relied upon, and often paid, confidential informants to aid in criminal investigations. . .The tactic has a decidedly mixed record. Informants have helped make cases that averted terrible violence. But informants have also coerced innocent people, falsified evidence, and even committed murder while working for the FBI. The bureau’s reliance on informants, much criticized in the 1970s, received renewed scrutiny in the wake of 9/11, when they were used to probe Muslim groups for alleged involvement in Islamic terrorism… if the defense is able to undermine the methods used to build the Michigan case, it could add weight to the theory that the administration is conducting a witch hunt against militant groups — and, by extension, that the Jan. 6 insurrection was a black op engineered by the FBI.”\n  I pray for the safety of Judge Gary Klausner and his family. If he cock-blocks the FBI any further, child pron may be mysteriously found on computers in his home.\n  The FBI has become an organized crime arm of the Federal Govt. That whole bunch needs to be shut down, and in the future, citizen will demand it. The CIA needs to go, too. Both are corrupt to the core and out of control.\n  We need to have the names of the FBI officials who deemed it proper to simply take other peoples’ money. Those are the people that need to go to jail.", "posttime": "2021-08-01 09:51:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "法官,deposit,联邦调查局", "title": "联邦法官称，FBI 以“纯猜想”为由从保险箱中查获 90 万美元", "title_en": "FBI Seized $900K from Safe Deposit Box on 'Pure Conjecture,' Federal Judge Says", "transed": 1, "url": "https://reason.com/2021/07/29/fbi-seized-900000-from-safe-deposit-box-on-pure-conjecture-federal-judge-says/", "via": "", "real_tags": ["法官", "deposit", "联邦调查局"]}, {"category": "", "categoryclass": "", "imagename": "11076fe5d78a59bb32d6b89b23d307e6.jpg", "infoid": 1070939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "EA 表示，被盗数据中没有包含玩家数据，本周泄露的数据证实了这一点。上个月入侵电子艺界的黑客在未能敲诈该公司并随后将被盗文件出售给第三方买家后，已释放了整个被盗数据缓存。 7 月 26 日星期一在地下网络犯罪论坛上倾倒的数据现在正在洪流站点上广泛分发。根据 The Record 获得的转储副本，泄露的文件包含 FIFA 21 足球游戏的源代码，包括支持该公司服务器端服务的工具。此次泄漏的存在最初于 6 月 10 日披露，当时黑客在一个地下黑客论坛上发布了一个帖子，声称拥有 EA 数据，他们愿意以 2800 万美元的价格出售这些数据。在接受 Motherboard 采访时，黑客声称在从名为 Genesis 的暗网市场为 EA 内部 Slack 频道购买身份验证 cookie 后获得了对数据的访问权限。黑客表示，他们使用身份验证 cookie 模仿已登录的 EA 员工帐户并访问 EA 的 Slack 频道，然后欺骗 EA IT 支持人员授予他们访问公司内部网络的权限。\n然后，黑客从该公司的内部代码库中下载了超过 780GB 的源代码。虽然最初黑客们希望从 EA 黑客中赚到一大笔钱，但他们未能在地下市场找到任何买家，因为被盗数据大多是源代码，对其他网络犯罪集团没有任何价值，其中大部分是主要是用户个人或财务数据。在找不到买家后，黑客试图勒索 EA，要求该公司支付一笔未公开的款项，并避免数据在网上泄露。最初，他们在 7 月 14 日发布了 1.3GB 的 FIFA 源代码缓存，但在 EA 避开他们的威胁两周后才发布了全部数据。在完整数据发布后发给 The Record 的一份声明中，EA 确认在黑客入侵期间“没有访问过任何玩家数据”，因此该公司“没有理由相信玩家隐私存在任何风险”的泄漏。 “事件发生后，我们已经进行了安全改进，预计不会对我们的游戏或业务产生影响，”EA 发言人告诉 The Record。 “作为正在进行的刑事调查的一部分，我们正在与执法官员和其他专家积极合作。”", "note_en": "EA says no player data was included in the stolen data, confirmed by the data leaked this week.\n  The hackers who breached Electronic Arts last month have released the entire cache of stolen data after failing to extort the company and later sell the stolen files to a third-party buyer.\n The data, dumped on an underground cybercrime forum on Monday, July 26, is now being widely distributed on torrent sites.\n According to a copy of the dump obtained by  The Record, the leaked files contain the source code of the FIFA 21 soccer game, including tools to support the company’s server-side services.\n  The existence of this leak was initially disclosed on June 10, when the hackers posted a thread on an underground hacking forum claiming to be in possession of EA data, which they were willing to sell  for $28 million.\n In an interview with Motherboard, the hackers claimed to have gained access to the data after buying  authentication cookies for an EA internal Slack channel from a dark web marketplace called  Genesis.\n The hackers said they used the authentication cookies to mimick an already-logged-in EA employee’s account and access EA’s Slack channel and then trick an EA IT support staffer into granting them access to the company’s internal network.\n From there, the hackers then proceeded to download more than 780GB of source code from the company’s internal code repositories.\n While initially, the hackers hoped to earn a big payday from the EA hack, they failed to find any buyers on the underground market, as the stolen data was mostly source code that lacked any value for other cybercrime groups, most of which are interested in user personal or financial data primarily.\n After failing to find a buyer, the hackers  tried to extort EA, asking the company to pay an undisclosed sum and avoid having the data leaked online.\n Initially, they released a cache of 1.3GB of FIFA source code on July 14, only to release the entire data two weeks later after EA shunned their threats.\n In a statement sent to The Record after the release of the full data, EA confirmed that “no player data was accessed” during the hackers’ intrusion and the company has “no reason to believe there is any risk to player privacy” as a result of the leak.\n “Following the incident, we’ve already made security improvements and do not expect an impact on our games or our business,” an EA spokesperson told  The Record. “We are actively working with law enforcement officials and other experts as part of this ongoing criminal investigation.”", "posttime": "2021-08-01 09:50:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,敲诈勒索,leak,ea", "title": "敲诈勒索失败后，黑客泄露了完整的 EA 数据", "title_en": "Hackers leak full EA data after failed extortion attempt", "transed": 1, "url": "https://therecord.media/hackers-leak-full-ea-data-after-failed-extortion-attempt/", "via": "", "real_tags": ["黑客", "敲诈勒索", "leak", "ea"]}, {"category": "", "categoryclass": "", "imagename": "ea823b95affd8aaadfd7cf64fe313f8e.png", "infoid": 1070938, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "刚开始用 Go 和 gin 框架开发网站的时候，很遗憾 gin 没有实时加载功能。其实我尝试了fresh，好像不太灵活，所以打算改写一个更好的。终于，Air 诞生了。此外，非常感谢 pilu，没有新鲜，没有空气 :) Air 是另一个用于开发中的 Go 应用程序的实时重新加载命令行实用程序。只需在您的项目根目录中放空，不要管它，专注于您的代码。 # 二进制文件将是 $(go env GOPATH)/bin/aircurl -sSfL https://raw.githubusercontent.com/cosmtrek/air/master/install.sh | sh -s -- -b $(go env GOPATH )/bin # 或安装到 ./bin/curl -sSfL https://raw.githubusercontent.com/cosmtrek/air/master/install.sh | sh -sair -v docker run -it --rm \\ -w &quot;&lt;PROJECT&gt; &quot; \\ -e &quot;air_wd=&lt;PROJECT&gt; &quot; \\ -v $(pwd ): &lt;PROJECT &gt; \\ -p &lt;PORT &gt;: &lt;APP服务器端口 &gt; \\ cosmtrek/air -c &lt;CONF &gt; docker run -it --rm \\ -w &quot;/go/src/github.com/cosmtrek/hub&quot; \\ -v $(pwd ):/go/src/github .com/cosmtrek/hub \\ -p 9090:9090 \\ cosmtrek/air 您可以使用默认设置运行以下命令将 .air.toml 配置文件初始化到当前目录。在此之后，您只需运行 air 命令而无需其他参数，它将使用 .air.toml 文件进行配置。\n请注意，它需要 Go 1.13+，因为我使用 go mod 来管理依赖项。 # 1. fork 这个项目 # 2. clone itmkdir -p $GOPATH/src/github.com/cosmtrek cd $GOPATH/src/github.com/cosmtrekgit clone git@github.com: &lt;YOUR USERNAME &gt;/air.git # 3. 安装依赖 cd airmake ci # 4. 探索并快乐hacking！make install # 1. checkout to mastergit checkout master# 2. 添加需要发布的版本git tag v1.xx.x# 3. push to remotegit push origin v1.xx.x ci 将处理并发布新版本，等待大约 5 分钟您可以获取新版本。", "note_en": "When I get started with developing websites in Go and  gin framework, it&#39;s a pitythat gin lacks live-reloading function. In fact, I tried  fresh and it seems not muchflexible, so I intended to rewrite it in a better way. Finally, Air&#39;s born.In addition, great thanks to  pilu, no fresh, no air :)\n Air is yet another live-reloading command line utility for Go applications in development. Just  air in your project root directory, leave it alone,and focus on your code.\n      # binary will be $(go env GOPATH)/bin/aircurl -sSfL https://raw.githubusercontent.com/cosmtrek/air/master/install.sh  | sh -s -- -b   $(go env GOPATH )/bin  # or install it into ./bin/curl -sSfL https://raw.githubusercontent.com/cosmtrek/air/master/install.sh  | sh -sair -v\n    docker run -it --rm \\ -w   &#34;&lt;PROJECT&gt; &#34; \\ -e   &#34;air_wd=&lt;PROJECT&gt; &#34; \\ -v   $(pwd ): &lt;PROJECT &gt; \\ -p  &lt;PORT &gt;: &lt;APP SERVER PORT &gt; \\ cosmtrek/air -c  &lt;CONF &gt;\n  docker run -it --rm \\ -w   &#34;/go/src/github.com/cosmtrek/hub &#34; \\ -v   $(pwd ):/go/src/github.com/cosmtrek/hub \\ -p 9090:9090 \\ cosmtrek/air\n       You can initialize the  .air.toml configuration file to the current directory with the default settings running the following command.\n  After this you can just run the  air command without additional arguments and it will use the  .air.toml file for configuration.\n         Please note that it requires Go 1.13+ since I use  go mod to manage dependencies.\n # 1. fork this project  # 2. clone itmkdir -p  $GOPATH/src/github.com/cosmtrek cd  $GOPATH/src/github.com/cosmtrekgit clone git@github.com: &lt;YOUR USERNAME &gt;/air.git  # 3. install dependencies cd airmake ci  # 4. explore it and happy hacking!make install\n   # 1. checkout to mastergit checkout master# 2. add the version that needs to be releasedgit tag v1.xx.x# 3. push to remotegit push origin v1.xx.xthe ci will processing and will release new version,wait about 5 min you can fetch the new version.", "posttime": "2021-08-01 08:49:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,live,air", "title": "Air – 使用 Go 开发时实时重新加载", "title_en": "Air – Live reload when developing with Go", "transed": 1, "url": "https://github.com/cosmtrek/air", "via": "", "real_tags": ["开发", "live", "air"]}, {"category": "", "categoryclass": "", "imagename": "91da791a963e050c244c8cd259d80974.jpg", "infoid": 1070936, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "13 岁时，伊恩曼努埃尔被捕并被指控犯有非杀人罪，导致他被判处死在佛罗里达州的监狱中。 EJI 接受了他的案件并辩称，将一名 13 岁的儿童判处无期徒刑的无期徒刑是残忍和不寻常的惩罚。 2016 年，EJI 赢得了 Manuel 先生的释放。今天，Manuel 先生发布了一本强有力的回忆录，记录了他从童年在坦帕最暴力和最虐待的住房项目中，经过 18 年的单独监禁，到自由的斗争。我的时代即将到来：犯罪、惩罚、希望和救赎的回忆录讲述了伊恩从婴儿时期遭受的虐待、忽视和暴力，直到 1990 年，当时 13 岁的伊恩在年长的少年的指导下犯下一起抢劫案。在这次拙劣的抢劫企图中，一名妇女受了非致命枪伤。伊恩向警方自首，并被指控为成年人持械抢劫和谋杀未遂。伊恩的律师指示他认罪，并告诉他将被判 15 年徒刑。伊恩承认对自己的行为负责并认罪，但被判处终身监禁，不得假释。伊恩成为美国被判死在监狱中的最年幼的孩子之一\n由于他还是个小男孩，州监狱官员决定将伊恩单独监禁，并在那里待了 18 年。长期的隔离极具挑战性、虐待性和破坏性。由于很少与外界接触，伊恩向枪击受害者黛比·伯科维茨伸出手，请求她的原谅，她给予了原谅。一种非凡的关系出现了，贝尔科维茨女士成为伊恩减刑的支持者。但法院没有回应。 EJI 接手了 Ian 的案件，作为我们结束对儿童过度惩罚的努力的一部分。在他的案件正在等待上诉期间，最高法院在格雷厄姆诉佛罗里达案中裁定，儿童不能因伊恩这样的非杀人罪而被判处终身监禁且不得假释。但佛罗里达州辩称，格雷厄姆不适用于伊恩的案件，因为即使没有人被杀，谋杀未遂也是一种杀人罪。 EJI 在上诉中对这一论点提出质疑，并赢得一致裁决，驳回了国家的论点并撤销了 Ian 的终身不得假释判决。该州向美国最高法院提出上诉，但法院驳回了该州的复审请求。在他的重判听证会上，伊恩告诉法庭，他和伯科维茨女士一直在“等待司法系统赶上我的悔恨和她的宽恕”。 2016 年，伊恩在被监禁 26 年后获释。他通过与 Berkovits 女士和 EJI 员工共进晚餐来庆祝他的自由。五年后，曼努埃尔先生利用他的写作才能分享他的生存故事，并倡导结束对儿童的单独监禁。\n“18 年来，我的房间里没有一扇窗户来分散我对监禁强度的注意力，”他在《纽约时报》的一篇专栏文章中写道。 “我不被允许与我的囚犯同伴甚至是我自己交谈。我没有健康、有营养的食物；我得到的只是足够不死。”像这样的条件使被单独监禁的人面临更大的自残和自杀风险、精神疾病恶化以及释放后更高的死亡率。 “监狱是一头野兽，但单独监禁对我的灵魂造成的伤害肯定比在一般监狱中所受到的伤害更大，”曼努埃尔先生告诉洛杉矶时报。伊恩在 2007 年杰克逊维尔联邦法官听证会上的视频证词中说，他的单独监禁生活是一种“完全绝望”的生活。没有节目或课程，没有访客，没有电话，也没有人情味，没有书籍、杂志、电视和收音机，也被禁止说话，甚至不能看他的牢房门外，伊恩在 17 岁时开始割伤自己。”它让我从难以忍受的麻木中解脱出来，”他说。绝望驱使他绝食，服药过量，并自焚。监狱的回应是拿走他的衣服、床垫和床单。据《圣彼得堡时报》报道，在伊恩作证试图自杀以“结束痛苦”之后，联邦法官非常沮丧，他不得不休庭并离开法庭。美国是唯一一个将长期隔离作为监狱管理常规工具的先进国家。联合国囚犯待遇标准禁止单独监禁超过 15 天，称其为“残忍、不人道或有辱人格的”。巴拉克奥巴马总统于 2016 年禁止在联邦监狱系统中对青少年进行单独监禁，并写道这可能会产生“毁灭性的、持久的心理后果”，包括增加自杀风险，尤其是对于青少年和患有精神疾病的人。\n但是太多的州没有效仿联邦政府的做法，单独监禁在美国仍然很普遍——即使是对儿童也是如此。据估计，在任何一天，至少有 80,000 名被监禁的男人、女人和儿童被某种形式的隔离监禁。 “我目睹了太多人在与世隔绝时失去理智，”曼努埃尔先生写道。就像他用自己的想象力在孤立中度过了 18 年一样，他现在决心用自己的写作来确保没有其他孩子必须忍受他所做的一切。", "note_en": "At age 13, Ian Manuel was arrested and charged with a nonhomicide offense that resulted in him being sentenced to die in a Florida prison.\n EJI took on his  case and argued that it is cruel and unusual punishment to sentence a 13-year-old child to life imprisonment with no chance for parole. EJI won Mr. Manuel’s release in 2016.\n Today, Mr. Manuel has released a powerful memoir documenting his struggle from childhood in Tampa’s most violent and abusive housing projects, through 18 years of solitary confinement, to freedom.\n My Time Will Come: A Memoir of Crime, Punishment, Hope, and Redemption, tells of the abuse, neglect, and violence Ian suffered from infancy up to the moment in 1990 when 13-year-old Ian was directed by older juveniles to commit a robbery.\n During the botched robbery attempt, a woman suffered a nonfatal gunshot wound. Ian turned himself in to the police and was charged as an adult with armed robbery and attempted murder.\n Ian’s attorney instructed him to plead guilty and told him he would receive a 15-year sentence. Ian accepted responsibility for his actions and pleaded guilty but was sentenced to life imprisonment without possibility of parole.\n Ian became one of the youngest children condemned to die in prison in the U.S.\n Because he was a very small boy, state prison officials decided to place Ian in solitary confinement, where he remained for the next 18 years. The extended isolation was extremely challenging, abusive, and destructive.\n With few contacts on the outside, Ian reached out to the shooting victim, Debbie Berkovits, to ask for her forgiveness, which she gave. A remarkable relationship emerged in which Ms. Berkovits became a supporter for a reduced sentence for Ian. But courts were nonresponsive.\n EJI took on Ian’s case as part of our effort to  end excessive punishment of children. While his case was pending on appeal, the Supreme Court decided in  Graham v. Florida that children cannot be sentenced to life imprisonment without parole for nonhomicide offenses like Ian’s.\n But the State of Florida argued that  Graham did not apply to Ian’s case because attempted murder is a homicide offense even though no one was killed. EJI challenged that argument on appeal and  won a unanimous ruling rejecting the State’s argument and vacating Ian’s life-without-parole sentence. The State appealed to the U.S. Supreme Court, but the Court  denied the State’s request for review.\n At his resentencing hearing, Ian told the court that he and Ms. Berkovits have been “waiting for the justice system to catch up to my remorse and her forgiveness.”\n In 2016, Ian was  released from prison after 26 years of imprisonment. He celebrated his freedom by having dinner with Ms. Berkovits and EJI staff.\n Five years later, Mr. Manuel is using his writing talents to share his story of survival and advocate for ending solitary confinement for children.\n “For 18 years I didn’t have a window in my room to distract myself from the intensity of my confinement,” he  wrote in an op-ed for The New York Times. “I wasn’t permitted to talk to my fellow prisoners or even to myself. I didn’t have healthy, nutritious food; I was given just enough to not die.”\n Conditions like these put people held in solitary confinement at  increased risk for self-harm and suicide, exacerbated mental illness, and higher rates of death after release.\n “Prison is a beast, but solitary confinement definitely did more damage to my soul than being in the general prison population would have,” Mr. Manuel  told the Los Angeles Times.\n His life in solitary confinement was one of “complete hopelessness,” Ian said in video testimony at a 2007 hearing before a federal judge in Jacksonville. With no programs or classes, no visitors, phone calls, or human touch, deprived of books, magazines, TV, and radio, and barred from talking or even looking out of his cell door, Ian began cutting himself when he was 17. “It gave me relief from the intolerable numbness,” he  said.\n Hopelessness drove him to go on a hunger strike, overdose on pills, and set himself on fire. The prison’s response was to take away his clothes, mattress, and sheet. After Ian testified about trying to kill himself “to end the pain,” the St. Petersburg Times  reported, the federal judge was so upset he had to call a recess and leave the courtroom.\n The U.S. is the  only advanced nation that uses prolonged isolation as a routine tool of prison management. United Nations standards on the treatment of prisoners prohibit solitary confinement for more than 15 days, declaring it “ cruel, inhuman or degrading.”\n President Barack Obama  banned solitary confinement for juveniles in the federal prison system in 2016, writing that it can have “devastating, lasting psychological consequences,” including an increased risk of suicide, especially for juveniles and people with mental illnesses.\n But too many states failed to follow the federal government’s lead, and solitary confinement is still common across the U.S.—even for children. It is  estimated that at least 80,000 incarcerated men, women, and children are held in some form of isolated confinement on any given day.\n “I witnessed too many people lose their minds while isolated,” Mr. Manuel wrote. Just as he used his imagination to survive 18 years in isolation, he’s now determined to use his writing to make sure no other child has to endure what he did.", "posttime": "2021-08-01 08:48:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "惩罚,manuel,伊恩", "title": "伊恩曼努埃尔，过度惩罚儿童的幸存者，讲述了他的故事", "title_en": "Ian Manuel, Survivor of Excessive Child Punishment, Tells His Story", "transed": 1, "url": "https://eji.org/news/ian-manuel-survivor-of-excessive-child-punishment-tells-his-story/", "via": "", "real_tags": ["惩罚", "manuel", "伊恩"]}]