[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1012850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近的一次客户情况让人想起电影“苏格兰最后的国王”中的以下场景。\n1971年，伊迪·阿明(Idi Amin)在乌干达掌权后不久，驱逐了所有印度人，声称他们是给奶牛挤奶但不喂食的水蛭(乌干达经济由印度商人控制，这些商人是库利斯家族(Coolies)的后代，他们移居东非为英国人修建铁路)。\n你为什么不告诉我不要驱逐印第安人？&34；伊迪·阿明问他的苏格兰顾问(图中左边的那个人)。\n他的导师回答说，我告诉过你，你不记得某某时间某地……。\n多年来，我们认识到，为咨询客户提出可行的解决方案通常是最容易的部分。让他们采用它通常比较困难。就背景而言，我们是CRO(转换率优化)顾问。我们通过优化网站的登陆页面以及其他营销辅助手段--展示广告、电子邮件序列，甚至呼叫中心脚本--帮助高流量网站创造更多收入。\n以下是客户可能不想使用优化的营销材料的几个原因。接下来，我与大家分享我们成功使用过的说服技巧。\n客户可能拒绝测试我们设计的优化页面的常见原因例如，一个客户--一家上市公司--不喜欢为其核心产品提供较长的表单页面，因为简洁性是其品牌标识的一部分。在他们看来，一个很长的页面违背了他们身份的这一部分。\n尽管所有咨询的核心前提是你是应该给出方向的人，但没有人喜欢别人告诉你该做什么。这是我在咨询生涯早期犯下的一个新手错误。\n虽然雇用我们的高管最关心的是业务结果，但他们通常依赖员工来实施我们的优化设计。这些员工中的一些人可能已经创建了旧页面，并对它们产生了依恋之感。这只是人性的表现，表现在“不是在这里发明的”综合症！\n例如，最近，我们正在为CPG(消费品包装)行业的一位客户开发一个订阅计划。当他看到优化页面上的标题时，他的反应是“这听起来像是一种威胁。你似乎不明白为什么人们会报名参加这个项目。“。这通常不是因为马虎，而是因为我们还没有获得作为客户所带来的“默契”。在让网站获胜的过程中，CRO先驱卡尔·布兰克斯说：\n“默会知识是很难从别人的话里学到的知识。再多的解释也无法传达经验的深度。或许欣赏它力量的最好方法是阅读下面的列表：为人父母；患有偏头痛；xxxx；Bing tewed…“。\n换句话说，从外面往里看，你是看不懂的。从里面往外看，你无法解释！默会知识不是短短几周就能轻易掌握的。\n说服客户的有效技巧正如Jonah Berger在他的新书The Catalyst[1]中指出的那样，如果你只提出一种解决方案，客户往往会花时间去戳洞。但当你提供选择时，它会给他们一种控制感--这是我们人类都渴望的！\n我们通常会提出一个保守和激进的版本。保守派保留控件上的大部分元素不变，但添加或进行少量更改。激进的“为栅栏摇摆”。这样，我们在第一次测试中获胜的几率就增加了，这就为我们赢得了可信度，使我们更容易尝试更大胆的改变。\n专心倾听，然后在接下来的会议中重复客户关心的问题和目标，这样他们就会觉得被理解了。大多数人甚至感觉不到“被听到”；如果你能让他们感觉到“被理解”，那你就是在回家的半路上了！史蒂夫·柯维在他的书“高效人士的7个习惯”中谈到了这一点。你应该首先寻求理解。\n例如，对于一个密码税务软件客户，我们的一位顾问是这样开始他的演示的：我们理解您想要强调正确处理密码税收的重要性，但也不想给人留下美国国税局执法部门的印象。这一新页面上的措辞语气恰到好处。他们让我们运行页面，它产生了64%的提升(在99%的统计意义上)。\n在展示彻底的重新设计之前，我们分享我们对观众(包括买家和非买家)所做的研究--我们的调查是彻底的，经常会发现新的见解。\n当我们最终展示激进的设计时，它感觉像是我们发现的唯一合乎逻辑的结论，因此更容易接受。\n这是我们为鞋垫销售商protalus所做的研究的一个例子。由此产生的彻底重新设计和相关的追加销售直接推动了销售额的91%。它还允许他们在按点击付费的流量来源上出价更高--打开了新访问者的闸门，从而带来了1221%的整体业务增长。就像我们常说的，没有交通问题，只有改装的问题！[链接]。\n请注意，这种技术与麦肯锡(著名的咨询公司)推广的金字塔原理相反，在金字塔原理中，你从结论开始，然后解释你是如何做到这一点的。我们已经尝试了这两种方法，当提议的设计稍微超出客户的接受范围时，前者效果更好。\n当证据是关于“相似的其他人”并且与其他技术之一一起使用时，这是最有效的。简单地呈现通用数据是无效的。对于上面描述的“脱离品牌”的情况，我们使用了苹果最初的iPhone SE页面(后来被删除)作为证据。\n毕竟，苹果以简洁和优雅著称，但即使是他们，新产品也使用了很长的表格页面。考虑到它的小尺寸和新颖性，在人们准备购买之前，必须回答很多问题。\n对于这个客户，我们的研究表明，非买家有很多异议，这些异议没有在登录页面上得到解决。如果不使用说明性的、长篇大论的元素，根本无法反驳这些反对意见。\n我还分享了我们这个领域的先驱之一弗林特·麦格劳克林博士的这句话：“清晰取代简单。没有回答问题的人为简单化必然会损害销售。“\n我们避免谈论您的页面与我们的页面。相反，我们谈论新页面或我们共同设计的页面，强调这是我们集体力量的结果：客户对其业务的“部落知识”，以及我们的案例研究框架。我们还提供客户可能缺乏的客观性，因为他们与业务关系密切。\n你永远不会希望你的外科医生只让你做病人。你希望她有很多其他的病人，这样当她见到你时，她就能从很多不同的情况中获得洞察力。\n只要有可能，我们都会尝试合并客户旧页面中的元素--毕竟，它产生了一些销量，所以有些东西是起作用的。但至关重要的是，这样做的另一个好处是：我们传达的信息是，这个项目确实是一个共同的努力。\n成为一名顾客。订购产品。体验品牌。我们这样做是为了获得上一节中描述的默示知识。当他们还是客户的时候，我买了几双Protalus鞋垫，并参加了EnFamil的家庭开端计划，接受配方奶粉的样品。我基本上做了所有新父母会做的事，除了生孩子！\n当我们为耐克的EasyKicks(订阅童鞋)提供短暂的建议时，我的侄女和侄子也参加了这个项目。\n我还采访了他们的母亲，看看她是否会自己报名参加这个项目(我了解到这对她或其他许多与我交谈过的父母来说并不令人信服)。当客户知道你已经这么做了，他们就不太可能抵制你的想法了。\n我在说服客户时使用的另一个杰弗主义(杰夫·贝佐的智慧金块)是：有两种决定：类型1和类型2。类型1的决定很容易逆转。如果你走进门，不喜欢你看到的东西，那就直接走出去吧！另一方面，第二类决策不能轻易逆转，而且会产生持久而重要的后果。\n这个测试是第一类的决定，我通常会“一笑置之”。让我们用您10%的流量进行测试。\n根据“创新扩散”一书的说法，尝试一些风险很小或没有风险的东西的能力，是决定一个想法是否会被接受的首要因素。\n最后，说服，不要说出去！而且你永远不会被指责未能阻止你的客户驱逐印度人：)。\n写完草稿后，我读了乔纳·伯杰(Jonah Berger)的“催化剂”(The Catalyst)一书，他在书中列出了人们抵制新想法的原因--缩写为Reduce：\n电抗：基本上，“你以为你是谁来告诉我该怎么做？”\n距离：需要太大的精神跳跃才能做到所要求的事情，即超出了这个人的“接受范围”。\n品牌团队觉得优化后的页面是“脱离品牌”的[禀赋、距离、佐证(缺乏)]", "note_en": "A recent client situation reminded of the following scene from the movie   The Last King of Scotland .\n Shortly after assuming power in Uganda in 1971, Idi Amin expelled all the Indians, claiming they were &#34;leeches&#34; who milked the cow but did not feed it (Uganda&#39;s economy was controlled by Indian traders, descendants of the &#34;Coolies&#34; who moved to East Africa to build the railway for the British).\n    &#34;Why didn&#39;t you tell me not to expel the Indians?&#34; Idi Amin asked his Scottish advisor (the guy on the left, in the pic).\n  His advisor replied &#34;I told you, don&#39;t you remember at such and such time and place...&#34;\n     Over the years we’ve learned that coming up with a viable solution for a consulting client is often the easy part. Getting them to adopt it is usually harder. For context, we are   CRO (Conversion Rate Optimization) consultants . We help high traffic websites generate more revenue by optimizing their landing pages, as well as other marketing collateral--display ads, email sequences and even call center scripts.\n  Below are a few reasons why a client may not want to use the optimized marketing materials. Next, I share persuasion techniques we’ve used successfully.\n   Common Reasons Why a Client May Resist Testing Optimized Pages We’ve Designed     For example, one client--a publicly traded company--didn’t like a long form page for their core offer because simplicity was part of their brand identity. In their view, a long page violated this part of their identity.\n    Even though the core premise of all consulting is you are the one supposed to give direction, no one likes being told what to do. This is a rookie mistake I made early in my consulting career.\n    While the executives who hire us care most about business results, they usually rely on their employees to implement our optimized designs. Some of these employees may have built the old pages and feel attached to them. This is just human nature finding expression in the “not invented here” syndrome!\n    Recently, for instance, we were working on a subscription program for a client in the CPG (Consumer Packaged Goods) industry. When he saw the headline on the optimized page his reaction was “This sounds like a threat. You don’t seem to understand why people sign up for the program”. Often this happens NOT because of sloppiness, but because we have not yet acquired the “tacit knowledge” that comes from being a customer. In  Making Websites Win , CRO pioneer Karl Blanks says:\n  “Tacit knowledge is knowledge that is difficult to learn from the words of others. No amount of explanation can convey the depth of experience. Perhaps the best way to appreciate its power is to read the following list: being a parent; having a migraine; xxxx ; being drunk…”\n  In other words: From the outside looking in, you can’t understand it. From the inside looking out, you can’t explain it! Tacit knowledge is not easy to acquire in just a few weeks.\n   Effective Techniques for Persuading Clients        As Jonah Berger notes in his new book   The Catalyst  [1], if you present only one solution, the client tends to spend time poking holes. But when you offer choice, it gives them a sense of control--something we humans all crave!\n     We usually present a conservative and radical version. The conservative keeps most of the elements on the control intact, but adds or makes minor changes. The radical “swings for the fences”. This way, we increase our odds of getting a win on the first test, which then earns us the credibility that makes it easier to try bolder changes.\n    Listen intently and then repeat the clients concerns and goals in subsequent meetings, so they feel understood. Most people don’t even feel “heard”; if you can make them feel “understood”, you are half-way home! Steve Covey talks about this in his book  The 7 Habits of Highly Effective People . Thou shalt first seek to understand.\n  For example, for a crypto tax-software client, one of our consultants started his presentation this way:  We understand you want to stress the importance of getting crypto taxes right, but also don’t want to come across as an enforcement arm of the IRS . The verbiage on this new page strikes just the right tone. They let us run the page and it produced at 64% lift (at 99% statistical significance).\n          Before presenting a radical redesign, we share the research we’ve done on the audience (both buyers and non-buyers)--our surveys are thorough and often uncover new insights.\n  When we eventually show the radical design, it feels like the only logical conclusion from our findings, and is thus easier to accept.\n  Here’s an example  of research we did for insole seller Protalus. The resulting radical redesign and associated upsells produced a   91% direct lift in sales . It also allowed them to bid higher on pay per click traffic sources--opening up the floodgates of new visitors, which then led to 1221% overall business growth. As we like to say, there are no traffic problems; just conversion ones! [link]\n   Note that this technique is the opposite of the   Pyramid Principle  popularized by McKinsey (the storied consulting company) where you start with the conclusion and then explain how you got there. We’ve tried both approaches and the former works better when the proposed design is a little bit outside the client’s zone of acceptance.\n      This is most effective when the evidence is about “similar others” and used alongside one of the other techniques. Simply presenting generic data is not effective. For the “off brand” situation described above, we used Apple’s original   Iphone SE  page (since removed) as evidence.\n  After all, Apple is known for simplicity and elegance but, even they, used a long form page for the new product. Given its tiny size and novelty, a lot of questions had to be answered before one felt ready to buy.\n  For this client, our research showed that the non-buyers had lots of objections that were not addressed on the landing page. There was simply no way to counter these objections without using explanatory, long-form elements.\n  I also shared this quote from Dr. Flint McGlaughlin, one of the pioneers in our field:  “Clarity supersedes simplicity. Artificial simplicity that leaves questions unanswered will necessarily hurt the sale”\n    We avoid talking about your page vs. our page. We instead talk about the new page or our jointly designed page, stressing that it is the result of our collective strengths: The client’s “tribal knowledge” of their business and our case-studies encrusted framework. We also offer objectivity that the client may lack, due to their closeness to the business.\n       You never want your surgeon to have only you as a patient. You want her to have lots of other patients so that when she sees you, she has insights from lots of different situations.\n  Whenever possible, we try to incorporate elements from the client’s old page--after all, it is producing some sales, so something is working. But crucially, the other benefit of doing this is: we convey the project is truly a joint effort.\n     Become a customer. Order the product. Experience the brand. We do this to gain the tacit knowledge described in the previous section. I got several pairs of Protalus insoles when they were a client and joined Enfamil’s Family Beginnings program to receive formula samples. I basically did everything a new parent would do, short of having a baby!\n  And when we briefly advised EasyKicks by Nike (kids shoes on a subscription basis), I got my niece and nephew on the program.\n       I also interviewed their mother to find out if she’d sign up for the program on her own (I learned it wasn’t compelling for her or many of the other parents I spoke with). When the  client knows you&#39;ve done this they are less likely to resist your ideas.\n     Another Jeffism (Jeff Bezo nugget of wisdom) I use when persuading clients is:  There are two kinds of decisions; Type 1 and Type 2. Type 1 decisions can be easily reversed. If you walk through the door and don’t like what you see, simply walk back out! Type 2 decisions, on the other hand, cannot be easily reversed and have lasting and important consequences.\n  This test is a Type 1 decision, I usually ‘splain. Let’s test it with 10% of your traffic.\n  According to the book   Diffusion of Innovations , the ability to try something with little or no risk, is the top factor that determines whether an idea will be accepted.\n       In closing,  persuade, don’t tell!  And you’ll never be accused of failing to stop your client from expelling the Indians :)\n       After writing a draft of this I read Jonah Berger’s   The Catalyst  , in which he lists the reasons why people resist new ideas--summarized by the acronym REDUCE:\n  Reactance : Basically, “who the eff do you think you are to tell me what to do?”\n    Distance : Requires too large a mental leap to do what is being asked i.e. outside the person’s “zone of acceptance”.\n          The brand team feels that the optimized page is “off brand”  [Endowment, Distance, Corroborating Evidence (lack of)]", "posttime": "2020-07-19 14:19:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "出去,don,客户", "title": "别说出去。说服他们。以下是", "title_en": "Don't Tell. Persuade. Here's How", "transed": 1, "url": "https://capitalandgrowth.org/answers/Article/3145495/Don-t-Tell-Persuade-Here-s-How-?src=hn-july-18-2020", "via": "", "real_tags": ["出去", "don", "客户"]}, {"category": "", "categoryclass": "", "imagename": "5eb2f79f82ae525e1ddce18135dee72b.jpeg", "infoid": 1012849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CampusLogic新的1.2亿美元增长投资将帮助这家教育技术公司扩大其学生财务成功平台。\nCampusLogic首席执行官格雷格·斯科雷斯比在接受Crunchbase News采访时表示，这家总部位于凤凰城的公司提供财务工具和资源，帮助1500万就读高校的学生了解往往会给学生招生、参与和留住带来障碍的过程。\n“在他们开始财务规划之前，以及在他们已经在资助他们的教育时，我们就带着工具来了。最终，我们计划在他们毕业后进入还款空间来帮助他们，“Scoresby说。“我们用软件取代纸张、铅笔和人工交互，让东西移动起来，使用起来也很方便。”\nDragoneer Investment Group对该公司进行了少数股权投资，这是CampusLogic自2011年成立以来最大的一笔投资。据Scoresby称，这使该公司迄今的总融资达到1.928亿美元。\n作为投资的一部分，Dragoneer Investment Group合伙人克里斯蒂安·延森(Christian Jensen)将加入CampusLogic的董事会。他在一份书面声明中表示，该公司正在为学生提供一种个性化的方式来获得经济援助，同时也为高等教育机构提供了数字化管理这一过程的工具。\n他补充说：“越来越多的学校意识到，要求学生邮寄或传真重要的资助文件或前往中央办公室寻求帮助和建议的日子已经过去了。”\nScoresby说，这项新投资将帮助CampusLogic为未来的战略收购和产品开发提供资金，特别是在小额奖学金领域，目标是每年收购一家新公司或提供一种新产品。\n本月早些时候，该公司收购了总部位于旧金山的平台RaiseMe，该平台帮助学生从高等教育机构获得小额奖学金。交易的财务条款没有披露。此外，CampusLogic在2019年收购了Funderbolt，在2017年收购了Cegment。\n在增长方面，CampusLogic保持着近40%的年均增长率，目前拥有750多家学院和大学客户。该公司还在获得市场份额，斯科尔斯比希望这将有助于消除学生的经济障碍。\n2018年LendEDU的一项调查发现，55%的学生难以找到支付大学学费的钱，51%的学生由于经济原因辍学。此外，Scoresby说，全球大流行使得在实物经济援助办公室投递文件“不可能”。\nScoresby说：“我们不想让学生受到教育的经济障碍。”“没有足够的工具可以帮助学生研究如何减少或负责任地借款，以及寻找学生债务以外的资源.”", "note_en": "CampusLogic’s new $120 million growth investment will help the education technology company expand its student financial success platform.\n The Phoenix-based company provides financial tools and resources to help the 15 million students who attend colleges and universities understand the processes that often create barriers to student enrollment, engagement and retention, CampusLogic CEO  Gregg Scoresby told Crunchbase News.\n  “We come in with tools before they start financial planning, as well as while they are already funding their education. Eventually, we plan to move into the repayment space to help them after they graduate,” Scoresby said. “We replace the paper, pencil and manual interactions with software to make things mobile and easy to use.”\n Dragoneer Investment Group made the minority investment in the company, CampusLogic’s largest since being founded in 2011. This brings the company’s total funding to date to $192.8 million, according to Scoresby.\n As part of the investment,  Christian Jensen, partner at Dragoneer Investment Group, will join CampusLogic’s board of directors. He said in a written statement that the company is providing a personalized way for students to access financial aid, while also giving higher education institutions the tools to manage the process digitally.\n “A rapidly increasing number of schools are realizing that the days of requiring students to mail or fax critical financial aid paperwork or visit a central office location for assistance and advising are behind us,” he added.\n The new investment will help CampusLogic fund future strategic acquisitions and product development, especially in the area of micro-scholarships, with a goal of acquiring a new company or offering a new product every year, Scoresby said.\n Earlier this month, the company acquired  RaiseMe, a San Francisco-based platform helping students earn those micro-scholarships from higher-ed institutions. Financial terms of the deal were not  disclosed. In addition, CampusLogic acquired  Funderbolt in 2019 and  Cegment in 2017.\n Growthwise, CampusLogic is sustaining average annual growth rates of nearly 40 percent, and now has more than 750 college and university customers. The company is also gaining market share in what Scoresby hopes will help eliminate financial barriers for students.\n A 2018  LendEDU survey found that 55 percent of students struggled to find the money to pay for college and 51 percent dropped out of college due to financial reasons. In addition, Scoresby said the global pandemic has made dropping off documents at a physical financial aid office “a non-starter.”\n “We don’t want financial barriers for students to get an education,” Scoresby said. “There are not enough tools available to help students research how to borrow less or responsibly, as well as find resources other than student debt.”", "posttime": "2020-07-19 13:57:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大学,universities,学生", "title": "CampusLogic的SaaS技术正在帮助750多所学院和大学简化学生资助流程，该公司从Dragoneer获得了1.2亿美元的投资", "title_en": "CampusLogic, whose SaaS tech is helping simplify student financial aid processes at 750+ colleges and universities, receives $120M investment from Dragoneer", "transed": 1, "url": "https://news.crunchbase.com/news/dragoneer-invests-120m-in-campuslogics-financial-aid-platform/", "via": "", "real_tags": ["大学", "学生"]}, {"category": "", "categoryclass": "", "imagename": "51ff4a9d2f3d2620a54bebbaa9157f9b.jpg", "infoid": 1012848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Yeshimabeit Milner在高中时第一次看到她认识的孩子被戴上手铐塞进警车。那是2008年2月29日，迈阿密附近一所学校的校长，那里的海地人和非洲裔美国人占多数，他把他的一个学生掐死了。第二天，几十个孩子举行了和平示威。事情进行得不太顺利。\n当晚，迈阿密全国广播公司6点新闻节目以一段名为“校园混乱”的节目开播。(YouTube上有一段视频片段。)。广播说：“在争取权利的斗争以与法律的斗争结束后，爱迪生高中的紧张局势变得高度紧张。”切换到两名尖叫的青少年的模糊电话画面：“你看到的混乱是学校食堂内的一场全面斗殴。”\n学生们告诉记者，警察用警棍打他们，把他们扔在地板上，把他们推到墙上。警方声称他们就是被袭击的人-“有很多水瓶，汽水，牛奶等”-并呼吁紧急支援。大约25名学生被捕，许多人被指控犯有多项罪行，包括暴力拒捕。米尔纳记得在电视上看到她上小学时被拘留的孩子。“这太疯狂了，”她说。\n对米尔纳来说，当天发生的事件及其对被捕者的长期影响至关重要。不久之后，当她还在上学的时候，她就参与了基于数据的激进主义活动，记录了同学们在种族主义警察方面的经历。现在，她是她在2017年与人共同创立的草根数字权利组织Black Lives的数据主管。她十几岁时学到的东西把她推入了与刑事司法系统中的偏见作斗争的生活中，并拆除了她所说的从学校到监狱的管道。“数据被武器化来对付黑人社区的历史由来已久，”她说。\n不平等和滥用警权不仅仅是在街上上演，也不仅仅是在学校骚乱期间上演。对于米尔纳和其他活动人士来说，现在的重点是最有可能造成长期损害的地方：预测性警务工具和警察部队滥用数据。许多研究表明，这些工具延续了系统性种族主义，但我们仍然对它们是如何工作的、谁在使用它们以及用于什么目的知之甚少。所有这些都需要改变，然后才能进行适当的清算。幸运的是，潮流可能正在逆转。\n预测警务工具主要有两种类型。基于位置的算法利用地点、事件和历史犯罪率之间的联系来预测犯罪更有可能发生的地点和时间-例如，在特定的天气条件下或大型体育赛事中。这些工具识别热点，警方计划在这些线报周围巡逻。其中最常见的一种名为PredPol，被美国数十个城市使用，将地点划分为500乘500英尺的街区，并全天更新预测-一种犯罪天气预报。\n其他工具利用人们的数据，如他们的年龄、性别、婚姻状况、药物滥用史和犯罪记录，来预测谁有很高的机会参与未来的犯罪活动。这些以人为本的工具既可以被警方用来在犯罪发生前进行干预，也可以被法院用来在审前听证会或量刑期间确定被逮捕的人是否有可能再次犯罪。例如，许多司法管辖区都在使用一种名为“COMPAS”的工具来帮助做出有关审前释放和量刑的决定，该工具会发布一个介于1到10之间的统计分数，以量化一个人如果获释被重新逮捕的可能性有多大。\n问题出在算法所依赖的数据上。首先，预测性算法很容易受到逮捕率的影响。根据美国司法部的数据，如果你是黑人，被捕的可能性是白人的两倍多。黑人在没有正当理由的情况下被拦截的可能性是白人的五倍。爱迪生高中的大规模逮捕事件只是警方做出不成比例反应的一个例子，这种反应在黑人社区并不少见。\n米尔纳眼看着被逮捕的孩子们因为那次逮捕记录而被设定为终身有偏见的评估。但那一天受到影响的不仅仅是他们自己的生活。他们被捕产生的数据将被输入到算法中，这些算法评估的算法将不成比例地针对所有年轻的黑人。虽然根据法律，算法不使用种族作为预测因子，但其他变量，如社会经济背景、教育程度和邮政编码，可以作为预测因子。即使没有明确考虑种族问题，这些工具也是种族主义的。\n这就是为什么，对许多人来说，预测性警务本身的概念本身就是问题所在。作家兼学者多萝西·罗伯茨(Dorothy Roberts)在宾夕法尼亚大学(University Of Pennsylvania)研究法律和社会权利，她在6月份的一次公开在线小组讨论中很好地表达了这一点。她说：“种族主义一直都是关于预测，关于让某些种族群体看起来似乎倾向于做坏事，从而证明控制他们是正当的。”\n几十年来，风险评估一直是刑事司法系统的一部分。但在过去的几年里，警察部门和法院更多地使用了自动化工具，主要有两个原因。首先，预算削减导致了一场提高效率的运动。“人们打电话要求撤资警察，但他们已经被撤资了，”米尔纳说。“多年来，城市一直在破产，他们一直在用算法取代警察。”确切的数字很难得到，但美国大多数州的警察或法院都被认为使用了预测工具。\n增加使用算法的第二个原因是人们普遍认为它们比人类更客观：它们最初被引入是为了让刑事司法系统的决策更加公平。从20世纪90年代开始，早期的自动化技术使用基于规则的决策树，但今天的预测是通过机器学习完成的。\n然而，越来越多的证据表明，这些工具中已经融入了人类的偏见，因为机器学习模型是基于有偏见的警察数据进行训练的。他们非但没有避免种族主义，反而可能更善于隐藏种族主义。许多批评人士现在将这些工具视为一种技术清洗形式，其中客观性的表象掩盖了使社会不平等永久化的机制。\n“人们对这些工具的看法实际上只是在过去几年里才发生转变，从可能缓解偏见的东西，转变为可能巩固偏见的东西，”律师兼数据科学家艾丽丝·向表示。她在人工智能伙伴关系(Partnership On AI)领导对公平、透明和问责的研究。自从二三十年前第一代预测工具出现以来，这些偏见就变得更加严重。科罗拉多博尔德大学(University Of Colorado Boulder)研究算法偏差的研究员凯蒂·韦辛顿(Katy Weathington)表示：“我们一开始就采用了糟糕的数据，然后我们使用工具让情况变得更糟。”“这只是一个自我强化的循环，一遍又一遍。”\n情况可能会变得更糟。*在明尼阿波利斯乔治·弗洛伊德(George Floyd)死于一名警察之手后，针对警察偏见的大规模抗议活动之后，一些警察部门正在加倍使用预测工具。一个月前，纽约警察局局长德莫特·谢伊(Dermot Shea)给他的警官们发了一封信。“在目前的环境下，我们必须以不同的方式打击犯罪，”他写道。“我们将以更少的街头停留来做到这一点--也许会让你承担更少的危险和责任--同时更好地利用数据、情报和我们掌握的所有技术……。这意味着对于纽约警察局来说，我们将加倍努力进行精准警务。“。\nAI Now研究所政策研究主任拉希达·理查森(Rashida Richardson)表示，警方喜欢让他们提前知道并允许他们及早干预的工具的想法，因为他们认为这会降低犯罪率。但在实践中，使用它们可能会感觉到骚扰。研究人员发现，一些警察部门会给警官列出该工具认定为高风险的“头号通缉”人员名单。当芝加哥的人们报告说警察一直在敲他们的门，告诉他们他们受到监视时，这件事第一次被曝光。理查森说，在其他州，警方警告名单上的人，他们参与帮派犯罪的风险很高，并要求他们采取行动避免这种情况。如果他们后来因任何类型的犯罪而被捕，检察官会利用之前的警告寻求更高的指控。“这几乎就像是一种数字形式的诱捕，你给人们一些模糊的信息，然后拿来对付他们，”她说。\n同样，研究-包括英国政府数据道德与创新中心(Centre For Data道德And Innovation)去年委托进行的一项研究-表明，将某些地区确定为热点地区，会让警察在巡逻时预计会遇到麻烦，使他们更有可能出于偏见(而不是需要)在那里拦截或逮捕人。\n算法的另一个问题是，许多算法都是针对美国以外的白人人口进行培训的，部分原因是很难跨美国不同的司法管辖区获得犯罪记录。Static 99是一种用于预测性犯罪者累犯率的工具，它在加拿大接受了培训，加拿大只有大约3%的人口是黑人，而美国的这一比例为12%。美国使用的其他几种工具也是在欧洲开发的，欧洲有2%的人口是黑人。由于国家和人口之间的社会经济条件不同，这些工具在没有经过培训的地方可能不太准确。此外，一些多年前训练的预审算法仍然使用过时的预报器。例如，一些人仍然预测，没有固定电话的被告出现在法庭上的可能性较小。\n但是，这些工具即使不完美，也能发挥作用吗？这取决于你所说的“工作”是什么意思。一般来说，几乎不可能将预测性警务工具的使用与影响犯罪率或监禁率的其他因素分开。尽管如此，少数小型研究得出的结论有限。一些迹象表明，法院使用风险评估工具产生了轻微的积极影响。2016年，一项对宾夕法尼亚州用于为假释决定提供信息的机器学习工具的研究发现，没有证据表明它危及公共安全(也就是说，它正确地识别了不应该假释的高危个人)，以及一些证据表明，它识别了可以安全释放的非暴力人群。\n2018年的另一项研究研究了肯塔基州法院使用的一种工具，发现尽管各县之间对风险分数的解释不一致，导致了谁被释放和没有被释放的差异，但如果使用得当，该工具本可以略微降低监禁率。美国公民自由联盟(American Civil Liberties Union)报告称，作为2017年新泽西州刑事司法改革法案的一部分采用的一项评估工具导致等待审判期间被监禁的人数下降了约20%。\n这类工具的倡导者说，算法可以比人类决策者更公平，或者至少让不公平变得明显。在许多案件中，特别是在审前保释听证会上，法官预计将在短时间内匆忙处理数十起案件。在伊利诺伊州库克县的一项关于审前听证会的研究中，研究人员发现，法官平均只花了30秒来考虑每个案件。\n在这种情况下，我们有理由认为法官做出仓促决定至少在一定程度上是出于个人偏见。英国萨里大学(University Of Surrey)教授梅丽莎·汉密尔顿(Melissa Hamilton)研究围绕风险评估工具的法律问题，她对这些工具在实践中的使用持批评态度，但相信原则上他们可以比人做得更好。“另一种选择是人类决策者的黑匣子大脑，”她说。\n但有一个明显的问题。用于训练预测工具的逮捕数据不能准确描述犯罪活动。之所以使用逮捕数据，是因为它是警察部门记录的。但逮捕并不一定会导致定罪。向说：“我们试图衡量犯罪人数，但我们掌握的只是逮捕人数的数据。”\n更重要的是，逮捕数据编码了种族主义警察行为的模式。因此，他们更有可能预测少数族裔社区或少数族裔中的犯罪可能性很高。即使当逮捕和犯罪数据匹配时，也有无数的社会经济原因，为什么某些人口和某些社区的历史犯罪率比其他人更高。将这些数据输入预测工具可以让过去塑造未来。\n一些工具还使用关于在哪里报警的数据，这比逮捕数据对实际犯罪模式的反映更弱，而且更受种族主义动机的扭曲。想一想艾米·库珀(Amy Cooper)的案例，她报警只是因为一位黑色观鸟者克里斯蒂安·库珀(Christian Cooper)要求她在纽约中央公园用皮带拴住她的狗。\n理查森说：“仅仅因为接到电话说有犯罪发生，并不意味着犯罪真的发生了。”“如果这个电话变成了一个数据点，用来证明向特定社区派遣警察是合理的，甚至是针对一个特定的个人，那么你就会得到一个反馈回路，在这个回路中，数据驱动的技术使歧视性警务合法化。”\n随着越来越多的批评者认为这些工具不符合目的，有人呼吁采取一种算法平权行动，在这种行动中，数据中的偏见以某种方式得到平衡。从理论上讲，风险评估算法的一种方法是使用不同的风险阈值-黑人逮捕三次可能表明风险水平与白人逮捕两次相同。\n这是加州大学伯克利分校(University of California，Berkeley)研究公共政策的詹妮弗·斯基姆(Jennifer Skeem)和华盛顿特区美国法院行政办公室(Administration Office Of The US Courts)社会科学分析师克里斯托弗·洛文坎普(Christopher Lowenkamp)在5月份发表的一项研究中研究的方法之一。两人研究了三种不同的选择，以消除算法中的偏见，这些算法评估了大约6.8万名参与者(一半是白人，一半是黑人)的累犯风险。他们发现，当算法明确考虑种族因素-现有的工具在法律上被禁止这样做-并为黑人设定比白人更高的被认为高风险的门槛时，种族之间的最佳平衡就实现了。\n当然，这个想法颇具争议性。这本质上意味着操纵数据，以原谅一定比例的犯罪，因为犯罪者的种族，向说：“这是一件让人非常不舒服的事情。”让不同群体的成员遵循不同标准的想法违背了许多人的公平感，即使这样做的方式应该是为了解决历史上的不公正。(您可以在我们关于刑事法律系统中的算法偏见的第一个互动故事中亲自尝试这种权衡，它允许您试验简化版本的COMPAS工具。)。\n无论如何，美国法律系统还没有准备好进行这样的讨论。汉密尔顿说：“在这些风险评估工具上，法律界已经落后了很多。”在过去的几年里，她一直在为律师提供培训课程，并发现辩护律师经常甚至没有意识到他们的客户正以这种方式接受评估。“如果你没有意识到这一点，你就不会去挑战它，”她说。\n缺乏意识可以归咎于整体情况的模糊性：执法部门对如何使用这些技术守口如瓶，以至于任何人都很难评估它们的工作情况。即使有信息可用，也很难将任何一个系统与任何一个结果联系起来。少数已完成的详细研究集中在具体的工具上，并得出可能不适用于其他系统或司法管辖区的结论。\n甚至还不清楚正在使用什么工具，以及谁在使用这些工具。理查森说：“我们不知道有多少警察部门已经或正在使用预测性警力。”\n例如，新奥尔良警方使用秘密数据挖掘公司Palantir开发的预测工具的事实是在Verge进行全面调查后才曝光的。公共记录显示，纽约警察局已经向Palantir支付了250万美元，但没有说明原因。\n大多数工具都是由小公司、国家当局和研究人员杂乱无章地授权给警察部门的。有些是专有系统，有些不是，它们的工作方式略有不同。在工具输出的基础上，研究人员尽其所能地重新创造他们认为正在发生的事情。\n活动人士哈米德·汗(Hamid Khan)多年来一直在争取洛杉矶警方放弃一种名为PredPol的预测工具，他要求警察局的监察长对该工具进行审计。*据哈米德·汗称，监察长在2019年3月表示，这项任务是不可能的，因为该工具太复杂了。\n在英国，汉密尔顿试图研究一种名为OASYS的工具，它和COMPAS一样，通常用于审前听证会、量刑和假释。汉密尔顿说，制造OASYS的公司自己做审计，没有公布太多关于它是如何运作的信息。她曾多次试图从开发商那里获得信息，但他们没有回应她的请求。她说，“我想他们查阅了我的研究报告，然后决定：没有。”\n制造这些工具的公司熟悉的一种说法是，他们不能分享信息，因为这将泄露这些工具评估过的人的商业机密或机密信息。\n所有这一切都意味着，尽管有一些关于其中几个的信息可用，但只有少数人被详细研究过。Static 99是由一群数据科学家开发的，他们分享了有关其算法的细节。汉密尔顿表示，公共安全评估是美国最常见的审前风险评估工具之一，最初是由私人组织阿诺德风险投资公司(Arnold Ventures)开发的，但事实证明，如果披露了一些有关其工作原理的细节，就更容易说服司法机构采用它。尽管如此，这两个工具的制造商都拒绝公布他们用于培训的数据集，这些数据集是完全理解它们的工作原理所必需的。\n不仅对这些工具的内部机制缺乏洞察力，批评人士还表示，警察部门和法院在确保他们购买功能符合预期的工具方面做得不够。米尔纳说，对于纽约警察局来说，购买风险评估工具与购买扫雪机遵守相同的规定。\n理查森说：“警察可以全速购买技术，而不需要知道他们使用的是什么，也不需要投入时间来确保安全使用。”“然后就没有正在进行的审计或分析来确定它是否起作用了。”\n改变这种状况的努力面临阻力。上个月，纽约市通过了美国公众监督监控技术(POST)法案，该法案要求纽约警察局列出所有监控技术，并描述它们对该市居民的影响。纽约警察局是美国最大的警察部队，该法案的支持者希望这一披露也能让人们了解美国其他警察部门正在使用什么技术。但走到这一步很难。理查森为该法案做了宣传工作，自2017年以来一直眼睁睁地看着该法案陷入困境，直到过去几个月要求警务改革的广泛呼声打破了意见平衡。\n正是试图找到有关纽约数字警务实践的基本信息的挫折感导致理查森在b。\n.", "note_en": "Yeshimabeit Milner was in high school the first time she saw kids she knew getting handcuffed and stuffed into police cars. It was February 29, 2008, and the principal of a nearby school in Miami, with a majority Haitian and African-American population, had put one of his students in a chokehold. The next day several dozen kids staged a peaceful demonstration. It didn’t go well.\n  That night, Miami’s NBC 6 News at Six kicked off with a segment called “Chaos on Campus.” (There’s a   clip on YouTube.) “Tensions run high at Edison Senior High after a fight for rights ends in a battle with the law,” the broadcast said. Cut to blurry phone footage of screaming teenagers: “The chaos you see is an all-out brawl inside the school’s cafeteria.”\n  Students told reporters that police hit them with batons, threw them on the floor, and pushed them up against walls. The police claimed they were the ones getting attacked—“with water bottles, soda pops, milk, and so on”—and called for emergency backup. Around 25 students were arrested, and many were charged with multiple crimes, including resisting arrest with violence. Milner remembers watching on TV and seeing kids she’d gone to elementary school with being taken into custody. “It was so crazy,” she says.\n    For Milner, the events of that day and the long-term implications for those arrested were pivotal. Soon after, while still at school, she got involved with data-based activism, documenting fellow students’ experiences of racist policing. She is now the director of  Data for Black Lives, a grassroots digital rights organization she cofounded in 2017. What she learned as a teenager pushed her into a life of fighting back against  bias in the criminal justice system and dismantling what she calls the school-to-prison pipeline. “There’s a long history of data being weaponized against Black communities,” she says.\n  Inequality and the misuses of police power don’t just  play out on the streets or during school riots. For Milner and other activists, the focus is now on where there is most potential for long-lasting damage: predictive policing tools and the abuse of data by police forces. A number of studies have shown that these tools  perpetuate  systemic  racism, and yet we still know very little about how they work, who is using them, and for what purpose. All of this needs to change before a proper reckoning can take place. Luckily, the tide may be turning.\n    There are two broad types of predictive policing tool. Location-based algorithms draw on links between places, events, and historical crime rates to predict where and when crimes are more likely to happen—for example, in certain weather conditions or at large sporting events. The tools identify hot spots, and the police plan patrols around these tip-offs. One of the most common, called PredPol, which is used by  dozens of cities in the US, breaks locations up into 500-by-500 foot blocks, and updates its predictions throughout the day—a kind of crime weather forecast.\n  Other tools draw on data about people, such as their age, gender, marital status, history of substance abuse, and criminal record, to predict who has a high chance of being involved in future criminal activity. These person-based tools can be used either by police, to intervene before a crime takes place, or by courts, to determine during pretrial hearings or sentencing whether someone who has been arrested is likely to reoffend. For example, a tool called COMPAS, used in many jurisdictions to help make decisions about pretrial release and sentencing, issues a statistical score between 1 and 10 to quantify how likely a person is to be rearrested if released.\n   The problem lies with the data the algorithms feed upon. For one thing, predictive algorithms are easily skewed by arrest rates. According to US Department of Justice figures, you are  more than twice as likely to be arrested if you are Black than if you are white. A Black person is five times as likely to be stopped without just cause as a white person. The mass arrest at Edison Senior High was just one example of a type of disproportionate police response that is not uncommon in Black communities.\n  The kids Milner watched being arrested were being set up for a lifetime of biased assessment because of that arrest record. But it wasn’t just their own lives that were affected that day. The data generated by their arrests would have been fed into algorithms that would disproportionately target all young Black people the algorithms assessed. Though by law the algorithms do not use race as a predictor, other variables, such as socioeconomic background, education, and zip code, act as proxies. Even without explicitly considering race, these tools are racist.\n  That’s why, for many, the very concept of predictive policing itself is the problem. The writer and academic  Dorothy Roberts, who studies law and social rights at the University of Pennsylvania, put it well in an  online panel discussion in June. “Racism has always been about predicting, about making certain racial groups seem as if they are predisposed to do bad things and therefore justify controlling them,” she said.\n  Risk assessments have been part of the criminal justice system for decades. But police departments and courts have made more use of automated tools in the last few years, for two main reasons. First, budget cuts have led to an efficiency drive. “People are calling to defund the police, but they’ve already been defunded,” says Milner. “Cities have been going broke for years, and they’ve been replacing cops with algorithms.” Exact figures are hard to come by, but predictive tools are thought to be used by police forces or  courts in most US states.\n  The second reason for the increased use of algorithms is the widespread belief that they are more objective than humans: they were first introduced to make decision-making in the criminal justice system more fair. Starting in the 1990s, early automated techniques used rule-based decision trees, but today prediction is done with machine learning.\n    Yet  increasing evidence suggests that human prejudices have been baked into these tools because the machine-learning models are trained on biased police data. Far from avoiding racism, they may simply be better at hiding it. Many critics now view these tools as  a form of tech-washing, where a veneer of objectivity covers mechanisms that perpetuate inequities in society.\n  “It&#39;s really just in the past few years that people’s views of these tools have shifted from being something that might alleviate bias to something that might entrench it,” says  Alice Xiang, a lawyer and data scientist who leads research into fairness, transparency and accountability at the Partnership on AI. These biases have been compounded since the first generation of prediction tools appeared 20 or 30 years ago. “We took bad data in the first place, and then we used tools to make it worse,” says  Katy Weathington, who studies algorithmic bias at the University of Colorado Boulder. “It&#39;s just been a self-reinforcing loop over and over again.”\n  Things might be getting worse.  In the wake of the  protests about police bias after the death of George Floyd at the hands of a police officer in Minneapolis, some police departments are doubling down on their use of predictive tools. A month ago, New York Police Department commissioner Dermot Shea sent a letter to his officers. “In the current climate, we have to fight crime differently,” he wrote. “We will do it with less street-stops—perhaps exposing you to less danger and liability—while better utilizing data, intelligence, and all the technology at our disposal ... That means for the NYPD’s part, we’ll redouble our precision-policing efforts.”\n    Police like the idea of tools that give them a heads-up and allow them to intervene early because they think it keeps crime rates down, says  Rashida Richardson, director of policy research at the AI Now Institute. But in practice, their use can feel like harassment. Researchers have found that some police departments give officers “most wanted” lists of people the tool identifies as high risk. This first came to light when people in Chicago reported that police had been knocking on their doors and telling them they were being watched. In other states, says Richardson, police were warning people on the lists that they were at high risk of being involved in gang-related crime and asking them to take actions to avoid this. If they were later arrested for any type of crime, prosecutors used the prior warning to seek higher charges. “It&#39;s almost like a digital form of entrapment, where you give people some vague information and then hold it against them,” she says.\n    Similarly, studies—including  one commissioned by the UK government’s Centre for Data Ethics and Innovation last year—suggest that identifying certain areas as hot spots primes officers to expect trouble when on patrol, making them more likely to stop or arrest people there because of prejudice rather than need.\n  Another problem with the algorithms is that many were trained on white populations outside the US, partly because criminal records are hard to get hold of across different US jurisdictions. Static 99, a tool designed to predict recidivism among sex offenders, was trained in Canada, where only around 3% of the population is Black compared with 12% in the US. Several other tools used in the US were developed in Europe, where 2% of the population is Black. Because of the differences in socioeconomic conditions between countries and populations, the tools are likely to be less accurate in places where they were not trained. Moreover, some pretrial algorithms trained many years ago still use predictors that are out of date. For example, some still predict that a defendant who doesn’t have a landline phone is less likely to show up in court.\n    But do these tools work, even if imperfectly? It depends what you mean by “work.” In general it is practically impossible to disentangle the use of predictive policing tools from other factors that affect crime or incarceration rates. Still, a handful of small studies have drawn limited conclusions. Some show signs that courts’ use of risk assessment tools has had a minor positive impact. A  2016 study of a machine-learning tool used in Pennsylvania to inform parole decisions found no evidence that it jeopardized public safety (that is, it correctly identified high-risk individuals who shouldn&#39;t be paroled) and some evidence that it identified nonviolent people who could be safely released.\n    Another study, in 2018, looked at  a tool used by the courts in Kentucky and found that although risk scores were being interpreted inconsistently between counties, which led to discrepancies in who was and was not released, the tool would have slightly reduced incarceration rates if it had been used properly. And the American Civil Liberties Union reports that an assessment tool adopted as part of the 2017 New Jersey Criminal Justice Reform Act led to a  20% decline in the number of people jailed while awaiting trial.\n  Advocates of such tools say that algorithms can be more fair than human decision makers, or at least make unfairness explicit. In many cases, especially at pretrial bail hearings, judges are expected to rush through many dozens of cases in a short time. In one study of pretrial hearings in Cook County, Illinois, researchers found that judges spent an average of just 30 seconds considering each case.\n  In such conditions, it is reasonable to assume that judges are making snap decisions driven at least in part by their personal biases.  Melissa Hamilton at the University of Surrey in the UK, who studies legal issues around risk assessment tools, is critical of their use in practice but believes they can do a better job than people in principle. “The alternative is a human decision maker’s black-box brain,” she says.\n  But there is an obvious problem. The arrest data used to train predictive tools does not give an accurate picture of criminal activity. Arrest data is used because it is what police departments record. But arrests do not necessarily lead to convictions. “We’re trying to measure people committing crimes, but all we have is data on arrests,” says Xiang.\n    What&#39;s more, arrest data encodes patterns of racist policing behavior. As a result, they’re more likely to predict a high potential for crime in minority neighborhoods or among minority people. Even when arrest and crime data match up, there are a myriad of socioeconomic reasons why certain populations and certain neighborhoods have higher historical crime rates than others. Feeding this data into predictive tools allows the past to shape the future.\n  Some tools also use data on where a call to police has been made, which is an even weaker reflection of actual crime patterns than arrest data, and one even more  warped by racist motivations. Consider  the case of Amy Cooper, who called the police simply because a Black bird-watcher, Christian Cooper, asked her to put her dog on a leash in New York’s Central Park.\n  “Just because there’s a call that a crime occurred doesn’t mean a crime actually occurred,” says Richardson. “If the call becomes a data point to justify dispatching police to a specific neighborhood, or even to target a specific individual, you get a feedback loop where data-driven technologies legitimize discriminatory policing.”\n    As more critics argue that these tools are not fit for purpose, there are calls for a kind of algorithmic affirmative action, in which the bias in the data is counterbalanced in some way. One way to do this for risk assessment algorithms, in theory, would be to use differential risk thresholds—three arrests for a Black person could indicate the same level of risk as, say, two arrests for a white person.\n  This was one of the approaches examined in a study  publishe d in May by Jennifer Skeem, who studies public policy at the University of California, Berkeley, and Christopher Lowenkamp, a social science analyst at the Administrative Office of the US Courts in Washington, DC. The pair looked at three different options for removing the bias in algorithms that had assessed the risk of recidivism for around 68,000 participants, half white and half Black. They found that the best balance between races was achieved when algorithms took race explicitly into account—which existing tools are legally forbidden from doing—and assigned Black people a higher threshold than whites for being deemed high risk.\n  Of course, this idea is pretty controversial. It means essentially manipulating the data in order to forgive some proportion of crimes because of the perpetrator’s race, says Xiang: “That is something that makes people very uncomfortable.” The idea of holding members of different groups to different standards goes against many people’s sense of fairness, even if it’s done in a way that’s supposed to address historical injustice. (You can try out this trade-off for yourself in our  interactive story on algorithmic bias in the criminal legal system, which lets you experiment with a simplified version of the COMPAS tool.)\n  At any rate, the US legal system is not ready to have such a discussion. “The legal profession has been way behind the ball on these risk assessment tools,” says Hamilton. In the last few years she has been giving training courses to lawyers and found that defense attorneys are often not even aware that their clients are being assessed in this way. “If you&#39;re not aware of it, you&#39;re not going to be challenging it,” she says.\n    The lack of awareness can be blamed on the murkiness of the overall picture: law enforcement has been so tight-lipped about how it uses these technologies that it’s very hard for anyone to assess how well they work. Even when information is available, it is hard to link any one system to any one outcome. And the few detailed studies that have been done focus on specific tools and draw conclusions that may not apply to other systems or jurisdictions.\n  It is not even clear what tools are being used and who is using them. “We don’t know how many police departments have used, or are currently using, predictive policing,” says Richardson.\n  For example, the fact that police in New Orleans were using a predictive tool developed by secretive data-mining firm Palantir came to light only after an   investigation by The Verge. And public records show that the  New York Police Department has paid $2.5 million to Palantir but isn’t saying what for.\n    Most tools are licensed to police departments by a ragtag mix of small firms, state authorities, and researchers. Some are proprietary systems; some aren’t. They all work in slightly different ways. On the basis of the tools’ outputs, researchers re-create as well as they can what they believe is going on.\n  Hamid Khan, an activist who fought for years to get the Los Angeles police to drop a predictive tool called PredPol, demanded an audit of the tool by the police department’s inspector general.  According to  Khan, in March 2019 the inspector general said that the task was impossible because the tool was so complicated.\n  In the UK, Hamilton tried to look into a tool called OASys, which—like COMPAS—is commonly used in pretrial hearings, sentencing, and parole. The company that makes OASys does its own audits and has not released much information about how it works, says Hamilton. She has repeatedly tried to get information from the developers, but they stopped responding to her requests. She says, “I think they looked up my studies and decided: Nope.”\n  The familiar refrain from companies that make these tools is that they cannot share information because it would be giving up trade secrets or confidential information about people the tools have assessed.\n  All this means that only a handful have been studied in any detail, though some information is available about a few of them. Static 99 was developed by a group of data scientists who shared details about its algorithms. Public Safety Assessment, one of the most common pretrial risk assessment tools in the US, was originally developed by Arnold Ventures, a private organization, but it turned out to be easier to convince jurisdictions to adopt it if some details about how it worked were revealed, says Hamilton. Still, the makers of both tools have refused to release the data sets they used for training, which would be needed to fully understand how they work.\n    Not only is there little insight into the mechanisms inside these tools, but critics say police departments and courts are not doing enough to make sure they buy tools that function as expected. For the NYPD, buying a risk assessment tool is subject to the same regulations as buying a snow plow, says Milner.\n  “Police are able to go full speed into buying tech without knowing what they&#39;re using, not investing time to ensure that it can be used safely,” says Richardson. “And then there’s no ongoing audit or analysis to determine if it’s even working.”\n  Efforts to change this have faced resistance. Last month New York City  passed the  Public Oversight of Surveillance Technology (POST) Act, which requires the NYPD to list all its surveillance technologies and describe how they affect the city’s residents. The NYPD is the biggest police force in the US, and proponents of the bill hope that the disclosure will also shed light on what tech other police departments in the country are using. But getting this far was hard. Richardson, who did advocacy work on the bill, had been watching it sit in limbo since 2017, until widespread calls for policing reform in the last few months tipped the balance of opinion.\n  It was frustration at trying to find basic information about digital policing practices in New York that led Richardson to work on the b\n......", "posttime": "2020-07-19 13:56:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "算法,algorithms,工具", "title": "批评人士争辩说，由于有偏见的训练数据，预测性警务算法需要被拆除，尽管倡导者说算法可以变得公平", "title_en": "Critics contend that predictive policing algorithms need to be dismantled due to biased training data, even as advocates say that algorithms can be made fair", "transed": 1, "url": "https://www.technologyreview.com/2020/07/17/1005396/predictive-policing-algorithms-racist-dismantled-machine-learning-bias-criminal-justice/", "via": "", "real_tags": ["算法", "工具"]}, {"category": "", "categoryclass": "", "imagename": "f2fb99d7c83a971da77a5f77c20620e7.jpg", "infoid": 1012847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注册立即采取行动，每周在您的收件箱中获得三个行动。你会偶尔收到支持国家新闻业的节目的促销邀请。您可以在这里阅读我们的隐私政策。\n谢谢你报名。有关“国家”的更多信息，请查看我们最新一期的节目。\n“国家”是由读者支持的：捐10美元或更多，帮助我们继续写重要的问题。\n立即注册“采取行动”，我们将向您发送每周可以采取的三项有意义的行动。你会偶尔收到支持国家新闻业的节目的促销邀请。您可以在这里阅读我们的隐私政策。\n谢谢你报名。有关“国家”的更多信息，请查看我们最新一期的节目。\n第一个听说国家旅游目的地，带着志同道合的精神去探索世界。\n“祝你被禁止玩得开心，我的伙计，”军队招募人员兼游戏玩家约书亚·“Strotnium”David在把我从美军的Twitch频道踢走之前对我说。我刚刚提醒观众美国在全球各地的暴行历史，并提供了一个有关美国战争罪行的维基百科页面的链接，这对我很有帮助。我是不是没有外交手腕？好的。但是，如果军方打算使用世界上最受欢迎的平台之一来招募儿童，那么它应该无法在没有一些阻力的情况下做到这一点。现在，在Twitch的支持下，美军的游戏玩家们正花几个小时陪着年仅13岁的孩子，试图说服他们入伍。陆军、海军和空军都使用专门的电子竞技团队在Twitch上进行流媒体播放。这些队伍由熟练的游戏玩家组成，他们在锦标赛中争夺现金奖励。虽然军事电子竞技团队的成员提供常规的游戏技能，但他们也是屏幕上的人才和招聘人员。孩子们可以和正在玩他们最喜欢的视频游戏的人一起玩，连续几个小时回复他们的聊天信息，而不是走近学校自助餐厅的桌子后面的招聘人员。亚马逊旗下的直播平台Twitch号称，从4月到6月，该平台的观看时长超过50亿小时。(相比之下，Netflix声称，在隔离期间，人们每月观看其节目和电影的时间约为60亿小时。)。典型的军事信息流看起来是这样的：一名征兵人员，通常是一名30多岁的男子，在一间灯光昏暗的房间里舒适地坐在游戏玩家的椅子上，房间里的显示器和他的电脑塔上五颜六色的LED灯照亮了他。一面美国国旗挂在他右肩后面的墙上，一只超大的毛绒动物坐在他的左边。他在玩“使命召唤”或“勇士”。他很友好，谈到他有多喜欢参军。尽管他比他的大多数年轻观众年龄都大，但他说话像他们一样。“有时候确实是这样的。我们确实有一些很棒的交流，“一位招聘人员在最近的一次会议上说。军事电子竞技团队在Twitch上使用的做法是招聘人员瞄准不稳定和/或弱势儿童的系统的一部分。招聘人员利用寻求稳定收入的穷人，渴望稳定的弱势群体，以及由于公民身份而生活在恐惧中的非法移民。现在，当所有这些因素都被大流行放大的时候，导致全国一半人失业，超过30%的人无力支付住房，招聘人员掠夺焦虑的年轻人的条件已经成熟。周二，Twitch用户xCanyon916在海军的一个视频流中表示：“我看到你们正在从低收入学校招募新兵，不错。”当时，征兵人员正在回答有关军队生活的问题，这些问题来自于表达了加入海军电子竞技团队的愿望的聊天。征兵人员警告xCanyon916，如果他们再说一些关于海军征兵做法的话，他们将被禁止。哈桑·派克(Hasan Piker)是一位颇受欢迎的Twitch流媒体用户，拥有超过43万用户的忠实追随者，一想到招聘人员要与年轻、易受影响的观众建立关系，他就退缩了。“Twitch与我职业生涯中经历过的任何事情都不一样，这是因为你连续几个小时都在现场直播，在聊天中与这些人交谈。你建立了一个社区，了解你的个人聊天。每个Twitch频道都有一个生态系统，“Piker说。“这种掠夺性的招聘方式违反了(用户的)安全。”一个18岁的年轻人可能会在电影院里看一次像“美国狙击手”这样的宣传片，然后继续他们的生活，但在这里，军人自己也在日复一日地播放鹰派鼓动道具。在某些情况下，比如“使命召唤”，这些游戏都是军方或退役军人咨询并帮助塑造的。在这些Twitch频道中，招聘人员正在利用这些游戏来吸引年轻观众分享个人信息。使用电子竞技和Twitch流来接触和招募年轻观众的分支机构依靠花招战术、虚假承诺和欺骗性信息来", "note_en": "Sign up for Take Action Now and get three actions in your inbox every week.\t\t\t\t\t\t\t\t     You will receive occasional promotional offers for programs that support  The Nation’s journalism. You can read our   Privacy Policy here.\n  Thank you for signing up. For more from  The Nation, check out our  latest issue.\n    The Nation is reader supported: Chip in $10 or more to help us continue to write about the issues that matter.\n  Sign up for  Take Action Now and we’ll send you three meaningful actions you can take each week.\t\t\t\t\t\t\t\t     You will receive occasional promotional offers for programs that support  The Nation’s journalism. You can read our   Privacy Policy here.\n  Thank you for signing up. For more from  The Nation, check out our  latest issue.\n  Be the first to hear about Nation Travels destinations, and explore the world with kindred spirits.\n     “ Have a nice time getting banned, my dude,” Army recruiter and gamer Joshua “Strotnium” David told me right before he booted me from the US Army’s  Twitch channel. I had just reminded viewers of the United States’ history of atrocities around the globe, and helpfully provided a link to the  Wikipedia page for US war crimes.    Was I undiplomatic? Sure. But if the military is going to use one of the world’s most popular platforms to recruit kids, then it shouldn’t be able to do so without some pushback. Right now, with the support of Twitch, gamers with the US military are spending hours with children as young as 13, trying to convince them to enlist. The Army, Navy, and Air Force all stream on Twitch using dedicated e-sports teams. These teams are comprised of skilled gamers who compete in tournaments for cash prizes. While members of military e-sports teams offer the regular gaming skill set, they’re also on-screen talent and recruiters. Instead of approaching a recruiter behind a table in a school cafeteria, kids can hang out with one who is playing their favorite video games and replying to their chat messages for hours on end.  Twitch, a livestreaming platform owned by Amazon, boasted  more than 5 billion hours watched from April through June. (For comparison, Netflix claims that during quarantine people have been viewing around 6 billion hours of its shows and movies a month.) A typical military stream looks something like this: A recruiter, usually a man in his 30s, sits comfortably in his gamer chair inside a dimly lit room illuminated by a monitor and the colorful LED lights of his computer tower. An American flag hangs on the wall behind his right shoulder, an oversized stuffed animal sits to his left. He’s playing Call of Duty or Valorant. He’s friendly, and talks about how much he loves being in the Army. Despite being older than most of his young viewers, he speaks like them. “It do be like that sometimes. We do have some great comms,” said a recruiter in one recent session. The practices employed on Twitch by military e-sports teams are part of a system by which recruiters target children in unstable and/or disadvantaged situations. Recruiters take advantage of the  poor seeking steady income, the  vulnerable longing for stability, and the  undocumented living in fear because of their citizenship status. Now, at a time when all those factors are magnified by a pandemic that has left  half the country out of work and over 30 percent  unable to afford their housing payments, conditions are ripe for recruiters to prey on anxious youth.  “I see you guys are upgrading from recruiting out of low-income schools, nice,” Twitch user xCanyon916 said in a Navy stream on Tuesday while the recruiter was fielding questions about life in the military from chatters expressing desire to join the Navy e-sports team. The recruiter warned xCanyon916 that if they said something again about the Navy’s recruiting practices, they’d be banned.  Hasan Piker, a popular Twitch streamer with a dedicated following of over 430,000 users, recoiled at the thought of recruiters’ building relationships with young, impressionable viewers.\t\t    “Twitch is unlike anything I’ve ever experienced in my career, and it’s because you’re live for hours on end, talking to these people in the chat. You develop a community and know your individual chatters. There is an ecosystem in every Twitch channel,” Piker said. “Recruiting in this predatory way is a violation of [the users’] safety.” While an 18-year-old might watch a piece of propaganda like  American Sniper once in movie theaters and go on with their lives, here military members themselves are streaming hawkish agitprop day after day. In some cases, such as Call of Duty, these are games that the military or ex-military figures have  consulted on and  helped shape. In these Twitch channels, recruiters are using these games to solicit young viewers to share personal information. Branches that use e-sports and Twitch streams to reach and recruit younger viewers rely on sleight-of-hand tactics, false promises, and deceptive messaging to trick them into filling out recruiting forms. The Twitter account for the US Army e-sports team links to a sparsely populated page with  register to win! at the top, no details on what one could even win, and a sign-up form that, according to a tiny disclosure at the bottom of the page, welcomes an eventual harangue by an Army recruiter. It allows people as young as 12 to submit the form, but adds a notice on the post-submission page that recruiters are not permitted to contact a child under the age of 16. Twitch’s  advertising pitch boasts that it can reach 80 percent of teen males in the United States. The minimum age requirement for Twitch is 13.\t   “All parents are concerned about screen time and what it’s doing to their children,” Justin Hendrix, the executive director of the NYC Media Lab, told me. “As a parent, I reckon a lot of us are unaware that our children are encountering marketing messages, influencers, and sales people in a variety of contexts online when we think they’re just playing games.” Twitch viewers in the Army’s channel are repeatedly presented with an automated chat prompt that says they could win a Xbox Elite Series 2 controller—an enhanced controller with customizable options and extra paddles for advanced play that costs upward of $200—and a link where they can enter the “giveaway.” It, too, directs them to a recruiting form with no additional mention of a contest, odds, total number of winners, or when a drawing will occur.\t\t\t\t    The Army declined to comment. There are over 325,000 current active-duty Navy servicemen and women. The inaugural Navy e-sports team commissioned earlier this year  consists of 10 people. To qualify for the e-sports team, you must be at least an E-4, petty officer third class, a rank that takes on average two to three years to reach. One cannot join the Navy and immediately be on the e-sports team, but the Navy’s Twitch channel features a bio that reads, “Other people will tell you not to stay up all night staring at a screen. We’ll pay you to do it. Get a look at what life is like inside the uniform on the America’s [sic] Navy.” Lara Bollinger, a public affairs officer with the Navy Recruiting Command, said in an e-mail that the bio is “a nod to the fact that when standing watch in various capacities on a ship (on the bridge, in the combat information center, etc.) a Sailor will be looking at various screens, (radar, sonar, navigation, etc…).” Twitch does not consider military e-sports streams mature programming, so it does not require people to enter their age before viewing. One need only click a button acknowledging that the stream is intended for older viewers. With screen time spiking because of the pandemic, this presents a troubling dynamic. “You can say what you want about people who serve in the military and what that says about them. I’m not saying they shouldn’t be able to play video games or e-sports, but I do think it’s more insidious to have the military using it as a recruiting tool for young, impressionable people,” Rod Breslau, an e-sports industry consultant and insider, said. Hart Viges, a veteran, peace activist, and counter-recruiter in Austin, sets up information tables in schools and throughout his community to help kids understand that joining the military is not the only way to attain a more stable living situation or money for college. Recruitment rhetoric also ignores many of the risks of military life, especially the psychological complications of returning to the civilian world. “They don’t talk about military sexual trauma. They don’t talk about the suicide rate. It’s mostly ‘We can pay for your school. You can serve your country,’” Viges said. “When I ask kids why they want to join, it’s either ‘I want to serve my nation’ or ‘I want to pay for college.’ I imagine recruiters feed off those two motivations the most.”\t\t\t\t    The use of gamified war propaganda to play into that myth isn’t new for the US military. The Army developed its own game franchise, America’s Army, which it launched in 2002 at the height of the War on Terror and includes story lines and missions based on real-life skirmishes. Games like Call of Duty whitewash the horrors of war, sterilize the violence, and mask the trauma inflicted on everyone involved. The e-sports industry has become overrun with military sponsorships and partnerships with different games, e-sports organizations, teams, and even some individual players. The Call of Duty League is sponsored by both the  Army and the  Air Force. The National Guard recently partnered with e-sports organization  NRG. Instead of running a Super Bowl ad, the Navy opted to  redirect those funds toward boosting its e-sports presence. The Navy sponsors ESLGaming and Fandom, two of the largest e-sports organizations in the world, as well as the e-sports team Evil Geniuses, which on Monday announced  a larger collaborative effort with its military funder. The Air Force, NRG, and Evil Geniuses declined to comment. The Navy also has a partnership with Twitch that grants it prominent placement in the homepage carousel. “Through our partnership with Twitch, the most popular e-sports streaming site, the Navy has immediate access to millions of 17-to-24-year-old e-sports enthusiasts on the platform to showcase a side of Navy life that viewers may not expect,” Bollinger said. “Viewers are asking our gamers insightful questions, and our gamers are effectively communicating that there is a place for everyone in the Navy.” None of the military branches or Twitch would comment on paid promotion or how branches might qualify for prominent placement on Twitch’s homepage, an incredibly valuable position thanks to Twitch’s  15 million daily active users. Users recently expressed dismay last month when the  Army’s channel was featured in the “Stream With Pride” category despite the military’s history of discriminating against the LGBT community. But beyond the recruiting mechanism, these nationalistic e-sports efforts disregard the violence that the US military inflicts around the world. “When tech and gaming platforms think of safety, they likely aren’t thinking about the very real violence predominately Muslim communities will face around the world as their platforms aid in military recruitment,” said Iram Ali, the interim director of campaigns at  Kairos, a fellowship program that supports more diverse and equitable leadership in tech. “It was interesting to see Call of Duty want to express support for Black Lives Matter. But what active steps will the creators take to make sure the way the military preys on poor Black and brown kids in recruitment isn’t also happening with the help of their video game?” This sentiment is complicated by the evolving nature of war, which makes gamers especially valuable. The military has  long employed  video-game-based training and was expanding its use even before the pandemic. Military personnel operate unmanned drones thousands of miles away using controllers that would be familiar to a serious gamer.  A recent study showed that gamers may make better drone operators than even experienced pilots. With the military’s Twitch recruitment strategies, it’s easy to see the beginnings of an e-sports to drone operator pipeline. “As we think about how automation and media are changing the way we fight wars, it’s concerning to think that children are being given the impression that the military is like a video game,” Hendrix said. “Whether it’s drones or killer robots, the last thing we need is less humanity in war.”\n    In order to comment, you must be logged in as a paid subscriber.  Click here to log in or subscribe.", "posttime": "2020-07-19 13:55:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,美国,军方,online,twitch", "title": "美国军方正在利用网络游戏招募青少年", "title_en": "The US military is using online gaming to recruit teens", "transed": 1, "url": "https://www.thenation.com/article/culture/military-recruitment-twitch/", "via": "", "real_tags": ["游戏", "美国", "军方", "online", "twitch"]}, {"category": "", "categoryclass": "", "imagename": "f12cfa8521e8290b155cdf730de77ea2.png", "infoid": 1012846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国一些最负担不起的市场也是反对建造负担得起的住房的斗争的起点-反对者说，建设负担得起的住房除了其他因素外，还会贬值附近的房屋价值。在旧金山、纽约和西雅图等全国各地紧张的住房市场上，出现了对经济适用房开发的抵制。\n在这些紧张的市场中，考虑到低库存和高价格，我们开始揭示房主真正需要担心的是什么。\n我们将低收入住房项目定义为那些通过美国财政部管理的低收入住房税收抵免(LIHTC)计划提供资金的项目。这些低收入住房项目的数据由美国住房和城市发展部(HUD)收集。使用Trulia房屋价值数据，我们检查了低收入住房项目建成前后附近房屋价值的变化。根据低收入住房项目的位置和完工日期，[1]我们确定这些项目是否会影响房屋价值。我们发现：\n在全国20个最负担不起的市场中，我们对1996年至2006年3083个低收入住房项目的分析发现，除了少数例外，低收入住房项目附近的房价没有显著影响。\n在有足够数据可衡量的城市中，加利福尼亚州圣何塞在过去十年中增加低收入住房单元(每千人7.81套)是最积极的。与此同时，奥克兰(每1000名居民增加0.52套)是人均新增住房最少的地区。\n在接受调查的20个市场中，丹佛是唯一一个在项目完成后，位于低收入住房项目附近的房屋在每平方英尺价格方面表现出积极影响的大都市地区。\n然而，在波士顿和马萨诸塞州的坎布里奇，低收入住房项目在每平方英尺的价格方面对附近的房屋产生了负面影响，这表明这两个地理上相邻的大都市存在特定地区的市场效应。\n我们把重点放在2007年房地产泡沫开始之前的一段时间，以确保价格反映出项目完成并准备入伙的前后一致的比较。\n[1]住房和城市发展部使用术语“投入使用”来表示符合条件的家庭何时可以入住。就本报告而言，我们认为这是该项目完成并准备入伙的时间。\n为了测试低收入住房的溢出效应，从1996年到2006年，我们跟踪了低收入住房项目两个不同距离的每平方英尺房价。对于该社区，我们确定了一个给定的低收入住房项目2000英尺内环内的房产，这些房产距离该项目足够近，足以受到该项目的影响。距离低收入住房项目2,001至4,000英尺的房产被用作对照组。[1]下图说明了如何将房产放置在低收入住房项目(橙色)周围的内圈(浅蓝色)和外圈(绿色)中。\n[1]在学术文献中，使用距离测量作为比较住房项目对靠近项目地点的房地产价值和周围社区房地产价值的潜在影响的一种方式是很常见的。参见Ellen等人的文章。(2007)对纽约市补贴住房项目对房地产价值的影响的分析，方法是将2000英尺范围内的房地产价格变化与周围类似社区的房地产价格变化进行比较。埃伦，英格丽德·古尔德，艾米·艾伦·施瓦茨，伊安·沃库和迈克尔·H·席尔。2007年。“联邦补贴租房会不会压低附近的房产价值？”政策分析与管理杂志。第26卷，第2期，第257-280页。\n如果一个低收入住房项目被安置到一个社区中，我们预计在项目完成后(0年)，与外环(蓝线)相比，内环(红线)的价格会有所下降，这就是说，如果一个低收入住房项目被安置到一个社区，我们就会看到内环(红线)的价格比外环(蓝线)的价格有所下降。就每平方英尺的中值价格而言，内部和外部距离缓冲区紧密跟踪在一起，如下图所示。\n在审查所有20个城市的项目时，将低收入住房项目附近的房产与距离较远的房产进行比较，每平方英尺的价格在统计上没有显着差异。同样，在地铁层面，大多数市场在项目完成后，内环和外环之间的价格没有显著差异。然而，一些住房市场显示，低收入住房项目投入使用后，每平方英尺的价格在低收入住房项目附近存在显著差异。", "note_en": "Some of the nation’s least affordable markets are also ground zero for the fight against building affordable housing – which opponents say, among other things, depreciates nearby home values. Resistance to affordable housing development has surfaced in tight housing markets across the country such as  San Francisco,  New York, and  Seattle.\n Given  low inventory and high prices in these tight markets, we set out to uncover how much homeowners really have to fear.\n We define low-income housing projects as those funded through the Low-Income Housing Tax Credit (LIHTC) program administered by the U.S. Department of Treasury. Data on these low-income housing projects are collected by the U.S. Department of Housing and Urban Development (HUD). Using Trulia home value data, we examined changes in nearby home values before and after a low-income housing project is completed. Based on the location of low-income housing projects and completion dates, [1] we determined whether or not these projects impact home values. We found:\n In the nation’s  20 least affordable markets, our analysis of 3,083 low-income housing projects from 1996 to 2006 found  no significant effect on home values located near a low-income housing project, with a few exceptions.\n Among the cities where there was enough data to measure,  San Jose, Calif., was the most aggressive in adding low-income housing units (7.81 per 1,000 people) during the decade. Meanwhile,  Oakland, (0.52 per 1,000 residents) added the fewest units per capita.\n Of the 20 markets examined,  Denver was the only metro area where homes located near low-income housing projects registered a  positive effect in terms of price per square foot after a project was completed.\n In  Boston and  Cambridge, Mass., however, low-income housing projects had a  negative effect on nearby homes in terms of price per square foot, suggesting a region-specific market effect for these two geographically adjacent metros.\n We focused on the time period prior to the start of the housing bubble in 2007 in order to ensure that prices reflect consistent comparisons around the time a project is completed and ready for occupancy.\n [1] HUD uses the term “placed into service” to denote when an eligible household can move in. For purposes of this report, we consider this the time at which the project is complete and ready for occupancy.\n  To test for spillover effects of low-income housing, we tracked home values in terms of price per square foot at two different distances from the low-income housing project from 1996 to 2006. For the  neighborhood , we identified properties within an inner ring of 2,000 feet of a given low-income housing project as close enough to be impacted by the project. Properties located 2,001 to 4,000 feet from the low-income housing project were used as a  comparison group . [1]  The chart below illustrates how properties are placed into inner (light blue) and outer (green) rings around a low-income housing project (orange).\n [1] Using distance measures as a way to compare potential effects of housing projects on property values proximate to a project site to those in surrounding neighborhoods is common in the academic literature. See Ellen et al. (2007)’s analysis of the effect of subsidized housing projects in New York City on property values by comparing price changes of properties within a 2,000 foot distance ring to those in similar surrounding neighborhoods. Ellen, Ingrid Gould, Amy Ellen Schwartz, Ioan Voicu and Michael H. Schill. 2007. “Does Federally Subsidized Rental Housing Depress Neighborhood Property Values?”  Journal of Policy Analysis and Management. Vol. 26, No. 2, pp. 257-280.\n  If there was an effect from the placement of a low-income housing project into a neighborhood, we would expect to see a drop in prices in the inner ring (red line) compared to the outer ring (blue line) after the project is completed (year 0). In terms of median price per square foot, the inner and outer distance buffers track closely together as shown in the figure below.\n There is no statistically significant difference in price per square foot when comparing properties near a low-income housing project and those farther away when examining projects across all 20 metros. Likewise, at the metro level, the majority of markets yield no significant difference in prices between the inner and outer ring after a project is completed. However, a few housing markets revealed significant differences in price per square foot near low-income housing projects after they were placed into service.", "posttime": "2020-07-19 13:55:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "housing,项目", "title": "低收入住房对附近房价没有影响", "title_en": "Low-Income Housing Has No Impact on Nearby Home Values", "transed": 1, "url": "https://www.trulia.com/research/low-income-housing/", "via": "", "real_tags": ["housing", "项目"]}, {"category": "", "categoryclass": "", "imagename": "182681e8bc0eb0ac0a34f574fc8c597e.gif", "infoid": 1012843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自2010年以来，我们一直提供“下载您的信息”服务，允许使用我们服务的用户访问他们与Facebook共享的数据的安全副本。2018年，我们宣布参与数据传输项目，这是一个与苹果、谷歌、微软和Twitter合作的项目，旨在为人们在在线服务之间传输数据建立一种通用方式。该项目的目标是使任何规模的服务更容易安全地将数据可移植性从一个服务直接传输到另一个服务，并使使用这些服务的人的流程更简单。\n在过去的一年里，已经开发了一个开源框架。今天，我们宣布在Facebook上推出一个新工具，允许人们直接将照片和视频从Facebook传输到Google Photos。我们计划在不久的将来将这项服务扩展至其他服务。该工具将于今天开始在爱尔兰推出，并将于2020年初在全球范围内推出。\n数据传输项目的任务是创建一个开源的、服务到服务的数据可移植性平台，以便Web上的所有个人都可以随时在在线服务提供商之间轻松地移动他们的数据。该项目通过提供一个开源库来实现这一点，任何服务都可以使用它来代表用户运行和管理直接传输。\n与期望每家公司从头开始构建自己的系统不同，这个开放源码框架允许它们共享框架以及适配器和数据模型中的任何改进。例如，使用Data Transfer Project框架的公司只需为现有数据类型创建一个新的Data Transfer Project导入器，即可将该数据类型发送到新服务。这个新的导入者也可以贡献回开源项目，从而允许其他公司也可以输出到该新服务，而不需要额外的技术工作。\n适配器，处理用户对服务(通常为OAuth)的身份验证以及与共享数据模型(导入器和导出器)之间的数据转换。\n任务管理框架，它将所有部分放在一起并处理传输作业的生命周期，包括创建作业和运行传输。\n数据传输项目可以在内存中本地运行以进行测试，也可以由想要试用代码的个人运行。该服务还具有高度的可扩展性，这使得它可以部署在云环境中，并作为企业级基础设施中的后端服务。有一些公共的开源扩展允许Data Transfer Project在Google Cloud平台和Microsoft Azure云托管提供商上运行。大规模部署Data Transfer Project以使其与我们的特定于基础设施的后端服务无缝协作需要一些深思熟虑的工程和设计工作。\n我们在过去的一年里一直在为今天开始发布的照片和视频传输工具奠定基础。我们已经编写了自己的专有扩展，这些扩展与我们的工具集成在一起，并允许我们操作可靠的服务。我们首先需要验证系统的安全性和可靠性。然后，我们需要构建一个易于理解的界面，人们可以通过该界面发起传输并监控状态。同时，我们还必须编写各种扩展来允许开放源代码与该接口通信-以及与我们的后端系统通信。\n任何将数据发送到服务之外的机制都有风险。我们已经采取措施来缓解这些风险。例如，我们使用常用协议OAuth通过目标服务对人员进行身份验证。随着我们继续添加更多的服务和数据类型，我们需要考虑几个因素。重要的是，系统只请求手头任务所需的权限。一旦传输完成，对目标服务的访问就应该结束。最后，转账只能由帐户所有者创建。为了验证这一点，我们要求人们在开始转账之前重新输入密码。一旦转账开始，我们还会向注册账户发送电子邮件，这样，如果人们改变主意或不承认请求，就有机会停止转账。\n当任何两个系统之间存在依赖关系时，每个系统都要尊重对方的容量，这一点很重要。例如，如果一个人一次传输数千张照片，我们需要确保接收这些照片的系统能够管理该输入，而不会使其过载或造成瓶颈。这涉及到诸如速率限制和优雅地处理停机时间之类的事情。数据传输项目允许配置自定义重试策略以处理不同的错误消息。因此，如果我们在给定的一分钟内达到了每个人的最大请求数，系统就可以延迟下一个请求，以免使另一个系统负担过重。\n开放源码具有作业存储的概念，但是为了利用我们现有的基础设施，我们需要一个自定义版本，该版本可以使用我们的主实体存储TAO检索和修改可移植性作业。这使我们能够利用TAO的可伸缩性和现有的索引、缓存、验证和许可功能。\n此外，我们还编写了与我们的日志记录框架(如Scribe)集成的自定义监视实现。这意味着数据传输项目的日志可以与其他Facebook服务一致地生成，并与我们的分析和警报工具无缝集成。对于托管，我们可以通过创建特定于Facebook的部署策略，通过Tupperware管理传输工作人员，从而优化我们数据中心的计算资源。Tupperware还意味着我们可以有单独的发行层和生产层，允许在部署给用户之前在Facebook环境中对代码进行全面测试。通过与Configerator通信的分机，我们可以配置我们的传输工作进程。\n我们相信，数据传输项目表明，行业主导的解决方案可以帮助使数据可移植性成为现实。我们还相信，人们应该能够将他们的数据从一项服务转移到另一项服务。我们很高兴能够推出这第一个工具，并期待着与更多的专家和公司合作，特别是与初创公司和新平台合作，因为这个项目正在继续扩大。我们致力于在接下来的几个月里继续构建更多的工具，使人们能够传输其他类型的数据。要了解有关Data Transfer Project开放源代码的更多信息，您可以阅读技术白皮书，观看我们的@Scale技术讲座，或访问GitHub存储库。", "note_en": "Since 2010, we have offered   Download Your Information  to allow people who use our services to access a secure copy of the data they have shared with Facebook. In 2018,   we announced our participation in the Data Transfer Project , a collaborative effort with Apple, Google, Microsoft, and Twitter to build a common way for people to transfer their data between online services.  The goal of this project has been to make it easier for services of any size to securely make direct transfers for data portability from one service to another and to make the process simpler for the people who use these services.\n Over the past year, an open source framework has been developed. Today, we are announcing a new tool on Facebook that allows people to transfer photos and videos directly from Facebook to Google Photos. We plan to expand this to other services in the near future. This tool will begin rolling out in Ireland today and will be available worldwide in early 2020.\n   The mission of the   Data Transfer Project  is to create an open source, service-to-service data portability platform so that all individuals across the web can easily move their data between online service providers whenever they want. The project does this by providing an open source library that any service can use to run and manage direct transfers on behalf of users.\n Rather than expecting every company to build its own system from scratch, this open source framework allows them to share any improvements in the framework as well as adapters and data models. For example, a company using the Data Transfer Project framework can send an existing data type to a new service by simply creating a new Data Transfer Project importer for that data type. That new importer can also be contributed back to the open source project, thereby allowing other companies to export to that new service, as well, with no additional technical work.\n  Adapters, which handle the authentication of a user to a service (normally OAuth) and the transformation of data to and from the shared data models (importers and exporters)\n A task management framework, which puts all the pieces together and handles the life cycle of a transfer job, including job creation and running the transfer\n The Data Transfer Project can be run locally in memory for testing and by individuals who want to   try out the code . The service is also highly extensible, which allows it to be deployed in cloud environments and as a back-end service in enterprise level infrastructure. There are public, open source extensions that allow the Data Transfer Project to be run on the   Google Cloud Platform  and   Microsoft Azure  cloud hosting providers. Deploying the Data Transfer Project at scale so that it would work seamlessly with our infrastructure-specific back-end services required some thoughtful engineering and design work.\n   We’ve spent the past year building the foundation for the photo and video transfer tool we’re starting to release today. We’ve written our own proprietary extensions, which integrate with our tooling and allow us to operate a reliable service. We first needed to verify the security and reliability of the system. We then needed to build an easy-to-understand interface through which people can initiate transfers and monitor the status. Simultaneously, we also had to write various extensions to allow the open source code to communicate with that interface — as well as with our back-end systems.\n  Any mechanism to send data outside of a service carries risk. We have put measures in place to mitigate these risks. For example, we use the commonly used protocol   OAuth  to authenticate people with the destination service. As we continue to add more services and data types, we needed to look at several factors. It’s important that the system request only the permissions required for the task at hand. Access to the destination service should end once the transfer is complete. Finally, transfers should only be created by the owner of the account. In order to verify this, we ask people to reenter their password before initiating a transfer. We also send an email to the registered account once a transfer has begun, which allows people a chance to stop the transfer if they change their mind or do not recognize the request.\n  When there is a dependency between any two systems, it is important that each system respect the other’s capacity. For instance, if a person transfers thousands of photos at once, we need to ensure that the system receiving those photos is able to manage that input without overloading it or causing bottlenecks. This involves things like rate limiting, and gracefully handling downtime. The Data Transfer Project allows for configuration of custom retry strategies to handle different error messages. So, if we have hit the maximum number of requests per person within a given minute, the system can delay the next request so as to not overburden the other system.\n  The open source code has the concept of a job store, but to take advantage of our existing infrastructure, we needed a custom version that can retrieve and modify portability jobs using our main entity store,   TAO . This enables us to take advantage of TAO’s scalability and existing capabilities for indexing, caching, validation, and permissioning.\n Additionally, we’ve written a custom monitoring implementation that integrates with our logging frameworks, such as   Scribe . This means that logs from the Data Transfer Project can be produced consistently with other Facebook services and integrate seamlessly with our analysis and alerting tools. For hosting, we are able to manage the transfer workers via   Tupperware  by creating a Facebook-specific deployment policy, which allows us to optimize compute resources in our data centers. Tupperware also means we can have separate release and production tiers, allowing for comprehensive testing of code within the Facebook environment before deploying to users. An extension that communicates with   Configerator  allows us to configure our transfer workers.\n We believe the Data Transfer Project shows that industry-led solutions can help make data portability a reality. We also believe that people should be able to move their data from one service to another. We are excited to be putting this first tool out and look forward to working with even more experts and companies, especially startups and new platforms, as this project continues to expand. We are committed to continuing to build more tools in the coming months that enable people to transfer other types of data. To learn more about the Data Transfer Project open source code, you can   read the technical whitepaper ,   watch our @Scale technical talk , or   visit the GitHub repository .", "posttime": "2020-07-19 13:31:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据传输,transfer,服务", "title": "数据传输-项目", "title_en": "Data-Transfer-Project", "transed": 1, "url": "https://engineering.fb.com/security/data-transfer-project/", "via": "", "real_tags": ["数据传输", "transfer", "服务"]}, {"category": "", "categoryclass": "", "imagename": "2afd92d471a26c6e63bb67b409e7e406.png", "infoid": 1012842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下面是如何设置付费(或免费！)。在新自定义域使用Ghost的时事通讯。\nGhost是子堆栈的替代方案，它允许您启动托管服务器，然后在需要时迁移到您自己的服务器。它是开源的，所以它是完全可定制的。它还包括会员和货币化功能。\n为什么不是子堆栈呢？它很棒，但作为一项集中式服务，它不能提供同样程度的可定制化和灵活性。然而，你可以更容易地在那里开始，而且它有排行榜和社区。\n为什么不是Wordpress呢？它也很棒，但没有“幽灵”那么现代。不过，您可以在WordPress.com上快速设置，然后使用wordpress.org迁移到自托管版本，就像Ghost一样。\n如果你按照这篇文章中的说明操作，你的博客在完成后会是这样的。注意右上角的订阅按钮！\nGhost令人敬畏的一点是，它允许你建立受众，并以假名货币化来保护你的隐私。你想建一个假名博客吗？如果是这样的话，您有两个选择。\n国家级行动委员会。为了获得最大的操作时间，在按照下面的说明操作之前，您需要购买一台新笔记本电脑、VPN和一张预付借记卡。你还想阅读洛普的这篇文章和斯诺登的这篇文章，做一些看似偏执的事情，这些事情超出了这篇文章的范围。\n人群级别的操作安全。大多数人还不需要那种级别的安全，除非他们在做NSA级别的事情。只需设置一个新的电子邮件，在你的博客上使用一个化名，并配置私有域名注册，就可以保护你的隐私免受大部分互联网的侵害。\n请注意，无论采用哪种方式，拥有以下服务(Protonmail、Cloudflare、Ghost、Strike和可选的GitHub)根访问权限的用户都将拥有有关您的数据。尽管如此，基本的预防措施会减少你的攻击面。\n在cloudflare.com上注册一个帐户，并使用您刚刚为联系信息设置的ProtonMail地址直接在那里注册域名。\n请注意，我是在Cloudflare最近的停机时间之前写下这篇文章的；如果您愿意，请随意使用其他注册商，这对下面的内容不是必需的。\n还要注意的是，即使Cloudflare在注册域名时要求您提供信息，您的注册在默认情况下也会被编校。\n下一步是在ghost.org创建一个blog，并将其映射到自定义域，如下所示。请注意，Ghost有两个级别：\n然后是$name.ghost.io，它是单个博客的管理界面(我们将在下面的屏幕截图中使用example123499.ghost.io)。\n要在Ghost上设置自定义域，您需要首先在my.ghost.org/signup创建一个博客。然后转到my.ghost.org/signin和dash.cloudflare.com编辑A记录，如下面的截图所示。\n如果您需要更多细节，官方说明在这里。一旦起作用，您应该会发现$name.ghost.io现在出现在$name.com上。在本例中，example123499.ghost.io中的内容现在显示在example123499.com上。您现在有了一个带有自定义域的博客！\n下一步是把你的博客变成付费时事通讯。Ghost包括一个预建的主题，称为Lyra，它设置了这一点。\n转到example123499.ghost.io/host的等价物，登录到新博客的管理界面。这与my.ghost.org/signin不同。前者管理博客。\n现在用户可以注册并订阅您的付费博客。您可以使任何给定的帖子免费或付费，并发送电子邮件时事通讯。现在您已经启动并运行了基本设置，可以在Ghost和Stripe端同时配置几个设置。让一两个朋友用他们的信用卡注册，然后给他们发一封电子邮件，来测试一下整个过程。\n现在您已经完全设置好可以发布到Ghost了。你可以在这里浏览帖子，了解系统是如何工作的，也可以登录到你自己的Ghost实例，网址与example123499.com/GHOST相当。如果你想让你的博客看起来漂亮，你需要生成以下图片：\n在使用Ghost Editor时，您还需要为社交媒体预览创建单独的帖子图像。你可以使用Canva或Figma来生成这些，也可以使用Iconider来获得视觉灵感。你也可以安装一个桌面客户端来编辑Ghost帖子。\n如果您是一名开发人员，并且想要修改站点的外观，您可以设置Ghost主题以通过GitHub进行部署。您可以通过派生Lyra，然后设置此操作来做到这一点。现在，每次您按下提交按钮时，操作都会触发，主题也会更新。您还可以通过在本地运行Ghost来预览编辑。\n为什么您可能想要编辑您的主题？通过这样做，您可以编辑各种页面上的默认副本，创建新的页面模板等。\n请注意，如果您不想使用天琴座主题本身作为基础，您可以购买一个预先构建的或学习如何自定义幽灵主题自己。如果你真的买了一个主题，记得买一个支持Ghost会员资格的主题，因为并不是所有的主题都支持。\n这整件事大概要花你一个小时左右的时间。到最后，你会在你自己的域名上有一个好看的博客，可以处理会员资格，接受付款，并发送付费时事通讯。如果你选择的话，它可以是化名。", "note_en": "Here&#39;s how to set up a paid (or free!) newsletter using  Ghost at a new custom domain.\n Ghost is an alternative to Substack that allows you to start hosted and then migrate to your  own server when desired. It&#39;s open source, so it&#39;s fully customizable. And it has membership and monetization features included.\n Why not Substack? It&#39;s wonderful, but as a centralized service it doesn&#39;t offer the same degree of customizability and flexibility. You can however  get started there a bit more easily, and it has leaderboards and a community.\n Why not Wordpress? It&#39;s also wonderful, but it&#39;s not as modern as Ghost is. You can however quickly set up on wordpress.com and  migrate to a self-hosted version using wordpress.org, just like Ghost.\n If you follow the instructions in this post, your blog will look something  like this when done. Note the &#34;subscribe&#34; button in the upper right corner!\n   One of the awesome things about Ghost is that it allows you to build an audience and  monetize pseudonymously to protect your privacy. Do you want to set up a pseudonymous blog? If so, there are two options for you.\n State-level opsec. For  maximum opsec, before following the instructions below you want to get a new laptop, a VPN, and a  prepaid debit card. You also want to read this post by  Lopp and this by  Snowden and do seemingly paranoid things that are beyond the scope of this post.\n Crowd-level opsec. Most people don&#39;t need  quite that level of security yet, unless they are doing  NSA-level stuff. Just setting up a new email, using a pseudonym on your blog, and configuring private domain registration will guard your privacy against much of the internet at large.\n Note that either way, the people with root access to the services below (Protonmail, Cloudflare, Ghost, Stripe, and optionally GitHub) will have data on you. Still, basic precautions will reduce your attack surface.\n   Get an account at  cloudflare.com and register the domain  directly there, using the protonmail address you just set up for contact info.\n Note that I wrote this up prior to Cloudflare&#39;s recent  downtime; feel free to use  another registrar if you want, it&#39;s not essential to what follows.\n Note also that even though Cloudflare does ask you for information when registering the domain, your registration will be  redacted by default.\n   The next step is to create a blog at ghost.org and map it to a custom domain, as shown below. Note that there are two levels to Ghost:\n And then there is  $name.ghost.io, which is the admin interface to a single blog (we will use  example123499.ghost.io in the screenshots below)\n To set up a  custom domain on Ghost, you need to first create a blog at   my.ghost.org/signup.  Then go to   my.ghost.org/signin and  dash.cloudflare.com to edit the A records as shown in the screenshots below.\n The official instructions  are here if you need more detail. Once this works, you should find that  $name.ghost.io now appears at  $name.com. In this example, content from  example123499.ghost.io now appears at  example123499.com. You now have a blog with a custom domain!\n   The next step is to turn your blog into a paid newsletter. Ghost includes a pre-built theme called  Lyra that sets this up.\n Go to the equivalent of  example123499.ghost.io/ghost to log into the admin interface for your new blog. This is  different from  my.ghost.org/signin. The former administers the blog\n  Now users can sign up and subscribe to your paid blog. You can make any given post free or paid, and  send out an email newsletter. There are several settings to configure on both the Ghost and Stripe side that you can dig into now that you have the basic thing up and running. Test the whole thing out by getting a friend or two to sign up with their credit card and send them an email.\n  Now you are fully set up to post to Ghost. You can browse the posts  here to understand how the system works, or log in to your own Ghost instance at the equivalent URL for   example123499.com/ghost. If you want to make your blog look pretty, you&#39;ll want to generate the following  images:\n  As you use the  Ghost Editor, you&#39;ll also want to create individual post images for social media preview. You can use  Canva or  Figma to generate these, as well as  Iconfinder for visual inspiration. You can also install a  desktop client for editing Ghost posts.\n  If you&#39;re a developer and want to modify the look of your site, you can set up your Ghost theme for  deployment via GitHub. You would do that by forking  Lyra and then setting up  this action. Now, every time you push a commit, the action triggers and the theme updates. You can also preview your edits by running Ghost  locally.\n Why might you want to edit your theme? By doing this you can edit the default copy on various pages, create new page templates, and the like.\n Note that if you don&#39;t want to use the Lyra theme itself as a base, you can buy a pre-built one or learn how to customize  Ghost themes yourself. If you do buy a theme, remember to get one of the themes that  support  Ghost  memberships, as not all of them do.\n  This whole thing should take you about an hour or so. By the end you&#39;ll have a decent looking blog at your own domain that can handle memberships, accept payments, and send out a paid newsletter. And it can be pseudonymous if you choose.", "posttime": "2020-07-19 13:30:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,付费,paid,ghost", "title": "在您自己的域名上设置付费时事通讯", "title_en": "Set Up a Paid Newsletter at Your Own Domain", "transed": 1, "url": "https://balajis.com/set-up-a-paid-newsletter-at-your-own-domain/", "via": "", "real_tags": ["域名", "付费", "paid", "ghost"]}, {"category": "", "categoryclass": "", "imagename": "b5386f7bf7067c0d74d53ed7f81426f3.jpg", "infoid": 1012840, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着绝大多数企业和州试图重新开业，人们争先恐后地重返公共生活，他们一头扎进了“恢复正常”的陷阱。他们没有意识到，由于许多州重新开放得太快，我们又一次进入了一波又一波的限制时期。\n事实上，一些提前开放的州已经重新实施了一些限制，这表明，正如我在3月初的一篇报纸社论中预测的那样，我们将面临一波又一波的限制和关闭，直到我们有了疫苗，我们需要更多地关注虚拟互动。为了避免陷入常态的陷阱，我们需要了解现在发生的事情和大流行开始时发生的事情之间的相似之处。\n许多著名的商界和政界领袖在大流行的早期阶段都对此轻描淡写。因此，大多数企业主和普通公民最初认为这次大流行并不比普通感冒严重多少。\n这一初步印象巩固了他们对新冠肺炎威胁的信念。在神经科学和行为经济学研究中，像我这样的科学家称这种最初印象为“锚”。我们的大脑倾向于陷入一种危险的判断错误，称为锚定偏差或焦点主义，在这种错误中，我们过多地相信我们收到的关于某个主题的最初信息，并通过对最初印象的过滤来感知其余的信息。这意味着，随着有关新冠肺炎危险的新信息的出现，人们仍然坚持最初的印象。基于新的证据，他们感到非常不情愿改变主意。\n这一点在戴口罩指南中表现得最为明显。最初，疾控中心表示，没有必要戴口罩来保护自己或他人免受新冠肺炎的伤害。随着时间的推移，随着关于戴口罩好处的研究证据的积累，疾控中心改变了指导方针，强调了在公共场合戴口罩的重要性。这就是科学的运作方式：改变证据会导致改变指导方针。\n但这不是我们的大脑如何工作的，至少对于那些没有接受过批判性证据评估培训的人来说是这样。\n结果是什么呢？许多人无视新的指导方针，特别是如果那些他们认为是权威人物的人没有加强它的话。由于一种称为情绪传染的精神盲点，我们倾向于采纳那些我们视为权威人物的观点。有了他们的指导，我们可以克服最初的锚定；没有他们，我们将坚持最初的观点。\n同样有问题的还有另一个危险的判断错误，认知神经学家称之为正常偏差。这个心理盲点指的是这样一个事实，即我们的直觉反应驱使我们感觉到，未来，至少在未来几年的中短期内，将以与过去大致相同的方式发挥作用：正常情况下。\n因此，我们往往会大大低估灾难袭击我们的可能性和影响。此外，即使在我们应该为余震或灾难继续做准备的时候，我们也会急于恢复正常。\n我们知道，最终对付新冠肺炎的最好办法就是找到疫苗。由于高昂的研究成本和围绕审批过程的安全法规，开发一个通常需要十年或更长时间。幸运的是，政府、市场和慈善力量联合起来，将广泛的资金用于开发疫苗，并将审批过程标准降至确保安全性和有效性所需的最低限度。\n尽管如此，虽然有100多个组织启动了开发疫苗的项目，还有几个组织已经创造了一个可行的原型，但疫苗需要几个月的时间才能通过人体试验。在理想的情况下，如果前几种疫苗中的一种确实成功地通过了试验，并被证明非常有效，没有任何不可接受的副作用-一个非常大的如果-我们可能会在2021年夏天之前有一种疫苗被批准广泛使用。\n然后呢？嗯，我们需要大规模生产疫苗，将其分发给我们中最脆弱的人，并最终将其分发给每个人。比如说，仅为1亿最脆弱的美国人生产足够的疫苗本身就需要几个月的时间。你还有分发它和给人们接种疫苗的障碍，以及处理反Vaxer情绪的障碍，所以再加几个月的时间。这使我们在一个非常乐观的时间表上进入2022年初。\n但考虑到所有疫苗中只有很小一部分通过了试验，我们不应该指望我们会如此幸运，考虑到可能出现不可接受的副作用或有效性不足。更现实地说，可能要到2023-24年，我们才能获得足够安全有效的疫苗。\n现在，这个信息早在二月份就被知道了。然而，常态偏见让我们很难想象我们的世界可以如此迅速地颠倒过来。2020年初，政界和商界领袖以及普通民众甚至开始想象，要到2022年初-更现实的是2024年至2025年-我们才能凭借令人难以置信的运气，有望击败新冠肺炎。尽管最好的科学专家在这方面发表了明确的声明，但仍是如此。\n常态偏差、锚定偏差和情绪传染是认知神经科学家和像我这样的行为经济学家称之为认知偏差的一百多个心理盲点中的三个，这些盲点导致我们在从职业生活到购物选择的各个领域做出糟糕的决定。幸运的是，最近学者的研究，包括我自己的工作，已经表明我们如何有效地击败这种危险的判断错误。\n首先，如果我们不面对事实，我们将一事无成。我们需要承认，新冠肺炎从根本上颠覆了我们的世界，在2020年2月和3月的短短几周内就把世界颠覆了。令人遗憾的是，它不会消失；相信它会让我们深陷这场混乱，使美国的疫情成为世界上人均死亡人数最多的疫情之一。\n接下来，我们需要了解和评估我们每个人在哪里陷入了这些偏见，并评估我们这样做给自己带来的痛苦。然后，我们需要现实地考虑长期影响，并为解决重大中断可能性的情景进行规划。\n因此，准备好应对一波又一波的长期限制和放松，特别是考虑到冠状病毒很可能在秋季变得更糟糕，因为天气变冷，我们在室内呆的时间更长。记住，即使你过去做出了一些糟糕的决定，你也总是有机会在未来做出更好的决定，以求在大流行中生存和茁壮成长。", "note_en": "As the vast majority of businesses and states have tried to reopen and people rush back to public life, they’ve run  headlong into the trap of “getting back to normal.” They didn’t realize we’re heading into a period of waves of restrictions once again, due to many states reopening too soon.\n  Indeed, some of the states to open early onward have already  reimposed some restrictions, showing that, as I predicted  in a newspaper editorial back in early March, we will be facing rolling waves of restrictions and shutdowns until we have a vaccine, and that we need to focus much more on virtual interactions. To avoid the trap of normalcy, we need to understand the parallels between what’s going on now, and what happened at the start of the pandemic.\n  Many prominent  business and  political leaders downplayed the pandemic in its early stages. As a result, most business owners and ordinary citizens initially perceived the pandemic as little worse than the common cold.\n  This initial impression cemented their beliefs about the threat posed by COVID-19. In neuroscience and behavioral economics research, scientists like me call such initial impressions an “anchor.” Our minds tend to fall into a dangerous judgment error called the  anchoring bias, or focalism, where we give too much credit to the initial piece of information we received on a topic and perceive the rest of the information through the filter of that initial impression. That means as new information became available about the danger of COVID-19, people stuck to their initial impressions. They felt very reluctant to change their minds based on new evidence.\n  Nowhere is this more evident than in guidance on wearing masks. Initially, the CDC indicated that there’s no need to wear masks to protect yourself or others from COVID-19. Over time, as research evidence accumulated on the benefits of wearing masks, the CDC  changed its guidelines, highlighting the importance of masking in public. That’s how science works:  changing evidence results in changing guidelines.\n  But that’s not how our brains work, at least for those without training in critical evaluation of evidence.\n  The result? Many disregarded the new guidance, especially if those they considered authority figures did not reinforce it. Consequent to a mental blind spot called  emotional contagion, we tend to adopt the perspectives of those we see as authority figures. With their guidance, we can overcome initial anchoring; without it, we will stick to our initial perspective.\n  Just as problematic is another dangerous judgment error that cognitive neuroscientists call  normalcy bias. This mental blind spot refers to the fact that our gut reactions drive us to feel that the future, at least in the short and medium term of the next couple of years, will function in roughly the same way as the past: normally.\n  As a result, we tend to vastly underestimate both the possibility and impact of a disaster striking us. Moreover, we will rush to get back to normal even when we should be preparing for the aftershocks or continuation of the disaster.\n  We know that the best way to deal with COVID-19 conclusively involves finding a vaccine. It usually takes a decade or more to develop one, as a result of the high costs of research and the safety regulations around the approval process. Fortunately, government, market and philanthropic forces have combined to channel extensive funding toward developing vaccines and minimizing the approval process standards to the  bare minimum needed to ensure safety and effectiveness.\n  Still, while over a hundred organizations launched projects to develop vaccines, and several have created a viable prototype, it will take many months for the vaccine to go through human trials. In the ideal scenario, if one of the first several vaccines does successfully make it through trials and proves highly effective without any unacceptable side effects—a very big if—we might have a vaccine approved for widespread use by summer of 2021.\n  What then? Well, we need to mass-produce the vaccine, to distribute it to the most vulnerable among us, and eventually to give it to everyone. Producing enough vaccine for only, say, the 100 million most vulnerable Americans would itself take a few months. You also have the obstacle of distributing it and actually vaccinating people, as well as dealing with anti-vaxxer sentiments, so add another few months. That brings us into the start of 2022 on a highly optimistic timeline.\n  But given the fact that only a very small percentage of all vaccines make it through the trials, we shouldn’t expect that we’ll get so wonderfully lucky, considering the possibilities of either unacceptable side effects or insufficient effectiveness. More realistically, it might be not until 2023–24 when we get a sufficiently safe and effective vaccine.\n  Now, this information was known as early as February. However, the normalcy bias makes it very difficult for us to imagine that our world can turn upside down so quickly. In early 2020, it was extremely uncomfortable for political and business leaders, and ordinary citizens, to even begin to imagine that it wouldn’t be until early 2022—and more realistically 2024–25—that we could, with incredible luck, expect to vanquish COVID-19. This is despite clear statements from the best scientific experts to that effect.\n  The normalcy bias, anchoring bias and emotional contagion are three of over a hundred mental blind spots that cognitive neuroscientists and behavioral economists like me call  cognitive biases, which cause us to make bad decisions in areas from  professional lives to  shopping  choices. Fortunately, recent research by scholars, including my own work, has shown how we can effectively defeat such dangerous judgment errors.\n  First, we won’t get anywhere if we don’t face the facts. We need to acknowledge that COVID-19 fundamentally disrupted our world, turning it upside down in a few short weeks in February and March 2020. Regrettably, it will not disappear; believing that it will helped get us mired so deep in this mess, making the U.S. outbreak  one of the worst in the world in terms of deaths per capita.\n  Next, we need to understand and evaluate where each of us has fallen into these biases, and to evaluate the pain we cause ourselves by doing so. Then, we need to consider the long-term impacts realistically, and plan for a scenario that addresses the likelihood of major disruptions.\n  So, prepare to deal with waves of restrictions and loosenings for the long haul, especially as it’s likely that the coronavirus will get worse in the fall, as weather gets colder and we spend more time indoors. Remember, even if you made some bad decisions in the past, you always have the opportunity to make better decisions going forward to  survive and thrive through the pandemic.", "posttime": "2020-07-19 12:50:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "坏消息,news,疫苗", "title": "关于大流行的坏消息：我们不会很快恢复正常", "title_en": "Bad News about the Pandemic: We're Not Getting Back to Normal Any Time Soon", "transed": 1, "url": "https://www.scientificamerican.com/article/bad-news-about-the-pandemic-were-not-getting-back-to-normal-any-time-soon/", "via": "", "real_tags": ["坏消息", "news", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "eef537c91bcf2da2dbe2279575936cf4.jpeg", "infoid": 1012839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最终导致艾萨克·牛顿(Isaac Newton)撰写并出版他的杰作“自然数学原理”(the PhilosophiæNaturalis Princiia MATHEMIA)的事件发生在伦敦的一家咖啡馆。\n这并不像乍看起来那么奇怪，咖啡馆在1650年左右首次出现在英国后不久，就成为英国科学知识分子、天文学家、数学家和自然哲学家最喜欢的聚会场所。在这里，这些专家们将聚在一起交流思想，讨论最新的科学理论，并相互挑战。这些机构还赢得了彭尼大学(Penny University)的称号，因为其中一些学者，如威廉·惠斯顿(William Whiston)、弗朗西斯·霍克斯比(Francis Hauksbee)和亚伯拉罕·德·莫弗尔(Abraham De Moivre)，通过向愿意的观众举办讲座或演示实验来提高他们的收入，这些观众为他们的智力娱乐支付了一杯咖啡的价格，一便士。后来，在他成为欧洲在世的最著名的自然哲学家后，艾萨克·牛顿(Isaac Newton)会来到一家咖啡馆开庭，周围是他的追随者--最初的牛顿派，分发智慧的话语，分发他未出版的手稿供审阅。然而，这一切仍在未来。\n1684年1月的一天，克里斯托弗·雷恩(Christopher Wren)、罗伯特·胡克(Robert Hooke)和埃德蒙·哈雷(Edmond Hley)边喝咖啡边讨论实际的天文理论。雷恩，今天更为人所知的是英国最著名的建筑师之一，他是一位著名的数学家和天文学家，曾担任过格雷沙姆和萨维利亚的天文学教授。牛顿将他与约翰·沃利斯和威廉·奥特雷德一起命名为17世纪英国三大数学家之一。\n胡克当时被认为是这个国家领先的实验自然哲学家，而哈雷作为一名数学家和天文学家享有极高的声誉。\n讨论的主题是开普勒的椭圆形日心天文学和反重力平方定律。这三个人分别独立地得出了可能源自惠更斯离心力公式的反平方引力定律。雷恩向另外两个人提出了一个问题，即他们是否能证明这样的定律会导致开普勒的椭圆行星轨道。\n胡克声称，他已经有过这样的演示，但在其他人承认他们无法解决问题后，他会首先向他们透露。雷恩对胡克的说法表示怀疑，并向第一个制作这样的演示的人提供了一本价值40先令的书的奖品。胡克坚持自己的主张，但没有交付。值得注意的是，胡克从未进行过这样的演示。哈雷，正如已经说过的那样，不是一个刻薄的数学家，他试图解决这个问题，但失败了。\n1684年8月，哈雷访问剑桥，在他位于三一学院的房间里见了牛顿，据我们所知，牛顿是在1682年认识的。\n根据牛顿对亚伯拉罕·德莫弗的描述，哈雷问牛顿：“他认为，假设对太阳的吸引力与距太阳距离的平方成反比的行星描述的曲线是什么。艾萨克爵士立即回答说，这将是一辆椭圆…。“。牛顿声称知道雷恩问题的答案。哈雷问牛顿他是怎么知道的，他回答说：“我算了…。”牛顿装模作样地寻找假想的解决方案，但找不到。然而，他向哈雷承诺，他会把解决方案寄给他。\n11月，三一学院的研究员爱德华·佩吉特给哈雷带来了一篇9页的论文，题为“回旋中的身体运动”(On The Motion Of Body In A Orbit)。\n当哈雷读到牛顿的小册子时，他立刻意识到他手里拿着的是天文史和物理史上真正划时代的东西。牛顿给出了一个数学证明，证明椭圆轨道将由位于椭圆焦点之一的反平方力产生，从而将重力反平方定律与开普勒第一定律结合起来。他接着还推导了开普勒第二定律和第三定律，并奠定了动力学数学理论的开端。哈雷于1684年12月10日向皇家学会报告了这项非凡工作的细节：\n哈雷先生叙述说，他最近在剑桥见到了牛顿先生，牛顿先生给他看了一本奇特的论文“德莫图”：据说，在哈雷先生的要求下，这本书答应送到协会登记在册。\n人们希望哈雷先生牢记牛顿先生的诺言，在他有空发表他的发明之前，确保他的发明不为他人所知。帕吉特先生被邀请加入哈雷先生的行列。\n人们对阅读牛顿的新作品的兴趣和需求非常高，但作者决定改进和重写他的第一部作品，引发了他一生中最不寻常的事件之一。\n虽然牛顿是卢卡斯教授，1684年12月25日将满42岁，但在17世纪末的知识界，他仍然是一个鲜为人知的人物。在17世纪70年代他的光学著作出版后，他陷入了自己的外壳，与世隔绝地生活在剑桥大学的围墙里。他履行了卢卡斯教授的职责，但几乎没有学生可言，也肯定没有弟子。多亏了他的前任卢卡斯教授艾萨克·巴罗(Isaac Barrow)等人的口碑宣传，尤其是勤奋的数学粉丝约翰·柯林斯(John Collins)的口碑宣传，有传言称，一个数学怪物睡在他在三一学院的房间里，但他没有做任何事情来证明这一污浊的名声是合理的。他的房间里散落着无数未完成的科学手稿，大多是数学的，也有自然的哲学的，还有更多的炼金术和神学手稿，但没有一个处于适合出版的状态，牛顿也没有表现出将它们置于合适的状态的迹象。现在情况发生了变化，牛顿已经找到了他的职业和他的缪斯，在他生命的接下来的两年半里，他致力于创造使他成为科学史上的传奇人物的工作，把德莫图重新写成他的原理。\n在这两年半的时间里，牛顿把他那本九页的小册子变成了一部重要的三卷本科学著作。I B Cohen的现代英语翻译只有560多页的大版面，尽管这包含了第二版和第三版中所做的所有增加和修改，所以原始版本可能会略短一些。哈雷接手了这部作品的编辑工作，对它进行了抄袭，并在报刊上看到了这部作品。1685年，皇家学会投票决定接管牛顿的杰作的印刷和出版费用，所以一切似乎都很顺利，然后灾难发生了两次，第一次是以罗伯特·胡克的形式，第二次是以财务问题的形式。\n胡克毫不迟疑地声称他在任何科学发现或发明问题上拥有优先权，他自己首先发现了万有引力的平方反比定律，而且这一事实确实应该在牛顿的书的序言中得到充分的承认。哈雷立刻意识到了形势的潜在危险，他第一个写信给牛顿，概述了胡克对优先权的主张，当然，他尽可能地用外交辞令来说明这一点。哈雷的外交手段没有奏效，牛顿勃然大怒。牛顿说，起初他的反应相对温和，只是指出，早在1679年与胡克交流之前，他就已经有了平方反比定律，实际上，他在1677年与雷恩讨论过这件事，去问问他。然后，随着有更多的时间思考这件事，牛顿积聚了精力，他给哈雷写了一封新的信，猛烈抨击胡克和他的主张，就像一只疯狗。这一切都以牛顿宣布他将不再写他作品的第三卷而告终。哈雷当时并不知道这一点，但事实上，正如我们将要看到的，这是整个工作中最重要的部分，在这部作品中，牛顿提出了他的开普勒式宇宙的数学模型，这个宇宙由万有引力定律连接在一起。哈雷保持冷静，用他所有的外交技巧哄骗、奉承、说服和哄骗这位多刺的数学家完成了这本书。最后，牛顿默许并发表了讲话，但对胡克的谢意却微乎其微。\n财务问题的性质完全不同。1685年，皇家学会接管了已故的弗朗西斯·维卢比(Francis Wlughby)由约翰·雷(John Ray)编辑的“双鱼史”(History Oria Piscium)的印刷和出版费用。\n这是一个昂贵的项目，因为这本书包含了大量的盘子，而且这本书在当时是一次失败。这意味着，到了印刷和出版牛顿著作的时候，英国皇家学会实际上已经破产了。这里应该指出的是，对威卢比的书进行的普遍嘲笑是不合理的，因为它几乎阻止了牛顿的杰作出现。“双鱼史”是动物史上的一部重要著作。哈雷再次抢先一步，承担了印刷这些卷的费用；1687年7月5日，哈雷可以写信给牛顿，通知他他的“自然数学哲学原理”的印刷已经完成。", "note_en": "The event that would eventually lead to Isaac Newton writing and publishing his magnum opus, the  Philosophiæ Naturalis Principia Mathematica (the Mathematical Principles of Natural Philosophy), took place in a London coffee house.\n  This is not quite as strange as it might at first appear, shortly after their first appearance in England around 1650 coffee houses became the favourite meeting places of the English scientific intelligentsia, the astronomers, mathematicians and natural philosophers. Here, these savants would meet up to exchange ideas, discuss the latest scientific theories and pose challenges to each other. These institutions also earned the appellation  Penny Universities, as some of those savants, such as William Whiston,  Francis Hauksbee and  Abraham de Moivre, bettered their incomes by holding lectures or demonstrating experiments to willing audiences, who paid the price of a cup of coffee, a penny, for their intellectual entertainment. Later, after he had become Europe’s most famous living natural philosopher, Isaac Newton would come to hold court in a coffee shop, surrounded by his acolytes, the original Newtonians, distributing words of wisdom and handing round his unpublished manuscripts for scrutiny. However, all that still lay in the future.\n One day in January 1684  Christopher Wren, Robert Hooke and Edmond Halley were discussing the actual astronomical theories over a cup of coffee. Wren, today better known as one of England most famous architects, was a leading mathematician and astronomers, who had served both as Gresham and Savilian professor of astronomy. Newton would name him along with John Wallis and William Oughtred as one of the three leading English mathematicians of the seventeenth century.\n  Hooke was at the time considered to be the country’s leading experimental natural philosopher and Halley enjoyed an excellent reputation as a mathematician and astronomer.\n  The topic of discussion was Kepler’s elliptical, heliocentric astronomy and an inverse, squared law of gravity. All three men had arrived separately and independently at an inverse, squared law of gravity probably derived from Huygens’ formula for centrifugal force. Wren posed the question to the other two, whether they could demonstrate that such a law would lead to Kepler’s elliptical planetary orbits.\n Hooke asserted that he already had such a demonstration but he would first reveal it to the others after they had admitted that they couldn’t solve the problem. Wren was sceptical of Hooke’s claim and offered a prize of a book worth forty shillings to the first to produce such a demonstration.  Hooke maintained his claim but didn’t deliver. It is worth noting that Hooke never did deliver such a demonstration. Halley, as already said no mean mathematician, tried and failed to solve the problem.\n In August 1684 Halley was visiting Cambridge and went to see Newton in his chambers in Trinity College, who, as we know, he had met in 1682.\n  According the Newton’s account as told to Abraham DeMoivre, Halley asked Newton, “what he thought the Curve would be that would be described by the Planets supposing the force of attraction towards the Sun to be reciprocal to the square of the distance from it. Sir Isaac replied immediately that it would be an Ellipse…” Here was Newton claiming to know the answer to Wren’s question. Halley asked Newton how he knew it and he replied, “I have calculated it…” Newton acted out the charade of looking for the supposed solution but couldn’t find it. However he promised Halley that he would send him the solution.\n In November Edward Paget, a fellow of Trinity College, brought Halley a nine page thesis entitled  De motu corporum in gyrum ( On the Motion of Bodies in an Orbit).\n  When Halley read Newton’s little booklet he was immediately aware that he held something truly epoch making in the history of astronomy and physics in his hand. Newton had delivered up a mathematical proof that an elliptical orbit would be produced by an inverse square force situated at one of the foci of the ellipse, thus combining the inverse square law of gravity with Kepler’s first law. He went on to also derive Kepler’s second and third laws as well as laying down the beginnings of a mathematical theory of dynamics. Halley reported details of this extraordinary work to the Royal Society on 10 December 1684:\n Mr Halley gave an account, that he had lately seen Mr. Newton at Cambridge, who had shewed him a curious treatise,  De motu: which, upon Mr. Halley’s desire, was he said promised to be sent to the Society to be entered upon their register.\n Mr. Halley was desired to put Mr. Newton in mind of his promise for securing his invention to himself till such time as he could be at leisure to publish it. Mr. Paget was desired to join with Mr. Halley.\n The interest in and the demand to read Newton’s new production was very high but the author decided to improve and rewrite his first offering, triggering one of the most extraordinary episodes in his life.\n Although he was  Lucasian Professor and would turn forty-two on 25 December 1684, Newton remained a largely unknown figure in the intellectual world of the late seventeenth century. Following the minor debacle that resulted from the publication of his work in optics in the 1670s he had withdrawn into his shell, living in isolation within the walls of Cambridge University. He carried out his duties as Lucasian Professor but had almost no students to speak of and definitely no disciples. Thanks to the word of mouth propaganda of people like his predecessor as  Lucasian Professor, Isaac Barrow, and above all the assiduous mathematics groupie,  John Collins, it was rumoured that a mathematical monster slumbered in his chambers in Trinity College but he had done nothing to justify this bruited reputation. His chambers were littered with numerous unfinished scientific manuscripts, mostly mathematical but also natural philosophical and an even larger number of alchemical and theological manuscripts but none of them was in a fit state to publish and Newton showed no indication of putting them into a suitable state. Things now changed, Newton had found his vocation and his muse and the next two and a half years of his life were dedicated to creating the work that would make him into a history of science legend, the reworking of  De motu into his  Principia.\n Over those two and a half years Newton turned his nine-page booklet into a major three-volume work of science. The modern English translation by I B Cohen runs to just over 560 large format pages, although this contains all the additions and alterations made in the second and third editions, so the original would have been somewhat shorter. Halley took over the editorship of the work, copyediting it and seeing it through the press. In 1685 the Royal Society had voted to take over the costs of printing and publishing Newton’s masterpiece, so everything seemed to be going smoothly and then disaster struck twice, firstly in the form of Robert Hooke and secondly in the form of a financial problem.\n Hooke never slow to claim his priority in any matter of scientific discovery or invention stated that he alone had first discovered the inverse square law of gravity and that this fact should, indeed must, be acknowledged in full in the preface to Newton’s book. Halley, realising at once the potential danger of the situation, was the first to write to Newton outlining Hooke’s claim to priority, stating it, of course, as diplomatically as possible. Halley’s diplomacy did not work, Newton went ballistic. At first his reaction was comparatively mild, merely pointing out that he had had the inverse square law well before his exchanges with Hook in 1679 and had, in fact, discussed the matter with Wren in 1677, go ask him, Newton said. Then with more time to think about the matter and building up a head of steam, Newton wrote a new letter to Halley tearing into Hooke and his claim like a rabid dog. All of this ended with Newton declaring that he would no longer write volume three of his work. Halley didn’t know this at the time but this was in fact, as we shall see, the most important part of the entire work in which Newton presented his mathematical model of a Keplerian cosmos held together by the law of gravity. Halley remained calm and used all of his diplomatic skills to coax, flatter, persuade and cajole the prickly mathematician into delivering the book as finished. In the end Newton acquiesced and delivered but acknowledgements to Hooke were keep to a minimum and offered at the lowest level of civility.\n The financial problem was of a completely different nature. In 1685 the Royal Society had taken over the cost of printing and publishing the deceased Francis Willughby’s  Historia piscium as edited by John Ray.\n  This was an expensive project due to the large number plates that the book contained and the book was, at the time, a flop. This meant when it came time to print and publish Newton’s work the Royal Society was effectively bankrupt. One should note here that the popular ridicule poured out over Willughby’s volume, it having almost prevented Newton’s masterpiece appearing, is not justified.  Historia piscium is an important volume in the history of zoology. Halley once again jumped into the breach and took over the costs of printing the volumes; on the  5 July 1687 Halley could write to Newton to inform him that the printing of his  Philosophiæ Naturalis Principia Mathematica had been completed.", "posttime": "2020-07-19 12:48:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "牛顿,eventually", "title": "最终导致牛顿撰写并出版“原理”的事件", "title_en": "The event that eventually led to Newton writing and publishing the Principia", "transed": 1, "url": "https://thonyc.wordpress.com/2020/07/15/the-emergence-of-modern-astronomy-a-complex-mosaic-part-xl/", "via": "", "real_tags": ["牛顿"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012838, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用这本手册从零到科技面试英雄。不需要事先有面试经验。\n没有人有时间练习几百个LeetCode问题。我们会告诉你哪些是最适合练习的问题。\n在面试时，直截了当地说出该做的和该做的。知道了这些，这场战斗已经取得了一半的胜利。\n每个算法主题的实用提示-要注意的常见技术和角落案例。\n看看公司通常会问些什么行为问题，你就可以提前准备好答案。\n为我的第一轮技术面试做准备真的令人望而生畏--我不知道会发生什么，也不知道从哪里开始。这本手册和技术面试手册对我来说是一个很好的起点。它清楚地描述了过程的每一个部分，并且有大量令人敬畏的提示和资源。凭借这本手册和大量的练习，我设法获得了Facebook、Dropbox和亚马逊的报价！&#34；\n在发现这本手册之前，我不知道我的前端面试会有什么期待。多亏了它，我对前端开发有了更好的理解，甚至学到了新的东西。这本手册是一个巨大的资源，我仍然使用它来更新和巩固我的知识，以便自信地应对面试！", "note_en": "Go from zero to tech interview hero with this handbook. No prior interview experience needed.\n No one has time to practice a few hundred LeetCode questions. We tell you which are the best questions to practice.\n Straight-to-the-point Do&#39;s and Don&#39;ts during an interview. Knowing these, the battle is already half won.\n Practical tips for every algorithm topic - common techniques and corner cases to look out for.\n Check out what behavioral questions companies commonly ask and you can prepare your answers ahead of time.\n &#34;Preparing for my first rounds of tech interviews was really daunting - I wasn&#39;t sure what to expect and where to start. This handbook together with the  Tech Interview Handbook was a great starting point for me. It clearly describes each part of the process and has tons of awesome tips and resources. With this handbook and lots of practice, I managed to get offers from Facebook, Dropbox and Amazon!&#34;\n &#34;Before discovering the handbook, I didn&#39;t know what to expect for my front end interviews. Thanks to it, I had a better understanding and even learned new things about frontend development. The handbook is an immense resource, one that I still use to refresh and reinforce my knowledge to tackle interviews confidently!&#34;", "posttime": "2020-07-19 12:48:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面试,interview", "title": "前端面试手册", "title_en": "Front End Interview Handbook", "transed": 1, "url": "https://yangshun.github.io/front-end-interview-handbook/", "via": "", "real_tags": ["面试", "interview"]}, {"category": "", "categoryclass": "", "imagename": "83a0c9e8923d58ca8c83e645b7b90ceb.jpg", "infoid": 1012837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亲爱的格兰特，谢谢你的狂野之旅。爱，流言终结者家族。", "note_en": "Dear Grant, thanks for the wild ride. Love, The MythBusters Family.", "posttime": "2020-07-19 12:47:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "grant,谢谢", "title": "记住格兰特·今原(Grant Imahara)", "title_en": "Remembering Grant Imahara", "transed": 1, "url": "https://www.youtube.com/watch?v=Px_5Z0pPlPc", "via": "", "real_tags": ["grant", "谢谢"]}, {"category": "", "categoryclass": "", "imagename": "abc69c4fef19a7460e5b574a4e264ac6.jpg", "infoid": 1012836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据称，一名十几岁的堡垒之夜粉丝上个月在父母不知情的情况下，在Twitch上花费了近20,000美元的捐款、比特和订阅费。\n这位为了保护儿子身份而不愿透露姓名的母亲告诉Dot eSports，她十几岁的孩子在6月14日至30日期间用借记卡支付了19870.94美元。在几次试图拿回这笔钱的尝试失败后，她转向Reddit寻求建议和它的“集体知识财富”。\n她的帖子在Twitch Subreddit上引起了大量关注，详细描述了“多年储蓄”是如何在17天内消失的。\n她说，这些捐款捐给了Twitch上广受欢迎的流媒体用户，如Tfu，Gorb和Ewoktv，以及亚特兰大猎鹰队的四分卫库尔特·本克特和迈阿密热火的迈尔斯·伦纳德。这位母亲向Dot eSports分享了她的银行对账单的截图，显示有近2万美元的支出和几笔寄给Twitch的大额交易。\n她说：“当我看到银行余额几乎用完时，我的嘴唇开始颤抖，我不得不低下头，这样我就不会晕倒。”“一开始我哭了。我不相信他会这么做。“。\n这位母亲说，儿子拿到了一张名义余额为其购买学校午餐的借记卡。然后，他开始从母亲的账户转账到他的借记卡，通过网上银行支付交易费用。这位母亲认为，她的儿子可能在将钱转入他的账户以成功完成家务时看到了她的密码，或者她没有正确注销。当面对她的儿子时，他知道自己花了很多钱，但当他看到总数时感到“震惊”。\n由于她每月只在支付账单时检查两次账户余额，直到为时已晚，这位母亲才看到交易。\n“我一发现就联系了我的银行，他们冻结了我们所有的账户，他的借记卡也被注销了，”她说。“除非我对我儿子提出指控，否则他们不会有帮助，因为这被认为是善意的欺诈。”\n友好欺诈，或按存储容量使用计费欺诈，是指消费者用自己的信用卡在网上购物，然后向银行要求退款。除非这位母亲提出指控，否则银行无能为力地将资金发回。\n这位母亲说，她一直在努力打通Twitch和亚马逊的电话。她声称Twitch已经两周多没有回复了，亚马逊让她直接联系Twitch。她已经求助于向Twitch首席执行官埃米特·谢尔和亚马逊的法律团队发送挂号信，但声称她还没有收到回复。\n她还联系了这五个彩带，希望能拿回钱。据这位家长说，到目前为止，只有本克特和伦纳德做出了回应。\n她说：“我工作的时间太长了，对他在网上做的事情没有足够的关注。”“他的网络知识绝对超过了我的…。不过，我现在的重点是试图找出他为什么要这么做，这样我就可以确保这是他一生中犯下的一个巨大错误。“", "note_en": "A teenage  Fortnite fan allegedly spent almost $20,000 in Twitch donations, bits, and subscriptions last month without his parents’ knowledge.\n  The mother, who preferred to remain anonymous to protect the identity of her son, told Dot Esports that her teenage child charged $19,870.94 to a debit card between June 14 and 30. After several failed attempts at getting the money back, she turned to Reddit for advice and its “wealth of collective knowledge.”\n Her  post, which garnered a lot of attention on the Twitch subreddit, detailed how “years of savings” disappeared in a matter of 17 days.\n  She says those donations went to popular Twitch streamers like Tfue, Gorb, and Ewokttv, as well as Atlanta Falcons quarterback Kurt Benkert and Miami Heat’s Meyers Leonard. The mother shared a screengrab of her bank statement to Dot Esports, showing close to $20,000 in spending and several large transactions sent to Twitch.\n  “When I saw the bank balances were almost gone, my lips started to tingle and I had to put my head down so I wouldn’t pass out,” she said. “I cried at first. I didn’t believe he could’ve done this.”\n  The son was given a debit card with a nominal balance to buy school lunches, the mother said. He then began transferring money from his mother’s account into his debit card to pay for the transactions through online banking. The mother believes her son might’ve seen her password while transferring money into his account for successfully completing chores, or that she didn’t log out properly. When confronted, her son knew he had spent a lot but was “shocked” when he saw the total.\n Since she only checked her account’s balance twice a month when paying bills, the mother didn’t see the transactions until it was too late.\n  “I contacted my bank as soon as I found out and they froze all of our accounts, and his debit card was canceled,” she said. “Unless I press charges against my son, they will not help as this is considered friendly fraud.”\n Friendly fraud, or chargeback fraud, is when a consumer makes an online purchase with their card and then requests the money back from their bank. The bank can’t help with issuing the funds back unless the mother presses charges.\n The mother said she’s struggled to get through to Twitch and Amazon. She claims Twitch hasn’t responded in over two weeks, and Amazon has told her to contact Twitch directly. She has resorted to sending registered mail to Twitch CEO Emmett Shear and Amazon’s legal team, but claims she hasn’t heard back yet.\n  She also reached out to the five streamers about getting the money back. So far, only Benkert and Leonard have responded, according to the parent.\n  “I work too many hours, and have not paid close enough attention to what he was doing online,” she said. “His internet knowledge has absolutely surpassed mine… My focus now though is trying to figure out why he did it so I can make sure this is the one giant mistake he makes in his life.”", "posttime": "2020-07-19 12:27:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "父母,allegedly,twitch", "title": "据称一名青少年在父母不知情的情况下花费了父母2万美元的钱进行抽搐捐赠", "title_en": "Teenager Allegedly Spends $20,000 Of Parents’ Money On Twitch Donations Without Them Knowing", "transed": 1, "url": "https://dotesports.com/streaming/news/teenager-allegedly-spends-20000-of-parents-money-on-twitch-donations-without-them-knowing", "via": "", "real_tags": ["父母", "allegedly", "twitch"]}, {"category": "", "categoryclass": "", "imagename": "22e2002f2046ed6ed9b8de81ceec31b8.jpg", "infoid": 1012835, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "单字母密码是其中明文的字母基于单个字母表密钥映射到密文字母的任何密码。\n替代密码的工作原理是将明文的每个字母替换为另一个字母。因此，单字母密码也称为简单替换密码。\n它依赖于固定的替换结构，这意味着字母表中的每个字母的替换都是固定的。因此，如果字母“a”被编码为字母“q”，那么每当字母“a”出现在明文中时，它就被替换为字母“q”。\nAtbash密码，其中每个字母都映射到与其围绕字母表中心对称的字母。\n有许多不同的单字母替换密码，实际上是无限多的，因为每个字母都可以加密为任何符号，而不仅仅是另一个字母。\n单字母密码将字母表中的字母混合在一起，并对整个消息保持相同的排列，而多字母密码对同一消息使用多个单字母密码。\n简单地说，多字母密码使用多个不断变化的密文字母表来加密明文，而单字母密码在整个消息中使用单一的方法。\n例如，如果您使用的是Vogen ere磁盘，并且在对消息进行编码时将两个磁盘固定不动，则这是一个单字母密码。\n另一方面，如果您在使用关键字对同一消息进行编码的同时旋转磁盘，那么这就变成了多字母密码。\n所有的单字母密码都可以很容易地用一种名为字母频率分析的解密方法破解，这种方法是由Ibn ad-Duraihim在17世纪发明的。\n这是通过研究密码语言中的文本来实现的，并且可以确定每个字母的出现频率。例如，在英语中，字母“E”是使用频率最高的字母，紧随其后的是字母“T”。\n通过用字母“E”替换密文中最频繁的字母，用字母“T”替换第二频繁的字母，依此类推，您将得到原始的明文。", "note_en": "A monoalphabetic cipher is any cipher in which the letters of the plaintext are mapped to ciphertext letters based on a single alphabet key.\n  Substitution ciphers work by replacing each letter of the plaintext with another letter. For this reason, a monoalphabetic cipher is also called a simple substitution cipher.\n  It relies on a fixed replacement structure, meaning the substitution is fixed for each letter of the alphabet. Thus, if the letter “a” is encoded as letter “Q”, then every time the letter “a” appears in the plaintext, it’s replaced with the letter “Q”.\n    Atbash cipher, where each letter is mapped to the letter symmetric to it about the center of the alphabet.\n  There are many different monoalphabetic substitutions ciphers, actually infinitely many, as each letter can be encrypted to any symbol, not just another letter.\n    A monoalphabetic cipher mixes up letters of the alphabet and keeps that same arrangement for the entire message while a polyalphabetic cipher uses more than one monoalphabetic cipher with the same message.\n  To put it simply, polyalphabetic ciphers utilizes multiple, changing ciphertext alphabets to encrypt the plaintext while monoalphabetic ciphers use a single method throughout the entire message.\n  For example, if you are using a Vigenere disk and you have the two disks stationary while encoding a message, that’s a monoalphabetic cipher.\n  If on the other hand, you rotate the disks while encoding the same message, while using a keyword, then that becomes a polyalphabetic cipher.\n    All monoalphabetic ciphers can be easily broken using a decryption method called letter frequency analysis, which was invented in the 1300s by  Ibn ad-Duraihim.\n  This is done by studying the text in the language of the cipher, and the frequency of each letter can be determined. For example, in the English language, the letter “E” is the most frequent letter, followed by the letter “T”.\n      By substituting the most frequent letter in the ciphertext with the letter “E”, the second most frequent with the letter “T”, and so on, you will end up with the original plaintext.", "posttime": "2020-07-19 12:02:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,字母,cipher", "title": "单字母密码：在线编码和解码", "title_en": "Monoalphabetic Cipher: Encode and Decode Online", "transed": 1, "url": "https://kifanga.com/tools/cipher/monoalphabetic-cipher", "via": "", "real_tags": ["密码", "字母", "cipher"]}, {"category": "", "categoryclass": "", "imagename": "3009650d9474993a4b9dbabf43915b44.jpg", "infoid": 1012834, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们正在接近深度学习的计算极限。这是根据麻省理工学院、麻省理工学院-IBM沃森人工智能实验室、安德伍德国际学院和巴西利亚大学的研究人员得出的结论，他们在最近的一项研究中发现，深度学习的进展一直“强烈依赖”计算机的增加。他们断言，持续的进步将需要“戏剧性地”提高计算效率的深度学习方法，要么是通过改变现有的技术，要么是通过新的尚未发现的方法。\n“我们的研究表明，深度学习并不是偶然造成的计算成本高昂，而是设计出来的。同样的灵活性使它在建模不同的现象和超越专家模型方面表现出色，也使它的计算成本大大增加，“合著者写道。“尽管如此，我们发现深度学习模型的实际计算负担比理论上(已知的)下限增长得更快，这表明可能会有实质性的改进。”\n深度学习是机器学习的一个子领域，研究的是受大脑结构和功能启发的算法。这些被称为人工神经网络的算法由层层排列的功能(神经元)组成，这些功能将信号传递给其他神经元。这些信号是输入数据输入网络的产物，从一层传到另一层，慢慢地“调整”网络，实际上是调整每个连接的突触强度(权重)。该网络最终通过从数据集中提取特征并识别交叉样本趋势来学习进行预测。\n研究人员分析了来自预印服务器Arxiv.org以及其他基准来源的1058篇论文，以了解深度学习性能和计算之间的联系，特别关注图像分类、对象检测、问题回答、命名实体识别和机器翻译等领域。他们对反映两种可用信息的计算需求执行了两个单独的分析：\n每个网络遍的计算量，或给定深度学习模型中单遍(即权重调整)所需的浮点运算数。\n硬件负担，或用于训练模型的硬件的计算能力，计算方法为处理器数量乘以计算速率和时间。(研究人员承认，虽然这是一种不精确的计算方法，但他们分析的论文中对此的报道比其他基准更广泛。)。\n合著者报告说，除了从英语到德语的机器翻译之外，所有基准都具有“高度统计意义”的斜率和“强大的解释力”，后者使用的计算能力几乎没有变化。对象检测、命名实体识别和机器翻译尤其显示出硬件负担的大幅增加，而结果的改善相对较小，在流行的开源ImageNet基准测试中，计算能力解释了图像分类准确率的43%的变化。\n研究人员估计，三年的算法改进相当于计算能力增加了10倍。他们写道：“总的来说，我们的结果清楚地表明，在深度学习的许多领域，训练模式的进展都依赖于计算能力的大幅增加。”“另一种可能性是，获得算法改进本身可能需要计算能力的补充性提高。”\n在研究过程中，研究人员还外推了这些预测，以了解达到各种理论基准所需的计算能力，以及相关的经济和环境成本。即使根据最乐观的计算，降低ImageNet上的图像分类错误率也需要增加105倍的计算。\n一份同步的报告估计，华盛顿大学的格罗弗假新闻侦测模型在大约两周的时间里培训成本为2.5万美元。据报道，OpenAI为培训其GPT-3语言模型筹集了高达1200万美元的资金，谷歌估计花费了6912美元培训BERT，这是一种双向转换器模型，重新定义了11个自然语言处理任务的最先进水平。\n在去年6月的另一份报告中，马萨诸塞大学阿默斯特分校(University Of Massachusetts At Amherst)的研究人员得出结论，训练和搜索某种型号所需的电力涉及大约62.6万磅的二氧化碳排放。这几乎相当于美国汽车寿命排放量的五倍。\n“我们并不预期目标…所暗示的计算要求。硬件、环境和货币成本将是令人望而却步的，“研究人员写道。以经济的方式实现这一点将需要更高效的硬件、更高效的算法或其他改进，以便净影响是如此巨大的收益。\n研究人员指出，在算法层面进行深度学习改进是有历史先例的。他们指出，谷歌张量处理单元、现场可编程门阵列(FPGA)和专用集成电路(ASIC)等硬件加速器的出现，以及试图通过网络压缩和加速技术降低计算复杂性。他们还引用了神经体系结构搜索和元学习，它们使用优化来找到在一类问题上保持良好性能的体系结构，作为获得计算效率改进方法的途径。\n事实上，OpenAI的一项研究表明，自2012年以来，将AI模型训练成与ImageNet中图像分类性能相同的计算量，每16个月就会减少2倍。谷歌的Transformer架构超越了之前最先进的模型--同样由谷歌开发的seq2seq--在引入seq2seq三年后，计算量减少了61倍。DeepMind的AlphaZero系统从无到有地自学了国际象棋、手势和围棋，一年后，与该系统的前身AlphaGoZero的改进版本相匹配，所需的计算量减少了八分之一。\n“深度学习模型所使用的计算能力的爆炸式增长结束了‘AI冬天’，并为计算机在广泛任务上的性能设定了新的标杆。然而，深度学习对计算能力的巨大胃口限制了它在目前形式下提高性能的程度，特别是在硬件性能改进放缓的时代，“研究人员写道。“这些计算限制的可能影响是迫使…。机器学习向着比深度学习更高效的技术发展。“", "note_en": "We’re approaching the computational limits of deep learning. That’s according to researchers at the Massachusetts Institute of Technology, MIT-IBM Watson AI Lab, Underwood International College, and the University of Brasilia, who found in a  recent study that progress in deep learning has been “strongly reliant” on increases in compute. It’s their assertion that continued progress will require “dramatically” more computationally efficient deep learning methods, either through changes to existing techniques or via new as-yet-undiscovered methods.\n “We show deep learning is not computationally expensive by accident, but by design. The same flexibility that makes it excellent at modeling diverse phenomena and outperforming expert models also makes it dramatically more computationally expensive,” the coauthors wrote. “Despite this, we find that the actual computational burden of deep learning models is scaling more rapidly than (known) lower bounds from theory, suggesting that substantial improvements might be possible.”\n  Deep learning is the subfield of machine learning concerned with algorithms inspired by the structure and function of the brain. These algorithms — called artificial neural networks — consist of functions (neurons) arranged in layers that transmit signals to other neurons. The signals, which are the product of input data fed into the network, travel from layer to layer and slowly “tune” the network, in effect adjusting the synaptic strength (weights) of each connection. The network eventually learns to make predictions by extracting features from the data set and identifying cross-sample trends.\n  The researchers analyzed 1,058 papers from the preprint server Arxiv.org as well as other benchmark sources to understand the connection between deep learning performance and computation, paying particular mind to domains including image classification, object detection, question answering, named entity recognition, and machine translation. They performed two separate analyses of computational requirements reflecting the two types of information available:\n Computation per network pass, or the number of floating-point operations required for a single pass (i.e. weight adjustment) in a given deep learning model.\n Hardware burden, or the computational capability of the hardware used to train the model, calculated as the number of processors multiplied by the computation rate and time. (The researchers concede that while it’s an imprecise measure of computation, it was more widely reported in the papers they analyzed than other benchmarks.)\n The coauthors report “highly statistically significant” slopes and “strong explanatory power” for all benchmarks except machine translation from English to German, where there was little variation in the computing power used. Object detection, named-entity recognition, and machine translation in particular showed large increases in hardware burden with relatively small improvements in outcomes, with computational power explaining 43% of the variance in image classification accuracy on the popular open source ImageNet benchmark.\n The researchers estimate that three years of algorithmic improvement is equivalent to a 10 times increase in computing power. “Collectively, our results make it clear that, across many areas of deep learning, progress in training models has depended on large increases in the amount of computing power being used,” they wrote. “Another possibility is that getting algorithmic improvement may itself require complementary increases in computing power.”\n In the course of their research, the researchers also extrapolated the projections to understand the computational power needed to hit various theoretical benchmarks, along with the associated economic and environmental costs. According to even the most optimistic of calculation, reducing the image classification error rate on ImageNet would require 10 5 more computing.\n  To their point, a  Synced report estimated that the University of Washington’s Grover fake news detection model cost $25,000 to train in about two weeks. OpenAI reportedly racked up a whopping $12 million to train its  GPT-3 language model, and Google spent an estimated $6,912 training  BERT, a bidirectional transformer model that redefined the state of the art for 11 natural language processing tasks.\n In a separate report last June, researchers at the University of Massachusetts at Amherst concluded that the amount of power required for training and searching a certain model involves the emissions of roughly 626,000 pounds of carbon dioxide. That’s equivalent to nearly five times the lifetime emissions of the average U.S. car.\n “We do not anticipate that the computational requirements implied by the targets … The hardware, environmental, and monetary costs would be prohibitive,” the researchers wrote. “Hitting this in an economical way will require more efficient hardware, more efficient algorithms, or other improvements such that the net impact is this large a gain.”\n The researchers note there’s historical precedent for deep learning improvements at the algorithmic level. They point to the emergence of hardware accelerators like Google’s tensor processing units, field-programmable gate arrays (FPGAs), and application-specific integrated circuits (ASICs), as well as attempts to reduce computational complexity through network compression and acceleration techniques. They also cite neural architecture search and meta learning, which use optimization to find architectures that retain good performance on a class of problems, as avenues toward computationally efficient methods of improvement.\n Indeed, an OpenAI  study suggests that the amount of compute needed to train an AI model to the same performance on classifying images in ImageNet has been decreasing by a factor of 2 every 16 months since 2012. Google’s  Transformer architecture surpassed a previous state-of-the-art model — seq2seq, which was also developed by Google — with 61 times less compute three years after seq2seq’s introduction. And DeepMind’s  AlphaZero, a system that taught itself from scratch how to master the games of chess, shogi, and Go, took eight times less compute to match an improved version of the system’s predecessor, AlphaGoZero, one year later.\n “The explosion in computing power used for deep learning models has ended the ‘AI winter’ and set new benchmarks for computer performance on a wide range of tasks. However, deep learning’s prodigious appetite for computing power imposes a limit on how far it can improve performance in its current form, particularly in an era when improvements in hardware performance are slowing,” the researchers wrote. “The likely impact of these computational limits is forcing … machine learning towards techniques that are more computationally-efficient than deep learning.”", "posttime": "2020-07-19 12:01:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度学习,研究,researchers,计算", "title": "麻省理工学院的研究人员警告说，深度学习正在接近计算极限。", "title_en": "MIT researchers warn that deep learning is approaching computational limits", "transed": 1, "url": "https://venturebeat.com/2020/07/15/mit-researchers-warn-that-deep-learning-is-approaching-computational-limits/", "via": "", "real_tags": ["深度学习", "研究", "计算"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012830, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Toad.com的约翰·吉尔莫·格努于美国东部标准时间2020年5月23日06：39：25在gmail.com&gt；的泰勒·亚当斯&lt；Coppero1237写道：&gt；&gt；是因为给GCC添加后台是免费的，C已经广为人知，而C已经足够了？Skeeve.com的阿诺德写道：&gt；天鹅座解决方案公司(Hi John！)。跟这件事有很大关系。他们专门将GCC移植到嵌入式系统中使用的不同处理器上，并提供支持。首先要做的是。当弄清楚发生了什么以及什么会成为普遍现象时，重要的是要看看资金流向了哪里。经济学会告诉你一些其他方式学不到的关于系统的东西。第二，在嵌入式市场包括32位处理器之前，GCC在其中默默无闻。32位在嵌入式市场的占有率还不到1%，只占几千美元的市场份额，比如激光打印机(Adobe/AppleLaserWriter)和网络交换机(3Com/Cisco/等)。天鹅座最终得到了许多这样的公司作为支持客户，因为他们很想为每一代新一代硬件平台通过不同的编译器来移植他们的代码。但我们对绝大多数嵌入式市场的可见性为零。我们去那里是因为即使是我们的小众市场也是巨大的，是本地编译器市场的许多倍，客户也更加多样化。早些时候，GCC有一个轻微的优势，因为它是免费的(比如啤酒和语音)，并且有一个由维护员组成的电子邮件社区，所以很多人都开始了到不同体系结构的端口。其中只有几个是生产质量的，但它们每个都提供了至少一个起点，并吸引了感兴趣的用户，他们可能会付钱让我们实现它们。Cygnus能够为每个新架构提供生产编译器，价格远远低于其他为嵌入式系统构建编译器的公司。我认为这更多地与我们的定价策略有关，而不是修改编译器的实际成本。我们的主要竞争对手是六家小的、肥胖的、懒惰的公司，它们对交叉编译器的每个座位收费1万美元，对芯片制造商的最新芯片移植收取100万美元甚至更多的费用。天鹅座向芯片制造商收取50万美元的全新架构费用，每座收取0美元，这导致我们在最初的3到5年里吃掉了竞争对手的午餐。然后我们雇了一个更懂定价的人，把我们自己的端口价格提高到市场承受能力的更大比例，以便在赢得交易的同时获得更好的利润。我们为SPARC建造了第一批64位端口和工具，当时SPARC-64还是个秘密，后来又为其他体系结构建造了。(Sun&39；Shardware Diagnostics Group资助了我们的工作。他们需要能够编译他们的芯片和系统测试，在Sun的编译器团队可以为客户交付64位编译器之前整整一年。)为了使GCC成为一个标准的、有生产价值的编译器所做的很多工作与代码生成几乎没有什么关系。例如，许多客户非常希望在DOS和Windows以及各种UNIX机器上托管交叉编译器，所以我们最终聘请了djgpp的天才DJ Delorie，并将其制成支持商业质量的产品。(我们还聘请了让GCC在旧的MacOS开发环境中运行的人(Stan Shebs)和免费Amiga应用程序的资深开发人员和发行商之一(Fred Fish)。)我们必须极大地改进编译器和工具的测试基础设施。我们设计并构建了DejaGnu(Rob Svoye的工作)，并且随着每个错误报告的出现，我们添加了一个日益严肃的免费C和C++编译器测试套件。我们的构建过程足够自动化，我们可以比较不同主机系统为同一目标平台生成的代码。(可复制构建团队现在正试图为整个Linux分发代码库这样做。)。DejaGnu实际上在具有不同目标架构的多个目标平台上运行我们的测试套件，通过串行端口下载二进制文件并跳转到它们，然后比较测试输出，以便我们可以修复任何与目标相关的差异。我们聘请了全职作家(最初是Roland Pesch，他早年曾是一名认真的程序员)来编写真正的手册和其他文档。我们编写了一个基于电子邮件的错误跟踪系统(PRMS)，也是第一个在互联网上运行的版本控制系统(Remote CVS)。我们的客户都使用不同的对象文件格式，所以我们在汇编器、链接器、大小、nm和ar以及其他工具(例如，我们创建了objdump和objcopy)中编写了新的格式独立性代码(BFD库)。最终，史蒂夫·张伯伦写给我们和GNU一个全新的链接器，它具有构建嵌入式系统二进制文件所需的灵活性，并将代码和数据放在硬件需要它的任何地方。我们学会了如何雇佣和管理远程员工，这意味着我们能够从全国和世界各地聘请才华横溢的GCC和工具黑客，他们抓住机会，将他们心爱的爱好变成了泡影。", "note_en": "John Gilmore  gnu at toad.com    Sat May 23 06:39:25 AEST 2020  Tyler Adams &lt; coppero1237 at gmail.com&gt; wrote:&gt;  &gt; Is it because adding&gt;  &gt; a backend to gcc was free, C was already well known, and C was sufficiently&gt;  &gt; performant? arnold at skeeve.com wrote:&gt;  Cygnus Solutions (Hi John!) had a lot to do with this. They specialized&gt;  in porting GCC to different processors used in embedded systems and&gt;  provided support.First things first. When figuring out what happened and what becamepopular, it&#39;s important to look at where money was flowing. Economicswill tell you things about systems that you can&#39;t learn any other way.Second, until the embedded market included 32-bit processors, gcc wasunknown in it. 32-bit was way less than 1% of the embedded market; onlyin multi-thousand dollar things like laser printers (Adobe/AppleLaserWriter) and network switches (3Com/Cisco/etc). Cygnus ended upwith lots of those companies as support customers, because they weresick of porting their code through a different compiler for each newgeneration of hardware platforms. But we had zero visibility into thevast majority of the embedded market. We went there because even ourtiny niche of it was huge, many times the size of the market for nativecompilers, and with much more diversity of customers.Early on, GCC had the slight advantage that because it was free (as inboth beer and speech) and had an email community of maintainers, manypeople had started ports to different architectures. Only a few ofthose were production-quality, but they each offered at least a startingpoint, and attracted interested users who might pay us to make themreal.Cygnus was able to deliver production compilers for each newarchitecture for significantly less than the other companies buildingcompilers for embedded systems. I think that had more to do with ourpricing strategy than the actual cost of modifying the compiler. Ourmain competitors were half a dozen small, fat, lazy companies whocharged $10,000 PER SEAT for cross-compilers and charged the chipmaker$1,000,000 and frequently more, to do a port to their latest chip.Cygnus charged chipmakers $500K for a brand new architecture, and $0 perseat, which caused us to eat our competitors&#39; lunch over our first 3 to5 years. Then we hired someone who knew more about pricing, and raisedour own port price to a larger fraction of what the market would bear,to get better margins while still winning deals.We built the first 64-bit ports of GCC and the tools, for the SPARC whenSPARC-64 was still secret, and later for other architectures. (Sun&#39;shardware diagnostics group funded our work. They needed to be able tocompile their chip and system tests, a full year before Sun&#39;s compilergroup could deliver 64-bit compilers for customers.)A lot of what got done to make GCC a standard, production worthycompiler had little to do with the code generation. For example, manycustomers really wanted cross-compilers hosted on DOS and Windows, aswell as on various UNIX machines, so we ended up hiring the genius whocreated djgpp, DJ Delorie, and making THAT into a commercial qualitysupported product. (We also hired the guy who made GCC run in the oldMacOS development environment (Stan Shebs) and one of the seniordevelopers and distributors for free Amiga applications (Fred Fish).)We had to vastly improve the testing infrastructure for the compiler andtools. We designed and built DejaGnu (Rob Savoye&#39;s work), and with eachbug report, we added to a growingly serious free C and C++ compiler testsuite. We automated enough of our build process that we could comparethe code produced by different host systems for the same targetplatform. (The &#34;reproducible builds&#34; teams are now trying to do thatfor the whole Linux distribution code base.) DejaGnu actually ran ourtest suite on multiple target platforms with different targetarchitectures, downloading the binaries over serial ports and jumping tothem, and compared the tests&#39; output so we could fix any discrepanciesthat were target-dependent. We hired full-time writers (initiallyRoland Pesch, who had been a serious programmer earlier in life) towrite real manuals and other documentation. We wrote an email-based bugtracking system (PRMS), and the first working over-the-Internet versioncontrol system (remote cvs). Our customers all used different objectfile formats, so we wrote new code for format independence (the BFDlibrary) in the assembler, linker, size, nm and ar and other tools(e.g. we created objdump and objcopy). Ultimately Steve Chamberlainwrote us and GNU a brand-new linker which had the flexibility needed forbuilding embedded system binaries and putting code and data wherever thehardware needed it to go.We learned how to hire and manage remote employees, which meant we wereable to hire talented gcc and tools hackers from around the country andthe world, who jumped at the chance to turn their beloved hobby into afull-time paying gig. We started our own ISP in order to get ourselvesgood, cheap commercial quality Internet access, and so we could teachour remote employees how to buy and install solid 56kbit/sec Frame Relayconnections rather than flaky dialup access.And because we didn&#39;t control the master source code for gcc, one of oursenior compiler hackers, Jim Wilson, spent a huge fraction of his timemerging our changes upstream into FSF GCC, and merging their changesdownstream into our product, keeping the ecosystem in sync. We handledthat overhead for significant other tools by taking up the whole work ofmaintenance and release engineering -- for example, I became FSF&#39;smaintainer for gdb. I would make an FSF GDB release two weeks beforeCygnus would make its own integrated toolchain releases. If bug reportsdidn&#39;t start streaming in within days from the free software community,we knew we had made a solid release; and we had time to patch anythingthat turned up, before our customers got it from us on cartridge tapes.It wasn&#39;t just a compiler, it was a whole ecosystem that had to be builtor improved. About half of our employees were software engineers, so bythe time our revenues grew from &lt;$1M/year to $25M a year, we werespending about $12M every year improving the free software ecosystem.And because we avoided venture capital for six years, and shared thestock ownership widely among the employees, when we got lucky after 10years and were acquired by the second free software company to go public(the first was VA Linux, the second Red Hat), all those hackers becamemillionaires. A case of doing well by doing good.\tJohn", "posttime": "2020-07-19 11:18:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "天鹅座,gilmore,编译器", "title": "约翰·吉尔摩：天鹅座成长史", "title_en": "John Gilmore: History of Cygnus's Growth", "transed": 1, "url": "https://minnie.tuhs.org/pipermail/tuhs/2020-May/021225.html", "via": "", "real_tags": ["天鹅座", "gilmore", "编译器"]}]