[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073442, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我听到的关于性高潮的最常见的哀叹之一。老实说，这并不难理解。\n在一个大多数商业活动都是通过书面交流进行的时代，大多数面试实践都围绕着口头交流，而且往往倾向于口头上有魅力的人。\n我们知道有些人是更好的书面沟通者，而不是口头沟通者。我们当然知道，强大的书面沟通者更有可能在任何远程环境中茁壮成长。然而，我们的采访框架从未改变。尽管我们的工作方式不断发展，但我们用来评估和评估人们的做法基本上保持不变。\n这导致组织的书面文化较差，高度依赖面对面的会议，更容易受到短暂文化的影响，而不是记忆性文件。\n这里是我&#39；我记下了一些想法和启发，我&#39；我多年来发现，这可以帮助你在聘用应聘者担任远程职位之前评估他们的书面沟通水平。\n评价某人&#39；如果你有书面沟通技巧，而且似乎适合远程职位，你需要有一些数据点。要做到这一点，你需要一种系统的方法来收集这些数据。\n你可以&#39；我不明白一个人是否只是在简历、技能和第一印象方面有很好的书面沟通能力。尽管听起来很俗气，但最好的代理指标是以前在分布式工作环境中的工作经验。\n是否为&#39；这是在远程第一公司的第一手经验，对开源项目有显著贡献，或积极参与分散的项目，它没有&#39；没关系。任何证明候选人在分散的团队中做了一些工作的东西通常都是一个很好的预测因素。\n然后，你可以询问他们是否可以展示一份随机的内部文档。这取决于角色。例如，工程师可能会向RFC、产品经理汇报团队的一些报告或状态更新&#39；一位设计师提出了功能提案的大纲。\n如果内容包含合理的数据，你总是要求他们去掉参考资料、姓名或数字。\n求职信可能是你要处理的第一个客观数据点。如果在申请远程职位的过程中，您&#39；我们还没有要求一封求职信或某种形式的&#34；你为什么想在这里工作&#34;, 我强烈邀请你们这样做。\n在你的申请表中，你应该要求他们填写任何形式的长表格&#39；d发表在互联网上。这可以是任何东西：博客、采访、个人通讯，甚至推特。\n它没有&#39；内容并不重要，因为所有你&#39；我们要做的是看看他们如何以书面形式表达自己的想法。\n惯例是，如果候选人有希望并通过初步筛选，你就给他们分配一个带回家的任务。\n大多数人只关注结果。任务是否成功完成？是或否？在最后期限内——是还是不是？\n但是如果你&#39；重建远程团队时，你必须专注于整个协作和协调体验。\n事实上，你的主要目标不是看他们是否&#39；我们能够完成任务（尽管这是一个重要的部分），但要看看他们在模拟工作环境中的表现。\n他们卡住了吗？他们是如何与团队沟通的？他们走上正轨了吗？在取得进步的同时，他们是否让他人能够清楚地看到自己的工作？他们是否在前进中分享想法和建议？\n不管带回家作业的性质如何，其目的是模拟实际工作环境，以便获得最准确的信号。\n有多种方法可以促进这一过程。创建一个专用的空闲通道（用于处理同步），脉冲上的专用流（用于处理异步）通常使用。\n如果你&#39；我已经完成了以上所有工作，你&#39；现在你有足够的数据来处理候选人。现在的问题是——你如何实际评估它们？\n以下是我用来评价一个人的三件事#39；他在远程采访中的写作技巧。\n大多数人可以&#39；写得不好不是因为他们的语言语域，而是因为他们没有&#39；我不知道如何控制他们表达想法的逻辑顺序。\n你知道的&#39；当句子和段落之间的关系遵循为什么/如何对话的结构时，这是一个清晰的逻辑顺序。\n一个优秀的书面沟通者会以归纳的方式提出和回答问题，直到他判断你（读者）将不再有逻辑问题要跟进为止。反之亦然，一个糟糕的沟通者会演绎地构建他的论点，迫使你被动地得出他的确切结论。\n让我在实践中向你们展示这一点，首先是一个简化的例子，然后是一个真实的例子。\n在归纳示例中，思想的层次结构变得更加明确，几乎就像虚构的问答对话。\n现在是真正的：马克·扎克伯格和首席财务官大卫·埃伯斯曼之间的电子邮件交流。扎克伯格正在询问埃伯斯曼，收购Instagram或Path等社交媒体平台是否是个好主意。\n大卫从他的推理要点开始。从这里开始，每一个句子都对前一个问题提出的“为什么”或“如何”做出回应。到了不再有问题的地步。\n什么&#39；大卫在这里真正做的是复制扎克&#39；他用自己的大脑思考。而他&#39；在这样做的时候，他会以一种合乎逻辑、有意义的方式建立信息——不是对他自己，而是对扎克。\n你是否曾经与其他人会面，认为你得出了一个共同的结论和一些明确的下一步，但后来却发现你们都带着完全不同的理解离开了？\n我们都有自己独特的方式来解释发生在我们周围的事件。在你的写作中，承认这种动态是至关重要的，以确保你的读者都是从相同的基线和相同的语境开始的。\n作为学生，我们&#39；我都接受过写作训练，为那些付钱阅读我们写的东西的人写作。我们中的大多数人至少有10年的经验，为那些被奖励去关心的人写东西。\n在现实生活中，情况大不相同。人们的注意力持续时间很短，最重要的是，他们没有&#39；我不在乎你说什么。你&#39；重新写作以换取时间和/或金钱，你不仅要意识到自己的价值&#39；我们给予，但也给予&#34；如何&#34；你&#39；我们正在传递它。\n清晰的逻辑顺序和强调的写作不是&#39；不足以培养你的读者&#39；请注意。好的写作能让读者积极参与持续的紧张和刺激。\n现在仔细看看他在前几段中使用的所有紧张词&#34;但是&#34&#34;分开长大&#34&#34;濒死体验&#34&#34;不要&#34&#34;但事实上&#34&#34;事实正好相反&#34&#34;不&#34；甚至讽刺的是&#34；打开&#34；，这些都是为了制造紧张气氛，以某种方式破坏读者的稳定。\n下次你读（写）东西时，试着圈出你能找到的所有紧张的词。如果你没有&#39；我看不到太多，多加一点就行了。\n大多数人建议作者保持句子简短，避免被动语态，少用逗号/多用句号，避免使用首字母缩写词，等等。\n这些并不是天生的坏建议，但有&#39；It’长句和被动语态没什么错。\n它&#39；这是一种文体选择，一些作家会争辩说，这甚至是一个好的选择。\n没有人会热心阅读你的留言。许多人会发现缺乏正确的格式令人恼火。但它&#39；这是你最后的问题，也是最容易解决的问题。\n显然，语法是所有写作的一个基本方面，但是如果你&#39；重新招聘不符合&#39的职位；如果你不需要完美的书面英语或母语人士，那么它&#39；这可能是一个你可以忽略的问题，只要候选人正确地把握了关键部分。\n在&#34中隐藏的假设之一；雇佣写得好的人&#34；写得好的人也可能有很高的阅读理解能力。反之亦然，那些想快速接听电话而不是写下请求的人，与那些似乎不&#39；不要读另一个&#39；这是人的文件。\n快速阅读和处理文档、计划、日程安排、日历、议程、会议记录和备忘录的能力是您在远程环境中表现出色的方式。每天20分钟，你就可以拥有整个组织；s&#34；州&#34；在你的脑海中塑造。\n在雇用某人之前，考虑一下你是否愿意在公司里拥有10倍于他们的人。因为他们会按照自己的模式雇佣员工。\n它&#39；这是真的。人们雇佣志同道合的人。你最初的几次雇佣将对公司其他部门产生更大的影响。\n如果你&#39；重建远程团队寻找优秀的书面沟通者，因为他们会为你寻找合适的人，这将是每个人都需要清除的障碍。", "note_en": "This is one of the most frequent lament I hear about orgs. And, to be honest, it’s not even that hard to understand why.\n In an age where most business happens via written communication, most interview practices revolve around verbal communication and tend to favor the verbally charismatic.\n We know that some people are better written communicators than verbal. And we certainly know that strong written communicators are more likely to thrive in any remote setting. Yet, our interview frameworks never changed. Even though the way we work has continually evolved, the practices that we use to assess and evaluate people have stayed largely the same.\n This creates organizations with a poor written culture, highly dependant on face-to-face meetings, and more vulnerable to a culture of ephemerality over memorialized documentation.\n Here I&#39;ve jotted down some ideas and heuristics that I&#39;ve found over the years and that can help you assess the written communication level of a candidate before you hire them for a remote position.\n  To evaluate someone&#39;s written communication skills, and the plausible fit for a remote position, you need to have some data points. And to do that you need a systematic way to gather those data.\n   You can&#39;t understand if someone is a good written communicator on CVs, skills, and first impressions only. As cheesy as it sounds, the best proxy-metric is previous work experience in a distributed work environment.\n Whether it&#39;s a first-hand experience in a remote-first company, notable contributions to open-source projects, or active participation in decentralized projects, it doesn&#39;t really matter. Whatever demonstrates that the candidate did some work on a decentralized team is typically a good predictor.\n You can then ask if they could show a random internal document that they worked on. This depends on the role. For example, an engineer might have an RFC, a product manager some reports or status updates on the team&#39;s progress, and a designer the outline of feature proposal.\n If the content includes sensible data you always ask them to strip-out references, names, or numbers.\n  The cover letter is likely to be your first objective data point to process. If in your application process for a remote position, you&#39;re not yet asking for a cover letter or some sort of &#34;Why you want to work here?&#34;, I strongly invite you to do so.\n  In your application form, you should ask for any kind of long-form writing they&#39;d published on the internet. This can be anything: blogs, interviews, personal newsletters, or even tweets.\n It doesn&#39;t really matter the content because all you&#39;re trying to do is to see how they express their ideas in a written format.\n  The convention is that if the candidate is promising and passes the initial screening you assign them a take-home assignment.\n Most people focus solely on the result. Was the assignment successfully completed - yes or no? Within the deadline - yes or no?\n But if you&#39;re building a remote team you have to focus on the entire collaboration and coordination experience.\n In fact, your primary goal is not to see if they&#39;re able to complete the assignment (although that&#39;s an important part) but to look at how they behave in a simulated working environment.\n Are they stuck? How are they communicating that to the team? Are they on track? Are they making their work legible to others while they make progress? Are they sharing ideas and proposals as they move forward?\n Regardless of the nature of the take-home assignment, the idea is to mimic the actual work environment so that you can get the most accurate signals.\n There are multiple ways to facilitate this process. Create a private Slack channel (to handle sync) and a  private Stream on Pulse ( to handle async) is the one that typically use.\n  If you&#39;ve done all the above, you&#39;re at a point where you have enough data to process on the candidate. Now the question is – how do you actually evaluate them?\n Here are the 3 things I look for to evaluate someone&#39;s writing skills in remote interviews.\n   Most people can&#39;t write well not because of their linguistic register but because they don&#39;t know how to control the logical sequence in which they present their ideas.\n You know it&#39;s a clear logical sequence when the relationship between the sentences and the paragraphs follow the structure of a why/how dialogue.\n A great written communicator will  inductively raise and answer questions until he reaches a point at which he judges that you (the reader) will have no more logical questions to follow up with. Vice versa, a bad communicator will  deductively construct his arguments forcing you to passively reach out his exact conclusions.\n Let me show you this in practice, first with a simplified example, then with a real one.\n   In the inductive example, the hierarchy of thoughts becomes more explicit almost like fictitious question-answer dialogue.\n And now the real one: an exchange of emails between Mark Zuckerberg and CFO David Ebersman. Zuckerberg is asking Ebersman if acquiring ramping social media platforms like Instagram or Path is a good idea.\n      David starts with the gist of his reasoning. From there every sentence responds to the why or how question raised by the previous one. To the point where there are simply no more questions left.\n What&#39;s David is really doing here, is reproducing Zuck&#39;s thinking process using his own brain. And while he&#39;s doing that, he builds up information in a way that feels logical and makes sense – not really to himself – but to Zuck.\n  Have you ever been in a meeting with other people, thought you reached a shared conclusion and some clear next steps, only to find later that all of you left with a completely different understanding?\n We all have our own unique way of interpreting the events taking place around us. Acknowledging this dynamic is critical in your writing to ensure your readers are all starting from the same baseline with the same context.\n  As students, we&#39;ve all been trained to write for people that were paid to read the stuff that we wrote. Most of us have at least 10 years of experience in writing things for people that were rewarded to care.\n In real life, things work much differently. People have short attention spans and - above all - they don&#39;t care about what you say. You&#39;re writing in exchange for time and/or money and you have to be conscious not just about the value you&#39;re giving but also about &#34;how&#34; you&#39;re delivering it.\n Clear logic sequence and emphatic writing aren&#39;t enough to build up your reader&#39;s attention. Good writing keeps the readers actively engaged with continuous tension and stimuli.\n   Now pay a closer look at all the tension words he uses just in the first few paragraphs. &#34;But&#34;, &#34;grown apart&#34;, &#34;near death experience&#34;, &#34;do not&#34;, &#34;but in fact&#34;, &#34;the opposite is true&#34;, &#34;does not&#34; and even the ironic &#34;Open&#34;, are all there to create tension and somehow destabilize the reader.\n  Next time you read (or write) something, try to circle all the tension words you can find. And if you don&#39;t see many, just add more of them.\n   Most people advise writers to keep sentences short, avoid passive voice, use fewer commas/more periods, avoid acronyms, etc.\n These are not inherently bad advice, but there&#39;s nothing wrong with long sentences and passive voice.\n It&#39;s a stylistic choice, and  some writers would have argued - that it was even a good one.\n  Nobody will ever be enthusiastic to read your wall text. And many will find annoying the lack of proper formatting. But it&#39;s the last of your problems and the easiest thing to fix.\n  Obviously, grammar is a fundamental aspect of all writing, but if you&#39;re hiring for positions that don&#39;t require perfect written English or a native person, then it&#39;s probably something that you can overlook as long as the candidate gets the hard parts right.\n  One of the hidden assumptions in &#34;hire people that write well&#34; is that people who write well would also likely have high reading comprehension skills. Vice versa, the ones who want to jump on a quick call instead of writing out their requests are the same who seemingly don&#39;t read the other&#39;s people documents.\n The ability to quickly read and process docs, plans, schedules, calendars, agendas, minutes, and memos is how you excel in remote environments. With 20 minutes per day, you can have the entire organization&#39;s &#34;state&#34; modeled in your head.\n   Before hiring someone, consider whether you’d like to have 10 times as many people like them in your company. Because they will hire people in their mold.\n It&#39;s true. People hire like-minded people. Your first few hires are going to have a much greater impact on the rest of your company.\n If you&#39;re building out a remote team look for strong written communicators because they will seek out the right people for you and that will be the bar everyone needs to clear.", "posttime": "2022-02-15 14:16:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "员工,remote,是否", "title": "雇佣写得好的远程员工（以及如何做到）", "title_en": "Hire remote employees that write well (and how to do it)", "transed": 1, "url": "https://pulseasync.com/blog/hire-remote-employees-that-write-well/", "via": "", "real_tags": ["员工", "remote", "是否"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073441, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "文件显示，DoorDash Inc.将提高麦当劳（McDonald’s Corp.）餐厅的费用，以提高效率，减少损失。麦当劳（McDonald’s Corp.）的餐厅准备订单的速度较慢。\n根据《华尔街日报》看到的摘要，这家快递服务公司同意降低麦当劳美国餐厅的基本佣金率。该公司通过向餐厅收取每份订单的佣金，并分别向消费者收取服务费来赚钱。文件显示，DoorDash将从明年开始向麦当劳餐厅收取更高的佣金，因为订单会让送货司机久等。\n《华尔街日报》将向您收取$+税（如果适用）。您可以随时在客户中心或致电客户服务部更改账单偏好。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客服取消订阅。", "note_en": "DoorDash Inc. will raise its fees on McDonald’s Corp. restaurants that are slow to prepare orders, documents show, in an effort by the delivery company to improve efficiency and cut losses.\n  The delivery service, which earns money by charging restaurants a commission on every order and separately charging consumers a service fee, agreed to lower its base commission rate for McDonald’s U.S. restaurants, according to summaries seen by The Wall Street Journal. DoorDash will charge higher commissions to McDonald’s restaurants starting next year for orders that keep a delivery driver waiting, the documents show.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-02-15 14:15:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "doordash,bump,餐厅", "title": "DoorDash将提高慢节奏麦当劳餐厅的费用", "title_en": "DoorDash to Bump Up Its Fees on Slow McDonald’s Restaurants", "transed": 1, "url": "https://www.wsj.com/articles/doordash-to-bump-up-its-fees-on-slow-mcdonalds-restaurants-11644834602", "via": "", "real_tags": ["doordash", "bump", "餐厅"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我担任国家心理健康研究所（NIMH）主任的最后一年里，我在俄勒冈州向一屋子的心理健康倡导者做报告，他们大多是患有严重心理疾病的年轻人的家庭成员。在我担任“国家精神病医生”期间，我监督了200多亿美元的心理健康研究，我渴望分享该机构科学成功的证据。\n我点击了我的标准PowerPoint幻灯片，其中包括抑郁症患者大脑变化的高分辨率扫描，精神分裂症儿童的干细胞显示神经元异常分支，以及作为实验室小鼠应激标记的表观遗传学变化。我们学到了很多！我们取得了很大的进步！\n虽然我能看到前排有人点头，但房间后面一个穿着法兰绒衬衫、留着胡子的高个子男人显得越来越激动。当Q&amp；一段时间开始，他跳到麦克风前。“你真的不明白，”他说。“我23岁的儿子患有精神分裂症。他已经住院五次，尝试过三次自杀，现在他无家可归。我们的房子着火了，你在谈论油漆的化学成分。”当我站在那里有些目瞪口呆时，他问道：“你在做什么来扑灭这场火？”\n我的即时反应是防御性的：“科学是一场马拉松，而不是冲刺。”“我们需要了解更多，才能做得更好。”“要有耐心，革命需要时间。”但我知道他是对的。我所做的支持杰出科学家和敬业的临床医生的工作与1400多万美国人面临的挑战之间存在着脱节，这些美国人都患有严重的精神疾病，生死攸关。\n我们这一领域的科学进展令人震惊，但当我们研究自杀的危险因素时，死亡率却上升了33%。虽然我们确定了成瘾的神经解剖学特征，但过量用药导致的死亡增加了三倍。虽然我们绘制了精神分裂症的基因图谱，但患有精神分裂症的人仍然长期失业，提前20年死亡。我们的科学在寻找病因的同时，这些疾病的影响正在演变为更多的死亡和残疾、监禁和无家可归，以及患者和家属越来越沮丧和绝望。事实上，十年来许多最棘手的社会问题——无家可归、监禁、贫困——在一定程度上可以追溯到我们国家未能照顾精神病患者。\n2015年，我离开了NIMH。虽然我接受过精神病医生和神经科学家的培训，但作为一名寻求解决方案的记者，我想探索科学进步和公共卫生影响之间的差距。在过去五年里，我遇到了美国和国外的医疗创新人士、社会企业家和技术专家，他们分享了可以为精神疾病患者带来改变的想法和项目。我从头到尾都听到了这样的反复：我们确实处于一个危机——一个关心的危机。精神疾病不同于其他疾病，我们目前的做法在许多方面都是一场灾难。精神卫生保健不仅没有有效地提供，而且在危机期间也可以获得，战略上只侧重于缓解症状，而不是帮助人们康复。\n在我的旅行中，我还听到了关于治愈的反复叙述：目前的治疗有效；精神疾病不是无期徒刑；人们可以康复。我目睹了一些项目、从业者和个人致力于康复，这不仅仅是症状的减轻；这是对充实而有意义生活的回归。或者，正如一位在洛杉矶贫民区工作的非常明智的精神科医生为我定义的恢复，“人、地方和目的。”换句话说，寻找支持的人，有一个地方或庇护所来治疗，并发现一个目的或使命。\n在比较罗杰和布兰登这两个年轻人的轨迹时，我最明显地看到了他们的康复。罗杰是一名编码天才，他与偏执狂和阴谋论作斗争，这消耗了他紧密团结、关爱的家庭。罗杰的父母遇到了一个噩梦般的场景，经常描述精神分裂症的弧线：在当地急诊室待上几天，在当地监狱多次巡视，以及长时间的无家可归。就像俄勒冈州沮丧的父亲一样，罗杰的父母也在想，为什么在心理健康科学取得如此多进步的情况下，他们聪明的儿子却在用声音说话，用垃圾桶吃饭。\n布兰登和罗杰一样，都患有精神病。但在多次服用药物并因精神分裂症住院治疗后，布兰登开始了一项扩展性的长期计划，该计划在易受伤害的各个领域提供支持：幻觉药物治疗、无序思维的实验性计算机训练计划、社交技能辅导、工作支持、弹吉他、，还有冥想。\n布兰登的康复没有一把钥匙。这在很大程度上取决于三个P。20多年后，布兰登再也没有精神病发作。他认为是精神分裂症导致的干扰性思维仍然在困扰着他，但它们并没有占据主导地位。他已婚，担任一家倡导脑健康研究的非营利组织的总裁，并作为严重精神疾病患者的发言人周游全国。\n罗杰和布兰登都被诊断患有脑部疾病，并接受了标准的医疗护理：抗精神病药物治疗。但罗杰的结果是一个太常见的例子，说明当治疗只是医学上的。对于精神分裂症等严重的精神疾病，药物治疗几乎总是必要的，但很少是足够的。如果治疗计划中没有人、地点和目的，布兰登可能会过上与罗杰相似的生活。\n美国目前还没有一个能够帮助美国人康复的体系。超过一半的美国县没有精神科医生。近一半的精神科医生不接受公共或私人保险。如果你有一个孩子需要接受精神病住院治疗，你可能需要注意身体状况。正如前马萨诸塞州心理健康专员告诉我的那样，“让你的孩子进入哈佛医学院比在州立医院找到精神病床更容易。”更复杂的准入问题是强大的歧视力量，这些力量已将精神疾病定为犯罪。因此，我们的监狱和监狱已成为事实上的精神病院，剩下的几家公立精神病院基本上被用作法医病人的监狱。\n在这幅反乌托邦的画卷中，隐藏着一个非同寻常且被忽视的亮点。对于几乎所有的精神障碍，我们都有有效的治疗方法。药物治疗、心理治疗和康复干预（例如，支持性就业）无疑是有益的，与其他慢性疾病的治疗相比较或更好。然而，要使治疗有效，就必须结合大多数人没有得到的那种全面和持续的护理。患者还必须配合正确的治疗，这可能需要时间和实验。对治疗持消极态度的人会阻止许多人寻求帮助或在危机之外寻求帮助。\n如果我要重新制作我在NIMH的角色中曾经展示过的幻灯片，我仍然会专注于科学和创新的前景。研究是我们获得更好护理的最大希望。但我也必须用流行病学的观点来缓和这种热情：医疗保健本身只解释了健康结果的一小部分。我们取得更好结果所需的很多东西都是基础性的，但它不是医疗保健的一部分。社会因素（你的邮政编码，而不是你的基因编码）、生活方式（你的生活方式，而不是你服用了多少药物）和生计（你的工作，而不仅仅是你的财富）对健康结果的影响要比你的具体诊断或医疗保健计划重要得多。恢复取决于三个P。但这些对恢复至关重要的因素通常不由医疗保险支付，通常不作为护理的一部分提供。为了弥合科学进步和公共卫生影响之间的差距，我们需要重新定义我们所说的护理。\n患有精神疾病的人很容易被忽视，直到“他们”成为所爱的人、邻居、同事。但是我有条件地使用他们这个代词，因为在美国只有两种家庭：一种是与精神疾病作斗争的家庭，另一种是尚未与精神疾病作斗争的家庭。为了确保我们更好地为所有家庭服务，我们不一定需要了解更多才能做得更好。我们只需要找到意愿和方式来交付人员、地点和目标。", "note_en": "During my last year as director of the National Institute of Mental Health (NIMH), I was in Oregon, giving a presentation to a roomful of mental-health advocates, mostly family members of young people with a serious mental illness. During my tenure as the “nation’s psychiatrist,” the nickname for my role, I oversaw more than $20 billion for mental-health research, and I was eager to share evidence of the agency’s scientific success.\n I clicked through my standard PowerPoint deck featuring high-resolution scans of brain changes in people with depression, stem cells from children with schizophrenia showing abnormal branching of neurons, and epigenetic changes as markers of stress in laboratory mice. We had learned so much! We were making so much progress!\n  While I could see heads nodding in the front row, a tall, bearded man in the back of the room wearing a flannel shirt appeared more and more agitated. When the Q&amp;A period began, he jumped to the microphone. “You really don’t get it,” he said. “My 23-year-old son has schizophrenia. He has been hospitalized five times, made three suicide attempts, and now he is homeless. Our house is on fire and you are talking about the chemistry of the paint.” As I stood there somewhat dumbstruck, he asked, “What are you doing to put out this fire?”\n My immediate responses were defensive: “Science is a marathon, not a sprint.” “We need to know more before we can do better.” “Be patient; revolutions take time.” But I knew he was right. There was a disconnect between the work that I was doing supporting brilliant scientists and dedicated clinicians and the challenges that faced more than 14 million Americans living, and dying, with serious mental illness.\n The scientific progress in our field  was stunning, but while we studied the risk factors for suicide, the death rate had climbed 33 percent. While we identified the neuroanatomy of addiction, overdose deaths had increased threefold. While we mapped the genes for schizophrenia, people with the disease were still chronically unemployed and dying 20 years early. Our science was looking for causes while the effects of these disorders were playing out with more death and disability, incarceration, and homelessness, and increasing frustration and despair for both patients and families. Indeed, many of the most refractory social issues of the decade—homelessness, incarceration, poverty—could be tracked, in part, to our nation’s failure to care for people with mental illness.\n  In 2015, I left the NIMH. Although I had trained as a psychiatrist and neuroscientist, I wanted to explore this gap between scientific progress and public-health impact as a journalist in search of solutions. Over the past five years, I’ve met health-care innovators, social entrepreneurs, and technology experts in the United States and abroad who shared ideas and projects that can make a difference for people with mental illness. I heard this refrain throughout: We are indeed in a crisis—a crisis of care. Mental illnesses are different from other illnesses, and our current approach is a disaster on many fronts. Mental-health care is not only delivered ineffectively but also accessed during a crisis and strategically focused only on relieving symptoms and not on helping people recover.\n During my travels, I also heard a recurring narrative of healing: Current treatments work; mental illness is not a life sentence; people can recover. I witnessed programs, practitioners, and individuals working toward recovery, which is more than just a reduction in symptoms; it’s a return to a full and meaningful life. Or, as a very wise psychiatrist working in Los Angeles’s Skid Row defined recovery for me, “people, place, and purpose.” In other words, finding people for support, having a place or sanctuary to heal, and discovering a purpose or mission.\n Recovery was most apparent to me when comparing the trajectories of two young men: Roger and Brandon. Roger, a coding prodigy, struggled with paranoia and conspiracy theories, which consumed his tight-knit, caring family. Roger’s parents ran into a nightmare scenario that too often describes the arc of schizophrenia: days in the local emergency room, multiple tours in the local jail, and long stretches of homelessness. Like the frustrated father in Oregon, Roger’s parents wondered why, with so many advances in the science of mental health, their brilliant son was talking to voices and eating out of garbage cans.\n Brandon, like Roger, struggled with psychosis. But after multiple medications and hospitalizations for schizophrenia, Brandon embarked on an expansive, long-term plan that provided support in every area of vulnerability: medication for his delusions, an experimental computer-based training program for his disorganized thinking, coaching for social skills, support for work, playing guitar, and meditation.\n There was not a single key to Brandon’s recovery. It depended heavily on the three P’s. More than two decades later, Brandon has had no further bouts of psychosis. Distracting intrusive thoughts, which he attributes to schizophrenia, still nag at him, but they do not take over. He is married, serves as the president of a nonprofit that advocates for brain-health research, and travels the country as a spokesperson for people with serious mental illness.\n Both Roger and Brandon were diagnosed with a brain disorder and received standard medical care: antipsychotic medication. But Roger’s outcome is the too-common example of what happens when treatment is only medical. For a serious mental illness such as schizophrenia, medication is almost always necessary but rarely sufficient. Without people, place, and purpose in the treatment plan, Brandon may have ended up with a life similar to Roger’s.\n The U.S. does not currently have a system that can help Americans heal and recover.  More than half of U.S. counties have no psychiatrist.  Nearly half of psychiatrists do not accept either public or private insurance. If you have a child who needs psychiatric hospitalization, you may need to look out of state. As a former Massachusetts mental-health commissioner told me, “It’s easier to get your kid into Harvard Medical School than find a psychiatric bed in a state hospital.” Compounding problems of access are powerful forces of discrimination, which have criminalized mental illness. As a result, our jails and prisons have become de facto mental hospitals and our few remaining public mental hospitals are essentially used as prisons for forensic patients.\n Hidden in this dystopian picture is an extraordinary and overlooked bright spot. For virtually all mental disorders, we have effective treatments. Medications, psychological treatments, and rehabilitative interventions (for example, supportive employment) are unequivocally helpful, on par with or better than treatments for other chronic medical conditions. Yet for treatments to be effective, they must be combined with the kind of comprehensive and continuous care that most people don’t receive. Patients must also be matched with the right treatment, which can take time and experimentation. And negative attitudes toward treatment prevent many people who would benefit from seeking help—or from doing so outside of a crisis.\n  If I were to re-create that same PowerPoint deck I once showed in my role at NIMH, I would still focus on the promise of science and innovation. Research is our best hope for better care. But I would also have to temper this enthusiasm with an insight from epidemiology: Health care itself explains only a small fraction of health outcomes. Much of what we need for better outcomes is fundamental, but it is not part of health care. Social factors (your zip code, not your genetic code), lifestyle (how you live, not how many medications you take), and livelihood (your work, not just your wealth) are much more important for health outcomes than your specific diagnosis or health-care plan. Recovery depends on the three P’s. But these factors, crucial for recovery, are often not paid for by health insurance and are usually not offered as part of care. To close that gap between scientific progress and public-health impact, we need to reframe what we mean by  care.\n People with mental illness are easy to ignore until “they” become a loved one, a neighbor, a co-worker. But I use the pronoun  they conditionally, for there are only two kinds of families in America: those who are struggling with mental illness and those who are not struggling with mental illness  yet. To ensure that we serve all families well, we don’t necessarily need to know more to do better. We simply need to find the will and way to deliver people, place, and purpose.", "posttime": "2022-02-15 14:12:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,精神,mental,治疗", "title": "美国精神卫生保健缺失了什么", "title_en": "What American Mental Health Care Is Missing", "transed": 1, "url": "https://www.theatlantic.com/ideas/archive/2022/02/american-mental-health-crisis-healing/622052/", "via": "", "real_tags": ["美国", "精神", "mental", "治疗"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两名美国参议员已要求中央情报局公布一项秘密批量数据收集计划的细节，该计划显然已诱捕了美国人。\n俄勒冈州参议员罗恩·怀登（Ron Wyden）和马丁·海因里希（Martin Heinrich，D-N.M.）写信给美国国家情报局局长和中央情报局（CIA）（PDF），要求他们解密一份对中央情报局（CIA）名为“深潜II”的项目的审查，该项目的细节已从他们的信中删减。这封信是2021年4月写成的，但直到昨天才分类。\n中央情报局的秘密计划是在前总统罗纳德·里根1981年发布的12333号行政命令的授权下运作的。它被用来证明在美国收集大量数据是合理的，包括电话、短信，直到最近还包括电子邮件元数据。这种做法受到2015年《外国情报监视法》（FISA）重新授权的限制，该法禁止FBI大量收集电话和短信元数据。\n威登和海因里希在一份声明中说：“由于国会定期重新授权，以及司法部、国家情报局长办公室和FISA法庭文件的发布，FISA受到了所有关注。”。“但这些文件表明，美国人对其隐私和公民自由的许多担忧同样适用于中央情报局根据行政命令和FISA法之外收集和处理信息的方式。特别是，这些文件揭示了与美国情报局的无授权后门搜索相关的严重问题在FISA的背景下，同样的问题引起了两党的关注。“参议员们写道，中央情报局的大量数据收集计划是“秘密进行”的，并且是在国会和公众认为管理这一收集的法定框架之外完成的，而且没有任何司法、国会甚至行政部门的监督，而FISA的收集工作也伴随而来。\n“这一基本事实一直瞒着公众和国会。直到[隐私和公民自由监督委员会]上个月提交报告之前，甚至参议院情报特别委员会也没有透露中央情报局收集的性质和全部范围。”\n在向美联社发布的一份声明中，中央情报局没有否认正在收集有关美国人的数据，也没有澄清其法律依据。中情局的隐私和公民自由官员克里斯蒂·斯科特在声明中说：“中情局承认并非常认真地对待我们在执行重要的国家安全任务时尊重美国公民隐私和公民自由的义务。”。“中情局致力于透明度，这符合我们保护情报来源和方法的义务。”\n威登和海因里希要求中情局披露其与消息来源的关系，以及其认为开展此类行动有何法律依据。他们还想知道收集了哪些类型的记录，它们是如何存储的，谁可以访问它们，以及有多少美国人收集和保留了他们的记录。\n他们写道：“就NSA和FBI的FISA藏品而言，上述每一件事都是广泛解密的主题；没有理由说CIA的活动不能同样透明。”。政府仅在2017年才披露了司法部长的指导方针，即中央情报局在根据12333号行政命令开展项目时应遵循的指导方针。\n在公民自由监督委员会（civil liberties oversight board）昨天解密的一系列建议中，中央情报局（CIA）承认“仍在实施”这些指导方针。目前，防止滥用该授权的“检查”之一是一个弹出框，提醒分析人士，工具只能用于收集外国情报，不能用于美国人。它不要求他们“记录理由”，以便在审计期间进行审查。\n怀登和海因里希说，中央情报局应该表现出更大的透明度，否则就有可能破坏整个情报界的长期信誉。“解密工作非常紧迫，”参议员们写道。“至关重要的是，国会不能在没有意识到中情局（修订的）计划的情况下立法。”", "note_en": "Two US senators have asked the Central Intelligence Agency to release the details of a secret bulk data collection program that has apparently ensnared Americans.\n Sens. Ron Wyden (D-Ore.) and Martin Heinrich (D-N.M.)  wrote the director of national intelligence and the CIA (PDF), asking them to declassify a review of a CIA program known as “Deep Dive II,” the details of which were redacted from their letter. The letter was written in April 2021 but was classified until yesterday.\n The secret CIA program is operated under the authority of  Executive Order 12333, which former President Ronald Reagan issued in 1981. It has been used to justify bulk data collection of people in the US, including phone calls, SMS messages, and, until recently, email metadata. That practice was limited by a 2015 reauthorization of the Foreign Intelligence Surveillance Act, known as FISA, which banned the  bulk collection of phone and SMS metadata by the FBI.\n  “FISA gets all the attention because of the periodic congressional reauthorizations and the release of Department of Justice, Office of the Director of National Intelligence, and FISA Court documents,” Wyden and Heinrich said in a statement. “But what these documents demonstrate is that many of the same concerns that Americans have about their privacy and civil liberties also apply to how the CIA collects and handles information under executive order and outside the FISA law. In particular, these documents reveal serious problems associated with warrantless backdoor searches of Americans, the same issue that has generated bipartisan concern in the FISA context.” The CIA’s bulk data collection program, the senators wrote, has been “secretly conducted” and is done &#34;outside the statutory framework that Congress and the public believe govern this collection, and without any of the judicial, congressional, or even executive branch oversight that comes with FISA collection.\n    “This basic fact has been kept from the public and from Congress. Until the [Privacy and Civil Liberties Oversight Board] report was delivered last month, the nature and full extent of the CIA’s collection was withheld even from the Senate Select Committee on Intelligence.”\n In a statement issued to the Associated Press, the CIA did not deny that it was collecting data on Americans or clarify its legal justification. “CIA recognizes and takes very seriously our obligation to respect the privacy and civil liberties of US persons in the conduct of our vital national security mission,” Kristi Scott, the agency’s privacy and civil liberties officer,  said in the statement. “CIA is committed to transparency consistent with our obligation to protect intelligence sources and methods.”\n Wyden and Heinrich are asking the CIA to disclose what type of relationship it has with its sources and what legal justification it thinks it has to conduct such an operation. They also want to know what types of records were collected, how they’re stored, who has access to them, and how many Americans had their records collected and retained.\n  “Each of these matters has been the subject of extensive declassifications with regards to NSA’s and FBI’s FISA collection; there is no reason why CIA’s activities cannot be equally transparent,” they wrote. The government only disclosed in 2017 the attorney general’s guidelines that the CIA is supposed to follow when conducting a program under Executive Order 12333.\n In a set of recommendations that were declassified yesterday and made by the civil liberties oversight board, the CIA admits that “it is still in the process of implementing” those guidelines. Currently, one of the “checks” against abuse of that authorization is a pop-up box that reminds analysts that a tool is only to be used to collect foreign intelligence and is not to be used on US persons. It does not require them to “memorialize the justification” so it could be reviewed during an audit.\n Wyden and Heinrich say that the CIA should exhibit greater transparency or else risk undermining the long-term credibility of the entire intelligence community. “This declassification is urgent,” the senators wrote. “It is critical that Congress not legislate without awareness of a [redacted] CIA program.”", "posttime": "2022-02-15 13:36:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,大量,collecting,收集", "title": "参议员们说，中央情报局在没有监督的情况下收集了大量关于美国人的数据", "title_en": "CIA collecting bulk data on Americans without oversight, senators say", "transed": 1, "url": "https://arstechnica.com/tech-policy/2022/02/cia-collecting-bulk-data-on-americans-without-oversight-senators-say/", "via": "", "real_tags": ["美国", "大量", "收集"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国食品2019冠状病毒疾病管理局星期五宣布，他们放弃了对6至4岁儿童的两种剂量的CVID-19疫苗的授权。取而代之的是，他们将再次搁置授权的可能性，因为他们正在等待第三剂对最年幼儿童有效性的数据。该数据预计将于4月初公布。\n在今天下午的2019冠状病毒疾病报告中，辉瑞公司及其合作伙伴BioTeCo报道了CVID-19病例，其中包括两个初始剂量的试验和34。根据研究方案继续积累，由于这个年龄段的儿童感染率和患病率仍然很高，尤其是由于最近omicron激增，因此正在生成更多的数据&#34;\n&#34;鉴于该研究进展迅速，随着辉瑞和BioNTech继续相信它可能在这个年龄组提供更高水平的保护，这些公司将等待三剂数据；新闻稿还在继续。\n在FDA发布的一份声明中，代理专员珍妮特·伍德科克（Janet Woodcock）和最高疫苗监管机构彼得·马克斯（Peter Marks）写道，FDA已从辉瑞（Pfizer）和BioNTech收到新的试验数据&#34;根据该机构的初步评估，为了有更多时间评估额外数据，我们认为，关于第三剂正在进行的评估的额外信息应被视为我们潜在授权决策的一部分，&#34；官员们写道。\n12月，辉瑞和BioNTech宣布，针对2至4岁儿童的试验的中期数据发现，两剂3微克疫苗（相当于成人剂量的十分之一）不能产生16至25岁人群的免疫反应水平，该疫苗已经获得批准。据接受《纽约时报》采访的未具名官员称，这两剂疫苗只产生了60%的针对大流行病毒的目标抗体水平。因此，这些公司计划在第二次注射至少两个月后再注射第三剂。\n但上个月底，随着超传染性奥米克龙变种在美国的流行，这些公司和FDA似乎改变了想法。有消息称，FDA已鼓励辉瑞和BioNTech仅就这两种5岁以下儿童剂量提交数据。\n当时，前FDA专员、现任辉瑞董事会成员斯科特·戈特利布（Scott Gottlieb）在CBS&#39；美国面临2019冠状病毒疾病，两种疫苗可能仍然能保护COVID-19的严重后果，并能获得监管绿色信号，以提供34和基线和#34；马上保护。稍后可能会增加第三次注射，以提高抗感染的效果。\n美国食品和药物管理局今天的声明呼应了这一想法：&#34；目的是了解两剂疫苗是否能提供足够的保护，从而进一步授权在这个年龄组使用疫苗&#34;\n但基于这种逆转，最新的omicron儿童数据似乎再次改变了人们的想法，FDA的声明称，&#34；目前，我们认为应考虑关于正在进行的第三剂评估的其他信息&#34;\n辉瑞今天强调&#39；s的新闻稿称，第三剂仍有希望被证明有效。该公司指出，这种想法是&#34；最近对其他几个年龄组的三剂增强剂数据的观察表明，与两剂方案相比，奥米克罗似乎有意义地提高了中和抗体水平和实际疫苗保护&#34;\nFDA指出，它将推迟专家顾问小组的会议，该小组计划于下周召开会议，审查两剂数据&#34;与此同时，保护儿童的最佳方式，包括在学校或托儿所时，是根据公共卫生建议练习社交距离和掩蔽，并让他们的家人和看护者在符合条件时接种疫苗或接受增强剂，&#34；FDA的声明得出结论。", "note_en": "The Food and Drug Administration, Pfizer, and BioNTech announced on Friday that they are abandoning plans to pursue the authorization of a two-dose regimen of COVID-19 vaccines for children ages 6 months to 4 years. Instead, they will again put the possibility of an authorization on hold as they await data on the efficacy of a third dose for the youngest children. That data is now expected in early April.\n In  a press release this afternoon, Pfizer and its partner BioNTech reported that COVID-19 cases among children enrolled in the initial two-dose trial &#34;continue to accumulate according to the study protocol, and more data are being generated because rates of infection and illness remain high in children of this age, especially due to the recent omicron surge.&#34;\n &#34;Given that the study is advancing at a rapid pace, the companies will wait for the three-dose data as Pfizer and BioNTech continue to believe it may provide a higher level of protection in this age group,&#34; the press release continued.\n In  a statement released by the FDA, Acting Commissioner Janet Woodcock and top vaccine regulator Peter Marks wrote that the agency had received new trial data from Pfizer and BioNTech. &#34;Based on the agency’s preliminary assessment, and to allow more time to evaluate additional data, we believe additional information regarding the ongoing evaluation of a third dose should be considered as part of our decision-making for potential authorization,&#34; the officials wrote.\n In December,  Pfizer and BioNTech announced that interim data from the trial with children ages 2 to 4 found that two doses of a 3-microgram vaccine (a tenth of the dose given to adults) did not produce the same level of immune responses seen in people ages 16 to 25, for which the vaccine is already approved. According to unnamed officials who spoke with The New York Times, the two doses only generated  60 percent of the targeted level of antibodies against the pandemic virus. As such, the companies planned to add a third dose to be given at least two months after the second.\n     But late last month, as the ultra-transmissible omicron variant bore down on the US, the companies and the FDA seemed to  shift their thinking. News broke that the FDA had encouraged Pfizer and BioNTech to submit data on just the two doses for children under 5.\n At the time, Scott Gottlieb, a former FDA commissioner and a current Pfizer board member, argued in an interview on CBS&#39;s  Face the Nation that the two-dose vaccine may still provide protection from severe outcomes from COVID-19 and could get a regulatory green light to provide that &#34;baseline&#34; protection right away. A third shot to boost effectiveness against infection could be added later.\n The FDA statement today echoes that thinking: &#34;The goal was to understand if two doses would provide sufficient protection to move forward with authorizing the use of the vaccine in this age group.&#34;\n But based on the reversal, the latest omicron data in children seems to have shifted the thinking again, with the FDA statement saying that, &#34;at this time, we believe additional information regarding the ongoing evaluation of a third dose should be considered.&#34;\n Pfizer emphasized in today&#39;s press release that it is still hopeful a third dose will prove effective. The company notes that such thinking is &#34;supported by recent observations of three-dose booster data in several other age groups that seems to meaningfully augment neutralizing antibody levels and real-world vaccine protection for omicron compared to the two-dose regimen.&#34;\n The FDA noted that it is postponing a meeting of its panel of expert advisers, which was planning to gather next week to review the two-dose data. &#34;In the meantime, the best way to protect children, including when they are at school or daycare, is to practice social distancing and masking in accordance with public health recommendations and for their family members and caregivers to get vaccinated or receive a booster dose when eligible,&#34; the FDA statement concluded.", "posttime": "2022-02-15 13:32:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "辉瑞公司,pfizer,疫苗", "title": "FDA、辉瑞公司引用新数据放弃5岁以下儿童接种2针新冠疫苗", "title_en": "FDA, Pfizer abandon 2-shot COVID vaccine in kids under 5, citing new data", "transed": 1, "url": "https://arstechnica.com/science/2022/02/fda-pfizer-abandon-2-shot-covid-vaccine-in-kids-under-5-citing-new-data/", "via": "", "real_tags": ["辉瑞公司", "pfizer", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "古罗马考古遗址到处都是陶瓷壶，要确定任何给定的壶的用途可能很困难，例如，它是用来储存还是用作便携式厕所（室内壶）。剑桥大学和英属哥伦比亚大学的研究人员现在分析了一个这样的陶瓷罐上的残留物，并确定了粪便中常见的肠道寄生虫的卵。那&#39；这是一个强有力的证据，证明这个有1500年历史的罐子最有可能被用作室内罐。\n“这种类型的圆锥形锅在罗马帝国中已被广泛认可，并且在没有其他证据的情况下，它们经常被称为储藏罐，和34号，”英属哥伦比亚大学的合著者Roger Wilson和34说，发现许多公共厕所或附近的公共厕所已经暗示了它们可能被用作CH。琥珀壶，但直到现在，还缺乏证据&#34;\n考古学家通过研究古代粪便中肠道寄生虫的遗骸可以学到很多东西。就在上个月，我们报道了对从耶路撒冷郊外一座公元前7世纪豪华别墅废墟中发现的一座石制厕所中采集的土壤样本的分析。该分析显示存在来自四种不同物种的寄生虫卵：鞭虫、牛肉/猪肉绦虫、蛔虫和蛲虫。（这是古以色列最早的蛔虫和蛲虫记录。）\n此前的其他研究对狩猎采集者和农业社区中发现的粪便寄生虫进行了比较，揭示了饮食结构的巨大变化，以及随着农业的兴起，定居模式和社会组织的变化。\n这项最新研究涉及一个陶罐，它是在西西里农村地区杰拉斯的一座公元5世纪的罗马别墅遗址上挖掘出来的。该遗址于1994年被发现，并于2007年进行了少量勘探，但自2013年以来，在六次活动中进行了最广泛的挖掘。考古学家发现了一座朴素的别墅，其特色是装饰性的马赛克人行道和一座带有类似马赛克和大理石装饰的独立浴室。还有一个大型存储结构和窑炉。\n这座别墅名为&#34；菲利皮亚尼和#34；根据浴室里发现的马赛克#39；s冷藏室（冷藏室）。根据作者的说法，这些浴池在5世纪下半叶的某个时候被地震严重破坏，修复尝试最终被放弃。浴缸被剥去最有用的材料，然后填满。\n2019年，在一间温暖的房间（tepidarium）外的澡堂现场发现了这只有问题的水壶，它很可能是在剥皮和填充期间被扔到那里的，因为它被打碎了。它的尺寸（大约12.5英寸高，边缘直径13英寸）正好适合做一个小室罐。作者推测，使用者可能直接坐在罐子上，或者罐子可能放在柳条制品或木椅下。", "note_en": "Ancient Roman archaeological sites are littered with ceramic pots, and it can be challenging to definitively determine the purpose of any given pot—for instance, if it was used for storage or as a portable toilet (chamber pot). Researchers from the University of Cambridge and the University of British Columbia have now analyzed the residue on one such ceramic pot and identified the eggs of intestinal parasitic worms commonly found in feces, according to  a new paper published in the journal Archaeological Science Reports. That&#39;s strong evidence that the 1,500-year-old pot in question was most likely used as a chamber pot.\n “Conical pots of this type have been recognized quite widely in the Roman Empire, and in the absence of other evidence, they have often been called storage jars,&#34;  said co-author Roger Wilson of the University of British Columbia. &#34;The discovery of many in or near public latrines had led to a suggestion that they might have been used as chamber pots, but until now, proof has been lacking.&#34;\n Archaeologists can learn a great deal by studying the remains of intestinal parasites in ancient feces. Just last month,  we reported on an analysis of soil samples collected from a stone toilet found within the ruins of a swanky 7th-century BCE villa just outside Jerusalem. That analysis revealed the presence of parasitic eggs from four different species: whipworm, beef/pork tapeworm, roundworm, and pinworm. (It&#39;s the earliest record of roundworm and pinworm in ancient Israel.)\n    Other prior studies have compared fecal parasites found in hunter-gatherer and farming communities, revealing dramatic dietary changes, as well as shifts in settlement patterns and social organization coinciding with the rise of agriculture.\n  This latest study concerns a ceramic pot excavated at the site of a 5th-century CE Roman villa at Gerace, a rural district in Sicily. The site was discovered in 1994 and was explored a bit in 2007, but the most extensive excavation has been done since 2013, over the course of six campaigns. Archaeologists uncovered a modest villa featuring decorative mosaic pavements and a detached bath house with similar mosaic and marble ornamentation. There is also a large storage structure and kilns.\n The villa was known as &#34;the estate of the Philippiani,&#34; based on a mosaic found in the bath house&#39;s cold room ( frigidarium). Per the authors, the baths were badly damaged by an earthquake sometime in the second half of the 5th century, and repair attempts were ultimately abandoned. The baths were stripped of most useful materials and then filled in.\n The pot in question was found at the bath house site in 2019, just outside one of the warm rooms ( tepidarium), and it was likely tossed there during the stripping and filling-in period since it was broken. Its size (about 12.5 inches high and 13 inches in diameter at the rim) is just right for a chamber pot. The authors surmise that the user could have sat directly on the pot, or the pot could have been placed under a wickerwork or timber chair.", "posttime": "2022-02-15 13:30:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发现,roman,可能", "title": "研究发现，这个古罗马陶瓷壶可能是一个便携式马桶", "title_en": "This Ancient Roman ceramic pot was probably a portable toilet, study finds", "transed": 1, "url": "https://arstechnica.com/science/2022/02/this-ancient-roman-ceramic-pot-was-probably-a-portable-toilet-study-finds/", "via": "", "real_tags": ["发现", "roman", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073435, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "林肯曾是福特&#39；1922年2月4日，蓝色椭圆形从亨利·利兰手中买下了林肯汽车公司，几乎整整一个世纪。据路透社报道，从现在到2026年，该品牌将推出一系列新型电池电动SUV，为下一个世纪做好准备。\n去年6月，林肯宣布，到2030年，它将成为一个完全由电池供电的品牌。它&#39；考虑到具有瞬时扭矩和近乎静音运行的电机非常适合豪华汽车，这对汽车制造商来说是一个不需要动脑筋的问题。\n当时，林肯宣布其第一款全电动车型将于2022年面世，包括后轮驱动和全轮驱动配置。虽然我们没有&#39；我没有看到这辆林肯电池EV，Occam和#39的任何效果图或间谍照片；s razor建议它将建立在与福特相同的平台上；s野马Mach-E跨界车。\n从那时起，福特已经将其BEV热加倍，增加了Mach-E和F-150 Lightning的生产能力，电池足以在2023年供应60万辆BEV。\n所以它&#39；林肯在2024年将在电动汽车领域变得更加繁忙，这并不意外。那&#39；路透社称，当第一辆新的电动汽车到达时。该车将是一款大型跨界车，尺寸与林肯飞行员相似，将在福特和#39；他在加拿大奥克维尔的工厂。福特正在花费15亿美元将该工厂改造成电动汽车工厂。\n我们应该在2025年或2026年看到一些较小的交叉点（以取代海盗船和鹦鹉螺），这些交叉点预计也将使用Mach-E平台或其演变。\n最后，一款尺寸与Navigator相似的大型SUV将于2026年上市。这将使用福特为下一代电动F-150皮卡开发的相同电动汽车平台。", "note_en": "Lincoln has been Ford&#39;s luxury brand for almost exactly a century now—the Blue Oval bought the Lincoln Motor Company from Henry Leland on February 4, 1922. Now the brand is getting ready for its next century with a raft of new battery-electric SUVs due between now and 2026,  according to Reuters.\n Last June, Lincoln announced that it would become a fully battery-electric brand by 2030. It&#39;s a no-brainer for the automaker, given how well electric motors—with instantaneous torque and near-silent operation—are suited to luxury vehicles.\n At the time, Lincoln announced that its first fully electric model would arrive in 2022, in both rear- and all-wheel-drive configurations. Although we haven&#39;t seen any renderings or spy shots of this first Lincoln battery EV, Occam&#39;s razor suggests it will be built on the same platform as Ford&#39;s Mustang Mach-E crossover.\n Since then, Ford has doubled down on its BEV fever, increasing production capacity for both the Mach-E and F-150 Lightning,  with enough batteries to supply 600,000 BEVs in 2023.\n So it&#39;s not unexpected that Lincoln will get even busier on the EV front in 2024. That&#39;s when the first of the new EVs arrives, Reuters says. The vehicle will be a large crossover similar in size to the  Lincoln Aviator and will be built at Ford&#39;s factory in Oakville in Canada. Ford is spending $1.5 billion to convert that facility into an EV factory.\n We should see some smaller crossovers (to replace the Corsair and  Nautilus) in 2025 or 2026—these are expected to also use the Mach-E platform or an evolution thereof.\n Finally, a big SUV similar in size to the Navigator is slated for 2026. This would use the same EV platform that Ford will develop for the next-gen electric F-150 pickup truck.", "posttime": "2022-02-15 13:29:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "suv,lincoln,林肯", "title": "到2026年，五辆电动SUV是林肯未来的关键", "title_en": "Five electric SUVs by 2026 are key to Lincoln’s future", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/five-electric-suvs-by-2026-are-key-to-lincolns-future/", "via": "", "real_tags": ["suv", "lincoln", "林肯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它&#39；这是周末，也就是说&#39；是时候换一个交易主管了。我们最新的网络最佳交易综述包括亚马逊的优惠价格#39；最新的Kindle Paperwhite，因为电子阅读器目前在各个零售商的售价都降到了110美元。那&#39；亚马逊折扣30新元&#39；s MSRP和第二低价格我们&#39；我跟踪了。唯一一次我们&#39；我已经看到该设备在黑色星期五前后下跌，当时它的售价比黑色星期五低5美元。亚马逊将三个月的Kindle无限电子书服务作为交易的一部分，但请注意，这将被设置为默认自动续费。\n去年发布最新的Kindle Paperwhite时，我们对它进行了热烈的评论。与上一代相比，它增加了更宽敞的显示屏（现在是6.8英寸，而不是6英寸）、USB-C端口、更好的前照灯、更稳定的响应性能，以及更好的电池寿命（亚马逊估计每次充电大约10周）。和上一款一样，它&#39；它防水（IPX8等级），可以连接蓝牙耳机和扬声器播放有声读物。和所有Kindle一样，它仍然可以访问一个庞大的阅读库。它&#39；它比上一款要大一点，如果你不&#39；我不想把自己锁在亚马逊&#39；s生态系统，Kobo和#39；s Clara HD是一个不错的选择（尽管它没有防水和蓝牙），它&#39；在撰写本文时，它也在销售中。但对大多数人来说，Paperwhite是功能和价值最佳结合的电子阅读器。也就是说，它&#39；值得注意的是，Kindle Paperwhite的儿童版也以10美元以上的价格出售。尽管这款产品面向儿童销售，但它与标准的Paperwhite具有所有相同的功能，加上一个外壳，保修期更长（两年而不是一年），最值得注意的是，默认情况下，锁屏或主页上没有广告。（后者是一项功能，在支持广告的标准机型上额外花费20美元。）如果你&#39；具体来说，Kindle儿童电子书阅读器可能会有更好的价值，但愿意支付额外费用的老读者可能会想考虑这个模型。\n亚马逊还销售Paperwhite的标志性版本，增加了Qi无线充电、32GB存储空间（高于标准型号的8GB）和自动调节背光。这款车型的价格降到了145美元的新低，但对大多数人来说，它的改进更多&#34；很高兴拥有&#34；比&#34；必要的&#34;\n除了Kindle，我们的交易综述还包括一些关于任天堂交换机的交易。Amazon Prime会员可以从亚马逊子公司的控制台取20美元，而任天堂本身拥有我们在黑色星期五看到的包裹，其中包括马里奥卡丁车8豪华版和三个月的公司和39号。s使用控制台切换在线服务，无需额外费用。\n这些都不是特别大的折扣，它们只适用于标准版本的控制台，而不是较新的开关OLED。后者的库存更难找到，但它增加了一个更大、更生动的显示屏，内部存储空间增加了一倍，改进了铰链，并以350美元的价格进行了其他升级。尽管如此，最近在游戏机上的任何交易都很少见，所以如果你&#39；We’我们想买你的第一个开关和don#39；I don’我不想为OLED机型腾出额外的资金，这些优惠值得一提。在其他地方，我们也有其他推荐的小工具和设备的交易，包括谷歌&#39；s Chromecast，苹果和#39；s AirPods Pro，亚马逊和#39；s Fire HD 8平板电脑，以及更多。你可以在下面查看我们的完整策划列表。\nArs Technica可能会通过联盟计划从本文链接中获得销售报酬。\n亚马逊Kindle Paperwhite（8GB）6.8英寸电子阅读器+3个月Kindle无限会员资格（自动续费），在亚马逊、Target、百思买（Best Buy）支付110美元（140美元）\n亚马逊Kindle Paperwhite Kids（8GB，无广告）6.8英寸电子阅读器在亚马逊百思买（Amazon，Best Buy）售价120美元（155美元）\n谷歌Chromecast和谷歌电视4K媒体流，在Target、百思买和沃尔玛以40美元（50美元）的价格出售\n苹果AirPods Pro true无线ANC耳机售价175美元（190美元），在亚马逊、沃尔玛、山姆和#39；s俱乐部\n苹果皮套搭配MagSafe（午夜版）iPhone 13，售价40美元（50美元），亚马逊、沃尔玛\n亚马逊Fire HD 8（32GB）8英寸平板电脑，售价45美元（75美元），亚马逊、Target、百思买\n亚马逊Fire HD 8（32GB）8英寸平板电脑，售价45美元（75美元），亚马逊、Target、百思买\n亚马逊在亚马逊、Target、百思买以70美元（120美元）的价格推出8英寸高清儿童（32GB）平板电脑\n亚马逊Fire HD 8 Plus（32GB）8英寸平板电脑，售价55美元（90美元），亚马逊、Target、百思买\n亚马逊Kindle Paperwhite（8GB）6.8英寸电子阅读器+3个月Kindle无限会员资格（自动续费），在亚马逊、Target、百思买（Best Buy）支付110美元（140美元）\n亚马逊Kindle Paperwhite Kids（8GB，无广告）6.8英寸电子阅读器在亚马逊百思买（Amazon，Best Buy）售价120美元（155美元）\n亚马逊Kindle Paperwhite签名版（32GB，无广告）6.8英寸电子阅读器+3个月Kindle无限会员资格（自动续费），在亚马逊百思买（Amazon，Best Buy）支付145美元（190美元）\n亚马逊Echo Show 8（第二代）8英寸智能显示屏，售价90美元（115美元），亚马逊百思买\n苹果AirPods Pro true无线ANC耳机售价175美元（190美元），在亚马逊、沃尔玛、山姆和#39；s俱乐部\n苹果iPad Air（256GB）10.9英寸平板电脑，售价650美元（720美元），在Target、百思买、沃尔玛和亚马逊销售\n谷歌Chromecast和谷歌电视4K媒体流，在Target、百思买和沃尔玛以40美元（50美元）的价格出售\nRoku Streambar Pro 2.0声道soundbar+4K HDR媒体流，售价150美元（165美元），亚马逊、科尔和#39；s\nWD Black SN750 SE（500GB NVMe）PCIe Gen 4内部SSD在沃尔玛亚马逊（Amazon）售价50美元（57美元）\nSK Hynix Gold P31（1TB NVMe）PCIe Gen 3内部SSD在亚马逊售价110美元（130美元）\nHP Envy x360二合一笔记本电脑（Ryzen 7 5800U、13.3英寸1080p、16GB RAM、512GB SSD），售价850美元（1100美元）\n苹果皮套搭配MagSafe（午夜版）iPhone 13，售价40美元（50美元），亚马逊、沃尔玛\n在Target购买一张，在各种任天堂、PlayStation和Xbox礼品卡上享受15%的折扣\n100美元苹果礼品卡+10美元百思买礼品卡，100美元（110美元）在百思买", "note_en": "It&#39;s the weekend, which means it&#39;s time for another Dealmaster. Our latest roundup of the best deals from around the web includes a nice price on Amazon&#39;s newest Kindle Paperwhite, as the e-reader is  currently down to $110 at various retailers. That&#39;s $30 off Amazon&#39;s MSRP and the second-lowest price we&#39;ve tracked. The only time we&#39;ve seen the device fall lower was  around Black Friday, when it was available for $5 less. Amazon includes three months of its  Kindle Unlimited ebook service as part of the deal, but be aware that this will be set to auto-renew by default.\n  We gave the latest  Kindle Paperwhite a rave review when it released last year. Compared to its predecessor, it adds a more spacious display (now at 6.8 inches, up from six), a USB-C port, a better frontlight, more consistently responsive performance, and improved battery life (which Amazon rates at roughly 10 weeks per charge). Like the last model, it&#39;s waterproof (with an  IPX8 rating) and it can connect to Bluetooth headphones and speakers for playing audiobooks. And like all Kindles, it still has access to an enormous library of things to read. It&#39;s a bit bigger than the last model, and if you just don&#39;t want to lock yourself into Amazon&#39;s ecosystem, Kobo&#39;s Clara HD is a decent alternative (albeit one without waterproofing and Bluetooth) that&#39;s  also on sale as of this writing. But for most people, the Paperwhite is the e-reader with the best combination of features and value. That said, it&#39;s worth noting that the Kids version of the Kindle Paperwhite is  also on sale for $10 more. Though this variant is marketed towards children, it has all the same features as the standard Paperwhite, plus a case, a longer warranty (two years instead of one), and, most notably, no ads on its lock screen or homepage by default. (The latter is a  feature that costs an extra $20 on the standard, ad-supported model.) If you&#39;re buying for a young kid specifically, the standard  Kindle Kids e-reader is likely a better value, but older readers willing to pay a little extra might want to consider this model instead.\n Amazon also sells a Signature Edition of the Paperwhite that adds Qi wireless charging, 32GB of storage space (up from the standard model&#39;s 8GB), and an auto-adjusting backlight. This model is  down to a new low of $145, but for most, its improvements are more &#34;nice to have&#34; than &#34;essential.&#34;\n Besides Kindles, our deals roundup also includes a couple of deals on the Nintendo Switch. Amazon Prime members can  take $20 off the console at Amazon subsidiary Woot, while  Nintendo itself has the bundle  we saw on Black Friday, which includes a copy of  Mario Kart 8 Deluxe and three months of the company&#39;s Switch Online service with the console at no extra cost.\n     These are not particularly huge discounts, and they only apply to the standard version of the console, not the  newer Switch OLED. The latter has been more difficult to find in stock, but it adds a larger and more vivid display, double the internal storage space, an improved hinge, and other upgrades for $350. Still, any sort of deal on the console has been rare as of late, so if you&#39;re looking to buy your first Switch and don&#39;t want to spare the extra cash for the OLED model, these offers are worth noting. Elsewhere, we have deals on other recommended gadgets and gear, including  Google&#39;s Chromecast,  Apple&#39;s AirPods Pro, Amazon&#39;s Fire HD 8 tablets, and much more. You can check out our full curated list below.\n Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n  Amazon Kindle Paperwhite (8GB) 6.8-inch e-reader + 3-month Kindle Unlimited membership (auto-renew) for  $110 ( $140) at  Amazon,  Target,  Best Buy\n Amazon Kindle Paperwhite Kids (8GB, no ads) 6.8-inch e-reader for  $120 ( $155) at  Amazon,  Best Buy\n   Google Chromecast with Google TV 4K media streamer for  $40 ( $50) at  Target,  Best Buy,  Walmart\n Apple AirPods Pro true wireless ANC earphones for  $175 ( $190) at  Amazon,  Walmart,  Sam&#39;s Club\n Apple Leather Case with MagSafe (Midnight) for iPhone 13 for  $40 ( $50) at  Amazon,  Walmart\n Amazon Fire HD 8 (32GB) 8-inch tablet for  $45 ( $75) at  Amazon,  Target,  Best Buy\n   Amazon Fire HD 8 (32GB) 8-inch tablet for  $45 ( $75) at  Amazon,  Target,  Best Buy\n Amazon Fire HD 8 Kids (32GB) 8-inch tablet for  $70 ( $120) at  Amazon,  Target,  Best Buy\n Amazon Fire HD 8 Plus (32GB) 8-inch tablet for  $55 ( $90) at  Amazon,  Target,  Best Buy\n Amazon Kindle Paperwhite (8GB) 6.8-inch e-reader + 3-month Kindle Unlimited membership (auto-renew) for  $110 ( $140) at  Amazon,  Target,  Best Buy\n Amazon Kindle Paperwhite Kids (8GB, no ads) 6.8-inch e-reader for  $120 ( $155) at  Amazon,  Best Buy\n Amazon Kindle Paperwhite Signature Edition (32GB, no ads) 6.8-inch e-reader + 3-month Kindle Unlimited membership (auto-renew) for  $145 ( $190) at  Amazon,  Best Buy\n Amazon Echo Show 8 (2nd gen) 8-inch smart display for  $90 ( $115) at  Amazon,  Best Buy\n  Apple AirPods Pro true wireless ANC earphones for  $175 ( $190) at  Amazon,  Walmart,  Sam&#39;s Club\n    Apple iPad Air (256GB) 10.9-inch tablet for  $650 ( $720) at  Target,  Best Buy,  Walmart,  Amazon\n Google Chromecast with Google TV 4K media streamer for  $40 ( $50) at  Target,  Best Buy,  Walmart\n     Roku Streambar Pro 2.0-channel soundbar + 4K HDR media streamer for  $150 ( $165) at  Amazon,  Kohl&#39;s\n  WD Black SN750 SE (500GB NVMe) PCIe Gen 4 internal SSD for  $50 ( $57) at  Amazon,  Walmart\n  SK Hynix Gold P31 (1TB NVMe) PCIe Gen 3 internal SSD for  $110 ( $130) at  Amazon\n HP Envy x360 2-in-1 laptop (Ryzen 7 5800U, 13.3-inch 1080p, 16GB RAM, 512GB SSD) for  $850 ( $1,100) at  HP\n        Apple Leather Case with MagSafe (Midnight) for iPhone 13 for  $40 ( $50) at  Amazon,  Walmart\n Buy one, get one 15 percent off sale on various Nintendo, PlayStation, and Xbox gift cards at  Target\n  $100 Apple Gift Card + $10 Best Buy gift card for  $100 ( $110) at  Best Buy", "posttime": "2022-02-15 13:23:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "任天堂,游戏,deals,paperwhite", "title": "周末最划算的游戏：Kindle Paperwhite、任天堂Switch等等", "title_en": "The weekend’s best deals: Kindle Paperwhite, Nintendo Switch, and more", "transed": 1, "url": "https://arstechnica.com/staff/2022/02/the-weekends-best-deals-kindle-paperwhite-nintendo-switch-and-more/", "via": "", "real_tags": ["任天堂", "游戏", "deals"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当《波巴·费特的书》还在制作时，创作者乔恩·法夫罗开玩笑地称这部衍生系列为#34；曼达洛人2.5季&#34; 结果他不是&#39；我不是开玩笑。我的意思是，我们知道《波巴·费特之书》将在同一时间发生。我只是没有&#39；I don’我没想到，在七集的第四集中，焦点会突然从Temuera Morrison&#39；这是一个象征性的有名无实的角色，也就是说，本系列和接下来的两集中的明星将主要花在追上我们最喜欢的曼达洛人角色上。\n这是一个有趣的创造性选择，在互联网上引发了相当多的讨论（还有不少嘲弄性的模因）。好消息是，总的来说，《波巴·费特之书》仍然是一部极具娱乐性的《星球大战历险记》。这本书以一个取悦观众、长达一小时的动作序列结束了本季。在这部影片中，波巴和他的各种盟友与邪恶的派克集团展开了一场高潮般的战斗，并进行了一场声势浩大、由衷的重聚。\n坏消息是这本书从来没有真正弄清楚它想讲谁的故事。这部连续剧基本上是在浪费前四集的承诺，因为它没有以任何有意义的方式发展其所谓的主角。\n（下面是剧透，但在我们进入主要展览之前，我们会给你一个提示。）\n正如我&#39；我之前写过，一部由波巴·费特（Boba Fett）主演的衍生电影早在2013年就已经在迪士尼（Disney）上映，但2018年&#39；《星球大战》的一个故事被证明是该工作室的票房失望。迪士尼&#39；微软的战略转向了其流媒体平台迪士尼+的衍生系列，从Mandalorian开始。该系列剧在商业和评论方面取得了成功，凭借佩德罗·帕斯卡和#39；s Mandalorian和孩子（又名Grogu，尽管有些人仍然认为他是婴儿尤达）。\n莫里森&#39；s·波巴·费特在S1插曲&#34中短暂出现在曼达洛人身上；枪手&#34; 明娜雯&#39；s Fennec Shand也出现在了这一集中，并在S2回归，扮演了一个更大的角色。在最后一集中，波巴·费特在从莫夫·吉迪恩手中解救格罗古的过程中扮演了关键角色，他诱使帝国允许他的同伴乘坐巡洋舰登陆；美国战斗机发射管。\n粉丝们对马克·哈米尔&#39疯狂；他出人意料地客串了一个（数字老化的）卢克·天行者，他带着格罗古完成绝地训练。没有&#39；格罗古和曼达洛人告别时，屋子里一片干涸。前面提到的电影后期场景显示，波巴·费特和芬内克入侵赫特人贾巴&#39；塔图因的波巴宫殿，目的是将波巴建成新的大名。\n《波巴·费特之书》以一个强有力的开头，讲述了这位赏金猎人如何从他为《绝地归来》而掉进的萨拉克坑中逃脱。他出来后昏倒了，他的盔甲被贾瓦斯偷走了。博巴随后被塔斯肯袭击者俘虏，但随着时间的推移，博巴赢得了部落#39；成为荣誉会员。然后他营救了一个垂死的芬内克·尚德，由于一些机械人的巧妙改进，他康复了。她变成了波巴&#39；他是二把手。\n随着波巴和芬内克接管贾巴&#39；他在塔图因从事犯罪活动，试图巩固他们的权力。他们面临来自&#34；双胞胎，34岁；一对赫特人认为贾巴&#39；英国的王位理应属于他们；莫斯埃斯帕市口是心非的市长，他可能是企图暗杀波巴及其船员的幕后黑手；以及强大的派克辛迪加，该辛迪加在波巴和#39之间运营一列香料列车；并且处于推翻新成立的大名的有利位置。波巴确实有一些盟友，最著名的是一群街头电子人和一个名叫Krrsantan（凯里·琼斯饰）的伍基人赏金猎人。", "note_en": "When   The Book of Boba Fett was still in production, creator Jon Favreau  jokingly dubbed the spinoff series &#34; The Mandalorian season 2.5.&#34; It turns out he wasn&#39;t really joking. I mean, we knew  The Book of Boba Fett would take place in the same timeline. I just didn&#39;t expect that, four episodes into a seven-episode season, the focus would abruptly shift away from Temuera Morrison&#39;s iconic titular character—i.e., the supposed star of the series—and the next two episodes would be spent mostly catching up with our favorite characters from  The Mandalorian.\n  It was (ahem) an interesting creative choice that generated considerable Internet discussion (and more than a few mocking memes). The good news is that, on the whole,  The Book of Boba Fett is still a hella entertaining  Star Wars adventure. And  Book closed its season with a crowd-pleasing, hour-long action sequence in which Boba and his various allies took on the nefarious Pyke Syndicate in a climactic battle—with a squee-worthy, heartfelt reunion for good measure.\n The bad news is that  Book never really figures out whose story it wanted to tell. The series essentially squanders the promise of the first four episodes by failing to develop its supposedly main character in any meaningful way.\n  (Spoilers below, but we will give you a heads-up before we get to the major reveals.)\n As I&#39;ve  written previously, a spinoff film featuring Boba Fett had been in development at Disney as far back as 2013, but then 2018&#39;s   Solo: A Star Wars Story proved to be a box office disappointment for the studio. Disney&#39;s strategy shifted to spinoff series for its streaming platform, Disney+, beginning with  The Mandalorian. That series was a commercial and critical success, winning over audiences with the relationship between Pedro Pascal&#39;s Mandalorian and the Child (aka Grogu, although some still think of him as Baby Yoda).\n    Morrison&#39;s Boba Fett appeared briefly on  The Mandalorian in the S1 episode &#34;The Gunslinger.&#34; Ming-Na Wen&#39;s Fennec Shand also appeared in that episode and returned in S2 for a much larger role. In the finale, Boba Fett played a pivotal role in rescuing Grogu from Moff Gideon by tricking the Imperials into allowing his cohorts to land in a cruiser&#39;s fighter launch tube.\n Fans went wild over Mark Hamill&#39;s surprise cameo as a (digitally de-aged) Luke Skywalker, who takes Grogu with him to complete his Jedi training. And there wasn&#39;t a dry eye in the house as Grogu and the Mandalorian made their farewells. The aforementioned post-credits scene showed Boba Fett and Fennec invading Jabba the Hutt&#39;s palace on Tatooine, with the aim of installing Boba as the new Daimyo.\n  The Book of Boba Fett gets off to a strong start by revealing just how the bounty hunter escaped from that Sarlacc pit he fell into in  Return of the Jedi. He emerges only to pass out and have his armor stolen by Jawas. Boba is subsequently taken captive by Tusken Raiders but, over time, wins the tribe&#39;s trust and becomes an honorary member. And then he rescues a dying Fennec Shand, who recovers thanks to some ingenious cyborg enhancements. She becomes Boba&#39;s second-in-command.\n That backstory is woven into present-day events, as Boba and Fennec take over Jabba&#39;s criminal enterprise on Tatooine and try to consolidate their power. They face opposition from &#34;The Twins,&#34; a pair of Hutts who think Jabba&#39;s throne rightfully should be theirs; the duplicitous mayor of Mos Espa, who might be behind an assassination attempt on Boba and his crew; and the formidable Pyke Syndicate, which runs a spice train through Boba&#39;s territory and is well-positioned to overthrow the newly established Daimyo. Boba does have some allies, most notably a group of street cyborgs and a Wookiee bounty hunter named Krrsantan (Carey Jones).", "posttime": "2022-02-15 13:21:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "评论,book,波巴", "title": "评论：波巴·费特的书很有趣，但它真的是曼达洛人2.5", "title_en": "Review: Book of Boba Fett is lots of fun, but it’s really The Mandalorian 2.5", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/review-the-book-of-boba-fett-is-lots-of-fun-but-its-really-the-mandalorian-2-5/", "via": "", "real_tags": ["评论", "book", "波巴"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073431, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球能源市场陷入动荡并非第一次。国际贸易的天然气价格在2021年间上涨了四倍。在此之后，许多能源供应商破产，欧洲各地的家庭账单将飙升。能源价格正在推高生活成本和通货膨胀，但现在也是认识到这句老话的时刻：“永远不要浪费好的危机。”\n能源费用高企的一些原因是不可避免的——大多数政府对天然气批发价格本身几乎无能为力。化石燃料公司的巨额投资需要数年时间才能成熟，培育出价格适中的时期，然后在价格飙升时出现供应紧缩。天然气价格在过去十年中走软，2020年大流行的到来抑制了需求。\n没有国内天然气供应或近几十年来耗尽了大部分天然气储量的地区通过进口获得了大量天然气。包括英国和地中海许多地区在内的欧洲外围国家认为，它们可以依赖全球液化天然气供应。但卡塔尔等大型天然气生产商的油轮可以转向欧洲或亚洲，这取决于谁支付的价格最高。现在出现了争夺，亚洲需求占主导地位。\n在英国和欧洲其他国家，能源账单的连锁效应被放大。在这些国家，电力是通过批发市场组织的（如果价格合适，发电商会在批发市场竞标），大多数家庭依靠天然气取暖。英国的平均家庭能源账单在2021上升到超过1200英镑（1630美元），预计2022年将增长50%左右。高达一半的增长将不是来自你燃烧的天然气，而是来自天然气对电价的影响。\n那么，为什么电费账单中也会感受到天然气价格的紧缩呢？毕竟，在英国，天然气发电量不到40%的一半，而在整个欧盟，天然气发电量仅占20%左右。可再生能源占英国电力、核能和进口的四分之一以上。在过去十年里，全球风能和太阳能发电的成本大幅下降，陆上风力发电的成本下降了40%以上，太阳能和海上风力发电的成本下降幅度更大。", "note_en": "Not for the first time, global energy markets are in turmoil. Internationally traded gas prices more than  quadrupled in 2021. In their wake, many energy suppliers have gone bust and household bills across Europe are set to soar. Energy prices are driving up the cost of living and inflation, but this is also a moment to realize the old saying: “never waste a good crisis.”\n Some of the causes of sky-high energy bills are unavoidable—there is little that most governments can do about the wholesale price of gas itself. Fossil fuel companies make huge investments that take years to mature, breeding periods of moderate prices followed by supply squeezes when prices rocket. Gas prices softened over the previous decade, and the arrival of the pandemic in 2020 depressed demand.\n Regions without domestic gas supplies or which have depleted most of their gas reserves in recent decades get a lot of their gas by importing it. European periphery countries, including the UK and many parts of the Mediterranean, assumed they could rely on global supplies of liquefied natural gas. But tankers from the big gas producers such as Qatar can turn to Europe or Asia depending on who pays the highest price. Now there is a scramble, and Asian demand dominates.\n    The knock-on effect to energy bills is amplified in the UK and other countries in Europe where electricity is organized through wholesale markets (in which generators bid to operate if the price is right) and in which most homes rely on gas for heating. Average home energy bills in the UK, which rose to over £1,200 (US$1,630) in 2021, are predicted to shoot up by  around 50 percent in 2022. Up to half of the rise will come not from the gas you burn, but from the impact of gas on electricity prices.\n So why is a gas price crunch being felt just as strongly in electricity bills? After all, gas generates less than half of electricity—under 40 percent in the UK and only about 20 percent  across the EU. Renewables generate over a quarter of UK power, nuclear and imports  another quarter. The cost of generating power from wind and solar has  tumbled over the past decade globally, falling by over 40 percent for onshore wind and by far more for  solar and offshore wind.", "posttime": "2022-02-15 13:18:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "能源,cheaper,天然气", "title": "可再生能源比以往任何时候都便宜，为什么家庭能源账单只会上涨？", "title_en": "Renewables are cheaper than ever—why are household energy bills only going up?", "transed": 1, "url": "https://arstechnica.com/science/2022/02/renewables-are-cheaper-than-ever-why-are-household-energy-bills-only-going-up/", "via": "", "real_tags": ["能源", "cheaper", "天然气"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你好，阿尔西安人！今天我们有一件特别的事要告诉大家：一个新的科学系列的首映式我们&#39；重新创造，称为知识的边缘。我们&#39；我聘请了物理学家兼作家保罗·萨特博士（谷歌学者链接）担任我们的主持人，并指导我们在一个八集的节目中畅游宇宙的奥秘，涉及我们在Ars发现的迷人话题。这意味着我们&#39；我们将有几集关于黑洞、气候变化的未来、生命的起源，以及我们首映式中我最喜欢的主题之一：暗物质。\n作为Ars的读者，你&#39；我们可能都熟悉道格拉斯·亚当斯&#39&#34; 空间很大&#34；向搭便车者开放&#39；《银河系指南》，但是&#34；大&#34；这只是故事的一部分。你可能会认为，作为所有这些巨大事物的必然结果，空间通常也应该是广阔而空旷的，偶尔会有一个游离的氢原子在虚无的完美真空中疾驰而过，但没有什么比这更偏离真理了。\n因为&#39；空的空间不是什么&#39；一点也不空。它&#39；It’我们完全塞满了各种我们不知道的东西&#39；I don’我对奇怪的东西没有很好的理解，以至于我们甚至很难通过观察来了解它。事实上，如果科学家们做得对，结果是&#39；有这么多奇怪的东西，我们认为是&#34；正常&#34；宇宙中的物质组成宇宙中所有可观测物质的质子、中子和电子只占宇宙的一小部分&#39；总质量。\n我们把这些奇怪的东西叫做#34；暗物质&#34；因为它&#39；It’很难测量或观察到。尽管看不见，但正如保罗在视频中解释的那样，它确实无处不在；到处都是暗物质。那里&#39；现在有暗物质流过你的身体。但其中一个是暗物质#39；它的主要特征使它如此难以观察，事实上是它顽固地不愿意以几乎任何有意义的方式与&#34；正常&#34；课题\n（暗物质并不是世界各地大量存在的唯一奇怪的东西，&#39；这也是暗能量的末日恐怖，但我们正在为该系列的另一个视频节省暗能量。）\n我说暗物质顽固地不愿意与&#34；正常&#34；暗物质几乎以任何有意义的方式存在，但事实证明，暗物质确实以一种非常重要的方式与我们相互作用，那就是#39；通过地心引力。暗物质的引力与其质量成正比，就像&#34；正常&#34；这就是它最初被发现的原因。解释一系列大规模宇宙观测，包括星系围绕其中心黑洞核心旋转的方式的唯一方法是&#39；这是一堆我们可以&#39；我们不能直接观察，暗物质是唯一符合条件的东西。\n那里&#39；关于这种奇怪的、无法察觉的东西，还有很多需要了解的，包括我们&#39；我们离真正发现它越来越近了。如果你有几分钟的时间，请放松一下，享受Paul&#39；s关于宇宙之一的解释#39；这是最基本的奥秘。", "note_en": "Greetings, Arsians! We have something special for you today: the premiere of a new science series we&#39;re creating, called  Edge of Knowledge. We&#39;ve recruited physicist and author  Dr. Paul Sutter ( Google Scholar link) to be our host and guide on an eight-episode romp through the mysteries of the cosmos, touching on topics that we at Ars find fascinating. This means we&#39;ll have episodes on black holes, the future of climate change, the origins of life, and, one of my favorite topics for our premiere:  dark matter.\n  As Ars readers, you&#39;re all probably familiar with Douglas Adams&#39; &#34; Space is big&#34; opening to  The Hitchhiker&#39;s Guide to the Galaxy, but &#34;big&#34; only tells part of the story. You might assume that, as a corollary to all that bigness, space should also be generally vast and empty, with just an occasional stray hydrogen atom whipping its way through an otherwise perfect vacuum of nothingness—but nothing could be further from the truth.\n Because that&#39;s the thing—empty space isn&#39;t empty at all. It&#39;s absolutely chock full of all kinds of stuff we don&#39;t have a solid understanding of—stuff so weird that we have a difficult time even looking at it to try to learn about it. In fact, if scientists are doing their math right, it turns out that there&#39;s  so much of this weird stuff that what we think of as the &#34;normal&#34; stuff in the Universe—things like protons and neutrons and electrons that make up  all of the observable matter in the Universe—account for only a tiny fraction of the Universe&#39;s overall mass.\n    We call some of this weird stuff &#34;dark matter,&#34; because it&#39;s difficult-to-impossible to measure or observe. Despite its invisibility, it is truly ubiquitous—as Paul explains in the video, there&#39;s dark matter  everywhere. There&#39;s dark matter streaming through your body  right now. But one of dark matter&#39;s key features—the feature that makes it so difficult to observe, in fact—is its stubborn unwillingness to interact in almost any meaningful way with &#34;normal&#34; matter.\n (Dark matter isn&#39;t the only weird thing that exists in enormous abundance everywhere—there&#39;s also  the apocalyptic creepiness of dark energy, but we&#39;re saving dark energy for another video in the series.)\n  I say dark matter is stubbornly unwilling to interact with &#34;normal&#34; matter in  almost any meaningful way, but it turns out that there is one very important way in which dark matter  does interact with us, and that&#39;s through gravity. Dark matter exerts gravity proportional to its mass, just like &#34;normal&#34; matter, and this is what led to its initial discovery. The only way to explain a bunch of large-scale observations of the Universe—including the way galaxies rotate around their central black hole cores—is if there&#39;s a  whole buttload of mass floating around that we can&#39;t directly observe, and dark matter is about the only thing that fits the bill.\n There&#39;s lots more to learn about this weird undetectable stuff—including the ways in which we&#39;re getting closer to actually detecting it. If you have a few minutes, please kick back and enjoy Paul&#39;s explanations about one of the Universe&#39;s fundamental mysteries.", "posttime": "2022-02-15 13:17:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "范围,sutter,暗物质", "title": "质量缺失？不在我们的观察范围内——保罗·萨特博士解释暗物质", "title_en": "Missing mass? Not on our watch—Dr. Paul Sutter explains dark matter", "transed": 1, "url": "https://arstechnica.com/science/2022/01/learn-the-mysteries-of-dark-matter-with-ars-and-dr-paul-sutter/", "via": "", "real_tags": ["范围", "sutter", "暗物质"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天是超级碗周日，好莱坞传统上会为即将上映的高知名度电影和电视剧播放预告片。今年，乔丹·皮尔（Jordan Peele&#39；美国东部时间今天凌晨3点，这部即将上映的恐怖片《不》出人意料地播出。我们Ars Technica完全支持这部电影。\n我们有充分的信心。皮尔已经巩固了他作为目前发人深省的恐怖大师的地位，从出人意料的票房收入超过2.5亿美元的《走出去》开始，皮尔首次获得奥斯卡最佳原创剧本奖。《逃出去》是对种族紧张关系的微妙探索，它悄悄地揭示了其可怕的前提，并得出了不可避免的血腥结论。在Peele和#39；2019年的后续行动，美国，主题不是&#39；在皮尔&#39；的话，以各种方式&#34；我们是自己最大的敌人&#34;\n皮尔去年还与导演尼娅·达科斯塔合著了&#39；《坎迪曼》（Candyman）是一部令人激动的续集，它将20世纪90年代被称为坎迪曼（Candyman）的独特的杀戮者变成了一种永恒的恶毒，其诅咒随着时间的流逝而回荡。然后是&#39；s Peele和#39；《暮光之城》（The Twilight Zone）的重启，《欢迎来到布鲁姆豪斯》（Welcome to The Blumhouse）系列丛书中展示的各种电影，以及他&#39；s参与了Blumhouse的制作。\n所以男人的任何新项目&#39；我们欢迎他那聪明扭曲的头脑，而Nope看起来就像《走出去》和《我们》一样让人不可思议地回忆起来。Peele和#39的拖车；他的电影从不透露太多，因为他的电影的许多乐趣来自于它们经常出现的奇怪的曲折。我们不会&#39；我没有别的办法。到目前为止，我们对Nope的了解是丹尼尔·卡鲁亚（Daniel Kaluuya，因《脱身》（Get Out）获得奥斯卡提名）、凯克·帕尔默（Keke Palmer，Hustler，Black Panther）和史蒂文·杨（Steven Yeun，Minari，Okja）饰演&#34；居住在加利福尼亚内陆一个孤寂峡谷中的居民见证了一个神秘而令人毛骨悚然的发现&#34; 我们没有&#39；我甚至不知道这些字&#39；名字还没有。\n这部预告片提供的细节很少。首先，我们观看了19世纪摄影师艾德沃德·梅布里奇拍摄的历史片段。他是第一个在电影中不同阶段捕捉马匹的人，这是一项技术突破，帮助开创了电影业。（传说梅布里奇被要求为加利福尼亚州州长下注，州长坚持认为，当一匹马疾驰时，有一刻四只脚同时离开地面。另一个有趣的事实是：在19世纪类似O.J.辛普森（O.J.Simpson）的审判中，梅布里奇因杀害妻子的情人而被审判并无罪释放。）\n帕尔默和#39；s的角色似乎是《梅布里奇与39》中骑手的曾孙女；这是著名的片段。那&#39；这就是她所说的，因为她和一个明显忧郁的卡鲁亚正在为海伍德牧场拍摄广告，这是好莱坞第一个黑人拥有的驯马牧场&#34;我们喜欢说&#39；从照片可以移动的那一刻起，我们就在游戏中有了皮肤，&#39&#34; 她热情高涨。牧场偶尔会为任何愿意长途跋涉到荒无人烟的地方的人举办表演。\n它&#39；当我们回到海伍德牧场时，一切照旧，帕默在牧场小屋里跳舞，而郁郁寡欢的卡鲁亚则在黑暗中牵着一匹马。但随后天空变暗，电力中断，马惊慌失措地跑开了。一群挥舞着充气管的人神秘地放气&#39；你已经让人毛骨悚然了，在这种情况下更是如此。在拖车里&#39；在电影的最后一幕中，帕默惊恐地仰望天空，转过身来，然后跑向天空&#34;什么&#39；这是个糟糕的奇迹吗？我们有话要说吗&#34; 卡鲁亚很好奇。\n可能是。。。外星人？我的意思是，看起来很可能是外星人。牧场小屋不仅让人想起1977年的小屋&#39；这是第三种亲密接触，但牧场上有外星小饰品出售&#39；s纪念品亭。那是一只皱巴巴的外星人的手伸出去触摸一个人类的孩子#39；谁的手？或者，这可能只是更多的皮勒&#39；她喜欢聪明的误导，而我们&#39；我们会遇到更奇怪的事情。在学分开始之前，预计会有一些令人难以置信的转折。", "note_en": "Today is Super Bowl Sunday, when Hollywood traditionally drops trailers for upcoming high-profile films and TV series. This year, the marketing frenzy kicks off with the first trailer for Jordan Peele&#39;s forthcoming horror feature,   Nope, which dropped unexpectedly at 3 am EST today. We at Ars Technica are totally on board for this film.\n Our confidence is well-placed. Peele has cemented his status as the current master of thought-provoking horror, starting with   Get Out, his surprise box office hit that earned more than $250 million and snagged Peele an Oscar for best original screenplay—the first time the award has gone to a Black recipient.  Get Out is a subtle exploration of racial tensions that quietly reveals its horrifying premise and builds to an inevitably bloody conclusion. In Peele&#39;s 2019 follow-up,   Us, the theme wasn&#39;t so much racial tension—it was exploring,  in Peele&#39;s words, the myriad ways in which &#34;we are our own worst enemies.&#34;\n  Peele also co-wrote, with director Nia DaCosta, last year&#39;s electrifying sequel (of sorts),   Candyman, which transformed the singular 1990s slasher known as Candyman into an ageless malevolence whose curse reverberates through time. Then there&#39;s Peele&#39;s reboot of  The Twilight Zone, the various films showcased in the anthology series  Welcome to the Blumhouse, and the myriad other projects he&#39;s had a hand in with Blumhouse Productions.\n So any new project from the man&#39;s brilliantly twisted mind is welcome, and  Nope looks to be just as strangely evocative as  Get Out and  Us. Trailers for Peele&#39;s films never reveal too much, since much of the pleasure of his movies comes from their frequently bizarre twists. We wouldn&#39;t have it any other way. All we know thus far about  Nope is that Daniel Kaluuya (who was nominated for an Oscar for  Get Out), Keke Palmer ( Hustlers,   Black Panther), and Steven Yeun ( Minari,   Okja) play &#34;residents in a lonely gulch of inland California who bear witness to an uncanny and chilling discovery.&#34; We don&#39;t even know the characters&#39; names yet.\n  The trailer offers scant details. First off, we are treated to historic footage by 19th-century photographer  Eadweard Muybridge. He was the first person to capture a horse in different stages of its gallop on film—a technological breakthrough that helped pioneer the film industry. ( Legend has it that Muybridge was asked to settle a bet for the governor of California, who insisted that, when a horse gallops, there is a moment when all four feet are off the ground simultaneously. Another fun fact: Muybridge was tried and acquitted for killing his wife’s lover, in the O.J. Simpson-like trial of the 19th century.)\n    Palmer&#39;s character appears to be the great-great-great granddaughter of the rider featured in Muybridge&#39;s famous footage. That&#39;s what she claims as she and a distinctly glum Kaluuya are filming a commercial for the Haywood Ranch, the first Black-owned horse-training ranch serving Hollywood. &#34;We like to say, &#39;Since the moment pictures could move, we had skin in the game,&#39;&#34; she enthuses. The ranch occasionally stages performances for anyone willing to trek out to the middle of nowhere.\n  It&#39;s business as usual when we get back to Haywood Ranch, with Palmer dancing inside the ranch house while the still-glum Kaluuya hangs out in the dark with a horse. But then the sky darkens, the power goes out, and the horse bolts in panic. A bunch of inflatable waving tube men mysteriously deflate—they&#39;re already creepy, and even more so in this context. In the trailer&#39;s final scene, Palmer looks up at the heavens in horror, turns, and runs—only to be swept up into the sky. &#34;What&#39;s a bad miracle? We got a word for that?&#34; Kaluuya wonders.\n Could it be... aliens? I mean, it sure seems like it could be aliens. Not only is the ranch house evocative of the house in 1977&#39;s  Close Encounters of the Third Kind, but there are alien trinkets on sale at the ranch&#39;s souvenir kiosk. And is that a shriveled alien hand reaching out to touch a human child&#39;s hand? Alternatively, this might just be more of Peele&#39;s penchant for clever misdirection, and we&#39;re in for something even weirder. Expect a few mind-boggling twists either way before the credits roll.", "posttime": "2022-02-15 13:15:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "预告片,trailer,牧场", "title": "乔丹·皮尔的《不》的第一部诱人预告片让我们渴望更多", "title_en": "Tantalizing first trailer for Jordan Peele’s Nope leaves us eager for more", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/tantalizing-first-trailer-for-jordan-peeles-nope-leaves-us-eager-for-more/", "via": "", "real_tags": ["预告片", "trailer", "牧场"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就在超级碗开赛之际，漫威电影公司为即将上映的《疯狂的多元宇宙中的奇怪博士》推出了一部惊艳迷幻的新预告片。\n正如我&#39；我之前写过，我们知道新的Dr.Strange电影是在《蜘蛛侠：回家无路》、《万达视》和《洛基》第一季之后拍摄的。后者向我们介绍了时变权威（TVA），我们淘气的主人公遇到了来自不同时间线的多个版本，包括一个名为西尔维（Sophia di Martino）的女性化身。最后一集是与征服者康的一个变体的对峙，他一直控制着神圣的时间线，直到西尔维的冲动行为释放出比TVA所能删减的时间线更多的时间线，从而破坏了多元宇宙的稳定。\n如果…怎么办。。。？介绍给我们奇怪的至高无上，一个邪恶的替代版本史蒂文奇怪谁获得了巨大的权力，通过吸收其他神秘的存在，从而撕裂现实。《守望者》最终招募了奇异至尊作为多元宇宙的守护者之一，共同击败了奥创。至于没有回家的路，奇怪&#39；在这部电影中的多重宇宙干预将产生不可预见的影响，可能会在《疯狂的多重宇宙》中上演。\n从官方大纲来看：&#34；在《复仇者：终局》之后，斯蒂芬·斯特兰奇博士继续他对时间之石的研究。但是一个老朋友变成了敌人，他终止了自己的计划，并导致奇怪的人释放出难以形容的邪恶。与斯特兰奇博士一起进入未知世界，他在新旧神秘盟友的帮助下，穿越多元宇宙中令人费解和危险的交替现实，面对一个神秘的新对手&#34;\n我们看到了&#34；老朋友&#34；12月第一部预告片落下的时间有疑问：卡尔·蒙多（Chiwetel Ejiofor），奇怪&#39；他是一位神秘艺术大师，对秩序的幻想破灭了，现在他追捕其他法师以夺走他们的力量。当现实开始瓦解时，Strange寻找万达·马克西莫夫/猩红女巫（伊丽莎白·奥尔森饰）作为盟友。本尼迪克特·王（Benedict Wong）以王（Wong）的身份回归，现在是最高巫师（因为奇怪的人在拍摄照片后消失了五年），我们瞥见了瑞秋·麦克亚当斯（Rachel McAdams）&#39；克里斯汀·帕尔默医生穿着婚纱。\n这部新的预告片有很多相同的片段，但它放大了动作，因为来自其他维度的生物开始出现在克里斯汀的废墟上&#39；看来婚礼正在进行中。我们看到Mondo告诉Strange，他必须为干涉多元宇宙负责，然后是Strange被带到某种法庭的场景。\n我们可以更好地了解奇怪的Supreme（&#34；事情失控了…&#34；），看起来万达也可能会遇到另一个版本的自己，这可能会让她质疑自己对陌生人的忠诚&#34;你违反规则，你就成了英雄，&#34；万达说&#34;我做到了，我就成了敌人。这并不意味着&#39；这似乎不公平&#34; 此外，我们还可以简单地看到美国查韦斯（Xochitl Gomez），一个可以在不同维度之间旅行的青少年。那&#39；当现实正在瓦解时，它是一种方便的力量。\n至于那&#34；神秘的对手&#34-谁知道呢？但演员阵容中也包括迈克尔·斯图尔巴格饰演尼科迪马斯·韦斯特，他是《奇异》的对手外科医生熟人。他在第一部预告片中短暂出现，穿着燕尾服站在斯特兰奇身后。漫画的粉丝们会认出他是一名外科医生，他在事故发生后为“怪人”做了手术，但无法修复神经，使“怪人”走上了成为超级巫师的道路。在漫画中，韦斯特也在古老的长生不老药下训练，最终，当韦斯特偷走一种特殊的长生不老药时，两人发生了冲突——事实证明，这种遭遇对韦斯特来说是致命的。它&#39；这纯粹是猜测，但新预告片的特写镜头似乎是不匹配的眼睛，韦斯特生来就患有异色症（正如年轻的X教授所说，这是一种非常棒的突变）。", "note_en": "Marvel Studios dropped a spectacularly psychedelic new trailer for the upcoming   Doctor Strange in the Multiverse of Madness just as the Super Bowl was getting underway.\n  As I&#39;ve  written previously, we know that the new Dr. Strange film is set after the events of  Spider-Man:  No Way Home,   WandaVision, and the first season of   Loki. The latter introduced us to the Time Variant Authority (TVA), with our mischievous protagonist encountering multiple versions of himself from different timelines, including a female incarnation named Sylvie (Sophia di Martino). The finale featured a confrontation with a variant of Kang the Conqueror, who had been controlling the Sacred Timeline—until an impulsive act by Sylvie unleashed more timelines than the TVA could prune, destabilizing the multiverse.\n  What If...? introduced us to Strange Supreme, an evil alternate version of Steven Strange who gained enormous power by absorbing other mystical beings, thereby tearing reality apart. The Watcher eventually recruits Strange Supreme to be one of the Guardians of the Multiverse who collectively defeat Ultron. As for the events of  No Way Home, Strange&#39;s multiverse meddling in that film is going to have unforeseen repercussions that will likely play out in  Multiverse of Madness.\n From the official synopsis: &#34;After the events of  Avengers: Endgame, Dr. Stephen Strange continues his research on the Time Stone. But an old friend-turned-enemy puts an end to his plans and causes Strange to unleash unspeakable evil. Journey into the unknown with Doctor Strange, who, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.&#34;\n  We saw the &#34;old friend&#34; in question when the first trailer dropped in December: Karl Mondo (Chiwetel Ejiofor), Strange&#39;s fellow Master of the Mystic Arts, who grew disillusioned with the order and who now hunts down other mages to take away their power. Strange seeks out Wanda Maximoff/The Scarlet Witch (Elizabeth Olsen) as an ally as reality begins to unravel. Benedict Wong is back as Wong, now the Sorcerer Supreme (because Strange disappeared for five years in the wake of the Snappening), and we catch a glimpse of Rachel McAdams&#39; Dr. Christine Palmer in a wedding dress.\n    This new trailer has a good chunk of the same footage, but it amps up the action as creatures from other dimensions begin to appear—ruining Christine&#39;s wedding in the process, it seems. We see Mondo telling Strange that he must be held accountable for meddling with the multiverse, followed by scenes of Strange in chains being brought before some kind of tribunal.\n  We get a better look at Strange Supreme (&#34;Things got out of hand...&#34;), and it looks like Wanda, too, might encounter another version of herself, which could cause her to question her loyalty to Strange. &#34;You break the rules, you become a hero,&#34; Wanda says. &#34;I do it, I become the enemy. That doesn&#39;t seem fair.&#34; Plus, we get the briefest glimpse of America Chavez (Xochitl Gomez), a teenager who can travel between dimensions. That&#39;s a handy power to have when reality is unraveling.\n As for that &#34;mysterious adversary&#34;—who knows? But the cast also includes Michael Stuhlbarg as Nicodemus West, a rival surgeon acquaintance of Strange. He appeared briefly in the first trailer, standing just behind Strange in a tuxedo. Fans of the comics will recognize him as the surgeon who operated on Strange after his accident but who was unable to repair the nerves, putting Strange on the road to becoming Sorcerer Supreme. In the comics, West also trains under the Ancient One, and ultimately the two clash when West steals a special elixir—an encounter that proved fatal for West. It&#39;s pure speculation, but the new trailer has a closeup of what appears to be mismatched eyes, and West was born with  heterochromia (a  very groovy mutation, as the young Professor X would say).", "posttime": "2022-02-15 13:13:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "怪人,strange,奇怪", "title": "《疯狂的多元宇宙》预告片中的新怪人医生是一种迷幻疗法", "title_en": "New Doctor Strange in the Multiverse of Madness trailer is a psychedelic treat", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/the-doors-to-other-dimensions-open-in-latest-multiverse-of-madness-trailer/", "via": "", "real_tags": ["怪人", "strange", "奇怪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从2019冠状病毒疾病爆发以来，两年来，很多事情发生了变化。例如，想想现在有多少人知道快速抗原检测和核酸扩增检测之间的区别。是否为&#39；对于工作、旅行，或者仅仅是心灵的平静，我们中的很多人都比以前更加熟悉鼻腔穿刺。\n事实上，新冠病毒诊断甚至在昨天入侵#39；s超级碗的广告是一家名为Cue Health的公司提供的配备LED的白色小盒子。该公司开发了一种快速、准确的家庭诊断测试，多亏了一种由医生监督的监查模式，其结果将被国际旅行等项目所接受。\n对于那些没有&#39；我无法从他们的LFT中了解他们的PCR，这里是#39；这是一个快速入门。快速抗原测试（有时也称为侧向流动测试）从病毒表面寻找特定蛋白质。这些测试相对便宜，易于使用。他们&#39；他们是州政府和联邦政府免费提供给人们的那种人。然而，尽管快速抗原检测在检测病毒抗原的存在方面相当准确，但它们可能会产生假阴性，因此疾病控制和预防中心认为抗原阴性检测是a&#34；假定的&#34；后果\n另一种2019冠状病毒疾病检测检测出SARS COV-2病毒的一些核酸序列。你&#39；我可能听说这些被称为逆转录聚合酶链反应或RT PCR。RT-PCR检测的第一步不是直接检测鼻拭子的内容物，而是将样本中的任何病毒RNA转录成DNA（RT步骤），然后放大检测结果（PCR位）。\n这些检测通常比快速抗原检测更敏感，它们&#39；我们不太可能返回假阴性结果。但正如任何分子生物学家都能告诉你的那样，它们需要更多的专注和专注来进行研究。你还需要一些专门的设备和昂贵的试剂，所以PCR检测对于快速周转检测来说可能非常昂贵，在75美元到300美元之间。事实上，它&#39；将这第二类测试称为核酸扩增测试（NAAT）更准确。那&#39；因为实际上有更多的方法来放大你所需要的核酸；我们寻找的不仅仅是PCR，还有一些人不&#39；不要像PCR那样对样本进行热循环。\n提示健康使用了一种所谓的等温核酸扩增方法进行测试，这是急诊科授权的非处方家庭使用的食品和药物管理局于2021年3月。我们应该期待2019冠状病毒疾病的健康诊断系统的其他分子诊断测试，但它现在只运行COVID-19测试。\n测试是在恒温下进行的，所以测试阅读器不是一台笨重的台式机来循环温度，而是一个几英寸长、一英寸左右高的小盒子。实际样本本身在一个较小的（一次性）盒带中放大，盒带插入读卡器。", "note_en": "Plenty of things have changed in the two years since the start of the COVID-19 pandemic. For example, think about how many people now know the difference between a rapid antigen test and a nucleic acid amplification test. Whether it&#39;s for work, travel, or just peace of mind, a lot of us are a lot more familiar with having our nasal cavities poked than we used to be.\n In fact, COVID diagnostics even invaded yesterday&#39;s Super Bowl with an advertisement for a small LED-equipped white box from a company called Cue Health. The company has developed a fast and accurate at-home diagnostic test, and thanks to a proctored mode, in which your test is supervised by a doctor, its results will be accepted for things like international travel.\n  For those who  don&#39;t know their PCRs from their LFTs, here&#39;s a quick primer. A rapid antigen test (also sometimes called a lateral flow test) looks for certain proteins from the surface of the virus. These tests are relatively cheap to produce and easy to use. They&#39;re the kind that state and federal governments  have made available to people for free. However, while rapid antigen tests are pretty accurate at detecting the presence of viral antigens, they can produce false negatives, so  the Centers for Disease Control and Prevention considers a negative antigen test to be a &#34;presumptive&#34; result.\n    The other kind of COVID-19 test detects some of the actual nucleic acid sequence of the SARS-CoV-2 virus. You&#39;ve probably heard these referred to as reverse-transcriptase  polymerase chain reaction or RT PCR. Instead of simply directly assaying the contents of your nose swab, the first step with RT PCR tests is to transcribe any viral RNA in the sample into DNA (the RT steps) and then amplify that result for detection (the PCR bits).\n  These tests are generally more sensitive than rapid antigen tests, and they&#39;re less likely to return a false negative result. But as any molecular biologist can tell you, they require more focus and concentration to conduct. You also need some specialized equipment and costly reagents, so PCR tests can be quite expensive—between $75 and $300 for a rapid-turnaround test. In fact, it&#39;s more accurate to call this second class of tests nucleic acid amplification tests (or NAATs). That&#39;s because there are actually more ways of amplifying the nucleic acids you&#39;re looking for than just PCR, and some don&#39;t involve heat-cycling the samples the way that PCR does.\n Cue Health uses one of these so-called  isothermal nucleic acid amplification methods for its test, which was given an emergency use authorization for non-prescription home use  by the Food and Drug Administration in March 2021. In time, we should expect to see other molecular diagnostic tests developed for the Cue Health system, but it just runs COVID-19 tests for now.\n The test is designed to work at a constant temperature, so instead of a bulky desktop machine that cycles the temperature, the test reader is a small box a couple of inches long and an inch or so high. The actual sample itself is amplified in a smaller (disposable) cartridge that slots into the reader.", "posttime": "2022-02-15 13:11:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,新冠病毒,新冠,covid,测试", "title": "多亏了健康提示，在家检测新冠病毒变得更加聪明", "title_en": "At-home COVID testing just got a lot smarter thanks to Cue Health", "transed": 1, "url": "https://arstechnica.com/science/2022/02/at-home-covid-testing-just-got-a-lot-smarter-thanks-to-cue-health/", "via": "", "real_tags": ["病毒", "新冠病毒", "新冠", "covid", "测试"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073426, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1月11日下午12:24，演员兼企业家里斯·威瑟斯彭（Reese Witherspoon）向她的290万推特粉丝发布了一则惊人的消息。“在不久的将来，每个人都将拥有一个平行的数字身份，”她写道。“化身、加密钱包、数字商品将成为常态。你有计划吗？”\n最后一句话引起了一种紧迫感。metaverse就要来了，是她的留言吗，而你还没有收拾好行囊？\n威瑟斯彭的推文发布之际，人们强烈反对名人为虚拟世界喝彩，并将他们的粉丝推向网络货币。多年来，我们一直因为没有把所有现金储备都转移到比特币和胡闹上而受到加密专家的抨击，这已经够糟糕的了。“比特币亿万富翁”泰勒·温克列沃斯（Tyler Winklevoss，和他的孪生兄弟卡梅伦，自从回到哈佛被马克·扎克伯格（Mark Zuckerberg）用朋克攻击以来，表现得非常出色）的推特历史是一场无休止的FOMO宣传攻势，传递着区块链佛陀神秘的假智慧。他最近在推特上写道：“因为比特币，宇宙将永远不一样。”。明白了吗，上帝？\n实际从事加密业务的人提供的此类自利投资建议很容易被注销。但现在，名人们不断涌现，人们也注意到了这一点。令人毛骨悚然的马特·达蒙（Matt Damon）广告将加密投资者比作探索星星或攀登珠穆朗玛峰（据推测是桑迪·皮特曼（Sandy Pittman）之前）的英雄，这则广告被无休止地无情地解构。（就连南方公园也受到了欢迎。）每个人都讨厌吉米·法伦和帕丽斯·希尔顿在《今夜秀》的片段中用他们无聊的猿猴来烦我们。威瑟斯彭本人也因持有NFT股份，以及她的兴趣是作为投资者还是发起人而受到批评。\n与其说我对威瑟斯彭的不可替代代币感兴趣，不如说我对她不祥的公众警报更感兴趣，她警告我们需要应对即将到来的转变，比如现在。随着新冠病毒、通货膨胀和Lady Gaga的奥斯卡冷落，生活压力已经足够大了。我们现在是否也必须担心我们的化身落后了？metaverse会像《别抬头》中的彗星一样击中我们，让我们像生活在太平洋西北部的可怜的灵魂一样悲惨地被吞噬，当卡斯卡迪亚断层地震时，他们可能正处在致命海啸的路径上？我们是否应该从苹果电视早间秀的明星身上吸取教训，放下一切，开始我们的计划？", "note_en": "At 12:24 pm on January 11, the actor and entrepreneur Reese Witherspoon made a startling announcement to her 2.9 million Twitter followers. “In the (near) future, every person will have a parallel digital identity,” she  wrote. “Avatars, crypto wallets, digital goods will be the norm. Are you planning for this?”\n That final line struck a note of urgency. The metaverse is coming, was her message,  and you haven’t packed your go bag yet?\n Witherspoon’s tweet arrived amid a backlash against celebrities cheerleading the virtual world and pushing their fans into cyber currency. It was bad enough that for years we had been pummeled by crypto dudes for not diverting all of our cash reserves to bitcoin and HODLing no matter what. The Twitter history of “ Bitcoin Billionaire” Tyler Winklevoss (who, with his twin bro, Cameron, has done very well since being punked by Mark Zuckerberg back at Harvard) is an endless barrage of FOMO pitches, delivered with the enigmatic faux-wisdom of a blockchain Buddha. “Because of bitcoin, the universe will never be the same,” he  tweeted recently. Got that, God?\n    Such self-interested investment advice by those in the actual crypto business can easily be written off. But now the celebrities are piling on, and people are noticing. The creepy  Matt Damon commercial where he likens crypto investors to heroes who explore the stars or scale Everest (pre- Sandy Pittman, presumably) has been  endlessly and  unkindly  deconstructed. (Even South Park  got its licks in.) Everyone  hates on that  Tonight Show clip where Jimmy Fallon and Paris Hilton  bore us with their bored apes. Witherspoon herself has  been critiqued for her  NFT holdings, and whether her interest is as an investor or promoter.\n I’m less interested in Witherspoon’s non-fungible tokens than her ominous public alert of an impending shift that we need to deal with, like, now. Life is stressful enough with Covid, inflation, and Lady Gaga’s  Oscar snub. Do we now also have to worry that we’re behind on our avatars? Will the metaverse hit us like that comet in  Don’t Look Up, leaving us tragically engulfed like the poor souls living in the Pacific Northwest who may be in the path of a  deadly tsunami when the Cascadia fault quakes? Should we take a cue from the star of Apple’s TV’s  Morning Show and drop everything to begin our planning?", "posttime": "2022-02-15 13:10:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发疯,reese,加密", "title": "别让瑞茜·威瑟斯彭让你发疯", "title_en": "Don’t let Reese Witherspoon make you crazy", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/celebrity-cheerleaders-keep-urging-us-to-dive-into-crypto-metaverse/", "via": "", "real_tags": ["发疯", "reese", "加密"]}]