[{"category": "", "categoryclass": "", "imagename": "95d2844246a4ba2ec9d9731602a83f8d.png", "infoid": 1007324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉不仅仅制造汽车。该公司还设计、制造和安装太阳能电池板--既有传统的太阳能电池板，也有看起来像普通屋顶瓦的模块。虽然后者看起来可能是一条更主流地采用可再生能源的途径，但前者仍然是太阳能行业的首选解决方案。特斯拉已经将其太阳能电池板更新为效率提高了约10%，并降低了价格。考虑到面板的大小和设计仍然完全相同，这是一个相当令人印象深刻的改进。\n根据electrek的数据，特斯拉在更新之前对其中型面板的评级为7.56千瓦，但现在被列为8.16千瓦。价格也从19,500美元(未扣除联邦激励措施)降至16,000美元。效率的提高，再加上超过17%的价格下跌，可能会说服相当多的房主转向太阳能。\n然而，对于特斯拉的太阳能部门来说，并不是一切都很美好。一些太阳能电池板引发了火灾--一起发生在沃尔玛商店，另一起发生在亚马逊仓库。该公司最近还取消了长达数年的太阳能屋顶瓦预购。希望这些效率更高的小组不会有任何重大问题。", "note_en": "Tesla doesn’t just make cars. The company also engineers, manufactures and installs  solar panels -- both the traditional kind and modules that look like ordinary roof tiles. And while the latter seems like it could be a path to more mainstream adoption of renewable energy, the former is still the go-to solution for the solar industry. Tesla has updated its panels to be about 10 percent more efficient, and has also lowered its prices. Given that the sizes and designs of the panels are still exactly the same, that’s a pretty impressive improvement.\n According to  Electrek, Tesla rated its medium-sized panel at 7.56 kW before the update, but it’s now listed as 8.16 kW. The price has also dropped from $19,500 (before federal incentives) to $16,000. That bump in efficiency, combined with an over 17 percent price drop, could convince a decent amount of homeowners to make the jump to solar power.\n  Not everything has been dandy for Tesla’s solar division, though. A few solar panels have caused fires -- one at a  Walmart store and another at an  Amazon warehouse. The company also recently  canceled years-long preorders for its solar roof tiles. Hopefully these more efficient panels don’t have any major issues.", "posttime": "2020-06-20 05:34:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,电池板,solar,太阳能", "title": "特斯拉的太阳能电池板现在效率更高，价格也更实惠", "title_en": "Tesla's solar panels are now more efficient and affordable", "transed": 1, "url": "https://www.engadget.com/tesla-solar-panel-efficiency-update-144914935.html", "via": "", "real_tags": ["特斯拉", "电池板", "solar", "太阳能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1990年12月14日，Apogee Software的斯科特·米勒(Scott Miller)上传了他公司最新剧集游戏的免费第一期。他知道，如果你不介意这个双关语的话，他知道这个版本将会改变阿波吉的游戏规则。为了表明这是一款真正的下一代Apogee游戏，他将标准付费剧集的要价提高了一倍，从7.50美元增加到15美元。\n而不是依赖于Apogee以前游戏中的人物图形或块状的视觉抽象，“指挥官基恩1：被困在火星上”是一场充满弹性色彩的动画盛宴。它看起来不像五到十年前的典型拳击游戏，而是看起来完全不像以前在基于MS-DOS的计算机上看到的任何东西。至少在展示方面，它不亚于电脑游戏对超级马里奥兄弟(Super Mario Bros.)的回应。超级马里奥兄弟(Super Mario Bros)是一款标志性的特许经营游戏，帮助任天堂仅在美国就售出了超过3000万台视频游戏机。\n然而，即使是米勒，他的远见也经常受到公正的赞扬，他认识到，许多电脑所有者渴望的东西与大型游戏发行商提供的东西明显不同，但即使是米勒，也很难想象到这个特殊时刻的全部历史重要性。因为它向世界介绍了一小群衣衫褴褛的格格不入的人，态度恶劣，一些严肃的技术印章，他们当时在路易斯安那州什里夫波特的一座破旧的河边房子里一起生活和工作。几个月后，他们将开始称自己为id Software，在这个名字下，他们将在20世纪90年代重塑主流游戏的面貌。\n我必须承认，在两篇文章中第二次写到卑微的什里夫波特，我觉得有点奇怪。这肯定不是人们寻找一群技术革命者的第一个地方。这座拥有20万人口的城市一直在苦苦挣扎，长期以来一直是困扰整个路易斯安那州的问题的缩影，路易斯安那州是美国最贫穷的州之一。这是一个破败不堪的默默无闻的地方，到处都是破旧的露天购物中心和倒塌的房屋，新奥尔良的所有犯罪和贫困都没有，但该市丰富的文化炖菜都没有作为补偿。\n什里夫波特的生活一直被流经小镇的红河所定义。顾名思义，在国家的河流被铁路和高速公路取代之前，这座城市是为了充当港口而建的。当那段时间结束时，什里夫波特不得不为它的河流寻找其他用途：由于路易斯安那州法律的一个怪异之处，即赌场在水路上合法，但在陆地上不合法，德克萨斯州东北部和阿肯色州南部的居民长期以来一直知道，它主要是合法赌博最方便的地方。每天从赌场资助的巴士上爬出来的衣衫褴褛的州际赌徒绝不是拉斯维加斯传说中的豪赌分子。他们只是普通的工薪阶层，他们真的，真的应该找些更健康的事情来利用他们的时间和金钱，而不是坐在河船赌场的独臂土匪后面，把一个接一个的硬币扔进投币口，用呆滞的眼睛盯着轮子转来转去。这张照片更像是什里夫波特一般的社会和经济状况。\n到了1989年，什里夫波特软盘出版公司的Al Vekovius开始担心，同样的形象可能会代表他的业务状况。在这十年的大部分时间里都在戏剧性地扩张之后，软盘现在只是为了保住现有的订户基础而苦苦挣扎，更不用说增加订户数量了。它们最早的两本磁盘杂志--最初的Softdisk和Loadstar，迎合了现在即将停产的老式8位电脑的需求，而分别针对MS-DOS电脑和苹果Macintosh的Big Blue Disk和Diskworld未能占据他们所有的闲置时间。一切似乎都在对软盘不利。1989年夏天，IBM威胁称，如果软盘继续以该名称销售一本磁盘杂志，IBM将提起诉讼。IBM的公司长期绰号“大蓝”(Big Blue)一直是“大蓝盘”(Big Blue Disk)这个名称的来源。软盘知道不会违抗一家规模是他们一千倍的公司，因此觉得有必要每月将大蓝盘更名为不那么朗朗上口的磁盘。\n虽然失去来之不易的品牌认知度总是让人痛苦，但软盘的真正问题要比一个法律部门臃肿的巨型企业要大得多，潜在的问题也更棘手。事实是，人们与软盘现在迎合的较新计算机的关系往往与他们友好的小苹果II或Commodore 64之间的关系不同。在微软占统治地位的时代，成为一名计算机用户对他们中的大多数人来说不再是一种爱好，更不用说一种生活方式了。人们对软盘杂志提供的摇摇欲坠但容易被黑客攻击的实用程序和编码样本的渴求有所减少\n因此，在1990年初的那一天，他接受了这一建议，当时他的一位生产力最高、但任性的程序员，一个名叫约翰·罗梅罗(John Romero)的身材魁梧的年轻金属头，建议软盘创办一本新的MS-DOS磁盘杂志，专门致力于游戏-在这个地方，由于Apogee的成功仍处于早期阶段，共享软件还没有明确地切入软盘的商业模式。经过一番反复，两人同意出版一份名为“玩家边缘”(Gamer‘s Edge)的双月刊，每期至少有一款--最好是两款--原创游戏。为了实现这一目标，罗梅罗将被允许召集其他几个愿意以令人震惊的速度工作几个小时的人一起制作游戏，除了自己之外，没有任何资源，只需要很少的钱。谁会拒绝那样的提议呢？\n最终团结在罗梅罗周围的团队包括程序员汤姆·霍尔(Tom Hall)、艺术家阿德里安·卡马克(Adrian Carmack)和业务经理兼房间里的象征性成年人杰伊·威尔伯(Jay Wilbur)。但他们的秘密武器，被威尔伯从密苏里州堪萨斯城引诱到什里夫波特，是一位名叫约翰·卡马克的杰出的年轻程序员。(这证明任何说“我不相信巧合”的人都是胡说八道，约翰实际上与阿德里安·卡马克(Adrian Carmack)没有血缘关系，尽管他的姓氏并不常见。)。约翰·卡马克将证明自己是如此出色的程序员，以至于罗梅罗和霍尔(按照大多数人的标准，他们自己在那个部门都不是无精打采的人)会学会把重担留给他的天才，只对游戏中不太重要的部分以及他们用来构建游戏的实用程序进行编码-而且他们还会设计游戏，因为实际上卡马克对作为最终目标的代码的数学抽象更感兴趣，而不是它带来的游戏。\n但所有这些年轻人，从现在开始我就称他们为id男孩，只是因为这个名字很适合他们，甚至在他们创建id Software之前，他们对我们的故事或多或少都将是重要的。因此，我们应该简短地与他们每个人见面。\n到目前为止，杰伊·威尔伯是小组中最平易近人、最不令人畏惧的成员。他已经到了30岁的高龄，带来了一套更丰富的生活经历，让他愿意也能够与更多不同的人交谈。的确，威尔伯的闲聊技巧颇具传奇色彩。当他在家乡罗德岛州上大学时，他在当地的TGI星期五酒吧经营酒吧，在那里，他将饮料与杂技“天赋”混合在一起的能力使他成为被选中向汤姆·克鲁斯传授电影“鸡尾酒”交易诀窍的人之一。但他对在一次摩托车事故后用保险赔付购买的Apple II的热爱最终克服了他对夜生活的热爱，他接受了罗德岛一家名为UPTime的磁盘杂志的工作。1988年，当该公司被软盘收购时，他最终来到什里夫波特，在那里担任编辑。他在照看酒吧时学到的人际交往技能永远不会抛弃他；当然，他在Gamer‘s Edge的新指控非常需要这些技能，因为即使按照黑客的标准，他们也是一群粗暴的人物。\n这些人喜欢重金属和动作片，对他们狭隘的文化和技术兴趣范围之外的任何东西都持尖锐的蔑视态度。他们专注于自己的一小部分痴迷，这将被证明是他们最大的优势之一，尽管从长远来看，这对游戏写作来说可能是有问题的，因为这缩小了游戏可以做的和可以成为的范围。\n然而，即使是这支在威尔伯仁慈的管理下为“玩家边缘”制作游戏的四人乐队，也不是一个庞然大物。一旦人们开始将他们作为个体来看待，差异的阴影很快就会显现出来。\n和威尔伯一样，25岁的威斯康星州人汤姆·霍尔(Tom Hall)也是一个拥有大学学位的中产阶级孩子，但他没有他的朋友和同事对大众的随意友好。他生活在一个由星球大战电影(第一部他在影院看了33次)和“银河系漫游指南”(他几乎可以发自内心地背诵)组成的幻想世界里。在软盘公司，他在决定不能忍受公司数据处理工作的想法后来到了软盘公司，他跑来跑去，用一种刻薄的虚构的外星人语言说：“Bleh！哎呀！哎呀！“。他是那种你要么觉得好笑，要么被激怒得发疯的人。\n21岁的阿德里安·卡马克也生活在幻想的世界里，但他的幻想有一种更黑暗的色彩。他在什里夫波特长大，花了很多时间在拱廊上，与其说是被游戏本身吸引，不如说是被橱柜上耸人听闻的艺术品所吸引。他在一家医院当了一段时间的助手，然后回家一丝不苟地画出枪伤、断肢和溃烂的褥疮。他选择了一只蝎子作为宠物，而不是猫或狗。他来到索夫\n尽管如此，出于对其他人的所有应有的尊重，id男孩最主要的定义将是他们的两个约翰。22岁的约翰·罗梅罗(John Romero)是一个纯粹的本色，一壶混乱的能量一直在溢出，向四面八方喷出F-炸弹；具有开创性意义的历史巨著《末日大师》(Master Of Doom)的作者大卫·库什纳(David Kushner)令人难忘地将他描述为“人类的感叹号。”不到20岁的约翰·卡马克(John Carmack)和罗梅罗(Romero)一样安静、冷漠，经常是令人不安的；桑迪·彼得森(Sandy Petersen)是一名游戏设计师，稍后将在我们的故事中与他合作，他记得第一次见到卡马克后沉思着说，“他对人类的想法和感受一无所知。”\n然而，尽管表面上有许多不同之处，但两位约翰有很多共同之处。两人都是在破碎的家庭中长大的：罗梅罗在萨克拉门托地区长大时受到继父的身体虐待，而卡马克则在堪萨斯州一所严格的私立天主教学校的肉体和心理严酷之下受苦。两人都因犯下轻微罪行等而叛变；卡马克在14岁时因使用自制炸弹闯入学校而被判在男孩拘留中心服刑一年。(采访他的警官的案例笔记呼应了桑迪·彼得森后来的印象：“男孩的行为就像一个行走的大脑…。对其他人没有同情心。“)。\n两人都通过数字手段找到了摆脱困境的方式：首先是通过当地游戏厅的视频游戏，然后是通过他们通过钩子或骗子获得的Apple II电脑。(卡马克的第一台电脑是偷来的，是从一辆卡车后座上买来的。)。他们很快就自学了足够好的编程能力，让专业人士相形见绌。\n罗梅罗让纸质杂志定期将他的游戏作为打字清单发表，然后利用这一点在磁盘杂志Uptime找到了一份工作，在那里他与杰伊·威尔伯(Jay Wilbur)成为了朋友。在那之后，他找到了一份工作，为Ultima成名的Origin Systems公司做游戏搬运工。与此同时，当罗梅罗在Origin时，威尔伯转向了软盘。当罗梅罗发现自己对搬运工的生活感到厌烦时，他也来到什里夫波特和他的朋友会合。\n约翰·卡马克(John Carmack)比罗梅罗小两岁多，社会挑战更大，当他成为唯一一个专门受雇在Gamer‘s Edge工作而不是从软盘的另一部分调到那里的身份识别男孩时，他带着一份较短的简历来到了什里夫波特。他的游戏大多以每台1000美元的价格出售给他家附近的一家名为Nite Owl Productions的小夫妻店，这家公司让这些游戏成为为Apple II主板提供更换电池的主营业务的副业。但他也把一两款游戏卖给了软盘公司的杰伊·威尔伯(Jay Wilbur)。发现这些非常令人印象深刻，ID男孩们要求威尔伯利用他的巨大魅力为玩家的边缘招募新的孩子。经过齐心协力，他成功了。\n对于参与其中的年轻人来说，游戏边缘远远不仅仅是一份新工作或工作场所的转移。这是一种召唤；他们几乎每天都在彼此的陪伴中度过。威尔伯汇集了他们所有微薄的工资，在红河边租了一套杂乱无章的旧房子，有四间卧室，配有按摩浴缸、游泳池和船甲板，很快他就用一艘破旧的摩托艇补充了这一点。这是一种动物之家的生活方式，在马拉松黑客会议期间烧烤、滑雪和喝啤酒，以披萨和汽水为燃料。威尔伯-在很多方面都是这个故事中的无名英雄-扮演着他们溺爱的训导员，一直开着灯，地下室的啤酒桶装满了水，冰箱里堆满了汽水和垃圾食品，披萨全天候都在送来。\n对于第一期的“玩家边缘”，两位约翰同意各自将他们的一款苹果II旧游戏移植到MS-DOS上。罗梅罗选择了一个名为危险戴夫的平台，而卡马克选择了一个自上而下的动作冒险游戏，名为Catacomb。他们争先恐后地看谁能第一个完成比赛；就在输得相当彻底之后，罗梅罗意识到，他不能指望作为一个纯粹的程序员与卡马克竞争，他可能应该把编码中最复杂、最数学密集的方面留给他的朋友，而他则专注于所有其他构成一场好游戏的事情。对于第二个问题，两个约翰集合了他们的才华和其他人的才华，制作了一个完全原创的枪击事件，名为SLordax：未知的敌人。到现在为止还好。\n然后约翰·卡马克出现了第一个伟大的技术奇迹--许多奇迹中的第一个将以尽可能好的方式不断颠覆id男孩们正在研究的一切。要全面解释这第一个奇迹，需要一点背景知识。\n虽然他们在为MS-DOS制作游戏，但ID男孩们对1990年为该平台制作的大多数其他游戏的高概念主题几乎没有什么用处；复杂的模拟和精心制作的互动电影对他们都没有任何帮助。他们更喜欢简单、发自内心、节奏快、最重要的是动作丰富的游戏。很能说明问题的是，这些天他们更喜欢玩的大多数游戏都是在任天堂娱乐系统上玩的，而不是个人电脑。\n这两个平台之间的设计美学差异很大程度上是文化上的，但也有更多的不同之处。正如我在这些文章中经常不厌其烦地指出的那样，任何给定平台上的游戏的性质总是强烈地受到该平台的技术优势和劣势的影响。\n当第一次看到NES和1990年的MS-DOS个人电脑时，人们可能会认为后者是如此彻底地超过了前者，以至于进一步的比较是没有意义的。NES是围绕MOS 6502的一个版本建造的，MOS 6502是一款可以追溯到20世纪70年代的8位CPU，时钟速度不到2 MHz；最先进的PC有一个32位CPU，运行速度在25 MHz或更高。NES只有2K的可写通用存储器；PC可能有4MB或更多，外加一个大硬盘。NES最多可显示48种调色板中的25种颜色，分辨率为256 X 240；配备VGA显卡的PC最多可显示262,000种调色板中的256种颜色，分辨率为320 X 200。当然，PC可以毫不费力地做NES能做的任何事情。对吗？\n嗯，不，事实上。用于个人电脑的VGA图形标准是IBM在1987年创建的，着眼于呈现清晰的通用显示器，而不是游戏。在一支才华横溢的像素艺术家团队手中，它可以呈现令人垂涎三尺的静态插图，就像赛拉(Sierra)、卢卡斯艺术(LucasArts)和传奇(Legend)等冒险游戏工作室所证明的那样。但它绝对没有提供快速动画的辅助工具，也没有任何形式的图形加速。它只是给程序员提供了一大块内存，其字节表示屏幕上的像素。当她想要改变这些像素时，她必须用主力来摆动所有的字节，除了CPU的强大功能之外，什么都不用。PC上的所有动画基本上都是翻页动画，需要CPU以每秒20或30帧的速度重新绘制内存中每帧的每个像素，这对于创建相对流畅的运动印象是必要的，同时还需要为游戏的所有其他方面找到循环。\n另一方面，NES的图形系统是为呈现视频游戏而设计的-在电气工程中，专业化几乎总是提高效率。它不是将屏幕内容以线性像素数组的形式存储在内存中，而是在平铺级别上操作，每个平铺的大小分别为8X8或8X16像素。在定义了一组瓷砖中每一块的外观后，程序员可以在屏幕上随心所欲地混合和匹配它们，这要归功于控制台的定制显示电路，速度相当快；这使得超级马里奥兄弟(Super Mario Bros)等游戏的滚动变得流畅。她还有多达64个精灵要处理；这些都是由显示硬件叠加在平铺背景上的8X8或8X16的小图像，只需更改几个寄存器中的几个数字，就可以几乎瞬间移动。换句话说，它们非常适合显示超级马里奥在滚动的背景上跳来跳去的画面。\n..", "note_en": "On December 14, 1990, Scott Miller of Apogee Software uploaded the free first installment of his company’s latest episodic game. He knew as he did so that this release would be, if you’ll pardon the pun, a game changer for Apogee. To signal that this was truly a next-generation Apogee game, he doubled his standard paid-episode asking price from $7.50 to $15.\n Rather than relying on the character graphics or blocky visual abstractions of Apogee’s previous games,  Commander Keen 1: Marooned on Mars was an animated feast of bouncy color. Rather than looking like a typical boxed game of five to ten years earlier, it looked quite literally like nothing that had ever been seen on an MS-DOS-based computer before. In terms of presentation at least, it was nothing less than computer gaming’s answer to  Super Mario Bros., the iconic franchise that had done so much to help  Nintendo sell more than 30 million of their videogame consoles in the United States alone.\n Yet even Miller, who has been so often and justly lauded for his vision in recognizing that many computer owners were craving something markedly different from what the big game publishers were offering them, could hardly have conceived of the full historical importance of this particular moment. For it introduced to the world a small group of scruffy misfits with bad attitudes and some serious technical chops, who were living and working together at the time in a rundown riverfront house in Shreveport, Louisiana. Within a few months, they would begin to call themselves id Software, and under that name they would remake the face of mainstream gaming during the 1990s.\n  I must admit that I find it a little strange to be writing about humble Shreveport for the second time in the course of two articles. It’s certainly not the first place one would look for a band of technological revolutionaries. The perpetually struggling city of 200,000 people has long been a microcosm of the problems dogging the whole of Louisiana, one of the poorest states in the nation. It’s a raggedly anonymous place of run-down strip malls and falling-down houses, with all of the crime and poverty of New Orleans but none of that city’s rich cultural stew to serve as compensation.\n Life in Shreveport has always been defined by the Red River which flows through town. As its name would imply, the city was founded to serve as a port in the time before the nation’s rivers were superseded by its railroads and highways. When that time ended, Shreveport had to find other uses for its river: thanks to a quirk of Louisiana law that makes casinos legal on waterways but not on dry land, residents of northeastern Texas and southern Arkansas have long known it primarily as the most convenient place to go for legal gambling. The shabbily-dressed interstate gamblers who climb out of the casino-funded buses every day are anything but the high rollers of Vegas lore. They’re just ordinary working-class folks who really, really should find something more healthy to do with their time and money than sitting behind a one-armed bandit in a riverboat casino, dropping token after token into the slot and staring with glazed eyes at the wheels as they spin around and around. This image rather symbolizes the social and economic condition of Shreveport in general.\n By 1989, Al Vekovius of Shreveport’s Softdisk Publications was starting to fear that the same image might stand in for the state of his business. After expanding so dramatically for much of the decade, Softdisk was now struggling just to hold onto its current base of subscribers, much less to grow their numbers. The original  Softdisk and  Loadstar, their two earliest disk magazines, catered to aged 8-bit computers that were now at the end of their run, while  Big Blue Disk and  Diskworld, for MS-DOS computers and the Apple Macintosh respectively, were failing to take up all of their slack. Everything seemed to be turning against Softdisk. In the summer of 1989, IBM, whose longstanding corporate nickname of “Big Blue” had been the source of the name  Big Blue Disk, threatened a lawsuit if Softdisk continued to market a disk magazine under that name. Knowing better than to defy a company a thousand times their size, Softdisk felt compelled to rename  Big Blue Disk to the less catchy  On Disk Monthly.\n While the loss of hard-won brand recognition always hurts, Softdisk’s real problems were much bigger and more potentially intractable than that of one corporate behemoth with an overgrown legal department. The fact was, the relationship which people had with the newer computers Softdisk was now catering to tended to be different from the one they had enjoyed with their friendly little Apple II or Commodore 64. Being a computer user in the era of Microsoft’s ascendancy was no longer a hobby for most of them, much less a lifestyle. People had less of a craving for the ramshackle but easily hackable utilities and coding samples which Softdisk’s magazines had traditionally published. People were no longer interested in rolling up their sleeves to work with software in order to make it work for them; they demanded more polished programs that Just Worked right off the disk. But this was a hard field for Softdisk to compete on. Programmers with  really good software had little motivation to license their stuff to a disk magazine for a relative pittance when they could instead be talking to a boxed-software publisher or testing the exploding shareware market.\n With high-quality submissions from outside drying up just as he needed them most, Vekovius hired more and more internal staff to create the software for  On Disk. Yet even here he ran up against many of the same barriers. The programmers whom he could find locally or convince to move to a place like Shreveport at the salaries which Softdisk could afford to pay were generally not the first ones he might have chosen in an ideal world. For all that some of them would prove themselves to be unexpectedly brilliant, as we’ll see shortly, virtually every one of them had some flaw or collection thereof that prevented him from finding gainful employment elsewhere. And the demand that they churn out multiple programs every month in order to fill up the latest issue was, to say the least, rather inimical to the production of quality software. Vekovius was spinning his wheels in his little programming sweatshop with all the energy of those Shreveport riverboat gamblers, but it wasn’t at all clear that it was getting him any further than it was getting them.\n Thus he was receptive on the day in early 1990 when one of his most productive if headstrong programmers, a strapping young metalhead named John Romero, suggested that Softdisk start a new MS-DOS disk magazine, dedicated solely to games — the one place where, what with Apogee’s success being still in its early stages, shareware had not yet clearly cut into Softdisk’s business model. After some back-and-forth, the two agreed to a bi-monthly publication known as  Gamer’s Edge, featuring at least one — preferably two — original games in each issue. To make it happen, Romero would be allowed to gather together a few others who were willing to work a staggering number of hours cranking out games at an insane pace with no resources beyond themselves for very little money at all. Who could possibly refuse an offer like that?\n   The team that eventually coalesced around Romero included programmer Tom Hall, artist Adrian Carmack, and business manager and token adult-in-the-room Jay Wilbur. But their secret weapon, lured by Wilbur to Shreveport from Kansas City, Missouri, was a phenomenal young programmer named John Carmack. (In a proof that anyone who says things like “I don’t believe in coincidences” is full of it, John is actually unrelated to Adrian Carmack despite having the same not-hugely-common last name.) John Carmack would prove himself to be such a brilliant programmer that Romero and Hall, no slouches themselves in that department by most people’s standards, would learn to leave the heavy lifting to his genius, coding themselves only the less important parts of the games along with the utilities that they used to build them — and they would also design the games, for Carmack was in reality vastly more interested in the mathematical abstraction of code as an end unto itself than the games it enabled.\n But all of these young men, whom I’ll call the id boys from here on out just because the name suited them so well even before they started id Software, will be more or less important to our story. So, we should briefly meet each of them.\n Jay Wilbur was by far the most approachable, least intimidating member of the group. Having already reached the wise old age of 30, he brought with him a more varied set of life experiences that left him willing and able to talk to more varied sorts of people. Indeed, Wilbur’s schmoozing skills were rather legendary. While attending university in his home state of Rhode Island, he’d run the bar at his local TGI Friday’s, where his ability to mix drinks with acrobatic “flair” made him one of those selected to teach Tom Cruise the tricks of the trade for the movie  Cocktail. But his love for the Apple II he’d purchased with an insurance settlement following a motorcycle accident finally overcame his love for the nightlife, and he accepted a job for a Rhode Island-based disk magazine called  UpTime. When that company was bought out by Softdisk in 1988, he wound up in Shreveport, working as an editor there. The people skills he’d picked up tending bar would never desert him; certainly his new charges at  Gamer’s Edge had sore need of them, for they were an abrasive collection of characters even by hacker standards.\n These others loved heavy metal and action movies, and aimed a well-sharpened lance of contempt at anything outside their narrow range of cultural and technical interests. Their laser focus on their small collection of obsessions would prove one of their greatest strengths, if perhaps problematic for gaming writ large in the long run, in the way that it diminished the scope of what games could do and be.\n Yet even this band of four, the ones who actually made the games for  Gamer’s Edge under Wilbur’s benevolent stewardship, was not a monolith. Once one begins to look at them as individuals, the shades of difference quickly emerge.\n Like Wilbur, the 25-year-old Wisconsinite Tom Hall was a middle-class kid with a university degree, but he had none of his friend and colleague’s casual bonhomie with the masses. He lived in a fantasy world drawn from the  Star Wars movies, the first of which he’d seen in theaters 33 times, and  the  Hitchhiker’s Guide to the Galaxy novels, which he could all but recite from heart. At Softdisk, to which he’d come after deciding that he couldn’t stand the idea of a job in corporate data processing, he ran around talking in a cutsey made-up alien language: “Bleh! Bleh! Bleh!” He was the kind of guy you either found hilarious or were irritated out of your mind by.\n The 21-year-old Adrian Carmack also lived in a world of fantasy, but his fantasies had a darker hue. Growing up right there in Shreveport, he had spent many hours at arcades, attracted not so much by the games themselves as by the lurid art on their cabinets. He worked for a time as an aide at a hospital, then went home to sketch gunshot wounds, severed limbs, and festering bedsores with meticulous accuracy. Instead of a cat or a dog, he chose a scorpion as a pet. He’d come to Softdisk on a university internship after telling his advisor he wanted to work in “fine art” someday.\n Still, and with all due respect to these others, the id boys would come to be defined most of all by their two Johns. The 22-year-old John Romero was  pure id, a kettle of addled energy that was perpetually spilling over, sending F-bombs spewing every which way; David Kushner, author of the seminal history  Masters of Doom, memorably describes him as “a human exclamation point.” The not-quite-20-year-old John Carmack was as quiet and affectless as Romero was raucous, often disturbingly so; Sandy Petersen, a game designer who will come to work with him later in our story, remembers musing to himself after first meeting Carmack that “he doesn’t know anything about how humans think or feel.”\n Yet for all their surface differences, the two Johns had much in common. Both were brought up in broken homes: Romero was physically abused by his stepfather while growing up in the Sacramento area, while Carmack suffered under the corporeal and psychological rigors of a strict private Catholic school in Kansas. Both rebelled by committing petty crimes among other things; Carmack was sentenced to a year in a boys’ detention center at age 14 after breaking into his school using a homemade bomb. (The case notes of the police officer who interviewed him echo the later impressions of Sandy Petersen: “Boy behaves like a walking brain… no empathy for other human beings.”)\n Both found escape from their circumstances through digital means: first via videogames at the local arcades, then via the Apple II computers they acquired by hook or by crook. (Carmack’s first computer was a stolen one, bought off the proverbial back of a truck.) They soon taught themselves to program well enough to put professionals to shame.\n Romero got his games published regularly by print magazines as type-in listings, then parlayed that into a job with the disk magazine  UpTime, where he became friends with Jay Wilbur. After that, he got a job as a game porter for Origin Systems of  Ultima fame. Meanwhile Wilbur moved on to Softdisk while Romero was at Origin. When Romero found himself bored by the life of a porter, he came to Shreveport as well to join his friend.\n John Carmack, being more than two years younger than Romero and much more socially challenged, brought a shorter résumé with him to Shreveport when he became the only id boy to be hired specifically to work on  Gamer’s Edge rather than being transferred there from another part of Softdisk. He had mostly sold his games for $1000 apiece to a little mom-and-pop company near his home called Nite Owl Productions, who had made them a sideline to their main business of supplying replacement batteries for Apple II motherboards. But he had also sold one or two games to Jay Wilbur at Softdisk. Finding these to be very impressive, the id boys asked Wilbur to deploy his considerable charm to recruit the new kid for  Gamer’s Edge. After a concerted effort, he succeeded.\n Gamer’s Edge was far more than just a new job or a workplace transfer for the young men involved. It was a calling; they spent virtually all day every day in one another’s company. Pooling all of their meager salaries, Wilbur rented them a rambling old four-bedroom house on the Red River, complete with a Jacuzzi and a swimming pool and a boat deck which he soon complemented with a battered motorboat. It was an  Animal House lifestyle of barbecuing, skiing, and beer drinking in between marathon hacking sessions, fueled by pizza and soda. Wilbur — in many ways the unsung hero of this story — acted as their doting den mother, keeping the lights on, the basement beer keg filled, the refrigerator stocked with soda and junk food, and the pizza deliveries coming at all hours of the day and night.\n   For the first issue of  Gamer’s Edge, the two Johns agreed to each port one of their old Apple II games to MS-DOS. Romero chose a platformer called   Dangerous Dave, while Carmack chose a top-down action-adventure called   Catacomb. They raced one another to see who could finish first; it was after losing rather definitively that Romero realized he couldn’t hope to compete with Carmack as a pure programmer, and should probably leave the most complicated, math-intensive aspects of coding to his friend while he concentrated on all the other things that make a good game. For the second issue, the two Johns pooled their talents with that of the others to make a completely original shoot-em-up called   Slordax: The Unknown Enemy. So far, so good.\n And then came John Carmack’s first great technical miracle — the first of many that would be continually upending everything the id boys were working on in the best possible way. To fully explain this first miracle, a bit of background is necessary.\n Although they were making games for MS-DOS, the id boys had little use for the high-concept themes of most other games that were being made for that platform in 1990; neither complicated simulations nor elaborate interactive movies did anything for them. They preferred games that were simple and visceral, fast-paced and above all action-packed. Tellingly, most of the games they preferred to play these days lived on the Nintendo Entertainment System rather than a personal computer.\n Much of the difference between the two platforms’ design aesthetics was cultural, but there was also more to it than that. As I’ve often taken pains to point out in these articles, the nature of games on any given platform is always strongly guided by that platform’s technical strengths and weaknesses.\n When first looking at the NES and an MS-DOS personal computer of 1990 vintage, one might assume that the latter so thoroughly outclasses the former as to make further comparison pointless. The NES was built around a version of the MOS 6502, an 8-bit CPU dating back to the 1970s, running at a clock speed of less than 2 MHz; a state-of-the-art PC had a 32-bit CPU running at 25 MHz or more. The NES had just 2 K of writable general-purpose memory; the PC might have 4 MB or more, plus a big hard drive. The NES could display up to 25 colors from a palette of 48, at a resolution of 256 X 240; a PC with a VGA graphics card could display up to 256 colors from a palette of over 262,000, at a resolution of 320 X 200. Surely the PC could effortlessly do anything the NES could do. Right?\n Well, no, actually. The VGA graphics standard for PCs had been  created by IBM in 1987 with an eye to presenting crisp general-purpose displays rather than games. In the hands of a talented team of pixel artists, it could present mouth-watering static illustrations, as adventure-game studios like Sierra, LucasArts, and Legend were proving. But it included absolutely no aids for fast animation, no form of graphical acceleration whatsoever. It just gave the programmer a big chunk of memory to work with, whose bytes represented the pixels on the screen. When she wanted to change said pixels, she had to sling all those bytes around by main force, using nothing but the brute power of the CPU. All animation on a PC was essentially page-flipping animation, requiring the CPU to redraw every pixel of every frame in memory, at the 20 or 30 frames per second that were necessary to create an impression of relatively fluid motion, and all while also finding cycles for all of the other aspects of the game.\n The graphics system of the NES, on the other hand, had been designed for the sole purpose of presenting videogames — and in electrical engineering, specialization almost always breeds efficiency. Rather than storing the contents of the screen in memory as a linear array of pixels, it operated on the level of tiles, each of which was 8 X 8 or 8 X 16 pixels in size. After defining the look of each of a set of tiles, the programmer could mix and match them on the screen as she wished, at a fairly blazing speed thanks to the console’s custom display circuitry; this enabled the smooth scrolling of the  Super Mario Bros. games among many others. She also had up to 64 sprites to work with; these were little 8 X 8 or 8 X 16 images that were overlaid on the tiled background by the display hardware, and could be moved about almost instantaneously, just by changing a couple of numbers in a couple of registers. They were, in other words, perfect for showing Super Mario bouncing around on a scrolling backgro\n......", "posttime": "2020-06-20 05:15:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,指挥官,scene,游戏", "title": "»共享软件场景，第3部分：指挥官基恩和ID", "title_en": "» the Shareware Scene, Part 3: Commander Keen and Id", "transed": 1, "url": "https://www.filfre.net/2020/05/the-shareware-scene-part-3-the-id-boys/", "via": "", "real_tags": ["软件", "指挥官", "scene", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "455b6f874732eae21d2898a86bcaa854.jpg", "infoid": 1007321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在关注Facebook上仇恨言论的民权和团体呼吁采取行动后，Facebook的广告抵制活动已经酝酿了整整一周，The North‘s Face已成为加入这场抵制活动的最高知名度的品牌。\n周五，美国北方面孔在推特上表示，将停止购买Facebook广告，以声援民权组织，包括全国有色人种协进会(NAACP)和反诽谤联盟(Anti-Defamation League)。本周早些时候，这些组织在洛杉矶时报上刊登了一则整版广告，要求Facebook删除可能煽动针对受保护群体的暴力的仇恨言论和信息。\n我们进去了。周五，美国北方面孔在推特上写道：我们退出了，这表明它支持Facebook的广告抵制。民权组织呼吁各品牌在7月份退出Facebook。\n在发送了这条推文后，北脸表示，他们甚至不会等待7月份开始抗议。一位公司发言人在电子邮件中表示，从6月19日起，North Face将停止Facebook在美国的所有付费广告，直到更严格的政策到位，以阻止种族主义、暴力或仇恨的内容和错误信息在该平台上传播。我们知道，长期以来，有害的种族主义言论和错误信息已经使世界变得不平等和不安全，我们与全国有色人种协进会和其他正在为#StopHateforProfit而努力的组织站在一起。\n撤资Facebook运动的组织者之一，沉睡巨人，欢迎North Face成为第一个直言不讳的大品牌。\n“沉睡巨人”在推特上写道：“睡眠巨人”确认：“@thenorface”成为第一个在脸书上暂停7月份广告的品牌。\nFacebook在周五下午对North Face的声明做出了回应。“我们非常尊重任何品牌的决定，并继续专注于消除仇恨言论和提供关键投票信息的重要工作，”Facebook全球业务集团副总裁卡罗琳·埃弗森(Carolyn Everson)说。我们与营销人员和民权组织的对话是关于如何共同成为一股向善的力量。“。\nThe North Face在一封电子邮件中表示，其广告抗议将延伸到Facebook拥有的Instagram，但这家户外服装公司计划仍然在Instagram上有机发布内容。\n针对Facebook的抗议活动一直在增加，特别是自从Facebook对特朗普总统的帖子做出不温不火的回应以来，许多人认为这些帖子很危险。上个月，随着乔治·弗洛伊德(George Floyd)的抗议活动不断扩大，特朗普在Facebook和Twitter上发帖，建议在街上枪杀示威者。\n这条消息说，当抢劫开始时，枪击就开始了。Twitter在这条推文上发出了警告，而Facebook的政策并没有提供补救措施。尽管Facebook首席执行官马克·扎克伯格公开表达了他对总统信息的蔑视，但Facebook并没有惩罚特朗普的账户。\n广告商已经开始更多地公开反对Facebook。上周，IPG和Mediabrands的一名社交媒体高管在LinkedIn上发布了一条消息，呼吁该行业重新考虑与Facebook的关系。", "note_en": "The North Face has become the most high-profile brand to join a Facebook ad boycott that has been brewing all week following a call-to-action by civil rights groups concerned about hate speech on the social network.\n On Friday, The North Face tweeted that it would stop buying Facebook ads in solidarity with the civil rights organizations, including the NAACP and Anti-Defamation League. Earlier this week, the groups took out a full-page ad in The Los Angeles Times demanding Facebook remove hateful rhetoric and messages that could incite violence against protected groups.\n &#34;We’re in. We’re Out,&#34; The North Face tweeted on Friday, signaling its support of a Facebook ad boycott. The civil rights groups called on brands to pull out of Facebook for the month of July.\n After sending the tweet, The North Face said it was not even waiting for July to start its protest. &#34;Effective June 19, The North Face is halting all U.S. paid advertising with Facebook until stricter policies are put in place to stop racist, violent or hateful content and misinformation from circulating on the platform,&#34; a company spokeswoman said by email. &#34;We know that for too long harmful, racist rhetoric and misinformation has made the world unequal and unsafe, and we stand with the NAACP and the other organizations who are working to #StopHateforProfit.&#34;\n One of the organizers of the &#34;defund Facebook&#34; movement, Sleeping Giants, welcomed The North Face as the first major brand to speak out.\n &#34;CONFIRMED:  @thenorthface becomes the first brand to pause their advertising on Facebook for July,&#34; Sleeping Giants tweeted.\n  Facebook responded to The North Face&#39;s announcement by Friday afternoon. “We deeply respect any brand’s decision and remain focused on the important work of removing hate speech and providing critical voting information,&#34; said Carolyn Everson, VP, Global Business Group, Facebook. &#34;Our conversations with marketers and civil rights organizations are about how, together, we can be a force for good.”\n The North Face said in an email that its ad protest would extend to Instagram, which Facebook owns, but the outdoor apparel company planned to still post organically on Instagram.\n The protests have been mounting against Facebook, especially since it offered a tepid response to posts from President Trump that many people considered dangerous. Last month, as George Floyd protests were swelling, Trump sent messages on Facebook and Twitter suggesting shooting demonstrators in the streets.\n The message said, &#34;when the looting starts, the shooting starts.&#34; Twitter  put a warning on the tweet, while Facebook&#39;s policies did not provide a remedy. Even though CEO Mark Zuckerberg publicly expressed his disdain for the president&#39;s message, Facebook did not punish Trump&#39;s account.\n Advertisers have started to speak out more against Facebook. Last week, a  social media executive from IPG Mediabrands posted a message on LinkedIn that called on the industry to rethink its relationship with Facebook.", "posttime": "2020-06-20 05:14:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,facebook,face", "title": "North Face成为第一个加入Facebook广告抵制的大品牌", "title_en": "The North Face becomes first major brand to join Facebook ad boycott", "transed": 1, "url": "https://adage.com/article/digital/north-face-becomes-first-major-brand-join-facebook-ad-boycott/2262996", "via": "", "real_tags": ["广告", "facebook", "face"]}, {"category": "", "categoryclass": "", "imagename": "ed4a5e8cea5132e41e36e024a1bbe9d4.png", "infoid": 1007320, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一级-只要你是一个冷静的人，不介意偶尔开玩笑地说几句话，这里的每个人都是受欢迎的。\n2-如果你不是一个PC游戏玩家，因为你认为这样做是非常昂贵的，请知道，这是非常有可能建立一个合格的游戏PC 500美元或更少。请查看http://www.pcmasterrace.org以了解我们的版本。\n3-请考虑加入我们的努力，在全球范围内获得尽可能多的PC，帮助Folding@Home努力抗击癌症、阿尔茨海默氏症、亨廷顿氏症和帕金森氏症。最近，我们一直在积极专注于抗击冠状病毒。请查看此以了解更多信息：https://pcmasterrace.org/folding。\n4-加入我们的Folding@Home健康游戏来福乐，支持PCMR与新冠肺炎的战斗，赢得近百项硬件奖品！\n欢迎使用这个社区发布您对成为PC游戏玩家的任何疑虑，或者任何您想了解的有关PC的信息。这样的内容在这里不仅是允许的，而且是受欢迎的！\n你也可以成为PCMR的一部分！你不一定需要一台个人电脑。你只需要热爱电脑就行了。这不是关于你平台上的硬件，而是你心中的软件！\n要多久我们才能在任务管理器上以原始分辨率玩早期的PC游戏？\n第二级，Adapteva架构最多支持4096个，但是根据维基百科的说法，他们实际上还没有用那么多构建过一个。\n第二级以后的8位计算机的分辨率是256x192，所以我们需要49,152个内核，即768个开线器。\n第2级无关问题。您的GTX 1080Ti是否受到x5660的瓶颈，还是还好？我计划给自己买一台X5680和一台RTX 2070超级，所以我想看看会有什么期待。\n级别2一旦我们获得23040个内核，我们就可以使用此方法在本地模拟原始游戏男孩的分辨率。这个游戏男孩只有4种深浅不一的单色托盘。\n级别2在您正在任务管理器上玩的“我的世界”版本中构建一个计算器。\n2级耶稣！我想这64个内核相当于GeForce 256，而我的大脑甚至无法理解更多的东西。\n第二级，它们必须是真正运行程序的核心，才能做这些疯狂的事情。这就是为什么它们不是零，这应该看起来更漂亮，但是编程的地狱。\n欢迎来到PC大师大赛的官方Subreddit。在这个子编辑中，我们庆祝并推广终极游戏和工作平台。提升到尊重你的眼睛、你的钱包、你的头脑和你的心的程度。升到……。PC大师赛。", "note_en": "level 1  1 - Everyone is welcome here, provided you&#39;re a chill person who doesn&#39;t mind occasional tongue in cheek humor.\n 2 - In case you are not a PC gamer because you think doing so is very expensive, please know that it is very possible to build a competent gaming PC for 500 dollars or less. Please check out  http://www.pcmasterrace.org for our builds.\n 3 - Please consider joining our efforts to get as many PCs worldwide help the folding@home effort, in fighting against Cancer, Alzheimer&#39;s, Huntington&#39;s, and Parkinson&#39;s. Recently, we&#39;ve been actively focusing on fighting against Coronavirus as well. Please check this to learn more:  https://pcmasterrace.org/folding\n 4 - Join our  Folding@Home Wholesome Gaming Raffle to support PCMR’s battle against Covid-19 and win almost 100 hardware prizes!\n  Feel free to use this community to post about any kind of doubt you might have about becoming a PC gamer or anything you&#39;d like to know about PCs. That kind of content is not only allowed but welcome here!\n You too can be part of the PCMR! You don&#39;t necessarily need a PC. You just have to love PCs. It&#39;s not about the hardware in your rig, but the software in your heart!\n level 1  How long until we can play early PC games in their original resolution on the task manager?\n level 2  The Adapteva architecture supports up to 4096 but according to wikipedia they haven&#39;t actually built one with that many.\n    level 2  later 8 bit computers had 256x192 resolution, so we&#39;d need 49,152 cores, or 768 Threadrippers.\n    level 2  Unrelated question. Is your GTX 1080Ti getting bottlenecked by the x5660 or is it ok ? I plan on getting myself a x5680 and a rtx 2070 super so I would like to see what to expect\n    level 2  Once we get 23040 cores, we can natively emulate the resolution of the original gameboy using this method. The gameboy only had 4 shades of monochrome pallet\n    level 2  Build a calculator in the version of Minecraft you’re playing on task manager\n level 2  Jesus! I think this 64 cores would be Geforce 256 equivalent and my brain can&#39;t even comprehend anything beyond that.\n   level 2  They must be the cores that actually run the program to do this crazy stuff. Thats why they are not zero, which should be prettier looking but hell of programming\n Welcome to the official subreddit of the PC Master Race. In this subreddit, we celebrate and promote the ultimate gaming and working platform. Ascend to a level that respects your eyes, your wallet, your mind, and your heart. Ascend to... the PC Master Race.", "posttime": "2020-06-20 05:14:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "处理器,processor,pc", "title": "如果这不是使用64核处理器的正确方式，我不知道什么才是正确的", "title_en": "If this is not the correct way to use a 64-Core Processor, I don't know what is", "transed": 1, "url": "https://www.reddit.com/r/pcmasterrace/comments/hbx72t/if_this_is_not_the_correct_way_to_use_a_64core/", "via": "", "real_tags": ["处理器", "processor", "pc"]}, {"category": "", "categoryclass": "", "imagename": "6744c1a5398c4e88541227e675671c2e.jpg", "infoid": 1007319, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获取突发新闻警报和特别报道。重要的新闻和故事会在工作日早上发布。\n订阅。\n阿拉斯加朱诺-州官员称，周四，阿拉斯加偏远地区的一辆被遗弃的公交车被移走，这辆公交车因“走进荒野”(Into The Wild)和同名电影而广受欢迎。\n长期以来，这辆公交车一直吸引着冒险家来到一个没有手机服务的地区，这个地区的特点是天气变幻莫测，有时河水暴涨。一些人不得不获救，或者已经死亡。这本书和电影的主人公克里斯托弗·麦克坎德利斯于1992年在那里去世。\n今年早些时候营救了五名意大利游客，去年一名白俄罗斯妇女死亡，加剧了当地官员要求移除这辆公交车的呼声。这辆公交车距离公园公路约25英里。\n让我们的新闻与您的收件箱见面。重要的新闻和故事，在工作日的早上递送。\n费格说，作为训练任务的一部分，阿拉斯加陆军国民警卫队移动了这辆公交车，“不给公众带来任何成本，也不会给州政府带来额外的成本”。\n阿拉斯加国民警卫队在一份新闻稿中说，公交车是用重型直升机移走的。新闻稿称，机组人员确保了一个对McCandless家庭具有情感价值的手提箱的安全。它没有进一步描述那个项目。\nFeige在一份新闻稿中表示，公交车将被保存在一个安全的位置，而她所在的部门正在权衡如何处理公交车的各种选择。\n她在一份新闻稿中说：“我们鼓励人们安全地享受阿拉斯加的荒野，我们理解这辆巴士对大众想象力的影响。”“然而，这是一辆被遗弃和正在恶化的车辆，需要危险和昂贵的救援工作。更重要的是，这让一些游客付出了生命的代价。“。\n来自弗吉尼亚州的24岁的麦克坎德利斯(McCandless)因特克拉尼卡河(Teklanika River)上涨的河岸而无法寻求帮助。1992年，他在公交车上饿死，并在一本日记中写道，他在公交车上生活了114天，直到他去世。\n废弃已久的费尔班克斯城市公交车因1996年乔恩·克拉考尔(Jon Krakauer)的书“走进荒野”(Into The Wild)和2007年肖恩·潘(Sean Penn)执导的同名电影而出名。\n美国自然资源部(Department Of Natural Resources)表示，这辆20世纪40年代的公交车曾被一家建筑公司用来安置在该地区一条通道上工作的员工，并在1961年完工时被遗弃。\n今年3月，总部位于希利(Healy)的德纳利区(Denali Borough)的官员一致投票决定废除它，该市距离公交车约25英里(40公里)。", "note_en": "Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n SUBSCRIBE\n  JUNEAU, Alaska — An abandoned bus in the Alaska backcountry, popularized by the book “Into the Wild” and movie of the same name, was removed Thursday, state officials said.\n    The bus has long attracted adventurers to an area without cellphone service and marked by unpredictable weather and at-times swollen rivers. Some have had to be rescued or have died. Christopher McCandless, the subject of the book and movie, died there in 1992.\n The rescue earlier this year of five Italian tourists and death last year of a woman from Belarus intensified calls from local officials for the bus, about 25 miles from the Parks Highway, to be removed.\n Let our news meet your inbox. The news and stories that matters, delivered weekday mornings.\n  The Alaska Army National Guard moved the bus as part of a training mission “at no cost to the public or additional cost to the state,” Feige said.\n The Alaska National Guard, in a release, said the bus was removed using a heavy-lift helicopter. The crew ensured the safety of a suitcase with sentimental value to the McCandless family, the release states. It doesn’t describe that item further.\n  Feige, in a release, said the bus will be kept in a secure location while her department weighs various options for what to do with it.\n “We encourage people to enjoy Alaska’s wild areas safely, and we understand the hold this bus has had on the popular imagination,” she said in a release. “However, this is an abandoned and deteriorating vehicle that was requiring dangerous and costly rescue efforts. More importantly, it was costing some visitors their lives.”\n  McCandless, a 24-year-old from Virginia, was prevented from seeking help by the swollen banks of the Teklanika River. He died of starvation in the bus in 1992, and wrote in a journal about living in the bus for 114 days, right up to his death.\n The long-abandoned Fairbanks city bus became famous by the 1996 book “Into the Wild” by Jon Krakauer, and a 2007 Sean Penn-directed movie of the same name.\n  The Department of Natural Resources said the 1940s-era bus had been used by a construction company to house employees during work on an access road in the area and was abandoned when the work was finished in 1961.\n In March, officials in the Denali Borough based in Healy, about 25 miles (40 kilometers) from the bus, voted unanimously to be rid of it.", "posttime": "2020-06-20 04:56:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "公共安全,bus,公交车", "title": "出于公共安全考虑，从阿拉斯加偏远地区撤走了“Into the Wild”公交车", "title_en": "'Into the Wild' Bus Removed From Alaska Backcountry For Public Safety", "transed": 1, "url": "https://www.nbcnews.com/news/us-news/wild-bus-removed-alaska-backcountry-public-safety-n1231591", "via": "", "real_tags": ["公共安全", "bus", "公交车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "范畴。\n逆向工程。\nOffice宏恶意软件", "note_en": "Categories\n  Reverse Engineering\n    Office Macro Malware", "posttime": "2020-06-20 04:55:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,逆向工程,frida,逆向", "title": "使用FRIDA进行Windows逆向工程", "title_en": "Using Frida for Windows Reverse Engineering", "transed": 1, "url": "https://darungrim.com/research/2020-06-17-using-frida-for-windows-reverse-engineering.html", "via": "", "real_tags": ["windows", "逆向工程", "frida", "逆向"]}, {"category": "", "categoryclass": "", "imagename": "ac88d81e5b3376583d8b8a199aa41b2d.jpg", "infoid": 1007317, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Gav去游泳，并展示了一种有趣的方法，在这种方法中，你可以浮出水面，立即在Apple Watch上听到你的声音警报。福尔..。", "note_en": "Gav goes for a swim and shows off the interesting method in which you can get out of the water and immediately hear your sound alerts on the Apple Watch. Fol...", "posttime": "2020-06-20 04:54:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple-watch,app,apple,watch,游泳", "title": "Apple Watch是如何在慢速模式下排出水分的", "title_en": "How the Apple Watch Ejects Water in Slow Mo", "transed": 1, "url": "https://youtu.be/EIEwy8rPik4", "via": "", "real_tags": ["app", "apple", "watch", "游泳"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007316, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你已经听说过10x工程师，但我在这里要告诉你关于狼的事情。他们是一名工程师，始终表现出以下特点：\n他们似乎存在于我们为完成任务而定义的明确过程之外，但他们似乎不会因为不遵循这些规则而遭受任何后果。\n每个人都知道他们是狼，但从来没有人叫他们狼。\n他们有很多会议，但都没有安排。邀请他们参加你的会议简直是胡说八道。\n他们明白“制度”是如何运作的，他们明白如何利用“制度”对他们有利，他们明白“制度”为何存在，但他们认为“制度”有点可笑。\n你可以让狼去当经理，但他们会拒绝的。如果你碰巧说服他们做这件事，他们会做得很好，但他们不会在这个角色上呆很长时间。事实上，他们可能会在你最意想不到的时候退出管理。\n最后，也是最重要的一点是，Wolf凭借其无与伦比的识别和快速处理对公司未来至关重要的项目的能力，为公司创造了不成比例的价值。\n狼移动得很快，因为他或她能够避免一群人大规模建造的累赘必需品。这种避免了大多数与流程相关的事情，再加上出色的工程能力，使他们能够以极快的速度移动，这使得他们的工作效率非同寻常。这就是团队其他成员可以…的工作效率。闻。正是这种纯粹生产力的气息让他们可以进一步避开文档、会议和年度审查。\n当您刚刚花了一天的时间编写集成测试时，很容易憎恨狼，但也很容易钦佩他们似乎在指定自己的术语。\n在我的职业生涯中，我有幸与少数几只狼一起工作。他们很感激我已经确认了他们的身份，我们正在就他们的狼-我进行有趣的对话。现在，我已经两次尝试对狼群进行逆向工程，然后将结果提交给其他工程师。看见?。这里有一条定义明确、技术含量很高的非经理人赛道。这两次尝试大多都失败了。这两次的原因都是一样的：狼赢得的影响力永远不会被一个经理授予。\n狼并不真的需要我。事实上，狼现在正在读着这篇文章，咧嘴笑着，因为他或她知道我对它们的描述做得不错-这种描述有可能帮助激励未来的狼，但真正重要的是…。就是他们现在正在做的事。", "note_en": "You’ve heard of the 10x engineer, but I am here to tell you about the Wolf. They are an engineer and they consistently exhibit the following characteristics:\n They appear to exist outside of the well-defined process that we’ve defined to get things done, but they appear to suffer no consequences for not following these rules.\n Everyone knows they’re the Wolf, but no one ever calls them the Wolf.\n  They have a lot of meetings, but none of them are scheduled. Inviting them to your meeting is a crap shoot.\n They understand how “the system” works, they understand how to use “the system” to their advantage, they understand why “the system” exists, but they think “the system” is a bit of a joke.\n You can ask a Wolf to become a manager, but they’ll resist it. If you happen to convince them to do it, they will do a fine job, but they won’t stay in that role long. In fact, they’ll likely quit managing when you least expect it.\n Lastly, and most importantly, the Wolf generates disproportionate value for the company with their unparalleled ability to identify and rapidly work on projects essential to the future of the company.\n The Wolf moves fast because he or she is able to avoid the encumbering necessities of a group of people building at scale. This avoidance of most things process related combined with exceptional engineering ability allows them to move at speed which makes them unusually productive. It’s this productivity that the rest of the team can… smell. It’s this scent of pure productivity that allows them to further skirt documentation, meetings, and annual reviews.\n It’s easy to hate the Wolf when you’ve just spent the day writing integration tests, but it’s also easy to admire the fact that they appear to be dictating their own terms.\n In my career, I’ve had the pleasure of the working with a handful of Wolves. They appreciate that I have identified them as such and we have interesting ongoing conversations regarding their Wolf-i-ness. Two times now, I’ve attempted to reverse engineer Wolves and then hold up the results to other engineers.  See? Here is a well-defined non-manager very technical track. Both attempts have mostly failed. The reason was the same both times: the influence earned by the Wolf can never ever be granted by a manager.\n The Wolf doesn’t really need me. In fact, the Wolf is reading this right now and grinning because he or she knows that I’ve done an ok job describing them – there is a chance this description may help inspire future Wolves, but what really matters… is what they’re working on right now.", "posttime": "2020-06-20 04:53:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工程师,engineers,制度", "title": "管理10倍工程师-狼", "title_en": "Managing 10x Engineers – The Wolf", "transed": 1, "url": "https://randsinrepose.com/archives/the-wolf/", "via": "", "real_tags": ["工程师", "engineers", "制度"]}, {"category": "", "categoryclass": "", "imagename": "e10a7fbbab8ae710b4bae597cba99da9.jpg", "infoid": 1007315, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "商业报道埃隆·马斯克的SpaceX公司已经申请通过卫星向居住在偏远地区的加拿大人提供高速互联网。\n“环球邮报”最先报道了太空探索公司SpaceX向加拿大电信监管机构--加拿大广播电视和电信委员会(CRTC)申请基本国际电信服务(BITS)许可证。\n对于任何想要提供CRTC所说的加拿大与其他任何国家之间的电信流量的公司来说，这都是一项要求。\n如果他们成功获得BITS牌照，这意味着SpaceX公司-其正式公司名称是太空探索技术公司(Space Explore Technologies Corp.)-理论上可以尝试提供更多的无线电信服务，如语音和数据计划。但就目前而言，该应用侧重于高速互联网，通过该公司现有的所谓近地卫星网络直接传输到农村家庭和企业。\n加拿大远不是SpaceX试图提供互联网服务的唯一地方。该公司在其网站上表示，该公司计划在今年晚些时候通过一家名为Starlink的子公司在美国提供高速互联网服务，到2021年，该公司将迅速扩大到人口稠密世界的全球覆盖范围。\nCRTC的数据显示，在不住在大城市地区的加拿大人中，多达40%的人无法接入高速互联网，而且可用的互联网往往昂贵得令人望而却步。\n在去年秋天的选举中，执政的自由党承诺确保到2026年加拿大95%的家庭和企业都能使用高速互联网，到2030年每个加拿大家庭都能使用高速互联网，无论他们位于该国的哪个地方。\n在新冠肺炎大流行期间，这个问题变得越来越重要，因为数以百万计的加拿大人发现自己在家工作，似乎看不到结束的迹象。\n申请是在5月份提交的，征求公众意见的最后期限是周五。已有1200多名加拿大人参与了这项提议，其中大量人表示支持。\n我住在安大略省的乡下，那里没有供应商能以快速而实惠的价格提供互联网，多伦多以北约30公里的安大略州锡达谷的居民马赫迪·霍辛泽希(Mahdi Hossinzehi)说。有了快速、可靠的网络和负担得起的互联网，农村地区将在经济上受益匪浅，而且许多年轻人最终不会离开城市。\nIqaluit居民Brandt Chu说，他赞成这项提议，因为努纳武特的生活太偏远了。\n他在致监管机构的一封信中表示，任何能够真正将我们与世界其他地区联系起来的合理建议都应该受到欢迎。", "note_en": "Business      Elon Musk&#39;s SpaceX has applied to offer high-speed internet to Canadians living in remote areas by beaming it to them via satellites.\n  The  Globe and Mail newspaper first reported that space exploration company SpaceX applied with Canada&#39;s telecom regulator, the Canadian Radio-television and Telecommunications Commission (CRTC), for what&#39;s known as a Basic International Telecommunications Services, or BITS, licence.\n   That&#39;s a requirement for any company that wants to offer what the CRTC calls &#34;telecommunications traffic between Canada and any other country.&#34;\n  If they are successful in getting a BITS licence, that means SpaceX — whose formal company name is Space Exploration Technologies Corp. — could theoretically try to offer more wireless telecom services down the line, such as voice and data plans. But for now, the application focuses on high-speed internet, beamed directly into rural homes and businesses via the company&#39;s existing network of so-called near-Earth satellites.\n  Canada is far from the only place SpaceX is trying to offer internet service. The company is planning to offer high-speed internet services in the United States later this year through a subsidiary known as Starlink before &#34;rapidly expanding to near global coverage of the populated world by 2021,&#34;  the company says on its website.\n  CRTC data suggests as many as  40 per cent of Canadians who don&#39;t live in major urban areas do not have access to high-speed internet, and what is available is often prohibitively expensive.\n    In last fall&#39;s election, the  governing Liberals promised to ensure that 95 per cent of Canadian homes and businesses would have high-speed internet by 2026 and that every Canadian household would have access to it by 2030 &#34;no matter where they are located in the country.&#34;\n  The issue has taken on increased importance during the COVID-19 pandemic, as millions of Canadians find themselves working from home, with seemingly no end in sight.\n    The application was filed in May, and the deadline for public comment is Friday. More than 1,200 Canadians have weighed in on the proposal, a large number of them in support of it.\n  &#34;I live in rural Ontario where there are no providers that can provide internet at a fast and affordable price,&#34; said Mahdi Hossinzehi, a resident of Cedar Valley, Ont., about 30 kilometres north of Toronto. &#34;With fast, reliable and affordable internet, rural areas will benefit immensely economically, and a lot of younger people won&#39;t end up leaving for the city.&#34;\n      Iqaluit resident Brandt Chu said he&#39;s in favour of the proposal because of how remote life can be in Nunavut.\n  &#34;Any reasonable proposal that could really connect us to the rest of the world should be welcomed,&#34; he said in a letter to the regulator.", "posttime": "2020-06-20 04:36:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,申请,applies", "title": "SpaceX申请为加拿大人提供高速互联网服务", "title_en": "SpaceX applies to offer high-speed internet service to Canadians", "transed": 1, "url": "https://www.cbc.ca/news/business/spacex-high-speed-internet-1.5618918", "via": "", "real_tags": ["app", "申请", "applies"]}, {"category": "", "categoryclass": "", "imagename": "2348832cce9a7d5e3912ceb95c20388a.jpg", "infoid": 1007314, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由詹姆斯·卡梅隆(James Cameron)、史蒂文·斯皮尔伯格(Steven Spielberg)和雷德利·斯科特(Ridley Scott)等人执导的大制作经常在全美和其他地方的电影院吸引最多的观众。\n但在6月10日，一部票房冠军电影只有两个人在一家电影院观看。\n取消订阅是一部29分钟的恐怖电影，完全是在视频会议应用Zoom上拍摄的，当天的票房收入为25,488美元(20,510 GB)。\n根据享有盛誉的收入目标Box Office Mojo的数据，在全国范围内，这部电影登上了排行榜榜首。\n这部电影是来自宾夕法尼亚州费城的演员兼YouTuber埃里克·塔巴赫(Eric Tabach)和来自纽约市的电影制片人克里斯蒂安·尼尔森(Christian Nilsson)的创意。\n当冠状病毒大流行在3月份关闭电影院时，两人在危机中看到了机会。\n考虑到没有大片在电影院上映，他们想知道如果他们自己制作一部DIY风格的电影，是否能登上排行榜榜首。\n我注意到票房数字很荒谬；每部电影9,000美元，15,000美元。没有什么大的东西出来。大片被搁置了。塔巴赫告诉BBC，我想找到一种方法来获得最大的数字。\n为了达到票房的顶峰，塔巴赫和尼尔森意识到他们必须玩弄体制。他们是通过利用电影票销售中的一个漏洞，即所谓的四墙来做到这一点的。\n曾在BuzzFeed制作病毒式视频的塔巴赫解释说，四面墙是指发行商出租电影院，然后购买所有座位。\n因此，他们向剧院支付固定的费用，他们从座位上赚取的任何钱都直接进入了他们的口袋。当我们意识到这是一种分配的选择时，我们就去做了。\n由于好莱坞在大流行期间基本上处于封存状态，塔巴赫和尼尔森知道他们的电影有很大的机会创造最大的单日总票房。\n带着一个概念和一种积极进取的态度，两人开始着手制作这部电影。\n尼尔森先生在一天内就写好了剧本。这部电影讲述了五个YouTube用户加入在线视频通话，发现自己被一个神秘的互联网巨魔出没和追捕的故事。\n塔巴赫在朋友们的帮助下主演了这部电影。令他惊讶的是，他设法签下了一些有声望的演员。\n这部电影的主人公“杀手”由查理·塔汉饰演，他在Netflix电视剧“奥扎克”中饰演怀亚特·兰摩尔一角。联合主演米歇尔·哈雷(Michelle Khare)已经在HBO Max即将上映的电视剧中饰演角色。\n两位著名的YouTube用户，“是的理论”的托马斯·布拉格和喜剧团体“Try Guys”的成员扎克·科恩菲尔德也在影片中亮相。\n他们真的很兴奋能成为某种东西的一部分，塔巴赫说，他本人也曾出演过这部电影。\n在隔离期间，每个人都真的很无聊。绝对什么都没发生。每个人都想免费成为这个有趣项目的一部分。\n他们在5月份拍摄了这部电影超过5天，只使用Zoom来捕捉镜头。尼尔森先生随后编辑了这段视频，并请一位朋友谱写了一个乐谱。几周之内，它就可以在电影院上映了。\n他们决定在纽约市郊外威斯安普顿海滩的一家独立剧院放映这部电影，尼尔森曾在那里工作。要租剧院，他们需要付一小笔费用。\n正如Facebook上发布的照片显示，在放映当晚，这对情侣去了镇上。\n塔巴赫和尼尔森身着燕尾服，头发整齐地向后梳，自豪地站在剧院外。在他们的头顶上，影院的囤积物上印着他们电影的片名。取消订阅，上面写着，售罄。\n我们出现了，买了一些爆米花，坐下来玩了起来。我从来没有看过空荡荡的电影院，尤其是放映我在里面拍的电影的电影院。那真是一次很酷的经历。我一遍又一遍地看了每一场放映，塔巴赫说。\n塔巴赫先生总共看了这部电影五次，每一分钟都看得津津有味。\n一旦收入结果出来，下一个任务就是说服Box Office Mojo的所有者IMDb，他们的电影是合法的。\n他们一直拒绝我们，说没有证据，塔巴赫先生说。所以我们把演员的照片寄给他们，但他们一直对整件事持怀疑态度。当媒体开始报道这部电影时，它最终获得了批准。\n现在它正式成为IMDb上的第一名，这太疯狂了。这是6月10日的第一名。\n排名第二的电影《可怜的人》在99家影院上映，收入22566美元。\n取消订阅可能只是一个一次性的热门话题，也许是酒吧测验中一个晦涩难懂的琐碎问题。\n但塔巴赫表示，这部可以在流媒体平台Vimeo上观看的电影代表的不仅仅是一个票房诡计。\n不管怎样，你总能找到创造性的方法把事情做完。即使在困难的情况下。他说，看到所有这些被困在家里的人聚在一起做一个项目，这很酷。", "note_en": "The big-budget productions, directed by the likes of James Cameron, Steven Spielberg and Ridley Scott, regularly draw the biggest crowds at cinemas across the US and beyond.\n But on 10 June, one box office-topping movie was watched by just two people, in one cinema.\n Unsubscribe, a 29-minute horror movie shot entirely on video-conferencing app Zoom, generated $25,488 (£20,510) in ticket sales on that day.\n Nationwide, the movie hit the top of the charts,  according to reputable revenue tacker Box Office Mojo.\n    The movie was the brainchild of Eric Tabach, an actor and YouTuber from Philadelphia, Pennsylvania, and filmmaker Christian Nilsson, from New York City.\n When the coronavirus pandemic shuttered movie theatres in March, the pair saw an opportunity in the crisis.\n Given no big films were being released in cinemas, they wondered if they could hit the top of the charts if they made their own movie, DIY style.\n &#34;I noticed that the box office figures were absurd; $9,000, $15,000 for each movie. Nothing big was coming out. Blockbuster films were on hold. I wanted to find a way to get the biggest number,&#34; Mr Tabach told the BBC.\n   To reach the top of the box office, Mr Tabach and Mr Nilsson realised they had to game the system. They did so by exploiting a loophole in cinema ticket sales, known as four-walling.\n &#34;Four-walling is when distributors rent out a movie theatre and buy all the seats,&#34; Mr Tabach, who used to work at BuzzFeed making viral videos, explained.\n &#34;So they pay a flat fee to the theatre, and any money they make off seats goes straight into their pockets. The moment we realised that was an option of distribution, we went for it.&#34;\n With Hollywood essentially mothballed during the pandemic, Mr Tabach and Mr Nilsson knew their movie had a solid chance of raking in the biggest one-day revenue total.\n With little more than a concept and a can-do attitude, the pair set to work on making the movie.\n  Mr Nilsson wrote the script in one day. The movie is about five YouTubers who join an online video-call and find themselves haunted and hunted by a mysterious internet troll.\n Mr Tabach enlisted the help of his friends to star in the movie. To his surprise, he managed to sign up some prestigious actors.\n The movie&#39;s protagonist, the killer, was played by Charlie Tahan, best known as Wyatt Langmore in Netflix series Ozark. The co-star, Michelle Khare, has been cast in a soon-to-be-released series on HBO Max.\n Two well-known YouTubers, Yes Theory&#39;s Thomas Brag and Zach Kornfeld, part of comedy group The Try Guys, also featured in the film.\n  &#34;They were really excited to be a part of something,&#34; said Mr Tabach, who himself appeared in the film.\n &#34;It was at a point in the quarantine when everyone was really bored. Absolutely nothing was going on. Everyone wanted to be a part of this fun project, for free.&#34;\n They shot the movie over five days in May, only using Zoom to capture footage. Mr Nilsson then edited the footage and asked a friend to compose a score. Within weeks, it was cinema-ready.\n They decided to screen the movie at an independent theatre in Westhampton Beach, outside New York City, where Mr Nilsson used to work. To rent the theatre, they were required to pay a small fee.\n  On the night of the screening, the pair went to town, as pictures posted to Facebook show.\n  Dressed in tuxedos, with their hair neatly swept back, Mr Tabach and Mr Nilsson stood proudly outside the theatre. Above their heads, the theatre&#39;s hoarding bore the title of their movie. Unsubscribe, it read, above the words &#34;sold out&#34;.\n  &#34;We showed up, got some popcorn, sat down and played it. I&#39;ve never seen an empty movie theatre, not least one playing a film I was in and made. It was a really cool experience. I watched every screening, over and over again,&#34; Mr Tabach said.\n Mr Tabach watched the movie five times in total, lapping up every minute of it.\n Once the revenue results were in, the next task was to convince IMDb, the owner of Box Office Mojo, their movie was legitimate.\n &#34;They kept rejecting us, saying there was no proof,&#34; Mr Tabach said. &#34;So we sent them pictures of the actors, but they kept on doubting the entire thing. When media outlets started reporting about the film, it was eventually approved.\n &#34;Now it&#39;s officially number one on IMDb, which is crazy. It was number one for 10 June.&#34;\n The movie in second place, The Wretched, was screened in 99 cinemas, earning $22,566 in revenue.\n Unsubscribe may only prove to be a one-off hit, an obscure trivia question on a pub quiz, perhaps.\n But Mr Tabach said the film,  which can be viewed on streaming platform Vimeo, represents more than a box-office ruse.\n &#34;No matter what, you can always find creative ways to get something done. Even in difficult circumstances. It was cool to see all these people stuck at home come together and make a project,&#34; he said.", "posttime": "2020-06-20 04:18:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,订阅,budget", "title": "取消订阅：登上美国票房榜首的0美元预算电影", "title_en": "Unsubscribe: The $0-Budget Movie That 'Topped the US Box Office'", "transed": 1, "url": "https://www.bbc.com/news/world-us-canada-53099283", "via": "", "real_tags": ["电影", "订阅", "budget"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007313, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数以百计的流行网站现在提供某种形式的多因素身份验证(MFA)，当用户的密码被攻破或被盗时，它可以帮助用户保护对账户的访问。但是，没有利用这些增加的安全措施的人可能会发现，当他们的账户被黑客攻击时，重新获得访问权限的难度要大得多，因为越来越多的窃贼会启用多因素选项，并将账户与他们控制的设备捆绑在一起。这里有一个这样的事件的故事。\n作为不同组织的职业首席隐私官，丹尼斯·戴曼(Dennis Dayman)试图向他的双胞胎儿子灌输保护他们的在线身份免受账户接管的重要性。两人都是微软Xbox平台上的狂热游戏玩家，多年来，他们的父亲通过自己的微软账户管理着他们的账户。但当男孩们年满18岁时，他们将孩子的账户转换为成人账户，有效地将自己从父亲的控制下拉了出来。\n最近的一个早晨，戴曼的一个儿子发现他再也无法访问他的Xbox账户了。年轻的代曼向他的父亲承认，他在其他地方重复使用了他的Xbox个人资料密码，而且他没有为该账户启用多因素身份验证。\n当他们两人坐下来重新设置他的密码时，屏幕上显示了一个通知，说他的Xbox账户绑定了一个新的Gmail地址。当他们为他儿子的Xbox个人资料开启多因素身份验证时--Xbox个人资料与一个非微软的电子邮件地址捆绑在一起--Xbox服务表示，它将向他儿子个人资料中未经授权的Gmail账户发送更改通知。\n由于担心提醒黑客他们是明智的入侵，丹尼斯尝试联系微软Xbox支持，但发现他无法从非微软帐户打开支持票证。使用另一个儿子的Outlook账户，他向微软提交了一份关于这起事件的罚单。\n丹尼斯很快了解到，添加到他儿子被黑客攻击的Xbox账户的未经授权的Gmail地址也启用了MFA。这意味着，没有控制Gmail账户的人的批准，他的儿子将无法重置账户的密码。\n对于戴曼的儿子来说，幸运的是，他没有重复使用与他的Xbox个人资料绑定的电子邮件地址的相同密码。然而，窃贼开始滥用他们在Xbox和第三方网站上购买游戏的权限。\n“在此期间，我们开始意识到，他的银行账户是通过从Xbox和[艺电]购买游戏而被提取的，”老代曼回忆道。“我把他Xbox账户的恢复代码从保险箱里拿了出来，但因为黑客进来了，打开了多因子功能，这些代码对我们来说毫无用处。”\n微软支持向戴曼和他的儿子发送了一份包含20个问题的清单，要求他们回答有关他们帐户的问题，例如Xbox控制台上最初与帐户创建时绑定的序列号。但戴曼说，尽管成功回答了所有这些问题，但微软拒绝让他们重置密码。\n“他们说，他们的政策是不把账户交给不能提供第二个因素的人，”他说。\n戴曼的案例最终被升级到微软的第三层支持部门，微软能够带他完成创建一个新的微软账户，在上面启用MFA，然后将他儿子的Xbox个人资料迁移到新账户的过程。\n微软告诉KrebsOnSecurity，虽然目前用户在注册时没有得到启用两步验证的提示，但他们总是可以选择启用这一功能。\n该公司在一份书面声明中表示：“用户在创建账户后不久也会收到提示，如果他们还没有添加额外的安全信息，这将使客户在登录自己的账户时收到安全警报和安全促销。”“当我们注意到来自新位置或设备的异常登录尝试时，我们通过质询登录并向用户发送通知来帮助保护帐户。如果客户的账户曾经被攻破，我们将采取必要步骤帮助他们恢复账户。“。\n当然，对于习惯于跨多个站点重用或回收密码的人来说，在提供MFA时不启用它的风险要大得多。但您委托敏感信息的任何服务都可能被黑客攻击，启用多因素身份验证可以很好地对冲用于掠夺您帐户的凭据泄露或被盗的风险。\n更重要的是，许多支持多因素身份验证的在线网站和服务都是完全自动化的，在发生帐户接管时极难联系到他们寻求帮助。如果攻击者还可以修改和/或删除与该帐户关联的原始电子邮件地址，情况就会加倍。\nKrebsOnSecurity长期以来一直将读者引导到网站twofactorauth.org，该网站详细介绍了流行网站提供的各种MFA选项。目前，twofactorauth.org列出了近900个提供某种形式的MFA的站点。这些选项从通过电子邮件、电话、短信或移动应用程序发送的一次性代码等身份验证选项，到更强大、真正的“双因素身份验证”或2FA选项(你有一些东西，你也知道一些东西)，比如安全密钥或基于推送的2FA选项，比如Duo Security(本网站的广告商，我已经使用了多年的一项服务)。\n从安全角度来看，电子邮件、短信和基于应用的一次性代码被认为不那么健壮，因为它们可能会被各种公认的攻击场景破坏，从SIM交换到基于移动的恶意软件。因此，使用可用的最强形式的MFA来保护您的帐户是有意义的。但请记住，如果您经常使用的网站提供的唯一附加身份验证选项是短信和/或电话，这仍然比简单地依靠密码来保护您的帐户要好。", "note_en": "Hundreds of popular websites now offer some form of  multi-factor authentication (MFA), which can help users safeguard access to accounts when their password is breached or stolen. But people who don’t take advantage of these added safeguards may find it far more difficult to regain access when their account gets hacked, because increasingly thieves will enable multi-factor options and tie the account to a device they control. Here’s the story of one such incident.\n  As a career chief privacy officer for different organizations,  Dennis Dayman has tried to instill in his twin boys the importance of securing their online identities against account takeovers. Both are avid gamers on  Microsoft’s Xbox platform, and for years their father managed their accounts via his own Microsoft account. But when the boys turned 18, they converted their child accounts to adult, effectively taking themselves out from under their dad’s control.\n On a recent morning, one of Dayman’s sons found he could no longer access his Xbox account. The younger Dayman admitted to his dad that he’d reused his Xbox profile password elsewhere, and that he hadn’t enabled multi-factor authentication for the account.\n When the two of them sat down to reset his password, the screen displayed a notice saying there was a new Gmail address tied to his Xbox account. When they went to turn on multi-factor authentication for his son’s Xbox profile — which was tied to a non-Microsoft email address — the Xbox service said it would send a notification of the change to unauthorized Gmail account in his profile.\n Wary of alerting the hackers that they were wise to their intrusion, Dennis tried contacting Microsoft Xbox support, but found he couldn’t open a support ticket from a non-Microsoft account. Using his other son’s Outlook account, he filed a ticket about the incident with Microsoft.\n Dennis soon learned the unauthorized Gmail address added to his son’s hacked Xbox account also had enabled MFA. Meaning, his son would be unable to reset the account’s password without approval from the person in control of the Gmail account.\n Luckily for Dayman’s son, he hadn’t re-used the same password for the email address tied to his Xbox profile. Nevertheless, the thieves began abusing their access to purchase games on Xbox and third-party sites.\n “During this period, we started realizing that his bank account was being drawn down through purchases of games from Xbox and [Electronic Arts],” Dayman the elder recalled. “I pulled the recovery codes for his Xbox account out of the safe, but because the hacker came in and turned on multi-factor, those codes were useless to us.”\n Microsoft support sent Dayman and his son a list of 20 questions to answer about their account, such as the serial number on the Xbox console originally tied to the account when it was created. But despite answering all of those questions successfully, Microsoft refused to let them reset the password, Dayman said.\n “They said their policy was not to turn over accounts to someone who couldn’t provide the second factor,” he said.\n Dayman’s case was eventually escalated to Tier 3 Support at Microsoft, which was able to walk him through creating a new Microsoft account, enabling MFA on it, and then migrating his son’s Xbox profile over to the new account.\n Microsoft told KrebsOnSecurity that while users currently are not prompted to enable two-step verification upon sign-up, they always have the option  to enable the feature.\n “Users are also prompted shortly after account creation to add additional security information if they have not yet done so, which enables the customer to receive security alerts and security promotions when they login to their account,” the company said in a written statement. “When we notice an unusual sign-in attempt from a new location or device, we help protect the account by challenging the login and send the user a notification. If a customer’s account is ever compromised, we will take the necessary steps  to help them recover the account.”\n Certainly, not enabling MFA when it is offered is far more of a risk for people in the habit of reusing or recycling passwords across multiple sites. But any service to which you entrust sensitive information can get hacked, and enabling multi-factor authentication is a good hedge against having leaked or stolen credentials used to plunder your account.\n What’s more, a great many online sites and services that do support multi-factor authentication are completely automated and extremely difficult to reach for help when account takeovers occur. This is doubly so if the attackers also can modify and/or remove the original email address associated with the account.\n KrebsOnSecurity has long steered readers to the site  twofactorauth.org, which details the various MFA options offered by popular websites. Currently, twofactorauth.org lists nearly 900 sites that have some form of MFA available. These range from authentication options like  one-time codes sent via email, phone calls, SMS or mobile app, to more robust, true “2-factor authentication” or 2FA options (something you have and something you know), such as  security keys or push-based 2FA such as  Duo Security (an advertiser on this site and a service I have used for years).\n Email, SMS and app-based one-time codes are considered less robust from a security perspective because they can be undermined by a variety of well-established attack scenarios, from  SIM-swapping to mobile-based malware. So it makes sense to secure your accounts with the strongest form of MFA available. But please bear in mind that if the only added authentication options offered by a site you frequent are SMS and/or phone calls, this is still better than simply relying on a password to secure your account.", "posttime": "2020-06-20 04:16:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打开,mfa,账户", "title": "在骗子帮你做之前打开MFA", "title_en": "Turn on MFA Before Crooks Do It for You", "transed": 1, "url": "https://krebsonsecurity.com/2020/06/turn-on-mfa-before-crooks-do-it-for-you/", "via": "", "real_tags": ["打开", "mfa", "账户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007312, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我一直在追求使用(滥用？)的想法。CSS网格，构建一个互连的六边形网格，其中每个六边形无缝连接在一起。这方面的一个例子是很多桌面战争游戏，一些棋盘游戏(例如，卡坦的定居者)和一些电脑游戏(我曾经玩过韦斯诺斯战役，它使用的是这样的系统)。\n必须互连。这意味着各个项目有一定程度的重叠，因为我们重新将一个六边形安装到一个方孔中。\n必须是灵活的。我需要能够把一件新的东西扔进去，然后让它正常工作。\n一定是有反应的。在较大的屏幕上，从5英寸开始的网格应该在较小的屏幕上降到1到2英寸。\n我将一步一步地分析这是如何工作的，但这是我能想出的最终结果。这个网站的文章列表实际上也使用了这个版本。\n让我们分析一下这段代码的html是什么样子，然后我们将了解网格是如何设置的。其中一个要求是灵活性，部分要求是确保不涉及太多复杂的标记。另外，CSS网格要求我们有相当平面的标记，因为现在我们所有的网格项都必须是兄弟项。子网格将使这不是一个要求，但它还没有完全在那里，这被证明不是一个问题。\n如你所见，我们这里有一个非常标准的清单。我们确实需要一个额外的内容&lt；div&gt；才能实现我们想要的外观；这是因为需要强制这些六边形的纵横比，当我们进入CSS时，您将会看到这一点。(=。如果你对CSS中的强制比例很好奇，这是一篇不错的文章。\n好了，让我们来了解一下这个疯狂的网格系统是如何工作的。我在这方面的第一次尝试是试图找出一个自动放置方案，但很快就成了死胡同，因为我意识到我的一个要求，即相互连接的六边形，将阻止任何形式的自动放置，至少从我对网格的理解来看是这样。CSS网格非常有趣，因为它们真的不在乎是否有一个元素已经占用了您告诉它们去的空间，所以如果您告诉多个元素占用同一个网格单元格，它们会很乐意这样做，但是您必须明确地告诉网格您需要重叠哪些元素，所以自动放置是不可行的。一旦我弄清楚了这一点，我就开始弄清楚我的网格需要实际看起来是什么样子。事实证明，这比我预期的更具挑战性。或者，也许我只是数学不好。我想可能就是这样了。\n首先，我们需要将列表转换为网格。：)另外，由于我的标记是列表，我还将删除默认的列表样式。\n弄清楚我的行需要看起来是什么样子实际上是相当容易的。如果你看这个六边形，你会发现顶部和底部都是平的：\n这一点，再加上六边形在y轴上是镜像的，这意味着我们不必做任何特殊的事情来设置我们的行；当我们开始将单独的物品放入正确的空间时，所有这些都会自动处理。\n柱子更难弄清楚。再看一下六边形，我最初的想法是，我应该可以用一个网格，每个单独的项目跨越3列。中心是一列，每边也将占据一列：\n方便的是，六边形的边正好是中心宽度的一半，这意味着当我们为这个网格设置列时，我们的网格列应该看起来像1 2 1。我们也将使用fr单元，这样我们就可以缩放容器，并使网格弹性与之匹配。表示这一点的一种非常简单的方法是只写出我需要的列，在本例中，我每行有5个六边形：\n.hex-grid__list{显示：网格；列表样式-类型：无；页边距：0；填充：0；网格模板-列：1FR 2fr 1FR 2fr 1FR 2fr 1FR 2fr 1FR 2fr 1FR；}。\n我想重写这段代码以使用Repeat()函数，但其中一个有趣的问题是，由于我们的单个网格项需要占用奇数的列(3)，因此我们的网格作为一个整体也需要是一个奇数。要做到这一点，我要建立一个重复，只是重复1FR的2FR部分，然后附加一个1FR的末端。“。我还将设置一个CSS变量，该变量将控制此网格每行的六边形数量。这是很好的测试，而且当我们开始响应时也会派上用场。\n.hex-grid__list{--数量：5；显示：网格；列表样式类型：无；页边距：0；填充：0；网格模板列：重复(var(--数量)，1fr，2fr)1fr；}\n这是我们到目前为止得到的，我添加了一些颜色，这样我们就可以直观地看到我们到目前为止所处的位置。\n好的，现在我们需要开始将物品放到这个网格上。我们的单个项目需要跨越3列和2行，因此我们将从添加Grid-Column：1/span 3开始。这将定位每个项目，因此它从第一列开始，跨越3列。然后添加GRID-ROW：1/SPAN 2，这使项目跨度为2行。现在，我们有了横跨所需的行数和列数的各个项目，我继续并开始添加一些我们还需要的附加视觉样式，为列表项引入比率调整，然后将内容定位在该列表项中。\n.hex-grid__item{位置：相对；网格列：1/span 3；网格行：1/span 2；高度：0；填充底部：100%；}.十六进制网格__内容{位置：绝对；左侧：0；顶部：0；高度：100%；宽度：100%；背景颜色：白色；}。\n这很酷，但绝对不是网格。现在还不行。：)我们将使用一些疯狂的：nth-of-type选择器来构建我们的行和列规则。问题的根源在于，我们需要更新网格列和网格行规则的起始位置。我们将从行开始，因为这样更容易解释，而且列在顶部的层次也很好。我们将向列表中添加一个计数器变量，然后在每次移动到新行时递增该变量。然后，我们将更新网格行规则，将行位置设置为计数器的两倍，因为网格项所在的每个行实际上是两个网格行。\n这就是我遇到第一期的地方。没有一种很好的自动方法来跟踪我们在哪一行，我可以弄清楚。我最初的想法是可以设置一个：nth-of-type规则，比如：nth-of-type(5n+1)，它递增我的计数器变量，但据我所知，使用自身重新赋值变量并不起作用，或者可能是：nth-of-type没有正确更新变量的问题。不管怎样，那都过时了。我还研究了使用CSS计数器，但我们需要将这些数字作为实际数字，并将计数器输出作为字符串。我最终放弃了，重新使用了一系列：nth-of-type(n+&lt；mount&gt；)。不幸的是，这意味着它不像我希望的那样灵活，因为您必须设置固定数量的行，之后网格将停止正常运行。\n这就是说，带着一点粗鲁的循环，我可以去了，我已经设置了我的生成20行，因为我可能永远不会使用它的任何更多的东西，如果是这样，它是一个快速的调整。我已经设置了我的循环生成20行，因为我可能永远不会使用这个更多的东西，如果是这样，它是一个快速的调整。\n这就是我们目前的情况。我还包括了一些原始的CSS片段，这样您就可以看到sass循环编译成什么了。\n$Amount：5；.hex-grid__list{--金额：5；--计数器：1；显示：网格；列表样式类型：无；页边距：0；填充：0；网格模板列：Repeat(var(--mount)，1fr，2fr)1FR；}.hex-grid__item{位置：相对；网格列：1/span 3；GRID-ROW：Calc(var(--Counter)+var(--Counter))/span 2；高度：0；填充-底部：100%；@$i从1到20{&amp；：第n个类型(n+#{$i*$Amount+1}){--计数器：#{$i+1}；}.hex-grid__content{position：Absolute；Left：0；top：0；高度：100%；宽度：100%；背景颜色：白色；}\n.hex-grid__item：第n个类型(n+6){--计数器：2；}.hex-grid__item：第n个类型(n+11){--计数器：3；}.hex-grid__item：第n个类型(n+16){--计数器：4；}/*.等*/。\n快到了，然后我们就可以开始把它弄漂亮了！定位这一点的最后一步是设置列的规则。我们将再次使用：nth-of-type来完成此操作，但这一次我们需要为每个项目列设置一个规则(每个列都是3个网格列，但它们会相互联锁。？是的，这很复杂)。我们要找的大概是：nth-of-type(&lt；Amount&gt；n+&lt；column&gt；)，因此我们需要：nth-of-type(5N+1)到：nth-of-type(5N+5)。我选择再次将其放入sass循环中，这样我们就不会编写太多CSS，给出以下内容：\n$Amount：5；.hex-grid__list{--金额：5；--计数器：1；显示：网格；列表样式类型：无；页边距：0；填充：0；网格模板列：Repeat(var(--mount)，1fr，2fr)1FR；}.hex-grid__item{位置：相对；网格列：1/span 3；GRID-ROW：Calc(var(--Counter)+var(--Counter))/span 2；高度：0；填充-底部：100%；//$i的列@，从1到$Amount{&amp；：第n个类型(#{$Amount}n+#{$i}){Grid-Column：#{$i+$i-1}/span 3；@if$i%2==0{grid-row：calc(var(--counter)+var(--counter)-1)/span 2；}//$i的行@，从1到20{&amp；：第n个类型(n+#{$i*$Amount+1}){--计数器：#{$i+1}；}.hex-grid_content{位置：绝对；左：0；顶部：0；高度：100%；宽度：100%；背景色：白色；}。\n您将注意到的最后一件事是，在我的COLUMN循环中，我正在修改偶数列以将它们的行号偏移-1。通过将每隔一列向上移动到前一行的中间，这为我们提供了我们想要的联锁模式。\n现在，为了让它看起来像一个六边形，让我们继续在我们的内容中添加一个剪辑路径。我从多边形开始计算出剪辑路径，然后玩弄这些值，直到得到我想要的结果。我还添加了一些填充，以保持我们的内容流畅。我尝试了一下CSS形状，希望能让内容留在蒙版内部，但无法让形状与外部的任何东西一起工作。我非常肯定如果/当内部形状存在时，这将是完美的。填充效果相当好，所以我并不太担心。我还略微调低了比例，因为这个六边形实际上不是一个完美的正方形，它实际上是9：10的比例。\n.hex-grid__item{/*截取*/高度：0；ppad-Bottom：90%；}.hex-grid__content{位置：绝对；左侧：0；顶部：0；高度：100%；宽度：100%；背景色：白色；剪辑路径：多边形(75%0,100%50%，75%100%，25%100%，050%，25%0)；填充：2rem 25%；}。\n添加檐槽就像向栅格添加栅格间隙一样简单。您实际上会希望将行间距设置为您想要的间距，然后将列间距设置为双倍。我不完全确定为什么会这样，但我想这是因为数学是如何计算出倾斜的间隙的吧？谁在乎呢，它管用，对吧？：)。\n.hex-grid__list{--数量：5；--计数器：1；显示：网格；列表样式类型：无；页边距：0；填充：0；网格模板列：重复(var(--数量)，1fr，2fr)1FR；网格间距：1rem 2rem；}\n差不多就是这样了！使其具有响应性与设置媒体查询一样简单，这样屏幕宽度越小，每行的列数就越少。我把这项工作所需的部分变成了一种sass混合，并用它来构建我的媒体查询。完整的代码包含在下面！\n$block：&#39；.hex-grid&#39；；@Mixin网格项($Amount){@表示$i从1到$Amount{&amp；：第n个类型(#{$Amount}n+#{$i}){网格列：#{$i+$i-1}/span 3；@if$I%2==0{网格行：Calc(var(-计数器)+var(--计数器)-1)/span 2；}@for$i，从1到20{&amp；：第n个类型(n+#{$i*$Amount+1}){--计数器：#{$i+1}；}#{$block}{display：flex；JUSIGN-CONTENT：CENTER；&amp；__LIST{--Amount：5；位置：相对；填充：0；边距：0；列表样式类型：无；显示：网格；网格模板列：REPEAT(var(--Amount)，1FR 2fr)1FR；网格间距：2.5rem 5rem；}&amp；__item{位置：相对；网格列：1/span 3；网格行：Calc(var(--计数器)+var(--计数器))/span 2；过滤器：投射阴影(0 10px RGBA(#444，0.08))；高度：0；填充底部：90%。}&amp；__Content{位置：绝对；高度：100%；宽度：100%；字体大小：1.125rem；颜色：#111111；背景颜色：白色；剪辑路径：多边形(75%0,100%50%，75%100%，25%100%，050%，25%0)；显示：弯曲；弯曲方向：列；对齐内容：居中；对齐项目：居中；填充：2rem 25%0；文本装饰：无；文本对齐：居中；过渡：转换.24s缓出；}}@媒体屏幕和(最小宽度：1440px){#{$block}{&amp；__list{--金额：5；--计数器：1；}&amp；__Item{@include Grid-Item(5)；}@媒体屏幕和(最小宽度：1120px)和(最大宽度：1439px){#{$block}{&amp；__list{--金额：4；--计数器：1；}&amp；__Item{@include Grid-Item(4)；}@媒体屏幕和(最小宽度：840px)和(最大宽度：1119px){#{$block}{&amp；__list{--数量：3；--计数器：1；网格间距：1.5rem 3rem；}&amp；__Item{@include Grid-Item(3)；}@媒体屏幕和(最小宽度：480px)和(最大宽度：839px){#{$block}{&amp；__list{--数量：2；--计数器：1；栅格间隙：1.5rem 3rem；}&amp；__item{@include grid-item(2)；}@媒体屏幕和(最大宽度：479px){#{$block}{&amp；__list{--数量：1；网格间距：1.5rem 3rem；}", "note_en": "I&#39;ve been chasing the idea of using (abusing?) CSS grid to build a interconnected hexagonal grid, where each hexagon fits together seamlessly. An example of this would be a lot of tabletop war games, some board games (Settlers of Catan, for instance), and some computer games (I used to play  The Battle for Wesnoth, it uses a system like this).\n  Must interconnect. This means a certain amount of overlap of the individual items, because we&#39;re fitting a hexagon into a square hole.\n  Must be flexible. I need to be able to just throw a new item into it and have it just work.\n Must be responsive. A grid that starts out at 5 across on larger screens should go down to one or two across on smaller screens.\n  I&#39;m going to break down how this works step by step, but here&#39;s the end result I was able to come up with. The article list for this website actually uses a version of this as well.\n   Let&#39;s break down what the html for this looks like, and then we&#39;ll get into how the grid is set up. One of the requirements was flexibility, and part of that was making sure that there wasn&#39;t a lot of complicated markup involved. Also, CSS grid requires us to have pretty flat markup, as all of our grid items have to be siblings right now. Sub-grid will make this not a requirement, but it&#39;s not quite there yet and this proved to not be an issue anyway.\n  As you can see, we have a pretty standard list going here. We do need an extra content  &lt;div&gt; in order to pull off the look we&#39;re going for; this is due to needing to force an aspect ratio for these hexagons, as you&#39;ll see when we get into the CSS. If you&#39;re curious about forcing ratios in CSS,  this is a good article to check out.\n  Alright, let&#39;s get into how this crazy grid system works. My first stab at this explored trying to figure out an auto placement scheme, but that quickly became a dead end as I realized that one of my requirements, interconnecting hexagons, was going to prevent any sort of automatic placement, at least from my understanding of grid. CSS grids are super interesting in that they really don&#39;t care if there&#39;s an element already occupying the space that you tell them to go to, so if you tell multiple elements to occupy the same grid cell they will happily do that, but you have to explicitly tell the grid what elements you need to overlap, so auto placement was a no-go. Once I figured that out, I moved into figuring out what my grid needed to actually look like. This proved to be far more challenging than I expected. Or maybe I&#39;m just bad at math. I think that might be it.\n  Well first, we need to turn our list into a grid. :) Also, since my markup is a list, I&#39;m going to remove the default list styles as well.\n   Figuring out what my rows needed to look like was actually pretty easy. If you look at the hexagon shape, you&#39;ll see that the top and the bottom are flat:\n  This, coupled with the fact that the hexagon is mirrored across the y-axis, means that we don&#39;t have to do anything special to set up our rows; all of that will automatically be taken care of when we start placing individual items into the correct spaces.\n  Columns were substantially harder to figure out. Looking at the the hexagon again, my initial thought was that I should be able to get away with a grid where each individual item spans 3 columns. The center is one column, and each side will occupy a column as well:\n  Conveniently, the sides of the hexagon are exactly half the width of the center, meaning our grid columns should look something like 1 2 1 when we go to set up our columns for this grid. We&#39;re going to use the  fr unit as well, so we can scale the container and have the grid flex to match that. A very simple way of representing this is to just write out the columns I need, in this case I have 5 hexagons per row:\n .hex-grid__list  {  display : grid ;  list-style-type : none ;  margin : 0 ;  padding : 0 ;  grid-template-columns : 1fr 2fr 1fr 2fr 1fr 2fr 1fr 2fr 1fr 2fr 1fr ; }\n I want to rewrite this to use a  repeat() function, but an interesting wrinkle to this is that due to our individual grid items needing to occupy an odd amount of columns (3), our grid as a whole needs to also be an odd number. To accomplish this, I&#39;m going to set up a repeat that just repeats the  1fr 2fr part, and then attach a single  1fr on the the end. I&#39;m also going to set up a CSS variable that will control the amount of hexagons that this grid per row. This is nice just to test things out, and also will come in handy down the road when we start getting into responsiveness.\n .hex-grid__list  {  --amount : 5 ;  display : grid ;  list-style-type : none ;  margin : 0 ;  padding : 0 ;  grid-template-columns :  repeat ( var (--amount ) , 1fr , 2fr ) 1fr ; }\n Here&#39;s what we&#39;ve got so far, I added some colors so we have a visualization of where we are so far.\n  Alright, now we need to start to place items on to this grid. Our individual items need to span 3 columns and 2 rows, so we&#39;re going to start by adding  grid-column: 1 / span 3. This positions every item so it starts in the first column and spans 3 columns over. Then we add  grid-row: 1 / span 2, which makes the item span 2 rows. We now have our individual items spanning the amount of rows and columns we need, and I went ahead and started adding some of the additional visual styles we&#39;re going to need as well, pulling in the ratio hack for the list item and then positioning the content within that.\n .hex-grid__item  {  position : relative ;  grid-column : 1  / span 3 ;  grid-row : 1  / span 2 ;  height : 0 ;  padding-bottom : 100% ; } .hex-grid__content  {  position : absolute ;  left : 0 ;  top : 0 ;  height : 100% ;  width : 100% ;  background-color : white ; }\n  This is cool, but decidedly  not a grid. Yet. :) We&#39;re going to get into some crazy  :nth-of-type selectors to build out our row and column rules. The root of our problem is that we need to update the starting position of both our  grid-column and our  grid-row rules. We&#39;re going to start with the rows, since that&#39;s a little easier to explain, plus the columns layer nicely on top. We&#39;re going to add a counter variable to the list, and then increment it every time we&#39;ve moved on to a new row. We&#39;re then going to update our  grid-row rule to set the row position to double our counter, since each &#34;row&#34; that our grid items sit in is actually two grid rows.\n This is where I ran into my first issue. There is no good automatic way to keep track of what row we&#39;re on that I could figure out. My initial thought was that I could set up a  :nth-of-type rule like  :nth-of-type(5n + 1) that increments my counter variable, but from what I can tell, reassigning a variable using itself just doesn&#39;t work, or it may have been an issue with the  :nth-of-type not updating the variable correctly. Either way, that was out. I also exploring using  CSS counters, but we need these numbers as actual numbers, and counters output as strings. I eventually gave up and fell back to using a series of  :nth-of-type(n + &lt;amount&gt;). This unfortunately means that it&#39;s not as flexible as I would like, as you have to set up a fixed amount of rows and after that the grid will stop functioning correctly.\n That being said, with a little SASS for loop I was good to go, I&#39;ve set mine to generate 20 rows as I will probably never use this for anything more that that, and if so, it&#39;s a quick adjustment.\n Here&#39;s what we&#39;re up to now. I&#39;ve also included a few raw CSS snippets so you can see what the SASS loop compiles down to.\n $amount : 5 ; .hex-grid__list  {  --amount : 5 ;  --counter : 1 ;  display : grid ;  list-style-type : none ;  margin : 0 ;  padding : 0 ;  grid-template-columns :  repeat ( var (--amount ) , 1fr , 2fr ) 1fr ; } .hex-grid__item  {  position : relative ;  grid-column : 1  / span 3 ;  grid-row :  calc ( var (--counter )  +  var (--counter ) )  / span 2 ;  height : 0 ;  padding-bottom : 100% ;  @for  $i  from 1  through  20  { &amp; : nth-of-type (n  + # { $i  *  $amount  + 1 } )  {  --counter : # { $i  + 1 } ;  }  } } .hex-grid__content  {  position : absolute ;  left : 0 ;  top : 0 ;  height : 100% ;  width : 100% ;  background-color : white ; }\n  .hex-grid__item:nth-of-type(n + 6)  {  --counter : 2 ; } .hex-grid__item:nth-of-type(n + 11)  {  --counter : 3 ; } .hex-grid__item:nth-of-type(n + 16)  {  --counter : 4 ; } /* ...etc */\n Almost there, then we can start making this pretty! The final piece for positioning this is to set up the rules for the columns. We&#39;re going to use  :nth-of-type again to accomplish this, but this time we need to set up a rule per item column (each &#34;column&#34; is 3 grid columns, but they&#39;re interlocking. Yeah, this is complicated). What we&#39;re going for is something like  :nth-of-type(&lt;amount&gt;n + &lt;column&gt;), so for this we&#39;ll need  :nth-of-type(5n + 1) through  :nth-of-type(5n + 5). I chose to put this into a SASS loop again so we&#39;re not writing so much CSS, giving us this:\n $amount : 5 ; .hex-grid__list  {  --amount : 5 ;  --counter : 1 ;  display : grid ;  list-style-type : none ;  margin : 0 ;  padding : 0 ;  grid-template-columns :  repeat ( var (--amount ) , 1fr , 2fr ) 1fr ; } .hex-grid__item  {  position : relative ;  grid-column : 1  / span 3 ;  grid-row :  calc ( var (--counter )  +  var (--counter ) )  / span 2 ;  height : 0 ;  padding-bottom : 100% ;  // Columns  @for  $i  from 1  through   $amount  { &amp; : nth-of-type ( #{$amount}n  +  #{$i} )  {  grid-column : # { $i  +  $i  - 1 }  / span 3 ;  @if   $i % 2 == 0  {  grid-row :  calc ( var (--counter )  +  var (--counter )  - 1 )  / span 2 ;  }  }  }  // Rows  @for  $i  from 1  through  20  { &amp; : nth-of-type (n  + # { $i  *  $amount  + 1 } )  {  --counter : # { $i  + 1 } ;  }  } } .hex-grid__content  {  position : absolute ;  left : 0 ;  top : 0 ;  height : 100% ;  width : 100% ;  background-color : white ; }\n One final thing you&#39;ll notice is that in my column loop, I&#39;m modifying the even columns to offset their row number by -1. This gives us the interlocking pattern that we wanted, by moving every other column up to the middle of the previous row.\n   Now, to make this this actually look like a hexagon, lets go ahead and add a clip-path to our content. I figured out the clip-path by starting with polygon and playing around with the values until I got what I was going for. I also added some padding to keep our content flowing nicely. I played around with CSS shapes hoping to get the content to stay inside the mask, but couldn&#39;t get anything working with  shape-outside. I&#39;m pretty sure if/when  shape-inside exists, that will be perfect for this. Padding works fairly well so I&#39;m not too worried about it. I also bumped the ratio down slightly, as this hexagon is actually not a perfect square, it&#39;s actually a 9:10 ratio.\n .hex-grid__item  {  /* snipped */  height : 0 ;  padding-bottom : 90% ; } .hex-grid__content  {  position : absolute ;  left : 0 ;  top : 0 ;  height : 100% ;  width : 100% ;  background-color : white ;  clip-path :  polygon (75% 0 , 100% 50% , 75% 100% , 25% 100% , 0 50% , 25% 0 ) ;  padding : 2rem 25% ; }\n  Adding a gutter is as easy as adding a  grid-gap to our grid. You&#39;ll actually want to set your row gap to be what you want your gutter to be, and then your column gap to double that. I&#39;m not entirely sure why this is, but I think it&#39;s because of how the math works out for the angled gaps? Who cares, it works, right? :)\n .hex-grid__list  {  --amount : 5 ;  --counter : 1 ;  display : grid ;  list-style-type : none ;  margin : 0 ;  padding : 0 ;  grid-template-columns :  repeat ( var (--amount ) , 1fr , 2fr ) 1fr ;  grid-gap : 1rem 2rem ; }\n  That&#39;s pretty much it! Making this responsive is as easy as setting up media queries so that smaller screen widths get less columns per row. I turned the parts needed for this to work into a SASS mixin and used that to build out my media queries. The full code is included below!\n $block :  &#39;.hex-grid&#39; ; @mixin  grid-item ( $amount )  {  @for  $i  from 1  through   $amount  { &amp; : nth-of-type ( #{$amount}n  +  #{$i} )  {  grid-column : # { $i  +  $i  - 1 }  / span 3 ;  @if   $i % 2 == 0  {  grid-row :  calc ( var (--counter )  +  var (--counter )  - 1 )  / span 2 ;  }  }  }  @for  $i  from 1  through  20  { &amp; : nth-of-type (n  + # { $i  *  $amount  + 1 } )  {  --counter : # { $i  + 1 } ;  }  } }  #{$block}  {  display : flex ;\t justify-content : center ;   &amp;__list  {  --amount : 5 ;  position : relative ;  padding : 0 ;\t\t margin : 0 ;\t\t list-style-type : none ;\t\t display : grid ;  grid-template-columns :  repeat ( var (--amount ) , 1fr 2fr ) 1fr ;\t\t grid-gap : 2.5rem 5rem ;  }   &amp;__item  {  position : relative ;\t\t grid-column : 1  / span 3 ;\t\t grid-row :  calc ( var (--counter )  +  var (--counter ) )  / span 2 ;\t\t filter :  drop-shadow (0 0 10px  rgba (#444 , .08 ) ) ;\t\t height : 0 ;\t\t padding-bottom : 90% ;  }   &amp;__content  {  position : absolute ;\t\t height : 100% ;\t\t width : 100% ;\t\t font-size : 1.125rem ;\t\t color : #111111 ;\t\t background-color : white ;\t\t clip-path :  polygon (75% 0 , 100% 50% , 75% 100% , 25% 100% , 0 50% , 25% 0 ) ;\t\t display : flex ;\t\t flex-direction : column ;\t\t justify-content : center ;\t\t align-items : center ;\t\t padding : 2rem 25% ;\t\t text-decoration : none ;\t\t text-align : center ;\t\t transition : transform .24s ease-out ;  } }  @media screen  and  ( min-width : 1440px )  {\t  #{$block}  {\t\t  &amp;__list  {  --amount : 5 ;\t\t\t --counter : 1 ;\t\t }\t\t  &amp;__item  {\t\t\t @include  grid-item (5 ) ;\t\t }\t } }  @media screen  and  ( min-width : 1120px )  and  ( max-width : 1439px )  {\t  #{$block}  {\t\t  &amp;__list  {  --amount : 4 ;\t\t\t --counter : 1 ;\t\t }\t\t  &amp;__item  {\t\t\t @include  grid-item (4 ) ;\t\t }\t } }  @media screen  and  ( min-width : 840px )  and  ( max-width : 1119px )  {\t  #{$block}  {\t\t  &amp;__list  {  --amount : 3 ;\t\t\t --counter : 1 ;\t\t\t grid-gap : 1.5rem 3rem ;\t\t }\t\t  &amp;__item  {\t\t\t @include  grid-item (3 ) ;\t\t }\t } }  @media screen  and  ( min-width : 480px )  and  ( max-width : 839px )  {\t  #{$block}  {\t\t  &amp;__list  {\t\t\t --amount : 2 ;\t\t\t --counter : 1 ;\t\t\t grid-gap : 1.5rem 3rem ;\t\t }\t\t  &amp;__item  {\t\t\t @include  grid-item (2 ) ;\t\t }\t } }  @media screen  and  ( max-width : 479px )  {\t  #{$block}  {\t\t  &amp;__list  {  --amount : 1 ;\t\t\t grid-gap : 1.5rem 3rem ;\t\t }\t } }", "posttime": "2020-06-20 04:15:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "六边形,hexagonal,网格", "title": "在CSS中构建六边形网格", "title_en": "Building a Hexagonal Grid in CSS", "transed": 1, "url": "https://ninjarockstar.dev/css-hex-grids/", "via": "", "real_tags": ["六边形", "hexagonal", "网格"]}, {"category": "", "categoryclass": "", "imagename": "b5e2ba44b8e9b0a7eac2781c463b63c5.jpg", "infoid": 1007310, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在追求强大的量子计算机方面，最近已经取得了几项技术进步。现在，来自苏黎世理工大学的计算机科学家在编程语言领域取得了重要突破：他们的量子语言是同类语言中第一个与经典计算机语言一样优雅、简单和安全的语言。\n量子计算机的编程变得越来越容易：苏黎世理工大学的计算机科学家设计了第一种编程语言，可以用来对量子计算机进行编程，就像经典计算机一样简单、可靠和安全。ETH安全、可靠和智能系统实验室(SRI)的计算机科学教授马丁·韦切夫(Martin Vechev)表示：“对量子计算机编程对研究人员来说仍然是一项挑战，这就是为什么我如此兴奋，我们现在可以继续苏黎世大学在量子计算机和编程语言开发方面的传统。”\n他补充道：“我们的量子编程语言Silq允许程序员比现有语言更好地利用量子计算机的潜力，因为代码更紧凑、更快、更直观，对程序员来说也更容易理解。”本周，Vechev将在PLDI 2020编程语言会议上向该领域的其他专家介绍Silq。为了便于讨论、采用和进一步开发，他和他的团队还在自己的网站(silq.ethz.ch)上发布了Silq。\n在过去的十年里，量子计算受到了越来越多的关注，因为这些根据量子物理原理运行的计算机具有巨大的潜力。今天，大多数研究人员相信，这些计算机总有一天能够比经典计算机更快地解决某些问题，因为它们在进行计算时使用的是纠缠量子态，其中不同比特的信息在某个时间点重叠。这意味着在未来，量子计算机将能够高效地解决经典计算机无法在合理的时间框架内解决的问题。\n这一量子优势仍有待最终证明。然而，最近取得了一些重大的技术进步。2019年夏末，一台量子计算机成功地解决了一个问题-尽管是一个非常具体的问题-比最快的经典计算机更快。\n对于某些“量子算法”，即计算策略，也是众所周知的，它们比没有开发量子计算机潜力的经典算法更快。然而，到目前为止，这些算法仍然不能在现有的量子硬件上计算，因为量子计算机目前仍然太容易出错。\n利用量子计算的潜力不仅需要最新的技术，还需要一种量子编程语言来描述量子算法。原则上，算法是解决问题的“配方”；编程语言描述算法，以便计算机可以执行必要的计算。\n今天，量子编程语言与特定的硬件紧密相连；换句话说，它们精确地描述了底层电路的行为。对于程序员来说，这些“硬件描述语言”既繁琐又容易出错，因为单独的编程指令必须非常详细，从而明确描述实现量子算法所需的细节。\nSilq允许比使用现有语言更好地利用量子计算机的潜力。马丁·维切夫(Martin Vechev)，计算机科学教授。\n这就是Vechev和他的团队开发Silq的原因。Vechev团队的博士生本杰明·比切尔(Benjamin Bichsel)正在监督Silq的开发，他说：“Silq是第一种主要不是围绕硬件的结构和功能而设计的量子编程语言，而是在程序员想要解决问题时根据他们的思维模式设计的，而不需要他们理解计算机体系结构和实现的每个细节，”Vechev团队的博士生本杰明·比切尔(Benjamin Bichsel)正在监督Silq的开发。\n计算机科学家将从特定类型计算机的技术细节中抽象出来的计算机语言称为高级编程语言。Silq是量子计算机的第一种高级编程语言。高级编程语言更具表现力，这意味着它们甚至可以用更少的代码来描述复杂的任务和算法。这使得程序员更容易理解和使用它们。它们还可以与不同的计算机体系结构一起使用。\nSilq给量子编程语言带来的最大创新和简化涉及到目前为止一直困扰量子编程的错误来源。计算机分几个中间步骤计算任务，这会创建中间结果或临时值。\n为了释放内存，经典计算机会自动擦除这些值。计算机科学家将此称为“垃圾收集”，因为多余的临时值会被处理掉。\n在量子计算机的情况下，由于量子纠缠，这种处理更加棘手：之前计算的值可能会与当前的值相互作用，干扰正确的计算。因此，在量子计算机上清理这样的临时值需要一种更先进的所谓的非计算技术。\n“Silq是第一种自动识别和擦除不再需要的值的编程语言，”Bichsel解释说。计算机科学家通过应用他们对经典编程语言的知识实现了这一点：他们的自动计算方法只使用没有任何特殊量子操作的编程命令，正如韦切夫和比切尔所说的那样，它们是“qfree”的。\n“就优化量子计算机的编程而言，Silq是一个重大突破；它不是开发的最后阶段，”Vechev说。仍然有许多悬而未决的问题，但由于Silq更容易理解，Vechev和Bichsel希望既能刺激量子编程语言的进一步发展，也能刺激新量子算法的理论和开发。\n“我们的四人团队在两年的工作后取得了突破，这要归功于语言设计、量子物理和实现方面的不同专业知识的结合。如果其他研发团队接受我们的创新，这将是一个巨大的成功，“Bichsel说。\nBichsel B，Baader M，Gehr T，Vechev M.Silq：一种具有安全计算和直观语义的高级量子语言。PLDI 2020：第41届ACM SIGPLAN编程语言设计与实现会议论文集，2020年6月，286-300。DOI：10.1145/3385412.3386007", "note_en": "Several technical advances have been achieved recently in the pursuit of powerful quantum computers. Now, Computer scientists from ETH Zurich have made an important breakthrough in the field of programming languages: their quantum language is the first of its kind that is as elegant, simple and safe as classical computer languages.\n  Programming quantum computers is becoming easier: computer scientists at ETH Zurich have designed the first programming language that can be used to program quantum computers as simply, reliably and safely as classical computers. “Programming quantum computers is still a challenge for researchers,” says Martin Vechev, computer science professor in ETH’s Secure, Reliable and Intelligent Systems Lab ( SRI ), “which is why I’m so excited that we can now continue ETH Zurich’s tradition in the development of quantum computers and programming languages.”\n He adds: “Our quantum programming language Silq allows programmers to utilize the potential of quantum computers better than with existing languages, because the code is more compact, faster, more intuitive and easier to understand for programmers.” This week, Vechev will introduce Silq to  other experts in the field  at PLDI 2020, a conference for programming languages. To facilitate discussion, adoption and further development, he and his team have also released Silq on its own website ( silq.ethz.ch ).\n Quantum computing has been seeing increased attention over the last decade, since these computers, which function according to the principles of quantum physics, have enormous potential. Today, most researchers believe that these computers will one day be able to solve certain problems faster than classical computers, since to perform their calculations they use entangled quantum states in which various bits of information overlap at a certain point in time. This means that in the future, quantum computers will be able to efficiently solve problems which classical computers cannot solve within a reasonable timeframe.\n This quantum supremacy has still to be proven conclusively. However, some significant technical advances have been achieved recently. In late summer 2019, a quantum computer succeeded in solving a problem – albeit a very specific one – more quickly than the fastest classical computer.\n For certain “quantum algorithms”, i.e. computational strategies, it is also known that they are faster than classical algorithms, which do not exploit the potential of quantum computers. To date, however, these algorithms still cannot be calculated on existing quantum hardware because quantum computers are currently still too error-prone.\n  Utilizing the potential of quantum computation not only requires the latest technology, but also a quantum programming language to describe quantum algorithms. In principle, an algorithm is a “recipe” for solving a problem; a programming language describes the algorithm so that a computer can perform the necessary calculations.\n Today, quantum programming languages are tied closely to specific hardware; in other words, they describe precisely the behaviour of the underlying circuits. For programmers, these “hardware description languages” are cumbersome and error-prone, since the individual programming instructions must be extremely detailed and thus explicitly describe the minutiae needed to implement quantum algorithms.\n   Silq allows to utilize the potential of quantum computers better than with existing languages.\r  Martin Vechev, Professor of Computer Science\n   This is where Vechev and his group come in with their development of Silq. “Silq is the first quantum programming language that is not designed primarily around the construction and functionality of the hardware, but on the mindset of the programmers when they want to solve a problem – without requiring them to understand every detail of the computer architecture and implementation,” says Benjamin Bichsel, a doctoral student in Vechev’s group who is supervising the development of Silq.\n Computer scientists refer to computer languages that abstract from the technical details of the specific type of computer as high-level programming languages. Silq is the very first high-level programming language for quantum computers. High-level programming languages are more expressive, meaning that they can describe even complex tasks and algorithms with less code. This makes them more comprehensible and easier to use for programmers. They can also be used with different computer architectures.\n  The greatest innovation and simplification that Silq brings to quantum programming languages concerns a source of errors that has plagued quantum programming until now. A computer calculates a task in several intermediate steps, which creates intermediate results or temporary values.\n In order to relieve the memory, classical computers automatically erase these values. Computer scientists refer to this as “garbage collection”, since the superfluous temporary values are disposed of.\n In the case of quantum computers, this disposal is trickier due to quantum entanglement: the previously calculated values can interact with the current ones, interfering with the correct calculation. Accordingly, cleaning up such temporary values on quantum computers requires a more advanced technique of so-called uncomputation.\n “Silq is the first programming language that automatically identifies and erases values that are no longer needed,” explains Bichsel. The computer scientists achieved this by applying their knowledge of classical programming languages: their automatic uncomputation method uses only programming commands that are free of any special quantum operations – they are “qfree”, as Vechev and Bichsel say.\n “Silq is a major breakthrough in terms of optimising the programming of quantum computers; it is not the final phase of development,” says Vechev. There are still many open questions, but because Silq is easier to understand, Vechev and Bichsel hope to stimulate both the further development of quantum programming languages and the theory and development of new quantum algorithms.\n “Our team of four has made the breakthrough after two years of work thanks to the combination of different expertise in language design, quantum physics and implementation. If other research and development teams embrace our innovations, it will be a great success,” says Bichsel.\n   Bichsel B, Baader M, Gehr T, Vechev M. Silq: a high-level quantum language with safe uncomputation and intuitive semantics. PLDI 2020: Proceedings of the 41st ACM SIGPLAN Conference on Programming Language Design and Implementation, June 2020, 286–300. doi:  10.1145/3385412.3386007", "posttime": "2020-06-20 03:57:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,量子", "title": "第一种直观的量子计算机编程语言--苏黎世ETH", "title_en": "The first intuitive programming language for quantum computers – ETH Zurich", "transed": 1, "url": "https://ethz.ch/en/news-and-events/eth-news/news/2020/06/the-first-intuitive-programming-language-for-quantum-computers.html", "via": "", "real_tags": ["编程", "量子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007309, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "7月12日，Sourcegraph基于LSIF的精确代码智能将在一年前首次提交。\nSourcegraph的精确代码智能功能是由用户上传的LSIF索引驱动的，这些LSIF索引是在他们自己的构建和持续集成系统中创建的。浏览已编制索引的代码时，所有悬停工具提示、定义和参考结果都是精确的，而不是启发式的(基于搜索结果，这是无配置的默认设置)。\n这篇帖子反映了随着精确代码英特尔服务通过附加功能、不断变化的环境要求、强化、性能改进、重构和一次不同语言的重大重写而成熟的高级技术变化。这些更改跨越了超过527个提交的+324K/-277K代码行。\n严格来说，我可能不能称这篇文章为软件考古工作(因为它只有一年的历史，它得到了积极的使用，而不是遗留的代码库，主要作者仍然在这里谈论它，而且它也不是完全没有文档记录的)。称它为历史文物可能更准确，但恐龙比书籍更酷，所以欢迎来到挖掘现场。\nChris Wendt将该服务的初稿写成一个简单的TypeScript express服务器，由前端服务的HTTP API代理。这使公共服务的数量保持在较低水平，并使请求身份验证流保持在单个代码路径上。Express服务器将接受原始LSIF输入，并将其原封不动地存储在磁盘上。通过概念验证LSIF特定扩展对lsif服务器的查询将读取该存储库的原始LSIF数据，将其解析到内存中，并遍历图表以构造适当的响应。\n选择打字稿在当时是很自然的：(当时称为)codenav团队由后来的网络和代码情报团队组成。TypeScript是团队的一项主要核心能力，另外一个好处是能够在未发布的Visual Studio代码扩展中重用服务器包中的代码，以便使用LSIF协议的功能使用者(此时只有0.4.0)启动服务。\n这段代码，以及它的编写方式，绝对是MVP的黄金标准。它做了它需要做的事情，以征求用户的反馈，并在可能的功能宇宙中找到自己的位置。正如所有此类最低实现应该注意的那样，它缺乏对可伸缩性、性能和健壮性的关注(因为您不会在立即废弃的特性上花费精力)。\n在这个公关开通十天后，我将作为Codenav团队的一员开始我在Sourcegraph的旅程。大约在这个时候，Sourcegraph决定取消语言服务器工作的优先顺序，以支持构建基础设施，以实现LSIF索引支持的精确代码智能。LSIF公告的博客文章概述了我们选择转移重点的一些原因。这使我们能够在扩展其功能集以最终包含语言服务器当前提供的内容的同时，将改进服务的可伸缩性、性能和健壮性方面的工作进行预算。\n要解决的第一个问题是选择如何在服务中表示LSIF数据。MVP只是将原始LSIF输入保存在磁盘上，按需将其解析到内存中。并不是每个查询都会从头开始解析LSIF输入-有一个LRU缓存允许多个请求命中相同的LSIF索引，而无需重新解析。但是，LSIF索引可能非常大。首先，将这些索引读取到内存中的时间是不可忽略的，在内存中存储即使是几个大索引也可能导致OOM崩溃。\n我们需要找到一种方法来仅查询我们回答查询所需的索引部分，并且我们需要找到一种高效地进行查询的方法。我们决定在上传时将原始LSIF数据转换为内部协议无关的格式，让我们完全控制存储格式。通过控制存储格式，可以针对建议的访问模式高效地设计存储格式：\n为了证明或反驳一种存储格式相对于另一种存储格式的性能，我们构建了两个版本的后端(Dgraph后端实现可以在这里找到)。基准测试显示，SQLite和Dgraph后端的上传性能都与输入大小成正比：SQLite的系数在2.2倍到2.8之间，Dgraph的系数在25倍之间。增加这种性能差异的因素可能是多方面的，包括缺乏图形数据库的经验、没有DGRAPH的操作经验，以及对图形模式的错误选择。\n我们选择使用SQLite运行，因为它具有更高的初始性能、熟悉性和易于操作的特性。SQLite仍然是Sourcegraph中代码智能捆绑包的磁盘格式。\n在此更改之后，原始LSIF上载被立即处理到存储在磁盘上的SQLite文件中，查询只需要访问包含目标源范围的文档。这里适用标准的SQL设计和技巧。\n在上一次更改之后，不再在查询路径中解析原始LSIF数据，而是在上载时解析原始LSIF数据。但是，上载仍然是一个HTTP请求，它受制于OSI第5层及更低层的属性、规则和突发奇想。转换过程本身很繁重，而且在优化方面没有得到太多关注-处理大型文件所需的时间会比某些客户端、服务器和/或代理超时时间更长，并且最终会断开对中等大小有效负载的上传请求。\n上传一个大文件仍然很容易导致整个过程崩溃，在转换过程中它仍然必须将该文件读取到内存中。因为转换发生在HTTP处理程序中，所以也很容易通过上传多个小文件使lsif-server崩溃，这些小文件的总和超过了分配给lsif-server的内存资源。\n我们选择的解决方案是将处理工作从Express服务器提取到另一个服务中，该服务将工作从共享队列中提取出来。上传操作变得很快，因为它只需要传输有效负载就可以命中磁盘，而不需要完全转换。一次处理一个上载可确保一系列上载不会使系统崩溃，而处理大型上载可以通过增加分配给lsif-worker进程的内存来补救。今天，lsif-worker被称为精确编码的intel-worker。\n作为共享队列的选择，我们选择了node-resque，这是Rails生态系统中流行的resque库的Node.js端口。这个库使用Redis存储作业数据，它已经是我们堆栈的一个组件。另一种选择包括使用postgres(它是我们堆栈的一个组件，但由一小部分服务保护)，使用某种本地IPC(这将阻止我们将来独立地扩展lsif-server和lsif-worker)，以及使用AMQP服务器(它还不是我们堆栈中的现有组件)。\n到目前为止，我们将转换后的LSIF索引数据一对一地存储在SQLite数据库中：每个上传的LSIF索引都成为磁盘上的单个数据库。为了支持跨存储库查询(跳到远程定义，查找跨存储库的引用)，我们有一个额外的xrepo.db数据库，它允许我们通过它们提供的版本化包和它们所依赖的版本化包来查找索引。\n到目前为止，我们有一个lsif-server实例和一个lsif-worker实例，它们都部署在相同的Docker容器中，以便两个进程可以共享相同的持久磁盘空间。为了拆分这些服务并进行水平扩展，我们需要将xrepo.db拥有的数据从SQLite中迁移出来，这不允许来自多个进程的并发写入。将这些数据移到我们现有的Postgres实例中很容易：开始和结束状态都定义了几个简单的表，并且不需要任何花哨的技巧。\n额外写入的未知规模令我们担忧。是否会导致操作问题或影响应用程序无关部分的性能？为安全起见，我们保持表空间不相交(带前缀的表名，没有指向现有表的外键)，并计划支持将此数据库迁移到第二个Postgres实例中。这需要我们使用db_link执行一些令人讨厌的诡计，以便运行迁移，我们发现这非常痛苦，并最终恢复。一些粗略的计算表明，负荷不会压倒Postgres(这无论如何都是很难做到的-Postgres是相当厉害的)。谢天谢地，这些计算结果是正确的。\n此更改将作业队列的接口更新为使用BULL而不是节点重新排队。这不是一个重大的架构改变，但是更新库确实消除了我们遇到的一些操作问题，比如员工滞留和失业。切换到新的库还释放了一些额外的功能，比如按时间表运行作业，并能够列出处于特定状态的作业(借助Redis的EVAL命令的魔力，可以在作业有效负载中搜索与查询匹配的文本)。\n作业队列的演变仍在继续。此更改会将入队/出队作业的接口更新为目标Postgres，而不是Redis。这大大降低了复杂性。lsif-server和lsif-worker都不再依赖Redis，Redis在应用程序的所有其他部分都被用作临时的、可中继的缓存。所有进入Bull拥有的数据的自定义Lua脚本都可以简化为几个SQL语句。\n减少交易期间发生突变的服务数量始终是一件好事。此更改还允许我们为作业队列重用现有的Postgres事务。不再可能在成功转换时提交Postgres事务，但无法将作业标记为已在队列中解决，因为修改队列现在可以作为事务的一部分完成。\n此时，lsif-server只能由前端中未记录的代理访问。此代理既用于接受上传有效负载，也用于查询特定源范围的定义、引用和悬停文本。此API的唯一使用者是Sourcegraph创作的语言扩展(sourcegraph/go、source graph/typecript)。\n这些数据比简单地支持跳转到定义要有用得多，并且被浪费在未记录的API后面。更改使相同的数据通过GraphQL API在扩展外部可见。这不仅为Sourcegraph的其他功能(如活动和当前正在进行的代码洞察)提供了查询，也为Sourcegraph的外部扩展作者和任何想要运行即席查询的用户打开了查询空间。随着我们通过LSIF索引收集的数据持续增长(我们最近增加了对诊断的支持)，可能的使用范围也在不断扩大。我们很高兴能发现这些数据的用途在前方。\n此时，lsif-server和lsif-worker捆绑在同一个容器中。我们决定预先派生容器中运行的工作进程的数量，从而增加一次可以处理的上载数量。\n这是一种基本的水平扩展方式，因为资源仍然限于物理节点，并且工作进程之间不存在隔离：如果一个工作进程正在处理特定的大型上载，可能会导致其他进程耗尽内存。所有工作进程将立即崩溃，lsif-server进程也将随之崩溃。\n在这一点上，这是一个合理的权衡，并为我们带来了一些快速的胜利，同时增加了处理吞吐量。这一特别的改变还帮助我们克服了Sourceraph.com部署中遇到的一些问题，当时我们的Sourceraph.com部署正受到线头阻塞的困扰。\n一直以来，我们的计划是在必要时水平扩展lsif-server和lsif-worker实例(工作器可能需要首先扩展，因为他们执行的CPU和内存密集型工作最多)。不幸的是，我误解了Kubernetes持久卷的功能：我假设磁盘可以作为RWX或读写多个节点挂载到多个节点上。事实证明，这种访问模式只有几个卷插件(Azure、CephFS、Glusterfs和NFS等等)支持。我们用于Sourceraph.com部署的GCEPersistentDisk插件不支持此访问模式。\n我们前进的道路是增加另一个层次的间接性，老实说，这是解决大多数问题的办法。此更改引入了一个新的lsif-dump-manager，今天称为精确代码英特尔捆绑管理器，该服务拥有持久磁盘。\n这从lsif-server和lsif-worker中解放了读取或写入磁盘的任何责任，使它们能够自由地水平和无状态地扩展。扩展转储管理器本身是一个不同的问题，但由于我们的Gitserver的分片特性，我们已经有了一些经验。\n在这一点上，代码导航团队已经被分成网络和代码英特尔已经有一段时间了。在代码英特尔团队的成员发生了一些变化后，我们获得了很多围棋人才，但也失去了一些打字人才。我们不再拥有相同的核心能力，从组织和架构的角度来看，重写现有的打字脚本后端代码以便将其与更大的Sourcegraph代码库统一起来是有意义的。\n我们决定慢慢地将每个服务重写为Go。我们的高级计划是首先将lsif-server完成的CPU受限工作提取到一个高性能的GO进程中，该进程可以被现有的工作者代码调用(这类似于重构的扼杀图模式)。堆栈的这一部分似乎从重写中获益最多，并允许我们使用现有知识来积极优化围棋，而不必学习Node.js环境的低级优化技术。最终，越来越多的工人将落入围棋代码的事件范围，最终整个工人将被取代。\n事实证明，在用不同的语言修复所有错误之后，用您熟悉的一种语言编写相同的系统是相当容易的，而我只是在一次通过中重写了所有这三个服务。由此产生的代码并不是特别习惯用法，因为它实际上是一个快速的、行为等价的目标语言翻译。自重写以来，为了将代码塑造成更适合新环境的东西，一直在进行不断的、小规模的重构。\n这释放了大量的性能改进机会，其结果将在Sourcegraph 3.17发布公告中详细说明。技术细节在一篇关于精确代码英特尔性能改进的博客文章中进行了描述。\n在GO中重写服务之后，lsif-server进程不再保持本地状态，并且对它的查询不再跨越语言边界。几乎没有理由将这项服务分开。前端的HTTP API和GraphQL解析器使用的客户端能够直接执行与旧服务器的HTTP处理程序相同的功能，并且可以删除新未使用的HTTP服务器/路由代码。\n这一变化在上面提到的关于精确代码英特尔性能改进的博客文章中有更详细的讨论。\n旅程不会在这里停下来。我们计划继续增加功能，并对服务进行调整，以支持大规模。我们关注的问题包括(但不限于)：\n创建大规模公共索引(以支持从私有代码跳转到OSS)", "note_en": "On July 12, Sourcegraph&#39;s LSIF-based precise code intelligence will have received its first commit a year ago.\n  Sourcegraph&#39;s  precise code intelligence features are driven by user-uploaded LSIF indexes created in their own build and continuous integration systems. When browsing code that has been indexed, all hover tooltips, definitions, and reference results are  precise rather than heuristic (based off of search results, which is the no-configuration default).\n This post reflects on the high-level technical changes as the precise code intel services matured through additional features, changing environment requirements, hardening, performance improvements, refactoring, and one major rewrite in a different language. These changes span +324k/-277k lines of code over 527 commits.\n I may not  strictly be able to call this post a work of  software archaeology (since it&#39;s only a year old, it&#39;s actively used, not a legacy codebase, the primary author is still here to talk about it, and it isn&#39;t completely undocumented). It may be more accurate to call it a  historiographical artifact, but dinosaurs are cooler than books so welcome to the dig site.\n    Chris Wendt wrote the initial draft of the service as a simple TypeScript express server proxied by the HTTP API of the frontend service. This kept the number of public services low and kept the request authentication flow to a single code path. The express server would accept raw LSIF input and store it on disk, unchanged. Queries to the lsif-server through a proof of concept LSIF-specific  extension would read the raw LSIF data for that repository, parse it into memory, and walk the graph to construct the appropriate response.\n  The choice of TypeScript was a natural one at the time: the (then called) codenav team consisted of what would later become the web and the code intelligence teams. TypeScript was a major core competency of the team, and there was an additional benefit of being able to reuse code from the  server package in an unpublished Visual Studio Code  extension to jump start the service with a functional consumer of the LSIF protocol (which was only 0.4.0 at this point in time).\n This code, and the manner in which it was written, was absolutely the golden standard of an MVP. It did exactly what it needed to in order to solicit feedback from users and find its place in the universe of possible features. As all such minimum implementations should be, it lacked attention to scalability, performance, and robustness (because you do  not spend that energy on a feature that is immediately scrapped).\n I would begin my journey at Sourcegraph as a member of the codenav team ten days after this PR was opened. Around this time, Sourcegraph had made the decision to de-prioritize the work on language servers in support of building out an infrastructure to enable precise code intelligence supported by LSIF indexes. The  LSIF announcement blog post outlines some of the reasons we chose to shift our focus. This allowed us to budget the effort into improving scalability, performance, and robustness of the service while extending its feature set to eventually subsume what language servers were currently providing.\n   The first issue to tackle was choosing how to represent LSIF data within the service. The MVP simply kept the raw LSIF input on disk, parsing it into memory on demand. Not every query would parse the LSIF input from scratch - there was an LRU cache that would allow multiple requests to hit the same LSIF index without re-parsing. However, LSIF indexes can be  very large. The time to read these indexes into memory in the first place was non-negligible, and storing even a few large indexes in memory was likely to cause an OOM crash.\n We needed to find a way to query only the portion of the index we needed to answer a query, and we needed to find a way to do it efficiently. We decided to convert the raw LSIF data into an internal protocol-oblivious format on upload, giving us complete control over the storage format. Having control of the storage format allowed it to be designed efficiently for the proposed access patterns:\n    In order to prove or disprove the performance of one storage format over the other, we built two versions of the backend (the Dgraph backend implementation can be found  here). Benchmarks showed that the upload performance of the SQLite and Dgraph backends were both proportional to the input size: SQLite with a factor between 2.2x and 2.8, and Dgraph with a factor of 25x. There were likely multiplying factors that increased this performance discrepancy, including lack of experience with graph databases, no operational experience with Dgraph, and a bad choice of graph schema.\n We chose to run with SQLite due to its higher initial performance, familiarity, and easy operational properties. SQLite is still the on-disk format for code intelligence bundles in Sourcegraph.\n After this change, raw LSIF uploads were processed immediately into a SQLite file which is stored on disk, and queries need only to access the documents containing the target source range. Standard SQL design and tricks apply here.\n   After the previous change, raw LSIF data was no longer parsed in the query path but at upload time. However, the upload is still an HTTP request that is subject to the properties, rules, and whims of  OSI layer 5 and below. The conversion process itself is heavy and hasn&#39;t received much love in terms of optimization - processing large files would take longer than some client, server, and/or proxy timeouts, and would end up disconnecting upload requests for even moderately sized payloads.\n It was still very easy to crash the entire process by uploading a large file, which it still had to read into memory during conversion. Because conversion happens within an HTTP handler, it was also easy to crash the lsif-server by uploading multiple small files, the sum of which exceed the memory resources allotted to the lsif-server.\n The solution we chose was to extract the processing work from the express server into another service which pulls work off of a shared queue. Upload operations became fast as it only required the transfer of the payload to hit disk and not be fully converted. Processing one upload at a time ensured that a series of uploads would not crash the system, and processing large uploads could be remedied by increasing the memory allocated to the lsif-worker process. The lsif-worker is known today as the precise-code-intel-worker.\n  As a choice of shared queue, we went with  node-resque, which is a Node.js port of the  resque library popular in the Rails ecosystem. This library uses Redis to store the job data, which was already a component of our stack. Alternative choices included using Postgres (which was a component of our stack but guarded by a small list of services), using some sort of local  IPC (which would prevent us from scaling the lsif-server and lsif-workers independently in the future), and using an AMQP server (which was not yet an existing component in our stack).\n   Up until this point, we were storing converted LSIF index data in SQLite databases one-to-one: each uploaded LSIF index became a single database on-disk. In order to support cross-repository queries (jump to remote definition, find references across repositories) we had an additional  xrepo.db database that allowed us to look up indexes by the versioned packages that they provide and the versioned packages on which they depend.\n So far, we had one instance of the lsif-server and one instance of the lsif-worker, both deployed in the same Docker container so that both processes could share the same persistent disk space. In order to break these services apart and scale horizontally, we needed to migrate the data owned by  xrepo.db out of SQLite, which does not allow concurrent writes from multiple processes. Moving this data into our existing Postgres instance was easy: both the beginning and end states defined a few simple tables and didn&#39;t require any fancy tricks.\n  The unknown scale of additional writes concerned us. Would it cause operational issues or affect the performance of unrelated parts of the application? To be safe, we kept the table spaces disjoint (prefixed table names, no foreign keys to existing tables) and planned to support migrating this database into a second Postgres instance. This required us doing some nasty trickery with  db_link in order to run migrations, which we found quite painful and  eventually reverted. Some back-of-the-envelope calculations showed that the load wouldn&#39;t overwhelm Postgres (which is difficult to do anyway - Postgres is quite the beast). Thankfully, these calculations turned out to be correct.\n   This change updates the interface to the job queue to use  bull instead of  node-resque. This was not a major architectural change, but updating the library did remove some operational issues we were experiencing with stuck workers and lost jobs. Switching to the new library also unlocked some additional features such as running jobs on a schedule à la cron and being able to list the jobs in a particular state (and with the magic of Redis&#39;s  EVAL command,  searching within job payloads for text matching a query).\n      The evolution of the job queue continues. This change updates the interface over enqueueing/dequeueing jobs to target Postgres instead of Redis. This reduces a lot of complexity. Both the lsif-server and lsif-worker no longer rely on Redis, which was used as an ephemeral and truncatable cache in all other parts of the application. All of the custom Lua scripts that reach into the data owned by Bull could be reduced into a few SQL statements.\n  Reducing the number of services in which mutations occur during a transaction is always a win. This change allowed us to re-use existing Postgres transactions for the job queue as well. It&#39;s no longer possible to commit a Postgres transaction on successful conversion yet fail to mark the job as resolved in the queue, as modifying the queue can now be done as part of the transaction.\n   At this point, the lsif-server was accessible only by an undocumented proxy in the frontend. This proxy was used to both accept upload payloads, and to query the definitions, references, and hover text of particular source ranges. The only consumers of this API were Sourcegraph-authored language extensions ( sourcegraph/go,  sourcegraph/typescript).\n  This data is much more useful than simply powering jump-to-def and is wasted behind an undocumented API. The change made the same data visible outside of the extension through the GraphQL API. This not only opened up queries to be used by other Sourcegraph features (such as  Campaigns and the currently in-progress Code Insights), but to Sourcegraph-external extension authors and to any user that wants to run ad-hoc queries. As the data we gather through LSIF indexes continues to grow (we&#39;ve recently added support for  diagnostics), so does the universe of possible uses. We&#39;re excited to discover what uses of this data lies ahead.\n   At this point, the lsif-server and lsif-worker were bundled within the  same container. We decided to  prefork the number of worker processes running in the container, increasing the number of uploads that could be processed at one time.\n This is a rudimentary way to scale horizontally, as the resources are still limited to the physical nodes and there is no isolation between workers: if one worker is processing a particular large upload, it can cause the other processes to run out of memory. All of the workers will crash at once and take the lsif-server process down with them.\n  At this point it was a reasonable tradeoff, and gave us some quick wins with increased processing throughput. This particular change also helped us get past some issues we were having in our  Sourcegraph.com deployment, which was suffering from  head-of-line blocking.\n   The plan, all along, was to scale the lsif-server and lsif-worker instances horizontally when necessary (the workers were likely needed to scale first as they do the most CPU and memory-intensive work). Unfortunately, I had misunderstood the capabilities of Kubernetes persistent volumes: I was assuming that the disk could be mounted as  RWX, or read-write-many, over multiple nodes. As it turns out, this access mode is only supported by a few volume plugins (Azure, CephFS, Glusterfs, and NFS to name a few). The GCEPersistentDisk plugin, which we use for our  Sourcegraph.com deployment, does not support this access mode.\n  Our path forward was to add  another level of indirection, which is honestly the solution to  most problems. This change introduces a new lsif-dump-manager, known today as the precise-code-intel-bundle-manager, the service that owns the persistent disk.\n  This frees any responsibility of reading or writing to the disk from the lsif-server and the lsif-worker, making them free to scale horizontally and statelessly. Scaling the dump managers themselves is a different problem, but one we have some experience with already due to the sharded nature of our gitservers.\n    At this point, the code nav team had been split into the web and code intel for some time. After a few changes in the code intel team&#39;s membership, we gained a  lot of Go talent and lost a bit of TypeScript talent. We no longer had the same core competencies, and it made sense from both an organizational and architectural standpoint to rewrite the existing TypeScript backend code in order to unify it with the greater Sourcegraph codebase.\n We decided to  slowly rewrite each of the services into Go. Our high-level plan was to first extract the CPU-bound work done by the lsif-server into a high-performance Go process which could be called by the existing worker code (this is similar to the  strangler fig pattern of refactoring). This part of the stack seemed to benefit the most from a rewrite, and allowed us to use existing knowledge to aggressively optimize Go rather than having to learn low-level optimization techniques for Node.js environments. Eventually, more and more of the worker would fall into the Go code&#39;s event horizon, and eventually the entire worker would be replaced.\n  Turns out it&#39;s pretty easy to write the same system in a language you know well after fixing all the bugs in a different language, and I just rewrote all three services in a single pass. The resulting code wasn&#39;t particularly idiomatic as it really was meant to be a fast, behaviorally-equivalent translation into the target language. Constant, small refactorings have been occurring since the rewrite in order to shape the code into something more appropriate for the new environment.\n This has unlocked a large number of performance improvement opportunities, the results of which will be detailed in the Sourcegraph 3.17 release announcement. The technical details are described in a blog post on  performance improvements for precise code intel.\n    After rewriting the services in Go, the lsif-server process maintained no local state, and queries to it no longer crossed a language boundary. There was little reason to keep the service separate. The client used by the frontend&#39;s HTTP API and GraphQL resolvers was able to directly perform the same functions as the old server&#39;s HTTP handlers, and the newly unused HTTP server/routing code could be dropped.\n  This change is discussed in more detail in the above mentioned blog post on  performance improvements for precise code intel.\n  The journey is not stopping here. We plan to continue to add features, and adjust the service so that we can support massive scale. Concerns on our horizon include (but are not limited to):\n The creation of a large-scale public index (to support jumping from private code to OSS)", "posttime": "2020-06-20 03:56:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,英特尔,precise", "title": "精确代码英特尔后端的发展", "title_en": "Evolution of the precise code intel back end", "transed": 1, "url": "https://about.sourcegraph.com/blog/evolution-of-the-precise-code-intel-backend", "via": "", "real_tags": ["代码", "英特尔", "precise"]}, {"category": "", "categoryclass": "", "imagename": "022ae1f163e3837faf7572f4d1b4761b.png", "infoid": 1007308, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已经快4年了。他们有4年了！我们学到了很多东西。我很疲惫，但最重要的是，我很高兴，我很感激，我很有希望。\nGHC向线型的旅程始于2016年秋天。在这个时间点上，Jean-Philippe Bernardy和我从事分布式存储研发已经有一年左右的时间了。在此之前，我们两人都刚刚发表了对线性逻辑的研究。而且，我们开始在很多地方看到线性类型的机会：对于内存管理，为了概括协议类型，可以使用管理缓冲区…。在这个项目中，它成了一个反复出现的笑话：“你知道怎么做才能帮上忙吗？”线性类型！“。\n我猜，在重复了足够多的笑话之后，你会开始想，也许它不应该是一个笑话。也许线型真的会有帮助。何乐而不为呢？所以我们决定给那头牦牛刮胡子。\n不过，老实说：我认为这是不可能的。我真的认为要将线性类型添加到一种语言中，您需要从头开始重新设计它。也就是说，真正创造了一种新的语言。但是，幸运的是，让-菲利普知道得更清楚。他想出了一个令人信服的设计，将线性类型添加到GHC中。我当时在船上。\n2016年秋天，我和同事马修·博斯普弗卢格(Mathieu Boespflug)集思广益，用了几个月的时间完善了我们的设计。冬天，西蒙·佩顿·琼斯(Simon Peyton Jones)和瑞安·牛顿(Ryan Newton)加入了我们的行列，努力将我们仍然相当粗糙的想法转化为足够坚实的设计，足以保证发表学术论文。到2017年秋天，我们的文章在POPL2018上被接受发表，并伴随着原型实施。\n原型机只修改了GHC的前端，还没有接触到Coreet。然而，我们有足够的信心在2017年11月编写了一份用线性类型扩展GHC的提案。在接下来的三周里，这项提议吸引了200条评论。我们最终关闭了提案公关进行大修。由于200条评论在当时听起来太多了，我们选择在2018年2月以令人难忘的数字111作为单独的公关重新启动该提案。该提案的第二次迭代于2018年10月被接受。该提案总共收集了近600条评论，仅可与创纪录的点句法提案相媲美。多棒的一次旅行啊！\n在对这项建议进行激烈辩论的同时，我们继续实施。实现不会说谎：我们开始它是为了找出我们在设计中可能遗漏了什么。确实，我们在设计中发现了一些漏洞。Matthew Pickering从2018年4月到7月作为实习的一部分加入我们，他承担了在Core内部实现第一个线性类型的费力的任务。仅让GHC二次编译就花了大约两个月的时间。在这个过程中，Matthew发现了我们的向后兼容性故事中的错误。所以我们更新了我们的设计和提案。\n2018年10月，我的同事Krzysztof Gogolewski加入了这个项目。而且，为了让人们了解线型的工作有时会有多么平淡无奇，我们继续将线型的当前状态与GHC的大师进行了合并。一项需要两周以上的全职工作的任务。在接下来的一年里，Krzyszto坚持不懈地粉碎了提案中剩余的缺陷和不足之处。\n为什么是一年？嗯，事实证明，一个看起来很无辜的设计选择：扩展𝜂的数据构建器，最终成为了一项巨大的事业。我们不得不与GHC中真正的错误作斗争，或者只是代码中隐含的、无意识的假设，这些假设需要相当多的工作才能解开。\n那是2019年的夏天，我们已经准备好了，或者说我们是这么认为的。今年秋天，西蒙·佩顿·琼斯(Simon Peyton Jones)和理查德·艾森伯格(Richard Eisenberg)将在剑桥参加一个集中审查会议。发现了一些小故障。在这个实现的过程中，发生了很多研究：向Core传授线性类型并不像仅仅实现线性逻辑那么简单，甚至不像我们文章中的微积分那样简单，但这是另一个时代的故事。我们必须在现场做更多的调查。\n我们在2020年1月之前解决了这些故障。今年剩下的时间一直专注于狩猎表现的回归。\n让我确信不会忘记理查德·艾森伯格在这一切中所扮演的角色。理查德引领了这项提议，审阅了整个3000条线路板(好几次！)，引导了合并，并在性能上提供了至关重要的帮助。可以肯定的是，这不是一项卑鄙的任务！\n特别感谢Andreas Klebinger，他对线性类型分支进行了几次基准测试，以帮助确定性能回归；感谢Ben Gamari，他运行并分析了线性类型补丁上的8h基准测试。\n现在我们到了。4年来，在GHC中发现了近30个错误(大多数是我们自己修复的)1，之后又发现了200多个内部拉取请求。这在很大程度上是一项集体工作，我非常感谢参与其中的每一个人。\n在GHC 8.12中将有线性类型。但别指望会有成品。这是我们的第一次迭代，可以说是MVP。这是我们认为对任何人都有用的最小功能集。但它仍然主要针对早期采用者和急于修修补补的人。\n打开-XLinearTypes，您可能会注意到的第一件事是，错误消息通常是没有帮助的：您会收到键入错误，告诉您承诺线性使用变量，但没有使用。它是如何线性使用的？嗯，这是给你喝的。虽然有时出错的地方非常明显，但要找出错误往往是很棘手的。\n没有多态的中缀语法。您可以将前缀形式Fun p a b用于多态为p的箭头。但是：\n多数情况下不支持多态，并且您可以预期大多数时间都会出现行为不正常的情况。\n我的同事Divesh Otwani发现了一个窍门，你可以用它来解决这个问题，那就是用。\n当然，也会有错误。可能很多。我们将很高兴收到您关于GHC错误跟踪器的错误报告。\n当GHC8.12发布时，我们将发布LINEAR-BASE的第一个版本，这是一个帮助您开始使用线性类型的工具包。它包含来自Haskell基本库的许多函数的线性化版本、两种函数、带纯API的可变数据结构、用于安全资源管理的单值、线性光学、用于免分配阵列管线的API、…。\n线性基库目前由我的同事DiveshOtwani开发，之前由Bhavik Mehta在Tweag暑期实习期间开发。\n显然，要使GHC中的线型体验流畅，我们还有很多工作要做。完成提案的设计，而且很可能超出提案的范围。\n但接下来最重要的是你。到目前为止，线性打字主要是专家的课题，他们确实提出了许多应用。但是，就我个人而言，我发现这个企业最令人兴奋的是，将线性类型添加到主流编译器中，可以让更多的人使用它们。尽管专家们很聪明，但他们无法与许多倍于配备类型检查器的程序员相匹敌。甚至不是很接近。\n所以一定要玩耍，修补，实验，想出点子，建立图书馆。这一切都将非常令人着迷。我们为您提供线性基础，让您开始，但也许它不适合您，然后您可以建立自己的东西。有一个巨大的设计空间可供探索。一切都在我们面前。我就是其中之一，迫不及待地想看看哈斯克尔社区会拿出什么来。", "note_en": "It’s been almost 4 years. And what 4 years they were! We learned somuch. I am exhausted, but mostly, I’m happy, I’m thankful, and I’mhopeful.\n   The journey towards linear types in GHC started in the fallof 2016. At this point in time, Jean-Philippe Bernardy and I had beenworking on distributed storage R&amp;D for a year or so. Prior to that wehad both fairly freshly published research into linear logic. And, westarted seeing opportunities for linear types pretty mucheverywhere: for memory management, to generalise protocol types, tomanage buffers… It had become a recurring joke in this project: “Youknow what would help with this? Linear types!”.\n I guess that after repeating a joke enough, you start wonderingwhether maybe it shouldn’t be a joke. Maybe linear types would reallybe helpful. Why not after all? And so we decided to  shave thatyak.\n I’ll be honest though: I didn’t think it was possible. I reallythought that to add linear types to a language, you would need toredesign it from the ground up. That is, really create a newlanguage. But, fortunately, Jean-Philippe knew better. He came up witha convincing design to add linear types to GHC. I was on board.\n In the fall of 2016, together with my colleague Mathieu Boespflug, webrainstormed for a couple of months, refined our design. In thewinter, we were joined by Simon Peyton Jones and Ryan Newton, in theeffort of turning our idea, still quite rough, into a design solidenough to warrant an academic publication. By the fall of 2017, our article was accepted for publication at  POPL2018 and accompanied by a prototype implementation.\n  The prototype only modified the front end of GHC and didn’t touch Coreyet. Yet we felt confident enough to write a  proposal for extendingGHC with linear types in November 2017. Overthe course of the three following weeks, this proposal attracted 200comments. We eventually closed the proposal PR for heavyrevision. Because 200 comments sounded so massive at the time, weelected to reopen the proposal  as a separate PR,with the memorable number 111, in February 2018. This second iterationof the proposal was accepted  in October2018. Altogether, the proposal has gathered almost600 comments, comparable only to the  record dot-syntaxproposal. What a ride!\n While the proposal was being hotly debated, we carried on with theimplementation. An implementation doesn’t lie: we started it to find outwhat we might have missed in our design. And, indeed, wefound some holes in the design. Matthew Pickering joined us from Aprilto July 2018 as part of an internship.He undertook the frankly thankless task of making thefirst implementation of linear types inside Core. Just making GHCcompile again took about 2 months. In the process, Matthew  foundbugs in our backward compatibility story. And sowe updated our design, and the proposal.\n  In October 2018, my colleague Krzysztof Gogolewski joined theproject. And, to give an idea of how unglamorous working on lineartypes could be at times, proceeded to merge the current state oflinear types with GHC’s master. A task which took upwards of two weeksof full-time work. Over the course of the next year, Krzysztofrelentlessly squashed the remaining bugs and infelicities to theproposal.\n Why a year? Well, it turns out that one innocent looking designchoice:  𝜂-expanding data constructors, ended up beinga massive undertaking. We have had to fight  bona fide bugs in GHC,or simply implicit, unconscious, assumptions in the code whichrequired quite a bit of work to unravel.\n It was the summer of 2019, and we were ready, or so we thought. Wearranged for a focused review session in the Fall, in Cambridge, withSimon Peyton Jones and Richard Eisenberg. And glitches were found. Inthe course of this implementation, a lot of research had happened: itturns out that teaching linear types to Core is not as simple as justimplementing linear logic, or even the calculus from our article, but this is a story for another time. We hadto do more research on the spot.\n We addressed the glitches by January 2020. The rest of the year hasbeen focused on hunting performance regressions.\n Let me be sure not to forget Richard Eisenberg’s role in allthis. Richard shepherded the proposal, reviewed the entire 3000 linepatch (several times!), shepherded the merge, and helped out cruciallywith performance. No mean task to be sure!\n Special thanks go to Andreas Klebinger, who benchmarked the lineartypes branch several times to help pinpoint the performanceregression, and to Ben Gamari, who ran and analysed an  8hbenchmark on the linear types patch.\n And here we are. 4 years, nearly 30 bugs found in GHC (most we fixedourselves)  1, and over 200 internal pull requests later. Thisis very much a collective work, and I’m hugely thankful to everyoneinvolved.\n   There will be linear types in GHC 8.12. But don’t expect a finishedproduct. This is our very first iteration, an  MVP as itwere. This is as minimal a set of features we think can be useful foranybody. But it’s still very much aimed at early adopters and eagertinkerers.\n Turn on  -XLinearTypes, and the first thing you will notice,probably, is that the error messages are typically unhelpful: you willget typing errors saying that you promised to use a variable linearly,but didn’t. How hasn’t it been used linearly? Well, it’s for you topuzzle out. And while what went wrong is sometimes egregiouslyobvious, it can often be tricky to figure the mistake out.\n  There is no infix syntax for multiplicity polymorphism.You can use the prefix form  FUN p a b for an arrow withmultiplicity  p. However:\n Multiplicity polymorphism is mostly unsupported, and you can expectit to misbehave most of the time.\n   A trick, found by my colleague Divesh Otwani, which you can use to work aroundthis is to replace\n  And, of course, there will be bugs. Probably many. We will be happy toreceive your bug reports on the  GHC bug tracker.\n  When GHC 8.12 is released, we will release the first version of linear-base, a toolkit to get you started with linear types. Itcontains linearised versions of many functions from the Haskell baselibrary,  two kinds of functors,  mutable datastructures with pureAPI,a  monad for safe management ofresources, linearoptics,an API for  allocation-free arraypipelines,…\n The linear-base library is currently being developed by my colleague DiveshOtwani, and previously by Bhavik Mehta, during his summer internshipat Tweag.\n  Evidently, we still have a lot of work ahead of us to make lineartypes in GHC a smooth experience. Completing the design of theproposal, and, probably, going beyond the proposal.\n But what’s next, above all, is you. Until now, linear typing has beenmostly a subject for experts, who did propose many applications. Butwhat I, personally, find most exciting about this enterprise is thatadding linear types to a mainstream compiler makes them available tomany more people. And as clever as the experts are, they are no matchagainst many times more programmers armed with a type checker. Noteven close.\n So by all means, play, tinker, experiment, come up with ideas, buildlibraries. This will all be extremely fascinating. We provide you withlinear-base to get you started, but maybe it’s not the right thingfor you, and then you can build your own. There is a huge design space toexplore. It’s all ahead of us. And I, for one, can’t wait to see whatthe Haskell community comes up with.", "posttime": "2020-06-20 03:55:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "类型,types,线性", "title": "线性类型在GHC中合并", "title_en": "Linear types are merged in GHC", "transed": 1, "url": "https://www.tweag.io/blog/2020-06-19-linear-types-merged", "via": "", "real_tags": ["类型", "types", "线性"]}]