[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1070817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本文档描述了与 Internet 用户使用 DNS 相关的隐私问题。它提供了对当前典型隐私实践的一般观察。它旨在分析​​当前情况，并不规定解决方案。本文档废弃了 RFC 7626。 ¶ 本文档不是 Internet Standards Track 规范；它是为了信息目的而发布的。 ¶ 本文档是互联网工程任务组 (IETF) 的产品。它代表了 IETF 社区的共识。它已接受公众审查，并已被互联网工程指导组 (IESG) 批准出版。并非所有 IESG 批准的文件都适用于任何级别的互联网标准；请参阅 RFC 7841 的第 2 节。¶ 有关本文档的当前状态、任何勘误表以及如何提供反馈的信息，请访问 https://www.rfc-editor.org/info/rfc9076。 ¶ 版权所有 (c) 2021 IETF Trust 和确定为文档作者的人员。版权所有。 ¶ 本文件受 BCP 78 和 IETF Trust 的与 IETF 文件相关的法律规定 (https://trustee.ietf.org/license-info) 的约束，在本文件发布之日生效。请仔细阅读这些文件，因为它们描述了您对本文件的权利和限制。从本文档中提取的代码组件必须包含 Trust Legal Provisions 第 4.e 节中所述的简化 BSD 许可文本，并且不提供如简化 BSD 许可中所述的保证。 ¶ 本文档是对 DNS 隐私问题的分析，本着 [RFC6973] 第 8 节的精神。 ¶\n域名系统 (DNS) 在 [RFC1034]、[RFC1035] 和许多后来从未被合并的 RFC 中指定。它是互联网最重要的基础设施组件之一，经常被互联网用户（甚至许多专业人士）忽视或误解。互联网上的几乎所有活动都以 DNS 查询（通常是几个）开始。它的使用涉及许多隐私问题，本文档试图提供一个全面而准确的列表。 ¶ 让我们从 DNS 工作原理的简单提示开始（另见 [RFC8499]）。客户端（存根解析器）向称为递归解析器（也称为缓存解析器、完整解析器或递归名称服务器）的服务器发出 DNS 查询。让我们使用查询“www.example.com 的 AAAA 记录是什么？”举个例子。 AAAA 是 QTYPE（查询类型），www.example.com 是 QNAME（查询名称）。 （下面的描述假设一个冷缓存，例如，因为服务器刚刚启动。）递归解析器将首先查询根名称服务器。在大多数情况下，根名称服务器将发送推荐。在此示例中，引用将指向 .com 名称服务器。解析器向 .com 名称服务器之一重复查询。 .com 名称服务器反过来将引用 example.com 名称服务器。然后 example.com 名称服务器将返回答案。根名称服务器、.com 的名称服务器和 example.com 的名称服务器称为权威名称服务器。在分析隐私问题时，重要的是要记住向所有这些名称服务器提出的问题始终是原始问题，而不是衍生问题。发送到根名称服务器的问题是“www.example.com 的 AAAA 记录是什么？”，而不是“.com 的名称服务器是什么？”。通过重复完整的问题，而不是只是问题的相关部分到下一行，DNS 向名称服务器提供了比必要更多的信息。在这个简化的描述中，递归解析器没有实现 [RFC7816] 中描述的 QNAME 最小化，它只会将问题的相关部分发送到上游名称服务器。 ¶ DNS 严重依赖缓存，所以上面描述的算法实际上有点复杂，并不是所有的问题都发送到权威的名称服务器。如果存根解析器几秒钟后询问递归解析器，“_xmpp-server._tcp.example.com 的 SRV 记录是什么？”，递归解析器将记住它知道 example.com 的名称服务器，并且只会查询它们，绕过根和 .com。由于存根解析器中通常没有缓存，与权威服务器不同，递归解析器会看到所有 DNS 流量。 （应用程序，如 Web 浏览器，可能具有某种形式的不遵循 DNS 规则的缓存，例如，因为它可能会忽略 TTL。因此，递归解析器不会看到所有名称解析活动。）¶ 应该注意DNS 递归解析器有时会将请求转发到其他递归解析器，通常是更大的机器，具有更大和更多的共享缓存（查询层次结构可以更深，具有两级以上的递归解析器）。从隐私的角度来看，这些转发器类似于解析器，只是它们看不到所有发出的请求（由于第一个解析器中的缓存）。 ¶ 在撰写本文时，几乎所有这些 DNS 流量目前都未加密发送。然而，DNS over TLS (DoT) [RFC7858] 和 DNS over HTTPS (DoH) [RFC8484] 的部署越来越多，尤其是在移动设备、浏览器和任播递归 DNS 解析服务提供商。在少数情况下，存在一些替代通道加密，例如，在 IPsec VPN 隧道中，至少在存根解析器和解析器之间。最近对加密 DNS 流量的服务质量的一些分析可以在 [dns-over-encryption] 中找到。 ¶ 今天，几乎所有的 DNS 查询都是通过 UDP [thomas-ditl-tcp] 发送的。在考虑将流量加密作为一种可能的隐私技术时，这具有实际影响。一些加密解决方案只为 TCP 而设计，而不是 UDP，尽管新的解决方案仍在出现 [RFC9000] [DPRIVE-DNSOQUIC]。 ¶ 在分析 DNS 的隐私问题时要记住的另一个重点是，服务器收到的 DNS 请求是出于不同原因触发的。假设窃听者想知道用户查看了哪个网页。对于典型的网页，会发出三种 DNS 请求： ¶\n这是用户键入、从书签中选择或通过单击超链接选择的 URL 中的域名。据推测，这正是窃听者感兴趣的地方。 ¶ 这些是由用户代理（此处为 Web 浏览器）执行的附加请求，用户没有任何直接参与或知识。对于 Web，它们由嵌入内容、级联样式表 (CSS)、JavaScript 代码、嵌入图像等触发。在某些情况下，单个网页上可能有数十个不同上下文中的域名。 ¶ 这些是 DNS 服务本身执行的附加请求。例如，如果查询的答案是对一组名称服务器的引用并且未返回粘合记录，则解析器将不得不发送额外的请求以将名称服务器的名称转换为 IP 地址。同样，即使返回了胶水记录，谨慎的递归服务器也会发送第三方请求来验证这些记录的 IP 地址。 ¶ 还可以注意到，在典型的 Web 浏览器的情况下，会发送比绝对必要更多的 DNS 请求，例如，预取用户稍后可能查询的资源或在地址栏中自动完成 URL 时。两者都是重要的隐私问题，因为它们甚至可能泄露有关非显式操作的信息。例如，仅读取本地 HTML 页面，即使不选择超链接，也可能触发 DNS 请求。 ¶ 本文档主要侧重于研究最终用户（执行 DNS 请求的用户）的隐私风险。普遍监视的风险 [RFC7258] 被考虑以及来自更集中监视的风险。在本文档中，术语“最终用户”按照 [RFC8890] 中的定义使用。 ¶ 本文档不尝试比较个别网络或组织提供的特定隐私保护；它仅对典型的当前做法进行一般性观察。 ¶ 区域持有者的隐私风险（某人获取数据的风险）在 [RFC5155] 和 [RFC5936] 中讨论。 ¶\n递归运营商（包括访问提供商和企业网络中的运营商）的隐私风险，例如私有命名空间或阻止列表的泄漏，超出了本文档的范围。 ¶ 这里不考虑与使用其他利用 DNS 信息的协议相关的隐私风险。 ¶ 以下四节概述了与最终用户的 DNS 不同方面相关的隐私注意事项。在阅读这些部分时，需要记住许多注意事项（例如，递归解析器和传输协议）可能特定于设备在给定时间点使用的网络上下文。用户可能有许多设备，并且每个设备可能在一段时间内甚至同时使用许多不同的网络（例如，家庭、工作、公共或蜂窝）。对单个用户的隐私考虑的详尽分析需要考虑所使用的设备集和每个设备的多个动态上下文。本文档并未尝试进行如此复杂的分析；相反，它概述了可能构成此类分析基础的各种考虑因素。 ¶ 已经声明“DNS 中的数据是公开的”。这句话对于 Internet 范围的查找系统很有意义，并且所涉及的数据和元数据有多个方面值得更详细地查看。首先，尽管有访问控制列表 (ACL) 和私有命名空间，但 DNS 的运行假设面向公众的权威名称服务器将响应对其授权的任何区域的“通常”DNS 查询，而无需客户端的进一步身份验证或授权（解析器）。由于缺乏搜索功能，只有给定的 QNAME 才会显示与该名称相关联的资源记录（或该名称不存在）。换句话说：一个人需要知道要请求什么才能收到回复。目前所谓的“私有”资源泄漏的方式有很多。一些示例是 DNSSEC NSEC 区域行走 [RFC4470]、被动 DNS 服务 [passive-dns] 等。区域传输 QTYPE [RFC5936] 通常被阻止或限制为经过身份验证/授权访问以强制执行此差异（可能出于其他原因） ）。 ¶ DNS 数据与特定 DNS 事务（即 DNS 名称查找）之间的另一个区别：DNS 数据和 DNS 查询的结果是公开的，在上述范围内，并且可能没有任何保密要求。但是，单笔交易或一系列交易并非如此；这些交易不是/不应该是公开的。单个事务同时显示查询的发起者和查询内容；这可能会泄露有关特定用户的敏感信息。 DNS 世界之外的一个典型例子是，Alcoholics Anonymous 的网站是公开的，但您访问它的事实不应该公开。此外，链接查询的能力揭示了有关个人使用模式的信息。 ¶ DNS 请求包括许多字段，但其中两个字段似乎与隐私问题特别相关：QNAME 和源 IP 地址。 “源IP地址”在“源IP地址+可能是源端口号”的松散意义上使用，因为端口号也在请求中，可以用来区分共享一个IP地址的几个用户（在一个运营商后面-等级 NAT (CGN)，例如 [RFC6269]）。 ¶ QNAME 是用户发送的全名。它提供有关用户做什么的信息（“example.net 的 MX 记录是什么？”意味着他们可能想向 example.net 上的某人发送电子邮件，该域名可能只有少数人使用，因此非常揭示沟通关系）。一些 QNAME 比其他 QNAME 更敏感。例如，查询知名网络统计域的 A 记录揭示的很少（每个人都访问使用此分析服务的网站），但查询 www.verybad.example 的 A 记录，其中 verybad.example 是组织的域有些人认为令人反感或令人反感的内容可能会给用户带来更多问题。此外，有时，QNAME 嵌入了人们使用的软件，这可能是一个隐私问题（例如，_ldap._tcp.Default-First-Site-Name._sites.gc._msdcs.example.org。还有一些 BitTorrent 客户端查询 _bittorrent-tracker._tcp.domain.example 的 SRV 记录。¶\nQNAME 隐私的另一个重要事项是未来的使用。今天，缺乏隐私是将潜在敏感或个人身份数据放入 DNS 的障碍。目前，您的 DNS 流量可能会显示您正在交换电子邮件，而不是与谁交换电子邮件。如果您的邮件用户代理 (MUA) 开始在 DNS [RFC7929] 中查找 Pretty Good Privacy (PGP) 密钥，那么隐私就变得更加重要。电子邮件只是一个例子；对隐私更友好的 DNS 还会有其他真正有趣的用途。 ¶ 对于存根解析器和递归解析器之间的通信，源IP地址是用户机器的地址。因此，有关收集 IP 地址的所有问题和警告都适用于此。对于递归解析器和权威名称服务器之间的通信，源IP地址具有不同的含义；它与 HTTP 连接中的源地址的状态不同。通常，递归解析器的 IP 地址在某种程度上“隐藏”了真实用户。但是，隐藏并不总是有效。有时会使用 edns-client-subnet (ECS) EDNS0 选项 [RFC7871]（请参阅 [denis-edns-client-subnet] 中的一项隐私分析）。有时最终用户在他们的机器上有一个个人递归解析器。在这两种情况下，向权威服务器发起查询的 IP 地址与 HTTP [sidn-entrada] 一样敏感。 ¶ 关于 IP 地址的说明：尽管 [RFC7721] 确实讨论了 IPv6 地址生成机制的隐私注意事项，但目前还没有 IETF 文档详细描述有关 IP 地址的所有隐私问题。同时，这里的讨论旨在包括 IPv4 和 IPv6 源地址。由于多种原因，它们的分配和使用特性不同，这可能对与源地址收集相关的信息泄漏细节产生影响。 （例如，在公共 Internet 上看到的特定 IPv6 源地址比 IPv4 地址更不可能源自地址共享方案。）但是，对于 IPv4 和 IPv6 地址，重要的是要注意源地址是传播的通过 ECS 选项进行查询，并包含有关发起它们的主机、用户或应用程序的元数据。 ¶ 在撰写本文时，DNS 负载本身中不包含标准化的客户端标识符（如 [RFC7871] 中所述，ECS 被广泛使用；然而，[RFC7871] 只是一个信息 RFC）。 ¶ DNS Cookies [RFC7873] 是一种轻量级的 DNS 事务安全机制，它提供有限的保护，以防止路径外攻击者进行的各种日益普遍的服务和放大/伪造或缓存中毒攻击。然而，需要注意的是，它们仅用于验证 IP 地址（并​​且应该在客户端的 IP 地址更改后更改），但它们并非旨在主动跟踪用户（如 HTTP cookie）。 ¶ 在非标准 EDNS(0) 选项 [RFC6891] 中插入了媒体访问控制 (MAC) 地址甚至用户名的轶事帐户，用于存根到解析器通信以支持在解析器上实现的专有功能（例如，父母过滤）。 ¶ 递归解析器缓存的内容可以揭示有关使用它的客户端的数据（隐私风险取决于客户端的数量）。有时可以通过发送 RD=0 的 DNS 查询来检查此信息以检查缓存内容，尤其是查看 DNS TTL [grangeia.snooping]。由于这也是后续缓存中毒攻击的侦察技术，因此已经开发并部署了一些对策[缓存-窥探-防御]。 ¶\n对于未加密的传输，DNS 流量可以像任何其他流量一样被窃听者看到。 （[RFC4033] 中指定的 DNSSEC，明确将机密性排除在其目标之外。）因此，如果发起方开始与接收方进行 HTTPS 通信，HTTP 流量将被加密，但之前的 DNS 交换将不会被加密。当其他协议变得越来越注重隐私并防止监视时（例如，[RFC8446]、[RFC9000]），使用未加密的 DNS 传输可能成为隐私中的“最薄弱环节”。需要注意的是，在撰写本文时，正在尝试加密 TLS 握手 [RFC8744] 中的服务器名称标识 (SNI)，这是连接目标最后剩余的非 DNS 明文标识符之一。 ¶ DNS 流量的一个重要特性是它可能采用与发起方和接收方之间的通信不同的路径。例如，窃听者可能无法窃听发起者和接收者之间的线路，但可以访问通往递归解析器或权威名称服务器的线路。 ¶ 从窃听者的角度来看，最好的窃听位置显然是在存根解析器和递归解析器之间，因为流量不受 DNS 缓存的限制。 ¶ 存根解析器和世界其他地方之间的攻击面可能会有很大差异，具体取决于最终用户设备的配置方式。按增加攻击面的顺序： ¶ 递归解析器可以位于最终用户的设备上。在（目前）少数情况下，个人可能会选择在本地机器上运行自己的 DNS 解析器。在这种情况下，stubresolver 和缓存解析器之间连接的攻击面仅限于该单机。递归解析器将向权威解析器公开数据，如第 6.2 节所述。 ¶ 递归解析器可能位于本地网络边缘。对于任何/大多数企业网络和一些住宅网络，缓存解析器可能存在于本地网络边缘的服务器上。在这种情况下，攻击面是本地网络。请注意，在大型企业网络中，DNS 解析器可能不会位于本地网络的边缘，而是位于整个企业网络的边缘。在这种情况下，企业网络可以被认为类似于下面提到的 Internet AccessProvider (IAP) 网络。 ¶ 递归解析器可以在 IAP 网络中。对于大多数住宅网络和可能的其他网络，典型情况是用户设备配置（通常通过 DHCP 或中继代理选项自动）客户驻地设备 (CPE) 中的 DNS 代理地址，然后指向 DNS 递归解析器在 IAP。因此，在线攻击的攻击面是从终端用户系统跨本地网络和跨 IAP 网络到 IAP 的递归解析器。 ¶\n递归解析器可以是公共 DNS 服务（或托管在公共 Internet 上的私人运行的 DNSresolver）。某些机器可能被配置为使用公共 DNS 解析器，例如 tho ......", "note_en": "This document describes the privacy issues associated with the use of the DNS by Internet users. It provides general observations about typical current privacy practices. It is intended to be an analysis of the present situation and does not prescribe solutions. This document obsoletes RFC 7626. ¶\n This document is not an Internet Standards Track specification; it is published for informational purposes. ¶\n This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are candidates for any level of Internet Standard; see Section 2 of RFC 7841. ¶\n Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at   https://www.rfc-editor.org/info/rfc9076. ¶\n Copyright (c) 2021 IETF Trust and the persons identified as the document authors. All rights reserved. ¶\n This document is subject to BCP 78 and the IETF Trust&#39;s Legal Provisions Relating to IETF Documents (  https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License. ¶\n  This document is an analysis of the DNS privacy issues, in the spirit of   Section 8 of [ RFC6973]. ¶\n The Domain Name System (DNS) is specified in  [ RFC1034],  [ RFC1035], and many later RFCs, which have never been consolidated. It is one of the most important infrastructure components of the Internet and is often ignored or misunderstood by Internet users (and even by many professionals). Almost every activity on the Internet starts with a DNS query (and often several). Its use has many privacy implications, and this document is an attempt at a comprehensive and accurate list. ¶\n Let us begin with a simplified reminder of how the DNS works (see also  [ RFC8499]). A client, the stub resolver, issues a DNS query to a server called the recursive resolver (also called caching resolver, full resolver, or recursive name server). Let&#39;s use the query &#34;What are the AAAA records for www.example.com?&#34; as an example. AAAA is the QTYPE (Query Type), and www.example.com is the QNAME (Query Name). (The description that follows assumes a cold cache, for instance, because the server just started.) The recursive resolver will first query the root name servers. In most cases, the root name servers will send a referral. In this example, the referral will be to the .com name servers. The resolver repeats the query to one of the .com name servers. The .com name servers, in turn, will refer to the example.com name servers. The example.com name servers will then return the answers. The root name servers, the name servers of .com, and the name servers of example.com are called authoritative name servers. It is important, when analyzing the privacy issues, to remember that the question asked to all these name servers is always the original question, not a derived question. The question sent to the root name servers is &#34;What are the AAAA records for www.example.com?&#34;, not &#34;What are the name servers of .com?&#34;. By repeating the full question, instead of just the relevant part of the question to the next in line, the DNS provides more information than necessary to the name server. In this simplified description, recursive resolvers do not implement QNAME minimization as described in  [ RFC7816], which will only send the relevant part of the question to the upstream name server. ¶\n DNS relies heavily on caching, so the algorithm described above is actually a bit more complicated, and not all questions are sent to the authoritative name servers. If the stub resolver asks the recursive resolver a few seconds later, &#34;What are the SRV records of _xmpp-server._tcp.example.com?&#34;, the recursive resolver will remember that it knows the name servers of example.com and will just query them, bypassing the root and .com. Because there is typically no caching in the stub resolver, the recursive resolver, unlike the authoritative servers, sees all the DNS traffic. (Applications, like web browsers, may have some form of caching that does not follow DNS rules, for instance, because it may ignore the TTL. So, the recursive resolver does not see all the name resolution activity.) ¶\n It should be noted that DNS recursive resolvers sometimes forward requests to other recursive resolvers, typically bigger machines, with a larger and more shared cache (and the query hierarchy can be even deeper, with more than two levels of recursive resolvers). From the point of view of privacy, these forwarders are like resolvers except that they do not see all of the requests being made (due to caching in the first resolver). ¶\n At the time of writing, almost all this DNS traffic is currently sent unencrypted. However, there is increasing deployment of DNS over TLS (DoT)  [ RFC7858] and DNS over HTTPS (DoH)  [ RFC8484], particularly in mobile devices, browsers, and by providers of anycast recursive DNS resolution services. There are a few cases where there is some alternative channel encryption, for instance, in an IPsec VPN tunnel, at least between the stub resolver and the resolver. Some recent analysis on the service quality of encrypted DNS traffic can be found in  [ dns-over-encryption]. ¶\n Today, almost all DNS queries are sent over UDP  [ thomas-ditl-tcp]. This has practical consequences when considering encryption of the traffic as a possible privacy technique. Some encryption solutions are only designed for TCP, not UDP, although new solutions are still emerging  [ RFC9000]  [ DPRIVE-DNSOQUIC]. ¶\n Another important point to keep in mind when analyzing the privacy issues of DNS is the fact that DNS requests received by a server are triggered for different reasons. Let&#39;s assume an eavesdropper wants to know which web page is viewed by a user. For a typical web page, there are three sorts of DNS requests being issued: ¶\n  This is the domain name in the URL that the usertyped, selected from a bookmark, or chose by clicking on ahyperlink. Presumably, this is what is of interest for theeavesdropper. ¶\n     These are the additional requests performed bythe user agent (here, the web browser) without any directinvolvement or knowledge of the user. For the Web, they aretriggered by embedded content, Cascading Style Sheets (CSS),JavaScript code, embedded images, etc. In some cases, there canbe dozens of domain names in different contexts on a single webpage. ¶\n     These are the additional requests performed bythe DNS service itself. For instance, if the answer to a query isa referral to a set of name servers and the glue records are notreturned, the resolver will have to send additional requests to turnthe name servers&#39; names into IP addresses. Similarly, even ifglue records are returned, a careful recursive server will sendtertiary requests to verify the IP addresses of those records. ¶\n It can also be noted that, in the case of a typical web browser, more DNS requests than strictly necessary are sent, for instance, to prefetch resources that the user may query later or when autocompleting the URL in the address bar. Both are a significant privacy concern since they may leak information even about non-explicit actions. For instance, just reading a local HTML page, even without selecting the hyperlinks, may trigger DNS requests. ¶\n This document focuses mostly on the study of privacy risks for the end user (the one performing DNS requests). The risks of pervasive surveillance  [ RFC7258] are considered as well as risks coming from a more focused surveillance. In this document, the term &#34;end user&#34; is used as defined in  [ RFC8890]. ¶\n This document does not attempt a comparison of specific privacy protections provided by individual networks or organizations; it makes only general observations about typical current practices. ¶\n Privacy risks for the holder of a zone (the risk that someone gets the data) are discussed in  [ RFC5155] and  [ RFC5936]. ¶\n Privacy risks for recursive operators (including access providers and operators in enterprise networks) such as leakage of private namespaces or blocklists are out of scope for this document. ¶\n  The privacy risks associated with the use of other protocols that make use of DNS information are not considered here. ¶\n The following four sections outline the privacy considerations associated withdifferent aspects of the DNS for the end user. When reading these sections, itneeds to be kept in mind that many of the considerations (for example, recursiveresolver and transport protocol) can be specific to the network context that adevice is using at a given point in time. A user may have many devices, and eachdevice might utilize many different networks (e.g., home, work, public, orcellular) over a period of time or even concurrently. An exhaustive analysis ofthe privacy considerations for an individual user would need to take intoaccount the set of devices used and the multiple dynamic contexts of eachdevice. This document does not attempt such a complex analysis; instead, itpresents an overview of the various considerations that could form the basis ofsuch an analysis. ¶\n It has been stated that &#34;the data in the DNS is public&#34;. This sentence makes sense for an Internet-wide lookup system, and there are multiple facets to the data and metadata involved that deserve a more detailed look. First, access control lists (ACLs) and private namespaces notwithstanding, the DNS operates under the assumption that public-facing authoritative name servers will respond to &#34;usual&#34; DNS queries for any zone they are authoritative for, without further authentication or authorization of the client (resolver). Due to the lack of search capabilities, only a given QNAME will reveal the resource records associated with that name (or that name&#39;s nonexistence). In other words: one needs to know what to ask for in order to receive a response. There are many ways in which supposedly &#34;private&#34; resources currently leak. A few examples are DNSSEC NSEC zone walking  [ RFC4470], passive DNS services  [ passive-dns], etc. The zone transfer QTYPE  [ RFC5936] is often blocked or restricted to authenticated/authorized access to enforce this difference (and maybe for other reasons). ¶\n Another difference between the DNS data and a particular DNS transaction (i.e., a DNS name lookup): DNS data and the results of a DNS query are public, within the boundaries described above, and may not have any confidentiality requirements. However, the same is not true of a single transaction or a sequence of transactions; those transactions are not / should not be public. A single transaction reveals both the originator of the query and the query contents; this potentially leaks sensitive information about a specific user. A typical example from outside the DNS world is that the website of Alcoholics Anonymous is public but the fact that you visit it should not be. Furthermore, the ability to link queries reveals information about individual use patterns. ¶\n The DNS request includes many fields, but two of them seem particularly relevant for the privacy issues: the QNAME and the source IP address. &#34;Source IP address&#34; is used in a loose sense of &#34;source IP address + maybe source port number&#34;, because the port number is also in the request and can be used to differentiate between several users sharing an IP address (behind a Carrier-Grade NAT (CGN), for instance  [ RFC6269]). ¶\n The QNAME is the full name sent by the user. It gives information about what the user does (&#34;What are the MX records of example.net?&#34; means they probably want to send email to someone at example.net, which may be a domain used by only a few persons and is therefore very revealing about communication relationships). Some QNAMEs are more sensitive than others. For instance, querying the A record of a well-known web statistics domain reveals very little (everybody visits websites that use this analytics service), but querying the A record of www.verybad.example where verybad.example is the domain of an organization that some people find offensive or objectionable may create more problems for the user. Also, sometimes, the QNAME embeds the software one uses, which could be a privacy issue (for instance, _ldap._tcp.Default-First-Site-Name._sites.gc._msdcs.example.org. There are also some BitTorrent clients that query an SRV record for _bittorrent-tracker._tcp.domain.example. ¶\n Another important thing about the privacy of the QNAME is future usages. Today, the lack of privacy is an obstacle to putting potentially sensitive or personally identifiable data in the DNS. At the moment, your DNS traffic might reveal that you are exchanging emails but not with whom. If your Mail User Agent (MUA) starts looking up Pretty Good Privacy (PGP) keys in the DNS  [ RFC7929], then privacy becomes a lot more important. And email is just an example; there would be other really interesting uses for a more privacy-friendly DNS. ¶\n For the communication between the stub resolver and the recursive resolver, the source IP address is the address of the user&#39;s machine. Therefore, all the issues and warnings about collection of IP addresses apply here. For the communication between the recursive resolver and the authoritative name servers, the source IP address has a different meaning; it does not have the same status as the source address in an HTTP connection. It is typically the IP address of the recursive resolver that, in a way, &#34;hides&#34; the real user. However, hiding does not always work. The edns-client-subnet (ECS) EDNS0 option  [ RFC7871] is sometimes used (see one privacy analysis in  [ denis-edns-client-subnet]). Sometimes the end user has a personal recursive resolver on their machine. In both cases, the IP address originating queries to the authoritative server is as sensitive as it is for HTTP  [ sidn-entrada]. ¶\n A note about IP addresses: there is currently no IETF document that describes in detail all the privacy issues around IP addressing in general, although  [ RFC7721] does discuss privacy considerations for IPv6 address generation mechanisms. In the meantime, the discussion here is intended to include both IPv4 and IPv6 source addresses. For a number of reasons, their assignment and utilization characteristics are different, which may have implications for details of information leakage associated with the collection of source addresses. (For example, a specific IPv6 source address seen on the public Internet is less likely than an IPv4 address to originate behind an address-sharing scheme.) However, for both IPv4 and IPv6 addresses, it is important to note that source addresses are propagated with queriesvia the ECS option and comprise metadata about the host, user,or application that originated them. ¶\n At the time of writing, there are no standardized client identifiers contained inthe DNS payload itself (ECS, as described in  [ RFC7871], is widely used; however,  [ RFC7871] is only an Informational RFC). ¶\n DNS Cookies  [ RFC7873] are a lightweight DNS transaction security mechanism thatprovides limited protection against a variety of increasingly commondenial-of-service and amplification/forgery or cache poisoning attacks byoff-path attackers. It is noted, however, that they are designed to just verifyIP addresses (and should change once a client&#39;s IP address changes), but they arenot designed to actively track users (like HTTP cookies). ¶\n There are anecdotal accounts of  Media Access Control (MAC) addressesand even user names being inserted in nonstandard EDNS(0) options  [ RFC6891]for stub-to-resolver communications to support proprietary functionalityimplemented at the resolver (e.g., parental filtering). ¶\n The content of recursive resolvers&#39; caches can reveal data about the clients using it (the privacy risks depend on the number of clients). This information can sometimes be examined by sending DNS queries with RD=0 to inspect cache content, particularly looking at the DNS TTLs  [ grangeia.snooping]. Since this also is a reconnaissance technique for subsequent cache poisoning attacks, some countermeasures have already been developed and deployed  [ cache-snooping-defence]. ¶\n For unencrypted transports, DNS traffic can be seen by an eavesdropper like any other traffic. (DNSSEC, specified in  [ RFC4033], explicitly excludes confidentiality from its goals.) So, if an initiator starts an HTTPS communication with a recipient, the HTTP traffic will be encrypted, but the DNS exchange prior to it will not be. When other protocols become more and more privacy aware and secured against surveillance (e.g.,  [ RFC8446],  [ RFC9000]), the use of unencrypted transports for DNS may become &#34;the weakest link&#34; in privacy. It is noted that, at the time of writing, there is ongoing work attempting to encrypt the Server Name Identification (SNI) in the TLS handshake  [ RFC8744], which is one of the last remaining non-DNS cleartext identifiers of a connection target. ¶\n An important specificity of the DNS traffic is that it may take a different path than the communication between the initiator and the recipient. For instance, an eavesdropper may be unable to tap the wire between the initiator and the recipient but may have access to the wire going to the recursive resolver or to the authoritative name servers. ¶\n The best place to tap, from an eavesdropper&#39;s point of view, is clearly between the stub resolvers and the recursive resolvers, because traffic is not limited by DNS caching. ¶\n The attack surface between the stub resolver and the rest of the world can vary widely depending upon how the end user&#39;s device is configured. By order of increasing attack surface: ¶\n The recursive resolver can be on the end user&#39;s device. In (currently) a small number of cases, individuals may choose tooperate their own DNS resolver on their local machine. In thiscase, the attack surface for the connection between the stubresolver and the caching resolver is limited to that singlemachine. The recursive resolver will expose data to authoritativeresolvers as discussed in  Section 6.2. ¶\n  The recursive resolver may be at the local network edge. Formany/most enterprise networks and for some residential networks, thecaching resolver may exist on a server at the edge of the localnetwork. In this case, the attack surface is the local network.Note that in large enterprise networks, the DNS resolver may notbe located at the edge of the local network but rather at the edgeof the overall enterprise network. In this case, the enterprisenetwork could be thought of as similar to the Internet AccessProvider (IAP) network referenced below. ¶\n  The recursive resolver can be in the IAP network. For most residentialnetworks and potentially other networks, the typical case is for theuser&#39;s device to be configured (typically automatically through DHCP orrelay agent options) with the addresses of the DNS proxy in the CustomerPremises Equipment (CPE), which in turnpoints to the DNS recursive resolvers at the IAP. The attack surface foron-the-wire attacks is therefore from the end user system across thelocal network and across the IAP network to the IAP&#39;s recursive resolvers. ¶\n  The recursive resolver can be a public DNS service (or a privately run DNSresolver hosted on the public Internet). Some machinesmay be configured to use public DNS resolvers such as tho\n......", "posttime": "2021-07-31 15:56:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "dns,privacy", "title": "DNS 隐私注意事项", "title_en": "DNS Privacy Considerations", "transed": 1, "url": "https://www.rfc-editor.org/rfc/rfc9076.html", "via": "", "real_tags": ["dns", "privacy"]}, {"category": "", "categoryclass": "", "imagename": "1c68b5e3ce8c011b5cb0a228d89dc808.jpg", "infoid": 1070816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您因为分心而失去了大量时间，并希望开始将更多时间花在重要的事情上，您可以从个人时间跟踪工具（如 RescueTime、Toggle 或 Daily）开始，以衡量和了解您的时间去向。当我在一个应用程序上工作时，我经常发现自己想要我的代码同样的东西：更多的时间花在我关心的事情上，更少的时间浪费在重复低价值的活动上。有时，在等待命令完成或测试通过时，我会问自己这似乎太慢了，我的电脑时间都去哪儿了？我们已经有很多用于类似任务的工具。如果您已经知道需要优化哪个关键代码路径，则可以单独针对它重复运行 Benchmark。或者，如果您想扫描整个系统的问题区域，您可以使用分析器来照亮资源最密集的操作。如果您只是想知道哪些请求和查询花费了太多时间，您可以注册十几个应用程序性能监控服务中的任何一个。相对而言，这个 API 端点是否花费更多时间查询数据、转换数据或通过网络响应？如果将不相关的操作（如慢速网络请求或数据库插入）隔离开来，新的 XML 解析器如何针对不同大小和类型的文件执行？如果没有自定义计时代码或侵入性的运行时自省，像这样的问题通常很难回答，其中任何一种都可能无意中影响系统的行为和性能——这正是您要测量的东西！所以这就是我们制作 time_up 的原因，这是一个新的 Ruby gem，可帮助您跟踪代码的时间去向。而且很容易使用！如果您曾经使用过秒表 ⏱，您就会确切地知道如何处理 README 的 mereskim。\n安装并需要 gem 后，您就可以开始测量应用程序的时间了！一种简单的入门方法是将计时器名称和块传递给 TimeUp.start，如下所示：transactions = Transaction .where( user: @user) # `TimeUp.start` 将返回块评估的任何内容 tomonthly_spending = TimeUp .start ( :processing) { Categoriesd_transactions = group_by_category(transactions)arrange_by_month(categorized_transactions)}payments = PaymentFinder .find(@user,monthly_spending)render json:present_summary(支出:monthly_spending,payments:payments)当你调用TimeUp.elapsed(:processing)你会得到一个 Float 返回值，表示 :processing 计时器运行时已经过去了多少秒。就像面积秒表一样，它会计算运行时经过的总秒数，即使你多次启动和停止它（也就是说，除非你调用 TimeUp.reset）。 process_timer = TimeUp .start(:processing)categorized_transactions = group_by_category(transactions)monthly_spending =arrange_by_month(categorized_transactions)process_timer .stop # 以秒为单位返回总经过时间 TimeUp 的大部分模块方法在每个定时器实例上都可用，因此 process_timer.elapsed给你结果。 gem 提供了许多用于控制计时器（停止、启动、重置）、检查其状态（活动？、TimeUp.active_timers）和收集基本统计信息（如计数、最小值、最大值、平均值、中值和百分位数）的方法。 README 中概述了完整的 API。但是 time_up 真正擅长的地方在于分别对不同的活动进行计时，因此您可以粗略比较您的应用程序花费时间的相关方面。它看起来有点凌乱，但继续这个例子，我们可以通过使用多个计时器按代码行为的每个类别划分我们的度量：\n交易 = TimeUp .start( :querying) { Transaction .where( user: @user)}process_timer = TimeUp .start( :processing)categorized_transactions = group_by_category(transactions)monthly_spending =arrange_by_month(categorized_transactions)process_timer .stoppayments = TimeUp .start( querying) { PaymentFinder .find(@user,monthly_spending)}render json: TimeUp .start(:presenting) {present_summary(plys:monthly_spending, Payments: Payments)} 无论你是为一个只运行一次的脚本计时还是重复调用这些块在像 Web 应用程序这样的长期进程中，您创建的所有计时器都将在进程的整个生命周期中持久存在于内存中。一旦你记录了一段时间，你可能想知道一切都花了多长时间！如上所述，gem 提供了许多方法来检查 TimeUp 模块和每个计时器实例上可用的计时器： &gt; TimeUp .elapsed( :presenting) =&gt; 1 。 0050 820000469685 &gt; query_timer = TimeUp .timer(:querying) &gt; query_timer .count =&gt; 2 &gt; query_timer .timings =&gt; [ 0 . 5051469999598339, 0 . 8050760000478476 ] &gt; query_timer .min =&gt; 0 。 5051469999598339 &gt; query_timer .max =&gt; 0 。 8050760000478476 &gt; query_timer .mean =&gt; 0 。 6551115000038408 &gt; TimeUp .total_elapsed =&gt; 2 。 822688000043854 &gt; TimeUp .all_stats =&gt; { :querying =&gt;{ :elapsed =&gt; 1 。 3102230000076815, :count =&gt; 2, :min =&gt; 0 。 5051469999598339, :max =&gt; 0 。 8050760000478476, :mean =&gt; 0 。 6551115000038408}, :processing =&gt;{ :elapsed =&gt; 0 。 5073829999892041, :count =&gt; 1, :min =&gt; 0 。 5073829999892041, :max =&gt; 0 。 5073829999892041, :mean =&gt; 0 。 5073829999892041}, :presenting =&gt;{ :elapsed =&gt; 1 。 0050 820000469685, :count =&gt; 1, :min =&gt; 1 。 0050 820000469685, :max =&gt; 1 。 0050 820000469685, :mean =&gt; 1 。 0050 820000469685}} 由于想要打印结果是很常见的，gem 提供了几种方法来快速输出所有定义的计时器的状态。如果您只执行一次计时的代码，您可以使用 TimeUp.print_summary 打印简单的经过时间摘要：\n如果您正在对重复调用的代码的行为进行计时（如在控制器操作或测试助手中），您可以打印一个更详细的表格，其中包括使用 TimeUp.print_detailed_summary 为每个命名计时器记录的所有计时的基本统计信息：&gt; TimeUp .print_detailed_summary ================================================ ================================ 姓名 |已过 |计数 |敏|最大 |意思 |中位数 |第 95 % ------------------------------------------------ --------------------------------- :querying | 1 . 31028 | 2 | 0 . 50520 | 0 . 80507 | 0 . 65514 | 0 . 65514 | 0 . 78221：处理| 0 . 50314 | 1 | 0 . 50314 | 0 . 50314 | 0 . 50314 | 0 . 50314 | 0 . 50314 :呈现| 1 . 0050 8 | 1 | 1 . 0050 8 | 1 . 0050 8 | 1 . 0050 8 | 1 . 0050 8 | 1 . 0050 8 如果你打算在一个漫长而混乱的过程中穿插你对 TimeUp 的使用，比如运行你的所有测试，那么在 at_exit 钩子中打印你的结果可能是最简单的。如果你想将它们输出到自定义记录器，两者都是方法接受 IO 参数。 time_up gem 是用于简单工作的简单工具。希望您下次发现自己想知道复杂操作的哪些部分花费最多时间时会记住它。如果您有任何问题或想法，请随时打开问题或在 Twitter 上联系我们！你是在家里，还是在你最喜欢的咖啡馆，也许穿着拖鞋？让我们帮助您保持这种状态。加入我们", "note_en": "If you were losing a lot of time to distractions and wanted to start spendingmore of your day focused on what matters, you might start with a personaltime-tracking tool like  RescueTime, Toggle, or  Daily, tomeasure and understand where your time was going.\n When I’m working on an application, I often find myself wanting the same thingfor my code: more time spent on what I care about, less time wasted repeatinglow-value activities. Sometimes, while waiting for a command to finish or for atest to pass, I’ll ask myself   this seems too slow, where is all my computer’stime going?\n We already have a lot of tools for similar tasks. If you already know whichcritical code path needs to be optimized, you could run Benchmarkagainst it repeatedly in isolation. Or, if you want to scan a whole system forproblem areas, you could use a  profiler toshine a light on the most resource-intensive operations. And if you simply wantto know which requests and queries are taking too much time, you could sign upfor any of a dozen  application performance  monitoring services.\n  Relatively speaking, does this API endpoint spending more time queryingfor data, transforming it, or responding over the network?\n  How does a new XML parser perform against different sizes and types of filesif you   segregate unrelated operations like slow network requests ordatabase inserts?\n Questions like these can often be tricky to answer without custom timing code orinvasive runtime introspection, either of which could unintentionally impact thebehavior and performance of the system—the very thing you’re trying to measure!\n So that’s why we made  time_up, a newRuby gem that helps you track where your code’s time is going. And it’s easy touse! If you’ve ever used a stopwatch ⏱, you’ll know exactly what to do with a mereskim of the README.\n  After you’ve installed and required the gem, you’re ready to start measuringwhere your app’s time is going! One easy way to get started is to pass a timername and a block to  TimeUp.start, like so:\n transactions  =  Transaction .where( user: @user) # `TimeUp.start` will return whatever the block evaluates tomonthly_spending  =  TimeUp .start( :processing) { categorized_transactions  = group_by_category(transactions) arrange_by_month(categorized_transactions)}payments  =  PaymentFinder .find(@user, monthly_spending)render  json: present_summary(  spending: monthly_spending,  payments: payments)\n When you call  TimeUp.elapsed(:processing) you’ll get a Float back that represents howmany seconds have elapsed while the  :processing timer was running. Just like areal stopwatch, it will count up the total number of seconds elapsed whilerunning, even if you start and stop it multiple times (that is, unless you call TimeUp.reset).\n  process_timer  =  TimeUp .start( :processing)categorized_transactions  = group_by_category(transactions)monthly_spending  = arrange_by_month(categorized_transactions)process_timer .stop  # Returns the total elapsed time in seconds\n Most of  TimeUp’s module methods are available on each timer instance, so process_timer.elapsed will also give you the result. The gem provides a numberof methods for controlling timers ( stop,  start,  reset), inspecting theirstatus ( active?,  TimeUp.active_timers), and collecting basic statistics(like  count,  min,  max,  mean,  median, and  percentile). The full APIis  outlined in the README.\n  But where  time_up really excels is in timing different activities separately,so you can get a rough comparison of where your app is spending its time inrelative terms.\n It will look a little messy, but continuing this example, we could carve up ourmeasurement by each category of the code’s behavior by using multiple timers:\n transactions  =  TimeUp .start( :querying) {  Transaction .where( user: @user)}process_timer  =  TimeUp .start( :processing)categorized_transactions  = group_by_category(transactions)monthly_spending  = arrange_by_month(categorized_transactions)process_timer .stoppayments  =  TimeUp .start( :querying) {  PaymentFinder .find(@user, monthly_spending)}render  json:  TimeUp .start( :presenting) { present_summary(  spending: monthly_spending,  payments: payments )}\n Whether you’re timing a script that’s only run once or invoking these blocksrepeatedly in a long-lived process like a web application, all of the timers youcreate will be persisted in memory for the life of the process.\n  Once you’ve recorded some time, you’ll probably want to know how long everythingtook! As mentioned above, the gem provides a number of methods to inspect thetimers that are available on both the  TimeUp module and each timer instance:\n &gt;  TimeUp .elapsed( :presenting) =&gt;  1 . 0050 820000469685 &gt; query_timer  =  TimeUp .timer( :querying) &gt; query_timer .count =&gt;  2 &gt; query_timer .timings =&gt;  [ 0 . 5051469999598339,  0 . 8050760000478476 ] &gt; query_timer .min =&gt;  0 . 5051469999598339 &gt; query_timer .max =&gt;  0 . 8050760000478476 &gt; query_timer .mean =&gt;  0 . 6551115000038408\n  &gt;  TimeUp .total_elapsed =&gt;  2 . 822688000043854 &gt;  TimeUp .all_stats =&gt; {  :querying =&gt;{ :elapsed =&gt; 1 . 3102230000076815,  :count =&gt; 2,  :min =&gt; 0 . 5051469999598339,  :max =&gt; 0 . 8050760000478476,  :mean =&gt; 0 . 6551115000038408},  :processing =&gt;{ :elapsed =&gt; 0 . 5073829999892041,  :count =&gt; 1,  :min =&gt; 0 . 5073829999892041,  :max =&gt; 0 . 5073829999892041,  :mean =&gt; 0 . 5073829999892041},  :presenting =&gt;{ :elapsed =&gt; 1 . 0050 820000469685,  :count =&gt; 1,  :min =&gt; 1 . 0050 820000469685,  :max =&gt; 1 . 0050 820000469685,  :mean =&gt; 1 . 0050 820000469685}}\n  Since it’s pretty common to want to print out the results, the gem provides acouple methods to quickly output the state of all your defined timers.\n If you’re only executing the code that you’re timing once, you can print asimple summary of elapsed times with  TimeUp.print_summary:\n  And if you’re timing the behavior of code that’s called repeatedly (as in acontroller action or a test helper), you can print a more detailed table thatincludes basic stats of all the timings recorded for each named timer with TimeUp.print_detailed_summary:\n &gt;  TimeUp .print_detailed_summary =================================================================================  Name  |  Elapsed  |  Count  |  Min  |  Max  |  Mean  |  Median  |  95th  % --------------------------------------------------------------------------------- :querying  |  1 . 31028  |  2  |  0 . 50520  |  0 . 80507  |  0 . 65514  |  0 . 65514  |  0 . 78221 :processing  |  0 . 50314  |  1  |  0 . 50314  |  0 . 50314  |  0 . 50314  |  0 . 50314  |  0 . 50314 :presenting  |  1 . 0050 8  |  1  |  1 . 0050 8  |  1 . 0050 8  |  1 . 0050 8  |  1 . 0050 8  |  1 . 0050 8\n If you’re planning to intersperse your usage of  TimeUp throughout a long,messy process like running all your tests, it might be easiest to print yourresults in an at_exit hook.And if you want to output them to a custom logger, both methods accept an IO argument.\n  The  time_up gem is a simple tool for a simple job. Hopefully you’ll rememberit the next time you find yourself wondering which parts of a complex operationare taking the most time.\n If you have any questions or ideas, feel free to  open anissue or hit us up on Twitter!\n  Are you at home, or your favorite coffeeshop, maybe in your slippers? Let us help you keep it that way.\n     Join us", "posttime": "2021-07-31 15:56:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,时间", "title": "使用 time_up 对您的 Ruby 进行基准测试", "title_en": "Benchmarking Your Ruby with time_up", "transed": 1, "url": "https://blog.testdouble.com/posts/2021-07-19-benchmarking-your-ruby-with-time_up/", "via": "", "real_tags": ["ruby", "时间"]}, {"category": "", "categoryclass": "", "imagename": "786799b84cac4157da190e669e18aa7d.png", "infoid": 1070815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了构建 Lumen 或对其进行更改，您需要安装以下内容：安装 rustup 后，您将需要安装 Rust 的夜间版本（目前我们的 CI 是针对 2021-01-29 nightly 构建的）。由于我们使用了大量的夜间功能，以及我们使用的 WebAssembly 目标的一些依赖性，我们需要每晚。 # 使用最新的 nightlyrustup default nightly# 或者，如果出现问题，请安装 2021-01-29 nightly 以匹配我们的 CIrustup default nightly-2021-01-29 为了在项目中运行各种构建任务，您将需要 Cargo 的 cargo-make 插件。您可以通过以下方式安装它：您可能还想安装以下工具以支持编辑器（所有拉取请求都需要 rustfmt！）：Lumen 的代码生成后端使用 LLVM（经过我们的修改）。需要构建编译器。通常，您需要自己构建它，我们在下面有说明；但我们也提供了具有所需一切的预构建发行版。下面的说明将 $XDG_DATA_HOME 引用为环境变量，一般建议导出 XDG 变量，但如果没有，只需将下面的 $XDG_DATA_HOME 的用法替换为 $HOME/.local/share，这是此 XDG 变量的通常默认值.\n我们尚未为其他操作系统提供预构建包，您需要按照以下说明从源代码构建。 LLVM 需要 CMake、C/C++ 编译器和 Python。强烈建议您同时安装 Ninja 和 CCache 以显着加快构建速度，尤其是在后续重建时。您可以在系统包管理器中找到所有这些依赖项，包括 macOS 上的 Homebrew。如果未设置 $XDG_DATA_HOME，这会将 LLVM 安装到 $XDG_DATA_HOME/llvm/lumen 或 $HOME/.local/share/llvm/lumen。它假定安装了 Ninja 和 CCache，但是您可以通过从 cmake 的调用中删除 -G Ninja 来自定义 Makefile 中的 llvm 目标以使用 make，同样您也可以通过删除该选项来更改设置以使用 CCache。注意：第一次构建 LLVM 需要很长时间，所以喝杯咖啡，如果你有它们，就抽它们，等等。这将为项目根目录中的 bin 下的主机创建编译器可执行文件和相关联的工具链。您可以通过符号链接 bin/lumen 调用 lumen，例如：这将生成与当前工作目录中的源文件同名的可执行文件，扩展名为 .out 或 .exe，具体取决于您的平台。注意：编译器/运行时仍处于试验阶段，因此无法保证稳定性，如果链接器警告丢失符号，您可能需要提供额外的编译器标志，例如 -lpthread。\nLumen 的前端和诊断库已移入 EIRProject，其中包括 Erlangparser 和高级中间表示 EIR（ErlangIntermediate Representation 的缩写）。 Lumen 依赖于这些组件的 EIR 库。 liblumen_session，包含编译器的单个实例化或“会话”的状态和配置。您可以在此处找到大量选项处理、输入/输出生成和相关项目。 liblumen_compiler，包含编译器驱动程序和增量编译引擎（建立在 salsa 之上）的核心，以及用于从解析源生成工件的所有更高级别的查询。 liblumen_codegen，包含代码生成后端，它分为两个主要阶段：第一个阶段处理从 EIR 到我们自己的 MLIR 方言（或在某些情况下，直接 LLVM IR）的转换。此转换主要旨在保留 EIR 中的抽象级别，同时准备转换为 LLVM IR。第二阶段是将我们的 MLIR 方言转换为 LLVM，这是大部分代码生成工作发生的地方。 liblumen_term，包含我们术语编码方案的基本部分，并与运行时库共享。编译器需要这样做，以便在编译期间处理编码常量项。 liblumen_core，包含用于与系统交互、执行分配以及在 Lumen 中使用的各种常见类型的基本 API。 liblumen_crt，作为可执行文件的核心运行时入口点，处理引导运行时系统。这链接到所有编译器生成的可执行文件\nlumen_rt_minimal (wip) 一个建立在 lumen_rt_core 之上的实验性运行时库，专为 x86_64 平台设计。当前用作编译器生成的可执行文件的运行时。 lumen_rt_full，所有目标的原始运行时库。这正在慢慢地分解成更小的部分，或者合并到 lumen_rt_core 中，或者合并到更多特定于目标的运行时箱。当前由解释器使用，并包含迄今为止实现的所有 BIF 函数。在进行任何重大更改之前，请打开一个标记为“RFC”的问题，其中包含您需要解决的问题、您提出的解决方案以及您在实施方面的任何悬而未决的问题。核心团队（和您）将使用该问题进行讨论更改并为提案亮绿灯，或请求更改。在某些情况下，提案可能会请求与项目目标不相容的更改，或者强加太高的维护或复杂性负担，并且会被拒绝。首先进行 RFC 讨论的重要性在于，它可以防止某人做一堆最终不会被上游处理的工作，并允许核心团队或社区提供反馈，从而使工作最终变得更简单或更好。对于较小的更改/错误修复，如果您是该项目的新手并希望获得一些有关修复工作的指导，请随时打开问题。否则，直接用你的修复打开 PR 是可以接受的，然后让审查在那里进行。始终可以自由地为错误打开问题，甚至是感知到的问题或问题，因为它们可以成为对其他人有用的资源；但请务必使用搜索功能以避免重复！如果您打算参与讨论或为项目做出贡献，请注意该项目不会容忍对社区其他成员的任何形式的滥用；如果您觉得有人辱骂或不当，请直接联系其中一名核心团队成员（或我们所有人）。我们希望营造一种环境，让新人和有经验的人都感到受欢迎，可以回答他们的问题，并希望共同努力使这个项目变得更好！ Lumen 不仅是一个编译器，也是一个运行时。它由两部分组成：\nLumen 开发的主要动力是能够编译可以针对 WebAssembly 的 Elixir 应用程序，从而能够将 Elixir 用作前端开发的语言。通过在 x86 等平台上生成自包含的可执行文件，也可以使用 Lumen 来针对其他平台。它有一些额外的限制以允许进行更强大的优化，特别是不支持热代码重新加载 Lumen 提供的运行时库是用 Rust 编写的，虽然非常相似，但在大多数透明的方式上有所不同。目标之一是为学习如何实现运行时提供更好的基础，并利用 Rust 更强大的静态分析来及早发现错误。通过 Lumen 编译 BEAM 应用程序的结果是一个静态可执行文件。这与今天在 BEAM 上的部署方式（即通过 OTP 版本）有很大不同。虽然我们牺牲了执行热升级/降级的能力，但我们在跨平台兼容性和易用性方面取得了巨大的进步。只需将可执行文件放到兼容平台上，然后运行它，需要的 notools 或构建期间的特殊注意事项。这与今天构建 Rustor Go 应用程序的工作方式相同。 Lumen 是 Erlang/OTP 的另一种实现，因此它没有经过实战测试，也不一定像 BEAM 本身那样具有性能。在我们有机会运行一些基准测试之前，很难知道两者在性能方面的实际差异。 Lumen 目前不打算取代 BEAM。至少，该项目声明的非目标意味着至少有一定比例的项目会缺少某些必需的功能。但是，它旨在替代通过其功能集提供更好服务的应用程序。编译器前端接受 Erlang 源文件。这被解析为抽象语法树，降级为 EIR（Erlang 中间表示），最后降级为执行代码生成的 LLVM IR。\n在降级到 LLVM IR 期间，延续表示被剥离，并生成用于实现各种构造的特定于平台的方法。函数applicationfacilities 用于执行apply。目前，C++ 风格的零成本异常模型用于实现异常。有一些 WebAssembly 正在进行的未来提案可能允许我们对异常使用延续，但尚未稳定或在浏览器中实现。编译器生成对象文件，并处理将对象链接到可执行文件中。它还可以转储所有中间工件，例如各种形式的 AST、EIR、MLIR、LLVM IR、LLVM 位码和普通汇编。运行时设计与 OTP 基本相同，但我们没有运行解释器，而是提前编译了代码：进程在与其产生的进程相同的调度程序上产生，但调度程序能够窃取它们远离负载平衡 初始版本将非常简陋，但这样我们就可以专注于在我们返回添加更多功能之前获得坚如磐石的运行时行为。 NIF 将能够使用 C FFI 以任何语言定义，并且需要编译为目标文件，然后通过链接器标志传递给编译器。然后编译器将确保 NIF 链接到可执行文件中。 FFI 的设计仍然悬而未决——我们可能会有一个兼容层来模仿现有的 erl_nif.h 接口，但由于运行时不同，可能有机会为系统的各个部分提供更直接的挂钩。", "note_en": "In order to build Lumen, or make changes to it, you&#39;ll need the following installed:\n    Once you have installed  rustup, you will need to install the nightly versionof Rust (currently our CI builds against the 2021-01-29 nightly). We requirenightly due to a large number of nightly features we use, as well as somedependencies for the WebAssembly targets that we make use of.\n # to use the latest nightlyrustup default nightly# or, in case of issues, install the 2021-01-29 nightly to match our CIrustup default nightly-2021-01-29\n In order to run various build tasks in the project, you&#39;ll need the  cargo-make plugin for Cargo. You can install it with:\n   You may also want to install the following tools for editor support ( rustfmt will be required onall pull requests!):\n     LLVM (with our modifications) is used by Lumen&#39;s code generation backend. It is needed to build thecompiler. Typically, you&#39;d need to build this yourself, which we haveinstructions for below; but we also provide prebuilt distributions that have everything needed.\n   The instructions below reference  $XDG_DATA_HOME as an environment variable, itis recommended to export XDG variables in general, but if you have not, justreplace the usages of  $XDG_DATA_HOME below with  $HOME/.local/share, which isthe usual default for this XDG variable.\n     We don&#39;t yet provide prebuilt packages for other operating systems, you&#39;ll needto build from source following the directions below.\n  LLVM requires CMake, a C/C++ compiler, and Python. It is highly recommended thatyou also install  Ninja and CCache to make the build significantly faster, especiallyon subsequent rebuilds. You can find all of these dependencies in your systempackage manager, including Homebrew on macOS.\n   This will install LLVM to  $XDG_DATA_HOME/llvm/lumen, or $HOME/.local/share/llvm/lumen, if  $XDG_DATA_HOME is not set. It assumes that Ninja andCCache are installed, but you can customize the  llvm target in the  Makefile touse  make instead by removing  -G Ninja from the invocation of  cmake,likewise you can change the setting to use CCache by removing that option as well.\n NOTE: Building LLVM the first time will take a long time, so grab a coffee, smoke &#39;em if you got &#39;em, etc.\n     This will create the compiler executable and associated toolchain for the hostmachine under  bin in the root of the project. You can invoke  lumen via thesymlink  bin/lumen, e.g.:\n    This will produce an executable with the same name as the source file in thecurrent working directory with the  .out or  .exe extension, depending on yourplatform.\n NOTE: The compiler/runtime are still in experimental stages, so stability isnot guaranteed, and you may need to provide additional compiler flags if thelinker warns about missing symbols, e.g.  -lpthread.\n     Lumen&#39;s frontend and diagnostics libraries were moved into the EIRProject, which includes both the Erlangparser and the high-level intermediate representation EIR, short for  ErlangIntermediate Representation. Lumen depends on the EIR libraries for thosecomponents.\n   liblumen_session, contains state and configuration for a singleinstantiation of the compiler, or &#34;session&#34;. This is where you can find thebulk of option processing, input/output generation, and related items.\n liblumen_compiler, contains the core of the compiler driver and incremental compilation engine (built on  salsa), as well as allof the higher level queries for generating artifacts from parsed sources.\n liblumen_codegen, contains the code generation backend, which is dividedinto two primary phases: the first handles translation from EIR toour own dialect of  MLIR (or, in some cases, LLVM IRdirectly). This translation mostly aims to preserve the level of abstractionfound in EIR, while preparing for conversion to LLVM IR. The second phase isconversion of our MLIR dialect to LLVM, which is where the bulk of the codegenwork occurs.\n liblumen_term, contains the essential parts of our term encoding scheme, andis shared with the runtime libraries. The compiler requires this in order tohandle encoding constant terms during compilation.\n   liblumen_core, contains the essential APIs for interacting with the system,performing allocations, as well as various common types used throughout Lumen.\n  liblumen_crt, acts as the core runtime entry point for executables, handlesbootstrapping the runtime system. This is linked in to all compiler-generated executables\n  lumen_rt_minimal (wip) an experimental runtime library built on top of lumen_rt_core, designed for x86_64 platforms. Currently used as the runtimefor executables generated by the compiler.\n  lumen_rt_full, original runtime library for all targets. This is slowlybeing broken up into smaller pieces, either merged into  lumen_rt_core, ornew more target-specific runtime crates. Currently used by the interpreter,and contains all of the BIF functions implemented so far.\n    Before making any major changes, please open an issue tagged &#34;RFC&#34; with the problem you need tosolve, your proposed solution, and any outstanding questions you have in terms of implementation.The core team (and you) will use that issue to talk through the changes and either green light theproposal, or request changes. In some cases, a proposal may request changes that are eitherincompatible with the project&#39;s goals, or impose too high of a maintenance or complexity burden, andwill be turned down. The importance of having the RFC discussion first is that it prevents someonefrom doing a bunch of work that will ultimately not be upstreamed, and allows the core team or thecommunity to provide feedback that may make the work simpler, or better in the end.\n For smaller changes/bug fixes, feel free to open an issue first if you are new to the project andwant some guidance on working through the fix. Otherwise, it is acceptable to just open a PRdirectly with your fix, and let the review happen there.\n Always feel free to open issues for bugs, and even perceived issues or questions, as they can be auseful resource for others; but please do make sure to use the search function to avoidduplication!\n If you plan to participate in discussions, or contribute to the project, be aware that this projectwill not tolerate abuse of any kind against other members of the community; if you feel that someoneis being abusive or inappropriate, please contact one of the core team members directly (or all ofus). We want to foster an environment where people both new and experienced feel welcomed, can havetheir questions answered, and hopefully work together to make this project better!\n   Lumen is not only a compiler, but a runtime as well. It consists of two parts:\n  The primary motivator for Lumen&#39;s development was the ability to compile Elixirapplications that could target WebAssembly, enabling use of Elixir as a languagefor frontend development. It is also possible to use Lumen to target otherplatforms as well, by producing self-contained executables on platforms such as x86.\n  It has some additional restrictions to allow more powerful optimizations totake place, in particular hot code reloading is not supported\n The runtime library provided by Lumen is written in Rust, and while verysimilar, differs in mostly transparent ways. One of the goals is to provide abetter foundation for learning how the runtime is implemented, and to takeadvantage of Rust&#39;s more powerful static analysis to catch bugs early.\n The result of compiling a BEAM application via Lumen is a static executable. This differssignificantly from how deployment on the BEAM works today (i.e. via OTP releases). While wesacrifice the ability to perform hot upgrades/downgrades, we make huge gains in cross-platformcompatibility, and ease of use. Simply drop the executable on a compatible platform, and run it, notools required, or special considerations during builds. This works the same way that building Rustor Go applications works today.\n       Lumen  is an alternative implementation of Erlang/OTP, so as a result it is not as battle tested, or necessarilyas performant as the BEAM itself. Until we have a chance to run some benchmarks, it is hard to knowwhat the difference between the two in terms of performance actually is.\n Lumen is  not intended to replace BEAM at this point in time. At a minimum, the stated non-goalsof this project mean that for at least some percentage of projects, some required functionality wouldbe missing. However, it is meant to be a drop-in replacement for applications which are better servedby its feature set.\n    The compiler frontend accepts Erlang source files. This is parsed into anabstract syntax tree, lowered into EIR (Erlang Intermediate Representation),then finally lowered to LLVM IR where codegen is performed.\n  During lowering to LLVM IR, the continuation representation is stripped away,and platform-specific methods for implementing various constructs are generated.For example, on x86_64, hand-written assembly is used to perform extremely cheapstack switching by the scheduler, and to provide dynamic function applicationfacilities for the implementation of  apply. Currently, the C++-style zero-costexception model is used for implementing exceptions. There are some futureproposals in progress for WebAssembly that may allow us to use continuations forexceptions, but that is not yet stabilized or implemented in browsers.\n The compiler produces object files, and handles linking objectstogether into an executable. It can also dump all of the intermediate artifacts,such as the AST, EIR, MLIR in various forms, LLVM IR, LLVM bitcode, and plain assembly.\n  The runtime design is mostly the same as OTP, but we are not running an interpreter, instead thecode is ahead-of-time compiled:\n Processes are spawned on the same scheduler as the process they are spawned from,but a scheduler is able to steal them away to load balance\n The initial version will be quite spartan, but this is so we can focus on getting the runtimebehavior rock solid before we circle back to add in more capabilities.\n  NIFs will be able to be defined in any language with C FFI, and will need to be compiled to objectfiles and then passed via linker flags to the compiler. The compiler will then ensure that the NIFsare linked into the executable.\n The design of the FFI is still up in the air - we will likely have a compatibility layer which willmimic the existing  erl_nif.h interface, but since the runtime is different, there may beopportunities to provide more direct hooks to parts of the system.", "posttime": "2021-07-31 15:55:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,webassembly,替代,alternative,lumen", "title": "Lumen：替代 BEAM 实现，专为 WebAssembly 设计", "title_en": "Lumen: Alternative BEAM implementation, designed for WebAssembly", "transed": 1, "url": "https://github.com/lumen/lumen", "via": "", "real_tags": ["设计", "替代", "lumen"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070813, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "时事通讯搜索获取“宇宙追赶”（每周二）订阅订阅最新简报空间天体生物学天文学天体物理学空间探索技术人工智能自动化计算材料能源机器人自然动物鸟类进化海洋生物植物地球气候可持续性水地球科学农业海洋历史考古文明古生物学人类行为文化伦理人类学学会公民科学健康医学身心营养核心科学生物化学数学物理工程搜索通讯帐户订阅商店商品电子礼品卡教育订阅续订订阅捐赠购物车主页■核心科学■化学■金、银和铜牌/艾伦菲迪安Share Tweet 奥运奖牌是由什么制成的？这似乎是一个显而易见的答案——金、银和铜；它在标签上！ – 但银牌是唯一真正由其纯元素制成的奖牌。那么其他奖牌是由什么制成的——你还有什么可能用它们来做呢？金牌不是纯金——那会使它们太软。相反，它们是纯银的，每枚奖牌镀有 6 克镀金。金和银都是非常稳定的元素，都不会与空气发生反应，但金比银更稳定。如果你将奖牌熔化并浸泡在硝酸中，银会反应变成硝酸银，但金会保持稳定，这意味着你可以将两种金属分开。黄金和每克白银 1 美元，你会看到每枚奖牌将近 1000 美元的贵金属——480 美元的黄金和 550 美元的白银。众所周知，运动员会完好无损地出售他们的金牌，赚取更大的利润——有些可达数百万——所以市场价值可能不是从金牌中赚钱的最佳方式。银牌是唯一由纯元素制成的：它们都是银。重达 550 克，它们的纯度使它们在化学上比其他奖牌更有用——如果你想用银镀一个茶杯，或者设计一个更好的触摸屏，你只需要把它加热到 962°C，然后将其熔化，无需任何进一步纯化。青铜是一种非常古老且广为人知的金属，但它不是一种纯粹的元素，从技术上讲，铜牌也不是“青铜”——它们是黄铜。\n青铜通常是铜和锡的合金，但铜牌是95%的铜和5%的锌的合金。这被称为“红黄铜”，尽管用于阀门和管道的工业红黄铜纯度通常比这低，其拥有约 85% 的铜以及锡、锌、铅和其他金属的混合物。然而，铜和锌——虽然本身非常软的金属——合金制造出更硬的金属。铜牌是最硬、最轻的奖牌（重 450 克），因此如果您需要铁饼，它可能是最好的铁饼。虽然金属一旦成为奖牌就再利用是一个坏主意，但在过去十年中，在奥运奖牌中加入回收材料一直是一个传统。 . 2017 年至 2019 年间，日本各地的人们捐赠了旧电子设备，其中提取了贵金属。政府总共收集了数百万吨设备，提取了32公斤黄金、3500公斤白银和2200公斤铜锌，用于获得铜牌。如果您有兴趣了解有关回收金属的更多信息，我们鼓励您查看我们的循环经济简报。解释事实、珍视循证知识和展示最新科学、技术和工程突破的重要时刻。 Cosmos 由澳大利亚皇家学会出版，这是一个致力于将人们与科学世界联系起来的慈善机构。财政捐助，无论大小，都有助于我们在世界最需要的时候提供对可信科学信息的访问。请立即通过捐赠或购买订阅来支持我们。捐赠 关于我们 Stockists 常见问题提交 使用条款 Schools Donate 联系我们 “Cosmos”和“The Science of Everything”是澳大利亚和美国的注册商标，归澳大利亚皇家学会所有。电话：08 7120 8600 (澳大利亚）+61 8 7120 8600（国际）客户服务 9:00 am – 5:00 pm ACST 周一至周五\n获取“Cosmos Catch-up”（每周二）", "note_en": "Newsletter           Search                       Get “Cosmos Catch-up” (every Tuesday)               Subscribe     Subscribe   Latest  Briefings  Space   Astrobiology  Astronomy  Astrophysics  Space Exploration  Technology   AI  Automation  Computing  Materials  Energy  Robotics  Nature   Animals  Birds  Evolution  Marine life  Plants  Earth   Climate  Sustainability  Water  Earth Sciences  Agriculture  Oceans  History   Archaeology  Civilisations  Palaeontology  People   Behaviour  Culture  Ethics  Anthropology  Society  Citizen Science  Health   Medicine  Body and Mind  Nutrition  Core Sciences   Biology  Chemistry  Mathematics  Physics  Engineering  Search  Newsletter  Account  Subscription  Shop   Merchandise  eGift Cards  Education Subscriptions  Renew Subscription  Donate  Cart       Home ■   Core Sciences ■   Chemistry ■  Gold, silver and brass medals   /  Ellen Phiddian       Share  Tweet     What are the Olympic medals made of? It seems an obvious answer – gold, silver, and bronze; it’s on the label! – but the silver medal is the only one that is actually made from its pure element.\n So what are the other medals made of – and what else could you potentially use them for?\n  Gold medals are not pure gold – that would make them too soft. Instead,  they’re pure silver\n, with six grams of gold plating per medal. Gold and silver are both very stable elements, with neither reacting with air, but gold is even more stable than silver. If you melted the medal down and soaked it in nitric acid, the silver would react to become silver nitrate but the gold would remain stable, meaning you could separate the two metals out.\n  of gold, and  $1 per gram of silver, you’re looking at nearly $1000 of precious metals per medal – $480 of gold, and $550 of silver. Athletes have been known to sell their gold medals intact, racking up much larger profits –  some in the millions\n – so market value is probably not the best way to make money off a gold medal.  Silver medals are the only ones made of a pure element: they’re all Ag. Weighing in at 550 grams, their purity makes them more chemically useful than the other medals – if you wanted to use the silver for  plating a teacup\n, or  designing a better touch screen, you’d just need to heat it to 962°C and melt it down, without any further purification.  Bronze is a very old and well-recognised metal, but it isn’t a pure element, and nor are the bronze medals technically ‘bronze’ – they’re brass.\n Bronze is usually an alloy of copper and tin, but bronze medals are an alloy of 95% copper and 5% zinc. This is referred to as ‘red brass’, although industrial red brass, which is used in valves and plumbing, is usually less pure than this, boasting about 85% copper and a mixture of tin, zinc, lead and other metals.\n Nevertheless, copper and zinc – while very soft metals themselves – alloy to make a much harder metal. The bronze medal is the hardest and lightest medal (at 450 grams), so it’s probably the best to use as a discus, should you need a discus.\n  While it’s a bad idea to reuse the metals once they’ve become medals, it’s been a tradition over the past decade to  include recycled materials\n in Olympic medals. . Between 2017 and 2019, people across Japan donated old electronic devices, which had the precious metals extracted from them. In total, the government collected several million tonnes of equipment, and extracted 32 kilograms of gold, 3500 kilograms of silver and 2200 kilograms of copper and zinc for the bronze medals.\n If you’re interested in learning more about recycling metals, we encourage you to take a look at our  Briefing on the Circular Economy\n.     There’s never been a more important time to explain the facts, cherish evidence-based knowledge and to showcase the latest scientific, technological and engineering breakthroughs. Cosmos is published by The Royal Institution of Australia, a charity dedicated to connecting people with the world of science. Financial contributions, however big or small, help us provide access to trusted science information at a time when the world needs it most. Please support us by making a donation or purchasing a subscription today.\n  Make a donation                              About Us  Stockists  FAQ  Submissions  Terms of use  Schools  Donate  Contact us  &#39;Cosmos&#39; and &#39;The Science of Everything&#39; are registered trademarks in Australia and the USA, and owned by The Royal Institution of Australia Inc.   T: 08 7120 8600 (Australia) +61 8 7120 8600 (International) Customer Service 9:00 am — 5:00 pm ACST Monday to Friday\n                           Get “Cosmos Catch-up” (every Tuesday)", "posttime": "2021-07-31 15:55:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "奥运会,tokyo,科学", "title": "东京奥运会奖牌从废弃电子设备中回收", "title_en": "Medals at Tokyo olympics are recycled from discarded electronic equipment", "transed": 1, "url": "https://cosmosmagazine.com/science/chemistry/olympic-medal-composition", "via": "", "real_tags": ["奥运会", "tokyo", "科学"]}, {"category": "", "categoryclass": "", "imagename": "fe3e66b7a08b581b4490cbe1a095493f.jpg", "infoid": 1070811, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国政府问责办公室周五否认了杰夫贝索斯下属公司的抗议，即美国宇航局错误地将利润丰厚的宇航员登月器合同仅授予埃隆马斯克的 SpaceX。 “当 NASA 决定只授予一项奖励时，它并没有违反采购法律或法规……对所有三项提案的评估都是合理的，并且符合适用的采购法律、法规和公告条款，”GAO 管理副总法律顾问肯尼斯巴顿在一份声明中写道。 GAO 的裁决支持了航天局在 4 月份出人意料地宣布 NASA 授予 SpaceX 一份价值约 29 亿美元的合同。 SpaceX 正在与 Blue Origin 和 Dynetics 竞争预期的两份合同，但由于国会对该项目的拨款低于预期，NASA 只授予了一份合同。 NASA 在一份声明中表示，GAO 的决定将允许该机构“为 50 多年来首次载人登月制定时间表”。 “美国宇航局将尽快提供关于阿尔忒弥斯、人类登陆系统和人类重返月球的最新进展。我们将继续与拜登政府和国会合作，以确保为稳健和可持续的方法提供资金与美国商业伙伴合作，让国家重返月球，”美国航天局说。 Blue Origin 的一位发言人告诉 CNBC，该公司仍然认为“NASA 的决定存在根本性问题，但 GAO 由于其管辖权有限而无法解决这些问题。” “我们将继续倡导两个直接供应商，因为我们相信这是正确的解决方案，”蓝色起源说。 “人类着陆系统计划现在需要竞争，而不是以后——这是美国宇航局的最佳解决方案，也是我们国家的最佳解决方案。”\nSpaceX 和 Dynetics 没有回应 CNBC 的置评请求。就马斯克而言，他在推文中用一个弯曲的手臂表情符号对 GAO 的裁决进行了权衡。 GAO 的抗议裁决解决了围绕 NASA 载人着陆系统计划的争议，该计划是该机构将美国宇航员送回月球表面的计划的最后关键部分之一。在最近一次授予合同之前，NASA 已经发放了近 10 亿美元的概念开发合同——SpaceX 收到 1.35 亿美元，Dynetics 收到 2.53 亿美元，Blue Origin 收到 5.79 亿美元。在选择 SpaceX 进行下一轮开发时，NASA 决定资助 SpaceX 的 Starship 火箭的一个变体，SpaceX 一直在其位于德克萨斯州博卡奇卡的开发设施对其原型进行测试。美国宇航局计划让其宇航员在太空舱到达月球轨道时使用星际飞船从该机构的猎户座飞船转移。在 NASA 4 月份宣布这一消息后不久，Blue Origin 和 Dynetics 分别向 GAO 提出抗议，挑战 NASA 的流程和决定。蓝色起源在 4 月份谴责该奖项“有缺陷”，称 NASA“在最后一刻移动了球门柱”。\n该公司还透露，其出价约为 SpaceX 的两倍，出价为 59.9 亿美元。美国宇航局后来透露，Dynetics 的出价更高，为 85 亿美元。抗议的一个影响是 NASA 一直无法推进与 SpaceX 的 HLS 工作，在 GAO 做出决定之前，该项目的工作基本上停止了。在蓝色起源的第一次载人飞行将自己送入太空后不久，贝佐斯在本周早些时候给美国宇航局的一封信中写道，他将支付航天局高达 20 亿美元的月球着陆器合同成本。贝佐斯在信中写道：“我们随时准备帮助 NASA 降低其技术风险并解决其预算限制，并使 Artemis 计划重新走上更具竞争力、可信度和可持续发展的道路。” Blue Origin 通讯副总裁 Linda Mills 在一封电子邮件中告诉 CNBC，在 GAO 裁决后，Bezos 提出的“报价没有变化”。通过 CNBC Pro 成为更聪明的投资者。获得选股、分析师电话、独家采访和访问 CNBC 电视。立即注册以开始免费试用。", "note_en": "The U.S. Government Accountability Office on Friday denied protests from companies affiliated with  Jeff Bezos that NASA wrongly awarded a lucrative astronaut lunar lander contract solely to  Elon Musk&#39;s SpaceX.\n   &#34;NASA did not violate procurement law or regulation when it decided to make only one award ... the evaluation of all three proposals was reasonable, and consistent with applicable procurement law, regulation, and the announcement&#39;s terms,&#34; GAO managing associate general counsel Kenneth Patton wrote in a statement.\n The GAO ruling backs the space agency&#39;s surprise announcement in April that  NASA awarded SpaceX with a contract worth about $2.9 billion. SpaceX was competing with Blue Origin and Dynetics for what was expected to be two contracts, before NASA only awarded a single contract due to a lower-than-expected allocation for the program from Congress.\n NASA, in  a statement, said that the GAO decision will allow the agency &#34;to establish a timeline for the first crewed landing on the Moon in more than 50 years.&#34;\n  &#34;As soon as possible, NASA will provide an update on the way ahead for Artemis, the human landing system, and humanity&#39;s return to the Moon. We will continue to work with the Biden Administration and Congress to ensure funding for a robust and sustainable approach for the nation&#39;s return to the Moon in a collaborative effort with U.S. commercial partners,&#34; the U.S. space agency said.\n A Blue Origin spokesperson told CNBC that the company still believes &#34;there were fundamental issues with NASA&#39;s decision, but the GAO wasn&#39;t able to address them due to their limited jurisdiction.&#34;\n  &#34;We&#39;ll continue to advocate for two immediate providers as we believe it is the right solution,&#34; Blue Origin said. &#34;The Human Landing System program needs to have competition now instead of later – that&#39;s the best solution for NASA and the best solution for our country.&#34;\n SpaceX and Dynetics did not respond to CNBC requests for comment. Musk, for his part, weighed in on the GAO&#39;s ruling with a single flexing arm emoji in a tweet.\n   The GAO protest ruling resolves a dispute around NASA&#39;s Human Landing System program, one of the final key pieces of the agency&#39;s plan to return U.S. astronauts to the surface of the moon.\n Before the most recent contract award, NASA had handed out nearly $1 billion in concept development contracts – with SpaceX receiving $135 million, Dynetics 253 million, and Blue Origin receiving $579 million.\n In choosing SpaceX for the next round of development, NASA decided to fund a variation of SpaceX&#39;s  Starship rocket, prototypes of which SpaceX has been testing at its development facility in Boca Chica, Texas.\n NASA plans for its astronauts to use Starship to transfer from the agency&#39;s Orion spacecraft when the capsule reaches lunar orbit.\n  Shortly after NASA&#39;s announcement in April,  Blue Origin and Dynetics each filed protests with the GAO, challenging the space agency&#39;s process and decision.\n Blue Origin in April decried the award as &#34;flawed,&#34; saying that NASA &#34;moved the goalposts at the last minute.&#34;\n The company also revealed that its proposal was roughly double that of SpaceX, with a bid of $5.99 billion. NASA later revealed that Dynetics&#39; bid was even higher, at $8.5 billion.\n One effect of the protests is that NASA has been unable to move forward with work on HLS with SpaceX, with work essentially halted on the program until the GAO&#39;s decision.\n   Shortly after flying himself to space on Blue Origin&#39;s first crewed flight,  Bezos wrote in a letter to NASA earlier this week that he would cover as much as $2 billion in the space agency&#39;s costs for a lunar lander contract.\n &#34;We stand ready to help NASA moderate its technical risks and solve its budgetary constraints and put the Artemis Program back on a more competitive, credible, and sustainable path,&#34; Bezos wrote in the letter.\n Blue Origin communications vice president Linda Mills told CNBC in an email that there is &#34;no change to the offer&#34; Bezos made after the GAO ruling.\n Become a smarter investor with    CNBC Pro .  Get stock picks, analyst calls, exclusive interviews and access to CNBC TV.   Sign up to start a    free trial today  .", "posttime": "2021-07-31 15:00:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,否认,denies", "title": "政府否认蓝色起源对 NASA 登月计划的挑战", "title_en": "Government Denies Blue Origin's Challenge To NASA's Lunar Lander Program", "transed": 1, "url": "https://www.cnbc.com/2021/07/30/government-denies-bezos-blue-origin-protest-over-nasa-hls-contract.html", "via": "", "real_tags": ["nasa", "否认", "denies"]}, {"category": "", "categoryclass": "", "imagename": "343ffcf35942c9a06c80f9e317fd54cc.jpg", "infoid": 1070810, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "收稿日期：2021 年 4 月 16 日/修订日期：2021 年 6 月 18 日/接受日期：2021 年 6 月 28 日/发布日期：2021 年 6 月 30 日 一些旨在理解和调节超出人类能力的感觉和运动技能的研究正在进行中。它们主要在啮齿动物模型中进行了阐述，其中已经实现了许多通过脑刺激控制运动以到达目标位置的报告。然而，就鸟类而言，虽然已经进行了运动控制的基础研究，但尚未确定触发这些运动的脑核。为了完全控制鸟类的飞行导航，需要全面了解参与飞行行为的基本中枢神经系统，并需要阐明鸟类大脑的功能图，以研究飞行控制的可能性。在这里，我们建立了一个稳定的立体定向手术来植入多线电极阵列并电刺激鸽子大脑的几个核。一个多通道电极阵列和一个无线刺激系统被植入了 13 只鸽子。通过3D运动跟踪程序监测和分析鸽子在脑核电刺激下的飞行轨迹以评估行为变化，并通过尸检组织学检查确认大脑中的确切刺激部位。其中，5只鸽子能够通过刺激枕中脑束（OM）、绦虫核（TN）或圆形核（RT）的细胞核来诱导身体左右转动；刺激中脑中脑束（TSM）或腹弓（AV）的细胞核，以诱导飞行飞行，使五只鸽子扑腾和起飞。查看全文 关键词：鸽子；立体定向手术；鸟类飞行；电流刺激； 3D运动追踪鸽子；立体定向手术；鸟类飞行；电流刺激； 3D 运动追踪 ► ▼Show Figures", "note_en": "Received: 16 April 2021 / Revised: 18 June 2021 / Accepted: 28 June 2021 / Published: 30 June 2021\n A number of research attempts to understand and modulate sensory and motor skills that are beyond the capability of humans have been underway. They have mainly been expounded in rodent models, where numerous reports of controlling movement to reach target locations by brain stimulation have been achieved. However, in the case of birds, although basic research on movement control has been conducted, the brain nuclei that are triggering these movements have yet to be established. In order to fully control flight navigation in birds, the basic central nervous system involved in flight behavior should be understood comprehensively, and functional maps of the birds’ brains to study the possibility of flight control need to be clarified. Here, we established a stable stereotactic surgery to implant multi-wire electrode arrays and electrically stimulated several nuclei of the pigeon’s brain. A multi-channel electrode array and a wireless stimulation system were implanted in thirteen pigeons. The pigeons’ flight trajectories on electrical stimulation of the cerebral nuclei were monitored and analyzed by a 3D motion tracking program to evaluate the behavioral change, and the exact stimulation site in the brain was confirmed by the postmortem histological examination. Among them, five pigeons were able to induce right and left body turns by stimulating the nuclei of the tractus occipito-mesencephalicus (OM), nucleus taeniae (TN), or nucleus rotundus (RT); the nuclei of tractus septo-mesencephalicus (TSM) or archistriatum ventrale (AV) were stimulated to induce flight aviation for flapping and take-off with five pigeons. View Full-Text\n Keywords:  pigeon; stereotactic surgery; bird flight; current stimulation; 3D motion tracking    pigeon;  stereotactic surgery;  bird flight;  current stimulation;  3D motion tracking\n  ► ▼Show Figures", "posttime": "2021-07-31 14:59:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "鸟类,stimulation,刺激", "title": "用于鸟类飞行控制的鸽子中脑核的电流刺激", "title_en": "Current Stimulation of the Midbrain Nucleus in Pigeons for Avian Flight Control", "transed": 1, "url": "https://www.mdpi.com/2072-666X/12/7/788", "via": "", "real_tags": ["鸟类", "刺激"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个小指南的目的是帮助那些对意大利语发音知之甚少或根本不了解的人避免一些美国英语人士最常犯的错误。如果你唱过很多意大利语，你可能知道这里的大部分内容。意大利语拼写主要是语音；也就是说，除了少数例外，单个字母或一组字母代表同一个发音，并且该语言中出现的每个发音只有一个书面表示。即便如此，像这样的简短、非正式的指南也无法涵盖任何深度的主题，也没有任何书面材料可以替代反复、专心地听意大利语的口语和歌唱。与英语中的 15 个左右相比，意大利语元音只有 7 个（a、i 和 u 各一个；e 和 o 各两个），但意大利语元音和英语元音之间最显着的区别是意大利元音是纯音。用单个字母书写的声音具有单一的、不变的值，而在英语中，声音经常从一个纯音变为另一种。例如，go 中的 o 从意大利语中的纯 o 音变为英语中 oo 发出的音词引导。未重读的英语元音倾向于将值改变为更中性的声音；意大利元音没有。比较大量的两个 a。没有意大利元音发出像第一个 a 一样的声音 (schwa)。意大利语a很开放。对于许多说美国英语的人来说，它类似于 short oin hot 或 first ain papa。它永远不应该听起来像 uh 或 aw。我和你更容易，因为他们发出的声音几乎在每个人的英语中都会出现。意大利语 i 发出长音，如“陡峭”一词。意大利语 u 发出 ooin boot 的声音。\n每个都有所谓的“打开”和“关闭”的声音。虽然有一些关于使用哪种声音的规则，但有很多规则没有涵盖。如果您没有正确听到某个单词的发音，通常无法知道该单词使用哪种发音。这里的主题太复杂了，但是口语有一个简单的规则：意大利语非重音 e 和 o 总是封闭的。然而，意大利语的情况并非总是如此。 Open e 发音类似于英语中的 short e，如 bet；意大利语可能更开放一些（嘴巴更高）。 Closed e 听起来像 ain 混沌。它与更常见的（英语）元音发音方式不同，因为它从我们正在寻找的声音滑入 ee。 Open o 就像元音敬畏，如果你说它没有任何双元音的暗示。Closed o，像闭合的 e，很少出现在英语中而不滑入其他东西。这是 go 中的第一个元音，然后变成 oo。双元音（总是用 2 个元音写成）在意大利语中很常见。有时 i 在 yard 中发音像 y（例如在单词 pietà 中）而不是正常值，同样 umay 发音像英语 w（guarda）。发生这种情况的规则太复杂了，无法在这里讨论。除了这些情况之外，双元音中的每个元音都有其通常的发音，尽管在重读音节中一个比另一个长（没有简单的规则来确定哪个应该是长音），并且两个声音是不同的，没有从一个滑音进入另一个。本节提到了所有具有多个音的辅音，以及一些额外的辅音，它们的意大利语发音与英语不同，以至于英语发音会在意大利语单词中显得令人不快。意大利语中的双辅音应该比相应的单辅音花费更长的时间。通常（除非将文本设置为音乐使其不可能）在演唱意大利语中也是如此。对于像 s 或 n 这样的辅音，如何做到这一点很明显，但即使是停止的辅音，如 tuttocan 中的双 tt 并且应该更长。只需在辅音形成时保持嘴巴的位置（在这种情况下，您的舌头将抵住牙齿）一会儿，然后松开。使双辅音发音适当长还有另一部分：在前面的元音上花费更少的时间。和英语一样，c 和 g 可以是硬的也可以是软的。每个元音 a、o 或 u 之一后跟（不同的）辅音时都是硬的，而后跟 e 或 i 时是软的。硬音类似于英语：g 表示good，c 表示car。软 g 也类似于英语，就像一般的 g。然而意大利软c就像英国下巴国际象棋。但是还有一些额外的皱纹：\nan 通常在使辅音变软时“用完”并且没有自己的声音 以下是几乎所有可能发生在 c 上的例子。 g 类似。意大利语 r 要么是颤音，要么是翻转，这只是颤音的一个非常短的版本。如果音乐环境允许，通常会发出双颤音。确切地说，当单个 r 应该颤音（以及多长时间）以及何时翻转超出本指南的范围之外，但是单个 r 的一个很好的经验法则是在两个元音之间翻转（例如在“fiori”中），在其他位置颤音（首字母，在另一个辅音之前，在另一个辅音之后，或在词尾），例如在“ritorna”、“nostro”和“cor”中。美式 r-sound 永远不合适；最好完全不发出声音。 t 和 d 没有它们的英语等价物那么苛刻。 t 不吸气；也就是说，当你说这句话的时候，你不应该感觉到嘴前有一股强烈的空气，就像英文版一样。对于许多说英语的人来说，这种差异似乎很微妙，但对意大利人来说则不然。为了让这两个字母更像意大利语发音，你的舌头应该只接触你的牙齿后部，而不是你的牙龈，而且它应该有点放松，不要紧张和尖锐，在前面。仅从包含 z 的单词的拼写无法判断 z 是否发声。 s 通常是浊音 ifit（单音，不是双音）出现在两个元音之间，或者如果它位于浊辅音之前（如单词 sdegno）。首先要注意这些字母有两种可能的发音并听仔细地对包含它们的新词进行准确的发音。这些拼写所代表的意大利语发音在英语中不存在。意大利语 gn 的发音近似于英语单词 ca nyon 中的 ny，但不完全相同。为了更接近意大利语发音，你的舌尖应该接触你下牙的后部。同样，意大利语gl的发音有点像“million”这个词中间的发音，但又不太一样。为了更接近正确的意大利语发音，舌尖应该接触下牙齿的后部.\n有很多关于歌手意大利语用词的书籍，但不可避免地，作者不会像你一样发音英语——没有人会——所以例子可能会产生误导。大卫亚当斯，他写了一本歌手用语手册（牛津大学出版社，1999 年） ) 的发音必须与我的相似，因为这些例子总是与我在意大利口语中听到的一致。他还很好地解释了如何产生英语中不常见或不存在的声音。", "note_en": "The goal of this little guide is to help those with little or no knowledge of Italian pronunciation avoid some of theerrors most commonly made by American Englishspeakers. If you&#39;ve sung much Italian, you probably know most orall of what&#39;s in here.\n  Italian spelling is largely phonetic; that is, with only afew exceptions a single letter or cluster of letters represents the samesound, and each sound occurring in the language has only a single writtenrepresentation. Even so, a short, informal guide like this one can&#39;t cover thesubject in any depth, and no written material can substitute for repeatedly and attentively listening to good spoken and sung Italian.\n  There are only 7 Italian vowel sounds (one each for  a, i and  u; two each for  e and  o)compared to 15 or so in English,but the most striking differences between Italian and English vowelsare\n Italian vowels are  pure. A sound written with a singleletter has a single, unchanged value, whereas in English the soundoften changes from one pure sound to another.For example, the  o in  go changes from the pure o-sound of Italian to the sound made by  oo in theEnglish word  boot.\n Unaccented English vowels tend to change value towards a moreneutral sound ; Italian vowels don&#39;t. Compare the two  a&#39;s in  amass.No Italian vowel ever makes a sound (schwa) like the first  a.\n  Italian  a is very open. For many AmericanEnglish speakers, it is similar to the short  oin  hot or to the first  ain  papa. It should never sound like  uh or  aw.\n i and  u are easier because they make sounds which regularly occur in just about everyone&#39;sEnglish. Italian  i makes a long  esound, as in the word  steep. Italian  u makes the sound of  ooin  boot.\n  Each has a so-called &#34;open&#34; and &#34;closed&#34; sound. Although there aresome rules about which sound to use, there is plenty they don&#39;t cover. There is often no way to know which sound to use in a particular word if you haven&#39;t heard it spoken correctly. It&#39;s much too complicateda subject to embark on here, but there is one simple rulefor the spoken language: Italian unstressed  e and  o are always closed.It&#39;s not always the case for sung Italian, however.\n Open  e makes a sound similar to English short e, as in  bet; the Italiansound is maybe a bit more open (mouth taller). Closed e makes a sound like the  ain  chaotic. It&#39;s not the same as themuch more common (in English) vowel soundin  way since this slides from the sound we&#39;re looking for into  ee.\n Open  o is like the vowel in  awe if you say it without any hint of diphthong.Closed  o, like closed  e,rarely occurs in English without sliding into something else. It&#39;sthe first vowel sound in  go, before it turnsinto  oo.\n  Diphthongs (always written with 2 vowels) are frequent in Italian.Sometimes  i is pronounced like  y in  yard(e.g. in the word  pietà)rather than having its normal value, and similarly  umay make a sound like English  w ( guarda). The rules for when this happens aretoo complicated to go into here. Other than these cases, each vowel ina diphthong has its usual sound, though in a stressed syllable one is longer than theother (no easy rule to determine which should be the long one), and the two sounds are distinct, with no slide from one into the other.\n  This section mentions all consonants which have more than one sound and some additional consonants whose Italian sound is enough unlikeEnglish that an English pronunciation will stand out unpleasantlyin an Italian word.\n   Double consonants in Italian should take noticeably longer to saythan the corresponding single consonants. Usually (unless the setting of text to music makes it impossible) the same is true in sung Italian. It&#39;s obvious how to do this for a consonant like  s or n but even stopped consonants, likethe double  tt in  tuttocan and should be make longer. Just hold the position of your mouthwhen the consonant is formed (in the case of  tthis would be with your tongue up against your teeth) for a bit, then release. There is another part to making a double consonant soundproperly long: take less time on the preceding vowel.\n  As in English,  c and  gmay be hard or soft. Each is hard when followed by a (different) consonantor by one of the vowels  a,  o or u and is soft when followed by  e or  i. The hard soundsare similar to English:  g as in good,  c as in car. Soft  g is alsosimilar to English, like the  g in  general. However Italian soft  c is like English  chin  chess. But there are some additional wrinkles:\n an  iusually gets &#34;used up&#34; in making a consonant soft and has no sound of its own\n Here are examples of practically everything that can happen to a  c.  g is similar.\n   Italian  r is either trilled or flipped, whichis just a very short version of a trill. Double  ris generally trilled, if the musical setting allows for it. Exactly whena single  r should be trilled (and for how long) and when flipped isbeyond the scope of this guide, but a good rule of thumb for single  r is flip if between two vowels (e.g. in &#34;fiori&#34;),trill in other positions (initial, preceding another consonant, following another consonant, or at the end of the word), e.g. in &#34;ritorna&#34;, &#34;nostro&#34; and &#34;cor&#34;. An American r-sound is  never appropriate; better to just leave the sound out altogether.\n  t and  d are less harshthan their English equivalents. The  t is not aspirated; that is, you shouldn&#39;t be able to feel a strong puff of air in front of your mouthwhen you say it, as you can with the English version. The difference seems subtle to many English speakers, but not to Italians. To get amore Italian sound for both letters, your tongue should just touch the back of your teeth,not your gums, and it should be somewhat relaxed, not tense and pointed,at the front.\n    There is no way to tell just from the spelling of a word containing z whether the  z isvoiced or not.  s is generally voiced ifit (single, not double) occurs between two vowels, or if it precedesa voiced consonant (as in the word  sdegno).The main thing to start with isto just be aware that there are two possible sounds for these lettersand listen carefully to an accurate pronunciation of new words containingthem.\n  The Italian sounds represented by these spellings don&#39;t exist in English. Italian  gn makes a sound  approximatelylike the  ny in the English word ca nyon,but not exactly. To come closer to the Italian sound, the tip of yourtongue should touch the back of your bottom teeth.\n  Similarly,Italian  gl makes a sound sort of like the sounds in the middle of the word &#34;million&#34;, but not quite the same.To come closer to the correct Italian sound, the tip of the tongue should touch the back of the bottom teeth.\n   There are plenty of books on Italian diction for singers but inevitablythe author will not pronounceEnglish exactly as you do -- no one does -- so examples can be misleading.David Adams, who wrote  A Handbook of Diction for Singers (Oxford University Press, 1999) musthave a pronunciation similar to mine because the examples were alwaysconsistent with what I&#39;ve heard in good spoken Italian. Also he doesa good job of explaining how to produce sounds which are uncommon orabsent in English.", "posttime": "2021-07-31 14:58:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发音,pronunciation,意大利语", "title": "意大利语发音：歌手入门", "title_en": "Italian Pronunciation: A Primer for Singers", "transed": 1, "url": "https://web.stanford.edu/~jrb/reference/italian.html", "via": "", "real_tags": ["发音", "意大利语"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几周前，用于构建 Dockerfiles 的 Docker 的 BuildKit 工具现在支持 heredoc 语法！有了这些新的改进，我们可以做各种以前困难的事情，比如多行运行，而不需要每行末尾那些讨厌的反斜杠，或者创建小的内联配置文件。在这篇文章中，我将介绍这些文档的基础知识，更重要的是您可以使用它们做什么，以及如何开始使用它们！ 🎉 BuildKit 是一个工具包，用于以高效、富有表现力和可重复的方式将源代码转换为构建工件。从本质上讲，它是 docker 镜像的下一代构建器，与主要 docker 运行时的其余部分巧妙地分开；您可以使用它来构建 docker 镜像，或用于其他 OCI 运行时的镜像。它带有许多超出 basicbuilder 支持的有用（且漂亮）的功能，包括更整洁的构建日志输出、更快且更高效的缓存构建、并发构建，以及非常灵活的架构以允许轻松扩展（我绝对不是公正对待）。您很可能已经在使用它，或者您可能想使用它！您可以在执行 docker build 时通过设置环境变量 DOCKER_BUILDKIT=1 在本地启用它，或者切换到使用 new(ish) docker buildx 命令。在技​​术层面上，buildkit 允许在多个不同的“构建器”之间轻松切换，这些构建器可以是本地的或远程的、在 dockerdaemon 本身、在 docker 容器中甚至在 Kubernetes pod 中。构建器本身分为两个主要部分，前端和后端：前端生成中间低级构建器 (LLB) 代码，然后由后端将其构建为图像。\nbuildkit 如此出色的部分原因在于它的灵活性——这些组件彼此完全分离，因此您可以在任何图像中使用任何前端。例如，您可以使用默认的 Dockerfile 前端，或编译您自己的独立构建包，甚至开发您自己的替代文件格式，如 Mockerfile。要开始使用heredocs，首先确保你使用buildkit 进行设置。切换到buildkit 会给你的build 设置提供大量开箱即用的改进，并且应该与旧的构建器完全兼容（并且你总是可以如果您不喜欢它，请切换回来）。正确设置 buildkit 后，您可以创建一个新的 Dockerfile：在此文件的顶部，我们需要包含一个 #syntax= 指令。该指令通知解析器使用特定的前端 - 在这种情况下，位于 docker/dockerfile:1.3-labson Docker Hub 的前端。有了这一行（必须是第一行），buildkit 将找到并下载正确的镜像，然后使用它来构建镜像。有了这些，我们可以使用一个 heredoc，在同一个 RUN 中执行两个命令！现在heredocs 正在起作用，您可能想知道-为什么要大惊小怪？好吧，到目前为止，Dockerfiles 中还缺少此功能。假设您想要构建一个需要大量命令来设置的映像。例如，Dockerfiles 中一个相当常见的模式涉及想要更新系统，然后安装一些额外的依赖项，即一次 apt 更新、升级和安装。\n但是，遗憾的是，像太多直观的解决方案一样，这并不能完全满足我们的需求。它当然有效 - 但我们为每次 RUN 创建一个新层，使我们的图像比它需要的大得多（并且构建需要更长的时间）。这就是今天大多数 Dockerfile 所做的，从官方的 docker 镜像到我为自己编写的凌乱的镜像。它工作正常，图像小而快速构建......但它看起来确实有点难看。如果你不小心忘记了换行符\\，那么你会得到一个语法错误！我们使用 &lt;&lt;EOF 来引入 heredoc（就像在 sh/bash/zsh/yourshell 中选择的一样），并在最后使用 EOF 来关闭它。在这两者之间，我们将所有命令作为脚本的内容由 shell 运行！到目前为止，我们已经看到了一些基本的语法。然而，新的 heredoc 支持不仅仅允许简单的例子，还有很多其他有趣的事情你可以做。但是假设您的设置脚本变得越来越复杂，并且您想使用另一种语言 - 例如 Python。好吧，没问题，您可以将heredocs连接到其他程序！事实上，你可以在heredocs中使用你喜欢的复杂命令，将上面的简化为：如果感觉有点繁琐或复杂，你也可以总是使用shebang：\n有很多不同的方法可以将 heredocs 连接到 RUN，希望将来会有更多的方法和改进！ Dockerfiles 中的 Heredocs 也让我们处理内联文件！假设您正在构建一个 nginx 站点，并且想要创建一个自定义索引页面：然后在单独的文件 index.html 中放置您的内容。但是如果你的索引页面真的很简单，把所有东西都分开会让人感到沮丧：如果你愿意，heredocs 让你把所有东西都放在同一个地方！希望我已经成功说服你尽可能尝试使用heredocs！目前，它们仍然只在登台前端可用，但它们应该很快就会发布 - 所以一定要采取看看并提供您的反馈！", "note_en": "As of a couple weeks ago, Docker&#39;s BuildKit tool for building Dockerfiles nowsupports  heredoc syntax!With these new improvements, we can do all sorts of things that were difficultbefore, like multiline  RUNs  without needing all those pesky backslashes atthe end of each line, or the creation of small inline configuration files.\n In this post, I&#39;ll cover the basics of what these heredocsare, and more importantly what you can use them for, and how to get startedwith them! 🎉\n   BuildKit is a toolkit for converting source code to build artifacts in anefficient, expressive and repeatable manner.\n Essentially, it&#39;s the next generation builder for docker images, neatlyseparate from the rest of the main docker runtime; you can use it for buildingdocker images, or images for other OCI runtimes.\n It comes with a lot of useful (and pretty) features beyond what the basicbuilder supports, including neater build log output, faster and morecache-efficient builds, concurrent builds, as well as a  very flexiblearchitecture to allow easy extendability (I&#39;m definitely not doing it justice).\n You&#39;re either most likely using it already, or you probably want to be!You can enable it locally by setting the environment variable DOCKER_BUILDKIT=1 when performing your  docker build, or switch to using thenew(ish)  docker buildx command.\n At a slightly more technical level, buildkit allows easy switching betweenmultiple different &#34;builders&#34;, which can be local or remote, in the dockerdaemon itself, in docker containers or even in a Kubernetes pod. The builderitself is split up into two main pieces, a frontend and a backend: the frontendproduces intermediate Low Level Builder (LLB) code, which is then constructedinto an image by the backend.\n  Part of what makes buildkit so fantastic is it&#39;s flexibility - these componentsare completely detached from each other, so you can use any frontend in anyimage. For example, you could use the default Dockerfile frontend, or compileyour own self-contained  buildpacks,or even develop your own alternative file format like  Mockerfile.\n  To get started with using heredocs, first  make sure you&#39;re setup with buildkit.Switching to buildkit gives you a ton of out-of-the-box improvements to yourbuild setup, and  should have complete compatibility with the old builder (andyou can always switch back if you don&#39;t like it).\n With buildkit properly setup, you can create a new  Dockerfile: at the top ofthis file, we need to include a  #syntax= directive. This directive informsthe parser to use a specific frontend - in this case, the one located at  docker/dockerfile:1.3-labson Docker Hub.\n   With this line (which has to be the very first line), buildkit will find anddownload the right image, and then use it to build the image.\n   With all that out the way, we can use a heredoc, executing two commands in thesame  RUN!\n   Now that heredocs are working, you might be wondering - why all the fuss? Well,this feature has kind of, until now, been missing from Dockerfiles.\n  Let&#39;s suppose you want to build an image that requires a  lot of commands tosetup. For example, a fairly common pattern in  Dockerfiles involves wanting toupdate the system, and then to install some additional dependencies, i.e.  apt update,  upgrade and  install all at once.\n   But, sadly like too many intuitive solutions, this doesn&#39;t quite do what wewant. It certainly works - but we create a new layer for each  RUN, making ourimage much larger than it needs to be (and making builds take much longer).\n   And that&#39;s what most  Dockerfiles do today, from the official docker imagesdown to the messy ones I&#39;ve written for myself. It works fine, images are smalland fast to build... but it does look a bit ugly. And if you accidentallyforget the line continuation symbol  \\, well, you&#39;ll get a syntax error!\n   We use the  &lt;&lt;EOF to introduce the heredoc (just like in sh/bash/zsh/yourshell of choice), and  EOF at the end to close it. In between those, we putall our commands as the content of our script to be run by the shell!\n  So far, we&#39;ve seen some basic syntax. However, the new heredoc support doesn&#39;tjust allow simple examples, there&#39;s lots of other fun things you can do.\n    But let&#39;s say your setup scripts are getting more complicated, and you want touse another language - say, like Python. Well, no problem, you can connectheredocs to other programs!\n  In fact, you can use as complex commands as you like with heredocs, simplifyingthe above to:\n  If that feels like it&#39;s getting a bit fiddly or complicated, you can alsoalways just use a shebang:\n  There&#39;s lots of different ways to connect heredocs to  RUN, and hopefully somemore ways and improvements to come in the future!\n  Heredocs in  Dockerfiles also let us mess around with inline files! Let&#39;ssuppose you&#39;re building an nginx site, and want to create a customindex page:\n  And then in a separate file  index.html, you put your content. But if yourindex page is just really simple, it feels frustrating to have to separateeverything out: heredocs let you keep everything in the same place if you want!\n     Hopefully, I&#39;ve managed to convince you to give heredocs a try when you can!For now, they&#39;re still only available in the staging frontend, but they shouldbe making their way into a release  very soon - so make sure to take a lookand give your feedback!", "posttime": "2021-07-31 14:58:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker,heredocs,构建", "title": "Dockerfiles 中的 Heredocs 简介", "title_en": "Introduction to Heredocs in Dockerfiles", "transed": 1, "url": "https://jedevc.com/blog/dockerfile-heredocs-intro/", "via": "", "real_tags": ["docker", "heredocs", "构建"]}, {"category": "", "categoryclass": "", "imagename": "4736d0ecd36e5ed36923854235defa6f.jpg", "infoid": 1070807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果承销商行使其选择权，这家以色列电子商务欺诈保护公司将筹集 3.63 亿美元和 5510 万美元。", "note_en": "The Israeli e-commerce fraud protection company is raising $363 million and an additional $55.1 million, if the underwriters exercise their options.", "posttime": "2021-07-31 14:08:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,israeli,行使", "title": "以色列电子商务欺诈保护公司 Riskified 在 IPO 中筹集了 3.63 亿美元后，于周四开始在纽约证券交易所交易，估值为 3.3B 美元", "title_en": "Riskified, an Israeli e-commerce fraud protection company, began trading on the NYSE on Thursday after raising $363M in its IPO, at a valuation of $3.3B", "transed": 1, "url": "https://en.globes.co.il/en/article-riskified-begins-trading-on-nyse-today-at-33b-valuation-1001379903", "via": "", "real_tags": ["交易", "israeli", "行使"]}, {"category": "", "categoryclass": "", "imagename": "ad6186f893bff1f4442ae128e56c773e.jpeg", "infoid": 1070806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据其首席执行官的说法，运营着世界上最大、利润最高的社交媒体网络的公司将不再是一家社交媒体公司。马克·扎克伯格（Mark Zuckerberg）在一份引发热烈猜测、分析和嘲讽的公告中宣称，Facebook 将成为一家“元节公司”。扎克伯格说，Facebook 将从一个通过手机和笔记本电脑访问的网站转向下一代计算平台，该平台的重点是用户的“存在”，并通过 Facebook 的 Oculus 耳机或其他 Facebook 产品通过 VR 访问门户网站。 “我认为在接下来的五年左右的时间里，”扎克伯格告诉 Verge 的凯西牛顿，“我们将有效地从人们认为我们主要是一家社交媒体公司转变为一家元界公司。”在大型科技领域的其他地方，微软首席执行官萨蒂亚·纳德拉（Satya Nadella）一直在宣传他建立“企业元界”的目标。在 5 月的 Microsoft Inspire 主题演讲中，以及在 7 月的财报电话会议上，纳德拉将其描述为“基础设施堆栈的新层”，“数字和物理世界在这里融合”。不仅仅是微软和 Facebook。硅谷越来越多的投资者阶层、啦啦队专家和有影响力的创始人也一直在大肆宣传所谓的元宇宙。经营 Fortnite 的 Epic Games 的首席执行官蒂姆·斯威尼 (Tim Sweeney) 多年来一直将元宇宙宣传为快速到来的未来。风险投资家马修鲍尔试图绘制其潜力并解释为什么它“可能产生数万亿美元的价值”。游戏平台 Roblox 的创始人大卫·巴斯祖基 (David Baszucki) 在 1 月份为《连线》(WIRED) 发表的一篇文章中赞扬了它并强调了它的重要性。他写道：“Metaverse 可以说是在线交流中与电话或互联网一样大的转变。”正如扎克伯格所说：“元宇宙是一个跨越许多公司——整个行业的愿景。” “你可以把它想象成移动互联网的接班人。”当然，我们以前看过这部电影：许多硅谷公司联合起来拥抱一个新的、模糊的概念，即物联网，这对热爱大局的投资者来说既具有足够的未来感，又具有新鲜的吸引力。这并没有阻止这些公司在行业内掀起一股不可避免的新风，或者它的拥护者鼓吹它即将到来。 “元宇宙即将到来，”福布斯的一位未来学家在一篇广受关注的故事中热情洋溢，“这是一件非常重要的事情。”事实上，谷歌快速搜索显示，从《连线》到《经济学人》、《时代》杂志、InvestorPlace.com 和 Verizon 的“新闻中心”，每个人都发表了标题为“元界即将到来”的故事，这有助于提供对谁感兴趣的快照在它的到来。\n如果它即将到来，如果它是一件大事，那么令人惊讶的是很少有人停下来仔细考虑元宇宙的实际来源，这似乎是一个好主意，特别是因为该来源是一部关于崩溃的美国的深度反乌托邦小说那里充斥着暴力和贫困。元宇宙诞生于尼尔斯蒂芬森 1992 年的雪崩，在那里它作为娱乐和经济软肋，供一个贫穷、绝望的国家使用，这个国家实际上是由企业特许经营权统治的。你不会在这些战略公告中看到元宇宙起源的踪迹，到目前为止，这些战略公告似乎主要暗示创建和联合更身临其境的数字环境，在这些环境中可以消费娱乐和开展工作——以及展示广告、监视工人和标记 NFT和战利品盒出售。没有任何痕迹，也就是说，除非你在 Twitter 上读到它，在那里，关于元节产品的新闻很可能夹在关于压垮医疗保健债务的故事或关于猖獗的不平等的轶事之间。所以我认为值得研究为什么我们现实世界中的 CEO 的下一个大型高科技概念可能是从大规模贫困和暴力的公开反乌托邦背景中产生的；在一个沉浸式、共享的 3D 数字环境中，任何事情都可以为大多数人提供逃离无法忍受的现实的唯一机会。 Snow Crash 的英雄名叫 Hiro，他是一名临时工送货司机，兼职黑客，生活赤贫，与一个酗酒的室友共用一个 20x30 的存储单元。 “Hiro 花了很多时间在元宇宙中。它击败了 U-Stor-It。”我们所知道的美国已经不复存在，企业实体和有组织的犯罪控制着整个城邦。像 Hiro 这样的工人可能会因为送比萨饼的时间太长而被杀，他们被迫进入元宇宙黑社会，寻找合法的工作和足够的钱来维持生计。物理世界中唯一相当安全的地方是堡垒坚固的“burbclaves”，富人居住在枪炮和封闭社区后面。用户通过 VR 护目镜访问的 Metaverse 是当今大多数了解电子游戏的人应该熟悉的那种 3D 数字环境，除了它是巨大的——Metaverse 的大部分房地产都沿着 The Street 开发，一条巨大的虚拟通道，环绕着其数字世界的数千英里——没有规则，也没有设定的目标。用户选择一个头像（斯蒂芬森也创造了该术语的流行用法）来代表他们的数字自我。更高分辨率的表示成本更高，因此也在虚拟世界中分层。 “就像现实中的任何地方一样，这条街会不断发展，”斯蒂芬森解释说。 “开发商可以在主要街道的基础上建造自己的小街道。他们可以建造建筑物、公园、标志，以及现实中不存在的东西，例如巨大的悬停在头顶上的灯光秀，忽略三维时空规则的特殊街区，以及人们可以去的自由战斗区互相猎杀。”\n好的！所以元宇宙是用于灯光秀，人们厌倦了时空连续体的存在，以及大屠杀。 （仔细想想，这听起来有点像现存的互联网，或者只是 Fortnite。）最后，应该指出的是，有一整类人，用户被嘲笑地称为石像鬼，他们变得如此迷恋存在于Metaverse，他们将自己安装为永久插入，并因此在现实中永久毁容。在 Snow Crash 出版后的几年里，石像鬼一直被视为对屏幕成瘾陷阱的先见之明的评论。因此，在当前元宇宙热潮起源的书中，不仅我们的世界处于废墟之中，大多数人在赤贫中勉强维持着不稳定的生活，而且元宇宙本身是一个令人上瘾、暴力的地方，并且是我们实现最坏的冲动。这是一个非常黑暗的愿景，如果是讽刺和有点卡通的（也有很多剑）。因此，尽管随着世界分崩离析，计算技术的发展愿景变得更加突出，但在过去几周和几年里，创始人和啦啦队员们对元宇宙的赞歌中完全没有承认这一点，这有点值得注意.在《雪崩》的世界中，元宇宙并不被视为特别酷——这是必要的，因为现实世界已经变得如此不堪。在最着名的书中为我们现代、流行文化饱和的时代更新元宇宙的架构：Ready Player One。如果它是由经过 80 年代电影和 00 年代视频游戏训练的神经网络编写的，那么它的 Oasis 基本上就是 Metaverse。那本书也设定在一个近乎反乌托邦的未来，绝望的人们被迫逃离他们不愉快的生活，进入一个广阔的虚拟环境——它暗示要么绿洲如此受欢迎，是因为世界太糟糕，要么世界如此糟糕，因为绿洲如此受欢迎。这是一个奇怪的关系，想要建立公司的未来！然而，有一段时间，Facebook Oculus 部门的新员工在要求阅读时收到了这本书的副本。两本书的元宇宙都有一个共同的真理：在未来，人类会放弃现实世界，转而支持逃避现实和消费主义的完全沉浸式数字世界，这是一种天生的反乌托邦。想要在 Metaverse 中花费大量时间，它必须比现实更有吸引力，这一壮举可以通过以下两种方式之一来完成 - 要么外面的世界已经糟糕到足以让你陷入故障，充满谋杀的另类选择，或者成为其他人的幻想足以令人信服地完全吞噬你。\n这两种配置都令人担忧。很容易看到，在流行病和野火肆虐以及非富人可获得的现实世界体验越来越有限的日子里，Metaverse 的销售宣传更具吸引力。但我的猜测是，Metaverse 愿景激励像扎克伯格这样的创始人的原因主要不是它所呈现的新市场机会网络，这肯定存在——而是个人对实现幻想元素的兴趣。 Zuck 提到他从中学开始就一直在思考元宇宙，当时他很可能已经阅读了描述它的科幻小说。很可能元宇宙向下一代创始人代表了太空旅行和火星上的异世界殖民地对埃隆马斯克和杰夫贝索斯等人的影响。它是一种科幻结构，可能在他们生活中的某个令人印象深刻的时刻捕捉到了他们的想象力——在元宇宙中，你可以成为任何人，做任何事情，并战胜敌人，无论现实世界的社会地位或身体状况如何。正如作家和媒体研究教授兼电子游戏设计师伊恩·博戈斯特 (Ian Bogost) 所指出的那样，“元宇宙从来都不是关于虚拟现实的幻想，而只是关于力量的幻想。”现在这些创始人拥有追求梦想的资本和权力，这正是他们正在做的事情。当我在 2018 年采访 Magic Leap 的一位高管时，可以说是该公司迄今为止最受欢迎的高峰期，我问他耳机的理想用例是什么。他说的第一句话是“我想要星球大战的世界出现在我的生活中……我想仰望天空，看到 Tie Fighters 和 X-wings 战斗。”目标是纯粹的、受青年启发的科幻幻想。当然，这两种愿景的更广阔的轮廓可能仍然是幻想——正如大卫卡普夫在《连线》、虚拟现实和它假定启用的元宇宙中指出的那样，是一种已经存在了几十年的常年“丰富的白人孩子技术”，保持向上失败，似乎注定要新颖而不是无处不在。值得补充的是，扎克伯格所描述的元宇宙——一个共享的 3D 空间，我们在其中生活和工作，并在具体的互联网中查看广告——如果它由 Facebook 设计、建造或管理，将是一场真正的噩梦，也许最臭名昭著的是网络上单调乏味、充斥着错误信息和美学上没有吸引力的环境。幸运的是，我们不需要非常担心这会以具体的方式实现，因为元节的愿景本质上有点荒谬。但即使是这样，大摇摆也会让扎克和他的同事们赚到钱。新闻界的一些轻信和宽容，为第三方开发商释放了一些风险投资，并让人们从无数未解决的问题中分心，这些问题现在仍然困扰着其不那么令人兴奋的 Newsfeedverse。从这个意义上说，宣布追求元宇宙的意图的最大影响是它可能为 Facebook、微软和其他科技巨头赢得一些回旋余地，有机会将对其行为和政策的批评转向他们再次处于中间的事实重大进化，所以让他们放松一些，你知道吗？许多科技公司已经意识到，如果他们不断发展自己的抱负并为椽子而努力，他们就更难受到批评，而大规模的元宇宙登月计划当然有资格。但像往常一样，这种无定形的概念和平台愿望，很少有。这些杰出人物，从 Zuck 到 Nadella 再到 Boz，似乎都没有能力为他们特定的元宇宙的外观或感觉描绘出一个连贯的愿景，除了示意“存在”和一系列应用程序、关键字和古老的科幻小说比喻之外。这是一个由少年幻想、感知到的市场机会和公开的反乌托邦构成的奇怪愿景。硅谷经常因未能预见到对其崇尚的新技术和思想的批评，以及未能预见到其产品的不利社会影响而受到批评。怀着构建元宇宙的愿望，它显然渴望直接从源头发展批评本身。", "note_en": "The company that operates the world’s largest and most profitable social media network will not, according to its CEO, be a social media company much longer. In an announcement that inspired a fervid wave of speculation, analysis, and mockery, Mark Zuckerberg proclaimed that Facebook is going to become a “metaverse company” instead.\n  Facebook will pivot from being a website that is accessed through phones and laptops, Zuckerberg says, to a next generation computing platform where the focus is on a user’s “presence,” and is accessed through VR via Facebook’s Oculus headset, or other Facebook products like Portal. “I think over the next five years or so,” Zuckerberg   told the Verge’s Casey Newton, “we will effectively transition from people seeing us as primarily being a social media company to being a metaverse company.”\n  Elsewhere in the big tech landscape, Satya Nadella, the CEO of Microsoft—at the time of writing the second largest company in the world in terms of market capitalization—has been promoting his aim to build an “Enterprise Metaverse.” At a Microsoft Inspire keynote talk   back in May, and on   a July earnings call, Nadella described this as “a new layer of the infrastructure stack” where “the digital and physical worlds converge.”\n  It’s not just Microsoft and Facebook. A widening swath of Silicon Valley’s investor class, cheerleading pundits, and influential founders have been hyping the so-called metaverse, too. Tim Sweeney, the CEO of Epic Games, which runs Fortnite, has for years   been promoting the metaverse as the fast-arriving future. The venture capitalist Matthew Ball   attempted to chart its potential and explain why it is “likely to produce trillions in value.” David Baszucki, the founder of the gaming platform Roblox, sung its praises and underlined its import in a January piece for WIRED.\n   “The Metaverse is arguably as big a shift in online communication as the telephone or the internet,” he wrote.\n  “The metaverse is a vision that spans many companies—the whole industry,” as Zuckerberg put it. “You can think about it as the successor to the mobile internet.”\n  We’ve seen this movie before, of course: a host of Silicon Valley companies uniting to embrace a new and nebulous concept, a la the Internet of Things, that sounds both adequately future-y and freshly attractive to big picture-loving investors. This has not stopped those companies from fomenting a new air of inevitability within the industry, or its advocates from trumpeting its imminent arrival. “The metaverse is coming,” one futurist   enthused in Forbes in a widely viewed story, “and it’s a very big deal.” In fact,   a quick Google search reveals that everyone from   WIRED to   the Economist to   TIME Magazine to   InvestorPlace.com to   Verizon’s “News Center” has published stories titled “The Metaverse Is Coming,” which helps to offer a snapshot of who has an interest in its arrival.\n  If it is coming, and if it is a big deal, then surprisingly few have paused to carefully consider the actual source of the metaverse, an undertaking which seems like a good idea, especially because that source is a deeply dystopian novel about a collapsed America that is overrun by violence and poverty. The metaverse was born in Neal Stephenson’s 1992  Snow Crash, where it serves as entertainment and an economic underbelly to a poor, desperate nation that is literally governed by corporate franchises.\n  You will see no trace of the metaverse’s origins in these strategy announcements, which so far seem to hint mostly at creating and uniting more immersive digital environments in which entertainment might be consumed and work carried out—and advertising displayed, workers surveilled, and   branded NFTs and loot boxes sold. No trace, that is, unless maybe you read about it on your Twitter feed, where a news item about a metaverse product is likely to be sandwiched between stories about crushing health care debt or anecdotes about rampant inequality.\n  So I think it is worth examining why it may be that our real-world CEOs’ next big high tech concept is sprung from an overtly dystopian context of mass poverty and violence; one where an immersive, shared 3D digital environment where anything goes offers most people’s only opportunity to escape from an intolerable reality.\n      The hero of  Snow Crash is named Hiro, and he is a gig worker delivery driver who moonlights as a hacker, and lives in abject poverty in a 20x30 storage unit he shares with an alcoholic roommate. “Hiro spends a lot of time in the metaverse. It beats the shit out of the U-Stor-It.”\n  The U.S. as we know it has ceased to exist, and corporate entities and organized crime control whole city-states. Workers like Hiro can be killed for taking too long to deliver a pizza, and they are driven into the metaverse underworld to find extralegal work and enough money to make ends meet. The only reasonably safe places in the physical world are heavily fortressed “burbclaves” where the wealthy reside behind batteries of guns and gated communities.\n  The metaverse, which users access through VR goggles, is the kind of 3D digital environment that should be familiar to most people who are aware of video games today, except that it’s massive—the majority of the metaverse’s real estate is developed along The Street, a huge virtual thoroughfare that encircles thousands of miles of its digital world—there are no rules, and there are no set objectives. Users select an avatar (Stephenson also coined the popular usage of that term, too) to represent their digital selves. A higher resolution representation costs more, thus stratifying class in the virtual world, too.\n    “Like any place in Reality, the Street is subject to development,” Stephenson explains. “Developers can build their own small streets feeding off of the main one. They can build buildings, parks, signs, as well as things that do not exist in Reality, such as vast hovering overhead light shows, special neighborhoods where the rules of three dimensional spacetime are ignored, and free-combat zones where people can go to hunt and kill each other.”\n   Okay! So the metaverse is for light shows, people tired of existing on the space-time continuum, and mass murder. (Come to think of it, this sounds a bit like the extant internet, or just Fortnite.)\n  Finally, it should be noted that there is an entire class of people, users derisively known as gargoyles, who become so hooked on existing in the metaverse that they rig themselves to be permanently plugged-in, and are permanently disfigured in reality as a result. In the years since  Snow Crash’s publication, gargoyles have been viewed as a prescient commentary on the pitfalls of screen addiction.\n  Thus, in the book from which the current metaverse craze originates, not only is our world in ruins and most people are eking out precarious lives in dire poverty, but the  metaverse itself is a place that is addictive, violent, and an enabler of our worst impulses.\n  It’s an exceedingly dark vision, if a satiric and somewhat cartoonish one (there are also lots of swords). So it’s a little remarkable that precisely none of this is acknowledged in the paeans to the metaverse that have emerged from founders and cheerleaders over the last few weeks and years, even as the vision of computing advancing as the world falls apart becomes all the more salient.\n  In the world of  Snow Crash, the metaverse is not viewed as particularly cool—it is  necessary, because the real world has become so unbearable. Ditto in the most famous book to update the metaverse’s architecture for our modern, pop culture-saturated era:  Ready Player One. Its Oasis is basically the Metaverse if it were written by a neural net trained on 80s movies and 00s video games.\n  That book too is set in a nearish dystopian future where desperate people are driven to escape their unpleasant lives into a vast virtual environment—it is insinuated that either the Oasis is so popular because the world is so bad, or the world is so bad because the Oasis is so popular. This is a weird nexus at which to want to build out your company’s future! And yet for a time, new recruits to Facebook’s Oculus division   were handed copies of the book as required reading.\n  Both books’ metaverses get at a common truism: there  is something inherently dystopian in a future where humans abandon the real world in favor of an escapist and consumerist-oriented fully immersive digital one. To want to spend any serious amount of time in a metaverse, it must be made more appealing than reality, a feat which can be accomplished in one of two ways—either the world outside is already shitty enough to drive you into a glitch-prone, murder-filled alternative, or the fantasy of becoming someone else is compelling enough to consume you totally.\n  Both configurations are fraught. It is easy to see the metaverse making a more compelling sales pitch in the days of pandemics and wildfires and increasingly limited real-world experiences available to the non-rich. But my guess is that the reason the metaverse vision inspires founders like Zuckerberg is not, primarily, the new network of market opportunities it presents, which is certainly there—but the personal interest in fulfilling the fantasy element. Zuck has mentioned that he has been thinking about the metaverse since middle school, when he may well have read the science fiction that described it.\n  It could well be that the metaverse represents to the next generation of founders what, say, space travel and off-world colonies on Mars do to the likes of Elon Musk and Jeff Bezos. It is a science fictional construct that perhaps captured their imagination at an impressionable moment in their lives—in the metaverse, you can be anyone, do anything, and vanquish foes, regardless of real-world social status or physicality. As the writer and media studies professor and video game designer   Ian Bogost noted, “The metaverse was never a fantasy about virtual reality, but just one about power.” And now that these founders have the capital and power to pursue the fantasy, that is exactly what they are doing.\n  When I   interviewed an executive at Magic Leap in 2018, at what was arguably the company’s peak in popularity thus far, I asked him what an ideal use case of the headset would be for him. The first thing he said was “I want the Star Wars universe in my life… I want to look up at the sky and see Tie Fighters and X-wings fighting.” The aim was pure, youth-inspired science fictional fantasy.\n  Of course, the broader contours of both visions will likely remain fantasies—as David Karpf   points out in WIRED, virtual reality, and the metaverse it presumes to enable, is a perennial “rich white kid technology” that has been around for decades, keeps failing upwards, and seems destined for novelty rather than ubiquity. And it’s worth adding that the metaverse as Zuckerberg describes it—a shared 3D space where we live and work and view advertising in an embodied internet—would be an actual nightmare if it were to be designed, built, or administered by Facebook, perhaps the most notoriously drab, misinformation-littered, and aesthetically unappealing environment on the web.\n  Fortunately, we do not need to fear this coming to pass in concrete terms very much, as the metaverse vision is inherently somewhat ludicrous. But even if it is, the big swing earns Zuck and co. some credulity and latitude in the press, unlocks some venture capital for third party developers, and offers a little distraction from the myriad unresolved issues that still plague its much less exciting Newsfeedverse right now. In this sense, the biggest impact of announcing intentions to pursue the metaverse is that it may win Facebook, Microsoft, and other tech giants some leeway, a chance to deflect criticisms of its conduct and policies towards the fact that they are again in the midst of major evolution, so cut them some slack, you know? Many tech companies have realized they are harder to criticize if they are   constantly evolving their ambitions and shooting for the rafters, and a massive metaverse moonshot certainly qualifies.\n  But as usual with such amorphous concepts and platform aspirations, there’s very little there. None of these luminaries, from Zuck to Nadella to   Boz, seem capable of painting a coherent vision for what their particular metaverse will look or feel like, beyond gesturing at “presence” and a collection of apps, keywords, and old science fiction tropes. It is an odd vision built from a compendium of juvenile fantasies, perceived market opportunities, and overt dystopias.\n  Silicon Valley is often criticized for failing to anticipate the critiques of the new technologies and ideas it lionizes, and for failing to anticipate the adverse social impacts of its products. With its aspirations to construct a metaverse, it is obliviously aspiring to develop the critique itself, direct from the source.", "posttime": "2021-07-31 14:08:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "市场,zuckerberg,宇宙", "title": "正如扎克伯格和其他人所想象的那样，元界是一个由少年幻想、感知到的市场机会和公开的反乌托邦构成的奇怪愿景", "title_en": "Metaverse, as Zuckerberg and others imagine, is an odd vision built from a compendium of juvenile fantasies, perceived market opportunities, and overt dystopias", "transed": 1, "url": "https://www.vice.com/en/article/v7eqbb/the-metaverse-has-always-been-a-dystopia", "via": "", "real_tags": ["市场", "宇宙"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Hole Hawg 是密尔沃基工具公司制造的钻头。如果您在一家典型的五金店寻找，您可能会发现较小的 Milwaukee 钻头，但不会找到 Hole Hawg，它对房主来说太强大且太贵了。 HoleHawg 没有廉价房主钻机的类似手枪的设计。它是一个实心金属立方体，一个面伸出一个手柄，另一个面安装一个夹头。立方体包含一个令人不安的强大电动机。您可以用食指握住手柄并操作扳机，但除非您特别强壮，否则您无法用一只手控制 Hole Hawg 的重量；一路上都是两个人。为了抵消 Hole Hawg 的反扭矩，您可以使用单独的手柄（已提供），根据您使用左手还是右手操作扳机，将其拧入铁立方体的一侧或另一侧。这个把手不是一个光滑的、符合人体工程学设计的物品，因为它会出现在房主的钻头中。它只是一块一英尺长的普通镀锌管，一端有螺纹，另一端有一个黑色橡胶手柄。如果你弄丢了，你只需去当地的水管用品商店再买一大块管子。在八十年代，我做了一些建筑工作。一天，另一名工人把梯子靠在我们搭的大楼外面，爬到二楼，用Hole Hawg在外墙钻孔。在某个时候，钻头卡在了墙上。 Hole Hawg 遵循它唯一的命令，继续前进。它像布娃娃一样旋转工人的身体，导致他撞倒了自己的梯子。幸运的是，他一直抓着留在墙上的Hole Hawg，他只是从它上面晃来晃去，大声呼救，直到有人走过来恢复了梯子。我自己用 Hole Hawg 在螺柱上钻了很多洞，它是用搅拌机切卷心菜的。我还用它在旧的板条和石膏天花板上切割了几个直径为 6 英寸的孔。我把一个新的孔锯扔进去，上到二楼，伸手到新安装的地板托梁之间，开始切割下面的一楼天花板。在我房主的钻头费力地旋转着巨大的钻头，并在最轻微的障碍物处停滞不前的地方，Hole Hawg 以旋转的行星的愚蠢的一致性旋转。当孔锯卡住时，Hole Hawg 自己和我一起旋转，将我的一只手压在钢管手柄和托梁之间，产生了几处裂伤，每处裂伤都被一个深深擦伤的肉体包围。它还弯曲了孔锯本身，尽管还没有严重到我无法使用它。经过几次这样的磨合后，当我准备好使用 Hole Hawg 时，我的心实际上开始因返祖恐惧而跳动。但我从不责怪 Hole Hawg；我责备自己。 Hole Hawg 很危险，因为它完全按照你的要求去做。它不受廉价钻头固有的物理限制的约束，也不受具有责任意识的制造商可能内置于房主产品中的安全联锁装置的限制。危险不在于机器本身，而在于用户无法想象他给它的指令的全部后果。较小的工具也很危险，但出于完全不同的原因：它会按照您的指示去做，但以某种不可预测且几乎总是不可取的方式失败。但是霍格霍格就像古代童话故事中的精灵，他真正地、准确地、以无限的力量执行主人的指示，往往会带来灾难性的、不可预见的后果。 Pre-Hole Hawg，我过去常常以我认为明智的眼光检查五金店的钻头选择，鄙视较小的低端型号并赞赏地举起昂贵的大型号，希望我能负担得起其中的一个婴儿。现在我以一种蔑视的态度看待它们，以至于我什至不认为它们是真正的演习——只是放大的玩具，旨在利用那些想要相信他们已经购买了真正工具的手软的房主的自欺欺人的倾向。他们的塑料外壳经过精心设计和焦点小组测试，以传达一种坚固和力量的感觉，对我来说似乎非常脆弱和廉价，我很惭愧我一直痴迷于购买这样的小玩意。不难想象，对于一个由承包商抚养长大并且除了 aHole Hawg 之外从未使用过任何钻机的人来说，世界会是什么样子。这样的人，拿到最好、最贵的五金店钻头，甚至都认不出来。相反，他可能会将其误认为是儿童玩具或某种电动螺丝刀。如果销售人员或被迷惑的房主将其称为演习，他会笑着告诉他们他们错了——他们只是用错了术语。他的对话者会生气地离开，并且可能对他的地下室充满廉价、危险、浮华、五颜六色的工具感到相当戒备。 Unix 是操作系统的 Hole Hawg，而 Unix 黑客，如 DougBarnes 和 Dilbert 漫画中的家伙以及其他许多居住在硅谷的人，就像承包商的儿子一样，只使用 Hole Hawgs 长大。他们可能会使用 Apple/Microsoft 操作系统来写信、玩电子游戏或平衡他们的支票簿，但他们无法真正让自己认真对待这些操作系统。", "note_en": "The  Hole Hawg is a drill made by the Milwaukee Tool Company. If you look ina typical hardware store you may find smaller Milwaukee drills but not theHole Hawg, which is too powerful and too expensive for homeowners. The HoleHawg does not have the pistol-like design of a cheap homeowner&#39;s drill. Itis a cube of solid metal with a handle sticking out of one face and a chuckmounted in another. The cube contains a disconcertingly potent electricmotor. You can hold the handle and operate the trigger with your indexfinger, but unless you are exceptionally strong you cannot control theweight of the Hole Hawg with one hand; it is a two-hander all the way. Inorder to fight off the counter-torque of the Hole Hawg you use a separatehandle (provided), which you screw into one side of the iron cube or theother depending on whether you are using your left or right hand to operatethe trigger. This handle is not a sleek, ergonomically designed item as itwould be in a homeowner&#39;s drill. It is simply a foot-long chunk of regulargalvanized pipe, threaded on one end, with a black rubber handle on theother. If you lose it, you just go to the local plumbing supply store andbuy another chunk of pipe. During the Eighties I did some construction work. One day, another workerleaned a ladder against the outside of the building that we were puttingup, climbed up to the second-story level, and used the Hole Hawg to drilla hole through the exterior wall. At some point, the drill bit caught inthe wall. The Hole Hawg, following its one and only imperative, kept going.It spun the worker&#39;s body around like a rag doll, causing him to knock hisown ladder down. Fortunately he kept his grip on the Hole Hawg, whichremained lodged in the wall, and he simply dangled from it and shouted forhelp until someone came along and reinstated the ladder. I myself used a Hole Hawg to drill many holes through studs, which it didas a blender chops cabbage. I also used it to cut a few six-inch-diameterholes through an old lath-and-plaster ceiling. I chucked in a new hole saw,went up to the second story, reached down between the newly installed floorjoists, and began to cut through the first-floor ceiling below. Where myhomeowner&#39;s drill had labored and whined to spin the huge bit around, andhad stalled at the slightest obstruction, the Hole Hawg rotated with thestupid consistency of a spinning planet. When the hole saw seized up, theHole Hawg spun itself and me around, and crushed one of my hands betweenthe steel pipe handle and a joist, producing a few lacerations, eachsurrounded by a wide corona of deeply bruised flesh. It also bent the holesaw itself, though not so badly that I couldn&#39;t use it. After a few suchrun-ins, when I got ready to use the Hole Hawg my heart actually began topound with atavistic terror. But I never blamed the Hole Hawg; I blamed myself. The Hole Hawg isdangerous because it does exactly what you tell it to. It is not bound bythe physical limitations that are inherent in a cheap drill, and neither isit limited by safety interlocks that might be built into a homeowner&#39;sproduct by a liability-conscious manufacturer. The danger lies not in themachine itself but in the user&#39;s failure to envision the full consequencesof the instructions he gives to it. A smaller tool is dangerous too, but for a completely different reason: ittries to do what you tell it to, and fails in some way that is unpredictableand almost always undesirable. But the Hole Hawg is like the genie of theancient fairy tales, who carries out his master&#39;s instructions literallyand precisely and with unlimited power, often with disastrous, unforeseenconsequences. Pre-Hole Hawg, I used to examine the drill selection in hardware stores withwhat I thought was a judicious eye, scorning the smaller low-end models andhefting the big expensive ones appreciatively, wishing I could afford oneof them babies. Now I view them all with such contempt that I do not evenconsider them to be real drills--merely scaled-up toys designed to exploitthe self-delusional tendencies of soft-handed homeowners who want to believethat they have purchased an actual tool. Their plastic casings, carefullydesigned and focus-group-tested to convey a feeling of solidity and power,seem disgustingly flimsy and cheap to me, and I am ashamed that I was everbamboozled into buying such knicknacks. It is not hard to imagine what the world would look like to someone who hadbeen raised by contractors and who had never used any drill other than aHole Hawg. Such a person, presented with the best and most expensivehardware-store drill, would not even recognize it as such. He might insteadmisidentify it as a child&#39;s toy, or some kind of motorized screwdriver. Ifa salesperson or a deluded homeowner referred to it as a drill, he wouldlaugh and tell them that they were mistaken--they simply had theirterminology wrong. His interlocutor would go away irritated, and probablyfeeling rather defensive about his basement full of cheap, dangerous,flashy, colorful tools. Unix is the Hole Hawg of operating systems, and Unix hackers, like DougBarnes and the guy in the Dilbert cartoon and many of the other people whopopulate Silicon Valley, are like contractor&#39;s sons who grew up using onlyHole Hawgs. They might use Apple/Microsoft OSes to write letters, play videogames, or balance their checkbooks, but they cannot really bring themselvesto take these operating systems seriously.", "posttime": "2021-07-31 14:07:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,stephenson,hole", "title": "Neal Stephenson：Unix——操作系统的大坑", "title_en": "Neal Stephenson: Unix – The Hole Hawg of Operating Systems", "transed": 1, "url": "http://www.team.net/mjb/hawg.html", "via": "", "real_tags": ["操作系统", "hole"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN 订阅者已向您提供以下仅限订阅的内容。成千上万的订阅者依赖 LWN 获取来自 Linux 和自由软件社区的最佳消息。如果您喜欢这篇文章，请考虑订阅 LWN。感谢您访问 LWN.net！众所周知，C 编程语言容易出现内存安全问题，导致缓冲区溢出和看似无穷无尽的安全漏洞流。但是，即使在 C 中，在许多情况下也可以改善这种情况。其中之一是 memcpy() 系列函数，用于有效地复制或覆盖内存块；在编译器的帮助下，可以防止这些函数写到它们传递的目标对象的末尾。然而，在内核中强制执行这一条件比人们想象的要困难，因为这个庞大的补丁集", "note_en": "The following subscription-only content has been made available to you by an LWN subscriber. Thousands of subscribers depend on LWN for the best news from the Linux and free software communities. If you enjoy this article, please consider  subscribing to LWN. Thank youfor visiting LWN.net!\n The C programming language is famously prone to memory-safety problemsthat lead to buffer overflows and a seemingly endless stream of securityvulnerabilities. But, even in C, it is possible to improve thesituation in many cases. One of those is the  memcpy() family offunctions, which are used to efficiently copy or overwrite blocks ofmemory; with a bit of help from the compiler, those functions can beprevented from writing past the end of thedestination object they are passed. Enforcing that condition in the kernelis harder than one might expect, though, as  thismassive patch set", "posttime": "2021-07-31 14:07:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,边界,memcpy,订阅", "title": "Linux 内核的严格 memcpy() 边界检查", "title_en": "Strict memcpy() bounds checking for the Linux kernel", "transed": 1, "url": "https://lwn.net/SubscriberLink/864521/d704bdcced0c5c60/", "via": "", "real_tags": ["linux", "边界", "memcpy", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "c08d7f4d6c90921dad87a5e735f305e6.jpg", "infoid": 1070802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（美国有线电视新闻网）随着北极气温飙升，格陵兰正在经历今年最重要的融化事件。仅在周二融化的冰量就足以在两英寸深的水中覆盖整个佛罗里达州。这是过去十年中第三次极端融化，在此期间，融化范围比从 1970 年代开始的整个卫星时代更深入​​内陆。根据丹麦气象研究所的数据，格陵兰岛周二失去了超过 85 亿吨的地表质量，自周日以来减少了 184 亿吨。虽然本周的总冰损失量不像 2019 年的类似事件那样极端——这是创纪录的融化年——但正在融化的冰盖面积更大。 “这是一次重大的融化，”科罗拉多大学国家冰雪数据中心的高级研究科学家 Ted Scambos 告诉 CNN。 “7 月 27 日，格陵兰岛东半部从北端一直到南端的大部分地区大部分都融化了，这很不寻常。”根据@PolarPortal 的说法，#Greenland 正在发生大规模的冰融化事件 这足以在 2 英寸（5 厘米）深的水中覆盖佛罗里达 就十亿吨而言，不像 2019 年那么极端，但融化面积比2年前。 #ClimateChange #ClimateAction pic.twitter.com/Ai7RaWWebK — 世界气象组织 (@WMO) 2021 年 7 月 29 日随着人为气候变化使地球变暖，冰损失迅速增加。根据最近发表在冰冻圈杂志上的一项研究，自 1990 年代中期以来，地球已经损失了惊人的 28 万亿吨冰，其中很大一部分来自北极，包括格陵兰冰盖。\n“在过去十年中，我们已经看到格陵兰岛的地表融化变得更加严重和不稳定，”利兹大学冰川学家、该报告的合著者托马斯·斯莱特说。 “随着格陵兰上空的大气继续变暖，昨天的极端融化等事件将变得更加频繁。”尽管格陵兰岛目前的冰川融化并不是创纪录的，但这些事件发生的幅度是气候变化如何创造更多融化期的明确信号。 “总的来说，我们看到格陵兰岛融化的频率更高，”国家冰雪数据中心格陵兰岛更新的作者 Scambos 说。 “在过去的几十年或几个世纪里，格陵兰岛山顶的温度超过冰点是极其罕见的。” 2019 年，格陵兰岛向海中排放了大约 5320 亿吨冰。那一年，一场意外的温泉和七月的热浪导致几乎整个冰盖表面开始融化。结果，全球海平面永久上升了 1.5 毫米。斯莱特说，随着格陵兰地表继续融化，世界各地的沿海城市都容易受到风暴潮洪水的影响，尤其是在极端天气与高潮同时发生时。他补充说，预计到本世纪末，格陵兰岛的融化将使全球海平面上升 2 至 10 厘米。当气温升高时，巨大的冰盖会迅速融化。但温暖的海水也在侵蚀边缘的冰盖。随着人类释放吸热温室气体，变暖的大气层融化了地表的新鲜白冰——将太阳的能量反射回太空。这暴露了下面的深色冰，吸收太阳能并导致更多的融化。\n此外，温暖的沿海海水融化了边缘的冰盖，破坏了导致海平面上升的巨大冰山。科学家表示，气候变化加速的趋势非常明显，除非排放得到控制，否则此类极端事件将继续更频繁地发生。 “虽然此类事件令人担忧，但科学是明确的，”斯莱特说。 “有意义的气候目标和行动仍然可以限制本世纪全球海平面上升的幅度，减少严重洪水对世界各地人民和基础设施造成的破坏。”更正：这个故事的早期版本包括对格陵兰的错误描述。格陵兰岛是北美的一部分。这个故事已经更新。", "note_en": "(CNN)Greenland is experiencing its most significant melting event of the year as temperatures in the Arctic surge. The amount of ice that melted on Tuesday alone would be enough to cover the entire state of Florida in two inches of water.\n It&#39;s the third instance of extreme melting in the past decade, during which time the melting has stretched farther inland than the entire satellite era, which began in the 1970s.\n Greenland lost more than 8.5 billion tons of surface mass on Tuesday, and 18.4 billion tons since Sunday, according to the Denmark Meteorological Institute. While this week&#39;s total ice loss is not as extreme as a similar event in 2019 — a  record melt year — the area of the ice sheet that&#39;s melting is larger.\n     &#34;It&#39;s a significant melt,&#34; Ted Scambos, a senior research scientist at the National Snow and Ice Data Center at the University of Colorado, told CNN. &#34;July 27th saw most of the eastern half of Greenland from the northern tip all the way to the southern tip mostly melted, which is unusual.&#34;\n   A massive ice melting event is taking place in  #Greenland, according to  @PolarPortal  It would be enough to cover Florida in 2 inches (5 cm) of water  Not as extreme as 2019 in terms of gigatons but the melt area is a bit larger than 2 years ago. #ClimateChange  #ClimateAction  pic.twitter.com/Ai7RaWWebK\n— World Meteorological Organization (@WMO)  July 29, 2021\n  As human-caused climate change warms the planet, ice loss has increased rapidly. According to a recent study published in the  journal Cryosphere, Earth has lost a staggering 28 trillion tonnes of ice since the mid-1990s, a large portion of which was from the Arctic, including the Greenland ice sheet.\n  &#34;In the past decade, we&#39;ve already seen that surface melting in Greenland has become both more severe and more erratic,&#34; said Thomas Slater, a glaciologist at the University of Leeds and a co-author on that report. &#34;As the atmosphere continues to warm over Greenland, events such as yesterday&#39;s extreme melting will become more frequent.&#34;\n Although the current ice meltdown in Greenland isn&#39;t record-setting, the magnitude at which these events occur is a clear signal of how climate change is creating more melt periods.\n &#34;Overall, we&#39;re seeing that Greenland melts more often,&#34; said Scambos, who also authors the National Snow and Ice Data Center&#39;s Greenland updates. &#34;In previous decades or centuries, it&#39;s extremely rare to get above freezing temperatures at the summit of Greenland.&#34;\n In 2019, Greenland shed roughly  532 billion tons of ice into the sea. During that year, an unexpectedly hot spring and a  July heat wave caused almost the entire ice sheet&#39;s surface to begin melting. Global sea level rose permanently by 1.5 millimeters as a result.\n   As Greenland&#39;s surface continues to thaw, Slater said coastal cities around the world are vulnerable to storm-surge flooding, especially when extreme weather coincides with high tides. Melting from Greenland is expected to raise global sea level between 2 and 10 centimeters by the end of the century, he added.\n Massive ice sheets can melt rapidly when the air temperature is warm. But warmer ocean water is also eroding the ice sheet around the edges.\n As humans release heat-trapping greenhouse gas, the warming atmosphere thaws the fresh white ice — which reflects the sun&#39;s energy back into space — on the surface. That exposes the darker ice below which absorbs solar energy and causes more melting.\n Additionally, warmer coastal water melts the ice sheet around the edges, breaking off massive icebergs that contribute to sea level rise.\n Scientists say the trends at which climate change is accelerating are quite clear, and that unless emissions are curbed, such extreme events will continue to occur more frequently.\n   &#34;While such events are concerning, the science is clear,&#34; Slater said. &#34;Meaningful climate targets and action can still limit how much the global sea level will rise this century, reducing the damage done by severe flooding to people and infrastructure around the world.&#34;\n Correction: An earlier version of this story included an incorrect description of Greenland. Greenland is part of North America. This story has been updated.", "posttime": "2021-07-31 14:06:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "融化,greenland", "title": "周二融化的格陵兰冰量可以覆盖佛罗里达州 2 英寸的水", "title_en": "The amount of Greenland ice that melted on Tuesday could cover FL in 2” of water", "transed": 1, "url": "https://www.cnn.com/2021/07/29/us/greenland-ice-melting-climate-change/index.html", "via": "", "real_tags": ["融化", "greenland"]}, {"category": "", "categoryclass": "", "imagename": "32602e63afb373bc6ac20fbf7dfc28a6.jpg", "infoid": 1070801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去几年中，气候经济学家采用了一种称为“碳的社会成本”的概念来衡量每增加一吨二氧化碳对大气造成的损害的美元价值。 2 月，白宫宣布政府官员将在制定新的环境法规时考虑碳的社会成本。现在，一名研究人员提出了碳的死亡成本，其中包括与气候相关的高温死亡造成的损失。今天发表在《自然通讯》杂志上的这篇新论文估计，为了挽救一个生命，我们必须防止 4,434 公吨二氧化碳释放到大气中。这个数量等于 3.5 个美国人一生中产生的碳排放量。哥伦比亚大学可持续发展研究生、该研究的作者 Daniel Bressler 估计，如果到 2050 年世界经济能够“脱碳”——即消除碳排放，全球将有 7400 万人免于与热相关的死亡。”通过减少排放可以挽救大量生命——无论是个人规模、公司规模、国家规模还是全球范围，”布雷斯勒说。 Bressler 的研究侧重于气候驱动的极端高温问题，这会导致中暑、脱水、呼吸和器官衰竭，尤其是在老年人等高危人群中。 Bressler 说，为了提出这个模型，他从耶鲁大学经济学家威廉·诺德豪斯 (William Nordhaus) 开发的现有碳社会成本模型开始，该模型最初将这一数字定为每吨 37 美元。然后，他用新研究的结果对其进行了更新，这些研究描述了气候变化如何影响公共健康并增加了因高温导致的过度死亡人数。该模型假设工业排放量在 2050 年之前继续上升，然后在本世纪剩余时间内趋于平稳。在将 Nordhaus 模型与新的气候信息进行比较后，Bressler 说：“我得出的结论是，模型中不到 5% 的原始损害来自死亡，而且我还得出结论，它没有更新到最新的科学。 ”就在今年夏天，严重的热浪在整个北半球引发了野火，而 6 月下旬在太平洋西北部定居的“热穹顶”在华盛顿和俄勒冈州造成 100 多人死亡，在不列颠哥伦比亚省造成近 500 人死亡。 Bressler 的论文将碳的社会成本从每吨 37 美元（超过白宫目前的 51 美元）修改为每公吨 258 美元。这个数字代表了排放每吨碳造成的所有社会损害——例如农业损失、风暴造成的生产力损失、海平面上升造成的损害以及用于清理与气候相关的洪水的资金——加上因过热而失去的生命成本。每年夏天，许多人因缺乏空调或因先前存在的条件而死亡，因此试图弄清楚气候变化在与高温有关的死亡中的作用一直很棘手。但是现在有越来越多的证据使计算变得更容易。今年 3 月，英国伦敦卫生与热带医学学院的研究人员在《自然气候变化》杂志上发表了一项研究，该研究计算出，全球平均 37% 的与热相关的死亡是由气候变化造成的。他们对来自 43 个国家的数据进行了分析，以估计与 1991 年至 2018 年间发生的人为变暖导致的额外热暴露相关的死亡率负担。\n碳的社会成本的想法是由诺德豪斯提出的，诺德豪斯因其关于气候变化如何影响经济的想法而获得了 2018 年的诺贝尔奖。在 2017 年的一篇论文中，诺德豪斯提出了一个基于 2010 年社会成本统计数据的方程式，但与涉及气候科学和人类行为的任何公式一样，它需要随着条件的变化而更新。纽约大学气候研究副教授格诺特·瓦格纳 (Gernot Wagner) 没有参与该论文，他说布雷斯勒的工作推动了该领域的发展。 “它增加了这些极端高温事件对死亡率的影响，这是新的，也是朝着正确方向迈出的重要一步，”他说。虽然这篇论文是一个旨在引发讨论的思想实验，但它提出的关于气候变化和金钱的问题也可能在实际政策中发挥作用。一些专家认为，拜登政府计划更新石油和天然气公司为在联邦土地上钻探而支付的特许权使用费，应将有关碳的社会成本和死亡率成本的新数据考虑在内。未来资源的经济学家兼研究员布赖恩·普雷斯特 (Brian Prest) 于 3 月在国会就碳的社会成本以及如何将其应用于联邦石油和天然气租赁作证。 Perst 在接受 WIRED 采访时指出，石油和天然气公司支付了大约 12.5% 的特许权使用费，但如果考虑到每桶化石燃料碳排放的实际未来成本，成本可能会跃升至 25%，因为他在他合着的一篇研究论文中写道。 “在更新碳的社会成本时，政府将不得不考虑所有新科学，”佩斯特说。 “所以这当然是非常及时的。” 🏃🏽‍♀️ 想要获得健康的最佳工具吗？查看我们的 Gear 团队精选的最佳健身追踪器、跑步装备（包括鞋子和袜子）和最佳耳机", "note_en": "For the past few years, climate economists have employed a concept called the “social cost of carbon” to measure the dollar value of the damage inflicted by adding each ton of carbon dioxide to the atmosphere. In February, the White House announced that government officials will consider the social cost of carbon in  crafting new environmental regulations.\n Now a researcher has come up with a  mortality cost of carbon, which encompasses the toll from climate-related heat deaths. The new paper, published today in the journal   Nature Communications, estimates that we would have to prevent 4,434 metric tons of carbon dioxide from being released into the atmosphere to save one life. That amount equals the lifetime carbon emissions produced by 3.5 Americans.\n Daniel Bressler, a graduate student in sustainable development at Columbia University and the study’s author, estimates that 74 million lives would be saved globally from heat-related deaths if the world’s economies could “decarbonize”—i.e., eliminate carbon emissions—by 2050. “There is a significant number of lives that can be saved by reducing emissions—at the scale of individuals, at the scale of companies, at the scale of nations, and globally,” says Bressler.\n  Bressler’s study focuses on the problem of  climate-driven  extreme heat, which can lead to heat stroke, dehydration, and respiratory and organ failures, especially among at-risk populations like the elderly. To come up with this model, Bressler says he started with an existing one for the social cost of carbon developed by Yale University economist William Nordhaus, which originally pegged that figure at $37 per ton. Then he updated it with the results of new studies that describe how climate change is affecting public health and increasing the number of excess deaths from heat. The model assumes a scenario in which industrial emissions continue to rise until 2050 before leveling off for the rest of the century.\n After comparing the Nordhaus model with the new climate information, Bressler says, “what I concluded was that less than 5 percent of the original damages in the model were coming from mortality, and I also concluded that it was not updated to the latest science.” Just this summer, severe heat waves have spawned wildfires across the northern hemisphere, while a “heat dome” that settled over the Pacific Northwest in late June was responsible for more than 100 deaths in Washington and Oregon, and  nearly 500 deaths in British Columbia.\n  Bressler’s paper revises the social cost of carbon from $37 per ton, and past the White House’s current value of $51, to a whopping $258 per metric ton. This figure represents all of the societal damages that result from emitting each ton of carbon—such as agricultural losses, lost productivity caused by storms, damages caused by sea level rise, and the money spent to clean up climate-related floods—plus adding in the cost of lives lost to excess heat.\n  Many people die each summer for lack of air-conditioning or because of preexisting conditions, so trying to figure out the role of climate change in heat-related deaths has been tricky. But now there’s a growing body of evidence that is making that calculation easier. In March, researchers at the UK’s London School of Hygiene and Tropical Medicine published a study in the journal   Nature Climate Change that calculated that climate change is responsible for an average of 37 percent of all heat-related deaths across the globe. They crunched numbers from 43 countries to estimate the mortality burdens associated with the additional heat exposure that has resulted from human-induced warming occurring between 1991 and 2018.\n  The idea of a social cost of carbon was floated by Nordhaus, who won the Nobel Prize in 2018 for his ideas on how climate change affects the economy. In a  2017 paper, Nordhaus came up with an equation based on 2010 statistics for social costs, but as with any formula that involves both climate science and human behavior, it needs updating as conditions change.\n  Bressler’s work advances the field, says  Gernot Wagner, an associate professor of climate studies at New York University who was not involved with the paper. “It adds the mortality implications of these extreme heat events, which is novel and an important step in the right direction,” he says.\n While the paper is a thought experiment designed to provoke discussion, the questions it raises about climate change and money also may play a role in actual policies. Some experts believe that new data on the social and mortality costs of carbon should be factored into the Biden administration’s plan to update the royalties that oil and gas companies pay to drill on federal lands.\n Brian Prest, an economist and fellow at Resources for the Future,  testified before Congress in March on the social costs of carbon and how that could be applied to federal oil and gas leasing. In an interview with WIRED, Prest noted that oil and gas companies pay about 12.5 percent in royalties, but if the actual future cost of the carbon emitted by that barrel of fossil fuel is considered, the cost would probably jump to 25 percent, as he wrote in  a research paper he coauthored. “The administration is going to have to consider all the new science in updating the social cost of carbon,” Prest says. “So this is certainly very timely.”\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2021-07-31 14:06:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "气候,prevent,成本", "title": "防止气候驱动的热量造成的死亡需要多少费用？", "title_en": "How Much Will It Cost to Prevent Deaths by Climate-Driven Heat?", "transed": 1, "url": "https://www.wired.com/story/how-much-will-it-cost-to-prevent-deaths-by-climate-driven-heat/", "via": "", "real_tags": ["气候", "prevent", "成本"]}, {"category": "", "categoryclass": "", "imagename": "82d1c4a3589f41f451d9cb32f13258b1.jpg", "infoid": 1070800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "其联合创始人兼首席执行官 Asish Mohapatra 告诉 ET，OfBusiness 已经筹集了 1.6 亿美元的新资金，由 SoftBank Vision Fund-II 领投，公司估值为 15 亿美元。随着创纪录的资金流入该国的初创经济，这个企业对企业 (B2B) 商务平台现在是今年第 18 家印度独角兽企业——估值超过 10 亿美元的初创企业。软银在这一轮向 OfBusiness 投入了 1.5 亿美元，而 Falcon Edge Capital 和 Matrix Partners 则贡献了余额。 Falcon Edge 早些时候曾在 4 月份领投了该公司的 1.1 亿美元融资，当时 OfBusiness 的估值为 8 亿美元。 Mohapatra 表示，他将利用新资本进行收购和战略投资，以更好地控制其核心部门的供应链，如粮食、金属、塑料、石化、工业化学品、粮食和建筑材料。 “我们一直在盈利，但（收购）将使我们的利润率提高到两位数。我们已经达到了需要有效控制（对供应链）的规模，”他说。根据其 7 月的收入，OfBusiness 于五年前推出，目前的收入运行率为 11 亿美元。该公司的利润率通常为 5-10%，但（收购）可以帮助 OfBusiness 将利润率提高到十几岁，然后接近 20%。 “我们正在寻找收入在 20-20 亿卢比之间的公司，”首席执行官 Mohapatra 说。 ET 于 6 月 2 日首次报道了软银对 OfBusiness 的潜在投资。 今年到目前为止，软银已支持社交商务初创公司 Meesho 和银行技术平台 Zeta，将两者都带入了俱乐部。 ET 上个月报道称，这家日本科技投资者可能会以超过 10 亿美元的估值向 SaaS（软件即服务）平台 MindTickle 等投资组合公司加倍注资。其他垂直领域 虽然 OfBusiness 的核心业务是促进商业发展，但它还有一个融资平台——Oxyzo——通过自己的非银行金融公司 (NBFC) 许可证运营。纵向贷款是第二大业务纵向业务，其贷款额为 2.2 亿美元，每年增长 80%。根据 Mohapatra 的说法，它的不良资产 (NPA) 不到 1%。该公司还有一个 SaaS 垂直行业，可帮助中小企业在线采购印度和全球制造业和基础设施领域的各种招标。虽然商业贡献了其总净收入的 55%，但贷款和 SaaS 分别占了 43% 和 2%。在利润方面，贷款是其最大的贡献者，其次是商业。 “随着商业业务的持续增长，我们仍在对其进行大量投资。我们还在 17-18 种产品中启动自有品牌，并对其分销进行投资，”Mohapatra 补充道。 OfBusiness 目前的税前利润低于 3000 万美元，在计划的扩张和收购的支持下，预计到 22 财年将增加到 6000 万美元。 B2B 激增 虽然消费互联网公司继续从投资者那里筹集创纪录的资金，但在过去的 12 个月里，OfBusiness、Infra.Market、Moglix 和 Zetwerk 等 B2B 商务平台也在运营和从大型投资者那里筹集资金方面取得了突出地位。这些公司不一定是直接竞争对手。 “现有的线下供应和金融链无法为印度的 6000 万中小企业提供服务。 OfBusiness 已成功构建了一个全栈解决方案，通过单一市场实现商业和融资，该市场将中小企业数字化。我们对团队的市场领导地位、增长和对盈利能力的关注以及渴望成为 OfBusiness 的一部分印象深刻，”软银投资顾问合伙人 Sumer Juneja 说。", "note_en": "OfBusiness has raised fresh funding of $160 million led by  SoftBank Vision Fund-II, valuing the company at $1.5 billion, its cofounder and chief executive  Asish Mohapatra told ET.  The business-to-business( B2B)  commerce platform is now the 18th Indian unicorn—startups valued over $ 1 billion—for the year, as record inflow of capital is pumped into the country’s startup economy.  While SoftBank put in $150 million into OfBusiness in this round, Falcon Edge Capital and Matrix Partners contributed the balance. Falcon Edge had  earlier led a $110 million financing round in the company, in April, when OfBusiness was valued at $800 million.    Mohapatra said he will use the new capital for acquisitions and strategic investments to gain greater control over the supply chain of its core segments like foodgrains, metals, plastics, petrochemicals, industrial chemicals, food grains and building materials.  “We have been profitable but (acquisitions) will increase our profit margins into double digits. We have reached a scale where we need meaningful control (over the supply chain),” he said.  Launched five years ago, OfBusiness is currently at a revenue run-rate of $1.1 billion, based on its July revenue. The company typically earns margins of 5-10% but (acquisitions) could help OfBusiness take margins up to the early teens and then near the 20% mark.   “We are looking at companies that have revenue in the range of Rs 20-200 crore,” said CEO Mohapatra.  ET  first reported about SoftBank’s potential investment in OfBusiness on June 2. So far this year, SoftBank has  backed social commerce startup Meesho and  banking technology platform Zeta, taking both to the   club. ET reported last month that the Japanese tech investor is likely to double down on portfolio firms like SaaS (software-as-a-service) platform MindTickle  with a new cash infusion at a valuation of over $1 billion.   Other Verticals While the core business for OfBusiness is facilitating commerce, it also has a financing platform--Oxyzo--which is operated through its own non-banking financial company (NBFC) licence.   The  lending vertical, the second largest business vertical, has a loan book of $220 million which is growing 80% annually. According to Mohapatra, it has seen non-performing assets (NPA) of less than 1%.  The company also has a SaaS vertical which helps SMEs with online procurement of various tenders in the manufacturing and infrastructure sectors--both Indian and global.  While commerce contributes 55% of its total net revenue, lending and SaaS have a pie of 43% and 2%, respectively. In terms of profits, lending is its biggest contributor followed by commerce. “We are still investing heavily into the commerce business as it continues to grow. We are also starting private labels in 17-18 products and investing in its distribution,” Mohapatra added.  OfBusiness currently has a profit-before-tax run-rate of under $30 million which is expected to increase to $60 million by FY22 on the back of planned expansion and acquisitions.    B2B Surge While consumer internet firms continue to raise record capital from investors, B2B commerce platforms like OfBusiness, Infra.Market, Moglix and Zetwerk have also  gained prominence over the last 12 months-both in operations and fund raising from marquee investors. These companies are not necessarily direct competitors.  “The 60 million SMEs in India are underserved by the existing offline supply and finance chain. OfBusiness has successfully built a full-stack solution enabling commerce and financing through a single marketplace which is digitising the SMEs. We have been impressed by the team’s market leadership, growth and focus on profitability and eager to be part of OfBusiness,” said Sumer Juneja, partner, SoftBank Investment Advisers.", "posttime": "2021-07-31 13:17:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商务,unicorn,ofbusiness", "title": "B2B 商务和融资初创公司 OfBusiness 以 1.5B 美元的估值筹集了 1.6 亿美元，由 SoftBank Vision Fund 2 领投，成为今年第 18 家印度独角兽", "title_en": "B2B commerce and financing startup OfBusiness raises $160M led by SoftBank Vision Fund 2 at a valuation of $1.5B, becoming the 18th Indian unicorn for the year", "transed": 1, "url": "https://economictimes.indiatimes.com/tech/startups/ofbusiness-turns-unicorn-post-softbank-led-160-million-funding/articleshow/84905645.cms", "via": "", "real_tags": ["商务", "unicorn"]}]