[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1071964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 Twitter 上，我说了一些与新 TLD 相关的内容。我对我所说的其他条目有一些看法，但现在我想整理一些关于新 TLD 的总体看法。新的顶级 DNS 域有两种形式；有国家顶级域名（和类似国家的顶级域名）和官方所谓的通用顶级域名，比如“.online”等等。添加新的国家/地区 TLD 显然是必需的并且是明智的，我认为对于严格来说不是国家/地区的类似国家/地区的实体的新 TLD 也是如此，例如欧盟（不在 ISO 3166-1 中，尽管“欧盟”保留用于识别它并且它具有 .eu 作为 TLD）。我认为这是大多数人对国家/地区 TLD 的看法，因为很难争辩说，当现有国家/地区获得 TLD 时，新国家/地区不应拥有自己的 TLD。 （我对使用国家/地区 TLD 来创建有吸引力的 URL 持中立态度，例如使用 .ly 和 .io 的各种域。）我对所有通用的非国家/地区 TLD (gTLD) 有复杂的感觉，它们有时是称为虚名 TLD。这些通用顶级域名 (gTLD) 中有很多（也），其中一些最终会在一段时间后关闭，还有其他问题。人们还可以批评一些 gTLD 要么是不必要的要么没有很好的通用用途，其中一些与常见的非官方内部使用（例如，.dev，它也强制其中的所有网站使用 HTTPS）发生冲突。所有这一切都让人觉得要么根本不应该有新 gTLD，要么至少应该少很多。但是，对于拥有多少个新 gTLD 的选择并不是没有、有一些，也不是人们想要的多少。如果选择是“一些”，则 IANA 将负责决定哪些 gTLD 和哪些 gTLD 目的值得批准，哪些不值得。我怀疑是否就该标准应该是什么达成广泛共识，这意味着 IANA 基本上会做出任意决定（无论是针对 gTLD 还是针对 gTLD 标准）。选择“无”感觉不理想，过于保守；它是说，尽管自原始 gTLD 被挑选以来互联网发生了演变（尽管存在 .mil 的缺陷），但没有什么需要改变的。这就留下了允许人们愿意支付多少 gTLD 的选择，这就是当前的情况。因此，一方面我真的不喜欢 gTLD 的爆炸式增长及其带来的各种后果，但另一方面，我不确定是否有更好的实用选择。您可以修改边缘，例如说所有 gTLD 都必须有一个公共目的，而不是仅限于一家公司（所以没有 .google 或 .microsoft），但我认为这不会是一个大的变化。而且我不确定那些公司域名是最糟糕的通用顶级域名(gTLD) 烦恼。", "note_en": "Over on Twitter  I said something relatedto new TLDs. I have some views on what I said that are for anotherentry, but for now I want to sort out some views on new TLDs ingeneral.\n New top level DNS domains come in two flavours; there are countryTLDs (and country-like ones) and what are officially called  genericTLDs,things like &#34;.online&#34; and so on. Adding new country TLDs is obviouslyrequired and is sensible, and I feel this is also the case for newTLDs for country-like entities that aren&#39;t strictly countries, suchas the European Union (which is not in  ISO 3166-1, although &#39;EU&#39; is reservedfor identifying it and it has .eu as a TLD). I think this is mostpeople&#39;s view on country TLDs, since it&#39;s hard to argue that newcountries should be frozen out of having their own TLD when existing,older ones get TLDs.\n (I&#39;m neutral on the use of country TLDs to create attractive lookingURLs, for example various domains using .ly and .io.)\n What I have mixed feelings about are all of the generic, non-countryTLDs (gTLDs), which are sometimes called  vanity TLDs.  There area lot of these gTLDs ( also) and  somenumber of them wind up getting shut down after a while, among otherissues. People can also criticize a number of gTLDs for being eitherunnecessary or not having a good general use, and some of them haveclashed with common unofficial internal use (for example, .dev, which also forces HTTPS for all websites in it). All of this makes it soundlike there should be either no new gTLDs at all or at least a lotfewer of them.\n However, the choices for how many new gTLDs to have are none, some,or as many as people want. If the choice is &#34;some&#34;,  IANA isput in the position of deciding which gTLDs and which gTLD purposesare worthy enough to be approved, and which aren&#39;t. I doubt there&#39;sany broad agreement on what the criteria for this should be, whichmeans that IANA would basically be making arbitrary decisions (eitherfor gTLDs or for the gTLD criteria). The choice of &#34;none&#34; feelsunsatisfactory and excessively conservative; it&#39;s saying that despitethe Internet&#39;s evolution since the original gTLDs were picked (anddespite the wart of .mil), nothing needs to change. That leaves thechoice of allowing as many gTLDs as people want to pay for, whichis the current situation.\n So on the one hand I don&#39;t really like the explosion of gTLDs and thevarious consequences of that, but on the other hand I&#39;m not sure Isee a better practical choice. You could tinker around the edges, forexample by saying that all gTLDs have to have a public purpose and notbe restricted to a single company (so no .google or .microsoft), butI don&#39;t think that would be a big change. And I&#39;m not sure that thosecompany domains are the worst gTLD annoyances.", "posttime": "2021-08-07 21:47:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "顶级,views,gtld", "title": "对新 DNS 顶级域 (TLD) 的不同看法", "title_en": "Mixed views on new DNS top level domains (TLDs)", "transed": 1, "url": "https://utcc.utoronto.ca/~cks/space/blog/tech/NewTLDsMyMixedViews", "via": "", "real_tags": ["顶级", "views", "gtld"]}, {"category": "", "categoryclass": "", "imagename": "fb8b1a5973804f09351359fdb128d55b.png", "infoid": 1071963, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的 16 个月里，我们许多人的生活中都缺少工作场所喧嚣的声音。随着我们工作方式的不断变化，其中一些声音很快就会成为遥远的记忆。邓迪启动了一个新项目，邀请人们将办公室、工厂、实验室或商店的噪音发送到档案中，以便为子孙后代保存这些令人回味的声音。 Song Work 已经收集了大约 50 种工作场所的声音，包括邓迪当代艺术的印刷机和该市米其林轮胎工厂的噪音，该工厂于 2020 年关闭。该网站由邓迪艺术家 Siôn Parkinson 与苏格兰国家图书馆合作创建听起来。他说：“我父亲来帮助建立米其林轮胎工厂后，我出生在邓迪。”我们有幸在 2018 年录制了它，当时我们不知道工厂很快就会因为失去850 个工作岗位。\n“所有这些都突然消失了，所以我们真的很幸运能够保存它并将其交给图书馆。”档案中的另一个声音是在 Siôn 去年被诊断出患有癫痫后收集的。他说：“这个过程的一部分是进行核磁共振扫描，进入那台机器的声音非常棒。”与在纳尼韦尔医院工作的团队交谈时，他们意识到这台机器的声音也很快就会过时因为它们被更先进的技术所取代。”他说，虽然 MRI 声音本身“几乎听不到”，但它们可以用作音乐曲目或电影配乐的一部分。他说：“我被这些类型的声音环境以及我们如何使用它们来制作音乐所吸引。 “我们建立该网站的原因之一是，艺术家和音乐家可以使用它免费下载他们可能能够使用的声音。”\n这是一首工作之歌，人类不在工作，由艺术家和音乐家汤米·佩尔曼 (Tommy Perman) 使用米其林现场录音中的声音创作。 Siôn 说：“他正在聆听工厂氛围所在的关键，以及一些机器的节奏。“它对关闭的工厂产生共鸣，也对我们现在所处的位置产生共鸣，有很多人在家工作，以及我们未来工作方式的整体变化。” Siôn 说，他希望人们用手机记录周围的声音，并将它们提交到 Song Work 网站。”通过将这些声音赠送给苏格兰国家图书馆声音档案库，该项目具有传统元素。 “他们将能够使用它们，以便将来我们能够记住我们日常生活中的一些声音。”", "note_en": "The sound of workplace hustle and bustle is something that&#39;s been missing from many of our lives over the past 16 months.\n And with the way we work changing all the time, some of these sounds could soon become a distant memory.\n A new project has been launched in Dundee, inviting people to send in the noise of their offices, factories, labs or shops for an archive that will preserve these evocative sounds for future generations.\n Song Work has already collected about 50 workplace sounds, including a  printing press at Dundee Contemporary Arts and  noises from the city&#39;s Michelin tyre factory, which  closed in 2020.\n  The site has been created by Dundee artist Siôn Parkinson, working with the  National Library of Scotland Sounds.\n  He said: &#34;I was born in Dundee after my father came to help set up the Michelin tyre factory.\n &#34;We were lucky enough to record it in 2018, and we didn&#39;t know then that the factory would soon close with the loss of 850 jobs.\n  &#34;All of that is kind of suddenly lost, so we&#39;re really lucky to be able to have preserved that and to give it to the library.&#34;\n  Another sound in the archive was collected after Siôn was diagnosed with epilepsy last year.\n He said: &#34;Part of that process was to have an MRI scan, and the sound of being in that machine was extraordinary.\n &#34;Speaking with the team that work at Ninewells Hospital, they recognise that the sounds of this machine will also soon become obsolete as they&#39;re replaced with more up-to-date technology.&#34;\n He said that while the MRI sounds are &#34;almost unlistenable&#34; on their own, they could be used as part of a music track or film score.\n He said: &#34;I&#39;m drawn to these kinds of sound environments and how we might be able to use them to make music.\n &#34;One of the reasons that we set up the website was so that artists and musicians could use it to download sounds for free which they might be able to use.&#34;\n   This Is a Work Song, Humans Aren&#39;t Working was created by artist and musician  Tommy Perman using sounds from the Michelin field recording.\n Siôn said: &#34;He was listening to the key in which the the ambience of the factory was in, and the rhythm of some of the machines.\n &#34;It has a resonance for a closed-down factory, but also for where we are right now, with lots of people working from home, and the whole changing face of how we will work in the future.&#34;\n  Siôn said he wanted people to use their phones to record the sounds around them and to submit them to the Song Work website.\n  &#34;There&#39;s a heritage element to the project by gifting these sounds to the National Library of Scotland Sounds archive.\n &#34;They will be able to use them, so that in future we&#39;ll be able to remember some of the sounds that were part of our everyday lives.&#34;", "posttime": "2021-08-07 21:47:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "disappearing,声音", "title": "捕捉工作场所消失的声音", "title_en": "Capturing the Disappearing Sounds of the Workplace", "transed": 1, "url": "https://www.bbc.co.uk/news/uk-scotland-tayside-central-58056235", "via": "", "real_tags": ["声音"]}, {"category": "", "categoryclass": "", "imagename": "395887299d0fefe0b1e6e3e975387c77.jpeg", "infoid": 1071961, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "听着，绵羊：COVID-19 不存在。病毒不会引起疾病，也不会传染。那些说别的医生和健康专家不知道他们在说什么；真正的专家在 Facebook 上。他们大声而明确地说：大流行是由你自己糟糕的生活选择引起的，比如吃肉或意大利面。您可能遇到的任何“COVID”症状实际上都是暴露于有毒生活方式的结果——您只能怪自己。与上述所有内容一样完全愚蠢和可恶，这并没有夸大互联网上越来越多的达尔文奖决赛入围者（即细菌理论否认者）传播的信息。是的，你没看错：细菌理论否认者——也被称为不相信致病病毒和细菌会导致疾病的人。作为他们拒绝几个世纪以来收集的基本科学和临床数据的延伸，他们否认存在破坏性的流行病，这种流行病已经使全世界超过 2 亿人患病，超过 400 万人死亡。细菌理论否认主义并不新鲜。它可以追溯到细菌理论本身的起源，通常是路易斯·巴斯德的同时代人克劳德·伯纳德和安托万·贝尚。两人都对巴斯德经久不衰的细菌理论提出了相反的假设。伯纳德提出了环境环境的概念，它表明身体的内部环境——或地形——保持其平衡。地形的状态，而不是病原体的存在，最终决定了疾病是否会发展（考虑到我们现在对微生物组和免疫功能低下的了解，这并不是一个完全疯狂的想法）。与此同时，被认为是巴斯德的顽固分子和竞争对手的贝尚认为，人体组织会产生致病细菌，作为对地形有害变化的反应。因此，细菌不会引起疾病；它们只是它的一种自我创造的症状——这显然是不正确的。科学界和医学界根据巴斯德的发现以及后来罗伯特·科赫 (Robert Koch) 的微生物发病机制的基本概念（科赫的假设）将这些想法抛在脑后。但似乎他们已经在边缘社区中忍受了，他们的解释和解释随着时间的推移而发生变化。随着毁灭性的全球大流行，否认主义者似乎正在复兴。一位拒绝细菌理论的人给我发了电子邮件，并指出了一个名为“地形模型驳斥细菌理论”的 Facebook 群组，在那里，一种特殊的细菌理论否认主义正在蓬勃发展。该群组的一位管理员在 4 月份指出，该群组的成员已达到 15,000 人，而 2020 年 4 月时只有 147 名成员。现在，仅仅几个月后，总数就达到了 18,400 人。虽然互联网上展示的人类愚蠢的深度可以与马里亚纳海沟相媲美，但这一群体所展示的大胆无知确实令人震惊。在该小组目前对细菌理论否认主义的看法中，细菌只是清道夫，是疾病的症状。病毒被认为是细胞碎片，不会引起疾病或从一个人传播到另一个人。\n根据小组成员的妄想，只有一种疾病存在：毒血症。这种疾病是由过着肮脏、不自然的生活方式导致的有毒暴露引起的，这会对您的地形造成损害。所有疾病症状都只是您的身体正在尝试“排毒”的标志。如果您的身体无法排毒，疾病会进展到七个级别，最后一个级别是癌症。您所经历的症状类型可以帮助确定您接触过的有毒物质的种类。如果你去除饮食或环境中的有毒成分，你就会康复——但如果你达到第七级，就很难恢复了。该小组指出，生病的人除了他们自己之外没有其他人可以为他们的疾病负责。 “将疾病归咎于病毒或细菌很容易避免，”该组织“指南”部分的一篇帖子写道。 “告诉客户他们造成了自己的痛苦并不是一件好事，因此医学界将痛苦归咎于一切，除了个人在生活游戏中的失败。”那么你如何避免接触有毒物质和生活中的失败呢？基本上，你只是吃了很多水果，把所有“不适合男人”的东西都去掉。这包括肉类、乳制品、鸡蛋、面包、意大利面、大豆、坚果和种子油、土豆、大蒜、洋葱、谷物、盐、发酵食品、咖啡、补充剂、酒精、烟草和任何其他令人陶醉的物质。哦，还有所有循证药物、医疗和疫苗——显然。如果你不相信该小组的想法，并指出医学专家说“病毒会让你生病”和“蛋白质是健康饮食所必需的”之类的话，那你就大错特错了。据该组织称，所有医生都只是被洗脑的傀儡，由一个以利润为导向的制药和医学研究团体控制，决心说服每个人他们需要购买灵丹妙药来保持健康。 “细菌理论只不过是疾病行业的巨大利润驱动因素，”拒绝细菌理论的诺拉·伦茨在该网站上的一段视频中说。当然，小组成员更了解，因为，您知道，他们在 Internet 上阅读了很多东西 — 很多！ “有些拥有 [原文如此] 硕士学位的人因这场大流行病而堕落，”一名小组成员发帖说。 “而且有些高中辍学生可以看穿媒体的所有欺骗。这就是为什么不能仅仅以受过大学教育来衡量是否聪明。”事实上，把我带到这个 Facebook 群组的否认者——罗伯特雅克林——这样做是为了指出我的无知。 “当我读到你对传染病感兴趣时，我忍不住与你联系，”雅克林写道，似乎是指我拥有细菌发病机制博士学位的事实。 “虽然我确信你相信这样的事情存在，因为你已经被灌输相信细菌理论，但它并不比地平说理论更能证明。我建议努力通过阅读来完全“事实化”关于地形模型。在 Facebook 群组“地形模型驳斥细菌理论”中有很多内容可以让您忙上几个月，甚至几年或更长时间。不要因为您相信的许多事情将被揭露为不真实而感到难过。” （要是我的博士导师知道这个 Facebook 群组就好了！）在随后的电子邮件交流中，雅克林将相信致病细菌与相信圣诞老人或复活节兔子相提并论。 “病毒导致任何事情的想法更加牵强，”他写道。\n至于对目前由传染性冠状病毒引起的大流行的解释，亚尔金说，这是由于“一群饮食和习惯相似的人[他们]可能摄入了相似数量的毒素，因此他们的身体可能在同一时间表现出类似的排毒症状。”至于采取公共卫生措施预防 SARS-CoV-2 传播，亚尔金只是说，“没有公共卫生专家建议戴口罩或接种疫苗。可能有人自称公共卫生专家，但实际上他们是对实际健康一无所知，接受了疾病和药物崇拜的培训和灌输。”当然，他吐槽的废话直接来自 Facebook 群组的页面。根据最近的活动，该组织的两名更活跃的管理员是 Lauren Whiteman（她于 2020 年 4 月接管该组织）和 Lauren Takacs。怀特曼与伦茨一起出现在视频中，并说她已经研究了五年的卫生理论。她声称她的自然饮食治愈了她所有的健康问题，并治愈了她养狗的失明、耳聋和癫痫症。这显然赋予了她提供医疗建议的权力，告诉小组中的人疫苗“极其危险，对健康有害”。在一次交流中，她声称一个被诊断为 COVID-19 的人由于生活方式选择不当而血氧水平低。 “缺氧的原因是错误的健康习惯，”她宣称。 “错误的食物进入，服用药物，不符合你的生理机能。”根据她公开的 Facebook 帖子，Takacs 于 2016 年高中毕业，没有健康或医学背景。然而，这并没有阻止她向一位小组成员推荐她不再需要医疗保险，仅仅因为她遵循地形模型生活方式。在另一篇文章中，Takacs 建议一位患有癌症的 3 岁孩子的母亲应该停止将她的儿子带到医院接受治疗，她称之为“中毒”。相反，她建议喂养幼儿水果和蔬菜作为治疗。 Ars 还联系了 Facebook，以了解该集团中的所有健康错误信息和虚假信息如何归入公司的审核政策。据说这家社交媒体巨头正在积极监控该网站、审查帖子并删除违规材料。从广义上讲，如果一个小组反复违反规则，Facebook 将永久删除它。 “我们对违反我们的 COVID-19 和疫苗政策的内容采取强有力的行动，”Facebook 发言人在一份声明中告诉 Ars。 “我们将继续监控我们平台上的错误信息，我们将继续对违反我们规则的任何账户或团体进行执法。”", "note_en": "Listen up, sheeple: COVID-19 doesn&#39;t exist. Viruses don&#39;t cause disease, and they aren&#39;t contagious. Those doctors and health experts who say otherwise don&#39;t know what they&#39;re talking about; the real experts are on Facebook. And they&#39;re saying it loud and clear: The pandemic is caused by your own deplorable life choices, like eating meat or pasta. Any &#34;COVID&#34; symptoms you might experience are actually the result of toxic lifestyle exposures—and you have only yourself to blame.\n As utterly idiotic and abhorrent as all of the above is, it&#39;s not an exaggeration of the messages being spread by a growing group of Darwin-award finalists on the Internet—that is, germ theory denialists. Yes, you read that correctly: Germ theory denialists—also known as people who don&#39;t believe that pathogenic viruses and bacteria can cause disease.\n As an extension of their rejection of basic scientific and clinical data collected over centuries, they deny the existence of the devastating pandemic that has sickened upwards of 200 million people worldwide, killing more than 4 million.\n Germ theory denialism isn&#39;t new. It can be traced back to the origin of germ theory itself, often to the contemporaries of Louis Pasteur named Claude Bernard and Antoine Béchamp. Both came up with opposing hypotheses to Pasteur&#39;s enduring germ theory. Bernard proposed the concept of  milieu intérieur, which suggests that the body&#39;s internal environment—or  terrain—maintains its equilibrium. The state of the terrain, rather than the presence of pathogens, ultimately dictates whether disease will develop (which is not an entirely crazy idea, given what we now know about the microbiome and the immunocompromised). Meanwhile, Béchamp—considered a bitter crank and rival of Pasteur—suggested that pathogenic bacteria are produced by human tissue as a response to a harmful change in the terrain. Thus, bacteria do not  cause disease; they are merely a self-created symptom of it—which is clearly just incorrect.\n The scientific and medical communities left these ideas behind in light of Pasteur&#39;s findings and, later, Robert Koch&#39;s foundational concepts for microbial pathogenesis, Koch&#39;s postulates. But it seems they have endured in a fringe community, with their interpretations and explanations shifting and morphing over time. And with the devastating global pandemic, the denialists seem to be having something of a renaissance.\n A germ theory denialist emailed me and pointed to a Facebook group called &#34; Terrain Model Refutes Germ Theory,&#34; where a particular strain of germ theory denialism is thriving. An administrator for the group noted in April that the group had reached 15,000 members, up from just 147 members in April of 2020. Now, just a few months later, the tally is up to 18,400.\n  While the depths of human stupidity on display across the Internet rival that of the Marianas Trench, the audacious ignorance on display in this group is truly stunning. In the group&#39;s current take on germ theory denialism, bacteria are merely scavengers and are a symptom of disease. Viruses are considered cellular debris and cannot cause disease or transmit from one person to another.\n    According to the group members&#39; delusions, there is only one disease in existence: toxemia. This disease is caused by toxic exposures that occur by leading a dirty, unnatural lifestyle, which causes damage to your terrain. All disease symptoms are merely a sign that your body is trying to &#34;detox.&#34; If your body isn&#39;t able to detox, the disease will progress through seven levels, the last one being cancer. The type of symptom you&#39;re experiencing can help identify the kind of toxic exposure you&#39;ve had. If you remove the toxic component of your diet or environment, you&#39;ll recover—though if you reach the seventh level, it can be hard to come back from.\n    The group notes that a sick person has no one but themselves to blame for their illness. &#34;Blaming disease on viruses or bacteria is an easy cop out,&#34; one post in the group&#39;s &#34;guide&#34; section reads. &#34;It&#39;s not good business to tell a client that they have caused their own miseries, so the medical profession has blamed suffering on everything but the individual&#39;s own failure in the game of living.&#34;\n So how do you avoid toxic exposures and failing at life? Basically, you just eat a lot of fruit and cut out all things &#34;not fit for man.&#34; That includes meat, dairy, eggs, breads, pasta, soy, nut and seed oils, potatoes, garlic, onions, cereals, salt, fermented foods, coffee, supplements, alcohol, tobacco, and any other intoxicating substances. Oh, and all evidence-based drugs, medical treatments, and vaccines—obviously.\n If you are not convinced by the group&#39;s ideas and point to medical experts who say wild things like &#34; viruses can make you sick&#34; and &#34; protein is necessary for a healthy diet,&#34; you are embarrassingly mistaken. According to the group, all doctors are simply brainwashed puppets, controlled by a profit-driven pharmaceutical and medical research community determined to convince everyone that they need to buy magic pills to stay healthy. &#34;The germ theory is nothing but a massive profit driver for the disease industry,&#34; germ theory denialist Nora Lenz said in  a video hosted on the site. The group members know better, of course, because, you know, they&#39;ve read a lot of stuff on the Internet—like  a lot!\n  &#34;There are people with masters [sic] degrees that fell for this pandemic charade,&#34; one group member posted. &#34;And there are high school dropouts that can see through all the deception of the media. That&#39;s why being smart isn&#39;t measured solely on being educated by colleges.&#34;\n Indeed, the denialist who led me to this Facebook group—Robert Yaklin—did so to point out my ignorance. &#34;I couldn&#39;t resist contacting you when I read that you are interested in infectious diseases,&#34; Yaklin wrote, seemingly referencing the fact that I have a doctorate in bacterial pathogenesis. &#34;While I&#39;m sure you believe that such a thing exists because you have been indoctrinated to believe in germ theory, it is no more proven than the theory of a flat earth. I suggest working toward getting fully &#34;facts-inated&#34; by reading about Terrain Model. There is plenty to keep you busy reading at the Facebook group &#34;Terrain Model Refutes Germ Theory&#34; for months if not years or longer. Don&#39;t feel bad just because so many things you have believed will be revealed untrue.&#34; (If only my PhD advisor had known about this Facebook group!)\n      In subsequent email exchanges, Yaklin compared believing in disease-causing bacteria to believing in Santa Claus or the Easter bunny. &#34;The idea of viruses causing anything is even more far-fetched,&#34; he wrote.\n As for an explanation of the current pandemic caused by a contagious coronavirus, Yalkin said it is due to &#34;a group of people with similar diet and habits [who] are likely to be taking on a similar amount of toxins, and therefore their bodies are likely to exhibit similar detox symptoms around the same time.&#34;\n And as for following public health measures to prevent SARS-CoV-2 transmission, Yalkin simply said, &#34;There are no public health experts recommending wearing a mask or getting vaccinated. There may be people who call themselves public health experts, but they are virtually clueless about actual health, having received training and indoctrination in the cult of disease and drugs.&#34;\n The nonsense he spewed was straight from the pages of the Facebook group, of course. Based on recent activity, two of the more active administrators for the group are Lauren Whiteman, who said she took over the group in April of 2020, and Lauren Takacs.\n  Whiteman appeared in the video with Lenz and said she had studied hygiene theory for five years. She claimed that her natural diet cured all of her health issues and cured blindness, deafness, and seizures in the dogs she fosters. This has apparently given her authority to provide medical advice, telling people in the group that vaccines are &#34; extremely dangerous and harmful to health.&#34; In one exchange, she claimed that a person diagnosed with COVID-19 had low blood oxygen levels because of poor lifestyle choices. &#34;The cause of oxygen deficiency is wrong health habits,&#34; she declared. &#34;Wrong foods going in, taking drugs, not living in alignment with your physiology.&#34;\n  According to her public Facebook posts, Takacs graduated from high school in 2016 and has no health or medical background. However, that didn&#39;t stop her from recommending to one group member that she  no longer needed health insurance, simply because she was following the terrain model lifestyle. In another post, Takacs suggests that a mother of a 3-year-old with cancer should stop bringing her son to the hospital for treatments, which she called &#34; poisonings.&#34; Instead, she recommended feeding the toddler fruits and vegetables as treatment.\n  Ars also reached out to Facebook to understand how all of the health misinformation and falsehoods in the group fall in the company&#39;s moderation policies. The social media giant is said to be actively monitoring the site, reviewing posts, and removing violating material. Broadly, if a group repeatedly breaks rules, Facebook will permanently remove it.\n &#34;We take strong action against content that violates our COVID-19 and vaccine policies,&#34; a Facebook spokesperson told Ars in a statement. &#34;We continue to monitor for misinformation on our platforms and we will continue to enforce against any account or group that violates our rules.”", "posttime": "2021-08-07 21:00:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "拒绝,dive,细菌", "title": "深入了解愚蠢：认识不断增长的拒绝细菌理论的群体", "title_en": "Deep dive into stupid: Meet the growing group that rejects germ theory", "transed": 1, "url": "https://arstechnica.com/science/2021/08/deep-dive-into-stupid-meet-the-growing-group-that-rejects-germ-theory/", "via": "", "real_tags": ["拒绝", "dive", "细菌"]}, {"category": "", "categoryclass": "", "imagename": "7c39a659f800842f8da3c522a7e784d3.jpg", "infoid": 1071959, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前当我回顾奥迪 Q7 SUV 时，我说它感觉就像达斯维达的员工车。这使得这款奥迪 SQ5 Sportback 成为 Kylo Ren 的有力竞争者——更年轻、更运动，并希望发表声明。这两辆车也有相同的弱点。与其说是对动力的渴求，不如说是对动力的渴求，而这种渴求只会让您意识到使用电动动力总成系统会更好。奥迪将 Sportback 处理应用于 Q5 SUV 已成定局。该公司很清楚，它的一些客户将牺牲最后一盎司的实用性来支持倾斜的快背。在这种情况下，将斧头带到掀背车 SQ5 上会增加 4,200 美元的溢价； SQ5 Sportback 起价为 56,100 美元。这笔钱可以买一辆好看的SUV。宝马可以说是在 2008 年用最初的 X6 开启了快背 SUV 的趋势，并且这种趋势已经站稳脚跟，即使是保时捷也会向你收取更多费用，以获得卡宴上稍微不那么宽敞但更优雅的后端。在这种情况下，我认为 Marc Lichte 的奥迪团队已经付出了最大的努力之一。 SQ5 并不是一款大型 SUV，剖切式快背在视觉上进一步缩小了汽车。在众多常规形状的 SUV 和跨界车中，SQ5 Sportback 以帅气脱颖而出。您会注意到六边形排气管周围不见了，取而代之的是四根镀铬的椭圆形管道。您还可以看到关闭每条管道的阀门。当排气处于运动模式时，这辆车听起来很吵（以一种令人愉快的方式而不是特别响亮的方式），这会打开所有阀门。声音是从机舱内部人为增强的，这对某些人来说是一个症结，但只要结果在内部听起来不错并且不会让旁观者讨厌，我就可以使用扬声器来消除不需要的谐波。奥迪已经接受了 LED 灯组现在为汽车设计师提供的自由，使用它们为汽车注入一些额外的特色。当产品简介中描述该功能时，我认为解锁汽车时大灯循环的顺序有点噱头，但我必须承认它非常可爱。在欧洲，大灯还采用了巧妙的矩阵光束技术，这意味着您可以打开远光灯而不会对迎面而来的车辆造成眩目。可悲的是，隐蔽的联邦机动车辆安全标准没有考虑到美国的这种聪明。 SQ5 Sportback 的内饰有助于证明其价格合理，并且在（8,600 美元）Prestige 装饰中看起来很华丽。奥迪在这方面仍处于行业领先地位，内饰接触点的材料选择非常完美。带穿孔皮革的运动型方向盘厚度恰到好处，滑动式无线手机充电板和加热/冷却杯架是不错的选择。 SQ5 Sportback 的驾驶性能也很好。它比保时捷 Macan 更放松，但比普通的 Q5 更注重脚趾。在机械方面，它与我们在 2017 年评测过的（不是 Sportback）SQ5 不同。它仍然使用涡轮增压 3.0 L V6 发动机，可产生 349 马力（260 千瓦）和 369 磅-英尺（500 牛米）的功率，足以满足 4.7-第二个 0-60 英里/小时的时间。\n但是，如果您想使用 SQ5 Sportback 的任何性能，则需要支付燃油费用。这辆车的官方 EPA 评级是 20 英里/加仑（11.8 升/100 公里），这已经不是很好了。但在这座城市，这个数字可能会下降到 10 岁以下，这在 2021 年让人感到不可接受。值得庆幸的是，地平线上出现了曙光——明年，奥迪将电动 Q4 e-tron Sportback 带到美国，承诺将相同的外观风格和出色的内饰相结合，同时减少排放。", "note_en": "When I reviewed the Audi Q7 SUV a few years ago, I said  it felt like Darth Vader&#39;s staff car. That makes this Audi SQ5 Sportback a pretty good contender to be Kylo Ren&#39;s ride—younger, more athletic, and looking to make a statement. The two cars share the same weakness, too. Not so much a thirst for power as just a thirst, and one that just makes you realize how much better the car would be with an electric powertrain instead.\n That Audi would apply the Sportback treatment to the  Q5 SUV was a foregone conclusion; the company knows well that some of its customers will trade that final ounce of practicality in favor of a sloping fastback. In this case, taking a hatchet to the hatchback SQ5 adds a $4,200 premium; the SQ5 Sportback starts at $56,100.\n That money buys a good-looking SUV. BMW arguably started the trend of fastback SUVs with the original X6 in 2008, and the trend has taken hold to the point where even Porsche will charge you more for a slightly less capacious but  more elegant rear end on a Cayenne. In this case, I think Marc Lichte&#39;s team at Audi has put in one of their best efforts yet. The SQ5 is not a big SUV to begin with, and the cutaway fastback visually shrinks the car even more. Against a sea of regular-shape SUVs and crossovers, the SQ5 Sportback stands out as handsome.\n You&#39;ll notice that the hexagon exhaust surrounds are gone, replaced by four oval pipes accented in chrome. You can also see the valves that close each pipe. It&#39;s a car that sounds burbly (in a pleasant and not particularly loud way) when the exhaust is in sport mode, which opens all the valves. The sound is artificially enhanced from inside the cabin, which is a sticking point for some, but as long as the result sounds good inside and it&#39;s not obnoxious to bystanders, I&#39;m fine with using speakers to cancel out unwanted harmonics.\n  Audi has embraced the freedom that LED light clusters now offer car designers, using them to imbue the car with some added character. When the feature was described in the product briefing, I thought the sequence that the headlights cycle through when you unlock the car was a bit of a gimmick, but I must confess that it&#39;s quite endearing. In Europe, the headlights also have clever matrix beam technology that means you can leave your high beams on without blinding oncoming traffic. Sadly, the hidebound Federal Motor Vehicle Safety Standards make no allowances for such cleverness in the US.\n The interior of the SQ5 Sportback helps justify its price and looks magnificent in ($8,600) Prestige trim. Audi still leads the industry here, and the materials for the interior touchpoints are perfectly chosen. The sports steering wheel with perforated leather is just the right thickness, and the sliding wireless phone charging pad and heated/cooled cupholder are nice touches.\n The SQ5 Sportback also drives well; it&#39;s more relaxed than a  Porsche Macan but more on its toes than  a regular Q5. Mechanically, it differs from the (not Sportback) SQ5 that we reviewed in 2017. It still uses a turbocharged 3.0 L V6 that generates 349 hp (260 kW) and 369 lb-ft (500 Nm), which is sufficient for a 4.7-second 0-60 mph time.\n But if you want to use any of the SQ5 Sportback&#39;s performance, you&#39;ll pay for it in fuel. The car&#39;s official EPA rating is 20 mpg combined (11.8 L/100 km), which is already not great. But in the city, that number can dip into the low teens, which in 2021 feels unacceptable. Thankfully, there is light on the horizon—next year, Audi is bringing the electric Q4 e-tron Sportback to the US, promising to marry that same combination of exterior style and a great interior with a fraction of the emissions.", "posttime": "2021-08-07 20:07:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sq5,suv", "title": "2021 款奥迪 SQ5 Sportback：看起来很酷，但喝多了", "title_en": "The 2021 Audi SQ5 Sportback: Cool looks, but it drinks too much", "transed": 1, "url": "https://arstechnica.com/cars/2021/08/audi-adds-extra-style-to-its-swift-suv-the-2021-sq5-sportback/", "via": "", "real_tags": ["sq5", "suv"]}, {"category": "", "categoryclass": "", "imagename": "dd483d1fa3b6d3092ee6d66213d55fa3.jpg", "infoid": 1071958, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook 的 WhatsApp 即时消息应用程序负责人威尔·卡斯卡特 (Will Cathcart) 在 Twitter 帖子中呼吁苹果决定扫描 iPhone 中是否存在虐待儿童的图像。帖子中的一条推文写道：“我阅读了苹果昨天发布的信息，我很担心。我认为这是错误的做法，也是对全世界人们隐私的挫折。”苹果此前宣布了一项计划，将发布软件，该软件可以搜索和检测美国用户手机上的儿童性虐待材料 (CSAM)。然后，人工审核员可以提醒当局注意潜在的非法活动。 Cathcart 的帖子首先谴责儿童性虐待犯罪，他说：“儿童性虐待材料和贩卖这些材料的施虐者令人反感。”他补充说，WhatsApp 一直致力于简化报告和禁止使用 CSAM 的人的方式，而不会破坏其用户的加密和隐私。 Cathcart 还表示，Apple 软件将允许“扫描您手机上用户的所有私人照片——甚至是您未与任何人分享的照片”。一位苹果发言人否认了 Cathcart 对 Insider 的几项指控，称新的苹果软件只会检测 iCloud 中的儿童性虐待材料——用户可以随时禁用。他们还表示，CSAM 的图像哈希，即算法用于识别类似图像的数字标记，由国家失踪和受虐儿童中心独家提供。据 The Information 报道，Facebook 最近聘请了一组研究人员来研究无需解密数据即可分析数据的方法。该研究将允许 Facebook 为有针对性的广告收集用户数据，而无需阅读用户之间共享或与广告商共享的加密信息。\nApple 已将隐私作为其产品和服务的卖点。但苹果的声明引起了数据隐私专家的批评，他们担心拥有这种侵入性技术的长期影响，比如潜在的政府剥削。 Cathcart 提到了 2016 年苹果给消费者的一封信，该公司在信中说：“政府强迫我们在我们的产品中建立后门是错误的。最终，我们担心这种要求会破坏自由和我们的政府要保护的自由。”苹果发言人表示，苹果在全球范围内使用一种操作系统，这让特定政府或行为者无法针对特定地区或设备修改系统。", "note_en": "Will Cathcart, the head of Facebook&#39;s WhatsApp instant messaging app, called out Apple&#39;s decision to scan iPhones for child abuse images in a Twitter thread.\n One tweet in the thread read, &#34;I read the information Apple put out yesterday and I&#39;m concerned. I think this is the wrong approach and a setback for people&#39;s privacy all over the world.&#34;\n Apple previously announced a  plan to release software that could search and detect child sexual abuse material (CSAM) on the phones of US users. Human reviewers could then alert authorities of potential illegal activity.\n     Cathcart&#39;s thread began by denouncing child sexual abuse crime, saying, &#34;Child sexual abuse material and the abuser who traffic in it are repugnant.&#34; He added that WhatsApp has worked to streamline ways to report and ban those who traffic in CSAM without breaking the encryption and the privacy of its users.\n Cathcart also said the Apple software would allow access to &#34;scan all of a user&#39;s private photos on your phone - even photos you haven&#39;t shared with anyone.&#34;\n An Apple spokesperson denied several of Cathcart&#39;s claims to Insider, saying that the new Apple software would only detect child sex abuse materials in iCloud - which users can disable at any time. They also said that image hashes, digital markers that algorithms use to identify similar images, of CSAM were exclusively provided by the National center for Missing and Exploited Children.\n        Facebook recently hired a team of researchers to study ways to analyze data without decrypting it,  The Information reported. The research would allow Facebook to collect user data for targeted ads without reading encrypted information shared between users or sharing it with advertisers.\n Apple has made  privacy a selling point for its products and services. But Apple&#39;s announcement has drawn criticism from data privacy experts, who are concerned at the long-term implications of having such intrusive technology, like potential government exploitation.\n Cathcart pointed to a  2016 letter from Apple to its consumers, where the company says: &#34;it would be wrong for the government to force us to build a backdoor into our products. And ultimately, we fear that this demand would undermine the very freedoms and liberty our government is meant to protect.&#34;\n    The Apple spokesperson said Apple uses one operating system globally, which gives no way for specific governments or actors to modify the system for a specific region or device.", "posttime": "2021-08-07 20:07:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,苹果,iphone,apple,旗下", "title": "Facebook 旗下 WhatsApp 的负责人猛烈抨击苹果扫描 iPhone 中虐待儿童图片的计划，称这是“对全世界人们隐私的挫折”", "title_en": "The head of Facebook-owned WhatsApp slammed Apple's plan to scan iPhones for child abuse images as a 'setback for people's privacy all over the world'", "transed": 1, "url": "https://www.businessinsider.in/tech/news/the-head-of-facebook-owned-whatsapp-slammed-apples-plan-to-scan-iphones-for-child-abuse-images-as-a-setback-for-peoples-privacy-all-over-the-world/articleshow/85118030.cms", "via": "", "real_tags": ["facebook", "苹果", "iphone", "apple", "旗下"]}]