[{"category": "", "categoryclass": "", "imagename": "7c37c7bcb45e4590f2c2c17053a77c98.png", "infoid": 1069232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple 的 Pro Display XDR 已经上市有一段时间了，但目前还没有关于其高价显示器更新版本的传言。然而，9to5Mac 现在从熟悉此事的消息人士那里获悉，苹果正在内部测试一款带有专用 A13 芯片和神经引擎的新外部显示器。新显示器的开发代号为 J327，但目前尚不清楚有关技术规格的详细信息。据消息人士透露，这款显示器将配备苹果制造的 SoC，目前是 A13 仿生芯片——与 iPhone 11 系列中使用的芯片相同。与 A13 芯片一起，外部显示器具有神经引擎，可加速机器学习任务。尽管有传言称苹果一直在为普通用户开发更便宜的显示器，但带有专用 SoC 的新外部显示器将来很可能会成为替代当前 Pro Display XDR 的新型号。早在 2016 年，就在 Apple 的 Thunderbolt Display 停产之后，有传言称 Apple 正在研究更换高分辨率显示器和内置 GPU。虽然该公司确实在 2019 年推出了自己的高级外接显示器，但 Pro Display XDR 并没有像传言那样配备 GPU。今天来自 9to5Mac 的消息来源的报告表明，苹果并没有放弃其推出带有某种 SoC 的外部显示器的计划，至少在内部是这样。在外部显示器中内置 CPU/GPU 可以帮助 Mac 提供高分辨率图形，而无需使用计算机内部芯片的所有资源。 Apple 还可以将显示 SoC 的强大功能与 Mac 的 SoC 结合起来，为运行密集的图形任务提供更高的性能。请记住，Apple 的计划可能会发生变化，就像第一款 Pro Display XDR 从未拥有传闻中的所有功能一样。苹果对这款新外置显示器的发布计划也不得而知。您正在阅读 9to5Mac — 日复一日地发布有关 Apple 及其周边生态系统新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 9to5Mac 以了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作方法，并订阅我们的 YouTube 频道", "note_en": "Apple’s  Pro Display XDR has been available for quite some time now, but there are still no rumors about an updated version of its high-priced display in the near term. However,  9to5Mac has now learned from sources familiar with the matter that Apple is internally testing a new external display with a dedicated A13 chip and also Neural Engine.\n  The new display is being developed under the codename J327, but at this point, details about technical specifications are unclear. According to sources, this display will have an Apple-made SoC, which right now is the A13 Bionic chip — the same one used in the iPhone 11 lineup.\n Along with the A13 chip, the external display features the Neural Engine, which accelerates machine learning tasks. Although rumors suggest that Apple has been working on a  less expensive display for regular users, the new external display with a dedicated SoC will likely be a new model to replace the current Pro Display XDR in the future.\n Back in 2016, right after Apple’s Thunderbolt Display was discontinued,  rumors suggested that Apple was working on a replacement with a high-resolution display and a built-in GPU. While the company has indeed launched its own premium external display in 2019, Pro Display XDR does not come with a GPU as rumors predicted.\n Today’s report from  9to5Mac’s sources suggests that Apple has not given up on its plans to launch an external display with some sort of SoC, at least internally. Having a CPU/GPU built into the external display could help Macs deliver high-resolution graphics without using all the resources of the computer’s internal chip. Apple could also combine the power of the display SoC with the Mac’s SoC to provide even more performance for running intensive graphic tasks.\n Keep in mind that Apple’s plans may change, just as the first Pro Display XDR never had all the features it was rumored to have. Apple’s launch plans for this new external display are also unknown.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-07-24 00:38:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,soc,显示器", "title": "资料来源：Apple 正在测试一款带有 Apple 专用 SoC 的新外部显示器，该 SoC 包括神经引擎", "title_en": "Sources: Apple is testing a new external display with a dedicated Apple-made SoC that includes a Neural Engine", "transed": 1, "url": "https://9to5mac.com/2021/07/23/exclusive-apple-testing-new-external-display-with-a-dedicated-a13-chip-and-neural-engine/", "via": "", "real_tags": ["apple", "soc", "显示器"]}, {"category": "", "categoryclass": "", "imagename": "46dc0c7202ee7b5612417fbbef8ac18a.png", "infoid": 1069230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不时有刚毕业的黑客问我：“你对我的职业生涯有什么建议吗？”我发现自己一遍又一遍地重复着 3 条原则。经过反思，我意识到这些原则适用范围更广。我想他们可能会回答这个问题“你对我成年后的生活有什么建议吗？”我想我会在这里与你分享这些想法。我写的风格和例子都是面向职业的，但我认为核心思想仍然有助于你的决策。我希望你喜欢它们 ： ）。你该怎么办？是您刚开始时最难回答的问题之一。默认路径是遵循流行的或有声望的。这可能会导致一系列问题：有声望的东西已经非常具有竞争力。当你在一个既定规则的游戏中与聪明人竞争时，只是跟上节奏会占用你大部分时间。这几乎没有时间去探索你感兴趣的东西。当你不去探索你感兴趣的东西时，你就不会那么深入地理解事物，这给你留下了无差别的技能组合。这里的解决方案是跟随你的口味。人气和声望是滞后指标。你的品味，尤其是作为一个年轻、好奇的人，预示着未来会流行什么。无论如何，当您按照自己的喜好进行操作时，您会发现自己对正在解决的问题更感兴趣。当您对正在解决的问题感兴趣时，您会发现更深层次的真相，积累更深层次的专业知识，形成差异化的技能组合，并在此过程中获得更多乐趣。现在，您可能想知道：如果您甚至不知道自己对什么感兴趣怎么办？\n别担心。你只需要调整和加强你的品味。要做到这一点，只要做任何事情。一旦你做了任何事情，问问自己，你觉得这件事的哪一部分有趣？开始深入那里，突然之间，你会发现很多兴趣。别担心。完全没问题。只要跟着它。你会惊讶于事情会如何为你服务。只要你努力工作并且你在学习，这是一个很好的时间利用。您可能还想知道：如果您的兴趣是当今流行和有声望的，该怎么办？那太棒了。遵循这一点，而不是竞争，开始感受你在该领域真正感兴趣的东西，并深入研究。这些想法可能看起来以职业为导向，所以您可能想知道：如果我只想旅行和探索世界怎么办？那也太棒了！这是你的品味，告诉你你想旅行。跟随它，看看它会把你引向何方。\n当您发现自己的兴趣时，您可能会发现它们不一定受欢迎。然而，当你更深入地做自己的事情时，会发生一些神奇的事情……这将我们引向第二个原则：当你探索和追随你的品味时，你会发现一部分人与你的核心兴趣和价值观有共同之处。培养这些关系。其中一些人将成为您的终生朋友。这些人中的许多人将来会变得非常成功。您认识的人会向您展示什么是可能的，并与您一起深化、探索和创新您的共同兴趣。您可能想知道：如果您住在偏僻的地方，而且没有人找到您怎么办？尽最大努力去你所在社区的中心。对于黑客来说可能是科幻小说，对于艺人来说可能是洛杉矶，对于艺术家来说可能是巴黎，不胜枚举。你知道它适合你。现在，这对您来说可能听起来不切实际，但您会对自己的能力感到惊讶。在此期间，您可以从网上开始。这里的一个常见陷阱是只关注您所在领域的成功人士。这没有抓住重点。当然，接触那些成功的人，但请记住，你身边的年轻、好奇、感兴趣的人，将来会成为那些成功的人。你们有很多时间在一起度过，所以这是加深你们关系的好方法。我并不是说你不应该接触成功的人（你绝对应该），而是要完全取消“成功”作为选择与谁共度时光的标准。\n现在，您可能想知道，您如何加深这些关系？这引出了我们的第三个原则：当你组建你的社区时，新的想法和合作方式就会涌现。抓住这些机会：一起工作、互相支持和玩耍。随着时间的推移，你现在拥有很多，你会形成一个紧密的朋友部落。作为一个快乐的副作用，你会接触到新领域、新技术、有趣的问题和有趣的机会。开始使用它们，您就可以顺利踏上适合您的职业生涯。这里的一个常见问题是缺乏自信。这可能会导致你选择你认为“你有能力”的东西，而不是你感兴趣的东西。解决这个问题的一种方法是尝试：让自己梦想并与朋友一起工作，即使问题看起来非常困难。如果您对我感兴趣的内容感兴趣，我可以举很多例子：从我最喜欢的书到 Paul Graham 的论文，再到 Norvig 的 AI 编程范式，再到 Rich Hickey 的演讲。但是，相反，我鼓励您思考：您现在对​​什么感兴趣？如果你愿意，我很想知道你的答案：你现在对什么感兴趣？随时在评论中留下您的答案或直接给我发电子邮件，我很想知道 :) 有很多人影响和指导了我。这些想法和我一样。\n特别是关于品味的想法，保罗格雷厄姆必须大喊大叫。我对这个问题的很多想法都是从我开始时一遍又一遍地阅读他的文章中得到启发的。我强烈建议阅读它们。感谢 Daniel Woelfel、Talha Baig、Martin Raison、Irakli Safareli、David Magaltadze、Joe Averbukh、Julien Odent 对本文的审阅", "note_en": "From time to time newly graduated hackers ask me:  “Do you have any advice for beginning my career?”\n I’ve found myself repeating 3 principles over and over again. On reflection, I realized these principles apply more broadly. I  think they might answer the question  “Do you have any advice on for beginning my life as an adult?”\n I thought I’d share these ideas with you here. The style and the examples I wrote are career-oriented, but I think the core ideas will still help in your decision making. I hope you enjoy them : ).\n  What should you do? is one of the hardest questions to answer when you start out.\n The default path is to follow what’s popular or prestigious. That can lead to a bunch of problems: What’s prestigious is already highly competitive. When you compete with smart people in a game that has established rules, just keeping up will take most of your time. That leaves little time to explore what interests you. When you don’t explore what interests you, you won’t understand things as deeply, and that leaves you with an undifferentiated skillset.\n The solution here is to follow your taste. Popularity and prestige are lagging indicators. Your taste, especially as a young, curious person, is a signal for  what will be popular in the future. Regardless though, when you follow you taste, you’ll find yourself much more interested in the problems you’re solving. When you’re interested in the problems you’re solving, you’ll discover deeper truths, build deeper expertise, a differentiated skillset, and have more fun along the way.\n Now, you may be wondering:  What if you don’t even know what you’re interested in?\n Don’t worry. You just need to tune into and strengthen your taste. To do that, just do  anything. Once you do  anything, ask yourself, what part of that thing do you find interesting?\n Start going deeper there, and all of a sudden, you’ll discover a wealth of interests.\n  Don’t worry. It’s totally fine. Just follow it. You’ll be surprised how things will serve you down the road. As long as you’re working hard and you’re learning, it’s a good use of time.\n You may also wonder:  What if your interests  are what’s popular and prestigious today?\n That’s great. Follow that, but instead of competing, start sensing what actually interests you in that field and go deeper.\n The ideas may seem career oriented, so you may be wondering:  What if I just want to travel and explore the world?\n That’s great too! It’s your taste, telling you that you want to travel. Follow it and see where it leads you.\n As you discover your interests, you may find that they’re not necessarily popular. Yet, when you go deeper and do your thing, something magical will happen…which leads us into the second principle:\n  As you explore and follow your taste, you’ll discover a subset of people who share your core interests and values.\n Nurture those relationships. Some of these people will be your friends for life. Many of those people will become very successful in the future.\n The people you know will show you what’s possible and work alongside you in deepening, exploring, and innovating on your shared interests.\n You may be wondering:  what if you live in the middle of nowhere, and there aren’t people who get you? Do your best to go to the center of wherever your community is. That may be SF for hackers or Los Angeles for entertainers or Paris for artists, the list goes on. You know where it is for you.\n Now, this may sound impractical to you, but you’ll be surprised with what you can do. You can start off online in the meantime.\n One common pitfall here is  focusing only on successful people in your field. This misses the point. Sure, reach out to those successful people, but remember that the young, curious, interested people right next you,  will become those successful people in the future. You have tons of time to spend together, so it’s great way to deepen your relationships. I’m not saying that you shouldn’t reach out to successful people (you definitely should), but to remove “success” as a criteria altogether for choosing who you spend your time with.\n Now, you may be wondering,  how do you deepen those relationships? That leads to us to the third principle:\n  As you form your community, new ideas and ways to collaborate will spring up. Take those opportunities: work together, support each-other and play. Over time, which you have a lot of right now, you will form a tight tribe of friends.\n As a happy side effect, you’ll become exposed to new fields, new technologies, interesting problems, and interesting opportunities. Start taking them, and you’re well on your way to a career that’s  made for you.\n One common issue here is a lack of self belief. This may lead you into choosing what you think “you are capable of”, rather than what you’re interested in. One way to get around this is to just experiment: let yourself dream and work with your friends, even if the problems seem fantastically hard.\n  There are a lot of examples I can give you if you’re interested in what I’m interesting in: From  my favorite books to  Paul Graham’s essays to  Norvig’s Paradgims of AI programming, to  Rich Hickey talks. But, instead I encourage you to think:  what interests you right now?\n If you’re up for it, I’d love to know your answer:   what interests you right now? Feel free to leave your answer in the comments or to email me directly, I’d be curious to hear : )\n  There’s a slew of people who have influenced and mentored me. These ideas are just as much them as me.\n On the idea of taste specifically, the big shoutout has to go to Paul Graham. A lot of my thinking about this was inspired by reading his essays over and over when I started out. I highly suggest reading them.\n Thanks to Daniel Woelfel, Talha Baig, Martin Raison, Irakli Safareli, David Magaltadze, Joe Averbukh, Julien Odent, for reviewing this essay", "posttime": "2021-07-24 00:37:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建议,advice,可能", "title": "关于开始的建议", "title_en": "Advice on Starting Out", "transed": 1, "url": "https://stopa.io/post/230", "via": "", "real_tags": ["建议", "advice", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的歉意。设置您的用户 cookie 时出错。请设置您的浏览器以接受 cookie 以继续。 NEJM.org 使用 cookie 来提高性能，方法是在您浏览页面时记住您的会话 ID。这个 cookie 只存储一个会话 ID；没有捕获其他信息。接受 NEJM cookie 是使用网站所必需的。", "note_en": "Our apologies. An error occurred while setting your user cookie. Please set your browser to accept cookies to continue.\n NEJM.org uses cookies to improve performance by remembering your session ID when you navigate from page to page. This cookie stores just a session ID; no other information is captured. Accepting the NEJM cookie is necessary to use the website.", "posttime": "2021-07-24 00:37:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变体,effectiveness,cookie", "title": "Covid-19 疫苗对 B.1.617.2 (Delta) 变体的有效性", "title_en": "Effectiveness of Covid-19 Vaccines against the B.1.617.2 (Delta) Variant", "transed": 1, "url": "https://www.nejm.org/doi/full/10.1056/NEJMoa2108891", "via": "", "real_tags": ["变体", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "dd05b4e725327c43972d05ba5fa1379e.jpg", "infoid": 1069228, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Web 的第一个浏览器具有全彩色、读/写功能和多个窗口。第二个浏览器是一个纯文本的命令行工具。猜猜人们实际使用的是哪一种？在 Web 出现之前，Gopher 提供了一种连接到 Internet 和共享文档的方法。如果情况有所不同，它甚至可能成为我们今天用来浏览信息的方式。有没有想过人们是如何发现网络的。它存在的第一个传输是数字传输，一个 Usenet 帖子，引发了早期网络先驱的追随。没有超文本，就没有万维网。但它的名称和概念早于网络的诞生几十年。 Tim Berners-Lee 曾多次表示，美国的第一个网站是网络起飞的主要原因之一。但是它做了什么，为什么它如此重要？ 《王冠》第二季有这个场景（如果你看足够多的老电影，你会看到同样的类型[…]为什么是&lt;img&gt;标签而不是&lt;image&gt;标签？答案，原来如此，可以追溯到网络最早的浏览器之一和网络最早的讨论之一。\n信不信由你，搜索引擎之前曾有过一段时间。在网络上发现要困难得多。很容易迷路。也就是说，直到几个不同的人创建了一张地图。上次我回顾了 WWW Wizards Workshop 的重要性 [...] 在浏览器真正跨平台之前，曾经有一段时间每个操作系统都有自己选择的浏览器，并且它是为这些用户的需求。在 1995 年，很难相信您可以从网上冲浪中赢得 100 万美元。然后，AOL 使之成为可能。主页这个词在 90 年代中后期开始流行，但它的起源可以追溯到网络的开始。有每个人都听说过的浏览器。还有一些，无论出于何种原因，都消失了。这些是后者。感谢网络，在 1999 年（或左右），您可能会发现自己在家，盯着电脑屏幕的虚拟窗口，看着您最喜欢的网吧的真实窗口。\n网络分布访问、信息访问和相互访问。网络访问将我们带到斐济海岸附近的小岛，网络先驱在那里建立了一个独特的社区。这是有史以来第一个弹出式广告的创建者的消息：现在很明显，我们所做的是一个 [...] Geocities 很可能是您听说过的网站。它甚至可能是您使用过的网站。它的起源，以及它后来激发的运动，是一个关于自我表达和机缘巧合的令人难以置信的故事。", "note_en": "The web’s first browser featured full color, read/write capabilities, and multiple windows. The second browser was a text-only command line tool. Guess which one people actually used?\n    Before the web, Gopher offered a way to connect to the Internet and share documents. And if things had gone a little differently, it might even be what we use to surf information today.\n          Ever wondered how people found about the web. The first transmission of its existence was a digital one, a Usenet post that sparked a following of early web pioneers.\n      Without hypertext, there would be no World Wide Web. But its name and conception predate the web’s creation by decades.\n      Tim Berners-Lee has said, on multiple occasions, the the first website in the US was one of the major reasons the web took off. But what did it do and why was it so important?\n        There’s this scene in the second season of The Crown (if you watch enough old movies, you’ll see the same kind […]\n                Why is it the &lt;img&gt; tag instead of the &lt;image&gt; tag? The answer, it turns out, dates back to one of the web’s earliest browsers and one of the web’s earliest discussions.\n        Believe it or not, there was a time before search engines. Discovery on the web was far more difficult. It was easy to get lost. That is, until a few different people created a map.\n    I talked a bit about the importance of the WWW Wizards Workshop last time in my recap on the importance […]\n                      Before browsers were truly cross-platform, there was a time when each operating system had their browser of choice, and it was tailored to the needs of those users.\n    In 1995, it would be hard to believe that you could win a million dollars from surfing the web. Then, AOL made it possible.\n    The word homepage came into popular use in the mid to late 90’s, but it’s origin dates back to the web’s beginning.\n      There are the browsers that everyone’s heard of. And then there are some that, for whatever reason, faded away. These are the latter.\n        Thanks to the web, in 1999 (or thereabouts), you might find yourself at home, staring at the virtual window of your computer screen, looking out the very real windows of your favorite cyber café.\n      The web distributes access, access to information, and access to one another. Access on the web is what brings us to small island off the coast of Fiji, where web pioneers forged a unique community.\n    Here’s a message from the creator of the first-ever pop-up ad: It’s obvious now that what we did was a […]\n                Geocities is likely a site you’ve heard of. It may even have been a site that you used. It’s origin, and the movement it later inspired, is an incredible story of self-expression and serendipity.", "posttime": "2021-07-24 00:32:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,web", "title": "1989 年至 1994 年的网络", "title_en": "The Web from 1989 to 1994", "transed": 1, "url": "https://thehistoryoftheweb.com/timeline/?date_from=1989&date_to=1994", "via": "", "real_tags": ["网络", "web"]}, {"category": "", "categoryclass": "", "imagename": "f1e0662b45a26677f2ea9515987dee38.png", "infoid": 1069226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年我终于决定学习一些 Rust。 Steve Klabnik 和 Carol Nichols 的官方书籍非常出色，但即使在阅读了它并做了一些小代码练习之后，我还是觉得我需要更多来真正理解这门语言。我想从事一个小项目以获得一些实践经验，但我的大部分想法都不太适合 Rust。然后我开始阅读 Bob Nystrom 所著的《Crafting Interpreters》。顾名思义，这本书是关于为一种名为 Lox 的动态语言编写一个解释器。本书分为两部分：第一部分展示了如何使用 Java 实现一个简单的树遍历解释器。第二部分展示了如何实现相同的解释器，但这次使用的是使用 C 的高性能字节码 VM。我在 Clojure 中实现了第一部分，然后我意识到第二部分是尝试 Rust 的完美项目。语言 VM 领域似乎几乎完全由 C/C++ 主导。 VM 对性能非常敏感，通常需要大量的微优化。这个项目似乎是将 Rust 与这些语言进行比较的完美练习。我特别感兴趣的是检查 Rust 是否可以匹配相同的速度，同时提供更好的安全性和人体工程学。免责声明：自从我使用 C/C++ 已经很长时间了，可能超过 15 年了。即便如此，我主要将这些语言用于大学项目或一些开源贡献。在我的整个职业生涯中，我只使用过高级语言。将此帖子视为来自初学者。现在，匹配 Lox 解释器 (clox) 的 C 版本的速度并非易事。虽然许多关于编译器和解释器主题的书籍都专注于解释算法并将性能作为事后的想法，Crafting Interpreters 展示了如何实现一个真正快速的解释器。例如，在一些简单的基准测试中，通常会观察到 clox 比等效的 Python 或 Perl 代码快 2 倍甚至 3 倍。旁注：将此与一粒盐进行比较。 Python 和 Perl 速度较慢的原因是这些语言提供了更大的灵活性，并且会带来性能成本。这在 Wren 的网页 中有更好的解释，这是同一作者的另一种语言，其解释器启发了 clox。所以是的，与 Python 和 Perl 的比较有点橘子和苹果，但这里的要点是，clox 性能非常好并且非常适合生产。当我开始编写 Lox 的 Rust 实现时，我决定坚持使用纯粹安全的代码。 Rust 的主要卖点是它的安全性，但当然你必须坚持语言的安全部分。 Rust 还允许你使用不安全的代码，如果你这样做，我认为没有阻止程序来匹配 C 的速度，尽管这也意味着匹配它的不安全性。从一开始就坚持使用安全代码是有意义的。\n我还决定尽可能多地利用 Rust 标准库。关于 Crafting Interpreters 的一个更有趣的事实是它从头开始做所有事情。除了 C 编译器和标准库（非常简单）之外，本书不使用库或解析器生成器或任何工具。每一行代码都在书中，我觉得这绝对是惊人的。所以有一些章节专门展示如何编写动态数组、字符串和哈希映射。鉴于 Rust 的标准库已经有这些并且它们非常优化，我决定使用它们并跳过自定义实现。此外，手动实现这些很可能需要编写不安全的代码。我还想尽可能多地利用 Rust 的高级类型系统。 clox 实现使用可变长度操作码，其中大多数使用一个字节，但有些使用相邻字节来打包参数或数据。在我的实现中，我决定使用枚举来使用固定长度的操作码。 Rust 的 sum 类型使用起来很愉快，因为编译器总是支持你，并在你忘记检查特定情况时警告你。我认为这是人体工程学的巨大进步。开始用 Rust 编写 lox 解释器是轻而易举的。尤其是编译器编写起来很有趣。 Rust 感觉比旧的和古怪的 C 好得多。由于 sum 类型、编译时检查和现成的标准库，VM 的初始部分也非常好写。然而，一旦我研究更高级的东西，比如闭包和类，事情就开始变得非常棘手。 clox 实现非常自由地使用指针和别名，而 Rust 的别名规则非常严格，借用检查器不允许使用许多模式以确保安全。正因为如此，我花了大量时间寻找使借用检查器满意的解决方法。旁注：处理借用检查器是 Rust 初学者众所周知的斗争。这就是我在这里花了这么多时间的原因。规则很简单，但出于某种原因，很难在一个大系统中跟踪它们。我经常会写大量的重构，认为它们将是借用检查器错误的解决方案，只是为了在重构结束时获得另一个。随着我对语言的体验越多，这种情况发生的频率就越低，但它仍然发生。 Learn Rust With Entirely Too Many Linked Lists 这本书提供了一些很好的例子，说明借用检查器是多么复杂。到目前为止，在我的 Lox 安全 Rust 实现中，最难实现的部分是垃圾收集器。你如何在没有手动内存分配和释放的情况下编写 GC？我花了相当多的时间来试验和尝试不同的方法。我突然想到的一个想法是，也许我可以完全跳过 GC。如果 Rust 在没有 GC 的情况下是内存安全的，也许我可以使用相同的机制为 Lox 做同样的事情。例如，使用引用计数智能指针。但我很快就放弃了这个想法。 Lox 语言没有 Rust 的严格规则；很容易创建循环数据结构，如果使用引用计数来实现会泄漏内存。 GC 在这里是必须的。所以我从 Catherine West 在 RustConf 2018 上的一次非常有趣的演讲中得到了一个想法。在 Rust 世界中处理带有循环的类图结构的一个常见解决方法是使用向量索引作为某种指针。我决定研究一些流行的 crate 的代码，比如以某种方式使用这个概念的 id-arena 和 typed-arena。但是 id-arena 的主要问题是它不支持删除单个对象，因为存在遇到 ABA 问题的风险。当您删除一个对象并随后在某处存在实时引用时重用其插槽时会发生这种情况，然后该引用将指向向量中的错误位置。有办法解决这个问题，比如使用代际竞技场，但这感觉过于复杂。\n有一天，我意识到一件现在感觉如此明显的事情，以至于我几乎羞于承认：我正在编写一个垃圾收集器，它的主要工作是从程序的活动部分中找到没有引用的对象。这意味着，如果我的 GC 工作正常，我根本不应该担心 ABA 问题，因为 GC 将确保不会有被释放对象的活动引用。考虑到这个想法，我最终为安全 Rust 中的 GC 设计了一个非常简单的设计。它基本上是一个特征对象的向量。每个对象都应该实现一个特性（GcTrace），它具有跟踪对象的方法。此外，还有第二个向量包含墓碑以跟踪已删除的对象。对象的分配意味着将其添加到向量并返回将充当某种指针的索引。释放一个对象意味着将它从向量中交换出来并放置一些占位符，并将索引添加到将在未来分配中重用的墓碑列表中。我没有返回普通整数，而是创建了一个通用包装结构来获得某种类型安全性，这样如果我分配不同类型的对象，结果索引也是不同类型的。这与 id-arena crate 所做的非常相似。这个结果索引是 Copy，这意味着我可以随意传递它，而不会被借用检查器打扰。这也极大地促进了解释器的设计，因为我能够摆脱为取悦借用检查器而添加的许多变通方法，例如使用 RefCell 和 Rc。最后，使用 GC 看起来像这样：然后我可以在任何地方复制和传递这个闭包引用，但是当我真正需要对对象做一些事情时，我可以从垃圾收集器中借用它。例如：这种取消参考的舞蹈有点不符合人体工程学。每次我想使用任何 GC 对象时，我都必须调用 gc.deref()。我想也许我可以实现 Deref 并让 Rust 编译器自动为我做这件事，但这需要每个 GcRef 对象持有对 GC 的引用，并且处理生命周期将是一场噩梦。我也可以让 GC 完全静态，但我什至不知道如何仅使用安全的 Rust 来做到这一点，所以我决定忍受它。这种 GC 设计非常简单，但它有很多缺点。其中之一是特征对象和墓碑的向量所需的内存永远不会减少。因此，如果程序突然分配了大量对象，然后这些对象被 GC 释放，则插槽所需的空间将永远保留在那里。另一个缺点与何时运行收集过程有关。 clox 中的 GC 对每次分配都有精确的控制，并且对分配的总字节数进行计数。当此计数达到某个阈值时，收集过程将运行。在我的 Rust GC 中，我无法精确计算分配的字节数，因为对象通常具有动态大小的字段，例如字符串或向量。作为一种解决方法，我向 GcTrace trait 添加了一个 size() 方法来估计对象的大小并使用它来保持分配的字节数。但这只是一个近似值。一旦我完成了 GC，Lox 解释器的其余部分就很容易编写了。我最终得到了一个用 100% 安全的 Rust 代码编写的 Lox 实现，并通过了 Lox 集成测试套件中的 243 个测试。\n在拥有一个有效的 Lox 解释器和一个绿色测试套件来验证任何更改之后，是时候开始致力于提高性能了。在这一点上，我已经放弃了只用安全的 Rust 来匹配 clox 速度的任何希望。正如我之前提到的，clox 是一个非常快速的实现，它使用各种技巧来实现这一点。从使用没有任何运行时检查的指针算术到超级棘手的 NaN 装箱。但是，我认为如果我在我的代码库中添加一些不安全的块，我至少可以接近 clox 的速度。当然，第一步是衡量绩效。我决定使用制作解释器存储库中可用的相同基准程序。这种测量方式可能不是最好的，但对于没有任何实际程序的语言来说已经足够了。我还决定手动将基准程序转换为 Python 和 Perl 以进行比较。我期待我的第一个实现会出现一些糟糕的结果，但它们比我预期的要糟糕得多：不仅 Loxido（我的​​实现）通常比 clox 慢几倍，而且在许多情况下，它甚至比 jlox（树用 Java 编写的步行实现）！在最初的震惊之后，我意识到除了开始分析并尽可能地减少这些时间之外别无他法。 perf 的第一次运行向我展示了一个明确的目标，将我的糟糕表现归咎于：其中一个问题与我的 GC 实现以及我取消引用基于索引的指针的方式有关。使用向量索引比常规指针解引用慢。需要进行算术运算来获取元素的地址，但更重要的是，Rust 会始终检查索引是否越界。对于绝大多数用例，这些额外的步骤完全可以忽略不计，但是当您有一个每秒处理约 3.5 亿条指令的 VM，然后您必须对每条指令执行三到四次取消引用时，它就会显示出来。但即便如此，这也不是主要问题。最大的问题是我必须添加一些变通方法来取悦借阅检查员。我将尝试解释这一点：VM 的核心基本上是一个巨大的循环，它增加程序计数器 (PC)，获取下一条指令并运行一个大匹配表达式。 PC 是当前帧的一部分。当前帧有一个闭包对象的引用，闭包对象有一个函数对象的引用，然后函数对象有一个对包含指令的字节码块的引用。在代码中它大致是这样的： loop { let mut frame = self.frames.last_mut().unwrap();让闭包 = self.gc.deref(frame.closure);让函数 = self.gc.deref(closure.function);让块 = &amp;function.chunk;让指令 = chunk.code[frame.ip]; frame.ip += 1;匹配指令 { ... }}\n循环的第一部分是导致问题的原因。但是，我真的不需要在每次迭代中都这样做。对于大多数指令，活动帧和字节码块保持不变。当前帧仅在调用函数或当前函数返回时更改。我可以将其存储在一个局部变量中作为参考，并仅根据这些指令更改它，例如： let mut frame = self.frames.last_mut().unwrap();让闭包 = self.gc.deref(frame.closure);让函数 = self.gc.deref(closure.function);让 mut chunk = &amp;function.chunk;循环 { 让指令 = chunk.code[frame.ip]; frame.ip += 1;匹配指令 { 指令::调用 =&gt; { // 更新帧和块 } }} 这将大大提高速度。但是有一个问题：Rust 对此不是很满意。我的实现方式是 GC 拥有创建的每个对象。如果我需要一个对象，我可以借用它，当我借用它时，我也在借用整个 GC。由于 Rust 的别名规则，如果我决定对当前字节码块有一个长期引用，我将永远无法从 GC 可变地借用。因此，这会导致大量的借用检查器投诉。这就是为什么我最终立即归还了每一笔借款。但这意味着大量不必要的取消引用。旁注：我经常遇到的借用检查器的一个类似问题是过程间冲突。 Niko Matsakis 有一篇很好的博客文章解释了这个问题。我很乐意看到 Rust 在这方面有所改进，因为我认为这是初学者的一大难题。我尝试了一些不同的方法来使用安全的 Rust 来解决这个问题，但我在每一个都失败了。这通常令人沮丧，因为它需要长时间的重构，直到最后我才意识到它不起作用。一个更简单的解决方案是使用原始指针而不是引用。这很容易实现，但需要不安全的块来取消引用这两个指针。我最终做到了这一点并且改进是巨大的，一些基准测试占用的时间减少了 74%。这样做之后，我还决定重写 GC 并使引用包装原始指针而不是向量索引。这也需要一些不安全的代码，但它也带来了一些不错的速度改进。更好的是，它让我摆脱了很多样板代码，因为我终于可以使用 Deref。所以，而不是做这样的事情\n我离clox的速度还很远，但至少我已经比jlox好，并且非常接近Python和Perl。接下来出现在分析器中的是 HashMap 操作。这在意料之中。像大多数动态语言一样，Lox 大量使用哈希表。它们用于存储全局变量、实习字符串、字段和方法。这方面的任何改进肯定会对解释器的整体性能产生巨大影响。事实上，本书的最后一章专门讨论优化，展示了哈希表代码的微小变化如何允许将基准测试的运行时间缩短多达 42%。那令人印象深刻。最简单的尝试是更改散列算法。 Rust 标准库中的 HashMap 实现默认使用 SipHash，而 clox 使用 FNV。我知道 SipHash 并没有那么快，所以我想我可以用一些简单的胜利来代替它。在 Rust 中，切换哈希函数实现非常容易。只需使用不同的构造函数，其余代码保持不变。我找到了一个实现 FNV 算法的 Rust crate，但我也发现了一个叫做 aHash 的箱子，它声称是“目前 Rust 中最快的、抗 DOS 的哈希”。我尝试了两者，确实 aHash 给出了更好的结果。通过这个微小的变化，我能够将一些基准测试的运行时间缩短多达 45%。这么小的变化真是太神奇了。后来我发现 Rust 编译器使用了另一种称为 fxhash 的哈希算法。尽管 aHash 声称比 fxhash 更快，但鉴于切换算法是多么容易，我还是决定尝试一下。我很惊讶地发现所有基准测试都有改进。在某些情况下，从 aHash 结果中节省了多达 25% 的时间！旁注：不要对这些结果感到非常兴奋。 Rust 默认使用 SipHash 有一个很好的理由。 FNV 和 fxhash 等算法容易受到算法复杂度 DOS 攻击。将它们用于解释器可能不是一个好主意。但考虑到这不是一种现实世界的语言，而且我正在尝试使用 FNV 匹配 clox 速度，我决定暂时忽略这个事实。然而，aHash 声称可以抵抗 DOS，这对于真正的语言来说可能是一个非常有趣的选择。\n切换哈希函数的改进非常显着。然而，分析器不断显示出一些由哈希表操作引起的性能瓶颈。我还分析了 clox，我发现哈希操作并没有花那么多时间。我不得不进行更多调查。 Rust 的标准库使用了一种非常复杂的哈希映射实现，称为 HashBrown。这是 Google 的 SwissTables 的一个端口，它是一种用 C++ 编写的高性能哈希映射实现。它甚至使用 SIMD 指令并行扫描多个哈希条目。我怎么能改进呢？这似乎是完全不可能的。所以我决定重新阅读专门用于哈希表的 Crafting Interpreters 一章，看看我是否遗漏了任何技巧。事实确实如此！与通用哈希表实现的 HashBrown 不同，clox 中的哈希表是为非常特定的用例量身定制的。虽然 HashBrown 是通用的，但 clox 的 Table 仅使用 Lox 字符串作为键，使用 Lox 值作为值。 Lox 字符串是不可变的、内嵌的，它们可以缓存自己的哈希值。这意味着散列对于每个字符串只发生一次，并且比较与比较两个指针一样快。此外，不处理泛型类型的优势在于可以忽略类型系统边缘情况，例如零大小数据类型。所以我决定咬紧牙关，紧跟 clox 的代码，用 Rust 编写我自己的哈希映射实现。结果非常积极，我能够在大多数基准测试中节省时间，与带有 fxhash 的 HashBrown 相比，在最佳情况下减少了 44%。最后，它也不是很多代码。我的哈希映射实现大约有 200 行，其中大部分是不安全的 Rust。旁注：在编写我自己的哈希表之前，我尝试使用 HashBrown 来模拟与 clox 表相同的特殊条件。例如，我在 GcRef&lt;String&gt; 上实现了 PartialEq 以确保对内部字符串进行比较......", "note_en": "Last year I finally decided to learn some Rust. The  official book by Steve Klabnik and Carol Nichols is excellent, but even after reading it and working on some small code exercises, I felt that I needed more to really understand the language. I wanted to work on a small project to get some hands-on experience, but most of my ideas didn’t feel very well suited for Rust.\n Then I started reading the amazing book  Crafting Interpreters by Bob Nystrom. As the name suggests, the book is about writing an interpreter for a dynamic language named Lox. The book is split into two parts: the first one shows how to implement a simple tree-walking interpreter using Java. The second part shows how to implement the same interpreter, but this time using a high-performance bytecode VM using C. I implemented  the first part in Clojure, and then I realized that the second part was the perfect project for trying Rust.\n The domain of language VMs seems to be almost entirely dominated by C/C++.  VMs are very performance sensitive and often require a lot of micro-optimization. This project seemed like a perfect exercise to compare Rust against these languages. I was especially interested in checking if Rust could match the same speed while providing better safety and ergonomics.\n Disclaimer: It’s been a long time since I used C/C++, probably more than 15 years. Even then, I mostly used these languages for university projects or some open source contributions. During my entire professional career, I have only used higher-level languages. Consider this post as coming from a beginner.\n Now, matching the speed of the C version of the Lox interpreter ( clox) is no easy feat. While many books on the topic of compilers and interpreters focus exclusively on explaining the algorithms and leave performance as an afterthought, Crafting Interpreters shows how to implement a really fast interpreter. For example, in some simple benchmarks, it is common to observe that  clox is 2x or even 3x faster than equivalent Python or Perl code.\n Side note: Take this comparison with a grain of salt. The reason Python and Perl are slower is that these languages provide more flexibility and that comes with a performance cost. This is better explained in   Wren’s web page , which is another language by the same author whose interpreter inspired clox. So yes, the comparison with Python and Perl is a bit oranges and apples, but the main point here is that clox performance is really good and very production-ready.\n  When I began coding my Rust implementation of Lox, I decided to stick to purely safe code. Rust’s main selling point is its safety, but of course you have to stick to the safe part of the language. Rust also allows you to use unsafe code, and if you do that, I think there is no blocker to match the speed of C, although that also means matching its unsafety. It made sense to stick to safe code to begin with.\n I also decided to take advantage of Rust standard library as much as possible. One more interesting fact about  Crafting Interpreters is that it does everything from scratch. The book doesn’t use libraries or parser generators or any tool besides a C compiler and standard library (which is pretty bare-bones). Every single line of code is in the book and I find this absolutely amazing. So there are some chapters dedicated to showing how to write dynamic arrays, strings, and hash maps. Given that Rust’s standard library already has those and they are very optimized, I decided to use them and skip a custom implementation. Besides, implementing those manually most likely requires writing unsafe code.\n I also wanted to take advantage of Rust’s advanced type system as much as possible. The  clox implementation uses variable-length opcodes where most of them use one byte but some use adjacent bytes to pack parameters or data. In my implementation, I decided to use fixed-length opcodes using an  enum. Rust’s sum types are a delight to use because the compiler always has your back and warns you if you ever forget to check for a specific case. I consider this a huge advance in ergonomics.\n The beginning of writing the lox interpreter in Rust was a breeze. The compiler in particular was a joy to write. Rust felt much nicer to write than the old and quirky C. The initial parts of the VM were also really nice to write thanks to sum types, compile-time checks, and a ready-to-use standard library. However, things started to get very tricky once I worked on more advanced stuff such as closures and classes. The  clox implementation uses pointers and aliasing very liberally, while Rust’s aliasing rules are very strict and the borrow checker disallows many patterns to ensure safety. Because of this, I spent a ton of time finding workarounds to make the borrow checker happy.\n Side note: Dealing with the borrow checker is a well-known struggle for Rust beginners. This was the reason why I spent so much time here. The rules are simple but for some reason, it’s really hard to keep track of them in a big system. I would often write huge refactorings thinking that they would be a solution to a borrow checker error, just to get another one at the end of the refactoring. This happens less frequently the more experience I get with the language, but it still happens. The book   Learn Rust With Entirely Too Many Linked Lists   has some good examples of how brutally complex the borrow checker can be.\n  By far the hardest part to implement in my safe Rust implementation of Lox was the garbage collector. How do you even write a GC without manual memory allocation and deallocation? I spent quite some time experimenting and trying different approaches.\n One quick idea that crossed my mind was that perhaps I could skip the GC completely. If Rust can be memory safe without GC, perhaps I could use the same mechanisms to do the same for Lox. For example, using reference counted smart pointers. But I quickly discarded this idea. The Lox language doesn’t have the strict rules that Rust has; it’s easy to create cyclic data structures that would leak memory if implemented using reference counting. A GC is a must here.\n So I got an idea from a  very interesting talk at RustConf 2018 by Catherine West. A common workaround in the Rust world to deal with graph-like structures with cycles is to use vector indices as some sort of pointer. I decided to study the code of some popular crates such as  id-arena and  typed-arena that use this concept in some way. But the main issue with  id-arena is that it doesn’t support deletion of individual objects because there is the risk of running into  the ABA problem. This happens when you delete an object and later reuse its slot while there is a live reference somewhere, which will then be pointed to the wrong place in the vector. There are ways to solve this issue, such as using a  generational arena, but this felt like over-complicating things.\n One day I realized something that now feels so obvious that I’m almost ashamed to admit it: I am writing a garbage collector and its main job is to find objects with no references from the live parts of the program. This means that, if my GC works correctly, I should not worry about the ABA problem at all, because the GC would ensure that there will be no live references of the freed objects.\n With this idea in mind, I ended up with a very simple design for a GC in safe Rust. It’s basically a vector of trait objects. Every object should implement a trait ( GcTrace), which has methods for tracing an object. Additionally, there is a second vector that contains  tombstones to keep track of the deleted objects. The allocation of an object means adding it to the vector and returning the index which will act as some sort of pointer. Freeing an object means swapping it out of the vector and putting some placeholder instead, and adding the index to the list of tombstones that will be reused in a future allocation.\n Instead of returning plain integers, I also created a generic wrapper struct to get some type safety, so that if I allocate objects of different types, the result index is also of a different type. This is very similar to what the  id-arena crate does. This result index is  Copy, which means that I can pass it around as I want without getting nagged by the borrow checker. This also facilitated the design of the interpreter quite a lot, as I was able to get rid of many workarounds that I added to please the borrow checker such as using  RefCell and  Rc. In the end, using the GC looks like this:\n  Then I can copy and pass around this closure reference everywhere, but when I actually need to do something with the object, I can borrow it from the garbage collector. For example:\n  This de-reference dance is a bit unergonomic. I have to call  gc.deref() every time I want to work with any GC object. I thought that perhaps I could implement  Deref and make the Rust compiler do it automatically for me, but this would require each  GcRef object to hold a reference to the GC and dealing with the lifetimes would be a nightmare. I could also make the GC completely static, but I don’t even know how to do that with safe Rust only, so I decided to just live with it.\n This GC design is extremely simple and it has a bunch of shortcomings. One of them is the fact that the memory needed for the vector of trait objects and the tombstones never shrinks. So if a program suddenly allocates a lot of objects and those are then freed by the GC, the space required for the slots remains there forever. Another shortcoming has to do with when to run the collection process. The GC in  clox has precise control of every allocation, and there is a count of the number of the total bytes allocated. When this count reaches some threshold, the collection process runs. In my Rust GC, I can’t have a precise count of the number of bytes allocated because objects often have dynamically sized fields such as strings or vectors. As a workaround, I added a  size() method to the  GcTrace trait to estimate the size of an object and use it to keep count of the allocated bytes. But this is just an approximation.\n Once I was done with the GC, the remaining parts of the Lox interpreter were easy to write. I ended up with a  Lox implementation written in 100% safe Rust code and passing the 243 tests from the Lox integration test suite.\n  After having a working Lox interpreter and a green test suite to validate any change, it was time to start working on improving performance. At this point I had already abandoned any hope of matching the speed of  clox with only safe Rust. As I mentioned before,  clox is a really fast implementation and it uses all sorts of tricks to achieve this. From using pointer arithmetic without any runtime checks to the super tricky  NaN boxing. However, I thought that if I added a few unsafe blocks to my code base, I could at least come close to the speed of  clox.\n The first step is, of course, measuring the performance. I decided to use the  same benchmark programs available in the crafting interpreters repository. This way of measuring might not be the best, but it’s good enough for a language without any real-world programs. I also decided to manually transpile the benchmark programs to Python and Perl to have some point of comparison. I was expecting some bad results for my very first implementation, but they were much worse than I anticipated:\n  Not only is   Loxido (my implementation) often several times slower than  clox, but, in many cases, it’s even slower than  jlox (the tree walking implementations written in Java)! After the initial shock, I realized that there was no other way than to start profiling and shave those times as much as possible.\n The very first run of  perf showed me a clear target to blame for my poor performance:\n  One of the problems was related to my GC implementation and the way I was dereferencing my index-based pointers. Using vector indices is slower than a regular pointer dereference. An arithmetic operation is needed to get the address of the element, but more importantly, Rust will always check if the index is out of bounds. For the vast majority of use cases, these extra steps are completely negligible, however when you have a VM that processes ~350 million instructions per second, and then you have to do three or four dereferences per instruction, then it shows. But even then, this was not the main problem. The big problem was with some of the workarounds that I had to add to please the borrow checker. I’ll try to explain this:\n The core of a VM is basically a huge loop that increments the  program counter (PC), grabs the next instruction and runs a big  match expression. The PC is part of the current frame. The current frame has a reference to a closure object, which has a reference to a function object, which then has a reference to the chunk of bytecode that contains the instructions. In code it roughly looks like this:\n loop {  let  mut frame = self.frames.last_mut().unwrap();  let closure = self.gc.deref(frame.closure);  let function = self.gc.deref(closure.function);  let chunk = &amp;function.chunk;  let instruction = chunk.code[frame.ip]; frame.ip += 1;  match instruction { ... }}\n The first part of the loop is what was causing the problem. However, I don’t really need to do this on every single iteration. For most instructions, the active frame and chunk of bytecode remains the same. The current frame only changes when a function is invoked or when the current function returns. I could store this in a local variable as a reference and change it only on those instructions, for example:\n let  mut frame = self.frames.last_mut().unwrap(); let closure = self.gc.deref(frame.closure); let function = self.gc.deref(closure.function); let  mut chunk = &amp;function.chunk; loop {  let instruction = chunk.code[frame.ip]; frame.ip += 1;  match instruction { Instruction::Call =&gt; {  // update frame and chunk } }}\n This would increase the speed considerably. But there is a problem: Rust is not very happy about it. The way my implementation works is that the GC owns every object created. If I need an object, I could borrow it, and while I borrow it I’m also borrowing the whole GC. Because of Rust’s aliasing rules, if I decide to have a long-lived reference to the current chunk of byte code, I won’t be able to ever borrow mutably from the GC. So this causes a ton of borrow checker complaints. That’s why I ended up returning every borrow immediately. But this implies a ton of unnecessary dereferences.\n Side note: A similar issue with the borrow checker that I often encountered is the one of interprocedural conflicts. There is a nice   blog post by Niko Matsakis  explaining this problem. I would love to see Rust improving in this area, as I see it as a major headache for beginners.\n I tried quite some different approaches to work around this with safe Rust, but I failed on every single one of them. This was often frustrating because it required long refactorings and it was only until the end that I realized that it doesn’t work.\n A simpler solution was to use raw pointers instead of references. This is easy to implement but requires unsafe blocks to dereference those two pointers. I ended up doing that and improvement was massive, with some benchmarks taking up to 74% less time.\n After doing this I also decided to rewrite the GC and make the references wrap raw pointers instead of vector indices. This also required some unsafe code, but it also came with some nice speed improvements. And even better, it allowed me to get rid of a lot of boilerplate code because I could finally use  Deref. So instead of doing things like\n      I was still far from the speed of  clox, but at least I was already better than  jlox and very close to Python and Perl.\n  The next thing that showed up in the profiler was  HashMap operations. This was kind of expected. Like most dynamic languages, Lox uses hash tables heavily. They’re used to store global variables, interning strings, fields and methods. Any improvement in this area will definitely have a huge impact on the overall performance of the interpreter. In fact, the last chapter of the book, which is dedicated to optimizations, shows how a tiny change in the hash table code allows to shave up to 42% of the running time of a benchmark. That was impressive.\n The easiest thing to try was to change the hashing algorithm. The  HashMap implementation in Rust’s standard library uses  SipHash by default, while  clox uses  FNV. I knew that  SipHash is not that fast, so I thought I could get some easy wins replacing it. In Rust it’s very easy to switch hash function implementations. Just use a different constructor and the rest of the code remains intact.\n I found a Rust  crate that implements the FNV algorithm, but I also found one called  aHash which claims to be “the fastest, DOS resistant hash currently available in Rust”. I tried both and indeed  aHash gave better results.\n With this tiny change I was able to shave up to 45% of the running time of some of the benchmarks. That’s super amazing for such a small change.\n Later I found out that the Rust compiler uses another hashing algorithm called  fxhash. Even though  aHash claims to be faster than  fxhash, given how easy it is to switch algorithms, I decided to try it. I was surprised to find improvements on all of the benchmarks. In some cases shaving up to 25% of time from the  aHash results!\n Side note: Don’t get super excited about these results. There is a very good reason why Rust uses SipHash by default. Algorithms such as FNV and fxhash are prone to   algorithmic complexity DOS attacks . It’s probably not a good idea to use them for an interpreter. But given that this is not a real-world language, and I’m trying to match clox speed using FNV, I decided to ignore this fact for the moment. aHash, however, claims to be DOS resistant, which might be a very interesting option for a real language.\n The improvements of switching hash function were quite significant. However, the profiler kept showing some performance bottlenecks caused by hash table operations. I also profiled  clox and I found out that hash operations were not taking that much time there. I had to investigate more.\n Rust’s standard library is using a very sophisticated hash map implementation called  HashBrown. This is a port of  Google’s SwissTables, a high-performance hash map implementation in C++. It even uses SIMD instructions to scan multiple hash entries in parallel. How could I ever improve on that? This seemed completely impossible.\n So I decided to re-read the chapter of Crafting Interpreters dedicated to hash tables to see if I was missing any tricks. And this was the case indeed!\n Unlike  HashBrown, which is a general-purpose hash table implementation, the hash table in  clox is tailored for a very specific use case. While  HashBrown is generic,  clox‘s  Table only uses Lox strings as keys and Lox values as values. Lox strings are immutable, interned, and they can cache their own hashes. This means that hashing only occurs once ever for each string and comparison is as fast as comparing two pointers. Additionally, not dealing with generic types has the advantage of ignoring type system edge cases such as  Zero Sized Data Types.\n So I decided to bite the bullet and write my own hash map implementation in Rust closely following the code from  clox. The results were very positive, I was able to shave time on most of the benchmarks, with a cut of 44% for the best case compared to  HashBrown with  fxhash. In the end, it was not a lot of code either. My hash map implementation is roughly 200 lines of mostly unsafe Rust.\n Side note: Before writing my own hash table, I tried to mimic the same special conditions of clox tables using HashBrown. For example, I implemented PartialEq on GcRef&lt;String&gt; to ensure that the comparison of interned strings were do\n......", "posttime": "2021-07-24 00:31:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,制作,crafting", "title": "我用 Rust 制作解释器的经验", "title_en": "My experience crafting an interpreter with Rust", "transed": 1, "url": "https://ceronman.com/2021/07/22/my-experience-crafting-an-interpreter-with-rust/", "via": "", "real_tags": ["rust", "制作", "crafting"]}, {"category": "", "categoryclass": "", "imagename": "205b2fa5f5f018f7f38742410f87f0f8.jpg", "infoid": 1069225, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌提供了有关其即将推出的 Wear OS 更新计划的更多详细信息。正如我们所报道的那样，谷歌和三星正在联手重振陷入困境的 Wear OS。三星正在放弃 Tizen 手表并将其 Exynos SoC 带到 Wear OS 平台，而谷歌将在过去几年基本忽略操作系统后再次开始 Wear OS 开发。官方 Wear OS 论坛上的帖子标题为“Wear OS 3 对您意味着什么”，它描述了向新操作系统的艰难过渡。首先，重要的是要注意，该帖子正式将改进后的 Wear OS 称为“Wear OS 3”，这是谷歌迄今为止在其所有官方声明中遗漏的一个细节，选择了“统一平台”、“新版本的 Wear OS” ,”或其他一些笨重的描述符。这是第3版！这与我们的计数一致；这是自 2018 年 Wear OS 2 以来的第一次重大 Wear OS 更新。接下来，我们得到了从 Wear OS 2 更新到 3 的设备列表。时间不长：符合升级条件的 Wear OS 设备包括出门问问的 TicWatch Pro 3 GPS 、TicWatch Pro 3 Cellular/LTE、TicWatch E3 和后续的 TicWatch 设备，以及 Fossil Group 将于今年晚些时候推出的新一代设备。这些都是使用高通公司的 Snapdragon Wear 4100 SoC 的设备。该列表实际上是每台 Snapdragon Wear 4100 设备，包括 Fossil 名称检查，用于确定未来可能发布的 Wear 4100 设备。这是一个明显的迹象，表明谷歌将不支持带有 Wear OS 3 的旧版 Snapdragon Wear 3100。Wear 3100 构成了几乎所有当前的 Wear OS 设备，但它的速度也非常慢。高通历来是 Wear OS 制造商可用的唯一可行的 SoC 供应商，但它也不太关心可穿戴设备，而且最近 6 年没有提高其智能手机 SoC 的性能。从 2014 年到 2020 年，该公司出货了几种不同型号的 28 纳米四核 Cortex A7 CPU。结果是随着电池寿命和性能问题的堆积，而竞争的苹果和三星设备每年都变得更快，Wear OS 濒临死亡。随着 2020 年年中发布的 Snapdragon Wear 4100 的发布，高通终于打破了其 2014 年芯片技术出货的连续性。它只是一个中低端 12 nm Cortex A53 SoC，与三星或苹果完全没有竞争力，但这是一个很大的改进。不过，唯一剩下的 Wear OS 供应商是时尚品牌，而且他们并不十分关心发布最新技术，因此 Wear 4100 几乎不存在。我们实际上在上周看到了 Wear 3100 设备的发布：价值 2,150 美元的 Tag Heuer 超级马里奥手表。\n放弃 Wear 3100 是一个可以理解的决定。该芯片非常慢，支持它意味着限制 Wear OS 可以做的很多事情。一旦 Qualcomm 时代结束，Wear OS 可以期待在三星掌舵硬件的情况下获得可靠的性能改进。新的旗舰 Wear OS 设备 Galaxy Watch 4（有望在三星 8 月 11 日的发布会上发布）据传拥有高端 5 纳米三星 Exynos SoC，可能比 3100 快很多倍。 ，三星也不会更新其任何手表，因为从 Tizen 切换到 Wear OS 会过于戏剧化。我们仍然几乎没有关于 Wear OS 3 的信息，但升级公告中有一些花絮表明情况会大不相同。公告中的一行规定了对从 Wear OS 2 升级到版本 3 的任何 Wear 4100 设备进行强制恢复出厂设置的要求。Wear OS 3 显然如此不同，用户数据无法移植，所有本地数据都将需要擦拭。我们当然听过谷歌和三星谈论 Wear OS 3 将如何结合“最好的 Wear OS 和 Tizen”，这表明甚至可能重建基本操作系统。谷歌还含糊地告诉4100升级者，“在某些有限的情况下，用户体验也会受到影响”。这是对 4100 性能的参考，还是与 Wear OS 2 相比的应用程序选择和功能？很难说。由于 Wear OS 3 如此不同，Google 表示不会强制升级 4100 名用户：我们预计，出于这些原因，你们中的一些人会更愿意保留当前的 ​​Wear OS 体验。因此，我们将在选择加入的基础上为符合条件的设备提供系统升级。我们将在更新之前提供更多详细信息，以便您做出明智的决定。我们希望我们的合作伙伴能够从 2022 年中下半月开始推出系统更新。搭载 Wear OS 3 的三星手表预计将在 2021 年 8 月的某个时候发货，因此“2H 2022”的合作伙伴时间——可能是三星发布一年后——出人意料地晚了。 Android 通常非常擅长让合作伙伴尽早访问代码，因此（至少那些关心的人）可以为发布做好准备，但这表明三星正在取得巨大的领先优势。谷歌表示，即将于今年晚些时候推出的 Fossil 手表将“有资格升级”到 Wear OS 3，这也表明我们可能会在三星下个月推出 Wear OS 3 后看到其他公司推出 Wear OS 2 设备。三星一直将主导 Wear OS 3 生态系统，因为它拥有高端 Exynos 可穿戴 SoC 的独家使用权，并且似乎对将它们出售给第三方不感兴趣。不过，越来越多的证据表明，三星实际上将在一段时间内独家使用 Wea​​r OS 3。我们在这里推测，但谷歌和三星的合作无疑包括了许多谈判，“一年的 Wear OS 3 独家访问权”将是一个很好的整数，可以包含在交易中。不过，我们真的不知道。围绕 Wear OS 仍有许多谜团，但下个月我们应该会得到更多答案。", "note_en": "Google has provided  a few more details about its upcoming Wear OS update plans. As we&#39;ve reported, Google and Samsung are teaming up to resurrect the struggling Wear OS. Samsung is ditching Tizen watches and bringing its Exynos SoCs to the Wear OS platform, and Google will start Wear OS development again after mostly ignoring the operating system for the past few years.\n The post on the official Wear OS forums is titled &#34;What Wear OS 3 means for you,&#34; and it describes what will be a rocky transition to the new OS. First, it&#39;s important to note that the post is formally calling the revamped Wear OS &#34;Wear OS 3,&#34; a detail Google has left out of all its  official statements so far, opting for &#34;unified platform,&#34; &#34;the new version of Wear OS,&#34; or some other clunky descriptor. It&#39;s version 3! This lines up with our count; it&#39;s the first major Wear OS update since Wear OS 2 in 2018.\n Next, we get a list of devices being updated from Wear OS 2 to 3. It&#39;s not long:\n Wear OS devices that will be eligible for upgrade include Mobvoi’s TicWatch Pro 3 GPS, TicWatch Pro 3 Cellular/LTE, TicWatch E3 and follow on TicWatch devices, as well as Fossil Group’s new generation of devices launching later this year.\n Those are all devices that use Qualcomm&#39;s Snapdragon Wear 4100 SoC. That list is actually  every Snapdragon Wear 4100 device, including a Fossil name check for what are presumably Wear 4100 devices that will be released in the future. It&#39;s a clear sign that Google will not support the older Snapdragon Wear 3100 with Wear OS 3.\n    The Wear 3100 makes up almost all the current Wear OS devices, but it&#39;s also appallingly slow. Qualcomm has historically been the only viable SoC vendor available to Wear OS manufacturers, but it also hasn&#39;t cared about wearables much, and it recently went six years without improving the performance of its smartphone SoCs. From 2014 to 2020, the company shipped 28 nm, quad-core Cortex A7 CPUs under several different model numbers. The result has been the near-death of Wear OS as battery life and performance issues piled up while competing Apple and Samsung devices got faster every year.\n Qualcomm finally broke its streak of shipping 2014-era chip technology with the release of the  Snapdragon Wear 4100, which was announced in mid-2020. It&#39;s only a low-end to mid-range 12 nm, Cortex A53 SoC that isn&#39;t at all competitive with Samsung or Apple, but it&#39;s a big improvement. The only remaining Wear OS vendors are fashion brands, though, and they&#39;re not all that concerned with shipping the latest technology, so uptake on the Wear 4100 has been nearly non-existent. We actually saw a Wear 3100 device launch just last week: the $2,150  Tag Heuer Super Mario watch.\n Dropping the Wear 3100 is an understandable decision. The chip is so slow that supporting it would mean limiting a lot of what Wear OS can do. Once the Qualcomm era is over, Wear OS can expect reliable performance improvements with Samsung at the hardware helm. The new flagship Wear OS device, the Galaxy Watch 4 (hopefully being announced at Samsung&#39;s  August 11 event)  is rumored to have a high-end, 5 nm Samsung Exynos SoC that will probably be many times faster than the 3100. For what it&#39;s worth, Samsung isn&#39;t updating any of its watches, either, as a switch from Tizen to Wear OS would be too dramatic.\n     We still have next to no information about Wear OS 3, but there are a few tidbits in the upgrade announcement indicating that things will be very different. One line in the announcement lays out the requirement for a  mandatory factory reset for any Wear 4100 devices upgrading from Wear OS 2 to version 3. Wear OS 3 is apparently so different that user data can&#39;t be ported over, and all local data will need to be wiped. We&#39;ve certainly heard Google and Samsung talk about how Wear OS 3 will combine the &#34;best of Wear OS and Tizen,&#34; indicating that even the base OS might be rebuilt.\n Google also vaguely tells 4100 upgraders that &#34;in some limited cases, the user experience will also be impacted.&#34; Is this a reference to the 4100 performance or the app selection and features compared to Wear OS 2? It&#39;s hard to say. Because Wear OS 3 will be so different, Google says it won&#39;t force the upgrade on 4100 users:\n We expect that for these reasons, some of you will prefer to keep your current Wear OS experience. Therefore, we will offer the system upgrade on an opt-in basis for eligible devices. We will provide more details in advance of the update so you can make an informed decision. We expect our partners to be able to roll out the system update starting in mid to second half of 2022.\n The Samsung Watch with Wear OS 3 is expected to ship sometime in August 2021, so the partner time of &#34;2H 2022&#34;—potentially a year after Samsung&#39;s release—is surprisingly late. Android has typically been very good at letting partners get early access to code, so (at least the ones that care) can be ready for launch, but this suggests Samsung is getting a huge head start. Google&#39;s message that upcoming Fossil watches, launching later this year, will be &#34;eligible for upgrade&#34; to Wear OS 3 also suggests that we might see Wear OS 2 devices launch from other companies  after Samsung launches Wear OS 3 next month.\n Samsung was always going to dominate the Wear OS 3 ecosystem because it has exclusive access to high-end Exynos wearables SoCs and doesn&#39;t seem interested in selling them to third parties. Evidence is piling up that Samsung will actually have exclusive access to Wear OS 3 for some time, though. We&#39;re speculating here, but a Google and Samsung team-up undoubtedly included many negotiations, and &#34;one year of exclusive access to Wear OS 3&#34; would be a nice, round number to include in a deal. We don&#39;t really know, though. There are still so many mysteries surrounding Wear OS, but we should get more answers next month.", "posttime": "2021-07-23 23:58:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,wear", "title": "谷歌的 Wear OS 3 更新计划将使大多数现有设备落后", "title_en": "Google’s Wear OS 3 update plans will leave most existing devices behind", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/googles-wear-os-3-update-plans-will-leave-most-existing-devices-behind/", "via": "", "real_tags": ["google", "谷歌", "wear"]}, {"category": "", "categoryclass": "", "imagename": "f2d39248c0dbe7ab4d184923bc3119e4.jpg", "infoid": 1069224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个问题很不寻常，但随着越来越多的公司避开传统的 IPO 途径进入公开市场，转而与 SPAC 合并，这个问题可能会变得更加普遍。问题出现在周四，当时股东投票批准了除一项提案之外的所有提案，作为合并的一部分——提案二，该提案将修改公司章程，以便 Lucid 可以获得关键融资。该提案需要比其他提案更多的票数——而且必须获得批准才能进行合并——因此缺乏投票最终导致整个过程停止。缺乏股东被归咎于散户投资者不熟悉 SPAC 流程，以及令人难以置信的垃圾邮件。丘吉尔主席迈克尔克莱因提出了一些发送给股东的电子邮件被意外发送到选民的垃圾邮件文件夹的可能性。虽然像 Gmail 垃圾邮件过滤器这样低技术的东西可能会中断数十亿美元的商业合并，这似乎令人难以置信，但在这种情况下似乎已经发生了。 “我们只是需要更多的选票，”克莱因周四在投资者电话会议上表示。 Lucid Motors 首席执行官 Peter Rawlinson 也直言不讳：“我需要你投票支持提案二。” “我们认识到，对于你们中的许多人来说，这个投票过程可能是新的，也可能不是标准的，”克莱因继续说道。他后来感谢了许多个人股东，但敦促那些“参与新平台、新应用程序”的人投票。 “他们可能不一定会明确地将您引导至投票服务。”自大流行开始以来，业余或所谓的“零售交易员”的数量激增，这主要归功于 Robinhood 等应用程序，该应用程序利用游戏化策略鼓励用户从任何地方买卖股票。这种现象的顶峰可能会被历史记住，因为 GameStop 和 AMC 娱乐等倒闭公司的股票价格爆炸式上涨，这些公司由 subreddit r/wallstreetbets 上的一群散户交易者设计。根据摩根士丹利的一份报告，散户投资者约占美国股票交易量的 10%，低于去年 9 月的 15% 的高位。\n但是，如果模因股票价格的上涨向我们表明了什么，那就是零售交易者是一股强大的力量。摩根士丹利的报告指出，“散户投资者往往更喜欢他们作为消费者可能熟悉的行业的公司，例如非必需消费品、通信服务和技术。”这可能就是丘吉尔 SPAC 在许多散户投资者的关注度很高的原因。在 subreddit r/SPACs 上的一篇备受赞誉的帖子中，一位 Reddit 用户敦促新的散户股东参与投票：“这不正常。 SPAC以前从未要求股东为自己的最佳利益行事。你必须投票。不投票不算作是。不投票就是不投票。”虽然 Lucid 的合并停滞与 meme 股票交易的情况截然不同，但它再次提醒人们，散户投资者正在继续塑造市场。", "note_en": "The issue is an unusual but could become more common as more companies eschew the traditional IPO path to public markets and instead merge with SPACs.\n The issue came on Thursday, when shareholders voted to approve all but one of the proposals as part of the merger — proposal two, which would revise the company’s charter so that Lucid could receive key financing. That proposal requires a higher number of votes than the others – and it must be approved for the merger to take place – so a lack of votes ended up halting the entire process.\n  The lack of shareholders was blamed on retail investors’ unfamiliarity with the SPAC process and, unbelievably spam.\n Churchill chairman Michael Klein raised the possibility that some of the emails sent to shareholders were accidentally sent to voters’ spam folders. While it may seem incredible that something as low-tech as a Gmail spam filter might interrupt a multi-billion dollar business merger, it seems that may have occurred in this case.\n “We simply need more votes,” Klein said on an investor call Thursday. Lucid Motors CEO Peter Rawlinson was also direct: “I need you to vote for proposal two.”\n “We recognize that for many of you, this voting process may be new or not standard,” Klein continued. He later thanked the many individual shareholders but urged those “participating from the new platforms, the new apps,” to vote. “They may not necessarily the directing you clearly to the voting service.”\n The number of amateur or so-called “retail traders” has exploded since the start of the pandemic, largely thanks to apps like Robinhood, which leverages gamification strategies to encourage users to buy and sell stocks from anywhere. The pinnacle of this phenomenon will likely be remembered by history in the explosive rise in prices of stocks for failing companies like GameStop and AMC entertainment, engineered by an army of retail traders on the  subreddit r/wallstreetbets. Retail investors account for around 10% of the U.S. equity trading volume, according to a report from Morgan Stanley, down from a high of 15% last September.\n But if the rise in the price of meme stocks shows us anything, it’s that retail traders are a powerful force. The Morgan Stanley report notes that “retail investors tend to prefer companies in sectors they are likely to be familiar with as consumers, such as Consumer Discretionary, Communication Services, and Technology.” This could be why the Churchill SPAC was high on many retail investors’ radars.\n In a  highly-awarded post on the subreddit r/SPACs, a Reddit user urgers new retail shareholders to participate in voting: “ This is not normal. SPACs have never had to beg shareholders to act in their own best interest before.\n You MUST vote. A non-vote does NOT count as a YES. A non-vote is just a non-vote.”\n While Lucid’s merger hold-up is a very different scenario than that of meme stock trading, it’s yet another reminder that retail investors are continuing to shape markets.", "posttime": "2021-07-23 23:57:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "呼吁,motors,股东", "title": "高管呼吁股东投票后，Lucid Motors 的 SPAC 合并获得批准", "title_en": "\n\t\t\t\tLucid Motors’ SPAC merger approved after executives issue plea to shareholders to vote\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/23/lucid-motors-spac-merger-approved-after-executives-issue-plea-to-shareholders-to-vote/", "via": "", "real_tags": ["呼吁", "motors", "股东"]}, {"category": "", "categoryclass": "", "imagename": "08e6f76ecf4cb99942387a6ca5b7a5b0.jpg", "infoid": 1069223, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Andrew Steele 是 Activant Capital 的投资者。他专注于金融科技和电子商务基础设施，常驻纽约。但是堆栈中仍然缺少一个主要组件：结账，它有机会成为更广泛的 B2B 电子商务的最终推动者。从历史上看，B2B 电子商务一直受到根深蒂固的行为和缺乏基于云的基础设施的阻碍。虽然市场正在迅速发展，但 B2B 购买存在细微差别，这使得购买路径比消费电子商务更加复杂。从广义上讲，这些限制分为三类： 支付：PayPal 开启了消费者电子商务的早期阶段，Stripe 整合卡支付的便利性为过去十年提供了动力。但在 B2B 中，挑战一直是卖家不想支付 3% 的附加费——以至于他们宁愿忍受实物支票和应付账款的痛苦。 2018年，60%的B2B支付流程是通过支票进行的，非数字支付的持续存在一直是电子商务的主要瓶颈。权限：大多数 B2B 交易都经过签约和采购，这需要多方签署每笔交易。这会在购买过程中产生摩擦，因为卖家无法判断买家是否获得授权。买家通常需要填写表格，以便销售人员与他们取得联系，而不是点击购买。这可能会将事务从几秒钟减慢到几周。信用：大多数 B2B 交易都是通过某种形式的信用完成的，无论是营运资金贷款、保理，还是以应付天数的形式。信用申请通常以纸质表格（或最好是托管的 PDF）完成，内部信用部门的人员会审查这些表格。就上下文而言，约翰迪尔 (John Deere) 有 1,000 多名员工在其工作描述中具有“信用”。这会花费大量成本并导致敏感信息在纸质文件上共享，从而进一步减慢交易速度。这些限制的最终结果是无法像我们习惯的消费者那样进行即时在线购买。这是需要平台而不是一系列单点解决方案的金融科技问题的组合。\n虽然“结账”一词似乎并不特别新颖，但现代结账是金融科技中一个明显的新类别，结合了数字支付、身份、欺诈、信用等等。它创建了一个强大的网络，这种网络不仅可以建立信任，还可以实现大规模的一键式交易。", "note_en": "Andrew Steele is an investor at  Activant Capital. He focuses on fintech and e-commerce infrastructure and is based in New York.\n  But one major component remains missing from the stack:  checkout, which has the opportunity to be the ultimate enabler for B2B e-commerce more broadly.\n   Historically, B2B e-commerce has been held back by deeply entrenched behaviors and a lack of cloud-based infrastructure. While the market is quickly evolving, there are nuances to B2B purchases that make the path to purchase more complex than in consumer e-commerce. Broadly speaking, these constraints fall into three buckets:\n Payments: PayPal unlocked the early days of consumer e-commerce, and Stripe’s ease of integrating card payments has powered the last decade. But in B2B, the challenge has always been that sellers don’t want to pay a 3% surcharge — so much so that they’d rather suffer through the pain of physical checks and accounts payable. In 2018, 60% of B2B payment flows were conducted via checks, and the persistence of nondigital payments has been a major bottleneck to e-commerce.\n Permissions: Most B2B transactions go through contracting and procurement, which requires multiple parties to sign off on each transaction. This creates friction in the path to purchase, as the seller can’t tell if the buyer is authorized. Rather than being able to hit buy, buyers often need to fill out a form so a salesperson can get in touch. This can slow the transaction from seconds to weeks.\n Credit: The majority of B2B transactions are completed on some form of credit, be it working capital loans, factoring, or in the form of days payable. Credit applications are typically completed on paper forms (or at best  hosted PDFs) that armies of people at internal credit departments review. For context, there are over 1,000 employees at John Deere with “credit” in their job descriptions. This costs a lot and results in sensitive information being shared on paper documents, which further slows the transaction.\n The net result of these constraints is the inability to make instant online purchases, like we’re used to as consumers. It’s a combination of fintech problems that require a platform rather than a series of point solutions.\n  While the term “checkout” may not seem particularly novel, modern checkout is a distinctly new category in fintech combining digital payments, identity, fraud, credit and much more. It creates a powerful network, the type that can not only build trust but enable one-click transactions at scale.", "posttime": "2021-07-23 23:57:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电子商务,key,支付", "title": "结账是无摩擦 B2B 电子商务的关键", "title_en": "\n\t\t\t\tCheckout is the key to frictionless B2B e-commerce\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/23/checkout-is-the-key-to-frictionless-b2b-e-commerce/", "via": "", "real_tags": ["电子商务", "key", "支付"]}, {"category": "", "categoryclass": "", "imagename": "f4cfadab681291660fc2c461fc7f7d42.jpg", "infoid": 1069222, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从周五开始，Facebook 将通过一个网络应用程序将其新生的云游戏服务带到 iPhone 和 iPad 上，人们可以像添加原生应用程序一样添加到他们的主屏幕。该网站将让您玩简单的网络游戏，如纸牌和三消游戏，并流式传输更多图形密集的游戏，如赛车游戏。但由于 Apple 的规定，目前尚不清楚人们将如何找到它，因为像 Facebook 这样的第三方开发商被禁止将他们的应用程序用户引导到具有非 Apple 自己的购买机制的网站。这不仅是与 Facebook 之间的巨大摩擦点，而且与 Epic 等其他游戏公司也发生了巨大的摩擦，这些公司强烈抗议苹果对 iOS 支付的控制。 Facebook 的网页游戏库，包括基于 HTML5 的网页游戏以及直接从云端流式传输的更高级的游戏，使用社交网络的自定义支付系统 Facebook Pay 来接受游戏内购买。 Facebook 决定通过网络将其游戏平台引入 iOS 的决定模仿了亚马逊和微软的方法，它们也发布了渐进式网络应用程序（PWA），用于各自的云游戏服务绕过 App Store。去年，当苹果阻止将游戏放入 iOS 独立应用程序并表示将寻找替代方案时，Facebook 大声抱怨。不久之后，苹果改变了规则，允许基于云的游戏，只要它们作为应用程序单独提交给 App Store 进行审查——微软和其他公司表示，这一政策并没有满足他们发布自己的游戏店面的愿望在 iOS 上。 “我们得出了与其他人相同的结论：网络应用程序是目前在 iOS 上流式传输云游戏的唯一选择，”Facebook 游戏副总裁 Vivek Sharma 在一份声明中告诉 The Verge。 “正如许多人指出的那样，苹果‘允许’在 App Store 上发布云游戏的政策根本不允许。 Apple 要求每个云游戏都有自己的页面、经过审核并出现在搜索列表中，这违背了云游戏的目的。这些障碍意味着玩家无法在原生 iOS 应用程序中发现新游戏、跨设备玩游戏以及立即访问高质量的游戏——即使对于那些没有使用最新和最昂贵设备的人也是如此。” “苹果在 App Store 上&#39;允许&#39;云游戏的政策根本不允许” Facebook 还不是游戏的主要参与者，因为它主要专注于吸引流媒体播放他们的游戏玩法供粉丝观看。但去年它收购了一家云游戏初创公司，并发布了一些免费游戏，如 Asphalt 9。此后，它在更多地区提供了服务，增加了其他游戏，如刺客信条：叛乱，并表示有 150 万人玩每个月的云游戏。尽管 Facebook 最终找到了在 iOS 上运行其云游戏的解决方案，但 Apple 的 Safari 浏览器对网页游戏仍存在很大限制。声音默认关闭，游戏无法发送推送通知，图形也没有原生应用那么强大。然后是发现问题。\nFacebook 发言人拒绝就其游戏网站的增长计划发表评论，但苹果公司的规则规定，开发人员不能将用户从原生应用程序发送到使用非自有支付技术的网站。 Facebook 功能的游戏开发者可以进行自己的营销，但与主要 Facebook 应用程序可以发送的流量相比，这些努力将相形见绌。 Facebook 的云游戏目前在美国以及加拿大和墨西哥的部分地区可用，而随着云游戏逐渐被带到更多地区，HTML 游戏可以在其他地方访问。", "note_en": "Starting Friday, Facebook is bringing its nascent cloud gaming service to iPhones and iPads  through a web app people will be able to add to their homescreens like a native app. The site will let you play simple web games like Solitaire and match-threes and stream more graphically intensive titles like racing games.\n But thanks to Apple’s rules, it’s unclear how people will find it, since third-party developers like Facebook are  barred from steering their app users to websites featuring purchasing mechanisms that aren’t Apple’s own. It’s a huge point of friction with not just Facebook, but other gaming companies like Epic that have strongly protested Apple’s grip on iOS payments. Facebook’s library of web games, which include HTML5-based ones alongside more advanced titles that stream directly from the cloud, use the social network’s custom payments system called Facebook Pay to accept in-game purchases.\n Facebook’s decision to bring its game platform to iOS via the web mimics the approach of  Amazon and  Microsoft, which have also released Progressive Web Apps, or PWAs, for their respective cloud gaming services to get around the App Store. Last year, Facebook  complained loudly when Apple blocked its attempt to put games in a standalone app for iOS and said it would look into alternatives. Shortly after that, Apple  changed its rules to allow for cloud-based games as long as they were submitted individually as apps to the App Store for review — a policy that Microsoft and others said didn’t address their desire to release their own gaming storefronts on iOS.\n   “We’ve come to the same conclusion as others: web apps are the only option for streaming cloud games on iOS at the moment,” Facebook’s vice president of gaming, Vivek Sharma, told  The Verge in a statement. “As many have pointed out, Apple’s policy to ‘allow’ cloud games on the App Store doesn’t allow for much at all. Apple’s requirement for each cloud game to have its own page, go through review, and appear in search listings defeats the purpose of cloud gaming. These roadblocks mean players are prevented from discovering new games, playing cross-device, and accessing high-quality games instantly in native iOS apps — even for those who aren’t using the latest and most expensive devices.”\n “Apple’s policy to ‘allow’ cloud games on the App Store doesn’t allow for much at all”\n Facebook isn’t a major player in gaming yet, as it has mostly focused on courting streamers to broadcast their gameplay for fans to watch. But last year it acquired a cloud gaming startup and  released a handful of free-to-play titles like  Asphalt 9. It has since made its service available in more regions, added other titles like  Assassin’s Creed: Rebellion, and said 1.5 million people play its cloud games per month.\n While Facebook ultimately found a solution for getting its cloud games on iOS, there are still big limitations  imposed by Apple’s Safari browser on web games. Sound is turned off by default, games can’t send push notifications, and graphics aren’t as powerful as they can be in native apps. And then there’s the problem of discovery.\n A Facebook spokesperson declined to comment on its growth plans for the gaming website, but  Apple’s rules say that developers can’t send users from a native app to a website with payments technology other than its own. Developers of the games Facebook features could do their own marketing, but those efforts would pale in comparison to the traffic that the main Facebook app could send.\n Facebook’s cloud games are currently available in the US and parts of Canada and Mexico, while HTML games are accessible elsewhere as cloud games are slowly brought to more regions.", "posttime": "2021-07-23 23:53:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,程序,facebook,iphone", "title": "Facebook 通过渐进式网络应用程序将其云游戏服务引入 iPhone 和 iPad，游戏使用 Facebook Pay 接受游戏内购买", "title_en": "Facebook brings its cloud gaming service to iPhones and iPads through a progressive web app, with games using Facebook Pay to accept in-game purchases", "transed": 1, "url": "https://www.theverge.com/2021/7/23/22589398/facebook-cloud-gaming-web-app-launch-apple?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["游戏", "程序", "facebook", "iphone"]}, {"category": "", "categoryclass": "", "imagename": "53bf0fdaae613ac2b0375a25b92737f8.jpg", "infoid": 1069221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据加拿大皇家银行周四报道，俄罗斯在 6 月和 7 月的测试期间设法与全球互联网断开连接，并引用了负责改善俄罗斯互联网安全的工作组的文件。俄罗斯于 2019 年底通过了一项名为“主权互联网”法的立法，旨在保护该国免受外国基础设施的切断，以回应俄罗斯所谓的美国国家网络安全战略的“侵略性”。该立法加强了莫斯科对全球网络的控制，并引起言论自由活动家的恐慌，他们担心此举会加强政府对该国网络空间的监督。加拿大皇家银行援引工作组消息人士的话说，根据初步结果，涉及俄罗斯所有主要电信公司的测试于 6 月 15 日至 7 月 15 日进行，并取得了成功。 “测试的目的是确定‘符文’在外部扭曲、阻塞和其他威胁的情况下工作的能力，”消息人士说。另一位加拿大皇家银行消息人士称，测试了物理断开俄罗斯部分互联网的能力。目前尚不清楚断开连接持续了多长时间，或者互联网流量是否有任何明显的中断。 RBC 表示，该法律规定每年都要进行测试，但由于 Covid-19 大流行的并发症，手术在 2020 年被取消。\n克里姆林宫发言人德米特里佩斯科夫说，克里姆林宫知道这些测试，称它们是及时的，并说俄罗斯必须为任何事情做好准备。该立法旨在通过国家当局控制的点路由俄罗斯的网络流量和数据，并建立一个国家域名系统，即使俄罗斯被切断，互联网也能继续工作。 2019 年 6 月，俄罗斯总统弗拉基米尔·普京表示，莫斯科必须确保“Runet”能够以可靠的方式运行，以防止其他国家不受俄罗斯控制的服务器被关闭，其运营受到影响。据 RBC 报道，国家通信监管机构 Roskomnadzor 表示，这些测试旨在提高俄罗斯互联网基础设施的完整性、稳定性和安全性。它表示，自 3 月以来，Roskomnadzor 使用作为测试一部分安装的设备来降低社交网络 Twitter 的速度，原因是未能删除莫斯科认为非法的内容。 — Alexander Marrow 报道，Dmitry Antonov 补充报道，(c) 2021 路透社", "note_en": "Russia managed to disconnect from the global Internet during tests in June and July, the RBC daily reported on Thursday, citing documents from the working group tasked with improving Russia’s Internet security.\n Russia adopted legislation, known as the “sovereign Internet” law, in late 2019 that seeks to shield the country from being cut off from foreign infrastructure, in answer to what Russia called the “aggressive nature” of the US’s national cybersecurity strategy.\n The legislation tightened Moscow’s control over the global network and caused consternation among free-speech activists, who feared the move would strengthen government oversight of the country’s cyberspace.\n  Tests involving all Russia’s major telecommunications firms were held from 15 June to 15 July and were successful, according to preliminary results, RBC cited a source in the working group as saying.\n “The purpose of the tests is to determine the ability of the ‘Runet’ to work in case of external distortions, blocks and other threats,” the source said. Another RBC source said the capability of physically disconnecting the Russian part of the Internet was tested.\n  It was not immediately clear how long the disconnection lasted or whether there were any noticeable disruptions to Internet traffic.\n The law stipulates that tests be carried out every year, but operations were called off in 2020 due to complications with the Covid-19 pandemic, RBC said.\n The Kremlin was aware of the tests, spokesman Dmitry Peskov said, describing them as timely and saying that Russia had to be ready for anything.\n The legislation seeks to route Russian Web traffic and data through points controlled by state authorities and build a national domain name system to allow the Internet to continue working even if Russia is cut off.\n In June 2019, President Vladimir Putin said Moscow had to ensure that the “Runet” could function in a reliable way to guard against servers outside of Russia’s control in other countries being switched off and their operations compromised.\n State communications regulator Roskomnadzor said the tests were aimed at improving the integrity, stability and security of Russia’s Internet infrastructure, RBC reported.\n It said the equipment installed as part of the tests had been used by Roskomnadzor to slow down the speed of social network Twitter since March over a failure to delete content Moscow deemed illegal.  —  Reported by Alexander Marrow, with additional reporting by Dmitry Antonov, (c) 2021 Reuters", "posttime": "2021-07-23 23:48:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,全球,disconnected", "title": "俄罗斯与全球互联网断开连接", "title_en": "Russia disconnected itself from the global internet", "transed": 1, "url": "https://techcentral.co.za/russia-disconnected-itself-from-the-global-internet-in-tests/109406/", "via": "", "real_tags": ["俄罗斯", "全球"]}, {"category": "", "categoryclass": "", "imagename": "8168bdac77e538fc9703b814d02e9398.jpg", "infoid": 1069220, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020 年 11 月，由于存在潜在的火灾风险，通用汽车公司宣布召回雪佛兰 Bolt EV。不幸的是，对于 Bolt EV 车主来说，这个修复——一个软件补丁——没有奏效，现在他们的汽车将受到第二次召回。通用汽车将更换受影响汽车中的电池模块，这些汽车的车型年限为 2017-2019。这个问题在 2020 年 10 月开始成为头条新闻，当时美国国家公路交通安全管理局在接到多起车辆火灾报告后开始对电动掀背车进行调查。通用汽车试图用软件解决这个问题，起初暂时限制 Bolt EV 的电池充电超过 90%。 2021 年 5 月提供了一个更永久的修复方法。在通用汽车与 LG 化学（制造锂离子电池）的调查过程中，这些公司在一些模块中发现了“罕见的制造缺陷”，这可能会导致短路和从而引发电池火灾。解决方案是让诊断软件监控此缺陷，并在检测到时提醒所有者。然而，7 月 14 日，美国国家公路交通安全管理局透露，它知道另外两起 Bolt EV 起火事故，这两起事故均已得到通用汽车的修复。周五，通用汽车做出了反应，发出了第二次召回——它说实际上是因为第二次缺陷。该汽车制造商在一份声明中表示，“通用汽车和 LG 的专家已经确定，同一电池中同时存在两种罕见的制造缺陷是某些雪佛兰 Bolt 电动汽车电池起火的根本原因。”当更换电池模块准备好安装时，通用汽车将联系 MY2017-2019 Bolt EV 的车主。在那之前，拥有受影响汽车的生活将比以前方便很多。通用汽车表示，车主应再次使用 Hilltop Reserve 模式 (MY2017-2018) 或 Target Charge Level (MY2019)，以防止电池充电超过 90%。此外，通用汽车要求车主在每次旅行后为他们的车辆充电，尽管他们也被要求不要让 Bolt EV 充电过夜，并且汽车在充电后应立即拔掉电源并停在外面。最后，车主应该尝试在电池中留下至少 70 英里的续航里程。", "note_en": "In November 2020,  General Motors issued a recall of the Chevrolet Bolt EV due to a potential fire risk. Unfortunately for Bolt EV owners, that fix—a software patch—did not work, and now their cars are subject to a  second recall. General Motors will replace battery modules in the affected cars, which span model years 2017-2019.\n The problem started making headlines in October 2020, when the National Highway Traffic Safety Administration  began an investigation into the electric hatchback following a number of reports of vehicle fires. GM tried to fix the problem with software, at first temporarily limiting the Bolt EVs&#39; batteries from charging past 90 percent.\n A more permanent fix was made available in May 2021. During the course of GM&#39;s investigation together with LG Chem (which makes the lithium-ion battery cells), the companies discovered in some modules &#34; a rare manufacturing defect&#34; that could cause a short and thereby start a battery fire. The solution was to let diagnostic software monitor for this defect and alert the owner if detected.\n    However, on July 14, the  NHTSA revealed that it knew of two more Bolt EV fires, both of which had received GM&#39;s fix. On Friday, GM reacted, issuing a second recall—which it says is actually for a second defect. In a statement, the automaker said that &#34;experts from GM and LG have identified the simultaneous presence of two rare manufacturing defects in the same battery cell as the root cause of battery fires in certain Chevrolet Bolt EVs.&#34;\n GM will contact owners of MY2017-2019 Bolt EVs when the replacement battery modules are ready to be installed. Until then, life with an affected car is going to be a lot less convenient than it used to be.\n GM says that owners should once more use Hilltop Reserve mode (MY2017-2018) or Target Charge Level (MY2019) to prevent the battery from charging past 90 percent. Additionally, GM is asking owners to recharge their vehicles after each trip, although they are also asked not to leave their Bolt EVs charging overnight, and the cars should be unplugged immediately after charging and be parked outside. Finally, owners should try to leave at least 70 miles of range in the battery.", "posttime": "2021-07-23 23:15:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "起火,fires,通用汽车", "title": "两次电池起火引发第二次雪佛兰 Bolt EV 召回", "title_en": "Two more battery fires spark second Chevrolet Bolt EV recall", "transed": 1, "url": "https://arstechnica.com/cars/2021/07/chevrolet-issues-second-recall-to-prevent-bolt-ev-battery-fires/", "via": "", "real_tags": ["起火", "fires", "通用汽车"]}, {"category": "", "categoryclass": "", "imagename": "1bef8c83359bd64721eb14881f4d20db.jpg", "infoid": 1069219, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两名参议员正在提出一项新法案，如果社交媒体公司助长有关公共卫生危机（例如 COVID）的错误信息的传播，该法案将取消第 230 条对社交媒体公司的保护。立法者正在继续审查《通信规范法》第 230 条，该条保护 Facebook、谷歌和 Twitter 等公司免于因用户发帖而被起诉。另外，两名参议员现在希望从第 230 条保护用户发布的健康错误信息中创建一个例外。 《健康错误信息法案》由参议员 Amy Klobuchar (D-MN) 和 Ben Ray Lujan (D-NM) 制定。根据 The Verge 的说法，该法案指示卫生与公共服务部长制定和发布关于哪些是关于健康的错误信息的指导方针。 “长期以来，在线平台在保护美国人的健康方面做得不够，”克洛布查尔在一份声明中说。 “这些是世界上一些最大、最富有的公司，他们必须采取更多措施来防止致命的疫苗错误信息的传播。” “冠状病毒大流行向我们展示了错误信息的致命性，我们有责任采取行动，”她继续说道。 Facebook 公共政策副总裁凯文·马丁 (Kevin Martin) 表示，该公司认为该法案可能对科技行业产生积极影响。 “我们长期以来一直支持通用行业标准和第 230 条改革，”他说。 “我们相信澄清与健康相关的错误信息的困难和紧迫的问题会有所帮助，并期待在我们考虑改革方案时与国会和行业合作。”\n按照目前的计划，拟议的法案将使 Facebook 和其他公司承担责任，因为此类健康错误信息与冠状病毒等紧急情况有关。参议员希望第 230 条的例外情况适用于此类错误信息由于社交媒体公司的算法而不是按时间顺序传播而被传播和放大的情况。目前，第 230 条专门保护平台免受在其平台上共享的非法内容的影响。这些变化似乎不太可能通过，因为尚不清楚该提案如何与第一修正案保护相一致。谎言甚至故意的错误信息受到第一修正案的保护，以反对此类法律的制定，并且有数十年的法律先例支持这种观点。该提议是在拜登总统指责 Facebook 和其他平台用错误信息“杀人”几天后提出的。总统后来改写了这一评论，说杀人的不是 Facebook，而是这些平台正在传播和放大的错误信息。 AppleInsider 拥有附属合作伙伴关系，并且可以通过附属链接购买的产品赚取佣金。这些合作伙伴关系不会影响我们的编辑内容。", "note_en": "Two Senators are introducing a new bill that would strip Section 230 protections from social media companies should they facilitate the spread of misinformation about a public health crisis — like COVID.\n  Lawmakers are  continuing to examine Section 230 of the Communications Decency Act, which protects companies such as Facebook, Google, and Twitter against being sued for users&#39; posts. Separately, two Senators now want to create a carveout from the Section 230 protections for health misinformation posted by users.\n The Health Misinformation Act is by Senators Amy Klobuchar (D-MN) and Ben Ray Lujan (D-NM). According to  The Verge, the act directs the Health and Human Services Secretary to  create and issue guidelines on what counts as misinformation about health.\n  &#34;For far too long, online platforms have not done enough to protect the health of Americans,&#34; said Klobuchar in a statement. &#34;These are some of the biggest, richest companies in the world and they must do more to prevent the spread of deadly vaccine misinformation.&#34;\n &#34;The coronavirus pandemic has shown us how lethal misinformation can be and it is our responsibility to take action,&#34; she continued.\n Kevin Martin, Facebook&#39;s vice president of public policy said that the company believes the bill could be positive for the technology industry.\n &#34;We have long supported common industry standards and section 230 reform,&#34; he said. &#34;We believe clarification on the difficult and urgent questions about health related misinformation would be helpful and look forward to working with Congress and the industry as we consider options for reform.&#34;\n As currently planned, the proposed bill would see Facebook, and others, become liable where such health misinformation is related to an emergency such as the coronavirus. Where the senators want the exception to Section 230 to apply is when such misinformation is being spread and amplified because of the social media company&#39;s algorithms, versus a chronological feed.\n At present, Section 230 specifically protects platforms against illegal content being shared on their platforms. The changes seem unlikely to pass, as it isn&#39;t clear how the proposal squares with first amendment protections. Lies and even willful misinformation are protected by the first amendment against law creation such as this, and there are decades of legal precedent supporting that viewpoint.\n The proposal comes just days after President Biden&#39;s accusation that Facebook and other platforms were &#34;killing people&#34; with misinformation. The President later rephrased that comment to say that it isn&#39;t Facebook that is killing people, it is the misinformation that is being circulated and amplified by such platforms.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2021-07-23 23:14:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "希望,social,错误信息", "title": "参议员希望让社交媒体对传播健康错误信息负责", "title_en": "Senators want to make social media liable for spreading health misinformation", "transed": 1, "url": "https://appleinsider.com/articles/21/07/23/senators-want-to-make-social-media-liable-for-spreading-health-misinformation", "via": "", "real_tags": ["希望", "social", "错误信息"]}, {"category": "", "categoryclass": "", "imagename": "153855a7494359e43304c97c8365c8d9.jpg", "infoid": 1069218, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我喜欢电影。我特别喜欢科幻电影，我喜欢引用它们。但我没有意识到引用一部 1984 年的邪教电影会让我在 Facebook 上发帖三天。那是星期三晚上。我们姊妹网站 CNET 的商业总编辑罗素·霍利 (Russell Holly) 在 Facebook 上喜气洋洋地谈论他如何能够看到《沙丘》的先睹为快，这是丹尼斯·维伦纽夫 (Dune) 导演的改编自弗兰克·赫伯特 (Frank Herbert) 1965 年科幻史诗的电影将于 10 月下旬发布。在 1984 年大卫林奇/迪诺德劳伦蒂斯版本的最后一幕中，他的帖子伴随着凯尔麦克拉克伦和斯汀（是的，警察的主唱）的标志性形象，他们用匕首决斗 - 致死。如果你还没有看过 1984 年的电影，你绝对应该看，特别是如果你打算看新版本。布景、演员（包括后来在《星际迷航》中饰演皮卡德船长的帕特里克·斯图尔特）和配乐（由托托乐队创作）都非常棒。虽然这部电影在最初发行时失败了，但林奇的电影在我心中占有重要地位。我打算看新的改编版，但 1984 年的电影对我来说可能仍然是最终版本。我相信很多其他人和我一样对这部电影感到兴奋。因此，我引用了有问题的决斗场景，其中扮演魅力非凡且精神错乱的 Feyd-Rautha Harkonnen 的 Sting 喊道：“我 - 会 - 杀了你。”我什至把它放在引号中，这样我就毫无疑问地引用了这部电影。我什么都没想到。我在晚上剩下的时间里去了。大约一个小时后，Facebook 通知我，我因违反社区标准而被停职三天。\n我很震惊。因引用电影而暂停？甚至不使用任何脏话？这似乎……极端。显然，我无意杀死拉塞尔·霍利，因为我很羡慕他比其他人早几个月看到这部电影。我也不会像 ZDNet 的任何人告诉你的那样，用有毒的匕首谋杀我的编辑同事。 Facebook 上的错误信息对您的健康有害，如果从表面上看甚至会致命 引用电影不会伤害或导致任何人死亡。但是你知道是什么吗？传播有关疫苗和 COVID-19 的错误信息。那绝对会害死人的。 7月20日，互联网新闻监管机构NewsGuard向世界卫生组织提交了一份报告。该报告的结论是：Facebook 不仅未能积极主动地消除有关疫苗和 COVID-19 的错误信息，而且该社交平台正在积极推动并加速其传播。为何如此？ Facebook 上许多代表“红色”分类新闻网站（未能满足 NewsGuard 可信度和透明度的基本标准）的高容量和极受欢迎的页面正在传播虚假信息，并且在医学和科学上完全不准确关于 COVID-19、疫苗、口罩、5G ，以及其他与健康相关的话题。其中许多页面都有数以万计的追随者。当这些页面被 Facebook 用户“喜欢”时，Facebook 的算法会推荐其他发布有关这些主题的错误信息的页面，从而将用户送入一个永无止境的以模因为燃料的恶作剧和阴谋的兔子洞。\n这是在起作用的算法——与决定引用 Sting 和 Dune 是糟糕的并且值得平台暂停的算法完全相同，但疫苗和 COVID-19 恶作剧没有问题。 NewsGuard 发现的这个问题不仅限于推荐页面；推荐专门从事疫苗和 COVID-19 错误信息传播的团体也是一个问题，其中一些团体的成员总数也超过 100,000。好像对人有害吧？ Facebook 不仅不应该推荐这些代表这些网站和他们托管的极端主义团体社区的页面——这些页面发布了有害的错误信息，如果被跟踪，可能会导致疾病、住院和死亡——而且他们不应该允许它们他们的私人运营平台，时期。发布可能会导致人死亡的错误信息？你可以留下来，茁壮成长，建立你的社区，并传播更多虚假的模因，如果他们消费和内化你的宣传，人们可能会死于这些模因。引用你最喜欢的科幻电影？在洞里待了三天。欢迎来到 Facebook 的有毒现实，这是一个社交媒体平台，其激进的审核算法显然已经失控，但认为允许和推荐来自危险的错误信息演员的内容并没有错，这些内容使近 30 亿成员受到伤害。", "note_en": "I love movies. I especially love sci-fi movies, and I love to quote them. But I didn&#39;t realize quoting a cult film from 1984 would get me suspended from posting on Facebook for  three days.\n     It was Wednesday night.  Russell Holly, managing editor for commerce of our sister site, CNET, was beaming on Facebook about how he was able to get in to see a sneak preview of  Dune, the Denis Villeneuve-directed film adaptation of Frank Herbert&#39;s 1965 sci-fi epic that is due for a late October release.\n His post was accompanied by an iconic image of Kyle MacLachlan and Sting (yes, the lead vocalist from  The Police) in the final scene of the 1984 David Lynch/Dino De Laurentis version, in which  they duel with daggers -- to the death.\n If you haven&#39;t seen the 1984 film, you definitely should, especially if you intend to see the new version. The sets, the cast (including Patrick Stewart, who would later play Captain Picard on  Star Trek), and the soundtrack (composed by the band Toto) are fantastic.\n While the movie flopped during its initial release, I have a huge place in my heart for Lynch&#39;s film. I plan to see the new adaptation, but the 1984 film will likely remain the definitive version for me.\n   I&#39;m sure many other people are as excited as I am about this movie. So I quoted the duel scene in question, in which Sting, playing the charismatic and psychotic Feyd-Rautha Harkonnen, shouts,  &#34;I -WILL- kill you.&#34; I even put it in quotes so that there was no question I was quoting the film.\n I thought nothing of it. I went about the rest of my evening. About an hour later, I was notified by Facebook that I was suspended for three days due to violating Community Standards.\n   I was shocked. Suspended for quoting a film? Without even using any obscenities? This seems… extreme.\n Obviously, I had no intention of killing Russell Holly, envious as I was that he got to see this film months before anyone else. I am also not in the practice of murdering my editorial colleagues with poisoned daggers, as anyone at  ZDNet will tell you.\n Misinformation on Facebook is harmful to your health or even fatal if taken at face value\n Quoting movies doesn&#39;t hurt or result in the death of anyone. But do you know what does? Spreading misinformation about vaccines and COVID-19. That absolutely  will kill people.\n On July 20, the  internet news watchdog NewsGuard  presented a report to the World Health Organization. The report&#39;s conclusion:  Not only has Facebook failed to be proactive in the removal of misinformation about vaccines and COVID-19, but the social platform is actively enabling and accelerating its spread.\n  How so? Many high-volume and extremely popular Pages on Facebook representing  &#34;Red&#34; classified news websites (failing to meet NewsGuard basic standards of credibility and transparency) are spreading false information and are outright medically and scientifically inaccurate about COVID-19, vaccines, masks, 5G, and other health-related topics.\n Many of these pages have tens of thousands of followers. When these pages are &#34;liked&#34; by Facebook users, other Pages that publish misinformation about these topics are recommended by Facebook&#39;s algorithm, sending users down a never-ending rabbit hole of meme-fueled hoaxes and conspiracies.\n    It&#39;s the algorithm at work -- the very same algorithm that decided that quoting Sting and  Dune are bad and merit platform suspension, but vaccine and COVID-19 hoaxes are  no problemo.\n  This problem identified by NewsGuard isn&#39;t just limited to recommending Pages; it&#39;s also a problem with recommending Groups specializing in vaccine and COVID-19 misinformation spread, some of which also have members totaling over 100,000.\n Seems harmful to people, right? Not only should Facebook  not be recommending these pages representing these websites and these extremist Group communities they are hosting -- which are posting harmful misinformation that could result in sickness, hospitalization, and death if followed -- but they   shouldn&#39;t be allowing them on their privately run platform, period.\n Post misinformation that potentially kills people? You get to stay, thrive, build your community, and spread even more bogus memes that people can die from if they consume and internalize your propaganda. Quote your favorite sci-fi film? Three days in the hole.\n Welcome to the toxic reality of Facebook, a social media platform that is clearly out of control with its aggressive moderation algorithm and yet sees nothing wrong with allowing and recommending content from dangerous misinformation actors that put its nearly three billion members in harm&#39;s way.", "posttime": "2021-07-23 23:14:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,facebook,covid,quoting,电影", "title": "在 Facebook 上，引用“沙丘”会让你暂停，而发布 COVID 和疫苗错误信息会让你被推荐 |中德网", "title_en": "On Facebook, quoting 'Dune' gets you suspended while posting COVID and vaccine misinformation gets you recommended | ZDNet", "transed": 1, "url": "https://www.zdnet.com/article/on-facebook-quoting-dune-gets-you-suspended-while-posting-covid-and-vaccine-misinformation-gets-you-recommended/", "via": "", "real_tags": ["发布", "facebook", "covid", "quoting", "电影"]}, {"category": "", "categoryclass": "", "imagename": "c632cb0ae481cef96f512d7371d8a58f.jpg", "infoid": 1069217, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天通过 X 博客揭开面纱，Intrinsic 肯定符合要求。事实上，这对谷歌来说是一种理想的选择。实际上，X 开发树的最新分支与工业机器人软件有关——这些大型重型机器可能不像许多制造商希望的那样灵活。该职位由 Alphabet Moonshots 副总裁 Wendy Tan-White 执笔，他现在拥有 Intrinsic CEO 的头衔。关于公司的起源，SAAS 网站建设者 Moonfruit 的联合创始人写道，在过去的几年里，我们的团队一直在探索如何让工业机器人在完成任务时能够感知、学习和自动调整，所以他们在更广泛的设置和应用程序中工作。我们与 Alphabet 的各个团队以及我们在实际制造环境中的合作伙伴合作，一直在测试使用自动感知、深度学习、强化学习、运动规划、模拟和力控制等技术的软件。那里有一个充满活力的初创公司社区，他们希望增强大型重型机器人技术，包括 Veo、Symbio 和 Covariant 之类的公司。很多时候，这些公司专注于一个特定的元素，比如 Veo 的人机交互安全协议。可以说，Intrisic 似乎正在这里拍摄月球，计划同时处理许多不同的问题。 “我们正在开发旨在使工业机器人（用于制造从太阳能电池板到汽车的一切事物）更易于使用、成本更低和更灵活的软件工具，以便更多的人可以使用它们来制造新产品、业务和服务，”谭-怀特写道。当然，谷歌有资金和能力吸引人才在那里取得一些进展，即使有许多竞争对手领先。尽管Intrinsic 也不是全新的。该公司显然一直在习惯的 Google X 隐身模式下工作五年半，在向全世界宣布之前，它显然希望展示自己的努力。这一消息也标志着 Intrinsic 作为一家“独立”Alphabet 公司的首次亮相，将登月领域抛在后面，因为它似乎是汽车、医疗保健和电子领域的合作伙伴，以帮助证明其技术。", "note_en": "Unveiled today  through the X blog, Intrinsic certainly fits the bill. In fact, it’s kind of an ideal take for Google. Effectively, the latest branch of the X Development tree is concerned with software for industrial robotics – those  big, heavy machines that are perhaps not as nimble as many manufacturers would like.\n   The post is penned by Wendy Tan-White, a VP of Moonshots at Alphabet, who now has the title of Intrinsic CEO. Of the company’s origins, the cofounder of SAAS website builder Moonfruit writes,\n Over the last few years, our team has been exploring how to give industrial robots the ability to sense, learn, and automatically make adjustments as they’re completing tasks, so they work in a wider range of settings and applications. Working in collaboration with teams across Alphabet, and with our partners in real-world manufacturing settings, we’ve been testing software that uses techniques like automated perception, deep learning, reinforcement learning, motion planning, simulation, and force control.\n There’s a vibrant community of startups out there looking to augment big, heavy robotics, including the likes of Veo, Symbio and Covariant. Often times, these companies focus on one specific element, like Veo’s safety protocols from human-robotic interactions. Fittingly, Intrisic appears to be shooting the moon here, so to speak, with plans to take a number of different issues at once.\n  “We’re developing software tools designed to make industrial robots (which are used to make everything from solar panels to cars) easier to use, less costly and more flexible, so that more people can use them to make new products, businesses and services,” Tan-White writes.\n Certainly Google has the capital and ability to attract talent to make some headway there, even if there are a number of competitors who have a head start. ThoughIntrinsic isn’t exactly brand new, either. The company has apparently been working in customary Google X stealth mode for a five-and-a-half years per the post — it clearly wanted something to show for its efforts before announcing itself to the world.\n The news also marks Intrinsic’s debut as an “independent” Alphabet company, leaving the moonshot area behind as it seems partners in automotive, healthcare and electronics to help prove out its technologies.", "posttime": "2021-07-23 23:14:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,intrinsic", "title": "Alphabet 的 Intrinsic 旨在让工业机器人更有能力", "title_en": "\n\t\t\t\tAlphabet’s Intrinsic aims to make industrial robots more capable\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/23/alphabets-intrinsic-aims-to-make-industrial-robots-more-capable/", "via": "", "real_tags": ["机器人", "intrinsic"]}, {"category": "", "categoryclass": "", "imagename": "f1d30052fda582acc6e00bbe3326da90.png", "infoid": 1069216, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "传播和管理恶意软件的威胁行为者长期以来一直滥用合法的在线服务。正如我们在调查恶意软件使用 TLS 时发现的那样，恶意软件产生的网络流量中有一半以上使用 TLS 加密，其中 20% 涉及恶意软件与合法在线服务通信。在该研究的时间范围内，我们发现 TLS 保护的恶意软件下载总量的 4% 来自一项特别是一项服务：Discord。以游戏为中心的文本和语音聊天平台的日益流行也引起了恶意软件运营商的注意。 Discord 运营着自己的内容交付网络（CDN），用户可以在其中上传文件与他人共享。该服务还发布了一个 API，使开发人员能够创建新的方式与 Discord 进行交互，而不是通过其客户端应用程序进行交互。我们观察到大量恶意软件托管在 Discord 自己的 CDN 中，以及与 Discord API 交互以发送和接收数据的恶意软件。几个密码劫持恶意软件系列专门针对 Discord 帐户。 SophosLabs 还发现恶意软件利用 Discord 聊天机器人 API 进行命令和控制，或将窃取的信息泄露到私有 Discord 服务器或渠道中。由于该服务的起源与在线游戏有关，因此 Discord 的受众包括大量游戏玩家，包括 Fortnite、Minecraft 或 Roblox 等面向青年的游戏玩家。在我们在 Discord 网络中发现的恶意文件中，我们发现了针对游戏中与 Discord 集成的游戏的游戏作弊工具。据称，这些工具利用 Discord 协议中的弱点，使一名玩家有可能使另一名玩家的游戏崩溃。我们还发现应用程序只不过是无害但具有破坏性的恶作剧。但我们发现的最大比例的恶意软件侧重于凭据和个人信息盗窃、各种窃取恶意软件以及更通用的 RAT。这些操作背后的威胁行为者利用社会工程来传播窃取凭证的恶意软件，然后使用受害者获得的 Discord 凭证来瞄准其他 Discord 用户。我们还遇到了托管在 Discord CDN 中的几个勒索软件系列——大部分是旧的，只能造成伤害，因为不再有支付赎金的方法。 Discord 上托管的文件还包括多个 Android 恶意软件包，从间谍软件到窃取财务信息或交易的虚假应用程序。\n滥用 Discord 就像滥用任何基于 Web 的服务一样，并不是一种新现象，但它是一个快速增长的现象：Sophos 产品被检测到并被阻止，仅在过去两个月中，检测数量是同期的近 140 2020 年期间。4 月，我们向 Discord 代表报告了超过 9,500 个在 Discord 的 CDN 上托管恶意软件的唯一 URL。在第二季度，我们在 Discord 的 CDN 中检测到 17,000 个指向恶意软件的唯一 URL。这不包括未托管在 Discord 中的恶意软件，它们以各种方式利用 Discord 的应用程序接口。就在发布时间之前，这些 URL 中有超过 4,700 个指向恶意 Windows .exe 文件，仍然处于活动状态。这种增长的原因似乎很容易理解。 Discord 提供了一个持久的、高度可用的全球分发网络，恶意软件操作者可以利用它，以及一个可以轻松适应恶意软件命令和控制的消息传递 API——很像 Internet Relay Chat，以及最近的 Slack 和Telegram，已被用作C2频道。它还为诈骗者和恶意软件运营商提供了一个不断增长的、目标丰富的环境，以传播恶意代码，以通过社会工程窃取个人信息和凭据。一些 Discord 用户显然是出于恶意而不是为了经济利益寻求使用该平台来伤害他人的计算机。 Discord 并不是恶意软件分发者和诈骗者以任何方式滥用的唯一服务，该公司对删除请求做出了响应。但是 Discord 用户应该对服务上恶意内容的威胁保持警惕，并且防御者不应根据服务本身的合法性将来自云服务的任何流量视为本质上是“安全的”。使用最新的遥测数据，我们能够从这些 URL 中检索到数千个独特的恶意软件样本和 400 多个存档文件——这一计数并不代表整个恶意软件语料库，因为它不包括 Discord 删除的文件（或由最初上传它们的演员）。这些已向 Discord 披露，其中大部分已被删除；然而，新的恶意软件继续发布到 Discord 的 CDN 中，我们继续发现使用 Discord 作为命令和控制网络的恶意软件。 Discord 是一项基于云的服务，针对感兴趣社区内的大量文本和语音消息进行了优化。 Discord 从通过该平台提供的优质服务中获得收入，包括“服务器提升”，允许群组提高其服务器实例的实时流媒体和语音聊天的性能并添加自定义功能。\n但是基本平台——包括对 Discord 应用程序编程接口 (API) 的访问——是免费的。 Discord 服务器，包括免费服务器，也可以配置为与第三方应用程序交互——将内容发布到服务器频道的机器人、提供构建在 Discord 之上的附加功能的应用程序以及直接连接到 Discord 消息平台的游戏。 Discord 的“服务器”是由 Cloudflare 前端的 Elixir Erlang 虚拟机的 Google Cloud 实例。服务器可以是公共的或私有的——服务器“所有者”可以要求个人加入服务器频道和访问内容的邀请密钥。除了消息和流路由，Discord 还充当所有类型数字内容的内容交付网络。在最简单的形式中，该内容是消息附件——由 Discord 用户上传到聊天或私人消息中的文件。 Discord 使用 Google Cloud Storage 来存储文件附件；一旦文件作为消息的一部分被上传，就可以通过代表存储对象地址的 URL 从网络上的任何地方访问它。与 Discord 的服务器实例一样，存储对象由 Cloudflare 前端处理。这种架构使 Discord 具有足够的可扩展性，可以处理其数亿活跃用户，并且能够抵御拒绝服务攻击——这是与游戏社区打交道的一个优势。它还使其成为恶意行为者滥用的理想平台。文件上传到 Discord 后，除非报告或删除，否则它们可以无限期保留。虽然 Discord 具有一些恶意软件筛选功能，但许多类型的恶意内容会在没有通知的情况下溜走。当用户被抓住时，他们可以烧毁他们的帐户并创建一个新帐户。 Discord 在很大程度上依赖于用户向警察滥用行为的报告。但是，当 Discord 架构用于仅限于不一定在 Discord 用户社区内的目标的活动时，它们可能不会被报告并持续数月。我们观察到从 Discord 的 CDN 部署恶意软件的主要方式之一是通过社交工程——使用聊天频道或私人消息发布带有欺骗性描述的文件或外部链接，以诱使他人下载并执行它们。我们发现了许多文件，其名称表明它们为游戏玩家提供了一些功能，其中一些实际上是：游戏作弊、声称能够解锁付费内容的游戏“增强”、许可证密钥生成器和绕过。但是，虽然有些实际上是广告宣传的内容，但其中绝大多数实际上是另一种黑客行为——旨在以一种或另一种形式窃取凭据。这些凭据窃取者中有很大一部分以 Discord 本身为目标。 Discord 令牌记录器窃取用于对 Discord 用户进行身份验证的 OAuth 令牌，以及其他凭据数据和系统信息，包括 Steam 和其他游戏平台的令牌。他们通过 webhook 连接将被盗的令牌“记录”回 Discord 频道，允许他们的操作员收集 OAuth 令牌并试图劫持对帐户的访问。\n构建令牌记录器的学习曲线不是很陡峭。可以在 GitHub 上找到基于 Python 的概念验证令牌记录器，并且可以轻松地将其转换为定制的可执行文件，以便与恶意软件操作员选择的服务器进行通信。一个活跃的令牌记录器活动已经通过一个持续的社会工程骗局利用被盗帐户传播，要求用户测试正在开发的游戏。 “游戏”是一个类似于概念证明的编译后的 Python 脚本。一旦凭据被盗，它们通常被用来通过社会工程继续窃取其他凭据。令牌记录器还收集机器指纹数据，并尝试从目标机器上刮取其他 cookie 和凭证令牌，因此可能造成的损失不仅仅是帐户丢失。另一个被作者命名为 PirateMonsterInjector 的窃取者使用 Discord 自己的 API 将 Discord OAuth 令牌和其他被盗信息转储回私人 Discord 服务器聊天。它通过从包含 Discord API 代码的恶意网站 (monster[.]casa) 检索 JavaScript 并从与 Discord 和其他应用程序相关的系统中抓取数据来实现这一点。其他凭据窃取计划走得更远。几个恶意软件文件还提取了有效负载可执行文件和/或 DLL，然后他们将其用于更广泛的数据盗窃。文件中散布着许多被称为 Agent Tesla 的广泛使用的窃取恶意软件的副本。在一个示例中，传播感染的初始文件名为 PURCHASE_ORDER_1_1.exe。 Agent Tesla 恶意软件在其感染过程中下载有效载荷的情况并不少见，但意外地发现该有效载荷也托管在 DIscord 的 CDN 中。该恶意软件直接从 CDN 中拉取名为midnight.exe 的有效负载可执行文件并执行它。反过来，该有效载荷从另一个网站下载了一个名为 TextEditor.dll 的 DLL，并将其注入到正在运行的系统进程中。 （我们之前已经写过 Agent Tesla 的功能。）在另一个例子中，我们发现了 Minecraft 修改版的恶意安装程序。安装程序实际上确实提供了无处不在的创意积木游戏的完整版本，但有所不同。 Minecraft 安装程序伪装成具有称为 Saint 的特殊功能的“mod”，捆绑了一个 Java 应用程序，该应用程序能够从目标系统中捕获按键和屏幕截图，以及来自受感染计算机上的摄像头的图像。文件中的 Java 类清楚地表明了恶意软件的功能。\n我们发现了许多使用文件名窃取恶意软件和后门信息的实例，表明它们被用作社会工程活动的一部分。一个名为 fortniat.exe 的文件，被宣传为“FortNite 的多工具”，实际上是一个恶意软件打包程序，它会投放一个 Meterpreter 后门。我们发现的另一个恶意软件样本将自己宣传为 Browzar 的安装程序，Browzar 是一个面向隐私的网络浏览器。但是，在安装浏览器的同时，它还删除了 Agent Tesla 信息窃取程序。还有一些文件声称安装了流行（但昂贵）商业软件的破解版，例如 Adob​​e Photoshop。当然，还有一些工具声称可以让用户访问 Discord Nitro（该服务的高级版）的付费功能。该集合中至少有 50 个文件被命名为暗示它们可以在属于未订阅 100 美元/年服务的用户的帐户上解锁 Discord Nitro 的功能，或者生成“礼品代码”以奖励1 个月的 Nitro 升级。许多工具将自己称为“氮”实用程序，是 Nitro 和“代码生成器”的串联。虽然一些文件生成的代码类似于用于将标准 Discord 帐户升级到 Discord Nitro 版本的代码，但大多数没有。其中一个示例删除了一个批处理脚本，该脚本试图删除注册表项并终止数十个端点安全工具的进程或服务。这个“antiav.bat”脚本在用户启动程序后立即从系统上的 %TEMP% 目录运行。同一个“nitrogen”实用程序的批处理脚本禁用了许多关键的 Windows 安全功能，Windows 提示用户重新启动计算机“关闭用户帐户控制”这一事实证明了这一点，该功能提示 Windows 用户允许应用程序以提升的权限运行。如果没有 UAC，可执行文件可以使用管理权限运行，而无需用户允许。许多程序使用各种方法来分析受感染的系统并生成他们试图上传到命令和控制服务器的数据文件。由于如此多的文件已存在数月，目标服务器没有响应，但我们可以观察到正在写入硬盘驱动器的分析数据。\n除了对系统进行分析外，许多样本还试图检索浏览器“令牌”，这些令牌将允许其操作员使用受害者的帐户登录 Discord，或者安装了按键记录器组件来监视用户输入并试图将其传递给命令和控制服务器。大多数令牌窃取者未能从测试台检索令牌，因为 Discord Windows 应用程序使用了测试系统上用于 Discord 的唯一凭据；假受害者从未使用浏览器登录过该服务。在许多情况下，这些令牌值通过使用 Discord 自己的 API，通过对 Discord 上特定 URL 的 HTTPS POST 请求直接发送到其他 Discord 频道或用户帐户。有时，我们还会偶然发现一个恶意软件，它试图将数据发送到 Slack 上的一个频道。其中一些“令牌窃取者”恶意软件包括受害者的头像和他们面向公众的 IP 地址，他们使用 ifconfig.me、ipify.org、iplogger.com 或 wtfismyip.com 等服务检索到这些 IP 地址。这些更复杂的窃取者能够从 Discord 客户端应用程序中提取令牌，而不仅仅是浏览器。然后，窃取者会向特定的 Discord 频道 URL 生成格式良好的提交。一些窃取者试图直接从 Github 或 Pastebin 下载恶意的 Visual Basic 脚本文件。幸运的是，在这些情况下，这些站点已经锁定或删除了有效负载脚本，因此窃取者未能完成其任务。还有其他恶意软件通过 Discord 分发，标有与游戏相关的名称，显然只是为了损害他人的计算机。 O 一个标记为“Roblox_hack.exe”的文件实际上携带了 WinLock 勒索软件的变种，这是我们在 Discord 的 CDN 中发现的几种勒索软件变种之一。这种勒索软件不是加密文件，而是将受害者锁定在桌面环境之外。在 Discord 的 CDN 中也广泛出现的另一个屏幕锁恶意软件家族是 Somhoveran / LockScreen，它为赎金威胁增加了倒计时。 Somhoveran 使用 Windows Management Instrumentation 收集受影响系统的“指纹”，并在屏幕上显示其中的一些数据。\n我们在 Discord 的 CDN 中发现了一个更令人讨厌的旧勒索软件样本：Petya，一种于 2016 年首次出现的加密勒索软件。由于 Petya 的 Tor 站点已死，目前尚不清楚此文件是否出于敲诈的意图共享它的目的是简单地禁用收件人的计算机。大多数反恶意软件产品（包括 Windows Defender）都会阻止 Petya，因此对于大多数 Windows 机器来说，这不仅仅是一种威胁，而是一种好奇心——但它仍然对较旧的计算机具有潜在危害，并且在确信它需要运行的人手中提高游戏性能。 Discord 的恶意软件问题不仅仅基于 Windows。通过遥测，我们发现了 58 个可以在 Android 设备上运行的独特恶意应用程序。其中包括许多以银行业为重点的恶意软件和间谍软件，如下面的 Sophos 检测所示： 在我们 90 天的遥测回顾中，我们在 Discord 域中发现了 205 个指向 Android .apk 可执行文件的 URL（具有指向重复文件的多个冗余链接） ）。在向 Discord 报告列表后，该服务删除了这些文件，但几周后的后续查询显示，同时出现了更多文件。在发布之前可用的应用程序中有一个执行欺诈性广告点击的应用程序（归类为 Andr/Hiddad-P）；在设备上投放其他恶意软件（Andr/Dropr-IC 和 Andr/Dropr-IO）的应用程序；允许远程攻击者访问受害者移动设备的后门，包括一个透明的 Metasploit 框架 Meterpreter（Andr/Bckdr-RXM 和 Andr/Spy-AZW）；以及 Anubis 银行家木马 (Andr/Banker-GTV) 的副本，该木马拦截并将在线金融交易的凭据转发给犯罪分子。 Android 恶意软件文件的名称和图标可能会让人相信它们是合法的银行或游戏更新程序应用程序。其中一个应用程序似乎使用了 COVID-19 联系人跟踪应用程序的图标和名称。设备中生成了几个弹出窗口，要求用户将它们激活为“设备管理员”，这使应用程序几乎可以完全控制设备。与任何对开发人员友好的平台一样，这些功能也很容易被滥用。我们发现的恶意应用程序包括宣传为游戏作弊的应用程序——改变或影响游戏环境的程序。例如，“Conrado&#39;s FiveM Crasher”是托管在社区运行服务器上的侠盗猎车手多人游戏服务器的游戏作弊，它从 FiveM 与 Discord 的集成中提取数据，以在游戏中“崩溃”附近的玩家：\n我们检索到的基于 Linux 的恶意档案之一是这个名为virus_de_prost_ce_esti.rar 的文件，它从原始的罗马尼亚语翻译成你是多么愚蠢的病毒。该档案的内容包括 11 个 ELF 二进制文件、7 个文本文件（包含一长串 IP 地址）以及一个以各种顺序执行它们的 Python 脚本。该软件包的目的是破坏游戏服务器，导致它们滞后或崩溃。 Python 脚本的内部评论表明它旨在攻击托管在两个平台上的服务器：Amazon 的 AWS 和 NFO Servers（为 MineCraft、Counter Strike、Battlefield、Medal of Honor 和其他多人游戏托管私人游戏服务器的服务）。 Discord 通过删除我们报告给他们的大部分恶意文件来回应我们的报告。根据一些通讯，该公司目前正在内部努力提升他们的安全状况。但该平台仍然是恶意软件的倾倒场。即使对于未托管在 Discord 上的恶意软件，Discord API 也是恶意命令和控制网络功能的沃土，这些功能将自身隐藏在 Discord 受 TLS 保护的网络流量中（以及服务声誉的背后）。虽然 Discord 上的一些恶意软件显然是专门用来禁用计算机或破坏游戏玩家访问他们选择的平台的能力，但信息窃取者、远程访问工具和其他犯罪恶意软件的盛行所带来的风险远远超出了游戏爱好者领域。随着越来越多的组织将 Discord 用作低成本协作平台，丢失 Discord 凭证可能造成的危害为组织打开了更多的威胁媒介。即使您家中或办公室中没有 Discord 用户，恶意软件运营商滥用 Discord 也会构成威胁。端点保护（以及企业级别的 TLS 检查）可以提供针对......的保护。", "note_en": "Threat actors who spread and manage malware have long abused legitimate online services. As we found during  our investigation into the use of TLS by malware, more than half of network traffic generated by malware uses TLS encryption, and 20 percent of that involved the malware communicating with legitimate online services.\n During the timeframe of that research, we found that four percent of the overall TLS-protected malware downloads came from one service in particular: Discord. The growing popularity of the game-centric text and voice chat platform has not failed to draw the attention of malware operators.\n Discord operates its own content delivery network, or CDN, where users can upload files to share with others. The service also publishes an API, enabling developers to create new ways to interact with Discord other than through its client application. We observed significant volumes of malware hosted in Discord’s own CDN, as well as malware interacting with Discord APIs to send and receive data.\n  Several password-hijacking malware families specifically target Discord accounts. SophosLabs also found malware that leveraged Discord chat bot APIs for command and control, or to exfiltrate stolen information into private Discord servers or channels.\n As the origins of the service were tied to online gaming, Discord’s audience includes large numbers of gamers—including players of youth-oriented titles such as Fortnite, Minecraft, or Roblox. Among the malicious files we discovered in Discord’s network, we found game cheating tools that target games that integrate with Discord, in-game. The tools allegedly make it possible, exploiting weaknesses in Discord’s protocols, for one player to crash the game of another player. We also found applications that serve as nothing more than harmless, though disruptive, pranks.\n But the greatest percentage of the malware we found have a focus on credential and personal information theft, a wide variety of stealer malware as well as more versatile RATs. The threat actors behind these operations employed social engineering to spread credential-stealing malware, then use the victims’ harvested Discord credentials to target additional Discord users.\n We also encountered several ransomware families hosted in the Discord CDN—largely older ones, usable only to cause harm, as there’s no longer a way to pay the ransom. Files hosted on Discord also included multiple Android malware packages, ranging from spyware to fake apps that steal financial information or transactions.\n  Abuse of Discord, like abuse of any web-based service, is not a new phenomenon, but it is a rapidly growing one: Sophos products detected and blocked, just in the past two months, nearly 140 times the number of detections over the same period in 2020. In April, we reported over 9,500 unique URLs hosting malware on Discord’s CDN to Discord representatives.\n In the second quarter, we detected 17,000 unique URLs in Discord’s CDN pointing to malware. And this excludes the malware not hosted within Discord that leverage Discord’s application interfaces in various ways. At just prior to publication time, more than 4,700 of those URLs, pointing to a malicious Windows .exe file, remained active.\n  The reasons for that growth seem pretty easy to understand. Discord provides a persistent, highly-available, global distribution network that malware operators can take advantage of, as well as a messaging API that can be adapted easily to malware command and control—much in the way Internet Relay Chat, and more recently Slack and Telegram, have been used as C2 channels.\n It also provides an ever-growing, target-rich environment for scammers and malware operators to spread malicious code to steal personal information and credentials through social engineering. And some Discord users clearly seek to use the platform to harm others’ computers out of spite rather than for financial gain.\n Discord is not the only service being abused by malware distributors and scammers by any means, and the company is responsive to take-down requests. But Discord users should remain vigilant to the threat of malicious content on the service, and defenders should never consider any traffic from a cloud service as inherently “safe” based on the legitimacy of the service itself.\n Using the most recent telemetry data, we were able to retrieve thousands of unique malware samples and more than 400 archive files from these URLs—a count that does not represent the whole corpus of malware, as it does not include files that were removed by Discord (or by the actors who originally uploaded them). These have been disclosed to Discord, and the majority of them have since been removed; however, new malware continues to be posted into Discord’s CDN, and we continue to find malware using Discord as a command and control network.\n  Discord is a cloud-based service optimized for high volumes of text and voice messaging within communities of interest. Discord gets revenue from premium services delivered through the platform, including “server boosts” that allow groups to increase the performance of their server instances’ live streaming and voice chat and add custom features.\n But the basic platform—which includes access to the Discord application programming interface (API)—is free. Discord servers, including the free ones, can also be configured to interact with third-party applications—bots that post content to server channels, apps that provide additional functionality built on top of Discord, and games that directly connect to Discord’s messaging platform.\n Discord’s “servers” are Google Cloud instances of Elixir Erlang virtual machines, front-ended by Cloudflare. Servers can be public or private—a server “owner” can require invite keys for individuals to join the server’s channels and access content.\n  In addition to message and stream routing, Discord also acts as a content delivery network for digital content of all types. In its simplest form, that content is message attachments—files that are uploaded by Discord users into chat or private messages. Discord uses Google Cloud Storage to store file attachments; once a file has been uploaded as part of a message, it is accessible from anywhere on the web via a URL representing a storage object address. Like Discord’s server instances, the storage objects are front ended by Cloudflare.\n This architecture makes Discord scalable enough to handle its hundreds of millions of active users, and resilient against denial-of-service attacks—a plus for dealing with the gaming community. It also makes it an ideal platform for abuse by malicious actors. Once files are uploaded to Discord, they can persist indefinitely unless reported or deleted.\n While Discord has some malware screening capabilities, many types of malicious content slip by without notice. And when users get caught, they can burn their account and create a new one. Discord relies heavily on user reports to police abuse. But when the Discord architecture is used for activities that are limited to targets not necessarily within the Discord user community, they can go unreported and persist for months.\n  One of the primary ways we’ve observed malware being deployed from Discord’s CDN is through social engineering—using chat channels or private messages to post files or external links with deceiving descriptions as a lure to get others to download and execute them. We found many files whose names suggested they served some function for gamers, and some in fact were: game cheats, game “enhancements” that claimed to be able to unlock paid content, license key generators and bypasses. But while some were actually what was advertised, the vast majority of them were in fact hacks of another kind—intended for one form or another of credential theft.\n A significant percentage of these credential stealers target Discord itself. Discord token loggers steal the OAuth tokens used to authenticate Discord users, frequently along with other credential data and system information—including tokens for Steam and other gaming platforms. They “log” stolen tokens back to a Discord channel through a webhook connection, allowing their operators to collect the OAuth tokens and attempt to hijack access to the accounts.\n The learning curve for building a token logger is not very steep. A Python-based proof-of-concept token logger can be found on GitHub and easily turned into an executable customized to communicate with the server of the malware operator’s choice. One active token logger campaign has been spread through an ongoing social engineering scam leveraging stolen accounts, asking users to test a game in development. The “game” is a compiled Python script similar to the proof of concept.\n  Once credentials are stolen, they are often used to continue to steal other credentials through social engineering. The token logger also collects machine fingerprint data, and attempts to scrape other cookies and credential tokens from the target’s machine as well, so there may be more damage done than just the loss of an account.\n Another stealer, named PirateMonsterInjector by its author, uses Discord’s own API to dump Discord OAuth tokens and other stolen information back to a private Discord server chat. It does this by retrieving JavaScript from a malicious website (monster[.]casa) that contains Discord API code and scrapes data from the system related to Discord and other applications.\n     Other credential-stealing schemes go further.  Several of the malware files also pulled down payload executables and/or DLLs which they then used to engage in a more wide-ranging data theft.\n  Scattered among the files were many copies of a widely-used stealer malware known as Agent Tesla. In one example, the initial file that spread the infection was named PURCHASE_ORDER_1_1.exe. It’s not unusual for Agent Tesla malware to download payloads as part of its infection process, but it was unexpected to find that the payload was also hosted in DIscord’s CDN.\n  The malware pulled down a payload executable named midnight.exe directly from the CDN, and executed it. That payload, in turn, downloaded a DLL named TextEditor.dll from a different website, and injected it into a running system process. (We’ve  previously written about Agent Tesla’s capabilities.)\n In another instance, we found a malicious installer of a modified version of Minecraft. The installer actually does deliver a full version of the ubiquitous creative block-building game, but with a twist. Disguised as a “mod” with special features called Saint, the Minecraft installer bundled a Java application that was capable of capturing keystrokes and screenshots from the target’s system, as well as images from the camera on the infected computer. The Java classes inside the file are an unmistakable indication of the malware’s capabilities.\n  We found many instances of information stealing malware and backdoors using file names that indicated they were used as part of soclal engineering campaigns. A file called  fortniat.exe, advertised as a “multitool for FortNite,” was actually a malware packer that drops a Meterpreter backdoor.\n  Another malware sample we found advertised itself as an installer for Browzar, a privacy-oriented web browser. But while it installed the browser, it also dropped an Agent Tesla infostealer.\n    There were also collections of files that purport to install cracked versions of popular (but expensive) commercial software, such as Adobe Photoshop. And, of course, there were tools that claim to give the user access to the paid features of Discord Nitro, the service’s premium edition.\n  At least fifty of the files in the collection were named to imply they could either unlock the features of Discord Nitro on an account belonging to a user who hasn’t subscribed to the $100/year service, or generate “gift codes” that award a one-month Nitro upgrade. Many of the tools refer to themselves as a “nitrogen” utility, a concatenation of Nitro and “code generator.”\n While a few of the files generated codes that resemble those used to upgrade a standard Discord account to the Discord Nitro version, most did not. One of the samples drops a batch script that attempts to delete registry keys and terminate the processes or services of dozens of endpoint security tools. This “antiav.bat” script runs from the %TEMP% directory on the system immediately after the user launches the program.\n The same “nitrogen” utility’s batch script disabled a number of key Windows security features, evidenced by the fact that Windows prompts the user to reboot the computer “to turn off User Account Control,” the feature that prompts a Windows user to permit an application to run with elevated privileges. Without UAC, executables can run with administrative privileges without requiring the user to allow it.\n  Many of the programs used a variety of methods to profile the infected system and generate a data file they attempt to upload to a command-and-control server. Because so many of the files had been there for months, the destination servers did not respond, but we could observe the profiling data being written to the hard drive.\n In addition to profiling the system, many of the samples attempted to retrieve browser “tokens” that would permit their operators to log in to Discord using the victim’s account, or installed keystroke logger components that monitored for user input and attempted to pass it along to a command and control server. Most of the token stealers failed to retrieve a token from the testbed because the only credentials used for Discord on the test system were used in the Discord Windows app; The faux victim had never logged in to the service using the browser.\n In many cases, these token values were sent directly to other Discord channels or user accounts through the use of Discord’s own API, by means of an HTTPS POST request to a specific URL on Discord. Occasionally, we’d also stumble across a malware that attempted to send the data to a channel on Slack.\n Some of these “token stealer” malware include the victim’s avatar graphic, and their public-facing IP address, which they retrieved using services like  ifconfig.me, ipify.org, iplogger.com, or  wtfismyip.com. These more sophisticated stealers were able to extract the token from the Discord client application, not just the browser.\n The stealer would then produce a nicely formatted submission to a specific Discord channel URL.\n Some of the stealers attempted to download a malicious Visual Basic Script file directly from Github or from Pastebin. Fortunately, in those cases, the sites had already locked or taken down the payload script, so the stealer failed to complete its task.\n  There were other malware distributed via Discord labeled with gaming-related names that were clearly intended just to harm the computers of others. O And a file labeled “Roblox_hack.exe” actually carried a variant of WinLock ransomware, one of several ransomware variants we found in Discord’s CDN. Rather than encrypting files, this ransomware locks the victim out of the desktop environment.\n  Another family of screen locker malware was also widely represented in Discord’s CDN is Somhoveran / LockScreen, which adds a countdown to the ransom threat. Somhoveran uses Windows Management Instrumentation to collect a “fingerprint” of the affected system, and displays some of that data on the screen.\n There is one even nastier old ransomware sample we found in Discord’s CDN: Petya, a crypto-ransomware first seen in 2016.\n Since the Tor site for Petya is dead, it’s not clear if this file was shared with the intent of extortion, or if it was meant to simply disable the recipient’s computer. Most antimalware products (including Windows Defender) will block Petya, so this is a curiosity more than a threat for the majority of Windows machines—but it’s still potentially hazardous to older computers and in the hands of someone who is convinced it needs to run to improve game performance.\n  Discord’s malware problem isn’t just Windows-based. Hunting through telemetry, we found 58 unique malicious apps that can be run on Android devices. These included a number of banking-focused malware and spyware, as indicated by the Sophos detections below:\n   In our 90 day telemetry lookback, we found 205 URLs on the Discord domain pointing to Android .apk executables (with multiple, redundant links to duplicate files). After reporting the list to Discord, the service took down the files, but a subsequent query a few weeks later showed that more appeared in the meantime.\n  Among those remaining available just prior to publication were an app that performs fraudulent ad-clicking (classified as Andr/Hiddad-P); apps that drop other malware (Andr/Dropr-IC and Andr/Dropr-IO) on the device; backdoors that permit a remote attacker to access the victim’s mobile device, including one that was transparently a Metasploit framework Meterpreter (Andr/Bckdr-RXM and Andr/Spy-AZW); and a copy of the  Anubis banker Trojan (Andr/Banker-GTV) that intercepts and forwards the credentials for online financial transactions to criminals.\n  The Android malware files were given names and icons that could lead someone to believe they are legitimate banking or game updater apps. One of the apps appeared to use the icon and name of a COVID-19 contact tracing app. Several generated popups within the device that demanded that the user activate them as a “device admin,” which gives the apps near-total control over the device.\n   Like any developer-friendly platform, these features are ripe for abuse. Among the malicious applications we uncovered were applications advertised as game cheats—programs that alter or affect the gameplay environment. For example, “Conrado’s FiveM Crasher”, a game cheat for Grand Theft Auto multiplayer servers hosted on community-run servers, pulls data from FiveM’s integration with Discord to “crash” players nearby in gameplay:\n   One of the Linux-based malicious archives we retrieved was this file, named  virus_de_prost_ce_esti.rar, which translates from the original Romanian language to  what a stupid virus you are. The contents of this archive included 11 ELF binaries, 7 text files (containing long lists of IP addresses), and a Python script that executes them in various sequences. The intent of the package was to disrupt game servers, causing them to lag or crash.\n  The Python script’s internal comments indicate that it was designed to attack servers hosted on two platforms: Amazon’s AWS, and  NFO Servers (a service that hosts private game servers for MineCraft, Counter Strike, Battlefield, Medal of Honor and other multiplayer games).\n  Discord responded to our reports by taking down most of the malicious files we reported to them. According to some communications, the company is currently making efforts internally to elevate their security posture. But the platform remains a dumping ground for malware. And even for malware not hosted on Discord, the Discord API is fertile ground for malicious command and control network capability that conceals itself in Discord’s TLS-protected network traffic (as well as behind the service’s reputation).\n While it’s clear that some of the malware on Discord is specifically intended to disable computers or disrupt the ability of gamers to reach their platforms of choice, the prevalence of information stealers, remote access tools, and other criminal malware poses risks well  beyond the gaming enthusiast sphere. With more organizations using Discord as a low-cost collaboration platform, the potential for harm posed by the loss of Discord credentials opens up additional threat vectors to organizations.\n Even if you don’t have a Discord user in your home or office, abuse of Discord by malware operators poses a threat. Endpoint protection (and at the enterprise level, TLS inspection) can offer protection against the\n......", "posttime": "2021-07-23 23:10:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,increasingly,discord", "title": "恶意软件越来越多地针对 Discord 进行滥用", "title_en": "Malware Increasingly Targets Discord for Abuse", "transed": 1, "url": "https://news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse/", "via": "", "real_tags": ["软件", "discord"]}]