[{"category": "", "categoryclass": "", "imagename": "3a9d381ef2352f8b73f3d542071af431.jpeg", "infoid": 1070405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的二十年里，我遇到了很多未来学家、期货设计师、作家、战略家、远见者等等。他们都非常不同，但他们看待世界的方式和他们处理工作的方式都有主题特征。最近我一直试图了解每个人的相对优点，在这样做的过程中，出现了以下四个字符。与任何事情一样，每种方法都有支持和反对的论据（我的描述是简单化的并且可以辩论），但我的预感是，一个全面的未来工作将包含每种方法的元素，一个全面的未来主义者了解如何以平衡的方式使用这些心态中的每一种。 – 这里可能要绘制一个 2x2 矩阵，但我要么无法弄清楚，要么担心在创建 2x2 矩阵时我可能会无意中简化实际上是一组复杂的细微关系。", "note_en": "Over the last twenty years I’ve met a great number of futurists, futures designers, writers, strateg  ists, foresight practitioners and more. They’re all wonderfully different but there are thematic traits in the ways they see the world and the ways they approach their work. Recently I’ve been trying to understand the relative merits of each and in so doing the following four characters have emerged. As with anything, there are arguments for and against each approach (and my characterizations are simplistic and open for debate), but my hunch is that a well-rounded body of futures work would embrace elements of each, and a well-rounded futurist would understand how to use each of these mindsets in a balanced way.\n                                                – There’s probably a 2x2 matrix to be drawn here, but I either can’t figure it out or am concerned that in creating a 2x2 matrix I might inadvertently simplify what is in reality a complex set of nuanced relationships.", "posttime": "2021-07-29 23:43:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,taxonomy,未来", "title": "可以，应该，可能，不应该——未来学家的分类", "title_en": "Could, should, might, shouldn’t – A taxonomy of futurists", "transed": 1, "url": "https://medium.com/@fosta/could-should-might-shouldnt-a-taxonomy-of-futurists-2356cf4ceb79", "via": "", "real_tags": ["应该", "taxonomy", "未来"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "曾经想制作自己的编程语言或想知道它们是如何设计和构建的？ Crafting Interpreters 包含实现功能齐全、高效的脚本语言所需的一切。您将学习有关解析和语义的高级概念以及字节码表示和垃圾收集等重要细节。你的大脑会被新的想法点亮，你的手会变得肮脏和老茧。这是一个爆炸。从 main() 开始，您构建了一种具有丰富语法、动态类型、垃圾收集、词法范围、一等函数、闭包、类和继承的语言。所有这些都包含在几千行干净、快速的代码中，您完全理解这些代码，因为您自己编写每个人。", "note_en": "Ever wanted to make your own programming language or wondered howthey are designed and built?\n Crafting Interpreters contains everything you need to implement afull-featured, efficient scripting language. You’ll learn both high-levelconcepts around parsing and semantics and gritty details like bytecoderepresentation and garbage collection. Your brain will light up with new ideas,and your hands will get dirty and calloused. It’s a blast.\n Starting from  main(), you build a language that features richsyntax, dynamic typing, garbage collection, lexical scope, first-classfunctions, closures, classes, and inheritance. All packed into a few thousandlines of clean, fast code that you thoroughly understand because you write eachone yourself.", "posttime": "2021-07-29 23:42:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "interpreters,垃圾", "title": "Crafting Interpreters 有印刷版", "title_en": "Crafting Interpreters is available in print", "transed": 1, "url": "http://craftinginterpreters.com/", "via": "", "real_tags": ["垃圾"]}, {"category": "", "categoryclass": "", "imagename": "10c030b2429f801a5aed8756bdece9d2.jpg", "infoid": 1070403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rust 团队很高兴地宣布 Rust 的新版本 1.54.0。 Rust 是一种编程语言，使每个人都能够构建可靠且高效的软件。如果您通过 rustup 安装了以前版本的 Rust，那么获取 Rust1.54.0 就像这样简单：如果您还没有安装，您可以从我们网站上的相应页面获取 rustup，并查看 1.54 的详细发行说明.0 在 GitHub 上。 Rust 1.54 支持在属性内调用类似函数的宏。类似函数的宏可以是 macro_rules！基于或程序的宏，它们像宏一样被调用！(...)。一个值得注意的用例是将其他文件中的文档包含到 Rust 文档注释中。例如，如果您项目的 README 代表了一个很好的文档注释，您可以使用 include_str！直接合并内容。以前，各种变通方法允许类似的功能，但从 1.54 开始，这更加符合人体工程学。宏也可以嵌套在属性中，例如包含由构建脚本生成的内容：wasm32 平台的许多内在函数已经稳定，可以访问 WebAssembly 中的 SIMD 指令。值得注意的是，与之前稳定的 x86 和 x86_64 内在函数不同，它们没有安全要求，只能在启用适当的目标功能时调用。这是因为 WebAssembly 从一开始就是为了在执行之前安全地验证代码而编写的，因此可以保证正确解码指令（或根本不解码）。\n这意味着我们可以将一些内在函数公开为完全安全的函数，例如 v128_bitselect。但是，仍然有一些内部函数不安全，因为它们使用原始指针，例如 v128_load。在 1.52.1 中默认禁用增量编译后，此版本中默认重新启用了增量编译。在 Rust 1.52 中，从磁盘缓存加载增量编译数据时添加了额外的验证。这导致许多预先存在的潜在稳健性问题被发现，因为验证将这些静默错误转换为内部编译器错误（ICE）。作为回应，编译团队决定在 1.52.1 补丁中禁用增量编译，让用户避免遇到 ICE 和底层不健全的情况，代价是编译时间更长。 1 从那时起，我们进行了一系列回顾，贡献者一直在努力解决报告的问题，一些修复在 1.53 中发布，大部分在此版本中发布。 2 目前仍有两个已知问题会导致 ICE。由于缺乏自动崩溃报告，我们无法确定未决问题的全部影响程度。但是，根据我们从受 1.52 版本影响的用户那里收到的反馈，我们认为剩余的问题在实践中很少见。 Rust 1.54.0 版本还有其他更改：查看 Rust、Cargo 和 Clippy 中的更改。 rustfmt 也在 1.54.0 版本中得到修复，以正确格式化nestedout-of-line 模块。这可能会导致 1.53.0 rustfmt 忽略的文件格式发生变化。在此处查看详细信息。\n许多人聚集在一起创建了 Rust 1.54.0。没有你们，我们不可能完成它。谢谢！", "note_en": "The Rust team is happy to announce a new version of Rust, 1.54.0. Rust is a programming language empowering everyoneto build reliable and efficient software.\n If you have a previous version of Rust installed via rustup, getting Rust1.54.0 is as easy as:\n  If you don&#39;t have it already, you can  get  rustupfrom the appropriate page on our website, and check out the detailed release notes for 1.54.0 on GitHub.\n   Rust 1.54 supports invoking function-like macros inside attributes. Function-like macros can be either  macro_rules! based or procedural macros which are invoked like  macro!(...). One notable use case for this is including documentation from other files into Rust doc comments. For example, if your project&#39;s README represents a good documentation comment, you can use  include_str! to directly incorporate the contents. Previously, various workarounds allowed similar functionality, but from 1.54 this is much more ergonomic.\n  Macros can be nested inside the attribute as well, for example to include content generated by a build script:\n    A number of intrinsics for the wasm32 platform have been stabilized, which gives access to the SIMD instructions in WebAssembly.\n Notably, unlike the previously stabilized  x86 and  x86_64 intrinsics, these do not have a safety requirement to only be called when the appropriate target feature is enabled. This is because WebAssembly was written from the start to validate code safely before executing it, so instructions are guaranteed to be decoded correctly (or not at all).\n This means that we can expose some of the intrinsics as entirely safe functions, for example   v128_bitselect. However, there are still some intrinsics which are unsafe because they use raw pointers, such as   v128_load.\n  Incremental compilation has been re-enabled by default in this release, after it being disabled by default in 1.52.1.\n In Rust 1.52, additional validation was added when loading incremental compilation data from the on-disk cache.This resulted in a number of pre-existing potential soundness issues being uncovered as the validation changed these silent bugs into internal compiler errors (ICEs).In response, the Compiler Team decided to disable incremental compilation in the 1.52.1 patch, allowing users to avoid encountering the ICEs and the underlying unsoundness, at the expense of longer compile times.   1\n Since then, we&#39;ve conducted a  series of retrospectives and contributors have been hard at work resolving the reported issues, with some fixes landing in 1.53 and the majority landing in this release.   2\n There are currently still two known issues which can result in an ICE.Due to the lack of automated crash reporting, we can&#39;t be certain of the full extent of impact of the outstanding issues. However, based on the feedback we received from users affected by the 1.52 release, we believe the remaining issues to be rare in practice.\n      There are other changes in the Rust 1.54.0 release:check out what changed in  Rust,  Cargo, and  Clippy.\n rustfmt has also been fixed in the 1.54.0 release to properly format nestedout-of-line modules. This may cause changes in formatting to files that werebeing ignored by the 1.53.0 rustfmt. See details  here.\n  Many people came together to create Rust 1.54.0.We couldn&#39;t have done it without all of you. Thanks!", "posttime": "2021-07-29 23:40:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust", "title": "锈1.54.0", "title_en": "Rust 1.54.0", "transed": 1, "url": "https://blog.rust-lang.org/2021/07/29/Rust-1.54.0.html", "via": "", "real_tags": ["rust"]}, {"category": "", "categoryclass": "", "imagename": "ba7df734f094e5ebf462a4b1ae36448f.jpeg", "infoid": 1070402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter 已宣布，随着全国新冠肺炎病例激增，它将立即关闭其旧金山和纽约办事处。周三的公告是在这家社交媒体公司在两个城市重新开设办事处两周后发布的。 Twitter 发言人表示：“在仔细考虑了 CDC 的更新指南后，并根据当前情况，Twitter 已决定关闭我们在纽约和旧金山开设的办事处，并暂停未来的办公室重新开放，立即生效。”周三发表声明。该公司补充说，他们将继续密切关注当地情况，并做出必要的改变，“优先考虑我们 Tweeps 的健康和安全”。 Twitter 是湾区最新一家因 delta 变体而推迟重新开业或关闭办公室的公司。周三早些时候，谷歌宣布他们将办公室返回时间推迟到 10 月。比原定的 9 月日期晚了一个月。", "note_en": "Twitter has announced that it will close its San Francisco and New York offices immediately as Covid cases surge across the country.\n Wednesday&#39;s announcement comes just two weeks after the social media company reopened their offices at both cities.\n  &#34;After careful consideration of the CDC&#39;s updated guidelines, and in light of current conditions, Twitter has made the decision to close our opened offices in New York and San Francisco as well as pause future office reopenings, effective immediately,&#34; a Twitter spokesperson said in a statement Wednesday.\n  The company added that they are continuing to closely monitor local conditions and make necessary changes that &#34;prioritize the health and safety of our Tweeps.&#34;\n Twitter is the latest Bay Area company to either delay their reopening or close their offices due the delta variant.\n Earlier on Wednesday, Google announced that they will delay office returns to October. A month later than its original September date.", "posttime": "2021-07-29 23:39:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,病例,closes,办公室", "title": "随着 Covid 病例激增，Twitter 关闭旧金山和纽约办事处", "title_en": "Twitter closes San Francisco, New York offices as Covid cases surge", "transed": 1, "url": "https://www.cnbc.com/2021/07/28/twitter-closes-san-francisco-new-york-offices-as-covid-cases-surge.html", "via": "", "real_tags": ["旧金山", "病例", "closes", "办公室"]}, {"category": "", "categoryclass": "", "imagename": "f8f89cdfb62d07814437dcb6212aceee.jpg", "infoid": 1070401, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "远程工作为在办公室躲避雷达的“安静的送货员”提供了真正脱颖而出的机会。当大流行关闭她的办公室并迫使 Veronica Wortman Ploetz 和她的整个团队在家工作时，她几乎立即变得更有效率。沃特曼·普洛茨 (Wortman Ploetz) 是一家领导力培训机构的高级经理，认为自己是一个内向的人。 “我从独处和充电中获得能量，”她说。清晨时分，当她的房子很安静时，她突然能够完成比通常在忙碌——而且对她来说，筋疲力尽——的办公环境中所做的更多的工作。 “我会在早上 5 点起床，而不必经过准备、喂狗、出门和 45 分钟通勤的洗衣清单，我只是在该区域，”沃特曼·普洛茨说。 “在那段安静的时间里，当我感到精力充沛时，我就把所有事情都完成了。”虽然 2020 年初向远程工作的过渡对每个人来说都是突然的，但有些人发现自己比其他人更繁荣——在很多情况下，这要归功于他们的性格类型。许多内向的员工发现在不受干扰的环境中工作更可取。客户需求也发生了变化，有利于内向者的技能组合，而虚拟交流为内向者提供了更多分享想法的机会。对于曾经在雷达下飞行的“安静的送货员”来说，远程工作不仅提供了更少的日常负担，而且还提供了将额外的精力与新的工作方式相结合的机会——并且真正脱颖而出。在大流行开始的不确定日子里，公司及其客户的需求发生了变化，能够满足他们的员工脱颖而出。 “虽然外向者以外向、注重行动和热情而著称，但内向者带来分析性思维和同理心，”萨里的品牌专家理查德·艾蒂安 (Richard Etienne) 说，他在工作中就内向者进行了讲座。 “在大流行期间，这些技能立即受到了难以置信的追捧。内向的人可靠；一次接受一个项目并彻底完成的人。他们擅长深思熟虑和建立人际关系。这在公司试图留住客户的时期非常重要。”\n在最近接受彭博社采访时，Netflix 前人力资源主管 Patty McCord 表示，很明显，经理们最近才意识到以前没有引起注意的员工的技能。她提到了一家财富 100 强公司的一位高级管理人员，他拥有一个“技能矩阵”，她曾经用来形容一个伟大的销售人员：“能够控制房间，充满活力和魅力，自信，等等，等等，等等。在大流行期间它完全颠倒了，”麦考德说。突然之间，那家公司最好的员工变成了“安静的员工，他们只会接听客户的电话并倾听他们的声音”。同理心和更深思熟虑的沟通倾向使内向的人大放异彩，职业教练兼《内向的企业家》一书的作者贝丝·布洛 (Beth Buelow) 补充道。 “将他人置于聚光灯下，支持团队并成为沉默的合作伙伴，这种倾向是一种优势，”她说。 “这是经理和领导者目睹的一部分。他们需要善解人意的倾听者。愿意退后一步的人说，‘我希望你一切都好；我们能提供什么帮助？&#39;”除了拥有正确的先天技能外，许多内向的人还从远离实体办公室环境中受益。那是因为传统办公室在很多方面确实不适合性格内向的员工。 “工作场所是由外向的人创造的，为外向的人设计，”艾蒂安说。他解释说，开放式办公室是最严重的违规者。 “人们无需邀请即可轻松访问您的空间可能会很容易。”艾蒂安回忆说，在一个角色中，“我在电梯旁放了一张桌子——电梯。我无法得到 15 分钟的平静。”这对性格内向的人来说很难，因为不断的谈话会让人筋疲力尽。相比之下，外向的人会因社交互动而充满活力，艾蒂安说，“在一天结束时，内向的人会被消耗掉”。沃特曼·普洛茨 (Wortman Ploetz) 说，许多认识她的人可能会惊讶于她将自己描述为一个内向的人。她花了很多时间参加会议和实践培训课程，但最终，她说，“我从一个安静的地方汲取能量，独自一人”。神经科学有助于支持这一理论。研究表明，外向的人对多巴胺不太敏感，因此需要大量的刺激才能获得足够的能量。内向的人对大脑中的化学物质要敏感得多，过度刺激会很快变得疲倦。\nBuelow 补充说，总的来说，内向的人会为一天中的每一次社交互动付出代价。随着向远程工作的转变，该成本大幅下降。 “当他们在办公室并一直受到刺激时，他们并没有充电，”她说。 “仅仅凭借在家里的孤独，你就有更多的机会，更多的平衡。你的独处时间与社交时间的比例要健康得多。”艾蒂安认为自己是一个比较内向的人。与沃特曼·普洛茨 (Wortman Ploetz) 一样，他说在家工作时最终会变得更有效率。 “我感觉自己对时间的管理有了更多的控制，”他说。 “例如，我想我们都经历过这样的事情：你结束了一个会议，你走回你的办公桌，有人发现了你，你就开始谈话了。而且您会浪费时间处理刚刚结束的会议并重新设置。这不会再发生了。现在，我可以安静地进行反思，不受干扰。对于 Zoom 和 Teams 之类的东西，甚至还有“请勿打扰”设置；你真的不能给我发消息。”除了提供更多的和平与宁静之外，新的、内向友好的工作环境还为这些个性提供了以其他方式脱颖而出的空间。 “实体会议桌消失了，随之而来的是聚集在中心的大声人群和边缘的内向者的等级结构，”艾蒂安说。而且，他补充说，那些在会议室中可能犹豫不决的人得到了虚拟会议空间的支持。 “如果有人害怕公开演讲，远程工作可以让这个人谈论他们的专业知识，甚至可能是对数千人，但他们只是在笔记本电脑屏幕的顶部看到了绿灯，”他说。虚拟会议也往往有较少的干扰和重叠的发言者。 “平台的礼仪是不同的，”Buelow 说。 “如果你是在打断别人或在别人面前说话，你会更加清楚。”\n稍微慢一点的谈话速度让内向的人有时间整理自己的想法。 “他们有更多的时间来反思，然后当他们提供一些东西时，这很有意义，”她说。此外，实际上，“您可以使用更多工具来促进对话。不仅仅是谁能在边缘获得一个词；有聊天，&#39;举手&#39;，你可以发送反应“。此外，与物理空间相比，外向、声音更大的同事不太可能主宰虚拟空间。 “在桌子周围，有些人占用了更多的精力；它们占据更多空间，”Buelow 说。 “实际上，每个人都占据着相同的空间。它平衡了能量。”随着重返办公室——以及所有代价高昂的刺激——Buelow 乐观地认为，从远程工作中吸取的教训将使领导者和工作场所更能适应内向的人。她说，“明星员工”的定义已经改变。 “传统上，我们认为&#39;贡献&#39;意味着说话，”她说。 “我认为我们已经了解到，贡献可以有多种形式，而且不一定与谈话最多的人有关。”领导者可以使用一些策略来确保更多内向的员工可以继续做出贡献，即使团队正在过渡到面对面的工作。 Buelow 说，简单的解决方案，比如在与全组讨论之前进行头脑风暴会议或小组聊天，可以大有帮助。 “这是一个关于如何尊重那些希望在分享想法之前安静思考几分钟的人的考虑，”她说。 “当我们回到办公室时，领导者需要问，&#39;我们是否提供了多种贡献方式？&#39;。有很多方法可以做到这一点——它只需要一些创造力。” Wortman Ploetz 说，关于不同性格类型如何才能发挥最佳表现的经验教训是“我们要带回办公室的东西。我的团队中有几个人需要安静的时间。所以，也许他们会预订一间会议室，或者在他们的桌子或门上放一些视觉指示器，上面写着“请下次再来”。而且这不是冒犯性的。只是这个人不想分心。我不知道我们以前是否会理解这一点，但我们现在明白了。” Wortman Ploetz 说，她还保持着一些让她在家工作效率高的习惯。她说：“我在接受日历上的会议时更加认真，我确保它们之间有空间，即使是 15 分钟。我认为这是一个健康的界限，如果没有大流行，我就不会拥有。”", "note_en": "Remote work offered &#39;quiet deliverers&#39; who flew under the radar in the office a chance to really stand out.\n When the pandemic closed her office and forced Veronica Wortman Ploetz and her whole team to work from home, she became more productive, almost right away. Wortman Ploetz, a senior manager in a leadership training organisation, considers herself an introvert.\n “I get my energy from being alone and recharging,” she says. In the early morning hours, when her house was quiet, she was suddenly able to accomplish more than she typically could in a busy – and for her, draining – office environment.\n “I’d get up at 5 a.m. and instead of having to go through the rigamarole of getting ready, feeding the dogs, the laundry list of things to get out the door and do the 45-minute commute, I was just in the zone,” says Wortman Ploetz. “I got everything done when I felt energised in that quiet time.”\n While the transition to remote work in early 2020 was abrupt for everyone, some found themselves thriving more than others – in many cases, thanks to their personality type. Many introverted workers found working from a distraction-free environment preferable. Client needs also changed in ways that benefited introverts’ skillsets, while virtual communication offered introverts more opportunities to share their thoughts. For ‘quiet deliverers’ who may once have flown under the radar, remote work offered not only a less taxing day-to-day, but also an opportunity to combine that extra energy with new ways of working – and really stand out.\n  In the uncertain days at the outset of the pandemic, the needs of companies and their clients experienced a shift, and workers who could meet them stood out.\n “While extroverts are celebrated for being outgoing, action-oriented and enthusiastic, introverts bring analytical thought and empathy,” says Richard Etienne, a Surrey-based branding expert who lectures on introverts at work. “During the pandemic, those skills immediately became incredibly sought after. Introverts are reliable; people who take one project at a time and do it thoroughly. They’re good at deep thought and forming personal connection. That was really important during the period when companies were trying to hold onto clients.”\n  In a recent  Bloomberg interview, Patty McCord, former head of HR at Netflix, said it was clear managers were newly aware of the skills of employees who didn’t command attention before. She referenced a senior executive at a Fortune 100 company who had a “matrix of skills” she once used to identify a great salesperson: “able to control a room, a lot of energy and charisma, confident, blah, blah, blah. And it completely flipped during the pandemic,” said McCord.  Suddenly, that company’s best employees were “the quiet ones who would just get on a call with a client and listen”.\n Empathy and a propensity toward more thoughtful communication made introverts shine, adds Beth Buelow, a career coach and author of The Introvert Entrepreneur. “That tendency to put others in the spotlight, to hold up the team and be that silent partner, is a strength,” she says. “That is part of what managers and leaders witnessed coming through. They needed the empathetic listener. The person who was willing to step back and be like, ‘I hope you’re doing OK; how can we help?’”\n  On top of having the right innate skill set, many introverts benefited from the move away from a physical office environment. That because the traditional office, in many ways, really did not suit workers with more introverted personalities.\n “The workplace was created by extroverts, for extroverts,” says Etienne. Open-concept offices are the worst offenders, he explains. “The ease with which people can access your space without invitation can be intense.” In one role, Etienne recalls, “I had a desk by the lifts – the elevators. I couldn’t get 15 minutes of peace.”\n That’s tough on someone with an introverted personality, since constant conversation can be draining. While extroverts, in contrast, are energised by social interaction, says Etienne, “at the end of the day, the introvert is spent”.\n  Wortman Ploetz says many who know her might be surprised that she describes herself as an introvert. She spends a lot of time in meetings and hands-on training sessions, but ultimately, she says, “where I draw my energy from is being in a quiet place, alone”.\n Neuroscience helps back up the theory. Studies show  extroverts are less sensitive to dopamine, and thus require a lot of stimulation to be sufficiently energised. Introverts are far more sensitive to the brain chemical, and over-stimulation can quickly become tiring.\n In general, adds Buelow, introverts pay a price for each social interaction throughout the day. That cost dipped considerably with the shift to remote work. “They’re not recharging when they’re in the office and stimulated all the time,” she says. “Just by virtue of having the solitude at home, you have more opportunities, more balance. Your alone to social time ratio is much healthier.”\n Etienne considers himself a more introverted person. Like Wortman Ploetz, he says he’s ultimately become more productive while working from home.\n “I felt more in control of the management of my time,” he says. “For example, I think we’ve all been through this: you finish a meeting and you’re walking back to your desk and someone spots you and you have a conversation. And you lose the time to process the meeting you’ve just finished, and reset. That doesn’t happen anymore. Now, I can have my moment of reflection in silence, without disturbance. With things like Zoom and Teams there are even ‘do not disturb’ settings; you literally  can’t message me.”\n  Beyond providing more peace and quiet, the new, introvert-friendly work environment made space for those personalities to stand out in other ways.\n “The physical meeting table disappeared, and with it went the hierarchical structure of the loud people gathered together at the centre and the introverts on the fringes,” says Etienne. And, he adds, those who might have been hesitant to jump into the fray in a conference room were empowered by virtual meeting spaces.\n “If one has a fear of public speaking, working remotely allowed that person to speak to their expertise, maybe even to thousands of people, but they’re just seeing a green light at the top of their laptop screen,” he says.\n  Virtual meetings also tend to have fewer interruptions and overlapping speakers. “The etiquette of the platform is different,” says Buelow. “You’re much more aware of if you’re interrupting or talking on top of someone.”\n A slightly slower conversational pace gives introverts the time they need to collect their thoughts. “They have more time to reflect, and then when they offer something, it’s meaningful,” she says. Plus, virtually, “there are more tools at your disposal to contribute to the conversation. It’s not just whoever can get a word in edgewise; there’s the chat, ‘raising your hand’, reactions you can send”.\n Plus, extroverted, louder colleagues are less likely to dominate a virtual space than a physical one. “Around the table, some people take up more energy; they occupy more space,” says Buelow. “Virtually, everyone’s occupying the same space. It evens out the energy.”\n  With the return to the office – and all its costly stimulation – Buelow is optimistic that lessons learned from remote work will make leaders and workplaces more accommodating to introverts. The definition of the “star employee”, she says, has changed. “Traditionally, we considered ‘contribution’ to mean talking,” she says. “I think we’ve learned that contribution can take many forms, and it’s not necessarily about the person that talks the most.”\n There are tactics leaders can use to make sure more introverted employees can continue to contribute, even if the team is transitioning back to in-person work. Simple solutions, like having brain-storming sessions or small-group chats prior to discussion with the full group, can go a long way, says Buelow.\n  “It’s a consideration about how to honour those who would like a few minutes to think quietly before sharing their thoughts,” she says. “As we go back to the office, leaders need to be asking, ‘are we offering a diversity of ways to contribute?’. There’s a ton of ways of doing that – it just requires some creativity.”\n Wortman Ploetz says the lessons learned about how different personality types can best perform is “something we’re bringing back to the office. There’s a couple people on my team who need that quiet time. So, maybe they’ll book a conference room, or put up some visual indicator on their desk or door that says ‘please come back another time’. And it’s not offensive. It’s just that this person doesn’t want to be distracted. I don’t know if we would have understood that before, but we do now.”\n Wortman Ploetz says she’s also maintaining some of the habits that made her so productive at home. “I’m much more diligent about when I will accept meetings on the calendar,” she says, “and I make sure there’s space between them, even if it’s 15 minutes. I think that’s a healthy boundary I wouldn’t have had without the pandemic.”", "posttime": "2021-07-29 23:39:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内向,excelled", "title": "为什么内向者擅长在家工作", "title_en": "Why introverts excelled at working from home", "transed": 1, "url": "https://www.bbc.com/worklife/article/20210713-why-introverts-excelled-at-working-from-home", "via": "", "real_tags": ["内向", "excelled"]}, {"category": "", "categoryclass": "", "imagename": "52b03383f830f67c707d01d620371549.png", "infoid": 1070400, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021 年 7 月 28 日，星期三", "note_en": "Wednesday, July 28, 2021", "posttime": "2021-07-29 23:39:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建筑,非洲,图像,africa,星期三", "title": "用卫星图像绘制非洲建筑图", "title_en": "Mapping Africa’s Buildings with Satellite Imagery", "transed": 1, "url": "https://ai.googleblog.com/2021/07/mapping-africas-buildings-with.html", "via": "", "real_tags": ["建筑", "非洲", "图像", "africa", "星期三"]}, {"category": "", "categoryclass": "", "imagename": "498a534bc11c01de1ae2e75f47912edd.jpg", "infoid": 1070399, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在美国，新的 COVID 病例增加了 145%；查看病例上升最快的州", "note_en": "New COVID cases are up 145% in the U.S.; see the states where cases are rising the fastest", "posttime": "2021-07-29 23:38:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "众筹,unicorn,病例", "title": "水星的新独角兽地位为众筹提供了一个理由", "title_en": "Mercury’s new unicorn status offers a case for crowdfunding", "transed": 1, "url": "https://fortune.com/2021/07/29/mercurys-new-unicorn-status-offers-a-case-for-crowdfunding", "via": "", "real_tags": ["众筹", "unicorn", "病例"]}, {"category": "", "categoryclass": "", "imagename": "445ca598b04951b97e8820ade315a09e.jpeg", "infoid": 1070398, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "辉瑞公司首席执行官阿尔伯特·布尔拉 (Albert Bourla) 表示，辉瑞公司的冠状病毒疫苗在接种第二剂大约六个月后，其效力稳步下降至约 84%。他说，该疫苗的初步研究表明，它可以在 100% 的时间内保护人们免于住院治疗，但在六个月后下降到低 90% 和中到高 80%。辉瑞 (Pfizer) 公司的 Covid-19 疫苗的有效性随着时间的推移而稳步下降，在接种第二剂疫苗约四到六个月后，接种疫苗的人的有效性下降到约 84%，根据首席执行官阿尔伯特·布尔拉 (Albert Bourla) 的说法。周三在 CNBC 的“交易所”上发表的评论是基于一项新的公司资助研究的结果，该研究尚未经过同行评审。就在这家制药商与美国卫生官员就是否需要第三剂 Covid 疫苗以增强免疫保护发生冲突之际。该研究发现，在接种第二剂疫苗后的一周到两个月内，疫苗的有效性最强，达到 96.2%。根据这项研究，它平均每两个月下降 6%，该研究在美国和其他国家有超过 44,000 人注册。 Bourla 说，“四到六个月后的疗效约为 84%”。 “我们还看到来自以色列的数据表明免疫力正在下降，这开始影响过去 100% 的住院治疗。现在，在六个月之后，正在变成 90 多岁和 80 多岁中高， ”布尔拉说。 “好消息是，我们非常非常有信心，第三剂，即加强剂，会将免疫反应提高到足以预防 delta 变体的水平，”这位高管补充说，他指的是这种高度传染性的病毒。在美国和全球其他国家占主导地位的压力。 Bourla 强调说，随着时间的推移，疫苗有效性下降的情况并不少见，并补充说，其他疾病的三剂疫苗也有先例。\nBourla 说，辉瑞计划在 8 月中旬之前向美国监管机构正式提交有关第三剂 Covid 疫苗益处的数据。本月早些时候，当辉瑞首次宣布其计划时，美国食品药品监督管理局和疾病控制与预防中心发表了一份联合声明，对该公司进行了反击，称“已经完全接种疫苗的美国人不需要加强注射这次。” CDC 和世界卫生组织目前不建议进行 Covid 加强注射。世卫组织免疫、疫苗和生物制品司司长凯特·奥布莱恩博士周三表示，该组织仍在研究是否需要加强注射以增加保护。 “我们对此非常清楚，目前没有足够的信息来提供建议，”奥布莱恩在该组织社交媒体账户上发布的问答采访中说。 “同样，这是一个非常热门的话题，正在进行大量研究以提供基于证据的建议。”辉瑞支持的研究结果在 CDC 改变其先前指导方针并建议居住在 Covid 感染率高的地区的已完全接种疫苗的美国人开始再次在室内戴口罩后一天浮出水面。最近几周，全国范围内的冠状病毒病例激增，公共卫生官员将激增归因于 delta 变体。 CDC 主任罗谢尔·瓦伦斯基 (Rochelle Walensky) 周二表示，虽然官员们表示，大多数 Covid 住院和死亡发生在未接种疫苗的人群中，但 delta 变体的传染性如此之强，以至于接种了疫苗的人可以像未接种疫苗的人一样轻松传播病毒，即使是在无症状病例中也是如此。", "note_en": "The efficacy of Pfizer&#39;s coronavirus vaccine steadily declines to about 84% about six months after a second dose, according to CEO Albert Bourla.\n  The vaccine&#39;s initial studies showed it protected people 100% of the time against hospitalization, but that falls to low 90% and mid-to-high 80% after six months, he said.\n The effectiveness of Pfizer&#39;s Covid-19 vaccine steadily declines over time, dropping to about 84% for vaccinated people about four to six months after getting their second dose, according to CEO Albert Bourla.\n The comments, made on Wednesday on CNBC&#39;s &#34; The Exchange,&#34; are based on the findings of a  new company-funded study that has yet to be peer reviewed. It comes as the drugmaker clashes with U.S. health officials over the need for a third Covid vaccine dose to boost immunity protection.\n  The study found the vaccine&#39;s effectiveness was strongest, at 96.2%, between one week and two months after receiving the second dose. It declined an average of 6% every two months, according to the study, which signed up more than 44,000 people across the U.S. and other countries. The efficacy after &#34;four to six months was approximately 84%,&#34; Bourla said.\n  &#34;We have seen also data from Israel that there is a waning of immunity and that starts impacting what used to be what was 100% against hospitalization. Now, after the six month period, is becoming low 90s and mid-to-high 80s,&#34; Bourla said.\n &#34;The good news is that we are very, very confident that a third dose, a booster, will take up the immune response to levels that will be enough to protect against the delta variant,&#34; the executive added, referring to the highly contagious virus strain that&#39;s dominant in the U.S. and other countries around the globe. It&#39;s not uncommon for vaccines to decline in effectiveness over time, Bourla stressed, adding there&#39;s precedent for three-dose vaccines for other diseases.\n Pfizer plans to formally submit data to U.S. regulators about the benefits of a third Covid vaccine dose by mid-August, Bourla said.\n Earlier this month, when Pfizer first announced its plans, the Food and Drug Administration and the Centers for Disease Control and Prevention  issued a joint statement that pushed back on the company, saying &#34;Americans who have been fully vaccinated do not need a booster shot at this time.&#34;\n  The CDC and the World Health Organization don&#39;t recommend Covid booster shots at this time.\n Dr. Kate O&#39;Brien, WHO&#39;s director of immunization, vaccines and biologicals,  said Wednesday the organization is still researching whether a booster shot is needed to increase protection.\n &#34;We&#39;re very clear on this, there&#39;s not enough information to provide a recommendation at this point,&#34; O&#39;Brien said in a Q&amp;A interview posted on the organization&#39;s social media accounts. &#34;Again, this is a very hot topic, and there&#39;s a lot of research going on to be able to provide an evidence-based recommendation.&#34;\n The results of Pfizer-backed study surfaced a day after the CDC  reversed course on its prior guidance and recommended fully vaccinated Americans who  live in areas with high Covid infection rates begin to wear face masks indoors again.\n Coronavirus cases have jumped nationwide in recent weeks, a surge public-health officials attribute to the delta variant. While officials say the majority of Covid hospitalizations and deaths are in unvaccinated people, the delta variant is so contagious that vaccinated individuals can transmit the virus as easily as unvaccinated people, even in asymptomatic cases, CDC Director Rochelle Walensky said Tuesday.", "posttime": "2021-07-29 23:38:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新冠病毒,病毒,执行官,ceo,疫苗", "title": "辉瑞首席执行官表示，六个月后新冠病毒疫苗的有效性下降至 84%", "title_en": "Pfizer’s CEO says Covid vaccine effectiveness drops to 84% after six months", "transed": 1, "url": "https://www.cnbc.com/2021/07/28/pfizers-ceo-says-covid-vaccine-effectiveness-drops-to-84percent-after-six-months.html", "via": "", "real_tags": ["新冠病毒", "病毒", "执行官", "ceo", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "b110f88acef6f06f8ddfb4ec4ed2a5b6.png", "infoid": 1070397, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 7 月 8 日至 15 日的一周内，英格兰和威尔士使用 NHS Covid-19 应用程序的超过 600,000 人收到了自我隔离警报。这导致了许多行业的人员短缺，包括雇佣超过 300 万人的酒店业。由于整个团队同时被“ping”，酒吧、餐馆和酒店被迫暂时关闭，迫使一些酒店工作人员删除了该应用程序。 Rachael 告诉 Radio 1 Newsbeat 隔离让她因错过轮班而损失了 300 到 400 英镑。这位住在布莱顿的 22 岁男子直到两周前还在一家酒吧工作，他解释说：“我在换班的路上被查了两次。”两次我的侧向流动和 PCR 检测结果均为阴性.我不同意不自我隔离，但该应用程序不会为您提供有关您与谁接近的背景信息。”虽然在被 ping 后隔离不是法律要求，但政府敦促人们这样做。\n在最近的一次采访中，商务部长 Kwasi Kwarteng 告诉 BBC：“如果你被 ping 了，你应该自我隔离。我知道这会带来挑战，但规则很明确，我认为应该遵守。” Rachael 说删除该应用程序的一个重要因素是缺乏病假工资。 “如果我离开，我就没有收入或支持。如果我离开了，我会自我隔离。”由于缺乏收入而感到沮丧，她与她的经理谈及提早结束她的一次隔离。 “我问我的老板，‘如果我今天做了检测，结果呈阴性，我可以工作吗？’ “他说不，因为总部很严格，但在我们员工的 WhatsApp 聊天中，他后来发消息说人们应该删除该应用程序，因为他们正在失去这么多员工。”拉尔夫（化名）可能与这种压力有关. 他 27 岁，在伦敦的一家酒吧工作，并被告知要删除该应用程序，尽管他决定反对他的经理。“拥有该应用程序是正确的做法，无论我是否有经理告诉我拥有它，我会保留它，”他告诉 Radio 1 Newsbeat。\n拉尔夫还被告知不要被 ping，即使在与一名检测呈阳性的同事轮班后也是如此。 “应用程序说我需要隔离 8 天，所以我直接告诉了我的经理。他说进来，进行一次侧向流动测试，如果结果为阴性就继续工作。”拉尔夫将这种情况描述为“令人担忧”，尽管他理解经理需要他的原因，但还是决定“放下手”。 “最糟糕的情况是我很积极，我开始工作并将其传播给员工和客户，这实际上使人们的生命处于危险之中，这是我不喜欢做的事情。”和瑞秋一样，拉尔夫如果不上班就得不到报酬。总的来说，他说他在那里感觉很安全，但对酒吧的一些政策提出了质疑。 “我的经理要求我们所有人都戴上‘豁免’徽章，因为他不想让我们戴口罩。我理解他想为客户营造轻松的氛围，但我们仍处于大流行中。”对于 24 岁的伦敦酒吧主管露西来说，她的工作场所确实感到安全。他们遵守社交距离规则，所有顾客都会进入会场。\n然而，就像拉尔夫一样，她被告知要删除她的应用程序。她说“保留它不是一种选择”。 “没有关于它的谈话，从安全的角度来看，我真的不同意。我觉得我的安全受到了损害。”两周前，露西和其他三名员工感染了新冠病毒。他们的经理要求他们不要将阳性测试输入 NHS 应用程序，因为他担心这可能会关闭酒吧。 “我觉得有点尴尬。这与我和我的工作场所无关，也与我工作以外的地方有关。”我可能会让其他人处于危险之中。从道德和道德上来说，它对我来说不太好。”所以如果像露西和拉尔​​夫一样，你想保留这个应用程序，你在工作场所的权利是什么？贝丝黑尔是一名专门从事就业的律师。她告诉 Radio 1 Newsbeat ，这一切都归结为判断。\n“所有员工都应该删除该应用程序的一揽子指示不太可能合理。”如果您被告知违背自己的意愿删除该应用程序，Beth 建议“进行理性对话”。 “部分问题在于 NHS 测试和追踪系统与 NHS 应用程序之间存在混淆。使用该应用程序，没有法律义务拥有它，也没有产生自我隔离的法律义务。被联系然而，NHS 测试和追踪确实产生了法律义务。”", "note_en": "More than 600,000 people using the NHS Covid-19 app in England and Wales were sent self-isolation alerts in the week between 8 and 15 July.\n  It&#39;s caused staff shortages in lots of industries,  including the hospitality sector which employs over three million people.\n With whole teams being &#34;pinged&#34; at once, pubs, restaurants and hotels  have been forced to temporarily shut, pushing some hospitality staff to delete the app.\n   Rachael tells Radio 1 Newsbeat isolating has cost her between £300 and £400 in missed shifts.\n The 22-year-old who lives in Brighton and, until two weeks ago, worked in a bar explains: &#34;I&#39;ve been pinged twice while on my way to shifts.\n  &#34;Both times I&#39;ve tested negative on lateral flows and PCRs. I don&#39;t agree with not self-isolating, but the app gives you no context on who you&#39;ve been near.&#34;\n  Although isolating after being pinged isn&#39;t a legal requirement, the government urges people to do so.\n In a recent interview,  Business Secretary Kwasi Kwarteng told the BBC: &#34;If you are pinged, you should self-isolate. I know it poses challenges but the rules are clear and I think they should be followed.&#34;\n Rachael says a big factor in deleting the app was a lack of sick pay. &#34;If I&#39;m off, I get no income or support. If I did I would self-isolate.&#34;\n Frustrated by a lack of earnings, she spoke to her manager about ending one of her isolations early.\n &#34;I asked my boss, &#39;If I got a test today, and it&#39;s negative, can I work?&#39;\n  &#34;He said no because the head office was being strict, but in our staff WhatsApp chat he later messaged to say people should delete the app because they&#39;re losing so many staff.&#34;\n   Ralph (not his real name) can relate to this pressure. He&#39;s 27, works in a bar in London and has been told to delete the app, although he&#39;s decided to go against his manager.\n &#34;Having the app is the right thing to do and whether or not I&#39;ve got a manager telling me to have it, I&#39;m going to keep it,&#34; he tells Radio 1 Newsbeat.\n Ralph has also been told to ignore being pinged, even after doing a shift with a colleague who tested positive.\n  &#34;The app said I needed to isolate for 8 days, so I told my manager straightaway. He said to come in, take one lateral flow test and if that&#39;s negative to continue working.&#34;\n  Ralph describes the situation as &#34;worrying&#34;, and although he understands why his manager needs him in, decided to &#34;put his foot down.&#34;\n &#34;The worst case scenario is I&#39;m positive, I go into work and spread it to staff and customers and that effectively puts people&#39;s lives at risk and that&#39;s something I&#39;m not comfortable doing.&#34;\n Like Rachael, Ralph isn&#39;t paid if he doesn&#39;t go to work. On the whole he says he feels safe when he&#39;s there, but questions some of the bar&#39;s policies.\n &#34;My manager asks us all to wear &#39;exempt&#39; badges because he doesn&#39;t want us wearing masks. I understand he wants to create a relaxed atmosphere for customers, but we&#39;re still in a pandemic.&#34;\n  For Lucy, a 24-year-old bar supervisor in London, her workplace does feel safe. They follow social distancing rules, and all customers check into the venue.\n However like Ralph, she&#39;s been told to delete her app. She says &#34;keeping it wasn&#39;t an option&#34;.\n &#34;There wasn&#39;t a conversation about it, which from a safety point, I don&#39;t really agree with. I felt like my safety was compromised.&#34;\n  Two weeks ago Lucy and three other members of staff contracted Covid. Their manager asked them not to enter the positive tests into the NHS app as he worried it could shut the bar down.\n &#34;I felt a bit awkward. It&#39;s not about me and my workplace, it&#39;s also about the places I&#39;ve been outside of work.\n &#34;I could be putting other people at risk. Ethically and morally it didn&#39;t sit with me very well.&#34;\n  So if like Lucy and Ralph you want to keep the app, what are your rights in the workplace?\n Beth Hale is a lawyer who specialises in employment. She tells Radio 1 Newsbeat, it all comes down to judgement.\n  &#34;A blanket instruction that all staff should delete the app is unlikely to be reasonable.&#34;\n If you are told to delete the app against your will, Beth suggests &#34;having a rational conversation&#34;.\n &#34;Part of the problem is the confusion there is between the NHS Test and Trace system and the NHS app. With the app, there is no legal obligation to have it and it does not create a legal obligation to self-isolate. Being contacted by NHS test and trace however does create a legal obligation.&#34;", "posttime": "2021-07-29 23:38:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,nhs,应用程序", "title": "Pingdemic：酒吧工作人员被告知删除 NHS Covid-19 应用程序", "title_en": "Pingdemic: Bar staff being told to delete NHS Covid-19 app", "transed": 1, "url": "https://www.bbc.com/news/newsbeat-57989767", "via": "", "real_tags": ["程序", "nhs", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070396, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近我正在做一些检索结构数据成员类型的工作。当我探索、研究和测试想法时，我发现了这颗珍珠：template&lt;int N&gt; struct tag{};template&lt;typename T, int N&gt;struct loophole_t {friend auto loophole(tag&lt;N&gt;) { return T{} ; };};自动漏洞(tag&lt;0&gt;);sizeof(loophole_t&lt;std::string, 0&gt;);===&gt; std::is_same&lt; std::string, decltype( loophole(tag&lt;0&gt;{} ) ) &gt;:: 值； &lt;=== 有趣。我在创建 struct reader 以检测结构的数据成员类型时非常痛苦。而且它受到了痛苦的限制：只有文字类型、预建类型列表等。有了它，一切皆有可能。经过一些编译器的斗争，我想出了一个优雅的十行代码头，它可以从一个数据结构（有一定的限制）用 C++ 创建类型列表，没有固定类型列表。这是它可以做什么的简短示例：使用 wndclass_tlist = loophole_ns::as_type_list&lt; WNDCLASS &gt;;Resulting type list (Visual Studio 2017): 0. unsigned int 1. __int64 (__cdecl*)(struct HWND__ * __ptr64, unsigned int ,unsigned __int64,__int64) 2. int 3. int 4. struct HINSTANCE__ * __ptr64 5. struct HICON__ * __ptr64 6. struct HICON__ * __ptr64 7. struct HBRUSH__ * __ptr64 8. wchar_pt * __ptr64 const 类型漏洞基本上允许我们将某种类型存储到“变量”中，然后再读回来！它非常强大。更多示例：我们可以将结构转换为 luple：我设计的轻量级元组，具有跨编译器稳定布局的优势（至少就我测试而言）：\n结构数据{浮动一个; std::string b;};using data_tlist = loophole_ns::as_type_list&lt; data &gt;;using data_luple = luple&lt; data_tlist &gt;;data d{ 1.f, &quot;Hello World!&quot; };auto&amp; l = reinterpret_cast&lt; wndclass_luple&amp; &gt;( d ); //我知道你的感受)get&lt; std::string &gt;(l) = &quot;Welcome, New World!&quot; luple_do( l, []( auto&amp; value ) { std::cout &lt;&lt; value &lt;&lt; &quot;\\n&quot; ; } );如果您想了解更多有关它的工作原理及其局限性的信息，请查看代码。我在 GitHub 存储库中提供了类型漏洞和 luple 的完整注释源代码。它适用于所有三个主要编译器。您可以在 godbolt.org 上找到使用类型漏洞的数据成员类型检测器的更简洁示例（一个稍微不同的版本最初由 Reddit 上名为 jguegant 的用户提供）。 Sasha Sobol 提出了一个例子（在 Coliru 在线），它可以在编译时为类型分配唯一的 ID（它依赖于实例化顺序）。如果你不习惯阅读源代码，那么 Reddit 上的一些好人 (render787) 做了一个详细的评论，很好地观察了这个漏洞如何允许获取结构数据成员类型信息。到目前为止，我还没有检查这是否违反了标准。因此，非常欢迎 C++ 标准专家。在 Twitter 上第一个做出回应的是 Simon Brand，他指出了一个缺陷报告 2118。在 Twitter 上关注我以获取有关我的新文章（主要是编程和计算机图形）的更新。\n我应该为所有其他 C++ 领导者创建一个模因，例如 Scott Meyers、Stephan T. Lavavej、Alisdair Meredith、Howard Hinnant 以及委员会中的每个人以及其他为 C++ 做出贡献的人。", "note_en": "Recently I was doing some work on retrieving struct data member types. And as I was exploring, researching and testing ideas I uncovered this pearl:\n template&lt;int N&gt; struct tag{};template&lt;typename T, int N&gt;struct loophole_t { friend auto loophole(tag&lt;N&gt;) { return T{}; };};auto loophole(tag&lt;0&gt;);sizeof( loophole_t&lt;std::string, 0&gt; );===&gt; std::is_same&lt; std::string, decltype( loophole(tag&lt;0&gt;{}) ) &gt;::value; &lt;===\n  Interesting. I had so much pain creating  struct reader to detect data member types of a struct. And it was painfully limited: only literal types, pre-built type list, etc. With this anything becomes possible.\n After some compiler-fight I came up with an elegant ten lines of code header that can create a type list from a data structure (with certain limitations) with just C++, no fixed type lists. Here is a short example of what it can do:\n using wndclass_tlist = loophole_ns::as_type_list&lt; WNDCLASS &gt;;Resulting type list (Visual Studio 2017): 0. unsigned int 1. __int64 (__cdecl*)(struct HWND__ * __ptr64,unsigned int,unsigned __int64,__int64) 2. int 3. int 4. struct HINSTANCE__ * __ptr64 5. struct HICON__ * __ptr64 6. struct HICON__ * __ptr64 7. struct HBRUSH__ * __ptr64 8. wchar_t const * __ptr64 9. wchar_t const * __ptr64\n  This type loophole basically allows us to store some type into a &#34;variable&#34; and later read it back! It&#39;s very powerful.\n More examples: we can turn a structure into luple: a lightweight tuple of my design that has the advantage of a stable layout across compilers (at least as far as I tested it):\n struct data { float a; std::string b;};using data_tlist = loophole_ns::as_type_list&lt; data &gt;;using data_luple = luple&lt; data_tlist &gt;;data d{ 1.f, &#34;Hello World!&#34; };auto&amp; l = reinterpret_cast&lt; wndclass_luple&amp; &gt;( d ); //I know what you feel)get&lt; std::string &gt;(l) = &#34;Welcome, New World!&#34;luple_do( l, []( auto&amp; value ) { std::cout &lt;&lt; value &lt;&lt; &#34;\\n&#34;; } );\n If you want to know more about how it works and its limitations then check out the code. I provide full  commented source code of both the type loophole and luple in the  GitHub repo. It works on all three major compilers.\n  You can find a more condensed example of a data member type detector using type loophole  here at godbolt.org (a slightly other version was initially  provided by a user named jguegant at Reddit).\n Sasha Sobol has come up with an example ( online at Coliru) that makes it possible to assign unique IDs to types during compile time (it&#39;s instantiation order dependent).\n If you&#39;re not comfortable with reading the source code then some nice guy (render787) on Reddit made a  detailed comment that gives a good observation of how this loophole allows the struct data member type information to be acquired.\n I have not so far examined if that&#39;s in violation of the Standard. So, C++ Standard gurus are really welcome. The first to  respond at Twitter was  Simon Brand who pointed to a defect report  2118.\n Follow me on  Twitter for updates about my new articles (mostly programming and computer graphics).\n      I should&#39;ve generated a meme for every other C++ leader out there like  Scott Meyers,  Stephan T. Lavavej,  Alisdair Meredith,  Howard Hinnant and basically everyone on  the committee and others who contribute to the C++.", "posttime": "2021-07-29 23:37:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,c++,类型", "title": "C++ 类型漏洞 (C++14)", "title_en": "The C++ Type Loophole (C++14)", "transed": 1, "url": "http://alexpolt.github.io/type-loophole.html", "via": "", "real_tags": ["漏洞", "c++", "类型"]}, {"category": "", "categoryclass": "", "imagename": "e031c3e141719cd2ccddeee0fc7b878b.png", "infoid": 1070395, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你从头开始一个新项目——一个新的应用程序、服务或网站——你主要关心的通常不是如何在高可用性的网络规模上运行它。相反，您可能会专注于为您的目标客户打造正确的产品或寻找适合市场的产品。如果您要为初创公司创建 MVP，那么您需要在扩展之前了解它，否则，您为谁进行扩展？如果您是企业的开发人员，您希望确保满足业务的期望和需求。大规模运营充其量只是明天的问题。因此，在选择正确的技术集时，Kubernetes（通常与大型分布式系统相关）现在可能不在您的关注范围内。毕竟，它带来了大量开销：设置和操作集群、容器化您的应用程序、定义服务、部署、负载平衡器等等。这在早期可能看起来像是过度杀伤，您可能认为您的时间最好花在其他任务上，例如编写实际应用程序的前几次迭代。当我们在 2008 年开始构建 Stack Overflow 时，我们没有那个选择。没有 Docker（2013 年），也没有 Kubernetes（2014 年）。云计算还处于起步阶段：Azure 刚刚推出（2008 年），而 Amazon Web Services 大约成立两年。我们构建的内容是为特定硬件设计的，并对其进行了大量假设。现在我们正在对我们的代码库进行现代化改造并迁移到云中，我们必须投入大量工作才能使 Kubernetes 和容器正常工作。经历了这个过程，给了我们一个新的视角。如果您今天正在构建一个新应用程序，那么仔细研究一下使其成为云原生并从一开始就使用 Kubernetes 可能是值得的。设置 Kubernetes 的工作量比您想象的要少。当然，这比稍后重构您的应用程序以支持容器化所需的努力要少。以下是为什么从一开始就在 Kubernetes 上构建您的应用程序可能不再是一个坏主意的三个原因。几年前，当我们在 Stack Overflow 建立我们的第一个内部 Kubernetes 集群时，我们花了将近一周的时间来启动和运行一切：配置虚拟机、安装、配置、配置、配置。一旦集群启动，就会进行持续维护。我们最终意识到 Kubernetes 对我们来说很棒——但我们希望其他人来运行它。如今，Amazon 的 Elastic Kubernetes Service (EKS)、Microsoft 的 Azure Kubernetes Service (AKS) 或 Google 的 Google Kubernetes Engine (GKE) 等托管 Kubernetes 服务允许您在几分钟内设置自己的集群。例如，在 AKS 中，您只需单击门户中的几个按钮并填写几个表单：\n这很方便，但您可能不想在工作流结束时实际创建集群。完成向导，但不要单击最后的蓝色“创建”按钮！相反，将您刚刚创建的配置下载为 ARM 模板并将其签入您的源代码控制系统。现在，您拥有两全其美的优势——易用性和基础设施即代码 (IaC)！一旦您在此处进行设置，一旦您开始扩展您的应用程序，除了向您的云提供商写更大的检查之外，几乎没有什么可做的。任何额外的资源分配都很容易。规模带来的问题——容错、负载平衡、流量整形——已经得到处理。在任何时候，你都不会被成功淹没的那一刻；您无需付出太多额外努力就可以使您的应用程序面向未来。如果您的项目成功，那么在早期阶段做出的技术决策很可能在未来数月或数年仍会产生影响。例如，Stack Overflow 最初是用 C# 编写的。 13 年后，它仍然是用 C# 编写的，但它曾经也是。偶尔有人（咳咳）建议我们用 Node.js 重写它。那还没有发生过。对云服务的依赖也是如此。您可以在基础设施即服务 (IaaS) 产品（如 Amazon 的 EC2）之上构建您的新应用程序。或者，您可能开始依赖平台即服务 (PaaS) 产品，例如 Microsoft 的 Azure SQL。但是，您是否愿意在现阶段对其背后的云提供商做出长期承诺？如果您还不知道您的旅程将带您到哪里，也许您更愿意保持云不可知状态一段时间。让我们回到基础设施即代码：将诸如 Terraform 之类的工具投入其中将帮助您在某种程度上保持与云无关。它提供了统一的工具包和配置语言 (HCL) 来跨不同的云和基础架构提供商管理您的资源。然而，您的应用程序不太可能真正与云无关，因为您可以像在家中的互联网或电力供应商一样轻松地切换云提供商。这是 HashiCorp 论坛中关于这个主题的一个很好的讨论：Terraform 真的与云无关吗？正如一位评论者指出的那样： &gt; “Kubernetes 集群是对计算资源进行抽象的一个很好的例子：在不同平台上有许多托管和自我管理的实现，所有这些实现都提供了一个通用的 API 和一组通用的能力。”\n这总结得很好！它仍然不是一个完美的抽象。例如，每个云提供商可能都有自己的自定义方式来实现公共负载均衡器和 Kubernetes 中的持久卷等内容。公平地说，如果您在 Kubernetes 上构建，您将在一定程度上保持云不可知论。 Kubernetes 通常被视为管理生产基础设施的一种方式。但是在 Stack Overflow，我们一直在使用它来动态管理我们的测试环境。我们使用 Kubernetes 来托管我们所谓的 PR 环境。只需按一下按钮，每个拉取请求都可以在隔离的测试环境中运行：当我们说“隔离环境”时，我们指的是一切：应用程序本身（带有 PR 分支中的代码更改）及其自己的专用实例SQL Server、Redis、Elasticsearch 和其他服务部分。所有这些都在几分钟内从头开始运行，并在专用命名空间中的少数容器中运行，只为您和任何对您的 PR 感兴趣的人服务。这不是我们发明的；其他组织一直在使用这个概念。这个想法是每个代码更改都会通过拉取请求进入像 Git 这样的版本控制系统。其他开发人员将审查代码，但代码不会说明整个故事。您希望看到代码的运行情况。通常，您必须在本地下载所有代码，编译并运行它。这可能很简单，但如果您正在运行一个从多个存储库中提取代码的大型应用程序，或者仁慈地使用微服务架构，那么您可能需要进行数小时的调试。更好的是，假设您已将一项新功能的所有提交压缩为一个，并将其作为单个 PR 提交。将该 PR 环境作为单个链接发送到销售或营销，以便他们可以预览正在运行的功能。如果您的销售团队想要演示具有特定功能或自定义构建的应用程序，请向他们发送 PR 环境链接。您不必花时间指导技术水平较低的同事完成构建过程。达到这一点需要大量的基础工作。首先，在 Windows Containers 中运行经典的 .NET Framework 并不是我们真正想要追求的途径。理论上这是可能的——自 v1.19 以来，Kubernetes 中已经提供了 Windows 支持——但 Docker/Kubernetes 生态系统实际上更以 Linux 为中心。幸运的是，我们向 .NET Core 的迁移已经在进行中，所以我们决定押注 Linux 容器。当然，这也带来了一系列挑战。当您处理一个 10 年以上的旧代码库时，您可能会发现关于它运行的基础设施的假设：硬编码的文件路径（包括我们最喜欢的：正斜杠与反斜杠）、服务 URL、配置等等在。但我们最终到达了那里，现在我们可以在自动扩展的 Kubernetes 集群上启动任意数量的 Stack Overflow、Stack Exchange 网络和 Teams 产品的测试实例。什么时候能活着！\n回顾 Stack Overflow 的早期，拥有这种可用的工具会改变游戏规则。在构建产品的早期阶段，您通常希望尽可能快地构建、衡量和学习。使用容器和 Kubernetes 将允许您为此构建工具，并在您要扩展时为您提供面向未来的支持。那么，您应该从一开始就使用 Kubernetes 吗？可能是！当然，这仍然取决于您的特定项目、您的要求和您的优先事项。但是您是否一直在说“我们不需要 Kubernetes，因为我们还没有适合市场的产品”？仔细看看，也许你会发现自己在说“我们需要 Kubernetes，因为我们还没有适合市场的产品。”标签：kubernetes，软件开发，测试", "note_en": "If you’re starting a new project from scratch—a new app, service, or website—your main concern usually isn’t how to operate it at web scale with high availability. Rather, you’re likely to focus on building the right thing for the customer you’re targeting or finding product market fit. If you’re creating an MVP for a startup, you need to get to that before scaling, otherwise, who are you scaling for? If you’re a developer at an enterprise, you want to make sure that you’re meeting the expectations and needs of the business. Operating at scale is, at best, a tomorrow problem.\n Hence, when it comes to choosing the right set of technologies,  Kubernetes—commonly associated with large, distributed systems—might not be on your radar right now. After all, it comes with a significant amount of overhead: setting up and operating a cluster, containerizing your app, defining services, deployments, load-balancers, and so on. This may look like massive overkill at the early stage, and you might think that your time would be better spent on other tasks, such as coding the first couple of iterations of your actual app.\n When we started building Stack Overflow in 2008, we didn’t have that choice. There was no Docker (2013), no Kubernetes (2014). Cloud computing was in its infancy: Azure had just launched (2008), and Amazon Web Services was about two years old. What we built was designed for specific hardware and made a lot of assumptions about it. Now that we’re modernizing our codebase and moving to the cloud, there’s a fair amount of work we have to put in to make Kubernetes and containers work.\n Going through this process has given us a new perspective. If you’re building a new app today, it might be worth taking a closer look at making it cloud-native and using Kubernetes from the jump. The effort to set up Kubernetes is less than you think. Certainly, it’s less than the effort it would take to refactor your app later on to support containerization.\n Here are three reasons why building your app on Kubernetes from the start might not necessarily be such a bad idea anymore.\n  At Stack Overflow, when we set up our first in-house Kubernetes cluster a couple of years ago, it took us close to a week to get everything up and running: provision virtual machines, install, configure, configure, configure. Once the cluster was up, there was ongoing maintenance. What we ultimately realized was that Kubernetes was great for us—but we wanted somebody else to run it.\n Today, managed Kubernetes services such as Amazon’s Elastic Kubernetes Service (EKS), Microsoft’s Azure Kubernetes Service (AKS), or Google’s Google Kubernetes Engine (GKE) allow you to set up your own cluster literally in minutes. For example, in AKS, you can just click a few buttons in the portal and fill out a couple of forms:\n  This is convenient, but you might wanna stop short of actually creating the cluster at the end of the workflow. Go through the wizard, but don’t click that blue “Create” button at the end! Instead, download the configuration you just created as an  ARM template and check it into your source control system. Now you have the best of both worlds—ease of use and infrastructure as code (IaC)!\n Once you’re set up here, there’s little left to do once you start scaling your application except write bigger checks to your cloud provider. Any additional resource allocation is easy. The problems that come with scale—fault tolerance, load balancing, traffic shaping—are already handled. At no point will you hit that moment of being overwhelmed with success; you future-proofed your app without too much extra effort.\n  If your project is successful, chances are that technology decisions made in the early stages will still have an impact months or years down the road. Stack Overflow, for instance, was  originally written in C#. 13 years later, it’s still written in C#, but it used to be, too. Occasionally someone (ahem) suggests that we rewrite it in Node.js. That’s still never happened.\n The same can be said about dependencies on cloud services. You might build your new app on top of infrastructure as a service (IaaS) products like Amazon’s EC2. Or maybe you’re starting to take dependencies on platform as a service (PaaS) offerings such as Microsoft’s Azure SQL. But are you willing to make a long-term commitment to the cloud providers behind them at this stage? If you don’t know yet where your journey is going to take you, maybe you’d prefer to stay cloud agnostic for a little longer.\n Let’s get back to infrastructure as code: throwing a tool such as  Terraform into the mix is going to help you with staying cloud agnostic to some degree. It provides a unified toolkit and configuration language ( HCL) to manage your resources across different cloud and infrastructure providers. Your app is unlikely to be truly cloud agnostic, however, in the sense that you’ll be able to just switch your cloud provider as easily as your internet or electricity provider at home.\n Here’s a good discussion on this topic in HashiCorp’s forum:  Is Terraform really cloud agnostic? As one of the commenter points out:\n &gt; “A Kubernetes cluster is a good example of an abstraction over compute resources: there are many hosted and self-managed implementations of it on different platforms, all of which offer a common API and common set of capabilities.”\n This sums it up nicely! It’s still not a perfect abstraction. For example, each cloud provider is likely to have its own custom way of implementing things like public load balancers and persistent volumes in Kubernetes. It’s still be fair to say if you’re building on Kubernetes, you’re going to stay cloud agnostic to a certain degree.\n  Kubernetes is usually seen as a way to manage your production infrastructure. But here at Stack Overflow, we’ve been using it to manage our test environments on the fly. We’re using Kubernetes to host what we call  PR Environments. Every pull request can be run in an isolated test environment at the push of a button:\n  And when we say “isolated environment”, we mean  everything: the app itself (with the code changes in the PR branch) with its own dedicated instances of SQL Server, Redis, Elasticsearch, and additional services pieces. All spun up from scratch within minutes and running in a handful of containers in a dedicated  namespace, just for you and anyone who’s interested in your PR.\n This isn’t something we invented; other organizations have been using this concept. The idea is that every code change goes into a version control system like Git through a pull request. Other developers will review the code, but the code won’t tell the whole story. You want to see the code in action. Normally, you’d have to download all the code locally, compile, and run it. That could be simple, but if you’re running a large application that draws code from multiple repos or—have mercy—a microservice architecture, then you may run into several hours of debugging.\n Even better, let’s say you’ve squashed all of the commits for a new feature into a single one and are committing it as a single PR. Send that PR environment to sales or marketing as a single link so that they can preview the feature in action. If your sales team wants to demo the app with specific features or custom builds, send them a PR environment link. You won’t have to spend time walking your less technical colleagues through the build process.\n A lot of groundwork was required to get to this point. First off, running classic .NET Framework in Windows Containers wasn’t really an avenue we wanted to pursue. It’s possible in theory—Windows support has been available in Kubernetes since v1.19—but the Docker/Kubernetes ecosystem is really more centered around Linux. Thankfully, our migration to .NET Core was already underway, so we decided to bet on Linux containers.\n This, of course, came with its own set of challenges. When you’re dealing with a 10+ year old codebase, you’re likely going to find assumptions about the infrastructure it’s running on: hardcoded file paths (including our favorite: forward slash vs. backslashes), service URLs, configuration, and so on. But we got there eventually, and now we’re in a place where we can spin up an arbitrary number of test instances of Stack Overflow, the Stack Exchange network, and our Teams product on our auto-scaling Kubernetes cluster. What a time to be alive!\n Looking back at the early days of Stack Overflow, having this kind of tooling available back then would have been a game changer. In the early stages of building a product, you typically want to build, measure, and learn as much and as fast as possible. Using containers and Kubernetes will allow you to build the tooling for that  and future-proof you in case you’re going to scale.\n So, should you use Kubernetes from day one? Maybe! It still depends, of course, on your specific project, your requirements, and your priorities.\n But have you been saying “we don’t need Kubernetes because we don’t have product market fit yet”? Take a closer look, and maybe you’ll find yourself saying “we need Kubernetes  because we don’t have product market fit yet.”\n Tags:  kubernetes,  software development,  testing", "posttime": "2021-07-29 23:37:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kubernetes", "title": "从第一天开始在 Kubernetes 上构建", "title_en": "Build on Kubernetes from Day One", "transed": 1, "url": "https://stackoverflow.blog/2021/07/21/why-you-should-build-on-kubernetes-from-day-one/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "bd68e91c57248cea0f5df69174baff05.jpg", "infoid": 1070394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "刚从我们与战锤纪念者丹·阿布内特 (Dan Abnett) 就战锤宇宙未解之谜的谈话中，我们现在将注意力转向了科幻小说中的一个不那么阴暗的属性：一个具有超凡记忆力的博学者发明了时间旅行，事情发生了正如他们所说，有点卡卡。抓住你的手链，走进成像室，因为现在是谈论 Quantum Leap 的时候了。我们有幸与传奇电视制作人 Donald P. Bellisario 共度时光，他的名字为 80 年代和 90 年代一些最有影响力和最受欢迎的电视节目的片尾曲增光添彩——包括 Airwolf、Magnum、PI 和当然是量子跃迁。尽管他现在已经退休了，但贝利萨里奥还是勇敢地同意允许 Ars 的电影摄制组——带着道具！——进入他位于加利福尼亚的家，偶尔向他提出一些晦涩的问题，关于什么是有史以来最好的电视节目。如果没有其他原因，除了量子飞跃是一个特别节目，这是一个特殊的情节。今天，它感觉像是另一个时代的遗物——在这个时代，故事连载是例外而不是规则，每季 22 集代表了预期的最低限度，而且商业广告的频率较低。 （Quantum Leap 的第一季剧集大约有 48 分钟——这比今天网络电视上大多数长达一小时的电视剧长约 6 分钟！）Quantum Leap 的 97 集最初于 1989 年至 1993 年播出，该节目是我的初中和高中早期经历的很大一部分——尽管我最想看到的节目部分是对“未来”的那些罕见的一瞥，但该节目很少瞥见 1999 年正在进行的“量子飞跃计划”。那是一个多么美好的未来——霓虹灯和闪烁的灯光、炫酷的蓝色闪电划过彩色塑料的未来、90 年代复古未来时尚潮流的未来，所有这些都由一个名为 Ziggy 的智能且有点狡猾的人工智能监督。本周的时间旅行故事很酷，但关于量子飞跃计划的总体叙述真正让我着迷——山姆会回家吗？虽然多年来一直有关于 Quantum Leap 重启的谣言，但我想稍微降低一些期望：Don 有很多整洁的东西要告诉我们，但在这次采访中你不会发现的一件事是关于是否或不是 Quantum Leap 会回来。 Don 坚信 Sam 仍然在那里跳跃——而 Sam 不知何故做出了继续这样做的有意识的选择。正如唐所说，这是山姆毕生的事业。所以系列结局令人心碎的结局仍然存在：山姆贝克特再也没有回到他 1999 年复古霓虹灯的家，他仍然在某个地方，与艾尔一起工作，努力纠正曾经的错误。我希望我们能和唐一起至少再拍一集“未解之谜”——Airwolf，有人吗？敬请关注！滑出长时间潜伏者模式进行评论。感谢您接受李先生的采访！我本可以听 Don 讲几个小时。希望你的采访有助于向这个节目介绍新的观众——对我来说是很棒的故事和回忆。\n唐非常友善，而且非常乐于助人。我们在他家拍了这个，摄制组拿着我们建造的这个巨大的 Ziggy 桌子在那里卷起来（有时候有预算真是太好了！），他没有告诉我们 GTFO，而是说我们可以在任何我们想要的地方进行设置。我们解决了连接问题（制作人和我都在 Zoom 上拨入了电话，所以当唐朝左看时，他看着我，亚当在 iPad 上问他问题）和 COVID 预防措施，最终结果是伟大的。他是一项很好的运动。我非常希望我们也能回来谈谈 Airwolf！", "note_en": "Fresh from our talk with Warhammer remembrancer Dan Abnett on the  unsolved mysteries of the Warhammer universe, we now turn our attention to a science fiction property with a bit less grimdark: the one where a polymath with an eidetic memory invents time travel and things go, as they say,  a little kaka. Grab your handlinks and step into the imaging chamber because it&#39;s time to talk about  Quantum Leap. We were lucky enough to snag some time with legendary TV producer  Donald P. Bellisario, whose name has graced the closing credits of some of the most influential and popular TV shows of the &#39;80s and &#39;90s—including   Airwolf,  Magnum, P.I., and of course  Quantum Leap. Though he&#39;s now retired, Bellisario gamely agreed to allow an Ars film crew—with props!—into his California home to badger him with occasionally obscure questions about what is easily the best time-travel show ever to grace television.\n This was a special episode to film, if for no other reason than that  Quantum Leap was a special show. Today it feels like a relic from another age—an age in which story serialization was the exception rather than the rule, where twenty-two episodes per season represented the expected minimum, and where commercial breaks were a bit less frequent. (The first-season episodes of  Quantum Leap clock in at almost  forty-eight minutes—that&#39;s about six minutes longer than most hour-long dramas on network TV today!)  Quantum Leap&#39;s 97 episodes originally aired from 1989 to 1993, and the show was a huge part of my junior high and early high school experience—though the parts of the show I wanted to see most were those rare glimpses into &#34;the future,&#34; the show&#39;s infrequently glimpsed vision of 1999 where Project Quantum Leap was taking place.\n    And what a future it was—a future of neon and blinking lights, of cool blue lightning arcing across colored plastic, of &#39;90s retro-future fashion sense run amok, all overseen by an intelligent and somewhat snippy artificial intelligence named Ziggy. The time travel stories of the week were cool, but the overarching narrative about Project Quantum Leap is what really hooked me—would Sam ever return home?\n Though there have been rumors floating around for years about a   Quantum Leap reboot, I want to temper expectations a bit: Don had a lot of neat stuff to tell us, but one thing you will not find in this interview is any discussion of whether or not  Quantum Leap will be coming back. It is Don&#39;s firm belief that Sam is still out there leaping—and Sam has somehow made the conscious choice to continue doing it. It is, as Don puts it, Sam&#39;s life&#39;s work.\n So the heartbreaking ending of the series finale still stands: Sam Beckett never makes it back to his retro-neon 1999 home, and he&#39;s still out there somewhere, working with Al, striving to put right what once went wrong.\n I&#39;m hopeful that we&#39;ll be able to do at least one more episode of &#34;Unsolved Mysteries&#34; with Don— Airwolf, anyone? Stay tuned!\n  Slipping out of long time lurker mode to comment. Thank you for this interview Lee! I could have listened to Don talk for hours. Hopefully your interview helps to introduce a new audience to the show -- great stories and memories for me.\n Don was so nice—and  super accommodating. We shot this at his house, and the film crew rolled up there with this giant Ziggy table that we built (it&#39;s nice having a budget sometimes!), and rather than telling us to GTFO, he said we could set up anywhere we wanted. We fought through connection issues (the producer and I were both dialed in on Zoom, so when Don is looking down and to his left, he&#39;s looking at me and Adam asking him questions on an iPad) and COVID precautions, and the end result was great. He was such a good sport.  I am super hopeful we&#39;ll get to come back and talk Airwolf, too!", "posttime": "2021-07-29 22:58:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "beckett,mysteries", "title": "未解之谜：Quantum Leap 的唐·贝利萨里奥 (Don Bellisario) 关于山姆·贝克特 (Sam Beckett) 的命运", "title_en": "Unsolved Mysteries: Quantum Leap’s Don Bellisario on the fate of Sam Beckett", "transed": 1, "url": "https://arstechnica.com/gaming/2021/05/don-bellisario-talks-to-ars-about-the-unsolved-mysteries-of-quantum-leap/", "via": "", "real_tags": ["beckett", "mysteries"]}, {"category": "", "categoryclass": "", "imagename": "fea1afb2301bac21fb7b81884c959dc4.jpg", "infoid": 1070393, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们终于有了《捉鬼敢死队：来世》的新预告片，它在当前 11 月的发布日期之前被推迟了多次。这部 1980 年代标志性捉鬼敢死队电影的续集为该系列引入了新一代。因此，这部电影由 1980 年代电影导演、《来世》的制片人之一伊万·雷特曼 (Ivan Reitman) 的儿子杰森·雷特曼 (Jason Reitman)（朱诺，谢谢你抽烟）执导是合适的。正如我之前所写的那样，《名利场》在 2019 年 12 月的 [检查笔记] 中首次展示了最新电影，其中有几张剧照——其中一张展示了原版捉鬼敢死队的救护车。根据官方简介，“一位单身母亲和她的两个孩子在从一个以前不为人知的亲戚那里继承了财产后搬到了俄克拉荷马州的萨默维尔。他们发现了他们家族对最初捉鬼敢死队的遗产，他们已经成为一个神话，因为许多人长期以来自从忘记了“1984 年的曼哈顿 Crossrip”的事件”——即原始电影中的事件。 Carrie Coon（The Leftovers）扮演妈妈 Callie，而 Mckenna Grace（The Haunting of Hill House）扮演她热爱科学的女儿 Phoebe。芬恩·沃尔夫哈德（《怪奇物语》）饰演儿子特雷弗。保罗路德（蚁人）饰演暑期学校老师格罗伯森先生。演员阵容还包括洛根金作为播客，塞莱斯特奥康纳作为幸运，奥利弗库珀作为埃尔顿，博基姆伍德宾作为多明戈警长，马龙卡扎迪作为Thickneck，特雷西莱茨作为杰克，以及悉尼梅迪亚兹作为斯威兹。原版演员的许多成员已确认出现在捉鬼敢死队：来世，包括比尔默里（饰演彼得文克曼）、西格妮韦弗（饰演达娜巴雷特）、丹艾克罗伊德（饰演雷斯坦茨）、厄尼哈德森（饰演温斯顿泽德莫尔）和安妮·波茨（饰 Janine Melnitz）。饰演 Egon Spengler 的 Harold Ramis 于 2014 年去世，第一部预告片（于 2019 年 12 月发布）非常清楚地表明 Spengler 是孩子们最近去世的祖父。正如我当时所观察到的那样，“这可能解释了第一部预告片相对柔和、更加沉思的语气：同时哀悼拉米斯的去世，并庆祝他帮助创造的遗产，现在传给了新一代。”我们从 Reitman 对新预告片的细分（嵌入在本文末尾）中了解到更多信息。例如，我们将波茨视为珍妮，尽管目前还不清楚她是否是斯宾格勒的嘉莉的母亲，进而是菲比和特雷弗的祖母。 “我们感觉到 Janine 仍然与 Egon Spengler 有联系，”Reitman 说。“在 84 年的电影中，她爱上了他，显然她仍然与他有联系，并且她试图照顾他年纪大了。”我们还对一些经典的幽灵进行了全新的演绎，最引人注目的是腐烂的出租车司机和绿色的小怪物 Slimer——在这种情况下，它们被重新想象成 Reitman 称之为“Muncher”的同一幽灵类的幽灵。我最喜欢的时刻之一是当地沃尔玛出现了一群淘气的 Stay-Puft 棉花糖男人——他们骑着 Roomba，用他们的一个同胞（他们似乎并不介意）制作 s&#39;mores。那是一条将格罗伯森先生赶出沃尔玛的恐怖犬吗？在最后一幕中，红色电话响起，纹身手臂伸出接听。 Reitman 确认手臂属于 Ray Stantz，他仍在经营 Ray&#39;s Occult Books（正如我们从捉鬼敢死队 II 中了解到的）。至于纹身，这是对雷和温斯顿关于启示录的原始电影中的对话的回调。\n根据雷特曼的说法，最重要的是，这将是一部关于家庭的电影——而不仅仅是斯宾格勒家族。 “我觉得我并没有真正承载斯宾格勒的故事，而是承载了我自己的家庭故事，”他说，“对我来说等了很长时间，对于任何期待下一部捉鬼敢死队电影的人来说也是如此。 “我很高兴能与大家分享。这是一部由一家人制作的关于一家人的电影。我父亲和我迫不及待地想让你在电影院看到它。” 《捉鬼敢死队：来世》目前定于 2021 年 11 月 11 日在美国和 11 月 12 日在英国上映。我们强烈建议您只有在完全接种疫苗的情况下才去影院看电影。", "note_en": "We finally have a new trailer for   Ghostbusters: Afterlife, which was delayed multiple times before landing on its current November release date. This sequel to the iconic  Ghostbusters films from the 1980s introduces a new generation to the franchise. So it&#39;s fitting that the film is directed by Jason Reitman ( Juno,  Thank You for Smoking), son of Ivan Reitman, director of the 1980s films and one of the producers on  Afterlife.\n As  I&#39;ve written previously, Vanity Fair  offered a first look at the latest film in [ checks notes] December 2019, featuring several stills—including one showing the tricked-out ambulance from the original  Ghostbusters. Per the official synopsis, &#34;A single mother and her two children move to Summerville, Oklahoma, after inheriting property from a previously unknown relative. They discover their family&#39;s legacy to the original Ghostbusters, who have become something of a myth, as many have long since forgotten the events of the &#39;Manhattan Crossrip of 1984&#39;&#34;—i.e., the events of the original film.\n  Carrie Coon ( The Leftovers) plays mom Callie, while Mckenna Grace (  The Haunting of Hill House) plays her science-loving daughter Phoebe. Finn Wolfhard (  Stranger Things) plays son Trevor. Paul Rudd ( Ant-Man) plays summer school teacher Mr. Grooberson. The cast also includes Logan Kim as Podcast, Celeste O&#39;Connor as Lucky, Oliver Cooper as Elton, Bokeem Woodbine as Sheriff Domingo, Marlon Kazadi as Thickneck, Tracy Letts as Jack, and Sydney Mae Diaz as Swayze.\n Many members of the original cast have been confirmed to appear in  Ghostbusters: Afterlife, including Bill Murray (as Peter Venkman), Sigourney Weaver (as Dana Barrett), Dan Aykroyd (as Ray Stantz), Ernie Hudson (as Winston Zeddemore), and Annie Potts (as Janine Melnitz). Harold Ramis, who played  Egon Spengler, died in 2014, and the first trailer (which dropped in December 2019) made pretty clear that Spengler is the kids&#39; recently deceased grandfather. As I observed at the time, &#34;that might explain the relatively subdued, more contemplative tone of this first trailer: at once mourning the loss of Ramis and celebrating the legacy he helped create, now handed down to a new generation.&#34;\n    We learn even more from  Reitman&#39;s breakdown of the new trailer (embedded at the end of this post). For instance, we get to see Potts as Janine, although it&#39;s unclear whether she is Carrie&#39;s mother by Spengler and, by extension, grandmother to Phoebe and Trevor. “We get the sense that Janine is still connected to Egon Spengler,&#34; Reitman says. &#34;In the &#39;84 film, she was in love with him and clearly she still has a connection to him and that she was attempting to take care of him in his older age.”\n  We also get fresh takes on some of the classic ghosts, most notably the decaying cabbie and the little green monster, Slimer—in this case, reimagined as a ghost from the same specter class that Reitman has dubbed &#34;Muncher.&#34; One of my favorite moments is the appearance of a bunch of mischievous Stay-Puft marshmallow men in the local Walmart—they ride a Roomba and make s&#39;mores out of one of their compatriots (who doesn&#39;t really seem to mind). And is that a Terror Dog chasing Mr. Grooberson out of the Walmart?\n In the final scene, a red phone rings and a tattooed arm reaches out to answer. Reitman confirms that the arm belongs to Ray Stantz, who is still running Ray&#39;s Occult Books (as we learned from  Ghostbusters II). As for the tattoo, it&#39;s a callback to a conversation in the original film between Ray and Winston concerning the Book of Revelation.\n More than anything, according to Reitman, this will be a film about family—and not just the Spengler family. &#34;I feel like I&#39;m not really carrying the Spengler story, but I&#39;m carrying my own family story,” he says. “It’s been a long wait for me, as it has been for anyone who has anticipated the next Ghostbusters film. And I&#39;m just thrilled to share it with everybody. It&#39;s a movie that was made by a family about a family. My father and I cannot wait for you to see this in theaters.”\n Ghostbusters: Afterlife is currently slated to hit theaters on November 11, 2021, in the US and on November 12 in the UK. We strongly recommend only going to see movies in theaters if you are fully vaccinated.", "posttime": "2021-07-29 22:58:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "面孔,afterlife,reitman", "title": "新捉鬼敢死队：来世预告片戏弄许多熟悉的面孔的回归", "title_en": "New Ghostbusters: Afterlife trailer teases return of lots of familiar faces", "transed": 1, "url": "https://arstechnica.com/gaming/2021/07/new-ghostbusters-afterlife-trailer-teases-return-of-lots-of-familiar-faces/", "via": "", "real_tags": ["面孔", "afterlife", "reitman"]}, {"category": "", "categoryclass": "", "imagename": "179d584b45ea8c216f6a90cd6760b86b.jpg", "infoid": 1070392, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国疾病控制与预防中心周二宣布，完全接种疫苗的美国人应该重新在学校和 COVID-19 高传播或大量传播的地区戴口罩。 CDC 表示，目前 COVID-19 病例激增以及超传染性 delta 变种的传播促使其对口罩指南的彻底逆转，该变种现在在美国占主导地位，被认为具有比以前版本高两倍的传染性病毒的。具体而言，疾病预防控制中心表示，来自美国和其他地方的爆发调查的新数据表明，完全接种 delta 变体的人与未接种疫苗的人感染了 delta 变体，其呼吸道中的病毒载量水平相似。这引起了人们的担忧，即完全接种疫苗的人会将 delta 变体传播给其他人。 “[在美国]发生的绝大多数传播是通过未接种疫苗的个人发生的，”疾病预防控制中心主任罗谢尔·瓦伦斯基在周二的新闻发布会上强调说。她还强调，“疫苗在保护接种疫苗的个体免于重病、住院和死亡，甚至轻症方面继续发挥着非凡的作用。” “但与我们在 5 月份的 alpha 变体不同，我们不相信如果你接种了疫苗，你可以进一步传播，现在的 delta 变体有所不同，”她说。而这个新的担忧“不幸的是需要更新我们的建议。” CDC 现在建议，当当地 COVID-19 传播水平“高”或“大量”时，所有完全接种疫苗的人在室内公共场所戴口罩。该机构将“高”传播定义为在 7 天内在 100,000 人中超过 100 例新的 COVID-19 病例，而“大量”被定义为在 7 天内在 100,000 人中出现 50 至 99 例。这些定义目前适用于该国的大部分地区。 CDC 报告说，截至周二，全国 46% 的县有高传播水平，另有 17% 的县有大量传播。包括阿肯色州、路易斯安那州、佛罗里达州、密苏里州和密西西比州的所有或几乎所有县。最近几周，美国东南部以及中西部的许多地区普遍成为传播的温床。在过去的 7 天内，几个州的许多县的病例率远远超过每 100,000 人 500 人。\n此外，疾病预防控制中心现在建议在所有 K-12 学校中普遍戴口罩。也就是说，所有教师、教职员工和学生，无论是否接种疫苗，都应该在学校戴口罩。和以前一样，未接种疫苗或部分接种疫苗的人——即使是那些从 COVID-19 中康复的人——都应该继续戴口罩，保持社交距离，并尽快接种疫苗。任何对疫苗有疑问的人都应该咨询他们的医生。针对完全接种疫苗的新建议是该机构 5 月 13 日早些时候发布的指导方针的转变，该指南表示，完全接种疫苗的人可以很好地保护免受大流行性冠状病毒的侵害，并且在大多数情况下不再需要戴口罩。然而，该指导方针被认为是突然和不成熟的，自宣布以来一直饱受争议。主要的批评意见是，目前在大多数情况下无法确定疫苗接种状况，它使弱势群体处于危险之中，并且没有考虑到需要采取更多预防措施的当地条件，例如高传播率和低疫苗接种率。 5 月，传播水平呈下降趋势，而 delta 变体尚未在美国蔓延。现在，随着三角洲在全国占据主导地位，全国范围内的病例数激增。在新闻发布会上，瓦伦斯基表示，口罩指南将有助于降低传播率，这对每个人都至关重要——不仅仅是未接种疫苗的人。随着大流行病毒有更多机会传播和感染人类，它也有更多机会变异并演变成更卑鄙的变种。瓦伦斯基警告说，未来的变异可能会进一步阻碍疫苗接种的保护。此外，新的口罩指南不仅会保护不愿接种疫苗的人，还会保护无法得到保护的人。这包括仍然没有资格接种疫苗的儿童和可能没有得到很好保护的免疫功能低下的人。在结束语中，瓦伦斯基谈到了她对新指南的预期挫败感，因为迄今为止大流行的持续时间、心理健康斗争、疫苗犹豫导致可预防的激增，以及现在要求完全接种疫苗的人再次采取缓解措施.\n“戴口罩将成为已经接种疫苗的人们生活的一部分，这不是一个受欢迎的消息，”她承认。但她表示，疾控中心“普遍”咨询的专家支持掩蔽改变。 “这不是我们掉以轻心的事情，我知道这对我和整个美国都很重要。”", "note_en": "Fully vaccinated Americans should go back to masking up in schools and areas of high or substantial COVID-19 transmission, the Centers for Disease Control and Prevention announced Tuesday.\n The CDC says its stark reversal in mask guidance is prompted by the current surge in COVID-19 cases and the spread of the hyper-transmissible delta variant, which is now dominant in the US and thought to be more than twice as contagious as previous versions of the virus.\n Specifically, the CDC says new data from outbreak investigations in the US and elsewhere suggests that fully vaccinated people who have breakthrough infections with the delta variant carry similar levels of viral loads in their respiratory tracts as unvaccinated people infected with the delta variant. This raises concern that fully vaccinated people can spread the delta variant to others.\n &#34;The vast majority of transmission occurring [in the US] is occurring through unvaccinated individuals,&#34; CDC Director Rochelle Walensky emphasized in a press briefing Tuesday. She also highlighted that &#34;the vaccines continue to do an exceptional job at protecting the individual who is vaccinated from severe illness, hospitalization, and death, and even against mild illness.&#34;\n &#34;But unlike the alpha variant that we had back in May, where we didn&#39;t believe that if you were vaccinated you could transmit further, this is different now with the delta variant,&#34; she said. And this new concern &#34;unfortunately warrants an update to our recommendation.&#34;\n  The CDC now recommends that all fully vaccinated people wear a mask in indoor public spaces when local COVID-19 transmission levels are &#34;high&#34; or &#34;substantial.&#34; The agency defines &#34;high&#34; transmission as more than 100 new cases of COVID-19 among 100,000 people in the course of seven days, while &#34;substantial&#34; is defined as 50 to 99 cases among 100,000 over seven days.\n Those definitions currently apply to  a large swath of the country. As of Tuesday, 46 percent of counties nationwide have high transmission levels, and an additional 17 percent of counties have substantial transmission, the CDC reports. All or nearly all counties in Arkansas, Louisiana, Florida, Missouri, and Mississippi are included. The southeastern US has generally become a hotbed of transmission in recent weeks, along with many areas in the Midwest. Many counties in several states have case rates well over 500 per 100,000 in the past seven days.\n    Additionally, the CDC is now recommending universal masking in all K-12 schools. That is, all teachers, staff, and students, regardless of vaccination status, should wear masks in schools.\n As before, people who are unvaccinated or partially vaccinated—even those who have recovered from COVID-19—should continue to wear masks, practice social distancing, and get vaccinated as soon as possible. Anyone who has questions about the vaccines should consult their medical doctor.\n The new recommendations for the fully vaccinated are a turnaround from  the agency&#39;s earlier guidance from May 13, which said that fully vaccinated people are extremely well protected from the pandemic coronavirus and no longer need to mask in most settings. That guidance, however, was seen as  abrupt and premature and has been  dogged by controversy since its announcement. Among the leading criticisms are that it is currently impossible to determine vaccination status in most settings, it put vulnerable people at risk, and it didn&#39;t account for local conditions that could warrant more precautions, such as high transmission and low vaccination rates.\n  In May, transmission levels were on the decline, and the delta variant had not taken hold of the US. Now, with delta dominating the country, cases are spiking nationwide. In the press briefing, Walensky said that the mask guidance will help drag down the transmission rate, which is critical for everyone—not just the unvaccinated.\n As the pandemic virus has more opportunities to spread and infect people, it has more opportunities to mutate and evolve into yet more dastardly variants. Future variants, Walensky cautioned, could further thwart protection from vaccination.\n In addition, the new mask guidance will not just protect those who are unwilling to get vaccinated but also those who are unable to be protected. That includes children who are still ineligible to get vaccinated and immunocompromised people who may not be well-protected.\n In closing remarks, Walensky addressed the frustration she expects in response to the new guidance, given the length of the pandemic so far, mental health struggles, vaccine hesitancy that is causing preventable surges, and fully vaccinated people now being asked to again take mitigation efforts.\n &#34;It is not a welcomed piece of news that masking is going to be a part of people&#39;s lives who have already been vaccinated,&#34; she acknowledged. But she said experts that the CDC consulted &#34;universally&#34; supported the masking change. &#34;This was not something that we took lightly, and it&#39;s something that I know weighs heavily with me and with all of America.&#34;", "posttime": "2021-07-29 22:57:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "口罩,mask,疫苗", "title": "CDC口罩逆转：在激增的许多环境中接种疫苗应戴口罩", "title_en": "CDC mask reversal: Vaccinated should wear masks in many settings amid surge", "transed": 1, "url": "https://arstechnica.com/science/2021/07/cdc-mask-reversal-vaccinated-should-wear-masks-in-many-settings-amid-surge/", "via": "", "real_tags": ["口罩", "mask", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "6a30a1c866800336ae79c320c4e206b3.jpg", "infoid": 1070391, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在通常是一年中增长最慢的季度之一，苹果今天报告称，iPhone 的销量同比增长了近 50%，其他积极数据也超出了分析师的预期。这些数字今天作为苹果季度收益报告的一部分发布。总体而言，苹果在 2021 年第三季度的收入为 814.1 亿美元，同比增长 36%。 iPhone 收入为 395.7 亿美元（增长 49.78%），服务收入为 174.8 亿美元（增长 33%）。 Mac 和 iPad 也有所增长，但增幅较小。 Mac 的收入为 82.4 亿美元，比去年增长 16%，而 iPad 的收入为 73.7 亿美元和 12%。另一个重要数字是苹果的“其他产品”收入，其中主要包括 Apple Watch 和 AirPods 等可穿戴设备。该类别产生了 87.7 亿美元——超过 Mac 或 iPad——同比增长 40%。分析人士认为，苹果公司的持续反弹可部分归因于世界对在家和远程教室工作的关注，随着全球 COVID-19 大流行在某些地区进入新阶段，这种情况仍在继续。苹果连续第六个季度没有为下一季度提供指导。通常情况下，像苹果这样的公司会给投资者一个关于他们预期在下一季度的表现的一般预测，随着这些收益报告的发布，这才刚刚开始。但自大流行开始以来，苹果一直拒绝这样做，称与此相关的各种因素使对未来的可靠预测变得过于具有挑战性。也就是说，苹果预计将在下个季度推出几款新产品，包括新款 iPhone。然而，分析师和苹果都没有预计到 2021 年 iPhone 销量的同比增长将与 2020 年一样大，由于各种因素，2020 年被认为是“超级周期”年。此外，苹果高管警告称，iPhone 和 iPad 的供应限制可能是一个问题，影响公司下一季度的利润。\n可能在下一季度推动苹果收入的其他发展包括新的 Apple Watch、更新版本的 AirPods 以及高性能 Mac，如 16 英寸 MacBook Pro，以及苹果定制设计的 M1 芯片的更新版本。", "note_en": "In what is usually one of its slowest growth quarters in a given year, Apple today  reported a nearly 50 percent year-over-year increase in iPhone sales, among other positive numbers that beat analyst expectations. The numbers were published today as part of Apple&#39;s quarterly earnings report.\n  Overall, Apple saw $81.41 billion in revenue in Q3 of 2021, up 36 percent year over year. iPhone revenue was $39.57 billion (up 49.78 percent), and services raked in $17.48 billion (up 33 percent). The Mac and iPad also grew, albeit by a smaller amount. The Mac generated $8.24 billion, up 16 percent over last year, while the iPad came in at $7.37 billion and 12 percent.\n The other big number is Apple&#39;s &#34;other products&#34; revenue, which primarily includes wearables like Apple Watch and AirPods. That category produced $8.77 billion—more than either the Mac or the iPad—for 40 percent year-over-year growth.\n Analysts believe Apple&#39;s continued rally can be attributed in part to the world&#39;s focus on work from home and remote classrooms, which have continued as the global COVID-19 pandemic has progressed into new phases in some regions.\n    For the sixth quarter in a row, Apple did not provide guidance for the next quarter. Typically, companies like Apple give investors a general prediction about how they expect to perform in the next quarter, which is just beginning as these earnings reports are published.\n But Apple has declined to do so ever since the beginning of the pandemic, saying that various factors related to that make reliable predictions about the future too challenging.\n That said, Apple is expected to introduce several new products in the next quarter, including new iPhones. However, neither analysts nor Apple expect 2021 to be as big a year-over-year a jump for iPhone sales as 2020, which was deemed a &#34;supercycle&#34; year due to various factors. Further, Apple execs cautioned that supply constraints on the iPhone and iPad could be an issue, impacting the company&#39;s bottom line next quarter.\n Other developments that could drive Apple&#39;s revenue in the coming quarter include a new Apple Watch, an updated version of AirPods, and high-performance Macs like the 16-inch MacBook Pro with an updated variant of Apple&#39;s custom-designed M1 chip.", "posttime": "2021-07-29 22:57:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,iphone,报告", "title": "苹果报告 iPhone 销量同比增长 50%", "title_en": "Apple reports a 50% year-over-year jump in iPhone sales", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/apple-reports-a-50-year-over-year-jump-in-iphone-sales/", "via": "", "real_tags": ["apple", "苹果", "iphone", "报告"]}]