[{"category": "", "categoryclass": "", "imagename": "25f414246051c78ad4e00a4f5520cb13.jpg", "infoid": 1004129, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "越来越多的证据表明，冠状病毒比最初出现的更常见，致命性更低。\n证据来自检测一个人血液中的冠状病毒抗体，而不是病毒本身。\n检测发现，美国有大量人被感染，但从未患上重病。当这些轻微的感染被包括在冠状病毒统计数据中时，病毒的危险性就会降低。\n约翰霍普金斯健康安全中心的流行病学家凯特琳·里弗斯(Caitlin Rivers)说，目前对感染死亡风险的最佳估计在0.5%到1%之间。\n这与5%或更高的死亡率形成鲜明对比，根据计算，只有那些病得足够严重的人才能通过检测人体内存在病毒的测试得到诊断。\n修正后的估计支持了美国国家过敏和传染病研究所所长、白宫冠状病毒工作组主要成员安东尼·福奇(Anthony Fuci)博士的早期预测。在3月下旬发表在“新英格兰医学杂志”上的一篇社论中，福奇和他的同事们写道，新冠肺炎的病死率可能会大大低于1%。\n但里弗斯说，即使是病死率低于1%的病毒也构成了巨大的威胁。她说，这比季节性流感的致命性要高出许多倍。\n新的证据来自印第安纳州等地，印第安纳州在5月初完成了大规模测试工作的第一阶段。\n印第安纳州的项目在该州开始出现冠状病毒病例后不久就开始了。州长办公室联系了印第安纳大学理查德·M·费尔班克斯公共卫生学院卫生政策和管理系主任尼尔·梅纳切米。\n州长想要基本的信息，比如有多少人被感染，有多少人会死亡。\n当时，真的很难确定，梅纳切米说。坦率地说，不仅在我们的州，而且在任何州。\n这是因为卫生官员只知道那些病情严重到可以接受病毒检测的人。梅纳切米说，这个数字可能会产生误导。\n他说，这并不能涵盖大量可能被感染但没有寻求医疗服务的人。\n因此，从4月下旬开始，Menachemi与印第安纳州卫生部合作，领导了一项针对全州4600多人的研究。大多数是随机挑选的。\n参与者接受了两次测试。第一个是寻找病毒的标准测试。它显示你是否有活动性感染。第二种是在一个人的血液中寻找病毒抗体的测试。它检测被感染但已经康复的人。\n初步结果显示，冠状病毒感染了该州约3%的人口，即188,000人。\n梅纳切米说，到那时为止，该州18.8万人的人数大约是传统选择性测试确定的人数的11倍。\n对于梅纳切米和他的团队来说，这就像是最终瞥见了整个冠状病毒冰山，而不仅仅是水面上的那部分。\n这些数据使他们能够计算出所谓的感染致死率--感染者死亡的几率。在此之前，科学家们依靠的是所谓的病死率，它计算出出现症状的人死亡的几率。\n印第安纳州的感染死亡率约为0.58%，或者说大约每172名感染者中就有一人死亡。\n印第安纳州的结果与其他几个地区的抗体研究结果相似。例如，在纽约，一项抗体研究表明该州的感染死亡率约为0.5%。\n里弗斯说，佛罗里达州和加利福尼亚州的研究表明死亡率甚至更低，但结果不太确定。\n她说，他们可能招募了比理想情况下更有可能感染的人，这将导致对感染的高估和对感染死亡率的低估。\n加利福尼亚州圣克拉拉县的一项抗体研究使用Facebook广告来寻找参与者-这一策略不太可能吸引随机样本。此外，抗体研究在感染流行率较低的地区进行时会变得不那么准确。\n里弗斯说，计算美国的感染死亡率对研究人员很有用，但对被感染的个人来说就没那么有用了。\n谢天谢地，儿童和年轻人患重病和死亡的风险很低，她说。但是老年人的风险相当高。\n研究表明，一个健康的年轻人死于感染的几率不到千分之一。但对于90多岁的健康状况不佳的人来说，这一比例可能大于十分之一。\n伦敦帝国理工学院研究员朱丽叶·昂温(Juliette Unwin)表示，这意味着美国不同的州应该预期不同的感染死亡率。\n她说，像缅因州和佛罗里达州这样的地方，我们发现感染死亡率比其他人口较年轻的地方要高。\nUnwin是英国一个大型团队的成员，该团队正在监测美国冠状病毒的感染和死亡情况。该研究小组认为美国的感染死亡率在0.7%到1.2%之间。\n伦敦帝国理工学院(Imperial College London)高级讲师萨米尔·巴特(Samir Bhatt)表示，这一点可能会改变和修改，科学界的一切也是如此。但我不认为我们有一个数量级的差距。\n为了更准确地估计全国范围内的感染和感染死亡率，美国国立卫生研究院(National Institutes Of Health)启动了一项抗体研究，将对1万人进行测试。结果将滚动发布。这项研究预计将在2022年初完成。", "note_en": "Mounting evidence suggests the coronavirus is more common and less deadly than it first appeared.\n  The evidence comes from tests that detect antibodies to the coronavirus in a person&#39;s blood rather than the virus itself.\n  The tests are finding large numbers of people in the U.S. who were infected but never became seriously ill. And when these mild infections are included in coronavirus statistics, the virus appears less dangerous.\n  &#34;The current best estimates for the infection fatality risk are between 0.5% and 1%,&#34; says  Caitlin Rivers, an epidemiologist at the Johns Hopkins Center for Health Security.\n  That&#39;s in contrast with death rates of  5% or more based on calculations that included only people who got sick enough to be diagnosed with tests that detect the presence of virus in a person&#39;s body.\n  And the revised estimates support an early prediction by  Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases and a leading member of the White House coronavirus task force. In an  editorial published in late March in  The  New England Journal of Medicine, Fauci and colleagues wrote that the case fatality rate for COVID-19 &#34;may be considerably less than 1%.&#34;\n    But even a virus with a fatality rate less than 1% presents a formidable threat, Rivers says. &#34;That is many times more deadly than seasonal influenza,&#34; she says.\n  The new evidence is coming from places such as Indiana, which completed the first phase of a massive testing effort early in May.\n  Indiana&#39;s program began soon after coronavirus cases began appearing in the state. The governor&#39;s office contacted  Nir Menachemi, who chairs the health policy and management department at Indiana University&#39;s Richard M. Fairbanks School of Public Health.\n  The governor wanted basic information, such as how many people had been infected, and how many would die.\n  At the time, &#34;it was really difficult to know for sure,&#34; Menachemi says. &#34;And frankly, not just in our state, but in any state.&#34;\n     That was because health officials only knew about people who had been sick enough to get tested for the virus. And that number can be misleading, Menachemi says.\n  &#34;It doesn&#39;t capture the vast number of people out there who might be infected but not seeking medical care,&#34; he says.\n  So starting in late April, Menachemi, working with the Indiana State Department of Health, led a study of more than 4,600 people statewide. Most were selected at random.\n  Participants got two tests. The first was the standard test that  looks for the virus. It shows whether you have an active infection. The second was a test that looks for antibodies to the virus in a person&#39;s blood. It detects  people who were infected but have recovered.\n  Preliminary  results showed that the coronavirus had infected about 3% of the state&#39;s population, or 188,000 people.\n  &#34;That 188,000 people represented about 11 times more people than conventional selective testing had identified in the state to that point,&#34; Menachemi says.\n    For Menachemi and his team, it was like finally getting a glimpse of the entire coronavirus iceberg, instead of just the part above the water.\n  And the data allowed them to calculate something called the infection fatality rate — the odds that an infected person will die. Previously, scientists had relied on what&#39;s known as the case fatality rate, which calculates the odds that someone who develops symptoms will die.\n  Indiana&#39;s infection fatality rate turned out to be about 0.58%, or roughly one death for every 172 people who got infected.\n  And the results in Indiana are similar to those suggested by antibody studies in several other areas. In New York, for example, an  antibody study indicated the state has an infection fatality rate around 0.5%.\n  Studies in Florida and California have suggested even lower fatality rates, but the results are less certain, Rivers says.\n  &#34;They may have enrolled people who are more likely to have been infected than would be ideal,&#34; she says, which would lead to an overestimate of infections and an underestimate of the infection fatality rate.\n  An  antibody study in Santa Clara County, Calif., used Facebook ads to find participants — a tactic unlikely to attract a random sample. Also antibody studies become less accurate when conducted in areas where the prevalence of infections is low.\n  Calculating infection fatality rates in the U.S. is useful for researchers but less so for individuals who have been infected, Rivers says.\n  &#34;Thankfully, children and young adults are at low risk of severe illness and death,&#34; she says. &#34;But older adults are at quite high risk.&#34;\n  Studies suggest a healthy young person&#39;s chance of dying from an infection is less than 1 in 1,000. But for someone in poor health in their 90s, it can be greater than 1 in 10.\n  And that means different states in the U.S. should expect different infection fatality rates, says  Juliette Unwin, a research fellow at Imperial College London.\n  &#34;Places like Maine and Florida, we find that the infection fatality ratio is higher than in other places where the demographic is younger,&#34; she says.\n  Unwin is part of a large team in the United Kingdom that is monitoring both infection and mortality from the coronavirus in the United States. The team puts the infection fatality rate for the U.S. at somewhere between 0.7% and 1.2%.\n  &#34;That will be subject to change and revision, as is everything in science,&#34; says  Samir Bhatt, a senior lecturer at Imperial College London. &#34;But I don&#39;t think we have it an order of magnitude out.&#34;\n  To get a more precise estimate of infections and the infection fatality rate nationwide, the National Institutes of Health has launched an antibody study that will test 10,000 people. Results will be released on a rolling basis. The study is expected to  wrap up in early 2022.", "posttime": "2020-05-29 03:26:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冠状病毒,coronavirus,病毒,抗体,antibody", "title": "冠状病毒抗体检测显示感染死亡率较低", "title_en": "Coronavirus Antibody Testing Shows Lower Fatality Rate For Infection", "transed": 1, "url": "https://www.npr.org/sections/health-shots/2020/05/28/863944333/antibody-tests-point-to-lower-death-rate-for-the-coronavirus-than-first-thought", "via": "", "real_tags": ["冠状病毒", "病毒", "抗体", "antibody"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时一个好的想法会有一个糟糕的实现，这通常会导致讨论变成只看到糟糕实现的人和只看到好想法的人之间的争吵。有时，当谈到智能设备或物联网(又名垃圾)时，似乎更像是一如既往。想想不那么不起眼的智能肉类温度计吧。不起眼的肉类温度计是一根金属棒，一端有数字，打开烤箱门后，你可以把它插入烤肉中，同时尽量不让你的脸融化。我有一个稍微花哨一点的电子版本，导线更长，这样我就可以把它插到烤箱里，然后关上门，当达到想要的温度时，它就会发出嘟嘟声。不过，界面相当笨重，由三个按钮和一个七段LCD组成，需要按下、按住、充电、释放街头战士的动作才能切换模式并进入目标温度。它还能更聪明吗？我可以用手机监控的具有蓝牙功能的智能温度计可能会很不错。我甚至可以在厨房外监控进度。在325度和425度之间切换，才能真正做得很好，只需要不到24次的按钮按下即可。是个好主意吗？另一方面，只能通过连接到Facebook账户的云门户控制的智能温度计似乎是这个想法的相当糟糕的实现。它将受到一定程度的鄙视，任何暗示它在任何方面都可能有用的人都会如此。不幸的是，像后者这样的产品似乎相当常见。我家里的大多数东西仍然相当愚蠢，因为遗憾的是，很少有产品是真正相同的，但更智能。相反，智能设备不可避免地是某种高深莫测的机器智能，在我家里实实在在地表现出来。所以不用了，谢谢。战线划好了，每个人都选一个阵营，好主意还是坏执行，战斗起来！事实上，我对技术先进的肉类温度计并没有强烈的看法，而且我的温度计几乎永远都没有用过，但它似乎是一个令人愉快的分裂的例子。这个串扰类似于XY问题，现在我们有了YX解决方案。批评者只关注它的运作方式，而忽略了它试图解决的问题，而倡导者则掩盖了明显的缺陷，想象它可能会有所不同，即使它不是。当以两种不同的频率喊叫时，实际上很少进行交流。我只能推测原因，但我想一个可能的怀疑是，只有大胆的特征才能引起足够高的管理层的注意，才能获得批准。或者有一种自上而下的推力来赢得宾果游戏。我们需要Facebook集成，这样你就可以喜欢一个食谱，并让它自动编程温度计。然后，我们将付钱给一些影响食品的人，让他们在他们的网站上添加Metremeter9000徽章，销售额将会飙升。允许用户使用手机应用程序控制一副无线耳机上的消噪配置文件，而不是进一步扰乱耳机本身，这是一个好主意。要求用户首先同意新更新的服务条款，而这些条款在手机处于飞行模式时无法下载，这是一种糟糕的实现方式。我不明白索尼为什么要这么做。(编辑注意：更明智地重新排列这些段落的顺序。)。有时，这种现象甚至会渗透到软件开发中，有人会解决问题，但却使用了错误的解决方案，我们对此深恶痛绝。\n发布时间：2020年5月27日07：47更新：27年5月27日07：47标记：软件思想", "note_en": "Sometimes there&#39;s a bad implementation of a good idea, which typically results in discussions turning into shouting matches between people who see only the bad implementation and people who see only the good idea. And sometimes seems more like always when it comes to smart devices, or the internet of things, aka ioshit. Consider the not so humble smart meat thermometer. The humble meat thermometer is a metal stick with numbers on one end that you stab into the roast after opening the oven door, all while trying not to melt your face. I have a slightly fancier electronic version with a longer lead, such that I can leave it plugged into the roast and close the door, and it beeps when the desired temperature is reached. The interface is rather cumbersome, though, consisting of three buttons and a seven segment LCD, requiring some press, hold, charge, release street fighter moves to switch modes and enter the target temperature. Could it be smarter? A bluetooth enabled smart thermometer I could monitor from my phone might be kinda nice. I could monitor progress from outside the kitchen, even. Switching between 325 and 425 degrees, for that really well done finish, would require fewer than two dozen button presses. A good idea? On the other hand, a smart thermometer which can only be controlled via a cloud portal connected to a facebook account seems like a rather bad implementation of that idea. It will receive a certain amount of scorn, as will anyone who suggests it could be in any way useful. Unfortunately products like the latter seem quite common. Most things in my house are still rather dumb because regrettably few products are actually the same thing, but smarter. Instead smart devices are inevitably some inscrutable machine intelligence physically manifested in my house. So no thanks. Battle lines drawn, everybody pick a side, good idea or bad implementation, and fight! I don&#39;t actually have strong opinions about technologically advanced meat thermometers, and haven&#39;t used mine in just about forever, but it seemed like a pleasingly divisive example. This crosstalk is similar to that of the XY problem, where now we have a YX solution. Detractors focus only on how it works, ignoring what it tries to address, while advocates gloss over the obvious faults imagining that maybe it could be different, even if it&#39;s not. Very little communication actually takes place when shouting at two different frequencies. I can only speculate as to the causes, but I imagine one likely suspect is that only bold features catch the attention of someone high enough up in management to get approval. Or there&#39;s a topdown push to win at bingo. We need facebook integration so that you can like a recipe and have it automatically program the thermometer. Then we&#39;ll pay some food influencers to add Meatrometer9000 badges to their site and sales will go through the roof. Allowing the user to control the noise cancelling profile on a pair of wireless headphones with a phone app instead of further cluttering the headphones themselves is a good idea. Requiring the user to first agree to freshly updated terms of service which cannot be downloaded while the phone is in airplane mode is a bad implementation. I don&#39;t why Sony does that. (Note to editor: reorder these paragraphs more sensibly.) Sometimes this phenomenon even seeps into software development where somebody will solve a problem, but uses the wrong solution, and we hate it.\n Posted 27 May 2020 07:47 by tedu Updated: 27 May 2020 07:47  Tagged:  software  thoughts", "posttime": "2020-05-29 03:25:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "实现,idea,智能", "title": "好主意糟糕的实现串扰", "title_en": "Good idea bad implementation crosstalk", "transed": 1, "url": "https://flak.tedunangst.com/post/good-idea-bad-implementation-crosstalk", "via": "", "real_tags": ["实现", "idea", "智能"]}, {"category": "", "categoryclass": "", "imagename": "045874bc4e5e6f02a7637c162eecdc54.png", "infoid": 1004125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的30年里(而且还在继续)，“辛普森一家”在数千集的插曲和故事情节中，以轻松的方式讲述了文化和技术的变化和变化，为数百万人带来了娱乐。在屏幕的另一边，视频技术的进步改变了该系列的制作和呈现方式，为今天呈现这些内容提供了一个有趣的挑战。\n这篇文章描述了这一挑战，以及为迪士尼+带来更多“辛普森一家”精彩内容的方法。\n“辛普森一家”第一次首映是在1989年，那是在模拟电视时代，当时的电视是4：3宽高比的标清电视，而“辛普森一家”是以SD4：3格式制作的。随着高清晰度技术变得越来越普及(也变得负担得起)，“辛普森一家”采用了高清，这也意味着改变了高清典型的更宽、更长方形的16：9宽高比。(转向高清是在2009年第20季的中期。)。\n今天销售的大多数显示器都是16：9高清的，所以那些早期的剧集被重新录制成高清，这使得演示文稿很棒，充满了屏幕，但这意味着要对内容进行重新框格，将原始帧的顶部和底部裁剪掉。\n裁剪产生了从一些场景中排除视觉上下文的副作用，限制了一些有趣的视线恶作剧的影响：\n虽然该系列的所有剧集最初都是在迪士尼+上以16：9的比例提供的，但目标是同时提供原始的4：3宽高比和16：9的版本，让人们可以选择观看哪种格式，特别是对我们的超级粉丝来说。\n最好的用户体验将是平等对待4：3和16：9版本，支持所有迪士尼+产品功能和内容交互机制，同时增加新的APP功能-宽高比选择。\n无论当前的纵横比模式如何，都必须保持现有的功能，包括继续观看、监视列表，以及通过按顺序自动播放剧集的功能。(考虑到如果将4：3版本添加为独立的奖励内容，这些功能将不受支持，因此该选项将被放弃。)\n效率是另一个目标。在4：3和16：9的428集中，数以千计的音频和字幕组件已经直播，以及特定于剧集的插图和元数据-这些都在不同的纵横比之间没有不同。视听内容在4：3和16：9版本之间在时间上是相同的，因此重用所有这些现有组件意味着有机会避免交付、处理、质量控制和存储数千个已在迪士尼+上实时和活跃使用的资产的副本的冗余。\n在进入解决方案之前，需要简要概述内容是如何建模的。\n内容包由视听组件(视频、各种音频语言和格式、字幕)以及功能元数据和显示元数据(插图、标题、描述、字幕等)组成。这通常意味着每集都有几十个相关的资产，所有这些资产都必须在从斯普林菲尔德到你的城镇的路上被识别出来进行追踪。\n内容被固定到称为EIDR ID的唯一标识符，该标识符代表基础创作作品及其相应的视听版本。这些ID是媒体和娱乐业的标准，由非营利性的娱乐标识符注册协会管理。\nEIDR不仅用来引用视听内容和相关技术和元数据，而且还用来链接相关权利和日程安排信息，这些信息规定了内容可以在哪里和何时可用。(根据内容许可的具体情况，这可能会因地区而异。)。\n在迪士尼流媒体服务(DSS)摄取和处理内容之前，必须将其打包，以便由我们的工作室运营合作伙伴交付。此打包过程使用另一个行业标准MovieLabs Digital Distribution Framework(MDDF)，该标准定义了表示内容资产和关联元数据的方法，以便我们的媒体管道可以理解它们。您可以将MDDF看作一组指令，这些指令规定了内容最终如何驱动在Disney+上的播放体验。\n现有内容模型中的固有假设是视频编辑将是单一和唯一的。虽然可以关联多个音频或字幕组件，但视频将是EIDR ID的锚。\nDSS团队对有机会确定和挑战假设感到兴奋，在审查了涉及多个EIDR的方法的利弊并创建了它们之间的复杂关系之后，很明显，最干净的前进道路是对内容模型进行根本更改，以打破任何给定的包中都只有一个视频版本的假设。\n引入了多媒体“面”的概念，即音频、视频和字幕组件的灵活组合。在公共EIDR下交付的组件现在可以以多种组合进行分组，从而提供重用现有资源的能力，并为在保持现有内容交互功能的同时支持用户对长宽比偏好的偏好奠定基础。\nMovieLabs数字分发框架(MDDF)是一套标准和规范，旨在实现内容提供商和向客户流式传输内容的平台之间的数字供应链自动化。支持“方面”的方法涉及将我们的供应链迁移到最新版本的Media Manifest Core(MMC)规范，以便利用一个表示附加纵横比的新子类型数据字段。\n这些方面共享共同的元素，4：3的视频是对现有字幕和音频的补充。客户端已更新，以提供新的UI控件来指示纵横比首选项，并基于该设置请求适当的方面。无论选择什么纵横比，都可以继续观看并自动播放下一集。\n这是一项令人着迷的挑战。刻面的新概念有效地支持了迪士尼+上的新型内容展示，为未来展示内容的新颖方式提供了令人兴奋的机会。", "note_en": "The Simpsons has entertained millions with lighthearted takes on cultural and technological changes and shifts within its gags and storylines across thousands of episodes over the past 30 years (and counting). On the other side of the screen, technology advancements in video have changed the very ways in which the series is produced and presented, providing an interesting challenge when it comes to presenting that content today.\n This post describes that challenge, along with the approach that was taken to bring more great  The Simpsons content to Disney+.\n The Simpsons first premiered in 1989, back in the days of analog television when TVs were standard definition with a 4:3 aspect ratio, and  The Simpsons was produced in an SD 4:3 format. As high definition technology became more prevalent (and affordable),  The Simpsons adopted HD, which also meant a change to the wider, more rectangular 16:9 aspect ratio typical of HD. (The switch to HD occurred during the middle of the 20th season, in 2009.)\n Most displays sold today are 16:9 HD, so those early episodes were remastered for HD, which made for a great, screen-filling presentation, but meant re-framing the content, cropping out the top and bottom of the original frames.\n The cropping yields the side-effect of excluding visual context from some scenes, limiting the impact of some funny sight gags:\n  While all episodes in the series were initially provided on Disney+ in 16:9, the goal was to provide both the original 4:3 aspect ratio and the 16:9 versions, providing a choice as to which format to watch, especially for our super fans.\n The best user experience would be achieved by treating 4:3 and 16:9 versions equally, supporting all Disney+ product features and content interaction mechanisms, while adding a new app feature — choice of aspect ratio.\n Existing features including Continue Watching, Watchlists, and the ability to binge by auto-playing episodes in sequential order had to be maintained regardless of the current aspect ratio mode. (Given those features wouldn’t be supported were the 4:3 versions to be added as standalone bonus content, that option was discarded.)\n Efficiency was another goal. Thousands of audio and subtitle components were already live for the 428 episodes existing in both 4:3 and 16:9, along with episode-specific artwork and metadata — none of which differed between the different aspect ratios. The audiovisual content is temporally identical between 4:3 and 16:9 versions, hence re-using all of those existing components meant an opportunity to avoid the redundancy of delivering, processing, QC’ing, and storing copies of thousands of assets that were already live and actively in use on Disney+.\n Before getting into the solution, a brief overview of how content is modeled is called for.\n  A content package consists of audiovisual components (video, various audio languages and formats, subtitles) and both functional and display metadata (artwork, title, description, credits, etc.). This generally means dozens of related assets for each episode, all of which must be identified for tracking as they make their way from Springfield to your town.\n Content is pinned to unique identifiers called EIDR IDs, which represent the underlying creative work and its corresponding audiovisual editions. These IDs are a standard within the media &amp; entertainment industry and are administered by the non-profit  Entertainment Identifier Registry Association.\n The EIDR is used not only to reference the audiovisual content and related art and metadata, but also to link associated rights and scheduling information that dictate where and when the content can be made available. (This can vary from territory to territory given specifics of content licensing.)\n Before the content can be ingested and processed by Disney Streaming Services (DSS), it has to be packaged for delivery by our partners in Studio Operations. This packaging process makes use of another industry standard, the MovieLabs Digital Distribution Framework ( MDDF), which defines the methods for representing content assets and associated metadata so they can be understood by our media pipeline. You can think of MDDF as a set of instructions that dictate how the content ultimately drives the playback experience on Disney+.\n An inherent assumption in the existing content model was that the video edit would be singular and unique. While multiple audio or subtitle components could be associated, the video would be the anchor for the EIDR ID.\n  The DSS team was excited by the opportunity to identify and challenge assumptions, and after reviewing the pros and cons of approaches involving multiple EIDRs and creating complex relationships between them, it was clear that the cleanest path forward was to make a fundamental change to the content model to break the assumption that only a single version of video would be present in any given package.\n The concept of multiple media “facets,” or flexible combinations of audio, video, and subtitle components, was introduced. Components delivered under a common EIDR can now be grouped in multiple combinations, providing the capability to re-use existing assets, and laying the groundwork to support a user preference for aspect ratio preference while maintaining existing content interaction features.\n The MovieLabs Digital Distribution Framework (MDDF) is a suite of standards and specifications created with the goal of achieving digital supply chain automation between content providers and the platforms that stream content to customers. The approach to support “facets” involved migrating our supply chain to the latest version of the Media Manifest Core (MMC) specification in order to leverage a new subType data field, which signals the additional aspect ratio.\n  Those facets share common elements, with 4:3 video being additive to existing subtitles and audio. Clients were updated to provide a new UI control to indicate the aspect ratio preference, and request the appropriate facet based on that setting. Regardless of chosen aspect ratio, Continue Watching and autoplay of the next episode behave as expected.\n  This was a fascinating challenge to meet. The new concept of facets efficiently supports new types of content presentations on Disney+, opening up exciting opportunities for novel ways of presenting content in the future.", "posttime": "2020-05-29 02:53:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "带来,aspects,内容", "title": "为迪士尼+带来“辛普森一家”的新面貌", "title_en": "Bringing New Aspects of “The Simpsons” to Disney+", "transed": 1, "url": "https://medium.com/disney-streaming/bringing-new-aspects-of-the-simpsons-to-disney-d6067226556e", "via": "", "real_tags": ["带来", "aspects", "内容"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年夏天不想回到办公室的谷歌员工可以开始购买一间漂亮的家庭办公室。\n这家搜索巨头周二表示，将从7月6日开始允许员工回到办公室，并将在整个夏末和初秋逐步增加面对面出席人数。该公司表示，选择呆在家里的员工将被允许花费高达1000美元购买站立式办公桌和符合人体工程学的椅子等家庭办公需求。\n谷歌首席执行官桑达尔·皮查伊(Sundar Pichai)在一份备忘录中告诉员工，谷歌预计7月4日假期后将有10%的员工返回办公室，目标是在9月份之前让30%的员工从远程工作中返回办公室。\n在上周发表在《连线》杂志上的采访中，皮查伊表示，他预计谷歌不会放弃其实体办公空间，这些空间因向员工提供免费干洗、餐饮和健身课等福利而闻名。\n“在所有情况下，我都希望我们需要物理空间来让人们聚在一起，绝对是这样。我们有大量的增长计划在前面，“皮查伊说。“因此，即使有一些路线修正，我认为我们现有的足迹也不会成为问题所在。”\n在谷歌宣布这一消息的几天前，Facebook首席执行官马克·扎克伯格表示，这家社交网络巨头的一半员工可能在未来5到10年内远程工作，Facebook将开始允许某些员工全职在家工作。", "note_en": "Google employees who don’t want to return to the office this summer can start shopping for a nice home office.\n The search giant said Tuesday that it will begin letting employees come back to the office beginning July 6, and will gradually ramp up its in-person attendance throughout late summer and early fall. Employees who choose to stay home, the company said, will be allowed to expense up to $1,000 for home office needs like standing desks and ergonomic chairs.\n Google expects 10 percent of employees to return to the office following the July 4 holiday, CEO Sundar Pichai  told employees in a memo, and aims to have 30 percent of its workforce return from remote work by September.\n In an interview published in Wired magazine last week, Pichai said he doesn’t expect Google to abandon its physical office spaces, which have become famous for the perks they provide employees such as free dry cleaning, meals and workout classes.\n “In all scenarios I expect us to need physical spaces to get people together, absolutely. We have a lot of growth planned ahead,” Pichai said. “So even if there is some course correction, I don’t think our existing footprint is going to be the issue.”\n Google’s announcement comes days after Facebook CEO Mark Zuckerberg said half of the social networking giant’s employees could be  working remotely within the next five to 10 years, and that Facebook will begin allowing certain employees to work from home on a full-time basis.", "posttime": "2020-05-29 02:52:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,员工,employees", "title": "谷歌员工可以花费价值1000美元的办公家具", "title_en": "Google employees can expense $1000 worth of Office furniture", "transed": 1, "url": "https://nypost.com/2020/05/26/google-will-let-workers-expense-1000-worth-of-office-furniture/", "via": "", "real_tags": ["google", "谷歌", "员工", "employees"]}, {"category": "", "categoryclass": "", "imagename": "e0b7c8b259b322c2ecebf32c02274996.png", "infoid": 1004123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "议长佩洛西、少数党领袖麦卡锡、主席麦戈文、资深成员科尔、主席纳德勒、资深成员乔丹：\n5月13日，两党59名参议员-24名共和党人和35名民主党人-投票支持对2020年美国自由重新授权法案H.R.6172的怀登-戴恩斯修正案。尽管又有两名民主党参议员支持这项措施，其中一名是共同发起人，但他们无法出席投票。\n谢天谢地，国会内部和公众对基本政策的支持现在都非常明显：联邦调查局不应该被允许在没有搜查令的情况下使用爱国者法案来监视美国人的在线活动。互联网搜索和浏览历史在本质上是极其暴露的，第四修正案需要搜查令才能获得这些信息。正如莱利最高法院所指出的那样，“例如，可以在一部可以上网的手机上找到互联网搜索和浏览历史，这可能会揭示个人的私人兴趣或担忧--也许是搜索某些疾病症状，再加上经常访问WebMD。”[1]第215条从来没有打算允许政府收集这样的信息，怀登-戴恩斯修正案将使这一禁令变得清晰明了。[1]第215条从来没有打算允许政府收集这样的信息，怀登-戴恩斯修正案将使这一禁令变得非常明确。鉴于政府没有披露它是否相信它已经可以根据第215条收集这些信息，反映在Wyden-Daines修正案中的亮线规则是迫切需要的。\n因此，我们敦促您只提出包含Wyden-Daines修正案的H.R.6172修正案，或提供在会场就修正案进行表决的机会。这一点特别重要，因为与参议院不同的是，众议院议员被剥夺了任何辩论修正案的机会，以弥补H.R.6172中的缺陷。此外，自众议院通过H.R.6172以来发布的报告显示，更多的监控滥用，这进一步强调了进一步改革的必要性。\nH.R.6172在众议院通过后，没有机会修改或修复其缺陷，而且它的两个原始发起人都宣布支持更重大的隐私改革，136名议员投票反对这项措施。65名共和党人，70名民主党人和1名无党派人士投了反对票，因为它未能充分保护隐私。因此，有了怀登-戴恩斯修正案，美国自由再授权法案很可能会比以前获得更多的支持。在我们历史上的艰难时期，这将是一个值得欢迎的两党达成协议的时刻，以捍卫所有美国人的自由。\n这项改革正是为了避免过去20年来令人对美国情报机构失去信任的丑闻重演，事实上，这将有助於消除公众的严重担忧，即在这个危机时期，公民自由面临着更高的风险。这是联邦调查局过去错误针对的许多团体的严重关切，包括活动人士、有色人种社区和媒体，由于这项措施在参议院获得了充分支持，抓住这一时刻捍卫美国公民自由的决定权完全掌握在你们手中。\n立即访问，WNY访问，美国自由表达书商，美国公民自由联盟，美国家庭之声，美国记者和作家协会(ASJA)，美国-阿拉伯反歧视委员会，阿拉伯美国公民理事会，阿拉伯美国人研究所，生物多样性中心，民主与技术中心，共同防御，宪法联盟，美国-伊斯兰关系委员会，加州勇气，捍卫权利和AMP；异议，要求进步，DuckDuckGo，正当程序研究所，平等实验室，为未来而战，新闻自由行动，言论自由联盟，新闻基金会自由，自由工作，政府问责项目，政府信息观察，人权观察，公正外交政策，库尔特·冯内古特博物馆和图书馆，MediaJustice，运动联盟项目，mpower change，MSA West，穆斯林正义联盟，全国有色人种协进会(NAACP)，全国刑事辩护律师协会，全国联盟。美国开放技术学院，PEN美国，美国方式人民，Poligon教育基金，Presente Action，Progress America，Restore the Fourth，RootsAction.org，Secure Justice，专业记者协会，TechFreedom，关注科学家联盟，X-Lab，也门联盟委员会。\n[1]“莱利诉加利福尼亚州”案，载于“美国最高法院判例汇编”第573卷，第395-96页(2014年)。[2]美国司法部监察长办公室，联邦调查局局长关于执行伍兹程序向外国情报监视法庭提交的涉及美国人的申请的管理咨询备忘录，载于2020年3月，https://oig.justice.gov/reports/2020/a20047.pdf.。", "note_en": "Speaker Pelosi, Minority Leader McCarthy, Chairman McGovern, Ranking Member Cole, Chairman Nadler, and Ranking Member Jordan:\n On May 13, a bipartisan majority of 59 Senators — 24 Republicans and 35 Democrats — voted in support of the Wyden-Daines amendment to H.R. 6172, the USA FREEDOM Reauthorization Act of 2020. Though two more Democratic Senators supported the measure, one being a cosponsor, they were unable to be present for the vote.\n Thankfully, support for the underlying policy is now abundantly clear, both within Congress and among the public: the FBI should not be allowed to use the PATRIOT Act to surveil Americans’ online activity without a warrant. Internet search and browsing history is extremely revealing in nature and the Fourth Amendment requires a warrant to obtain this information. As the Supreme Court in Riley noted, “An Internet search and browsing history, for example, can be found on an Internet-enabled phone and could reveal an individual&#39;s private interests or concerns — perhaps a search for certain symptoms of disease, coupled with frequent visits to WebMD.”[1] Section 215 was never intended to allow the government to collect such information, and the Wyden-Daines amendment would make this prohibition crystal clear. Given the government’s failure to disclose whether it believes it can collect this information under Section 215 already, the bright-line rule reflected in the Wyden-Daines amendment is sorely needed.\n Accordingly, we urge you to only move H.R. 6172 with the inclusion of the Wyden-Daines amendment, or to provide an opportunity to vote on the amendment on the floor. This is particularly critical because, unlike the Senate, members of the House were denied any opportunity to debate amendments to cure the deficiencies in H.R. 6172. Additionally, reports released since House passage of H.R. 6172 have revealed additional surveillance abuses, which further underscore the need for additional reforms.[2]\n After H.R. 6172 moved through the House without the opportunity to amend it or cure its defects, and after both of its original sponsors announced support for more significant privacy reforms, 136 members voted against the measure. 65 Republicans, 70 Democrats, and 1 Independent voted against it because it failed to sufficiently protect privacy. Therefore, with the Wyden-Daines amendment, it is likely that the USA FREEDOM Reauthorization Act would pass with more support than before. This would be a welcome moment of bipartisan agreement, in defense of all Americans’ liberties, during a trying period in our history.\n This reform is precisely designed to stave off the kind of scandals that led to a dramatic loss of trust in United States intelligence agencies over the past two decades.Indeed, this would help address serious concerns among the public that civil liberties are at a heightened risk during this time of crisis. This is an acute concern for the many groups that the FBI has wrongfully targeted in the past, including activists, communities of color, and the press.With ample support for this measure secured in the Senate, the decision to seize this moment in defense of Americans’ civil liberties is exclusively in your hands.\n   Access Now,ACCESS of WNY,American Booksellers for Free Expression,American Civil Liberties Union,American Family Voices,American Society of Journalists and Authors (ASJA),American-Arab Anti-Discrimination Committee,Arab American Civic Council,Arab American Institute,Center for Biological Diversity,Center for Democracy &amp; Technology,Common Defense,Constitutional Alliance,Council on American-Islamic Relations,Courage California,Defending Rights &amp; Dissent,Demand Progress,DuckDuckGo,Due Process Institute,Equality Labs,Fight for the Future,Free Press Action,Free Speech Coalition,Freedom of the Press Foundation,FreedomWorks,Government Accountability Project,Government Information Watch,Human Rights Watch,Just Foreign Policy,Kurt Vonnegut Museum and Library,MediaJustice,Movement Alliance Project,MPower Change,MSA West,Muslim Justice League,National Association for the Advancement of Colored People (NAACP),National Association of Criminal Defense Lawyers,National Coalition Against Censorship,New America&#39;s Open Technology Institute,PEN America,People For the American Way,Poligon Education Fund,Presente Action,Progress America,Restore The Fourth,RootsAction.org,Secure Justice,Society of Professional Journalists,TechFreedom,Union of Concerned Scientists,X-Lab,Yemeni Alliance Committee\n  [1] Riley v. California, 573 U.S. 373, 395-96 (2014).[2] OFFICE OF THE INSPECTOR GENERAL, U.S.DEP’T OF JUSTICE, MANAGEMENT ADVISORY MEMORANDUM FOR THE DIRECTOR OF THE FEDERAL BUREAU OF INVESTIGATION REGARDING THE EXECUTION OF WOODS PROCEDURES FOR APPLICATIONS FILED WITH THE FOREIGN INTELLIGENCE SURVEILLANCE COURT RELATING TO U.S. PERSONS, at 3 (March 2020), https://oig.justice.gov/reports/2020/a20047.pdf.", "posttime": "2020-05-29 02:37:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "保存,internet,美国", "title": "保存Internet隐私", "title_en": "Save Internet Privacy", "transed": 1, "url": "https://www.saveinternetprivacy.org/", "via": "", "real_tags": ["保存", "internet", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004122, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在很大程度上，现在的网络字体比以往任何时候都要快。随着浏览器供应商更加标准化的FOUT/FOIT行为，到更新的字体显示规范，性能-因此用户-似乎终于被放在了首要位置。\n人们普遍认为自托管字体是最快的选择：相同的来源意味着减少网络协商，可预测的URL意味着我们可以预加载，自托管意味着我们可以设置自己的缓存控制指令，完全所有权可以降低将静态资产留在第三方来源的风险。\n这就是说，像谷歌字体这样的服务的便利性怎么夸大都不为过，它们能够为特定的用户代理和平台提供尽可能小的字体文件，这是令人惊叹的，而且有如此庞大的、免费可用的库，这些库是由谷歌级别的CDNS…提供的。我当然明白为什么人们会继续求助于它。\n在这个性能是游戏唯一名称的网站上，我完全放弃了网页字体，而是选择使用访问者的系统字体。这是快速的，令人难以置信地非常适合所讨论的设备，并且几乎没有工程开销。但是，在哈里，我真的很想把谨慎抛诸脑后。让它见鬼去吧！让我们有一个网络字体！\n在原型开发过程中，我求助于Google字体，他们最近通过URL参数(&amp；display=swap)支持font-display的能力，我知道它会保持相当快的速度。然后我有了一个主意。\n提示：如果您要为Google字体使用`font-display`，那么异步加载整个请求链是有意义的。pic.twitter.com/k6obyVZGZP。\n-HarryRoberts(@csswizarry)2020年5月11日。\n虽然font-display：exchange；是一个巨大的胜利，但仍然有很多东西让我感到不安。我还能做些什么来让Google字体变得更快呢？\n我对harry.is和csswizardry.com主页运行了相同的测试套件。我是从harry开始的，因为那是我使用谷歌字体的地方，但我觉得它太简单了，不太现实。因此，我多次克隆CSS Wizarry主页，并在那里实现了各种不同的方法。对于这篇文章的每个部分，我都会列出两个网站的结果。我的变体是：\n此外，每个变体都是相加的-它包括前一个变体以及它自己的添加。我没有尝试只是预加载或异步，因为这是没有意义的-我们知道组合会比他们的任何一个都要好。\nFirst Contentful Paint(FCP)：我们多久才能真正读到一些东西，不管它是不是网络字体？\n视觉上完整(VC)：什么时候一切都确定下来了(一个代理，但与Last Web Font相当)？\n注：所有测试都是使用私有WebPagetest实例进行的(WebPagetest目前已关闭，因此我无法使用公共实例，这意味着我无法共享任何URL-抱歉)。具体的配置文件是基于3G的SamsungGalaxy S4。\n为了使代码片段更易于阅读，我将用$css替换https://fonts.googleapis.com/css2?family=Roboto:ital，wight@0,400；0,700；1,400；1,700的所有实例。\n谷歌字体在过去一年左右的时间里发挥了很大的作用。默认情况下，任何新创建的Google字体片段都带有&amp；display=swap参数，该参数将font-display：swap；注入到所有@font-face at-Rule中。该参数的值可以是SWAP、OPTIONAL、FLABACK或BLOCK中的任何一个。你可以在MDN上阅读更多。\n然而，对于我的基线，我打算重新修剪字体显示。这是许多网站可能仍将使用的遗留格式，它使得比较基准更合适。\n好的。这是我们的基线。Google字体文件是这两个测试中唯一拥有的渲染块外部资源，我们可以看到它们都有完全相同的第一个画图。在这些实验中，有一件事让我感到高兴，那就是Google字体的一致性。\n第一个是没有网页字体加载解决方案的结果(例如font-display)；第二个是同步Google字体CSS文件的结果。\n在此测试中，我添加了&amp；display=exchange。实际上，这使得字体文件本身是异步的-浏览器立即显示我们的回退文本，然后在它到达时切换到Web字体。这意味着我们不会让用户看到任何看不见的文本(Foit)，这为Botha带来了更快、更愉快的体验。\n注：如果你努力定义一个合适的Fallback来在此期间显示，这只会更令人愉快-在选择Open Sans之前，闪烁一页满是Times New Roman的页面可能会是一种更糟糕的体验。谢天谢地，莫妮卡不仅让这一过程变得简单，而且出人意料地有趣。如果没有她的Font StyleMatcher，我不可能做到这一点。\n我们没有从关键路径中删除任何渲染块资源，所以我不希望在First Paint中看到任何改进。事实上，虽然harry.is保持不变，但CSS Wizarry慢了200ms。然而，我们确实看到的是，在第一次满意的绘画中有了戏剧性的进步--比第二次哈雷。是！在harry.is基础上改进的第一种网络字体，但不是oncsswizardry.com。视觉上完整的速度慢了200毫秒。\n我很高兴地说，对于最重要的指标，我们的速度要快700-1200毫秒。\n虽然这确实大大缩短了呈现Web字体所需的时间，但它仍然是在同步CSS文件中定义的--我们只能期望从这一举措中获得如此大的改善。\n引用我自己的话：如果您要对GoogleFonts使用font-display，那么异步加载整个请求链是有意义的。正是这个最初的想法导致了我的tweet-如果我有效地使CSS文件的内容异步，那么让CSS文件本身完全同步就有点糟糕了。\n使CSS异步是使用Critical CSS所涉及的关键技术之一。虽然有很多方法可以做到这一点，但我敢说最简单、最普遍的方法就是长丝集团的平面媒体排版。\n这将隐含地告诉浏览器以非阻塞方式加载CSS文件，仅将样式应用于打印上下文。但是，一旦文件到达，我们就告诉浏览器将其应用于所有上下文，从而设置页面其余部分的样式。\n虽然诀窍非常简单-这就是它如此酷的原因-但我一直有保留意见。你看，一个常规的、同步的样式表会阻塞渲染，所以浏览器会给它最高的优先级。打印样式表(或任何与当前上下文不匹配的样式表)被分配到完全相反的优先级：空闲。\n这意味着当浏览器开始发出请求时，异步CSS文件的优先级通常会严重偏低(或者更确切地说，它的优先级是正确的，但可能比您预期的要低得多)。以Vitamix为例，这是一个客户端，我为其实现了自己的字体提供程序的异步CSS：\n浏览器正在做我们告诉它的事情：用打印样式表的优先级请求这些CSS文件。因此，在3G连接上，下载每个文件需要几秒钟的时间。浏览器将几乎所有其他内容(包括体内资源)放在我们的打印样式表之前。这意味着这个页面直到3G达到了令人眼花缭乱的12.8秒才呈现出它的自定义字体。\n值得庆幸的是，在处理Web字体时，这并不是世界末日：\n无论如何，它们都应该被认为是一种增强，所以我们需要能够在没有它们的情况下应付；\n然而，对于下面的折叠CSS来说，几乎10秒的延迟是不可接受的-几乎百分之百确定用户将在该时间范围内滚动。\n我对这些结果真的很满意。第一个油漆在我们的基线上有了惊人的1.6-1.7的改进，在CSS Wizarry的情况下，比之前的变体提高了1.9秒。第一次满意的油漆比我们的基线提高了2.8分，灯塔得分第一次达到了100分。\n然而--这是一个很大的问题--由于降低了CSS文件的优先级，我们的第一个Web字体在CSSWizarry的情况下比我们的基线慢了500ms。这就是印刷媒体黑客攻击的危险所在。\n异步加载Google字体是个不错的主意，但是降低CSS文件的优先级实际上减慢了自定义字体的呈现速度。\n我要说异步CSS总体上是个好主意，但是我需要一些方法来缓解优先级问题。\n好的，如果打印CSS的优先级太低，我们需要的是高优先级的异步获取。输入PRELOAD。\n注：我们不能进行全预装，因为它没有得到足够广泛的支持。事实上，在写这篇文章的时候，大约20%的这个网站的访问者将无法使用它。将打印样式表视为一种退路。\n注意：将来，我们应该可以使用优先级提示来解决此问题。\n虽然First Paint要么保持不变，要么变慢，而First Content_Paint要么保持不变，要么变得更快，在CSS Wizarry的情况下，First Web字体比前一次迭代快了惊人的600ms。\n在harry.is的情况下，与我们之前的变体相比几乎没有什么变化。视觉上完整的速度要快200ms，但是任何第一个指标都是原封不动的。正是看到这些结果，实际上促使我也对CSSWizarry进行了测试。因为harry.is是一个如此小而简单的页面，所以对打印样式表没有太多的网络争用-改变它的优先级并没有真正帮助它。\n在CSS Wizarry的情况下，我们看到First Paint慢了300ms，这是意想不到的，但却是无关的(没有呈现阻塞CSS，所以更改异步CSS文件的优先级在这里没有任何影响--我要在测试中指出一个异常)。令人高兴的是，First Content Paint改进了200ms，First Web字体快了600ms，视觉完整快了700ms。\n我想要解决的最后一块拼图是另一个来源，当我们链接到fonts.googleapis.com获取CSS时，字体文件本身托管在fonts.gstatic.com上。在高延迟连接上，这意味着坏消息。\nGoogle字体对我们有好处-它们通过附加到fonts.googleapis.com响应的HTTP头抢先地初始连接fonts.gstatic.com：\n但是，此报头的执行受响应的TTFB限制，在高延迟网络上，TTFB可能非常高。Google字体CSS文件在所有测试中的TTFB中值(包括请求队列、DNS、TCP、TLS和服务器时间)为1406ms。相反，CSS文件的下载时间中值仅为9.5ms-到达文件头所需的时间是下载文件本身的148倍。\n换句话说：即使谷歌为我们预先连接了fonts.gstatic.com，他们也只是领先了大约10毫秒。换句话说，这个文件是延迟受限的，而不是带宽受限的。\n如果我们实施第一方预连接，我们应该会获得一些可观的巨大收益。让我们看看会发生什么。\n我们开始吧！首先，(令人满意的)油漆是真实原封不动的。此处的任何更改都与我们在预连接时的预连无关，只会影响关键路径之后的资源。我们的重点是First Web字体和视觉完备性，这两个方面都有很大的改进。第一个网页字体改进了700-1200毫秒，视觉上完整的字体改进了700-900毫秒，与我们的基准相比，分别改进了600-900毫秒和600-800毫秒。灯塔的得分在100分和99分上都很不错。\n使用异步CSS和字体显示使我们容易受到FOUT的影响(或者，如果我们正确设计了后备的话，希望是FOFT)。为了尝试缓解这一问题，我决定使用font-display：Optional；运行一个测试。\n这一变化告诉浏览器，网页字体被认为是可选的，如果我们在极小的区块周期内无法获得字体文件，那么我们将不提供交换周期。其实际结果是，如果网页字体加载时间过长，页面浏览量根本不会对其进行调整。这有助于防止FUT，这反过来将为您的用户带来更稳定的体验-他们不会在页面视图中途看到文本重新样式-以及更好的累积布局切换分数(Cumulative Layout Shift Score)。\n然而，事实证明，在使用异步CSS时，这总是很麻烦。当打印样式表转换为All样式表时，浏览器会更新CSSOM，然后将其应用于DOM。此时，页面被告知需要一些Web字体，极小的块期开始生效，在页面加载生命周期中途显示Foit。更糟糕的是，浏览器将用最初的备用字体替换Foit，因此用户甚至无法获得新字体的好处。它基本上看起来像是一个窃听器。\n想象它比解释它容易得多，所以这里有一张幻灯片的截图：\n我不推荐将font-Disply：Optional；与异步CSS一起使用；我建议使用异步CSS。因此，我不推荐font-display：可选；。总的来说，拥有带Fout的非阻塞CSS要比拥有不必要的Foit要好。\n虽然自托管您的网页字体很可能是性能和可用性问题的最佳解决方案，但我们能够设计一些具有良好弹性的措施来帮助缓解使用GoogleFonts时出现的许多此类问题。\n异步加载CSS、异步加载字体文件、选择FOFT、快速获取异步CSS文件和预热外部域的组合使体验比基线快了几秒钟。\n如果Google字体不是您唯一的渲染块资源，如果您违反了FAST CSS的任何其他原则(例如，如果您正在@导入您的Google字体CSS文件)，那么您的使用里程将会有所不同。这些优化在Google字体将成为您最大的性能瓶颈之一的项目中是最有益的。\n这里结合了许多技术，但生成的代码仍然足够精简和可维护，应该不会造成问题。代码段不需要拆分，可以全部保存在文档的&lt；head&gt；中。\n&lt；！-1.抢先预热字体来源。--2.发起CSS文件的高优先级异步抓取。适用于大多数现代浏览器。--3.启动低优先级异步抓取，仅在页面到达后才会应用于页面。适用于所有启用JavaScript的浏览器。--4.万一访问者故意关闭-JavaScript，回退到原来的方法。好消息是，尽管这是一个呈现块请求，但它仍然可以利用-preconnect，这使得它比缺省值稍微快一些。--&gt；&lt；！--[1]--&gt；&lt；链接版本=&#34；预连接&#34；HREF=&#34；https://fonts.gstatic.com&#34；交叉登录/&&gt;&lt；！--[2]--&&gt;&lt；链接版本=&#34；预加载&#34；AS=&#34；样式&#34；HREF=&#34；$css&amp；显示=交换&#34。！--[3]--&gt；&lt；link rel=&#34；href=&#34；$css&amp；display=swap&#34；media=&#34；print&#34；onload=&#34；this.media=&#39；all&#39；&34；/&gt；&lt；！--[4]--&gt；&lt；noscript&gt；&lt。DISPLAY=SWAP&#34；/&gt；&lt；/noscript&gt；", "note_en": "For the most part, web fonts nowadays are faster than ever. With morestandardised FOUT/FOIT behaviour from browser vendors, to the newer font-display specification, performance—and therefore the user—seems to havebeen finally been put front-and-centre.\n It’s widely accepted that self-hosted fonts are the fastest option: same originmeans reduced network negotiation, predictable URLs mean we can  preload,self-hosted means we can set our own   cache-controldirectives, andfull ownership mitigates  the risks that come with leaving static assets onthird-partyorigins.\n That said, the convenience of a service like Google Fonts cannot be overstated.Their ability to serve the tiniest possible font files tailored to specific useragents and platforms is amazing, and with such a huge, freely-available libraryserved from Google-grade CDNs… I definitely see why people continue to turn toit.\n On this site, in which performance is the only name of the game, I forgo webfonts entirely, opting instead to make use of the visitor’s system font. This isfast, incredibly well suited to the device in question, and has almost zeroengineering overhead. But, on  harry.is, I really wanted tothrow caution to the wind. To hell with it! Let’s have a web font!\n  While prototyping, I turned to Google Fonts, and with their recent ability tosupport  font-display via a URL parameter ( &amp;display=swap), I knew that thingswould stay pretty speedy. Then I had an idea.\n  TIP: If you’re going touse `font-display` for your Google Fonts then it makes sense to asynchronouslyload the whole request chain.  pic.twitter.com/k6obyVZGZP\n— HarryRoberts (@csswizardry)  11May, 2020\n While  font-display: swap; is a huge win, there are still a lot of thingsleaving me feeling uneasy. What else could I do to make Google Fonts  fast?\n   I ran the same suite of tests against the  harry.is and csswizardry.com homepages. I started out withharry.is because that’s where I was using Google Fonts, but I felt it was a pagetoo simple to be realistic. So, I cloned the CSS Wizardry homepage a bunch oftimes and implemented the various different methods there. For each section ofthis post, I will list the results for both sites. My variants are:\n  Further, each variant is additive—it includes the previous variant as well asits own additions. I didn’t try  just  preload or  just async, because itwould be pointless—we know that a combination will fare better than any on theirown.\n  First Contentful Paint (FCP): How soon can we actually read something,whether it’s a web font or not?\n  Visually Complete (VC): When has everything settled down (a proxy, but notequivalent to, Last Web Font)?\n N.B. All tests were conducted using a private WebPageTest instance(WebPageTest is down right now so I was unable to use the public instance, whichmeans I can’t share any URLs—apologies). The specific profile was a SamsungGalaxy S4 over 3G.\n To make the snippets easier to read, I’m going to replace all instances of https://fonts.googleapis.com/css2?family=Roboto:ital,wght@0,400;0,700;1,400;1,700with  $CSS.\n  Google Fonts played a really great move in the last year or so. By default, anynewly created Google Font snippet comes with the  &amp;display=swap parameter thatinjects  font-display: swap; into all of the  @font-face at-rules. The valueof the parameter can be any of  swap,  optional,  fallback, or  block. Youcan  read more onMDN.\n For my baseline, however, I was going to trim the  font-display back off. Thisis the legacy format that a lot of sites will likely still use, and it makes fora more suitable baseline to compare against.\n          Alright. Here’s our baseline. The Google Fonts file is the only render-blockingexternal resource either of the two tests has, and we can see they both have theexact same first paint. One thing I was happily surprised by during theseexperiments was the consistency of Google Fonts.\n   The first is a result of not having a web font loading solution (e.g. font-display); the second is a result of the synchronous Google Fonts CSSfile.\n   For this test, I added the  &amp;display=swap back in. In effect, this makes thefont files themselves asynchronous—the browser immediately displays our fallbacktext before  swapping to the web font whenever it arrives. This means we’re notgoing to leave users looking at any invisible text (FOIT), which makes for botha faster and more pleasant experience.\n N.B. It’s only more pleasant if you make the effort to define a suitablefallback to display in the interim—flashing a page full of Times New Romanbefore settling on Open Sans would likely be a net worse experience. Thankfully, Monica has made this process not only easy,but surprisingly fun. I wouldn’t be able to do this bit without her   Font StyleMatcher.\n       We haven’t removed any render-blocking resources from the critical path, soI wasn’t expecting to see any improvements in first paint. In fact, whileharry.is remained identical, CSS Wizardry got 200ms slower. What we do see,however, is  a dramatic improvement in first contentful paint—over a secondon harry.is!  First web font improved on harry.is, but not oncsswizardry.com. Visually complete was 200ms slower.\n I’m happy to say, for the metrics that matter the most,  we are 700–1,200msfaster.\n While this does massively improve the time it takes the web font to render, it’sstill defined inside a synchronous CSS file—we can only expect so muchimprovement from this move.\n    To quote, err, myself:  If you’re going to use  font-display for your GoogleFonts then it makes sense to asynchronously load the whole request chain. Itwas this initial thought that led to my tweet in the first place—if I’veeffectively made the contents of the CSS file asynchronous, then it kinda sucksto leave the CSS file itself fully synchronous.\n   Making your CSS asynchronous is one of the key techniques involved in employingCritical CSS. While there are a number of ways to achieve this, I’d dare say thesimplest and most ubiquitous is  Filament Group’s print media typetrick.\n This will implicitly tell the browser to load the CSS file in a non-blockingfashion, applying the styles only to the  print context. However, the moment thefile arrives, we tell the browser to apply it to  all contexts, thus stylingthe rest of the page.\n   While the trick is devilishly simple—which is what makes it so cool— I’ve longhad my reservations. Y’see, a regular, synchronous stylesheet blocksrendering, so a browser will assign it  Highest priority. A print stylesheet(or any stylesheet that doesn’t match the current context) is assigned thepriority at the complete opposite end of the spectrum:  Idle.\n This means that as browsers begin making requests, the asynchronous CSS fileoften gets grossly under-prioritised (or rather, it’s prioritised correctly, butprobably way less than you expect). Take for example Vitamix, a client for whomI implemented asynchronous CSS for their own font provider(s):\n  The browser is doing exactly what we told it: request these CSS files witha print-stylesheet’s worth of priority. Thus, on a 3G connection, it takes overnine seconds to download each file. The browser puts almost everything else,including in- body resources, ahead of our print stylesheets. This means thatthe page in question didn’t render its custom font until an eyewatering 12.8s on3G.\n Thankfully, while dealing with web fonts, this isn’t the end of the world:\n they should always be considered an enhancement anyway, so we need to be ableto cope without them;\n For below the fold CSS, however, delays of almost 10 seconds areunacceptable—it’s almost 100% certain that a user will have scrolled within thattimeframe.\n       I’m really happy with these outcomes.  First paint was a staggering 1.6–1.7simprovement on our baseline, and  up to a 1.9s improvement on the previousvariant in the case of CSS Wizardry.  First contentful paint was improved asmuch as 2.8s against our baseline, and  Lighthouse scores hit 100 for thefirst time.\n  However—and this is a big  however—as a result of lowering the priority of theCSS file, our  first web font is up to 500ms slower in the case of CSSWizardry against our baseline. This is the danger of the print media hack.\n Asynchronously loading Google Fonts is a net good idea, but reducing thepriority of the CSS file has actually slowed down the rendering of our customfont.\n I’m going to say that asynchronous CSS is an overall good idea but I need tosomehow mitigate the priority issue.\n  Okay, so if print CSS is  too low priority, what we need is a high priorityasynchronous fetch. Enter  preload.\n   N.B. We can’t go full  preload as it isn’t widely enough supported. Infact, at the time of writing, about 20% of this site’s visitors would be unableto make use of it. Consider the print stylesheet a fallback.\n   N.B. In future, we should be able to use Priority Hints to solve this issue.\n     While first paint either remained the same or got slower,  first contentfulpaint either remained the same or got faster, and in the case of CSS Wizardry, first web font was a staggering 600ms faster than the previous iteration.\n In the case of harry.is, almost nothing changed since our previous variant. Visually complete was 200ms faster, but any first- metrics were untouched.It was seeing these results that actually spurred me to also test against CSSWizardry. Because harry.is is such a small and simple page, there wasn’t muchnetwork contention for a print stylesheet to yield to—changing its prioritydidn’t really help it out much at all.\n In the case of CSS Wizardry, we see first paint 300ms slower, which isunexpected but unrelated (there is no render blocking CSS, so changing thepriority of an asynchronous CSS file can have no bearing here—I’m going to chalkit up to an anomaly in testing). Happily,  first contentful paint improved by200ms,  first web font was 600ms faster, and  visually complete was 700msfaster.\n   The last piece of the puzzle I wanted to solve the trip to yet-another origin.While we link out to  fonts.googleapis.com for our CSS, the font filesthemselves are hosted on  fonts.gstatic.com. On a high-latency connection, thisspells bad news.\n Google Fonts are good to us—they  preconnect the  fonts.gstatic.com originpreemptively via an HTTP header attached to the  fonts.googleapis.com response:\n  However, the execution of this header is bound by the response’s TTFB, which onhigh-latency networks can be very, very high. The median TTFB (including requestqueueing, DNS, TCP, TLS, and server time) for the Google Fonts CSS file acrossall tests was 1406ms. Conversely, the median download time for the CSS file wasjust 9.5ms—it took 148× longer to get to the headers of the file than it did todownload the file itself.\n Put another way: even though Google are  preconnecting the  fonts.gstatic.comorigin for us, they’re only gaining about a 10ms head-start. Put another-otherway, this file is  latency-bound, notbandwidth-bound.\n If we implement a first-party  preconnect, we should stand to make some prettyhuge gains. Let’s see what happens.\n         Here we go! First (contentful) paint is realistically untouched. Any changeshere are unrelated to our  preconnect at the  preconnect only impactsresources after the critical path. Our focus is on first web font and visuallycomplete, both of which show tremendous improvement.  700–1,200ms improvementon first web font and  700–900ms improvement on visually complete againstour previous variant, and  600–900ms and 600–800ms respective improvementsagainst our baseline.  Lighthouse scores are sitting pretty at 100 and 99.\n   Using asynchronous CSS and  font-display leaves us susceptible to FOUT (or,hopefully, FOFT if we’ve designed our  Fallbacks properly). To try andmitigate this, I decided to run a test using  font-display: optional;.\n This variation tells the browser that web fonts are considered optional, and ifwe can’t get hold of the font files during our  extremely small blockperiod then we offer  no swap period. The practical upshot of which isthat in the event that the web fonts takes too long to load, that pageview won’tutilise it at all. This helps to prevent the FOUT which will in turn lead toa more stable experience for your user—they won’t see text restyle part-waythrough their pageview—and a better Cumulative Layout Shift score.\n However, this proved consistently troublesome when using asynchronous CSS. Whenthe  print stylesheet gets turned into an  all stylesheet, the browser updatesthe CSSOM then applies it against the DOM. In this moment, the page is told itneeds some web fonts, and the  extremely small block period kicks in,showing a FOIT midway through the page load lifecycle. To make things worse, thebrowser will replace the FOIT with the same fallback it started with, so theuser doesn’t even get the benefit of a new font. It basically looks like a bug.\n It’s much easier to visualise it than it is to explain, so here’s a screenshotof the filmstrip:\n    I would not recommend using  font-disply: optional; alongside asynchronousCSS; I would recommend using asynchronous CSS. Ergo, I would not recommend font-display: optional;. It’s better overall to have non-blocking CSS witha FOUT than it is to have the needless FOIT.\n           While self-hosting your web fonts is likely to be the overall best solution toperformance and availability problems, we’re able to design some fairlyresilient measures to help mitigate a lot of these issues when using GoogleFonts.\n A combination of asynchronously loading CSS, asynchronously loading font files,opting into FOFT, fast-fetching asynchronous CSS files, and warming up externaldomains makes for an experience several seconds faster than the baseline.\n  If Google Fonts isn’t your only render-blocking resource, and if you’reviolating any of the other  principles for fastCSS (e.g. ifyou’re  @importing your Google Fonts CSS file), then your mileage will vary.These optimisations are most beneficial on project where Google Fonts is posingone of your biggest performance bottlenecks.\n  There a lot of techniques combined here, but the resulting code is still slimand maintainable enough that it should’t pose a problem. The snippet doesn’tneed breaking apart and can all be kept together in the  &lt;head&gt; of yourdocument.\n  &lt;!-- - 1. Preemptively warm up the fonts’ origin. - - 2. Initiate a high-priority, asynchronous fetch for the CSS file. Works in - most modern browsers. - - 3. Initiate a low-priority, asynchronous fetch that gets applied to the page - only after it’s arrived. Works in all browsers with JavaScript enabled. - - 4. In the unlikely event that a visitor has intentionally disabled - JavaScript, fall back to the original method. The good news is that, - although this is a render-blocking request, it can still make use of the - preconnect which makes it marginally faster than the default. --&gt; &lt;!-- [1] --&gt; &lt;link  rel= &#34;preconnect&#34;  href= &#34;https://fonts.gstatic.com&#34;  crossorigin  /&gt; &lt;!-- [2] --&gt; &lt;link  rel= &#34;preload&#34;  as= &#34;style&#34;  href= &#34;$CSS&amp;display=swap&#34;  /&gt; &lt;!-- [3] --&gt; &lt;link  rel= &#34;stylesheet&#34;  href= &#34;$CSS&amp;display=swap&#34;  media= &#34;print&#34;  onload= &#34;this.media=&#39;all&#39;&#34;  /&gt; &lt;!-- [4] --&gt; &lt;noscript&gt;  &lt;link  rel= &#34;stylesheet&#34;  href= &#34;$CSS&amp;display=swap&#34;  /&gt; &lt;/noscript&gt;", "posttime": "2020-05-29 02:36:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,字体,谷歌", "title": "最快的谷歌字体", "title_en": "The Fastest Google Fonts", "transed": 1, "url": "https://csswizardry.com/2020/05/the-fastest-google-fonts/", "via": "", "real_tags": ["google", "字体", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "b9ce513419288ce362e5bd4fb8c53531.jpg", "infoid": 1004121, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步在将其跳跃业务出售给Lime后，正在销毁数千辆电动自行车和滑板车。\n其红色自行车在回收中心被压碎的视频被分享在社交媒体上，激怒了骑自行车的倡导者。\n优步表示，出于维护、责任和安全方面的考虑，该公司已决定销毁数千辆老款汽车。\n一位发言人告诉BBC，Jump出售给Lime的交易在欧洲还没有完成，Jump继续在伦敦照常运营。\n但在今年5月7日，优步宣布了一项交易，Lime接管了Jump自行车业务。\n作为交易的一部分，优步向Lime投资了1.7亿美元(合1.39亿英镑)，而Lime收购了数万辆优步的Jump Bikes--以及相关的知识产权。\n莱姆首席执行官韦恩·丁(Wayne Ting)表示，他更喜欢优步自行车的设计，并将在未来部署更多自行车。\n然而，作为交易的一部分，莱姆也没有继承数万辆老款自行车。\n推特上分享的视频显示，这些自行车抵达北卡罗来纳州的一个回收设施后将被销毁。\n失望的慈善机构和组织表示，这些自行车本可以捐赠给社区团体，或者出售给个人，以促进电动自行车的普及。\n非营利组织“纽约自行车”(Bike New York)的乔恩·奥尔卡特(Jon Orcutt)告诉新闻网站“母板”(Motherboard)，为什么不至少剥下标签，把自行车卖给个人呢？\n但考虑到许多重大问题--包括维护、责任、安全问题，以及缺乏消费级充电设备--我们认为最好的方法是负责任地回收它们。", "note_en": "Uber is destroying thousands of electric bikes and scooters, after selling its Jump business to Lime.\n Videos of its red bikes being crushed at a recycling centre were shared on social media, angering cycling advocates.\n Uber said it had decided to destroy thousands of its older-model vehicles due to maintenance, liability and safety concerns.\n   A spokesman told the BBC the sale of Jump to Lime had not been completed in Europe, and that Jump continued to operate &#34;as normal&#34; in London.\n    But on 7 May this year, Uber announced a deal that saw Lime take over the Jump bike business.\n As part of the deal, Uber invested $170m (£139m) in Lime, while Lime acquired &#34;tens of thousands&#34; of Uber&#39;s Jump bikes - and the associated intellectual property.\n Lime&#39;s chief executive Wayne Ting has said he  prefers the design of Uber&#39;s bikes and will deploy more of them in the future.\n However, there were also &#34;tens of thousands&#34; of older-model bikes that Lime did not inherit as part of the deal.\n Videos shared on Twitter show the bikes arriving at a recycling facility in North Carolina to be destroyed.\n Disappointed charities and organisations suggested the bikes could have been donated to community groups, or sold to individuals to boost the uptake of electric bikes.\n &#34;Why not at least peel the decals [branding] off and sell the bikes to individuals?&#34; Jon Orcutt of Bike New York, a non-profit group,  told news site Motherboard.\n  &#34;But given many significant issues - including maintenance, liability, safety concerns, and a lack of consumer-grade charging equipment - we decided the best approach was to responsibly recycle them.&#34;", "posttime": "2020-05-29 02:36:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "跳跃,destroying,自行车", "title": "优步在跳跃促销后销毁了数千辆电动自行车和滑板车", "title_en": "Uber is destroying thousands of electric bikes and scooters following Jump sale", "transed": 1, "url": "https://www.bbc.com/news/technology-52832791", "via": "", "real_tags": ["跳跃", "自行车"]}, {"category": "", "categoryclass": "", "imagename": "7c74a2d5dec86839cef3caff6cf21073.png", "infoid": 1004119, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个库的开发是可能的，这要归功于：Gripless是一个针对Web应用的免费投诉解决方案，让您的用户对重要问题进行屏幕截图，并将这些截图输入到您的问题跟踪器中，并自动让您的用户知道何时修复了这些问题。https://usegripeless.com。\nPico&#39；的目标是在客户端生成高精度的任意视口截图。这与简单地使用Puppeteer或类似工具捕获网页不同，因为截图完全发生在客户端。\n视口屏幕截图包括滚动的元素滚动状态、交叉原始图像、输入状态、网页字体、画布内容、当前视频帧内容，以及更多使用无头浏览器等无法获取的信息。\n在撰写本文时，还没有旨在像Pico那样精确再现整个视口的现有解决方案。\n该程序将给定窗口中显示的任何内容呈现为图像，这要归功于SVG&39；s&lt；ForeignObject&gt；。\n没有原生的Javascript API可以截取用户当前在屏幕上看到的内容的屏幕截图(由于安全问题，可能永远不会有这样的截图)。\n由于我们无法访问显示给用户的原始数据，因此我们必须手动重建它。此程序的运行得益于SVG&39；s&lt；ForeignObject&gt；，它允许您在其中插入任何有效的HTML内容，然后我们可以将其作为数据URL传递到Canvas&gt；drawImage中，并使用canvas.toBlob或canvas.toDataURL读出原始图像数据。\n在一个子资源没有文本化的宇宙中，单凭上述一项就可以很好地发挥作用--正如你所知道的，这不是我们的宇宙。插入到&lt；img&gt；标记中的SVG(在我们的示例中是&lt；Canvas&gt；)无法显示任何外部资源，无论是它的图像、字体还是样式表。\n检查所有样式表中的嵌套资源下载url()函数引用的任何资源，包括但不限于以下属性：\n将输入状态(文本输入、复选框、文本项)复制到valueAttributes中，以便它们可以在SVG中显示。\n通过Transform：Translate(针对根节点)和滚动节点的子节点的绝对位置来模拟所有滚动元素(包括元素)上的当前滚动位置。\n将现有&lt；canvas&&gt;元素转换为&lt；img&&gt;标记，并将&lt；canvas&&gt;的内容内联为src中的数据URL。\n对rem字体大小、工作媒体查询、保留所有内容的大小等执行各种次要修复。\n返回的DOM插入到&lt；iframe&gt；中，序列化为XML，转换为数据URL，放入Image中，然后呈现在Canvas&gt；上，该Canvas&gt；的内容通过canvas.toBlob读出，最后返回给程序的调用者，以及资源加载失败时的所有错误。\n多亏了Fluture，Pico能够安全地累积所有异步资源错误，这真的是本机承诺的一个很好的替代方案，并迫使您编写类型安全错误。你可以在这里阅读图书馆作者写的一篇很棒的介绍性文章。\nPico是使用Fluture构建的，除了承诺之外，还通过以Fluture为后缀的函数提供了到Fluture的直接API。如果您不关心函数式编程，只需使用无后缀函数来处理Promise。\n所有函数都返回一个&#34；ErrorStack&#34；，它基本上就是返回值加上计算时发生的任何错误。加载子资源时，大多数错误都是CORS或404相关问题。\nexport声明类型DetailedError={//人类可读的错误原因字符串：字符串；//正确的错误对象错误：Error；}；\nEXPORT DECLARE TYPE OPTIONS={//将选择器数组导出到不应包含在输出中的节点。忽略：String[]；}；\n声明常量对象URL：($Window：Window，artialOptions？：Partial&lt；Options&gt；)=&gt；Promise&lt；ErrorStack&lt；String&gt；&gt；声明常量对象URLFluture：($Window：Window，Options：Options)=&gt；Fluture&lt；DetailedError，ErrorStack&lt；String&gt；\n将给定的窗口呈现为PNG图像并将其作为对象URL返回。由于内存的限制，这比使用dataURL更安全。处理完图像后，请记住调用URL.revokeObjectURL。\n声明Const dataURL：($Window：Window，artialOptions？：Partial&lt；Options&gt；)=&gt；Promise&lt；ErrorStack&lt；String&gt；&gt；声明Const dataURLFluture：($Window：Window，Options：Options)=&gt；Fluture&lt；DetailedError，ErrorStack&lt；String&gt；\n将给定窗口呈现为PNG图像并将其作为数据URL返回。请注意，在Chrome中，数据URL的限制是2MB，请尽可能使用objectURL。\n声明常量svgObjectURL：($Window：Window，artialOptions？：Partial&lt；Options&gt；)=&gt；Promise&lt；ErrorStack&lt；String&gt；&gt；；声明常量svgObjectURLFluture：($Window：Window，Options：Options)=&gt；Fluture&lt；DetailedError，ErrorStack&lt；String&gt；\n将给定的窗口渲染成SVG图像，并将其作为对象URL返回。此函数主要用于使用devtools检查Pico的输出，实际使用时优先使用其他函数。\n该模块旨在通过代码捆绑包(如Rollup或webpack)在浏览器中独家使用。目前还没有提供单一的文件包版本。\nPico是针对最近基于Firefox和Blink的浏览器(Chrome、Opera、Brave、Edge)开发的。由于缺乏对&lt；Foreign Object&gt；的适当支持，它在Safari或旧的Edge版本上不起作用。\nPico的卖点是尽可能准确地呈现整个视点。如果您希望呈现单个DOM节点，请考虑使用上述库之一。", "note_en": "Development of this library is possible thanks to:       Gripeless is a free complaint solution for web apps  Let your users take screenshots of important issues, pipe them into your issue tracker  and let your users know when they&#39;re fixed, automatically.     https://usegripeless.com\n   Pico&#39;s goal is to produce high precision screenshots of any viewport entirelyclient side. This is different from simply capturing a webpage using Puppeteer or a similar tool in that the screenshot taking happens entirely client side.\n The viewport screenshots include scrolled element scroll states, cross-originimages, input states, web fonts, canvas contents, current video frame contents,and much more information that you wouldn&#39;t be able to get using something likea headless browser.\n At the time of writing there are no existing solutions that are aimedof reproducing the entire viewport accurately like Pico.\n   This program renders whatever is displayed in the given  Window into animage, thanks to svg&#39;s  &lt;foreignObject&gt;.\n  There is no native Javascript API to take the screenshot of what the user iscurrently seeing on their screen (and because of security issues thereprobably will never be one).\n Since we don&#39;t have access to the raw data that&#39;s being shown to the user wehave to reconstruct it manually. This program works thanks to svg&#39;s &lt;foreignObject&gt; which lets you insert any valid HTML content inside, whichwe can then pass as a data URL into a  &lt;canvas&gt;&#39;  drawImage and read outthe raw image data with  canvas.toBlob or  canvas.toDataURL.\n The above alone would work great in a universe where subresources didn&#39;texist - which as you know is not our universe. SVG&#39;s inserted into  &lt;img&gt;tags (or in our case,  &lt;canvas&gt;&#39;) cannot display any external resources,whether it&#39;s images, fonts or stylesheets.\n  Checks all stylesheets for nested resources Downloads any resources referenced by the  url() function, includingbut not exclusive to the following properties:\n  Copies input states (text inputs, checkboxes, textareas) into  valueattributes so that they can be shown in SVG\n Emulates current scroll positions on all scrolled elements (including theroot  &lt;html&gt; element) via either  transform: translate (for root node)and  absolute positioning of children of scrolled nodes\n Transforms existing  &lt;canvas&gt; elements into  &lt;img&gt; tags with the contents of the  &lt;canvas&gt;&#39; inlined as data URL&#39;s in  src\n Performs various minor fixes for  rem font size, working media queries,preserving size of everything, etc.\n The returned DOM is inserted into an  &lt;iframe&gt;, serialized into XML,converted into a data URL, put into an  Image, which is then rendered ontoa  &lt;canvas&gt; whose contents are read out with  canvas.toBlob and finallyreturned to the program&#39;s caller, together with all the errors whenresources failed to load.\n Pico is able to safely accumulate all async resource errors thanks to Fluture, which is a really greatalternative to the native  Promise and forces you to write type safeerrors. You can read a  fantastic introductory article to it by thelibrary&#39;s author here.\n  Pico is built using  Fluture and inaddition to the  Promise also provides a direct API to  Fluture via functionssuffixed with  Fluture. If you don&#39;t care about functional programming justuse the non-suffixed functions to work with  Promise&#39;s instead.\n All functions return an &#34; ErrorStack&#34;, which is basically just the returnedvalue paired with any errors that happened while computing it. Most errors willbe CORS or 404 related issues when loading subresources.\n   export  declare  type  DetailedError  =  {  // Human readable string of why the error happened  reason:  string ;  // Proper error object  error:  Error ; } ;\n export  declare  type  Options  =  {  // An array of selectors to nodes that should not be included in the output.  ignore:  string [ ] ; } ;\n  declare  const  objectURL:  ( $window:  Window ,  partialOptions?:  Partial &lt; Options &gt; )  =&gt;  Promise &lt; ErrorStack &lt; string &gt; &gt; ; declare  const  objectURLFluture:  ( $window:  Window ,  options:  Options )  =&gt;  Fluture &lt; DetailedError ,  ErrorStack &lt; string &gt; &gt; ;\n Render the given  Window to a PNG image and return it as an object URL.This is safer to use than  dataURL due to memory constraints. Remember to call  URL.revokeObjectURLwhen you&#39;re done with the image.\n  declare  const  dataURL:  ( $window:  Window ,  partialOptions?:  Partial &lt; Options &gt; )  =&gt;  Promise &lt; ErrorStack &lt; string &gt; &gt; ; declare  const  dataURLFluture:  ( $window:  Window ,  options:  Options )  =&gt;  Fluture &lt; DetailedError ,  ErrorStack &lt; string &gt; &gt; ;\n Render the given  Window to a PNG image and return it as a data url.Note that in Chrome the limit for data url&#39;s is 2MB,prefer  objectURL when possible.\n  declare  const  svgObjectURL:  ( $window:  Window ,  partialOptions?:  Partial &lt; Options &gt; )  =&gt;  Promise &lt; ErrorStack &lt; string &gt; &gt; ; declare  const  svgObjectURLFluture:  ( $window:  Window ,  options:  Options )  =&gt;  Fluture &lt; DetailedError ,  ErrorStack &lt; string &gt; &gt; ;\n Render the given  Window to an SVG image and return it as an object URL.This function is mainly useful for inspecting the output of Pico usingdevtools, for real uses prefer the other functions.\n   The module is intended to be used exclusively in the browser via a code bundlerlike Rollup or Webpack. There is no single file bundle build provided at thistime.\n    Pico is being developed against recent Firefox and Blink based browsers(Chrome, Opera, Brave, Edge). It does not work on Safari or old Edge versionsdue to lack of proper support for  &lt;foreignObject&gt;.\n    Pico&#39;s selling point is representing the whole viewportas accurately as possible. If you want to render a single DOM node instead,consider using one of the above libraries.", "posttime": "2020-05-29 02:35:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,用于,client", "title": "Pico：用于高精度视口截图的客户端JavaScript库", "title_en": "Pico: Client-side JavaScript library for high-precision viewport screenshots", "transed": 1, "url": "https://github.com/nikersify/pico", "via": "", "real_tags": ["java", "用于", "client"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004118, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "收集思维工具和框架，帮助您解决问题、做出决策和理解系统。", "note_en": "Collection of thinking tools and frameworks to help you solve problems, make decisions and understand systems.", "posttime": "2020-05-29 02:35:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "思考,tools,思维", "title": "更好地思考的工具", "title_en": "Tools for Better Thinking", "transed": 1, "url": "https://untools.co", "via": "", "real_tags": ["思考", "tools", "思维"]}, {"category": "", "categoryclass": "", "imagename": "13809b9c85610a899d52d3aac0c4f79b.png", "infoid": 1004116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我叫马克·布罗姆霍尔，我的背景是广告技术(AdTech)和营销技术(Martech)。由于这些行业类别相对较新，我的大部分工作经验都是在初创企业领域。\n我是Contentellect的联合创始人。我们帮助中小型企业(SMB)扩展其内容。我们通过为客户撰写高质量的博客来做到这一点。我们的客户意识到了内容营销的价值，但在大多数情况下，他们缺乏内部资源或时间来执行它。我们目前的平均价格是10K美元/MRR。\n为其销售和营销团队提供可在营销漏斗顶部和中间使用的相关内容。\n我和我的联合创始人都有内容营销的不同方面的背景。我的AdTech/Martech背景教会了我，当涉及到付费内容分发时，伟大的内容看起来是什么样子。我的联合创始人有建立基于搜索引擎优化的内容网站的背景。因此，他知道从有机交通的角度来看，是什么构成了伟大的内容。通过将这些经验汇集在一起，我们能够在内容领域提供令人信服的全面服务。\n当时，我们都是几个不同的Facebook联盟营销小组的成员，这些小组是像我们这样的服务的俘虏受众。最初，我们在这些小组中推销我们的作品，看到了立竿见影的兴趣。当时我正在做自由广告技术咨询，所以随着对我们服务需求的增加，我能够相当容易地结束咨询业务。\n幸运的是，我们的MVP只需要很少的投资和技术专长。我们使用Thrive主题构建了一个Wordpress站点，然后集成了WooCommerce。我们花了大约三周的时间才得到一种可以推向市场的精炼产品。在此期间，我们仍然在销售我们的内容服务，并简单地通过贝宝向客户发送发票。\n我们一开始只有几位自由撰稿人，他们是我们从我的联合创始人的其他公司带来的。由于他们是自由职业者，没有每月的财务承诺。因此，我们的初始成本与我们的销售额相称。\n一开始，我们同时提供内容写作和访客张贴服务。客帖服务包括为我们的客户在第三方网站上发布内容，从而帮助他们进行页外SEO。这项服务最终被证明相对于利润率来说过于繁重，所以我们在2019年初将其日落。\n在建立业务的最初阶段，我们最有价值的工具是Google Suite和Facebook，在这两个工具中，我们参加了小组活动，还开展了小型的、高度有针对性的广告活动。\n因为我和我的联合创始人不是程序员，所以我们选择了外行容易使用的工具。我们目前使用WordPress、WooCommerce和PayPal进行网站内外的所有交易。\n我们有一个开发人员谁已经建立了一些定制的功能，为WooCommerce使用PHP。我们目前正在更新我们的网站使用Laravel，这将包括整合条纹与贝宝和改善整体用户界面和用户体验。\n我们于2018年5月推出，拥有三个客户，MRR为2,000美元。这些客户是通过附属营销Facebook小组以及电子邮件和LinkedIn外联获得的。我们将这一收入和客户水平维持到2018年8月。然后在2018年9月，通过将客户群翻了一番，我们的收入翻了一番，达到4000美元。2018年10月，我们将MRR推高至8000美元。有趣的是，我们的客户数量保持不变，但我们能够用新的、更高价值的客户取代流失的客户。\n在这个阶段，我们获得客户的主要渠道是Facebook群组、Facebook广告、Hunter.io的电子邮件推广和LinkedIn推广。我们还开始使用自由职业市场Legiit作为额外的收入渠道。\n这是一个批量游戏。无论渠道如何，客户转换率总是很低。因此，一旦你确定了你的目标客户是谁，他们在网上存在的位置，就去大量追踪他们。\n要有条不紊，要果断。销售拓展可能是一个艰巨且相当重复的过程。想出一个成功的公式，每天都要为明确的微观和宏观目标而努力。\n我们对内容收取每字0.10美元的费用，因此一篇1000字的文章将花费100美元。然后我们有两个不同的计划，一个是现收现付计划，客户可以临时购买内容，另一个是每月博客文章计划，客户每月都会收到一定数量的博客文章。这项服务从我们只写内容的基本服务一直到完全托管的博客服务，包括内容策略、构思、内容日历创建和通过客户内容管理软件发布博客文章。\n到目前为止，我们一直只使用贝宝支付，但我们将整合条纹，当我们推出我们的新网站在2020年5月底。我们期待条纹的引入，以提高用户的信任，从而提高他们从我们这里购买内容的倾向。我们平均每月的MRR为10,000美元，几乎没有偏差。到目前为止，我们最好的月份是在2019年5月，当时我们达到了16,000美元！\n我们花了大约四个月的时间从每月8000美元增加到这个数字，但随后只用了两个月就恢复到8000美元。这是由于在更大的客户群中没有足够的多元化。我们接触到了一些重要客户。当他们在5月份增加对我们的承诺时，事实证明这是偶然的，但在此期间未能扩大我们的客户基础意味着，当这些主要客户恢复到正常订单规模时，我们的收入也会受到相应的影响。\n在2020年5月底推出我们的新网站，提供更新的服务，其中将包括更流畅、更流畅的UI和UX，以及条纹支付。此外，我们所有的客户都可以在我们的网站上交易。目前，我们的每月博客文章套餐上的客户不能在我们的网站上购买此计划，并且直接从贝宝开具发票。\n新冠肺炎当然会阻碍我们在接下来的几个月里将我们的新服务推向市场。我们希望确保我们的外展工作时间正确，张贴新冠肺炎，以确保最大程度的兴趣。如果这意味着延迟几个月，那么就这样吧。到目前为止，随着我们品牌实力的增强，我们看到入境销售水平有所上升，这是令人放心的。\n一大挑战一直是处理客户流失问题。可能需要三到四个月的谈话才能找到一个新客户，但他们可以在不到一个月的时间内离开。\n幸运的是，我们只有三份全职工资要支付，其余的劳动力都签订了自由职业者的合同。这降低了任何给定月份由于客户流失而出现赤字的风险。\n事后看来，如果我不得不重新创业，在定义我们的服务产品、价值主张和目标客户群时，我会对自己更加苛刻。我认为尽可能缩小这些参数的范围是非常重要的。\n当你认为你已经到达终点时，继续精益求精，直到你有一个定义良好的服务产品，并有一个明确的价值主张，准确地说出你的目标客户的需求。我也会在更早的时候开始做大规模的销售推广。\n是的，很多东西！我发现最有用的工具是Google Suite中用于业务运营的所有工具，用于任务管理的Trello，以及用于构建线框和电话会议的Balsamiq。\n我不喜欢使用太多的工具，因为我的观点是，一个人很快就会达到饱和点，在这个点上，使用所有工具的总时间超过了从单个工具获得的生产力收益。\n永远不要停止提炼你的产品和价值主张。产业、市场和社会都在发展。您的产品也必须不断发展，以跟上不断变化的需求模式。\n更多地关注业务的功能要素，而不是美学。我看到一些创始人被围绕公司标志或品牌颜色的决定捆绑在一起。这些东西在创业的早期阶段是无关紧要的，而且很可能会在你的业务生命周期的某个时候发生变化。而是关注你的目标市场，把你的时间花在找到最快能让他们获得MVP的方式上。\n我们是几千名创始人，互相帮助建立有利可图的业务和副业。来分享你正在做的事情，并从你的同事那里获得反馈。\n还没有准备好开始使用您的产品吗？没问题。社区是结交朋友、学习和接触的好地方。只需浏览即可！", "note_en": "I&#39;m Marc Bromhall, and my background is in advertising tech (AdTech) and marketing tech (MarTech). Because these industry categories are relatively new, most of my work experience has been in the startup world.\n  I&#39;m the co-founder of Contentellect. We help small- and medium-size businesses (SMBs) scale their content. We do this by writing top quality blogs for our customers. Our customers realize the value of content marketing, but in most cases lack the internal resources or the time to execute it. We&#39;re currently averaging $10K/MRR.\n  Gives their sales and marketing teams relevant content they can use at the top and middle of the marketing funnel\n  My co-founder and I both had backgrounds which covered different facets of content marketing. My AdTech/MarTech background taught me what great content looked like when it came to paid content distribution. My co-founder has a background in building content websites which are predicated on SEO. He therefore knew what made great content from an organic traffic perspective. By bringing these experiences together we were able to come up with a compelling and comprehensive service offering in the content space.\n  At the time we were both members of a few different affiliate marketing Facebook groups, which were captive audiences for services like ours. Initially we pitched our writing in these groups and saw immediate interest. I was doing freelance AdTech consulting at the time, so as demand for our services increased I was able to wind down the consulting fairly easily.\n  Fortunately our MVP required very little investment and technology expertise. We built a Wordpress site using  Thrive Themes and then integrated  WooCommerce. It took us around three weeks to get to a refined product which we could take to market. During this time we were still selling our content services and simply sending the customers invoices over PayPal.\n We started out with just a few freelance writers who we brought over from my co-founder&#39;s other business. As they were freelance there was no monthly financial commitment. Our initial costs were therefore commensurate with our sales.\n In the beginning we offered both a content writing and a guest posting service. The guest posting service involved publishing content on third party websites for our customers, thus helping them with off-page SEO. This service eventually proved too onerous in relation to the margins so we sunset it at the beginning of 2019.\n In this initial phase of building the business, our most valuable tools were Google Suite and Facebook, where we participated in groups and also ran small, highly targeted advertising campaigns.\n  As my co-founder and I are not coders, we chose to use tools which are predisposed to the layman. We currently use WordPress, WooCommerce and PayPal for all transactions on and off the site.\n    We have a developer who has built some bespoke features for WooCommerce using PHP. We&#39;re currently updating our website using Laravel which will include integrating Stripe alongside PayPal and improving the overall UI and UX.\n  We launched in May 2018 with three customers and an MRR of $2,000. These customers were acquired via affiliate marketing Facebook groups, as well as email and LinkedIn outreach. We sustained this level of revenue and customers through August 2018. Then in September 2018 we were able to double our revenue to $4,000 by doubling our customer base. In October 2018 we pushed to $8,000 in MRR. Interestingly our customer count remained the same but we were able to replace churned customers with new, higher value customers.\n  At this stage our primary channels of customer acquisition were Facebook Groups, Facebook advertising, email outreach by way of  Hunter.io, and LinkedIn outreach. We also started using the freelance marketplace,  Legiit, as an additional revenue channel.\n  It&#39;s a volume game. Customer conversion rates regardless of channel are always going to be small. Therefore, once you&#39;ve identified who your target customers are and where they exist online, go after them in large volumes.\n Be methodical and resolute. Sales outreach can be an arduous and rather repetitive process. Work out a formula for success and keep hammering away each and every day with clearly defined micro and macro goals.\n  We charge $0.10 a word for content, so a 1,000-word article will cost $100. Then we have two different plans, a Pay-As-You-Go plan where a customer can buy content ad hoc and a Monthly Blog Articles plan where a customer gets a set number of blog articles delivered to them every month. This is offered from a basic service where we only write the content all the way through to a fully managed blog service which includes content strategy, ideation, content calendar creation and publishing the blog articles via the customers content management software.\n  So far we&#39;ve only been using PayPal payments but we&#39;ll be integrating Stripe when we launch our new website at the end of May 2020. We&#39;re expecting the introduction of Stripe to improve user trust and thus their propensity to buy content from us. We are averaging on $10,000 MRR with little monthly deviation. Our best month to date was in May 2019 when we hit $16,000!\n It took us about four months to ramp up to this number from $8,000 monthly, but then only two months to revert back to $8,000. This was due to not being diversified enough across a larger customer base. We were exposed to a few number of anchor customers. When they increased their commitment with us in May it proved fortuitous, but failing to grow our customer base in the interim meant that when these anchor customers reverted back to their normal order sizes, our revenue was impacted accordingly.\n  Launch our new website at the end May 2020 with an updated service offering which will include a slicker, smoother UI and UX, along with Stripe payments. Moreover, all our customers will be able to transact on our website. Currently, our customers on a Monthly Blog Articles package cannot purchase this plan on our website and are invoiced directly from PayPal.\n Covid-19 will of course hinder our ability to take our new service offering to market in the months that follow. We want to make sure we time our outreach efforts correctly post Covid-19, to ensure maximum levels of interest. If this means a delay of several months, then so be it. So far, as our brand gains in strength we are seeing increased levels of inbound sales which is reassuring.\n  One big challenge has been dealing with customer churn. It can take three to four months of conversations to land a new customer, but they can leave in less than a month.\n Fortunately we only have three full time salaries to pay, with the rest of our workforce being on freelance contracts. This lowers the risk of going into the red in any given month due to customer churn.\n  With the benefit of hindsight, if I had to start the business again, I would be more brutal on myself when it came to defining our service offering, value proposition and target customer cohorts. I think it&#39;s very important to narrow these parameters down as much as possible.\n When you think you&#39;ve reached an end point, keep refining further until you have an excellently defined service offering, with a clear value proposition that speaks exactly to the needs of your target customers. I would also have started doing large scale sales outreach earlier on.\n  Yes, many things! The tools I&#39;ve found the most useful have been everything in Google Suite for business operations, Trello for task management, and Balsamiq for building wireframes and Whereby for conference calls.\n I don&#39;t like using  too many tools as I&#39;m of the opinion that one can very quickly reach a saturation point, where the time it takes to use all the tools in aggregate outweighs the productivity gains that derive from the individual tools.\n  Never stop refining your product and value proposition. Industries, markets, and society all evolve. Your product will have to evolve, too, to keep up with changing demand patterns.\n    Focus more on the functional elements of your business and less on aesthetics. I see some founders getting tied up with decisions around a company logo or brand colors. These things are immaterial in the early stages of starting a business, and will most likely change at some point in your businesses lifecycle anyway. Rather pay heed to your target market and spend your time finding the fastest way you can get an MVP over to them.\n       We&#39;re a few thousand founders helping each other build profitable businesses and side projects. Come share what you&#39;re working on and get feedback from your peers.\n Not ready to get started on your product yet? No problem. The community is a great place to meet people, learn, and get your feet wet. Feel free to  just browse!", "posttime": "2020-05-29 02:34:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编码,coding,客户", "title": "没有编码技能。很多竞争者。下面是我每个月赚10000美元的方法", "title_en": "No Coding Skills. Many Competitors. Here's How I Make $10k/Month", "transed": 1, "url": "https://www.indiehackers.com/interview/no-code-many-competitors-heres-how-i-still-make-10k-mo-42a0fba013", "via": "", "real_tags": ["编码", "coding", "客户"]}, {"category": "", "categoryclass": "", "imagename": "c09fb91ed95bae9d374206e0deabf776.jpg", "infoid": 1004115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周的袭击接踵而至：一场龙卷风猛烈袭击了印度特大城市加尔各答，暴雨冲垮了美国中西部的两座大坝，周四发出警告称，大西洋飓风季节可能会很严重。\n这一切都提醒人们，到目前为止已导致32.5万人死亡的冠状病毒大流行，正在与另一个全球威胁相撞：一个快速升温的星球，严重威胁着数百万人，特别是世界上的穷人。\n气候变化使极端天气事件更加频繁和剧烈。现在，由于大流行，它们出现在国家经济崩溃和普通人筋疲力尽的时候。\n例如，在印度东部和孟加拉国工作的救援组织表示，在风暴安潘来袭时，封锁已经迫使人们依赖粮食援助。然后，大风和暴雨摧毁了新播的庄稼，这些庄稼本应养活社区度过下一季。“人们没有什么可以依靠的，”乐施会印度分部主任潘卡吉·阿南德(Pankaj Anand)周四在一份声明中说。\n随着冠状病毒在世界各地展开其长尾，其他几种气候危害也在迫在眉睫。其中包括欧洲和南亚热浪的前景，从美国西部到欧洲再到澳大利亚的野火，以及南美和南部非洲的缺水，那里的持续干旱已经在加深饥饿。\n去年异常的暴雨，科学家们说，印度洋的长期变暖更有可能是气候变化的一个标志，加剧了整个东非的蝗灾。更高的温度使得蝗虫更容易蔓延到以前气候不那么合适的地方-反过来，破坏了地球上一些最贫穷的人的大片农田和牧场。\n本月，一群科学家和经济学家在“自然气候变化”(Nature Climate Change)的一篇评论文章中警告称，尽管风险因地区而异，但“它们应该被视为世界各国未来面临的一个发人深省的信号”。\n不过，他们补充说，影响将不会相等。专家们说，它们将加剧长期存在的不平等，并“使特定人群面临更高的风险，损害恢复”。\n所有这些极端的天气危害都因大气中温室气体的积累而变得更加频繁和强烈，这推高了陆地和海洋的温度。\n世界各地的封锁导致温室气体排放量大幅下降，但这种下降远远不足以动摇已经包裹着地球的厚厚的气体毯子。\n而且，根据研究人员进行的一系列预测，即使在接下来的几个月里继续采取限制措施，全球碳排放量也会比去年下降4%到8%，其中最新的预测上周发表在《自然气候变化》(Nature Climate Change)上。尽管这在社会和经济上可能是惩罚性的，但它不会对整体变暖趋势产生影响。\n本周，那些生活在印度东部和孟加拉国三角洲地区的人已经感受到了累积变暖的影响，他们生活在印度东部和孟加拉国的三角洲地区，受到不断加剧的热浪、海平面上升、风暴潮和像这样的超级气旋的影响。\n例如，在孟加拉国的农村，暴风雨冲破了堤坝。海水吞噬了稻田。泥土和茅草屋倒塌。\n接触受污染的物体，然后将细菌感染我们自己，这并不是典型的病毒传播方式。但这是有可能发生的。对流感、鼻病毒、冠状病毒和其他微生物的多项研究表明，包括新型冠状病毒在内的呼吸道疾病可以通过接触受污染的表面传播，特别是在日托中心、办公室和医院等地方。但是，要让这种疾病以这种方式传播，必须发生一系列漫长的事件。保护自己免受冠状病毒感染的最好方法--无论是表面传播还是密切的人类接触--仍然是社交距离、洗手、不碰脸和戴口罩。\n常见症状包括发烧、干咳、疲劳、呼吸困难或呼吸急促。这些症状中的一些与流感的症状重叠，使检测变得困难，但流鼻涕和鼻窦堵塞不太常见。疾控中心还增加了寒战、肌肉疼痛、喉咙痛、头痛和新的味觉或嗅觉丧失作为要注意的症状。大多数人在接触后五到七天就会生病，但症状可能会在短短两天或长达14天内出现。\n如果航空旅行是不可避免的，你可以采取一些措施来保护自己。最重要的是：勤洗手，不要再摸你的脸。如果可能的话，选择靠窗的座位。埃默里大学的一项研究发现，在流感季节，坐在飞机上最安全的地方是靠窗的，因为坐在靠窗座位的人与可能生病的人接触较少。对坚硬的表面进行消毒。当你坐到座位上，双手干净后，用消毒湿巾清洁座椅的硬表面，如头枕和扶手、安全带扣、遥控器、屏幕、座椅靠背口袋和托盘桌子。如果座椅很硬，不透气，或者是皮革或人造革的，你也可以把它擦干净。(在软垫座椅上使用湿巾可能会导致座椅湿润，传播细菌，而不是杀死他们。)\n自大流行以来，已有超过4000万人-相当于美国工人中的四分之一-申请了失业救济金。美联储(Federal Reserve)5月14日发布的一项调查数据显示，在2月份工作的人中，有五分之一的人报告在3月份或4月初失去了工作或被暂时解雇，这种痛苦高度集中在低收入者身上。一位美联储官员表示，在收入在4万美元或以下的家庭中，整整39%的前工人失去了工作，相比之下，收入超过10万美元的家庭中，这一比例为13%。\n报告冻疮症状的人数有所上升，冻疮是一种疼痛的红色或紫色病变，通常在冬天出现在手指或脚趾上。这些病变正在成为感染新型冠状病毒的另一种症状。冻疮是由小血管在寒冷或潮湿的条件下发生炎症引起的，但它们通常在最冷的冬季月份很常见。联邦卫生官员不将脚趾病变列入冠状病毒症状清单，但一些皮肤科医生正在推动改变，称所谓的Covid Toe应该是检测的充分理由。\n是的，但是要确保你和不住在你家里的人保持6英尺的距离。即使你只是在公园里闲逛，而不是去慢跑或散步，呼吸一些新鲜空气，希望能得到阳光，也是一个好主意。\n测量一个人的体温来寻找发烧的迹象并不像听起来那么容易，因为“正常”的体温数字可能会有所不同，但通常情况下，要注意100.5华氏度或更高的温度。如果你没有温度计(这些天它们可能很贵)，还有其他方法可以确定你是发烧了，还是有患新冠肺炎并发症的风险。\n美国疾病控制与预防中心建议所有美国人在公共场合外出时都要戴上口罩。这是联邦指导方针的转变，反映了新的担忧，即冠状病毒是由没有症状的感染者传播的。到目前为止，疾控中心和世界卫生组织一样，建议普通人除非生病和咳嗽，否则不需要戴口罩。部分原因是为了保存医用级口罩，供医护人员在口罩持续供不应求的时候迫切需要。口罩不能取代洗手和社交距离。\n如果你接触过冠状病毒或认为自己感染了冠状病毒，并出现发烧或咳嗽或呼吸困难等症状，请打电话给医生。他们应该就你是否应该接受检测，如何检测，以及如何在不潜在感染或暴露他人的情况下求医给你提供建议。\n如果你生病了，你认为你已经接触了新的冠状病毒，疾控中心建议你打电话给你的医疗保健提供者，解释你的症状和恐惧。他们会决定你是否需要检查。请记住，有一种可能性--例如，因为缺乏检测工具，或者因为你没有症状--你可能无法接受检测。\n慈善导航器使用基于数字的系统来评估慈善机构，它有一份在受疫情影响的社区工作的非营利性组织的运行名单。你可以通过美国红十字会献血，世界中央厨房已经介入，在主要城市分发食物。\n气候变化的缓慢燃烧使许多人越来越难以像他们之前的几代人那样从事农业和渔业谋生；许多工人已经迁移到附近的城市地区谋生。封锁结束了这种应对策略。印度的移民工人一直试图成群结队地回家。\n传统的暴风雨应对方式现在也变得更加危险。在过去的暴风雨中，将人们疏散到龙卷风避难所拯救了数十万人的生命，但救援人员现在担心病毒可能会在避难所迅速传播。\n在印度，遭受龙卷风袭击的加尔各答多次被认为是最容易受到气候变化累积影响的城市之一，因为糟糕的城市规划更是如此。它的1400万居民生活在紧挨着的地方，饥饿仍然困扰着他们中的许多人。\n联合国开发计划署(United Nations Development Program)本周警告称，考虑到教育、健康和生活水平的全球人类发展今年将“自1990年引入人类发展概念以来首次”下降。\n英格兰东安格利亚大学(University Of East Anglia)气候科学家科琳·勒·奎雷(Corinne Le Quéré)表示，在冠状病毒大流行之后，过去几天的极端天气事件突显了低估复杂风险影响的危险。\n她说，在大流行解除后，各国政府制定的经济复苏政策将影响未来几十年的排放轨迹。\n“重建后的新冠肺炎应该以一种减少我们脆弱性的方式来塑造，”她说。“这意味着既要为极端的气候风险做好准备，又要减少支撑气候风险的排放。”", "note_en": "The hits came this week in rapid succession: A  cyclone slammed into the Indian megacity of Kolkata, pounding rains  breached two dams in the Midwestern United States, and on  Thursday came warning that the Atlantic hurricane season could be severe.\n It all served as a reminder that the coronavirus pandemic, which has killed 325,000 people so far, is colliding with another global menace: a fast-heating planet that acutely threatens millions of people, especially the world’s poor.\n Climate change makes extreme weather events more frequent and more intense. Now, because of the pandemic, they come at a time when national economies are crashing and ordinary people are stretched to their limits.\n Relief organizations working in eastern India and Bangladesh, for instance, say the lockdown had already forced people to rely on food aid by the time the storm, Cyclone Amphan, hit. Then, the high winds and heavy rains ruined newly sown crops that were meant to feed communities through next season. “People have nothing to fall back on,” Pankaj Anand, a director at Oxfam India, said in a statement Thursday.\n Several other climate hazards are looming, as the coronavirus unspools its long tail around the world. They include the prospect of heat waves in Europe and South Asia, wildfires from the western United States to Europe to Australia, and water scarcity in South America and Southern Africa, where a persistent drought is already deepening hunger.\n  Abnormally heavy rains last year, which scientists say were made more likely by the long-term warming of the Indian Ocean, a hallmark of climate change, have exacerbated  a locust infestation across eastern Africa. Higher temperatures make it more inviting for  locusts to spread to places where the climate wasn’t as suitable before — and in turn, destroy vast swaths of farmland and pasture for some of the poorest people on the planet.\n  While the risks are different from region to region, taken together, “they should be seen as a sobering signal of what lies ahead for countries all over the world,” a group of scientists and economists warned this month in  an opinion piece in Nature Climate Change.\n The impacts will not be equal, though, they added. They stand to exacerbate longstanding inequities, the experts said, and “put specific populations at heightened risk and compromise recovery.”\n  All those  extreme weather hazards are made more frequent and intense by the accumulation of greenhouse gases in the atmosphere, which drives up temperatures on land and in the sea.\n  The lockdowns around the world have resulted in a sharp drop in greenhouse gas emissions, but the decline has been nowhere near enough to shake loose the thick blanket of gases that already wraps the planet.\n And even if lockdown measures continued for the next several months, global carbon emissions would drop by between 4 to 8 percent from last year, according to a range of projections carried out by researchers, the latest of them  published in Nature Climate Change last week. As punishing as that could be, socially and economically, it would not make a dent in overall warming trends.\n The impact of the accumulated warming is already felt by those who were in the eye of Cyclone Amphan this week: those who live in the delta regions of eastern India and Bangladesh, and who are at the mercy of intensifying heat waves, sea level rise, storm surges and super cyclones like this one.\n  In rural Bangladesh, for example, the storm punched through embankments. Seawater ate the paddy fields. Mud and thatch homes collapsed.\n Touching contaminated objects and then infecting ourselves with the germs is not typically how the virus spreads. But it can happen. A number  of studies of flu, rhinovirus, coronavirus and other microbes have shown that respiratory illnesses, including the new coronavirus, can spread by touching contaminated surfaces, particularly in places like day care centers, offices and  hospitals. But a long chain of events has to happen for the disease to spread that way. The best way to protect yourself from coronavirus — whether it’s surface transmission or close human contact — is still social distancing, washing your hands, not touching your face and wearing masks.\n  Common symptoms  include fever, a dry cough, fatigue and difficulty breathing or shortness of breath. Some of these symptoms overlap with those of the flu, making detection difficult, but runny noses and stuffy sinuses are less common.  The C.D.C. has also added chills, muscle pain, sore throat, headache and a new loss of the sense of taste or smell as symptoms to look out for. Most people fall ill five to seven days after exposure, but symptoms may appear in as few as two days or as many as 14 days.\n  If air travel is unavoidable,  there are some steps you can take to protect yourself. Most important: Wash your hands often, and stop touching your face. If possible, choose a window seat. A  study from Emory University found that during flu season, the safest place to sit on a plane is by a window, as people sitting in window seats had less contact with potentially sick people. Disinfect hard surfaces. When you get to your seat and your hands are clean, use disinfecting wipes to clean the hard surfaces at your seat like the head and arm rest, the seatbelt buckle, the remote, screen, seat back pocket and the tray table. If the seat is hard and nonporous or leather or pleather, you can wipe that down, too. (Using wipes on upholstered seats could lead to a wet seat and spreading of germs rather than killing them.)\n  More than 40 million people — the equivalent of 1 in 4 U.S. workers — have filed for unemployment benefits since the pandemic took hold. One in five who were working in February reported losing a job or being furloughed in March or the beginning of April,  data from a Federal Reserve survey released on May 14 showed, and that pain was highly concentrated among low earners. Fully 39 percent of former workers living in a household earning $40,000 or less lost work, compared with 13 percent in those making more than $100,000, a Fed official said.\n  There is an uptick in  people reporting symptoms of chilblains, which are painful red or purple lesions that typically appear in the winter on fingers or toes. The lesions are emerging as yet another  symptom of infection with the new coronavirus. Chilblains are caused by inflammation in small blood vessels in reaction to cold or damp conditions, but they are usually common in the coldest winter months. Federal health officials do not include toe lesions in the list of coronavirus symptoms, but some dermatologists are pushing for a change, saying so-called Covid toe should be sufficient grounds for testing.\n  Yes, but make sure you keep six feet of distance between you and people who don’t live in your home.  Even if you just hang out in a park, rather than go for a jog or a walk, getting some fresh air, and hopefully sunshine, is a good idea.\n  Taking one’s temperature to look for signs of fever is not as easy as it sounds, as “normal” temperature numbers can vary, but generally, keep an eye out for a temperature of 100.5 degrees Fahrenheit or higher. If you don’t have a thermometer (they can be pricey these days), there are  other ways to figure out if you have a fever, or are at risk of Covid-19 complications.\n  The C.D.C. has  recommended that all Americans wear cloth masks if they go out in public. This is a shift in federal guidance reflecting  new concerns that the coronavirus is being spread by infected people who have no symptoms. Until now, the C.D.C., like the W.H.O., has advised that ordinary people don’t need to wear masks unless they are sick and coughing. Part of the reason was to preserve medical-grade masks for health care workers who desperately need them at a time when they are in continuously short supply. Masks don’t replace hand washing and social distancing.\n  If you’ve been exposed to the coronavirus or think you have, and have a fever or symptoms like a cough or difficulty breathing, call a doctor. They should give you advice on whether you should be tested, how to get tested, and how to seek medical treatment without potentially infecting or exposing others.\n  If you’re sick and you think you’ve been exposed to the new coronavirus,  the C.D.C. recommends that you call your healthcare provider and explain your symptoms and fears. They will decide if you need to be tested. Keep in mind that there’s a chance — because of a lack of testing kits or because you’re asymptomatic, for instance — you won’t be able to get tested.\n  Charity Navigator, which evaluates charities using a numbers-based system, has a running list of nonprofits working in communities affected by the outbreak. You can give blood through the  American Red Cross, and  World Central Kitchen has stepped in to distribute meals in major cities.\n The slow burn of climate change has increasingly made it tough for many to make a living farming and fishing, as generations had before them; many workers had migrated to urban areas nearby to earn a living. The lockdown has put an end to that coping strategy. Migrant workers in India have been trying to head home in droves.\n Traditional ways of coping during storms are now more dangerous, too. Evacuating people to cyclone shelters has saved hundreds of thousands of lives in past storms, but aid workers now worry that the virus could spread quickly in shelters.\n In India, the city of Kolkata, which was pummeled by the cyclone, is repeatedly cited as one of the most vulnerable to the cumulative effects of climate change, all the more so because of poor urban planning. Its 14 million residents live cheek by jowl, and hunger still stalks many of them.\n The United Nations Development Program  this week warned that global human development, which takes into account education, health and living standards, was set to decline this year “for the first time since the concept of human development was introduced in 1990.”\n The  extreme weather events of the last few days, coming on top of the coronavirus pandemic, throw into sharp relief, said Corinne Le Quéré, a climate scientist at the University of East Anglia in England, the perils of underestimating the impact of compounding risks.\n Economic recovery policies that governments enact after the pandemic lifts, she said, would impact the trajectory of emissions for decades to come.\n “Reconstruction post Covid-19 should be shaped in a way that reduces our vulnerability,” she said. “That means both to prepare for extreme climatic risks, and to reduce emissions that underpin the climatic risks.”", "posttime": "2020-05-29 01:54:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "告诉,disasters,冠状病毒", "title": "一周的灾难告诉我们关于气候和大流行的什么", "title_en": "What a Week's Disasters Tell Us About Climate and the Pandemic", "transed": 1, "url": "https://www.nytimes.com/2020/05/23/climate/climate-change-coronavirus.html", "via": "", "real_tags": ["告诉", "disasters", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "9cd66421b47ce7863cb9c8dc2f15601b.png", "infoid": 1004114, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很兴奋地宣布，Upbound Cloud Community Preview是开始使用免费、有时间限制的环境进行早期评估的开放源码交叉平面项目的最快方式！Upbound快速为您提供一个位于现有基础设施和云服务之上的企业控制平面，为您提供构建自己的内部云平台所需的所有工具--与行业领导者构建其内部云平台的方式相同。上行和交叉平面使您可以轻松定义、编写和发布您自己的基础设施API，这些API封装了策略护栏，并添加了您的自动化，因此团队可以轻松地使用他们需要的基础设施，遵守最佳实践和策略，并更快地交付应用程序。\n从开发人员笔记本电脑到生产环境的云本地应用程序需要跨团队协作，以构建应用程序本身、部署和管理应用程序及其基础设施，并提供符合组织策略和最佳实践的云基础设施。\n今天，遗留的IAC和脚本工具必须在部署管道中粘合在一起，这些管道通常很脆弱且容易出错。如果基础设施和应用程序之间没有明确分离的关注点，团队成员很难进行协作，这样他们就可以作为大型组织的一部分贡献自己最了解的东西。\n脱节的工具使得不可能确保遵守基础设施最佳实践和控制，通常会由于可能拖延数周或数月的发布审查和批准而导致延迟的应用程序交付。\n由于数十或数百个正在生产的应用程序使用单独的工具链和混合的云平台，几乎不可能全面了解哪些应用程序在哪里运行，以及它们是否符合策略和最佳实践。\n上行云可快速为您提供企业控制平面，为您的内部云平台提供动力。IT位于您现有的云和数据中心环境、工具和流程之上，使您能够结束IAC工具链的蔓延，统一云和数据中心中的应用程序和基础设施管理，并创建基础设施抽象以供应用程序安全使用。\nUpbound的企业控制平面为配置和部署应用程序提供了单一的事实来源，无论应用程序在哪里运行，都可以从相同的存储库和管道中配置和部署应用程序所需的基础设施。\n这增强了团队协作，因为应用程序可以通过策略护栏轻松使用您的自定义基础设施API，这些API来自任何使用Kubernetes API的工具，包括kubectl、GitOps等。\nUpbound Cloud提供您的内部云平台所需的所有工具，使您可以轻松部署企业控制平面，该控制平面使用开源交叉平面项目直接从kubectl调配和管理您的应用程序所需的基础设施和服务。\n上行云提供单一管理平台来查看您的所有基础设施环境，监控应用运行状况，并跨云和数据中心应用策略。Upbound提供了单一的事实来源，因此无论应用程序和基础设施在哪里运行，您都可以从相同的存储库和管道配置和部署它们所需的应用程序和基础设施。\n任何人都可以使用我们的开源CrossPlane项目来支持他们的内部云平台，但是自己托管可能会让人分心。Upbound负责所有备份、管理和安全性，因此您可以专注于最重要的事情。\n借助上行云，您可以通过创建一个上行云环境(如dev、staging或prod)，只需单击一个按钮即可调配完全托管的交叉平面实例。\n每个环境都提供一个专用的交叉平面实例，可以使用您的自定义基础设施API进行配置。然后，当应用程序部署到该环境中时，它们可以轻松地使用所需的基础设施。\n可以将上行注册表中的交叉平面提供程序安装到环境中，以便将云提供程序原语添加到您的企业控制平面。\nUpbound Registry是所有东西CrossPlane的免费社区图书馆。发现并发布构建您自己的内部云平台所需的基础设施提供商、堆栈和应用程序。\n使用Upbound Registry可以轻松地发现、安装和发布CrossPlane的资源，这些资源可以直接使用，也可以组合到您自己的抽象中供团队使用。\n提供程序安装到环境中，以将云提供程序原语添加到您的控制平面。任何基础设施或托管服务都公开为具有跨面CRD和控制器的API，使您可以轻松使用现有基础设施和云服务。\n堆栈是将基础架构抽象发布到内部API的一种方式，因此应用程序可以轻松地使用它们。基础架构抽象也可以使用kubectl或GitOps工作流直接发布到环境。\n应用程序在工作区中安装和配置，它们可以通过每个环境中的自定义API使用所需的基础架构。还可以使用kubectl或GitOps工作流将应用程序配置直接应用到工作区。\n自定义注册表包可以发布到您的私有存储库，因此它们只对您的团队可用，或者在注册表中公开列出，以便与全世界共享您的创建。\n使用遗留脚本和IAC工具构建内部云平台既有风险又耗时，通常会导致部署管道脆弱、容易出错，并且不符合基础设施最佳实践和策略。\n通过将现有基础设施转变为内部云平台的企业控制平面，在您现有的工具、流程和基础设施之上构建向上云层。\n将交叉面提供程序安装到您的环境中后，您可以定义和发布您自己的基础架构抽象，以及策略护栏，作为现有基础架构之上的自定义基础架构API。\n然后，应用程序可以使用您的自定义基础设施API及其选择的工具，轻松调配和管理所需的基础设施，同时确保遵循组织策略和最佳实践，而不会减慢应用程序交付的速度。\n团队经常因为审批缓慢和不确定的遵从性要求而陷入困境，这阻碍了他们快速构建应用程序。\n通过上行云，您可以发布基础设施抽象，其中包括作为应用程序团队可以使用的代码编写的护栏，从而简化团队协作，使每个人都可以更轻松地使用经过审查和预先批准的基础设施API做正确的事情，而不会减慢应用程序交付的速度。\n应用程序操作员可以在工作区中构建、运行和发布应用程序，这些工作区可以从环境中发布的基础设施API轻松使用他们所需的基础设施。\n除个人帐户外，Upbound还支持包括用户、团队和机器人帐户在内的组织：\n可以随心所欲地构建团队，跨环境、工作区和存储库进行基于角色的访问控制。\n使用Upbound Cloud，您可以使用kubectl、部署管道或任何使用Kubernetes API的东西(包括GitOps工作流)通过GUI或CLI访问所有内容。\n使用免费、有时间限制的环境进行早期评估，尝试上行云社区预览，查看文档，并观看下面的视频进行导游！\n我们很高兴能得到您对上行云社区预览的反馈，所以顺道过来打个招呼吧--我们很高兴听到您的消息！\n让我们保持联系吧。您可以订阅Upbound时事通讯，获取关于Upbound、Rook和CrossPlane的最新新闻和更新。", "note_en": "We’re excited to announce the  Upbound Cloud Community Preview as the fastest way to get started with the open source  Crossplane project using free, time-limited environments for early evaluation! Upbound quickly gives you an enterprise control plane that layers on top of your existing infrastructure and cloud services, giving you all the tools you need to build your own internal cloud platform -- the same way industry leaders build theirs. Upbound and Crossplane make it easy to define, compose and publish your own infrastructure APIs that encapsulate policy guardrails, and add your automation, so it’s easy for teams to consume the infrastructure they need, conform to best-practices and policies, and deliver applications faster.\n  The path of cloud native apps from developer laptop into production requires collaboration across teams to build the app itself, deploy and manage the app and it’s infrastructure, and provide cloud infrastructure that complies with organizational policies and best-practices.\n  Today, legacy IaC and scripting tools must be glued together in deployment pipelines that are often fragile and error prone. It’s difficult for team members to collaborate without a clear separation of concerns between infrastructure and applications, so they can contribute what they know best as part of a larger organization.\n Disjointed tooling makes it impossible to ensure that infrastructure best-practices and controls are observed, often resulting in delayed application delivery due to release reviews and approvals that can drag out for weeks or months.\n With tens or hundreds of apps in production using separate toolchains and a mix of cloud platforms, it can be almost impossible to get a complete picture of what’s running where and if they’re compliant with policies and best-practices.\n  Upbound Cloud quickly gives you an enterprise control plane to power your internal cloud platform. It layers on top of your existing cloud and data center environments, tooling, and processes empowering you to end IaC toolchain sprawl, unify application and infrastructure management across clouds and data centers, and create infrastructure abstractions for applications to safely consume.\n Upbound’s enterprise control plane provides a single source of truth to configure and deploy applications with the infrastructure they need from the same repositories and pipelines, no matter where they run.\n This enhances team collaboration as applications can easily consume your custom infrastructure APIs, with policy guardrails, from any tool that works with the Kubernetes API including kubectl, GitOps, and more.\n  Upbound Cloud provides all the tools you need for your internal cloud platform, making it easy to deploy an enterprise control plane that uses the open source Crossplane project to provision and manage the infrastructure and services your applications need directly from kubectl.\n  Upbound Cloud provides a single pane of glass to view all your infrastructure environments, monitor application health, and apply policies across clouds and data centers. Upbound provides a single source of truth so you can configure and deploy applications and the infrastructure they need from the same repositories and pipelines no matter where they run.\n  Anyone can use our open source Crossplane project to power their internal cloud platform, but hosting it yourself can be a distraction. Upbound takes care of all the backups, management, and security so you can focus on what matters most.\n With Upbound Cloud, you can provision a fully-managed Crossplane instance with the click of a button by creating an Upbound Cloud  Environment, like dev, staging, or prod.\n  Each  Environment provides a dedicated Crossplane instance that can be configured with your custom infrastructure APIs. Applications can then easily consume the infrastructure they require when they’re deployed into that Environment.\n Crossplane  Providers from the Upbound Registry can be installed into an  Environment to add cloud provider primitives to your enterprise control plane.\n  The Upbound Registry is the free community library for all things Crossplane. Discover and publish the infrastructure providers, stacks, and applications you need to build your own internal cloud platform.\n  The Upbound Registry makes it easy to discover, install, and publish resources for Crossplane that can be consumed directly or composed into your own abstractions for teams to use.\n Providers are installed into an Environment to add cloud provider primitives to your control plane. Any infrastructure or managed service is exposed as an API with Crossplane CRDs and controllers, making it easy to use your existing infrastructure and cloud services.\n Stacks are one way to publish infrastructure abstractions to your internal API, so applications can easily consume them. Infrastructure abstractions can also be directly published to an Environment using kubectl or GitOps workflows.\n Applications are installed and configured in  Workspaces, and they can consume the infrastructure they need through your custom APIs in each Environment. Application configurations can also be directly applied to a Workspace using kubectl or GitOps workflows.\n Custom registry packages can be published to your private  Repositories, so they’re only available to your team, or publicly listed in the Registry to share your creation with the whole world.\n  Building an internal cloud platform with legacy scripting and IaC tools is risky and time consuming, often resulting in deployment pipelines that are fragile, error prone, and don’t adhere to infrastructure best-practices and policies.\n Upbound Cloud layers on top of your existing tools, processes and infrastructure with an enterprise control plane that transforms existing infrastructure into an internal cloud platform.\n With a Crossplane  Provider installed into your Environment you can define and publish your own infrastructure abstractions, with policy guardrails, as custom infrastructure APIs on top of your existing infrastructure.\n Applications can then consume your custom infrastructure APIs, with their tools of choice, to easily provision and manage the infrastructure they need while ensuring organizational policies and best-practices are followed, without slowing the pace of application delivery.\n   Teams are often bogged down by slow approvals and uncertain compliance requirements which prevent them from building applications quickly.\n Upbound Cloud lets you publish infrastructure abstractions which include guardrails written as code that application teams can consume, streamlining team collaboration and making it easier for everyone to do the right thing using vetted and pre-approved infrastructure APIs, without slowing the pace of application delivery.\n Application operators can build, run, and publish Applications in  Workspaces that can easily consume the infrastructure they need from the published infrastructure APIs in an  Environment.\n  In addition to personal accounts, Upbound supports  Organizations which include users, teams and robot accounts:\n Teams that can be structured however you like, with role-based access control across Environments, Workspaces and Repositories.\n  With Upbound Cloud you can access everything through the GUI or via the CLI using kubectl, deployment pipelines, or anything that works with the Kubernetes API including GitOps workflows.\n   Try Upbound Cloud Community Preview using free, time-limited environments for early evaluation, checkout the  docs, and watch the video below for a guided tour!\n   We&#39;re excited to get your feedback on the  Upbound Cloud Community Preview, so drop by and say hi -- we&#39;d love to hear from you!\n         Let&#39;s stay in touch. You can subscribe to the Upbound newsletter to get the latest news and updates on Upbound, Rook and Crossplane.", "posttime": "2020-05-29 01:53:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社区,cloud,应用程序", "title": "上行云社区预览", "title_en": "Upbound Cloud Community Preview", "transed": 1, "url": "https://blog.upbound.io/announcing-upbound-cloud-community-preview/", "via": "", "real_tags": ["社区", "cloud", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "c13d9d728ba10528d9163dd928cd29fb.jpg", "infoid": 1004113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安全外壳(Secure Shell)的两个开源代码库的开发者将淘汰SHA-1散列算法。安全外壳是数百万台计算机用来创建彼此加密连接的协议。四个月前，研究人员在SHA-1的棺材上钉上了最后一颗钉子。\n这些举措分别在发行说明和OpenSSH和libssh的代码更新中宣布，这意味着SHA-1将不再是一种对加密密钥进行数字签名的手段，这些密钥阻止监控或操作通过SSH连接的两台计算机之间传递的数据。SSH是Secure Shell的常见缩写。(周三关于OpenSSH中SHA-1弃用的发布说明逐字重复了开发人员在2月份发布说明中的内容，但直到现在似乎很少有人注意到计划中的更改。)。\n加密散列函数生成称为散列摘要的长字符串。从理论上讲，对于馈送到函数的每个文件、消息或其他输入，摘要都应该是唯一的。实际上，考虑到可用计算资源的性能，摘要冲突在数学上肯定是不可行的。近年来，在研究人员展示了攻击者伪造使用SHA-1的数字签名的实用方法后，许多软件和服务已经停止使用SHA-1。专家们一致认为，它在几乎所有的安全环境中都不再安全。\n“这是托儿所里的电锯，”安全研究员肯恩·怀特(Kenn White)在谈到1995年首次亮相的散列函数时说。\n近十年前，研究人员开始警告说，SHA-1越来越容易受到碰撞的影响，这是一个密码术语，指两个或更多的输入产生相同的输出摘要。到那时，当国家支持的黑客利用同样脆弱的MD5算法发生冲突，劫持微软的Windows Update系统时，世界已经亲眼目睹了此类攻击的破坏性。\n虽然SHA-1对这种碰撞攻击的要求更高，但达到这些要求只是个时间问题。2017年，SHA-1屈服于一种威力较小的碰撞攻击形式，生产成本仅为11万美元。在研究之前和之后的几个月里，大量浏览器、浏览器信任的证书颁发机构和软件更新系统都放弃了该算法。其他服务和软件产品继续使用SHA-1。\nSHA-1的最后丧钟在1月份敲响了，研究人员揭开了一种更强大的碰撞攻击的面纱，成本只有4.5万美元。它被称为选择前缀冲突，允许攻击者模仿他们选择的目标，就像针对微软基础设施的MD5攻击一样。\n正是在这样的背景下，OpenSSH开发人员在周三发布的发行说明中写道：\n现在可以以低于50K美元的价格对SHA-1算法执行选择前缀攻击。因此，我们将在不久的将来版本中默认禁用&#34；ssh-rsa&#34；公钥签名算法。\n不幸的是，尽管存在更好的替代方案，但该算法仍然被广泛使用，它是原始SSH RFC指定的唯一剩余的公钥签名算法。\n考虑到数以百万计的组织依赖SSH连接到公司网络、Amazon和Azure云服务，以及互联网上的各种其他计算机，可以说，这些反对来得太晚了，这是可悲的，因为SSH依赖于SSH来连接到公司网络、Amazon和Azure云服务，以及互联网上的各种其他计算机。让事情变得复杂的是，在运行自动取款机和工业控制系统的网络交换机和低成本嵌入式机器中使用SSH。嵌入式系统经常接收不到更新，因为它们位于很远的地方，这使得在出现问题时很难排除故障。\n在一封电子邮件中，Inria France研究员、1月份这项研究的合著者之一Gaëtan Leurent表示，他预计OpenSSH开发人员不会很快实现这些弃用功能。他写道：\n当他们完全禁用SHA-1时，将不可能从最新的OpenSSH连接到使用旧SSH服务器的设备，但在此之前，他们可能会采取渐进的步骤(带有严重警告)。此外，具有SSH访问权限的嵌入式系统很多年都没有更新过，可能会有很多安全问题，所以也许干扰它们也不是太糟糕……。\n无论如何，我对此相当满意，这正是我们想要达到的目标：-)。\n随着OpenSSH和libssh最终宣布他们的弃用计划，SHA-1的拒绝名单变短了，但绝不会消失。OpenSSL的最新版本仍然支持老化功能，OpenSSL是许多网站和互联网服务用来实现HTTPS和其他加密协议的代码库。本月早些时候发布的GNU编译器集合的最新版本使用SHA-1进行了数字签名。\nLeurent说，支付卡的EMV标准也使用SHA-1，但该标准使用了一种“奇怪的签名系统，似乎不会直接受到选择前缀冲突的影响。”Git也支持SHA-1，但仅限于数据完整性，大多数专家认为这不会构成安全威胁。", "note_en": "Developers of two open source code libraries for Secure Shell—the protocol millions of computers use to create encrypted connections to each other—are retiring the SHA-1 hashing algorithm, four months after researchers piled a final nail in its coffin.\n The moves, announced in  release notes and a  code update for OpenSSH and libssh respectively, mean that SHA-1 will no longer be a means for digitally signing encryption keys that prevent the monitoring or manipulating of data passing between two computers connected by SSH—the common abbreviation for Secure Shell. (Wednesday&#39;s release notes concerning SHA-1 deprecation in OpenSSH repeated word for word what developers put in  February release notes, but few people seemed to notice the planned change until now.)\n  Cryptographic hash functions generate a long string of characters that are known as a hash digest. Theoretically, the digests are supposed to be unique for every file, message, or other input fed into the function. Practically speaking, digest collisions must be mathematically infeasible given the performance capabilities of available computing resources. In recent years, a host of software and services have stopped using SHA-1 after researchers demonstrated practical ways for attackers to forge digital signatures that use SHA-1. The unanimous agreement among experts is that it&#39;s no longer safe in almost all security contexts.\n “Its a chainsaw in a nursery,” security researcher Kenn White said of the hash function, which made its debut in 1995.\n Nearly a decade ago, researchers started warning that SHA-1 was growing  increasingly vulnerable to collisions, the cryptographic term when two or more inputs generate the same outputted digest. By then, the world had already seen firsthand how damaging such attacks could be when nation-sponsored hackers used a collision on the also-weak MD5 algorithm to  hijack Microsoft&#39;s Windows Update system.\n While the requirements for that sort of collision attack were higher for SHA-1, it was only a matter of time until they came into reach. In 2017, SHA-1  succumbed to a less powerful form of collision attack that cost as little as $110,000 to produce. In the months prior and following the research, a raft of browsers, browser-trusted certificate authorities, and software update systems  all abandoned the algorithm. Other services and software offerings continued using SHA-1.\n  The final death knell for SHA-1 sounded in January, when researchers unveiled an even  more powerful collision attack that cost as little as $45,000. Known as a chosen prefix collision, it allowed attackers to impersonate a target of their choosing, as was the case in the MD5 attack against Microsoft&#39;s infrastructure.\n It was in this context that OpenSSH developers wrote in release notes published on Wednesday:\n It is now possible to perform chosen-prefix attacks against the SHA-1 algorithm for less than USD$50K. For this reason, we will be disabling the &#34;ssh-rsa&#34; public key signature algorithm by default in a near-future release.\n This algorithm is unfortunately still used widely despite the existence of better alternatives, being the only remaining public key signature algorithm specified by the original SSH RFCs.\n It’s arguable that the deprecations come woefully late, given the reliance by millions of organizations on SSH to connect to corporate networks, Amazon and Azure cloud services, and all manner of other computers populating the Internet. Complicating matters is the use of SSH in network switches and low-cost embedded machines that run ATMs and industrial control systems. Embedded systems frequently don’t receive updates because they’re in far-off places that make it difficult to troubleshoot in the event something goes wrong.\n In an email, Gaëtan Leurent, an Inria France researcher and one of the co-authors of the January research, said he didn&#39;t expect OpenSSH developers to implement the deprecations quickly. He wrote:\n When they completely disable SHA-1, it will become impossible to connect from a recent OpenSSH to a device with an old SSH server, but they will probably take gradual steps (with big warnings) before that. Also, embedded systems with an SSH access that have not been updated in many years probably have a lot of security issues, so maybe it&#39;s not too bad to disrupt them...\n In any case, I am quite happy with this move, this is exactly what we wanted to achieve :-)\n With OpenSSH and libssh finally announcing their deprecation plans, the list of SHA-1 holdouts is shorter but by no means gone. The aging function is still supported in recent versions of OpenSSL, the code library that many websites and Internet services use to implement HTTPS and other encryption protocols. The latest version of the GNU Compiler Collection,  released earlier this month, was digitally signed using SHA-1.\n Leurent said that the EMV standard for payment cards also uses SHA-1 but that the standard used a “weird system for signature that doesn&#39;t seem directly affected by chosen-prefix collisions.” Git also supports SHA-1, but only for data integrity, which most experts say doesn&#39;t pose a security threat.", "posttime": "2020-05-29 01:52:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,sha", "title": "危险的SHA-1密码功能即将在SSH中消亡", "title_en": "Dangerous SHA-1 crypto function is about to die in SSH", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/05/dangerous-sha-1-crypto-function-is-about-to-die-in-ssh/", "via": "", "real_tags": ["密码", "sha"]}, {"category": "", "categoryclass": "", "imagename": "787dd823c1f21d25f23087c0faa70c89.jpg", "infoid": 1004112, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CEOS是一个体验式内容创建平台，使营销人员和设计师能够在没有传统开发或代码的情况下创建引人入胜、交互式和身临其境的内容体验。\n参观Ceros。\nCEROS Inspire汇集了引人入胜的文章、发人深省的采访和成功的故事，以及在CEROS中创建的非凡体验内容的例子。从体验内容的力量和可能性中获得灵感。\n参观Ceros Inspire。\nCEOS Education包括深入的课程、支持文章、可下载的资产以及更多内容，以帮助您和您的团队了解CEOS和体验式内容最佳实践。今天你想学些什么？\n参观Ceros大学。\nCeros Originals探索我们共享的视觉世界-品牌、设计、时尚、视频和技术。它正在建立一个由数字创意人员和其他有视觉头脑的人组成的日益增长的社区，他们对媒体的欣赏程度与对信息的欣赏程度一样深。\n参观Ceros Originals。\nCEOS Resources为营销人员和设计师提供战略指南、网络研讨会和长期体验，教育他们体验内容的力量，并使他们能够将业务推向体验方向。\n访问Ceros资源", "note_en": "Ceros is an experiential content creation platform that empowers marketers and designers to create engaging, interactive, and immersive content experiences without traditional development or code.\n   Visit Ceros\n  Ceros Inspire pulls together compelling articles, thought-provoking interviews, and success stories, with examples of remarkable experiential content created in Ceros. Get inspired by the power and possibilities of experiential content.\n   Visit Ceros Inspire\n  Ceros Educate includes in-depth lessons, support articles, downloadable assets, and more to help educate you and your team on Ceros and experiential content best practices. What do you want to learn about today?\n   Visit Ceros Educate\n  Ceros Originals explores our shared visual world—brands, design, fashion, video, and tech. It is building a growing community of digital creatives and other visually-minded people who appreciate the medium as deeply as the message.\n   Visit Ceros Originals\n  Ceros Resources presents strategic guides, webinars, and long-form experiences for both marketers and designers that educate them on the power of experiential content and empower them to move their businesses in an experiential direction.\n   Visit Ceros Resources", "posttime": "2020-05-29 01:52:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,朝鲜,design,ceros", "title": "朝鲜的平面设计", "title_en": "The Graphic Design of North Korea", "transed": 1, "url": "https://www.ceros.com/originals/north-korea-graphic-design/", "via": "", "real_tags": ["设计", "朝鲜", "design", "ceros"]}, {"category": "", "categoryclass": "", "imagename": "700ec99cd9202b2fbdaffc19b15d6b8d.jpeg", "infoid": 1004109, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在2014年，联合国下属的气候变化小组预测，化石燃料的二氧化碳排放量将继续稳步上升，今年将达到400亿吨，在某些情况下，到2050年，二氧化碳排放量将再次翻一番。\n即使在新冠肺炎之前，这些情况看起来越来越不可能，现在更不可能了。国际能源署去年的排放量为330亿吨，并预测随着新冠肺炎关闭全球大片经济活动，今年排放量将骤降8%。\n..。", "note_en": "Back in 2014 the United Nations-affiliated panel on climate change predicted carbon-dioxide emissions from fossil fuels would keep rising steadily, hitting 40 billion metric tons this year and, in some scenarios, nearly doubling again by 2050.\n  Even before Covid-19, those scenarios looked increasingly unlikely, and they are even less likely now. The International Energy Agency put emissions last year at 33 billion tons, and predicts they will plummet 8% this year as Covid-19 shuts down swathes of global economic activity.\n...", "posttime": "2020-05-29 01:51:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,buying,排放量", "title": "冠状病毒正在为气候变化争取时间。我们会利用它吗？", "title_en": "Coronavirus Is Buying Time on Climate Change. Will We Make Use of It?", "transed": 1, "url": "https://www.wsj.com/articles/coronavirus-is-buying-time-on-climate-change-will-we-make-use-of-it-11590676308", "via": "", "real_tags": ["冠状病毒", "病毒", "buying", "排放量"]}]