[{"category": "", "categoryclass": "", "imagename": "3aadac7be7dcd7ff0aecb4e0dee75850.jpg", "infoid": 1071541, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“[他们的策略显示]在将复杂问题转化为更简单的问题方面具有难以置信的聪明才智，”马里兰大学的 Chris Laskowski 补充道，他与 Shelah 合作了大约 12 篇论文（尽管不是这一篇）。 “许多人尝试过但没有成功。能解决这个问题真是太好了。”由于 Friedman 和 Stanley 提出的问题涉及一类无限可数结构，因此有助于理解数学家如何处理这些看似笨拙的数量。首先，结构集合“可数”意味着什么？自然数 (0, 1, 2, 3 ...) 是无限的，但仍被认为是可数的，原因与它们有时被称为计数数的原因相同。如果您按顺序调出这些数字，它们几乎会自行计算。 （当然，您会在一段时间内了解它。）自然数集合中的元素数或其“基数”被标记为 aleph-0。数学家认为任何与自然数的无限集大小相同的集合也是可数的。相反，实数——包括自然数以及有理数和无理数——也是无限的，但它们被归类为不可数。主要原因是它们太多了：我们从 1800 年代后期就知道，0 和 1 之间塞满的实数比所有自然数加起来还要多。这是另一种说法，并非所有无穷大都生而平等。有些比其他的要大。实数集比自然数具有更大的基数，因为它们更多。任何可数的集合要么是有限的，要么如果是无限的，则基数为 aleph-0。那么数学家可以用这些想法做什么呢？ Friedman-Stanley 的论文以及 Paolini 和 Shelah 的新工作重点关注结构之间的等价关系——称为同构。例如，让我们考虑两个无限但可数的数字组：... -3, -2, -1, 0, 1, 2, 3 ... ... -6, -4, -2, 0, 2, 4, 6 ...第一组由整数组成；第二个仅由偶数组成。这两个群彼此同构，因为除其他外，它们具有相同数量的元素，也就是说它们的无穷大是相同的。并且一个组中的每个元素都对应于——或者，正如数学家所说，“映射到”——另一组中的一个元素。此外，用于从一组映射到另一组的函数还必须保留组操作和属性（例如加法结合律）。像这样的同构群并不相同，因为它们没有相同的元素，但它们确实具有平行结构：一组中的每个元素都与另一组中的单个元素直接相关。函数可以将第一个结构转换为第二个结构，如上例所示，只需将第一个结构的每个元素乘以 2。同构结构具有 Paolini 所说的“相同形状”，如果不是完全相同的内容。\n“说两个结构是同构的意味着它们本质上是相同的，”Laskowski 说。 “你可以有一个红色的或一个蓝色的，但在内心深处，它们是一样的。”在他们 1989 年的论文中，弗里德曼和斯坦利主要想知道一件事：给定一个可数结构族——它们是无限组的数字（如上面提到的整数）还是图（可以通过以下方式连接的无限种类的顶点）边）——找出该族中的对象是否彼此同构有多难？弗里德曼和斯坦利举出的一个案例涉及一系列图，每个图都有无限（尽管可数）的顶点数。对于要标记为同构的两个可数图，一个图中的顶点与另一个图中的顶点之间必须再次存在一对一的对应关系。如果一个图中的两个顶点由一条边连接，则另一个图中相应的顶点也必须由一条边连接。弗里德曼和斯坦利表明，回答两个可数图是否同构的问题是极其复杂的——尽可能地困难。这使所有可数图的族都成为“Borel 完备的”。 （两人在 1989 年的论文中创造了这个术语，因为他们依赖于数学家 Armand Borel 设计的所谓的 Borel 函数。）Friedman 和 Stanley 然后想知道：还有哪些类别的可数对象是 Borel 完备的？拉斯科夫斯基说，这个简单的问题“是描述性集合论的核心主题之一。”从那以后的几年里，弗里德曼、斯坦利和其他人已经确定了几类满足 Borel 完备性标准的数学对象，包括树——一种简化的图——和线性阶数，一组数字（自然或实数），字面上是顺序排列，就像数轴上的数字一样。但在 1989 年的论文中考虑的许多不同情况中，只有一个——关于上述无扭转阿贝尔群——拒绝通过同构进行分类。为了一次一个地描述这个令人生畏的术语，TFAB 组从根本上说是一组数字。每个 TFAB 由遵循某些群规则的实数的可数子集组成，例如在加减下封闭（因此对于该群中的任何数字 p 和 q，p + q 和 p - q 也出现在群中）。它还遵守交换律（意味着 p + q = q + p），这是阿贝尔群的标志。最后，术语无扭转意味着如果 g 是群中的非零元素，则 g + g 永远不能等于零，g + g + g 也不能，g + g + g + g 也不能，依此类推。\nShelah 说，30 年来，数学家一直想知道：“如果我们有两个 [可数] 无扭阿贝尔群，我们问它们是否同构，这是一个简单的问题，一个中间问题还是最难的问题？” Kechris 说，在 Friedman-Stanley 论文中提出的所有问题中，这个问题解决的时间最长。 “所以说它最具挑战性是合理的。”在它产生效果之前需要一种新的方法。他们通过使用经典数学家的技巧做到了这一点：将顽固的问题简化为更易于管理的问题。如果他们能够证明 TFAB 与另一个已知的 Borel 完备结构族（例如可数图族）一样复杂，那么将证明 TFAB 也是如此。 “如果你想知道一个人是否是世界上最高的人，有什么聪明的方法呢？”保利尼问道。 “与其和地球上的每个人都核对，不如去找被认为最高的人，看看谁更高。” Shelah 解释说，在决定使用可数图作为衡量标准后，他们面临着关键的下一步：创建一个函数（特别是一种 Borel 函数），它可以“将一个图转换成一个无扭阿贝尔群”。他们的函数需要接受一个图作为它的输入并产生一个 TFAB 作为它的输出，在这个过程中将信息从图传递到组。更具体地说，函数 f 必须满足以下关系： 两个可数图 G 和 H 彼此同构当且仅当 f(G) 和 f(H) 是可数的 TFAB，它们也彼此同构.这项任务并不容易，因为他们没有可用的“技术”来连接如此不同的数学对象。他们不得不为这个问题发明它。 “整个游戏归结为构建这个功能，”Laskowski 说。 “这就像比较苹果和橙子。图和组没有相同的词汇。因此，在这种情况下，您所做的就是创建通信。”再说一次，他们真的是在比较无限组的苹果和无限组的橙子。幸运的是，Shelah 说，他们找到了一种简化事情的方法。 “你可以[使用]一个通用的图而不是处理所有的图”——一个非常庞大的图，它的子图，其中包含的较小的图，包括所有可能的可数图。\nLaskowski 说，这是一个令人印象深刻的策略。 “我不会直接尝试解决这个问题，这会涉及大量的图和组，我只会选择这个一个母可数图，每个可数图都出现在它的保护伞下。”通过这种方式，Paolini 和 Shelah 能够构建必要的函数，从而证明图和 TFAB 处于一种平等的地位。 “我们找到了一种将无扭阿贝尔群与图相关联的方法，以便保留同构，”保利尼说。并且由于数学家已经知道可数图族是 Borel 完备的——也就是说，在同构方面是最复杂的——这意味着可数 TFAB 族也必须是 Borel 完备的。他们终于有了答案。这个结果会导致更​​普遍的事情吗？ “这还有待观察，”Kechris 说，“但很有可能。”事实上，Paolini 和 Shelah 已经在考虑扩大他们的结果。 Shelah 说，在解决了可数 TFAB 的情况后，他们现在正在调查更大的不可数 TFAB 集，它们“可能有不同的答案”。有理由认为他们可能会发现。 “Shelah 有一个理论，”Laskowski 说，“当你将某些问题推到更高的基数时，某些问题会变得更容易”——更高的无穷级——因为当数字变得非常大时，重要数字之间的距离会增加，比如质数和整数的平方。结果，Shelah 告诉 Laskowski，“空气变得更清晰”，这可能使数学家更容易看清事物。与此同时，他们关于可数 TFAB 的论文已经具有一些直接的实际意义。 “我们现在知道你的能力受到限制，”Shelah 说。例如，您永远不会发现该族群的区别属性（称为不变量）会自动告诉您两个 TFAB 是否同构。这是可数 TFAB 集合是 Borel 完备这一事实的直接结果。\n“我们证明根本没有简单的方法来确定 [同构]，”Paolini 说。 “没有回旋的余地。尽可能地困难。”这是有用的知识，因为寻找不变量是数学家的主要关注点。 “这有点像说人们不应该花很多时间来尝试发明永动机，”Shelah 说，“鉴于我们现在知道这样的机器无法制造。”展望未来，数学家可能会发现其他类别的无限可数结构，例如图和 TFAB，它们在确定同构时最为复杂。同样，保利尼说，“可以想象，我们可以在地球上找到其他像亚马逊一样复杂的丛林。”但当然，在这个类比中，没有比这更复杂的了。仅仅知道这个事实，并且知道 TFAB 尽可能复杂，就可以简化或不复杂化情况——对于分类学家和描述性集合理论家来说都是如此。", "note_en": "“[Their strategy displays] an incredible amount of cleverness in transforming a complicated problem into something easier,” added  Chris Laskowski of the University of Maryland, who has collaborated with Shelah on roughly a dozen papers (though not this one). “Many had tried and not succeeded. It’s great to have this settled.”\n  Because the problem posed by Friedman and Stanley involves a class of infinite countable structures, it helps to understand  how mathematicians work with such seemingly unwieldy quantities. For starters, what does it mean for a collection of structures to be “countable”? The natural numbers (0, 1, 2, 3 …) are infinite but still considered countable, for the same reason that they are sometimes called counting numbers. If you call out these numbers sequentially, they’ll pretty much count themselves. (Of course, you’ll be at it for a while.) The number of elements in the set of natural numbers, or its “cardinality,” is labeled aleph-zero. Mathematicians regard any set that’s the same size as the infinite set of natural numbers as countable too.\n In contrast, the real numbers — which include the natural numbers as well as rational and irrational numbers — are also infinite, but they are classified as uncountable. The main reason is that there are simply too many of them: We’ve known since the late 1800s that more real numbers are crammed between 0 and 1 than all the natural numbers put together. This is another way of saying that all infinities are not created equal; some are greater than others. The set of real numbers has a bigger cardinality than the natural numbers because there are more of them. Any countable set of numbers either is finite or, if it is infinite, has a cardinality of aleph-zero.\n So what can mathematicians do with these ideas? The Friedman-Stanley paper, as well as the new work by Paolini and Shelah, focused on an equivalence relation — called isomorphism — between structures. As an example, let’s consider two infinite but countable groups of numbers:\n … −3, −2, −1, 0, 1, 2, 3 … … −6, −4, −2, 0, 2, 4, 6 …\n The first group consists of the integers; the second consists of just the even integers. These two groups are isomorphic to each other because, among other things, they have the same number of elements, which is to say their infinities are the same. And every element of one group corresponds to—or, as mathematicians say, “maps to”—a single element in another set. Moreover, the function used to map from one group to another also must preserve the group operations and properties (such as the associative law of addition).\n  Isomorphic groups like these are not identical, as they don’t have the same elements, but they do have a parallel structure: Each element in one group is directly related to a single element in another group. A function can convert the first structure into the second, as in the above example, simply by multiplying each element of the first by 2. Isomorphic structures have what Paolini calls “the same shape,” if not the exact same content.\n “Saying that two structures are isomorphic means they are essentially the same,” said Laskowski. “You could have a red one or a blue one, but deep down they are the same thing.”\n   In their 1989 paper, Friedman and Stanley mainly wanted to know one thing: Given a family of countable structures — whether they’re infinite groups of numbers (like the integers mentioned above) or graphs (an infinite assortment of vertices that may be connected by edges) — how hard is it to find out whether the objects within that family are isomorphic to each other?\n One case taken up by Friedman and Stanley concerned a family of graphs, each with an infinite — though countable — number of vertices. For two countable graphs to be labeled isomorphic, there must again be a 1-to-1 correspondence between vertices in one graph and vertices in the other. And if two vertices are connected by an edge in one graph, the corresponding vertices in the other graph must also be connected by an edge.\n Friedman and Stanley showed that answering the question of whether two countable graphs are isomorphic is maximally complicated — as hard as it can possibly be. That qualifies the family of all countable graphs as “Borel complete.” (The pair coined the term in their 1989 paper because of their reliance on a so-called Borel function, devised by the mathematician Armand Borel.)\n Friedman and Stanley then wondered: What other classes of countable objects are Borel complete? That simple question, Laskowski said, “is one of the central themes of descriptive set theory.”\n  In the years since, Friedman, Stanley and others have identified several classes of mathematical objects that satisfy the criteria of Borel completeness, including trees — a simplified kind of graph — and linear orders, a set of numbers (natural or real) that are literally arranged in order, just like the numbers on a number line.\n But among the many different cases considered in the 1989 paper, only one — concerning the aforementioned torsion-free abelian groups — resisted classification by isomorphism. To describe this daunting term one step at a time, TFAB groups are, fundamentally, groups of numbers. Each TFAB consists of a countable subset of the real numbers that follows certain group rules, such as being closed under addition and subtraction (so that for any numbers  p and  q in this group,  p +  q and  p –  q also appear in the group). It also obeys the commutative law (meaning that  p +  q =  q +  p), a hallmark of abelian groups. Finally, the term torsion-free implies that if  g is a nonzero element in the group, then  g +  g can never equal zero, nor can  g +  g +  g, nor  g +  g +  g + g, and so on.\n For 30 years, Shelah said, mathematicians have wondered: “If we have two [countable] torsion-free abelian groups, and we ask if they are isomorphic, is this an easy problem, an intermediate problem or the hardest problem?”\n Of all the problems raised in the Friedman-Stanley paper, this one took the longest to solve, Kechris said. “So it’s reasonable to call it the most challenging.” A new approach was needed before it would yield.\n   They did it by using a classic mathematician’s trick: reducing an intransigent problem to a somewhat more manageable one. If they could show that TFABs were as complex as another family of structures already known to be Borel complete — say, the family of countable graphs — it would prove that TFABs were, too. “If you want to find out if a person is the tallest in the world, what’s a smart way of doing it?” Paolini asked. “Rather than checking with everyone on Earth, you go instead to the person who is considered tallest and see who is taller.”\n Having decided to use countable graphs as the yardstick, Shelah explained, they faced the critical next step: to create a function (specifically a type of Borel function) that could “take a graph and transform it into a torsion-free abelian group.” Their function would need to accept a graph as its input and produce a TFAB as its output, in the process transferring information from the graph to the group. More specifically, the function  f would have to satisfy the following relation: Two countable graphs, G and H, are isomorphic to each other if and only if  f(G) and  f(H) are countable TFABs that are also isomorphic to each other.\n The task was not easy, as there was no available “technology” the pair could draw upon to link such distinct mathematical objects; they had to invent it just for this problem.\n “The whole game came down to building this function,” Laskowski said. “It’s like comparing apples and oranges. Graphs and groups don’t have the same vocabulary. So what you are doing in situations like this is creating a correspondence.”\n And again, they’re really comparing infinite groups of apples with infinite groups of oranges. Luckily, Shelah said, they found a way to simplify things. “Instead of dealing with all graphs, you can [use] one graph that is universal” — a graph so gargantuan that its subgraphs, the smaller graphs contained within it, include all possible countable graphs.\n  It was an impressive tactic, Laskowski said. “Instead of trying to take on this problem directly, which would involve a heck of a lot of graphs and groups, I’ll just pick this one mother countable graph, and every countable graph appears under its umbrella.”\n In this way, Paolini and Shelah were able to construct the necessary function thereby demonstrating that graphs and TFABs are on a kind of equal footing. “We found a way of associating torsion-free abelian groups with graphs so that isomorphism is preserved,” Paolini said.\n And since mathematicians already knew the family of countable graphs was Borel complete — that is, maximally complicated with respect to isomorphism — this meant the family of countable TFABs must also be Borel complete. They finally had their answer.\n  Could this result lead to something more general? “That remains to be seen,” Kechris said, “but it’s quite possible.”\n Paolini and Shelah are, in fact, already looking into extending their result. Having solved the case of countable TFABs, they are now investigating the larger set of uncountable TFABs, which “may have a different answer,” Shelah said.\n  There’s reason to think that they may find out. “Shelah has a theory,” Laskowski said, “that certain questions become easier when you push them up to higher cardinality” — higher levels of infinity — because when the numbers get really big, the distance grows between important numbers, such as primes and squares of integers. As a result, Shelah told Laskowski, “the air becomes clearer,” potentially making it easier for mathematicians to see things.\n In the meantime, their paper on countable TFABs already has some immediate practical implications. “We now know that you are restricted in what you can do,” Shelah said. For example, you won’t ever find distinguishing properties (called invariants) of this family of groups that will automatically tell you if two TFABs are isomorphic.  That is a direct consequence of the fact that the set of countable TFABs is Borel complete.\n “We proved that there is no easy way of determining [isomorphisms] at all,” Paolini said. “There is no middle ground. It is as difficult as possible.”\n This is useful knowledge, given that searching for invariants is a major preoccupation among mathematicians. “It’s kind of like saying that people should not spend a lot of time trying to invent a perpetual-motion machine,” Shelah said, “given that we now know that such a machine cannot be built.”\n  Looking to the future, it’s possible that mathematicians will uncover other classes of infinite, countable structures, like graphs and TFABs, that are maximally complicated when it comes to determining isomorphisms. In the same way, Paolini said, “it’s conceivable that we could find other jungles on Earth that are as complicated as the Amazon.” But of course in this analogy, none could ever be more complicated.\n Just knowing that fact, and knowing that TFABs are as complicated as possible, can simplify, or uncomplicate, the picture — for taxonomists and descriptive set theorists alike.", "posttime": "2021-08-05 23:50:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学家,solve,可数", "title": "数学家解决了几十年的分类问题", "title_en": "Mathematicians Solve Decades-Old Classification Problem", "transed": 1, "url": "https://www.quantamagazine.org/mathematicians-solve-decades-old-classification-problem-20210805/", "via": "", "real_tags": ["数学家", "solve", "可数"]}, {"category": "", "categoryclass": "", "imagename": "5a1456d18b2643af4329f9915543d322.jpeg", "infoid": 1071540, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国参议院加密行业的支持者提交了一份对两党基础设施​​法案的修正案，以明确矿工和加密服务提供商无需遵守有关加密经纪人的新税务报告规则。根据一份新闻稿，该修正案将“澄清‘经纪人’仅指那些在消费者买卖和交易数字资产的交易所进行交易的人”。这意味着美国国税局将无法要求矿工、利益相关者和销售用于存储数字资产的硬件或软件的公司报告他们验证交易的客户或加密用户的活动。如果用户不是他们的客户，它还可以免除创建数字资产的开发人员监控其使用情况。该修正案是由俄勒冈州的民主党参议员 Ron Wyden 和怀俄明州的共和党参议员 Cynthia Lummis 和宾夕法尼亚州的 Pat Toomey 提出的。怀登在一份声明中表示，“投资者未能通过加密货币缴纳税款是一个真正的问题”，但之前制定的法律过于宽泛，将适用于无法履行其职责的参与者。 “数字资产将继续存在，”Lummis 在发布的新闻稿中说。 “虽然需要做更多的工作，但这项修正案是朝着将数字资产完全纳入美国金融业迈出的负责任的一步。”\nPolitico 援引联合税收委员会的一份报告称，这些变化将导致该法案筹集的资金比最初立法设想的 280 亿美元少 52 亿美元。该报告还表示，白宫正在反对拟议的修改，援引一位不愿透露姓名的政府官员的话说，该行业正在使用“恐吓策略”来淡化拟议法律的影响。 Beacon Policy Advisors 的分析师表示，预计该修正案将在未来几天内得到考虑，可能会在下周初对整个方案进行投票。 “今天民主党多数派将考虑更多修正案，然后希望我们能很快完成这项法案，”纽约民主党参议院多数党领袖查克舒默周四在发言中说。周四上午加密资产交易涨跌互现，比特币 BTCUSD，-2.24% 下跌约 1.9%，以太币 ETHUSD，+2.02% 上涨约 3%。", "note_en": "Supporters of the crypto industry in the U.S. Senate filed an amendment to the bipartisan infrastructure bill to make clear that miners and providers of crypto services would not be required to follow new tax-reporting rules on crypto brokers.\n  The amendment would “clarify that ‘brokers’ mean only those persons who conduct transactions on exchanges where consumers buy, sell and trade digital assets,” according to a press release.\n  That means that the IRS will not be able to require that miners, stakers and companies that sell hardware or software for storing digital assets report the activities of their customers or crypto users whose transactions they verify.\n  It also exempts developers who create digital assets from monitoring their use if the users are not their customers.\n  The amendment was introduced by Democratic Sen. Ron Wyden of Oregon and Republican Sens. Cynthia Lummis of Wyoming and Pat Toomey of Pennsylvania.\n    In a statement, Wyden said that “investors failing to pay tax they owe through cryptocurrency is a real problem,” but that the law as previously written was too broad and would have applied to actors who would not have been able to fulfill its mandates.\n  “Digital assets are here to stay,” Lummis said in the press released. “While much more work needs to be done, this amendment is a responsible step toward fully incorporating digital assets into the U.S. financial sector.”\n  The changes will lead to the bill raising $5.2 billion less than the $28 billion envisaged by the initial legislation, according to a Politico report citing the Joint Committee on Taxation.\n   The report also said that the White House  is pushing back against the proposed changes, citing an unnamed administration official who argued that the industry is using “scare tactics” to dilute the impact of the proposed law.\n  It is expected that the amendment will be considered in the coming days, with a vote on the entire package likely occurring early next week, according to analysts at Beacon Policy Advisors.\n  “The Democratic majority today will consider even more amendments, and then hopefully we can bring this bill to a close very shortly,” Senate Majority Leader Chuck Schumer, a New York Democrat, said in a floor speech Thursday.\n  Crypto assets were trading mixed Thursday morning, with bitcoin  BTCUSD,  -2.24% down about 1.9% and ether  ETHUSD,  +2.02% rising roughly 3%.", "posttime": "2021-08-05 23:49:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,比特币,采取行动,move,加密", "title": "参议员采取行动豁免比特币和加密矿工免受拟议的美国税收规则", "title_en": "Senators move to exempt Bitcoin, crypto miners from proposed U.S. tax rules", "transed": 1, "url": "https://www.marketwatch.com/story/senators-move-to-exempt-bitcoin-crypto-miners-from-proposed-u-s-tax-rules-11628102530", "via": "", "real_tags": ["美国", "比特币", "采取行动", "move", "加密"]}, {"category": "", "categoryclass": "", "imagename": "ae1baf1b5f5bab0e5771eed0b983bc42.jpg", "infoid": 1071539, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已经完全重新设计了我们的应用程序架构，以便在所有操作系统上为您带来整个套件的大量性能改进。现在可用，我们的 1.10 更新提供了非常流畅、更快的工作流程和非常出色的速度提升。我们为 Affinity 应用程序提供创意的性能感到自豪，但在过去几个月中，我们已经退后一步，真正了解可以进行哪些进一步改进。事实证明，我们能够实施一些具有巨大影响的重大优化，特别是在非常大的复杂文档上。 Affinity 1.10（您现在可以下载！）是我们有史以来最大的性能更新，并且改进被置于软件的核心位置，所有用户都将从中受益。因此，无论您是在 Mac、Windows PC 还是 iPad 上使用 Affinity，您都可以做得更多、更快。第一个重点领域是 Affinity Publisher 中的内存管理。这已经完全重写，现在可以支持巨大的文档——即使有数千页和数千兆字节的链接图像——提供即时加载时间、流畅的实时编辑和超快速滚动、平移和缩放整个文件.在 Affinity Designer 中，我们主要关注的领域是渲染引擎，并了解我们如何改进高度复杂文档的处​​理，可能包含数十万个对象或层。虽然用户创建具有如此多层的设计并不是常态，但我们看到许多示例将 PDF 导入到 Designer（例如在 CAD 应用程序或类似应用程序中生成）中包含大量对象，因此这是我们想占。不过，我们在这方面的辛勤工作确实得到了回报，现在 1.10 中的文档呈现速度比以前快十倍。虽然这种令人难以置信的改进在更复杂、海量的文档上尤其明显，但处理不太复杂的文档也非常顺畅和快速。 Affinity Photo 还进行了许多性能调整，最重要的是在将图层混合在一起的方式中增加了一些更高的效率。即使在构建高度复杂的合成后，这种新方法也提供了保持流畅性能的选项，同时保留了非破坏性的工作流程。\n除了这些基本的性能改进之外，Affinity Publisher 中的 IDML 导入速度提高了四倍，文本流速度几乎翻了一番，并且在 1.10 中对整个套件进行了大量其他调整和稳定性改进。与我们所有的更新一样，1.10 可供当前应用程序所有者免费下载。如果您还没有这些应用程序，您可以免费试用十天，亲自测试它们。", "note_en": "We’ve completely re-engineered the architecture of our apps to bring you some massive performance improvements across the suite, on all operating systems. Available now, our 1.10 update provides a remarkably smoother, faster workflow and pretty outstanding speed increases.\n  We pride ourselves on the performance Affinity apps offer creatives, but over the last few months we’ve taken a step back to really see what further improvements could be made. As it turns out, we were able to implement some major optimisations which have had a huge impact, particularly on very large complex documents.\n  Affinity 1.10 (which you can download now!) is our biggest performance update ever, and with the improvements being placed right at the heart of the software, it’s an update that all users will benefit from. So whether you’re using Affinity on Mac, Windows PC or iPad, you’ll be able to do more, faster.\n     The first area of focus has been memory management in Affinity Publisher. This has had a complete re-write, and now enables huge documents—even with thousands of pages and many gigabytes’ worth of linked images—to offer instant loading times, smooth live editing and super-fast scroll, pan and zoom across whole files.\n     In Affinity Designer, our main area of focus was the rendering engine and seeing how we could improve the handling of highly complex documents, potentially with hundreds of thousands of objects or layers. While it’s not the norm for users to create designs with so many layers, we were seeing many examples of PDFs being imported into Designer (generated in a CAD app or similar for example) with those high numbers of objects, and so this was something we wanted to account for.\n  Our hard work in this area has really paid off though, and documents are now rendering up to ten times faster in 1.10 than before. While this incredible improvement is particularly noticeable on more complex, massive documents, working with less complex documents is remarkably smoother and snappier as well.\n     Affinity Photo has also had many performance tweaks, most importantly in adding some greater efficiency in the way that layers are blended together. This new approach gives options to maintain slick performance even after building up highly complex compositions—all while retaining a non-destructive workflow.\n   On top of these fundamental performance improvements, IDML import in Affinity Publisher is up to four times faster, text flow speeds are nearly doubled, and there have been a whole host of other tweaks and stability improvements across the suite in 1.10.\n      As with all of our updates, 1.10 is free to download for current app owners. If you don’t own the apps yet, you can take out a free ten-day trial to test them out for yourself.", "posttime": "2021-08-05 23:49:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,affinity,performance,应用程序", "title": "Affinity 1.10：性能更新", "title_en": "Affinity 1.10: Performance update", "transed": 1, "url": "https://affinity.serif.com/en-us/latest-update/", "via": "", "real_tags": ["性能", "affinity", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "641d5e1ec420e08b5db135e78ed2c6c1.jpg", "infoid": 1071536, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN) 长颈鹿有着起重机般的脖子、纺锤形的腿和多节的膝盖，是最受喜爱和最知名的动物之一。然而，尽管它们的身材高大，长颈鹿却对它们令人惊讶的复杂社会行为保密。曾经被认为是只专注于喂养雄伟身体的卑微动物，1991 年的一本书将长颈鹿描述为“社交冷漠，与同伴没有形成持久的联系，并以最随意的方式交往。”但布里斯托大学周二发表在《哺乳动物评论》杂志上的新研究表明，长颈鹿被误解了，实际上是一种高度复杂的社会物种。 “对我来说最令人惊讶的是，直到 2021 年才认识到长颈鹿具有复杂的社会系统。我们已经知道其他社会复杂的哺乳动物物种，例如大象、灵长类动物和鲸类动物已经有几十年了，但令人困惑的是布里斯托尔大学生物科学学院的研究作者和生物学家佐伊穆勒说：“我不明白，像长颈鹿这样具有魅力且广为人知的物种，直到最近才得到如此充分的研究。”在他们对 404 篇论文的审查中，研究人员发现长颈鹿似乎有母系社会。研究发现，雌性长颈鹿与其他雌性长颈鹿及其后代保持着长期的关系。雌性和它们的小牛之间形成了紧密的联系，它们有时在托儿所中由其他雌性照顾。雌性长颈鹿在群体中的一只小牛死亡时表现出痛苦，即使它不是自己的。\n根据这项研究，自 2010 年以来，人们对动物的兴趣重新抬头，改变了科学家对它们的理解，数码相机和更好的跟踪技术使长颈鹿更容易研究。更好地了解长颈鹿的行为可能有助于确保它们的生存。根据这项研究，长颈鹿的数量自 1985 年以来下降了 40%，并被国际自然保护联盟列为易危动物。或许最重要的是，该研究还发现祖母假说——即一些动物在生育年龄后能存活很久以确保其孙辈茁壮成长——可能适用于长颈鹿。它只在少数物种中观察到——包括逆戟鲸、大象，当然还有人类。他们发现雌性长颈鹿一生中多达 30% 的时间都处于“生育后”状态。相比之下，大象花费 23% 的时间和逆戟鲸花费 35% 的时间在这个州度过。 “我的建议是，长颈鹿的‘祖母’可能在相关群体成员的生存中发挥着重要作用。祖母可能是群体的知识宝库，但在育儿和共同抚养幼崽方面也发挥着重要作用，”穆勒在一封电子邮件中说。她说，需要更多的研究来了解可以活近三十年的年长雌性长颈鹿在长颈鹿社会中扮演的角色，以及它可能为其后代的生存带来什么好处。仍有很多科学家不了解这些生物。例如，目前尚不清楚长颈鹿是如何交流的，雄性长颈鹿是否能活到生育年龄之外，群体生活会带来什么好处。\n“我希望这项研究能在沙子中划清界限，从这一点开始，长颈鹿将被视为聪明的群体生活哺乳动物，它们已经进化出了非常成功和复杂的社会，这促进了它们在艰难、充满捕食者的生态系统中的生存，”穆勒在一份声明中说。", "note_en": "(CNN)With their crane-like necks, spindle legs and knobbly knees, giraffes are among the best loved and most recognizable of animals.\n Despite their elevated stature, however, giraffes have kept their surprisingly intricate social behavior under wraps.\n Once perceived as humble creatures that focused solely on feeding their majestic bodies,  one book from 1991 described the giraffe as &#34;socially aloof, forming no lasting bonds with its fellows and associating in the most casual way.&#34;\n     But  new research from the University of Bristol, published Tuesday in the journal Mammal Review, suggests giraffes have been misunderstood and are in fact a highly complex and social species.\n    &#34;The most surprising thing for me is that it has taken until 2021 to recognize that giraffes have a complex social system. We have known for decades about other species of socially complex mammal, such as elephants, primates and cetaceans, but it is baffling to me how such a charismatic and well-known species as the giraffe could have been so understudied until recently,&#34; said Zoe Muller, study author and biologist at the University Of Bristol&#39;s School of Biological Sciences.\n  In their review of 404 papers, researchers found that giraffes appear to have a matrilineal society.\n Female giraffes maintain long-term relationships with other females and their own offspring, the study found. Close bonds form between females and their calves, who are sometimes cared for by other females in a kind of crèche. Female giraffes show distress when a calf in the group dies even if it&#39;s not their own.\n  Since 2010, according to the study, there had been a resurgence of interest in the animals that has changed how scientists understand them, with digital cameras and better tracking technology making giraffes easier to study.\n A better grasp of giraffe behavior may help efforts to ensure their survival. Giraffe numbers have declined by 40% since 1985, according to the study, and are listed as vulnerable by the  International Union for Conservation of Nature.\n   Perhaps most significantly, the study also found that the grandmother hypothesis -- the idea that some animals survive well beyond their reproductive years to ensure their grandchildren thrive -- may apply to giraffes. It&#39;s only been observed in a handful of species -- including orcas, elephants and of course, human beings.\n  They found that female giraffes spent up to 30% of their lives &#34;in a post-reproductive&#34; state. This compares with elephants, which spend 23%, and orcas, which spend 35% of their lives in this state.\n &#34;My suggestion is that giraffe &#39;grandmothers&#39; probably play an important role in the survival of related group members. Grandmothers are likely to be repositories of knowledge for the group, but also play an important role in childcare and co-rearing of young,&#34; said Muller in an email.\n She said that more research was needed to understand the role that older female giraffes, which can live for almost three decades, played in giraffe society and what benefits it may bring for the survival of their offspring.\n   There&#39;s still much scientists don&#39;t know about the creatures. For example, it&#39;s not clear how giraffes communicate, whether male giraffes live beyond their reproductive years and what benefits living in groups brings.\n &#34;I hope that this study draws a line in the sand, from which point forwards, giraffes will be regarded as intelligent, group-living mammals which have evolved highly successful and complex societies, which have facilitated their survival in tough, predator-filled ecosystems,&#34; Muller said in a statement.", "posttime": "2021-08-05 23:48:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "误解,misunderstood,长颈鹿", "title": "长颈鹿被误解，与大象一样具有社会复杂性", "title_en": "Giraffes have been misunderstood and are just as socially complex as elephants", "transed": 1, "url": "https://edition.cnn.com/2021/08/04/africa/giraffes-complex-behavior-scn/index.html", "via": "", "real_tags": ["误解", "长颈鹿"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071535, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "气候变化，全球气候变化，全球变暖，自然灾害，地球，环境，遥感，大气，陆地过程，海洋，火山，土地覆盖，地球科学数据，美国国家航空航天局，环境过程，蓝色大理石，全球地图", "note_en": "climate change, global climate change, global warming, natural hazards, Earth, environment, remote sensing, atmosphere, land processes, oceans, volcanoes, land cover, Earth science data, NASA, environmental processes, Blue Marble, global maps", "posttime": "2021-08-05 23:47:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国宇航局,nasa,美国,地球,earth", "title": "美国宇航局地球观测站", "title_en": "NASA Earth Observatory", "transed": 1, "url": "https://earthobservatory.nasa.gov/", "via": "", "real_tags": ["美国宇航局", "nasa", "美国", "地球", "earth"]}]