[{"category": "", "categoryclass": "", "imagename": "be4773cc336bca4f8bbabf1979b53c07.jpg", "infoid": 1028776, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify表示，新节目对艺术家的补偿仍将与歌曲正常流媒体的补偿相同，因为该格式与常规流媒体一样依赖于Spotify的音乐目录许可证。\n然而，这种体验将根据听众使用的Spotify服务级别进行定制。\nSpotify解释说，作为节目的一部分，付费订阅者将能够听到完整的曲目，而免费听众只能听到30秒的预览。\n听众还可以像在播放列表中那样与节目中的音乐内容交互-通过喜欢歌曲、保存曲目或查看有关曲目的更多信息，而不必离开剧集页面或进行搜索。要做到这一点，你可以点击节目的剧集页面上的“探索剧集”，或者点击屏幕底部的播放栏来拉出曲目列表。\n这种形式在某些方面类似于去年推出的潘多拉故事，也是音乐和播客的结合。但潘多拉的努力集中在允许艺术家在他们的音乐中添加叙事-比如谈论一首歌的意义或者是什么激发了他们的灵感。其他创作者也可以申请访问权限。\n与此同时，Spotify的新格式立即向支持地区的所有用户开放。\n从今天开始，Anchor应用程序将允许美国、英国、加拿大、澳大利亚、新西兰和爱尔兰的任何用户使用这种格式制作节目。\n这款应用的更新将允许用户选择一个新的“音乐”工具，然后将他们与超过6500万首曲目的整个Spotify音乐目录联系起来。用户还可以连接他们的Spotify账户，浏览并从自己的播放列表中选择歌曲添加到节目中。\n这是一个重大的更新，因为之前围绕流媒体版权的限制限制了播客创作者能够轻松地将授权音乐整合到他们的节目中。\n创作者还将通过主播赞助在他们的节目中插入广告。该公司指出，这一过程仍被认为是测试版，目前将使用这种格式手动审查节目。审查过程可能需要长达24小时。\n在发布时，Spotify还将推出自己的一套七个Spotify原创节目，将新格式付诸实施。这些节目可以在Spotify应用程序浏览部分的新“音乐秀”中心找到，也可以在你的主页选项卡的程序化货架上找到。\nHalleloo Happy Hour With DJ Shangela-抓起一杯酒，加入我们热情洋溢的主持人“Shangela”(明星诞生，Ru Paul‘s Drag Race)，为她的每周欢乐时光播放列表！以游戏、客人和茶为特色。哈利罗！\n谋杀歌谣-探索一些美国最神秘和最暴力的歌曲背后的历史和民俗。60首歌曲解释了90年代-90年代是音乐的转折点。请听“The Ringer”杰出的音乐评论家罗布·哈维拉(Rob Harvila)策划和探索60首来自90年代的标志性歌曲，这些歌曲定义了这个十年。\n我们的情歌-每周都有一对情侣分享定义他们爱情故事的配乐。作为一种文化，我们对爱情和浪漫着迷。这就是为什么大多数歌曲都是关于爱情和心碎的。这个节目不仅将探索有趣的爱情故事，还将探索定义这些关系的经典歌曲。\n阴谋论：音乐版-更深入地看一些围绕着著名艺术家和音乐产业的最迷人的理论，因为它影响着世界。\n与艾莉森·哈根多夫一起摇滚-与艾莉森·哈根多夫一起摇滚这是一个每周一次的节目，庆祝所有的东西摇滚和另类文化，以一种友好的采访为特色，并突出来自你最喜欢的和新兴艺术家的音乐。\n10首歌曲成就了我-一个艺术家或名人创建了一个10首歌曲的故事播放列表，这些歌曲标志着他们生活中有意义的时刻，为每一首歌的选择提供了个人见解。", "note_en": "Spotify says the new shows will still compensate the artist the same as if the track was streamed normally, as the format relies on Spotify’s music catalog licenses just like regular streams.\n However, the experience will be customized to listeners based on what tier of Spotify’s service they use.\n   Premium subscribers will be able to hear the full tracks as part of the shows, Spotify explains, while free listeners will only hear the 30-second previews.\n Listeners can also interact with the music content within the shows as they otherwise could in a playlist — by liking the songs, saving the track, or viewing more information about the track without having to leave the episode page or do a search. To do this, you’ll hit “Explore Episode” on the show’s episode page, or tap the play bar at the bottom of the screen to pull up the track list.\n  The format is similar in some ways to Pandora’s Stories, also a combination of music and podcasting,  introduced last year. But Pandora’s effort focused on allowing artists to add narratives to their music — like talking about the meaning of a song or what inspires them. Other creators could also  apply for access.\n Spotify’s new format, meanwhile, is immediately open to all users in supported regions.\n As of today, the Anchor app will now allow any user to create a show using this format in the U.S., U.K., Canada, Australia, New Zealand, and Ireland, to start.\n The app’s update will allow users to select a new “Music” tool, which then connects them with the entire Spotify music catalog of over 65 million tracks. Users will also be able to connect their Spotify account to browse and select songs from their own playlists to add to shows.\n This is a significant update, as limitations around streaming rights had previously limited podcast creators from being able to easily integrate licensed music in their programs.\n  Creators will also be about to insert ads in their shows, via  Anchor Sponsorships. The company notes that this process is still considered a beta, and it will be manually reviewing shows using the format for now. The review process can take up to 24 hours.\n  At launch, Spotify is also launching its own set of seven Spotify Original Shows that put the new format to work, which can be found in the new “Shows With Music” hub in the Browse section of the Spotify app or in a programmed shelf in your Home tab.\n  Halleloo Happy Hour with DJ Shangela – Grab a drink and join our effervescent host, “Shangela” (A Star is Born, Ru Paul’s Drag Race), for her weekly happy hour playlist! Featuring games, guests, and tea. Halleloo!\n Murder Ballads – Explore the history and folklore behind some of America’s most mysterious and violent songs.  60 Songs That Explain the 90s – The 1990s were a turning point in music. Listen along as The Ringer’s preeminent music critic Rob Harvilla curates and explores 60 iconic songs from the ‘90s that define the decade.\n Our Love Song – Every week a couple shares the soundtrack that defines their love story. As a culture we are fascinated by love and romance. It is why the majority of songs are about love and heartbreak. This show will not only explore entertaining love stories, but also the classic songs that define these relationships.\n Conspiracy Theories: Music Edition – A deeper look at some of the most fascinating theories surrounding famous artists and the music industry as it affects the world.\n Rock This with Allison Hagendorf – Rock This with Allison Hagendorf is a weekly show celebrating all things Rock &amp; Alternative culture, featuring one of a kind interviews and highlighting music from your favorite and emerging artists.\n 10 Songs That Made Me – An artist or celebrity creates a storytelling playlist of 10 songs that mark meaningful moments in their lives, providing personal insights into each song choice.", "posttime": "2020-10-14 23:02:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "口语,introduces,音乐", "title": "\nSpotify推出了一种新的音乐和口语单词格式，对所有创作者开放", "title_en": "\n\t\t\t\tSpotify introduces a new music-and-spoken word format, open to all creators\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/spotify-introduces-a-new-music-and-spoken-word-format-open-to-all-creators/", "via": "", "real_tags": ["口语", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "9b2f98d62c542feef07de1dc2b9362b6.jpg", "infoid": 1028775, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OnZoom允许主持人运行一次性活动或活动系列，最多可有100或1000人参加(取决于他们的许可证)，并为他们销售门票。这里的想法是任何人-无论是瑜伽老师、非营利组织者还是专业活动组织者-都可以在OnZoom市场上列出并销售门票。目前，Zoom接受贝宝(PayPal)和信用卡支付，该团队表示，未来可能会研究其他支付方式。对于非营利性组织，Zoom还通过与Pledgling的合作伙伴关系，整合了通过活动接受捐款的能力。\n根据团队在今天宣布之前分享的演示，对于主持人和观众来说，这都是一个相当直截了当的体验。\n对于日常的Zoom用户来说，Zapps的发布(是的-我也不喜欢这个名字)可能是更有趣的宣布。这里的想法是将应用程序直接集成到Zoom体验中，这样用户就不必在桌面上的多个应用程序之间来回切换。\n该公司写道：“Zapps可以帮助你展示所有你需要的应用程序，让你在会议之前、期间和之后都能在团队之间自由地交流信息。”“在你最需要的地方，可以把Zapps想象成一个应用商店--在Zoom会议、聊天、网络研讨会、电话，甚至是你的联系人目录中。”\n这些应用程序可以作为屏幕共享启动，但更重要的是，您可以将它们发送给所有参与者进行实时协作。\n35个发射合作伙伴包括Asana、Atlassian、Dropbox、HubSpot、Slake、SurveyMonkey、Wrike和Zendesk等公司。", "note_en": "OnZoom allows hosts to run one-time events or event series with up 100 or 1,000 attendees (depending on their license) and sell tickets for them. The idea here is for anybody — whether a yoga teacher, nonprofit or a professional event organizer — to list and sell tickets on the OnZoom marketplace. Right now, Zoom accepts PayPal and credit card payments, with the team saying that it may look into other payment options in the future. For non-profits, Zoom is also integrating the ability to receive donations through events through its partnership with  Pledgeling.\n  Based on the demo the team shared ahead of today’s announcement, it’s a pretty straightforward experience for both hosts and viewers.\n  For the day-to-day Zoom user, the launch of Zapps (yeah – I don’t love that name either) is probably the more interesting announcement. The idea here is to integrate apps directly into the Zoom experience so that users don’t have to switch back and forth between multiple applications on their desktops.\n “Zapps help surface all the applications you need to be productive and enable the free flow of information between teams before, during, and after the meeting,” the company writes. “Think of Zapps as an app store right where you need it most — in a Zoom meeting, chat, webinar, phone call, and even your contacts directory.”\n These apps can be launched as screen shares, but more importantly, you can send them to all participants for real-time collaboration.\n The 35 launch partners include the likes of Asana, Atlassian, Dropbox, Hubspot, Slack, SurveyMonkey, Wrike and Zendesk.", "posttime": "2020-10-14 23:02:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,推出,launches,zoom", "title": "\nZoom推出其活动平台和市场，为您的通话带来应用程序", "title_en": "\n\t\t\t\tZoom launches its events platform and marketplace, brings apps to your calls\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/zoom-launches-its-events-platform-and-marketplace-brings-apps-to-your-calls/", "via": "", "real_tags": ["程序", "推出", "launches", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "6079acb45e9dad19c6b9462c66e6cd2d.jpg", "infoid": 1028774, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "保守派最高法院法官克拉伦斯·托马斯(Clarence Thomas)周二写道，这项长期存在但现在备受争议的法律，旨在防止在线平台对用户发布的内容承担责任，这项法律应该缩小范围。\n重要原因：“通信体面法案”第230条日益成为两党愤怒的目标。托马斯可以说是最高法院最保守的成员，他正在奠定一个标志，因为艾米·科尼·巴雷特(Amy Coney Barrett)的可能确认似乎将使高等法院进一步右倾。\n推动新闻：托马斯在一份文件中写道，在法院决定不审理与第230条相关的案件MalwareBytes Inc.之后，托马斯在一份文件中写道了第230条。五、英格玛软件集团。\n托马斯说，他的其他大法官们驳回此案是正确的，该案的核心是互联网安全公司MalwareBytes是否可以为Enigma Software所说的将其产品错误地指定为恶意软件承担责任。\n但他表示，它应该欢迎通过另一个案件从法官席上缩减第230条的机会。\n托马斯写道，他的话：将第230条的豁免权扩大到超出文本自然解读的范围可能会产生严重的后果，并补充说，当正确的案件来到法院时，大法官理应考虑缩小对法律的解读范围。\n托马斯写道，互联网公司已被授予全面保护，法院对第230条的豁免权比预期的更全面。\n另一方面：互联网公司和该法律的作者长期以来一直辩称，第230条的目的是允许公司在他们认为合适的情况下对在线内容进行审查并删除内容--如果没有法律，Facebook、谷歌、Twitter和Yelp等公司就不能以目前的形式存在。\n包括唐纳德·特朗普(Donald Trump)总统在内的共和党人现在辩称，这项法律是科技平台审查保守派观点的许可证。(这些平台否认了这些反保守主义偏见的说法，几乎没有证据证明这一点。)。\n包括乔·拜登(Joe Biden)在内的民主党人表示，国会应该重新审议第230条，让科技公司对错误信息和仇恨言论承担更多责任。\n现实核查：在过去的一年里，国会传阅了一些与第230条相关的法案。在2021年之前，没有一个能经受住过去的改变。", "note_en": "The long-standing but now hotly contested law that keeps online platforms from being held liable for what users post should be narrowed, conservative Supreme Court Justice Clarence Thomas wrote Tuesday.\n Why it matters: Section 230 of the Communications Decency Act is a growing target of bipartisan ire. Thomas, arguably the most conservative member of the Supreme Court, is laying down a marker as the likely confirmation of Amy Coney Barrett looks set to tip the high court further right.\n Driving the news: Thomas  wrote about Section 230 in a filing following the court&#39;s decision not to hear a Section 230-related case, MalwareBytes Inc. v. Enigma Software Group.\n Thomas said his fellow justices were right to pass on the case, which centered on whether MalwareBytes, an internet security company, could be held liable for what Enigma Software said was a wrongful designation of its products as malware.\n But he said it should welcome the chance to scale back Section 230 from the bench through a different case.\n What he&#39;s saying: &#34;Extending §230 immunity beyond the natural reading of the text can have serious consequences,&#34; Thomas wrote, adding that when the right case comes to the court, it would &#34;behoove&#34; the justices to consider a narrower reading of the law.\n Thomas wrote that internet companies have been granted &#34;sweeping protection&#34; and that courts are reading more comprehensive immunity into Section 230 than was intended.\n The other side: Internet companies and the law&#39;s authors have long argued that the purpose of Section 230 was to allow companies to moderate online content and remove material as they see fit — and that companies like Facebook, Google, Twitter and Yelp couldn&#39;t exist in their current form without the law.\n  Republicans including President Donald Trump now argue the law acts as a license for tech platforms to censor conservative views. (There&#39;s little to no evidence for these claims of anti-conservative bias, which the platforms deny.)\n Democrats including Joe Biden have said Congress should revisit Section 230 to make tech firms more accountable for misinformation and hate speech.\n Reality check: A number of Section 230-related bills have circulated in Congress in the past year. None stand a change of passing before 2021.", "posttime": "2020-10-14 23:01:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "保护,arguing", "title": "SCOTUS法官克拉伦斯·托马斯(Clarence Thomas)表示对缩减第230条的保护持开放态度，辩称对平台的“全面保护”曲解了法律", "title_en": "SCOTUS Justice Clarence Thomas signals an openness to scaling back Section 230 protections, arguing “sweeping protection” for platforms misinterprets the law", "transed": 1, "url": "https://www.axios.com/clarence-thomas-wants-to-reel-in-section-230-fad81180-1f50-48a6-b638-f9386221f4f2.html", "via": "", "real_tags": ["保护", "arguing"]}, {"category": "", "categoryclass": "", "imagename": "e117452c52f7f4e3fa4bd426f590cf07.jpg", "infoid": 1028773, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自美国和欧洲的数据显示，大规模监控无助于阻止恐怖袭击。然而，当局仍然依赖面部识别和位置跟踪等监控技术。相反，我们必须把重点放在我们的人权上，保护让权力留在人民手中的重要东西：我们的隐私权和言论自由。\n美国国家安全局的电话监控计划从2008年到2019年一直作为PRISM的一部分在美国实施。它特别授权情报机构在一方不在美国的情况下监控美国公民的电话、电子邮件和其他通讯，最长可达一周，而无需获得搜查令。\n据“纽约时报”报道，到目前为止，美国国家安全局的电话监控计划已经花费了美国纳税人超过1亿美元，但它并没有阻止一次恐怖袭击。\n该计划于2019年底不复存在，不再存在。在美国、德国和大多数民主国家，未经授权监视公民是违宪的。\n尽管如此，PRISM已经存在了十多年，在此期间，美国公民在他们不知情的情况下受到特勤局的监视。美国国家安全局辩称，它需要这种信息来阻止恐怖袭击，保护美国人民的安全。\n然而，从2020年9月开始，一名法官裁定，在美国国家安全局的电话监控计划的帮助下，没有一起恐怖袭击被阻止。这项裁决是关于隐私和公民自由监督委员会的一项研究发现的唯一一起案件，即美国国家安全局根据电话监控提供了针对恐怖分子的成功证据。\n裁决的结论是，(非法)电话监控产生的证据不是定罪罪犯所必需的，也没有提供当局已经知道的任何进一步的信息。\n对欧洲恐怖袭击的类似调查得出了同样的结论：2014年至2017年，欧洲发生了13起伊斯兰恐怖袭击事件，之后24名罪犯被判有罪。所有24人--百分之百--在袭击发生前就已为当局所知，并已被归类为暴力事件。\n从这次调查得出的结论是，我们不需要更多的监视来实现更好的安全。我们需要的是训练有素、装备更好的警察，以便他们能够更快地识别潜在的威胁。\n虽然投资于大规模监控工具似乎容易得多，但所有数据都表明，如果每个人都受到监控，那么任何人都不会受益。\n从美国和欧洲的例子中可以清楚地看出，我们必须结束大规模监控。它既不是打击犯罪的适当工具，更不用说预测犯罪了，也不可能使其符合宪法。\n政客们不应该呼吁更多的监控，而应该把重点放在保护公民的人权上，就像我们的隐私权和言论自由权一样。\n当未经授权的大规模监视到位时，这些人权就会受到严重损害。在最糟糕的形式下，在面部识别和位置跟踪的帮助下，它可能会导致社会不再自由地公开讨论意见，而不再害怕。\n随着新的和更好的监控技术的出现，我们维护我们的民主价值观，确保我们的人权也得到尊重，特别是得到当局的尊重变得越来越重要。为此，我们还需要没有后门的强大加密。\n归根结底，这一切只有一个简单的选择：我们是想把所有的权力都交给当局，还是希望所有的权力都留在人民手中？", "note_en": "Data from the USA and Europe show that mass surveillance does not help to stop terrorist attacks. Yet, theauthorities continue to rely on surveillance technology like facial recognition and location tracking. Instead we mustfocus on our human rights and protect what is important to keep the power with the people: Our right to privacy andfreedom of speech.\n The NSA phone surveillance program has been in place as part of  PRISMfrom 2008 to 2019 in the USA. It&#34;specifically authorizes intelligence agencies to monitor the phone, email, and other communications of U.S.citizens for up to a week without obtaining a warrant&#34; when one of the parties is outside the U.S.\n The NSA phone surveillance program to date has cost American tax payers over $100 Million, according to the New York Times.Yet, it did not prevent one single terrorist attack.\n The program ceased to exist end of 2019 and is no longer in place. Warrantless surveillance of citizens is  unconstitutional -in the USA, in Germany as well as in most democratic countries.\n  Nevertheless, PRISM was in place more than a decade, and during this time American citizens were monitoredby the secret services without their knowledge. The NSA argued that it needed this kind of information to stopterrorist attacks and keep American people safe.\n However, a judge  ruledbeginning of September 2020 that not [one single terrorist attack had been stopped with the help of theNSA&#39;s phone surveillance program.The ruling was about the one and only case that a study by the Privacy and Civil Liberties Oversight Boardfound where the NSA produced successful evidence against terrorists based on phone surveillance.\n The ruling concluded that the evidence produced from the (illegal) phone surveillance was not necessary to convict thecriminal and did not bring any further information forward than what was already known to the authorities.\n  A similar investigation of  terrorist attacks in Europe came to the same conclusion:Between 2014 and 2017, 13 Islamist terrorist attacks took place in Europe after which 24 offenderswere convicted. All 24 of them - one hundred per cent -were already known to the authorities prior to the attack and had been classified as violent.\n The conclusion from this investigation is that we do not need more surveillance to achieve better security. What we do needis better trained and better equipped police officers so that they can identify potential threats faster.\n While investing in mass surveillance tools seems a lot easier, all data shows that no one benefits ifeveryone is monitored.\n  What comes clear from the examples in the USA and in Europe is that we must end mass surveillance. It is neither anadequate tool to fight - let alone predict - crime, nor is it possible to bring it in-line with the constitution.\n Instead of calling for more surveillance, politicians should focus on protecting citizens&#39; human rights, like our rightto privacy and our right to freedom of speech.\n These human rights are severely damaged when warrantless mass surveillance is in place. In its worst form - and with the helpof  facial recognition and  location tracking - it might lead to asociety no longer free to discuss opinions openly and without fear.\n As new and better surveillance technologies arise, it becomes more and more important that we uphold our democraticvalues and make sure that our human rights are respected, also, and particularly, by the authorities.For this, we also need strong  encryption without backdoors.\n In the end, it all comes down to a simple choice: Do we want to give all power to the authorities, or do we want that all powerremains with the people?", "posttime": "2020-10-14 22:58:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,美国国家安全局,nsa", "title": "棱镜-美国国家安全局的监视计划没有阻止一次恐怖袭击", "title_en": "PRISM – NSA surveillance program did not prevent a single terrorist attack", "transed": 1, "url": "https://tutanota.com/blog/posts/nsa-phone-surveillance-illegal-expensive/", "via": "", "real_tags": ["美国", "美国国家安全局", "nsa"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028772, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很久很久以前，这个星球被一条巨龙专制。这条龙比最大的大教堂还高，上面覆盖着厚厚的黑色鳞片。它红色的眼睛里闪烁着仇恨的光芒，从它可怕的嘴巴里源源不断地流出一股恶臭的黄绿色黏液。它向人类要求一个令人毛骨悚然的贡品：为了满足它巨大的胃口，每天傍晚必须在天黑时将一万名男男女女送到龙霸居住的山脚下。有时龙会在到达时吞噬这些不幸的灵魂，有时又会把他们锁在山里，在那里他们会枯萎几个月或几年，最后才会被吃掉。\n龙霸造成的苦难是无法估量的。除了每天惨遭屠杀的一万人外，还有留下来悼念逝去亲人的母亲、父亲、妻子、丈夫、孩子和朋友。\n有些人试图与龙搏斗，但很难说他们是勇敢还是愚蠢。牧师和魔术师下咒，但都无济于事。勇士们装备着咆哮的勇气和铁匠们所能制造的最好的武器，攻击了它，但在接近到足以发动攻击之前，他们被它的火烧成了灰烬。化学家炮制了有毒的啤酒，骗龙吞下了它们，但唯一明显的效果是进一步刺激了它的食欲。龙的爪子、下巴和火是如此有效，它的鳞甲是如此坚不可摧，它的整个本性是如此健壮，以至于它不会受到任何人类的攻击。\n看到击败暴君是不可能的，人类别无选择，只能服从它的命令，向可怕的贡品致敬。选定的死亡者总是长辈。虽然老年人和年轻人一样精力充沛，身体健康，有时甚至更聪明，但人们的想法是，他们至少已经享受了几十年的生活。富人可能会通过贿赂前来带走他们的媒体团伙而获得短暂的缓刑；但是，根据宪法法律，没有人，甚至包括国王本人，都不能无限期地推迟他们的行动。\n灵性人试图安慰那些害怕被龙吃掉的人(包括几乎所有人，尽管许多人公开否认这一点)，承诺死后重生，一种不受龙灾的生活。其他演说家争辩说，龙在自然秩序中有它的位置，也有道德上的权利被喂养。他们说，在龙的肚子里结束是作为人的意义的一部分。其他人仍然坚持认为龙对人类物种有好处，因为它保持了较低的人口规模。这些论点在多大程度上说服了这些忧心忡忡的人还不得而知。大多数人试图通过不去想等待着他们的可怕结局来应对。\n几个世纪以来，这种绝望的状况一直持续着。没有人再计算累计的死亡人数，也没有人再计算失去亲人流下的泪水。人们的期望逐渐调整，龙霸已经成为生活的现实。鉴于抵抗显然是徒劳的，杀死龙的尝试已经停止。相反，现在的努力集中在安抚它。虽然龙偶尔会袭击城市，但人们发现，准时将其生命配额送到山上，减少了这些入侵的频率。\n人们知道，轮到他们成为龙饲料的时刻迫在眉睫，所以开始更早、更频繁地生孩子。女孩在16岁生日前怀孕并不少见。夫妻通常会生下十几个孩子。这样，人口就不会减少，龙也就不会挨饿。\n在这几个世纪的过程中，龙得到了很好的喂养，慢慢地但稳步地长得更大。它已经变得几乎和它居住的那座山一样大了。而且它的胃口也成比例地增加了。一万具人体不再足以填饱它的肚子。现在它需要8万英镑，每天傍晚天黑时送到山脚下。\n比起死亡和龙本身，更让国王头疼的是每天聚集和运送这么多人上山的后勤工作。这不是一件容易的事。\n为了方便这一过程，国王修建了一条铁轨：两条闪闪发光的钢制直线通向龙的住所。每隔20分钟，就会有一列火车到达挤满了人的山区终点站，然后空空如也地返回。在月夜，乘坐这列火车的乘客，如果有窗户可以探出头来，就能看到前面龙和山的双重剪影，以及两只发光的红眼睛，就像一对巨大灯塔的光束，指明了走向毁灭的方向。在月夜里，乘客们可以看到龙和山的双重剪影，以及两只发光的红眼睛，就像一对巨大的灯塔的光束一样，指明了走向毁灭的方向。\n国王雇用了大批仆人来管理贡品。有登记员记录该轮到谁寄了。会有收集员坐着专车去接指定的人。他们经常以极快的速度旅行，他们会把货物匆忙送到火车站或直接送到山上。有办事员负责管理支付给不再能够养活自己的遇难家庭的养老金。有一些安慰者会与命中注定的人一起前往龙的路上，试图用精神和药物来缓解他们的痛苦。\n此外，还有一批龙类学家研究如何使这些后勤流程更有效率。一些龙类学家还对龙的生理和行为进行了研究，并收集了样本-它的脱落鳞片，从它的下巴流口水的黏液，它脱落的牙齿，以及它的排泄物，这些都是点缀着人骨碎片的。所有这些物品都经过了精心的注释和归档。人们对野兽的了解越多，人们对它不可战胜的普遍看法就越能得到证实。特别是它的黑色鳞片比人类已知的任何物质都要坚硬，而且似乎没有办法在它的盔甲上留下像划痕一样多的东西。\n为了资助所有这些活动，国王向他的人民征收重税。与龙有关的支出已经占到经济的七分之一，比龙本身增长得更快。\n人类是一个好奇的物种。每隔一段时间，总会有人想出一个好主意。其他人则效仿这个想法，在上面加上他们自己的改进。随着时间的推移，开发出了许多奇妙的工具和系统。其中一些设备-计算器、温度计、显微镜，以及化学家用来煮沸和蒸馏液体的玻璃瓶-使产生和尝试新想法变得更容易，包括加快想法产生过程的想法。\n因此，发明的巨轮，在较老的时代以几乎察觉不到的缓慢速度转动，逐渐开始加速。\n先贤们预测，有一天科技将使人类能够飞行，并做许多其他令人惊叹的事情。其中一位圣人受到其他一些圣人的高度尊敬，但他的古怪举止使他成为社会上的弃儿和隐士，他甚至预测，技术最终将使制造一种可以杀死龙霸的装置成为可能。\n然而，国王的学者们对这些想法不屑一顾。他们说，人类太重了，不能飞行，而且无论如何都没有羽毛。至于龙霸可以被杀死这一不可能的想法，历史书记录了数百次这样做的尝试，但没有一次成功。“我们都知道，这个人有一些不负责任的想法，”一位研究文学的学者后来在讣告中写道，这位隐居的圣人当时已被送往被他预言的野兽吞噬，“但他的作品相当有趣，也许我们应该感谢龙，因为它让击龙文学成为可能，揭示了这么多关于焦虑文化的有趣流派！”\n与此同时，发明的车轮还在不停地转动。短短几十年后，人类真的飞了起来，并完成了许多其他令人惊叹的事情。\n一些打破传统的龙学家开始争论对龙霸进行新的攻击。他们说，杀死龙并不容易，但如果能发明出比龙的盔甲更坚硬的材料，如果这种材料能被制成某种抛射物，那么这一壮举或许就有可能实现。起初，打破偶像的人的想法被他们的龙类学家同行拒绝，理由是没有已知的材料比龙鳞更硬。但在研究这个问题多年后，其中一位打破偶像的人成功地证明了龙鳞可以被某种复合材料制成的物体刺穿。许多以前持怀疑态度的龙类学家现在加入了破坏偶像的行列。工程师们计算出，这种材料可以制造出一枚巨大的炮弹，并以足够的力量穿透龙的盔甲。然而，制造所需数量的复合材料将是昂贵的。\n一群著名的工程师和龙学家向国王递交了一份请愿书，要求提供资金建造反龙弹丸。当请愿书发出时，国王正全神贯注地带领他的军队与老虎开战。老虎杀死了一位农夫，随后消失在丛林中。在乡下，人们普遍担心老虎可能会出来再次袭击。国王包围了丛林，命令他的军队开始在丛林中砍出一条路来。在战役结束时，国王可以宣布，丛林中的所有163只老虎，大概包括那只杀人的老虎，都已被猎杀。然而，在战乱期间，请愿书丢失或被遗忘了。\n因此，请愿人再次提出上诉。这一次，他们收到了国王的一位秘书的回复，说国王将在完成对龙政年度预算的审查后考虑他们的请求。今年的预算是迄今为止最大的，其中包括修建一条通往山区的新铁轨的资金。第二条轨道被认为是必要的，因为原来的轨道已经不能支持不断增加的交通。(龙霸要求的贡品增加到十万人，每天傍晚天黑时送到山脚下。)。然而，当预算最终获得批准时，来自该国偏远地区的报告称，一个村庄正遭受响尾蛇侵扰。国王不得不紧急离开，动员他的军队，骑马去击败这个新的威胁。反龙派的上诉被归档到城堡地下室的一个满是灰尘的橱柜里。\n反龙派再次开会，决定要做什么。辩论活跃起来，一直持续到深夜。当他们最终决定把这件事带给人们时，几乎是天亮了。在接下来的几周里，他们在全国各地旅行，做公开演讲，并向任何愿意听的人解释他们的建议。起初，人们对此持怀疑态度。他们在学校里被教导，龙霸是不可战胜的，它所要求的牺牲必须被接受为生活的现实。然而，当他们了解到这种新的复合材料和弹丸的设计时，许多人变得很感兴趣。越来越多的市民成群结队地去听反龙论者的讲座。活动人士开始组织公众集会，支持这项提议。\n当国王在报纸上读到这些会议时，他召见了他的谋士，问他们对此有何看法。他们告诉他已经发出的请愿书，但告诉他反龙派是麻烦制造者，他们的教义正在引起公众的动荡。他们说，人民接受龙霸进贡的必然性，对社会秩序好得多。龙政府提供了许多工作机会，如果龙被宰杀了，这些工作就会失去。征服巨龙并没有带来任何已知的社会公益。无论如何，国王的金库目前几乎空空如也\n国王欢迎了每一个人之后，他请反龙主义提案背后的首席科学家发言，这位妇女脸上有一种严肃的、几乎是严肃的表情。她接着用清晰的语言解释了拟议的装置将如何工作，以及如何制造所需数量的复合材料。考虑到所要求的资金数额，这项工作应该可以在15到20年内完成。有了更多的资金，在短短12年内就有可能做到这一点。然而，不能绝对保证它会奏效。人群聚精会神地听着她的演讲。\n下一位发言的是国王的首席道德顾问，他的嗓音洪亮，轻而易举地填满了礼堂：\n“让我们承认这位女士关于科学的看法是正确的，这个项目在技术上是可能的，尽管我认为这一点实际上还没有得到证实。现在她希望我们除掉龙。想必，她认为自己有权利不被龙咬伤。多么任性和专横。人生的有限性是每个人的福气，不管他知不知道。除掉龙，这看起来似乎是一件非常方便的事情，却会损害我们人类的尊严。对杀龙的全神贯注会让我们更充分地实现我们生命中自然指向的愿望，不再是活得好好的，而不仅仅是活着。对于一个人来说，想要尽可能长时间地继续他或她平庸的生活，而不担心一些更高层次的问题，比如生命是用来做什么的，这是贬低，是的，贬低。但我告诉你，龙的本性是吃人，我们自己的物种特有的本性只有被它吃掉才能真正而高尚地实现……“。\n听众恭敬地听着这位备受赞誉的演讲者讲话。这些词句是如此雄辩，以至于很难抗拒这样一种感觉，即它们背后一定潜藏着一些深刻的思想，尽管没有人能完全理解它们是什么。当然，国王如此尊贵的任命所说的话一定有深刻的内容。\n紧随其后的演讲者是一位精神上的圣人，他因善良、温柔和虔诚而广受尊敬。当他大步走上讲台时，一个小男孩从观众席上喊道：“龙坏了！”\n男孩的父母脸涨得通红，开始安安静静地训斥孩子。但是圣人说：“让这个男孩说话吧。他大概比我这样的老傻瓜还聪明。“。\n起初，这个男孩又害怕又困惑，动弹不得。但当他看到圣人脸上真诚友好的微笑和伸出的手时，他乖乖地接过手，跟着圣人走上讲台。“现在，有一个勇敢的小人，”圣人说。“你怕龙吗？”\n“是的，”男孩说，他惊恐的大眼睛里涌出了泪水。“奶奶答应要教我如何在圣诞节烘焙姜饼饼干。她说我们要用姜饼和小姜饼人建造一座小房子，住在里面。然后，那些穿着白衣的人来了，把奶奶带到了龙…那里。龙是坏的，它吃人…。我要我奶奶回来！“\n说到这里，孩子哭得很厉害，圣人不得不把他送回父母身边。\n当晚还有其他几位发言者，但这个孩子简单的证词刺破了国王的大臣们试图夸大的言辞气球。人民支持反龙派，到晚上结束时，就连国王也开始认识到他们事业的理由和人性。在他的结案陈词中，他简单地说：“我们开始吧！”\n随着消息的传播，街头爆发了庆祝活动。那些一直在为反龙运动奔走的人互相举杯，为人类的未来干杯。\n第二天早上，十亿人醒来，意识到在射弹完成之前，轮到他们被送到龙那里去了。达到了一个临界点。以前，积极支持反龙运动只限于一小撮有远见的人，现在它成了每个人心目中的头等大事和最关心的问题。“公意”这个抽象的概念具有几乎有形的强度和具体性。群众集会为炮弹项目筹集了资金，并敦促国王增加国家支持的水平。国王对这些呼吁作出了回应。在新年致辞中，他宣布将通过一项额外拨款法案，以高额资金支持这一项目；此外，他还将出售自己的避暑城堡和部分土地，并进行大笔个人捐赠。我认为，这个国家应该致力于在本十年结束前实现将世界从古老的龙霸祸害中解放出来的目标。\n于是开始了一场与时间的伟大技术竞赛。反龙弹的概念很简单，但要使其成为现实，需要解决一千个较小的技术问题，每个问题都需要几十个耗时的步骤和失误。试射了导弹，但落在地上死了，或者飞向了错误的方向。在一次悲惨的事故中，一枚任性的导弹落在一家医院，导致数百名患者和工作人员死亡。但现在有了一个真正严肃的目标，即使在身体被从废墟中挖掘出来的时候，测试仍在继续。\n尽管技术人员几乎没有限制的资金和日以继夜的工作，国王的最后期限还是无法完成。十年过去了，龙仍然活得好好的。但努力正在变得越来越近。一枚原型导弹已经成功试射。核心的生产，由昂贵的复合材料制成，按计划完成，以配合其装载到的经过全面测试和调试的导弹外壳的完工。启动日期定在第二年的除夕，恰好是该项目正式落成12年后。那一年最畅销的圣诞礼物是一本日历，上面有倒计时的日子，时间为零，收益将捐给弹丸项目。\n国王已经经历了一次个人的转变，改变了他早先轻率和轻率的自我。现在，他尽可能多地呆在实验室和制造厂里，鼓励工人，赞扬他们的辛勤劳动。有时他会带上睡袋，在嘈杂的机器地板上过夜。他甚至研究并试图理解他们工作的技术方面。然而，他只给自己精神上的支持，而不管闲事。\n.", "note_en": "Once upon a time, the planet was tyrannized by a giant dragon. The dragon stood taller than the largest cathedral, and it was covered with thick black scales. Its red eyes glowed with hate, and from its terrible jaws flowed an incessant stream of evil-smelling yellowish-green slime. It demanded from humankind a blood-curdling tribute: to satisfy its enormous appetite, ten thousand men and women had to be delivered every evening at the onset of dark to the foot of the mountain where the dragon-tyrant lived. Sometimes the dragon would devour these unfortunate souls upon arrival; sometimes again it would lock them up in the mountain where they would wither away for months or years before eventually being consumed.\n  The misery inflicted by the dragon-tyrant was incalculable. In addition to the ten thousand who were gruesomely slaughtered each day, there were the mothers, fathers, wives, husbands, children, and friends that were left behind to grieve the loss of their departed loved ones.\n  Some people tried to fight the dragon, but whether they were brave or foolish was difficult to say. Priests and magicians called down curses, to no avail. Warriors, armed with roaring courage and the best weapons the smiths could produce, attacked it, but were incinerated by its fire before coming close enough to strike. Chemists concocted toxic brews and tricked the dragon into swallowing them, but the only apparent effect was to further stimulate its appetite. The dragon’s claws, jaws, and fire were so effective, its scaly armor so impregnable, and its whole nature so robust, as to make it invincible to any human assault.\n  Seeing that defeating the tyrant was impossible, humans had no choice but to obey its commands and pay the grisly tribute. The fatalities selected were always elders. Although senior people were as vigorous and healthy as the young, and sometimes wiser, the thinking was that they had at least already enjoyed a few decades of life. The wealthy might gain a brief reprieve by bribing the press gangs that came to fetch them; but, by constitutional law, nobody, not even the king himself, could put off their turn indefinitely.\n  Spiritual men sought to comfort those who were afraid of being eaten by the dragon (which included almost everyone, although many denied it in public) by promising another life after death, a life that would be free from the dragon-scourge. Other orators argued that the dragon has its place in the natural order and a moral right to be fed. They said that it was part of the very meaning of being human to end up in the dragon’s stomach. Others still maintained that the dragon was good for the human species because it kept the population size down. To what extent these arguments convinced the worried souls is not known. Most people tried to cope by not thinking about the grim end that awaited them.\n  For many centuries this desperate state of affairs continued. Nobody kept count any longer of the cumulative death toll, nor of the number of tears shed by the bereft. Expectations had gradually adjusted and the dragon-tyrant had become a fact of life. In view of the evident futility of resistance, attempts to kill the dragon had ceased. Instead, efforts now focused on placating it. While the dragon would occasionally raid the cities, it was found that the punctual delivery to the mountain of its quota of life reduced the frequency of these incursions.\n  Knowing that their turn to become dragon-fodder was always impending, people began having children earlier and more often. It was not uncommon for a girl to be pregnant by her sixteenth birthday. Couples often spawned a dozen children. The human population was thus kept from shrinking, and the dragon was kept from going hungry.\n  Over the course of these centuries, the dragon, being well fed, slowly but steadily grew bigger. It had become almost as large as the mountain on which it lived. And its appetite had increased proportionately. Ten thousand human bodies were no longer enough to fill its belly. It now demanded eighty thousand, to be delivered to the foot of the mountain every evening at the onset of dark.\n  What occupied the king’s mind more than the deaths and the dragon itself was the logistics of collecting and transporting so many people to the mountain every day. This was not an easy task.\n  To facilitate the process, the king had a railway track constructed: two straight lines of glistening steel leading up to the dragon’s abode. Every twenty minutes, a train would arrive at the mountain terminal crammed with people, and would return empty. On moonlit nights, the passengers traveling on this train, if there had been windows for them to stick their heads out of, would have been able to see in front of them the double silhouette of the dragon and the mountain, and two glowing red eyes, like the beams from a pair of giant lighthouses, pointing the way to annihilation.\n  Servants were employed by the king in large numbers to administer the tribute. There were registrars who kept track of whose turn it was to be sent. There were people-collectors who would be dispatched in special carts to fetch the designated people. Often traveling at breakneck speed, they would rush their cargo either to a railway station or directly to the mountain. There were clerks who administered the pensions paid to the decimated families who were no longer able to support themselves. There were comforters who would travel with the doomed on their way to the dragon, trying to ease their anguish with spirits and drugs.\n  There was, moreover, a cadre of dragonologists who studied how these logistic processes could be made more efficient. Some dragonologists also conducted studies of the dragon’s physiology and behavior, and collected samples – its shed scales, the slime that drooled from its jaws, its lost teeth, and its excrements, which were specked with fragments of human bone. All these items were painstakingly annotated and archived. The more the beast was understood, the more the general perception of its invincibility was confirmed. Its black scales, in particular, were harder than any material known to man, and there seemed no way to make as much as a scratch in its armor.\n  To finance all these activities, the king levied heavy taxes on his people. Dragon-related expenditures, already accounting for one seventh of the economy, were growing even faster than the dragon itself.\n  Humanity is a curious species. Every once in a while, somebody gets a good idea. Others copy the idea, adding to it their own improvements. Over time, many wondrous tools and systems are developed. Some of these devices – calculators, thermometers, microscopes, and the glass vials that the chemists use to boil and distil liquids – serve to make it easier to generate and try out new ideas, including ideas that expedite the process of idea-generation.\n  Thus the great wheel of invention, which had turned at an almost imperceptibly slow pace in the older ages, gradually began to accelerate.\n  Sages predicted that a day would come when technology would enable humans to fly and do many other astonishing things. One of the sages, who was held in high esteem by some of the other sages but whose eccentric manners had made him a social outcast and recluse, went so far as to predict that technology would eventually make it possible to build a contraption that could kill the dragon-tyrant.\n  The king’s scholars, however, dismissed these ideas. They said that humans were far too heavy to fly and in any case lacked feathers. And as for the impossible notion that the dragon-tyrant could be killed, history books recounted hundreds of attempts to do just that, not one of which had been successful. “We all know that this man had some irresponsible ideas,” a scholar of letters later wrote in his obituary of the reclusive sage who had by then been sent off to be devoured by the beast whose demise he had foretold, “but his writings were quite entertaining and perhaps we should be grateful to the dragon for making possible the interesting genre of dragon-bashing literature which reveals so much about the culture of angst!”\n  Meanwhile, the wheel of invention kept turning. Mere decades later, humans did fly and accomplished many other astonishing things.\n  A few iconoclastic dragonologists began arguing for a new attack on the dragon-tyrant. Killing the dragon would not be easy, they said, but if some material could be invented that was harder than the dragon’s armor, and if this material could be fashioned into some kind of projectile, then maybe the feat would be possible. At first, the iconoclasts’ ideas were rejected by their dragonologist peers on grounds that no known material was harder than dragon scales. But after working on the problem for many years, one of the iconoclasts succeeded in demonstrating that a dragon scale could be pierced by an object made of a certain composite material. Many dragonologists who had previously been skeptical now joined the iconoclasts. Engineers calculated that a huge projectile could be made of this material and launched with sufficient force to penetrate the dragon’s armor. However, the manufacture of the needed quantity of the composite material would be expensive.\n  A group of several eminent engineers and dragonologists sent a petition to the king asking for funding to build the anti-dragon projectile. At time when the petition was sent, the king was preoccupied with leading his army into war against a tiger. The tiger had killed a farmer and subsequently disappeared into the jungle. There was widespread fear in the countryside that the tiger might come out and strike again. The king had the jungle surrounded and ordered his troops to begin slashing their way through it. At the conclusion of the campaign, the king could announce that all 163 tigers in the jungle, including presumably the murderous one, had been hunted down and killed. During the tumult of the war, however, the petition had been lost or forgotten.\n  The petitioners therefore sent another appeal. This time they received a reply from one of the king’s secretaries saying that the king would consider their request after he was done reviewing the annual dragon-administration budget. This year’s budget was the largest to date and included funding for a new railway track to the mountain. A second track was deemed necessary, as the original track could no longer support the increasing traffic. (The tribute demanded by the dragon-tyrant had increased to one hundred thousand human beings, to be delivered to the foot of the mountain every evening at the onset of dark.) When the budget was finally approved, however, reports were coming from a remote part of the country that a village was suffering from a rattlesnake infestation. The king had to leave urgently to mobilize his army and ride off to defeat this new threat. The anti-dragonists’ appeal was filed away in a dusty cabinet in the castle basement.\n  The anti-dragonists met again to decide what was to be done. The debate was animated and continued long into the night. It was almost daybreak when they finally resolved to take the matter to the people. Over the following weeks, they traveled around the country, gave public lectures, and explained their proposal to anyone who would listen. At first, people were skeptical. They had been taught in school that the dragon-tyrant was invincible and that the sacrifices it demanded had to be accepted as a fact of life. Yet when they learnt about the new composite material and about the designs for the projectile, many became intrigued. In increasing numbers, citizens flocked to the anti-dragonist lectures. Activists started organizing public rallies in support of the proposal.\n  When the king read about these meetings in the newspaper, he summoned his advisors and asked them what they thought about it. They informed him about the petitions that had been sent but told him that the anti-dragonists were troublemakers whose teachings were causing public unrest. It was much better for the social order, they said, that the people accepted the inevitability of the dragon-tyrant tribute. The dragon-administration provided many jobs that would be lost if the dragon was slaughtered. There was no known social good coming from the conquest of the dragon. In any case, the king’s coffers were currently nearly empty after the two military campaigns and the funding set aside for the second railway line. The king, who was at the time enjoying great popularity for having vanquished the rattlesnake infestation, listened to his advisors’ arguments but worried that he might lose some of his popular support if was seen to ignore the anti-dragonist petition. He therefore decided to hold an open hearing. Leading dragonologists, ministers of the state, and interested members of the public were invited to attend.\n  The meeting took place on the darkest day of the year, just before the Christmas holidays, in the largest hall of the royal castle. The hall was packed to the last seat and people were crowding in the aisles. The mood was charged with an earnest intensity normally reserved for pivotal wartime sessions.\n  After the king had welcomed everyone, he gave the floor to the leading scientist behind the anti-dragonist proposal, a woman with a serious, almost stern expression on her face. She proceeded to explain in clear language how the proposed device would work and how the requisite amount of the composite material could be manufactured. Given the requested amount of funding, it should be possible to complete the work in fifteen to twenty years. With an even greater amount of funding, it might be possible to do it in as little as twelve years. However, there could be no absolute guarantee that it would work. The crowd followed her presentation intently.\n  Next to speak was the king’s chief advisor for morality, a man with a booming voice that easily filled the auditorium:\n  “Let us grant that this woman is correct about the science and that the project is technologically possible, although I don’t think that has actually been proven. Now she desires that we get rid of the dragon. Presumably, she thinks she’s got the right not to be chewed up by the dragon. How willful and presumptuous. The finitude of human life is a blessing for every individual, whether he knows it or not. Getting rid of the dragon, which might seem like such a convenient thing to do, would undermine our human dignity. The preoccupation with killing the dragon will deflect us from realizing more fully the aspirations to which our lives naturally point, from living well rather than merely staying alive. It is debasing, yes debasing, for a person to want to continue his or her mediocre life for as long as possible without worrying about some of the higher questions about what life is to be used for. But I tell you, the nature of the dragon is to eat humans, and our own species-specified nature is truly and nobly fulfilled only by getting eaten by it...”\n  The audience listened respectfully to this highly decorated speaker. The phrases were so eloquent that it was hard to resist the feeling that some deep thoughts must lurk behind them, although nobody could quite grasp what they were. Surely, words coming from such a distinguished appointee of the king must have profound substance.\n  The speaker next in line was a spiritual sage who was widely respected for his kindness and gentleness as well as for his devotion. As he strode to the podium, a small boy yelled out from the audience: “The dragon is bad!”\n  The boy’s parents turned bright red and began hushing and scolding the child. But the sage said, “Let the boy speak. He is probably wiser than an old fool like me.”\n  At first, the boy was too scared and confused to move. But when he saw the genuinely friendly smile on the sage’s face and the outreached hand, he obediently took it and followed the sage up to the podium. “Now, there’s a brave little man,” said the sage. “Are you afraid of the dragon?“\n      “Yes,” the boy said, tears welling up in his large frightened eyes. “Granny promised that she would teach me how to bake gingerbread cookies for Christmas. She said that we would make a little house out of gingerbread and little gingerbread men that would live in it. Then those people in white clothes came and took Granny away to the dragon… The dragon is bad and it eats people… I want my Granny back!”\n  At this point the child was crying so hard that the sage had to return him to his parents.\n  There were several other speakers that evening, but the child’s simple testimony had punctured the rhetorical balloon that the king’s ministers had tried to inflate. The people were backing the anti-dragonists, and by the end of the evening even the king had come to recognize the reason and the humanity of their cause. In his closing statement, he simply said: “Let’s do it!”\n  As the news spread, celebrations erupted in the streets. Those who had been campaigning for the anti-dragonists toasted each other and drank to the future of humanity.\n  The next morning, a billion people woke up and realized that their turn to be sent to the dragon would come before the projectile would be completed. A tipping point was reached. Whereas before, active support for the anti-dragonist cause had been limited to a small group of visionaries, it now became the number one priority and concern on everybody’s mind. The abstract notion of “the general will” took on an almost tangible intensity and concreteness. Mass rallies raised money for the projectile project and urged the king to increase the level of state support. The king responded to these appeals. In his New Year address, he announced that he would pass an extra appropriations bill to support the project at a high level of funding; additionally, he would sell off his summer castle and some of his land and make a large personal donation. “I believe that this nation should commit itself to achieving the goal, before this decade is out, of freeing the world from the ancient scourge of the dragon-tyrant.”\n  Thus started a great technological race against time. The concept of an anti-dragon projectile was simple, but to make it a reality required solutions to a thousand smaller technical problems, each of which required dozens of time-consuming steps and missteps. Test-missiles were fired but fell dead to the ground or flew off in the wrong direction. In one tragic accident, a wayward missile landed on a hospital and killed several hundred patients and staff. But there was now a real seriousness of purpose, and the tests continued even as the corpses were being dug out from the debris.\n  Despite almost unlimited funding and round-the-clock work by the technicians, the king’s deadline could not be met. The decade concluded and the dragon was still alive and well. But the effort was getting closer. A prototype missile had been successfully test fired. Production of the core, made of the expensive composite material, was on schedule for its completion to coincide with the finishing of the fully tested and debugged missile shell into which it was to be loaded. The launch date was set to the following year’s New Year’s Eve, exactly twelve years after the project’s official inauguration. The best-selling Christmas gift that year was a calendar that counted down the days to time zero, the proceeds going to the projectile project.\n  The king had undergone a personal transformation from his earlier frivolous and thoughtless self. He now spent as much time as he could in the laboratories and the manufacturing plants, encouraging the workers and praising their toil. Sometimes he would bring a sleeping bag and spend the night on a noisy machine floor. He even studied and tried to understand the technical aspects of their work. Yet he confined himself to giving moral support and refrained from meddl\n......", "posttime": "2020-10-14 22:57:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "龙霸,dragon,国王", "title": "“龙霸寓言”(2005)", "title_en": "The Fable of the Dragon-Tyrant (2005)", "transed": 1, "url": "https://nickbostrom.com/fable/dragon.html", "via": "", "real_tags": ["龙霸", "dragon", "国王"]}, {"category": "", "categoryclass": "", "imagename": "68b80bf217d1cd9a98283f7fd754c5d0.jpg", "infoid": 1028771, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天拿到了我的Quest 2，用我的真名(以前从来没有过)创建了一个新的Facebook账号，并将我4年前的Oculus账号与之合并。10分钟后立即被禁止，现在无法访问我的帐户或使用我的设备。\n按照Facebook的要求发送了带照片的驾照ID，我的账户现在显示：我们已经审核了这一决定，不能撤销。在尝试登录时，我看起来像是丢失了之前购买的所有Oculus，现在有了一个新的白色镇纸。\n级别1我不明白为什么当您为任务创建帐户时系统没有回旋余地。\n第二层，这家公司似乎有很多盲点，就像他们从来没有开过内部问答环节，比如商店是如何运作的，人们如何期待新发布的产品在发布的那一刻就成为店铺的焦点--愿望清单系统的毫无意义(如果游戏发布了，为什么还要有一个呢？)。多个用户账户完全是个笨手笨脚的问题，在这个系统推出之前就应该解决了。在过去的几年里，公司明显遗漏了大量的小问题，这让我麻木到了这样的地步，这种事情并不令人惊讶。\n在这之前，我听说了很多关于他们对FB自动执行规则的支持的可怕故事-现在唯一的不同是，人们可能会失去很多东西。我希望它能在不造成太大损害的情况下更换。\n第二级我以前处理过Facebook的广告，在所有的科技巨头中，Facebook的客户支持是最差的。\n我是说，他们甚至都没有。您只需要挖掘一大堆常见问题来尝试解决您自己的问题。如果你被算法禁止了呢？好吧，祝你好运。\n级别2自从我在桌面应用程序上点击了允许按钮后，我还没有真正玩过我的游戏。\n天哪，我真希望Valve、微软或惠普都在努力做一些类似的事情，而且很快就会比Quest更好。\n第二级你可以用你的耳机没问题。嗯，在你不小心为某人和他们的隐形警察使用错误的代词之前的几个月里，警察(是的，他们有隐形的行为观察者)抓住它，禁止你使用，给你留下了数百美元的硬件和数十到数百美元的内容，就这样躺在那里无法使用。\n级别1一旦涉及到如此昂贵的产品，以及在其上存储了有价值软件的帐户，法律上不应允许他们阻止您访问/使用您已支付的费用。如果他们因为某件事而必须禁止你，它应该只适用于Facebook上的帖子，而不是其他产品/服务。\n坦率地说，BS的声明：我们已经审查了这一决定，它不能被推翻。也应该是非法的。他们不应该被允许做出这样的决定，直到用户和服务代表就情况进行了适当的来回讨论。如果你没有参与他们对你的审查过程，从消费者保护的角度来看，这是无效的，国际海事组织。\n如果你没有告诉我们的这个故事没有更多的内容，我建议联系你的当地/州/联邦代表，或者试试你当地的媒体和/或BBB，甚至可能是律师。告诉他们全部细节，要专业，有时你会惊讶于这样做能达到什么效果。几年前，因为有人使用我们的wifi进行文件共享，我们的互联网被切断了，所以我们联系了我们的州代表，解释并寻求帮助，一天后，我们接到服务提供商的一个惊慌失措的电话，提出重新激活我们的服务。呵呵。\n第二级血脑屏障的事总能让我笑个不停。他们没有监管或执法的权力。它们就像是1950年代版的Yelp。\n级别1真的很糟糕：(这正是我所害怕的。FB和Oculus应该为这种情况感到羞耻。\n第二级，如果你把他们带到小额索赔法庭，会发生什么？在美国不确定，但在我住的地方，如果付20美元左右，他们要么必须现身，对你进行辩护，要么被自动认定负有责任，并被勒令解决或赔偿。\n第二级没有Oculus..。这里只有Facebook。Facebook不会在意，除非它是一个有新闻价值的项目，损害了他们对该产品的公共商业前景。\n这就是为什么我坚持使用我用了4年的PSVR技术。我希望将来有其他公司能生产出一种低成本的耳机。但是这个锁定的FB问题，再加上TOS声称他们拥有你的所有数据，你的对话，通过耳机的一切，包括从捕捉你家的摄像头流传送的原始视频(色情爱好者要小心)……。“任务2”是FB&#39；的特洛伊木马，它可以从字面上了解你生活的方方面面。\n不过非常令人沮丧，因为这款小耳机的概念非常出色。它做了这么多正确的事情-但有一件非常大的事情错了。如果Facebook没有买断他们的股份，而其他人已经买断了他们的股份，那就好了。\n级别1我不能从我的Oculus账户中删除一个旧玩家/假名，我所有的游戏都是在上面购买的。在苦恼于绕圈子试图把它和一个真实的名字联系起来之后，我把问题打包好，现在我要把它寄回去。\n甚至连他们与解耦账户的链接都是错误的，这会把你带到一个如何在出厂时重置你的耳机的视频……。那是一个征兆，\n第一级我发誓今天我也发生了完全一样的事情..。不过，我没有使用电话号码，所以10分钟后我就残废了，但他们想要核实电话号码，我也这么做了。然后他们想要一段我的自拍视频。现在它正在等待审查！！我刚刚创建了一个拥有100%真实信息的账户。这是非法的！买一些你不能用的东西！！你可以购买Playstation，Xbox，Nintendo，永远不会创建账户，但你可以购买游戏，把它放进去，然后玩它！说真的，脸书才是黑手党！", "note_en": "Got my Quest 2 today and created a new Facebook account with my real name (never had one previously) and merged my 4 year old Oculus account with it. Promptly got banned 10 minutes later and now cannot access my account or use my device.\n Sent drivers license photo ID as requested by Facebook and my account now says &#34;We have already reviewed this decision and it can&#39;t be reversed.&#34; upon trying to login so it looks like I&#39;ve lost all my previous Oculus purchases and now have a new white paperweight.\n    level 1  I don&#39;t understand why there is no leeway to the system when you&#39;re creating an account for a Quest.\n level 2  There seem to be a whole lot of blindspots with the company, like they never had any in-house QA sessions in regards to how the store works, how people expect things like new releases to be spotlight in the store the moment they release - the pointlessness of the wishlist system (why have one if it doesn&#39;t notify me when a game is out?) multiple user accounts have been a total fumble that should&#39;ve been fixed before this system launched etc. - tons of little things that have become clear misses by the company over the past couple years that well, have numbed me to the point that this kind of thing isn&#39;t very surprising.\n Before any of this, i heard loads of horror stories about their support too regards automation enforcement of rules at fb - the only difference now is that people have potentially a whole lot to lose. I hope it changes without too much damage.\n     level 2  I’ve dealt with Facebook ads before and out of all the tech giants, facebook has the worst customer support.\n I mean, they don’t even have one. You just have a slew of FAQs to dig through to attempt to solve your own problem. And if you’re banned by an algo ? Well, good luck.\n     level 2  I haven&#39;t really played with mine since I clicked that Allow button from the desktop app.\n God do I hope Valve, Microsoft, or HP are working on something like  and better than the Quest soon.\n  level 2  You get to use your headset no problem... well for several months before you accidentally use the wrong pronoun for someone and their invisible police(yes they have invisible behavior watchers) catch it and ban you leaving you with hundreds of dollars of hardware and tens to hundreds of dollars of content just sitting there unable to be used.\n  level 1  Once such an expensive product is involved, as well as an account with valuable software stored on it, they should NOT be legally allowed to block you from accessing/using what you&#39;ve paid for. If they must ban you for something, it should only apply to posting on Facebook, not other products/services.\n And frankly, that BS statement: &#34;We have already reviewed this decision and it can&#39;t be reversed.&#34; should also be illegal. They shouldn&#39;t be allowed to make such a determination until after the user and a service rep have had a proper back-and-forth about the situation. If you weren&#39;t involved in their review process OF YOU, it&#39;s not valid from a consumer protection viewpoint, IMO.\n If there&#39;s not more to this story you&#39;re not telling us, I suggest contacting your local/state/federal representatives, or try your local press and/or the BBB, or maybe even a lawyer. Give them the full details, be professional, you&#39;d be surprised what that can achieve sometimes. Years ago we had our internet cut off because someone was using our wifi for file-sharing, so we contacted our state representative, explaining and asking for help, and a day later we got a panicked call from our service provider offering to reactivate our service. heh\n level 2  The BBB thing always cracks me up. They have no regulatory or enforcement power. They are just like a 1950’s version of Yelp.\n level 1  That really sucks :( Exactly what I was afraid of. FB and Oculus should be ashamed of this situation.\n level 2  What would happen if you took them to Small Claims court? Not sure about in the US but where I live for about $20 they’d have to either show up and argue their case against you, or be found liable automatically and ordered to resolve or reimburse.\n  level 2  There is no oculus... There is only facebook. And facebook doesn&#39;t care unless it&#39;s a news-worthy item that damages their public business outlook for the product.\n This is why I am sticking with my 4 year old PSVR tech. I am hoping some other company creates a low-cost headset in the future .. but this locked FB problem, compounded with the TOS claiming they own all your data, your conversations, everything that goes through the headset including raw video feed streamed from the cameras capturing your home (porn fappers beware)... Quest 2 is FB&#39;s trojan horse to  literally own aspects of your life.\n Very frustrating though, as the concept is stellar for this little headset. It does so many things right - but one very big thing wrong. If ONLY facebook had not have bought them out and someone else had&#39;ve done it.\n  level 1  I couldn&#39;t detach an old gamer/fake name from my Oculus account all my games are purchased on. After getting annoyed with going in circles trying to connect it to a real name I packed the quest2 up and I&#39;m sending it back.\n Even their links to decouple accounts is wrong, takes you to a &#34;how to factory reset your headset&#34; video... That was a sign,\n level 1  I swear I had the exact same thing happen today.. Except I didn&#39;t use a phone number, so 10 minutes later I was disabled, but they wanted to verify phone number, which I did.. Then they wanted a selfie video of me... Now it&#39;s pending REVIEW!! WTF I just created an account with all 100% real info. THIS IS ILLEGAL! Buy something you can&#39;t use!! You can buy Playstation, Xbox, Nintendo and never create an account but you can buy a game, put it in, and play it!!!! SERIOUSLY FACEBOOK IS THE MAFIA!", "posttime": "2020-10-14 22:56:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,帐户,account", "title": "链接Oculus帐户后Facebook帐户被禁止", "title_en": "Facebook account banned after linking Oculus account", "transed": 1, "url": "https://www.reddit.com/r/OculusQuest/comments/japo1j/facebook_account_banned_within_10_minutes/", "via": "", "real_tags": ["facebook", "帐户", "account"]}, {"category": "", "categoryclass": "", "imagename": "46d1a2038694f9ef6d911c58c3b7d07e.png", "infoid": 1028770, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Algolia AI可以优化您的整个搜索和发现体验，以更少的业务团队调整来发展您的业务。\nAlgolia AI紧密集成到一个全面的搜索和发现管理平台中，因此您始终可以做出最终决定。\n来自Algolia的新API，提供类似Alexa的自然语言理解。了解您用户的意图，提高用户的搜索体验，或其他任何地方。\n通过减少转换的点击次数，让您的客户更快地进入购物车。让顾客用自己的话描述他们想要什么。\n播放一部20世纪50年代的喜剧，下一部，再放一遍。让你的用户参与到语音控制中来，让他们一直在收看和收听。\n通过帮助客户更快地找到问题的答案，降低客户支持成本。阿尔戈利亚理解即使在复杂的搜索中也能发现意图。\n来自Algolia和OpenAI的最佳技术来回答最困难的自然语言问题。\nAlgolia Answers不仅能找到文档，还能找到最能回答搜索者问题的确切答案。Q&amp；A将真实世界的语义知识添加到可调的文本相关性中，以便在非结构化内容中找到深层的答案。\n“我们已经看到Algolia对仅靠文本搜索很难回答的问题的回答取得了很好的结果。它能够从我们的新闻档案中返回非常相关的常青树内容，以回答诸如火山为什么会喷发这样的问题。“。\n让AI学习你的用户如何重写他们的查询来建议同义词，这样下一次他们就不必重写了。\nABC作为澳大利亚最大的新闻平台，我们的受众非常多样化。这使得我们的访问者很难在我们的100万+文章中持续连接到正确的内容。自从使用动态同义词建议以来，我们在www.abc.net.au上的搜索有了很大改进。“。\n利用人工智能提升您的搜索和发现体验的最高性能结果，使您与数字资产的每次交互更有可能转换。\n一个可定制的引擎，为每个用户量身定做排名。新的人工智能算法增强了用户配置文件的生成，并改善了意图和用户上下文的混合。\n对于像我们这样目录中有超过2.5万种产品的零售商来说，一个改善我们每个用户在搜索过程中的体验的解决方案增加了巨大的价值。Algolia的内置个性化代表着新加坡迪卡侬在数字时代迈出了真正的一步。“。\n新的ML增强的自然语言处理功能，改进了对日语、德语、荷兰语和芬兰语的支持。\n日本是欧舒丹集团在全球最大的数字市场，为我们的日本客户提供最先进的数字体验对我们来说至关重要。自从实施Algolia以来，我们看到使用Search的会话增加了150%。“", "note_en": "Algolia AI can optimize your entire search and discovery experience growing your business with far less tuning by your business teams.\n Algolia AI is tightly integrated into a comprehensive search and discovery management platform so you can always make the final decision.\n The new API from Algolia that offers Alexa-like natural language understanding. Understand your users’ intents, increase conversion - in search experiences, or anywhere else.\n  Get your customers to the cart quicker by reducing the clicks to conversion. Let customers describe what they want in their own words.\n &#34;Play a comedy from the 1950s,&#34; &#34;next one,&#34; &#34;play that one again.&#34; Engage your users with voice controls, to keep them watching and listening.\n Reduce customer support costs by helping customers find answers to their questions faster. Algolia Understand discovers intent even within complex searches.\n The best technologies from Algolia and OpenAI to answer the most difficult natural language questions.\n Algolia Answers finds not just the document, but the exact answer that best responds to the searcher’s question. Q&amp;A adds real-world semantic knowledge to tunable textual relevance to find answers deep within unstructured content.\n   “We’ve seen great results from Algolia Answers on questions that are difficult to answer with textual search alone. It was able to return very relevant, evergreen content from our news archives for questions such as &#34;Why does a volcano erupt&#34;.”\n Let AI learn from how your users rewrite their queries to suggest synonyms, so next time they don’t have to rewrite.\n   “ABC being the largest news platform in Australia our audience is very diverse. It makes it difficult to continuously connect our visitors to the right content among our 1M+ articles. Since using Dynamic Synonym Suggestions, we’ve seen our search greatly improving on www.abc.net.au.”\n Leverage AI to boost the most performing results on your search and discovery experience, making each interaction with your digital properties more likely to convert.\n A customizable engine to tailor the ranking to each user. New AI algorithms enhance user profiles generation, and improve the blending of intent and user context.\n   “For a retailer like us with more than 25,000 products in our catalog, a solution that improves each of our users’ experiences along their search journey adds tremendous value. Algolia’s built-in personalization represents a real step forward in the digital era for Decathlon Singapore.”\n New ML powered Natural Language Processing capabilities for improved support of Japanese, German, Dutch and Finnish.\n   “Japan being L’Occitane Group’s largest digital market worldwide, providing our Japanese customers with a state of the art digital experience is critical for us. Since implementing Algolia, we’ve seen a increase of 150% of sessions with search.”", "posttime": "2020-10-14 22:56:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,发布,搜索,releases", "title": "Algolia发布新的人工智能搜索功能", "title_en": "Algolia releases new AI search features", "transed": 1, "url": "https://www.algolia.com/products/whats-new/", "via": "", "real_tags": ["人工智能", "发布", "搜索", "releases"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028769, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "集装箱安全是一个广阔的问题空间，有许多低垂的果实可以收获，以降低风险。一个很好的起点是在编写Dockerfile时遵循一些规则。\n我整理了一份常见安全问题的清单，以及如何避免这些问题。对于每个问题，我还编写了一个开放策略代理(Open Policy Agent，OPA)规则，可以使用conftest静态分析您的Dockerfile。你不能再往左移了！\n您可以在此存储库中找到.rego规则集。我感谢反馈和贡献。\n秘密分发是一个毛茸茸的问题，很容易弄错。对于容器化的应用程序，可以通过挂载卷从文件系统显示它们，也可以更方便地通过环境变量来显示它们。\n使用ENV存储机密是不好的做法，因为Dockerfile通常是随应用一起分发的，所以在代码中与硬编码机密没有区别。\nSecrets_env=[&#34；密码&#34；，&#34；密码&#34；，##34；密码&#34；，##34；密码&#34；，&#39；不能使用此密码&#34；密码&#34；，&#34；密钥&#34；，&#34；访问&#34；，&#34；api_key&#34；，&#34；apiKey&#34；，&#34；令牌&34；，&#34；TKN&#34；]DENY[msg]{input[i].Cmd==&#34；env&#34；val：=input[i].value包含(LOWER(val[_])，secrets_env[_])msg=sprintf(&#34；第%d行：在ENV密钥中找到潜在秘密：%s&#34；，[i，val])}}。\n针对容器化应用的供应链攻击还将来自用于构建容器本身的层的层次结构。\n主要的罪魁祸首显然是使用的基本图像。不受信任的基本映像风险很高，应尽可能避免。\nDocker为最常用的操作系统和应用提供了一套官方基础镜像。通过使用它们，我们利用与Docker本身分担的某种责任，将危害风险降至最低。\n拒绝[msg]{input[i].Cmd==&#34；from&#34；val：=Split(input[i].value[0]，&#34；/&#34；)count(Val)&gt；1 msg=sprintf(&#34；第%d行：使用受信任的基本映像&#34；，[i])}}。\n此规则针对DockerHub的官方图片进行调整。这非常愚蠢，因为我只检测到名称空间的缺失。\n固定基础映像的版本将使您在构建的容器的可预测性方面获得一些安心。\n如果您依赖于LATEST，您可能会静默继承更新的包，在最坏的情况下可能会影响您的应用程序的可靠性，在最坏的情况下可能会引入漏洞。\n拒绝[msg]{input[i].Cmd==&#34；From&#34；val：=Split(Input[i].value[0]，&#34；：&#34；)包含(LOWER(VAL[1])，&#34；LATEST&#34；])msg=spintf(&#34；第%d行：不要对基本图像使用&#39；LATEST&#39；标记&#34；，[i])}。\n从互联网上拉东西，然后把它们输送到一个外壳里，这是最糟糕的事情了。不幸的是，这是一种广泛使用的简化软件安装的解决方案。\n供应链攻击的风险也是如此，归根结底是信任。如果你真的要卷曲狂欢，那就做对了：\n拒绝[消息]{Input[i].Cmd==&#34；Run&#34；val：=Concat(&#34；&#34；，Input[i].value)匹配：=regex.find_n(&#34；(curl|wget)[^|^&gt；]*[|&gt；]&#34；，下限(Val)，-1)计数(匹配)&gt；0消息=短跑(&#34；行%d：避免卷曲打击&#34；，[i])}。\n这可能有点牵强，但理由如下：您希望固定软件依赖项的版本，如果您执行apt-get升级，您将有效地将它们全部升级到最新版本。\n如果您进行了升级，并且使用的是基本映像的最新标记，则会放大依赖关系树的不可预测性。\n您要做的是固定基本映像版本，然后只更新apt/apk。\nUPGRADE_COMMANDS=[&#34；apk Upgrade&#34；，&#34；apt-get Upgrade&#34；，&#34；，]Deny[msg]{input[i].Cmd==&#34；run&#34；val：=Concat(&#34；&#34；，input[i].value)包含(val，Upgrade_Commands[_])msg=sprintf(“行：%d：不升级系统包&#34；，[i])}。\nAdd命令的一个小功能是，您可以将其指向远程url，它将在构建时获取内容：\n从安全的角度来看，同样的建议也适用：不要。在获取您需要的任何内容之前，对其进行验证，然后复制。但是，如果您真的必须这样做，请使用受信任的来源，而不是安全的连接。\n注意：如果您有一个可以动态生成Dockerfile的奇特构建系统，那么Add实际上就是一个请求利用的接收器。\n拒绝[msg]{input[i].Cmd==&#34；add&#34；msg=sprintf(&#34；第%d行：使用复制而不是添加&#34；，[i])}。\n容器中的root与主机上的root相同，但受docker守护进程配置的限制。不管有什么限制，如果一个演员冲出了容器，他仍然能够找到一种方法来完全访问主持人。\n当然，这并不理想，您的威胁模型不能忽略以root身份运行所带来的风险。\n请注意，在Dockerfile中显式设置用户只是一层防御措施，并不能解决以根用户身份运行的整个问题。\n相反，我们可以(也应该)采用纵深防御方法，并在整个堆栈中进一步缓解：严格配置docker守护进程或使用无根容器解决方案，限制运行时配置(如果可能，则禁止--特权，等等)，等等。\nAny_user{input[i].Cmd==&#34；user&#34；}拒绝[msg]{不是any_user msg=&#34；不要以root身份运行，改用user&#34；}。\n即使您以用户身份运行，也要确保该用户不是sudoers俱乐部的成员。\n拒绝[msg]{input[i].Cmd==&#34；run&#34；val：=Concat(&#34；&#34；，input[i].value)包含(较低(Val)，&#34；sudo&#34；)msg=spintf(&#34；行%d：请勿使用&#39；sudo&#39；命令&#34；，[i])}\n这幅作品受到了马杜·阿库拉的启发，是对马杜·阿库拉现有技术的迭代。", "note_en": "Container security is a broad problem space and there are many low hanging fruits one can harvest to mitigate risks. A good starting point is to follow some rules when writing Dockerfiles.\n I’ve compiled a list of common security issues and how to avoid them. For every issue I’ve also written an  Open Policy Agent (OPA) rule ready to be used to statically analyze your Dockerfiles with  conftest. You can’t shift more left than this!\n You can find the  .rego rule set in  this repository. I appreciate feedback and contributions.\n  Secrets distribution is a hairy problem and it’s easy to do it wrong. For containerized applications one can surface them either from the filesystem by mounting volumes or more handily through environment variables.\n Using  ENV to store secrets is bad practice because Dockerfiles are usually distributed with the application, so there is no difference from hard coding secrets in code.\n  secrets_env = [ &#34;passwd&#34;, &#34;password&#34;, &#34;pass&#34;, # &#34;pwd&#34;, can&#39;t use this one &#34;secret&#34;, &#34;key&#34;, &#34;access&#34;, &#34;api_key&#34;, &#34;apikey&#34;, &#34;token&#34;, &#34;tkn&#34;]deny[msg] { input[i].Cmd == &#34;env&#34; val := input[i].Value contains(lower(val[_]), secrets_env[_]) msg = sprintf(&#34;Line %d: Potential secret in ENV key found: %s&#34;, [i, val])}\n  Supply chain attacks for containerized application will also come from the hierarchy of layers used to build the container itself.\n The main culprit is obviously the base image used. Untrusted base images are a high risk and whenever possible should be avoided.\n Docker provides a  set of official base images for most used operating systems and apps. By using them, we minimize risk of compromise by leveraging some sort of shared responsibility with Docker itself.\n  deny[msg] { input[i].Cmd == &#34;from&#34; val := split(input[i].Value[0], &#34;/&#34;) count(val) &gt; 1 msg = sprintf(&#34;Line %d: use a trusted base image&#34;, [i])}\n This rule is tuned towards DockerHub’s official images. It’s very dumb since I’m only detecting the absence of a namespace.\n   Pinning the version of your base images will give you some peace of mind with regards to the predictability of the containers you are building.\n If you rely on latest you might silently inherit updated packages that in the best worst case might impact your application reliability, in the worst worst case might introduce a vulnerability.\n  deny[msg] { input[i].Cmd == &#34;from&#34; val := split(input[i].Value[0], &#34;:&#34;) contains(lower(val[1]), &#34;latest&#34;]) msg = sprintf(&#34;Line %d: do not use &#39;latest&#39; tag for base images&#34;, [i])}\n  Pulling stuff from internet and piping it into a shell is as bad as it could be. Unfortunately it’s a widespread solution to streamline installations of software.\n  The risk is the same framed for supply chain attacks and it  boils down to trust. If you really have to curl bash, do it right:\n   deny[msg] { input[i].Cmd == &#34;run&#34; val := concat(&#34; &#34;, input[i].Value) matches := regex.find_n(&#34;(curl|wget)[^|^&gt;]*[|&gt;]&#34;, lower(val), -1) count(matches) &gt; 0 msg = sprintf(&#34;Line %d: Avoid curl bashing&#34;, [i])}\n  This might be a bit of a stretch but the reasoning is the following: you want to pin the version of your software dependencies, if you do  apt-get upgrade you will effectively upgrade them all to the latest version.\n If you do upgrade  and you are using the  latest tag for the base image, you amplify the unpredictability of your dependencies tree.\n What you want to do is to pin the base image version and just  apt/apk update.\n  upgrade_commands = [ &#34;apk upgrade&#34;, &#34;apt-get upgrade&#34;, &#34;dist-upgrade&#34;,]deny[msg] { input[i].Cmd == &#34;run&#34; val := concat(&#34; &#34;, input[i].Value) contains(val, upgrade_commands[_]) msg = sprintf(“Line: %d: Do not upgrade your system packages&#34;, [i])}\n  One little feature of the  ADD command is that you can point it to a remote url and it will fetch the content at building time:\n   From a security perspective the same advice applies: don’t.Get whatever content you need before, verify it and then  COPY. But if you really have to,  use trusted sources over secure connections.\n Note: if you have a fancy build system that dynamically generate Dockerfiles, then  ADD is effectively a sink asking to be exploited.\n  deny[msg] { input[i].Cmd == &#34;add&#34; msg = sprintf(&#34;Line %d: Use COPY instead of ADD&#34;, [i])}\n  Root in a container is the same root as on the host machine, but restricted by the docker daemon configuration. No matter the limitations, if an actor breaks out of the container he will still be able to find a way to get full access to the host.\n Of course this is not ideal and your threat model can’t ignore the risk posed by running as root.\n   Note that explicitly setting a user in the Dockerfile is just one layer of defence and won’t solve the whole  running as root problem.\n Instead one can — and  should — adopt a defence in depth approach and mitigate further across the whole stack: strictly configure the docker daemon or use a rootless container solution, restrict the runtime configuration (prohibit  --privileged if possible, etc), and so on.\n  any_user { input[i].Cmd == &#34;user&#34; }deny[msg] { not any_user msg = &#34;Do not run as root, use USER instead&#34;}\n   Even if you run as a user make sure the user is not in the  sudoers club.\n deny[msg] { input[i].Cmd == &#34;run&#34; val := concat(&#34; &#34;, input[i].Value) contains(lower(val), &#34;sudo&#34;) msg = sprintf(&#34;Line %d: Do not use &#39;sudo&#39; command&#34;, [i])}\n  This work has been inspired and is an iteration on  prior art from  Madhu Akula.", "posttime": "2020-10-14 22:55:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker,dockerfile,security", "title": "Dockerfile安全最佳做法", "title_en": "Dockerfile Security Best Practices", "transed": 1, "url": "https://cloudberry.engineering/article/dockerfile-security-best-practices/", "via": "", "real_tags": ["docker", "security"]}, {"category": "", "categoryclass": "", "imagename": "c05ee9c48b86036eba97c9a53963276d.jpg", "infoid": 1028767, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎收看“惊吓战术”，这是一部旨在探索不同创作者如何制作恐怖游戏的系列视频的试播节目。我们认为恐怖游戏是一种特殊的类型--恐怖游戏并不总是出于和其他游戏相同的原因。他们不一定有趣，他们的回报通常来自于克服自己的恐惧，而不是克服游戏的机制。\n我们将通过讨好摩擦游戏的联合创始人托马斯·格里普来开始这个系列。如果将“摩擦失忆：黑暗降临”的上映称为恐怖游戏的分水岭时刻，那将是一种严重的轻描淡写--它开启了许多let‘s Play YouTubers的职业生涯，并催生了数十个模仿者，他们都在尝试同样的惊吓你的脑筋急转弯的模式。该公司目前正在制作“健忘症：重生”，但格里普从完成“重生”中抽出时间，带领我们了解他的恐怖游戏设计哲学和方法。\n(在此过程中，他还与我们分享了一些重生预告，我们上面的视频展示了一些还没有见过的重生游戏元素！)。\n不管你怎么切分，恐怖最终都是主观的。我们永远不会同意哪些东西是最可怕的，哪些游戏元素是必要的，甚至是体验的目的是什么。这让恐怖游戏的创建者陷入了一个奇怪的境地--在一个好的游戏类型中，如果好的意思与其他地方不一定相同，你怎么能制作出好的游戏呢？\n在个人层面上，我多年来一直是GRIP的粉丝，我真的很尊重他对游戏设计的看法。他还执导了“索玛”，这是一部杰作，也是我认为我玩过的最恐怖的游戏。(在大气层、场景和怪物之外，索玛实际上让我做了噩梦，因为它让我问了一些关于生命、存在、人性和意识的问题。这难道不是任何一件好艺术品都应该做的吗？)。\n这并不是我们第一次涉足恐怖题材的电影--我们以前也拍过这类题材的视频，包括与德高望重的格伦·斯科菲尔德谈论“死亡空间”，以及之前与格里普就最初的健忘症进行过交谈。\n但把这些早期的努力看作是序幕，因为“惊吓战术”系列是我热爱的项目。我们并不打算对游戏进行评论或预览，而是利用发布游戏的机会来探索整个流派。就像战争故事一样，我们想把Ars Technica的特殊调味汁应用到一个主题上，让像GRIP这样优秀的设计师有机会谈论它们是如何让我们害怕的具体细节。(所以，如果你碰巧有任何喜欢的恐怖类型游戏，希望我们深入研究，请在评论中留言！)。\n“健忘症：重生”将于10月20日推出PC和PlayStation4。目前它在Steam或GOG上提供预购，售价为26.99美元。", "note_en": "Welcome to &#34;Scare Tactics,&#34; a pilot for a video series that aims to explore how different creators make horror games. We see horror as a special genre—horror games aren&#39;t always played for the same reasons as other games. They aren&#39;t necessarily  fun, and their reward often comes from overcoming one&#39;s own fears, rather than from overcoming the game&#39;s mechanics.\n We&#39;re starting the series by cozying up to Frictional Games cofounder Thomas Grip. To call the release of Frictional&#39;s  Amnesia: The Dark Descent a watershed moment in horror gaming would be a severe understatement—it launched the careers of  many Let&#39;s Play YouTubers and spawned dozens of copycats all trying the same scare-your-brains-out formula. The company is currently working on  Amnesia: Rebirth, but Grip took time away from finishing  Rebirth to take us through his philosophy and approach to horror game design.\n (Along the way, he also shared some  Rebirth previews with us, and our video above showcases a few  Rebirth gameplay elements that haven&#39;t been seen yet!)\n  No matter how you slice it, horror is ultimately subjective. We&#39;ll never agree on which things are scariest, which gameplay elements are necessary, or even what the experience is for. This puts horror game creators in a weird position—how do you make good games in a genre where &#34;good&#34; doesn&#39;t necessarily mean the same thing as it does elsewhere?\n On a personal level, I&#39;ve been a fan of Grip for years, and I really respect his views on game design. He also directed  Soma, which was a masterpiece—and the scariest game I think I&#39;ve ever played. (Outside of the atmosphere and the setting and the monsters,  Soma actually managed to give me nightmares because of the questions it caused me to ask about life and existence and humanity and consciousness. And isn&#39;t that what any good piece of art should do?)\n   This isn&#39;t our first dive into horror—we&#39;ve done videos on the genre before, including talking with the venerable  Glen Schofield about   Dead Space and previous chatting with Grip about  the original  Amnesia.\n But consider those earlier efforts as prologue, because &#34;Scare Tactics&#34; as a series is a passion project of mine. We don&#39;t really plan on doing reviews or previews of games, but rather using the release of a game as an opportunity to explore a whole genre. Like &#34;War Stories,&#34; we want to apply that Ars Technica special sauce to a subject and give brilliant designers like Grip the chance to talk about the nuts-and-bolts of how they make us afraid. (So if you happen to have any favorite horror genre games you&#39;d like us to dig into, please drop a note in the comments!)\n Amnesia: Rebirth will be out on October 20 for PC and Playstation 4. It&#39;s currently available for pre-order on  Steam or  GOG for $26.99.", "posttime": "2020-10-14 22:40:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,和索玛,soma", "title": "健忘症和索玛的创造者托马斯·格里普解释了他是如何让游戏变得可怕的", "title_en": "Amnesia and Soma creator Thomas Grip explains how he makes games terrifying", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/amnesia-and-soma-creator-thomas-grip-explains-how-he-makes-games-terrifying/", "via": "", "real_tags": ["游戏", "和索玛", "soma"]}, {"category": "", "categoryclass": "", "imagename": "820920f8bb7479e41a63cd15777dc44b.jpg", "infoid": 1028766, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在新冠肺炎出现在任何人的雷达上之前，智能手机行业就已经处于转型阶段。在最初的iPhone推出13年多后，这些产品早已从奢侈品过渡到大宗商品，在这个过程中失去了一些光泽。在过去的几年里，由于消费者越来越不愿为新设备支付1000美元或更多，升级周期变得较慢。\n虽然iPhone12无疑早在当前的大流行之前就在开发中，但大流行的全球停摆只会加剧智能手机制造商的许多现有问题。苹果的反应最清楚地体现在今天的“Hi Speed”活动上宣布的iPhone的绝对数量上。一家公司只能依靠一两家旗舰公司的日子已经一去不复返了。\n今天的活动总共带来了四款新的iPhone，价格从699美元到1099美元不等：12款，12款迷你，12款Pro和12款Pro Max。与Apple Watch一样，该公司保留了去年的iPhone11，并将价格降至599美元。这使得较老的机型在Android设备上处于中高端，但与我们习惯的苹果手机相比，这代表着一个便宜得多的入门点。", "note_en": "The smartphone industry was in transition well before COVID-19 was a blip on anyone’s radar. More than 13 years after the launch of the original iPhone, these products have long since transitioned from luxury items to commodities, losing some of their luster in the process. The past several years have seen slower upgrade cycles as consumers grew reluctant to pay $1,000 or more for new devices.\n And while the iPhone 12 was no doubt in development long before the current pandemic, the pandemic’s global shutdown has only exacerbated many existing problems for smartphone makers. The clearest representation of Apple’s reaction is in the sheer number of iPhones announced at today’s “Hi Speed” event. Long gone are the days when a company could rest on a single flagship or two.\n Today’s event brought a grand total of four new iPhone models, ranging in price from $699 to $1,099: the 12, 12 mini, 12 Pro and 12 Pro Max. As with the Apple Watch, the company is keeping last year’s iPhone 11 around and has cut the price to $599. That puts the older model in the high-mid-range for Android devices, but represents a far cheaper entry point than we’re accustomed to for Apple phones.", "posttime": "2020-10-14 22:37:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,2020,iphone,行业,state", "title": "\nIPhone12告诉我们2020年智能手机行业的状况", "title_en": "\n\t\t\t\tWhat the iPhone 12 tells us about the state of the smartphone industry in 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/what-the-iphone-12-tells-us-about-the-state-of-the-smartphone-industry-in-2020/", "via": "", "real_tags": ["手机", "2020", "iphone", "行业", "state"]}, {"category": "", "categoryclass": "", "imagename": "d5bd002abd54763c008e5d8038fa4040.jpg", "infoid": 1028765, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "交易条款没有披露，但Celonis联合创始人兼首席执行官亚历山大·林克表示，交易金额超过1亿美元。他说：“这是一个超过一亿元的三位数字数字。我们不能透露确切的价格，但我们只是给出了这个范围，“他说。这笔交易已经完成。\nRinke将Integromat描述为Zapier的企业版，它相当成功，建立了价值1000万美元的业务，拥有超过11,000名客户，并将帮助该公司实现跨应用程序的流程自动化，这是一件很难做到的事情。\n“他们真的开发了一种我认为是颠覆性的自动化方法。显然，这对我们来说非常重要，因为我们正在寻求将我们的产品从最初的流程挖掘工具扩展为专注于揭示当今流程如何执行的洞察力，并将其演变为我们所称的执行管理系统，这一系统正在持续不断地帮助您优化关键流程的执行。“Rinke解释说：”Rinke解释说：“我们希望将我们的产品从最初的流程挖掘工具扩展为关注当今流程如何执行的洞察力，并将其演变为我们所称的执行管理系统。”\nRinke说，每家公司都有一套关键的运营，如果你能开始跨这些系统实现自动化，就像Integromat使他们现在所做的那样，你就可以开始挤出方法，通过自动化来提高你的业务效率。\n“我们认为，需要在(关键的一组运营)之上建立一个层，以便首先了解正在发生的事情，衡量组织今天执行的能力，衡量最大的差距在哪里，能力被困在哪里，然后释放出这种自动化。这是一个重要的部分，因为当你弄清楚这一点时，理想情况下你会希望尽可能多地实现自动化，“他说。\nIntegromat的60名员工将成为Celonis的一部分，但Rinke表示，该公司的技术将被纳入Celonis平台，并继续作为单独的独立产品为现有客户服务，这对这些客户来说肯定是个好消息。\nCelonis于2011年推出，已经筹集了超过3.64亿美元。去年11月，它以25亿美元的估值筹集了2.9亿美元。Integromat成立于2012年，尚未筹集任何资金。这两家公司的财务信息都是根据Pitchbook提供的。", "note_en": "The terms of the deal were not disclosed, but Celonis co-founder and CEO Alexander Rinke said the deal was over $100 million. “It was a three digit amount of over $100 million. We can’t disclose the exact price, but we’re just giving this range,” he said. The deal has already closed.\n Rinke describes Integromat as an enterprise version of Zapier, one that has been quite successful, building a $10 million business with over 11,000 customers, and will help the company automate processes across applications, something that is difficult to do.\n  “They really develop what I believe is a disruptive approach to automation. And obviously it’s very important for us because we are we looking to expand our product from being primarily a process mining tool that is focused on surfacing the insights as to how processes executed today, and evolve that into what we call an execution management system, which is on an ongoing basis really helping you to optimize the execution of your key processes,” Rinke explained.\n  Rinke says that every company has a key set of operations, and if you can begin to automate across these systems, as Integromat enables them to do now, you can begin to squeeze out ways to make your business more efficient through automation.\n “We believe that there needs to be a layer that comes in on top of that [key set of operations] to first of all understand what’s going on, measure the capacity that organizations executes with today, measure where the biggest gaps are and where the capacity is trapped, and then also unleash that automation. This is an important piece because when you figure that out, you ideally want to automate as much as possible,” he said.\n Integromat’s 60 employees will become part of Celonis, but Rinke says the company’s technology will be both incorporated into the Celonis platform and continue to service current customers as a separate stand-alone product, which has to be good news for those customers.\n Celonis launched in 2011 and has raised over $364 million.  It raised $290 million last November on a valuation of $2.5 billion. Integromat was launched in 2012 and has not raised any money. Both company’s financial information is according to Pitchbook.", "posttime": "2020-10-14 22:37:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,acquires,自动化", "title": "\nCelonis收购捷克初创公司Integromat以加快向过程自动化的转变", "title_en": "\n\t\t\t\tCelonis acquires Czech startup Integromat to accelerate move to process automation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/celonis-acquires-czech-startup-integromat-to-accelerate-move-to-process-automation/", "via": "", "real_tags": ["收购", "acquires", "自动化"]}, {"category": "", "categoryclass": "", "imagename": "f107311b9317a589bc2e92383db2a34b.jpg", "infoid": 1028764, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "舒尔的SRH1540是封闭式耳机，提供优质音效，既适合真正喜欢高质量音频的人，也适合那些实际上必须定期使用音频的人，包括音响工程师和播客制作人。他们设法制造出与开放式耳机相当的音响舞台，不过噪音泄漏更少(非常适合在家办公)。\n在盒子里，舒尔包括不是一条而是两条电缆，以及一套备用的阿尔坎塔拉覆盖的耳朵广告。它们配有一个硬面塑料手提箱和一个螺纹适配器，以便与6.3 mm的音频插孔一起使用(电缆开箱后为3.5 mm)。\n舒尔与SRH1450的设计完全是关于舒适性和质量的。这款耳机极其轻巧--但不要让它欺骗你，让你以为它是由廉价材料制成的。框架使用飞机级的铝和碳纤维来提供最大的强度，而不会产生在长时间的聆听过程中会给你的头部带来沉重负担的东西。\n耳垫中使用的阿尔坎塔拉材料也非常耐用，同时提供了令人愉悦的柔软触感。杯子里也有足够的填充物，它们轻盈地放在你的头上，同时提供必要的帮助，以适应不同的头部和耳朵形状。\n舒尔在这里使用了双连接线设计，耳机侧面的每个镀金端都牢固地夹在一起。它们有颜色编码以确保精确放置，电缆本身采用芳纶缠绕，以确保线缆经久耐用。盒子里还有一对双人备份以防万一。\n就音效而言，这款耳机非常棒，即使是最挑剔的发烧友也应该会喜欢，特别是在搭配DAC或USB音频接口时，比如我主要测试的Focusite Scarlett 2i2。它们提供了令人惊叹的清晰度和细节水平，并提供了很好的低音，而不会完全压倒或冲刷音响舞台。长期以来，我一直使用开口式耳机作为我的标准有线耳机，用于音频编辑和全天佩戴，但SRH1450已经改变了我的想法。\n对于那些想要花一点钱(但不要花太多钱，在高端音响设备领域)以获得一副音质极佳、经久耐用、全天舒适的耳机的人来说，这是一个令人惊叹的选择。要记住的一点是，它们并不是真正的隔音，尽管它们在这方面比开口式耳机更好。", "note_en": "The SRH1540 from Shure are closed-back headphones that provide premium sound suitable either just for people who really like high-quality audio, or for those who actually have to work with audio on a regular basis, including sound engineers and podcast producers. They manage to produce a soundstage that’s very comparable to what you get out of open-back headphones, albeit with less noise leakage (great for shared work-from-home offices).\n In the box, Shure includes not one but two cables, as well as a spare set of the Alcantara-covered ear-ads. They come with a hard-sided plastic carrying case, and a threaded adapter for using them with a 6.3mm audio jack (the cable is 3.5mm out of the box).\n   Shure’s design with the SRH1450 is all about comfort and quality. The headphones are extremely lightweight – but don’t let that fool you into thinking it’s made of cheap materials. The frame uses aircraft-grade aluminum and carbon fiber to offer the most strength without creating something that’s going to weigh heavy on your head for long listening sessions.\n The Alcantara material used in the earpads is also very durable, while offering a pleasantly soft-touch feel. There’s ample padding in the cups, too, and they rest lightly on your head while providing necessary give to accommodate a number of different head and ear shapes.\n Shure uses a dual-connector cord design here, with each gold-plated end of the headphone side clipping in securely. They’re color-coded for accurate placement, and the cable itself is kevlar-wrapped to ensure the cord will last a long time. There’s a twin backup in the box as well just in case.\n Sound-wise, these are excellent headphones that should please even the most discerning audiophiles, especially when paired with a DAC or USB audio interface like the Focusrite Scarlett 2i2 I mostly tested them with. They provide an amazing level of clarity and detail, and great bass without being totally overwhelming or washing out the soundstage. I’ve long used open-back headphones as my standard wired cans for audio editing and all-day wear, but the SRH1450s have converted me.\n  These are an amazing choice for anyone looking to spend a bit of money (but not too much, in the world of premium audio equipment) in order to get a pair of headphones that offer great sound quality along with durability and all-day comfort. The one caveat to keep in mind is that they aren’t really at all sound-isolating, though they’re better in this regard than open-back headphones.", "posttime": "2020-10-14 22:36:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "srh1540", "title": "\n舒尔的SRH1540耳机可以升级您的家庭设置，提供高质量的声音和全天的舒适性", "title_en": "\n\t\t\t\tShure’s SRH1540 headphones can upgrade your home setup with quality sound and all-day comfort\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/shures-srh1540-headphones-can-upgrade-your-home-setup-with-quality-sound-and-all-day-comfort/", "via": "", "real_tags": ["srh1540"]}, {"category": "", "categoryclass": "", "imagename": "2933e0ad31952070a5b377fb254b1692.jpg", "infoid": 1028763, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这份报告中，NYSDFS通过对比的例子指出，受监管的加密货币公司采取行动以防止Twitter黑客诈骗更多人的速度有多快-认为这表明技术创新和监管并不是相互排斥的。\n它的重点是，最大的社交媒体平台拥有巨大的社会力量(伴随着所有相关的消费者风险)，但没有保护用户的监管责任。\n报告的结论是，这是美国立法者需要着手解决的问题-建议成立一个监督委员会(“指定具有系统重要性的社交媒体公司”)，并任命一个“适当的”监管机构来“监控和监督”主流社交媒体平台的安全做法。\n“社交媒体公司已经发展成为一种不可或缺的沟通方式：超过一半的美国人使用社交媒体获取新闻，并与同事、家人和朋友联系。NYSDFS写道，这种演变要求建立一种将社交媒体反映为关键基础设施的监管制度“，然后继续指出，”仍然没有专门的州或联邦监管机构有权确保足够的网络安全做法，以防止欺诈、虚假信息和其他对社交媒体巨头的系统性威胁“。\n报告补充称：“Twitter黑客攻击事件最大程度地表明，当具有系统重要性的机构任由其自我监管时，社会将面临风险。”“保护具有系统重要性的社交媒体不被滥用对我们所有人--消费者、选民、政府和行业--至关重要。现在是政府采取行动的时候了。“。\n司法部调查的关键发现之一是，黑客通过给员工打电话并自称来自Twitter的IT部门，侵入了Twitter的系统-通过这种简单的社会工程方法，他们能够欺骗四名员工交出他们的登录凭据。从那里，他们可以访问知名政客、名人和企业家的Twitter账户，包括巴拉克·奥巴马(Barack Obama)、金·卡戴珊·韦斯特(Kim Kardashian West)、杰夫·贝佐斯(Jeff Bezos)、埃隆·马斯克(Elon Musk)和一些加密货币公司-利用被劫持的账户向数百万用户发布加密骗局。\n推特此前已证实，有人利用“电话鱼叉式网络钓鱼”攻击来获取凭证。\n根据这份报告，黑客的“让你的比特币加倍”诈骗信息，其中包含用比特币支付的链接，使他们能够从Twitter用户那里窃取价值超过11.8万美元的比特币。\n尽管由于受监管的密码公司-即Coinbase、Square、双子信托公司(Gemini Trust Company)和Bitamp-采取了迅速行动，防止了相当大的一笔资金被盗，但司法部表示，这些公司阻止了欺诈者的数十次企图转账。\n报告指出：“这一迅速的行动阻止了6000多笔向黑客比特币地址的转账企图，价值约150万美元。”\nTwitter还因在黑客袭击发生时没有网络安全主管而受到指责-此前他未能接替3月份离职的迈克尔·科茨(Michael Coates)。(上个月，它宣布Rinki Sethi已被聘为CISO)。\nNYSDFS写道：“尽管推特是一个号称在2019年拥有超过3.3亿月平均用户的全球社交媒体平台，但它缺乏足够的网络安全保护。”“在遭到攻击时，推特没有首席信息安全官，没有足够的访问控制和身份管理，也没有足够的安全监控--这些都是该部门全国首创的网络安全法规所要求的一些核心措施。”\n欧盟数据保护法已经将安全要求作为全面隐私和安全框架的一部分(对违反安全的行为可能进行重大处罚)。然而，爱尔兰DPC对2018年Twitter安全事件的调查仍未结束，因为今年8月，一项决定草案未能获得其他欧盟数据监管机构的支持，这引发了泛欧盟监管进程的进一步推迟。", "note_en": "In the  report, the NYSDFS points, by way of contrasting example, to how quickly  regulated cryptocurrency companies acted to prevent the Twitter hackers scamming even more people — arguing this demonstrates that tech innovation and regulation aren’t mutually exclusive.\n Its point is that the biggest social media platforms have huge societal power (with all the associated consumer risk) but no regulated responsibilities to protect users.\n  The report concludes this is a problem U.S. lawmakers need to get on and tackle stat — recommending that an oversight council be established (to “designate systemically important social media companies”) and an “appropriate” regulator appointed to ‘monitor and supervise’ the security practices of mainstream social media platforms.\n “Social media companies have evolved into an indispensable means of communications: more than half of Americans use social media to get news, and connect with colleagues, family, and friends. This evolution calls for a regulatory regime that reflects social media as critical infrastructure,” the NYSDFS writes, before going on to point out there is still “no dedicated state or federal regulator empowered to ensure adequate cybersecurity practices to prevent fraud, disinformation, and other systemic threats to social media giants”.\n “The Twitter Hack demonstrates, more than anything, the risk to society when systemically important institutions are left to regulate themselves,” it adds. “Protecting systemically important social media against misuse is crucial for all of us — consumers, voters, government, and industry. The time for government action is now.”\n  Among the key findings from the Department’s investigation are that the hackers broke into Twitter’s systems by calling employees and claiming to be from Twitter’s IT department — through which simple social engineering method they were able to trick four employees into handing over their log-in credentials. From there they were able to access the Twitter accounts of high profile politicians, celebrities, and entrepreneurs, including Barack Obama, Kim Kardashian West, Jeff Bezos, Elon Musk, and a number of cryptocurrency companies — using the hijacked accounts to tweet out a crypto scam to millions of users.\n Twitter has previously confirmed that  a “phone spear phishing” attack was used to gain credentials.\n Per the report, the hackers’ “double your bitcoin” scam messages, which contained links to make a payment in bitcoins, enabled them to steal more than $118,000 worth of bitcoins from Twitter users.\n Although a considerably larger sum was prevented from being stolen as a result of swift action taken by regulated crypto companies — namely: Coinbase, Square, Gemini Trust Company and Bitstamp — who the Department said blocked scores of attempted transfers by the fraudsters.\n “This swift action blocked over 6,000 attempted transfers worth approximately $1.5 million to the Hackers’ bitcoin addresses,” the report notes.\n Twitter is also called out for not having a cybersecurity chief in post at the time of the hack — after failing to replace Michael Coates, who  left in March. (Last month it announced  Rinki Sethi had been hired as CISO).\n “Despite being a global social media platform boasting over 330 million average monthly users in 2019, Twitter lacked adequate cybersecurity protection,” the NYSDFS writes. “At the time of the attack, Twitter did not have a chief information security officer, adequate access controls and identity management, and adequate security monitoring — some of the core measures required by the Department’s first-in-the-nation cybersecurity regulation.”\n European Union data protection law already bakes in security requirements as part of a comprehensive privacy and security framework (with major penalties possible for security breaches). However an investigation by the Irish DPC of a 2018 Twitter security incident is still yet to conclude after a draft decision failed to gain the backing of the other EU data watchdogs this  August — triggering a further delay to the pan-EU regulatory process.", "posttime": "2020-10-14 22:36:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,网络安全,hack,监管", "title": "\nTwitter黑客调查导致呼吁为社交媒体巨头制定网络安全规则", "title_en": "\n\t\t\t\tTwitter hack probe leads to call for cybersecurity rules for social media giants\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/twitter-hack-probe-leads-to-call-for-cybersecurity-rules-for-social-media-giants/", "via": "", "real_tags": ["黑客", "网络安全", "hack", "监管"]}, {"category": "", "categoryclass": "", "imagename": "6ca38980efa116b6294b3070be6c0301.jpeg", "infoid": 1028760, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一遍又一遍给女性的忠告，目的是缩小男女之间的职业和收入差距。\n从自助书籍到自信教练，Facebook高管谢丽尔·桑德伯格通过她在全球范围内的“向前一步”运动推动了“向前一步”，并在工作场所表现出信心的信息无处不在：\n女性受到存在于我们内心的障碍的阻碍。我们因缺乏自信，不举手，在应该靠前的时候退缩，在大大小小的事情上都会拖后腿。\n这些努力的初衷是好的，因为女性在高级和领导职位上的代表性一直偏低。\n作为一名劳动经济学家，在我自己的职业生涯中，我一直接受这样的建议，我想找出答案。\n因此，我使用澳大利亚的调查数据来调查男性和女性的信心和升职之间的联系。这项研究结果刚刚发表在《澳大利亚劳工经济学杂志》(Australian Journal Of Labor Economics)上。\n澳大利亚具有全国代表性的家庭、收入和劳动力动态(HILDA)调查包括衡量一个人接受挑战的信心。\n它是由成功的希望组成的，我们通过询问人们对以下说法的认同程度来衡量成功的希望\n它是由对失败的恐惧组成的，而失败的恐惧是通过一个人的同意来衡量的，比如。\n使用一种名为瓦哈卡-盲人分解的统计技术，我调查了他们的答案与他们是否在第二年获得晋升之间的联系。\n在控制了包括提供的工作机会在内的一系列因素后，我发现，成功的希望越高，晋升的可能性就越大。\n表现出高度外向的大胆和魅力的男性也会体验到更大的晋升可能性。那些认为生活中发生的任何事情都是他们自己选择和努力的结果的男性也是如此，我们称之为“控制点”。\n但同样，这些特点与女性的晋升前景之间没有任何联系。\n总而言之，这些发现指出了一个令人不安的职业成功模板：自信，雄心勃勃…。做个男性。\n这个晋升模板还规定：不要表现出对失败的恐惧。在管理者中，尽管不是整个员工，但对失败的恐惧与较弱的晋升前景有关-但对男性的影响比对女性的影响更深。\n这与社会惩罚男性领导人暴露情感弱点的方式如出一辙。男性和女性都受到性别规范的阻碍。\n对女性来说，这可能弊大于利。在一个不重视女性这种属性的文化中，违反预期的模式是有风险的。\n恳求女性采取以成功男性为特征的行为，会造成一种将女性描绘成“缺陷”的文化，并贬低多样化的工作方式。\n固执于修复女性-在没有证据的情况下它会产生回报-将资源从实际上可能产生影响的反歧视倡议中转移出来。\n无论如何，几乎没有证据表明信心造就了优秀的员工。过度自信的员工可能会成为负担。\n如果根据能力而不是信心和魅力来决定招聘和晋升，工作场所会得到更好的服务。\n我的研究是越来越多的人中的一个，他们认为性别平等不应该是关于改变女性，而应该是关于改变工作场所。", "note_en": "These are the words of advice given over and over to women in a bid to close the career and earnings gaps between women and men.\n From self-help books to confidence coaching, the message to “lean in” and show confidence in the workplace is pervasive, propelled by Facebook Executive Sheryl Sandberg through her worldwide  Lean In movement:\n Women are hindered by barriers that exist within ourselves. We hold ourselves back in ways both big and small, by lacking self-confidence, by not raising our hands, and by pulling back when we should be leaning in\n The efforts are well intended, because women are persistently  underrepresented in senior and leadership positions.\n   As a labour economist, and a recipient of such advice throughout my own career, I wanted to find out.\n So I used Australian survey data to investigate the link between confidence and job promotion for both men and women. The results have just been published in the  Australian Journal of Labour Economics.\n The nationally-representative Household, Income and Labour Dynamics in Australia ( HILDA) survey includes a measure of a person’s confidence to take on a challenge.\n     It is made up of  hope for success which we measure by asking people how much they agree with statements such as\n  And it is made up of  fear of failure which is measured by a person’s agreement with statements such as\n    Using a statistical technique called Oaxaca-Blinder decomposition I investigated the link between their answers and whether or not they experienced a promotion in the following year.\n After controlling for a range of factors, including the job opportunities on offer, I discovered higher hope for success was clearly linked to a higher likelihood of promotion.\n            Men who display boldness and charisma, reflected by high extraversion, also experience a stronger likelihood of promotion. As do men who display the attitude that whatever happens to them in life is a result of their own choices and efforts, a trait we call “locus of control”.\n But again there is no link between any of these traits and the promotion prospects for women.\n Collectively these findings point to a disturbing template for career success: be confident, be ambitious… and be male.\n  This template for promotion also prescribes: don’t show fear of failure. Among managers, though not among workers as a whole, fear of failure is linked to weaker job promotion prospects — but more profoundly for men than women.\n This echoes the way society penalises male leaders for revealing emotional weakness. Both men and women are hindered by gender norms.\n  For women, it could do  more harm than good. In a culture that does not value such attributes among women, contravening expected patterns carries risks.\n  Imploring women to adopt behaviours that characterise successful men creates a culture that paints women as “deficient” and devalues  diverse working styles.\n A fixation on  fixing women — without proof it pays off — steers resources away from  anti-discrimination initiatives that could actually make a difference.\n In any case there is very little evidence confidence makes good workers. Overconfident workers can be  liabilities.\n    Workplaces would be served better by basing their hiring and promotion decisions on competency and capability rather than confidence and charisma.\n My study is one of a  steadily  growing number suggesting gender equity shouldn’t be about changing women, it should be about changing workplaces.", "posttime": "2020-10-14 22:30:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建议,women,女性", "title": "给女性的建议是“向前倾”，但要更加自信，这无济于事", "title_en": "That advice to women to ‘lean in’, be more confident it doesn’t help", "transed": 1, "url": "https://theconversation.com/that-advice-to-women-to-lean-in-be-more-confident-it-doesnt-help-and-data-show-it-146998", "via": "", "real_tags": ["建议", "women", "女性"]}, {"category": "", "categoryclass": "", "imagename": "e955fb532b449ebeea6256c32cc29322.jpg", "infoid": 1028759, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这场流行病对私人教练和健身行业造成了令人难以置信的沉重打击。随着健身房的关闭，教练为新客户提供的主要漏斗已经关闭或放慢了速度。Playbook希望通过他们的内容为他们提供收入流。\n剧本创建者被赋予了制作视频和扩大受众的工具。与许多健身初创公司不同，Playbook真正专注于业务的创建者端，而不是最终用户，它相信，如果教练拥有合适的工具和平台将其货币化，他们就可以吸引自己的观众。\n该公司向将自己的观众带到平台上的创作者(通过他们自己独特的链接)支付来自这些用户的所有收入的80%的分成。如果用户来到某个创建者的平台不可知，培训师将根据观看的秒数获得报酬。\n对于终端用户来说，定价很简单--这是一种随便吃的模式，每月的订阅费是15美元/月或99美元/年。\n早在6月份，Playbook就筹集了300万美元的种子资金。该公司还吸引了一批令人印象深刻的培训人员加入该平台，其中包括凯文·哈特(Kevin Hart)的培训师Everline老板；盖尔·加朵(Gal Gadot)和艾丽西亚·维坎德(Alicia Vikander)的培训师马格努斯·莱奇巴克(Magnus Lydgback)；以及瑞安·雷诺兹(Ryan Reynolds)和布莱克·莱弗利(Blake Livelly。\nPlaybook联合创始人兼首席执行官杰夫·克拉赫尔表示，公司的主要重点是加倍投入为创作者提供的技术服务，其余的将紧随其后。\nKrahel说：“这是我们引入Michael Ovitz作为战略投资者的部分原因。”我们是一家科技驱动的人才经纪公司，是一个为创作者提供工具的伟大科技平台。公司的未来是围绕着支持创作者，几乎就像加速器一样，以最大限度地发挥影响力。“", "note_en": "The pandemic has hit the personal trainer and fitness industry incredibly hard. With gyms closed, trainers’ primary funnel for new customers has been shut down or slowed. Playbook looks to give them a revenue stream through their content.\n Playbook creators are given tools to create videos and grow their audience. Unlike many fitness startups, Playbook really focuses on the creator side of the business rather than the final end user, believing that trainers can attract their own audience if they have the right tools and a platform to monetize them.\n  The company pays creators who bring their own audience to the platform (via their own unique link) an 80 percent cut of all revenue from those users. If users come to the platform agnostic of a certain creator, the trainer gets paid out based on seconds watched.\n For the end user, the pricing is simple — it’s an all-you-can-eat model with a monthly subscription priced at $15/month or $99/year.\n Playbook raised  $3 million in seed back in June. The company has also attracted an impressive roster of trainers to the platform, including Boss Everline, trainer to Kevin Hart; Magnus Lydgback, trainer to Gal Gadot and Alicia Vikander; and Don Saladino, trainer to Ryan Reynolds and Blake Lively.\n Playbook cofounder and CEO Jeff Krahel said that the main focus for the company is to double down on the technology services offered to creators, and the rest will follow.\n “That’s part of the reason we brought on Michael Ovitz as a strategic investor,” said Krahel. “We are a tech-driven talent agency, a great tech platform with tools for creators. The future of the company is around supporting creators, almost like an accelerator, to maximize impact.”", "posttime": "2020-10-14 22:11:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "放在首位,fitness,培训师", "title": "\n将创作者放在首位的健身平台PlayBook筹集了930万美元", "title_en": "\n\t\t\t\tPlaybook, a fitness platform that puts creators first, raises $9.3 million\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/playbook-a-fitness-platform-that-puts-creators-first-raises-9-3-million/", "via": "", "real_tags": ["放在首位", "fitness", "培训师"]}]