[{"category": "", "categoryclass": "", "imagename": "f1e8311bde09611f2b5b60abcba46aa9.jpg", "infoid": 1069467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "即使您根本不使用 Clubhouse 应用程序，您自己的号码也可能包含在泄漏中。整个会所数据库都可以在暗网上找到。至少有一位用户声称，他希望在 9 月份的私人拍卖会上出售该数据库。提供8300万个电话号码的免费样本，以便有兴趣的人可以检查数据的真实性。据提供商称，整个数据库有 38 亿个电话号码。这包括手机号码、固定电话号码、私人号码和公司电话号码。之所以出现如此大的数字，是因为 Clubhouse 讨论应用程序据称会秘密地实时同步所有用户的联系人。一旦在智能手机的通讯录中输入了新的电话号码，它也会被添加到会所数据库中。因此，Clubhouse 有许多从未安装过该应用程序或什至不知道该应用程序的人的电话号码。 Clubhouse 声称拥有超过 1000 万用户——远少于泄露的 38 亿电话号码。根据数据库卖家的说法，Clubhouse 使用这些数字作为评分系统。根据在用户智能手机上找到号码的频率，得分越高。 Clubhouse 希望确定个人和公司的网络水平。然后，这些信息可能会转售给广告和分析公司。\n从甚至不使用该服务的人那里收集数据的方法在某些国家/地区违反了数据保护法。事实上，这些数据也被用于可能出售给第三方公司的评论，这让事情变得更糟。在欧盟，通用数据保护条例 (GDPR) 禁止收集不使用该服务的个人数据。如果泄漏中的数据是真实的，欧盟将不得不进行干预并追究会所的责任。", "note_en": "Auch wenn man die Clubhouse-App gar nicht verwendet, kann die eigene Nummer im Leak enthalten sein.\n    Im  Darknet wird die gesamte Datenbank von  Clubhouse angeboten. Dies behauptet zumindest ein User, der die Datenbank im September bei einer privaten Auktion verkaufen will.\n  Damit Interessierte die Echtheit der Daten überprüfen können, wird eine  kostenlose Probe mit 83 Millionen Telefonnummern angeboten.\n  Laut dem Anbieter hat die gesamte Datenbank  3,8 Milliarden Telefonnummern. Dazu gehören Handynummern, Festnetznummer, Nummern von Privatpersonen und Firmentelefonnummer.\n    Die große Anzahl kommt zustande, weil die Diskussions-App Clubhouse angeblich  heimlich die Kontakte aller seiner User*innen in Echtzeit synchronisiert. Sobald eine neue Telefonnummer in den Kontakten am Smartphone eingetragen wird, wird auch diese in die Clubhouse-Datenbank aufgenommen.\n  Dadurch hat Clubhouse viele Telefonnummern von Personen, die die App noch nie installiert haben oder diese nicht einmal kennen. Clubhouse hat nach eigenen Angaben über  10 Millionen User*innen – also weit weniger als die geleakten 3,8 Milliarden Telefonnummern.\n    Laut dem Verkäufer der Datenbank nutzt Clubhouse die Nummern für ein  Scoring-System. Je nachdem wie oft eine Nummer auf den Smartphones der User*innen gefunden wird, desto höher das Scoring. So will Clubhouse das Level der Vernetzung für Privatpersonen und Unternehmen bestimmen. Diese Informationen sollen dann vermutlich Werbe- und Analysefirmen weiterverkauft werden.\n  Die Methode Daten von Personen zu sammeln, die den Service nicht mal nutzen, ist in einigen Ländern eine  Verletzung der Datenschutzgesetze. Dass diese Daten dann auch noch für Bewertungen genutzt werden, die womöglich Drittfirmen verkauft weren, macht die Sache noch schlimmer.\n  In der EU verbietet die Allgemeine Datenschutz-Verordnung –  General Data Protection Regulation (GDPR) – das Sammeln von Personendaten, die nicht den Dienst oder Service nutzen. Sollten sich die Daten in dem Leak als echt herausstellen, müsste die EU einschreiten und Clubhouse zur Rechenschaft ziehen.", "posttime": "2021-07-24 22:59:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "database,电话号码,source,应用程序", "title": "（外媒）整个会所电话号码库（38亿号码，包括联系人）在暗网上出售", "title_en": "(Foreign Source) The entire Clubhouse phonenumber database (3.8 billion numbers, including contacts) is up for sale on the darknet", "transed": 1, "url": "https://futurezone.at/apps/clubhouse-leakt-38-milliarden-telefonnummern-illegal/401453233", "via": "", "real_tags": ["database", "电话号码", "source", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "36567781d3d90c638de90621d6f2bc16.jpg", "infoid": 1069465, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周五，在 2020 年奥运会开幕式上，当奥运会运动员游行到东京国家体育场时，日本电子游戏的粉丝简直不敢相信自己的耳朵：管弦乐队正在演奏他们最喜欢的一些比赛的曲子。为了庆祝在世界范围内受到赞赏的日本流行文化，入场游行设置了来自世嘉、卡普空和史克威尔艾尼克斯开发的游戏的曲调。它以勇者斗恶龙的“序曲：罗托的主题”开始。接下来是《最终幻想》的“胜利号角”。游行中有更多来自 Monster Hunter、Soulcaliber 和 Sonic the Hedgehog 的音乐。 （查看 Nikkan Sports 的日语原始列表，或 Polygon 的英语原始列表。）根据 Classic FM 的说法，Kingdom Hearts 的音乐由 Yoko Shimomura 创作，他负责一些有史以来最大的视频游戏的音乐.粉丝们很高兴听到她的作品被纳入仪式。王国之心（奥林巴斯体育馆）的 ost 由女王下村洋子创作，而意大利进入体育场塞尔达传说，音乐有助于为仪式营造出一种氛围，由于冠状病毒的限制，仪式在几乎空无一人的体育场举行。\n奥运选手主要是在为电视制作的仪式上向摄像机挥手，在可容纳 68,000 人的体育场只有约 1,000 人参加——日本天皇德仁、第一夫人吉尔拜登、国际奥委会成员和记者等贵宾。作为对日本流行文化的另一种致敬，每个国家代表团的标语牌都采用漫画（日本漫画和图画小说）中的讲话泡泡的风格。标志的一侧是国家的英文名称，另一侧是日文。作为对日本流行文化的另一个致敬，可以通过访问 google.com 主页访问的 Google Doodle 也以动漫为主题的主题开始，然后转向令人难以置信的精心制作的 80 年代风格的街机游戏。据《华盛顿邮报》报道，塔夫茨大学修辞学和日本研究教授苏珊·纳皮尔 (Susan Napier) 表示，从东京奥运会上接触动漫和漫画可能会使这些艺术形式在全球范围内更受欢迎。注册成为创始成员并帮助塑造 HuffPost 的下一章", "note_en": "Fans of Japanese video games couldn’t believe their ears as  Olympic athletes paraded into Tokyo’s National Stadium during the opening ceremony for the 2020 Games on Friday: the orchestra was playing tunes from some of their favorite games.\n In a celebration of Japanese popular culture that is appreciated worldwide, the entry parade was set to tunes from games developed by Sega, Capcom and Square Enix.\n It kicked off with “Overture: Roto’s Theme” from Dragon Quest. Next up was “Victory Fanfare” from Final Fantasy. The parade featured more tunes from Monster Hunter, Soulcaliber and Sonic the Hedgehog. (Check out the original list  in Japanese from Nikkan Sports, or in  English from Polygon.)\n According to Classic FM, the music from Kingdom Hearts was composed by Yoko Shimomura, who is responsible for the music for  some of the biggest video games ever made. Fans were delighted to hear her work being incorporated into the ceremony.\n  The ost of Kingdom Hearts (Olympus Coliseum) by queen Yoko Shimomura while Italy entered the stadium ✨  #Tokyo2020\n— Giopota (@giopota)  July 23, 2021\n While the list didn’t feature widely recognized tunes from cultural juggernauts like Mario Bros. or The Legend of Zelda, the music helped give a sense of atmosphere to the ceremony, which was held in almost an empty stadium due to coronavirus restrictions.\n Olympians waved mostly for the cameras in the made-for-TV ceremony, which only had about 1,000 people in attendance at the 68,000-capacity stadium ― VIPs like Japanese Emperor Naruhito, first lady Jill Biden, members of the International Olympic Committee and journalists.\n In another nod to Japanese pop culture, the placard for each country’s delegation was in the style of a speech bubble from manga, which is Japanese comics and graphic novels. The signs had the country’s name in English on one side and Japanese on another.\n  And in another tribute to Japanese pop culture, the  Google Doodle, which is accessed by going to the google.com home page, also starts out with an anime-inspired theme, then moves to an incredibly elaborate ’80s-style arcade game.\n The exposure to anime and manga from the Tokyo Games may serve to make the art forms even more popular worldwide, said Susan Napier, a professor of rhetoric and Japanese studies at Tufts University, according to  The Washington Post.\n    Sign up for membership to become a founding member and help shape HuffPost&#39;s next chapter", "posttime": "2021-07-24 22:55:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,日本,电子游戏,japanese,音乐", "title": "标志性的日本电子游戏音乐融入奥运会开幕式", "title_en": "Iconic Japanese Videogame Music Incorporated Into Olympic Opening Ceremony", "transed": 1, "url": "https://www.huffpost.com/entry/japanese-video-game-music-olympics-opening-ceremony_n_60facd72e4b0d2a22d4aaa61", "via": "", "real_tags": ["游戏", "日本", "电子游戏", "japanese", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "250f6c2d1cb5608a01f8b043b7ee1f5c.jpg", "infoid": 1069464, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（美国有线电视新闻网）今年夏天，一连串热浪困扰着美国，下周气温将高于平均水平，影响该国的地区比之前更多。尽管不像过去的几次热浪那样极端，但由于强烈的热穹顶在一年中最热的时候将温度升高到更高，因此这次热浪将跨越海岸。高温的震中将遍及北部和中部平原——过去几个月，该地区在很大程度上摆脱了无情的、破纪录的高温。到下周初，一条宽阔的高压脊将在该国大部分地区扩张，为平原带来可能创纪录的高温。整个夏季一直低于平均水平的大多数州将开始看到东南和南部平原的气温接近平均水平或略高于平均水平。据气候预测中心称，未来两周高温不会消失，因为除新英格兰东北部外，预计全国大部分地区的气温将接近高于平均水平。从太平洋西北部东部到田纳西河谷，温度高于平均水平，因为热穹顶主导着天气模式。中西部一些地区的高温警告和咨询已经生效，周六的高温指数值将开始攀升至三位数。随着热量的增加，未来一周可能会发布更多警告。周末初，新奥尔良、堪萨斯城和圣路易斯被纳入影响超过 1300 万人的高温预警。高于平均水平的气温将于周五开始在全国蔓延，但到下周将普遍存在。\n蒙大拿州各地的每日高温记录可能会下降，这些地区的记录在本赛季早些时候已经被打破。 “这可能会让人感到意外，但这个星期天（7/25）是 7 月份唯一一天比林斯的历史最高温度低于 100°。目前的预测是 99°，有 50% 的可能性气温达到 100°， “根据位于蒙大拿州比林斯的国家气象局办公室的说法。周五和周六将在该州最近的热浪中稍微平静下来，然后到周末结束时气温将再次飙升至三位数。高点将再次接近记录，而低温几乎不会提供任何缓解。比林斯气象服务办公室表示：“预计隔夜低点也将非常温暖（许多地方约 70 度），因此如果当前的预测趋势继续（可能从周日到周二或周三），可能需要额外的高温警告。”到本周末结束时，在一些地区整个夏天都感受到的炎热气温短暂平静之后，山脊将扩展到北部平原。周一，美国西部和中部地区将出现普遍的三位数，最高点将在 100 年代跨越大盆地、北部平原和南部平原。下周初，高温穹顶可能会给蒙大拿州、内布拉斯加州、北达科他州、南达科他州和怀俄明州带来过热事件，气温将高于平均水平 10 至 20 度。\n预计本周末将持续高温。内布拉斯加州东南部和爱荷华州西南部的部分地区午后高温指数将达到 105 度左右。多喝水，避免在一天中最热的时候进行剧烈的户外工作。 pic.twitter.com/xtqgRv61Sc — NWS 奥马哈 (@NWSOmaha) 2021 年 7 月 23 日“我们地区确实存在长期高温事件的可能性，”内布拉斯加州北普拉特的国家气象局办公室说。 “如果这确实实现了，那么可以实现超过 100 度的普遍高点。”高湿度值会进一步增加热量，导致整个星期美国中部的“感觉就像温度”超过 100 度。从墨西哥湾向北涌出的水分将使这些热量指数在达拉斯和俄克拉荷马城等地攀升至三位数。蒙大拿州东南部、怀俄明州东北部、北达科他州和南达科他州将在周一迎来最热的一天，届时大多数地方的气温将达到世纪大关。内华达州北部和爱达荷州南部的部分地区周一也出现高温高峰。周二，随着一股锋面从东北部向南向达科他州移动，最高气温开始向东南移动。季风湿气可能会在本周中期进入中北部平原，为怀俄明州和蒙大拿州的部分地区带来短暂的缓解，因为它与即将到来的锋面相互作用并产生一些零星的阵雨。\n到周中，从南达科他州到堪萨斯州南部，气温将达到三位数，并被北部的锋面边界向南挤压。由于高压脊，德克萨斯州和俄克拉荷马州本周的气温将接近三位数。预计将经历最极端气温的地区位于中北部平原，但整个美国南部的高温将在本月首次广泛超过 90 度。 CNN 气象学家布兰登·米勒 (Brandon Miller) 在谈到即将到来的佐治亚州亚特兰大的高温时说：“到目前为止，全年只有 7 天的气温达到 90 度或更高，我们正在连续观察 8 天……至少。”从南部平原到大西洋中部，未来一周的气温预计会出现季节性或高于平均水平。从阿马里洛到费城，90 年代的高温将使该地区今年首次普遍感受到炎热的夏季气温。到目前为止，美国东南部经历了一个非常温和的夏季。根据美国国家海洋和大气管理局 6 月份的气候报告，虽然该国大部分地区的 6 月气温高于平均水平，是美国平均气温最高的地区，但东南部地区的气温主要是平均到低于平均水平。随着天气转凉，整个 6 月都在持续降雨，使墨西哥湾沿岸地区的大部分地区降水总量高于平均水平。大范围的降雨事件和以太平洋西北部为中心的热浪使该地区比该国其他地区保持凉爽和湿润，这种模式随着高温的到来而结束。", "note_en": "(CNN)A barrage of heat waves have plagued the US this summer and more above-average temperatures are on the way next week, affecting more of the country than those before it.\n Although not as extreme as the past few heat spells, this one will span from coast to coast due to a strong heat dome elevating temperatures even higher during the hottest time of the year. The epicenter of the heat will build across the northern and central Plains -- a region that has largely escaped the relentless, record-breaking heat the past few months.\n  A broad ridge of high pressure will expand over much of the country by the beginning of next week bringing with it potentially record high temperatures to the Plains. Most states that have been sitting below average through the summer will begin to see temperatures near average or slightly above in the Southeast and Southern Plains.\n     According to  the Climate Prediction Center, the heat isn&#39;t going anywhere for the next two weeks as most of the country is forecast to see near to above-average temperatures, apart from the northeastern parts of New England.\n   Above-average temperatures range from the Pacific Northwest east to the Tennessee River Valley as the heat dome dominates the weather pattern.\n  Heat warnings and advisories are already in effect for some areas of the Midwest, where heat index values on Saturday will begin to climb into the triple digits. More advisories are likely to be issued for the week ahead as the heat builds.\n New Orleans, Kansas City and St. Louis are included in heat advisories affecting more than 13 million people at the start of the weekend. Above-average temperatures will begin to spread across the nation on Friday, but will become widespread by next week.\n    Daily high temperature records could fall in areas across Montana that have already seen records crushed earlier in the season.\n &#34;It may come as a surprise but this Sunday (7/25) is the only day in July where the record high in Billings is less than 100°. The current forecast is 99° with a 50% chance of temperatures reaching 100°,&#34; according to the  National Weather Service office in Billings, Montana.\n  Friday and Saturday will be a slight lull in the state&#39;s most recent heat wave before temperatures soar once again into the triple digits by the end of the weekend. Highs will near records once again and low temperatures will provide little reprieve.\n &#34;Overnight lows are also expected to be quite warm (around 70 degrees in many locations) so additional heat warnings may be needed if current forecast trends continue (possibly from Sunday through Tuesday or Wednesday),&#34; the  Billings weather service office said.\n By end of this weekend, the ridge will expand into the northern Plains after a brief lull in the already torrid temperatures some areas have felt all summer.\n Widespread triple digits will hit the western and central US on Monday, with highs in the 100s spanning the Great Basin, northern Plains and southern Plains.\n The heat dome could bring an excessive heat event to Montana, Nebraska, North Dakota, South Dakota and Wyoming at the beginning of next week with temperatures 10 to 20 degrees above average.\n A prolonged period of heat is expected through this weekend. Afternoon heat indices will top out around 105 degrees over portions of southeast Nebraska and southwest Iowa. Drink plenty of water and avoid strenuous outdoor work during the hottest part of the day.  pic.twitter.com/xtqgRv61Sc\n— NWS Omaha (@NWSOmaha)  July 23, 2021\n &#34;The potential does exist for a prolonged heat event for our area,&#34; said the  National Weather Service office in North Platte, Nebraska. &#34;If this does come to fruition, widespread highs over 100 degrees could be realized.&#34;\n  High humidity values will amp up the heat even more, leading to &#34;feels like temperatures&#34; of more than 100 degrees across the central US throughout the week. Moisture surging north from the Gulf of Mexico will allow for these heat indices to climb into the triple digits in places like Dallas and Oklahoma City.\n Southeastern Montana, northeastern Wyoming, North Dakota and South Dakota will see the hottest day on Monday when temperatures reach the century mark in most places. Parts of northern Nevada and southern Idaho also see high temperatures peak Monday.\n  On Tuesday the highest temperatures begin to shift southeastward as a front approaches from the northeast moving south toward the Dakotas.\n Monsoon moisture could move into the north central Plains by the middle of the week, bringing brief relief to Wyoming and parts of Montana as it interacts with the approaching front and springs up some scattered showers.\n By midweek temperatures in the triple digits will span from South Dakota to southern Kansas, pressed southward by the frontal boundary to the North. Texas and Oklahoma will see temperatures nearing triple digits throughout the week due to the ridge of high pressure as well.\n  The area expected to experience the most extreme temperatures is located in the north-central Plains, but across the southern US high temperatures will be widely above 90 degrees for the first time this month.\n &#34;After only having seven days of 90 degree or higher temperatures all year so far, we are looking at eight in a row ... at least,&#34; said CNN meteorologist Brandon Miller about the heat coming to Atlanta, Georgia.\n From the southern Plains to the Mid-Atlantic, seasonal or above-average temperatures are forecast for the coming week. Highs in the 90s spanning from Amarillo to Philadelphia will give the region its first widespread taste of hot summer temperatures this year.\n  The southeastern US has experienced a very mild summer so far. While the majority of the country saw an above-average June, the warmest on average for the US, the Southeast saw mainly average to below-average temperatures according to the  June climate report from National Oceanic and Atmospheric Administration.\n   Along with the cooler conditions, rain persisted throughout June, bringing much of the Gulf Coast region above-average precipitation totals.\n Extensive rain events and the heat waves centered over the Pacific Northwest allowed the region to remain cooler and wetter than the rest of the country, a pattern that is coming to an end with the arriving heat.", "posttime": "2021-07-24 22:54:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,覆盖,heat,高温", "title": "热穹顶这次又带来了另一波热浪，覆盖了美国大部分地区", "title_en": "Heat dome brings yet another heat wave this time covering most of the US", "transed": 1, "url": "https://www.cnn.com/2021/07/23/weather/heat-wave-central-plains-weekend-forecast/index.html", "via": "", "real_tags": ["美国", "覆盖", "heat", "高温"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069463, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如奥巴马和希拉里保护系列中所指出的，他们的特勤局候选人保护特工将双手握在腰部高度，尤其是在人群中，但在站岗时也是如此。据推测，这允许对攻击者的手快速采取行动或拔出武器。其他保护和/或执法人员是否使用这种手部定位？对此的回答或其他评论，请发送至 cryptome[at]earthlink.net。 2008 年 4 月 19 日星期六，美国特勤局特工陪同民主党总统候选人、参议员希拉里·罗德姆·克林顿 (Hillary Rodham Clinton, DN.Y.) 在宾夕法尼亚州约克市南海狸街和西市场街的交汇处竞选。（美联社照片/查尔斯·达拉帕克）美国特勤局特工于 2008 年 4 月 17 日星期四在宾夕法尼亚州哈弗福德的哈弗福德学院竞选民主党总统候选人希拉里·罗德姆·克林顿（DN.Y.）。（美联社照片/查尔斯·达拉帕克）共和党总统候选人2008 年 5 月 22 日星期四，在加利福尼亚州斯托克顿斯托克顿机场举行的集会上，共和党参议员约翰麦凯恩伸出手握手。（美联社照片/Rich Pedroncelli）与历史悠久的埃德蒙佩特斯大桥在背景中，共和党总统候选人参议员约翰麦凯恩 (R-Ariz.) 于 2008 年 4 月 21 日星期一在阿拉巴马州塞尔玛竞选。麦凯恩回忆起民权游行者在桥上遭到血腥殴打的情景。 （美联社照片/戴夫·马丁）民主党总统候选人希拉里·罗德姆·克林顿 (DN.Y.) 在 2008 年 6 月 2 日星期一在南达科他州扬克顿举行的竞选活动中握手。 (美联社照片/Elise Amendola) 民主党总统候选人参议员. 2008 年 6 月 2 日星期一，DN.Y. 的希拉里·罗德姆·克林顿 (Hillary Rodham Clinton) 在南达科他州扬克顿的竞选活动中握手。（美联社照片/Elise Amendola）\n2008 年 5 月 10 日星期六，前总统比尔克林顿在他的妻子、民主党总统候选人希拉里罗德姆克林顿的竞选活动中与支持者交谈。纽约州克林顿于 2008 年 5 月 28 日星期三在南卡罗来纳州凯尔的小伤口学校举行的竞选活动中向人们致意。（美联社照片/Elise Amendola）民主党总统候选人、民主党参议员巴拉克奥巴马。 ，2008 年 5 月 26 日星期一，在新墨西哥州拉斯克鲁塞斯农场和牧场博物馆举行的阵亡将士纪念日市政厅式会议后握手。（美联社照片/克里斯卡尔森）民主党总统候选人，参议员巴拉克奥巴马，D-Ill .，左下角和他的妻子米歇尔在 2008 年 5 月 17 日星期六在俄勒冈州凯泽举行的鸢尾花节上向人们致意。（美联社照片/Jae C. Hong）民主党总统候选人、民主党参议员巴拉克·奥巴马（Barack Obama）。 2008 年 5 月 16 日星期五，在 SD 沃特敦，中心与支持者握手。（美联社照片/Jae C. Hong）民主党总统2008 年 5 月 13 日星期二，在密苏里州开普吉拉多的 Thorngate Ltd. 举行的市政厅式会议上，充满希望的民主党参议员巴拉克奥巴马与支持者握手。（美联社照片/Jae C. Hong) 民主党总统候选人、伊利诺伊州民主党参议员巴拉克奥巴马（中），在 2008 年 5 月 13 日星期二在密苏里州开普吉拉多的 Thorngate Ltd. 举行市政厅式会议后竞选弗吉尼亚人在他们州的总统初选中投票。 （美联社照片/Jae C. Hong）\n2008 年 5 月 12 日星期一，在肯塔基州路易斯维尔举行的一次集会上发表讲话后，民主党总统候选人、伊利诺伊州民主党参议员巴拉克·奥巴马（右）在溢出区与支持者握手。（美联社照片/Jae C. Hong ) ** 文件 ** 在这张 2008 年 4 月 28 日的档案照片中，民主党总统候选人、民主党参议员巴拉克奥巴马（中）在北卡罗来纳州威尔明顿举行的市政厅式会议上发表讲话后向支持者致意。 （美联社照片/Jae C. Hong，文件）民主党总统候选人巴拉克奥巴马 D-Ill.，2008 年 3 月 22 日星期六在俄勒冈州梅德福举行的市政厅会议上发言后握手。（美联社照片/亚历克斯Brandon) 民主党总统候选人参议员 Barack Obama D-Ill.，2008 年 3 月 19 日星期三，在北卡罗来纳州费耶特维尔的费耶特维尔技术社区学院，在谈论伊拉克和国家安全之前，与外面拥挤的人群握手（美联社照片/亚历克斯布兰登）民主党总统候选人参议员巴拉克奥巴马在 2008 年 3 月 7 日星期五在怀俄明州卡斯珀举行的市政厅会议上发言后握手。（美联社照片/亚历克斯布兰登）", "note_en": "As noted in the  Obama- and  Hillary-Protect series, their Secret Service candidate-protective agents hold their hands at waist height, particularly in crowds, but also when standing guard. Presumably this allows quick action against hands of attackers or to draw weapons. Do other protective and/or law enforcement officers use this hand positioning? Answers or other comments on this, send to cryptome[at]earthlink.net.\n    U.S. Secret Service agents accompany Democratic presidential hopeful, Sen. Hillary Rodham Clinton, D-N.Y., as she campaigns at the intersection of South Beaver and West Market streets in York, Pa., Saturday, April 19, 2008. (AP Photo/Charles Dharapak)\n  U.S. Secret Service agents stand watch as Democratic presidential hopeful Sen. Hillary Rodham Clinton, D-N.Y., campaigns at Haverford College in Haverford, Pa., Thursday, April 17, 2008. (AP Photo/Charles Dharapak)\n  Republican presidential candidate, Sen. John McCain, R-Ariz., reaches out to shake hands during a rally at the Stockton Airport in Stockton, Calif., Thursday, May 22, 2008.(AP Photo/Rich Pedroncelli)\n  With the historic Edmund Pettus Bridge in the background, Republican presidential candidate Sen. John McCain, R-Ariz., campaigns in Selma, Ala., Monday, April 21, 2008. McCain recalled the bloody beating of civil rights marchers on the bridge. (AP Photo/Dave Martin)\n  Democratic presidential hopeful Sen. Hillary Rodham Clinton, D-N.Y., shakes hands at a campaign event in Yankton, S.D., Monday, June 2, 2008. (AP Photo/Elise Amendola)\n  Democratic presidential hopeful Sen. Hillary Rodham Clinton, D-N.Y., shakes hands at a campaign event in Yankton, S.D., Monday, June 2, 2008. (AP Photo/Elise Amendola)\n  Former President Bill Clinton talks with supporters during a campaign appearance for his wife, Democratic presidential hopeful Hillary Rodham Clinton, in Rapid City, S.D., on Saturday, May 10, 2008. (AP Photo/Chet Brokaw)\n  Democratic presidential hopeful Sen. Hillary Rodham Clinton, D-N.Y., greets people at a campaign event at the Little Wound School in Kyle, S.D., Wednesday, May 28, 2008. (AP Photo/Elise Amendola)\n  Democratic presidential hopeful, Sen. Barack Obama, D-Ill., shakes hands after a Memorial Day town hall-style meeting at the Farm and Ranch Museum in Las Cruces, N.M., Monday, May 26, 2008. (AP Photo/Chris Carlson)\n  Democratic presidential hopeful, Sen. Barack Obama, D-Ill., bottom left, and his wife Michelle greet people at the Iris Festival in Keizer, Ore., Saturday, May 17, 2008. (AP Photo/Jae C. Hong)\n  Democratic presidential hopeful Sen. Barack Obama, D-Ill., center, shakes hands with supporters, in Watertown, S.D., Friday, May 16, 2008. (AP Photo/Jae C. Hong)\n  Democratic presidential hopeful, Sen. Barack Obama, D-Ill., left, shakes hands with supporters at a town hall-style meeting held at Thorngate Ltd., in Cape Girardeau, Mo., Tuesday, May 13, 2008. ( (AP Photo/Jae C. Hong)\n  Democratic presidential hopeful, Sen. Barack Obama, D-Ill., center, campaigns after a town hall-style meeting at Thorngate Ltd. in Cape Girardeau, Mo., Tuesday, May 13, 2008, as West Virginians cast their ballots in their state&#39;s presidential primary election. (AP Photo/Jae C. Hong)\n  Democratic presidential hopeful, Sen. Barack Obama, D-Ill., right, shakes hands with supporters in the overflow area after speaking at a rally in Louisville, Ky., Monday, May 12, 2008. (AP Photo/Jae C. Hong)\n  ** FILE ** In this April 28, 2008 file photo, Democratic presidential hopeful, Sen. Barack Obama, D-Ill., center, greets supporters after speaking at a town hall-style meeting in Wilmington, N.C.. (AP Photo/Jae C. Hong, File)\n  Democratic presidential hopeful Sen. Barack Obama D-Ill., shakes hands after speaking at a town hall meeting in Medford, Ore., Saturday, March 22, 2008.(AP Photo/Alex Brandon)\n  Democratic presidential hopeful Sen. Barack Obama D-Ill., shakes hands with the overflow crowd outside prior to speaking about Iraq and national security, Wednesday, March 19, 2008, at Fayetteville Technical Community College in Fayetteville, N.C. (AP Photo/Alex Brandon)\n  Democratic presidential hopeful Sen. Barack Obama D-Ill., shakes hands after speaking at a town hall meeting in Casper, Wyo., Friday, March 7, 2008.(AP Photo/Alex Brandon)", "posttime": "2021-07-24 22:54:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,特勤,service,民主党", "title": "美国特勤局手准备 (2008)", "title_en": "US Secret Service Hands Ready (2008)", "transed": 1, "url": "https://cryptome.org/info/usss-hands/usss-hands.htm", "via": "", "real_tags": ["美国", "特勤", "service", "民主党"]}, {"category": "", "categoryclass": "", "imagename": "95103729d23af04562a7f8194ff509bf.png", "infoid": 1069462, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无人机速度快的原因有很多。除了专业的无人机赛车赛道，当您在灾难现场寻找幸存者、运送货物甚至检查关键基础设施时，速度是个好兆头。但是，当您必须穿越障碍物、不断变化的速度和高度时，如何在电池寿命有限的情况下在尽可能短的时间内完成任务？您使用算法。苏黎世大学 (UZH) 的研究人员开发了一种算法，该算法可以找到最快的轨迹，以引导自主无人机通过线路上的一系列航点。这个算法不仅好，而且非常好。正如 UZH 机器人和感知小组负责人 Davide Scaramuzza 解释的那样：我们的无人机在实验赛道上击败了两名世界级人类飞行员的最快圈速。这场比赛是如何失败的：研究人员让算法和两名人类飞行员驾驶同一架无人机穿过赛道。现场有外部摄像头。这些摄像头切断了两个目的：在自主无人机的情况下，它们向算法提供有关无人机在任何时刻所处位置的实时信息 公平地说，研究人员确实给了人类无人机赛车飞行员时间在赛道上进行训练比赛前。但是算法赢了。它不仅所有的圈数都比人类快，而且它的表现也更加稳定。这是因为，与人类飞行员不同，一旦算法找到了最佳轨迹，它就可以根据需要多次完美地模仿它。告诉斯卡拉穆扎：\n该算法的新颖之处在于，它率先生成了充分考虑无人机局限性的时间最优轨迹。关键思想是，我们的算法只是告诉无人机通过所有航路点，而不是将飞行路径的各个部分分配给特定航路点，而不是如何或何时这样做。现在，该算法可能已被证明是成功的，但尚未准备好用于商业应用。那是因为它的计算需求是巨大的。计算机需要长达一个小时来计算无人机的最快轨迹。此外，现在，无人机依靠外部摄像头来确定它在任何给定时刻的位置。未来，科学家们希望使用机载相机进行空间认知。因此，在他们继续研究新算法的同时，您可以查看他们真实世界的敏捷飞行镜头，以了解有关应用方法的更多信息：您正在阅读 DroneDJ — 每天发布有关 DJI 和更广泛无人机生态系统新闻的专家一天之后。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 DroneDJ 以了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作方法，并订阅我们的 YouTube 频道。", "note_en": "There are many reasons for drones to be quick. The professional drone racing circuit aside, speed bodes well when you are searching for survivors on a disaster site, or delivering cargo, or even  inspecting critical infrastructure. But how do you get something done in the shortest possible time with limited battery life when you have to navigate through obstacles, changing speeds, and altitude? You use an algorithm.\n  Researchers at the University of Zurich (UZH) have developed an algorithm that can find the quickest trajectory to guide an autonomous drone through a series of waypoints on a circuit.\n This algorithm is not just good, it’s extremely good. As Davide Scaramuzza, who heads the Robotics and Perception Group at UZH,  explains:\n Our drone beat the fastest lap of two world-class human pilots on an experimental race track.\n  Here’s how that race went down: The researchers had the algorithm and two human pilots fly the same drone through a race circuit. There were external cameras on the scene. These cameras severed two purposes:\n In the case of the autonomous drone, they provided real-time information to the algorithm on where the drone was at any moment\n To be fair, the researchers did give the human drone racing pilots time to train on the circuit before the race. But the algorithm won. Not only were all its laps faster than the human ones but its performance was also more consistent. And that’s because, unlike human pilots, once the algorithm has found the best trajectory, it can just mimic it flawlessly as many times as needed. Tells Scaramuzza:\n The novelty of the algorithm is that it is the first to generate time-optimal trajectories that fully consider the drone’s limitations.\n  The key idea is, rather than assigning sections of the flight path to specific waypoints, that our algorithm just tells the drone to pass through all waypoints, but not how or when to do that.\n  Now, the algorithm may have proven a success, it’s not ready for commercial applications yet. And that’s because its computational demands are huge. The computer needs up to an hour to calculate the quickest trajectory for the drone. Also, right now, the drone relies on external cameras to figure out where it is at any given moment. In the future, scientists want to use onboard cameras for spatial cognition.\n So, while they continue their work on the novel algorithm, you can check out their real-world agile flight footage to learn more about the methods applied:\n  You’re reading DroneDJ — experts who break news about DJI and the wider drone ecosystem, day after day. Be sure to check out our  homepage for all the latest news, and follow DroneDJ on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our exclusive stories,  reviews, how-tos, and subscribe to our  YouTube channel.", "posttime": "2021-07-24 22:17:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,fast,无人机", "title": "比快还快：观看算法击败人类无人机赛车飞行员", "title_en": "Faster than fast: Watch an algorithm beat human drone racing pilots", "transed": 1, "url": "https://dronedj.com/2021/07/22/ai-beats-human-drone-racing-pilot/", "via": "", "real_tags": ["算法", "fast", "无人机"]}]