[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1074531, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "mold 1.1是高性能连接器的新版本。它包含一些新的主要功能和各种错误修复。\n从这个版本开始，我们不仅分发源代码，还分发Linux的预编译二进制文件。您可以在页面底部下载包含mold可执行文件的tar文件。您可以将tar文件的内容复制到/usr/local，也可以直接指定其完整路径，在不安装的情况下直接使用。\n增加了本地LTO（链路时间优化）支持。用于调用ld的模具。bfd或ld。lld，如果遇到GCC IR（中间表示）文件或LLVM IR文件分别将任务委托给支持LTO的链接器。现在，mold直接处理IR文件。此功能是使用链接器插件API实现的，GNU ld和GNU gold也使用该API。请注意，添加LTO支持是为了完整性，而不是速度。mold只比LTO构建的其他链接器稍微快一点，因为不是链接而是代码优化占主导地位。（公元前46995年）\nRISC-V（RV64）现在被支持作为主机和目标平台。mold可以连接现实世界中的大型程序，例如mold本身或RISC-V的LLVM Clang（e76f7c0）\n支持-emit relocs选项。如果提供了该选项，mold会将重定位节从输入文件复制到输出文件。这个功能被一些链接后二进制优化或分析工具使用，比如Facebook&#39；这是螺栓。（2007年2月26日）\nmold获得了--shuffle区段选项。如果给出了该选项，链接器会随机调整输入部分的顺序，然后在虚拟地址空间中固定它们的地址。此功能在某些情况下很有用。首先，它可以用作ASLR（地址空间布局随机化）的一种强大形式。其次，当您对其他一些程序进行基准测试以获得更可靠的基准数字时，可以启用它，因为即使是相同的机器代码，如果它们在虚拟地址空间中的布局不同，其性能也会有所不同。你要确保你得到了好的/坏的基准数据，而不是巧合，通过洗牌输入部分。（7e91897）\n添加了--print dependencies和--print dependencies=full选项。它们以CSV格式打印输入文件之间的依赖关系。也就是说，他们打印出关于哪个文件的信息取决于使用哪个符号的文件。我们添加这个特性时考虑了几个用例。首先，您可以使用它来分析为什么某个对象文件被从存档中取出并链接到输出文件。第二，当您想要消除对某个库的所有依赖关系时，使用此功能可以很容易地找到所有依赖关系。请注意，这是一个实验性特征，可能会在模具的特征版本中更改或删除。（a1287c2）\n现在，PT_GNU_RELRO段与下一页边界对齐。之前，mold没有&#39；t向上对齐，运行时加载程序向下对齐，因此最后一个部分页面将不受RELRO机制的保护。现在，整个RELRO段保证在运行时是只读的。（0a0f9b3）\n这个得到了。如果现在给出-z，plt段现在由RELRO保护。这是可能的，因为写入。得到了。只有在进程启动时解决了所有符号，plt才会在进程启动期间发生。（73159e2）\n之前，mold报告了一个错误，如果使用旧的GCC（使用-fgnu unique）创建的对象文件与使用新的GCC或Clang（使用-fno gnu unique）创建的对象文件混合（#324）。现在，mold接受这样的输入文件。（e65c5d2）\n霉菌产生。symtab section现在包含section符号和从输入共享对象文件派生的符号。（e4c03c2，1550b5a）\n模具生成的可执行文件现在可以在valgrind下运行。之前，valgrind在启动时由于断言失败而中止，因为它没有&#39；I don’我不指望一个可执行文件同时具有这两种功能。bss和。dynbss部分。霉菌产生。dynbss包含复制重新定位的符号。该部分已重命名。copyrel解决valgrind和#39；这是个问题。（0f8bf23）", "note_en": "mold 1.1 is a new release of the high-performance linker. It contains a few new major features and various bug fixes.\n Starting from this release, we distribute not only source but pre-compiled binaries for Linux. You can download a tar file containing  mold executable at the bottom of the page. You can copy the contents of the tar file to  /usr/local or just use without installation by directly specifying its full path.\n  Native LTO (link-time optimization) support has been added. mold used to invoke  ld.bfd or  ld.lld if it encountered a GCC IR (intermediate representation) file or an LLVM IR file to delegate the task to the LTO-capable linkers, respectively. Now, mold handles IR files directly. This feature is implemented using the linker plugin API which is also used by GNU ld and GNU gold. Note that the LTO support has been added for completeness and not for speed. mold is only marginally faster than the other linkers for LTO builds because not linking but code optimization dominates. (  46995bc)\n RISC-V (RV64) is now supported as both host and target platforms. mold can link real-world large programs such as mold itself or LLVM Clang for RISC-V. (  e76f7c0)\n The  -emit-relocs option is supported. If the option is given, mold copies relocation sections from input files to an output file. This feature is used by some post-link binary optimization or analysis tools such as Facebook&#39;s Bolt. (  26fe71d)\n mold gained the  --shuffle-sections option. If the option is given, the linker randomly shuffle the order of input sections before fixing their addresses in the virtual address space. This feature is useful in some situations. First, it can be used as a strong form of ASLR (address space layout randomization). Second, you can enable it when you are benchmarking some other program to get more reliable benchmark numbers, because even the same machine code can vary in performance if they are laid out differently in the virtual address space. You want to make sure that you got good/bad benchmark numbers not by coincidence by shuffling input sections. (  7e91897)\n The  --print-dependencies and  --print-dependencies=full options were added. They print out dependencies between input files in the CSV format. That is, they print out the information as to which file depends on which file to use which symbol. We added this feature with a few use cases in mind. First, you can use this to analyze why some object file was pulled out from an archive and got linked to an output file. Second, when you want to eliminate all dependencies to some library, you can find all of them very easy with this feature. Note that this is an experimental feature and may change or removed in feature releases of mold. (  a1287c2)\n  A  PT_GNU_RELRO segment is now aligned up to the next page boundary. Previously, mold didn&#39;t align it up, and the runtime loader align it  down, so the last partial page would not be protected by the RELRO mechanism. Now, the entire RELRO segment is guaranteed to be read-only at runtime. (  0a0f9b3)\n The  .got.plt section is now protected by RELRO if  -z now is given. This is possible because writes to  .got.plt happen only during process startup if all symbols are resolved on process startup. (  73159e2)\n Previously, mold reported an error if object files created with old GCC (with  -fgnu-unique) are mixed with ones created with newer GCC or Clang (with  -fno-gnu-unique) ( #324). Now, mold accepts such input files. (  e65c5d2)\n  mold-generated  .symtab section now contains section symbols and symbols derived from input shared object files. (  e4c03c2,   1550b5a)\n mold-generated executables can now run under valgrind. Previously, valgrind aborted on startup due to an assertion failure because it didn&#39;t expect for an executable to have both  .bss and  .dynbss sections. mold generated  .dynbss to contain copy-relocated symbols. The section has been renamed  .copyrel to workaround the valgrind&#39;s issue. (  0f8bf23)", "posttime": "2022-02-22 02:17:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模具,mold,文件", "title": "模具1.1", "title_en": "Mold 1.1", "transed": 1, "url": "https://github.com/rui314/mold/releases/tag/v1.1", "via": "", "real_tags": ["模具", "mold", "文件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074530, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个扩展将缩略图替换为视频中的一个帧，有效地消除了任何点击诱饵，同时仍然显示高质量的缩略图，这样您仍然可以很好地了解视频的内容。它还可以修改标题以停止部分或全部大写标题。它在Youtube上无处不在，包括主页、趋势页面、订阅页面和频道页面。还有手机。通过单击右上角的扩展图标，可以自定义扩展的所有功能。如果打开youtube选项卡，则无需重新加载页面，您可以立即看到不同选项的效果。这个扩展可能会帮助那些对Youtube上瘾的人或任何不上瘾的人&#39；我不想在寻找高质量内容的同时被浮华的缩略图和全大写标题分散注意力。源代码：https://github.com/pietervanheijningen/clickbait-remover-for-youtubeChrome版本：https://chrome.google.com/webstore/detail/clickbait-remover-for-you/omoinegiohhgbikclijaniebjpkeopip", "note_en": "This extension replaces thumbnails with a frame from the video, effectively removing any clickbait while still showing a high quality thumbnail so you can still get a good idea of what the video is about. It can also modify titles to stop partial or all caps titles.  It works everywhere on Youtube including the homepage, trending page, subscription page and channel pages. And also on mobile.  All functionality of the extension is customizable by clicking the extension icon on the top right, you can see the effect that different options have right away if you have a youtube tab open, no need to reload the page.  This extension might help people who have a Youtube addiction or anyone who just doesn&#39;t want to be distracted by flashy thumbnails and all caps titles while trying to find some quality content.  Source code:  https://github.com/pietervanheijningen/clickbait-remover-for-youtube Chrome version:  https://chrome.google.com/webstore/detail/clickbait-remover-for-you/omoinegiohhgbikclijaniebjpkeopip", "posttime": "2022-02-22 02:16:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,remover", "title": "Clickbait remover for YouTube：一个规范化视频列表的FF插件", "title_en": "Clickbait remover for YouTube: a FF addon to normalize video lists", "transed": 1, "url": "https://addons.mozilla.org/en-US/firefox/addon/clickbait-remover-for-youtube/", "via": "", "real_tags": ["youtube", "remover"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074528, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "[1]  .  2016.  . 第12届USENIX操作系统设计与实现研讨会论文集。USENIX，265–283。谷歌学者数字图书馆\n[2]   2018.  . 现场可编程逻辑和应用国际会议记录。IEEE，411-418。谷歌学者交叉参考\n[5]  .  2016.  . 在《国际机器学习会议记录》上发表。173– 182.   谷歌学者\n[6]  .  2017.  . 现场可编程门阵列ACM/SIGDA国际研讨会论文集。ACM，55-64岁。谷歌学者数字图书馆\n[7]  .  2012.  . 在现场可编程定制计算机年度国际研讨会上发表。IEEE，93-96。谷歌学者数字图书馆\n[8]  .  2017.  . 在IEEE国际电路与系统研讨会（ISCAS）上，1– 4.   谷歌学者\n[9]  .  2014.  . 在计算机前沿的ACM会议记录中。ACM，3。谷歌学者数字图书馆\n[10]  .  2018.  . 在USENIX操作系统设计与实现研讨会论文集上，578– 594.   谷歌学者\n[11]  .  2019.  . 现场可编程门阵列ACM/SIGDA国际研讨会论文集。ACM，73-82。谷歌学者数字图书馆\n[12]  .  2020.  . 在2020年IEEE高性能计算机体系结构国际研讨会上发表。IEEE，220-233。谷歌学者交叉参考\n[13]  .  2014.  . 在现场可编程定制计算机年度国际研讨会上发表。IEEE，9-16。谷歌学者交叉参考\n[14]  .  2014.  . 现场可编程技术国际会议记录。IEEE，330-333。谷歌学者交叉参考\n[15] Daniel Firestone、Andrew Putnam、Sambrama Mundkur、Derek Chiou、Alireza Dabagh、Mike Andrewatha、Hari Angepat、Vivek Bhanu、Adrian Caulfield、Eric Chung、Harish Kumar Chandrappa、Somesh Chaturmohta、Matt Humphrey、Jack Lavier、Norman Lam、Fengfen Liu、Kalin Ovtcharov、Jitu Padhey、Gautham Popuri、Shachar Raindel、Tejas Sapre、Mark Shaw、，Gabriel Silva、Madhan Sivakumar、Nisheeth Srivastava、Anshuman Verma、Qasim Zuhair、Deepak Bansal、Doug Burger、Kushagra Vaid、David A.Maltz和Albert Greenberg。2018.  . 在USENIX网络系统设计与实现研讨会论文集上发表。乌塞尼克斯，51-66岁。谷歌学者\n[16] Jeremy Fowers、Kalin Ovtcharov、Michael Papamichael、Todd Massengill、Liu Ming、Daniel Lo、Shlomi Alkay、Michael Haselman、Logan Adams、Mahdi Ghandi、Stephen Heil、Prerak Patel、Adam Sapek、Gabriel Weisz、Lisa Woods、Sitaram Lanka、Steven K.Reinhardt、Adrian M.Caulfield、Eric S.Chung和Doug Burger。2018.  . 《计算机体系结构国际年会论文集》。IEEE，1-14。谷歌学者\n[17]  .  2017.  .   IEEE集成电路和系统的计算机辅助设计学报37,1（2017），35–47。谷歌学者交叉参考\n[18]  .  2019.  .   关于可重构技术和系统的ACM交易12，1（2019），2。谷歌学者数字图书馆\n[19]  .  2020.  . 2020年ACM/IEEE第47届计算机体系结构国际年会论文集。IEEE，982-995。谷歌学者数字图书馆\n[20] 宋汉、康俊龙、毛惠子、胡一鸣、李新立、李玉斌、谢东亮、罗红、宋尧、王宇、杨华忠和威廉·J·戴利。2017.  . 现场可编程门阵列ACM/SIGDA国际研讨会论文集。ACM，75-84。谷歌学者数字图书馆\n[21]  .  2016.  . 在IEEE计算机视觉和模式识别会议记录中。IEEE，770-778。谷歌学者交叉参考\n[23]  .  2019.  . 2019年IEEE实时与嵌入式技术与应用研讨会论文集。29– 41.  内政部：https://doi.org/10.1109/RTAS.2019.00011谷歌学者交叉参考\n[25]  .  2019.  . 2019年IEEE实时系统研讨会论文集。326– 338.  内政部：https://doi.org/10.1109/RTSS46320.2019.00037谷歌学者交叉参考\n[26]  .  2018.  . 在《第13届操作系统设计与实现研讨会论文集》中。107– 127.   谷歌学者\n[27]奥利弗·克诺德尔、保罗·R·根斯勒和雷纳·G·斯帕莱克。2017.虚拟化可重构硬件，在云架构中提供可扩展性。参加国际电路、电子和微电子进展会议（CENICS）。33–38.   谷歌学者\n[28]  .  2013.  . 在《第16届设计、自动化与工程学报》；欧洲测试会议和展览。谷歌学者\n[29]  .  2020.  .   IEEE Micro 40，2（2020），8–16。谷歌学者交叉参考\n[30]  .  2019.  . 2019年IEEE第27届现场可编程定制计算机国际年会论文集。IEEE，199–207。谷歌学者交叉参考\n[34]  .  2016.  . 在IEEE热芯片研讨会上发表。IEEE。谷歌学者\n[36]安德鲁·普特南、阿德里安·M·考尔菲尔德、埃里克·S·钟、德里克·邱、凯普罗斯·康斯坦丁尼德斯、约翰·德姆、哈迪·埃斯迈伊尔扎德、杰里米·福沃斯、戈皮·普拉尚斯·戈帕尔、扬·格雷、迈克尔·哈塞尔曼、斯科特·豪克、斯蒂芬·海尔、阿米尔·霍尔马蒂、朱杨·金、西塔兰卡、詹姆斯·拉鲁斯、埃里克·彼得森、西蒙·波普、亚伦·史密斯、杰森·通、菲利普·伊肖、，还有道格汉堡。2014.  .   SIGARCH计算机架构新闻42,3（2014），13-24。谷歌学者数字图书馆\n[37]  .  2020.  . 第57届ACM/IEEE设计自动化会议论文集。1– 6.  内政部：https://doi.org/10.1109/DAC18072.2020.9218652谷歌学者交叉参考\n[38]  .  2018.  . 第28届现场可编程逻辑与应用国际会议记录。IEEE，89-897。谷歌学者交叉参考\n[40]  .  2016.  . 在IEEE计算机视觉和模式识别会议记录中。IEEE，2818–2826。谷歌学者交叉参考\n[41]  .  2018.  . 现场可编程逻辑和应用国际会议记录。IEEE，131-138。谷歌学者交叉参考\n[44]  .  2019.  .   IEEE集成电路和系统的计算机辅助设计学报39,10（2019），2668–2681。谷歌学者\n[45]  .  2018.  .   IEEE集成电路和系统的计算机辅助设计学报38，11（2018），2072–2085。谷歌学者\n[46]  .  2018.  . 在《计算机辅助设计国际会议记录》上发表。ACM，56岁。谷歌学者数字图书馆", "note_en": "[1]  .  2016.  . In   Proceedings of the 12th USENIX Symposium on Operating Systems Design and Implementation. USENIX,  265– 283.   Google Scholar    Digital Library\n [2]   2018.  . In   Proceedings of the International Conference on Field Programmable Logic and Applications. IEEE,  411– 418.   Google Scholar    Cross Ref\n   [5]  .  2016.  . In   Proceedings of the International Conference on Machine Learning.  173– 182.   Google Scholar\n [6]  .  2017.  . In   Proceedings of the ACM/SIGDA International Symposium on Field-Programmable Gate Arrays. ACM,  55– 64.   Google Scholar    Digital Library\n [7]  .  2012.  . In   Proceedings of the Annual International Symposium on Field-Programmable Custom Computing Machines. IEEE,  93– 96.   Google Scholar    Digital Library\n [8]  .  2017.  . In   IEEE International Symposium on Circuits and Systems (ISCAS).  ,  1– 4.   Google Scholar\n [9]  .  2014.  . In   Proceedings of the ACM Conference on Computing Frontiers. ACM,  3.   Google Scholar    Digital Library\n [10]  .  2018.  . In   Proceedings of the USENIX Symposium on Operating Systems Design and Implementation.  ,  578– 594.   Google Scholar\n [11]  .  2019.  . In   Proceedings of the ACM/SIGDA International Symposium on Field-Programmable Gate Arrays. ACM,  73– 82.   Google Scholar    Digital Library\n [12]  .  2020.  . In   Proceedings of the 2020 IEEE International Symposium on High Performance Computer Architecture. IEEE,  220– 233.   Google Scholar    Cross Ref\n [13]  .  2014.  . In   Proceedings of the Annual International Symposium on Field-Programmable Custom Computing Machines. IEEE,  9– 16.   Google Scholar    Cross Ref\n [14]  .  2014.  . In   Proceedings of the International Conference on Field-Programmable Technology. IEEE,  330– 333.   Google Scholar    Cross Ref\n [15]  Daniel Firestone, Andrew Putnam, Sambhrama Mundkur, Derek Chiou, Alireza Dabagh, Mike Andrewartha, Hari Angepat, Vivek Bhanu, Adrian Caulfield, Eric Chung, Harish Kumar Chandrappa, Somesh Chaturmohta, Matt Humphrey, Jack Lavier, Norman Lam, Fengfen Liu, Kalin Ovtcharov, Jitu Padhye, Gautham Popuri, Shachar Raindel, Tejas Sapre, Mark Shaw, Gabriel Silva, Madhan Sivakumar, Nisheeth Srivastava, Anshuman Verma, Qasim Zuhair, Deepak Bansal, Doug Burger, Kushagra Vaid, David A. Maltz, and Albert Greenberg.  2018.  . In   Proceedings of the USENIX Symposium on Networked Systems Design and Implementation. USENIX,  51– 66.   Google Scholar\n [16]  Jeremy Fowers, Kalin Ovtcharov, Michael Papamichael, Todd Massengill, Ming Liu, Daniel Lo, Shlomi Alkalay, Michael Haselman, Logan Adams, Mahdi Ghandi, Stephen Heil, Prerak Patel, Adam Sapek, Gabriel Weisz, Lisa Woods, Sitaram Lanka, Steven K. Reinhardt, Adrian M. Caulfield, Eric S. Chung, and Doug Burger.  2018.  . In   Proceedings of the Annual International Symposium on Computer Architecture. IEEE,  1– 14.   Google Scholar\n [17]  .  2017.  .   IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems  37,  1 ( 2017),  35– 47.   Google Scholar    Cross Ref\n [18]  .  2019.  .   ACM Transactions on Reconfigurable Technology and Systems  12,  1 ( 2019),  2.   Google Scholar    Digital Library\n [19]  .  2020.  . In   Proceedings of the 2020 ACM/IEEE 47th Annual International Symposium on Computer Architecture. IEEE,  982– 995.   Google Scholar    Digital Library\n [20]  Song Han, Junlong Kang, Huizi Mao, Yiming Hu, Xin Li, Yubin Li, Dongliang Xie, Hong Luo, Song Yao, Yu Wang, Huazhong Yang, and William J. Dally.  2017.  . In   Proceedings of the ACM/SIGDA International Symposium on Field-Programmable Gate Arrays. ACM,  75– 84.   Google Scholar    Digital Library\n [21]  .  2016.  . In   Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. IEEE,  770– 778.   Google Scholar    Cross Ref\n  [23]  .  2019.  . In   Proceedings of the 2019 IEEE Real-Time and Embedded Technology and Applications Symposium.  29– 41.  DOI:  https://doi.org/10.1109/RTAS.2019.00011   Google Scholar    Cross Ref\n  [25]  .  2019.  . In   Proceedings of the 2019 IEEE Real-Time Systems Symposium.  326– 338.  DOI:  https://doi.org/10.1109/RTSS46320.2019.00037   Google Scholar    Cross Ref\n [26]  .  2018.  . In   Proceedings of the 13th  \\(\\lbrace\\)USENIX \\(\\rbrace\\) Symposium on Operating Systems Design and Implementation.  107– 127.   Google Scholar\n [27]  Oliver Knodel, Paul R. Genssler, and Rainer G. Spallek. 2017. Virtualizing reconfigurable hardware to provide scalability in cloud architectures. In  International Conference on Advances in Circuits, Electronics and Micro-electronics (CENICS). 33–38.   Google Scholar\n [28]  .  2013.  . In   Proceedings of the 16th Design, Automation &amp; Test in Europe Conference and Exhibition.   Google Scholar\n [29]  .  2020.  .   IEEE Micro  40,  2 ( 2020),  8– 16.   Google Scholar    Cross Ref\n [30]  .  2019.  . In   Proceedings of the 2019 IEEE 27th Annual International Symposium on Field-Programmable Custom Computing Machines. IEEE,  199– 207.   Google Scholar    Cross Ref\n    [34]  .  2016.  . In   Proceedings of the IEEE Hot Chips Symposium. IEEE.   Google Scholar\n  [36]  Andrew Putnam, Adrian M. Caulfield, Eric S. Chung, Derek Chiou, Kypros Constantinides, John Demme, Hadi Esmaeilzadeh, Jeremy Fowers, Gopi Prashanth Gopal, Jan Gray, Michael Haselman, Scott Hauck, Stephen Heil, Amir Hormati, Joo-Young Kim, Sitaram Lanka, James Larus, Eric Peterson, Simon Pope, Aaron Smith, Jason Thong, Phillip Yi Xiao, and Doug Burger.  2014.  .   SIGARCH Computer Architecture News  42,  3 ( 2014),  13– 24.   Google Scholar    Digital Library\n [37]  .  2020.  . In   Proceedings of the 57th ACM/IEEE Design Automation Conference.  1– 6.  DOI:  https://doi.org/10.1109/DAC18072.2020.9218652   Google Scholar    Cross Ref\n [38]  .  2018.  . In   Proceedings of the 28th International Conference on Field Programmable Logic and Applications. IEEE,  89– 897.   Google Scholar    Cross Ref\n  [40]  .  2016.  . In   Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. IEEE,  2818– 2826.   Google Scholar    Cross Ref\n [41]  .  2018.  . In   Proceedings of the International Conference on Field Programmable Logic and Applications. IEEE,  131– 138.   Google Scholar    Cross Ref\n   [44]  .  2019.  .   IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems 39, 10 ( 2019), 2668–2681.   Google Scholar\n [45]  .  2018.  .   IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems 38, 11 ( 2018), 2072–2085.   Google Scholar\n [46]  .  2018.  . In   Proceedings of the International Conference on Computer-Aided Design. ACM,  56.   Google Scholar    Digital Library", "posttime": "2022-02-22 02:07:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟化,云中,fpga,国际", "title": "一个用于云中通用DNN的统一FPGA虚拟化框架", "title_en": "A Unified FPGA Virtualization Framework for General-Purpose DNN in the Cloud", "transed": 1, "url": "https://dl.acm.org/doi/10.1145/3480170", "via": "", "real_tags": ["虚拟化", "云中", "fpga", "国际"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074527, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "模糊化是在软件程序中发现安全漏洞最广泛、最成功的方法之一。Fuzzing工具会自动随机生成程序的输入，并使用这些输入运行程序，直到程序崩溃。这些崩溃通常表示存在可被攻击者利用的安全漏洞。\n但是，想要利用该程序进行攻击的攻击者也可以使用模糊技术。因此，我们能否使我们的程序难以模糊化，从而使攻击者无法检测到我们程序中的任何隐藏漏洞？为了找到答案，本文的作者开发了一些策略，使得模糊化程序变得困难。他们确定了现有模糊化工具成功工作所依赖的一些假设，然后开发了一个工具AntiFuzz，可用于修改目标程序并阻止模糊化。一些假设和对策包括：\n模糊程序试图利用覆盖率信息生成可以跨越程序代码所有部分的输入。因此，如果我们能让我们的程序返回虚假的覆盖信息，模糊化将受到极大的阻碍。为了实现这一点，AntiFuzz为程序的每个输入返回不同的虚假覆盖信息。\n模糊程序监控操作系统以检测程序崩溃。为了应对这种情况，AntiFuzz向操作系统发送虚假的崩溃信号。\n模糊程序需要每秒执行多次程序才能有效运行。由于fuzzers生成的大多数输入都是错误的，因此当反模糊程序检测到这些输入时，它会减慢程序的速度。虽然正常用户不会注意到这种减速，但它会严重阻碍fuzzer的高效运行。\n为了看看他们的方法是否真的有效，作者使用了四种不同的最先进的模糊器来模糊一组包含几个bug的目标程序。他们的结果表明，在采取所有应对措施时，AntiFuzz成功地阻止了之前检测到的所有漏洞的检测。\n我喜欢他们阻止模糊化的方法，因为它结合了多种措施。然而，通过使公开部署和可访问的程序版本抵抗模糊化，这将使模糊化操作仅限于程序开发人员，从而妨碍同样依赖模糊化的安全研究人员和白帽黑客检测安全漏洞。\nGulerantifuzzz2019 Emre Güler、Cornelius Aschermann、Ali Abbasi和Thorsten Holz:&#34；反模糊：阻碍二进制可执行文件的模糊审计；。2019年USENIX安全研讨会。\n计算机安全中的一种通用防御策略是增加成功攻击的计算资源和人力成本。在二进制安全领域，这通常是通过使用模糊处理方法来阻止逆向工程和搜索软件漏洞来实现的。然而，最近在自动错误查找方面的趋势改变了操作方式。如今，通过各种模糊工具发现bug是很常见的。由于越来越多的自动化和对更好的模糊策略的研究，对数百个目标进行大规模、拖网式模糊变得可行。正如我们所展示的，当前的模糊处理技术旨在增加人类理解的成本，对减缓模糊化几乎没有作用。\n在本文中，我们介绍了几种技术，以保护二进制可执行文件不受基于模糊、符号/协同执行和污染辅助模糊（通常称为混合模糊）的自动缺陷发现方法的分析的影响。更具体地说，我们对缺陷发现工具的基本假设进行系统分析，并为每个假设制定一般对策。请注意，这些技术不是针对模糊工具的特定实现而设计的，而是针对bug查找工具必须依赖的一般假设。我们的评估表明，这些技术有效地阻止了模糊审计，同时带来了微不足道的性能开销。正如模糊处理技术增加了发现漏洞所需的人力，我们的技术也使得基于模糊处理的自动化方法无效。", "note_en": "Fuzzing is one of the most widely used and successful methods of finding security vulnerabilities in software programs. Fuzzing tools automatically and randomly generates input to a program, and run the program using these inputs until it crashes. These crashes usually indicate the presence of a security vulnerability that can be exploited by an attacker.\n  But fuzzing can also be used by attackers who want to exploit the program. Can we therefore make our program difficult to fuzz so an attacker can not detect any hidden vulnerability in our program? To find out, the authors of this paper developed strategies that make fuzzing a program difficult. They identified some assumptions that existing fuzzing tools depend on to work successfully then developed a tool, AntiFuzz, that can be used to modify the target program and impede fuzzing. Some assumptions and counter-measures include:\n  Fuzzers try to generate inputs that can transverse all parts of the program code using coverage information. Hence, if we can make our program return false coverage information, fuzzing would be significantly impeded. To achieve this, AntiFuzz returns different, fake coverage information for each input to the program.\n  Fuzzers monitor the operating system in order to detect program crashes. To counter this, AntiFuzz sends fake crash signals to the operating systems.\n  Fuzzers need to execute the program many times per second in order to operate efficiently. Since most of the input generated by the fuzzers is malformed, AntiFuzz slows the program down when it detects such inputs.\tWhile this slowdown would not be noticed by a normal user, it can significantly impede the efficient operation of the fuzzer.\n  To see if their approach actually worked, the authors used four different state-of-the-art fuzzers to fuzz a set of target programs which contained several bugs. Their results show that AntiFuzz successfully prevented the detection of all bugs previously detected when all the counter-measures were applied.\n  I love their approach to impeding fuzzing because it combines multiple measures. However, by making the publicly deployed and accessible version of a program resistant to fuzzing, this would restrict the fuzzing operation to only the program developers, impeding the detection of security vulnerabilities by security researchers and white hat hackers who also rely on fuzzing.\n GulerAntifuzz2019 Emre Güler, Cornelius Aschermann, Ali Abbasi, and Thorsten Holz: &#34; AntiFuzz: Impeding Fuzzing Audits of Binary Executables&#34;.  2019 USENIX Security Symposium.\n A general defense strategy in computer security is to increase the cost of successful attacks in both computational resources as well as human time. In the area of binary security, this is commonly done by using obfuscation methods to hinder reverse engineering and the search for software vulnerabilities. However, recent trends in automated bug finding changed the modus operandi. Nowadays it is very common for bugs to be found by various fuzzing tools. Due to ever-increasing amounts of automation and research on better fuzzing strategies, large-scale, dragnet-style fuzzing of many hundreds of targets becomes viable. As we show, current obfuscation techniques are aimed at increasing the cost of human understanding and do little to slow down fuzzing.\n  In this paper, we introduce several techniques to protect a binary executable against an analysis with automated bug f inding approaches that are based on fuzzing, symbolic/concolic execution, and taint-assisted fuzzing (commonly known as hybrid fuzzing). More specifically, we perform a systematic analysis of the fundamental assumptions of bug finding tools and develop general countermeasures for each assumption. Note that these techniques are not designed to target specific implementations of fuzzing tools, but address general assumptions that bug finding tools necessarily depend on. Our evaluation demonstrates that these techniques effectively impede fuzzing audits, while introducing a negligible performance overhead. Just as obfuscation techniques increase the amount of human labor needed to find a vulnerability, our techniques render automated fuzzing-based approaches futile.", "posttime": "2022-02-22 02:05:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "二进制,impeding,程序", "title": "反模糊：阻碍二进制可执行文件的模糊审计", "title_en": "AntiFuzz: Impeding Fuzzing Audits of Binary Executables", "transed": 1, "url": "https://neverworkintheory.org/2022/02/21/antifuzz.html", "via": "", "real_tags": ["二进制", "impeding", "程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074526, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GCC/gcov代码覆盖率数据从实际嵌入式系统中提取，无需文件系统、操作系统或标准C库。\n有关概述，请参阅repo中的PDF幻灯片文件，有关嵌入式系统自定义选项的更多信息，请参阅github wiki。另请参见repo中的简单Linux可编译示例。\n#包括&#34；gcov_公共。h&#34；…//希望尽早调用它，//但在//设置陷阱表和系统内容之前无法调用它//可能并非所有系统都需要，具体取决于启动代码_gcov_call_constructors（）；…案例9://我的系统中的命令_gcov_exit（）；//转储数据中断；…", "note_en": "GCC/gcov code coverage data extraction from the actual embedded system, without requiring a file system, or an operating system, or standard C libraries.\n See the PDF slide file in the repo for an overview, and see the github wiki for more information about customization options for your embedded system. Also see the simple Linux-compilable example in the repo.\n  #include &#34;gcov_public.h&#34;…        // want this as early as possible,        // but cannot call this until after        // the trap table and system stuff are set up // may not be needed in all systems, depending on startup code        __gcov_call_constructors();…                                case 9: // a command in my system                                        __gcov_exit(); // dumps the data break;…", "posttime": "2022-02-22 02:04:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,gcc,gcov", "title": "从目标中提取GCC/gcov代码覆盖率数据，无需FS、OS或Libc", "title_en": "GCC/gcov code coverage data extraction from the target, without FS, OS, or Libc", "transed": 1, "url": "https://github.com/nasa-jpl/embedded-gcov", "via": "", "real_tags": ["代码", "gcc", "gcov"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074525, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们依赖您的支持：本网站主要由广告支持。在过去的16年里，广告让这个网站得以维持。我们尽最大努力确保只显示干净、相关的广告，当发现任何恶意广告时，我们会尽快将其删除。如果您想查看没有广告的网站，同时仍然支持我们的工作，请考虑我们的广告免费PuroNox溢价。你也可以通过贝宝考虑小费。虽然PostgreSQL通过其TOAST存储支持压缩，并且在过去的一年中为其建立了LZ4压缩支持，以及压缩WAL、备份压缩和其他用途，但PostgreSQL开发人员正准备通过Zstd支持进一步扩展其压缩能力。", "note_en": "We Rely On Your Support: This site is primarily supported by advertisements.  Ads are what have allowed this site to be maintained for the past 16 years. We do our best to ensure only clean, relevant ads are shown, when any nasty ads are detected, we work to remove them ASAP. If you would like to view the site without ads while still supporting our work,  please consider  our ad-free Phoronix Premium. You can also consider  a tip via PayPal.   While PostgreSQL has supported compression with its TOAST storage and over the past year has built-up LZ4 compression support for it along with compressing the WAL, backup compression, and other usage, PostgreSQL developers are preparing to further extend their compression capabiities with Zstd support.\r   This week started a  discussion among PostgreSQL developers for adding Zstd as a supported compression algorithm by this widely-used, open-source database server.\r   That discussion turned out favorably and already with  PostgreSQL Git there is now support for building PostgreSQL with Zstd included.\r    While this adds the  --with-zstd build-time option and goes ahead and allows building with the Zstd compression library, at the moment this doesn&#39;t enable any actual usage of Zstd within PostgreSQL. Follow-up commits are expected soon to begin allowing PostgreSQL to take advantage of the speed Zstandard compression capabilities.\r   By the time PostgreSQL 15 rolls out it looks like it will have Zstd support buttoned up to complement all the LZ4 possibilities found currently with PostgreSQL 14. It&#39;s great seeing all the adoption around Zstd thanks to its good compression ratio while delivering very speedy decompression (and compression) for this dual licensed (BSD and GPLv2) Facebook-baced project.", "posttime": "2022-02-22 02:03:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,研究,begins,广告", "title": "PostgreSQL开始研究Zstd压缩支持", "title_en": "PostgreSQL Begins Working on Zstd Compression Support", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=PostgreSQL-ZStd-Start", "via": "", "real_tags": ["研究", "begins", "广告"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有多少软件开发人员必须离开一个项目才能使开发停止？这个数字就是公车系数。巴士因素背后令人毛骨悚然的含义是，需要被巴士撞到才能停止开发的开发商数量（但考虑到会员中了彩票，通常会更轻松，而不是任何了解统计数据的人都会真正中彩票）。\n34岁；总线系数&#34；是在项目因缺乏知识或称职人员而暂停之前，必须突然从项目中消失的团队成员的最小数量。\n推论：如果可能的话，选择通用框架（参见：Rails和开发者网络效应上市）\n让捐款变得容易。许多促进开源项目发展的建议都可以应用于简化内部项目的入职。\n它&#39；重要的是要注意到，许多员工正在解决降低公交车系数的问题（正确或错误）。这里&#39；有一些偏见需要纠正：\n开发人员倾向于使用新的、令人兴奋的框架来培养他们的技能和填充他们的简历。寻找机会，让开发人员在架构选择之外成长。\n开发人员不喜欢编写文档，因为他们没有根据文档进行评估。使沟通成为工程文化的一项重要原则。\n开发人员对密集的代码审查有偏见，因为它们会减慢更改的速度，并且开发人员会根据更改进行评估（扩展来说，就是他们的速度）。保持高度一致。\n开发人员倾向于自动化。这通常是好的，但过度优化会导致脆弱的系统。自动化可能是一个负担（集成测试太长）", "note_en": "How many software developers would have to leave a project to make development come to a halt? That number is the  bus factor. The macabre meaning behind the  bus factor is the number of developers that would need to get hit by a bus to halt development (but it&#39;s often lighter to think about members winning the lottery, not that anyone who knows about statistics would actually play the lottery).\n The &#34;bus factor&#34; is the minimum number of team members that have to suddenly disappear from a project before the project stalls due to lack of knowledgeable or competent personnel.\n  Corollary: pick common frameworks if you can (see:  Getting to Market with Rails and  Developer Network Effects)\n  Make it dead easy to contribute. Many of the suggestions to grow your open source project can be applied to making onboarding easier for internal projects.\n It&#39;s important to note that many employees are solving to reduce bus factor (rightly or wrongly). Here&#39;s some biases to correct for:\n Developers are biased towards new and exciting frameworks to build their skills and pad their resume. Look for opportunities to let developers grow that are outside architecture choices.\n Developers are biased against writing documentation because they are not evaluated on documentation. Make communication a key tenet of engineering culture.\n Developers are biased against intensive code reviews because they slow velocity of changes, and developers are evaluated on changes (and by extension, their velocity). Keep the bar high and consistent.\n Developers are biased towards automation. This is generally good, but over-optimization can lead fragile systems. Automation can be a burden ( your integration tests are too long)", "posttime": "2022-02-22 02:01:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,软件,软件开发,bus,开发人员", "title": "增加软件开发团队中的总线因素", "title_en": "Increasing Bus Factor in Software Development Teams", "transed": 1, "url": "https://matt-rickard.com/reducing-bus-factor/", "via": "", "real_tags": ["开发", "软件", "软件开发", "bus", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "12月，43岁的博士研究人员尼娜·简·帕特尔戴上耳机，进入梅塔的虚拟世界，看看那天发生了什么。“在那里的几秒钟内，我身边就有三个化身，”她说。“突然他们开始自拍……一开始我看不出他们在摸阿凡达的上身……他们在对我喊道，‘不要假装你不喜欢，这就是你来的目的。’”\n事件发生在metaverse，这是一个通过可穿戴技术进入的沉浸式虚拟世界，科技团体希望我们在未来花更多的时间在其中，无论是玩还是工作，都是至关重要的。\n然而，在就业法方面，尚不清楚什么样的参与规则适用于普遍的数字领域。在元宇宙中什么算骚扰？化身会受到歧视吗，或者更糟？国家立法会保护员工，还是在metaverse工作需要一本新的规则手册？\n由于CVID2019冠状病毒疾病，全球劳动力已经习惯于在过去两年中远程工作，而公司已经开始在工作场所进行虚拟现实实验。例如，希尔顿酒店集团（Hilton hotel group）就利用它来培训员工如何处理客人。去年，微软（Microsoft）开始推出一项计划，使员工能够以化身的身份出现在其团队协作软件中，这是它向混合工作的物理世界和数字世界迈出的第一步。\n但metaverse将混合工作推进了一步，带来了一系列棘手的就业法问题。这些挑战从实际挑战（如员工如何获得报酬）到更具哲理的挑战（如化身是否具有法律身份）。西蒙斯律师事务所（Simmons&amp；西蒙斯。\n工作的物质世界由国家法律框架管理。例如，在加利福尼亚州，工人可以在没有通知的情况下被解雇，而在荷兰，没有法院或荷兰职业介绍所的批准，通常不能解雇员工。然而，在metaverse中，适用的国家就业法并不明显。\nGowling WLG的合伙人乔纳森·张伯伦（Jonathan Chamberlain）说：“从某种意义上说，metaverse只是另一个平台。无论平台是什么，雇佣关系的基本原则都是正确的。”。“可以说，在团队和Zoom的时代，我们中的许多人已经进入了这个时代。\n“但直到最近，雇佣关系在很大程度上还是地域固定的……雇佣法在很大程度上仍然是针对具体国家或州的。即使你或你的老板想退出你国家的法定就业保护制度，你通常也不能选择退出。”\n到目前为止，还没有人决定，对于分散的数字工作区，应该采用什么样的法律框架。在这个工作区中，工作人员可能是流动的，在地理上彼此之间以及他们工作的公司之间可能不存在联系。\n纽曼说：“metaverse没有国界，所以第一个问题是，‘与作品有更大联系的司法管辖区在哪里？’”。“这可能是拥有平台的公司所在国的法律……可能是服务器所在国的法律，也可能是员工所在国的法律……没有人就此达成协议。”\n考虑到Meta等公司希望收集和赚钱的个人数据的规模，员工参与metaverse也提出了有关隐私和数据安全的重要问题。\n英国《金融时报》1月份的一项调查分析了Meta向美国专利商标局提交的数百份申请。虽然这些并不意味着这项技术将被开发出来，但它强调了Meta收集大量生物特征数据的计划，从眼睛抽搐到鼻子蜷缩和身体运动。这些数据将有助于该公司确保他们构建的数字环境是现实的，但它也揭示了其计划在多大程度上利用metaverse，包括使用深度个人数据以更有针对性的方式销售广告。\n在现实世界中，在英国和欧洲，《通用数据保护条例》（GDPR）规定了雇主可以收集和存储的员工信息，包括医疗和个人记录以及评估等信息。因此，想要占领Meta的公司将不得不考虑如何保护工人的数据，同时要求他们参与虚拟世界。\n美国智库大西洋理事会（Atlantic Council）的技术律师兼研究员布里坦·海勒（Brittan Heller）在2020年发表的一篇讨论论文中写道：“现有法律无法解释沉浸式技术正在创造的新范式。”。“这项新技术引发的许多问题使我们超越了当前的法律边界：如何收集用户数据扫描？信息如何存储？信息多久更新一次？数据保留多长时间？”\n帕特尔，她在Meta中被称为性侵犯，她是雷丁大学的博士研究人员，研究体验这些身临其境、虚拟世界的“心理和生理影响”。她比大多数人更清楚违反数字互动的感觉。\n“在虚拟空间中，人们的行为方式在现实生活中是无法接受的，”她说，这给metaverse工作场所的行为监管带来了潜在问题。“我收到的回复（关于她的经历的博客）表明，有人认为这种行为在虚拟环境中是合适的。”\n保护员工免受骚扰和歧视的法律也没有清晰地映射到用户进行数字化操作的世界。让一个头像对骚扰等行为负责意味着赋予它一个法律角色，这样它就可以被起诉或起诉。\n“最近有报道称metaverse中存在性骚扰……这就引出了一个问题：一个数字生物是否可以拥有权利，如果可以，现有的骚扰保护是否延伸到该化身？”纽曼问道。\n英国现行法律还禁止工人因性别、宗教和种族等九个受保护的特征而受到歧视。但在一个人们可以随心所欲地展示自己的世界里，包括在某些情况下的动物或机器人，这样的法律仍然适用吗？\n事实证明，自我表现的问题在法律上和道德上都很困难。张伯伦说：“如果我想以一个年轻的黑人女性的身份出现在metaverse中，那该怎么办？我能做到吗？雇主会说你的头像必须与你相似吗？我们在多大程度上可以获得言论自由？”\n在去年的一篇博客文章中，Meta写道，“metaverse不会由一家公司一夜之间建成。”它补充道，“这些产品中的许多将在未来10-15年内完全实现。”但Meta创始人马克·扎克伯格（Mark Zuckerberg）承诺在未来十年每年在metaverse上花费100亿美元，而其他大型科技集团也在紧随其后。\n微软表示，今年1月，微软同意以750亿美元的价格收购游戏公司Activision，旨在“为metaverse提供构建平台”。事实上，微软首席执行官萨蒂亚·纳德拉（Satya Nadella）最近在接受英国《金融时报》采访时表示：“你和我很快就会坐在会议室的桌子上，看到我们的头像或全息图，甚至是带有环绕音频的2D表面。”\nMeta的博客承认，对这项技术的等待“让我们这些急于投入其中的人感到沮丧，它给了我们时间去问一些关于如何建造它们的难题。”预计居住在metaverse的工人可能会为此感到高兴。\n©2022金融时报有限公司。保留所有权利，不得以任何方式重新分发、复制或修改。", "note_en": "In December, 43-year-old doctoral researcher Nina Jane Patel put on a headset and entered Meta’s virtual world to see what was happening that day. “Within seconds of being there, there were three avatars near me,” she says. “Suddenly they were taking selfies... I couldn’t see at first that they were groping the avatar’s upper body... They were yelling at me, ‘Don’t pretend you don’t like it, this is what you came for.’”\n The incident took place in the metaverse, an immersive virtual world accessed via wearable technology in which tech groups expect us to spend a far greater proportion of time in the future, both playing and, crucially, working.\n When it comes to employment laws, however, it is unclear what rules of engagement apply in a universal digital realm. What counts as harassment in the metaverse? Can an avatar be discriminated against, or worse? Will national legislation protect employees or does working in the metaverse require a new rule book altogether?\n  The global workforce has grown far more accustomed to working remotely in the past two years because of the COVID-19 pandemic, and companies have already started experimenting with virtual reality in the workplace. Hilton hotel group, for example, uses it to train staff on how to handle guests. And last year Microsoft, in its first step toward blending the physical and digital worlds of work, began rolling out a plan to enable workers to appear on its Teams collaboration software as avatars.\n But the metaverse takes hybrid working a step further and brings with it a host of thorny employment law issues. These range from practical challenges, such as how employees are paid, to more philosophical ones, like whether avatars have a legal identity. “The legal conundrums are about as diverse as the possibilities of the metaverse itself,” says Jonathan Newman, managing associate at law firm Simmons &amp; Simmons.\n The physical world of work is regulated by national legal frameworks. In California, for example, workers can be fired with no notice, while in Holland, employees generally cannot be sacked without approval from the court or Dutch employment agency. In the metaverse, however, the national employment law that applies is not immediately obvious.\n    “In one sense, the metaverse is just another platform. And the fundamental tenets of an employment relationship hold true regardless of platform,” says Jonathan Chamberlain, a partner at Gowling WLG. “Arguably, in the era of Teams and Zoom, many of us are already in it.\n “But the employment relationship has until relatively recently been largely geographically fixed... employment law is still largely country or state specific. You often cannot opt out of your country’s statutory employment protection regime even if you—or your boss—wanted to.”\n So far, no one has decided what legal framework should apply to a decentralized digital workspace in which workers may be itinerant and geographically disconnected from each other and the company they work for.\n “There are no national boundaries in the metaverse, so the first question is, ‘Where is the jurisdiction with the greater connection to the work?’” says Newman. “It could be the law of the country where the company owning the platform is... it could be the law of the country where the servers are based, or where the employee is... no one has reached an agreement on that.”\n Worker participation in the metaverse also raises important questions about privacy and data security, given the scale of personal data that companies such as Meta expect to gather and monetize.\n A Financial Times investigation in January analyzed hundreds of Meta’s applications to the US Patent and Trademark Office. While these do not mean the tech will be built, it highlighted Meta’s plans to harvest a vast array of biometric data—from eye twitches to nose scrunches and body movements. Such data will help the company ensure the digital environments they build are realistic, but it also revealed the extent of its plans to cash in on the metaverse, including using deeply personal data to sell ads in more targeted ways.\n In the physical world, in the UK and Europe, the General Data Protection Regulation (GDPR) governs what information employers can and cannot collect and store about their workers, including medical and personal records as well as things such as appraisals. As a result, companies that want to occupy the metaverse will have to consider how to protect workers’ data while requiring them to participate in a virtual world.\n “Existing laws do not account for new paradigms being created in immersive technology,” writes Brittan Heller, a technology lawyer and fellow at US-based think-tank Atlantic Council in a discussion paper published in 2020. “Many questions prompted by the new technology bring us beyond current frontiers of the law: How are scans of user data collected? How is the information stored? How often is the information updated? How long is data retained?”\n     Patel, who was subjected to what she called a sexual assault in the metaverse, is a doctoral researcher at the University of Reading studying the “psychological and physiological impact” of experiencing these immersive, virtual worlds. She knows better than most how violating a digital interaction can feel.\n “In the virtual space it seems to be acceptable to behave in a way that people would not in real life,” she says, creating potential issues for policing conduct in a metaverse workplace. “The comments I’ve received in response [to a blog about her experience] show that there are people who think this behavior is appropriate in virtual environments.”\n Nor do the laws that protect employees from harassment and discrimination map neatly on to a world in which users operate digitally. Holding an avatar accountable for acts such as harassment would mean attributing a legal persona to it so it could be sued or prosecuted.\n “Recently there have been reports of sexual harassment in the metaverse... which begs the question whether a digital being can have rights, and if so, do the existing protections for harassment extend to that avatar?” asks Newman.\n Current UK laws also prevent workers from being discriminated against on the basis of nine protected characteristics, including sex, religion, and race. But do such laws still apply in a world where people can present themselves as anything they like, including in some cases animals or robots?\n Issues of self-expression could prove legally and ethically difficult. Chamberlain says: “What if I wanted to present myself in the metaverse as a young black woman? Should I be able to do that? Are employers going to say your avatar has to bear resemblance to you? And to what extent would we be allowed freedom of expression?”\n  In a blog post last year, Meta wrote that the “metaverse won’t be built overnight by a single company.” It added, “Many of these products will only be fully realized in the next 10-15 years.” But Meta founder Mark Zuckerberg has pledged to spend $10 billion a year over the next decade on the metaverse, while other big tech groups are snapping at his heels.\n Microsoft agreed to buy gaming company Activision in January in a $75 billion deal intended to “provide building blocks for the metaverse,” according to the company. Indeed, speaking to the Financial Times recently, Microsoft’s chief executive, Satya Nadella, said: “You and I will be sitting on a conference room table soon with either our avatars or our holograms or even 2D surfaces with surround audio.”\n Meta’s blog acknowledged that the wait for the technology is “frustrating for those of us eager to dive right in, it gives us time to ask the difficult questions about how they should be built.” Workers expected to inhabit the metaverse might be glad of that.\n © 2022 The Financial Times Ltd.  All rights reserved Not to be redistributed, copied, or modified in any way.", "posttime": "2022-02-22 01:22:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "场所,law,metaverse", "title": "Metaverse vs.就业法：虚拟工作场所的现实", "title_en": "Metaverse vs. employment law: The reality of the virtual workplace", "transed": 1, "url": "https://arstechnica.com/tech-policy/2022/02/metaverse-vs-employment-law-the-reality-of-the-virtual-workplace/", "via": "", "real_tags": ["场所", "law", "metaverse"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074521, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "惠普、联想、宏碁和华硕有望成为首批发布游戏Chromebook的公司之一。Chromium Gerrit中的代码变化表明，供应商正在开发支持Steam的Chrome OS设备。\n2020年1月，谷歌表示将为Chromebooks带来动力，该计划可能开始成形。9to5Google在周六发现了一个代码变化，显示了支持Steam的Chromebook型号列表：\n谷歌过去曾告诉Ars Technica，在Chromium Gerrit中进行了大量实验，因此当变化冲击消费者时，情况可能会有所不同。\n也就是说，上个月，Chromium Gerrit还展示了对Chromebook的RGB键盘支持的工作，这是游戏Chromebook即将问世的另一个迹象。\nChromebook似乎需要一些非常结实的规格才能运行。目前，预期的最低规格包括Intel第11代i5 CPU和8GB RAM。正如9to5Google所指出的，接下来可能还会有其他Chromebook加入该列表，尤其是因为我们尚未听到谷歌、Steam或任何笔记本电脑公司的正式确认。该出版物指出，Chromium Gerrit链接显示英特尔第10代和AMD CPU测试。\n有趣的是，有&#39；没有关于基于Arm芯片的细节。虽然没有配备Nvidia专用GPU的Chromebook，但9to5Google指出，Nvidia员工对Chromium Gerrit的贡献将&#34；仅由Steam使用的虚拟机使用&#34;\nNvidia一直在与联发科技合作，联发科技是Chromebook中许多基于Arm的SoC的制造商，该公司的参考平台支持Chrome、Nvidia SDK和Linux。该公司承诺将提供光线追踪和Nvidia&#39；将DLS升级到基于Arm的芯片，并在联发科Kompanio 1200芯片上演示了这类功能，预计该芯片将在Chromebook上上市。自从我们&#39；说到第一款配备Nvidia专用显卡的Chrome OS设备，我们&#39；我预计那些游戏Chromebook的价格也会更高。\nChromium Gerrit中详细介绍的Chromebook型号已经相当昂贵了。宏碁&#39；例如，s Chromebook 515目前起价为650美元，而华硕Chromebook Flip CX5的i5售价为830美元。惠普&#39；s c640 G2 Chromebook的起价为489美元，i5的起价为1254美元。\n随着谷歌体育场（Google Stadia）的腾飞，看到谷歌（Google&#39；这是吸引PC玩家的下一次尝试。", "note_en": "HP, Lenovo, Acer, and Asus are expected to be among the first companies to release gaming Chromebooks. A  code change in the Chromium Gerrit suggests the vendors are working on Chrome OS devices that will support Steam.\n In January 2020, Google said it would bring Steam to Chromebooks, and the plan may be starting to take shape.  9to5Google spotted a code change on Saturday showing a list of what appears to be Chromebook models that will support Steam:\n  Google has told Ars Technica in the past that a lot of experimentation happens in the Chromium Gerrit, so things can look different by the time changes hit consumers.\n That said, last month, the Chromium Gerrit also showed work on  RGB keyboard support for Chromebooks, another sign that gaming Chromebooks could be coming.\n  It appears Chromebooks will require some pretty beefy specs to run Steam. Currently, expected minimum specs include an Intel 11th-Gen i5 CPU and 8GB of RAM. As noted by 9to5Google, there may be other Chromebooks added to the list down the line, especially since we have yet to hear official confirmation from Google, Steam, or any laptop companies. The publication pointed to a  Chromium Gerrit link showing Intel 10th-Gen and AMD CPU testing.\n    Interestingly, there&#39;s no detail on Arm-based chips. Although there are no Chromebooks with dedicated Nvidia GPUs, 9to5Google noted Chromium Gerrit contributions from Nvidia employees that it said would &#34;be used exclusively by the virtual machine that will be used by Steam.&#34;\n Nvidia has been working with MediaTek, the maker of many Arm-based SoCs found in Chromebooks, on a reference platform supporting Chromium, Nvidia SDKs, and Linux. The company has promised to bring capabilities like ray tracing and Nvidia&#39;s DLSS to Arm-based chips and has  demoed such features working on the MediaTek Kompanio 1200 chip expected to land in Chromebooks. Since we&#39;re talking about the first Chrome OS devices with dedicated Nvidia graphics cards, we&#39;d expect those gaming Chromebooks to command a higher price tag, too.\n The Chromebook models detailed in the Chromium Gerrit are pretty pricey already. Acer&#39;s Chromebook 515, for example, currently starts at $650, while the Asus Chromebook Flip CX5 can be found for  $830 with an i5. HP&#39;s c640 G2 Chromebook starts at $489 but goes up to  $1,254 for an i5.\n With  Google Stadia flailing, it will be interesting to see Google&#39;s next attempt at attracting PC gamers.", "posttime": "2022-02-22 01:20:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,联想,lenovo,chromebook", "title": "惠普和联想Chromebook预计将支持Steam", "title_en": "HP and Lenovo Chromebooks expected to support Steam", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/hp-and-lenovo-chromebooks-expected-to-support-steam/", "via": "", "real_tags": ["chrome", "联想", "lenovo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电脑正变得越来越小，就像现在的手机提供类似笔记本电脑的计算能力一样。小型化的趋势还在继续。智能灰尘应用（微型微电子设备），如人体内的生物相容性传感器系统，需要比灰尘更小的计算机和电池。到目前为止，这一发展受到两个主要因素的阻碍：缺乏可随时随地运行的片上电源，以及生产可集成微电池的困难。在《高能能材料》杂志上，Oliver G. Schmidt博士是开姆尼茨工业大学纳米电子学材料系统教授、纳米材料、结构与集成中心主任（闵神竹），曾在施密特教授&#39；自2022年2月以来，梅因研究中心的s小组，以及德累斯顿莱布尼茨固体与材料研究所（IFW）和长春应用化学研究所的研究人员提出了解决这些挑战的方案。他们讨论了如何在亚毫米级实现电池供电的智能灰尘应用，并介绍了世界#39；它是迄今为止最小的电池，是面向应用的原型。\n&#34;我们的研究结果显示，在亚平方毫米的规模上，储能性能令人鼓舞，&#34；朱敏申博士说，奥利弗·施密特教授补充道：&#34；这项技术仍有巨大的优化潜力，我们可以预期未来会有更强大的微电池&#34;\n可以通过开发合适的电池或&#34；收获#34；发电的方法。\n在&#34；收获&#34；例如，微型热电发电机可以将热量转化为电能，但其输出功率太低，无法驱动灰尘大小的芯片。机械振动是驱动微型设备的另一种能量来源。在小型芯片上将光转化为电能的小型光伏电池也很有前景。\n然而，光和振动并非在所有时间和地点都可用，这使得在许多环境中不可能按需操作。例如，在人体中，微型传感器和执行器也需要持续供电。强大的微型电池可以解决这个问题。\n然而，微型电池的生产与普通电池有很大不同。例如，具有高能量密度的紧凑型电池，例如纽扣电池，是使用湿化学方法制造的。电极材料和添加剂（碳材料和粘合剂）被加工成浆料并涂覆在金属箔上。使用这种标准技术生产的片上微电池可以提供良好的能量和功率密度，但其占地面积明显超过1平方毫米。\n叠层薄膜、电极柱或叉指微电极用于芯片电池制造。然而，这些设计往往存在能量储存不足的问题，而且这些电池的占地面积不能显著降低到1平方毫米以下。因此，施密特教授、朱博士和他们的团队的目标是设计一种直径明显小于1平方毫米、可集成在芯片上的电池，其最小能量密度仍为每平方厘米100微瓦时。\n为了实现这一目标，该团队在微型规模上缠绕了集电器和电极条——特斯拉也在大规模使用类似的工艺来制造其电动汽车的电池。\n研究人员使用了所谓的&#34；瑞士卷&#34；或&#34；微型折纸&#34；过程通过在晶圆表面连续涂覆聚合物、金属和介电材料薄层，形成具有固有张力的分层系统。机械张力通过剥离薄层释放，然后自动弹回去卷成瑞士卷轴结构。因此，不需要外力就能制造出这样一个自卷绕圆筒式微型电池。该方法与现有的芯片制造技术兼容，能够在晶圆表面生产高通量微型电池。\n利用这种方法，研究团队已经制造出了可再充电的微电池，可以为世界供电；例如，它可以连续测量当地的环境温度。这是一款微型电池，在物联网、微型医疗植入物、微型机器人系统和超柔性电子等领域，为未来的微纳电子传感器和执行器技术提供了巨大潜力。更多信息：杨莉等，《灰尘大小计算机用芯片电池》，高级能源材料（2022年）。DOI:10.1002/aenm。202103641", "note_en": "Computers are getting smaller and smaller, just as current cell phones offer computing power similar to that of a laptop. And the trend toward miniaturization continues. Smart dust applications (tiny microelectronic devices), such as biocompatible sensor systems in the body, demand computers and batteries smaller than a dust mote. So far, this development has been hindered by two main factors: lack of on-chip power sources for operation anytime and anywhere and difficulties in producing integrable microbatteries.    In the current issue of  Advanced Energy Materials, Prof. Dr. Oliver G. Schmidt, head of the Professorship for Material Systems of Nanoelectronics and Scientific Director of the Center for Materials, Architectures and Integration of Nanomembranes (MAIN) at Chemnitz University of Technology, Dr. Minshen Zhu, who has been working in Prof. Schmidt&#39;s group at the Research Center MAIN since February 2022, and researchers from Leibniz Institute for Solid State and Materials Research (IFW) Dresden and Changchun Institute of Applied Chemistry present a solution to these challenges. They discuss how battery-powered smart dust applications can be realized in the sub-millimeter-scale and present the world&#39;s smallest battery by far as an application-oriented prototype.\n  &#34;Our results show encouraging energy storage performance at the sub-square-millimeter scale,&#34; says Dr. Minshen Zhu, and Prof. Oliver Schmidt adds: &#34;There is still a huge optimization potential for this technology, and we can expect much stronger microbatteries in the future.&#34;\n    The power to run tiny sub-millimeter-scale computers can be provided by developing appropriate batteries or &#34;harvesting&#34; methods to generate electricity.\n  In the area of &#34;harvesting,&#34; micro-thermoelectric generators, for example, convert heat to electricity, but their output power is too low to drive dust-sized chips. Mechanical vibrations are another source of energy for powering tiny-scale devices. Small photovoltaic cells that convert light into electrical energy on small chips are also promising.\n  However, light and vibrations are not available at all times and in all places, making on demand operation impossible in many environments. This is also the case, for example, in the human body, where tiny sensors and actuators require a continuous power supply. Powerful tiny batteries would solve this problem.\n  However, the production of tiny batteries is very different from their everyday counterparts. For example, compact batteries with high energy density, button cells for instance, are manufactured using wet chemistry. Electrode materials and additives (carbon materials and binders) are processed into a slurry and coated onto a metal foil. On-chip microbatteries produced using such standard technologies can deliver good energy and power density but have a footprint of significantly more than one square millimeter.\n       Stacked thin films, electrode pillars or interdigitated microelectrodes are used for on-chip battery manufacturing. However, these designs often suffer from inferior energy storage, and the footprint of these batteries cannot be reduced significantly below one square millimeter. The goal of Prof. Schmidt, Dr. Zhu and their   was therefore to design a battery significantly less than one square millimeter across and integrable on a chip, which still has a minimum energy density of 100 microwatt hours per square centimeter.\n  To achieve this, the team winded up current collectors and electrode strips at the microscale—a similar process also used by Tesla on the large scale to manufacture the batteries for its e-cars.\n  The researchers use the so-called &#34;Swiss-roll&#34; or &#34;micro origami&#34; process. A layered system with inherent tension is created by consecutively coating thin layers of polymeric, metallic and dielectric materials onto a wafer surface. The mechanical tension is released by peeling off the thin layers which then automatically snap back to roll up into a Swiss-Roll architecture. Thus, no external forces are needed to create such a self-wound cylinder micro-battery. The method is compatible with established chip manufacturing technologies and capable of producing high throughput micro-batteries on a wafer surface.\n  Using this method, the research team has produced rechargeable microbatteries that could power the world&#39;s smallest computer chips for about ten hours—for example, to measure the local ambient temperature continuously. A tiny battery with great potential for future micro- and nanoelectronic sensorics and actuator technologies in areas such as the Internet of Things, miniaturized medical implants, microrobotic systems and ultra-flexible electronics.        More information:\t\t\t\t\t\t\t\t\t\t\t\tYang Li et al, On‐Chip Batteries for Dust‐Sized Computers,  Advanced Energy Materials (2022).  DOI: 10.1002/aenm.202103641", "posttime": "2022-02-22 01:16:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "计算机,smallest,电池", "title": "世界上最小的电池可以为一粒灰尘大小的计算机供电", "title_en": "World's smallest battery can power a computer the size of a grain of dust", "transed": 1, "url": "https://techxplore.com/news/2022-02-world-smallest-battery-power-size.html", "via": "", "real_tags": ["计算机", "smallest", "电池"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旗舰系列中的手机让人感觉像是某个主题的变体。有基本型号，更大的基本型号，然后是最大的型号，带有额外的摄像头和一些其他小型硬件升级。功能、屏幕大小和成本都会随着产品链的上升而增加，但你或多或少会得到三种不同口味的同一款手机。\n在过去的几年里，三星的手机都是这样，但现在已经不是这样了——售价1199美元的Galaxy S22 Ultra作为一款完全不同的选择，在今年的产品阵容中位居榜首。这是首款内置手写笔的s系列手机，该功能是从现已退役的Galaxy Note系列手机继承而来的。除此之外，它还提供了非常好的10倍光学变焦，以及一些吸引人的摄影功能更新。它碰巧也是一款很棒的手机，但尽管它在三星的主流s系列中占有一席之地，但它仍然感觉像Note系列所代表的狂热设备。\n三星至少已经让决定这三款手机中哪款适合你变得非常容易。如果你错过了这张便笺，你喜欢手写笔的生活，那就买S22 Ultra吧。在三星的产品线或市场上的其他任何地方都没有这样的产品，真的。如果你只是对触控笔或10倍变焦有点好奇，或者你只是想要一部非常漂亮的大屏幕手机，而不需要太多麻烦，那么你最好使用S22 Plus。并不是每个人都适合，但对少数人来说，S22 Ultra确实是一款很棒的设备。\n也许是不同的，Ultra和它的S22和S22 Plus兄弟之间仍然有很多共同点。这三款机型都包括（在美国）高通公司最新的Snapdragon 8 Gen 1处理器、IP68防风雨密封以及正面和背面的Gorilla Glass Victus Plus。Ultra和S22 Plus的OLED屏幕峰值亮度更高，为1750尼特，但三款产品的最高刷新率均为120Hz。只有Ultra使用LTPO显示屏，这使得屏幕比其他型号更能改变刷新率，这在理论上有助于节省电池寿命。这是一个巨大的6.8英寸1440 x 3088面板，所以每一点省电都能带来很大的不同。\n不足为奇的是，显示器本身非常出色。在默认的“生动”设置下，它有点温暖，但我只注意到它与像素6并排观看。颜色确实很鲜艳，但没有达到过饱和的程度。从极端的角度看，也有轻微的颜色变化，但在日常使用中没有什么困扰我的。外面对我来说也很明亮，但我住在西雅图，所以我并没有把它推到极限。\nUltra采用直接源自Galaxy Note的方形设计，当然还有内置的S Pen筒仓。S22和S22 Plus沿用了去年的设计理念，采用了圆角设计，并在手机的侧栏中融入了摄像头凸起，而S22 Ultra则融入了混乱，完全跳过了摄像头凸起。四个摄像头镜头（和一个激光自动对焦传感器）从设备的背板上伸出……什么都没有。Twitter上不止一个人告诉我它看起来像只蜘蛛。一开始很奇怪，但我渐渐喜欢上了。也许会有更多的手机制造商效仿三星。谁知道呢？我是来这里的。\n我有点担心凸出的镜片会卡在口袋里，但这不是问题。然而，透镜之间的空间是严重的灰尘和棉绒陷阱。我相信IP68密封件可以防止灰尘进入相机，所以如果你对保持手机无尘非常谨慎，那就更美观了。如果你不能以这样的速度生活，三星销售的手机壳将非常巧妙地消除镜头之间的低谷。\n后置摄像头阵列是一种可以立即将Ultra与S22和S22 Plus区分开来的方法，但它的屏幕长边上也有弯曲的边缘，其他的都有平板显示器。它看起来很漂亮，侧面的小挡板几乎都消失了，但我把我的触笔从屏幕边缘移开了太多次，希望在没有触笔的地方有一个平坦的表面。就我个人而言，我可以用一点挡板来避免整个情况。\nS22 Ultra支持45W快速有线充电，但您需要单独购买50美元的电源砖。花1200美元买一部手机，再花50美元买一个充电器，就跟花12美元买500美元的航班上的Wi-Fi一样烦人。如果你预购了Ultra，我希望你能把三星商店的一部分积分投给它。还有15W无线充电。我在复习时广泛使用了它，它通常会在不到两小时的时间内将半耗尽的电池充电到100%，这对我来说很好。\n虽然S21超级官方支持S笔，但它没有内置存储筒仓，这有点…支持S笔的一半。S22 Ultra包括全面支持和手写笔存储，这是真正的交易。这一次，这款手机的笔或触笔功能并没有太多新功能，不过三星确实表示，它已经将延迟降低了70%。很难说这是否准确，因为这只需要几毫秒的时间，但不管怎样，用s笔书写感觉流畅，识别速度也很快。\n使用S笔可以很简单，只需将数码笔放到屏幕上，给自己写一张便条，然后结束一天。或者，你可以深入使用触控笔功能，我猜很多Note超级用户都会这么做。我花了一点时间才找到了在整个系统中，尤其是在三星的Notes应用程序中，用手写笔可以做的一切。我在应用程序中找到了至少三种将手写转换为文本的不同方法，不包括在手写模式下使用键盘的选项。这有点难以承受。\n在整个系统中使用S笔还有其他方法，除了涂鸦笔记和看着它们神奇地变成人类可读的文本。它对于照片编辑或抓取屏幕截图和循环重要信息非常方便。你可以用它来追踪一个形状，并从图像中剪下一些东西，比如你拍摄的洗碗机型号的照片（我可以证明这非常方便）。还有一些Air Actions，你可以在某些应用程序中使用S笔作为遥控器，而不必触摸屏幕，它可以正常工作，但感觉它们并不能解决真正的问题。\n你可以深入使用触控笔功能，也可以停留在表面上，但如果你怀疑自己是那种会多次使用触控笔然后忘记它的人，那么S22 Ultra可能不适合你。我确实认为它适合那些喜欢在不解锁手机的情况下草草写下便条，或者用钢笔而不是数字键盘列出待办事项清单的人。我想数字艺术家也会很好地利用S笔和它的许多数字笔触选项。与简单的被动触控笔相比，它在绘制草图时更灵敏、更灵活。请注意，粉丝们会感觉像在家一样，但除非你确定自己可以接受手写笔的生活，否则你最好还是买一部普通的老式无手写笔手机。\n在日常使用中，S22 Ultra的性能就像1200美元的旗舰一样。从一个应用程序跳到另一个应用程序很快，图形密集型游戏运行平稳，在120Hz的显示屏上，一切看起来都非常流畅。在我的测试中，当我滚动屏幕时，看到屏幕结巴是非常罕见的，在这种情况下，我不认为这是手机的错（我在看你，Android的Twitter）。\n这款手机在玩游戏和使用专业的RAW应用程序等高强度任务时确实会明显变暖。在玩Genshin Impact大约半小时的时候，我从来没有看到过速度变慢的情况，但是三星的专家级RAW应用程序确实需要越来越长的时间来处理（非常大的）一个接一个的原始文件，如果你一直按快门的话。在最后一张照片完成处理之前，你不能再拍另一张照片，所以除了等待，你别无选择。\n超级用户肯定是Ultra的目标受众，他们必须关注电池寿命\n更重要的坏消息是Ultra的5000毫安时电池性能不佳。在一些日子里，我使用的是更轻的手机，有很多时间在Wi-Fi上使用，有大量的社交媒体滚动，但没有太多的视频或游戏，到了晚上，我只剩下大约50%的电池。不过，要在一天内将电池电量消耗得更低并不需要太多努力。\n随着屏幕亮度的提高，显示屏总是（有时不是）打开，以及大约一个小时的视频播放和游戏，到一天结束时，我已经降到了20%以下。这并不完全是一个折磨测试，因此超级用户（当然是Ultra的目标受众）可能需要更多地关注电池寿命。这对于一款拥有巨大电池的旗舰手机来说是令人失望的。\n与去年相比，S22 Ultra的相机硬件有一些细微的差异——例如，长焦镜头只是稍微宽一点——但基本上是相同的设置。以下是你得到的：\n由于硬件基本不变，去年的型号在今年仍然适用：总体而言，这是一个很棒的摄像系统，有几个怪癖。10倍光学变焦仍然令人印象深刻，三星仍在将蓝天和饱和度提高到11倍，而100倍“太空变焦”仍然是一个噱头。\n视频功能也基本相同。有一个新的自动取景功能，可以跟踪多达10个人，并在人们进出取景框时自动调整。还有一个自动帧速率功能，可以动态调整帧速率，以适应更亮或更暗的条件。主摄像头的视频录制分辨率最高仍为8K/24p，自拍摄像头的分辨率最高为4K/60p。\n今年的照片改进大多是基于软件的，这让它们听起来很无聊，但事实并非如此。通过更好、更详细的深度映射（更重要的是，对宠物肖像的官方支持），肖像模式照片得到了改进。这款手机能够更好地识别物体的小细节，比如单个头发，并保持它们的锐利，而不是在背景中模糊它们。\n这一变化带来了我在智能手机上看到的一些最令人印象深刻的肖像模式照片。宽镜头的人像仍然不能完全令人信服——即使深度贴图更好，前景中的元素在不应该出现的地方也很锐利。但是，在良好的照明条件下，3倍放大的照片看起来很棒——宠物和人类都一样。它仍然可能在一些细节上被绊倒，但它做得非常正确，即使是稀疏的头发和眼镜。\n我对夜间摄影的改进没有那么热情——它们很好，只是没那么令人印象深刻。现在，你可以使用夜间模式，同时拍摄1.08亿像素的全分辨率图像，而之前你可以这样做或那样做。只有在非常黑暗的条件下，屏幕上才会出现一个小月亮图标，以启用夜间模式。如果没有夜间模式，在这种情况下，高分辨率图像看起来很糟糕，所以开始时的分辨率有点低。你会得到一个略好的1.08亿像素的图像，而不是一个非常嘈杂的图像。\n也可以将夜间模式应用于自拍相机，同样，它必须非常暗才能显示选项。让我印象深刻的是，相机能找到足够的光线，让我在几乎完全黑暗的环境中静静地坐着，拍出任何可用的照片，但结果太不令人满意了，我想我宁愿根本没有照片。\n三星（Samsung）还通过S22 Ultra（一款类似于苹果（Apple）ProRAW的多帧原始数据捕获应用）正式将其专家级原始数据应用程序从测试版中升级。Expert RAW捕获多个帧并将其合并到单个DNG文件中，将计算摄影的优点与原始文件的后处理灵活性结合起来。要使用该功能，你需要从Galaxy app store下载Expert RAW应用程序——它是一个完全独立的摄像头应用程序，并且没有预装在手机上。它提供手动曝光控制，您可以将其与任何后置摄像头一起使用。\n生成的原始文件非常庞大，但它们比标准相机应用程序中的传统单帧原始文件更具可塑性。在一张标准的原始照片上把阴影一直往上推，会发现一些令人不快的条纹。多帧RAW有噪音，但更能容忍编辑，因为它有更多的信息要处理。这是你在Instagram大小的图片上看到的区别吗？可能不会。但是，如果你是一个喜欢修补后期处理的照片极客，它是一个非常好的工具，可以在需要它的场合使用。\n一个逻辑提示——在Expert RAW应用程序中有一个快捷方式，可以直接将照片拍摄到Lightroom中，供三星编辑。这是Lightroom Mobile的一个版本，你需要从Galaxy app store下载（你猜对了）。三星将给你两个月的免费试用期，但在那之后，你将需要一个Adobe许可证，该许可证将为你运行一年至少120美元。或者，你知道，只需免费下载Snapseed，Expert RAW会为你提供一个标准的DNG文件，你可以把它带到任何支持它的照片编辑软件上。\nGalaxy S22 Ultra附带一个用户界面4.1，这是三星对安卓12的模仿。我基本上喜欢它。我不确定自己对“将用户体验与壁纸匹配”这件事会有什么感觉，但它其实很不错。这是安卓12的一个主要新功能，尽管三星的实现远不及谷歌的像素手机版本，但它只足以让我觉得这款手机更加个性化。\n三星还仁慈地删除了天气应用程序页面顶部的广告。但就在我感觉该公司正在缩减其经常出现在你面前的预下载和广告时，如果我购买了S22，我会收到一个关于三星信用推广的推送通知。在这台S22 Ultra上。或者，当我打开Hulu时，三星的现金返还优惠会在我的屏幕上滑动。在一部价值1200美元的手机上，这种感觉特别令人沮丧和不合适，我不喜欢它。\n尽管我不喜欢三星的一些用户界面选择，但该公司还是以非常好的支持政策度过了难关。S22系列将“最多”更新四代安卓操作系统，这比谷歌对自己设备的承诺多了一年，而且几乎是安卓手机的最佳策略——如果该公司真的在四代操作系统升级上取得成功的话。我不是一名气候科学家，但我愿意打赌，不让人们每两年买一部新手机对环境的影响比在手机机箱中回收渔网或其他任何东西都要大。\n很难想出星系S22 Ultra无法做到的事情。我可以从我拍摄的视频中制作GIF并粘贴到固定在主屏幕上的便笺中吗？对我能站在几个街区之外的街道上，清楚地拍下西雅图史密斯大厦的顶部吗？对当我搜索一个神秘消失在稀薄空气中的零件时，我能拍下我的洗碗机型号的照片，将其转换成文本，然后粘贴到谷歌上吗？也是的。\n它可以做任何你可以合理预期2022年平板式手机能做的事情。但S22 Ultra并不是一款适合任何人的手机。你真的想拥抱触控笔的生活，还是你只是对触控笔好奇？你真的会一次又一次地使用那个10倍的镜头，还是仅仅用它拍几张照片，然后忘记它就在那里？您是否计划在手机上多次获取和编辑40MB以上的原始文件？在你花1200美元买这部手机（可能还有50美元买充电器）之前，好好看看镜子，问问自己这些问题。\n如果你是一个能充分利用Ultra的人，你可能已经知道了\n真的，三星已经做了判断这款手机是否适合你的工作。如果你是一个能充分利用Ultra的人，你可能已经知道了。如果你质疑它是否值得，那么你可能对S22 Plus没什么意见。\n对于那些计划经常使用其强大但相当利基的功能的人来说，S22 Ultra将是市场上独一无二的手机。一些UI怪癖依然存在，电池寿命令人失望。但是，如果你能克服这些缺点，在用户笔下生活中有时会出现陡峭的学习曲线，那么你就会得到一款真正独一无二的设备。", "note_en": "Phones in a flagship lineup have come to feel like variations on a theme. There’s the base model, the  bigger base model, and then the  biggest model with an extra camera and some other minor hardware upgrades. Features, screen size, and cost all increase in increments as you go up the chain, but you’re more or less getting the same phone in three different flavors.\n That’s been true of Samsung phones for the past few years, but it’s not the case anymore — the $1,199 Galaxy S22 Ultra sits at the top of this year’s lineup as an entirely different option. It’s the first S series phone to include a built-in stylus, a feature it’s inheriting from the evidently now-retired Galaxy Note series. On top of that, it still offers a very good 10x optical zoom, as well as some appealing updates to its photography features. It happens to be a great phone, too, but despite its place in Samsung’s mainstream S series, it still feels like the enthusiast device that the Note series represented.\n  Samsung has, at least, made the job of deciding which of this trio of phones is for you very easy. If you miss the Note and you love the stylus life, get the S22 Ultra. There’s nothing else like it in Samsung’s lineup or anywhere else on the market, really. If you’re just slightly curious about the stylus, or the 10x zoom, or you just want a really nice big-screened phone without a lot of fuss, then you’re probably better off with the S22 Plus. It’s not for everyone, but for a few, the S22 Ultra is a truly great device.\n   Different it may be, there’s still plenty of common ground between the Ultra and its S22 and S22 Plus siblings. All three models include (in the US) Qualcomm’s latest, the Snapdragon 8 Gen 1 processor, as well as IP68 weather sealing, and Gorilla Glass Victus Plus on the front and back. The Ultra and S22 Plus have OLED screens with higher 1,750 nits peak brightness, but all three have a top refresh rate of 120Hz. Only the Ultra uses an LTPO display, which allows the screen to change its refresh rate more than the other models, which in theory helps save battery life. It’s a huge, 6.8-inch 1440 x 3088 panel, so every bit of power saving can make a big difference.\n Not surprisingly, the display itself is excellent. At its default “vivid” setting, it’s a little on the warm side, but I only noticed this looking at it side by side with the Pixel 6. Colors are, indeed, vivid but not to the point of oversaturation. There’s also a slightly cool color shift when viewed from extreme angles, but nothing that bothered me in day-to-day use. It was also plenty bright for me outside, but I live in Seattle, so I didn’t exactly push it to the limit here.\n The Ultra stands apart with a boxier design lifted straight from the Galaxy Note and, of course, that built-in S Pen silo. While the S22 and S22 Plus follow last year’s design cues with rounded corners and a camera bump that blends into the side rail of the phone, the S22 Ultra embraces chaos and skips the camera bump altogether. Four camera lenses (and a laser autofocus sensor) protrude from the back plate of the device housed in… nothing at all. More than one person on Twitter told me it looks like a spider. And it is weird at first, but I’ve grown to like it. Maybe more phone makers will follow Samsung’s lead. Who knows? I’m here for it.\n  I was a little worried that the protruding lenses would catch on pockets, but that hasn’t been a problem. The spaces between the lenses, however, are serious dust and lint traps. I have faith that the IP68 sealing will keep dust out of the cameras, so it’s more of an aesthetic thing if you’re meticulous about keeping your phone dust-free. And if you can’t live your life at these kinds of speeds, Samsung sells a case that will very neatly eliminate the valleys between lenses.\n The rear camera array is one way you can immediately differentiate the Ultra from the S22 and S22 Plus, but it also stands apart with curved edges on the long sides of its screen, where the others have flat displays. It looks nice and makes the tiny bezels on the sides all but disappear, but I ran my stylus off the edge of the screen one too many times, expecting a flat surface where there wasn’t one. Personally, I could live with a little bit of bezel to avoid the whole situation.\n The S22 Ultra supports 45W fast wired charging, but you’ll need to buy the $50 power brick separately. Spending $1,200 on a phone and having to spend another $50 on a charger is about as annoying as paying $12 for Wi-Fi on a $500 flight. If you preordered the Ultra, I hope you put some of your Samsung store credit toward one. There’s also 15W wireless charging. I utilized this extensively during my review, and it usually charged the half-depleted battery back up to 100 percent in under two hours, which is fine for me.\n   While the S21 Ultra officially supported the S Pen, it didn’t include a built-in silo for storage, which is sort of… half supporting the S Pen. The S22 Ultra includes full support  and stylus storage — the real deal. There’s not a lot that’s new to the S Pen or stylus features this time around, though Samsung does say it has reduced latency by 70 percent. It’s hard to say if that’s accurate since it’s a matter of milliseconds, but either way, writing with the S Pen feels fluid, and recognition is speedy.\n Using the S Pen can be as simple as putting the digital pen to screen, scribbling yourself a note, and calling it a day. Or, you can go really deep with the stylus features, which I suspect a lot of Note power users do. It took me a little while to find my way around just everything you can do with the stylus throughout the system, but especially in Samsung’s Notes app. I found at least three different ways to convert handwriting to text in the app, not counting the option to use the keyboard in handwriting mode and go about it that way. It’s a little overwhelming.\n  There are other ways to use the S Pen throughout the system aside from scribbling notes and watching them magically become human-readable text. It’s very handy for photo editing or grabbing a screenshot and circling important information. You can use it to trace a shape and clip something out of an image, like a picture you took of your dishwasher model number (I can attest this is very handy). There are Air Actions, too, in which you use the S Pen as a kind of remote control in certain apps without touching the screen, which work okay but don’t feel like they solve a real problem.\n You can go deep with the stylus features or stay on the surface level, but if you suspect that you’re the kind of person who would use the stylus a few times and then forget about it, then the S22 Ultra probably isn’t for you. I do think it’s for someone who likes to be able to scribble out a quick note without unlocking their phone or make a to-do list with a pen rather than a digital keyboard. I imagine that digital artists would also make good use of the S Pen and its many digital brush stroke options. It’s also more responsive and flexible for sketching than a simple passive stylus. Note fans will feel right at home, but unless you’re sure you can embrace the stylus life, you’re likely better off with a regular old stylus-free phone.\n   In everyday use, the S22 Ultra performs like the $1,200 flagship that it is. Jumping from app to app is quick, graphics-intensive games run smoothly, and everything looks buttery smooth on the 120Hz display. In my testing, it was a very rare occurrence to see the screen stutter as I scrolled, and in the cases where it did, I don’t think it was the phone’s fault (I’m looking at you, Twitter for Android).\n The phone does get noticeably warm with intensive tasks like gaming and using the Expert RAW app. I never saw slowdowns as a result while playing  Genshin Impact for about half an hour, but Samsung’s Expert RAW app does take progressively longer to process (very large) RAW file after RAW file if you just keep pressing the shutter. You can’t take another photo until the last one is done processing, so there’s nothing to do except wait.\n the power users who are certainly the Ultra’s target audience will have to keep an eye on battery life\n The more significant bad news is that the Ultra’s 5,000mAh battery doesn’t perform quite as well. On days of lighter use with a lot of time on Wi-Fi, plenty of social media scrolling but not much video or gameplay, I got through with about 50 percent battery left by the evening. It doesn’t take a lot of effort, though, to drain the battery much lower in a single day.\n With screen brightness cranked up, the always-on display always (not sometimes) on, and about an hour of video play and gaming, I was down below the 20 percent mark by the end of the day. That’s not exactly a torture test, so the power users who are certainly the Ultra’s target audience will probably have to keep an eye on battery life more than they’d like to. That’s disappointing from a flagship phone with a huge battery.\n   There are a few minor differences in the S22 Ultra’s camera hardware compared to last year’s — the telephoto lenses are just a little wider, for example — but it’s largely the same setup. Here’s what you get:\n  Since the hardware is mostly unchanged, what was true of last year’s model is still true this year: it’s a great camera system overall, with a couple of quirks. The 10x optical zoom continues to be really impressive, Samsung is still cranking up the blue skies and the saturation to 11, and 100x “Space Zoom” is still a gimmick.\n  Video capabilities are largely the same, too. There’s a new autoframing feature, which will track up to 10 people and adjust automatically as people move in and out of frame. There’s also an auto frame rate feature to adjust frame rate on the fly to account for brighter or darker conditions. Video recording resolution still tops out at 8K/24p for the main camera and 4K/60p for the selfie cam.\n  This year’s photo improvements are mostly software-based, which makes them sound boring, but they’re not. Portrait mode photos have been improved with better, more detailed depth mapping (and, importantly, official support for pet portraits). The phone is better able to identify small details on a subject like individual hairs and keep them sharp rather than blurring them into the background.\n This change has resulted in some of the most impressive portrait mode photos I’ve seen from a smartphone yet. Portraits from the wide lens still aren’t totally convincing — even if the depth mapping is better, elements in the foreground are sharp where they shouldn’t be. But photos from the 3x zoom in good lighting look excellent — pets and humans alike. It can still get tripped up on some details, but it gets a lot right, even wispy hair and glasses.\n I’m a little less enthusiastic about the night photography improvements — they’re fine, just not as impressive. You can now use night mode and shoot a 108-megapixel, full-res image at the same time where previously you could do one or the other. This is only possible in  very dark conditions, where a little moon icon will appear on-screen to enable night mode. Without night mode, a high-res image in these conditions looks quite bad, so the bar is sort of low to start with. You get a slightly better 108-megapixel image rather than a very noisy one.\n  It’s also possible to apply night mode to the selfie camera, and similarly, it has to be really dark for the option to appear. I’m impressed that the camera can find enough light to make *any* usable photo of me sitting very still in near-total darkness, but the results are so unflattering that I think I’d rather just have no photo at all.\n  Samsung has also officially graduated its  Expert RAW app out of beta with the S22 Ultra, a multi-frame RAW capture app similar to Apple’s ProRAW. Expert RAW captures multiple frames and merges them into a single DNG file, combining the benefits of computational photography with the post-processing flexibility of a RAW file. To use the feature, you need to download the Expert RAW app from the Galaxy app store — it’s an entirely separate camera app, and it’s not preloaded on the phone. It provides access to manual exposure controls, and you can use it with any of the rear cameras.\n The resulting RAW files are huge, but they’re more malleable than a traditional, single-frame RAW file from the standard camera app. Pushing shadows all the way up on a standard RAW photo reveals some unpleasant banding. The multi-frame RAW is noisy but tolerates the edit better because it has that much more information to work with. Is this a difference you’re going to see on an Instagram-sized image? Probably not. But if you’re a photo geek who likes to tinker with post-processing, it’s a really nice tool to have on hand for the occasions that call for it.\n  One logistical note — there’s a shortcut in the Expert RAW app to take your photo directly into Lightroom  for Samsung to edit it. This is a version of Lightroom Mobile that you need to download from — you guessed it — the Galaxy app store. Samsung will give you a two-month free trial of the app, but after that, you’ll need an Adobe license, which will run you a minimum of $120 for a year. Or, you know, just download Snapseed for free — Expert RAW gives you a standard DNG file you can take to any photo editing software that supports it.\n   The Galaxy S22 Ultra ships with One UI 4.1, Samsung’s take on Android 12. I like it, for the most part. I wasn’t sure how I’d feel about the whole “match the UX to your wallpaper” thing, but it’s actually nice. This is a major new feature of Android 12, and though Samsung’s implementation doesn’t go nearly as far as Google’s version for Pixel phones, it’s just enough to make the phone feel a little more personal to me.\n Samsung has also mercifully removed the ads that once sat at the top of the page on the weather app. But just when I feel like the company is scaling back its often in-your-face pre-downloads and ads, I get a push notification about a promotion for Samsung Credit if I buy an S22. On this S22 Ultra. Or a Samsung Pay cash back offer slides across my screen when I open Hulu. This feels especially frustrating and out of place on a $1,200 phone, and I do not care for it.\n As much as I dislike some of Samsung’s UI choices, the company comes through where it counts with a very good support policy. The S22 series  will get “up to” four generations of Android OS updates, which is one more year than Google promises for its own devices and just about the best policy you’ll find for an Android phone — if the company does make good on four OS upgrades. I’m not a climate scientist, but I’m willing to bet that  not making people buy a new phone every two years has a bigger environmental impact than recycling fishing nets into the phone chassis  or whatever it’s doing.\n  It’s hard to come up with things that the Galaxy S22 Ultra can’t do. Can I make a GIF from a video I took and paste it into a note that’s pinned to my home screen? Yes. Can I take a clear photo of the top of Seattle’s Smith Tower while standing several blocks away at street level? Yes. Can I take a picture of my dishwasher’s model number, convert it to text, and paste it into Google as I search for a part that mysteriously vanished into thin air? Also yes.\n It can do just about anything you can reasonably expect a slab-style phone in 2022 to do. But the S22 Ultra is not a phone for just anyone. Do you really want to embrace the stylus life, or are you merely stylus-curious? Will you really use that 10x lens again and again, or will you just take a few photos with it and forget that it’s there? Do you plan to take and edit 40-plus-MB RAW files on your phone more than once or twice? Take a good look in the mirror and ask yourself these questions before you spend $1,200 on this phone (and potentially another $50 on a charger).\n If you’re someone who would get the most out of the Ultra, you probably already know it\n Really, Samsung has already done the work of judging whether this phone is for you. If you’re someone who would get the most out of the Ultra, you probably already know it. If you’re questioning whether it would be worth it, then you’d probably be just fine with the S22 Plus.\n For someone who does plan to make regular use of its powerful but rather niche features, the S22 Ultra will be a phone like no other on the market. Some UI quirks remain, and battery life is disappointing. But if you can live with these shortcomings and navigate the sometimes steep learning curve of the S Pen life, then you’ll be well rewarded with a device that’s truly one of a kind.", "posttime": "2022-02-22 00:59:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "性能,手写笔,galaxy,手机", "title": "三星Galaxy S22 Ultra review：出色的性能、改进的摄像头，以及受欢迎的S-Pen支持，但暗淡的电池和手写笔可能并不适合所有人", "title_en": "Samsung Galaxy S22 Ultra review: great performance, improved cameras, and welcome S-Pen support, but lackluster battery and the stylus might not suit everyone", "transed": 1, "url": "https://www.theverge.com/22941246/samsung-galaxy-s22-ultra-review-price-screen-specs-stylus?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["性能", "手写笔", "galaxy", "手机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "主持人注意：这篇文章最初是在轻量级的同类型需求语法线程中，但只是因为这个线程被锁定了。我们重新打开了这个帖子，并移动了这个帖子，将其与该帖子中的技术讨论分开。有人问我更多的信息：很抱歉，我不了解快速发展，从去年年中开始就没有加入核心团队。我没有足够的背景，无法在这里得出明智的意见-Chris嗯明白了很遗憾。。。", "note_en": "Moderator note: this post was originally in the light-weight same-type requirement syntax thread, but only because this thread was locked.  We have re-opened this thread and moved this post to separate it from the technical discussion in that thread.  Someone asked for more information:   I'm sorry but I don't follow swift evolution and haven't been a part of the core team since middle of last year. I don't have enough context to have an informed opinion here.  -Chris    Hmm got it, its sad that...", "posttime": "2022-02-22 00:56:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拉特纳,lattner,帖子", "title": "克里斯·拉特纳离开了斯威夫特核心团队", "title_en": "Chris Lattner left Swift core team", "transed": 1, "url": "https://forums.swift.org/t/core-team-to-form-language-workgroup/55455/6", "via": "", "real_tags": ["拉特纳", "lattner", "帖子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项对数万篇文章的分析显示，与付费文章相比，来自低收入地区的开放获取论文的主要作者要少得多。研究结果表明，期刊公开发表文章所收取的费用对中低收入国家的作者构成了障碍——科学家此前曾怀疑这一点，但发现很难证明这一点。\n越来越多的学术期刊——包括《自然》杂志——一直在开放获取它们的文章，部分原因是资助者的要求（《自然》的新闻团队在编辑上独立于其出版商Springer Nature）。尽管这一转变使学术文献更容易获取，但许多研究人员指出，发表研究开放获取通常需要的文章处理费（APC）可能会阻止作者使用这一选项。\n埃米利奥·布鲁纳说：“开放获取的一大讽刺是，你让世界各地的作者最终能够阅读对他们完全封闭的科学文献，但最终却将他们排除在同一期刊上发表。”，盖恩斯维尔佛罗里达大学的拉丁美洲研究生态学家和学者。\n布鲁纳说，尽管科学界的许多人认识到这一点，但从经验上证明这一点是一个挑战。一个问题是，很难直接比较开放存取期刊和非开放存取期刊，因为即使来自同一出版商的期刊也可能在声誉和接受标准等因素上存在差异。\n荷兰出版商爱思唯尔（Elsevier）的“镜像期刊”（mirror journals）试点项目从2018年持续到2020年，为布鲁纳的团队提供了一个机会。根据这一计划，现有的混合期刊被称为镜像期刊，这些期刊既包含付费文章，也包含可自由访问的文章、共享标题以及编辑和同行评审过程，具有完全开放的访问版本。布鲁纳说：“这是你能做的最接近自然实验的地方。”。\n他的团队研究了38对《镜报》和《家长》期刊上发表的37000多篇文章，这些期刊大多发表付费内容。研究人员确定了每篇论文的第一作者的地理位置，然后查阅了该国的世界银行收入类别，以及该作者是否有资格根据爱思唯尔针对特定国家作者的Research 4Life计划获得全部或部分APC豁免。镜像日志的APC成本中位数为2600美元；大多数混合期刊的APC与镜像期刊的APC相同。\n总的来说，《镜报》的主要作者来自北美、东亚和太平洋地区的文章比其相应母版的付费文章多。来自低收入地区，尤其是拉丁美洲和加勒比、中东和北非以及撒哈拉以南非洲等全球南方地区的主要作者较少。《镜报》杂志上大约80%的文章的第一作者来自高收入国家，没有一篇文章的第一作者来自低收入国家。\n“当我们看到这样的结果时，它就清楚地表明，当期刊收取APCs时，出版业有非常强大的资金障碍，”巴西拉夫拉斯联邦大学的生态学家Rafael Zenni说。“这是我们每天都要面对的事情。在我们的研究资助中，几乎没有任何资源来支付出版费。”\n该团队还发现，来自符合豁免计划的国家的作者几乎从未发表过开放获取文章。布鲁纳对弃权书的无效性感到惊讶。当使用豁免时，即使大幅度的折扣也不能充分降低来自低收入地区的作者的成本，他们通常从自己的口袋里支付APC。\n“众所周知，APC会毫无手段地阻止作者，但这种量化这些作者的经济障碍的特殊方法是新的，我认为它应该是有说服力的，”马萨诸塞州剑桥哈佛大学学术交流办公室主任彼得·苏伯说。“APC扭曲了研究，他们排斥作者，我们都应该设法克服这些障碍，”苏伯说。", "note_en": "Open-access papers have drastically fewer lead authors from low-income regions than do paywalled articles, an analysis of tens of thousands of articles shows. The findings suggest that the fees that journals charge to publish articles open access pose a barrier for authors in low- and middle-income countries — something that scientists had previously suspected but found difficult to demonstrate.\n Increasing numbers of scholarly journals — including  Nature — have been making their articles open access, driven in part by requirements from funders ( Nature’s news team is editorially independent of its publisher Springer Nature). Although this shift has been making the scholarly literature more widely accessible, many researchers have noted that the article-processing charges (APCs) typically required to publish research open access can deter authors from using this option.\n “One of the great ironies of open access is that you grant authors around the world the ability to finally read the scientific literature that was completely closed off to them, but it ends up excluding them from publishing in the same journals,” says Emilio Bruna, an ecologist and scholar of Latin American studies at the University of Florida in Gainesville.\n Although many in the scientific community recognize this, it’s been a challenge to demonstrate it empirically, says Bruna. One problem is the difficulty of directly comparing open-access and non-open-access journals, because even those from the same publisher might differ in factors such as reputation and standards of acceptance.\n The Dutch publisher Elsevier’s ‘mirror journals’ pilot project, which ran from 2018 to 2020, offered Bruna’s team an opportunity. Under this programme, existing hybrid journals, which contain both paywalled and freely accessible articles, shared titles and editorial and peer-review processes with fully open-access versions, termed mirror journals. “It’s as close as you can get to a natural experiment,” Bruna says.\n His group examined more than 37,000 articles published in 38 pairs of mirror and ‘parent’ journals, which mostly published paywalled content. The researchers identified the geographical location of each paper’s first author, then looked up the country’s World Bank income category and whether the author qualified for a full or partial APC waiver under Elsevier’s Research4Life programme for authors from certain countries. The APCs for the mirror journals cost a median of US$2,600; most of the hybrid journals had APCs identical to those of their mirror journals.\n  Overall, mirror journals had more articles with lead authors from North America, East Asia and the Pacific region than did paywalled articles in their corresponding parent versions. They had fewer lead authors from lower-income areas, in particular those in the global south, such as Latin America and the Caribbean, the Middle East and North Africa, and sub-Saharan Africa. Around 80% of articles in mirror journals had first authors from high-income countries, and none had first authors from low-income countries.\n “When we see results like this, it just makes it crystal clear that there is a very strong financial barrier for publishing when journals charge APCs,” says Rafael Zenni, an ecologist at the Federal University of Lavras in Brazil. “It’s something that we face every day. In our research grants, there are rarely any resources for publishing fees.”\n The team also found that authors based in countries eligible for the waiver programme almost never published open-access articles. Bruna was surprised by how ineffective waivers seemed to be. And when waivers are used, even large discounts don’t reduce the cost enough for authors from lower-income regions, who often pay APCs out of their own pockets.\n “It’s widely known that APCs deter authors without means, but this particular method of quantifying the economic barrier to these authors is new and I think it should be persuasive,” says Peter Suber, director of the Harvard Office for Scholarly Communication in Cambridge, Massachusetts. “APCs distort research they exclude authors, and we should all be trying to find ways to overcome those barriers,” says Suber.", "posttime": "2022-02-22 00:54:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,access,作者", "title": "开放获取出版费用让全球南方的研究人员望而却步", "title_en": "Open-access publishing fees deter researchers in the global south", "transed": 1, "url": "https://www.nature.com/articles/d41586-022-00342-w", "via": "", "real_tags": ["人员", "access", "作者"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对图像进行处理和增强似乎是当前数字时代所特有的。Kattendijke编年史是15世纪晚期来自低地国家的手稿，包含了模拟图像编辑的迷人例子。\n乍一看，船上一群人的形象可能是一幅直接的木刻画，被粘贴到手稿中（图1）。自15世纪下半叶以来，单叶版画——木刻和版画——在手写书籍中的使用频率更高（见Rudy 2019），这个例子似乎并不特别。然而，仔细观察就会发现，有几个迹象表明，这张照片的内容远远超出了人们的想象。画面中有些倾斜的线条，以及船与陆地之间的水在表现方式上的不一致，都指向了对图像的模拟操作。在进一步检查这些编辑并研究它们对中世纪晚期图像设计的相关性和意义之前，先对手稿进行简要介绍。\n所谓的《卡滕迪基纪事》的名字来源于17世纪的所有者、卡滕迪基的约翰·惠森（1566-1634）。在20世纪90年代，他的后代将手稿提供给了一个小型研究团队，该团队在2005年推出了一个版本，其中有一个深入的介绍，侧重于文本、纹章和密码学方面，并探索了编年史作者的概况（Janse等人，2005年）。后者在荷兰工作（可能是哈勒姆？）1491年或之后不久完成了这本书。Van Anrooij、Biemans和Janse将他视为整个手稿背后的策划人，并将他描述为一个非专业人士（即，不是专业知识分子）和一个有才华的收受赌注者。如今，该手稿保存在海牙皇家图书馆，并以高质量的数字格式在线提供（https://www.kb.nl/kattendijkekroniek).\n该文本汇编了至少六份15世纪的资料，主要是以手稿和印刷品形式流传的编年史。其中包括1480年由简·维登纳在乌得勒支印刷的《时间分册》的荷兰语译本、1478年由杰拉德·列夫出版的所谓的《古兹·克朗涅耶》或《小古达纪事》（Historie van Hollant、van Zeelat ende Vriesland ende van den sticht van Utrecht）和拉乌尔·勒斐夫的两部历史小说，雅各布·贝拉特在哈勒姆出版（1484-1485）。大部分编年史都是安森·詹斯所描述的复杂文本编纂方法的结果。有时，作者同时使用多个来源，并将它们交织成一个“新”文本，在其他情况下，他从现有文本中提取大量段落，并将其用作构建新叙事的基石。在文本附带的图像中可以观察到类似的编译模式。\n最初，该法典包含不少于144幅图像。尽管其中许多已经不复存在——虔诚的路易的图像是说明性的（图2）——但这些图像仍然完好无损，有助于揭示编辑过程。所有图像都可以被视为“混合媒体图像”：它们由木刻和/或雕刻组成，通过绘画元素和色彩增强。直到现在，人们才注意到《卡滕迪克纪事》中使用的版画。我希望在即将发表的一篇文章中讨论手稿中采用的各种编辑策略，这篇文章基于我去年10月在“1400-1700年早期现代欧洲定制书籍”（亚特兰大埃默里大学）会议上发表的一篇论文。在这里，我将探索一个简单的例子，它完美地展示了一个新的构图是如何从各种来源的木刻元素中创造出来的。\n这张照片描绘了一艘船在海上与流亡的阿尔比娜女王和她的姐妹们在一起。据传说，她们最终将在阿尔比昂（现在的英国）落脚。这张照片是由四种不同的木刻版画编辑而成。该船和该公司的一个主要部分来自一幅基督布道木刻画，背景是撒种人的寓言，最初是为1487年版的《基督的生活》（Boeck vanden leven Ihesu Christi）设计和切割的，由杰拉德·利乌（Gerard Leeu）在安特卫普印刷（Kok 2013，第85.27号；Janse等人，2005年）。基督和他的使徒们不得不为最初占据海岸的人群让位（图3）。\n为了让船更拥挤（毕竟阿尔比娜有三十个姐妹），从《玛丽和约瑟夫的婚姻》的木刻版画上取下了两个女性头像，这是杰拉德·利厄在他的许多宗教版本中使用的一个重要木刻系列（Kok 2013，第74.7号；Dlabacova 2017）（图4）。\n还有一个妹妹的空间，她被从一幅木刻画中抬了出来，木刻画描绘了“圣婴在庙里的展示”（图5），最初是为1488年的代尔夫特版《博克·范登·列文·伊赫苏·克里斯蒂》（Boeck vanden leven Ihesu Christi，Kok 2013，no.37.9）创作的。\n“新”海岸是从一幅木刻画上升起的，该木刻画用荷兰语描绘了第一次十字军东征的领袖布伊隆的戈弗雷（Godfrey of Bouillon）的故事（Kok 2013，no.187.10）。最后，木刻之间的附加波浪被手工绘制，新图像被着色（图6）。\n我为Leiden Medievalist博客写的第一篇博文（https://www.leidenmedievalistsblog.nl/articles/whos-that-guy-identity-crisis-in-a-fifteenth-century-woodcut)聚焦于“基督布道和人群中一名女性提高声音”的木刻图像（Kok 2013，第85.37号）。这张照片一直让我着迷，尤其是因为在房间右下角，有一个人似乎与基督的目光相遇。他就是那个在版画和木刻画中广泛出现的耶稣降生场景中代表约瑟夫的人物（图7）。了解了《卡滕迪克纪事》中使用的技术，我现在可以想象这位木刻设计师在他的一堆图像中有雕刻，并在寻找填充基督周围房间的人物。一旦了解了编辑技巧，你也开始注意到木刻图像中的其他人物有一个奇怪的位置，或者看起来有些飘浮。在这幅木刻画中，基督右边的人物，例如，盘旋在约瑟夫身上，似乎是一位来自崇拜场景的“重新语境化”牧羊人，尽管我无法识别他。\n通过对《卡滕迪克纪事》中混合媒体形象的研究，可以更好地了解木刻设计师所采用的策略。对这一高度物理过程的了解可以促进一种新的观看和欣赏木刻图像的方式。它让我们能够注意到木刻画的不同方面，比如在各种荷兰木刻系列中反复出现的人物。我们常常倾向于把剪贴图片作为孩子们的游戏。我们在阿尔比娜和她的姐妹们的形象中遇到的“图像编辑”或“图像合成”技术，一定是中世纪晚期书籍设计的重要组成部分，主要是在为特定文本设计图像时。Kattendijke编年史是独一无二的，因为它几乎可以让我们看到模拟图像编辑的过程，以及一部新作品的编辑过程发生在我们眼前。它展示了图像如何传播并最终以新的构图结束，以及约瑟夫如何从耶稣降生的场景转移到聆听他成年的儿子布道。\nA.Dlabačová，《宗教实践和实验性书籍制作》。文本和图像的另一种外行形式&#39；s&34；小时书&#34；在《印刷与手稿》中，《荷兰艺术史学家杂志》第9期（2）（2017年夏季）DOI:10.5092/jhna。2017.9.2.2\nB.埃伯斯·霍温，《卡滕代克》，伊恩·戈德·维尔帕克特惊喜》，摘自：荷兰格斯基耶德尼的《梅德德林根森林公园》，122（2007）1-14页。\nA.Janse、W.van Anrooij、J.A.A.M.Biemans、I.Biesheuvel、C.M.Riderikhoff和K.Tilmans、约翰·霍森·范·卡滕迪克·克罗涅克。《克洛尼克·范·霍兰特的历史》，范·泽兰特·范·弗里斯兰特·范·登·斯蒂切特·范·乌得勒支（den Haag:Instituteut voor Nederlandse Geschiedenis，2005）。\nI.科克，印在低地国家的Incunabula木刻版画，4卷。（Houten:HES&De Graaf，2013年）。\nK.M.鲁迪，图像，刀和胶锅。手稿和印刷品的早期组合（牛津：开放图书出版社，2019年）。\n©Anna Dlabačováand Leiden Medievalists博客，2022年。未经本网站作者和/或所有者的明确书面许可，严禁擅自使用和/或复制本材料。可以使用摘录和链接，前提是安娜·德拉巴乔娃（Anna Dlabačová）和莱登医学专家（Leiden Medievalists）的博客对原始内容有适当和具体的指导。", "note_en": "Manipulating and enhancing images may seem something that is particular to the current digital age. The Kattendijke Chronicle, a late fifteenth-century manuscript from the Low Countries, contains fascinating examples of analogue image editing.\n  At first sight, the image of a group of people in a boat might appear to be a straightforward woodcut that was pasted into a manuscript (fig. 1). Since single leaf prints – woodcuts and engravings – were used more often in handwritten books from the second half of the fifteenth century (see e.g., Rudy 2019), this example might not seem particularly special. A closer look, however, reveals several indications that there is much more to this image than meets the eye. The somewhat slant lines that frame the image and the inconsistency in the way the water between the ship and the strip of land is represented, point to analogue manipulation of the image. Before examining these edits further and looking into their relevance and meaning for the design of late medieval images, a brief introduction of the manuscript is in place.\n  The so-called  Kattendijke Chronicle derives its name from its seventeenth-century owner, Johan Huyssen of Kattendijke (1566-1634). In the 1990s his descendants made the manuscript available to a small team of researchers, which in 2005 resulted in an edition with an in-depth introduction that focused on textual, heraldic and codicological aspects, and explored the profile of the author of the  Chronicle (Janse et al. 2005). The latter worked in Holland (possibly Haarlem?) and completed the book in or shortly after 1491. Van Anrooij, Biemans, and Janse regard him as the mastermind behind the whole manuscript and characterize him as a lay man (i.e., not a professional intellectual) and a talented bookmaker. Nowadays the manuscript is kept at the Royal Library in The Hague and is available online in a high-quality digital format ( https://www.kb.nl/kattendijkekroniek).\n The text is a compilation of at least six fifteenth-century sources, mainly chronicles that circulated in both manuscript and print. They include the Dutch translation of the  Fasciculus temporum printed in 1480 by Jan Veldener at Utrecht, the so-called ‘Gouds kroniekje’ or ‘Little Gouda chronicle’ ( Chronike of Historie van Hollant, van Zeelant ende Vriesland ende van den sticht van Utrecht), published by Gerard Leeu in 1478, and two historical novels by Raoul Lefèvre, published by Jacob Bellaert at Haarlem (1484-1485). Most of the  Chronicleis the result of intricate methods of textual compilation that have been described by Antheun Janse. At times the author uses multiple sources simultaneously and interweaves them into a ‘new’ text, in other instances he takes substantial passages from existing texts which he uses as building blocks to create a new narrative. Similar patterns of compilation can be observed in the images that accompany the text.\n      Originally, the codex contained no less than 144 images. Even though many of them are no longer in place – the image of Louis the Pious is illustrative (fig. 2) – the images are still intact can help reveal the editing process. All images can be considered ‘mixed media images’: they are made up of woodcuts and/or engravings, enhanced through painted elements and coloring. The use of engravings in the  Kattendijke Chronicle has gone unnoticed until now. I hope to discuss the various editing strategies employed in the manuscript in an upcoming article based on a paper I presented last October during a conference on ‘Customized Books in Early Modern Europe, 1400-1700’ (Atlanta, Emory University). Here, I will explore a single example that beautifully shows how a new composition was creation out of elements of woodcuts from a variety of sources.\n  The image that portrays a ship at sea with the exiled Queen Albina and her sisters, who, according to legend would eventually end up in Albion (now Britain), is compiled out of prints from four different woodcuts. The ship and a major part of the company come from a woodcut of Christ preaching with the parable of the sower in the background, originally designed and cut for the 1487 edition of the  Book on the Life of Christ ( Boeck vanden leven Ihesu Christi), printed by Gerard Leeu at Antwerp (Kok 2013, no. 85.27; Janse et al. 2005). Christ and his apostles had to make place for the crowd that originally occupied the shore (fig. 3).\n    To make the ship more crowded (Albina, after all, had thirty sisters), two female heads were lifted from a woodcut of the ‘Marriage of Mary and Joseph’ that belonged to an important woodcut-series that Gerard Leeu used in many of his devotional editions (Kok 2013, no. 74.7; Dlabacova 2017) (fig. 4).\n    There was space for one more sister, and she was lifted from a woodcut portraying the ‘Presentation of the Christ Child at the Temple’ (fig. 5), originally created for the 1488 Delft edition of the  Boeck vanden leven Ihesu Christi (Kok 2013, no. 37.9).\n    The ‘new’ shore was lifted form a woodcut made to illustrate the story of Godfrey of Bouillon, leader of the First Crusade, in Dutch (Kok 2013, no. 187.10). Finally, the additional waves between the woodcuts were drawn in by hand and the new image was colored (fig. 6).\n     The very first blogpost I wrote for the Leiden Medievalist Blog ( https://www.leidenmedievalistsblog.nl/articles/whos-that-guy-identity-crisis-in-a-fifteenth-century-woodcut) focused on a woodcut image of ‘Christ preaching and a woman in the crowd raising her voice’ (Kok 2013, no. 85.37). This image has always fascinated me, particularly because of the figure that seems to meet Christ’s gaze, in the bottom right corner of the room. He is the same figure that represents Joseph in a Nativity scene that was widespread in engravings and woodcuts (fig. 7). Knowing the techniques used in the  Kattendijke Chronicle I can now imagine the woodcut designer had the engraving in his stack of images and was looking for figures to fill the room around Christ. Once aware of the compilation techniques, you also start to notice that other figures in woodcut images have an odd position or seem to be somewhat floating. In the case of this woodcut, the figure to the right of Christ, for example, hovering over Joseph, seems to be a ‘re-contextualized’ shepherd from an Adoration scene, although I have not been able to identify him.\n    A study of the mixed media images in the  Kattendijke Chronicle leads to a better awareness of the strategies employed by woodcut designers. Knowledge of this highly  physical process can facilitate a new way of looking at and appreciating woodcut images. It allows us to notice different aspects of woodcuts, like reoccurring figures which can be encountered in various Netherlandish woodcut series. All too often we tend to set aside cutting out and pasting images as child’s play. The ‘image editing’ or ‘image compositing’ technique that we are confronted with in the image of Albina and her sisters, must have been quite an essential part of late medieval book design, principally when designing images for a particular text. The  Kattendijke Chronicle is unique because it almost allows us to see the process of analogue image editing and the compilation of a new composition take place before our eyes. It shows how images could travel and end up in a new composition, and how Joseph might have moved from the Nativity scene to listening to his grown son preach.\n  A. Dlabačová, ‘Religious Practice and Experimental Book Production. Text and Image in an Alternative Layman&#39;s &#34;Book of Hours&#34; in Print and Manuscript’,  Journal of Historians of Netherlandish Art 9(2) (Summer 2017) DOI: 10.5092/jhna.2017.9.2.2\n B. Ebels-Hoving, ‘‘Kattendyke’, een goed verpakte surprise’, in:  Bijdragen en Mededelingen betreffende de Geschiedenis der Nederlanden, 122 (2007) 1-14.\n A. Janse, W. van Anrooij, J.A.A.M. Biemans, I. Biesheuvel, C.M. Ridderikhoff and K. Tilmans,  Johan Huyssen van Kattendijke-kroniek. Die historie of die cronicke van Hollant, van Zeelant ende van Vrieslant ende van den Stichte van Utrecht (Den Haag: Instituut voor Nederlandse Geschiedenis, 2005).\n I. Kok,  Woodcuts in Incunabula printed in the Low Countries, 4 vols. (Houten: HES &amp; De Graaf, 2013).\n K.M. Rudy,  Image, Knife, and Gluepot. Early Assemblage in Manuscript and Print (Oxford: Open Book Publishers, 2019).\n © Anna Dlabačová and Leiden Medievalists Blog, 2022. Unauthorised use and/or duplication of this material without express and written permission from this site’s author and/or owner is strictly prohibited. Excerpts and links may be used, provided that full and clear credit is given to Anna Dlabačová and Leiden Medievalists Blog with appropriate and specific direction to the original content.", "posttime": "2022-02-22 00:50:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "photoshop,中世纪,medieval,图像", "title": "中世纪的Photoshop", "title_en": "Medieval Photoshop", "transed": 1, "url": "https://leidenmedievalistsblog.nl/articles/medieval-photoshop", "via": "", "real_tags": ["photoshop", "中世纪", "medieval", "图像"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌已经向我们确认，Pixel 3系列已经收到最新更新，标志着三年承诺的结束。但重温2018年的旗舰产品，我仍然忍不住对谷歌没有更努力地让其支持更长时间感到失望。谷歌可能已经满足了其营销要求，但正如我之前所说，一家致力于可持续发展和客户安全的公司如此迅速地抛弃旧智能手机是虚伪的。回顾过去几天，Pixel 3仍然是一款非常好的手机，它的使用寿命可能还剩下几年。据大家说，我&#39；我说过，没有&#39；没有什么好的技术原因使它落后。谷歌只是没有&#39；我不在乎。\nPixel 3和3 XL可能不是谷歌最畅销的机型，购买一款也有一些缺点，比如3 XL的巨大浴缸凹槽和当时Android旗舰的有限内存。当时谷歌的质量保证（QA）比现在更糟糕，我实际上不得不更换购买的Pixel 3和Pixel 3 XL，以获得没有问题的设备——我的第一个Pixel 3显示屏下有一块奇怪的玻璃，我的第一个3 XL摄像头坏了。\n坦率地说，在2018年末和2019年初，Pixel 3并不是我手机的首选。我买它是为了工作，因为我知道它对于开发者预览、Beta和早期访问Android更新都很方便。但谷歌正处于OnePlus设备的黄金时代，比如OnePlus 6T和OnePlus 7 Pro，所以我口袋里通常不是一个像素——如果是的话，它可能不是唯一的。\n有趣的是，我不喜欢Pixel 3的屏幕，这是一款LG制造的OLED，对黑色的冲击非常严重，在室外时没有其他手机那么亮，在低亮度水平下不稳定，在不太黑的主题中可以看到令人讨厌的渐变。电池寿命从一开始对我来说也很糟糕，而且随着时间的推移，情况越来越糟。最重要的是，有限的4GB内存可能意味着应用程序被挤出内存的速度比预期的要快。\n不过也不全是坏事。Pixel 3有一个很棒的摄像头，一个快速的芯片组，我喜欢这个软件，谷歌的辅助功能，比如呼叫屏幕，值得在任何其他手机上每月订阅一次。但是，客观地说，Pixel 3的800美元的发布价格让它成为了一笔糟糕的交易。\n这一切现在和2018年一样真实，但这并不意味着手机可以回收利用。\n我很高兴看到玩老式手机取得了多大的进步——我们曾经在安卓警察局有一个专门的系列，在那里我承诺使用没有任何备份的古董，并为此承担后果。它为你提供了更好地衡量随时间变化的视角，以及深入挖掘的动机，因为你必须依赖它，即使从那时起用例、需求，甚至生活的简单方面都可能发生了变化。但回到像素3，我最震惊的是它的现代感。\n我刚才提到的所有这些问题仍然存在，电池寿命是一个特别令人沮丧的问题，但客户处理的问题比使用廉价手机要糟糕得多，像素3还有其他一些好处。首先，Snapdragon 845仍然是一款速度非常快的芯片组——在重启应用程序的频率比在其他设备上要高的情况下，这款手机永远不会感到速度慢。相机仍然很好，硬件几乎与像素5a中使用的主要射手相同。\n我确实需要离充电器更近一些，但我也被最近高端手机电池寿命的延长所宠坏了。它可能缺少5G支持，也没有超宽摄像头或高刷新率显示屏，但Pixel 3感觉不像是古董。即使是在今天，它也很时髦。\n通常，我们认为停止更新的手机太旧了，你也可以升级，但像素3不是这样的。它在发布时可能是一个糟糕的交易，但它并不是一款糟糕的手机，现在也不是。我可以很容易地看到，有人对它感到满意，并将其挂在像素3上再过一两年，但这并不是很明智。\n我们对Android提供的新功能感到兴奋，但大多数Android更新实际上是为了保护您的安全。每月的补丁通常不会带来大的新变化（比如谷歌的功能删除更新），但它们会修复从主要到次要的漏洞。事实上，Android每月发布的补丁只有一个漏洞：Stagefright。\n手机不再只是打电话了。我们把它们用于银行业、投资，甚至可以用它们来纳税。它们和我们家里的个人电脑一样都是通用电脑。你可能认为手机的安全性无关紧要，但你是否安装了银行应用程序？如果你无法访问谷歌、贝宝或Facebook账户，你的生活会有多糟？这是你的手机提供的访问权限，也是你开始使用未更新的手机时面临的风险。（实际上，我有几个单独的不安全测试帐户，专门用于使用旧手机。）\n对于仍在使用Pixel 3的客户——我应该强调的是，他们为自己的手机支付了800美元或更多——手机目前仍然和其他像素一样安全。诚然，最新的更新是针对比当前支持的其他像素更早的补丁级别，但我们仍然处在一个足够近的窗口中。但随着每个月的到来，它将进一步落后。当手机变得“不安全”时，并没有硬性规定，但随着软件的落后，这是一个逐步累积的过程。\n谷歌一度认为季度更新足以满足企业使用，尽管有些公司甚至懒得可靠地完成季度更新。然而，随着时间的流逝，问题只在于发现了哪些漏洞以及它们提供的漏洞有多强。\nPixels和其他最新的安卓设备确实有一个优势，它们提供主线和APEX模块，以独立于操作系统本身更新安卓系统的核心部分；谷歌可以通过这种方法以及Play服务推出很多补丁和安全补丁。我们已经联系了谷歌，确认Pixel 3用户在这方面的期望，如果我们得到回复，我们一定会更新。但2022年“落后”的手机比2017年停止更新的手机处于更好的位置。\n最终，过时的像素可能比大多数其他安卓手机更安全，但时钟仍在滴答作响。如果没有系统级补丁支持，一些漏洞就无法修复，导致客户越来越不安全。\n上周，我再次使用Pixel 3和3 XL，与现代旗舰相比，我更喜欢较小的3，我对“旧”手机的速度感到震惊。是的，它们问世时是一笔糟糕的交易，我们都应该非常感谢谷歌最终用新的Pixel 6了解到了一美元的价值。但Pixel 3比今天仍在发布的许多中端手机都要快。\n2018年是iPhone XS问世的一年，这款手机的价格比基本型号Pixel 3高200美元，比Pixel 3 XL高100美元，目前仍在更新中。事实上，上一次iOS更新包括2015年的iPhone 6s。我知道谷歌在发布时只承诺了三年的更新，但没有什么能阻止该公司自愿超过这个数字。\n高通公司已向我确认，它仍然能够为Snapdragon 845提供高通公司特定的软件更新，虽然从安卓13开始的芯片组的内核级支持将是一个问题，但安卓12下目前的情况还不错。在安卓13登陆之前，谷歌绝对可以为Pixel 3系列提供安全补丁。\n此外，埃斯珀。io的米沙尔·拉赫曼（Mishaal Rahman）最近指出，谷歌一直在为包括Pixel 5在内的一些设备上的最新安卓版本提供安卓更新，但没有正式更新BSP（读：固件级软件），所有这些都没有得到高通公司的帮助。这意味着，如果谷歌愿意，它可能会找到一种方法，将更新推到Android 12之后（除非存在任何真正重大的技术障碍或要求以及内核情况），但在今年秋天之前更新Pixel 3系列至少是轻而易举的事。\n有了这些更新选项，我们只能得出一个结论：谷歌只是不想继续更新Pixel 3。这三年的承诺已经实现了，而且&#39；It’Pixel 3的客户赚不到更多钱。为什么要超越？\n我要强调的是Snapdragon 845&#39；Pixel 3和3 XL中的s在很长一段时间内几乎肯定会得到社区的支持。愿意解锁引导程序并安装ROM的客户可能会持续很长一段时间，尽管这种情况下的安全性不是&#39；不一样，它&#39；这是一种至少需要维护和关注客户的情况#39；是的。\n我花了很多时间思考软件更新的影响，部分是因为这是很多人不注意的事情。一旦手机停止接收它们，技术恐惧症患者可能会高兴地发现事情停止了移动和变化，但更重要的是，时钟开始滴答作响。随着安全漏洞的缓慢积累，那部废弃手机何时才能停止安全使用？随着谷歌现在放弃Pixel 3系列，并兑现了三年的更新承诺，随着时间的推移，数百万款功能完美的手机将变得不安全。\n像Project Mainline这样的努力意味着，2022年的情况比五年前要好，但安全问题仍将缓慢蔓延，系统级更新提供的隐含安全保障现在已经消失。充其量，当顾客更换它们时，它们会被回收或扔进抽屉；最糟糕的情况是，他们最终会被填埋——这是假设使用他们的人关心他们的安全，并随着时间的推移意识到风险。出于所有这些原因，谷歌可以也应该超越其最低承诺。\n当谷歌仅仅在Pixel 6承诺的基础上额外增加了一年的安全补丁时，我感到失望——三星已经超越了这一小步。我以前说过，我要再说一遍：谷歌，树立一个更好的榜样。", "note_en": "Google has confirmed to us that the Pixel 3 series has received its last update, marking the end of a three-year promise. But revisiting the 2018-era flagship, I still can’t help but be disappointed that Google didn’t try harder to keep it supported longer. Google may have met its marketing requirements, but  as I’ve said before, it’s hypocritical for a company committed to sustainability and customer security to leave old smartphones behind so quickly. Revisiting it for the last few days, the Pixel 3 is still a perfectly good phone that could have years of life left in it. And, according to everyone I&#39;ve spoken to, there aren&#39;t any good technical reasons for it being left behind. Google just doesn&#39;t care.\n    The Pixel 3 and 3 XL probably weren’t Google’s best-selling models, and there were a few drawbacks to buying one, like the 3 XL’s monstrous bathtub notch and limited RAM for an Android flagship of the period. Google’s quality assurance (QA) back then was worse than it is now, and I actually had to exchange  both the Pixel 3 and Pixel 3 XL that I purchased for coverage to get units that didn’t have issues — my first Pixel 3 had a strange blob of glass under the display, and my first 3 XL had a busted camera.\n    Frankly, in late 2018 and early 2019, the Pixel 3 wasn’t my first choice for a phone. I bought it for work, knowing that it would be handy for developer previews, betas, and early access to Android updates in general. But Google was up against the golden age of OnePlus devices like the  OnePlus 6T and  OnePlus 7 Pro, so it usually wasn’t a Pixel that was in my pocket — and if it was, it probably wasn’t alone.\n    Anecdotally, I didn’t like the screen in the Pixel 3, which was an LG-made OLED that crushed blacks pretty badly, didn’t get as bright as some other phones when outside, and was inconsistent at low brightness levels, with an annoying gradient visible in not-quite-black dark themes. Battery life was also poor for me from the start, and that only got worse with time. On top of that, the limited 4GB of RAM could mean apps got pushed out of memory faster than expected.\n It wasn’t all bad, though. The Pixel 3 had a great camera, a fast chipset, I loved the software, and Google’s Assistant features like Call Screen would be worth a monthly subscription on any other phone. But, objectively speaking, the Pixel 3’s $800 launch price made it a bad deal for what you got.\n  All this is as true now as it was in 2018, but that doesn’t mean the phone is ready to be recycled.\n    I get a kick out of seeing how far things have come by playing with older phones — we used to have a  whole  dedicated  series for it here at Android Police, where I’d commit to using an antique without any backup and suffer the consequences for it. It gives you the perspective to better measure change over time and the motivation to dig deep since you’ll have to rely on it even as use cases, requirements, and even simple aspects of life might have changed since then. But coming back to the Pixel 3, I’m most stunned by how modern it feels.\n All those issues I just mentioned are still around, and battery life was a particular point of frustration, but customers deal with much worse than that using budget phones, and the Pixel 3 has some other perks. For one, the Snapdragon 845 is still a very fast chipset — the phone never feels slow outside having to restart apps more frequently than you might experience on other devices. The camera is still very good, too, with hardware that’s nearly identical to the primary shooter still being used in the  Pixel 5a.\n     I did have to stick closer to a charger than I’d like, but I’ve also been spoiled by the increase in battery life on more recent high-end phones. It might be missing 5G support, and there’s no ultra-wide camera or high refresh rate display, but the Pixel 3 doesn’t feel like an antique. It’s legitimately snappy, even today.\n Usually, we think of phones that stop getting updates as being so old that you may as well just upgrade anyway, but the Pixel 3 isn’t like that. It may have been a bad deal at launch, but it wasn’t a bad phone, and it still isn’t today. I could easily see someone pleased with it hanging onto a Pixel 3 for another year or two very easily, but that wouldn’t be very wise.\n    We get excited about updates for the new features they deliver, but the majority of Android updates are actually to protect your safety and security. Monthly patches usually aren’t delivering big new changes (outside things like Google’s Feature Drop updates), but they do fix vulnerabilities ranging from major to minor. In fact, Android’s monthly patches only originated because of one such vulnerability:  Stagefright.\n   Phones don’t just make calls anymore. We use them for banking, investing, and we can even pay our taxes from them. They are as much general-purpose computers as our PCs at home. You might think your phone’s security doesn’t matter, but do you have a banking app installed? How much would it mess your life up if you lost access to your Google, PayPal, or Facebook account? That’s the access your phone provides, and that’s the risk you open when you start using a phone that isn’t updated. (I actually have a handful of separate insecure testing accounts specifically for using old phones.)\n For customers still using a Pixel 3 — who, I should stress, paid $800 or more for their phone — the handset is still about as secure as other Pixels right now. Admittedly, the most recent update was for an earlier patch level than other currently supported Pixels have, but we’re still in a close-enough window. But with each new month, it will fall further behind. There’s no hard and fast rule for when a phone becomes “insecure,” but it’s a sliding scale that builds up as its software is left behind.\n    At one point, Google considered quarterly updates good enough for enterprise use, though some companies are too lazy to meet  even quarterly updates reliably. As the days tick by, though, it’s just a matter of which vulnerabilities are discovered and how strong of an exploit they provide.\n Pixels and other recent Android devices do have one advantage in that they offer  Mainline and  APEX modules to update core parts of the Android system separately from the OS itself; Google can roll out a lot of fixes and security patches via that method as well as Play Services. We’ve reached out to Google to confirm what Pixel 3 owners can expect in that regard, and we’ll be sure to update if we hear back. But a phone that’s “left behind” in 2022 is in a better position than one that stopped getting updates in 2017.\n   Ultimately, an out-of-date Pixel is probably more secure than most other Android phones, but the clock is still ticking. Without system-level patch support, some vulnerabilities can’t be fixed, leaving customers increasingly less secure.\n   Using the Pixel 3 and 3 XL again over the last week — preferring the smaller 3 for its size compared to modern flagships — I was stunned at how fast the “old” phones were. Yes, they were a bad deal when they came out, and we should all be very thankful Google finally learned the value of a dollar with the new Pixel 6. But the Pixel 3 is faster than plenty of mid-range phones still being released today.\n  2018 was the year of the iPhone XS, a phone that cost $200 more than the base model Pixel 3 and $100 more than the Pixel 3 XL, and it’s still getting updates. In fact, the last iOS update included the iPhone 6s, a phone from 2015. I know that Google only committed to three years of updates at launch, but there’s nothing to keep the company from voluntarily pushing past that number.\n   Qualcomm has confirmed to me that it is still able to deliver Qualcomm-specific software updates for the Snapdragon 845, and while kernel-level support will be an issue for the chipset beginning with Android 13, things right now under Android 12 are just fine. Google  absolutely could deliver security patches for the Pixel 3 series until Android 13 lands.\n  Furthermore, Esper.io’s Mishaal Rahman recently pointed out that Google has been providing Android updates without officially updated BSPs (read: firmware-level software) for recent Android versions on some devices,  including the Pixel 5, all  without Qualcomm’s help. That means, if Google wanted to, it could probably find a way to push updates out past Android 12 (barring any really big technical hurdles or requirements and the kernel situation), but updating the Pixel 3 series until this fall is at least within easy reach.\n    With these options for updates available, there’s only one conclusion to draw: Google just doesn’t  want to keep updating the Pixel 3. That three-year promise has been satisfied, and it&#39;s not making more money from Pixel 3 customers. Why go above and beyond?\n I should stress that the Snapdragon 845 that&#39;s in the Pixel 3 and 3 XL will almost assuredly get community support for a long time. Customers willing to unlock their bootloader and install a ROM can probably carry on for quite a while, though the security in a situation like that isn&#39;t the same, and it&#39;s a situation that would require at least maintenance and attention on a customer&#39;s part.\n I spend a lot of time thinking about the impact of software updates, in part because it’s something a lot of people don’t pay attention to. Once a phone stops getting them, technophobes might be happy that things stop moving and changing, but far more importantly, the clock starts ticking. With the slow buildup of security vulnerabilities, when will that abandoned phone stop being safe to use? With Google now giving up on the Pixel 3 series with its three-year update promise fulfilled, millions of perfectly capable phones are going to become unsafe over time.\n    Efforts like Project Mainline mean this is a better situation now in 2022 than it would have been half a decade ago, but security issues are still going to creep slowly in, and the implicit guarantee of security provided by system-level updates is now gone. At best, they’ll get recycled or tossed in a drawer as customers replace them; at worst, they’ll end up in a landfill — and that’s assuming the people using them care about their security and are aware of the risks over time. For all these reasons, Google can and should push beyond its minimum commitment.\n I was underwhelmed when  Google merely added an extra year of security patches with its Pixel 6 commitment — a tiny step that has  already been eclipsed by Samsung. I’ve said it before, and I’ll say it again: Set a better example, Google.", "posttime": "2022-02-22 00:45:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,google,谷歌,本来,updated", "title": "谷歌本来可以将Pixel 3升级到Android 13，但它只是不想这么做", "title_en": "Google could have updated the Pixel 3 until Android 13, it just didn't want to", "transed": 1, "url": "https://www.androidpolice.com/the-pixel-3-deserves-longer-updates/", "via": "", "real_tags": ["android", "google", "谷歌", "本来", "updated"]}]