[{"category": "", "categoryclass": "", "imagename": "75791701faabfb63131510505622dc44.jpg", "infoid": 1006249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嘿你好啊！上周，我开始重写Shefa Products，这是阿根廷的批发电子商务。\n重写不仅仅是将其从Angular.JS(版本1，您还记得吗？)。到Next.JS和Adonis框架，而且能够更快地添加功能，并从SSG和伟大的灯塔得分中获得SEO好处。\n所以在与一些客户交谈之后，我得到的一个发现是。\n这完全说得通。商品营销就是这样一个行业，你挑选一个背包或一支笔，在上面盖上你的标志，然后把它送给你未来的客户或最好的员工。你完全需要背包或钢笔的颜色来匹配你的品牌。\n所以“让我们更容易找到与你的品牌相匹配的产品”--我想。\n(给读者的注意：重写还没有上线，但是如果你想看看这个特性的结果，我在这篇博文的末尾添加了一段视频来展示它。如果您想了解我遇到的困难以及我是如何想出还可以的解决方案的，请继续阅读：))。\n这个问题与其他问题的不同之处在于，我无意中遇到了产品图片与颜色信息没有关联的问题。\n这意味着-不像亚马逊，你从下拉列表中选择一种产品颜色，该颜色的产品图像会自动成为焦点-在这里，这是不可能的：我既有产品的颜色变化列表，也有产品的图像列表；但它们不匹配。\n所以这是一个很大的问题，没有一个简单的启发式方法可以解决它。\n我们掌握的关于颜色的唯一信息就是图片本身。所以我们必须从那里推断出来。\n例如，对于下面的两个图像，第一个图像将是绿色的，而第二个图像不是。\n拉链是绿色的，包上印有绿色标志会很不错。\n然后我们必须重新表述我们前面说过的话：我们不想要绿色的图像，我们想要的是产品的图像，上面要有一个绿色的标志。\n也许，让产品与标志的颜色搭配得很好的是一些细节，比如这种情况下的绿色拉链。因此，计算“绿色”像素并不能很好地代表我们的目标，因为这里的绿色像素数量会很少。\n我们可以创建一个深度神经网络，并教它对我们认为“配上绿色标志就行”的产品进行分类。但是训练一个模型和设置一台烧瓶服务器似乎是一件苦差事(也许这对于初创公司来说是个好主意。我想要像Fast.ai这样简单的东西，但是要将模型部署到实时服务器上)和Overkill(过度杀伤力)。我希望这个功能最多在三天内发布。\n有一个很棒的软件包叫做“颜色窃贼”，它给出了一幅图像，它告诉你图像中出现的调色板。\n在那里我们可以看到，绿色出现在调色板的第三个位置。太棒了！\n现在，我们可以使用图像的主要颜色列表，而不是使用图像。\n但是，我们如何判断一系列颜色是否构成了与绿色搭配良好的图像呢？\n一个好主意是尝试检查列表中出现的那些颜色中是否有任何一种是“绿色”的。\n判断一种随机颜色是否是一种绿色比判断它有多绿要困难得多。\n因为判断它是否是绿色，不仅意味着你知道这种颜色与纯绿色有多接近，而且还迫使你定义一种界限，区分属于绿色和不属于绿色的颜色。\n因此，与其给出肯定或否定的答案--比如“这个特定的背包与绿色品牌匹配吗？”--也许我们可以计算出一种颜色的“绿色”分数，并用它来根据产品图片的颜色与我们试图匹配的颜色的接近程度来对产品进行排序。\n现在，我们正在寻求创造一个公式，让我们知道绿色有多少是一种颜色。我们该怎么做呢？\n但为了简单起见，我只取了给定颜色和(0,255，0)之间的欧几里得距离，(0,255，0)是RGB值中的绿色。\n嗯，因为我必须给出一个公式，它也允许我按粉色、黄色或棕色排序。这些颜色不是由RGB矢量中的唯一字段表示的。\n我非常肯定有更好的方法来做这件事，这样会产生更好的结果，但就我所见，这已经足够简单和好了。\n好的好的，我给你。JavaScript不是进行繁重处理的最佳语言。\n考虑到我们有数以千计的产品，每个产品有几十个图像，每个图像调色板都有几十种颜色，用javascript实现这样大小的搜索会很快降低我们的性能。\n我最好的选择是直接在PostgreSQL上做这件事，这是我们将要使用的数据库，而且速度非常快。\n一旦我们决定在DB上执行所有这些处理，下一步就是找出如何处理！\nPostgreSQL中并没有真正的颜色类型来表示颜色，因为有一种varchar类型来表示字符串。\n立方体类型使您可以使用欧几里得空间中的坐标：计算距离、检查点是否在给定空间中等…。\n下一步将创建一个表Colors，并将多个颜色关联到单个图像。我不会详细介绍如何做到这一点，但是有数千个教程介绍了如何创建和链接表。我还写了一本数据库模式设计的简明指南，您可能会觉得有帮助。\n现在，在Colors表中，您可以添加一个CUBE类型的列，它将保存我们的颜色的实际值，即我们的“绿色”颜色的(10,220，10)RGB向量。\n现在，在javascript中，您可以保存图像的颜色列表，如下所示。\n//在Colors表中创建4行，图像调色板等待Promise.map(list_of_Colors.Slice(0，4)，(Color)=&gt；Database.raw(`Insert Into Colors(Pantone，image_id)Values(&#39；(${color})&#39；：：cube，${imageInstance.id}`)。\n注意，我们应用于color变量的：：cube类型转换包含一个长度为3的数组，每个位置都有RGB组件。\n我们必须为数据库中的每个图像执行此操作。因此创建一个处理它们的脚本。就我个人而言，我刚刚添加了一个自定义钩子，它在每次将新图像保存到数据库时运行。\n最后，要查询数据，可以使用以下SQL查询，它不仅会返回“更环保”的产品，还会为每个产品返回其中最环保的图像\nSELECT*FROM(SELECT DISTINCT ON(p.id)Near_images.Distance，p.*，pi.url from product_images.pi Join(SELECT SUM(cube_Distance(&#39；(0,255，0)&#39；：：cube，Pantone))Distance，image_id from Colors group by image_id order by 1 ASC)near_images.image_id=pi.id连接pi.上的产品p。product_id=p.id order by p.id，near_images.s。\n当客户请求另一种颜色时，请务必将(0,255，0)更改为另一种颜色。\n因此，新版本的Shefa产品仍在开发中，但这里是我上传到YouTube上的功能的一个改进！", "note_en": "Hey there! Last week I started working on a rewrite of Shefa Products which is a wholesale merchandising e-commerce for Argentina.\n The rewrite is not only to move it from Angular.JS (version 1, do you remember it?) to Next.JS and the Adonis Framework, but also to be able to add features faster and get the SEO benefits from SSG and great lighthouse scores.\n  So after talking to some customers one of the findings that I’ve had is that\n  That makes total sense. Merchandising is an industry where you basically pick a backpack or a pen, stamp your logo on it, and give it to your —future— customers or best employees. You totally need the backpack or pen colors to match your brands’.\n So “let’s make it easier to find matching products for your brand” — I thought.\n (Note to the readers: the rewrite isn’t live yet, but if you want to see the results of this feature I added a video at the end of this blogpost showcasing it. In case you want to learn about the difficulties I had and how I came up with a passable solution then read on:) )\n  What set this problem apart from other problems is that I stumbled with the the issue that the pictures of the product weren’t associated with the color information.\n That means — unlike amazon, where you pick a product color from a dropdown list and the image of the product in that color gets automatically in focus — here that wasn’t possible: I had both a list of color variations for a product, and a list of images for the product;  but they didn’t match.\n  So this was a big problem and there wasn’t an easy heuristic to solve it.\n   The only information we have about colors are the picture themselves. So we must infer it from there.\n  For example for the following two images, the first one would be green and the second one would not.\n        The zipper is green and would go great with a green logo on the bag.\n Then we must reformulate what we stated earlier: we don’t want green images,  we want images of products that go well with a green logo on them.\n Maybe what makes a product go well with the color of a logo is a little detail, like a green zipper in this case. So counting “green” pixels would not be a good proxy for our goal, because the number of green pixels here would be low.\n We could create a Deep Neural Network and teach it to classify which products we believe “would go ok when paired with a green logo”. But training a model and setting up a flask server seemed like a chore (maybe this is a great idea for a startup. I’d like something as easy as Fast.ai, but to deploy the models to a live server) and an overkill. I wanted this feature out in three days at most.\n  Well there is an amazing package called “color thief” that given an image, it tells you the palette of colors that appear in the image.\n  There we can see that a green color appears in the third position of the palette. Great!\n Now instead of working with an image, we can work with a list of its predominant colors.\n But how do we tell if a list of colors constitutes an image that goes well with a green color?\n A good Idea would to try would be to  check if any of those colors that appear in the list is  “greenish“.\n   Telling if a random color is a kind of green or not is a much harder problem that telling how green it is.\n Because telling if it’s green or not, not only implies that you know how close to the pure green that color is, but also forces you to define a kind of limit that distinguishes colors that classify as green from colors that don’t.\n So instead of giving a yes or no answer —like “does this specific backpack match a green brand?”—, maybe we can formulate a score of the “greeness” of a color, and use it to sort the products by how close their pictures’ colors are to the color we are trying to match.\n Now we are in a quest to create a formula that gives us  how much green is a color. How do we do that?\n  But for simplicity I just took the euclidean distance between the given color and (0,255,0) which is the green color in RGB values.\n  Well because I have to give a formula that also allows me to sort by pink, or yellow or brown. And those colors aren’t represented by a unique field in the RGB vector.\n I’m pretty sure there are better ways to do this which will output better results, but for what I’ve seen this is simple and good enough\n  Ok ok, I give it to you. Javascript is not the best language to do heavy processing.\n And given that we have thousands of products, with dozens of images each and with dozens of colors for each image palette, implementing a search of that size in javascript would quickly bring down our performance.\n My best alternative was doing it directly on PostgreSQL which is the database we will be using and it’s blazing fast.\n   Once we’ve decided we will do all this processing on the DB, the next step is finding out how!\n There isn’t really a  color type in PostgreSQL to represent colors as there is a varchar type to represent strings.\n  The cube type let’s you work with coordinates in a euclidean space: calculate distances, check if a point is in a given space, etc…\n     The next step will be to create a table colors, and associate many colors to a single image. I won’t go into detail onto how to do that, but there are thousands of tutorials on how to create and link tables. I’ve also written a  humble guide to database schema design which you may find helpful.\n Now, in the colors table you can add a column of type cube which will hold the actual value of our colors, that is the (10,220,10) RGB vector for our “greenish” color\n  Now, in javascript, you can save the list of colors for an image like this\n //Create 4 rows in the colors table, one for each color in the image paletteawait Promise.map(list_of_colors.slice(0, 4), (color) =&gt; Database.raw(`INSERT into colors(pantone, image_id) values(&#39;(${ color })&#39;::cube, ${ imageInstance.id }`))\n Notice the  ::cube typecast that we are applying to the color variable which holds an array of length 3 with the RGB components in each respective position.\n We must do this for each one of the images in our database. So create a script that process them. Personally I just added a custom hook that runs each time a new image is saved onto the database.\n Finally, to query the data you can use the following SQL query, that not only will return you the products that are “greener”, but also for each product, the image that is the greenest among them\n select *from ( SELECT DISTINCT ON (p.id) near_images.distance, p.*, pi.url from product_images pi join (select sum(cube_distance(&#39;(0,255,0)&#39;::cube, pantone)) distance, image_id from colors group by image_id order by 1 asc) near_images on near_images.image_id = pi.id join products p on pi.product_id = p.id order by p.id, near_images.distance asc ) resultorder by result.distance, result.id;\n Be sure to change the (0,255,0) to another color when the client requests another color.\n   So, the new version of Shefa Products is still in the works, but here is an advance of the feature I’ve uploaded to youtube!", "posttime": "2020-06-12 10:00:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "颜色,search", "title": "当你只有一杯好咖啡时如何实现按颜色搜索", "title_en": "How to Implement Search by Color When All You Have Is a Good Coffee", "transed": 1, "url": "https://www.mikealche.com/software-development/how-to-implement-search-by-color-when-all-you-have-is-a-good-coffee", "via": "", "real_tags": ["颜色", "search"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Go 1.15尚未发布。这些是正在进行的发行说明。Go 1.15预计将于2020年8月发布。\n正如GO 1.14发行说明中宣布的那样，GO 1.15现在需要MacOS 10.12 Sierra或更高版本；对以前版本的支持已经停止。\n正如GO 1.14发行说明中宣布的那样，GO 1.15在MacOS、iOS、iPadOS、watchOS和twOS(Darwin/386和Darwin/ARM端口)上取消了对32位二进制文件的支持。Go继续支持64位Darwin/AMD64和Darwin/arm64端口。\nGO 1.15现在在提供-buildmode=PIE cmd/link标志时生成Windows ASLR可执行文件。在Windows上，GO命令默认使用-buildmode=Pie。\n现在，-race和-msan标志始终启用-d=checkptr，这将检查unsafe.Pointer的使用情况。以前，除Windows之外的所有操作系统都是这种情况。\nGO构建的DLL不再导致进程在收到信号(如终端上的Ctrl-C)时退出。\n当链接Android的二进制文件时，Go 1.15会显式选择NDK的最新版本中可用的LLD链接器。LLD链接器避免了某些设备上的崩溃，并计划在未来的NDK版本中成为默认的NDK链接器。\nGO 1.15在GOARCH=ARM和GOARCH=arm64上添加了对OpenBSD 6.7的支持。以前版本的Go已经在GOARCH=386和GOARCH=AMD64上支持OpenBSD 6.7。\n在改进Linux(GOOS=Linux，GOARCH=riscv64)上64位RISC-V端口的稳定性和性能方面取得了进展。它现在还支持异步抢占。\nGOPROXY环境变量现在支持跳过返回错误的代理。代理URL现在可以用逗号(，)或竖线字符(|)分隔。如果代理URL后跟逗号，则GO命令将仅在404或410 HTTP响应之后尝试列表中的下一个代理。如果代理URL后跟管道字符，则GO命令将在出现任何错误后尝试列表中的下一个代理。请注意，GOPROXY的默认值仍然是https://proxy.golang.org，DIRECT，在出现错误时不会回退到DIRECT。\n更改-timeout标志现在会使缓存的测试结果无效。当使用较短的超时重新调用GO测试时，超时较长的测试运行的缓存结果将不再被视为通过。\nGO TEST和GO VET中的各种标志解析问题已修复。值得注意的是，GOFLAGS中指定的标志得到了更一致的处理，并且-outputdir标志现在解释相对于go命令的工作目录(而不是每个单独测试的工作目录)的相对路径。\n现在可以使用GOMODCACHE环境变量设置模块缓存的位置。GOMODCACHE的默认值是GOPATH[0]/pkg/mod，这是此更改之前模块缓存的位置。\n现在有一种解决方法可用于Windows&#34；访问被拒绝&#34；访问模块缓存的GO命令中的错误，这些错误是由外部程序并发扫描文件系统引起的(请参见问题#36568)。默认情况下未启用解决方法，因为当低于1.14.2和1.13.10的GO版本与同一模块缓存同时运行时，使用该解决方法是不安全的。可以通过明确设置环境变量GODEBUG=modcacheunzipinplace=1来启用它。\nVET工具现在警告格式字符串(X)的转换，其中x的整数类型不是rune或byte。使用围棋的经验表明，这种形式的许多转换错误地假设字符串(X)的计算结果为整数x的字符串表示形式。实际上，它的计算结果是包含x值的Utf-8编码的字符串。例如，字符串(9786)的计算结果不是字符串&#34；\\xe2\\x98\\xba&#34；或&#34；☺&#34；。\n正确使用字符串(X)的代码可以重写为字符串(rune(X))。或者，在某些情况下，使用合适的字节片buf调用utf8.EncodeRune(buf，x)可能是正确的解决方案。其他代码最有可能使用strtru.itoa或fmt.Sprint。\n我们正在考虑在未来的围棋版本中禁止转换。也就是说，当x的类型为RUNE或BYTE时，语言将更改为仅允许整数x的字符串(X)。这样的语言更改不会向后兼容。我们用这次兽医检查作为改变语言的第一步。\n当类型断言总是失败时，VET工具现在会就从一种接口类型到另一种接口类型的类型断言发出警告。如果两种接口类型实现同名但类型签名不同的方法，则会发生这种情况。\n没有理由编写总是失败的类型断言，因此任何触发此VET检查的代码都应该重写。\n我们正在考虑在GO的未来版本中禁止不可能的接口类型断言。这样的语言更改不会向后兼容。我们用这次兽医检查作为改变语言的第一步。\n如果使用其类型派生自以下任一值的值调用Panic：bool、Complex 64、Complex 128、float32、float64、int、int8、int16、int32、int64、string、uint、uint8、uint16、uint32、uint64、uintptr，则将打印该值，而不仅仅是其地址。以前，这只适用于恰好属于这些类型的值。\n在Unix系统上，如果KILL命令或KILL系统调用用于向GO程序发送SIGSEGV、SIGBUS或SIGFPE信号，并且如果该信号未通过os/Signal.Notify进行处理，则GO程序现在将可靠地崩溃并跟踪堆栈。在早期版本中，该行为是不可预测的。\n现在，小对象的分配在内核数量高的情况下执行得更好，并且具有更低的最坏情况延迟。\n关闭信道上的非阻塞接收现在的性能与开放信道上的非阻塞接收一样。\n包不安全的安全规则允许在调用某些函数时将不安全的指针转换为uintptr。以前，在某些情况下，编译器允许多个链式转换(例如，Syscall.Syscall(…。，uintptr(uintptr(Ptr))，…)。。编译器现在只需要一个转换。应更新使用多个转换的代码以满足安全规则。\n与Go 1.14相比，Go 1.15通过消除某些类型的GC元数据并更积极地消除未使用的类型元数据，将典型的二进制大小减少了约5%。\n工具链现在通过将函数与32字节边界对齐并填充跳转指令来减轻GOARCH=AMD64上的英特尔CPU勘误表SKX102。虽然此填充增加了二进制大小，但上面提到的二进制大小改进足以弥补这一点。\nGo 1.15向编译器和汇编器都添加了-specte标志，以允许启用Spectre缓解。这些几乎不应该是需要的，主要是作为一种“纵深防御”机制来提供的。有关详细信息，请参阅Spectre维基页面。\n编译器现在拒绝对其应用的声明没有意义的//go：编译器指令，并显示错误的&#34；放错位置的编译器指令。这种错误应用的指令以前被破坏过，但是被编译器悄悄地忽略了。\n编译器s-json优化日志记录现在报告大型(&gt；=128字节)副本，并包括对转义分析决策的解释。\n此版本对GO链接器进行了实质性改进，减少了链接器资源的使用(时间和内存)，并提高了代码的健壮性/可维护性。\n对于一组具有代表性的大型围棋程序，对于在AMD64架构上运行的基于ELF的操作系统，链接速度加快了20%，平均需要的内存减少了30%，而对于其他架构/操作系统组合，改进更为温和。\n提高链接器性能的关键因素是最新重新设计的目标文件格式，以及内部阶段的改进以提高并发性(例如，并行地对符号应用重新定位)。GO 1.15中的目标文件比其1.14等效项稍大。\n这些更改是更新Go链接器的多版本项目的一部分，这意味着在未来的版本中将会有更多的链接器改进。\nGo 1.15包含一个新的包，time/tzdata，它允许将时区数据库嵌入到程序中。即使本地系统上的时区数据库不可用，导入此软件包(作为import_&#34；time/tzdata&#34；)也允许程序查找时区信息。您还可以通过构建带有-tag的timetzdata来嵌入时区数据库。这两种方法都会使程序的大小增加约800KB。\nGo 1.15将把C类型的EGLConfig转换为Go类型的uintptr。这一变化类似于Go 1.12及更新版本对EGLDisplay、Darwin的CoreFoundation和Java的JNI类型的处理方式。有关详细信息，请参阅CGO文档。\n与往常一样，库有各种微小的更改和更新，这些更改和更新都考虑到了兼容性的Go 1承诺。\n该软件包现在定义了PE文件格式使用的IMAGE_FILE、IMAGE_SUBSYSTEM和IMAGE_DLLCHARACTERISTICS常量。\ncrypto/rsa、crypto/ecdsa和crypto/ed25519包中的PrivateKey和PublicKey类型现在有了一个EQUAL方法来比较密钥的等价性或为公钥建立类型安全接口。方法签名与Go-CMP的相等定义兼容。\n新的SignASN1和VerifyASN1函数允许以标准ASN.1 DER编码生成和验证ECDSA签名。\n新的MarshalCompresded和UnmarshalCompresded函数允许以压缩格式对NIST椭圆曲线点进行编码和解码。\n新的Dialer类型及其DialContext方法允许使用上下文连接TLS服务器并与其握手。\nConfig类型的新VerifyConnection回调允许为每个连接自定义验证逻辑。它可以访问ConnectionState，其中包括对等证书、SCT和装订的OCSP响应。\n自动生成的会话票证密钥现在每24小时自动轮换一次，有效期为7天，以限制其对向前保密的影响。\n在TLS 1.2和更早版本中，会话密钥重复用于恢复的连接的会话票证生存期现在被限制为7天，这也是为了限制它们对转发保密性的影响。\nRFC 8446中指定的客户端降级保护检查现已实施。这可能会导致客户端遇到行为类似于未经授权的降级攻击的中间盒时出现连接错误。\n如果证书上的名称或正在验证的名称(使用VerifyOptions.DNSName或VerifyHostname)无效，现在将不区分大小写进行比较，而不进行进一步处理(不使用通配符或去除尾随点)。无效名称包括包含字母、数字、连字符和下划线以外的任何字符的名称、标签为空的名称以及证书上带有尾随圆点的名称。\n现在，默认情况下禁用了在不存在主题替代名称时将CommonName字段视为主机名的过时传统行为。可以通过向GODEBUG环境变量添加值x509IGNORRECN=0来临时重新启用它。如果公用名是无效的主机名，则始终忽略它。\n新的CreateRevocationList函数和RevocationList类型允许创建符合RFC 5280的X.509 v2证书吊销列表。\n如果模板是CA并且没有显式指定，CreateCertificate现在会自动生成SubjectKeyId。\n如果模板指定MaxPathLen但不是CA，CreateCertificate现在会返回错误。\n在MacOS以外的Unix系统上，SSL_CERT_DIR环境变量现在可以是冒号分隔的列表。\n在MacOS上，无论CGO是否可用，二进制文件现在始终链接到Security.framework以提取系统信任根。产生的行为应该与操作系统验证器更一致。\n按照包文档中已经说明的规则，将JSON数组解码为片不再重用任何现有片元素。\n解码时引入最大嵌套深度的内部限制。这降低了深度嵌套的输入使用大量堆栈内存的可能性，甚至导致Goroutine堆栈超出限制的可能性。\n编码器总是小心翼翼地避免使用XML开头的名称空间前缀，XML规范保留了这些前缀。现在，更严格地遵循规范，该检查不区分大小写，因此也避免了以XML、XML等开头的前缀。\n当FLAG包看到-h或-help，并且没有定义这些标志时，FLAG包将打印用法消息。如果FlagSet是使用ExitOnError创建的，则FlagSet.Parse将以状态2退出。在此版本中，-h或-help的退出状态已更改为0。特别是，这适用于命令行标志的默认处理。\nTempDir和TempFile现在拒绝包含路径分隔符的模式。也就是说，诸如ioutil.TempFile(&#34；/tmp&#34；，&#34；../base*&#34；)之类的调用将不再成功。这可以防止意外的目录遍历。\n如果I/O操作超过Conn.SetDeadline、Conn.SetReadDeadline或Conn.SetWriteDeadline方法设置的截止日期，它现在将返回一个错误，该错误是或包装os.ErrDeadlineExceed。这可用于可靠地检测错误是否由于超过最后期限而引起。早期版本建议对错误调用Timeout方法，但是I/O操作可能会返回错误，即使没有超过期限，超时也会返回TRUE。\n新的Resolver.LookupIP方法支持特定于网络并接受上下文的IP查找。\n作为对抗请求走私攻击的强化措施，解析现在变得更加严格：不再像SP和HTAB那样修剪非ASCII空格，并且不再支持传输编码(&#34；Identity&#34；Transfer-Encoding)。\nReverseProxy现在支持在该字段的传入Request.Header映射条目为空时不修改X-Forwarded-For标头。\n当ReverseProxy处理的交换协议(如WebSocket)请求被取消时，后端连接现在可以正确关闭。\n所有配置文件端点现在都支持&#34；秒&#34；参数。如果存在，端点将分析指定秒数并报告差异。CPU配置文件和跟踪端点中的&#34；秒&#34；参数的含义没有改变。\n新的URL字段RawFragment和方法EscapedFragment提供关于特定片段的确切编码的详细信息并对其进行控制。它们类似于RawPath和EscapedPath。\n新的URL方法redated以字符串形式返回URL，并将所有密码替换为xxxxx。\n如果I/O操作超过了File.SetDeadline、File.SetReadDeadline或File.SetWriteDeadline方法设置的截止日期，它现在将返回一个错误，该错误是或包装os.ErrDeadlineExceed。这可用于可靠地检测错误是否由于超过最后期限而引起。早期版本建议对错误调用Timeout方法，但是I/O操作可能会返回错误，即使没有超过期限，超时也会返回TRUE。\n软件包os和net现在会自动重试使用EINTR失败的系统调用。以前，这会导致虚假故障，随着异步抢占功能的增加，这种情况在GO 1.14中变得更加常见。现在这件事被透明地处理了。\nPackage Reflect现在不允许访问所有未导出字段的方法，而以前它允许访问未导出的嵌入字段的方法。依赖于先前行为的代码应更新为访问封闭变量的相应提升方法。\n新的Regexp.SubexpIndex方法返回正则表达式中具有给定名称的第一个子表达式的索引。\nFormatComplex将复数转换为(a+bi)形式的字符串，其中a和b是实部和虚部。\nParseComplex将字符串转换为指定精度的复数。ParseComplex接受N+Ni格式的复数。\n新方法Map.LoadAndDelete原子地删除一个键，并返回先前的值(如果存在)。\n在Unix系统上，使用SysProcAttr的函数现在将拒绝同时设置Setctty和前台字段的尝试，因为它们都使用Ctty字段，但以不兼容的方式进行设置。我们预计很少有现有的程序集两个字段于一身。\n设置Setctty字段现在要求将Ctty字段设置为由ProcAttr.Files字段确定的子进程中的文件描述符编号。使用子描述符总是有效的，但在某些情况下，使用父文件描述符也是有效的。某些设置Setctty的程序需要更改Ctty的值才能使用子描述符编号。\n现在可以在WINDOWS/AMD64上调用返回浮点值的系统调用。\nTesting.T类型现在有一个Deadline方法，该方法报告测试二进制文件超过其超时的时间。\n调用os.Exit不再需要TestMain函数。如果TestMain函数返回，则测试二进制文件将使用m.Run返回的值调用os.Exit。\n新方法T.TempDir和B.TempDir返回在测试结束时自动清理的临时目录。", "note_en": "Go 1.15 is not yet released. These are work-in-progress release notes. Go 1.15 is expected to be released in August 2020.\n     As  announced in the Go 1.14 release notes, Go 1.15 now requires macOS 10.12 Sierra or later; support for previous versions has been discontinued.\n As  announced in the Go 1.14 release notes, Go 1.15 drops support for 32-bit binaries on macOS, iOS, iPadOS, watchOS, and tvOS (the  darwin/386 and  darwin/arm ports). Go continues to support the 64-bit  darwin/amd64 and  darwin/arm64 ports.\n  Go 1.15 now generates Windows ASLR executables when  -buildmode=pie cmd/link flag is provided. Go command uses  -buildmode=pie by default on Windows.\n The  -race and  -msan flags now always enable  -d=checkptr, which checks uses of  unsafe.Pointer. This was previously the case on all OSes except Windows.\n Go-built DLLs no longer cause the process to exit when it receives a signal (such as Ctrl-C at a terminal).\n  When linking binaries for Android, Go 1.15 explicitly selects the  lld linker available in recent versions of the NDK. The  lld linker avoids crashes on some devices, and is planned to become the default NDK linker in a future NDK version.\n  Go 1.15 adds support for OpenBSD 6.7 on  GOARCH=arm and  GOARCH=arm64. Previous versions of Go already supported OpenBSD 6.7 on  GOARCH=386 and  GOARCH=amd64.\n  There has been progress in improving the stability and performance of the 64-bit RISC-V port on Linux ( GOOS=linux,  GOARCH=riscv64). It also now supports asynchronous preemption.\n   The  GOPROXY environment variable now supports skipping proxies that return errors. Proxy URLs may now be separated with either commas ( ,) or pipe characters ( |). If a proxy URL is followed by a comma, the  go command will only try the next proxy in the list after a 404 or 410 HTTP response. If a proxy URL is followed by a pipe character, the  go command will try the next proxy in the list after any error. Note that the default value of  GOPROXY remains  https://proxy.golang.org,direct, which does not fall back to  direct in case of errors.\n  Changing the  -timeout flag now invalidates cached test results. A cached result for a test run with a long timeout will no longer count as passing when  go  test is re-invoked with a short one.\n  Various flag parsing issues in  go  test and  go  vet have been fixed. Notably, flags specified in  GOFLAGS are handled more consistently, and the  -outputdir flag now interprets relative paths relative to the working directory of the  go command (rather than the working directory of each individual test).\n  The location of the module cache may now be set with the  GOMODCACHE environment variable. The default value of  GOMODCACHE is  GOPATH[0]/pkg/mod, the location of the module cache before this change.\n A workaround is now available for Windows &#34;Access is denied&#34; errors in  go commands that access the module cache, caused by external programs concurrently scanning the file system (see  issue #36568). The workaround is not enabled by default because it is not safe to use when Go versions lower than 1.14.2 and 1.13.10 are running concurrently with the same module cache. It can be enabled by explictly setting the environment variable  GODEBUG=modcacheunzipinplace=1.\n   The vet tool now warns about conversions of the form  string(x) where  x has an integer type other than  rune or  byte. Experience with Go has shown that many conversions of this form erroneously assume that  string(x) evaluates to the string representation of the integer  x. It actually evaluates to a string containing the UTF-8 encoding of the value of  x. For example,  string(9786) does not evaluate to the string  &#34;9786&#34;; it evaluates to the string  &#34;\\xe2\\x98\\xba&#34;, or  &#34;☺&#34;.\n Code that is using  string(x) correctly can be rewritten to  string(rune(x)). Or, in some cases, calling  utf8.EncodeRune(buf, x) with a suitable byte slice  buf may be the right solution. Other code should most likely use  strconv.Itoa or  fmt.Sprint.\n  We are considering prohibiting the conversion in a future release of Go. That is, the language would change to only permit  string(x) for integer  x when the type of  x is  rune or  byte. Such a language change would not be backward compatible. We are using this vet check as a first trial step toward changing the language.\n  The vet tool now warns about type assertions from one interface type to another interface type when the type assertion will always fail. This will happen if both interface types implement a method with the same name but with a different type signature.\n There is no reason to write a type assertion that always fails, so any code that triggers this vet check should be rewritten.\n  We are considering prohibiting impossible interface type assertions in a future release of Go. Such a language change would not be backward compatible. We are using this vet check as a first trial step toward changing the language.\n  If  panic is invoked with a value whose type is derived from any of:  bool,  complex64,  complex128,  float32,  float64,  int,  int8,  int16,  int32,  int64,  string,  uint,  uint8,  uint16,  uint32,  uint64,  uintptr, then the value will be printed, instead of just its address. Previously, this was only true for values of exactly these types.\n On a Unix system, if the  kill command or  kill system call is used to send a  SIGSEGV,  SIGBUS, or  SIGFPE signal to a Go program, and if the signal is not being handled via   os/signal.Notify, the Go program will now reliably crash with a stack trace. In earlier releases the behavior was unpredictable.\n Allocation of small objects now performs much better at high core counts, and has lower worst-case latency.\n  Non-blocking receives on closed channels now perform as well as non-blocking receives on open channels.\n  Package  unsafe&#39;s  safety rules allow converting an  unsafe.Pointer into  uintptr when calling certain functions. Previously, in some cases, the compiler allowed multiple chained conversions (for example,  syscall.Syscall(…,  uintptr(uintptr(ptr)),  …)). The compiler now requires exactly one conversion. Code that used multiple conversions should be updated to satisfy the safety rules.\n Go 1.15 reduces typical binary sizes by around 5% compared to Go 1.14 by eliminating certain types of GC metadata and more aggressively eliminating unused type metadata.\n The toolchain now mitigates  Intel CPU erratum SKX102 on  GOARCH=amd64 by aligning functions to 32 byte boundaries and padding jump instructions. While this padding increases binary sizes, this is more than made up for by the binary size improvements mentioned above.\n Go 1.15 adds a  -spectre flag to both the compiler and the assembler, to allow enabling Spectre mitigations. These should almost never be needed and are provided mainly as a “defense in depth” mechanism. See the  Spectre wiki page for details.\n The compiler now rejects  //go: compiler directives that have no meaning for the declaration they are applied to with a &#34;misplaced compiler directive&#34; error. Such misapplied directives were broken before, but were silently ignored by the compiler.\n The compiler&#39;s  -json optimization logging now reports large (&gt;= 128 byte) copies and includes explanations of escape analysis decisions.\n  This release includes substantial improvements to the Go linker, which reduce linker resource usage (both time and memory) and improve code robustness/maintainability.\n For a representative set of large Go programs, linking is 20% faster and requires 30% less memory on average, for  ELF-based OSes running on  amd64 architectures, with more modest improvements for other architecture/OS combinations.\n The key contributors to better linker performance are a newly redesigned object file format, and a revamping of internal phases to increase concurrency (for example, applying relocations to symbols in parallel). Object files in Go 1.15 are slightly larger than their 1.14 equivalents.\n These changes are part of a multi-release project to  modernize the Go linker, meaning that there will be additional linker improvements expected in future releases.\n     Go 1.15 includes a new package,   time/tzdata, that permits embedding the timezone database into a program. Importing this package (as  import _ &#34;time/tzdata&#34;) permits the program to find timezone information even if the timezone database is not available on the local system. You can also embed the timezone database by building with  -tags timetzdata. Either approach increases the size of the program by about 800 KB.\n  Go 1.15 will translate the C type  EGLConfig to the Go type  uintptr. This change is similar to how Go 1.12 and newer treats  EGLDisplay, Darwin&#39;s CoreFoundation and Java&#39;s JNI types. See the  cgo documentation for more information.\n  As always, there are various minor changes and updates to the library, made with the Go 1  promise of compatibility in mind.\n The package now defines the  IMAGE_FILE,  IMAGE_SUBSYSTEM, and  IMAGE_DLLCHARACTERISTICS constants used by the PE file format.\n The  PrivateKey and  PublicKey types in the   crypto/rsa,   crypto/ecdsa, and   crypto/ed25519 packages now have an  Equal method to compare keys for equivalence or to make type-safe interfaces for public keys. The method signature is compatible with   go-cmp&#39;s definition of equality.\n The new   SignASN1 and   VerifyASN1 functions allow generating and verifying ECDSA signatures in the standard ASN.1 DER encoding.\n The new   MarshalCompressed and   UnmarshalCompressed functions allow encoding and decoding NIST elliptic curve points in compressed format.\n  The new   Dialer type and its   DialContext method permits using a context to both connect and handshake with a TLS server.\n  The new   VerifyConnection callback on the   Config type allows custom verification logic for every connection. It has access to the   ConnectionState which includes peer certificates, SCTs, and stapled OCSP responses.\n  Auto-generated session ticket keys are now automatically rotated every 24 hours, with a lifetime of 7 days, to limit their impact on forward secrecy.\n  Session ticket lifetimes in TLS 1.2 and earlier, where the session keys are reused for resumed connections, are now limited to 7 days, also to limit their impact on forward secrecy.\n  The client-side downgrade protection checks specified in RFC 8446 are now enforced. This has the potential to cause connection errors for clients encountering middleboxes that behave like unauthorized downgrade attacks.\n If either the name on the certificate or the name being verified (with   VerifyOptions.DNSName or   VerifyHostname) are invalid, they will now be compared case-insensitively without further processing (without honoring wildcards or stripping trailing dots). Invalid names include those with any characters other than letters, digits, hyphens and underscores, those with empty labels, and names on certificates with trailing dots.\n  The deprecated, legacy behavior of treating the  CommonName field as a hostname when no Subject Alternative Names are present is now disabled by default. It can be temporarily re-enabled by adding the value  x509ignoreCN=0 to the  GODEBUG environment variable. If the  CommonName is an invalid hostname, it&#39;s always ignored.\n  The new   CreateRevocationList function and   RevocationList type allow creating RFC 5280-compliant X.509 v2 Certificate Revocation Lists.\n  CreateCertificate now automatically generates the  SubjectKeyId if the template is a CA and doesn&#39;t explicitly specify one.\n  CreateCertificate now returns an error if the template specifies  MaxPathLen but is not a CA.\n  On Unix systems other than macOS, the  SSL_CERT_DIR environment variable can now be a colon-separated list.\n  On macOS, binaries are now always linked against  Security.framework to extract the system trust roots, regardless of whether cgo is available. The resulting behavior should be more consistent with the OS verifier.\n  Decoding a JSON array into a slice no longer reuses any existing slice elements, following the rules that the package documentation already stated.\n  Introduce an internal limit to the maximum depth of nesting when decoding. This reduces the possibility that a deeply nested input could use large quantities of stack memory, or even cause a &#34;goroutine stack exceeds limit&#34; panic.\n The encoder has always taken care to avoid using namespace prefixes beginning with  xml, which are reserved by the XML specification. Now, following the specification more closely, that check is case-insensitive, so that prefixes beginning with  XML,  XmL, and so on are also avoided.\n When the flag package sees  -h or  -help, and those flags are not defined, the flag package prints a usage message. If the   FlagSet was created with   ExitOnError,   FlagSet.Parse would then exit with a status of 2. In this release, the exit status for  -h or  -help has been changed to 0. In particular, this applies to the default handling of command line flags.\n  TempDir and   TempFile now reject patterns that contain path separators. That is, calls such as  ioutil.TempFile(&#34;/tmp&#34;,  &#34;../base*&#34;) will no longer succeed. This prevents unintended directory traversal.\n  If an I/O operation exceeds a deadline set by the   Conn.SetDeadline,  Conn.SetReadDeadline, or  Conn.SetWriteDeadline methods, it will now return an error that is or wraps   os.ErrDeadlineExceeded. This may be used to reliably detect whether an error is due to an exceeded deadline. Earlier releases recommended calling the  Timeout method on the error, but I/O operations can return errors for which  Timeout returns  true although a deadline has not been exceeded.\n  The new   Resolver.LookupIP method supports IP lookups that are both network-specific and accept a context.\n Parsing is now stricter as a hardening measure against request smuggling attacks: non-ASCII white space is no longer trimmed like SP and HTAB, and support for the &#34; identity&#34;  Transfer-Encoding was dropped.\n ReverseProxy now supports not modifying the  X-Forwarded-For header when the incoming  Request.Header map entry for that field is  nil.\n  When a Switching Protocol (like WebSocket) request handled by   ReverseProxy is canceled, the backend connection is now correctly closed.\n All profile endpoints now support a &#34; seconds&#34; parameter. When present, the endpoint profiles for the specified number of seconds and reports the difference. The meaning of the &#34; seconds&#34; parameter in the  cpu profile and the trace endpoints is unchanged.\n The new   URL field  RawFragment and method   EscapedFragment provide detail about and control over the exact encoding of a particular fragment. These are analogous to  RawPath and   EscapedPath.\n  The new   URL method   Redacted returns the URL in string form with any password replaced with  xxxxx.\n If an I/O operation exceeds a deadline set by the   File.SetDeadline,   File.SetReadDeadline, or   File.SetWriteDeadline methods, it will now return an error that is or wraps   os.ErrDeadlineExceeded. This may be used to reliably detect whether an error is due to an exceeded deadline. Earlier releases recommended calling the  Timeout method on the error, but I/O operations can return errors for which  Timeout returns  true although a deadline has not been exceeded.\n  Packages  os and  net now automatically retry system calls that fail with  EINTR. Previously this led to spurious failures, which became more common in Go 1.14 with the addition of asynchronous preemption. Now this is handled transparently.\n  Package  reflect now disallows accessing methods of all non-exported fields, whereas previously it allowed accessing those of non-exported, embedded fields. Code that relies on the previous behavior should be updated to instead access the corresponding promoted method of the enclosing variable.\n The new   Regexp.SubexpIndex method returns the index of the first subexpression with the given name within the regular expression.\n   FormatComplex converts a complex number into a string of the form (a+bi), where a and b are the real and imaginary parts.\n  ParseComplex converts a string into a complex number of a specificed precision.  ParseComplex accepts complex numbers in the format  N+Ni.\n The new method   Map.LoadAndDelete atomically deletes a key and returns the previous value if present.\n On Unix systems, functions that use   SysProcAttr will now reject attempts to set both the  Setctty and  Foreground fields, as they both use the  Ctty field but do so in incompatible ways. We expect that few existing programs set both fields.\n  Setting the  Setctty field now requires that the  Ctty field be set to a file descriptor number in the child process, as determined by the  ProcAttr.Files field. Using a child descriptor always worked, but there were certain cases where using a parent file descriptor also happened to work. Some programs that set  Setctty will need to change the value of  Ctty to use a child descriptor number.\n  It is  now possible to call system calls that return floating point values on  windows/amd64.\n The  testing.T type now has a   Deadline method that reports the time at which the test binary will have exceeded its timeout.\n  A  TestMain function is no longer required to call  os.Exit. If a  TestMain function returns, the test binary will call  os.Exit with the value returned by  m.Run.\n  The new methods   T.TempDir and   B.TempDir and return temporary directories that are automatically cleaned up at the end of the test.", "posttime": "2020-06-12 09:59:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "说明,release,现在", "title": "GO 1.15-发行说明草案", "title_en": "Go 1.15 – Draft release notes", "transed": 1, "url": "https://tip.golang.org/doc/go1.15", "via": "", "real_tags": ["说明", "release", "现在"]}, {"category": "", "categoryclass": "", "imagename": "fa4a0c9cf1d62a87b93033a0b7eb5181.png", "infoid": 1006247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我已经决定停止在我所有的设备上使用黑暗模式，因为研究表明，进入黑暗面并不是全部。\n黑暗无处不在。事实上，如果你愿意的话，你现在所在的这个网站会自动切换到黑暗模式。关于为什么黑暗比沐浴在温暖的光辉中更好，到处都是夸张的说法。\n你知道吗，我真的很喜欢使用黑暗模式，因为它更容易阅读，不会让我的眼睛疲劳，还可以节省我的电池。\n到处都是Techbros。\n我就是这些技术人员中的一员。我过去曾用这些借口来证明我使用黑暗是正当的。但在做了一些关于暗与光的研究后，我决定停止在任何地方使用暗模式。这就是为什么…。\n带有浅色文字的漂亮的深色屏幕更容易阅读，对吗？嗯，根据多项研究，这显然是错误的。尼尔森·诺曼集团(Nielson Norman Group)在他们关于黑暗模式的帖子中很好地总结了这一点，他们说：\n结果表明，光模式在所有维度上都占上风：无论年龄(不同个体)，正对比极性(光模式)对视力任务和校对任务都更好。\n人类已经进化到白天捕猎。在生物学层面上，我们的眼睛更喜欢浅色背景和暗色前景之间的对比。\n当我在军队时，伪装的一个关键战术是在任何情况下都不要把自己暴露在山顶或类似的地方，因为那里很容易辨认出你的轮廓。浅色背景上的深色斑点比反之更容易被人眼看到。\n许多人认为光线模式是导致眼睛疲劳的一个因素。根据我所做的阅读，这似乎不是真的。NN小组还在他们的帖子中提到了眼睛疲劳：\n人类的瞳孔是通往视网膜的门户：通过它，光线到达眼睛。默认情况下，人类的瞳孔会根据环境中的光量改变大小：当光线很多时，瞳孔会收缩，变得更窄；当光线变暗时，瞳孔会扩张，以便让更多的光线进入。较小的瞳孔尺寸使眼睛不太容易受到球差(图像看起来没有聚焦)的影响，并增加了景深，因此人们不必那么努力地聚焦在文本上，这反过来意味着他们的眼睛不太可能感到疲惫。\n许多人认为光线模式是眼睛疲劳的原因。但在大多数情况下，蓝光实际上是造成这种情况的原因。这一点在“副”杂志上有更详细的报道，他们说：\n2018年发表在BMJ Open Ophthalmology上的一项研究指出，蓝光可能是眼睛疲劳的一个因素，但他指出，长时间不眨眼造成的干眼是导致眼睛疲劳的更严重原因，以及字体太小，以及未经矫正的散光等情况。\n这就是我在这个网站上使用漂亮大号字体的部分原因。我讨厌网站加载12px的衬线字体，看起来就像一个模糊的字体，即使我戴着眼镜也是如此。\n治疗眼睛疲劳的一个更好的方法是在你的操作系统上启用夜光，这将减少你屏幕上的蓝光输出。另外，要有规律的休息，并确保你的眨眼频率足够高！\n如果头痛和眼睛疲劳持续存在，就去看眼镜店。大约一年前我也有过同样的问题，结果发现我是远视眼，需要戴眼镜。从那以后，我的头疼和眼睛疲劳差不多都好了。\n除非你使用的是OLED或AMOLED屏幕，而且你的暗模式是真正的黑色--不是深灰色，也不是深蓝色，而是黑色。在功耗方面没有区别。\n有多少黑色网站或应用程序真正使用真正的黑色作为它们的黑色背景？不多。大多数人要么使用深灰色，要么使用深蓝色。包括这个网站。\nMakeTechEasier详细阐述了整个OLED/AMOLED与标准LCD的对比。当OLED/AMOLED像素为黑色时，它会关闭，因此不会耗电。然而，LCD显示黑色像素仍然需要电源。\nAndroid Authority在一台带有AMOLED屏幕的设备上使用黑暗模式进行了测试。结果显示，电池消耗减少了约41%。\n因此，尽管这一观点有些站得住脚，但市场上的大多数手机都是LCD手机。2019年，大约30%的设备拥有AMOLED/OLED屏幕，预计它们在2023年之前不会达到大多数市场份额(来源)。\n不过，节省设备电池是我最不关心的问题。我的健康要重要得多。此外，我的大部分时间都花在笔记本电脑或台式机上，这两种电脑都有LCD屏幕。AMOLED/OLED在笔记本电脑/台式机领域仍然很少见。\n根据我所做的阅读，黑暗模式不容易阅读，也不能防止眼睛疲劳。然而，在非常特殊的情况下，它可以延长电池寿命。\n我相信有些人真的需要黑暗模式来满足特定的健康状况。出于这个原因，这个网站将继续处于黑暗模式。\n但是，如果你像我一样，只是喜欢黑暗模式，那么从长远来看，你可能会让自己的事情变得更加困难，实际上会损害你的眼睛。\n这篇文章是我#100DaysToOffload挑战的第04天。如果您想参与进来，可以从https://100daystooffload.com.获取更多信息", "note_en": "I’ve decided to stop using dark mode across all of my devices, because research suggests that going to the dark side ain’t all that.\n The darkness is  everywhere. In fact, this very site that you’re on right now  automagically flips to dark mode if you’re that way inclined. There’s lots of hyperbole flying around about why the darkness is better than basking in the warm glow of  light mode.\n You know what, I really love using dark mode because it’s easier to read, doesn’t strain my eyes and saves my battery.\n Techbros everywhere\n I  was one of these techbros. I’ve used those very excuses in the past to justify my use of the darkness. But after doing some research on dark vs light, I’ve made the decision to stop using dark mode everywhere. Here’s why…\n  A nice dark screen with light text is easier to read, right? Well, according to multiple studies, that’s wrong apparently. The Nielson Norman Group, sum this up well in  their post about dark mode, saying:\n Results showed that light mode won across all dimensions: irrespective of age [of the individual], the positive contrast polarity [light mode] was better for both visual-acuity tasks and for proofreading tasks.\n Humans have evolved to hunt during the day. On a biological level, our eyes prefer the contrast between a light background and dark foreground.\n When I was in the military, a key tactic of camouflage was to never, under any circumstances, expose yourself on a hilltop or similar, where your silhouette could be easily identified. A dark blob on a light background is far easier for the human eye to see, than the reverse.\n  Many people quote light mode as being a contributory factor to eye strain. Based on the reading I’ve done, this doesn’t appear to be true. The NN Group also cover eye strain in their post:\n The human pupil is the gateway to the retina: through it, light reaches the eye. By default, the human pupil changes size depending on the amount of light in the environment: when there is a lot of light, it contracts and becomes narrower, and when it’s dark, it dilates to allow more light to get in. Smaller pupil sizes make the eyes less susceptible to   spherical aberrations (in which the image appears unfocused) and increase the depth of field, so people don’t have to work so hard to focus on the text, which, in turn, means that their eyes are less likely to get tired.\n Many people perceive light mode as the cause of eye strain. But blue light, among other things, is actually the cause of it most of the time. This is covered in more detail  by Vice, where they say:\n A  2018 study published in  BMJ Open Ophthalmology notes that blue light could be a factor in eye tiredness, but cites dry eyes from not blinking for long periods as a more serious cause of eye strain, as well as too-small fonts, and conditions like uncorrected  astigmatism.\n That’s part of the reason why I use nice large fonts on this website. I hate it when a website loads with a 12px serif font that just looks like a blur, even when I have my glasses on.\n A better remedy for eye strain would be to enable  night light on your operating system, which will reduce the your screen’s blue light output. Also, take regular breaks and make sure you’re blinking often enough!\n  If headaches and eye strain persist, go see an optician. I had the same problem about a year ago; it turns out I am long-sighted and require glasses. Since then, my headaches and eye strain have pretty much stopped.\n  Unless you’re using an OLED or AMOLED screen and your dark mode is truly black – not dark grey, not dark blue,  BLACK. There is no difference in power consumption.\n How many dark sites or applications actually use true black for their dark background? Not many. Most use either a dark grey, or dark blue. This site included.\n MakeTechEasier elaborate on the whole OLED/AMOLED vs standard LCD argument. When an OLED/AMOLED pixel is black, it’s turned off, so no power is used. Yet power is still required for LCD to display black pixels.\n Android Authority carried out tests using dark mode on a device with an AMOLED screen. The results showed a reduction in battery consumption by around 41%.\n  So although this argument holds some water, the majority of phones on the market are LCD. Around 30% of devices had AMOLED/OLED screens in 2019, and they are not projected to hit a majority market share until 2023 ( source).\n Conserving my device’s battery is the least of my concerns though. My health is far more important. Besides, I spend the vast majority of my time on my laptop or desktop, both of which have LCD screens. AMOLED/OLED is still rare in the laptop/desktop space.\n  According to the reading I’ve done, dark mode isn’t easier to read and it doesn’t prevent eye strain. However, in very specific  circumstances it can improve battery life.\n I’m sure there are people out there who genuinely need dark mode for a specific health condition. For that reason, there will continue to be a dark mode on this site.\n But if you’re like me, and just prefer dark mode, you  may be making things more difficult for yourself and actually damaging your eyes in the long run.\n This post is day 04 of my  #100DaysToOffload challenge. If you want to get involved, you can get more info from  https://100daystooffload.com.", "posttime": "2020-06-12 09:59:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模式,mode,眼睛", "title": "黑暗模式真的是个好主意吗？", "title_en": "Is Dark Mode Such a Good Idea?", "transed": 1, "url": "https://kevq.uk/is-dark-mode-such-a-good-idea/", "via": "", "real_tags": ["模式", "mode", "眼睛"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Dexplot是一个Python库，用于以简单直观的用户体验交付漂亮的数据可视化。\n使用尽可能少的函数来维护非常一致的API，以生成所需的统计图。\nDEXPT主要是为长数据构建的，长数据是一种数据形式，其中每行表示一个观测值，每列表示一个不同的量。它通常被称为整齐的数据。这里，我们有一些很长的数据。\nDexplot还具有处理宽数据的能力，其中多个列可能包含表示相同数量的值。以上相同的数据已汇总，以显示邻居和房产类型的每种组合的平均值。现在它是宽数据，因为每列包含相同的数量(价格)。\nDexplot提供了少数功能强大的函数，它们的工作方式都很相似。大多数绘图函数都有以下签名：\n当提供aggfunc时，x将是分组变量，y在垂直时将聚合，水平时反之亦然。学习如何使用dexlot的最好方法是使用下面的示例。\n有两个主要的地块家族，聚集型和分布型。聚合图采用一系列值，并使用提供给aggfunc的函数返回单个值。分布图采用一系列值，并以某种方式描绘分布的形状。\n如果您使用过海运库，那么您应该会注意到许多相似之处。DexPlot的大部分灵感都来自于Seborn。以下是在海运中找不到的dexlot中的额外功能列表\n能够使用单个函数创建网格，而不必使用更高级别的函数，如catlot。\n我们将从报道聚合起来的情节开始。聚合被定义为用单个值汇总一系列数字的函数。这些示例来自Airbnb数据集，其中包含来自华盛顿特区地区的许多房产租赁列表。\n我们的数据集中有4000多个列表。我们将使用条形图来汇总数据。\n为了执行聚合，必须为aggfunc提供一个值。在这里，我们找到了每个社区的中值价格。请注意，列名自动换行。\n可以使用相同的命令创建折线图和散点图，只需替换函数名即可。它们都不是可视化的好选择，因为分组变量(邻域)没有有意义的顺序。\n只要设置了aggfunc参数，您就执行了GROUPBY聚合，该聚合始终由三个组件组成：\n除了所有常见的聚合函数之外，您还可以使用字符串&#39；countna&#39；和&#39；cepna&#39；来获取每个组缺少值的数量和百分比。\n默认情况下，条形图将按分组列(此处为x轴)按字母顺序排序。使用SORT_VALUES参数按值对条形图进行排序。\n通过将值列表传递给x_order，指定x轴上标签的特定顺序。这也可以用作限制条数的过滤器。\n默认情况下，x_order和所有_order参数默认设置为&#39；asc&#39；，这将按字母顺序对它们进行排序。使用字符串&#39；desc&#39；以相反方向排序。\n通过将x_order设置为字符串&#39；top n&39；或&#39；Bottom n&#39；(其中n为整数)，您可以再次使用x_order筛选出现频率最高/最不频繁的x值。在这里，我们筛选出出现频率最高的4个社区。当分组列中有数十个唯一值时，此选项非常有用。\n哥伦比亚高地773联合车站713国会山654Edgewood 610Dupont Circle 549Shaw 514Bright twood Park 406Kalorama Heights 362名称：Neighborhood，dtype：int64。\n将水平条的方向设置为&#39；h&#39；。当您这样做时，您将需要切换x和y，因为分组列(邻域)将沿着y轴，而聚合列(价格)将沿着x轴。\n通过将Split参数设置为另一列，可以将每个钢筋拆分为更多组。\n使用SPLIT_ORDER设置唯一拆分值的顺序，它也可以用作筛选器。\n与所有_ORDER参数一样，SPLIT_ORDER默认为&#39；ASC&#39；(字母顺序)。相反，请将其设置为Desc&39；。\n通过将堆叠设置为True，将所有拆分组堆叠在另一个组之上。\n可以通过具有ROW和COLE参数的不同列中的唯一值将数据进一步分割为单独的绘图。在这里，每种property_type都有自己的图。\n如果所有绘图都没有空间，请将WRAP参数设置为整数，以设置每行/列的最大绘图数量。我们还将colorder指定为按字母顺序降序。\n默认情况下，所有轴限制都是共享的。通过将SHARX和SHARY设置为FALSE，允许每个绘图设置自己的限制。\n条的宽度(水平时的高度)是使用Size参数设置的。默认情况下，此值为0.9。将此数字视为特定x/y值的所有条的相对宽度，其中1是每个x/y值之间的距离。\n分布图的工作原理与此类似，但由于它们不聚合，因此没有聚集性。他们取他们的一组值，画出某种形状，给出变量如何分布的信息。\n箱形图具有末端位于第一个和第三个四分位数的彩色方框，中间有一条线。将胡须放置在第三个和第一个四分位数之间差值的1.5倍(四分位数范围(IQR))。传单是此范围之外的点，并单独打印。默认情况下，长方体打印和小提琴打印都是水平打印。\n可以通过将最小值和最大值的列表传递给x_order来过滤可能值的范围。\n小提琴曲线图的工作原理与盒子曲线图相同，但显示的是小提琴，即在直线两边重复的内核密度曲线图。\n直方图的工作方式略有不同。不是同时传递x和y，而是给它一个数值列。默认情况下会创建包含20个计数箱的垂直直方图。\n在这里，我们通过绘制累积密度来定制直方图，而不是使用条形图的轮廓绘制原始频率计数(第#39；步)。\n核密度估计提供了对连续变量的概率分布的估计。在这里，我们检查价格是如何按卧室分配的。\nCOUNT函数以条形图表示唯一值的频率。默认情况下，它按降序绘制值。\n哥伦比亚高地773联合车站713国会山654Edgewood 610Dupont Circle 549Shaw 514Bright twood Park 406Kalorama Heights 362名称：Neighborhood，dtype：int64。\n将Normize设置为True时，将返回相对于所有数据的相对频率。您可以对所提供的任何变量进行标准化。\nDEXPT还可以绘制宽数据，或者没有聚合的数据。下面是每个列表位置的散点图。\n如果您已经汇总了数据，则可以直接绘制它，而无需指定x或y。", "note_en": "Dexplot is a Python library for delivering beautiful data visualizations with a simple and intuitive user experience.\n      Maintain a very consistent API with as few functions as necessary to make the desired statistical plots\n        Dexplot is primarily built for long data, which is a form of data where each row represents a single observation and each column represents a distinct quantity. It is often referred to as &#34;tidy&#34; data. Here, we have some long data.\n    Dexplot also has the ability to handle wide data, where multiple columns may contain values that represent the same kind of quantity. The same data above has been aggregated to show the mean for each combination of neighborhood and property type. It is now wide data as each column contains the same quantity (price).\n      Dexplot provides a small number of powerful functions that all work similarly. Most plotting functions have the following signature:\n      When  aggfunc is provided,  x will be the grouping variable and  y will be aggregated when vertical and vice-versa when horizontal. The best way to learn how to use dexplot is with the examples below.\n    There are two primary families of plots,  aggregation and  distribution. Aggregation plots take a sequence of values and return a  single value using the function provided to  aggfunc to do so. Distribution plots take a sequence of values and depict the shape of the distribution in some manner.\n      If you have used the seaborn library, then you should notice a lot of similarities. Much of dexplot was inspired by Seaborn. Below is a list of the extra features in dexplot not found in seaborn\n  Ability to make grids with a single function instead of having to use a higher level function like  catplot\n        We&#39;ll begin by covering the plots that  aggregate. An aggregation is defined as a function that summarizes a sequence of numbers with a single value. The examples come from the Airbnb dataset, which contains many property rental listings from the Washington D.C. area.\n      There are more than 4,000 listings in our dataset. We will use bar charts to aggregate the data.\n        In order to performa an aggregation, you must supply a value for  aggfunc. Here, we find the median price per neighborhood. Notice that the column names automatically wrap.\n      Line and scatter plots can be created with the same command, just substituting the name of the function. They both are not good choices for the visualization since the grouping variable (neighborhood) has no meaningful order.\n            Anytime the  aggfunc parameter is set, you have performed a groupby aggregation, which always consists of three components:\n                In addition to all the common aggregating functions, you can use the strings  &#39;countna&#39; and  &#39;percna&#39; to get the number and percentage of missing values per group.\n        By default, the bars will be sorted by the grouping column (x-axis here) in alphabetical order. Use the  sort_values parameter to sort the bars by value.\n                Specify a specific order of the labels on the x-axis by passing a list of values to  x_order. This can also act as a filter to limit the number of bars.\n      By default,  x_order and all of the  _order parameters are set to  &#39;asc&#39; by default, which will order them alphabetically. Use the string  &#39;desc&#39; to sort in the opposite direction.\n        You can use  x_order again to filter for the x-values that appear the most/least often by setting it to the string  &#39;top n&#39; or  &#39;bottom n&#39; where  n is an integer. Here, we filter for the top 4 most frequently occurring neighborhoods. This option is useful when there are dozens of unique values in the grouping column.\n          Columbia Heights 773Union Station 713Capitol Hill 654Edgewood 610Dupont Circle 549Shaw 514Brightwood Park 406Kalorama Heights 362Name: neighborhood, dtype: int64\n    Set  orientation to  &#39;h&#39; for horizontal bars. When you do this, you&#39;ll need to switch  x and  y since the grouping column (neighborhood) will be along the y-axis and the aggregating column (price) will be along the x-axis.\n              You can split each bar into further groups by setting the  split parameter to another column.\n            Set the order of the unique split values with  split_order, which can also act as a filter.\n      Like all the  _order parameters,  split_order defaults to  &#39;asc&#39; (alphabetical) order. Set it to  &#39;desc&#39; for the opposite.\n                    Stack all the split groups one on top of the other by setting  stacked to  True.\n        It&#39;s possible to split the data further into separate plots by the unique values in a different column with the  row and  col parameters. Here, each kind of  property_type has its own plot.\n      If there isn&#39;t room for all of the plots, set the  wrap parameter to an integer to set the maximum number of plots per row/col. We also specify the  col_order to be descending alphabetically.\n                  By default, all axis limits are shared. Allow each plot to set its own limits by setting  sharex and  sharey to  False.\n        The width (height when horizontal) of the bars is set with the  size parameter. By default, this value is .9. Think of this number as the relative width of all the bars for a particular x/y value, where 1 is the distance between each x/y value.\n                Distribution plots work similarly, but do not have an  aggfunc since they do not aggregate. They take their group of values and draw some kind of shape that gives information on how that variable is distributed.\n    Box plots have colored boxes with ends at the first and third quartiles and a line at the median. The whiskers are placed at 1.5 times the difference between the third and first quartiles (Interquartile range (IQR)). Fliers are the points outside this range and plotted individually. By default, both box and violin plots are plotted horizontally.\n                    It&#39;s possible to filter the range of possible values by passing in a list of the minimum and maximum to  x_order.\n            Violin plots work identically to box plots, but show &#34;violins&#34;, kernel density plots duplicated on both sides of a line.\n              Histograms work in a slightly different manner. Instead of passing both  x and  y, you give it a single numeric column. A vertical histogram with 20 bins of the counts is created by default.\n            Here, we customize our histogram by plotting the cumulative density as opposed to the raw frequency count using the outline of the bars (&#39;step&#39;).\n        Kernel density estimates provide an estimate for the probability distribution of a continuous variable. Here, we examine how price is distributed by bedroom.\n                            The  count function graphs the frequency of unique values as bars. By default, it plots the values in descending order.\n          Columbia Heights 773Union Station 713Capitol Hill 654Edgewood 610Dupont Circle 549Shaw 514Brightwood Park 406Kalorama Heights 362Name: neighborhood, dtype: int64\n                              Setting  normalize to  True, returns the relative frequency with respect to all of the data. You can normalize over any of the variables provided.\n              Dexplot can also plot wide data, or data where no aggregation happens. Here is a scatter plot of the location of each listing.\n      If you&#39;ve already aggregated your data, you can plot it directly without specifying  x or  y.", "posttime": "2020-06-12 09:42:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,python,用于", "title": "Dexplot：用于交付数据可视化的Python库", "title_en": "Dexplot: Python library for delivering data visualizations", "transed": 1, "url": "https://www.dexplo.org/dexplot/", "via": "", "real_tags": ["可视化", "python", "用于"]}, {"category": "", "categoryclass": "", "imagename": "98da69601216afad8732bc9730d5d50f.jpg", "infoid": 1006245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在风的作用下，来自撒哈拉沙漠等地的尘埃颗粒可以漂浮在半个地球的另一边，然后沉降到地面上。当人类丢弃的塑料在环境中分解成小碎片时，它们也会漂浮在大气中。现在，科学家们离了解这些周游全球的微塑料是如何旅行的又近了一步-无论是在当地还是在长途飞行中。\n研究人员花了一年多的时间从美国西部的11个国家公园和荒野地区收集微塑料。他们分别检查了干燥天沉降的颗粒和随雨雪一起下降的颗粒。除了揭示微塑料是如何移动的，周四发表在“科学”(Science)杂志上的这项研究结果揭示了这个问题的巨大规模：每年有超过1000吨微塑料-相当于1.2亿至3亿个塑料水瓶的重量-落在该国西部地区的保护地上。这些新的发现增加了科学家对微塑料污染对环境和人类健康的潜在影响的担忧。“我们不应该吸入这种材料，”苏格兰斯特拉斯克莱德大学(University Of Strathclyde)的微塑料研究员史蒂夫·艾伦(Steve Allen)说，他没有参与这项新的研究。他补充说，环境中的塑料“携带着各种杀虫剂、重金属和我们随着时间推移制造的所有其他化学物质。”“他们将把它们直接带入我们的肺部。”\n自从20世纪70年代在海洋中发现微塑料以来，几乎在研究人员寻找过的任何地方都发现了微塑料-这种塑料可以像一粒米那么大，也可以比一粒灰尘小：在城市里，在北极的雪中，在偏远的山顶上。它们出现在远离人类居住的地区，这表明它们是由风承载的。然而，很少有研究直接调查这种可能性。\n犹他州州立大学(Utah State University)分水岭科学家、这项新研究的主要作者贾尼斯·布拉尼(Janice Brahney)最初着手调查灰尘是如何携带营养物质的，而不是塑料。但在窥视她的显微镜并在灰尘中看到五颜六色的珠子和纤维后，她重新聚焦了自己的努力。为了收集微塑料样本，布拉尼的团队使用了一对3.5加仑(13.2升)的水桶，水桶带有传感器触发的盖子。当下雨或下雪时，盖子会盖住“干”桶，让材料进入“湿”桶。在干燥的天气里，盖子会盖住湿桶，让材料进入干燥的水桶。\n回到实验室，研究人员在显微镜下手工计数塑料颗粒，使用鲜艳的颜色和不自然的纹理等视觉线索将它们与灰尘和有机材料区分开来。该研究小组使用一种名为傅立叶变换红外光谱的过程独立估计了微塑料的数量，该过程测量了样品如何吸收和发射红外光，以区分塑料和其他材料。他们捕获的颗粒和纤维来自地毯、油漆、化妆品、野营用具等。但最大的贡献来自服装。衣服在洗涤和烘干时，以及在日常使用过程中，都会脱落超细纤维。\n科学家们几乎在他们收集的每个样本中都发现了微塑料。总体而言，4%的可识别尘埃颗粒是塑料。布拉尼和她的同事们“立即意识到我们所看到的东西的严重性，”她说。“那是一个完全震惊的时刻。”\n通过分析国家公园和荒野地区的天气模式和灰尘积累，研究小组可以观察到来自附近城市的污染的影响-并可以更好地理解将合成材料带到地球各地的“塑料循环”，就像“灰尘循环”输送灰尘一样。风暴期间落到地面的微塑料往往更大，当风从人口稠密的地区吹进来时，它们就会到达。这一观察表明，“湿的”塑料起源于附近的城市，更大的塑料从大气中掉出来，离它们排放的地方更近。另一方面，在干燥条件下坠落的微塑料较小，但数量较多。它们还与大气中较高的气流相对应，这表明这些塑料已经经过了很长的距离。\n艾伦说，这项新的研究对以前在偏远地区进行的微塑料研究进行了“相当大的扩展”，其中包括他和他的妻子迪妮·艾伦(Deonie Allen)去年在斯特拉斯克莱德大学(University Of Strathclyde)发表的一篇论文，该论文发表在“自然地球科学”(Nature Geoscience)上。他补充说：“他们做得很好，特别是计算出了它从哪里来，以及它可以行驶的距离。”没有参与布拉尼项目的迪妮·艾伦(Deonie Allen)表示，干湿微塑料的分离代表着在理解大气条件如何影响这些颗粒的飞行路线方面取得了重要进展。\n对于布拉尼和其他人来说，未来的研究将集中在揭示微塑料进入大气的方式。她说：“我们才刚刚开始真正触及大气层中的物质以及它是如何移动的表面。”", "note_en": "Carried by the wind, dust particles from places such as the Sahara Desert can float halfway around the world before settling to the ground. As the plastics discarded by humans break down into tiny pieces in the environment, they, too, drift through the atmosphere. Now scientists are a step closer to understanding how these globe-trotting  microplastics travel—both locally and on long-distance flights.\n  Researchers spent more than a year collecting microplastics from 11 national parks and wilderness areas in the western U.S. They separately examined the particles that settled on dry days and those that fell along with rain or snow. In addition to shedding light on  how microplastics move around, the results, published on Thursday in  Science, reveal the sheer scale of the problem: more than 1,000 metric tons of microplastics—the weight of 120 million to 300 million plastic water bottles—fall on protected lands in the country’s western region each year. The new findings add to scientists’ concern over  microplastic pollution’s potential impacts on the environment and human health. “We’re not supposed to breathe in this material,” says Steve Allen, a microplastics researcher at the University of Strathclyde in Scotland, who was not involved in the new study. Plastics in the environment “carry all sorts of pesticides, heavy metals and all the other chemicals that we&#39;ve made over time,” he adds. “They&#39;re going to carry them directly into our lungs.”\n  Since their discovery in oceans in the 1970s, microplastics—which can be as large as a grain of rice or smaller than a particle of dust—have been found nearly everywhere researchers have looked: in cities, in  Arctic snow, on  remote mountaintops. Their presence in areas distant from human habitation has pointed to them being borne by winds. Few studies have directly investigated this possibility, however.\n  Janice Brahney, a watershed scientist at Utah State University and lead author of the new study, initially set out to investigate how dust carries nutrients, not plastic. But after peering into her microscope and seeing colorful beads and fibers among the bits of dust, she refocused her efforts. To collect microplastic samples, Brahney’s team used a pair of 3.5-gallon (13.2-liter) buckets with a sensor-triggered lid. When rain or snow fell, the lid would cover the “dry” bucket and allow material to enter the “wet” one. During dry weather, the lid would cover the wet bucket and allow material to enter its dry counterpart.\n  Back in the lab, the researchers counted the plastic particles by hand under a microscope, using visual clues such as vivid colors and unnatural textures to distinguish them from dust and organic materials. The team  independently estimated the number of microplastics using a process called Fourier transform infrared spectroscopy, which measured how the samples absorbed and emitted infrared light to differentiate plastic from other material. The particles and fibers they captured originated as carpeting, paint, cosmetic products, camping gear, and more. But the largest contribution came from clothing. Clothes shed microfibers when they are washed and dried, as well as during daily use.\n  The scientists found microplastics in almost every sample they collected. In total, 4 percent of the identifiable dust particles were plastic. Brahney and her colleagues “immediately realized the gravity of what we were seeing,” she says. “That was a moment of being just completely astounded.”\n  By analyzing weather patterns and dust accumulation in the national parks and wilderness areas, the team could observe the effects of pollution from nearby cities—and could better understand the “plastic cycle” that carries synthetic materials across the planet, just as the “dust cycle” transports dust. The microplastics that fell to the ground during storms tended to be larger and arrived when winds blew in from populated areas. This observation indicated that the “wet” plastics originated in those nearby cities and that larger plastics fall out of the atmosphere closer to where they are emitted. On the other hand, the microplastics that fell during dry conditions were smaller but more numerous. They also corresponded with air currents higher in the atmosphere, suggesting that these plastics had traveled long distances.\n  The new research “expanded quite significantly” on previous studies of microplastics in remote areas, Allen says, including a paper he and his wife, Deonie Allen, also at the University of Strathclyde, published last year in  Nature Geoscience. “They’ve done a nice job of especially working out where it came from and the sort of distances it can travel,” he adds. Deonie Allen, who was not involved with Brahney’s project, says that the separation of dry and wet microplastics represents an important advance toward understanding how atmospheric conditions affect the flight paths of these particles.\n  For Brahney and others, future research will focus on uncovering the ways microplastics enter the atmosphere. “We’re only starting to really scratch the surface of what is in the atmosphere and how it&#39;s moving around,” she says.", "posttime": "2020-06-12 09:41:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "micro,塑料", "title": "数以千计的微型塑料正在从天而降", "title_en": "1000s of tons of micro plastics are falling from the sky", "transed": 1, "url": "https://www.scientificamerican.com/article/thousands-of-tons-of-microplastics-are-falling-from-the-sky/", "via": "", "real_tags": ["micro", "塑料"]}, {"category": "", "categoryclass": "", "imagename": "3f62ddb64ea913540c46c81755aeae46.jpg", "infoid": 1006244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "商业报道安大略省证券委员会(Ontario Securities Commission)表示，就在创始人去世之际，Quadriga加密货币交易所消失了数百万美元，这是一个欺诈和庞氏骗局。\n监管机构周四表示，总部位于温哥华的Quadriga&#39；已故创始人杰拉尔德·科滕(Gerald Cotten)以化名开立账户，并将虚构的货币和加密资产余额记入自己的贷方，与毫无戒心的客户进行交易，从而犯下了欺诈罪。\nOSC在一份新的报告中说，当密码资产的价格发生变化时，可用于满足客户提款的资产出现了短缺。该机构认定，他开始实施庞氏骗局，用其他客户的存款弥补差额。\nOSC表示，在Quadriga发生的是一起包裹在现代技术中的老式欺诈。\nQuadriga认为其业务不涉及证券交易，也没有向任何证券监管机构注册。这种缺乏注册便利了科顿的能力犯下大规模诈骗而不被发现。对科顿缺乏内部监督也是如此。\nOSC花了10个月的时间分析交易和区块链数据，采访关键证人，与海外监管机构合作，并利用第三方和银行信息重建30岁的科顿去世前几个月Quadriga发生的事情。\n科顿的遗孀试图找到Quadriga账户的密码，但詹妮弗·罗伯逊表示，她找不到丈夫写下的任何密码。她作证说，当Quadriga去年寻求债权人保护时，他使用的笔记本电脑也是加密的。\n周四，证监会将1.69亿美元客户因棉花欺诈交易而损失的1.15亿美元归因于其中的约1.15亿美元。\n当Cotten在未经授权或披露的情况下在三个外部密码资产交易平台上使用客户资产时，另有2800万美元的损失。\n证监会表示，他还挪用了数百万客户资产来支持他奢侈的生活方式，而且由于自2016年以来他一直是公司的独家控制者，他以自己认为合适的方式经营公司，没有适当的内部监督或控制系统，也没有适当的账簿和记录。\n这些客户将他们的资金和密码资产委托给Quadriga，Quadriga对这些资产是如何储存、移动和花费的没有提供有意义的洞察力，反而对资产储存提供了虚假的保证。\n到OSC开始调查时，超过7.6万名客户-其中约40%是安大略省人-总共被欠了2.15亿美元。\nQuadriga&amp；的破产托管人安永(Ernst&amp；Young)只能收回4600万美元的资产，用于支付给客户。\n该机构在报告中写道，OSC工作人员很可能会对Cotten和Quadriga采取执法行动。\n然而，这是不切实际的，因为科顿已经去世，Quadriga破产了，其资产受到法院监督的分配过程的影响。\n该机构执法部门负责人杰夫·凯霍(Jeff Kehoe)在一份声明中表示，OSC发布这份调查报告是不寻常的，但也是必要的。\n他说：虽然公开发布调查报告的情况很少，但我们认为，数万名将资金和密码资产委托给Quadriga的安大略省人有权知道发生了什么。\n我们公开这一信息的目的也是为了防止这种情况再次发生。", "note_en": "Business      The Quadriga cryptocurrency exchange that saw millions of dollars disappear just as its founder died was a &#34;fraud&#34; and Ponzi scheme, according to the Ontario Securities Commission.\n  The regulator said Thursday that Vancouver-based Quadriga&#39;s late founder Gerald Cotten committed fraud by opening accounts under aliases and crediting himself with fictitious currency and crypto asset balances, which he traded with unsuspecting clients.\n   Cotten, the OSC said in a new report, ran into a shortfall in assets available to satisfy client withdrawals when the price of the crypto assets changed. He started running a Ponzi scheme that covered the shortfall with other clients&#39; deposits, the agency determined.\n  &#34;What happened at Quadriga was an old-fashioned fraud wrapped in modern technology,&#34; the OSC said.\n  &#34;Quadriga did not consider its business to involve securities trading and it did not register with any securities regulator. This lack of registration facilitated Cotten&#39;s ability to commit a large-scale fraud without detection. So did the absence of internal oversight over Cotten.&#34;\n  The OSC spent 10 months analyzing trading and blockchain data, interviewing key witnesses, collaborating with overseas regulatory bodies and using third-party and bank information to reconstruct what was going on at Quadriga in the months leading up to 30-year-old Cotten&#39;s death.\n      Cotten&#39;s widow tried to locate passwords for Quadriga accounts, but Jennifer Robertson said she couldn&#39;t find any her husband had written down. The laptop he used was also encrypted, she testified, when Quadriga sought creditor protection last year.\n  On Thursday, the OSC attributed about $115 million of the $169 million clients lost to Cotten&#39;s &#34;fraudulent&#34; trading.\n  Another $28 million was lost when Cotten used client assets on three external crypto asset trading platforms without authorization or disclosure.\n  The OSC said he also misappropriated millions in client assets to fund his &#34;lavish&#34; lifestyle and because he was in sole control of the company ever since 2016, he &#34;ran the business as he saw fit, with no proper system of internal oversight or controls or proper books and records.&#34;\n      Those clients entrusted their money and crypto assets to Quadriga, which provided &#34;no meaningful insight&#34; into how those assets were being stored, moved and spent and instead gave false assurances about asset storage.\n  By the time the OSC started investigating, over 76,000 clients — about 40 per cent of them Ontarians — were owed a combined $215 million.\n  Ernst &amp; Young, Quadriga&#39;s bankruptcy trustee, was only able to recover $46 million in assets to pay out to clients.\n  &#34;OSC Staff would likely have pursued an enforcement action against Cotten and Quadriga,&#34; the agency wrote in its report.\n  &#34;However, this is not practical given that Cotten is deceased and Quadriga is bankrupt, with its assets subject to a court-supervised distribution process.&#34;\n  Jeff Kehoe, the director of the agency&#39;s enforcement branch, said in a statement that it was unusual, but necessary for the OSC to release the investigative report.\n  &#34;While public release of an investigative report is rare, we believe the tens of thousands of Ontarians who entrusted Quadriga with their money and crypto assets deserve to know what happened,&#34; he said.\n  &#34;Our aim in making this information public is also to prevent this type of situation from recurring.&#34;", "posttime": "2020-06-12 09:41:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "方正,fraud,quadriga", "title": "夸德里加是个骗子，方正在运行庞氏骗局", "title_en": "Quadriga was a fraud and founder was running Ponzi scheme", "transed": 1, "url": "https://www.cbc.ca/news/business/osc-quadriga-gerald-cotten-1.5607990", "via": "", "real_tags": ["方正", "fraud", "quadriga"]}, {"category": "", "categoryclass": "", "imagename": "d83ca93311ff97b16cf16ea348476a8f.jpg", "infoid": 1006243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年7月，美国国家航空航天局(NASA)宣布了一项令人难以置信的成就。他们创造了太空中最冷的地方--就在绕地球轨道上的国际空间站上。\n他们提取了一种名为铷的软金属的原子，并将其冷却到100纳米开尔文左右--比绝对零度高出10万分之一开尔文的温度。\n这就产生了一种叫做玻色-爱因斯坦凝聚态的超冷云团，这是一种奇异的物质第五态，可以帮助我们理解超冷原子的奇怪量子特性。但研究并未止步于此。\n利用喷气推进实验室的冷原子实验室，科学家们继续生产出绝对零度以上不到纳米开尔文的玻色-爱因斯坦凝聚体-利用空间站上的微重力条件，比我们在地球上了解更多关于这种状态的信息。\n玻色-爱因斯坦凝聚体是相当奇怪的。它们是由玻色子冷却到仅略高于绝对零度(但没有达到绝对零度，在绝对零度时原子停止运动)形成的。这会导致它们下沉到能量最低的状态，移动极其缓慢，并且聚集得足够近，足以重叠-产生一个高密度的原子云，其行为就像一个超级原子或物质波。\n因为量子力学(其中每个粒子都可以被描述为波)更容易在原子尺度上观察，所以玻色-爱因斯坦凝聚体允许科学家在更大的尺度上研究量子行为，而不是试图研究单个原子。\n利用激光冷却、磁场和蒸发冷却的组合，可以在地球上产生玻色-爱因斯坦凝聚体。最后一项技术是最后一步--原子被困在磁阱中，射频辐射被用来蒸发能量最高的粒子，把冷的、慢的粒子留在身后形成凝结物。\n一旦发生这种情况，陷阱就会关闭，科学家就可以进行实验了。但它们必须迅速行动--原子之间的自然排斥力将导致云层膨胀和消散。重力意味着这个过程发生得相当快--只有几十毫秒。\n然而，在自由落体中抵消了重力的影响后，你可以制造出可以持续一秒以上的玻色-爱因斯坦凝聚体。\n此外，重力的降低意味着凝析油可以在较浅的碟子中形成。这为研究人员提供了一个更好的窗口来观察云层，无论是在云层发布之前还是发布后的短暂时间内都是如此。\n这就是研究人员利用冷原子实验室所取得的成果--但是当他们探测他们产生的凝析油时，他们发现了在地球引力下不可能发生的效应。\n他们在论文中写道，我们发现射频诱导的蒸发冷却在微重力下显示出明显不同的结果。\n我们观察到在轨原子数增加了近三倍。通过施加不同的磁场梯度，我们确认大约有一半的原子处于磁钝感态|2，0⟩，在磁阱位置周围形成晕状云。\n在地球上，重力是作用在这些原子上的主导力量，将它们从陷阱周围移走。\n在太空中，能够更仔细地观察凝聚物，就会发现一个由松散的铷原子组成的光晕在云层的边缘徘徊。由于材料冷却的方式，这些原子几乎没有注意到磁阱。\n重力通常会把它们拉到一边，至少在地球上是这样。但在自由落体状态下，他们却徘徊不前，为未来的研究提供了一种潜在的有用的超低温资源。\n生产更冷、更持久的玻色-爱因斯坦凝聚体的可行性也意味着我们可以开始考虑研究它们的其他方法。例如，可以创建在地球上不可能的陷阱形状，以观察是否可以观察到不同的量子行为。\n玻色-爱因斯坦凝聚体的波动特性对原子干涉仪也有潜在的帮助，原子干涉仪可以用来测量基本的物理常数。\n我们已经使用CAL在低地球轨道上的基线能力来展示微重力对超冷原子实验的直接和基本的好处。研究人员在他们的论文中写道，这些实验是潜在的数年科学操作的开始，随着时间的推移，仪器的额外功能将被使用。\nCAL仪器的未来模块升级可用于更长的任务研究，包括由喷气推进实验室建造的以原子波干涉仪为特色的科学模块。此外，后续飞行任务的有效载荷正处于提议和开发阶段，以确保超冷原子在轨道上的持续存在和应用。", "note_en": "In July of 2018,  NASA announced an incredible achievement. They had created the  coldest spot in space - right there on the International Space Station, in orbit around Earth.\n They took atoms of a soft metal called rubidium, and cooled them to temperatures around 100 nanoKelvin - one ten-millionth of a Kelvin above absolute zero.\n   This resulted in a super cold cloud called a Bose-Einstein condensate, the exotic &#39;fifth&#39; state of matter, and one that could help us understand the weird quantum properties of ultra-cold atoms. But the research did not stop there.\n Using the Jet Propulsion Laboratory&#39;s Cold Atom Laboratory, scientists went on to produce Bose-Einstein condensates less than a nanoKelvin above absolute zero - exploiting the microgravity conditions aboard the space station to learn more about this state than we could on Earth.\n Bose-Einstein condensates are pretty weird. They are formed from  bosons cooled to just a fraction above absolute zero (but not reaching absolute zero, at which point  atoms stop moving). This causes them to sink to their lowest-energy state, moving extremely slowly, and coming together close enough to overlap - producing a high density cloud of atoms that acts like one &#39;super atom&#39; or matter wave.\n Because quantum mechanics - in which each particle can be described as a wave - is easier to observe on the atomic scale, Bose-Einstein condensates allow scientists to study quantum behaviour on a much larger scale, instead of trying to study individual atoms.\n   Bose-Einstein condensates can be created here on Earth, using a combination of laser cooling, magnetic fields, and evaporative cooling. That last technique is the final step - the atoms are held in a magnetic trap, and radio-frequency radiation is used to &#39;evaporate&#39; the most energetic particles, leaving the cold, sluggish ones behind to form the condensate.\n Once this occurs, the trap is switched off, and scientists can perform experiments. But they have to act fast - the natural repulsive force between the atoms will cause the cloud to expand and dissipate. Gravity means this process happens pretty fast - just a few tens of milliseconds.\n With the effects of gravity counteracted in freefall, though, you can make a Bose-Einstein condensate that can last over a second.\n In addition, the reduced impact of gravity means the condensate can form in a shallower dish. This provided the researchers a better window to observe the cloud, both before and briefly after its release.\n This is what the researchers achieved with the Cold Atom Laboratory - but when they probed the condensates they produced, they found effects that can&#39;t occur in Earth&#39;s gravity.\n   &#34;We find that radiofrequency-induced evaporative cooling reveals markedly different results in microgravity,&#34;  they write in their paper.\n &#34;We observe an on-orbit increase in the atom number of nearly threefold. Through the application of varied magnetic field gradients, we confirm that approximately half of the atoms are in the magnetically insensitive state |2, 0⟩, forming a halo-like cloud around the location of the magnetic trap.&#34;\n On Earth, gravity is the dominant force acting on these atoms, removing them from around the trap.\n In space, being able to take a closer look at the condensate revealed a halo of loose rubidium atoms hovering around the cloud&#39;s edges. Thanks to the way the material was cooled, these atoms barely paid attention to the magnetic trap.\n Gravity would usually pull them aside, at least on Earth. But in freefall, they hung about, providing a potentially useful ultracold resource for future study.\n The feasibility of producing colder, longer-lasting Bose-Einstein condensates also means we can start thinking about other ways we can study them. For instance, trap shapes not possible on Earth could be created to see if different quantum behaviours can be observed.\n The wave properties of Bose-Einstein condensates are also potentially useful for  atom interferometers, which can be used to measure fundamental physical constants.\n &#34;We have used the baseline capabilities of CAL in low Earth orbit to demonstrate immediate and fundamental benefits of microgravity for ultracold atom experiments... These experiments form the start of potentially years of science operations, with additional capabilities of the instrument to be employed over time,&#34;  the researchers write in their paper.\n &#34;Future modular upgrades for the CAL instrument are available for extended mission studies, including a science module built by JPL featuring an atom-wave interferometer. Additionally, payloads for follow-on missions are in proposal and development stages, assuring the continued presence and application of ultracold atoms in orbit.&#34;", "posttime": "2020-06-12 09:40:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "空间站,cloud,原子", "title": "在国际空间站探测第五态物质云(玻色-爱因斯坦凝聚态)", "title_en": "Probing a Cloud of the Fifth State of Matter (Bose-Einstein Condensate) on ISS", "transed": 1, "url": "https://www.sciencealert.com/we-ve-now-been-able-to-probe-a-cloud-of-the-fifth-state-of-matter-in-space", "via": "", "real_tags": ["空间站", "cloud", "原子"]}, {"category": "", "categoryclass": "", "imagename": "f190d349d6e43a02499f07c90eb64c8b.png", "infoid": 1006242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据我们所知，这是第一篇通过模仿真实的时间书写过程来合成逼真的西方草书笔迹的论文。我们的方法几乎是全自动的，例如，不需要手动剪切字符，并且能够呈现完整的行，而不是像其他作品中的字形/单词。\n发送手写的个人问候语，而不是将其写在纸上并扫描。\n生成笔迹训练现代文本识别引擎，通常需要大量的训练样本。\n使法医研究人员能够在不需要人的情况下生成和模仿笔迹。因此，创建更健壮的写入者识别方法。\n在目前的阶段，这一代的作品相当健壮，但在人工制品、缺少标点符号和合成书法糟糕的作家方面存在问题。\n对一般写作风格的模仿效果很好，钢笔模仿也是如此。然而，笔画的模仿仍然是有限的(这主要可以归功于我们在这一部分使用的A.Graves的方法，下面的S.)。因此，大多数人和特别是。法医专家会注意到与原件的不同之处。\n目前，该系统必须用大约30行要模拟的主题进行训练。\n作者：马丁·迈尔，马丁·斯顿夫，安圭洛斯·尼古拉，马蒂亚斯·塞雷特，安德烈亚斯·迈尔，文森特·克里斯莱恩预印本：https://arxiv.org/abs/2003.10593 Code：https://github.com/M4rt1nM4yr/spatio-temporal_handwriting_imitation\n从一个离线序列，我们创建一个时间序列，用于修改笔划样式(顶部路径)。最后，我们将其传输回与图像样式相适应的离线域，即笔型、颜色(底部路径)。\n首先，我们需要创建一个健壮的骨架。为了能够用在线数据训练系统，我们开发了一种迭代知识转移，它可以被视为一个展开的CycleGAN。这避免了允许笔划修改的循环一致性。它使用简单的映射来生成脱机手写到手写骨架的更一般的映射。我们表明，这比经典的骨架化更稳健。\n第二步是生成笔画序列。我们无法通过不断的重采样来训练系统，因此我们提出了“最大加速度重采样”，即以稀疏的方式对直线上的点进行采样。\n这里，我们使用了Alex Graves的开创性工作“用递归神经网络生成序列”(Generating Sequence With Recurn Neurn Network)https://arxiv.org/abs/1308.0850。\n对于图像/笔样式转换，我们修改了众所周知的Pix2pix框架以合并样式信息。\n我们创建了一项用户研究，该研究在线位于https://forms.gle/MGCPk5UkxnR23FqT9下方。我们希望鼓励每个人仍然参与进来，这样我们就可以获得更多的数据来进行统计。\n主要结果：1.在图灵测试中，人们仅以50.3%的比例(67.7%的真实样本为真实样本)将我们的假冒样本归为真实样本。2.一种作者识别系统，将25%的伪造段落指定为由要模仿的人所写。", "note_en": "To the best of our knowledge, it is the first paper that synthesizes realistic Western cursive handwriting by mimicking the actual temporal writing process. Our method works nearly fully automatic, e.g. no manual cutting out of characters, and is able to render full lines instead of glyphs/words as in other works.\n  Send personal greeting notes in your handwriting without writing it on a paper and scanning it.\n  Generate handwriting to train modern text recognition engines, which commonly need a lot of training samples.\n Enable forensic researchers to generate and imitate handwriting without the need of a person. Thus, create more robust writer identification methods.\n  At its current stage the generation works quite robust but has problems with artifacts, missing punctuation marks and synthesizing writers w. bad handwriting.\n The imitation of the general writing style works well, as well as the pen imitation. However the stroke imitation is still limited (this can mainly be attributed to the method of A. Graves which we used for this part, s. below). Thus, most people and esp. forensic experts will notice the difference to the original.\n Currently the system has to be trained with about 30 lines of the subject to be imitated.\n  Authors: Martin Mayr, Martin Stumpf, Anguelos Nicolaou, Mathias Seuret, Andreas Maier, Vincent Christlein  Preprint:  https://arxiv.org/abs/2003.10593 Code:  https://github.com/M4rt1nM4yr/spatio-temporal_handwriting_imitation\n  From an offline sequence, we create a temporal one, which is used for a stroke style modification (top path). Eventually, we transfer it back to the offline domain adapted to the image style, i.e. pen style, color (bottom path).\n   First, we need to create a robust skeleton. To be able to train the system with online data, we developed an iterative knowledge transfer which can be seen as an unrolled CycleGAN. This avoids cycle-consistency that would allow a stroke modification. It uses a naive mapping to generate a more general mapping of offline handwriting to a handwriting skeleton. We show that this is more robust than a classical skeletonization.\n  The second step is to generate the stroke sequence. We were unable to train the system with constant resampling, thus we propose ‘maximum acceleration resampling’ which samples points on straight lines in a sparse manner.\n  Here we made use of the seminal work by Alex Graves “Generating Sequences With Recurrent Neural Networks”  https://arxiv.org/abs/1308.0850\n   For the image/pen style transfer, we modify the well-known pix2pix framework to incorporate the style information.\n  We created a user study, which is online below  https://forms.gle/MGCPk5UkxnR23FqT9 . We would like to encourage everyone to still participate so that we get more data to draw statistics.\n Main results: 1. In a Turing test, the people truly assigned our faked samples as such by only 50.3% (67.7% real samples as real samples).  2. Also a writer identification system assigned a faked paragraph by 25% as being written by the person to be imitated.", "posttime": "2020-06-12 09:24:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "笔迹,temporal,https", "title": "时空笔迹模仿", "title_en": "Spatio-Temporal Handwriting Imitation", "transed": 1, "url": "https://lme.tf.fau.de/pattern-recognition-blog/spatio-temporal-handwriting-imitation/", "via": "", "real_tags": ["笔迹", "temporal", "https"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在谷歌網路論壇中，您可以建立並參與線上論壇及電子郵件群組，體驗最精彩的社群交流", "note_en": "在 Google 網路論壇中，您可以建立並參與線上論壇及電子郵件群組，體驗最精彩的社群交流。", "posttime": "2020-06-12 09:07:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,beta,社群", "title": "Go 1.15 Beta 1发布", "title_en": "Go 1.15 Beta 1 is released", "transed": 1, "url": "https://groups.google.com/d/msg/golang-announce/A0frTIl9W6Y/mTgsOVCnAQAJ", "via": "", "real_tags": ["发布", "beta", "社群"]}, {"category": "", "categoryclass": "", "imagename": "5ea6b3e0af22649d2fa6d116bfd0f439.jpeg", "infoid": 1006240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿-据熟悉谈判情况的政府官员透露，特朗普政府正在权衡一项暂停一系列基于就业的移民签证的提议，其中包括令人垂涎的H-1B高技能签证，这是在疫情的经济后果中可能采取的几项措施之一。\n这些官员说，拟议中的暂停可能会延长到政府从10月1日开始的新财年，届时通常会发放许多新签证。这可能会阻止任何国外的新H-1B持有者来到.", "note_en": "WASHINGTON—The Trump administration is weighing a proposal to suspend a slate of employment-based immigration visas, including the coveted H-1B high-skilled visa, according to administration officials familiar with the talks, among several possible measures amid the economic fallout of the pandemic.\n  The proposed suspension could extend into the government’s new fiscal year, beginning Oct. 1, when many new visas are typically issued, these officials said. That could bar any new H-1B holder outside the country from coming to...", "posttime": "2020-06-12 09:06:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "政府,administration,签证", "title": "特朗普政府考虑在秋季暂停H-1B和其他签证", "title_en": "Trump Administration Considers Suspending H-1B, Other Visas Through the Fall", "transed": 1, "url": "https://www.wsj.com/articles/trump-administration-considers-suspending-h-1b-other-visas-through-the-fall-11591915950", "via": "", "real_tags": ["政府", "签证"]}, {"category": "", "categoryclass": "", "imagename": "6546b10e51e1e1e6cd91a3c94333830f.png", "infoid": 1006237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "血清学检测在身体对特定感染(如新冠肺炎)做出反应时，会检测血液中是否存在抗体。换句话说，检测是检测身体对病毒引起的感染的免疫反应，而不是检测病毒本身。在感染的早期，当身体的免疫反应仍在建立时，可能检测不到抗体。这限制了测试的有效性，诊断新冠肺炎，这是一个原因，血清学测试不应该被用作诊断新冠肺炎的唯一依据。血清学测试可以通过帮助医疗专业人员识别可能对SARS-CoV2产生免疫反应的个人，在对抗新冠肺炎的斗争中发挥作用。此外，这些检测结果还可以帮助确定谁可以捐献一部分名为恢复期血浆的血液，这可能会成为新冠肺炎重病患者的一种可能的治疗方法。然而，要正确使用血清学试验，了解它们的性能特点和局限性是很重要的。此外，正在进行研究，以解决将更好地为这些测试的适当使用提供信息的问题，例如抗体的存在是否传达了可以防止或降低再次感染的严重程度的免疫水平，以及免疫持续的时间。\n这些检测的表现是通过它们的敏感性，或它们识别那些有SARS-CoV-2抗体的人的能力(真阳性率)，以及它们的特异性，或它们识别那些没有SARS-CoV-2抗体的人的能力(真阴性率)来描述的。一个测试的敏感性可以通过确定它是否能够检测到来自已被确认患有新冠肺炎的患者的血液样本中的抗体来估计，这些患者已被证实患有核酸扩增试验，或称NAAT。在这些检测的一些验证研究中，比如美国食品和药物管理局与美国国立卫生研究院、美国疾病控制与预防中心和美国疾病控制与预防中心合作进行的研究中，使用的样本除了来自经NAAT确认患有新冠肺炎的患者外，还可能通过其他血清学测试证实存在抗体。检测的特异性可以通过检测在SARS-CoV-2已知已经传播之前收集和冷冻的大量样本来估计，以证明该检测不会产生阳性结果，以应对呼吸道感染的其他原因，如其他冠状病毒的存在。\n这些对敏感度和特异度的估计仅仅是：估计。它们包括95%的置信区间，这是我们大约95%确定一项测试的灵敏度和特异性将落在给定的在性能验证中使用的样本数量的估计范围。用来验证一项测试的样本越多，置信区间就越小，这意味着我们可以对所提供的灵敏度和特异性的估计更有信心。\n测试也用它们的正负预测值(PPV和NPV)来描述。这些措施是使用测试的敏感性、特异性和对人群中具有SARS-CoV-2抗体的个人百分比的假设(在这些计算中称为流行率)来计算的。每次测试都会返回一些假阳性和假阴性结果。PPV和NPV帮助那些解释这些检测的人了解，考虑到携带抗体的个体在人群中是多么普遍，从检测中获得阳性结果的人真的有多大可能真的有SARS-CoV-2抗体，以及从检测中得到阴性结果的人真的没有对SARS-CoV-2抗体的可能性有多大。一项测试的PPV和NPV在很大程度上取决于该测试要检测的流行程度。由于所有检测都会返回一些假阳性和一些假阴性结果，包括检测SARS-CoV-2抗体的测试，因此广泛使用这些测试，如果没有得到其他相关信息的适当信息，如临床病史或诊断测试结果，可能会识别出太多的假阳性个人。\n我们目前不知道SARS-CoV-2抗体阳性个体在美国人口中的流行率，流行率可能会根据病毒在美国停留的时间和缓解措施的有效性而变化。此外，由于感染率不同，不同地点和不同人群(如卫生保健工作者)的流行率可能有很大差异。在低流行率人群中，这将是大部分无症状的普通人群，单一抗体测试的结果不太可能足够准确，不足以做出关于个人是否以前有过感染或确实有病毒抗体的知情决定。第二次测试，通常是评估是否存在不同病毒蛋白的抗体，通常需要进行第二次测试，以提高整体检测的准确性。\n开发者：Vibrant美国临床实验室测试：Vibrant新冠肺炎抗体分析技术：高通量CLIA目标：尖峰和核衣壳。\n开发人员：纽约州卫生部沃兹沃斯中心测试：纽约SARS-CoV抗体检测技术的微球免疫分析：MIA目标：核衣壳。\n在某些情况下，本页上的数字与使用说明中的数字可能存在细微差异。本页显示的敏感性和特异性的置信区间是按照CLSI EP12-A2(2008)中描述的评分方法计算的。请参阅公认的共识标准。PPV和NPV的置信区间是使用敏感性和特异性的95%置信区间的值来计算的。", "note_en": "Serology tests detect the presence of antibodies in the blood when the body is responding to a specific infection, like COVID-19. In other words, the tests detect the body&#39;s immune response to the infection caused by the virus rather than detecting the virus itself. In the early days of an infection when the body&#39;s immune response is still building, antibodies may not be detected. This limits the test&#39;s effectiveness for diagnosing COVID-19, and this is one reason serology tests should not be used as the sole basis to diagnose COVID-19. Serology tests could play a role in the fight against COVID-19 by helping healthcare professionals identify individuals who may have developed an immune response to SARS-CoV-2. In addition, these test results can aid in determining who may donate a part of their blood called convalescent plasma, which may serve as a possible treatment for those who are seriously ill from COVID-19. However, to use serology tests properly, it is important to understand their performance characteristics and limitations. Moreover, studies are underway to address questions that will better inform the appropriate use of these tests, such as whether the presence of antibodies conveys a level of immunity that would prevent or reduce the severity of re-infection as well as the duration for which immunity lasts.\n The performance of these tests is described by their &#34;sensitivity,&#34; or their ability to identify those with antibodies to SARS-CoV-2 (true positive rate), and their &#34;specificity,&#34; or their ability to identify those without antibodies to SARS-CoV-2 (true negative rate). A test&#39;s sensitivity can be estimated by determining whether or not it is able to detect antibodies in blood samples from patients who have been confirmed to have COVID-19 with a nucleic acid amplification test, or NAAT. In some validation studies of these tests, like the one FDA is conducting in partnership with NIH, CDC, and BARDA, the samples used, in addition to coming from patients confirmed to have COVID-19 by a NAAT, may also be confirmed to have antibodies present using other serology tests. A test&#39;s specificity can be estimated by testing large numbers of samples collected and frozen before SARS-CoV-2 is known to have circulated to demonstrate that the test does not produce positive results in response to the presence of other causes of a respiratory infection, such as other coronaviruses.\n These estimates of sensitivity and specificity are just that: estimates. They include 95% confidence intervals, which are the range of estimates we are about 95% sure a test&#39;s sensitivity and specificity will fall within given how many samples were used in the performance validation. The more samples used to validate a test, the smaller the confidence interval becomes, meaning that we can be more confident in the estimates of sensitivity and specificity provided.\n Tests are also described by their Positive and Negative Predictive values (PPV and NPV). These measures are calculated using a test&#39;s sensitivity, its specificity, and using an assumption about the percentage of individuals in the population who have antibodies to SARS-CoV-2 (which is called &#34;prevalence&#34; in these calculations). Every test returns some false positive and false negative results. The PPV and NPV help those who are interpreting these tests understand, given how prevalent individuals with antibodies are in a population, how likely it is that a person who receives a positive result from a test truly does have antibodies to SARS-CoV-2 and how likely it is that a person who receives a negative result from a test truly does not have antibodies to SARS-CoV-2. The PPV and NPV of a test depend heavily on the prevalence of what that test is intended to detect. Because all tests will return some false positive and some false negative results, including tests that detect antibodies to SARS-CoV-2, broad use of the tests, when not appropriately informed by other relevant information, such as clinical history or diagnostic test results, could identify too many false-positive individuals.\n We do not currently know the prevalence of SARS-CoV-2 antibody positive individuals in the U.S. population, and prevalence may change based on the duration the virus is in the country and the effectiveness of mitigations. Moreover, prevalence may vary widely between locations and between different groups of people, such as health care workers, due to different rates of infection. In low prevalence populations, which will be much of the asymptomatic general population, the result of a single antibody test is not likely to be sufficiently accurate to make an informed decision regarding whether or not an individual has had a prior infection or truly has antibodies to the virus. A second test, typically one assessing for the presence of antibodies to a different viral protein, generally would be needed to increase the accuracy of the overall testing results.\n For this page, FDA has summarized the expected performance of the tests it has authorized based on the information FDA reviewed when deciding whether or not to grant these tests an Emergency Use Authorization and assuming a prevalence of 5% for PPV and NPV calculations. For tests that had multiple validation studies or where the tests showed variable performance in samples collected at different times after symptom onset, FDA experts selected the results they considered to be most representative of expected test performance. This is an incomplete representation of the performance of these tests.  Always refer to the complete instructions for use to put these estimates into the proper context and to understand how to use and interpret these tests. FDA also is providing a  calculator that will allow users to see the estimated performance of a single test or two independent tests based on their performance characteristics and the estimated prevalence of SARS-CoV-2 antibodies in the target population.\n                                                              Developer: Mount Sinai Hospital Clinical Laboratory  Test: Mt. Sinai Laboratory COVID-19 ELISA Antibody Test  Technology: 2-Step ELISA  Target: Spike\n            Developer: Ortho-Clinical Diagnostics, Inc.  Test: VITROS Immunodiagnostic Products Anti-SARS-CoV-2 Total Reagent Pack and Calibrator  Technology: High Throughput CLIA  Target: Spike\n                        Developer: Vibrant America Clinical Labs  Test: Vibrant COVID-19 Ab Assay  Technology: High Throughput CLIA  Target: Spike and Nucleocapsid\n      Developer: Wadsworth Center, New York State Department of Health  Test: New York SARS-CoV Microsphere Immunoassay for Antibody Detection  Technology: MIA  Target: Nucleocapsid\n      In some cases, there may be minor differences between the numbers on this page and those in the instructions for use. Confidence intervals for sensitivity and specificity that appear on this page were calculated per a score method described in CLSI EP12-A2 (2008). See  Recognized Consensus Standards. Confidence intervals for PPV and NPV were calculated using the values from the 95% confidence intervals for sensitivity and specificity.", "posttime": "2020-06-12 08:32:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,授权,authorized,测试", "title": "EUA授权血清学检测性能", "title_en": "EUA Authorized Serology Test Performance", "transed": 1, "url": "https://www.fda.gov/medical-devices/emergency-situations-medical-devices/eua-authorized-serology-test-performance", "via": "", "real_tags": ["性能", "授权", "测试"]}, {"category": "", "categoryclass": "", "imagename": "e429a44de42010cf22347d1e3da3623f.jpg", "infoid": 1006235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "田纳西州诺克斯维尔市在夜间发生勒索软件攻击后，被迫关闭了整个计算机网络。勒索软件攻击的目标是该市的办公室。\n诺克斯维尔的人口超过18万，是田纳西州仅次于纳什维尔和孟菲斯的第三大城市，也是诺克斯维尔大都会统计区的一部分，据报道，2015年人口近87万。\n据诺克斯维尔首席运营官大卫·布雷斯(David Brace)表示，诺克斯维尔网络上的电脑一夜之间就被加密了，6月11日凌晨4点30分左右，该市消防部门的员工注意到了这次攻击。\n请注意，我们的网络遭到了勒索软件的攻击，周四上午发给该市员工的一份通知写道。\n信息系统目前遵循推荐的协议。这包括关闭服务器、我们的互联网连接和PC。请不要在此时登录网络或使用计算机应用程序。&#34；\n虽然诺克斯维尔市官方网站在本文发表时仍处于停机状态，但诺克斯县政府的计算机操作并未受到攻击的影响。\n在勒索软件攻击和计算机网络关闭后，市法院的开庭时间也被取消，一旦系统恢复，开庭日期将被重置。\n据DJ·科克伦(D.J.Corcoran)和斯科特·埃兰德(Scott Erland)的发言人表示，事件发生后，该市消防局和警察局的行动没有受到影响，但工作人员无法访问该市的网络。\n诺克斯维尔发言人埃里克·弗里兰在接受WBIR采访时表示，伦敦金融城没有存储信用卡信息，因此在网上预订伦敦金融城设施的个人不会面临风险。\n诺克斯维尔：在对市政府办公室的勒索软件攻击中，没有获取个人信息。首席运营官大卫·布雷斯(David Brace)明确表示，没有个人信息被访问。我会在@6News pic.twitter.com/lPXksVAXMv上看到最新的#WATE@，从4点开始。\n-Madisen Keavy(@madisenkeavy)2020年6月11日。\n该市向联邦调查局(FBI)报告了勒索软件攻击事件，目前正在与田纳西州调查局合作，作为正在进行的事件调查的一部分。\n市政府发言人告诉WATE 6。市政府各部门正在进行相应的调整，以满足居民和企业的需求，但市政府办公室和服务都照常开放，尽管来市政府办公室的游客可能会遇到一些不便。“(市政府发言人告诉WATE 6。&34；市政府部门正在进行相应的调整，以满足居民和企业的需求。)”\n首席运营官大卫·布雷斯(David Brace)表示，此次袭击背后的威胁分子也要求为每条诺克斯新闻支付赎金，但他拒绝透露具体金额。\n诺克斯县市长还在推特上就该市的勒索软件攻击发表了一份声明，称无论防御多么出色，任何人或任何政府都可能遭受网络攻击。在很多情况下，这不是是否的问题，而是何时的问题。\n目前，对这次攻击负责的勒索软件组织仍不清楚，但我们会在得到更多信息后立即更新文章。\n2018年5月，诺克斯县受到另一次网络攻击的影响，当时诺克斯维尔的诺克斯县政府在发生分布式拒绝服务(DDoS)攻击后，在地方选举期间一些服务器被切断。\n今晚，我们的网络服务器遭受了成功的拒绝服务攻击。选举结果没有受到影响，因为我们的选举机器从来没有连接过互联网。我们的工作人员正在努力遏制攻击，并继续在https://t.co/aH2Pdne56k.发布选举申报单。\n-诺克斯公司政府(@knoxgov)2018年5月2日", "note_en": "The City of Knoxville, Tennessee, was forced to shut down its entire computer network following a ransomware attack that took place overnight and targeted the city&#39;s offices.\n Knoxville has a population of over 180,000, it&#39;s Tennessee&#39;s third-largest city after Nashville and Memphis, and it&#39;s also part of the Knoxville Metropolitan Statistical Area, with a reported population of almost 870,000 in 2015.\n  Computers on Knoxville&#39;s network were encrypted overnight, with the attack being noticed by employees of the city&#39;s fire department around 4:30 AM, June 11, according to Chief Operations Officer David Brace.\n &#34;Please be advised that our network has been attacked with ransomware,&#34; a notice sent to city employees on Thursday morning reads.\n &#34;Information Systems is currently following recommended protocols. This includes shutting down servers, our internet connections, and PCs. Please do not log in to the network or use computer applications at this time.&#34;\n While the  City of Knoxville official website was still down at the time this article was published, Knox County government computer operations have not been affected in the attack.\n City Court sessions have also been canceled after the ransomware attack and the computer network shut down, with court dates to be reset once the systems are restored.\n  The city&#39;s Fire Department and Police Department operations are not affected following the incident according to spokesmen D.J. Corcoran and Scott Erland, but personnel cannot access the city&#39;s network.\n  &#34;No credit card information is stored by the City, so individuals who have made any online reservations of City facilities are not believed to be at risk,&#34; Knoxville spokesman Eric Vreeland told  WBIR.\n Knoxville: No personal info accessed in ransomware attack on city offices.  Chief Operating Officer David Brace made it clear, no personal information was accessed.  I&#39;ll have the latest on  #WATE @ starting at 4 on  @6News  pic.twitter.com/lPXksVAXMv\n— Madisen Keavy (@madisenkeavy)  June 11, 2020\n The city reported the ransomware attack o the Federal Bureau of Investigation (FBI) and is currently working with the Tennessee Bureau of Investigation as part of an ongoing incident investigation.\n &#34;City offices and services are open and available as usual, though visitors to City offices may encounter some inconveniences,&#34; a city spokesperson told  WATE 6. &#34;City departments are adjusting accordingly to address the needs of residents and businesses.”\n Chief Operations Officer David Brace said that the threat actors behind this attack have also asked for a ransom to be paid per  knox news, but he refused to give the exact amount.\n Knox County Mayor also  issued a statement on the city&#39;s ransomware attack on Twitter saying that &#34;[c]yber attacks can happen to anyone or any government no matter how good the defense is. In a lot of cases it’s not a matter of if but a matter of when.&#34;\n  At the moment, the ransomware group responsible for this attack is still unknown but we will update the article as soon as we have more information.\n Knox County was affected by another cyberattack in May 2018 when the Knox County Government in Knoxville had some of its servers knocked offline during a local election following a distributed denial-of-service (DDoS) attack.\n Tonight, Our web servers suffered a successful denial of service attack. Election results were not affected, as our election machines are never connected to the Internet. Our staff is working to contain the attack &amp; continue releasing election returns at  https://t.co/aH2Pdne56k.\n— Knox Co. Government (@KnoxGov)  May 2, 2018", "posttime": "2020-06-12 08:15:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,knoxville,攻击", "title": "诺克斯维尔市在勒索软件攻击后关闭网络", "title_en": "City of Knoxville Shuts Down Network After Ransomware Attack", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/city-of-knoxville-shuts-down-network-after-ransomware-attack/", "via": "", "real_tags": ["软件", "knoxville", "攻击"]}, {"category": "", "categoryclass": "", "imagename": "dae30d8d858959e197be917040d88595.jpg", "infoid": 1006234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人民大学，是第一所非营利性、免学费、在线认证的美国大学，了解更多关于", "note_en": "University of the People, is the first non-profit, tuition-free, online accredited American university, learn more about the", "posttime": "2020-06-12 07:57:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,大学,people,美国大学", "title": "人民大学：免费、经认可的在线学位课程", "title_en": "University of the People: Tuition-Free, Accredited Online Degree Programs", "transed": 1, "url": "https://www.uopeople.edu/", "via": "", "real_tags": ["免费", "大学", "people", "美国大学"]}, {"category": "", "categoryclass": "", "imagename": "da084bf51c794403fb2eea8b2c72e18d.jpeg", "infoid": 1006233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "汽车租赁公司赫兹全球控股公司(Hertz Global Holdings Inc.)。希望利用本周早些时候出现的股价反弹，出售高达10亿美元的股票，尽管破产有可能将它们抹去。\n本周早些时候，赫兹的股价涨至5.53美元，比该公司5月22日申请破产后56美分的收盘价上涨了近10倍。", "note_en": "Rental-car company Hertz Global Holdings Inc. wants to capitalize on the rally in its stock seen earlier this week by selling up to $1 billion in shares, despite a bankruptcy that threatens to wipe them out.\n  Hertz’s shares rose to $5.53 earlier this week, a nearly 10-fold increase over their closing price of 56 cents following the company’s May 22 bankruptcy filing.", "posttime": "2020-06-12 07:57:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "赫兹,hertz,破产", "title": "破产的赫兹希望出售高达10亿美元的新股", "title_en": "Bankrupt Hertz Wants to Sell Up to $1B in New Shares", "transed": 1, "url": "https://www.wsj.com/articles/bankrupt-hertz-wants-to-sell-up-to-1-billion-in-new-shares-11591917121", "via": "", "real_tags": ["赫兹", "hertz", "破产"]}, {"category": "", "categoryclass": "", "imagename": "af69fee01023d64db8002bc08093b936.jpg", "infoid": 1006230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的100万年里，人类人口史上发生了一些奇怪的事情。首先，我们的数量降到了18500只，我们的祖先比黑猩猩和大猩猩更濒危。然后我们反弹到非同寻常的水平，远远超过了其他类人猿。\n根据世界野生动物基金会(World Wildlife Fund)的数据，今天大猩猩、黑猩猩、黑猩猩和猩猩的总数估计只有50万左右。许多物种处于极度濒危状态。与此同时，人口已激增至77亿。具有讽刺意味的是：我们惊人的繁衍能力现在威胁到了包括我们在内的许多物种的长期可持续性。\n发生了什么？为什么我们生活在人类世，而不是一个类似于人猿星球的世界？我们大约99%的DNA与我们的类人猿表亲、黑猩猩和矮黑猩猩共享。那么，是什么让我们与我们最亲密的亲戚不同，使我们拥有惊人的繁殖和生存能力呢？\n作为一名进化论人类学家，这些问题让我在墨西哥的尤卡泰克·玛雅人、委内瑞拉的普梅狩猎采集者和马达加斯加的塔纳拉农学家中生活和学习。我的研究与基因数据和其他研究相结合，提供了一些线索，揭示了在遥远的过去，是什么让人类如此成功-无论是好是坏。\n在20世纪70年代，墨西哥尤卡坦半岛与世隔绝的Xculoc村庄是大约300名玛雅人的家园。种植玉米的居民没有电，也没有自来水。妇女们用绳子和水桶从50米深的井里拉水。他们用手摇的研磨机研磨玉米--他们的主食。\n然后引入了两项技术，改变了这些玛雅人的生活，并最终改变了他们的人口：一台燃气水泵和两台燃气玉米研磨机。\n使用这些设备，年轻女性每天节省了大约两个半小时的劳动力和325卡路里的热量。此外，年幼的兄弟姐妹可以更容易地取水和碾碎玉米，解放了他们姐姐的时间，实际上减少了他们每天的繁重工作。这一点很重要，因为研究发现，繁重的自给自足工作会抑制卵巢功能，而减少分娩和提高女性的能量平衡与生育率的提高有关。\n随后，徐克洛克的妇女第一次生育的年龄下降了两岁。根据我的长期研究，在这些机器到来后开始生育的女性比前几代人产生的家庭要大得多。到2003年，在20世纪70年代开始生育的女性有了8到12个孩子。\n节省妇女的时间和精力是增加人口的核心。人类已经发展出许多不同于我们的类人猿亲戚的技术和社会方式来实现这一点。\n值得注意的是，科学家在将当代人或类人猿与我们的远古祖先进行直接类比时必须谨慎。但是现代人和灵长类动物是我们最好的工具，用来推断我们的数字成功的基础可能是如何演变的。\n在进化道路上的某个地方，人类开始青睐新的生育和抚养后代的方式。母亲们很早就开始给婴儿断奶。在现代社会，婴儿依赖母亲的母乳，而不是奶瓶喂养，婴儿要哺乳两到三年。相比之下，大猩猩妈妈要哺育她们的幼崽四到六年。\n母乳喂养的卡路里费用很高。一位母亲每天要多摄入600卡路里的热量才能产奶。所以，她越早停止哺乳，就能越早从生理上支持另一次怀孕。在没有避孕措施的现代社会，母亲平均每三年分娩一次。其他类人猿的出生间隔可能长达六到八年。\n我们的远古祖先也喂养、庇护和照顾那些断奶但仍在生长的幼崽。这给了它们更好的生存机会，而非人类的大猩猩幼崽在断奶后会自己照顾自己。今天，生活在狩猎采集社会的孩子活到15岁的可能性是野生黑猩猩的两倍。\n与早期的原始人相比，新颖的育儿方式意味着人类母亲处于一种独特的境地，即同时要照顾多个不同年龄的受抚养人。我无法强调这在多大程度上将人类母亲和孩子与其他类人猿区分开来。\n有很多孩子对这个物种的成功是很好的。但有个问题。母亲们一天中没有足够的时间全职照顾她们的婴儿，同时还要照顾年长的孩子。这一点尤其正确，因为人类饮食的独特方面给母亲们带来了许多需要处理的任务。\n当这些古老的生活史特征进化时，我们的祖先以狩猎采集为生，他们通常吃各种各样的食物，包括水果、坚果、块茎、根、大大小小的猎物、鸟类、爬行动物、蛋、昆虫、鱼和贝类。拼凑这样的菜单需要现代狩猎采集者平均每天旅行13公里。相比之下，黑猩猩和大猩猩平均每天漫游2公里。\n更重要的是，狩猎-采集者对他们的大部分食物进行加工，以使其更易于消化或提高营养的生物利用率。正如每个做饭的人都知道的那样，这需要相当长的时间。\n在来自委内瑞拉大草原的Pumé狩猎采集者中，女性每天大约花三个小时敲碎、捣碎、研磨、敲打、筛分、筛选、屠宰和烹饪食物。生活在中非伊图里森林的埃菲妇女-狩猎-采集者也是如此。\n除了准备时间之外，Pumé和Efe还花了几个小时寻找食物，然后把材料带回营地。此外，每项加工任务都需要专门的技术，这意味着必须有人收集原材料和制造工具。！南部非洲卡拉哈里沙漠的功夫男女每天花大约一个小时制作和修理工具。稀树草原上的女性花在工具制作上的时间将近两个小时--是男性的两倍。\n狩猎采集者还建造庇护所和壁炉，以提供一个安全的地方来加工食材，储存食物和工具，并留下可能太小而不能陪同其他人进行长途觅食的孩子。此外，他们还必须运水、劈柴、穿衣服，并维护获取地理上分散的资源所需的社会和信息网络。\n对于任何一个人来说，一天中没有足够的时间来完成所有这些事情。所以，我们的祖先想出了一个解决方案。\n这个解决方案是合作，但不是许多物种参与的那种分担任务的方式。狩猎-采集者发展了一种称为代际合作的独特特征：父母帮助孩子，孩子帮助父母。\n这不是我们和其他类人猿共有的特征，它们不太擅长分享食物，不擅长帮助不是自己亲生的母亲或后代，甚至不擅长在自己的孩子达到一定年龄后赡养他们自己的孩子。一旦断奶，非人类的类人猿母亲很少与他们的幼年后代分享食物，而且幼猿也不会给他们的母亲提供食物。\n但在人类中，代际合作意味着确实需要一个村庄来抚养孩子。在不同的文化中，狩猎采集和农业社会的母亲只提供婴儿直接护理的一半左右。例如，除了母亲之外，稀树草原上的婴儿平均有9名照顾者。EFE婴儿平均有11个。\n父亲和祖父母在养家糊口方面肯定扮演着重要的角色。但这还不够。玛雅母亲的平均年龄是60岁，到她最后一个孩子离开家时，所以在那之后她只有很少的几年时间可以做保姆或收集食物的祖母了。\n我的研究表明，一个更明显的帮助来源被忽视了：儿童。在许多文化中，除了母亲之外，儿童提供了大部分的儿童护理。而7到10岁的孩子承担了大部分的保姆工作。\n孩子们还负责处理大部分食物和料理家务。一个Pumé男孩每天平均带回家4.5公斤的野果。这相当于3200卡路里-足以养活他自己和至少他的一些家人。(这还不包括他在野外做的任何零食。)。他的妹妹可以带回家超过一公斤的根(价值约4000卡路里)-其中一些她会吃，但大部分是她分享的。在东非的哈扎族狩猎采集者中，孩子们每天觅食5到6个小时。到5岁时，他们可以在某些季节提供大约50%的自己的卡路里。\n农业社区的孩子也是勤劳的工人。尤卡特克·玛雅的年龄在7岁到14岁之间，每天花2到5个小时做家务和实地工作。15岁至18岁的青少年每天工作约6.5小时-与他们的父母一样多。\n到玛雅母亲40岁时，她家里平均有7个孩子。这些孩子每天总共贡献了20个小时的工作，提供了家庭消费的60%。\n多亏了这种多代人的帮助，女性可以花时间做只有她才能做的事情：多生孩子。因此，儿童增加了人口，但他们的劳动力也是推动社区生育和加快生殖的内在引擎。\n随着代际合作和多样化的饮食策略，我们的祖先繁衍并经受住了人口瓶颈。1800年刚过，人口就达到了10亿。\n随后，全球人口呈指数级增长，主要是因为婴儿和老年人的存活率都有所提高。1927年达到20亿，1960年达到30亿，1974年达到40亿，1987年达到50亿，1999年达到60亿，2011年达到70亿，今天超过77亿。这些数字作为一个进化之谜引起了我的兴趣，并作为一个当代问题深深地关注着我。不过，毫无疑问，人类已经取得了令人难以置信的成功。问题是：我们还能保持这种成功多久，并且仍然是可持续的？答案就像我们过去的增长秘诀一样，站在合作的肩膀上。\n*编者按：这篇文章的大部分内容来自她第47次JAR杰出演讲，题为“我们是如何变得如此众多的”，该演讲发表在2019年冬季的“人类学研究杂志”(Journal Of Anthropolical Research)上。", "note_en": "Something curious happened in human population history over the last 1 million years. First, our numbers fell to  as low as 18,500 , and our ancestors were more endangered than chimpanzees and gorillas. Then we bounced back to extraordinary levels, far surpassing the other great apes.\n Today the total population of gorillas, chimpanzees, bonobos, and orangutans is estimated to be only around 500,000, according to the  World Wildlife Fund. Many species are critically endangered. Meanwhile, the human population  has surged to 7.7 billion. And the irony is: Our astonishing ability to multiply now threatens the long-term sustainability of many species, including ours.\n What happened? Why do we live in the Anthropocene and not a world resembling   Planet of the Apes? We share around 99 percent of our DNA with our great ape cousins, chimpanzees and bonobos. So, what makes us different from our closest relatives that gives us our staggering capacity for reproducing and surviving?\n As an evolutionary anthropologist, these questions have led me to live and study among the Yucatec Maya of Mexico, the Pumé hunter-gatherers of Venezuela, and the Tanala agriculturalists of Madagascar. My research, * combined with genetic data and other studies, offers clues to what developed in the deep past that has made humans so successful—for better or for worse.\n  In the 1970s, the isolated village of Xculoc, in Mexico’s Yucatan Peninsula, was home to about 300 Maya people. The maize-farming residents had no electricity or running water. Women hauled water from a 50-meter-deep well using ropes and buckets. They ground maize—the mainstay of their diet—in hand-cranked grinders.\n Then two technologies were introduced that changed these Maya’s lives and, ultimately, their population: a gas-powered water pump and two gas-powered maize grinders.\n Using these devices, young women saved about two and a half hours of labor and 325 calories a day. In addition, younger siblings could more easily fetch water and crush maize, freeing up their older sisters’ time and literally decreasing their daily grind. That’s important because studies have found that heavy subsistence work  suppresses ovarian function, whereas reducing labor and raising women’s energy balance is associated with a bump in fertility.\n  Subsequently, the age at which women in Xculoc first gave birth dropped by two years. And according to my long-term research, women who started childbearing after these machines arrived produced significantly larger families than prior generations. By 2003, women who started reproducing in the 1970s had eight to 12 children.\n Saving women time and energy is central to increasing the population. And humans have developed numerous technological and social ways of accomplishing this that differ from our great ape relatives.\n It’s important to note that scientists must be cautious about drawing direct analogies between contemporary people or apes and our ancient ancestors. But modern humans and primates are our best tools for inferring how the underpinnings of our numerical success may have evolved.\n Somewhere along the evolutionary road, humans started to favor new ways of having and raising their young. Mothers began weaning their infants earlier. In modern societies where infants rely on their mother’s milk and not bottle feeding, babies nurse for two to three years. By contrast, great ape mothers nurse their young for four to six years.\n Breastfeeding is calorically expensive. It takes a mother about 600 extra calories a day to produce milk. So, the sooner she stops nursing, the sooner she can biologically support another pregnancy. In modern societies without contraception, mothers give birth on average every three years. Other great apes may wait as many as six to eight years between births.\n Our ancient ancestors also fed, sheltered, and cared for youngsters who were weaned but still growing. This gave them a better chance at surviving than nonhuman great ape young, which fend for themselves after they’re weaned. Today a child living in a hunter-gatherer society is twice as likely as a wild chimpanzee to survive to age 15.\n Novel ways of parenting, compared to earlier hominins, meant human mothers were in the unique situation of having multiple dependents of different ages to care for at the same time. I cannot underscore enough how much this sets human mothers and children apart from the other great apes.\n Having lots of kids is great for the success of the species. But there’s a hitch. Mothers don’t have enough hours in the day to care for their babies full time while providing for their older offspring. That’s especially true because the unique aspects of the human diet give mothers a lot of tasks to juggle\n When these ancient life history traits were evolving, our ancestors made their living as hunter-gatherers, who typically eat diverse fare, including fruits, nuts, tubers, roots, large and small game, birds, reptiles, eggs,  insects, fish, and shellfish. Cobbling together such a menu requires modern hunter-gatherers to travel, on average, 13 kilometers per day. By contrast, chimpanzees and gorillas roam, on average, 2 kilometers per day.\n What’s more, hunter-gatherers process most of their food to make it more digestible or to boost the bioavailability of nutrients. And as everyone who prepares food knows, that takes a significant amount of time.\n Among the Pumé hunter-gatherers from the savannas of Venezuela, women spend about three hours a day cracking, mashing, grinding, pounding, sifting, winnowing, butchering, and cooking food. The same is true of Efe women—hunter-gatherers living in the Ituri forest of Central Africa.\n That prep time is in addition to the hours the Pumé and Efe spend foraging and then carrying ingredients back to camp. Furthermore, each processing task requires a specialized technology, which means someone has to collect raw materials and make tools. !Kung women and men in the Kalahari Desert of Southern Africa spend about an hour each day making and repairing tools. Savanna Pumé women devote nearly two hours to toolmaking—twice as much as the men.\n  Hunter-gatherers also build shelters and hearths to provide a safe place to process ingredients, to store food and tools, and to leave children who may be too young to accompany others on long foraging trips. Plus, they must haul water, chop firewood, fashion clothing, and maintain the social and information networks needed to access geographically dispersed resources.\n There are simply not enough hours in the day for any one person to accomplish all this. So, our ancestors came up with a solution.\n That solution was cooperation—but not the kind of task-sharing many species engage in. Hunter-gatherers developed a distinct feature called intergenerational cooperation: Parents help kids,  and children help parents.\n This is not a trait we share with the other great apes, who aren’t particularly good at sharing food, helping mothers or offspring who aren’t their own, or even supporting their own children after they reach a certain age. Nonhuman great ape mothers rarely share meals with their juvenile offspring once they’re weaned, and juvenile apes don’t offer food to their moms.\n But among humans, intergenerational cooperation means it really does take a village to raise a child. Across cultures, mothers in hunter-gatherer and agricultural societies offer only about half of the direct care an infant receives. Savanna Pumé infants, for example, have an average of nine caretakers besides their mother. Efe infants have an average of 11.\n Fathers and grandparents certainly play important roles in supporting their families. But it’s not enough. An average Maya mother is 60 by the time her last child leaves home, so she has very few years after that to be a babysitting or food-collecting grandmother.\n My research suggests a much more obvious source of help has been overlooked: kids. Other than mothers, children provide most of the child care in many cultures. And 7- to 10-year-olds do the bulk of the babysitting.\n Children are also responsible for processing much of the food and running the household. A Pumé boy carries home an average of 4.5 kilograms of wild fruit on days he forages. That’s the equivalent of 3,200 calories—enough to feed himself and at least some of his family. (And that’s in addition to any snacking he does in the field.) His sister can bring home more than a kilogram of roots (worth about 4,000 calories)—some of which she will eat, but most of which she shares. Among the Hadza hunter-gatherers of East Africa, children forage for five to six hours a day. By age 5, they can supply about 50 percent of their own calories during some seasons.\n  Children in agricultural communities are also hard workers. Yucatec Maya between the ages of 7 and 14 devote two to five hours a day to domestic and field work. Teens between the ages of 15 and 18 labor about 6.5 hours a day—as much as their parents.\n By the time a Maya mother is 40, she has an average of seven children at home. These children contribute a combined 20 hours of work a day and supply 60 percent of what the family consumes.\n Thanks to this multigenerational help, a woman can spend time doing what only she can do: have more children. So, children increase the population, but their labor is also a built-in engine to fuel their community’s fertility and speed up reproduction.\n With intergenerational cooperation and a diversity of dietary strategies, our ancestors multiplied and weathered population bottlenecks. Just after 1800, the human population hit 1 billion.\n The global population then expanded exponentially, largely due to the enhanced survival of both infants and older people. It reached 2 billion in 1927, 3 billion in 1960, 4 billion in 1974, 5 billion in 1987, 6 billion in 1999, 7 billion in 2011, and today is at over 7.7 billion.   These figures intrigue me as an evolutionary enigma and deeply concern me as a contemporary issue. There is no question, though, that humans have been incredibly successful. The question is: How long can we maintain that success and still be sustainable? The answer, like our secret to growth in the past, stands on the shoulders of cooperation.\n  * Editor’s note: The author derived much of this essay from  her 47th JAR Distinguished Lecture, “How There Got to Be So Many of Us,” which was published in the Winter 2019 issue of the Journal of Anthropological Research .", "posttime": "2020-06-12 07:23:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,humans,孩子", "title": "为什么会有这么多人类？", "title_en": "Why Are There So Many Humans?", "transed": 1, "url": "https://www.sapiens.org/evolution/human-population-evolution/", "via": "", "real_tags": ["人类", "humans", "孩子"]}]