[{"category": "", "categoryclass": "", "imagename": "55a975a2de3d9cda7e0e82b898c9b995.jpg", "infoid": 1071848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Kenny Small 是全球领先的 AI 驱动的质量工程公司 Qualitest Group 的 SAP 和企业副总裁。选择开辟自己的道路来产生销售的在线零售商经常想知道他们如何与亚马逊竞争。现实情况是，亚马逊真正独特的销售主张是其分销网络。在线零售商将无法​​在这一点上竞争，因为亚马逊的分销网络太快了。相反，重要的是专注于他们可以擅长的领域——而不必成为亚马逊平台上的第三方卖家。以下是与在线零售商相关的七个关键提示，这些在线零售商希望吸引和留住客户，而不必与亚马逊合作或试图在自己的游戏中击败它。在线零售商需要考虑它想要创造什么样的体验；客户希望在线购物旅程的每一步都能顺利进行。一个想法是实施一个消费者数据平台，帮助零售商深入了解他们的客户：他们是谁，他们喜欢什么，他们经常访问哪些网站以及其他相关信息。零售商可以使用这些数据，然后针对客户实际想要购买的产品投放广告。消费者数据平台甚至可以帮助在线零售商跨平台以及店内定位消费者。在线零售商最大的挫折之一是网站的性能，从进入网站到销售结束。如果在搜索产品和付款过程中的任何时候出现故障或小故障，客户将离开而不会回来。\n此问题的解决方案涉及对用户界面的大量测试，以确保良好的用户体验。应该对网站上的所有电子商务细分市场进行测试，包括购物篮和广告横幅。通过在客户旅程中插入标签，零售商可以跟踪销售损失并查看其网站上发生的问题。作为一种支付方式，PayPal 最近在 2019 年第三季度和 2020 年第三季度之间的支付量同比增长了创纪录的 36%。 尽管 PayPal 很受欢迎，但亚马逊并不接受它作为一种支付方式。", "note_en": "Kenny Small is vice president SAP and Enterprise at  Qualitest Group, the world’s leading AI-powered quality engineering company.\n  Online retailers that have opted to forge their own path to generate sales often wonder how they can compete with Amazon.\n  The reality is that Amazon’s true unique selling proposition is its distribution network. Online retailers will not be able to compete on this point because Amazon’s distribution network is so fast. Instead, it’s important to focus on areas where they can excel — without having to become a third-party seller on Amazon’s platform.\n The following are seven key tips that are relevant for online retailers that want to attract and retain customers without having to partner with Amazon or to try to beat it at its own game.\n  An online retailer needs to consider what kind of experience it wants to create; customers expect smooth processes on every step of their online shopping journey.\n One idea is to implement a consumer data platform that will help the retailer gain the best insights into their customers: who they are and what they like, which websites they frequent and other relevant information. Retailers can use this data to then target customers with ads for products they’ll actually want to buy. Consumer data platforms can even help online retailers target consumers across platforms as well as in the store.\n  One of the biggest frustrations with online retailers is the performance of a website, from getting on the site through the closing of the sale. If something fails or glitches at any point in the process of searching for a product and paying for it, the customer will leave and not come back.\n The solution to this problem involves a lot of testing of the user interface to ensure a good user experience. Tests should be done on all e-commerce segments on a site, including the basket and ad banners. By inserting tags along the customer journey, a retailer can track lost sales and see where problems happen on their website.\n  As a payment option, PayPal recently experienced a record  36% year-on-year growth in payment volume between the third quarter of 2019 and Q3 2020. Despite PayPal’s popularity, Amazon does not accept it as a form of payment.", "posttime": "2021-08-07 03:33:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,停止,retailers,零售商", "title": "在线零售商：停止试图击败亚马逊", "title_en": "\n\t\t\t\tOnline retailers: Stop trying to beat Amazon\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/online-retailers-stop-trying-to-beat-amazon/", "via": "", "real_tags": ["amazon", "亚马逊", "停止", "retailers", "零售商"]}, {"category": "", "categoryclass": "", "imagename": "2621e56d877fdfd85ca2a2f15fd5a932.jpg", "infoid": 1071847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在每年将 ARR 增长 100% 或更多的企业中，增长团队出现的可能性是其两倍。更重要的是，在实现产品市场匹配之后，它们似乎也更常见——通常是在一家公司的收入达到约 500 万至 1000 万美元之后。我不是要告诉你为什么需要一个增长团队，但我会指出，拥有增长团队的产品主导型企业会看到显着的结果——免费到付费转化率中位数的两倍。根据产品基准调查的回应，增长团队已经从向营销和销售的报告转变为直接向 CEO 报告。一些关于增长团队的早期文章说，他们可以单独构建为自己的独立团队，也可以作为特警模型，组织中其他各个部门的专家会聚在一起以固定的节奏来解决增长问题。我的经验以及我从以业务用户为中心的软件公司收集的数据使我得出结论，业务软件中的增长团队不应该被构建为“特警”团队，跨职能领导聚集在一起进行批判性思考关于企业面临的增长问题。我发现如果问题没有真正的主人，它们就不会得到解决。增长问题也不例外，除非有人的工作是考虑这些问题，否则通常会被优先考虑。注重产品的增长专家：这些人都是关于优化用户体验、减少摩擦和扩大使用。他们通常具有很强的分析能力，并且可能具有产品、数据或 MarketingOps 背景。", "note_en": "Growth teams are twice as likely to appear among businesses growing their ARR by 100% or more annually. What’s more, they also seem to be more common after product-market fit has been achieved — usually after a company has reached about $5 million to $10 million in revenue.\n  I’m not here to sell you on why you need a growth team, but I will point out that product-led businesses with a growth team see dramatic results — double the median free-to-paid conversion rate.\n   According to responses from  product benchmarks surveys, growth teams have transitioned dramatically from reporting to marketing and sales to reporting directly to the CEO.\n Some of the early writing on growth teams says that they can be structured individually as their own standalone team or as a SWAT model, where experts from various other departments in the organization converge on a regular cadence to solve for growth.\n  My experience, and the  data I’ve collected from business-user focused software companies, has led me to the conclusion that growth teams in business software should not be structured as “SWAT” teams, with cross-functional leadership coming together to think critically about growth problems facing the business. I find that if problems don’t have a real owner, they’re not going to get solved. Growth issues are no different and are often deprioritized unless it’s someone’s job to think about them.\n   Product-minded growth experts: These folks are all about optimizing the user experience, reducing friction and expanding usage. They’re usually pretty analytical and might have product, data or MarketingOps backgrounds.", "posttime": "2021-08-07 03:32:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "构建,structure,增长", "title": "如何雇用和构建增长团队", "title_en": "\n\t\t\t\tHow to hire and structure a growth team\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/how-to-hire-and-structure-a-growth-team/", "via": "", "real_tags": ["构建", "structure", "增长"]}, {"category": "", "categoryclass": "", "imagename": "2d30c840f8a2c540a6cd1f7ef9da2567.jpg", "infoid": 1071846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能驱动的声音在你耳边能帮助缩小这个差距吗，哪怕只是一点点？ SenpAI.GG 是 Y Combinator 最新一批中的一家公司，也是这么认为的。大部分上述差距归结为练习、肌肉记忆和——让我们面对现实——自然能力。但是随着游戏变得更老/更大/更复杂，最好的玩家往往拥有丰富的一种资源，这些资源非常重要，如果收集起来不是非常有趣的话：信息。哪些枪在这个范围内造成的伤害最大？哪个角色最适合对抗这张地图上的那个角色？见鬼，当您启动游戏时，屏幕上闪过的“小更新”发生了什么变化？等等，为什么我最喜欢的武器突然变得更难控制了？在玩家发现新战术和更新时掌握所有这些信息，改变“元”本身就是一个挑战。它通常涉及大量 Twitch 流、大量围绕 Reddit 线程的挖掘以及大量研究补丁说明。 SenpAI.GG 正在寻求自动显示更多此类信息并帮助新玩家更快地变得更好。他们的桌面客户端为您提供它认为可以提供帮助的信息、对您的策略的赛后分析，以及您可能还不太擅长跟踪的游戏内音频提示。它目前支持少数游戏——英雄联盟、Valorant 和 Teamfight Tactics——它提供的信息因游戏而异。例如，在 LoL 中，它会查看两支队伍选择的冠军，并尝试推荐您可以选择最能帮助您的英雄；与此同时，在《Valorant》中，当您忘记重新加载或忘记重装多久时，它可以为您提供音频提示，提示您的一位队友健康状况不佳（在该队友开始对您大喊大叫之前）在 Spike（阅读：游戏结束炸弹）爆炸之前得到。与它提供的信息一样重要的是它不会提供的信息。在我和他的聊天中，SenpAI.GG 创始人 Olcay Yilmazcoban 似乎很清楚这里有一条难以定义的界限，其中“助手”模糊为“作弊工具”——但公司遵循某些规则来保持正确的一面并防止他们的球员被禁止。\n例如，他们永远不会代表玩家采取行动——他们可能会发出音频提示说“嘿，你应该治愈那个队友”，但他们不会为你按下按钮。他们只会根据您屏幕上的内容生成实时洞察，而不是运行过程中隐藏的任何内容。他们也不会仅仅因为您的队友也在运行该应用程序并且可以看到他们而做诸如透露敌人位置之类的事情。想想“站在你的肩膀上的好球员”，而不是“墙上的黑客”。该公司表示，他们始终遵守每个游戏开发商的竞争公平准则，并且只使用经批准/提供的 API。这是一个好主意，因为它可以说是永远不会过时的。他们支持的每款新游戏都会为新的潜在受众提供服务。与此同时，旧游戏/见解似乎不会过期——游戏的大书你需要知道的东西往往只会随着游戏年龄的增长和补丁的堆积而变得更大和更复杂。有些游戏我已经玩了很多年了，我仍然喜欢语音助手说“哦，嘿，你刚拿起枪的后坐力自上次玩以来变得更加强烈。” SenpAI.GG 还没有出现，但有很大的自然增长空间。 Yilmazcoban 告诉我，他们目前有超过 400,000 名活跃用户，有一个由 11 人组成的团队在努力。基本应用程序是免费的，并计划以每月几美元的价格提供高级功能。", "note_en": "Could an AI-driven voice in your ear help close that gap, if only a bit?  SenpAI.GG, a company out of Y Combinator’s latest batch, thinks so.\n Much of that aforementioned gap boils down to practice, muscle memory and — let’s face it — natural ability. But as a game gets older/bigger/more complex, the best players tend to have a wealth of one resource that’s oh-so-crucial, if not oh-so-fun to gather: information.\n Which guns do the most damage at this range? Which character is best suited to counter that character on this map? Hell, what changed in that “minor update” that flashed across your screen as you were booting up the game? Wait, why is my favorite weapon suddenly so much harder to control?\n Staying on top of all this information as players discover new tactics and updates shift the “meta” is a challenge in its own right. It usually involves lots of Twitch streams, lots of digging around Reddit threads and lots of poring over patch notes.\n SenpAI.GG is looking to surface more of that information automatically and help new players get good, faster. Their desktop client presents you with information it thinks can help, post-game analysis on your strategies, plus in-game audio cues for the things you might not be great at tracking yet.\n It currently supports a handful of games — League of Legends, Valorant and Teamfight Tactics — with the info it provides varying from game to game. In LoL, for example, it’ll look at both teams’ selected champions and try to recommend the one you could pick to help most; in Valorant, meanwhile, it can give you an audio heads-up that one of your teammates is running low on health ( before said teammate starts yelling at you to heal them), when you’ve forgotten to reload or how long you’ve got before the Spike (read: game-ending bomb) explodes.\n   Just as important as the information it provides is the information it  won’t provide. In my chat with him, SenpAI.GG founder Olcay Yilmazcoban seemed very aware that there’s a hard-to-define line here where “assistant” blurs into “cheating tool” — but the company follows certain rules to stay on the right side of things and prevent their players from getting banned.\n They won’t, for example, ever take action on a player’s behalf — they might fire an audio cue to say “hey, you should heal that teammate,” but they won’t press the button for you. They’ll only generate their real-time insights from what’s on  your screen — not anything hidden within the running process. They also won’t do things like reveal an enemy’s location just because your teammate is also running the app and can see them. Think “good player standing over your shoulder,” not “wall hack.” The company says that they’re always within each game developer’s competitive fairness guidelines, and only work with approved/provided APIs.\n It’s a good idea because it’s one that, arguably, never gets old. With each new game they support, they’ve got a new potential audience to serve. Meanwhile, it’s not as if the old games/insights will expire — a game’s big ol’ book-of-stuff-you-need-to-know tends to only get bigger and more complex as a game ages and the patches pile up. There are games I’ve been playing for  years where I’d still love a voice assistant that says “Oh hey, the recoil on the gun you just picked up has gotten way more intense since the last time you played.” SenpAI.GG isn’t there yet, but there’s a ton of natural room for growth.\n Yilmazcoban tells me that they currently have over 400,000 active users, with a team of 11 people working on it. The base app is free, with plans to offer advanced features for a couple bucks a month.", "posttime": "2021-08-07 03:32:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,游戏,ai", "title": "SenpAI.GG 想成为你的人工智能视频游戏教练", "title_en": "\n\t\t\t\tSenpAI.GG wants to be your AI-powered video game coach\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/senpai-gg-wants-to-be-your-ai-powered-video-game-coach/", "via": "", "real_tags": ["人工智能", "游戏", "ai"]}, {"category": "", "categoryclass": "", "imagename": "1ed3ddd9272f13d0d927b620993f4846.jpg", "infoid": 1071845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "天基太阳能项目至少从 2013 年开始就一直在进行，当时唐纳德和布伦的第一笔捐款通过了。唐纳德·布伦 (Donald Bren) 是尔湾公司 (Irvine Company) 的董事长和加州理工学院董事会成员，在《大众科学》(Popular Science) 中听说了太空太阳能的想法后，他提议资助该大学的一个研究项目——从那时起，他已经捐赠了超过 1 亿美元为目的。直到本周加州理工学院将其公开时，资金来源一直保持匿名。这个想法是从当前可再生能源的局限性中自然产生的。太阳能在地表上无处不在，但当然高度依赖于天气、季节和一天中的时间。没有太阳能电池板，即使在理想情况下，也不能一直满负荷工作，因此问题就变成了在智能电网中传输和存储能量的问题。地球上没有太阳能电池板，就是这样。然而，在轨道上的太阳能电池板可能几乎一直都暴露在太阳的全部光线下，并且不会因为光线穿过行星的保护性大气层和磁层而降低其功率。 SSPP 研究员 Harry Atwater 在加州理工学院发布的新闻稿中说：“这个雄心勃勃的项目是为地球收集大规模太阳能的一种变革性方法，它克服了这种间歇性和储能需求。”当然，您首先需要收集足够的能量，这是值得做的，并且您需要一种方法将能量向下发射到表面，同时不会将大部分能量损失到上述保护层中不会煎炸任何经过其路径的东西。这些基本问题在过去十年中得到了系统的研究，团队很清楚，如果没有 Bren 的支持，这个项目是不可能实现的。试图在争取资助和轮换研究生的同时完成这项工作可能根本无法完成，但稳定的资金意味着他们可以聘请长期研究人员并克服可能阻碍他们前进的早期障碍。该小组已经制作了数十项已发表的研究和原型（您可以在此处仔细阅读），包括一个数量级制造的最轻的太阳能收集器-发射器，现在即将发射其第一颗天基测试卫星。\n“[Launch] 目前预计将在 2023 年第一季度，”该项目的联合主管 Ali Hajimiri 告诉 TechCrunch。 “它涉及几个用于空间验证工作的关键技术的演示者，即远距离无线电力传输、轻量级柔性光伏和灵活的可部署空间结构。”这些将是小规模的测试（大约 6 英尺宽），但愿景是更大的。事实上，它比目前太空中的任何东西都大。 Hajimiri 说：“最终的系统预计由多个可部署的模块组成，以紧密编队飞行并相互同步运行。” “每个模块的侧面都有几十米，随着时间的推移，可以通过添加更多模块来构建系统。”最终，这个概念需要一个可能大到 5-6 公里的结构。别担心——它离地球足够远，你不会看到一个巨大的六边形挡住星星。电力将使用定向的、可控的微波传输发送到地表的接收器。其中一些在轨道上可以全时向地球上的任何位置发射能量。当然，这是远景，如果要实现的话，还需要很多很多年。但是不要错误地认为这是有一个雄心勃勃的，甚至可以说是宏伟的目标。对这一想法的追求在太阳能电池、灵活的太空结构和无线电能传输方面取得了进展，每一项都可以应用于其他领域。愿景可能是科幻小说中的东西，但科学正在以一种非常扎实的方式进步。就他而言，布伦似乎很高兴能够将球推进到他认为可能根本不会尝试的重要任务上。 “多年来，我一直是一名研究太空太阳能可能应用的学生，”他告诉加州理工学院。 “我对支持加州理工学院世界级科学家的兴趣源于我相信利用太阳的自然力量造福所有人。”", "note_en": "The Space-based Solar Power Project has been underway since at least 2013, when the first donation from Donald and Brigitte Bren came through. Donald Bren is the chairman of Irvine Company and on the Caltech board of trustees, and after hearing about the idea of space-based solar in Popular Science, he proposed to fund a research project at the university — and since then has given over $100M for the purpose. The source of the funds has been kept anonymous until this week,  when Caltech made it public.\n The idea emerges naturally from the current limitations of renewable energy. Solar power is ubiquitous on the surface, but of course highly dependent on the weather, season, and time of day. No solar panel, even in ideal circumstances, can work at full capacity all the time, and so the problem becomes one of transferring and storing energy in a smart grid. No solar panel  on Earth, that is.\n A solar panel in orbit, however, may be exposed to the full light of the sun nearly all the time, and with none of the reduction in its power that comes from that light passing through the planet’s protective atmosphere and magnetosphere.\n  “This ambitious project is a transformative approach to large-scale solar energy harvesting for the Earth that overcomes this intermittency and the need for energy storage,” said SSPP researcher Harry Atwater in the Caltech release.\n Of course, you would need to collect enough energy that it’s worth doing in the first place, and you need a way to beam that energy down to the surface in a way that doesn’t lose most of it to the aforementioned protective layers but also doesn’t fry anything passing through its path.\n  These fundamental questions have been looked at systematically for the last decade, and the team is clear that without Bren’s support, this project wouldn’t have been possible. Attempting to do the work while scrounging for grants and rotating through grad students might have prevented its being done at all, but the steady funding meant they could hire long-term researchers and overcome early obstacles that might have stymied them otherwise.\n The group has produced dozens of published studies and prototypes (which you can peruse  here), including the lightest solar collector-transmitter made by an order of magnitude, and is now on the verge of launching its first space-based test satellite.\n “[Launch] is currently expected to be Q1 2023,” co-director of the project Ali Hajimiri told TechCrunch. “It involves several demonstrators for space verification of key technologies involved in the effort, namely, wireless power transfer at distance, lightweight flexible photovoltaics, and flexible deployable space structures.”\n  These will be small-scale tests (about 6 feet across), but the vision is for something rather larger. Bigger than anything currently in space, in fact.\n “The final system is envisioned to consist of multiple deployable modules in close formation flight and operating in synchronization with one another,” Hajimiri said. “Each module is several tens of meters on the side and the system can be build up by adding more modules over time.”\n  Eventually the concept calls for a structure perhaps as large as 5-6 kilometers across. Don’t worry — it would be far enough out from Earth that you wouldn’t see a giant hexagon blocking out the stars. Power would be sent to receivers on the surface using directed, steerable microwave transmission. A few of these in orbit could beam power to any location on the planet full time.\n Of course that is the vision, which is many, many years out if it is to take place at all. But don’t make the mistake of thinking of this as having that single ambitious, one might even say grandiose goal. The pursuit of this idea has produced advances in  solar cells, flexible space-based structures, and  wireless power transfer, each of which can be applied in other areas. The vision may be the stuff of science fiction, but the science is progressing in a very grounded way.\n For his part, Bren seems to be happy just to advance the ball on what he considers an important task that might not otherwise have been attempted at all.\n “I have been a student researching the possible applications of space-based solar energy for many years,” he told Caltech. “My interest in supporting the world-class scientists at Caltech is driven by my belief in harnessing the natural power of the sun for the benefit of everyone.”", "posttime": "2021-08-07 03:32:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "计划,power,可能", "title": "1 亿美元的捐款为长达十年的登月计划提供动力，以制造向地球发射能量的太阳能卫星", "title_en": "\n\t\t\t\t$100M donation powers decade-long moonshot to create solar satellites that beam power to Earth\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/100m-donation-powers-decade-long-moonshot-to-create-solar-satellites-that-beam-power-to-earth/", "via": "", "real_tags": ["计划", "power", "可能"]}, {"category": "", "categoryclass": "", "imagename": "9014f9e9ec0c2722d70f334a20334d20.jpg", "infoid": 1071844, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国证券交易委员会周五首次对去中心化金融行业提出指控，指控两人在未注册的发行中非法出售超过 3000 万美元的证券。美国证券交易委员会周五的命令发现，Blockchain Credit Partners 公司的两名高管使用以太坊区块链向投资者出售加密货币，同时在公司盈利能力方面误导他们。具体来说，投资者使用以太币等数字资产购买加密货币。该公司随后承诺向投资者支付超过 6% 的利息，并将这些资金用于汽车贷款等实物投资，以创造额外收入。美国证券交易委员会确定这些“真实世界”的投资不会产生广告中的收入。 “完整和诚实的披露仍然是我们证券法的基石——无论使用什么技术来提供和销售这些证券，”美国证券交易委员会执法部门主管古比尔 S.格鲁瓦尔周五在一份声明中表示。 “这使投资者能够做出明智的决定，并防止发行人在业务运营方面误导公众。”周五对该公司提出指控之际，联邦政府正准备为去中心化金融和加密货币市场发布新规定。本周早些时候，SEC 主席 Gary Gensler 呼吁国会授予该机构更多监管加密货币、贷款和平台的权力。 “如果我们不解决这些问题，我担心很多人会受到伤害，”Gensler 周二表示。迄今为止，国会未能在加密货币市场赋予美国证券交易委员会更多权力，本周选择在两党基础设施​​方案中纳入重点关注数字资产税收的措辞。周日，参议院谈判代表达成了一项 1 万亿美元的基础设施协议，其中包括要求加密货币经纪人在其纳税申报表上报告交易的条款。但“经纪人”的定义含糊不清，可能会使矿工面临更高的税收。目前尚不清楚加密货币在新基础设施法案下的表现如何。参议院有双重修正案希望澄清语言。由 Sens. Ron Wyden (D-OR)、Cynthia Lummis (R-WY) 和 Pat Toomey (R-PA) 撰写的修正案将豁免矿工。参议员马克华纳 (D-VA) 的另一项修正案在立法者中越来越受欢迎，但加密货币倡导者担心，它会通过制定不均衡的报告要求来损害行业。", "note_en": "The Securities and Exchange Commission issued  its first charges against the decentralized finance industry Friday, accusing two people of illegally selling over $30 million of securities in unregistered offerings.\n The SEC’s Friday order found that two executives from the Blockchain Credit Partners company used the Ethereum blockchain to sell cryptocurrencies to investors while misleading them about the company’s profitability. Specifically, investors purchased cryptocurrencies using digital assets like ether. The company then promised to pay investors over 6 percent in interest and that the funds would go toward physical investments like car loans to create additional income. The SEC determined that these “real-world” investments wouldn’t generate the income advertised.\n  “Full and honest disclosure remains the cornerstone of our securities laws – no matter what technologies are used to offer and sell those securities,” Gurbir S. Grewal, SEC Enforcement Division director, said in a statement Friday. “This allows investors to make informed decisions and prevents issuers from misleading the public about business operations.”\n Friday’s charges against the company come as the federal government is preparing to issue new regulations for the decentralized finance and cryptocurrency markets. Earlier this week, SEC Chair Gary Gensler  called on Congress to grant the agency more authority in regulating cryptocurrency, lending, and platforms.\n “If we don’t address these issues, I worry a lot of people will be hurt,” Gensler said on Tuesday.\n Congress has so far failed to give the SEC more authority in the cryptocurrency market, opting this week to include language in the bipartisan infrastructure package focusing on taxation of digital assets. On Sunday, Senate negotiators reached a $1 trillion infrastructure deal, including language that would require cryptocurrency brokers to report transactions on their tax returns. But the definition of “broker” was vague and could potentially open miners up to greater taxation.\n It’s unclear  how cryptocurrency will fare under the new infrastructure bill. There are dual amendments in the Senate looking to clarify the language. An amendment authored by Sens. Ron Wyden (D-OR), Cynthia Lummis (R-WY), and Pat Toomey (R-PA) would exempt miners. Another amendment from Sen. Mark Warner (D-VA) has gained more popularity amongst lawmakers, but cryptocurrency advocates fear it would hurt the industry by creating uneven reporting requirements.", "posttime": "2021-08-07 03:22:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "指控,charges,加密", "title": "SEC 指控 Blockchain Credit Partners 涉嫌非法出售 3000 万美元的未注册证券，这是 SEC 首次对去中心化金融行业提出指控", "title_en": "SEC charges Blockchain Credit Partners for alleged illegal sales of $30M in unregistered securities, first SEC charges related to decentralized finance industry", "transed": 1, "url": "https://www.theverge.com/2021/8/6/22613195/sec-cryptocurrency-blockchain-gensler-charge-illegal-fraud-tokens?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["指控", "charges", "加密"]}, {"category": "", "categoryclass": "", "imagename": "f5e68c89e2924af9599aecef0b63b4fd.png", "infoid": 1071843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在阅读 Yan Zhu 关于她在 OkCupid 中发现的 JSON CSRF 漏洞的优秀文章时，一件事让我感到困惑：我的印象是，现在的浏览器默认将 cookie 视为 SameSite=Lax，所以我希望像 Yan 描述的那样进行攻击不适用于现代浏览器。这让我陷入了探索 SameSite 实际工作方式的困境，包括在此过程中构建交互式 SameSite cookie 探索工具。这是我学到的。快速回顾：假设您的应用程序中有一个页面允许用户删除其帐户，网址为 https://www.example.com/delete-my-account。用户必须使用 cookie 登录才能激活该功能。如果您创建该页面来响应 GET 请求，我作为一个邪恶的人可以在 https://www.evil.com/force-you-to-delete-your-account 上创建一个页面来执行以下操作：如果我能得到你访问我的页面，我可以强制你删除你的账号！但是您比这更聪明，并且您知道 GET 请求应该是幂等的。您实现端点以要求 POST 请求。事实证明，如果我可以诱使用户访问带有以下恶意 HTML 的页面，我仍然可以强制删除帐户：\nCSRF 是一个极其常见和令人讨厌的漏洞——特别是因为它默认是一个漏洞：如果你不知道 CSRF 是什么，你的应用程序中可能就有它。传统上，解决方案是使用 CSRF 令牌——隐藏的表单字段，它们“证明”用户来自您自己网站上的表单，而不是托管在其他地方的表单。 OWASP 将此称为双重提交 Cookie 模式。 Django 等 Web 框架为您实现 CSRF 保护。我构建了 asgi-csrf 来帮助向 ASGI 应用程序添加 CSRF 令牌保护。显然，如果我们根本不必担心 CSRF 会更好。据我所知，从 2016 年 6 月开始指定 SameSite cookie 属性的工作。这个想法是向 cookie 添加一个额外的属性，指定是否应该将它们包含在从托管在另一个域上的页面向域发出的请求中领域。 SameSite=None——cookie 在“所有上下文”中发送——或多或少是在 SameSite 被发明之前的工作方式。 SameSite=Strict — 仅针对源自同一域的请求发送 cookie。即使从站外链接到达站点也不会看到 cookie，除非您随后刷新页面或在站点内导航。\nSameSite=Lax — 如果您通过跟随来自另一个域的链接导航到该站点，则会发送 cookie，但如果您提交表单，则不会发送 cookie。这通常是您想要防止 CSRF 攻击的内容！该属性由服务器在 set-cookie 标头中指定，如下所示： 为什么不习惯性地使用 SameSite=Strict？因为如果有人点击您网站的链接，他们的第一个请求将被视为他们根本没有登录。那很糟！因此，使用 SameSite=Lax 显式设置 cookie 应该足以保护您的应用程序免受 CSRF 漏洞的影响……前提是您的用户拥有支持它的浏览器。 （我可以使用报告 93.95% 的属性的全球支持 - 不足以让我停止习惯性地使用 CSRF 令牌，但我们正在到达那里。）这就是事情变得有趣的地方。如果设置的 cookie 完全没有 SameSite 属性，浏览器应该如何处理？在过去的一年里，所有主要浏览器都在改变它们的默认行为。目标是将缺失的 SameSite 属性视为 SameSite=Lax——默认提供 CSRF 保护。\n我发现很难追踪是否以及何时进行了这种更改：Chrome/Chromium 提供了最好的文档——他们声称已在 2020 年 8 月将新的默认值提高到 100% 的用户。Android 中的 WebViews 仍然具有旧的默认行为，计划在 Android 12（尚未发布）中修复。 Firefox 有一个自 2020 年 8 月起的博客条目，上面写着“从 Firefox 79（2020 年 6 月）开始，我们将其推广到 50% 的 Firefox Beta 用户群”——但我找不到任何后续更新。我启动了一个 Twitter 线程来尝试收集更多信息，所以如果你知道发生了什么更详细的情况，请在那里回复。假设以上所有，谜团仍然存在：Yan 的漏洞如何未能被浏览器阻止？在 Twitter 上反复讨论之后，Yan 提出答案可能就是这个细节，隐藏在功能的 Chrome 平台状态页面上：Cookies 默认为 SameSite=Lax。注意：Chrome 将对不到 2 分钟前没有 SameSite 属性的 cookie 设置例外。尽管正常的 SameSite=Lax cookie 要求顶级跨站点请求具有安全（例如 GET）HTTP 方法，但此类 cookie 也将与非幂等（例如 POST）顶级跨站点请求一起发送。未来将取消对这种干预（“Lax + POST”）的支持。\n看起来 OkCupid 正在设置他们的身份验证 cookie 没有 SameSite 属性......这让他们受到基于表单的 CSRF 攻击，但仅在设置 cookie 后的 120 秒内！服务器端 Python (Starlette) Web 应用程序，用于设置具有不同 SameSite 属性的 cookie。这是托管在 Vercel 上的 https://samesite-lax-demo.vercel.app/ 不同域上的 HTML 页面，链接到该 cookie 站点，提供针对它的 POST 表单，从中嵌入图像并执行一些获取() 请求反对它。这是在 https://simonw.github.io/samesite-lax-demo/ 托管在两个不同的域上对于该工具显示正在发生的事情至关重要。我选择了 Vercel 和 GitHub Pages，因为它们都可以轻松设置以从 GitHub 存储库持续部署更改。在不同浏览器中使用该工具有助于准确显示跨域 cookie 的情况。 SameSite=Strict 像您期望的那样工作。遵循从静态站点到应用程序的常规 &lt;a href=...&gt; 链接并查看严格 cookie 在到达时如何不可见 — 但在您刷新该页面时变得可见，这一点特别有趣。我在 &lt;img src=&quot;/cookies.svg&quot;&gt; 图像标签中包含了一个动态生成的 SVG，它显示了对请求可见的 cookie（使用 SVG &lt;text&gt;）。该图像显示了嵌入 Vercel 域时的所有四种类型的 cookie，但是当嵌入 GitHub pages 域时，它就大不相同了：\n如果不包含 Secure 属性，Chrome 将不允许您设置 SameSite=None cookie。我还添加了一些 JavaScript，可以对 /cookies.json 端点进行跨域 fetch(..., {credentials: &quot;include&quot;}) 调用。在我添加服务器端标头 access-control-allow-origin: https://simonw.github.io 和 access-control-allow-credentials: true 之前，这根本没有发送任何 cookie。完成后，我在三个浏览器中得到了与上述 &lt;img 测试相同的结果。 Safari 忽略 SameSite=None 原来是这个错误：SameSite=None 或 SameSite=invalid 的 Cookie 被视为严格 - 它被标记为已修复但我不确定修复是否已经发布 - 它似乎没有被修复在我的 macOS 10.15.6 笔记本电脑或我的 iOS 14.7.1 iPhone 上。最令人兴奋的是，我能够使用该工具复制 Chrome 两分钟窗口错误！每个 cookie 的值都设置为创建时的时间戳，我添加了代码来显示 cookie 是在多少秒前设置的。这是一个动画，展示了表单提交导航上的 Chrome 如何看到在 114 秒前设置为 SameSite 的 cookie，但该 cookie 在 120 秒后不再可见。关于 CSRF，您应该考虑的最后一个注意事项：SameSite=Lax 仍然允许来自主域子域的表单提交携带其 cookie。这意味着，如果您的子域之一存在 XSS 漏洞，则主域的安全性将受到威胁。由于子域托管其他可能有自己安全问题的应用程序是很常见的，因此为 Lax cookie 放弃 CSRF 令牌可能不是一个明智的步骤！\n作为应用程序开发人员，您应该使用 SameSite=Lax 设置所有 cookie，除非您有很好的理由不这样做。大多数 Web 框架现在默认执行此操作 - Django 在 2018 年 8 月在 Django 2.1 中提供了对此的支持。您还需要 CSRF 令牌吗？我是这样认为的：我不喜欢启动旧浏览器（可能借用过时的计算机）的用户容易受到这种攻击的想法，我担心上述子域问题。如果您为浏览器供应商工作，请更轻松地找到有关默认行为是什么以及何时发布的信息！", "note_en": "In reading Yan Zhu’s excellent write-up of the  JSON CSRF vulnerability she found in OkCupid one thing puzzled me: I was under the impression that browsers these days default to treating cookies as  SameSite=Lax, so I would expect attacks like the one Yan described not to work in modern browsers.\n This lead me down a rabbit hole of exploring how SameSite actually works, including building  an interactive SameSite cookie exploration tool along the way. Here’s what I learned.\n   A quick review: let’s say you have a page in your application that allows a user to delete their account, at  https://www.example.com/delete-my-account. The user has to be signed in with a cookie in order to activate that feature.\n If you created that page to respond to  GET requests, I as an evil person could create a page at  https://www.evil.com/force-you-to-delete-your-account that does this:\n  If I can get you to visit my page, I can force you to delete your account!\n But you’re smarter than that, and you know that GET requests should be idempotent. You implement your endpoint to require a POST request instead.\n Turns out I can still force-delete accounts, if I can trick a user into visiting a page with the following evil HTML on it:\n   CSRF is an extremely common and nasty vulnerability—especially since it’s a hole by default: if you don’t know what CSRF is, you likely have it in your application.\n Traditionally the solution has been to use CSRF tokens—hidden form fields which “prove” that the user came from a form on your own site, and not a form hosted somewhere else. OWASP call this the  Double Submit Cookie pattern.\n Web frameworks like Django implement  CSRF protection for you. I built  asgi-csrf to help add CSRF token protection to ASGI applications.\n  Clearly it would be better if we didn’t have to worry about CSRF at all.\n As far as I can tell, work on specifying the  SameSite cookie attribute started  in June 2016. The idea was to add an additional attribute to cookies that specifies the policy for if they should be included in requests made to a domain from pages hosted on another domain.\n  SameSite=None—the cookie is sent in “all contexts”—more-or-less how things used to work before SameSite was invented.\n SameSite=Strict—the cookie is only sent for requests that originate on the same domain. Even arriving on the site from an off-site link will not see the cookie, unless you subsequently refresh the page or navigate within the site.\n SameSite=Lax—cookie is sent if you navigate to the site through following a link from another domain but  not if you submit a form. This is generally what you want to protect against CSRF attacks!\n The attribute is specified by the server in a  set-cookie header that looks like this:\n  Why not habitually use  SameSite=Strict? Because then if someone follows a link to your site their first request will be treated as if they are not signed in at all. That’s bad!\n So explicitly setting a cookie with  SameSite=Lax should be enough to protect your application from CSRF vulnerabilities... provided your users have a browser that supports it.\n (Can I Use reports  93.95% global support for the attribute—not quite high enough for me to stop habitually using CSRF tokens, but we’re getting there.)\n  Here’s where things get interesting. If a cookie is set without a SameSite attribute at all, how should the browser treat it?\n Over the past year, all of the major browsers have been changing their default behaviour. The goal is for a missing SameSite attribute to be treated as if it was  SameSite=Lax—providing CSRF protection by default.\n I have found it infuriatingly difficult to track down if and when this change has been made:\n Chrome/Chromium offer  the best documentation—they claim to have ramped up the new default to 100% of users in August 2020. WebViews in Android still have the old default behaviour, which is scheduled to be fixed in Android 12 ( not yet released).\n Firefox have a  blog entry from August 2020 which says “Starting with Firefox 79 (June 2020), we rolled it out to 50% of the Firefox Beta user base”—but I’ve not been able to find any subsequent updates.\n I started  a Twitter thread to try and collect more information, so please reply there if you know what’s going on in more detail.\n  Assuming all of the above, the mystery remained: how did Yan’s exploit fail to be prevented by browsers?\n After some back-and-forth about this on Twitter  Yan proposed that the answer may be this detail, tucked away on the  Chrome Platform Status page for Feature: Cookies default to SameSite=Lax.\n Note: Chrome will make an exception for cookies set without a SameSite attribute less than 2 minutes ago. Such cookies will also be sent with non-idempotent (e.g. POST) top-level cross-site requests despite normal SameSite=Lax cookies requiring top-level cross-site requests to have a safe (e.g. GET) HTTP method. Support for this intervention (“Lax + POST”) will be removed in the future.\n It looks like OkCupid were setting their authentication cookie without a  SameSite attribute... which opened them up to a form-based CSRF attack but only for the 120 seconds following the cookie being set!\n     A server-side Python ( Starlette) web application for setting cookies with different  SameSite attributes. This is hosted on Vercel at  https://samesite-lax-demo.vercel.app/\n An HTML page on a different domain that links to that cookied site, provides a POST form targetting it, embeds an image from it and executes some  fetch() requests against it. This is at  https://simonw.github.io/samesite-lax-demo/\n Hosting on two separate domains is critical for the tool to show what is going on. I chose Vercel and GitHub Pages because they are both trivial to set up to continuously deploy changes from a GitHub repository.\n Using the tool in different browsers helps show exactly what is going on with regards to cross-domain cookies.\n  SameSite=Strict works as you would expect. It’s particularly interesting to follow the regular  &lt;a href=...&gt; link from the static site to the application and see how the strict cookie is NOT visible upon arrival—but becomes visible when you refresh that page.\n I included a dynamically generated SVG in a  &lt;img src=&#34;/cookies.svg&#34;&gt; image tag, which shows the cookies (using SVG  &lt;text&gt;) that are visible to the request. That image shows all four types of cookie when embedded on the Vercel domain, but when embedded on the GitHub pages domain it differs wildly:\n Chrome won’t let you set a  SameSite=None cookie without including the  Secure attribute.\n I also added some JavaScript that makes a cross-domain  fetch(..., {credentials: &#34;include&#34;}) call against a  /cookies.json endpoint. This didn’t send any cookies at all until I added server-side headers  access-control-allow-origin: https://simonw.github.io and  access-control-allow-credentials: true. Having done that, I got the same results across the three browsers as for the  &lt;img test described above.\n Safari ignoring  SameSite=None turns out to be this bug:  Cookies with SameSite=None or SameSite=invalid treated as Strict—it’s marked as fixed but I’m not certain the fix has been released yet—it doesn’t seem to be fixed on my macOS 10.15.6 laptop or my iOS 14.7.1 iPhone.\n Most excitingly, I was able to replicate the Chrome two minute window bug using the tool! Each cookie has its value set to the timestamp when it was created, and I added code to display how many seconds ago the cookie was set. Here’s an animation showing how Chrome on a form submission navigation can see the cookie that was set with  SameSite missing at 114 seconds old, but that cookie is no longer visible once it passes 120 seconds.\n   One last note about CSRF that you should consider:  SameSite=Lax still allows form submissions from subdomains of your primary domain to carry their cookies.\n This means that if you have a XSS vulnerability on one of your subdomains the security of your primary domain will be compromised.\n Since it’s common for subdomains to host other applications that may have their own security concerns, ditching CSRF tokens for Lax cookies may not be a wise step!\n  As an application developer, you should set all cookies with  SameSite=Lax unless you have a very good reason not to. Most web frameworks do this by default now—Django shipped  support for this in  Django 2.1 in August 2018.\n Do you still need CSRF tokens as well? I think so: I don’t like the idea of users who fire up an older browser (maybe borrowing an obsolete computer) being vulnerable to this attack, and I worry about the subdomain issue described above.\n And if you work for a browser vendor, please make it easier to find information on what the default behaviour is and when it was shipped!", "posttime": "2021-08-07 03:21:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "防止,samesite,cookie", "title": "探索防止 CSRF 的 SameSite cookie 属性", "title_en": "Exploring the SameSite cookie attribute for preventing CSRF", "transed": 1, "url": "https://simonwillison.net/2021/Aug/3/samesite/", "via": "", "real_tags": ["防止", "samesite", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "8431404693ecffa56c44f10a94da95c1.jpg", "infoid": 1071842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦，8 月 5 日（路透社）——一项科学研究周四表示，作为北半球气候引擎的大西洋当前系统可能正在减弱到这样的程度，它可能很快会给世界天气带来巨大变化。大西洋经向翻转环流 (AMOC) 是一个大型洋流系统，它将温暖的水从热带地区向北输送到北大西洋。随着温室气体排放增加导致大气变暖，下面的地表海洋保留了更多的热量。该系统的潜在崩溃可能对世界天气系统产生严重后果。气候模型显示，AMOC 处于 1000 多年来最弱的状态。然而，目前尚不清楚减弱是由于环流的变化还是与稳定性的丧失有关。 “动态稳定性的丧失意味着 AMOC 已接近其临界阈值，超过该阈值可能会发生实质性且实际上可能不可逆转地过渡到弱模式，”波茨坦气候影响研究所的 Niklas Boers 说，他也是该研究的作者。学习。通过分析大西洋的海面温度和盐度模式，该研究表明，上个世纪的减弱可能与稳定性的丧失有关。 “研究结果支持这样的评估，即 AMOC 下降不仅是对温度升高的波动或线性响应，而且可能意味着接近临界阈值，超过该临界阈值，循环系统可能会崩溃，”布尔斯说。\n英国气象局表示，如果 AMOC 崩溃，将导致北半球变冷、大西洋海平面上升、欧洲和北美降水总体下降以及南美和非洲季风转变。其他气候模型表示，AMOC 将在下个世纪减弱，但不太可能在 2100 年之前崩溃。", "note_en": "LONDON, Aug 5 (Reuters) - The Atlantic Ocean&#39;s current system, an engine of the Northern Hemsiphere&#39;s climate, could be weakening to such an extent that it could soon bring big changes to the world&#39;s weather, a scientific study said on Thursday.\n The Atlantic Meridional Overturning Circulation (AMOC) is a large system of ocean currents which transports warm water from the tropics northwards into the North Atlantic.\n As the atmosphere warms due to increased greenhouse gas emissions, the surface ocean beneath retains more of heat. A potential collapse of the system could have severe consequences for the world&#39;s weather systems.\n Climate models have shown that the AMOC is at its weakest in more than a 1,000 years. However, it has not been known whether the weakening is due to a change in circulation or it is to do with the loss of stability.\n  &#34;The loss of dynamical stability would imply that the AMOC has approached its critical threshold, beyond which a substantial and in practice likely irreversible transition to the weak mode could occur,&#34; said Niklas Boers at the Potstdam Insitute for Climate Impact Research and author of the study.\n By analysing the sea-surface temperature and salinity patterns of the Atlantic Ocean, the study said the weakening of the last century is likely to be associated with a loss of stability.\n &#34;The findings support the assessment that the AMOC decline is not just a fluctuation or a linear response to increasing temperatures but likely means the approaching of a critical threshold beyond which the circulation system could collapse,&#34; Boers said.\n If the AMOC collapsed, it would increase cooling of the Northern Hemisphere, sea level rise in the Atlantic, an overall fall in precipitation over Europe and North America and a shift in monsoons in South America and Afria, Britain&#39;s Met Office said.\n Other climate models have said the AMOC will weaken over the coming century but that a collapse before 2100 is unlikely.", "posttime": "2021-08-07 03:21:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变化,ocean,可能", "title": "大西洋洋流减弱，预示着巨大的天气变化：研究", "title_en": "Atlantic Ocean currents weaken, signalling big weather changes: study", "transed": 1, "url": "https://www.reuters.com/business/environment/atlantic-ocean-currents-weaken-signalling-big-weather-changes-study-2021-08-05/", "via": "", "real_tags": ["变化", "ocean", "可能"]}, {"category": "", "categoryclass": "", "imagename": "0092be219c8def9544850ff1ecbc53ea.jpeg", "infoid": 1071841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管有删节、化名和数千页未公开的页面，参议院情报委员会关于 9/11 后中央情报局酷刑的报告——即公众可以获得的执行摘要——是有史以来对任何部分进行的最有力的监督。反恐战争。该委员会通常为其名义上监督的机构和活动辩护；值得注意的是，酷刑调查揭示了中央情报局黑色网站内部的可怕现实。它精确而严谨地展示了中央情报局如何围绕其野蛮行为构建一个名为“强化审讯”的大谎言。但该委员会的首席调查员表示，他只能调查酷刑计划的三个组成部分中的两个。三是历史失传。中央情报局称为 RDI 计划，用于引渡、拘留和审讯。 “引渡”是外包的酷刑：中央情报局绑架某人并将其送交其本国安全机构进行虐待；或者，在“特别引渡”变体中，由第三国的安全机构实施。 “拘留”是中央情报局而非盟军情报机构关押人员的黑点的维护、后勤和直接行动。 “审讯”是中央情报局施加的酷刑。再现是程序的核心。它们是 9/11 事件中中央情报局酷刑的唯一方面。中央情报局反恐中心内的实体，即引渡小组，在 9/11 之后扩大成为 RDI 小组，或“RDG”。从一开始就参与 Renditions Group 的人之一 Mike Scheuer 多年前在一段被低估的视频中解释说：“9/11 之后，中央情报局是镇上唯一的游戏。布什白宫敦促中央情报局加快引渡计划。” （舒尔一直在旅途中。）然而，我们对 D 和 I 的了解比对 R 的了解要多得多。参议院的调查仅涉及中央情报局的拘留和审讯。在六年的调查中，中央情报局积极争取限制甚至是有限的任务。首席调查员丹尼尔·J·琼斯（Daniel J. Jones）表示，这不会允许参议院调查人员扩大其职权范围。 “一切都很繁重，”琼斯回忆道。即使该机构以某种方式允许他调查引渡，琼斯通过挖掘中央情报局提供的故意混淆和不完整的记录（有时随后消失）的经验使他得出结论，该机构自己的引渡记录可能远非广泛. “[中央情报局的拘留和审讯] 2002 年的记录很详细。随着 &#39;DI&#39; 计划的进行，我们看到的记录保存能力越来越差，”Jones 回忆道。 “可以想象，这也适用于演绎。”\n该计划的所有三个组成部分都联系在一起，因此琼斯偶尔会瞥见一瞥。关于什么是演绎的建议和线索。但不仅引渡超出了他的调查范围，他还不得不与令人发狂和艰苦的工作作斗争，弄清楚谁在和不在中央情报局的监管下，然后弄清楚当涉及到内部分类时，这种区分有多么有意义以及对人类的实际待遇。这很艰难。正式地说，参议院能够统计中央情报局在 2002 年至 2008 年期间在黑场中关押的至少 119 人。 “我们与该机构就谁是中央情报局被拘留者和谁不是中央情报局的被拘留者进行了反复讨论。该委员会达到 119，非常保守。参与这项调查的每个人都认为中央情报局被拘留者超过 119 人，”琼斯解释说。 “如果中央情报局不知道有多少人被自己关押，那么就不太可能对那些只是过客的人进行任何记录保存”——也就是说，在被迅速送往合作伙伴情报机构之前，在中央情报局短暂关押——“和那些没有被他们看管的人。 ... 信条和其他所有 [CIA] 主管都说 [酷刑计划] 是当时中央情报局的核心反恐计划。因为这是一个核心项目——而且非常敏感——所以认为中央情报局会保持强大的机密记录是合理的，”他继续说道。 “事实上，如果&#39;DI&#39;部分被中央情报局视为反恐战争的核心组成部分，那么就没有理由相信他们会在引渡计划中保持更好的记录。”首先，参议院情报委员会进行调查的唯一原因是该计划中的两名主要人物 Jose Rodriguez 和 Gina Haspel 销毁了在 9/11 后第一个黑人网站内对两名男子进行酷刑的录像带——这也引发了刑事调查。一旦参议院从《纽约时报》而不是从中央情报局获悉这些录像带被销毁，该委员会就不能再可信地拒绝开展自己的调查。其次，在大多数重要演讲和证词中，中央情报局局长乔治·特尼特、波特·戈斯和迈克尔·海登反复强调，他们的反恐战争是一项国际团队运动。他们经常这样做，以至于记者们很少费心去引用它。它看起来像样板。这通常是自私的，因为当他们引用与盟国情报部门合作的重要性作为永远不会透露合作做了什么的理由时。但他们是正确的，依靠各种 Mukhabarats 使他们的战争可行。 “我不能夸大这些关系对我们整体努力的重要性，”海登在 2007 年 9 月的一次典型露面中说道。没有引渡记录，即使是参议院的酷刑报告，也不再完全是新闻。我于 2016 年在《卫报》的这个 20,000 多个字、三部分的系列中报道了它。但从那以后一直困扰着我的是，这种缺席从未受到过多少关注和关心。在我们最近关于为死者命名的 Forever Wars 文章之后，我一直在思考越来越多的问题——我们对再现的历史知识的巨大差距；如果参议院的酷刑报告不能到达那里，那么我们可能不会填补这些空白；以及几乎没有人在乎的事实。\n我们知道一些关于再现的事情。特别是，我们知道中央情报局在转移囚犯时拍摄了他们的束缚裸体。那是引渡的文件——大概是为了提供证据，证明当中央情报局有他们时，可能最终死在外国酷刑室的人还活着。 2008 年，人权观察能够记录中央情报局向约旦人提供的 14 个人。其中一个叫阿布·哈姆扎·塔布基 (Abu Hamza al-Tabuki) 回忆说：“从第一天起，他们就开始用恐怖和恐惧、折磨和殴打、侮辱和辱骂的方法审问我，并威胁要暴露我的私处并强奸我。 .我和我的父母和家人一再遭到殴打和侮辱。”那些熟悉酷刑历史的人，特别是在战争背景下，会注意到其中的性酷刑是如何存在的。当美国在 2011 年帮助推翻穆阿迈尔·卡扎菲时，它无意中导致了锁定在卡扎菲内部安全机构办公室的文件的公开。这最终意外地暴露了中央情报局与利比亚的合作在实践中的样子。这真的不是一个愉快的阅读。中情局在意大利批准他庇护后在米兰绑架了阿布奥马尔的混乱历史也不是。在我 2016 年的 Guardian 文章中，我报告说再现是 RDI 的“最大”部分。琼斯提醒我，“我们实际上并不真正知道这一点，”很有帮助。很公平。我使用的是 2007 年欧洲议会的一项调查，该调查报告称：“在 2001 年底至 2005 年底期间，至少有 1,245 架由中央情报局运营的航班飞入欧洲领空或在欧洲机场中途停留，其中应添加一个未指明的数字出于相同目的的军事飞行； ……一方面，中央情报局的航班可能比临时委员会进行的调查所确认的要多，而另一方面，并​​非所有这些航班都被用于特别引渡。”注意最后一行。请注意欧盟如何承认其对欧洲共谋的调查可见度的局限性。欧盟调查人员能够记录四年内超过 1,200 次中央情报局飞往欧洲的航班。他们不能说每次飞行都是一次演绎渡轮，或者说每次飞行都等于一个人被渲染。他们可以说他们无法回答这个问题，并且作为后备，提供他们最好的证据，作为他们几乎无法触及的计划规模的代理，这要归功于几个政府的顽固。海登在 2007 年将这种不确定性武器化，以诋毁欧盟。他嘲笑说：“坦率地说，在这 1,245 次航班中，甚至有相当多的航班载有被拘留者的说法，坦率地说是荒谬的。”\n除了它一点也不荒谬。确实，海登可以独家访问中央情报局剩余的任何记录，因此他可以断言中央情报局的酷刑计划“仅针对最危险的恐怖分子和那些被认为拥有最有价值信息的人，例如计划中的知识攻击”从一个权威的位置。不幸的是，对于海登来说，舒尔说他在反恐中心时“进行了引渡”，但在 2008 年意外地反驳了他。回复寻求评论的消息）在当年伯克利的一次活动中回忆。 9/11之后，他告诉观众，“吧台下降了一点，我们开始接其他人。” （在这段视频中大约是 32:30。）引渡的捍卫者，包括海登，倾向于将引渡描述为合法，并得到其他国家人道待遇的保证。 Scheuer 是一位罕见的中央情报局官员，他公开承认这是胡说八道。 “在克林顿先生的领导下，我们将把他们从街上带走，并安排将他们送回希望他们进行司法程序的政府，”他在那次活动中说。我们回到白宫说：“这是我们计划要做的，你想让我们做吗？”是的，这就是答案。 “好吧，我们会把他们带到需要他们的国家，但是你们的国务院每年都会说‘那个国家是侵犯人权者’，或者它的司法程序不是我们想要的成为。”每个人都皱起眉头说，“哦，那可能是个问题。你能让这些国家说&#39;我们会根据自己的法律对待这些被渲染的人吗？&#39;”我们说，“是的，我们很确定 X 国会根据 [他们自己的法律] 对待他们——这赢了不让你摆脱困境！”但也就到此为止了。现在，克林顿总统和 [国家安全顾问桑迪] 伯杰表示，他们坚持保证这些囚犯将按照美国标准或国际法受到对待。现在，我在那里。我进行了操作。这从来不是我所知道的要求。这完全是对所做事情的事后辩护。海登有撒谎的记录。当琼斯能够检查中央情报局拘留和审讯的记录时，他看到海登和中央情报局的其他人在多大程度上操纵了真相。参议院情报报告的整个附件揭穿了海登在仅一天的证词中就中央情报局遭受酷刑的一系列谎言。 （附录 3，从报告第 462 页开始。）这还没有结束：请参阅《恐怖统治》，周二发布。 （另外，我有一个关于海登出现在我乐队的一场演出中的故事；我可能会为订阅者写这篇文章，所以请订阅。）在这篇文章中向上滚动到琼斯的引述，关于如何有一个“背和-forth”关于该机构将哪些人算作被拘留者的问题，促使参议院采取保守的行动，在黑场统计了 119 名男子。海登在 2007 年声称黑场囚犯的人数“不到 100 人”。当回顾海登在同一次演讲中的断言时，所有这一切都特别明显，“演绎的数量实际上是一个更小的数字，中间两个数字。”\n我们缺乏，而且我们可能永远缺乏的是对演绎的系统理解，非凡的和（叹息）“普通”。参议院情报委员会的报告产生于一个独特的机会和一系列历史环境。也不会再来。琼斯为历史做出了非凡的贡献。我写这些并不是为了指责他无法发掘引渡计划——除了教会和派克委员会之外，没有人做得更多，迫使中央情报局真正透明。 “在资源有限的世界里，我们有两个选择：尝试完全详细说明所有的演绎；或详细说明美国拘留的&#39;D和我&#39;，”琼斯说。 “这仍然是正确的决定，但它做出了错误的假设，即国会只能拥有最少的调查资源。从本质上讲，我们决定生活在这个监管有限的世界里。”该死。坐下这句话。琼斯指的是对真相的无后果抹杀。受害者身上的印记是酷刑的真实尺度，尤其是当我们相信每个人都有内在的价值和尊严时。官方否认该标志是由未知数量的人聚集而成的，不再是单独针对他们的犯罪，而是对历史的犯罪。直接参与标记和否认的人之一，在知道这两者之后，升任中央情报局局长，获得两党一致好评。现在，她的支持者之一是国家情报总监。另一个是参议院情报委员会的主席。 “监督机制和行政部门允许不当和非法行为发生而不会产生后果，”琼斯说。 “从来没有任何责任。没有皮带。它只是未剪辑。在如此宽松的监管环境下，他们为什么会认为他们需要记录？”", "note_en": "DESPITE THE REDACTIONS, the pseudonyms, and the thousands of unreleased pages, the Senate intelligence committee’s report into post-9/11 CIA torture – that is,  the executive summary available to the public – is the most robust oversight ever conducted of any part of the War on Terror. The committee typically defends the agencies and activities it nominally oversees; remarkably, the torture investigation revealed the gruesome realities inside the CIA’s black sites. It demonstrated, with precision and rigor, how the CIA constructed a Big Lie, called “Enhanced Interrogation,” around its barbarism.\n But the committee’s lead investigator says that he could only investigate two of the three components of the torture program. The third is lost to history.\n   THE CIA CALLED THE PROGRAM RDI, for  Renditions, Detentions and Interrogations. “Renditions” are outsourced torture: the CIA abducts someone and sends them to be abused either by their home country’s security apparatus; or, in the “extraordinary rendition” variant, by a third country’s security apparatus. “Detentions” were the maintenance, logistics and direct operations of the black sites where the CIA, not an allied intelligence service, imprisoned people. “Interrogations” were the torture the CIA inflicted.\n Renditions were the kernel of the program. They were the only aspect of CIA torture in operation on 9/11. The entity within the CIA Counterterrorism Center that conducted it, the Renditions Group, expanded after 9/11 to become the RDI Group, or “ RDG.” One of the people involved in the Renditions Group from inception, Mike Scheuer, explained many years ago in an underappreciated  video, “After 9/11, the CIA was the only game in town. The Bush White House pushed on the CIA to accelerate the rendition program.” (Scheuer has been on a  journey.)\n Yet we know vastly more about the  D and the  I than we know about the  R. The Senate’s investigation solely concerned the CIA’s detentions and interrogations. Over the six years of the investigation, the CIA fought aggressively to restrict even that constrained mandate. It was not going to allow Senate investigators to  expand their remit, according to Daniel J. Jones, the lead investigator. “ Everything was a heavy lift,” Jones remembers.\n And even if the agency somehow  had allowed him to investigate renditions, Jones’ experience of digging through deliberately confusing and incomplete records that the CIA provided – and sometimes subsequently disappeared – leads him to the conclusion that the agency’s own renditions records are likely far from extensive.\n “The [CIA’s detention and interrogation] records in 2002 are detailed. As the ‘DI’ program went on, we saw less and less robust record-keeping,” Jones recalls. “One could imagine that also applied to rendition.”\n All three components of the program were tied together, and so occasionally Jones saw glimpses; suggestions and clues to what rendition was. But not only was rendition beyond the scope of his investigation, he already had to contend with the maddening and painstaking work of figuring out who was and was not in CIA custody, then figuring out how meaningful such distinctions were when it came both to internal classifications and the actual treatment of human beings. It was arduous.\n Officially speaking, the Senate was able to tally  at least 119 people whom the CIA held in the black sites during their 2002-2008 existence. “There’s a back-and-forth we had with the agency on who was a CIA detainee and who wasn’t. The committee, to arrive at 119, is extremely conservative. Everyone who was involved in this investigation believes there was more than 119 CIA detainees,” Jones explained.\n “If the CIA doesn’t know how many people were in its own custody, it’s very unlikely there’s any record-keeping of people who were merely  transients” – that is, briefly in CIA custody before being whisked to a partner intelligence service – “and those who  weren’t in their custody. ...Tenet and every other [CIA] director said [the torture program] was the CIA’s central counterterrorism program at the time. Because it was a central program – and incredibly sensitive – it would be reasonable to think the CIA would maintain a robust classified record,” he continued.\n “If, in fact, the ‘DI’ part was viewed as the central component of the War on Terror by the CIA, there’s no reason to believe they would hold better records with the rendition program.”\n    First, the only reason the Senate intelligence committee investigated at all is that two leading figures inside the program, Jose Rodriguez and Gina Haspel, destroyed videotapes of the torture of two men inside the first post-9/11 black site – something that also sparked a  criminal investigation. Once the Senate learned about the destruction of those tapes  from   The New York Times, rather than from the CIA, the committee could no longer credibly refuse to open an investigation of its own.\n Second, in most major speeches and testimony, CIA directors George Tenet, Porter Goss, and Michael Hayden repeatedly emphasized that their War on Terror is an international team sport. They did this so often that journalists rarely bothered quoting it; it seemed like boilerplate. It was often self-serving, as when they cited the importance of cooperation with allied intelligence services as a reason to never disclose what that cooperation  did. But they’re correct that reliance on various  Mukhabarats makes their war viable. “I cannot overstate how vital these relationships are to our overall effort,” Hayden  said in one  typical September 2007 appearance.\n The absence of renditions records, even to the Senate torture report, is no longer exactly  news. I reported it in 2016 in this  20,000-plus-word, three-part series for   The Guardian. But what has bothered me ever since is how little attention and care that absence has ever received. In the wake of our  recent   Forever Wars  piece about naming the dead, I’ve been thinking about that more and more – the enormous gap in our historical knowledge of renditions; the likelihood that if the Senate torture report couldn’t go there, then we’re probably  not going to fill those gaps; and the fact that pretty much no one gives a shit.\n    WE KNOW   SOME  THINGS ABOUT RENDITIONS. In particular, we know that  the CIA took bondage nudes of bound prisoners at the point of transferring them.  That was documentation of the renditions – presumably made to provide proof that someone who might ultimately die in a foreign torture chamber was alive when the CIA had them.\n Human Rights Watch, in 2008, was able to document 14 people the CIA rendered to the Jordanians. One of them, Abu Hamza al-Tabuki,  recalled: “from the first day, they began to interrogate me using the methods of terror and fear, torture and beating, insults and verbal abuse, and threatening to expose my private parts  and rape me. I was repeatedly beaten, and insulted, along with my parents and family.” Those familiar with the history of torture, particularly in a context of war, will note how present  sexual torture is within it.\n When the U.S. helped overthrow Moammar Qaddafi in 2011, it inadvertently led to the  publication of the files locked in the offices of Qaddafi’s internal-security apparatus. That ended up accidentally exposing what CIA-Libya cooperation looked like in practice.  It’s really not a pleasant read. Neither is the  messy history of the rendition of Abu Omar, whom the CIA abducted in Milan  after Italy had granted him asylum.\n In my 2016  Guardian piece, I reported that renditions were the “largest” part of RDI. Jones reminds me, helpfully, that “we don’t really actually know that.”\n Fair enough. I was using a  European Parliament investigation from 2007 that reported: “at least  1,245 flights operated by the CIA flew into European airspace or stopped over at European airports between the end of 2001 and the end of 2005, to which should be added an unspecified number of military flights for the same purpose; ...on one hand, there may have been more CIA flights than those confirmed by the investigations carried out by the Temporary Committee, while, on the other, not all those flights have been used for extraordinary rendition.”\n Note that last line. Note how the EU acknowledges the limits of its investigative visibility into European complicity. The EU investigators are able to document over 1,200 CIA flights to Europe over four years. They can’t say each flight was a renditions ferry, or that each flight equals a person rendered. They  can say they are unable to answer the question, and as a fallback, offer their best evidence as a proxy for the scale of a program whose surface they can barely scratch, thanks to the obstinacy of several governments.\n Hayden, in 2007, weaponized that uncertainty to discredit the EU. “The suggestion that even a substantial number of those 1,245 flights were carrying detainees is frankly absurd on its face,” he  scoffed.\n Except it’s not absurd at all. It is true that Hayden had exclusive access to whatever remained of the CIA record, so he could make assertions about the CIA torture program being “designed only for the most dangerous terrorists and those believed to have the most valuable information, such as knowledge of planned attacks” from a position of authority.\n Unfortunately for Hayden, Scheuer, who said he “ran renditions” when he was at the Counterterrorism Center, accidentally contradicted him in 2008.\n “Under Mr. Clinton we had focused on very senior al-Qaeda people,” Scheuer (who didn’t respond to a message seeking comment) recalled at an event at Berkeley that year. After 9/11, he told the audience, “the bar went down a little bit, and we began to pick other people up.” (This is around  minute 32:30 in this video.)\n Defenders of rendition, Hayden included, tend to describe rendition as lawful, complete with guarantees from other nations of humane treatment. Scheuer is a rare CIA official who acknowledges on record that that’s bullshit. “Under Mr. Clinton, we were to take them off the street and arrange for them to be returned to a government that wanted them for a judicial process,” he said at that event.\n We went back to the White House and said, “This was what we planned to do, do you want us to do it?” Yes, was the answer. “Well, we’re going to take them to countries where they’re wanted, but your State Department, every year, is going to say ‘that country is a human rights abuser,’ or its judicial processes are not what we want them to be.” And everybody kind of puckered up and said, “Ooh, that may be a problem. Can you get these countries to say ‘We will treat these rendered people according to our own laws?’” And we said, “Yeah, we’re pretty sure that country X will treat them according [to their own laws] – that won’t get you off the hook!” But that’s as far as it went. Now, President Clinton and [national security adviser Sandy] Berger said that they insisted on guarantees that these prisoners would be treated according to American standards or international law. Now, I was there. I ran the operations. That was never a requirement that I knew of. That&#39;s entirely a kind of after-the-fact defense of what was done.\n Hayden has a track record of lying. When Jones was able to examine the records of the CIA’s detentions and interrogations, he saw just how heavily Hayden and others in the CIA manipulated the truth. An entire annex of the Senate intelligence report debunks a fusillade of lies Hayden told about CIA torture  in just one day of testimony. (Appendix 3, starting on  page 462 of the report.) And that’s not the end of it: see   Reign of Terror , out on Tuesday. (Also, I have a story about Hayden showing up at one of my band’s shows; I might write about that for subscribers, so please do subscribe.)\n Scroll up in this piece to the quote from Jones about how there’s a “back-and-forth” over who the agency counts as detainees, prompting the Senate to act conservatively in tallying 119 men at the black sites. Hayden, in 2007, claimed the number of black-site prisoners was “fewer than 100.” All this is particularly glaring when reviewing Hayden’s assertion, in the same speech, that “the number of renditions is actually even a smaller number, mid-range two figures.”\n   WHAT WE LACK, and what we will likely always lack, is a  systemic understanding of the renditions, extraordinary and ( sighs) “ordinary.” The Senate intelligence committee report emerged from a unique opportunity and set of historical circumstances. Neither will come again. Jones performed an extraordinary service for history. I don’t write any of this to fault  him for being unable to unearth the rendition program – no one outside of the Church and Pike committees has done more to force  real transparency out of the CIA.\n “We had two options in a world of limited resources: to attempt to totally detail all the renditions; or to detail the ‘D and I’ in US custody,” Jones said. “It’s still the right call, but it makes the false assumption that Congress can only have the most minimal of investigative resources. In essence, we’ve decided to live in this world of limited oversight.” Damn. Sit with that quote a moment.\n Jones is pointing to a consequence-free obliteration of truth. The mark on the victim’s body is torture’s true measurement, especially when we believe that every human being has inherent worth and dignity. The official denial that the mark was made, aggregated across an unknown number of people, is no longer a crime against them alone but a crime against history. One of the people directly involved in both the mark and the denial,  after both were known,  rose to become CIA director, to bipartisan acclaim. One of her  boosters is, right now, the  Director of National Intelligence. Another chairs the Senate intelligence committee.\n “The oversight mechanisms and the executive branch have allowed both inappropriate and illegal behavior to happen without consequence,” said Jones. “There’s  never any accountability. There is no leash. It’s just unclipped. In such a lax oversight environment, why would they think they need records?”", "posttime": "2021-08-07 03:21:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "情报局,outsourced", "title": "中央情报局的外包酷刑已被历史遗忘", "title_en": "The CIA’s Outsourced Torture Is Lost to History", "transed": 1, "url": "https://foreverwars.substack.com/p/the-cias-outsourced-torture-is-lost", "via": "", "real_tags": ["情报局"]}, {"category": "", "categoryclass": "", "imagename": "3614c8a581b6d0eb55d8751a518fda6c.png", "infoid": 1071840, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，想就我的一个想法进行讨论。作为一名经验丰富的 Emacs 用户（8 年），我投入了大量时间学习和配置 Emacs（包括电子邮件、RSS、浏览、计算器等）。我可以说它做我想要的和我想要的。我不会说这是一个永无止境的过程，因为品味和兴趣（+ 工作）会发生变化。我认为我们都坚持使用 Emacs，至少在某些小部分是由于沉没成本谬误。基本上，这意味着过去已经为我们的行为付出的代价会继续影响我们未来的决定，即使它不应该这样做。来自链接：»人们表现出“一旦对金钱、精力或时间进行了投资，就会有更大的倾向继续努力。”« 在 Emacs 上投入的时间是否值得提高生产力的问题一直在这里讨论。我的观点是通过以下组合来证明它的合理性：相信自由和开源软件，（与之相关的）以文本为中心，它可以被视为一种精神爱好，一种创造性的出口。然而，我可能承认我表现出一些沉没成本谬误的想法。当我意识到我不会向新用户推荐 Emacs 时，这变得很明显 - 除非他们像我一样投入大量时间学习它。你对此有何看法？您是否承认在选择 Emacs 而不是其他一些工具时有一些不合理的想法，例如，您使用它的时间越长，您就越相信它是最好的，即使新工具正在不断开发。我想我理解你在这里写的东西，在某种程度上，我同意。但是，我想通过这篇文章挑战关于工具选择这个很好的哲学问题的观点。是的，Emacs 是一个需要投入时间和知识才能掌握的平台。但是你得到的是一个尽可能灵活地处理当前和未来需求变化的系统。我想不出有什么不同的情况，您正在使用一种灵活的工具来适应您的情况，而没有沉没成本谬误或某种锁定效应，我在我的 PIM 讲座中是这样称呼它的。另一个方面是：Emacs 和 org 模式中作为频繁用例的所有内容都是开放的。因此，您可以自由切换到不同的工具。积极的一面是，您的问题不是“从 Emacs 中获取所有数据”。您的问题是找到一个更合适的工具，让您可以导入所有这些累积的数据，或者能够驱动您的流程和工作流程。换句话说：在任何情况下，如果有人找到适合她/他的一组需求的工具，长时间使用它，逐步适应需求，生成数据，管理信息和知识，您将获得切换到不同的工具会让你付出很大的努力。这并不是 Emacs 特有的。在大多数情况下，您将了解到您甚至无法再获取所有数据。这就是 Emacs 的开放性闪耀的地方。\n我已经写下了关于人们应该如何选择他们的（软件）工具的建议。如果您遵循此原则并且您的工具非常适合您，则您不必更改为其他工具。 （如果您确实需要切换，遵循我的工具选择过程可确保您能够在不丢失数据的情况下进行切换。）我个人对 Emacs 的看法是，我可能永远不会再切换到我生活中的任何不同之处。我学会了接受它的灵活性，这样我就无法想象 Emacs 没有为我提供个人信息管理所需的功能的许多情况。从这个角度来看，我确实有一个完美的锁定情况，我通常会尽量避免这种情况。这是我能想到的单一锁定情况，这是一件非常好的事情。另一方面，为什么我不认为像 Emacs 这样的技术投入时间是一件坏事：Emacs 知识是长期知识。在过去的几十年里，我确实为专有工具学习了很多东西。这种努力的很大一部分现在毫无用处，使过去的学习努力成为暂时的。随着下一个主要版本的发布，一些知识很快就过时了。另一方面，我在 90 年代学到的关于 Emacs、LaTeX、GNU/Linux 等技术的知识，现在对我来说仍然有效和有用。这一点怎么强调都不为过：我没有停止学习和重新学习，而是能够改进和学习新事物。这比任何专有或临时知识都要好得多。在德语中，“Scheuklappen-Effekt”意味着由于某种原因，您的视野狭窄。不知道英文里有没有类似的说法。 “长期使用 Emacs 并较少考虑其他工具”与提到的沉没成本谬误情况之间的区别可能在于我不认为我正在使用 Emacs 只是因为我不再考虑替代方案。我使用它是因为总而言之，它是我现在和未来可能得到的最好的包。\n我正在使用 Emacs 之外的许多工具，这些工具可以立即被 Emacs-modes/methods 替换（电子邮件、网页浏览、大部分文件管理……）。然而，Emacs（和 Org 模式）的开放性让我可以并行使用 Emacs 和其他工具，将它们顺利连接起来，这样我就不会因为这些“边界”而感到痛苦。关于开放性，我从 org 开始，因为我痴迷于将所有内容都作为简单的文本文件的想法，我想如果我愿意的话，我将来可以离开。我的意思是，出口标记得很清楚，而且人们似乎仍然选择留下来。关于灵活性；如果灵活性不好怎么办？如果您想最小化灵活性怎么办？首先，它可以减少认知负担（比如不必选择你穿什么而是使用一些系统），软件以特定的方式工作，就是这样。其次，这意味着我们都可以交换笔记本电脑，我们将能够完成我们的工作 - 类似于您通过 SSH 连接到远程机器和 VIM 的方式是相同的。我真的不知道为什么我们倾向于如此欣赏灵活性。是因为人与人不同，而我们想将我们的个人需求（尤其是需求）强加于我们的工具吗？如果我们相信某人会在工具设计中做出最佳选择会怎样？你关于开放性和搬家能力的评论真的很有趣。人们似乎倾向于使用使他们更容易离开的工具。如果这个假设是真的，它具有一定的讽刺意味，不是吗？灵活性是坏事吗？当然！在我的 PIM 讲座中，我确实有一个部分解释了（非常简化！）两类工具：简单工具和高级工具。这两个类别对于匹配要求都非常有效。问题是人们使用简单的工具，而从长远来看，高级工具可以为他们提供更多优势。同样 - 这就是您所指的 - 当您选择像 Emacs 这样的高级工具可以满足简单工具更适合的需求时，您确实必须面对问题。关键是我们需要教人们在他们因错误的工具选择或锁定效应而面临问题之前，对工具进行深思熟虑和明智的选择。 public voit 是在 Org 模式下创作的，由lazyblorg 生成 • HTML5 • CSS3 • 存档 • 经久耐用", "note_en": "Hi all, wanted to raise a discussion about a thought I had. As a moderately experienced Emacs user (8 years), I&#39;ve invested a LOTof time into learning and configuring Emacs (including email, RSS,browsing, calculator, etc). I can say that it does what I want and howI want it. I won&#39;t go into the fact that it&#39;s a never ending processbecause tastes and interests (+ jobs) change. I would reckon that we all stick to Emacs, at least in some small partdue to  the sunk cost fallcy. Basically it means a price already paidin the past on our actions keep influencing our decisions in thefuture even though it shouldn&#39;t. From the link: »People demonstrate &#34;a greater tendency to continue an endeavor once aninvestment in money, effort, or time has been made.&#34;« The question of whether the time invested in Emacs is worth theproductivity gained is discussed here all the time. My view is tojustify it by a combination of the following: believing in FOSS,(related to that) text centricity, and it could be viewed as a mentalhobby, a creative outlet. However I might admit that I exhibit some sunk cost fallacy thinking.It becomes clear when I realize that I WON&#39;T recommend Emacs to newusers - unless they are going to invest large amounts of time learningit, like I did. What are your thoughts on this? would you admit that there&#39;s someirrational thinking in choosing Emacs over some other tools, e.g. thelonger you use it the more you&#39;re convinced it&#39;s the best even thoughnew tools are keep being developed.\n I think I understand what you&#39;re writing here and to some extend, I do agree.\n However,  I would like to challenge the point of view to this good philosophical question on tool choice with this article.\n   Yes, Emacs is a platform that requires investment in time and knowledge to be mastered. But what you get is a system that is as flexible as possible to deal with present and future changes of requirements.\n I can not think of a different situation where you are using a flexible tool that you adapt to your situation which does  not come with the sunk cost fallacy or some kind of  lock-in effect, how I call it in my  PIM lectures.\n   Another aspect is: everything within Emacs and org mode as a frequent use-case is open. So you&#39;re free to switch to a different tool. The positive side is that your problem is not &#34;getting all of your data out of Emacs&#34;. Your problem will be to find a more suitable tool which lets you import all this accumulated data or which is able to drive your processes and workflows.\n In other words: In  any situation where somebody finds a tool which fits to her/his set of requirements, working with it for a long time, adapting to the requirements step by step, generating data, managing information and knowledge, you will get to a point where switching to a different tool will cause you a high level of effort. This is nothing specific to Emacs in particular. In most cases, you will learn that you can&#39;t even get out all of your data any more. And here is where the openness of Emacs shines.\n I&#39;ve written down my proposal on  how people should choose their (software) tools. If you followed this principle and your tool suits you well, you don&#39;t have to change to a different tool. (And if you do need to switch, following my tool choice process made sure that you are  able to switch without data loss.)\n   My personal opinion on Emacs is that I&#39;ll probably never switch to anything different in my life any more. I learned to embrace its flexibility so that I can not think of many situations where Emacs does not provide me the features I need for my  personal information management. From this perspective, I do have a perfect lock-in situation which I usually try to avoid as much as possible.  This is the single lock-in situation I can think of that is a perfectly good thing to be in.\n Another aspect why I do not consider time investment in technology like Emacs is a bad thing: Emacs knowledge is  long-term knowledge.\n I did learn many things for proprietary tools over the last decades. A large percentage of this effort is now useless, making this past learning effort to a temporary one. Some knowledge got obsolete as fast as the next major release was published.\n On the other hand side, whatever I&#39;ve learned for technologies like Emacs, LaTeX, GNU/Linux, and so forth in the nineties, is still valid and useful to me nowadays. This can not be stressed enough: instead of un-learning and re-learning, I was able to improve and learn new things.  This scales much better than any proprietary or temporary knowledge.\n   In German &#34;Scheuklappen-Effekt&#34; means that you have a narrowed view for some reason. I don&#39;t know if there is a similar phrase in the English language.\n The difference between &#34;using Emacs for a long time and thinking less of other tools&#34; to the mentioned sunk cost fallacy situation may be that I don&#39;t think that I&#39;m using Emacs just because I don&#39;t think of alternatives any more. I use it because all in all, it&#39;s the best package I can get for now and most probably also for the future.\n I&#39;m using many tools outside of Emacs which could be replaced by Emacs-modes/methods right away ( email, web browsing, most of file management, ...). However, the openness of Emacs (and Org mode) allows me to work with Emacs and other tools in parallel, interfacing them smoothly so that I don&#39;t have much pain with these &#34;borders&#34;.\n    Regarding the openness, I started with org because I was hooked on theidea of having everything as simple text files and I thought I wouldbe able to leave in the future, if I want to. I mean, the exits arewell marked and still people choose to stay, it seems. Regarding the flexibility; what if flexibility is bad? what if youwant to minimize flexibility? first, it can reduce cognitive load(like not having to choose what you wear but instead use some system),the software works in a specific way and that&#39;s it. Secondly it meanswe can all swap laptops and we would be able to do our job - similarto how you SSH to a remote machine and VIM is the same. I really don&#39;tknow why we tend to appreciate flexibility so much. Is it becausepeople are different and we want to impose our personal wants (notexactly needs) on our tools? what if we trust someone to make the bestchoices in the tool&#39;s design?\n  Your remark on the openness and ability to move away is really interesting. It seems to be the case that people might tend to stay with tools that makes them more easy to leave. If this assumption is true, it has a certain level of irony, hasn&#39;t it?\n Flexibility as a bad thing? Of course! In my PIM lecture, I do have a section where I explain that there are (very simplified!) two categories of tools: simple tools and advanced tools. Both categories are perfectly valid for matching requirements. The issue is that people use simple tools when an advanced tool would provide them much more advantages in the long run. Likewise - and this is what you are referring to - when you choose an advanced tool like Emacs can be for requirements where a simple tool would be the better fit, you do have to face issues. The point is that  we need to teach people to do deliberate and wise choices for tools before they do face issues because of wrong tool choice or lock-in effects.\n           public voit is authored in  Org mode and generated by  lazyblorg\t \t •   HTML5\t \t •   CSS3\t \t •   Archive\t \t •   Designed to Last", "posttime": "2021-08-07 03:20:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "emacs,工具", "title": "Emacs 锁定效应或 Emacs 沉没成本谬误", "title_en": "The Emacs Lock-In Effect or the Emacs Sunk Cost Fallacy", "transed": 1, "url": "https://karl-voit.at/2021/07/23/emacs-lock-in/", "via": "", "real_tags": ["emacs", "工具"]}, {"category": "", "categoryclass": "", "imagename": "f016b5365140c206de4f938897a130a1.jpg", "infoid": 1071839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": ".com 的注册机构威瑞信已通知 Gandi，自 2021 年 8 月 31 日太平洋时间晚上 9:00（UTC 时间 2021 年 9 月 1 日下午 4:00）起，.com 域名注册价格将上涨。我们知道此次提价可能会对您产生负面影响。不幸的是，由于成本增加，Gandi 不得不将此次涨价纳入我们的定价中。我们鼓励您从我们的博客中阅读这篇文章，其中概述了域名的实际价格及其包含的内容。因此，我们将在我们的定价网格中延续这一价格上涨。您可以在网格 A 中找到自 2021 年 8 月 31 日太平洋标准时间晚上 9:00（UTC 时间 2021 年 9 月 1 日下午 4:00）开始的 .com 域名的新域创建、续订、转让和恢复的新价格。 域域名行业在未来几年可能会看到 .com 域名的进一步价格上涨：除了今年的价格上涨外，Verisign 还获准在 2022 年和 2023 年以及 2026 年至 2029 年期间将 .com 的价格提高至 7%。我们强烈鼓励您在 2021 年 8 月 31 日之前续订您的域名的最长续订期限，以便在最长时间范围内从当前价格中受益。如果您的域名已注册 1 年，则可以再续订 9 年。", "note_en": "Verisign, the registry for .com, has notified Gandi of a price increase on the registration of .com domain names starting August 31, 2021 at 9:00 PM Pacific (September 1, 2021 at 4:00 UTC).\n We are aware that this price increase may have a negative impact on you. Unfortunately, due to the increase in costs, Gandi has no option but to carry this price increase into our pricing. We encourage you to read  this article from our blog that outlines the real price of a domain name and what it includes.\n  Therefore, we’ll be carrying over this price increase in our pricing grid. You can find the new prices for new domain creations, renewals, transfers, and restorations of  .com domain names  starting August 31, 2021 at 9:00 PM Pacific (September 1, 2021 at 4:00 UTC) in Grid A.\n    The domain name industry may see further price increases in  .com domains in the coming years: besides this year’s price increase, Verisign has been permitted to increase .com prices up to 7% in 2022 and 2023 as well as between 2026 to 2029.\n We strongly encourage you to renew your domain names for the maximum renewal period  before August 31, 2021 in order to benefit from the current price for the longest time frame.\n If you’ve registered your domain name for 1 year, you can renew it for an additional 9 years.", "posttime": "2021-08-07 03:20:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,names,价格", "title": "从 2021 年 9 月 1 日开始，.com 域名的价格上涨", "title_en": "Price increase on .com domain names starting September 1, 2021", "transed": 1, "url": "https://news.gandi.net/en/2021/07/price-increase-on-com-domain-name-prices-starting-september-1-2021", "via": "", "real_tags": ["域名", "names", "价格"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071838, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CDC 最近宣布 Delta 变体的平均再生数为 6-9，这引起了很多人的关注，许多人问我这是否意味着我们需要 COVID 助推器。让我们来谈谈我们如何决定的数学！首先，我们需要确保每个人都对平均“生殖数量”是什么看法一致。该术语是指将被单个传染性个体感染的平均新病例数。当我们谈论所有易感人群时，我们使用 R0（读作 R-naught，就​​像我们是花哨的英国人）或基本再生数。当我们谈论具有混合易感性和免疫性的流行音乐时，我们使用 R 或 Re 来表示有效繁殖数。不管我们是在谈论 R0 还是 Re，如果这个数字大于 1，任何感染都会导致爆发，这种爆发会不断增长，直到我们阻止它或它耗尽了可以感染的人。 R0 或 Re 数小于 1 意味着感染要么不会引起爆发，要么如果引起，爆发会自行消退。公共卫生的一个主要目标是找到 Re 或 R0 大于 1 的任何病毒并进行干预，直到 Re 小于 1。现在我们知道这些意味着什么，我们可以将它们用于决策。您需要的下一个流行病学课程是，无论何时我们要做出决定，我们都需要一个“基本案例”：除非我们知道在典型的默认操作下会发生什么，否则我们无法决定要做什么！在 COVID 的情况下，我们可能需要考虑两种基本情况。首先，在所有变体和疫苗出现之前，COVID 最初的传播情况如何？这个基本案例#1 将使我们对大流行有直观的了解，因为它代表了去年发生的大部分事情。\n非变异 COVID 的 R0 估计约为 2-3。让我们选择 3，这样我们的计算就有了一个数字。我们可以看到这个数字（3）大于1，这就是我们爆发的原因。但是我们在过去一年中采取的所有封锁、口罩和类似的公共卫生预防措施帮助将 Re 降低到接近 1 **，而这些事情正在发生**，在某些情况下甚至低于 1。巨大的胜利！直到我们停止做它们🤦🏼‍♀️ 我们可以通过以下公式粗略计算 Re 的值： Re = R0*(1-X*Ve) 其中 X 是接种疫苗的人数比例，Ve 是疫苗效力。 （另一种写法是：Re=R0*S，其中 S 是易感人群的比例）。因为这是一个很好的简单数字，所以我们假设所有疫苗都具有与 Pfizer/BioNtech 相同的功效（即 95%）。让我们也假设（虽然我们知道这不是真的，没有自然免疫或部分免疫——我会在最后讨论如何放宽这些假设。）对于原始的非变异 COVID，我们发现影响的疫苗 *如果 100% 的人接种了疫苗* 将是：Re=3*(1–1*.95)=0.15 &lt;&lt;&lt; 1！现在，我们显然没有 100% 接种疫苗。那么，如果我们采用美国目前完全接种疫苗的人口百分比呢？截至 8 月 2 日，这是 49.9%，所以为了简单起见，我们假设为 50%。 Re=3*(1–0.5*0.95) = 1.575 这仍然大于 1，所以我们仍然需要其他预防措施。另外，非变异 COVID 并不是唯一传播的 COVID。因此，对于我们的第二个基本案例，让我们看看 Delta 变体。 CDC 说它的 R0 可能是 6-9。让我们选择 8。最近的观察数据表明，辉瑞疫苗对 Delta 的疗效略低，假设为 85%。\n截至 8 月 2 日，这些数字对我们在美国的达美再保险有何意义？ Re=8(1-.5*.85) = 4.6 &gt;&gt;&gt;&gt;&gt;&gt;1！这绝对低于 8 但哇，这太高了！甚至高于大流行开始时非变异 COVID 的 R0！这就是我们都再次需要口罩的原因！！现在让我们考虑一些我们可以做的干预。 A) 如果我们将疫苗接种率提高到 75% 会怎样？这是一个很大的提升，但并非不可能。 B) 如果我们给*所有接种过疫苗的人* 加强剂会怎样？让我们假设助推器恢复原始 95% 的功效。对于基本情况#1（非变异covid），选项A给我们：Re=3(1-.75*.95)=0.86 &lt;1！！这小于 1，意味着我们可以单独依靠疫苗接种！多么胜利！ （选项 B 不会改变我们的基本情况，因为非变异 VE 总是 95%。）所以我们可以看到，*如果我们只处理非变异 COVID*，那么最好的行动方案是得到接种疫苗的总人数，然后我们可以停止所有的掩蔽和关闭以及一切！德尔塔呢？选项 A（更多人接种疫苗）给我们：Re=8(1-.75*.85)=2.9 哇！这仍然比 1 大，所以我们仍然需要口罩和其他预防措施，但比 8 好得多！！选项 B（助推器）给我们： Re=8(1-.5*.95)=4.2 &lt;sad trombone&gt; 哇，平淡无奇！给每个 vax 人一个使疫苗效力高达 95%（一个非常高的数字）的助推器只会将 Delta 的 Re 从 4.6 降低到 4.2！这仍然高于非变异 COVID！从这些计算中可以很明显地看出，为 75% 的人接种疫苗（即我们目前所做的数量的一半）比为最初 50% 的已完全接种疫苗的人接种加强剂要好。但无论我们选择哪一种，我们仍然需要其他预防措施！\n如果我们的目标低一点呢？有多少*新*人需要完全接种疫苗才能获得与给所有接种疫苗的人接种加强疫苗相同的好处？为此，我们需要做一点代数：4.2=8(1-x*.85) x=0.56 答案：56% 的人，或比目前接种疫苗的人多 6 个百分点！那么，将美国完全接种疫苗的比例从 50% 提高到 56% 的可行性如何？好吧，截至 8 月 2 日，58% 的人至少 *部分* 接种了疫苗！这意味着通过确保开始接种疫苗的每个人都接种第二剂，我们可以获得与给每个接种疫苗的人额外接种一剂加强剂一样多的保护。对我来说，这似乎很简单！上面的计算是简化的，因为我忽略了部分接种疫苗的人的部分免疫力，以及感染者的任何自然免疫力。我也不包括像戴口罩这样的公共卫生干预措施的好处，我们知道这可以降低易感性。我把这些排除在外的部分原因是等式很简单，但另一个原因是我们对部分或自然免疫真的了解不多。但是，如果您对其他免疫值有一些猜测，并且想尝试将它们合并，则可以将上面的等式扩展如下：这里，Z 是最近感染足以仍然具有自然免疫力的人的百分比（虽然我们不太清楚那是多长时间），Vn 是自然免疫防止未来感染的平均水平，A 是部分接种的人的百分比，Vp 是部分接种的疫苗效力。这仍然是一种简化，因为它假设这些组是相互排斥的，但它不像以前那样简化。\n无论您使用哪种等式，如果您计算这些数字，您会发现向未接种疫苗的人接种疫苗几乎总是比向已接种疫苗的人接种加强剂更好的举措。至少在我们几乎每个人都接种了疫苗之前。所以，你可以决定，但对我来说，我想要所有人都接种疫苗！我们也可以看到，如果 Delta 真的这么糟糕，我们将在未来很长一段时间内需要口罩和其他预防措施。这真是令人失望，更糟糕的是，我们本可以通过在去年更好地控制感染来避免这种情况发生。我们不要犯同样的错误两次！更新：有些人问过这一切与流感相比如何。流感的 R0 值介于 1 和 2 之间。所以您现在可以明白为什么去年我们对呼吸道病毒采取了所有这些预防措施时，流感几乎完全消失了！另一个常见问题是个人应该为自己选择什么。如果您处于中等风险，最好说服您的朋友、家人和邻居接种疫苗，而不是自己接种加强剂。加强剂可能更重要的唯一情况是那些患有特定免疫功能低下健康状况的人——如果他们知道他们对前两剂的反应不是很好，那么他们可能会从第三剂中受益。但这对我们大多数人来说并非如此。这篇文章最初是一个推文或 Twitter 教程，充满了有趣的 gif。要阅读原始推文，请单击此处。", "note_en": "The CDC’s recent announcement that the Delta variant has an average reproductive number of 6–9 has a lot of people concerned &amp; many are asking me about whether this means we need COVID boosters.    Let’s talk through the math of how we might decide!\n  First, we need to make sure everyone is on the same page about what the average “reproductive number” is. This term means the average number of new cases that will be infected by a single infectious individual.\n When we’re talking   about a population that is all susceptible, we use R0 (pronounced R-naught, like we’re fancy &amp; British) or the basic reproductive number.   When we’re talking about a pop with mixed susceptibility &amp; immunity, we use R or Re for effective reproduction number.\n  Regardless of whether we’re talking about R0 or Re, if this number is bigger than 1 any infections will lead to an outbreak that grows &amp; grows until we stop it or it runs out of people to infect.\n A R0 or Re number less than 1 means an infection either doesnt cause an outbreak or, if it does, the outbreak fades away on it’s own.    A major goal of public health is to find any viruses with an Re or R0 more than 1 and intervene until the Re is less than 1.   Now that we know what these mean, we can use them for decision-making.\n  The next epidemiology lesson you need is that whenever we want to make a decision we need a “base case”: we can’t decide what to do unless we know what would happen under our typical default action!    In the case of COVID there are two base cases we might want to consider.\n First, how well did COVID originally spread before all the variants &amp; before vaccines?    This base case #1 will give us intuition about the pandemic because it represents most of what happened LAST year.\n The R0 for the non-variant COVID was estimated at around 2–3. Let’s go with 3 so we have a single number for our calculations.    We can see that this number (3) is larger than 1, which is why we had outbreaks.\n But all the lockdowns, masking, and similar public health precautions we did over the past year helped to lower Re to close to 1 **while those things were happening** &amp; in some cases even below 1. A huge win! Until we stopped doing them🤦🏼‍♀️\n  We can get a rough calculation of Re with the following formula:    Re = R0*(1-X*Ve)   where X is the proportion of people vaccinated and Ve is the vaccine efficacy.\n (Another way to write this is: Re=R0*S  where S is the proportion of people who are susceptible).\n  Because it’s a nice easy number, let’s assume all the vaccines have the same efficacy as Pfizer/BioNtech (ie 95%). Let’s also assume (although we know it isn’t true, that there’s no natural immunity or partial immunity — I’ll talk anout how to relax those assumptions at the end.)   For the original non-variant COVID, we find that the impact of the vaccine *if 100% of people got vaccinated* would be:    Re=3*(1–1*.95)=0.15 &lt;&lt;&lt; 1!\n Now, we obviously are not at 100% vaccinated. So, what about if we take the current % of fully vaccinated people in the US?    As of Aug 2, that was 49.9%, so let’s say 50% for simplicity.     Re=3*(1–0.5*0.95) = 1.575   That’s still bigger than 1 so we still need other precautions.\n  Plus, non-variant COVID isn’t the only COVID circulating. So, for our second base case, let’s look at the Delta variant. The CDC says it’s R0 may be 6–9. Let’s choose 8.    Recent observational data suggests Pfizer vaccine efficacy is a bit lower against Delta, let’s say 85%.\n What do these numbers give us for the Re of Delta in the US as of Aug 2?    Re=8(1-.5*.85) = 4.6 &gt;&gt;&gt;&gt;&gt;&gt;1!   That’s definitely lower than 8 but wow that’s high! Higher even than the R0 of non-variant COVID back at the start of the pandemic!    This is why we all need masks again!!\n  Now let’s think about some interventions we could do.    A) What if we increase vaccination rates to 75%? That’s a big lift but not impossible.     B) What if we gave *all vaccinated people* a booster? Let’s assume the booster restores the original 95% efficacy.\n For base case #1 (non-variant covid),  Option A gives us: Re=3(1-.75*.95)=0.86 &lt;1!!  That’s less than 1 &amp; means we COULD rely on vaccination alone! What a win!    (Option B doesn’t change our base case because the non-variant VE was always 95%.)\n So we can see that *if we were dealing with non-variant COVID only*, then the best course of action would be to get the total number of people vaccinated up and then we could stop with all the masking &amp; closers &amp; everything!\n  What about Delta?    Option A (more people vaccinated) gives us:  Re=8(1-.75*.85)=2.9  Wow! That’s still bigger than 1, so we still need masks &amp; other precautions, but MUCH much better than 8!!\n Option B (boosters) gives us: Re=8(1-.5*.95)=4.2  &lt;sad trombone&gt; wow, underwhelming!   Giving EVERY vax person a booster that gets vaccine efficacy up to 95% (a fantastically high number) will only reduce Delta’s Re from 4.6 to 4.2! That’s still HIGHER than non-variant COVID!\n  From these calculations it seems pretty clear that vaccinating 75% of people (ie half as many again as we’ve done so far) is better than getting boosters to the original 50% of people who have been fully vaccinated.    But NO MATTER which we choose we still need other precautions!\n  What about if we aim a little lower? How many *new* people would need to be fully vaccinated to achieve the SAME benefit as giving all the vaccinated a booster? For this, we need to do a little algebra: 4.2=8(1-x*.85)  x=0.56 The answer: 56% of people, or 6 percentage points more than are currently vaccinated!\n So how feasible is it to increase the percent fully vaccinated in the US from 50% to 56%? Well, as of Aug 2, 58% were at least *partially* vaccinated!\n That means that by ensuring everyone who has started the vaccine series gets their second dose, we can get as much protection as giving EVERY vaccinated person an additional booster dose.    To me, that seems like a no brainer!\n  The calculations above are simplifications, because I’m ignoring the partial immunity people who are partially vaccinated have, as well as any natural immunity in people who are infected. I’m also not including the benefits of public health interventions like masking, which we know reduce susceptibility.\n Part of the reason I’ve left these out is so the equation is simple, but another reason is that we really do not know that much about partial or natural immunity.\n But if you had some guesses for those other immunity values, and you want to try to incorporate them, you can extend the equation above as follows:\n  Here, Z is the percent of people who have been infected recently enough to still have natural immunity (although we don’t quite know how long that is), Vn is how well natural immunity prevents future infection on average, A is the percent of people partially vaccinated, and Vp is the vaccine efficacy of partial vaccination. This is still a simplification because it assumes these groups are mutually exclusive, but it’s less of a simplification than before.\n  No matter which equation you use, if you run the numbers, you’ll find that getting vaccines to unvaccinated people is pretty much ALWAYS a better move than giving boosters to the already vaccinated. At least until we’ve gotten almost everyone vaccinated.    So, you can decide, but for me, I want vaccines for all!\n We can also see that if Delta is really this bad, we’ll need masks &amp; other precautions for a long time to come.    That’s a real bummer &amp; what’s worse, we could have avoided this by doing a better job controlling infections last year.    Let’s not make the same mistakes twice!\n  UPDATE: A few people have asked how this all compares to the flu. The R0 value for influenza is between 1 and 2. So you can see now why when we did all those precautions against respiratory viruses last year the flu just about went away completely!\n Another common question is what individuals should choose for themselves. If you are at average risk, it’s better for you to convince your friends &amp; family &amp; neighbors to get vaccinated than to get a booster yourself. The only scenario where boosters might be more important is for people who have specific immunocompromising health conditions — if they know they didn’t respond very well to the first 2 doses, it’s possible they may benefit from a 3rd dose. But that’s not true for most of us.\n  This post began life as a tweetorial, or twitter tutorial, full of amusing gifs. To read the original tweetorial, click  here.", "posttime": "2021-08-07 03:20:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变体,delta,疫苗", "title": "Delta 变体对您意味着什么？", "title_en": "What does the Delta variant mean for you?", "transed": 1, "url": "https://medium.com/@EpiEllie/what-does-the-delta-variant-mean-for-you-its-time-to-put-back-on-your-mask-d98df830376", "via": "", "real_tags": ["变体", "delta", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "64a6396a7295041aa6b46ff6303e7703.jpg", "infoid": 1071837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，当您在 https://linus.ting.com/Check out SignalRGB 并在 https://bit.ly 同步所有 RGB 外围设备时，即可获得 Ting Mobile 的 25 美元积分...", "note_en": "Receive a $25 credit for Ting Mobile today when you sign up at https://linus.ting.com/Check out SignalRGB and sync all your RGB peripherals at https://bit.ly...", "posttime": "2021-08-07 03:19:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hands,https", "title": "LinusTechTips 使用 Steam Deck", "title_en": "LinusTechTips Hands on with Steam Deck", "transed": 1, "url": "https://www.youtube.com/watch?v=SElZABp5M3U", "via": "", "real_tags": ["hands", "https"]}, {"category": "", "categoryclass": "", "imagename": "06c4eb5064b99f5eae1c43f6c44d7c1c.jpg", "infoid": 1071836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当科技巨头为您提供特定的隐私选项（例如仅与受限圈子分享您的照片的选项）时，您是否相信他们？每个人都或多或少地信任科技巨头，但新的发现正在推动更多的人走向“次要”的一面。举个例子，这些公司的员工通常有能力通过后门措施查看你的账户，新的证据表明他们一直在这样做，这完全无视隐私规范。昨天（8 月 4 日）泄露的文件显示，谷歌在过去几年中因不当访问数据而解雇了数十名员工。在我们开始之前，澄清一下：不仅仅是 Google 员工会窥探其他人。 Facebook 和 Snapchat 等其他科技公司的员工也因这样做而被判有罪，并受到雇主的惩罚。万一你认为这是一个新现象，正如 Vice 报道的那样，它实际上是一个至少可以追溯到 MySpace 的问题。早在社交网站流行时，就有几名员工从事侵犯隐私的行为，例如阅读用户消息。诸如此类的启示对于科技公司来说并不完全是荣耀的时刻，因为它们经常试图将自己塑造成维护公民自由的实体。这些泄露的文件显示，即使公司对犯错的员工采取行动，他们也不会在季度业绩中公布细节，这将使用户能够就是否使用产品做出明智的选择。相反，关于谷歌解雇员工的信息来自一个绝对不是谷歌本身的来源。泄露文件的接收者 Vice 并未透露有关公司如何识别窥探事件或开始对其进行调查的许多细节。但是，它确实提供了一些关于所采取行动的具体数字。因此，虽然我们不知道每年发生多少隐私侵犯，但我们确实知道有多少严重到足以让 Google 对其员工采取严格行动。该文件显示，仅在 2020 年，谷歌就因这些严重违法行为解雇了 36 名员工，而 2019 年和 2018 年的人数分别为 26 人和 18 人。上升趋势可能表明公司也在认真看待这些违法行为，并有办法在发生时加以识别。\n该报告补充说，2020 年发生的犯罪中有 86% 涉及与未获授权接收信息的人共享数据，而 10% 的犯罪涉及访问、修改或删除用户或员工数据。在给 Vice 的一份声明中，谷歌发言人表示，泄露文件的大多数事件都涉及“访问或滥用专有和敏感的公司信息或 IP”。关于用户数据，发言人补充说，该公司遵循行业领先的标准（例如限制访问、数据访问前的多阶段审查以及对员工的年度培训）以保护数据免受任何内部威胁。该公司表示，它还调查所有指控，并在适当情况下采取纠正措施。我们已经联系谷歌发表声明，并将根据公司的回应更新故事。", "note_en": "Do you believe tech giants when they offer you specific privacy options, such as the option to share your photos only with a restricted circle? Everyone trusts tech giants to a greater or lesser degree, but new findings are pushing more people towards the &#34;lesser&#34; side. Case in point, employees at these companies typically have the ability to look at your accounts through back door measures, and new evidence reveals that they  have been doing so, which is in strict defiance of privacy norms.\n Documents that leaked yesterday (Aug. 4) show that Google has  fired scores of its employees over the last few years for improperly accessing data.\n Before we begin, a clarification: It&#39;s not just Google employees that snoop on other people. Employees at other tech companies, like Facebook and Snapchat, have also been found guilty of doing this and have been punished by their employers. Just in case you thought this was a new phenomenon, as    Vice reports,  it&#39;s actually an issue that dates back to at least MySpace. Back when the social networking site was popular, several employees engaged in privacy-violating behavior, such as reading user messages.\n  Revelations such as these are not exactly moments of glory for tech companies, as they often try to cast themselves as entities upholding civil liberties. These leaked documents reveal that, even though companies take actions against erring employees, they do not release the details along with their quarterly results, which would allow users to make informed choices about whether or not to use the products.\n Rather, the information about Google firing its employees came from a source that was decidedly  not Google itself.\n Vice, the recipient of the leaked document, hasn’t revealed many details on how companies identify snooping incidents or begin investigations into them. However, it does offer some concrete numbers on actions taken. So, while we do not know how many privacy intrusions occur every year, we do have some idea about how many are serious enough for Google to actually take strict action against its employees.\n  The document revealed that in 2020 alone Google fired 36 employees for these serious offenses, whereas the numbers in 2019 and 2018 were 26 and 18 people respectively. The rising trend is probably an indication that the companies are also viewing these offenses seriously and have the means to identify them when they occur.\n The report added that 86 percent of the offenses that occurred in 2020 involved sharing of data with persons not authorized to receive the information, while ten percent of offenses involved accessing, modifying, or erasing user or employee data.\n In a statement given to  Vice, a Google spokesperson stated that most of the incidents the leaked document involved &#34;access to or misuse of proprietary and sensitive corporate information or IP.&#34; With regards to user data, the spokesperson added that the company followed industry-leading standards (such as limiting access, multistage review before data access, and annual training for its employees) to secure data from any internal threats. The company said it also investigates all allegations and takes corrective action, where appropriate.\n  We have reached out to Google for a statement and will update the story according to the company&#39;s response.", "posttime": "2021-08-07 03:19:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,exploiting", "title": "谷歌解雇 80 名利用用户数据的员工", "title_en": "Google Fires 80 Employees for Exploiting User Data", "transed": 1, "url": "https://interestingengineering.com/google-fires-80-employees-for-exploiting-user-data", "via": "", "real_tags": ["谷歌", "google"]}, {"category": "", "categoryclass": "", "imagename": "1d9ca97585526474bb6a9f71a698b6fa.jpg", "infoid": 1071835, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“是的，特斯拉没有被邀请似乎很奇怪，”埃隆马斯克在推特上谈到了美国传统汽车制造商通用汽车、福特和克莱斯勒的母公司 Stellantis 的活动。", "note_en": "&#34;Yeah, seems odd that Tesla wasn&#39;t invited,&#34; Elon Musk tweeted about the event that featured legacy American carmakers General Motors, Ford and Chrysler&#39;s parent company Stellantis.", "posttime": "2021-08-07 03:19:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,白宫,car,stellantis", "title": "电动汽车领导者特斯拉被排除在白宫活动之外", "title_en": "Electric car leader Tesla left out of White House event", "transed": 1, "url": "https://auto.economictimes.indiatimes.com/news/passenger-vehicle/cars/electric-car-leader-tesla-left-out-of-white-house-event/85089305", "via": "", "real_tags": ["特斯拉", "白宫", "car"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071834, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近一篇关于编程的男子气概方面的文章发表了一个赤裸裸的声明：真正的程序员用 FORTRAN 编写。也许他们现在这样做了，在这个 Lite 啤酒、手动计算器和“用户友好”软件的颓废时代，但回到过去，“软件”一词​​听起来很有趣，真正的计算机是由鼓和真空管制成的，真正的程序员用机器码写的。不是 FORTRAN。不是RATFOR。甚至不是汇编语言。机器码。原始的、朴素的、高深莫测的十六进制数字。直接地。为了不让新一代程序员在对这段辉煌的过去一无所知的情况下长大，我觉得有责任尽我所能地通过代沟来描述一个真正的程序员是如何写代码的。我会叫他梅尔，因为那是他的名字。我第一次见到梅尔是在我去皇家麦克比计算机公司工作时，这家打字机公司现已解散。该公司制造了 LGP-30，这是一种小型、廉价（按当时的标准）鼓式存储器计算机，并且刚刚开始制造 RPC-4000，这是一款经过大幅改进、更大、更好、更快的鼓式存储器计算机。核心成本太高，无论如何都不会留下来。 （这就是为什么你没有听说过这家公司或计算机的原因。）我受雇为这个新奇迹编写 FORTRAN 编译器，Mel 是我探索奇迹的向导。 Mel 不赞成编译器。 “如果一个程序不能重写自己的代码”，他问道，“这有什么好处？”梅尔用十六进制编写了公司拥有的最受欢迎的计算机程序。它在 LGP-30 上运行，并在电脑节目中与潜在客户玩二十一点。它的效果总是戏剧性的。每次展会，LGP-30 的展位都挤满了人，IBM 的销售人员站在旁边互相交谈。这是否真的销售计算机是我们从未讨论过的问题。 Mel 的工作是为 RPC-4000 重新编写二十一点程序。 （端口？那是什么意思？）新计算机有一个一加一的寻址方案，其中每条机器指令，除了操作码和所需操作数的地址外，还有第二个地址，指示在哪里，在转鼓上，找到了下一条指令。用现代的话来说，每一条指令后面都跟着一个 GO TO！把它放在帕斯卡的烟斗里抽烟。 Mel 喜欢 RPC-4000，因为他可以优化他的代码：也就是说，在鼓上定位指令，这样就在一个完成其工作时，下一个刚好到达“读头”并可以立即执行。有一个程序可以完成这项工作，一个“优化汇编程序”，但 Mel 拒绝使用它。 “你永远不知道它会把东西放在哪里”，他解释说，“所以你必须使用单独的常量”。我过了很久才明白这句话。由于梅尔知道每个操作码的数值，并分配了自己的鼓地址，所以他写的每一条指令也可以被认为是一个数值常数。他可以选择较早的“加”指令，如果它有正确的数值，然后乘以它。他的代码不容易被其他人修改。我将 Mel 的手动优化程序与优化汇编程序处理的相同代码进行了比较，并且 Mel 的运行速度总是更快。那是因为“自上而下”的程序设计方法还没有发明出来，反正梅尔也不会使用它。他首先编写了程序循环的最内部部分，因此他们将首先选择鼓上的最佳地址位置。优化汇编程序不够聪明，无法这样做。 Mel 也从未编写过延时循环，即使笨拙的 Flexowriter 需要在输出字符之间延迟才能正常工作。他只是在磁鼓上找到指令，所以当需要时，每个连续的指令都刚好经过读取头；鼓必须再执行一次完整的旋转才能找到下一条指令。他为这个程序创造了一个令人难忘的术语。尽管“最佳”是一个绝对术语，就像“独特”一样，但将其相对化成为常见的口头实践：“不太理想”或“不太理想”或“不是很理想”。 Mel 称最大时延位置为“最悲观”。在他完成了二十一点程序并让它运行后（“甚至初始化器也被优化了”，他自豪地说），他收到了销售部门的变更请求。该程序使用了一个优雅的（优化的）随机数发生器来从“牌组”中洗“牌”和交易，一些销售人员认为这太公平了，因为有时客户会丢失。他们希望梅尔修改程序，以便在控制台上设置感应开关，他们可以改变赔率并让客户获胜。梅尔犹豫了。他觉得这显然是不诚实的，确实如此，而且这侵犯了他作为程序员的个人诚信，确实如此，所以他拒绝这样做。销售总监和梅尔谈了谈，大老板也是，在老板的催促下，还有几个程序员同事。梅尔终于屈服并写了代码，但他把测试倒退了，当感应开关打开时，程序会作弊，每次都赢。梅尔对此很高兴，声称他的潜意识是无法控制的道德，并坚决拒绝修复它。在 Mel 离开公司寻求更环保的 pa$ture$ 后，Big Boss 让我查看代码，看看我是否能找到测试并将其反转。我有些不情愿地同意去看。跟踪 Mel 的代码是一次真正的冒险。我经常觉得编程是一种艺术形式，它的真正价值只有精通同一门艺术的另一个人才能体会到；由于过程的本质，有一些可爱的宝石和辉煌的政变隐藏在人类的视野和钦佩之外，有时是永远隐藏的。只需通读一个人的代码，即使是十六进制的，您也可以了解他的很多信息。我认为梅尔是一个无名的天才。也许当我发现一个没有测试的无辜循环时，我最大的震惊出现了。没有测试。没有任何。常识说它必须是一个闭环，程序将在其中无限循环。然而，程序控制直接通过了它，并安全地从另一边传出。我花了两周的时间才弄明白。 RPC-4000 计算机有一个非常现代的设施，称为索引寄存器。它允许程序员编写一个使用索引指令的程序循环；每次通过，索引寄存器中的数字都会添加到该指令的地址中，因此它将引用一系列中的下一个数据。他只需要每次都增加索引寄存器。梅尔从未使用过它。相反，他会将指令拉入机器寄存器，在其地址上加一，然后将其存储回去。然后他将直接从寄存器中执行修改后的指令。编写循环是为了考虑到这个额外的执行时间——就在这条指令完成时，下一条指令就在鼓的读头下，准备好了。但是循环中没有测试。当我注意到索引寄存器位（位于指令字中地址和操作代码之间的位）被打开时，重要的线索出现了——但 Mel 从未使用过索引寄存器，它一直保持为零。当灯亮起时，它几乎让我失明。他已经将他正在处理的数据定位在内存顶部附近——指令可以寻址的最大位置——因此，在处理完最后一个数据之后，增加指令地址会使其溢出。进位将在操作代码中添加一个，将其更改为指令集中的下一个：跳转指令。果然，下一条程序指令在地址位置0，程序愉快地继续了。我没有与 Mel 保持联系，所以我不知道他是否曾经屈服于自那些已经过去的日子以来席卷编程技术的洪水般的变化。我喜欢认为他没有。无论如何，给我留下了深刻印象的是我不再寻找有问题的测试，并告诉大老板我找不到它。他似乎并不感到惊讶。当我离开公司时，如果你打开正确的感应开关，二十一点程序仍然会作弊，我认为应该是这样。我对破解真正程序员的代码感到不自在。这是黑客界最伟大的英雄史诗之一，无论是自由诗还是非诗。在一些备用图像中，它比有关该主题的所有学术书籍加在一起更能捕捉到关于黑客的美学和心理学的信息。 （但对于相反的观点，请参阅 Real Programmer 的条目。）[1992 后记——作者写道：“最初提交给网络的不是自由诗，也不是任何近似于它的——它是直接的散文风格，非- 合理的段落。在网上反弹时，它显然被修改为现在流行的“自由诗”形式。换句话说，它在网上被黑了。不知何故，这似乎很合适。”作者补充说，他更喜欢“自由诗”版本，而不是他的散文原版……] [1999 年更新：现在知道梅尔的姓氏。 LGP-30 的手册提到“皇家麦克比的 Mel Kaye，他完成了 ACT 1 系统的大部分编程[...]”。] [2001 年：皇家麦克比 LPG-30 原来还有一个声明名声在外。事实证明，气象学家爱德华·洛伦兹 (Edward Lorenz) 在 1961 年发现“蝴蝶效应”和计算混乱时正在 LGP-30 上进行天气模拟。不知何故，这似乎是合适的。]", "note_en": "A recent article devoted to the   macho side of programming made the bald and unvarnished statement:      Real Programmers write in FORTRAN.  Maybe they do now, in this decadent era of Lite beer, hand calculators, and “ user-friendly” software but back in the Good Old Days, when the term “ software” sounded funny and Real Computers were made out of drums and vacuum tubes, Real Programmers wrote in machine code. Not FORTRAN.  Not RATFOR.  Not, even, assembly language. Machine Code. Raw, unadorned, inscrutable hexadecimal numbers. Directly.  Lest a whole new generation of programmers grow up in ignorance of this glorious past, I feel duty-bound to describe, as best I can through the generation gap, how a Real Programmer wrote code. I&#39;ll call him Mel, because that was his name.  I first met Mel when I went to work for Royal McBee Computer Corp., a now-defunct subsidiary of the typewriter company. The firm manufactured the LGP-30, a small, cheap (by the standards of the day) drum-memory computer, and had just started to manufacture the RPC-4000, a much-improved, bigger, better, faster — drum-memory computer. Cores cost too much, and weren&#39;t here to stay, anyway. (That&#39;s why you haven&#39;t heard of the company, or the computer.)  I had been hired to write a FORTRAN compiler for this new marvel and Mel was my guide to its wonders. Mel didn&#39;t approve of compilers.  “ If a program can&#39;t rewrite its own code”, he asked, “ what good is it?”  Mel had written, in hexadecimal, the most popular computer program the company owned. It ran on the LGP-30 and played blackjack with potential customers at computer shows. Its effect was always dramatic. The LGP-30 booth was packed at every show, and the IBM salesmen stood around talking to each other. Whether or not this actually sold computers was a question we never discussed.  Mel&#39;s job was to re-write the blackjack program for the RPC-4000. (Port?  What does that mean?) The new computer had a one-plus-one addressing scheme, in which each machine instruction, in addition to the operation code and the address of the needed operand, had a second address that indicated where, on the revolving drum, the next instruction was located.  In modern parlance, every single instruction was followed by a GO TO! Put   that in Pascal&#39;s pipe and smoke it.  Mel loved the RPC-4000 because he could optimize his code: that is, locate instructions on the drum so that just as one finished its job, the next would be just arriving at the “ read head” and available for immediate execution. There was a program to do that job, an “ optimizing assembler”, but Mel refused to use it.  “ You never know where it&#39;s going to put things”, he explained, “ so you&#39;d have to use separate constants”.  It was a long time before I understood that remark. Since Mel knew the numerical value of every operation code, and assigned his own drum addresses, every instruction he wrote could also be considered a numerical constant. He could pick up an earlier “ add” instruction, say, and multiply by it, if it had the right numeric value. His code was not easy for someone else to modify.  I compared Mel&#39;s hand-optimized programs with the same code massaged by the optimizing assembler program, and Mel&#39;s always ran faster. That was because the “ top-down” method of program design hadn&#39;t been invented yet, and Mel wouldn&#39;t have used it anyway. He wrote the innermost parts of his program loops first, so they would get first choice of the optimum address locations on the drum. The optimizing assembler wasn&#39;t smart enough to do it that way.  Mel never wrote time-delay loops, either, even when the balky Flexowriter required a delay between output characters to work right. He just located instructions on the drum so each successive one was just   past the read head when it was needed; the drum had to execute another complete revolution to find the next instruction. He coined an unforgettable term for this procedure. Although “ optimum” is an absolute term, like “ unique”, it became common verbal practice to make it relative: “ not quite optimum” or “ less optimum” or “ not very optimum”. Mel called the maximum time-delay locations the “ most pessimum”.  After he finished the blackjack program and got it to run (“ Even the initializer is optimized”, he said proudly), he got a Change Request from the sales department. The program used an elegant (optimized) random number generator to shuffle the “ cards” and deal from the “ deck”, and some of the salesmen felt it was too fair, since sometimes the customers lost. They wanted Mel to modify the program so, at the setting of a sense switch on the console, they could change the odds and let the customer win.  Mel balked. He felt this was patently dishonest, which it was, and that it impinged on his personal integrity as a programmer, which it did, so he refused to do it. The Head Salesman talked to Mel, as did the Big Boss and, at the boss&#39;s urging, a few Fellow Programmers. Mel finally gave in and wrote the code, but he got the test backwards, and, when the sense switch was turned on, the program would cheat, winning every time. Mel was delighted with this, claiming his subconscious was uncontrollably ethical, and adamantly refused to fix it.  After Mel had left the company for greener pa$ture$, the Big Boss asked me to look at the code and see if I could find the test and reverse it. Somewhat reluctantly, I agreed to look. Tracking Mel&#39;s code was a real adventure.  I have often felt that programming is an art form, whose real value can only be appreciated by another versed in the same arcane art; there are lovely gems and brilliant coups hidden from human view and admiration, sometimes forever, by the very nature of the process. You can learn a lot about an individual just by reading through his code, even in hexadecimal. Mel was, I think, an unsung genius.  Perhaps my greatest shock came when I found an innocent loop that had no test in it. No test.    None. Common sense said it had to be a closed loop, where the program would circle, forever, endlessly. Program control passed right through it, however, and safely out the other side. It took me two weeks to figure it out.  The RPC-4000 computer had a really modern facility called an index register. It allowed the programmer to write a program loop that used an indexed instruction inside; each time through, the number in the index register was added to the address of that instruction, so it would refer to the next datum in a series. He had only to increment the index register each time through. Mel never used it.  Instead, he would pull the instruction into a machine register, add one to its address, and store it back. He would then execute the modified instruction right from the register. The loop was written so this additional execution time was taken into account — just as this instruction finished, the next one was right under the drum&#39;s read head, ready to go. But the loop had no test in it.  The vital clue came when I noticed the index register bit, the bit that lay between the address and the operation code in the instruction word, was turned on — yet Mel never used the index register, leaving it zero all the time. When the light went on it nearly blinded me.  He had located the data he was working on near the top of memory — the largest locations the instructions could address — so, after the last datum was handled, incrementing the instruction address would make it overflow. The carry would add one to the operation code, changing it to the next one in the instruction set: a jump instruction. Sure enough, the next program instruction was in address location zero, and the program went happily on its way.  I haven&#39;t kept in touch with Mel, so I don&#39;t know if he ever gave in to the flood of change that has washed over programming techniques since those long-gone days. I like to think he didn&#39;t. In any event, I was impressed enough that I quit looking for the offending test, telling the Big Boss I couldn&#39;t find it. He didn&#39;t seem surprised.  When I left the company, the blackjack program would still cheat if you turned on the right sense switch, and I think that&#39;s how it should be. I didn&#39;t feel comfortable hacking up the code of a Real Programmer.\n This is one of hackerdom&#39;s great heroic epics, free verse or no. In afew spare images it captures more about the esthetics and psychology ofhacking than all the scholarly volumes on the subject put together. (But foran opposing point of view, see the entry for   Real Programmer.)\n [1992 postscript — the author writes: “The originalsubmission to the net was not in free verse, nor any approximation to it— it was straight prose style, in non-justified paragraphs. In bouncingaround the net it apparently got modified into the ‘free verse&#39; form nowpopular. In other words, it got hacked on the net. That seems appropriate,somehow.” The author adds that he likes the ‘free-verse&#39; versionbetter than his prose original...]\n [1999 update: Mel&#39;s last name is now known. The manual for the LGP-30refers to “ Mel Kaye of Royal McBee who did the bulk of the programming[...] of the ACT 1 system”.]\n [2001: The Royal McBee LPG-30 turns out to have one other claim tofame. It turns out that meteorologist Edward Lorenz was doing weathersimulations on an LGP-30 when, in 1961, he discovered the “ ButterflyEffect” and computational chaos. This seems, somehow,appropriate.]", "posttime": "2021-08-07 03:18:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "梅尔,story,指令", "title": "梅尔的故事", "title_en": "The Story of Mel", "transed": 1, "url": "http://www.catb.org/~esr/jargon/html/story-of-mel.html", "via": "", "real_tags": ["梅尔", "story", "指令"]}]