[{"category": "", "categoryclass": "", "imagename": "5b38f0b7ba98b9e7cd19697e4cb7ace6.jpeg", "infoid": 1016598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“尽管Facebook在反击利用其平台去人性化和贬低方面取得了一些进展，但这只是必要的开始，”总检察长写道，“尽管Facebook在打击利用其平台进行非人化和贬低方面取得了一些进展，但这只是必要的开始。”“私人聚会、有组织的团体和公职人员继续利用Facebook传播错误信息，并投射针对不同美国群体的仇恨信息。在许多情况下，这些信息会导致在网上对特定个人进行恐吓和骚扰。“。\n报告称，根据反诽谤联盟(Anti-Defamation League)的研究，大约40%的美国人经历过网络骚扰，约70%的举报骚扰的人表示，骚扰来自Facebook或其相关平台。\n因此，总检察长要求Facebook采取更多措施保护用户，并为那些受到恐吓和骚扰的平台参与者提供补偿。\n他们的信加入了一片恐慌的行列，谴责该平台及其首席执行官在遏制仇恨言论和错误信息方面做得太少、太晚，而这些言论和错误信息已经成为许多用户体验的定义。\n今年夏天，美国一些最大的品牌为了回应民权组织的一场运动，从社交媒体平台上撤下了广告。\n抵制包括可口可乐、百思买、福特和威瑞森等大型主流品牌。飞机上的其他品牌包括阿迪达斯、Ben&amp；Jerry‘s、锐步、REI、巴塔哥尼亚和面包车。\n虽然一些公司撤回广告可能是别有用心的，但该公司面临的压力一直在增加，要求其对其平台上的挑衅者采取更多行动。\n面对所有这些批评，扎克伯格一直坚定不移地拒绝让步(即使他的逻辑变得越来越痛苦)。\n总检察长同意这些其他评估。“到目前为止，你采取的措施还不够，”律师们写道。“有了你们可以支配的大量资源，我们相信你们可以做很多事情来防止Facebook被用作传播错误信息和歧视的工具，并防止你们的用户在你们的平台上成为骚扰和恐吓的受害者。”\n从加利福尼亚州到哥伦比亚特区，各州政府法律部门的领导人对该公司提出了批评，并呼吁其领导层遵循其民权审计(Civil Rights Audit)中强调的步骤，加强对民权和打击虚假信息的承诺。\nFacebook也可能开始听取批评人士的意见。今天晚上早些时候，该公司删除了唐纳德·特朗普总统的一篇帖子，其中包括关于新冠肺炎疫情的错误信息。\n这一决定可能标志着Facebook的一个新方向，该公司已经采取了渐进的措施，与人们认为公司故意对总统的潜在有害行为睁一只眼闭一只眼的看法保持距离。\n脸书的丽兹·布尔乔亚在提供给TechCrunch的一份声明中表示：“这段视频包括虚假声明，称一群人不受新冠肺炎的影响，这违反了我们关于COVID有害错误信息的政策。”\nFacebook也对司法部长做出了回应。在向NBC新闻发布的一份声明中，Facebook发言人丹尼尔·罗伯茨(Daniel Roberts)表示，仇恨言论是为了确保人们在互联网上感到安全。\n罗伯茨在一份声明中告诉该网络：“仇恨言论在整个互联网上都是一个问题，我们正在努力通过投资数十亿美元将仇恨挡在我们的平台上，打击错误信息，从而使Facebook尽可能安全。”", "note_en": "“Although Facebook has made some progress in counteracting the use of its platform to dehumanize and demean, that is just the beginning of what is necessary,” the attorneys general wrote. “Private parties, organized groups, and public officials continue to use Facebook to spread misinformation and project messages of hate against different groups of Americans. In many cases, these messages lead to intimidation and harassment of particular individuals online.”\n Roughly 40 percent of Americans have experienced online harassment, according to study by the Anti-Defamation League and around 70 percent of those reporting harassment said it came on Facebook or its associated platforms, according to the report.\n  So the attorneys general asked Facebook to take more steps to protect users and provide redress for those platform participants who are victims of intimidation and harassment.\n Their letter joins a chorus of consternation that has arisen to chastise the platform and its chief executive for doing too little, too late to stem the hate speech and misinformation that has come to define the platform’s experience for many users.\n Over the summer,  some of the biggest brands in the US pulled advertising from social media platforms in response to a campaign from civil rights organizations.\n That boycott includes huge mainstream brands including Coca-Cola, Best Buy, Ford and Verizon. Other brands on board include Adidas, Ben &amp; Jerry’s, Reebok, REI, Patagonia and Vans.\n While some of the companies may have ulterior motives for pulling advertising, pressure has been growing on the company to take more action against the provocateurs on its platform.\n In the face of all this criticism, Zuckerberg has been steadfast in his refusal to budge ( even as his logic becomes increasingly tortured).\n  The attorneys general agree with these other assessments. “[The] steps you have taken thus far have fallen short,” the attorneys wrote. “With the vast resources at your disposal, we believe there is much mroe that you can do to prevent the use of Facebook as a vehicle for misinformation and discrimination, and to prevent your users from being victimized by harassment and intimidation on your platforms.”\n The leaders of the legal arms of state governments from California to the District of Columbia took the company to task and called on its leadership to follow the steps highlighted in its Civil Rights Audit to strengthen its commitment to civil rights and fighting disinformation.\n Facebook also may be beginning to listen to its critics. Earlier this evening the company  took down a post from President Donald Trump that included misinformation about the COVID-19 epidemic.\n  It’s a decision that could signal a new direction for Facebook, which has taken  incremental steps to  distance itself from the perception that the company deliberately turns a blind eye to the president’s potentially harmful behavior.\n “This video includes false claims that a group of people is immune from COVID-19 which is a violation of our policies around harmful COVID misinformation,” Facebook’s Liz Bourgeois said in a statement provided to TechCrunch.\n Facebook also had a response for the attorneys general. In a statement  issued to NBC News, Facebook spokesperson Daniel Roberts said that hate speech was working to ensure people feel safe on the internet.\n “Hate speech is an issue across the internet and we are working to make Facebook as safe as possible by investing billions to keep hate off our platform and fight misinformation,” Roberts told the network in a statement.", "posttime": "2020-08-06 11:09:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,打击,general", "title": "\n来自20个州的总检察长呼吁Facebook采取更多措施打击歧视、虚假信息和骚扰", "title_en": "\n\t\t\t\tAttorneys general from twenty states call on Facebook to do more to fight discrimination, disinformation and harrassment\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/05/attorneys-general-from-twenty-states-call-on-facebook-to-do-more-to-fight-discrimination-disinformation-and-harrassment/", "via": "", "real_tags": ["facebook", "打击", "general"]}, {"category": "", "categoryclass": "", "imagename": "72a60dd0c69485de0888a7bbbb11417f.png", "infoid": 1016597, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "六周前，我用电子邮件发送了我的私人电子邮件列表，上面有一个购买我的新书的秘密链接。\n它们甚至还没有正式发布，但它们已经卖出了超过25万美元。\n每本限量版精装本我都做了5000本，但现在已经卖完了。\n我承认，赚25万美元让我高兴得离谱。我的期望值远远低于这个数字，所以这是一个很大的惊喜。好几天来，我的脚步都很踏实。\n然后我想了想怎么处理这笔钱。没有我想买的东西。我应该把它存入投资账户吗？嗯。为了什么目的？我不想要更多的钱。\n所以，我决定把它捐给慈善机构。哪个慈善机构？我想拯救最多的生命。所以我让GiveWell来决定。\n昨天我把25万美元全部电汇给了防治疟疾基金会。这将购买12.5万顶疟疾蚊帐，保护约22.5万人，避免约6.5万例疟疾病例，防止约125人死亡。\n后来，一位朋友提醒我，我刚刚重复了我的“232沙币”的故事，如果感兴趣的话就去看看吧。\n你现在可以直接从我这里买书了。再过几个月他们就不会在其他地方买到了。\n“你的音乐和人”是一种通过创造性、体贴、足智多谋和联系的方式让你的作品走向世界的哲学。\n“地狱是或不是”是关于什么是值得做的，修正错误的想法，以及让事情发生的想法的集合。", "note_en": "Six weeks ago I emailed my  private email list with a secret link to buy my new books.\n They’re not even officially released yet, but they’ve already sold over $250,000.\n I made 5000 limited edition hardcover copies of each, but those have sold out now.\n I’ll admit, it made me ridiculously happy to make $250,000.\tI was expecting way less than that, so it was a big surprise.\tI had a spring in my step for days.\n Then I thought about what to do with the money.\tThere’s nothing I want to buy.\tShould I put it in an investment account?\tEh.\tFor what purpose?\tI  don’t want more money.\n So, I decided to donate it to charity.\tWhich charity?\tI want to save the most lives.\tSo I let  GiveWell decide.\n Yesterday I wired the entire $250,000 to the  Against Malaria Foundation.\tThat will buy 125,000 malaria nets, protecting ~225,000 people, averting ~65,000 cases of malaria, preventing ~125 deaths.\n  Afterwards, a friend reminded me that I had just repeated my “ 232 sand dollars” story, so  go read that if interested.\n You can buy the books now, directly from me.\tThey won’t be available anywhere else for a couple more months.\n “  Your Music and People” is a philosophy of getting your work to the world by being creative, considerate, resourceful, and connected.\n “  Hell Yeah or No” is a collection of thoughts around what’s worth doing, fixing faulty thinking, and making things happen.", "posttime": "2020-08-06 10:57:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拯救,books,疟疾", "title": "卖出了25万美元的书。25万美元用于拯救生命。", "title_en": "$250k books sold. $250k to save lives.", "transed": 1, "url": "https://sive.rs/250k", "via": "", "real_tags": ["拯救", "books", "疟疾"]}, {"category": "", "categoryclass": "", "imagename": "ce65c382b5edeba4dde3fd0ffcd76cfe.jpg", "infoid": 1016596, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名拥有美国和哥斯达黎加双重国籍的公民和一名哥斯达黎加公民都居住在哥斯达黎加，他们因在暗网上非法销售阿片类药物而被哥伦比亚特区的一个联邦大陪审团起诉。\n这份七项罪名的起诉书指控44岁的美国和哥斯达黎加公民大卫·布莱恩·佩特(David Brian Pate)和38岁的哥斯达黎加公民何塞·路易斯·冯·侯(Jose Luis Fung Hou)与他人合谋分发受控物质、分发受控物质、与人合谋进口受控物质、合谋洗钱和洗钱。\n司法部刑事司代理助理司法部长布莱恩·C·拉比特(Brian C.Rabbitt)说，“正如起诉书所称，被告躲在暗网和加密货币后面，从向美国出售非法阿片类药物中获利，从而助长了我们致命的阿片类药物流行。”“幸运的是，通过与我们在美国各地和海外的执法伙伴合作，我们能够发现这个黑暗的阿片类药物市场，并将责任人绳之以法。”\n哥伦比亚特区代理联邦检察官Michael Sherwin表示：“这些指控是对全球毒贩的警告，无论是暗网还是虚拟货币的笼罩都不能掩盖他们的非法活动，不受美国执法部门的警惕，我们坚定地致力于打击阿片类药物滥用问题，并突破犯罪分子利用复杂的网络使能的障碍来隐藏他们的活动。”\n美国国税局刑事调查(CI)华盛顿特区办事处的主管特工凯利·R·杰克逊(Kelly R.Jackson)表示：“阿片类药物的流行是一场危机，使这个国家的许多家庭陷入瘫痪。”“这个国际组织从人们的毒瘾中获利，在他们本已脆弱的时候再次受害。”这个组织故意分发不含安全添加剂的阿片类药物，防止吸食毒品。几年前，当毒贩和贩子转移到暗网，并开始使用虚拟货币来隐藏和扩大他们的网络时，CI也将我们的游戏场转移到了暗网，将这样的组织绳之以法。“。\n美国缉毒局(DEA)华盛顿野战部主管杰西·R·方(Jesse R.Fong)表示：“今天的案件是一个很好的例子，说明DEA如何渗透到暗网中，并与我们的执法伙伴一起证明，每一名试图销售这些致命毒品的罪犯都在法律的管辖范围内。”\n起诉书指控佩特非法购买毒品，包括奥施康定和吗啡丸，主要是从哥斯达黎加的一名药剂师冯那里购买。佩特会向冯洗钱购买毒品。然后，佩特在包括丝绸之路和AlphaBay在内的许多黑暗网络市场上出售这些毒品，以换取比特币。他在黑暗网络市场、在线论坛和比特币交易上使用了各种在线绰号，包括“BuyersClub”。Pate打广告说，他在出售“旧配方”。\n起诉书进一步指控，佩特的暗网销售涉及他从哥斯达黎加以药丸的形式向美国的同谋再发货人发送大量毒品，这些毒品通常隐藏在马拉卡等旅游纪念品中。然后，佩特会向再发货人发送一份客户订单清单，其中包括客户的姓名、客户的送货地址以及他们购买的药丸数量。再发货人制作了较小的药丸包装，然后邮寄给客户。进入Pate在暗网市场上的账户。他们的客户为这些暗网市场销售向Pate支付了超过23903枚比特币。此外，同谋还以比特币和国际电汇的形式洗钱支付。\n诉状中的指控仅仅是指控，在法庭排除合理怀疑证明有罪之前，被告被推定为无罪。\n美国国税局-CI网络犯罪调查组、DEA和美国邮政检查局对此案进行了调查，司法部国际事务办公室和哥斯达黎加当局提供了协助。\n此案由刑事部门计算机犯罪和知识产权科的审判检察官C.Alden Pelker，哥伦比亚特区检察官办公室的助理美国检察官Zia M.Faruqui和Laura Crane，律师助理专家Brian Rickers和Teesha Tobias，以及法律助理Jessica McCormick处理，并由前美国助理检察官Youli Lee和Kara Traster，以及律师助理专家Toni Anne Donato提供额外的协助。这起案件由刑事部门计算机犯罪和知识产权科的审判检察官C.Alden Pelker，哥伦比亚特区联邦检察官办公室的助理检察官Zia M.Faruqui和Laura Crane，律师助理专家Brian Rickers和Teesha Tobias，以及法律助理Jessica McCormick提供额外的协助。\n2020年是司法部成立150周年。我们可以在www.Justice.gov/Celebrating150周年网站上了解更多关于我们机构的历史。", "note_en": "A dual U.S.-Costa Rican citizen and a Costa Rican citizen, both of whom reside in Costa Rica, were indicted by a federal grand jury in the District of Columbia for their illegal sales of opioids on the darknet.\n The seven-count indictment charged David Brian Pate, 44, a U.S. and Costa Rican citizen, and Jose Luis Fung Hou, 38, a Costa Rican citizen, with counts of conspiring with persons to distribute controlled substances, distribution of controlled substances, conspiring with persons to import controlled substances, conspiring to launder money, and laundering of monetary instruments.\n “As alleged in the indictment, the defendants helped fuel our deadly opioid drug epidemic by hiding behind the darknet and cryptocurrency to profit from the sale of illicit opioids into the United States,” said Acting Assistant Attorney General Brian C. Rabbitt of the Justice Department’s Criminal Division.  “Fortunately, by working with our law enforcement partners across the United States and overseas, we were able to uncover this darknet opioid market and bring to justice those responsible.”\n “These charges are a warning to drug traffickers worldwide that neither the shroud of the darknet or of virtual currency can hide their illegal activities from the vigilance of U.S. law enforcement,” said Acting U.S. Attorney Michael Sherwin for the District of Columbia.  “We are firmly committed to combatting the problem of opioid abuse and breaking through sophisticated cyber-enabled barriers employed by criminals to hide their activities.”\n “The opioid epidemic is a crisis crippling many families in this country,” said Special Agent in Charge Kelly R. Jackson of the IRS Criminal Investigation (CI) Washington D.C. Field Office.  “This international group profited off of people’s addictions, revictimizing them when they were already vulnerable. This group purposely distributed opioids that did not contain a safety additive and prevented inhalation of the drug.  Years ago when drug dealers and traffickers moved to the darknet and started using virtual currency to conceal and expand their network, CI also moved our playing field to the darknet to bring groups like this to justice.”\n “Today’s case is a great example of how the DEA has infiltrated the darknet and, together with our law enforcement partners, proven that every criminal attempting to sell these deadly drugs is within the reach of the law,” said Special Agent in Charge Jesse R. Fong of the U.S. Drug Enforcement Administration’s (DEA) Washington Field Division.\n The indictment alleges that Pate illegally purchased narcotics, including OxyContin and morphine pills, primarily from Fung, a pharmacist in Costa Rica.  Pate would launder payments to Fung to purchase narcotics.  Pate then sold these narcotics on numerous darknet markets, including Silk Road and AlphaBay, in exchange for bitcoin.  Pate utilized various online monikers including “buyersclub” on darknet markets, online forums, and bitcoin exchanges.  Pate advertised that he was selling the “old formula” of OxyContin, which did not contain tamper-resistant features such as a crush-proof feature that prevented a user from inhaling or injecting the pills after pulverizing them.\n The indictment further alleges that Pate’s darknet sales involved him sending bulk shipments of narcotics in pill form from Costa Rica, often concealed in tourist souvenirs such as maracas, to co-conspirator re-shippers in the United States.  Pate would then send the re-shippers a list of customer orders, which included customer’s names, the customer’s shipping address, and the quantity of pills they purchased.  The re-shippers created smaller packages of pills, which they then mailed to the customer.  Once the shipments were received by the customer, the darknet market would release funds in bitcoin, which were held in escrow until the transaction was completed, into Pate’s account on the darknet market.  Customers paid Pate over 23,903 bitcoin for these darknet market sales.  The co-conspirators also laundered payments in the form of bitcoin and international wire transfers.\n The charges in the pleadings are merely allegations, and the defendant is presumed innocent until proven guilty beyond a reasonable doubt in a court of law.\n IRS-CI Cyber Crimes Unit, DEA, and the U.S. Postal Inspection Service investigated this case.  The Justice Department’s Office of International Affairs and Costa Rican authorities provided assistance.\n The case is being handled by Trial Attorney C. Alden Pelker of the Criminal Division’s Computer Crime and Intellectual Property Section, Assistant U.S. Attorneys Zia M. Faruqui and Laura Crane of the U.S. Attorney’s Office for the District of Columbia, Paralegal Specialist Brian Rickers and Teesha Tobias, and Legal Assistant Jessica McCormick.  Additional assistance has been provided by former Assistant U.S. Attorneys Youli Lee and Kara Traster, and Paralegal Specialist Toni Anne Donato.\n The year 2020 marks the 150th anniversary of the Department of Justice.  Learn more about the history of our agency at  www.Justice.gov/Celebrating150Years.", "posttime": "2020-08-06 10:56:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,暗网,darknet", "title": "美国暗网供应商和哥斯达黎加药剂师被起诉", "title_en": "American Darknet Vendor and Costa Rican Pharmacist Charged", "transed": 1, "url": "https://www.justice.gov/opa/pr/american-darknet-vendor-and-costa-rican-pharmacist-charged-narcotics-and-money-laundering", "via": "", "real_tags": ["美国", "暗网", "darknet"]}, {"category": "", "categoryclass": "", "imagename": "8d62ae0cc7a3671beb3cf425c8d9e08c.jpg", "infoid": 1016595, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开罗-贝鲁特灾难的倒计时始于六年前，当时一艘陷入困境的俄罗斯租赁货船意外停靠在贝鲁特的港口。\n这艘船被债务拖累，由心怀不满的水手组成船员，船体上有一个小洞，这意味着水必须不断地抽出。它还携带了一批易挥发的货物，超过2000吨硝酸铵，这是一种用于制造化肥和炸弹的可燃材料，目的地是莫桑比克。\n这艘船，罗瑟斯号，从来没有到过。由于卷入了一场金融和外交纠纷，它被租下它的俄罗斯商人抛弃了。硝酸铵被转移到贝鲁特的一个码头仓库，在那里将持续多年，直到周二，黎巴嫩官员表示，硝酸铵发生爆炸，引发冲击波，造成130多人死亡，另有5000人受伤。\n周三，黎巴嫩、俄罗斯和乌克兰的报道中出现了这艘船及其致命货物的故事。故事讲述了一个惨淡的故事，讲述了法律战、财务纠纷，以及显然是长期疏忽，是如何为一场可怕的事故埋下伏笔的，这场事故摧毁了中东最亲切的城市之一。\n“我吓坏了，”70岁的退休俄罗斯船长鲍里斯·普罗科谢夫(Boris Prokoshev)在俄罗斯索契接受电话采访时谈到了这起事故。2013年，硝酸铵就是从索契出发前往贝鲁特的。索契是一个黑海度假小镇，就在海边。\n在黎巴嫩，公众的愤怒集中在当局的疏忽上，他们意识到在贝鲁特码头的一个仓库中储存2750吨硝酸铵构成的危险，但没有采取行动。\n黎巴嫩议员萨利姆·奥恩(Salim Aoun)在社交媒体上发布的公共记录显示，从2014年到2017年，高级海关官员至少六次写信给黎巴嫩法院，寻求如何处理硝酸铵的指导。\n黎巴嫩海关总署署长沙菲克·马雷(Shafik Marei)在2016年5月写道，“鉴于将这批货物存放在不合适的气候下会带来严重危险，我们再次要求海事机构立即再出口这些材料。”\n海关官员提出了一些解决方案，包括将硝酸铵捐赠给黎巴嫩军队，或者将其出售给私人拥有的黎巴嫩炸药公司。一年后，马雷先生又发了第二封类似的信。记录显示，司法机构没有对他的任何请求做出回应。\n悬挂摩尔多瓦国旗的Rhosus号于2013年11月抵达贝鲁特，两个月前，它离开了格鲁吉亚的黑海港口巴统。这艘船是由居住在塞浦路斯的俄罗斯商人伊戈尔·格雷丘什金(Igor Grechushkin)租用的。\n船长普罗科谢夫在前一名船员因拖欠工资而叛变后，在土耳其加入了这艘船。船长说，格雷丘什金拿到了100万美元，让他把高浓度硝酸铵运到莫桑比克的贝拉港。\n据代表该船船员的黎巴嫩律师事务所Baroudi and Partners在周三发布的一份声明中称，这些硝酸铵是由莫桑比克国际银行为莫桑比克Fábrica de explosivos de Moçica公司购买的。该公司生产商业炸药。Baroudi and Partners是一家代表该船船员的黎巴嫩律师事务所。\n格雷丘什金当时在塞浦路斯，正在通过电话联系，他告诉船长，他没有足够的钱支付通过苏伊士运河的费用。因此，他派船去贝鲁特，通过额外装载一批重型机械来赚取一些现金。\n但在贝鲁特，机器装不下这艘船，这艘船大约有三四十年的历史，船长说。\n然后黎巴嫩官员发现这艘船不适合出海，并以未能支付港口停泊费和其他费用为由扣押了这艘船。当这艘船的供应商试图联系格雷丘什金，要求他支付燃料、食物和其他必需品的费用时，记者无法联系到他，因为他显然已经放弃了租来的船。\n六名船员已经回国，但黎巴嫩官员强迫船长和三名乌克兰船员留在船上，直到债务问题得到解决。据他们的律师说，黎巴嫩的移民限制阻止船员离开船只，他们很难获得食物和其他补给。\n船长普罗科谢夫说，黎巴嫩港口官员同情饥饿的船员，并提供食物。但是，他补充说，他们没有表现出对船上高度危险的货物的任何担忧。“他们只是想要我们欠的钱，”他说。\n他们的困境在乌克兰引起了关注，那里的新闻报道称被困船员是“人质”，被困在一艘废弃的船上。\n船长是一名俄罗斯公民，他向俄罗斯驻黎巴嫩大使馆寻求帮助，但得到的只是一些尖刻的评论，比如，“你认为普京总统会派特种部队把你救出来吗？”他回忆道。\n越来越绝望的是，普罗科谢夫卖掉了船上的部分燃料，并用所得资金聘请了一个法律团队，根据该律师事务所的声明，这些律师还警告黎巴嫩当局，这艘船“随时都有沉没或爆炸的危险”。\n2014年8月，一名黎巴嫩法官以同情为由下令释放船员，格雷舒什金重新浮出水面后，支付了他们返回乌克兰的旅费。\n船员的离开让黎巴嫩当局负责这艘船的致命货物，这些货物被转移到一个名为Hangar 12的储存设施，直到周二发生爆炸，这些货物一直留在那里。\n当硝酸铵与燃料混合时，会产生一种通常用于建筑和采矿的强力炸药。但它也被恐怖分子用来制造爆炸装置，如1995年俄克拉荷马州炸弹袭击者蒂莫西·麦克维(Timothy McVeigh)和伊斯兰国(Islamic State)。\n硝酸铵的销售在美国受到监管，许多欧洲国家要求它与其他物质混合，以降低其效力。\n贝鲁特港口总经理Hassan Koraytem在接受采访时说，海关和安全官员一再要求黎巴嫩法院转移易挥发的材料。“但什么也没发生，”他说。\n“我们被告知货物将在拍卖会上出售，”他补充说。“但拍卖从未发生，司法机构也从未采取行动。”\n掌管港口长达17年之久的科莱特姆说，当他周二第一次听到爆炸声时，他认为可能是空袭。\n他说，在第二次更大的爆炸之前，他“不知道”是什么导致了储存设施的最初火灾。他的四名员工在爆炸中丧生。“现在不是指责的时候，”他说。“我们正生活在一场全国性的灾难中。”\n但对许多黎巴嫩人来说，这个故事是统治阶级长期管理不善的又一迹象，他们今年将国家带入了一场惩罚性的经济危机。\n普罗克谢夫说，他仍被拖欠6万美元的工资。他把责任归咎于格雷丘什金和黎巴嫩官员，后者坚持先扣押船只，然后再把硝酸铵留在港口，“而不是把它撒在他们的田里”。\n“他们本来可以有非常好的收成，而不是巨大的爆炸，”他说。\n至于罗苏斯号，普罗科谢夫说，他从驶往贝鲁特的朋友那里了解到，这艘船在2015年或2016年装上水后在港口沉没。\n他补充说，听到这个消息后，他唯一的惊讶是它没有更早地下降。\n德克兰·沃尔什(Declan Walsh)开罗报道，安德鲁·希金斯(Andrew Higgins)莫斯科报道。报道由Hwaida Saad在贝鲁特，Nada Rashwan在开罗和Christian Triebert在纽约贡献。", "note_en": "CAIRO — The countdown to catastrophe in Beirut started six years ago when a troubled, Russian-leased cargo ship made an unscheduled stop at the city’s port.\n The ship was trailed by debts, crewed by disgruntled sailors and dogged by a small hole in its hull that meant water had to be constantly pumped out. And it carried a volatile cargo, more than 2,000 tons of ammonium nitrate, a combustible material used to make fertilizers — and bombs — that was destined for Mozambique.\n The ship, the Rhosus, never made it. Embroiled in a financial and diplomatic dispute, it was abandoned by the Russian businessman who had leased it. And the ammonium nitrate was transferred to a dockside warehouse in Beirut, where it would languish for years, until Tuesday, when Lebanese officials said it exploded,  sending a shock wave that killed more than 130 people and wounded another 5,000.\n The story of the ship and its deadly cargo, which emerged on Wednesday in accounts from Lebanon, Russia and Ukraine, offered a bleak tale about how legal battles, financial wrangling and, apparently, chronic negligence, set the stage for  a horrific accident that devastated one of the Middle East’s most fondly regarded cities.\n “I was horrified,” said Boris Prokoshev, the ship’s 70-year-old retired Russian captain, about the accident, speaking in a phone interview from Sochi, Russia, a Black Sea resort town just up the coast from where the ammonium nitrate began its journey to Beirut in 2013.\n In Lebanon, public rage focused on the negligence of authorities who were aware of the danger posed by the storage of 2,750 tons of ammonium nitrate in a warehouse on the Beirut docks, yet failed to act.\n Senior customs officials wrote to the Lebanese courts at least six times from 2014 to 2017, seeking guidance on how to dispose of the ammonium nitrate, according to public records  posted to social media by a Lebanese lawmaker, Salim Aoun.\n “In view of the serious danger posed by keeping this shipment in the warehouses in an inappropriate climate,” Shafik Marei, the director of Lebanese customs, wrote in May 2016, “we repeat our request to demand the maritime agency to re-export the materials immediately.”\n The customs officials proposed a number of solutions, including donating the ammonium nitrate to the Lebanese Army, or selling it to the privately owned Lebanese Explosives Company. Mr. Marei sent a second, similar letter a year later. The judiciary failed to respond to any of his pleas, the records suggested.\n   The Rhosus, which flew the flag of Moldova, arrived in Beirut in November 2013, two months after it left the Black Sea port of Batumi, in Georgia. The ship was leased by Igor Grechushkin, a Russian businessman living in Cyprus.\n Mr. Prokoshev, the captain, joined the ship in Turkey after a mutiny over unpaid wages by a previous crew. Mr. Grechushkin had been paid $1 million to transport the high-density ammonium nitrate to the port of Beira in Mozambique, the captain said.\n The ammonium nitrate was purchased by the International Bank of Mozambique for Fábrica de Explosivos de Moçambique, a firm that makes commercial explosives, according to Baroudi and Partners, a Lebanese law firm representing the ship’s crew, in a statement issued on Wednesday.\n Mr. Grechushkin, who was in Cyprus at the time and communicating by telephone, told the captain he didn’t have enough money to pay for passage through the Suez Canal. So he sent the ship to Beirut to earn some cash by taking on an additional cargo of heavy machinery.\n But in Beirut, the machinery would not fit into the ship, which was about 30 or 40 years old, the captain said.\n  Then Lebanese officials found the ship unseaworthy and impounded the vessel for failing to pay the port docking fees and other charges. When the ship’s suppliers tried to contact Mr. Grechushkin for payment for fuel, food and other essentials, he could not be reached, having apparently abandoned the ship he had leased.\n Six crew members returned home, but Lebanese officials forced the captain and three Ukrainian crew members to remain on board until the debt issue was solved. Lebanese immigration restrictions prevented the crew from leaving the ship, and they struggled to obtain food and other supplies, according to their lawyers.\n Mr. Prokoshev, the captain, said Lebanese port officials took pity on the hungry crew and provided food. But, he added, they didn’t show any concern about the ship’s highly dangerous cargo. “They just wanted the money we owed,” he said.\n Their plight attracted attention back in Ukraine, where news accounts described the stranded crew as “hostages,” trapped aboard an abandoned ship.\n The captain, a Russian citizen, appealed to the Russian Embassy in Lebanon for help, but got only snippy comments like, “Do you expect President Putin to send special forces to get you out,” he recalled.\n Increasingly desperate, Mr. Prokoshev sold some of the ship’s fuel and used the proceeds to hire a legal team, and these lawyers also warned the Lebanese authorities that the ship was in danger “of sinking or blowing up at any moment,” according to the law firm’s statement.\n A Lebanese judge ordered the release of the crew on compassionate grounds in August 2014, and Mr. Grechushkin, having resurfaced, paid for their passage back to Ukraine.\n The crew’s departure left the Lebanese authorities in charge of the ship’s deadly cargo, which was moved to a storage facility known as Hangar 12, where it remained until the explosion on Tuesday.\n  Ammonium nitrate, when mixed with fuel, creates a powerful explosive commonly used in construction and mining. But it has also been used to make explosive devices deployed by terrorists such as the 1995 Oklahoma bomber, Timothy McVeigh, and the Islamic State.\n Sales of ammonium nitrate are regulated in the United States, and many European countries require it to be mixed with other substances to make it less potent.\n The general manager of Beirut’s port, Hassan Koraytem, said in an interview that customs and security officials made repeated requests to Lebanon’s courts to have the volatile material moved. “But nothing happened,” he said.\n “We were told the cargo would be sold in an auction,” he added. “But the auction never happened and the judiciary never acted.”\n Mr. Koraytem, who has been in charge of the port for 17 years, said that when he first heard the blast on Tuesday, he figured it might be an air attack.\n He had “no idea” what caused the initial fire at the storage facility that preceded the second, far larger blast, he said. Four of his employees died in the explosion. “This is not the time to blame,” he said. “We are living a national catastrophe.”\n But for many Lebanese, the story is another sign of the chronic mismanagement of a ruling class that steered the country into a punishing economic crisis this year.\n Mr. Prokshev, who said he is still owed $60,000 in wages, placed the fault with Mr. Grechushkin, and with Lebanese officials, who insisted on first impounding the boat, and then on keeping the ammonium nitrate in the port “instead of spreading it on their fields.”\n “They could have had very good crops instead of a huge explosion,” he said.\n As for the Rhosus, Mr. Prokoshev learned from friends who sailed to Beirut that it had sunk in the harbor in 2015 or 2016, after taking water on board, he said.\n His only surprise on hearing this, he added, was that it had not gone down sooner.\n Declan Walsh reported from Cairo, and Andrew Higgins from Moscow. Reporting was contributed by Hwaida Saad in Beirut, Nada Rashwan in Cairo and Christiaan Triebert in New York.", "posttime": "2020-08-06 10:56:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "带到,brought,黎巴嫩", "title": "一艘把硝酸铵带到贝鲁特的船", "title_en": "Ship that brought ammonium nitrate to Beirut", "transed": 1, "url": "https://www.nytimes.com/2020/08/05/world/middleeast/beirut-explosion-ship.html", "via": "", "real_tags": ["带到", "brought", "黎巴嫩"]}, {"category": "", "categoryclass": "", "imagename": "3f907ae08cca9ae60c3faa299998d439.jpeg", "infoid": 1016593, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“良好决策的关键不在于知识。它是理解。我们在前者游泳。我们极度缺乏后者。“--马尔科姆·格拉德威尔，”眨眼：没有思考的思考的力量“。\n零售业经常重复的口头禅是：零售业的成功在于小细节。第一印象很重要。好市多对其客户群的理解是：性价比高的内容才是王道。\n亚马逊代表着顾客的便利。IMAX影院崇尚整体体验。Costco不言而喻的口头禅-无聊是美丽的。\n当零售商为商店的外观和布局等营销细节而焦头烂额时，好市多却做了相反的事情。Costco商店给人的第一印象是一个朴实无华、朴实无华的香草仓库。这些货架上的内容是好市多与众不同的地方。典型的非营利性商业模式是无利可图的成本服务。Costco的口头禅是每件优质产品的成本加价不能超过10%到15%。相比之下，沃尔玛的这一比例接近24%，超市为30%，家得宝和劳氏为35%。\n好市多对其客户群的理解是：精挑细选，高质量的产品胜过众多的产品。\n零售界的一个不言而喻的假设是：成本意识与可支配收入呈负相关。换句话说，你的预算越紧张，你的成本意识就越强。好市多挖掘的现实不止于此：节俭消费是“创造财富的艺术”的核心。\n真相：每个人都喜欢交易，它会释放愉悦荷尔蒙。如果这笔交易是关于一种很棒的产品，那就是加倍的甜头。当选择的少数几种产品已经是市场上众多产品中最好的产品时-在过道上做出的决定就少了一个。精神上的便利是一个额外的好处。\n3.传统智慧：趁热打铁。当所有顾客都在商店里的时候赚钱。\n好市多赚钱的商业模式：向进门的人收费。排他性孕育忠诚。\n世界正在意识到这种由亚马逊和Netflix普及的订阅模式。好市多多年来一直在做这件事。好市多完善了榨取沉没成本谬误的艺术-你是会员，为什么要四处选购呢？会员费从每年60美元起。90%的续费都能赚到钱。\n事实上，Costco卖东西赚的钱不多，它的会员数量高达数十亿！算术令人震惊--“截至今年(2019年)…，付费会员已超过5300多万。。这意味着Costco有望在2019年从会员制中获得43亿美元的收入，约占其全年净收入的110%。\n锦上添花，三分之一的Costco会员支付双倍的入门级会员费，并获得2%的现金返还！谈到信贷密集型供应业务的资本成本更低。在衰退的经济中很有用。\n进入商店的强制会员资格创造了更多的东西-排他性可以培养忠诚度。但会员制不仅仅是忠诚，它是好市多的商业模式。\nCostco的商业模式是激光聚焦在哪里找到成本节约。成本节约体现在销售产品的激光微薄利润率上。而且这不在员工的底线之内。令人耳目一新，与众不同。而且它显示了。好市多自1997年以来只有两位CEO。作为参考，标准普尔500指数成份股公司首席执行官的任期中值为5年。\n5.传统智慧：顾客珍视便利。亚马逊的一天发货就是一个很好的例子。\n好市多(Costco)的智者反驳：顾客享受迷宫狩猎。它会释放愉悦荷尔蒙。\n好市多的过道标签贴得不好是有原因的。和人类一样，意想不到的发现会刺激大脑的杏仁核(快乐的部分)。在Costco，给顾客带来惊喜是仓库设计中的一种刻意策略。\n人生之旅是关于假设的--隐含的或明确的。同样，商业成功取决于围绕假设量身定做的商业模式。好市多深思熟虑的颠覆传统智慧的策略获得了丰厚的回报。\n发现好市多令人叹为观止的相反假设是一场迷宫狩猎-隐藏在显而易见的令人愉悦的洞察力。", "note_en": "“The key to good decision making is not knowledge. It is understanding. We are swimming in the former. We are desperately lacking in the latter.”   ― Malcolm Gladwell,  Blink: The Power of Thinking Without Thinking\n   The oft repeated mantra in retail: success in retail is in the small details. First impressions are important. Costco ‘s understanding of its customer base: Great content at cost effective prices is king.\n Amazon stands for customer’s convenience. IMAX theaters espouse holistic experience. Costco unspoken mantra — boring is beautiful.\n While retailers sweat the small marketing details of look and feel of the store and its layout, Costco does the opposite. The first impressions of a Costco store is a no-frills, plain vanilla warehouse. Content in those shelves is where Costco distinguishes itself. Typical non-profits business model is service at cost without profits. Costco mantra is not to exceed 10% to 15% markup on costs for every quality product. For comparison,  it’s nearly 24% at Walmart, 30% at supermarkets, and 35% at Home Depot and Lowe’s.\n  Costco’s understanding of its customer base: Chosen few, quality products is better than multitude of many.\n The unspoken assumption in retail world: Cost consciousness is inversely correlated to disposable income. In other words, the more tight your budget, the more cost conscious you are. The reality that Costco has tapped into is more than this: Frugal spending is the heart of the “art of wealth creation.”\n The truth: Everybody likes a deal, it releases pleasure hormones. If the deal is on a great product, that doubles up the sweetness. When the chosen few products are already the best among the multitude in the market — one less decision to make at the aisle. Mental convenience is an added bonus.\n 3. Conventional Wisdom: Make hay while the sun shines. Make money while any customer is inside the store.\n Costco’s business model that mints money: Charge people to get into the door. Exclusivity breeds loyalty.\n The world is waking up to this subscription model — popularized by Amazon and Netflix. Costco has been at it for years. Costco has perfected the art of milking the sunk cost fallacy — you are invested with the membership, why shop around . Membership starts at 60 dollars a year. Money is made in 90% renewal.\n In fact, Costco doesn’t make much money selling stuff, it makes it’s billions in membership! The Math is staggering — “There are more than 53 million paid members as of this year (2019)…. That means Costco is on track to make $4.3 billion from memberships in 2019, which is around 110% of its net income for the year”\n Icing in the cake, a third of Costco members pay double the entry level membership fee and get 2% cashback! Talk about cheaper capital for a credit heavy supply business. Useful in a recessionary economy.\n Mandatory membership to enter the store creates something more- exclusivity breeds loyalty. But membership is more than loyalty, it is the business model at Costco.\n   Costco business model is laser focused on where to find cost savings. Cost savings are in the laser thin margins on products sold. And it is not in the employee’s bottomline. Refreshing and different. And it shows. Costco has had only two CEO’s since 1997.  In reference, median tenure of CEO at S&amp;P 500 companies is 5 years.\n 5. Conventional wisdom: Customer’s cherish convenience. Amazon’s one day shipping is a prime example.\n Costco’s sage counterpoint: Customer’s enjoy maze hunt. It releases pleasure hormones.\n There is a reason Costco aisles are poorly labeled. As humans, unforeseen discoveries excite the Amygdala (happy part) of the brain. At Costco, serendipity for customers is a deliberate ploy in the warehouse design.\n  Life’s journey is about assumptions — implicit or explicit. Similarly, business success hinges on a business model tailored around assumptions. Costco deliberate ploy of tossing conventional wisdom has paid rich dividends.\n Discovering Costco’s breathtaking counter assumptions is a maze hunt — pleasurable insights hidden in plain sight.", "posttime": "2020-08-06 10:54:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "商业,costco,逆向,brilliant", "title": "好市多辉煌、逆向、成功的商业模式凸显", "title_en": "Costco's brilliant, contrarian and successful business model highlights", "transed": 1, "url": "https://medium.com/@KarthRajan/costcos-way-of-doing-business-is-all-wrong-but-when-you-discover-the-reasons-of-costco-s-778060801c3c", "via": "", "real_tags": ["商业", "costco", "逆向", "brilliant"]}, {"category": "", "categoryclass": "", "imagename": "8e5332a5f6a04a3047c88d4d3d28433a.jpg", "infoid": 1016592, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苏黎世大学(Zürich University)人类学家伊茨查克·本·莫查(Yitzchak Ben Mocha)对人类的生殖习惯进行了一项研究，试图了解为什么人类更喜欢私下交配。在他发表在“英国皇家学会学报B”期刊上的论文中，他描述了他对涉及人类性行为等其他研究的分析。坊间证据表明，生物通常更喜欢私下交配--但为什么呢？为什么这么稀有呢？除了人类，只有一个物种表现出对时间的偏好：阿拉伯喋喋不休。为了了解更多，本·莫查(Ben Mocha)从4572个文化研究-人种学-的账户中检索了数据，并对它们进行了研究，以寻找他所说的正常的性行为。那些涉案的人并不是为了震惊或避免因从事乱伦等禁忌行为而受到惩罚-也不是在做色情生意。他发现，几乎所有已知的文化都实行私下交配-即使在很难找到隐私的地方也是如此。他还寻找了其他动物私下交配的例子，除了喋喋不休的动物之外，没有找到任何例子。他还发现，对此没有任何解释，事实上，很少有人想知道为什么人类会有这样的倾向。而且，不足为奇的是，他找不到任何关于这个话题的东西。\n本·莫查在论文结束时介绍了他自己的一个理论，他认为人类(和喋喋不休的人)开始在性爱中寻找隐私的原因是因为男性想要阻止其他男性看到他的女性伴侣处于性唤醒状态。他认为，这样的状态很可能会鼓励其他雄性尝试与她交配。因此，隐私，或者更准确地说，与世隔绝，允许雄性保持对性伴侣的控制-同时也允许在一个群体内继续合作。他进一步提出，对私下交配进化的研究可能会让我们更好地理解人类的思维能力是如何在学会在群体中发挥作用的同时成熟起来的。更多信息：伊茨查克·本·摩卡(Yitzchak Ben Mocha)。为什么人类和非人类物种要隐藏交配？合作维持假说，“英国皇家学会学报B：生物科学”(2020)。DOI：10.1098/rspb.2020.1330", "note_en": "Yitzchak Ben Mocha, an anthropologist with Zürich University, has conducted a study of human procreation habits as part of an effort to understand why humans prefer to mate in private. In his paper published in the journal  Proceedings of the Royal Society B, he describes his analysis of other studies that involved human sexual practices, among other things.    Anecdotal evidence suggests that   beings generally prefer to mate in private—but why? And why is it so rare? Other than humans, only one other species has demonstrated a preference for   during  : Arabian babblers. To learn more, Ben Mocha retrieved data from 4,572 accounts of cultural studies—ethnographies—and studied them looking for what he describes as normal sexual practices. Those involved were not trying to shock or avoid punishment for engaging in taboo practices such as incest—and were also not in the pornography business. He found that virtually every known culture practices private mating—even in places where privacy is difficult to find. He also looked for examples of other animals mating in private, and found none, except for the babblers. He also found that there were no explanations for it, and in fact, there were very few other people wondering why humans have such a proclivity. And, not surprisingly, he was unable to find any   on the topic.\n  Ben Mocha concludes his paper by introducing a theory of his own—he believes that the reason humans (and babblers) began looking for privacy during sex was because the male wanted to prevent other males from seeing his female partner in a state of arousal. Such a state, he suggests, would likely have encouraged other males to attempt to mate with her. Thus, privacy, or perhaps more accurately, seclusion, allowed the male to maintain control over a sexual partner—while also allowing for continued cooperation within a group. He further suggests that the study of the evolution of private mating could lead to a better understanding of how thinking skills in humans matured as they learned to function in groups.        More information:\t\t\t\t\t\t\t\t\t\t\t\tYitzchak Ben Mocha. Why do human and non-human species conceal mating? The cooperation maintenance hypothesis,  Proceedings of the Royal Society B: Biological Sciences (2020).  DOI: 10.1098/rspb.2020.1330", "posttime": "2020-08-06 10:54:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "私下,prefer,人类", "title": "为什么人类更喜欢私下交配？", "title_en": "Why do humans prefer to mate in private?", "transed": 1, "url": "https://phys.org/news/2020-08-humans-private.html", "via": "", "real_tags": ["私下", "prefer", "人类"]}, {"category": "", "categoryclass": "", "imagename": "f8428a5c48481f66a87be943b6f9626b.png", "infoid": 1016591, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个广受欢迎的推特账号声称是由亚利桑那州立大学(Arizona State University)一名同性恋、土生土长的教授运营的，他于周五“死于新冠肺炎”，这是一个精心策划的猫钓骗局。虽然这个名为“科学比”的账号在“科学”推特圈子里颇有名气，但这位教授似乎根本就不存在。\n几个月来，@SCIENCING_BI一直在推特上谈论他们显然与新冠肺炎的争斗，并于4月份被迫在亚利桑那州立大学(Arizona State University)当面授课。上周早些时候，@cerging_bi在推特上发帖称，需要帮助打击COVID幸存者Facebook群上的COVID错误信息。该账号在推特上广泛讨论了社会正义，这位教授作为霍皮部落成员的土著遗产，LGBTQ在学术界的经历，以及他们与新冠肺炎的斗争。\n周五，MeTooSTEM的创始人贝丝·安·麦克劳克林宣布，@SCRICENCING_bi“死于新冠肺炎”，并在推特上发了一长串关于@SCRICENCING_BI对她的影响。\n“还有谁会告诉我我不够坚强呢？更大的战斗还在前面，我必须做得更好，“麦克劳克林在推特上写道。“还有谁会在那里公开指责我对NIH和NSF态度软弱？”她人不好。她很有权势，而且工作非常努力。“。\n但亚利桑那州立大学在一份声明中告诉母板，最近几天没有教职员工死于新冠肺炎，推特上已经暂停了麦克劳林和@Science_bi的账号，霍皮部落告诉母板，他们不知道有任何与@Science_bi的描述匹配的教授死于新冠肺炎。上周末，学术界的几名成员策划了@Science_bi是一个骗局。\n“不幸的是，这似乎是一场恶作剧。自本周末以来，我们一直在调查这件事，无法证实与该大学有任何联系，“亚利桑那州立大学的一位发言人在电子邮件中告诉母板。\n“我们已经与几位院长和教职员工取得了联系，没有人能确认这个账户的身份，也没有人知道谁可能是幕后黑手。”这位人士发布的一些过去的评论是有问题的，比如4月份的教学。亚利桑那州立大学在三月份完全遥控。该人士还提到减薪。我们在这里没有实施任何减薪，“这位发言人说。“我们也没有任何人，比如家人或朋友，向大学里的任何人报告死亡。”\n周五，麦克劳克林在推特上发布了一条关于@SCRIPENCING_BI账号和该账号的霍皮文化的悼念帖子：“她说她应该得到霍皮人的健康护身符作为礼物送给我们，但她跑掉了。具有讽刺意味的是健康护身符用完了。“\n霍皮部落主席办公室在一次电话中告诉母板，它没有听说过亚利桑那州立大学教授最近死于新冠肺炎的成员。@SCIENING_BI的所有者是霍皮部落的所谓成员。\n_**[您是不是@Science encing_bi；送给您一件霍皮人护身符？你参加他们的追悼会了吗？你知道还有其他精心制作的猫钓恶作剧吗？联系我们：kevin.truong@vice.com]**_。\n麦克劳夫林在推特上发布了@Science ging_bi去世的消息后不久，学术界的人开始纷纷表示哀悼，他们说他们认识这个账户背后的教授；看起来他们被骗了。\n缅因州大学气候变化研究所副教授杰奎琳·吉尔在推特上写道：“在经历了残酷的4个月恢复期后，我的朋友@SCRICENCING_BI昨天死于新冠肺炎的并发症。”她不是可有可无的。她不是做生意的一个可接受的成本。“。吉尔后来在推特上写道，在得知“违规行为”后，她从未亲自见过账户背后的人，她开始相信这个账户是一个骗局。吉尔在推特上写道：“我现在确信@SCRICENCING_Bi账号是个假账号。”“我对你们中那些违反信任的人表示抱歉，创建一个假的假名账号，假装各种边缘化的身份是错误的。这是邪恶的。“。\n在给主板的一封电子邮件中，Twitter的一位发言人表示，McLaughlin和@cerging_bi的账户都因违反Twitter的垃圾邮件和平台操纵政策而被暂停。\n该政策写道：“您不得以人为放大或压制信息的方式使用Twitter的服务，也不得从事操纵或破坏人们在Twitter上的体验的行为。”\n该政策禁止的活动包括操作虚假账号，或“操作多个相互互动的账号，以夸大或操纵特定推文或账号的突出程度”。\n学术界的许多人都认为麦克劳克林实际上是@cerencing_bi账户的幕后黑手，但母板公司一直无法独立证实这一点。麦克劳克林没有立即回复通过MeTooStem发出的置评请求。上周末，Heavy.com汇编了自那以后删除的推文的屏幕截图。\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "A popular Twitter account claiming to be run by a queer, Indigenous Arizona State University professor who “died from COVID-19” on Friday was an elaborate catfishing hoax. Though the account, called @sciencing_bi, had gained some renown in Science Twitter circles, the professor does not seem to have ever existed at all.\n  For months, @sciencing_bi had tweeted about their apparent battle with COVID-19, and being forced to teach in-person at Arizona State University in April. Early last week, @sciencing_bi tweeted about needing help fighting COVID misinformation on a COVID survivor Facebook group. The account tweeted extensively about social justice, the professor’s Indigenous heritage as a member of the Hopi tribe, the LGBTQ experience in academia, and their battle with COVID-19.\n   On Friday,  BethAnn McLaughlin, founder of  MeTooSTEM, announced that @sciencing_bi had “died from COVID-19,” and tweeted a long thread about the impact @sciencing_bi had on her.\n  “Who else is going to tell me that I’m not being strong enough? That the bigger fights are ahead That I have to do better,” McLaughlin tweeted. “Who else is just going to be there to call me out publicly for being soft on NIH and NSF? She wasn’t nice. She was powerful and she worked so stinking hard.”\n  But ASU told Motherboard in a statement that it has had no faculty member die of COVID-19 in recent days, Twitter has suspended McLaughlin’s and @sciencing_bi’s account, and the Hopi tribe told Motherboard it is unaware of any professor who matches @sciencing_bi’s description who has died of COVID-19. That @sciencing_bi was a catfishing hoax was worked out by several members of the academic community over the weekend.\n  “Unfortunately, this appears to be a hoax. We have been looking into this since this weekend and cannot verify any connection with the university,” an ASU spokesperson told Motherboard in an email.\n  “We have been in touch with several deans and faculty members and no one can identify the account or who might be behind it. Some of the past commentary this person posted is questionable, such as teaching in April. ASU went fully remote in March. The person also mentioned salary reductions. We have not implemented any salary reductions here,” the spokesperson said. “We also have had no one, such as a family member or friend, report a death to anyone at the university.”\n   On Friday, McLaughlin tweeted a memorial thread about the @sciencing_bi account, and the account’s Hopi culture: “She said she was suppose to get Hopi talisman for health as gifts for us but she ran out. The irony of running out of health talisman.”\n  The Office of the Chairman of  the Hopi Tribe, of which the owner of @Sciencing_bi was a supposed member, told Motherboard in a phone call it had not heard of a member who worked as a professor at ASU who had recently died of COVID-19.\n _**[Were you sent a &#34;Hopi talisman&#34; by @sciencing_bi? Did you attend their Zoom memorial? Do you know of any other elaborate catfishing hoaxes? Contact us at  kevin.truong@vice.com]**_\n  Soon after McLaughlin tweeted news of @sciencing_bi’s death, condolences began flowing in from people in academia, who said they knew the professor behind the account; it appears they had been tricked.\n  Jacquelyn Gill, an associate professor at the University of Maine’s Climate Change Institute, tweeted that “my friend @sciencing_bi passed away yesterday from complications from covid-19, after a brutal 4-month recovery period. She was not expendable. She was not an acceptable cost of doing business.” Gill later tweeted, after learning of “irregularities,” that she had never met the person behind the  account in person and that she became convinced the account was a hoax. “I’m now convinced  @Sciencing_Bi was a fake account,” Gill tweeted. “I’m so sorry to those of you whose trust was violated.Creating a fake pseudonymous account and pretending various marginalized identities is wrong. It’s evil.”\n  In an email to Motherboard, a spokesperson for Twitter said both McLaughlin’s and @sciencing_bi’s accounts were suspended for violating Twitter’s  spam and platform manipulation policies.\n  “You may not use Twitter’s services in a manner intended to artificially amplify or suppress information or engage in behavior that manipulates or disrupts people’s experience on Twitter,”  the policy reads.\n  Activities prohibited in the policy include operating fake accounts or “operating multiple accounts that interact with one another in order to inflate or manipulate the prominence of specific Tweets or accounts.”\n  Many in the academic community have suggested that McLaughlin was actually behind the @sciencing_bi account, but Motherboard has been unable to independently confirm this. McLaughlin did not immediately respond to a request for comment sent through MeTooStem. Over the weekend,  Heavy.com compiled screenshots of since-deleted tweets.\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-08-06 10:54:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新冠,indigenous,bi", "title": "一位死于新冠肺炎的土生土长的酷儿教授并不存在", "title_en": "A Queer Indigenous Professor Who Died of Covid-19 Didn’t Exist", "transed": 1, "url": "https://www.vice.com/en_us/article/y3zxg5/lgbtq-indigenous-professor-sciencingbi-died-covid-didnt-exist-asu-twitter", "via": "", "real_tags": ["新冠", "bi"]}, {"category": "", "categoryclass": "", "imagename": "53044500691d6f276dadb462ec3613a4.png", "infoid": 1016590, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2014年从海底打捞出岩芯。图片来源：美国杰夫小麦公司、美国国家科学基金会OCE 1130146和国家深潜设施。\n“低能”一词通常用作贬义，意指懒惰或懒惰。但对于潜伏在地球海洋深处的神秘生命形式来说，这是一个几乎没有任何燃料来源的阳光充足的栖息地，“低能量”是一个生存问题。\n根据周三发表在“科学进展”上的一项研究，现在，一组科学家发现，这些超凡脱俗的生物“生存在比之前显示的支持生命的能量通量更低的能量通量中，这对生命的能力极限提出了质疑”。\n客观地说，普通人的能源预算可以为一台吊扇供电。根据这项研究，这些有机体存在的能量预算大约比这个数字小50万亿分之一(10亿)。实际上，我们刚刚发现，某些生命形式可能非常不活跃，这扩大了我们对地球上和宇宙其他地方的生命可能是什么样子的概念。\n伦敦玛丽女王大学(Queen Mary University Of London)环境科学家、主要作者詹姆斯·布拉德利(James Bradley)在一次电话会议上说：“我们在海底下面的沉积物中有这个栖息地，而直到几十年前，我们还不知道这个栖息地。”\n“这被认为是一个非常限制能源的环境，但它包含了大量的微生物生命，”他继续说。全球海底沉积物中包含的细胞数量相当于地球所有土壤或全球海洋中的细胞数量。\n几十年前，科学家们通过在全球各地(从沿海地区到开阔海洋)钻探岩心，首次偶然发现了这种深层地下生物圈的存在。这些探险揭示了生命，以完整的微生物细胞的形式，已经找到了进入可以在海底几公里以下的壁龛的方式。\n布拉德利和他的同事使用这些海底调查的全球数据集来计算这些节俭生命形式的能量预算。该研究小组的数值模型集中在生态系统如何消化有机碳颗粒-主要是死物的残余物-这些颗粒从较高的海洋水位落到海底。\n布拉德利解释说：“我们有充分的证据相信，有机碳的氧化，也就是这种有机物的燃烧，是地下生命的主要燃料来源。”“这是一个与光线隔绝的系统，它依赖于这种下沉到海底的有机物质的输入，然后最终将其埋葬和沉积。”\n他说：“我们使用数值模型来预测通过该系统的能量流动、那里的细胞数量以及有机碳降解的速率，这在一定程度上提供了能量，”他说，“我们使用数值模拟来预测通过系统的能量流动、那里的细胞数量以及降解的有机碳的速率，这在一定程度上提供了能量。”\n假设你是人类，你自己的能源需求大约相当于运行一台吊扇所需的功率。根据这项研究，布拉德利的团队发现，平均每个海底电池的能量预算大约是这个数字的50亿分之一(10亿)倍。\n正如你可以想象的那样，这些黑暗地区的生活节奏与我们郁郁葱葱的地表世界截然不同。在地下，微生物活细胞通常以一种可能跨越数百万年的悬而未决的生命形式存在。\n布拉德利说：“看起来，这些生物中的大多数都生活在低于我们认为能够维持的能量状态--仅仅是活着--所以可能会有广泛的生长和细胞分裂的想法似乎不太可能。”\n“这些细胞与数万年、数十万年甚至数百万年前沉积的细胞是否相同，或者至少只隔了几代？”他补充说。“我认为这仍是一个悬而未决的问题。”\n令人难以置信的是，我们共享一个星球上的生命形式，可以勉强维持基本的生物活动，而油箱里的燃料如此之少。但它也揭示了太阳系中其他星球(如火星或木卫二)的潜在宜居性，以及围绕其他恒星运行的系外行星可能存在生命的可能性。\n布拉德利说：“我们通过这项研究发现，与我们所熟悉的大多数生命相比，这些有机体与能量的关系从根本上说是不同的。”“如果有机体可以用很少的能量在极长的时间尺度上生存，那肯定会扩大我们寻找生命的可能栖息地。”\n对于像火星这样的世界来说，这是一个值得思考的诱人现实，科学家们认为，在30亿多年前，火星可能是微生物的居住地。也许微生物火星人在亿万年前就撤退到地下了，他们已经埋伏了亿万年，以防更友好的条件回到这颗红色星球上。\n当然，没有人知道，但这是一个令人鼓舞的迹象，表明深层生物圈是你在地球上所能获得的最陌生的生态系统，充满了奇怪的古代生命。该研究小组的发现涵盖了260万年前的沉积物，但科学家们希望恢复更多的样本，这些样本可能会将这一日期推后到5000万年或1亿年前。\n布拉德利说：“如果能够扩展这个数字框架，能够捕捉到那些环境，那就太好了。”“我们预计会发现，更古老的环境存在于与我们在这里发现的相同或更低的能量体系中。”\n“随着我们继续探索更难进入的地点，更热的地点，那些与地球动态部分隔绝了更长时间的地点，我们可能会开始看到我们找不到生命的地区，”他总结道。“但到目前为止，我们寻找的大多数地方都发现了这些僵尸样的细胞。”\n签署“色情通讯”，即表示您同意接收来自“色情通讯”的电子通讯，其中有时可能包括广告或赞助内容。", "note_en": "Core being taken from the seafloor in 2014. Image: Geoff Wheat, NSF OCE 1130146, and the National Deep Submergence Facility\n The phrase “low energy” is normally used as a pejorative meant to imply lethargy or sloth. But for the mysterious lifeforms that lurk deep under the seafloor of Earth’s oceans—a sunless habitat with hardly any fuel sources—being “low energy” is a matter of survival.\n  Now, a team of scientists has discovered that these otherworldly creatures “subsist at energy fluxes lower than have previously been shown to support life, calling into question the power limit to life,”  according to a study published on Wednesday in  Science Advances.\n   To put it in perspective, the energy budget of an average human could power a ceiling fan. These organisms exist on an energy budget about 50 quintillion (a billion billion) times smaller than that, according to the study. In effect, we have just discovered that certain lifeforms can be so incredibly inactive that it has expanded our conception of what life on Earth, and elsewhere in the cosmos, can look like.\n  “We have this habitat in the sediments underneath the seafloor that previously was unknown to us until just a few decades ago,” said lead author James Bradley, an environmental scientist at Queen Mary University of London, in a call.\n  “This is thought to be a very energy-limiting environment, but it contains a vast amount of microbial life,” he continued. “The number of cells that are contained in global subseafloor sediments is equivalent to the number of cells in all of Earth’s soils, or all of Earth’s global ocean.”\n  Scientists first stumbled upon the existence of this deep subsurface biosphere decades ago by drilling cores across the globe, from coastal regions to the open ocean. These expeditions have revealed that life, in the form of intact microbial cells, has found its way into niches that  can be kilometers under the seafloor.\n  Bradley and his colleagues used global datasets from these seafloor surveys to calculate the energy budgets of these frugal lifeforms. The team’s numerical model focused on how the ecosystems digest particles of organic carbon—mostly the remains of dead stuff—that rain down on the seafloor from higher levels of the ocean.\n   “We have good evidence to believe that the oxidation of organic carbon, the burning of this organic matter, is the primary fuel source for life in the subsurface,” Bradley explained. “It&#39;s a system cut off from light and it relies on the input of this sinking organic material onto the seafloor, and then its eventual burial and deposition.”\n  “We used numerical modeling to predict the flow of energy through the system, the number of cells that are there, and the rate of organic carbon that has degraded, which supplies, in part, the energy,” he said.\n  Your own energy needs, assuming you are a human, are about equal to the power required to run a ceiling fan. Bradley’s team found that the average seabed cell has an energy budget that’s about 50 quintillion (a billion billion) times smaller than that, according to the study.\n  As you can imagine, life in these dark regions moves at a very different pace to our lush surface world. In the subsurface, microbial living cells often exist in a kind of suspended animation that may span millions of years.\n  “It looks like the majority of these organisms are living at energy regimes that are below what we thought was even capable of maintenance—just staying alive—so the idea that there might be widespread growth and cell division seems not very likely,” Bradley said.\n  “Are these the same cells, or at least only a few generations removed from those that were deposited tens of thousands, hundreds of thousands, or even millions of years ago?” he added. “I think that is still an open question.”\n   It’s mind-boggling that we share a planet with life forms that can eke out basic biological activities with so little fuel in the tank. But it also sheds light on the potential habitability of other worlds in the solar system, such as Mars or Europa, as well as the odds that exoplanets orbiting other stars might bear life.\n  “What we’re seeing through this study is that these organisms have a very fundamentally different relationship with energy than most of life that we’re familiar with,” Bradley said. “If it&#39;s possible that organisms can survive over extremely long timescales on very little energy, that definitely expands the possible habitats that we might search for life in.”\n  That’s a tantalizing reality to ponder with regards to worlds like Mars, which scientists think was potentially habitable to microbes more than three billion years ago. Perhaps microbial Martians retreated into the subsurface eons ago, and have laid in wait for eons in case friendlier conditions return to the red planet.\n  Nobody knows, of course, but it’s an encouraging sign that the deep biosphere, which is as alien an ecosystem as you can get on Earth, is teeming with weird ancient life. The team’s findings cover sediments that date back 2.6 million years, but scientists hope to recover more samples that may push that date back upwards of 50 or 100 million years.\n  “It would be nice to be able to expand this numerical framework to be able to capture those environments,” Bradley said. “We would expect to find that the more ancient environments are subsisting at the same or lower energy regimes to what we find here.”\n  “As we continue to explore sites that are more difficult to access, sites that are hotter, sites that have been cut off from the sort of dynamic parts of the Earth for longer timescales, we might start to see areas where we don’t find life,” he concluded. “But so far, the majority of the places that we’ve looked we’ve found these zombie-like cells.”\n  By signing up to the VICE newsletter you agree to receive electronic communications from VICE that may sometimes include advertisements or sponsored content.", "posttime": "2020-08-06 10:53:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,发现,creatures,生命", "title": "科学家们发现生物是如此的不活跃，以至于他们扩展了我们对生命本身的看法", "title_en": "Scientists Found Creatures So Inactive They Expanded Our Idea of Life Itself", "transed": 1, "url": "https://www.vice.com/en_us/article/jgxavb/scientists-found-creatures-so-inactive-they-expanded-our-idea-of-life-itself", "via": "", "real_tags": ["科学家", "发现", "creatures", "生命"]}, {"category": "", "categoryclass": "", "imagename": "e1701e7feb001f0db2c89e89ff393901.jpg", "infoid": 1016589, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着黎巴嫩对贝鲁特毁灭性爆炸事件的调查仍在继续，官员们指出了一个可能的原因：尽管当地官员发出警告，但大量的农业化肥被储存在贝鲁特港口多年，没有采取安全措施。", "note_en": "As Lebanon's investigation into the devastating blast in Beirut continues, officials have pointed to a possible cause: A massive shipment of agricultural fertilizer that authorities say was stored in the port of Beirut without safety precautions for years -- despite warnings by local officials. ", "posttime": "2020-08-06 10:53:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,贝鲁特,ship", "title": "俄罗斯船载危险硝酸铵货物滞留贝鲁特港口", "title_en": "Russian ship's cargo of dangerous ammonium nitrate was stranded in Beirut port", "transed": 1, "url": "https://edition.cnn.com/2020/08/05/europe/lebanon-russian-ship-blast-intl/index.html", "via": "", "real_tags": ["俄罗斯", "贝鲁特", "ship"]}, {"category": "", "categoryclass": "", "imagename": "8aa37bbc704414649e6bcc6b2255a91d.jpeg", "infoid": 1016588, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特的一位发言人告诉“商业内幕”，推特上暂时屏蔽了特朗普竞选团队的账号，因为他在周三发布了一段总统传播新冠肺炎错误信息的视频。\n竞选团队在推特上发布了一段后来被删除的视频，视频中特朗普向福克斯新闻谎称儿童几乎对这种疾病免疫。\n你引用的这条推文违反了推特上关于新冠肺炎错误信息的规定。这位发言人表示，账户所有者将被要求删除该推文，然后才能再次发布推文。\n越来越多的研究表明，这些儿童可以像其他人一样传播新冠肺炎，尽管研究人员认为，他们的感染率往往被低估，因为他们经常没有症状，而且在很大程度上被排除在临床试验之外。\n特朗普竞选团队的副国家新闻秘书考特尼·帕雷拉(Courtney Parella)在一份声明中表示，又一天，硅谷对这位总统公然的偏见再次显现，在那里，规则只在一个方向上执行。社交媒体公司不是真相的仲裁者。\n特朗普总统还发布了他自己的推文，链接到竞选团队的推文中，其中包含了这段视频，点击量已超过3万次。\n然而，推特表示，它不会对总统的账户采取任何行动，只会对竞选活动采取任何行动。\n我们的执法行动是针对Tweet的，而不是那些可能放大了它的账户。这段视频由@TeamTrump发布，并通过@realDonaldTrump分享，这就是为什么我们要特别针对这个账号采取行动，一位发言人告诉“商业内幕”(Business Insider)。\n周三早些时候，Facebook删除了特朗普发布的类似帖子，称其违反了自己针对有害的COVID错误信息的政策，这是这家社交媒体巨头首次完全删除特朗普发布的关于病毒的虚假信息。\n最近，社交媒体公司面临越来越大的压力，要求它们采取更有力的措施，解决其平台上错误信息的传播，特别是围绕冠状病毒大流行、仇恨言论和选举。今年早些时候，推特在特朗普的推文上贴上了事实核查的标签，错误地声称邮寄投票导致了广泛的选举舞弊。\n与此同时，特朗普对社交媒体平台越来越愤怒，特别是推特。近几个月来，特朗普暗示Twitter的热门话题是非法的，因为这些话题让他看起来很糟糕，并在一项法律上可疑的行政命令中挑出了该公司，试图打击平台对其平台内容进行审核的权限。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "Twitter temporarily blocked the Trump campaign&#39;s account from tweeting on Wednesday for posting a video of the president spreading COVID-19 misinformation, a spokesperson told Business Insider.\n The campaign  tweeted a video, which has since been removed, of Trump falsely claiming to Fox News that children are &#34;almost immune&#34; from the disease.\n &#34;The Tweet you referenced is in violation of the Twitter Rules on COVID-19 misinformation. The account owner will be required to remove the Tweet before they can Tweet again,&#34; the spokesperson said.\n A growing body of research suggests that  children can transmit COVID-19 like anyone else, though researchers believe their infection rates are often underreported because they are frequently asymptomatic and have been largely excluded from clinical trials.\n   &#34;Another day, another display of Silicon Valley&#39;s flagrant bias against this President, where the rules are only enforced in one direction,&#34; Courtney Parella, the Trump campaign&#39;s deputy national press secretary, said in a statement. &#34;Social media companies are not the arbiters of truth.&#34;\n President Trump also posted his own tweet linking to the campaign&#39;s tweet containing the video, which has been viewed more than 30,000 times.\n However, Twitter said that it would not take any action against the president&#39;s account, only the campaign.\n &#34;Our enforcement action is specific to Tweets, not accounts that may have amplified it. The video was posted by @TeamTrump and shared via @realDonaldTrump, which is why we&#39;re taking action on that account specifically,&#34; a spokesperson told Business Insider.\n  Facebook  took down a similar post from Trump earlier on Wednesday for violating its own policies against &#34;harmful COVID misinformation,&#34; the first time the social media giant has completely removed a post by Trump for spreading false information about the virus.\n   Pressure has mounted on social media companies recently to take stronger steps to address the spread of misinformation on their platforms, particularly around the coronavirus pandemic, hate speech, and elections. Earlier this year, Twitter  applied a fact-check label to Trump&#39;s tweets falsely claiming mail-in voting causes widespread election fraud.\n Meanwhile, Trump has become increasingly enraged at social media platforms, particularly Twitter. In recent months, Trump has suggested that Twitter&#39;s trending topics are &#39;illegal&#39; because  they make him look bad and singled out the company in a  legally dubious executive order that seeks to crack down on platforms&#39; authority to moderate content on their platforms.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-08-06 10:29:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,特朗普,temporarily", "title": "推特在分享了一段总统传播新冠肺炎错误信息的视频后，暂时阻止了特朗普竞选团队的推文", "title_en": "Twitter temporarily blocked the Trump campaign from tweeting after it shared a video of the president spreading COVID-19 misinformation", "transed": 1, "url": "https://www.businessinsider.com/twitter-blocked-trump-campaigns-tweets-sharing-false-covid-19-claims-2020-8", "via": "", "real_tags": ["推特", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "114daf5688dca608ab2f762881f43034.jpg", "infoid": 1016587, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软不打算将Xbox Live更名，也不打算停产Xbox Live Gold。本周，在微软宣布修改其服务协议后，出现了Xbox Live更名的传言。这家软件巨头开始将Xbox Live称为“Xbox在线服务”，这让一些人认为Xbox Live即将消失。\n微软发言人在给The Verge的一份声明中说：“微软服务协议中对‘Xbox在线服务’的更新指的是底层的Xbox服务，它包括交叉保存和好友请求等功能。”“此语言更新旨在区分基础服务和付费Xbox Live金牌订阅。这项服务或Xbox Live Gold的体验没有任何变化。“。\n最近的谣言也猜测Xbox Live Gold将会消失，甚至可能是免费的。我请微软对传言发表评论，该公司表示：“我们目前没有停止使用Xbox Live Gold的计划。它是今天Xbox上游戏的重要组成部分，未来也将继续如此。“。\n虽然很明显Xbox Live Gold不会消失，但微软的声明并不意味着这项服务在未来的某个时候不会免费提供。微软仍然要求Xbox One用户，以及潜在的Xbox Series X用户，购买Xbox Live Gold订阅才能在线玩多人游戏。然而，支持Xbox Live的游戏的Windows 10玩家不需要同样的订阅。\n对于像“光环无限”这样的游戏来说，这种拆分变得特别棘手，微软承诺它将有一个免费玩的多人模式。如果微软继续将Xbox Live Gold作为Xbox游戏机上的付费服务，那么PC播放器将获得完全免费的光环无限访问权限，而Xbox播放器则不会。\n微软没有具体评论围绕Xbox Live的免费传言，这一传言始于该公司上个月从其在线商店中删除了Xbox Live Gold的12个月选项。今天很明显，该公司并不打算特别停止使用Xbox Live Gold，也不打算将其更名为Xbox Live。", "note_en": "Microsoft isn’t planning to rename Xbox Live or discontinue Xbox Live Gold. Rumors of an Xbox Live rename appeared this week, after Microsoft announced  changes to its services agreement. The software giant started referring to Xbox Live as the “Xbox online service,” prompting some to assume Xbox Live was going away.\n “The update to ‘Xbox online service’ in the Microsoft Services Agreement refers to the underlying Xbox service that includes features like cross-saves and friend requests,” says a Microsoft spokesperson in a statement to  The Verge. “This language update is intended to distinguish that underlying service, and the paid Xbox Live Gold subscription. There are no changes being made to the experience of the service or Xbox Live Gold.”\n Recent rumors have also speculated that Xbox Live Gold is going away or perhaps even being made free. I asked Microsoft to comment on the rumors, and the company said: “We have no plans to discontinue Xbox Live Gold at this time. It is an important part of gaming on Xbox today, and will continue to be in the future.”\n   While it’s clear Xbox Live Gold isn’t going away, Microsoft’s statement doesn’t mean the service won’t be made free at some point in the future. Microsoft still requires Xbox One owners, and potentially Xbox Series X owners, to purchase an Xbox Live Gold subscription to play multiplayer games online. Windows 10 players of Xbox Live-enabled games do not require the same subscription, however.\n This split gets especially tricky for games like  Halo Infinite, which Microsoft has promised  will have a free-to-play multiplayer mode. If Microsoft does continue Xbox Live Gold as a paid service on Xbox consoles, then PC players will get totally free access to  Halo Infinite and Xbox players will not.\n Microsoft isn’t specifically commenting about the free rumors around Xbox Live, which started when the company  removed the 12-month option for Xbox Live Gold from its online store last month. It’s clear today that the company isn’t planning on discontinuing Xbox Live Gold specifically or renaming Xbox Live.", "posttime": "2020-08-06 10:28:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,xbox,live", "title": "微软不会重新命名Xbox Live，也没有停止使用Xbox Live Gold的计划", "title_en": "Microsoft Isn't Renaming Xbox Live and Has 'No Plans' To Discontinue Xbox Live Gold", "transed": 1, "url": "https://www.theverge.com/2020/8/5/21355756/microsoft-xbox-live-rename-gold-free-rumors", "via": "", "real_tags": ["microsoft", "微软", "xbox", "live"]}, {"category": "", "categoryclass": "", "imagename": "6c85f0eb2b76f52115b059f09fad9980.jpeg", "infoid": 1016585, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专注于用户反馈和自下而上的创意生成如何帮助我们构建自定义应用程序，从而节省我们的销售团队时间。\n我们已经建立了一个小型的跨职能团队，负责改进Slake的端到端Lead to Cash工作流程。在这篇博客文章中，我将详细介绍我认为到目前为止我们成功的关键是什么。\n去年，我们为Slake的企业销售团队提供了生成销售资料、提出交易结构并通过正确的审批流程进行交易的能力，而无需离开Slake。前一年，我们在Salesforce中提供了订单自动化(Order Automation)服务，该服务可在Salesforce中成功关闭商机时触发合同创建、相应产品的供应和开票。如果在调配流程中发生任何异常，我们的自助服务模式会将其交付给适当的团队，这些团队通过Slake为销售和我们的客户提供支持。\n很快，我们将推出Midas Touch for Prospecting，这将帮助销售领导指导整个销售团队优先考虑他们的工作。MIDAS将突出哪些客户和潜在客户显示出最具潜力的关键信号、指标和建议的行动，直接来自Slake，鼓励业务开发代表、客户主管、续订经理和客户成功经理之间的对话和合作。\n虽然现金流的全部实现是BizTech许多项目(如SalesLoft部署、迁移到Workday Financials、我们部署Steelrick CPQ)的共同努力，但通过Slake简化了所有这些项目，使我们的销售团队感觉到无缝过渡，并节省了无数小时。\n让我们退一步来分享我们是如何走到这一步的。\n当我们在2016年开始的时候，业务系统会定期与业务部门(主要是运营团队)会面，以满足他们的需求。典型的需求将集中在扩展业务上，例如，提供销售补偿、丰富我们的探矿数据、使用Steelrick CPQ更好地管理Salesforce中的审批，或者推出Workday这样的新系统。\n我们认为成功是(1)按时完成发布，(2)培训用户群。虽然我们的目标令人印象深刻，但在我们的过程中，我们缺乏一个关键组成部分：用户反馈。我们需要直接从用户那里了解日常工作流程的痛点和机会领域。\n因此，在2018年，我们推出了一个签名计划，Slake on Slake，专注于将Slake优化为合作和采取行动的地方。我们根据BizTech领导层的意见推动了投资组合优先顺序的确定。我们看到了许多成功，包括批准Bot的扩展，它向经理发布关键的批准，以努力减少TAT(周转时间)。\n我们想进一步利用自动化的价值，特别是引入众包的一个方面。2019年初，我们向全体员工开放了该计划，鼓励他们分享有影响力的想法，我们可以通过一个公共渠道#Sack-on-Sack在内部建立这些想法。\n其中一个想法催生了Midas Touch Bot，它帮助我们的销售团队自动生成销售平台，过去需要几个小时，现在只需几秒钟，就可以从Slake开始。\n但我们并没有止步于此。我们仍然鼓励设计思维和迭代，我们在2020年初收到了我们现在称为Midas Touch for Prospecting的宪章，同时收到了大量请求，要求将这些关键客户数据和信号推送到Slake，而不是拉到幻灯片幻灯片中。我们成立了一个老虎团队，成员包括来自销售运营/战略的领导，以及终端用户和销售代表，以深入了解最引人注目的信号以及如何使其具有可操作性。\n与此同时，类似的故事在Bot交易的审批中重演。Sales Ops要求我们的团队简化交易结构的初始迭代，因此我们继续构建强大的Slake多人工作流(我们将在下面深入研究)。一旦我们开始展示此流程，最终用户就会分享反馈，最终推动我们简化端到端报价流程。\n如果不是因为(1)松弛，(2)专注于获取用户反馈，(3)想法产生自底向上，我们可能错过了帮助无缝指导我们的勘探工作并简化导致现金的巨大机会。\n到目前为止，我们已经引用了几个机器人：Midas Touch Bot和Approval Bot，但我们最近构建了相当多的机器人，并发展了我们的策略。\n构建机器人而不是(或除此之外)完整堆栈的内部应用程序有几个好处：\n开发速度：我们可以在不需要前端开发人员的情况下构建相当复杂的UX。\n一致的体验：有了Slake的Block Kit，所有机器人的消息和界面都有一致的体验，这有助于用户直观地与我们的产品交互。\n进入和使用门槛较低：有两个原因使我们的机器人令人难忘，并增加用户采用率：(1)员工直接见证他们在Slake的价值，并可以在一个中心位置找到它们；(2)我们使我们的机器人有趣有趣，设计有目的和个性，这样用户就可以记住提供的价值，以鼓励重复使用。\nWorkato是一个集成平台，可帮助在短时间内构建可靠的集成。Workato的主要优势包括：\nWorkbot是Workato的关键连接器之一，它允许为Slake和其他提供商构建机器人。\nWorkbot使用相同的命令界面处理所有Slake交互组件，如按钮单击、快捷键、斜杠命令。\nWorkbot可以使用您自己的松弛应用程序凭据进行自定义，以提供自定义头像和范围，尤其重要的是，因为松弛已经推出了细粒度的Bot Scope。\n我们用于审批Bot的高级体系结构是事件驱动的体系结构，其中所有业务逻辑都驻留在Salesforce中。用户既可以在Salesforce中执行操作，也可以在Slake中执行操作，结果相同，并且两个系统保持同步。\n下面您可以看到我们的一个GTM Workato实例，先按团队组织，然后按项目组织。对于审批Bot，当审批状态改变时，我们使用Salesforce的WebHooks来驱动工作流，然后发布一个PubSub主题，允许多个订阅者并行执行不同的下游操作。\n最后，一旦批准发布到Slake中，并且经理点击Apply或Reject，我们就可以使用Workbot命令(如下所示)来调用Salesforce并更新Slake以反映最新状态，从而处理这些交互。\n其他机器人，如Midas Touch稍微复杂一些，所以我们用Heroku中托管的微服务来扩展功能。我们继续维护我们的事件驱动架构，以帮助我们进行扩展并提供更具响应性的用户体验。\n对于我们发布的每一个松弛机器人来说，测量影响是关键，我们通过三种方式做到这一点：\n在第三点上展开：在BizTech，我们负责公司系统和跨越这些系统的集成。我们的团队必须跟踪和衡量较大的跨系统事务-在许多情况下，这包括通过Slake中的工作流处理特殊情况。\n我们已经开发了一个名为HealthMon的简单内部服务，用于使用活动流协议收集事件。然后，我们可以很容易地将不同属性上的端到端事务关联起来。与我们的商业智能工具Looker相结合，我们将警报配置到Slake中，并可以专注于交付我们的SLA。这些相同的度量标准帮助我们衡量采用率并确定摩擦点，以便我们可以迭代。\n下面是MIDAS Touch for Prospecting的示例，它与Slake进行交互并将交易跟踪到Healthmon，以便我们可以监控我们的SLA：\n有了HealthMon，我们知道我们的表现有多好，并且可以很容易地传达出影响，比如，我们每个月为用户节省了大约5000个小时，而不是使用我们的自动化。\n我们的许多服务都使用Healthmon来提供SLA(通过Looker仪表板的方式)，未来我们可能会考虑扩展它，以便订阅者可以进行一些自我修复。例如，Workato中提供了自我修复功能，但它与每个作业相关，而不一定是整个较大的事务。\n总而言之，交付有影响力的内部产品的关键是协作和协调：与业务领导人的目标及其愿景保持一致，同时与实际最终用户保持联系，倾听他们的痛点。关键是鼓励创新、协作和迭代，衡量我们所做的每一件事的影响。", "note_en": "How focusing on user feedback and bottoms up idea generation helped us build custom apps that save our Sales team time.\n   We’ve established a small cross functional team responsible for improving the end-to-end Lead to Cash workflow at Slack. In this blog post, I will go into detail about what I consider the key to our success so far.\n In the last year, we provided the Enterprise Sales team at Slack the ability to  generate a sales deck, propose a deal structure and route the deal through the correct approval flow, without leaving Slack. The year prior, we delivered Order Automation — a service which triggers the contract creation, provisioning of the appropriate product and invoicing — when an Opportunity is closed won in Salesforce. If any exceptions happen during the provisioning flow, our self-serve model delivers them to the appropriate teams that support Sales and our Customers via Slack.\n And soon, we will launch Midas Touch for Prospecting, which will help Sales Leadership guide the entire Sales team to prioritize their efforts. Midas will highlight which customers and prospects show the most potential with key signals, metrics and recommended actions, right from Slack, encouraging dialogue and collaboration between Business Development Reps, Account Executives, Renewal Managers and Customer Success Managers.\n While the entire Lead to Cash flow is the effort across many projects in BizTech — such as our SalesLoft deployment, our migration to Workday Financials, our deployment of Steelbrick CPQ — streamlining all of these projects via Slack has been a game changer making the transitions feel seamless for our Sales team and saving countless hours.\n Let’s take a step back to share how we got to this point.\n  When we started in 2016, Business Systems would meet regularly with the Business, mainly the operations teams, to get their requirements. Typical requirements would focus on scaling the business, e.g., delivering Sales Compensation, enriching our prospecting data, better managing approvals in Salesforce with Steelbrick CPQ, or launching a new system like Workday.\n We considered success (1) finishing the launch on time and (2) training the user base. While impressive goals, we lacked a key component in our process:  User Feedback. We needed to understand daily workflow pain points and areas of opportunity directly from users.\n So in 2018 we launched a signature program, Slack on Slack, to focus on optimizing Slack as the place to collaborate and take action. We drove portfolio prioritization based on input from BizTech leadership. We saw many successes, including the build-out of Approvals Bot, which posts key approvals to managers in an effort to reduce TaT(turn around time).\n We wanted to leverage the value of automation even further, and particularly to introduce an aspect of crowd-sourcing. Early in 2019 we opened the program up to the entire employee population encouraging them to share impactful ideas that we could build internally via a public channel #slack-on-slack.\n One of these ideas generated the creation of  Midas Touch Bot which helped our Sales teams automatically generate sales decks that used to take hours, now in seconds, right from Slack.\n But we didn’t stop there. Still encouraging design thinking and iteration, we received a charter for what we now call Midas Touch for Prospecting in early 2020, while at the same time receiving numerous requests to push this key account data and signals to Slack versus pulled into a slide deck. We launched a tiger team including leaders from sales operations/strategy, as well as end users, and sales reps, to deeply understand the most compelling signals and how to make them actionable.\n In parallel, a similar story replayed with Approvals Bot Deals. Sales Ops asked our team to streamline the initial iterations on deal structures so we went ahead to build a robust Slack multi-person workflow (which we will dive into below). Once we started showcasing this flow, end user shared feedback that ultimately drove us to simplify the end-to-end quoting process.\n If it wasn’t for (1) Slack on Slack, (2) the focus on getting user feedback and (3) ideas generating bottoms up, we may have missed these tremendous opportunities to help direct our prospecting efforts seamlessly and streamline Lead to Cash.\n   We have referenced a couple bots so far:  Midas Touch Bot and  Approvals Bot, but we have built quite a few more recently and evolved our strategy.\n  There are several benefits to building bots instead of (or in addition to) full stack internal applications:\n Speed of development: We can build fairly sophisticated UX without the need for a front end developer.\n Consistent experience: With Slack’s Block Kit all bots’ messages and surfaces have a consistent experience which helps users interact with our product intuitively.\n Low barrier to entry and use: There are two reasons that make our bots memorable and increase user adoption: (1) employees witness first-hand their value in Slack and can find them all in a central location; (2) we make our bots playful and fun, designed with purpose and personality, so users can remember the value provided to encourage repeated use.\n  Workato is an Integration Platform which helps build reliable integrations in a short amount of time. The key benefits of Workato are:\n   Workbot is one of Workato’s key connectors that allows building bots for Slack and other providers.\n  Workbot handles all the Slack interactive components like button clicks, shortcuts, slash commands using the same command interface.\n  Workbot can be customized with your own Slack App credentials to provide custom avatar and scopes, especially important as Slack has rolled out Granular Bot Scopes.\n   Our high level architecture for  Approvals Bot is an event-driven architecture where all the business logic resides in Salesforce. Users can perform actions in Salesforce as well as in Slack with the same results and both systems remain in sync.\n  Below you can see one of our Workato instances for GTM organized by teams and then by projects. For Approvals Bot we used Webhooks from Salesforce when the approval state changed in order to drive the workflow, then published a PubSub topic, allowing multiple subscribers to perform different downstream actions in parallel.\n    Finally, once the approvals are posted in Slack and managers hit Approve or Reject, we handle those interactions using Workbot commands (as seen below) to invoke Salesforce and update Slack to reflect the latest status.\n  Other bots like Midas Touch are a bit more complex so we extend the functionality with micro services hosted in Heroku. We continue to maintain our event driven architecture to help us scale and provide a more responsive user experience.\n  For every Slack bot we release measuring impact is key and we do this in three ways:\n  To expand on the third point: in BizTech we are responsible for Corporate Systems and the integrations that span them. It’s imperative for our group to track and measure the larger cross-system transactions — which, in many cases, include handling of special cases via workflows in Slack.\n We have developed a simple internal service called  HealthMon to collect events using the Activity Stream protocol. Then, we can easily correlate the end-to-end transaction on different attributes. Combined with Looker, our Business Intelligence tool, we configured alerts into Slack and can focus on delivering our SLA. These same metrics help us measure adoption and identify points of friction so we can iterate.\n Below is an example of Midas Touch for Prospecting interacting with Slack and tracking the transactions into HealthMon so we can monitor our SLA:\n  With HealthMon we know how well we are performing and can easily convey the impact like for example the fact that we save users ~5000 hours a month from using our automations.\n HealthMon is used by a good number of our services to provide SLAs (by way of Looker dashboards) and in the future we may look into expanding it such that subscribers can do some self healing. Self healing is available in Workato for example but it’s tied to each job and not necessarily the overall larger transaction.\n  In conclusion, the key to delivering impactful internal products is collaboration and alignment: Aligning to the goals of the business leaders and their vision while connecting with the actual end users to hear their pain points. It’s key to encourage innovation and collaborate and iterate measuring the impact for everything we do.", "posttime": "2020-08-06 10:15:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供,internal,slake", "title": "松懈：提供有影响力的内部产品", "title_en": "Slack on Slack: Delivering impactful internal products", "transed": 1, "url": "https://medium.com/slack-developer-blog/slack-on-slack-delivering-impactful-internal-products-9f3e62403492", "via": "", "real_tags": ["提供", "internal", "slake"]}, {"category": "", "categoryclass": "", "imagename": "cc05c0c46e1a85326484194cd9941040.jpg", "infoid": 1016584, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在即将登陆HBO Max的最新科幻系列片《狼的养育》的首支预告片中，机器人艰难地在一个神秘的星球上抚养人类的孩子。这是由雷德利·斯科特(《银翼杀手》、《异形》等)打造的，由Aaron Guzikowski创作，他也是2013年惊悚片《囚徒》的剧本编剧。这部十集的系列最初是TNT的直播剧订单，但去年10月搬到了HBO Max。斯科特甚至执导了前两集，这是他的美国电视导演处女作。\n斯科特在2018年接受Deadline好莱坞采访时表示：“我一直在科幻类型的新领域寻找新的领域，并在”狼的养育“中找到了一个真正的原创--一个截然不同、富有想象力的世界，里面充满了挣扎于生存问题的人物。”斯科特在2018年告诉Deadline好莱坞，是什么吸引了他参与这个项目。是什么让我们成为人类？家庭是由什么组成的？如果我们可以重新开始，抹去我们给地球造成的混乱，那会怎样呢？我们能活下来吗？我们会做得更好吗？“。\n这个系列的口号几乎没有透露什么：母亲被设定为在地球被摧毁后保护每一个人。当大灰狼出现时，她是我们必须信任的人。但开发过程中透露的基本前提是，故事讲述了两个机器人在一个奇怪的处女星球上扮演母亲(阿曼达·科林饰)和父亲(阿布巴卡尔·萨利姆饰)的故事。他们的程序是抚养人类的孩子来重建人口。然而，这个羽翼未丰的殖民地的人们发展出明显的宗教差异，而机器人应该认识到，控制人类的信仰是一项危险而艰巨的任务。\n从预告片来看，实际的剧集比这个简短的描述要怪异得多，也复杂得多。孩子们，围过来，我们听到母亲说。这似乎是她的年轻伙伴们的故事时间，但这一次可能会给他们带来噩梦。她说，地球被一场大战摧毁了。我被设定为保护你。现在我们重新开始。然后，母亲开始了一段令人毛骨悚然的复述三只小猪的故事，画面接二连三地闪过，变得越来越奇怪和暴力。\n特拉维斯·菲梅尔(Travis Fimmel)饰演马库斯(Marcus)，他似乎是这部电视剧中的坏人。还是他是？所有那些血迹斑斑的母亲发出女妖哭声的画面，都足以让人头部爆炸，这表明情况并非如此。母亲在做什么，蹲在一个巨大的深坑边嚎叫？她所说的那只大灰狼？这就是她，我们被告知。\n《狼群养育》将于2020年9月3日在HBO Max首播。会很好吃吗？这很难说，尽管制作价值似乎相当令人印象深刻，而且有一些强烈的外星人氛围。这是雷德利·斯科特，所以我们一定会关注的。", "note_en": "Androids struggle to raise human children on a mysterious planet in the first trailer for   Raised by Wolves, a new sci-fi series coming to HBO Max, courtesy of none other than Ridley Scott ( Blade Runner, Alien, etc., etc.). Created by Aaron Guzikowski, who also penned the script for the 2013 thriller   Prisoners, the ten-episode series was initially a straight-to-series order for TNT, but moved to HBO Max last October. Scott even directed the first two episodes, making this his US TV directorial debut.\n “I’m always searching for new frontiers in the sci-fi genre and have found a true original in  Raised by Wolves— a wholly distinct and imaginative world, full of characters struggling with existential questions,&#34;  Scott told Deadline Hollywood in 2018 about what drew him to the project. &#34;What makes us human? What constitutes a family? And what if we could start over again and erase the mess we’ve made of our planet? Would we survive? Would we do better?”\n The tagline for the series gives little away: &#34;Mother was programmed to protect everyone after Earth had been destroyed. When the big bad wolf shows up, she is the one we must trust.&#34; But the basic premise revealed during development is that the story involves two androids serving as Mother (Amanda Collin) and Father (Abubakar Salim) figures on a strange virgin planet. They are programmed to raise human children to rebuild the population. However, the people of the fledgling colony develop stark religious differences, and &#34;the androids learn that controlling the beliefs of humans is a treacherous and difficult task.&#34;\n Judging by the trailer, the actual series is much weirder and more complicated than that brief description. &#34;Gather round, children,&#34; we hear Mother say. It appears to be story time for her young charges, but this one might give them nightmares. &#34;The Earth was destroyed by a great war,&#34; she says. &#34;I was programmed to protect you. And now we start again.&#34; Then Mother launches into a creepy retelling of the Three Little Pigs as images flash by in rapid succession, becoming increasingly strange and violent.\n Travis Fimmel plays Marcus, who seems to be the bad guy in the series. Or is he? All those images of a blood-spattered Mother emitting banshee wails with enough acoustic energy to make heads explode suggests otherwise. And what&#39;s Mother doing crouched and howling by a giant pit? &#34;The big bad wolf she was talking about? That&#39;s her,&#34; we are told.\n Raised by Wolves debuts on HBO Max on September 3, 2020. Will it be good? That&#39;s hard to say, although the production values seem pretty impressive and there&#39;s some strong  Alien vibes. It&#39;s Ridley Scott, so we&#39;ll definitely be watching.", "posttime": "2020-08-06 09:50:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "斯科特,ridley,母亲", "title": "雷德利·斯科特(Ridley Scott)由狼养大的预告片给我们带来了强烈的外星人氛围", "title_en": "Trailer for Ridley Scott’s Raised by Wolves is giving us strong Alien vibes", "transed": 1, "url": "https://arstechnica.com/gaming/2020/08/trailer-for-ridley-scotts-raised-by-wolves-is-giving-us-strong-alien-vibes/", "via": "", "real_tags": ["斯科特", "ridley", "母亲"]}, {"category": "", "categoryclass": "", "imagename": "1975ba80c51df71d29760657e785f8e3.jpg", "infoid": 1016583, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特朗普说：“如果你看看孩子们，你会发现，孩子们几乎--我几乎肯定会这么说--但几乎对这种疾病免疫。”“他们没有问题。他们就是没有问题。“。\n虽然特朗普的主账号@realDonaldTrump违规链接到@TeamTrump的推文，但它没有直接分享这条推文。尽管有一些错误的报道称特朗普自己的账户被锁定，但此时他的账户并没有受到与特朗普竞选账户相同的执法行动，后者似乎已经恢复了在太平洋时间下午6点左右发布推文的能力。\n推特发言人阿里·帕维拉在提供给TechCrunch的一份声明中表示：“你提到的@TeamTrump推文违反了推特关于新冠肺炎错误信息的规定。”“帐户所有者将被要求删除该推文，然后他们才能再次推文。”\n周三晚些时候，Facebook还对特朗普总统的账户采取了史无前例的行动，删除了这篇帖子，理由是该帖子违反了其针对有害的虚假声明的规定，即任何群体都不受该病毒的影响。\n总统的虚假声明是为了服务于他的信念，即学校应该在秋季重新开放教室。6月份，教育部长贝齐·德沃斯(Betsy DeVos)提出了类似的不科学主张，认为儿童是“疾病的拦路人”。\n在现实中，儿童和病毒之间的关系还没有得到很好的理解。虽然幼儿似乎不太容易感染严重的新冠肺炎病例，但他们感染和传播病毒的程度尚不清楚。在一份研究佐治亚州一个青年夏令营传播率的新报告中，疾病预防控制中心观察到，“所有年龄段的儿童都容易感染SARS-CoV-2，与早期报道相反，可能在传播中发挥重要作用。”", "note_en": "“If you look at children, children are almost — and I would almost say definitely — but almost immune from this disease,” Trump said. “They don’t have a problem. They just don’t have a problem.”\n While Trump’s main account @realDonaldTrump  linked out to the @TeamTrump tweet in violation, it did not directly share it. In spite of some mistaken reports that Trump’s own account is locked, at this time his account had not been subject to the same enforcement action as the Trump campaign account, which appears to have regained its ability to tweet  around 6PM PT.\n  “The @TeamTrump Tweet you referenced is in violation of the Twitter Rules on COVID-19 misinformation,” Twitter spokesperson Aly Pavela said in a statement provided to TechCrunch. “The account owner will be required to remove the Tweet before they can Tweet again.”\n Facebook also took its own  unprecedented action against President Trump’s account late Wednesday, removing the post for violating its rules against harmful false claims that any group is immune to the virus.\n The president’s false claims were made in service of his belief that schools should reopen their classrooms in the fall. In June, Education Secretary Betsy DeVos made similar unscientific claims, arguing that children are “ stoppers of the disease.”\n In reality, the relationship between children and the virus is not yet well understood. While young children seem less prone to severe cases of COVID-19, the extent to which they contract and spread the virus isn’t yet known. In a new report examining  transmission rates at a Georgia youth camp, the CDC observed that “children of all ages are susceptible to SARS-CoV-2 infection and, contrary to early reports, might play an important role in transmission.”", "posttime": "2020-08-06 09:49:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,锁定,sharing,推文", "title": "\n推特因分享新冠肺炎错误信息将特朗普竞选团队锁定在其账户之外", "title_en": "\n\t\t\t\tTwitter locked the Trump campaign out of its account for sharing COVID-19 misinformation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/05/twitter-trump-campaign-locked-account-team-trump-children-covid/", "via": "", "real_tags": ["推特", "锁定", "sharing", "推文"]}, {"category": "", "categoryclass": "", "imagename": "4b3a0ccbe1c4303039fa870880669e62.jpeg", "infoid": 1016582, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德国PC-Hersteller Schenker Macht auf LieferengpäSSE Be AMDS Kombiprozessoren der Serien Ryzen 4000U(笔记本电脑，15瓦)，4000H(笔记本电脑45瓦)和4000G(台式机)aufmerksam。Auslieferung Eigener笔记本麻省理工学院Dem Achtkerner Ryzen 7 4800H verzöGert sich um mindestens zwei Monate bis Ende 2020年9月。我们的Rücksprache MIT AMD ergab，dass es sich um Industrial eweite Lieferengpässe handelt and nicht bloãbstimte PC-Hersteller未婚夫sind。\n备注：Stellt Schenker einen vergleichSweise kleinen anbieter dar，der Laut eigem Reddit-Beitrag bereits 1600 offene Notebook-Bestellungen麻省理工学院Ryzen 7 4800H帽子。Zumindest derzeit könnnen Interessenten noch auf Modelle MIT Dem Sechskerner Ryzen 5 4600h osweichen.。贝格罗伯·埃伦·赫斯特勒恩·科恩特(Eren Herstellern Könnte)的死亡情况。\n申克青光眼，dass das Interesse nach den Ryzen-4000-Kombiprozessoren insbesondere be den groãen Herstellern Wie Lenovo zugenommen hat，we shesb amd die nachfrage nicht bedienen kann.。AMD HAT Seit der Vorstellung der Ryzen-CPU在MIT Lieferengpässen zu kämpfen，Weil der Chiphersteller die Wafer-Bestellungen bem AuftragsferTigge TSMC konservativ kalkulert and die Produktion nicht kurzfristig hochfahren Lassen kann。Laut einem Chinesischen Medienbericht von UDN soll and die wafer-Kapazität be TSMC imkommenden Jahr verdopeln.。\nSchon zur Vorstellung der Ryzen-4000-Kombiprozessoren麻省理工学院代号Renoir verzögerte sich die Markteinführung Enspchender Notebook um Wochen bis Monate。台式机-PC MIT Ryzen 4000g Sind Fast auschlie«lich in von Komplettsystemen erhältlich，Weil AMD die Modelle Bisher nicht ALS Retail-Versionen verkauft。\n您的位置：凡人谷知道&gt;地区&gt;台积电&gt;台积电&gt;游戏站5和Xbox系列X，德伦康比普罗佐伦AMD liefert(台积电Slucken derweil auch die Spielekonsolen Playstation 5 and Xbox Series X，Deren Kombiprozessoren AMD liefert)。从Verkaufsstart beder Modelle erfolgt im Herbst-die Produktion läuft传统式Monate im Voraus an，um LagerBestände aufzubauen.", "note_en": "Der deutsche PC-Hersteller Schenker macht auf Lieferengpässe bei AMDs Kombiprozessoren der Serien Ryzen 4000U (Notebooks, 15 Watt), 4000H (Notebooks 45 Watt) und 4000G (Desktop) aufmerksam. Die Auslieferung eigener Notebooks mit dem Achtkerner Ryzen 7 4800H verzögert sich um mindestens zwei Monate bis Ende September 2020. Eine Rücksprache mit AMD ergab, dass es sich um industrieweite Lieferengpässe handelt und nicht bloß bestimmte PC-Hersteller betroffen sind.\n    Weltweit betrachtet stellt Schenker einen vergleichsweise kleinen Anbieter dar, der  laut eigenem Reddit-Beitrag bereits 1600 offene Notebook-Bestellungen mit Ryzen 7 4800H hat. Zumindest derzeit können Interessenten noch auf Modelle mit dem Sechskerner Ryzen 5 4600H ausweichen. Bei größeren Herstellern könnte die Situation düsterer aussehen.\n      Schenker glaubt, dass das Interesse nach den Ryzen-4000-Kombiprozessoren insbesondere bei den großen Herstellern wie Lenovo zugenommen hat, weshalb AMD die Nachfrage nicht bedienen kann. AMD hat seit der Vorstellung der Ryzen-CPUs immer wieder  mit Lieferengpässen zu kämpfen, weil der Chiphersteller die Wafer-Bestellungen beim Auftragsfertiger TSMC konservativ kalkuliert und die Produktion nicht kurzfristig hochfahren lassen kann.  Laut einem chinesischen Medienbericht von  UDN soll AMD die Wafer-Kapazität bei TSMC immerhin im kommenden Jahr verdoppeln.\n Schon zur Vorstellung der Ryzen-4000-Kombiprozessoren mit Codenamen Renoir verzögerte sich die Markteinführung entsprechender Notebooks um Wochen bis Monate.  Desktop-PCs mit Ryzen 4000G sind fast ausschließlich in Form von Komplettsystemen erhältlich, weil AMD die Modelle bisher nicht als Retail-Versionen verkauft.\n Fertigungskapazitäten bei TSMC schlucken derweil auch die  Spielekonsolen Playstation 5 und Xbox Series X, deren Kombiprozessoren AMD liefert. Der Verkaufsstart beider Modelle erfolgt im Herbst – die Produktion läuft traditionell Monate im Voraus an, um Lagerbestände aufzubauen.", "posttime": "2020-08-06 09:49:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电脑,笔记本电脑,delayed,die", "title": "由于处理器短缺，Ryzen 4000笔记本电脑延迟至少两个月", "title_en": "Ryzen 4000 Notebooks Delayed By At Least Two Months Due To Shortage of Processors", "transed": 1, "url": "https://www.heise.de/news/AMD-Kombiprozessoren-Ryzen-4000U-H-G-Lieferengpaesse-bis-Herbst-4862559.html", "via": "", "real_tags": ["电脑", "笔记本电脑", "delayed", "die"]}]