[{"category": "", "categoryclass": "", "imagename": "d443488036e040fd0506f0ad97d893a4.png", "infoid": 1071929, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "流行病有一种让人对死亡产生怀疑的方式。说白了，当它第一次从我们的心中升起时，它的原始形式是：为什么？为什么地球上必须是这样？在《瘟疫》中，阿尔伯特·加缪 (Albert Camus) 的小说讲述了阿尔及利亚城市中令人痛苦的疾病，忠实的耶稣会士帕纳卢神父走上讲台并提供了他的解释。 “同样的瘟疫正在杀死你，”Paneloux 说，“对你有益，并为你指明道路。”在另一篇讲道中，帕内卢更进一步说：“孩子们的痛苦是我们的苦粮，但没有这种面包，我们的灵魂会因灵性饥饿而消亡。”年轻的查尔斯·达尔文也对这个问题感到疑惑，有一段时间，他想也许他已经找到了答案。事实上，他的论点与帕纳卢的布道有一些共同之处：死亡和苦难不可避免地与更高的善联系在一起，尽管达尔文的善与帕内卢的不同。在耶稣会士放置精神方向和营养的地方，达尔文插入了奇妙生物的进化。 《物种起源》的最后一段包含了这句引人注目的句子：“因此，从自然战争、饥荒和死亡中，我们能够设想的最崇高的目标，即高等动物的生产，直接遵循。”撇开大量的精神问题不谈，达尔文在狭义上是完全正确的：自然选择进化论中嵌入的观点是，生命以死亡为代价。我的意思不是在诗意或感伤的意义上，我们为我们在地球上的时间付出的代价是我们最后离开的悲伤。我的意思是，更确切地说，在更平淡和明确的意义上，我们在生物身上观察和欣赏的属性——对环境的精确适应性、复杂的构造、惊人而多样的能力——都是通过一个需要一定程度的过程建立起来的。死亡数量。在合理的假设下，人们甚至可以计算出有多少死亡。达尔文在阐述他的神学理论时没有意识到的是，性使计算结果对我们有利。在生死问题上，我们应该精确，所以考虑一个简单的例子，情景理论家称之为玩具模型的那种。想象一个由 100,000 个人组成的物种，生活在伊甸园中，并且与他们的资源公平平衡。每个人都只能生育一个后代，取代他或她自己在种群中的地位。迷人的。但是，如果物种要进化，这个伊甸园必须变成什么？假设一个人天生具有有益的基因突变——她的遗传物质、她的 DNA 发生了变化，这使她比所有同龄人都更好地适应。她可以更好地隐藏或更快地觅食；更有效地狩猎或更强大的战斗——无论突变是什么，它都会给她一个支持。\n为了使这种新突变的频率从十万分之一上升到十万分之一，携带它的个体必须产生两个而不是一个后代。但我们已经说过，人口稳定在 100,000 人的有限资源之下。因此，如果多出一个携带新突变的个体进入种群，那么多出一个不携带新突变的个体必须死亡，可以说是有改进的余地。更一般地说，有益突变的流行率每增加一次，就需要一个额外的死亡。为了使我们 100,000 人口中的新突变增加 1%，必须增加 1,000 人死亡。为了让整个种群共享新的突变——正如进化生物学家所说，它要被固定——必须发生 100,000 额外的死亡。因此，进化的费用以死亡货币支付。我们应该添加一些细微差别。对于有益突变频率的每一次增量增加，从技术上讲，所需要的并不是死亡，而只是一个人无法生存和繁殖。也许有人只是没有得到分配给她的后代。重点只是父母的遗传谱系必须结束。但在本质上，这通常意味着未来的父母或后代的死亡。一个合理的速记就是死亡。当我们为我们的玩具模型添加更多的生物现实主义时，情况看起来更加严峻。您可能还记得，几乎所有动物都是二倍体，这意味着它们携带两个基因组副本。许多新的突变只是半显性的——也就是说，它们在决定宿主的外观或行为方式时会与宿主基因组中的另一个副本妥协。伟大的种群遗传学家 JBS Haldane 写下了一个简单的数学模型，以估计一个新的有利突变在整个二倍体生物种群中传播需要多少额外的死亡。刚才使用我们的玩具模型，我们推断出，分布在整个进化变化历史中的额外死亡人数大约等于任何一代的人口规模（我们的 100,000）。在他的具有半显性突变的二倍体模型中，霍尔丹发现，在任何一代中，这个数字大约是种群规模的 30 倍。反vaxxers和反转基因活动家有什么共同点？支持这两个“反”的是一个共同的信念，即因为疫苗和转基因生物是“不自然的”，所以它们是坏的，这对许多人来说——无论他们对疫苗和转基因生物的感受如何——都陷入了相反的境地：什么是自然的……阅读更多什么我一直指的“额外”死亡也可以称为“有用”死亡，因为它们是导致有益突变流行率上升的死亡；从进化的角度来看，死亡并非毫无意义。让我们考虑一个真实的例子，而不是我们想象的和理想化的 100,000 个人的物种。黑猩猩和人类最近的共同祖先是一种四肢移动的猿类，它的骨骼很像现代黑猩猩的骨架，而且，也许最重要的是，它有一个黑猩猩大小的大脑，而不是我们膨胀的智人大脑。非常近似地，将我们的黑猩猩祖先转变为现代人类的所有进化变化都涉及原始人类种群中频率增加的基因突变。那么，人类黑猩猩的祖先变成智人需要多少次有用的死亡？我们不知道随着黑猩猩-人类祖先进化成现代智人，自然选择到底有多少突变受到青睐。但是就这个论点而言，我们真的不需要一个确切的数字，只需要一个合理的数量级估计，这可能是可以实现的。根据最近发表的对人类和黑猩猩基因组的分析，我进行了粗略计算，以估计从黑猩猩-人类祖先到人类的谱系中阳性选择突变的数量。我想出了100,000。 （所说的信封，如果你有兴趣，可以在下面阅读。）\n基因组分析还可以（相当令人惊讶地）为我们估计从黑猩猩-人类祖先到人类的谱系中的种群规模。显然，这个数字在黑猩猩-人类祖先产生智人的数百万年中发生了很大变化。有过人口膨胀和严重瓶颈的时期。一个合理的中间位置是 50,000 的数量级。回想一下，在 Haldane 对我们的玩具模型的改进中，将一个新的突变从单一副本推向优势，最终达到固定所需的“额外”或“有用”死亡人数是人口中一代人的 30 倍。因此，这意味着将黑猩猩祖先转变为真正的智人所需的最少有用死亡数将是 100,000（即选定突变的数量）乘以 50,000（即种群规模）乘以 30（霍尔丹因子）。这给了我们 1500 亿有用死亡的答案。嗯。这真是一个很大的数字。从黑猩猩祖先到现代人类的整个谱系中，总共有多少人死亡，不管有用与否？根据我们对种群规模的估计（我们刚刚使用）、平均世代时间（我们可以很好地猜测）以及自黑猩猩和人类分裂以来的总时间（这个数字来自考古学和遗传学)，我们可以再做一个简单的计算来估计死亡总数。我刚刚算出来，结果是…… 175 亿。哎呀。自然选择使人类从其祖先进化而来的有用或额外死亡人数怎么可能大于已发生的死亡总数？嗯，不能。那么解释是什么呢？在很大程度上，这是性。假设某个人有一个有益的突变。假设某个女人有她自己的一个，只是它不同：它赋予不同的优势，并且位于基因组中的其他位置。说，最后，这个男人和这个女人聚在一起生孩子。其中一个孩子可能同时获得两种有益的突变，而另一个孩子可能两者都没有。当双重幸运的孩子存活并繁殖而双重不幸的孩子没有时，一次死亡变得双重有用：它为两个有益突变的频率同时上升付出了代价。您可以为有两个突变、三个等等的父母重复这个论点。多亏了性，一次死亡可以将许多有益的突变推向最终的固定状态。因此，我们可以得出结论，虽然生命的代价是死亡，但性提高了汇率。在晚年，达尔文似乎放弃了任何认为自然选择理论可以救赎死亡和苦难，从而为仁慈的上帝辩护的观念。事实上，一场流行病似乎在改变他的观点方面发挥了关键作用。目睹心爱的小女孩安妮因猩红热甚至肺结核而痛苦和死亡，彻底粉碎了他的信念。在那之后，达尔文的观点与帕内卢神父的观点相比，与加缪笔下英勇的叙述者里厄博士的观点似乎没有什么共同之处，里厄博士不知疲倦地努力阻止瘟疫。里厄强烈反对帕内卢的布道。祸害就是祸害，他辩称，没有任何证据可以证明这一点。\n然而，尽管达尔文在创造美丽的生物时可能没有找到对死亡的最终证明，但他会继续在这种美丽中找到深刻的快乐。在性选择中，他发现了生命中最奢侈的表现的起源。他非常重视智人从原始人类祖先的进化过程中的这一过程。然而，据我所知，他从未意识到霍尔丹和基因组学帮助我们在这里看到了什么，性别可以大大减少某种程度的进化所需的损失。 Aaron Hirsh 是一位作家和生物学家，对教育、进化和环境有着浓厚的兴趣。他的第一本书《向大海讲述我们的路》获得了国家自然历史写作户外图书奖，并入围了威廉·萨罗扬国际奖。他现在正在写另一本关于我们星球的历史和命运的书。 Aaron 目前还是 Ecology Project International 的董事会主席。这篇文章最初的标题是“生命的代价是死亡，但性提高了汇率”，并于 2020 年 7 月首次出现在我们的“爱与性”杂志上。", "note_en": "Epidemics have a way of making one wonder about death. To put it plainly, in the raw form it takes as it first rises from our hearts:  Why? Why on Earth does it have to be this way?\n In  The Plague,  Albert Camus’ novel of harrowing disease in an Algerian city, Father Paneloux, a faithful Jesuit, steps to the pulpit and offers his explanation. “This same pestilence which is slaying you,” Paneloux says, “works for your good and points your path.” In another sermon, Paneloux goes further: “The suffering of children was our bitter bread, but without this bread our soul would perish from its spiritual hunger.”\n A young Charles Darwin, too, wondered about this problem, and for a while, he thought perhaps he had found an answer. Indeed his argument had something in common with Paneloux’s sermon: Death and suffering were linked inescapably to a higher good, though Darwin’s good was different from Paneloux’s. Where the Jesuit placed spiritual direction and nourishment, Darwin inserted the evolution of wondrous living things. The final paragraph of  On the Origin of Species includes this remarkable sentence: “Thus, from the war of nature, from famine and death, the most exalted object which we are capable of conceiving, namely, the production of the higher animals, directly follows.”\n  Setting vast spiritual questions aside, there is a narrow sense in which Darwin was perfectly right: Embedded in the theory of evolution by natural selection is the idea that life is paid for with death. I mean this not in the poetic or sentimental sense that the price we pay for our time here on Earth is the sadness of our final departure. I mean it, rather, in the more prosaic and definite sense that the attributes we observe and admire in living creatures—precise adaptive fit to an environment, intricacy of construction, astonishing and diverse capabilities—are all built by a process that requires a certain quantity of death.\n One can even calculate, under reasonable assumptions, just how much death. What Darwin did not realize, as he formulated his theodicy, is that sex tips the calculations strongly in our favor.\n  In matters of life and death, we ought to be precise, so consider a simple example, the sort of scenario theoreticians would call a toy model. Imagine a species that consists of 100,000 individuals, living in Edenic and equitable balance with their resources. Every individual gets to produce exactly one offspring, replacing him or herself in the population. Lovely. But what must become of this Eden if the species is to evolve?\n Say one individual is born with a beneficial genetic mutation—a change in her material of inheritance, her DNA, that makes her better adapted than all her peers. She can hide better or forage faster; hunt more effectively or battle more powerfully—whatever the mutation is, it gives her a leg up.\n  For this new mutation to climb in frequency from 1 in 100,000 to 2 in 100,000, the individual who carries it must produce not one but two offspring. But the population, we’ve said, is held steady, by some limited resource, at 100,000 individuals. So for one extra individual bearing the new mutation to enter the population, one extra individual who does not bear the new mutation must die, making room for improvement, so to speak. More generally, one extra death is required for each incremental increase in the beneficial mutation’s prevalence. For the new mutation to increase by 1 percent in our population of 100,000, 1,000 extra deaths must occur. For the new mutation to be shared by the whole population—for it to  go to fixation, as evolutionary biologists would put it—100,000 extra deaths must occur. Thus, the dues of evolution are paid in the currency of death.\n We ought to add some nuance. For each incremental increase in the frequency of the beneficial mutation, it’s not technically a death that’s called for, but only the failure of one individual to survive and reproduce. Maybe someone just doesn’t get to have her allotted offspring. The point is only that the parent’s genetic lineage must come to an end. But in nature, that usually means mortality for either the prospective parent or the offspring. A reasonable shorthand is, well, just death.\n When we add just a bit more biological realism to our toy model, the situation looks grimmer still. As you may recall, nearly all animals are diploid, meaning they carry two copies of their genome. Many new mutations are only semi-dominant—that is, they compromise with the other copy in their host’s genome in determining the way the host looks or acts. The great population geneticist J.B.S. Haldane wrote down a simple mathematical model to estimate how many extra deaths would be required for a new advantageous mutation to spread through the whole population of a diploid organism. Using our toy model just a moment ago, we reasoned that the number of extra deaths, spread over the entire history of the evolutionary change, would be about equal to the population size in any single generation (our 100,000). In his model of diploids with semi-dominant mutations, Haldane found that the number was more like 30 times the population size in any single generation.\n What do anti-vaxxers and anti-GMO campaigners have in common? Underpinning both “antis” is a shared belief that because vaccines and GMOs are “unnatural,” they’re bad, which for many people—whatever their feelings about vaccines and GMOs—segues into its inverse: What’s natural...  READ MORE\n  What I’ve been referring to as “extra” deaths could also be called “useful” deaths, for they are the deaths that cause an uptick in the prevalence of a beneficial mutation; the deaths that, from an evolutionary point of view, aren’t for nothing.\n Instead of our imaginary and idealized species of 100,000 individuals, let’s consider a real example. The most recent common ancestor of chimpanzees and humans was an ape that moved on all fours, had a skeleton a lot like a modern chimp’s, and, perhaps most important of all, had a chimp-sized brain, not our inflated  sapiens brain. To a very close approximation, all the evolutionary changes that transformed our chimp-human ancestor into modern humans involved genetic mutations increasing in frequency in the population of proto-humans. So how many useful deaths did it take to transform the chimp-human ancestor into  Homo sapiens?\n We don’t know exactly how many mutations were favored by natural selection as the chimp-human ancestor evolved into modern  Homo sapiens. But for purposes of this argument, we don’t really need an exact number, just a reasonable, order-of-magnitude estimate, and that’s perhaps within reach. Based on recent published analyses of human and chimp genomes, I did a back-of-the-envelope calculation to estimate the number of positively selected mutations in the lineage that leads from the chimp-human ancestor to humans. I came up with 100,000. (Said envelope, in case you’re interested, can be read below.)\n   Genomic analysis can also (rather amazingly) give us an estimate of the population size along the lineage from the chimp-human ancestor to humans. Obviously, this number changed a lot over the course of the millions of years it took for the chimp-human ancestor to give rise to  Homo sapiens. There were periods of expansive population as well as severe bottlenecks. A reasonable middle-ground is on the order of 50,000.\n Recall that, in Haldane’s improvement to our toy model, pushing a new mutation from a single copy to predominance and finally to fixation required 30 times as many “extra” or “useful” deaths as there were individuals in the population during a single generation. So that means the minimal number of useful deaths required to transform the chimp-human ancestor into a bona fide  Homo sapiens would be 100,000 (that’s the number of selected mutations) times 50,000 (that’s the population size) times 30 (Haldane’s factor). That gives us an answer of 150 billion useful deaths.\n  Hmmm. That’s a really big number. How many deaths altogether, useful or not, were there along the lineage from the chimp-human ancestor to modern humans? Based on our estimate of the population size (which we just used), the average generation time (which we can make a pretty good guess at), and the total time since chimps and humans split (a number that comes from both archaeology and genetics), we can do another simple calculation to estimate the total number of deaths. I just worked it out, and it comes to ... 17.5 billion.\n Oops. How can the number of useful or extra deaths that natural selection needs to evolve a human from its ancestor be larger than the total number of deaths that have taken place? Well, it can’t. So what’s the explanation?\n In large part, it’s sex. Say a certain man has a beneficial mutation. And say a certain woman has one of her own, only it’s different: It confers a different advantage, and it’s located somewhere else in the genome. And say, finally, this man and this woman get together and have kids. One of those kids might get both beneficial mutations, while another kid might get neither. When the doubly lucky kid survives and reproduces, while the doubly unlucky kid doesn’t, a single death becomes doubly useful: It pays for the simultaneous rise in frequency of two beneficial mutations.\n You can repeat the argument for parents who have two mutations, three, and so on. Thanks to sex, a single death can push many beneficial mutations toward their ultimate fixation. We can conclude, therefore, that although the price of life is death, sex improves the exchange rate.\n  Later in life Darwin seems to have relinquished any notion that the theory of natural selection might redeem death and suffering, and thus vindicate a benevolent God. In fact, an epidemic appears to have played a pivotal role in shifting his views. What shattered his faith once and for all was watching his beloved little girl Annie suffer and die from scarlet fever and perhaps tuberculosis. After that, Darwin’s views seem to have had less in common with Father Paneloux’s than they did with those of Dr. Rieux, Camus’ heroic narrator, who works tirelessly to stop the plague. Rieux vehemently rejects Paneloux’s sermon. The scourge is a scourge, he argues, and there’s no vindicating it.\n And yet, though Darwin may have found no ultimate vindication for death in the creation of beautiful living things, he would continue to find profound joy in such beauty. In sexual selection, he discovered the origin of life’s most extravagant displays. He attributed a great deal of importance to that process in the descent of  Homo sapiens from hominid ancestors. To my knowledge, though, he never realized what Haldane and genomics have helped us to see here, that sex can greatly reduce the toll required for a certain measure of evolution.\n  Aaron Hirsh is a writer and biologist with strong interests in education, evolution, and the environment. His first book,  Telling Our Way to the Sea,  won a National Outdoor Book Award for Natural History Writing and was a finalist for the William Saroyan International Prize. He is now working on another book about the history and fate of our planet. Aaron is also currently board chair for Ecology Project International.\n  This article  was originally titled “The Price of Life Is Death, but Sex Improves the Exchange Rate,” and first appeared in our “Love &amp; Sex” issue in July 2020.", "posttime": "2021-08-07 13:20:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "die,死亡", "title": "为什么我们必须死？", "title_en": "Why Do We Have to Die?", "transed": 1, "url": "https://nautil.us/issue/104/harmony/why-do-we-have-to-die", "via": "", "real_tags": ["die", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "39fd9b35dcebcf36aeba4e61ada32066.jpg", "infoid": 1071927, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份新闻声明显示，美国空军与一组风险投资公司一起向 Hermeus 投资了 6000 万美元，Hermeus 是一家总部位于佐治亚州的初创公司，该公司正在努力制造世界上第一架可重复使用的高超音速飞机。 7 月 30 日授予的新合同为 Hermeus 设定了雄心勃勃的目标，将在未来三年内完成。其中包括建造该公司 Quarterhorse 飞机的三架原型机，以及测试其全尺寸可重复使用的高超音速推进系统。如果一切按计划进行，Quarterhorse 客机将能够以惊人的 5 马赫速度飞行，从 3836 英里/小时（6174 公里/小时）开始。相比之下，NASA 的新型超音速喷气式飞机 X-59 将以 1.5 马赫的速度飞行，最高时速可达 990 英里/小时。由于 Hermeus 的飞机最终将能够以五倍于音速的速度飞行，因此它将能够在 90 分钟内从纽约飞往伦敦——而不是今天的商业客机通常需要 7 个小时。为了达到这些速度，Hermeus 正在开发一种专有的基于涡轮的联合循环 (TBCC) 发动机，该发动机基于用于各种高速飞机的 GE J85 涡轮喷气发动机，包括维珍银河的 White Knight 航母和 Boom Supersonic 的原型 XB -1 架飞机。第一个 Quarterhorse 原型机将无人值守——与维珍银河的第一次太空飞机任务无人值守一样，最早的飞行测试将不会进行，以消除对人类生命的风险，并允许公司开始其提前试飞。根据《航空国际新闻》2020 年的一份报告，Hermeus 已经建造并测试了小型高超音速发动机原型，目前正在开发其 TBCC 发动机的全尺寸发动机演示器。 “到飞行测试活动结束时，Quarterhorse 将成为世界上速度最快的可重复使用的飞机，也是同类飞机中第一架使用 TBCC 发动机的飞机，”Hermeus 在其新闻稿中表示。据该公司称，Quarterhorse 将其置于高超音速技术的双重用途领域，这意味着其技术可用于商用客机和军事用途。今年 3 月，Hermeus 还宣布与 NASA 签署一项太空法案协议（SAA），用于其高速飞机的研发。\n虽然改变游戏规则和颠覆性等术语经常出现在技术领域，但成功开发出能够以不到四分之一的旅行时间到达长途目的地的飞机无疑值得大肆宣传。如果高超音速飞行和 eVTOL 空中出租车在未来几年兑现其承诺，我们将生活在一个更加互联的世界中。", "note_en": "The U.S. Air Force joins a group of venture capital firms in making a $60 million investment in Hermeus, a Georgia-based startup that is striving to make the world&#39;s first reusable hypersonic aircraft,  a press statement reveals.\n The new contract, awarded on July 30, sets ambitious objectives for Hermeus, to be accomplished over the next three years. These include the building of three prototypes of the company&#39;s Quarterhorse aircraft and the testing of its full-scale reusable hypersonic propulsion system.\n If all goes to plan, the Quarterhorse passenger aircraft will be capable of flying at a staggering Mach 5 speeds, starting at 3836 mph (6174 km/h). By comparison, NASA&#39;s  new supersonic jet, the X-59, will fly at Mach 1.5 and reach top speeds of  990 mph.\n  As Hermeus&#39; aircraft will eventually be able to fly five times the speed of sound, it will be capable of traveling from New York to London in only 90 minutes — instead of seven hours it typically takes today&#39;s commercial airliners.\n  In order to reach those speeds, Hermeus is developing a proprietary turbine-based combined cycle (TBCC) engine, based on the GE J85 turbojet engine used for a variety of high-speed aircraft including Virgin Galactic&#39;s White Knight carrier aircraft  and Boom Supersonic&#39;s prototype XB-1 aircraft.\n   The first Quarterhorse prototype is set to be unmanned — much in the same way that Virgin Galactic&#39;s first space plane missions were uncrewed, the earliest flight tests will not be piloted so as to eliminate the risk to human life and to allow the company to start its flight testing earlier. According to a 2020 report by  Aviation International News, Hermeus has already built and tested a small-scale hypersonic engine prototype and it is now working on a full-scale engine demonstrator of its TBCC engine.\n   &#34;By the end of the flight test campaign, Quarterhorse will be the fastest reusable aircraft in the world and the first of its kind to fly a TBCC engine,&#34; Hermeus stated in its press release. According to the company, the Quarterhorse places it in the dual-use space for hypersonic technology, meaning its technologies can be utilized for commercial passenger aircraft as well as for military uses. In March this year, Hermeus also  announced the signing of a Space Act Agreement (SAA) with NASA for R&amp;D on its high-speed aircraft.\n While terms such as game-changing and disruptive are often thrown around in the technological space, the successful development of an aircraft that would reach long-haul destinations at less than a quarter of the travel time would undeniably be worthy of the hype. If hypersonic flight and  eVTOL air taxis deliver on their promise in the coming years, we will be living in an immensely more connected world.", "posttime": "2021-08-07 12:25:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,美国,投资,force,飞机", "title": "美国空军投资 Hermeus 的高超音速飞机开发", "title_en": "US Air Force Invests In Hermeus' Hypersonic Aircraft Development", "transed": 1, "url": "https://interestingengineering.com/us-air-force-plans-develop-the-fastest-reusable-aircraft-in-the-world", "via": "", "real_tags": ["开发", "美国", "投资", "force", "飞机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071924, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用户指南 有关由 NOAA GSL 信息学和可视化团队创建的 HRRR 烟雾模型的信息。问题、评论或反馈？发送电子邮件至：", "note_en": "User Guide  Information on  HRRR Smoke Model    Created by the NOAA GSL Informatics and Visualization Team. Questions, comments, or feedback?  Send an email to:", "posttime": "2021-08-07 12:24:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,烟雾,smoke,评论", "title": "NOAA 烟雾预测模型可视化", "title_en": "NOAA Smoke Forecast Model Visualization", "transed": 1, "url": "https://hwp-viz.gsd.esrl.noaa.gov/smoke/index.html", "via": "", "real_tags": ["可视化", "烟雾", "smoke", "评论"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071923, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更多 太平洋夏令时间下午 6:08 我们正在调查 US-EAST-1 区域中 DynamoDB 的错误率和延迟增加情况。太平洋夏令时间下午 6:32 我们可以确认 US-EAST-1 区域中 DynamoDB 的错误率增加。我们已经确定了问题的根本原因，并正在努力解决问题。太平洋夏令时间下午 7:03 我们已经看到 US-EAST-1 区域中 DynamoDB 的错误率有所改善，并将继续努力实现完全解决。对于遇到 503 错误的客户，在某些情况下重试可能会解决问题。在其他情况下，重新创建与 DynamoDB 的连接可能会解决错误率问题。我们将继续采取措施全面解决所有受影响的表格。 PDT 晚上 8:11 我们继续在解决 US-EAST-1 区域中 DynamoDB 错误率增加的问题方面取得进展。问题的根本原因是 DynamoDB 使用的元数据子系统存在问题，其中多个节点处于不健康状态。我们将继续努力恢复这些节点的健康状况。该问题影响了与元数据子系统中运行状况不佳的节点相关联的 DynamoDB 表的子集。对于这些表，在我们解决问题之前，客户的错误率会增加。与受影响的元数据节点无关的 DynamoDB 表不受此问题的影响。我们将继续努力实现全面解决。太平洋夏令时间晚上 9:00 我们继续看到 US-EAST-1 区域中受影响的 DynamoDB 表的错误率有所改善。自活动开始以来，我们发现错误率降低了 75%，现在正在努力解决其余 DynamoDB 表的错误。更多 PDT 晚上 8:18 我们正在调查 US-EAST-1 区域中集群创建和更新操作的错误率增加情况。一些现有集群也受到影响。更多 太平洋夏令时间 8:21 PM 我们正在调查新负载均衡器的配置延迟增加、负载均衡器 CloudWatch 指标的延迟传播以及来自 US-EAST-1 区域网络负载均衡器的 DescribeTargetHealth API 的不一致的运行状况检查状态。", "note_en": "more      6:08 PM PDT We are investigating increased error rate and latencies for DynamoDB in US-EAST-1 region.\n 6:32 PM PDT We can confirm increased error rates for DynamoDB in the US-EAST-1 Region. We have identified the root cause of the issue and are working towards resolution.\n 7:03 PM PDT We have seen some improvement to the error rates for DynamoDB in the US-EAST-1 Region and continue to work towards full resolution. For customers that are experiencing 503 errors, retries may resolve the issue in some cases. In other cases, recreating the connection to DynamoDB may address the error rates. We continue to take steps towards full resolution for all affected tables.\n 8:11 PM PDT We continue to make progress in addressing the increased error rates for DynamoDB in the US-EAST-1 Region. The root cause of the issue is a problem with the metadata subsystem used by DynamoDB, where several nodes are in an unhealthy state. We continue to work towards restoring the health of these nodes. The issue affected a subset of DynamoDB tables that are associated with the unhealthy nodes in the metadata subsystem. For these tables, customers will experience increased error rates until we have resolved the issue. DynamoDB tables that are not associated with the affected metadata nodes, are not affected by this issue. We continue to work towards full resolution.\n 9:00 PM PDT We continue to see an improvement in the error rates for affected DynamoDB tables in the US-EAST-1 Region. Since the start of the event, we have seen a 75% reduction in error rates and are now working on resolving the errors for the remaining DynamoDB tables.\n  more      8:18 PM PDT We are investigating increased error rates for Cluster create and update operations in the US-EAST-1 Region. Some existing clusters are also impacted.\n  more      8:21 PM PDT We are investigating increased provisioning latencies for new load balancers, delayed propagation of load balancer CloudWatch metrics, and inconsistent health check statuses from the DescribeTargetHealth API for Network Load Balancers in the US-EAST-1 Region.", "posttime": "2021-08-07 12:23:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "错误率,error", "title": "US-EAST-1 区域中 DynamoDB 的错误率增加", "title_en": "Increased error rates for DynamoDB in the US-EAST-1 Region", "transed": 1, "url": "https://status.aws.amazon.com/?test=1", "via": "", "real_tags": ["错误率", "error"]}, {"category": "", "categoryclass": "", "imagename": "31cae700a66e499b3bece4dd3f90c547.jpg", "infoid": 1071921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN) 该公司周五向 CNN Business 证实，从周一开始，所有亚马逊美国仓库员工都将再次被要求在室内戴口罩，无论他们是否接种了疫苗。此举是在亚马逊 (AMZN) 表示将把企业员工的办公室返回日期推迟到明年初之后的一天。背靠背的公告突显了美国最大的雇主之一如何在与 Delta 变体相关的感染不断增加的情况下重新考虑其冠状病毒政策。亚马逊发言人凯利·南特尔 (Kelly Nantel) 表示：“为了应对新的 Covid-19 变种在美国的传播以及公共卫生当局和我们自己的医学专家的指导，无论疫苗接种情况如何，我们都要求在室内戴口罩。”对 CNN Business 的声明。 Nantel 说：“我们正在密切监视局势，并将继续遵循当地政府的指导，并与领先的医疗保健专业人员密切合作，在我们前进的过程中收集他们的意见和建议，以确保我们的建筑物为我们团队的安全进行优化。”随着大流行的恶化，越来越多的大公司改变了对企业和一线员工的政策，在某些情况下需要接种疫苗。但就目前而言，亚马逊似乎并未采取这一步：Nantel 拒绝评论该公司是否正在考虑强制接种疫苗。亚马逊 (AMZN) 已于 5 月 24 日放宽了对完全接种疫苗的美国仓库工人的口罩要求，至少在当地法规没有继续要求的地区是这样。最近，亚马逊表示将在 7 月底之前停止提供现场 Covid-19 测试，理由是测试和疫苗的广泛可用性。由于家庭和公司依赖其各种服务，亚马逊的业务在大流行期间蓬勃发展。但是，在一些工人表示该公司没有提供足够的防护装备或对其仓库进行充分消毒后，该公司在大流行初期受到批评，导致抗议和诉讼。", "note_en": "(CNN)All of Amazon&#39;s US warehouse employees will once again be required to wear masks indoors beginning on Monday, whether they are vaccinated or not, the company confirmed to CNN Business on Friday.\n The move comes one day after  Amazon  (  AMZN) said it would  delay its office return date for corporate employees until early next year. The back-to-back announcements highlight how one of America&#39;s largest employers is rethinking its coronavirus policies in the face of rising infections linked to the Delta variant.\n &#34;In response to the concerning spread of new Covid-19 variants in the US and guidance from public health authorities and our own medical experts, we are requiring face coverings indoors regardless of vaccination status,&#34; said Kelly Nantel, an Amazon spokesperson, in a statement to CNN Business.\n     &#34;We are monitoring the situation closely and will continue to follow local government guidance and work closely with leading medical healthcare professionals, gathering their advice and recommendations as we go forward to ensure our buildings are optimized for the safety of our teams,&#34; Nantel said.\n   A growing number of big companies have shifted their policies for corporate and frontline workers as the pandemic has worsened, in some cases requiring vaccinations. But for now, Amazon does not appear to be taking that step: Nantel declined to comment on whether the company is considering a vaccine mandate.\n  Amazon  (  AMZN) had  relaxed its mask requirement on May 24 for fully vaccinated US warehouse workers, at least in areas where local regulations did not continue to require them. More recently, Amazon said it would stop offering on-site Covid-19 testing by the end of July, citing the wide availability of testing and vaccines.\n Amazon&#39;s  business boomed during the pandemic as households and companies leaned on its various services. But the company was criticized early on in the pandemic after some workers said the company had not provided sufficient protective gear or adequately sanitized its warehouses, leading to protests and lawsuits.", "posttime": "2021-08-07 10:38:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,美国,亚马逊,仓库,reinstates", "title": "亚马逊恢复对所有美国仓库工人的口罩要求", "title_en": "Amazon reinstates mask requirement for all US warehouse workers", "transed": 1, "url": "https://edition.cnn.com/2021/08/06/tech/amazon-warehouse-mask-mandate/index.html", "via": "", "real_tags": ["amazon", "美国", "亚马逊", "仓库"]}]