[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1016843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "公开工作：Amazon.com上开源软件的制作和维护[Nadia Eghbal]。*免费*根据符合条件的报价发货。公开工作：开源软件的制作和维护", "note_en": "Working in Public: The Making and Maintenance of Open Source Software [Nadia Eghbal] on Amazon.com. *FREE* shipping on qualifying offers. Working in Public: The Making and Maintenance of Open Source Software", "posttime": "2020-08-07 14:57:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开源,public", "title": "公开工作：开源软件的制作和维护", "title_en": "Working in Public: The Making and Maintenance of Open Source Software", "transed": 1, "url": "https://www.amazon.com/dp/0578675862/", "via": "", "real_tags": ["软件", "开源", "public"]}, {"category": "", "categoryclass": "", "imagename": "554da4f291a5595676e5a8e720b365a5.jpg", "infoid": 1016840, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Https://n-o-d-e.net/zeroterminal3.html", "note_en": "https://n-o-d-e.net/zeroterminal3.html", "posttime": "2020-08-07 12:34:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,raspberry-pi,终极,ultimate,net", "title": "努力打造终极手持Raspberry Pi电脑[视频]", "title_en": "Trying to build the ultimate handheld Raspberry Pi computer [video]", "transed": 1, "url": "https://youtu.be/wiJqUWfR90I", "via": "", "real_tags": ["电脑", "终极", "ultimate", "net"]}, {"category": "", "categoryclass": "", "imagename": "ce439342166000e47576b2e5a31e52c8.jpg", "infoid": 1016838, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Hyunjoo Albrecht经营着一家名为Sinto Gourmet的泡菜和辣酱制造公司。在过去的十年里，她对“食品科技”公司有着不同寻常的亲密优势。这是因为她一直是许多硅谷送货应用程序和其他风投支持的企业的房东，这些企业试图“颠覆食品领域”。\n这是阿尔布雷希特如何与这些公司合作，在旧金山湾区建立自己的食品企业的故事，为什么她发誓要停止与他们合作，以及在大流行期间，她是如何最终与一家过去解雇过她的公司合作的。\n与依靠风险投资蓬勃发展的食品科技公司不同，阿尔布雷希特花了数年时间才建立起自己的业务。她于2003年从韩国移民，用朝鲜祖母的一些食谱创办了Sinto Gourmet。然后她开始慢慢扩大她的发酵产品。\n她卖一盆盆辛辣的纳帕卷心菜泡菜。有一个温和的版本和一个嘎吱作响的选择。2014年，她开始销售加州发酵块根蔬菜的混合物：红甜菜、萝卜、萝卜、芸苔和胡萝卜。除了泡菜，阿尔布雷希特还开发了两种辣酱：浓郁的苹果和芝麻大蒜。\n阿尔布雷希特开始在杂货店销售产品，然后直接卖给个人。最终，生意发展得足够快，她需要一个在旧金山很难找到的商业厨房。所以她决定拿出毕生积蓄建造一个大厨房。\n她的厨房是该市较大的商业烹饪设施之一。它在湾景附近一个大约5000平方英尺的仓库里。仅步入式冰柜就有500平方英尺。她开玩笑说，它比旧金山的大多数一居室公寓都要大。\n阿尔布雷希特的计划是在那里制作泡菜，并将多余的空间出租给当地的其他厨师。但蜂拥到她的空间的租户并不是小的独立厨师，而是风险资本支持的食品公司。\n阿尔伯切特开始把厨房里闲置的空间租给他们。她租用的许多公司都有宏伟的计划，但当风险资本耗尽时，它们就消失了。她的租户包括名为Easy as Pi的披萨送货应用程序、名为Din的送餐服务公司和一家名为Sprig的现成餐包公司等公司。\n在过去的五年里，美国有超过2,000家风险资本投资到了人们所说的食品科技公司，“从送货到生物工程肉，无所不包。根据一家名为AgFUnder的风险投资基金的一份报告，仅2019年就有近200亿美元的投资。\n许多多年来如雨后春笋般涌现的公司，如Sprrig和Munchery，都已经破产。在KQED，我们报道了当地的厨师Munchery是如何与之合作的，他们不得不奋斗一年多才能偿还在企业关闭时欠下的债务。\n当阿尔布雷希特看着这些食品科技公司在她的厨房里来来去去时，她有时会试图给年轻的高管一些建议。“他们就是不听，”阿尔布雷希特说。“他们唯一关心的是他们的目标、他们的投资者和他们的‘可扩展性’。”\n阿尔布雷希特说，她在这些公司遇到的大多数人都与她和当地其他食品企业的老板非常不同。她努力描述其中的不同之处，但这不仅仅是他们的公司理念。\n她认识的许多试图通过出售食品谋生的人都是移民、妇女和有色人种-与食品技术潜在的企业家截然不同。“他们是年轻的白人，”她说，“就像你在J.Crew的目录中看到的那种人。”\n他们把谁带到自己的公司工作也有很大的不同。Albrecht雇佣当地工人制作泡菜，其中许多人多年来一直在准备和处理食物。他们看起来与食品科技公司的工人非常不同。\n“他们雇佣的这些人也都来自硅谷公司，他们没有食品制造公司的经验，”Albrecht说。“这些职位通常是后勤、运营、市场营销等所有人员的职位。这些就是他们雇佣的人。“。\n关于她的一位前房客的一件轶事确实切中要害，因为她的生意与他们的生意有多么不同。\n一家套餐公司的租户想要在容器里自动装满几盎司的酱汁，所以Albrecht说他们买了一台巨型机器来把酱汁挤进杯子里。它是从一个大托盘上运进来的，组装起来是一项庞大的作业。阿尔布雷希特说，他们对这台机器真的很兴奋。\n但当他们最终把它连接起来时，它并没有像预期的那样工作。她讲故事时忍不住笑了起来。“当酱汁从这台机器里出来，落到小碟杯里时，它落得不够漂亮。”所以他们就不再使用它了。他们就把它留在那里了。“。这台巨大的机器在托盘上笨重地躺了几个月，没有人使用过。\n阿尔布雷希特说，她很快就意识到，她的租户并不是想要建立像她这样的可持续发展的企业。他们在为月亮而荡秋千。\n“我试着一点一点地成长，”阿尔布雷希特说，“幸运的是我从未赔钱。我的生意是有利可图的。我自己付得起。我可以付钱给我的员工。我可以按时向我的供应商支付所有账单。“。\n今年年初，阿尔布雷希特和她的工人们每天都在把5000到6000磅的成堆的纳帕卷心菜变成泡菜。她终于把生意做大了，不需要租地方，也不需要把产品卖给一家食品科技公司。阿尔布雷希特，她很高兴和他们分手了。但后来大流行来袭了。\n虽然Albrecht的销售额有所下降，但送货应用程序的业务却很充裕。她发现自己又在一家名为Local Crate的公司工作。她说，在大流行之前，公司为她销售的产品付钱给她的时间太晚了。\n阿尔布雷希特说：“这不是一大笔钱，但它真的让我很难过。”“我不知道他们为什么要这样做生意。”\n阿尔布雷希特不想再和他们合作了。但现在，随着疫情的蔓延，她欢迎任何她能得到的业务。她还说服公司预先付钱给她。她现在对任何销售都很满意。尽管如此，她期待着有一天她可以重新把泡菜直接卖给杂货店和顾客。", "note_en": "Hyunjoo Albrecht runs a kimchi and hot sauce manufacturing company called  Sinto Gourmet. Over the last decade, she has had an unusually intimate vantage on “food tech” companies. That’s because she has been a landlord to many of the Silicon Valley delivery apps and other venture-backed businesses who were trying to “disrupt the food space.”\n This is the story of how Albrecht had to partner with these companies to build her own food business in the Bay Area, why she vowed to stop working with them and how in the pandemic she ended up partnering with a company that had burned her in the past.\n   Unlike food tech companies that spring to life with venture capital, it took Albrecht years to build her business. She immigrated from South Korea in 2003 and started Sinto Gourmet with some recipes from her North Korean grandmother. Then she started slowly expanding her fermented offerings.\n She sells tubs of spicy napa cabbage kimchi. There is a mild version and a crunchy option. In 2014, she started selling a mixture of fermented California root vegetables: red beets, daikon, turnips, rutabaga and carrots. Alongside the kimchi, Albrecht has developed two hot sauces: tangy apple and sesame garlic.\n   Albrecht began selling the products in grocery stores and then directly to individuals. Eventually, the business grew enough that she needed a commercial kitchen, which is hard to find in San Francisco. So she decided to take her life savings and build a large kitchen.\n Her kitchen is one of the larger commercial cooking facilities in the city. It&#39;s in a roughly 5,000-square-foot warehouse in the Bayview neighborhood. The walk-in freezer alone is 500 square feet. She jokes that it&#39;s bigger than most one-bedroom apartments in San Francisco.\n Albrecht&#39;s plan was to make her kimchi there and rent out the extra space to other local cooks. But the tenants that flocked to her space were not small independent chefs, but instead venture capital-backed food companies.\n Albercht began leasing them unused space in her kitchen. Many of the companies she leased space to came with big plans and then disappeared when they ran out of venture capital. Her tenants included companies like the pizza-delivery app called Easy as Pi, a meal delivery service called Din and a ready-made meal kit company called Sprig.\n   Over the last five years in the U.S., there have been over 2,000 venture capital investments made into what folks call &#34;food tech companies,” which includes everything from delivery to bioengineered meat. According to a report from a venture capital fund called AgFunder, there was almost $20 billion invested in 2019 alone.\n Many of the companies that have sprung up over the years, like Sprig and Munchery, have gone bust. At KQED, we covered how the local chefs  Munchery was working with had to fight for over a year to get paid the debts they were owed when the business closed.\n   As Albrecht watched these kinds of food tech companies come and go in her kitchen, she’s sometimes tried to give the young executives tips. “They just don’t listen,” Albrecht says. “The only things they care about are their goals, their investors and their ‘scalability.’ ”\n Albrecht says most of the people she has met at these companies are very different from her and owners of other local food businesses. She struggled to characterize the difference, but it was more than just their corporate philosophy.\n Many of the people she knows trying to make a living selling food are immigrants, women and people of color — far different than the food tech would-be entrepreneurs. “They are young, white,” she says, “the kind of people you see in a J. Crew catalog.”\n There is also a big difference in who they bring in to work at their companies. Albrecht hires local workers to make her kimchi, many of whom have worked preparing and handling food for years. They look very different from the workers at the food tech companies.\n “All these people they hire are also from Silicon Valley companies who have no experience in a food manufacturing company,” Albrecht says. “Often these positions are for logistics, operations, marketing, all those people. Those are the people they hire.”\n   One anecdote about a former tenant of hers really hits home regarding how different her business is from their business.\n A tenant with a meal kit company wanted to automate filling a container with a few ounces of sauce, so Albrecht says they bought a giant machine to squeeze sauce into cups. It came in on a big pallet, and it was a huge operation to assemble. Albrecht says they were really excited about this machine.\n But when they finally got it hooked up, it didn’t work as expected. She can’t help laughing while she tells the story. “When the sauce comes out of this machine and lands into the little saucer cup it doesn’t land &#39;pretty&#39; enough. So they just stopped using it. They just left it there.” The giant machine sat hulking on a pallet, unused, for months.\n Albrecht says she she quickly realized her tenants weren’t trying to build a sustainable business like her. They were swinging for the moon.\n “I try to grow little by little,” Albrecht says, “and luckily I have never lost money. My business is profitable. I can pay myself. I can pay my employees. I can pay all the bills to my suppliers on time.”\n   At the start of this year, Albrecht and her workers were turning 5,000 to 6,000 pounds of piles of napa cabbage into kimchi every day. She had finally grown the business to the point where she didn’t need to rent space or sell her product to a food tech company. Albrecht she was happy to be done with them. But then the pandemic hit.\n While Albrecht’s sales have declined,  delivery apps are flush with business. She has found herself working again with a company called Local Crate. Before the pandemic, she says the company was super late paying her for the products she sold them.\n “It was not a lot of money, but it made me really upset,” Albrecht says. “I don’t know why they run the business like this.”\n Albrecht didn’t want to work with them anymore. But now with the pandemic, she welcomes any business she can get. She also convinced the company to pay her up front. She’s happy for any sales right now. Although, she looks forward to the day she can get back to selling her kimchi directly to grocery stores and customers.", "posttime": "2020-08-07 12:01:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sf,listen", "title": "他们就是不听“：SF泡菜制造者近距离看到了”食品科技“的做法", "title_en": "They Just Don’t Listen': SF Kimchi Maker Saw 'Food Tech' Practices Up Close", "transed": 1, "url": "https://www.kqed.org/news/11831806/they-just-dont-listen-sf-kimchi-maker-saw-food-tech-practices-up-close-in-her-kitchen", "via": "", "real_tags": ["sf", "listen"]}, {"category": "", "categoryclass": "", "imagename": "8d7bc31c375bccb92cf41342bf6d1eee.jpeg", "infoid": 1016837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年9月，微软计划在视频游戏行业推出一项重大举措：推出世界上首个内置Netflix风格库的游戏流媒体服务。\n每月支付15美元，你就可以在智能手机和平板电脑上流媒体播放100多款游戏，但在苹果无处不在的iPhone和iPad上是无法使用的。\n苹果公司的一位发言人周四表示，原因是苹果不能审查通过Game Pass提供的每一款游戏。\n苹果公司的一位发言人告诉“商业内幕”，App Store的创建初衷是为客户提供一个安全、值得信赖的地方来发现和下载应用程序，同时也是所有开发者的绝佳商机。在应用程序上架我们的商店之前，所有的应用程序都会按照同一套准则进行审查，这些准则旨在保护客户，并为开发者提供公平和公平的竞争环境。\n由于微软没有将其流媒体服务上的每款游戏都提交给苹果的审查程序，因此允许访问这些游戏的应用程序被阻止发布。\n苹果在给“商业内幕”(Business Insider)的一份声明中表示：我们的客户可以享受数百万开发者提供的优秀应用和游戏，游戏服务完全可以在App Store上推出，只要他们遵循适用于所有开发者的同一套指导方针，包括单独提交游戏供审查，并出现在图表和搜索中。苹果在给“商业内幕”(Business Insider)的一份声明中表示。除了App Store之外，开发者还可以选择通过App Store上的Safari和其他浏览器通过网络联系到所有iPhone和iPad用户。&#34；\n谷歌提供的一项类似的服务，名为Google Stadia，也在苹果的App Store指导方针下遇到了障碍。它可以在Android手机和平板电脑上使用，但不能在苹果设备上使用。\n既然苹果允许Netflix和Spotify这样的服务，而不需要审查每一条内容，为什么不允许游戏使用类似的服务呢？根据苹果公司的说法，区别归根结底在于媒介：游戏是互动的，不像音乐和电影，而且App Store中有与游戏相关的消费者期望。\n例如，不能通过苹果的内置服务进行应用内支付，也不能对App Store进行评级，等等。\n微软广受欢迎的订阅服务Xbox Game Pass一开始就可以将游戏从大型库中直接下载到您的游戏机和PC上。\n今年9月，微软将Xbox Game Pass与其流媒体服务Project XCloud结合在一起--这是几年来酝酿的结果。不仅可以将游戏从Game Pass库下载到您的游戏机和PC上，它们还可以流传输到智能手机和平板电脑上。\n微软表示，今年9月推出Xbox Game Pass旗舰游戏后，每月只需支付15美元，就可以将100多款游戏直接流媒体到你的智能手机或平板电脑上。然后，您可以在Xbox游戏机上从您停止的位置继续玩这些游戏。\n此外，微软发布的每一款主要Xbox游戏，从“光环”到“战争机器”，再到“武力赛车”，都会在发布时发布到该服务上，此外还有一些第三方游戏，如“巫师3：狂野猎杀”和“侠盗猎车手5”。它是持久化库，可以对这些游戏进行流媒体播放。\n这是一项已经很成功的服务的下一次演变：Xbox Game Pass目前拥有超过1000万付费用户。这是微软计划永远结束Xbox和PlayStation之间的直接竞争的关键下一步。\n但如果没有对苹果手机和平板电脑的支持，微软雄心勃勃的计划将面临重大障碍。该公司的一份声明承诺将继续努力寻求解决方案。\n声明称，我们的雄心是通过Xbox Game Pass扩展云游戏，Xbox Game Pass可以在所有设备上使用，但目前我们没有更多关于iOS的信息可供分享。\n有提示吗？请通过电子邮件(bgilbert@business insider.com)、或推特DM(@realbengilbert)联系Business Insider高级记者本·吉尔伯特。我们可以让线人匿名。使用非工作设备联系。请只通过电子邮件进行公关推销。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "This September, Microsoft plans to launch a major coup in the video game business: The world&#39;s first game streaming service with a built-in library, Netflix-style.\n For $15 a month, you&#39;ll be able to stream over 100 games to smartphones and tablets — but it won&#39;t be available on Apple&#39;s ubiquitous iPhone and iPad.\n The reason, an Apple spokesperson said on Thursday, is because Apple isn&#39;t able to review each game that&#39;s available through Game Pass.\n &#34;The App Store was created to be a safe and trusted place for customers to discover and download apps, and a great business opportunity for all developers,&#34; an Apple spokesperson told Business Insider. &#34;Before they go on our store, all apps are reviewed against the same set of guidelines that are intended to protect customers and provide a fair and level playing field to developers.&#34;\n   Because Microsoft isn&#39;t submitting each game on its streaming service to Apple&#39;s review process, the app that enables access to those games is being blocked from publishing.\n &#34;Our customers enjoy great apps and games from millions of developers, and gaming services can absolutely launch on the App Store as long as they follow the same set of guidelines applicable to all developers, including submitting games individually for review, and appearing in charts and search,&#34; Apple said in a statement to Business Insider. &#34;In addition to the App Store, developers can choose to reach all iPhone and iPad users over the web through Safari and other browsers on the App Store.&#34;\n A similar service offered by Google, named Google Stadia, has also run into roadblocks with Apple&#39;s App Store guidelines. It&#39;s available on Android phones and tablets, but not Apple devices.\n Given that Apple allows services like Netflix and Spotify without reviewing every piece of content, why not allow a similar service for gaming? The difference boils down to the medium, according to Apple: Games are interactive, unlike music and film, and there are consumer expectations baked into the App Store related to gaming.\n   No in-app payment through Apple&#39;s built-in services, for instance, and no App Store rating, among a variety of other things.\n  Microsoft&#39;s popular subscription service, Xbox Game Pass, started with the ability to download games from a large library directly to your console and PC.\n This September, Microsoft is combining Xbox Game Pass with its &#34;Project xCloud&#34; streaming service —  a combination years in the making. Instead of just being able to download games from the Game Pass library to your console and PC, they will also be streamable to smartphones and tablets.\n With Xbox Game Pass &#34;Ultimate&#34; this September, Microsoft says over 100 games can be streamed directly to your smartphone or tablet for $15 per month. You can then resume those games on an Xbox console right where you left off.\n   Moreover, every major Xbox game published by Microsoft, from &#34;Halo&#34; to &#34;Gears of War&#34; to &#34;Forza Motorsport,&#34; gets published to the service at launch, alongside a smattering of third-party games like &#34;The Witcher 3: Wild Hunt&#34; and &#34;Grand Theft Auto 5.&#34; It&#39;s the persistent library, paired with the ability to stream those games to whatever device you&#39;ve got, that makes Game Pass so similar to something like Netflix.\n It&#39;s the next evolution of an already successful service:  Xbox Game Pass has over 10 million paying subscribers right now. And it&#39;s a critical next step in Microsoft&#39;s plan to  end direct competition between Xbox and PlayStation for good.\n But without support for Apple phones and tablets, Microsoft&#39;s ambitious plan faces a major roadblock. A statement from the company pledged to continue working toward a solution.\n &#34;It&#39;s our ambition to scale cloud gaming through Xbox Game Pass available on all devices,&#34; the statement said, &#34;but we have nothing further to share at this time regarding iOS.&#34;\n   Got a tip? Contact Business Insider senior correspondent Ben Gilbert via email ( bgilbert@businessinsider.com),  or Twitter DM ( @realbengilbert). We can keep sources anonymous. Use a non-work device to reach out. PR pitches by email only, please.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-08-07 11:44:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,游戏,app", "title": "苹果应用商店政策意味着不允许Xbox游戏流媒体", "title_en": "Apple's App Store Polices Mean Xbox Game Streaming Not Allowed", "transed": 1, "url": "https://www.businessinsider.com/apple-explains-why-xbox-game-pass-is-not-on-iphone-2020-8", "via": "", "real_tags": ["苹果", "apple", "游戏", "app"]}, {"category": "", "categoryclass": "", "imagename": "64db490cd3a321c460f665c8970c0258.jpg", "infoid": 1016836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄勒冈州科瓦利斯。-俄勒冈州立大学(Oregon State University)的一项新研究发现，77%的中低收入美国家庭低于资产贫困门槛，这意味着如果他们的收入被切断，他们将没有金融资产至少维持三个月的贫困水平。\n这项研究比较了美国和加拿大的资产贫困率。加拿大的资产贫困率在过去20年里有所改善，而美国的贫困率却在恶化，但仍然有62%的中低收入加拿大人也低于资产贫困门槛。\n这项研究的主要作者、俄亥俄州立大学公共卫生与人文科学学院副教授大卫·罗斯韦尔(David Rothwell)说，这些发现的影响在新冠肺炎大流行期间变得非常明显。\n“事实上，美国的安全网与工作是如此紧密地联系在一起，然后你会对就业产生巨大的冲击，你的系统不会准备好应对就业系统…的如此大的变化。它具体地导致家庭压力和紧张，然后这种压力和压力与儿童和家庭的负面后果有关，“Rothwell说。\n上周发表在《社会政策管理》(Social Policy Administration)杂志上的这项研究关注的是股票、债券和共同基金等金融资产，而不是房屋和房地产等实物资产，因为金融资产更容易在紧急情况下变现和使用。现有研究发现，美国的财富不平等比收入不平等更为明显。\n研究人员使用了1998年至2016年加拿大和美国具有全国代表性的金融调查数据，考察了中低收入家庭，他们的定义是两国收入分配中垫底50%的家庭，以25-54岁的劳动年龄成年人为首。\n罗斯韦尔和合著者、俄亥俄州立大学的莉安·乔多诺(Leanne Giordono)和加拿大安大略省卡尔顿大学(Carleton University)的詹妮弗·罗布森(Jennifer Robson)正在调查这两个国家的资产贫困是如何随着时间的推移而变化的，以及这种变化是如何受到转移份额(来自政府援助的家庭收入部分)变化的影响的。他们选择了美国和加拿大，因为这两个国家地理位置相近，法律传统相似，但福利政策却截然不同。\n1998年，加拿大中低收入家庭的资产贫困率为74%，而美国为67%。2005年，这两个比例几乎相同，然后加拿大的资产贫困率不断下降，美国的资产贫困率不断上升，2016年分别达到62%和77%。\n加拿大在家庭经济援助上的支出是美国的两倍，其中大部分用于现金福利，而不是美国的补充营养援助计划(SNAP，前身为食品券)等实物福利。2016年，96%的加拿大中低收入家庭从政府获得了一些转移收入。在美国，这一数字为41%。\n罗斯韦尔说，在很大程度上，结果显示，更慷慨的福利政策与加拿大更高的资产贫困率相关。在那里，随着政府随着时间的推移降低了家庭获得的公共援助占其收入的比例，资产贫困状况有所改善。\n然而，他说，福利慷慨和资产贫困之间的这种关系应该被解读为相关的，而不是因果的，这个话题值得进一步研究。由于加拿大的公共援助水平高于美国，很难将结果从一个国家推广到另一个国家，但在控制人口特征时，研究人员发现，减少转移份额对美国的资产贫困风险没有影响。\n罗斯韦尔说：“最突出的是，与其他国家相比，很少有美国家庭获得任何形式的转移，而且在这项研究中，对已经最低限度的安全网进行的小幅调整与资产贫困无关。”相比之下，加拿大家庭获得儿童福利，即每月数百美元的现金支付，以帮助支付抚养孩子的费用。\n包括医疗补助和SNAP在内的许多安全网计划也不鼓励储蓄，因为它们对寻求援助的人施加了资产限制。罗斯韦尔称这些为“贫困陷阱”。\n他表示：“如果你有一个低收入的人，他们正在努力工作，试图省钱，但你告诉他们，如果他们的储蓄超过某个给定的门槛，他们就会失去福利，这是一种阻碍财富积累的行为。”\n罗斯韦尔指出，有色人种的资产贫困率要高得多，这是因为几十年来的歧视性法律和政策阻止了黑人，特别是黑人购买和拥有住房或获得高薪工作。\nRothwell说：“在我看来，这就是COVID的故事--它只是暴露了这些现有的不平等，而进入危机的最脆弱的人在度过危机时的脆弱性被放大了。”\n他说，今年晚些时候，同一研究小组将专门研究种族和民族资产差异及其对人们健康的影响。", "note_en": "CORVALLIS, Ore. — A new study from Oregon State University found that 77% of low- to moderate-income American households fall below the asset poverty threshold, meaning that if their income were cut off they would not have the financial assets to maintain at least poverty-level status for three months.\n The study compared asset poverty rates in the U.S. and Canada. Canada’s asset poverty rate has improved over the past 20 years while the U.S. rate has worsened, but still, 62% of low- to moderate-income Canadians also fall below the asset poverty threshold.\n The implications of these findings have become starkly apparent during the COVID-19 pandemic, said  David Rothwell, lead author on the study and an associate professor in OSU’s  College of Public Health and Human Sciences.\n “The fact that the U.S. safety net is so connected to work, and then you have this huge shock to employment, you have a system that’s not prepared to handle such a big change to the employment system … It results concretely in family stress and strain, and then that strain and stress relates to negative outcomes for children and families,” Rothwell said.\n The  study, published last week in the journal Social Policy Administration, looked at financial assets such as stocks, bonds and mutual funds, rather than real assets like houses and property, because financial assets are easier to cash in and use in an emergency.  Existing research has found that U.S. wealth inequality is more pronounced that income inequality.\n Researchers used data from nationally representative financial surveys in Canada and the U.S. from 1998 through 2016, looking at low- to moderate-income households, defined as those in the bottom 50% of income distribution in each country, headed by working age adults age 25-54.\n Rothwell and co-authors  Leanne Giordono from OSU and Jennifer Robson from Carleton University in Ontario, Canada, were investigating how asset poverty changed over time in the two countries  and how that change was affected by changes in transfer share — the portion of household income that comes from government assistance. They chose the U.S. and Canada because of their close geographic proximity and similar legal traditions but significantly different welfare policies.\n In 1998, Canada’s asset poverty rate among low- to moderate-income households was 74%, compared with 67% in the U.S. The two rates were nearly identical in 2005, then Canada’s kept falling and the U.S. rate kept rising, arriving at 62% and 77% in 2016.\n Canada spends twice what the U.S. does on financial assistance for families, and much of it is spent in cash benefits, rather than in-kind benefits like Supplemental Nutrition Assistance Programs (SNAP, formerly food stamps) in the U.S. In 2016, 96% of low- to moderate-income Canadian households received some transfer income from the government. In the U.S., that number was 41%.\n For the most part, results showed that more generous welfare policies were associated with greater rates of asset poverty in Canada, Rothwell said. There, as the government reduced the amount of public assistance families received as a proportion of their income over time, asset poverty improved.\n However, he said, this relationship between welfare generosity and asset poverty should be interpreted as correlational, not causal, and the topic warrants further study. Because the levels of public assistance are greater in Canada than the U.S., it’s hard to extend results from one country to the other, but when controlling for demographic characteristics, researchers found that decreasing transfer share has no impact on the risk of asset poverty in the U.S.\n “What stands out there is, so few American families receive any type of transfers at all, compared to other countries, and small adjustments to an already minimal safety net was not related to asset poverty in this study,” Rothwell said. In contrast, Canadian families receive a child benefit, a monthly cash payment of several hundred dollars to help with the cost of raising a child.\n Many safety net programs, including Medicaid and SNAP, also disincentivize saving because they impose asset limits on people seeking assistance. Rothwell calls these a  “poverty trap.”\n “If you have someone who’s low-income and they are working hard trying to save money but you’re telling them that they’re going to lose benefits if they save over some given threshold, that’s a disincentive to accumulate wealth,” he said.\n Rothwell notes that asset poverty rates are  much higher among people of color, due to decades of discriminatory laws and policies that prevented Black people, in particular, from buying and owning homes or securing well-paying jobs.\n “This is the story of COVID, as I see it — it’s just exposing these existing inequalities, and the people who are most vulnerable going into the crisis are magnified in their vulnerability getting through it,” Rothwell said.\n A study coming out later this year from the same research team will look specifically at racial and ethnic asset disparities and how they impact people’s health, he said.", "posttime": "2020-08-07 11:44:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,don", "title": "大多数美国人没有足够的资产来承受没有收入的3个月", "title_en": "Most Americans don’t have enough assets to withstand 3 months without income", "transed": 1, "url": "https://today.oregonstate.edu/news/study-most-americans-don’t-have-enough-assets-withstand-3-months-without-income", "via": "", "real_tags": ["美国", "don"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我对计算机软件的观察之一是，不管我知道多少，每天都有新的东西需要学习。\n我已经使用宋承宪很多年了。我使用本地配置文件和多个密钥对连接到远程系统。\n有时，SSH会话超时或以某种方式冻结。这通常会使终端窗口处于冻结状态，需要强制关闭。\n只是可能不需要强制关闭。有一个内置的SSH转义触发器。\n按~(波浪号)键。请注意，当字符是键入的第一个字符时，~不会出现在屏幕上。当不是第一个字符时，字符在屏幕上正常打印。\n要强制终止冻结的SSH会话，请按~..。结果与终止进程的Ctrl+C或Ctrl+D基本相同。", "note_en": "One of my observations about computer software is no matter how much I know there is something new to learn every day.\n  I have been using SSH for many years. I use a local  config file and multiple key pairs to connect to remote systems.\n  Occasionally an SSH session times out or somehow freezes. Often this leaves the terminal window in a frozen state, requiring a forced closure.\n  Except a forced closure might not be needed. There is a built-in SSH escape trigger.\n  Press the  ~ (tilde) key. Notice that the  ~ won’t appear on screen when the character is the very first character typed. The character prints on screen normally when not the first character.\n    To force terminate a frozen SSH session, press  ~.. The result is much the same as  Ctrl+C or  Ctrl+D to terminate a process.", "posttime": "2020-08-07 10:37:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冻结,frozen", "title": "终止冻结的SSH会话", "title_en": "Terminating a Frozen SSH Session", "transed": 1, "url": "https://www.remembertheusers.com/2020/07/0668-terminating-a-frozen-ssh-session.html", "via": "", "real_tags": ["冻结", "frozen"]}, {"category": "", "categoryclass": "", "imagename": "7b10c68da98d2d630c266a04aee5f4cb.jpg", "infoid": 1016827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌对将其Stadia游戏流媒体平台带到iOS上保持沉默，尽管游戏库应用程序已经可以在App上使用", "note_en": "Google has stayed quiet about bringing its Stadia game streaming platform to iOS, even though the game library application has been available on the App", "posttime": "2020-08-07 10:36:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,ios,microsoft,store,stadia", "title": "由于App Store的规定，Google Stadia和Microsoft XCloud将不会进入iOS", "title_en": "Google Stadia and Microsoft xCloud won't come to iOS due to App Store rules", "transed": 1, "url": "https://www.androidpolice.com/2020/08/06/google-stadia-and-microsoft-xcloud-wont-come-to-ios-due-to-app-store-rules/", "via": "", "real_tags": ["google", "ios", "microsoft", "store", "stadia"]}, {"category": "", "categoryclass": "", "imagename": "c6af410f4119d52fd929bb80e62422ea.jpeg", "infoid": 1016824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄语语法中有一条规则，每个一年级的学生都熟记于心，那就是“жи-шипишичерези”。只是说，即使发音暗示“и”，也要在“ж”和“ш”之后加上“ы”，非常朗朗上口！这是一条规则。就像许多语法规则一样，它在某种意义上是武断的，主要是由于传统和惯例，而不是其他任何东西。有人在某个地方用俄语写对了“写作大书”，上面写着语法上正确的拼写是“жи”和“ши”，即使我们把它拼成“ы”，从字面上看没有什么会改变或出错(嗯，也许有些学生会取得更好的成绩，我们需要重新发布很多文件，但无论如何，…)。\n有一条“养猫”的规则，那就是你必须给你的猫喂食。如果你不喂你的猫，你的猫就会死。这条规则是由于这样一个事实，即如果猫不喂食，它们往往会死亡。我不能通过成为写“养猫的大书”的人来改变这条规则。\n我看到很多学生犯的一个错误是，他们认为数学“规则”要么是俄语语法规则，要么是喂你的猫的规则。通常，同一个学生会根据提出的问题改变他们对规则的看法，而且不知何故，他们会同时将数学规则看作是任意的和不可变的宇宙法则！(当然，这不是他们的错，这在很大程度上就是数学在学校里的表现方式)。\n但数学“规则”两者都不是。“你不能被零除”既是我们开始选择定义时的随意性，也是做出选择后那些定义的结果是不变的。然而，请注意，它们在结果的选择上并不是任意的，在起始定义中也不是一成不变的。\n但是，当一个人说“你不能被零除”时，他们是否知道他们正在选择的定义，更重要的是，他们是否知道正在做出定义的选择？当然，在某种程度上，我认为如果被恰当地询问，大多数学生将别无选择，只能想出许多量词来坚持‘你不能被零除’的每一个词，以使这句话接近正确，因为另一种选择是“嗯，事情就是这样”…。一般说来，学生(或者至少是我的学生)比这要好。\n这里要指出的重要一点是，数学中真的没有人们对数学“规则”的思考方式的“规则”(就像“你不能被零整除”，或者“某物的平方总是正的”)。数学中的每一个单词都定义得非常精确，这就是它如此伟大的原因。“你不能被零整除”，那么“不能”是什么意思呢？那是不是说做数学正确局的人会责骂我呢？或者这是否意味着我的数学会因为我没有喂饱它而消亡？不，那句话没有任何意义。\n通常的意思是“如果x是一个非零的实数，那么就不存在实数y使得x=0*y”。现在我们可以尽情狂欢了。什么是实数？零是什么？什么是乘法？…。好的，比如说，我们知道这些东西的定义，很好。我们能不能在那些空位上找到一些其他的词来让它成为真的呢？如果x是一只蓝猫，能不能存在一个格子香蕉y，使得x=(万能天鹅绒汤匙)∻y？我怎么知道的？我总是可以选择斜体字来实现这一点。做一个好的选择是数学的意义所在，但最重要的是，它仍然在做这个选择。", "note_en": "There’s a rule in Russian grammar that every first-grader knows by heart, “жи-ши пиши через и”. It’s just saying that one should write “и” after “ж” and “ш” even when pronunciation suggests “ы”, and it’s very catchy! This is a  rule.  Like a lot of grammar rules, it’s in some sense arbitrary, and mostly due to tradition and convention rather anything else. Someone somewhere wrote the Big Book Of Writing Correctly In Russian, and it says that grammatically correct spelling is “жи” and “ши”, even though literally nothing would change or go wrong if we spelled it with “ы” (well, maybe some students would get better grades, and we’d need to reissue a lot of documents, but anyway…)\n There’s a rule of “having a cat” that you have to feed your cat. If you don’t feed your cat, then your cat would die. This rule is due to the fact that if cats are not fed, they tend to die. I cannot change this rule by becoming the person who writes the Big Book Of Having A Cat.\n A mistake that I see a lot of students is that they think of math “rules” as either the Russian grammar rule, or the feed your cat rule. Often the same student will change how they think about the rule depending on the question asked, and they somehow see math rules as both arbitrary and immutable laws of the universe at  the same time! (not their fault, of course, this is pretty much how mathematics is presented in school)\n But math “rules” are neither. “You can’t divide by zero” is both arbitrary in the choice of the definitions that we started with and immutable in the consequences of those definitions after the choice has been made. Notice, however, that they are not arbitrary in the choice of consequences, nor immutable in the starting definitions.\n But when one says “you can’t divide by zero”, do they know the definitions they are choosing, and more importantly, do they know that the choice of definitions  is being made? On some level, sure, I think if properly questioned, most students will have no choice but to come up with a lot of classifiers to hang onto every word of ‘you can’t divide by zero’ to make that statement something approaching correct, because the alternative is “well that’s just the way things are”…and generally students (or at least students I had) are better than that.\n The important point to make here is that there are really no “rules” in math the way people think about math “rules” (like “you cannot divide by zero”, or “a square of something is always positive”). Every single word in math is very precisely defined, that’s what makes it so great. “You cannot divide by zero”, what does “cannot” mean? Does that mean someone from the Bureau Of Doing Math Correctly will scold me? Or does that mean that my math will die because I didn’t feed it? No, that sentence doesn’t mean anything.\n What is usually meant by that is something like “If x is a non-zero real number, then there does not exist a real number y such that x=0*y”. And now we can have a field day. What is a real number? What is a zero? What is multiplication?… Ok, say, we know definitions of those things, good. Can we find some other words to go in those slots so that it is true? if x is a  blue cat, can there exist a  plaid banana y such that x=( universal velvet teaspoon)∻y? How the heck do I know? I can always make my choices of italicized words that would make this true. Making a good choice is what math is about, but first and foremost, it is still  making that  choice.", "posttime": "2020-08-07 10:19:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄语,russian,规则", "title": "俄语语法中有一条规则，每个一年级的学生都熟记于心", "title_en": "There’s a rule in Russian grammar that every first-grader knows by heart", "transed": 1, "url": "https://alexyar.tumblr.com/post/174622302172/theres-a-rule-in-russian-grammar-that-every", "via": "", "real_tags": ["俄语", "russian", "规则"]}, {"category": "", "categoryclass": "", "imagename": "d8958a69b07c14cf5bc74adc1d97b9ba.jpg", "infoid": 1016821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伯爵的Altiplano旗舰概念就像两张信用卡一样纤细，但对于实际使用来说，它已经足够坚固了。以下是这位钟表匠是如何实现这一令人难以置信的壮举的。", "note_en": "Piaget’s Altiplano Ultimate Concept is as skinny as two credit cards stacked flat, but it’s tough enough for actual use. Here’s how the watchmaker achieved this incredible feat.", "posttime": "2020-08-07 09:11:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mechanical,altiplano", "title": "世界上最薄(2毫米)的可以使用的机械表", "title_en": "World's thinnest (2mm) mechanical watch that can be used", "transed": 1, "url": "https://cnaluxury.channelnewsasia.com/obsessions/world-s-thinnest-mechanical-watch-12727192", "via": "", "real_tags": ["altiplano"]}, {"category": "", "categoryclass": "", "imagename": "6ef128f1ba759b0ccf9d668464cdd53b.jpg", "infoid": 1016820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "剃须刀、手术刀和刀子通常由不锈钢制成，磨成剃刀般锋利的边缘，并涂上更坚硬的材料，如类钻石的碳。然而，刀子需要定期磨利，而剃须刀在切割比刀片本身柔软得多的材料后，通常会被更换。\n现在，麻省理工学院的工程师们研究了近距离剃须的简单动作，观察剃须刀片在剪断人类头发时会如何受损--一种比剃须刀片本身柔软50倍的材料。他们发现，剃发使刀片变形的方式比简单地随着时间的推移磨损刀片要复杂得多。事实上，在特定条件下，一缕头发就可能导致刀片边缘碎裂。一旦形成初始裂纹，刀片很容易进一步碎裂。随着初始切屑周围积累更多的裂纹，剃须刀的边缘可能会很快变钝。\n研究小组发现，刀片的微观结构起着关键作用。如果钢的组织不均匀，叶片更容易碎裂。刀片接近一缕头发的角度和钢的微观结构中存在的缺陷也是引发裂纹的原因之一。\n研究小组的发现也可能为如何保持刀片的锋利程度提供线索。例如，在切蔬菜时，厨师可能会考虑直切，而不是斜切。在设计更耐用、更耐切屑的刀片时，制造商可能会考虑用更同质的材料制造刀具。\n麻省理工学院托马斯·B·金冶金副教授C.Cem Tasan说：“我们的主要目标是理解一个或多或少每个人都知道的问题：为什么刀片在与更软的材料相互作用时会变得无用。”我们找到了失败的主要因素，这使我们能够确定一条新的加工路径，以制造寿命更长的叶片。\n塔桑和他的同事们今天在“科学”杂志上发表了他们的研究结果。他的合著者是第一作者、麻省理工学院研究生Gianluca Roscioli和麻省理工学院博士后Seyedeh Mohadeseh Taheri Mousavi。\n麻省理工学院材料科学与工程系的Tasan团队探索金属的微观结构，以便设计出具有非凡抗损伤能力的新材料。\n塔桑说：“我们是冶金学家，想知道是什么控制了金属的变形，这样我们就能制造出更好的金属。”“在这种情况下，耐人寻味的是，如果你切割一些非常软的东西，比如人的头发，用一些非常硬的东西，比如钢，硬的材料就会失效。”\n为了确定剃人头发时剃须刀片失效的机制，Roscioli首先进行了一些初步实验，使用一次性剃须刀刮自己的面部毛发。每次刮完胡子后，他都会用扫描电子显微镜(SEM)拍摄剃须刀边缘的图像，以追踪刀片是如何随着时间的推移磨损的。\n扫描电子显微镜下的原位毛发切割实验，显示了切屑过程。提供者：詹卢卡·罗西奥利(Gianluca Roscioli)。\n令人惊讶的是，这些实验显示，随着时间的推移，磨损量很小，或者说是从锋利的边缘变圆。相反，他注意到沿着剃须刀边缘的特定区域形成了碎屑。\nTasan说：“这创造了另一个谜团：我们看到了碎屑，但没有看到到处都是碎屑，只在某些地方看到了碎屑。”“我们想知道，这种碎屑是在什么条件下发生的，失败的原因是什么？”\n为了回答这个问题，Roscioli建造了一个小型微型机械设备来进行更可控的剃须实验。该装置由一个可移动的工作台组成，两边各有两个夹子，一个用来固定剃须刀片，另一个用来固定头发。他使用商用剃须刀的刀片，将刀片设置在不同的角度和切割深度，以模仿剃须的行为。\n该设备的设计适合于安装在扫描电子显微镜内，在进行多次切割实验时，Roscioli能够在扫描电子显微镜上拍摄头发和刀片的高分辨率图像。他使用自己的头发，以及从他的几个实验室采集的头发样本，总体上代表了广泛的头发直径。\n现场进行了单发切割实验，以测量剃须过程中刀片边缘产生的载荷。\n不考虑头发的厚度，Roscioli观察到头发损坏叶片的相同机制。就像在他最初的剃须实验中一样，Roscioli发现头发导致刀片的边缘碎裂，但只在某些地方。\n当他分析在切割实验中拍摄的SEM图像和电影时，他发现当头发垂直于刀片切割时，没有出现碎屑。然而，当头发可以自由弯曲时，更有可能出现碎屑。这些碎屑通常形成在刀片边缘与发束两侧交汇的地方。\n为了了解哪些条件可能导致这些碎屑的形成，研究小组进行了计算模拟，在模拟中，他们模拟了切割一根头发的钢刀片。当他们模拟每一次剃发时，他们改变了某些条件，比如切割角度，切割时施加的力的方向，最重要的是，刀片的钢的成分。\n他们发现，模拟在三种情况下预测了失败：当刀片以一定角度接近头发时，当刀片的钢成分不均匀时，以及当发束的边缘与刀片在其不均匀结构中的薄弱环节相遇时。\n塔桑说，这些情况说明了一种被称为应力强化的机制，在这种机制中，如果材料的结构有微裂纹，施加到材料上的应力的影响就会增强。一旦最初的微裂纹形成，材料的异质结构使这些裂纹很容易生长成碎片。\nTasan说：“我们的模拟解释了材料中的异质性是如何增加该材料上的应力的，因此即使应力是由像头发这样的柔软材料施加的，裂纹也会扩展。”\n研究人员已经为一种工艺申请了临时专利，该工艺将钢加工成更均匀的形式，以制造更持久、更耐切屑的叶片。\n“基本的想法是减少这种异质性，同时我们保持高硬度，”Roscioli说。“我们已经学会了如何制造更好的叶片，现在我们想做这件事。”", "note_en": "Razors, scalpels, and knives are commonly made from stainless steel, honed to a razor-sharp edge and coated with even harder materials such as diamond-like carbon. However, knives require regular sharpening, while razors are routinely replaced after cutting materials far softer than the blades themselves.\n Now engineers at MIT have studied the simple act of shaving up close, observing how a razor blade can be damaged as it cuts human hair — a material that is 50 times softer than the blade itself. They found that hair shaving deforms a blade in a way that is more complex than simply wearing down the edge over time. In fact, a single strand of hair can cause the edge of a blade to chip under specific conditions. Once an initial crack forms, the blade is vulnerable to further chipping. As more cracks accumulate around the initial chip, the razor’s edge can quickly dull.\n The blade’s microscopic structure plays a key role, the team found. The blade is more prone to chipping if the microstructure of the steel is not uniform. The blade’s approaching angle to a strand of hair and the presence of defects in the steel’s microscopic structure also play a role in initiating cracks.\n The team’s findings may also offer clues on how to preserve a blade’s sharpness. For instance, in slicing vegetables, a chef might consider cutting straight down, rather than at an angle. And in designing longer-lasting, more chip-resistant blades, manufacturers might consider making knives from more homogenous materials.\n “Our main goal was to understand a problem that more or less everyone is aware of: why blades become useless when they interact with much softer material,” says C. Cem Tasan, the Thomas B. King Associate Professor of Metallurgy at MIT. “We found the main ingredients of failure, which enabled us to determine a new processing path to make blades that can last longer.”\n Tasan and his colleagues have published their results today in the journal  Science. His co-authors are Gianluca Roscioli, lead author and MIT graduate student, and Seyedeh Mohadeseh Taheri Mousavi, MIT postdoc.\n  Tasan’s group in MIT’s Department of Materials Science and Engineering explores the microstructure of metals in order to design new materials with exceptional damage-resistance.\n “We are metallurgists and want to learn what governs the deformation of metals, so that we can make better metals,” Tasan says. “In this case, it was intriguing that, if you cut something very soft, like human hair, with something very hard, like steel, the hard material would fail.”\n To identify the mechanisms by which razor blades fail when shaving human hair, Roscioli first carried out some preliminary experiments, using disposable razors to shave his own facial hair. After every shave, he took images of the razor’s edge with a scanning electron microscope (SEM) to track how the blade wore down over time.\n  An in-situ hair cutting experiment in a scanning electron microscope, showing the chipping process. Credit:  Gianluca Roscioli\n Surprisingly, the experiments revealed very little wear, or rounding out of the sharp edge over time. Instead, he noticed chips forming along certain regions of the razor’s edge.\n “This created another mystery: We saw chipping, but didn’t see chipping everywhere, only in certain locations,” Tasan says. “And we wanted to understand, under what conditions does this chipping take place, and what are the ingredients of failure?”\n  To answer this question, Roscioli built a small, micromechanical apparatus to carry out more controlled shaving experiments. The apparatus consists of a movable stage, with two clamps on either side, one to hold a razor blade and the other to anchor strands of hair. He used blades from commercial razors, which he set at various angles and cutting depths to mimic the act of shaving.\n The apparatus is designed to fit inside a scanning electron microscope, where Roscioli was able to take high-resolution images of both the hair and the blade as he carried out multiple cutting experiments. He used his own hair, as well as hair sampled from several of his labmates, overall representing a wide range of hair diameters.\n  In-situ single-hair cutting experiment carried out to measure the loads generated on the blade edge during shaving. Credit:  Gianluca Roscioli\n Regardless of a hair’s thickness, Roscioli observed the same mechanism by which hair damaged a blade. Just as in his initial shaving experiments, Roscioli found that hair caused the blade’s edge to chip, but only in certain spots.\n When he analyzed the SEM images and movies taken during the cutting experiments, he found that chips did not occur when the hair was cut perpendicular to the blade. When the hair was free to bend, however, chips were more likely to occur. These chips most commonly formed in places where the blade edge met the sides of the hair strands.\n To see what conditions were likely causing these chips to form, the team ran computational simulations in which they modeled a steel blade cutting through a single hair. As they simulated each hair shave, they altered certain conditions, such as the cutting angle, the direction of the force applied in cutting, and most importantly, the composition of the blade’s steel.\n They found that the simulations predicted failure under three conditions: when the blade approached the hair at an angle, when the blade’s steel was heterogenous in composition, and when the edge of a hair strand met the blade at a weak point in its heterogenous structure.\n  Tasan says these conditions illustrate a mechanism known as stress intensification, in which the effect of a stress applied to a material is intensified if the material’s structure has microcracks. Once an initial microcrack forms, the material’s heterogeneous structure enabled these cracks to easily grow to chips.\n “Our simulations explain how heterogeneity in a material can increase the stress on that material, so that a crack can grow, even though the stress is imposed by a soft material like hair,” Tasan says.\n The researchers have filed a provisional patent on a process to manipulate steel into a more homogenous form, in order to make longer-lasting, more chip-resistant blades.\n “The basic idea is to reduce this heterogeneity, while we keep the high hardness,” Roscioli says. “We’ve learned how to make better blades, and now we want to do it.”", "posttime": "2020-08-07 08:55:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "剃须刀,dulls,刀片", "title": "为什么刮胡子即使是最锋利的剃须刀也会变得迟钝？", "title_en": "Why shaving dulls even the sharpest of razors", "transed": 1, "url": "https://news.mit.edu/2020/why-shaving-dulls-razors-0806", "via": "", "real_tags": ["剃须刀", "dulls", "刀片"]}, {"category": "", "categoryclass": "", "imagename": "74f8fc5e31d7f7c300a8543428d3d3a9.jpg", "infoid": 1016818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔正在调查据称超过20G字节的专有数据和源代码泄露事件，一名安全研究人员表示，这些数据和源代码来自今年早些时候的一次数据泄露。\n英特尔的一位女发言人表示，这些数据-在这篇帖子上线时已在BitTorrent Feed上公开可用-包含英特尔根据保密协议向合作伙伴和客户提供的数据。在谈到背景情况时，她表示，英特尔官员不相信这些数据来自网络入侵。她还说，公司仍在努力确定这些材料的时效性，到目前为止，没有迹象表明这些数据包括任何客户或个人信息。\n“我们正在调查这一情况，”公司官员在一份声明中说。“这些信息似乎来自英特尔资源与设计中心，该中心托管信息，供我们的客户、合作伙伴和已注册访问的其他外部方使用。我们相信有个人有权下载并分享这些数据。“。\n这些数据是由瑞士软件工程师蒂莉·科特曼(Tillie Kottmann)发布的，他在Twitter上提供了基本的细节。Kottmann将此次泄漏称为“机密湖”，指的是英特尔10纳米芯片平台的内部名称。他说，他是从今年早些时候泄露英特尔的一位消息人士那里获得这些数据的，今天的这篇文章将在未来得到其他人的关注。\nKottmann写道：“这里的大部分东西以前从未在任何地方发表过，都是保密的，属于保密协议或英特尔限制机密。”他说，部分内容包括：\nKabylake(Purley Platform)BIOS参考代码和示例代码+初始化代码(其中一些作为完整历史的导出git报告)。\n快速查看泄露的材料会发现，这些材料由机密材料组成，英特尔客户需要这些材料来设计主板、BIOS或其他与CPU和英特尔制造的其他芯片配合使用的东西。虽然我们仍在分析内容，但我们看到的设计和测试文档、源代码和演示文稿从2018年第四季度到几个月前都有。\n这些文档和源代码包大部分适用于英特尔CPU平台，如Kaby Lake或即将推出的Tiger Lake，但也有少量其他文档与其他产品相关，如英特尔为SpaceX开发的传感器软件包。\n还有一个专门用于英特尔管理引擎的文件夹，但它的内容也不是英特尔集成商不知道的。它们是测试代码和建议，说明在设计包含英特尔CPU和英特尔ME的系统时何时以及以何种频率运行这些自动化测试。\n垃圾场的最新消息之一是“惠特利/雪松岛平台本周信息”，日期为5月5日。雪松岛是位于库珀湖和冰湖至强CPU之下的建筑。其中一些芯片已于今年早些时候发布，而另一些芯片尚未全面上市。\n有些内容对一些冰湖样本中的电压故障提供了隐晦的参考。目前还不清楚故障是发生在交付给客户的实际硬件上，还是发生在英特尔提供给原始设备制造商(OEM)用于设计他们自己的电路板的参考板上。", "note_en": "Intel is investigating the purported leak of more than 20 gigabytes of its proprietary data and source code that a security researcher said came from a data breach earlier this year.\n The data—which at the time this post went live was publicly available on BitTorrent feeds—contains data Intel makes available to partners and customers under NDA, a company spokeswoman said. Speaking on background, she said Intel officials don’t believe the data came from a network breach. She also said the company is still trying to determine how current the material is and that, so far, there is no signs the data includes any customer or personal information.\n “We are investigating this situation,” company officials said in a statement. “The information appears to come from the Intel Resource and Design Center, which hosts information for use by our customers, partners and other external parties who have registered for access. We believe an individual with access downloaded and shared this data.”\n  The data was published by Tillie Kottmann, a Swiss software engineer who offered  barebones details on Twitter. Kottmann has dubbed the leak “exconfidential Lake,” a reference to the Intel insider name for its 10 nanometer chip platform. He said he obtained the data from a source who breached Intel earlier this year and that today&#39;s installment would be followed by others in the future.\n “Most of the things here have NOT been published ANYWHERE before and are classified as confidential, under NDA or Intel Restricted Secret,” Kottmann wrote. He said some of the contents included:\n Kabylake (Purley Platform) BIOS Reference Code and Sample Code + Initialization code (some of it as exported git repos with full history)\n  A quick review of the leaked material shows that it consists of confidential materials that Intel customers need to design motherboards, BIOS, or other things that work with CPUs and other chips Intel makes. Although we’re still analyzing the contents, we’re seeing design and test documents, source code, and presentations ranging from as early to Q4 2018 to just a couple of months ago.\n Most of these documents and source code packages apply to Intel CPU platforms, like Kaby Lake or the upcoming Tiger Lake, although there is a smattering of other documents relating to other products, such as a sensor package Intel developed for SpaceX.\n There is also a folder dedicated to the Intel Management Engine, but its contents, too, aren’t anything Intel integrators don’t already know. They’re test code and recommendations for when and how often to run those automated tests while designing systems that include an Intel CPU with the Intel ME.\n One of the dump’s newer bits included “Whitley/Cedar Island Platform Message of the Week,” dated May 5. Cedar Island is the architecture that lies beneath both Cooper Lake and Ice Lake Xeon CPUs. Some of those chips were released earlier this year, while some have yet to become generally available.\n   Some contents provide a cryptic reference to voltage failures in some Ice Lake samples. It’s not clear if the failures apply to actual hardware delivered to customers or if they’re happening on reference boards Intel provided to OEMs for use in designing their own boards.", "posttime": "2020-08-07 08:08:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,代码,investigating", "title": "英特尔正在调查其超过20 GB的源代码和私人数据泄露事件", "title_en": "Intel is investigating the leak of >20GB of its source code and private data", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/08/intel-is-investigating-the-leak-of-20gb-of-its-source-code-and-private-data/", "via": "", "real_tags": ["英特尔", "代码"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "动视及其子公司暴雪娱乐(Blizzard Entertainment)拥有一些世界上最受欢迎、最畅销的视频游戏特许经营权，是赚钱的巨头。\n但暴雪(Blizzard)--制作了“魔兽世界”(World Of Warcraft)等热门影片以及即将上映的“暗黑破坏神4”(Diablo 4)等热门影片的制片厂暴雪(Blizzard)的一些员工表示，他们的工资太低了，以至于他们用免费的办公室咖啡来抑制食欲，不在员工自助餐厅用餐，有一次，他们因为负担不起孩子而选择不生孩子。\n彭博社(Bloomberg)周二上午报道，暴雪员工最近传阅了一份工资文件，该文件突显了公司内部的巨大差距。\n电子表格中最引人注目的是动视(Activision)首席执行官博比·科蒂克(Bobby Kotick)，他在2019年拿到了约4000万美元。\n根据这份报告，尽管公司内部的一些职位提供六位数的工资，但大量质量保证测试员和客服代表的薪酬要低得多。\n动视没有回应“商业内幕”的置评请求。但Activision发言人杰西卡·泰勒告诉彭博社，我们正在不断审查薪酬理念，以更好地认可我们表现最好的员工的才华，并保持我们在行业中的竞争力，所有这些都是为了奖励顶级员工，并在他们身上投入更多资金。\n如果您通过本文中推荐的链接购买产品，Microsoft可能会获得会员佣金。", "note_en": "With some of the most popular, best-selling video game franchises in the world, Activision and its subsidiary, Blizzard Entertainment, are money-making powerhouses.\n    But some employees at Blizzard — the studio responsible for hits like &#34;World of Warcraft,&#34; &#34;Overwatch,&#34; and the upcoming &#34;Diablo 4&#34; — said they were paid so poorly that they used free office coffee as an appetite suppressant, skipped meals in the employee cafeteria, and, in one case, chose not to have kids due to an inability to afford them.\n Blizzard employees recently circulated a salary document that highlighted vast disparities in the company,  Bloomberg reported on Tuesday morning.\n The biggest standout in that spreadsheet came from Activision CEO Bobby Kotick, who took home around $40 million in 2019.\n Though some positions within the company offer six figure salaries, a vast array of quality assurance testers and customer service representatives are paid far less, according to the report.\n Activision didn&#39;t respond to Business Insider&#39;s request for comment. But Activision spokesperson Jessica Taylor told Bloomberg, &#34;We are constantly reviewing compensation philosophies to better recognize the talent of our highest performers and keep us competitive in the industry, all with the aim of rewarding and investing more in top employees.&#34;\n  Microsoft may earn an Affiliate Commission if you purchase something through recommended links in this article.", "posttime": "2020-08-07 08:02:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "支付,rent,暴雪", "title": "据报道，“魔兽世界”和“守望”的制作商暴雪的员工工资很低，他们被迫不吃饭来支付房租，而首席执行官赚了4000万美元", "title_en": "Employees at Blizzard, maker of 'World of Warcraft' and 'Overwatch,' were reportedly paid so little they were forced to skip meals to pay rent while the CEO made $40 million", "transed": 1, "url": "https://www.msn.com/en-us/money/other/employees-at-blizzard-maker-of-world-of-warcraft-and-overwatch-were-reportedly-paid-so-little-they-were-forced-to-skip-meals-to-pay-rent-while-the-ceo-made-40-million/ar-BB17yp2B?li=BBnb7Kw", "via": "", "real_tags": ["支付", "rent", "暴雪"]}, {"category": "", "categoryclass": "", "imagename": "397a8fe3e48bc023fb2016a35b4d2896.jpg", "infoid": 1016816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在听证会上，舒尔曼表示，确定初步禁令在此案中的影响是多么困难。例如，舒尔曼说，优步和Lyft将如何遵守禁令，以及对司机的经济影响，比如他们的收入能力，他们可以工作的时间，以及他们是否有资格享受国家福利，目前还不清楚。\n舒尔曼说：“我感觉有点像是被要求跳入一个水体，而我并不真正知道它有多深，水有多冷，以及我进去后会发生什么。”\n今天的听证会是加利福尼亚州总检察长泽维尔·贝塞拉(Xavier Becera)与洛杉矶、圣地亚哥和旧金山的市政检察官一起提交初步禁令的结果，目的是迫使优步和Lyft遵守AB 5，并立即停止将其司机归类为独立承包商。\n新法律将Dynamex Operations West，Inc.确立的2018年裁决编纂为法典。诉洛杉矶高等法院。在该案中，法院应用了abc检验(稍后将详细介绍)，并裁定Dynamex错误地将其工人归类为独立承包商，其依据是“为雇工提供服务的工人是为索赔工资和福利目的而雇用的雇员”。\n在今天的听证会上，代表加利福尼亚州人民以及优步和Lyft的律师讨论了将工人归类为独立承包商与员工、零工工人保护法案AB 5、“雇佣实体”的定义、失业救济金、带薪病假、工人补偿保险等问题。\n优步和Lyft坚持认为，禁令将要求他们以实质性的方式重组业务，从而阻止他们能够雇佣许多全职或兼职司机。优步和Lyft的论点实际上是，将司机归类为员工将导致失业。\n“拟议的禁令将对Lyft和优步造成不可弥补的伤害，实际上会对司机和乘客造成巨大伤害，”Lyft的律师罗希特·辛拉(Rohit Singla)在听证会上表示。例如，Lyft估计，仅处理核实就业资格的I-9表格就需要数亿美元。提交这份表格不需要任何费用，但这将需要优步和Lyft进一步投资于他们的人力资源和薪资流程。\n此外，辛拉辩称，在此案的这个阶段发布初步禁令将是严厉的。他的论点引起了法官的共鸣。\n“正如他强调的那样，并不是每天都会要求法官初步发布禁令，这可能会影响数十万人。这就是我们现在要处理的问题。“。\n但原告不同意。旧金山市副检察官马修·戈德伯格(Matthew Goldberg)认为，受影响的广大民众是发布禁令的关键原因。此外，戈德伯格认为，优步和Lyft对司机进行重新分类是非常可行的。\n“这是非常可行的，”他说。“[…]。这两家公司的公司都已经拥有非常庞大的白领劳动力。我可以向你保证，这些工人中的每一个都得到了“工伤保险”和其他福利。\n他补充说，“将这套福利扩大到更多的工人，在行政上并不像他们声称的那样困难，因为他们已经为数千名工人这样做了。”\n此外，优步和Lyft支持的Prop 22(细节如下)中有一些元素与AB 5的要求相似，因此原告辩称，Uber和Lyft遵守AB 5不会造成不可弥补的损害。然而，Uber和Lyft不同意。\n在优步的开庭陈词中，优步法律顾问西恩·伊万杰利斯(Theane Evangelis)指出了一系列产品变化，这些变化应该会消除“对合规性的任何怀疑，并证明优步是一个运营着多边市场的技术平台”，她说。例如，优步从6月份开始允许司机自行定价。\n尽管如此，舒尔曼法官仍在追问优步是否有能力满足ABC测试的B点要求。根据美国广播公司的测试，要让招聘实体合法地将工人归类为独立承包商，必须证明(A)工人不受招聘实体的控制和指导，(B)从事实体业务范围以外的工作，以及(C)定期从事“独立建立的行业、职业或与所从事工作性质相同的业务”。\n舒尔曼说：“如果你看看优步(Uber)或Lyft，你会发现它们本身并不从事维护在线应用的业务。”“这就是他们表演的技术。他们的业务是为人们提供搭车服务，以换取补偿。简单地说，这就是他们要做的？不是吗？“\n伊万杰利斯很快回答说：“没有。”她辩称，优步和Lyft所做的只是通过他们的技术平台将司机和乘客联系起来。她还指出了优步提供的各种服务，如优步Eats和货运。伊万杰利斯接着问法官，他是否会将这一计划暂停到11月，届时加州人将对22号提案进行投票，该提案得到了优步(Uber)、Lyft和其他公司的支持。\n投票措施旨在实施在职期间至少为最低工资的120%的收入保证，每英里30美分的费用，医疗津贴，工伤职业意外保险，免受歧视和性骚扰的保护，以及汽车事故和责任保险。然而，最值得注意的是，它将把司机归类为独立承包商。\n然而，舒尔曼法官似乎被这一论点的基础搞糊涂了，他要等到11月才能看到选民的决定。\n“在我看来，这不是我的职责，”他说。更重要的是，在我看来，如果我们中有任何人从2016年的选举中学到了什么，那就是我们中的许多人无法预测选举的结果…。我只是怀疑这样的论调的合法性。“。\n伊万杰利斯在结束发言时表示，优步相信自己今天通过了ABC测试。\n作为5月份提起的诉讼的一部分，提出了初步交汇的动议。诉讼称，优步和Lyft通过将工人错误归类为独立承包商，获得了不公平和非法的竞争优势。诉讼认为，优步和Lyft剥夺了工人获得最低工资、加班、获得带薪病假、残疾保险和失业保险的权利。这起诉讼提交给旧金山高等法院(Superior Court Of San Francisco)，根据加州不公平竞争法，要求对每一次违规行为(可能是每位司机)处以2500美元的罚款，并要求对针对老年人或残疾人的违规行为处以2500美元的罚款。\n与此同时，优步和Lyft都面临加州劳工专员办公室的另一起诉讼，指控他们盗窃工资。昨天在奥克兰提起的诉讼，同样旨在强制执行AB5规定的劳工做法。", "note_en": "In the hearing, Schulman expressed how hard it is to determine the impact of a preliminary injunction in this case. For example, how  Uber   and  Lyft   would comply with the injunction is unknown, as are the economic effects on drivers, such as their ability to earn income, the hours they would be able to work and their eligibility for state benefits, Schulman said.\n “I feel a little bit like I’m being asked to jump into a body of water without really knowing how deep it is, how cold the water is and what’s going to happen when I get in,” Schulman said.\n  Today’s hearing was the result of California Attorney General Xavier Becerra, along with city attorneys from Los Angeles, San Diego and San Francisco,  filing a preliminary injunction in an attempt to force Uber and Lyft to comply with AB 5 and immediately stop classifying their drivers as independent contractors.\n The new law codifies the 2018 ruling established in  Dynamex Operations West, Inc. v Superior Court of Los Angeles. In that case, the court applied the ABC test (more on that a bit later) and decided Dynamex wrongfully classified its workers as independent contractors based on the presumption that “a worker who performs services for a hirer is an employee for purposes of claims for wages and benefits…”\n In the hearing today, lawyers on behalf of the people of the state of California, and Uber and Lyft, discussed the classification of workers as independent contractors versus employees, gig worker protections bill AB 5, the definition of a “hiring entity,” unemployment benefits, paid sick leave, workers’ compensation insurance and more.\n Uber and Lyft maintained that an injunction would require them to restructure their businesses in such a material way that it would prevent them from being able to employ many drivers on either a full-time or part-time basis. Uber and Lyft’s argument, effectively, is that classifying drivers as employees would result in job loss.\n “The proposed injunction would cause irreparable injury to Lyft and Uber, and would actually cause massive harm to drivers and harm to riders,” Rohit Singla, counsel for Lyft, said at the hearing. For example, Lyft estimates it would cost hundreds of millions of dollars simply to process the  I-9 forms, which verify employment eligibility. It doesn’t cost anything to file that form, but it would require Uber and Lyft to further invest in their human resources and payroll processes.\n Additionally, Singla argued that a preliminary injunction at this stage of the case would be drastic. His argument resonated with the judge.\n “It’s not every day that a judge is asked to issue an injunction on a preliminary basis, as he emphasizes, that could potentially affect hundreds of thousands of people. And that’s what we’re dealing with here.”\n But the plaintiffs disagreed. That vast number of people affected is a key reason to issue the injunction, Matthew Goldberg, deputy San Francisco city attorney argued. Additionally, Goldberg argued it would be quite feasible for Uber and Lyft to reclassify its drivers.\n “It’s very doable,” he said. “[…] Both of these businesses already have very large, white-collar workforces at their corporations. I can assure you that every one of those workers is getting workers’ compensation insurance” and other benefits.\n He added, “extending this set of benefits to more workers, administratively, is not as difficult as they allege, given they already do this for thousands of workers.”\n Additionally, there are elements of Uber and Lyft-backed Prop 22 (details below) that are similar to what AB 5 requires, so plaintiffs argue there would not be irreparable harm for Uber and Lyft to comply with AB 5. Uber and Lyft, however, disagree.\n In Uber’s opening arguments, Uber counsel Theane Evangelis pointed to a number of product changes that should remove “any doubt about the compliance and demonstrate Uber is a technology platform” that operates a multi-sided marketplace she said. For example,  Uber began allowing drivers in June to set their own prices.\n Still, Judge Schulman pressed on Uber’s ability to satisfy Prong B of the ABC test. According to the  ABC test, in order for a hiring entity to legally classify a worker as an independent contractor, it must prove (A) the worker is free from the control and direction of the hiring entity, (B) performs work outside the scope of the entity’s business and (C) is regularly engaged in an “independently established trade, occupation, or business of the same nature as the work performed.”\n “If you look at Uber or Lyft, they’re not in the business of maintaining an online app by itself,” Schulman said. “That’s the technology by which they perform. Their business is providing rides to people for compensation. In plain English, that’s what they do? Isn’t it?”\n Evangelis quickly replied, “No.” She argued that what Uber and Lyft do is simply connect drivers and riders through their technology platform. She also pointed to the variety of services Uber offers, such as Uber Eats and Freight. Evangelis went on to ask the judge if he would put this on pause until November, when Californians will vote on Prop 22, which is backed by Uber, Lyft and others.\n The ballot measure looks to implement an earnings guarantee of at least 120% of minimum wage while on the job, 30 cents per mile for expenses, a healthcare stipend, occupational accident insurance for on-the-job injuries, protection against discrimination and sexual harassment and automobile accident and liability insurance. Most notably, however, it would keep drivers classified as independent contractors.\n Judge Schulman, however, seemed flummoxed by the basis of the argument to wait until November to see what voters decide.\n “It seems to me that’s not my role,” he said. “And more significantly, it seems to me, if any of us learned anything from the 2016 election, is many of us are unable to predict the outcome of elections…I just wonder about the legitimacy of an argument like that.”\n Evangelis closed her time by saying that Uber believes it passes the ABC test today.\n The motion for a preliminary junction was filed as part of the suit filed in May, which  asserted Uber and Lyft gain an unfair and unlawful competitive advantage by misclassifying workers as independent contractors. The suit argues  Uber and Lyft are depriving workers of the right to minimum wage, overtime, access to paid sick leave, disability insurance and unemployment insurance. The lawsuit, filed in the Superior Court of San Francisco, seeks $2,500 in penalties for each violation, possibly per driver, under the California Unfair Competition Law, and another $2,500 for violations against senior citizens or people with disabilities.\n Meanwhile,  Uber and Lyft are both facing another lawsuit from the office of the California Labor Commissioner alleging wage theft. Filed yesterday in Oakland, the suit similarly aims to enforce the labor practices set forth by AB 5.", "posttime": "2020-08-07 08:01:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "优步,uber", "title": "\n法官称优步，Lyft初步禁令裁决将在“几天内”到来", "title_en": "\n\t\t\t\tJudge says Uber, Lyft preliminary injunction ruling to come in ‘a matter of days’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/06/uber-lyft-preliminary-injunction-hearing/", "via": "", "real_tags": ["优步", "uber"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想用Rust写一个大项目作为学习练习已经有一段时间了，实际上在2018年年底就开始了(一个FUSE服务器实现)。但后来生活发生了变化，我变得忙碌起来，再也没有带着它去过任何地方。由于特定的世界环境，我目前在室内呆了很长时间，所以rust-fuse(Docs)现在已经存在，并且足以编写基本的hello-world文件系统。我计划进一步完善它，目标是发布支持与libfuse相同用例的v1.0。\n一路上，我做了一些笔记，记录给我留下深刻印象的东西是好是坏。总体而言，我相当喜欢铁锈的语言，对辅助工具的质量有复杂的感觉，并强烈反对包装系统(货物+crates.io)所做的一些决定。\n我从事专业编程已经有15年了，主要是Linux上的网络服务器和GUI。大约在2009到2015年间，我尝试使用Haskell进行系统编程，用纯Haskell(Haskell-dbus，Anansi)和绑定(Haskell-ncurses，Haskell-cpython)编写了几个项目。然而，我不能实现我所希望的那种与基本的C++相比的可靠性改进：Haskell有很多工具来推理计算结构，特别是声明性I/O的Monad，但它对程序员解决非算法问题(如内存生存期)没有太大帮助。(译注：哈斯克尔有很多工具可以用来推理计算结构，特别是声明性I/O的Monad)，但它对程序员解决非算法问题(如内存生存期)没有太大帮助。我花了很多时间调试悬挂指针和竞态条件。\n我发现很难写出运行速度和C语言一样快的Haskell代码，避免分配、自动装箱等感觉需要对未记录或未指定的GHC行为有深入的了解。\n在2015年末，我开始了一种新语言Funk的粗略草图，它将结合Haskell的类型安全性和C/C++的低级精确度。Funk受到谷歌内部方言C++的强烈影响，后者使用智能指针和SUM类型(例如StatusOr&lt；T&gt；)来提高内存安全性-它的许多功能后来成为C++11和C++14标准的一部分。在此基础上，我专注于Haskell风格的类型类和模块，然后开始编写基于Vala的Funk-to-C转换器。\n在某个时候，我四处寻找如何处理内存分配的灵感(我计划使用作用域arenas作为基本的动态内存系统)，我发现了Rust。这是一种正在解决与Funk相同的问题的语言，但是(1)设计得更好，(2)已经实现了，(3)得到了整个编译器专家团队的支持。就这样，Funk转到/dev/null，我记录了一个TODO来学习Rust。\n在C++和Haskell之间寻找结合点的人喜欢Rust，这并不令人惊讶，但我想说清楚：我真的真的很喜欢使用Rust。它几乎是我在系统编程语言中想要的一切，它缺少的几个部分是由于合法的技术困难。我在它的设计中投入了大量的仔细思考-精心制作异步/等待在no_std环境下工作，或者新的内联汇编语法-已经产生了一种不仅比我可能设计的语言更好的语言，而且在阅读Rust RFC之前我甚至不知道存在的轴中它更好。\n夜间发布频道是一个很好的想法，我希望更多的基础设施软件使用它。按照各自的计划稳定各个特性，可以让编译器保持强烈的发布节奏(每六周稳定发布一次！)。用户有权在维护/速度曲线上选择自己的首选点，选择更高的升级成本，以换取提前访问新功能。版本系统走得更远，去掉了会阻碍C++数十年的向后不兼容的语法更改(参见：三联图)。", "note_en": "I&#39;ve been wanting to write a big project in  Rust for a while as a learning exercise, and actually started one in late 2018 (a FUSE server implementation). But then life happened and I got busy and never went anywhere with it. Due to certain world circumstances I&#39;m currently spending a lot of time indoors so  rust-fuse ( docs) now exists and is good enough to write basic hello-world filesystems. I plan to polish it up a bit more with the goal of releasing a v1.0 that supports the same use cases as  libfuse.\n I took some notes along the way about things that struck me as especially good or bad. Overall I quite like Rust the language, have mixed feelings about the quality of ancillary tooling, and have strong objections to some decisions made by the packaging system (Cargo + crates.io).\n   I&#39;ve been programming professionally for 15 years, primarily network servers and GUIs on Linux. Between roughly 2009 and 2015 I experimented with using Haskell for systems programming, writing several projects in pure Haskell ( haskell-dbus,  Anansi) and as bindings ( haskell-ncurses,  haskell-cpython). However, I couldn&#39;t achieve the sorts of reliability improvements over bread-and-butter C++ that I had hoped for: Haskell has a lot of tools for reasoning about the structure of computation, notably monads for declarative I/O, but it doesn&#39;t do much to help the programmer with non-algorithmic concerns such as memory lifetimes. I spent a lot of time debugging dangling pointers and race conditions.\n I found it very difficult to write Haskell code that could run as fast as C. Avoiding allocation, auto-boxing, etc felt like it required a deep knowledge of undocumented or unspecified GHC behavior.\n In late 2015 I started rough sketches for a new language, Funk, that would combine the type-safety of Haskell with the low-level precision of C/C++. Funk was strongly influenced by Google&#39;s internal dialect of C++, which uses smart pointers and sum types (e.g.  StatusOr&lt;T&gt;) to improve memory safety – many of its features later became part of the C++11 and C++14 standards. To this foundation I bolted on Haskell-style typeclasses and modules, then started writing a Funk-to-C translator based on  Vala.\n At some point I was looking around for inspiration on how to handle memory allocation (I planned to use scoped arenas as the fundamental dynamic memory system) and I discovered Rust. Here was a language that was solving the same problems as Funk but (1) better designed (2) already implemented and (3) supported by an entire team of compiler experts. So that was that, Funk went to  /dev/null and I logged a TODO to learn Rust.\n   It shouldn&#39;t come as a surprise that someone looking for a cross between C++ and Haskell would like Rust, but I want to be clear: I really  really enjoy using Rust. It is nearly everything I want in a systems programming language, and the few parts it&#39;s missing are due to legitimate technical difficulty. The amount of careful thought I&#39;ve seen put into its design – crafting  async/await to work in  no_std environments, or the  new inline assembly syntax – has produced a language that is not only better than what I could have designed, it&#39;s better among axes I was not even aware existed prior to reading the Rust RFCs.\n The &#34;nightly&#34; release channel is an excellent idea that I wish more infrastructure software made use of. Stabilizing individual features on their own schedules lets the compiler maintain a blistering release cadence (stable releases every  six weeks!). Users are empowered to choose their own preferred point on the maintenance/velocity curve, opting in to higher upgrade costs in exchange for early access to new features. The &#34;editions&#34; system goes a bit further, derisking backwards-incompatible syntax changes that would have stymied C++ for decades (see: trigraphs).", "posttime": "2020-08-07 08:00:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,生锈,impressions,haskell", "title": "生锈的第一印象", "title_en": "First Impressions of Rust", "transed": 1, "url": "https://john-millikin.com/first-impressions-of-rust", "via": "", "real_tags": ["rust", "生锈", "haskell"]}, {"category": "", "categoryclass": "", "imagename": "b628518e48cca4f8458e2d5c69ddbb2d.png", "infoid": 1016814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Ubuntu 20.04 LTS的第一个点发布上线了！为了庆祝，我们想分享Ubuntu从2004年第一个版本到今天20.04版本的发展历程。感谢社区中的那些人和我们的用户做出的贡献，并与我们一起踏上这段旅程。立即升级到Ubuntu 20.04.1 LTS！\n负责任的披露和协调的反应造福于所有人今天我们发布了USN-4432-1，宣布了一系列漏洞的更新，称为...。\n预定会议日期：8月17日-20日地点：无处不在-今年的KubeCon是虚拟的！布斯：经典的一年，可以说是冒险的一年。\n我们很高兴地宣布，互联网安全中心(CIS)已经公开发布了ROS安全基准，供社区讨论。当.。", "note_en": "Today, the first point release of Ubuntu 20.04 LTS went live! To celebrate, we wanted to share how Ubuntu has evolved since the first release in 2004 to where we are today with 20.04. Thanks to those in the community and our users for your contributions and joining us on this journey. Upgrade to  Ubuntu 20.04.1 LTS now!\n  Responsible disclosure and coordinated response as a benefit to all Today we released USN-4432-1 announcing updates for a series of vulnerabilities termed...\n  Book a meeting Date: August 17-20Location: Everywhere – this year’s KubeCon is virtual! Booth: Canonical This year has been an adventurous one to say the...\n  We’re pleased to announce that the Center for Internet Security (CIS) has publicly released the ROS Security Benchmark for community discussion. When...", "posttime": "2020-08-07 08:00:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,发布", "title": "Ubuntu，2004-20.04 LTS", "title_en": "Ubuntu from 2004 to 20.04 LTS", "transed": 1, "url": "https://ubuntu.com/blog/infographic-ubuntu-from-2004-to-20-04-lts", "via": "", "real_tags": ["ubuntu", "发布"]}]