[{"category": "", "categoryclass": "", "imagename": "2740ac2fa5924f0dc0c42949de01c5b2.jpg", "infoid": 1069695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近发表在《幸福研究杂志》上的一项研究中，研究人员发现，受访者如何评价自己的生活满意度与其他人根据采访对生活满意度的评价之间存在巨大差异。在包括奥地利各地的 500 名参与者在内的研究期间，参与者首先被要求以 1 到 10 的等级对他们对生活的总体满意度进行评分。然后对参与者进行采访，并给出更多关于好坏经历的开放式问题，健康和生活的其他方面。每次访谈都由 12 位不同的评估者进行分析，参与者被置于从 1 到 11 的新量表上，旨在为不同的类别增加更多深度。 11—轻松快乐：受访者对生活真正感到满意。他们的问题往往很小，而且很容易应付。 10——轻微的快乐，有轻微的障碍：受访者大多是轻松的。他们提到了消极的情况，但并没有真正影响整体情绪。 9—有弹性的幸福：这与前一类相似，只是在生活的主要领域发生了负面情况。这些人有很强的应对能力，能够接受生活中的挑战。 8—仍然是积极的享乐平衡，但中心区受损：与前一类相似，但应对能力较弱。这些人的特点是听天由命（例如“我已经习惯了”）。 5—小情绪/守口如瓶：被称为“肤浅或冷漠”，这些受访者没有表现出强烈的消极或积极。\n4—未满足：受访者略微否定。他们表现出缺乏满足感，“似乎过着他们不会选择的生活。”他们为自己未实现的目标和梦想辩护或淡化。 3——生活不和谐但有支持：这些受访者“悲伤、有负担或压力，但有积极的资源或支持”。他们在主要的生活领域有问题会影响他们的情绪，但他们仍然有积极的经历或人给他们带来快乐。 2——没有支持的不和谐生活：这和上一类一样，但没有积极的支持系统。生活让这些人失望，他们对未来并不渴望。 1—显性抑郁症：以完全绝望、不快乐、绝望和对生活环境不满为特征。在进行和分析访谈后，研究人员发现受访者如何自我评价他们的生活满意度与他们如何以叙述方式向评价者报告他们的生活之间存在极大的差异。例如，只有 15 人对他们的满意度进行了 5 分或更差的自我评价，但外部评价者给 40 人的评分为 5 分或更低。更令人惊讶的是，这些低评级案例中只有 6 个匹配。研究小组发现，人们往往对自己的满意度评价很高，但在接受采访时，他们描述了导致研究人员降低评价的不满和不快乐。该研究的通讯作者 Ivo Ponocny 说：“考虑到人们在采访中实际报告的内容，一些高评分似乎主要表达了他们的负担并不比正常情况更糟、无法忍受或作为抱怨的理由。”\n一位受访者将她的生活满意度评为 10 分——可能的最高分——但评分者将她归入第 3 类——“生活不和谐但有支持”。受访者一再抱怨对她的工作/生活平衡不满意，后悔生孩子太小，但也对支持她的丈夫表示感谢。不仅自我报告与外部评级不一致，而且不同的评级者对同一受访者的评级也往往不同。总体评级之间几乎没有可靠的相关性。 Ponocny 指出：“假设采访完全创造了对生活的有效印象，那么收视率显然对受试者和观察者的意义并不相同。”未来的研究显然需要帮助科学家更好地理解如何可靠地衡量生活满意度。然而，从这项研究中可以清楚地看出一件事——人们往往过度夸大自己的生活满意度报告。这可能是因为听起来积极的压力，害怕抱怨，或作为一种防御机制。 Ponocny 说：“研究人员不应将良好的评级误解为表明生活充满积极的情感体验，至少对某些人群而言如此。” “这样做会……人为地高估幸福感。”更多的研究和对生活满意度的更好理解将帮助科学家们能够确定帮助和支持受苦者的方法。", "note_en": "In a recent study published in the   Journal of Happiness Studies, researchers discovered that there is a huge difference between how respondents rate their own life satisfaction and how others rate it based on an interview.\n During the study, which included 500 participants in various parts of Austria, participants were first asked to rate their overall satisfaction with life on a scale of 1 to 10.  Participants were then interviewed and given more open-ended questions about good and bad experiences, health, and other aspects of life.  Each interview was analyzed by 12 different raters and participants were placed on a new scale from 1 to 11 intended to add more depth to the distinct categories.\n   11—Light-hearted happiness: Respondents are authentically pleased with life. Their issues tend to be small and they cope easily.\n 10—Light-hearted happiness with minor impairments: Respondents are mostly lighthearted. They mention negative circumstances but they don’t really impact overall mood.\n 9—Resilient happiness: This is similar to the previous category, except the negative circumstances have occurred in a major area of life. These people have strong coping skills and are accepting of life’s challenges.\n 8—Still positive hedonic balance but impaired in central area: Similar to the previous category, but coping skills are weaker. These people are characterized by resignation (e.g. “I’ve gotten used to it”).\n   5—Small emotions/close-lipped: Known as “shallow or indifferent,” these respondents showed no strong negatives or positives.\n 4—Unfulfilled: Respondents are slightly negative. They show a lack of satisfaction and “seem to live a life they would not have chosen.” They justify or downplay their unmet goals and dreams.\n 3—Disharmonious life but with support: These respondents are “sad, burdened or stressed, but with positive resources or support.” They have problems in major life areas that impair their mood, but they still have positive experiences or people to bring them joy.\n 2—Disharmonious life without support: This is like the previous category, but without a positive support system. Life brings these people down, and they are not eager about the future.\n 1—Dominant depression: Characterized by total despair, unhappiness, hopelessness and dissatisfaction with life’s circumstances.\n After conducting and analyzing the interviews, researchers found that there were extreme discrepancies between how respondents self-rated their life satisfaction and how they reported their lives in a narrative to the raters. For instance, only 15 people self-rated their satisfaction at a 5 or worse, but external raters gave 40 people ratings of 5 or lower.  Even more surprising—only 6 of those low-rated cases matched.\n The team found that people tended to rate their satisfaction very highly, but when interviewed, described dissatisfaction and unhappiness that led to lower ratings by the researchers.\n “Considering what people actually report in the interview, some high ratings seem to mainly express that their burden was not worse than normal, unbearable or as a reason to complain,” said Ivo Ponocny, corresponding author of the study.\n One respondent rated her life satisfaction as a 10—the highest possible score—but raters put her in category 3—“disharmonious life but with support.”  The respondent repeatedly complained of dissatisfaction with her work/life balance and regretted having kids too young, but also expressed appreciation for her supportive husband.\n Not only did self-reports not line up with external ratings, but different raters tended to also rate the same respondent differently. There was little reliable correlation between ratings overall.\n “Assuming that the interviews create a valid impression of life at all, the ratings obviously do not mean the same to the subject and the observer,” noted Ponocny.\n Future research is clearly needed to help scientists develop a better understanding of how to reliably measure life satisfaction. One thing is clear from the study, however—people tend to egregiously overinflate their own reports of life satisfaction.  It may be because of pressure to sound positive, fear of complaining, or as a defense mechanism.\n “Good ratings should not be misinterpreted by researchers as indicating lives full of positive emotional experience, at least concerning some part of the population,” Ponocny said. “Doing so will…artificially overestimate well-being.”\n More research and a better understanding of satisfaction with life will help scientists be able to pinpoint ways to help and support those who are suffering.", "posttime": "2021-07-26 00:21:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "报告,doesn,生活", "title": "你快乐吗？自我报告的幸福感与外部观察不符", "title_en": "Are you happy? Self-reported well being doesn’t match with external observation", "transed": 1, "url": "https://www.psypost.org/2016/01/self-reported-well-being-doesnt-match-up-with-external-observation-40289", "via": "", "real_tags": ["报告", "doesn", "生活"]}, {"category": "", "categoryclass": "", "imagename": "0742718f17174f9732e1367a15494ea7.png", "infoid": 1069694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用 Axios AM/PM 让您忙碌的日子变得更简单。在短短 5 分钟内了解新功能及其重要性。订阅 Axios Closer 以深入了解当天的商业新闻和趋势以及它们为何如此重要订阅 Axios Markets 以获取最新的市场趋势和经济见解。免费注册。通过 Axios Sports 尽情享受推动体育世界发展的统计数据和故事。免费注册。使用 Axios Login 从硅谷和 DC 获取我们对技术的明智看法。免费注册。通过 Axios Sneak Peek 获取新白宫的内幕指南。免费注册。通过 Axios Denver 获取影响您家乡的最重要故事的每日摘要\n通过 Axios Des Moines 获取影响您家乡的最重要故事的每日摘要 通过 Axios Twin Cities 获取影响您家乡的最重要故事的每日摘要 通过 Axios Tampa Bay 获取影响您家乡的最重要故事的每日摘要 获取与 Axios Charlotte 一起了解影响您家乡的最重要故事的每日摘要 及时了解影响阿肯色州西北部的最重要和最有趣的故事，由当地记者撰写 科罗拉多州在 Instagram、TikTok 和其他社交媒体平台上向 120 多名有影响力的人付款Axios 了解到，每月最高 1,000 美元告诉人们接种 COVID-19 疫苗。重要性：影响者是该州鼓励犹豫不决人群接种疫苗的战略的关键部分，例如有色人种、农村居民、信仰社区和年轻人。\n但直到现在，努力的成本——以及影响者的身份——仍未公开。详细信息： Polis 政府聘请了位于丹佛的 Idea Marketing 来管理疫苗信息活动。根据 Axios 在 5 月份的一系列请求中获得的文件，与该公司签订的价值 880 万美元的合同将持续到 9 月 30 日。电视和网站上的竞选广告（其中一些以州长 Jared Polis 为特色）更为明显，但付费影响者是一个鲜为人知的元素。这家营销公司最初的计划是拨出 286,500 美元，以支付人们在社交媒体上积极宣传需要接种疫苗的费用。有必要向社交媒体用户付款，“因为我们知道经常要求不同的社区免费接触他们的社区 - 为了公平，我们知道我们必须为人们的工作提供补偿，”州公众杰西卡布拉利什卫生机构的发言人告诉 Axios。他们在说什么：科罗拉多州疫苗活动经理塔拉·特鲁希略 (Tara Trujillo) 周三告诉记者，“点对点交流是接触科罗拉多人的重要方式。”工作原理：这家营销公司选择了 126 位有影响力的人，他们符合特定类型的看护人、西班牙裔人、社交蝴蝶和忙碌的蜜蜂。科罗拉多州官员批准了这份名单。\n国家提供了影响者可以分享的预先批准的信息，例如宣传疫苗抽奖活动以及为什么接种疫苗很重要。值得注意的是：营销公司没有回复寻求评论的消息，将获得总额的 125 万美元，即合同金额的 14%。底线：该运动已经超出了其印象和参与度的目标，但更广泛的有效性仍然不确定，因为迄今为止，少数群体在疫苗剂量方面的代表性仍然不足。", "note_en": "Make your busy days simpler with Axios AM/PM. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to Axios Closer for insights into the day’s business news and trends and why they matter\n Subscribe to Axios Markets for the latest market trends and economic insights. Sign up for free.\n Binge on the stats and stories that drive the sports world with Axios Sports. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with Axios Des Moines\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with Axios Tampa Bay\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n   Colorado is paying more than 120 influencers on Instagram, TikTok and other social media platforms up to $1,000 a month to tell people to get vaccinated against COVID-19, Axios has learned.\n  Why it matters: The influencers are a key part of the state&#39;s strategy to encourage hesitant populations to get the vaccine, such as people of color, rural residents, faith communities and young adults.\n But the cost of the effort — and the identities of the influencers — remained undisclosed until now.\n Details: The Polis administration hired Denver-based  Idea Marketing to manage the vaccine information campaign. An $8.8 million contract with the firm runs through Sept. 30, according to documents obtained by Axios in a series of requests dating back to May.\n  The campaign advertising (some of which features Gov. Jared Polis) on TV and websites is more visible, but the paid influencers are a lesser-known element.\n The marketing firm&#39;s  initial plan set aside $286,500 to pay people for posting positively about the need to get vaccinated on social media.\n  It&#39;s necessary to pay social media users &#34;because we know that all too often diverse communities are asked to reach out to their communities for free — and to be equitable, we know we must compensate people for their work,&#34; Jessica Bralish, the state public health agency&#39;s spokesperson, told Axios.\n What they&#39;re saying: Colorado vaccine campaign manager Tara Trujillo told reporters Wednesday that &#34;peer-to-peer communication is an important way to reach Coloradans.&#34;\n How it works: The marketing firm selected 126 influencers, who fit certain archetypes as caregivers, Hispanics, social butterflies and busy bees. Colorado officials approved the list.\n The state provided pre-approved messages the influencers could share, such as publicizing the vaccine sweepstakes and why it&#39;s important to get vaccinated.\n Of note: The marketing firm, which did not return a message seeking comment, will get $1.25 million of the total, or 14% of the contract amount.\n The bottom line: The campaign has exceeded its targets for impressions and engagements, but the broader effectiveness remains uncertain because minority populations  remain underrepresented in vaccine doses to date.", "posttime": "2021-07-26 00:20:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "tout,axios", "title": "科罗拉多州正在向社交媒体影响者付费以宣传 Covid-19 疫苗", "title_en": "Colorado is paying social media influencers to tout Covid-19 vaccines", "transed": 1, "url": "https://www.axios.com/colorado-paying-social-media-influencers-covid-vaccine-e281470e-6f1f-4b23-a1c5-a3f2ca8f9593.html", "via": "", "real_tags": ["tout", "axios"]}, {"category": "", "categoryclass": "", "imagename": "219969fbf5de533185cf29a9342311ec.jpg", "infoid": 1069693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DNA、原子和粒子 (Getty Images/Yuichiro Chino) Martin Picard 博士是哥伦比亚大学欧文医学中心的行为医学副教授，专攻精神病学和神经病学。总之，这两个领域的专业知识非常适合理解人类的本质。皮卡德对线粒体特别了解，线粒体是一种几乎存在于所有有细胞核的细胞中的结构。它们提供细胞在其各种生化任务中使用的大部分化学能，有时被比作电池。皮卡德也在线粒体中看到了其他东西。去年，他和一位名叫 Carmen Sandi 的瑞士科学家在 Neuroscience and Biobehavioral Reviews 杂志上发表了一篇论文，该论文认为线粒体不仅让我们活着，而且在很多方面都有自己的生命。而且，也许，甚至是“社交”生物。 “社会具有深刻的进化根源，从单细胞生物到多细胞动物都可以观察到，”皮卡德和桑迪写道。 “与社会原则适用于生物复杂性水平的观点一致，越来越多的数据凸显了线粒体非凡的社会性质。”他们继续说道：“类似于社交网络中的个体，线粒体相互交流并与细胞核交流，表现出群体形成和相互依赖，同步他们的行为，并在功能上专门完成生物体内的特定功能。线粒体是社会细胞器。”当然，如果线粒体是有意识的生物，那将意味着我们身体的每个细胞中都有数以万亿计的这些无脑生物。这个想法可能看起来很荒谬，直到你考虑一个可以解释它的科学概念：泛心论，或者意识与所有物质密不可分的联系，并且随着物理对象变得更加复杂而变得更强大。需要强调的是，这不是 Picard 和 Sandi 在撰写文章时所考虑的（皮卡德告诉沙龙，“我对泛心论的了解还不够多，无法做出明智的评论。”）同时，他们的发现只是一个可以用这一革命性理论解释的迷人科学琐事。泛心论的吸引力可能部分源于这样一个事实，即科学家目前无法解释意识——赋予你思想并让你有自我意识的东西——究竟是什么。在 17 世纪启蒙运动期间，哲学家勒内·笛卡尔（René Descartes）以所谓的“二元论”方法来解释我们的思想如何与我们的身体相互作用而著名。他认为，我们身体的物质和任何创造心灵的物质都是独立的实体（可能由松果体连接），我们的肉体本质上是我们灵魂的家园。这个论点认为，如果科学可以解释一切，它应该能够量化一个思想/灵魂——视觉地描述它、听到它、感受它、测量它并记录它。这些都没有发生；事实上，它发生的概念本身似乎是荒谬的。\n这可能是为什么，尽管今天大多数科学家和哲学家都是一元论者（意味着他们相信我们的思想直接来自我们的身体），但二元论思想在我们的文化中仍然相当普遍。 “问题是很多普通人，他们不是哲学家，而是二元论者，因为他们相信思想或灵魂是一个独立于他们身体的实体，他们的身体，”大卫斯克比纳，哲学家和作者《西方的泛心论》一书告诉沙龙。 “所以很多人出于宗教原因，只是‘常识’的原因，倾向于以二元论或笛卡尔的方式思考，甚至​​没有真正理解它。所以当我们与广大公众交谈时，我们有点陷入困境对于笛卡尔问题，尽管我认为大多数哲学家根本不相信它。”想要在收件箱中收到更多健康和科学故事？订阅沙龙的每周通讯《庸俗的科学家》。也就是说，那些相信我们的思想直接来自我们的身体的人也面临着一些逻辑上的挑战。 “他们必须在物理主义框架内适应思想和意识，这可以说是相当困难的，”斯克比纳解释说。 “这一直是今天的主要挑战之一，就是弄清楚如何不成为二元论者，但仍然解释现实，思想和意识的明显现实。”换句话说，没有方程式，没有理论可以解释或解释我们的意识感受，构成生命和存在的意识和思想的日常状态。物理学、化学或生物学中没有任何东西可以说明它是什么样的。这并不是说科学家们没有尝试通过科学来解释意识。最明显的方法是找到与意识状态相对应的物理特征。例如，如果你能弄清楚大脑的哪些部分与感到快乐、悲伤、鼓舞或无聊有关，那么理论上你可以遵循这一线索最终了解大脑本身是如何“产生”意识的。\n“它没有成功，”Skrbina 指出。 “我认为，这一直是主要的挫折之一，在科学界，实际上找到了各种意识状态的物理关联。据我所知，以及我所看到的最新研究，他们已经无法做到这一点，这表明意识是一种比我们大多数科学家所认为的并且可能愿意承认的更深或更复杂的现象。”这就是泛心论填补空白的地方。它为意识提供了一种解释，它并不试图绕着已知的物理世界的定律做终结，而是假设意识是它的内在部分。此外——正如纽约大学心灵、大脑和意识中心的思想哲学家卢克·罗洛夫斯告诉沙龙——解释意识的最受欢迎的框架经不起推敲。 “最大的动机是对解释意识的主流方法的不满，即用某种复杂的信息处理结构来识别它，”Roelofs 在电子邮件中解释道。 “泛心论者通常认为仅靠结构无法完成这项工作：采用完全无意识的成分并以复杂的方式排列它们似乎与保持完全无意识的整个系统兼容。”因为人脑是由与存在的其他一切事物相同的基本物质组成的，“最自然的观点似乎是[意识]是物质的一般特征。”因此，泛心论——以及物质的想法，一般来说，是有意识的，不管它是否是一个有机体。至于反对泛心论？一个问题是怀疑论者认为从表面上看它是可笑的。 “我认为这主要来自人们如何看待意识的更基本差异，”Roelofs 告诉沙龙。 “泛心论者认为，思想、推理、决策、视觉、听觉和嗅觉以及我们所有的认知复杂性：这些都与意识不同。意识只是主观性，只是‘现在有什么东西存在吗？ ？&#39;所以他们认为意识以简单的形式存在是有意义的，没有思想，没有推理，没有视觉、听觉或嗅觉。很多批评家认为这只是一种混淆：他们认为一旦你去掉思想、推理，等等，就是这样，没什么好说的了。”\n那么，显而易见的下一个问题是：什么是有意识的？它是如何分离自己的？一块石头或一张桌子会有一个统一的意识——或者可能是更大的东西，比如行星，甚至是太阳系？ “泛心论通常不会将所有事物视为一个整体，或拥有自己的统一意识，”挪威内陆应用科学大学的哲学家兼副教授 Hedda Hassel Mørch 通过电子邮件告诉沙龙。 “基本粒子会有简单、统一的意识。有时，这种简单的意识‘组合’或统一成更复杂的形式。这发生在人脑中——我们有整体的统一意识。但它可能不会发生在例如表格和椅子——这些东西只是独立意识粒子的集合。” Roelofs 承认，另一种批评至少是用它自己的方式来解决这个想法的，那就是泛心论不一定能回答它提出的所有问题。 “泛心论者认为你不能通过将大量无意识的事物放在正确的结构中来解释人类意识；好吧，但是通过将大量有意识的事物放在正确的结构中来解释它实际上更容易吗？”罗洛夫斯问道。 “将一组思想组合成一个更大的思想是否有意义？”他补充说，他在这个主题上写了大量文章，“研究为什么将思想结合起来如此令人费解，以及我们是否能够理解它。但对于泛心论作为一种观点，这仍然是一个真正困难的挑战。”另一方面，在解释我们在听音乐、享受美食、看电影或坠入爱河时可以接受的主观体验时，科学同样陷入困境。生活的乐趣有一些无法量化的东西，当我们试图将情绪降低为荷尔蒙时，这一现实并没有被涵盖。这让我们想到了达勒姆大学哲学副教授菲利普·戈夫，他告诉沙龙，我们必须挑战另一位哲学家的思想，他与笛卡尔生活在同一时期——伽利略·伽利莱。 “笛卡尔非常严谨的是伽利略的哲学，”戈夫解释说，并引用了他的书“伽利略的错误”。他争辩说，由于伽利略认为，意识不能用定性和数学术语来解释，伽利略认为它是科学的必要条件，这位伟大的科学家得出结论，它必须与科学过程脱钩，并通过其他知识学科来解释。\n“意识涉及质量——红色体验的红色、咖啡的气味、薄荷的味道，”戈夫说。 “这些品质无法用纯粹的数学量化词汇来捕捉。所以伽利略说，如果我们想要数学科学，我们需要将意识带出科学领域。在伽利略的世界观中，自然界存在这种激进的划分在科学的定量数学领域和物理世界之间，以及意识的定性领域及其颜色、声音、气味和味道之间。”泛心论对宗教也有根本性的影响，因为如此多的人关注我们死后会发生什么的问题。很可能我们的大脑仍然构成了我们身份的大部分（因此，当存储您记忆的神经元死亡时，这些记忆很可能会永远与它们一起消失），但泛心论允许您有意识的“自我”存在于某种形式。它甚至不能完全排除我们带走某些身份的可能性；用斯坦利·库布里克 (Stanley Kubrick) 执导《闪灵》(The Shining) 时的话说，鬼魂存在的看似可怕的前景至少意味着死亡不是最终的。如果属实，泛心论会引发关于其他物质以及非人类事物自我意识程度的问题。这是否意味着无生命的物体也有自我意识？一张椅子、一条裤子和一块石头有能力像人、狗和猪一样思考吗？细菌和病毒等更原始的生物呢？ “泛心论确实表明，自然界的任何地方都可能存在某种程度的意识，”罗洛夫斯解释说。 “泛心论者都接受狗的意识，但有些人可能不想接受椅子的意识：他们可能会说构成椅子的每个粒子都是有意识的，但它并没有以正确的方式构建这些粒子以‘加起来’到任何东西。其他人可能会认为椅子有意识，但它是一种令人难以置信的分散性：因为没有大脑或神经系统，椅子的体验没有秩序或结构，只有无差别的模糊。”最后，他补充说，“泛心论的影响并不是要回答这些问题，而是要提出连续性：不要指望在有意识的最简单动物和没有意识的最复杂动物之间找到一个不连续的边界”吨。” Roelofs 说，没有一条可以划出的界线：“即使某种意识如此简单以至于我们在实践中将它们视为‘无意识’更有用，但差异最终只是程度的问题.”最终，可能永远无法确定泛心论是否站得住脚。毕竟，如果没有某种方法可以在视觉上或物理上识别意识，我们就无法准确地说一个无生命的物体是否具有任何基本的“意识”。这不像你可以问病毒或椅子是否有自我意识。 “从科学的角度来说，我们与意识和一般的心灵紧密相连，只是因为它的本质，”斯克比纳告诉沙龙。 “这不是那种真正需要进行科学分析的事情，就像我说的那样。”\nMatthew Rozsa 是 Salon 的特约撰稿人。他拥有罗格斯大学纽瓦克分校的历史硕士学位，并在利哈伊大学攻读历史博士学位。他的作品曾出现在 Mic、Quartz 和 MSNBC 上。更多来自", "note_en": "DNA, Atoms and particles\t\t\t\t\t\t\t (Getty Images/Yuichiro Chino)   Dr. Martin Picard is an associate professor of behavioral medicine at Columbia University Irving Medical Center, specializing in both psychiatry and neurology. Together, expertise in these two fields suits one well to understanding the essence of what makes one human. Picard is particularly knowledgable about mitochondria, a structure found within nearly all cells that have a nucleus. They provide most of the chemical energy that cells use in their various biochemical tasks, and are sometimes likened to batteries.\n Picard sees something else in mitochondria, too. Last year, he and a Swiss scientist named Dr. Carmen Sandi  published a paper in the journal Neuroscience and Biobehavioral Reviews, which posited that mitochondria do not merely keep us alive, but in many ways, have lives of their own. And, perhaps, are even &#34;social&#34; creatures.\n &#34;Sociality has profound evolutionary roots and is observed from unicellular organisms to multicellular animals,&#34; Picard and Sandi write. &#34;In line with the view that social principles apply across levels of biological complexity, a growing body of data highlights the remarkable social nature of mitochondria.&#34;\n They continue: &#34;Similar to individuals among social networks, mitochondria communicate with each other and with the cell nucleus, exhibit group formation and interdependence, synchronize their behaviors, and functionally specialize to accomplish specific functions within the organism. Mitochondria are social organelles.&#34;\n Of course, if mitochondria are conscious beings, that would mean we have trillions and trillions of these brainless beings chilling throughout literally every cell of our bodies. That idea may seem absurd until you consider a scientific concept which could explain it: Panpsychism, or the idea that consciousness is inextricably linked to all matter and simply grows stronger as a physical object become more complex.\n This, emphatically, is not what Picard and Sandi had in mind when they wrote their article (Picard told Salon that &#34;I do not know enough about panpsychism to make an informed comment.&#34;) At the same time, their discovery is just one more piece of fascinating scientific trivia that could be explained by this revolutionary theory.\n Panpsychism&#39;s appeal may stem partly from the fact that scientists currently can not explain what consciousness – the thing that gives you a mind and makes you self-aware — actually is. During the 17th century Enlightenment, philosopher René Descartes famously argued for a so-called &#34;dualist&#34; approach to explaining how our mind interacts with our body. He argued the physical matter of our bodies and whatever substance creates a mind are separate entities (perhaps connected by the  pineal gland), with our flesh essentially serving as a house for our souls. This argument holds that if science could explain everything, it should be able to quantify a mind/soul — visually describe it, hear it, feel it, measure and record it. None of that has happened; indeed, the very notion of it happening seems nonsensical.\n This may be partly why, although most scientists and philosophers today are monists (meaning they believe our mind directly comes from our physical bodies), dualistic ideas are still quite prevalent in our culture.\n &#34;The problem is a lot of regular people, who are not philosophers, are dualists, because they believe in the mind or the soul as a separate entity from their physical being, their physical body,&#34; David Skrbina, a philosopher and author of the book &#34; Panpsychism in the West,&#34; told Salon. &#34;And so a lot of people for religious reasons, and just &#39;common sense&#39; reasons, tend to think in dualist or Cartesian terms without really even understanding it. And so when we talk to the public at large, we are sort of stuck dealing with the Cartesian question, even though most philosophers, I think, do not give it much credibility at all.&#34;\n  Want more health and science stories in your inbox? Subscribe to Salon&#39;s weekly newsletter  The Vulgar Scientist.\n  That said, those who believe our minds come directly from our bodies are also facing some logical challenges.\n &#34;They have to accommodate mind and consciousness within a physicalist framework, which is arguably quite difficult,&#34; Skrbina explained. &#34;And that&#39;s been sort of one of the central challenges today, is to figure out how to not be a dualist, but still explain the reality, the evident reality of mind and consciousness.&#34;\n In other words, there is no equation, no theory that would account nor explain our conscious feelings, the everyday state of awareness and thought that constitute life and existence. There is nothing in physics or chemistry or biology that accounts what it is like to  be.\n That&#39;s not to say that scientists haven&#39;t tried to explain consciousness through science. The most obvious approach would be to find physical features that correspond to states of consciousness. For instance, if you could figure out which parts of the brain are associated with feeling happy, sad, inspired or bored, you could in theory follow that lead to ultimately learn about how the brain itself &#34;produces&#34; consciousness.\n &#34;It has not been successful,&#34; Skrbina pointed out. &#34;This has been one of the major frustrations, I think, in the scientific community, is to actually find the physical correlate of the various states of consciousness. As far as I can tell, and the latest research I&#39;ve seen, they have been unable to do this, which suggests that consciousness is either a deeper or a more complex phenomenon than most of our scientists have thought and maybe are willing to admit.&#34;\n This is where panpsychism fills in the void. It offers an explanation for consciousness that doesn&#39;t try to do an end run around the known laws of the physical world, but assumes consciousness is an intrinsic part of it.\n Besides — as Luke Roelofs, a philosopher of mind at NYU&#39;s Centre for Mind, Brain, and Consciousness, told Salon — the most popular framework for explaining consciousness does not hold up to scrutiny.\n &#34;The biggest motivation is dissatisfaction with the mainstream approach to explaining consciousness, which is to identify it with some sort of complex information processing structure,&#34; Roelofs explained by email. &#34;Panpsychists generally think that structure alone can&#39;t do the job: taking completely non-conscious ingredients and arranging them in a complicated way seems compatible with the whole system remaining completely non-conscious.&#34; Because the human brain is made up of the same basic matter as everything else in existence, &#34;the most natural view seems to be that [consciousness] is a general feature of matter.&#34;\n Hence, panpsychism — and hence the idea that matter, in general, is conscious, regardless of whether it is an organism or not.\n As for the opposition to panpsychism? One problem is that skeptics feel it is ludicrous at face value.\n &#34;I think that mostly comes from more basic differences in how people think about consciousness,&#34; Roelofs told Salon. &#34;Panpsychists think that thought, reasoning, decision-making, vision and hearing and smell and all of our cognitive complexity: none of those are the same thing as consciousness. Consciousness is just subjectivity, just &#39;is there something it&#39;s like to exist right now?&#39; And so they think it makes sense for consciousness to exist in simple forms without thought, without reasoning, without vision or hearing or smell. A lot of critics think that&#39;s just a mix-up: they think that once you take away thought, reasoning, etc. that&#39;s it, there&#39;s nothing left to talk about.&#34;\n The obvious next question, then, is: what is conscious? And how does it separate itself? Would a rock or a table have a single unified conscious — or perhaps something bigger, like a planet, or even a solar system?\n  &#34;Panpsychism typically does not take all things to be conscious as a whole, or to have their own unified consciousness,&#34; Hedda Hassel Mørch, a philosopher and associate professor at Inland Norway University of Applied Sciences, told Salon by email. &#34;Fundamental particles would have simple, unified consciousness. Sometimes, this simple consciousness &#39;combines&#39; or unifies into more complex forms. This happens in the human brain—we have unified consciousness as whole. But it probably doesn&#39;t happen in e.g. tables and chairs—these things are mere collections of independently conscious particles.&#34;\n Another criticism, which Roelofs acknowledged at least addresses the idea on its own terms, is that panpsychism does not necessarily answer all of the questions that it poses.\n &#34;Panpsychists think you can&#39;t explain human consciousness by putting together lots of non-conscious things in the right structure; okay, but is it actually easier to explain it by putting lots of conscious things in the right structure?&#34; Roelofs asked. &#34;Does it even make sense for a group of minds to combine into one bigger mind?&#34; He added that he has written extensively on this subject, &#34;investigating why combining minds seems so puzzling, and whether we can make sense of it anyway. But it remains a genuinely difficult challenge to panpsychism as a view.&#34;\n On the other hand, science is equally stuck when it comes to explaining the subjective experiences that we can embrace when we listen to music, enjoy delicious food, watch a movie or fall in love. There is something unquantifiable about the joys of life, a reality that is not encompassed when we try to reduce emotions to hormones.\n This brings us to Philip Goff, associate professor of philosophy at Durham University, who told Salon that there is another philosopher whose ideas we must challenge, one who lived in the same period as Descartes — Galileo Galilei.\n &#34;What Descartes was making very rigorous was the philosophy of Galileo,&#34; Goff explained, citing his book &#34;Galileo&#39;s Error.&#34; He argued that because consciousness could not be explained in the qualitative and mathematical terms that Galileo&#39;s deemed essential for something to be scientific, the great scientist concluded it had to be decoupled from the scientific process and explained through other intellectual disciplines.\n &#34;Consciousness involves quality — the redness of a red experience, the smell of coffee, the taste of mint,&#34; Goff said. &#34;These qualities that can&#39;t be captured in a purely quantitative vocabulary of mathematics. So Galileo said that if we want mathematical science, we need to take consciousness out of the domain of science. In Galileo&#39;s worldview, there is this radical division in nature between the quantitative mathematical domain of science and the physical world, and the qualitative domain of consciousness with its colors, and sounds, and smells and tastes.&#34;\n  Panpsychism also has radical implications for religions, since so many focus on questions of what happens after we die. It is likely that our brains still comprise the bulk of our identity (so when the neurons which store your memories die, the  memories most likely die forever along with them), but panpsychism allows for the possibility that your conscious &#34;self&#34; lives on in some form. It does not even entirely preclude the possibility that we take some of our identity with us; to  paraphrase Stanley Kubrick when he directed &#34;The Shining,&#34; the seemingly horrifying prospect of ghosts existing at least means that death is not final.\n If true, panpsychism would raise questions about other substances and the degree to which non-human things are self-aware. Does that mean inanimate objects are also self-aware? Do a chair, a pair of pants and a rock have the capacity to think as a human, a dog and a pig? What about more primitive organisms like bacteria and viruses?\n &#34;Panpsychism does suggest that there may well be some level of consciousness everywhere in nature,&#34; Roelofs explained. &#34;Panpsychists all accept dog-consciousness, but some might not want to accept chair-consciousness: they might say that each particle making up the chair is conscious, but it&#39;s not constructed the right way for these to &#39;add up&#39; to anything. Others might think that chairs have consciousness, but of an incredibly diffuse sort: because there&#39;s no brain or nervous system, there&#39;s no order or structure to the chair&#39;s experience, just an undifferentiated blur.&#34;\n Ultimately, he added, &#34;The impact of panpsychism isn&#39;t so much to answer these questions, but to suggest continuity: don&#39;t expect to find a discontinuous boundary somewhere between the simplest animal that is conscious and the most complex animal that isn&#39;t.&#34; Roelofs says there isn&#39;t a line that one could draw: &#34;even if some sorts of consciousness are so simple that it&#39;s more useful for us, in practice, to treat them as &#39;mindless&#39;, nevertheless the differences are ultimately just matters of degree.&#34;\n In the end, it may prove impossible to ever definitively ascertain whether panpsychism holds water. After all, without some way to visually or otherwise physically identify consciousness, we can&#39;t precisely say whether an inanimate object has any rudimentary &#34;consciousness&#34; in it. It&#39;s not like you can ask a virus or chair if they are self-aware.\n &#34;Scientifically speaking, we&#39;re in quite a bind with consciousness in particular and with the mind in general, just because of the nature of what it is,&#34; Skrbina told Salon. &#34;It is not the kind of thing that is really, like I say, subject to scientific analysis.&#34;\n       Matthew Rozsa is a staff writer for Salon. He holds an MA in History from Rutgers University-Newark and is ABD in his PhD program in History at Lehigh University. His work has appeared in Mic, Quartz and MSNBC.\n  MORE FROM", "posttime": "2021-07-26 00:20:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,生命,inanimate,意识", "title": "无生命物体具有意识的想法受到科学家的欢迎", "title_en": "The idea that inanimate objects have consciousness gains steam with scientists", "transed": 1, "url": "https://www.salon.com/2021/07/23/panpsychism-the-idea-that-inanimate-objects-have-consciousness-gains-steam-in-science-communities/", "via": "", "real_tags": ["科学家", "生命", "inanimate", "意识"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "偶尔，我会遇到一个 1980 年代的 BASIC 程序，通常是为 Commodore 64、Apple ][ 或 TRS-80 编写的。我想将它音译成现代语言，重构它并探索它。这些旧程序很好地介于重构汇编语言和重构现代语言之间。我们将研究一种作为重构起点的翻译方法。在某些 BASIC 中，可以使用冒号 (:) 将两个或多个语句放在同一行。如果冒号跟在 THEN 子句之后，则这些语句是 THEN 的一部分。常用命令包括：​​assignment、END、FOR、GOSUB、GOTO、IF..THEN、POKE、PRINT、REM（备注，用于注释）、RETURN 不太常用的命令包括：​​DATA（定义常量数据）、DEF（创建单行）函数）、DIM（维度 – 创建数组）、INPUT、ON..GOTO（计算的 GOTO）、READ（来自 DATA 语句）、RESTORE（重置 DATA 语句）、STOP（可重新启动的停止）。为了转换行号，我们可以将整个代码放入一个带有 switch 语句的循环中。这实际上是一个状态机（参见参考资料），其中的线代表状态。 var line = 1 while line != 0 { switch line { case 10: // 第 10 行的代码 goto(20) break case 20: // 第 20 行的代码 goto(30) break : default: line += 1 } }\n引用行号的 IF、GOTO 或 GOSUB 等语句可以查询或设置行变量。 END 语句可以将行号强制为 0。其他语句将其设置为最后一步（或失败）。如果冒号前出现 NEXT 或 GOSUB，则“:”后的代码将是目标，需要将行分开。在这些情况下，我会给拆分部分一个唯一的负行号。负行号不是合法的 BASIC，但这适用于我们的 switch 语句。不同的 BASIC 对变量名有不同的规则。所有旧的都至少支持单字母或字母数字不区分大小写的变量名（X，B9）。大多数都支持以 $ 结尾的字符串（A$，与 A 不同）。大多数允许您创建一维数组（使用 DIM 语句）。一些 BASIC 允许您使用两个字母字符作为变量名称。有些（奇怪）让你使用更长的名字，但只保留前两个字符，如果你不小心在名字中形成了一个关键字，它会被使用。 OSI 手册（参见参考资料）给出了一个变量 ANEW 的例子，它在执行时擦除程序，因为这就是“NEW”所做的。一些 BASIC 仅支持整数，其他支持浮点数（并且不区分整数，JavaScript 风格）。在某些情况下，您可以推断类型（int 或 float）或可能的值范围。 10 X = 53520 :100 如果 X &gt; 53500 那么 X=X-1110 如果 X &lt; 53530 那么 X=X+1\n由于该值以整数开头，并且只对整数进行加减运算，因此我们知道它是整数，而不是浮点数。由于 if 语句，我们知道 X 的范围是 53500…53530。这对于内存映射 I/O 非常有用——例如，PEEK 和 POKE 访问屏幕内存。了解变量的范围可能会告诉我们它是否仅限于屏幕内存甚至特定行。其中 STEP 子句是可选的，NEXT 语句中的变量也是可选的。变量表示要关闭哪个循环；没有变量意味着关闭最里面的活动循环。循环需要一个堆栈来跟踪嵌套循环。为了模拟这一点，我们将在堆栈上保留一个元组： FOR: If var is in the stack { - // 重新启动循环，从堆栈中删除 var 的条目——某些语义也可能会弹出内部循环 } push tuple set var = start -- 许多 BASIC 至少执行一次循环体 -- (即使 start &gt; end) -- 我不知道其他人如何确定循环结束的位置 goto(loop-body) NEXT X: Pop until variable X is在堆栈顶部 — 如果未找到则未定义 句柄为普通 NEXT\n下一步：对于堆栈顶部的变量： — undefined if none var = var + skip if var &lt;= end then { goto(tuple.loop-body) } else { pop ; goto(exit-target) } — NEXT 之后的行 如果循环的文本范围很明确，您可以避免所有这些并将其音译为“常规”for 循环。这是语用学对语义学的胜利。语义上说它没有任何意义，可以删除。实用主义者说“这些 BASIC 没有优化，所以这会造成延迟。”我会将这些转换为对 usleep() 的调用。旧的 BASIC 的子程序不是递归的，它们不传递参数，因此它们在技术上不需要堆栈。也就是说，堆栈仍然是实现它们的简单方法。将 GOSUB 后面的语句的行号放入堆栈。如果 GOSUB 位于“:”行，则它可能必须是生成的行号。请注意，RETURN 不是在文本上匹配的，而是在动态遇到 RETURN 语句时找到的。一旦我们音译了代码，我们通常希望将其重构为现代风格。\n虽然最初是作为一个笑话提供的（参见参考资料中的 Lawrence），但分析 COME FROM 很有用——控制从哪里转移？ 10 GOTO 50 :50 X=060 GOSUB 500: Y=1070 GOTO 50 :500 Z=10 : 550 RETURN 因为第 60 行包含一个 :，我们将其拆分。 （如果它是“IF”的一部分，我们必须更加小心。） 10 GOTO 50 :50 X=0 *** 来自 10 或 7060 GOSUB 50065 Y=10 *** 来自 55070 GOTO 50 ： 500 Z=10 *** 来自 60 : 550 RETURN 从这个分析中我们得到三个有用的东西：单入口代码块、单目标代码块和关于子程序的信息。从一个“来自”到下一个的代码只有一个入口点，尽管它可能有多个出口点。我们只需要保留块的第一行号。因此，我们的翻译可以包括“案例 50”下的两个陈述。\n由于我们想要进行的重构之一是使代码“结构化”，因此消除不必要的行号有助于我们专注于更大的结构。 50 GOTO 80 60 line 60 stuff 70 GOTO 100 80 line 80 stuff 90 line 90 stuff 100 etc 如果第80行是第50行的唯一目标，我们可以将第80行和第90行向上移动以替换第50行： 50 line 80 stuff 51 line 90 stuff 52 GOTO 100 — 在 60 line 60 stuff 之前是隐含的 — 大概是某个 GOTO 的目标；省略第 70 行并落入第 100 行等等，也就是说，可以将一个单一目标的代码块上拉到到达它的地方。 （只需确保处理显式目标和语句之间的失败。）我们获得有关子例程调用者的信息。如果只有一个调用者，我们可以通过将 GOSUB 更改为 GOTO，并将 GOSUB 后面的语句更改为 GOTO 来内联它。许多旧代码使用 PEEK 和 POKE 来处理与系统相关的方面：屏幕、键盘、图形模式、偶尔的汇编语言方法。我将在以后的文章中探讨这一点。\n旧的 BASIC 并不漂亮，但翻译和现代化一些旧代码很有趣。克拉克，R.劳伦斯。 “对 GOTO-less 编程的语言贡献”，CACM，1984 年 4 月，第 349-350 页。", "note_en": "Once in a while, I run into a 1980s-era BASIC program, typically written for Commodore 64, Apple ][, or TRS-80. I’d like to transliterate it into a modern language, refactor it, and explore it. These old programs make a nice halfway point between refactoring assembly language and refactoring a modern language.\n  We’ll look at a translation approach that makes a starting point for refactoring.\n        In some BASICs, a colon (:) can be used to put two or more statements on the same line. If the colon follows a THEN clause, those statements are part of the THEN.\n Common commands include: assignment, END, FOR, GOSUB, GOTO, IF..THEN, POKE, PRINT, REM (remark, for comments), RETURN\n Less common commands include: DATA (defines constant data), DEF (create one-liner functions), DIM (dimension – create arrays), INPUT, ON..GOTO (computed GOTO), READ (from DATA statements), RESTORE (reset DATA statements), STOP (re-startable stop).\n  To translate line numbers, we can put the whole code in a loop with a switch statement. This is effectively a state machine (see  References) with the line representing the state.\n var line = 1  while line != 0 { switch line { case 10:  // code for line 10 goto(20) break case 20:  // code for line 20      goto(30) break : default:     line += 1 } }\n A statement such as IF, GOTO, or GOSUB that references  a line number can consult or set the line variable. The END statement can force the line number to 0. Other statements set it as their last step (or fall through).\n If a NEXT or GOSUB appears before a colon, the code after the “:” will be a target, and the line needs to be broken apart. In those cases, I’ll give the split-off part a unique negative line number. Negative line numbers aren’t legal BASIC, but this works for our switch statement.\n  Different BASICs have different rules about variable names. All the old ones support at least single-letter or letter-number case-insensitive variable names (X, B9). Most have string support with $ at the end (A$, which is different from A). Most let you create one-dimensional arrays (using DIM statements).\n Some BASICs let you use two alpha characters for variable names. Some (bizarrely) let you use longer names, but only the first two characters are retained, and if you accidentally form a keyword inside the name, it will get used. The OSI manual (see  References) gives an example of a variable ANEW that erases the program when it is executed, because that’s what “NEW” does.\n  Some BASICs are integer-only, others support floats (and don’t distinguish integers, JavaScript style).\n  In some cases, you can deduce types (int or float) or possible ranges of values.\n  10 X = 53520 :100 IF X &gt; 53500 THEN X=X-1110 IF X &lt; 53530 THEN X=X+1\n Since the value starts an an integer, and only adds or subtracts integers, we know it’s an integer, not a float.\n Because of the if statements, we know X is in the range 53500…53530.\n This is mostly useful for memory-mapped I/O – e.g., PEEK and POKE getting access to the screen memory. Knowing a variable’s range may tell us if it is restricted to screen memory or even to a particular line.\n     where the STEP clause is optional, as is the variable on the NEXT statement. The variable says which loop to close; no variable means close the innermost active loop.\n Loops require a stack to track nested loops. To simulate this, we’ll keep a tuple on the stack:\n   FOR:  If var is in the stack { -     // restart the loop    remove var’s entry from the stack — some semantics may instead pop inner loops too } push tuple  set var = start -- Many BASICs execute the loop body at least once -- (even if start &gt; end) -- I don&#39;t know how the others determine where the loop ends goto(loop-body)\n NEXT X: Pop until variable X is on top of stack   — undefined if not found Handle as plain NEXT\n NEXT: For variable on top of stack:    — undefined if none var = var + skip  if var &lt;= end then { goto(tuple.loop-body) } else { pop ; goto(exit-target) }    — the line after the NEXT\n If the textual scope of the loop is clear, you can avoid all this and transliterate it as a “regular” for loop.\n   This is a triumph of pragmatics over semantics. The semantics say it means nothing, and can be deleted. The pragmatics say “these BASICs don’t optimize, so this creates a delay.” I’ll translate these into a call to usleep().\n  Old BASICs’ subroutines are not recursive, and they don’t pass arguments, thus they technically do not require a stack.\n That said, a stack is still an easy way to implement them. Put the line number of the statement following the GOSUB onto the stack. It may have to be a generated line number if the GOSUB is on a “:” line.\n     Note that RETURN is not matched up textually, but rather found when the RETURN statement is dynamically encountered.\n  Once we’ve transliterated the code, we often want to refactor it to a modern style.\n Although originally offered as a joke (see Lawrence in  References), it’s useful to analyze COME FROM – where does control transfer  from?\n  10 GOTO 50 :50 X=060 GOSUB 500: Y=1070 GOTO 50   :500 Z=10   : 550 RETURN\n Because line 60 contains a :, we’ll split it. (We’d have to be more careful if it were part of an “IF”.)\n 10 GOTO 50   :50 X=0                      ***   Comes from 10 or 7060 GOSUB 50065 Y=10                    ***  Comes from 55070 GOTO 50  :500 Z=10                  *** Comes from 60    : 550 RETURN\n We get three useful things from this analysis: single-entry blocks of code, single-target blocks of code, and information about subroutines.\n  The code from one “come from” to the next has only one entry point, though it may have multiple exit points.\n        We only need to keep the first line number of a block. Thus, our translation can include both statements under “case 50”.\n Since one of the refactorings we want to do is to make the code “structured”, eliminating unnecessary line numbers helps us focus on the larger structure.\n   50 GOTO 80 60 line 60 stuff 70 GOTO 100 80 line 80 stuff 90 line 90 stuff 100 etc\n If line 80 is the only the target of line 50, we could move lines 80 and 90 up to replace line 50:\n 50 line 80 stuff 51 line 90 stuff 52 GOTO 100      — was implicit before 60 line 60 stuff     — presumably a target of some GOTO; omit line 70 and fall through 100 etc\n That is, a single-target block of code can be pulled up to the one place that goes to it. (Just make sure to handle both explicit targets and the fall-through between statements.)\n  We get information about the callers of a subroutine. If there’s only one caller, we can inline it by changing GOSUB to GOTO, and changing RETURN to GOTO the statement following the GOSUB.\n   A lot of old code uses PEEK and POKE to get at system-dependent aspects: screen, keyboard, graphics modes, occasional assembly-language methods. I’ll explore this in a future article.\n  Old BASICs aren’t pretty, but it’s fun to translate and modernize some of the old code.\n  Clark, R. Lawrence. “ A Linguistic Contribution to GOTO-less Programming”, CACM, April, 1984., pp. 349-350.", "posttime": "2021-07-25 23:33:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "老式,school,语句", "title": "音译老式基础", "title_en": "Transliterating Old-School Basic", "transed": 1, "url": "https://xp123.com/articles/transliterating-old-school-basic/", "via": "", "real_tags": ["老式", "school", "语句"]}, {"category": "", "categoryclass": "", "imagename": "036414047919e83ed157e732d908023e.jpg", "infoid": 1069689, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用乐高® 风格打造您自己的老式打字机", "note_en": "Build your own old-fashioned typewriter in LEGO® style", "posttime": "2021-07-25 23:32:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "乐高,lego,打造", "title": "乐高打字机", "title_en": "Lego Typewriter", "transed": 1, "url": "https://www.lego.com/en-gb/product/typewriter-21327", "via": "", "real_tags": ["乐高", "lego", "打造"]}]