[{"category": "", "categoryclass": "", "imagename": "eec845f7e03d51aa6032d81f3678356c.jpeg", "infoid": 1034483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从表面上看，大牌金融机构(或银行)应该是你血汗钱的保管人，是防范非法活动的第一道防线。尽管有关大银行涉嫌轻罪、非法活动和洗钱的报道并不新鲜，但新的爆料进一步揭示出，这些大型金融机构是如何在发出明确危险信号的情况下，教唆腐败的政客、欺诈者、毒贩和恐怖组织转移资金的。\n大约两年时间里，德意志银行(Deutsche Bank)(德国)、丹斯克银行(Danske Bank)(丹麦)和高盛(Amp；Goldman Sachs)(美国)这三家“声名狼藉”的银行被发现存在违规行为，时间跨度为2013-18年。然而具有讽刺意味的是，监管机构向这些银行开出的数十亿美元罚单并没有帮助阻止这些大胆的白领犯罪，更不用说阻止它们了。\n似乎这还不够，BuzzFeed新闻发现的最新可疑活动报告(SARS)宝库通过国际调查记者联盟(ICIJ)与世界各地的记者分享。泄露的文件突显了价值约2万亿美元的非法交易，这些交易涉及向美国政府金融犯罪执法网络(FinCEN)提交的2000多起SARS。\n“由于完全未能阻止大规模腐败交易，金融机构已经放弃了它们作为反洗钱第一线防御者的角色。”\nICIJ是2016年发布臭名昭著的巴拿马文件的同一个组织。这起泄密事件暴露了世界各国领导人、公职人员、政界人士以及数百名名人、商界人士和其他富人的身份，他们都使用离岸银行账户向当局隐瞒自己的财富。\nICIJ组织了一个由来自88个国家110家新闻机构的400多名记者组成的团队，调查银行和洗钱的世界。据ICIJ称，所谓的FinCEN文件强调了1999年至2017年间20年间进行的价值超过2万亿美元的非法交易。银行业中“知名”人物的介入在很多层面上都令人不安。\nSARS是金融机构员工创建的机密文件，目的是提醒FinCEN注意他们遇到的任何可疑交易。FinCEN在审查了这些交易后，将其与执法部门分享，以便采取进一步行动。这些报告表明，银行在报告多笔交易中的可疑交易方面做得不够。\n根据FinCEN文件中概述的可疑交易金额，上图对排名前10位的银行进行了排名。在报告的前十大银行中，仅德意志银行一家的交易价值就超过1.3万亿美元，紧随其后的是美国银行业巨头摩根大通(JPMorgan)，可疑交易超过5140亿美元。\n除了这些银行无法阻止可疑交易外，它们还花了比规定的30至60天时间长得多的时间来向当局通报这些交易。报告建议报告可疑活动利用情况的中位数时间为166天。英国银行业巨头巴克莱银行(Barlclays)的表现最差，提交报告的中位数为1205天，摩根大通(JPMorgan)紧随其后，只用了526天，渣打银行(Standard Chartered)花了426天。\n这不仅仅是金融机构对遵守反洗钱指导方针的极端麻木不仁，而是银行通常只有在交易或客户成为负面新闻文章或政府调查的主题后才提交可疑活动报告的事实。到那时，钱早已不见了。\n报告中详细描述了通过这些银行绕过反洗钱规定的各种犯罪活动和腐败分子。想象一下，德意志银行(Deutsche Bank)这样的机构仍然是洗钱者的最爱，情况有多严峻。自2008年以来，德意志银行已被罚款超过180亿美元，自2007年达到峰值以来，其股票价值损失了90%以上。有一点是肯定的：重罚并不能阻止银行转移黑钱，因为这是有利可图的。\n虽然人们因轻微罪行而被送进监狱，但这些白领强盗仍然逍遥法外。", "note_en": "On the face of it, big-name financial institutions (or banks) are supposed to be custodians of your hard-earned money and the first line of defense against illicit activities. While the report of big banks being involved in misdemeanor, illegal activities &amp; money laundering is nothing new, new revelations shed further light on how these mega financial institutions abet corrupt politicians, fraudsters, drug traffickers and terrorist organizations in moving money despite clear red flags.\n Roughly two years, three of  the “reputed” banks — Deutsche Bank (Germany), Danske Bank (Denmark) &amp; Goldman Sachs (United States)  were found to involved in malpractices, covering a 5 year period from 2013–18. Ironically though, billions of dollars of fines handed out by the regulators to these banks have not helped to stop these audacious white-collar crimes, let alone slow them down.\n As if this was not enough, the most recent treasure trove of suspicious activity reports ( SARs), recovered by   BuzzFeed News  was shared  with the reporters all over the world via the International Consortium of Investigative Journalists ( ICIJ). The  leaked documents highlight about $2 trillion worth of illegal transactions, laid out in more than 2,000 SARs, filed with the US government’s Financial Crimes Enforcement Network ( FinCEN).\n  “By utterly failing to prevent large-scale corrupt transactions, financial institutions have abandoned their roles as front-line defenses against money laundering.”\n  ICIJ is the same organization that published the infamous Panama Papers in 2016. This leak revealed the identity of world leaders, public officials, politicians and hundreds of celebrities, business people, and other wealthy individuals, all of whom used offshore banking accounts to hide their wealth from the authorities.\n According to the ICIJ, which organized a team of more than 400 journalists from 110 news organizations in 88 countries to investigate the world of banks and money laundering, the so-called  FinCEN Files highlighted more than $2 trillion worth of illicit transactions conducted during two decades between 1999–2017. The involvement of “reputed” names in the banking industry was disturbing at so many levels.\n  SARs are confidential documents created by employees at the financial institutions to alert the FinCEN about any dubious transactions that they come across. FinCEN, after reviewing these transactions then shares them with law enforcement authorities to take further action. The reports indicate how banks have fallen short to report suspicious transactions on multiple transactions.\n The figure above ranks the top 10 banks according to the amount they moved in suspicious transactions as outlined in the FinCEN files. Of the top 10 banks reported,  Deutsche Bank alone accounted for more than $1.3 trillion worth of transactions followed by American banking giant  JPMorgan recording in excess of $514 billion in suspicious transactions.\n Besides the inability of these banks to stop dubious transactions, it also took them much longer than the stipulated time of 30–60 days to alert the authorities of these transactions. The report suggested a median time period of 166 days to report the intilization of the suspicious activity. British banking giant Barlclays performed the worst with a median time of 1,205 days to file a report followed by JPMorgan which took 526 days &amp; Standard Chartered which took 426.\n It was not just the extreme callousness on the part of the financial instituion to follow the Anti-money laundering guidelines, but the fact that banks usually filed suspicious activity reports only after a transaction or customer became the subject of a negative news article or a government inquiry. And by that time the money was long gone.\n Various accounts of criminal activity and corrupt elements bypassing the AML regulations via these banks have been detailed in the report. Imagine the severity of the situation that an institution like Deutsche Bank, which has been fined in excess of $18 billion since 2008 and lost more than 90% of its stock value since the peak reached in 2007 continues to be the favorite for money launderers. One this is for sure: Big penalties don’t stop banks from moving dirty cash since it’s profitable.\n While people are sent behind bars for petty crimes, these white collar dacoits remain scot free.", "posttime": "2020-11-11 15:12:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "银行,banks", "title": "大银行是超过2T美元洗钱的前沿和中心", "title_en": "Big Banks are at the front and center of money laundering of over $2T", "transed": 1, "url": "https://medium.com/technicity/big-banks-are-at-the-front-center-of-money-laundering-of-over-2-trillion-299feea4c58e", "via": "", "real_tags": ["银行", "banks"]}, {"category": "", "categoryclass": "", "imagename": "3be8fd47e3396969fe773cbbe8aa1147.jpeg", "infoid": 1034482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果人工智能最终不能治愈癌症怎么办？这是《华尔街日报》(Wall Street Journal)对沃森(Watson)的一篇大剖析所传达的信息。沃森是IBM的一个项目，该项目本应将IBM的计算能力转变为一个可扩展的程序，可以为全球数百万患者提供最先进的个性化癌症治疗方案。\n总体而言，沃森，尤其是它的肿瘤学应用，最近收到了很多质疑的报道；STAT去年发布了一项重大调查，报告称，沃森远远不能兑现IBM的承诺。在那篇文章发表后，IBM的炒作机器开始淡化一些东西。但是，虽然沃森的很多问题都是医疗或技术问题，但它们也是严重的财务问题。\nIBM正在缩水：2011年，当该公司首次提出沃森有朝一日可能治愈癌症的想法时，其收入为1070亿美元。自那以后，它们的规模一年比一年小，2017年最终达到790亿美元。这给任何首席执行官带来了巨大的问题，他们通常负责发展公司，或者如果做不到这一点，就会推高股价。\n在一家收入下降的公司里，很难保持股价的增长，因为这些公司的估值往往是收入的倍数--而这个倍数本身就会下降。比方说，如果IBM的市值从2011年的3倍上升到2017年的2倍，那么其市值将缩水50%以上。\n然而，这并没有发生，因为IBM通过两个主要战略在一定程度上抵消了负面力量，保持了股价的稳定。第一个是沟通：如果你能说服市场相信你会变得更大而不是更小，那么你的市盈率就会增加，你的股价也会上涨。早在沃森真正准备好进入黄金时段之前，IBM就通过炒作沃森来推行这一策略。如果市场相信IBM有能力治愈癌症，那么他们就会抬高股价，预期在不久的将来会有重大的收入增长。\n在营收下滑的情况下支撑股价的第二种策略是基本的金融工程，即股票回购。如果你在公开市场回购大量股票，那么即使你的市值下降，你的股价也可以上涨。这种策略的不利之处在于，你花在回购上的钱越多，你可以投资于增长的资金就越少。\n前IBM品牌经理彼得·格劳里奇(Peter Greulich)说：“IBM应该停止治疗癌症。”他写了几本关于IBM历史和现代挑战的书。“他们松开了营销引擎，却没有控制如何制造和制造产品。”\nGreulich表示，IBM需要向屈臣氏投入更多资金，并雇佣更多人才能使其取得成功。他说，在20世纪60年代，IBM花了大约11.5倍的年收入来开发其大型机，这一业务在今天仍占其盈利的很大一部分。\n如果它要对屈臣氏进行同等的投资，它将需要花费1370亿美元。Greulich说：“它唯一花了这么多钱的就是股票回购。”\n这并不是说IBM没有向沃森投资，而是它已经投资了。但是，虽然六年和数十亿美元对于硅谷初创公司来说是一大笔时间和金钱，但在医学试验领域，这是一笔相当正常的支出，大多数试验都失败了。\n更重要的是，在人工智能方面，IBM正在与亚马逊(Amazon)和Alphabet等竞争对手竞争，这些公司仍在快速增长，认为没有必要回购自己的股票，也同样认为没有必要在真正准备好成为聚光灯下之前大肆宣传自己的人工智能成就。沃森擅长做宣传噱头--没有一篇关于它的文章没有必要提到它赢得《危险边缘》(Jeopardy)的时间(似乎这篇文章也是如此)--但人工智能是一个很难解决的问题，顶尖计算机科学家在这个领域的需求量高得令人难以置信。这些科学家不会去有最好的媒体的公司，他们会去有最好的人工智能和最好的科学的公司。向人工智能中的任何人询问关于沃森的事情，你都会毫不含糊地被告知，他们在一个竞争异常激烈的领域里是个失败者。\n因此，肿瘤学人工智能的最大希望不是沃森会以某种方式大幅好转。相反，这是因为Alphabet或其他人一直在悄悄地打造一款改变游戏规则的人工智能，而不是事先过度炒作。人工智能仍有可能在肿瘤学领域做出令人惊叹的事情。只是别指望这些进步来自沃森。", "note_en": "What if artificial intelligence can’t cure cancer after all? That’s the message of a big Wall Street Journal  post-mortem on Watson, the IBM project that was supposed to turn IBM’s computing prowess into a scalable program that could deliver state-of-the-art personalized cancer treatment protocols to millions of patients around the world.\n  Watson  in general, and its oncology application in particular, has been receiving a lot of  skeptical coverage of late; STAT  published a major investigation last year, reporting that Watson was nowhere near being able to live up to IBM’s promises. After that article came out, the IBM hype machine started toning things down a bit. But while a lot of the problems with Watson are medical or technical, they’re deeply financial, too.\n        IBM is shrinking: In 2011, when the company first introduced the idea that Watson might be able to one day cure cancer, its revenues were $107 billion. They’ve gotten smaller every year since, ending up at $79 billion in 2017. That presents enormous problems for any CEO, who’s generally charged with growing the company, or, failing that, growing the stock price.\n  It’s very hard to keep a stock price growing in a company where revenues are falling, because those companies tend to be valued on a multiple of revenues—and that multiple itself will fall. If IBM went from being worth, say, 3 times revenues in 2011 to 2 times revenues in 2017, then its market capitalization would have shrunk by more than 50 percent.\n    This hasn’t happened, however, because IBM has to some degree counteracted the negative forces and kept its stock price steady through two main strategies. The first is communications: If you can persuade the markets that you’re going to get bigger rather than smaller, then your multiples will grow and your shares will rise. IBM pursued this strategy by hyping Watson long before it was really ready for prime time. If the markets believed that IBM was capable of curing cancer, then they would bid up the shares in the expectation of a major revenue boost in the near future.\n    The second strategy for shoring up a stock price in the face of declining revenues is basic financial engineering, in the form of share buybacks. If you buy back a large number of shares in the open market, then your share price can rise even as your market capitalization falls. The downside of that strategy is that the more money you spend on buybacks, the less money you have to invest in growth.\n      “IBM ought to quit trying to cure cancer,” said Peter Greulich, a former IBM brand manager who has written several books about IBM’s history and modern challenges. “They turned the marketing engine loose without controlling how to build and construct a product.”\n Greulich said IBM needs to invest more money in Watson and hire more people to make it successful. In the 1960s, he said, IBM spent about 11.5 times its annual earnings to develop its mainframe computer, a line of business that still accounts for much of its profitability today.\n If it were to make an equivalent investment in Watson, it would need to spend $137 billion. “The only thing it’s spent that much money on is stock buybacks,” Greulich said.\n        It’s not that IBM hasn’t invested boatloads in Watson; it has. But while six years and billions of dollars is a lot of time and money for a Silicon Valley startup, it’s a pretty normal expenditure in the world of medical trials, most of which fail.\n  What’s more, when it comes to artificial intelligence, IBM is competing with rivals like Amazon and Alphabet—companies that are still growing fast, that see no need to buy back their shares, and that similarly see no need to hype their A.I. achievements before they’re really ready for the spotlight. Watson is great at publicity stunts—no article about it is complete without the requisite mention of the time it won  Jeopardy (even, it seems, this one)—but A.I. is a very tough nut to crack, and one where the top computer scientists are in incredibly high demand. Those scientists aren’t going to the company with the best press, they’re going to the companies with the best A.I., and the best science. Ask anybody in A.I. about Watson, and you’ll be told in no uncertain terms that they’re an also-ran in an incredibly competitive space.\n  The biggest hope for A.I. in oncology, then, is not that Watson is somehow going to get vastly better. Rather, it’s that Alphabet or someone else has been quietly building a game-changing A.I. without  over-hyping it in advance. It’s still possible that A.I. might be able to do amazing things in the world of oncology. Just don’t expect those advances to come from Watson.", "posttime": "2020-11-11 14:41:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "沃森,ibm", "title": "IBM的沃森出了什么问题", "title_en": "What Went Wrong with IBM’s Watson", "transed": 1, "url": "https://slate.com/business/2018/08/ibms-watson-how-the-ai-project-to-improve-cancer-treatment-went-wrong.html", "via": "", "real_tags": ["沃森", "ibm"]}, {"category": "", "categoryclass": "", "imagename": "8f4f0be3d6022f490db10615d0faa0e7.jpeg", "infoid": 1034480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索Enola Holmes是一部2020年的美国悬疑片，改编自南希·斯普林格(Nancy Springer)的同名青少年小说系列的第一本书。故事讲述了已经很出名的夏洛克·福尔摩斯十几岁的妹妹去伦敦寻找失踪的母亲的故事。这部电影由哈里·布拉德比尔执导，杰克·索恩的剧本改编而成。米莉·鲍比·布朗(Millie Bobby Brown)饰演片名角色，同时也是该片的制片人。亨利·卡维尔、萨姆·克拉夫林、阿迪尔·阿赫塔尔、菲奥娜·肖、弗朗西斯·德拉图尔、路易斯·帕特里奇、苏西·沃科马和海伦娜·邦汉姆·卡特将出演配角。\n这部电影原计划由华纳兄弟影业公司在影院上映，但由于新冠肺炎疫情的蔓延，该片的发行权被出售给了网飞公司。埃诺拉·霍姆斯于2020年9月23日获释。这部电影得到了评论家们的普遍好评，他们称赞布朗的表演。\n埃诺拉·霍姆斯是著名的福尔摩斯家族中最小的兄弟姐妹。她非常聪明，观察敏锐，富有洞察力，违反了当时女性的社会规范。她的母亲尤多利亚(Eudoria)教会了她从国际象棋到柔术的一切，并鼓励她成为一个意志坚强、独立思考的年轻女子。\n在她16岁生日的那天，埃诺拉醒来发现她的母亲不见了，只留下了一些生日礼物。她冲到火车站去接她的哥哥麦克罗夫特和夏洛克，他们一开始都认不出她来，因为很多年没见过她了。夏洛克觉得她是个聪明的女孩，而麦克罗夫特则觉得她很麻烦。作为她的法定监护人，麦克罗夫特打算把她送到一所由严厉的哈里森小姐开办的精修学校。她母亲留下的鲜花揭示了秘密信息，导致了隐藏的钱，埃诺拉用这些钱伪装成男孩逃脱。在火车上，她发现年轻的图克斯伯里子爵藏在一个旅行袋里。她认为他是个笨蛋，但警告他，一个戴着棕色圆顶圆顶帽子的男人(名叫林松)正在火车上寻找他。他们跳下火车逃跑。图克斯伯里既没有食物，也在寻找可食用的植物。他们前往伦敦，在那里他们分道扬镳。\n她伪装成维多利亚时代的淑女，继续追踪尤多利亚，并在报纸上的个人广告中留下隐晦的信息。埃诺拉发现了小册子和一个藏有炸药的藏身之处，并得知尤多利亚是一个激进的女权主义者组织的一部分。她被林肯袭击，谁折磨她关于图克斯伯里的信息，试图淹死她。他们打了起来，但她点燃了炸药，逃脱了。埃诺拉决定暂停寻找她的母亲，而是再次找到图克斯伯里来救他，因为他没有能力为自己辩护。埃诺拉参观了位于巴西尔韦瑟大厅的图克斯伯里庄园，以了解更多信息。麦克罗夫特让苏格兰场的莱斯特雷德探长寻找埃诺拉。\n埃诺拉发现图克斯伯里在考文特花园卖花，并警告他有危险。她帮助哈里森逃跑，但被莱斯特拉德抓住，并被麦克罗夫特囚禁在哈里森小姐的精修学校。夏洛克拜访了她，并承认她的侦探工作给他留下了深刻的印象。图克斯伯里偷偷溜进学校，他们一起逃跑，偷走了哈里森小姐的汽车。他们来到了一个岔路口，埃诺拉没有返回伦敦，而是决定他们必须去巴西韦瑟庄园，面对图克斯伯里的叔叔，她推测图克斯伯里的叔叔试图杀死图克斯伯里。庄园看似空荡荡的，但林桑伏击了他们，开了一把猎枪。埃诺拉用柔术绊倒了他，导致头部致命受伤。图克斯伯里的祖母被揭露为真正的恶棍，她是一个传统主义者，她不想让他接替父亲在上议院的位置，投票支持改革法案。她朝孙子的胸部开了一枪，但孙子幸免于难，这要归功于他藏在衣服下面的一盘盔甲。夏洛克来到伦敦警察厅，莱斯特雷德问了他两个问题：第一，他是如何破案的；第二，他姐姐是如何先破案的。\n埃诺拉发现并破译了报纸上的一条信息，但推断这不是她母亲发来的。在会面的地方，夏洛克和麦克罗夫特讨论了埃诺拉，夏洛克建议成为她的监护人。他们决定离开，夏洛克注意到了一条线索，但选择不去找埃诺拉。在此期间，埃诺拉一直伪装成报童在看电视。回到她的住所，埃诺拉发现她的母亲在那里等着。他们拥抱在一起，尤多利亚解释了为什么她必须离开，为什么她必须再次离开，但她对埃诺拉变成的样子印象深刻。伊诺拉找到了她的自由和她的目标--她是一名侦探，也是迷失灵魂的寻求者。\n米莉·鲍比·布朗饰演埃诺拉·福尔摩斯，著名的福尔摩斯家族中最小的兄弟姐妹。她非常聪明，观察敏锐，富有洞察力，挑战了那个时代女性的社会规范。在她母亲的监护下，\n亨利·卡维尔饰演福尔摩斯，福尔摩斯兄弟中排名第二的福尔摩斯。一位著名的私家侦探。\n萨姆·克莱夫林饰演麦克罗夫特·福尔摩斯，福尔摩斯兄弟中年龄最大的。他在政府有一份薪水很高的工作，也是埃诺拉的法定监护人。虽然麦克罗夫特比夏洛克大，但克莱夫林比卡维尔小三岁。[1]。\n海伦娜·邦汉姆·卡特饰演尤多利亚·福尔摩斯，福尔摩斯家族的女族长。古怪、无拘无束、不拘一格的尤多利亚抚养埃诺拉走自己的路。[2]。\n截至2019年2月，传奇影业正在开发改编自南希·斯普林格(Nancy Springer)系列小说《埃诺拉·福尔摩斯之谜》(The Enola Holmes Mysteries)的电影，米莉·鲍比·布朗(Millie Bobby Brown)担任片名角色并主演，哈里·布拉德比尔(Harry Bradmer)将执导。[3]布朗和姐姐佩吉一起读了这本书，她马上就想要扮演埃诺拉这个角色，但她还没有长大到可以扮演这个角色的年龄。后来，她告诉父亲，他们应该把这部电影拍成电影，并与传奇影业(Legendary Pictures)合作，这家公司之前曾与她合作过《哥斯拉：怪兽之王》(Godzilla：King of the Monsters)。布朗和布拉德比尔讨论了这部电影，并希望能量、情感和古怪成为这部电影的关键元素。[4][5]布朗与作家杰克·索恩(Jack Thorne)讨论了她想如何打破第四堵墙。[5][6][6]布拉德比尔对这部剧本非常感兴趣，因为它将他对病态家庭相互妥协故事的兴趣与他对夏洛克·福尔摩斯的热爱结合在了一起。[4]布朗利用这个机会即兴发挥，这是她在《奇怪的事情》中不会做的事情，因为这部剧有大量的剧本，因为埃诺拉·福尔摩斯(Enola Holmes)这个角色允许这样做。事实证明，捕捉到这些时刻并跟上布朗的脚步对吸引焦点的人来说是具有挑战性的。[5]。\n6月，亨利·卡维尔(Henry Cavill)、海伦娜·邦汉姆·卡特(Helena Bonham Carter)、阿迪尔·阿赫塔尔(Adeel Akhtar)和菲奥娜·肖(Fiona Shaw)加入演员阵容，山姆·克拉夫林(Sam Claflin)、路易斯·帕特里奇(Louis Partridge)、苏西·沃科马(Susie Wokoma)和伯恩·戈尔曼(Burn Gorman)。[11][12][13]在伍斯特郡的艾利火车站、基德明斯特镇火车站和塞文河谷铁路上的维多利亚桥拍摄了铁路场景。[14]福尔摩斯家族的住所芬德尔音乐厅是在什罗普郡的本索尔音乐厅拍摄的。[15]Benthall Hall以前没有被用作拍摄地点，制作设计团队得到了首席场地管理员的大力帮助，他们允许这个地方变成杂草丛生的地方，以达到他们需要的外观。[17]室内装饰在萨里郡的西霍斯利广场遭到枪击。假墙被树立起来，并受到工艺美术运动的启发，他们在装饰品和时代壁纸上加入了植物图案。[17]东区和莱姆豪斯巷的位置是在贝德福德郡卢顿胡区的附属建筑中创建的。夏洛克和麦克罗夫特试图见到埃诺拉的场景是在威斯敏斯特的英国财政部大楼内的鼓楼里拍摄的。\n邦汉姆·卡特称她的角色是邀请她出演的最小、最伟大的角色，她的经纪人试图阻止她扮演如此次要的角色。尽管她在银幕上的时间有限，但她很欣赏这个角色的深度。在最后的剪辑中，尤多利亚最终确实比最初的剧本出现得更多。[2]。\n康索拉塔·博伊尔(Consolata Boyle)负责制作这些服装。博伊尔和她的团队为主要演员和背景演员定制设计、染色和制作服装。大约有30套服装是为埃诺拉制作的，而像红色粉扑连衣裙这样的服装不得不重复几次，因为角色的肉体和在打斗场景中可能出现的任何损害。粉扑连衣裙是以那个时期的戏剧服装为基础的，而博伊尔想要使用红色，这是勇气的颜色。博伊尔最喜欢的是埃诺拉的最后一件连衣裙，它与埃诺拉骑自行车时穿的第一件连衣裙的形状一样，使服装绕了一圈，而且最后一件连衣裙中使用的未经处理的天然丝绸没有浓重的颜色，它允许任何事情发生。紫罗兰、绿色和象牙的颜色与女权主义运动联系在一起，所以博伊尔有意识地在服装中使用了这些颜色。[18][18][18][18][18][18][19]紫罗兰、绿色和象牙的颜色与女权运动联系在一起，所以博伊尔有意识地在服装中使用了这些颜色。[20]。\n视觉效果由迈克尔·埃利斯(Michael Ellis)监督，X先生[21]和主持人VFX完成。[22][23]\n柯南·道尔遗产管理公司(Conan Doyle Estate)就这部电影对Netflix提起诉讼，称该片将夏洛克·福尔摩斯(Sherlock Holmes)描绘成有感情的人，侵犯了版权。他们认为，这个角色的这一方面不属于公共领域，因为他只被描述为在1923年至1927年之间出版的故事中有情感，根据美国版权法，在那个时期出版的故事的版权仍然没有到期。[24][25]卡维尔说，他对夏洛克的刻画从一开始就更加情绪化，所以我们削减了它，我们说，好的，让我们不要让它太情绪化。在诉讼中，他说这是我们从剧本中找出的一页中的一个人物。(编者注：原文为《神探夏洛克》，原文为《神探夏洛克》。)。法律方面的事情超出了我的能力范围。2020年10月30日，被告的律师提交了驳回诉讼的动议，称遗产管理公司不公平地试图阻止那些不可否认属于公共领域的人物的合理使用。[26]2020年10月30日，被告的律师提交了驳回申请的动议，称该遗产不公平地试图阻止对不可否认属于公共领域的人物的合理使用。[27][27]。\n2019年7月，丹尼尔·彭伯顿(Daniel Pemberton)被宣布为这部电影的配乐作曲家。[28]该原声带于2020年9月18日发行。[29]彭伯顿将其描述为无耻的旋律和情绪化的管弦乐，还加入了一些凌乱古怪的元素。[29][29]。\nNetflix原本打算由华纳兄弟影业公司在影院上映，但在2020年4月，由于新冠肺炎疫情的蔓延，Netflix获得了该片的发行权。[30]它于2020年9月23日以数字形式发布。[31][31]。\n为了在英国宣传这部电影，Netflix在她们著名兄弟的现有雕像旁边安装了一系列著名姐妹的雕像。[32]他们还与Escape Hunt UK合作推出了一款免费的家庭探险游戏，名为Enola Holmes Adenture。[33][33]。\n在首映周末，埃诺拉·福尔摩斯是Netflix上收视率第二高的节目，仅次于电视剧《Ratch》。[34]在上映的头五天里，它是Netflix上观看人数最多的电影，[35][36]因为这部电影将成为Netflix 2020年首日上映的最大影片，同时也占据了Netflix监控的国家数量最多的国家。[37]2020年10月，Netflix报道称，这部电影上映后的前四周将有7600万家庭观看。[38]去年11月，《综艺》报道称，根据ScreenEngine/ASI的数据，截至目前，这部电影在2020年收视率最高的直播剧标题中排名第13位。[39][font=宋体]。\n在烂番茄上，这部电影在179条评论的基础上获得了91%的好评率，平均评分为7.04/10。该网站的评论家一致认为：埃诺拉·霍姆斯(Enola Holmes)给贝克街带来了一丝新鲜空气--给米莉·鲍比·布朗(Millie Bobby Brown)留下了很大的空间，让她在等待中的系列电影上打上她热情洋溢的印记。[40]在Metacritic上，根据30位评论家的评论，该片的加权平均得分为68分(满分100分)，这表明&。[41][font=宋体]。\n《综艺》杂志的彼得·德布鲁奇称这部电影是一部有趣的系列电影，并赞扬了布朗的表演，称她的表演风格让人想起凯拉·奈特莉给《傲慢与偏见》带来的热情自发性，打破了之前许多简·奥斯汀改编的电影那种拘谨的礼仪。德布鲁热认为这部电影在讲述故事时比《盖伊》更有品味。[42]《好莱坞报道》的约翰·德福尔对这部电影给予了肯定的评价，他写道：《福尔摩斯》成功地想象了女主角在福尔摩斯世界中的一席之地，然后让年轻观众相信，埃诺拉不需要被那个世界的边界所束缚。《华盛顿邮报》的安·霍纳迪写道：埃诺拉·霍姆斯与女主角埃诺拉·霍尔摩斯一起，轻快而充满活力地逃离了现代的繁重。当比赛进行时，她的能力更强，不仅能跟上形势，还能赢得胜利。《帝国》杂志的埃拉·坎普写道：她的用意是好的，但有时缺乏微妙之处，埃诺拉·霍姆斯精辟地提醒人们，传统故事总是可以重述的--尽管下一次可能需要更精致的女权主义教义。《卫报》的彼得·布拉德肖给出了褒贬不一的评价。埃诺拉·福尔摩斯是那种曾经可能由BBC制作的全明星作品，但由于故事中的神秘元素受到了一些批评，应该有更巧妙的演绎和从埃诺拉解密不是一回事中更巧妙地解决这一问题。(译者注：埃诺拉·福尔摩斯是一部全明星制作的电影，但因故事中的神秘元素而受到一些批评，因此应该更巧妙地演绎和解决埃诺拉的密码破译不是一回事。)。\n在一篇负面评论中，《旧金山纪事报》的米克·拉萨勒写道：一个聪明的年轻女演员，一个电影明星演员，一个潜在的有趣的概念，在128分钟的时间里被扼杀了。\n2020年9月，制片人兼主演米莉·鲍比·布朗(Millie Bobby Brown)和导演哈里·布拉德比尔(Harry BradBeer)承认他们打算拍摄续集。[5]布朗只想拍第一部电影，但他很喜欢扮演这个角色，他说能再拍一部是我的梦想。[48][48]。\n弗雷达·库珀(Freda Cooper)(2020年9月23日)。埃诺拉·霍姆斯(Enola Holmes)：萨姆·克拉夫林(Sam Claflin)饰演亨利·卡维尔(Henry Cavill)哥哥，并在爱情岛上教育他(独家)。雅虎!。看电影。超人和十一岁是我的弟弟妹妹，这让我感到有点自卑，所以如果有什么不同的话，那就是增加了这个角色的味道。\n贾斯汀·克罗尔(2019年2月8日)。杀死夏娃导演米莉·鲍比·布朗(Millie Bobby Brown)埃诺拉·霍姆斯(Enola Holmes)(独家报道)。多种多样。\n乔·B·C·D·乌蒂奇(2020年9月22日)。米莉·鲍比·布朗(Millie Bobby Brown)和哈里·布拉德比尔(Harry BradBeer)讲述维多利亚时代打造现代超级女英雄的故事--埃诺拉·霍姆斯(Enola Holmes)。好莱坞的最后期限。从原件存档于2020年9月30日。\n鲍里斯·基特(^Kit，Borys)(2019年6月27日)。亨利·卡维尔(Henry Cavill)和米莉·鲍比·布朗(Millie Bobby Brown)一起出演了传奇人物埃诺拉·霍姆斯(Enola Holmes)。好莱坞记者。\n^N&#39；杜卡，阿曼达(2019年6月28日)。埃诺拉·霍姆斯(Enola Holmes)：“谋杀之谜”演员阿迪尔·阿赫塔尔(Adeel Akhtar)加盟传奇电影公司(Legendary Film)。好莱坞的最后期限。\n鲍里斯·基特(^Kit，Borys)(2019年6月28日)。女演员菲奥娜·肖(Fiona Shaw)与米莉·鲍比·布朗(Millie Bobby Brown)联袂出演埃诺拉·霍姆斯(Enola Holmes)(独家)。好莱坞记者。\n乔什·史密斯(2020年9月29日)。第二天，我将和米莉·鲍比·布朗一起拍戏，和人们一起去学校撒尿：伊诺拉·霍姆斯和路易斯·帕特里奇一夜成名。魅力英国。我参加了大约四五次试镜。\n^N&#39；杜卡，阿曼达(2019年7月1日)。萨姆·克莱夫林(Sam Claflin)担任传奇影业(Legendary)董事会成员埃诺拉·霍姆斯(Enola Holmes)。好莱坞的最后期限。\n^N&#39；杜卡，阿曼达(2019年7月2日)。埃诺拉·霍姆斯(Enola Holmes)：口香糖女演员苏珊·沃科马(Susan Wokoma)出演传奇电影。好莱坞的最后期限。\n埃诺拉·霍姆斯拍摄地点：解谜历险记。找到那个位置。2020年9月24日。\n^简。与埃诺拉·霍姆斯(Enola Holmes)一起解开谜团。国家信托基金。从原件存档于2020年9月25日。\n安妮·戈德史密斯(2020年9月26日)。埃诺拉·霍姆斯(Enola Holmes)的服装设计师重新想象了一个经典之谜。《城镇与乡村》(杂志)。从原件存档于2020年10月2日。\n《Fawnia Soo Hoo》(2020年9月23日)。米莉·鲍比·布朗(Millie Bobby Brown)穿着埃诺拉·霍姆斯(Enola Holmes)的维多利亚时代青少年侦探服装，向20世纪女权运动发声。Fashionista.com。从原件存档于2020年10月2日。\n《海莉·梅特兰》(2020年10月4日)。埃诺拉·霍姆斯(Enola Holmes)的服装里隐藏着每一条裁剪线索。英国版《Vogue》。\n^Netflix电影俱乐部(2020年9月30日)。埃诺拉·霍姆斯列车序列背后的特效特效。Netflix-通过YouTube。\n文森特·弗雷(文森特·弗雷，2020年10月1日)。埃诺拉·福尔摩斯：火车镜头中的视觉特效(The VFX of the Train Sequence&#34；Enola Holmes)。VFX的艺术。\n加德纳，埃里克(2020年6月24日)。柯南·道尔遗产公司起诉Netflix关于夏洛克·福尔摩斯的即将上映的电影，因为她是夏洛克·福尔摩斯的妹妹。好莱坞记者。\n阿尔瓦马赫达维(2020年10月7日)。夏洛克·福尔摩斯不断演变的情感的奇特案例。卫报。\n丹尼尔·彭伯顿(Daniel Pemberton)为哈里·布拉德比尔(Harry BradBeer)配乐埃诺拉·霍姆斯(Enola Holmes)。电影音乐记者。2019年7月23日。\n《基特，鲍里斯》(2020年4月21日)。Netflix选中了米莉·鲍比·布朗(Millie Bobby Brown)，埃诺拉·霍姆斯(Enola Holmes)。好莱坞记者。\n亚当·奇特伍德(2020年8月17日)。网飞公司艾诺拉·福尔摩斯在预告片中饰演夏洛克的妹妹米莉·鲍比·布朗(Millie Bobby Brown)的扮演者米莉·鲍比·布朗(Millie Bobby Brown)饰演夏洛克的妹妹。对撞机。\n斯科特·门德尔森(2020年9月24日)。埃诺拉·霍姆斯首次登上Netflix最受关注榜单第二名。福布斯。从原件存档于2020年9月25日。\n汤姆·布鲁格曼(2020年10月5日)。AVA成为最受欢迎的视频点播选择，仅《颤栗》一家仍然很受欢迎。Indiewire。\n《TomášVyskočil》(2020年10月9日)。根据Netflix排行榜，2020年Netflix最畅销的电影。Netflix上有什么？\n^Low，Elaine(2020年10月20日)。Netflix称，《老卫士》(The Old Guard)在前四周就有7800万家庭观看。多种多样。\n加文·布里奇(2020年11月4日)。数据：在2020年收视率最高的美国SVOD电影中，波拉特仅次于汉密尔顿。多种多样。\n《艾拉·坎普》(2020年9月7日)。埃诺拉·霍姆斯(Enola Holmes)。帝国。从原件存档于2020年10月9日。\n彼得·布拉德肖(2020年9月22日)。埃诺拉·福尔摩斯点评--夏洛克叛逆的小妹妹正在调查此案。卫报。从原件存档于2020年9月22日。\n《玛丽·索洛西》(2020年9月24日)。会有埃诺拉·霍姆斯(Enola Holmes)的续集吗？米莉·鲍比·布朗(Millie Bobby Brown)也参与其中。娱乐周刊。哦，是的，我只拍一部电影", "note_en": "Jump to navigation  Jump to search  Enola Holmes is a 2020 American  mystery film based on the  first book in the  young adult fiction series of the same name by  Nancy Springer. The story is about the teenage sister of the already-famous  Sherlock Holmes, who goes to London in search of her mother who has disappeared. The film is directed by  Harry Bradbeer, from a screenplay by  Jack Thorne.  Millie Bobby Brown stars as the title character, while also serving as a producer on the film.  Henry Cavill,  Sam Claflin,  Adeel Akhtar,  Fiona Shaw,  Frances de la Tour,  Louis Partridge,  Susie Wokoma and  Helena Bonham Carter appear in supporting roles.\n Originally planned for a theatrical release by  Warner Bros. Pictures, the distribution rights to the film were sold to  Netflix due to the  COVID-19 pandemic.  Enola Holmes was released on September 23, 2020. The film received generally positive reviews from critics, who praised Brown&#39;s performance.\n   Enola Holmes is the youngest sibling in the famous Holmes family. She is extremely intelligent, observant, and insightful, and defies the social norms for women of  the time. Her mother, Eudoria, has taught her everything from  chess to  jujitsu and encouraged her to be a strong-willed and independent thinking young woman.\n On the day of her sixteenth birthday, Enola awakens to find that her mother has disappeared, leaving behind only some birthday gifts. She rushes to the train station to meet her brothers, Mycroft and Sherlock, who fail to recognize her at first, not having seen her in many years. Sherlock finds her to be an intelligent girl, whereas Mycroft finds her troublesome. As her  legal guardian, Mycroft intends to send her away to a  finishing school run by the stern Miss Harrison. The flowers left by her mother  reveal secret messages and lead to hidden money, which Enola uses to escape disguised as a boy. On the train, she finds the young Viscount Tewkesbury hidden in a travel bag. She thinks he is a nincompoop but warns him that a man in a brown bowler hat (named Linthorn) is on the train searching for him. They jump off the train to escape. Neither having any food, Tewkesbury  forages for edible plants. They travel to London, where they part ways.\n Disguised as a proper Victorian lady, she continues to trace Eudoria and leaves cryptic messages in the newspaper  personal advertisements. Enola discovers pamphlets and a safehouse containing explosives and learns that Eudoria is part of a radical group of  suffragettes. She is attacked by Linthorn, who tortures her for information about Tewkesbury, attempting to drown her. They fight, but she is able to ignite the explosives and escape. Enola decides to pause the search for her mother and instead find Tewkesbury again to save him because he is not capable of defending himself. Enola visits the Tewkesbury estate at Basilwether Hall to learn more. Mycroft has  Inspector Lestrade of Scotland Yard search for Enola.\n Enola finds Tewkesbury selling flowers in  Covent Garden and warns him of the danger. She helps him escape but is caught by Lestrade and imprisoned in Miss Harrison&#39;s finishing school by Mycroft. Sherlock visits her and admits he is impressed by her detective work. Tewkesbury sneaks into the school, and they escape together, stealing Miss Harrison&#39;s motor car. They reach a fork in the road and, rather than returning to London, Enola decides they must go to Basilwether Hall and face Tewkesbury&#39;s uncle, who she has deduced was trying to kill him. The estate is seemingly deserted, but Linthorn ambushes them, firing a shotgun. Enola trips him using a jujitsu move, causing a fatal head injury. Tewkesbury&#39;s grandmother is revealed as the real villain; a traditionalist, she did not want him to take his father&#39;s place in the House of Lords and vote for the  Reform Bill. She shoots her grandson in the chest, but he survives thanks to a plate of armor he had hidden under his clothes. Sherlock arrives at Scotland Yard and Lestrade asks him two questions: first, how he managed to solve the case, and second, how his sister solved it first.\n Enola finds and deciphers a message in a newspaper but deduces that it was not sent by her mother. At the meeting point, Sherlock and Mycroft discuss Enola, and Sherlock suggests becoming her guardian. They decide to leave, and Sherlock notices a clue, but chooses not to look for Enola. All the while Enola has been watching disguised as a newsboy. Returning to her lodgings, Enola finds her mother waiting there. They embrace, and Eudoria explains why she had to leave, and why she must leave again, but she is impressed by what Enola has become. Enola has found her freedom and her purpose—she is a detective and a finder of lost souls.\n  Millie Bobby Brown as Enola Holmes, the youngest sibling in the famous Holmes family. Extremely intelligent, observant and insightful, she defies the social norms for women of the era. Under her mother&#39;s tutelage, she has learned everything from chess to jujitsu, and is extensively well read.\n Henry Cavill as  Sherlock Holmes, the second-oldest of the Holmes siblings. A renowned private detective.\n Sam Claflin as  Mycroft Holmes, the oldest of the Holmes siblings. He has a well-paid government job and is Enola&#39;s legal guardian. Although Mycroft is older than Sherlock, Claflin is three years younger than Cavill.  [1]\n Helena Bonham Carter as Eudoria Holmes, the matriarch of the Holmes family. Eccentric, free-spirited and unconventional, Eudoria raises Enola to pursue her own path.  [2]\n   By February 2019, a film adaptation of the  Nancy Springer book series   The Enola Holmes Mysteries was in development at  Legendary Pictures, with  Millie Bobby Brown producing and starring in the title role and  Harry Bradbeer set to direct.  [3] Brown had read the books with her older sister Paige and immediately wanted to play the role of Enola, but wasn&#39;t yet old enough to play the character. She later told her father they should make it into a film and partnered with Legendary Pictures, the same company she had previously worked with on   Godzilla: King of the Monsters. Brown and Bradbeer discussed the film and wanted energy, emotion and eccentricity as key elements of the film.  [4]  [5] Brown discussed with writer Jack Thorne how she wanted to  break the fourth wall.  [5]  [6] Bradbeer was enthusiastic about the script as it combined his interest in stories about &#34;dysfunctional families coming to terms with each other&#34; with his love of Sherlock Holmes.  [4] Brown took the opportunity to improvise, something she would not do on   Stranger Things, which is heavily scripted and because the character of Enola Holmes allowed for it. Capturing those moments and keeping up with Brown proved challenging for the  focus puller.  [5]\n In June,  Henry Cavill,  Helena Bonham Carter,  Adeel Akhtar and  Fiona Shaw joined the cast,  [7]  [8]  [9] with  Sam Claflin, Louis Partridge,  [10]  Susie Wokoma and  Burn Gorman joining in July as filming began in London.  [11]  [12]  [13] Railway scenes were filmed in  Worcestershire at  Arley railway station,  Kidderminster Town railway station and  Victoria Bridge on the  Severn Valley Railway.  [14]The Holmes family residence Ferndell Hall was filmed at  Benthall Hall in  Shropshire.  [15]  Benthall Hall had not previously been used as a filming location, and the  production design team received great help from the head groundskeeper who allowed the place to become overgrown to achieve the look they needed.   [17] Interiors were shot at  West Horsley Place in Surrey. False walls were put up and inspired by the  Arts and Crafts movement they included plant motifs in the decorations and period wallpaper.  [17] The East End and Limehouse Lane locations were created in the among outbuildings at  Luton Hoo in  Bedfordshire.  The scene where Sherlock and Mycroft try to meet Enola, was filmed at Drum Court within  HM Treasury Buildings in Westminster.\n Bonham Carter called her role the &#34;smallest, greatest part I&#39;ve been offered&#34; and her agent tried to discourage her from taking on such a minor part. She was appreciative of the depth of the character despite her limited screen time. In the final cut, Eudoria did ultimately appear more than in the initial script.  [2]\n Consolata Boyle was responsible for creating the costumes. Boyle and her team custom-designed, dyed and made the costumes for the main cast and background actors. Approximately thirty costumes were created for Enola, and costumes such as the red powderpuff dress had to be repeated several more times because of the physicality of the role and any damage that might occur during fight scenes. The powderpuff dress was based on theatrical costumes of the period, and Boyle wanted to use red, the color of courage. Boyle&#39;s favorite was Enola&#39;s final dress, it used the same shape as the first dress Enola wore while riding the bicycle bringing the costumes back full circle, but also the natural untreated silk used in the final dress has no strong color and &#34;it allows for anything to happen next.&#34;  [18]  [19] The colors violet, green and ivory were associated with the suffragette movement so Boyle consciously made use of those colors in the costumes.  [20]\n Visual effects were supervised by Michael Ellis and done by Mr. X  [21] and Host VFX.  [22]  [23]\n  The Conan Doyle Estate filed a lawsuit against Netflix over the film, claiming it violates copyright by depicting Sherlock Holmes as having emotions. They argue this aspect of the character does not fall under the public domain as he was only described as having emotions in stories published between 1923 and 1927, and the copyright for the stories published in that period still have not expired under copyright law in the United States.  [24]  [25]Cavill said that his portrayal of Sherlock &#34;a lot more emotional to begin with, so we pared it back, and we said, &#39;alright, let&#39;s not make it too emotional&#39;.&#34; On the lawsuit he said &#34;It&#39;s a character from a page which we worked out from the screenplay. The legal stuff is above my pay grade.&#34;  [26]On October 30, 2020, lawyers for the defendants filed a motion to dismiss, saying the estate was unfairly attempting to prevent the fair use of characters that are &#34;undeniably in the public domain&#34;.  [27]\n  In July 2019,  Daniel Pemberton was announced as composer of the film&#39;s score.  [28] The soundtrack was released on September 18, 2020.  [29] Pemberton described it as &#34;unashamedly melodic and emotional orchestral music&#34; with some &#34;messy quirky oddness thrown in as well&#34;.  [29]\n  Originally intended to be a theatrical release by  Warner Bros. Pictures, in April 2020,  Netflix acquired distribution rights to the film due to the  COVID-19 pandemic.  [30] It was digitally released on September 23, 2020.  [31]\n To promote the film in the United Kingdom, Netflix installed a series of statues of famous sisters next to existing statues of their famous brothers.  [32] They also released a free play at home adventure game in collaboration with Escape Hunt UK called  An Enola Holmes Adventure.  [33]\n   In its debut weekend  Enola Holmes was the second most-watched item on Netflix, behind the TV series   Ratched.  [34] Over its first five days it was the most watched film on Netflix,  [35]  [36] as the film would go on to become the biggest first day opening Netflix title in 2020 as well as dominating the largest number of Netflix&#39;s monitored countries.  [37] In October 2020, Netflix reported the film was on-track to have 76 million households watch the film over its first four weeks of release.  [38] In November,   Variety reported that according to data by ScreenEngine/ASI the film was the 13th-most watched straight-to-streaming title of 2020 up to that date.  [39]\n  On  Rotten Tomatoes, the film has an approval rating of 91% based on 179 reviews, with an average rating of 7.04/10. The website&#39;s critics consensus reads: &#34; Enola Holmes brings a breath of fresh air to Baker Street – and leaves plenty of room for Millie Bobby Brown to put her effervescent stamp on a franchise in waiting.&#34;  [40] On  Metacritic, it has a weighted average score of 68 out of 100, based on reviews from 30 critics, indicating &#34;generally favorable reviews&#34;.  [41]\n Peter Debruge of   Variety called the film an &#34;entertaining franchise starter&#34; and praised Brown&#39;s performance, stating that &#34;[her] acting style recalls the effusive spontaneity  Keira Knightley brought to   Pride and Prejudice, shattering the straitlaced propriety of so many  Jane Austen adaptations before it.&#34; Debruge found the film &#34;more tasteful in its high-energy storytelling than  Guy Ritchie&#39;s recent   Sherlock Holmes movies, and considerably more fun than [2019]&#39;s   Nancy Drew reboot.&#34;  [42] John DeFore of   The Hollywood Reporter gave the film a positive review and wrote: &#34;It successfully imagines a place for its heroine in Holmes&#39; world, then convinces young viewers that Enola needn&#39;t be constrained by that world&#39;s borders.&#34;  [43] Ann Hornaday of   The Washington Post wrote: &#34; Enola Holmes offers brisk and exuberant escape from the heaviness of modern times, with its leading actress lending her own appealing touches to the journey. When the game is afoot, she&#39;s more than capable, not just of keeping up, but winning the day.&#34;  [44] Ella Kemp of   Empire magazine wrote: &#34;Well-intentioned if sometimes lacking in subtlety,  Enola Holmes offers a fine, spirited reminder that a traditional story can always be retold – although it might need more refined teachings on feminism next time.&#34;  [45] Peter Bradshaw of   The Guardian gave a mixed review, saying: &#34;It all rattles along amiably enough.  Enola Holmes is the kind of all-star production that might once have been made by the BBC&#34; but had some criticism for the mystery elements of the story &#34;there should have been more specifically ingenious deducting and solving from Enola – codebreaking isn&#39;t the same thing.&#34;  [46]\n In a negative review,  Mick LaSalle of the   San Francisco Chronicle wrote: &#34;A bright young actress, a movie-star actor and a potentially interesting concept gets smothered in 128 minutes of colorful, empty nonsense.&#34;  [47]\n  In September 2020, producer and star Millie Bobby Brown and director Harry Bradbeer acknowledged their intentions to develop a sequel.  [5] Brown thought only about making the first film but loved playing the character and said it would be a dream to do it again.  [48]\n  ^   Freda Cooper (September 23, 2020).  &#34; &#39;Enola Holmes&#39;: Sam Claflin on playing Henry Cavill&#39;s &#39;older&#39; brother and schooling him on &#39;Love island&#39; (exclusive)&#34;.   Yahoo! Movies.  Having Superman and Eleven as my younger siblings made me feel slightly inferior, so that added to the flavour of the character, if anything.\n  ^   Kroll, Justin (February 8, 2019).  &#34; &#39;Killing Eve&#39; Director to Helm Millie Bobby Brown&#39;s &#39;Enola Holmes&#39; (EXCLUSIVE)&#34;.   Variety .\n  ^     a     b     c     d   Utichi, Joe (September 22, 2020).  &#34;Millie Bobby Brown &amp; Harry Bradbeer On Crafting A Modern Superheroine In The Victorian-Era &#39;Enola Holmes&#39; – Q&amp;A&#34;.   Deadline Hollywood.  Archived from the original on September 30, 2020 .\n  ^   Kit, Borys (June 27, 2019).  &#34;Henry Cavill Joins Millie Bobby Brown in Legendary&#39;s &#39;Enola Holmes &#39;&#34;.   The Hollywood Reporter .\n ^   N&#39;Duka, Amanda (June 28, 2019).  &#34; &#39;Enola Holmes&#39;: &#39;Murder Mystery&#39; Actor Adeel Akhtar Joins Legendary Film&#34;.  Deadline Hollywood .\n ^   Kit, Borys (June 28, 2019).  &#34; &#39;Killing Eve&#39; Actress Fiona Shaw Joins Millie Bobby Brown in &#39;Enola Holmes&#39; (Exclusive)&#34;.  The Hollywood Reporter .\n ^   Smith, Josh (September 29, 2020).  &#34; &#39;I&#39;d be filming with Millie Bobby Brown &amp; go to school the next day with people taking the piss&#39;: Enola Holmes&#39; Louis Partridge on overnight fame&#34;.  Glamour UK.  I did about four or five auditions.\n ^   N&#39;Duka, Amanda (July 1, 2019).  &#34;Sam Claflin Boards &#39;Enola Holmes&#39; Film At Legendary&#34;.  Deadline Hollywood.\n ^   N&#39;Duka, Amanda (July 2, 2019).  &#34; &#39;Enola Holmes&#39;: &#39;Chewing Gum&#39; Actress Susan Wokoma Cast In Legendary Movie&#34;.  Deadline Hollywood .\n  ^    &#34;Enola Holmes Filming Locations: Adventures in Mystery Solving&#34;.  Find That Location. September 24, 2020.\n ^   Jane.  &#34;Solving mysteries with Enola Holmes&#34;.  National Trust.  Archived from the original on September 25, 2020.\n   ^   Goldsmith, Annie (September 26, 2020).  &#34; &#39;Enola Holmes&#39;s Costume Designer Reimagines a Classic Mystery&#34;.   Town &amp; Country (magazine). Archived from  the original on October 2, 2020.\n ^   Fawnia Soo Hoo (September 23, 2020).  &#34;Millie Bobby Brown&#39;s Victorian Teen Detective Costumes in &#39;Enola Holmes&#39; Speak to the 20th Century Women&#39;s Rights Movement&#34;.  Fashionista.com. Archived from  the original on October 2, 2020 .\n ^   Hayley Maitland (October 4, 2020).  &#34;Every Sartorial Clue Hidden In The &#39;Enola Holmes&#39; Costumes&#34;.  British Vogue.\n  ^   Netflix Film Club (September 30, 2020).   The VFX Behind The Enola Holmes Train Sequence   Behind The FX.  Netflix  – via  YouTube.\n ^   Vincent Frei (October 1, 2020).  &#34;ENOLA HOLMES: The VFX of the Train Sequence&#34;.  The Art of VFX.\n ^   Gardner, Eriq (June 24, 2020).  &#34;Conan Doyle Estate Sues Netflix Over Coming Movie About Sherlock Holmes&#39; Sister&#34;.  The Hollywood Reporter .\n ^   Mahdawi, Arwa (October 7, 2020).  &#34;The curious case of Sherlock Holmes&#39; evolving emotions&#34;.  The Guardian.\n   ^    &#34;Daniel Pemberton to Score Harry Bradbeer&#39;s &#39;Enola Holmes &#39;&#34;.  Film Music Reporter. July 23, 2019 .\n  ^   Kit, Borys (April 21, 2020).  &#34;Netflix Picks Up Millie Bobby Brown&#39;s &#39;Enola Holmes&#34;.  The Hollywood Reporter .\n ^   Chitwood, Adam (August 17, 2020).  &#34;Netflix&#39;s &#39;Enola Holmes&#39; Teaser Trailer Reveals Millie Bobby Brown as Sherlock&#39;s Sister&#34;.  Collider .\n   ^    Mendelson, Scott (September 24, 2020).  &#34; &#39;Enola Holmes&#39; Debuts At No. 2 On Netflix Most-Watched List&#34;.   Forbes.  Archived from the original on September 25, 2020.\n  ^   Brueggemann, Tom (October 5, 2020).  &#34; &#39;Ava&#39; Takes Over as the Top VOD Choice, with Thriller &#39;Alone&#39; Still Strong&#34;.   IndieWire .\n ^   Tomáš Vyskočil (October 9, 2020).  &#34;Biggest Netflix Titles in 2020 According to the Netflix Top 10s&#34;.  What&#39;s on Netflix.\n ^   Low, Elaine (October 20, 2020).  &#34; &#39;The Old Guard&#39; Viewed By 78 Million Households in First Four Weeks, Says Netflix&#34;.  Variety .\n ^   Bridge, Gavin (November 4, 2020).  &#34;DATA: &#39;BORAT 2&#39; SECOND ONLY TO &#39;HAMILTON&#39; IN MOST-WATCHED U.S. SVOD MOVIES OF 2020&#34;.  Variety .\n      ^   Ella Kemp (September 7, 2020).  &#34;Enola Holmes&#34;.   Empire.  Archived from the original on October 9, 2020.\n ^    Bradshaw, Peter (September 22, 2020).  &#34;Enola Holmes review – Sherlock&#39;s rebellious kid sister is on the case&#34;.   The Guardian.  Archived from the original on September 22, 2020.\n  ^   Mary Sollosi (September 24, 2020).  &#34;Will there be an &#39;Enola Holmes&#39; sequel? Millie Bobby Brown weighs in&#34;.   Entertainment Weekly.  Oh, yeah, I&#39;ll just do one movie", "posttime": "2020-11-11 13:59:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "夏洛克,sherlock,电影", "title": "“情绪化”的夏洛克·福尔摩斯不在公共领域：柯南·道尔遗产诉讼", "title_en": "“Emotional” Sherlock Holmes Not in Public Domain: Conan Doyle Estate in Lawsuit", "transed": 1, "url": "https://en.wikipedia.org/wiki/Enola_Holmes_(film)#Lawsuit", "via": "", "real_tags": ["夏洛克", "sherlock", "电影"]}, {"category": "", "categoryclass": "", "imagename": "82e413a515deb1e5a04014da46eaf50c.jpeg", "infoid": 1034478, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify，但对于学院，我相信学院和大学将授权教授的内容，并开发一种基于在线和面对面课程的联合收入分享选项，用于绝大多数主题。例如，设想一所大学授权教授和会计师事务所开发审计等科目的会计内容。学校将不再有日程表，取而代之的是源源不断的课程和选项-就像Spotify的课程播放列表-在那里你可以挑选学习什么以及学习的速度。--彼得·谢弗(Peter Shafer)，56岁，巴尔的摩华盛顿学院(Washington College)营销顾问兼志愿者。\n..。", "note_en": "Spotify, but for School  I believe colleges and universities will license content from professors and develop a joint revenue-sharing option based on online and in-person classes for a large majority of topics. For example, imagine a college licensing accounting content that is developed by professors and accounting firms on subjects like auditing. There will be no more calendars for schools and instead a constant flow of classes and options—like a Spotify playlist for classes—where you pick and choose what to learn and how quickly to learn. —Peter Shafer, 56, marketing consultant and volunteer at Washington College, Baltimore\n...", "posttime": "2020-11-11 13:38:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,college,学院", "title": "大学在未来十年可能发展的九种方式", "title_en": "Nine Ways College Could Evolve in the Next Decade", "transed": 1, "url": "https://www.wsj.com/articles/nine-ways-college-could-evolve-in-the-next-decade-11605024104", "via": "", "real_tags": ["大学", "college", "学院"]}, {"category": "", "categoryclass": "", "imagename": "f7182b0f640400a44f68ea9e185babcd.jpeg", "infoid": 1034477, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可穿戴设备初创公司Kinetic今天获得了1125万美元的融资(825万美元的股权和300万美元的债务)，该公司表示，这笔资金将帮助其壮大和扩大其工程、销售和营销团队，并支持研发。\n总部位于纽约的Kinetic旨在衡量和改善工业和仓库工作场所的安全。根据美国劳工统计局(BLS)的数据，2018年共有5250名美国工人死于工伤，比2017年的5147人增加了2%。更多的人遭受严重甚至改变生活的伤害。正如劳工统计局指出的那样，许多不同职业的工人可能会暴露在风险因素中，比如举起重物、弯曲、到达头顶、推拉重物、以笨拙的身体姿势工作，以及重复执行相同或类似的任务。\nKinetic联合创始人兼首席执行官海瑟姆·埃尔哈里表示，他在很小的时候就开始了解工伤的影响。在伦敦的童年时期，他的母亲是一名老年护理护士，这份工作让她的背部严重紧张。2014年，ElHawary与联合创始人Aditya Bansal合作，开始开发一款可以减少工伤的可穿戴设备。在数十个原型之后，该团队在2016年敲定了他们的第一个产品-Reflex。\nDynamic的Reflex支持蓝牙，由电池供电，完全充电的Reflex通过弹簧加载的固定夹固定在裤子腰带上，内置了检测伤害活动的传感器。算法对弯曲、过度伸展和扭曲等动作进行分类，并自行校准每个会话以触发警报，使员工能够在存储在设备上的信息和雇主设定的步骤或目标之间切换。(Refllex会生成佩戴者身体的地图，通过测量角度、身高变化和臀部运动等信息来评估背部的扭曲情况。)。员工可以获得每天和每周的活动明细，以及更多的洞察力和实现基准的进展。雇主会根据工作类型或个人、高风险姿势的类型，以及试图阐明每一次伤害的根本原因的预测性分析来查看衡量标准。\nKinetic的一位发言人告诉VentureBeat：“我们对不同身高、体重和性别的工人进行了大量的[算法]训练，并开发了能够从传感器数据中实时提取身体运动的算法。”“在臀部使用单个传感器数据点很重要，因为主要的挑战是开发一种即使在从事高强度体力劳动的情况下，工人也能舒适地佩戴的分立设备。”这条腰带看起来是戴上这件衣服的绝佳地点。“。\n在大流行期间，Kinetic推出了一项新计划，使Reflex设备能够鼓励员工之间的社交距离。每当员工之间距离太近时，这些设备就会轻微震动，实时联系人仪表盘允许通过联系人跟踪进行日常主动监控。经理们可以看到员工在给定的时间范围内暴露了多少次，这些暴露具体涉及到谁，每次暴露的持续时间，以及发生这些暴露的员工群体。\nKinetic声称，在世界各地的数百家工厂里，数以万计的工人佩戴了Reflex设备。客户包括零售、物流和制造业的公司，其中包括财富50强中的6家。ElHawary拒绝透露该公司的年度经常性收入，但他通过电子邮件告诉VentureBeat，今年迄今的收入增长了四倍。\nCrosslink Capital、Primary Ventures和Nationwide的风险投资部门与新投资者Prologis Ventures和Ubiquity Ventures一起参与了Kinetic的首轮融资。在这轮融资之前，2018年10月进行了450万美元的种子轮融资。", "note_en": "Wearable device startup  Kinetic today nabbed $11.25 million in funding ($8.25 million in equity and $3 million in debt) that the company says will help it grow and scale its engineering, sales, and marketing teams and support R&amp;D.\n New York-based Kinetic aims to measure and improve industrial and warehouse workplace safety. A total of 5,250 U.S. workers died from work-related injuries in 2018, up 2% from the 2017 total of 5,147,  according to the U.S. Bureau of Labor Statistics (BLS). And many more sustain serious or even life-altering injuries. As the BLS notes, workers in many different occupations can be exposed to risk factors like lifting heavy items, bending, reaching overhead, pushing and pulling heavy loads, working in awkward body postures, and performing the same or similar tasks repetitively.\n  Kinetic cofounder and CEO Haytham Elhawary says that he came to understand the impact of workplace injuries at an early age. During his childhood in London, his mother worked as an elderly care nurse, a job that severely strained her back. In 2014, Elhawary partnered with cofounder Aditya Bansal to begin development of a wearable device that could reduce industrial workplace injuries. Dozens of prototypes later, the team finalized their first product — Reflex — in 2016.\n Kinetic’s Bluetooth-enabled, battery-powered, and fully rechargeable Reflex, which fastens to pant waistbands with a spring-loaded retention clip, is packed with sensors that detect injury-causing activities.  Algorithms classify motions like bending, overreaching, and twisting and self-calibrate each session to trigger alerts, enabling workers to toggle between information stored on the device and steps or goals set by employers. (Reflex creates a map of the wearer’s body that measures things like angles, changes in height, and hip movement to estimate how their back is contorting.) Employees get daily and weekly breakdowns of activity, as well as additional insights and progress toward benchmarks. Employers see metrics by job type or individual, type of high-risk posture, and predictive analytics that attempt to shed light on the root cause of each injury.\n “[Algorithmic] training was done on a large dataset of workers of differing heights, weights and gender and algorithms were developed that could extract body motion in real-time from the sensor data,” a Kinetic spokesperson told VentureBeat. “Using a single sensor data point on the hip was important because the main challenge is to develop a discrete device workers are comfortable wearing even as they do intense physical labor. The belt seemed like a perfect location to put this on.”\n  During the pandemic, Kinetic has introduced a new program that enables Reflex devices to encourage social distancing between workers. The devices vibrate lightly whenever employees get too close to each other, and a real-time dashboard of contacts allows for daily active monitoring with contact tracing. Managers can see how many exposures an employee has had during a given time frame, exactly who those exposures involved, the duration of each exposure, and the segment of the workforce where they occurred.\n Kinetic claims tens of thousands of workers have worn Reflex devices in hundreds of facilities around the world. Customers range from companies in retail, logistics, and manufacturing industries, including six of the Fortune 50. Elhawary declined to disclose the company’s annual recurring revenue, but he told VentureBeat via email that year-to-date revenue has increased by four times.\n  Crosslink Capital, Primary Ventures, and Nationwide’s venture capital arm participated in Kinetic’s series A, alongside new investors Prologis Ventures and Ubiquity Ventures. The round follows a $4.5 million seed round in October 2018.", "posttime": "2020-11-11 13:00:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可穿戴,软件,提供,wearable,kinetic", "title": "Kinetic提供可穿戴技术和软件分析，以帮助减少工业和仓库工作场所的伤害，该公司已在首轮融资1125万美元", "title_en": "Kinetic, which provides wearable tech and software analytics to help reduce industrial and warehouse workplace injuries, has raised $11.25M Series A", "transed": 1, "url": "https://venturebeat.com/2020/11/10/kinetic-raises-11-25-million-for-wearables-that-aim-to-prevent-workplace-injuries/", "via": "", "real_tags": ["可穿戴", "软件", "提供", "wearable", "kinetic"]}, {"category": "", "categoryclass": "", "imagename": "dd39fc51b6410f65e43c01805d0ad8f2.png", "infoid": 1034476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哈佛大学课程备注(2015-2019年)。通过在GitHub上创建帐户，为Dongryul-Kim/Harvard_Notes的发展做出贡献。", "note_en": "Notes for courses taken at Harvard (2015--2019). Contribute to Dongryul-Kim/harvard_notes development by creating an account on GitHub.", "posttime": "2020-11-11 12:54:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "级别,level,课程", "title": "研究生级别的数学笔记(哈佛)", "title_en": "Graduate Level Math Notes (Harvard)", "transed": 1, "url": "https://github.com/Dongryul-Kim/harvard_notes", "via": "", "real_tags": ["级别", "level", "课程"]}, {"category": "", "categoryclass": "", "imagename": "6ca139b8326038afdf03a37b11e6b34f.jpg", "infoid": 1034475, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一份新的报告，在家工作应该征税，以帮助支持工作受到威胁的工人。\n德意志银行(Deutsche Bank)的经济学家建议，如果员工选择在家工作，应缴纳工资的5%的税。\n税收将由雇主支付，产生的收入将支付给不能在家工作的人。\n该行表示，如果引入美国，这将带来480亿美元(合360亿英镑)的收入，并将有助于纠正这一平衡。\n它辩称，这才是公平的，因为那些在家工作的人正在省钱，而不是像那些外出工作的人那样向系统支付费用。\n在英国，德意志银行(Deutsche Bank)估计，这项税收每年将产生69亿GB的收入，这可以向低收入工人和那些面临裁员威胁的人支付2000 GB的补助金。\n德意志银行(Deutsche Bank)策略师卢克·坦普尔曼(Luke Templeman)写道，多年来，我们一直需要对远程员工征税。Covid刚刚让这一点变得显而易见。\n简单地说，我们的经济体系并不是为了应对那些可能与面对面的社会脱节的人而建立的。\n德意志银行研究公司(Deutsche Bank Research)预测，如今美国员工每年将有46亿天呆在家里，而不是在办公室。\n在美国，对平均年薪5.5万美元的在家工作征收5%的税，相当于每天大约10美元。在英国，以3.5万英镑的工资计算，税收大约相当于7英镑。\n那些能够获得WFH的人可以获得直接和间接的经济利益，他们应该纳税，以便为那些突然流离失所的人顺利过渡过程。\n数以百万计的人转向在家工作，因为雇主关闭了办公室，以遏制新冠肺炎的传播。\n许多大雇主表示，疫情结束后，他们将允许一些员工永久在家工作，无论是全职还是兼职。\n然而，德意志银行(Deutsche Bank)辩称，还有数百万人不能在家工作，比如护士和工厂工人，税收应该有助于支持这些角色。\n邓普曼补充称，埃博拉病毒让银行分析师等那些几乎能胜任本职工作的人受益，并威胁到那些能胜任工作的人的生计或健康。\n他还认为，远程工作者在享受福利的同时，对经济基础设施的贡献也在减少。\n通过在家工作，人们不用支付公共交通费用，也不用在工作地点附近的餐馆就餐，而昂贵的办公室几乎是空置的。\n他说，WFH为旅行、午餐、衣服和清洁等费用提供了直接的经济节省。\n5%的税率不会让他们比选择进入办公室的情况更糟。\n德意志银行(Deutsche Bank)的研究显示，一旦疫情结束，三分之一的人希望每周在家工作两天。\n这项税收将由选择让员工在家工作的雇主直接缴纳。\n当人们因突发公共卫生事件或其他医疗原因被要求呆在家里时，这项规定也不适用。\n税收收入将用于一个非常具体的目的--向数百万不能在家工作、年收入低于3万美元的工人发放补贴。\n德意志银行(Deutsche Bank)表示，他们的研究旨在引发围绕一系列重要话题的辩论。", "note_en": "Working from home should be taxed to help support workers who jobs are under threat, according to a new report.\n Economists at Deutsche Bank suggest a tax of 5% of a worker&#39;s salary if they choose to work from home.\n The tax would be paid for by employers and the income generated would be paid to people who can&#39;t do their jobs from home.\n This could earn $48bn (£36bn) if introduced in the US and would help redress the balance, the bank says.\n It argues this is only fair, as those who work from home are saving money and not paying into the system like those who go out to work.\n In the UK, Deutsche Bank calculates the tax would generate a pot of £6.9bn a year, which could pay out grants of £2,000 a year to low-income workers and those under threat of redundancy\n &#34;For years we have needed a tax on remote workers,&#34; wrote Deutsche Bank strategist Luke Templeman. &#34;Covid has just made it obvious.&#34;\n &#34;Quite simply, our economic system is not set up to cope with people who can disconnect themselves from face-to-face society.\n  Deutsche Bank Research predicts that workers in the US will now spend 4.6bn days a year at home rather than in the office.\n A 5% work-from-home (WFH) tax on an average $55,000 salary works out at about $10 a day in the US. For the UK, the tax equates to about £7, based on a salary of £35,000.\n &#34;Those who can WFH receive direct and indirect financial benefits and they should be taxed in order to smooth the transition process for those who have been suddenly displaced.&#34;\n Millions of people have shifted to working from home as employers closed offices to contain the spread of Covid-19.\n Many big employers have said they will allow some staff to permanently work from home either full-time or part-time after the pandemic is over.\n  However, there are millions more who can&#39;t work from home, such as nurses and factory workers for example, and the tax should help support these roles, argues Deutsche Bank.\n &#34;The virus has benefitted those who can do their jobs virtually, such as bank analysts, and threatened the livelihoods or health of those who can&#39;t,&#34; added Mr Templeman.\n He also argues that remote workers are contributing less to the infrastructure of the economy &#34;whilst still receiving its benefits&#34;.\n By working from home, people aren&#39;t paying for public transport or eating out at restaurants near their places of work, while expensive offices remain virtually empty.\n &#34;WFH offers direct financial savings on expenses such as travel, lunch, clothes and cleaning,&#34; he said.\n The 5% tax rate &#34;will leave them no worse off than if they had chosen to go into the office&#34;.\n Research from Deutsche Bank shows that one third of people want to continue working two days a week from home once the pandemic is over.\n  The tax would be paid directly by employers who choose to let employees work home.\n  It also wouldn&#39;t apply when people are asked to stay home for a public health emergency or other medical reasons.\n The tax revenues would be used for a very specific purpose - to give grants to the millions of workers who cannot do their jobs from home and who make less than $30,000 a year.\n Deutsche Bank says its research is designed to spark debate around the a series of important topics.", "posttime": "2020-11-11 12:54:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "working", "title": "在家工作的税务工作“以支持脆弱的就业”--德意志银行(Deutsche Bank)", "title_en": "Tax working from home 'to support vulnerable jobs' – Deutsche Bank", "transed": 1, "url": "https://www.bbc.co.uk/news/business-54876526", "via": "", "real_tags": ["working"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特别值得一提的是，Glassdoor的平均数字似乎很低。我怀疑这是因为他们的平均薪酬受到较老数字的拖累，而薪酬在过去7年里飙升。两年前，我在美国中西部一个大镇的卫星办公室里从其他人那里听到的平均数字，与Glassdoor上的平均数字甚至还差得很远，自那以来，市场已大幅上涨。最近，在高端市场，我认识一个刚从学校毕业的人，他的年薪总计近25万美元(4年股本35万美元，签约奖金5万美元，外加丰厚的薪水)。像往常一样，他们收到了许多薪酬水平各不相同的工作机会，然后Facebook介入，抬高了他的薪酬。那些认真想要争夺人才的公司满足了他们的要求，仅此而已。这包括西雅图和奥斯汀的出价与西雅图和奥斯汀的出价相匹配。如果你正在谈判一份工作，那么最关键的不是什么超级天才。它足以相当不错，知道市场正在支付什么，并有多个报价。这个人物有所值，这就是为什么他得到了工作机会，但我认识几个同样优秀的人，他们挣的钱只有一半，只是因为他们只得到了一份工作机会，而且没有筹码。\n不管怎么说，这个脚注的要点是，经验丰富的工程师的总薪酬可能远远超过帖子中提到的数字。在接下来的分析中，请记住，我使用的是保守的数字，对经验丰富的工程师的激进估计会高得多。例如，在谷歌(Google)，高年级学生的分数从3开始，实际上是满分11分的第5级。在微软(Microsoft)，高年级学生的分数从59分开始，一直到70多岁，然后跳到80分，总分是第63分(或者类似的分数，我总是忘记细节，因为这个分数太傻了)。高级员工并不是一个特别高的级别，而且高级员工的年薪总额往往远远超过25万美元。请注意，这些数字也不包括过去几年时髦大公司的上述市场股票增长率。如果你真的接受了这笔交易，你的RSU很可能已经大幅升值了。\n[返回]。\n这取决于公司。这在Facebook和谷歌这样的公司是正确的，这些公司都在认真努力留住人才。在IBM、美国国家仪器公司(NI)和史诗系统公司(EpicSystems)等甚至都不尝试的地方，这几乎是完全不正确的。而在微软这样的地方，情况大多不是这样，微软正在尝试，但方式可能是最落后的。\n微软(和其他中端公司)会给你一个合适的报价，并与其他公司的好报价相匹配。这本身就已经有问题了，因为它会激励在微软面试的人也去其他地方面试。但更糟糕的问题是，他们在留住员工时也是这样做的。如果你在微软呆了很长一段时间，而且不是少数几个快速找到合作伙伴的人之一，你的薪酬最终将严重低于市场水平，有时甚至会低两倍。当你意识到这一点，并在其他地方面试时，微软会与外部报价相匹配，但在多年被低估了数十万美元或数百万美元(取决于你在那里工作的时间)之后，只按市价支付一年，然后在可预见的未来获得较低薪酬的承诺似乎并不是很有说服力。这种激励结构看起来就像是为了让那些处于中等和优秀之间的人离开而设计的。我在很多人身上都看到过这种情况，我知道还有很多人也因为这个原因而打算离开。当这种情况发生时，他们的经理总是会感到惊讶，但他们不应该这样做，这是完全可以预见的。\n对我来说，IBM的战略实际上比微软的战略更有意义。你可以通过给别人发低工资来节省一大笔钱。这事儿可以理解。但为什么要不厌其烦地花大价钱让人们进来，然后又激励他们离开呢？虽然与我共事的最顶尖的人确实得到了丰厚的报酬，而且似乎对此感到高兴，但这样的人并不够多，你不能在任何事情上都依赖他们。\n[返回]。\n在这一点上，一些人比其他人做得更好。较老的公司，如微软，有时会有年度归属，但许多较年轻的公司，如谷歌，一旦过了第一年，归属时间表就会顺畅得多。然后是亚马逊(Amazon)，它知道这些产品的流失率很高，所以不需要支付太多钱，所以就取消了它们的报价。[返回]\n遗憾的是，出于后来提到的商业原因，我们最终没有发布这篇文章。[返回]。\n我与X迎新大公司的一名员工的第一次互动是，那名员工告诉我，我不能参加迎新，因为我不在名单上。我不得不问我怎么才能上榜，有人告诉我，我需要经理发一封电子邮件才能上榜。那是在早上7：30左右，因为培训在7：30开始，然后持续半天，原因似乎没人知道(我问了很多人，一直到人力资源副总裁)。当我问我是否可以当天晚些时候再来时，他们告诉我，如果我不能在一小时内到达，我将不得不下周再来。我还问，在某些系统中，我被列为有一位特定的经理，这是否证明我应该参加培训，并被告知我必须在名单上。所以我给我的经理发了电子邮件，但他当然没有回复，因为谁会在早上7：30检查他们的电子邮件呢？幸运的是，我的经理之前给了我他的电话号码，并告诉我如果需要什么就打电话给我，而且能够进入培训课程，而且下周早上7：30不必再次出现，这似乎是一件事，所以我给他打了个电话。自然，他要求与迎新门卫通话；当我转告迎新人员时，他告诉我，他不能打电话--你看，他只能接受电子邮件，不能打电话，甚至不能只是为了澄清一些事情。开学五分钟后，我就已经目瞪口呆了。但是，真的，我应该认为自己很幸运--另一个“不在名单上”的人没有他经理的电话号码，据我所知，他不得不在下周早上7：30回来参加迎新活动。我问迎新人员这种情况多久发生一次，他告诉我“非常罕见，一周只有一两次”。\n在接受培训期间，这种体验大约每半小时重复一次。我没有从任何其他定向站点被丢弃，但当我询问时，我发现每个站点都有经常丢弃乘客的错误。我最喜欢的车站是有人站在输入队列旁，分发一张纸。这张纸告诉你，车站的机器会给你一个错误，告诉你该怎么做。发生错误时，您必须按照纸上的说明操作，而不是按照这些说明操作。\n这些经历基本上占据了我第一周的全部时间。现在，我已经过了入职生活，开始了日常生活，一周有几次超现实的卡夫卡式体验。我基本上已经弄明白了如何在系统中导航(通常，认识合适的人并请他们介入就能解决问题)。我发现真正有趣的不是实际体验，而是我采访过的大多数来过这里一段时间的人都认为，从字面上看，这不可能是其他任何方式，事情也不可能得到改善。奇怪的是，在这里呆了这么长时间的资深人士往往会同意，这家公司也有大公司功能失调的问题。我希望我在这方面有足够的数据来判断因果关系的发展方向(是那些意识到这一功能的人更有可能持续足够长的时间成为非常高级的人，还是非常高级的人会让你从一个角度看到更多的功能障碍)。更令人好奇的是，该公司投入了相当多的精力来给人们留下事情尽可能好的印象。在Orientation，我们得到了一种历史版本，听起来好像是这家公司开创了从图形用户界面到网络的一切，有很多人声称我们拥有世界上最好的X，即使X相当平庸。我不清楚公司从确保大多数员工不了解我们自己的产品和流程的缺点中得到了什么。\n不管是什么原因，认为事情不可能改善的态度不仅仅局限于行政问题。我的一个朋友需要找到一个函数来做一些在Linux上微不足道的事情，但这在我们的操作系统上要复杂得多。他的第一次尝试是使用Boost，但事实证明，在我们使用的操作系统上执行此操作的文档非常复杂，以至于Boost搞错了这一点，并且多年来一直存在一个错误。几天后，他编写了72行代码，终于想出了如何创建一个函数来实现他的目标。由于他不确定自己是否遗漏了什么，他将代码审查转发给了两名非常资深的工程师(比杰出工程师低一级)。他们不确定，并将其转发给了CTO，CTO说他没有看到一个更简单的方法来在我们的操作系统中用现在的API来完成同样的事情。\n后来，我的朋友进行了激烈的讨论。", "note_en": "In particular, the Glassdoor numbers seem low for an average. I suspect that&#39;s because their average is weighed down by older numbers, while compensation has skyrocketed the past seven years. The average numbers on Glassdoor don&#39;t even match the average numbers I heard from other people in my Midwestern satellite office in a large town two years ago, and the market has gone up sharply since then. More recently, on the upper end, I know someone fresh out of school who has a total comp of almost $250k/yr ($350k equity over four years, a $50k signing bonus, plus a generous salary). As is normal, they got a number of offers with varying compensation levels, and then Facebook came in and bid him up. The companies that are serious about competing for people matched the offers, and that was that. This included bids in Seattle and Austin that matched the bids in SV. If you&#39;re negotiating an offer, the thing that&#39;s critical isn&#39;t to be some kind of super genius. It&#39;s enough to be pretty good, know what the market is paying, and have multiple offers. This person was worth every penny, which is why he got his offers, but I know several people who are just as good who make half as much just because they only got a single offer and had no leverage.\n  Anyway, the point of this footnote is just that the total comp for experienced engineers can go way above the numbers mentioned in the post. In the analysis that follows, keep in mind that I&#39;m using conservative numbers and that an aggressive estimate for experienced engineers would be much higher. Just for example, at Google, senior is level 5 out of 11 on a scale that effectively starts at 3. At Microsoft, it&#39;s 63 out of a weirdo scale that starts at 59 and goes to 70-something and then jumps up to 80 (or something like that, I always forget the details because the scale is so silly). Senior isn&#39;t a particularly high band, and people at senior often have total comp substantially greater than $250k/yr. Note that these numbers also don&#39;t include the above market rate of stock growth at trendy large companies in the past few years. If you&#39;ve actually taken this deal, your RSUs have likely appreciated substantially.\n   [return]\n  This depends on the company. It&#39;s true at places like Facebook and Google, which make a serious effort to retain people. It&#39;s nearly completely untrue at places like IBM, National Instruments (NI), and Epic Systems, which don&#39;t even try. And it&#39;s mostly untrue at places like Microsoft, which tries, but in the most backwards way possible.\n  Microsoft (and other mid-tier companies) will give you an ok offer and match good offers from other companies. That by itself is already problematic since it incentivizes people who are interviewing at Microsoft to also interview elsewhere. But the worse issue is that they do the same when retaining employees. If you stay at Microsoft for a long time and aren&#39;t one of the few people on the fast track to &#34;partner&#34;, your pay is going to end up severely below market, sometime by as much as a factor of two. When you realize that, and you interview elsewhere, Microsoft will match external offers, but after getting underpaid for years, by hundreds of thousands or millions of dollars (depending on how long you&#39;ve been there), the promise of making market rate for a single year and then being underpaid for the foreseeable future doesn&#39;t seem very compelling. The incentive structure appears as if it were designed to cause people who are between average and outstanding to leave. I&#39;ve seen this happen with multiple people and I know multiple others who are planning to leave for this exact reason. Their managers are always surprised when this happens, but they shouldn&#39;t be; it&#39;s eminently predictable.\n  The IBM strategy actually makes a lot more sense to me than the Microsoft strategy. You can save a lot of money by paying people poorly. That makes sense. But why bother paying a lot to get people in the door and then incentivizing them to leave? While it&#39;s true that the very top people I work with are well compensated and seem happy about it, there aren&#39;t enough of those people that you can rely on them for everything.\n   [return]\n  Some are better about this than others. Older companies, like MS, sometimes have yearly vesting, but a lot of younger companies, like Google, have much smoother vesting schedules once you get past the first year. And then there&#39;s Amazon, which backloads its offers, knowing that they have a high attrition rate and won&#39;t have to pay out much.   [return]\n  Sadly, we ended up not releasing this for business reasons that came up later.   [return]\n  My very first interaction with an employee at big company X orientation was having that employee tell me that I couldn&#39;t get into orientation because I wasn&#39;t on the list. I had to ask how I could get on the list, and I was told that I&#39;d need an email from my manager to get on the list. This was at around 7:30am because orientation starts at 7:30 and then runs for half a day for reasons no one seems to know (I&#39;ve asked a lot of people, all the way up to VPs in HR). When I asked if I could just come back later in the day, I was told that if I couldn&#39;t get in within an hour I&#39;d have to come back next week. I also asked if the fact that I was listed in some system as having a specific manager was evidence that I was supposed to be at orientation and was told that I had to be on the list. So I emailed my manager, but of course he didn&#39;t respond because who checks their email at 7:30am? Luckily, my manager had previously given me his number and told me to call if I ever needed anything, and being able to get into orientation and not have to show up at 7:30am again next week seemed like anything, so I gave him a call. Naturally, he asked to talk to the orientation gatekeeper; when I relayed that the orientation guy, he told me that he couldn&#39;t talk on the phone -- you see, he can only accept emails and can&#39;t talk on the phone, not even just to clarify something. Five minutes into orientation, I was already flabbergasted. But, really, I should have considered myself lucky -- the other person who “wasn&#39;t on the list” didn&#39;t have his manager&#39;s phone number, and as far as I know, he had to come back the next week at 7:30am to get into orientation. I asked the orientation person how often this happens, and he told me “very rarely, only once or twice per week”.\n  That experience was repeated approximately every half hour for the duration of orientation. I didn&#39;t get dropped from any other orientation stations, but when I asked, I found that every station had errors that dropped people regularly. My favorite was the station where someone was standing at input queue, handing out a piece of paper. The piece of paper informed you that the machine at the station was going to give you an error with some instructions about what to do. Instead of following those instructions, you had to follow the instructions on the piece of paper when the error occurred.\n  These kinds of experiences occupied basically my entire first week. Now that I&#39;m past onboarding and onto the regular day-to-day, I have a surreal Kafka-esque experience a few times a week. And I&#39;ve mostly figured out how to navigate the system (usually, knowing the right person and asking them to intervene solves the problem). What I find to be really funny isn&#39;t the actual experience, but that most people I talk to who&#39;ve been here a while think that  it literally cannot be any other way and that things could not possibly be improved. Curiously, people who have been here as long who are very senior tend to agree that the company has its share of big company dysfunction. I wish I had enough data on that to tell which way the causation runs (are people who are aware of the function more likely to last long enough to become very senior, or does being very senior give you a perspective that lets you see more dysfunction). Something that&#39;s even curiouser is that the company invests a fair amount of effort to give people the impression that things are as good as they could possibly be. At orientation, we got a version of history that made it sound as if the company had pioneered everything from the GUI to the web, with multiple claims that we have the best X in the world, even when X is pretty clear mediocre. It&#39;s not clear to me what the company gets out of making sure that most employees don&#39;t understand what the downsides are in our own products and processes.\n  Whatever the reason, the attitude that things couldn&#39;t possibly be improved isn&#39;t just limited to administrative issues. A friend of mine needed to find a function to do something that&#39;s a trivial one liner on Linux, but that&#39;s considerably more involved on our OS. His first attempt was to use boost, but it turns out that the documentation for doing this on the OS we use is complicated enough that boost got this wrong and has had a bug in it for years. A couple days, and 72 lines of code later, he managed to figure out how to create a function to accomplish his goal. Since he wasn&#39;t sure if he was missing something, he forwarded the code review to two very senior engineers (one level below Distinguished Engineer). They weren&#39;t sure and forwarded it on to the CTO, who said that he didn&#39;t see a simpler way to accomplish the same thing in our OS with the APIs as they currently are.\n  Later, my friend had a heated discussion with someone on the OS team, who maintained that the documentation on how to do this was very clear, and that it couldn&#39;t be clearer, nor could the API be any easier. This is despite this being so hard to do that boost has been wrong for seven years, and that two very senior engineers didn&#39;t feel confident enough to review the code and passed it up to a CTO.\n  I&#39;m going to stop here not because I&#39;m out of incidents like this, but because a retelling of a half year of big company stories is longer than my blog. Not just longer than this post or any individual post, but longer than everything else on my blog combined, which is a bit over 100k words. Typical estimates for words per page vary between 250 and 1000, putting my rate of surreal experiences at somewhere between 100 and 400 pages every six months. I&#39;m not sure this rate is inherently different from the rate you&#39;d get  at startups, but there&#39;s a different flavor to the stories and you should have an idea of the flavor by this point.\n   [return]", "posttime": "2020-11-11 12:51:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "big", "title": "大公司VS初创公司", "title_en": "Big Companies vs. Startups", "transed": 1, "url": "https://danluu.com/startup-tradeoffs/", "via": "", "real_tags": ["big"]}, {"category": "", "categoryclass": "", "imagename": "813700c94318fc5cfeae91d82efbb056.gif", "infoid": 1034471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个互动的大脑模型由威康信托基金提供支持，由马特·威姆萨特和杰克·辛普森开发；约翰·莫里森、帕特里克·霍夫和爱德华·莱恩审阅。结构描述由Levi Gadye、Alexis Wnuk和Jane Roskams撰写。\n版权所有©神经科学学会(2017)。用户可以复制图像和文本，但如果图像和/或文本被传输给另一方，或者用户的作品中使用或引用了图像和/或文本，则必须向神经科学学会提供署名。", "note_en": "This interactive brain model is powered by the  Wellcome Trust and developed by  Matt Wimsatt and  Jack Simpson; reviewed by  John Morrison,  Patrick Hof, and  Edward Lein. Structure descriptions were written by   Levi Gadye  and  Alexis Wnuk and  Jane Roskams.\n Copyright © Society for Neuroscience (2017). Users may copy images and text, but must provide attribution to the Society for Neuroscience if an image and/or text is transmitted to another party, or if an image and/or text is used or cited in User’s work.", "posttime": "2020-11-11 12:49:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大脑,brain,提供", "title": "大脑事实--3D大脑", "title_en": "Brain Facts 3D Brain", "transed": 1, "url": "https://www.brainfacts.org/3d-brain", "via": "", "real_tags": ["大脑", "brain", "提供"]}, {"category": "", "categoryclass": "", "imagename": "8b28fdd48f455b5b6ff944d7289d4916.jpg", "infoid": 1034470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，超频专家der8auer在扫描电子显微镜(SEM)下检查了英特尔酷睿i7-8700K处理器，当时该处理器是英特尔最好的消费产品之一。这是一个有趣的练习，但在最近的YouTube视频系列中，der8auer将当前最先进的英特尔酷睿i9-10900K与AMD Ryzen 9 3950X进行了直接比较。前者是英特尔14纳米++生产芯片，后者是台积电为AMD制造的7纳米制程芯片。你可能认为扫描电子显微镜显示的实际晶体管尺寸与…相当不同。\n为了让Tescan Labs SEM进行有效的比较，der8auer选择对这些光环消费者冠军进行L1缓存切片。在本系列的前两个视频(访问Tescan第1部分和第2部分)中，您可以看到更多关于这一过程的背景、扫描电子显微镜技术和der8auer的想法。\n在上面的主要图片中，你可以看到第一个直接的对比，当扫描电子显微镜放大到相同的放大倍数时，你可以看到两个芯片的晶体管尺寸非常相似。栅极高度非常相似，但是在下面的比较中叠加了指导方针，你可以看到台积电确实生产了一个晶体管间距更小的处理器。\n在看了上面的对比，并在他的视频中强调了这一点后，der8auer挑战了英特尔14纳米++和台积电7纳米在物理尺寸上非常相似的明显结论，提醒观众上面的图片并不能完全代表对现代芯片优化如此重要的3D结构。此外，自20世纪90年代初以来，节点大小、半间距和栅极长度之间的关系已显著松动。这位OC专家断言，XXnm值更多地反映了工艺历史，而不是进步，因此，作为芯片制造商之间的比较指标，它并不是很有用。\n芯片制造商透露的另一个指标是晶体管密度，这一指标可能值得更仔细地考虑。英特尔10纳米和台积电7纳米制程都生产每平方毫米约9000万个晶体管的芯片。展望未来，英特尔和台积电分别为其即将推出的7纳米和5纳米制程设定了约150MT/mm²的目标。然而，其他因素也造成了差异，比如晶体管类型和芯片架构，这使得直接比较变得困难。总之，芯片工艺的进步有时会成为有趣的新闻片段，但我相信HEXUS的读者知道，在第三方评论中最早评估的用户体验是最重要的。\n这是一个非常有趣的迷你视频系列。他们使用的设备和研究结果一样令人费解。我喜欢这样的结论：流程节点号是完整的，不能用来比较制造商的流程。\nKanoe：我喜欢这个结论，那就是工艺节点号是完整的，不能用来比较制造商的工艺。\n*令人震惊*，你会说TDP数字不能被下一个比较，甚至GHz数字；)\n与Unix Kanoe共舞我喜欢这样一个事实，即过程节点号是完整的，不能用来比较一个制造商的过程和另一个过程。\n*令人震惊*，你会说TDP数字不能被下一个比较，甚至GHz数字；)。\n我猜他并不是说，只是不同制造商之间的节点大小是不可比拟的。这是把苹果比作梨。TDP在最近几年也很有趣，这就是为什么英特尔决定使用另一种衡量芯片功耗的指标，因为再也没有人信任TDP了。\n让我大吃一惊的是，我有些不对劲，看这么小的东西的技术让我的果汁冒泡。\n据芯片制造商透露，另一个可能值得仔细考虑的指标是晶体管密度。英特尔10纳米和台积电7纳米制程都生产每平方毫米约9000万个晶体管的芯片。\n莱克菲尔德的10 nm+阳光湾岩心约为50mt/mm2。黑文没有看到任何其他实际计算出的10纳米的数字。", "note_en": "Overclocking expert der8auer examined an Intel Core i7-8700K under a scanning electron microscope (SEM) a couple of years ago when that processor was one of Intel&#39;s best consumer offerings. This was an interesting exercise but in a recent YouTube video series der8auer has been leading up to a direct comparison between the current state-of-the-art Intel Core i9-10900K and the AMD Ryzen 9 3950X. The former is an Intel 14nm+++ production chip and the latter made for AMD by TSMC on its 7nm process. You probably expect the actual transistor size revealed by the SEM to be rather different…\n    In order to get the Tescan labs SEM to make an effective comparison der8auer chose to slice into these halo consumer champs through their L1 cache sections. You can see much more about the background to this process, the SEM technology and der8auer&#39;s thinking in the previous two videos in this series;  Visiting Tescan Part 1, and  Part 2.\n    In the main picture, above, you can see the first direct comparison you can see the transistor sizes of the two chips are very similar when the SEM zooms in to the same magnification. Gate height is very similar but with the guidelines superimposed in the comparison below you can see that TSMC has indeed produced a processor with tighter spacing between the transistors\n    Having looked at the above comparison, and highlighted it in his video, der8auer challenges the obvious conclusion that Intel 14nm+++ and TSMC 7nm are very similar in physical scale, reminding viewers that the above pictures don&#39;t fully represent the 3D structure that is so important to modern chip optimisation. Moreover, the relationship between node size, half-pitch, and gate length has significantly loosened since the early 1990s. The XXnm figure reflects process history more than progress, asserts the OC expert, and thus it isn&#39;t very useful as a metric to compare between chip makers.\n  Another metric, probably worth closer consideration is transistor density, as revealed by the chip fabricators. Intel 10 nm and TSMC 7nm processes both produce dies with approx 90 million transistors per sq millimetre. Moving forward both Intel and TSMC are targeting approx 150MT/mm² for their upcoming 7nm and 5nm processes, respectively. Again though, other factors make differences, like transistor type and chip architecture, that make direct comparisons difficult. In conclusion, chip process advances sometimes make interesting news segments but user experiences assessed earliest in third party reviews are most essential as I am sure HEXUS readers know.\n  It was a very interesting mini series of videos. The equipment they use is as facinating as the findings.  I love the fact the conculsion was that process node numbers are complete b******s and cant be used for comparing one manufactues process versus another.\n    Kanoe I love the fact the conculsion was that process node numbers are complete b******s and cant be used for comparing one manufactues process versus another.\n *shock*, You&#39;ll be saying TDP numbers can&#39;t be compared next, or even GHz numbers ;)\n    DanceswithUnix  Kanoe I love the fact the conculsion was that process node numbers are complete b******s and cant be used for comparing one manufactues process versus another.\n *shock*, You&#39;ll be saying TDP numbers can&#39;t be compared next, or even GHz numbers ;)\n I guess he didn&#39;t meant that, only that different manufactures node sizes are incomparable between manufacturers. its comparing apples to pears. TDP is also funny in recent years, this is why Intel decided to use another metric for chip power usage, as no one trusted the TDP anymore.\n    Mind blown, something&#39;s wrong with me that the technology of looking at things that small gets my juices fizzing.\n    HEXUS Another metric, probably worth closer consideration is transistor density, as revealed by the chip fabricators. Intel 10 nm and TSMC 7nm processes both produce dies with approx 90 million transistors per sq millimetre.\n The 10nm+ Sunny Cove core in Lakefield is ~50mT/mm2. Haven&#39;t seen any other actual calculated numbers for 10nm.", "posttime": "2020-11-11 12:49:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,台积,amd,芯片", "title": "英特尔14纳米和AMD/台积电7纳米晶体管的微观比较", "title_en": "Intel 14nm and AMD/TSMC 7nm transistors micro-compared", "transed": 1, "url": "https://hexus.net/tech/news/cpu/145645-intel-14nm-amdtsmc-7nm-transistors-micro-compared/", "via": "", "real_tags": ["英特尔", "台积", "amd", "芯片"]}, {"category": "", "categoryclass": "", "imagename": "a83e818108a5bf133bdb0c7f14475660.jpg", "infoid": 1034469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雅加达--新加坡跨国移动科技巨头Grab投资了印尼国有支付公司LinkAja，此举可能会导致这个群岛快速增长的电子钱包市场的进一步重组。\nGrab是印尼最大的市场，它已经是OVO的大股东。OVO是印尼最大的移动支付公司之一，正在与另一家本土电子钱包实体Dana就可能的合并进行谈判。\n这家新加坡公司是领航(LinkAja&#39；)1亿美元首轮B轮融资的牵头投资者。其他投资者包括印尼国有航空公司Telkomsel，以及国有的印尼Rakyat银行和曼迪里银行(Bank Mandiri)的风险投资部门。这是LinkAja第一次获得不受政府控制的企业的资金。\n我们……。Grab印尼公司董事总经理奈能·戈纳迪(Neneng Goenadi)表示：我希望通过对LinkAja的投资来强化我们的承诺。[这笔投资]证实了Grab在印尼建立数字生态系统的承诺。\n周二，Grab在雅加达开设了一个新的科技中心，宣布了这一消息。去年，Grab的大股东软银集团(SoftBank Group)承诺将通过Grab在印尼投资20亿美元，软银集团(SoftBank Group)承诺将通过Grab在印尼投资20亿美元。软银集团是Grab的主要股东，软银集团去年承诺将通过Grab在印尼投资20亿美元。\nLinkAja是在合并了5家不同国有企业的数字支付服务后于去年6月推出的。\n此举反映出，政府及其企业对Grab及其竞争对手Gojek等私营实体在东南亚最大经济体金融服务业的积极扩张构成的威胁日益担忧。\n印尼快速增长的数字支付市场2019年的交易额同比增长78%，同期交易额增长了三倍多。\n然而，LinkAja未能迎头赶上，Gojek的支付服务GoPay和OVO都被证明太大了，无法击败。近几个月来，新加坡SEA集团(SEA Group)的支付服务提供商Shopee Pay也进军印尼数字钱包市场，通过积极的返现促销活动夺取了相当大的市场份额。Grab和其他公司最近提供的资金将帮助LinkAja保持在竞争格局中。\n在这样一个残酷的环境下，市场重组已经讨论了一段时间，Grab的OVO与戴纳就潜在的合并进行了接触。一位知情人士表示，由于冠状病毒大流行扭曲了市场，谈判已被推迟。\n该人士补充称，Grab对LinkAja的投资应与OVO-Dana交易分开看待，Grab无意将这家国有支付公司与LinkAja合并。", "note_en": "JAKARTA -- Singapore multinational mobile tech giant Grab has invested in Indonesian state-owned payments company LinkAja, a move that may lead to further realignment in the archipelago&#39;s fast growing electronic wallets market.\n Grab, for which Indonesia is the largest market, is already a major shareholder in OVO, one of the country&#39;s top mobile payments company, which is in talks with another local e-wallet entity DANA over a potential merger.\n The Singaporean company was the lead investor in LinkAja&#39;s $100 million Series B funding round. Other investors include Telkomsel, Indonesia&#39;s state-owned carrier, as well as the venture capital arms of state-owned Bank Rakyat Indonesia and Bank Mandiri. This is the first time LinkAja has received funding from an enterprise not controlled by the government.\n  &#34;We... want to reinforce our commitment through our investment in LinkAja,&#34; said Neneng Goenadi, managing director of Grab Indonesia. &#34;[The investment] confirms Grab&#39;s commitment in Indonesia to build a digital ecosystem.&#34;\n The announcement was made on Tuesday as Grab opened a new tech center in Jakarta. The new base and investment come on the back of a pledge made by SoftBank Group -- Grab&#39;s major shareholder -- last year to invest $2 billion in Indonesia through the Singaporean company.\n LinkAja was launched in June last year after merging the digital payments services of five different state-owned companies.\n The move reflected growing concern within the government and its companies over the threat posed by the aggressive expansion of private entities like Grab and its rival Gojek in financial services in Southeast Asia&#39;s biggest economy.\n The volume of transactions in Indonesia&#39;s fast-growing digital payments market rose 78% in 2019 from a year ago while the value of transactions jumped more than threefold in the same period.\n LinkAja failed to catch on, however, with both GoPay, Gojek&#39;s payment service, and OVO proving to be too big to beat. The Indonesian digital wallet market has also seen Shopee Pay -- the payment service provider of Singapore&#39;s SEA Group -- make inroads in recent months, taking a considerable portion of market share through aggressive cash back promotions. The recent funding from Grab and others will help keep LinkAja in the competitive landscape.\n In such a cutthroat environment, the restructuring of the market has been mooted for some time, with Grab&#39;s OVO engaging with DANA over a potential merger. Talks have been delayed due to the coronavirus pandemic distorting the market, a person with knowledge of the matter said.\n The person added that Grab&#39;s investment into LinkAja should be seen separately from the OVO-DANA deal, and that Grab has no intention of bringing the state-owned payment company to the same table.", "posttime": "2020-11-11 12:30:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linkaja,state,grab", "title": "Grab领投印尼政府支持的电子钱包公司LinkAja的B轮融资1亿美元，LinkAja是在合并了五家国有企业的支付服务后于去年推出的", "title_en": "Grab leads $100M Series B in Indonesian state-backed e-wallet company LinkAja that launched last year after merging payments services of five state-owned firms", "transed": 1, "url": "https://asia.nikkei.com/Business/Technology/Grab-invests-in-Indonesia-owned-digital-wallet-entity-LinkAja", "via": "", "real_tags": ["linkaja", "state", "grab"]}, {"category": "", "categoryclass": "", "imagename": "4427436799aa1ee244ebe4c7ee923c64.jpg", "infoid": 1034467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "中世纪威尼斯的统治者是通过随机抽签和选举交替进行的异常复杂的十步过程选出的。\n几周前，我写了一篇关于现代民主选举制度的文章，几天前，我写了一篇关于美国选举人团复杂性的文章。今天我想再往前走一步，追溯到中世纪的威尼斯共和国。在那里，选出一位新领导人--独裁者--是历史上较为复杂和令人费解的选举过程之一。即便如此，尽管这很疯狂，但还是有办法的。\n威尼斯大议会是一个由相对较少的贵族家族组成的大型立法机构。显然，每个人都想成为独裁者，但委员会非常热衷于避免幕后贿赂、肮脏的交易、阴谋以及旷日持久和有争议的竞选活动。为了实现这一目标，独裁者的选举经历了多个步骤，所有这些步骤都是为了减少权力巩固。\n首先，大议会的30名成员是随机选出的。然后，从这30个人中随机选择了9个人。这9名成员选出了下一组：来自大议会的40人。那那四十个呢？从他们的号码中随机挑选的12个人，进入了下一步。这12个人选择了25个；这25个人被随机削减到只有9个。玩得开心吗？\n这组9名成员又选出了45名成员；11名成员是从这45名成员中随机挑选出来的。这11个人选出了41名成员。那41个(终于！)。把票投给了狗。\n还有一些针对诈骗的额外检查。每个贵族家庭不能有一个以上的成员，成员也不能投票给自己的亲戚。每次一组成员投票给下一组时，需要的不仅仅是简单多数：大约四分之三的投票组必须同意。(在最后的选举中，41个人中只有25个人同意。)。\n简而言之，这个过程是这样的：Great Council&gt；30&&gt;9&lt；40&gt；12&lt；25&gt；9&lt；45&gt；11&lt；41&gt；1.。\n由于这种复杂性，操纵或收买选举的机会大大降低，少数人的担忧没有被多数人掩盖，但多数人也没有被少数人专制。今天，我们只在陪审团选举和公民大会中使用这种随机过程。", "note_en": "The ruler of Medieval Venice was chosen by an exceptionally complex ten-step process of alternating random lots and elections.\n  A few weeks ago I wrote about modern  democratic electoral systems, and a couple of days ago I wrote about the complexities of the  American Electoral College. Today I wanted to go even further back, to the Medieval Venetian Republic. There, the selection of a new leader – the doge – was one of the more complex and baffling electoral processes in history. And even so, though this be madness, yet there is method in’t.\n The Great Council of Venice was a large legislative body made up of a relatively small number of noble families. Obviously, everyone wanted to be the doge, but the council was very keen to avoid behind-the-scenes bribery, dirty deals, intrigue, and extended and contentious campaigns. To achieve this, the election of the doge went through multiple steps, all designed to reduce power consolidation.\n First, thirty members of the Great Council were chosen at random. Then nine of those thirty were chosen, again randomly. Those nine members picked the next set: forty people from the Great Council. And those forty? Twelve, randomly picked from their number, moved on to the next step. Those twelve chose twenty-five; those twenty-five were randomly pared down to just nine. Having fun yet?\n This set of nine members chose forty-five more; eleven were picked – again at random – from those forty-five. The eleven chose forty-one members. Those forty-one (finally!) voted for the doge.\n There were some additional checks against skulduggery. Each noble family couldn’t have more than one member in each group, and members couldn’t vote for their own relatives. Every time a set of members voted for the next group, more than a simple majority was required: around three quarters of the voting group had to agree. (For the final election, just 25 of the 41 had to agree.)\n To recap, this is the process: Great Council &gt; 30 &gt; 9 &lt; 40 &gt; 12 &lt; 25 &gt; 9 &lt; 45 &gt; 11 &lt; 41 &gt; 1.\n Because of this complexity, the chances of rigging or buying the election were greatly reduced, minority concerns were not buried by the majority, but neither was the majority tyrannized by the minority. Today we only use this kind of random process in jury selection and citizen’s assemblies.", "posttime": "2020-11-11 12:04:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教宗,election,选举", "title": "教宗的选举", "title_en": "The election of the doge", "transed": 1, "url": "https://generalist.academy/2020/11/06/the-election-of-the-doge/", "via": "", "real_tags": ["教宗", "election", "选举"]}, {"category": "", "categoryclass": "", "imagename": "d855192aae5eac308dfddf5de36c0d3e.png", "infoid": 1034466, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们很自豪地宣布，InfluxDB Open Source2.0现已向所有人开放。这是一条漫长的道路，如果没有我们社区令人惊叹的支持和贡献，我们不可能做到这一点。这标志着InfluxDB平台进入了一个新时代，但这只是个开始。\n在我们谈论未来之前，让我们先来看看我们团队一直在研究的一些令人惊叹的新功能。\n对于那些只想开始的人，请查看我们的下载页面以获取最新版本以及我们的入门和升级指南。\n对于任何熟悉我们现有开源产品(亲切地称为Tick Stack-Telegraf、InfluxDB、Chronograf和Kapacitor的缩写)的人来说，您可能会注意到的第一件事是，只有一个二进制文件需要下载和安装。\n现在，新的InfluxDB在一个二进制文件中包含了您在时间序列数据平台中需要的所有内容。这简化了部署和设置体验，同时保持了各个组件的功能和灵活性。\n单一的二进制文件意味着它也更容易保护，因此我们默认使InfluxDB变得安全。对InfluxDB的每个请求都伴随着一个可以撤销的身份验证令牌，内置用户界面使用用户名和密码进行保护。\n有了这些更改，您永远不必担心存储在InfluxDB中的数据意外暴露给公共互联网。\n易于部署、易于管理、默认安全。开发人员期望从现代开发平台获得这些东西，InfluxDB也不例外。\n我们知道开发人员尽快接触到他们的数据是多么重要。我们经常从我们的社区听到的一件事是，Chronograf(Tick Stack的“C”)使得快速查看进入系统的时间序列数据的形状变得非常容易，并简化了许多常见的管理任务。\nInfluxDB Open Source2.0通过全新的Data Explorer、附加的可视化类型以及专门为时间序列数据构建的强大的新查询语言Flux延续了这种体验。您可以快速浏览所有测量值、字段和标签，并对这些数据应用常见转换，而无需伸手到键盘。\n当然，对于那些希望释放数据的全部潜力的人，我们提供了一个脚本编辑器，其中包括自动补全、实时语法检查以及大量的示例和文档来帮助您入门。此编辑器可在InfluxDB(数据资源管理器、仪表板和任务)中使用，并使用与Visual Studio代码中相同的摩纳哥编辑器。\n等等，但你已经有大量基于InfluxQL的应用程序和集成了？不成问题。InfluxDB 2.0旨在替代现有的InfluxDB实例。这意味着，如果您正在使用外部可视化工具进行仪表板操作，或者将数据写入数据库，那么在您升级之后，它仍然可以正常工作。当然，我们建议将这些连接迁移到最新的v2API，但它们将继续按原样正常工作。向后兼容的API可以帮助您随心所欲地快速移动。\n许多用户喜欢通过InfluxQL访问数据的简单性，InfluxQL是我们类似SQL的查询语言。作为平台的简单入口，这是体验InfluxDB强大功能的绝佳场所。但是，随着时间的推移，随着用例的复杂性增加，不仅仅是简单的SELECT语句，也出现了挑战。结果，开发人员最终编写了自定义应用程序逻辑来完成现代应用程序经常需要的大部分复杂转换。\n这有一些缺点。首先，我们希望建立一个能够提高开发人员工作效率的平台，而花在编写通用数据转换逻辑上的任何时间都被用来为他们自己的用户和客户创造价值。第二个缺点是性能。数据从存储层获得的距离越远，转换速度就越慢。\n其核心的助熔剂就是为了解决这些问题。Flux不是一种类似SQL的语言；它是一种类似于JavaScript或Python的函数式编程语言。这意味着您可以像编写应用程序一样自定义和结构化查询，将公共逻辑分成可重用的函数和库，从而减少需要编写的总代码量。该代码还尽可能靠近存储层执行，直接压低许多操作，从而为您提供尽可能快的系统性能。\nFlux的构建也不仅仅是为了处理时间序列数据(尽管这是它的主要业务)。它可以直接从Postgres、Microsoft SQL Server、SQLite和SAP Hana等SQL数据存储以及Google Bigtable、Amazon Athena和Snowflake等基于云的数据存储中提取数据。这使您可以丰富时间序列数据以提供其他上下文。以下是一些例子：\n对于物联网用户，Flux允许您将传感器的时间序列数据与制造商、型号、设备年限或里程等关系表中的信息结合起来。\n对于真正的用户监控(RUM)，您可以使用Flux来查找客户ID，并将客户名称、定价计划以及公司名称和位置等图片联系起来。\n在IT基础设施监控中，Flux可以将服务器ID解析为软件版本和配置参数。\nFlux还允许您执行地理时间查询，因此您可以根据时间和位置进行过滤。这对于您需要跟踪移动中的设备或车辆的许多物联网使用案例至关重要。例如，下面的简单明了的Flux查询允许您查询以三角形为边界的所有点，这些点位于三个坐标处。\n发件人(存储桶：&#34；示例-存储桶&#34；)\r&gt；范围(开始：-1h)\r|&gt；filter(fn：(R)=&gt；r._measure==&#34；例如-测量&#34；)\r&gt；Geo.filterRows(\r地区：{\r积分：[\r{经度：40.671659，经度：-73.936631}，\r{经度：40.706543，经度：-73.749177}，\r{纬度：40.791333，纬度：-73.880327}\r]\r}\r)。\n开发人员寻求的不仅仅是查询数据的能力。他们想用它来建造。Flux为我们的社区提供了用数据分析和构建应用程序的最快、最强大的方式，我们迫不及待地想让您试一试。\n交互式处理数据可以提供强大的洞察力，但在现代系统中，这些交互式查询只占整个处理过程的一小部分。流入您的应用程序的大多数数据在与其他信息结合以产生关于正在发生的事情的知识时会更加强大。当您专注于利用洞察力时，该过程需要持续可靠地在后台进行。\nInfluxDB 2.0包含一个功能强大的新后台处理系统，称为任务，该系统使用与访问存储在平台中的数据相同的Flux语言构建和执行任务。这些任务可以做很多功能强大的事情，包括聚合经常访问的指标以提高仪表板的性能，根据存储在完全不同系统中的数据计算自定义指标，或者降低数据采样以节省长期存储成本。\n还可以利用任务自动将数据推送到其他系统，这些系统可以对您的数据进行通知或警报。因为它们是基于Flux语言的，所以当我们添加新的库、功能或工具时，可以在任务中自动利用这些库、功能或工具。\nInfluxDB任务在概念上类似于Kapacitor(滴答中的“K”)。但与Kapacitor不同的是，Kapacitor使用一种名为TICKscript的语言，该语言独立于Chronograf中使用的InfluxQL，而任务使用Flux。这简化了开发人员的工作，因为他们可以在Data Explorer和仪表板中使用一种语言进行查询，并在任务中进行数据处理。\n任务是平台的处理支柱，我们认为您会找到一些令人惊叹的方式来使用它们。\n我们围绕公司的座右铭是，我们的团队永远不应该看着仪表盘就知道有什么不对劲。监控和警报对于任何应用平台都至关重要，我们也不例外。\nInfluxDB 2.0包括一个强大的监控和警报系统，该系统基于与Tasks和Flux相同的技术。我们的原生用户界面提供了一种快速定义数据阈值和死人警报的方法，但如果您需要更大的灵活性，您可以使用底层任务系统构建自己的自定义警报。\n这些警报的通知可以发送到任意数量的外部系统，包括PagerDuty、Slack、Microsoft Teams、电子邮件、MQTT或您控制的自定义HTTP端点(WebHook)。我们为定义和管理这些警报提供了直观的用户界面，但通过用户界面提供的每一项功能都通过我们的API公开，因此您可以构建适合自己的自动化。\n时间是最稀缺的资源，开发人员经常在易用性与面向未来的功能和灵活性之间进行权衡，这是很常见的。在InfluxDB 2.0中，我们希望让它变得非常简单，但也要让我们的社区相信，随着他们的用例的发展和使用的增长，我们会满足您的需求。\n我们的下一代平台是围绕单一的通用API构建的。无论您是在笔记本电脑上本地构建应用程序，还是扩展到全球数百万用户，围绕构建应用程序的API都是相同的。\n这还允许我们提供一套强大的命令行工具和特定于语言的客户端库，支持10种语言和SDK，适用于我们所有的产品。如果您正在构建应用程序，使用InfluxDB启动和运行的最快方式是通过我们的客户端库之一。\n无论您现在构建的是什么，或者将来需要多大的规模，您都可以放心，您不需要重写您的应用程序来利用InfluxDB的强大功能。\nKubernetes已经占领了世界，随之而来的是GitOps工作流的兴起，GitOps工作流使管理和部署应用程序变得像签入代码一样简单。InfluxDB 2.0旨在利用InfluxDB堆栈和模板无缝集成到您的GitOps部署策略中。\n使用命令行工具，您可以通过声明性配置和基于GIT的更改管理，快速管理平台中所有资源的状态。这还允许您构建强大的持续集成和部署管道，从而轻松部署(更重要的是回滚)更改。\n该技术支持InfluxDB模板功能，该功能为各种流行技术提供开箱即用的全栈监控。InfluxDB模板是免费使用的，随着希望与他人分享其专业知识的专家的贡献，模板库也在不断增长。您可以利用InfluxDB社区的集体知识，同时保持扩展和定制模板以满足您的确切需求的自由。你觉得你有合适的东西吗？你也可以贡献你的专业知识！\nInfluxDB 2.0允许您自信地部署更改，并站在专家的肩上，使您能够专注于构建应用程序。\n正如我在这篇文章的开头所说的，这个版本代表了我们的工程团队在近两年与我们的社区接触和倾听的过程中所做的大量努力，但这仅仅是个开始。展望未来，你可以期待一些事情。我们计划标准化我们的发布节奏，以便社区知道什么时候可以期待新功能和错误修复。\n我们的InfluxDB开源路线图将开始专注于解锁那些需要在本地部署软件，但继续与InfluxDB平台的其他部分(包括InfluxDB Cloud)协同工作的用例。寻找解锁数据复制和聚合到云的简单方法，以及在边缘接收和分析数据的更多方法。\n我们对开源软件的未来非常兴奋，对帮助我们构建伟大软件的令人惊叹的社区感到谦卑。我们希望你加入我们的旅程，在GitHub上或在我们的社区论坛和Slack上打个招呼。", "note_en": "Today, we are proud to announce that InfluxDB Open Source 2.0 is now generally available for everyone. It’s been a long road, and we couldn’t have done it without the amazing support and contributions of our community. This marks a new era for the InfluxDB platform, but it truly is just the beginning.\n  Before we talk about the future, let’s take a look at some of the amazing new capabilities our team has been working on.\n For those of you who just want to get going, check out our  downloads page for the latest release as well as our getting started and upgrade guides.\n  For anyone familiar with our existing open source offerings (lovingly referred to as the TICK Stack — short for  Telegraf,  InfluxDB,  Chronograf, and  Kapacitor), the first thing you might notice is that there’s only one binary to download and install.\n The new InfluxDB now contains everything you need in a time series data platform in a single binary. This simplifies the deployment and setup experience all while maintaining the power and flexibility of individual components.\n A single binary means it’s also much easier to secure, and so we made InfluxDB secure by default. Every request to InfluxDB is accompanied by an authentication token that can be revoked, and the built in user interface is secured with a username and password.\n With these changes, you never have to worry about accidentally exposing data stored in InfluxDB to the public internet.\n Easy to deploy, simple to manage, secure by default. Developers expect these things from modern development platforms, and InfluxDB is no different.\n  We know how important it is for developers to get hands on with their data as quickly as possible. One thing we heard constantly from our community is that Chronograf, (the “C” of the TICK Stack), made it incredibly easy to quickly see the shape of the time series data coming into the system and simplified a number of common administrative tasks.\n  InfluxDB Open Source 2.0 continues that experience with an all-new  Data Explorer,  additional visualization types, and a powerful new query language called  Flux that’s purposely built for time series data. You can quickly browse through all your measurements, fields, and tags, and apply common transformations to that data without reaching for your keyboard.\n   Of course, for those looking to unlock the full potential of their data, we have included a script editor that includes auto completion, real-time syntax checking, and plenty of examples and documentation to get you started. This editor is used across InfluxDB — Data Explorer,  Dashboards, and  Tasks — and uses  Monaco, the same editor in Visual Studio Code.\n  Wait, but you already have a ton of applications and integrations built on  InfluxQL? Not a problem. InfluxDB 2.0 is designed to be a  drop-in replacement for your existing InfluxDB instances. That means if you are using an external visualization tool for dashboarding, or writing data into the database, it will still work after you upgrade. Of course, we recommend migrating those connections to the latest v2 APIs, but they will continue to work just fine as-is. Backward- compatible APIs are in place to help you move as quickly as you desire.\n  Many users love the simplicity of accessing their data via InfluxQL, our SQL-like query language. As an easy on-ramp to the platform, that was a great place to experience the power of InfluxDB. But, over time, as the complexity of use cases increase beyond something more than a simple select statement, there were challenges. As a result, developers ended up writing custom application logic to do much of the complex transformations often required for modern applications.\n That has a few drawbacks. For one, we want to build a platform that makes developers more productive, and any time spent writing common data transformation logic is time taken away from building value for their own users and customers. The second drawback is performance. The further the data gets from the storage layer, the slower the transformations tend to become.\n Flux at its core is meant to solve those problems. Flux isn’t a SQL-like language; it’s a  functional programming language similar to JavaScript or Python. That means you can customize and structure queries just like programming applications, separating common logic into reusable functions and libraries, reducing the overall amount of code you need to write. That code is also executed as close as possible to the storage layer, pushing down many operations directly, which gives you the fastest possible performance from the system.\n  Flux is also built to work with more than just time series data (although that’s its bread and butter). It can directly pull data from SQL data stores, such as Postgres, Microsoft SQL Server, SQLite, and SAP Hana along with cloud-based data stores like Google Bigtable, Amazon Athena, and Snowflake. This lets you enrich time series data to provide additional context. Here are a few examples:\n For  IoT users, Flux lets you combine time series data from sensors with information from relational tables like manufacturer, model number, device age or mileage.\n For  real user monitoring (RUM), you can use Flux to look up customer IDs and connect customer name, pricing plan, and firmographics like company name and location.\n In  IT infrastructure monitoring, Flux can resolve server IDs to software version and configuration parameters.\n   Flux also lets you  perform geotemporal queries, so you can  filter by both time and location. This is essential for many IoT use cases where you need to track devices or  vehicles that are on the move. For instance, the straightforward Flux query below lets you query all points bounded by the triangle with points at the three coordinates.\n from(bucket: &#34;example-bucket&#34;)\r |&gt; range(start: -1h)\r |&gt; filter(fn: (r) =&gt; r._measurement == &#34;example-measurement&#34;)\r |&gt; geo.filterRows(\r region: {\r points: [\r {lat: 40.671659, lon: -73.936631},\r {lat: 40.706543, lon: -73.749177},\r {lat: 40.791333, lon: -73.880327}\r ]\r }\r )\n   Developers are looking for more than just the ability to query their data. They want to build with it. Flux gives our community the fastest and most powerful way to analyze and build applications with data, and we can’t wait for you to give it a try.\n  Interactively working with your data can provide powerful insights, but in modern systems, those interactive queries account for only a tiny fraction of the overall processing happening. Most of the data flowing into your application is more powerful when combined with other information to produce knowledge about what’s happening. That processing needs to continuously and reliably happen in the background while you focus on leveraging the insights.\n InfluxDB 2.0 contains a powerful new  background processing system called Tasks that are built and executed using the same Flux language used to access data stored within the platform. These Tasks can do a lot of powerful things, including aggregating commonly accessed metrics to improve performance of your dashboards, calculating custom metrics based on data stored in completely different systems, or downsampling your data to save money on long-term storage.\n Tasks can also be leveraged to automatically push data to other systems, which enable notifications or alerting on your data. Because they are based on the Flux language, as we add new libraries, functionality, or tooling, that can be leveraged in Tasks automatically.\n InfluxDB Tasks are similar in concept to Kapacitor (the “K” in TICK). But unlike Kapacitor, which uses a language called TICKscript that’s separate from InfluxQL that’s used in Chronograf, Tasks use Flux. This simplifies life for developers, since they can use one language for both queries in Data Explorer and Dashboards, and data processing in Tasks.\n Tasks are the processing backbone of the platform, and we think you’re going to find some amazing ways to use them.\n  Our motto around the company is that our teams should never have to look at a dashboard to know something is wrong. Monitoring and alerting are crucial to any application platform, and we’re no exception.\n InfluxDB 2.0 includes a powerful monitoring and alerting system that’s based on the same technology as Tasks and Flux. Our native UI provides a way to quickly define threshold and deadman alerts on your data, but if you need more flexibility, you can build your own custom alerting using the underlying Tasks system.\n  Notifications from these alerts can be sent to any number of external systems including PagerDuty, Slack, Microsoft Teams, email, MQTT, or a custom HTTP endpoint (webhook) that you control. We provide an intuitive user interface for defining and managing these alerts, but every bit of functionality offered through the UI is exposed through our API, so you can build automation that works for you.\n  Time is the ultimate scarce resource, and it’s pretty common for developers to constantly balance ease of use with power and flexibility for the future. With InfluxDB 2.0, we wanted to make it dead-simple to get going, but also give our community the confidence that as their use cases evolve and their usage grows, we’ve got you covered.\n Our next-generation platform is built around a single, common API. Whether you’re building an application locally on your laptop, or scaling to millions of users across the globe, the APIs you build your application around are the same.\n That also allows us to provide a powerful set of  command line tools and  language-specific client libraries across 10 languages and SDKs that work across all our products. If you’re building an application, the fastest way to get up and running with InfluxDB is through one of our client libraries.\n  No matter what you’re building now, or what scale you need in the future, you can rest assured that you won’t need to rewrite your application to take advantage of the power of InfluxDB.\n  Kubernetes has taken over the world, and it has brought along with it the rise of  GitOps workflows that make managing and deploying applications as simple as checking in code. InfluxDB 2.0 is designed to integrate seamlessly into your GitOps deployment strategies leveraging  InfluxDB Stacks and  Templates.\n Using the command line tooling, you can quickly manage the state of all resources in the platform, with declarative configurations and git-based change management. This also allows you to build powerful continuous integration and deployment pipelines to make deploying (and more importantly rolling back) changes painless.\n That technology powers the InfluxDB Templates capability which provides out-of-the-box full-stack monitoring for a wide variety of popular technologies. InfluxDB Templates are free to use and the  template gallery continues to grow as contributions are made by experts looking to share their expertise with others. You can tap into the collective knowledge of the InfluxDB community while maintaining the freedom to extend and customize the template to fit your exact needs. Think you’ve got the right stuff? You can  contribute your expertise as well!\n  InfluxDB 2.0 allows you to deploy changes with confidence and stand on the shoulders of experts, allowing you to focus on building your application.\n  As I said in the very beginning of this post, this release represents a lot of hard work by our engineering team across nearly two years of engaging with and listening to our community, but it is only the beginning. Going forward, you can expect a few things. We plan on standardizing our release cadence so that the community knows when to expect new features and bug fixes.\n Our roadmap for InfluxDB Open Source will start to focus on unlocking use cases that require software to be deployed locally but continue to work in conjunction with the other parts of the InfluxDB Platform, including  InfluxDB Cloud. Look for simple ways to unlock data replication and aggregation to the cloud as well as more ways to ingest and analyze data at the edge.\n We are extremely excited about the future of open source software and humbled by our amazing community that helps us build great software. We hope you join us on this journey and come say hello on  GitHub or in our  community forums and  Slack.", "posttime": "2020-11-11 12:03:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,influxdb,数据", "title": "InfluxDB 2.0发布", "title_en": "InfluxDB 2.0 Is Out", "transed": 1, "url": "https://www.influxdata.com/blog/influxdb-2-0-open-source-is-generally-available/", "via": "", "real_tags": ["发布", "influxdb", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034465, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "登录订阅世界商业科技与科学文化新闻极客体育健康辩论文化泰德·克鲁兹(Ted Cruz)设计的社交媒体社交媒体平台泰德·克鲁兹(Ted Cruz)吹嘘自己是言论自由的避风港，显然已经开始封禁账户并删除内容。在过去的几天里，一些推特用户在推特上说，他们已经被逐出了谈话者。从宣布他们已经被启动的帖子来看，至少有一些被禁止的谈话者用户注册了这项服务，似乎正是为了测试这款应用所谓的言论自由政策的局限性。\n一位用户最近在推特上写道，我几乎所有的左翼朋友都加入了parler，与玛加人作对，不到24小时，他们中的每一个人都被禁止了，因为保守派真的热爱言论自由。\n几乎我所有的左翼朋友都加入了parler的行列，和Maga人捣乱，他们中的每一个人在不到24小时内就被禁止了，因为保守派真的很喜欢言论自由。《新闻周刊》订阅优惠--受人尊敬的律师(@Resspectable Law)2020年6月26日，看起来我好像被禁止出言不逊了。花了不到24小时。言论自由应用我的屁股。Pic.twitter.com/mg0LVW3NS1-圣韦恩喷泉(@Williamzabka42)2020年6月27日《新闻周刊》订阅优惠&&gt;好吧，我被禁止进入谈判者--托尔·本森(@Thor_Benson)。德克萨斯州参议员特德·克鲁兹是支持者。\n唐纳德·特朗普总统、他的儿子埃里克·特朗普、鲁迪·朱利安尼和坎迪斯·欧文斯也在使用这项服务。保守派人士一直蜂拥至这个社交媒体平台，尤其是在特朗普总统发布推文之后。\n关于邮寄选票的问题，早在5月份，邮寄选票就被标记为可能会误导人，并被事实核查为潜在的误导性选票。特朗普声称，加州的邮寄投票将导致选举舞弊-推特认为这一说法是错误的。帕勒公司的首席执行官约翰·马茨毫不掩饰对帕勒所谓的缺乏审查的宣传。在6月25日接受CNBC采访时，马策说，这款应用是一个社区城镇广场，一个开放的城镇广场，没有审查制度。他补充说，如果你能在纽约街头说出来，你就可以在谈判厅上说出来。\n马茨还告诉CNBC，他希望在这款应用上能听到一些自由派的声音。正如CNBC所说，他显然悬赏2万美元给任何公开的自由派评论员，有5万名Twitter或Facebook粉丝加入parler。\n马茨告诉该电视台，整个公司从未打算成为支持特朗普的人。很多观众都支持特朗普。我不在乎。我不会以任何一种方式来评判他们。\n我很自豪能加入@™_APP--一个了解言论自由的平台--我很兴奋能成为其中的一部分。让？Euro™‘s来说话吧。让《欧元™》畅所欲言吧。还有，让üuro™‘s结束硅谷的审查制度吧。跟我来，@特德克鲁兹！Pic.twitter.com/pzUFvhiBZ-Ted Cruz(@tedruz)2020年6月25日尽管帕勒被标榜为支持言论自由，但用户协议似乎并非如此。Parker可以随时删除任何内容并终止您对服务的访问，无论原因是什么，尽管Parler努力允许所有合法的、没有侵犯他人合法权利的言论，但Parler声明，它可以随时删除任何内容，并终止您对服务的访问，尽管Parker努力允许所有合法的言论，并且没有侵犯他人的合法权利，但Parker可以随时删除任何内容，并终止您对服务的访问。\n马克·威尔逊/盖蒂用户协议还指出，如果认为有必要，公司可以并将终止你的账户。虽然parator指南为您提供了有关不适当内容的指导，但parator可以自由删除内容并终止您对服务的访问，即使遵循了指南，也是小字说明。\nParler还列出了用户必须遵守的指导原则。不允许发送垃圾邮件；不允许诽谤或勒索；不允许发布支持恐怖组织的帖子；不允许使用斗语或威胁伤害他人；不允许发布宣传大麻的帖子，因为大麻被认为是联邦合法的；不允许发布色情、淫秽或不雅内容。\n请求转载和授权，提交更正或查看编辑指南由威尔·张伯伦VS马修·费尼与我们的前5篇文章开始您的一天无限30天广告免费试用订阅现在注册到我们的每日通讯，更多的文章像这样+访问额外的5篇文章不需要订阅。选择订阅订阅获取免费试用时事通讯©2020新闻周刊数字有限责任公司版本：U.S.Edition日本巴基斯坦Polska Románia关于我们更正联系我们联系我们编辑指南广告版权条款和条件隐私政策饼干政策销售档案公告条款", "note_en": "LOGIN Subscribe               World  Business  Tech &amp; Science  Culture  Newsgeek  Sports  Health  The Debate  Vantage  Weather                   By                        Culture  Ted Cruz  Social media  , the social media platform that boasts about being a haven for &#34;free speech,&#34; has apparently started to ban accounts and remove content. Over the past few days, several Twitter users have tweeted that they&#39;ve been kicked off of Parler. Judging from the posts announcing that they&#39;ve been booted, at least some of the banned Parler users seem to have signed up for the service precisely to test the limits of the app&#39;s so-called &#34;freedom of speech&#34; policy.\n &#34;Pretty much all of my leftist friends joined Parler to screw with MAGA folks, and every last one of them was banned in less than 24 hours because conservatives truly love free speech,&#34; one user recently wrote on Twitter.\n     Pretty much all of my leftist friends joined Parler to screw with MAGA folks, and every last one of them was banned in less than 24 hours because conservatives truly love free speech.  Newsweek subscription offers &gt;— Respectable Lawyer (@RespectableLaw)  June 26, 2020     Looks like I got banned from Parler. Took less than 24 hours. Free speech app my ass.  pic.twitter.com/mg0LVW3NS1— Fountains of Holy Wayne (@williamzabka42)  June 27, 2020  Newsweek subscription offers &gt;     Well I got banned from Parler— Thor Benson (@thor_benson)  June 27, 2020     iâ€™ve been banned from parler ðŸ™„ðŸ™„ what happened to freedom of speech  pic.twitter.com/FXabyMyqqZ— jaxsenðŸ§\u008dâ€\u008dâ™‚ï¸\u008fðŸ\u0090• (@tittyinmymouth)  June 27, 2020 Launched in 2018, Parler presents itself as &#34;an unbiased&#34; social media platform, and is generally understood to be a conservative alternative to Twitter.  Texas Senator Ted Cruz is a booster\n of the service, which is also used by President Donald Trump, his son Eric Trump, Rudy Giuliani and Candace Owens. Conservatives have been flocking to the social media platform, especially after  President Trump had tweets\n about mail-in ballots flagged and fact-checked as &#34;potentially misleading,&#34; back in May. Trump alleged that mail-in voting in California would lead to electoral fraud—a claim that was deemed false by Twitter. Parler&#39;s CEO, John Matze, hasn&#39;t been shy about promoting Parler&#39;s supposed lack of censorship. In a June 25 interview with CNBC, Matze, said that the app is &#34;a community town square, an open town square, with no censorship.&#34; He added, &#34;If you can say it on the street of New York, you can say it on Parler.&#34;\n Matze also told CNBC that he&#39;s hoping to get some liberal voices on the app. He&#39;s apparently offering a $20,000 reward to any &#34;openly liberal pundit,&#34; as CNBC put it, with 50,000 Twitter or Facebook followers to join Parler.\n &#34;The whole company was never intended to be a pro-Trump thing,&#34; Matze told the TV network. &#34;A lot of the audience is pro-Trump. I don&#39;t care. I&#39;m not judging them either way.&#34;\n     Iâ€™m proud to join  @parler_app -- a platform gets what free speech is all about -- and Iâ€™m excited to be a part of it. Letâ€™s speak. Letâ€™s speak freely. And letâ€™s end the Silicon Valley censorship. Follow me there  @tedcruz!  pic.twitter.com/pzUFvhipBZ— Ted Cruz (@tedcruz)  June 25, 2020 Although Parler is billed as supporting free speech, the User Agreement seems to say otherwise. &#34;Parler may remove any content and terminate your access to the Services at any time and for any reason or no reason, although Parler endeavors to allow all free speech that is lawful and does not infringe the legal rights of others,&#34; it states.\n                Mark Wilson/Getty The User Agreement also notes that the company can and will discontinue your account if it&#39;s deemed necessary. &#34;Although the Parler Guidelines provide guidance to you regarding content that is not appropriate, Parler is free to remove content and terminate your access to the Services even where the Guidelines have been followed,&#34; the fine print notes.\n Parler also has a list of guidelines that its users must abide by. There is no spam allowed; no defamation or blackmailing; no posts supporting terrorist organizations; no &#34;fighting words&#34; or threatening to harm others; no posts promoting marijuana since it&#39;s considered &#34;federally legal&#34;; and no pornography, obscenity or indecency.\n        Request Reprint &amp; Licensing,   Submit Correction or  view Editorial Guidelines                                ByWill Chamberlain  VS           ByMatthew Feeney     Start your day with our top 5 articles          Unlimited 30 Day Ad Free Trial Subscribe Now   Sign-up to our daily newsletter for more articles like this + access to 5 extra articles       No subscription required.                                             Choose your subscription         SUBSCRIBE        Get your free trial  Newsletter                          © 2020 NEWSWEEK DIGITAL LLC         Editions:   U.S. Edition  日本  Pakistan  Polska  România    About Us  Corrections  Contact Us  Editorial Guidelines  Advertise  Copyright  Terms &amp; Conditions  Privacy Policy  Cookie Policy  Terms of Sale  Archive  Announcements", "posttime": "2020-11-11 11:49:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,ted,订阅", "title": "泰德·克鲁兹(Ted Cruz)批准的“言论自由”应用程序Parler已经开始禁止用户使用", "title_en": "Parler, the Ted Cruz-Approved 'Free Speech' App, Is Already Banning Users", "transed": 1, "url": "https://www.newsweek.com/parler-ted-cruz-approved-free-speech-app-already-banning-users-1514358", "via": "", "real_tags": ["程序", "ted", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "7e3abe61c819a969dfcdc0d97a1fdfc9.jpeg", "infoid": 1034461, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在选举日之前的几个月里，民调机构把选民放在显微镜下，分析电话调查的数据和过去的投票趋势，以确定可能的结果。到了周二晚上，随着结果与预测背道而驰，轮到民调专家们在显微镜下观察了。\n不过，还有其他评估情绪的方法。一些技术专家表示，越来越多的公司使用人工智能来衡量客户情绪，人工智能可能会为更好地理解选民带来希望。\n西雅图非营利性研究中心艾伦人工智能研究所(Allen Institute For AI)的首席执行官奥伦·埃齐奥尼(Oren Etzioni)说，“我不会解雇民意调查人员，但我会指示他们在工作中更多地利用机器学习、数据挖掘和人工智能，以获得更好的预测。”\n随着计票工作的继续，今年民调误差的大小仍不得而知。但民调普遍预测民主党会明显获胜，而不是扣人心弦。\n总部位于纽约、为销售团队提供人工智能和预测技术的Collective[i]公司董事长海蒂·梅塞尔(Heidi Messer)表示：没有人或算法可以一直准确预测人类行为。但传统民调的问题是，民调机构使用的名称是基于历史分类和平均值的。\n民调将需要找到一个能像亚马逊(Amazon.com)等科技公司那样捕捉实际行为的数据源。她说：“亚马逊的算法不在乎我是人还是狗，它只知道如果我买了一条皮带，我很可能会买狗粮。”\n她补充说：“收集反映行为的数据要困难得多，但在动态识别支持概率预测的模式和相关性方面，这些数据要有用得多。”\n专门从事自然语言处理的意大利软件公司Expert.ai将其技术应用于候选人周围数百万个社交帖子。它的人工智能系统在一定程度上是根据过去的选举进行培训的，分析语气和情绪等因素，并预测这些因素可能如何转化为选票。\nExpert.ai的系统预测民主党总统候选人乔·拜登(Joe Biden)将赢得50.2%的普选，共和党总统唐纳德·特朗普(Donald Trump)将获得47.3%的选票，差距为2.9个百分点。截至周五下午，拜登的普选得票率为50.5%，特朗普为47.8%，差距为2.7个百分点。(《华尔街日报》的出版商道琼斯公司(Dow Jones&Amp；Co.)是Expert.ai的客户。)。\n另一家总部位于加利福尼亚州圣路易斯奥比斯波(San Luis Obispo)的公司UnAnimous.ai销售所谓的群智软件。它使用人工智能模型来汇总来自一群人的预测和决策，比如预测大宗商品价格的投资者。\n首席执行长罗森博格(Louis Rosenberg)说，他的团队9月份使用该软件对美国50人进行了现场调查，要求他们预测他们认为谁会在11个关键州的总统竞选中获胜，以及以多大的优势获胜。\n截至周日下午，9月份的调查准确预测了美联社(Associated Press)所称的10个关键州的总统选举获胜者。它正在正确预测最终的北卡罗来纳州。这项调查还普遍预测了哪一场比赛会更激烈。\nUnAnimous.ai的实时调查可以让用户实时看到其他参与者的选择，机器学习算法可以根据答案变化等因素来评估谁对自己的预测最有信心。最自信的答案对最终汇总答案的影响最大。\n罗森博格博士说，“我们的数据是随机挑选的50名选民，然后用一群人来放大他们的智力；这不是10万个民意调查样本。”“我们一次又一次地看到，我们的表现超过了真正规模巨大的民调。”\n由人工智能消费者市场研究公司Advanced Symbolics Inc.开发的Polly已经成功预测了大约20次选举和全民公投，其中包括英国退出欧盟。\nASI预测拜登将获胜。然而，这让他拿下了佛罗里达州，并以372票对166票赢得了选举人票。美联社称佛罗里达州支持特朗普，到目前为止美联社的选举人票总数已经非常接近，但他们确实有拜登的领先优势。\nASI联合创始人、该公司首席科学家肯顿·怀特(Kenton White)说：“我们这次搞错了。”\n为了做出选举预测，ASI使用机器学习来跟踪和分析Facebook和Twitter等主要社交媒体网站上正在讨论的与选举相关的话题。该公司从这些网站收集公共数据，以得出代表美国人口的用户样本。\n波莉还利用过去选举的数据，观察人们过去的帖子与之前的选票是如何匹配的，以预测民众在即将到来的选举中可能会走哪条路。例如，它可能会看到，在过去的选举中，那些谈论把就业机会带回美国的人倾向于共和党人，而那些谈论全球变暖问题的人倾向于民主党人。\nASI联合创始人兼首席执行官艾琳·凯利(Erin Kelly)表示，使用人工智能预测选举仍是一种相对年轻的做法。人工智能的优势之一是模型可以学习，而且随着时间的推移往往会变得更好。\n她说，对波莉来说，今年的选举“是一次学习的经历”。\n在2020年11月9日的印刷版上，人工智能为民意调查提供了帮助。", "note_en": "In the months leading up to Election Day, pollsters placed voters under the microscope, parsing data from telephone surveys and past voting trends to determine probable outcomes. By Tuesday evening, as results  veered from predictions, it was the pollsters’ turn under the microscope.\n  There are alternative ways of assessing sentiment, though. Some technology experts say artificial intelligence, used increasingly by companies to gauge customer sentiment, could hold promise for better understanding the electorate.\n  “I wouldn’t fire the pollsters, but I would direct them to try to leverage machine learning, data mining and AI in their work more to get better projections,” said Oren Etzioni, chief executive of the Allen Institute for AI, a nonprofit research center in Seattle.\n  The size of this year’s polling error is still unknown as the vote count continues. But polls generally predicted clear Democratic gains, not cliffhangers.\n    No person or algorithm can predict human behavior accurately all the time, said Heidi Messer, chairman of New York-based Collective[i], which offers AI and predictive technologies for sales teams. But the problem with traditional polls is that the designations pollsters use are based on historical classifications and averages.\n  Polling will need to find a data source that captures actual behavior the way tech firms such as  Amazon.com  do. “Amazon’s algorithm doesn’t care if I’m a person or a dog, it just knows that if I buy a leash, I’m likely to buy kibble,” she said.\n  She added: “Data reflecting behavior is much harder to amass but infinitely more useful in dynamically identifying the patterns and correlations that fuel probabilistic predictions.”\n    Expert.ai, an Italian software company specializing in natural-language processing, applied its technology to millions of social posts around the candidates. Its AI system, trained partly on past elections, analyzed factors such as tone and emotion and projected how that might translate into votes.\n  Expert.ai’s system projected that Democratic presidential nominee Joe Biden would win 50.2% of the popular vote and Republican President Donald Trump would get 47.3% of the vote, a 2.9 percentage-point margin. As of Friday afternoon, Mr. Biden had 50.5% of the popular vote compared with Mr. Trump’s 47.8%, a 2.7 percentage-point margin. (Dow Jones &amp; Co., which publishes The Wall Street Journal, is an Expert.ai customer.)\n    Another company, San Luis Obispo, Calif.-based Unanimous.ai, sells what is known as swarm-intelligence software. It uses AI models to aggregate predictions and decisions from groups of people, such as investors predicting commodity prices.\n  Chief Executive Louis Rosenberg said his team used the software to run a live survey of 50 people in the U.S. in September, asking them to predict who they thought would win the presidential contest in 11 battleground states and by what margin.\n  As of Sunday afternoon, that September survey had correctly predicted the winner of the presidential vote in 10 battleground state races as called by the Associated Press. It is on track to correctly predict the final state, North Carolina. The survey also generally predicted which of the races would be tighter.\n  Unanimous.ai’s live survey allows users to see what other participants are choosing in real time, and machine-learning algorithms assess who has the most confidence in their predictions, based on factors such as answer changes. The most confident answers have the greatest influence on the final aggregated answer.\n  “Our data was 50 randomly selected voters and then the use of a swarm to amplify their intelligence; it wasn’t 100,000 poll samples,” Dr. Rosenberg said. “Again and again, we see that we’re able to outperform really huge polls.”\n    Polly, developed by AI consumer market research company Advanced Symbolics Inc., had successfully predicted some 20 elections and referendums, including the withdrawal of the U.K. from the European Union.\n  ASI predicted Mr. Biden would win. However, it had him taking Florida and winning the electoral vote 372 to 166. The AP has called Florida for Mr. Trump and the AP’s electoral vote totals so far are much closer, but they do have Mr. Biden in the lead.\n  “We got this one wrong,” said Kenton White, an ASI co-founder and the company’s chief scientist.\n    To make election predictions, ASI uses machine learning to track and analyze election-related topics being discussed on major social media sites, such as  Facebook  and  Twitter  The company harvests public data from the sites to come up with a sample of users that represent the U.S. population.\n  Polly also taps data on past elections and looks at how people’s posts in the past matched up against previous votes to make a prediction on which way a population might go in an upcoming election. For instance, it might see that people in past elections who talked about bringing jobs back to America leaned Republican and those talking about global warming leaned Democrat.\n  Erin Kelly, ASI’s co-founder and chief executive officer, says using AI to predict an election is still a relatively young practice. And one of the strengths of AI is that models can learn and tend to get better over time.\n  For Polly, she said, this year’s election “is a learning experience.”\n  Appeared in the November 9, 2020, print edition as &#39;Artificial Intelligence Offers a Hand for Polls.&#39;", "posttime": "2020-11-11 11:39:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,显示,intelligence,预测", "title": "人工智能显示出衡量选民情绪的潜力", "title_en": "Artificial Intelligence Shows Potential to Gauge Voter Sentiment", "transed": 1, "url": "https://www.wsj.com/articles/artificial-intelligence-shows-potential-to-gauge-voter-sentiment-11604704009", "via": "", "real_tags": ["人工智能", "显示", "预测"]}]