[{"category": "", "categoryclass": "", "imagename": "0098837bd52b695f3262aa72d5409ae5.jpg", "infoid": 1069056, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个代表迪斯尼、维亚康姆哥伦比亚广播公司、NBCUniversal、福克斯公司和其他媒体巨头的贸易组织正在呼吁该组织签署衡量电视收视率的方法，以取消认证，这是在媒体机构和广告商支持他们正在争先恐后地想出如何在越来越笨拙的新娱乐场所、数字行为和屏幕上计算观众的眼球。周三，VAB 贸易组织向媒体评级委员会发送了一封长达 10 页的信函，敦促该组织取消对尼尔森评级的支持，理由是尼尔森在冠状病毒大流行期间计算收视率的能力减弱。 VAB 在信中说：“尼尔森作为评级服务在 COVID 期间的行为至少违反了五项最低标准，对其最大的订户客户造成的损害仍然对 2021 年 7 月造成重大负面影响。” MRC 首席执行官乔治·艾维 (George Ivie) 表示，他的团队确实收到了这封信，并正在考虑下一步行动。 “VAB 是我们组织的成员，”他在周三的简短电话采访中说，他们的担忧“我们非常重视，但我们有一个独立的程序来执行。”在 1950 年代电视问答节目丑闻之后，在美国政府的要求下成立的 MRC 对衡量媒体的公司进行审计，以确定它们是否符合行业标准。如果 VAB 的努力取得成功，尼尔森仍将能够衡量观众，网络和广告商可以继续使用该信息。但这会让尼尔森的工作蒙上阴影，VAB 的首席执行官在接受采访时说。 “它失去了认可的毯子，失去了它是黄金标准的想法，”他说。在这种情况下，电视网络和媒体机构可能会更放心地使用在数字观看为麦迪逊大道产生大量新消费者数据的时代越来越受欢迎的其他观众衡量标准。几年来，广告商开始在与电视网络的广告交易中使用其他标准，例如决定特定的销售水平、网站访问量或对优惠的响应。 VAB 的要求是尼尔森与电视网络之间不断扩大的战斗中的最新一波，这些网络依靠其措施作为广告交易的货币。网络声称尼尔森在冠状病毒大流行期间改变了协议，导致过去一年电视观众人数不足。这些网络表示，尼尔森阻止现场代理在参与尼尔森测量过程的观众的个人房屋中维护技术，同时将其所有者因大流行状况而搬迁的房屋包括在其面板中。虽然尼尔森已承诺纠正此事，但网络并未满意。 5 月份，MRC 确定 Nielsen 可能在今年 2 月份低估了电视观众。尼尔森在一份声明中说：“我们完全致力于恢复 COVID 之前的运营，并与 MRC 密切合作并通过 MRC 解决任何悬而未决的问题和要求，并致力于他们的认证流程。”但坎宁安说，VAB 认为尼尔森不愿意使其最近的努力更加透明。他说，这些网络“没有任何程度的披露”。对 MRC 的呼吁“我认为是唯一的前进道路，”坎宁安说，他希望“在市场层面”的高管们看到“全国委员会处于年久失修的状态，需要大量工作来恢复市场信心。 &#39;\n随着越来越多的消费者从线性电视体验转向使用他们最喜欢的流媒体渠道进行点播狂欢，衡量观众已成为一项越来越艰巨的任务。随着媒体和流媒体公司将观看模式的披露降至最低，这项工作只会变得更加困难。对此，媒体巨头的补救措施是将新技术拼凑起来，以显示随着电视迷从一个屏幕移动到另一个屏幕，他们可以真正积累多少观众。越来越多的数据工具——机顶盒模式、购物行为和网络跟踪——使许多网络能够构建专有的测量产品，让 AT&amp;T、百事可乐和通用汽车等广告商找到最有可能的客户，无论他们是高收入的技术爱好者、爱喝汽水的人，还是首次购车者。然而，由于每家媒体公司都制定了自己的系统，麦迪逊大道担心建立在尼尔森评级之上的行业统一结构正在崩溃。", "note_en": "A trade organization representing Disney, ViacomCBS, NBCUniversal, Fox Corp. and other media giants is calling for the organization that signs off on  ’s methodology for measuring TV viewership to yank accreditation, an aggressive maneuver in an era when media outlets and the advertisers who support them are scrambling to figure out how to count viewer eyeballs across an increasingly unwieldy array of new entertainment venues, digital behaviors and screens.\n The trade group, the VAB, on Wednesday sent a ten-page letter to the Media Rating Council urging the group to pull its backing of Nielsen’s ratings, citing Nielsen’s diminished ability to count viewership during the coronavirus pandemic. “Nielsen’s COVID-period conduct as a ratings service violated at least five minimum standards,” the VAB said in its letter, “with the damage done to their largest subscriber clients still creating material negative impact into July 2021.”\n  George Ivie, CEO of the MRC, said his group had indeed received the letter and is mulling next steps. “The VAB are members of our organization,” he said in a brief phone interview Wednesday, and their concerns “are something we take very seriously, but we have an independent process to execute.” Formed at the behest of the U.S. government in the wake of TV’s quiz-show scandals of the 1950s, the MRC conducts audits of companies that measure media to determine whether they are in compliance with industry standards.\n If the VAB is successful in its effort, Nielsen would still be able to measure viewers and the networks and advertisers could continue to use that information. But it would put Nielsen’s work under a cloud of sorts, says  , CEO of the VAB, in an interivew. “It loses the blanket of accreditation, of the idea that it’s the gold standard,” he said. Under such circumstances, TV networks and media agencies might feel more comfortable using other audience measures that are gaining popularity in an era when digital viewing generates reams of new consumer data for Madison Avenue. Advertisers have for several years started to use other criteria in ad deals with TV networks, like deciding upon certain levels of sales, visits to websites or responses to offers.\n The VAB demands are the latest salvo in an expanding battle  between Nielsen and the TV networks that rely on its measures as the currency for advertising deals. The networks allege Nielsen changed protocols during the coronavirus pandemic that resulted in undercounting of the TV audience over the past year. The networks say Nielsen kept field agents from maintaining technology in individual homes of viewers who take part in Nielsen’s measurement process and, while including homes in its panel whose owners had relocated owing to pandemic conditions. While Nielsen has pledged to rectify the matter, the networks have not been satisfied.  In May, the MRC determined Nielsen likely undercounted TV audiences in February of this year.\n  “We are fully committed to returning to pre-COVID operations and are working closely with and through the MRC to address any outstanding issues and requests and are committed to their process concerning accreditation,” Nielsen said in a statement.\n But the VAB believes Nielsen has not been willing to make its recent efforts more transparent, said Cunningham. He said the networks have seen a “lack of any level of disclosure.” The call to the MRC “I think is the only path forward,” said Cunningham, who wants executives “at a marketplace level” to see “that the national panel is in a state of disrepair and needs significant work to gain back market confidence.’\n Measuring viewers has become an increasingly tough task as more consumers migrate from linear TV experiences to on-demand binge sessions with their favorite streaming outlet. As media and streaming companies keep disclosure of viewing patterns to a minimum, the job has only grown more difficult. The remedy for this has been for media giants  to cobble together new techniques that show how much viewership they can really accumulate as TV fans move from one screen to another. A growing phalanx of data tools — set-top box patterns, shopping behavior, and web tracking —  has allowed many of the networks to build proprietary measurement products that let advertisers such as AT&amp;T, Pepsi, and General Motors find pockets of their most likely customers, whether they be high-income technophiles, soda guzzlers, or first-time car buyers. Because each media company has crafted its own system, however, Madison Avenue fears the industry’s unified structure, built atop Nielsen ratings, is crumbling.", "posttime": "2021-07-23 01:34:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "网络,networks,尼尔森", "title": "电视网络想要取消尼尔森认证", "title_en": "TV Networks Want To Yank Nielsen Accreditation", "transed": 1, "url": "https://variety.com/2021/tv/news/tv-networks-nielsen-ratings-suspension-1235024816/", "via": "", "real_tags": ["网络", "networks", "尼尔森"]}, {"category": "", "categoryclass": "", "imagename": "cf7f0dccc682117e34d64fbe14eb7774.png", "infoid": 1069054, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Arm以其核心设计IP而闻名，最终应用于从物联网到智能手机再到服务器的所有领域，Arm现在展示它已经以一种新的形式启用了其关键微控制器之一：该公司不是使用硅作为基础，而是启用了一个塑料处理器核心。这项技术已经投入使用了近十年，但 Arm 一直在等待制造方法来创建一个完全工作的核心。现在，该公司已经在有形媒介中开展了一些工作，该研究已发表在《自然》杂志上。 “塑料”或柔性电子产品已经存在了很长时间，通常涉及大而简单的电子流程设计，或基本的 8 位加法器，一直到显示器。我们现在看到的有点不同——今天发布的关键新闻是，Arm 与 PragmatIC 合作，生产了 Arm 最受欢迎的微控制器之一 M0 的全功能非硅版本。这个 M0 核心正好位于 Arm 核心产品堆栈的底部，但极简设计是硅处理器的流行设计，因为它的芯片面积小，并且对简单的微控制器任务有功耗要求。因此，虽然它不会很快为您的下一个大型设备供电，但您拥有的许多集成电子设备可能已经依赖 M0 内核来执行基本控制任务。塑料臂，正如现在所说的，在柔性塑料介质中重新创建 M0 核心。这在两个方面很重要——首先，在硅以外的东西中启用处理器或微控制器的能力将允许在包装、服装、医用绷带等方面实现一定程度的可编程性。例如，与粒子传感器配合使用，它可能允许食品包装确定里面的东西何时因腐败或污染而不再适合人类食用。第二个因素是成本，大规模的灵活处理比等效的硅设计便宜几个数量级。值得称赞的是，据报道，这里的新 M0 设计比当前最先进的塑料计算设计强大 12 倍。在 Arm 的新闻稿中，该公司表示 Plastic M0 设计具有 128 字节的 RAM 和 456 字节的 ROM，同时还支持 32 位 Arm 微体系结构。该处理器由聚酰亚胺基板构成，并通过薄膜金属氧化物晶体管（例如 IGZO TFT）形成。这意味着这在技术上仍然是光刻工艺，使用旋涂和光刻胶技术，最终处理器具有 13 个材料层和 4 个可布线的金属层。然而，自从使用 IGZO 显示器以来，TFT 设计已经很普遍，生产成本仍然很低。该内核支持 ARMv6-M 架构，具有 16 位 Thumb ISA 和 32 位 Thumb 子集。与常规M0一样，数据和地址宽度均为32位，有序设计为2级流水线，内核支持86条指令。与硅 M0 内核的主要区别在于寄存器文件不是在 CPU 内部，而是映射到 128 字节的 DRAM 组。这是因为通过内存映射技术更好地支持 TFT 设计。尽管如此，Plastic M0 内核与所有其他 Cortex M0 内核二进制兼容。\n使用台积电 90nm 工艺的硅 Cortex M0 的典型芯片尺寸为 0.04 mm2，而 PlasticArm 使用等效的 800nm TFT 工艺，核心尺寸为 59.2 平方毫米（7.536 毫米 x 7.856 毫米）。这使得 Plastic M0 内核的大小大约是标准物联网实现的 1500 倍。另一个很大的区别在于频率——研究论文指出，Plastic M0 在 3V 输入下的运行频率约为 20-29 kHz；在 Arms 自己的设计文档中，针对功率而非频率进行优化的 180nm 超低泄漏工艺上的 M0 可以在 50 MHz 下运行。那是 1600-2500 倍的频率差异。 Plastic M0 设计使用 56340 器件，它是 39157 个薄膜 n 型晶体管和 17183 个电阻器的组合。由于此设计的目标是不添加任何物理电阻，因此在层内在 TFT 级别实现电阻的纸质文件涉及使用具有更高电阻的光刻材料以实现更小的尺寸。总体而言，该论文预测了 18334 个 NAND2 门的等效硅设计。塑料 M0 内核在 29 kHz 下的总功率为 21 mW，其中 99% 是静态功率（45% 内核、33% 内存、22% IO）。处理器上的 28 个引脚允许时钟信号生成、复位、GPIO、电源和调试。 Arm 在其新闻稿中表示，生产的主要障碍之一是技术和制造限制——该项目始于 2013 年，甚至在 2015 年的 Arm TechCon 上展示了使用环形振荡器、计数器和移位寄存器阵列的原型电路.然而，许多关键问题仍未解决，主要是现代处理器所有不同组件的单元库，以及工具流程和生产。随着时间的推移，Arm 的合作伙伴 PragmatIC 通过其正在开展的其他项目，能够构建一系列与 M0 处理器所需的单元库一致。据报道，PlasticArm 的第一次制造和验证于 2020 年 10 月进行。Arm 的研究指出，细胞库的生产是未来解锁进一步设计的关键。随着微控制器和处理器变得越来越复杂，需要更多元素（和不同类型）来创建端到端的可用产品。因此，超越 M0 需要研究在 TFT 设计中启用单个库。除此之外，研究论文还指出需要低功耗库来实现规模化。由于塑料 M0 上的大部分功耗是静态功耗，因此通过设计和制造来降低功耗将是一个研究方向。还有制造的角度——这一切都是在使用 200 纳米聚酰亚胺晶片的光刻工艺中使用沉积技术完成的。塑料加工商的最终目标是尺寸不受限制，并且可以使用传统油墨技术“印刷”。我们还没有到那里，但这无疑是朝着这个方向迈出的一步。因此，虽然我们目前还不能购买 Apple M1 内置塑料，但该技术似乎有很大的未来潜力。发表评论 我读了三遍才意识到它可以处理 86 条不同的指令，而不是 x86 指令。我一直在想，这很奇怪，为什么这个超小型处理器支持x86？大声笑，我想知道工程师是否故意这样做。我想知道他们是否可以关闭从宽带或无线电频率捕获能量的天线。回复\n这对于可穿戴设备和智能衣服来说太酷了，他们是否给出了温度规格？回复与灵活的 TEG 相结合，这对于可穿戴体热驱动的传感器或设备来说可能是完美的选择 回复 标准硅 M0 是否足够小以至于它真的不需要灵活？有趣的研究 - 然而，极高的功耗（21mw 与硅 M0 相比是巨大的）和非常低的性能（29kHz 与 50MHz）使这成为一种无法使用的好奇心。为了可用，1mW 或更少的空闲功耗和 1MHz 的速度是最低要求。 （硅 M0 可以管理 11.2 uW/MHz - 这种塑料 M0 需要 724mW/MHz - 效率低 60,000 多倍。）回复它仍然比以前的领先设计好 12 倍，而且仍然便宜得多。您认为这些非常边缘的应用程序需要多少计算量？回复", "note_en": "Known for its core design IP that ends up in everything from IoT to smartphones to servers, Arm is now presenting that it has enabled one of its key microcontrollers in a new form factor: rather than using silicon as a base, the company has enabled a processor core in plastic. The technology has been in the works for almost a decade, but Arm has been waiting on the fabrication methods to create a fully working core. Now the company has something working in a tangible medium and the research has been published in Nature.\n    &#39;Plastic&#39; or flexible electronics have been with us for a long while, and usually involve large yet simple designs for electronics flow, or basic 8-bit adders, all the way up to displays. What we&#39;re seeing now is something a little different - the key news as published today is that Arm, in association with PragmatIC, has produced a fully functional non-silicon version of one of Arm’s most popular microcontrollers, the M0.\n    This M0 core sits right at the bottom of Arm’s core product stack, however the minimalist design is a popular one for silicon processors due to its low die area and power requirements for simple microcontroller tasks. So while it won’t be powering your next big device any time soon, lots of integrated electronics that you own will likely already be relying on M0 cores for fundamental control tasks.\n  PlasticArm, as it is now called, recreates the M0 core in a flexible plastic medium. This is important in two factors – first, the ability to enable processors or microcontrollers in something other than silicon will allow some amount of programmability in packaging, clothing, medical bandages, and others. Paired with a particle sensor, for example, it might allow for food packaging to determine when what is inside is no longer fit for human consumption due to spoilage or contamination. The second factor is cost, with flexible processing at scale being orders of magnitude cheaper than equivalent silicon designs. To Arm’s credit, the new M0 design here is reported to be 12x more powerful than current state-of-the-art plastic compute designs.\n    In Arm’s press release, the company states that the Plastic M0 design has 128 bytes of RAM and 456 bytes of ROM, while also supporting a 32-bit Arm microarchitecture.\n    The processor is built with a polyimide substrate and is formed through thin-film metal-oxide transistors, such as IGZO TFTs. This means that this is still technically a photolithography process, using spin-coating and photoresist techniques, ending up with the processor having 13 material layers and 4 routable metal layers. However as TFT designs have been widespread since the use of IGZO displays, the cost of production is still quite low.\n    The core supports the ARMv6-M architecture, with a 16-bit Thumb ISA combined with a sub-set of 32-bit Thumb. As with the regular M0, data and address widths are 32-bit, the in-order design is a 2-stage pipeline, and the core supports 86 instructions. The main difference to a silicon M0 core is that the register file, rather than being inside the CPU, is mapped to the 128-byte bank of DRAM. This is because the TFT design is better supported through a memory mapping technique. Despite this, the Plastic M0 core is binary compatible with all other Cortex M0 cores.\n    A typical die size for a silicon Cortex M0 using TSMC’s 90nm process is 0.04 mm2, whereas PlasticArm is using an equivalent 800nm TFT process and the core size is 59.2 square millimeters (7.536 mm x 7.856 mm). This makes the Plastic M0 core about 1500x the size of a standard IoT implementation. The other big difference is in frequency – the research paper states that the Plastic M0 runs at around 20-29 kilohertz with a 3V input; an M0 on a 180nm Ultra-Low Leakage process optimized for power rather than frequency, in Arms own design documents, can run at 50 MHz. That’s a 1600-2500x difference in frequency.\n    The Plastic M0 design uses 56340 devices, which is a mix of 39157 thin-film n-type transistors and 17183 resistors. Because the goal of this design was to not have any physically added resistors, the paper documents that implementing resistors at a TFT level within the layers involves using photolithography materials with higher resistance to enable a smaller size. Overall the paper predicts an equivalent silicon design of 18334 NAND2 gates. Overall power for the Plastic M0 core at 29 kHz is listed at 21 mW, 99% of which is static power (45% core, 33% memory, 22% IO). The 28 pins on the processor allow for clock signal generation, reset, GPIO, power, and debug.\n    In its press release, Arm states that one of the main barriers to production was down to technology and fabrication limitations – the project started in 2013 and even a prototype circuit was shown at Arm TechCon in 2015 using ring oscillators, counters, and shift register arrays. However a number of key questions were still left unsolved, mostly down to cell libraries for all the different components of a modern processor, along with tool flow and production. Over time Arm’s partner PragmatIC, through other projects it was working on, was able to build a range of cell libraries congruent with what was needed for an M0 processor. The first PlasticArm manufacture and validation was reportedly performed in October 2020.\n  Arm’s research points to cell library production being a key to unlocking further designs in the future. As microcontrollers and processors get more complex more elements (and different types) are needed to create an end-to-end useable product. Going beyond M0 thus requires research into enabling individual libraries in a TFT design. Beyond this, the research paper also states that low-power libraries are needed to enable scale. Because most of the power consumption on Plastic M0 is static power, driving that down through design and manufacturing is going to be a direction of research. There is also the angle of manufacturing – this was all done on a photolithography process using 200nm polyimide wafers using deposition techniques. An ultimate goal of plastic processors is that size is less of a limitation, and they can be ‘printed’ using conventional ink techniques. We’re not there yet, but this is certainly a step in that direction.\n  So while we can’t buy an Apple M1 built-in plastic just yet, there seems to be plenty of future potential in the technology.\n  POST A COMMENT      Took me three reads to realize it can process 86 different instructions, and not x86 instructions. I kept thinking, that’s weird, why does this super small processor support x86? Lol, I wonder if the engineers did this purposely.   Reply\n  I wonder if they could power this off an antenna that captures the energy from broadband or radio frequencies.  Reply\n    this is so cool for wearables and smart clothes, did they give a temperature spec?  Reply\n  combined with flexible TEGs this could be perfect for wearable body heat powered sensors or devices  Reply\n  isn’t the standard silicon M0 tiny enough that it doesn’t really need to be flexible?  Reply\n  Interesting research - however the extremely high power consumption (21mw is huge compared to silicon M0) and very low performance (29kHz vs 50MHz) relegates this to an unusable curiosity.  To be usable an idle power consumption of 1mW or less and a 1MHz speed are minimum requirements. (Silicon M0 can manage with 11.2 uW/MHz - this plastic M0 needs 724mW/MHz - over 60,000 times less efficient.)  Reply\n  it&#39;s still 12x better than the previous leading design, and still much cheaper. How much compute do you think you need for these very far edge applications?  Reply", "posttime": "2021-07-23 01:33:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "获得,cpu,m0", "title": "PlasticArm：获得您的下一个 CPU，无硅制造", "title_en": "PlasticArm: Get Your Next CPU, Made Without Silicon", "transed": 1, "url": "https://www.anandtech.com/show/16837/plasticarm-get-your-next-cpu-without-silicon", "via": "", "real_tags": ["获得", "cpu", "m0"]}, {"category": "", "categoryclass": "", "imagename": "302be4c2fc868efab6972838394a7716.jpg", "infoid": 1069053, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在沙特首都利雅得以北的沙丘上，夕阳西下，派对开始了。女孩们扔掉她们的长袍，在公共场合包裹她们的黑色裹尸布，开始和男孩们一起跳电子音乐。几瓶酒，但大多数人更喜欢 Captagon 药丸，现在海湾地区最受欢迎的药物，每支 25 美元。在药丸上压印的两个字母“c”（代表 Captagon）之后，他们将其称为 Abu Hilalain（两个半月之父）。作为安非他明家族的一员，它可以产生与伟哥相似的效果——并征服睡眠。 “只要一颗药丸，”一个狂欢者说，“我们可以整个周末跳舞。”尽管沙特统治者十年来一直反对叙利亚政权，但年轻人的药丸正在为其提供资金。对于叙利亚总统巴沙尔·阿萨德来说，这种药物已成为一种福音——至少在短期内是这样。他的国家已成为世界上 Captagon 的主要推动者。随着正规经济在战争、制裁和阿萨德掠夺性统治的重压下崩溃，毒品已成为叙利亚的主要出口商品和硬通货来源。总部位于塞浦路斯的咨询公司运营分析与研究中心 (COAR) 估计，去年其他地方的当局查获了街头价值不少于 34 亿美元的叙利亚毒品。相比之下，叙利亚最大的合法出口橄榄油每年价值约 122 美元。伊恩·拉尔森（Ian Larson）最近为 COAR 撰写了一份关于该主题的报告，他说，这种药物正在为中央政府提供资金。叙利亚长期以来一直参与毒品活动。 1990 年代，当它统治黎巴嫩时，贝卡山谷是该地区大麻的主要来源。但叙利亚境内的大规模毒品生产仅在 2011 年内战爆发后才开始。军官们给他们的手下喂食“勇气上尉”，他们称之为 Captagon。来自阿富汗和黎巴嫩的什叶派战士前来支持叙利亚政权，他们带来了制造和贩卖毒品的技能。黎巴嫩最大的什叶派民兵真主党为阿萨德政权提供了重要支持，它在叙利亚卡拉蒙山脉的边境获得了大片土地。他们扩大了大麻种植并发展了新的家庭手工业，制造 Captagon 药丸。由于战争、经济制裁和政权内部的腐败，叙利亚在 2013 年左右开始出口它们，因为其正规经济萎缩。阿勒颇市和霍姆斯市的化工厂已改建成药厂。在海湾地区，药丸的加价可能是叙利亚的 50 倍。走私者将它们藏在纸卷、镶木地板甚至石榴的货物中。沙特王子使用私人飞机将这些东西运进来。警方在外国水域的缉获证明了交易的规模。意大利警方去年在一艘船上发现了 8400 万颗药丸，价值超过 10 亿欧元。据说这是世界上最大的安非他明相关毒品截获事件。 5 月，马来西亚当局根据沙特的提示采取行动，缴获了 9500 万粒药丸。利比亚班加西港与叙利亚的定期航线相连，据说是一个重要的转口港。阿萨德坚称他们没有参与。 “宣传”，首都大马士革的经济学家沙迪·艾哈迈德 (Shadi al-Ahmad) 说，他忠于政权。但因为阿萨德先生发现难以支付他的军队费用，他将他的国家大部分地区耕种给监督走私活动的军阀。据称，由总统的弟弟马希尔·阿萨德 (Maher al-Assad) 指挥的陆军第四师将大幅裁员。其他关系在拉塔基亚和塔尔图斯的地中海港口开展业务。一名与真主党关系密切并被国际刑警通缉的黎巴嫩毒贩在 Facebook 上吹嘘自己与阿萨德和真主党高级神职人员的关系。 “它失控了，”大马士革的一位内部人士说。该政权可能将 Captagon 视为地区权力斗争的杠杆。它“使用毒品作为对抗海湾地区的武器”，与反对派关系密切的叙利亚观察员马利克·阿卜杜勒 (Malik al-Abdeh) 说。 “要传达的信息是：使关系正常化，否则我们将毁掉你的青春。”\n无论如何，该政权的支持者并不是唯一参与其中的人。控制伊拉克东北部与土耳其边界的库尔德人借鉴了库尔德工人党的经验，该党经营穿越山区通往欧洲的路线。叙利亚北部受土耳其保护的逊尼派叙利亚叛军也参与其中。向南通过约旦到沙特阿拉伯的路线越来越繁忙。 “所有民兵都从走私毒品中获得收入，”叙利亚南部的一位部落首领说。他说，南部民兵帮助数千名难民越过边界进入约旦，他们的背包里装满了药丸。对于留下来的叙利亚人来说，毒品可能会摧毁十年内战后的社会残余。 “没有被杀害、流放或监禁的年轻人都是瘾君子，”南部阿萨德控制的城市 Sweida 的一名社会工作者说。最近对北部叙利亚人的一项调查发现，今年 1 月，33% 的人表示他们认识吸毒者。这比 2019 年的 7% 有所增加。 这种习惯如此普遍，以至于在今年 4 月和 5 月的斋月期间，国家电视台的黄金时段连续剧是“热盘”，描绘了一个毒贩家庭。这篇文章出现在印刷版的中东和非洲部分，标题为“地中海上的毒品国家”", "note_en": "IN THE DUNES north of Riyadh, the Saudi capital, the sun sets and the party begins. Girls discard their  abayas, the black shrouds that envelop them in public, and begin jiving to techno music with boys. A few swig from bottles, but most prefer Captagon pills, nowadays the Gulf’s favourite drug, at $25 a pop. They call it Abu Hilalain (Father of Two Half-moons), after the two letter “c”s (for Captagon) embossed on the pills. Part of the amphetamine family, it can have a similar effect to Viagra—and conquers sleep. “With one pill,” says a raver, “we can dance all weekend.”\n Though Saudi rulers have opposed the regime in Syria for a decade, the pill-popping by young people is funding it. For Syria’s president, Bashar al-Assad, the drug has become a boon—at least in the short run. His country has become the world’s prime pusher of Captagon. As the formal economy collapses under the  burden of war, sanctions and the predatory rule of the Assads, the drug has become Syria’s main export and source of hard currency. The Centre for Operational Analysis and Research (COAR), a Cyprus-based consultancy, reckons that last year authorities elsewhere seized Syrian drugs with a street value of no less than $3.4bn. That compares with Syria’s largest legal export, olive oil, which is worth some $122m a year. The drug is financing the central government, says Ian Larson, who wrote a recent report on the subject for COAR.\n  Syria has long been involved in drugs. In the 1990s, when it ruled Lebanon, the Bekaa valley was the region’s main source of hashish. But mass production of drugs within Syria began only after the civil war erupted in 2011. Officers fed their men “Captain Courage”, as they called Captagon. Shia fighters from Afghanistan and Lebanon, who came to support the Syrian regime, brought their skills in making and trafficking drugs. Hizbullah, Lebanon’s biggest Shia militia, which has given crucial support to the Assad regime, acquired large tracts across the border in Syria’s Qalamoun mountains. They expanded hashish cultivation and developed a new cottage industry, making Captagon pills.\n Syria began exporting them in about 2013, as its formal economy shrivelled, thanks to war, economic sanctions and corruption within the regime. Chemical plants in the cities of Aleppo and Homs have been converted into pill factories. In the Gulf the mark-up for pills can be 50 times their cost in Syria. Smugglers hide them in shipments of paper rolls, parquet flooring and even pomegranates. Saudi princes use private jets to bring the stuff in.\n Seizures by police in foreign waters testify to the size of the trade. Italian police last year uncovered 84m pills worth over €1bn on a single ship. It was then said to be the world’s biggest interception of amphetamine-related drugs. In May the Malaysian authorities, acting on a Saudi tip-off, seized 95m pills. The Libyan port of Benghazi, linked by a regular shipping route to Syria, is said to be a key entrepot.\n The Assads insist they are not involved. “Propaganda”, says Shadi al-Ahmad, an economist in Damascus, the capital, who is loyal to the regime. But because Mr Assad finds it hard to pay his troops, he farms out much of his country to warlords who oversee the smuggling. The army’s fourth division, which is commanded by Maher al-Assad, the president’s younger brother, is said to take a big cut. Other relations run operations at the Mediterranean ports of Latakia and Tartous. A Lebanese drug-runner close to Hizbullah and wanted by Interpol boasts on Facebook of his ties to the Assads and senior Hizbullah clerics. “It’s out of control,” says an insider in Damascus.\n The regime may see Captagon as a lever in regional power struggles. It “uses drugs as a weapon against the Gulf”, says Malik al-Abdeh, a Syria watcher close to the opposition. “The message is: normalise relations, or we’ll destroy your youth.”\n In any event, the regime’s loyalists are not the only ones involved. The Kurds who control Iraq’s north-eastern border with Turkey draw on the experience of the Kurdistan Workers’ Party, which operates routes through the mountains to Europe. Sunni Syrian rebels under Turkish protection in northern Syria are at it too. And the route south through Jordan to Saudi Arabia is getting busier. “All the militias get their earnings from smuggling drugs,” says a tribal leader in southern Syria. He says southern militias have helped thousands of refugees cross the border into Jordan, their knapsacks full of pills.\n For the Syrians left behind, drugs may destroy what remains of society after a decade of civil war. “Young men who haven’t been killed, exiled or jailed are addicts,” says a social worker in Sweida, a city held by the Assads in the south. A recent survey of Syrians in the north found that in January this year 33% said they knew a drug user. That is up from 7% in 2019. So prevalent is the habit that during this year’s Ramadan, in April and May, the prime-time serial on state television was “On a Hot Plate”, portraying a family of drug dealers.\n This article appeared in the Middle East &amp; Africa section of the print edition under the headline &#34;Narco-state on the Med&#34;", "posttime": "2021-07-23 01:32:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "毒品,narco,叙利亚", "title": "叙利亚已成为毒品国家", "title_en": "Syria has become a narco-state", "transed": 1, "url": "https://www.economist.com/middle-east-and-africa/2021/07/19/syria-has-become-a-narco-state", "via": "", "real_tags": ["毒品", "narco", "叙利亚"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069052, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "深度学习的三位先驱在 ACM 通讯杂志 7 月刊上发表的一篇论文中指出，深度神经网络将在没有符号人工智能帮助的情况下克服它们的缺点。 2018 年图灵奖获得者 Yoshua Bengio、Geoffrey Hinton 和 Yann LeCun 在他们的论文中解释了深度学习当前面临的挑战，以及它与人类和动物学习的不同之处。他们还探索了该领域的最新进展，这些进展可能为深度学习研究的未来方向提供蓝图。这篇题为“人工智能深度学习”的论文设想了一个未来，深度学习模型可以在很少或不需要人类帮助的情况下学习，灵活适应环境的变化，并且可以解决广泛的反射和认知问题。深度学习经常被比作人类和动物的大脑。然而，过去几年已经证明，作为深度学习模型中使用的主要组成部分的人工神经网络缺乏其生物对应物的效率、灵活性和多功能性。 Bengio、Hinton 和 LeCun 在他们的论文中承认了这些缺点。 “监督学习虽然在各种任务中取得成功，但通常需要大量人工标记的数据。同样，当强化学习仅基于奖励时，它需要大量的交互，”他们写道。监督学习是机器学习算法的一个流行子集，其中模型带有标记的示例，例如图像列表及其相应的内容。该模型经过训练，可以在具有相似标签的示例中找到重复出现的模式。然后使用学习到的模式将新示例与正确的标签相关联。监督学习对于有大量可用标记示例的问题特别有用。强化学习是机器学习的另一个分支，其中“代理”学习最大化环境中的“奖励”。环境可以像井字棋游戏板一样简单，其中 AI 玩家因排列三个 X 或 O 而获得奖励，也可以像城市环境一样复杂，其中自动驾驶汽车因避免碰撞、服从而获得奖励交通规则，到达目的地。代理首先采取随机行动。当它从环境中接收反馈时，它会找到提供更好奖励的动作序列。\n正如科学家们所承认的，在这两种情况下，机器学习模型都需要大量劳动力。标记数据集很难获得，尤其是在没有公开、开源数据集的专业领域，这意味着它们需要人工注释者的艰苦而昂贵的劳动。复杂的强化学习模型需要大量的计算资源来运行大量的训练集，这使得它们可供少数非常富有的 AI 实验室和科技公司使用。 Bengio、Hinton 和 LeCun 也承认，当前的深度学习系统在它们可以解决的问题范围内仍然有限。他们在专门的任务上表现良好，但“在他们接受过培训的狭窄领域之外往往很脆弱。”通常，轻微的变化（例如图像中的一些修改像素或环境中的规则的微小变化）都会导致深度学习系统误入歧途。深度学习系统的脆弱性很大程度上是由于机器学习模型基于“独立同分布”（iid）假设，即假设真实世界数据与训练数据具有相同的分布。 iid 还假设观察不会相互影响（例如，硬币或掷骰子是相互独立的）。 “从早期开始，机器学习的理论家就关注 iid 假设……不幸的是，这在现实世界中并不是一个现实的假设，”科学家们写道。由于不同的因素，现实世界的设置不断变化，如果没有因果模型，其中许多实际上是不可能表示的。智能代理必须不断地观察他们的环境和其他代理并从中学习，并且他们必须使自己的行为适应变化。科学家们写道：“当今最好的人工智能系统的性能在从实验室到现场时往往会受到影响。”当应用于计算机视觉和自然语言处理等领域时，iid 假设变得更加脆弱，代理必须处理高熵环境。目前，许多研究人员和公司试图通过在更多数据上训练神经网络来克服深度学习的局限性，希望更大的数据集能够覆盖更广泛的分布并减少现实世界中失败的机会。\n人工智能科学家的最终目标是复制人类拥有的一般智能。而且我们知道人类不会受到当前深度学习系统的问题的困扰。 Bengio、Hinton 和 LeCun 在他们的论文中写道：“人类和动物似乎能够以独立于任务的方式主要通过观察来学习大量关于世界的背景知识。” “这些知识巩固了常识，让人类只需几个小时的练习就能学习复杂的任务，比如驾驶。”在论文的其他地方，科学家们指出，“[H] 人类可以以一种不同于普通 iid 泛化的方式进行泛化：我们可以正确解释现有概念的新组合，即使这些组合在我们的训练下极不可能分布，只要它们尊重我们已经学到的高级句法和语义模式。”科学家们提供了各种解决方案来缩小人工智能和人类智能之间的差距。在过去几年中广泛讨论的一种方法是将神经网络与经典符号系统相结合的混合人工智能。符号操作是人类推理世界能力的一个非常重要的部分。这也是深度学习系统面临的巨大挑战之一。 Bengio、Hinton 和 LeCun 不相信混合神经网络和符号 AI。在 ACM 论文随附的一段视频中，Bengio 说：“有些人认为有些问题是神经网络无法解决的，我们必须求助于经典的人工智能、符号方法。但我们的工作表明并非如此。”深度学习先驱认为，更好的神经网络架构最终会导致人类和动物智能的方方面面，包括符号操作、推理、因果推理和常识。 Bengio、Hinton 和 LeCun 在他们的论文中强调了深度学习的最新进展，这些进展有助于在深度学习困难的一些领域取得进展。\n一个例子是 Transformer，这是一种神经网络架构，它一直是 OpenAI 的 GPT-3 和谷歌的 Meena 等语言模型的核心。 Transformers 的好处之一是它们能够在不需要标记数据的情况下进行学习。 Transformers 可以通过无监督学习来开发表征，然后他们可以应用这些表征来填补不完整句子的空白或在收到提示后生成连贯的文本。最近，研究人员表明 Transformers 也可以应用于计算机视觉任务。当与卷积神经网络结合时，transformers 可以预测掩蔽区域的内容。一种更有前途的技术是对比学习，它试图找到缺失区域的向量表示，而不是预测精确的像素值。这是一种有趣的方法，似乎更接近于人类的思维方式。当我们看到如下图所示的图像时，我们可能无法想象出缺失部分的照片般逼真的描绘，但我们的大脑可以对那些蒙版区域中可能发生的情况（例如、门、窗等）。 （我自己的观察：这可以与该领域的其他研究很好地结合起来，这些研究旨在将神经网络中的向量表示与现实世界的概念保持一致。）推动使神经网络减少对人类标记数据的依赖适合自我的讨论- 监督学习，LeCun 正在研究的一个概念。这篇论文还提到了“系统 2 深度学习”，这个词是从诺贝尔奖获得者心理学家 Daniel Kahneman 那里借来的。系统 2 解释了需要有意识思考的大脑功能，包括符号操作、推理、多步计划和解决复杂的数学问题。 System 2 深度学习仍处于早期阶段，但如果它成为现实，它可以解决神经网络的一些关键问题，包括分布外泛化、因果推理、鲁棒迁移学习和符号操作。科学家们还支持“神经网络为对象及其部分分配内在参考框架并通过使用几何关系识别对象”的工作。这是对“胶囊网络”的引用，这是 Hinton 在过去几年中一直关注的研究领域。胶囊网络旨在将神经网络从检测图像中的特征升级到检测对象、它们的物理特性以及它们之间的层次关系。胶囊网络可以提供具有“直觉物理学”的深度学习，这种能力使人类和动物能够理解三维环境。 “就我们对如何使神经网络真正有效的理解而言，还有很长的路要走。我们希望会有全新的想法，”Hinton 告诉 ACM。\n本文最初由 Ben Dickson 在 TechTalks 上发表，TechTalks 是一份研究技术趋势、它们如何影响我们的生活和经营方式以及它们解决的问题的出版物。但我们也讨论了技术的邪恶一面、新技术的阴暗影响以及我们需要注意的问题。你可以在这里阅读原文。", "note_en": "Deep neural networks will move past their shortcomings without help from   symbolic artificial intelligence, three pioneers of deep learning argue in a paper published in the July issue of the   Communications of the ACM journal.\n In their paper, Yoshua Bengio, Geoffrey Hinton, and Yann LeCun, recipients of the 2018 Turing Award, explain the current   challenges of deep learning  and how it differs from learning in humans and animals. They also explore recent advances in the field that might provide blueprints for the future directions for research in deep learning.\n Titled “ Deep Learning for AI,” the paper envisions a future in which deep learning models can learn with little or no help from humans, are flexible to changes in their environment, and can solve a wide range of reflexive and cognitive problems.\n   Deep learning  is often compared to the brains of humans and animals. However, the past years have proven that artificial neural networks, the main component used in deep learning models, lack the efficiency, flexibility, and versatility of their biological counterparts.\n In their paper, Bengio, Hinton, and LeCun acknowledge these shortcomings. “Supervised learning, while successful in a wide variety of tasks, typically requires a large amount of human-labeled data. Similarly, when reinforcement learning is based only on rewards, it requires a very large number of interactions,” they write.\n Supervised learning  is a popular subset of machine learning algorithms, in which a model is presented with labeled examples, such as a list of images and their corresponding content. The model is trained to find recurring patterns in examples that have similar labels. It then uses the learned patterns to associate new examples with the right labels. Supervised learning is especially useful for problems where labeled examples are abundantly available.\n Reinforcement learning  is another branch of machine learning, in which an “agent” learns to maximize “rewards” in an environment. An environment can be as simple as a tic-tac-toe board in which an AI player is rewarded for lining up three Xs or Os, or as complex as an urban setting in which a   self-driving car  is rewarded for avoiding collisions, obeying traffic rules, and reaching its destination. The agent starts by taking random actions. As it receives feedback from its environment, it finds sequences of actions that provide better rewards.\n In both cases, as the scientists acknowledge, machine learning models require huge labor. Labeled datasets are hard to come by, especially in specialized fields that don’t have public, open-source datasets, which means they need the hard and expensive labor of human annotators. And complicated reinforcement learning models require massive computational resources to run a vast number of training episodes, which makes them available to a few,   very wealthy AI labs and tech companies.\n Bengio, Hinton, and LeCun also acknowledge that current deep learning systems are still   limited in the scope of problems they can solve. They perform well on specialized tasks but “are often brittle outside of the narrow domain they have been trained on.” Often, slight changes such as   a few modified pixels  in an image or a very slight alteration of rules in the environment can cause deep learning systems to go astray.\n The brittleness of deep learning systems is largely due to machine learning models being based on the “independent and identically distributed” (i.i.d.) assumption, which supposes that real-world data has the same distribution as the training data. i.i.d also assumes that observations do not affect each other (e.g., coin or die tosses are independent of each other).\n “From the early days, theoreticians of machine learning have focused on the iid assumption… Unfortunately, this is not a realistic assumption in the real world,” the scientists write.\n Real-world settings are constantly changing due to different factors, many of which are virtually impossible to represent   without causal models. Intelligent agents must constantly observe and learn from their environment and other agents, and they must adapt their behavior to changes.\n “[T]he performance of today’s best AI systems tends to take a hit when they go from the lab to the field,” the scientists write.\n The i.i.d. assumption becomes even more fragile when applied to fields such as   computer vision  and natural language processing, where the agent must deal with high-entropy environments. Currently, many researchers and companies try to overcome the limits of deep learning by   training neural networks on more data, hoping that larger datasets will cover a wider distribution and reduce the chances of failure in the real world.\n  The ultimate goal of AI scientists is to replicate the kind of general intelligence humans have. And we know that humans don’t suffer from the problems of current deep learning systems.\n “Humans and animals seem to be able to learn massive amounts of background knowledge about the world, largely by observation, in a task-independent manner,” Bengio, Hinton, and LeCun write in their paper. “This knowledge underpins common sense and allows humans to learn complex tasks, such as driving, with just a few hours of practice.”\n Elsewhere in the paper, the scientists note, “[H]umans can generalize in a way that is different and more powerful than ordinary iid generalization: we can correctly interpret novel combinations of existing concepts, even if those combinations are extremely unlikely under our training distribution, so long as they respect high-level syntactic and semantic patterns we have already learned.”\n Scientists provide various solutions to close the gap between AI and human intelligence. One approach that has been widely discussed in the past few years is hybrid artificial intelligence that combines neural networks with classical symbolic systems. Symbol manipulation is a very important part of humans’ ability to reason about the world. It is also one of the great challenges of deep learning systems.\n Bengio, Hinton, and LeCun do not believe in mixing neural networks and symbolic AI. In a video that accompanies the ACM paper, Bengio says, “There are some who believe that there are problems that neural networks just cannot resolve and that we have to resort to the classical AI, symbolic approach. But our work suggests otherwise.”\n The deep learning pioneers believe that better neural network architectures will eventually lead to all aspects of human and animal intelligence, including symbol manipulation, reasoning, causal inference, and common sense.\n    In their paper, Bengio, Hinton, and LeCun highlight recent advances in deep learning that have helped make progress in some of the fields where deep learning struggles.\n One example is the   Transformer, a neural network architecture that has been at the heart of language models such as   OpenAI’s GPT-3  and   Google’s Meena. One of the benefits of Transformers is their capability to learn without the need for labeled data. Transformers can develop representations through unsupervised learning, and then they can apply those representations to fill in the blanks on incomplete sentences or generate coherent text after receiving a prompt.\n More recently, researchers have shown that Transformers can be applied to computer vision tasks as well. When combined with   convolutional neural networks, transformers can predict the content of masked regions.\n A more promising technique is   contrastive learning, which tries to find vector representations of missing regions instead of predicting exact pixel values. This is an intriguing approach and seems to be much closer to what the human mind does. When we see an image such as the one below, we might not be able to visualize a photo-realistic depiction of the missing parts, but our mind can come up with a high-level representation of what might go in those masked regions (e.g., doors, windows, etc.). (My own observation: This can tie in well with other research in the field aiming to   align vector representations in neural networks  with real-world concepts.)\n The push for making neural networks less reliant on human-labeled data fits in the discussion of   self-supervised learning, a concept that LeCun is working on.\n  The paper also touches upon “ system 2 deep learning,” a term borrowed from Nobel laureate psychologist Daniel Kahneman. System 2 accounts for the functions of the brain that require conscious thinking, which include symbol manipulation, reasoning, multi-step planning, and solving complex mathematical problems. System 2 deep learning is still in its early stages, but if it becomes a reality, it can solve some of the key problems of neural networks, including out-of-distribution generalization, causal inference, robust   transfer learning, and symbol manipulation.\n The scientists also support work on “Neural networks that assign intrinsic frames of reference to objects and their parts and recognize objects by using the geometric relationships.” This is a reference to “ capsule networks,” an area of research Hinton has focused on in the past few years. Capsule networks aim to upgrade neural networks from detecting features in images to detecting objects, their physical properties, and their hierarchical relations with each other. Capsule networks can provide deep learning with “ intuitive physics,” a capability that allows humans and animals to understand three-dimensional environments.\n “There’s still a long way to go in terms of our understanding of how to make neural networks really effective. And we expect there to be radically new ideas,” Hinton told ACM.\n This article was originally published by Ben Dickson on    TechTalks  , a publication that examines trends in technology, how they affect the way we live and do business, and the problems they solve. But we also discuss the evil side of technology, the darker implications of new tech, and what we need to look out for. You can read the original article  here.", "posttime": "2021-07-23 01:32:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度学习,hinton,学习", "title": "Bengio、Hinton 和 LeCun 解释了深度学习的当前挑战", "title_en": "Bengio, Hinton and LeCun explain the current challenges of deep learning", "transed": 1, "url": "https://thenextweb.com/news/pioneers-deep-learning-future-lit-syndication", "via": "", "real_tags": ["深度学习", "hinton", "学习"]}, {"category": "", "categoryclass": "", "imagename": "2a327cb6b6c1a742299e4ac56c5083ab.jpg", "infoid": 1069051, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经历了一系列致命的火灾、刑事定罪、混乱的破产和数十亿美元的和解，但太平洋天然气和电力公司——更广为人知的名字是 PG&amp;E——终于承诺在容易发生火灾的加利福尼亚掩埋大量的电力线。该公用事业公司周三表示，它将在最容易发生野火的地方掩埋 10,000 英里长的电力线。这个为期十年的项目将涉及 PG&amp;E 10% 的输配电线路，耗资数百亿美元。 PG&amp;E 显然计划在今年晚些时候宣布该项目，但在公用事业设备成为比尤特县 104,000 英亩迪克西火灾的可能原因后，该公司的新首席执行官帕特里夏·波普（Patricia Poppe）提前发布了新闻。该公司向监管机构报告，7 月 13 日，一棵 70 英尺高的松树倒在 PG&amp;E 的一条输电线上。今天，火势只得到了 17% 的控制。 “不这样做太贵了。生命危在旦夕，”波普在新闻发布会上说。她还表示，该公司今年将花费 14 亿美元修剪超过 100 万棵树木，再砍伐 30 万多棵树木。仅在 2017 年和 2018 年，有缺陷的 PG&amp;E 设备就在加利福尼亚造成 100 多人死亡。 Camp Fire 等公司向 PG&amp;E 提出了超过 300 亿美元的潜在责任索赔，迫使其陷入复杂的、价值 590 亿美元的破产和重组。由于迪克西火灾，比尤特县再次因 PG&amp;E 设备故障而遭受苦难。该县是天堂镇的所在地，该镇在 2018 年的营火中几乎被完全摧毁，该镇也是由 PG&amp;E 设备启动的。在这种情况下，PG&amp;E 最终承认了 84 项过失杀人罪，因为大陪审团指控该公用事业公司因未能更换带有高压线的磨损的 C 形挂钩而犯有刑事疏忽。十多年来，PG&amp;E 的安全记录充其量只是参差不齐。 2008 年，萨克拉门托郊区 Rancho Cordova 发生瓦斯爆炸，造成一名 74 岁男子死亡。 2010 年，PG&amp;E 的一条天然气管道在旧金山以南的圣布鲁诺发生爆炸，造成 8 人死亡。监管机构的一项调查发现该公司伪造了天然气管道的安全记录。 2014 年至 2017 年间，PG&amp;E 的电气设备引发了 1,​​550 起火灾。 PG&amp;E 的许多安全问题似乎都源于对维护和运营的长期投资不足。 2012 年，监管机构发现 PG&amp;E 的运营和维护预算减少了数百万美元。他们还发现，1997 年至 2000 年期间的总资本支出比公司的授权预算少 9300 万美元，而 2002 年至 2012 年期间，来自天然气和电力传输的 PG&amp;E 收入比授权高出 2.24 亿美元。\n每年埋葬 1,000 英里的电力线对公司来说将是一项艰巨的任务。近年来，PG&amp;E 每年仅埋葬约 70 英里。该公司总共拥有 20,000 英里的高压输电线路和 80,000 英里的配电线路。该公用事业公司已经在地下大约 27,000 英里，尽管其中大部分不在火灾高风险地区。掩埋电线可能具有挑战性，特别是在描述加利福尼亚大部分地区的丘陵和岩石地形。事实上，最容易发生野火的地区是一些最具挑战性的地形。 PG&amp;E 项目的成本范围很广。 Poppe 表示，她希望公司能够将每英里成本降低到整个项目将运行 15-200 亿美元的程度。但公用事业改革网络执行董事马克·托尼告诉《纽约时报》，根据先前提交的 PG&amp;E 掩埋电力线提案的每英里成本，价格可能高达 400 亿美元。纳税人可能会因大部分价格标签而陷入困境。该公用事业公司最近从破产中恢复过来，并承诺为先前野火的受害者提供 135 亿美元的信托资金。然而，由于一半的信托以 PG&amp;E 股票的形式支付，该股票今年下跌了近 25%，该基金已经面临约 20 亿美元的缺口。去年，该公用事业公司仅向受害者分发了 700 万美元。 PG&amp;E 对掩埋电力线的承诺只是美国为应对不断变化的气候准备其基础设施所面临的众多适应措施之一。数千年来，加利福尼亚一直是一片被大火塑造的景观，但气温上升、积雪减少和不可预测的降水模式增加了发生灾难性野火的风险。气候变化正率先进入加利福尼亚和美国西部的其他具有挑战性的趋势。经过一个多世纪的灭火，森林里堆满了枯木和碎片，它们是野火的完美燃料。扑灭最小火的做法已经为火从林下爬上树冠创造了梯子，增加了小火变成大火的风险。人们一直在深入农村地区，形成了一个巨大的荒地-城市界面，在易发生火灾的荒野上铺设了房屋和电线。加上老化的电网，这些情况创造了使加利福尼亚和西部年复一年燃烧的条件。 PG&amp;E 的计划将有助于在一定程度上降低野火的风险，但如果没有其他更彻底的改变，这还不够。", "note_en": "It took a string of deadly fires, criminal convictions, a messy bankruptcy, and a multibillion-dollar settlement, but Pacific Gas and Electric Company—better known as PG&amp;E—is finally committing to burying vast stretches of power lines in fire-prone California.\n The utility said on Wednesday that it will bury 10,000 miles of power lines in places that are at the greatest risk for wildfires. The ten-year project will touch 10 percent of PG&amp;E’s transmission and distributions lines, and it will cost tens of billions of dollars.\n PG&amp;E had apparently been planning to announce the project later this year, but Patricia Poppe, the company’s new CEO, moved up the news release after the utility’s equipment emerged as the likely cause of the  104,000-acre Dixie Fire in Butte County. A 70-foot pine tree fell on one of PG&amp;E’s power lines on July 13, the company reported to regulators. Today, the fire is only 17 percent contained.\n “It&#39;s too expensive not to do it. Lives are on the line,” Poppe said in a press conference. She also said the company would spend $1.4 billion this year to trim more than a million trees and cut down over 300,000 more.\n  In 2017 and 2018 alone, faulty PG&amp;E equipment killed more than 100 people in California. The Camp Fire, among others, heaped more than $30 billion in potential liability claims onto PG&amp;E, forcing it into a  complex, $59 billion bankruptcy and reorganization.\n  With the Dixie Fire, Butte County is once again suffering as a result of a PG&amp;E equipment failure. The county is home to Paradise, the town that was almost completely destroyed in the 2018 Camp Fire, which was also started by PG&amp;E equipment. In that case, PG&amp;E ultimately  pleaded guilty to 84 counts of manslaughter after a grand jury indicted the utility on criminal negligence over its failure to replace a worn C-hook that held a high-voltage line.   For over a decade, PG&amp;E’s safety record has been spotty at best. In 2008, a gas explosion in the Sacramento suburb of Rancho Cordova killed a 74-year-old man. In 2010, one of PG&amp;E&#39;s gas pipelines exploded in San Bruno, just south of San Francisco, killing eight. An investigation by regulators caught the company  falsifying safety records for gas pipelines. Between 2014 and 2017, PG&amp;E’s electrical equipment started  1,550 fires.\n    Many of PG&amp;E’s safety problems seem to trace back to chronic underinvestment in maintenance and operations. In 2012, regulators discovered that PG&amp;E had  shorted its operations and maintenance budget by millions of dollars. They also found that overall capital spending between 1997 and 2000 was $93 million less than the company’s authorized budget, and between 2002 and 2012, PG&amp;E revenues from gas and electric transmission were $224 million higher than authorized.\n  Burying 1,000 miles of power lines every year will be a herculean task for the company. In recent years, PG&amp;E has been burying only about 70 miles annually. In total, the company owns 20,000 miles of high-voltage transmission lines and 80,000 miles of distribution lines. The utility already has around  27,000 miles underground, though most of that is not in areas of high fire risk. Burying power lines can be challenging, particularly in hilly and rocky terrain, which describes large parts of California. In fact, the regions that are most prone to wildfire are in some of the most challenging topography.\n Costs for PG&amp;E’s project range widely. Poppe said that she hopes the company can get per-mile costs down to the point where the entire project will run $15–20 billion. But Mark Toney, executive director of the Utility Reform Network, told  The New York Times that based on per-mile costs from previously submitted PG&amp;E proposals to bury power lines, the price could be as high as $40 billion.\n Ratepayers will likely be on the hook for a majority of the price tag. The utility recently emerged from bankruptcy, and it promised to fund a $13.5 billion trust for victims of previous wildfires. Yet with half of the trust paid  in the form of PG&amp;E stock, which has fallen nearly 25 percent this year, the fund is already facing an approximately $2 billion shortfall. Last year, the utility distributed  just $7 million to victims.\n     PG&amp;E’s pledge to bury power lines represents just one of the many adaptations the US is facing to prepare its infrastructure for a changing climate. California has been a landscape shaped by fire for thousands of years, but rising temperatures, shrinking snowpack, and unpredictable precipitation patterns have  ramped up the risk of catastrophic wildfires.\n  Climate change is running head-first into other challenging trends in California and the American West. Forests are loaded with dead wood and debris, perfect fuels for wildfires, after more than a century of fire suppression. The practice of putting out even the smallest fires has created ladders for blazes to climb up from the understory into tree canopies, raising the risk that a small fire will turn into a large one. People have been moving deeper into rural areas, creating a massive wildland-urban interface that is lacing fire-prone wilderness with homes and power lines.   Together with an aging grid, those circumstances have created the conditions that have set California and the West ablaze year after year. PG&amp;E’s plan will help reduce the risk of wildfire somewhat, but it won’t be enough without other, more sweeping changes.", "posttime": "2021-07-23 00:59:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可能,power", "title": "PG＆E可能引发另一场大火，承诺掩埋10,000英里的电力线", "title_en": "PG&E likely sparks another massive fire, pledges to bury 10,000 miles of power lines", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/07/pge-likely-sparks-another-massive-fire-pledges-to-bury-10000-miles-of-power-lines/", "via": "", "real_tags": ["可能", "power"]}, {"category": "", "categoryclass": "", "imagename": "9497be087e0a012d8a335911ba90cb0d.jpg", "infoid": 1069050, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Netflix 在第二季度在美国和加拿大失去了 430,000 名订户，并且发布了低于预期的今年晚些时候的预测，重新引发了投资者对经济重新开放后流媒体集团将如何表现的怀疑。这家总部位于加利福尼亚的公司预计第三季度将增加 350 万订户，这令期待下半年强劲反弹的投资者感到失望。分析师曾预测，Netflix 第三季度将增加 590 万订户。据数据公司 Ampere 称，过去一年半，迪士尼、苹果、华纳媒体、康卡斯特等纷纷推出流媒体平台，有超过 100 种流媒体服务供消费者选择。然而，在呼吁投资者时，高管们驳回了竞争背后的想法。 “与过去相比，HBO 或迪士尼……是否有不同的影响？我们没有在我们拥有的 [数据] 中看到这一点，”Netflix 联合首席执行官里德·黑斯廷斯说。 “这给了我们安慰。”过去几年，传统媒体公司一直在进行整合，以便与 Netflix 竞争。最近，Discovery 同意与 WarnerMedia 合并以形成大型流媒体服务。提到行业整合，联合首席执行官泰德萨兰多斯告诉投资者：“让我们看看一加一等于三......与典型的一加一等于二。”\n对 Netflix 进军视频游戏的计划的吸引力帮助抵消了其核心业务的疲软，在盘后交易中股价上涨 0.8%。 Netflix 上周透露了对在游戏行业拥有 30 年经验的 Mike Verdu 的招聘消息。该公司周二表示，最初将专注于手机游戏，并向流媒体集团的付费用户免费提供游戏。黑斯廷斯将视频游戏视为 Netflix 现有业务的补充，而不是新的巨大利润驱动因素。 “我们是一家拥有众多支持元素的单一产品公司。” Netflix 在第二季度总共增加了 150 万订户，略高于华尔街预测的 110 万。在去年增加了创纪录的客户数量之后，随着竞争对手进入市场以及人们摆脱了冠状病毒大流行的封锁，订户增长急剧放缓。在 Netflix 最大的市场美国，注册已经停止，那里的大部分 COVID 限制都已取消。该公司的管理层告诉股东：“大流行给我们的增长带来了不寻常的波动。” Netflix 高管将订户数量疲软归咎于节目和电影的供应减少，并承诺随着《巫师》和《性教育》等影片的回归，增长将在 2021 年下半年回升。\n该公司表示：“COVID 及其变体使预测未来变得困难，但由于到目前为止制作工作基本顺利，我们对提供强大的下半年 [演出] 的能力持乐观态度。” Netflix 仍然是迄今为止最大的付费视频流服务，拥有 2.09 亿订户，而其最接近的竞争对手 Disney Plus 的订户为 1.04 亿。第二季度的收入比去年同期增长 19%，达到 73 亿美元，符合分析师的预测。净收入从一年前的 7.2 亿美元增至 14 亿美元。 © 2021 The Financial Times Ltd. 保留所有权利 不得以任何方式重新分发、复制或修改。", "note_en": "Netflix lost 430,000 subscribers in the US and Canada in the second quarter and issued weaker than expected forecasts for later in the year, rekindling investor doubts over how the streaming group will fare after the economic reopening.\n The California-based company predicted it would add 3.5 million subscribers in the third quarter, disappointing investors who were looking for a stronger rebound in the second half of the year. Analysts had forecast that Netflix would add 5.9 million subscribers during the third quarter.\n In the past year and a half, Disney, Apple, WarnerMedia, Comcast and others have launched streaming platforms, and there are more than 100 streaming services for consumers to choose from, according to data company Ampere.\n Yet on a call for investors, executives dismissed the idea that competition was behind the weaker figures.\n “Does HBO or Disney... have a differential impact compared to the past? We’re not seeing that in the [data] we have,” said Reed Hastings, Netflix co-chief executive. “That gives us comfort.”\n Traditional media companies have spent the past few years consolidating in order to compete with Netflix. Most recently, Discovery agreed to merge with WarnerMedia to form a mega-streaming service.\n Referencing the industry consolidation, Ted Sarandos, co-chief executive, told investors: “Let’s see if one plus one equals three... versus the typical one plus one equals two.”\n    Intrigue over Netflix’s plans to delve into video games helped offset the weakness in its core business, lifting the shares 0.8 percent in after-hours trading.\n  Netflix last week revealed the hiring of Mike Verdu, a 30-year veteran of the gaming industry. The company on Tuesday said it would initially  focus on games for mobile phones and offer games at no extra cost to paying subscribers of the streaming group. Hastings framed video games as a complement to Netflix’s existing business rather than a large new profit driver. “We’re a one-product company with a bunch of supporting elements.”\n In total, Netflix added 1.5 million subscribers in the second quarter, just above Wall Street forecasts of 1.1 million.\n After adding a record number of customers last year, subscriber growth has slowed sharply as competitors entered the market and people emerged from coronavirus pandemic lockdowns.\n Sign-ups have ground to a halt in the US, Netflix’s largest market, where the majority of COVID restrictions have been rolled back.\n “The pandemic has created unusual choppiness in our growth,” the company’s management told shareholders.\n Netflix executives have blamed the subscriber number weakness on a lighter offering of shows and movies and promised that growth would pick up in the second half of 2021 with the return of titles such as  The Witcher and  Sex Education.\n “COVID and its variants make predicting the future hard, but with productions largely running smoothly so far, we’re optimistic in our ability to deliver a strong second half [shows],” the company said.\n Netflix remains by far the largest paid video streaming service, with 209 million subscribers, compared with 104 million for Disney Plus, its closest competitor.\n Revenues in the second quarter rose 19 percent from the same period last year to $7.3 billion, meeting analysts’ forecasts. Net income increased to $1.4 billion, up from $720 million a year ago.\n © 2021 The Financial Times Ltd.  All rights reserved Not to be redistributed, copied, or modified in any way.", "posttime": "2021-07-23 00:58:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,恢复,bleeds,投资者", "title": "Netflix 使美国和加拿大的订户流失，而且没有恢复的迹象", "title_en": "Netflix bleeds subscribers in US and Canada, with no sign of recovery", "transed": 1, "url": "https://arstechnica.com/gaming/2021/07/netflix-bleeds-subscribers-in-us-and-canada-with-no-sign-of-recovery/?comments=1", "via": "", "real_tags": ["美国", "恢复", "bleeds", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "5f4e2971d8b092f7d210d70c7b159296.png", "infoid": 1069049, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部位于英国的 Mindtech Global 开发了它所描述的端到端合成数据创建平台。简单来说，它的系统可以想象视觉场景，例如某人在商店内的行为或过马路。然后使用这些数据为大型零售商、仓库运营商、医疗保健、运输系统和机器人等客户训练基于人工智能的计算机视觉系统。它实际上是在合成世界中训练“合成”闭路电视摄像机。它现在已经完成了由英国区域支持者 NPIF – Mercia Equity Finance 牵头的 325 万美元早期融资，以及 Deeptech Labs 和 In-Q-Tel。最后一位投资者意义重大。 In-Q-Tel 投资于支持美国情报能力的初创公司，总部位于弗吉尼亚州阿灵顿…… Mindtech 的 Chameleon 平台旨在帮助计算机理解和预测人类互动。众所周知，当前训练 AI 视觉系统的方法需要公司获取闭路电视录像等数据。该过程充满隐私问题，成本高昂且耗时。 Mindtech 表示，Chameleon 解决了这个问题，因为其客户可以快速“使用逼真的智能 3D 模型构建无限的场景和场景”。一个额外的好处是，这些合成人类可用于训练人工智能视觉系统，以消除人类在多样性和偏见方面的缺陷。 Mindtech 首席执行官 Steve Harris 表示：“机器学习团队最多可以将 80% 的时间用于采购、清理和组织训练数据。我们的 Chameleon 平台解决了 AI 培训挑战，让行业能够专注于 AI 网络创新等更高价值的任务。这一轮将使我们能够加速我们的增长，实现新一代人工智能解决方案，更好地了解人类与他人以及他们周围世界的互动方式。”那么你能用它做什么呢？考虑以下情况： 一个孩子在商场从父母的手中滑落。在 Mindtech 场景中运行的合成闭路电视经过数千次培训，了解如何实时发现它并提醒员工。另一个：送货机器人遇到在街上玩耍的孩子，并想出如何避开他们。最后：站台上的乘客行为异常靠近轨道——闭路电视经过训练可以自动发现他们并发送帮助。\nIn-Q-Tel 董事总经理（伦敦）Nat Puffer 评论道：“Mindtech 的 Chameleon 平台的成熟度以及对全球客户的商业吸引力给我们留下了深刻的印象。我们对这个平台在不同市场拥有的众多应用程序及其消除更智能、更直观的 AI 系统开发过程中的重大障碍的能力感到兴奋。” Deeptech Labs 首席执行官 Miles Kirby 表示：“作为 Deeptech 成功的催化剂，我们的投资和加速器计划为雄心勃勃的团队提供新颖的解决方案和建立改变世界的公司的愿望。 Mindtech 经验丰富的团队的使命是颠覆 AI 系统的训练方式，我们很高兴为他们的旅程提供支持。”当然还有更黑暗的应用的潜力，例如在超市内发现小偷小摸，或者可能以某种反乌托邦的方式“优化”压力很大的仓库工人。但是，理论上，Mindtech的客户可以利用这个平台摆脱中层管理人员的偏见，更好地为客户服务。", "note_en": "UK-based  Mindtech Global has developed what it describes as an end-to-end synthetic data creation platform. In plain English, its system can imagine visual scenarios such as someone’s behavior inside a store, or crossing the street. This data is then used to train AI-based computer vision systems for customers such as big retailers, warehouse operators, healthcare, transportation systems and robotics. It literally trains a ‘synthetic’ CCTV camera inside a synthetic world.\n It’s now closed a $3.25 million early-stage funding round led by UK regional backer  NPIF – Mercia Equity Finance, with  Deeptech Labs and  In-Q-Tel.\n  That last investor is significant. In-Q-Tel invests in startups that  support US intelligence capabilities and is based in Arlington, Virginia…\n Mindtech’s Chameleon platform is designed to help computers understand and predict human interactions. As we all know, current approaches to training AI vision systems require companies to source data such as CCTV footage. The process is fraught with privacy issues, costly, and time-consuming. Mindtech says Chameleon solves that problem, as its customers quickly “build unlimited scenes and scenarios using photo-realistic smart 3D models”.\n An added bonus is that these synthetic humans can be used to train AI vision systems to weed out human failings around diversity and bias.\n  Steve Harris, CEO, Mindtech said: “Machine learning teams can spend up to 80% of their time sourcing, cleaning, and organizing training data. Our Chameleon platform solves the AI training challenge, freeing the industry to focus on higher-value tasks like AI network innovation. This round will enable us to accelerate our growth, enabling a new generation of AI solutions that better understand the way humans interact with each other and the world around them.”\n So what can you do with it? Consider the following: A kid slips from its parent’s hand at the mall. The synthetic CCTV running inside Mindtech’s scenario is trained thousands of times over how to spot it in real-time and alert staff. Another: a delivery robot meets kids playing in a street and works out how to how to avoid them. Finally: a passenger on the platform is behaving erratically too close to the rails – the CCTV is trained to automatically spot them and send help.\n Nat Puffer, Managing Director (London), In-Q-Tel commented: “Mindtech impressed us with the maturity of their Chameleon platform and their commercial traction with global customers. We’re excited by the many applications this platform has across diverse markets and its ability to remove a significant roadblock in the development of smarter, more intuitive AI systems.”\n Miles Kirby, CEO, Deeptech Labs said: “As a catalyst for deeptech success, our investment, and accelerator program supports ambitious teams with novel solutions and the appetite to build world-changing companies. Mindtech’s highly-experienced team are on a mission to disrupt the way AI systems are trained, and we’re delighted to support their journey.”\n There is of course potential for darker applications, such a spotting petty theft inside supermarkets, or perhaps ‘optimising’ hard-pressed warehouse workers in some dystopian fashion. However, in theory, Mindtech’s customers can use this platform to rid themselves of the biases of middle-managers, and better serve customers.", "posttime": "2021-07-23 00:58:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "合成,mindtech,训练", "title": "英国的 Mindtech 从 In-Q-Tel 等公司筹集了 325 万美元，用于在合成人身上训练闭路电视摄像机", "title_en": "\n\t\t\t\tUK’s Mindtech raises $3.25M from In-Q-Tel, among others, to train CCTV cameras on synthetic humans\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/uks-mindtech-raises-3-25m-from-in-q-tel-among-others-to-train-cctv-cameras-on-synthetic-humans/", "via": "", "real_tags": ["合成", "mindtech", "训练"]}, {"category": "", "categoryclass": "", "imagename": "4f14bc9febe3de9c9dc4145efe8e36bf.jpg", "infoid": 1069048, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "印度储备银行副行长 T Rabi Sankar 在今天的一次会议上表示，央行正在考虑以“分阶段”的方式引入该国的数字货币，同时对南亚国家的外汇规则和IT法律。他说，这种由主权国家支持的数字货币将降低经济对现金的依赖，实现更便宜、更顺畅的国际结算，并保护人们免受隐私加密货币波动的影响。 “每个想法都必须等待时机，CBDC [央行数字货币] 的时代已经临近。我们已经仔细评估了风险，”他在智库 Vidhi 法律政策中心举办的一次会议上对观众说。桑卡尔表示，央行的“努力是随着我们[计划]的推进”，以便印度的数字货币“能够重申其在世界支付系统中的领导地位”。欧洲央行上周表示，将开始为期 24 个月的“调查阶段”，如果成功，可能会在 2025 年之前创建数字欧元。截至 6 月底，人民币试点交易额已达到 53 亿美元。 “中央银行已经增加了对数字货币的关注，”桑卡尔说。 “CBDC 将成为世界上大多数中央银行的武器库。他表示，将在绘图板上以及与利益相关者协商时考虑一种经过校准和细微差别的方法，“并补充说，央行一直在探索发行主权 CBDC 的好处和风险“相当长一段时间”。\n“我们研究了世界各地不同中央银行针对批发和零售部门提出的特定目的 CBDC。正在考虑推出针对人口规模的通用 CBDC，印度储备银行正在努力制定分阶段的引入战略，并研究对印度银行和货币系统几乎没有干扰的用例，”他说。 “但是，在不久的将来，可能会在批发和零售领域进行试点。”桑卡尔在讲话中还暗示，央行没有改变对比特币等私人加密货币的立场。 2018 年，印度政府小组建议禁止所有私人加密货币，并提议对违法者处以最高 10 年的监禁。该小组还建议政府探索法定货币的数字版本及其实施方法。当时，印度储备银行表示，此举对于遏制该国金融体系的“围栏”是必要的。它还辩称，比特币和其他加密货币不能被视为货币，因为它们不是由金属制成或以实物形式存在，也没有被政府盖章。 “它们不是商品或对商品的债权，因为它们没有内在价值；一些声称它们类似于黄金的说法显然是投机取巧，”桑卡尔今天说。中央银行 2018 年的通知给当地几家提供加密货币交易服务的初创公司和公司带来了恐慌。几乎所有这些公司要么关门了，要么转向服务其他市场。这一提议受到了几家交易所和交易员的质疑，他们向最高法院提起了诉讼。去年，美国最高法院做出了有利于他们的裁决。该裁决被视为“历史性”裁决，但尚未在政策层面影响早先的通告。与此同时，该国暗示它计划制定一项禁止私人加密货币的法律。\n在今年早些时候在下议院网站上发布的议程中，一项立法试图“禁止印度的所有私人加密货币”，但允许“某些例外情况以促进加密货币的基础技术 [blockchain] 及其用途。”", "note_en": "T Rabi Sankar, the deputy governor of Reserve Bank of India, said at a conference today that the central bank is considering introducing the nation’s digital currency in a “phased” manner while legal changes are made to the South Asian nation’s foreign-exchange rules and IT laws.\n The digital currency, which will be backed by sovereign, will lower the economy’s reliance on cash, enable cheaper and smoother international settlements, and protect people from the volatility of privacy cryptocurrencies, he said.\n  “Every idea has to wait for its time, and the time for CBDC [central bank digital currency] is near. We have carefully evaluated the risks,” he told an audience at a conference held by think-tank Vidhi Centre for Legal Policy.\n Sankar said the central bank’s “endeavor is that as we move forward [with the plan],” so that India’s digital currency “can reiterate its leadership position in payment systems of the world.”\n The top executive’s remarks follows European Central Bank saying last week that it will begin a 24-month “investigation phase” that, if successful, could lead to the creation of a digital euro by 2025.\n Also last week, China’s central bank said its digital yuan trial had reached $5.3 billion in transaction value by the end of June.\n “Central banks have increased their attention on digital currencies,” said Sankar. “CBDC will be in the arsenal of most if not all central banks in the world. A calibrated and nuanced approach will be considered at the drawing board as well as with stakeholder consultations,” he said, adding that the central bank has been exploring the benefits and risks of issuing a sovereign CBDC for “quite some time.”\n “We have studied specific-purpose CBDCs proposed by different central banks around the world for wholesale and retail segments. The launch of a general-purpose CBDC for population scale is being considered, and RBI is working towards a phased introduction strategy and examining use cases with little or no disruption of India’s banking and monetary systems,” he said. “However, conducting pilots in wholesale and retail segments may be a possibility in near future.”\n In his remarks, Sankar also hinted that the central bank hasn’t changed its stand on private cryptocurrencies such as bitcoin.\n In 2018, an Indian government panel recommended banning all private cryptocurrencies and proposed up to 10 years of jail time for offenders. The panel also suggested the government to explore a digital version of the fiat currency and ways to implement it.\n At the time, RBI said the move was necessary to curb “ring-fencing” of the country’s financial system. It had also argued that bitcoin and other cryptocurrencies cannot be treated as currencies as they are not made of metal or exist in physical form, nor were they stamped by the government.\n “They are not commodities or claims on commodities as they have no intrinsic value; some claims that they are akin to gold clearly seem opportunistic,” Sankar said today.\n The 2018 notice from the central bank sent a panic to several local startups and companies offering services to trade in cryptocurrency. Nearly all of them have either since closed shop, or pivoted to serve other markets.\n This proposal was challenged by several exchanges and traders, who filed a lawsuit in the Supreme Court. The nation’s apex court  ruled in their favor last year. This ruling was seen as “historic” but it has yet to impact the earlier circular on the policy level. In the meantime, the country has hinted that it plans to  introduce a law to ban private cryptocurrencies.\n In the agenda published on the lower house website earlier this year, a legislation sought to “prohibit all private cryptocurrencies in India,” but allow “for certain exceptions to promote the underlying technology [blockchain] of cryptocurrency and its uses.”", "posttime": "2021-07-23 00:58:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "考虑,phased,货币", "title": "印度考虑分阶段推出央行数字货币", "title_en": "\n\t\t\t\tIndia considering phased roll out of central bank digital currency\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/india-considering-phased-roll-out-of-central-bank-digital-currency/", "via": "", "real_tags": ["考虑", "phased", "货币"]}, {"category": "", "categoryclass": "", "imagename": "eb391e99923bc1713b068a1f10d14b1d.jpg", "infoid": 1069047, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "原因似乎是 Akamai 的中断，这是一家为公司提供网络和内容交付服务的互联网安全巨头。在美国东部时间上午 11 点左右，Akamai 报告了其 Edge DNS 的问题，该服务旨在保持网站、应用程序和服务平稳、安全地运行。 DNS 服务对于互联网的工作方式至关重要，因此当出现问题或出现中断时，它会对所有使用它的客户网站和服务产生连锁反应。 Akamai 表示它“正在积极调查这个问题”，但当联系到一位发言人时，他不会说它的中断是否是当前离线的其他网站和服务中断的原因。目前尚不清楚是什么导致了这一事件，但 Akamai 表示它已经在恢复中。 “我们已针对此问题实施了修复，根据目前的观察，该服务正在恢复正常运营。我们将继续进行监控，以确保完全减轻影响，”Akamai 告诉 TechCrunch。这不是我们第一次看到如此大的停电。去年，也为世界各地的公司提供网络服务的 Cloudflare 发生了类似的中断，该错误导致主要网站停止加载，包括 Shopify、Discord 和 Politico。 11 月，亚马逊的云服务也出现故障，导致它在停机期间无法更新自己的状态页面。在线工作空间初创公司 Notion 今年也发生了引人注目的停电事件，迫使该公司转向 Twitter 寻求帮助。", "note_en": "What appears to be the cause is an outage at Akamai, an internet security giant that provides networking and content delivery services to companies. At around 11am ET, Akamai  reported an issue with its Edge DNS, a service that’s designed to keep websites, apps and services running smoothly and securely.\n DNS services are critically important to how the internet works, so when things go wrong or there’s an outage, it has a knock-on effect to all of the customer websites and services that use it.\n Akamai said it was “actively investigating the issue,” but when reached a spokesperson would not say if its outage was the cause of the disruption to other sites and services that are currently offline.\n It’s not known what caused the incident but Akamai said it was already in recovery.\n “We have implemented a fix for this issue, and based on current observations, the service is resuming normal operations. We will continue to monitor to ensure that the impact has been fully mitigated,” Akamai told TechCrunch.\n It’s not the first time we’ve seen an outage this big. Last year Cloudflare, which also provides networking services to companies around the world, had a  similar outage following a bug that caused major sites to stop loading, including Shopify, Discord and Politico. In November, Amazon’s cloud service  also stumbled, which prevented it updating its own status page during the downtime. Online workspace startup Notion also had  a high-profile outage this year, forcing the company to turn to Twitter to ask for help.", "posttime": "2021-07-23 00:57:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "中断,outage,服务", "title": "DNS 中断只是中断了互联网的很大一部分", "title_en": "\n\t\t\t\tA DNS outage just took down a good chunk of the internet\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/a-dns-outage-just-took-down-a-good-chunk-of-the-internet/", "via": "", "real_tags": ["中断", "outage", "服务"]}, {"category": "", "categoryclass": "", "imagename": "576f1a8626f596a4058f787fe5997c33.jpg", "infoid": 1069046, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "许多网站——包括银行页面、经纪商和游戏服务——都受到了一场看似重大的互联网中断的影响。随着网站所有者和运营提供网络支柱的服务的公司争先恐后地解决这个问题，消费者一直无法访问像 Ally Bank、Fidelity、索尼的 PlayStation Network、Airbnb 等服务。几个航空公司的网站也存在问题：达美航空、英国航空公司和西南航空的网站都存在重大问题。目前，尚不清楚是什么导致了中断，但托管大部分互联网的内容交付网络 Akamai 已向 The Verge 证实它正在经历中断，并表示已经推出了修复程序。纽约地铁交通管理局和《印度时报》都在推特上表示，他们的服务中断是由 Akamai 造成的。 Cloudflare 的 CEO 插话说，它的服务不应该受到指责。我们也联系了 Oracle；也有人提到其 Oracle 云可能存在问题。由于目前全球 Akamai 中断，您可能无法访问多种数字工具，包括 https://t.co/1mbGGZApQy 和 MYmta。同时，如果您需要任何帮助，请私信@NYCTSubway 或@NYCTBus。 — MTA。戴口罩。停止传播。 (@MTA) 2021 年 7 月 22 日 由于我们的内容交付网络 Akamai 中断，我们的一些数字服务目前受到影响。我们正在努力尽快恢复我们的服务。 — 印度时报 (@timesofindia) 2021 年 7 月 22 日我们知道一些客户可能会遇到我们平台的问题。我们正在紧急努力解决这些问题。对于给您带来的不便，我们深表歉意，并感谢您成为我们的客户。\n— Fidelity Investments (@Fidelity) 2021 年 7 月 22 日 游戏服务也受到重创。 DownDetector 报告称，有超过 40,000 名用户在使用 PlayStation Network 时遇到问题，并且 Steam 商店目前也无法运行。 DownDetector 还报告了 Fortnite 和 Call of Duty 等游戏的问题。在我们发布这篇文章之前不久，索尼的 PSN 状态页面承认了一个问题：“PlayStation Network 服务已启动并正在运行，但存在可能影响您的体验的外部互联网问题，”该公司写道。就更重要的服务而言，许多银行的网站似乎无法使用，并且有报道称多个州的 911 系统已关闭。然而，目前还不清楚紧急服务中断是否与其他网络中断有关——弗吉尼亚州格雷森县的警长部门报告说，其 911 中断是由于光纤中断造成的。像这样的中断表明，虽然网络理论上是分散的，但许多主要网站的功能都依赖于少数公司。 6 月，一位客户遇到了一个错误，导致 Fastly 的 CDN 服务中断——Reddit、Twitch 和 The Verge 也随之中断。亚马逊网络服务的问题也导致了严重的中断。", "note_en": "Many websites — including banking pages, brokerages, and gaming services — have been affected by what looks to be a major internet outage. As website owners and companies that run services that provide the backbone of the web scramble to solve the issue, consumers have been left unable to access services like Ally Bank, Fidelity, Sony’s PlayStation Network, Airbnb, and more. Several airline sites are also having issues: Delta, British Airways, and Southwest’s sites are all having major issues.\n At the moment, it’s unclear what’s causing the outage, but Akamai, a content delivery network that hosts much of the internet, has confirmed to The Verge that it’s experiencing an outage and  says that a fix is already rolling out. Both the  New York Metro Transportation Authority and   The Times of India have tweeted that their service outages are due to Akamai. Cloudflare’s CEO  has chimed in to say that its service isn’t to blame. We’ve reached out to Oracle as well; its Oracle Cloud has also been mentioned as  potentially having an issue.\n You may be unable to access several digital tools, including  https://t.co/1mbGGZApQy and MYmta, because of the global Akamai outage right now.  In the meantime, please DM  @NYCTSubway or  @NYCTBus if you need any help.\n— MTA. Wear a Mask. Stop the Spread. (@MTA)  July 22, 2021\n Some of our digital services are currently affected due to an outage at Akamai, our content delivery network. We are working to get our services back as quickly as we can.\n— The Times Of India (@timesofindia)  July 22, 2021\n We are aware that some customers may be experiencing issues with our platforms. We are working urgently on resolving the issues. We apologize for the inconvenience and appreciate your being a customer.\n— Fidelity Investments (@Fidelity)  July 22, 2021\n Gaming services have also been hit hard.  DownDetector reports a spike of over 40,000 users who are having issues with the PlayStation Network, and the Steam store is also not currently functioning. DownDetector also reports issues with games like  Fortnite and  Call of Duty.  Sony’s PSN status page acknowledged an issue shortly before we published this post: “PlayStation Network services are up and running, but there are external, internet-wide issues that might affect your experience,” the company wrote.\n     As far as more essential services, a number of banks’ websites appear to be nonfunctional, and  there are reports of 911 systems being down across multiple states. It is, however, unclear if the emergency services outage is related to the other web outages — the Sheriff’s Department of Grayson County, Virginia,  reports that its 911 outage stems from a fiber cut.\n Outages like this show that, while the web is decentralized in theory, many major sites’ functionality is dependent on a handful of companies. In June,  a single customer hit a bug that brought down Fastly’s CDN service — and Reddit, Twitch, and  The Verge  went down with it. Problem’s with Amazon’s Web Services  have also caused major outages.", "posttime": "2021-07-23 00:54:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "中断,brokerages", "title": "银行、经纪商、PSN、Steam 商店等因大规模互联网中断而倒闭", "title_en": "Banks, Brokerages, PSN, the Steam Store, and More Are Down in Massive Internet Outage", "transed": 1, "url": "https://www.theverge.com/2021/7/22/22588837/internet-outage-psn-steam-banks-trading-gaming-more-911-systems", "via": "", "real_tags": ["中断"]}, {"category": "", "categoryclass": "", "imagename": "19f4b0833b89fe94327289491d818f79.jpg", "infoid": 1069045, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与所有特拉华州的文件一样，它们只讲述了故事的一部分，因此该公司最终可能会在本轮结束前或多或少地筹集资金。 （在这种情况下，它看起来像是“更多”。）就某些融资背景而言，仅在 3 月份，Gopuff 就以 89 亿美元的估值筹集了 11.5 亿美元。而这一轮是在 3.8 亿美元（38 亿美元）估值之后的几个月。 Gopuff 的速食杂货模式带来了即时融资，看起来：在 10 个月的时间里，三轮融资总计约为 25 亿美元。 （该公司前几轮的投资者包括 Accel、D1 Capital Partners、Fidelity Management and Research Company、Baillie Gifford、Eldridge、Reinvent Capital、Luxor Capital 和 SoftBank。）与按需运输市场的投资竞赛非常相似，速食杂货业的大部分筹款似乎旨在尽快扩大规模，以建立技术、运营和客户护城河。因此，对于 Gopuff 而言，它迄今为止筹集的部分资金已用于有机扩张。也就是说，它正在投资以在美国 650 多个城市中获得新客户并建立其基础设施——骑手、存放他们产品的“黑暗”商店，以及最近的“Gopuff 厨房”——在这些城市中，它已经运营了 1.95 美元的固定费用“几分钟内”送货服务。考虑到像DoorDash这样的其他公司也在以相同的模式认真竞争以快速交付有限的食物和饮料，家庭必需品和非处方药，它可能会以特别快的速度这样做药物。但除此之外，它积累的一些现金也被用于收购。到目前为止，这些仅限于美国并扩大 Gopuff 在该市场的广度。它于 2020 年 11 月以 3.5 亿美元收购了酒类零售商 BevMo；今年 6 月，Gopuff 以 1.15 亿美元收购了物流科技公司rideOS。收购过程的下一阶段看起来可能会专注于收购 Gopuff 未来希望进入的关键市场的类似公司，尤其是在国际市场上，因为它致力于实现今年达到 10 亿美元收入的雄心。 （去年数字的 3 倍）。今年 6 月，有传言称 Gopuff 已经接触了德国的速食食品公司 Flink。虽然这还没有到任何地方（还没有？），但位置优越的消息人士告诉我们——而且似乎还有其他人——Gopuff 也在将其国际目光投向英格兰，参与讨论以收购两家不同的即时交付公司。伦敦，二月份的第一次 Fancy，以及最近的 Dija。\nGopuff 也拒绝对 Dija 发表评论，但我们有多个位置优越的消息来源告诉我们它正在开发中。伦敦目前是一个竞争激烈的即时杂货配送市场——尤其是因为它人口稠密且通常难以出行，消费者对按需配送服务表现出强烈的需求，并且拥有一群拥有体面的年轻人为了方便，可支配收入多付一点。这谈到了机会，但也可能有太多的希望。除了 Dija 和 Fance，我们还有土耳其的 Getir，由红杉和其他一些公司支持，目前正在雄心勃勃地进行国际投资；大猩猩（如来自柏林的 Flink）；扎普;和 Weezy——都提供“即时”杂货配送服务。这些只是独立的、较新的初创公司。未完待续：像Deliveroo这样的老牌餐厅外卖公司也可能会大放异彩。也许不足为奇，鉴于该领域，我们听说 Dija 一直在努力筹集更多资金，这导致这家初创公司寻找买家作为替代方案。这种趋势也在其他地方上演：本月早些时候在西班牙，Getir 收购了 Blok，这是另一家正在努力吸引投资者参与的新即时播放器。我们与位置优越的消息来源确认，在 Gopuff 出现之前，Dija 也曾在这种情况下与 Getir 谈过（没有去任何地方）。可能会有更多这些。 “这将是一场大屠杀，”一位大投资者最近向我描述了速食杂货市场。鉴于在线杂货仍然是市场中相对较小的一部分——即使在大流行及其对电子商务的改变习惯的影响下，它仍然不到销售额的 10%，即使在最适合采用的城市——仍然有很多在“即时”杂货中发挥作用。但是，如果最新一轮向我们展示了什么，那就是这些快递公司中最有前途的公司将继续筹集更多资金，将自己定位为其中的整合者。", "note_en": "As with all Delaware filings, they only tell part of the story, so the company might ultimately raise more or less before the round closes. (And in this case it looks like “more.”)\n For some funding context, it was  only in March that Gopuff raised $1.15 billion at an $8.9 billion valuation. And that round came just months after a $380 million round (at a $3.8 billion) valuation. With Gopuff’s instant grocery model comes instant funding, it seems: together the three rounds would total around $2.5 billion in funding in the space of 10 months. (Investors in the company’s previous rounds have included Accel, D1 Capital Partners, Fidelity Management and Research Company, Baillie Gifford, Eldridge, Reinvent Capital, Luxor Capital, and SoftBank.)\n  Much like the investment race in the transportation-on-demand market, a large part of the fundraising in instant grocery seems to be aimed at scaling as fast as possible to build technological, operational and customer moats.\n So for Gopuff, some of the money it’s raised so far has been used to expand organically. That is, it’s investing to acquire new customers and build out its infrastructure — riders, “dark” stores stocked with their products, and most recently “Gopuff kitchens” — within the 650+ cities in the U.S. where it already operates its $1.95 flat fee “in minutes” delivery service. It will likely be doing so at a particularly fast pace, considering that others like DoorDash are also moving in to compete in earnest around the same model for quick deliveries of a limited selection of food and drinks, home essentials, and over-the-counter medication.\n But alongside that, some of the cash it is amassing is also being used for acquisitions. So far, these have been limited to the U.S. and to expand Gopuff’s breadth in that market. It bought alcohol retailer  BevMo for $350 million in November 2020; and in June of this year Gopuff acquired logistics tech company  rideOS for $115 million.\n The next stage of that acquisition process looks like it may be focused on snapping up similar companies in key markets where Gopuff wants to be in the future, particularly internationally, as it works to fill out a reported ambition of  reaching $1 billion in revenues this year (3x last year’s numbers).\n In June, there were  rumors around that Gopuff had approached Flink, an instant grocery player in Germany. While that has not gone anywhere (yet?), well-placed sources have told us — and, it seems,  others — that Gopuff is also casting its international eye on England, engaging in discussions to acquire two different instant delivery companies based out of London, first  Fancy back in February, and more recently,  Dija.\n Gopuff also declined to coment on Dija but we have multiple, well-placed sources telling us it’s in the works.\n London is a hugely competitive market for instant grocery delivery at the moment — not least because it is dense and often hard to get around, has demonstrated a strong consumer appetite for on-demand delivery services, and has a population of younger people with a decent amount of disposable income to pay a little more for convenience.\n That speaks of opportunity, but also possibly too many hopefuls as well. In addition to Dija and Fance, we have Turkey’s Getir, backed by Sequoia and a number of others on an ambitious international roll at the moment; Gorillas (like Flink, from Berlin); Zapp; and Weezy — all offering “instant” grocery delivery. And these are just the standalone, newer startups. Still to come: established restaurant delivery players like Deliveroo that might also throw their hats into the ring.\n Perhaps unsurprisingly, given that field, we’ve heard that Dija has been struggling to raise more money, and that led to the startup looking for buyers as an alternative.\n That is a trend that’s playing out elsewhere too: In Spain  Getir earlier this month acquired Blok, another new instant player that was struggling to get investors on board. We confirmed with well-placed sources that Dija had also talked with Getir in this context (that didn’t go anywhere) before Gopuff entered the picture. There will likely be more of these.\n “It’s going to be a bloodbath,” is how one big investor recently described the instant grocery market to me.\n Given that online grocery remains a relatively minor part of the market — even with the pandemic and its habit-changing impact on e-commerce, it’s still under 10% of sales, even in the most adoption-friendly cities — there is still a lot to play for in “instant” groceries. But if this latest round shows us anything, it’s that the most promising of these delivery companies will continue raising a lot more money to position themselves as consolidators within it.", "posttime": "2021-07-23 00:53:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "杂货,gopuff", "title": "备案：杂货配送初创公司 Gopuff 以 13.5B 美元的估值筹集了高达 7.5 亿美元的 H 系列； Gopuff 在三月份以 8.9B 美元的估值筹集了 1.15B 美元", "title_en": "Filing: grocery delivery startup Gopuff is raising up to $750M Series H at a valuation of $13.5B; Gopuff last raised $1.15B at an $8.9B valuation in March", "transed": 1, "url": "https://techcrunch.com/2021/07/22/filing-instant-grocery-startup-gopuff-is-raising-750m-more-at-a-13-5b-valuation/", "via": "", "real_tags": ["杂货", "gopuff"]}, {"category": "", "categoryclass": "", "imagename": "5c1c008129b63a8a9e96fec1f94d133c.png", "infoid": 1069044, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌终于为其新的、统一的智能手表平台取了一个名字——这是一个显而易见的名字：Wear OS 3。这个小细节可能是一组更有争议的信息的一部分，关于哪些当前的 Wear OS 智能手表将更新更新将会到来，以及这些更新将带来什么。在这三个方面，这都不是什么好消息。谷歌表示，Wear OS 3 更新将在“2022 年下半年”开始向有限的智能手表推出。这还有很长的路要走，特别是因为我们预计下个月将在三星的 Unpacked 活动中发布首款 Wear OS 3 手表。目前，可以获得更新的手表列表“包括出门问问的 TicWatch Pro 3 GPS、TicWatch Pro 3 Cellular/LTE、TicWatch E3 以及后续的 TicWatch 设备，以及 Fossil Group 将于今年晚些时候推出的新一代设备”。到谷歌的帖子。这让很多 Wear OS 手表望而却步，包括 Fossil 及其相关品牌的所有产品。该列表还排除了所有三星基于 Tizen 的手表。它们目前是大多数 Android 用户的最佳选择，但现在它们似乎正式具有到期日期。没有其他说法：对于 Android 用户来说，现在购买智能手表并不是一个好主意。今天可用的所有东西要么不会更新，要么要到 2022 年末才能收到更新。这是最近记忆中奥斯本效应最清晰、最直接的例子。更直率地说，购买该列表中的手表可能不是一个好主意，因为该更新还有进一步的复杂性。谷歌表示“在某些有限的情况下，用户体验可能会受到影响”，但目前拒绝进一步详细说明。这可能意味着很多事情，但任何计算机的共同体验是新操作系统在旧硬件上感觉很慢。在一封电子邮件声明中，一位发言人承诺谷歌将“在更新之前提供更多细节，以便用户做出明智的决定。”\n此外，升级到 Wear OS 3 将需要完全恢复出厂设置，擦除您可能在手表上拥有的任何设置和数据。大多数都应该备份到你的手机上，因为 Wear OS 应用程序通常不是完全独立在手表上的，但它仍然可能很麻烦。而且您可能无法在更新后点击恢复按钮来恢复您的旧手表设置。谷歌至少认识到许多手表所有者不想经历所有这些麻烦，因此它提供了一种拒绝更新但仍会收到安全补丁的方法。该公司承诺通过更新继续支持当前版本的 Wear OS，并将在“设备发布后两年内”提供安全更新。这篇博文很可能是为了尽早消除坏消息，以便为三星的 Galaxy 智能手表发布铺平道路——更不用说谷歌 Pixel 手表也可能出现的传闻。经过这么多年的萎靡不振，Wear OS 的下一个版本将有很多需要证明的地方。尽管它于今年 5 月在 Google I/O 上宣布，但我们仍然没有全面了解它在实际使用中的实际工作情况。我们知道它采用了三星 Tizen 平台的一些元素——比如表盘——但通常它比 Tizen 更像是 Wear OS。到目前为止，我们所看到的 Wear OS 3 是有希望的。谷歌表示，它将比当前的智能手表更快，同时还提供更长的电池寿命。它还应该提供一个独立的谷歌地图应用程序、离线 Spotify 音乐和集成的 Fitbit 活动跟踪。所有这一切都意味着，如果您是想要智能手表的 Android 用户，那么您现在拥有的最佳选择就是等待新的 Wear OS 3 手表发布和审核。", "note_en": "Google has finally given its new,  unified smartwatch platform a name — and it’s an obvious one: Wear OS 3. That little detail was part of what may be a more contentious set of information about which current Wear OS smartwatches will be updated, when those updates will come, and what those updates will entail. On all three of those fronts, it’s not very good news.\n Google says that Wear OS 3 updates will start rolling out to a limited set of smartwatches in the “second half of 2022.” That’s quite a long way away, especially since we’re expecting the  first Wear OS 3 watches to be announced next month at Samsung’s Unpacked event.\n Currently, the list of watches that could get the update “include Mobvoi’s TicWatch Pro 3 GPS, TicWatch Pro 3 Cellular/LTE, TicWatch E3 and follow on TicWatch devices, as well as Fossil Group’s new generation of devices launching later this year,” according to Google’s post.\n That leaves a lot of Wear OS watches out, including everything from Fossil and its associated brands. And that list also leaves all of Samsung’s Tizen-based watches out. They’re currently the best option for most Android users, but they now appear to officially have an expiration date.\n There’s no other way to put this: for Android users, it’s not a good idea to buy a smartwatch right now. Everything that’s available today either won’t be updated or won’t receive an update until late 2022. It’s the clearest and most direct example of the  Osborne effect in recent memory.\n And to be even blunter, it may not be a good idea to buy watches that  are on that list, as there are further complications with that update. Google says that “in some limited cases, the user experience may be impacted” but declined to elaborate further right now. That could mean a lot of things, but a common experience with any computer is new operating systems feeling slow on older hardware.\n In an emailed statement, a spokesperson promised that Google would “provide more details in advance of the update so users can make an informed decision.”\n Additionally, upgrading to Wear OS 3 will require a full factory reset, wiping any settings and data you might have on the watch. Most of that should be backed up to your phone regardless as Wear OS apps usually aren’t fully self-contained on the watch, but it’s still likely to be a hassle. And you likely won’t be able to just hit a restore button after the update to bring back your old watch settings.\n  Google at least recognizes that many watch owners will not want to go through all that hassle, so it is offering a way to decline the update but still receive security patches. The company promises to continue to support the current version of Wear OS with updates and will offer security updates for “two years from device launch.”\n The blog post is likely meant to get the bad news out of the way early so that the decks are cleared for Samsung’s Galaxy smartwatch announcements — not to mention rumors of a Google Pixel watch that may also be in the wings.\n After so many years of languishing, the next version of Wear OS will have a lot to prove. Although it was  announced this past May at Google I/O, we still don’t have a full picture of how it will actually work in real use. We know that it takes some elements from Samsung’s Tizen platform — like watchfaces — but that generally it’s more Wear OS than Tizen.\n What we have seen of Wear OS 3 so far is promising. Google says it will be faster than current smartwatches while also offering longer battery life. It should also offer a standalone Google Maps app, offline Spotify music, and integrated Fitbit activity tracking.\n All of which means that if you’re an Android user who wants a smartwatch, the best option you have right now is to simply wait until new Wear OS 3 watches are launched and reviewed.", "posttime": "2021-07-23 00:53:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,2020,谷歌,手表,watches", "title": "谷歌与三星的统一智能手表平台将被称为 Wear OS 3，并将作为 2020 年下半年几款手表的更新，不包括任何 Tizen 手表", "title_en": "Google's unified smartwatch platform with Samsung to be called Wear OS 3 and come as an update to a few watches in H2 2020, not including any Tizen watches", "transed": 1, "url": "https://www.theverge.com/2021/7/22/22588440/google-wear-os-3-update-smartwatch-samsung-2022?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["google", "2020", "谷歌", "手表", "watches"]}, {"category": "", "categoryclass": "", "imagename": "da64f5488a3fa811b3c78839aec4f2c3.png", "infoid": 1069043, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国东部时间下午 12:48 更新：Akamai 表示已针对该问题实施了修复。 “我们已针对此问题实施了修复，根据目前的观察，该服务正在恢复正常运营。我们将继续进行监控，以确保完全减轻影响，”它说。一个明显的 DNS 问题正在影响当今许多知名网站，使它们脱机并导致用户出现错误消息。美国东部时间今天下午 12 点左右，有关 Downdetector 的报告开始激增，用户在访问 Chase、AT&amp;T、HBO、Steam、美国运通等网站时遇到问题。截至目前，中断似乎是由影响 Akamai Edge DNS 服务的问题引起的。该公司在其系统状态网页上发布了更新，承认中断：我们正在积极调查该问题。如果您有疑问或因此问题而受到影响，请联系 Akamai 技术支持。为了节省时间，我们为您提供最新的可用信息，这些信息可能会发生变化、更正和更新。这类似于上个月导致许多主要网站瘫痪的 Fastly CDN 中断，包括亚马逊、Reddit、Twitter 和 Spotify。您现在是否在访问任何网站时遇到问题？请在评论中告诉我们。随着情况的发展，我们一定会更新这个故事。您正在阅读 9to5Mac — 日复一日地发布有关 Apple 及其周边生态系统新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 9to5Mac 以了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作方法，并订阅我们的 YouTube 频道", "note_en": "Update 12:48 p.m. ET: Akamai  says it has implemented a fix for the issue. “We have implemented a fix for this issue, and based on current observations, the service is resuming normal operations. We will continue to monitor to ensure that the impact has been fully mitigated,” it says.\n An apparent DNS issue is affecting a number of high-profile websites today, taking them offline and leading to error messages for users. Reports on  Downdetector began to spike around 12 p.m. ET today, with users facing issues accessing websites such as Chase, AT&amp;T, HBO, Steam, American Express, and more.\n  As of right now, it appears that the outages are being caused by issues affecting the Akamai Edge DNS service. The company posted an update on its  system status webpage acknowledging the outages:\n We are actively investigating the issue. If you have questions or are experiencing impact due to this issue, please contact Akamai Technical Support. In the interest of time, we are providing you the most current information available, which is subject to changes, corrections, and updates.\n   This is  similar to the Fastly CDN outage that brought down a number of major websites last month, including Amazon, Reddit, Twitter, and Spotify.\n Are you facing issues accessing any websites right now? Let us know down in the comments. We’ll be sure to update this story as the situation progresses.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-07-23 00:53:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "edge,websites", "title": "由于 Akamai Edge DNS 服务的问题，许多大型网站都关闭了，包括 PlayStation Network、Steam 和 UPS", "title_en": "Many large websites are down, including PlayStation Network, Steam, and UPS, due to an issue at the Akamai Edge DNS service", "transed": 1, "url": "https://9to5mac.com/2021/07/22/dns-outage-akamai-steam-chase-and-more/", "via": "", "real_tags": ["edge", "websites"]}, {"category": "", "categoryclass": "", "imagename": "b07aa62c298184cb88efa14ac8109b05.jpg", "infoid": 1069042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自 1963 年西尔维娅·普拉斯 (Sylvia Plath) 去世后，她就变成了一个粗俗的悲剧象征。莉莲·克劳馥问道，随着她启发更多传记，我们是否会更接近“真正的”普拉斯。当一位女作家自杀身亡时，它定义了她。从弗吉尼亚伍尔夫到莎拉凯恩，她所做的一切，她一生中创造的一切都成为死亡驱动叙事的一部分。一位男性作家过早去世，这是他创作成果的悲剧性阻碍——例如，我们哀悼迪伦·托马斯（Dylan Thomas）在 1953 年 39 岁去世后从未写过的诗歌，这与他自我毁灭的生活方式截然不同。伍尔夫的小说和凯恩的戏剧被称为是精神疾病的表现，而托马斯的诗歌虽然不是因为他酗酒和生活困难，但仍然非常出色。更像这样：在那些被自杀定义的女性艺术家中，最主要的是美国诗人和小说家西尔维娅·普拉斯，她于 1963 年 2 月 11 日去世。从那时起，她的名字就成了女性焦虑的代名词。她的作品代表了叛逆但沮丧的年轻女性，她们在流行文化背景中的出现证明了这一点——1999 年青少年 rom-com 中的 Kat 手握钟罩的副本，就像最近 Netflix 系列性教育中的梅芙一样.普拉斯已成为局外人女孩的粗略象征，她拒绝传统的女性气质标准，将自己的生死掌握在自己的手中。这种解释扩散的影响是贬低女性与普拉斯的交往。例如，阅读她的成年小说《钟形罩》，被许多人视为一种少女般的严肃文学的成人礼，这种看法经常反映在 YA 风格的封面设计中。从 JD Salinger 到 David Foster Wallace 的作品，男性成年的叙事并非如此。但事实是，普拉斯是最早深入了解女性原始现实的作者之一。在女权主义第二波和贝蒂弗里丹的《女性的奥秘》之前，普拉斯写到了她对女性劣等地位的不满、她的性冲动，以及这些压力如何影响她的心理健康。同时，钟罩和普拉斯的诗歌都是虚构的。它们以普拉斯的生活经历为基础，就像所有文学作品一样，但它们当然不是直接的自传。传记经常引用普拉斯的作品作为现实生活事件的证据，而且，就像安妮史蒂文森的《苦涩名声》一样，用它们来声称普拉斯总是很沮丧；史蒂文森以令人震惊的声明结束了关于她年轻的一章：“自杀的想法在她的脑海中形成，就像最终的、不可逆转的无花果一样”，指的是《钟形瓶》中的著名比喻，女主人公埃丝特·格林伍德将她所有潜在的未来视为无花果在一棵无花果树上。类似的偏见继续影响有创造力的女性，因此她们被视为使用艺术作为治疗而被驳回。我们与普拉斯面临的问题是，她生死的神话让她很难将她的艺术与此分开——但无论如何，也知道谁是“真正的”西尔维娅·普拉斯。然而，了解普拉斯的愿望推动了一个行业。一本声称比以前更了解她生活的新传记越来越频繁地出现在书架上，其中仅在过去 18 个月就出版了三本著名的传记。其中一本书，卡尔·罗利森 (Carl Rollyson) 的《西尔维娅·普拉斯的最后日子》(The Last Days of Sylvia Plath)，于 2020 年 3 月出版，仅关注她的自杀。另一本由盖尔·克劳瑟 (Gail Crowther) 于 4 月出版的《丽兹酒店的三个马提尼下午》(Three-Martini Afternoons at the Ritz) 是普拉斯 (Plath) 和波士顿诗人安妮·塞克斯顿 (Anne Sexton) 的双重传记，他们于 1959 年在诗人罗伯特·洛厄尔 (Robert Lowell) 举办的作家研讨会上相识。 第三本书是希瑟 (Heather)克拉克的巨著《红色彗星》：去年 10 月出版，与克劳瑟的作品一起，是第一部充分利用普拉斯最近出版的、完整且未删节的信件的书籍之一，并故意颠覆了以死亡为中心的相反方向早期书籍的年表。尽管这些书可能希望从全新的角度理解普拉斯，但可以说，他们的使命正变得越来越具有挑战性，因为准备取代它们的评论和传记作品源源不断，以及她档案中不断增加的已出版材料。她的传记甚至还有一本传记：1994 年，上个月去世的伟大的纽约客作家珍妮特马尔科姆出版了《沉默的女人》，这是对普拉斯书籍（包括史蒂文森有争议的《苦名》）的研究，试图考虑影响决定传记写作的性质。\n在准备她的书时，马尔科姆联系了奥尔文休斯，奥尔文休斯，普拉斯丈夫的妹妹，诗人泰德休斯，以及她遗产的文学执行人，寻求与泰德的采访以补充她的研究。她收到的回应是对“西尔维娅·普拉斯的神话”的扩展、自发的批评，奥尔文认为这是普拉斯本人和普拉斯的母亲奥瑞莉亚共同推动的，奥尔文声称她“为精神疾病感到羞耻”，并确定只有她女儿的“最好的一面”会被记住。奥尔文感到震惊，她继续说，作家和公众对普拉斯的家人缺乏“人情味”，结果“完全改变了[她]对人的整个态度”。然而，马尔科姆在《沉默的女人》中取得的成就是提醒我们普拉斯不是神话，而是一个和我们一样生活和呼吸的女人。通过将自己带入故事中，以反思自己在西尔维娅·普拉斯 (Sylvia Plath) 死后叙事中的角色——而不是假装客观——马尔科姆写了迄今为止关于诗人的最人性化的书。奥尔文对奥蕾莉亚·普拉斯的批评最明确地针对她编辑和出版西尔维亚的《家书》。该集出版于 1975 年，收录了西尔维娅·普拉斯 (Sylvia Plath) 与她母亲的信件，从她 50 年代初在史密斯学院到 1963 年她生命的尽头。正如珍妮特·马尔科姆 (Janet Malcolm) 在《沉默的女人》(The Silent Woman) 中所记录的那样，奥尔温将《回家的信》视为对“锤击 [奥瑞莉亚] 采取”的回应来自她在钟罩中作为以斯帖母亲的虚构描述，以及几首诗，包括美杜莎和令人不安的缪斯。 1971 年，Aurelia 写信给 The Bell Jar 的美国出版商，要求 Ted 不要发布它，哀叹说，由于将她描绘成一个冷漠的监工，“因为这本书本身就是最卑鄙的忘恩负义” .相比之下，选择“Sivvy”中的溺爱信件，旨在表明他们之间存在着深厚的母女关系。奥蕾莉亚希望将这些信件分两卷而不是一卷出版，但由于出版商的限制，她压缩了她的收藏。直到 2017-8 年，未删节的信件才出版，由 Peter K Steinberg 和 Karen V Kukil 编辑。该系列展示了普拉斯与朋友、恋人和家人通信时所用的不同书面声音，揭示了一个比 Letters Home 创造的一维女儿更为复杂和人性化的作家。与之前的收藏不同，这些卷也没有对原始语言进行编辑，也没有 Aurelia 的个人介绍或她的任何其他评论。连同普拉斯未删节的期刊，之前由 Faber &amp; Faber 于 2000 年在泰德·休斯的许可下出版，这些信件代表了普拉斯选择看到的样子，尽管无意将它们提供给读者。根据马尔科姆在《沉默的女人》中的说法，在《回家的信》出版后，“这个传奇开始了，成为一部以最完美、最具体的现实主义为背景拍摄的庞大而庞大的电影小说”。随着 2003 年由格温妮丝·帕特洛 (Gwyneth Paltrow) 主演的传记片《西尔维亚》(Sylvia) 的制作，这些电影场景变成了现实。普拉斯的女儿弗里达休斯写了一首诗批评这部电影；她说，它的目的是为了娱乐“吃花生的人”，暗指她母亲的诗《拉撒路夫人》，她在诗中描述了“吃花生的人群”要“解开我的手和脚---/大脱衣舞”。鉴于传记作者在试图对普拉斯有一个清晰的认识时所面临的问题，值得询问关于她的生活的新书可以提供什么。考虑到普拉斯神话的广泛性，很难区分那些试图通过揭示她死亡的病态细节来获利的书籍，以及那些试图将公众注意力重新调整到她的文学重要性的书籍。罗利森的《西尔维娅·普拉斯的最后日子》在其标题中宣布它落入了前阵营，并承诺在导致她自杀的事件中提供前所未有的细节。像马尔科姆这样的女权主义作家谴责将普拉斯的生活和性格降低到她抑郁最严重的时期。只要这种还原方法持续存在，学者就需要通过其他方法来反击。克劳瑟之前关于普拉斯的作品，包括《闹鬼的读者》（2017 年）和《这些幽灵档案》（2017 年），专注于她今天的理解方式，她说她第一次遇到普拉斯是在她 13 岁时阅读了她 1961 年的诗《镜子》在学校图书馆里。至于为什么她将研究重点放在普拉斯身上，克劳瑟引用了伊丽莎白鲍文的说法，即受试者会找到他们的研究人员，而不是相反。特别是，她告诉 BBC Culture，她觉得普拉斯被一些传记作者通过“懒惰和不准确的刻板印象”描述为“某种‘注定要失败的人物’”的方式感到不公正。她试图在自己的作品中与这一点作斗争，展示“普拉斯作为女性的生活经历对她的写作至关重要”，并剖析了她今天继续拥有的吸引力。克劳瑟关于普拉斯的第三本也是最新的书《丽兹酒店的三个马提尼下午》着重讲述了普拉斯与诗人塞克斯顿的相识，以展示他们的会面如何影响了他们各自的工作。塞克斯顿本人在 1963 年的讣告诗《西尔维娅之死》中为普拉提亚神话增添了活力，她在其中称她的朋友为“小偷！因为爬进“我非常想要的死亡”。 1974 年，她也因自杀身亡，享年 45 岁，这一事实促使人们将其与普拉斯同时进行比较。然而，塞克斯顿是一个更有问题的主题。 1990 年代初，她的女儿琳达·格雷·塞克斯顿 (Linda Gray Sexton) 透露，她的母亲对她进行了性虐待——这与弗里达·休斯 (Frieda Hughes) 与普拉斯 (Plath) 的幸福关系形成了鲜明对比。\n如果强调这些女性的个人主义很重要，那么这本双重传记就难免有相似之处——例如，克劳瑟在各自的论文中反复将香烟灼伤的形象浪漫化，却没有提到塞克斯顿是一个终生抽烟的人，而普拉斯则没有。直到 1962 年她与泰德·休斯分手之前，她才碰一根烟。模糊的语言被用来在诗人之间描绘出比实际更多的相似之处，与普拉斯的整洁和塞克斯顿慵懒的外表之间的对比形成鲜明对比。这种本质区别存在于他们的诗歌中，尽管这本书不涉及文学分析。在阅读他们各自的诗歌时，只有塞克斯顿明确写下了月经和手淫，而普拉斯则通过文学和神话的镜头探索了女性身份和母性的主题。普拉斯更喜欢隐喻和典故；塞克斯顿说的都是事实。撇开她自己的书不谈，克劳瑟希望我们能更接近普拉斯在文化想象中的更全面定位。她说，特别是未删节的信件的出版“使镜头向后倾斜，让我们能够欣赏她在通信中使用的多种声音”，而不仅仅是给她母亲写信的“Sivvy”。通过这些新系列，“我们听到了她过去写给朋友、恋人、同事、她的商业信件的声音，这一切都让我们更全面地了解她的幽默、她的热情、她的效率以及她管理她的技巧。自己写的。”更重要的是，克劳瑟说，让我们可以听到这些不同的声音表明“她如何在这些角色之间无缝切换，从个人到专业”，以及她在这样做时非凡的情感范围。然而，也许相反，西尔维娅·普拉斯的“版本”之多只会让我们无法知道哪些是真实的。迄今为止，普拉斯最详尽的传记是克拉克的红色彗星。当被问及她写这本书的目的时，克拉克告诉 BBC 文化，她想表明普拉斯“近乎恒定的主题不是抑郁，而是成为作家的神圣追求”。她在牛津大学攻读北爱尔兰诗人博士学位时开始对普拉斯感兴趣。此前，由于媒体对普拉斯的主要描绘，她“已经沦为普拉斯是黑暗和厄运的化身的还原观念的牺牲品”。然而，通过阅读她正在教的课堂上的作品，克拉克意识到她“非常老练、机智，而且是的，很有趣”，这让她渴望推翻卖给她的“性别歧视谎言”。由此产生的书是任何作家最接近普拉斯生平和工作的详尽传记的书。克拉克还讨论了普拉斯与塞克斯顿的关系，阐明了他们的差异以及普拉斯对塞克斯顿的重要性，反之亦然。这本书给人的印象是丰富而复杂的生活，超出了它之前的短得多的作品中所表现出来的任何东西。偶尔，她确实暗示了普拉斯的命运，这在伏笔方面是错误的，包括关于“钟罩下降”的诗意盛行，这有损于她原本力求的真实性。有趣的是，即使在这些书中如此意识到推测和神话对普拉斯的看法所产生的危险影响，他们也可能不时陷入这种境地。尽管如此，克拉克对普拉斯的学术正在以丰富的方式发展持乐观态度。她的博士生们避开了传统的女权主义者将普拉斯作为她的时代之前作为作家的关注，这种关注主导了最近的学术话语，她的博士生正在从跨国和残疾的角度看待普拉斯的作品。反过来，这些角度对于考虑普拉斯旅行的影响以及她在英国作为美国人感到的身份不协调对她的写作产生的影响很重要。以及观察普拉斯的精神疾病如何反映在她的生活和工作中，同时也考虑到在心理健康不如今天了解的时代所带来的耻辱。随着普拉斯档案的扩展，这些新方法继续为他们提供更多的源材料。除了这些信件的出版外，美国史密斯学院普拉斯档案馆馆长库基尔现在正与纽约理工学院英语副教授阿曼达·戈登合作，对这本书进行了扩充和修正。诗集，之前由泰德·休斯编辑，将由 Faber &amp; Faber 出版。也有可能有一天，普拉斯遗失的小说《Double Take》和另外两本期刊的不完整手稿可能会浮出水面。然而，无论剩下什么出现，普拉斯总是比大多数文化偶像更像是一个谜——部分原因是她英年早逝，这意味着她从未有机会以自己的方式讲述她的故事。部分地，正如越来越明显的那样，由于普拉斯能够在不同的环境和不同的人中采用多种角色，因此很难知道她什么时候是真诚的，什么时候她是带着苦笑写的脸。我们可能会继续认为我们对她是谁有了更清晰的印象，但“真正的”西尔维娅·普拉斯仍然难以捉摸。\n如果您想评论这个故事或您在 BBC Culture 上看到的任何其他内容，请前往我们的 Facebook 页面或在 Twitter 上给我们留言。如果您喜欢这个故事，请注册每周 bbc.com 专题通讯，称为基本列表。从 BBC 未来、文化、工作生活和旅行中精心挑选的故事，每周五发送到您的收件箱。", "note_en": "Since Sylvia Plath died in 1963, she&#39;s been turned into a crudely tragic symbol. As she inspires more biographies, will we ever get closer to the &#39;real&#39; Plath, asks Lillian Crawford.\n When a female author dies by suicide, it defines her. From Virginia Woolf to Sarah Kane, everything she did, everything she created during her life becomes part of a death-drive narrative. When a male author dies prematurely, it is a tragic stopper in his creative output – we mourn the poetry Dylan Thomas never wrote after he died aged 39 in 1953, for example, distinct from his self-destructive lifestyle. Woolf&#39;s novels and Kane&#39;s plays are dubbed as being manifestations of mental illness, while Thomas&#39;s poetry is brilliant in spite of, rather than because of, his alcoholism and troubled life.    More like this:\n    Chief among those female artists who have become defined by their suicide is the US poet and novelist Sylvia Plath, who died on 11 February 1963. Since then, her name has become a by-word for female angst. Her works represent rebellious but depressed young women as evidenced by their appearance in pop-culture settings – Kat in the 1999 teen rom-com 10 Things I Hate About You clutches a copy of The Bell Jar, as does Maeve in recent Netflix series Sex Education. Plath has become a crude symbol of the girl outsider who rejects conventional standards of femininity to take her life, and death, into her own hands.\n  The impact of this interpretation&#39;s proliferation is to devalue women&#39;s engagements with Plath. To read her coming-of-age novel The Bell Jar, for example, is seen by many as a girlish rite of passage towards more serious literature, a perception often  reflected in the YA-style cover designs. This isn&#39;t the case for narratives of male comings-of-age, from the works of JD Salinger to David Foster Wallace. But the truth is that Plath was one of the first authors to tap into the raw reality of being a woman. Before feminism&#39;s second wave and Betty Friedan&#39;s The Feminine Mystique, Plath wrote of her discontent with a woman&#39;s inferior place, her sexual urges, and how these pressures affected her mental health.\n At the same time, The Bell Jar and Plath&#39;s poetry are works of fiction. They are grounded in Plath&#39;s lived experience, as all literature must be, but they are not, of course, direct autobiography. Biographies often cite Plath&#39;s works as evidence for real-life events, and, as is the case with Anne Stevenson&#39;s Bitter Fame, use them to claim Plath was always depressed; Stevenson ends a chapter about her youth with the egregious statement: &#34;The idea of suicide formed in her mind like the ultimate and irrevocable fig&#34;, referring to the famous metaphor from The Bell Jar where the heroine Esther Greenwood sees all her potential futures as figs on a fig tree. A similar prejudice has continued to affect creative women, whereby they are dismissed as using art as therapy. The problem we face with Plath is that the mythos of her life and death has made it difficult to disentangle her art from that – but also know who the &#34;real&#34; Sylvia Plath was, in any case.\n  The desire to know Plath has nevertheless fuelled an industry. A new biography claiming to shed more light on her life than before appears on bookshelves with increasing regularity, including three notable releases in the past 18 months alone. One of these books, The Last Days of Sylvia Plath by Carl Rollyson, published in March 2020, focuses solely on her suicide. Another, Three-Martini Afternoons at the Ritz by Gail Crowther, published in April, is a dual biography of Plath and fellow Bostonian poet Anne Sexton, who met at a writers&#39; seminar held by poet Robert Lowell in 1959. The third book is Heather Clark&#39;s massive biography Red Comet: published last October, it is, alongside Crowther&#39;s, one of the first books about Plath to make full use of the recently-published, full and unabridged volumes of her letters, and deliberately subverts the reverse, death-focused chronology of earlier tomes.\n Even as these books may hope to understand Plath from a fresh perspective, their mission is arguably rendered ever more challenging by the steady stream of critical and biographical works ready to supplant them, alongside the ever-increasing volume of published material from her archive. There has even been a biography of her biographies: in 1994, the great New Yorker writer Janet Malcolm, who died last month, published The Silent Woman, a study of Plath books (including Stevenson&#39;s controversial Bitter Fame) which sought to consider the forces of influence which determine the nature of biographical writing.\n When preparing her book, Malcolm contacted Olwyn Hughes, the sister of Plath&#39;s husband, the poet Ted Hughes, and the literary executor of her estate, seeking an interview with Ted to supplement her research. The response she received was an  extended, unprompted critique of the &#34;myth of Sylvia Plath&#34;, something Olwyn believed was fuelled by a combination of Plath herself and Plath&#39;s mother, Aurelia, who was, Olwyn claimed, &#34;ashamed of the mental illness&#34;, and determined that only her daughter&#39;s &#34;best side&#34; was remembered. Olwyn was horrified, she went on, by a lack of &#34;human feeling&#34; shown by writers and the public for Plath&#39;s family and had as a result &#34;totally changed [her] entire attitude to people&#34;. However, what Malcolm achieved with The Silent Woman was to remind us that Plath was not a myth, but a woman who had lived and breathed as we do. By bringing herself into the story in order to reflect on her own role within the posthumous narrativisation of Sylvia Plath – rather than acting under the pretence of objectivity – Malcolm wrote the most human book on the poet to date.\n  Olwyn&#39;s criticism of Aurelia Plath was most explicitly targeted towards her editing and publication of Sylvia&#39;s Letters Home. This collection, published in 1975, compiled correspondence from Sylvia Plath to her mother, from her time at Smith College in the early 50s until the end of her life in 1963. As recorded by Janet Malcolm in The Silent Woman, Olwyn saw Letters Home as a response to &#34;the hammering [Aurelia] took&#34; from her fictionalised depiction in The Bell Jar as Esther&#39;s mother, as well as several poems, including Medusa and The Disquieting Muses. In 1971, Aurelia had written to The Bell Jar&#39;s US publisher and asked Ted not to release it, lamenting that, with its thinly-veiled portrayal of her as an unsympathetic taskmaster, &#34;as this book stands by itself, it represents the basest ingratitude&#34;. By contrast, the selection of doting letters from &#34;Sivvy&#34;, was intended to show that there had been a deep mother-daughter bond between them. Aurelia hoped to publish the letters in two volumes rather than one, but because of restrictions imposed by the publisher, she condensed her collection.\n  It wasn&#39;t until 2017-8 that the unabridged letters were published, edited by Peter K Steinberg and Karen V Kukil. This collection demonstrated the different written voices with which Plath corresponded with friends, lovers, and family, revealing a more complex and human writer than the one-dimensional daughter created by the Letters Home. Unlike that previous collection, these volumes are also presented without edits to the original language, and without either a personal introduction from Aurelia or any additional commentary from her. Along with Plath&#39;s unabridged journals, previously published by Faber &amp; Faber in 2000 with permission from Ted Hughes, these letters represent Plath as she chose to be seen, albeit without the intention of them being made available to the reading public.\n According to Malcolm in The Silent Woman, it was after the publication of Letters Home that &#34;the legend opened out, to become a vast, sprawling movie-novel filmed on sets of the most consummate and particularised realism&#34;. Those film sets became a literal reality with the production of the 2003 biopic Sylvia, starring Gwyneth Paltrow. Plath&#39;s daughter Frieda Hughes wrote a poem criticising the film; its purpose was to entertain &#34;the peanut-eaters&#34;, she said, alluding to her mother&#39;s poem Lady Lazarus, in which she describes “The peanut-crunching crowd” going to “unwrap me hand and foot --- / The big strip tease”.\n  In light of the problems which biographers have faced in trying to gain a clear view on Plath, it is worth asking what new books about her life can have to offer. Given the widespread nature of the Plathian myth, it can be hard to distinguish books trying to cash in on revealing morbid details about her death, from those attempting to realign public focus to the importance of her literature. Rollyson’s The Last Days of Sylvia Plath announces in its title that it falls into the former camp, promising unprecedented detail in the events that led to her suicide. It’s the sort of book feminist writers like Malcolm deplore for reducing Plath’s life and character to the worst period of her depression. As long as this reductive approach persists, there will be need for scholars to counter it through other approaches.\n Crowther, whose previous work on Plath, including the books The Haunted Reader (2017) and These Ghostly Archives (2017), has focused on how she is understood today, says that she first came across Plath aged 13 when she read her 1961 poem Mirror in the school library. As to why she has focused her study on Plath, Crowther cites Elizabeth Bowen&#39;s claim that subjects find their researchers, not the other way round. In particular, she tells BBC Culture, she felt a sense of injustice in the way Plath has been portrayed by some biographers as &#34;some sort of &#39;doomed figure&#39;&#34; through &#34;lazy and inaccurate stereotyping&#34;. She has sought to combat that in her own work, in showing how &#34;Plath&#39;s lived experience as a woman was crucial to her writing&#34; and dissecting the appeal she continues to have today.\n  Crowther&#39;s third and latest book on Plath, Three Martini Afternoons at the Ritz, focuses on Plath&#39;s acquaintance with fellow poet Sexton to show how their meeting may have influenced their respective work. Sexton herself fuelled the Plathian mythos with her 1963 obituary poem Sylvia&#39;s Death, in which she calls her friend a &#34;Thief!&#34; for crawling &#34;into the death I wanted so badly&#34;. She too died by suicide aged 45 in 1974, a fact that encouraged contemporaneous comparisons with Plath. Sexton is a more problematic subject, however. In the early 1990s, her daughter, Linda Gray Sexton, revealed that  her mother sexually abused her – a contrast to the happier relationship Frieda Hughes had with Plath.\n If it is important to highlight the individualism of these women, then this dual biography suffers from its forced similarities – for example, Crowther repeatedly romanticises the image of cigarette burns on their respective papers without mentioning that Sexton was a life-long chainsmoker and Plath didn&#39;t touch a cigarette until her split from Ted Hughes in 1962. Vague language is used to draw more similarities between the poets than there really were, countering the contrasts between Plath&#39;s tidiness and Sexton&#39;s lackadaisical appearance. This essential difference exists in their poetry, although the book does not engage with literary analysis. Reading their respective poems, it is only Sexton who writes explicitly of menstruation and masturbation, while Plath explored themes of female identity and motherhood through the lenses of literature and mythology. Plath preferred metaphor and allusion; Sexton said things as they were.\n  Her own books aside, Crowther hopes we are getting closer to a more rounded positioning of Plath in the cultural imagination. She says that the publication of the unabridged letters, in particular, have &#34;tilted the lens back to allow us to appreciate the multiplicity of voices she used in her correspondence&#34;, rather than just the &#34;Sivvy&#34; who wrote to her mother. Through these new collections, &#34;we hear the voices she used to write to friends, lovers, colleagues, her business correspondence, and this all gives us a much fuller picture of her humour, her passions, her efficiency, and her skill for managing her own writing.&#34; What&#39;s more, Crowther says, having these various voices available to us demonstrates &#34;how she seamlessly moved between these personas flitting across the personal to professional&#34;, and her extraordinary emotional range in so doing. Perhaps conversely, though, the sheer number of &#34;versions&#34; of Sylvia Plath only serves to prevent us from knowing which were genuine.\n The most expansive biography of Plath to date is Clark&#39;s Red Comet. Asked about her aims in writing this book, Clark tells BBC Culture that she wanted to show that Plath’s &#34;near-constant theme is not depression, but the holy quest to become a writer&#34;. Her interest in Plath began while she was doing her doctorate at Oxford University on Northern Irish poets. Previously, she &#34;had fallen prey to the reductive idea that Plath was an avatar of darkness and doom&#34; as a result of the predominant portrayal of Plath in the media. However, through reading her work for a class she was teaching, Clark realised that she was &#34;enormously sophisticated, witty, and yes, funny&#34;, giving her a desire to overturn the &#34;sexist bill of lies&#34; sold to her.\n The resulting book is the closest any writer has come to an exhaustive biography of Plath&#39;s life and work. Clark also discusses the relationship Plath had with Sexton, elucidating their differences and the greater importance of Plath to Sexton than vice versa. The impression given by the book is of a rich and complex life beyond anything shown in the far shorter works that have preceded it. Occasionally she does make hints towards Plath&#39;s fate which err on the side of foreshadowing, including with poetic flourishes about &#34;the bell jar descending&#34; which detract from the authenticity she otherwise strives for. It&#39;s interesting that even in these books that are so aware of the dangerous impact that speculation and mythologising have had on perceptions of Plath, they too can slip into that vein from time-to-time.\n Nonetheless, Clark is optimistic that the scholarship on Plath is evolving in enriching ways. Eschewing the traditional feminist focus on Plath as an author ahead of her time, which has dominated recent academic discourse, her PhD students are looking at Plath&#39;s work from transnational and disability perspectives. These angles are important, in turn, for considering the impact that Plath&#39;s travels, and the dissonance of identity she felt as an American in England, had on her writing; and for looking at how Plath&#39;s mental illness was reflected in her life and work, while also considering the shame that was attached to that in an era when mental health was less understood than it is today.\n  These new approaches continue to have more source materials available to them as the Plath archive expands. In addition to the publication of the letters, Kukil, who is curator of the Plath archive at Smith College in the US, is now working with Amanda Golden, Associate Professor of English at New York Institute of Technology, on an expanded and corrected edition of the Collected Poems, previously edited by Ted Hughes, to be published by Faber &amp; Faber. It is also possible that the incomplete manuscript for Plath&#39;s lost novel, Double Take, and two other journals may one day surface.\n Whatever is left to emerge, however, Plath is always likely to remain more of a puzzle than most cultural icons – in part because of her untimely death, which means she never got the chance to tell her story on her own terms. And in part, as has become increasingly apparent, because of the multiplicity of personae Plath was able to adopt in different settings and with different people, making it difficult to know when she was being sincere and when she was writing with a wry smile on her face. We may continue to think we are getting a clearer impression of who she was, but the &#34;real&#34; Sylvia Plath will remain elusive.\n If you would like to comment on this story or anything else you have seen on BBC Culture, head over to our    Facebook  page or message us on    Twitter .\n And if you liked this story,    sign up for the weekly bbc.com features newsletter , called The Essential List. A handpicked selection of stories from BBC Future, Culture, Worklife and Travel, delivered to your inbox every Friday.", "posttime": "2021-07-23 00:52:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sylvia,plath,普拉斯", "title": "西尔维娅·普拉斯 (Sylvia Plath) 会永远被她的死所定义吗？", "title_en": "Will Sylvia Plath always be defined by her death?", "transed": 1, "url": "https://www.bbc.com/culture/article/20210720-sylvia-plath-the-literary-icon-destined-to-remain-an-enigma", "via": "", "real_tags": ["sylvia", "plath", "普拉斯"]}, {"category": "", "categoryclass": "", "imagename": "c1a6dbd1ab6daf88bb6896b035bf1c3b.jpg", "infoid": 1069040, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下面，您会在 Steam 的各个类别中找到您可能感兴趣的各种游戏。这可能是错误，也可能是您没有任何游戏时间记录。您可以点击刷新，也可以在玩完游戏后返回。", "note_en": "Below, you&#39;ll find a variety of titles that you may be interested in from categories across Steam\n       This might be an error, or it might be that you don&#39;t have any playtime on record. You can hit refresh, or come back once you&#39;ve played a game.", "posttime": "2021-07-23 00:52:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蒸汽,steam,可能", "title": "蒸汽下降", "title_en": "Steam Is Down", "transed": 1, "url": "https://store.steampowered.com", "via": "", "real_tags": ["蒸汽", "steam", "可能"]}]