[{"category": "", "categoryclass": "", "imagename": "e6765683432ac7b47e147f0b9eb8285e.jpg", "infoid": 1008376, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN)一年一度的最受欢迎的婴儿名字排行榜显示了口味是如何随着时间的推移而变化的。虽然詹妮弗、希瑟、迈克尔和杰森在过去的几十年里可能是最受欢迎的，但今天最有希望的竞争者包括艾玛、奥利维亚、利亚姆和诺亚。\n例如，阿司匹林在20世纪初就是一个有腿的名字。拜耳在1899年将其止痛药命名为这个简单的名字，并将其销往世界各地多年。然而，到了本世纪末，毒品的命名带有一个重磅炸弹的边缘，并且引起了非常不同的共鸣。20世纪90年代末是西莱布雷克斯和伟哥的时代，也是现在臭名昭著的奥施康定的时代。\n最近，药物已经接触到了更具异国情调的声音。在过去几年里，美国食品和药物管理局(FDA)已经批准Farydak用于治疗多发性骨髓瘤，Avycaz用于治疗腹部感染，Vraylar用于精神分裂症，Idelvion用于血友病，Luzu用于运动员足部，Byvalson用于高血压。\n大声说出这些名字，一些人可能会听到奇怪而可爱的音乐，而另一些人可能会想象来自遥远星球的外星人。同样，给一种药物命名也是一个复杂的过程。\n这家制药公司根据国际纯粹与应用化学联合会(International Union Of Pure And Application Chemical)制定的一套规则，给一种新药起了一个化学名称。\n对于任何将在美国上市的药物，下一步是从美国采用名称委员会获得一个名称。它给药物的有效成分指定了一个通用名称，这个名称必须由世界卫生组织运行的国际非专利名称项目进行清理和审查。\n采纳名称委员会主任斯蒂芬妮·C·舒巴特解释说，这一步骤确保了该药物在世界各地有一个非专利(通用)名称，#34；斯蒂芬妮·C·舒巴特(Stephanie C.Shubat)解释说。\n在确定了通用名称后，一家制药公司向FDA提出了一个品牌名称，以将该产品标记为自己的产品。\n例如，一种抗抑郁剂在实验室中的化学名称是：N-甲基-3-苯基-3-[4-(三氟甲基)苯氧基]丙烷-1-胺。这种复杂化学物质的通用名称是氟西汀。对我们其他人来说，这种药物通常被称为百忧解。\n百忧解就是我所说的药品命名大爆炸。品牌研究所(Brand Institute)负责创意开发的副总裁斯科特·皮尔格罗西(Scott Piergrossi)说，它不知从哪里冒出来的，完全没有意义，它实际上只是在说，哇，好吧，这是药品界的重磅炸弹命名。该研究所每年为FDA批准的约75%的名称进行命名、测试、营销或其他工作，约占全球名称的三分之二。\n大卫·伍德(David Wood)是品牌领域的先驱，也是Wood Worldwide的创始人，在将自己的商店出售给InterbrandHealth之前，他在20世纪90年代初命名为百忧解(Prozac)。\n根据Interbrand执行创意总监R·约翰·菲德利诺(R.John Fidelino)的说法，它是第一个将一种疾病及其治疗方法同时带出阴影的药物名称。\n尽管命名过程的每一步都存在障碍，但品牌名称的审批是最难通过的。\nFDA药品差错预防和分析部门负责在批准之前对专有名称进行审查，该机构发言人琳赛·迈耶(Lyndsay Meyer)解释说，她指出，出于安全原因，该部门可以要求公司选择另一个名称，作为批准过程的一部分。(注：美国食品和药物管理局药品差错预防和分析部门负责审批之前的专有名称审查。)林赛·迈耶(Lyndsay Meyer)解释说，出于安全原因，该部门可以要求公司选择另一个名称作为审批过程的一部分。\nFDA内的两个部门--药物评估和研究中心和生物制品评估和研究中心--仔细审查了每个拟议的名称，然后分别否决了大约20%和35%的名称。\n如果审查名字似乎是一种不必要的监管形式，那么考虑一下美国医学研究所(Institute Of Medicine)估计，每年有超过150万美国人因开药、配药和服药错误而生病、受伤或死亡。与此同时，今年发表在“英国医学杂志”(British Medical Journal)上的一项研究发现，美国每年有25.1万人死于医疗差错或医疗保健失误，包括药物名称和剂量的混淆。\n研究作者说，医疗差错是美国第三大死因，仅次于心脏病和癌症，这使得这个行业的每个人都希望避免他们所说的Lasas：长相相似，声音相似。\n名称工程机构Ixxéo Healthcare的创意总监阿琳·泰克(Arlene Teck)表示，名称安全现在是首要任务，预测名称可信度现在是游戏的名称。FDA想要保护任何美国人，无论去哪里旅行，都不会因为混淆一种药物与任何其他药物，甚至是当地的食品补充剂而受到任何形式的伤害。\n药品名称混淆的可能性让监管机构夜不能寐。根据Teck的说法，因为他们可以否决任何提议的名称，FDA、欧洲药品管理局和加拿大卫生部对药物名称的影响最大。她说，事实上，我们生活在药品命名的规定年龄。\n对于那些相信电脑化处方将减少因字迹难以辨认而导致的错误的人来说，FDA委托编写的一份白皮书(PDF)发现，当处方人员意外地从下拉菜单中选择了类似的药物名称时，外观相似仍然会导致错误。\nFDA有一大堆理由来解释为什么它可能需要一个与公司选择的名称不同的名称。\n例如，某些单词的使用受到国际非专有名称计划的正式保护。Teck解释说，词干是一组字母，通常只有两个字母--例如，os或aj；，它们不能出现在品牌名称中，因为这可能会导致与通用名称的混淆。\nFDA还拒绝那些看起来太过奇特或夸大药物有效性的名称，并对可能使患者(或病情)蒙受耻辱的名称予以封杀。\n泰克指出，如果你想做一些肯定生命的比喻，想像树木、花朵或金属等坚固的东西，你就不能这样做，因为这可能会让人联想到一种成分。\n制药业的全球性带来了额外的挑战。一个名称可能会得到FDA的批准，然后被欧洲或加拿大当局拒绝。\n为了预测FDA和欧洲药品管理局(European Medicines Agency)的监管结果，这确实是任何团队或机构的首要任务，泰克的命名合伙人、总部位于日内瓦的Ixxéo首席执行官丹尼斯·埃辛格尔德(Denis Ezingeard)表示。\n即使产品商业化投放市场，FDA仍保留要求更名的权力。事实上，即使在您当地药店的货架上发现了一种药物，如果医生报告存在混淆和医疗错误，该机构可能会要求更改名称。\nEzingeard说，命名药物完全是为了避免监管陷阱，已经变得越来越少关于创造。毕竟，在不同国家之间协调这一过程时，可能需要很长时间才能从拒绝中恢复过来，这是昂贵和困难的。\n由于规章制度繁多，药品命名已成为高度专业化的工作，大多外包给高度专业化的创意机构。\n在开发了奇怪而精心的防御措施以避免被拒绝的灾难之后，命名者就像麋鹿，那些笨拙的鸟不会飞，而是会跑。\n对于任何任务，Ixxéo团队都会创建2000到5000个名字。这使得药品命名不同于消费者品牌，消费者品牌的限制不那么严格，你可以把名字的轮子转得低得多，艾辛格尔德说，他自称是Destructo博士(Destructo Dr.Destructo)。他说，药品命名不同于消费者品牌，消费者品牌的限制不那么严格，你可以把名字的轮子转得更低。艾辛格尔德自称是Destructo博士。\n他在团队中的工作是消除名字，因为他最关心的是尽可能多的名字让路，因为这些名字本质上是一种可能的负担。最后，从最初的2,000或3,000人中选出10人作为有前途的人，从那里开始最后选择一个名字。\n根据Piergrossi的说法，品牌研究所通常会同时向监管机构提交两个名字。\n但也有层层的应急名称，特别是大型制药公司提前数年进行规划，他说，并补充说，我们非常熟悉监管机构的要求。\n品牌研究所的子公司，药物安全研究所，避免被拒绝的另一种方式是使用与监管机构使用的方法相似的方法来评估名字候选人。\n例如，众所周知，FDA的检查员会查看药物名称的手写样本，并在不同的人(每个人都有不同的口音)发音时倾听。他们还检查非法词干、与停产产品名称的相似性，以及名称中隐藏的常见医疗缩写或杜撰缩写。同时，审查员分析可能的促销声明，以及在拟议名称的声音内提到活性或惰性成分。\nIxxéo开发了自己的监管工程模型，反映了监管当局使用的一套复杂和不断演变的参数。\nEzingeard说，这正是FDA本可以制造的模型，但他们没有这么做。\n就像写伊丽莎白十四行诗而不是自由诗的诗人一样，药物命名者必须根据神秘的规则做出艰难的决定，但他们的工作仍然是一种艺术形式。\n泰克说，工程师兼博学者埃津格尔德在研究达尔文进化论时，开发了伊索精心设计的命名过程。创造工程(Teck指的是药物命名过程)以进化科学和艺术史为基础，将创造与筛选过程相结合。\n实际上，这意味着在泰克、埃津格尔德和巴塞罗那的同事伊格纳西·方特维拉(Ignasi Fontvila)之间来回交换名字。他们一起制作的名字融合了英语、法语、德语、西班牙语和加泰罗尼亚语的语言学，基于四个不同的维度：视觉独特性、旋律对比度、语速-当它在一个句子中说话时听起来如何-以及语言中立，这是一种能够跨越许多不同语言的能力。\n然后，泰克和丰特维拉制定一份最终的候选人名单，并相互调整，以确保更高的获得批准的机会。\n1992年，泰克在Wood Worldwide工作时，因命名伟哥而在业内享有盛誉。为了命名辉瑞的重磅炸弹，她与治疗勃起功能障碍的泌尿科医生组成了一个焦点小组。在会议结束时，泰克询问其中一名医生，当病情消失时，男性是什么感觉。\n“伟哥”现在是牛津英语词典的一个词条，它是一个例子，展示了一个名字如何从根本上创造对话，而不仅仅是改变对话，Interbrand的菲德利诺说。\n他说，在伟哥之前，阳痿是一种心理障碍，直指男人如何定义自己的核心。通过创建一个可以让人们讨论的品牌，并创造语言或使用语言来描述病情，让人们更容易进行对话，你就会有更多的人寻求治疗，同时也改善了世界各地的性健康和性关系。\n后来，Interbrand的任务是为现在所知的Cialis创造一个绰号，这是一种仅次于市场的阳痿药物。但是，命名一种不是第一个上市的药物是很困难的，因为这个游戏的名称是史无前例的……。作为突破口，菲德利诺说。\n他解释说，我们的目标是找到一种符合Cialis&#39；改进的声音，而不是它的前身，听起来很有男子气概的伟哥。\n西利斯的治疗窗口比伟哥长--它全天都有效--所以如果有机会，男性可以自发地做出反应。菲德利诺说，这种独特的属性和对伟哥的改进需要新的信息和新的框架。他说，给药物命名是为了给看不见的、无形的东西命名。\n因此，Cialis的方法更多地是关于人际关系，而不是性。Cialis，狂想化的Fidelino传达了一种不同类型的情感，指出它是一个色调更柔和的名字，也更优雅。\n在Facebook和Twitter上查看最新新闻，并与CNN Health分享您的评论。\n在品牌研究所创造的众多名字中，Piergrossi说他最引以为豪的是Allergan的睫毛生长药物拉蒂斯(Latise)。这个名字是由两个词组合而成的：法国画家和雕塑家马蒂斯。Latise是直接面向消费者销售的，所以这个名字必须吸引那些将使用该产品的人。\n医生的名字通常是他们熟悉的词语或技术的游戏，或者暗示一种药物的作用机制。例如，Fidelino解释说，乙肝和丙型肝炎药物Pegasys是基于一种被称为PEGALATION的制药技术。\n菲德利诺说，毫无疑问，这种不同寻常的东西有其优点，但当它与产品的属性、产品的技术、产品的效益或预期的结果有真正的联系时，它仍然是有帮助的。(工业和信息化部电子科学技术情报研究所陈皓，编者注：在这一点上，菲德利诺说：“毫无疑问，不同寻常的东西有其优点，但当它与产品的属性、产品的技术、产品的效益或预期的结果有真正的联系时，它仍然是有帮助的。”\n根据菲德利诺的说法，在当前的消费环境下--通常是对制药公司怀有敌意--帮助人们欣赏他们所做的事情是这些公司义不容辞的责任。\n菲德利诺认为，这是可以实现的，方法是超越花招，创造真正有深度的品牌和营销活动：我也是一名医疗消费者，他说。我不想看到公众被花哨的、肤浅的促销所欺骗。", "note_en": "(CNN)Yearly lists of the &#34;most popular baby names&#34; show how tastes change over time. While Jennifer, Heather, Michael and Jason may have been favorites in decades past, today&#39;s top contenders include Emma, Olivia, Liam and Noah.\n    &#34;Aspirin,&#34; for instance, was a name with legs in the early 20th century. Bayer branded its pain medication with this simple moniker in 1899 and sold it around the world for years. By the end of the century, though, drugs were named with a &#34;blockbuster&#34; edge and struck very different chords. The late 1990s was the era of Celebrex and Viagra as well as the now-infamous OxyContin.\n More recently, drugs have reached for even more exotic sounds. Within the past few years, the US Food and Drug Administration has approved Farydak for treating multiple myeloma, Avycaz for abdominal infections, Vraylar for schizophrenia, Idelvion for hemophilia, Luzu for athlete&#39;s foot and Byvalson for high blood pressure.\n Saying these names aloud, some may hear a strange and lovely music, while others may imagine aliens arriving from distant planets.  Similarly, naming a drug is a complicated process.\n  The pharmaceutical company gives a new drug a chemical name based on a set of rules established by the International Union of Pure and Applied Chemistry.\n For any drug that will be marketed in the United States, the next step is obtaining a name from  United States Adopted Name Council. It assigns the active ingredient of the drug a generic name, which must be cleared and reviewed by the International Nonproprietary Name program run by the World Health Organization.\n &#34;This step assures that there is one non-proprietary (generic) name throughout the world for the drug,&#34; explained Stephanie C. Shubat, director of the Adopted Name Council.\n With the generic name settled, a pharmaceutical company proposes a brand name to the FDA, to mark the product as its own.\n For example, an antidepressant is known in the lab by its chemical name: N-methyl-3-phenyl-3-[4-(trifluoromethyl) phenoxy]propan-1-amine. The generic name assigned to this complex chemical is fluoxetine. To the rest of us, the drug is commonly known as  Prozac.\n &#34;Prozac is what I call the Big Bang of pharmaceutical naming. It came out of nowhere, it means absolutely nothing, and it really just said, &#39;Wow, OK, this is blockbuster naming in the drug world,&#39; &#34; said Scott Piergrossi, vice president of creative development at the  Brand Institute, which names, tests, markets or otherwise works on about 75% of FDA-approved names each year and about two-thirds of the global names.\n David Wood, a pioneer in the field of branding and founder of Wood Worldwide, named Prozac in the early 1990s, before he sold his shop to  InterbrandHealth.\n  According to R. John Fidelino, executive creative director at Interbrand, it was the first drug name that took both a condition and its treatment &#34;out of the shadows.&#34;\n  Though each step of the naming process presents hurdles, approval for a brand name is the most difficult to clear.\n &#34;The FDA&#39;s Division of Medication Error Prevention and Analysis is responsible for proprietary name review prior to approval,&#34; explained Lyndsay Meyer, a spokeswoman for the agency, noting that this division can &#34;require the company to select another name, for safety reasons, as part of the approval process.&#34;\n  Two departments within the FDA -- the Center for Drug Evaluation and Research and the Center for Biologics Evaluation and Research -- scrutinize each proposed name and then reject about 20% and 35% of the names, respectively.\n If reviewing names seems an unnecessary form of regulation, consider that the  Institute of Medicine estimates that more than 1.5 million Americans are sickened, injured or killed each year by errors in prescribing, dispensing and taking medications. Meanwhile, a study published this year in the   British Medical Journal  found that 251,000 people die each year in the United States from medical error or medical care gone wrong, including drug name and dosage mixups.\n Medical error is the third leading cause of death in the US, after heart disease and cancer, say the study authors, making the goal of everyone in this industry to avoid what they call LASAs: lookalikes, sound-alikes.\n &#34;Name safety is now the number one priority, and predicting name approvability is now the name of the game,&#34; said Arlene Teck, creative director at  Ixxéo Healthcare, a name engineering agency. &#34;The FDA wants to protect any American, traveling anywhere, from any kind of harm that could come from confusing one drug with any other drug or even a local food supplement.&#34;\n The possibility of drug name confusion keeps regulators up at night. Because they can nix any proposed name, the FDA, the European Medicines Agency and HealthCanada exert the strongest influence on drug names, according to Teck. In fact, she says, we are living in &#34;the regulated age of drug naming.&#34;\n And for those who believe that computerized prescriptions will reduce mistakes caused by illegible handwriting, a  white paper (PDF) commissioned by the FDA found that lookalikes still cause mistakes when prescribers accidentally choose a similar drug name from a drop-down menu.\n  The FDA has a whole host of reasons why it might require a different name than the one selected by a company.\n For instance, the use of certain word &#34;stems&#34; are officially protected by the International Nonproprietary Names program. Word stems are groups of letters, usually just two -- &#34;os,&#34; for instance, or &#34;aj&#34; -- that cannot appear within brand names, explains Teck, as it might cause confusion with a generic name.\n The FDA also rejects names that seem too fanciful or overstate a drug&#39;s effectiveness and puts the kibosh on names that might stigmatize a patient (or condition).\n  &#34;If you are wanting to do metaphors that are life-affirming, and you want to think of things like trees or flowers or something strong like metal, you cannot do that, because it might suggest an ingredient,&#34; Teck noted.\n The global nature of the pharmaceutical industry presents additional challenges. A name may be approved by the FDA and then rejected by European or Canadian authorities.\n &#34;To anticipate both the FDA and European Medicines Agency regulatory outcome, that&#39;s really the number one mission of any team or any agency,&#34; said Denis Ezingeard, Teck&#39;s naming partner and CEO of Geneva-based Ixxéo.\n  Even once a product is commercially launched, the FDA retains the authority to request a name change. In fact, the agency may request a name change if doctors report confusion and medical errors even after a drug can be found on the shelf at your local pharmacy.\n Naming drugs, says Ezingeard, is all about avoiding regulatory pitfalls and has become &#34;less and less&#34; about creation. After all, recovery from rejection, which could take a long time when coordinating the process across different countries, is costly and difficult.\n Because of the many rules and regulations, pharmaceutical naming has become highly specialized work that is mostly farmed out to highly specialized creative agencies.\n  Having developed strange and elaborate defenses to avert the disaster of rejection, namers resemble emus, those awkward birds that run instead of fly.\n  For any assignment, the Ixxéo team creates between 2,000 and 5,000 names. &#34;That makes pharmaceutical naming different from consumer branding, where the constraints are not as stringent and where you can turn a much lower wheel of names,&#34; said Ezingeard, who refers to himself as &#34;Dr. Destructo.&#34;\n His job on the team is name elimination, because his primary concern is to &#34;get out of the way&#34; as many names as possible &#34;that are by their nature&#34; a possible liability. In the end, 10 are selected as &#34;promising&#34; from the original 2,000 or 3,000, and from there, the final selection of one name begins.\n The Brand Institute then typically submits two names at once to regulatory agencies, according to Piergrossi.\n &#34;But there are layers of contingency names in place, especially with Big Pharma planning years in advance,&#34; he said, adding, &#34;we are well-versed in what&#39;s required by the regulators.&#34;\n Another way the Brand Institute&#39;s subsidiary, the Drug Safety Institute, avoids rejection is by assessing name candidates using a methodology similar to those used by regulatory authorities.\n  For example, FDA examiners are known to look at handwritten samples of a drug name and listen as a variety of people (each with different accents) pronounce the name. They also check for illegal stems, similarity to the names of discontinued products, and common medical or coined abbreviations tucked within the name. Meanwhile, examiners analyze for possible promotional claims and references to active or inert ingredients within the sound of the proposed name.\n Ixxéo has developed its own &#34;regulatory engineering model&#34; that mirrors the &#34;complex and evolving set of parameters&#34; used by regulatory authorities.\n &#34;It&#39;s the very model the FDA could have built, but they didn&#39;t do it,&#34; Ezingeard said.\n  Like poets who write Elizabethan sonnets rather than free verse, pharmaceutical namers must make difficult decisions based on arcane rules, but their work is still a form of artistry.\n Teck says Ezingeard, an engineer and polymath, developed Ixxéo&#39;s elaborate naming process when he was studying Darwinian evolution. &#34;Creation engineering,&#34; as Teck refers to the drug-naming process, is based on evolutionary science as well as art history and merges creation with the screening process.\n In practice, this means swapping names back and forth between Teck, Ezingeard and Ignasi Fontvila, a colleague in Barcelona. Together, they craft names blended from English, French, German, Spanish and Catalan linguistics and based on four distinct dimensions: visual distinctiveness, melodic contrast, verbal velocity -- how it sounds when spoken within a sentence -- and language neutrality, which is the ability to work across many different languages.\n Teck and Fontvila then develop a final list of name candidates and tweak each other&#39;s to ensure a higher chance of approval.\n Teck is legendary in the industry for naming Viagra while at Wood Worldwide in 1992. To name Pfizer&#39;s blockbuster, she ran a focus group with urologists who treated erectile dysfunction. At the conclusion of the session, Teck asked one of the doctors what it felt like for men when the condition went away.\n    Now an entry in the Oxford English Dictionary, Viagra is an example of how a name can &#34;fundamentally create, not just change, conversation,&#34; Interbrand&#39;s Fidelino said.\n &#34;Prior to Viagra, impotence was a psychological disorder that went to the core of how men defined themselves,&#34; he said. &#34;By creating a brand that is named in a way that allows people to discuss it, and creating language or using language to describe the condition in a way that makes it easier for people to engage in conversation, you had more people seeking treatment and also improving sexual health and relationships around the world.&#34;\n Later, Interbrand was tasked with creating a moniker for what&#39;s now known as Cialis, a second-to-market impotence drug. But naming a drug that is not first to market is difficult because &#34;the name of the game is being unprecedented ... being the breakthrough,&#34; Fidelino said.\n He explains that the goal was to find a sound that fit with Cialis&#39; improvements over its predecessor, the macho-sounding Viagra.\n Cialis&#39; treatment window is longer than that of Viagra -- it works throughout the day -- so if an opportunity arises, a man can spontaneously respond. This unique attribute and improvement over Viagra required &#34;new messages and a new framing,&#34; said Fidelino, who says naming drugs is about naming &#34;the invisible, the intangible.&#34;\n The resulting approach for Cialis was more about relationships and less about sex. &#34;A different type of emotion is conveyed by Cialis,&#34; rhapsodized Fidelino, noting that it&#39;s a &#34;tonally softer&#34; name and more elegant.\n See the latest news and share your comments with CNN Health on  Facebook and  Twitter.\n Of the many names created by the Brand Institute, Piergrossi says he is proudest of Latisse, the eyelash growth drug from Allergan. This name was crafted by merging two words: &#34;lash&#34; and &#34;Matisse,&#34; the French painter and sculptor. Latisse is marketed directly to consumers, so the name must appeal to those who will use the product.\n Names intended for doctors are often a play on words or technologies familiar to them or suggestive of a drug&#39;s mechanism of action. For instance, the hepatitis B and C drug Pegasys, explains Fidelino, is based on a pharmaceutical technology known as pegalation.\n &#34;There&#39;s no doubt that there&#39;s virtue in the unusual,&#34; said Fidelino, but still, it&#39;s helpful &#34;when there&#39;s a real tie-back either to the attributes of the product, the technology of the product, the benefit of the product or the intended outcomes.&#34;\n    In the current consumer climate -- often hostile toward Pharma, according to Fidelino -- it&#39;s incumbent upon these companies to help people appreciate what they do.\n This can be achieved, Fidelino believes, by going beyond the tricks and instead creating brands and marketing campaigns with real depth: &#34;I&#39;m also a health care consumer,&#34; he said. &#34;I don&#39;t want to see the public being duped by fancy, superficial promotions.&#34;", "posttime": "2020-06-26 17:52:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,命名,science,名称", "title": "处方药命名的艺术与科学(2016)", "title_en": "The art and science of naming prescription drugs (2016)", "transed": 1, "url": "https://edition.cnn.com/2016/11/25/health/art-of-drug-naming/index.html", "via": "", "real_tags": ["艺术", "命名", "science", "名称"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008375, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我第一次接触到早期的互联网--还有什么--是通过我上的大学。我记得互联网在20世纪80年代中后期是多么的不同。我们有电子邮件，但几乎没有人使用它。我们使用telnet登录到远程计算机，并使用FTP传输文件。所有这些都是在命令行中完成的。如果我没记错的话，当时几乎没有图形用户界面。这些字符是由ASCII字符组成的。第一个网络浏览器直到1991年才发布。回忆让我有些悲伤，尽管从某些方面来说，现在的互联网更好了。它当然有更多的用户，这是一件好事。我只希望它有更多精通互联网的用户。\n我记得，互联网上的许多早期计算机网络和网站都是由富有想象力和幽默感的人经营的。例如，我在20世纪80年代末工作的第二家工程公司使用的计算机网络有七个SUN工作站，以七个小矮人的名字命名。正如你可能想象的那样，这给我们提供了无穷无尽的娱乐。呆子又倒下了！暴躁的家伙又胡闹了。喷嚏昨天死了。葬礼是什么时候？&#34；\n那时候，电脑是很特别的东西。它们太棒了。拥有它们的个人在某种意义上是特立独行的。当时买一台个人电脑等同于在额头上用大大的红色字母涂上“书呆子”这个词，在那个时候被称为“书呆子”并不是你想要的。我的一个高中朋友造了一台希斯基特电脑。它唯一的显示屏是正面的一英寸红色LED数字。\n现在，计算机已经渗透到我们的社会中，没有人会费心给它们起有趣的名字。它们几乎已经变成了可替换的商品，我们会用完它们，当它们用完后再扔掉。几乎每个人都至少偶尔使用互联网。而且，奇怪的是，被称为书呆子被视为一件好事。\n明尼苏达大学于1991年发布了戈弗协议。Gopher服务器为用户提供对各种类型文件的访问，包括文本、二进制、图像、声音和GIF。但地鼠空间的环境是文本。文本主要是Gopher用户看到的内容。用户还可以访问FTP、Telnet和Usenet服务器。早在20世纪90年代，Veronica搜索引擎就将Gopher服务器的网络捆绑在一起，就像今天的现代搜索引擎与现代互联网的网络服务器一样。在1990年代，Jughead搜索引擎被设计用来搜索单独的Gopher服务器。而且，阿奇是个FTP搜索引擎。Archie、Veronica和Jughead搜索引擎是以1941年首次出版的Archie漫画中的人物命名的。早在20世纪80年代和90年代初，当热爱电脑的人还在运行大部分互联网时，它反映了他们的个性。现在，互联网更多的是对企业界的米色和灰色的反映。\n今天，作为万维网基础的HTTP协议几乎完全取代了Gopher协议。虽然互联网已经发生了很大的变化，但Gopher服务器仍然存在。文本仍然主要是用户在gopherspace中看到的内容，并且仍然可以使用支持gopher的互联网浏览器进行导航。遗憾的是，今天似乎只有一家Veronica搜索引擎在运行。现在，当用户使用Veronica搜索引擎通过Gopherspace导航时，通过跟随链接，或者通过在浏览器中输入URL，他在许多方面都有类似于现代互联网冲浪的体验。\n虽然大约有24个互联网浏览器仍然可以访问gopherspace，无论是本机的还是插件的，但我只会谈论其中的一个。我将重点介绍Lynx浏览器，因为它容易获得、易于使用且功能强大。Lynx浏览器还可以在所有主要操作系统上运行。我将向读者展示如何使用Lynx浏览器进入gopherspace并四处看看。\nLynx浏览器是纯文本的Internet浏览器，具有对gopherspace的本机支持。Lynx允许用户只使用计算机键盘上的按键，就可以无缝地在互联网和Gopherspace中导航。Lynx不使用鼠标或触摸板。Windows计算机用户可以从Lynx网站下载Lynx浏览器。\n大多数Linux用户只需打开Linux终端窗口并键入：，然后在命令行中键入&#34；lynx&#34；(不带引号)即可安装Lynx，以启动Lynx浏览器。\n要使用Lynx浏览器转到Gopher地址，请按键盘上的&#34；g&34；键。在Lynx窗口底部附近，将出现要打开的URL提示：&#34；。现在，开始键入地鼠地址。也可以从其他应用程序复制和粘贴Gopher URL。首先，从另一个应用程序复制URL，然后选择Lynx窗口，点击鼠标右键，选择&#34；Paste&#34；。试着去这个地鼠地址练习：gopher://infinitelyremote.com/0/books/Internet_Gopher_Users_Guide.txt.。在您按Enter键之后，应该会在Lynx窗口中看到标题为“Internet Gopher用户指南”的文本文件。\nLynx有三种用户模式。此时，您处于新手用户模式，因此在页面底部应该可以看到以下说明：&#34；--按空格键进入下一页--箭头键：向上和向下移动。向右跟踪链接；向左返回。h)elp O)选项P)Rint G)o M)在屏幕Q)uit/=搜索[删除]=历史列表&#34；。\n在基本级别上，Lynx非常易于使用，因此用户在gopherspace中导航和阅读文本文件不需要太多知识。我将复习一下基本命令，稍后让您学习更多。要在不包含超链接的文本文件中导航，请按空格键或键盘上的向下箭头向下移动一页，按向上箭头向后移动一页。左箭头类似于现代Internet浏览器中的后退按钮；它将您带到您访问过的上一个文本文件。在具有超链接的文本文件中，按向上或向下箭头可将光标移动到光标当前位置上方或下方的超链接。当光标位于超链接上时，按&#34；Enter键或向右箭头可将您带到超链接指向的文档。\n某些Gopher页面包含类似于HTML表单的表单。例如，到搜索引擎的链接可能显示为搜索行。使用向左或向右箭头将光标移动到搜索行。然后，键入要搜索的关键字并按&#34；Enter键。这将把您带到一个搜索结果页面。\n要显示您当前正在阅读的文件的Gopher URL，请按&#34；=&#34；键。然后，按向左箭头键返回到您刚才正在读取的文件。\n按Q键退出Lynx。顺便说一下，大多数控制终端窗口的命令行Linux程序都可以通过按&#34；q&#34；键或键入&#34；：q&#34；来退出。\n这是使用Lynx浏览器在gopherspace(或Internet的其余部分)导航所需了解的全部信息。有关使用Lynx的其他说明，请调出Lynx并按键。\n现在有趣的事情开始了。也许进入gopherspace的最佳位置是gopher：//gopher.fuldgap.com/1/world。在那里您可以找到几十个Gopher服务器的链接。FLOODGAP声称它托管着现存的最后一个Veronica搜索引擎。因此，您可以使用Veronica搜索引擎通过关键字从FLOODGAP搜索gopherspace，也可以通过跟踪托管它们的Gopher服务器的链接进入各个Gopher用户站点。\nGopher用户站点的最大集合之一可以通过以下链接找到：最近验证的Gopher服务器&#34；&#39；上标有最高点击率的FlodGap上的链接。从那里，沿着标有&#34；sdf.org：70&#34；的链接到达超维堡垒(URL：gopher：//sdf.org/1)。在那里你会发现许多有趣的博客和文件。地鼠博客被称为phlog。一个有趣的phlogger是Tomasino(gopher：//sdf.org/1/users/tomasino/)。另一个是solderponk(gopher：//sdf.org/1/users/solderponk/)。还有其他的。所以，祝你玩得开心，去探索吧！\n我已经为您提供了开始在Gopherspace中导航所需的所有信息，但我还没有解释如何创建您自己的Gopher站点并编写内容供其他人阅读。如果你对地鼠非常感兴趣，你应该可以很容易地学会这一点。\n关于gopherspace，你会注意到其中一件事，那就是你可以在里面移动的速度。Gopher比互联网的其他部分速度更快，因为打开Gopher页面不需要下载兆字节的Javascipt。并且，不会发生SSH握手。在gopherspace中缺少SSH不是问题，因为没有人在gopherspace中像在互联网的其他地方那样监视您。为了好玩，我试着用我那台17岁的配备32位奔腾M CPU的Dell Latitude D400在Gopherspace中导航。它是如此之快，这绝对是一种乐趣！\n如果你觉得这篇文章值得，请把它分享到你最喜欢的社交媒体上。你会在页面顶部找到链接。", "note_en": "I first had access to the early Internet--what there was of it--through the university I attended. I remember how different the Internet was back in the mid-to-late 1980&#39;s. We had electronic mail, but almost no one used it. We logged onto remote computers with telnet and transferred files with FTP. All this was done at the command line. If I remember correctly, very few graphical user interfaces existed then. Those that did were composed of ASCII characters. The first web browser was not released until 1991. Remembering causes me some sadness, though in some ways the Internet is better now. It certainly has many more users, and that is a good thing. I just wish it had more Internet-savvy users.\n  I remember that many of the early computer networks and websites on the Internet were run by imaginative people with great senses of humor. For example, the computer network that I used at the second engineering company for which I worked in the late 1980&#39;s had seven sun workstations named after the seven dwarves. As you may imagine, that provided us with no end of entertainment. &#34;Dopey is down, AGAIN!&#34; &#34;Grumpy is acting up.&#34; &#34;Sneezy died yesterday. When is the funeral?&#34;\n  Back then, computers were something special. They were wondrous. Individuals who owned them were mavericks in a sense. Buying a personal computer then was the same as painting the word &#34;nerd&#34; in big red letters across your forehead, and being known as a nerd back then was not something you wanted. One of my highschool friends built a Heathkit computer. The only display it had was in the form of one-inch, red LED digits on the front.\n  Now, that computers permeate our society, no one bothers giving them interesting names. They&#39;ve nearly become fungible commodities that we use up and then throw away when they have outlived their usefulness. Nearly everyone uses the Internet at least occassionally. And, strangely enough, being called a nerd is seen as a good thing.\n         The Gopher protocol was released by the University of Minnesota in 1991. Gopher servers provided users with access to various types of files, including text, binary, image, sound, and GIF. But the milieu of gopherspace was text. Text was mostly what Gopher users saw. Users could also access FTP, telnet, and Usenet servers. Back in the 1990&#39;s, Veronica search engines tied together the network of Gopher servers in a similar way as modern search engines do today with the webservers of the modern Internet. In the 1990&#39;s, Jughead search engines were designed to search individual Gopher servers. And, Archie was an FTP search engine. Archie, Veronica, and Jughead search engines were named after characters in the Archie comics that first appeared in print in 1941. Back in the 1980&#39;s and early 1990&#39;s, when people who loved computers still ran much of the Internet, it reflected their personalities. Now, the Internet is more a beige and gray reflection of the corporate world.\n  Today the Gopher protocol has been supplanted almost completely by the HTTP protocol upon which the World Wide Web is based. Though the Internet has changed considerably, Gopher servers are still around. Text is still mostly what users see in gopherspace, and it can still be navigated with gopher-capable Internet browsers. Sadly, only one Veronica search engine appears to operate today. Now, When a user navigates through gopherspace with the Veronica search engine, by following links, or by entering URL&#39;s into his browser, he has an experience in many ways similar to surfing the modern Internet.\n  Though about   two dozen Internet browsers can still access gopherspace, either natively or with plugins, I will only talk about one. I&#39;ll focus on the Lynx browser, because it is readily available, easy to use, and powerful. The Lynx browser also runs on all the major operating systems. I&#39;ll show readers how to use the Lynx browser to get into gopherspace and have a look around.\n         The Lynx browser is a text-only Internet browser that has native support for gopherspace. Lynx allows a user to seamlessly navigate around the Internet and gopherspace using only the keys on his computer&#39;s keyboard. Lynx does not use a mouse or touchpad. Windows computer users can download the Lynx browser from the  Lynx website.\n  Most Linux users can install Lynx simply by opening a Linux terminal window and typing:           Then, type &#34;lynx&#34; (without the quotes) at the command line to start the Lynx browser.\n  To go to a Gopher address using the Lynx browser, hit the &#34;g&#34; key on your keyboard. Near the bottom of the Lynx window, the prompt &#34;URL to open:&#34; will appear. Now, begin typing the Gopher address. Gopher URL&#39;s can also be copied and pasted from other applications. First, copy the URL from the other application, then select the Lynx window, hit the right mouse button, and select &#34;paste&#34;. Try going to this Gopher address for practice: gopher://infinitelyremote.com/0/books/Internet_Gopher_Users_Guide.txt. After you hit the &#34;Enter&#34; key, the text file entitled &#34;Internet Gopher Users Guide&#34; should be visible in your Lynx window.\n  Lynx has three user modes. At this point, you are in the novice user mode, so at the bottom of the page, the following instructions should be visible: &#34;-- press space for next page -- Arrow keys: Up and Down to move. Right to follow a link; Left to go back. H)elp O)ptions P)rint G)o M)ain screen Q)uit /=search [delete]=history list&#34;.\n  At a basic level, Lynx is very easy to use, so a user does not have to know much to navigate around gopherspace and read text files. I will go over the basic commands, and leave it to you to learn more later. To navigate around inside a text file that contains no hyperlinks, press the space bar or the down arrow on your keyboard to move down one page and the up arrow to move back up one page. The left arrow is like the back button in a modern Internet browser; it takes you to the previous text file that you visited. In a text file with hyperlinks, pressing the up or down arrow moves the cursor to the hyperlink above or below the cursor&#39;s present position. When the cursor is on a hyperlink, pressing the &#34;Enter&#34; key or the right arrow takes you to the document pointed to by the hyperlink.\n  Some Gopher pages contain forms similar to HTML forms. For example, links to search engines may appear as a search line. Use the left or right arrow to move the cursor to the search line. Then, type the key words you want to search for and hit the &#34;Enter&#34; key. This will take you to a search results page.\n  To display the Gopher URL of the file you are currently reading, hit the &#34;=&#34; key. Then, hit the left arrow key to get back to the file you were just reading.\n  Exit from Lynx by hitting the &#34;q&#34; key. By the way, most command-line Linux programs that take control of a terminal window can be exited by hitting either the &#34;q&#34; key or by typing &#34;:q&#34;.\n  This is all the information you need to know to navigate around in gopherspace (or on the rest of the Internet) using the Lynx browser. For additional instructions on the use of Lynx, bring up Lynx and hit the &#34;h&#34; key.\n         Now the fun begins. Perhaps the best place to enter gopherspace is gopher://gopher.floodgap.com/1/world. There you will find links to dozens of Gopher servers. Floodgap claims that it hosts the last Veronica search engine in existence. So, from Floodgap you can use the Veronica search engine to search gopherspace by key words, or you can go to individual Gopher user sites by following links to the Gopher servers that host them.\n  One of the largest collections of Gopher user sites can be found by following the Link on Floodgap labeled &#34;&#39;Greatest hits&#39;: most recently verified Gopher servers&#34;. From there, follow the link labeled &#34;sdf.org:70&#34; to the Super-Dimensional Fortress (URL: gopher://sdf.org/1). There you will find many interesting phlogs and files. Gopher blogs are called phlogs. One interesting phlogger is Tomasino (gopher://sdf.org/1/users/tomasino/). Another is solderpunk (gopher://sdf.org/1/users/solderpunk/). There are also may others. So, have fun and explore!\n               I&#39;ve given you all the information you need to start navigating through gopherspace, but I haven&#39;t explained how to create your own Gopher site and write content for other people to read. You should be able to pick that up easily enough if you become really excited about Gopher.\n  One of the things you will notice about gopherspace is the speed with which you can move around in it. Gopher is faster than the rest of the Internet, because opening Gopher pages doesn&#39;t entail downloading megabytes of Javascipt. And, no SSH handshaking occurs. The lack of SSH in gopherspace is not a problem, because no one is spying on you in gopherspace the way they are on the rest of the Internet. Just for the fun of it, I tried navigating around gopherspace using my seventeen-year-old Dell Latitude D400 with a 32-bit, Pentium M CPU. It was so fast that it was an absolute pleasure!\n    If you&#39;ve found this article worthwhile, please share it on your favorite social media. You&#39;ll find links at the top of the page.", "posttime": "2020-06-26 16:49:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,gopherspace,gopher", "title": "2020年的Gopherspace", "title_en": "Gopherspace in the Year 2020", "transed": 1, "url": "https://cheapskatesguide.org/articles/gopherspace.html", "via": "", "real_tags": ["2020", "gopher"]}, {"category": "", "categoryclass": "", "imagename": "01b18dc0f66b2879b49698fca2e98997.png", "infoid": 1008374, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在前一篇文章中，我们讨论了如何使用数值积分器对运动方程进行积分。集成听起来很复杂，但它只是一种将物理模拟向前推进一小段时间的方法，称为“增量时间”(或简称DT)。\n但是如何选择这个增量时间值呢？这看起来可能是一个微不足道的话题，但实际上有很多不同的方法，每种方法都有自己的长处和短处-所以请继续读下去！\n前进的最简单方法是使用固定的增量时间，如1/60秒：\nDOUBLE t=0.0；DOUBLE DT=1.0/60.0；WHILE(！QUIT){INTEGRATE(STATE，t，DT)；RENDER(STATE)；t+=DT；}。\n在许多方面，该代码都是理想的。如果您足够幸运地让增量时间与显示刷新率匹配，并且可以确保更新循环占用的实时时间少于一帧，那么您已经有了更新物理模拟的完美解决方案，您可以停止阅读本文。\n但在现实世界中，您可能无法提前知道显示刷新率。Vsync可能被关闭，或者您可能运行在一台速度较慢的计算机上，该计算机无法以60fps的速度更新和渲染帧。\n解决这个问题似乎很简单。只需测量前一帧花费的时间，然后将该值作为下一帧的增量时间反馈回来。当然，这是有意义的，因为如果计算机以60 Hz的速度更新太慢，并且必须降至30fps，您将自动传入1⁄30作为增量时间。对于75 Hz而不是60 Hz的显示刷新率，甚至在速度较快的计算机上关闭Vsync的情况下，情况也是如此：\nDouble t=0.0；Double currentTime=hires_time_in_sec()；While(！Quit){Double newTime=hires_time_in_sec()；Double Frame Time=newTime-currentTime；currentTime=newTime；Integrate(state，t，frame Time)；t+=frame Time；Render(State)；}\n但是这种方法有一个巨大的问题，我现在要解释一下。问题是物理模拟的行为取决于您传入的增量时间。效果可能是微妙的，因为你的游戏根据帧速率有稍微不同的“感觉”，或者它可能是极端的，就像你的弹簧模拟爆炸到无限大，快速移动的物体穿过墙壁，玩家跌倒在地板上！\n不过，有一件事是可以肯定的，那就是期望您的模拟正确处理传入的任何增量时间是完全不切实际的。要了解原因，请考虑如果将十分之一秒作为增量时间传递会发生什么情况？一秒怎么样？10秒？100秒？最终你会找到一个突破点。\n更现实的说法是，只有当增量时间小于或等于某个最大值时，您的模拟才表现良好。在实践中，这通常比尝试在大范围的增量时间值下使模拟防弹容易得多。\n有了这些知识，这里有一个简单的技巧，可以确保您在不同的计算机上仍以正确的速度运行时，永远不会经过大于最大值的增量时间：\nDouble t=0.0；Double dt=1/60.0；Double currentTime=hires_time_in_sec()；While(！Quit){Double newTime=hires_time_in_sec()；Double Frame Time=newTime-currentTime；currentTime=newTime；While(frame Time&gt；0.0){Float deltaTime=min(frame Time，dt)；Integrate(state，t，deltaTime)；frame Time-。\n这种方法的好处是我们现在有了增量时间的上限。它永远不会大于这个值，因为如果大于，我们就细分时间步长。缺点是我们现在对每个显示的更新采取多个步骤，包括一个额外的步骤来消耗任何不能被DT整除的帧时间的剩余部分。如果你被渲染限制，这是没有问题的，但是如果你的模拟是你的帧中最昂贵的部分，你可能会陷入所谓的“螺旋式死亡”。\n死亡的螺旋是什么？这是当你的物理模拟跟不上要求它采取的步骤时会发生的事情。例如，如果你的模拟被告知：“好的，请模拟X秒的物理”，如果Y&gt；X需要Y秒的实时时间才能做到这一点，那么不需要爱因斯坦就会意识到，随着时间的推移，你的模拟落后了。之所以称为死亡螺旋，是因为落后会导致您的更新模拟更多的步骤以迎头赶上，这会导致您进一步落后，这会导致您模拟更多的步骤…。\n那么我们如何避免这种情况呢？为了确保稳定的更新，我建议留出一些余地。您确实需要确保更新相当于X秒的物理模拟所需的实时时间明显少于X秒。如果你能做到这一点，那么你的物理引擎就可以通过模拟更多的帧来“赶上”任何暂时的峰值。或者，您可以钳制每帧的最大步数，模拟将在重载下显示为减慢。可以说，这比螺旋式死亡要好，特别是如果沉重的负荷只是一个暂时的峰值。\n现在让我们再往前走一步。如果您希望在给定相同输入的情况下从一次运行到下一次运行具有精确的重现性，该怎么办？这在尝试使用确定性锁步将物理模拟联网时非常有用，但通常也是一件很好的事情，因为您的模拟在每次运行到下一次运行时的行为完全相同，没有任何潜在的不同行为，具体取决于渲染帧率。\n但您会问，为什么需要完全固定的Delta时间才能做到这一点？剩余步长较小的半固定增量时间肯定“足够好”吗？是的，你是对的。它在大多数情况下是足够好的，但由于浮点运算的精度有限，它并不完全相同。\n那么我们想要的是两全其美：模拟的固定增量时间值加上以不同帧速率渲染的能力。这两件事看起来完全不一致，它们确实是不一致的-除非我们能找到一种方法来分离模拟和渲染帧速率。\n下面是如何做到这一点的。以固定的DT时间步长提前物理模拟，同时确保它与来自渲染器的计时器值保持一致，以便模拟以正确的速率前进。例如，如果显示帧率为50fps，模拟运行速度为100fps，则每次显示更新都需要执行两个物理步骤。很简单。\n如果显示帧速率是200fps，该怎么办？在这种情况下，我们需要在每次显示器更新时采取半个物理步骤，但我们不能这样做，我们必须以恒定的DT前进，所以我们每两次显示器更新就采取一个物理步骤。\n更棘手的是，如果显示帧速率是60fps，但我们希望我们的模拟以100fps运行，该怎么办？没有容易的倍数。如果禁用了Vsync，并且显示帧速率随帧而波动，该怎么办？\n如果你的头刚刚爆炸了，别担心，解决这个问题所需要的就是改变你的观点。不要认为在渲染之前必须模拟一定数量的帧时间，而是将视点颠倒过来，这样想：渲染器生成时间，模拟以离散DT大小的步长消耗时间。\n双t=0.0；常量双Dt=0.01；双currentTime=hires_time_in_sec()；双累加器=0.0；While(！Quit){Double newTime=hires_time_in_sec()；双帧时间=newTime-currentTime；currentTime=newTime；累加器+=frame Time；While(累加器&&gt;；=dt){Integrate(state，t，dt)；累加器-=dt；\n请注意，与半固定的时间步长不同，我们只与步长大小为dT的步长进行积分，因此在通常情况下，我们在每帧的末尾都会留下一些未模拟的时间。剩余的时间通过累加器变量传递到下一帧，并且不会被丢弃。\n但是剩下的这段时间怎么办呢？好像不太对劲，不是吗？\n要了解正在发生的情况，请考虑这样一种情况：显示帧速率为60fps，物理运行速率为50fps。没有合适的倍数，所以累加器使模拟在每帧主要采用一个物理步长和偶尔采用两个物理步长之间交替，当剩余物“累积”在DT以上时。\n现在考虑大多数渲染帧将在累加器中留下一些不能模拟的帧时间，因为它小于DT。这意味着我们在与渲染时间略有不同的时间显示物理模拟的状态，导致屏幕上的物理模拟出现细微的但视觉上令人不快的卡顿。\n此问题的一种解决方案是基于累加器中剩余的时间在先前和当前物理状态之间进行插值：\n双t=0.0；双Dt=0.01；双currentTime=hires_time_in_sec()；双累加器=0.0；状态上一；当前状态；While(！Quit){Double newTime=Time()；Double Frame Time=newTime-currentTime；if(frame Time&gt；0.25)frame Time=0.25；currentTime=newTime；累加器+=Frame Time；While(累加器&&gt;；=dt){previousState。state state=currentstate*alpha+previousState*(1.0-alpha)；Render(State)；}。\n这看起来很复杂，但这里有一个简单的思考方法。累加器中的任何剩余部分实际上都是在采取另一个完整的物理步骤之前还需要多少时间的度量。例如，dt/2的余数意味着我们目前处于当前物理步骤和下一个物理步骤之间。DT*0.1的余数表示更新是当前状态和下一状态之间的十分之一。\n只需除以dt，我们就可以使用这个余数值来获得前一个物理状态和当前物理状态之间的混合因子。这给出了范围[0，1]中的alpha值，它用于在两个物理状态之间执行线性插值，以获得要渲染的当前状态。对于单个值和矢量状态值，此插值很容易完成。如果将方向存储为四元数并使用球面线性插值(SLERP)在先前和当前方向之间混合，则甚至可以将其与完整的3D刚体动力学一起使用。\n格伦·菲德勒是Network Next的创始人兼首席执行官。Network Next正在通过创建一个高端网络传输市场来修复游戏的互联网。", "note_en": "In the  previous article we discussed how to integrate the equations of motion using a numerical integrator. Integration sounds complicated, but it’s just a way to advance the your physics simulation forward by some small amount of time called “delta time” (or dt for short).\n But how to choose this delta time value? This may seem like a trivial subject but in fact there are many different ways to do it, each with their own strengths and weaknesses - so read on!\n  The simplest way to step forward is with fixed delta time, like 1/60th of a second:\n double t = 0.0; double dt = 1.0 / 60.0; while ( !quit ) { integrate( state, t, dt ); render( state ); t += dt; }\n In many ways this code is ideal. If you’re lucky enough to have your delta time match the display refresh rate, and you can ensure that your update loop takes less than one frame worth of real time, then you already have the perfect solution for updating your physics simulation and you can stop reading this article.\n But in the real world you may not know the display refresh rate ahead of time. VSYNC could be turned off, or you could be running on a slow computer which cannot update and render your frame fast enough to present it at 60fps.\n   Fixing this  seems simple. Just measure how long the previous frame takes, then feed that value back in as the delta time for the next frame. This makes sense because of course, because if the computer is too slow to update at 60HZ and has to drop down to 30fps, you’ll automatically pass in  1⁄ 30 as delta time. Same thing for a display refresh rate of 75HZ instead of 60HZ or even the case where VSYNC is turned off on a fast computer:\n double t = 0.0; double currentTime = hires_time_in_seconds(); while ( !quit ) { double newTime = hires_time_in_seconds(); double frameTime = newTime - currentTime; currentTime = newTime; integrate( state, t, frameTime ); t += frameTime; render( state ); }\n But there is a huge problem with this approach which I will now explain. The problem is that the behavior of your physics simulation depends on the delta time you pass in. The effect could be subtle as your game having a slightly different “feel” depending on framerate or it could be as extreme as your spring simulation exploding to infinity, fast moving objects tunneling through walls and players falling through the floor!\n One thing is for certain though and that is that it’s utterly unrealistic to expect your simulation to correctly handle  any delta time passed into it. To understand why, consider what would happen if you passed in 1/10th of a second as delta time? How about one second? 10 seconds? 100? Eventually you’ll find a breaking point.\n  It’s much more realistic to say that your simulation is well behaved only if delta time is less than or equal to some maximum value. This is usually significantly easier in practice than attempting to make your simulation bulletproof at a wide range of delta time values.\n With this knowledge at hand, here’s a simple trick to ensure that you never pass in a delta time greater than the maximum value, while still running at the correct speed on different machines:\n double t = 0.0; double dt = 1 / 60.0; double currentTime = hires_time_in_seconds(); while ( !quit ) { double newTime = hires_time_in_seconds(); double frameTime = newTime - currentTime; currentTime = newTime; while ( frameTime &gt; 0.0 ) { float deltaTime = min( frameTime, dt ); integrate( state, t, deltaTime ); frameTime -= deltaTime; t += deltaTime; } render( state ); }\n The benefit of this approach is that we now have an upper bound on delta time. It’s never larger than this value because if it is we subdivide the timestep. The disadvantage is that we’re now taking multiple steps per-display update including one additional step to consume any the remainder of frame time not divisible by dt. This is no problem if you are render bound, but if your simulation is the most expensive part of your frame you could run into the so called “spiral of death”.\n What is the spiral of death? It’s what happens when your physics simulation can’t keep up with the steps it’s asked to take. For example, if your simulation is told: “OK, please simulate X seconds worth of physics” and if it takes Y seconds of real time to do so where Y &gt; X, then it doesn’t take Einstein to realize that over time your simulation falls behind. It’s called the spiral of death because being behind causes your update to simulate more steps to catch up, which causes you to fall further behind, which causes you to simulate more steps…\n So how do we avoid this? In order to ensure a stable update I recommend leaving some headroom. You really need to ensure that it takes  significantly less than X seconds of real time to update X seconds worth of physics simulation. If you can do this then your physics engine can “catch up” from any temporary spike by simulating more frames. Alternatively you can clamp at a maximum # of steps per-frame and the simulation will appear to slow down under heavy load. Arguably this is better than spiraling to death, especially if the heavy load is just a temporary spike.\n  Now let’s take it one step further. What if you want exact reproducibility from one run to the next given the same inputs? This comes in handy when trying to network your physics simulation using deterministic lockstep, but it’s also generally a nice thing to know that your simulation behaves exactly the same from one run to the next without any potential for different behavior depending on the render framerate.\n But you ask why is it necessary to have fully fixed delta time to do this? Surely the semi-fixed delta time with the small remainder step is “good enough”? And yes, you are right. It is  good enough in most cases but it is not  exactly the same due to to the limited precision of floating point arithmetic.\n What we want then is the best of both worlds: a fixed delta time value for the simulation plus the ability to render at different framerates. These two things seem completely at odds, and they are - unless we can find a way to decouple the simulation and rendering framerates.\n Here’s how to do it. Advance the physics simulation ahead in fixed dt time steps while also making sure that it keeps up with the timer values coming from the renderer so that the simulation advances at the correct rate. For example, if the display framerate is 50fps and the simulation runs at 100fps then we need to take two physics steps every display update. Easy.\n What if the display framerate is 200fps? Well in this case it we need to take half a physics step each display update, but we can’t do that, we must advance with constant dt. So we take one physics step every two display updates.\n Even trickier, what if the display framerate is 60fps, but we want our simulation to run at 100fps? There is no easy multiple. What if VSYNC is disabled and the display frame rate fluctuates from frame to frame?\n If you head just exploded don’t worry, all that is needed to solve this is to change your point of view. Instead of thinking that you have a certain amount of frame time you must simulate before rendering, flip your viewpoint upside down and think of it like this: the renderer  produces time and the simulation  consumes it in discrete dt sized steps.\n  double t = 0.0; const double dt = 0.01; double currentTime = hires_time_in_seconds(); double accumulator = 0.0; while ( !quit ) { double newTime = hires_time_in_seconds(); double frameTime = newTime - currentTime; currentTime = newTime; accumulator += frameTime; while ( accumulator &gt;= dt ) { integrate( state, t, dt ); accumulator -= dt; t += dt; } render( state ); }\n Notice that unlike the semi-fixed timestep we only ever integrate with steps sized dt so it follows that in the common case we have some unsimulated time left over at the end of each frame. This left over time is passed on to the next frame via the accumulator variable and is not thrown away.\n  But what do to with this remaining time? It seems incorrect doesn’t it?\n To understand what is going on consider a situation where the display framerate is 60fps and the physics is running at 50fps. There is no nice multiple so the accumulator causes the simulation to alternate between mostly taking one and occasionally two physics steps per-frame when the remainders “accumulate” above dt.\n Now consider that the majority of render frames will have some small remainder of frame time left in the accumulator that cannot be simulated because it is less than dt. This means we’re displaying the state of the physics simulation at a time slightly different from the render time, causing a subtle but visually unpleasant stuttering of the physics simulation on the screen.\n One solution to this problem is to interpolate between the previous and current physics state based on how much time is left in the accumulator:\n double t = 0.0; double dt = 0.01; double currentTime = hires_time_in_seconds(); double accumulator = 0.0; State previous; State current; while ( !quit ) { double newTime = time(); double frameTime = newTime - currentTime; if ( frameTime &gt; 0.25 ) frameTime = 0.25; currentTime = newTime; accumulator += frameTime; while ( accumulator &gt;= dt ) { previousState = currentState; integrate( currentState, t, dt ); t += dt; accumulator -= dt; } const double alpha = accumulator / dt; State state = currentState * alpha + previousState * ( 1.0 - alpha ); render( state ); }\n This  looks complicated but here is a simple way to think about it. Any remainder in the accumulator is effectively a measure of just how much more time is required before another whole physics step can be taken. For example, a remainder of dt/2 means that we are currently halfway between the current physics step and the next. A remainder of dt*0.1 means that the update is 1/10th of the way between the current and the next state.\n We can use this remainder value to get a blending factor between the previous and current physics state simply by dividing by dt. This gives an alpha value in the range [0,1] which is used to perform a linear interpolation between the two physics states to get the current state to render. This interpolation is easy to do for single values and for vector state values. You can even use it with full 3D rigid body dynamics if you store your orientation as a quaternion and use a spherical linear interpolation (slerp) to blend between the previous and current orientations.\n   Glenn Fiedler is the founder and CEO of   Network Next.  Network Next is fixing the internet for games by creating a marketplace for premium network transit.", "posttime": "2020-06-26 16:48:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时间,fix,模拟", "title": "固定你的时间步长", "title_en": "Fix Your Timestep", "transed": 1, "url": "https://gafferongames.com/post/fix_your_timestep/", "via": "", "real_tags": ["时间", "fix", "模拟"]}, {"category": "", "categoryclass": "", "imagename": "d53bcb61c51d5fb67b6f359ee3c650a4.jpg", "infoid": 1008373, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Symbolics实现了一个所见即所得的网络文档编辑器和浏览器界面，其中包括到文档的其他部分的超文本链接和.", "note_en": "Symbolics implemented a WYSIWYG networked documentation editor and browser interface which included hypertext linking to other sections of documentation and ...", "posttime": "2020-06-26 16:23:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "超文本,concordia,文档", "title": "Symbolics Concordia在线文档超文本标记1985", "title_en": "Symbolics Concordia Online Documentation Hyper Text Markup 1985", "transed": 1, "url": "https://youtu.be/ud0HhzAK30w", "via": "", "real_tags": ["超文本", "concordia", "文档"]}, {"category": "", "categoryclass": "", "imagename": "71d3fd4e9636a87f92e0c3c5c2ee5949.png", "infoid": 1008372, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "时钟信号(CLK&39；CLK&39；)是游客寻求隐形的仿真器。用户直接启动经典软件，不需要仿真器，也不需要经过仿真的机器学习曲线。\n在Mac上，它是一个原生Cocoa应用程序。在Linux、BSD和其他UNIX以及类似UNIX的操作系统下，它依赖于SDL2。\n通过静态分析和运行时分析的结合，CLK寻求能够自动选择和配置适当的机器来运行任何提供的磁盘、磁带或ROM；发出运行磁盘、磁带或ROM上包含的软件所需的任何命令；并在可行的情况下提供加速加载。\n因此，加载标题的完整过程-即使您以前从未使用过模拟的计算机-是这样的：\n考虑一架普通的，未改装的Vic-20准将。它唯一的视频输出是复合的。因此，仿真机器的唯一视频输出是合成的。为了显示视频输出，您的GPU随后对复合视频进行解码。因此，所有复合视频伪像都存在并且精确正确，这不是因为后自组织滤波器结合了作者与复合视频相关联的所有主观效果，而是因为真实信号确实正在被处理。\n在音频生成方面也投入了类似的努力。如果真实机器通常产生192 KHz的音频，那么仿真器就会产生192 KHz的源信号，并将其过滤到主机可以输出的任何信号。\n如果您的机器有4k显示器和96 kHz音频输出？然后，您将获得4k的复合显示器渲染效果，假设仿真机器产生96 kHz或以上的源音频，每秒有96,000个不同的音频样本。隔行扫描的视频也能正常工作，看起来也很像在生产它的机器上所做的那样。\n生产的显示器是一个模拟的CRT，带有磷光体衰变。因此，如果您有一个140 Hz的监视器，它每秒可以产生140个不同的帧。延迟由输出硬件决定，而不是由仿真机器决定。\n机器更新机制分别受屏幕刷新和音频流处理的影响；因此，无论屏幕的刷新率如何，音频延迟通常被限制在5-10ms。\n模仿连续自然的CRT，而不仅仅是执行帧尾转录的必然结果是，在60 Hz显示器上显示50 Hz视频的最常见的运动混叠效果被最小化；你不必拥有利基设备就能受益。\n针对受支持的目标机器的精确周期仿真是相当陈腐的；此仿真器试图遵循这一先例。所有的仿真逻辑都是用C++编写的，目的是显式控制成本，但是，在出现冲突时，假定是为了代码的清晰度和简单性。此仿真器愿意花费现代硬件上可用的处理资源。", "note_en": "Clock Signal (&#39;CLK&#39;) is an emulator for tourists that seeks to be invisible. Users directly launch classic software with no emulator or per-emulated-machine learning curve.\n  On the Mac it is a native Cocoa application. Under Linux, BSD and other UNIXes and UNIX-alikes it relies upon SDL 2.\n       Through the combination of static analysis and runtime analysis, CLK seeks to be able automatically to select and configure the appropriate machine to run any provided disk, tape or ROM; to issue any commands necessary to run the software contained on the disk, tape or ROM; and to provide accelerated loading where feasible.\n The full process of loading a title — even if you&#39;ve never used the emulated machine before — is therefore:\n   Consider an ordinary, unmodified Commodore Vic-20. Its only video output is composite. Therefore the emulated machine&#39;s only video output is composite. In order to display the video output, your GPU then decodes composite video. Therefore all composite video artefacts are present and exactly correct, not because of a post hoc filter combining all the subjective effects that this author associates with composite video but because the real signal is really being processed.\n Similar effort is put into audio generation. If the real machine normally generates audio at 192Khz then the emulator generates a 192Khz source signal and filters it down to whatever the host machine can output.\n If your machine has a 4k monitor and a 96Khz audio output? Then you&#39;ll get a 4k rendering of a composite display and, assuming the emulated machine produces source audio at or above 96Khz, 96,000 individual distinct audio samples a second. Interlaced video also works and looks much as it always did on those machines that produce it.\n     The display produced is an emulated CRT, with phosphor decay. Therefore if you have a 140Hz monitor it can produce 140 distinct frames per second. Latency is dictated by the output hardware, not the emulated machine.\n The machine update mechanism is influenced separately by both screen refresh and audio stream processing; audio latency is therefore generally restrained to 5–10ms regardless of your screen&#39;s refresh rate.\n A corollary of emulating the continuous nature CRT, not merely performing end-of-frame transcriptions, is that the most common motion aliasing effects of displaying 50Hz video on a 60Hz display are minimised; you don&#39;t have to own niche equipment to benefit.\n  Cycle-accurate emulation for the supported target machines is fairly trite; this emulator seeks to follow that precedent. All emulation logic is written in C++ for explicit control over costs but, where a conflict arises, the presumption is towards clarity and simplicity of code. This emulator is willing to spend the processing resources available on modern hardware.", "posttime": "2020-06-26 15:43:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "平台,signal,音频", "title": "时钟信号：8位和16位平台的延迟厌恶仿真器", "title_en": "Clock Signal: A latency-hating emulator of 8- and 16-bit platforms", "transed": 1, "url": "https://github.com/TomHarte/CLK", "via": "", "real_tags": ["平台", "signal", "音频"]}, {"category": "", "categoryclass": "", "imagename": "428da4b9b894b0cac5341d0bcd26b5cd.jpg", "infoid": 1008371, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们对托纳里的目标是建立一个通往另一个空间的虚拟通道，允许真正自然的人类互动。经过近两年的开发，据我们所知，Tonari是目前可用的最低延迟、高分辨率、随时可以生产的电话会议产品(我们真的不喜欢这个词)。\n玻璃到玻璃的延迟130ms(从光线照射到摄像头出现在另一边屏幕上的时间)。\n相比之下，Zoom和WebRTC的典型延迟为315-500ms，在我们办公室同一网络上的两台笔记本电脑(X1 Carbon和MacBook Pro)之间进行了测量。这是一个巨大的不同之处。这就是不断打断对方和自然交谈之间的不同之处。它的区别在于，摄像头拍摄的模糊面孔似乎指向某人的鼻子，而广域的高保真图像则能流畅地传递面对面交谈中所有微妙的肢体语言。\n自从2月份启动我们的第一个试点以来，我们没有经历过与软件相关的停机(被以太网电缆绊倒则是另一回事)。尽管我们很乐意认为我们是绝对可靠的工程师，但我们真的不相信，如果没有铁锈，我们能够达到这样的稳定水平是不可能实现这些数字的。(工业和信息化部电子科学技术情报研究所陈皓)。\n第一个托纳利概念验证使用了一个基本的投影仪、蓝牙扬声器和一个运行在普通WebRTC(JavaScript)之上的网站。自从那些日子以来，我们已经走过了很长一段路。\n虽然这个原型(以及我们对未来的固执己见的愿景)为我们赢得了拨款，但我们知道，除非我们能实现比WebRTC低得多的延迟和更高的保真度--这两件事目前与2020年的视频聊天没有联系在一起，否则Tonari将在到达时就完蛋了。\n我们想，“好的，所以我们可以直接修改WebRTC，并用C++用一个圆滑的UI来包装它，然后立即启动它。”\n与WebRTC近75万个LoC庞大的代码库进行了一周的斗争，揭示了一个小小的更改可能会有多么痛苦-使用您正在处理的代码测试并感到真正安全是多么困难。\n因此，在愤怒的(阅读：平静和彻底讨论)退出之后，我们决定从头开始重新实现整个堆栈更容易。我们想知道和理解在我们的硬件上运行的每一行代码，并且它应该是为我们想要的确切硬件而设计的。\n于是，我们开始了超越高级界面(如浏览器或现有RTC项目)的深度之旅，并从头开始进入低级系统和硬件交互的世界。\n我们需要它本质上是安全的，以保护那些使用Tonari的人的隐私。我们需要它的表现力，让它看起来尽可能人性化和实时性。随着代码变得更加成熟，随着新大脑的出现，我们需要它具有可维护性，并且必须学习我们的工作并在此基础上进行扩展。\n安全性：C和C++是内存和并发不安全的，它们的不同且看似无限的构建系统使得获得一致而简单的开发体验变得困难。\n性能：Java、C#和Go的内存管理是不透明的，在您希望完全控制内存的延迟敏感型应用程序中可能很难使用。\n可维护性：Haskell、Nim、D和其他几种更定制的语言往往在工具、社区和可雇佣能力方面受到更多限制。\n铁锈的美丽之处在于开发社区做出的无数决定，这些决定不断地让你觉得你可以吃到十个蛋糕，而且还可以吃掉所有的蛋糕。\n它的构建系统是固执己见的，设计得很干净。它本身就是一个完整的生态系统，使向您的项目引入新工程师和设置开发环境变得非常简单。\n内存和并发安全保证怎么评价都不为过。我们相信，如果我们在C++中继续这样做，我们还不会完成第一次部署-我们可能仍然会陷入微妙的障碍。\n我们能够通过像CUDA这样的API在最低级别与硬件交互，通常是通过现有的机箱(Rust对代码库的术语)，这使得我们能够对我们想要的第一个生产版本的延迟有更高的标准。\n随着tonari变得越来越先进，我们现在正在选择嵌入式微控制器，它们的固件可以用铁锈编写，这样我们就不必离开我们田园诗般的乌托邦，进入不安全的系统编程的旧世界。\n我们不打算在这里批评货架，而是集中在一些精选的板条箱上，这些板条箱获得了终身邀请参加我们每个生日派对的声望很高的奖项。\n在几乎所有方面，CrossBeam都比std：：sync：：mpsc更适合线程间通信，并且最终可能会合并到std：：sync：：mpsc中。\nparking_lot在几乎所有方面都比std：：sync：：mutex有一个更好的互斥体实现，并且可能会合并到标准库中(有朝一日)。它还提供了许多其他有用的同步原语。\n与Vec&lt；U8&&gt;相比，Bytes是一种更健壮、性能更好的字节处理方式。\n如果您曾经进行过较低级别的网络优化，那么Socket2将是您最终的目标。\nFERN是定制和美化您的日志记录输出的一种非常简单的方法。我们使用它来保持日志的可读性和内部标准化。\nstructopt是您一直梦想的CLI参数的处理方式。没有理由不使用它，除非您要追求最低限度的依赖。\n货树(最近集成到货树中)显示了一个依赖树，它在许多方面都很有用，但主要用于确定最小化依赖关系的方法。\n托纳利代码库是一种单一代码库。在它的根部，我们有一个货物工作区，里面有一个二进制文件箱，以及一些支持库的箱子。\n将我们的板条箱放在一个repo中，这样就可以轻松地在我们的二进制板条箱中引用它们，而不需要发布到crates.io，也不需要在Cargo.toml中指定git依赖项。当将这些库作为开放源码发布时，将其拆分成自己的repo是微不足道的。\n我们有一个主库机箱，其中包含用于与硬件、媒体编解码器、网络协议等对话的统一API。在该私有API之外，我们的工作区中也有独立的机箱，我们认为它们是开源的候选对象。例如，我们编写了适合长期运行的高吞吐量参与者的参与者框架，以及用于可靠、高带宽、低延迟媒体流的网络协议。我们对tonari系统的不同部分使用单独的二进制文件，每个部分都位于二进制文件中，即组合库/二进制箱。它的库模块包含一组可重用的参与者，这些参与者将我们的私有API与参与者系统结合在一起，然后是使用这些参与者并定义它们之间管道的一组单独的二进制文件。\n我们广泛使用功能标志，以允许在不同的操作系统(如Brian&39；1970年代的MacBook Pro)或不同的硬件配置上开发我们的项目。例如，Linux使用V4L2(Video for Linux.2)来访问大多数网络摄像头，但其他网络摄像头可能有自己的SDK。要为不使用V4L2的平台进行编译，或者当SDK不适用于特定操作系统时，我们可以将这些SDK放在功能标志后面并导出通用接口。作为一个(简化的)具体示例，让我们假设我们有一个定义为特征的通用相机接口：(#*_)。\npub特征捕获{/从摄像头捕获一帧，返回一个RGB图像字节的VEC。FN捕获(&amp；mut self)-&gt；Vec&lt；U8&gt；；}\n让我们也假设我们有三个不同的相机接口-V4L2，核心视频和宝丽来。我们可以使我们的二进制文件只使用这一特性来灵活工作，并且我们可以使用功能标志交换不同的捕获实现。\nMod V4L2{pub struct V4l2Capture{.}针对V4l2Capture的实施捕获{fn Capture(&amp；mut self)-&gt；Vec&lt；U8&gt；{.}模块核心视频{pub struct CoreVideoCapture{.}针对CoreVideoCapture的实施捕获{FN Capture(&amp；mut self)-&gt；Vec&lt；U8&Gt。{.}mod宝丽来{pub struct PolaroidCapture{.}针对PolaroidCapture执行捕获{fn Capture(&amp；mut self)-&gt；vec&lt；u8&gt；{.}pub type VideoCapture=V4L2：：V4l2Capture；pub type VideoCapture=corevideo：：CoreVideoCapture；pub type VideoCapture=Polaroid。\n如果我们让我们的代码使用实现捕获特征的东西，而不是具体的类型，我们现在可以通过简单地切换功能标志在不同的平台上编译并瞄准不同的平台。例如，我们可以有一个具有field-video_Capture：box&lt；dyn Capture&gt；的结构，它允许我们存储可以从摄像机捕获的任何类型。例如，用于支持我们上面编写的捕获实现的Cargo.toml文件可能如下所示：\n[软件包]名称=&#34；tonari&#34；版本=&#34；1.0.0&#34；版本=&#34；2018&#34；[功能]默认=[&#34；V4L2&#34；]MacOS=[&#34；核心视频&#34；]经典=[&#34；宝丽来&#34；]V4L2=[&#34；rscam&#34；][依赖项]rscam={版本=&#34。0.5&#34；，Optional=true}#V4L2 Linux摄像头库corevideo={Version=&#34；0.1&#34；，Optional=true}#MacOS摄像头库polaroid={version=&#34；0.1&#34；，Optional=true}#宝丽来相机库(非常慢的FPS)。\n通过这种方式，我们可以避免构建和链接到特定于平台的库(如V4L2)，这些库并不是随处可用的。\n在转到铁锈公司一年后，我们让我们的第四位工程师加入了团队，他之前在铁锈公司或系统工程方面都没有太多经验。虽然学习曲线是不可否认的(借用检查器，我的老朋友)，但我们已经发现，对于那些从新手到低级编程的人来说，Rust是一种令人难以置信的授权。\n如前所述，内置于语言中的内存和并发安全意味着一整类问题不仅无法编译，而且编译器本身通常是您唯一需要的老师，因为它的警告非常具有描述性。关于Rust伟大的编译器信息，以及优秀的文档(例如，请看一下这篇关于字符串的冗长讨论)，已经写了很多，在我们的例子中，这些也是非常有用的资源。\n与许多其他语言不同，在Rust中通常有一种显而易见的正确方法。不是以正确的方式编写的代码往往会脱颖而出，并且很容易在审查中挑出来，通常是通过货物剪辑自动挑选出来的。\n在实践中，这意味着新的工程师可以迅速开始贡献可投入生产的代码。代码审查可以将重点放在实现上，而不是花费精力进行手动正确性检查。\n在IDE部门，与一些前辈相比，Rust仍然显示出相对的不成熟。特别是今年，虽然有了很大的进步，我们每个人在这一点上都找到了一个相当舒适的发展环境。·我们中有1人使用MacOS，3人使用Linux(Arch、Ubuntu和Pop！_OS，暴露出我们各自的受虐狂程度)·我们中有2人将VS Code与锈蚀分析仪插件一起使用，2人将Sublime Text与RustEnhanced一起使用。我们经常共享设置并尝试彼此的解决方案(除了布莱恩，他在29岁时步履维艰)，我们还在不断关注能够帮助我们的新开发工具。\n你知道什么叫狂野吗？在提交代码之前，我们没有您必须阅读的代码样式指南文档。我们不需要。我们只是强制执行“铁锈法”(Rustfmt)。让我告诉您：这真的降低了代码审查的优势。\n我们的代码审查很简单，因为到目前为止我们只有四个人，而且我们很幸运，我们之间有很多信任。我们的主要目标是在每一行代码上至少有两双眼睛，并且不会互相阻挡，这样我们就可以保持势头。\n我们使用Google的Cloud Builder来运行我们的CI构建，因为我们的基础架构堆栈主要构建在GCP之上，并且它允许轻松地调整构建机器规格和自定义构建映像。它是触发的每一次提交，并运行货物剪辑和货物建造。我们将-D警告传递给编译器以将警告升级为错误，以确保我们的更改不会使我们可怜的同事在下次拉出更改时发出生锈警告。为了缩短CI构建时间，我们在云存储中缓存目标和.Cargo目录，以便可以在下次进行增量构建时下载它。\n对于$(ls*/Cargo.toml|xargs dirname)中的crate；执行PUSH$crate#Lint。Cargo+$Nightly_Toolchain clippy--no-default-Feature-D Warning#Build。时间RUSTFLAGS=&#34；-D警告&#34；货物构建--无默认-功能#测试。Time Cargo--无默认设置-已完成Popd功能。\n铁锈生态系统很棒，但是有很多巨大的现有项目在没有巨大的时间投入的情况下不可能移植到铁锈上。WebRTC-Audio-Processing就是一个很好的例子。它提供的好处(清晰的音频，没有声音回声或反馈)是巨大的，在短期内将其移植到Rust是不太可能的(它大约需要80k行C和C++代码)。\n值得庆幸的是，Rust使得使用现有的C和C++库变得相当容易。Bindgen板条箱承担了大部分的搬运任务。给它一个用C或C++编写的头文件，它将自动生成(不安全的)Rust代码，该代码可以调用头文件中定义的函数。在这一点上，它是由您创建一个更高级别的锈箱，暴露一个安全的API。\n对于具有简单或常用构建过程的库来说，此过程中的很多都是相当自动化的。不过，创建更高级别的安全API很重要--bindgen提供的Rust API直接使用并不是很有趣，因为它不安全，而且通常不太习惯。幸运的是，一旦您拥有了更高级别的API，您最终可以将C库换成您自己的Rust版本，而机箱的使用者并不会更明智。\n这些特性让我们可以使用API和硬件，而这些API和硬件要么永远没有原生的Rust API，要么需要几个月或几年的时间才能重新实现。低级操作系统库、大型代码库(如WebRTC-Audio-Processing)和制造商提供的Camera SDK都可以在我们的Rust代码库中使用，而不必将整个应用程序语言迁移到C++，同时仍能像我们那样运行。\n一些C++库很难直接从Rust接口。您必须将类型列入白名单，因为bindgen不能处理所有引入的std：：*类型，它不能很好地处理模板化函数和复制/移动构造函数，以及这里记录的大量其他问题。\n为了解决这些问题，我们通常会创建一个简化的C++头和源代码包装器，用于导出绑定友好函数。这比将整个库移植到Rust要多一点，但工作量要小得多。您可以在这里看到此包装器创建的示例。\n有了Rust的所有生态系统，而且C/C++项目只需一次绑定调用，我们就可以轻松访问现有的一些最高质量的软件包，所有这些都不需要牺牲执行速度。\n生锈并不是没有问题的。它是一种相对较新的语言，正在不断发展，在评估迁移到Rust时，您应该考虑一些缺点。以下是我们的非详尽列表：\n很长的编译时间；流行的xkcd漫画，在等待Rust代码编译时的咖啡休息是非常真实的。例如，我们的代码库在一台中等结实的笔记本电脑上进行非增量编译大约需要8分钟，但可能会更糟。Rust编译器有很多工作要做，以加强强大的语言保证，并且它必须从源代码编译整个依赖关系树。增量构建更好，但是一些机箱附带了拉取和编译非Rust依赖项代码的构建脚本，并且在升级版本和切换分支时可能需要清除构建缓存。\n图书馆复盖率：图书馆生态系统相当成熟，但与C/C++相比复盖率有限。我们最终实现了自己的抖动缓冲区，并且我们还用Rust的bindgen包装了几个C/C++库，这意味着我们的Rust代码中有不安全的区域。非平凡的项目往往有一些最少量的不安全编码，这增加了学习曲线和内存错误的可能性。\nRuust要求您预先编写正确而明确的代码。如果你弄错了，编译器就不会让它溜走。如果您不太关心并发性和内存保证，开发可能会感到不必要的缓慢。不过，Rust开发人员一直在努力改进错误消息。他们很友好，而且可以行动，通常还会有一个固定的建议。一个好的内存和并发基础模型也有助于更快地克服最初的障碍，因此我们建议花时间真正理解语言及其保证。\nRust的类型推理器是如此强大，有时会让您感觉自己正在使用一种动态类型的语言。也就是说，总会有这样的时刻，它并不完全按照您想要的方式工作，特别是当涉及到泛型和deef强制时，您最终不得不摸索以取悦推理者。这可能会伴随着挫折而来，而团队中有一个已经经历过这个学习阶段的人真的很有帮助。如果有足够的耐心，这种挫败感通常会变成令人惊叹的时刻，对语言设计有了更深的理解，为什么会这样做，以及可能会引入的错误。\n语言进化；铁锈语言在不断进化。有些语言结构(如异步)仍然是易失性的，您可能会发现，尽可能地坚持使用线程和标准库是最好的。\n到目前为止，没有经历过与软件相关的停机时间，这既是一个惊喜，也是对铁锈公司提供的安全保证的证明。Ruust还使得编写高效资源使用的高性能代码变得容易-我们的CPU和内存使用都是可预测和一致的。没有垃圾收集器，我们可以保证一致的延迟和帧速率。\n我们维护铁锈代码库的经验也很丰富。我们已经能够有信心地通过对代码库进行较大规模的更改来显著改善我们的延迟。干净的编译并不总是意味着一切都能正常工作，但老实说，情况往往如此。\n最终的结果是一个可靠的产品，它不会成为维护的噩梦(我们知道这是强词夺理)，并且在我们要求的帧率、延迟和资源效率的高规格下快速执行。再说一次，很难想象如果没有生锈我们会是什么样子！\n到目前为止，我们已经开源了一个FFI板条箱，WebRTC-Audio-Processing。这是过去生活在我们回购的顶层的板条箱之一，还有更多类似的板条箱正在走向开源。\n随着我们发布更多的代码，稍后会有更多关于这个主题的内容，但有一件事让人感觉是正确的：即使在我们的板条箱开源之前，假设我们私人装入的每个板条箱都将是开源的，这对我们的代码清晰度来说是非常健康的。这种哲学使我们的箱子之间的边界更加清晰，并鼓励我们更快地做出决定，以最小限度地大惊小怪地开放我们的代码库的某些部分。\n感谢你走到这一步，我们希望这篇脑筋急转弯能提供一两个有用的想法。\n..", "note_en": "Our goal for tonari is to build a virtual doorway to another space that allows for truly natural human interactions. Nearly two years in development, tonari is, to the best of our knowledge, the lowest-latency high resolution production-ready &#34;teleconferencing&#34; (we are truly not fond of that word) product available.\n 130ms glass-to-glass latency (the time from light hitting the camera to when it appears on-screen on the other side)\n Compare this to the typical  315-500ms latency for Zoom and  WebRTC, as measured between two laptops (X1 Carbon and MacBook Pro) on the same network at our office. It&#39;s a huge difference. It&#39;s the difference between constantly interrupting each other versus having a natural flow of conversation. It&#39;s the difference between a blurry face from a camera seemingly pointed up someone&#39;s nose versus a wide-view high fidelity image that smoothly transfers all the subtle body language of an in-person conversation.\n  Since launching  our first pilot in February, we&#39;ve experienced no software-related downtime (tripping over ethernet cables is a different story). A nd as much as we would love to think we&#39;re infallible engineers, we truly don&#39;t believe we could have achieved these numbers with this level of stability without Rust.\n   The  very first tonari proof-of-concept used a basic projector, bluetooth speakers, and a website running on top of vanilla WebRTC (JavaScript). We&#39;ve come a long way since those days.\n While that prototype (and our opinionated vision of the future) got us grant funding, we knew that tonari would be dead on arrival unless we could  achieve  significantly lower latency and higher fidelity than  WebRTC—two things that aren&#39;t currently associated with video chat in 2020.\n We figured, “Okay , so we can just   modify  WebRTC directly and wrap it up with a slick UI in C++ and launch it in no time.”\n A week of struggling with WebRTC’s nearly 750,000 LoC  behemoth of a codebase revealed just how painful a single small change could be — how hard it was to test, and feel truly  safe, with the code you were dealing with.\n   So in a furious (read: calm and thoroughly-discussed) rage quit we decided it was easier to re-implement the whole stack from scratch. We wanted to  know and understand every line of code being run on our hardware, and it should be designed for the  exact hardware we wanted.\n Thus began our journey to the depths beyond high-level interfaces like a browser or existing RTC project, and into the world of low-level systems and hardware interaction from scratch.\n We needed it to  be inherently    secure  to protect the privacy of those who use tonari. We needed it to be   performant to make it feel as human and real-time as possible. And we needed it to be   maintainable as the code becomes more mature, as new brains show up and have to learn our work and expand on it.\n  Security: C and C++ are memory- and concurrency-unsafe, and their disparate and seemingly infinite build systems make it hard to have a consistent and simple development experience.\n Performance: Java,  C#, and Go&#39;s memory management is opaque and can be difficult to work with in latency-sensitive applications where you want full control over your memory.\n Maintainability: Haskell, Nim, D, and a handful of other more bespoke languages tend to be more limited in tooling, community, and hire-ability.\n    Rust&#39;s beauty lies in the countless decisions made by the development community that constantly make you feel like you  can have ten cakes and eat all of them too.\n Its build system is opinionated, and cleanly designed. It is itself a complete ecosystem that makes introducing new engineers to your project and setting up dev environments remarkably simple.\n The memory and concurrency safety guarantees cannot be over-appreciated. We&#39;re confident that we wouldn&#39;t have done our first deployment yet if we had continued this in C++ - we&#39;d still probably be stuck on subtle snags.\n Our ability to interact at the lowest level with hardware via APIs like CUDA, oftentimes through existing   crates (Rust&#39;s term for a code library), has allowed us to have higher standards about the latency we want from our first production release.\n As tonari is getting more advanced, we&#39;re now choosing embedded microcontrollers whose firmware can be written in Rust so we don&#39;t have to leave our idyllic utopia into the old world of unsafe system programming.\n   We&#39;re not going to  cat Cargo.toml here, instead focusing on some select crates that have earned the prestigious award of a lifetime invitation to each of our birthday parties forever.\n   crossbeam is better for inter-thread communication than  std::sync::mpsc in almost every way, and may be merged into  std eventually.\n parking_lot has a mutex implementation better than  std::sync::Mutex in almost every way, and may be merged into the standard library (one day). It also provides many other useful synchronization primitives.\n bytes is a more robust, and often more performant, way to play with bytes compared to  Vec&lt;u8&gt;.\n socket2 is what you will end up at if you are ever doing lower-level networking optimizations.\n   fern is a dead-simple way to customize and prettify your logging output. We use it to keep our logs readable and internally standardized.\n structopt is how you always dreamed CLI arguments would be handled. There&#39;s no reason not to use it unless you&#39;re going for bare-minimum dependencies.\n   cargo tree (recently integrated in cargo) shows a dependency tree that&#39;s useful in many ways, but  mainly in identifying ways to minimize dependencies.\n   The tonari codebase is a monorepo. At its root we have a Cargo workspace with a  binaries crate, and a number of supporting library crates.\n Having our crates in one repo makes them easy to reference in our  binaries crate without needing to publish to  crates.io or get too fancy with specifying git dependencies in our  Cargo.toml. When the time comes to publish these libraries as open source, it&#39;s trivial to break it out into its own repo.\n   We have one main library crate that contains a unified API for talking to hardware, media codecs, network protocols, etc. Outside of that private API, we also have standalone crates in our workspace that we consider candidates for open-sourcing. For example, we’ve written our own actor framework fit for long-running high-throughput actors, as well as our own network protocol for reliable, high-bandwidth, low-latency media streaming.We use separate binaries for different parts of the tonari system and each of these lives in  binaries, a combination library/binary crate. Its library modules contains a set of reusable actors that combine our private API with our actor system, and then a collection of individual binaries that consume these actors and define the plumbing between them.\n   We make extensive use of feature flags to allow development of our project on different OSes (like Brian&#39;s 1970s-era MacBook Pro) or different hardware configurations. This allows us to easily swap out camera hardware without extra runtime checks or using awful  sed hacks.For example, Linux uses  v4l2 (Video For Linux...2) to access most webcams, but other webcams might have their own SDK. To compile for platforms that don&#39;t use  v4l2 or when an SDK isn&#39;t available for a particular OS, we can put those SDKs behind feature flags and export a common interface.As a (simplified) concrete example, let&#39;s say we have a common camera interface defined as a trait:\n pub  trait Capture  {  /// Capture a frame from a camera, returning a Vec of RGB image bytes.  fn  capture ( &amp; mut  self )  -&gt; Vec &lt;u8 &gt; ; }\n Let&#39;s also say we have three different camera interfaces -  v4l2,  corevideo, and  polaroid. We can make our binaries work exclusively with this trait to be flexible, and we can swap in different implementations of  Capture with feature flags.\n mod v4l2  {  pub  struct V4l2Capture  {  ...  }  impl Capture  for V4l2Capture  {  fn  capture ( &amp; mut  self )  -&gt; Vec &lt;u8 &gt;  {  ...  }  } }  mod corevideo  {  pub  struct CoreVideoCapture  {  ...  }  impl Capture  for CoreVideoCapture  {  fn  capture ( &amp; mut  self )  -&gt; Vec &lt;u8 &gt;  {  ...  }  } }  mod polaroid  {  pub  struct PolaroidCapture  {  ...  }  impl Capture  for PolaroidCapture  {  fn  capture ( &amp; mut  self )  -&gt; Vec &lt;u8 &gt;  {  ...  }  } }  pub  type VideoCapture  = v4l2 ::V4l2Capture ;  pub  type VideoCapture  = corevideo ::CoreVideoCapture ;  pub  type VideoCapture  = polaroid ::PolaroidCapture ;\n If we make our code work with things which implement the  Capture trait instead of concrete types, we can now compile on and target various platforms by simply toggling feature flags. For example, we can have a struct which has a field -  video_capture: Box&lt;dyn Capture&gt; which will let us store any type which can  Capture from a camera.An example  Cargo.toml file to support the capture implementations we wrote above might look something like this:\n [ package ]name  =  &#34;tonari&#34;version  =  &#34;1.0.0&#34;edition  =  &#34;2018&#34; [features ] default  =  [ &#34;v4l2&#34; ]macos  =  [ &#34;corevideo&#34; ]classic  =  [ &#34;polaroid&#34; ]v4l2  =  [ &#34;rscam&#34; ] [dependencies ]rscam  =  { version  =  &#34;0.5&#34; , optional  =  true  } # v4l2 linux camera librarycorevideo  =  { version  =  &#34;0.1&#34; , optional  =  true  } # MacOS camera librarypolaroid  =  { version  =  &#34;0.1&#34; , optional  =  true  } # Polaroid camera  library  (very slow  FPS )\n This way we can avoid building and linking to platform-specific libraries like  v4l2 which aren&#39;t available everywhere.\n   A year after switching over to Rust, we onboarded our fourth engineer to the team, who didn&#39;t have much prior experience in either Rust or systems engineering. While the learning curve is undeniable (    borrow checker   , my old friend), we&#39;ve found that Rust is incredibly empowering for those new to lower-level programming.\n As mentioned, memory and concurrency safety built into the language means that an  entire class of problems not only fail to compile,   but  the compiler itself is often the only teacher you need since its warnings are so descriptive. Much has already been written about Rust&#39;s  great compiler messages, as well as  excellent docs (for example, take a look at this  lengthy discussion on strings), and in our case as well these have been incredibly helpful resources.\n There is usually one obvious &#34;right way&#34; to do a thing in Rust, unlike many other languages. Code that isn&#39;t written the &#34;right way&#34; tends to stand out, and is easy to pick out in reviews, often times automatically by  cargo clippy.\n In practice, this has meant that new engineers can quickly start contributing production-ready code. Code reviews can remain focused on the implementation, as opposed to expending energy doing manual correctness checks.\n     In the IDE department, Rust still shows its relative immaturity compared to some of its predecessors. This year especially, though, there have been huge strides, and each of us has found a pretty comfortable development environment at this point. • 1 of us use macOS, and 3 of us use Linux (Arch, Ubuntu, and Pop!_OS, revealing our respective levels of masochism) • 2 of us use VS Code with the  rust-analyzer plugin, and 2 of us use Sublime Text with  RustEnhanced.We’re often sharing setups and trying each other’s out (except Brian, who is stuck in his ways at the ripe old age of 29), and we’re constantly keeping an eye on new development tools that can help us work better together.\n   You know what&#39;s  wild? We don&#39;t have a code style guideline document that you have to read before submitting code. We don&#39;t need one. We just enforce  rustfmt.  Let me tell you: it really takes the edge off of code reviews.\n   Our code reviews are straightforward since there&#39;s only four of us so far, and we are lucky to have a lot of trust amongst us. Our main goal is to have   at least two pairs of eyes on every line of code, and to not block each other so we can maintain momentum.\n   We use Google’s Cloud Builder for running our CI build, as our infrastructure stack is mostly built on GCP and it allows for easy-ish tweaking of build machine specs and custom build images. It&#39;s triggered for every commit and runs  cargo clippy and  cargo build. We pass  -D warnings to the compiler to promote warnings into errors to ensure our changes don’t make our poor fellow coworker’s  rustc  rain warnings on them the next time they pull changes.To improve the CI build time, we cache the  target and  .cargo directories in Cloud Storage, so it can be download next time for incremental build.\n for  crate  in   $( ls */Cargo.toml  |  xargs  dirname ) ;  do  pushd  $crate  # Lint. cargo + $NIGHTLY_TOOLCHAIN clippy --no-default-features -- -D warnings  # Build.  time  RUSTFLAGS = &#34;-D warnings&#34; cargo build --no-default-features  # Test.  time cargo   --no-default-features  popd done\n    The Rust ecosystem is great, but there are huge existing projects out there which just aren&#39;t feasible to port to Rust yet without a huge time investment.  webrtc-audio-processing is a good example. The benefits it provides (clear audio with no vocal echoes or feedback) are huge and porting it to Rust in the near-term is not likely (it&#39;s around 80k lines of C and C++ code).\n Thankfully, Rust makes it quite easy to use existing C and C++ libraries.  The   bindgen  crate does most of the heavy-lifting. Give it a header file in C or C++ and it will automatically generate (unsafe) Rust code which can call the functions defined in the header. At that point, it&#39;s up to you to create a higher level Rust crate which exposes a safe API.\n A lot of this process is fairly automatic for libraries with straightforward or commonly-used build processes. Creating the higher level safe API is important though - the Rust API that bindgen provides is not very fun to use directly as it&#39;s unsafe and typically not very idiomatic. Fortunately, once you have a higher level API you can eventually swap the C library out with your own Rust version and consumers of the crate are none the wiser.\n These features let us work with APIs and hardware which would either never have a native Rust API or take months or years to re-implement. Low-level OS libraries, large codebases such as  webrtc-audio-processing, and manufacturer-supplied camera SDKs all become available for use in our Rust codebase without having to move our entire application language over to C++, while still performing as if we had.\n   Some C++ libraries are difficult to interface with directly from Rust. You have to whitelist types because  bindgen can&#39;t handle all the  std::* types that get pulled in, it doesn&#39;t play well with templated functions and copy/move constructors, and a whole host of other issues documented  here.\n To get around these issues, we&#39;ll typically create a simplified C++ header and source wrapper which exports  bindgen-friendly functions. It&#39;s a bit more work, but far less work than porting the entire library to Rust. You can see an example of this wrapper creation  here.\n With all of Rust&#39;s ecosystem, and C/C++ projects being only a  bindgen invocation away, we have easy access to some of the highest quality software packages in existence, all without having to sacrifice execution speed.\n   Rust is not problem-free. It&#39;s a relatively new language that is constantly evolving, and there are shortcomings that you should consider when evaluating a move to Rust.  Here is our non-exhaustive list:\n Long compile times;  the popular xkcd comic, the coffee break while waiting for Rust code to compile is very real. Our codebase for example takes about 8 mins to compile non-incrementally on a moderately beefy laptop, but it can be a lot  worse.The Rust compiler has a lot of work to do enforcing strong language guarantees, and it must compile your entire dependency tree from source. Incremental builds are better, but some crates come with build scripts that pull and compile non-Rust dependency code, and the build cache may need to be cleared when upgrading their versions and switching branches.\n Library coverage; The library ecosystem is quite mature but the coverage is limited compared to C / C++. We ended up implementing our own jitter buffer, and we also wrap several C / C++ libraries with Rust&#39;s  bindgen, which means we have  unsafe regions in our Rust code. Non-trivial projects tend to have some minimal amount of  unsafe coding, which adds to the learning curve and chance of memory bugs.\n Rust demands you to write  correct and explicit code up-front. If you get it wrong, the compiler won&#39;t let it slide. If you care less about concurrency and memory guarantees, development can feel needlessly slow. Rust developers are constantly working on improving the error messages, though. They are friendly and actionable, often with an included fix suggestion. A good foundational model on memory &amp; concurrency also helps getting over the initial hump quicker, so we suggest taking time to truly understand the language and its guarantees.\n Rust&#39;s type inferencer is so strong it makes you feel sometimes like you&#39;re using a dynamically-typed language. That said, there comes the moment where it does not quite work the way you want, especially when generics and  deref coercion are involved, and you end up having to fumble around to make the inferencer happy. It can come with frustration, and it&#39;s really helpful to have someone in the team who already has gone through that stage of learning. With enough patience, that frustration often turns into a wow moment, with a deeper understanding of the language design and why it&#39;s done that way, as well as a possible bug that you would have otherwise introduced.\n Language evolution; The Rust language is constantly evolving. Some of the language constructs like  async are still volatile, and you may find it&#39;s best to stick with threads and the standard library when you can.\n   Experiencing no software-related downtime so far is both a pleasant surprise, and a testament to the safety provided by Rust&#39;s guarantees. Rust has also made it easy to write performant code with efficient resource usage - both our CPU and memory usage has been predictable and consistent. Without a garbage collector, we can guarantee consistent latency and frame rates.\n Our experience maintaining a Rust codebase has also been great. We&#39;ve been able to introduce significant improvements to our latency through sizable changes to our codebase with confidence. A clean compile doesn&#39;t always imply everything will work, but honestly, that&#39;s been the case more often than not.\n The end result is a reliable product which hasn&#39;t been a nightmare to maintain (strong words, we know), and performs quickly at the high specs we demand for frame rate, latency, and resource efficiency. Again, it&#39;s hard to imagine where we might be without Rust!\n   We&#39;ve open sourced one   FFI  crate so far,   webrtc-audio-processing. This is one of the crates that used to live in the top level of our repo, and there are many more like it on their way to open-source.\n There will be more on this subject later as we release more code, but one thing feels true: even before open-sourcing our crates, it’s felt very healthy to our code&#39;s clarity to  assume each crate we crate privately  will be open-sourced. This philosophy keeps our boundaries between crates more clean, and encourages us to make quicker decisions about opening up parts of our codebase with minimal fuss.\n   Thanks for making it this far, we hope this brain-dump might have offered a useful thought or two\n......", "posttime": "2020-06-26 15:42:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈,achieving,代码", "title": "3k、60fps、130ms：用铁锈实现", "title_en": "3K, 60fps, 130ms: achieving it with Rust", "transed": 1, "url": "https://blog.tonari.no/why-we-love-rust?ref=twtr", "via": "", "real_tags": ["rust", "铁锈", "achieving", "代码"]}, {"category": "", "categoryclass": "", "imagename": "2b0a79850bfcc34e2041bedd0534978e.jpg", "infoid": 1008370, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，太空旅游公司太空探险公司宣布与S.P.科罗廖夫火箭和太空公司达成协议，将运送两名太空游客前往国际空间站。这份合同让人大开眼界的是，它将给其中一名游客一个在国际空间站外太空行走的机会。\n太空探险公司表示，此人将成为历史上第一位体验开放空间的普通公民。\n为我们的编辑订阅CNET Now时事通讯，精选当天最重要的新闻。\n科罗廖夫火箭和空间公司(简称Energia)为俄罗斯航天局Roscosmos制造联盟号设备，后者于周四确认了太空探险协议。俄罗斯宇宙飞船的目标是2023年的飞行。\n太空行走的游客不会被单独送出空舱。一位专业的宇航员会跟着去。太空行走也需要相当多的准备工作。太空探险公司表示，被录取并获得安全保障的候选人将被要求完成专门的培训和额外的模拟，为太空行走尝试做准备。\n这次飞行将使用俄罗斯的联盟号航天器进行，太空行走的参与者将在空间站的俄罗斯部分停留14天。\n太空探险公司一直在忙于签署将普通公民送入太空的协议，包括与SpaceX达成的龙号机组成员席位的协议。\n早在2019年初与俄罗斯国家航空航天局(Roscosmos)达成的一项协议包括计划在2021年向国际空间站发射两名游客，但协议中没有太空行走选项。太空探险公司告诉CNET，新的合同是与2021年的飞行任务分开的。\n太空探险公司与Roscosmos公司的历史可以追溯到2001年第一位太空游客丹尼斯·铁托(Dennis Tito)发射升空。上一次太空游客访问空间站是在2009年，但如果太空探险公司的火箭动力计划成功，国际空间站可能很快就会成为富有的度假者的热点。\n太空探险公司还没有公布其旅游航班的价格细节，但你可以打赌，它们将花费一大笔钱。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "Space tourism company  Space Adventures announced a deal on Thursday with the S.P. Korolev Rocket and Space Corporation to fly two space tourists to the International Space Station. What makes this contract an eye-opener is that it would give one of the tourists an opportunity to go for a spacewalk outside the ISS.\n Space Adventures said this person would become &#34;the first private citizen in history to experience open space.&#34;\n  Subscribe to the CNET Now newsletter for our editors&#39; picks for the most important stories of the day.\n The S.P. Korolev Rocket and Space Corporation (known as Energia) makes the Soyuz equipment for Russia&#39;s space agency Roscosmos, which  confirmed the Space Adventures agreement on Thursday. Roscosmos is targeting the flight for 2023.\n The spacewalking tourist won&#39;t be sent out of the air hatch alone. A professional cosmonaut will go along. The spacewalk will also call for quite a bit of prep work. &#34;Accepted and secured candidates will be required to complete specialized training and additional simulations in preparation for the spacewalk attempt,&#34;  Space Adventures said.\n  The flight will take place using a Russian Soyuz spacecraft, and the spacewalk participant will stay at the Russian segment of the station for 14 days.\n Space Adventures has been busy inking deals to send private citizens into space, including a   deal with SpaceX for seats on the Crew Dragon.\n A  previous agreement with Roscosmos from early 2019 included plans to launch two tourists to the ISS in 2021, but it didn&#39;t feature a spacewalk option. Space Adventures told CNET the new contract is for a separate mission from the 2021 flight.\n Space Adventures has a history with Roscosmos dating back to the launch of the first space tourist,   Dennis Tito in 2001. The last space tourist visited the station in 2009, but the ISS could soon become a hot spot for wealthy vacationers if Space Adventures&#39; rocket-powered plans pan out.\n Space Adventures hasn&#39;t released pricing details for its tourist flights, but you can bet they&#39;ll cost a bundle.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-06-26 15:01:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,游客,space", "title": "2023年，一名幸运的太空游客可以有机会进行国际空间站太空行走", "title_en": "One Lucky Space Tourist Could Get a Shot At An ISS Spacewalk In 2023", "transed": 1, "url": "https://www.cnet.com/news/one-lucky-space-tourist-could-get-a-shot-at-an-iss-spacewalk-in-2023/", "via": "", "real_tags": ["太空", "游客", "space"]}, {"category": "", "categoryclass": "", "imagename": "81b2085d4f6ebf7ffb28b3114b478bbf.jpg", "infoid": 1008367, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在周五的一份声明中，总部位于班加罗尔的Byju‘s表示，它已从玛丽·米克(Mary Meeker)共同创立的风险投资基金筹集了一笔数额不详的资金。据一位知情人士透露，这家成立一年的公司的新支票对这家成立九年的印度初创公司的估值为105亿美元。\nTechCrunch上月初报导称，Byju‘s正与一些投资者洽谈以100亿美元估值融资。\n“在数百万学生的支持下，Byju已经成为教育技术领域的领先者，”Bond的普通合伙人、“互联网趋势报告”(Internet Trends Report)的作者玛丽·米克(Mary Meeker)说。“我们很高兴能支持像Byju这样的有远见卓识的人和他的团队继续创新和塑造教育的未来。”\n通过其应用程序，Byju上的导师帮助所有上学的孩子使用披萨和蛋糕等现实生活中的物体理解复杂的科目。这款应用程序还为正在攻读本科和研究生课程的学生做好准备。\nByju‘s表示，它已经积累了超过5700万注册用户，其中超过350万是付费订户。在新德里3月下旬下令在全国范围内封锁，迫使所有学校关闭后，Byju和包括Facebook支持的Unacademy在内的数十个在线学习平台都向学生推出了免费的新课程。\n这家同名初创公司的联合创始人兼首席执行官拉文德兰·拜朱(Raveendran Byju)说，“这场危机把在线学习带到了风口浪尖，帮助家长、老师和学生都体验和理解了在线学习的价值。”\n他说：“我们有机会积极影响教师的教学方式、学生的学习方式和学校的功能。“明天的教室”将以技术为核心，使学生能够从被动学习过渡到主动学习。其结果将是线上和线下教育产品的最佳结合。“。\n邦德的投资“证明了Byju‘s通过根据学生的能力定制我们的平台，帮助他们更好地学习所起的作用。这亦显示全球对教育科技的兴趣与日俱增，因为数码学习愈来愈为人所接受和接受。“", "note_en": "In a statement on Friday, Bangalore-based Byju’s said it had raised an undisclosed amount from the  VC fund co-founded by Mary Meeker. The one-year-old firm’s new check valued the nine-year-old Indian startup at $10.5 billion, according to a person familiar with the matter.\n TechCrunch reported early last month that Byju’s was in talks with some investors to  raise money at $10 billion valuation.\n  “Endorsed by millions of students, Byju’s has emerged as a clear leader in education technology,” said  Mary Meeker,   General Partner at  BOND   and author of the widely influential Internet Trends Report. “We are excited to support a visionary like Byju and his team in their quest to continue to innovate and shape the future of education.”\n Through its app, tutors on Byju’s help all school-going children understand complex subjects using real-life objects such as pizza and cake. The app also prepares students who are pursuing undergraduate and graduate-level courses.\n Byju’s said it has amassed more than 57 million registered users, more than 3.5 million of whom are paid subscribers. After New Delhi ordered a nationwide lockdown in late March, which forced all schools to close, Byju’s and scores of online learning platforms including Facebook-backed Unacademy have introduced new classes free to students.\n “This crisis has brought online learning to the forefront and has helped parents, teachers and students alike to experience and understand the value of it,” said Raveendran Byju, the co-founder and chief executive of the eponymous startup.\n “We have the opportunity to positively influence how teachers teach, students learn and school’s function. The ‘Classrooms of Tomorrow’ will have technology at the core, empowering students to cross over from passive to active learning. The result will be a combination of the best of both online and offline educational offerings.”\n Investment by Bond is a “testament to the role that Byju’s is playing in helping students learn better by customizing our platform to their abilities. It also demonstrates the rising global interest in education technology as digital learning becomes increasingly accepted and embraced,” he said.", "posttime": "2020-06-26 14:20:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "支持,meeker,byju", "title": "\n玛丽·米克的债券支持印度在线学习初创公司Byju", "title_en": "\n\t\t\t\tMary Meeker’s Bond backs Indian online learning startup Byju’s\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/mary-meekers-bond-invests-in-indian-online-learning-giant-byjus/", "via": "", "real_tags": ["支持", "meeker", "byju"]}, {"category": "", "categoryclass": "", "imagename": "d2a0a77711818d7904fe1a3c11c316dc.png", "infoid": 1008366, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着CHM继续致力于解码人工智能的历史和影响，我们很荣幸能够保存并使这些独特的讨论能够与该领域的一些领先先驱进行接触。\n今天，关于人工智能(AI)正在以何种方式改变我们的世界及其未来的承诺和危险的信息轰炸着我们。但是今天的人工智能，叫做机器学习，与过去的人工智能有很大的不同。从20世纪70年代到90年代，一种非常不同的方法，称为“专家系统”，似乎准备以许多与今天的机器学习相同的方式从根本上改变社会。专家系统寻求将最优秀的人类专家在从诊断传染病到识别敌方潜艇的声纳指纹等方方面面的经验和理解编码到软件系统中，然后让这些系统在新的、真实的案例中提出合理的决定和结论。今天，从维护和维修系统到各种自动化客户支持系统，这些专家系统中的许多都很常见。虽然这样的使用在今天看来很平淡无奇，但专家系统被视为一项重大进步，能够在一系列特定领域达到或超过人类专家的能力。\n2018年5月，CHM主办了一次独特的为期两天的会议，题为“AI：专家系统先锋会议”(AI：Expert Systems Pioneer Meeting)。这次会议是由软件历史中心和软件产业特殊产业集团合作举办的。目标是将专家系统中的重要先驱聚集在一起，让他们讲述自己的故事。正如主持人和组织者之一伯特·格拉德(Burt Grad)在开幕词中强调的那样，与会者被邀请从他们个人的角度描述该领域的历史。正如他所说，“说出你个人所知道的，无论是从与你共事的人那里，还是从你经历过的事情。”1结果是一场涵盖了20世纪50年代到90年代的引人入胜的对话，关注的是在那几年成立的专家系统公司。\n第一天以一场关于人工智能作为一个领域的起源的有趣的讨论开始。与会者分享了关于在最初20年创建该领域的人和机构的记忆。会议特别关注马文·明斯基、约翰·麦卡锡、艾伦·纽威尔和赫伯·西蒙的贡献。与会者还讨论了对“专家系统”、“基于知识的系统”和“人工智能”等术语在那些年意味着什么的不同定义。对话还涉及到人工智能的学术研究和商业应用之间的关系。\n这一天的结束是对20世纪60年代至80年代一些早期采用专家系统的公司的概述。机器智能(Machine Intelligence)、赛门铁克(Symantec)、高级决策系统(Advanced Decision Systems)、人工智能公司(AI Corporation)等公司的创始人解释了每家公司是如何以及何时成立的，它们的主要产品和服务，并讨论了它们的主要资金和收入来源。本次讨论还为与会者提供了讨论标志性AI编程语言LISP如何影响专家系统公司发展的机会。用一位与会者的话说，“LISP机器是有史以来发明的最好的开发环境。”\n会议的第二天集中讨论了上世纪80年代和90年代创建的公司，如Cycorp、Synteligence和Neuron Data。与会者还讨论了IBM、斯伦贝谢和Franz Inc.等大公司是如何。实施了这项技术。讨论不仅概述了这些公司是如何成长并最终失败的，还提供了他们试图解决的技术问题。\n会议以有趣的分析结束，分析了当今人工智能的主导方法--机器学习--与专家系统有何不同。正如爱德华·费根鲍姆总结的那样，主要的不同之处在于粒度问题。当我们从一位医生那里寻求知识时，我们想要一根金条，我们不想要金尘。我们想把它与你的专业知识和你所有的良好判断力的规则打包在一起，全部打包在一起。你现在得到的是金尘，你需要10万粒。“2在最后的讨论中，与会者强调了人工智能方法的这种改变是如何与诸如计算能力的进步等技术进步交织在一起的。\n第二天，CHM与一些与会者赫布·肖尔、阿兰·拉帕波特、布拉德·艾伦和彼得·弗里德兰一起记录了四段口述历史。通过分享他们的个人故事，这四位人工智能先驱有机会为会议期间讨论的主题提供额外的背景。\n现在，CHM第一次从其档案中发布了这些录音，并为今天围绕人工智能和机器学习的对话添加了历史背景。\nCHM首席执行官Dan‘l Lewin说：“我们很自豪能从我们的”AI：专家系统先驱会议“中发布这些重要的录音，包括配套的口述历史。”这些录音突出了人工智能传奇人物和贡献者的声音，如Edward Feignbaum，Herb Schorr，Peter Norvig，Peter Hart，Brad Allen，Peter Friedland和许多其他人，这是一个关于20世纪70年代至90年代专家系统公司背后的人的引人入胜的故事。随着CHM继续致力于解码人工智能的历史和影响，我们很荣幸能够保存并使人们能够接触到与该领域的一些领先先驱进行的这些独特的讨论。“。\n通过记录这些人工智能先驱的声音和故事，CHM为理解我们这个时代最迷人的技术之一提供了宝贵的贡献。", "note_en": "As CHM continues its commitment to decoding the history and impact of AI, we are honored to preserve and make accessible these unique discussions with some of the field’s leading pioneers.\n  Today, we are bombarded by messages about the ways in which artificial intelligence (AI) is changing our world and its future promises and perils. But today’s AI, called machine learning, is very different from much of AI in the past. From the 1970s until the 1990s, a very different approach, called “expert systems,” appeared poised to radically change society in many of the same ways that today’s machine learning seems. Expert systems seek to encode into software systems the experience and understanding of the finest human specialists in everything from diagnosing an infectious disease to identifying the sonar fingerprint of enemy submarines, and then have these systems suggest reasoned decisions and conclusions in new, real-world cases. Today, many of these expert systems are commonplace in everything from systems for maintenance and repair, to automated customer support systems of various sorts. While such uses appear prosaic today, expert systems were viewed as a major advance, able to meet or exceed the capabilities of human experts in a set of specific domains.\n  In May 2018, CHM hosted a unique two-day meeting titled “AI: Expert Systems Pioneer Meeting.” The meeting was a collaboration between the  Software History Center and the  Software Industry Special Industry Group. The goal was to bring together important pioneers in expert systems and let them tell their stories. As Burt Grad, one of the moderators and organizers, highlighted during his opening remarks, attendees were invited describe the history of the field from their personal perspective. As he put it, “tell what you know personally, either from people you worked with or things you experienced.” 1 The result was an engaging conversation covering the 1950s to the 1990s with attention to the expert systems companies founded in those years.\n    The first day opened with an interesting discussion about the origins of AI as a field. The attendees shared memories about the people and the institutions that created the field in its first two decades. In particular the session focused on the contributions of Marvin Minsky, John McCarthy, Allen Newell, and Herb Simon. The attendees also discussed different definitions of what terms such as “expert systems,” “knowledge-based systems,” and “artificial intelligence” meant in those years. The conversation also touched on the relationship between academic research and business application of AI.\n  The day ended with an overview of some of the early companies that embraced expert systems from the 1960s to 1980s. The founders of companies such as Machine Intelligence, Symantec, Advanced Decision Systems, AI Corporation, and others explained how and when each company was founded, their primary products and services, and discussed their main sources of funding and revenue. This discussion also offered attendees the opportunity to address how the signature AI programming language, LISP, affected the growth of expert systems companies. To use the words of one of the attendees, “LISP machines were the best development environment ever invented.” 1\n    The second day of the meeting focused on companies created in the 1980s and 1990s such as CyCorp, Syntelligence, and Neuron Data. Attendees also discussed how larger companies like IBM, Schlumberger, and Franz Inc. implemented this technology. The discussion provided not only an overview of how these companies grew and, in the end, failed, but also the technical problems they were trying to address.\n  The meeting ended with an interesting analysis of how today&#39;s dominant approach to AI—machine learning—differs from expert systems. As Edward Feigenbaum summarizes, the main difference “[i]t&#39;s a granularity issue. When we were going after knowledge from a doctor, we wanted a gold bar; we didn&#39;t want gold dust. We wanted it all packaged up with your expertise and all your rules of good judgment, all packaged together. What you get now is gold dust, and you need 100,000 of them.” 2 During the final discussion attendees underscored how this change of the approach to AI was intertwined with technological advances such as advances in computing power.\n  The following day, CHM recorded four oral histories with some of the meeting attendees Herb Schorr, Alain Rappaport, Brad Allen, and Peter Friedland. By sharing their personal stories, these four AI pioneers had the opportunity to provide extra context to the topics discussed during the meeting.\n  Now for the first time, CHM is releasing these recordings from its archives and adding historical context to today’s conversations surrounding AI and machine learning.\n  “We are proud to release these important recordings, including companion oral histories, from our “AI: Expert Systems Pioneer Meeting,” says CHM CEO Dan’l Lewin. “These recordings highlight the voices of AI legends and contributors like Edward Feignbaum, Herb Schorr, Peter Norvig, Peter Hart, Brad Allen, Peter Friedland and many others in an engaging story about the people behind expert systems companies from the 1970s to the 1990s. As CHM continues its commitment to decoding the history and impact of AI, we are honored to preserve and make accessible these unique discussions with some of the field’s leading pioneers.”\n  By recording the voices and stories of these AI pioneers CHM is providing an invaluable contribution to the understanding of one of most fascinating technologies of our era.", "posttime": "2020-06-26 14:19:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,人工智能,个人,releases", "title": "CHM与人工智能专家系统先锋公司发布新录音和个人故事", "title_en": "CHM Releases New Recordings and Personal Stories with AI Expert Systems Pioneers", "transed": 1, "url": "https://computerhistory.org/blog/chm-releases-new-recordings-and-personal-stories-with-ai-expert-systems-pioneers/", "via": "", "real_tags": ["发布", "人工智能", "个人", "releases"]}, {"category": "", "categoryclass": "", "imagename": "3c2793885cd60a1fe7584c7ed679f6b9.jpg", "infoid": 1008364, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山法律360(美国东部时间2020年6月25日晚上10：12)--加州一名联邦法官周四表示，优步司机声称，这家打车巨头将他们错误归类为独立承包商，从而剥夺了他们的福利，很可能在解雇努力中幸免于难。同一天，加州总检察长寻求初步禁令，迫使优步和Lyft都将司机重新归类为员工。\n美国地区法官爱德华·M·陈(Edward M.Chen)在周四的视频听证会上表示，虽然优步司机克里斯托弗·詹姆斯(Christopher James)和斯宾塞·弗辛斯(Spencer Verhines)仍需要就他们的病假权利要求提供更具体的证据，但他也表示，有些事情可能会在被解雇后继续存在。\n优步在5月提交了部分驳回动议，试图从合并诉讼中剔除索赔。就在几天前，原告要求陈法官认证一个类别，其中可能包括金州数千名选择退出仲裁的司机。优步要求法官驳回司机关于错误分类和享有带薪病假的宣告性判断的指控，称根据他们所依赖的加州劳动法条款，没有私人诉讼理由。\n但司机们反驳了优步的说法，即他们的投诉需要更具体的指控才能继续存在。\n周四，陈法官对优步的论点表示怀疑，并表示司机的指控很可能不会受到这家叫车巨头的解雇努力的影响。法官表示，在发布命令之前，他将重新研究关于宣告性救济的判例法。\nLichten&amp；Liss-Riordan PC的律师香农·利斯-里尔丹(Shannon Liss-Riordan)在听证会后告诉Law360，看来陈法官驳回了优步继续试图削减我们索赔的努力。如果法院要求优步提供病假申请，我们将提供更多细节，因为很明显，优步并没有向司机提供国家强制要求的病假。\n周四，陈法官还询问了律师，加州总检察长对Lyft和Uber提起的平行诉讼可能会对司机案件中的索赔产生怎样的影响。\n虽然优步和Lyft司机多年来一直在努力让法院明确裁定他们是员工，而不是独立承包商，为了确保员工身份带来的工资、福利和工人保护，加州司法部长泽维尔·贝塞拉(Xavier Becera)以及旧金山、圣地亚哥和洛杉矶的城市检察官现在也加入了他们的斗争。\n贝塞拉和该市律师在5月份向州法院提起了自己的诉讼，指控优步和Lyft违反了该州最近颁布的议会法案5，该法案提高了企业将工人归类为独立承包商的法律门槛。\nA.B.5编纂了加州最高法院2018年4月Dynamex裁决建立的法律框架，该裁决采用了更严格的三管齐下的工人分类测试，即ABC测试。\nABC测试假设所有工人都是雇员，除非一家企业能够证明工人不受监督，从事的工作不在正常营业过程或地点之外，并且在独立建立的行业、职业或企业中工作，性质与他们为雇用他们的实体所做的工作相同。\n加州总检察长表示，优步和Lyft的错误分类剥夺了工人的关键保护，并导致每年数千万人的避税。\n周四，该州和城市提交了针对优步和Lyft的初步禁令请求，试图立即迫使这两家公司将司机归类为员工。该案的听证会定于8月6日举行。\nLiss-Riordan告诉陈法官，该州的案件不是司机案件被搁置的理由。Liss-Riordan指出，该州的案件只给加州带来了不公平竞争法和禁制令救济索赔，而司机案件则追求直接损害赔偿。\nLiss-Riordan告诉法官，该州的主要兴趣很可能是寻求未来的补救措施，并让优步将司机重新归类为员工。可以想象，这就是国家的利益所在，谁知道，他们可能会达成一项决议，获得救济，但随后让私人当事人继续就其他补救措施(包括损害赔偿)提起诉讼。\n优步的律师听从法官的意见，决定在州政府继续索赔期间，司机案件是否应该被搁置。\n陈法官表示，他将允许司机案件与州政府的案件并行进行。\n我认为主要的一点是，无论那里发生什么，都不太可能完全解决这里的所有问题，陈法官说。\nLiss-Riordan告诉Law360，虽然法院到目前为止一直不愿立即给予司机禁令救济，但也许法院会采取不同的行动来回应州政府提起的诉讼。\n优步的代表是Gibson Dunn；Crutcher LLP的Theane Evangelis、Blaine Evanson和Heather Richardson。", "note_en": "Law360, San Francisco (June 25, 2020, 10:12 PM EDT) -- Uber drivers&#39; claims that the ride-hailing giant deprived them of benefits by misclassifying them as independent contractors are likely to survive dismissal efforts, a California federal judge said Thursday, the same day California&#39;s attorney general sought a preliminary injunction to force both Uber and Lyft to reclassify drivers as employees.\n U.S. District Judge Edward M. Chen said during a video hearing Thursday that while Uber drivers Christopher James and Spencer Verhines still needed to present &#34;greater specificity&#34; on their claim of entitlement to sick leave, he also said that &#34;some things will likely survive dismissal.&#34;\n Uber, which filed a partial motion to dismiss in May, sought to shave claims from the consolidated action just days after the plaintiffs asked Judge Chen to certify a class that could include thousands of drivers in the Golden State who have opted out of arbitration. Uber asked the judge to nix the drivers&#39; claims for declaratory judgment of misclassification and entitlement to paid sick leave, saying there&#39;s no private cause of action under the California Labor Code sections they relied on.\n But the drivers pushed back against Uber&#39;s assertion that their complaint needs more specific allegations to survive.\n Judge Chen expressed skepticism at Uber&#39;s arguments Thursday and indicated that the drivers&#39; claims are likely to survive the ride-hailing giant&#39;s dismissal efforts. The judge said he would take another look at the case law on declaratory relief before putting out an order.\n &#34;It appears that Judge Chen is rejecting Uber&#39;s continued attempt to whittle down our claims,&#34; counsel for the drivers, Shannon Liss-Riordan of Lichten &amp; Liss-Riordan PC, told Law360 following the hearing. &#34;We will provide more specificity if the court requires it on the sick leave claim, as it is clear that Uber has not provided state-mandated sick leave to its drivers.&#34;\n Judge Chen also queried counsel Thursday on how the parallel litigation brought by the California attorney general against Lyft and Uber might impact the claims in the drivers&#39; case.\n While Uber and Lyft drivers have for years been fighting to get a court to definitively rule that they are employees instead of independent contractors, in order to secure the pay, benefits and worker protections that come with employee status, California Attorney General Xavier Becerra and city attorneys in San Francisco, San Diego and Los Angeles have now also joined their fight.\n Becerra and the city attorneys brought their own suit in state court in May, alleging that Uber and Lyft violated the state&#39;s recently enacted Assembly Bill 5, which heightened the legal bar for businesses to classify workers as independent contractors.\n A.B. 5 codified the legal framework established by the California Supreme Court&#39;s April 2018 Dynamex decision, which adopted a stricter three-prong worker classification test, known as the ABC test.\n The ABC test presumes that all workers are employees unless a business can show the worker is free from its supervision, performs work that is outside the usual course or place of business, and works &#34;in an independently established trade, occupation or business of the same nature&#34; as the work they do for the entity that is hiring them.\n The California attorney general says misclassification by Uber and Lyft &#34;robs workers of critical protections and results in tens of millions in tax avoidance each year.&#34;\n On Thursday, the state and cities filed their request for a preliminary injunction against Uber and Lyft, seeking to immediately force the companies to classify their drivers as employees. A hearing in that case has been set for Aug. 6.\n Liss-Riordan told Judge Chen that the state&#39;s case is no reason for the drivers&#39; case to be put on hold. Liss-Riordan noted that the state&#39;s case only brings California Unfair Competition Law and injunctive relief claims, while the drivers&#39; case pursues direct damages claims.\n &#34;It&#39;s very possible that the state&#39;s main interest may be in pursuing the going-forward remedy and getting Uber to reclassify its drivers as employees,&#34; Liss-Riordan told the judge. &#34;It&#39;s conceivable that that is what the state&#39;s interest is in and that, who knows, they might reach a resolution in which they obtain that relief, but then leave it to private parties to continue litigation regarding other remedies, including damages.&#34;\n Uber&#39;s counsel deferred to the judge on whether the drivers&#39; case should be put on hold while the state pursues its claims.\n Judge Chen indicated that he would allow the drivers&#39; case to proceed in parallel with the state&#39;s case.\n &#34;I think that the main point is that whatever happens there is not likely to completely resolve all the issues here,&#34; Judge Chen said.\n Liss-Riordan told Law360 that while the courts have been reluctant to grant immediate injunctive relief to the drivers thus far, perhaps the courts will act differently in response to the lawsuit filed by the state.\n   Uber is represented by Theane Evangelis, Blaine Evanson and Heather Richardson of Gibson Dunn &amp; Crutcher LLP.", "posttime": "2020-06-26 14:17:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,misclassification,司机", "title": "法官称，优步错误分类索赔可能幸免于难", "title_en": "Uber Misclassification Claims Likely to Survive, Judge Says", "transed": 1, "url": "https://www.reddit.com/r/investing/comments/hfzgcd/law360_us_district_judge_edward_m_chen_indicated/", "via": "", "real_tags": ["可能", "司机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008363, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "取一个食谱网站的URL，去掉这个难题。", "note_en": "Take a recipe website URL and remove the cruft.", "posttime": "2020-06-26 13:38:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网站,recipe", "title": "将食谱网站转换为纯文本", "title_en": "Turn recipe websites into plain text", "transed": 1, "url": "https://plainoldrecipe.com/", "via": "", "real_tags": ["网站", "recipe"]}, {"category": "", "categoryclass": "", "imagename": "f1faed59e2d2331c09c2274692fdc55a.png", "infoid": 1008362, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据“信息报”报道，亚马逊预计最早将于今天宣布一项交易，以超过10亿美元的价格收购自动驾驶汽车技术提供商Zoox。\n重要原因：虽然苹果、谷歌和其他公司都在自动驾驶技术上进行了投资，但亚马逊的核心业务可能受益最大，因为该公司在向消费者送货方面花费了大量资金。\nZoox首席执行官Aicha Evans今年早些时候告诉Axios，该公司正在与战略合作伙伴和企业投资者就筹集更多资金进行谈判。华尔街日报上月报导称，Zoox和亚马逊正在进行深入谈判。\n言外之意：到目前为止，Zoox一直是最雄心勃勃的自动驾驶技术公司，因为它一直致力于开发一款完全集成的汽车，而不仅仅是核心的自动驾驶技术。\nZoox从一开始就计划开发这项技术，制造一辆汽车，并运营一项机器人出租车服务。即使是Waymo也没有试图咬那么多(尽管克鲁斯是)。\n开发一辆汽车耗资数十亿美元，因此亚马逊如果打算让Zoox继续走这条路，就必须投入更多资金。\n目前尚不清楚亚马逊到底想要用Zoox的技术做什么--要么将部分技术应用于仓储机器人、送货车辆和其他需求，要么让整个项目继续下去。\nZoox已经筹集了大约10亿美元的资金-曾经估值为32亿美元", "note_en": "Amazon is expected to announce a deal as early as today to purchase self-driving vehicle technology provider Zoox for upwards of $1 billion, according to a report in  The Information.\n Why it matters: While Apple, Google and others have invested in self-driving technology, Amazon is the one whose core business could benefit the most, given how much the company spends to deliver goods to consumers.\n Zoox CEO Aicha Evans told Axios earlier this year that the company  was in talks with strategic partners and corporate investors about raising more money. The Wall Street Journal reported last month that Zoox and Amazon  were in advanced talks.\n Between the lines: Zoox has been by far the most ambitious self-driving tech company as it&#39;s been working on developing a fully integrated vehicle, not just the core autonomous technology.\n Zoox planned from the beginning to develop the technology, build a car and operate a robotaxi service. Not even Waymo is trying to bite off that much (although Cruise is).\n Developing a car costs billions of dollars, so Amazon will have to invest a lot more if it intends for Zoox to stay on that path.\n It&#39;s unclear what exactly Amazon wants to do with Zoox&#39;s technology — use parts of its technology to apply to warehouse robots, delivery vehicles and other needs, or keep its whole project going.\n Zoox has already raised about $1 billion in funding — and once was valued at $3.2 billion", "posttime": "2020-06-26 13:38:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,自动,tech,zoox", "title": "亚马逊将斥资10亿美元以上收购自动驾驶科技公司Zoox", "title_en": "Amazon to pay $1B+ for self-driving tech firm Zoox", "transed": 1, "url": "https://www.axios.com/report-amazon-to-pay-1-billion-for-self-driving-tech-firm-zoox-719d293b-3799-4315-a573-a226a58bb004.html", "via": "", "real_tags": ["amazon", "亚马逊", "自动", "tech", "zoox"]}, {"category": "", "categoryclass": "", "imagename": "f00fe4862a902d01bdaf8ae0fb654b06.jpeg", "infoid": 1008361, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国联邦储备委员会(Federal Reserve)周四对美国银行业实施了新的限制，此前其年度压力测试发现，在与冠状病毒大流行相关的情况下，几家银行可能会令人不安地接近最低资本水平。\n美联储在一份新闻稿中表示，大型银行将被要求暂停股票回购，并将今年第三季度的股息支付限制在当前水平。监管机构还表示，它只允许根据与银行近期收益挂钩的公式支付股息。\n此外，该行业将受到持续的审查：在长达10年的压力测试历史上，银行将首次不得不在今年晚些时候再次提交支付计划。\n在更严峻的情况下，随着失业率达到19.5%，银行可能会累积高达7000亿美元的贷款损失，这一事态发展将推动一些银行接近监管机构对资本的最低要求。\n美国联邦储备委员会(Federal Reserve)周四对美国银行业实施了新的限制，此前其年度压力测试发现，在与冠状病毒大流行相关的情况下，几家银行可能会令人不安地接近最低资本水平。\n美联储在一份新闻稿中表示，大型银行将被要求暂停股票回购，并将今年第三季度的股息支付限制在当前水平。监管机构还表示，它只允许根据与银行近期盈利挂钩的公式支付股息。\n此外，该行业将受到持续的审查：在长达10年的压力测试历史上，银行将不得不在今年晚些时候再次提交支付计划，对支付的限制可能会继续有效。监管机构表示，他们可能不得不每个季度重复这个周期。\n纽约常规交易收盘后，银行股暴跌。当天攀升的富国银行(Wells Fargo)股价回吐了部分涨幅，下跌了3.3%。高盛(Goldman Sachs)下跌3.9%，摩根大通(JPMorgan Chase)下跌1.9%。\n美联储副主席兰德尔·夸尔斯(Randall Quarles)在一份声明中表示：尽管我预计银行将继续谨慎地管理其资本行动和流动性风险，并支持实体经济，但经济复苏的轨迹存在重大不确定性。因此，董事会正在采取行动，更深入地评估银行的状况，并要求最大的银行在接下来的几个月里采取谨慎的措施来保存资本。\n此举表明，冠状病毒大流行的史无前例的性质，以及预测银行未来的困难，让美联储变得谨慎起来。监管机构和该行业都热衷于避免前一次危机的错误，当时公司支付了数十亿美元，但后来不得不筹集资金。美国最大的几家银行已经在3月份表示，他们将自愿暂停股票回购，股票回购约占该行业资本支出的70%。\n剩下的是股息，银行分析师大多认为股息将保持在目前的水平-除了富国银行(Wells Fargo)，该行在虚假账户丑闻后正努力恢复利润。尽管如此，期权市场交易员押注银行将被迫削减股息，即使是在规模最大、利润最高的大型银行摩根大通(JPMorgan)也是如此。\n轩尼诗基金(Hennessy Funds)投资组合经理大卫·埃里森(David Ellison)在接受CNBC采访时表示，这些公司实际上已经国有化。听起来回购在很长一段时间内是不会回来的，股息将取决于美联储认为的经济状况。\n预计这些银行将在6月29日(星期一)披露它们的资本计划，以及它们是否真的维持目前的股息支付。\n尽管如此，该行业似乎躲过了一劫：美联储理事莱尔·布雷纳德(Lael Brainard)在另一份声明中表示，她支持全面暂停该行业的所有派息。她表示，这样做将创造一个公平的竞争环境，使所有银行都能够保留资本，而不会受到与同行相比的竞争劣势。\n除了美联储的典型测试(考察银行在严重经济低迷期间的表现)之外，监管机构还考察了与当前大流行相关的三种情景：V型衰退和复苏、较慢的U型前景，以及包括双底衰退在内的W型情景。\n由于大流行带来的实际经济影响已经超过了之前考试中典型的严重经济低迷，因此这三种情况才是银行分析师和投资者最感兴趣的。\n虽然美联储谨慎地表示，这些情景并不是对实际情况的预测，但它们确实与银行高管所说的可能是经济进程密切相关：失业率将高达19.5%的峰值。\n这可能会给参加考试的34家银行造成高达7,000亿美元的贷款损失，该行业的总资本充足率可能会从2019年底的12%降至最低7.7%。资本是银行资产和负债之间的差额，它起到了吸收损失的缓冲作用。\n美联储表示，虽然该行业的大部分资本仍将保持充裕，但在更为严酷的U型和W型情景中，有几家银行将接近最低资本水平。然而，监管机构没有透露哪些银行会接近它们的最低水平。\n布雷纳德说，股息支付的公式涉及到前四个季度的平均净收入。这可能会使富国银行面临削减股息的最大风险，因为它在第一季度的利润下降了近90%，因为它为贷款损失拨备了资金。\n她的声明相当于对美联储行动罕见的异议。她在声明中表示，即使有上限，允许银行继续发放支出也与压力测试的目的不一致。压力测试的目的是通过保持弹性来前瞻性，而不是通过根据过去几个季度的净利润授权发放支出来进行回溯。在这份声明中，她表示，允许银行继续发放支出，即使它们是有上限的，也与压力测试的目的不一致。压力测试的目的是通过保持弹性来前瞻性，而不是通过根据过去几个季度的净利润授权支付。\n布雷纳德表示，在新冠肺炎的情景下，多达四分之一的银行可能会被推至接近其最低资本水平的水平。布雷纳德是美联储董事会唯一一名奥巴马政府的留任人员。\n她表示：过去的经验表明，在接近监管下限的情况下运营的银行满足信誉良好借款人的需求的可能性要小得多，由此导致的信贷状况收紧可能会损害复苏。尽管在看似合理的情况下，银行极有可能需要更大的资本缓冲来吸收损失，但授权允许进行将耗尽资本缓冲的分配。", "note_en": "The Federal Reserve put new restrictions on the U.S. banking industry Thursday after its annual stress test found that several banks could get uncomfortably close to minimum capital levels in scenarios tied to the coronavirus pandemic.\n The Fed said in a release that big banks will be required to suspend share buybacks and cap dividend payments at their current level for the third quarter of this year.  The regulator also said that it would only allow dividends to be paid based on a formula tied to a bank&#39;s recent earnings.\n Furthermore, the industry will be subject to ongoing scrutiny: For the first time in the decade-long history of the stress test, banks will have to resubmit their payout plans again later this year.\n Under the harsher scenarios, banks could rack up as much as $700 billion in loan losses as unemployment hits 19.5%, a development that would push some banks close to their regulatory minimums for capital.\n The  Federal Reserve put new restrictions on the U.S. banking industry Thursday after its annual stress test found that several banks could get uncomfortably close to minimum capital levels in scenarios tied to the  coronavirus pandemic.\n The Fed said in a  release that big banks will be required to suspend share buybacks and cap dividend payments at their current level for the third quarter of this year. The regulator also said that it would only allow dividends to be paid based on a formula tied to a bank&#39;s recent earnings.\n  Furthermore, the industry will be subject to ongoing scrutiny: For the first time in the decade-long history of the stress test, banks will have to resubmit their payout plans again later this year, and restrictions on payouts could remain in effect. They may have to repeat this cycle every quarter, the regulator said.\n Bank stocks slumped after the close of regular trading in New York. Shares of  Wells Fargo, which had climbed during the day, gave back some of those gains, falling 3.3%. Goldman Sachs slumped 3.9%.  JPMorgan Chase dropped 1.9%.\n &#34;While I expect banks will continue to manage their capital actions and liquidity risk prudently, and in support of the real economy, there is material uncertainty about the trajectory for the economic recovery,&#34; Fed Vice Chair Randall Quarles said in a statement. &#34;As a result, the Board is taking action to assess banks&#39; conditions more intensively and to require the largest banks to adopt prudent measures to preserve capital in the coming months.&#34;\n The move signals that the unprecedented nature of the coronavirus pandemic, and the difficulty in forecasting what the future holds for banks, is making the Fed cautious. Regulators and the industry are keen to avoid the mistakes of the previous crisis, where firms made billions of dollars in payouts only to have to raise capital later. The biggest U.S. banks already said in March that they would  voluntarily suspend share repurchases, which make up roughly 70% of capital payouts for the industry.\n What remained were the dividends, which bank analysts have mostly assumed would remain at their current levels – with the exception of  Wells Fargo, which is struggling to restore profits after its fake accounts scandal. Still, options market traders have bet that banks would be forced to  cut dividends, even at JPMorgan, the biggest and most profitable of the megabanks.\n  &#34;These companies are effectively nationalized,&#34; David Ellison, a portfolio manager at Hennessy Funds, said in a CNBC interview. &#34;It sounds like buybacks aren&#39;t going to come back from a long time, and the dividends are going to be subject to what the Fed believes the economy looks like.&#34;\n The banks are expected to disclose their capital plans, and whether they actually maintain their current dividend payouts, on Monday, June 29.\n Still, it appears that the industry dodged a bullet: Fed Governor  Lael Brainard said in a  separate statement that she supported a blanket suspension of all payouts for the industry. Doing so would &#34;create a level playing field and allow all banks to preserve capital without suffering a competitive disadvantage relative to their peers,&#34; she said.\n On top of the Fed&#39;s typical test, which examines how lenders fare during a severe economic downturn, the regulator looked at three scenarios tied to the current pandemic: A V-shaped recession and recovery, a slower U-shaped outlook, and a W-shaped scenario that would include a double-dip recession.\n Since the real economic fallout from the pandemic already exceeds the typical severe economic downturn from previous exams, it is these three scenarios that garner the most interest from bank analysts and investors.\n While the Fed was careful to say that the scenarios are not predictions of what will actually happen, they do hew closely to what bank executives have said could be the course of the economy: Unemployment would peak at up to 19.5%.\n That could cause up to $700 billion in loan losses for the 34 banks in the exam, and the industry&#39;s aggregate capital ratios could fall from 12% at the end of 2019 to as low as 7.7%. Capital, which is the difference between a bank&#39;s assets and liabilities, acts as a cushion to absorb losses.\n While most of the industry would remain well capitalized, in the harsher U- and W-shaped scenarios, several banks &#34;would approach minimum capital levels,&#34; the Fed said. The regulator didn&#39;t disclose which banks would skate close to their minimums, however.\n The formula for dividend payouts involves averaging net income from the previous four quarters, Brainard said. That probably puts Wells Fargo at greatest risk for a dividend cut, because its profits fell by  almost 90% in the first quarter as it set aside money for loan losses.\n In her statement, which amounted to a rare dissenting opinion of the Fed&#39;s actions, she said that allowing banks to continue making payouts, even if they are capped, is &#34;inconsistent with the purpose of the stress tests, which is to be forward-looking by preserving resilience, not backward looking by authorizing payouts based on net income from past quarters.&#34;\n Up to one-quarter of banks could be pushed close to their minimum capital levels under the Covid-19 scenarios, said Brainard, who is the Fed board&#39;s only holdover from the Obama administration.\n &#34;Past experience shows that banks operating close to their regulatory minimums are much less likely to meet the needs of creditworthy borrowers, and the resulting tightening of credit conditions could impair the recovery,&#34; she said. &#34;Despite the substantial likelihood that banks will need larger capital buffers to absorb losses under plausible scenarios, the authorization permits distributions that will deplete capital buffers.&#34;", "posttime": "2020-06-26 13:37:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "银行,restricts", "title": "美联储在发现银行在大流行中可能面临压力后限制银行股息", "title_en": "Fed restricts bank dividends after finding banks could be stressed in pandemic", "transed": 1, "url": "https://www.cnbc.com/2020/06/25/fed-puts-restrictions-on-bank-dividends-after-test-finds-some-banks-could-be-stressed-in-pandemic.html", "via": "", "real_tags": ["银行", "restricts"]}, {"category": "", "categoryclass": "", "imagename": "63f450dc118f8d1fa4220d91e046a234.jpg", "infoid": 1008360, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一连串的浪潮中，我逐渐意识到这场大流行将对国内劳动力产生巨大影响。第一次是相当早的，在旅行禁令、学校关闭和州政府关闭之前。我在全国家政工人联盟(NDWA)的一位同事(我是该联盟的主任)参加了我们与房屋清洁工的一次定期会议，在会上我们讨论了组织战略，并直接听取了我们成员的意见。工人们开始一个接一个地描述客户因冠状病毒而取消工作的情况，让清洁工们不知道这些客户是否或何时会恢复招聘。不久之后，另一位同事告诉我，她在一次与在零工经济中找到工作的家政工人的会议上听到了类似的报告。一名员工将她的手机举到电脑屏幕前，向Zoom上的每个人显示她的银行余额：1美分。\n当我们听取我们成员的意见时，我们的团队很快意识到，公共卫生危机已经造成了前所未有的就业和收入损失浪潮，对美国的劳动力，特别是最不稳定和最脆弱的工人产生了巨大的影响。对于美国的220万家政工人来说，按照定义，工作是在别人家里进行的。“在家工作”不是一种选择。\n这一劳动力由90%以上的女性组成，其中有色人种女性和移民占了不成比例的比例。这类工作的工资处于贫困水平：16.8%的家政工人生活在联邦贫困线以下-研究人员通常使用联邦贫困线来衡量一个家庭实际维持生计的门槛-44.3%的家政工人生活在联邦贫困线的两倍以下，而其他所有工人的这一比例为16.9%。家政工人已经在努力赚取可维持生计的工资-大多数人不是这样-随着这些没有安全感的劳动力的灾难性损失增加，我开始感受到NDWA成员只会继续承担的经济负担的重量。为了应对这一需要，我们启动了冠状病毒关怀基金，向受疫情影响的家政工人提供400美元的紧急现金援助。\n第二波变现发生在我们推出基金两周后。像全国数以百万计的父母一样，我在家教育一个孩子-在我们的情况下，是我的继女-我和丈夫正在考虑是否带他的母亲来和我们一起生活，以确保她的安全。我们讨论了这一变化所涉及的后勤工作，以及我们可能如何应对：我和丈夫都是全职工作，我们已经在家里自学三年级了，他的母亲将成为家里的第四个家庭成员，也就是第三代人。\n我知道我们并不孤单。在全国各地，数以百万计的家庭一直在为类似的问题而苦苦挣扎：当学校关闭，护理设施面临更高的风险并被疏散时，我们如何照顾我们的家人？我们将如何在同一屋檐下管理我们的家庭、家园和工作呢？突然之间，全国每个家庭的关注点都转移到了家里。在这场健康和经济危机并存的危机中，我们都在努力以新的和陌生的方式照顾我们的家人。\n就在那时，我突然意识到，大流行创造了我们NDWA几十年来一直试图创造的东西：大众对护理工作重要性的认识。作为一个国家，我们没有认识到照顾者-无论是家庭成员还是专业工作者-对我们的社会结构和我们的经济基础设施是多么重要。就是这样，直到现在。\n护理，我们用来泛指照顾儿童、老年人和残疾人所需的时间、精力和劳动，是一种普遍的需求：无论你是谁，你都需要，而且很可能在你一生中的某个时候需要或依赖护理-无论是孩子、新父母、生病还是老年。然而，美国的医疗基础设施充其量也是脆弱的，无法满足日益增长的需求。家庭难以负担医疗费用，而工资过低的护理劳动力没有安全网。随着我们人口结构的变化和家庭结构的演变，我们对护理经济的依赖只会增加，而且还会继续增加。\n在美国，每天大约有10,000人年满65岁。随着越来越多的人喜欢“就地养老”，而不是搬到养老院，我们依靠家庭护理人员和房屋清洁工来帮助年长的亲人(残疾家庭成员也是如此，他们独立生活在自己的家中)。与此同时，今天有两个有工作的父母的家庭越来越多，有全职护理员的家庭越来越少，使得人们只能依靠专业的护理员和房屋清洁工在家里做工作，而有工作的父母则外出谋生。对于“三明治一代”来说，那些目前既要照顾年迈的父母，又要照顾自己年轻家庭的人，无论是经济上还是情感上的护理费用，都可能是极其昂贵的。\n家务劳动和护理工作历来报酬偏低，被忽视，即使在今天，这种劳动往往被称为“帮助”，而不是被认为是专业劳动，这一事实暴露了妇女工作长期贬值的事实。这对绝大多数女性和不成比例的有色人种女性的工人产生了实质性的影响：家政工人的时薪中值为12.01美元，而所有其他工人的时薪中值为19.97美元。美国最早的家政工人中有被奴役的黑人妇女，因此，当工人的权利和保护在20世纪30年代通过成为法律时，家政工人被明确、故意地排除在外，作为对关注赋予黑人工人权利的南方立法者的让步。由于这一遗产，许多家政工人仍然没有共同的工作场所保护和权利，如加班、带薪病假、免受骚扰和歧视的保护，或获得福利的权利。\n甚至在新冠肺炎危机之前，家务需求的增加，加上糟糕的工作条件，给家庭和工人带来了巨大的压力。极高的员工流失率，以及照顾者被快餐或零售等其他低薪服务性工作的流失，意味着在需求不断增长的时候，国家无法维持这批劳动力。护理行业是一座濒临倒塌的纸牌屋。\n随着新冠肺炎的大流行，这种崩溃已经到来。家庭护理工作者面临着不可能的选择-要么继续工作，潜在地将自己暴露在冠状病毒之下，要么自我隔离，但失去了家人迫切需要的工资。莉迪亚是波士顿的一名家庭护理工作者，她的客户是老年人，如果接触冠状病毒，风险很高。莉迪亚对自己的责任非常认真：“我喜欢照顾老年人，因为他们需要我的帮助，”她说，“我像照顾自己的父母一样照顾他们；我成为他们家庭的一员。”然而，由于学校停课，莉迪亚上班时不得不把8岁、12岁和13岁的孩子留在家里，没有人照看。与此同时，像萨德这样的家庭照顾者，既照顾她22个月大的女儿，也照顾有潜在疾病的年迈的父母，在在家工作时努力为家人提供所需的护理。\n说到护理工作，美国的公共政策和文化规范并不支持劳动人民。我们投资医疗基础设施是为了让我们从疾病中恢复过来，投资交通基础设施是为了让人们能够上班，投资教育基础设施是为了让我们能够学习，但是我们从来没有投资于我们的医疗基础设施。因此，作为一个社会，我们预计会有一些费用将由妇女承担，她们承担了我们家庭护理需求的不成比例的重量，以及家庭护理人员和其他护理人员，她们的低工资使她们难以照顾自己的家庭。\n然而，这场流行病已经向我们证明，我们社会的力量和我们经济的弹性依赖于良好的护理。\n我与人共同创立的两个组织，全国家政工人联盟和跨世代关怀，多年来一直致力于建立一个更具弹性的护理经济。我们取得了进展；九个州和两个城市通过了家庭佣工权利法案，将共同的工作场所权利扩大到家庭佣工。夏威夷为在家中照顾亲人的家庭成员设立了家庭照顾者福利。华盛顿州创建了美国第一个长期护理社会保险计划。这些项目提供了很好的模式，但新冠肺炎明确表示，迫切需要为我们的护理经济制定一个更大胆的、全国性的愿景。\n随着我们规划复苏之路，全国人民重返工作岗位，美国人有机会通过投资于工薪家庭所需的基本基础设施来重建经济。护理必须是普遍负担得起和可获得的，我们需要护理工作成为好工作。我们需要一支由家庭护理工人、保姆和房屋清洁工组成的强大的劳动力队伍，他们赚取可维持生计的工资和带薪休假，这样他们就不必在照顾自己的健康和赚取收入之间做出选择。我们需要家庭照顾者，从新妈妈到成年子女，在他们需要的时候得到他们需要的支持，来照顾他们自己的家庭。通过将公共资金投资于普遍获得儿童保育、长期护理和带薪探亲假-这些都是我们工作时照顾家庭不可或缺的-美国可以让护理工作变得很好，让家庭支持的工作具有经济流动性。良好的护理是一个良性循环。\n我的婆婆还在家里，一个人住，在网上订购食品杂货。学校仍然关闭，现在我们在想，如果夏令营也关闭了，我们将如何度过这个夏天。我们已经想好了如何和邻居的朋友在户外进行一次物理距离的玩耍约会，这样我的继女就可以有一些", "note_en": "I came to realize in a series of waves the enormous impact this pandemic would have on the domestic workforce. The first was quite early on, before the travel ban, school closures, and state shutdowns. One of my colleagues at the National Domestic Workers Alliance (NDWA), of which I am the director, was in one of our regular meetings with house cleaners where we discuss organizational strategies and hear directly from our members. One by one, workers began describing clients’ cancelling jobs due to the coronavirus, leaving cleaners with no idea if, or when, those clients might resume their hiring. Shortly after, another colleague told me she’d heard similar reports in a meeting with domestic workers who find work in the gig economy. One worker held her phone up to her computer screen to show everyone on the Zoom call her bank balance: one cent.\n As we listened to our members, our team quickly realized that the public health crisis had caused an unprecedented wave of job and income loss, with enormous implications for America’s workforce, especially its most precarious and vulnerable workers. For the 2.2 million domestic workers in the United States, work—by definition—takes place in someone else’s home. “Working from home” is not an option.\n This labor force comprises over 90 percent women, and is disproportionately made up of women of color and immigrants. The wages for such work are poverty-level: 16.8 percent of domestic workers  live below the federal poverty line—the threshold commonly used by researchers to measure what it takes a family to actually make ends meet—and 44.3 percent of domestic workers live below double the federal poverty line, compared with 16.9 percent of all other workers. Domestic workers already struggle to make a livable wage—most do not—and as the catastrophic losses for this insecure workforce rose, I began to feel the weight of the financial burden that NDWA’s members would only continue to shoulder. In response to the need, we launched the  Coronavirus Care Fund, to provide $400 in emergency cash assistance to domestic workers affected by the pandemic.\n The second wave of realization came two weeks after we launched our fund. Like so many millions of parents across the country, I was homeschooling a child—in our case, my step-daughter—and my husband and I were considering whether to bring his mother to live with us, to ensure her safety. We discussed the logistics involved with this change and how we might manage: my husband and I both work full-time, we were already homeschooling a third-grader, and his mother would make for a fourth family member, and third generation, in the home.\n I knew we weren’t alone. All across the country, millions of families have been struggling with similar questions: How do we take care of our families when schools are closed and care facilities are facing a heightened risk and being evacuated? How would we manage our families, our homes, and our jobs all under one roof? Suddenly, the focus of every family in the nation had shifted to the home. Amid this combined health and economic crisis, we are all struggling to take care of our families in new and unfamiliar ways.\n That is when it dawned on me that the pandemic had created something that we at the NDWA have sought to create for decades: mass public awareness about the importance of care work. We had not, as a nation, recognized how essential caregivers are—whether family members or professional workers—to the very fabric of our society and the infrastructure of our economy. That is, until now.\n Care, which we use to broadly mean the time, energy, and labor required to care for children, older people, and people with disabilities, is a universal need: no matter who you are, you have needed and probably will need or rely on care at some point in your life—whether as a child, a new parent, in sickness, or in old age. And yet America’s care infrastructure is fragile at best, unable to meet the growing demands. Families struggle to afford care while the underpaid care workforce has no safety net. And as the demographics of our population shift and our family structures evolve, our reliance on the care economy has only increased, and will continue to do so.\n Every day, some 10,000 people turn sixty-five in the United States. As more people prefer to “age in place,” rather than move to a nursing home, we rely on homecare workers and house cleaners to help our older loved ones (ditto for family members with disabilities living independently in their own homes). At the same time, more families today have two working parents, and fewer families have a full-time caregiver, leaving people to rely on professional care workers and house cleaners to do the work in the home while the working parents go out to earn a living. For the “sandwich generation,” those currently managing the needs of both aging parents and their own young families, the cost of care, both financial and emotional, can be extremely onerous. Nearly 70 percent of working Americans earn less than  $50,000 per year, while the average cost of childcare is more than  $9,000 per year, and the average cost of home care is  $50,000 per year. It’s not surprising, then, that people caring for their own family members spend on average nearly thirty-six hours caregiving each week, according to a survey released late last year by Caring Across Generations and the Women’s Alzheimer’s Movement. More than half of those surveyed were expending this effort on top of holding down a full-time job.\n Domestic work and care work have historically been underpaid and overlooked, and the fact that even today this labor is often referred to as “help” rather than conceived as professional labor betrays the long devaluation of women’s work. This has material consequences for the workers who remain overwhelmingly women and disproportionately women of color: the median hourly wage for domestic workers is $12.01, compared with $19.97 for all other workers. Among the first domestic workers in the US were enslaved black women, and as a result, when workers’ rights and protections passed into law in the 1930s, domestic workers were specifically, purposefully excluded as a concession to Southern legislators who were concerned about giving rights to black workers. Because of this legacy, many domestic workers still do not have common workplace protections and rights, such as the right to overtime, paid sick days, protection from harassment and discrimination, or access to benefits.\n Even before the Covid-19 crisis, the combination of this increased need for domestic work and these dismal working conditions placed enormous stress on families and workers. Dramatically high rates of staff turnover, and the loss of caregivers to other low-wage service jobs such as fast food or retail, meant that at a time of growing need, the nation could not sustain this workforce. The care industry was a house of cards on the point of collapse.\n With the Covid-19 pandemic, that collapse has come. Homecare workers are faced with impossible choices—between continuing to work, potentially exposing themselves to the coronavirus, and self-isolating but losing the paycheck their families desperately need. Lydia is a homecare worker in Boston and her client is elderly, at high risk if exposed to coronavirus. Lydia takes her responsibility very seriously: “I like taking care of elderly people because they need my help,” she said, “and I take care of them like they are my own parents; I become part of their family.” And yet, with schools closed, Lydia has to leave her children—ages eight, twelve, and thirteen—at home, unsupervised, when she goes to work. Meanwhile, family caregivers like Sade, who cares both for her twenty-two-month-old daughter and her aging parents who have underlying conditions, are struggling to provide the care their families need while working from home.\n When it comes to care work, America’s public policies and cultural norms do not support working people. We invest in health-care infrastructure so we can recover from being sick, transportation infrastructure so people can get to work, education infrastructure so we can learn, but we have never invested in our care infrastructure. As a result, there are costs that, as a society, we expect will be absorbed by women, who disproportionately bear the weight of our family care needs, and by domestic and other care workers, whose low wages make it difficult for them to care for their own families.\n And yet, this pandemic has proven to us, the strength of our society and the resilience of our economy rely upon good care.\n Two organizations that I co-founded, the National Domestic Workers Alliance and Caring Across Generations, have been working to build a more resilient care economy for many years. We have made progress; nine states and two cities have passed Domestic Worker Bills of Rights to extend common workplace rights to domestic workers. Hawai’i has created a family caregiver benefit for family members caring for loved ones at home. Washington state has created the nation’s first long-term care social insurance program. These programs offer good models, but Covid-19 has made clear that a much bolder, national vision for our care economy is urgently needed.\n As we chart the road to recovery and people across the country return to work, Americans have an opportunity to rebuild the economy by investing in the fundamental infrastructure working families need. Care must be universally affordable and accessible, and we need care jobs to be good jobs. We need a strong workforce of homecare workers, nannies, and house cleaners who earn livable wages and paid time-off so they don’t have to choose between taking care of their health and earning an income. And we need family caregivers, from new mothers to adult children, to have the support they need, when they need it, to care for their own families. By investing public dollars in universal access to child care, long-term care, and paid family leave—integral to caring for our families as we work—the US can make care jobs good, family-supporting jobs with economic mobility. Good care is a virtuous cycle.\n My mother-in-law is still at home, living on her own, ordering groceries online. Schools are still closed, and now we’re wondering how we will manage through the summer with camps closed too. We’ve figured out how to do a physical distance playdate outside with a friend in the neighborhood, so that my step-daughter can have some interaction with other children. Every day, I wonder how we will look back on this time and make sense of it. To match our country’s newfound recognition of care workers as essential, we must take care of them, too—by protecting and compensating them accordingly. My hope is that we find ourselves looking back from a very different world, and reflecting on this time of crisis as the time that taught us how to truly care for one another.", "posttime": "2020-06-26 13:17:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现在,cares,家庭", "title": "谁在乎呢？现在，我们所有人都必须", "title_en": "Who Cares? Now, All of Us Must", "transed": 1, "url": "https://www.nybooks.com/daily/2020/05/27/who-cares-now-all-of-us-must/", "via": "", "real_tags": ["现在", "cares", "家庭"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "5月20日，由“业余电台圆桌会议”网络节目主持人汤姆·梅德林、W5KUB和团队发射的气球已经开始第三次绕地球飞行。气球位于43000-45000英尺的高空，于6月19日完成了第二次环球飞行。据气球网站本周报道，它以每小时170英里的速度“创纪录地”飞越了大西洋。\n这个被确认为W5KUB-18的气球携带着APR和WSPR业余无线电有效载荷。截至6月23日下午，它正以每小时100英里以上的速度在乌兹别克斯坦上空飞行。\n正如气球网站所说，任务和目标是发射一个高空气球，用于长时间和多次环游世界。这个气球是SBS-13，能够飞行到45000英尺的高空。该网站解释说：“它将充满氢气以获得更高的海拔。”“它将只由太阳能供电(没有电池，所以它只在白天传输)。”我们将每10分钟通过高频(14.0971兆赫)无线SPR接收跟踪。“。由于相关规定，英国、也门和朝鲜的跟踪传输将被关闭。自制的跟踪发射机只运行10兆瓦，但是，梅德林告诉ARRL，它在9000英里外都能听到。\n“带有GPS和处理器的整个跟踪器只有2克，”梅德林说。“那大约是一便士的重量。整个有效载荷总共只有15克。“。目前的努力是该组织第9次环游全球的尝试。\n梅德林说，气球项目开阔了他的视野。他告诉ARRL：“你必须做很多具体的工程和测量，才能飞到0.1克以下。”梅德林说：“你还会成为一名天气预报员，观看NOAA的所有网站、不同海拔的风、暴风雨等。暴风雨会把你打倒。”由于漂浮高度设定在44000英尺，他预计能够在大多数风暴之上飞行。他补充说：“当它飞起来的时候，你也变得非常精通地理。”\n麦德林的现场直播“业余电台圆桌会议”(宣传)在东部时间周二晚上9点开始直播，并接受观众的电话。这场演出在高频上以5130千赫的频率同步转播。他在代顿哈姆科文®运营直播凸轮已有数年之久。\n“这是一次很棒的经历，世界各地的火腿都玩得很开心，”梅德林证实说。“我甚至给他们颁发了一张证书，以表彰他们是体验的一部分。许多年轻人都在观看并参与其中，教授STEM的老师也在与我联系，以获得信息和帮助。我们玩得很开心。“。\n背", "note_en": "A   balloon launched on May 20 by “Amateur Radio Roundtable” web show host Tom Medlin, W5KUB, and team has begun its third circumnavigation of Earth. The balloon, at 43,000 – 45,000 feet, completed its second trip around the globe on June 19. It crossed the Atlantic ocean “in record time” at a speed of about 170 MPH, the balloon website reported this week.\n The balloon, identified as W5KUB-18, carries APRS and WSPR amateur radio payloads. As of the afternoon of June 23, it was heading over Uzbekistan at more than 100 MPH.\n As the balloon website states, the mission and goal are to launch a high-altitude balloon for long-duration and multiple trips around the world. The balloon, an SBS-13, is capable of flying up to 45,000 feet. “It will be filled with hydrogen to obtain higher altitude,” the website explains. “It will be solar powered only (no batteries, so it will only transmit during daylight). We will receive tracking every 10 minutes via WSPR on HF [14.0971 MHz].” Tracking transmissions will be turned off over the UK, Yemen, and North Korea due to regulations. The homebrew tracking transmitter runs just 10 mW but, Medlin told ARRL, it’s being heard as far away as 9,000 miles.\n “The entire tracker with GPS and processor is only 2 grams,” Medlin said. “That’s about the weight of a penny. The entire payload is only 15 grams total.” The current effort is the group’s 9th attempt to circumnavigate the globe.\n Medlin says the balloon project has broadened his horizons. “You have to do a lot of specific engineering and measurements down to the 0.1 gram to fly one,” he told ARRL. “You also become a weatherman, watching all the NOAA websites, winds at different altitudes, storms, etc. Storms will bring you down,” Medlin said. With the float altitude set at 44,000 feet, he expects to be able to fly above most storms. “You also become very well-versed in geography as it flies,” he added.\n Medlin’s livestreamed “  Amateur Radio Roundtable” (  promotional) goes live on Tuesdays at 9 PM Eastern Time and accepts calls from viewers. The show is simulcast on HF at 5,130 kHz. He has operated a live cam at Dayton Hamvention® for several years.\n “It’s been a great experience, and hams around the world are having a great time,” Medlin attested. “I even issue them a certificate for being part of the experience. Many young people are watching and getting involved, and teachers who teach STEM are contacting me to get information and help. We are having fun.”\n            Back", "posttime": "2020-06-26 13:16:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,launched,气球", "title": "受欢迎的网络节目主持人发射气球完成第二次往返旅行", "title_en": "Balloon Launched by Popular Web Show Host Completes Second Round Trip", "transed": 1, "url": "http://www.arrl.org/news/balloon-launched-by-popular-web-show-host-completes-second-round-trip#:~:text=A%20balloon%20launched%20on%20May,the%20globe%20on%20June%2019.", "via": "", "real_tags": ["网络", "launched", "气球"]}]