[{"category": "", "categoryclass": "", "imagename": "d58ab5bdba74b730d5af49f017666e4a.jpg", "infoid": 1028483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "各位，亚马逊黄金日又到了。和每年一样，这次促销活动给数千种产品带来了折扣-公司自己的设备降价幅度最大。今年，我们全面降价，从亚马逊音乐(Amazon Music)和Audible到Kindle、Fire和Echo设备，不一而足。\n因此，如果您想设置您的智能家居，购买新的电子阅读器、平板电脑、流媒体设备、DVR替代产品，甚至是一套安全摄像头，为了您的方便，我们将Prime Day最优惠的亚马逊设备集中在一个地方。提醒一下，以下Prime Day优惠仅对Prime订户可用，活动本身将持续到太平洋时间10月14日凌晨12点。\n对于初出茅庐或老书呆子来说，Kindle PaperWhite是你能买到的最好的电子阅读器。这种防水装置有一个经典的黑色外壳，也有几个好玩的、五颜六色的替代品，供不幸不防水的孩子们选择。尤其是前者跌到了80美元，这是我们追踪到的最低价格。\n同样防水的Kindle OASIS也是亚马逊销售的最高端的电子阅读器，我们还看到了一笔罕见的交易。对于大多数读者来说，它并不比PaperWhite更好，但如果你想要实体的翻页按钮和更大的7英寸显示屏，它的价格已经降到了175美元的联合低点。\nFire HD 10和Fire HD 8可以为Android平板电脑带来更全面的体验--尽管亚马逊自己的软件有所改变，设计也不如苹果的iPad那么高端--而这两款平板电脑的儿童版(Kids Edition)可能对年轻人很有用。再一次，这里的所有交易要么是我们看到的最好的价格，要么是与我们看到的最好的价格相匹配。\n所以，不管你是为谁买的，你都可以在这些交易中省下一大笔钱：\n如果你已经剪断了电线，只需要几个可以在空中调谐的本地频道，亚马逊的Fire TV重铸就可以做到这一点，并在混合存储中增加500 GB或1TB的DVR存储空间，能够同时录制两个节目。不过，重铸不会流媒体，您可以调谐的频道将取决于您所在的位置。\n另一方面，Fire TV Cube可以满足您的所有流媒体需求，同时添加用于语音命令和查询的Alexa，以及支持控制音棒或机顶有线电视盒等IR设备。\n不过，在购买之前，请确保你需要这些功能；否则，Fire TV Stick 4K将以更低的成本满足大部分相同的流媒体需求。目前金价已跌至30美元，仅比去年黑色星期五以来的历史低点高出5美元。如果你不需要4K，还有最近发布的1080P Fire TV Stick或Fire TV Stick Lite，但这两款产品都没有在黄金日打折。\n亚马逊Fire TV Cube 4K HDR媒体流+Alexa扬声器，售价79.99美元(通常为120美元)。\n如果我们不提醒你亚马逊Echo设备等智能扬声器提出的一些更细微、广为人知的隐私问题，那我们就是玩忽职守了，比如不小心将录制的对话发送给联系人、以亚马逊声称不会的方式共享用户数据、记录和审查私人对话(并无限期保留它们)，以及一些黑客攻击、漏洞和其他危及隐私和安全的漏洞。尽管如此，与我们更好的判断相反，这并没有阻止我们ARS的一些人，包括我自己，以及数以百万计的其他人使用这些助手打开灯或添加到我们的杂货单上。\n任何需要登录的连接到互联网的设备或产品都容易受到黑客攻击、泄密和数据泄露，但始终监听的助手(您可以将其静音，尽管这有点违背目的)和家庭控制方面增加了一层更直接的安全问题。\n也就是说，如果你已经接受了这一切，下面的Echo交易是合理的。不过，请注意，亚马逊并没有出售刚刚推出的第四代Echo或Echo Dot，也没有打折推出可旋转显示屏的Echo Show 10。但从功能的角度来看，上一代Echo Dot和Echo Show支持与这些较新设备相同的Alexa功能。更专注于音频的Echo Studio创下150美元的新低，这是一个特别的亮点。\n亚马逊Echo Dot(第三代)+Ring Video门铃(2020款)售价69.99亿美元(通常为150美元)。\n亚马逊Echo Studio智能家居扬声器+两个飞利浦色调智能灯泡，售价149.99美元(通常为230美元)。\n再说一次，这里有一些问题需要牢记。从产品的角度来看，这些Ring and Blink安全摄像头可以让您通过手机或Echo设备看到、听到和说话。Ring Stick Up Cam可以插入、太阳能或电池供电，而这些闪烁的凸轮必须插入。两者都可以1080p分辨率流媒体和录制视频，后者需要Ring Protect Plan订阅才能存储和观看录制内容。\n现在的生活就是订阅，如果你是一个狂热的读者或音乐迷，下面的折扣可能会很诱人。尤其是Audible Premium Plus优惠，要知道亚马逊销售的有声读物订阅服务名为Audible Plus，每月收费8美元，不过这只涵盖较小的内容库，而且不包括永久购买有声读物的积分。\n当你购买40美元或更多的亚马逊礼品卡或重新充值40美元或更多的礼品卡余额时，可以获得10美元的促销积分。", "note_en": "Amazon Prime Day is upon us once again, folks. As it does every year, the sales event brings discounts to thousands of products—with the company’s own devices getting some of the biggest price cuts. This year, we have  markdowns across the board, ranging from services like Amazon Music and Audible to Kindle, Fire, and Echo devices.\n So, if you’re seeking to set up your smart home, buy a new e-reader, tablet, streaming device, DVR alternative, or even a set of security cameras, we&#39;ve gathered Prime Day&#39;s best Amazon device deals in one place for your convenience. As a reminder, the Prime Day offers below are only available to  Prime subscribers, and the event itself will last until 12am PT on October 14.\n   For the budding or long-time bookworm, the Kindle Paperwhite is the  best e-reader you can buy. The waterproof device is available in a classic black casing or a handful of playful, colorful alternatives for kids, who unfortunately aren&#39;t waterproof. The former in particular is down to $80, which is the lowest price we&#39;ve tracked.\n We&#39;re also seeing a rare deal on the also-waterproof Kindle Oasis, which is the  highest-end e-reader Amazon sells. It&#39;s not better for most readers than the Paperwhite, but if you want physical page-turn buttons and a larger 7-inch display, it&#39;s down to a joint-low of $175.\n The Fire HD 10 and Fire HD 8 can step things up to a  more complete Android tablet experience—albeit  with Amazon&#39;s own software twists and designs that aren&#39;t as premium as Apple&#39;s iPads—while the Kids Edition versions of those slates  can be useful for young ones. Once again, all of the deals here either are or match the best prices we&#39;ve seen.\n So, whomever you’re buying for, you’ll save a nice chunk of change on these deals:\n    If you’ve cut the cord and just need a few local channels that can be tuned over the air, Amazon’s Fire TV Recast does this and adds 500GB or 1TB of DVR storage to the mix, with the ability to record two shows at once. The Recast does not stream media, though, and the channels you can tune will depend on your location.\n On the other hand, the Fire TV Cube can take care of all your streaming needs while adding Alexa for voice commands and queries, as well as support for controlling IR devices like your soundbar or set-top cable box.\n Make sure you need those features before buying, though; otherwise, the  Fire TV Stick 4K covers  most of the same streaming needs at a lower cost. It&#39;s currently down to $30, which is only $5 more than the all-time low from Black Friday last year. If you don&#39;t need 4K, there&#39;s also the recently released  1080p Fire TV Stick or  Fire TV Stick Lite, but neither of those have been discounted for Prime Day.\n Amazon Fire TV Cube 4K HDR media streamer + Alexa speaker for  $79.99 (normally $120).\n   We’d be remiss to not remind you of some of the  finer widely known privacy concerns smart speakers like Amazon&#39;s Echo devices have raised, such as instances of accidentally   sending recorded conversations to contacts,   sharing user data in ways Amazon says it doesn’t,   recording and   reviewing private conversations (  and keeping them indefinitely), and a number of   hacks,   vulnerabilities, and   other bugs that have compromised privacy and security. Still, against our better judgment, this hasn’t stopped   some of us at Ars, myself included, and millions of others from using these assistants to flip on the lights or add to our grocery lists.\n Any Internet-connected device or product that requires a login can be susceptible to hacks, leaks, and data breaches, but the always-listening assistant—which you can mute, though that sort of defeats the purpose—and home-control aspects add a more immediate layer of security concern.\n That said, if you&#39;ve made peace with  all of that, the Echo deals below are sound. Note, however, that Amazon hasn&#39;t put its  just-launched 4th-gen Echo or Echo Dot on sale, nor has it discounted the display-swiveling Echo Show 10. But from a functionality standpoint, the last-gen Echo Dot and Echo Show support the same Alexa abilities as those newer devices. The more audio-focused Echo Studio at a new low of $150 is a particular highlight.\n Amazon Echo Dot (3rd gen) + Ring Video Doorbell (2020 model) for  $69.99 (normally $150).\n        Amazon Echo Studio smart home speaker + two Philips Hue smart bulbs for  $149.99 (normally $230).\n   Again, there are  problematic issues to  keep in mind here. From a product perspective, these Ring and Blink security cameras allow you to see, hear, and speak through them through your phone or Echo device. The Ring Stick Up Cam can be plugged in, solar-, or battery-powered, while these Blink cams must be plugged in. Both can stream and record video at 1080p resolution, the latter requiring a Ring Protect Plan subscription to store and view recordings.\n    Life is subscriptions now, and, if you’re an avid reader or music fan, the discounts below may be enticing. For the Audible Premium Plus deal in particular, know that Amazon sells an audiobook subscription called  Audible Plus for $8 a month, though that only covers a smaller content library and doesn&#39;t include credits to purchase audiobooks permanently.\n Get  $10 promo credit when you buy an Amazon gift card of $40 or more or reload a gift card balance with $40 or more.", "posttime": "2020-10-13 21:56:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,降价,设备", "title": "一大批亚马逊设备在黄金日打折，有些降价超过一半", "title_en": "A bunch of Amazon devices are on sale for Prime Day, some at more than half off", "transed": 1, "url": "https://arstechnica.com/staff/2020/10/best-amazon-device-deals-prime-day/", "via": "", "real_tags": ["亚马逊", "amazon", "降价", "设备"]}, {"category": "", "categoryclass": "", "imagename": "9ea879f2d0963d96241644e82d4ea1fe.png", "infoid": 1028482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自那以后，Astroscale已将其任务扩大到还包括延长地球静止卫星的寿命-这是使轨道运行环境更可持续的另一个关键因素，因为我们期待着轨道活动预计将出现指数爆炸。这家初创公司今年早些时候宣布，它正在收购一家名为Efficient Space Soulutions的公司的员工和知识产权，该公司正在开发一种可以发射的“太空无人机”，为现有的大型地球静止卫星基础设施提供在轨服务，处理加油和维修等任务。\nESS已经形成了以色列Astroscale的基础，这是一个新的全球Astroscale国际办事处，将专注于地球静止寿命的延长。今天的资金由Astart牵头，将用于帮助公司继续建立全球办事处，并将团队增加到140多人。\nAstroscale的报废轨道碎片清除技术将在今年下半年的某个时候完成第一次示范任务，搭载俄罗斯联盟号火箭发射。该系统使用两个航天器，它们发现并锁定要脱轨的目标碎片。", "note_en": "Astroscale has since expanded its mission to also include extending the life of geostationary satellites – another key ingredient in making the orbital operating environment more sustainable as we look towards a projected exponential explosion in orbital activity. The startup announced earlier this year that it was acquiring the staff and IP of a company called Effective Space Soulutions which was in the process of developing a ‘space drone’ that could launch to provide on-orbit servicing to large, existing geostationary satellite infrastructure, handling tasks like refuelling and repairs.\n ESS has formed the basis for Astroscale Israel, a new international office for the globe-spanning Astroscale that will be focused on geostationary life extension. Today’s funding was led by aSTART, and will be used to help the company continue to establish its global offices and increase the team to more than 140 people.\n  Astroscale’s end-of-life orbital debris removal technology is set to get its first demonstration mission sometime in the second half of this year, with a launch aboard a Russian Soyuz rocket. The system uses two spacecraft which find and latch on to target debris to be de-orbited.", "posttime": "2020-10-13 21:50:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "轨道,series", "title": "\nAstroscale通过E系列融资筹集5100万美元，以推动其轨道可持续发展的雄心", "title_en": "\n\t\t\t\tAstroscale raises $51 million in Series E funding to fuel its orbital sustainability ambitions\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/13/astroscale-raises-51-million-in-series-e-funding-to-fuel-its-orbital-sustainability-ambitions/", "via": "", "real_tags": ["轨道", "series"]}, {"category": "", "categoryclass": "", "imagename": "c2133abe3108546afaa2f70fb969fa14.jpeg", "infoid": 1028481, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人们很难不喜欢Surface笔记本电脑一见钟情。微软继承了笔记本电脑系列的基本风格，将其缩小，并创造了一个12.4英寸屏幕的可爱兄弟。最棒的是，它的起价只有549美元。你怎么会对此有意见呢？几乎不可能在1000美元以下的价格范围内找到一款真正优质的设备，但不知何故，微软成功地做到了这一点。", "note_en": "It’s hard not to love the  Surface Laptop Go at first sight. Microsoft took the basic style of its Laptop line, shrunk it down, and created an adorable sibling with a 12.4-inch screen. Best of all, it starts at just $549. How can you have a problem with that? It’s almost impossible to find a truly premium looking device in the sub-$1,000 price range, yet somehow Microsoft managed to pull it off.", "posttime": "2020-10-13 21:50:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,键盘,laptop,gb,笔记本电脑", "title": "Surface Laptop Go回顾：坚固的设计、快速、出色的键盘和触摸板，但屏幕分辨率非常低，8 GB RAM限制，最大存储空间为256 GB", "title_en": "Surface Laptop Go review: solid design, fast, excellent keyboard and trackpad, but very low screen resolution, 8GB RAM limit, and max 256GB storage", "transed": 1, "url": "https://www.engadget.com/microsoft-surface-laptop-go-review-130030486.html", "via": "", "real_tags": ["设计", "键盘", "laptop", "gb", "笔记本电脑"]}, {"category": "", "categoryclass": "", "imagename": "99028924a76f03983be1fbe242632ff8.png", "infoid": 1028480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "迪士尼刚刚宣布，它的下一部皮克斯电影“灵魂”将在迪士尼Plus独家上映，这使它成为有史以来最理想化的迪士尼内容。\n我指的不是真正的电影，它看起来很棒；相反，考虑一下迪士尼准备如何从Soul中赚钱：\n迪士尼将制作“灵魂”衍生的商品，其中大部分将通过其门店和主题公园销售，并保留100%的利润。\n迪士尼将在那些它完全拥有和运营的主题公园创造灵魂衍生的功能，并保留100%的利润。\n你就明白了。而且，在这一过程中的每一笔交易中，迪士尼都将对其客户建立一个更加全面的图景。迪士尼将一如既往地出售迪士尼-随着它更充分地整合整个价值链，它在这方面的表现正变得越来越好。\n这个网站的中心焦点一直是聚合器，特别是谷歌和Facebook。聚合器不做内容，因为他们不需要做。相反，通过向消费者提供消费者看重的功能，它们成为接触这些消费者的最有效方式，这意味着创建者将他们的内容带给聚合器。\n例如，假设出版商委托制作了一篇关于香蕉的内容。创建这些内容是要花钱的，出版商急于收回他们的成本。出版商可以对该内容收费，但随后出版商需要出售它，销售既困难又昂贵，增加了回报门槛。大多数出版商所做的是让香蕉内容与广告一起免费提供，然后尽最大努力增加内容的流量。例如，出版商可以努力确保香蕉内容在谷歌“香蕉”搜索结果中排名靠前，或者让读者更容易在社交网络上分享香蕉内容。这两种策略都有免费的好处，何乐而不为呢？而且，如果内容需要一点提振，谷歌和Facebook上的广告既便宜又容易衡量，从而有可能实现正投资回报，至少在广告支出上是这样。\n然而，对于我们的香蕉出版商来说，问题是每个出版商最终都有相同的战略，从而在流量和关键字上相互竞争。不久之后，委托内容的正回报就太高了，这意味着更少的优质香蕉和更多的不新鲜的香蕉面包。2个\n这就留下了我今年早些时候写的永无止境的利基市场，以及我刚刚略读的战略-直接面向客户：\n这就只剩下一个选择：绕过谷歌和Facebook，直接接触用户。这就提出了这样一个问题：“目的地网站”-那些直接吸引用户、独立于聚合器的网站-竞争的载体是什么？最明显的两个候选者是专注和质量：\n然而，值得注意的是，虽然质量相对来说是二元的，但专注的方式-也就是世界上利基市场的数量-实际上是无限的；换句话说，成功就是在你的利基市场提供卓越的质量-前者由后者定义。\n对于Stratechery的读者来说，这显然不是一个新概念--这就是这个网站的全部战略理念。不过，再说一次，这是一个人博客的事实并不意味着我的竞争状况与纽约时报或互联网上任何其他媒体实体的竞争情况有什么不同。换句话说，从“纽约时报”在网上取得成功的程度来看，该公司确实非常成功！这就意味着，该公司在专注和质量方面都处于有利地位，而且按照这个顺序。\n重要的是要注意，仅仅专注是不够的：想要在聚合器主导的世界中抓住利基市场的公司需要追求几乎在所有方面都与聚合器正交的战略。具体地说，他们需要专注于整合，这种方法的突出例子是迪士尼。\n当迪士尼在2019年首次推出迪士尼+时，我在《迪士尼与电视的未来》一书中写道：\n理解迪士尼+的最好方式是从名字开始：这项服务实际上不是关于电视的，至少不是直接的，而是关于迪士尼本身的。迪士尼+的月费只有6.99美元。这张由沃尔特·迪士尼亲自制作的著名图表一如既往地切合实际：\n…。这是思考迪士尼+的唯一合适的背景。虽然显然迪士尼+将与Netflix争夺消费者注意力，但两项服务的目标截然不同：对Netflix而言，流媒体是其全部业务，是营收和利润的唯一驱动力。与此同时，迪士尼显然计划让迪士尼+实现盈利-该公司预计，这项服务将在2024年实现盈利，其中包括向迪士尼工作室的转移支付-但更大的项目是迪士尼本身。\n通过控制其内容的分发并直接面向消费者，迪士尼可以加深其与客户本已强大的联系，从而使业务的各个部分受益：电影可以在迪士尼+上产生原创内容，这在主题公园产生新的吸引力，主题公园产生商品机会，从而产生新的电影，所有这些都像现实生活中的电影宇宙一样相互建立。事实上，迪士尼花了这么长时间才转向这种方式，这证明了传统的电视模式是多么有利可图：从长远来看，这比简单地将内容传播给出价最高的人更适合他们的业务。\n在COVID大流行期间，迪士尼+一直是迪士尼难得的亮点，因为公司的许多其他部门，从游轮到主题公园再到体育，都是建立在面对面互动的基础上的。然而，迪士尼+的存在不仅仅是运气好：很明显，世界多年来一直在朝着这个方向发展-冠状病毒危机的主要功能是加速已经在进行的趋势-这就是为什么迪士尼最终别无选择，只能进入流媒体领域。\n不过，即使在迪士尼推出迪士尼+之前，我们也有理由保持乐观：早在2015年，迪士尼前首席执行官鲍勃·伊格尔承认剪线影响了ESPN，导致迪士尼股价遭受重创后，我就认为迪士尼会没事的：\n这并不是说付费电视领域的一切都是美好的。如果说有什么不同的话，那就是关注ESPN的命运类似于新闻观察家只关心《纽约时报》是如何处理从印刷到先是互联网，再到现在的移动的过渡。事情并不是一帆风顺的，但该公司正在生存，并继续制作出令人难以置信的令人信服的新闻报道。然而，对于没有时报威望或资源的地区性报纸来说，情况要糟糕得多：各地的出版商都在停业，在过去的25年里，在职记者的数量几乎减少了一半。\n我怀疑电视领域也将迎来类似的洗牌：随着付费电视捆绑包的侵蚀，一大批有线电视频道将走向何方，它们的目标内容将被在线视频，特别是YouTube取代。与此同时，几家流媒体巨头…将展开激烈的竞争。为了消费者的关注和金钱。这种竞争将在很大程度上有利于内容创作者，他们最终会创造最终用户愿意为…付费的差异化。这样的结果应该给所有类型的内容创作者带来希望：有一种方法可以摆脱聚合论的商品化效应，那就是通过差异化。换句话说，事情变化越多，它们就越保持不变。\n“纽约时报”再次出现在一篇关于迪士尼的文章中并不是偶然的；从某种角度来看，他们经营的是同一类型的业务：差异化的内容既能为品牌带来更多收益，而不是特定的创作者，而且越来越多地直接从消费者那里赚钱。\n迪士尼2015年面临危机时，得益于其蓬勃发展的订阅业务，“纽约时报”已经走上了解决之前对平面广告的依赖的道路；不过，即使到了那时，阻碍“纽约时报”和它的未来的最后一件事也是它自己的文化和传统，特别是对第一版的痴迷。尼基·亚瑟(Nikki Usher)在2015年的“哥伦比亚新闻评论”(Columbia News Review)上写道：\n5月份泄露的《纽约时报》创新报告详细描述了《纽约时报》是如何陷入纸质报纸主导的文化之中的。在我自己为我在《纽约时报》写的《制造新闻》一书所做的研究中，以及在CJR和其他地方，我记录了这种印刷优先的关注点是多么根深蒂固。\n甚至在最近，当我访问纽约时报时，一名初级记者向我展示了她本周早些时候在第一版上的报道。她表示，她把它放在头版是多么“令人惊讶”，以及这将如何向报头编辑证明她的能力。她的办公桌上有一叠半打的文件，准备留给子孙后代。\n部分问题是，网站和其他数字资产基本上是自发运行的，与报头编辑认为哪些故事最重要的新闻判断不同步。相反，正如我的研究显示的那样，只有少数人负责网络上的内容和时间。一个单独的主页编辑坐在另一个编辑的旁边，关于在网络上何时何地放置哪些故事的讨论几乎完全由他们…决定。第一页会议上关于数字战略的唯一讨论一直是网络上的故事概要，但没有讨论这些故事的时机、分析、位置或重要性。\n这导致执行主编迪恩·巴奎(Dean Baquet)采取了激进的举措：Page One会议将不再讨论Page One。“纽约时报”(New York Times)写道：\n规模更大的会议将继续长达数年的演变，远离头版焦点，回应持续不断的新闻周期的需要。近年来，巴奎先生将讨论转向故事情节和趋势，突发新闻的资源，并以合理的方式为数字用户推出企业和长篇故事…。但对于新时代，巴奎走得更远，他宣布，这场大型会议--现在在一张巨大的木桌旁举行--将只是一个论坛，用来规划报道，并对数字展示的项目进行排序。其中一个重点将是移动设备的演示，现在超过一半的时报读者都是在移动设备上获取新闻的。\n仅仅改变商业模式是不够的：第一版的重要性和威望如此之大，以至于“纽约时报”不得不改变其工作方式，以确保它正确地重视自己的未来，而不是过去。\n昨天，迪士尼宣布对其媒体和娱乐业务进行战略性重组：\n鉴于该公司迄今为止在直接面向消费者的业务上取得的巨大成功，并为了进一步加快其DTC战略，华特迪士尼公司今天宣布对其媒体和娱乐业务进行战略性重组。在新的结构下，迪士尼世界级的创意引擎将专注于为公司的流媒体服务以及传统平台开发和制作原创内容，而分发和商业化活动将集中在一个单一的全球媒体和娱乐分发组织中。新的媒体和娱乐发行集团将负责内容的所有货币化-包括发行和广告销售-并将监督公司流媒体服务的运营。它还将对迪士尼的媒体和娱乐业务承担唯一的盈亏责任。\n从“换人换老板”的角度来看，这似乎是一个相对较小的改变；迪士尼上次重组时相对未受影响的传媒和娱乐部门，被分成了三个部门(制片厂、综合娱乐和体育)，这三个部门都是有意义的，而且坦率地说，已经存在了。\n然而，这就是为什么这段摘录的最后一句话如此重要：盈亏责任是控制的最终指标，这意味着媒体和娱乐公司现在对发行负责，它的明确授权是强调流媒体。从公告中可以看出：\n(迪士尼执行长Bob)Chapek称，“鉴于迪士尼+取得了令人难以置信的成功，以及我们加速直接面向消费者业务的计划，我们正在从战略上定位我们的公司，以更有效地支持我们的增长战略并增加股东价值.”管理有别于分销的内容创作将使我们能够更有效、更灵活地制作消费者最想要的内容，并以他们喜欢的消费方式提供。我们的创意团队将专注于他们最擅长的--制作世界级的、基于特许经营的内容--而我们新集中的全球分销团队将专注于在所有平台上以最优的方式提供这些内容并将其货币化，包括迪斯尼+、Hulu、ESPN+和未来之星国际流媒体服务。“。\n在这种观点下，迪士尼的流媒体服务是NYTimes.com，而该公司的传统渠道，如电视，特别是电影院，是Page One：当然，它们代表了一个正在迅速消逝的过去，但它是有声望的过去，很容易看到迪士尼的内容创作者更喜欢它们而不是流媒体，特别是在COVID之前，因为这些频道仍然是公司大部分收入和利润的来源。然而，Chapek没有让这场危机白白浪费，它从创作者手中夺走了在哪里展示公司内容的决定权，并承担了实现短期收入和利润最大化的责任。\n回报是长期的：请记住，迪士尼+是关于整个迪士尼的，不只是一条特定的业务线，但要在整个迪士尼这样的公司实现这种独特的专注，意味着要设计反映这种整合重点的激励和责任线。\n更广泛地说，迪士尼的整体方法展示了集成商应该如何与内容世界中的聚合器正交运营。\nFacebook将你订阅源中的所有内容缩小为类似大小的矩形：深度报道的调查报告的突出程度和视觉呈现方式与你同学孩子的照片相同；facebook所关心的就是让你保持参与度。另一方面，迪士尼创造的内容必须是迪士尼独一无二的，令人难忘，因为它是他们整个业务的关键。\n模块化的内容创建者，比如我们的香蕉出版商，会花钱创建内容，然后通过尽可能广泛地传播内容来收回成本。谷歌和Facebook是实现这一目标的最有效手段。然而，迪士尼越来越专注于从其差异化的内容中获得越来越多的利润，无论是在它创建的时候，还是在未来的几十年里都是如此。\n聚合器寻求为最大数量的消费者提供服务。集成商寻求最大限度地将消费者货币化。\n谷歌和Facebook之所以对内容创作者如此有吸引力，正是因为它们接触到了如此多的消费者；来自数十亿人的几分钱或几美元就是一大笔钱。与此同时，迪士尼正在限制其潜在市场的规模，但增加了在剩下的市场中每个用户可以赚到的钱，特别是在它将内容限制在自己的服务的情况下。\n谷歌不在乎内容从何而来，它只是想要内容(不出所料，这导致了一大批主要基于有机谷歌搜索结果的业务)。与此同时，迪士尼希望在不过度授权个人内容创作者并给予他们批发转移定价权的情况下，创造差异化的内容；这导致该公司既投资于迪士尼全资拥有的动画，也投资于特许经营，后者比赋予他们生命的演员更大、更有价值。\n当聚合器利用他们的横向服务来区分他们自己的整合尝试时，他们就陷入了战略困境(谷歌在十年前就在Android上犯了这个错误)。另一方面，当集成商服务于特定的受众而不是面向整体时，他们就会遇到麻烦。这就是“纽约时报”把重点放在头版上所犯的错误，只要迪士尼的工作室和媒体部门负责公司的戏剧和电视业务，他们就会受到激励，为那些已经存在的观众服务，而不是为迪士尼的整体战略目标服务。\n在上面的一段摘录中，我将Stratechery与“纽约时报”归为一类；互联网对商业模式的分类效应令人着迷的是，我可以对迪士尼做同样的事情：是的，将一个人的博客与世界上有史以来最大的娱乐公司相提并论或许是大胆的，但那只是因为聚合器的规模要大得多。\n想想看：我的业务的成败取决于差异化的内容、高利润率、每个客户的平均收入、控制内容创作，以及不被短期赚钱机会分心。所有这一切也适用于“纽约时报”：差异化的高利润率内容、高价格、可操作的创作，以及至少目前品牌和钱包的结合，以牺牲许多其他出版物为代价，吸引并留住了明星。\n这种模式仍处于早期阶段，但有理由对未来感到兴奋。在模拟时代，如此多的内容是建立在以最低公分母内容接触大众市场消费者的基础上的；毕竟，当时根本没有那么多选择。谷歌和Facebook就像垃圾食品供应商一样，利用我们对高热量食品的进化冲动，将最低公分母的做法转变为内容战略，在质量和努力方面都越来越困难，只是因为这样更容易谋生，至少在一段时间内是这样。\n然而，长寿依赖于健康的生活，在这种情况下，健康的生活意味着建立一个业务，不仅要生产差异化的内容，而且要有完整的商业模式和整合的方法来匹配。最终的赢家是消费者，是的，他们为内容付费，但很高兴这样做，因为这是他们珍视的东西。还有更多的空间。\n在迪士尼+运营的市场；它将在其他市场的某个时候上映[↩]", "note_en": "Disney  just announced that  Soul, its next Pixar film, will be released exclusively on Disney Plus, 1 setting it up to be the most idealized piece of Disney content ever.\n I’m not referring to the actual movie,  which looks great; rather, consider how Disney is poised to make money from  Soul:\n Disney will create  Soul-derived merchandise, much of which it will sell through its stores and at its theme parks, and keep 100% of the margin.\n Disney will create  Soul-derived features at those theme parks, most of which it fully owns-and-operates, and keep 100% of the margin.\n You get the picture. And, at every transaction along the way, Disney will build an ever fuller picture of its customers. Disney, as always, will be selling Disney — it is just getting better and better at it as it more fully integrates its entire value chain.\n  A central focus of this site has been  Aggregators, particularly  Google and Facebook. Aggregators don’t make content, because they don’t need to. Rather, by providing functionality consumers value, they become the most efficient way to reach those same consumers, which means that creators bring their content to the Aggregators.\n  Suppose, for example, a publisher commissions a piece of content about bananas. Creating that content costs money, and the publisher is eager to recoup their costs. The publisher could charge for that piece of content, but then the publisher needs to sell it, and selling is difficult and expensive, increasing the payback threshold. What most publishers have done is make the bananas content freely available along with advertising, and then done their best to drive traffic to the content. For example, a publisher might work to ensure the bananas content ranks highly in a Google search result for “bananas”, or make it easy for readers to share the bananas content on social networks. Both of these strategies have the benefit of being free, so why not? And, if the content needs a little boost, advertising on both Google and Facebook is both inexpensive and easily measurable, making it possible to achieve a positive return on investment, at least on the advertising spend.\n The problem for our bananas publisher, though, is that every publisher ends up with the same strategy, and thus competing with each other for both traffic and keywords. It is not long before a positive return on that commissioned content is too high a bar to meet, which means fewer high quality bananas and a lot more stale banana bread. 2\n  That leaves the world of  Never-ending Niches that I wrote about earlier this year, and the strategy I just skimmed over — going directly to customers:\n That left a single alternative: going around Google and Facebook and directly to users. That raises the question as to what are the vectors on which “destination sites” — those that attract users directly, independent of the Aggregators — compete? The obvious two candidates are focus and quality:\n  What is important to note, though, is that while quality is relatively binary, the number of ways to be focused — that is, the number of niches in the world — are effectively infinite; success, in other words, is about delivering superior quality in your niche — the former is defined by the latter.\n  This obviously isn’t a new concept to Stratechery readers — this is the entire strategic rationale of this site. Again, though, the fact that this is a one-person blog doesn’t mean that my competitive situation is any different than that of the  New York Times or any other media entity on the Internet. In other words, to the extent that the  New York Times has been successful online — and the company has been  very successful indeed! — it follows that the company is well-placed in terms of both focus and quality, and in that order.\n It’s important to note that simply being focused isn’t enough: companies that want to capture niches in Aggregator-dominated worlds need to pursue strategies that are in almost every respect orthogonal to Aggregators. Specifically, they need to focus on integration, and the preeminent example of this approach is Disney.\n  When Disney first unveiled Disney+ in 2019, I wrote in  Disney and the Future of TV:\n The best way to understand Disney+, which will cost only $6.99/month, starts with the name: this is a service that is not really about television, at least not directly, but rather about Disney itself. This famous chart created by Walt Disney himself remains as pertinent as ever:\n  …This is the only appropriate context in which to think about Disney+. While obviously Disney+ will compete with Netflix for consumer attention, the goals of the two services are very different: for Netflix, streaming is its entire business, the sole driver of revenue and profit. Disney, meanwhile, obviously plans for Disney+ to be profitable — the company projects that the service will achieve profitability in 2024, and that includes transfer payments to Disney’s studios — but the larger project is Disney itself.\n By controlling distribution of its content and going direct-to-consumer, Disney can deepen its already strong connections with customers in a way that benefits all parts of the business: movies can beget original content on Disney+ which begets new attractions at theme parks which begets merchandising opportunities which begets new movies, all building on each other like a cinematic universe in real life. Indeed, it is a testament to just how lucrative the traditional TV model is that it took so long for Disney to shift to this approach: it is a far better fit for their business in the long run than simply spreading content around to the highest bidder.\n Disney+ has been a rare bright spot for Disney during the COVID pandemic, as so many other parts of the company, from cruise ships to theme parks to sports are predicated on in-person interactions. That Disney+ existed, though, was not simply good fortune: it has been clear that the world was headed this way for years — the primary function of the coronavirus crisis has been to accelerate trends that already underway — which is why Disney ultimately  had no choice but to get into streaming.\n Still, there were reasons for optimism even before the company launched Disney+: back in 2015, after Disney’s stock was pummeled when former CEO Bob Iger acknowledged that cord-cutting was affecting ESPN, I argued that  Disney would be OK:\n That’s not to say that everything is rosy in pay-TV land. If anything, to fixate on the fate of  ESPN is akin to journalism observers only caring about how the  New York Times is managing the transition away from print to first the Internet and now mobile. Things aren’t going perfectly but the company is surviving and continues to produce an incredible amount of compelling journalism. However, things are considerably worse for regional papers without the cachet or resources of the  Times: publications are going out of business all over the place, and the number of working journalists has been cut nearly in half over the last 25 years.\n I suspect a similar shakeout is coming in TV: as the pay TV bundle erodes an entire slew of cable channels will whither away, their targeted content replaced by online video, particularly YouTube. Meanwhile there will be an intense competition waged by a few streaming giants…for consumer attention and dollars. That competition will largely work in the favor of content creators, who ultimately create the differentiation that end users are willing to pay for…Such an outcome should provide hope to content creators of all types: there is a way to escape from the commoditization effect of Aggregation Theory, and that is through differentiation. In other words, the more things change, the more they stay the same.\n   It’s not an accident that the  New York Times made another appearance in an article about Disney; they are, from a certain perspective, running the same type of business: differentiated content that both accrues more to a brand than a specific creator and which increasingly monetizes from consumers directly.\n By the time Disney faced its 2015 crisis the  New York Times was well on the way to solving its previous dependence on print advertising thanks to its burgeoning subscription business; even then, though, the last thing standing in the way of the  New York Times and its future was its own culture and traditions, particularly the obsession with Page One. Nikki Usher wrote in the  Columbia Journalism Review in 2015:\n The  Innovation Report leaked in May detailed how the  Times was stuck in a culture dominated by the print newspaper. And in my own research for my book  Making News at The New York Times, as well as  here on CJR and elsewhere, I’ve chronicled just how ingrained this print-first focus has been.\n Even recently, when I was visiting the  Times, a junior reporter showed me her Page One story from earlier in the week. She expressed how “amazing” it was that she got it on the front page, and how it would validate her abilities to the masthead editors. And she had a stack of a half dozen papers on her desk to save for posterity.\n Part of the problem was that the website and other digital properties had essentially been running of their own accord, out of synch with the news judgment of what stories were considered most important by masthead editors. Instead, as my research revealed, a handful of people were in charge of what went up on the Web, and when. A single homepage editor sat next to another editor, and the discussion about what stories to place when and where on Web was almost entirely decided by them…The sole discussion of Page One meetings about digital strategy has been a rundown of stories on the Web, but no discussion of timing, analytics, placement, or importance of these stories.\n That led executive editor Dean Baquet to take a radical step: the Page One meeting would no longer discuss Page One.  The New York Times wrote about itself:\n The larger meeting will continue a yearslong evolution away from its front-page focus, responding to the needs of a constant news cycle. In recent years, Mr. Baquet had turned discussion toward story lines and trends, resources for breaking news, and rolling out enterprise and long-form stories in a reasoned way for digital users…But for the new age, Mr. Baquet has gone a step further, declaring that the big meeting — now held around a vast wooden table — will exclusively be a forum for planning coverage and for ranking items for digital display. One focus will be presentations for mobile devices, where more than half of Times readers now obtain their news.\n It wasn’t enough to change the business model: Page One had so much gravity and prestige that the  New York Times had to change how it worked to ensure it properly valued its future over its past.\n  Yesterday Disney announced what it termed a  Strategic Reorganization of Its Media and Entertainment Businesses:\n In light of the tremendous success achieved to date in the Company’s direct-to-consumer business and to further accelerate its DTC strategy, The Walt Disney Company today announced a strategic reorganization of its media and entertainment businesses. Under the new structure, Disney’s world-class creative engines will focus on developing and producing original content for the Company’s streaming services, as well as for legacy platforms, while distribution and commercialization activities will be centralized into a single, global Media and Entertainment Distribution organization. The new Media and Entertainment Distribution group will be responsible for all monetization of content—both distribution and ad sales—and will oversee operations of the Company’s streaming services. It will also have sole P&amp;L accountability for Disney’s media and entertainment businesses.\n From a “people changing bosses” perspective, this seems like a relatively minor change; Media and Entertainment, which were  relatively untouched in Disney’s last reorganization, has been split into three divisions (studios, general entertainment, and sports) that both make sense and, frankly, already existed.\n That, though, is why the last line of that excerpt is so important: profit and loss responsibility is the ultimate indicator of control, which means that Media and Entertainment now answer to distribution, which has a clear mandate to emphasize streaming. From the announcement:\n “Given the incredible success of Disney+ and our plans to accelerate our direct-to-consumer business, we are strategically positioning our Company to more effectively support our growth strategy and increase shareholder value,” [Disney CEO Bob] Chapek said. “Managing content creation distinct from distribution will allow us to be more effective and nimble in making the content consumers want most, delivered in the way they prefer to consume it. Our creative teams will concentrate on what they do best—making world-class, franchise-based content—while our newly centralized global distribution team will focus on delivering and monetizing that content in the most optimal way across all platforms, including Disney+, Hulu, ESPN+ and the coming Star international streaming service.”\n In this view, Disney’s streaming services are NYTimes.com, and the company’s traditional outlets like TV and especially movie theaters are Page One: sure, they represented a past that is rapidly fading away, but it is a past with prestige, and it’s easy to see Disney’s content creators favoring them over streaming, particularly before COVID when these channels still drove much of the company’s revenue and profits. Chapek, though, is not letting this crisis go to waste, taking the decision about where to display the company’s content away from its creators, as well as the responsibility to maximize short-term revenue and profits.\n  The payoff is the long run: remember, Disney+ is about Disney as a whole, not just one particular line of business, but to achieve that singularity of focus across a company like Disney means designing incentives and lines of accountability that reflect that integration focus.\n  More broadly, the totality of Disney’s approach demonstrates how an integrator ought to operate orthogonally to Aggregators in the world of content.\n  Facebook reduces all content to similarly sized rectangles in your feed: a deeply reported investigative report is given the same prominence and visual presentation as photos of your classmate’s baby; all that Facebook cares about is keeping you engaged. Content created by Disney, on the other hand, must be unique to Disney, and memorable, as it is the linchpin for their entire business.\n  Modularized content creators, like our bananas publisher, spend money to create content and then seek to recoup their costs by spreading that content as far and wide as possible. Google and Facebook are the most efficient means of achieving this goal. Disney, though, is increasingly focused on capturing more and more margin from its differentiated content, both when it is created and for decades to come.\n Aggregators seek to serve the maximum number of consumers. Integrators seek to monetize consumers to the maximum extent.\n Google and Facebook are so attractive to content creators precisely because they reach so many consumers; a few pennies or dollars from billions of people is a tremendous amount of money. Disney, meanwhile, particularly as it restricts its content to its own services, is limiting the size of its addressable market, but increasing the amount of money it can make per user in the market that remains.\n  Google doesn’t care from whence content comes, it simply wants content (this, unsurprisingly, has led to a whole host of businesses primarily predicated on being organic Google search results). Disney, meanwhile, wants to create differentiated content without unduly empowering individual content creators and giving them  wholesale transfer pricing power; this leads the company to invest both in animation, which is wholly owned by Disney, and franchises, which are bigger and more valuable than the actors that bring them to life.\n  Aggregators get themselves in strategic trouble when they leverage their horizontal services to differentiate their own attempts at integration (Google  made this mistake with Android a decade ago). Integrators, on the other hand, get in trouble when they serve specific audiences that don’t accrue to the whole. This was the mistake the  New York Times was making with their focus on the front page, and as long as Disney’s studio and media divisions were responsible for the company’s theater and TV business they would be incentivized to serve those pre-existing audiences instead of Disney’s overall strategic goals.\n  In one of the above excerpts I put  Stratechery in the same category as the  New York Times; what is fascinating about the sorting effect that the Internet has on business models is that I could do the same thing with regards to Disney: yes, it is perhaps audacious to compare a one-person blog to the largest entertainment company the world has ever seen, but that is only because Aggregators are that much greater.\n Just think about it: the success or failure of my business is predicated on differentiated content, high margins, high average revenue per customer, controlling content creation, and not being distracted by short-term money-making opportunities. All of this applies to the  New York Times too: differentiated high-margin content, high prices, operationalized creation, and, at least for now, a combination of brand and pocketbook that is  attracting and keeping stars at the expense of many other publications.\n This model is still in its early days, but there is reason to be excited about the future. So much content in the analog era was predicated on reaching the mass market consumer with lowest common denominator content; after all, there simply weren’t that many choices. Google and Facebook, like junk food purveyors leveraging our evolutionary impulse for high caloric food, transformed that lowest common denominator approach into content strategies that increasingly scraped the barrel in terms of both quality and effort, simply because it was easier to make a living that way, at least for a while.\n A long life, though, depends on healthy living, which in this case means building a business that doesn’t just produce differentiated content, but has an entire business model and integrated approach to match. The ultimate winners are the consumers that yes, pay for the content, but happily so, because it is something they value. There is room for plenty more.\n In markets where Disney Plus operates; it will be released theatrically at some point in others [ ↩]", "posttime": "2020-10-13 21:44:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "集成商,integrators,迪士尼", "title": "迪士尼和集成商与聚合商", "title_en": "Disney and Integrators versus Aggregators", "transed": 1, "url": "https://stratechery.com/2020/disneys-integration/", "via": "", "real_tags": ["集成商", "迪士尼"]}, {"category": "", "categoryclass": "", "imagename": "0de8898096734fc3b8bb49ae868c8582.jpg", "infoid": 1028479, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载并玩免费的AFK竞技场https://bit.ly/3cvZ7dB使用这些奖励代码：►：BestRPG4BusyU和uf4shqjngq获得令人敬畏的奖励。成为一名黑客工匠..。", "note_en": "Download and play AFK Arena for free ► https://bit.ly/3cvZ7dB Use these bonus codes: BestRPG4BusyU and uf4shqjngq to get awesome rewards. Become a Hacksmith ...", "posttime": "2020-10-13 21:44:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "伸缩,lightsaber,奖励", "title": "4000°等离子光剑(可伸缩刀片式)", "title_en": "4000° Plasma Lightsaber Build (Retractable Blade)", "transed": 1, "url": "https://www.youtube.com/watch?v=xC6J4T_hUKg", "via": "", "real_tags": ["伸缩", "奖励"]}, {"category": "", "categoryclass": "", "imagename": "473fd46723c0082e2883aecd3ba46187.jpg", "infoid": 1028478, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "封锁使得考试季节对教师和学生来说都是一个学习曲线。在没有真正通知的情况下，寻找新的考试方式的任务被强加给了机构，导致一些机构在海外寻找解决方案。因此，数以千计的英国学生被指示向美国技术开放他们的计算机，这些技术要求记录你的屏幕，管理你的下载，甚至可以跟踪你的眼球运动…。\n自从在家工作成为现状以来，这种类型的技术一直登上新闻头条，普华永道(PwC)等公司选择了远程工作软件，不仅可以追踪员工的脸，还可以追踪他们的厕所。但是，当涉及到考试时，远程监考开始看起来像是“新常态”。\n我采访了美国Proctorio公司的首席执行官迈克·奥尔森(Mike Olsen)，根据Google Chrome的数据，该公司提供远程监考服务，用户超过90万。他解释了这个看似陌生的侵入性软件的幕后真实情况。\n在添加扩展之前，Proctorio要求广泛的权限，使其能够“锁定”考生的计算机，防止作弊和检测抄袭。意识到这会吓到一些学生，该公司在其Google Web Store页面上解释了自己的理由。在谈到“阅读和更改你访问的网站上的所有数据”的能力时，他们向用户保证：“听起来像…这样可怕得多。”\n学生们当然已经注意到了你必须授予这款应用程序的权限的广度，甚至有4000多名学生在澳大利亚国立大学(Australian National University)签署了一份请愿书，要求放弃这款软件。迈克开玩笑说，公司面临着学生的强烈反对，他们不知道自己在说什么。“学生们假装关心他们的数据到哪里去了，这太滑稽了。不管他们是不是作弊，我并不真的在乎，但他们出去后就会说些什么。他们不做任何研究，他们只是编造一些东西，然后它被放大了，这在过去的几个月里非常令人沮丧。“。\n他将此归咎于糟糕的营销策略：“我认为这是我们目前最大的问题，我们的营销部门在沟通方面做得太差了，特别是对最终用户和学生。”\n他还强调，严格来说，Proctorio并不是要求使用这些权限。相反，教育机构自己决定他们希望如何监控他们的学生。关于通过网络摄像头扫描学生房间的能力，迈克说：“嗯，这是学校开启的一种设置。默认情况下，它不会打开。我们实际上没有任何违约情况。这是他们想要的。如果有问题，我们只是提供者，你需要和机构谈谈。“。\n其中一个这样的机构是国家记者培训委员会(NCTJ)，他们提供在线评估，作为一种替代方案，可以推迟考试，直到有可能亲自参加考试。他们的质量和评估负责人雷切尔·曼比(Rachel Manby)告诉我，他们为什么选择使用屏幕录制和网络摄像头监控，以及为什么不选择开卷考试。\n我们已经在Proctorio软件中启用了网络摄像头监控，以便我们能够识别考试期间可能发生的任何可疑或实际的不当行为。我们已经启用了屏幕锁定，因此考生在考试期间无法访问互联网，例如查找答案或与其他考生交流。这使我们能够保护我们评估的安全性和评估结果的可靠性和有效性。\n“NCTJ文凭级别的考试，无论是远程授课还是中心授课，都是闭卷评估，以保持文凭资格的完整性，并确保所有考生的授课方式一致和公平。根据数据保护要求(包括遗忘权)，Proctorio在我们考试期间捕获的数据安全地存储在NCTJ中，NCTJ工作人员仅出于质量保证的目的对其进行审查。“。\n迈克说，在大流行之前，普罗科托里奥主要是一家总部设在美国的公司，但现在更多地是欧洲人：“我们真的看到这种集中在美国，现在它刚刚在全球范围内爆炸式增长，甚至在欧洲也是如此。欧洲人更传统，是教室，是校园，是铅笔和纸。几乎必须在一夜之间发生的事情是，他们必须向数字化转型，他们必须以新的格式转型为新的考试。“。\n封锁肯定让他们的生意蒸蒸日上。他说：“我们的系统是为负荷而设计的，而且做得很好。但作为一家公司，我们还没有做好应对需求的准备。举个例子，在三周的时间里，我们得到了1900条线索。我们没有销售团队让他们加入-这是我们遇到的规模问题。我们正在走出困境，但需求并没有放缓。“。\n该应用程序的主页上印有一系列徽标，并引用了亚马逊、杜克大学和华盛顿大学的客户。目前，他们的网站上写着：“我们与400多所大学、机构和公司合作，提供安全、可靠、经济实惠的远程监督、身份验证和原创认证”。\n在5月下旬接受采访时，这些机构中有15家在英国，包括皇家兽医学院(Royal Veterinary College)、霍特国际商学院(Hult International Business School)和NCTJ，在接下来的两周内还将成立另外10家机构。\n启用了这么多权限后，我告诉Mike，学生们可能会担心Proctorio是数据窃取和欺诈的金矿，他们想知道为什么它需要所有这些功能。“我们基本上要求了我们需要的一切。因此，假设考试具有所有安全功能、所有录制功能、所有功能都已启用，我们请求所有权限并使用这些权限。\n“那是个错误，我认为那是懒惰的。当涉及到工程时，这是一个懒惰的错误，更容易预先要求所有的东西，而现在我们没有使用它。但是，再说一次，从你的角度来看，你不知道，你怎么能相信这一点。因此，我们将转向不同的模式。“\n这款新机型计划于今年夏天发布，它将要求“所需的最低权限”，并使用一个名为“沙箱”的概念，通过网页作为浏览器扩展进行操作。\n他说：“网站运行一种沙盒概念，这意味着它们不能访问个人文件，所有这些文件都不能被触及。因此，如果我们以浏览器扩展的方式操作，我们也可以在沙箱中操作，这给了我们足够的访问权限来保护内容，但它没有给我们任何大多数人关心的访问权限：个人文件，能够在我们想打开的时候打开，在你的系统上安装东西。它只是一个浏览器扩展。“。\n在远程监管界，这是新奇的，Mike很高兴他的竞争对手正在复制它们：“不幸的是，竞争对手仍然使用远程控制软件。你在你的电脑上安装一些东西，他们会控制你，他们会移动你的鼠标，点击你的键盘。但我们不想这样运作。“。\n迈克表示，普罗科托里奥的模式为隐私和效率带来了奖金。与一些竞争对手使用人工(他说是在印度的呼叫中心)通过网络摄像头监控学生不同，普罗科托里奥使用人工智能来保护隐私。因此，他说，授权一名学生使用这款应用程序一整年的费用相当于与使用人工监考的竞争对手进行1-1.5次考试的费用。\n客户可以选择其数据的存储位置。Mike说，当客户入驻时，他们会选择一个区域，所有数据都会流经该区域并存储在该区域中，而不需要离开。他们提供专门针对美国、英国和德国的存储，以及一般的欧盟地区空间和印度、加拿大和澳大利亚的存储。遵守的隐私法还将取决于与之签约的地区。\n然而，Proctorio确实使用微软数据中心，由于担心美国爱国者法案可能使美国政府能够收集恐怖主义或间谍调查的信息材料，微软数据中心多年来一直是一些审查的对象。\n但迈克认为，微软的问题现在基本上已经得到解决。“我知道很早就有人担心，因为美国”爱国者法案“(US Patriot Act)实际上会允许美国政府获取数据。我知道微软已经找到了绕过这一问题的方法，他们并不拥有数据中心。它们总部设在德国，但授权给微软。他们只是让他们的客户访问它。这有效地消除了美国爱国者法案生效的能力。“。\n数据本身使用零知识加密进行存储。迈克说，这意味着即使数据流经美国也无关紧要，因为对于任何窥探它的人来说，它“基本上都是无用的”。为了解释这种加密技术是如何工作的，他打了个比方。\n“比方说，我是一家为一家律师事务所保存文件的公司，在他们把文件寄给我之前，他们把它撕碎了。我把粉碎的文件储存起来，然后当他们需要的时候，他们会有一些神奇的方法把它们变成纸。这会阻止我进行数据挖掘或训练算法，因为我存储的数据毫无用处。这就是为什么你不会看到很多公司这样做的原因。\n他说，事实上，世界上只有大约六家公司在尝试使用这种形式的加密，因为想要利用数据从公司中榨取额外资金的投资者是不受欢迎的。他表示：“其中一个不同之处在于，我没有风险投资。”“你在任何地方都看不到零知识加密的原因，是因为我无法从我们存储的数据中挤出数据。这让我不能投资，对一家公司来说，这不会让我成为一个非常有吸引力的销售对象。“。\n我采访了DataSecurityExpert.co.uk的创始人格雷姆·巴茨曼(Graeme Batsman)，了解他对这种存储方法的看法。他警告说，“如果老师声称可以解锁，那么零加密就会变得毫无用处”，如果没有双因素认证，钓鱼就更容易了。\n我问Mike，这是否意味着链中最薄弱的一环是机构本身，以及他们是否使用双因素身份验证来解决这一问题。“我们已经在内部讨论过了。但目前还没有强制执行，所以这是该机构为获取学生成绩而制定的任何安全政策和程序。“。\n迈克说，他很愿意引入双因素，尽管这将是一项巨大的投资，他正在努力设计这一点。\n“Proctorio进行日常安全审计，包括渗透测试和漏洞评估”，其隐私和Cookies页面声称。但是，格雷姆告诉我，一个人做这件事会花费一大笔钱，所以如果这些测试是由脚本进行的，它们的价值将是有限的，因为脚本只能找到“世界上已知的东西”，而人类可以检测到未知的问题。\n迈克承认，普罗科托里奥从未进行过人体测试，尽管6月1日开始的合同将引入人体审计师。“我们一直都有自动化测试。我们刚刚聘请了一家白帽保安公司，它将非常积极地进入，而不仅仅是使用自动化模型，实际上是人类。这是我们第一次这么做。“。\n他说，这样做的目的将是通过三种方式“证明他们在做他们所说的事情”，以及他们做这件事的安全性：1)测试零知识加密，包括所使用的算法；2)分析数据流；3)积极攻击，试图窃取数据。\n这将是他们第一次企图入侵。迈克说，该公司从未经历过企图入侵的事件，尽管他们曾面临过拒绝服务攻击，学生们试图让系统过载。\n“通常情况下，如果一个学生不想参加期末考试。我们在期末考试中最脆弱，因为我们的系统太紧张了。我们有数以万计的用户同时参加考试。因此，我们的正常模式就像是一次攻击；我们的系统通常只受到学生数据的攻击。“。\n至于符合英国的安全标准，格雷姆警告说，美国的认证在英国没有太大的可信度。普罗科托里奥拥有国际标准化组织27001认证，根据itGovernment ance.co.uk的说法，这是“现有的最受欢迎的信息安全标准之一”，并得到了国际认可。\n当被问及认证的范围时，Mike告诉我，ISO涵盖了所有三个实体，它主要关注技术认证：它涵盖了流程、数据流，以及连接和服务之间是否存在限制。\n迈克希望他的下一次更新能消除一些学生的担忧，并想强调，由于植树抵消计划和考生不必使用燃料前往考试中心的事实，该公司是碳中性的。希望这能给环境科学专业的学生带来些许安慰。\n我使用Proctorio是因为我正在参加NCTJ的考试，当我在推特上说下载这款应用感觉就像“出卖了我的童贞”时，当迈克亲自回复说他很高兴为我的故事做贡献时，我感到很惊讶！\n迈克的坦率和透明度在相当晦涩深奥的科技世界中是不同寻常的，这本身就让我相信了他的意图。在搜索了Proctorio的网站后，我可以看到他们已经尽了最大努力来缓解用户的恐惧，尽管Mike认为他们的营销策略很糟糕，但我很同情。无论你怎么解释，一款控制你的电脑并扫描你卧室的应用程序本质上都很难推销。\n使用这款应用程序的体验很简单，但下载它却让人伤脑筋：我坚持我的笑话，点击“添加扩展”按钮感觉像是违反了规定。因此，我很高兴普罗科托里奥的新模型将需要更少的权限，并希望它们能向学生传达他们使用的零知识加密的完整性。\n我也很高兴Proctorio将开始使用人工审核员，但令我震惊的是，考虑到授予的权限是如此全面，他们花了6年时间才达到这一点。我也很惊讶他们没有在很久以前引入双因素身份验证；仅仅输入电子邮件地址和密码就让老师可以访问学生数据似乎是不负责任的，这显然容易受到黑客的攻击。\n然而，为Proctorio辩护，我很欣赏冠状病毒带来的需求激增，在这款应用程序仍在发展的时候，该公司受到了意想不到的关注。此外，我更喜欢能够在舒适的家里参加考试，而不需要花几个小时的时间旅行和坐在临床检查厅里。我希望Proctorio解决它的问题，这样学生就可以继续他们的教育，而不会增加数据安全的担忧，也不会觉得有义务发布讽刺的推文。\n感谢Proctorio首席执行官Mike Olsen同意接受采访，感谢Graeme Batsman在数据安全标准方面的真知灼见。", "note_en": "Lockdown has made  exam season as much of a learning curve for the teachers as for the students. The task of finding new ways to hold exams was thrust on institutions with no real notice, leading some establishments to look for solutions overseas. As a result, thousands of British students have been instructed to open their computers to American tech that asks to record your screen, manage your downloads and can even track your eye movements…\n This genre of tech has been in headlines since working from home became the status quo, with companies like  PwC opting for remote working software that tracks not only employees’ faces but also their loo breaks. But when it comes to exams, remote invigilation is beginning to look like the ‘new normal’.\n I spoke to Mike Olsen, the CEO of Proctorio, a US-based company offering a remote invigilation service with over 900,000 users according to Google Chrome. He explained what’s really going on behind the scenes of this seemingly alien, intrusive software.\n  Before adding the extension, Proctorio asks for a wide range of permissions to enable it to ‘lock down’ a candidate’s computer, preventing cheating and detecting plagiarism. Aware that this will frighten some students, the company explains its rationale on its  Google Web Store page. Of the ability to ‘read and change all your data on the websites that you visit’, they reassure users: “It’s a lot less scary that it sounds…”\n  Students have certainly noted the breadth of permissions you must grant the app, with over 4,000 students even having signed a  petition to abandon the software at Australian National University. Mike jokes that the company has faced backlash from students who don’t know what they’re talking about. “It’s hilarious, students pretending to care where their data goes. Whether they’re cheating or not, I don’t really care, but then they go out and they just say things. They don’t do any research, they just make things up, and then it gets amplified, and that’s been very upsetting over the last couple of months”.\n He blames this on a poor marketing strategy: “I think that’s our biggest problem right now, our marketing side does such a poor job of communication especially to the end user, to the student”.\n He also emphasised that it’s not strictly Proctorio asking to use these permissions. Rather, the educational institutions themselves decide how they wish to monitor their students. Regarding the power to scan students’ rooms via webcam, Mike says: “Well, that’s a setting that the institution turns on. It’s not on by default. We actually don’t have any defaults. They wanted that. If there’s a problem with it, well we’re just the provider, you need to talk to the institution”.\n One such institution is the National Council for the Training of Journalists (NCTJ), who offer online assessments as an alternative to delaying their exams until it’s possible to sit them in-person. Rachel Manby, their Head of Quality and Assessment told me why they chose to use screen recording and webcam monitoring, and why open-book examinations were not an option.\n “We have enabled webcam monitoring in the Proctorio software so that we are able to identify any suspected or actual malpractice that may take place during an exam. We have enabled screen lockdown so candidates are unable to access the internet during an exam, for example to look up answers or to communicate with other candidates. This allows us to protect the security of our assessments and the reliability and validity of the assessment results.\n “NCTJ exams at diploma level are closed book assessments whether they are delivered remotely or in centre, to maintain the integrity of the diploma qualification and to ensure a consistent and fair approach to delivery for all candidates. The data captured by Proctorio during our exams is stored securely at the NCTJ in line with data protection requirements (including the right to be forgotten) and is reviewed by NCTJ staff for quality assurance purposes only”.\n  Mike says that prior to the pandemic, Proctorio was mostly a US-based company, but is more European now: “We really saw that concentration in the US and now it has just exploded globally, even in Europe. Europeans were more traditional, it was classrooms, it was on-campus, it was pencils and paper. And what had to happen almost overnight is they had to transform to digital, they had to transform to new exams in new formats”.\n Lockdown certainly saw a boom in their business. “Our system was designed to take on the load and it has done well. But as a company, we were not ready for the demand. To give you an example, in a three week period we got 1,900 leads. We didn’t have sales teams to get them on board – that was the scaling issue we hit. We’re coming out of that, but the demand hasn’t slowed down”.\n The app has an array of logos emblazoned on its  home-page, citing Amazon, Duke University and the University of Washington amongst its clients. At present, their website says: “We work with over 400 universities, institutions, and corporations to provide secure, reliable, cost-effective remote proctoring, identity verification, and originality authentication”.\n At the time of the interview in late May, 15 of these institutions were in the UK, including Royal Veterinary College, Hult International Business School and the NCTJ, with 10 more being set up over the following fortnight.\n  With so many permissions enabled, I put it to Mike that students may fear Proctorio is a goldmine for data theft and fraud, and wonder why it needs all those abilities. “We basically asked for everything we needed. So, assuming that the exam has all the security features, all the recording features, everything was enabled, we asked for all the permissions and used those.\n “That was a mistake, I think that was lazy. A lazy mistake when it comes to engineering, easier to ask for everything upfront and now we’re not using it. But again, from your point of view, you don’t know that, how can you trust that. So, we’re moving to a different model”.\n The new model, planned for release this summer, is going to ask for the ‘minimum amount of permissions required’ and operate as a browser extension through a web-page, using a concept called ‘sandboxing’.\n He says: “Websites run a sort of sandbox concept, meaning they can’t access personal files, none of that can be touched. So if we operate as a browser extension, we can also operate within the sandbox, which gives us just enough access to secure the content, but it doesn’t give us any access that most people are concerned about: personal files, being able to turn on whenever we want to turn on, installing things on your system. It’s just a browser extension”.\n Within the remote proctoring world, this is novel, and Mike is pleased that his competitors are copying them: “The competition still use remote control software unfortunately. You’re installing stuff on your computer, they take control, they actually move your mouse, click your keyboard. But we don’t want to operate that way”.\n Proctorio’s model comes with bonuses for privacy and efficiency, Mike suggests. Unlike some competitors who use a human (based in a call centre in India, he says) to monitor students through the webcam, Proctorio uses AI, protecting privacy. As a result, he says the cost of licensing the app for use with one student for an entire year is equivalent to the price of 1-1.5 exams with a competitor who uses a human invigilator.\n  Customers can choose where their data is stored. Mike says that when a client is on-boarded they pick a region, and all the data flows through and is stored in that region without leaving. They offer storage that is specific to the US, the UK and Germany, plus a general EU region space and storage in India, Canada and Australia. The privacy laws adhered to will also depend on the region being contracted with.\n However, Proctorio does use Microsoft data centres, which have been the subject of some  scrutiny over the years due to fears the US Patriot Act could enable the States’ government to collect information material to terrorism or espionage investigations.\n  But Mike believes Microsoft’s problems have now largely been addressed. “I know there were concerns early, because of things like the US Patriot Act, which would effectively allow the US government to access data. I know  Microsoft has found ways around that, they don’t own the data centres. They’re based in Germany but licensed to Microsoft. They just give their customers access to it. Which effectively eliminates the ability of the US Patriot Act to kick in”.\n  The data itself is stored using zero-knowledge encryption. Mike says this means it wouldn’t matter if the data flowed through the US as it is ‘essentially useless’ to anybody snooping on it. To explain how this encryption technique works, he drew an analogy.\n “Let’s say I’m a company that holds paperwork for a law firm and before they send it to me, they shred it. And I store the shredded documents and then when they need them, they have some magic way to turn them back into papers. What that does is prevents me from data-mining or training an algorithm, because the data I’m storing is useless. That’s why you’re not going to see a lot of companies doing this”.\n Indeed, he says there are only about six companies in the world trying to use this form of encryption because it’s undesirable for investors who want to use data to ‘squeeze extra money out of a company’. “One of the differences is I’m not venture funded”, he says. “The reason you don’t see zero-knowledge encryption anywhere is because there’s no way I can squeeze data out of the data we’re storing. It’s something that makes me not investable, it doesn’t make me a very attractive sale for a company”.\n I spoke to the founder of  DataSecurityExpert.co.uk, Graeme Batsman, to get his opinion on this storage method. He warned that “the zero-encryption is then rendered useless if claims to be unlockable by teachers”, and that without two-factor authentication, fishing is easier.\n I asked Mike whether this meant the weakest link in the chain is the institution itself, and whether they use two-factor authentication to tackle this. “We’ve talked about it internally. But right now there’s no enforcement so it’s whatever security policy and procedures the institution has in place for accessing student grades”.\n Mike says he would love to introduce two-factor, even though it would be a huge investment, and is working on designing this.\n  “Proctorio conducts daily security audits including penetration testing and vulnerability assessments”, its  Privacy and Cookies page claims. But, Graeme tells me, a human doing this would cost a fortune, so if these tests are conducted by scripts, their value will be limited as scripts can only find ‘what’s known in the world’, whereas humans can detect unknown issues.\n Mike admits that Proctorio has never had human testing, although a contract starting June 1st will introduce human auditors. “We’ve always had automated testing. We’ve just hired a  white-hatted security company who’s going to go in really aggressively and not just use automated models, actually humans. It’s the first time we’re doing that”.\n He says the aim will be to ‘prove they’re doing what they’re saying they’re doing’, and how securely they are doing it, in three ways: 1) testing the zero-knowledge encryption, including the algorithm used 2) analysing the data flows 3) aggressively attacking to try and steal data.\n This will be their first attempted breach. Mike says the company has never experienced an attempted breach, although they have faced a denial of service attack whereby students try to overload the system.\n “Typically it’s if a student doesn’t want to take a final exam. We’re most vulnerable during final exams because our systems are so strained. We’ve got tens of thousands of users all taking exams at the exact same time. So our normal pattern is like an attack; our systems are being attacked normally by just student data”.\n As for meeting British security standards, Graeme warned that American certifications don’t hold much credibility in the UK.  Proctorio has  ISO 27001 certification, “one of the most popular information security standards in existence”, according to  itgovernance.co.uk, and is internationally recognised.\n When asked about the scope of the certification, Mike told me the  ISO covers all three entities, and that it mainly focuses on technology certification: it covers processes, data flows, and whether there are restrictions between connections and services.\n  Mike hopes his next update will address some students’ fears, and also wanted to stress that the company is carbon neutral thanks to tree-planting off-set programmes and the fact candidates don’t have to use fuel travelling to testing centres. Hopefully this will be of some consolation to environmental science students.\n  I used Proctorio because I was taking exams with the NCTJ, and when I  tweeted that downloading the app felt like ‘selling my virginity’, I was surprised when Mike personally replied to say he was happy to contribute to my story about it!\n Mike’s candidness and transparency are unusual in the rather murky, esoteric  world of tech, which has in itself made me trust his intentions. Having scoured Proctorio’s website I can see they’ve done their best to assuage users’ fears, and although Mike thinks their marketing strategy has been poor, I am sympathetic. An app that controls your PC and scans your bedroom is an inherently tough sell no matter how you explain it.\n The experience of using the app was simple but downloading it was nerve-wracking: I stand by my joke that clicking that ‘Add extension’ button felt like a violation. So, I am delighted that Proctorio’s new model will require fewer permissions and hope they can convey to students the integrity of the zero-knowledge encryption they use.\n I am also pleased that Proctorio will start using human auditors but am shocked that it took them 6 years to reach that point given how comprehensive the permissions granted are. I am also surprised they didn’t introduce two-factor authentication long ago; it seems irresponsible to make students’ data accessible to teachers after merely entering an email address and password, which are clearly susceptible to hacking.\n However, in Proctorio’s defence, I appreciate that the surge in demand due to coronavirus has exposed the company to unexpected levels of attention at a time when the app is still evolving. Also, I preferred being able to take exams from the comfort of my home, without spending hours travelling and sitting in a clinical exam hall. I hope Proctorio fixes its issues so students can continue their education without the added worry of data security and won’t feel obliged to make sarcastic tweets.\n Thank you to Mike Olsen, CEO of Proctorio, for agreeing to an interview, and to Graeme Batsman for his insights on data security standards.", "posttime": "2020-10-13 21:28:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "监督,care,学生", "title": "考试监督公司Proctorio的首席执行官说：“学生们假装关心他们的数据到哪里去了，这太滑稽了。”", "title_en": "\"It’s hilarious, students pretending to care where their data goes.\" - says CEO of Proctorio, an exam surveillance company", "transed": 1, "url": "https://techround.co.uk/tech/american-remote-invigilation-software-uk-exams-proctorio//", "via": "", "real_tags": ["监督", "care", "学生"]}, {"category": "", "categoryclass": "", "imagename": "25e9e1d5c06d323ff2f70bc0dddf4447.jpg", "infoid": 1028476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马尼拉-菲律宾周一开始为其国民身份识别系统登记数百万公民，希望推广电子支付，使没有银行账户的低收入者更容易获得金融服务。\n所有菲律宾公民和常驻外国人都需要登记姓名、性别、出生日期、出生地、血型、地址和国籍等信息。生物特征数据-指纹、面部照片和虹膜扫描-也将被存储。\n该国目前的制度，即不同的机构发布自己的数字，一直被批评为不方便。新系统将为每个人授予一个唯一的号码，可以跨机构使用。政府希望让没有银行账户的低收入工人更容易获得金融服务，并为政府服务的提供提供便利。\n菲律宾统计局的官员将走访各家收集个人信息，在总统罗德里戈·杜特尔特(Rodrigo Duterte)2022年6月任期结束前完成这一过程。该系统计划于2021年下半年开始运行，提供签证发放等服务。\n一项调查发现，73%的公众支持新的身份证系统，这表明人们对政府收集个人信息的担忧很少。\n国家经济与发展局代理局长卡尔·肯德里克·蔡(Karl Kendrick Chua)表示，ID系统将加速数字经济的增长。他表示，希望国家系统将引发电子支付的广泛使用。与私营部门的伙伴关系似乎也在谈判桌上。\n尽管电信公司PLDT和Globe Telecom采取行动将电子货币纳入主流，但现金在菲律宾仍然是王道。网购流行得很慢，部分原因是送货付款是常态。新的国家身份证系统可能会改变公司的经营方式。", "note_en": "MANILA -- The Philippines began Monday registering millions of citizens for its national identification system, hoping to promote electronic payments and make it easier for low-income earners without bank accounts to access financial services.\n All Philippine citizens and resident foreigners are required to register such information as name, sex, date of birth, place of birth, blood type, address and nationality. Biometric data -- fingerprints, facial photos and iris scans -- also will be stored.\n The country&#39;s current system, in which different agencies issue their own numbers, has been criticized as inconvenient. The new system will grant each person a unique number that can be used across agencies. The government hopes to make financial services more accessible to low-income workers who lack bank accounts as well as facilitate delivery of government services.\n  Officials from the Philippine statistics agency will visit homes to collect the personal information, completing the process before President Rodrigo Duterte&#39;s term ends in June 2022. The system is scheduled to begin operation in the second half of 2021 for services such as visa issuances.\n A survey found 73% public support for the new ID system, suggesting that little concern exists over the collection of personal information by the government.\n Karl Kendrick Chua, acting secretary of the National Economic and Development Authority, said the ID system will accelerate growth of the digital economy. He expressed hope that the national system will spark widespread use of electronic payments. Partnerships with the private sector also appear to be on the table.\n Cash remains king in the Philippines despite moves by telecommunications companies PLDT and Globe Telecom to bring e-money into the mainstream. Online shopping has been slow to catch on, in part because payment on delivery is the norm. The new national ID system could change how companies do business.", "posttime": "2020-10-13 21:21:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "虹膜,iris,系统", "title": "菲律宾开始为其国家身份识别系统注册数百万人，存储包括指纹、面部照片和虹膜扫描在内的生物特征数据", "title_en": "Philippines starts registering millions for its national identification system, storing biometric data including fingerprints, facial photos, and iris scans", "transed": 1, "url": "https://asia.nikkei.com/Politics/Philippines-starts-registering-millions-for-national-ID-cards", "via": "", "real_tags": ["虹膜", "iris", "系统"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ants是一个修改和附加软件的集合，它向Plan 9添加了新的命名空间操作功能。它是基于9front的自由软件，并使用相同的许可，MIT用于原始代码，LPL用于修改贝尔实验室的源代码。26版权所有2020 Mycroftiv mantsifesto.txt：反对网格上的仇恨和胡说八道。经常出现在各种IRC频道的Freenode上，偶尔可以通过电子邮件在sphere icalharmony.com9gridchan.org的mycroftiv上联系到-12年了，而且还在继续！感谢所有参与和帮助计划9和地狱网格的人。仍然没有广告，没有javascript，没有用户跟踪，没有筹款，只有免费的代码和服务。", "note_en": "ANTS is a collection of modifications and additional software which adds new namespace manipulation capabilities to Plan 9. It is free software based on 9front and uses the same licensing, MIT for original code, LPL for modifications of Bell Labs source.26\t             Copyright 2020 Mycroftiv mantsifesto.txt : against hate and bullshit Always on the grid. Often found in various irc channels on freenode Occasionally reachable by email at mycroftiv at sphericalharmony.com 9gridchan.org - twelve years and counting! Thanks to everyone who has participated and helped with Plan 9 and Inferno gridding. Still no ads, no javascript, no user-tracking, no fundraising, just free code and services.", "posttime": "2020-10-13 21:15:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蚂蚁,computing", "title": "基于9计划蚂蚁的网格计算", "title_en": "Grid Computing with Plan 9 Ants", "transed": 1, "url": "http://www.9gridchan.org/", "via": "", "real_tags": ["蚂蚁", "computing"]}, {"category": "", "categoryclass": "", "imagename": "fd9f46aa4835f15455b76ea0541d8b35.png", "infoid": 1028473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天，我在摆弄一些大盘股公司的数据，当我看到这一点时，我相当惊讶：\n现在，我知道英伟达的股票表现不错。我记得在2017年的泡沫中，它与加密货币一起上涨，但当时我主要专注于加密。尽管加密货币仍远低于上一次峰值，但NVIDIA继续飙升。如此之多，以至于与之相比，特斯拉的回归看起来相当疲软！\n我的意思是，当你可以把1美元变成28.5美元的时候，为什么要在短短5年内把1美元变成11美元呢？2015年，你在NVIDIA的投资约为3.5万美元，今天你已经是百万富翁了。还不错!。\n这让我感到惊讶的原因是特斯拉在媒体上和我交谈过的人中得到了太多的炒作。显然，特斯拉的回归值得谈论，但你可能会认为NVIDIA上可能会有更多的报道。\n这表明，即使你是像我这样花了太多时间阅读财经新闻的人，做你自己的分析，找出没有那么多新闻的报道仍然是值得的。\n如果你想帮助支持我的疯狂梦想，有朝一日全职写关于市场的文章，制作更多无穷无尽的指标，也许你可以注册正在进行的内容(如果你还没有)，或者注册一个朋友。别担心--只要你觉得无聊或需要清理收件箱，你就可以取消。我不会把它放在心上的！", "note_en": "I was messing around with some data for large-capitalization companies yesterday and was pretty surprised when I saw this:\n   Now, I know that Nvidia’s stock has done well. I remember that it ran up alongside cryptocurrencies in the 2017 bubble but I was mostly focused on crypto at the time. Even though cryptocurrencies remain well below that last peak, Nvidia has continued to rocket higher. So much so, that it makes Tesla’s return look pretty weak in comparison!\n I mean, why turn 1 dollar into 11 dollars in just five years when you could turn 1 dollar into 28.5? With around a 35,000 dollar investment in Nvidia in 2015, you are a millionaire today. Not bad!\n The reason this surprises me is because of how much hype Tesla gets in the press and in general among people I talk to. Obviously, Tesla’s return is worth talking about but you’d think there might be a little more coverage on Nvidia.\n It goes to show that, even when you are someone like me who spends way too much time reading financial news, it still pays to do your own analysis and find the stories that aren’t seeing as much press.\n           If you want to help support my crazy dream to one day write about the markets full time and produce even more endless metrics, maybe you could sign up for ongoing content (if you haven’t already) or sign up a friend. Don’t worry - you can cancel whenever you decide you’re bored or need an inbox cleanse. I don’t take it personally!", "posttime": "2020-10-13 21:15:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,特斯拉,return", "title": "NVIDIA的回归主导了特斯拉", "title_en": "Nvidia’s Return Dominates Tesla", "transed": 1, "url": "https://endlessmetrics.substack.com/p/nvidias-return-dominates-tesla", "via": "", "real_tags": ["nvidia", "特斯拉", "return"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我作为科学软件开发人员的工作中，我倾向于编写大量代码。大多数没有读过计算机科学学位的人倾向于认为CS“只是”把代码扔到屏幕上，然后运行它。我与我的许多同事和具有其他背景的同事保持着良好的工作关系。…。物理、气候科学、生物学等等。但是，当谈到开发软件时，我得到的明显印象是，人们会想，“嘿，这能有多难呢？我们只需写下几条指令，告诉计算机我们想要做什么，然后点击执行按钮，然后‘砰！’一声，我们就得到了答案！“。\n这种思路的问题在于，编写与您认为的意思不符的指令非常容易。例如，计算机可能完全无法解释您的程序。此外，在不实际执行程序的情况下，几乎无法判断程序是否会真正终止。而且有很多、很多、很多种方法来编写程序，使其执行起来“很慢”。“慢”是…。真的很慢。好像要花一辈子甚至更长的时间才能真正执行。最后一个问题是我在阅读没有接受过CS教育的人编写的软件时最常遇到的问题。解决这个问题是我的工作。\n关于CS，人们没有意识到的一件事是，它教会了你关于计算的理论，可计算性(也就是说，我们真的能计算什么吗？我们经常理所当然地认为我们可以！)，算法复杂性，以及所有的知识、逻辑和分析技术，并帮助您编写一个将在最少的时间或使用最少的空间内运行的程序。\n请允许我向您展示一个巨大的优化示例，这是我对一个同事编写的简单脚本所做的优化。\n在气候科学方面，我们做了大量的缩减工作。我们从粗尺度的全球气候模式网格中获取温度和降水读数，并将其映射到细尺度的局部网格。假设全局网格为50x25，本地网格为1000x500。对于局部网格中的每个网格单元，我们希望知道它对应于全局网格中的哪个网格单元。\n考虑这个问题的一个简单方法是，我们想要最小化L[n]和G[n]之间的距离。因此，执行搜索的简单方法是：\n对于每个局部像元L[i]：对于每个全局像元G[j]：计算L[i]和G[j]之间的距离查找集合L[i]*G中的最小距离返回最小值的索引。\n这看起来很简单。然而，如果你仔细观察，你会注意到你必须做很多额外的工作。根据输入的大小来查看算法。\n对于每个局部像元L[i]：#对每个全局像元G[j]执行此操作L次：#执行此操作L x G次计算L[i]和G[j]之间的距离(D)#执行此L x G次查找集合中的最小距离d[i*j]#读取G个像元L次(开销L x G)查找其像元与最小值匹配的索引#读取G个像元L次(开销L x G)。\nObs.lon&lt；-ncvar_get(nc.obs，&#39；lon&39；)obs.lat&lt；-ncvar_get(nc.obs，&#39；lat&lt；)n.lon&lt；-length(obs.lon)n.lat&lt；-length(obs.lat)obs.lat&lt；-Matrix(obs.lat，nrow=n.lon，nol=n.lat，byrow=true)obs.lon&lt；-Matrix(obs.lon，nrow=n.lon，ncol=n.lat)obs.time&lt；-netcdf.endar(nc.obs)gcm.lon&lt；-ncvar_get(nc.gcm，&#39；lon&39；)-360gcm.lat&lt；-ncvar_get(nc.gcm，&39；lat&39；)gcm.lats&lt；-Matrix(gcm.lat，ncol=length(gcm.lat)，nrow=length(gcm.lon)，byrow=true)gcm.lons&lt；-Matrix(gcm.lon，ncol=length(gcm.lat))gcm.lons.lats&lt；-Matrix(gcm.lon，ncolumn=length(gcm.lat)，nrow=length(gcm.lat)，nrow=length(gcm.lon)，nrow=length(gcm.lon)，nrow=length(gcm.lat)，nrow=length(gcm.lat)。-cbind(c(gcm.lons)，c(gcm.lats))#找出哪些GCM网格框与每个精细网格点相关联#将搜索限制在10度。X 10°。Neighborhooddxy&lt；-10mdist&lt；-function(x，y)Apply(abs(Sweep(data.Matrix(Y)，2，data.Matrix(X)，&#39；-&#39；)，1，sum)nn&lt；-list()for(i in seq_long(obs.lons)){if((i%%500)==0)cat(i，&#39；&#39；)gcm.lims&lt；-((gcm.lons.lats[，1]&gt；=(obs.lons[i]-dxy))&amp；(gcm.lons.lats[，1]&lt；=(obs.lons[i]+dxy))&amp；((gcm.lons.lats[，2]&gt；=(obs.lats[i]-dxy))&amp；(gcm.lons.lats[，2]&lt；=(obs.lats[i]+dxy)gcm.lims&lt；-this(gcm.lims)n.min&lt；-which.min(mdist(c(obs.lons[i]，obs.lats[i])，gcm.lons.lats[gcm.lims，]))nn[[i]]&lt；-gcm.lims[nn.min]}nn&lt；-unlist(Nn)。\n所以，这似乎是一个简单的算法。“只要”计算距离，然后找出最小值。但是按照它的编写方式，随着局部网格单元数量的增加，我们的计算成本也会随着全局网格单元数量的乘积而增加。对于加拿大ANUSPLIN数据，有1068x510个单元格(总共544,680个)，假设我们的GCM有50x25个单元格(总共1250个单元格)。因此，“某个计算单元”中内循环的成本为：\n其中项是对应于计算两点之间的距离、找到最小点和找到数组索引的成本的常量。实际上，我们不太关心常量项，因为它们不受输入大小的影响。所以我们可以把它们聚集在一起，称之为成本；\n这看起来很多，但真的吗？电脑很快，对吧？如果我们运行这个朴素的实现，情况大概是这样的：\n最终耗时1668秒，略低于半小时。\n&gt；source(&#39；BCCA/naive.implementation.R&#39；)500 1000 1500 2000 2500 3000...543000 543500 544000 544500[1]&34；用户系统运行时间为1668.868 8.926 1681.728。\n但是我们需要花30分钟吗？事情是这样的。我们正在比较两个网格，这两个网格都有大量我们没有利用过的结构。例如，粗格网和细格网中的纬度和经度都是按顺序排序的。因此，如果你想搜索一个数字，你不需要查看每一个数字。您可以使用平分算法，在该算法中，您可以查看中间的点，然后决定要搜索阵列的哪一半。那么搜索整个空间只需要花费搜索空间的日志(以2为基数)。\n另一个我们没有利用的主要结构是纬度在维度中重复，而经度在维度中重复。所以不用做一次运算，我们可以做几次。这是一个巨大的优化。\n对于每个LOCAL[x]：BICET_SEARCH(LOCAL[x]，GLOBAL[x])对于每个LOCAL[y]：BIVECT_SEARCH(LOCAL[y]，GLOBAL[y])返回每个维度的搜索结果的二维格网。\n##对*排序后的向量v#返回最接近xfind最近的元素的数组索引。-function(x，v){if(length(V)==1){return(1)}if(length(V)==2){return(which.min(abs(v-x)}mid&lt；-ceuling(length(V)/2)if(x=v[mid]){return(mid)}Else if(x&lt；V[MID]){return(find.NEAREST(x，v[1：MID]))}ELSE{RETURN((MID-1)+find.NEAREST(x，v[MID：Length(V)]))}}regrid.one.dim&lt；-function(粗点，细点){return(sApply(fine.point，find.neest，粗点))}##取纬度和经度的精细比例尺(例如ANUSPLINE)栅格##并找到对应于粗略比例尺(例如GCM)栅格的索引##因为搜索实质上是2维中的最小化距离##我们实际上可以单独在每个维度中独立地搜索(其中##是巨大的优化，使运行时x+y而不是x*y)和##然后重构索引以创建完整的gridregrid.coarse.to.fin.lt；-function(coarse.lats，coarse.lons，fine.lats，fine.lons){xi&lt；-regrid.one.dim(gcm.lon，obs.lon)yi&lt；-regrid.one.dim(gcm.lat，obs.lat)##索引Xi&lt；二维网格-Matrix(xi，ncol=length(fine.lats)，nrow=length(fine.lons)，byrow=F)yi&lt；-Matrix(yi，ncolumn=length(fine.lons)，byrow=T)return(list(xi=xi，yi=yi)}。\n每个平分搜索的成本是输入大小的对数。这次我们的输入大小被划分为X和Y空间，所以我们将为Global、Local、X和Y使用and。\n加上我们的数字，我们估计成本为553,076英镑。55.3万听起来比6.8亿好多了。我们在运行时看到了这一点吗？\n&gt；ptm&lt；-proc.time()；rv&lt；-regrid.coarse.to.Fine(gcm.lat，gcm.lon，obs.lat，obs.lon)；打印(&#39；已用时间&39；)；打印(pro.time()-ptm)[1]&34；用户系统已用时间0.117 0.000 0.117&gt；STR(房车)列表2$Xi：Num[1：1068，1：510]15 15 15...$yi：Num[1：1068，1：510]13 13 13。\n0.117秒。半小时前我们花了近半个小时，现在我们花了一秒钟多一点的时间。\nSoooooo…。我知道我受过做这类工作的训练，我的工作就是知道如何做这类事情。但即使是我也对这种加速是如此显著感到惊讶和自以为是。这是14000倍的加速。\n此脚本过去需要很长时间，因此必须将其输出保存到磁盘，并由科学家手动检查，然后才能继续。现在你一眨眼的功夫就可以计算出来。这是一个我们必须做几百次的计算，这为我们节省了几天到几周的计算时间。它增加了与系统交互的能力，帮助我们从科学家的Time…中获得更多价值。他们不会无所事事地等待计算完成。它就这么做了。\n我应该强调的是，这些史诗般的性能改进是在没有购买任何更大的计算机系统、没有并行化或增加复杂性的情况下出现的…。事实上，更快算法的代码实际上更简单、更可重用！只要阅读代码并对计算复杂性有一定的了解，这几乎是一个全面的胜利。\n由Disqus提供支持的博客评论", "note_en": "In my job as a scientific software developer, I tend to write a lot of code. And most people who haven’t been through a Computer Science degree tend to think that CS is “just” about slinging code at the screen and then running it. I have a good working relationship with many of my colleagues and co-workers with other backgrounds… Physics, Climate Science, Biology, etc. But when it comes to developing software, I get the distinct impression that people think, “Hey, how hard could this be?! We just write down a few instructions about what we want the computer to do, hit the execute button and the, ‘Blamo!’, we get our answer!”\n The problem with that line of thinking is that it’s incredibly easy to write instructions that don’t mean what you think they mean. For example, your program could be completely uninterpretable by the computer. Furthermore, there is literally  no way to tell whether your program will ever actually terminate without actually executing it. And there are many, many,  many, ways to write a program which make it “slow” to execute. “Slow” being… like  really slow. Like it would take your entire lifetime or more to actually execute it. This final problem is one that I see most often when reading software written by people without a CS education. And fixing that is my job.\n The thing about CS that people don’t realize is that it teaches you about the theory of computation, computability (i.e. can we actually compute something? We often take for granted that we can!), algorithm complexity, and all of the knowledge, logic and analysis techniques and help you compose a program that will run in the minimum amount of time or using the minimum amount of space.\n Allow me to show you an example of a huge optimization that I made to a simple script written by a colleague.\n In climate science we do a lot of downscaling. We take temperature and precipitation readings from a coarse scale Global Climate Model grid and map them to a fine scale local grid. Let’s say the global grid is 50x25 and the local grid is 1000x500. For each grid cell in the local grid, we want to know to which grid cell in the global grid it corresponds.\n A simple way to think about this is that we want to minimize the distance between L[n] and G[n]. So a simple way to do the search would be:\n for each Local cell L[i]: for each Global cell G[j]: compute distance between L[i] and G[j] find the minimum distance in the set L[i] * G return the index of the minimum\n It seems simple enough. However, if you look closely, you’ll notice that you have to do a  lot of extra work. Look at the algorithm in terms of the size of the input.\n for each Local cell L[i]: # Do this L times for each Global cell G[j]: # Do this L x G times compute distance (d) between L[i] and G[j] # Do this L x G times find the minimum distance in the set d[i*j] # Read G cells L times (cost L x G) find the index whose cell matches the minimum # Read G cells L times (cost L x G)\n  obs.lon &lt;- ncvar_get(nc.obs, &#39;lon&#39;)obs.lat &lt;- ncvar_get(nc.obs, &#39;lat&#39;)n.lon &lt;- length(obs.lon)n.lat &lt;- length(obs.lat)obs.lats &lt;- matrix(obs.lat, nrow=n.lon, ncol=n.lat, byrow=TRUE)obs.lons &lt;- matrix(obs.lon, nrow=n.lon, ncol=n.lat)obs.time &lt;- netcdf.calendar(nc.obs)gcm.lon &lt;- ncvar_get(nc.gcm, &#39;lon&#39;)-360gcm.lat &lt;- ncvar_get(nc.gcm, &#39;lat&#39;)gcm.lats &lt;- matrix(gcm.lat, ncol=length(gcm.lat), nrow=length(gcm.lon), byrow=TRUE)gcm.lons &lt;- matrix(gcm.lon, ncol=length(gcm.lat), nrow=length(gcm.lon))gcm.lons.lats &lt;- cbind(c(gcm.lons), c(gcm.lats))# Figure out which GCM grid boxes are associated with each fine-scale grid point# Confine search to 10 deg. x 10 deg. neighbourhooddxy &lt;- 10mdist &lt;- function(x, y) apply(abs(sweep(data.matrix(y), 2, data.matrix(x), &#39;-&#39;)), 1, sum)nn &lt;- list()for (i in seq_along(obs.lons)) { if((i %% 500)==0) cat(i, &#39;&#39;) gcm.lims &lt;- ((gcm.lons.lats[,1] &gt;= (obs.lons[i]-dxy)) &amp; (gcm.lons.lats[,1] &lt;= (obs.lons[i]+dxy))) &amp; ((gcm.lons.lats[,2] &gt;= (obs.lats[i]-dxy)) &amp; (gcm.lons.lats[,2] &lt;= (obs.lats[i]+dxy))) gcm.lims &lt;- which(gcm.lims) nn.min &lt;- which.min(mdist(c(obs.lons[i], obs.lats[i]), gcm.lons.lats[gcm.lims,])) nn[[i]] &lt;- gcm.lims[nn.min]}nn &lt;- unlist(nn)\n So, it seems like a simple algorithm. “Just” compute the distances and then find the minimum. But the way it was written, as the size of the number of local cells grows, our cost of computation grows by its product with the number of global grid cells. For Canadian ANUSPLIN data, there are 1068 x 510 cells (for a total of 544,680) and let’s say that our GCM has 50 x 25 cells (for a total of 1,250 cells). So the cost of the inner loop in “some computational unit” is:\n where the  terms are constants that correspond to the cost of computing a distance between two points, finding the minimum point, and finding an array index. Really, we don’t care (much) about the constant terms, because they are not affected by the size of the input. So we can just clump them together and call the cost;\n   That  seems like a lot, but is it? Computers are fast, right? If we run the naive implementation that’s something like this:\n it ends up taking 1668 seconds which is a little less than half an hour.\n &gt; source(&#39;BCCA/naive.implementation.R&#39;)500 1000 1500 2000 2500 3000 ... 543000 543500 544000 544500 [1] &#34;Elapsed Time&#34; user system elapsed 1668.868 8.926 1681.728\n But do we  need for it to take 30 minutes? Here’s the thing. We’re comparing two grids together, both of which have tons of structure that we haven’t taken advantage of. For example the latitudes and longitudes in both the coarse and the fine grid are in sorted order. So if you want to search for a number, you don’t have to look at every single number. You can use a bisect algorithm where you look at the point in the middle and then decide which half of the array you want to search. Then searching the full space only costs you the log (base 2) of the search space.\n The other major structure that we haven’t taken advantage of is the fact that the latitudes repeat themselves in the  dimension and the longitudes repeat themselves in the  dimension. So instead of doing an operation  times, we can do it  times. That’s a  huge optimization.\n  For each local[x]: bisect_search(local[x], Global[x])For each local[y]: bisect_search(local[y], Global[y])return a 2d grid of the search results for each dimension\n  ## Perform a binary search on the *sorted* vector v## Return the array index of the element closest to xfind.nearest &lt;- function(x, v) { if (length(v) == 1) { return(1) } if (length(v) == 2) { return(which.min(abs(v - x))) } mid &lt;- ceiling(length(v) / 2) if (x == v[mid]) { return(mid) } else if (x &lt; v[mid]) { return(find.nearest(x, v[1:mid])) } else { return((mid - 1) + find.nearest(x, v[mid:length(v)])) }}regrid.one.dim &lt;- function(coarse.points, fine.points) { return(sapply(fine.points, find.nearest, coarse.points))}## Take a fine scale (e.g. ANUSPLINE) grid of latitudes and longitudes## and find the indicies that correspond to a coarse scale (e.g. a GCM) grid## Since the search is essentially a minimizing distance in 2 dimensions## We can actually search independently in each dimensions separately (which## is a huge optimization, making the run time x + y instead of x * y) and## then reconstruct the indices to create a full gridregrid.coarse.to.fine &lt;- function(coarse.lats, coarse.lons, fine.lats, fine.lons) { xi &lt;- regrid.one.dim(gcm.lon, obs.lon) yi &lt;- regrid.one.dim(gcm.lat, obs.lat) ## Two dimensional grid of indices xi &lt;- matrix(xi, ncol=length(fine.lats), nrow=length(fine.lons), byrow=F) yi &lt;- matrix(yi, ncol=length(fine.lats), nrow=length(fine.lons), byrow=T) return(list(xi=xi, yi=yi))}\n The cost for every bisection search is the log of the input size. Our input size is divided into X and Y space this time, so we’ll use , and  for Global, Local, X and Y.\n Plugging in our numbers this gives us a cost estimate of 553,076. 553 thousand sounds a lot better than 680 million. Do we see that in the run time?\n &gt; ptm &lt;- proc.time(); rv &lt;- regrid.coarse.to.fine(gcm.lat, gcm.lon, obs.lat, obs.lon); print(&#39;Elapsed Time&#39;); print(proc.time() - ptm)[1] &#34;Elapsed Time&#34; user system elapsed 0.117 0.000 0.117 &gt; str(rv)List of 2 $ xi: num [1:1068, 1:510] 15 15 15 15 15 15 15 15 15 15 ... $ yi: num [1:1068, 1:510] 13 13 13 13 13 13 13 13 13 13 ...&gt;\n 0.117 seconds. What took us almost half an hour before, now takes us a little over  of a second.\n  Soooooo… I know that I’m trained to do this kind of work and it’s my job to know how to do these types of things. But even  I’m surprised and self-impressed at how significant that speedup is. That’s a  14 thousand times speedup.\n This script used to take so long that it had to save its output to disk and be manually checked by a scientist before proceeding. Now you can compute it in the blink of an eye. This is a computation that we have to do hundreds of times, and this saves us days to weeks of computation time. And it increases the ability to interact with the system, helping us to get more value out of our scientists’ time… they’re not sitting around waiting for a computation to finish. It just does it.\n I should emphasize that these epic performance improvements come without buying any larger computer systems, no parallelization or increase in complexity… in fact the code for the faster algorithm is actually simpler and more reusable! It’s pretty much an all around win, just by reading the code and having some knowledge of computational complexity.\n          blog comments powered by  Disqus", "posttime": "2020-10-13 20:54:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加速,science,搜索", "title": "加速倍数为14,000倍，也就是。获胜的计算机科学", "title_en": "14,000x Speedup a.k.a. Computer Science for the Win", "transed": 1, "url": "http://james.hiebert.name/blog/work/2015/09/14/CS-FTW.html", "via": "", "real_tags": ["加速", "science", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "2b2d76ef909167403d327f492f644b3f.jpeg", "infoid": 1028470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在上一篇文章中，我已经解释了符号操作的速度如何增强我们的智力。今天，我将介绍我设计的一个界面，它将我的打字速度提高了3倍，改变了我计划项目的方式，并帮助我培养了一种成长的心态。\n快捷方式如何帮助发现新知识、在几分钟内规划项目并培养增长心态。\n那是因为我们的键盘就是这样设计的。无论你花多少时间在健身房，举重你的左拇指，你都有一个明显的速度限制，你不能超过这个限制。你只有十个手指。\n但是很少有人知道为什么键盘是这样设计的。如果我们想超越键盘的速度，我们首先需要了解我们是如何走到今天这一步的。\n没错。第一个“打字机”，由Christopher Sholes在146年前设计，使用的QWERTY键盘与你面前的完全相同。\n他的机器有一个机械装置，在酒吧的末端有字符。当按键被敲击时，联动装置会将杆摆动成涂有墨水的胶带。当人物打到磁带上时，人物的印象就转移到纸上了。\n问题是，铁棒相互碰撞，相互卡住。这就是为什么克里斯托弗把钥匙用最常见的字母排列在难以到达的地方。他决定放慢打字员的速度，以防止横杆堵塞。\n但这是情有可原的。克里斯托弗无法想象三分之一的人类每天都在使用他的发明达数小时之久。他生活在150年前，当时打字甚至还不是一项技能，因为打字机还不存在。\n在“打字机”上市后的68年里，没有人在乎速度。\n安德伍德打字机非常畅销。到1939年，他们卖出了500万台，而这只是个开始。\n1936年5月12日，奥古斯特·德沃夏克和他的妹夫威廉为一种设计更好的键盘提交了一项专利，这种键盘可以减少打字错误，提高打字速度，并减轻打字员的疲劳。\n他们的想法是最大限度地减少手指移动的距离。为了做到这一点，奥古斯特将所有最常用的字母都放在了首页的第一排-这样你的手指就不需要移动就可以点击这些键。\n奥古斯特和威廉还改进了元音和辅音的位置。他们把所有的元音都放在左手上，让右手只操纵辅音。这使得速度至少提高了2倍，因为在德沃夏克键盘上只用一只手就能打字的英语单词很少(好奇的人可以把这两个单词分别称为“木瓜”和“不透明”)。\n下面您可以看到在DVORAK上而不是在QWERTY上键入时，每个手指所做的工作量：\n时机太糟糕了。在大萧条期间，大多数公司没有现金购买新的打字机。当第二次世界大战开始时，许多打字机厂关闭了所有打字机的生产-包括采用德沃夏克布局的打字机。\n尽管受过德沃夏克培训的打字员因“不公平的优势”而被禁止参加打字比赛，但QWERTY的布局在人们心目中却是“正常的”。一旦事情变得“正常”，我们就会忘记为什么要做这件事。\n儿媳妇正在做饭。她从当地杂货店买了一些香肠，准备煮了。但只要她拿起第一个扔进锅里的，丈夫的妈妈就出现了。\n母亲从女儿手中拿出香肠，把它切成两半，扔进沸腾的锅里。\nM：“因为如果你把它们切成两半，它们最后会变得又软又多汁。我妈妈一直都在这么做，她不会错的。“。\nD：“嗨，奶奶，我们昨晚做了一些香肠，妈妈开始把它们切成两半。我问她为什么，她说那是因为你这么做很多年了。把它们切成两半有什么意义？“。\n医生：“哦，真的……。好吧。为什么这是正确的烹调方式？“。\n旅客：“你知道，如果你把它们切成两半，它们最终不会变干，不会变得很难咬。但是我记得，我妈妈已经做了几十年了，所以我只是从她那里学来的。妈妈不会错的。“。\n为了找出最终的原因，女儿去找了住在离小镇数百英里远的一位103岁的祖母。\nD：“嗨，奶奶，我们在做晚餐用的香肠，妈妈开始把它们切成两半。我问过有什么意义，但她不知道，甚至你女儿也说是从你那里学来的。你该死的为什么要把香肠切成两半？“\nGG：“哦，亲爱的，你还在这么做吗？我不得不把它们切成两半，因为它们放不进我的小罐子…。“。\n第一台打字机由于其机械性质，每个键只有一个符号。您无法将其编程为一次按键即可键入一个单词、单词组合或整个句子。它必须是通用的，这样每个人都可以输入他们想要的内容。\n提高打字速度的方法不是提高打字速度，而是重新思考打字到底是什么。\n如果您的电子邮件客户端不支持GIF，请单击图像，它将在您的浏览器中打开。\n40个字，总共23秒。我不知道你有没有注意到，其实我停下来喝了一小口咖啡。\n如果您为最常用的单词设置快捷方式，以减少您必须键入的符号数量，则可以将您的打字速度提高3倍。\n以下是它在Mac OS或iOS上的工作方式。当您键入一个符号，即“rr”或“wd”并按空格键时，系统会相应地将您的输入转换为“记住”或“将是”。您可以在设置/键盘/文本替换中设置这些对。\n快捷方式适用于您的iPhone。当你每天花2-4个小时在iPhone上，打字速度至少慢了几倍时，使用快捷方式来加快输入过程是很有用的。\n快捷键处理撇号。你可以有一个“不要”的快捷键，然后变成“不要”。这样就完全不需要按撇号键了。\n快捷键可以防止打字错误。打字错误来自单词type，意思是一个接一个地按键。当你使用快捷键时，你不用打字。如果你不打字，那你就不会有打字错误。\n快捷键简化了盲打。盯着屏幕看的时候，要把“进步”这个词的全部11个符号都弄对，需要刻意练习和非凡的运动技能。但是如果你输入两个符号，“pg”，而不是11个，你会犯更少的错误。\n快捷方式可让您立即查找相关信息。如果你有一台带键盘的iPad，你可以通过按Cmd+空格键和快捷键从Notes和其他应用程序中查找内容。它是这样运作的：\n快捷方式可以加快您的书写速度。当您开始广泛使用快捷键时，您会注意到您也会在手写中使用它们。之所以会发生这种情况，是因为您记住了符号背后的含义。而且，由于手写甚至比在146年前的键盘上打字还要慢，与草草写下完整的单词和句子相比，这会带来巨大的速度优势。\n捷径可以加速你的思考。不可避免地，你也会开始走捷径思考。这样的想法，比如“我能给这个OL做TTS吗？”(“我可以用我的三屏三屏写作方法写这篇论文提纲吗？”)。开始冒出来。\n我可以推测，在每天使用快捷方式5-10个小时的三年后，我的思维过程变得明显快了很多。这不仅是因为符号更小，还因为快捷方式压缩了知识。它们作为动态指针，指向我大脑中存储意义的区域。\n这意味着我正在攀登信息的阶梯，就像一个棋手从业余发展到特级大师一样。\n两者之间的区别是，一个业余选手计算棋盘上个人人物的走法，而特级大师可以与十个人盲棋，因为他操作的信息单元不同。这位特级大师不仅在组合和位置上思考，甚至在整个比赛中都在思考。\n自下而上。不要只下载300个最流行的英语单词，而要根据你独特的需求来创建快捷方式。这意味着，\n寻找一些重要的词语。你必须成为你自己打字的夏洛克。每当你抓到一个经常打字的大字时，就去为它设置一个快捷方式。这个词越大，你得到的好处就越多。例如，您可以将单词“渐进式”转换为“PG”快捷键。这减少了需要键入5倍的符号数量，并消除了任何打字错误的可能性。\n寻找复杂的单词。任何需要特殊符号、大写字母或撇号的内容都必须转换为快捷方式。例如，我为“I‘ve”设置了“ve”的快捷方式，每次我写这个词时都会少键入两个符号。\n考虑到人体工程学的设计快捷方式。你必须让他们尽可能方便才能真正快起来。因此，对于包含两个符号的快捷键，您需要在键盘的不同部分使用两个符号。这样就可以用两个或三个不同的手指而不是一个手指来键入快捷键。\n使用单词的前两个字母使快捷方式易于记忆。第一个和最后一个字母也可以。但是如果你设置了一条对你毫无意义的捷径，你就不会记得了。快捷键只有在你使用的时候才有帮助。例如，我用“ab”表示“大约”，用“rd”表示“已实现”。对于单词组合，使用两个单词的第一个字母；例如，我有一个“fe”快捷键，它可以转换为“例如”和“ac”快捷键，在我按下空格键后，它就变成了“自动复合”。\n为同一个单词设计不同的快捷键变体。当你开始以三倍的速度打字时，你将不可避免地面临一个系统没有按正确的顺序拾取按键的情况。因此，对同一个词使用同一快捷键的不同变体是很有用的。例如，我把“dnt”和“don”都扩展成了“don”。\n想象一下，你是一位世界级的神经外科医生，他需要修复自己大脑中的某些东西。不管你有多棒，你都不会想砍自己的头，是吗？\n分析你的想法而不把它们写下来，就像在你自己的大脑上做手术一样。你不是为此而生的。你需要把你的想法集中在空间和时间上，才能对它们进行推理。\n要在写作中分析你的想法，你需要提出问题。但是很难在你最需要的时候提出正确的问题。在这一点上，你需要已经想过了。\n快捷方式减少了在正确的时间提取正确的信息的认知负担。它们很容易记住，因为简短的东西更容易记住(这就是齐普夫定律；这就是为什么我们有NBA，英国和美国)。\n掌握捷径并写下你的想法来分析它们，就像邀请一位外科医生伙伴来修理你的头一样。这会带来发现新知识、更好的规划技能和发展成长心态。\n假设你正漫步在街上，看到一则吸引你注意的广告。广告上说拐角处有一家新开的意大利餐厅，请过来吃点意大利菜。\n如果你对广告感兴趣，那么你最好把这一条保存起来以备参考。你给它拍一张照片，写一张简短的便条，然后把它放在一些“漂亮的广告”文件夹里。\n他们错过了知识发现过程中最关键的部分：找出事实背后的原则。\n在广告故事中，原理可能是将知名国家与人们与这些国家联系在一起的食品结合在一起的广告比其他广告表现更好。人们对这些地方或与之相关的隐喻有隐含的记忆(这意味着在没有主动思维的情况下获得)。\n例如，如果选择的国家是法国，那么广告可能是“酥脆的法式牛角面包配杏仁奶油”；如果是意大利，那么我们就会得到“新鲜出炉的意大利比萨配马苏里拉奶酪和西红柿”。\n如果你有一个“wp”快捷键，它会转换成一个问题“这背后的原则是什么？”那么你更有可能开始思考这些事情，因为你不需要花时间来提出一个问题。\n计划比执行更重要，因为它定义了要做什么。如果你有一组快捷方式-问题对用于计划，你会立即处理来自世界的输入，并将它们转化为行动。\n如果你有捷径，那么你可以在手机上快速创建便条，在路上计划项目，而不是在日历上划出时间段坐下来思考这些事情。\n随着工作的扩展，填满了所有可用于完成工作的时间，这成为了一个有用的习惯，它会立即产生两分钟的行动，帮助你发现宝贵的信息，以更快地完成事情。\n以下是在旅途中进行快速项目计划的有用快捷方式列表：\n事情就是这样，做正常的事情是不可能达到不正常的结果的。\n但很少有人真正想到是什么驱使离群者如此努力地工作。我相信这是因为这些人中的大多数人都有他们所说的增长心态。他们总是寻找改进的机会，而不是固守已有的东西。他们不会因为自己的不幸而责怪每个人和他的兄弟，而是采取行动变得更好。\n但最有趣的问题是如何培养一种增长心态。你不能只是想，“哦，我想要这种成长心态”，然后当场就做到了。如果这是真的，那么励志教练早就统治世界了。\n培养成长心态的方法是设计一个能帮助你变得更具分析性的系统。创造出改变你思考方式的工具。\n快捷键在这里又有帮助了。您可以设计快捷方式，让您动态分析情况，反思它们，并提高您的改进能力。\n例如，当你感觉不好的时候，你可以打开一张便条，问你自己以前已经想到的正确的问题。这个简单的行为可以让你分析情况并收集宝贵的数据(例如，“这种崩溃的诱因是什么”或“我为什么会有这种感觉”)。\n“WBM”-我可能需要学习什么，或者下一次我可能会使用什么策略来获得更好的结果？\n请注意，所有它们都以“w”开头；这就是我如何使它们易于记忆的方法。\n他认为我们所做的每一项活动都包括要采取的几个身体步骤。例如，发送电子邮件的流程层次结构包括思考主题、在纸上起草想法、撰写实际的电子邮件副本，然后将其发送给合适的人。\nDoug认为，如果您增加流程层次的一个步骤，那么它将改变许多不同的事情-而且通常是以您无法想象的方式，因为存在二阶效应(这意味着由更改引起的更改)。\n符号操作是一项基本的活动。它是数百个流程层次的一部分，从起草新项目的想法到反映您的感受。因此，引入快捷键的一个小改变就会在存在(或可能存在)符号操作的所有区域中产生巨大的结果。\n有一些有用的事情你可以在书面上做，但你不能做，因为要记住它们或打字需要花费太多的努力。这就是为什么3倍速度只是冰山一角的原因。\n把快捷键看作是一种工具。因为没有最好的锤子，只有熟练的木匠，所以也没有最好的捷径。\n对你来说最有价值的捷径将是你自己发明的捷径。\n附注：如果您想知道键盘之后的更多信息，请回复。我正在对键的深度、按键的长度和不同的单词类型组合进行调整，以进一步改进这个系统。\n如果你回答下面的问题，你会通过神经发生在你的头上产生新的神经元。但是如果你不这样做，你明天就会忘记你刚刚读到的80%的内容。", "note_en": "In the last post, I’ve explained how the speed of symbol manipulation  augments our intellect. Today, I will describe an interface I’ve designed that increased my typing speed 3x, changed how I plan projects, and helped me develop a growth mindset.\n  How shortcuts help to discover new knowledge, plan projects in minutes and develop a growth mindset\n      That’s because our keyboard is designed that way. No matter how much time you spend in the gym, weightlifting your left thumb, there’s an apparent speed limit beyond which you can’t go. You’ve only got ten fingers.\n But very few people know  why the keyboard is designed that way. And if we want to go beyond the speed of the keyboard, we need to first understand how we ended up here.\n       That’s right. The very first “Type-Writer,” designed by Christopher Sholes 146 years ago, used the exact same QWERTY keyboard that‘s in front of you.\n  His machine had a mechanism with characters at the end of a bar. When a key was struck, a linkage would swing the bar into a tape coated with ink. And when the character hit the tape, the impression of the character was transferred onto the paper.\n The problem was that bars were colliding with each other and jamming. That’s why Christopher arranged the keys with the most common letters in hard to reach spots. He decided to slow typists down to prevent bars from jamming.\n But that’s excusable. Christopher couldn’t have imagined one-third of humankind using his invention every day for hours. He lived 150 years ago when typing was not even a skill because typewriters didn’t exist.\n And for the next 68 years after the “Type-Writer” hit the market, nobody cared about the speed.\n    The Underwood typewriter was selling like hotcakes. They reached 5 million units sold by 1939, and that was just the beginning.\n On May 12th, 1936, August Dvorak and his brother-in-law, William, submitted a patent for a better-designed keyboard that decreased typing errors, advanced typing speed, and lessened typist fatigue.\n   Their idea was to minimize the distance traveled by the fingers. To do that, August placed all the most commonly used letters in the home row—so that your fingers don’t have to move at all to hit these keys.\n August and William also improved how vowels and consonants are located. They put all the vowels to be used by the left hand and made the right hand to manipulate only consonants. This enabled at least 2x speed improvement as there are very few words in the English language that can be typed with only one hand on the Dvorak keyboard (for the curious, the two are “papaya” and “opaque”).\n Below you can see how much work each of the fingers does when typing on Dvorak instead of QWERTY:\n   The timing was terrible. Amid the Great Depression, most companies didn’t have the cash to buy new typewriters. And when World War II started, many typewriter plants shut down manufacturing of all typewriters—including ones with Dvorak layouts.\n  Despite Dvorak-trained typists getting banned from typing contests for “unfair advantage,” the QWERTY layout got deep into people’s minds as “normal.” And as soon as something gets “normal,” we forget  why we do the thing in the first place.\n    The daughter-in-law is cooking dinner. She’s got some sausages from the local grocery store and is ready to boil them. But as soon as she takes the first one to throw it into the pot, the husband’s mom shows up.\n The mother pulls the sausage from the daughter’s hands, cuts it in half, and throws into the boiling pot.\n      M: “Because if you cut them in half, they end up being soft and juicy. And my mom has been doing that all the time, and she can’t be wrong .”\n   D: “Hey grandma, we were cooking some sausages last night, and mom started cutting them in half. I asked why and she said that’s because you’ve been doing that for years. What’s the point of cutting them in half??”\n  D: “Oh, really... Okay. And why is this the right way to cook them?”\n G: “You know, if you cut them in half, they don’t end up being dry and tough to bite. But as I remember, my mom has been doing that for decades, so I just picked it up from her. Mom can’t be wrong.”\n To discover the ultimate why, the daughter goes to the grand-grandmother, a 103-year-old woman living hundreds of miles away from the town.\n  D: “Hey granny, we were doing sausages for dinner, and mom started cutting them in half. I’ve asked what’s the point, but she doesn’t know, and even your daughter said that she picked it up from you. WHY IN THE HELL DID YOU CUT SAUSAGES IN HALF???”\n GG: “Oh honey, are you still doing that? I had to cut them in half because they didn’t fit in my tiny pot…”\n  The first typewriter had only one symbol per key because of its mechanical nature. You couldn’t program it to type one word, a combination of words, or an entire sentence for one press of a key. It had to be universal so that everybody could type what they want.\n    The way to type faster is not to increase the typing speed but to rethink what typing actually is.\n   If your email client doesn’t support GIF, click on the image, and it will open in your browser.\n 40 words; 23 seconds in total. I don’t know if you noticed but I actually stopped for a second to sip my coffee.\n     You can 3x your typing speed if you set up shortcuts for most frequently used words to decrease the number of symbols you have to type.\n Here’s how it works on Mac OS or iOS. When you type a symbol, i.e., “rr” or “wd,” and press a space bar, the system transforms your input into “remember” or “would be” accordingly. You can set up these pairs in Settings/Keyboard/Text Replacement.\n  Shortcuts work on your iPhone. As you spend 2-4h a day with your iPhone and type at least a few times slower, it’s useful to have shortcuts to speed up your input process.\n Shortcuts take care of apostrophes. You can have a “dont” shortcut that turns into “don’t.” This removes the necessity to press the apostrophe key at all.\n Shortcuts prevent typos. Typos come from the word type, which means pressing keys one after another. When you do shortcuts, you don’t type. And if you don’t type, then you don’t have typos.\n Shortcuts simplify blind typing. Getting all eleven symbols of the word “progressive” right when staring at a screen requires deliberate practice and exceptional motor skills. But if you type two symbols, “pg,” instead of eleven, you will make fewer errors.\n Shortcuts let you instantly look up relevant information. If you have an iPad with a keyboard, you can look up stuff from Notes and other apps by pressing Cmd+Space and hitting your shortcut. Here’s how it works:\n  Shortcuts speed up your handwriting. When you start using shortcuts extensively, you’ll notice that you also use them in handwriting. This happens because you remember the meaning behind the symbol. And as handwriting is even slower than typing on a 146-year-old keyboard, this yields enormous speed benefits compared to scribbling full words and sentences.\n Shortcuts speed up your thinking. Inevitably, you will start thinking in shortcuts as well. Thoughts such as “Can I TTS this OL?” (“Can I use my three three screens writing method for this essay outline?”) begin to pop up.\n I can speculate that after three years of using shortcuts every single day for 5-10 hours, my thought process became significantly faster. That’s not only because of smaller symbols but also because shortcuts compress knowledge. They serve as dynamic pointers to the territory in my brain where the meaning is stored.\n This means that I’m climbing up the ladder of information just like a chess player does when he progresses from being an amateur to a grandmaster.\n The between the two is that an amateur calculates moves of individual figures on the board, and the grandmaster can play blind chess with ten people because he operates different information units. The grandmaster thinks not only in combinations and positions but even in entire games.\n   Go bottoms-up. Don’t just download 300 most popular English words but make shortcuts based on your unique needs. This means,\n Look for big words. You must become the Sherlock of your own typing. Whenever you catch a big word that you type often, go ahead and set up a shortcut for it. The bigger the word, the more benefit you get. For example, you can take the word “progressive” and turn it into a “pg” shortcut. This reduces the number of symbols you need to type 5x and removes any possibility of typos.\n Look for complex words. Anything that requires special symbols, capital letters, or apostrophes must be turned into shortcuts. For example, I have “ive” shortcut for “I’ve” and type two symbols less each time I get to write this word.\n Design shortcuts with ergonomics in mind. You must make them as convenient as possible to get really fast. Thus, for a two-symbol shortcut, you need two symbols in different parts of the keyboard. This enables typing the shortcut with two or three different fingers instead of one.\n Use the first two letters of the word to make shortcuts easy to remember. The first and last letter will do as well. But if you set up a shortcut that doesn’t make sense to you, you won’t remember it. And shortcuts only help if you use them. For example, I have “ab” for “about” and “rd” for “realized.” For word combos, use first letters of both words; for example, I have a “fe” shortcut that transforms into “for example” and “ac” shortcut that becomes “auto compound” after I hit the space bar.\n Design different variations of a shortcut for the same word. When you start typing three times faster, you will inevitably face a system not picking up keys in the right order. Therefore, it’s useful to have different variations of the same shortcut for the same word. For example, I have both “dnt” and “dont” expanding into “don’t.”\n   Imagine that you are a world-class neurosurgeon who needs to fix something in his own brain. No matter how good you are, you wouldn’t want to cut your own head, would you?\n  Analyzing your thoughts without writing them down is like doing surgery on your own brain. You’re not designed to do that. You need to fixate your thoughts in space and time to be able to reason about them.\n To analyze your thoughts in writing, you need to ask questions. But it’s hard to come up with the right questions when you need them most. By that point, you need to have already thought.\n Shortcuts reduce the cognitive load of pulling out the right information at the right time. And they’re easy to recall because short things get remembered better (this is called the Zipf’s law; that’s why we have NBA, UK, and the US).\n Mastering shortcuts and writing down your thoughts to analyze them is like inviting a surgeon-buddy to fix your head. This leads to discovering new knowledge, better planning skills, and developing a growth mindset.\n   Let’s say you’re wandering down the street and see an ad that catches your attention. The ad says there’s this new Italian place around the corner so please come by and have some Italian stuff.\n If you’re into ads, then you want to save this one for reference. You take a picture of it, write a short note, and put it in some “nice ads” folder.\n   They miss the most critical part of the knowledge discovery process; to identify the principle behind the fact.\n In the ad story, the principle might be that ads that combine well-known countries with foods that people associate with these countries perform better than other ads. People have implicit memories (this means acquired without proactive thought) about these places or metaphors that connect to them.\n For example, if the country of choice is France, then the ad might be “the crispy french croissant with almond cream,”; and if it’s Italy, then we get “freshly baked Italian pizza with mozzarella and tomatoes.”\n And if you have a “wp” shortcut that transforms into a question “what’s the principle behind this?” then you’re more likely to start thinking about these things because it takes you no time to present yourself with a question.\n     Planning is more important than execution because it defines what to do. If you have a set of shortcut-question pairs for planning, you instantly process inputs from the world and turn them into actions.\n  If you have shortcuts, then you can quickly create a note on your phone and plan the project on the go instead of carving out time slots on your calendar to sit down and think through these things.\n As work expands to fill all the time available for its completion, this becomes a useful habit that immediately yields  two-minute actions that help you discover invaluable information to get the thing done faster.\n Here’s a list of useful shortcuts for rapid project planning on the go:\n    That’s just how it is; you can’t achieve abnormal results by doing normal things.\n But very few people have actually thought what drives outliers to work so hard. I believe it’s because most of these people have what they call a growth mindset. They always look for an opportunity to improve instead of being fixed on what they’ve got. They don’t blame everybody and his brother for their misfortunes but take action to become better.\n But the most interesting question of all is how to develop a growth mindset. You can’t just think, “oh, I want this growth mindset thing” and get it right then and there. If this were true, then motivational coaches would already rule the world.\n The way to develop a growth mindset is to design a system that helps you become more analytical. To create tools that change how you think.\n Shortcuts help here again. You can design shortcuts that let you analyze situations on the fly, reflect on them, and improve your ability to improve.\n For example, when you feel bad, you can open a note and ask yourself the right questions that you’ve already thought of before. This simple behavior lets you analyze the situation and collects precious data (i.e., “what were the triggers of this breakdown” or “why am I feeling this way”).\n  “wbm”—What might I need to learn, or what strategies might I use the next time to get better results?\n Note that all of them begin with “w”; that’s how I make them easy to remember.\n   He thought that every activity that we perform consists of several physical steps to be taken. For example, the process hierarchy of sending an email consists of thinking about the topic, drafting ideas on paper, writing the actual email copy, and sending it to the right person.\n Doug believed that if you augment one step of the process hierarchy, then it changes many different things—and often in ways you couldn’t have imagined because of the second-order effects (this means a change that is caused by a change).\n Symbol manipulation is a fundamental activity. It’s a part of hundreds of process hierarchies from drafting thoughts about a new project to reflecting on how you feel. Thus, a small change in introducing shortcuts yields enormous outcomes in all areas where symbol manipulation is present (or might be present).\n There are useful things you can do in writing that you don’t do because it takes too much effort to remember all of them or to type them. That’s why 3x speed is only the tip of the iceberg.\n Think of shortcuts as a tool. As there’s no best hammer but a skilled carpenter, there are no best shortcuts as well.\n The most valuable shortcuts for you will be the shortcuts that you will invent yourself.\n P.s. If you’re curious to hear more on what’s next after keyboard, reply back. I’m tinkering with the depth of keys, length of presses, and different word type combinations to further improve this system.\n     If you answer the questions below, you will create new neurons in your head through neurogenesis. But if you don’t, you will forget about 80% of what you just read tomorrow.", "posttime": "2020-10-13 20:53:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打字速度,increased,需要", "title": "提高我打字速度的工具", "title_en": "A tool that increased my typing speed", "transed": 1, "url": "https://vasilishynkarenka.com/how-to-type-3x-faster/", "via": "", "real_tags": ["打字速度", "increased", "需要"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028468, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "提取完整的HTML/文本内容", "note_en": "Extracts Full HTML/Text content", "posttime": "2020-10-13 20:52:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新闻,news,文本", "title": "A.I.Powered新闻摘录API", "title_en": "A.I. Powered News Extract API", "transed": 1, "url": "https://pipfeed.com/news-extract-api/", "via": "", "real_tags": ["新闻", "news", "文本"]}, {"category": "", "categoryclass": "", "imagename": "2aaf941125755e45635e6fb41a4b7626.png", "infoid": 1028467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "引用这个比林斯基A，伊曼纽尔·艾杰。新冠肺炎与美国和18个比较国家的超额全因死亡率。贾玛。2020年10月12日在线发布。Doi：10.1001/jama.2020.20717。\n美国2019年死于冠状病毒病的人数比其他任何国家都多(新冠肺炎)，并且是累计人均死亡率最高的国家之一。1、2一个悬而未决的问题是，美国的高死亡率在多大程度上是由预防和患者管理改善之前病例的早期激增与较差的长期反应造成的。3我们比较了2020年美国新冠肺炎死亡和超额全原因死亡率(VS2015-2019年)与18个国家和地区的新冠肺炎反应不一的情况。\n我们将美国与人口超过500万、人均国内生产总值(GDP)超过25000亿美元的经济合作与发展组织(OECD)国家进行了比较。对于每个国家，我们计算了新冠肺炎的人均死亡率，并根据死亡率对国家进行了分组：(1)低(新冠肺炎死亡，&lt；5/10万 000)，(2)中等(5-25/100 000)，(3)高(&gt；25/100 000)。1我们使用泊松回归进行国家间的比较。\n我们计算了在3种情况下每个国家和美国之间新冠肺炎死亡人数的差异：如果美国从疫情开始(2月13日)起对每个国家的人均新冠肺炎死亡率与2010年9月19日(第38周)相当，或者如果美国的死亡率从5月10日或6月7日开始与其他国家相当，以便为政策干预留出滞后时间。3(有关公式，请参阅附录。)。\n我们还考虑了截至2020年7月25日(第30周)具有公开数据的国家的人均全因死亡率。这一措施对新冠肺炎死亡编码的国家级差异是稳健的，并捕捉到了间接的大流行影响。我们估计了每个国家和美国的超额全原因死亡率(2020年平均死亡人数与2015-2019年相应周的死亡人数之间的差异)，使用泊松回归和国家和周固定效应(补充资料)比较了各国的死亡率，并如上所述估计了每个国家和美国之间超额全原因死亡率的差异。我们使用R软件(版本4.0.2)进行所有分析。\n2020年9月19日，美国报告的新冠肺炎死亡病例总数为198例 589(60.3/10万 000)，高于新冠肺炎死亡率较低和中等的国家，但与高死亡率国家相当(表1)。例如，澳大利亚(低死亡率)每10万 中有3.3人死亡，加拿大(中等死亡率)每100 000中有24.6人死亡。相反，意大利每100000 中有59.1%的新冠肺炎死亡；比利时每100000 中有86.8万人死亡。如果美国的死亡率与澳大利亚相当，美国将少死187G661例新冠肺炎( 661例)(占报告死亡人数的94%)；如果与加拿大相比，美国将少死117例 622例(59%)。\n虽然在早春，美国的新冠肺炎死亡率低于高死亡率国家，但在5.10之后，所有6个高死亡率国家的每10万 死亡人数都低于美国。例如，在2020年5月10日至9月19日期间，意大利的死亡率为9.1‰ ，而美国的死亡率为36.9‰ 000。如果从5月10日开始，美国的死亡率与大多数高死亡率国家相当，它的死亡人数将减少44 210至104 177(22%-52%)(表1)。如果美国从6月7日开始有类似的死亡率，那么报告的死亡人数就会减少28%到43%(作为整体百分比)。\n在有全因死亡数据的14个国家中，发现的新冠肺炎特定死亡的模式与超额全因死亡的模式相似(表2)。在新冠肺炎死亡率中等的国家，在整个大流行期间，过高的全原因死亡率仍然可以忽略不计。在新冠肺炎死亡率高的国家，西班牙的超额全因死亡率高达102.1/10万 ，而美国为71.6/10万 。然而，自5月10日和6月7日以来，美国的超额全因死亡率高于所有高死亡率国家(表2)。\n与其他国家相比，美国在2020年9月之前经历了与新冠肺炎相关的高死亡率和超额的全因死亡率。在初春的第一个高峰之后，美国的新冠肺炎死亡率和各种原因的死亡率仍然高于新冠肺炎死亡率较高的国家。这可能是几个因素的结果，包括薄弱的公共卫生基础设施和分散的、不一致的美国对大流行的反应。4、5。\n这项分析的局限性包括死亡风险的差异：与其他国家相比，美国人口更年轻，但有更多的共病。6此外，自8月下旬以来，几个国家的死亡率有所上升，整个秋季的死亡率将如何与美国相比仍是个未知数。\n概念和设计；数据的获取、分析或解释；以及手稿的起草：两位作者。\n利益冲突披露：伊曼纽尔博士报告从明尼苏达州蓝十字蓝盾公司、卑尔根大学、联合健康集团、未来无暴力组织、费城儿童医院、华盛顿州医院协会、学术健康中心协会、马萨诸塞州蓝十字蓝盾公司、Lumeris公司、Roivant Sciences公司、医疗专科分销商、Vizient大学健康系统联盟、神经退行性疾病研究中心、基因技术肿瘤学公司、保险代理和经纪人委员会、美国医疗保险计划、蒙蒂菲奥里医生领导学院、医疗家庭网络、医疗财务管理协会、全科医疗中心-UT、美国眼科学会、维兹安特大学医疗系统联盟、神经退行性疾病研究中心、基因技术肿瘤学公司、保险代理和经纪人委员会、美国医疗保险计划、蒙蒂菲奥里医生领导学院、医疗家庭网络、医疗财务管理协会、全科医学中心-UT、美国眼科学会、美国眼科学会、美国视光学会等机构获得个人费用和非财务支持。全国医院协会、全国医疗采购商联盟、Optum实验室、马萨诸塞州健康计划协会、哥伦比亚特区医院协会、华盛顿大学、Optum、布朗大学、McKay实验室、美国手外科学会、美国医学院协会、美国基本医院、约翰霍普金斯大学、国家居民配对计划、Shore Memorial Health System、杜兰大学、俄勒冈健康与科学大学、蓝十字蓝盾和全球发展中心，以及来自特拉华州医疗支出基准峰会、Geisinger医疗系统、RAND公司、高盛、大西洋医学学院、MD、MD、高盛、大西洋医疗保健系统、MD、MD、和全球发展中心的非财政支持，以及特拉华州医疗支出基准峰会、Geisinger Health System、RAND公司、高盛公司、大西洋医疗学院协会、美国基本医院、约翰霍普金斯大学、国家居民配对计划、Shore纪念健康系统、杜兰大学、俄勒冈健康与科学大学、蓝十字蓝盾和全球发展中心提供的非财政支持。和肿瘤学分析。伊曼纽尔博士也是橡树HC/FT的风险合伙人、Embedded Healthcare LLC和新冠肺炎复苏咨询公司的合伙人。比林斯基女士没有报告任何信息披露。\n资助/赞助商的作用：科尔顿基金会不参与研究的设计和实施；数据的收集、管理、分析和解释；手稿的准备、审查或批准；以及提交手稿发表的决定。\n额外贡献：我们感谢哈佛大学经济系博士大卫·卡特勒(David Cutler)提供的有用的反馈，但他没有得到任何补偿。\n2.维格利奥内(Viglione)\rGG﻿.。--冠状病毒已导致多少人死亡？--﻿，《自然》。2020年；585(7823)：22-24。网址：doi：10.1038/d41586-020-02497-w PubMed Google Scholar CrossRef。\n3.吕\rW.W﻿，Wehby\r*GL﻿.。“原地避难所订单降低了新冠肺炎死亡率并降低了住院增长率：研究利用事件研究模型检验了原地避难所订单对新冠肺炎死亡和住院日增长率的影响。”﻿Health Aff(米尔伍德)。2020；39(9)：1615-1623。Doi：10.1377/hlthaff.2020.00719PubMed Google Scholar CrossRef\n4.真实性\r俄克拉荷马州奥克尔市Re R﻿\r*LC﻿，多里加蒂\r我是﻿，\r等人。对2019年冠状病毒病严重程度的估计：基于模型的分析。﻿/Lancet Infect Dis。2020年；20(6)：669-677。30243-7PubMed Google Scholar CrossRef，网址：10.1016/S14733099(20)。\n5.马尼(Maani)\rN﻿，加莱亚\r﻿.。《新冠肺炎与美国公共卫生基础设施投资不足》，﻿，Milbank Q.2020；98(2)：250-259.。0009.12463出版医疗谷歌学者交叉参考文献10.1111。\n6.乔杜里(乔杜里)\rJR﻿，德拉尼萨里斯\r5G﻿，穆巴希尔\rT﻿，巴托兹科\rJJ﻿，里亚齐\r﻿.。*一项国家层面的分析，衡量政府行动、国家准备和社会经济因素对新冠肺炎死亡率和相关健康结果的影响。﻿欧洲临床医学。2020年；25：100464。Doi：10.1016/j.eclinm.2020.100464 PubMed Google Scholar", "note_en": "Cite  This   Bilinski A, Emanuel EJ. COVID-19 and Excess All-Cause Mortality in the US and 18 Comparison Countries.  JAMA. Published online October 12, 2020. doi:10.1001/jama.2020.20717\n        The US has experienced more deaths from coronavirus disease 2019 (COVID-19) than any other country and has one of the highest cumulative per capita death rates.  1 , 2 An unanswered question is to what extent high US mortality was driven by the early surge of cases prior to improvements in prevention and patient management vs a poor longer-term response.  3 We compared US COVID-19 deaths and excess all-cause mortality in 2020 (vs 2015-2019) to that of 18 countries with diverse COVID-19 responses.\n          We compared the US to Organisation for Economic Co-operation and Development countries with populations exceeding 5 million and greater than $25 000 per capita gross domestic product. For each country, we calculated the COVID-19 per capita mortality rate and grouped countries by mortality: (1) low (COVID-19 deaths, &lt;5/100 000), (2) moderate (5-25/100 000), and (3) high (&gt;25/100 000).  1 We used Poisson regression for comparisons across countries.\n    We calculated the difference in COVID-19 deaths between each country and the US through September 19, 2020 (week 38) under 3 scenarios: if the US had a comparable per capita COVID-19 mortality rate to each country from the start of the pandemic (February 13) or if the US mortality rate became comparable to other countries beginning May 10 or June 7, to allow lag time for policy interventions.  3 (See the  Supplement for formulas.)\n    We also considered all-cause mortality per capita for countries with publicly available data through July 25, 2020 (week 30). This measure is robust to country-level differences in COVID-19 death coding and captures indirect pandemic effects. We estimated excess all-cause mortality (the difference between mean 2020 deaths and deaths in corresponding weeks of 2015-2019) for each country and the US, compared rates across countries using Poisson regression with country and week fixed effects ( Supplement), and estimated the difference in excess all-cause mortality between each country and the US as described above. We used R software (version 4.0.2) for all analyses.\n        On September 19, 2020, the US reported a total of 198 589 COVID-19 deaths (60.3/100 000), higher than countries with low and moderate COVID-19 mortality but comparable with high-mortality countries ( Table 1). For instance, Australia (low mortality) had 3.3 deaths per 100 000 and Canada (moderate mortality) had 24.6 per 100 000. Conversely, Italy had 59.1 COVID-19 deaths per 100 000; Belgium had 86.8 per 100 000. If the US death rates were comparable to Australia, the US would have had 187 661 fewer COVID-19 deaths (94% of reported deaths), and if comparable with Canada, 117 622 fewer deaths (59%).\n    While the US had a lower COVID-19 mortality rate than high-mortality countries during the early spring, after May 10, all 6 high-mortality countries had fewer deaths per 100 000 than the US. For instance, between May 10 and September 19, 2020, Italy’s death rate was 9.1/100 000 while the US’s rate was 36.9/100 000. If the US had comparable death rates with most high-mortality countries beginning May 10, it would have had 44 210 to 104 177 fewer deaths (22%-52%) ( Table 1). If the US had comparable death rates beginning June 7, it would have had 28% to 43% fewer reported deaths (as a percentage overall).\n    In the 14 countries with all-cause mortality data, the patterns found for COVID-19–specific deaths were similar for excess all-cause mortality ( Table 2). In countries with moderate COVID-19 mortality, excess all-cause mortality remained negligible throughout the pandemic. In countries with high COVID-19 mortality, excess all-cause mortality reached as high as 102.1/100 000 in Spain, while in the US it was 71.6/100 000. However, since May 10 and June 7, excess all-cause mortality was higher in the US than in all high-mortality countries ( Table 2).\n        Compared with other countries, the US experienced high COVID-19–associated mortality and excess all-cause mortality into September 2020. After the first peak in early spring, US death rates from COVID-19 and from all causes remained higher than even countries with high COVID-19 mortality. This may have been a result of several factors, including weak public health infrastructure and a decentralized, inconsistent US response to the pandemic.  4 , 5\n    Limitations of this analysis include differences in mortality risk: the US population is younger but has more comorbidities compared with the other countries.  6 In addition, since late August death rates have increased in several countries, and how mortality will compare with the US throughout fall remains unknown.\n              Concept and design; acquisition, analysis, or interpretation of data; and drafting of the manuscript: Both authors.\n      Conflict of Interest Disclosures: Dr Emanuel reported receiving personal fees and nonfinancial support from Blue Cross Blue Shield Minnesota, Bergen University, United Health Group, Futures Without Violence, Children’s Hospital of Philadelphia, Washington State Hospital Association, the Association of Academic Health Centers, Blue Cross Blue Shield of Massachusetts, Lumeris, Roivant Sciences, Medical Specialties Distributors, Vizient University Health System Consortium, the Center for Neurodegenerative Disease Research, Genentech Oncology, the Council of Insurance Agents and Brokers, America’s Health Insurance Plans, the Montefiore Physician Leadership Academy, Medical Home Network, the Healthcare Financial Management Association, Ecumenical Center–UT Health, the American Academy of Optometry, the Associação Nacional de Hospitais Privados, the National Alliance of Healthcare Purchaser Coalitions, Optum Labs, the Massachusetts Association of Health Plans, the District of Columbia Hospital Association, Washington University, Optum, Brown University, McKay Lab, the American Society for Surgery of the Hand, the Association of American Medical Colleges, America’s Essential Hospitals, Johns Hopkins University, the National Resident Matching Program, Shore Memorial Health System, Tulane University, Oregon Health and Science University, Blue Cross Blue Shield, and the Center for Global Development, as well as nonfinancial support from the Delaware Healthcare Spending Benchmark Summit, Geisinger Health System, RAND Corporation, Goldman Sachs, The Atlantic, Village MD, and Oncology Analytics. Dr Emanuel is also a venture partner at Oak HC/FT, and a partner at Embedded Healthcare LLC and COVID-19 Recovery Consulting. Ms Bilinski reported no disclosures.\n  Role of the Funder/Sponsor: The Colton Foundation had no role in the design and conduct of the study; collection, management, analysis, and interpretation of the data; preparation, review, or approval of the manuscript; and decision to submit the manuscript for publication.\n Additional Contributions: We thank David Cutler, PhD, of the Harvard University Department of Economics, for helpful feedback, for which he received no compensation.\n       2. Viglione\r  G﻿.  How many people has the coronavirus killed? ﻿   Nature. 2020;585(7823):22-24. doi: 10.1038/d41586-020-02497-w PubMed Google Scholar Crossref\n 3. Lyu\r  W﻿, Wehby\r  GL﻿.  Shelter-in-place orders reduced COVID-19 Mortality and reduced the rate of growth in hospitalizations: study examine effects of shelter-in-places orders on daily growth rates of COVID-19 deaths and hospitalizations using event study models. ﻿   Health Aff (Millwood). 2020;39(9):1615-1623. doi: 10.1377/hlthaff.2020.00719 PubMed Google Scholar Crossref\n 4. Verity\r  R﻿, Okell\r  LC﻿, Dorigatti\r  I﻿, \r  et al.  Estimates of the severity of coronavirus disease 2019: a model-based analysis. ﻿   Lancet Infect Dis. 2020;20(6):669-677. doi: 10.1016/S1473-3099(20)30243-7 PubMed Google Scholar Crossref\n 5. Maani\r  N﻿, Galea\r  S﻿.  COVID-19 and underinvestment in the public health infrastructure of the United States. ﻿   Milbank Q. 2020;98(2):250-259. doi: 10.1111/1468-0009.12463 PubMed Google Scholar Crossref\n 6. Chaudhry\r  R﻿, Dranitsaris\r  G﻿, Mubashir\r  T﻿, Bartoszko\r  J﻿, Riazi\r  S﻿.  A country level analysis measuring the impact of government actions, country preparedness and socioeconomic factors on COVID-19 mortality and related health outcomes. ﻿   EClinicalMedicine. 2020;25:100464. doi: 10.1016/j.eclinm.2020.100464 PubMed Google Scholar", "posttime": "2020-10-13 20:51:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,excess", "title": "美国和18个比较国家的超额全因死亡率", "title_en": "Excess All-Cause Mortality in the US and 18 Comparison Countries", "transed": 1, "url": "https://jamanetwork.com/journals/jama/fullarticle/2771841", "via": "", "real_tags": ["美国", "excess"]}, {"category": "", "categoryclass": "", "imagename": "cf644146748381b04be89259e2c99b3f.jpg", "infoid": 1028466, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，这是一个关于我的生活是如何被颠覆的故事，我想花点时间坐在那里，我会告诉你我是如何运行末日的…", "note_en": "Now, this is a story all about how My life got flipped-turned upside down And I'd like to take a minute Just sit right there I'll tell you how I ran Doom on ...", "posttime": "2020-10-13 20:51:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "土豆,potato,颠覆", "title": "土豆末日", "title_en": "Potato Doom", "transed": 1, "url": "https://www.youtube.com/watch?v=KFDlVgBMomQ", "via": "", "real_tags": ["土豆", "potato", "颠覆"]}, {"category": "", "categoryclass": "", "imagename": "6a01d78af5ac459897d2fbe9c33631a3.jpg", "infoid": 1028465, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然比往常晚了，但亚马逊黄金日已经到来。Dealmaster在这里引导你远离垃圾，走向2020年最好的黄金日交易-特别是当涉及到小玩意儿和装备的折扣时。\n与去年非常相似的是，2020年黄金日实际上是一个48小时的活动，将持续到10月13日至14日。这场促销活动仍然是亚马逊支持其广受欢迎的Prime会员计划的一种方式，因此你仍然需要订阅Prime才能利用无数的黄金日促销活动。这一促销活动将持续到10月13日至14日，对亚马逊来说，这仍然是一种支持其广受欢迎的Prime会员计划的方式，所以你仍然需要订阅Prime Air才能利用无数的Prime Day促销活动。那些免费试用的人可以参加，但只有在过去12个月内没有成为主要会员的人才能参加试用。\n对于那些过去没有费心过黄金日的人来说，要知道亚马逊广告中的大多数交易都不是交易。有时，一种产品的广告价格并不比其典型的市场价格便宜多少；其他时候，产品本身从一开始就不值得购买。这一点并没有随着2020年黄金日的到来而改变。\n但是我们可以帮你更聪明地购物。在今年的活动之前，我们花了几天时间梳理了8000多个黄金日优惠，从这些垃圾中挖掘出我们认为真正值得你考虑的科技交易。我们查看了价格历史图表，研究了来自网络各地的可信评论和反馈，在许多情况下，我们利用自己的亲身体验来确保每笔交易都是真实的。\n结果是下面精心策划的综合报道，其中包括笔记本电脑、电视、智能手机、耳机和更多科技产品的折扣。“我们还会在接下来的两天里定期更新这篇帖子，所以如果你想购买另一款电子产品，请务必回来查看。”\n注：Ars Technica可能会通过会员计划从此帖子上的链接获得销售补偿。\n苹果AirPods售价114.99美元：这是我们追踪到的苹果超级畅销真无线耳机的最低价格。虽然AirPods仍然没有赢得任何音质奖，但它们仍然非常容易与其他苹果设备一起使用。如果你愿意多花点钱，苹果公司的AirPods Pro-它增加了主动消音功能和更具动感的声音-正在以199美元的价格出售，这与我们见过的最好的价格相匹配。对于具有类似苹果友好便利性的运动型设计，Beats PowerBeats Pro的价格跌至175美元的新低。\n索尼WH-1000XM4+价值25美元的亚马逊礼品卡，售价298美元(通常为375美元)：这是我们在8月份推出的无线降噪耳机中第一次看到有意义的交易。XM4提供了舒适性、趣味性和可定制的声音以及一流的有源消音功能。为了增加50美元的折扣，亚马逊还赠送了25美元的礼品卡。如果你宁愿花更少的钱，Bose&39；优秀的QuietComfort 35 II并不是很有特色，但正在以199美元的价格出售。\n亚马逊Kindle PaperWhite售价79.99美元(通常为130美元)：Kindle PaperWhite是我们在电子书阅读器中的首选，因为它提供了清晰的显示屏、防水设计，并且可以访问亚马逊通常规模庞大的Kindle图书馆。这是我们在其8 GB机型上看到的最低价格。\n亚马逊Fire HD 10英寸(32 GB)，售价79.99美元(通常为140美元)：如果你更喜欢便宜的全功能平板电脑，80美元的Fire HD 10是个不错的选择。它远没有iPad那么高级，亚马逊对Android的厚皮模仿也不理想，但它仍然拥有坚固的10.1英寸1080p显示屏，USB-C充电，以及足够好的性能，可以满足休闲媒体消费的需要。这一折扣标志着一个新的低点；只需注意，默认情况下，它附带亚马逊典型的锁屏广告。如果您喜欢较小的板材，8英寸Fire HD 8和Fire HD 8 Plus也在打折。\nRoku Streaming Stick+售价37美元(通常为49美元)：虽然Roku Streaming Stick+已经问世几年了，但它仍然拥有可靠的性能、4K HDR支持和非常简单的界面，设计紧凑。它支持大多数主要的流媒体应用，并将很快与苹果的AirPlay 2协议兼容，尽管它缺乏官方的HBO Max应用。这不是历史最低价，但却是自去年黑色星期五以来我们看到的最便宜的价格。对于一个更便宜的选择，Roku Premiere-它可以进行4K HDR，但只支持较旧的802.11n Wi-Fi-也在出售，售价为27美元。\n三星EVO Select(256 GB)microSDXC卡售价27.99美元(通常为35美元)：如果你的任天堂交换机、Android手机、GoPro或任何其他带有microSD插槽的设备需要更大的存储空间，这是我们在256 GB的三星EVO Select卡上看到的最优惠的价格。它并不是目前所有用例中执行速度最快的，但作为一张10级和U3级的卡，对于那些足以满足大多数人需求的速度足够快的东西来说，它是一个很好的物有所值。\nGarmin Forerunner645Music售价219.99美元(通常为300美元)：Garmin的Forerunner645Music是一款出色的全球定位系统跑步手表，拥有极具吸引力的纤薄设计、简洁的用户界面、车载音乐支持、坚固的电池续航能力，以及精确的活动、睡眠和心率跟踪。我们审查的最大问题是它的初始建议零售价很高，但这笔交易标志着我们看到的最低价格。\nRazer Viper旗舰版售价99.99美元(通常为130美元)：Razer Viper旗舰版是我们使用过的最好的无线游戏鼠标。它需要一个USB-A适配器才能工作，但它的响应非常灵敏，重量也很轻，让它工作起来很舒服，也是快节奏游戏的理想选择。如果需要，它还可以与电缆配合使用。这笔100美元的交易仍然不便宜，但它符合我们迄今看到的最好价格。如果你不介意使用电缆，有线Razer Viper也在打折，价格创下了48美元的新低。\nSK Hynix Gold p31(500B)内置固态硬盘，售价59.99美元(通常为75美元)：虽然我们还没有在ARS上对其进行审查，但SK Hynix Gold p31是一款NVMe硬盘，以实惠的价格提供了令人印象深刻的性能和一流的能效，几乎获得了普遍的好评。与台式机相比，它可能更适合笔记本电脑，而且它没有使用更面向未来的PCIe 4.0标准，但如果您的PC需要新的固态硬盘，那么Gold p31看起来是一个很棒的入门级选择。\n亚马逊Kindle无限版6个月会员收费29.97美元(通常为60美元)：Kindle无限版是亚马逊提供的随心所欲的电子书订阅服务，只需支付一笔费用，就可以提供一个庞大的书库。这项协议将Prime用户的6个月会员费降低了一半。请注意，这项服务也通过亚马逊的Kindle应用程序运行，而不仅仅是Kindle电子书阅读器。\n亚马逊Echo Dot(第三代)智能音箱+LIFX智能灯泡售价18.99亿美元(通常为50美元)。\n亚马逊Echo Show 5英寸智能显示屏+Blink Mini 1080p室内安全摄像头，售价49.99美元(通常为105美元)。\n当您购买价值40美元或更多的亚马逊礼品卡或重新充值40美元或更多的礼品卡余额时，可获得10美元的促销积分。\n苹果MacBook Air(2020年)笔记本电脑-英特尔酷睿i3-1000NG4，13.3英寸2560x1600，8 GB内存，256 GB固态硬盘，售价约849.99美元(不需要Prime，结账时看到折扣-通常为900美元)。\nRazer Blade 15英寸(2020)笔记本电脑-英特尔酷睿i7-10750H，15.6英寸1080p 144 Hz，16 GB RAM，256 GB固态硬盘，GTX 1660 Ti GPU，售价1,299美元(通常为1,600美元)。\n宏基Chromebook Flip C434和2合1笔记本电脑-英特尔酷睿m3-8100Y，14英寸1080p 4 GB内存，32 GB eMMC，售价399.99美元(通常为500美元)。\n宏基Spin 5和2合1笔记本电脑-英特尔酷睿i7-1065G7，13.5英寸2256x1504，16 GB内存，512 GB固态硬盘，售价899.99美元(通常为1,100美元)。\nGB Aero 15 OLED笔记本电脑-英特尔酷睿i7-9750H，15.6英寸3840x2160 OLED，16 GB RAM，512 GB固态硬盘，GTX 1660钛GPU，售价1,149.99美元(通常为1,680美元)。\n宏基Aspire TC-895UA91台式电脑-英特尔酷睿i3-10100，8 GB内存，512 GB固态硬盘，售价364.99美元(通常为430美元)。\n宏基Aspire C24-963-UA91一体机-英特尔酷睿i3-1005G1，23.8英寸1080p，8 GB内存，512 GB固态硬盘，售价492.99美元(通常为580美元)。\n华硕TUF游戏B550M-PLUS AMDAM4Micro ATX主板-PCIe4.0，HDMI2.1，USB3.2Gen 2，售价127.99美元(通常为160美元)。\n27英寸宏基掠夺者XB271HU游戏监视器-1440P，144 Hz，IPS，G-Sync，售价379.99美元(通常为530美元)。\n27英寸宏基Nitro VG271U游戏显示器-1440p，144 Hz，IPS，免费同步，售价254.99美元(通常为350美元)。\n新的超级马里奥兄弟U豪华交换机(Switch)售价39.99美元(不需要Prime-通常是50美元)。\n驴港国家：在亚马逊支付44.99美元的热带冷冻服务(Switch)(不需要Prime-通常为50美元)。\n任天堂Switch在线12个月家庭会员+SanDisk 128 GB microSDXC卡用于任天堂Switch-UHS-I，U3，V30，售价39.99美元(通常为63美元)。\nSteelSeries Arctis Pro+GameDAC有线游戏耳机，适用于PS4+PC，售价139.99美元(通常为250美元)。\nRazer Huntsman锦标赛版TKL是一款无键机械游戏键盘-Razer线性光学开关，售价89.99美元(通常为130美元)。\nRazer BlackWidow TE Chroma v2无键机械游戏键盘-Razer Orange Switch售价69.99美元(通常为120美元)。\nHyperX合金原创酷睿无键机械游戏键盘-HyperX Aqua/Red Switches售价69.99美元(通常为90美元)。\nHyperX Cloud Flight S是一款适用于PC+PS4的无线游戏耳机，售价119.99美元(通常为160亿美元)。\nHyperX ChargePlay Duo为Xbox无线控制器和Xbox Elite无线控制器提供双充电站，售价22.99亿美元(通常为25美元)。\n55英寸索尼A8H电视(2020年型号)4K HDR OLED电视，售价1,298美元(不需要Prime-通常为1,900美元)。\n65英寸索尼A8H电视(2020年型号)4K HDR OLED电视，售价1,798美元(不需要Prime-通常为2,650美元)。\n43英寸东芝TF-55A810U21T(2020年款)Fire TV版4KLED电视，售价209.99美元(通常为260亿美元)。\n三星Galaxy Tab S6精简版(64 GB)10.4英寸平板电脑+S钢笔触控笔售价249.99美元(通常为320美元)。\n三星Galaxy Tab S6(256 GB)10.5英寸平板电脑+S钢笔触控笔售价549.99美元(通常为655美元)。\n三星Galaxy Tab S7平板电脑(128 GB)11英寸平板电脑+S钢笔触控笔售价579.99美元(通常为650美元)。\nDAS键盘4专业版-机械键盘-樱桃MX棕色/蓝色开关，售价144.49美元(夹5%优惠券-通常为170美元)。\n用于苹果机械键盘的DAS键盘4专业版-樱桃MX棕色/蓝色开关，售价144.49美元(夹5%优惠券-通常为170美元)。\n三星EVO Select(256 GB)microSDXC卡-UHS-I，U3，Class 10，售价27.99美元(通常为35美元)。\n三星EVO Select(512 GB)microSDXC卡-UHS-I，U3，Class 10，售价69.99美元(通常为88美元)。\nSK Hynix Gold p31(500 GB)和PCIe Gen 3 NVMe内部固态硬盘，售价59.99美元(通常为75美元)。\nSK Hynix Gold S31(1TB)2.5英寸SATA内置固态硬盘售价83.99美元(夹20%优惠券-通常为110美元)。\n用于任天堂切换器(256 GB)的SanDisk microSDXC卡-UHS-I、U3、V3售价42.99美元(通常为54美元)。\nAukey CB-CL02(3.9英尺，MFi认证)编织尼龙USB-C到闪电电缆的价格为9.59美元(通常为12美元)。\nBrydge 11.0 Pro蓝牙键盘适用于11英寸苹果iPad Pro和iPad Air(2020)，售价99.99美元(通常为130美元)。\nBrydge 11.0Pro+带触控板的蓝牙键盘，适用于11英寸的苹果iPad Pro和iPad Air(2020年)，售价139.99美元(通常为200美元)。\nBrydge 12.9Pro+带触控板的蓝牙键盘适用于12.9英寸的苹果iPad Pro，售价为159.99美元(通常为230美元)。\n可插拔3合1 USB-C多端口适配器-60W USB-C PD、USB 3.0、HDMI(4K@30 Hz)，售价19.96美元(通常为25美元)。\nDealmaster推出了自己的时事通讯！注册后，就可以收到一份更短的、经过严格管理的网上最佳科技交易清单--不要胡说八道，直接进入你的收件箱，而且通常是在它们进入ARS主页之前。", "note_en": "It&#39;s  later than usual, but  Amazon Prime Day has arrived. The Dealmaster is here to guide you away from the junk and toward 2020&#39;s best Prime Day deals—particularly when it comes to discounts on gadgets and gear.\n Much like last year, Prime Day 2020 is actually a 48-hour affair, live through October 13 and 14. The sales event remains a way for Amazon to bolster its  hugely popular Prime membership program first and foremost, so you&#39;ll still need to  subscribe to Prime to take advantage of the myriad Prime Day sales. Those on a free trial  can take part, but trials are only available to people who haven&#39;t been a Prime member within the last 12 months.\n For those who haven&#39;t bothered with Prime Day in the past, know that most of the &#34;deals&#34; Amazon advertises aren&#39;t, well, deals. Sometimes, a product&#39;s advertised price isn&#39;t much cheaper than its typical street price; other times, the product itself just isn&#39;t worth buying in the first place. This hasn&#39;t changed with Prime Day 2020.\n But we can help you shop smarter. We spent days combing through more than 8,000 Prime Day offers ahead of this year&#39;s event, digging through the dreck to pick out the tech deals we think are actually worth your consideration. We looked through  price-history charts, researched trusted reviews and feedback from around the Web, and, in many cases, used our own hands-on experience to ensure each deal is genuine.\n The result is the curated roundup below, which includes discounts on laptops, TVs, smartphones, headphones, and more tech. We&#39;ll also update this post regularly over the next two days, so be sure to check back if there&#39;s another gadget you&#39;re seeking to buy.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n     Apple AirPods for $114.99 (normally $135): This is the lowest price we&#39;ve tracked for Apple&#39;s mega-popular true wireless earbuds. While the AirPods still won&#39;t win any awards for sound quality, they remain superbly easy to use with other Apple devices. If you&#39;re willing to spend a bit more,  Apple&#39;s AirPods Pro—which add active noise cancellation and a more dynamic sound—are on sale for $199, which matches the best price we&#39;ve seen. For a sportier design with  similar Apple-friendly convenience, the  Beats Powerbeats Pro are down to a new low of $175.\n Sony WH-1000XM4 + $25 Amazon gift card for $298 (normally $375): This is the first significant deal we&#39;ve seen for  our top pick among wireless noise-cancelling headphones, which  launched in August. The XM4 provide a tremendous blend of comfort, fun, and customizable sound and top-notch active noise-cancellation. To sweeten the $50 discount, Amazon has thrown in a $25 gift card as well. If you&#39;d rather pay less,  Bose&#39;s excellent QuietComfort 35 II aren&#39;t quite as featured but are on sale for $199.\n Amazon Kindle Paperwhite for $79.99 (normally $130): The Kindle Paperwhite is  our top pick among e-book readers for offering a sharp display, a waterproof design, and access to Amazon&#39;s typically extensive Kindle library. This is the lowest price we&#39;ve seen on its 8GB model.\n Amazon Fire HD 10 (32GB) for $79.99 (normally $140): If you&#39;d prefer a full-on tablet on the cheap, the Fire HD 10 is a good buy at $80. It&#39;s not nearly as premium as an iPad, and Amazon&#39;s heavily-skinned take on Android  isn&#39;t ideal, but it still offers a solid 10.1-inch 1080p display, USB-C charging, and good-enough performance for casual media consumption. This discount marks a new low; just note that it comes with Amazon&#39;s typical lock-screen ads by default. If you&#39;d prefer a smaller slate, the  8-inch Fire HD 8 and  Fire HD 8 Plus are on sale as well.\n Roku Streaming Stick+ for $37 (normally $49): While it has been around for a few years, the Roku Streaming Stick+ still packs reliable performance, 4K HDR support, and a dead-simple interface in a compact design. It supports most of the major streaming apps and will soon work with  Apple&#39;s AirPlay 2 protocol, though it lacks an official HBO Max app. This isn&#39;t an all-time low, but it&#39;s the cheapest price we&#39;ve seen since Black Friday last year. For a cheaper option, the  Roku Premiere—which can do 4K HDR but only supports older 802.11n Wi-Fi—is also on sale for $27.\n Samsung EVO Select (256GB) microSDXC card for $27.99 (normally $35): If you need more storage space for your Nintendo Switch, Android phone, GoPro, or any other device with a microSD slot, this is the best price we&#39;ve seen on the 256GB variant of Samsung&#39;s EVO Select cards. It&#39;s not the absolute fastest performer for all use cases these days, but as a  Class 10 and U3-rated card, it&#39;s a good value for something fast enough for most people&#39;s needs.\n Garmin Forerunner 645 Music for $219.99 (normally $300): Garmin&#39;s Forerunner 645 Music is an excellent GPS running watch, with an attractively slim design, a straightforward UI, onboard music support, solid battery life, and accurate activity, sleep, and heart-rate tracking. Our  review&#39;s biggest concern was its high initial MSRP, but this deal marks the lowest price we&#39;ve seen.\n Razer Viper Ultimate for $99.99 (normally $130): The Razer Viper Ultimate is  the best wireless gaming mouse we&#39;ve used. It requires a USB-A adapter to work, but it&#39;s tremendously responsive and lightweight, making it comfortable for work and ideal for fast-paced games. It can also function with a cable if needed. This $100 deal still isn&#39;t cheap, but it matches the best price we&#39;ve seen to date. If you don&#39;t mind using a cable, the  wired Razer Viper is on sale as well for a new low of $48.\n SK Hynix Gold P31 (500B) internal SSD for $59.99 (normally $75): While we haven&#39;t reviewed it here on Ars, the SK Hynix Gold P31 is an  NVMe drive that  received  near-universal  acclaim for offering impressive performance and class-leading power efficiency at an affordable price. It may work more naturally with laptops than desktops, and it doesn&#39;t use the more future-proof PCIe 4.0 standard, but if you have a PC in need of a new SSD, the Gold P31 looks like a great entry-level option.\n Amazon Kindle Unlimited 6-month membership for $29.97 (normally $60): Kindle Unlimited is Amazon&#39;s all-you-can-eat e-book subscription service, one that makes a massive library of titles available for one fee. This deal cuts the price of a six-month membership in half for Prime users. Note that the service works through Amazon&#39;s Kindle app, too, not just Kindle e-book readers.\n   Amazon Echo Dot (3rd gen) smart speaker + LIFX smart bulb for  $18.99 (normally $50).\n   Amazon Echo Show 5 smart display + Blink Mini 1080p indoor security camera for  $49.99 (normally $105).\n        Get  $10 promo credit when you buy Amazon gift card of $40 or more or reload gift card balance with $40 or more\n   Apple MacBook Air (2020) laptop - Intel Core i3-1000NG4, 13.3-inch 2560x1600, 8GB RAM, 256GB SSD for  $849.99 (Prime not required, discount seen at checkout - normally $950).\n Razer Blade 15 (2020) laptop - Intel Core i7-10750H, 15.6-inch 1080p 144Hz, 16GB RAM, 256GB SSD, GTX 1660 Ti GPU for  $1,299 (normally $1,600).\n Acer Chromebook Flip C434 2-in-1 laptop - Intel Core m3-8100Y, 14-inch 1080p 4GB RAM, 32GB eMMC for  $399.99 (normally $500).\n Acer Spin 5 2-in-1 laptop - Intel Core i7-1065G7, 13.5-inch 2256x1504, 16GB RAM, 512GB SSD for  $899.99 (normally $1,100).\n Gigabyte Aero 15 OLED laptop - Intel Core i7-9750H, 15.6-inch 3840x2160 OLED, 16GB RAM, 512GB SSD, GTX 1660 Ti GPU for  $1,149.99 (normally $1,680).\n   Acer Aspire TC-895-UA91 desktop PC - Intel Core i3-10100, 8GB RAM, 512GB SSD for  $364.99 (normally $430).\n Acer Aspire C24-963-UA91 all-in-one PC - Intel Core i3-1005G1, 23.8-inch 1080p, 8GB RAM, 512GB SSD for  $492.99 (normally $580).\n Asus TUF Gaming B550M-PLUS AMD AM4 Micro ATX motherboard - PCIe 4.0, HDMI 2.1, USB 3.2 Gen 2 for  $127.99 (normally $160).\n   27-inch Acer Predator XB271HU gaming monitor - 1440p, 144Hz, IPS, G-Sync for  $379.99 (normally $530).\n 27-inch Acer Nitro VG271U gaming monitor - 1440p, 144Hz, IPS, FreeSync for  $254.99 (normally $350).\n   New Super Mario Bros. U Deluxe (Switch) for  $39.99 (Prime not required - normally $50).\n      Donkey Kong Country: Tropical Freeze (Switch) for  $44.99 at Amazon (Prime not required - normally $50).\n   Nintendo Switch Online 12-month Family Membership + SanDisk 128GB microSDXC Card for Nintendo Switch - UHS-I, U3, V30 for  $39.99 (normally $63).\n   SteelSeries Arctis Pro + GameDAC wired gaming headset for PS4 + PC for  $139.99 (normally $250).\n             Razer Huntsman Tournament Edition TKL tenkeyless mechanical gaming keyboard - Razer Linear Optical switch for  $89.99 (normally $130).\n  Razer BlackWidow TE Chroma v2 tenkeyless mechanical gaming keyboard - Razer Orange switch for  $69.99 (normally $120).\n    HyperX Alloy Origins Core tenkeyless mechanical gaming keyboard - HyperX Aqua/Red switches for  $69.99 (normally $90).\n  HyperX Cloud Flight S wireless gaming headset for PC + PS4 for  $119.99 (normally $160).\n    HyperX ChargePlay Duo dual charging station for Xbox Wireless Controller and Xbox Elite Wireless Controllers for  $22.99 (normally $25).\n   55-inch Sony A8H (2020 model) 4K HDR OLED TV for  $1,298 (Prime not required - normally $1,900).\n 65-inch Sony A8H (2020 model) 4K HDR OLED TV for  $1,798 (Prime not required - normally $2,650).\n 43-inch Toshiba TF-55A810U21 (2020 model) Fire TV Edition 4K LED TV for  $209.99 (normally $260).\n         Samsung Galaxy Tab S6 Lite (64GB) 10.4-inch tablet + S Pen stylus for  $249.99 (normally $320).\n Samsung Galaxy Tab S6 (256GB) 10.5-inch tablet + S Pen stylus for  $549.99 (normally $655).\n Samsung Galaxy Tab S7 (128GB) 11-inch tablet + S Pen stylus for  $579.99 (normally $650).\n       Das Keyboard 4 Professional mechanical keyboard - Cherry MX Brown/Blue switches for  $144.49 ( clip 5% coupon - normally $170).\n Das Keyboard 4 Professional for Mac mechanical keyboard - Cherry MX Brown/Blue switches for  $144.49 ( clip 5% coupon - normally $170).\n      Samsung EVO Select (256GB) microSDXC card - UHS-I, U3, Class 10 for  $27.99 (normally $35).\n Samsung EVO Select (512GB) microSDXC card - UHS-I, U3, Class 10 for  $69.99 (normally $88).\n    SK Hynix Gold P31 (500GB) PCIe Gen 3 NVMe internal SSD for  $59.99 (normally $75).\n SK Hynix Gold S31 (1TB) 2.5-inch SATA internal SSD for  $83.99 ( clip 20% coupon - normally $110).\n      SanDisk microSDXC Card for Nintendo Switch (256GB) - UHS-I, U3, V3 for  $42.99 (normally $54).\n   Aukey CB-CL02 (3.9ft, MFi certified) braided nylon USB-C to Lightning cable for  $9.59 (normally $12).\n    Brydge 11.0 Pro Bluetooth keyboard for 11-inch Apple iPad Pro and iPad Air (2020) for  $99.99 (normally $130).\n Brydge 11.0 Pro+ Bluetooth keyboard with trackpad for 11-inch Apple iPad Pro and iPad Air (2020) for  $139.99 (normally $200).\n  Brydge 12.9 Pro+ Bluetooth keyboard with trackpad for 12.9-inch Apple iPad Pro for  $159.99 (normally $230).\n    Plugable 3-in-1 USB-C Multiport Adapter - 60W USB-C PD, USB 3.0, HDMI (4K@30Hz) for  $19.96 (normally $25).\n The Dealmaster has launched its very own newsletter! Sign up to receive a shorter, tightly curated list of the very best tech deals on the Web—no nonsense, direct to your inbox, and often before they make it to the Ars homepage.", "posttime": "2020-10-13 20:37:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,2020,亚马逊,amazon,科技", "title": "亚马逊2020黄金日：我们能找到的所有最划算的科技交易", "title_en": "Amazon Prime Day 2020: All the best tech deals we can find", "transed": 1, "url": "https://arstechnica.com/staff/2020/10/best-amazon-prime-day-2020-deals/", "via": "", "real_tags": ["交易", "2020", "亚马逊", "amazon", "科技"]}]