[{"category": "", "categoryclass": "", "imagename": "a0c37a99d89c74c62bdcba2a2a42c2b6.png", "infoid": 1012299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎回到本系列的第2.2部分！如果您尚未检出第1部分或第2.1部分，请先检出，因为它们突出显示了重要的侦察步骤以及反汇编分析的前半部分！TOC CHECK_MAGIC calcSha512 DataLen变量偏移量分析摘要分析：0x6dc sha512_CHECKER DECRYPT_Firmware拆卸摘要测试与其他加密D-Link映像对比解包D-Link DIR3060-快速分析结论让.", "note_en": "Welcome back to part 2.2 of this series! If you have not yet checked out part 1 or part 2.1 please do so first as they highlight important reconnaissance steps as well as the first half of the disassembly analysis!  ToC:   ToC  check_magic  calcSha512Digest  Analysis of the datalen variables Offset analysis: The curious case of 0x6dc   sha512_checker   decrypt_firmware tear down  Summary  Testing against other encrypted D-Link images Unpacking D-Link DIR3060 - A quick analysis   Conclusion   Let...", "posttime": "2020-07-16 23:24:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "link,分析", "title": "反向D-Link固件加密", "title_en": "Reversing the D-Link firmware encryption", "transed": 1, "url": "https://0x00sec.org/t/breaking-the-d-link-dir3060-firmware-encryption-static-analysis-of-the-decryption-routine-part-2-2/22260", "via": "", "real_tags": ["link", "分析"]}, {"category": "", "categoryclass": "", "imagename": "34a5e8bdb8ea8d6cf59a7710a6f5f8e9.jpg", "infoid": 1012298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一，谷歌宣布未来几年将在印度投资100亿美元。两天后，该公司披露了一个关键细节：近一半的资金将流向亚洲首富拥有的一家顶级电信运营商。\n谷歌首席执行官桑达尔·皮查伊周三在推特上表示，这家互联网巨头将向Jio平台投资45亿美元，这是为印度数亿没有智能手机的人提供更多接入服务计划的一部分。Jio&39；的所有者穆凯什·安巴尼(Mukesh Ambani)的净资产超过700亿美元。\n周一，谷歌在一场有包括皮查伊在内的谷歌关键高管和印度政府成员参加的在线活动上首次公布了100亿美元的印度数字化基金。该公司表示，这笔资金将用于为印度人提供廉价的互联网接入，将该国的中小企业数字化，并在医疗保健、农业和教育等领域使用人工智能。\n在过去的几年里，印度已经成为美国大型科技公司在美国和欧洲以外寻求增长的一个关键市场。超过5亿印度人-略低于全国人口的一半-现在都在上网，几乎所有人都使用运行谷歌Android操作系统的廉价智能手机。\n这种增长大部分是由Jio推动的。实业家安巴尼创立了Jio，并向其注资350亿美元，用高速4G网络覆盖全国，将数据价格降至几分钱。此举在印度引发了一场电信价格战，使Jio成为印度最大的电信运营商，拥有超过3.88亿用户-超过了美国的总人口。Jio计划通过推出电子商务、流媒体电视、音乐服务、在线游戏和视频会议应用程序等基于互联网的服务来实现增长。\n两家公司表示，作为Jio投资的一部分，谷歌和Jio还将合作，为5亿多仍无法上网的印度人创造一款负担得起的入门级Android智能手机。\n在过去的三个月里，来自世界各地的投资者向Jio平台投入了200亿美元。今年4月，Facebook宣布将以57亿美元收购该公司近10%的股份。Facebook的投资紧随其后的是美国私募股权公司General Atlantic、Vista Equity Partners和Silver Lake Partners，以及芯片巨头英特尔(Intel)和高通(Qualcomm)。", "note_en": "On Monday, Google announced that it will invest $10 billion in India over the next few years. Two days later, the company revealed a key detail: Nearly half of the money will go to a top telecom operator owned by Asia’s richest man.\n The internet giant will invest $4.5 billion into Jio Platforms as part of a plan to provide &#34;increase access for the hundreds of millions in India who don&#39;t own a smartphone,&#34; Google CEO Sundar Pichai  tweeted Wednesday. Mukesh Ambani, Jio&#39;s owner, has  a net worth of more than $70 billion.\n Google first unveiled the $10 billion Digitization Fund for India on Monday at an online event featuring key Google executives, including Pichai, and members of the Indian government. The company  said that the money would go towards providing Indians with inexpensive internet access, digitizing the country’s small and medium businesses, and using artificial intelligence in areas like healthcare, agriculture, and education.\n Over the last few years, India has become a key market for large American tech companies as they seek growth beyond the United States and Europe. More than 500 million Indians — just under half the country’s population — are now online, and nearly all of them use inexpensive smartphones that run Google’s Android operating system.\n Most of that growth has been fueled by Jio. Ambani, an industrialist, founded Jio and  pumped it with $35 billion to blanket the country with a high-speed 4G network, which brought the price of data down to pennies. The move launched a telecom pricing war in India and made Jio the country’s largest telecom carrier with over 388 million subscribers — more than the entire population of the United States. Jio plans to grow by rolling out internet-powered services such as e-commerce, streaming TV, music services, online gaming, and video conferencing apps.\n As part of the Jio investment, Google and Jio will also work together to create an affordable, entry-level Android smartphone for more than 500 million Indians who still don&#39;t have access to the internet, both companies said.\n Over the last three months, investors from around the world have  poured in $20 billion into Jio Platforms. In April, Facebook  announced that it would buy nearly 10% of the company for $5.7 billion. Facebook’s investment was followed by American private equity firms General Atlantic, Vista Equity Partners, and Silver Lake Partners, as well as chip giants Intel and Qualcomm.", "posttime": "2020-07-16 23:04:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,印度,richest,jio", "title": "谷歌称将在印度投资100亿美元。其中近一半捐给了这个国家的首富。", "title_en": "Google Said It Would Invest $10 Billion In India. Nearly Half Of It Is Going To The Country's Richest Man.", "transed": 1, "url": "https://www.buzzfeednews.com/article/pranavdixit/google-jio-investment-india-mukesh-ambani", "via": "", "real_tags": ["google", "谷歌", "印度", "richest", "jio"]}, {"category": "", "categoryclass": "", "imagename": "d6bfe4fecdaadfcd1a78b5b20ab69510.jpg", "infoid": 1012297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Active Surgical的ActivEdge平台使用从手术器械收集的数据，配备了该公司创建的传感器，以收集实际手术过程中的实时数据。然后，这些数据被用来为机器学习和基于人工智能的可视化的发展提供信息，这些可视化可以为外科医生和外科系统提供指导，帮助他们减少潜在错误的发生，并最终改善患者的预后。\n该公司的主要目标是为手术视觉领域带来技术创新，该领域仍然主要依赖于使用荧光染料等方法，这些方法可以追溯到70多年前。Active希望使用计算机视觉来提供外科医生自己无法看到的东西的实时视觉洞察力，并最终利用这些洞察力来驱动下一代协作式手术机器人，甚至最终实现完全自主的机器人手术过程。\nActivSight是该公司在其ActivEdge平台产品中推出的第一款产品，是一种小型的、可连接到现有腹腔镜和关节镜手术器械上的成像支架。该公司目前正在跟踪让他们的硬件获得FDA的批准，以便在今年第四季度使用，并正在与八家医院合作伙伴在美国进行试点项目。", "note_en": "Activ Surgical’s    ActivEdge platform uses data collected from surgical implements, outfitted with sensors created by the company to collect real-time data during the actual surgical process. That data is then used to inform the development of machine learning and AI-based visualizations that can provide guidances to surgeons and surgical systems to help them reduce the occurrence of potential errors, and ultimately improve outcomes for patients.\n The company’s primary aim is to bring technological innovation to the sphere of surgical vision, which still relies primarily on methods like using fluorescent dyes that date back more than 70 years. Activ wants to use computer vision to provide real-time visual insight into things that surgeons wouldn’t be able to see on their own – and ultimately to use those insights to power the next generation of both collaborative surgical robots, and eventually even fully autonomous robotic surgical procedures.\n  ActivSight is the company’s first product in its ActivEdge platform offering, and is a small, connected imaging coddle that can be attached to existing laparoscopic and arthroscopic surgical instruments. The company is currently tracking towards getting their hardware cleared by the FDA for use by Q4 this year, and are working with eight hospital partners for pilot projects in the U.S.", "posttime": "2020-07-16 23:03:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,surgical", "title": "\nActive Surgical筹集1500万美元推进自主和协作机器人手术", "title_en": "\n\t\t\t\tActiv Surgical raises $15 million to advance autonomous and collaborative robotic surgery\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/16/activ-surgical-raises-15-million-to-advance-autonomous-and-collaborative-robotic-surgery/", "via": "", "real_tags": ["机器人", "surgical"]}, {"category": "", "categoryclass": "", "imagename": "b78ccdbc8f957165e2023dfb11c40bc1.jpg", "infoid": 1012296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司刚刚宣布了一轮1.25亿美元的融资，将其估值推高至超过12亿美元，使其成为西雅图地区为数不多的几家价值10亿美元的“独角兽”初创公司之一。\nQumulo于2012年推出，押注公司将需要帮助存储和管理大量文件数据。现在，Qumulo为现代、Cinesite Studios、Telus等客户处理了超过1500亿个文件。\nQumulo首席执行官比尔·里希特(Bill Richter)表示：“我们都关注数据意识。”“数据感知可以治愈数据失明，这是当今组织面临的一个真正问题，特别是在我们所说的规模上。”\nRichter说，越来越多内容的数字化只会增加对Qumulo基于云的平台的需求，特别是在加速采用数字技术的大流行时期。\n例如，Qumulo的客户之一是华盛顿大学的健康指标与评估研究所(IHME)。在过去的几个月里，该小组发布了一致的新冠肺炎预测和数据可视化-这是一项需要大量数据存储和分析的任务。\n里希特说：“危机一开始，他们就打电话给我们，说‘你们必须帮助我们，我们必须更快地扩大规模。’”\n包括Auth0和Extreach在内的西雅图地区其他独角兽企业科技公司最近也看到需求增加，并筹集了更多风险资本来推动增长，即使在经济危机期间也是如此。\nQumulo主要专注于医疗保健、媒体/娱乐、研究计算和公共部门行业。它的软件可以与各种云服务以及内部部署配合使用。\n该公司还与HPE合作，在HPE硬件上销售Qumulo软件，并在亚马逊网络服务(Amazon Web Services)和谷歌云(Google Cloud)上提供其文件系统的一个版本。\nAWS、Google Cloud和Microsoft Azure等平台提供自己的文件存储服务，但Richter表示，Qumulo的客户需要更灵活的服务。\n他说：“他们希望拥有一个可以跨越云和私有环境的单一文件数据平台，这样他们就可以构建这些应用程序和大型数据集，然后能够移动它们。”\nQumulo上一次融资是在2018年，获得了9300万美元的D系列融资。自那以后，它的估值翻了一番。\n这家拥有315名员工的公司仍有充足的现金，但投资者看到了加倍押注的机会。在最近一个季度，Qumulo的收入几乎是去年同期的三倍。\n贝莱德在E系列融资中处于领先地位。Highland Capital Partners、Madrona Venture Group、Kleiner Perkins和Amity Ventures也参与其中。到目前为止，总资金为3.51亿美元。\nMadrona董事总经理马特·麦克罗文(Matt McIlwain)在一份声明中说：“Qumulo处于完美的地位，可以帮助公司拥抱数字优先的应用程序和工作流程时代，这些应用程序和工作流程现在对如何完成工作至关重要。”\n里希特说，这笔钱将用于帮助客户获得“关于他们数据的更多情报”，并将Qumulo的产品销售给南美和亚洲的客户。与许多其他科技初创公司不同的是，Qumulo今年也在招聘员工，并避免了裁员。\n当被问及首次公开募股(IPO)时，里希特表示这是一种“可能性”，但没有进一步置评。\n里希特也是Madrona的风险合伙人，于2016年加入Qumulo。他之前是数据存储公司Isilon Systems的高管，该公司于2010年以22.5亿美元的价格出售给EMC。\n在本周接受GeekWire的视频采访中，里希特的办公室里可以看到一块Isilon牌匾，这让人想起了西雅图科技史上最大的收购之一。\n但里希特认为，Qumulo可以走得更远，因为它占据了一个潜在市场，他估计几年后将达到250亿美元。\n“实际上，Isilon创造了一个比竞争对手更好的盒子，”他说。“世界已经远远超越了盒子。虽然数据规模的根本挑战仍然存在，但没有人想通过购买更多的盒子来解决这个问题。你想通过公有云中的软件来解决。“。\n彼得·戈德曼(Peter Godman)、尼尔·法坎(Neal Fachan)和亚伦·帕西(Aaron Passey)-也是Isilon的前员工-八年前创立了Qumulo。里希特上任时，戈德曼辞去了首席执行官一职，并于2018年离开公司。法昌仍然是首席科学家。帕西于2016年离开，现在是Dropbox的首席工程师。\nGeekWire Space&amp；Science-获奖航空航天和科学编辑艾伦·博伊尔(Alan Boyle)每周头条", "note_en": "The company just announced a $125 million funding round that propels its valuation to more than $1.2 billion, making it one of a handful of “unicorn” billion-dollar startups in the Seattle region.\n Qumulo launched back in 2012, betting that companies would need help storing and managing large amounts of file data. There are now more than 150 billion files handled by Qumulo for customers such as Hyundai, Cinesite Studios, Telus, and others.\n  “We’re all about data awareness,” said Qumulo CEO  Bill Richter. “Data awareness cures data blindness, which is a real problem at organizations today, especially at the scale we’re talking about.”\n The digitization of more and more content has only increased demand for Qumulo’s cloud-based platform, Richter said, and particularly amid a pandemic that is accelerating the adoption of digital technologies.\n For example, one of Qumulo’s customers is the University of Washington’s Institute for Health Metrics and Evaluation (IHME). The group has put out consistent COVID-19 projections and data visualizations over the past several months — a task that requires a huge amount of data storing and analysis.\n “They called us at the onset of the crisis and said ‘you have to help us, we have to scale faster,&#39;” Richter said.\n  Other Seattle-area unicorn enterprise tech companies including  Auth0 and  Outreach are also seeing increased demand as of late and have raised more venture capital to fuel growth, even amid the economic crisis.\n  Qumulo focuses primarily on healthcare, media/entertainment, research computing, and the public sector industries. Its software works with various cloud services, as well as on-premise.\n The company has also  partnered with HPE to sell Qumulo software on HPE hardware, and offers  a version of its file system on Amazon Web Services and  Google Cloud.\n Platforms such as AWS, Google Cloud, and Microsoft Azure offer their own file storage services, but Richter said Qumulo’s customers require something more flexible.\n   “They want to have a single file data platform that can span clouds and private environments, so they can build these applications and large datasets and then be able to move them around,” he said.\n  Qumulo last raised capital in 2018,  reeling in a $93 million Series D round. Its valuation has doubled since then.\n The 315-person company still had plenty of cash, but investors saw an opportunity to double down. Qumulo’s revenue nearly tripled year-over-year in the most recent quarter.\n BlackRock led the Series E round. Highland Capital Partners, Madrona Venture Group, Kleiner Perkins, and Amity Ventures also participated. Total funding to date is $351 million.\n “Qumulo is perfectly positioned to help companies embrace the digital-first era of applications and workflows that are now essential to how work gets done,” Madrona Managing Director Matt McIlwain said in a statement.\n The money will be used to help customers gain “more intelligence about their data,” Richter said, and also sell Qumulo’s products to customers in South America and Asia. Qumulo is also hiring and has avoided layoffs this year, unlike  many other tech startups.\n Asked about an IPO, Richter said it’s a “possibility” but didn’t comment further.\n Richter, also a venture partner at Madrona,  joined Qumulo in 2016. He previously was an executive at Isilon Systems, a data storage company that sold to EMC  for $2.25 billion in 2010.\n During a video interview with GeekWire this week, Richter had an Isilon plaque visible in his office, a reminder of one of the biggest acquisitions in Seattle tech history.\n But Richter thinks Qumulo can go even bigger as it takes on an addressable market he estimates will reach $25 billion in a few years.\n “Effectively, Isilon created a better box than its competitors,” he said. “The world has moved far beyond the box. While the fundamental challenges of data scale still exists, no one wants to solve that by buying more boxes. You want to solve it through software in the public cloud.”\n Peter Godman,  Neal Fachan, and  Aaron Passey — also former Isilon employees — founded Qumulo eight years ago. Godman stepped down as CEO when Richter came on board, and  left the company in 2018. Fachan remains as chief scientist. Passey left in 2016 and is now a principal engineer at Dropbox.\n      GeekWire Space &amp; Science - Weekly headlines from Alan Boyle, award-winning aerospace and science editor", "posttime": "2020-07-16 23:01:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "文件,led,qumulo", "title": "云文件存储初创公司Qumulo以贝莱德为首的E系列融资1.25亿美元，估值超过12亿美元", "title_en": "Cloud file storage startup Qumulo raises $125M Series E led by BlackRock, at a valuation of more than $1.2B", "transed": 1, "url": "https://www.geekwire.com/2020/seattles-newest-billion-dollar-startup-qumulo-reaches-unicorn-status-125m-round/", "via": "", "real_tags": ["文件", "led", "qumulo"]}, {"category": "", "categoryclass": "", "imagename": "d83700989f9b19a9b17b5cec4d9a69ec.jpg", "infoid": 1012295, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1998年，民谣歌手珠儿出版了一本名为“无甲之夜”的诗集。(你看，标题是个双关语。它玩的是谐音“夜”和“骑士”.。哦，你看到了吗？好的，没关系。)。它不是特别令人兴奋-充其量，它展示了你从一位无害的咖啡馆果酱大师那里期待的东西-但它卖出了很多拷贝。珠儿正处于她由莉莉丝·费尔和VH1主演的明星生涯的巅峰时期，这本书似乎在巴恩斯和诺布尔的每一个海岸都有售。就像追随她的男孩乐队和流行歌星一样，那一年她的销量超过了里尔克(可能是)，因为她是一个众所周知的名字。98年，单一种植业发展势头强劲。我的观点-我确实有一个观点-是当时的流行文化与现在没有太大不同。然而，这些天来，排行榜冠军，也就是每个人听得最多的人，都是打着蓝色复选标记的人。\n昨天，那些拿着蓝色方格的人，那些“经过验证”的社交媒体用户，发现自己在Twitter上沉默了。周三下午，埃隆·马斯克(Elon Musk)、坎耶·韦斯特(Kanye West)、比尔·盖茨(Bill Gates)、杰夫·贝佐斯(Jeff Bezos)、巴拉克·奥巴马(Barack Obama)和其他许多推特超级用户的账户被攻破，似乎是为了实施比特币骗局。为了止血，Twitter屏蔽了经过验证的账户发布消息。突然间，许多推特上的吹牛大王被拒之门外；谈话的驱动者戴上了口罩，公众掌握了控制权。大自然在疗伤。那是一个晚上，或者至少几个小时，没有复选标记。\n坦率地说，这可能是一段时间以来在Twitter上发生的最好的事情。不，这对包括“连线”在内的数十名用户来说并不好玩，他们担心自己账户的安全；想到这样的黑客攻击可能带来的巨大伤害，也是令人恐惧的。但对于其他所有人--那些通常不会挥舞最大扩音器的人--来说，这里是天堂。自负的废话少了；政客少了。即使是新闻媒体也被拒之门外，在这个末日滚滚的时代，这可能是一种祝福。特朗普总统甚至可能有一分钟无法插话。特朗普!。这一切感觉就像是80年代电视喜剧中的一个深褐色的梦。\n当然，大静音很快就结束了。到周三晚上，大多数经过核实的账户已经返回。但在那里有一段很短的时间，Twitter是由追随者统治的，而不是追随者。感觉就像是过去的日子，在Twitter成为一项影响选举的服务之前，当时都是一群笨蛋试图用140个字符或更少的字符来逗对方笑。(我们曾经这么年轻吗？)。\n听着，尽管这件作品充满了怀旧之情，但这并不是什么戴着玫瑰色眼镜回首往事的俗套尝试。(然而，这是一种试图使用大量陈词滥调的做法。)。推特一直都有好蛋和坏蛋--或者至少在2017年之前是这样。它一直是分享智慧和传播坏想法的地方。但是整个核查系统总是感觉有点脱节，好像它给了一些人的想法和意见比另一些人更重的分量。对一些人来说，这是一种字面上的地位象征。对其他人来说，这似乎是平台的认可--当白人至上主义者得到蓝色支票时，这就成了一个更大的问题。对于几乎每个人来说，它创造了一个受欢迎的孩子统治的环境。周三，在很短的一段时间内，这一切都改变了，Twitter对此更有利。快看啊。\n如果您在我们的故事中使用链接购买东西，我们可能会赚取佣金。这有助于支持我们的新闻事业。了解更多。\n👁如果处理得当，人工智能可以使警务更加公平。另外：获取最新的人工智能新闻。\n苹果(📱)在最新款手机之间左右为难？永远不要害怕-查看我们的iPhone购买指南和最喜欢的Android手机", "note_en": "In 1998, folk singer Jewel released a book of poetry called   A Night Without Armor. (The title was a pun, you see. It plays with the homophones “night” and “knight” ... Oh, you do see? OK, never mind.) It wasn’t particularly mind-blowing—at best, it featured what you’d expect from a master of the inoffensive coffeehouse jam—but it sold  a lot of copies. Jewel was at the height of her Lilith Fair-and-VH1-powered stardom, and the book seemed to be at every Barnes &amp; Noble coast-to-coast. Like the boy bands and pop stars who would come after her, she outsold Rilke that year (probably), because she was a name everyone knew. Monoculture was strong in ‘98. My point— and I do have one—is that pop culture back then wasn’t much different then than it is now. These days, though, the chart-toppers, the people everyone listens to most, are the people with the blue checkmarks.\n  Yesterday, those people with the blue checks, those “verified” social media users,  found themselves silenced on Twitter. Elon Musk, Kanye West, Bill Gates, Jeff Bezos, Barack Obama, and a host of other Twitter mega-users  had their accounts compromised Wednesday afternoon in what appeared to be an attempt to pull off a bitcoin scam. To staunch the bleeding, Twitter blocked verified accounts from posting messages. Suddenly, many a Twitter blowhard was locked out; the drivers of conversation were muzzled, and the plebes had the controls.  Nature was healing. It was a night, or at least a few hours, without checkmarks.\n  Frankly, it might be the best thing to happen on Twitter in a while. No, it wasn’t fun for the scores of users, including  WIRED, who feared for the safety of their accounts; it’s also horrifying to think of the magnitude of harm a hack like this could potentially bring. But for everyone else—the people who normally don’t wield the largest megaphones—it was paradise. Fewer self-important windbags; fewer politicians. Even news outlets were being locked out, and in the era of  doomscrolling, this can be a blessing. There might’ve even been a minute there where President Trump couldn’t get a word in edgewise. Trump! It all felt like one of those sepia-toned dreams in an ‘80s TV comedy.\n The Great Muting ended pretty quickly, of course. By Wednesday night most of the verified accounts had returned. But for a brief period there, Twitter was ruled by the followers, not the followed. It felt like the old days, before Twitter became a service that swung elections, back when it was all a bunch of jerkoffs trying to make each other laugh in 140 characters or fewer. (Were we ever so young?)\n  Look, even though this piece is drenched in nostalgia, this isn’t some corny attempt to look back with rose-colored glasses. (It is, however, an attempt to use a lot of cliches.) Twitter has always had good eggs and bad eggs—or at least it did  until 2017. It’s consistently been a place for the sharing of wisdom and the airing of bad ideas. But the entire verification system has always felt a little off, like it gave some people’s thoughts and opinions more weight than others. To some, it was a literal status symbol. To others, it seemed like an endorsement from the platform—something that becomes an even bigger problem when  white supremacists get blue checks. And to nearly everybody, it creates an environment where the popular kids rule. On Wednesday, for a brief moment, all of that changed, and Twitter was better for it. Check it out.\n                If you buy something using links in our stories, we may earn a commission. This helps support our journalism.  Learn more.\n   👁 If done right, AI could  make policing fairer. Plus:  Get the latest AI news\n 📱 Torn between the latest phones? Never fear—check out our  iPhone buying guide and  favorite Android phones", "posttime": "2020-07-16 23:00:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,认证,verified,twitter", "title": "Twitter在认证账户无法推特的情况下表现最好", "title_en": "Twitter Is at Its Best When Verified Accounts Can’t Tweet", "transed": 1, "url": "https://www.wired.com/story/twitter-unverified-takeover/", "via": "", "real_tags": ["推特", "认证", "verified", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012294, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用一级延续，可以将非确定性(或模糊性)选择&34；过程添加到语言中：AMB。AMB过程获取一个值列表，并从中选择一个。这里的问题是，AMB必须选择一个值，以便在计算的将来遇到的所有ASSERT语句都为真。例如，下面的Scheme代码：(#*_)。\n((a(amb(List 1 2 3 4 5 6 7)(b(amb(List 1 2 3 4 5 6 7)(c(amb(List 1 2 3 4 5 6 7)；我们正在寻找合法权利的维度；使用毕达哥拉斯定理的三角形：(assert(=(*c)(+(*a)(*b)；并且，我们希望第二条边较短：(。打印出答案：(display(list a，b，c))(换行符)。\n打印输出(4 3 5)。AMB过程选择这些值，这样当稍后遇到断言时，它们就是真的。\n有了amb，编写一个SAT解析宏非常简单，因此：计算结果为(#f#f#t)。也就是说，宏(Sat-solve公式正文)绑定公式中的自由变量，以便公式求值为TRUE，然后在这些令人满意的赋值的上下文中求值正文表达式。\n具体地说，延续是表示计算中剩余步骤的过程。对于表达式3*(f()+8)，考虑在计算表达式f()之后计算中的剩余步骤。例如，在C/Java中，过程CURRENT_CONTINUATION是对f()调用的继续：\nvoid CURRENT_CONTINUATION(Int Result){result+=8；result*=3；(3*(f()+8)的延续)(Result)；}。\n一些语言(如Scheme和SML/NJ)提供了一种将当前延续捕获为一级值的方法。在Scheme中，带有当前延续的过程调用(通常缩写为call/cc)接受一个过程，并传递当前计算的延续。\n在表达式主体的执行过程中，变量current-Continution被绑定到当前Continue，如果被调用，current-Continution会立即从call/cc调用返回，call/cc返回传递给current-Continution的任何值。\n(DISPLAY(call/cc(lambda(Cc)(display&#34；I get here.\\n&#34；)(cc&#34；此字符串已传递给延续.\\n&#34；)(display&#34；但不在此处。\\n&#34；)。\n一流的延续之所以如此强大，是因为即使在对call/cc的调用完成之后，仍然可以调用该延续。例如，以下代码导致打印将永远调用(启动)的无限循环：\n(让((start#f))(if(Not Start)(call/cc(lambda(Cc)(set！start cc)(DISPLAY&#34；将调用(START)\\n&#34；)(START)。\n就其本身而言，call/cc可以对Continuations做任何您可能需要做的事情，但它不是最方便的API。当使用Continuations进行编程时，我建议使用a helper过程current-Continution：\n然后，您可以使用条件模式来检测连续是刚刚创建的，还是从以后的某个点调用了延续：\n用户定义的谓词未来值？应该能够识别传递给Continue的值。(有些Scheme实现支持Continue？，应该使用哪个而不是Procedure？(如果有的话。)。\n现在，我们可以在简介中揭示如何编写预告式示例。在幕后，过程amb和assert通过失败堆栈相互通信。&#34；失败堆栈的顶部包含只要断言失败就要调用的下一个延续。当断言失败时，它调用过程Fail，该过程弹出失败堆栈并调用结果。amb过程在失败堆栈之上推入一个新的Continue，并选择。\n异常很容易用大陆实现，当抛出异常时，控制需要返回到第一个封闭的try窗体。\n要使用Continuations创建此行为，tryforms在评估其主体之前捕获当前Continue。在Scheme中，try的实现还将使用Dynamic-Wind来维护异常处理程序堆栈。\n在评估(Do-Tunk Do-thunk Do-thunk)时，运行时将确保每当执行进入Do-Tunk内的计算的动态范围时都会调用BEFORE-THUNK，而每当执行离开计算的动态范围时就会调用After-Tunk。\ntry块可以通过使用之前的thunk来推送异常处理程序，使用之后的thunk来弹出异常处理程序来利用此行为。\n生成器是迭代过于复杂的数据结构(如树和图形)问题的一种很好的解决方案。想象一下，您想要编写如下所示的for循环：一些语言(如Java)允许自定义迭代器，因此您可以编写如下内容：但是，如何编写迭代器t？您可以遍历树并将其转换为数组或列表，但这效率很低--您分配的资源比需要的多，实际上您最终只能迭代两次。有效的解决方案(在Java这样的语言中)是编写一个迭代器。而且它不是#39；I don‘我感觉不自然。(试着写出来！)。\n简单的树遍历更容易编写，如果语言支持一级延续，那么您可以使用树遍历方法来迭代，而不需要中间数据结构的开销。\n生成器是一个接受Year过程作为参数的过程，期望它将迭代某些数据结构，并在数据结构中的每个元素上调用Year。通过延续，我们可以检测生成器，使其适合于无开销FOR样式的迭代。\n关键思想是在两个Continuation之间切换--一个在TheLoop中，另一个在生成器中，当循环需要另一个值时，它会切换到生成器内部的Continuation(传递给它一个循环的Continution)，一旦生成器有了一个值，它就会传回一个值(加上生成器的一个新的Continue)。\n延续使得实现协作性多线程变得简单(并且使用宏，模拟抢占式多线程并不困难)。\n在协作式多线程中，线程必须手动放弃控制；它不会被抢占地切换出去。", "note_en": "Using first-class continuations, it is possible to add a&#34;non-deterministic (or ambiguous) choice&#34; procedure to a language:  amb.The  amb procedure takes a list of values, and chooses one of them.The catch here is that  amb must choose a value so thatall  assert statements encountered in the  futureof the computation are true.For example, the following Scheme code:\n (let ((a (amb (list 1 2 3 4 5 6 7))) (b (amb (list 1 2 3 4 5 6 7))) (c (amb (list 1 2 3 4 5 6 7)))) ; We&#39;re looking for dimensions of a legal right ; triangle using the Pythagorean theorem: (assert (= (* c c) (+ (* a a) (* b b)))) ; And, we want the second side to be the shorter one: (assert (&lt; b a)) ; Print out the answer: (display (list a b c)) (newline))\n prints out  (4 3 5).The  amb procedure chose these values so that whenthe assertions were encountered later on, they were true.\n  With  amb available, it&#39;s trivial to write a SAT-solving macro, so that:   evaluates to  (#f #f #t). That is, the macro  (sat-solve  formula  body) binds the free variables in the formula so that the formula evaluates to true, and then it evaluates the body expression in the context of these satisfying assigments.\n   Concretely, a continuation is a  procedure that represents the remaining steps in a computation. For the expression  3 * (f() + 8), think about the remaining steps in the compuation after evaluating the expression  f(). For example, in C/Java, the procedure  current_continuation is the continuation of the call to  f():\n void current_continuation(int result) { result += 8 ; result *= 3 ; ( continuation of 3 * (f() + 8))(result) ;}\n  Some languages (like Scheme and SML/NJ) provide a way to capturethe current continuation as a first-class value.In Scheme, the procedure  call-with-current-continuation(often abbreviated  call/cc) takes a procedure, and passesit the current continuation of the computation.\n   During the execution of the expression   body,the variable   current-continuation is bound to the current continuation.If invoked,   current-continuation immediately returns from the call to  call/cc, and  call/cc returns whatever value was passed to   current-continuation.\n  (display (call/cc (lambda (cc) (display &#34;I got here.\\n&#34;) (cc &#34;This string was passed to the continuation.\\n&#34;) (display &#34;But not here.\\n&#34;))))\n   What makes first-class continuations so powerful is that thecontinuation may still be called even  after the call to call/cc is finished. For example, the following causesan infinite loop that prints  Going to invoke (start)forever:\n (let ((start #f)) (if (not start) (call/cc (lambda (cc) (set! start cc)))) (display &#34;Going to invoke (start)\\n&#34;) (start))\n  By itself,  call/cc can do anything you might need to dowith continuations, but it is not the most convenient API.When programming with continuations, I recommend using the a helperprocedure,  current-continuation:\n   Then, you can use a conditional pattern to detect whether thecontinuation was just created, or the continuation has been invokedfrom some later point:\n  The user-defined predicate   future-value? should be able toidentify the value passed to the continuation.(Some Scheme implementations support  continuation?, which should be usedinstead of  procedure? if it&#39;s available.)\n      Now we can expose how it was possible to write the teaser examplesin the introduction.Under the hood, the procedures  amb and  assertcommunicate with each other through a &#34;fail stack.&#34;The top of the fail stack contains the next continuation to be invokedwhenever an assertion fails.When an assertion fails, it invokes the procedure  fail,which pops the fail stack and invokes the result.The  amb procedure pushes a new continuation on top of thefail stack, selects the first value in the list, and then removes it.If the list is empty, then the procedure  amb invokes theprocedure  fail.\n  Exceptions are easily implemented with continations.When an exception is thrown, control needs to return to the firstenclosing  try form.\n To create this behavior with continuations,  tryforms capture the current continuation before evaluating their body.In Scheme, an implementation of  try will also use dynamic-wind to maintain a stack of exception handlers.\n When evaluating  (dynamic-wind  before-thunk do-thunk  after-thunk), the run-time will ensurethat   before-thunk is called whenever executionenters the &#34;dynamic extent&#34; of the computation within  do-thunk,and   after-thunk is called whenever executionleaves the &#34;dynamic extent&#34; of the computation.\n The  try block can exploit this behavior by using the before-thunk to push the exception handler, and the after-thunk to pop the exception handler.\n  Generators are an elegant solution to the problem of iterating overcomplex data structures like trees and graphs.Imagine you want to write a  for loop like the following: Some languages (like Java) allow custom iterators, so you could write something like: But, how do you write the iterator  t?You could do a walk over the tree and turn it into an array or a list,but this is inefficient--you allocate more than you need to, and youessentially end up iterating twice.The efficient solution (in a language like Java) is to write aniterator that remembers where it is in the search of the tree.This is difficult to get right, and it doesn&#39;t feel natural.(Try writing it!)\n A simple tree walk is easier to write.If the language supports first-class continuations, then you can usethe tree walk approach to iterate  without the overhead of anintermediate data structure.\n A generator is a procedure that accepts a  yieldprocedure as an argument, with the expectation that it will iterate over some data structureand call yield on every element within the data structure.With continuations, we can instrument a generator to make it suitablefor overheadless for-style iteration.\n The key idea is to toggle between two continuations--one in theloop, and the other in the generator.When the loop needs another value, it will switch to the continuationinside the generator (passing it a continuation for the loop), andonce the generator has a value, it will pass a value back (plus a newcontinuation for the generator).\n  Continuations make it straightforward to implement cooperativemulti-threading (and with macros, it is not difficult to simulatepreemptive multithreading.)\n In cooperative multithreading, a thread must yield controlmanually; it will not be preemptively switched out.", "posttime": "2020-07-16 23:00:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "线程,旅行,exceptions,过程", "title": "举例说明：异常、时间旅行搜索、线程等", "title_en": "Continuations by example: Exceptions, time-traveling search, threads, and more", "transed": 1, "url": "http://matt.might.net/articles/programming-with-continuations--exceptions-backtracking-search-threads-generators-coroutines/", "via": "", "real_tags": ["线程", "旅行", "过程"]}, {"category": "", "categoryclass": "", "imagename": "2176e3becb4877dafce56b0edceeec05.jpg", "infoid": 1012293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约(CNN商业报道)在美国，冠状病毒大流行暴露了许多类型的不平等，其中之一就是那些可以在家上网的人和那些不能上网的人之间的数字鸿沟。\n特别是在该国的农村地区，许多人无法接入宽带互联网，因此难以参与远程学习、工作和医疗保健，而这些工作让其他人能够在危机期间适应。\n微软(Microsoft)和农业合作社Land O&39；Leaves联合推出了一项新举措，旨在解决这个问题，方法是将宽带和其他服务(如免费WiFi和数字技能培训)带给Land O&39；Lake拥有农场的19个州的农村社区。\n如果你想想今天的农村社区，如果整个社区都能得到教育、提高技能、健康和……，他们就会蓬勃发展。周三，微软首席执行官萨蒂亚·纳德拉在接受美国有线电视新闻网(CNN)的朱莉娅·查特利(Julia Chatterley)采访时表示，电子商务和其他设施可以直接到达他们所在的地方。这就是为什么宽带是如此基本的权利。\n这是一个需要填补的重大空白。根据美国人口普查局2018年的估计，近15%的美国家庭没有家庭互联网订阅。对于低收入者来说，这一比例是全国平均水平的两倍多。\n这一努力是一个更大合作伙伴关系的一部分，该合作伙伴关系还包括在Land O&39；Lake农场部署人工智能、云和物联网(IOT)等微软技术，这些技术将使农民能够获得实时数据，以做出关键决策，并帮助他们推进可持续的农业实践。\n两家公司表示，这项新技术预计将帮助农场更好地应对气候变化、贸易问题和大流行导致的需求变化等中断。\nLand O&39；Lake首席执行官贝丝·福特说，在农场部署这种新的创新，并确保整个农业社区都能受益，这不仅仅是一个方便的问题。\n与安全、负担得起的食品供应合作，进而创造就业机会，使我们的农村社区充满活力是至关重要的。福特说，这是一个国家安全问题。例如，技术是缩小医疗保健差距的推动者……。这对这些社区的稳定和活力至关重要，而这些社区对美国、对我们的农业系统和我们的食品系统都是至关重要的。\n高管们还讨论了劳动力多样性，这是目前对美国企业界至关重要的另一个话题。\n今年夏天，乔治·弗洛伊德(George Floyd)死于警方之手，在全国范围内掀起了一波争取种族正义的示威浪潮。这场运动包括呼吁企业确保机会，包括最高领导职位的角色，为黑人和其他有色人种提供机会。\n福特说，对于总部设在明尼苏达州明尼阿波利斯的Land O&39；Lake来说-弗洛伊德于5月25日在那里遇害-这个问题尤其离家很近。\n福特说，对于明尼阿波利斯的非裔美国人和黑人社区来说，不同的结果是不可接受的。我们必须继续取得进展，我们必须做得更好的一件事是我们必须倾听，我们必须倾听恐惧，倾听问题…。在我们真正了解这一点并采取行动之前，我们将会遇到这样的问题。\n福特表示，兰德湖已经对其员工实施了无意识的偏见培训，并正在努力让我们组织内的不同人群保持透明。\n目前，Land O&#39；Lake的16人高管团队中有两名成员是黑人，其中30%是女性。兰德·奥莱克斯拒绝提供有关该公司较低级别领导层多样性的信息。\n在微软，纳德拉说，他的薪酬现在在一定程度上与确保多样化的员工队伍挂钩。\n纳德拉说，(代表权)需要一直反映到最高层。因此，我们现在有了承诺，无论是关于种族，特别是对非裔美国人、黑人和拉丁裔社区，以及性别……。我，我自己，是按它来衡量的，并为此付钱。&#34；\n微软的16人高管团队包括三名有色人种(包括出生于印度的纳德拉)，没有黑人和两名女性。\n在2019年的美国，公司董事级别的领导团队中有20%是女性。近37%的董事级别的领导层是非白人，但黑人只占董事的2.5%。同样，女性占微软经理层领导层的25%，非白人占经理层的38%，黑人占经理层的2.7%。\n纳德拉和福特都表示，他们正在努力确保他们的努力不仅仅是数字。\n纳德拉说，只有在你拥有包容文化的情况下，代表性才能持续下去，所以这是你必须工作的日常做法--每一次会议，每一次晋升决定。\n纳德拉还称赞了白宫取消一项规定的决定，该规定将禁止只参加在线课程的国际学生留在美国。这项政策可能会对严重依赖国际人才的科技行业产生巨大影响。\n他说，我是两个伟大的美国事物的产物：美国的技术让我在成长的地方实现了美国梦，让我可以梦想美国梦，然后是开明的移民政策，让我实现了这个梦想。他说，美国的技术让我在成长的地方实现了美国梦，然后是开明的移民政策，让我实现了这个梦想。坦率地说，移民政策既能让我们带来最优秀、最聪明的人才，又能展示我们的人性，这符合我们自身的利益，因为这是这个国家的软实力。\n更正：这个故事的前一个版本错误地陈述了Land O&39；Lake高管团队中的黑人成员数量。", "note_en": "New York (CNN Business)Among the many types of  inequality in the United States laid bare by the coronavirus pandemic is the  digital divide between those who can access the internet at home and those who can&#39;t.\n Especially in  rural areas of the country, many lack access to broadband internet — and thus have struggled to participate in the remote learning, working and health care that have allowed others to adapt during the crisis.\n A new initiative from  Microsoft  (  MSFT) and  farming cooperative Land O&#39;Lakes aims to tackle that issue by bringing broadband and other services, such as free WiFi and digital skills training to rural communities in the 19 states where Land O&#39;Lakes has farms.\n   &#34;If you think about the rural community today, they are going to thrive if the entire community is able to get the education, the upskilling, the health and ... ecommerce and other facilities directly reaching them where they are,&#34; Microsoft CEO Satya Nadella said in an interview with CNN&#39;s Julia Chatterley on &#34;First Move&#34; Wednesday. &#34;That&#39;s why broadband is such a fundamental right.&#34;\n It&#39;s a  major gap to fill. Nearly 15% of American households do not have a home internet subscription, according to  US Census estimates from 2018. For low-income earners, that percentage is more than double the national average.\n  The effort is part of a larger partnership that also includes deploying Microsoft technologies such as artificial intelligence, cloud and internet of things (IOT) on Land O&#39;Lakes farms, which will give farmers access to real-time data to make key decisions and help them advance sustainable agriculture practices.\n  The new technology is expected to help farms better respond to disruptions such as climate change, trade issues and demand changes resulting from the pandemic, the companies say.\n Land O&#39;Lakes CEO Beth Ford said deploying such new innovations on farms — and ensuring that the benefits reach entire farming communities — is more than a matter of convenience.\n &#34;Vibrancy of our rural communities in partnership with a safe, affordable food supply and then creating jobs is critical. It&#39;s a national security issue,&#34; Ford said. &#34;Technology is an enabler, for example, to close the healthcare gap ... It is critical for the stabilization and the vibrancy of these communities that are critical to the United States and to our farm system and our food system.&#34;\n  The executives also discussed  workforce diversity, another  topic of key importance to Corporate America right now.\n The death of George Floyd at the hands of police set off a wave of demonstrations for racial justice across the country this summer. The movement has included  calls on corporations to ensure that  opportunities, including  roles in top leadership positions, are available to Black people and other people of color.\n For Land O&#39;Lakes, which is based in Minneapolis, Minnesota — where Floyd was killed May 25— the issue hits especially close to home, Ford said.\n &#34;The disparate outcomes for the African American and the Black community in Minneapolis is just unacceptable,&#34; Ford said. &#34;We have to continue to make progress, and one of the things we have to do better is we have to listen, we have to listen to the fear, the issues ... Until we really understand that and take action, we&#39;re going to have this kind of issue.&#34;\n  Ford said Land O&#39;Lakes has implemented unconscious bias training for its employees and is working on &#34;being transparent about our diverse populations within our organizations.&#34;\n Currently, two members of the Land O&#39;Lakes  16-person   executive team are Black, and 30% of the team are women. Land O&#39;Lakes declined to provide information on the diversity of the company&#39;s lower-level leadership.\n At Microsoft, Nadella said his compensation is now tied, in part, to ensuring a diverse workforce.\n &#34;(Representation) needs to be reflected all the way to the top,&#34; Nadella said. &#34;So we now have commitments, whether it&#39;s about race, and especially for the African American, Black and Latinx community, as well as gender ... I, myself, am measured on it and paid on it.&#34;\n Microsoft&#39;s 16-person  executive team includes three people of color (including Nadella, who was born in India), no Black people and two women.\n In the United States in 2019, 20% of the company&#39;s director-level leadership team was women. Nearly 37% of director-level leadership was non-white, but Black people made up just 2.5% of directors. Similarly, women made up 25% of Microsoft&#39;s manager level of leadership, non-white people represented 38% of managers and Black people made up 2.7% of managers.\n Both Nadella and Ford said they are working to ensure their efforts extend beyond just numbers.\n &#34;Representation can only be sustained if you have a culture of inclusion, so that&#39;s an everyday practice where you have to work — every meeting, every promotion decision,&#34; Nadella said.\n Nadella also lauded the White House&#39;s  decision to rescind a rule that would have barred international students taking only online courses from staying in the United States. The policy could have had huge implications for the tech industry, which  relies heavily on international talent.\n   &#34;I&#39;m a product of two great American things: American technology reaching me where I was growing up so that I could dream the American dream, and then the enlightened immigration policy that let me live that dream,&#34; he said. &#34;It&#39;s in our self interest, quite frankly, to have an immigration policy that allows us to bring the best and the brightest, as well as show our humanity, because that is the soft power of this country.&#34;\n Correction: A previous version of this story incorrectly stated the number of Black members on the Land O&#39;Lakes executive team.", "posttime": "2020-07-16 22:38:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,microsoft,宽带,ceo,美国", "title": "微软CEO：宽带上网是一项“基本权利”", "title_en": "Microsoft CEO: Broadband internet access is a 'fundamental right'", "transed": 1, "url": "https://edition.cnn.com/2020/07/15/tech/microsoft-land-olakes-broadband-access/index.html", "via": "", "real_tags": ["微软", "microsoft", "宽带", "ceo", "美国"]}, {"category": "", "categoryclass": "", "imagename": "e2cf4cfb0db9dc090398ccb99a5b07ed.jpg", "infoid": 1012292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正在进行的大流行极大地改变了我们维持现有关系的方式，但它也改变了我们开始这些关系的方式，推动了更多的第一次在线相遇，并在约会过程中增加了社交距离。对于约会应用市场来说，这也是一片未知的水域。\n对于Bumble创始人惠特尼·沃尔夫·赫德(Whitney Wolfe Herd)来说，这一巨大的转变发生在她自己角色发生重大变化的几个月后。在Badoo创始人安德烈·安德列夫出售了他创建的约会应用集团的股份后，沃尔夫·赫德接任了MagicLab(最近更名为Bumble)的首席执行官一职，负责其数字约会帝国，其中包括Badoo、Bumble、Lumen和Cappy约会应用。我们很兴奋地宣布，Bumble创始人兼首席执行官惠特尼·沃尔夫·赫德将于今年9月加入我们的Disrupt大会，讨论约会应用市场的未来。\n2019年年中，在一轮突显Badoo性别歧视和不当行为文化的曝光之后，安德列夫将他的股份出售给了黑石集团(Blackstone)。沃尔夫·赫德被任命为MagicLab(现在的Bumble)的掌舵人，MagicLab是Badoo和Bumble的母公司，现在她在在线约会应用领域拥有巨大的影响力。\nBumble本身已经增长到超过1亿用户，而且是以一种在硅谷相对独特的方式做到这一点的。\n除了更名的消息，Bumble还任命了一些新的领导团队成员，包括Tariq Shaukat担任总裁，Ronen Benchetrit担任母公司的首席技术官，以及Tran Taylor，首席人事官。\n听听这一切是如何开始的，以及在线约会世界的下一步是什么，来自沃尔夫·赫德(Wolfe Herd)在9月14日至18日举行的Disrupt 2020大会上。只需245美元，就可以用你的数字专业通行证或数字创业走廊参展商套餐获得前排座位。", "note_en": "The ongoing pandemic has drastically shaped how we maintain existing relationships but it’s also transformed how we get those relationships started, pushing more first encounters online and adding social distance into the dating process. It’s been uncharted waters for the dating app market to weather, as well.\n For Bumble founder  Whitney Wolfe Herd, the massive shift comes months after big changes in her own role. After Badoo founder Andrey Andreev sold off his stake in the dating apps conglomerate he created, Wolfe Herd stepped into the CEO role of MagicLab (which has been newly rebranded to Bumble), taking charge of its digital dating empire which includes the Badoo, Bumble, Lumen and Chappy dating apps. We’re excited to announce that  Bumble   founder and CEO Whitney Wolfe Herd  will be  joining us at Disrupt this September to discuss the future of the dating app market.\n   In mid 2019, following a bout of exposés highlighting a culture of sexism and misconduct at Badoo, Andreev sold off his stake to Blackstone. Wolfe Herd was appointed to the helm of MagicLab (now Bumble), the parent company of Badoo and Bumble, where she now wields outsized influence in the world of online dating apps.\n Bumble itself has grown to more than 100 million users, and done so in a way that is  relatively unique in Silicon Valley terms.\n Alongside the news of the rebrand, Bumble has also made some new appointments to the leadership team, including Tariq Shaukat as President, Ronen Benchetrit as the parent company’s Chief Technology Officer, and Tran Taylor, Chief People Officer.\n Hear how it all got started, and what’s next in the world of online dating, from Wolfe Herd at  Disrupt 2020 on September 14-18. Get a front-row seat with your  Digital Pro Pass for just $245 or with a  Digital Startup Alley Exhibitor Package.", "posttime": "2020-07-16 22:38:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,创始人,founder,约会", "title": "\nBumble创始人惠特尼·沃尔夫·赫德将颠覆2020年", "title_en": "\n\t\t\t\tBumble founder Whitney Wolfe Herd is coming to Disrupt 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/16/bumble-founder-whitney-wolfe-herd-is-coming-to-disrupt-2020/", "via": "", "real_tags": ["2020", "创始人", "founder", "约会"]}, {"category": "", "categoryclass": "", "imagename": "a616d92ccc5113f1ab73fd6e81dd77e7.jpg", "infoid": 1012291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "浓缩咖啡的显示屏有两种不同的尺寸-13.3英寸或15.6英寸。显示器本身非常轻薄，厚度不到0.2英寸，重量不到2磅。显示面板具有触敏功能，它与您在Mac上安装的驱动程序配合使用，以启用触控功能。\n显示屏由玻璃和铝制成，感觉质量非常高，与您的MacBook相得益彰。侧面有两个USB-C和一个迷你HDMI端口，以及一个2.5毫米的迷你立体声插孔用于音频输出。其中一个USB-C端口专用于电源，另一个端口用于连接显示器，还支持通过单线缆连接到现代Mac电脑的电力传输。\nEpresso提供4K分辨率，并提供独特的安装系统，使用磁铁将其固定在可选的折叠式展示架上。该公司还提供了VESA嘴部适配器，用于将其连接到更传统的支架或安装臂上。还有一个软壳，可以在运输过程中保护显示器。\n该公司目前正在通过Indiegogo为显示器的生产提供资金，但即将批量生产，他们派我去测试的装置感觉绝对像是成品。13英寸的售价为249美元，但零售价为320美元，Display 15在正式上市时的零售价为350美元。\n无论是在建筑质量和材料，还是在实际面板图像质量和颜色方面，Espresso显示屏都是竞争对手中的佼佼者。实际上，我最近一直在使用亚马逊(Amazon)购买的15.6英寸便携式显示器，虽然这是一个令人满意的解决方案，可以让我在几个不同的地点工作时扩展我的桌面，但它的色彩渲染和全塑料结构绝对低于标准。\n在我的MacBook Pro上，浓缩咖啡的玻璃和金属结构给人以宾至如归的感觉，虽然我不能完全调整它的颜色来匹配我的苹果输出，但它的内置配置文件总体上是令人愉快的，而且颜色相当准确。它足够明亮，在4K分辨率下呈现清晰的文本和图形，对比度极佳。\n与我的普通Amazon Display不同，Espresso Display实际上只用一根电缆就可以连接我的MacBook Pro。另一种不能仅通过USB-C连接获得足够的电力，因此需要插入适配器。在这方面，Epresso工作得无懈可击，它使用包括USB-C线缆实现真正的On-The-Go One线缆连接。\nEpresso还提供触摸功能，这在处理图形等工作时非常方便。它附带了一支小手写笔，但不要认为这是Wacom的替代品-它更适合多点触摸交互，而不是笔输入，而且缺乏压力敏感度。触控功能进一步得益于磁性支架的灵活性，它可以翻转成更低角度的模式，便于动手操作。然后很容易将其翻转为更像iMac的支架方向，或者将其转换为纵向，以便处理文档或代码。\n展台实际上是Espresso Display吸引人的一大部分，因为它使得在任何地方工作都非常灵活。我还没有找到一个很好的支架解决方案，用于其他便携式显示器，与它们的便携性相匹配，而这个肯定做到了，它可以折叠成不超过一片吐司薄片的正方形。\n在4K和60 Hz下，显示面板本身的性能非常出色，并且提供了一个很好的方式来获得比单独使用内置屏幕更多的屏幕空间。\n便携式显示器市场日益拥挤，但Espresso Display之所以能够脱颖而出，要归功于它使用了高质量的材料和独特的磁性安装解决方案。许多现有的选择需要某种程度不同的妥协或权衡，但Espresso显示屏薄、轻、耐用，提供出色的图像，具有简单、灵活的安装选项和真正的单线连接。", "note_en": "Espresso’s display comes in two different sizes – a 13.3 inch or a 15.6-inch model. The display itself is very thin and light, at just under 0.2 inches thick, and under 2 lbs. The display panel features touch sensitivity, which works in tandem with a driver that you install on your Mac to enable touch features.\n  The display is made of glass and aluminum, and feels very high quality to match your MacBook. There are two USB-C and a mini HDMI port on the side, and a 2.5mm mini stereo jack for audio out. One of the USB-C ports is dedicated to power only, and the other is for connecting a display, with power delivery supported as well for a single-cable connection to modern Macs.\n Espresso offers 4K resolution, and provides a unique mounting system that uses magnets to secure it to the optional folding display stand. The company also offers a VESA mouth adapter for attaching it to more traditional stand or mounting arm. There’s also a soft case included to protect the display during transit.\n  The company is currently funding the display’s production via  Indiegogo,   but is nearing mass production, and the unit they sent me to test out definitely felt like a finished product. The 13-inch version is $249 USD but will retail for $320, and the Display 15 will retail for $350 when generally available.\n  The Espresso Display is a cut above the competition when it comes to both build quality and materials, as well as actual panel image quality and color. I’ve actually been using a 15.6-inch portable display purchased from Amazon recently, and while that has been a satisfactory solution for extending my desktop when I want to work from a few different locations, it’s definitely sub-par with its color rendering and all plastic build.\n Espresso’s glass and metal composition feels much more at home with my MacBook Pro, and while I can’t quite tune its colors to match my Apple’s output, the built-in profile is generally pleasing and fairly color accurate. It’s bright enough, and renders crisp text and graphics at 4K resolution, with excellent contrast.\n  Also unlike my generic Amazon display, Espresso Display actually works with just a single cable with my MacBook Pro. The other doesn’t draw enough power through just a USB-C connection, and so requires an adapter to be plugged in. Espresso works flawlessly in this regard, using the includes USB-C cable for true on-the-go one cable connectivity.\n Espresso also offers touch capability, which comes in handy for things like graphics work. It ships with a small stylus, but don’t think of this as a Wacom alternative – it’s more for multi-touch interactions than pen input, and lacks pressure sensitivity. The touch features are further helped by the flexibility of the magnetic stand, which can flip around for a more low-angled mode that facilitates hands-on work. It’s easy to then flip it up for a more iMac-like stand orientation, or turn it to portrait orientation for working on documents or code.\n  The stand is actually a big part of Espresso Display’s appeal, since it makes it very flexible for working anywhere. I’ve yet to find a great stand solution for other portable displays that match their portability, and this one definitely does, folding into a square no larger than a thin slice of toast.\n At 4K and 60Hz, the performance of the display panel itself is excellent, and provides a great way to gain a whole lot more screen real estate than is possible with your built-in screen alone.\n  The portable display market is increasingly crowded, but the Espresso Display manages to stand out thanks to its use of high-quality materials and unique magnetic mounting solution. Many existing options out there require some kind of compromise or trade-off, of varying degrees of severity, but the Espresso Display is thin, light, durable and provides a great image, with easy, flexible mounting options and true single-cable connectivity.", "posttime": "2020-07-16 22:37:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "mac,display,连接", "title": "\nEspresso Display是一款非常适合Mac或PC的便携式显示器", "title_en": "\n\t\t\t\tThe Espresso Display is a fantastic portable display for your Mac or PC\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/16/the-espresso-display-is-a-fantastic-portable-display-for-your-mac-or-pc/", "via": "", "real_tags": ["mac", "display", "连接"]}, {"category": "", "categoryclass": "", "imagename": "5a0849315e21b38e37bd5e55bb1b3aa3.jpg", "infoid": 1012290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首席执行官伊冯娜·瓦森纳(Yvonne Wassenaar)表示，公司将这轮债务视为与贝莱德长期关系的一部分。瓦森纳尔告诉TechCrunch：“有趣的是，我认为我们决定与贝莱德合作的部分原因是，通常情况下，当你看到他们是如何投资的时候，这是我们将与他们建立的长期关系的第一步，随着时间的推移，这种关系具有不同的元素，随着公司的规模扩大，我们可以利用不同的元素。”\n在安排方面，木偶将偿还这笔钱，而不是贝莱德入股该公司。“我们已经借了一笔钱，随着时间的推移我们会偿还的。贝莱德确实有一个董事会观察员席位，这真的是因为他们非常有兴趣与我们合作，研究我们如何发展和加速业务。“Wassenaar说。\n木偶一直在重建其高管团队，瓦森纳大约18个月前就加入了木偶。去年，她聘请了业内资深人士埃里克·弗里伯格(Erik Frieberg)和保罗·海伍德(Paul Heywood)分别担任首席营销官和首席运营官。今年，她请来了云铸造基金会(Cloud Foundry Foundation)前董事艾比·卡恩斯(Abby Kearns)担任首席技术官。\n瓦森纳表示，所有这些举措都着眼于未来的首次公开募股(IPO)。她说：“我们正在研究如何最终取得进展，理想情况下是在IPO的道路上，以及木偶要经历这段旅程需要做些什么。”\n她指出，在某些方面，大流行迫使公司更密切地关注自动化解决方案，比如Puppet提供的解决方案。“真正有趣的是[…]。她说：“这场大流行在许多方面给我们带来了助力，因为企业需要实现自动化，并考虑如何从技术角度来利用和扩展未来。”\n随着木偶的不断壮大，她表示，多样性是一项核心的组织价值，尽管公司从性别角度取得了进展(她和卡恩斯在C套房的出现就证明了这一点)，但他们仍在努力使种族更加多样化。\n“我认为我们有更多的工作，现在有更多的关注，从种族的角度进一步补充了(性别多样性)。这是我个人负责的一个领域，我致力于在我们继续支持更多种族多样性的同时，对公司进行改革。“。\n根据Crunchbase的数据，此前该公司已经筹集了近1.5亿美元，最近一轮融资是2018年4200万美元的F系列。在瓦森纳加入之前，该公司此前在2016年进行了2200万美元的债务融资。", "note_en": "CEO Yvonne Wassenaar says the company sees this debt round as part of a longer term relationship with  BlackRock  . “What’s interesting, and I think part of the reason why we decided to go with BlackRock, is that typically when you look at how they invest this is the first step of a much longer term relationship that we will have with them  over time that has different elements that we can tap into as the company scales,” Wassenaar told TechCrunch.\n In terms of the arrangement, rather than BlackRock taking a stake in the company, Puppet will pay back the money. “We’ve borrowed a sum of money that we will pay back over time. BlackRock does have a board observer seat, and that’s really because they’re very interested in working with us on how we grow and accelerate the business,” Wassenaar said.\n  Puppet has been in the process of rebuilding its executive team with Wassenaar coming on board about 18 months ago. Last year she brought in industry veterans Erik Frieberg and Paul Heywood as CMO and CRO respectively. This year she brought in former Cloud Foundry Foundation director  Abby Kearns to be CTO.\n All of these moves are with an eye to a future IPO, says Wassenaar. “We’re looking at how do we  progress ultimately, ideally on a path to an IPO, and what it is going to take for Puppet to go through that journey,” she said.\n She points out that in some ways, the pandemic has forced companies to look more closely at automation solutions like the ones that Puppet provides. “What’s really interesting is […] that the pandemic in many ways has put wind in our sails in terms of the need for corporations to automate and think about how they leverage and extend from a technology perspective going forward,” she said.\n As Puppet continues to grow, she says that diversity is a core organizational value, and that while the company has made progress from a gender perspective (as illustrated by the presence of her and Kearns in the C Suite), they still are working at being more racially diverse.\n “Where I believe we have a lot more work and there’s a lot more focus right now is further complementing that [gender diversity] from a racial perspective. And it’s an area that I have personally taken on, and I’m committed to making changes in the company as we go forward to support more racial diversity as well,” she said.\n Previously the company had raised almost $150 million with the most recent round being a $42 million Series F in 2018, according to Crunchbase data. The company previously took $22 million in debt financing in 2016, prior to Wassenaar coming on board.", "posttime": "2020-07-16 22:37:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "木偶,debt", "title": "\n木偶宣布贝莱德4000万美元债务", "title_en": "\n\t\t\t\tPuppet announces $40 million debt round from BlackRock\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/16/puppet-announces-40-million-debt-round-from-blackrock/", "via": "", "real_tags": ["木偶", "debt"]}, {"category": "", "categoryclass": "", "imagename": "f39458d3864141e24a1664eb4d42faa5.jpeg", "infoid": 1012289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦-美国和英国政府官员说，一个著名的国家支持的俄罗斯黑客组织对参与冠状病毒疫苗开发和其他医疗相关工作的组织进行了持续的网络攻击，这表明在全球对新冠肺炎的反应中，安全担忧不断升级。\n隶属于英国政府通信总部(GCHQ)电子情报机构的国家网络安全中心(National Cyber Security Centre)周四说，它与美国和加拿大安全官员合作，评估针对多个国家的政府、智库和其他目标的持续黑客活动的来源。官员们说，目标包括全球从事疫苗研究和测试的大学、私营公司和其他组织。\n官员们说，这些攻击是为了在回应新冠肺炎的过程中窃取知识产权。\n官员们共同确认这个黑客组织是俄罗斯支持的APT 29，也被称为Cozy Bear。网络安全专家普遍认为，APT29是一个与俄罗斯情报机构有关的复杂而多产的网络单位，此前曾被认为与针对白宫、美国国务院和整个欧洲各国政府的攻击有关。\n每周六天获取冠状病毒简报，一旦危机缓解，每周获得一份健康时事通讯：在这里注册。\n周四就这些攻击发出警告，旨在帮助现有和潜在的目标加强防御，此前，参与病毒研究(包括疫苗开发)的机构已经加强了保护。据“华尔街日报”早些时候报道，今年早些时候，英国确认牛津大学是接受政府加强网络保护的十几所英国大学之一，因为牛津大学在抗击病毒的斗争中所扮演的角色受到了越来越多的关注。\n牛津大学正在与英国制药商阿斯利康(AstraZeneca PLC)合作开发一种领先的候选疫苗，他们表示，这种疫苗可能会在今年秋天准备就绪。阿斯利康发言人没有立即对黑客警告置评，牛津大学发言人也没有立即回复记者的置评请求。\n英国网络中心运营总监保罗·奇切斯特(Paul Chichester)在一份声明中表示：“我们谴责这些针对那些为抗击冠状病毒大流行而做重要工作的人的卑鄙攻击。”\n克里姆林宫和俄罗斯联邦安全局(Federal Security Service)以及负责网络安全事务的数字发展、通信和大众媒体部(Ministry of Digital Development，Communications and MassMedia)都没有立即回复置评请求。", "note_en": "LONDON—U. S. and U.K. government officials said a prominent state-backed Russian hacking group is responsible for ongoing cyberattacks against organizations involved in the development of coronavirus vaccines and other healthcare-related work, a sign of escalating security concerns amid the global response to Covid-19.\n  The National Cyber Security Centre, part of the U.K.’s GCHQ electronic-intelligence agency, said Thursday it worked with U.S. and Canadian security officials to assess the source of persistent hacking activity against government, think tank and other targets in multiple countries. The targets include universities, private companies and other organizations working on vaccine research and testing globally, officials said.\n  The attacks are designed to steal intellectual property amid the response to  Covid-19, the officials said.\n  The officials jointly identified the hacking group as Russia-supported APT 29, which is also known as Cozy Bear. APT29 is widely viewed by cybersecurity experts to be a sophisticated and prolific  cyber unit associated with Russian intelligence and has previously been linked to attacks on the White House, the U.S. State Department and various governments throughout Europe.\n  Get a coronavirus briefing six days a week, and a weekly Health newsletter once the crisis abates:  Sign up here.\n  Thursday’s warning about the attacks, designed to help current and potential targets bolster their defenses, follows the already stepped-up protections of institutions involved in virus research, including vaccine development. The U.K. earlier this year identified the University of Oxford as among about a dozen U.K. universities receiving  heightened government cyberprotection, as the university was gaining attention for its role in the battle against the virus, The Wall Street Journal earlier reported.\n    Oxford is working with U.K. drugmaker  AstraZeneca PLC  on a leading vaccine candidate that they say could be ready by this autumn. An AstraZeneca spokesman had no immediate comment about the hacking warnings, while an Oxford spokesman didn’t immediately respond to a request for comment.\n  “We condemn these despicable attacks against those doing vital work to combat the coronavirus pandemic,” Paul Chichester, the U.K. cyber center’s director of operations, said in a statement.\n  There was no immediate response to a request for comment from either the Kremlin or Russia’s Federal Security Service, nor from the Ministry of Digital Development, Communications and Mass Media, which deals with cybersecurity.", "posttime": "2020-07-16 22:36:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,黑客,病毒,冠状病毒,coronavirus", "title": "美国和英国表示，国家支持的俄罗斯黑客组织APT 29对正在进行的针对涉及冠状病毒疫苗开发的组织的网络攻击负责", "title_en": "US and UK say state-backed Russian hacking group APT 29 is responsible for ongoing cyberattacks against orgs involved in the development of coronavirus vaccines", "transed": 1, "url": "https://www.wsj.com/articles/russian-hackers-blamed-for-attacks-on-coronavirus-vaccine-related-targets-11594906060?mod=djemalertNEWS", "via": "", "real_tags": ["俄罗斯", "黑客", "病毒", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "10c030b2429f801a5aed8756bdece9d2.jpg", "infoid": 1012287, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rust团队很高兴宣布Rust的新版本，1.45.0。Rust是一种编程语言，它使每个人都能够构建可靠而高效的软件。\n如果您通过Rustup安装了以前版本的Rust1.45.0，则获取Rust1.45.0与以下操作一样简单：\n如果您还没有，您可以从我们网站的相应页面获取概要信息，并在GitHub上查看1.45.0的详细发行说明。\n在Rust1.45.0中有两个大的变化需要注意：修复了一些长期存在的在整数和浮点数之间转换时不健全的问题，以及稳定了更流行的Web框架之一在稳定的Ruust上工作所需的最终功能。\n10184期最初是在2013年10月开始发行的，比“铁锈1.0”早了一年半。您可能知道，rustc使用LLVM作为编译器后端。当您像这样编写代码时：\n定义I8@_ZN10playground4cast17h1bdf307357423fcfE(float%x)UNNAMED_ADDR#0{START：%0=fpToui Float%x to I8 ret I8%0}。\n“fpoui”指令将其浮点操作数转换为最小(舍入为零)的无符号整数值。如果该值不适合TY2，则结果为毒值。\n现在，除非您经常深入研究编译器，否则您可能不会理解这是什么意思。它充满了行话，但有一个更简单的解释：如果你将一个大的浮点数转换成一个小的整数，你会得到未定义的行为。\nfn cast(x：f32)-&gt；u8{x as U8}fn main(){设f=300.0；设x=cast(F)；println！(&#34；x：{}&#34；，x)；}。\n在Rust 1.44.0上，这正好在我的机器上打印&#34；x：0&#34；。但是它可以打印任何东西，或者做任何事情：这是未定义的行为。但是我们这里没有不安全的代码。这就是我们所说的健全错误，也就是说，这是一个编译器做了错误事情的错误。我们在我们的问题跟踪器上将这些漏洞贴上标签，并非常认真地对待它们。\n不过，这个错误需要很长时间才能解决。原因是当时非常不清楚前进的正确道路是什么。\nFN CAST(x：F32)-&gt；U8{x as U8}FN Main(){let Too_Bigge=300.0；let Too_Small=-100.0；let NaN=F32：：NaN；println！(&#34；Too_Big_Casted={}&#34；，cast(Too_Big))；println！(&#34；Too_Small_Casted={}&#34；，cast(Too_Small))；println！(&。，cast(NaN))；}。\n也就是说，太大的数字会变成最大的可能值，而太小的数字会产生最小的可能值(即零)。NaN生成零。\n但一如既往，您应该只将此方法作为最后手段使用。就像数组访问一样，编译器通常可以优化检查，使安全版本和不安全版本在编译器可以证明的情况下是等价的。\nGNOME-CLASS是Rust的过程化宏。在宏中，我们定义了一种迷你语言，它看起来尽可能像Rust-y，并且具有允许您定义GObject子类、它们的属性、信号、接口实现和GObject的其余功能的扩展。目标是您不需要任何不安全的代码。\ngobject_gen！{class MyClass：GObject{foo：cell&lt；I32&gt；，bar：RefCell&lt；string&gt；，}Impll MyClass{virtual fn my_virtual_method(&amp；self，x：I32){.。对x做点什么.}\n项目位置中的&#34；位是一些行话，但基本上这意味着您只能调用gobject_gen！在代码中的某些位置。\n//假设我们有一个名为&#34；mac&#34；mac！()；//项位置，这是以前稳定的位置//但这三个是新的：fn main(){let expr=mac！()；//表达式位置匹配expr{mac！()=&gt；{}//pattern position}mac！()；//语句位置}。\n能够在更多的地方使用宏是很有趣的，但是还有另一个原因让许多Rustaceans期待这个特性很久了：Rocket。最初于2016年12月发布的Rocket是一个流行的Rust网络框架，经常被描述为Rust生态系统提供的最好的东西之一。以下是即将发布的hello world示例：\n#[MACRO_USE]外部板条箱rocket；#[get(&#34；/&lt；name&gt；/&lt；age&gt；&#34；)]fn HELLO(名称：String，年龄：U8)-&gt；String{Format！(&#34；HELLO，{}YOLD NAME{}！&#34；，AGE，NAME)}#[Launch]FN Rocket()-&gt；Rocket：：Rocket{Rocket：：Ignite().mount(&#34；/hello&#34；，routes！[Hello])}。\n直到今天，火箭依靠夜间专用功能来实现其灵活性和人体工程学的承诺。事实上，正如在项目页面上所看到的，在当前版本的Rocket中，上面的相同示例需要编译proc_宏_个人卫生功能。然而，正如你可能从这个功能的名字中猜到的那样，今天它是以稳定的方式发货的！Thisissue追踪了“火箭”晚间专题片的历史。现在，他们都检查过了！\n下一个版本的火箭还在筹备中，但一旦发布，很多人都会非常高兴：)。\n在Rust 1.45.0版本中还有其他更改：查看Rust、Cargo和Clippy中的更改。\n许多人聚集在一起创建了铁锈1.45.0。没有你们，我们做不成这件事。谢谢!", "note_en": "The Rust team is happy to announce a new version of Rust, 1.45.0. Rust is aprogramming language that is empowering everyone to build reliable andefficient software.\n If you have a previous version of Rust installed via rustup, getting Rust1.45.0 is as easy as:\n  If you don&#39;t have it already, you can  get  rustup from theappropriate page on our website, and check out the  detailed release notes for1.45.0 on GitHub.\n  There are two big changes to be aware of in Rust 1.45.0: a fix for somelong-standing unsoundness when casting between integers and floats, and thestabilization of the final feature needed for one of the more popular webframeworks to work on stable Rust.\n  Issue 10184 was originallyopened back in October of 2013, a year and a half before Rust 1.0. As you mayknow,  rustc uses  LLVM as a compiler backend. When youwrite code like this:\n   define i8 @_ZN10playground4cast17h1bdf307357423fcfE(float %x) unnamed_addr #0 {start: %0 = fptoui float %x to i8 ret i8 %0}\n   The ‘fptoui’ instruction converts its floating-point operand into thenearest (rounding towards zero) unsigned integer value. If the value cannotfit in ty2, the result is a poison value.\n Now, unless you happen to dig into the depths of compilers regularly, you maynot understand what that means. It&#39;s full of jargon, but there&#39;s a simplerexplanation: if you cast a floating point number that&#39;s large to an integerthat&#39;s small, you get undefined behavior.\n  fn cast(x: f32) -&gt; u8 { x as u8}fn main() { let f = 300.0; let x = cast(f); println!(&#34;x: {}&#34;, x);}\n On Rust 1.44.0, this happens to print &#34;x: 0&#34; on my machine. But it couldprint anything, or do anything: this is undefined behavior. But we haveno  unsafe code here. This is what we call a &#34;soundness&#34; bug, that is,it is a bug where the compiler does the wrong thing. We tag these bugsas I-unsoundon our issue tracker, and take them very seriously.\n This bug took a long time to resolve, though. The reason is that it was veryunclear what the correct path forward was.\n      fn cast(x: f32) -&gt; u8 { x as u8}fn main() { let too_big = 300.0; let too_small = -100.0; let nan = f32::NAN; println!(&#34;too_big_casted = {}&#34;, cast(too_big)); println!(&#34;too_small_casted = {}&#34;, cast(too_small)); println!(&#34;not_a_number_casted = {}&#34;, cast(nan));}\n   That is, numbers that are too big turn into the largest possible value.Numbers that are too small produce the smallest possible value (which iszero). NaN produces zero.\n   But as always, you should only use this method as a last resort. Just likewith array access, the compiler can often optimize the checks away, makingthe safe and unsafe versions equivalent when the compiler can prove it.\n   Gnome-class is a procedural macro for Rust. Within the macro, wedefine a mini-language which looks as Rust-y as possible, and that hasextensions to let you define GObject subclasses, their properties,signals, interface implementations, and the rest of GObject&#39;sfeatures. The goal is to require no unsafe code on your part.\n  gobject_gen! { class MyClass: GObject { foo: Cell&lt;i32&gt;, bar: RefCell&lt;String&gt;, } impl MyClass { virtual fn my_virtual_method(&amp;self, x: i32) { ... do something with x ... } }}\n The &#34;in item position&#34; bit is some jargon, but basically what this means is thatyou could only invoke  gobject_gen! in certain places in your code.\n  // imagine we have a procedural macro named &#34;mac&#34;mac!(); // item position, this was what was stable before// but these three are new:fn main() { let expr = mac!(); // expression position match expr { mac!() =&gt; {} // pattern position } mac!(); // statement position}\n Being able to use macros in more places is interesting, but there&#39;s anotherreason why many Rustaceans have been waiting for this feature for a long time: Rocket. Inititally released in December of 2016, Rocket isa popular web framework for Rust often described as one of the best things theRust ecosystem has to offer. Here&#39;s the &#34;hello world&#34; example from its upcomingrelease:\n #[macro_use] extern crate rocket;#[get(&#34;/&lt;name&gt;/&lt;age&gt;&#34;)]fn hello(name: String, age: u8) -&gt; String { format!(&#34;Hello, {} year old named {}!&#34;, age, name)}#[launch]fn rocket() -&gt; rocket::Rocket { rocket::ignite().mount(&#34;/hello&#34;, routes![hello])}\n Until today, Rocket depended on nightly-only features to deliver on its promiseof flexibility and ergonomics. In fact, as can be seen on the  project&#39;shomepage, the same example above in the current versionof Rocket requires the  proc_macro_hygiene feature to compile. However, as youmay guess from the feature&#39;s name, today it ships in stable!  Thisissue tracked the history ofnightly-only features in Rocket. Now, they&#39;re all checked off!\n This next version of Rocket is still in the works, but when released, many folkswill be very happy :)\n        There are other changes in the Rust 1.45.0 release: check out what changed in Rust,  Cargo, and  Clippy.\n  Many people came together to create Rust 1.45.0. We couldn&#39;t have done itwithout all of you.  Thanks!", "posttime": "2020-07-16 22:35:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈", "title": "铁锈1.45.0", "title_en": "Rust 1.45.0", "transed": 1, "url": "https://blog.rust-lang.org/2020/07/16/Rust-1.45.0.html", "via": "", "real_tags": ["rust", "铁锈"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "默认情况下，互联网并不是为私有和安全而构建的。它灵活的协议允许人们构建独特的软件和应用程序，但这些仍然需要保护。\nTor是一个自2002年以来旨在保护用户的项目。这是一个开放源码的浏览器，可以在线匿名交流。它最早是由Syverson和计算机科学家Roger Dingledine和Nick Mathewson开发的，他们最初称其为洋葱路由(Tor)项目，因为它具有“层”加密。\nToR浏览器和VPN在目标上相似，但在技术方法上不同。虽然两者都会隐藏用户的身份，并确保浏览活动的私密性和加密性，但它们都有一定的优势和劣势。这就是为什么同时使用这两个系统是保护数字隐私的最安全的赌注。\nTor利用一种最初由美国海军开发的系统来保护情报通信。它将你的数据“捆绑”成更小的加密数据包，然后开始通过其庞大的节点网络(任何人都可以运行)路由这些数据包。选择的路径是随机的和预先确定的，您的流量在到达最终出口节点之前将通过至少三个中继节点。\n每次业务通过中继节点时，都会删除一个“层”加密层，从而揭示业务下一步应该发送到哪个中继节点。每个中继节点将仅能够解密足够的数据来标识下一个中继的位置，以及在其之前传递业务的那个中继的位置。\n但是，退出节点会删除最后一层加密。它不能看到用户的位置或IP地址，但如果用户访问不安全的网站(不是HTTPS的网站)，退出节点可以看到用户的活动。\n常规VPN似乎要简单得多，因为涉及到第三方。VPN提供商将加密所有数据和浏览活动，将所有流量定向到他们拥有或租用的远程服务器。用户通常可以从位于世界各地的服务器列表中进行选择，因此他们可以根据网站所在位置来解锁内容。\n分散式VPN更接近ToR的架构。作为一种对等系统，网络消费者自愿接入由人管理的全球节点网络。然而，节点因提供VPN服务和保持网络供电而付费。\nMysterium Network(与我一起工作的团队)就是一个这样的例子。此DAPP(分散应用程序)允许人们从来自世界各地的节点列表(主要提供住宅IP地址)中选择连接。流量经过加密并通过网络定向，用户按其连接的分钟数和通过节点发送的流量向节点付费。\n为了进行这种比较，我使用Mysterium作为dVPN的一个例子，尽管还有其他项目，每个项目都有自己的技术方法、解决方案和优势。\ndVPN：全球节点集合(通常运行在人们家中)通过共享它们的带宽P2P来换取加密货币，从而为VPN网络提供动力。用户可以轻松地成为一个节点，还可以下载VPN应用程序从节点ID的全局菜单中进行选择。\nTor：Tor的主要目标是隐私和匿名性。它是一种浏览器，它可以通过各种节点发送你的流量，从而匿名你的网络浏览，这些节点可以由任何人托管。无法跟踪您的流量，因为每个节点都会加密流量并隐藏源IP。\nVPN：不是一个网络，而更多的是一种全球集中式VPN服务，它使用世界各地数百个不同位置的专用数据中心服务器。这样的VPN公司提供集中式VPN，还允许某些服务器上的P2P业务，并且可以另外提供专用IP地址、双VPN、VPN上的洋葱以及到ToR匿名网络的连接。\ndVPN：P2P网络允许节点根据供需情况自行定价。这一独特的小额支付系统利用加密货币支付，因此节点可以小间隔出售带宽，确保安全和方便。\n托尔：托尔没有节点激励。所有节点都由志愿者操作。缺乏对网络中节点的激励意味着它仍然相对较小(经过10多年的发展，它仍然只有6500个出口节点)。\nVPN：集中式VPN中的节点不受激励，因为这些企业拥有基础设施，并向最终用户收取服务费用。\ndVPN：任何人都可以使用他们的笔记本电脑，甚至像Raspberry PI这样的迷你计算机来运行节点。(理论上，甚至可以支持移动设备来运行节点)。节点跑步者可以通过易于使用的仪表板将节点链接到加密钱包地址，并跟踪收益。\nTor：任何人都可以创建和运行Tor节点。然而，有各种技术要求，建议您不要从消费者级路由运行中继(非出口)节点，因为它可能会使其不堪重负。\nVPN：VPN公司管理自己的服务器/出口节点，因此所有设置和维护都是由公司员工完成的。通过支付服务费用，用户可以访问VPN服务，但不会帮助为其供电。\ndVPN：用户只为按使用付费模式消耗的带宽以加密货币付费。节点直接从此VPN服务的用户那里赚取加密货币。他们将向支付中心支付一小笔费用，以验证他们的支付，类似于向矿工支付在区块链网络中处理交易的费用。\nVPN：月度订阅模式，而不是现收现付的结构。有时，用户甚至有动机提前支付3年的订阅费。\ndVPN：作为通过VPN重塑隐私的快速且可伸缩的安全层，它的构建目的是使不同的协议可以插入到节点网络中。业务量分片解决方案可以通过不同的节点将业务量发送到不同的服务。多亏了Wireguard和OpenVPN协议，用户的流量是加密的，所以即使是ISP也看不到里面有什么。\nTor：虽然Tor具有更好的隐私/匿名性，并且非常善于隐藏浏览活动，但ISP仍然可以看到您连接到Tor。这可能会导致监视，因为美国政府机构(FBI/NSA)正不断试图破解Tor并发现其用户活动。入口节点的所有者将能够看到您的真实IP地址。此节点隐藏您的地址后，其余节点将不再知道您是谁。最后一个节点将看到您正在查看的内容，但看不到您的身份。这在使用网络时会带来一些风险，但就隐私而言，这是目前可用的最佳选择。\nVPN：传统的VPN服务通过远程服务器路由所有用户的互联网流量，隐藏IP地址并加密所有传入和传出的数据。对于加密，他们在其应用程序中使用OpenVPN和Internet Key Exchange v2/IPsec技术。一家美国公司承认，由于过期的内部私钥被曝光，他们的服务器遭到了黑客攻击，这可能会让任何人都可以模仿自己的服务器剥离自己的服务器。此外，VPN出口节点知道用户的IP、目的地址，在许多情况下(由于法定支付)甚至知道用户的身份(姓名、电子邮件等)。如果该目的地未加密(例如，未使用HTTPS)，他们可以看到您正在访问的内容。\ndVPN：没有集中日志！分布式体系结构消除了集中收集或存储日志的任何技术可能性。\nToR：一些假设认为许多节点是由恶意行为者运行的(例如，NSA)可以潜在地控制足够的节点来有效地跟踪用户的活动。网络本身无法存储日志，但是ToR入口和出口节点可能能够看到您的流量或IP地址，但实际上将这些信息拼凑在一起来识别您将需要很大的努力。\nVPN：理论上，集中式VPN*可以*保留用户活动的日志，但许多人表示，他们致力于零日志策略。然而，没有人能真正确定他们不是在与政府合作，或者没有将用户浏览数据出售给第三方。\ndVPN：dVPN应用程序通过桌面或移动应用程序简单易用。通过简单、用户友好的仪表板，只需5分钟和5个步骤即可设置新节点。手头有专业的知识库和支持团队为您提供帮助。用户将需要对加密货币有一些基本的了解，并且必须有一个以太钱包设置(或有一个密码兑换账户)才能收到付款。\nTor：任何人都可以下载并安装Tor浏览器以连接到互联网(类似于任何其他浏览器)。但是，浏览速度相当慢(因为您的所有流量都必须首先通过多个节点)。它的实际可用性受到影响(例如，无法解锁媒体内容)，但这一缺点是为了获得更好的匿名性。对于节点，ToR中继必须能够每月托管至少100 GB的出站流量(以及相同数量的传入流量)。\nVPN：一些VPN具有智能算法，可以根据位置、负载或您的特殊要求自动为您选择最佳服务器。集中式VPN应用程序也更易于使用，允许方便的支付方式(例如。通过信用卡)，并拥有全天候用户支持。\ndVPN：与大多数P2P基础设施一样，加入网络的参与者越多，网络就变得越强大和健壮。Mysterium的小额支付系统是自主开发的第二层解决方案。它是为处理大量用户和事务而构建的，从而使网络速度更快、可伸缩性更强。\nTor软件目前有数百万用户在使用。由于其分布式性质，网络(理论上)可以变得更大。但是，它需要更多的节点。不幸的是，尽管Tor拥有数百万用户，但由于它是由志愿者运营的免费服务，其节点数量并没有大幅增长。如果没有对节点的激励，它只能增长这么快。\nVPN：依靠高带宽吞吐量和快速连接速度为用户提供最佳服务。通常使用多个隧道协议来确保其网络能够扩展并能够适应各种需求。\nTor：适用于Android、Windows、Mac、Linux的Tor，并在Brave浏览器中作为一个单独的选项卡。\nVPN：无集中式VPN是专有的、闭源的。您只能想象他们如何处理存储在其服务器中的您收集的数据。\ndVPN：Testnet LIVE-大约900个住宅节点，在任何给定点都有600多个活动节点。\nVPN：取决于VPN提供商的规模，但最大的可以提供59个国家的5200多台服务器。\nToR和VPN是互补的隐私解决方案，因此它们可以协同工作，进一步增强您的安全性和匿名性。\nTor上的VPN：连接到Tor浏览器，然后激活您的VPN。这是一种更复杂的方法，因为它需要一些手动配置。由于您的VPN的服务器充当最终出口节点，Tor自己的出口节点将无法剥离最后一层加密层以揭示您的活动。虽然您的ISP可以知道您正在使用Tor，但它将能够跟踪您的活动，并对您的VPN服务隐藏您的IP地址。\nTor over VPN：连接到您的VPN，然后打开您的Tor浏览器。您的VPN将在您的所有流量进入ToR网络之前对其进行加密，并且还会隐藏您的IP地址。它还向您的ISP隐瞒了您正在使用Tor的事实。但是，如果您的VPN提供商选择保留日志，它可以看到您正在使用ToR。这就是为什么最好使用分散式VPN，因为它不能保存用户日志。\n无论是Mysterium还是Tor，都可以拼凑在一起，以确保全面的隐私覆盖。Mysterium考虑最多的功能之一是扩展我们的白名单，这样您的流量将只通过Mysterium节点的IP退出，而其余的流量将通过Tor网络转发。通过这种方式，Mysterium用户将获得取消地理阻塞的内容，我们的节点运行者将不会冒险让不需要的内容通过他们的节点。\n像Mysterium和Tor这样的去中心化隐私网络是草根的开源技术，他们在没有任何公司支持或支持的情况下成功地发展了大型社区驱动的技术。然而，我们有一点不同：虽然常规VPN提供保护用户(有偿)，但我们认为与监控和审查制度的斗争是共同的。\n常规VPN无法解决互联网的基础设施缺陷，而是应用快速修复解决方案。我们希望重建互联网本身，创建不受企业或政府控制的人为动力的网络。\nTor帮助启动了这场草根匿名革命，现在dVPN行业正在将其推向更远。在Mysterium的案例中，一个不可信的P2P小额支付系统(目前在testnet上)可以成为游戏规则的改变者，并将导致更多的退出节点。\n你可以试试Android版的dVPN应用。你还可以决定使用哪个Android浏览器。", "note_en": "The internet was not built to be private and secure by default. Its flexible protocols allow people to build unique software and applications, but these still need to be protected.\n Tor is a project designed to protect users since 2002. It’s an open-source browser that enables anonymous communication online. It was first developed by Syverson and computer scientists Roger Dingledine and Nick Mathewson, who originally called it The Onion Routing (Tor) project, due to its “layers” of encryption.\n Tor browser and VPNs are similar in their aims but not in their technological approach. While both will hide user&#39;s identity and ensure browsing activity is kept private and encrypted, there are certain advantages and disadvantages to each. That’s why using the two systems together is the safest bet for securing digital privacy.\n  Tor utilises a system that was originally developed by the US Navy to protect intelligence communications. It “bundles” your data into smaller, encrypted packets before it begins routing these through its vast network of nodes, which can be run by anyone. The chosen path is randomised and predetermined, and your traffic will pass through a minimum of three relay nodes before it reaches a final exit node.\n  Each time traffic passes through a relay node, a “layer” of encryption is removed, revealing which relay node the traffic should be sent to next. Each relay node will only be able to decrypt enough data to identify the location of the next relay, and the one before it who passed on the traffic.\n Exit nodes, however, remove the last layer of encryption. It can’t see user&#39;s location or IP address, but it is possible for an exit node to see user&#39;s activity if he visits an unsecured website (one that is  not HTTPS).\n  A regular VPN seems much simpler because there is a third party involved. A VPN provider will encrypt all of the data and browsing activity, directing all traffic to a remote server owned or hired by them. Users can usually choose from a list of servers located across the world, so they’re able to unlock content based on where the website is based.\n  A decentralized VPN mimics the architecture of Tor more closely. As a peer to peer system, network consumers plug into a global network of nodes run by people voluntarily. However, nodes are paid for providing the VPN service and keeping the network powered.\n  One example of this in action is   Mysterium Network  (the team which I work with). This dApp (decentralized application) allows people to select the connection from a list of nodes (mostly providing residential IP addresses) from around the world. Traffic is encrypted and directed through the network, and users pay the node for the minutes they are connected and the traffic they&#39;re sending through nodes.\n  For this comparison I use Mysterium as an example of a dVPN, though there are other projects out there, each with their own technical approaches, solutions and advantages.\n    dVPN: A global collection of nodes (usually run in people homes) power a VPN network by sharing their bandwidth P2P in exchange for cryptocurrency. Users can easily become a node and also download the VPN app to select from a global menu of node IDs.\n Tor: The main goal of Tor is privacy and anonymity. It’s a browser that anonymizes your web browsing by sending your traffic through various nodes, which can be hosted by anyone. Your traffic cannot be traced as each node encrypts traffic and hides the source IP.\n VPN: Not a network, but more a global centralised VPN service that uses dedicated data center servers around the world in hundreds of different locations. Such VPN companies provide, centralized VPNs also allow P2P traffic on certain servers and can additionally provide Dedicated IP address, Double VPN, Onion Over VPN and connection to the Tor anonymity network.\n  dVPN: P2P network allows nodes to set their own price based on supply and demand. This unique micropayments system utilises cryptocurrency payments, so nodes can sell their bandwidth in small intervals, ensuring security and convenience.\n Tor: Tor doesn’t have node incentivisation. All nodes are operated by volunteers. This lack of incentivisation for nodes in the network has meant it remains relatively small (after 10+ years of development, it still only has 6500 exit nodes).\n VPN: Nodes are not incentivized in centralized VPNs as these businesses own the infrastructure and charge end users for the service.\n  dVPN: Anyone can run a node using their laptop, or even mini computers such as a Raspberry Pi. (In theory, even mobile devices can be supported to run a node). Node runners can link a node to a crypto wallet address via an easy to use dashboard, and track earnings.\n Tor: Anyone can create and run a Tor node. However, there are  various technical requirements and it’s recommended that you do not run a relay (non-exit) node from a consumer-level route, as it may overwhelm it.\n VPN: VPN companies manage their own servers/exit nodes, so all setup and maintenance is done by company’s employees. By paying for the service, users get access to the VPN service, but do not help power it.\n  dVPN: Users pay in cryptocurrency for only the bandwidth they consume on a pay-per-use model. Nodes earn cryptocurrency directly from users of this VPN service. They will pay a small fee to payment hubs for validation of their payments, similar to paying miners for processing transactions in a blockchain network.\n  VPN: Monthly subscription model, rather than a pay-as-you-go structure. Sometimes users are even motivated to pay for a 3 year subscription in advance.\n  dVPN: As a fast and scalable security layer to reinvent privacy via VPN, it’s built so that different protocols can be plugged into the node network. A traffic slicing solution could send traffic to different services via different nodes. Thanks to Wireguard and OpenVPN protocols, user’s traffic is encrypted, so even ISPs can’t see what is in there.\n Tor: While Tor has better privacy/anonymity properties and is great at hiding browsing activity, ISP can still see that you’re connected to Tor. This could lead to surveillance, as US government agencies (FBI/NSA) are constantly trying to crack Tor and discover its users activity. The owner of the entry node will be able to see your real IP address. After this node hides your address, the rest of the nodes will no longer know who you are. The last node will see what you’re looking at, but not your identity. This presents some risks when using the network, but in terms of privacy, it is the best available option at the moment.\n VPN: Traditional VPN services route all users’ internet traffic through a remote server, hiding IP addresses and encrypting all incoming and outgoing data. For encryption, they use the OpenVPN and Internet Key Exchange v2/IPsec technologies in their applications. One  company admits their servers were hacked due to an expired internal private key being exposed, potentially allowing anyone to spin out their own servers imitating their own. Additionally, a VPN exit node knows a user’s IP, destination addresses, and in many cases (because of fiat payments) even user&#39;s identity (name, email, etc.). If that destination is not encrypted (e.g. not using HTTPS), they can see the content you’re accessing.\n  dVPN: No centralized logs! The distributed architecture removes any technical possibility for collecting or storing logs centrally.\n Tor: Some hypothesize that a number of nodes are run by malicious actors (eg. the NSA) who could potentially control enough nodes to effectively track users’ activity. The network itself is unable to store logs, however a Tor entry and exit node may be able to see your traffic or IP address, but actually piecing the information together to identify you would require a lot of effort.\n VPN: In theory, a centralized VPN *could* keep logs of a user’s activity, but many state they are committed to a zero-logs policy. However, nobody can be really sure that they’re not cooperating with governments or not selling user’s browsing data to 3rd parties.\n  dVPN: dVPN app is simple to use via desktop or mobile application. New nodes can get set up in just 5 minutes and 5 steps via a simple, user-friendly dashboard. There is a  knowledgebase and support team on hand to help. Users will need to have some basic understanding of cryptocurrency and must have an Ethereum wallet set up (or have a crypto exchange account) to receive payments.\n Tor: Anyone can download and install Tor browser to connect to the internet (similar to any other browser). However, browsing is quite slow (as all your traffic has to pass through numerous nodes first). Its practical usability suffers (e.g. not being able to unlock media content) but this drawback is the exchange for better anonymity. For nodes, a Tor relay must be able to host a minimum of 100 GByte of outbound traffic (and the same amount of incoming traffic) per month.\n VPN: Some VPNs have smart algorithms which automatically select the best server for you based on location, loads, or your special requirements. Centralised VPN apps are also easier to use, allow convenient payment methods (eg. via credit card) and have 24/7 user support.\n  dVPN: As with most P2P infrastructure, the more participants which join the network, the stronger and more robust it becomes. Mysterium’s micropayments system is a homegrown Layer 2 solution. It was built to handle large volumes of users and transactions, making the network fast and more scalable.\n Tor is currently used by a couple million of users. Due to its distributed nature, the network can (in theory) grow larger. However it would require a much higher number of nodes. Unfortunately, despite its millions of users, Tor has not had huge growth in nodes due to its being a free service run by volunteers. Without incentivisation for nodes, it can only grow so fast.\n VPN: Depends on high bandwidth throughput and fast connection speeds to provide an optimal service for their users. Often use multiple tunneling protocols to ensure their network can scale and can adapt to various needs.\n   Tor: Tor for android, Windows, Mac, Linux and as a separate tab in Brave browser.\n     VPN: No — centralized VPNs are proprietary and closed source. You can only imagine what they do with your collected data stored in their servers.\n      dVPN: Testnet live — ~900 residential nodes, with more than 600 live at any given point.\n  VPN: Depends on size of VPN provider, but the biggest can provide over 5200 servers in 59 countries.\n  Tor and VPNs are complementary privacy solutions, so they can work together to enhance your security and anonymity even more.\n  VPN over Tor: connect to the Tor browser, then activate your VPN. This is a more complex method as it requires some manual configuration. As your VPN’s server acts as the final exit node, Tor’s own exit nodes will not be able to peel back the final layer of encryption to reveal your activity. While your ISP can tell that you’re using Tor, it would be able to trace your activity and keeps your IP address hidden from your VPN service.\n Tor over VPN: Connect to your VPN, then open your Tor browser. Your VPN will encrypt all of your traffic before it enters the Tor network, and also hides your IP address. It also hides the fact you’re using Tor from your ISP. However, if your VPN provider chooses to keep logs, it can see that you’re using Tor. This is why it’s best that you use a decentralised VPN, which cannot keep user logs.\n Both  Mysterium and  Tor can be pieced together to ensure full privacy coverage. One of Mysterium’s most considered features is to extend our whitelisting in such a way so that your traffic would only exit via a Mysterium node’s IP, while the rest of the traffic would be forwarded throughout the Tor network. In this way, Mysterium users will get to un-geoblock content, and our node runners will not risk unwanted content going through their node.\n  Decentralized privacy networks like Mysterium and Tor are grassroots, open source technologies who have managed to grow large community-driven technologies without any corporate backing or support. However, we have one point of difference; while regular VPNs offer to protect their users (for a price), we believe the fight against surveillance and censorship is a shared one.\n Regular VPNs do nothing to address the infrastructural flaws of the internet, instead they apply a quick fix solution. We want to rebuild the internet itself, creating people-powered networks that are immune to corporate or government control.\n Tor helped kickstart this grassroots anonymity revolution and now the dVPN industry is taking it even further. In the case of Mysterium, a trustless and P2P  micropayment system (currently on testnet) can become a game-changer and will lead to a much higher amount of exit nodes.\n You can try   dVPN apps for Android . You can also decide which   tor browser for android to use .", "posttime": "2020-07-16 22:35:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "中心化,vpn,节点", "title": "去中心化VPN：ToR的演进？", "title_en": "Decentralized VPN: The Evolution of Tor?", "transed": 1, "url": "https://hackernoon.com/decentralized-vpn-the-evolution-of-tor-hkv3uix", "via": "", "real_tags": ["中心化", "vpn", "节点"]}, {"category": "", "categoryclass": "", "imagename": "c4896f936b1ea3fe3219d74bdf522317.png", "infoid": 1012284, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年11月，微软宣布其Project XCloud游戏流媒体服务(目前处于开放测试版)最终将以某种形式与其Xbox Game Pass订阅服务集成。今天上午，微软在一篇博客文章中宣布，从9月份开始，XCloud流媒体将对Xbox Game Pass旗舰版会员免费开放，这让这一整合变得更加清晰。\n微软承诺，100多个Xbox游戏通行证游戏将在您的手机或平板电脑上用于XCloud流媒体，作为游戏通行证终极版订阅的一部分。与目前作为订阅一部分提供下载的234款Xbox360和Xbox One游戏相比，这是一个小得多的选择，更不用说还包括140个左右的个人电脑独家下载。但这比目前作为Project XCloud预览计划的一部分提供的50多款游戏的选择要多得多。\n除了“光环无限”在今天的公告中得到具体提及外，微软还没有澄清哪些特定的游戏将可以通过Game Pass进行流媒体播放。微软也还没有说明XCloud访问是在订阅计划之外(即按游戏计算)提供的，还是作为独立于Game Pass的纯流媒体计划的一部分。微软的一位代表说，预计在9月份发布之前，这些问题将得到正式答案。\n你可能还记得，游戏通行证终极版是15美元/月的套餐，提供访问游戏通行证和Xbox Live Gold的机会(Xbox Live Gold本身就提供在线多人游戏和自己的每月免费游戏机会)。作为各种促销活动的一部分，这一标价也经常下调。\nProject XCloud在我们的测试版测试中运行良好(如上图所示)，只要您有良好的宽带和Wi-Fi连接，就可以相对方便地将现有的高端游戏机游戏带离电视。在“游戏通行证”(Game Pass)的基础上免费提供这项服务，是微软目前可供下载的电视游戏选项有别于谷歌Stadia等公司的不同之处，后者不提供下载，主要按菜单销售单个游戏。\nXCloud流媒体的加入使Game Pass与索尼长期运营的PlayStation更加一致。该服务目前提供300多个可下载的PS4游戏以及来自PS2、PS3和PS4库的800多个流媒体游戏，起价为每年60美元。\n不过，尽管微软承诺Xbox Game Studios的每一款第一方游戏都将成为这款游戏发布日的Game Pass的一部分，但索尼通常不太愿意在PlayStation Now阵容中加入备受瞩目的第一方独家游戏。", "note_en": "Last November,  Microsoft announced that its Project xCloud game-streaming service (which is  currently in open beta) would eventually be integrated with its Xbox Game Pass subscription service in some form. This morning, Microsoft added a bit more clarity to that integration, announcing in a blog post that xCloud streaming will be available &#34;at no additional cost for Xbox Game Pass Ultimate members&#34; starting in September.\n Microsoft promises that &#34;over 100 Xbox Game Pass titles&#34; will be available for xCloud streaming &#34;on your phone or tablet&#34; as part of a Game Pass Ultimate subscription. That&#39;s a much smaller selection than  the 234 Xbox 360 and Xbox One games that are currently available to download as part of the subscription, not to mention the 140 or so PC-exclusive downloads that are also included. But it is a larger selection than the 50+ games  currently available as part of the Project xCloud preview program.\n Aside from  Halo Infinite, which gets specific mention in today&#39;s announcement, Microsoft has yet to clarify which specific titles will be available for streaming with Game Pass. Microsoft also has yet to say whether xCloud access will be available outside of a subscription plan (i.e., on a per-game basis) or as part of a streaming-only plan separate from Game Pass. A Microsoft representative said it expects to have formal answers to those questions closer to the September launch.\n  Game Pass Ultimate, as  you may remember, is the  $15/month package that provides access to Game Pass as well as Xbox Live Gold (which itself comes with access to online multiplayer and its own monthly free game opportunities). That sticker price  comes down  pretty  frequently as part of various promotions, too.\n Project xCloud has  worked pretty well in our beta testing (pictured above), and it offers a relatively convenient way to take existing high-end console games with you away from the TV, as long as you have decent broadband and Wi-Fi connections. Offering that service as a freebie on top of Game Pass&#39; current downloadable options for TV-based play differentiates Microsoft&#39;s offering from  the likes of Google&#39;s Stadia, which doesn&#39;t offer downloads and  primarily sells individual games a la carte.\n The addition of xCloud streaming brings Game Pass more in line with Sony&#39;s  long-running PlayStation Now. That service currently offers access to over 300 downloadable PS4 titles as well as over 800 streaming games from across the PS2, PS3, and PS4 libraries for  a price starting at $60 a year.\n But while Microsoft has pledged that every first-party Xbox Game Studios title  will be part of Game Pass on that game&#39;s launch day, Sony has generally  been more reluctant to add high-profile first-party exclusives to the PlayStation Now lineup.", "posttime": "2020-07-16 22:14:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,免费,game", "title": "Xbox游戏通票终极版9月获得免费XCloud游戏流媒体", "title_en": "Xbox Game Pass Ultimate gets free xCloud game streaming in September", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/xbox-game-pass-ultimate-gets-free-xcloud-game-streaming-in-september/", "via": "", "real_tags": ["游戏", "免费", "game"]}, {"category": "", "categoryclass": "", "imagename": "d5961d5a5c3d4012da4d04675f1cfaf8.jpg", "infoid": 1012283, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让我们成为第47个这样说的媒体：电视或流媒体上的其他东西看起来都没有完成。亚马逊Prime的动画科幻系列以一位名叫阿尔玛(由阿丽塔成名的罗莎·萨拉扎饰演)的女人为中心，她遭遇了一场意外，改变了她与世界的关系。当阿尔玛处理正在进行的180事件时，她试图调查她父亲(由鲍勃·奥登科克饰演，最好叫他索尔)的神秘死亡事件。这个故事..。嗯，最好还是少说点，避免剧透任何即将成为观众的人。\n然而，“未完成”的风格值得人们倾注所有的语言。如果你以前听说过这部剧，它很可能是因为它代表了第一个完全用轮镜完成的大型流媒体系列剧，这是一种动画技术，艺术家们使用各种方法和风格在现场演员身上涂抹。(也许你已经看过校园拍摄纪录片“铁塔”，或者理查德·林克利特的“醒着的生活”，那是一部动作对位的作品。)这些对位的作品可以是梦幻的，也可以是博物馆般的、噩梦般的、脱节的，或者是超凡脱俗的--有时是一下子完成的。换句话说，对于像Undo这样的节目来说，这可能是一个完美的创意视觉选择。\n实现这一愿景的功劳归功于幕后的三家制作公司：南加州的Tornante，阿姆斯特丹的潜艇制作公司，以及德克萨斯州奥斯汀的Minnow Mountain。如果这种遍及全球的合作还没有说出来，我们会说的：这个过程非常复杂。但你不必从我们这里拿走它，因为导演兼制作设计师Hisko Hulsing亲切地坐下来观看我们最新的娱乐节目“战争故事”，并概述了让这部剧在我们所有在家观看的人看来是如此毫不费力地美丽的艰苦过程。\n事实证明，这种规模的对位是一个双重挑战。首先，从讲故事的角度来看，这必须是有意义的-这意味着最终的视觉效果符合叙事，事情不会偏离离奇的山谷太近，从而将观众从故事中移开。Hulsing说，“未完成”一开始并没有飞得太接近诡异的山谷(那个灰色地带，那里的东西看起来接近现实，但只是不同，足以让人感到不和谐)，但团队提升了印象派的本能，提升了这部剧世界的人造本质。做出这些调整最终也会成为未完成的故事的一部分，强化了采用这种高度风格化的方法的决定。\nHulsing告诉Ars，我们使用对位转换首先是因为这是一种更逼真的动画制作方法。其次，故事中阿尔玛是精神分裂症，还是经历了某种噩梦或闪回，这一点在故事中仍然是模棱两可的。在我看来，如果我们使用对位法，我们就会创造出一种非常不真实的氛围，同时又看起来很现实。因此，对于观众来说，当她经历一些完全不真实的事情时，并不总是很清楚。我认为对位对接对此很有帮助。即使是现实的场景也可能看起来有点可疑。\n对位应对的第二个主要挑战是执行八集所需的所有技术。制作未完成的作品涉及到从在音响舞台上指导演员到投影地图再到老式油画的方方面面。而且，与其他项目相比，流程的每一步都可能在未完成的项目上达到更细粒度的水平。以音响舞台拍摄为例。\n很多人认为我们只是拍摄真人并追踪它，但这不是我们的工作方式，赫尔辛说。我们在洛杉矶的音响舞台上拍摄演员，但没有实际布景。只有一些网格可以帮助我们确定虚拟布景之后的视角。因此，在我们拍摄一集之前，我们会设计每一个将要出现的环境--每一个房间，每一所房子，每一个外部，我们都会设计它。我们做有尺寸的平面图。所以在片场，我的助手诺拉用地上的磁带告诉演员墙在哪里，这样他们在表演时就不会穿过墙。\n最后，这部剧花了整整一年的时间制作(根据Deadline的数据，超过5万个小时的角色动画和13万多个手绘帧)。但每当制作团队在执行一些雄心勃勃的想法或场景时遇到问题，他们就会通过小规模地找到解决方案。当你想让东西看起来大的时候，所有的小细节都必须是小的，就像Hulsing所说的那样。你可以听到这位资深动画师在上面的整集中提供了详细的细节，但结果不言而喻。亚马逊在该剧首播两个月后续订了第二季，一些评论家甚至认为该剧理应获得2020年艾美奖最佳剧情类提名。\n十年前，没有分销商会认为这是成功的。整个故事是以一种非常冒险的方式进行的。它有很多类型：喜剧、悲剧、戏剧、科幻小说，还有一些心理惊悚元素。Hulsing说，东西太多了，可能会出问题。我一直以为好莱坞制作这么多公式片是因为有太多的人干预，然后它就变得低调了。而我注意到的是未完成的事情，但事实恰恰相反。当你在这个片场的时候，你会有很多非常好的头脑，每个人都会为整个事情添砖加瓦。你有更多的脑力去真正做正确的事情。", "note_en": "Let us be  the 47th  outlet to  say  it: Nothing else on TV or streaming looks like  Undone. Amazon Prime&#39;s animated time-bending sci-fi series centers on a woman named Alma (played by Rosa Salazar, of   Alita fame) who suffers an accident that changes her relationship to the world. And as Alma deals with that in-progress 180, she attempts to investigate the mysterious death of her father (played by Bob Odenkirk,   Better Call Saul). The story... well, better to say less and avoid spoilers for any soon-to-be viewers.\n Undone&#39;s style, however, deserves all the words one can devote. If you heard of the show before, it&#39;s likely because it represents the first major streaming series to be done entirely in rotoscope, an animation technique where artists paint over live actors using a variety of methods and styles. (Maybe you&#39;ve seen the campus shooting documentary  Tower or Richard Linkliter&#39;s  Waking Life; that&#39;s rotoscoping in action.) Rotoscoped work can be dreamy,  museum-like, nightmarish, disjointed, or other-worldly—sometimes all at once. In other words, it might be the perfect creative visual choice for a show like  Undone.\n Credit for executing this vision goes to a trio of production companies behind the scenes: Tornante in Southern California, Submarine Productions in Amsterdam, and Minnow Mountain in Austin, Texas. If that kind of globe-spanning collaboration doesn&#39;t already say it, we will: the process was  complicated. But you don&#39;t have to take it from us, since  Undone director and production designer Hisko Hulsing kindly sat down for our latest  entertainment episode of &#34;War Stories&#34; and outlined the laborious process that makes the show  seem so effortlessly beautiful to all of us watching at home.\n  Rotoscoping at this scale turns out to be a two-fold challenge. First, it has to make sense from a storytelling perspective—meaning the final visuals fit the narrative  and things don&#39;t veer too close to the uncanny valley and remove viewers from the story. Hulsing said  Undone did initially fly a bit too close to the uncanny valley (that gray area where things look nearly realistic but just different enough to be jarring), but the team upped its impressionistic instincts and elevated the artificial nature of the show&#39;s world. Making those tweaks ultimately played into  Undone&#39;s story, too, strengthening the decision to go with this highly stylized approach.\n &#34;We used rotoscoping first of all because it&#39;s a more realistic approach to animation,&#34; Hulsing told Ars. &#34;Second, it remains ambiguous in the story whether Alma is schizophrenic or experiencing some kind of nightmare or flashback. To me, it seemed if we used rotoscoping we&#39;d create a very unreal atmosphere while seeming to be realistic. So for the audience, it&#39;s not always clear when she&#39;s experiencing something completely unreal... I think the rotoscoping helps with that. Even the realistic scenes can seem a bit suspicious.&#34;\n  The second major challenge with rotoscoping is all the technique required to execute eight episodes. Making  Undone involved everything from directing actors on a sound stage to projection mapping to old fashioned oil painting. And each step of the process likely reached a more granular level on  Undone than it would on another project. Take the soundstage filming, for instance.\n &#34;A lot of people think we just shot live action and traced it, but that&#39;s not how we worked,&#34; Hulsing said. &#34;We filmed actors on a soundstage in LA, but there&#39;s no actual set. There&#39;s just some grids to help us determine perspective afterwards for our virtual sets. So before we film an episode, we design every environment that will appear—every room, house, exterior, we design it. We make floorplans with measurements. So when on set, my assistant Nora uses tape on the ground to show actors where the walls are so they don&#39;t cross the walls while acting.&#34;\n In the end, the show took an entire year to produce (with more than  50,000 hours of character animation and 130,000+ hand drawn frames, according to Deadline). But whenever the production team came across problems executing some ambitious idea or scene, they found solutions by going small. &#34;When you want to make things look big, all the little details have to be small,&#34; as Hulsing put it. You can hear the longtime animator provide blow-by-blow details in the full episode above, but the results speak for themselves. Amazon  renewed the series for a second season with two months of its debut, and some critics even believe the show deserves a  2020 Emmy nomination for Best Drama.\n &#34;Ten years ago, no distributor would think this could be successful. The whole story is done in a very risky way. It&#39;s a lot of genres: it&#39;s comedy, tragedy, drama, science-fiction, and there&#39;s some psychological thriller elements to it. There&#39;s so much, it could have gone so wrong,&#34; Hulsing said. &#34;I always thought Hollywood produced so many formula films because too many people are interfering and then it becomes dumbed down. And what I notice with  Undone, it&#39;s the opposite. When you&#39;re on this set, you&#39;re with a lot of very good brains and everybody adds to the whole thing. You have much more brainpower to actually do the right thing.&#34;", "posttime": "2020-07-16 22:14:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,细粒度,hyper,制作", "title": "亚马逊巧妙解体背后的艰苦、超细粒度的过程", "title_en": "The painstaking, hyper-granular process behind Amazon’s artful Undone", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/war-stories-undones-big-risky-visuals-are-built-on-the-teensiest-details/", "via": "", "real_tags": ["亚马逊", "amazon", "细粒度", "hyper", "制作"]}]