[{"category": "", "categoryclass": "", "imagename": "3a9f183ca957ddb2c96eab9d0856164b.jpg", "infoid": 1030269, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这里有一个不可避免的事实：您正在工作的软件项目有一些没人知道的缺陷。不是你，不是你的用户，也不是你团队中的任何人。这些可能是UI中的错误假设，也可能是体系结构中有漏洞的抽象，或者是容易出错的发布过程。\n只要有足够的时间，这些缺陷就会被发现。但是时间就是金钱。你越早发现它们，修理它们就越便宜。那么你怎么能更快地发现他们呢？\n好消息是，你可以做一些事情来迫使问题浮出水面。你可能已经在做其中的一些了。\n找出一部旧的或便宜的手机，试着在上面运行你的应用程序。任何主要的性能瓶颈都会突然变得明显起来。\n假设您是Team 1中的新开发人员。从您的开发计算机中删除项目，克隆源代码并从头开始设置。自述文件和过时的安装脚本中的差距很快就会变得明显。\n尝试添加对完全不同的数据库的支持。泄露到数据层抽象中的当前数据库的详细信息很快就会变得显而易见。\n将几个屏幕从您的前端应用程序移植到不同的平台。例如，编写一个原封不动地重用业务层和数据层的命令行界面。架构的“平台无关”部分可能很快就会显示为任何东西-但是。\n开始每周发布手机应用的测试版。每月释放过程中的痛苦部分将开始变得不那么痛苦\n将您的软件交到真正的用户手中，而不告诉他们如何使用。然后仔细观察他们实际是如何使用它的。\n借用交互设计的术语，这些都是强制函数的示例。它们以一种很难忽视的方式将隐藏的问题带到意识中，因此很可能被解决。\n当然，在生产或现场演示中出现问题也是如此。不同的是，强迫函数是自愿应用的。用你自己的方式去发现问题，压力更小，更不用说更便宜了。\n如果您将您的软件想象为随时间演化的东西，那么战略性地应用强制函数是加速此演化过程的一种方式。\n这样做有风险吗？强迫功能就像是高强度的训练环境。虽然培训很重要，但它并不完全是真实的世界(“地图不是领土”)。强迫函数通常以一种成功标准为标准，并强化它，以强制适应。由于他们只关注一个标准，而忽略了其他所有东西，因此有可能在这一点上投资太多，而牺牲了更大的图景。\n换句话说，你不想花几个月的时间让你的手机游戏在一部7年前的手机上运行得非常流畅，结果却发现没有人觉得游戏有趣，你的钱也花光了。\n强制函数是一种工具；知道在您的团队中应用哪些函数以及应用它们的频率是另一次的主题。\n然而，给出部分答案：我有一种感觉，定期与潜在客户进行面对面测试可能是最终的强制功能。为什么？它们不仅揭示了许多意想不到的、独一无二的问题，而且还让您了解您可能想要应用哪些其他强制函数。它们就像是“强制函数的强制函数”。\n制造顾客想要的东西的唯一方法是在他们面前拿到一个原型，然后根据他们的反应进行改进。\n保罗·格雷厄姆--如何启动一家初创企业。\n如果你觉得这篇文章有用，请给我留言，或者考虑使用下面的按钮之一与你的朋友和同事分享它-Matt(@kiwiandroiddev)", "note_en": "Here’s an unavoidable fact: the software project you’re working on has some flaws that no one knows about. Not you, your users, nor anyone in your team. These could be anything from faulty assumptions in the UI to leaky abstractions in the architecture or an error-prone release process.\n Given enough time, these flaws will be discovered. But time is money.  The sooner you discover them, the cheaper they are to fix. So how do you find out about them sooner?\n The good news is that there are some things you can do to force issues up to the surface. You might already be doing some of them.\n  Dig out an old or cheap phone and try to run your app on it. Any major performance bottlenecks will suddenly become obvious\n Pretend you’re a new developer in the team 1. Delete the project from your development machine, clone the source code and set it up from scratch. Gaps in the Readme file and outdated setup scripts will soon become obvious\n Try to add support for a completely different database. Details of your current database that have leaked into your data layer abstractions will soon become obvious\n Port a few screens from your front-end app to a different platform. For example, write a command-line interface that reuses the business and data layers untouched. “Platform-agnostic” parts of the architecture might soon be shown up as anything-but\n Start releasing beta versions of your mobile app every week. The painful parts of your monthly release process will start to  become less painful\n Put your software into the hands of a real user without telling them how to use it. Then carefully watch how they actually use it\n To borrow a term from interaction design, these are all examples of  Forcing Functions. They raise hidden problems up to consciousness in such a way that they are difficult to ignore and therefore likely to be fixed.\n Of course, the same is true of having an issue show up in production or during a live demo. The difference is that Forcing Functions are  applied voluntarily. It’s less stressful, not to mention cheaper, to find out about problems on your own terms.\n  If you imagine your software as something evolving over time, strategically applying forcing functions is a way of accelerating this evolutionary process.\n Are there any risks in doing this? A forcing function is like an intensive training environment. And while training is important, it’s not quite the real world (“ The Map Is Not the Territory“). Forcing functions typically take one criteria for success and intensify it in order to force an adaptation. Since they focus on one criteria and ignore everything else, there’s a risk of investing too much on optimizing for that one thing at the expense of the bigger picture.\n In other words, you don’t want to spend months getting your mobile game to run buttery-smooth on a 7 year old phone only to find out that no one finds the game fun and you’ve run out of money.\n Forcing functions are a tool; knowing which of them to apply in your team and how often to apply them is a topic for another time.\n However, to give a partial answer: I have a feeling that  regular in-person tests with potential customers might be the ultimate forcing function. Why? Not only do they unearth a wealth of unexpected issues like nothing else, they also give you an idea of which other forcing functions you might want to apply. They’re like a “forcing function for forcing functions”.\n  The only way to make something customers want is to get a prototype in front of them and refine it based on their reactions.\n Paul Graham –  How to Start a Startup\n If you found this article useful, please drop me a comment or consider sharing it with your friends and colleagues using one of the buttons below  – Matt ( @kiwiandroiddev)", "posttime": "2020-10-21 16:26:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开发,强制,functions,可能", "title": "软件开发中的强制函数", "title_en": "Forcing Functions in Software Development", "transed": 1, "url": "https://coderefinery.wordpress.com/2020/10/21/forcing-functions-in-software-development/", "via": "", "real_tags": ["软件", "开发", "强制", "functions", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030268, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软Azure将搭载SpaceX的Starlink卫星发射升空。微软和埃隆·马斯克的公司将合作将微软Azure云计算网络连接到Starlink互联网服务。\n几周前，微软发布了Azure Orbital，这是一种卫星连接到云的方式。有了这一新的合作伙伴关系，Azure Orbary可能会扩大规模，为不断增长的卫星互联网市场提供更多选择。SpaceX总裁兼首席运营官格温·肖特威尔(Gwynne Shotwell)表示：“我们今天宣布的合作将使我们能够共同努力，为公共和私营部门提供新的产品，通过Starlink提供连接，供Azure使用。”Azure Orbary和SpaceX的合作伙伴关系将与获得卫星连接的竞争AWS服务同时到来。据CNBC报道，杰夫·贝佐斯(Jeff Bezos)的亚马逊也在开发Starlink的竞争对手柯伊珀(Kuiper)。如果星联和蔚蓝轨道率先进入太空，他们未来可能会拥有更好的市场份额。这实际上是SpaceX和亚马逊之间的一场卫星太空竞赛。这种合作关系可能已经酝酿了一段时间。据报道，近几个月来，幕后一直在进行测试。根据微软的说法，Starlink网络可以连接微软的数据中心，以及一个名为“Azure Modular Data Center”的新产品。这款半拖车大小的数据中心产品“面向在混合或具有挑战性的环境(包括偏远地区)中需要云计算能力的客户。”它对于自然灾害后重建和修复受损的基础设施可能是令人难以置信的有用的。这与SpaceX目前的目标是一致的，因为它已经为美国西海岸野火中的第一反应人员提供了连接。总而言之，这是一个令人着迷的技术发展，这种合作关系可能会为两家公司打开新机会的大门。正如微软Azure Global公司副总裁汤姆·基恩(Tom Keane)所说，“当人们想到将太空技术带入21世纪的创新和进化时，SpaceX当然是他们第一时间想到的名字。”随着微软和SpaceX的合作，Azure可能会成为“满足太空社区任务需求的首选平台和生态系统”。", "note_en": "Microsoft  Azure is blasting off to space with  SpaceX’s Starlink satellites.   Microsoft and Elon Musk’s company will be partnering to connect the  Microsoft Azure cloud computing network to the Starlink internet service.\n A few weeks ago, Microsoft announced Azure Orbital, a way for satellites to connect to the cloud. With this new partnership, Azure Orbital will likely expand and provide more options for a growing satellite internet market. Gwynne Shotwell, SpaceX president and COO, said that “The collaboration that we’re announcing today will allow us to work together to deliver new offerings for both the public and the private sector to deliver connectivity through Starlink for use on Azure.”   The Azure Orbital and SpaceX partnership is arriving simultaneously with competing AWS services that are getting satellite connectivity.  CNBC reports that Jeff Bezos’ Amazon is also working on a Starlink competitor, Kuiper. If Starlink and Azure Orbital get to space first, they may have a better market share in the future. This is practically a space race of satellites between SpaceX and Amazon.   This partnership has likely been in the works for some time. It is reported that there have been tests going on in the background in recent months. According to Microsoft, the Starlink network can connect Microsoft data centers, as well as a new product called “Azure Modular Data center.” This semi-trailer sized data center product is “for customers who need cloud computing capabilities in hybrid or challenging environments, including remote areas.” It could be incredibly useful for rebuilding and fixing damaged infrastructure after natural disasters. This falls in line with SpaceX’s goals at present, as it has provided connectivity to first responders in the U.S with the wildfires on the west coast.   All-in-all, this is a fascinating development of technology, and this partnership could open doors to new opportunities for both companies. As Tom Keane, Microsoft’s corporate vice president of Azure Global, puts it, “SpaceX is of course the name that people immediately think of when they think of innovation and the evolution that’s occurring to bring space technology into the 21st century.” With Microsoft and SpaceX working together, Azure could become “the platform and ecosystem of choice for the mission needs of the space community.”", "posttime": "2020-10-21 16:25:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,azure,announces", "title": "微软宣布Azure Space与SpaceX Starlink合作", "title_en": "Microsoft Announces Azure Space and Partnership with SpaceX Starlink", "transed": 1, "url": "https://hothardware.com/news/microsoft-azure-and-starlink-partnership", "via": "", "real_tags": ["microsoft", "微软", "azure", "announces"]}, {"category": "", "categoryclass": "", "imagename": "d46f0f248f8718c165edc5bde56db42a.png", "infoid": 1030267, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PySpark是一种包装器语言，允许用户与Apache Spark后端交互以快速处理数据。Spark可以在分布式服务器网络中的海量数据集上运行，如果使用得当，可提供重大的性能和可靠性优势。它带来了挑战，即使对于经验丰富的Python开发人员也是如此，因为PySpark语法利用了Spark的JVM传统，因此实现了可能不熟悉的代码模式。\n这本关于PySpark代码风格的固执己见的指南介绍了我们遇到的常见情况，以及基于PySpark Repos中最频繁出现的主题的相关最佳实践。\n除了PySpark的细节之外，干净代码的一般实践在PySpark存储库中也很重要-Google PyGuide是了解更多这些实践的有力起点。\n首选选项更复杂、更长、更污染-而且是正确的。虽然通常最好避免完全使用F.ol()，但在某些情况下，使用它或另一种显式选择是不可避免的。然而，我们有充分的理由更喜欢第二个例子而不是第一个例子。\n与第一种情况一样使用显式列时，DataFrame名称和架构都显式绑定到dataframe变量。这意味着如果df1被删除或重命名，引用df1.colA将中断。\n相比之下，F.ol(&#39；Cola&39；)将始终引用正在操作的数据帧中指定的列，在本例中名为df。它根本不需要跟踪其他数据帧状态，因此代码变得更加本地化，不太容易出现“远距离的诡异交互”，这通常是调试上的挑战。\n如果列名包含需要括号操作符访问的空格或其他不受支持的字符，则df1[&#39；Cola&39；]与F.ol(&#39；Cola&39；)；一样难以写入。\n将像F.ol(&#39；PROD_STATUS&#39；)==&#39；Delivered&#39；这样的抽象表达式赋给一个变量，使其可用于多个数据帧，而df.prod_status==&#39；Delivered&#39；总是绑定到DF\n幸运的是，通常不需要使用F.ol()复杂的表达式。在Spark3.0之前，这对于一些函数来说是必需的，比如F.Upper()，但是从那以后API变得更加统一了。\n在某些上下文中，可能可以访问多个数据帧中的列，并且名称可能会重叠。常见的示例是df.join(df2，on=(df.key==df2.key)，HOW=&#39；LEFT&#39；)这样的匹配表达式。在这种情况下，可以通过数据帧直接引用列。您还可以使用DataFrame别名消除连接的歧义(请参阅本指南的连接一节中的更多内容)。\n逻辑操作通常驻留在.filter()或F.When()中，需要具有可读性。我们应用与链接函数相同的规则，将同一代码块内的逻辑表达式最多保留为三(3)个表达式。如果它们变长了，通常是代码可以简化或提取出来的迹象。将复杂的逻辑运算提取到变量中使代码更易于阅读和推理，这也减少了错误。\n#Bad F.When((F.ol(&#39；Prod_Status&#39；)==&#39；Delivered&#39；)|(F.datediff(&#39；deliveryDate_Actual&39；，&#39；Current_Date&#39；)&lt；0)&amp；((F.ol(&#39；CurrentRegistry&39；)！=&#39；&#39；)|((F.datediff(&#39；DeliveryDate_Actual&#39；，&#39；Current_Date&#39；)&lt；0)&amp；((F.ol(&#39；OriginalOperator&#39；)！=&#39；&#39；)|(F.ol(&#39；currentOperator&#39；)！=&#39；&#39；)，&#39；正在使用&#39；)。\n上面的代码可以用不同的方式简化。首先，将重点放在将逻辑步骤分组到几个命名变量中。PySpark要求表达式用括号括起来。这与用于分组逻辑操作的实际括号混合在一起，可能会影响可读性。例如，上面的代码有一个原始作者没有注意到的冗余(F.datediff(df.deliveryDate_Actual，df.current_date)&lt；0)，因为它很难发现。\n#较好的HAS_OPERATOR=((F.ol(&#39；OriginalOperator&#39；)！=&#39；&#39；)|(F.ol(&#39；currentOperator&#39；)！=&#39；&#39；)Delivery_Date_Passed=(F.datediff(&#39；deliveryDate_Actual&#39；，&#39；Current_Date&#39；)&lt；0)HAS_REGISTION=(F.ol(&#39；CurrentRegistry&#39；)。)。RLIKE(&#39；.+&#39；)is_delivered=(F.ol(&#39；Prod_Status&#39；)==&#39；Delivered&#39；)F.When(IS_Delivery|(Delivery_Date_Passed&amp；(HAS_REGISTION|HAS_OPERATOR))，&#39；服务中&#39；)。\n上面的示例去掉了冗余表达式，更易于阅读。我们可以通过减少手术次数来进一步改善它。\n#Good Has_Operator=((F.ol(&#39；OriginalOperator&#39；)！=&#39；&#39；)|(F.ol(&#39；currentOperator&#39；)！=&#39；&#39；)Delivery_Date_Passed=(F.datediff(&#39；deliveryDate_Actual&#39；，&#39；Current_Date&#39；)&lt；0)HAS_REGISTION=(F.ol(&#39；currentRegister&#39；)；)。RLIKE(&#39；.+&#39；)IS_DEVERED=(F.ol(&#39；PROD_STATUS&#39；)==&#39；Delivered&#39；)IS_ACTIVE=(HAS_REGISTION|HAS_OPERATOR)F.When(IS_Delivery|(Delivery_Date_Passed&amp；is_active)，&#39；在服务中&#39；)\n注意F.When表达式现在是如何简洁和可读的，并且所需的行为对于任何审阅这段代码的人来说都是显而易见的。如果读者怀疑有错误，则只需查看各个表达式。如果您的代码中有单元测试，并且希望将它们抽象为函数，它还可以使每个逻辑块易于测试。\n在最后一个示例中仍然有一些代码重复：如何消除重复是读者的练习。\n在PySpark转换开始时或在返回之前执行SELECT被认为是很好的做法。此SELECT语句指定与读取器的约定和有关输入和输出的预期数据帧模式的代码。任何选择都应被视为正在准备数据帧以供转换的下一步使用的清理操作。\n使SELECT语句尽可能简单。由于常见的SQL习惯用法，对于每个选定的列，只允许使用spk.sql.function中的一个函数，外加一个可选的.alias()以赋予它一个有意义的名称。请记住，这应该谨慎使用。如果在同一SELECT中有三个以上这样的用法，则将其重构为一个单独的函数，如CLEAN_&lt；dataframe name&gt；()来封装操作。\n除非出于性能原因需要，否则不鼓励在SELECT中使用涉及多个数据帧的表达式或条件操作(如.When())。\nSELECT()语句重新定义数据帧的模式，因此它自然支持包含或排除旧列和新列，以及重新定义预先存在的列。通过将所有此类操作集中在一条语句中，识别最终模式变得容易得多，从而使代码更具可读性。它还使代码更加简洁。\n#错误的df。SELECT((F.coalesce(F.unix_Timestamp(&#39；CLOSED_AT&#39；，F.unix_Timestamp())-F.unix_Timestamp(&#39；Created_at&#39；))/86400)。别名(&#39；Days_OPEN&#39；))#Good DF。With Column(&#39；Days_OPEN&#39；，(F.coalesce(F.UNIX_TIMESTAMP(&#39；CLOSED_AT&#39；)，F.UNIX_TIMESTAMP())-F.Unix_TIMESTAMP(&#39；CREATED_AT&#39；))/86400)。\n如果SELECT语句中的列将保持未使用状态，请避免在其中包含这些列，而是选择一组显式的列-这是使用.drop()的首选替代方法，因为它可以保证模式突变不会导致意外的列膨胀数据帧。然而，并不是所有情况下都天生不鼓励删除列；例如，通常在联接之后删除列是合适的，因为联接通常会引入冗余列。\n最后，不建议通过SELECT语句添加新列，而是建议对单个列使用.with Column()。在添加或操作数十或数百列时，出于性能原因，请使用单个.select()。\n如果需要添加空列以满足模式，请始终使用F.litt(无)填充该列。切勿使用空字符串或表示空值的其他字符串(如NA)。\n除了语义上正确之外，使用F.litt(None)的一个实际原因是保留使用isNull等实用工具的能力，而不必验证空字符串、NULL和&#39；na&#39；na等。\n虽然注释可以提供对代码的有用见解，但重构代码以提高其可读性通常更有价值。代码本身应该是可读的。如果您使用注释一步一步地解释逻辑，则应该对其进行重构。\n#BAD#为COLS：df=df中的c转换时间戳列COLS=[&#39；start_date&#39；，&#39；delivery_date&#39；]。With Column(c，f.from_unixtime(f.ol(C)/1000))。CAST(TimestampType()。\n在上面的示例中，我们可以看到这些列被强制转换为时间戳。这条评论并没有增加多少价值。此外，如果更冗长的注释只提供代码中已经存在的信息，那么它可能仍然没有帮助。例如：\n#BAD#遍历每一列，除以1000，因为MILIS并转换为COLS中的时间戳COLS=[&#39；START_DATE&#39；，&#39；Delivery_Date&#39；]：df=df。With Column(c，f.from_unixtime(f.ol(C)/1000))。CAST(TimestampType()。\n与其留下只描述您编写的逻辑的注释，不如留下给出上下文的注释，解释您在编写代码时做出的决定的原因。这对于PySpark来说尤其重要，因为读者可以理解您的代码，但是通常没有关于馈送到PySpark转换的数据的上下文。小的逻辑片段可能需要数小时的数据挖掘才能理解正确的行为，在这种情况下，解释其基本原理的注释尤其有价值。\n#Good#此数据集的使用者需要的是时间戳而不是日期，我们需要#将时间调整1000，因为原始数据源将这些数据存储为Millis#，尽管文档中说它实际上是一个日期。COLS=[&#39；START_DATE&#39；，&#39；Delivery_Date&#39；]COLS中的c：df=df。With Column(c，f.from_unixtime(f.ol(C)/1000))。CAST(TimestampType()。\n强烈建议在所有情况下避免使用UDF，因为它们的性能明显不如原生PySpark。在大多数情况下，似乎需要UDF的逻辑可以重构为只使用本机PySpark函数。\n使用连接时要小心！如果您执行左联接，并且右侧对一个键有多个匹配项，则该行将与匹配项一样多次重复。这被称为加入爆炸，可以极大地增加变换作业的输出。一定要仔细检查您的假设，以确保您要连接的密钥是唯一的，除非您希望进行乘法运算。\n错误的联接是许多难以调试的问题的根源。即使您使用的是默认值(内部)，也有一些内容可以帮助您明确指定方式：\n#不良航班=航班。加入(飞机，飞机)#也是不好的航班=航班。加入(飞机，#39；飞机_id&#39；，&#39；内部#)#好的飞行=飞行。加入(Aircraft，&#39；Aircraft_id&#39；，HOW=&#39；INTERNAL&#39；)。\n避免右连接。如果您要使用右联接，请切换数据帧的顺序，改为使用左联接。这更加直观，因为您正在对其执行操作的数据帧就是您以连接为中心的数据帧。\n避免重命名所有列以避免冲突。取而代之的是，为整个数据帧指定一个别名，并使用该别名来选择在末尾需要哪些列。\n列：航班=航班的#BAD列=[&#39；START_TIME&#39；，&#39；END_TIME&#39；，&#39；IDLE_TIME&#39；，&#39；TOTAL_TIME&#39；]。With ColumnRename(COL，&#39；FISTING_+COL)停车=停车。WITH COLUN RENAMED(COL，&#39；PARKING_##+COL)航班=航班。加入(Parking，on=&#39；Flight_code&#39；，How=##39；Left&39；)航班=航班。选择(F.ol(&#39；FLASS_START_TIME&#39；)。别名(&#39；FIRST_START_TIME&#39；)，F.COL(&#39；FIRTS_END_TIME&#39；)。别名(&#39；FIRST_END_TIME&#39；)，F.COL(&#39；PARKING_TOTAL_TIME&#39；)。别名(&#39；CLIENT_PARKING_TOTAL_TIME&#39；))#好的航班=航班。别名(航班)停车=停车。别名(停车)航班=航班。加入(Parking，on=&#39；Flight_code&#39；，How=##39；Left&39；)航班=航班。选择(F.ol(&#39；flights.start_time&#39；))。别名(&#39；FIRST_START_TIME&#39；)，F.COL(&#39；flights.end_Time&#39；)。别名(&#39；FIRST_END_TIME&#39；)，F.COL(&#39；PARKIN.TOTAL_TIME&#39；)。别名(&#39；CLIENT_PARKING_TOTAL_TIME&#39；)\n如果两个列都不需要，最好在连接之前删除重叠的列；\n如果您确实需要这两个名称，最好在加入之前将它们中的一个重命名；\n在输出数据集之前，应始终解析不明确的列。运行完转换后，您将无法再区分它们。\n关于联接的最后一句话是，不要使用.dropDuplates()或.Distant()作为拐杖。如果观察到意外的重复行，那么出现这些重复行几乎总是有一个根本原因。添加.dropDuplates()只会屏蔽此问题，并增加运行时的开销。\n链接表达式是一个有争议的话题，但是，由于这是一个固执己见的指南，我们选择建议对链接的使用进行一些限制。有关此建议背后的基本原理的讨论，请参阅本节的结论。\n避免将表达式链接到不同类型的多行表达式中，特别是当它们具有不同的行为或上下文时。例如，混合柱创建或加入选择和过滤。\n#BAD df=(df.。选择(&#39；a&#39；，&#39；b&#39；，&#39；c&#39；，&#39；键&#39；)。过滤器(F.ol(&#39；a&#39；)==&#39；真实性&#39；)。With Column(&#39；boverc&39；，F.ol(&#39；b&39；)/F.coln(&#39；c&#39；))。加入(df2，&#39；键&#39；，HOW=#39；内部&#39；)。加入(DF3，&#39；KEY&#39；，HOW=&#39；LEFT&#39；)。DROP(&#39；c&#39；)#Better(分步骤)#第一：我们选择并裁剪我们需要的数据#第二：我们创建需要的列#第三：连接其他数据帧df=(Df)。选择(&#39；a&#39；，&#39；b&#39；，&#39；c&#39；，&#39；键&#39；)。过滤器(F.ol(&#39；a&#39；)==&#39；真实性&#39；)df=df。使用Column(&#39；boverc&39；，F.ol(&#39；b&39；)/F.coln(&#39；c&#39；))df=(df。加入(df2，&#39；键&#39；，HOW=#39；内部&#39；)。加入(DF3，&#39；KEY&#39；，HOW=&#39；LEFT&#39；)。丢弃(&#39；c&#39；)。\n将每组表达式隔离到其自己的逻辑代码块中提高了易读性，并且更容易找到相关逻辑。例如，下面代码的读者可能会跳到他们看到数据帧被分配df=df的位置。\n#BAD df=(df.。选择(&#39；foo&#39；，&#39；bar&#39；，&#39；foobar&#39；，&#39；abc&#39；)。过滤器(F.ol(&#39；abc&#39；)==123)。JOIN(ANTHER_TABLE，&#39；SOME_FIELD&#39；)#Better df=(df.。选择(&#39；foo&#39；，&#39；bar&#39；，&#39；foobar&#39；，&#39；abc&#39；)。过滤器(F.ol(&#39；ABC&#39；)==123)df=df。JOIN(ANTHER_TABLE，&#39；SOME_FIELD&#39；，HOW=&#39；INTERNAL&#39；)。\n将表达式链接在一起是有正当理由的。这些通常表示原子逻辑步骤，并且是可以接受的。在同一块中应用最多包含数字链接表达式的规则，以保持代码的可读性。我们建议使用不超过5条语句链。\n如果您发现您正在制造更长的链条，或者因为变量的大小而遇到麻烦，请考虑将逻辑提取到一个单独的函数中：\n#Bad Customers_with_Shipping_Address=(Customers_with_Shipping_Address。选择(&#39；a&#39；，&#39；b&#39；，&#39；c&#39；，&#39；键&#39；)。过滤器(F.ol(&#39；a&#39；)==&#39；真实性&#39；)。With Column(&#39；boverc&39；，F.ol(&#39；b&39；)/F.coln(&#39；c&#39；))。Join(df2，&#39；key&#39；，How=&#39；Internal&#39；))#Also Bad Customers_with_Shipping_Address=Customers_with_Shipping_Address。选择(&#39；a&#39；，&#39；b&#39；，&#39；c&#39；，&#39；key&#39；)Customers_With_Shipping_Address=Customers_With_Shipping_Address。筛选器(F.ol(&#39；a&#39；)==&#39；true&39；)Customers_With_Shipping_Address=Customers_With_Shipping_Address。With Column(&#39；boverc&39；，F.ol(&#39；b&#39；)/F.ol(&#39；c&#39；))Customers_With_Shipping_Address=Customers_With_Shipping_Address。Join(df2，&#39；key&#39；，HOW=&#39；Internal&#39；)#Better def Join_Customers_with_Shipping_Address(Customers，df_to_Join)：Customers=(Customers.。选择(&#39；a&#39；，&#39；b&#39；，&#39；c&#39；，&#39；键&#39；)。筛选器(F.ol(&#39；a&#39；)==&#39；真实性&#39；))Customers=Customers。With Column(&#39；boverc&39；，F.ol(&#39；b&39；)/F.ol(&#39；c&39；))Customers=Customers。JOIN(DF_TO_JOIN，&#39；KEY&#39；，HOW=&#39；INTERNAL&39；)退货客户。\n3条以上语句链是分解成单独的、命名良好的函数的主要候选，因为它们已经封装了隔离的逻辑块。\nPySpark代码和SQL代码的区别。链接是与大多数(如果不是全部)其他Python样式背道而驰的。您不是在Python中链接，而是赋值。\n不鼓励创建大型单代码块。这些通常作为命名函数提取会更有意义。\n它不需要全部或不需要，但最多五行链接就可以在实用性和易读性之间取得平衡。\n如果您使用的是IDE，则可以更轻松地使用自动提取或执行代码移动(即：pycharm中的cmd+Shift+Up)。\n可以链接表达式的原因是因为PySpark是从Spark开发的，Spark来自JVM语言。这意味着传输了一些设计模式，特别是链式模式。但是，Python不能优雅地支持多行表达式，唯一的选择是提供显式换行符，或者将表达式括在圆括号中。如果链发生在根节点，则只需要提供显式换行符。例如：\n#需要`\\`df=df。筛选器(F.ol(&#39；event&#39；)==&#39；正在执行&#39；)\\。过滤器(F.ol(&#39；HAS_TESTS&#39；)==True)\\。删除(&#39；has_tests&#39；)#链不在根节点中，因此它不需要`\\`df=df。With Column(&#39；安全&#39；，F.When(F.ol(&#39；has_test&39；)==True，&#39；is safe&#39；)。当(F.ol(&#39；Has_Executed&#39；)==True，&#39；没有测试但运行&#39；)。否则(&#39；不安全&#39；)。\n为保持一致，请将整个表达式放入单个括号块中，并避免使用\\：\n#BAD DF=DF。筛选器(F.ol(&#39；event&#39；)==&#39；正在执行&#39；)\\。过滤器(F.ol(&#39；HAS_TESTS&#39；)==True)\\。Drop(&#39；has_tests&#39；)#Good df=(df.。筛选器(F.ol(&#39；event&#39；)==&#39；正在执行&#39；)。筛选器(F.ol(&#39；HAS_TESTS&#39；)==True)。丢弃(&#39；HAS_TESTS&#39；)。\n要小心函数变得太大。一般来说，一个文件不应该超过250行，一个函数不应该超过70行。\n尽量将您的代码保存在逻辑块中。例如，如果你有多行引用相同的东西，试着把它们放在一起。将它们分开会降低上下文和可读性。\n测试您的代码！如果可以运行本地测试，请这样做，并确保您的新代码是c++。\n.", "note_en": "PySpark is a wrapper language that allows users to interface with an Apache Spark backend to quickly process data. Spark can operate on massive datasets across a distributed network of servers, providing major performance and reliability benefits when utilized correctly. It presents challenges, even for experienced Python developers, as the PySpark syntax draws on the JVM heritage of Spark and therefore implements code patterns that may be unfamiliar.\n This opinionated guide to PySpark code style presents common situations we&#39;ve encountered and the associated best practices based on the most frequent recurring topics across PySpark repos.\n Beyond PySpark specifics, the general practices of clean code are important in PySpark repositories- the Google  PyGuide is a strong starting point for learning more about these practices.\n   The preferred option is more complicated, longer, and polluted - and correct. While typically it is best to avoid using F.col() altogether, there are certain cases where using it, or the alternative explicit selection, is unavoidable. There is, however, good reason to prefer the second example over the first one.\n When using explicit columns as in the first case, both the dataframe name and schema are explicitly bound to the dataframe variable. This means that if  df1 is deleted or renamed, the reference  df1.colA will break.\n By contrast,  F.col(&#39;colA&#39;) will always reference a column designated  &#39;colA&#39; in the dataframe being operated on, named  df, in this case. It does not require keeping track of other dataframes&#39; states at all, so the code becomes more local and less prone to “spooky interaction at a distance,” which is often challenging to debug.\n  If the column name has a space or other unsupported character that requires access by the bracketoperator then  df1[&#39;colA&#39;] is just as difficult to write as  F.col(&#39;colA&#39;);\n Assigning an abstract expression like  F.col(&#39;prod_status&#39;) == &#39;Delivered&#39; to a variable makes it reusablefor multiple dataframes, while  df.prod_status == &#39;Delivered&#39; is always bound to df\n Fortunately, a convoluted expression with  F.col() is usually not required.  Prior to Spark 3.0, this was necessary for some functions, like  F.upper(), but since then the API has become much more uniform.\n  In some contexts there may be access to columns from more than one dataframe, and there may be an overlap in names. A common example is in matching expressions like  df.join(df2, on=(df.key == df2.key), how=&#39;left&#39;). In such cases it is fine to reference columns by their dataframe directly. You can also disambiguate joins using dataframe aliases (see more in the  Joins section in this guide).\n  Logical operations, which often reside inside  .filter() or  F.when(), need to be readable. We apply the same rule as with chaining functions, keeping logic expressions inside the same code block to  three (3) expressions at most. If they grow longer, it is often a sign that the code can be simplified or extracted out. Extracting out complex logical operations into variables makes the code easier to read and reason about, which also reduces bugs.\n # bad F. when( ( F. col( &#39;prod_status&#39;)  ==  &#39;Delivered&#39;)  | ((( F. datediff( &#39;deliveryDate_actual&#39;,  &#39;current_date&#39;)  &lt;  0)  &amp; (( F. col( &#39;currentRegistration&#39;)  !=  &#39;&#39;)  | (( F. datediff( &#39;deliveryDate_actual&#39;,  &#39;current_date&#39;)  &lt;  0)  &amp; (( F. col( &#39;originalOperator&#39;)  !=  &#39;&#39;)  | ( F. col( &#39;currentOperator&#39;)  !=  &#39;&#39;)))))),  &#39;In Service&#39;)\n The code above can be simplified in different ways. To start, focus on grouping the logic steps in a few named variables. PySpark requires that expressions are wrapped with parentheses. This, mixed with actual parenthesis to group logical operations, can hurt readability. For example the code above has a redundant  (F.datediff(df.deliveryDate_actual, df.current_date) &lt; 0) that the original author didn&#39;t notice because it&#39;s very hard to spot.\n # better has_operator  = (( F. col( &#39;originalOperator&#39;)  !=  &#39;&#39;)  | ( F. col( &#39;currentOperator&#39;)  !=  &#39;&#39;)) delivery_date_passed  = ( F. datediff( &#39;deliveryDate_actual&#39;,  &#39;current_date&#39;)  &lt;  0) has_registration  = ( F. col( &#39;currentRegistration&#39;). rlike( &#39;.+&#39;)) is_delivered  = ( F. col( &#39;prod_status&#39;)  ==  &#39;Delivered&#39;) F. when( is_delivered  | ( delivery_date_passed  &amp; ( has_registration  |  has_operator)),  &#39;In Service&#39;)\n The above example drops the redundant expression and is easier to read. We can improve it further by reducing the number of operations.\n # good has_operator  = (( F. col( &#39;originalOperator&#39;)  !=  &#39;&#39;)  | ( F. col( &#39;currentOperator&#39;)  !=  &#39;&#39;)) delivery_date_passed  = ( F. datediff( &#39;deliveryDate_actual&#39;,  &#39;current_date&#39;)  &lt;  0) has_registration  = ( F. col( &#39;currentRegistration&#39;). rlike( &#39;.+&#39;)) is_delivered  = ( F. col( &#39;prod_status&#39;)  ==  &#39;Delivered&#39;) is_active  = ( has_registration  |  has_operator) F. when( is_delivered  | ( delivery_date_passed  &amp;  is_active),  &#39;In Service&#39;)\n Note how the  F.when expression is now succinct and readable and the desired behavior is clear to anyone reviewing this code. The reader only needs to visit the individual expressions if they suspect there is an error. It also makes each chunk of logic easy to test if you have unit tests in your code, and want to abstract them as functions.\n There is still some duplication of code in the final example: how to remove that duplication is an exercise for the reader.\n  Doing a select at the beginning of a PySpark transform, or before returning, is considered good practice. This  select statement specifies the contract with both the reader and the code about the expected dataframe schema for inputs and outputs. Any select should be seen as a cleaning operation that is preparing the dataframe for consumption by the next step in the transform.\n Keep select statements as simple as possible. Due to common SQL idioms, allow only  one function from  spark.sql.function to be used per selected column, plus an optional  .alias() to give it a meaningful name. Keep in mind that this should be used sparingly. If there are more than  three such uses in the same select, refactor it into a separate function like  clean_&lt;dataframe name&gt;() to encapsulate the operation.\n Expressions involving more than one dataframe, or conditional operations like  .when() are discouraged to be used in a select, unless required for performance reasons.\n    The  select() statement redefines the schema of a dataframe, so it naturally supports the inclusion or exclusion of columns, old and new, as well as the redefinition of pre-existing ones. By centralising all such operations in a single statement, it becomes much easier to identify the final schema, which makes code more readable. It also makes code more concise.\n      # bad df. select( (( F. coalesce( F. unix_timestamp( &#39;closed_at&#39;),  F. unix_timestamp())  -  F. unix_timestamp( &#39;created_at&#39;))  /  86400). alias( &#39;days_open&#39;)) # good df. withColumn(  &#39;days_open&#39;, ( F. coalesce( F. unix_timestamp( &#39;closed_at&#39;),  F. unix_timestamp())  -  F. unix_timestamp( &#39;created_at&#39;))  /  86400)\n Avoid including columns in the select statement if they are going to remain unused and choose instead an explicit set of columns - this is a preferred alternative to using  .drop() since it guarantees that schema mutations won&#39;t cause unexpected columns to bloat your dataframe. However, dropping columns isn&#39;t inherintly discouraged in all cases; for instance- it is commonly appropriate to drop columns after joins since it is common for joins to introduce redundant columns.\n Finally, instead of adding new columns via the select statement, using  .withColumn() is recommended instead for single columns. When adding or manipulating tens or hundreds of columns, use a single  .select() for performance reasons.\n  If you need to add an empty column to satisfy a schema, always use  F.lit(None) for populating that column. Never use an empty string or some other string signalling an empty value (such as  NA).\n Beyond being semantically correct, one practical reason for using  F.lit(None) is preserving the ability to use utilities like  isNull, instead of having to verify empty strings, nulls, and  &#39;NA&#39;, etc.\n   While comments can provide useful insight into code, it is often more valuable to refactor the code to improve its readability. The code should be readable by itself. If you are using comments to explain the logic step by step, you should refactor it.\n # bad # Cast the timestamp columns cols  = [ &#39;start_date&#39;,  &#39;delivery_date&#39;] for  c  in  cols:  df  =  df. withColumn( c,  F. from_unixtime( F. col( c)  /  1000). cast( TimestampType()))\n In the example above, we can see that those columns are getting cast to Timestamp. The comment doesn&#39;t add much value. Moreover, a more verbose comment might still be unhelpful if it onlyprovides information that already exists in the code. For example:\n # bad # Go through each column, divide by 1000 because millis and cast to timestamp cols  = [ &#39;start_date&#39;,  &#39;delivery_date&#39;] for  c  in  cols:  df  =  df. withColumn( c,  F. from_unixtime( F. col( c)  /  1000). cast( TimestampType()))\n Instead of leaving comments that only describe the logic you wrote, aim to leave comments that give context, that explain the &#34; why&#34; of decisions you made when writing the code. This is particularly important for PySpark, since the reader can understand your code, but often doesn&#39;t have context on the data that feeds into your PySpark transform. Small pieces of logic might have involved hours of digging through data to understand the correct behavior, in which case comments explaining the rationale are especially valuable.\n # good # The consumer of this dataset expects a timestamp instead of a date, and we need # to adjust the time by 1000 because the original datasource is storing these as millis # even though the documentation says it&#39;s actually a date. cols  = [ &#39;start_date&#39;,  &#39;delivery_date&#39;] for  c  in  cols:  df  =  df. withColumn( c,  F. from_unixtime( F. col( c)  /  1000). cast( TimestampType()))\n  It is highly recommended to avoid UDFs in all situations, as they are dramatically less performant than native PySpark. In most situations, logic that seems to necessitate a UDF can be refactored to use only native PySpark functions.\n  Be careful with joins! If you perform a left join, and the right side has multiple matches for a key, that row will be duplicated as many times as there are matches. This is called a &#34;join explosion&#34; and can dramatically bloat the output of your transforms job. Always double check your assumptions to see that the key you are joining on is unique, unless you are expecting the multiplication.\n Bad joins are the source of many tricky-to-debug issues. There are some things that help like specifying the  how explicitly, even if you are using the default value  (inner):\n # bad flights  =  flights. join( aircraft,  &#39;aircraft_id&#39;) # also bad flights  =  flights. join( aircraft,  &#39;aircraft_id&#39;,  &#39;inner&#39;) # good flights  =  flights. join( aircraft,  &#39;aircraft_id&#39;,  how = &#39;inner&#39;)\n Avoid  right joins. If you are about to use a  right join, switch the order of your dataframes and use a  left join instead. It is more intuitive since the dataframe you are doing the operation on is the one that you are centering your join around.\n  Avoid renaming all columns to avoid collisions. Instead, give an alias to thewhole dataframe, and use that alias to select which columns you want in the end.\n # bad columns  = [ &#39;start_time&#39;,  &#39;end_time&#39;,  &#39;idle_time&#39;,  &#39;total_time&#39;] for  col  in  columns:  flights  =  flights. withColumnRenamed( col,  &#39;flights_&#39;  +  col)  parking  =  parking. withColumnRenamed( col,  &#39;parking_&#39;  +  col) flights  =  flights. join( parking,  on = &#39;flight_code&#39;,  how = &#39;left&#39;) flights  =  flights. select(  F. col( &#39;flights_start_time&#39;). alias( &#39;flight_start_time&#39;),  F. col( &#39;flights_end_time&#39;). alias( &#39;flight_end_time&#39;),  F. col( &#39;parking_total_time&#39;). alias( &#39;client_parking_total_time&#39;)) # good flights  =  flights. alias( &#39;flights&#39;) parking  =  parking. alias( &#39;parking&#39;) flights  =  flights. join( parking,  on = &#39;flight_code&#39;,  how = &#39;left&#39;) flights  =  flights. select(  F. col( &#39;flights.start_time&#39;). alias( &#39;flight_start_time&#39;),  F. col( &#39;flights.end_time&#39;). alias( &#39;flight_end_time&#39;),  F. col( &#39;parking.total_time&#39;). alias( &#39;client_parking_total_time&#39;))\n  It&#39;s probably best to drop overlapping columns  prior to joining if you don&#39;t need both;\n In case you do need both, it might be best to rename one of them prior to joining;\n You should always resolve ambiguous columns before outputting a dataset. After the transform is finished running you can no longer distinguish them.\n As a last word about joins, don&#39;t use  .dropDuplicates() or  .distinct() as a crutch. If unexpected duplicate rows are observed, there&#39;s almost always an underlying reason for why those duplicate rows appear. Adding  .dropDuplicates() only masks this problem and adds overhead to the runtime.\n  Chaining expressions is a contentious topic, however, since this is an opinionated guide, we are opting to recommend some limits on the usage of chaining. See the conclusion of this section for a discussion of the rationale behind this recommendation.\n Avoid chaining of expressions into multi-line expressions with different types, particularly if they have different behaviours or contexts. For example- mixing column creation or joining with selecting and filtering.\n # bad df  = (  df . select( &#39;a&#39;,  &#39;b&#39;,  &#39;c&#39;,  &#39;key&#39;) . filter( F. col( &#39;a&#39;)  ==  &#39;truthiness&#39;) . withColumn( &#39;boverc&#39;,  F. col( &#39;b&#39;)  /  F. col( &#39;c&#39;)) . join( df2,  &#39;key&#39;,  how = &#39;inner&#39;) . join( df3,  &#39;key&#39;,  how = &#39;left&#39;) . drop( &#39;c&#39;)) # better (seperating into steps) # first: we select and trim down the data that we need # second: we create the columns that we need to have # third: joining with other dataframes df  = (  df . select( &#39;a&#39;,  &#39;b&#39;,  &#39;c&#39;,  &#39;key&#39;) . filter( F. col( &#39;a&#39;)  ==  &#39;truthiness&#39;)) df  =  df. withColumn( &#39;boverc&#39;,  F. col( &#39;b&#39;)  /  F. col( &#39;c&#39;)) df  = (  df . join( df2,  &#39;key&#39;,  how = &#39;inner&#39;) . join( df3,  &#39;key&#39;,  how = &#39;left&#39;) . drop( &#39;c&#39;))\n Having each group of expressions isolated into its own logical code block improves legibility and makes it easier to find relevant logic.For example, a reader of the code below will probably jump to where they see dataframes being assigned  df = df....\n # bad df  = (  df . select( &#39;foo&#39;,  &#39;bar&#39;,  &#39;foobar&#39;,  &#39;abc&#39;) . filter( F. col( &#39;abc&#39;)  ==  123) . join( another_table,  &#39;some_field&#39;)) # better df  = (  df . select( &#39;foo&#39;,  &#39;bar&#39;,  &#39;foobar&#39;,  &#39;abc&#39;) . filter( F. col( &#39;abc&#39;)  ==  123)) df  =  df. join( another_table,  &#39;some_field&#39;,  how = &#39;inner&#39;)\n There are legitimate reasons to chain expressions together. These commonly represent atomic logic steps, and are acceptable. Apply a rule with a maximum of number chained expressions in the same block to keep the code readable.We recommend chains of no longer than 5 statements.\n If you find you are making longer chains, or having trouble because of the size of your variables, consider extracting the logic into a separate function:\n # bad customers_with_shipping_address  = (  customers_with_shipping_address . select( &#39;a&#39;,  &#39;b&#39;,  &#39;c&#39;,  &#39;key&#39;) . filter( F. col( &#39;a&#39;)  ==  &#39;truthiness&#39;) . withColumn( &#39;boverc&#39;,  F. col( &#39;b&#39;)  /  F. col( &#39;c&#39;)) . join( df2,  &#39;key&#39;,  how = &#39;inner&#39;)) # also bad customers_with_shipping_address  =  customers_with_shipping_address. select( &#39;a&#39;,  &#39;b&#39;,  &#39;c&#39;,  &#39;key&#39;) customers_with_shipping_address  =  customers_with_shipping_address. filter( F. col( &#39;a&#39;)  ==  &#39;truthiness&#39;) customers_with_shipping_address  =  customers_with_shipping_address. withColumn( &#39;boverc&#39;,  F. col( &#39;b&#39;)  /  F. col( &#39;c&#39;)) customers_with_shipping_address  =  customers_with_shipping_address. join( df2,  &#39;key&#39;,  how = &#39;inner&#39;) # better def  join_customers_with_shipping_address( customers,  df_to_join):  customers  = (  customers . select( &#39;a&#39;,  &#39;b&#39;,  &#39;c&#39;,  &#39;key&#39;) . filter( F. col( &#39;a&#39;)  ==  &#39;truthiness&#39;) )  customers  =  customers. withColumn( &#39;boverc&#39;,  F. col( &#39;b&#39;)  /  F. col( &#39;c&#39;))  customers  =  customers. join( df_to_join,  &#39;key&#39;,  how = &#39;inner&#39;)  return  customers\n Chains of more than 3 statement are prime candidates to factor into separate, well-named functions since they are already encapsulated, isolated blocks of logic.\n  Differentiation between PySpark code and SQL code. Chaining is something that goes against most, if not all, other Python styling. You don’t chain in Python, you assign.\n Discourage the creation of large single code blocks. These would often make more sense extracted as a named function.\n It doesn’t need to be all or nothing, but a maximum of five lines of chaining balances practicality with legibility.\n If you are using an IDE, it makes it easier to use automatic extractions or do code movements (i.e:  cmd + shift + up in pycharm)\n  The reason you can chain expressions is because PySpark was developed from Spark, which comes from JVM languages. This meant some design patterns were transported, specifically chainability. However, Python doesn&#39;t support multiline expressions gracefully and the only alternatives are to either provide explicit line breaks, or wrap the expression in parentheses. You only need to provide explicit line breaks if the chain happens at the root node. For example:\n # needs `\\` df  =  df. filter( F. col( &#39;event&#39;)  ==  &#39;executing&#39;)\\ . filter( F. col( &#39;has_tests&#39;)  ==  True)\\ . drop( &#39;has_tests&#39;) # chain not in root node so it doesn&#39;t need the `\\` df  =  df. withColumn( &#39;safety&#39;,  F. when( F. col( &#39;has_tests&#39;)  ==  True,  &#39;is safe&#39;) . when( F. col( &#39;has_executed&#39;)  ==  True,  &#39;no tests but runs&#39;) . otherwise( &#39;not safe&#39;))\n To keep things consistent, please wrap the entire expression into a single parenthesis block, and avoid using  \\:\n # bad df  =  df. filter( F. col( &#39;event&#39;)  ==  &#39;executing&#39;)\\ . filter( F. col( &#39;has_tests&#39;)  ==  True)\\ . drop( &#39;has_tests&#39;) # good df  = (  df . filter( F. col( &#39;event&#39;)  ==  &#39;executing&#39;) . filter( F. col( &#39;has_tests&#39;)  ==  True) . drop( &#39;has_tests&#39;))\n  Be wary of functions that grow too large. As a general rule, a fileshould not be over 250 lines, and a function should not be over 70 lines.\n Try to keep your code in logical blocks. For example, if you havemultiple lines referencing the same things, try to keep themtogether. Separating them reduces context and readability.\n Test your code! If you  can run the local tests, do so and makesure that your new code is c\n......", "posttime": "2020-10-21 16:07:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "样式,style,代码", "title": "PySpark样式指南", "title_en": "PySpark Style Guide", "transed": 1, "url": "https://github.com/palantir/pyspark-style-guide", "via": "", "real_tags": ["样式", "style", "代码"]}, {"category": "", "categoryclass": "", "imagename": "40eb13feee3fbf6f736cf02175ed7f50.jpg", "infoid": 1030266, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一份新的报告，超过10万名女性的假裸照已经从社交媒体照片中创建出来，并在网上分享。\n通过人工智能(AI)将衣服从女性照片中数字化移除，并在即时通讯应用Telegram上传播。\n情报公司Sensity的报告称，其中一些目标似乎是未成年人。\nDeepfake是计算机生成的，通常是逼真的图像和视频，基于真实的模板。它的用途之一是制作名人的假色情视频剪辑。\n但Sensity首席执行官乔治·帕特里尼(Giorgio Patrini)表示，使用私人照片的转变相对较新。\n他警告说，拥有一个拥有公开照片的社交媒体账户足以让任何人成为攻击目标。\n这个人工智能驱动的机器人生活在电报私人消息频道内。用户可以向机器人发送一张女性的照片，它将在几分钟内免费数字脱掉她的衣服。\n英国广播公司测试了多张图片，所有图片都征得了受试者的同意，没有一张是完全真实的--我们的结果包括一张横隔膜上有肚脐的女人的照片。\n去年，一款类似的应用程序被关闭，但据信该软件有破解版本在流通。\n运行这项服务的管理员(仅被称为“P#34；”)说：“我不在乎那么多。”这是不带暴力的娱乐节目。\n他还说，团队关注哪些照片被分享，当我们看到未成年人时，我们会永久屏蔽用户。\n但他说，是否与他人分享这张照片取决于最初使用机器人创建它的人。\n他为它的相对危害程度辩护说：世界上有战争、疾病和许多有害的东西。他还声称他很快就会删除所有的图片。\nSensity报告称，2019年7月至2020年期间，约有104,852名女性成为攻击目标，并公开分享了她们的假裸照。\n它的调查发现，一些图片似乎未成年，这表明一些用户主要是使用该机器人来生成和分享恋童癖内容。\nSensity表示，该机器人在俄罗斯社交媒体网站VK上有大量广告，该平台上的一项调查显示，大多数用户来自俄罗斯和前苏联国家。\n但VK表示：它不容忍平台上的此类内容或链接，并阻止传播这些内容或链接的社区。\nSensity的乔治·帕特里尼(Giorgio Patrini)表示，许多这样的网站或应用程序都不会隐藏或在地下运行，因为它们并不是严格非法的，Sensity的乔治·帕特里尼(Giorgio Patrini)说。\n报告的作者说，他们已经与Telegram、VK和相关执法机构分享了他们的所有调查结果，但没有得到回应。\n“深度造假与信息启示录”一书的作者妮娜·希克说，深度造假的创造者遍布世界各地，法律保护正在用这项技术迎头赶上。“深度造假与信息末日”一书的作者尼娜·希克说，深度造假的创造者遍布世界各地，法律保护正在用这项技术迎头赶上。\n内容变得更加复杂只是个时间问题。她说，深度假冒色情视频的数量似乎每六个月就会翻一番。\n在这个问题上，我们的法律制度不适合这个目的。由于这些指数性的技术进步，社会变化的速度比我们想象的要快，而我们作为一个社会还没有决定如何规范这一点。\n对于假色情的受害者来说，这是毁灭性的。这会彻底颠覆他们的生活，因为他们觉得受到了侵犯和羞辱。\n去年，美国弗吉尼亚州成为首批取缔深度假货的地方之一\n英国现行的关于假裸照的法律最近在一份大学报告中被批评为前后矛盾、过时和令人困惑。\n妇女援助慈善机构的露西·哈德利(Lucy Hadley)表示，尽管在复仇、色情和裙装等问题上取得了进展，但法律上仍然存在许多明显的差距。\n虽然这些统计数据显示了深伪图像可能会多么普遍，但目前这并不是一种具体的违法行为。\n政府已指示法律委员会审查英格兰和威尔士围绕这一问题的法律。其调查结果将于2021年公布。", "note_en": "Faked nude images of more than 100,000 women have been created from social media pictures and shared online, according to a new report.\n Clothes are digitally removed from pictures of women by Artificial Intelligence (AI), and spread on the messaging app Telegram.\n Some of those targeted &#34;appeared to be underage&#34;, the report by intelligence company Sensity said.\n    Deepfakes are computer-generated, often realistic images and video, based on a real template. One of its uses has been to create faked pornographic video clips of celebrities.\n But Sensity&#39;s chief executive Giorgio Patrini said the shift to using photos of private individuals is relatively new.\n &#34;Having a social media account with public photos is enough for anyone to become a target,&#34; he warned.\n  The artificial intelligence-powered bot lives inside a Telegram private messaging channel. Users can send the bot a photo of a woman, and it will digitally remove her clothes in minutes, at no cost.\n The BBC tested multiple images, all with the subjects&#39; consent, and none were completely realistic - our results included a photo of a woman with a belly button on her diaphragm.\n A similar app was shut down last year, but it is believed there are cracked versions of the software in circulation.\n The administrator running the service, known only as &#34;P&#34; said: &#34;I don&#39;t care that much. This is entertainment that does not carry violence.\n  He also said the team looks at what photos are shared, and &#34;when we see minors we block the user for good.&#34;\n  But the decision on whether to share the photo with others is up to whoever used the bot to create it in the first place, he said.\n Defending its relative level of harm, he added: &#34;There are wars, diseases, many bad things that are harmful in the world.&#34; He has also claimed he will soon remove all of the images.\n   Sensity reported that between July 2019 and 2020, approximately 104,852 women have been targeted and had fake naked images of them shared publicly.\n Its investigation found that some of the images appeared underage, &#34;suggesting that some users were primarily using the bot to generate and share paedophilic content.&#34;\n Sensity said the bot has had significant advertising on the Russian social media site VK, and a survey on the platform showed that most users were from Russia and ex-USSR countries.\n But VK said: &#34;It doesn&#39;t tolerate such content or links on the platform and blocks communities that distribute them.&#34;\n  &#34;Many of these websites or apps do not hide or operate underground, because they are not strictly outlawed,&#34; said Sensity&#39;s Giorgio Patrini.\n   The authors of the report say they have shared all their findings with Telegram, VK and relevant law enforcement agencies, but have not had a response.\n Nina Schick, author of the book Deep Fakes and the Infocalypse, said deepfake creators were all over the world, and that legal protections were &#34;playing catch-up&#34; with the technology.\n &#34;It&#39;s only a matter of time until that content becomes more sophisticated. The number of deepfake porn videos seems to be doubling every six months,&#34; she said.\n &#34;Our legal systems are not fit for purpose on this issue. Society is changing quicker than we can imagine due to these exponential technological advances, and we as a society haven&#39;t decided how to regulate this.\n &#34;It&#39;s devastating, for victims of fake porn. It can completely upend their life because they feel violated and humiliated.&#34;\n Last year the US state of Virginia became one of the first places to  outlaw deepfakes\n The current UK law around fake nude images has recently been criticised for being &#34;inconsistent, out-of-date and confusing&#34; in a  university report.\n Despite progress on issues like revenge porn and upskirting, &#34;there remain many glaring gaps in the law&#34;, says Lucy Hadley of the Women&#39;s Aid charity.\n While these statistics show how widespread deep-fake images can be, it is not currently a specific offence.\n The government has instructed the  Law Commission to review the law around the issue in England and Wales. Its findings are due in 2021.", "posttime": "2020-10-21 15:32:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "女性,naked,机器人", "title": "网上分享的数千名女性的假裸照", "title_en": "Fake naked photos of thousands of women shared online", "transed": 1, "url": "https://www.bbc.com/news/technology-54584127", "via": "", "real_tags": ["女性", "naked", "机器人"]}, {"category": "", "categoryclass": "", "imagename": "8a3fcbb26b685266c79911fa3a8e0bd8.jpg", "infoid": 1030265, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用以AR为中心的眼镜拍摄纪录片的想法听起来可能有些花哨，但“第一人称”正在处理一个沉重的话题：气候变化。\n该系列节目的制片人是记者优素福·奥马尔(他说，自2016年以来，他每天都戴着眼镜)和他的标签Our Stories项目，该项目已经培训了140个国家的1万多人用手机创作新闻。\n“第一人称”听起来像是这项工作的延伸--研究小组给六个国家的受试者送去眼镜，这样他们就可以记录他们正在做的抗击气候变化的工作。\n奥马尔通过电子邮件告诉我：“当新冠肺炎走红时，很多全球媒体作品都停止了拍摄。”“但我们的创新者并没有停止工作。向他们运送眼镜可以让我们接触到故事，否则在冠状病毒危机期间是不可能讲出来的。“。\n他补充说，用眼镜拍摄不仅仅是一种制作方法-它还允许观众从气候活动家的角度看问题。\n他说：“为这样的系列剧捕捉POV规格镜头的美妙之处在于，我们可以亲眼目睹变革制造者实际动手，创造、升级、回收和做出他们想看到的改变。”“他们的身体动作，看到双手在工作，通过他们的有利位置，使他们的动作更具关联性、趣味性和身临其境的感觉。”当年轻观众看的时候，他们会想‘我大概也能做到这一点。’“。\n事实上，这部电视剧每集还包括AR镜头-例如，一个镜头会在你的地板上增加裂缝，以表明缺水，而另一个镜头会在天空中添加二氧化碳云，以说明碳排放。\n“第一人称”将于本周六(10月24日)首映。你可以看下面的预告片。", "note_en": "The idea of filming a documentary using  AR-centric eyewear might sound gimmicky, but “First Person” is tackling a weighty topic: climate change.\n The series is produced by journalist Yusuf Omar (who said he’s been wearing Spectacles “every day of my life since 2016”) and his  Hashtag Our Stories program, which has trained more than 10,000 people in 140 countries to create journalism with their mobile phones.\n  “First Person” sounds like an extension of that work — the team sent Spectacles to subjects in six countries so that they could document the work that they’re doing to fight climate change.\n “When Covid-19 hit, a lot of global media productions stopped shooting,” Omar told me via email. “But our innovators didn’t stop working. Shipping Spectacles to them allowed us to reach stories, otherwise impossible to tell during the coronavirus crisis.”\n  He added that filming with Spectacles isn’t just a production method — it also allows viewers to literally see things from a climate activist’s perspective.\n “The beauty of capturing POV Specs footage for a series like this is that we get to witness change makers actually getting their hands dirty and creating, upcycling, recycling and making the change they want to see,” he said. “Their physical actions, seeing both hands at work, through their vantage point make their actions relatable, interesting and immersive. When young audiences watch it, they think ‘I can probably do that too.’”\n In fact, the series also includes AR lenses for each episode — one lens, for example, will add cracks to your floor to indicate water shortage, while another will add carbon dioxide clouds in the sky to illustrate carbon emissions.\n “First Person” premieres this Saturday, October 24. You can watch the trailer below.", "posttime": "2020-10-21 15:16:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "第一人称,trailer,眼镜", "title": "\n观看“第一人称”的预告片，这是一部在Snapchat眼镜上拍摄的以气候为重点的系列剧。", "title_en": "\n\t\t\t\tWatch the trailer for ‘First Person,’ a climate-focused series shot on Snapchat Spectacles\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/21/snapchat-first-person-trailer/", "via": "", "real_tags": ["第一人称", "trailer", "眼镜"]}, {"category": "", "categoryclass": "", "imagename": "e59aec519ef06d73fd94eacf26958a58.png", "infoid": 1030264, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Authelia是一个开源服务器，提供登录门户并与Nginx合作处理身份验证请求。\nAuthelia允许存储在LDAP中的用户提供他们的用户名和密码作为首要因素。\nAuthelia提供登录门户，让您的用户只需登录一次即可访问所有内容。\nAuthelia控制用户尝试登录的次数，以避免暴力攻击。\nAuthelia可以配置为高度可用和可伸缩，可以在Kubernetes或任何集群上运行。", "note_en": "Authelia is an open-source server providing a login portal and treating authentication requests in cooperation with  NGINX.\n  Authelia allows users stored in a LDAP to provide their username and password as first factor.\n  Authelia offers a login portal to allow your users to login once and access everything.\n          Authelia regulates the number of login attempts made by a user to avoid brute force attacks.\n  Authelia can be configured to be highly available and scalable and run on  Kubernetes or any cluster.", "posttime": "2020-10-21 15:12:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,open,提供", "title": "Authelia：开源的全功能认证服务器", "title_en": "Authelia: Open-source full-featured authentication server", "transed": 1, "url": "https://www.authelia.com/", "via": "", "real_tags": ["开源", "open", "提供"]}, {"category": "", "categoryclass": "", "imagename": "707068c6f1e3c09b45b700c8ea75e686.png", "infoid": 1030263, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前只有Linux被验证可以工作，但我们对最终也支持Windows的想法持开放态度。\n请记住，这是一个Alpha，因此数据丢失的风险是真实的，并且可能不稳定。\n如果这是您第一次使用游艇，请查看入门指南：https://ycht.tech/Installation/gettingstarted/。\n如果您想要一些计划外的东西，请打开一个功能请求问题，我们会考虑如何添加它。\n目前，游艇与港口模板兼容。您将在添加模板设置中添加模板URL。模板将被读取，分离到应用程序中，然后导入到数据库中。与模板相关联的应用程序通过数据库关系链接，因此当模板被移除时，与其相关联的应用程序也是如此。我们还存储了模板URL，这样我们就可以通过按一下按钮来更新模板。\n在模板中，您可以定义变量(从！开始！)。将它们自动替换为用户在其服务器设置中设置的任何变量(即，默认情况下，！config将替换为/yacht/appdata/Config)。\n如果您使用ARM，但图形未显示，请将以下内容添加到您的cmdline.txt中：", "note_en": "Currently only linux has been verified as working but we are open to the idea of supporting windows eventually as well.\n Keep in mind, this is an alpha so the risk of data loss is real and it may not be stable\n  Check out the getting started guide if this is the first time you&#39;ve used Yacht:  https://ycht.tech/Installation/gettingstarted/\n     If you want something that&#39;s not planned please open a feature request issue and we&#39;ll see about getting it added.\n  Currently Yacht is compatible with portainer templates. You&#39;ll add a template url in the &#34;Add Template&#34; settings. The the template will be read, separated into apps, and imported into the database. The apps associated with the templates are linked via a db relationship so when the template is removed, so are the apps associated with it. We store the template url as well so we can enable updating templates with a button press.\n   In templates you are able to define variables (starting with  !) to have them automatically replaced by whatever variable the user has set in their server settings (ie.  !config will be replaced by  /yacht/AppData/Config by default).\n  If you&#39;re on arm and graphs aren&#39;t showing up add the following to your cmdline.txt:", "posttime": "2020-10-21 15:12:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "web,模板", "title": "Yacht：用于管理容器的Web界面，只需单击一次即可部署", "title_en": "Yacht: Web interface for managing containers with 1 click deployments", "transed": 1, "url": "https://github.com/SelfhostedPro/Yacht", "via": "", "real_tags": ["web", "模板"]}, {"category": "", "categoryclass": "", "imagename": "74b080e3ca08fd6336ea82018bea49a9.png", "infoid": 1030262, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有新的证据表明，新冠肺炎患者缺乏维生素D与不良结局有关。相反，补充维生素D可以防止新冠肺炎最初的肺泡弥漫性损伤逐渐恶化。维生素D缺乏加重新冠肺炎肺炎的机制目前仍知之甚少。在这篇综述中，我们描述了内皮功能障碍在这一事件中可能扮演的角色的理论基础。本文就维生素D的抗炎和抗血栓作用，(2)维生素D受体和维生素D受体配体，(3)维生素D对内皮功能障碍的保护作用，(4)维生素D缺乏的危险性，(5)维生素D缺乏与内皮功能障碍的关系，(6)与新冠肺炎有关的维生素D的特点，(7)维生素D在先天和适应性反应中的作用，(8)促进细胞因子风暴的内皮细胞激活的生物标志物，以及(9)炎症和稳态之间的双向关系作一简要综述。最后，我们假设与维生素D缺乏相关的内皮功能障碍是由于维生素D受体与其在血管内皮细胞上的配体结合减少所致，这可能是通过增加干扰素1α而介导的。一系列可能的事件可描述为(1)血管紧张素II转换酶相关的初始内皮损伤，继而是维生素D受体相关的内皮功能障碍，(2)内皮损伤恶化为内皮炎、凝血障碍和血栓形成，(3)血管损伤加剧肺部病理，使维生素D缺乏的患者更容易死亡。", "note_en": "There is emerging evidence to suggest that vitamin D deficiency is associated with adverse outcomes in COVID-19 patients. Conversely, vitamin D supplementation protects against an initial alveolar diffuse damage of COVID-19 becoming progressively worse. The mechanisms by which vitamin D deficiency exacerbates COVID-19 pneumonia remain poorly understood. In this review we describe the rationale of the putative role of endothelial dysfunction in this event. Herein, we will briefly review (1) anti-inflammatory and anti-thrombotic effects of vitamin D, (2) vitamin D receptor and vitamin D receptor ligand, (3) protective role of vitamin D against endothelial dysfunction, (4) risk of vitamin D deficiency, (5) vitamin D deficiency in association with endothelial dysfunction, (6) the characteristics of vitamin D relevant to COVID-19, (7) the role of vitamin D on innate and adaptive response, (8) biomarkers of endothelial cell activation contributing to cytokine storm, and (9) the bidirectional relationship between inflammation and homeostasis. Finally, we hypothesize that endothelial dysfunction relevant to vitamin D deficiency results from decreased binding of the vitamin D receptor with its ligand on the vascular endothelium and that it may be immune-mediated via increased interferon 1 α. A possible sequence of events may be described as (1) angiotensin II converting enzyme-related initial endothelial injury followed by vitamin D receptor-related endothelial dysfunction, (2) endothelial lesions deteriorating to endothelialitis, coagulopathy and thrombosis, and (3) vascular damage exacerbating pulmonary pathology and making patients with vitamin D deficiency vulnerable to death.", "posttime": "2020-10-21 15:12:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维生素,缺乏,deficiency", "title": "维生素D缺乏与内皮功能的关系", "title_en": "Vitamin D deficiency in association with endothelial function", "transed": 1, "url": "https://pubmed.ncbi.nlm.nih.gov/33070539/", "via": "", "real_tags": ["维生素", "缺乏"]}, {"category": "", "categoryclass": "", "imagename": "663bc5650ca53e919602096273dfe800.jpg", "infoid": 1030261, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据萨里大学约翰乔·麦克法登教授开发的一项新理论，大脑中的电磁能使大脑物质能够创造我们的意识以及我们意识和思考的能力。麦克法登教授在“意识的神经科学”杂志上发表了他的理论，他提出意识实际上是大脑的能量场。这一理论可能为有意识的人工智能的发展铺平道路，有意识并有能力思考的机器人将成为现实。\n早期关于我们的意识是什么以及它是如何被创造的理论倾向于超自然，认为人类，可能还有其他动物都拥有一个非物质的灵魂，赋予意识、思想和自由意志-这些能力是无生命的物体所缺乏的。今天，大多数科学家已经抛弃了这种被称为二元论的观点，转而接受大脑本身及其由数十亿神经组成的网络产生的意识的一元论观点。相比之下，麦克法登提出了一种科学的二元论形式，其基础是物质和能量之间的差异，而不是物质和灵魂之间的差异。\n这一理论基于科学事实：当大脑和神经系统中的神经元燃烧时，它们不仅沿着线状神经纤维发送熟悉的电信号，而且还向周围组织发送脉冲。这种能量通常被忽视，但它携带的信息与发射相同，但它是一种无形的能量波，而不是进出神经的原子流。\n这一领域是众所周知的，通常通过脑电图(EEG)和脑磁图(MEG)等脑扫描技术检测到，但之前曾被认为与大脑功能无关而不屑一顾。相反，麦克法登提出，大脑信息丰富的电磁场实际上本身就是意识的所在地，驱动着自由意志和自愿行动。这一新发现也解释了为什么今天的计算机尽管极其复杂，运行速度极快，却没有表现出丝毫的意识火花；然而，只要技术发展得当，能够感知并能独立思考的机器人就能成为现实。\n分子遗传学教授、萨里大学量子生物学博士生培训中心主任约翰乔·麦克法登(Johnjoe McFadden)说：“几千年来，哲学家、神学家、神秘主义者和普通人一直在思考如何感知并设法思考。”我相信这个谜团现在已经解开了，那就是神经连接到自我生成的体验，以驱动我们所说的自由意志和我们的自愿行动。更多信息，约翰乔·麦克法登(Johnjoe McFadden)报道。整合大脑EM领域的信息：意识的CEMI领域理论，意识的神经科学(2020)。DOI：10.1093/NC/NIAA016。\n引文：研究人员提出新的意识理论(2020年10月20日)，检索自https://medicalxpress.com/news/2020-10-theory-consciousness.html。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "Electromagnetic energy in the brain enables brain matter to create our consciousness and our ability to be aware and think, according to a new theory developed by Professor Johnjoe McFadden from the University of Surrey.    Publishing his theory in the journal  Neuroscience of Consciousness, Professor McFadden posits that consciousness is in fact the brain&#39;s energy field. This theory could pave the way toward the development of conscious AI, with robots that are aware and have the ability to think becoming a reality.\n  Early theories on what our consciousness is and how it has been created tended toward the supernatural, suggesting that humans and probably other animals possess an immaterial soul that confers consciousness, thought and free will—capabilities that inanimate objects lack. Most scientists today have discarded this view, known as dualism, to embrace a &#39;monistic&#39; view of a consciousness generated by the brain itself and its network of billions of nerves. By contrast, McFadden proposes a scientific form of dualism based on the difference between matter and energy, rather than matter and soul.\n  The theory is based on scientific fact: when neurons in the brain and nervous system fire, they not only send the familiar electrical signal down the wire-like nerve fibres, but they also send a pulse of   into the surrounding tissue. Such energy is usually disregarded, yet it carries the same information as   firings, but as an immaterial wave of energy, rather than a flow of atoms in and out of the nerves.\n  This   field is well-known and is routinely detected by brain-scanning techniques such as electroencephalogram (EEG) and magnetoencephalography (MEG) but has previously been dismissed as irrelevant to brain function. Instead, McFadden proposes that the brain&#39;s information-rich electromagnetic field is in fact itself the seat of consciousness, driving &#39;free will&#39; and voluntary actions. This new   also accounts for why, despite their immense complexity and ultra-fast operation, today&#39;s computers have not exhibited the slightest spark of consciousness; however, with the right technical development, robots that are aware and can think for themselves could become a reality.\n  Johnjoe McFadden, Professor of Molecular Genetics and Director of the Quantum Biology Doctoral Training Centre at the University of Surrey, said: &#34;How   becomes aware and manages to think is a mystery that has been pondered by philosophers, theologians, mystics and ordinary people for millennia. I believe this mystery has now been solved, and that   is the experience of nerves plugging into the  &#39;s self-generated   to drive what we call &#39;free will&#39; and our voluntary actions.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tJohnjoe McFadden. Integrating information in the brain&#39;s EM field: the cemi field theory of consciousness,  Neuroscience of Consciousness (2020).  DOI: 10.1093/nc/niaa016\n     Citation: Researcher proposes new theory of consciousness (2020, October 20) retrieved 21 October 2020 from https://medicalxpress.com/news/2020-10-theory-consciousness.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-10-21 15:12:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,proposes,意识", "title": "研究人员提出新的意识理论", "title_en": "Researcher proposes new theory of consciousness", "transed": 1, "url": "https://medicalxpress.com/news/2020-10-theory-consciousness.html", "via": "", "real_tags": ["人员", "proposes", "意识"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030260, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我得出的结论是，对我来说，ORM弊大于利。简而言之，它们可以用来很好地增强与SQLIN程序的合作，但它们不应该取代它。\n一些背景知识：在过去的30个月里，我一直在使用必须与Postgres接口的代码，在某种程度上，还必须与SQLite接口。其中大部分是SQLAlChemy(我很喜欢)和Hibernate(我不喜欢)。我使用过现有的代码和数据模型，也设计过自己的代码和数据模型。大多数数据是基于事件的存储(“时间线”)，重点放在创建报告上。\n关于对象/关系ImpedanceMismatch的文章已经很多了。除非你亲身经历过，否则很难欣赏它。纽瓦德在他著名的文章中提出了许多令人信服的理由，解释了奥姆斯为什么会陷入泥潭。根据我的经验，我必须直接处理很多问题：实体身份问题、双重模式问题、数据检索机制问题和部分对象问题。我想简单谈谈我在这些问题上的经验，并加上我自己的一个。\n也许我遇到的ORMS中最具颠覆性的问题是“属性记录”或“宽表”，即不断累积属性的表。尽管我很想避免它，但有时它是必要的(尽管像Postgres的hstore这样的东西可以帮助我)。例如，客户可能会向您提供大量数据，他们希望将这些数据附加到基于各种业务逻辑的报告中。此外，您对这些数据没有太多的洞察力；您只是在胡乱摆弄它。\n在数据库中，这本身并不是一件可怕的事情。有了ORM，它就成了真正的痛点。具体地说，问题开始出现在任何直接使用实体创建查询的查询中。在项目的早期，您可能有一个类似于Hibernate的查询。\n当foo有五个属性时，这可能很好，但是当它有一百个属性时，它就变成了一个数据消防软管。这等同于使用SELECT*，它通常表达的信息比预期的要多。然而，ORM鼓励这种使用，并且经常使编写精确的预测变得非常容易，就像它们在SQL中一样。(我通过添加适当的投影优化了这类查询，并将运行时间从几分钟减少到几秒；所有时间都花在了将数据库行转换为Java对象上。)。\n这导致了另一个糟糕的经历：有害地使用外键。在我使用过的ORM中，类之间的链接在数据模型中表示为外键，如果没有仔细配置，在检索对象时会导致大量连接。(在我的工作中，最近对一个这样的表进行了计数，结果产生了600多个属性和14个连接来访问单个对象，使用首选查询方法。)。\n属性爬行和过度使用外键告诉我，为了有效地使用ORM，您仍然需要了解SQL。与ORMS的争用之处在于，如果您需要了解SQL，只需使用SQL，因为它不需要知道如何将非SQL转换为SQL。\n当您试图使用ORM实际编写查询时，了解如何编写SQL变得更加重要。当效率令人担忧时，这一点尤为重要。\n在我看来，除非您有一个非常简单的数据模型(也就是说，您从来不做连接)，否则您将竭尽全力计算出如何让ORM生成高效运行的SQL。大多数情况下，它比实际的SQL更加模糊。\n如果您选择保持查询简单，那么您最终将在代码中完成大量工作，而这些工作可以在数据库中更快地完成。窗口函数是相对高级的SQL，用ORM编写起来很痛苦。不将它们写入查询可能意味着您会将大量额外数据从数据库传输到您的应用程序。\n在这些情况下，我选择使用模板系统编写查询，并使用ORM描述表。通过直接使用SQL，我获得了表的应用层描述的便利性。这比我到目前为止用过的任何东西麻烦都要少得多。\n这似乎是那些不可避免的裁员之一。如果你试图摆脱它，你只会制造更多的问题或增加太多的复杂性。\n问题在于，您最终在两个位置拥有数据定义：数据库和应用程序。如果将定义完全保留在应用程序中，则最终必须使用ORM代码编写SQL DataDefinition Language(DDL)，这与在ORM中编写高级查询是相同的。如果您将其保存在数据库中，则为了方便和防止过多的“字符串键入”，您可能需要在应用程序中使用表示形式。\n我更喜欢将数据定义保存在数据库中，然后将其读取到应用程序中。它不能解决问题，但它使问题更易于管理。我发现用反射技术来获取数据定义是不值得的，我不得不在两个地方管理数据定义的不稳定性。\n但是，该死的迁移问题是真正的刺痛：更改模型在应用程序中没什么大不了的，但在数据库中却是真正的痛苦。毕竟，数据库是持久的，而应用程序数据不是。ORM在这里只是个障碍，因为它们根本不能帮助管理数据迁移。我的工作原则是数据库的数据定义不应该在应用程序中操作。相反，应该操作查询结果。也就是说，查询是您对数据库的API。因此，我不再考虑对象，而是考虑具有返回类型的函数。\n因此，人们不得不问，除了方便进行查询之外，您是否应该使用ORM呢？\n在使用ORM时，处理实体标识是您必须始终牢记的事情之一，它迫使您为两个系统编写代码，而只有一个系统的可表达性。\n当您有外键时，您使用标识符引用相关标识。在您的应用程序中，“标识符”有多种含义，但通常是内存位置(指针)。在数据库中，它是对象本身的状态。这两件事并不能很好地相处，因为您实际上只能在数据库(您正在处理的数据的最终目的地)中使用数据库标识符。\n这导致必须通过手动刷新缓存或执行部分提交来操作ORM来获取数据库标识符，以获取实际的数据库标识符。\n我甚至不能将其称为泄漏抽象，因为“泄漏”意味着相对于源代码有少量内容泄漏。\n纽瓦德提到的一些事情是开发人员需要处理事务。事务是动态限定作用域的，这在编程语言中是一个强大但通常被忽略的概念，因为如果过度使用它们会导致融合。这导致了大量带有异常处理程序的boilerplatecode，并仔细考虑了事务边界应该发生在哪里。它还使您可以将会话对象传递给可能必须与数据库通信的任何函数/方法。\n由于应用程序对基于时间的上下文的依赖，事务的概念很难转化为应用程序。正如前面提到的，动态作用域是在程序中使用它的一种方式，但它与主导范式词汇化作用域不一致。因此，在编写使用数据库的代码时，您必须非常小心地了解事务的“何时”，这可能会使模块化变得棘手(“这里有一个仅在某些上下文中有效的有用函数”)。\n在这一点上，我开始质疑直接拒绝存储过程背后的智慧。这听起来很异端，但它可能适用于我的用例。(嘿，随着“devops”的出现，开发人员和数据库管理员之间的分歧基本上是不存在的。)\n我发现自己将数据库看作是另一种具有API的数据类型：查询。查询返回某种类型的值，这些值在程序中表示为某个对象。通过不再将应用程序中的对象视为要存储在数据库中的对象(ORMS的存在理由)，而将数据库视为(大型且复杂的)数据类型，我发现在应用程序中使用数据库要简单得多。想知道为什么我没有早点看到。\n(应该明确的是，我并不是说所有的应用程序都应该这样处理数据库。我要说的是，根据我正在处理的数据，这符合我的用例。)。\n不管我是否发现存储过程实际上并不那么邪恶，或者我是否继续使用模板化的SQL，我都知道一件事：我不会落入“ORMS使事情变得容易”的陷阱。它们是表示数据定义的一种可以接受的方式，但是编写查询的方式很差，存储对象状态的方式也很糟糕。如果您使用的是RDBMS，请咬紧牙关学习SQL。", "note_en": "I’ve come to the conclusion that, for me, ORMs are more detriment thanbenefit. In short, they can be used to nicely augment working with SQLin a program, but they should not replace it.\n Some background: For the past 30 months I’ve been working with codethat has to interface with Postgres and to some extent, SQLite. Mostof that has been with  SQLAlchemy (which I quite like) and  Hibernate(which I don’t). I’ve worked with existing code and data models, aswell as designing my own. Most of the data is event-based storage(“timelines”) with a heavy emphasis on creating reports.\n Much has been written about the Object/Relational ImpedanceMismatch. It’s hard to appreciate it until you live it. Neward, in his well known essay, lays out many cogent reasons why ORMs turn intoquagmires. In my experience, I’ve had to deal directly with a fairnumber of them:  entity identity issues,  dual-schema problem,  dataretrieval mechanism concern, and the  partial-object problem. I want totalk briefly about my experiences with these issues and add one of myown.\n Perhaps the most subversive issue I’ve had with ORMs is “attributecreep” or “wide tables”, that is, tables that just keep accruingattributes. As much as I’d like to avoid it, sometimes it becomesnecessary (although things like  Postgres’ hstore can help). Forexample, a client may be providing you with lots of data that theywant attached to reports based on various business logic. Furthermore,you don’t have much insight into this data; you’re just schlepping itaround.\n This in and of itself isn’t a terrible thing in a database. It becomesa real pain point with an ORM. Specifically, the problem starts toshow up in any query that uses the entity directly to create thequery. You may have a Hibernate query like so early on in the project.\n  This may be fine when Foo has five attributes, but becomes a data firehose when it has a hundred. This is the equivalent of using  SELECT*, which is usually saying more than what is intended. ORMs, however,encourage this use and often make writing precise projections astedious as they are in SQL. (I have optimized such queries by addingthe appropriate projection and reduced the run time from minutes toseconds; all the time was spent translating the database row into aJava object.)\n Which leads to another bad experience: the pernicious use of foreignkeys. In the ORMs I’ve used, links between classes are represented inthe data model as foreign keys which, if not configured carefully,result in a large number of joins when retrieving the object. (Arecent count of one such table in my work resulted in over 600attributes and 14 joins to access a single object, using the preferredquery methodology.)\n Attribute creep and excessive use of foreign keys shows me is that inorder to use ORMs effectively, you still need to know SQL. Mycontention with ORMs is that, if you need to know SQL, just use SQLsince it prevents the need to know how non-SQL gets translated to SQL.\n Knowing how to write SQL becomes even more important when you attemptto actually write queries using an ORM. This is especially importantwhen efficiency is a concern.\n From what I’ve seen, unless you have a really simple data model (thatis, you never do joins), you will be bending over backwards to figureout how to get an ORM to generate SQL that runs efficiently. Most ofthe time, it’s more obfuscated than actual SQL.\n And if you elect to keep the query simple, you end up doing a lot ofwork in the code that could be done in the database faster.  Windowfunctions are relatively advanced SQL that is painful to write withORMs. Not writing them into the query likely means you will betransferring a lot of extra data from the database to yourapplication.\n In these cases, I’ve elected to write queries using a templatingsystem and describe the tables using the ORM. I get the convenience ofan application level description of the table with direct use ofSQL. It’s a lot less trouble than anything else I’ve used so far.\n This one seems to be one of those unavoidable redundancies. If youtry to get rid of it, you only make more problems or add excessivecomplexity.\n The problem is that you end up having a data definition in two places:the database and your application. If you keep the definitionentirely in the application, you end up having to write the SQL DataDefinition Language (DDL) with the ORM code, which is the samecomplication as writing advanced queries in the ORM. If you keep itin the database, you will probably want a representation in theapplication for convenience and to prevent too much “string typing”.\n I much prefer to keep the data definition in the database and read itinto the application. It doesn’t solve the problem, but it makes itmore manageable. I’ve found that reflection techniques to get thedata definition are not worth it and I succumb to managing theredundancy of data definitons in two places.\n But the damn migration issue is a real kick in the teeth: changing themodel is no big deal in the application, but a real pain in thedatabase. After all, databases are persistent whereas applicationdata is not. ORMs simply get in the way here because they don’t helpmanage data migration at all. I work on the principle that thedatabase’s data definitions aren’t things you should manipulate in theapplication. Instead, manipulate the results of queries. That is,the queries are your API to the database. So instead of thinkingabout objects, I think about functions with return types.\n Thus, one is forced to ask, should you use an ORM for anything butconvenience in making queries?\n Dealing with entity identities is one of those things that you have tokeep in mind at all times when working with ORMs, forcing you to writefor two systems while only have the expressivity of one.\n When you have foreign keys, you refer to related identities with anidentifier. In your application, “identifier” takes on variousmeanings, but usually it’s the memory location (a pointer). In thedatabase, it’s the state of the object itself. These two things don’treally get along because you can really only use database identifiersin the database (the ultimate destination of the data you’re workingwith).\n What this results in is having to manipulate the ORM to get a databaseidentifier by manually flushing the cache or doing a partial commit toget the actual database identifier.\n I can’t even call this a leaky abstraction because the work “leak”implies small amounts of the contents escaping relative to the source.\n Something that Neward alludes to is the need for developers to handletransactions. Transactions are dynamically scoped, which is a powerfulbut mostly neglected concept in programming languages due to theconfusion they cause if overused. This leads to a lot of boilerplatecode with exception handlers and a careful consideration of wheretransaction boundaries should occur. It also makes you pass sessionobjects around to any function/method that might have to communicatewith the database.\n The concept of a transaction translates poorly to applications due totheir reliance on context based on time. As mentioned, dynamic scopingis one way to use this in a program, but it is at odds with lexicalscoping, the dominant paradigm. Thus, you must take great care to knowabout the “when” of a transaction when writing code that works withdatabases and can make modularity tricky (“Here’s a useful functionthat will only work in certain contexts”).\n  At this point, I’m starting to question the wisdom behind the outrightrejection of  stored procedures. It sounds  heretical, but it may workfor my use cases. (And hey, with the advent of “devops”, the dividebetween the developer and the database administrator is basicallynon-existent.)\n I’ve found myself thinking about the database as just another datatype that has an API: the queries. The queries return values of sometype, which are represented as some object in the program. By movingaway from thinking of the objects in my application as something to bestored in a database (the raison d’être for ORMs) and instead thinkingof the database as a (large and complex) data type, I’ve found workingwith a database from an application to be much simpler. And wonderingwhy I didn’t see it earlier.\n (It should be made clear that I am not claiming this is how allapplications should deal with a database. All I am saying is thatthis fits my use case based on the data I am working with.)\n Regardless of whether I find that stored procedures aren’t actuallythat evil or whether I keep using templated SQL, I do know one thing:I won’t fall into the “ORMs make it easy” trap. They are an acceptableway to represent a data definition, but a poor way to write queriesand a bad way to store object state. If you’re using an RDBMS, bitethe bullet and learn SQL.", "posttime": "2020-10-21 14:54:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学习,taught,数据库", "title": "Orms教会我的：只需学习SQL(2014)", "title_en": "What ORMs Have Taught Me: Just Learn SQL (2014)", "transed": 1, "url": "https://wozniak.ca/blog/2014/08/03/1/", "via": "", "real_tags": ["学习", "taught", "数据库"]}, {"category": "", "categoryclass": "", "imagename": "9777c4662921ff2c4e18742ec7d96b33.png", "infoid": 1030259, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我上一篇关于现代C++的博客文章获得了惊人数量的反馈。有些人甚至用其他语言重新实现了这个程序，包括Go中的一个，Rust中的两个不同的，甚至这个稍微有点费解的C++重新实现是一个声明式流水线。这件事也在Reddit和Hacker新闻上被谈论过。不断弹出的两条主要评论如下。\n让我们同时解决这两个问题吧。有很多支持Unicode的文本处理解决方案，但我们将使用10,000公斤的锤子：Unicode的国际组件。实际的代码更改不是那么大，感兴趣的人可以在这个Github回购中查找详细信息。与这篇博客相关的是构建和依赖管理。介子构建定义相当简短：线程依赖是针对多线程部分的(参见本文末尾)。我是在Linux上开发的，并使用了ICU提供的便捷系统。Windows和Mac不提供系统库，因此我们需要在这些平台上从头开始构建ICU。这是通过在项目的源根目录中运行以下命令来实现的：\n这将联系Meson的WrapDB服务器并下载ICU的构建定义文件。这就是你需要做的全部事情。构建文件不需要任何更改。当您开始构建项目时，Meson将自动下载并构建依赖项。以下是下载步骤的屏幕截图：\n这种方法的一个值得注意的缺点是，WrapDB还没有那么多包。然而，有人告诉我，考虑到下一个Meson版本(几周后)和一些上游补丁，可以将整个GTK小部件工具包作为一个子项目构建，即使是在Windows上也是如此。\n如果有人想为这个项目做贡献，我们非常欢迎。例如，您可以转换现有项目并将其提交到wrapdb或成为审查者。介子网站有相关文档。\n多位人士指出，虽然原来的程序运行得很好，但只用了一个线程。这可能是一个瓶颈，而且在C++中很难并行执行工作。这也是在过去的几年里变得更好的事情之一。正确的解决方案应该是使用Transform_Reduce的并行版本。不幸的是，大多数并行STL实现仍在实现过程中，所以我们不能在多平台代码中使用这些实现。然而，我们可以相当容易地滚动我们自己的互斥体，而不需要手动创建或锁定单个互斥体。代码包含实际细节，但其要点(略有编辑)如下：\n这里，COUNT_WORD_FILES函数计算单个文件中的字数，POP_FOREND函数将各个结果连接到最终结果。通过使用无共享体系结构、纯函数和值类型，所有业务逻辑代码都可以像单线程一样编写，线程和互斥管理的细节可以留给库代码。哈斯克尔的粉丝们会感到自豪(或者可能感到恐惧，不是很确定)。", "note_en": "My previous blog post about modern C++ got a surprising amount of feedback. Some people even reimplemented the program in other languages, including one  in Go,  two  different ones in Rust and even  this slightly brain bending C++ reimplementation as a declarative style pipeline. It also got talked about on Reddit and Hacker news. Two major comments that kept popping up were the following.\n  Let&#39;s solve both of these problems at the same time. There are many &#34;lite&#34; solutions for doing Unicode aware text processing, but we&#39;re going to use the 10 000 kilogram hammer:  International Components for Unicode. The actual code changes are not that big, interested parties can go look up the details in  this Github repo. The thing that is relevant for this blog post is the build and dependency management. The Meson build definition is quite short:     The threads dependency is for the multithreaded parts (see end of this post). I developed this on Linux and used the convenient system provided ICU. Windows and Mac do not provide system libs so we need to build ICU from scratch on those platforms. This is achieved by running the following command in your project&#39;s source root:\n  This contacts Meson&#39;s  WrapDB server and downloads build definition files for ICU. That is all you need to do. The build files do not need any changes. When you start building the project, Meson will automatically download and build the dependency. Here is a screenshot of the download step:\n      One notable downside of this approach is that WrapDB does not have all that many packages yet. However I have been told that given the next Meson release (in a few weeks) and some upstream patches, it is possible to build the entire GTK widget toolkit as a subproject, even on Windows.\n If anyone wants to contribute to the project, contributions are most welcome. You can for example convert existing projects and submit them to wrapdb or become a reviewer. The Meson web site has  the relevant documentation.\n  Several people pointed out that while the original program worked fine, it only uses one thread. This may be a bottleneck and that &#34;in C++ it is hard to execute work in parallel&#34;. This is again one of those things that has gotten a lot better in the last few years. The &#34;correct&#34; solution would be to use the parallel version of  transform_reduce. Unfortunately most parallel STL implementations are still in the process of being implemented so we can&#39;t use those in multiplatform code. We can, however, roll our own fairly easily,  without needing to create or lock a single mutex by hand. The code has the actual details, but the (slightly edited) gist of of it is this:\n    Here the  count_word_files function calculates the number of words in a single file and the  pop_future function joins individual results to the final result. By using a share-nothing architecture, pure functions and value types all business logic code can be written as if it was single threaded and the details of thread and mutex management can be left to library code. Haskell fans would be proud (or possibly horrified, not really sure).", "posttime": "2020-10-21 14:02:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,meson,style,构建", "title": "使用MESON对C、C++和其他语言进行货运式依赖管理", "title_en": "Cargo-style dependency management for C, C++ and other languages with Meson", "transed": 1, "url": "https://nibblestew.blogspot.com/2020/10/cargo-style-dependency-management-for-c.html", "via": "", "real_tags": ["c++", "meson", "style", "构建"]}, {"category": "", "categoryclass": "", "imagename": "18b6543ca958addeb58b9457547435ea.png", "infoid": 1030258, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "什么是共识算法？什么是分布式数据库？Kubernetes和ZooKeeper如何以容错方式存储数据？\n这些是我们将在本文中尝试回答的一些问题。本文的A部分将尝试解释您将在当前的分布式计算世界中听到的一些常见术语。在B部分中，我们将探讨共识算法的基本概念。C部分将介绍两个著名的共识算法，RAFT和ZAB，最后，我们将探索这些算法如何支持ZooKeeper和Kubernetes的分布式本质。\n这些概念可能看起来很新，但了解它们肯定会对你的工作或下一次面试有所帮助。马丁·克莱普曼(Martin Kleppmann)写的一本名为“设计数据密集型应用程序”(Designing Data-密集型Applications)的优秀著作中借用了大量文字内容。祝您学习愉快！\n在单引导者复制中，引导者(主)将数据复制到其所有跟随者(读取副本、辅助节点)。这是最常用的复制模式。每当新写入到达主节点时，它都会将该写入保留到其本地存储，并将相同的数据作为更改流或复制日志发送到其所有复制副本。然后，每个辅助节点按照在领导节点上处理数据的相同顺序更新其自己的本地数据副本。\n在领导者-跟随者的情况下，可能会发生两个节点都认为自己是领导者的情况。这种情况叫做裂脑。如果两位领导人都接受写入是危险的，而且没有解决冲突的过程。数据可能会丢失或损坏。\n让我们考虑一下我们有五个节点的情况。节点A是当前的领导者，其余的是跟随者。现在假设我们的节点A出现故障。其余节点在它们之间做出决定，并将节点B提升为新的领导者。现在节点A重新联机。这个节点直到现在还不知道发生了什么，并且仍然相信自己是领导者，这导致系统有两个领导者节点。\n线性化背后的基本思想是使系统看起来好像只有一个数据副本，并且其中的所有操作都是原子的。有了这个保证，即使可能有多个副本，实际上应用程序也不需要担心它们。\n可线性化很重要，因为它解决了一些非常重要的用例，例如锁定和领导者选举、数据库唯一性保证(唯一性约束)和跨通道定时依赖。\n您可能认为实现这一点的最简单方法是真正只使用数据的单个副本。但是，这种方法是不可容错的。如果保存该副本的节点出现故障，数据将丢失，或者至少在重新启动该节点之前无法访问。现在问题出现了，如何在复制的数据库中实现线性化。\n单个引导者复制：在这里，引导者拥有用于写入的数据的主拷贝，而跟随者在其他节点上维护数据的备份拷贝。如果你从领导者或同步更新的追随者那里阅读，那么他们就有可能成为线性化的。\n单引导器复制通过选择一个节点作为引导器，并对引导器上单个CPU核心上的所有操作进行排序，从而确定操作的总顺序。因此，挑战是如何在吞吐量大于单个领导者可以处理的情况下扩展系统，以及在领导者出现故障时如何处理故障转移。在分布式系统中，这个问题称为全序广播或原子广播。\n全顺序广播通常被描述为用于在节点之间交换消息的协议。非正式地，它要求始终满足两个安全属性：\n交付可靠。不会丢失任何消息。如果将消息传递到一个节点，则会将其传递到所有节点。\n查看总订单广播的另一种方式是，它是创建日志(如复制日志中的日志)的一种方式，其中传递消息类似于将消息追加到日志。由于所有节点必须以相同的顺序传递相同的消息，因此所有节点都可以读取日志并看到相同的消息序列。\n总订单广播是异步的。保证以固定顺序可靠地传递消息，但不能保证何时传递消息(因此，一个收件人可能会落后于其他收件人)。相比之下，线性化是近期的保证。保证读取时会看到写入的最新值。\n几乎所有的共识算法在内部都使用领导者。这些协议利用纪元编号，并保证在每个纪元内，领导者是唯一的。\n1.每次认为现任领导人已经去世，节点之间就会开始投票选举新的领导人。\n2.该选举被赋予递增的纪元编号，因此纪元编号是完全有序的并且单调递增。\n3.如果两个不同时代的不同领导人之间存在冲突(可能是因为前一位领导人实际上并没有去世)，那么以纪元数较高的领导人为准。\n4.领导者在被允许作出任何决定之前，必须从一定的节点法定人数中收集选票。只有当节点不知道有任何其他具有更高纪元的领导者时，它才会投票支持一项提议。这可以防止大脑分裂的问题。\n共识意味着多个服务器就相同的信息达成一致。通常，我们可以通过三个步骤定义一致性算法：\n当选人。流程会选出一位领导人来做决策。领导者提出下一个有效的输出值。\n投票吧。无故障流程监听领导提出的值，对其进行验证，并将其作为下一个有效值提出。\n决定吧。非故障流程必须就单个正确的输出值达成共识。\n共识算法是分布式系统的一大突破。它们为系统带来了具体的安全属性(一致性、完整性和有效性)，但它们仍然具有容错性。它们提供全顺序广播，因此它们还可以以容错的方式实现可线性化的原子操作。\n算法可以容忍的失败次数是有限制的。任何共识算法都需要至少大多数节点正常工作才能确保终止。\n共识算法有一些与之相关的局限性，这限制了它们在某些情况下的可用性。\n节点在决定提案之前对其进行投票的过程是一种同步复制，这会导致性能问题。\n协商一致制度总是需要绝对多数才能运作。这意味着，在四个节点的仲裁中，您至少需要三个节点才能运行。\n共识系统通常依靠超时来检测故障节点。在具有高度可变的网络延迟的环境中，经常会发生节点错误地认为领导者由于暂时性网络问题而发生故障的情况。在这种情况下频繁的领导人选举会导致糟糕的表现，因为系统最终可能会花费更多的时间来选择领导人，而不是做任何有用的工作。\n最后，我们都在等待的部分：理解到目前为止我们读到的一切是如何构成各种共识算法的支柱的。然后，我们来看一下各种常用的协调服务的工作原理：ZooKeeper和etcd。\nRAFT算法是一种单引导者算法。RAFT算法中的节点可以处于以下三种状态之一：\n领导者保持以心跳超时指定的规则间隔向所有跟随者发送心跳。所有消息都通过此心跳进行通信。RAFT算法遵循以下步骤。\n如果追随者没有收到领导人的来信，那么他们可以成为候选人。选举超时是指追随者在成为候选人之前等待的时间。它是随机的，介于150ms和300ms之间。\n然后，候选人开始新的选举任期。它为自己投票，并向其他节点发送请求投票消息。节点用它们的投票进行回复。\n如果候选人从多数节点获得选票，它就会成为领导者。这个过程叫做领导人选举。所有更改都要经过引线，如上图所示。\n在领导人选举期间，请求投票还包含有关候选人日志的信息，以确定哪个日志是最新的。如果请求投票的候选人的更新数据少于它请求投票的追随者，则追随者根本不会投票给所述候选人。\n每个更改都会作为一个条目添加到领导者的日志中。日志条目最初是未提交的。\n领导者等待，直到大多数节点已经写入该条目。收到响应后，现在提交条目。\n然后，领导者更新跟随者该值已提交的信息。追随者节点然后分别提交该值。\n群集现在已就系统状态达成共识。此过程称为日志复制。\n解决了分裂大脑问题，因为在集群中，任何时候都只有一个节点可以达到多数。如果两个节点的票数相等，则投票将再次进行。\n正如您一定已经意识到的那样，该算法使用了我们之前研究过的两阶段提交的概念。首先，由一位领导人发起一轮投票。在超过半数的选票被接受后，就会发起承诺。\n它正在各种系统中使用，例如etcd和Consul(Hashicorp)。MongoDB的复制也受到RAFT算法的广泛影响。\nZAB(动物园饲养员原子广播)是动物园饲养员使用的一种共识协议。ZAB是针对ZooKeeper的专用协议，因此它的使用仅限于ZooKeeper。扎布和动物园管理员一起出生于2007年。\n如果领导者在提交阶段失败，并且此写入操作已在至少一个跟随者上提交，则该跟随者肯定会被选为领导者，因为它的zxid是最大的。被选为领袖后，此跟随者让所有跟随者提交此消息。\n从上面的图表中我们可以看到，到目前为止，我们已经探索过的共识算法有广泛的实现，比如ZooKeeper、etcd和Chubby。它们间接用于解决分布式系统中的各种问题，如服务发现、协调、锁定、故障检测和主机选举。\n“一种高度一致的分布式键值存储，它提供了一种可靠的方式来存储需要由分布式系统或计算机群集访问的数据。它可以在网络分区期间优雅地处理领导者选举，并可以容忍机器故障，即使在领导者节点中也是如此。ETCD机器之间的通信通过RAFT共识算法进行处理。\n现在让我们来看看使用它的一些流行工具/软件。\nEtcd用作服务发现的后端，并存储所有集群状态和配置，本质上是作为其数据库。\n它使用etcd的手表功能来监视对这两项内容的更改。如果它们有分歧，库伯内斯就会做出改变，使实际状态和期望状态相协调。\n通过kubectl create进行的任何更改都将导致etcd中的条目更新。\n用于维护配置信息、命名、提供分布式同步和提供组服务的集中式服务。\n动物园看守人本身就是一个技术奇迹，所以我们不会深入讨论它的全部细节。\nZooKeeper维护集群配置信息，该信息在集群中的所有节点之间共享。\n它可以通过使用锁、队列等来解决集群中的分布式同步问题。\nZooKeeper还在群组服务中帮助选择集群中的主要动物(领导者选举过程)。\n提供更改通知功能。客户端可以发现另一个客户端何时加入集群(基于它写入ZooKeeper的值)，或者另一个客户端是否失败。\n作为应用程序开发人员，您很少需要直接使用ZooKeeper，因为它实际上并不适合作为通用数据库。更有可能的是，您最终会通过其他项目间接依赖它。例如，HBase、Hadoop纱线、OpenStack Nova、Akka和Kafka都依赖于在后台运行的ZooKeeper。\n“Apache Kafka是一个开源的分布式事件流平台，被数千家公司用于高性能数据管道、流分析、数据集成和任务关键型应用程序。”-Apache Kafka网站。\n控制者选举：控制者是Kafka生态系统中最重要的经纪实体之一，它也有责任维护所有分区的领导者-追随者关系。\n主题配置：包括所有主题的配置，包括已有主题的列表，如每个主题的分区数、所有副本的位置等。\n访问控制列表：所有主题的访问控制列表或ACL也在ZooKeeper中维护。\n集群的成员身份：ZooKeeper还维护在任何给定时刻运行并且是集群一部分的所有代理的列表。\n然而，Kafka很快就计划取消对ZooKeeper的依赖，以简化其架构。在他们的博客https://www.confluent.io/blog/category/apache-kafka上可以找到一些与卡夫卡工作有关的令人惊叹的文章。\n这些都是我这边的，伙计们。我希望这篇文章对你有意义。请随时给出您的反馈意见。", "note_en": "What are consensus algorithms?  What are distributed databases? How do Kubernetes and ZooKeeper store data in a fault-tolerant way?\n These are some of the questions that we will try to answer in this article. Part A of the article will try to explain some of the common terminologies that you will hear in the current world of distributed computing. In Part B, we will explore the basic concepts of consensus algorithms. Part C will cover two famous consensus algorithms,  Raft and  Zab, and towards the end, we will explore how these algorithms power the distributed nature of  ZooKeeper and  Kubernetes.\n These concepts might seem new, but knowledge of them will surely help you in your work or your next interview. A lot of textual content has been borrowed from the superb book written by Martin Kleppmann, titled  Designing Data-Intensive Applications. Happy learning!\n  In a single-leader replication, the leader (primary) replicates data to all of its followers (read replicas, secondary nodes). This is the most commonly used mode of replication. Whenever a new write comes to the primary node, it keeps that write to its local storage and sends the same data to all its replicas as a change stream or replication log. Each secondary then updates its own local copy of data in the same order as it was processed on the leader node.\n  In leader-follower situations, it could happen that two nodes both believe that they are the leader. This situation is called  split-brain. It is dangerous if both leaders accept writes, and there is no process for resolving conflicts. Data is likely to be lost or corrupted.\n  Let’s consider a situation where we have five nodes. Node A is the current leader and the rest are followers. Now suppose our Node A goes down. The rest of the nodes decide amongst themselves and promote Node B as the new leader. Now Node A comes back online. This node isn’t aware of what has happened until now and still believes itself to be the leader, which results in the system to be having two leader nodes.\n  The basic idea behind linearizability is to make a system appear as if there were only one copy of the data and that all operations in it are atomic. With this guarantee, even though there may be multiple replicas, in reality, the application does not need to worry about them.\n Linearizability is important as it solves some of the very important use cases, such as lock and leader election, database uniqueness guarantees (uniqueness constraints), and cross-channel timing dependencies.\n You might think that the simplest way to achieve this would be to really only use a single copy of the data. However, this approach is not fault-tolerant. If the node holding that one copy failed, the data would be lost, or at least inaccessible until the node was brought up again. Now the question arises, how to achieve linearizability in a replicated database.\n Single leader replication: Here the leader has the primary copy of the data that is used for writes, and the followers maintain backup copies of the data on other nodes. If you make reads from the leader, or from synchronously updated followers, then they have the potential  to be linearizable.\n  Single-leader replication determines a total order of operations by choosing one node as the leader and sequencing all operations on a single CPU core on the leader. The challenge then is how to scale the system if the throughput is greater than a single leader can handle, and also how to handle failover if the leader fails. In distributed systems, this problem is known as  total order broadcast or  atomic broadcast.\n Total order broadcast is usually described as a protocol for exchanging messages between nodes. Informally, it requires that two safety properties always be satisfied:\n Reliable delivery. No messages are lost. If a message is delivered to one node, it is delivered to all nodes.\n Another way of looking at total order broadcast is that it is a way of creating a log  (as in a replication log) where delivering a message is like appending to the log. Since all nodes must deliver the same messages in the same order, all nodes can read the log and see the same sequence of messages.\n  Total order broadcast is asynchronous. Messages are guaranteed to be delivered reliably in a fixed order, but there is no guarantee about when a message will be delivered (so one recipient may lag behind the others). By contrast, linearizability is a recency guarantee. A read is guaranteed to see the latest value written.\n  Almost all of the consensus algorithms internally make use of a leader. These protocols make use of epoch number and guarantee that within each epoch, the leader is unique.\n 1. Every time the current leader is thought to be dead, a vote is started among the nodes to elect a new leader.\n 2. This election is given an incremented epoch number, and thus epoch numbers are totally ordered and monotonically increasing.\n 3. If there is a conflict between two different leaders in two different epochs (perhaps because the previous leader actually wasn’t dead after all), then the leader with the higher epoch number prevails.\n 4. Before a leader is allowed to decide anything, it must collect votes from a quorum of nodes. A node votes in favour of a proposal only if it is not aware of any other leader with a higher epoch. This prevents the split-brain problem.\n  Consensus means multiple servers agreeing on the same information. Generally, we can define a consensus algorithm by three steps:\n Elect. Processes elect a leader to make decisions. The leader proposes the next valid output value.\n Vote. The non-faulty processes listen to the value being proposed by the leader, validate it, and propose it as the next valid value.\n Decide. The non-faulty processes must come to a consensus on a single correct output value.\n   Consensus algorithms are a huge breakthrough for distributed systems. They bring concrete safety properties (agreement, integrity, and validity) to systems and they nevertheless remain fault-tolerant. They provide total order broadcast, and therefore they can also implement linearizable atomic operations in a fault-tolerant way.\n  There is a limit to the number of failures that an algorithm can tolerate. Any consensus algorithm requires at least a majority of nodes to be functioning correctly in order to assure termination.\n  Consensus algorithms have some limitations associated with them, which restrict their usability in some situations.\n The process by which nodes vote on proposals before they are decided is a kind of synchronous replication, leading to performance issues.\n Consensus systems always require a strict majority to operate. This means, in a quorum of four nodes, you need a minimum of three nodes to operate.\n Consensus systems generally rely on timeouts to detect failed nodes. In environments with highly variable network delays, it often happens that a node falsely believes the leader to have failed due to a transient network issue. Frequent leader elections in such scenarios result in terrible performance because the system can end up spending more time choosing a leader than doing any useful work.\n  Finally, the part we are all waiting for: understanding how everything we have read till now forms the backbone of various consensus algorithms. Then we look at the workings of various commonly used coordinations services: ZooKeeper and  etcd.\n  Raft is a single-leader algorithm. A node in the Raft algorithm can be in one of the three states:\n     The leader keeps sending a heartbeat to all the followers at regular intervals specified by the heartbeat timeout. All messages are communicated through this heartbeat. The Raft algorithm follows the following steps.\n If followers don’t hear from a leader, then they can become a candidate. The  election timeout is the amount of time a follower waits until becoming a candidate. It is randomised to be between 150ms and 300ms.\n The candidate then starts a new election term. It votes for itself and sends out  request vote messages to other nodes. Nodes reply with their vote.\n The candidate becomes the leader if it gets votes from a majority of nodes. This process is called  leader election . All changes go through the leader, as shown in the figure above.\n During a leader election, the request vote also contains information about the candidate’s log to figure out which one is the latest. If the candidate requesting the vote has less updated data than the follower from which it is requesting vote, the follower simply doesn’t vote for the said candidate.\n Each change is added as an entry in the leader’s log. The log entry is initially uncommitted.\n  The leader waits until a majority of nodes have written the entry. After receiving the response, the entry is now committed.\n The leader then updates the followers that the value has been committed. Follower nodes then commit this value respectively.\n The cluster has now come to a consensus about the system state. This process is called  log replication.\n The split-brain problem is solved because in the cluster at any moment only one node can achieve a majority. If two nodes have equal votes, then the voting happens again.\n As you must have realised, this algorithm uses the concept of two-phase commit that we previously explored. First, a round of votes is initiated from a leader. After the acceptance of more than half of the votes, a commit is launched.\n It is being used in a variety of systems such as etcd and  Consul (Hashicorp). MongoDB’s replication is also widely influenced by the Raft algorithm\n  ZAB (ZooKeeper Atomic BroadCast) is a consensus protocol used in ZooKeeper. ZAB is a dedicated protocol for ZooKeeper and hence its usage is limited to ZooKeeper. ZAB was born in 2007 along with ZooKeeper.\n  If the leader fails in the commit phase and this write operation has been committed on at least one follower, then this follower will definitely be selected as a leader because its zxid is the greatest. After being selected as the leader, this follower lets all followers commit this message.\n  As we can see from the above chart, the consensus algorithms we have explored until now have a wide range of implementations such ZooKeeper, etcd, and  Chubby. They are indirectly used to solve various issues in distributed systems such as service discovery, coordination, locks, failure detection, and master election.\n   “a strongly consistent, distributed key-value store that provides a reliable way to store data that needs to be accessed by a distributed system or cluster of machines. It gracefully handles leader elections during network partitions and can tolerate machine failure, even in the leader node. Communication between etcd machines is handled via the Raft consensus algorithm.”\n Let us now take a look at some of the popular tools/software where it is being used.\n  etcd is used as the back end for service discovery and stores all the clusters state and configurations, essentially as its database.\n It uses etcd’s  watch functionality to monitor changes to either of these two things. If they diverge, Kubernetes makes changes to reconcile the actual state and the desired state.\n  Any change you make via  kubectl create will cause an entry in etcd to be updated.\n     “a centralised service for maintaining configuration information, naming, providing distributed synchronization, and providing group services.”\n ZooKeeper is itself a technical marvel, so we won’t be going into complete in-depth details of it.\n ZooKeeper maintains cluster configuration info which is shared across all the nodes in the cluster.\n It can be used for solving distributed synchronization problems in the cluster by using locks, queues, etc.\n ZooKeeper also helps in group service with the selection of a primary in the cluster (the leader election process).\n Provides change notification capabilities. Clients can find out when another client joins the cluster (based on the value it writes to ZooKeeper) or if another client fails.\n  As an application developer, you will rarely need to use ZooKeeper directly because it is actually not well suited as a general-purpose database. It is more likely that you will end up relying on it indirectly via some other project. For example, HBase, Hadoop YARN, OpenStack Nova, Akka, and Kafka all rely on ZooKeeper running in the background.\n   “Apache Kafka is an open-source distributed event streaming platform used by thousands of companies for high-performance data pipelines, streaming analytics, data integration, and mission-critical applications.” —  Apache Kafka website\n  Controller election: The controller is one of the most important broking entities in a Kafka ecosystem, and it also has the responsibility to maintain the leader-follower relationship across all the partitions.\n Configuration of topics: It includes the configuration regarding all the topics, including the list of existing topics, like the number of partitions for each topic, the location of all the replicas, etc.\n Access control lists: Access control lists or ACLs for all the topics are also maintained within ZooKeeper.\n Membership of the cluster: ZooKeeper also maintains a list of all the brokers that are functioning at any given moment and are a part of the cluster.\n However, Kafka is soon planning to remove the dependency on ZooKeeper in order to simplify its architecture. Some amazing articles related to working of Kafka can be found on their blog  https://www.confluent.io/blog/category/apache-kafka\n  That&#39;s all from my side, folks. I hope this article made sense to you. Please feel free to give your feedback.", "posttime": "2020-10-21 14:01:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "algorithms,算法,共识,consensus,节点", "title": "揭开共识算法的神秘面纱及其实现", "title_en": "Demystifying Consensus Algorithms and Their Implementations", "transed": 1, "url": "https://medium.com/better-programming/demystifying-consensus-algorithms-and-their-implementations-c52f8aca3020", "via": "", "real_tags": ["算法", "共识", "consensus", "节点"]}, {"category": "", "categoryclass": "", "imagename": "89d09d49e274db65505e2cc37f5da969.jpg", "infoid": 1030256, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "社交媒体上一直流传着一个持续不断的谎言：COVID的死亡人数远远低于官方统计的21.8万多人，因此这种疾病的危险被夸大了。8月份，特朗普总统转发了一条推文，声称这些报告的死亡人数中只有6%实际上来自新冠肺炎。(这条推文来自一名被揭穿的阴谋幻想QAnon的追随者。)。推特以包含虚假信息为由删除了这篇帖子，但诸如此类的捏造仍在继续传播。美国堪萨斯州众议员罗杰·马歇尔(Roger Marshall)9月抱怨称，脸书删除了一篇帖子，他在帖子中声称，疾病控制和预防中心报告的新冠肺炎死亡病例中，有94%“是额外的2-3种严重疾病造成的，而且是高龄”。\n现在来看一些事实：研究人员毋庸置疑地知道，美国新冠肺炎的死亡人数已超过20多万人。这些数字有三行证据支持，包括死亡证明。美国疾病控制与预防中心(CDC)国家健康统计中心(National Center For Health Statistics)首席死亡统计学家罗伯特·安德森(Robert Anderson)表示，认为只有6%的死亡真的是由冠状病毒造成的不准确想法，是对死亡证明工作原理的“严重误解”。\n冠状病毒致死人数的范围是显而易见的，即使最终数字要等到大流行结束才能知道。约翰·霍普金斯大学彭博公共卫生学院的传染病流行病学家贾斯汀·莱斯勒说：“我们对死亡的规模和量级相当有信心，但我们还不清楚确切的数字。”要理解为什么这些数字包含一些不确定性，重要的是要知道它们是如何收集和计算的。\n死亡数据的第一个来源被称为病例监测。安德森说，医疗保健提供者被要求向州卫生部门报告某些疾病的病例和死亡情况，包括麻疹、腮腺炎和现在的新冠肺炎，后者进而将这些信息传递给疾控中心。全国公共卫生统计和信息系统协会执行董事肖娜·韦伯斯特(Shawna Webster)说，监测数据是一种“快速和肮脏”的核算。她说，各州收集了所有关于这些疾病的信息，但这是第一次通过核算-没有人有时间仔细检查信息或寻找丢失的实验室测试。为此，你必须寻找下一个信息源：重要记录。\n第二条证据来自国家生命统计系统，该系统记录出生和死亡证明。当有人死亡时，死亡证明会在死亡发生的州存档。这些记录在州一级登记后，会被发送到国家卫生统计中心，该中心追踪国家一级的死亡情况。死亡证明不会被归档到系统中，直到提交了出色的测试结果，信息尽可能完整。韦伯斯特说，当一份记录进入生命记录系统时，“它已经接近完美了。”\n安德森说，医生、法医或验尸官在死亡证明上填写死亡原因，他们被指示只包括那些导致或导致死亡的情况。其中一个字段列出了导致死亡的一系列事件。安德森说：“我们真正想要了解的是引发导致死亡的一连串事件的条件或疾病。”对新冠肺炎来说，这可能有点像新冠肺炎肺炎引起的急性呼吸窘迫。他说，证书的第二部分列出了其他可能导致死亡的重要条件，但不是导致死亡的事件序列的一部分。这些被称为合并症，虽然它们可以是促成因素，但它们不能直接参与最终导致死亡的因果链条。安德森说，糖尿病或心脏病等先前存在的疾病是常见的并存疾病，它们会使人更容易感染冠状病毒，“但事实是：他们不会死于这种先前存在的疾病。”\n“当我们问COVID是否杀了人时，意思是‘如果他们没有感染病毒，他们会不会死得更早？’”莱斯勒说。即使是这样一个患有心脏病或糖尿病等潜在缩短寿命的人，如果没有感染新冠肺炎，也可能再活5年、10年或更长时间。\n特朗普和Qanon吹捧的6%这个数字来自疾控中心的一份每周报告，报告称，在其统计的6%的冠状病毒死亡病例中，新冠肺炎是死亡证明上唯一列出的情况。这一观察结果很可能意味着那些死亡证明是不完整的，因为证明者只给出了潜在的死因，而没有给出导致i的完整因果序列。\n监测和重要统计数据提供了一幅相当好的图景，可以看出有多少死亡是由冠状病毒造成的，但它们并没有涵盖所有的死亡人数，这就是最后一条证据的用武之地：额外的死亡人数。弗吉尼亚联邦大学医学院的内科医生兼人口健康研究员史蒂芬·伍尔夫(Steven Woolf)说，这是超过那个时期历史模式的死亡人数。在本月发表在“美国医学会杂志”(JAMA)上的一篇论文中，伍尔夫和他的同事检查了美国3月1日至8月1日的死亡记录，并将其与预期死亡数字进行了比较。他们发现，与前几年相比，这段时间内的死亡人数增加了20%-总共增加了225,530人。\n其中三分之二的案例被归咎于死亡证明上的新冠肺炎，伍尔夫说，对其余的有两种解释：其中一些是新冠肺炎的死亡，根本没有记录在案，可能是因为这个人死在家里，从未接受过测试，或者是因为证书编码错误。一些额外的死亡可能是大流行的结果，但不一定是病毒本身。例如，他说，想象一下一个胸痛的患者因为不想感染病毒而害怕去医院，然后死于心脏病发作。伍尔夫称之为“间接死亡”。“死亡并不是由病毒本身造成的，但大流行正在夺走生命，”他说。\n伍尔夫研究中的数字来自临时死亡数据，疾病预防控制中心还没有检查过编码错误或其他问题，所以它在一定程度上是不精确的。然而，让他对这些结果建立信心的是，他们已经被他的团队和其他人复制了无数次。“所有对这些数据的严肃分析都表明，我们在新闻中听到的死亡人数是一个低估的数字，”他说。\n新冠肺炎现在是美国第三大死因。无论死亡人数加起来是218,511人，219,681人，还是219,541人--正如美国疾病控制与预防中心、约翰·霍普金斯大学和“纽约时报”10月19日分别报道的那样--缩短的生命是一个惊人的数字。\n从“科学美国人”这里阅读更多关于冠状病毒爆发的信息。在这里阅读我们的国际杂志网络的报道。", "note_en": "A persistent falsehood has been circulating on social media: the  number of COVID deaths is much lower than the official statistic of more than  218,000, and therefore the danger of the disease has been overblown. In August President Trump retweeted a post claiming that only 6 percent of these reported deaths were actually from COVID-19. (The tweet originated from a follower of the debunked conspiracy fantasy QAnon.) Twitter removed the post for containing false information, but fabrications such as these continue to spread. U.S. Representative Roger Marshall of Kansas  complained in September that Facebook had removed a post in which he claimed that 94 percent of COVID-19 deaths reported by the Centers for Disease Control and Prevention “were the result of 2-3 additional serious illnesses and were of advanced age.”\n  Now some facts: Researchers know beyond a doubt that the number of COVID-19 deaths in the U.S. have surpassed 200,000. These numbers are supported by three lines of evidence, including death certificates. The inaccurate idea that only 6 percent of the deaths were really caused by the coronavirus is “a gross misinterpretation” of how death certificates work, says Robert Anderson, lead mortality statistician at the CDC’s National Center for Health Statistics.\n  The scope of the coronavirus’s deadly toll is clear, even if final numbers  will not be known until the pandemic is over. “We’re pretty confident about the scale and order of magnitude of deaths, but we’re not clear on the exact number yet,” says Justin Lessler, an infectious disease epidemiologist at the Johns Hopkins Bloomberg School of Public Health. To understand why the figures contain some uncertainty, it is important to know how they are collected and calculated.\n  The first source of death data is called case surveillance. Health care providers are required to report cases and deaths from certain diseases, including measles, mumps and now COVID-19, to their state’s health department, which, in turn, passes this information along to the CDC, Anderson says. The surveillance data are a kind of “quick and dirty” accounting, says Shawna Webster, executive director of the National Association for Public Health Statistics and Information Systems. The states gather all the information they can on these diseases, but this is the first pass of the accounting—no one has time to double-check the information or look for missing lab tests, she says. For that, you have to look for the next source of information: vital records.\n    This second line of evidence comes from the  National Vital Statistics System, which records birth and death certificates. When somebody dies, a death certificate is filed in the state where the death occurred. And after the records are registered at a state level, they are sent to the National Center for Health Statistics, which tracks deaths at a national level. Death certificates are not filed in the system until outstanding test results are in and the information is as complete as possible. By the time a record gets to the vital records system, “it is as close to perfect as it’s going to get,” Webster says.\n  A physician, medical examiner or coroner fills out the cause of mortality on the death certificate, and they are instructed to include only those conditions that caused or contributed to death, Anderson says. One field lists the sequence of events leading to the death. “What we’re really trying to get at is the condition or disease that started the chain of events leading to the death,” Anderson says. “For COVID-19, that might be something like acute respiratory distress due to pneumonia due to COVID-19.” A second part of the certificate lists other significant conditions that may have contributed to the death yet were not part of the sequence of events that led up to it, he says. These are called comorbidities, and while they can be contributing factors, they cannot be directly involved in the chain of cause and effect that ended in death. Preexisting medical conditions such as diabetes or heart disease are common comorbidities, and they can make a person more vulnerable to the coronavirus, Anderson says, “but the fact is: they’re not dying from that preexisting condition.”\n  “When we ask if COVID killed somebody, it means ‘Did they die sooner than they would have if they didn’t have the virus?’” Lessler says. Even such a person with a potentially life-shortening preexisting condition such as heart disease or diabetes may have lived another five, 10 or many more years, had they not become infected with COVID-19.\n  The 6 percent number touted by Trump and QAnon comes from a  weekly CDC report stating that in 6 percent of the coronavirus mortality cases it counted, COVID-19 was the only condition listed on the death certificate. That observation likely means that those death certificates were incomplete because the certifiers only gave the underlying cause of death and not the full causal sequence that led to it, Anderson says. Even someone who does not have a preexisting condition and dies from COVID-19 will also have comorbidities in the form of symptoms, such as respiratory failure, caused by the coronavirus. The idea that a death certificate with ailments listed in addition to COVID-19 means that the person did not really die from the virus is simply false, Anderson says.\n  The surveillance and vital statistics data provide a pretty good picture of how many deaths are attributable to the coronavirus, but they do not capture all of them, and that is where the final line of evidence come in: excess deaths. They are the number of deaths that occur above and beyond the historical pattern for that time period, says Steven Woolf, a physician and population health researcher at the Virginia Commonwealth University School of Medicine. In a paper published in  JAMA this month, Woolf and his colleagues  examined death records in the U.S. from March 1 through August 1 and compared them with the expected mortality numbers. They found that there was a 20 percent increase in deaths during this time period—for a total of 225,530 excess deaths—compared with previous years.\n  Two thirds of these cases were attributed to COVID-19 on the death certificates, and Woolf says there are two types of explanations for the rest: Some of them were COVID-19 deaths that simply were not documented as such, perhaps because the person died at home and was never tested or because the certificate was miscoded. And some of the extra deaths were probably a consequence of the pandemic yet not necessarily the virus itself. For instance, he says, imagine a patient with chest pain who is scared to go to the hospital because they do not want to get the virus and then dies of a heart attack. Woolf calls this “indirect mortality.” “The deaths aren’t literally caused by the virus itself but the pandemic is claiming lives,” he says.\n  The numbers in Woolf’s study come from provisional death data, the kind that the CDC has not yet checked for miscoding or other issues, so it comes with some degree of imprecision. What builds his confidence in these results, however, is the fact that they have been replicated numerous times by his group and others. “All serious analyses of these data are showing that the number of deaths we’re hearing on the news is an undercount,” he says.\n  COVID-19 is now the third leading cause of death in the U.S. Whether the deaths add up to 218,511, 219,681 or 219,541—as reported by the CDC, Johns Hopkins University and the  New York Times, respectively, on October 19—it’s a staggering number of lives cut short.\n  Read more about the coronavirus outbreak from Scientific American   here. And read coverage from our international network of magazines  here.", "posttime": "2020-10-21 13:31:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "covid,false,死亡", "title": "揭穿COVID死亡人数被夸大的虚假说法", "title_en": "Debunking the False Claim That COVID Death Counts Are Inflated", "transed": 1, "url": "https://www.scientificamerican.com/article/debunking-the-false-claim-that-covid-death-counts-are-inflated/", "via": "", "real_tags": ["covid", "false", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030255, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于PineappleFund.Me距离我的使命和慈善项目Pineapplefund.org结束已经两年多了，我大部分的比特币都是在这个网站上捐赠的。\n简单介绍一下我的情况，现在我和我的家人都处于相当困难的境地！我失去了一台笔记本电脑，里面有我生活中的许多信息，还有一个装有2000多个比特币的冰冷钱包！这是我在比特币的最后一笔存款。\n碰巧的是，现在我不得不重新开始我的整个生活，我还有很长很艰难的路要走。我真的希望我能拿到我的冰冷钱包。\n我需要大约25亿BTC来解决我的问题并进一步发展，这只是我从菠萝基金捐赠的金额的近0.05%。\n我从来没有想过我会因为发财而不得不求助，但是生活中有不同的情况，今天我想问问每一个关心我活动的人，每一个接受过我帮助的人，朋友们，我一直对你们很好，真的希望你们能同样回答我，在我困难的情况下帮助我。我相信回旋镖效应。不要无动于衷！\n我相信奇迹和善良，因为最近我一直在帮助相信奇迹，为世界各地的许多人做好事！\n菠萝基金是用加密货币财富进行慈善事业的一次试验。当你的游戏金变成了宝箱，而你已经过了钱的饱足点，会发生什么呢？\n我决定将我的大部分加密货币捐赠给世界各地的慈善机构，申请程序开放，并为大大小小的慈善机构提供资金。我专注于我相信的事业，或者我从我的经验中知道会奏效的事业。\n在2017年密码泡沫出现的时候，5104BTC变成了5500万美元的慈善事业。我为即将到来的影响感到高兴和自豪，这主要要归功于令人惊叹的慈善机构和背后敬业的人们。\n我将保持匿名，因为菠萝基金的重点不是我。我认为这个项目是成功的。如果你有幸拥有密码财富，考虑支持你对我们这个世界的渴望吧：)。\n在更大的规模上，菠萝基金创造了一种更神秘的加密货币慈善形式。\n该组织是去年12月由一位绰号为“Pine”的匿名捐赠者创立的，他声称自己是世界上最大的250名比特币持有者之一。该基金的目标是捐赠价值8600万美元的比特币，并已经向13个组织捐赠了价值2000万美元的比特币，其中包括向为撒哈拉以南非洲地区的人们提供清洁水的水项目(Water Project)和数字权利监督机构电子前沿基金会(Electronic Frontier Foundation)捐赠了100万美元。\n(这些捐款可以通过比特币的数字账簿系统进行核实，该系统将每笔交易记录在一个公共数据库中。)。\n不管派恩是谁，他或她似乎已经找到了一种将比特币转换成实际有用的东西的方法。\n在比特币出现的最初几天的某个时候，我看到了分散货币的承诺，于是决定用神奇的互联网代币进行买卖。多年来人们对比特币收入的预期导致了比我当时能花的钱多得多的钱，我把我的大部分比特币都捐了出来，就在最近，在意想不到的情况下，我把其他所有的比特币和我的笔记本电脑一起弄丢了。\n我过去常常把大部分钱捐给慈善机构。顺便告诉你一下，我进来的时候，菠萝基金的规模比整个市场的比特币帽子还大，而且是当天最富有的250个比特币地址之一。\n当时，我认为我不可能落到这种地步。但现在我正在工作，试图从震惊中恢复过来。我相信奇迹，我真的希望有一天我能找到丢失的比特币。收集到的比特币将用来解决我目前的问题，并努力恢复对丢失的比特币的访问。\n我现在什么都没有，所以我请求帮助。菠萝基金代表了我持有的大部分加密货币，最近我用笔记本电脑丢失了剩下的比特币。\n广告从来就不是基金会的意义所在，我也不想要名气。我是一个简单的人，在我的生活中我非常谦虚，没有人知道我在比特币或菠萝基金的储蓄，只有我的家人，他们总是支持我的所有努力。\n请随时给此域中的联系人发送电子邮件，我会回复您的！！Contact@pineapplefund.me。\n我非常喜欢菠萝。你知道菠萝含有很高的菠萝素吗？菠萝素被证明是消炎、舒缓和消化的。\n请随时给此域中的联系人发送电子邮件，我会回复您的！", "note_en": "About PineappleFund.Me  It&#39;s been over 2 years since my mission and the end of the charity project pineapplefund.org, where I donated most of my Bitcoin.\n     Briefly about my situation, now my family and I are in quite a difficult situation! I lost access to a laptop with a lot of information that was part of my life, as well as access to a cold wallet with more than 2000 bitcoins! These were my last savings at Bitcoin.\n  It just so happens that now I have to start my whole life again, and I have a long and hard way to go. I really hope that I can get access to my cold wallet.\n  I need about 25 BTC to solve my problems and develop further, it&#39;s only almost 0.05% of the amount I donated from the Pineapple Fund.\n  I never thought that I would ever have to ask for help because I had a fortune, but there are different situations in life, and today I want to ask everyone who cares about my activities and everyone who has received help from me.  Friends, I have been kind to you and I really hope that you will answer me the same and help me in my difficult situation. I believe in the boomerang effect. Do not remain indifferent!\n  I believe in miracles and kindness, because lately I have been helping to believe in miracles and to do good for many people around the world!\n    Pineapple Fund was an experiment in philanthropy with cryptocurrency wealth. What happens when your &#39;play-money&#39; becomes a treasure chest, and you&#39;re past the satiety point of money?\n  I decided to donate the majority of my cryptocurrency to charities around the world, with an open application process and funding charities big and small. I focused on causes I believe in, or causes I know will work from my experiences.\n  Timed with the 2017 crypto bubble, 5104 BTC was turned into $55 million for charities. I&#39;m happy and proud of the impact that will come, mostly thanks to the amazing charities and the dedicated people behind them.\n  I&#39;m going to remain anonymous, because the point of the Pineapple Fund is not me. I consider this project a success. If you&#39;re ever blessed with crypto fortune, consider supporting what you aspire our world to be :)\n  &#34;On a larger scale, the Pineapple Fund created a more mysterious form of cryptocurrency philanthropy.\n  The organization was started in December by an anonymous donor who goes by the nickname “Pine” and claims to be among the 250 largest holders of Bitcoin in the world. The fund aims to give away $86 million worth of Bitcoin, and has already given $20 million worth of the currency to 13 organizations, including million-dollar donations to the Water Project, which provides clean water to people in sub-Saharan Africa, and the Electronic Frontier Foundation, a digital rights watchdog.\n  (These donations can be verified thanks to Bitcoin’s digital ledger system, which records every transaction in a public database.)\n  Whoever Pine is, he or she seems to have found a way to convert Bitcoin into something actually useful.\n   Somewhere in the first days of bitcoin&#39;s existence I saw a promise of decentralized money and decided to buy/sell with magic internet tokens. Expectations of crushing income from bitcoins over the years led to much more money than I could spend at that moment, and I donated most of my bitcoins, and just recently under unforeseen circumstances I lost all my other bitcoins along with my laptop.\n   I used to donate most of my money to charity. For your information, the Pineapple Fund was bigger than the whole market bitcoin hat when I came in, and it was one of the richest 250 bitcoin addresses that day.\n At the time, I didn&#39;t think I could end up in this situation.  Now I&#39;m working and trying to recover from the shock. I believe in miracles and I really hope that someday I will be able to access the lost bitcoins. The collected bitcoins will be used to solve my current problems and also to work on restoring access to the lost bitcoins.\n  I don&#39;t have anything right now, so I&#39;m asking for help. The Pineapple Fund represented most of my crypto-currency holdings, and recently I lost the remaining bitcoins with my laptop.\n   Advertising has never been the meaning of the foundation, and I don&#39;t want fame. I am a simple person and in my life I am very modest, nobody knew about my savings at bitcoin or Pineapple Fund, only my family, they always supported me in all my endeavors.\n   Feel free to email the contact in this domain and I will get back to you!  contact@pineapplefund.me\n    I&#39;m very fond of pineapples. Did you know that pineapples contain high levels of bromelin, which proved to be anti-inflammatory, relaxing and digestive?!\n   Feel free to email the contact in this domain and I will get back to you!", "posttime": "2020-10-21 13:08:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,比特币,基金,fund,菠萝", "title": "菠萝基金失去所有比特币破产", "title_en": "Pineapple Fund lost all bitcoins and went bankrupt", "transed": 1, "url": "https://www.pineapplefund.me/", "via": "", "real_tags": ["apple", "比特币", "基金", "fund", "菠萝"]}, {"category": "", "categoryclass": "", "imagename": "99dcc9556fea6f1408d586d4e82b65e0.jpg", "infoid": 1030254, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(PhysOrg.com)--如果你漫步到博物馆的地震仪前，除非你足够幸运地在地震发生时正好在那里，否则你所看到的只是一个正在记录的小摆动信号。这些摆动中的东西被地震学家称为噪音，因为信号总是在那里，并且起源于大地震引起的震动之间地球的正常活动。\n直到最近，很少有研究人员注意到这些明显令人厌烦的信号--人们认为，分析它们就像批评电梯音乐一样。\n但现在，圣路易斯华盛顿大学(Washington University)的一名地震学家和他的顾问，在三年前一个偶然、幽默的发现的基础上，发现了非洲几内亚湾邦尼湾比奥科岛附近的一个地震噪声源。尽管看起来不太可能，但这个震源的强度随着南大西洋风暴活动的强度而不同。在最大的风暴期间，来自邦尼湾的地震波被世界各地的宽带地震仪记录下来。\n华盛顿大学博士生加勒特·欧拉(Garrett Euler)使用一种名为交叉相关的数学技术，分析了喀麦隆、南非、埃塞俄比亚和坦桑尼亚的四个宽带地震仪阵列，发现以28秒和26秒的周期振荡的地震噪声起源于邦尼湾，并随着南大西洋风暴活动的强度而变化。在最大的风暴期间，来自邦尼湾的地震波被世界各地的宽带地震仪记录下来。\n虽然造成非洲附近地震噪音的确切机制尚不清楚，但欧拉推测，南大西洋风暴产生的长周期海浪反射出非洲海岸，集中在比奥科岛附近。海浪与浅海底的相互作用将海浪能量转变为穿过固体地球的地震波。噪声源最早是由哥伦比亚大学博士杰克·奥利弗于1962年发现的，但欧拉的工作是第一个准确定位噪声源的人。\n“有人说，一个研究人员的噪音就是另一个研究人员的信号，”欧拉的联合顾问道格拉斯·A·维恩斯博士说，他是华盛顿大学地球与行星科学系的教授兼艺术与放大器科学系主任。“当我们不理解它的时候，我们称之为噪音。当我们这样做的时候，我们称之为信号。在过去，这类数据根本不突出，但就在最近，人们开始关注如何分析它。对于噪音可能揭示的东西，有很多耐人寻味的可能性。“。\n虽然地震噪声分析仍在发展中，但一些地震学家正在对噪声进行建模，以寻找可能揭示全球变暖效应的信号。例如，随着风暴数量的增加，地震噪声可能会有相应的波动。其他人正在考虑使用地震噪音来绘制火山岩浆室的地图。甚至已经有一些非常初步的工作探索地震噪声可能预测地震的可能性。这个想法是，一个区域的波速可能会随着压力的增加而改变。\n今年12月，欧拉在旧金山举行的美国地球物理联盟秋季会议上介绍了他的观察结果。\n欧拉在谈到他最初的数据时说：“我们有一些非常离奇的观察结果，我们仍在努力弄清楚。”“其一是信号的周期比我们预期的要长。它在频率上有多个峰值-它在28秒和26秒之间“嗡嗡”。在与海上风暴相关的特定时间里，它真的、真的很强。\n“另一个观察结果是，信号的位置随频率而移动。28秒周期波段的震源距离26秒震源约300公里，本质上是在喀麦隆山。“。\n互相关将通常记录在两个不同位置的两个地震信号的相似性作为它们之间的时间延迟的函数进行比较-本质上是将一个信号滑过另一个信号，直到它们匹配。相关函数中的峰值对应于两个位置之间的平均地震速度。然而，要互相关联地震噪声，欧拉面临着一个难题，因为地震噪声没有明确的终止。\n他说：“这种噪音是由跨越相当长的地震记录的重叠信号的刺耳声音组成的，这些信号必须进行平均，而这些信息就构成了这个噪声场。”\n欧拉在2007年进入了地震噪声领域，当时他发现喀麦隆32个不同地震台站中的一个台站的噪声出现了持续的尖峰。事实证明，这些钉子相当于喀麦隆狂热的球迷在2006年非洲国家杯(African Cup Of Nations)比赛期间进球或发挥关键作用后，在各个城市欢乐、庆祝的踩踏脚步。\n这是第一次在地震信号中发现由人类产生的广泛的人为噪音。这也是已知的第一个关于“脚震”的报道。\n“当我得到这些数据时，我被难住了，因为在那段时间里没有记录到任何地震，”他说。我们最终将两件事放在一起，认为这是数千名球迷分散在数英里之外的结果，他们对从进球到明星球员的反应，再到最终的胜利做出了不同的反应。所有的情景都有轻微的波动。那是我对地震噪音产生兴趣的开始。从那以后，它成长了很多。“。引用：地震仪噪音包括来自南大西洋风暴的信号，足球比赛(2011年1月17日)的足震信号，从https://phys.org/news/2011-01-seismometer-noise-south-atlantic-storms.html上检索到。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "(PhysOrg.com) -- If you wander up to a seismograph in a museum, unless you are lucky enough to be there right during an earthquake, all you will see is a small wiggly signal being recorded.    What’s inside the wiggles is called noise by seismologists, because the signal is always there and originates from the normal activity of the earth between the jolts caused by large earthquakes.\n  Up until recently, few researchers paid any heed to these apparently boring signals – analyzing them, it was thought, would be like critiquing elevator music.\n  But now a seismologist and his adviser from Washington University in St. Louis, building on a serendipitous, humorous find of three years ago linking   and soccer, have discovered a source of seismic noise in Africa near the island of Bioko in the Bight of Bonny in the Gulf of Guinea. Improbable as it may seem the strength of this source varies with the intensity of storm activity in the Southern Atlantic Ocean. During the largest storms, seismic waves from the Bight of Bonny are recorded by broadband seismometers all around the world.\n   Washington University doctoral candidate Garrett Euler, using a mathematical technique called cross correlation, analyzed four arrays of broadband seismometers in Cameroon, South Africa, Ethiopia and Tanzania and found that seismic noise oscillating at 28 and 26 second periods originates in the Bight of Bonny and varies with the intensity of storm activity in the Southern Atlantic Ocean. During the largest storms, seismic waves from the Bight of Bonny are recorded by broadband seismometers all around the world.\n  Although the exact mechanism causing seismic noise near Africa is unknown, Euler speculates that long-period ocean waves from storms in the Southern Atlantic Ocean reflect off the coast of Africa and focus near the island of Bioko. The interaction of the waves with the shallow seafloor changes the ocean wave energy into seismic waves that travel through solid earth. The noise source was first discovered by Jack Oliver, PhD, of Columbia University in 1962, but Euler’s work is the first to accurately locate the source.\n  “It’s said that one researcher’s noise is another’s signal,” says Euler’s co-advisor Douglas A. Wiens, PhD, professor and chair of Washington University’s earth and planetary sciences department in Arts &amp; Sciences. “When we don’t understand it, we call it noise. When we do, we call it a signal. In the past, this kind of data didn’t stick out at all, but just recently people are coming to grips with how to analyze it. There are intriguing possibilities for what noise might reveal.”\n    Although seismic noise analysis is still developing, some seismologists are modeling noise to look for a signature that could reveal a global warming effect. For instance, as the number of storms increase, perhaps there are corresponding fluctuations in seismic noise. Others are considering using seismic noise to map volcanic magma chambers. There has even been some very preliminary work exploring the possibility that seismic noise might predict earthquakes. The idea is that the wave speed of a region might change as stress builds up before an  .\n  Euler gave a presentation on his observations at the fall meeting of the American Geophysical Union in San Francisco this December.\n  “We have some very bizarre observations that we’re still trying to figure out,” says Euler, of his initial data. “One is the signal is at longer periods than we’d expected. It has multiple peaks in frequency — it ‘hums’ at 28 seconds, as well as 26 seconds. It’s really, really strong during some particular times that correlate with storms at sea.\n  “Another observation is that the signal shifts its location with frequency. The source of the 28-second period band is about 300 kilometers from the 26-second source, which is essentially at Mount Cameroon.”\n  Cross correlation compares the similarity of two seismic signals, usually recorded at two different locations, as a function of the time lag between them — essentially sliding one signal past the other until they match up. Peaks in the correlation function correspond to the average seismic velocity between the two locations. To cross correlate seismic noise, though, Euler faces a conundrum because there is no well-defined termination of seismic noise.\n  “This noise is made up of a cacophony of overlapping signals across quite long seismic records that have to be averaged, and that information comprises this noise field,” he says.\n  Euler wandered into the field of seismic noise in 2007 when he found consistent spikes in noise from one of 32 different seismic stations in Cameroon. The spikes turned out to correspond with joyous, celebratory foot-stomping of Cameroon’s avid soccer fans at various cities after goals were scored or key plays made during the African Cup of Nations games in 2006.\n  This was the first time widespread anthropogenic noise — created by humans — had been found in seismic signals. And it was the first known reporting of “footquakes.”\n  “When I got that data, I was stumped, because there hadn’t been any earthquakes recorded during that time,” he says. &#34;We finally put two and two together and saw this as the result of thousands of fans spread out over many miles, reacting to things ranging from a goal, to the reaction of a star player, to the ultimate, a win. There were slight fluctuations in all the scenarios. That was the start of my interest in seismic noise. It’s grown a lot since.”           Citation: Seismometer noise includes signals from South Atlantic storms, &#39;footquakes&#39; from soccer matches (2011, January 17) retrieved 21 October 2020 from https://phys.org/news/2011-01-seismometer-noise-south-atlantic-storms.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-10-21 13:08:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "来自,noise,信号", "title": "地震仪噪音包括来自风暴的信号，来自足球的“脚震”(2011)", "title_en": "Seismometer noise includes signals from storms, 'footquakes' from soccer (2011)", "transed": 1, "url": "https://phys.org/news/2011-01-seismometer-noise-south-atlantic-storms.html", "via": "", "real_tags": ["来自", "noise", "信号"]}]