[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1069438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN 订阅者为您带来的这篇文章 LWN.net 的订阅者使这篇文章——以及围绕它的一切——成为可能。如果您欣赏我们的内容，请购买订阅并让下一组文章成为可能。 7 月 4 日，Rust for Linux 项目发布了另一个版本的补丁集，增加了对内核语言的支持。该项目似乎已经准备好考虑进入主线。不过，也许一个更大的问题仍然存在：内核开发社区是否为 Rust 做好了准备？那部分似乎仍然悬而未决。 Miguel Ojeda 已被聘用全职从事该项目，他发布了补丁集；在求职信中，他列出了自 4 月份发布 RFC 补丁集以来的一些更改和更新。特别是，在失败时调用 panic!() 的分配已被替换。已经为内核项目创建了 alloc crate 的修改版本，尽管计划是让更改进入上游项目，以便最终可以删除自定义版本。顺便说一句，添加修改后的 crate 的补丁显然太大了绝杀档案，尽管它确实出现在 LWN 档案中。他说，在内核设施的 Rust 抽象方面取得了更多进展，包括“红黑树、引用计数对象、文件描述符创建、任务、文件、io 向量……”，以及对驱动程序支持的补充。除此之外，Android Binder 进程间通信机制的 Rust 驱动程序具有更多功能，并且正在开发用于某些 Raspberry Pi 型号上可用的硬件随机数生成器的驱动程序。但是缺乏“真正的”车手是 4 月份的症结之一，这次又被提出来了。 Christoph Hellwig 表示，如果这是发布的意图，他强烈反对合并代码。在求职信中，Ojeda 说补丁集正在添加到 linux-next，并且他确认正在提交合并。 Hellwig 希望看到 Rust 在被包含之前证明自己：[...] 首先证明它确实有用。有用的将是像 nvme 这样的真实驱动程序或 USB 主机控制器驱动程序，它实际上可以工作并显示出优于现有驱动程序的优势。在它显示出如此有用之前，它只会拖累其他人。 Ojeda 指出 Binder 驱动程序是一个“非平凡的模块”，“已经在工作”，但承认真正的硬件驱动程序是一个重要的（并且目前还没有）。但是，求职信列出了一些对该项目感兴趣或已经参与其中的组织，Ojeda 认为这也有助于证明该项目：从某种意义上说，我们已经开始让下游用户和其他感兴趣的用户产生兴趣。各方表示支持。然而，其他人则更加保守，只有在我们处于主线时才会开始投资它，即如果已经做出是否使用 Rust 的决定。但是，Greg Kroah-Hartman 说，由于一些不同的原因，Binder“驱动程序”并不是一个很好的例子。它缺少一个相当大的功能（binderfs），但它也几乎没有帮助展示 Rust 将如何与内核的其余部分相适应。和以前一样，他强烈建议做一些有助于解决内核开发人员对 Rust 的一些问题的工作：并不是说它没有用途，而是 Binder 和内核其余部分之间的交互非常小且具体. 几乎没有人会再写的东西。请在一个真正的驱动程序上工作，以帮助证明或反驳这一切都能正常工作。有很多悬而未决的问题需要解决，当你做这样的事情时，你会遇到这些问题。\nRust 证明自己的主题也出现在 ksummit-discuss 邮件列表上的一个线程中。 6 月底，Ojeda 在今年的 Linux PlumbersConference 上提出将 Rust for Linux 作为 Kernel Summit 赛道的技术主题。 7 月 6 日，Linus Walleij 回复，同意这是一个应该讨论的话题。他指出，内核开发人员已经需要关注很多语言（例如 C、汇编、Make、Bash、Perl、Python 等），所以他心中的一个问题是 Rust 将带来什么值得添加到列表中。该消息引发了关于 Rust 如何适合以及实验将走向何方的讨论。内核开发人员显然有些担心必须了解 Rust 才能继续开发内核。Ojeda 试图在一定程度上减轻这些担忧，但承认大多数内核开发人员最终需要了解该语言。 Ojeda 说，目前，该项目的目的是与希望向其子系统添加 Rust API 的维护者合作。这将在内核中引导对 Rust 的支持，并有助于缓解 Leon Romanovsky、JamesBottomley 和其他。 Romanovsky 担心在具有两种语言的驱动程序的系统中进行重构，尤其是跨子系统重构。 Bottomley 建议 Rust 代码的审阅者会更少，所以 bug 更容易溜进来：由于我们现在的大多数 CVE 类型问题通常是编程错误，缺乏审阅可能会导致编程错误类型错误的增加，这些错误不是被禁止的更安全的内存模型。在短期内，这些都是需要解决的问题，但目标是让 Rust 知识在内核开发人员中得到更广泛的传播。正如 Ojeda 所说：毕竟，如果我们要将 Rust 作为内核中的第二语言，我们应该尝试在合理的时间范围内让尽可能多的人加入，至少在某种程度上是这样。正如 Laurent Pinchart 指出的那样，这是一个重要的观点，需要在讨论中更明确地强调：[...] 在内核中采用 Rust 作为第二语言不仅仅是一个影响有限的技术决定，也是一个过程决定这将为大多数内核开发人员学习 Rust 创造条件。这是否应该和将会发生是我们正在辩论的问题，但无论结果如何，正确地表达问题并广泛地了解其含义是很重要的。当然，还有很多技术障碍需要清除。这些领域之一是 Linux 驱动程序模型和随之而来的对象生命周期处理。 Roland Dreier 建议像 devres（即管理设备资源）这样的接口可以避免很多他在驱动程序中看到的关于生命周期管理的问题，特别是错误路径，但它没有被广泛采用。 Walleij 不同意它没有被广泛使用，但完全不确定 Rust 开关是否更好：我认为这是一个巨大的成功，人们只需要学习更多。但是，如果学习更好行为的更简单的方法是洗牌整个棋盘并用 Rust 编写的驱动程序替换它，我不知道？也许？对于 Kroah-Hartman 来说，在 Rust 中看到内核的真实驱动程序将有助于弄清楚这些问题将如何在语言中解决。有一些难题需要解决：这将是“有趣的” Rust 工作的一部分，它必须弄清楚如何将我们当前在驱动程序模型中拥有的引用计数对象映射到 Rust 控制的对象并保持一切正确同步。对于普通代码，内存被分配给一个特定对象（结构设备）但还被另一个对象（cdev）引用的事实。像这样的 devm_* 用户似乎没有意识到这里发生了两个单独的对象生命周期，因为交互有时很微妙。我很期待 Rust 实现将如何处理所有这些，因为我不知道。\n还有一个问题是所有这些导致了哪里。 Walleij 想知道内核（即驱动程序）的“叶节点”是否实际上是从展示语言优势的角度出发的最佳位置。他还在 4 月份的长篇消息中询问了这一点。他的部分问题是决定从驱动程序开始是否是出于其他原因：如果首先做设备驱动程序的整个基本原理是战略性的，不一定会给该设备驱动程序子系统带来任何好处，而是作为试验场和试验场，那么该战略需要明确并被每个人理解。因此，虽然我们理解 Rust 作为所有这些 $UPSIDES 首先做设备驱动程序纯粹是战略性的，对吗？我认为也提到了如果它没有解决就可以撤回整个事情的能力？他还询问了用 Rust 编写整个子系统的问题。这将需要将 Rust API 暴露给内核中其他地方的 C 代码。它也有可能允许在内核中向越来越多的 Rust 演进：如果我们想在 Rust 中*编写*一个子系统，那么它当然会以另一种方式：Rust 需要将 API 暴露给 C。我假设宏伟的愿景是在那之后，Rust 将一次吃掉 Linux。如果它证明比 C 更好，那就是。 Ojeda 说，虽然可以将 Rust API 暴露给系统的 C 部分，但他不建议这样做。问题是 C 调用者失去了 Rust 带来的很多好处：一般来说，我会避免将 Rust 子系统暴露给 C。当然，这是可能的，并且它在*实现*中为您提供了 Rust 的优势子系统。然而，由于必须公开一个 C API，你将失去更丰富的类型系统的大部分优势，以及 Rust 作为一种语言为子系统的消费者带来的保证。类似地，约翰内斯·伯格询问是否用 Rust 替换子系统的部分，但将驱动程序留在 C 中——有效地与现有计划相反。 Ojeda 再次表示这是可能的，但告诫不要失去 Rust 功能和保证。此外，有些架构此时没有 Rustcompiler 可用，因此现在考虑基于 Rust 的子系统可能还为时过早。该项目的最终目标并不完全清楚。如果所有的 Linux 驱动程序都是用 Rust 编写的，那么仍然会有很多重要的部分运行不安全的 C；如果 Rust 同时证明自己，下一步是否会取代那些？但在这种情况下，“证明自己”的实际含义也不清楚。学习一门具有所有不同行为、怪癖和特质的新语言，对于已经在维护现有内核代码中处理相当多的复杂性的开发人员来说是一个非常大的要求。更不用说在已有功能的基础上提供新功能的额外复杂性。两个线程（和其他地方）的评论者似乎相当普遍的怀疑态度可能源于这种学习负担。将 Rust 添加到内核需要大量工作，对于很多不同的人来说，除了承诺之外，没有明确和明显的好处，只有用 Rust 编写的整个内核才能真正完全实现。 幸运的是，该项目可以提供一些明确的“胜利” “在早期，这清楚地展示了该语言的潜力和在像内核这样的大型复杂代码库上增量使用的能力。没有它，项目可能很难在“生锈”内核的目标上取得很大进展。\n（登录发表评论）&gt; Ojeda 试图在一定程度上减轻这些恐惧，但确实承认大多数内核开发人员最终需要了解该语言。我认为这是指这封电子邮件：https://lwn.net/ml/ksummit-discuss/CANiq72=LrxpE_2WmdDdb5...基本上它似乎是在说如果项目成功，最终结果应该是，如果你想要更改具有 Rust 绑定的 API，那么您需要了解这些 Rust 绑定，以便您也可以调整它们。这很有意义，如果您更改破坏其他内核代码的内核代码，那么您需要修复其他代码。但它确实清楚地说明了这个项目的范围以及承诺这个项目的决定有多大。为什么在 LWN 文章中如此偏向于谈论 Rust？我的意思是，这个补丁集可能（希望）永远不会合并，它的 lwn 文章与发布的版本一样多。在这里发现了多少重要的补丁集到 v2+（并且有机会登陆）？这是一个关于内核项目未来的基本决定；它似乎值得多看一看。借调。有史以来最重要的变化之一。请继续在更多报道而不是更少方面犯错。你不喜欢的偏见是我喜欢的偏见。有些人想要改善 Linux 环境。他们的努力可能会被拒绝，因为他们最终不符合合理的进入标准。这无关紧要。相关的是他们有一个与大多数其他改进工作完全不同的目标，并且相信它足以花费资源（时间、金钱等）。如果他们失败了，那么这种失败将影响未来的努力，包括 Rust 以外的语言。很好的答案，谢谢！最重要的是，Rust 可能会给 Linux 内核带来新的开发人员，否则他们不会接触它。 Rust 是一种适销对路的编程语言，C 是传统语言。从任何现代编程语言切换到 C 感觉就像进入了雷区。从用户空间到内核开发时更是如此。\n&gt; 从任何现代编程语言切换到 C 感觉就像进入了雷区。从用户空间到内核开发时更是如此。确切地。 C有很多footguns。 C++ 有更多的脚步声。你可以用 C++ 编写漂亮、干净、简洁的代码……但你无法避免它们——尤其是当编译器开发人员每年向语言中添加越来越多的代码时。 Rust 不会试图从语言中删除footguns（实际上，当您对内核进行编程时这基本上是不可能的），而是尝试确保它们中的每一个都被标记为不安全。这就是为什么从理论上讲，驱动程序听起来是最有希望移植到 Rust 的原因：它们通常是由硬件人员编写的，他们没有判断所有这些步枪的经验。并且，希望 API 可以提供给他们，允许他们在默认的、安全的、Rust 中编写驱动程序。但是如果你将内核的核心重写为 Rust ......收益会小得多：你越接近核心数据结构的黑暗魔法，就会有更多的内在脚步。这也是为什么为真正的硬件实现真正的驱动程序是一个重要的里程碑：某些讨厌的脚步声存在于内核中，因为它们是与硬件交互的固有特性，很高兴看到甚至移植一个驱动程序需要多大的胶水代码。如果胶水代码比实际的驱动程序代码多，这很好（它最终会与所有驱动程序共享，所以这没什么大不了的），但是如果驱动程序本身充满了许多不安全的块，那么整个练习就会变成有点无意义。 Rust 并没有试图彻底删除footguns 是不正确的。一些 C++ 步炮，尤其是继承自或建立在 C 兼容性基础上的 C++ 步炮（即使它们不一定是 C 中的步炮）是被遗忘的过去的遗物。例如，为什么允许“char” _either_ 有符号或无符号并且由实现来选择？因为当时的硬件千差万别。快进到 21 世纪，没有人希望他们在他们使用的 CPU 上拥有更快的 Rust i8 和 u8。那不是一回事。所以，如果你想要 i8 你就要求 i8，如果你想要 u8 你就要求 u8，因此你不能因为得到一种不是你想象的类型而大吃一惊。同样，为什么有符号整数在溢出时有未定义的行为？古代硬件以多种方式表示负数。因此，为了最大的兼容性，C 无法指定会发生什么。也许应该说平台定义，现在太晚了。很好，但是今天可用的每个平台都有二进制补码算法，所以这没有用。 Rust 可以预先说明这一点。调试造成恐慌！如果您溢出，如果错误一直存在到 Production ，您将获得二进制补码算法并祝您好运。如果您明确_想要_包装或饱和算术（后者在音频中尤其有意义），您可以在 Rust 中请求它们，无论是用于一个操作（例如饱和加法）还是作为变量的类型，您都会得到您想要的要求，没有恐慌，编译器为这种情况生成了良好的优化代码。但是，即使没有消除溢出的“未定义行为”的脚步。有时编译器变得更好，我们不再需要说明可以推断出什么。 C 和 C++ 都有一对一元增量运算符。他们是步兵。 b++ 和 ++b 都比 b += 1 的输入要少一些，但是它们将很多出错的机会挤进了这么少的字符中。为什么是其中两个？因为 C 和 C++ 使这些一元运算符具有结果以及它们的赋值效果，即使您很少需要它，并且结果是不同的。在 Rust 中，一元增量不存在，其他赋值运算符没有结果（严格来说，它们的结果是空元组），如果你的意思是 a = b; b+= 1 你可以这样写，如果你的意思是 b+= 1; a = b 你可以这样写。别担心，现代编译器很聪明，你不会因为输入稍微多一点而得到更慢的代码。有时同时明确问题范围。 Rust 缺少 C 和 C++ 的“volatile”关键字，我之前曾详细讨论过。该关键字可能是错误的。它在 Unix 中的用途在 Rust 中作为一组名为 volatile_read 和 volatile_write 的编译器内部函数存在（一组因为它们有不同的大小，事实证明你的硬件知道你是写了一个 32 位整数还是两个 16 位整数整数到内存），并且它在 C 或 C++ 中被错误地滥用的许多事情今天在这些语言中被明确禁止，因为它们无法工作。所以在实践中，Rust 的 volatile_read/ volatile_write 和 C++ volatile 关键字之间的差距只是你通过没有那种类型限定符而避免的。除了与 unsafe 关键字本身相关的事情（例如调用不安全的函数），我相信 Rust 只允许你在不安全的代码中做 3 件事，而你在安全代码中是不允许做的。您可以取消引用原始指针。您可以访问联合中的字段。你可以改变静态。就这样。这些确实是潜在的枪支（谁知道原始指针指向什么，如果有的话；也许联合中的那个字段不是其中包含有效数据的字段；嘿，另一个线程正在读取该静态变量，似乎在更改它）像一个坏主意）但这是一个比你预期的要小得多的集合。 &gt; 也许应该说平台定义，现在太晚了。为什么为时已晚？正确的程序将保持正确，而错误的程序（他们的作者认为是正确的！）将变得真正正确。\n事实上，这正是应该发生的事情：未定义的行为使实现者许可不捕获某些难以诊断的程序错误。它还确定了可能符合语言扩展的领域：实现者可以通过提供官方未定义行为的定义来扩充语言（强调我的）。签名溢出被声明为“未定义”没有......", "note_en": "This article brought to you by LWN subscribers Subscribers to LWN.net made this article — and everything that surrounds it — possible. If you appreciate our content, please  buy a subscription and make the next set of articles possible.\n   On July 4, the  Rust for Linux project postedanother version of its patch set adding support for the language to thekernel. It would seem that the project feels that it is ready to be considered formerging into the mainline. Perhaps a bigger question lingers, though: is the kerneldevelopment community ready for Rust? That part still seems to be up in the air.\n  Miguel Ojeda, who has been hired to  work onthe project full-time, posted the patch set; in the cover letter, he listed anumber of changes and updates since the  RFC patchset was  posted back in April. Inparticular, the allocations that would call  panic!() when theyfailed have beenreplaced. A modified version of the   alloc crate has been created for thekernel project, though the plan is for the changes to work their wayinto the upstream project so that the customized version can eventually be dropped.Incidentally, the patch adding the modified crate was  apparentlytoo large for the lore archive, though it does  showup in the LWN archive.\n There is more progress on Rust abstractions for kernel facilities,including &#34; red-black trees, reference-counted objects, filedescriptor creation, tasks, files, io vectors...&#34;, he said, as wellas additions for driver support. Beyond that, theRust driver for the  Android Binder interprocesscommunication mechanism has more features and there is ongoing work on a driver forthe hardware random-number generator available on some Raspberry Pi models.\n But the lack of a &#34;real&#34; driver was one of the sticking points back inApril, and it was raised again this time. Christoph Hellwig  said that he wasstrongly against merging the code if that was the intent of the posting.In the cover letter, Ojeda said that the patch set was being added to linux-next, andhe  confirmedthat it is being submitted for merging. Hellwig wants to see Rust proveitself before being included: [...] prove it actually is useful first. Whereuseful would be a real-life driver like say nvme or a usb hostcontroller driver that actually works and shows benefits over theexisting one. Until it shows such usefulness it will just drageveryone else down.\n Ojeda pointed at the Binder driver as a &#34; non-trivial module&#34;that &#34; is already working&#34;, but acknowledged that a realhardware driver is an important (and, as yet, missing) piece. But the coverletter listed a number of organizations that are interested in or involved withthe project already, and Ojeda believes that is also something that ishelping to prove the project: It is &#34;proven&#34; in the sense we are already starting to get usersdownstream and other interested parties have shown support. However, others are more conservative and will only start investinginto it if we are in mainline, i.e. if the decision of having Rust ornot is already taken.\n But the Binder &#34;driver&#34; is not really a good example to use for a few differentreasons, Greg Kroah-Hartman  said. It ismissing a fairly large piece of functionality (binderfs) for one thing, but it also doeslittle to help show how Rust will fit in with the rest of the kernel. Asbefore, he strongly recommended working on something that would help clearup some of the questions that kernel developers have about Rust: Not to say that it doesn&#39;t have its usages, but the interactions betweenbinder and the rest of the kernel are very small and specific.Something that almost no one else will ever write again. Please work on a real driver to help prove, or disprove, that this allis going to be able to work properly. There are huge unansweredquestions that need to be resolved that you will run into when you dosuch a thing.\n  The theme of Rust proving itself was also present in a thread on the ksummit-discuss mailinglist. At the end of June, Ojeda  proposedRust for Linux as a technical topic for the Kernel Summit track at thisyear&#39;s  Linux PlumbersConference. On July 6, Linus Walleij  replied, agreeing that it was a topic that should be discussed. He noted that thereare already quite a few languages that kernel developers need to beup on (e.g. C, assembly, Make, Bash, Perl, Python, ...), so a question inhis mind is what Rust will bring to the table that makes it worth adding tothe list.\n That message started the ball rolling on a discussion of how Rust fits—andwhere the experiment leads. There is clearly some concern among kerneldevelopers about having to know Rust to continue working on the kernel.Ojeda tried to allay those fears to a certain extent, but did acknowledgethat most kernel developers would eventually need to understand thelanguage. For now, the intent is for the project to work withmaintainers that want to add a Rust API to their subsystem, Ojeda  said.That will bootstrap support for Rust within the kernel and will help alleviate some ofthe concerns expressed by   Leon Romanovsky, JamesBottomley, and others.\n Romanovsky was worried about refactoring, especially cross-subsystemrefactoring, in a system with drivers in both languages. Bottomleysuggested that there would be fewer reviewers for the Rust code, so bugscould more easily slip in: Since most of our CVE type problems are usuallyprogramming mistakes nowadays, the lack of review could contribute toan increase in programming fault type bugs which aren&#39;t forbidden bythe safer memory model.\n In the near term, those are problems that will need to be dealt with, butthe goal is to get to a point where Rust knowledge is more widespread amongkernel developers. As Ojeda  putit: After all, if we are going to have Rust as a second language in thekernel, we should try to have as many people on board as possible, atleast to some degree, within some reasonable time frame.\n As Laurent Pinchart  pointedout, that is an important point and one that needs to be more clearlyhighlighted in the discussion: [...] adopting Rust asa second language in the kernel isn&#39;t just a technical decision withlimited impact, but also a process decision that will create arequirement for most kernel developers to learn Rust. Whether thatshould and will happen is what we&#39;re debating, but regardless of theoutcome, it&#39;s important to phrase the question correctly, with a broadview of the implications.\n There are, of course, plenty of technical hurdles that need to be clearedas well. One of those areas is the Linux driver model and theobject-lifetime handling that goes along with it. Roland Dreier  suggestedthat interfaces like  devres(i.e. managed device resources) could have avoided a lot of problems thathe has seen in drivers regarding lifetime management, and error paths in particular, butthat it has not been adopted widely. Walleij  disagreedthat it hasn&#39;t been widely used, but is not at all sure that a Rust switch is better: I think it&#39;s a formidable success, people just need to learn to do it more. But if an easier path to learn better behaviours is to shuffle the wholechessboard and replace it with drivers written in Rust, I don&#39;t know?Maybe?\n For Kroah-Hartman, seeing real drivers in Rust for the kernel would help clear up how these problems are going to be solved in the language.There are some difficult problems that will need to be tackled: This is going to be the &#34;interesting&#34; part of the rust work, where ithas to figure out how to map the reference counted objects that wecurrently have in the driver model across to rust-controlled objects andkeep everything in sync properly. For the normal code, the fact that the memory was assigned to onespecific object (the struct device) but yet referenced from anotherobject (the cdev). devm_* users like this do not seem to realize thereare two separate object lifecycles happening here as the interactionsare subtle at times. I am looking forward to how the rust implementation is going to handleall of this as I have no idea.\n There is also the question of where all of this leads. Walleij  wonderedwhether the &#34;leaf nodes&#34; of the kernel (i.e. drivers) are actually the best place to startfrom the perspective of showing the benefits of the language. He also  askedabout that in a lengthy message back in April. Part of his question iswhether thedecision to start with drivers was made for other reasons: If the whole rationale with doing device drivers first is strategic,not necessarily bringing any benefits to that device driversubsystem but rather serving as a testing ground and guineapig, then that strategy needs to be explicit and understoodby everyone. So while we understand that Rust asall these $UPSIDES doing device drivers first is purelystrategic, correct? I think the ability to back out the wholething if it wasn&#39;t working out was mentioned too?\n He also asked about writing whole subsystems in Rust. That would entail exposingRust APIs to C code elsewhere in the kernel. It would also potentially allowan evolution toward more and more Rust in the kernel: If we want to *write* a subsystem in Rust then of course it willgo the other way: Rust need to expose APIs to C. And I assumethe grand vision is that after that Rust will eat Linux, one pieceat a time. If it proves better than C, that is.\n Ojeda  saidthat while it is possible to expose Rust APIs to the C part of the system,he does not recommend it. The problem is that the C callers lose much ofthe benefit that Rust brings to the table: In general, I would avoid exposing Rust subsystems to C. It is possible, of course, and it gives you the advantages of Rust inthe *implementation* of the subsystem. However, by having to expose aC API, you would be losing most of the advantages of the richer typesystem, plus the guarantees that Rust bring as a language for theconsumers of the subsystem.\n In a similar vein, Johannes Berg  askedabout replacing parts of a subsystem with Rust, but leaving the drivers inC—the reverse of the existing plan, effectively. Once again, Ojeda  saidthat its possible, but cautioned about losing Rust features andguarantees. In addition, there are architectures where there is no Rustcompiler available at this point, so it may be premature to be looking atRust-based subsystems.\n  The project&#39;s eventual goal is not entirely clear. If all of the Linux drivers were written in Rust, there would still be lotsof big important pieces that are running unsafe C; is the next step toreplace those if Rust proves itself in the meantime? But it is alsounclear what &#34;proves itself&#34; actually means in this context.\n Learning a new language, with all of its different behaviors,quirks, and idiosyncrasies,is a pretty big ask for developers who are already juggling a fair amountof complexity in maintaining the existing kernel code. Not to mention the addedcomplexity of providing new functionality on top of what&#39;s already there. Theskepticism that seems fairly prevalent from commenters in both threads (andelsewhere) likely stems from that learning burden.\n Adding Rust to the kernel requires a lot of work, for a lot ofdifferent people, without a clear and obvious benefit beyond promises thatcan only truly be fully fulfilled with a whole kernel written in Rust.With luck, the project can provide some clear &#34;wins&#34; in the early goingthat clearly demonstrate both the potential of the language and an abilityto be utilized incrementally on a large and complex code base like thekernel. Without that, it may be difficult for the project to progress veryfar in the goal of &#34;rustifying&#34; the kernel.\n     ( Log in to post comments)\n  &gt; Ojeda tried to allay those fears to a certain extent, but did acknowledge that most kernel developers would eventually need to understand the language.  I think this is referring to this email:  https://lwn.net/ml/ksummit-discuss/CANiq72=LrxpE_2WmdDdb5...  Basically it seems to be saying that if the project is a success the end result should be, if you want to change APIs which have Rust bindings, then you need to understand those Rust bindings so you can adjust them as well.  Which makes a lot of sense, if you change kernel code which breaks other kernel code, then you need to fix that other code. But it does make clear the scope of this project and how big a decision it is to commit to this.\n  Why such a bia in LWN articles to talk about rust? I mean, this patchset, that will probably (hopefuly) never get merged, has as many lwn articles as versions published. How many important patchsets got to a v2+ (and with a chance to land) were uncovered here?\n This is a fundamental decision about the future of the kernel project; it seems worthy of more than one detailed look.\n Seconded. One of the most important changes ever considered. Please continue to err on the side of more coverage rather than less.\n  The bias that you do not like is a bias that I like.  There are people that want to improve the Linux environment. Their effort might be rejected because they end up not meeting the reasonable entry criteria. And that is not relevant.  What is relevant is that they have a goal that is quite different to most other improvement efforts, and believe in it enough to spend resources (time, money, etc). And if they fail, then that failure will inform future efforts, including languages other than Rust.\n Excellent answer, thank you! On top of that Rust may bring new developers to Linux kernel who would not touch it otherwise. Rust is a marketable programming language, C is legacy. Switching from any modern programming language to C feels like going to a minefield. Even more so when going from userspace to kernel development.\n &gt; Switching from any modern programming language to C feels like going to a minefield. Even more so when going from userspace to kernel development. Exactly. C have lots of footguns. C++ have  even more footguns. You can write nice, clean, concise code in C++… but you can&#39;t avoid them — especially when compiler developers add more and more of them to the language each year.\n Rust doesn&#39;t try to remove footguns from the language (indeed, when you are programming the kernel that&#39;s basically impossible) but tries to make sure each and every one of them is marked as  unsafe.\n That&#39;s why driver sounds, in theory, most promising thing to port to Rust: they are often written by hardware guys, who are not experienced with judging all these footguns. And, also, hopefully, API can be presented to them which allows them to write drivers in default, safe, Rust.\n  But if you rewrite core of kernel into Rust… gains would be much smaller: the closer to the dark magic of core data structures you come the more  inherent footguns would be there.\n And that&#39;s also why implementing real driver for real hardware is important milestone: certain nasty footguns live in kernel because they are inherent to interaction with hardware and it would be nice to see how large the glue code would be needed to even port one driver. It&#39;s fine if there would be more glue code than actual driver code (it would, eventually, be shared with all drivers so it&#39;s not a big deal), but if the driver itself would be peppered with numerous  unsafe blocks then the whole exercise would become a bit pointless.\n It&#39;s not true that Rust doesn&#39;t try to outright remove footguns.  Some of the C++ footguns, especially C++ footguns inherited from, or founded upon C compatibility (even if they weren&#39;t necessarily footguns in C) are relics of a forgotten past. For example, why is &#34;char&#34; allowed to be _either_ signed or unsigned and it&#39;s up to the implementation to choose? Because the hardware at the time varied. Fast forward to the 21st century and nobody wishes they had whichever of Rust&#39;s i8 and u8 is faster on the CPU they&#39;re using. That isn&#39;t a thing. So, if you want i8 you ask for i8 and if you want u8 you ask for u8, and you thus can&#39;t blow your foot off by getting a type that isn&#39;t what you thought it would be.  Likewise, why do the signed integers have undefined behaviour on overflow? Ancient hardware represented negative numbers in several ways. So, for maximum compatibility C can&#39;t specify what happens. Maybe it should have said platform defined, too late now. Great, but every platform available today has two&#39;s complement arithmetic, so this serves no purpose. Rust gets to just say this up front. Debug builds panic! if you overflow, if the mistake survives until Production you get two&#39;s complement arithmetic and good luck with that. If you explicitly _want_ wrapping, or saturating arithmetic (the latter especially could make sense in audio), you can ask for them in Rust, either for one operation (e.g. a saturating addition) or as the type of a variable and you get what you asked for, no panics, the compiler produces good optimised code for this case. But even if not the footgun of &#34;Undefined behaviour&#34; for overflow is banished.  Sometimes compilers got better and we no longer need to spell out what can be inferred. C and C++ both have the pair of unary increment operators. They are footguns. Both b++ and ++b are a bit less typing than b += 1 but they squeeze a lot of opportunity for mistakes into so few characters. Why two of them? Because C and C++ make these unary operators have a result as well as their assignment effect, even though you rarely need it, and the results are different. In Rust the unary increments don&#39;t exist, and the other assignment operators do not have a result (strictly, their result is the empty tuple), if you mean a = b; b+= 1 you can write that, and if you mean b+= 1; a = b you can write that instead. Don&#39;t worry, a modern compiler is smart, you don&#39;t get slower code just because it was slightly more typing.  Sometimes the problem scope was meanwhile clarified. Rust lacks C and C++&#39;s &#34;volatile&#34; keyword which I&#39;ve talked about before at some length. That keyword is probably a mistake. The thing it was intended for in Unix exists in Rust as a set of compiler intrinsics named volatile_read and volatile_write (a set because they come in different sizes, it turns out your hardware knows whether you wrote a 32-bit integer or two 16-bit integers to memory), and many of the things it was mistakenly abused to do in C or C++ are specifically outlawed in those languages today because they can&#39;t work. So in practice the gap between Rust&#39;s volatile_read/ volatile_write and C++ volatile keyword is just footguns you avoided by not having that type qualifier.  Aside from things related to the unsafe keyword itself (e.g. calling unsafe functions) I believe Rust only lets you do 3 things in unsafe code that you weren&#39;t anyway allowed to do in safe code. You can dereference a raw pointer. You can access fields in a union. You can mutate statics. That&#39;s all. Those are indeed potential footguns (who knows what, if anything, that raw pointer is pointing at; maybe that field in the union isn&#39;t the one with valid data in it; hey, another thread is reading that static variable, changing it seems like a bad idea) but that&#39;s a much smaller set than you might have expected.\n &gt; Maybe it should have said platform defined, too late now. Why is it too late? Correct programs would stay correct and incorrect programs (which their authors perceive as correct!) would become truly correct.\n In fact his is  exactly  what was supposed to happen:  Undefined behavior gives the implementor license not to catch certain program errors that are difficult to diagnose. It also identifies areas of possible conforming language extension:  the implementor may augment the language by providing a definition of the officially undefined behavior (emphasis mine).\n Signed overflow was declared “undefined” no\n......", "posttime": "2021-07-24 18:31:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,rust", "title": "用于 Linux Redux 的 Rust", "title_en": "Rust for Linux Redux", "transed": 1, "url": "https://lwn.net/Articles/862018/", "via": "", "real_tags": ["linux", "rust"]}, {"category": "", "categoryclass": "", "imagename": "87e36d4a62e14082e08a95be63666f87.png", "infoid": 1069437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周我有两件特别重要的事情要展示！不是 Steam Deck 级别的大，但我认为还是很酷的。 🙂 首先，David Redondo 和 Kai Uwe Broulik 实现了电源配置文件功能！这允许您指定计算机应如何平衡能源使用与性能。您可以随时使用电池和亮度小程序切换模式，并且您可以配置在插入或拔出电源线时自动使用哪个配置文件。当使用 Linux Kernel 5.12 或更高版本时，该功能将在 Plasma 5.23 中可用，并且支持它的较新计算机。接下来，Plasma 5.20 中引入的新 Kickoff 启动器菜单进行了巨大的代码修改，修复了许多错误，提高了性能和可访问性，收紧了用户界面，并添加了一些常见的功能。修复：页脚中的电源/会话项目或侧边栏中的项目的长文本不再被忽略；相反，布局水平延伸以容纳它们使用箭头键导航搜索结果列表不再丢弃第一次击键您现在可以选择是对所有应用程序视图使用列表还是网格，而不仅仅是收藏夹类别 Pin 按钮具有已添加，因此您现在可以根据需要将其打开——就像您可以为系统托盘、数字时钟和 KRunner 做的一样\n非常感谢诺亚戴维斯完成这个彻底的改变！它将在 Plasma 5.23 中发布。现在可以更改系统监视器中的传感器标签并提供自定义文本（David Redondo，Plasma 5.23）系统设置登录屏幕页面的同步功能现在也同步您的屏幕排列，以便登录屏幕 UI 正确定位在您的所有物理屏幕上（Aleix Pol Gonzalez，Plasma 5.23）：Dolphin 上下文菜单中的“开始幻灯片”菜单项现已翻译（Yuri Chornoivan，Gwenview 21.08）如果故意固定，打开数字时钟小程序的设置对话框不再关闭小程序的弹出窗口打开 (David Redondo, Plasma 5.22.3) 系统托盘扩展弹出窗口中的网格项目现在总是完全像素对齐，因此它们不会变得模糊 (Derek Christ, Plasma 5.22.4) 在桌面项目的上下文菜单中，按当子菜单打开时，用于在“移至垃圾箱”和“删除”之间切换的 shift 键现在可以工作（Derek Christ，Plasma 5.22.4）\n桌面文件在文件名中包含大写字符的应用程序的全局快捷方式现在可以正常工作，并且它们在“系统设置快捷方式”页面中的条目现在总是显示正确的图标（David Redondo，Plasma 5.22.4）带有嵌入链接的 Plasma 通知现在使用链接颜色来自 Plasma 主题而不是应用程序配色方案，修复了在这些不同的情况下的错误，例如应用 Breeze Twilight 主题时 (Kai Uwe Broulik, Plasma 5.22.4) Unsplash Picture of the Day 壁纸配置页面中的类别列表现在按字母顺序排序，而不是半随机排序（Arnaud Vergnet，Plasma 5.22.4）在 KRunner 中显示的来自使用 Plasma 浏览器集成的浏览器的网站图标现在在使用高 DPI 比例因子时非常清晰（Kai Uwe Broulik， Plasma 5.22.4) 打开系统设置用户反馈页面不再短暂地使 Discover 出现在任务管理器中 (Plasma 5.23) 在 Plasma Wayland 会话中，glob所有快捷方式再次工作，而否则会窃取焦点（在 X11 上）的弹出窗口打开（Andrey Butirsky，Plasma 5.33）现在每个 Dolphin 的缩放级别都有与其相关联的不同图标大小；不再会改变缩放级别有时会导致网格的大小发生变化，但图标保持相同的大小（Eugene Popov，Dolphin 21.12）\n当使用显示桌面效果时，使用自适应透明度功能的面板现在进入透明模式（David Edmundson，Plasma 5.22.4）在 Discover 中浏览应用程序列表时，应用程序来源的图标现在显示在按钮内还列出了源的名称（我：Nate Graham，Plasma 5.23）：标题栏中的问号按钮现在默认为对话框窗口隐藏（我：Nate Graham，Plasma 5.23）Plasma 日历小部件上的事件指示器点并且无论您使用何种配色方案或 Plasma 主题，数字时钟弹出窗口现在都更加明显（Carl Schwan，Framework 5.85）基于 Kirigami 的应用程序的“关于”页面现在显示“参与”链接，将您带到 https ://community.kde.org/Get_Involved（Felipe Kinoshita，Frameworks 5.85）：请记住，这个博客只涵盖了冰山一角！我没有时间关注其开发的大量 KDE 应用程序在这里没有展示，我也没有提到后端重构、改进的测试覆盖率和其他通常不面向用户的更改。如果您想了解更多信息，请查看 https://planet.kde.org/，在那里您可以找到其他 KDE 贡献者的博客文章，详细介绍了他们正在做的工作。看看 https://community.kde.org/Get_Involved 发现如何成为真正重要的项目的一部分。每个贡献者都对 KDE 产生了巨大的影响；你不是机器中的数字或齿轮！您也不必已经是程序员。我刚开始的时候不是。试试吧，你会喜欢的！我们不咬人！", "note_en": "This week I have two particularly large things to present! Not  Steam Deck levels of large, but still pretty cool, I think. 🙂\n First of all, David Redondo and Kai Uwe Broulik implemented the  power profiles feature! This allows you to specify how your computer should balance energy use against performance. You can switch modes at any time using the Battery and Brightness applet, and you can configure which profile gets used automatically when plugging or unplugging the power cord. The feature will be available in Plasma 5.23 with a newer computer that supports it when using Linux Kernel 5.12 or greater.\n   Next, the new Kickoff launcher menu that was introduced in Plasma 5.20  has received a gigantic code overhaul which fixes many bugs, improves performance and accessibility, tightens up the user interface, and adds a few commonly requested features. Among the fixes:\n Long text for  the power/session items in the footer or  items in the sidebar is no longer ever elided; instead the layout stretches horizontally to accommodate them\n Using the arrow keys to navigate the search results list  no longer discards the first keystroke\n        You  can now choose whether to use a list or a grid for all app views, not just the Favorites category\n A Pin button has been added, so you can now pin it open if you like–just like you can do for the System Tray, Digital Clock, and KRunner\n   Big thanks to Noah Davis for completing this exhaustive change! It will be released in Plasma 5.23.\n    Sensor labels in System Monitor  can now be changed and given custom text (David Redondo, Plasma 5.23)\n The System Settings Login Screen page’s synchronization feature  now syncs your screen arrangement as well, so that the login screen UIs are positioned properly on all your physical screens (Aleix Pol Gonzalez, Plasma 5.23):\n     The “Start a Slideshow” menu item in Dolphin’s context menu  is now translated (Yuri Chornoivan, Gwenview 21.08)\n Opening the Digital Clock applet’s settings dialog  no longer closes the applet’s popup if it has been deliberately pinned open (David Redondo, Plasma 5.22.3)\n    The grid items in the System Tray’s expanded popup  are now always perfectly pixel-aligned so they will not become blurry (Derek Christ, Plasma 5.22.4)\n  In the context menu for desktop items, pressing the shift key to switch between “Move to Trash” and “Delete”  now works when a sub-menu is open (Derek Christ, Plasma 5.22.4)\n Global shortcuts for apps whose desktop files have uppercase characters in their filenames  now work properly, and  their entries in the System Settings Shortcuts page now always display the correct icons (David Redondo, Plasma 5.22.4)\n Plasma Notifications with embedded links  now use the link color from the Plasma theme rather than the application color scheme, fixing bugs in cases where these differed such as when the Breeze Twilight theme is applied (Kai Uwe Broulik, Plasma 5.22.4)\n Category lists in the Unsplash Picture of the Day wallpaper’s configuration page  are now sorted alphabetically, rather than semi-randomly (Arnaud Vergnet, Plasma 5.22.4)\n Website Favicons displayed in KRunner that come from a browser using Plasma Browser Integration  are now nice and crisp when using a high DPI scale factor (Kai Uwe Broulik, Plasma 5.22.4)\n Opening the System Settings User Feedback page  no longer briefly makes Discover appear in the Task Manager (Plasma 5.23)\n In the Plasma Wayland session,  global shortcuts once again work while popups that would otherwise steal focus (on X11) are open (Andrey Butirsky, Plasma 5.33)\n     Every one of Dolphin’s zoom levels now has a different icon size associated with it; no longer will changing the zoom level sometimes cause the size of the grid to change but the icons stay the same size (Eugene Popov, Dolphin 21.12)\n Panels using the Adaptive Transparency feature  now enter transparent mode when the Show Desktop effect is in use (David Edmundson, Plasma 5.22.4)\n   When browsing app lists in Discover, the icon of the source that the app comes from  is now displayed inside the button that also lists the name of the source (me: Nate Graham, Plasma 5.23):\n    The question mark button in the titlebar  is now hidden by default for dialog windows (me: Nate Graham, Plasma 5.23)\n   Event indicator dots on the Plasma Calendar widget and the Digital Clock popup  are now more visible no matter what color scheme or Plasma theme you’re using (Carl Schwan, Frameworks 5.85)\n Kirigami-based apps’ “About” pages  now display a “Get Involved” link that takes you to  https://community.kde.org/Get_Involved (Felipe Kinoshita, Frameworks 5.85):\n   Keep in mind that this blog only covers the tip of the iceberg! Tons of KDE apps whose development I don’t have time to follow aren’t represented here, and I also don’t mention backend refactoring, improved test coverage, and other changes that are generally not user-facing. If you’re hungry for more, check out  https://planet.kde.org/, where you can find blog posts by other KDE contributors detailing the work they’re doing.\n  Have a look at  https://community.kde.org/Get_Involved to discover ways to be part of a project that really matters. Each contributor makes a huge difference in KDE; you are not a number or a cog in a machine! You don’t have to already be a programmer, either. I wasn’t when I got started. Try it, you’ll like it! We don’t bite!", "posttime": "2021-07-24 18:30:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kde,现在", "title": "本周 KDE：电源配置文件和更精美的 Kickoff", "title_en": "This week in KDE: Power profiles and a more polished Kickoff", "transed": 1, "url": "https://pointieststick.com/2021/07/23/this-week-in-kde-power-profiles-and-a-more-polished-kickoff/", "via": "", "real_tags": ["kde", "现在"]}, {"category": "", "categoryclass": "", "imagename": "4d1cd705c86a0441d676aeb20499fe81.jpg", "infoid": 1069436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今晚 Adam Barth 将带我们参观 Google 的新操作系统 Fuchsia。我们将看到一些事情是如何在幕后工作的，并写下...", "note_en": "Tonight Adam Barth will take us on a tour of Google's new operating System, Fuchsia.  We'll get to see how some things work under the hood as well as write o...", "posttime": "2021-07-24 18:30:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,fuchsia,adam", "title": "Fuchsia 操作系统之旅", "title_en": "A Tour of the Fuchsia Operating System", "transed": 1, "url": "https://www.youtube.com/watch?v=gIT1ISCioDY", "via": "", "real_tags": ["操作系统", "fuchsia", "adam"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伽利略项目研究小组的目标是使用标准科学方法确定 UAP 和类似 Oumuamua 的星际物体的性质，该方法基于对使用优化仪器收集的开放科学数据的透明分析。一张图片胜过千言万语。例如，在一英里距离外的人类尺度 UAP 物体表面的百万像素图像将允许区分标签：“X 国制造”与附近系外行星上的潜在替代品“ETC Y 制造”。我们的银河系。这一目标将通过使用分布在选定位置的中型、高分辨率望远镜和探测器阵列网络以及合适的相机和计算机系统搜索 UAP 来实现。数据将向公众开放，科学分析将是透明的。我们期待广泛的人工智能/深度学习 (AI/DL) 和算法方法来区分大气现象与鸟类、气球、商业或消费无人机，以及潜在的陆地或其他来源调查我们星球的技术对象，如卫星。为了实现高对比度成像，每个望远镜都将成为具有正交和互补能力的探测器阵列的一部分，从雷达、多普勒雷达和高分辨率合成孔径雷达到高分辨率、大型相机可见范围和红外波段望远镜。如果发现 ETC 正在使用 UAP 测量地球，那么我们必须假设 ETC 已经掌握了无源雷达、光学和红外技术。在这种情况下，我们对这种检测到的 UAP 的系统研究将通过高性能、集成和多波长探测器阵列得到加强。伽利略计划研究小组还将利用现有和未来的天文调查，例如未来在维拉·鲁宾天文台 (VRO) 进行的时空遗产调查 (LSST) [1]，来发现和监测星际访客的特性到太阳系。我们将概念化和设计，可能与感兴趣的太空机构或太空企业合作，一个准备发射的太空任务，通过拦截它们接近太阳的轨迹或使用地面勘测望远镜，对不寻常的星际物体（如“Oumuamua”）进行成像发现星际流星。发现潜在的 1 米或更小的可能正在探索地球的卫星，例如在地球上空几百公里的极地轨道上，可能在 2023 年及以后通过 VRO 变得可行，但如果雷达、光学和红外技术已被掌握ETC，然后可能需要地球上非常复杂的大型望远镜。我们将设计伽利略计划打算部署的先进算法和 AI/DL 对象识别和快速过滤方法，最初是在非轨道望远镜上。", "note_en": "The  Galileo  Project research group will aim to identify the nature of UAP and  ‘Oumuamua-like interstellar objects using the standard scientific method based on a transparent analysis of open scientific data to be collected using optimized instruments.\n    A picture is worth a thousand words.   For example, a megapixel image of the surface of a human-scale UAP object at a distance of a mile will allow to distinguish the label: “Made in Country X” from the potential alternative “Made by ETC Y” on a nearby exoplanet in our galaxy.  This goal will be accomplished by searching for UAP with a network of mid-sized, high-resolution telescopes and detector arrays with suitable cameras and computer systems, distributed in select locations. The data will be open to the public and the scientific analysis will be transparent.\n We anticipate extensive Artificial Intelligence/Deep Learning (AI/DL) and algorithmic approaches to differentiate atmospheric phenomena from birds, balloons, commercial or consumer drones, and from potential technological objects of terrestrial or other origin surveying our planet, such as satellites. For the purpose of high contrast imaging, each telescope will be part of a detector array of orthogonal and complementary capabilities from radar, Doppler radar and high-resolution synthetic aperture radar to high-resolution, large camera visible range and infrared band telescopes. If an ETC is discovered to be surveying Earth using UAP, then we have to assume that the ETC has mastered passive radar, optical and infrared technologies. In such a case, our systematic study of such detected UAP will be enhanced by means of high-performance, integrated and multi-wavelength detector arrays.\n   The  Galileo    Project  research group also will utilize existing and future astronomical surveys, such as the future Legacy Survey of Space and Time (LSST)   [1] at the Vera C. Rubin Observatory (VRO), to discover and monitor the properties of interstellar visitors to the Solar system.\n We will conceptualize and design, potentially in collaboration with interested space agencies or space ventures, a launch-ready space mission to image unusual interstellar objects such as  ‘Oumuamua by intercepting their trajectories on their approach to the Sun or by using ground-based survey telescopes to discover interstellar meteors.\n   Discovering potential 1 meter-scale or smaller satellites that may be exploring Earth, e.g., in polar orbits a few hundred km above Earth, may become feasible with VRO in 2023 and later, but if radar, optical and infrared technologies have been mastered by an ETC, then very sophisticated large telescopes on Earth might be required. We will design advanced algorithmic and AI/DL object recognition and fast filtering methods that the  Galileo    Project  intends to deploy, initially on non-orbiting telescopes.", "posttime": "2021-07-24 17:53:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高分辨率,high,uap", "title": "获取高分辨率、多探测器 UFO 图像", "title_en": "Obtain High-Resolution, Multi-Detector UFO Images", "transed": 1, "url": "https://projects.iq.harvard.edu/galileo/activities", "via": "", "real_tags": ["高分辨率", "high", "uap"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069433, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本网站需要启用 Cookie 才能运行。请确保 Cookie 已打开，然后重新访问所需的页面。", "note_en": "This site requires Cookies to be enabled to function. Please ensure Cookies are  turned on and then re-visit the desired page.", "posttime": "2021-07-24 17:53:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认知,deficits,cookie", "title": "从 Covid-19 中康复的人的认知缺陷", "title_en": "Cognitive deficits in people who have recovered from Covid-19", "transed": 1, "url": "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(21)00324-2/fulltext", "via": "", "real_tags": ["认知", "deficits", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "928dd585679d6f5abd6c098674702fb5.jpg", "infoid": 1069430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN) 根据丹麦的一项新研究，在过去 25 年中，与滥用大麻有关的精神分裂症病例比例有所增加。 1995 年，该国 2% 的精神分裂症诊断与大麻使用障碍有关。 2000 年，它增加到 4% 左右。研究发现，自 2010 年以来，这一数字增加到 8%。 “我认为利用我们的研究和其他研究来强调和强调大麻的使用并非无害是非常重要的，”哥本哈根心理健康研究中心副教授、该研究的作者 Carsten Hjorthøj 说。医学杂志 JAMA Psychiatry，通过电子邮件。 “不幸的是，有证据表明大麻越来越多地被视为一种无害的物质。这很不幸，因为我们发现它与精神分裂症、认知功能较差、物质使用障碍等有关，”Hjorthøj 写道。先前的研究表明，使用大麻的人患精神分裂症的风险更高，而这种关联尤其是由于大量使用这种药物。许多研究人员假设大麻的使用可能是一个“组成部分”，它与其他风险因素相互作用，导致这种情况。 “当然，我们的发现必须在其他地方复制才能得出确切的结论，”Hjorthøj 继续说道。 “但我确实相当有信心，我们会在有问题的大麻使用增加或大麻效力增加的地方看到类似的模式，因为许多研究表明，高效大麻可能是与精神分裂症相关的驱动因素.”全世界有数千万人使用大麻。在美国 19 个州和加拿大用于娱乐用途是合法的。在这些地方和其他一些地方，它还被批准用于治疗某些疾病。\n该研究称，丹麦的大麻使用和大麻使用障碍一直在增加——这种模式在全球范围内也有出现。娱乐性杂草在丹麦是非法的，但允许用于医疗目的。大麻使用障碍通常被定义为药物使用有问题：产生对杂草的耐受性；使用大麻的数量或时间比预期的要长；无法减少使用；花费大量时间获得、使用或从大麻的影响中恢复；放弃有利于大麻的重要活动和义务；尽管有负面后果，但仍继续使用该药物。精神分裂症是一种慢性、严重和致残的精神障碍。其症状可能包括妄想、思维障碍和幻觉。在世界范围内，精神分裂症影响着 2000 万人。没有治愈方法，因此医生会尝试通过药物和治疗来控制症状。 Hjorthøj 说，虽然一项研究表明丹麦的精神分裂症正在增加，但在其他国家，情况还不确定。在美国，美国国家心理健康研究所表示，很难准确估计精神分裂症的患病率，因为诊断很复杂，而且与其他疾病重叠。 “许多精神病学教科书指出，精神分裂症的发病率……随着时间的推移是恒定的，与地理位置无关，”Hjorthøj 说。 “这经常被用作反对大麻可能导致精神分裂症的假设的论据，”他补充道。 “然而，事实证明，支持这一观点的研究很少。”这项新研究基于丹麦国家健康登记处的数据，包括所有在 2000 年 12 月 31 日之前出生的丹麦人，他们在 1972 年 1 月 1 日至 2016 年 12 月 31 日的某个时间点年满 16 岁。\n该研究结果可能有助于解释“近年来观察到的精神分裂症发病率普遍增加”，并提供了一些支持，即“长期观察到的大麻与精神分裂症之间的关联可能在本质上是部分因果关系”，该研究称。伦敦国王学院精神病学、心理学和神经科学研究所社会行为与发展教授兼主席 Terrie Moffitt 指出，该研究评估了临床诊断为大麻治疗障碍的人，而不是一般使用该药物的人。 “这项对全国医疗记录的研究增加了重要的证据，表明被诊断出大麻使用障碍的患者现在比过去更容易患精神病，”研究大麻使用对婴儿潮一代心理健康影响的莫菲特，告诉伦敦科学媒体中心。然而，莫菲特说，大多数大麻使用者，即使是那些依赖它的人，也从不寻求治疗，许多人在消遣时使用它而不会出现问题。在此处注册，每周二与 CNN 健康团队的 Sanjay Gupta 博士一起获取结果。 “众所周知，寻求治疗的人往往有多种心理健康问题，而不仅仅是大麻问题，”莫菲特说。 “并且能够很好地管理大麻的休闲大麻使用者比无法管理大麻的依赖大麻的使用者多得多。”哈佛大学公共卫生学院流行病学和生物统计学系教授 Tyler J. VanderWeele 在与该研究同时发表的一篇社论中说，由于对大麻使用障碍的诊断不足，该研究中的估计可能是保守的.\n“大麻使用障碍不是大多数精神分裂症病例的原因，但它造成的比例不可忽视且不断增加。在讨论大麻使用合法化和监管时应该考虑到这一点，”VanderWeele 在评论中写道。", "note_en": "(CNN)The proportion of schizophrenia cases linked with problematic use of marijuana has increased over the past 25 years, according to a new study from Denmark.\n In 1995, 2% of schizophrenia diagnoses in the country were associated with cannabis use disorder. In 2000, it increased to around 4%. Since 2010, that figure increased to 8%, the study found.\n &#34;I think it is highly important to use both our study and other studies to highlight and emphasize that cannabis use is not harmless,&#34; said Carsten Hjorthøj, an associate professor at the Copenhagen Research Center for Mental Health and an author of the study published in the medical journal JAMA Psychiatry, via email.\n     &#34;There is, unfortunately, evidence to suggest that cannabis is increasingly seen as a somewhat harmless substance. This is unfortunate, since we see links with schizophrenia, poorer cognitive function, substance use disorders, etc,&#34; Hjorthøj wrote.\n    Previous research has suggested that the risk of schizophrenia is heightened for people who use cannabis, and the association is particularly driven by heavy use of the drug. Many  researchers hypothesize that cannabis use may be a &#34;component cause,&#34; which interacts with other risk factors, to cause the condition.\n  &#34;Of course, our findings will have to be replicated elsewhere before firm conclusions can be drawn,&#34; Hjorthøj continued. &#34;But I do feel fairly confident that we will see similar patterns in places where problematic use of cannabis has increased, or where the potency of cannabis has increased, since many studies suggest that high-potency cannabis is probably the driver of the association with schizophrenia.&#34;\n Around the world tens of millions of people use cannabis. It&#39;s legal for recreational use in  19 US states and Canada. In these and some other places, it&#39;s also approved to treat some medical conditions.\n  Cannabis use and cannabis use disorder have been increasing in Denmark, the study said --  a pattern that&#39;s also seen globally.  Recreational weed use is illegal in Denmark but is allowed for medicinal purposes.\n Cannabis use disorder is usually defined as a problematic use of the drug: developing tolerance to weed; using cannabis in larger amounts or over a longer period than intended; being unable to reduce use; spending a lot of time obtaining, using or recovering from the effects of cannabis; giving up important activities and obligations in favor of cannabis; and continued use of the drug despite negative consequences.\n  Schizophrenia is a chronic, severe and disabling mental disorder. Its symptoms may include delusions, thought disorder and hallucinations. Worldwide,  schizophrenia affects 20 million people. No cure exists, so doctors try to manage the symptoms with medications and therapy.\n While one study has suggested that schizophrenia is increasing in Denmark, in other countries the picture is uncertain, said Hjorthøj. In the US, the  National Institute of Mental Health said it&#39;s hard to obtain accurate estimates of the prevalence of schizophrenia because diagnosis is complex and it overlaps with other disorders.\n &#34;Many textbooks in psychiatry state that the incidence... of schizophrenia is constant over time and independent of geographical location,&#34; Hjorthøj said.\n &#34;And this has often been used as an argument against the hypothesis that cannabis could cause schizophrenia,&#34; he added. &#34;However, it turns out that there is very little research that would support this notion.&#34;\n  The new study was based on data from Denmark&#39;s national health registry and included all people in Denmark born before December 31, 2000, who were 16 years or older at some point from January 1, 1972, to December 31, 2016.\n The findings could help explain the &#34;general increase in the incidence of schizophrenia that has been observed in recent years&#34; and provides some support that the &#34;long-observed association between cannabis and schizophrenia is likely partially causal in nature,&#34; the study said.\n  The study assessed people who had a clinical diagnosis for cannabis treatment disorder, not general use of the drug, noted Terrie Moffitt, a professor and chair in Social Behaviour &amp; Development of the Institute of Psychiatry, Psychology, and Neuroscience at King&#39;s College London.\n &#34;This study of nationwide medical records adds important evidence that patients with diagnosed cannabis use disorder are more at risk for psychosis now than they used to be,&#34; Moffitt, who studies the effects of cannabis use on the mental health of the baby boomer generation, told the Science Media Centre in London.\n However, Moffitt said that most cannabis users, even those who are dependent on it, never seek treatment and many people use it recreationally without developing problems.\n Sign up here to get  The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n &#34;It is known that people who seek treatment tend to have multiple mental health problems, not solely cannabis problems,&#34; Moffitt said. &#34;And there are far more recreational cannabis users who manage cannabis well than cannabis-dependent users who cannot manage it.&#34;\n   In an editorial that accompanied the study, Tyler J. VanderWeele, a professor in the Departments of Epidemiology and Biostatistics at the Harvard T. H. Chan School of Public Health, said that the that estimates in the study could be conservative because of underdiagnosis of cannabis use disorder.\n &#34;Cannabis use disorder is not responsible for most schizophrenia cases, but it is responsible for a nonnegligible and increasing proportion. This should be considered in discussions regarding legalization and regulation of the use of cannabis,&#34; VanderWeele wrote in the commentary.", "posttime": "2021-07-24 17:52:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linked,研究", "title": "与大麻使用障碍有关的精神分裂症呈上升趋势", "title_en": "Schizophrenia linked to marijuana use disorder is on the rise", "transed": 1, "url": "https://edition.cnn.com/2021/07/22/health/marijuana-schizophrenia-study-wellness/index.html", "via": "", "real_tags": ["linked", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "计算机是了不起的工具，而互联网是一个了不起的网络，我们可以与任何连接的人分享我们想要的一切。就目前而言，大多数 Internet 是中立的，这意味着 ISP 必须向其客户提供 Internet 访问权限，并且不要根据目的地做出选择（例如某些网站的访问速度更快）。理解这一点很重要，这意味着您可以在家里或租用的专用服务器上托管自己的网站、自己的聊天服务器或自己的游戏服务器，这称为自托管。我想将标签自托管放在专用服务器上可能不会让每个人都同意，这是真的，这是一个灰色区域。自托管的反面是依靠一家公司为您完成工作，在他们的条件下，无论是否免费。自托管是关于自由的，您可以选择要运行的服务器、版本、功能和配置。如果您在家中自行托管，您还可以选择符合您需求的硬件（更多内存？更多磁盘？RAID？）。自托管不是一个完美的解决方案，您必须购买硬件、更换故障组件、进行系统维护以保持软件部分的活力。当你依赖一家公司或第三方提供服务时，你就会被他们的生态系统和他们的决定所束缚。一家公司可以随时停止你所依赖的东西，他们可以随时决定暂停你的账户，无需解释。毫无疑问，公司会努力让他们的服务变得有吸引力，然后将你锁定在他们的生态系统中。例如，如果您将所有项目转移到 github 上并开始深入使用 github 服务（不仅仅是一个简单的 git 存储库），那么离开 Github 将很复杂，因为您没有 _reversibility_，这意味着退出和从您的服务中获得帮助以离开而不丢失数据或信息。自托管赋予用户权力，而不是从中获利。如果在社区中完成，自托管更好，为一群人提供公共邮件服务器和联合到更大网络（例如 XMPP 或 Matrix）的通信服务器是创建弹性互联网的好方法，同时又不放弃您的权利给资本主义公司。要求每个人都托管自己的服务甚至不是乌托邦而是愚蠢的，我们不需要每个人都为自己的服务运行自己的服务器，我们应该建立一个使用联合协议连接的社区群，例如电子邮件、XMPP、 Matrix、ActivityPub（用于乳齿象、Pleroma、Peertube、Disapora* 的协议）。\n在法国，有一项名为 CHATONS（这是 KITTENS 的法语词）的伟大计划，它收集了具有一些先决条件（例如多个系统管理员）的关联托管，以避免依赖一个人。我想我的大多数读者会争辩说，自托管很好，但无法与“云”服务竞争，我承认这是真的。公司投入大量资金来提供优质的服务来吸引客户并赚钱，如果他们的服务不好，他们就不会存在太久。但是不使用开源和自托管不会使您的服务提供商的替代品变得更大，您会因为系统而成为问题的一部分。例如，Google Mail GMAIL 现在很大，他们可以决定哪些域可以访问，哪些不能。这是一个问题，大多数小型电子邮件服务器无法将电子邮件发送到 Gmail 而不会被视为垃圾邮件，我们对此无能为力，他们的用户越多，他们就越不关心其他提供商。 Peertube这样的开源联合服务可以取得很大的成就，可以在Peertube实例上托管视频并遵循实例的本地规则，而其他一些大公司可能会因为某些自动检测脚本找到一段音乐而禁用您的视频或不合适的图片。将您的数据提供给公司并依赖他们的服务会让您失去自由。如果你不认为这是真的，那也没关系，自由是一个模糊的概念，它伴随着高尺度的各种步骤。如果您想了解有关托管自己的服务的更多信息，这里有一些提示。问问你信任的人是否愿意参与，最好有不止一个人来管理服务器。\n您不需要成为 IT 专业人员，但您需要了解您必须学习。只要您能证明原因（例如，peertube 服务器的运行成本可能非常高），就可以要求（贡献或作为要求）金钱。周围的人通常会扔旧硬件，询问朋友或亲戚是否有旧的未使用的硬件。您可以轻松修复“由于 wifi 停止工作而更换的旧 Windows 笔记本电脑”并将其用作服务器。用电一定要考虑，但另一方面，买一个全新的硬件来节省20W并不一定更环保。由于特定要求，某些服务（例如电子邮件服务器）无法托管在大多数 ISP 连接上 冗余在大多数情况下是过大的，狗屎会发生，但在冗余服务器中狗屎经常发生两次 我是自托管 自从我第一次了解运行网络以来服务器是 15 年前我唯一需要拥有自己的 PHP 论坛的东西。我主要保持这个博客活跃以展示和分享我的实验，大部分时间发生在我的自托管服务器上。\n我对这个主题有强烈的看法，托管您自己的服务是学习新技能或完善它们的绝佳方式，但这对于自由也很重要。在法国，我们甚至有关联的 ISP，即使它们很小，它们的存在也迫使大型 ISP 公司对其流程和互操作性保持透明。", "note_en": "Computers are amazing tools and Internet is an amazing network, we can share everything we want with anyone connected. As for now, most of the Internet is neutral, meaning ISP have to give access to the Internet to their customer and don&#39;t make choices depending on the destination (like faster access for some websites).\n This is important to understand, this mean you can have your own website, your own chat server or your own gaming server hosted at home or on a dedicated server you rent, this is called self hosting. I suppose putting the label self hosting on dedicated server may not make everyone agree, this is true it&#39;s a grey area. The opposite of self hosting is to rely on a company to do the job for you, under their conditions, free or not.\n  Self hosting is about freedom, you can choose what server you want to run, which version, which features and which configuration you want. If you self host at home, You can also pick the hardware to match your needs (more Ram ? More Disk? RAID?).\n Self hosting is not a perfect solution, you have to buy the hardware, replace faulty components, do the system maintenance to keep the software part alive.\n  When you rely on a company or a third party offering services, you become tied to their ecosystem and their decisions. A company can stop what you rely on at any time, they can decide to suspend your account at any time without explanation. Companies will try to make their services good are appealing, no doubt on it, and then lock you in their ecosystem. For example, if you move all your projects on github and you start using github services deeply (more than a simple git repository), moving away from Github will be complicated because you don&#39;t have _reversibility_, which mean the right to get out and receive help from your service to move away without losing data or information.\n Self hosting empower the users instead of making profit from them. Self hosting is better when it&#39;s done in community, a common mail server for a group of people and a communication server federated to a bigger network (such as XMPP or Matrix) are a good way to create a resilient Internet while not giving away your rights to capitalist companies.\n  Asking everyone to host their own services is not even utopia but rather stupid, we don&#39;t need everyone to run their own server for their own services, we should rather build a constellation of communities that connect using federated protocol such as Email, XMPP, Matrix, ActivityPub (protocol used for Mastodon, Pleroma, Peertube, Disapora*).\n In France, there is a great initiative named CHATONS (which is the french word for KITTENS) gathering associative hosting with some pre-requisites like multiple sysadmin to avoid relying on one person.\n      I suppose most of my readers will argue that self hosting is nice but can&#39;t compete with &#34;cloud&#34; services, I admit this is true. Companies put a lot of money to make great services to get customers and earn money, if their service were bad, they wouldn&#39;t exist long.\n But not using open source and self hosting won&#39;t make alternatives to your service provider greater, you become part of the problem by feeding the system. For example, Google Mail GMAIL is now so big that they can decide which domain is allowed to reach them and which can&#39;t. It is such a problem that most small email servers can&#39;t send emails to Gmail without being treated as spam and we can&#39;t do anything to it, the more users they are, the less they care about other providers.\n Great achievements can be done in open source federated services like Peertube, one can host videos on a Peertube instance and follow the local rules of the instance, while some other big companies could just disable your video because some automatic detection script found a piece of music or inappropriate picture.\n Giving your data to a company and relying on their services make you lose your freedom. If you don&#39;t think it&#39;s true this is okay, freedom is a vague concept and it comes with various steps on a high scale.\n  Here are a few tips if you want to learn more about hosting your own services.\n ask people you trust if they want to participate, it&#39;s better to have more than only one person to manage servers.\n  you don&#39;t need to be an IT professional, but you need to understand you will have to learn.\n    asking (for contributing or as a requirement) for money is fine as long as you can justify why (a peertube server can be very expensive to run for example).\n  people around usually throw old hardware, ask friends or relative if they have old unused hardware. You can easily repair &#34;that old Windows laptop I replaced because wifi stopped working&#34; and use it as a server.\n  electricity usage must be considered but on the other hand, buying a brand new hardware to save 20W is not necessarily more ecological.\n  some services such as email servers can&#39;t be hosted on most ISP connection due to specific requirements\n    redundancy is overkill most of the time, shit happens but in redundant servers shit happens twice more often\n  I&#39;m self hosting since I first understood running a web server was the only thing I required to have my own PHP forum 15 years ago. I mostly keep this blog alive to show and share my experiments, most of the time happening when playing with my self hosting servers.\n I have a strong opinion on the subject, hosting your own services is a fantastic way to learn new skills or perfect them, but it&#39;s also important for freedom. In France we even have associative ISP and even if they are small, their existence force the big ISP companies to be transparent on their processes and interoperatibility.", "posttime": "2021-07-24 17:15:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "托管,hosting,服务", "title": "为什么自托管很重要", "title_en": "Why self hosting is important", "transed": 1, "url": "https://dataswamp.org/~solene/2021-07-23-why-selfhosting-is-important.html", "via": "", "real_tags": ["托管", "hosting", "服务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们使用 cookie 来确保在我们的网站上为您提供最佳体验。您的浏览器似乎不支持它们，这会影响站点功能。", "note_en": "We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2021-07-24 17:15:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,实践,skeptics", "title": "冠状病毒怀疑论者使用正统数据实践来促进非正统科学", "title_en": "Coronavirus Skeptics Use Orthodox Data Practices to Promote Unorthodox Science", "transed": 1, "url": "https://dl.acm.org/doi/fullHtml/10.1145/3411764.3445211", "via": "", "real_tags": ["病毒", "冠状病毒", "实践", "skeptics"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "塞尔维亚语（西里尔文）", "note_en": "‪српски (ћирилица)‬", "posttime": "2021-07-24 17:15:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,设置,setting,西里尔", "title": "Google 设置：关闭个性化结果", "title_en": "Google Setting: Turn Off Personalized Results", "transed": 1, "url": "https://www.google.com/setting/search/privateresults/", "via": "", "real_tags": ["google", "设置", "setting", "西里尔"]}, {"category": "", "categoryclass": "", "imagename": "f6039ec9b118d35171f948a6eacb6319.png", "infoid": 1069424, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以下工具可让您检查浮点表达式的计算流程，查看舍入发生的位置、触发异常的时间、可能丢失精度的时间、特殊值传播的时间、错误累积的时间以及其他令人头疼的浮点问题。 [fpinspect]# ./fpinspect &quot;sqrt(45.0*e+phi)/pi&quot;Exception: 0 (1 roundings) INEXACT (45.000000 * e) Trace (1 operation) MULException: 0 (1 roundings) INEXACT phi Trace (1 operation) ) MULException: 0 (2 roundings) INEXACT ((45.000000 * e) + phi)Exception: 1 (2 roundings) INEXACT ((45.000000 * e) + phi) Trace (2 operation) MUL ADDException: 0 (3 roundings) INEXACT sqrt (((45.000000 * e) + phi))例外：1（3 舍入）不精确的 sqrt(((45.000000 * e) + phi))例外：2（3 舍入）不精确的 sqrt(((45.000000 * e) + phi) ) 跟踪（3 次操作）MUL ADD ADDException：0（3 次舍入）不正确的 piException：1（3 次舍入）不正确的 piException：2（3 次舍入）不正确的 pi 跟踪（3 次操作）MUL ADD ADDException：0（4 次舍入）不正确（sqrt） (((45.000000 * e) + phi)) / pi)例外：1（4 舍入）不准确（sqrt（（（45.000000 * e）+ phi））/pi）例外：2（4 舍入）不准确（sqrt（（（） (45.000000 * e) + phi))) / pi)例外：3 (4 舍入) INEXACT (sqrt(((45.000000 * e) + phi)) / pi) Trace (4 operation) ns) MUL ADD ADD DIV(sqrt(((45.000000 * e) + phi))) / pi) ans: 3.54370117187500 err: 0.00000126456894 如您所见，表达式 sqrt(45.0*e+ pi) 产生了大量的输出,每个空行分隔的区域都是一个触发异常的子表达式，在这种情况下，因为 45 * e 是一个不精确的值，首先呈现不精确的异常。在这里你可以看到这样的表达式涉及 1 个操作，total，在这种情况下，操作只是一个 MUL。我们还可以看到结果表达式，因为它不精确，导致了一个舍入。沿着异常列表向下，我们可以看到异常传播到 MUL 中的 phi（这也是一个不精确的值），并继续，每个新的不精确子表达式导致多次舍入。由于像 sqrt 这样的内核本身可能会使用像 add 这样的操作，我们还看到最后一组异常在它的跟踪中包含一个额外的 ADD。表达式的最终结果在 ans: 中给出，下面你会发现计算该表达式的累积误差 err:，在这种情况下，这个函数精确到五个尾数位，总共七位，这意味着这个表达式有~0.71 ULP 错误。该程序完全在软件中实现 IEEE-754 浮点，模拟所有舍入模式、异常和微小检测方法，这些方法可以在评估表达式时进行配置。除超越函数外，所有浮点计算也精确到 &lt;= 1 ULP 的误差。目前支持 32 位单精度浮点 float32.{h,c} 和 64 位双精度浮点 float64.{h,c}，因为 32 位单精度需要双精度精度内核 kernel32.{h,c} 以产生正确舍入和截断的结果&lt;= 1 ULP 的错误。\n目前没有 64 位内核，因为这需要在软件中实现 80 位双精度浮点或 128 位四精度浮点，以具有产生正确舍入和截断结果所需的精度&lt; = 1 ULP 错误。", "note_en": "The following tool lets you inspect the computational flow of a floating pointexpression, seeing where rounding occurs, when exceptions are triggered,when precision may be lost, when special values propagate, when erroraccumulates, and other floating point headaches.\n  [fpinspect]# ./fpinspect &#34;sqrt(45.0*e+phi)/pi&#34;Exception: 0 (1 roundings) INEXACT (45.000000 * e) Trace (1 operations) MULException: 0 (1 roundings) INEXACT phi Trace (1 operations) MULException: 0 (2 roundings) INEXACT ((45.000000 * e) + phi)Exception: 1 (2 roundings) INEXACT ((45.000000 * e) + phi) Trace (2 operations) MUL ADDException: 0 (3 roundings) INEXACT sqrt(((45.000000 * e) + phi))Exception: 1 (3 roundings) INEXACT sqrt(((45.000000 * e) + phi))Exception: 2 (3 roundings) INEXACT sqrt(((45.000000 * e) + phi)) Trace (3 operations) MUL ADD ADDException: 0 (3 roundings) INEXACT piException: 1 (3 roundings) INEXACT piException: 2 (3 roundings) INEXACT pi Trace (3 operations) MUL ADD ADDException: 0 (4 roundings) INEXACT (sqrt(((45.000000 * e) + phi)) / pi)Exception: 1 (4 roundings) INEXACT (sqrt(((45.000000 * e) + phi)) / pi)Exception: 2 (4 roundings) INEXACT (sqrt(((45.000000 * e) + phi)) / pi)Exception: 3 (4 roundings) INEXACT (sqrt(((45.000000 * e) + phi)) / pi) Trace (4 operations) MUL ADD ADD DIV(sqrt(((45.000000 * e) + phi)) / pi) ans: 3.54370117187500 err: 0.00000126456894\n As you can see, the expression  sqrt(45.0*e+phi)/pi produces a lot of output,each empty-line-separated region is a subexpression which triggered an exception,in this case because  45 * e is an inexact value, the inexact exception ispresented first. Here you can see that such an expression involved  1 operations,total and in this case the operation is just a  MUL. We can also see that theresulting expression, because it&#39;s inexact, incurred one rounding.\n Following down the exception list, we can see that the exception propagatedto  phi in a  MUL (which is also an inexact value), and continued, with eachnew inexact subexpression resulting in several roundings. Since kernels like sqrt might themselves use operations like  add, we also see the final groupof exceptions contains an additional  ADD in it&#39;s trace.\n The final result of the expression is given in  ans: and below that you willfind the accumulative error  err: of evaluating that expression, in this casethis function is exact to five mantissa digits of precision, out of a total ofseven, which means this expression has ~0.71 ULP of error.\n         This program implements IEEE-754 floating point completely in software, emulatingall rounding modes, exceptions, and tininess detection methods which can beconfigured when evaluating an expression. With exception to transcendentalfunctions, all floating point computation is also accurate to &lt;= 1 ULP of error.\n Currently there is support for 32-bit single-precision floating-point float32.{h,c} and 64-bit double-precision floating-point  float64.{h,c}, asdouble-precision is necessary for 32-bit single-precision kernels kernel32.{h,c} to produce correctly rounded and truncated resultsto &lt;= 1 ULP of error.\n   There are currently no 64-bit kernels, as that would require either 80-bitextended-precision floating-point, or 128-bit quadruple-precision floating-pointto be implemented in software to have the precision necessary to producecorrectly rounded and truncated results to &lt;= 1 ULP of error.", "posttime": "2021-07-24 15:58:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表达式,point", "title": "浮点表达式检查器", "title_en": "Floating Point Expression Inspector", "transed": 1, "url": "https://github.com/graphitemaster/fpinspect", "via": "", "real_tags": ["表达式", "point"]}, {"category": "", "categoryclass": "", "imagename": "6bd4a5237d0e7f544b430adff84de44e.png", "infoid": 1069423, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一致的命名策略很重要，应该是 anycloud 工作的重要组成部分。遗憾的是，它经常被忽视。当您拥有几台“宠物”服务器时，这似乎是一种奢侈，但随着托管资源数量的增加，它很快变得至关重要。这是实现基本一致性水平的第一步，也是建立任何类型的云治理的先决条件。后者会很快告诉我们我们正在处理什么类型的资源，它们属于哪个项目和环境，它们位于何处以及它们在功能上是否彼此等效。减少理解代码的努力，并允许开发人员专注于更重要的方面，而不是争论命名标准。我不太确定我第一次看到这句话是什么时候，但它后来成了我的最爱之一。 Martin Fowler 将其归功于 PhilKarlton。我们将重点关注云级资源的命名约定应该如何。我们的示例中使用了 GCP，但概念和策略是通用的，可以轻松适应其他云提供商。在设计命名约定时，您应该考虑云提供商施加的限制。每个资源都带有一组命名限制。经验法则是保持简短和简单（仅对各个组件使用字母和数字，保留 - 作为分隔符）。 GCP 将大多数资源的名称长度限制为 62 或 63 个字符，项目 ID 限制为 30。资源必须具有唯一的名称，无论是在全球范围内还是在给定范围内。一些资源有额外的限制需要考虑（例如 GCP 项目不能立即删除）。\n首先我们建立所有直接管理的资源都应该遵循的命名模式——全局命名模式。这是用于所有资源的固定值前缀。通常是组织名称的某种形式的缩写。这与 GCP 项目不同。通常一个项目将有多个 GCP 项目。我们使用扁平层次结构，项目作为将资源组织成组的主要机制。我喜欢使用扁平层次结构，因为它非常通用且灵活，几乎可以适应任何组织结构。您可能会考虑用某种其他形式的团队（例如团队、产品）来代替它，但根据我的经验，从长远来看，它永远不会奏效。资源属于部署环境。建立一个在整个组织中使用的通用名称集是有益的。随着时间的推移，我尝试了各种机制来构建资源的缩写——如果名称基于 API 资源名称，则可以获得最一致的结果。给定资源类型的缩写。在 GCP 中，我倾向于使用三个字母。对于更大和更频繁使用的 API（例如 Compute、Kubernetes），API 的第一个字母代表，资源类型的其余两个字母代表。对于资源较少的 API，情况正好相反。我知道这不是一个完全确定的规则，但这将始终是对其简短和可用的妥协。当有可能在不同位置创建给定资源时需要位置。\n区域 - 五个字母的首字母缩略词（两个字母代表大陆，两个代表基本方向，1 位数字） Multi-Dual-regional - 遵循 GCP 自己的命名（两个字母代表多，四个字母代表双区域） 用于区分资源的描述同类型但不同的角色。例如，一组具有不同用途的服务器 - 前端和后端。这不应该用于区分同一用途资源的多个实例，而是使用后缀。当没有更好、更具体的术语可用时，就用于描述的通用关键字达成一致也是有益的。这避免了许多不同的名称，如 main、core、common、this 和 similar。通常好的策略是使用拉丁序数序列，即一级、二级、三级等。可读性好，并且可以使用 Terraform random_idresource 轻松生成。当有多个实例时，或者当需要唯一性时，使用后缀将资源与其对等资源区分开来。让我们回顾几个完整的示例，说明如何根据上述既定模式命名资源。出于此命名约定的目的，项目（和文件夹）被视为资源容器，因此省略名称的资源部分。\n您可以注意到 GCP 默认为通过控制台创建的项目执行此操作 - 例如 Rapid-depot-253717。GCP 中的项目 ID 必须全局唯一且不能立即删除。这对于自动化来说是不幸的，因为您无法使用删除后的同名。这就是我们包含独特的随机后缀部分的原因。文件夹：我们不使用 GCP 文件夹来组织项目。我普遍认为，保持简单和扁平往往是有益的。但是，如果您想进一步构建您的资源，请考虑在您的命名模式中添加一个额外的组件，例如 [org_group]。 Folderscan 然后遵循 [prefix]-[org-group] 模式。GCP 还允许配置项目名称。我建议将其设置为与项目 ID 相同的值并忘记它。出于所有实际目的，您将通过 ID 引用项目。总会有一些例外，即无法遵循全局命名模式（例如资源不允许 - 在名称中）或者它根本没有意义。如果可能，应使用完整模式的子集，并记录所有异常。服务账号只遵循[资源]-[描述]模式，因为项目已经包含在@之后的部分，因此不需要重复这一点，这是一个复杂的话题，也许是另一篇文章，但你应该建立命名约定组和如何分配权限的策略。根据经验，永远不要将权限直接分配给个人，而应仅分配给组。您还应该介绍标签（或标签）的使用。一个好的方法是添加信息以进一步对您的资源进行分类，例如成本中心。当您无法直接管理资源名称时，标签也很有用，但您可以管理一组传播到子资源（例如 GKE 集群标签或实例组）的标签。不要复制命名约定中已经包含的信息（例如项目）或使用可从对象本身获取的信息（例如创建时间戳）创建大量唯一标签。\n跨基础架构的 DNS 命名约定再次成为一个更大的主题，但您绝对应该拥有一个。一个简单的策略可以是以 [project]-[env].&lt;common_dns_domain&gt; 形式为每个 GCP 项目创建一个子域。为给定资源创建的 DNS 记录应遵循 GlobalNaming 模式的 [resource]-[resource_location]-[description]-[suffix] 部分，因此镜像资源名称。当您开始使用云或新项目时，您应该首先建立一致的命名约定。这是一开始很容易做的事情之一，但后来很难解决。您每天都会从中受益。命名约定成功的关键是尽早建立命名约定，并在整个基础架构中无情地遵循命名约定。自动化有很大帮助。像往常一样，没有灵丹妙药，实际的命名约定应该始终适合您的环境。重点是有一个！我希望这篇文章能给你一个良好的开端。感谢您一路走到这里。如果你现在认为我有严重的强迫症（我可能会），我不会责怪你，但是尝试在一个有 120 个 Kubernetes 集群的环境中工作，并且其中的每一个都只是集群！祝你的云之旅好运，我很想听听你命名事物的经验。你可以在@stepanstipl 上关注我。", "note_en": "Consistent naming strategy is important and should be an essential part of anycloud effort. Sadly it’s often overlooked. It might seem like a luxury when yourun a few “pet” servers, but it quickly becomes critical as the number ofmanaged resources grows. It is the first step in achieving even basic levelsof consistency and prerequisite to establishing any sort of cloud governance.\n     The latter will quickly tell us what type of resources are we dealing with, towhich project and environment they belong, where are they located and whetherthey’re functionally equivalent to each other.\n   Reduces effort to understand code and allows developers to focus on more important aspects than arguing over naming standards.\n I’m not quite sure when I first came across this quote, but itsince became one of my favourites. Martin Fowler  attributes it to PhilKarlton.\n     We’ll focus on how a naming convention for cloud-level resources should looklike. GCP is used in our examples, but the concepts and strategies are genericand can be easily adapted to other cloud providers.\n  When designing your naming convention, you should take into account limitationsimposed by the cloud provider. Each resource comes with a set of namingrestrictions. The rule of thumb is to keep it short and simple (use only lettersand numbers for individual components, keep  - as separator).\n GCP limits name length for most of the resources to 62 or 63 characters,Project IDs are limited to 30. Resources must have unique names, eitherglobally or within a given scope. Some resources have additional constraintsto take into consideration (e.g. GCP Projects can’t be immediately deleted).\n  First we establish naming pattern that all directly managed resources shouldfollow - Global Naming Pattern.\n     This is a fixed value prefix used for all resources. Typically some form of abbreviation for your organization name.\n   This is different from a GCP Project. Typically one Projectwill have multiple GCP Projects.We’re using flat hierarchy and Project serves as the main mechanism of organizingresources into groups. I like using flat hierarchy as it’s very universal andflexible to fit pretty much any organizational structure. You might considerreplacing this with some other form of group (e.g. team, product), but in myexperience it never quite works in the long term.\n   Resources belong to deployment environments. It’s beneficial to establish acommon set of names used across your organization.\n   I’ve tried various mechanisms over the time to construct theabbreviation for resources - most consistent results are achieved if the names arebased on the API resource names.Abbreviation of the given resource type. In GCP I tend to use three letters.\n For larger and more frequently used APIs (e.g. Compute, Kubernetes) first letterstands for the API and the remaining two for the resource type. For APIs with fewerresources, it’s the other way around. I know this is not a completely deterministicrule, but this will always be a compromise to it short and usable.\n   Location is required when there’s a possibility to create a given resource indifferent locations.\n Regional - five letter acronym (two letters for the continent, two forcardinal directions, 1 digit)\n   Multi- and Dual-regional - follow GCP’s own naming (two letters formulti and 4 letters for dual-regional)\n   A description used to distinguish between resources of the same type butdifferent roles. For example a group of servers with a different purpose - frontend and  backend. This should not be used to differentiatebetween multiple instances of the same purpose resource, use  suffixinstead.\n It’s also beneficial to agree on generic keywords used for description, when thereis no better, more specific, term available. This avoids many different nameslike  main,  core,  common,  this and similar. Often good strategy is to usethe Latin ordinal sequence, i.e.  primary,  secondary,  tertiary, etc.\n    good for readability and easily generated with Terraform  random_idresource.Use Suffix to differentiate resource from its peers when there are multiple instances, orwhen there’s a requirement for uniqueness.\n   Let’s go over several full examples of how resources should be named basedon the above established pattern.\n    Projects (and Folders) are considered resource containers for the purpose ofthis naming convention and therefore omit the  resource part of the name.\n You can notice GCP does this by default forprojects created via console - e.g.  rapid-depot-253717.Project IDs in GCP have to be globally unique and cannot be deleted immediately.This is unfortunate for automation, as you can’t create a project with the samename right after it has been deleted. And that’s why we include the unique randomsuffix part.\n Folders: We don’t use GCP folders to organize projects. Igenerally believe that keeping it simple and flat is beneficial more often thannot. However, if you want to further structure your resources, consider addingan additional component to your naming pattern, such as  [org_group]. Folderscan then follow  [prefix]-[org-group] pattern.GCP also allows configuring Project Name. I recommend to set this to the same valueas Project ID and forget about it. For all the practical purposes you’llreference the Projects by their IDs.\n     There will always be exceptions where it’s not possible to follow theGlobal Naming Pattern (for example resource does not allow  - in thename) or when it simply doesn’t make sense. A subset of thefull pattern should be used if possible and all exceptions documented.\n  Service accounts follow the  [resource]-[description] pattern only, as theproject is already included in the part after  @ and therefore there’s no needto repeat that bit,\n   This is a complex topic, perhaps for another article, but you should establish anaming convention for groups and a strategy on how to assign permissions. As arule of thumb, never assign permissions directly to individuals, but to groupsonly.\n  You should also cover the use of labels (or tags). A good one is to addinformation to further categorize your resources, such as  cost-center. Labelsare also helpful in situations when you can’t manage resource names directly,but you can manage a set of labels that is propagated to the child resources (e.g.GKE Cluster labels or Instance Groups).\n Do not duplicate information already contained in your naming convention (suchas  project) or create large numbers of unique labels with information that canbe obtained from the objects themselves (such as  creationTimestamp).\n  DNS naming convention across your infrastructure is again a larger topic, but youshould definitely have one. A simple strategy can be creating a subdomain for eachGCP project in the  [project]-[env].&lt;common_dns_domain&gt; form. DNS recordscreated for given resources should then follow the [resource]-[resource_location]-[description]-[suffix] part of the GlobalNaming pattern and therefore mirror the resource name.\n    You should establish a consistent naming convention as one of the first thingswhen you start using cloud or on a new project. It’s one of those thingsthat are really easy to do in the beginning, but much more difficult to fixlater on. And you’ll benefit from it every day.\n The key to success with naming conventions is establishing them early on andruthlessly following across your entire infrastructure. Automation helps a lot.\n As usual, there’s no silver bullet and the actual naming conventionshould always be tailored to your environment. The main point is having one! AndI hope this post gives you a head start.\n Thanks for making it all the way till here. I wouldn’t blame you if you thinkby now that I have a serious OCD (and I probably do), but try to work in anenvironment with 120 Kubernetes clusters and every single one of them namedsimply just  cluster!\n Good luck on your cloud journey and I would love to hear about your experiencewith naming things. You can follow me on @stepanstipl.", "posttime": "2021-07-24 14:45:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "命名,naming,资源", "title": "云命名约定", "title_en": "Cloud Naming Convention", "transed": 1, "url": "https://stepan.wtf/cloud-naming-convention/", "via": "", "real_tags": ["命名", "naming", "资源"]}, {"category": "", "categoryclass": "", "imagename": "e68c09f5c2d65919a50681834b1a611d.png", "infoid": 1069422, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然 Erlang 运行时以作为 Elixir 编译的高并发平台而闻名，但我们大多数人最终在日常工作中解决了相同的问题。我们使用 Phoenix 来引导我们的 Web 应用程序，编写 JSON API 并在我们的页面上撒上一些 javascript。尽管确实通过使用 Phoenix 我们已经免费获得了整个并发模型，但我们为我们的产品开发的大多数功能并没有利用所有经常分布式的 Erlang、复杂的监督树或 GenServers 队列。在这篇文章中，我的目的是强调一些常见的场景，我们可以利用 Erlang 的并发模型以及 Elixir 的抽象来构建更好、更快和更安全的软件。把它想象成……一本食谱。我们可能要解决的最简单的问题是如何进行“即发即忘”的计算。换句话说，我们如何告诉我们的系统异步执行一些代码而不关心它何时完成，也不关心结果。为此，Elixir 提供了 Task 抽象。任务是旨在在其生命周期内运行单个操作的进程。它可以是一个长期的操作，比如记录的批处理，也可以是一个短的操作，比如发送 Slack 通知。通常，运行一次性任务最简单的方法是使用 Task.start/1。但是，这是第一个提示：不要那样做。在 Elixir 中运行一次性操作的最佳方法是使用 Task.Supervisor.start_child/2 在监督树下生成任务。最好在它们自己的监督树下运行任务的主要原因是允许对进程进行适当的清理。当一个 Supervisor 被删除时，它的所有子元素也会被删除，这使您可以干净地删除应用程序。这并不意味着您希望重新启动您的任务。实际上，Task.Supervisor 的默认策略是 :temporary，这意味着它们永远不会重新启动。如果事情在某个时候变得奇怪，这只是一种避免悬空进程的方法。他们总是这样做。\ndefmodule FireAndForgetExample.Application do use Application def start(_type, _args) do children = [ # 启动OTP应用下的监督树。 {Task.Supervisor, name: FireAndForgetExample.TaskSupervisor} ] Supervisor.start_link(children, strategy: :one_for_one) endenddefmodule FireAndForgetExample.OtherModule do def process_event(event) do # 启动监督树下的任务。 Task.Supervisor.start_child(FireAndForgetExample.TaskSupervisor, fn -&gt; send_slack_notification(&quot;Hey! We got an event!&quot;) end) event |&gt; do_something() |&gt; do_something_else() endend 但是，如果我们真的关心结果呢？有时运行某个操作并忘记它是有用的，但大多数时候我们确实想对它的结果做一些事情。如果我们手头的问题是由多个操作组成的，您可以异步运行这些操作，因为它们不相互依赖，例如，将一堆文档上传到 S3，或向不同的人发送一批电子邮件，最简单的解决方案是实施扇入/扇出策略。这也可以通过使用任务来完成。我们可以在不使用主管的情况下天真地做到这一点，或者我们可以像我们之前提到的那样在主管下启动它们。我总是建议在将要交付到生产环境的代码中使用 Supervisor，但是，为了简单起见，让我们看一个没有它的例子： defmodule FanInFanOutExample do def send_notifications(notifications) do notice # Spin a task per element |&gt; Enum.map(&amp;Task.async(fn -&gt; send_single_notification(&amp;1) end) # 等待所有这些 |&gt; Enum.map(&amp;Task.await/1) end def send_single_notification(notification) do # ... endend 好的事情这种方法是它只需要最长的任务，当函数完成时，我们将有一个包含所有结果的列表。在 Elixir 1.11 中还有 Task.await_many/2，它在引擎盖下，它所做的不仅仅是简单的迭代和等待，但最终，确实让我们到达了同一个地方。我们可能遇到的另一种问题是“_How can we can run some work每隔 N 分钟/秒定期/etc.&quot;。利用 Eli 中可用的不同抽象，这是相当简单的xir 但最终在 OTP 中：GenServer。\nGenServer 是“通用服务器”的缩写。它基本上是一个可以接收消息并允许我们指定回调的过程，因此它可以对这些消息执行不同的操作。我不会详细介绍 GenServers，因为我之前已经写过关于它们的文章。那么，我们如何使用 GenServer 进行调度？简单：利用 handle_info/2 回调和 Process.send_after/3。换句话说，我们将向执行工作的 GenServer 添加一个回调，然后使用 Process.send_after/3 调度消息。最后，为了确保它在一段时间后再次运行，我们确保在回调返回之前再次调用 Process.send_after/3。让我们看看它的外观： defmodule SchedulingExample do use GenServer @default_minutes 3 def start_link(args \\\\ []) do GenServer.start_link(__MODULE__, to_map(args)) end defp to_map(args) do %{ minutes: Keyword.get( args, :minutes, @default_minutes), always: Keyword.get(args, :forever, true), } end def init(%{minutes: minutes} = state) do schedule_work(minutes) {:ok, state} end def handle_info(:work, %{minutes:minutes,forever:forever} = state) do # 在这里做我的工作...如果永远做 schedule_work(minutes) end {:noreply, state} end defp schedule_work(minutes) do milliseconds = to_milliseconds(minutes) Process.send_after(self(), :work, milliseconds) end defp to_milliseconds(minutes) do minutes |&gt; :timer.minutes() |&gt; Kernel.trunc() endend 此外，当利用 GenServers 和其他抽象流程，通常是一个很好的调用，使服务器模块具有尽可能少的业务逻辑。在这种特殊情况下，如果 GenServer 可以简单地从模块调用一个函数，我们就是黄金。通过这种方式，我们可以将流程管理与我们的业务完全分离，从而更轻松地进行测试……以及更轻松的时间。最后，我们可能也想在 Supervisor 下生成这种工作进程，但可能使用不同的策略，例如 :one_for_one，以便它们在崩溃时重新启动。在某些情况下，我们可能希望在特定时间运行我们的代码。不一定每 3 分钟一次，而是每天早上 8 点。虽然利用相同的工具完全可以实现这一点，但我会务实并推荐 Quantum。它允许您使用 cron 语法来安排函数的执行，并消除管理流程的所有复杂性。这是一个经验丰富的库，在社区内被广泛采用，非常轻巧......而且非常简单。有时，您会发现自己有一个端点，该端点的查询时间太长，或者一个过程必须始终处理大量数据并提供糟糕的用户体验。在这些情况下，有时缓存结果可能是有意义的。有时，花几个小时调整查询本身或重新设计解决方案可能更有意义，但有时缓存可能更有意义。让我们谈谈它什么时候出现。\n如果您已经使用过 Elixir 或 Erlang，您就会知道它的数据结构是不可变的，但是，它有自己的方式来处理共享的可变状态：进程。为了保存一些状态，访问它并更改它，我们可以通过一个进程以多种不同的方式来做到这一点。保持某种状态的最简单的解决方案是创建一个代理。代理是围绕状态的最简单的抽象，有时，如果我们需要的是一个没有太多电池的简单解决方案，它实际上可能是最好的选择。 Agents 的一个好处是它是一个单一进程，这意味着许多并发客户端将依次获得它们的 Agent 份额，这意味着您不必担心竞争条件。另一方面，如果它开始成为瓶颈，那也可能是一件坏事。其他时候，如果特工没有为你剪断它，你可能会更快一些。在这些情况下，ETS 可能是一个不错的选择。 ETS 的好处是它总是更快，因为它不通过 Erlang 调度器，此外它还支持并发读取和写入，而代理不支持。但是，当您想要进行原子操作时，它会受到更多限制。总的来说，它非常适合简单的共享键/值存储，但是否更适合或不适合您的特定问题，这取决于您。一个简单的方法可能如下所示： defmodule EtsCacheExample do def init!(seed, table_name) when is_atom(table_name) do case :ets.info(table_name) do :undefined -&gt; :ets.new(table_name, [:set , :public, :named_table]) _ -&gt; 引发“名称为 #{table_name(pool_name)} 的 ETS 表已经存在。” end add(seed, pool_name) end def teardown(table_name) do :ets.delete(table_name) end def add(value, table_name) do :ets.insert_new(table_name, {value}) end def exists?(value, pool_name) do case :ets.lookup(table_name, value) do [] -&gt; false _ -&gt; true end end def retrieve_all(table_name) do table_name |&gt; :ets.match({:&quot;$1&quot;}) |&gt; List.flatten( ) endend 我要提到的第三个选项是 GenServers。大多数情况下，代理或 ETS 就足够了，但是，在某些情况下，为每个 API 用户提供自己的小缓存可能是有意义的。一个很好的理由可能是因为我们需要为读/写提供一定的原子性，而代理将成为瓶颈。 GenServers 的优势之一是它们允许我们非常轻松地为每个用户启动一个，因此它们不会成为 Agent 的瓶颈。然而，虽然 Elixir 确实提供了使缓存变得容易的必要抽象，但我对此的建议通常是依靠社区的肩膀。例如，Saša Jurić 不久前写过 ConCache 就是这样做的，但还有很多其他的。不实现它自己的一个好处是在处理并发时有很多边缘情况，并且在最初几次很容易出错。正如他们所说，计算机科学中两个最难的问题是命名和缓存。有了这一切，我希望能够为您可能遇到的一些问题提供一些潜在的解决方案。就像 IT 中的所有问题一样，每个解决方案有时都有意义，有时却没有，但归根结底，我相信这些都是 Elixir 或 Erlang 开发人员的主要技术。 Elixir 使处理并发代码变得如此容易，大多数问题都可以解决，而无需引入第三方库。当然还有很多不能提及的内容，例如使用 gen_statem 进行状态机，或使用工作池进行节流工作，但我将留待改天再说。\n哦，最后一件事，不要忘记监督你的过程......这是免费的容错:)", "note_en": "While the Erlang runtime is known for being a highly concurrent platform to which Elixir compiles, most of us end up solving the same problems in our daily jobs. We use Phoenix to bootstrap our web applications, write JSON APIs and sprinkle our pages with some javascript. And although it is true that simply by using Phoenix we&#39;re already getting for free the whole concurrency model, the majority of the features we develop for our products don&#39;t leverage all that often distributed Erlang, complex supervision trees or fleets of GenServers.\n In this post, my intention is to highlight some common scenarios where we can leverage Erlang&#39;s concurrency model as well as Elixir&#39;s abstractions to build better, faster and more secure software. Think of it like... A cookbook.\n  The easiest problem we may have to solve is how to do a &#34;fire and forget&#34; computation. In other words, how can we tell our system to execute some code asynchronously and not care about when it finishes, nor the result. To do this Elixir provides with the  Task abstraction.\n Tasks are processes meant to run a single action within their life-cycle. It can be a long-lived operation, like batch processing of records, or a short one, like sending a Slack notification.\n Usually, to run a one-off task the easiest thing is to use  Task.start/1. However, here is the first tip: don&#39;t do that. The best way to run a one-off action in Elixir is to spawn the tasks under a supervision tree, with  Task.Supervisor.start_child/2.\n The main reason why it&#39;s preferable to run tasks under their own supervision tree is to allow for a proper clean-up of processes. When a Supervisor is taken down, so are all its children, which allows you to take down the application cleanly.\n This doesn&#39;t mean that you want your tasks to be restarted. In fact, the default strategy for the  Task.Supervisor is  :temporary, which means they&#39;re never restarted. It&#39;s just a means to avoid dangling processes if things go weird at some point. And they always do.\n  defmodule FireAndForgetExample.Application do use Application def start(_type, _args) do children = [ # Start the supervision tree under the OTP Application. {Task.Supervisor, name: FireAndForgetExample.TaskSupervisor} ] Supervisor.start_link(children, strategy: :one_for_one) endenddefmodule FireAndForgetExample.OtherModule do def process_event(event) do # Start the task under the supervision tree. Task.Supervisor.start_child(FireAndForgetExample.TaskSupervisor, fn -&gt; send_slack_notification(&#34;Hey! We got an event!&#34;) end) event |&gt; do_something() |&gt; do_something_else() endend\n  However, what if we do care about the results? Sometimes it&#39;s useful to run a certain operation and forget about it, but most times we actually do want to do something with its result.\n If the problem we have at hand is one which consists of multiple operations which you can run asynchronously because they don&#39;t depend on each other, like for example, uploading a bunch of documents to S3, or sending a batch of emails to different people, the easiest solution is to implement a  fan-in/fan-out strategy.\n This can be done by using tasks too. We can do it naively without using a Supervisor or we can spin them up under a Supervisor as we&#39;ve mentioned before. I always recommend using a Supervisor in code that is going to be shipped to production, however, for the sake of simplicity, let&#39;s see an example without it:\n defmodule FanInFanOutExample do def send_notifications(notifications) do notifications # Spin a task per element |&gt; Enum.map(&amp;Task.async(fn -&gt; send_single_notification(&amp;1) end) # Await all of them |&gt; Enum.map(&amp;Task.await/1) end def send_single_notification(notification) do # ... endend\n The good thing about this approach is that it will only take as long as the the longest task, and by the time the function has finished we will have a list with all the results. In Elixir 1.11 there&#39;s also  Task.await_many/2, which under the hood, it does a little bit more than a simple iteration and an await, but in the end, does get us to the same place.\n  A different kind of problem we might come across is &#34;_How can we run some work periodically every N minutes/seconds/etc.&#34;. This is fairly simple leveraging a different abstraction available in Elixir but ultimately in OTP: the  GenServer.\n GenServer is short for a &#34;Generic Server&#34;. It&#39;s basically a process that can receive messages and allows us to specify callbacks so it does different things with those messages. I won&#39;t go very much into detail about GenServers because  I already wrote about them a while back.\n So, how do we do the scheduling with a GenServer? Simple: by leveraging the  handle_info/2 callback and  Process.send_after/3. In other words, we will add a callback to the GenServer which does the work and then schedule the message with  Process.send_after/3. Lastly, to make sure it runs again after some time, we make sure to call  Process.send_after/3 again before the callback returns. Let&#39;s see how it looks:\n defmodule SchedulingExample do use GenServer @default_minutes 3 def start_link(args \\\\ []) do GenServer.start_link(__MODULE__, to_map(args)) end defp to_map(args) do %{ minutes: Keyword.get(args, :minutes, @default_minutes), forever: Keyword.get(args, :forever, true), } end def init(%{minutes: minutes} = state) do schedule_work(minutes) {:ok, state} end def handle_info(:work, %{minutes: minutes, forever: forever} = state) do # Do my work here ... if forever do schedule_work(minutes) end {:noreply, state} end defp schedule_work(minutes) do milliseconds = to_milliseconds(minutes) Process.send_after(self(), :work, milliseconds) end defp to_milliseconds(minutes) do minutes |&gt; :timer.minutes() |&gt; Kernel.trunc() endend\n Also, when leveraging GenServers and other abstractions over processes, it&#39;s usually a good call to keep the server module with as little business logic as possible. In this particular case, if the GenServer can simply call a function from a module, we&#39;re golden. This way we can decouple completely process management from our business, allowing for easier testing... And an easier time.\n Lastly, we probably want to spawn this kind of worker processes under a Supervisor too, but probably with a different strategy, like a  :one_for_one, so they&#39;re restarted in case they crash.\n  In some cases, we might want to run our code at specific times. Not necessarily  every 3 minutes, but  every day at 08.00AM. While this is perfectly achievable leveraging the same tools, I&#39;ll be pragmatic and recommend  Quantum. It allows you to schedule the execution of functions with a cron syntax and takes away all the complexity of managing processes. It&#39;s a seasoned library, widely-adopted within the community, very lightweight... And extremely simple.\n  Occasionally you will find yourself with an endpoint that that makes queries that take too long or a process which consistently has to crunch a lot of data and provides a bad user experience. In these situations  sometimes caching the results may make sense. Sometimes it might make more sense to spend a few hours tweaking the queries themselves or redesigning the solution, but sometimes caching might make sense. Let&#39;s talk about when it does.\n  If you&#39;re already experienced with Elixir or Erlang, you&#39;ll know that its data structures are immutable, however, it has its own way to work with the shared mutable state: processes. In order to save some state, access it and change it, we can do so with a process and in many different ways.\n The most simple solution for holding some state is creating an  Agent. Agents are the simplest possible abstraction around the state, and sometimes, if what we need is precisely a simple solution without too many batteries, it might actually be the best option. One of the good things about Agents is that it is a  single process, which means that many concurrent clients will get their share of the Agent sequentially, which means you don&#39;t have to worry about race conditions. On the other hand, that can also be a bad thing if it starts becoming a bottleneck.\n  Other times, if the Agent doesn&#39;t cut it for you, you might something faster. In these cases  ETS might be a good option. The good thing about ETS is that it will always be faster because it doesn&#39;t go through the Erlang Scheduler, furthermore it also supports concurrent reads and writes, which the Agent does not. However, it&#39;s a bit more limited when you want to do atomic operations. Overall it&#39;s very well suited for a simple shared key/value store, but if it&#39;s better suited or not for your specific problem, that&#39;s up to you. A naive approach could look something like the below:\n defmodule EtsCacheExample do def init!(seed, table_name) when is_atom(table_name) do case :ets.info(table_name) do :undefined -&gt; :ets.new(table_name, [:set, :public, :named_table]) _ -&gt; raise &#34;ETS table with name #{table_name(pool_name)} already exists.&#34; end add(seed, pool_name) end def teardown(table_name) do :ets.delete(table_name) end def add(value, table_name) do :ets.insert_new(table_name, {value}) end def exists?(value, pool_name) do case :ets.lookup(table_name, value) do [] -&gt; false _ -&gt; true end end def retrieve_all(table_name) do table_name |&gt; :ets.match({:&#34;$1&#34;}) |&gt; List.flatten() endend\n  The third option I&#39;m going to mention is GenServers. Most of the times either the Agent or ETS should be enough, however, in some cases it might make sense to provide each API user with its own little cache. A good reason could be because we need to provide certain atomicity for the read/writes and an Agent would be a bottleneck. One of the strengths of GenServers is that they allow us to spin one up per user very easily, so they don&#39;t become a bottleneck where the Agent does.\n  However, while Elixir does provide the necessary abstractions to make caching easy, my recommendation on this one is usually to lean on the community&#39;s shoulders. Saša Jurić, for example, wrote a while back  ConCache which does exactly this, but there are many others out there. The good thing about not implementing one it&#39;s own is that there are many edge cases when dealing with concurrency and it&#39;s easy to get it wrong the first few times. As they say, the two hardest problems in computer science are naming and caching.\n  With all this, I hope to have shed some light in some potential solutions to some of your maybe problems. Like all problems in IT, every solution sometimes makes sense and sometimes it does not, but at the end of the day, I believe that these are all staple techniques within any Elixir or Erlang developer. Elixir makes it so easy to work with concurrent code that most problems can be tackled without the need to bring a third-party library. There are of course more than could be mentioned, like using   gen_statem for state machines, or worker pools for throttling work, but I&#39;ll leave those for another day.\n Oh, and one last thing, don&#39;t forget to supervise your processes... It&#39;s fault-tolerance for free :)", "posttime": "2021-07-24 14:45:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "实用,practical,可能", "title": "Elixir：实用并发食谱", "title_en": "Elixir: Practical Concurrency Cookbook", "transed": 1, "url": "https://functional.works-hub.com/learn/elixir-practical-concurrency-3794f", "via": "", "real_tags": ["实用", "practical", "可能"]}, {"category": "", "categoryclass": "", "imagename": "3865165d6ee836dcda8563d9e172c2d5.jpg", "infoid": 1069421, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sweetch 的创始人 Yossi Bahagon 将公司的数字提醒方法描述为人工智能和情商的混合体。该应用程序将使用人工智能来分析通过智能手机获取的“生命印记”数据。然后，它会在您可能更有可能回应的时候，以鼓励合规的“语气”传递信息。例如，如果您在周一 12 点到 3 点之间开会，但仍想进行一些锻炼，Sweech 不会建议在这些时间进行锻炼，或者让您因坐在会议上而不是参加会议而感到羞耻。 “这是关于持续的超个性化参与，它增加了患者做 [他们需要] 做的事情的可能性，”巴哈贡说。周一，Sweetch 宣布了由 Entreé Capital 领投的 2000 万美元 A 轮融资。其他投资者包括 Noaber、Kortex Ventures、Insurtech VC、Fin TLV Ventures 以及现有投资者 Philips、OurCrowd 和 Qure Ventures。 Bahagon 是一名受过培训的家庭医生，但他职业生涯的大部分时间都在数字健康领域度过。 2008 年，Bagahon 创立了 Clalit Health Services 的数字健康部门，这是一家非营利性保险和医疗服务提供商，目前为 60% 的以色列人口提供保险。他之前的公司 Luminox Health 于 2016 年被以色列投资者平台 OurCrowd 收购，Bahagon 继续管理该基金的数字健康部门。 Sweetch 成立于 2013 年，是 Bahagon 的另一个数字健康企业——这次旨在提高患者的依从性。该应用程序已经引起了一些兴趣，并且是从 400 多个参与拜耳 G4A 计划中选出的五个应用程序之一，类似于制药巨头开发的加速器。到目前为止，Sweetch 首席执行官 Yoni Nevo 表示该应用程序拥有“数万用户”（该公司不会提供具体数字）。\n它目前被用于患有心血管疾病、糖尿病、肥胖症、高血压、类风湿性关节炎、炎症性肠病的患者，并且与其他患者有所不同：乳腺癌治疗。 Sweetch 不是为用户在应用商店随意下载而设计的（你可以下载它，但没有访问码就无法下载）；相反，他们的上市战略是与医疗保健组织、制药公司、付款人或供应商合作。然后提供者可能会在实际治疗的同时开出 Sweetch，以鼓励他们坚持下去。有证据表明，人们并不总是听从医生的命令——尤其是在慢性病方面。疾病预防控制中心 2017 年的一份报告指出，在美国开出的处方中有五分之一从未填写过，多达 50% 的药物被错误服用（在错误的时间、错误的剂量等）。然而，提高患者依从性是一个更复杂的问题。 CDC 报告概述了一些解决方案——其中一些与医疗保健系统的关系比与健康技术的关系更大。其中包括降低用药的经济障碍，增加基于团队的医疗保健（例如，您的药剂师和医生协调处方药），以及首先增加获得医疗保健的机会。该报告确实强调了健康信息技术帮助解决违规问题的途径（它特别提到了电子处方软件）。像斯威奇一样，科技公司只有在自身没有不合规问题的情况下才能解决医学上的不合规问题。为此，Bahagon 表示该应用程序有用户留存记录。 “即使在 24 个月之后，我们仍然看到大约 45% 开始使用该系统的患者继续使用它，”他说。用户留存对任何应用开发者来说都是一个好兆头。但在健康领域，情况更为复杂。一些研究表明，消费者评分并不是这些应用程序在改善结果方面效果如何的糟糕标志（您可能喜欢并使用某个应用程序，但它不会让您变得更健康）。\n在这方面，斯威奇确实有一项试验，在约翰霍普金斯临床研究网络的两个地点进行。该应用程序在三个月内对 55 名患有前驱糖尿病的成年人进行了测试。 47 名参与者完成了试验，平均而言，他们平均增加了 2.8 MET 小时的体力活动（他们可能实际上锻炼了更短的时间，但他们的强度相当于 2.8 小时的工作），并减掉了约 1.6 公斤。用户还降低了他们的 A1c 水平，这是衡量平均血糖的关键指标。糖尿病前期成人的 A1c 通常在 5.7% 到 6.5% 之间，而本试验中的人将其 A1c 水平降低了约 0.1%（该研究将这种降低称为“具有临床意义”。）该研究并未专门将 Sweetch 与任何其他糖尿病前期干预措施。但是，即将对此进行研究。在 2020 年 12 月的一次采访中，巴哈贡指出，斯威奇已获得美国国立卫生研究院的资助，以继续测试斯威奇与其他糖尿病“黄金标准”干预措施的对比。 Nevo 和 Bahagon 没有提供该项目的具体更新，但指出“大约一个月后”该公司可能会宣布 NIH 资金和即将进行的随机对照试验的更新。与此同时，该公司计划利用 A 轮融资扩展到美国和巴西的市场，扩大用户群并增强平台，为更多条件提供具体和量身定制的建议。", "note_en": "Yossi Bahagon, the founder of Sweetch, describes the company’s approach to digital reminders as a mixture of artificial intelligence and emotional intelligence. The app will use AI to analyse “lifeprint” data picked up through a smartphone. Then it delivers messages to when you might be more likely to respond to them and in a “tone of voice” that encourages compliance.\n For instance if you have meetings on Mondays between 12 and 3, but still want to get in some exercise, Sweetch won’t suggest getting a workout in during those times, or shame you for sitting through a meeting rather than getting a run in.\n  “It’s about ongoing hyperpersonalized engagement that increases the likelihood of the patient doing what [they need] to do,” says Bahagon.\n On Monday, Sweetch announced a $20 million Series A round led by Entreé Capital. Other investors include Noaber, Kortex Ventures, Insurtech VC, Fin TLV Ventures and existing investors Philips, OurCrowd and Qure Ventures.\n Bahagon is a family physician by training, but he’s spent the majority of his career in the digital health arena. In 2008 Bagahon founded the digital health division of Clalit Health Services, a nonprofit insurance and medical services provider that currently insures  60% of the Israeli population. His previous company, Luminox Health, was acquired by Israeli investor platform OurCrowd in 2016, and Bahagon stayed on to manage the fund’s digital health arm.\n Sweetch, which was founded in 2013, is yet another digital health venture for Bahagon — this time aimed at increased patient compliance. The app has already generated some interest and was one of five apps selected from over 400 to participate in the  Bayer G4A program, something like an accelerator developed by the pharmaceutical giant.\n So far, Sweetch CEO Yoni Nevo says the app has “tens of thousands of users,” (the company would not provide a specific number).\n It’s currently being used in patients with cardiovascular diseases, diabetes, obesity, hypertension, rheumatoid arthritis, inflammatory bowel disease, and, in a bit of a departure from the rest: breast cancer treatment.\n Sweetch isn’t designed for users to download at will on the app store (you can download it, but won’t get far without an access code); their go-to-market strategy is instead to partner with healthcare organizations, pharma companies, payers or providers. Then providers might prescribe Sweetch alongside the actual treatment to encourage them to stick with it.\n There is evidence that people don’t always follow doctors’ orders — particularly when it comes to chronic conditions.  One 2017 report from the CDC notes that one in five prescriptions written in the United States are never filled, and up to 50% of medicines were taken incorrectly (at the wrong time, wrong dose, etc.).\n Improving patient compliance, though, is a more complicated problem. The CDC report outlined a few solutions — some of which have more to do with the healthcare system than they do with health tech. Those include lowering economic barriers to medication, increasing team-based healthcare (your pharmacist and doctor coordinating prescription refills, for instance), and increasing access to healthcare in the first place.\n The report does highlight an avenue for health information technology to help address the noncompliance problem (it specifically mentions e-prescribing software).\n Tech, like Sweetch, can only address the noncompliance problem in medicine if it doesn’t have a noncompliance problem of its own. To that end, Bahagon says the app has a record of user retention. “Even after 24 months, we still see around 45% of the patients that started using the system continue to use it,” he says.\n User retention is a good sign for any app developer. But in the health space, it’s more complicated. Some studies  suggest that consumer ratings are poor markers of how well these apps work to improve outcomes (you might like an app and use it, but it doesn’t make you any healthier).\n In that regard, Sweetch does  have a trial under its belt, conducted at two sites in the Johns Hopkins Clinical Research Network.\n The app was tested on 55 adults with prediabetes over the course of three months. Forty-seven of the participants finished the trial, and on average, they increased their physical activity by an average of 2.8 MET-hours (they may have actually exercised for shorter periods, but their intensity was the equivalent of 2.8 hours of work), and lost about 1.6 kilograms.\n The users also lowered their A1c levels, a key measure of average blood sugar. Prediabetic adults usually have an A1c  between 5.7 and 6.5 percent, and those in this trial reduced their A1c levels by about .1% (the study refers to that reduction as “clinically meaningful.”)\n This study didn’t specifically compare Sweetch to any other prediabetes interventions. However, a study on that is upcoming. In  a December 2020 interview, Bahagon noted that Sweetch had received a grant from the National Institutes of Health to continue testing Sweetch against other “gold standard” interventions for diabetes.\n Nevo and Bahagon didn’t provide concrete updates on the project, but noted that “in a month or so” the company may announce updates on the NIH funding and upcoming randomized controlled trials.\n In the meantime, the company plans to use the Series A funding to expand into markets in the U.S. and Brazil, grow the user base and enhance the platform to provide specific and tailored recommendations for even more conditions.", "posttime": "2021-07-24 14:08:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,开发,entre,led,sweetch", "title": "Sweetch 开发了一款 AI 驱动的应用程序，旨在提高患者的依从性和改善健康结果，筹集了 2000 万美元的 A 轮融资，由Entreé Capital 领投", "title_en": "Sweetch, which has developed an AI-powered app that aims to increase patient compliance and boost health outcomes, raises $20M Series A led by Entreé Capital", "transed": 1, "url": "https://techcrunch.com/2021/07/19/switch-raises-20m-for-a-personalized-engagement-system-designed-to-boost-health-outcomes/", "via": "", "real_tags": ["程序", "开发", "entre", "led", "sweetch"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069420, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个小时左右的时间里，您将学习如何以凯尔特人或阿拉伯语的方式绘制结，就像在发光的圣经或可兰经（如凯尔斯之书或漂亮的部落纹身）中绘制的那样。可以打印的海报 如果您是老师，我们邀请您在课堂上效仿这种方法，请打印此海报作为该方法的参考。", "note_en": "In an hour or so, you will learn how to draw knotwork, in the Celtic or the Arabic manner, like those in illuminated bibles or corans such as the Book of Kells or the nice tribal tatoos.\n    Poster you can print    If you are a teacher, you are invited to emulate this method in your classroom, print this poster as a reference of the method.", "posttime": "2021-07-24 14:08:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "celtic,方法", "title": "凯尔特结（2019）", "title_en": "Celtic Knotwork (2019)", "transed": 1, "url": "http://www.entrelacs.net/-Celtic-Knotwork-The-ultimate-", "via": "", "real_tags": ["celtic", "方法"]}, {"category": "", "categoryclass": "", "imagename": "ced2d753aeacbb693d905cb94b5f29fb.jpg", "infoid": 1069419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿拉斯加渔民沙丘兰卡德一生都在寻找大海——为了食物、工作和目的。 “我从五岁开始钓鱼，”来自铜河三角洲的土著团体 Athabaskan Eyak 社区的成员兰卡德说。 “除了海洋，我真的没有任何技能。”兰卡德出生于 1959 年，同年阿拉斯加成为一个州，他目睹了各种自然和人为灾难——包括原住民传统捕鱼生活方式的商品化——破坏了他的工业和家园。 “作为一名土著渔民，我已经看到了这一切，”他说。 1964 年，一场 9.2 级的大地震，恰如其分地称为 1964 年阿拉斯加大地震，引发了海啸，造成 130 多人死亡并摧毁了渔业。整整 25 年后，一艘埃克森瓦尔迪兹油轮撞上了威廉王子湾的布莱礁，将 1080 万加仑原油喷入大海。泄漏影响了 1,300 英里的水域和海岸线，其中大部分仍被认为正在恢复中。现在，阿拉斯加渔民正面临另一个紧迫的问题。阿拉斯加已经感受到气候变化的影响，因为变暖的海洋对磷虾、野生海带森林、鲑鱼和鸟类的生态系统造成了严重破坏。这是 1989 年石油泄漏造成的挥之不去的损失之上的全部。在埃克森美孚漏油事件之前，Sound 的春季鲱鱼运回国内的总量超过 200,000 吨。如今，每年仅返回 4,000 吨。兰卡德最近在连续几个糟糕的季节之后卖掉了他的捕鱼许可证。为了帮助减轻变暖水域的影响，兰卡德现在正在采用一种称为再生海洋养殖的方法，该方法涉及在小型水下花园中种植海藻和贝类。兰卡德曾经是一名商业渔民，现在主要养殖海带。 “阿拉斯加一直以提取为基础。我们是一个自然资源开采州，”Lankard 说。 “再生海洋农业所做的是创造一种新的再生经济，它基于保护、恢复和缓解，而不是更多的资源开采。”再生海洋养殖的新兴概念是由加拿大商业渔民转为海洋农民的 Bren Smith 提出并命名的。他认为海洋养殖是未来的新养殖模式。\n在 1990 年代离开白令海的商业渔船前往鲑鱼养殖场工作后，史密斯很快对养殖场固有的单一养殖感到沮丧。他说，水产养殖被吹捧为解决过度捕捞的方法，但同样具有破坏性。史密斯对渔业感到失望，开始寻找一种更可持续的海洋工作方式。他前往长岛海峡，那里有一项计划向 40 岁以下的年轻商业渔民出租贝类捕捞场。他租了 20 英亩的水域，自 2005 年以来，他一直在康涅狄格州的顶针岛海洋农场养殖牡蛎、贻贝和海带. 在那里，史密斯努力磨练他的可持续海洋养殖模式——他在他的詹姆斯·比尔德获奖回忆录《像鱼一样吃》中记录了这一旅程。 “海洋作为农业空间有什么独特之处？当你停下来问这个问题时，就变得很容易了，”史密斯说。 “海洋就像你为什么不种植不会游走也不需要喂食的东西？当你这样看海洋时，我们可以种植数百种贝类和数千种植物。这开辟了整个农业的前沿。”渐渐地，史密斯将该农场转变为该国首批 3D 海洋农场之一，该农场利用垂直水柱来种植各种物种。混养模式允许农民生产贻贝、牡蛎、蛤蜊、扇贝和海带，它们吸收的碳是陆地植物的五倍。它不需要任何灌溉、杀虫剂或肥料。由于农场的组件是垂直堆叠的，这一切都可以通过较小的水下足迹来完成。 “没有围栏、没有野生鱼饲料、没有抗生素，这意味着农民的开销更低，”史密斯解释说。 “你不需要太多的结构，用脚手架、绳索和浮标就可以做到。”海带富含钾、铁、钙、纤维、碘和其他维生素，被厨师和消费者视为美味、营养的超级食品。它可以收获并转化为海带泡菜、海带芥末、海带扁面条、海带冰淇淋和海带狗零食。但海带也用于制造非食品产品，如植物肥料，有助于减少陆上农业的氮流失。虽然史密斯最初将他的方法称为 3D 海洋养殖，但他最近决定使用“再生海洋养殖”这个词来描述它，其灵感来自“在陆地上注意兄弟”，他说。 “我们希望在土壤和海洋之间建立这种联系。”\n2014 年，Smith 和 Emily Stengel 创立了 GreenWave，这是一个帮助其他海洋农民复制可再生海洋养殖模式的非营利组织。 “激情社区是巨大的，但实践社区仍然很小，”史密斯说。今天，全国约有 50 名可再生海洋养殖者。 GreenWave 的目标是在未来 10 年内培训 10,000 名农民。 “我们必须在十年内完成 10,000 年的学习，”史密斯补充道。 “这是我们做正确的事情并在海洋中建造强大而美丽的东西的机会。”位于罗德岛海岸 12 英里处的 Block Island 贝类养殖场和 Block Island Kelp 的所有者凯瑟琳·帕克特 (Catherine Puckett) 是这些新的再生海洋养殖者之一。 Puckett 在当地被称为“Oyster Wench”，她在 2018 年在她的业务中添加了海带。在此之前，她只生产牡蛎、扇贝和蛤蜊。 “你不必担心给它浇水或施肥。它在冬天生长，所以在淡季你仍然有一些事情发生，“她说。 “太值得了。”在缅因州，马修·莫雷蒂和他的父亲加里在他们的农场 Bangs Island Mussels 种植贻贝和海带。莫雷蒂说，将它们一起种植对贻贝产生了重大影响。 “它们变得更大更快，”他说。再生海洋养殖模式对环境产生了巨大影响。 “这是我们针对全球规模的气候变化问题仅有的本地规模解决方案之一，”莫雷蒂补充道。回到阿拉斯加，兰卡德期待着让土著人民参与海洋养殖。他现在是 GreenWave 的董事会成员，并且是土著保护协会的主席和创始人，在那里他与阿拉斯加的 21 个部落合作，帮助他们为社区创造一个有弹性的未来。兰卡德说，海带养殖场是未来的重要组成部分，他将其视为“将财富带回我们的村庄”的一种方法。他自己的海带养殖场利润丰厚，足以让他有可能购买附近的牡蛎养殖场，并将其转变为混合养殖系统。 “我在海洋中的生活非常好，”他说，“所以我觉得现在是我回馈海洋的时候了。”", "note_en": "For all his life, Alaskan fisherman Dune Lankard has looked to the sea—for food, work and purpose. “I started fishing when I was five,” says Lankard, a member of the Athabaskan Eyak community, an Indigenous group from the Copper River Delta. “I really don’t have any skills beyond the ocean.”\n Born in 1959, the same year Alaska became a state, Lankard has witnessed various natural and man-made disasters—including the commoditization of Indigenous peoples’ traditional fishing way of life—that have disrupted his industry and homeland. “As an Indigenous fisherman, I’ve seen it all,” he says.\n In 1964, a massive magnitude 9.2 earthquake, fittingly called the Great Alaska Earthquake of 1964, triggered a swell of tsunamis that killed more than 130 people and devastated fisheries. Exactly 25 years later, an Exxon Valdez oil tanker struck Bligh Reef in the Prince William Sound, spewing 10.8 million gallons of crude oil into the sea. The spill affected 1,300 miles of water and coastline, much of which is still considered to be in recovery.\n Now, Alaskan fishermen are facing another urgent problem. Alaska is already feeling the effects of climate change, as the warming oceans have wreaked havoc on ecosystems of krill, wild kelp forests, salmon and birds. That’s all on top of the lingering losses caused by the 1989 oil spill. Before the Exxon spill, the Sound’s spring run of herring totalled more than 200,000 tons returning home. Today, there are only 4,000 tons returning annually. Lankard recently sold his fishing permit after several consecutive bad seasons.\n  To help mitigate the effects of warming waters, Lankard is now embracing an approach known as regenerative ocean farming, which involves growing seaweed and shellfish in small underwater gardens. Once a commercial fisherman, Lankard now mostly farms kelp.\n “Alaska has always been based on extraction. We’re a natural resource extraction state,” says Lankard. “What regenerative ocean farming does is create a new regenerative economy that’s based on conservation, restoration and mitigation, as opposed to more extraction of resources.”\n The burgeoning concept of regenerative ocean farming was developed and named by Bren Smith, a Canadian commercial fisherman turned ocean farmer. He believes ocean farming is the new farming model of the future.\n After leaving commercial fishing boats in the Bering Sea in the 1990’s to work on salmon farms, Smith quickly grew disheartened by the farms’ inherent monoculture. Aquaculture was touted as a solution to overfishing, he says, yet was just as destructive.\n Disillusioned by the fishing industry, Smith set out to find a more sustainable way to work with the seas. He made his way to Long Island Sound, where there was a program to lease shellfishing grounds to young commercial fishermen under 40. He leased 20 acres of water, where he’s been raising oysters, mussels and kelp on   Thimble Island Ocean Farm  in Connecticut since 2005. There, Smith worked to hone his sustainable ocean farming model—a journey he chronicled in his James Beard Award-winning memoir,    Eat Like a Fish .\n “What’s unique about the ocean as an agricultural space? When you stop and ask that question it becomes so easy,” says Smith. “The ocean’s like why don’t you grow things that don’t swim away and don’t have to feed? When you look at the ocean that way, there are hundreds of kinds of shellfish, and thousands of plants we can grow. That opens up a whole frontier of agriculture.”\n  Gradually, Smith transitioned the farm into one of the country’s first 3D ocean farms, which utilizes a vertical water column to grow a variety of species. The polyculture model allows farmers to produce mussels, oysters, clams, scallops and also kelp, which soaks up five times more carbon than land-based plants. And it doesn’t require any irrigation, pesticides or fertilizer. As the farm’s components are stacked vertically, this can all be done with a small underwater footprint.\n “There are no pens, no wild fish feed, no antibiotics, which means lower overhead for the farmers,” explains Smith. “You don’t need much structure, and can do it all with scaffolding and ropes and buoys.”\n Kelp, which is loaded with potassium, iron, calcium, fiber, iodine and other vitamins, is catching on with chefs and consumers as a tasty, nutritious superfood. It can be harvested and transformed into kelp pickles, kelp mustards, kelp linguine, kelp ice cream and kelp dog treats. But kelp is also used to make non-food products like plant fertilizer that helps reduce nitrogen run-off from land-based farming.\n Though Smith initially called his approach 3D ocean farming, he’s recently settled on using the phrase “regenerative ocean farming” to describe it, inspired by “watching out brethren on land,” he says. “We want to create that link between soil and sea.”\n In 2014, Smith and Emily Stengel founded   GreenWave , a nonprofit organization that helps other ocean farmers replicate the regenerative ocean farming model. “The community of passion is huge, but the community of practice is still quite small,” says Smith. Today, there are around 50 regenerative ocean farmers across the country. GreenWave’s goal is to train 10,000 farmers in the next 10 years. “We have to do 10,000 years of learning in a decade,” Smith adds. “This is our chance to do right and build something powerful and beautiful and just out in the ocean.”\n Catherine Puckett, the owner of   Block Island Shellfish Farm &amp; Block Island Kelp  that’s located 12 miles off the coast of Rhode Island, is one of those new regenerative ocean farmers. Known locally as “Oyster Wench,” Puckett added kelp to her operations in 2018. Before then, she produced only oysters, scallops and quahog clams. “You don’t have to worry about watering it or fertilizing it. It grows in the winter time, so you still have something going on in the off season,” she says. “It’s so worth it.”\n In Maine, Matthew Moretti and his father Gary grow mussels and kelp at their farm,   Bangs Island Mussels . Growing them together has had a significant impact on the mussels, according to Moretti. “They grow bigger and faster,” he says. And the regenerative ocean farming model has a tremendous impact on the environment. “It’s one of the only local scale solutions that we have for the global scale problem of climate change,” Moretti adds.\n Back in Alaska, Lankard is looking forward to involving Indigenous peoples in ocean farming. He now sits on GreenWave’s board of directors, and is the president and founder of the   Native Conservancy , where he works with 21 tribes across Alaska to help create a resilient future for their communities.\n Kelp farms are a major part of that future, says Lankard, who sees them as an approach “to put the wealth back into our villages.” His own kelp farm has been lucrative enough to allow him the possibility of buying a nearby oyster farm, which he’d convert into a polyculture farming system.\n “I’ve had a really good living from the ocean,” he says, “so I feel this is my time to give back to it.”", "posttime": "2021-07-24 14:07:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "养殖,ocean,海洋", "title": "海洋养殖的未来", "title_en": "The Future of Ocean Farming", "transed": 1, "url": "https://modernfarmer.com/2021/06/the-future-of-ocean-farming/", "via": "", "real_tags": ["养殖", "ocean", "海洋"]}]