[{"category": "", "categoryclass": "", "imagename": "21f4d211b9326626fd26c0c2812d7f80.png", "infoid": 1028863, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在程序中编写了如此之多的函数，以至于它们不知不觉就成了我们的第二天性。就像蚁群中的蚂蚁一样，它们的数量之多超出想象，它们聚集在一起形成了一些令人惊讶的复杂系统。\n它回避了一个问题：我们如何编写好的函数？这可能看起来微不足道：毕竟它们就像蚂蚁一样。但答案中有杠杆作用：正确的决策会在整个代码库中成倍增加，并形成伟大的设计。\n我认为有三个关键的想法可以用来制作良好的功能。我想和你分享它们。\n让我们从一个例子开始。我们有一个应用程序，我们想以JSON格式导出一些数据。下面是它的函数可能是什么样子：\n函数exportFile(){setLoding(True)；try{const data=getData()；//[data，data，data]const exportableData=toExportableData(Data)；//exportableData const jsonStr=JSON.stringify(ExportableData)；//&#39；{&#34；data&#34；：{...。Const fileURL=saveFile(&#34；export.json&#34；，jsonStr)；//https://foo.com/export.json设置文件URL(FileURL)；}最终{setLoadding(False)}}。\n看起来很简单：要导出为JSON，我们首先要获得数据。现在，此数据可能包含一些敏感信息，因此我们将其清理并转换为可导出的数据；ExportableData。一旦我们有了它，我们就得到一个字符串表示，保存文件，然后Badabing，Badboom，我们就完成了。\n但是生活还在继续，我们的项目需要发展。不只是导出JSON，我们还需要做更多的工作：我们还需要导出CSV文件。\n我们注意到的第一件事是，导出CSV与导出JSON非常相似。我们可以抽象exportFile吗？\n我们可以做的一件事是引入一个新标志：类似于exportFile(/*isCSV=*/true)。\n函数导出文件(IsCSV){...。Let fileURL if(IsCSV){const csvStr=toCSVStr(ExportableData)fileURL=saveFile(&#34；export.csv&#34；，jsonStr)；}Else{const jsonStr=JSON.stringify(ExportableData)；fileURL=saveFile(&#34；export.json&#34；，jsonStr)；}...。\n通过引入该标志，我们可以有条件地生成不同的fileURL：一个用于CSV，一个用于JSON。这样，我们就可以看到抽象的第一个概念：配置。您传递一些配置，然后将其留给您的函数来决定要做什么。\n通过配置，调用者可以做的事情受到限制：他们只能提供标志。所有真正的逻辑都保存在exportFile中。这意味着函数的调用者不能疯狂地做一些不受支持的事情。这可能会给我们带来一些心灵的安宁。\n这会行得通的，但让我们考虑一下。首先，请注意，为了现在理解exportFile，我们需要同时理解CSV和JSON案例。想象一下，如果有人打开exportFile来了解它的功能：如果他们只关心JSON，那么他们现在必须理解比他们需要的更多的逻辑。任何更改CSV逻辑的人都可能最终破坏JSON。**exportFile**已经完成。\n还要注意，因为该函数的调用方只能提供标志，所以他们对您不支持的用例束手束脚。这应该会让你安心，但它肯定会让打电话的人感到沮丧。想象一下，如果他们想要支持XML，他们能做什么呢？他们必须编辑exportFile才能支持这种情况。(但愿他们不会把它编辑成类似于exportFile(isCSV，isXML)的东西--现在您手中有了不变的条件)。通过如此具体，您已经选择使您的函数不那么抽象-这当然意味着它不那么强大。**exportFile**难以扩展。\n如果您设想一个排序的功率谱，其中调用者在左侧的功率最小，而在右侧的功率最大，则配置将在左侧。您非常严格地控制调用者的操作，这会给您带来确定性，但会使您的函数变得更复杂，用处更小。\n假设您想要解决问题，并移到此频谱的右侧，您可以做什么？\n如果你看看我们写的东西，我们会注意到唯一真正不同的部分，就是获取exportData并创建一个fileURL。\n..。Const exportableData=toExportableData(Data)；//ExportableData...//*可以不同！我们需要以某种方式获取fileURL*setFileURL(FileURL)；...。\n因此，我们可以做的一件事是：我们可以提供一个函数，而不是提供一个标志：\n函数exportFile(ExportableDataToFileURL){setLoding(True)；try{const data=getData()；//[data，data，data]const exportableData=toExportableData(Data)；//ExportableData const fileURL=exportableDataToFileURL(ExportableData)setFileURL(FileURL)；}Finally{setLoding(False)}}。\n有了这个，我们就解决了我们在配置方面遇到的两个问题。现在，如果有人查看exportFile，他们不会看到关于CSV的无关代码。如果他们想要扩展到XML，他们可以简单地提供不同的功能。我们已经给了来电者更多的权力。\n我们已经进一步抽象了，但这是有代价的。首先，我们认为我们知道我们真正需要向外传递的是exportableData，而我们需要返回的是fileURL。如果我们错了呢？例如，有些可能需要稍微不同的数据格式-他们需要一些OtherKindOfExportableData而不是exportableData。当我们弄清楚这一点时，可能会有许多exportFile的新用法，我们在发展此功能时将不得不支持这些新用法。\n我们本可以避免这种情况的一种方法是坚持使用配置。这样，任何想要支持某些东西的人都必须通过这个函数，这会让我们有时间思考最好的抽象是什么。\n另一种方式是，如果该函数被进一步抽象，这样调用者就可以很容易地支持某些OtherKindOfExportableData。\n反转比配置更强大，但它不是最强大的方法。这可能是一个很好的选择，但您可能会冒着过于强大而暴露错误的风险，或者不够强大并限制调用者的风险。\n我们知道不太强大的选项：配置。最强大的会是什么样子呢？\n我们可能会注意到的下一件事是，我们的exportFile函数实际上构建了一些构建块，这些构建块可能对许多不同的事情有用。例如，许多函数可能需要加载状态，或者只需要获取exportableData等。我们可以创建这些构建块：\n我们刚刚建造的积木可以有多种用途。用户可以支持CSV、XML，可以将isLoding与其他一些功能结合使用，还可以选择提供不同类型的exportableData。我们已经为用户提供了很大的动力。\n然而，缺点是，就像在倒置的情况下一样，我们会让自己容易犯很多错误。如果isLoding实际上是针对文件的，而其他事情应该使用不同的标志，那该怎么办呢？如果人们开始使用saveJSONFile，并且传递的数据实际上不是导出，该怎么办呢？这些都是我们在抽象中隐含允许的情况。\n还有一个问题：注意，在我们的第一个exportFile示例中，代码更加具体：您可以看到实际发生的情况。当代码更抽象时，就更难推断实际发生了什么。现在，获得的功率可能是值得的，但是如果您过早地进行了优化，那么您只是徒劳地付出了这个代价。这种不必要的代价的一个例子是saveJSONFile和saveCSVFile--如果我们内联了它们，总体结构仍然是抽象的，但是更容易理解。当您在这个级别抽象时，这些都是需要注意的事情。\n有了这些，我们看到构图给了我们最大的力量，但也给了我们最多的机会去搬起石头砸自己的脚。不过，孩子们，这是值得的。\n有趣的是，注意到每一种选择，支持者就是反对者。那我们该怎么选呢？我认为你可以使用的一个启发式方法是：选择你的信心所能限制的最有力的选项。例如，如果您对问题的了解较少，请停留在抽象光谱的较低端。随着您理解的更多(比如，是时候介绍XML了)，您可以发展到更强大的一面。当您非常自信，并且您可以看到构建块的良好用例时，请选择范围中最强大的一侧。", "note_en": "We write so many functions in our programs that they become second nature before we know it. Like ants in a colony, they are numerous beyond imagination and they come together to form some surprisingly complex systems.\n It begs the question: how do we write good functions? It can seem trivial: they’re just like ants after-all. But there is leverage in the answer: the right decisions multiply throughout your codebase and bubble up into great design.\n I think there are about three key ideas you can employ to craft good functions. I wanted to share them with you.\n  Let’s start with an example. We have an app, and we want to export some data in a JSON format. Here’s what a function for that could look like:\n function   exportFile () {    setLoading ( true );   try  {   const   data   =   getData ();  // [Data, Data, Data]   const   exportableData   =   toExportableData ( data );  // ExportableData   const   jsonStr   =   JSON .stringify ( exportableData );  // &#39;{&#34;data&#34;: {...   const   fileURL   =   saveFile ( &#34;export.json&#34; ,  jsonStr );  // https://foo.com/export.json   setFileURL ( fileURL );  }  finally  {   setLoading ( false )  } }\n Seems straight forward: To export as JSON, we first get our data. Now, this data may have some sensitive info, so we clean that up and transform into something exportable; ExportableData. Once we have that, we get a string representation, save the file, and badabing, badaboom, we’re done.\n   But life moves on and our program needs to evolve. Instead of just exporting JSON, we need to do more:  we also need to export a CSV file.\n  The first thing we notice, is that exporting a CSV is very similar to exporting JSON. Can we abstract  exportFile?\n  One thing we can do, is to introduce a new flag: something like  exportFile(/*isCSV=*/ true)\n function   exportFile ( isCSV ) {    ...   let   fileURL   if  ( isCSV ) {    const   csvStr   =   toCSVStr ( exportableData )   fileURL   =   saveFile ( &#34;export.csv&#34; ,  jsonStr );  }  else  {    const   jsonStr   =   JSON .stringify ( exportableData );   fileURL   =   saveFile ( &#34;export.json&#34; ,  jsonStr );  }   ...\n By introducing this flag, we can conditionally produce a different  fileURL: one for CSV and one for JSON. With that we see the first concept for abstraction: configuration. You pass some configuration, and you leave it to your function to figure what to do.\n   With configuration, the caller is limited in what they can do: they can only provide flags. All the true logic stays inside  exportFile. This means that callers of the function can’t go crazy and do something unsupported. And that could give us some peace of mind.\n  This will work, but let’s think about it. First, notice that in order to understand  exportFile now, we need to understand both the CSV and JSON case. Imagine if someone opens up  exportFile to figure out what it does: if they  only cared about JSON, they now have to understand more logic than they needed. Anyone who changes the logic for CSV, may also end up breaking JSON.  **exportFile**  has become   complected .\n Notice also, that because the caller of this function can  only provide flags, their hands are tied for use-cases that you didn’t support. This was supposed to give you peace of mind, but it certainly can frustrate callers. imagine if they wanted to support XML, what could they do? They’d have to edit  exportFile to support this case. (God forbid they edit it to be something like  exportFile(isCSV, isXML) — now you have invariant conditions on your hands). By being so specific, you’ve chosen to make your function less abstract — this of course means that it is less powerful.  **exportFile**  has become hard to extend\n  If you imagine a sort power spectrum, where the caller has the least power on the left, and most power on the right, configuration would be on the left. You control what the caller does so tightly that it gives your certainty, but makes your function more complex and less useful.\n Say you wanted to address the problems, and move to the right of this spectrum, what could you do?\n  Well, if you look at what we wrote, we can notice that the only part that is  really different, is the bit about taking  exportData, and creating a  fileURL.\n ... const   exportableData   =   toExportableData ( data );  // ExportableData ...   // *This can be different! Somehow we need to get a fileURL*  setFileURL ( fileURL ); ...\n So one thing we can do is this: instead of providing a flag, we can provide a function:\n function   exportFile ( exportableDataToFileURL ) {    setLoading ( true );   try  {   const   data   =   getData ();  // [Data, Data, Data]   const   exportableData   =   toExportableData ( data );  // ExportableData   const   fileURL   =   exportableDataToFileURL ( exportableData )   setFileURL ( fileURL );  }  finally  {   setLoading ( false )  } }\n       With this we solve both of the problems we had with configuration. Now if someone looks under the hood at  exportFile, they won’t see unrelated code about csv. If they wanted to extend to XML, they can simply provide a different function. We’ve given the caller much more power\n  We’ve abstracted further, but there is a price there. The first is, that we  think we know that what we  really need to pass outwards is  exportableData, and what we need to return is a  fileURL. What if we were wrong? For example, some may need a slightly different data format — instead of  exportableData they need  someOtherKindOfExportableData. By the time we figured that out, it’s possible that there are numerous new usages of  exportFile, which we’ll have to support as we evolve this function.\n One way we could have prevented this, is to have stuck with configuration. This way, anyone who wanted to support something would have to funnel through this function, which would give us time to think about what the best abstraction was.\n Another way, would have been if this function was abstracted even further, so callers could have easily supported  someOtherKindOfExportableData.\n  Inversion is more powerful than configuration, but it’s not the most powerful method. This can be a great choice, but you risk either being too powerful and exposing errors, or not being powerful enough and restricting callers.\n We know the less powerful option: configuration. What would the most powerful one look like?\n  The next thing we may notice, is that our  exportFile function is actually built up some building blocks that could be useful for a bunch of different things. For example, many functions may want a loading state, or just need to get  exportableData, etc. We could create those building blocks:\n   The building blocks that we just built, can be used in a myriad of ways. The user can support CSV, XML, can use  isLoading with some other function, and choose to provide a different kind of  exportableData. We’ve provided a lot of power for the user.\n  The disadvantage though, like in the case of inversion, is that we open ourselves up to a lot of mistakes. What if  isLoading was really meant for files, and other things should have been using a different flag? What if people start using  saveJSONFile, and pass data that wasn’t really an export? These are all cases that we have implicitly allowed with our abstractions.\n There’s a further problem: notice that with our first example of  exportFile, you the code was more concrete: you could see what was actually happening. When code is more abstract, it’s a bit harder to reason about what is  actually happening. Now, it can be worth it for the power gains, but if you optimized prematurely, you’re just paying this price for nothing. An example of this unnecessary price is  saveJSONFile and  saveCSVFile — if we had  inlined those, the overall composition would still be abstract but more understandable. These are the kind of things to watch out for as you abstract at this level.\n  And with that, we see that composition gives us the most power, but gives us the most opportunities to shoot ourselves in the foot. Boy can it be worth it though.\n  It’s funny to notice that with each option, the pro  is the con. So how do we pick? I think one heuristic you can use is this: pick the most powerful option you can limited by your confidence. For example, if you have a light understanding of the problem, stay on the lower side of the abstraction spectrum. As you understand more (say, time to introduce XML) you can evolve to the powerful side of the spectrum. When you’re  very confident, and you can see good use-cases for your building blocks, lean to the most powerful side of the spectrum.", "posttime": "2020-10-15 02:39:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制作,crafting,exportfile", "title": "手工制作函数", "title_en": "Crafting Functions", "transed": 1, "url": "https://stopa.io/post/251", "via": "", "real_tags": ["制作", "crafting"]}, {"category": "", "categoryclass": "", "imagename": "94cdaee00b52da30bbc5c626eeea16d4.png", "infoid": 1028862, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，我们开源了GitHub的所有产品文档，以及支持它的Node.js web应用程序。请查看我们新的公共存储库，网址为：jgithub.com/gihub/docs。\n这篇文章讲述了我们为什么要将文档开源，我们在此过程中构建和开源了哪些工具，以及我们是如何努力使项目欢迎外部贡献者的。\n开源社区喜欢创新。我们的Docs团队也很有创新精神，但数量相对较少。我们开源的docs.github.com欢迎更广泛、更多样化的人提出新的想法和贡献，就像您一样！\n我们将GitHub的产品文档开源，以帮助证明私营公司将其产品开源是可能的(也是有益的)。多年来，GitHub已经开源了数百个项目，但docs.github.com是我们迁移到开放中的第一个私人生产服务。我们希望我们的应用程序设计、自动化工作流程和对外部贡献的开放能够成为其他希望开放其私人项目并从社区协作中受益的组织的典范。\nDocs.github.com是一个国际化的网站，文档被翻译成日语、中文、西班牙语和葡萄牙语，不久将支持更多语言。与此同时，Node.js国际化工作组也在努力将Node.js文档本地化。Js项目面临许多与我们相同的挑战。他们使用GitHub存储库、GitHub Actions和Crowdin.com的本地化平台为开源社区构建工作流和工具。我们希望开源的GitHub文档对GitHub和Node.js社区互惠互利。通过合作，我们将能够更透明地共享实践、工具和工作流。@Crowdin-node和GitHub组织就是为了这个目的而存在的，那里的工具是由来自Electron、GitHub Docs和Node.js项目的人员维护的。我们目前与专业翻译人员合作，将我们的内容本地化，但我们希望最终也能向外部贡献者开放翻译过程。\n当GitHub Docs团队的成员向第三方供应商(如Fastly、Crowdin、Algolia或Heroku)提出支持请求时，我们通常会详细描述我们试图解决的问题。这一耗时的过程可能会导致在私人支持渠道中进行大量的来回沟通。既然GitHub/docs是公开回购，我们就可以直接链接到与手头事情相关的代码或GitHub问题。我们的供应商可以(并且经常这样做)克隆我们的repo，尝试解决方案，甚至打开拉请求来帮助解决问题，而不是建议我们尝试。这不仅帮助了我们的团队，而且加强了我们与供应商的关系，并留下了我们如何解决问题的公共记录，其他人可以学习。\n多年来，GitHub已经开源了许多东西，从像Electron这样的成熟平台到像GitHub Desktop和Ggh CLI这样的工具，再到像joctokit/rest.js和Soctokit.rb这样的API客户端库，以及大量的NPM软件包。我们还开源了非软件的东西，比如我们的员工知识产权协议和产品路线图。\n但GitHub/docs与GitHub开源的所有其他项目有点不同：它不是一个独立的工具或库，而是一个包含我们所有产品文档的repo，以及支持它的web应用程序。这个应用程序创建于7年多前的2013年，有着悠久而丰富多彩的历史。\nIdocs.github.com(最初是help.github.com)的第一个版本是Ruby on rails应用程序。后来使用Jekyll和Nanoc将其转换为静态站点，Nanoc是另一个Ruby静态站点生成器。如今，该网站由支持动态路由和内容呈现的Node.js web服务提供支持。\n多年来，该站点的工具发生了变化，但Jekyll站点的许多久经考验的创作惯例被保留了下来：\n在将GitHub Docs重新构建为Node.js应用程序时，我们一直在寻找机会将其不同部分开源：\n开源GitHub Docs面临的独特挑战之一是找到一种方法将所有内容公之于众，同时仍然能够私下就即将发布的产品进行协作。为此，我们决定创建两个git存储库(一个是公共的，一个是私有的)，并着手寻找一种方法来自动保持这两个库的同步。\n我们求助于GitHub Marketplace网站寻求解决方案。尽管似乎没有一种现有的工具可以满足我们的确切需求，但有一些工具接近了我们的需求：Pull是一款GitHub App，旨在自动执行经常乏味的任务，即让分叉回购与其上游回购保持同步。\n我们联系了Pull应用程序的作者魏鹤，看看他是否有兴趣与我们合作开发一个类似的应用程序，但用于双向同步repos。魏愉快地接受了挑战，我们一起着手构建Repo Sync，这是一个使用Docker、Git、shell脚本、GitHub操作和GitHub Container Registry的新开源工具。\nRepo Sync是一组灵活的GitHub操作，用于保持git存储库同步。使用按计划运行的单个操作工作流文件，我们可以保持私人和公共文档存储库的主要分支同步，而无需人工干预。\n今年早些时候，我们将help.github.com和developer.github.com合并为一个网站，名为www.docs.github.com。在此迁移之前，GitHub的所有rest API参考文档都混合了非结构化Markdown、嵌入式Ruby、液态模板和手工粘贴的卷曲输出。当GitHub的rest API在十多年前创建时，并没有结构化的文档。Github.com代码库中有自动化测试，但没有机器可读的API规范。事实证明，developer.github.com上的非结构化rest API文档是关于GitHub的rest API最接近真相的来源。\n在Ocotkit维护员Gregor Martynus和T.Redoc.ly承包商的帮助下，我们开始了一段漫长的旅程，将GitHub的REST API参考文档反向工程为机器可读和人类可编辑的OpenAPI描述文件。\n截至今年早些时候，这些OpenAPI描述现在位于github.com代码库中，用于创建、验证和测试GitHub的REST API。这些OpenAPI描述现在还用于生成新的Javascript客户端和Ruby的Ocockit客户端，并在.docs.github.com/rest上呈现新的REST API参考文档。GitHub的OpenAPI描述文件现在是开源的，可以在以下网址下载：jgithub.com/gihub/rest-api-description。\n要了解更多关于OpenAPI(最初是Swagger)的创建和GitHub最终采用它的历史，请查看我的OpenSwagger起源故事和演讲，以及我的同事在今年的API规范会议上描述了一个使用OpenAPI和Talk的10年API的文章。\nLiquid是一种开源模板语言，类似于Nunjucks或Handlebar。它是由亚马逊Shopify创建的，目的是为他们的客户提供一种安全的方式，将动态内容添加到他们的店面。Liquid是一个Ruby项目，在使用Rails或Jekyll的项目中得到了广泛采用。虽然Liquid在Ruby社区中很流行，但它仍然相对鲜为人知，很少在JavaScript生态系统中使用。我们试图找到一个NPM包来解析和呈现我们现有的液态模板，但是无法找到满足我们所有需求的完整实现。\n在这一点上，我们本可以认输并迁移到另一种模板语言，但我们喜欢我们所拥有的：我们团队的技术编写人员可以轻松地使用Liquid，而我们的工程师也不特别想承担将数千个内容文件迁移到新的模板语言这一艰巨而吃力不讨好的任务。\n我们联系了几个现有的与Liquid相关的NPM包的作者，在许多贡献者的帮助下，我们能够弃用几个旧的和未维护的包，将Liquid-node重新命名为Liquid，将其代码库从CoffeeScript转换为JavaScript，并改进其测试和文档。\n我们喜欢把东西自动化。如果人工任务枯燥、重复、耗时或容易出错，我们会寻找机会将其替换为自动化。\nGitHub Docs团队接受了GitHub流的概念，这是一个连续的交付周期，其中作为正常拉式请求工作流的副产品，自动将更改分阶段、自动测试并部署到生产中。换句话说，任何人都应该能够在不离开github.com网站的情况下做出贡献、预览、测试和发布。\n当在GitHub/Docs上打开拉取请求时，该拉取请求分支中的更改会自动部署到临时过渡/审查应用程序。这使得任何人都可以很容易地在实时应用程序中查看更改，而不必下拉更改并在当地环境中查看它们。当拉取请求合并到默认分支时，会销毁临时暂存应用，并将更改部署到生产中。\n我们的团队享受这种“免提”的连续交付工作流已经有一年多了，我们再也不能回到有限的试运行实例和聊天部署命令的时代了。\n我们希望为GitHub文档做贡献的过程对外部贡献者和GitHub员工一样简单，我们已经考虑到这一点来构建我们的测试和部署工具。当外部贡献者在GitHub/docs上打开拉取请求时，我们将运行相同的持续集成测试，并创建与我们为GitHub员工所做的相同的短暂试运行应用。\n开源不仅仅是关于代码。成功的开源项目维护人员知道，项目的健康不仅取决于源代码，还取决于参与其开发的人员的福祉。除了通过和执行国际行为准则外，重要的是承认各种贡献，这样人们就知道他们的努力是有价值的。\n所有贡献者都是一个很受欢迎的开源项目，它使得感谢贡献变得很容易。所有贡献者都包括一个规范、一个GitHub机器人，以及一个快速向您的项目添加贡献者的高级命令行工具。它还支持多种投稿类型：\n我们现在在所有与文档相关的开放源码存储库上使用All Contributors项目。例如，请查看GitHub/docs自述文件。\n我们花了很长时间，做了很多工作才来到这里。弄清楚如何开源这个存在已久的私人项目一直是一个有趣的挑战，但我认为最好的还在后头。公开工作是构建软件最有趣的方式，我迫不及待地想看看docs.github.com网站是如何发展的，因为我们邀请了来自世界各地的贡献者来帮助塑造它的未来。", "note_en": "Last week we  open sourced all of GitHub’s product documentation, along with the Node.js web application that powers it. Check out our new public repository at  github.com/github/docs.\n This post tells the story of why we wanted to open source the docs, what tools we built and open sourced along the way, and how we worked to make the project welcoming to external contributors.\n   The open source community loves to innovate. Our docs team is innovative too, but we are relatively few in number. We open sourced docs.github.com to welcome new ideas and contributions from a broader and more diverse range of people, like you!\n  We open sourced GitHub’s product documentation to help demonstrate that it’s possible (and beneficial) for private companies to open source their products. GitHub has open sourced  hundreds of projects over the years, but docs.github.com is the first private production service that we’ve migrated into the open. We hope that our application design,  automation workflows, and openness to external contributions can be a model for other organizations that want to open up their private projects and benefit from community collaboration.\n  docs.github.com is an internationalized website with documentation translated into Japanese, Chinese, Spanish, and Portuguese, with support for more languages coming soon. Meanwhile the  Node.js internationalization working group is also working to localize Node.js documentation. The Node.js project faces many of the same challenges that we do. They use GitHub repositories, GitHub Actions, and the  Crowdin.com localization platform to build workflows and tooling for the open source community. Our hope is that open sourcing GitHub Docs will be mutually beneficial to the GitHub and Node.js communities. Together we’ll be able to share practices, tooling, and workflows more transparently. The  @crowdin-node GitHub organization exists for this purpose, and the tools there are maintained by folks from the Electron, GitHub Docs, and Node.js projects. We currently work with professional translators to localize our content, but we hope to eventually open up the translation process to external contributors as well.\n  When members of the GitHub Docs team open support requests with third-party vendors like Fastly, Crowdin, Algolia, or Heroku, we often paint detailed pictures of the problems we’re trying to solve. This time-consuming process can lead to a lot of back-and-forth communication in private support channels. Now that   github/docs is a public repo we can link directly to code or GitHub Issues that relate to the matter at hand. Instead of making suggestions for us to try, our vendors can (and often do) clone our repo, try out solutions, and even open pull requests to help solve problems. This not only helps our team, but strengthens our relationships with our vendors and leaves a public record of how we solve problems that others can learn from.\n  GitHub has open sourced many things over the years, from full-blown platforms like  Electron to tools like  GitHub Desktop and the   gh CLI, to API client libraries like  octokit/rest.js and  octokit.rb, and  lots of npm packages. We’ve also open sourced things that aren’t software, such as our  employee intellectual property agreement and  product roadmap.\n But  github/docs is a bit different from all the other projects GitHub has open sourced: it’s not a standalone tool or library, but a repo containing all of our product documentation, along with the web application that powers it. This application was created over seven years ago in 2013, and has a long and colorful history.\n The first incarnation of  docs.github.com (originally help.github.com) was a Ruby on Rails application. It was later converted to a static site using  Jekyll and then  Nanoc, another Ruby static site generator. Today the site is powered by a Node.js web service that supports dynamic routing and content rendering.\n The site’s tooling has changed over the years, but many of the tried-and-true authoring conventions of the Jekyll site have been preserved:\n   When rebuilding GitHub Docs as a Node.js application, we looked for opportunities to open source different pieces of it along the way:\n   One of the unique challenges we faced when open sourcing GitHub Docs was finding a way to make everything public while still being able to collaborate privately on upcoming product releases. To accomplish this, we decided to create two git repositories (one public, one private) and set about finding a way to keep the two in sync automatically.\n We turned to the  GitHub Marketplace for a solution. Although there didn’t seem to be an existing tool that suited our exact needs, there was something that came close:   Pull is a GitHub App designed to automate the often tedious task of keeping a forked repo up to date with its upstream repo.\n We reached out to the author of the Pull app,  Wei He, to see if he’d be interested in collaborating with us to build a similar app, but for syncing repos bi-directionally. Wei happily accepted the challenge and together we set about building   Repo Sync, a new open source tool using Docker, git, shell scripts,  GitHub Actions, and the  GitHub Container Registry.\n Repo Sync is a set of flexible GitHub Actions for keeping git repositories in sync. Using a  single Actions workflow file that runs on a schedule, we can keep the  main branch of the private and public docs repositories in sync, without human intervention.\n  Earlier this year we  merged help.github.com and developer.github.com into a single site,  docs.github.com. Prior to this migration, all of GitHub’s REST API reference documentation was a mix of unstructured Markdown, embedded Ruby, Liquid templating, and a side of hand-pasted cURL output. When GitHub’s REST API was created over ten years ago, it was not documented in a structured way. There were automated tests in the github.com codebase, but no machine-readable specification for the API. As it turned out, the unstructured REST API docs on developer.github.com were the closest thing we had to a source of truth about GitHub’s REST API.\n With the help of Ocotkit maintainer  Gregor Martynus and contractors at  Redoc.ly, we embarked on a long journey to reverse-engineer GitHub’s REST API reference docs into machine-readable and human-editable OpenAPI description files.\n As of  earlier this year, those OpenAPI descriptions now live in the github.com codebase, and are used to create, validate, and test GitHub’s REST API. These OpenAPI descriptions are also now used to generate the  Javascript and  Ruby Octokit clients, and to render the new REST API reference docs at  docs.github.com/rest. GitHub’s OpenAPI description files are now open source and can be downloaded at   github.com/github/rest-api-description.\n For more history on the creation of OpenAPI (originally Swagger) and GitHub’s eventual adoption of it, check out my  Swagger origin story talk and my colleague’s  Describing a 10-year old API with OpenAPI talk from this year’s API Specifications conference.\n  Liquid is an open source template language similar to Nunjucks or Handlebars. It was created by  Shopify to give their customers a safe way to add dynamic content to their storefronts. Liquid is a Ruby project, and has seen wide adoption among projects using Rails or Jekyll. While Liquid is popular in the Ruby community, it is still relatively obscure and rarely used in the JavaScript ecosystem. We tried to find an npm package to parse and render our existing Liquid templates, but were unable to find a complete implementation that met all of our needs.\n At this point we could have thrown in the towel and migrated to another template language, but we liked what we had: our team’s technical writers were comfortable using Liquid, and our engineers didn’t particularly want to take on the daunting and thankless task of migrating thousands of content files to a new template language.\n We reached out to the authors of several existing Liquid-related npm packages, and with the help of  multiple contributors we were able to deprecate several old and unmaintained packages, rebrand  liquid-node as  liquid, convert its codebase from  CoffeeScript to JavaScript, and improve its tests and documentation.\n   We like to automate stuff. If a human task is boring, repetitive, time-consuming, or error-prone, we look for opportunities to replace it with automation.\n The GitHub Docs team embraces the concept of  GitHub Flow, a continuous delivery cycle wherein changes are staged, tested, and deployed to production automatically, as a byproduct of the normal pull request workflow. To put it another way, anyone should be able to make a contribution, preview it, test it, and ship it without leaving the github.com website.\n When a pull request is opened on  github/docs, the changes in that pull request’s branch are automatically deployed to an ephemeral staging/review app. This makes it easy for anyone to review the changes in a live app, without having to pull down the changes and view them in their local environment. When a pull request is merged to the default branch, the ephemeral staging app is destroyed and the changes are deployed to production.\n Our team has enjoyed this “hands-free” continuous delivery workflow for over a year now, and we could never go back to the days of finite staging instances and chatops deployment commands.\n We want the process of contributing to GitHub Docs to be as easy for external contributors as it is for GitHub employees, and we’ve built our testing and deployment tools with that in mind. When an external contributor opens a pull request on  github/docs, we’ll run the same  continuous integration tests and create the same ephemeral staging apps as we do for GitHub employees.\n  Open source is about more than just code. Successful open source project maintainers know that the health of the project depends not just on the source code, but on the well-being of the people who participate in its development. In addition to adopting and enforcing a  Code of Conduct, it’s important to acknowledge contributions of all kinds, so people know their efforts are valued.\n All Contributors is a popular open source project that makes it easy to acknowledge contributions. All Contributors includes a  specification, a  GitHub bot, and a  command-line tool for quickly adding contributors to your project. It also supports a wide array of contribution types:\n  We’re now using the All Contributors project on all of our docs-related open source repositories. For an example, check out the  github/docs README.\n  It took a long time and a lot of work to get here. Figuring out how to open source this long-lived private project has been a fun challenge, but I think the best is yet to come. Working in the open is the most fun way to build software, and I can’t wait to see how  docs.github.com evolves as we invite contributors from around the world to help shape its future.", "posttime": "2020-10-15 02:38:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,开源,sourced", "title": "我们开源Docs.github.com", "title_en": "We Open Sourced Docs.github.com", "transed": 1, "url": "https://github.blog/2020-10-14-how-we-open-sourced-docs-github-com/", "via": "", "real_tags": ["github", "开源", "sourced"]}, {"category": "", "categoryclass": "", "imagename": "c18b8d23ca57c8819a36dd4e599a6be5.jpeg", "infoid": 1028861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "We公司周三宣布将更名为WeWork-再一次。\n这家合作初创公司成立于2010年，名为WeWork，并于2019年1月选择更名为We Company，因为它冒险走出办公空间，进军住宅和教育单位。近两年后，该公司将恢复原名。\n该公司周三在一篇博客文章中表示，这一声明标志着该公司专注于核心产品并巩固自己作为全球端到端业务解决方案领先者的努力的最新里程碑。\n这家公司的初创公司受到新冠肺炎疫情的沉重打击，房地产界的大部分人也是如此。WeWork正在努力应对包括纽约市和洛杉矶在内的许多市场的大量空缺，甚至与仲量联行(JLL)和世邦魏理仕(CBRE)等老牌商业房地产公司联手帮助填补空缺。该公司已经解雇了数百名员工，就像许多公司在疫情爆发期间不得不做的那样，但它也公布了在比其他公司更艰难的一年里奖励员工的计划。\n去年9月，该公司为预计470亿美元的首次公开募股(IPO)做好了准备。但当该公司在提交给S-1的文件中披露了其财务状况、商业做法以及联合创始人兼时任首席执行官亚当·诺伊曼(Adam Neumann)有问题的管理时，该公司面临了广泛的批评。该公司罢免了诺伊曼，努力应对潜在的破产，并最终取消了IPO。\n日本控股巨头软银在WeWork上下了重注，在WeWork首次公开募股(IPO)失败之前，向该公司投入了90亿美元。据“福布斯”报道，软银首席执行官孙正义在2020年初的一次采访中承认，软银为WeWork支付了过高的估值，我们也太信任这位企业家了。\n今年2月，桑迪普·马特拉尼(SanDeep Mathrani)接任公司首席执行官一职，此后开始执行扭转局面的使命。截至5月，该公司估值约为29亿美元。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "The We Company announced Wednesday that it is changing its name to WeWork — again.\n The coworking startup launched in 2010 as WeWork, and opted to rebrand as The We Company in January 2019 as it ventured outside of office space into residential and educational units. And after nearly two years, the company is returning to its original name.\n &#34;This announcement marks the latest milestone in the company&#39;s efforts to focus on its core product and cement itself as a global end-to-end business solutions leader,&#34; the company said in a  blog post on Wednesday.\n The company startup  has been hit hard by the COVID-19 pandemic, as has much of the real estate world. WeWork is grappling with large vacancies in many of its markets, including New York City and Los Angeles,  and has even joined hands with such established commercial real estate firms as JLL and CBRE to help fill them. The company has  laid off hundreds of employees, as many companies have had to do during the pandemic, but it has also  revealed plans to &#34;reward&#34; employees during a year that has been tougher than others.\n    Last September, the company geared up for what was expected to be a $47 billion IPO. But the company  faced widespread criticism when its S-1 filing revealed its financial conditions, business practices, and questionable management by cofounder and then CEO Adam Neumann. The company ousted Neumann, grappled with a potential bankruptcy, and ended up pulling its IPO.\n Softbank, the Japanese holding giant, bet heavily on WeWork,  pouring $9 billion into the company before its IPO unraveled. Softbank CEO Masayoshi Son acknowledged in an early 2020 interview that the firm &#34;paid too much valuation for WeWork and we did too much believe in the entrepreneur,&#34; according to  Forbes.\n In February, Sandeep Mathrani took over the reins as CEO of the company and has since  embarked on a mission to turn it around. As of May, the company was valued  around $2.9 billion.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-10-15 02:38:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "更名,changing", "title": "We公司将更名为WeWork", "title_en": "The We Company is changing its name back to WeWork", "transed": 1, "url": "https://www.businessinsider.com/we-company-changes-name-wework-coworking-startup-2020-10", "via": "", "real_tags": ["更名", "changing"]}, {"category": "", "categoryclass": "", "imagename": "b01d33f251c15ac3c20e6295866c9a64.png", "infoid": 1028859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在8月份，美国食品和药物管理局(Food And Drug Administration)就罢免了艾米莉·米勒(Emily Miller)的最高发言人职务。米勒是一名右翼活动人士，也是前第一美国新闻(One America News)记者，他是由白宫任命在FDA的，并被赋予了媒体事务助理专员的角色，这一角色通常由无党派公务员担任。她担任这一职位仅11天，在几次引人注目的机构失误后，在激烈的争议中被解雇。\n但现在看来，米勒从未离开过FDA。她仍在监管机构工作，自那以后被授予了一个新的-也许更有声望的-头衔。而且，和以前一样，她正在给中情局带来问题。\n米勒现在是FDA参谋长的高级顾问。而且，作为美国食品和药物管理局的一名员工，她在推特上公开宣传一种未经批准的药物对新冠肺炎来说“就像是一种解药”。她的推文支持特朗普总统未经证实的、具有潜在危险的声明，并可能违反FDA的规定。她推广的药物目前正在接受FDA的紧急使用审查，这引发了人们对该机构公正性的担忧。\n尽管米勒的推特账户最近几天已经被修改，删除了她在FDA的头衔和与该机构的任何联系，但她仍然列在FDA的网站上。然而，该网站没有列出她的新旧头衔。\nFDA没有立即回复Ars的置评请求。但在回应标准普尔全球新闻(S&P Global News)资深记者唐娜·杨(Donna Young)时，FDA表示：“根据政策，FDA不会对人事问题发表评论，我们也不会对潜在或公开的合规问题发表评论。”\n特朗普和米勒所说的对新冠肺炎来说“像是治愈”的药物，是由再生制药公司生产的单克隆抗体的鸡尾酒。特朗普在10月2日透露自己对导致新冠肺炎的新型冠状病毒SARS-CoV-2检测呈阳性后，迅速得到了药物治疗。这种鸡尾酒仍处于临床试验阶段，几乎没有关于其有效性的数据。\nRegeneron于9月29日发布了一份新闻稿，称高剂量的抗体鸡尾酒似乎能使没有因感染而住院的感染患者的SARS-CoV-2水平下降得更快。但全部数据尚未公布或公布，目前掌握的信息不足以确定治疗是否有效。\n根据该公司的说法，特朗普接受了试验性治疗，这是一项“同情使用”请求的一部分，他是以这种方式接受药物治疗的不到10人之一。\n10月7日-就在米勒的推文宣传的同一天-Regeneron要求FDA发布鸡尾酒的紧急使用授权，这将开放在临床试验之外使用这些药物。Regeneron表示，它有足够的剂量供大约5万名患者使用，预计在未来几个月内总共提供30万剂。", "note_en": "Back in August, the Food and Drug Administration ousted Emily Miller from her role as the agency’s top spokesperson. Miller, a right-wing activist and former One America News reporter, was installed in the FDA by the White House and given the role of Assistant Commissioner for Media Affairs, a role typically held by nonpartisan civil servants. She held the post for a mere 11 days and was fired  amid intense controversy after several high-profile agency missteps.\n But now it appears that Miller never left the FDA. She’s still at the regulatory agency and has  since been given a new—perhaps more prestigious—title. And, as before, she is causing problems for the agency.\n Miller is now the Senior Advisor to the Chief of Staff at the FDA. And, as an FDA employee, she has publicly  promoted an unapproved drug as being “like a cure” for COVID-19 on twitter. Her tweets support unproven and potentially dangerous statements from President Trump and may violate FDA regulations. The drug she promoted is currently being reviewed by the FDA for emergency use, raising concerns about the agency’s impartiality.\n Though Miller’s  twitter account has been altered in recent days to remove her title at the FDA and any connection to the agency, she is still listed on the  FDA’s website. The website does not list her new or old title, however.\n The FDA did not immediately respond to Ars’ request for comment. But in  a response to S&amp;P Global News’ Senior Reporter Donna Young, the agency said: “As a matter of policy, FDA doesn’t comment on personnel matters nor do we comment on potential or open compliance matters.”\n  The drug Trump and Miller were referring to as “like a cure” for COVID-19 is a cocktail of monoclonal antibodies made by Regeneron Pharmaceuticals. Trump was given the drug swiftly after  he revealed October 2 that he had  tested positive for the novel coronavirus, SARS-CoV-2, which causes COVID-19. The cocktail is still in clinical trials and has little data on its effectiveness.\n Regeneron issued  a press release September 29 stating that high doses of its antibody cocktail appeared to cause levels of SARS-CoV-2 to decrease more quickly in infected patients who were not hospitalized for their infection. But the full data has not been published or released, and the information available so far is not enough to determine if the treatment is effective.\n Trump received the experimental treatment as part of a “ compassionate use” request and is among fewer than 10 people who have received the drug this way, according to the company.\n On October 7—the same day as Miller’s promotional tweet—Regeneron  requested that the FDA issue an Emergency Use Authorization for the cocktail, which would open access to the drugs outside of clinical trials. Regeneron said that it has enough doses for about 50,000 patients and expects to make 300,000 doses total available within the next few months.", "posttime": "2020-10-15 02:24:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "解雇,fda", "title": "一名被FDA任命解雇的记者仍在FDA，藐视规则", "title_en": "OAN reporter fired from FDA appointment is still at FDA, flouting rules", "transed": 1, "url": "https://arstechnica.com/science/2020/10/trump-appointee-fired-from-fda-is-still-at-fda-promoting-unapproved-drugs/", "via": "", "real_tags": ["解雇", "fda"]}, {"category": "", "categoryclass": "", "imagename": "a5f0a4f7f5c69a25cbbbfd4205da6aa1.jpg", "infoid": 1028858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "较小的小部件将只显示您最近收听的项目，而中等大小的小部件将显示五个最近的项目-四个在水平行中，最近的在顶部。在这种情况下，你实际上可以点击小缩略图，你现在想要流式传输的五个内容中的哪个，将直接带到Spotify应用程序的该页面。\n小部件的另一个有趣方面是背景颜色自动更新以匹配缩略图。例如，如果艺术家穿的是红色，则小部件将更改为红色。如果相册为蓝色，则小部件将变为蓝色。诸若此类。\n然而，可供选择的颜色似乎有限。例如，当我们在缩略图中流式播放灰白配色方案的内容时(例如泰勒·斯威夫特的“民间传说”)，小工具默认为Spotify的绿色阴影。\n这个小工具的丰富多彩的体验可以帮助它在主屏幕上脱颖而出。但对于那些用某种美学来定制iOS14主屏幕的人来说，这也可能是有问题的-比如所有应用程序图标和小工具都是中性色调，或者是另一种最喜欢的颜色，如粉色、紫色、蓝色或黑色。\n根据Etsy的趋势，中性色调或秋季色调的iOS14包目前是最畅销的，浅粉色和深色主题的黑色包也是如此。Spotify的小工具有时可能会与这些设计发生冲突。\n尽管如此，Spotify微件的需求一直如此强劲，以至于在正式发布之前，随着用户定制他们的iOS 14主屏幕，Spotify微件提供商让第三方音乐微件提供商在App Store排行榜上飞涨。该窗口小部件提供商TuneTrack甚至在9月9日的总体排名中高居第8位，在音乐领域排名第一。2020年19日，当时定制趋势推动了数百万的新下载量。\n新的Spotify小部件今天在iOS应用商店更新的Spotify应用中上线。", "note_en": "The smaller widget will display just your most recently listened to item, while the medium-sized widget will instead show the five most recent items — four in a horizontal row and the most recent at the top. In that case, you can actually tap on the small thumbnail for which of the five you want to now stream to be taken directly to that page in the Spotify app.\n   Another interesting aspect to the widget is that the background color automatically updates to match the thumbnail image. If the artist is wearing red, for example, the widget changes to red. If the album is blue, the widget becomes blue. And so on.\n There seem to be a limited range of colors available, however. For example, when we streamed something with a gray-and-white color scheme in the thumbnail image (e.g. Taylor Swift’s “folklore”), the widget defaulted to Spotify’s green shade.\n  The widget’s colorful experience can help it to stand out on the homescreen. But it could also be problematic for those who have customized their iOS 14 homescreen with a certain aesthetic — like all app icons and widgets in neutral shades, or another favorite color, such as pink, purple, blue, or black.\n Based  on Etsy trends, iOS 14 packs in neutral or fall shades are currently best sellers, as are those with lighter pinks and dark themes in black. Spotify’s widget could clash with those designs, at times.\n Still, the demand for a Spotify widget has been so strong that before the official release it sent a third-party music widget provider flying up the App Store charts as users customized their iOS 14 homescreens. That widget provider, TuneTrack, even got as high at No. 8 Overall and No. 1 in Music on Sept. 19, 2020, when the customization trend was driving  millions of new downloads.\n The new Spotify widget is live today within the  updated Spotify app on the iOS App Store.", "posttime": "2020-10-15 02:19:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,启动,launches,spotify", "title": "\nSpotify启动自动更新iOS 14小部件", "title_en": "\n\t\t\t\tSpotify launches an automatically updating iOS 14 widget\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/spotify-launches-an-automatically-updating-ios-14-widget/", "via": "", "real_tags": ["ios", "启动", "launches", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "4171e892977bc50fd25e3bc3a0abc055.jpg", "infoid": 1028857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌负责测量、分析和购买平台的副总裁维迪亚·斯里尼瓦桑(Vidhya Srinivasan)在一篇公司博客文章中写道，由于COVID，公司看到了这种不断变化的客户品牌动态，并希望通过添加新功能来帮助营销人员实现他们的目标，无论这些新功能是什么。\n要做到这一点，一种方法是将Analytics与机器学习结合起来，帮助自动突出显示数据，这对使用该平台的营销者很重要。Srinivasan在这篇博客文章中写道：“[Google Analytics]的核心是机器学习，可以自动产生有用的见解，让你完全了解不同设备和平台的客户。”\n更新背后的想法是让营销人员获得更多他们最关心的信息，方法是利用机器学习来浮出水面，比如哪些客户群体最有可能购买，哪些最有可能流失，正是这些类型的信息营销(和销售)团队需要努力采取积极行动，防止客户离开，或者相反地，将那些准备购买的客户转变为销售人员。\n如果它像描述的那样工作，它可以为营销人员提供一种在每个客户或客户组的整个生命周期中衡量他们绩效的方法，这在客户需求不断变化的COVID期间尤其重要。\n当然，这是一款谷歌产品，旨在很好地配合谷歌广告、YouTube和其他工具，如Gmail和谷歌搜索，以及非谷歌频道。正如斯里尼瓦桑所写：\n新的方法也使得解决长期的广告商请求成为可能。由于新的Analytics可以同时测量应用程序和Web交互，因此它可以将应用程序内和Web上发生的YouTube参与视图的转换包括在报告中。查看YouTube视频视图的转换，以及来自谷歌和非谷歌付费渠道的转换，以及谷歌搜索、社交和电子邮件等有机渠道的转换，有助于您了解所有营销努力的综合影响。\n该公司还试图未来证明分析，着眼于更严格的隐私法，比如欧洲的GDPR或加利福尼亚州的CCPA，当你不能使用cookie或其他跟踪软件时，它会使用建模来填补信息空白。\n所有这些都是为了帮助处于监管格局变化的艰难时期的营销人员更好地理解客户需求，并在他们想要的时候提供他们想要的东西-当他们只是想让客户满意的时候。", "note_en": "Vidhya Srinivasan vice president of measurement, analytics and buying platforms at Google wrote in  a company blog post introducing the new features that the company sees this changing customer-brand dynamic due to COVID, and it wants to assist by adding new features that help marketers achieve their goals, whatever those may be.\n One way to achieve this is by infusing Analytics with machine learning to help highlight data automatically that’s important to marketers using the platform. “[Google Analytics] has machine learning at its core to automatically surface helpful insights and gives you a complete understanding of your customers across devices and platforms,” Srinivasan wrote in the blog post.\n   The idea behind the update is to give marketers access to more information they care about most by using that machine learning to surface data like which groups of customers are most likely to buy and which are most likely to churn, the very types of information marketing (and sales) teams need to try make proactive moves to keep customers from leaving or conversely turning those ready to buy into sales.\n  If it works as described, it can give marketers a way to measure their performance with each customer or group of customers across their entire lifecycle, which is especially important during COVID when customer needs are constantly changing.\n Of course, this being a Google product it’s designed to play nicely with Google Ads, YouTube and other tools like GMail and Google Search along with non-Google channels. As Srinivasan wrote:\n The new approach also makes it possible to address longtime advertiser requests. Because the new Analytics can measure app and web interactions together, it can include conversions from YouTube engaged views that occur in-app and on the web in reports. Seeing conversions from YouTube video views alongside conversions from Google and non-Google paid channels, and organic channels like Google Search, social, and email, helps you understand the combined impact of all your marketing efforts.\n The company is also trying to future proof analytics with an eye toward stricter privacy laws like GDPR in Europe or CCPA in California by using modeling to fill in gaps in information when you can’t use cookies or other tracking software.\n All of this is designed to help marketers, caught in trying times with a shifting regulatory landscape to better understand customer needs and deliver them what they want when they want it — when they’re just trying to keep the customers satisfied.", "posttime": "2020-10-15 02:19:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,客户,analytics", "title": "\nGoogle Analytics更新使用机器学习来显示更关键的客户数据", "title_en": "\n\t\t\t\tGoogle Analytics update uses machine learning to surface more critical customer data\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/google-analytics-update-uses-machine-learning-to-surface-more-critical-customer-data/", "via": "", "real_tags": ["google", "客户", "analytics"]}, {"category": "", "categoryclass": "", "imagename": "3776acd80fade1ba887b5d199a048a64.jpg", "infoid": 1028856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这笔新资金使该公司的总现金收入达到5亿美元，由现有投资者软银愿景基金(Softbank Vision Fund)牵头，其中还包括浆果种植巨头Driscoll‘s。此举将使Driscoll接触到普莱克斯在室内种植和收获水果和蔬菜的技术。\n这笔融资正值MULTH与其对浆果感兴趣的新投资者和阿尔伯森杂货连锁店签署协议之际。该公司还宣布了在加利福尼亚州康普顿建造一个新农场的计划。\n这笔融资为一家看到科技驱动的种植作物市场竞争激烈的公司提供了充足的现金，筹集了过多的私人和公共资本。\n在过去的一个月里，AppHarest已经同意由一家特殊目的的收购公司上市，这笔交易对这家温室番茄种植者的估值将略低于10亿美元。另一家绿叶种植公司Revol Greens已经筹集了6800万美元，用于其基于温室的竞标，以成为新的绿色革命的一部分。\n与此同时，Plants的直接竞争对手Bowery Farming正在将其零售足迹扩大到650家门店，尽管Plants正在吹捧其与艾伯森(Albertsons)达成的协议，为加州的431家门店提供绿色蔬菜。\n迪斯科似乎被普莱克斯的技术说服了，不过与该公司的协议条款并未披露。\nDriscoll董事长兼首席执行官J·迈尔斯·赖特(J.Miles Reiter)在一份声明中说，“我们研究了其他垂直农场，大量的技术是我们见过的种植浆果最有吸引力的系统之一。”“我们在制定种植草莓的联合开发协议时了解了很多东西。他们的技术给我们留下了深刻的印象，我们决定投资。“", "note_en": "The new funding, which brings the company’s total cash haul to an abundant $500 million, was led by existing investor Softbank Vision Fund also included the berry farming giant Driscoll’s. It’s a move that will give Driscoll’s exposure to Plenty’s technology for growing and harvesting fruits and vegetables indoors.\n The funding comes as Plenty has inked agreements with both its new berry-interested investor and the Albertsons grocery chain. The company also announced plans to build a new farm in Compton, California.\n  The financing provides plenty of cash for a company that’s seeing a cornucopia of competition in the tech-enabled cultivated crop market raising a plethora of private and public capital.\n In the past month, AppHarvest has agreed to be taken public by a special purpose acquisition company in a deal that would value that greenhouse tomato-grower at a little under $1 billion. And another leafy green grower, Revol Greens has raised $68 million for its own greenhouse-based bid to be part of the new green revolution.\n Meanwhile, Plenty’s more direct competitor,  Bowery Farming, is expanding its retail footprint to 650 stores even as Plenty touts its deal with Albertsons to provide greens to 431 stores in California.\n  Discoll’s seemed convinced by Plenty’s technology, although the terms of the agreement with the company weren’t disclosed.\n “We looked at other vertical farms, and Plenty’s technology was one of the most compelling systems we’d seen for growing berries,” said J. Miles Reiter, Driscoll’s Chairman and CEO, in a statement. “We got to know Plenty while working on a joint development agreement to grow strawberries. We were so impressed with their technology, we decided to invest.”", "posttime": "2020-10-15 02:19:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "水果,grow,种植", "title": "\n许多人已经筹集了超过5亿美元在室内种植水果和蔬菜", "title_en": "\n\t\t\t\tPlenty has raised over $500 million to grow fruits and veggies indoors\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/plenty-has-raised-over-500-million-to-grow-fruits-and-veggies-indoors/", "via": "", "real_tags": ["水果", "grow", "种植"]}, {"category": "", "categoryclass": "", "imagename": "f5d3180bf1471ea72da827827a4afdc4.jpg", "infoid": 1028855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这次发射有望标志着维珍轨道公司的第一次-它第一次进入轨道，这是它提供希望提供的服务所需的地方。CNBC采访了维珍轨道公司(Virgin Orbit)首席执行官丹·哈特(Dan Hart)，他表示，12月的目标是基于他们目前建造一枚新的运载火箭一号(LauncherOne)来执行测试任务的情况。\nLauncherOne与维珍轨道(Virgin Orbit)的运载火箭对接，发射型号为改进型D747。喷气式飞机将它带到约4.5万英尺的高空，在这一点上它投下火箭，火箭在分离后点燃自己的发动机，然后依靠自己的动力飞行到太空的其余部分。火箭从那个高度离开地球大气层要容易得多，这就是为什么维珍希望能够为专门的小型发射服务提供巨大的成本效益，而不是现在可用的服务。\n今年3月，维珍的发射进行得很顺利，直到执行那次任务的LauncherOne飞船启动引擎后不久。有一次故障导致发动机因为安全关闭而关闭，火箭随后安全降落到地球上，但显然是迷路了。\n在第一次轨道发射尝试中遇到这样的不幸远非罕见--事实上，这几乎是常态。维珍轨道表示，无论结果如何，他们都从尝试中收集了大量重要数据，希望这将意味着下一次尝试按计划进行。如果是这样的话，这应该会让公司走上正轨，明年开始提供商业服务。\n与此同时，CNBC报道称，该公司也在寻找高达1.5亿美元的新资金，这与华尔街日报本周早些时候的一篇报道相呼应。", "note_en": "This launch will hopefully mark a first for Virgin Orbit – the first time it has reached orbit, which is where it needs to be to provide the services it hopes to offer.  CNBC spoke to Virgin Orbit CEO Dan Hart, who said that the December target is based on where they’re at right now with the construction of a new LauncherOne rocket to fly the test mission.\n LauncherOne is docked with Virgin Orbit’s carrier craft for its launch model, which is a modified d747. The jet takes it up to around 45,000 feet, at which point it drops the rocket, which ignites its own engines after separation and then flies under its own power the rest of the way to space. A rocket has a much easier time leaving Earth’s atmosphere from that altitude, which is why Virgin hopes to be able to offer big cost benefits for dedicated small launch services vs. what’s available now.\n  In March, Virgin’s launch went smoothly up until just after the LauncherOne craft used on that mission fired up its engines. There was a failure that caused the engines to cut off because of a safety shutoff, and the rocket then fell back safely to Earth, but was obviously lost.\n Such a mishap on a first orbital launch attempt is far from unusual – in fact, it’s almost the norm. Virgin Orbit said they gleaned a lot of great data from their attempt regardless of the outcome, and hopefully that will mean this next try goes to plan. If it does, that should put the company on track to begin offering commercial service next year.\n Meanwhile, CNBC reports that the company is also in the process of tracking down up to $150 million in new funding, echoing an earlier report from the Wall Street Journal this week.", "posttime": "2020-10-15 02:19:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "轨道,orbit,发射", "title": "\n维珍轨道计划在12月进行第二次轨道演示发射尝试", "title_en": "\n\t\t\t\tVirgin Orbit aims for December for second attempt at orbital demonstration launch\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/virgin-orbit-aims-for-december-for-second-attempt-at-orbital-demonstration-launch/", "via": "", "real_tags": ["轨道", "orbit", "发射"]}, {"category": "", "categoryclass": "", "imagename": "a8861fcce490e6df5781615cfa99f394.jpg", "infoid": 1028854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一家名为Sanity的初创公司已经建立了一个平台，通过SaaS平台让开发人员创建代码和系统来管理内容，从而帮助企业(和他们的员工)更容易地做到这一点。现在，在吸引了大约25,000名客户后，它宣布将提供930万美元的资金，以推动其增长。这些客户包括康泰纳仕(Conde Nast)和国家地理(National Geological)等“传统”出版商，以及Sonos、Brex、Figma、Cloudflare、Mux、Recognous、Kleiner Perkins、Tablet Magazine、MIT、Universal Health Services、Eurostar和Nike等数百家其他出版商。\n这是首轮A轮融资，由Threshold Ventures(前身为Draper Fisher Jurvetson的风投公司，在没有同名员工留在公司后于2019年更名)提供，其他有趣的演员也参与其中。\n其中包括伊夫·威廉姆斯(EV Williams)(作为Blogger、Twitter和最近的Medium的联合创始人，她对‘内容’略知一二)；亚当·格罗斯(Adam Gross)，Heroku的前首席执行官；NextJS的发明人、Vercel的首席执行官兼联合创始人吉列尔莫·劳赫(Guillermo Rauch)；斯蒂芬妮·弗里德曼(Stephanie Friedman，前Xamarin和微软的联合创始人)；以及由本·梅特卡夫(WP Engine的联合创始人，以及其他许多职务)创立的新公司Moncolor Capital。\nHeavybit和Alliance Venture去年牵头进行了240万美元的种子轮融资，也参与了这轮融资。其他现有投资者包括Netlify联合创始人Matthias Biilman和Chris Bach；Mux首席执行官兼联合创始人Jon Dal；以及NURX联合创始人Edvard Engsæth。\nSanity将自己标榜为一个“内容平台”，而这可能意味着什么的开放式想法本质上是该公司的本质所在。\n在联合创始人兼首席执行官马格努斯·希勒斯塔德(Magnus Hillestad)的领导下，它精心设计了一套工具，可以帮助开发人员构建内容如何以及在哪里创建、输入并最终呈现给人们的结构，其目标受众是任何可能正在整合其内容定期更新且不是静态的数字体验的组织或个人。\n希勒斯塔德说，将内容视为数字体验中一个独立的、动态的元素，代表了网络和其他内容体验如何发展的“范式转变”。他说，这一想法是为了让一个组织“不受功能的阻碍，而是拥有代码来制造他们想要的组件。”他将其描述为沿着同样的轨迹前进，“Twilio通过引入用于通信的API来做什么，而Figma用它的协作概念做了什么。”\n虽然电子商务通常是这种“无头”平台的主要客户-他们将使用这样的服务来帮助设计和管理前端，而另一种服务，如Shopify来管理后端的商务-它实际上是一个基本的框架，已经在Sanity的相当广泛的用例中得到了应用。\n它们确实包括电子商务体验，但也包括公司开发互动工具，供客户查看、混合和匹配照明咨询公司的各种照明设备；更标准的出版服务；以及帮助定制紧急医疗培训服务的材料。\n如今，正如他们所说，媒介就是信息，在这方面，“出版”在数字时代被赋予了新的含义。在过去，它只指为印刷而准备的材料，如书籍、杂志和报纸，而现在它可以是为网络或任何其他端点准备的任何类型的内容，在这些内容中，它不仅会被“阅读”，而且可能会以某种方式被操纵，而且可能还会被制片人改变。这些内容的动态性让它变得有趣有趣，但管理起来也是一件痛苦的事情。\n理智有一个值得注意的起源，那就是它总是对内容的神圣性给予宽广的停靠和首要的定位。它最初是由挪威奥斯陆的一家机构建造的，目的是重新思考和重塑如何为OMA的新网站展示作品。OMA是荷兰标志性设计师雷姆·库哈斯(Rem Koolhaas)与人共同创立的建筑公司。\n他们放在一起的信息矩阵和内容管理系统概念足够强大，足以利用该机构使用CMS建立更多的网站，最终该公司将理智剥离出来，成为自己的独立公司，由Even Westvang，Hillestad，Oyvind Rostad和Simen Svale Skogsrud创立。\n团队中的一部分，包括希尔斯塔德，搬到了旧金山湾区，以建立这家初创公司，并将其与该地区更大的科技生态系统更深入地整合，并在SaaS模式下构建了这个概念，而其他人则留在了奥斯陆。\n在进军美国的过程中，Sanity在过去几年一直在利用日益增长的服务市场，使那些依赖网络做生意的人能够以更具创造力和活力的方式开展业务。\n梅特卡夫在一份声明中说：“十年前，我与人共同创立了WP Engine，目标是将WordPress的力量带给企业和小企业买家。”“我们不仅正在从单一的代码库转向API驱动的服务，而且我们思考内容的方式也在发生变化；当我们创建一次内容并期望它出现在网络、应用程序甚至物联网设备上时。Sanity重新设想了无头CMS，使内容更接近开发人员，在那里它可以作为整个组织中事实上的内容记录系统而存在。由于CMS离我的根基如此之近，我非常高兴“理智”公司成为Moncolor Capital公司的首笔投资。“。\n在这个更广泛的领域里，它并不是唯一家受到广泛关注的公司。上周，只专注于电子商务和前端设计的幕府幕府筹集了3500万美元。其他包括CommercTools、Commerce layer、Strapi、Contentful和ContentStack。理智之所以脱颖而出，在一定程度上是因为它的关注点比电子商务更广，而且它的名称中没有使用“内容”或“商业”这个词。\n阈值风险投资公司(Threshold Ventures)合伙人乔希·斯坦(Josh Stein)在一份声明中表示：“我们看到，一波公司正在对其业务的方方面面进行转型和数字化，但他们使用的工具限制了他们的进步。”Sanity的内容平台通过实现真正的协作和可定制的体验来解放内容和内容所有者，同时将内容视为数据，以最大限度地提高所有客户接触点和表面的内容速度。我们很高兴能支持理智团队和他们令人印象深刻的以开发者为中心的内容管理平台。“。\nStein和Heavybit合伙人杰西·罗宾斯(Jesse Robbins)都将通过这轮融资加入Sanity的董事会。", "note_en": "A startup called  Sanity has built a platform to help businesses (and their people) do that more easily with a SaaS platform that lets developers create code and systems to manage content. Now, after picking up some 25,000 customers, from “traditional” publishers like Conde Nast and National Geographic through to hundreds of others like Sonos, Brex, Figma, Cloudflare, Mux, Remarkable, Kleiner Perkins, Tablet Magazine, MIT, Universal Health Services, Eurostar, and Nike, it is announcing funding of $9.3 million to fuel its growth.\n The funding, a Series A, is being by Threshold Ventures (the VC formerly known as Draper Fisher Jurvetson, rebranded in 2019 after none of the namesakes remained at the firm), with an interesting cast of others also participating.\n  They include Ev Williams (who knows a thing or two about ‘content’ as the co-founder of Blogger, Twitter and most recently Medium); Adam Gross, ex-CEO of Heroku; Guillermo Rauch, inventor of NextJS and CEO and co-founder of Vercel; Stephanie Friedman (ex-Xamarin and Microsoft); and Monochrome Capital, the new firm launched by Ben Metcalfe (the co-founder of WP Engine, among many other roles).\n Heavybit and Alliance Venture, which led its seed round of  $2.4 million last year, also participated. Other existing investors include  Matthias Biilman and Chris Bach, co-founders of Netlify; Jon Dal CEO and co-founder of Mux; and Edvard Engsæth, co-founder of NURX.\n Sanity bills itself as a “content platform”, and the open-ended idea of what that could possibly mean is essentially the essence of what the company is about.\n Led by co-founder and CEO Magnus Hillestad, it has crafted a set of tools that can help developers structure how and where content gets created, input and eventually presented to people, with its target audience being any organization or person that might be putting together a digital experience whose content is regularly updated and is not static.\n Hillestad said that thinking of content as a separate and dynamic element in digital experiences represents a “paradigm shift” in terms of how the web and other content experiences are developing. The idea, he said, is for an organization “not to be held back by features but to have the code to make the components they want.” He described it as a progression along the same trajectories of “what Twilio did by coming in with APIs for communications, and Figma did with its concept of collaboration.”\n While e-commerce has typically been a major customer of such “headless” platforms — they will use services like these to help design and manage the front end, with another service like Shopify to manage the commerce at the back end — it’s actually a basic framework that has been applied to a pretty wide range of use cases at Sanity.\n They do include e-commerce experiences, but also companies building interactive tools for customers to look at, mix, and match various light fixtures from a lighting consultancy; more standard publishing services; and for helping tailor materials for emergency medical training services.\n These days, the medium, as they say, is the message, and in that regard “publishing” has taken on a new meaning in the digital age. Whereas in the past it only referred to materials prepared for print, such as books, magazines and newspapers, these days it can be any kind of content prepared for the web or any other endpoint where it will not only be “read” but potentially manipulated in some way, and likely also changed by the producers as well. The very un-static nature of that content makes it fun and interesting, but also a pain to manage.\n Sanity has a notable origin that speaks to how it has always given a wide berth and prime positioning to the sanctity of content. It was built  originally by an agency in Oslo, Norway , as part of a remit to rethink and recast how to present works for a new website for OMA, the architecture firm co-founded by the iconic Dutch designer Rem Koolhaas.\n The information matrix and content management system concept that they put together was strong enough to use the agency to build more sites using the CMS, and eventually the firm spun Sanity out as its own independent firm, founded by Even Westvang, Hillestad, Oyvind Rostad and Simen Svale Skogsrud.\n Part of the team, including Hillestad, relocated to the Bay Area to build the startup and integrate it deeper with the bigger tech ecosystem in the region and build out the concept under a SaaS model, while others remained in Oslo.\n In its move to the US, Sanity has over the past few years been tapping into a growing market for services to enable those who rely on the web to do business do it in a more creative and dynamic way.\n “A decade ago, I co-founded WP Engine with the goal of bringing the power of WordPress to the enterprise and small business buyer,” said Metcalfe in a statement. “Not only are we moving away from monolithic codebases to API-driven services, but the way we think about content is changing; as we create once and expect it to appear across web, apps and even IoT devices. Sanity has reimagined the headless CMS, bringing content closer to the developer where it can exist as the defacto content system of record across an entire organization. With CMS so close to my roots, I couldn’t be more delighted that Sanity is the inaugural investment for Monochrome Capital.”\n It is not the only company in this wider area getting a lot of attention. Last week,  Shogun — which focuses only on e-commerce and front-end design, raised $35 million. Others include  Commercetools,  Commerce Layer,  Strapi,  Contentful, and  ContentStack. Sanity stands out partly by keeping its focus wider than e-commerce and by not using the words “content” or “commerce” in its name.\n “We’re seeing a tidal wave of companies transform and digitize every aspect of their business, but the tools they use limit their progress,” said Josh Stein, partner, Threshold Ventures, in a statement. “Sanity’s content platform liberates content and content owners by enabling a truly collaborative and customizable experience, while treating content as data to maximize content velocity across all customer touchpoints and surfaces. We’re excited to back the Sanity team and their impressive developer-focused content management platform.”\n Stein and Jesse Robbins, a partner at Heavybit, are both joining Sanity’s board of directors with this round.", "posttime": "2020-10-15 02:18:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "管理,williams,内容", "title": "\nSanity是一个在网站上构建和管理内容流的平台，从EV Williams、Threshold等公司筹集了930万美元", "title_en": "\n\t\t\t\tSanity, a platform to build and manage content flows on sites, raises $9.3M from Ev Williams, Threshold and more\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/sanity-a-platform-to-build-and-manage-content-flows-on-sites-raises-9-3m-from-ev-williams-threshold-and-more/", "via": "", "real_tags": ["管理", "williams", "内容"]}, {"category": "", "categoryclass": "", "imagename": "7138bfc713ba7d77ea8d81b4ac79a2d0.jpg", "infoid": 1028853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年早些时候，维珍银河在新墨西哥州成功地试飞了其“太空船二号”运载火箭，但这些测试不包括太空之旅。这次发射将由该公司的两名试飞员进行(同时还将进行一些乘客舱口的实验)，应该会在今年年底之前进行，有望使维珍银河明年开始向付费乘客提供商业服务。\n这些私人宇航员将包括一名新宣布的个人：艾伦·斯特恩博士，他是一位著名的、受人尊敬的行星科学家，曾担任过多个职位，最近担任的是西南研究院空间科学和工程部副主任。斯特恩博士是首位登上维珍银河商业宇宙飞船执行NASA资助的科学任务的研究人员。\n这似乎不会是太空船二号的第一次商业飞行。斯特恩的旅行将在未来从美国太空港进行一次“尚未计划的”亚轨道飞行。斯特恩将在航天器上进行两项关键的科学研究，包括实际佩戴监测他整个小瓶标志的仪器，以及使用微光相机从宇宙飞船二号舱内的有利位置观察太空有多好。", "note_en": "Earlier this year,  Virgin Galactic   successfully flew a number of tests of its SpaceShipTwo launch craft from New Mexico, but these didn’t include a trip to space. That launch, which will be performed by two of the company’s test pilots (while also carrying a number of experiments for the passenger hatch) should happen before the year is out, hopefully putting Virgin Galactic on pace to begin offering its commercial services next year to paying passengers.\n Those private astronauts will include one newly announced individual: Dr.  Alan Stern,   a noted and well-regarded planetary scientist who has held a number of positions, and is most recently the associate Vice President of South West Research Institute’s Space Science and Engineering Division. Dr. Stern is the first researcher named to be flying on board Virgin Galactic’s commercial spacecraft on a NASA-funded science mission.\n  This won’t be the first of SpaceShipTwo’s commercial flights, it seems. Stern’s trip will take place on a “yet unscheduled” suborbital flight from Spaceport America in the future. Stern will be conducting two key pieces of science aboard the spacecraft, including actually wearing instrumentation that monitors his vial signs throughout, as well as using a low light camera to see how well observing space from the vantage point of inside the SpaceShipTwo cabin works.", "posttime": "2020-10-15 02:18:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,太空,银河,galactic", "title": "\n维珍银河准备在今年秋天晚些时候从美国太空港进行首次太空飞行", "title_en": "\n\t\t\t\tVirgin Galactic readies first spaceflight from Spaceport America for ‘later this this fall’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/14/virgin-galactic-readies-first-spaceflight-from-spaceport-america-for-later-this-this-fall/", "via": "", "real_tags": ["美国", "太空", "银河", "galactic"]}, {"category": "", "categoryclass": "", "imagename": "932730d5aa41e567d11fb386f534bb0c.jpg", "infoid": 1028852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，突袭行动发生在德国的15个地点和罗马尼亚的一家关联公司。\n2020年9月，兜售被黑客攻击的网络的广告数量比前一个月增加了两倍。\n一个新的详细的金融网络犯罪集团已经被在附近进行攻击自2016年以来的世界-但是现在他们&#39；我改用勒索软件是因为IT&#39；It‘这是最大也最容易的..。\n英特尔建议更新到Linux内核5.9，以减轻Google在Linux蓝牙堆栈中发现的一个严重缺陷。\nIBM称Cloud Pak&#39；的新集成数据安全性集线器将带来数据安全洞察力直接深入到威胁管理和安全响应站台..。\n根据拟议的修订，亲密形象虐待的受害者将获得与其他性侵犯投诉人相同的法庭保护。\nAUSTRAC已决定不再对先买后付服务采取任何进一步的监管行动。\n微软在法庭上成功地进行了辩论反对使用恶意软件代码中的Windows SDK，这将是一个先例能够做到\n修复了21个远程代码包括执行(RCE)漏洞对于像Excel这样的产品，展望，Windows Graphics组件，和Windows TCP/IP堆栈。..。", "note_en": "Raids took place last week at 15 locations in Germany and at a connected company in Romania.\n  The number of ads peddling access to &#34;hacked networks&#34; tripled in September 2020 compared to the month before.\n  A\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnewly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdetailed\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfinancial\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcyber\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcrime\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgroup\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thas\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbeen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tconducting\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tattacks\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taround\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tworld\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsince\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t2016\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t-\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbut\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthey&#39;ve\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tswitched\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\transomware\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbecause\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbiggest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teasiest\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Intel recommends updating to Linux kernel 5.9 to mitigate a serious flaw Google found in the Linux Bluetooth stack.\n  IBM\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsaid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCloud\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPak&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnew\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tintegrated\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdata\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thub\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbring\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdata\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinsights\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdirectly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthreat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmanagement\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tresponse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplatforms\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Under the proposed amendments, victims of intimate image abuse will have the same court protections as other sexual assault complainants.\n  Austrac has decided not to pursue any further regulatory action against the &#39;buy now pay later&#39; service.\n  Microsoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsuccessfully\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\targued\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcourt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tagainst\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tuse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSDKs\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tinside\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmalware\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcode,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprecedent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twould\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\table\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tuse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tagain\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tagain\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfuture\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbotnet\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcrackdowns.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Fixes\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t21\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tremote\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcode\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\texecution\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(RCE)\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvulnerabilities\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tincluded\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tproducts\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlike\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExcel,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOutlook,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGraphics\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcomponent,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTCP/IP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstack.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2020-10-15 02:17:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "e2ee,roll,网络", "title": "缩放以转出端到端加密(E2EE)呼叫", "title_en": "Zoom To Roll Out End-to-End Encrypted (E2EE) Calls", "transed": 1, "url": "https://www.zdnet.com/article/zoom-to-roll-out-end-to-end-encrypted-e2ee-calls/", "via": "", "real_tags": ["e2ee", "roll", "网络"]}, {"category": "", "categoryclass": "", "imagename": "af552ea8706fb7ad7b4fdabc87508a06.jpg", "infoid": 1028851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "航天局几乎总是接受其众多拨款和合同项目中至少一个项目的申请，而引爆点直接针对的是需要一点提升的商业空间能力。根据项目描述，“如果在示范上的投资将显著成熟一项技术，增加注入商业空间应用的可能性，并将该技术推向市场，用于政府和商业应用，那么该技术就被认为处于临界点。”\n今年的奖项采取多年合同的形式，具有多个里程碑，重点放在两个主要领域：低温技术和月球表面技术。请注意，提供的金额不一定是开发技术的成本，而是被认为是将其推进到下一阶段所需的金额。以下是每个奖项的简要摘要：\nULA，8620万美元：在火神半人马上级演示智能推进低温系统。\n阿尔法空间测试和研究联盟，2210万美元：为月球表面测试开发一个小型技术和科学平台。\nAstrobotic，580万美元：“成熟”用于月球表面的快速无线充电系统。\n直观机器，4160万美元：开发一种有效载荷能力为2.2磅、射程为1.5英里的漏斗着陆器。\nMasten空间系统，280万美元：展示月夜和陨石坑的通用化学热源和动力源。\nMasten Space Systems，1000万美元：展示在其Xogdor飞行器上精确着陆以避免危险(“降落和着陆”标题下的单独奖励)。\n美国诺基亚(Nokia)，1410万美元：在太空中部署第一个用于月球表面通信的LTE网络。\nPH Matter，340万美元：展示在月球表面产生和储存能量的燃料电池。\n内华达山脉，240万美元：展示一种使用太阳能从月球表层提取氧气的装置。\nSSL Robotics，870万美元：开发一种更轻、更便宜的机械臂，用于地面、轨道和“地面防御”应用。\nTeledyne Energy Systems，280万美元：开发一种电池寿命为1万小时的氢燃料电池电力系统。\n你可以在引爆点征集页面上阅读更多关于提案过程和NASA感兴趣的领域的信息。", "note_en": "The space agency is almost always accepting applications for at least one of its many grant and contract programs, and Tipping Point is directly aimed at commercial space capabilities that need a bit of a boost. According to the program description, “a technology is considered at a tipping point if an investment in a demonstration will significantly mature the technology, increase the likelihood of infusion into a commercial space application, and bring the technology to market for both government and commercial applications.”\n  In this year’s awards, which take the form of multi-year contracts with multiple milestones, the focus was on two main areas: cryogenics and lunar surface tech. Note that the amounts provided are not necessarily the cost of developing the tech, but rather the sums deemed necessary to advance it to the next stage. Here’s a brief summary of each award:\n  ULA, $86.2M: Demonstration of a smart propulsion cryogenic system on a Vulcan Centaur upper stage\n  Alpha Space Test and Research Alliance, $22.1M: Develop a small tech and science platform for lunar surface testing\n Astrobotic, $5.8M: “Mature” a fast wireless charging system for use on the lunar surface\n Intuitive Machines, $41.6M: Develop a hopper lander with a 2.2-pound payload capacity and 1.5-mile range\n Masten Space Systems, $2.8M: Demonstrate a universal chemical heat and power source for lunar nights and craters\n Masten Space Systems, $10M: Demonstrate precision landing an hazard avoidance on its Xogdor vehicle (Separate award under “descent and landing” heading)\n Nokia of America, $14.1M: Deploy the first LTE network in space for lunar surface communications\n pH Matter, $3.4M: Demonstrate a fuel cell for producing and storing energy on the lunar surface\n  Sierra Nevada, $2.4M: Demonstrate a device using solar energy to extract oxygen from lunar regolith\n SSL Robotics, $8.7M: Develop a lighter, cheaper robotic arm for surface, orbital, and “terrestrial defense” applications\n Teledyne Energy Systems, $2.8M: Develop a hydrogen fuel cell power system with a 10,000-hour battery life\n You can read more about the proposal process and NASA’s areas of interest  at the Tipping Point solicitation page.", "posttime": "2020-10-15 02:17:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,nasa,美国国家航空航天局,point,技术", "title": "美国国家航空航天局(NASA)向14家公司提供3.7亿美元用于“引爆点”技术", "title_en": "NASA Loads 14 Companies With $370M For 'Tipping Point' Technologies", "transed": 1, "url": "https://techcrunch.com/2020/10/14/nasa-loads-14-companies-with-370m-for-tipping-point-technologies/", "via": "", "real_tags": ["美国", "nasa", "美国国家航空航天局", "point", "技术"]}, {"category": "", "categoryclass": "", "imagename": "e08192d5c9d751a3670dbd2e69142bde.jpeg", "infoid": 1028849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约最高金融监管机构表示，在今年夏天twitter受到成功的网络攻击后，应该成立一个专门的监管机构来监督大型社交媒体平台，这些平台也应该被指定为具有系统重要性的平台。\n纽约州金融服务部(New York State Department Of Financial Services)星期三提出这些建议，这是一份关于7月15日袭击事件的37页报告的一部分。报告中有一些著名的账户，包括前副总统、民主党总统候选人乔·拜登(Joe Biden)和特斯拉公司(Tesla Inc.)的账户。首席执行官埃隆·马斯克(Elon Musk)被用来推动一场加密货币骗局。自那以后，当局指控三人在几个月的时间里冒充员工，进入Twitter的账户，并向诈骗者出售凭证，从而侵入Twitter的系统。\nDFS在其报告中表示，黑客策略的相对简单以及最大的社交媒体平台的覆盖范围表明，需要一个专门的监管机构。虽然这些公司受到某些州法律的约束-比如纽约州2019年的《制止黑客并改善电子数据安全法案》-并受到美国证券交易委员会(Securities And Exchange Commission)、司法部(Justice Department)和联邦贸易委员会(Federal Trade Commission)的一定监督，但没有具体的监管机构对社交媒体进行整体监管。\n“社交媒体平台已经迅速成为新闻和信息的主要来源，但没有一个监管机构对其网络安全进行足够的监督。推特容易受到简单攻击的事实表明，自我监管不是解决问题的办法。“金融服务总监琳达·莱斯韦尔(Linda Lacewell)在报告随附的一份声明中表示。\n“保护人们的隐私和安全是Twitter的首要任务，我们不能掉以轻心，”该公司的一位发言人说。这位发言人补充说，Twitter配合了DFS的调查，此后推出了一系列致力于安全和隐私的倡议，包括对员工的培训。\nDFS建议，新的监管机构可以是现有机构的一部分，也可以是一个独立的机构，应该被允许将最大的社交媒体平台指定为具有系统重要性的平台。这个标签通常是为支撑金融市场的非常大的银行和机构保留的，它们比同行受到更严格的监管。\n例如，DFS认为，故意错误信息在社交网络上迅速传播的能力表明，有必要对这些公司的网络安全进行更严格的监督和专门的监管。\nDFS在其报告中称赞了其直接监管的加密货币交易所的行动，同时批评了Twitter的网络安全安排。DFS表示，这家社交媒体公司自2019年12月以来一直没有安全主管，数千名员工可以在最低限度的安全保护下访问其核心管理软件。Twitter从数据保护公司Rubrik Inc.聘请了Rinki Sethi。DFS表示，他于9月份担任首席信息安全官，此后一直限制员工访问其平台上的关键功能。\nDFS表示，在Twitter黑客攻击期间，加密货币交易所阻止了价值150万美元的约6000笔交易，理由是自己的网络安全法规是他们做好准备的一个原因，尽管交易所因网络安全控制不力而受到批评。\n近年来，议员们就社交网络的运营举行了几次听证会，国会委员会最近举行的听证会包括审查他们如何通过自己的平台处理激进主义以及反垄断问题。Twitter、Facebook和Alphabet Google的高管定于10月28日出席参议院商务委员会(Senate Commerce Committee)的听证会，讨论一项保护公司对用户发布的内容承担责任的规定。", "note_en": "New York’s top financial watchdog said a dedicated regulator should oversee large social-media platforms, which should also be designated as systemically important, following a successful cyberattack on  Twitter  during the summer.\n  The New York State Department of Financial Services made the recommendations Wednesday as part of a 37-page report about the July 15 attack in which a number of prominent accounts, including those of former Vice President and Democratic Party presidential candidate Joe Biden and Tesla Inc. Chief Executive Elon Musk,  were used to promote a cryptocurrency scam. Authorities have since  charged three people with breaking into Twitter’s systems over a period of months by posing as employees, gaining access to accounts and selling credentials to scammers.\n  The relative simplicity of the hackers’ tactics and the reach of the largest social-media platforms shows that a dedicated regulator is needed, DFS said in its report. While these companies are subject to certain state laws—such as New York’s 2019 Stop Hacks and Improve Electronic Data Security Act—and fall under some oversight from the Securities and Exchange Commission, the Justice Department and the Federal Trade Commission, no specific regulatory agency oversees social media as a whole.\n    “Social-media platforms have quickly become the leading source of news and information, yet no regulator has adequate oversight of their cybersecurity. The fact that Twitter was vulnerable to an unsophisticated attack shows that self-regulation is not the answer,” said Superintendent of Financial Services Linda Lacewell in a statement accompanying the report.\n    “Protecting people’s privacy and security is a top priority for Twitter, and it is not a responsibility we take lightly,” a spokesperson for the company said. Twitter cooperated with the DFS investigation and has since launched a number of initiatives dedicated to security and privacy, including training for employees, the spokesperson added.\n  DFS recommended that the new regulator, which could be a part of an existing agency or a stand-alone body, should be allowed to designate the largest social media platforms as systemically important. The label is usually reserved for the very largest banks and institutions underpinning financial markets, which are subject to stronger oversight than their peers.\n  The ability for deliberate misinformation to spread quickly over social networks, for instance, demonstrates the necessity for greater oversight and dedicated regulation for cybersecurity at these companies, DFS argued.\n  In its report, DFS lauded the actions of cryptocurrency exchanges, which it directly regulates, while criticizing Twitter for its cybersecurity arrangements. The social-media company had been without a security chief since December 2019, DFS said, and access to its core administration software was available to thousands of staff with minimal security protections. Twitter hired Rinki Sethi from data-protection company Rubrik Inc. as chief information security officer in September, and has since limited staff access to key functions on its platform, DFS said.\n    During the Twitter hack, cryptocurrency exchanges blocked around 6,000 transactions worth $1.5 million, DFS said, citing its own cybersecurity regulations as a reason for their preparedness, although exchanges  have been criticized for weak cybersecurity controls.\n  Lawmakers have held several hearings regarding the operations of social networks in recent years, and  recent hearings held by Congressional committees have included examinations of how they handle radicalization through their platforms as well as antitrust concerns. Top executives from Twitter,  Facebook  and  Alphabet  Google are scheduled to appear before the Senate Commerce Committee on Oct. 28 regarding a rule that shields companies from liability for the content their users post.", "posttime": "2020-10-15 02:16:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,机构,twitter", "title": "纽约最高金融监管机构援引Twitter被黑客攻击的话说，社交媒体平台需要被指定为“具有系统重要性”，并有一个专门的监管机构", "title_en": "Citing Twitter's hack, NY's top financial watchdog says social media platforms need to be designated “systemically important” and have a dedicated regulator", "transed": 1, "url": "https://www.wsj.com/articles/new-york-regulator-urges-oversight-for-social-media-giants-11602683181?mod=djemalertNEWS", "via": "", "real_tags": ["黑客", "机构", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，从音乐推荐(van den Oord et al.，2013；McFee&amp；Lanckriet，2011)到音乐生成(Driedger et al.，2015)，机器学习方法在从音乐推荐(van den Oord et al.，2013；McFee&amp；Lanckriet，2011)到音乐生成(Driedger et al.，2015)等一系列问题上的有效性让音乐研究受益；另请参阅谷歌(Google)的Magenta项目最近的演示。在计算机视觉和语音处理的相关领域中，使用端到端深度体系结构的学习特征表示已经在图像分类和语音识别等任务中取得了巨大的进步。这些受监督的架构依赖于大型标签数据集，例如ImageNet(Russakovsky等人，2015年)。受这些方法的成功启发，我们创建了MusicNet，作为在音乐领域探索这些技术的项目的开始。具体地说，我们建议将MusicNet标签作为一种工具来解决以下任务：更广泛地说，我们希望MusicNet能够成为更具创造性的任务的资源。自动配乐，即从录音中推断出乐谱，是音乐信息检索领域的一个长期悬而未决的问题。传统上，音乐流媒体服务基于协作过滤和元数据(例如，艺术家和流派标签)进行推荐。最近，一些服务已经开始将音频功能整合到他们的推荐引擎中。从MusicNet标签学到的功能可能对推荐有用。我们还对能够在各种约束下制造性能的生成模型感兴趣。我们能不能在给分数的情况下学习综合一场表演呢？我们能用勃拉姆斯的旋律创作出巴赫风格的赋格吗？我们鼓励将MusicNet用于其他创造性的音乐处理应用程序。音乐数据集的许可分发通常受到版权限制的限制。MusicNet标签仅适用于知识共享和公共领域录制，因此我们可以分发和重新分发MusicNet标签及其相应的录制。MusicNet背后的音乐来源于伊莎贝拉·斯图尔特·加德纳博物馆(Isabella Stewart Gardner Museum)、欧洲档案馆(European Archive)和Musopen。我们感谢这些机构的表演者和工作人员的慷慨贡献。没有他们，我们的工作就不可能完成。确认这项工作得到了华盛顿研究基金会数据密集型发现创新基金以及机器和大脑学习计划(CIFAR)的支持。", "note_en": "Music research has benefited recently from the effectiveness of machine learning methods on a wide range of problems from music recommendation ( van den Oord et al., 2013;  McFee &amp; Lanckriet, 2011) to music generation ( Driedger et al., 2015); see also the recent demos of Google&#39;s  Magenta project. In the related fields of computer vision and speech processing, learned feature representations using deep end-to-end architectures have lead to tremendous progress in tasks such as image classification and speech recognition. These supervised architectures depend on large labeled datasets, for example  ImageNet ( Russakovsky et al., 2015). Inspired by the success of these methods, we have created MusicNet as the beginning of a project to explore these techniques in the realm of music.  Specifically, we propose the MusicNet labels as a tool to address the following tasks:    More broadly, we hope that MusicNet can be a resource for more creative tasks. Automatic music transcription, inferring a musical score from a recording, is a  long-standing open problem in the music information retrieval community. Music streaming services traditionally make recommendations based on collaborative filtering and metadata (e.g. artist and genre tags). Recently, some services have begun to  incorporate audio features into their recommendation engines. Features learned from the MusicNet labels might be useful for recommendation. We are also interested in  generative models that can fabricate performances under various constraints. Can we learn to synthesize a performance given a score? Can we generate a fugue in the style of Bach using a melody by Brahms?  We encourage the use of MusicNet for other creative music processing applications.    Licensing  Distribution of music datasets is often constrained by copyright restrictions. The MusicNet labels apply exclusively to Creative Commons and Public Domain recordings, and as such we can distribute and re-distribute the MusicNet labels together with their corresponding recordings. The music that underlies MusicNet is sourced from the  Isabella Stewart Gardner Museum, the  European Archive, and  Musopen. We thank the performers and staff at these institutions for their generous contributions. Without them, our work would not have been possible.    Acknowledgements  This work was supported by the Washington Research Foundation Fund for Innovation in Data-Intensive Discovery, and the program &#34;Learning in Machines and Brains&#34; (CIFAR).", "posttime": "2020-10-15 01:57:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "musicnet,音乐", "title": "MusicNet(2016)", "title_en": "MusicNet (2016)", "transed": 1, "url": "https://homes.cs.washington.edu/~thickstn/musicnet.html", "via": "", "real_tags": ["musicnet", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我希望在我一直在开发的一个应用程序上升级Postgres版本。这将需要少量的停机时间，可能约为10分钟。\n在这些情况下，我想要的默认解决方案是进入Heroku的维护模式，该模式提供一个带有503ServiceUnailable状态代码的HTML维护页面。这是可行的，但在升级过程中会使应用程序完全不可用，我希望能找到更好的解决方案。在本例中，我还希望能够提供JSON响应，因为应用程序主要为移动应用程序提供API。\n在研究了几个不成熟的选项之后，我决定使用仅限区域的数据库连接，以仍然允许读取，但防止任何写入发生。在使用只读连接时，Postgres适配器会在我们试图更改数据库中的数据时引发错误，但我们可以轻松地修复此特定错误并将其转换为面向用户的通知。我觉得使用异常作为这个工作流程的核心有点奇怪，但最终，它工作得非常好，所以我想分享一下具体细节。\n值得一提的是，这个解决方案特别适合这个特定的应用程序，它只提供一个API，使用起来非常繁重，但我想它也可以扩展到与其他风格的应用程序一起使用。\n如果存在，Rails将使用DATABASE_URL环境变量中的连接字符串连接到数据库。按照Rails指南中的连接首选项说明，我意识到可以明确使用DATABASE_URL并允许临时覆盖。为此，我为生产环境添加了一个具有所需连接首选项的显式urlproperty：\n准备就绪后，我只需设置DATABASE_URL_READ_ONLY环境变量即可启用只读模式：\n注意：我能够使用Heroku的Postgres凭证界面创建只读用户，但是如果您不使用Heroku，您应该能够使用这些说明来创建您的只读用户。\n使用我考虑的其他方法，我发现我必须关闭向数据库发出写入的多个不同的潜在方式，但是只读连接可以很好地在一次更改中切断所有内容。这就是说，这只是解决方案的一半，因为我当然不想让错误让它变得更糟。\n谢天谢地，提供集中式救援相对简单，这样我就可以处理所有错误。首先，我使用Rails的ActiveSupport：：Concern功能创建了一个模块：\n#app/controllers/concerns/read_only_controller_support.rb模块只读控制器支持扩展ActiveSupport：：Concerns Included Do IF ENV[&#34；DATABASE_URLREAD_ONLY&#34；]。现在时?。REASURE_FROM ActiveRecord：：StatementInvalid DO|ERROR|IF ERROR。留言。是否匹配？(/pg：：不充分权限/i)Render(status：：service_unavailable，json：{info：&#34；应用当前处于只读维护模式。请稍后重试。&#34；，}，)否则引发错误END END END。\n当包含该模块时，该模块将使用Rails的REASE_FROM方法来捕获可能相关的错误，然后我们在该块内进行快速检查，以确保我们只捕获相关的错误。\n注意，RESAVE_FROM逻辑仅在设置了DATABASE_URL_READ_ONLY时才启用，因此我们可以重用该变量的存在作为确定此行为范围的一种方式。\n我最初使用这种只读模式的用例只需要支持API请求，但我可以想象将其扩展到HTML和基于表单的界面。\n我要考虑的第一件事是添加一个站点范围的横幅，声明我们处于只读维护模式，以提醒用户当前状态。\n有了这些，我认为我们可以扩展ReadOnlyControllerSupport模块中的错误处理，以将用户重定向回来并显示异常消息：\nREASURE_FROM ActiveRecord：：StatementInvalid DO|ERROR|IF ERROR。留言。是否匹配？(/PG：：不充分权限/I)RESPONSE_TO|FORMAT|FORMAT。JSON DO#JSON错误消息，如上所示结束格式。HTML DO REDIRECT_BACK(FLABACK_LOCATION：ROOT_PATH，ALERT：&#34；应用程序当前处于只读维护模式。请稍后重试。&#34；，)END END否则引发错误END END\n这里的另一个注意事项是关于后台作业和调度程序进程。对于后台工作，事情相对简单-我们只需要在只读期间将我们的工作人员池缩减到零即可。\n调度器进程有点棘手，因为我没有全局启用或禁用它们的机制。考虑到这一点，我认为理想的解决方案是只让调度程序进程将作业排入队列，而不实际执行任何超出该队列的工作。\n我们遇到的最后一个症结是移民。我们在Procfile中定义了一个RELEASE命令，该命令被配置为运行rake db：Migrate。不幸的是，即使没有运行迁移，Rails仍会尝试写入ar_Internal_METADATA表，作为db：Migratecomand的一部分，并且Heroku将在我们更改环境的任何时候运行Release命令。在我最初的尝试中，当我尝试设置DATABASE_URL_READ_ONLY时，Heroku失败了，因为在运行rake db：Migrate时，相关的Release命令遇到了只读错误。\n为了解决这个问题，我编写了一个小脚本，它首先检查是否有任何迁移需要运行，并且只有在有的情况下才会运行，然后运行rakedb：Migrate：\n此脚本作为bin/Migrate-if-Need添加到repo，然后将我们的调用放到rake db：Migrate with bin/Migrate-if-Need", "note_en": "Recently I was looking to upgrade the Postgres version on an application I’vebeen working on. This would require a small amount of downtime, likely about 10minutes.\n The default solution I’d reach for in these cases would be to go into Heroku’smaintenance mode, which serves an HTML maintenance page with a  503 ServiceUnavailable status code. This works but makes the application entirelyunusable during the upgrade, and I was hoping to find a better solution. In thisparticular case, I also wanted to be able to provide JSON responses as theapplication mainly provides an API for a mobile app.\n After  exploring a handful of half-baked options, I settled on using aread-only connection to the database to still allow reads but prevent anywrites from occurring. While using the read-only connection, the Postgres adapterwill raise an error any time we attempt to change data in the database, but wecan easily rescue this specific error and convert it to a user-facing notice. Ifelt a bit odd using exceptions as the core of this workflow, but in the end, itworked out really well, so I wanted to share the specifics.\n It’s worth noting that this solution is particularly well suited to thisspecific application, which only provides an API and has very read-heavy usage,but I imagine it could be extended to work with other styles of app as well.\n  If present, Rails will use the connection string in a  DATABASE_URL env var toconnect to the database. Following the  Connection Preference notes in theRails guides, I realized that I could make this  DATABASE_URL usage explicitand allow for a temporary override. To do this, I added an explicit  urlproperty for the production environment with desired connection preference:\n  With this in place, I can enable the read-only mode simply by setting the DATABASE_URL_READ_ONLY env var:\n    Note: I was able to use  Heroku’s Postgres Credentials interface to createthe read-only user, but if you’re not working with Heroku you should be able touse  these instructions to create your read-only user.\n  With other approaches I considered I found that I had to close off multipledifferent potential ways to issue writes to the database, but the read-onlyconnection worked well to cut everything off in one change. That said, itwas only half the solution, as I certainly didn’t want the errors making it tousers.\n Thankfully it was relatively straightforward to provide a centralized  rescuethat would allow me to handle all the errors. First, I created a module usingRails’s  ActiveSupport::Concern functionality:\n # app/controllers/concerns/read_only_controller_support.rb module  ReadOnlyControllerSupport  extend  ActiveSupport :: Concern  included  do  if  ENV [ &#34;DATABASE_URL_READ_ONLY&#34; ]. present?  rescue_from  ActiveRecord :: StatementInvalid  do  | error |  if  error . message . match? ( /PG::InsufficientPrivilege/i )  render (  status: :service_unavailable ,  json:  {  info:  &#34;The app is currently in read-only maintenance mode. Please try again later.&#34; ,  },  )  else  raise  error  end  end  end  end end\n When included, this module will use Rails’s   rescue_from method to capturepotentially relevant errors, and then we do a quick check within that blockto make sure we’re only capturing the relevant errors.\n Note, the  rescue_from logic is only enabled when the  DATABASE_URL_READ_ONLYis set, so we’re able to reuse the existence of that variable as a way to scopethis behavior.\n    My initial use case for this read-only mode only needed to support API requests,but I could imagine extending it to HTML and form-based interfaces.\n The first thing I would consider would be adding a sitewide banner that statedthat we were in a read-only maintenance mode to alert users to the currentstatus.\n With that in place, I think we could extend the error handling in the ReadOnlyControllerSupport module to redirect the user back and display arelevant message:\n rescue_from  ActiveRecord :: StatementInvalid  do  | error |  if  error . message . match? ( /PG::InsufficientPrivilege/i )  respond_to  do  | format |  format . json  do  # JSON erorr message as shown above  end  format . html  do  redirect_back (  fallback_location:  root_path ,  alert:  &#34;The app is currently in read-only maintenance mode. Please try again later.&#34; ,  )  end  end  else  raise  error  end end\n  One additional consideration here would be around background jobs and schedulerprocesses. For background jobs things are relatively straightforward – we justneed to scale our worker pool down to zero for the read-only period.\n Scheduler processes are a little trickier as I didn’t have a mechanism forglobally enabling or disabling them. With that in mind, I think the idealsolution would be to only ever have scheduler processes enqueue jobs but notactually do any work beyond that.\n  The final sticking point we ran into was migrations. We have a  release commanddefined in our  Procfile that was configured to run  rake db:migrate.Unfortunately, it turns out that even if no migrations run, Rails will stillattempt to write to the  ar_internal_metadata table as part of the  db:migratecommand, and Heroku will run the release command any time we change an env. Inmy initial attempt, Heroku failed when I attempted to set the DATABASE_URL_READ_ONLY as the associated release command hit the read-onlyerror when running  rake db:migrate.\n To work around this I wrote a small script that first checks if thereare any migrations that need to be run, and only if there are, then runs  rakedb:migrate:\n  This script was added to the repo as  bin/migrate-if-needed, and then wereplaced our call to  rake db:migrate with  bin/migrate-if-needed", "posttime": "2020-10-15 01:56:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模式,mode", "title": "只读模式可缩短Rails停机时间", "title_en": "Read-Only Mode for Better Rails Downtime", "transed": 1, "url": "https://ctoomey.com/writing/read-only-mode-for-better-rails-downtime/", "via": "", "real_tags": ["模式", "mode"]}]