[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073399, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当连环创始人苏尼尔·保罗（Sunil Paul）转行成为风险投资家后，他决定重返初创企业，这是在他十多年来试图放弃金融科技公司Spring Free EV背后的理念之后。想法很简单；通过向车主收取每英里的费用来降低电动汽车的初始成本。在加利福尼亚州的野火导致了他所谓的“橙色天空日”之后，他知道他必须找到一种方法，通过让美国开车最多的人更容易使用电动汽车来应对气候危机。他与达雷尔和约旦一起讨论世界末日，招募一名关注气候变化的金融科技人员，筹款，当然，加拿大也来过几次。\n现场搜索的RSVP。不要错过收听《早起》剧集、与达雷尔、乔丹和他们的客人互动的机会。2月17日，美国东部时间上午10点/下午1点，托尔·弗里德里克森（Thor Fridriksson）将讲述他推出两款病毒式游戏并创建新公司洛基路（Rocky Road）的经历。\n参加我们的听众调查，让我们了解一下你自己以及你对调查结果的看法。", "note_en": "When serial founder turned venture capitalist Sunil Paul decided to step back into startups, it was only after trying to give away the idea behind his fintech company Spring Free EV for over a decade. The idea is simple; bring down the initial cost of electric vehicles by charging owners a fee per mile. And after the wildfires in California lead to what he called the “orange sky day” he knew he had to figure out a way to do more to address the climate crisis by making EVs more accessible to the people who drive the most in the U.S. He joins Darrell and Jordan to talk about the end of the world, recruiting as a climate-focused fintech, fundraising and, of course, Canada came up a few times too.\n RSVP for Found Live. Don’t miss your chance to listen to episodes of Found early and interact with Darrell, Jordan and their guests. On February 17th at 10am PT/ 1pm ET, Thor Fridriksson will be talking about his experience launching two viral games and founding his new company, Rocky Road.\n Take our listener survey and let us know a bit about yourself and what you think of Found.", "posttime": "2022-02-15 11:51:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "利用,fintech,电动汽车", "title": "一位创始人如何利用fintech让更多电动汽车上路", "title_en": "\n\t\t\t\tHow one founder is using fintech to get more EVs on the road\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/how-one-founder-is-using-fintech-to-get-more-evs-on-the-road/", "via": "", "real_tags": ["利用", "fintech", "电动汽车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073398, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这似乎有悖常理，但Wingback上的第一个人是遥控器的一个分数头——这是我们做出的最好的决定。\n我和我的联合创始人托本·弗里赫（Torben Friehe）都知道，我们想成为一家异步、完全远程的公司，我们打算快速发展。当然，我们的第一个员工可能是后端工程师或销售专家。但我们以前从未尝试过领导一个远程团队——我们第一次一起创业完全是面对面的。如果我们仅仅因为不知道如何经营一家虚拟公司而对第一批员工管理不善，那会怎么样？\n如果你有领导远程团队的经验，也许没有必要让一个人专门负责远程工作流程，但对其他人来说，这一角色在帮助确保员工朝着同一个方向前进方面的重要性是很难夸大的：对于创始人和初创公司CEO来说尤其如此，他们的时间和精力都很紧张（更不用说我们的沟通技巧可能很缺乏）。\n作为早期创始人，你最重要的任务是专注于你的产品，确保你雇佣了合适的人，而不是花时间确保每个团队成员的假期都得到批准或阅读了公司政策。", "note_en": "It might seem counterintuitive, but the first person on board at Wingback was a Fractional Head of Remote — and it was the best decision we made.\n My co-founder, Torben Friehe, and I knew we wanted to be an asynchronous, fully remote company, and we intended to grow fast. Sure, our first hire could have been a backend engineer or a sales guru. But we’d never attempted to lead a remote team before — our first startup together was entirely in-person. What if we mismanaged our first employees simply because we had no idea how to run a virtual company?\n  If you have experience leading remote teams, having someone dedicated to remote work processes might not be necessary, but for anyone else, it’s hard to overstate how critical this role is in helping ensure your employees are rowing in the same direction: It’s particularly true for founders and startup CEOs, whose time and mental energy is stretched thin as it is (not to mention our communication skills can be, well, lacking).\n As an early-stage founder, your most important task is focusing on your product and making sure you hire the right people, not spending your time making sure each team member has gotten their vacation time approved or has read the company policies.", "posttime": "2022-02-15 11:50:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "部分,hire", "title": "我们这家初创公司的第一位员工是一名遥控器的部分负责人", "title_en": "\n\t\t\t\tOur startup’s first hire was a fractional Head of Remote\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/our-startups-first-hire-was-a-fractional-head-of-remote/", "via": "", "real_tags": ["部分", "hire"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073396, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据SEC的声明，BlockFi将直接向SEC支付5000万美元的罚款，另外5000万美元将以罚款的形式向美国32个州支付，以解决类似的指控。\n“遵守我们的注册和披露要求对于向投资者提供他们在加密资产领域做出明智投资决策所需的信息和透明度至关重要，”SEC执法总监古比尔·S·格雷瓦尔（Gurbir S.Grewal）说。\n自成立以来，BlockFi已经从投资者那里筹集了4.5亿美元的资金。其最新一轮是去年3月价值3.5亿美元的D系列，该系列对该公司的估值为30亿美元，由贝恩资本风险投资公司（Bain Capital Ventures）牵头，该公司是DST Global、Pomp Investments和Tiger Global的合伙人。\n根据BlockFi的网站，该公司的利息账户允许用户每月以他们持有的加密货币赚取高达APY 9.25%的利息。根据SEC的新裁决，BlockFi的账户被视为证券，因为其用户将货币借给该公司。\nSEC称，BlockFi还作为一家投资公司非法运营了18个月。在此期间，该公司发行了证券，并达到了符合投资公司资格的基于资产的门槛——尽管未注册为投资公司。\n除了注册问题，SEC还声称BlockFi在其贷款组合和贷款活动的风险水平上误导了投资者。\n作为和解协议的一部分，BlockFi同意停止销售其未注册的贷款产品。它今天还宣布打算注册一种新的、合规的贷款产品，名为BlockFi收益率，它说这将是第一个在SEC注册的加密计息证券。\n数字资产律师马克斯·迪伦多夫（Max Dilendof）告诉TechCrunch，这一消息对新兴的分散金融（decentralized finance，简称DeFi）生态系统是一个巨大的打击。他说，SEC通过对BlockFi的行动，基本上“消灭”了DeFi贷款业务模式。\nDilendof说，如果一家加密公司想继续销售有息的DeFi产品，它就需要通过提交S-1注册声明，基本上成为一家上市公司。他补充说，提交S-1声明等同于启动首次公开募股（IPO），这可能是一个成本高昂的过程，要求购买DeFi产品的投资者必须获得认证，除非他们寻求（并赢得）特定豁免。\nDilendof说：“（提交S-1）与DeFi完全不兼容。BlockFi成功的唯一原因是，它有许多个人用户，他们只是在连接Metamask钱包或其他东西，并赚取利息。”。\n对于该领域较小的参与者来说，新规则的监管负担及其相关成本可能会造成严重后果。\nDilendof说：“BlockFi可能有能力继续（提供注册证券），尽管结果尚不确定，因为它是一家价值30亿美元的公司。”。“一个较小的DeFi协议怎么样？如果他们成为类似执法行动的目标，他们将被消灭。”", "note_en": "BlockFi will pay $50 million of the penalty directly to the SEC and the other $50 million in the form of fines to 32 U.S. states to settle similar charges, according to the SEC’s statement.\n “Adherence to our registration and disclosure requirements is critical to providing investors with the information and transparency they need to make well-informed investment decisions in the crypto asset space,” said SEC enforcement director Gurbir S. Grewal.\n  BlockFi  has raised $450 million in funding from investors since its inception. Its latest round was a $350 million Series D last March that valued the company at $3 billion, led by Bain Capital Ventures, partners of DST Global, Pomp Investments and Tiger Global.\n The company’s interest accounts allowed users to earn a monthly interest payment amounting to up to 9.25% APY on cryptocurrency they held, according to  BlockFi’s website. Under the new SEC ruling, BlockFi’s accounts are considered securities because their users lend currency to the firm.\n BlockFi also illegally operated for 18 months as an investment company, the SEC said. During this period, the company issued securities and met an asset-based threshold qualifying it as an investment company — despite not being registered as such.\n In addition to the registration issues, the SEC claims BlockFi misled investors about the level of risk in its loan portfolio and lending activity.\n  As part of the settlement, BlockFi agreed to cease sales of its unregistered lending product. It also  announced today its intent to register a new, compliant lending product, called  BlockFi Yield, which it says would be the first SEC registered crypto interest-bearing security.\n The news comes as a huge blow to the emerging decentralized finance (DeFi) ecosystem, digital asset attorney  Max Dilendorf told TechCrunch, saying the SEC has essentially “wiped out” the DeFi lending business model with its action against BlockFi.\n If a crypto company wanted to continue selling interest-bearing DeFi products, it would need to essentially become a publicly traded company by filing an S-1 registration statement, Dilendorf said. Filing an S-1 statement equates to launching an initial public offering (IPO), which can be a costly process, requiring investors who buy into DeFi products to be accredited unless they seek (and win) specific exemptions, he added.\n “[Filing an S-1] is not compatible with DeFi at all. The only reason why BlockFi succeeded is because it had many individual users who were just connecting their Metamask wallets or whatnot, and earning interest,” Dilendorf said.\n For smaller players in the space, the regulatory burden of the new rules and their associated cost could be crippling.\n “BlockFi can probably afford to go forward with [offering registered securities] even though the outcome is not certain, because  it’s a $3 billion company,” Dilendorf said. “What about a smaller DeFi protocol? They are going to get wiped out if they become targets of similar enforcement action.”", "posttime": "2022-02-15 11:45:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sec", "title": "BlockFi与SEC达成的1亿美元和解对DeFi贷款的未来意味着什么", "title_en": "\n\t\t\t\tWhat BlockFi’s $100M settlement with the SEC means for future of DeFi lending\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/what-blockfis-100m-settlement-with-the-sec-means-for-future-of-defi-lending/", "via": "", "real_tags": ["sec"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073395, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这项宣布标志着一项试点计划的扩大，2021年11月在10个车站展开试点。首席执行官埃隆·马斯克最初表示有兴趣在同年夏天向其他电动汽车开放增压器网络。\n与其他汽车制造商不同，特斯拉运营着一个庞大的专有网络，该网络此前曾阻止其他汽车制造商的电动汽车使用充电器。特斯拉于2012年开始建设该网络，目前全球共有3万个增压站。\n非特斯拉车辆现在可以通过特斯拉应用程序在荷兰的所有增压器上充电。了解更多信息请访问https://t.co/hjybH0ROdl照片。啁啾com/zjomySylf9\n该公司的试点项目允许荷兰和其他欧洲国家（包括法国、挪威和比利时）的非特斯拉电动汽车司机通过特斯拉应用为汽车充电——该汽车制造商尚未将其汽车充电站与PlugShare等其他电动汽车充电站集成。\n特斯拉使用的专用插头仅适用于特斯拉车辆，因此该试验仅适用于启用联合充电系统（CCS）的车辆。增压器柱有两条电缆；非特斯拉汽车可以使用CCS连接器，这可能不适用于所有汽车——特斯拉表示，如果出现这种情况，司机将向其客户支持中心报告问题。\n根据特斯拉的说法，非特斯拉电动汽车可能会因为在特斯拉的站点充电的乐趣而收取更多的费用，这是因为“为各种车辆充电以及调整我们的站点以适应这些车辆而产生的额外成本”。也就是说，如果司机购买充电会员，每千瓦时的收费价格可能会降低。\n特斯拉表示，它将从一些精选的网站开始，以便“在扩张之前回顾经验、监控拥堵情况并评估反馈”只有在有可用容量的情况下，未来的站点才会对非特斯拉车辆开放。\n荷兰拥有欧洲最多的电动汽车充电站，有75000个充电站，这为特斯拉进一步测试这一试点提供了一个竞争平台。根据特斯拉的网站，特斯拉在荷兰有33个电视台，其中18个新电视台“即将推出”。", "note_en": "The announcement marks an expansion of a pilot program that kicked off in November 2021 with 10 stations. CEO Elon Musk had initially expressed interest in opening up the Supercharger network to other EVs in the summer of the same year.\n Unlike other automakers, Tesla operates an expansive proprietary network that has previously prevented EVs from other automakers from using the chargers. The network, which Tesla began building in 2012, now numbers 30,000 Supercharging stations globally.\n  Non-Tesla vehicles can now charge at all Superchargers in the Netherlands via the Tesla app. Learn more at  https://t.co/hjybH0ROdl  pic.twitter.com/zjomySylf9\n The company’s  pilot program lets non-Tesla EV drivers in the Netherlands and some stations in other European countries, including France, Norway and Belgium charge their cars via the Tesla app — the automaker has not yet integrated its stations with other EV station collators like PlugShare.\n Tesla uses a proprietary plug that only fits into Tesla vehicles, so the pilot is only accessible for combined charging system-enabled (CCS) vehicles. Supercharger posts have two cables; non-Tesla cars can use the CCS connector, which may not fit with all cars — if that happens, Tesla says drivers are to report the problem to its customer support center.\n  Non-Tesla EVs might get charged more for the pleasure of charging at Tesla’s sites, due to the “additional costs incurred to support charging a broad range of vehicles and adjustments to our sites to accommodate these vehicles,” according to Tesla. That said, the per kWh price to charge might be lowered if drivers purchase a charging membership.\n Tesla said it is starting with a select number of sites so it can “review the experience, monitor congestion and assess feedback before expanding.” Future sites will only be opened to non-Tesla vehicles if there is available capacity.\n The Netherlands has the  largest number of EV charging stations in Europe, with 75,000 stations, which gives Tesla a competitive playground to further test this pilot. Tesla has 33 stations in the Netherlands, with 18 new stations “coming soon,” according to  Tesla’s website.", "posttime": "2022-02-15 11:44:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,电动汽车,opens,试点", "title": "特斯拉在荷兰向所有电动汽车开放了整个增压器网络", "title_en": "\n\t\t\t\tTesla opens entire Supercharger network in the Netherlands to all EVs\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/tesla-opens-entire-supercharger-network-in-the-netherlands-to-all-evs/", "via": "", "real_tags": ["特斯拉", "电动汽车", "opens", "试点"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "别忘了注册，让免费通讯版本的Max Q发送到你的收件箱。\n艾萨克曼现在支持一项名为“北极星”的新计划，该计划包括多达三项额外的载人SpaceX任务——所有任务都有私人宇航员参与。第一次太空行走将包括太空行走，目前计划在2022年底前进行。此次任务的机组人员包括艾萨克曼本人，以及上述去年Inspiration4飞行的任务主管，以及两名SpaceX操作工程师。\n这是一个大项目，与NASA经常执行的任务更为相似。如果第三次北极星发射达到高潮，目前将是SpaceX正在开发的搭载人类的星际飞船火箭的首次飞行，这将是私营航天行业的一个里程碑。\n艾萨克曼很可能正在资助历史上最雄心勃勃的私人人类太空项目，给了他在亿万富翁专属度假胜地吹嘘的权利，我们没有人被邀请去，他们甚至不承认那里存在。\n巨大的太空詹姆斯·韦伯望远镜已经拍摄了它的前几张照片——但它们并不那么令人印象深刻，因为它甚至还没有完全校准。这实际上是它的启动和镜像校准过程的一部分，但这是我们迄今为止看到的第一个证据，表明这台望远镜已经通过了所有的检查，也能够实际捕获图像。\n为了更好地测量，该望远镜还对其主镜进行了“自拍”，即NASA作为它的老自我。\nElon最喜欢的信息传递方式之一是邀请一群人（主要是他的公司和行业媒体的粉丝）参加“更新”，在更新过程中，他主要按照tin上说的做：告诉人们自上次他做这些事情以来项目的新情况。这些都比他在社交媒体上典型的、零星的突发性活动要复杂得多，也更详细，而且可以提供一个关于幕后发生了什么的实质性观察。\n2022年初的星际飞船更新是以完全堆叠的星际飞船原型和超重型推进器为背景的，这是一个令人印象深刻的视觉效果（与第一次星际飞船更新的背景相当，这是一个非常闪亮但有点破旧的没有推进器的早期星际飞船原型）。这次更新确实包含了很多新信息，包括SpaceX正在佛罗里达州的卡纳维拉尔角建立一个备用测试和发射基地，供星际飞船使用。\n与此同时，围绕其进展仍有很多问题，特别是在更新发生的博卡奇卡。美国联邦航空局（FAA）一直在对德克萨斯州的发射场进行标准环境影响评估，这似乎是限制轨道发射时间的因素之一（如果不是主要因素的话）。马斯克表示，3月份可能会有尝试，但周一上午来自美国联邦航空局的消息称，他们已将审查的最后期限从2月28日延长至3月28日，这样做的可能性较小。", "note_en": "Don’t forget to sign up to get the  free newsletter version of Max Q delivered to your inbox.\n  Isaacman is now behind a  new program called Polaris that includes plans for up to three additional crewed SpaceX missions — all featuring private astronauts. The first of those, which is currently set to take place before the end of 2022, will include a spacewalk. The crew for the missions includes Isaacman himself, as well as the mission director for  last year’s Inspiration4 flight mentioned above, and two SpaceX operations engineers.\n  It’s a big program, and one that more closely resembles the kinds of missions that NASA regularly performs. The culminating third Polaris launch, should it occur, is currently set to be the first flight of SpaceX’s in-development Starship rocket to carry humans on board, which would be quite a milestone for the private space industry.\n Isaacman is funding quite possibly the most ambitious private human space program in history, giving him bragging rights at the exclusive billionaire’s retreat none of us is invited to and which they won’t even admit exists.\n   The massive in-space James Webb telescope has  taken its first few photos — but they’re not all that impressive since the thing isn’t even fully calibrated yet. These are actually part of its startup and mirror alignment process, but they’re the first evidence we have seen yet that the telescope, which has been passing all check-outs, is also able to actually capture images.\n  For good measure, the telescope also took a “selfie” of its primary mirror, which is NASA being its cheugy old self.\n   One of Elon’s favorite information delivery methods is to invite a bunch of folks (mostly fans of his companies and industry media) to an “update,” during which he mostly does what’s said on the tin: Tell people things that are new about the project since the last time he did one of these things. These are much more involved and detailed than his typical, sporadic bursts of activity on social media, and can provide a material look at what’s going on behind the scenes.\n This early  2022 Starship update was set against the fully stacked Starship prototype and Super Heavy booster, an impressive visual (and one that rivals the background of the first Starship update, a very shiny but somewhat dilapidated early Starship prototype without the booster). The update did contain a lot of new information, including that SpaceX is setting up Cape Canaveral in Florida as a backup test and launch site for Starship.\n Meanwhile, a lot of questions remain around its progress, specifically in Boca Chica, where the update took place. The Texas site has been under scrutiny by the FAA for its standard environmental impact review for launch sites, and that seems to be one of the limiting factors (if not the main one) on timing for an orbital launch. Musk said March could see a try, but then news on Monday morning came from the FAA saying they’d extended the deadline for their review from February 28 to March 28, making that less likely.", "posttime": "2022-02-15 11:42:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "是否,guy,星际", "title": "麦克斯问：一个人是否在满足私人的人类空间需求？", "title_en": "\n\t\t\t\tMax Q: Is one guy building out private human space demand?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/max-q-is-one-guy-building-out-private-human-space-demand/", "via": "", "real_tags": ["是否", "guy", "星际"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073392, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "行动收获回报：提前定价现在生效，这意味着在你的钱包里保留更多的钱。买一张早起票，你可以省下300美元。您的通行证包括分组会议、联网、进入我们的世博园区以及现场活动后的视频点播。\n无论你是早期或后期的创始人、投资者、工程师或建筑商，还是专注于在城镇间推广新移动技术的政策和道德规范，本次活动都是为你而设。\n在小组讨论、一对一采访、小型、更亲密的分组会议和主题驱动的圆桌讨论中，你会听到高层流动领导人、经验丰富的风投、政府监管机构和主题专家的意见，并与他们进行交流。带着新鲜的视角和可操作的技巧离开，这些都有助于将你的业务提升到一个新的水平。\n为什么TC Sessions:Mobility 2022值得穿上运动裤，与人面对面交流？以下是FlashParking高级通信总监卡琳·马克（Karin Maake）如何描述她的IRL TC移动体验：\nTC会话移动性提供了几大好处。首先，建立具体伙伴关系的网络机会。第二，了解最新趋势和流动性将如何发展的机会。第三，未知初创公司与其他移动公司建立联系并建立品牌知名度的机会。\n说到机会，这里有一个极好的方法，可以从你的TC移动体验中收获更多机会。在我们的演示区插上你的创业旗帜，直接向业界最有影响力的创始人、投资者和媒体展示你的移动技术和人才。建立你的品牌，吸引更多的客户，发现新的机会。利用早期定价，购买早期创业演示包，节省200美元。该套餐包括四张完全通行证，所以请带上您的团队，覆盖更多的场地。\n别忘了去看看我们的户外游乐场，在那里你可以看到最新的电动自行车、滑板车和自动驾驶汽车。去吧，试驾一两次！\nTC会议：Mobility 2022将于5月18日至19日在加利福尼亚州圣马特奥举行。购买早起通行证，节省300美元，并准备好了解最新的移动技术和趋势——现场和面对面。这是一个很好的策略，可以让您的移动业务继续向前发展。\n贵公司是否有兴趣赞助或参加TC会议：Mobility 2022？填写此表格，联系我们的赞助销售团队。", "note_en": "Action reaps rewards: Early-bird pricing is now in effect, and that means keeping more money in your wallet.  Buy an early-bird pass and you’ll save $300. Your all-access pass includes breakout sessions, networking, access to our expo area and videos on-demand following the live event.\n Whether you’re an early- or late-stage founder, an investor, engineer or builder, or you’re focused on the policies and ethics of rolling out new mobility technologies across cities and towns, this event is meant for you.\n  During panel discussions, one-on-one interviews and smaller, more intimate breakout sessions and topic-driven roundtable discussions, you’ll hear from and engage with top mobility leaders, experienced VCs, government regulators and subject-matter experts. Walk away with fresh perspectives and actionable tips that can help drive your business to the next level.\n Why is TC Sessions: Mobility 2022 worth stowing your sweatpants and meeting people face-to-face? Here’s how Karin Maake, senior director of communications at FlashParking, described her IRL TC Mobility experience:\n TC Sessions Mobility offers several big benefits. First, networking opportunities that result in concrete partnerships. Second, the chance to learn the latest trends and how mobility will evolve. Third, the opportunity for unknown startups to connect with other mobility companies and build brand awareness.\n Speaking of opportunities, here’s an excellent way to reap even more opportunity from your TC Mobility experience. Plant your startup flag in our demo area and exhibit your mobility tech and talent directly to the industry’s most influential founders, investors and media. Build your brand, attract more customers and discover new opportunities. Take advantage of early-bird pricing,  buy an Early-Stage Startup Demo Package and save $200. The package includes four full-access passes, so bring your team and cover even more ground.\n  Don’t forget to check out our outdoor playground, where you can see the latest e-bikes, scooters and autonomous vehicles. Go ahead, take a test drive or two!\n TC Sessions: Mobility 2022 takes place on May 18-19 in San Mateo, California.  Buy an early-bird pass, save $300 and get ready to learn about the latest in mobility tech and trends — live and in-person. It’s a great strategy to keep your mobility business moving forward.\n Is your company interested in sponsoring or exhibiting at TC Sessions: Mobility 2022? Contact our sponsorship sales team by  filling out this form.", "posttime": "2022-02-15 11:36:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "购买,sessions,移动", "title": "早起的鸟儿已经降落——购买TC Sessions:Mobility 2022 today的当面通行证，然后保存", "title_en": "\n\t\t\t\tThe early bird has landed — buy your in-person pass to TC Sessions: Mobility 2022 today and save\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/the-early-bird-has-landed-buy-your-in-person-pass-to-tc-sessions-mobility-2022-today-and-save/", "via": "", "real_tags": ["购买", "sessions", "移动"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073391, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家初创公司今天宣布，它已经筹集了一轮未公开的种子投资，由韩国互联网巨头Naver、CKD风险投资公司和宇信风险投资公司共同牵头，Lighthouse Combined Investment和S&amp；C网络将占领韩国和日本市场。\n新船Jaebin Lee的首席执行官告诉TechCrunch，新资金将用于收购韩国和日本的电子商务品牌，并聘请更多的品牌管理、营销和供应链管理专家。Lee说，这家初创公司目前正在寻找年收入至少为100万美元、利润率为15-30%的品牌，并补充说，收购交易规模将在100万至200万美元之间。Lee指出，该公司计划在今年上半年完成收购后，于6月筹集其A系列融资。\n新船成立于2021年9月，李拥有超过10年的并购经验；作为律师和投资者的空间，以及之前在日本电子商务乐天和韩国电子商务Coupang工作的Kyuyong Lee。\n在过去几年里，两位联合创始人见证了全球聚合巨头的成长，包括Thrasio和Perch。他们注意到，韩国和日本的电子商务聚合产业刚刚起步，尽管这些国家的电子商务市场在世界上名列前茅。Lee说，这代表着这些地区基于本地的聚合器的巨大潜力。\n“这只是时间问题。韩国和日本的电子商务聚合器市场充满了未开发的潜力，”李说。\n这家初创公司表示，将与韩国和日本领先的电子商务销售商合作，通过提供经验证的优化策略和销售扩张策略来推动其增长。Lee说，新船的目的是帮助美国卖家在韩国和日本扩张，反之亦然，使韩国和日本品牌能够进入美国市场。新船最近与总部位于美国和韩国的手机配件制造商Spigen建立了战略合作伙伴关系，以进一步增强其运营实力。\n“韩国绝大多数在线品牌销售商甚至都不知道销售他们的品牌是可能的。我们相信，我们与品牌所有者的合作不仅会为销售商提供价值，也会为整个消费者提供价值，让市场充满物美价廉的优质产品。”\n与此同时，全球电子商务聚合商Thrasio去年3月在日本设立了一个办事处，收购了日本的电子商务品牌，从而进入了亚洲。", "note_en": "The startup announced today it has raised an undisclosed seed round co-led by South Korean internet giant Naver, CKD Venture Capital and Wooshin Venture Investment, with participation from Lighthouse Combined Investment and S&amp;C Networks to take the market in South Korea and Japan.\n The new funding will be used to acquire Korean and Japanese e-commerce brands and hire additional experts in brand management, marketing and supply chain management, CEO of New Vessel Jaebin Lee told TechCrunch. The startup is currently seeking brands that generate at least $1 million in annual revenue with 15-30% in margins, Lee said, adding that the acquisition deal size would be between $1 million and 2 million.  The company plans to raise its Series A funding in June after completing acquisitions in the first half of this year, Lee noted.\n   New Vessel was founded in September 2021 by Lee, who has more than 10 years of experience in the M&amp;A space as a lawyer and an investor, and Kyuyong Lee, who previously worked at Japanese e-commerce Rakuten and Korean e-commerce Coupang.\n For the last few years, the two co-founders saw the growth of global aggregator giants, including Thrasio and Perch. They noticed that the e-commerce aggregator industry in South Korea and Japan is just starting to kick off even though the e-commerce markets in those countries rank among the top in the world. That represents great potential for local-based aggregators in the regions, Lee said.\n “It’s only a matter of time. The e-commerce aggregator market [in South Korea and Japan] is filled with untapped potential,” Lee said.\n   The startup said it will partner with sellers on leading e-commerce in Korea and Japan to propel their growth by providing proven optimization strategies and sales expansion tactics. New Vessel aims to help the U.S.-based sellers expand in Korea and Japan and vice versa, enabling Korean and Japanese brands to enter the U.S. market, Lee said. New Vessel has recently formed a strategic partnership with the U.S.- and South Korea-based mobile phone accessory maker  Spigen to further its operational strength.\n “The vast majority of online brand sellers in Korea are not aware that selling their brands is even a possibility. We believe that our partnerships with brand owners will provide value to not only the sellers but consumers as a whole by filling the marketplace with great products at affordable prices.”\n Meanwhile, global e-commerce aggregator Thrasio has entered Asia by  setting up an office in Japan last March to acquire the Japanese e-commerce brands.", "posttime": "2022-02-15 11:34:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "聚合,internet,韩国", "title": "韩国互联网巨头Naver在种子回合中支持电子商务聚合器新船", "title_en": "\n\t\t\t\tKorean internet giant Naver backs e-commerce aggregator New Vessel in seed round \t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/korean-internet-giant-naver-backs-e-commerce-aggregator-new-vessel-in-seed-round/", "via": "", "real_tags": ["聚合", "internet", "韩国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073389, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，这家总部位于新加坡的公司宣布，它已经完成了一轮超额认购的200万美元种子投资，来自于返回的投资者M Venture Partners和Global Founders Capital。天使投资人包括Carousell联合创始人Marcus Tan、Carro高管Kenji Narushima和Spin联合创始人Derrick Ko。\nMindFi（心理健康短期）参加了Y组合的夏季2021队列。它目前在亚太地区运营，包括SimaPrPar、香港和澳大利亚，并提供16种语言的服务。其企业客户包括维萨、威利斯·托尔斯·沃森和帕特斯纳。MindFi的产品总共为15个市场的35家雇主的10万名员工提供服务。\n虽然心理健康创业公司在美国获得了大量资金，尤其是在疫情期间，但在亚洲大部分地区，这仍然是一个新兴领域。MindFi是众多致力于改变这种状况的初创公司之一。最近筹集资金的还有Intelligent（另一位Y Combinator校友）和Thoughtfull。\nMindFi应用程序包含自我指导的心理健康计划、社区论坛、团体治疗和基于人工智能的教练和治疗师匹配系统。用户档案将MindFi提供的数据与健身穿戴设备提供的信息进行汇总，包括睡眠、心率和日常活动。\nLee告诉TechCrunch，其种子资金将用于加速其人工智能引擎的开发，推进可穿戴设备的生理数据与MindFi的心理健康数据的集成，并与当地专家合作，在其主要亚太市场创建应用内程序。尽管Lee表示，与美国或欧洲相比，亚太地区拥有执照的心理健康专业人员相对较少，但重要的是确保其项目适合不同的文化背景，以便用户对获得支持感到放心。\n在一份声明中，M Ventures的合伙人Mayank Parekh说，“在大多数国家，心理健康一直被忽视，在快速增长的亚洲更是如此。我们觉得目前市场服务不佳，作为创始人第一投资者，我们很高兴与MindFi团队合作，他们将互补的技能和洞察力结合在一起，解决一个重大问题。”", "note_en": "Today the Singapore-based company announced it has closed an oversubscribed $2 million seed round, with participation from returning investors M Venture Partners and Global Founders Capital. Angel investors included Carousell co-founder Marcus Tan, Carro executive Kenji Narushima and Spin co-founder Derrick Ko.\n MindFi (short for Mind Fitness) took part in Y Combinator’s summer 2021 cohort. It currently operates across the Asia-Pacific region, including Sinagpore, Hong Kong and Australia, and offers its services in 16 languages. Its corporate clients include Visa, Willis Towers Watson and Patsnap. In total, MindFi’s products serve 100,000 employees across 35 employers in 15 markets.\n  While mental health startups have gained a lot funding in the United States, especially  during the pandemic, it is still a nascent space in much of Asia. MindFi is among a cluster of startups working to change that. Others that have recently raised funding include  Intellect (another Y Combinator alum) and  Thoughtfull.\n  The MindFi app contains self-directed mental wellness programs, community forums, group therapy and an AI-based matching system for coaches and therapists. Users’ profiles aggregate data from MindFi with information from their fitness wearables, including sleep, heart rate and daily activity.\n Lee told TechCrunch that its seed funding will be used to accelerate the development of its AI engine, advance the integration of physiological data from wearables to MindFi’s mental health data and work with local experts to create in-app programs in its key APAC markets. Though Lee said there is a relatively low availability of licensed mental health professionals in APAC compared to the USA or Europe, it’s important to make sure its programs fit into diverse cultural contexts so users feel comfortable about getting support.\n  In a statement, M Ventures partner Mayank Parekh said, “Mental health has been traditionally overlooked in most countries, more so in fast-growth Asia. We feel the market is currently poorly served, and as founder-first investors, we are thrilled to work with the MindFi team, who together bring complementary skills and insight to solve a significant problem.”", "posttime": "2022-02-15 11:30:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚太地区,create,心理健康", "title": "MindFi获得200万美元种子，为亚太地区市场创建本地化的心理健康项目", "title_en": "\n\t\t\t\tMindFi gets $2M seed to create localized mental wellness programs for APAC markets\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/mindfi-gets-2m-seed-to-create-localized-mental-wellness-programs-for-apac-markets/", "via": "", "real_tags": ["亚太地区", "create", "心理健康"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073388, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "近年来，前IBM员工在各种法律文件和媒体报道中指责该公司存在年龄歧视，称IBM试图用年轻员工取代数千名年长员工，以跟上企业竞争对手的步伐。\n现在看来，IBM的高层管理人员直接参与了有关减少该公司年长员工比例的讨论，有时用“恐龙”之类的艺术术语贬低他们\n周五，一家联邦地区法院公布了一系列之前封存的文件，显示高管们正在讨论逐步淘汰年长员工的计划，并对公司千禧一代比例相对较低表示哀叹。\n这些文件来自一场诉讼，称IBM为改变员工年龄结构进行了长达一年的努力。这些文件似乎为该公司领导层在这一努力中的作用提供了第一个公开的直接证据。\n本案原告律师香农·利斯·里奥丹（Shannon Liss Riordan）说：“这些文件显示，IBM高层管理人员明确地相互密谋，将IBM的老员工从劳动力队伍中赶出去，以便为千禧一代员工腾出空间。”。\nLiss Riordan女士代表数百名前IBM员工提出类似索赔。她正在为一些索赔寻求集体诉讼地位，尽管法院尚未对此类索赔进行认证。\nIBM发言人亚当·普拉特为公司的雇佣行为辩护。“IBM从未参与过系统性的年龄歧视，”他说。“员工离职是因为商业环境的变化和对某些技能的需求，而不是因为他们的年龄。”\n普拉特说，从2010年到2020年，IBM在美国雇佣了超过1万名50岁以上的员工，而且IBM美国劳动力的年龄中位数在每一年都是相同的：48岁。该公司不愿透露在此期间有多少美国工人。\n非营利调查网站ProPublica在2018年发表的一篇文章中记录了该公司用年轻员工取代年长员工的明显战略，并指出，这源于时任IBM首席执行官吉尼·罗梅蒂（Ginni Rometty）在云服务、大数据分析、，移动、安全和社交媒体。根据部分基于内部规划文件的ProPublica文章，IBM认为需要更大比例的年轻员工才能在这些领域获得吸引力。\n2020年，平等就业机会委员会（Equal Employment Opportunity Commission）发布了一份IBM对这些做法的调查摘要，发现“IBM高层发出了自上而下的信息，指示管理者采取积极的方法，大幅减少老年员工的人数。”但该机构没有公开发布支持其主张的证据。\n这些新启封的文件引用了公司内部的电子邮件，并在Liss Riordan提起的诉讼中以“重要事实陈述”的形式提交。这些文件似乎证实了这些结论，并显示IBM高层管理人员特别强调了精简年长员工队伍和雇佣更年轻员工的必要性。\n“我们讨论了我们的千禧一代人口落后于竞争对手的事实，”当时一位高管的一封电子邮件说。“下面的数据非常敏感——不能共享——但希望确保你拥有这些数据。你会看到，埃森哲有72%是千禧一代，而我们有42%是千禧一代，范围很广，许多单位远远低于这一平均水平。这说明需要雇佣早期专业人士。”\n“早期专业人士”是该公司对一个几乎不需要经验的职位的称呼。\n一位高管的另一封电子邮件似乎是针对年长员工的，其中提到了一项计划，即“通过邀请‘恐龙’（新物种）离开来加速变化”，并使它们成为“灭绝物种”\n第三封邮件提到了IBM的“过时的母亲劳动力”，这显然是对年长女性的暗示，并说：“这是必须改变的。她们真的不了解社交或参与。不是数字原住民。这对我们来说是一个真正的威胁。”\n发言人普拉特说，电子邮件中的一些措辞“与IBM对其员工的尊重不一致”，并且“没有反映公司的做法或政策”这份重要事实声明对电子邮件作者的姓名进行了修订，但表明他们是在2020年离开公司的。\n早期的法律文件和新公布的文件都声称，IBM试图雇佣约25000名工人，这些人在2010年代通常没有什么经验。与此同时，“相当数量的老年非千禧一代员工需要被解雇，”一份新启封的文件中的一段话总结道，这是一项由IBM前员工发起的私人仲裁裁决。\n类似地，欧盟经合组织在总结其对IBM调查的信中发现，在该公司视为裁员候选人的群体中，年龄较大的员工占85%以上，但该机构没有具体说明其认为“年龄较大”的群体\n最新公布的文件表明，IBM试图以多种方式实施其战略，其中包括一项政策，即员工在公司的头12个月内大规模裁员不得包括“早期专业雇佣”。一封内部电子邮件写道：“我们没有在人口统计方面取得所需的进展，我们正在浪费我们在人才获取和培训方面的投资。”。\n这起诉讼还辩称，IBM试图通过要求老年工人迁往美国其他地区以保住工作来消除老年工人，前提是大多数人会拒绝搬家。一封内部邮件称“典型的重新安置接受率为8-10%”，而另一封邮件则表示，公司需要为那些接受重新安置的人找到工作，这表明要求员工重新安置没有商业理由。\n虽然被指定裁员的IBM员工被正式允许申请公司内部的空缺职位，但新披露的其他证据表明，公司不鼓励经理们实际聘用他们。例如，根据重要事实陈述，如果经理们想继续招聘，他们必须向公司总部申请批准。\n在Liss Riordan女士提起的另一起诉讼中，几名原告似乎是这些做法的接受方。其中一人Edvin Rusis于2003年加入IBM，曾担任“解决方案经理”2018年3月，该公司通知他，他将在几个月内被解雇。根据他的法律申诉，鲁西斯在得知自己即将被解雇后申请了五个内部职位，但对他的任何申请都没有得到任何回应。\n发言人普拉特说，该公司为保护最近雇佣的员工不被解雇所做的努力，以及重新安置员工的方法，都是对年龄的忽视，许多被指定裁员的员工确实在IBM找到了新工作。\n2018年的ProPublica故事指出了处于类似情况的员工，以及其他被要求迁出州并决定离开公司的人。\n该公司还面临其他年龄歧视指控，包括向联邦法院提起的诉讼，原告指控该公司解雇了大量婴儿潮一代，因为他们“缺乏创新，通常与IBM的品牌、客户和目标脱节”据ProPublica称，此案于2017年结案。\n2004年，该公司同意支付3亿多美元，与员工达成和解。员工辩称，该公司在20世纪90年代决定用包含401（k）计划某些特征的计划取代传统养老金计划，构成了年龄歧视。\n《联邦就业年龄歧视法》禁止40岁或40岁以上的人因年龄而在雇佣和就业方面受到歧视，但有少数例外。\n该法案还要求公司在员工放弃年龄歧视起诉权之前，披露集团或部门内所有被解雇人员以及被留任人员的年龄和职位。公司通常在发放员工遣散费之前要求此类豁免。\n但从2014年开始，IBM不再要求收到遣散费的员工放弃起诉权，这使得它可以停止提供受大规模裁员影响的员工的年龄和职位信息。\n相反，IBM要求领取遣散费的员工在仲裁中单独提出任何歧视索赔——这是一个私人司法系统，企业和其他有权势的被告往往更喜欢这种系统。普拉特说，做出这一改变是为了更好地保护员工的隐私。\n虽然一些前雇员拒绝了遣散费，保留了他们在法庭上起诉IBM的能力，但许多前雇员接受了遣散费，要求他们在仲裁中提出索赔。正在竞选马萨诸塞州总检察长的利斯·里奥尔丹在这两种情况下都代表员工。\n促使联邦法院公布这些文件的具体法律问题是一名原告提出的动议，其已故丈夫签署了一项要求仲裁的协议，IBM随后试图阻止其仲裁程序。\nIBM辩称，原告寻求在仲裁窗口过去后提起诉讼，并且原告试图提出的一些证据根据仲裁协议是保密的。原告辩称，仲裁协议的这些条款不可执行。\n本案法官刘易斯·J·利曼尚未对该论点的是非曲直做出裁决。但今年1月，利曼法官裁定，案件中的文件，包括重要事实陈述，应向公众公开。\nIBM要求联邦上诉法院暂缓利曼法官的披露决定，但美国第二巡回上诉法院的一个由三名法官组成的小组驳回了该公司的论点，巡回法院也拒绝批准暂缓。《纽约时报》向巡回法院提交了一份法庭之友简报，辩称第一修正案适用于相关文件。", "note_en": "In recent years, former IBM employees have accused the company of age discrimination in a variety of legal filings and press accounts, arguing that IBM sought to replace thousands of older workers with younger ones to keep pace with corporate rivals.\n Now it appears that top IBM executives were directly involved in discussions about the need to reduce the portion of older employees at the company, sometimes disparaging them with terms of art like “dinobabies.”\n A trove of previously sealed documents made public by a Federal District Court on Friday show executives discussing plans to phase out older employees and bemoaning the company’s relatively low percentage of millennials.\n The documents, which emerged from a lawsuit contending that IBM engaged in a yearslong effort to shift the age composition of its work force, appear to provide the first public piece of direct evidence about the role of the company’s leadership in the effort.\n  “These filings reveal that top IBM executives were explicitly plotting with one another to oust older workers from IBM’s work force in order to make room for millennial employees,” said Shannon Liss-Riordan, a lawyer for the plaintiff in the case.\n Ms. Liss-Riordan represents hundreds of former IBM employees in similar claims. She is seeking class-action status for some of the claims, though courts have yet to certify the class.\n Adam Pratt, an IBM spokesman, defended the company’s employment practices. “IBM never engaged in systemic age discrimination,” he said. “Employees were separated because of shifts in business conditions and demand for certain skills, not because of their age.”\n Mr. Pratt said that IBM hired more than 10,000 people over 50 in the United States from 2010 to 2020, and that the median age of IBM’s U.S. work force was the same in each of those years: 48. The company would not disclose how many U.S. workers it had during that period.\n A  2018 article by the nonprofit investigative website ProPublica documented the company’s apparent strategy of replacing older workers with younger ones and argued that it followed from the determination of Ginni Rometty, then IBM’s chief executive, to seize market share in such cutting-edge fields as cloud services, big data analytics, mobile, security and social media. According to the ProPublica article, based in part on internal planning documents, IBM believed that it needed a larger proportion of younger workers to gain traction in these areas.\n  In 2020, the Equal Employment Opportunity Commission released a summary of an investigation into these practices at IBM, which found that there was “top-down messaging from IBM’s highest ranks directing managers to engage in an aggressive approach to significantly reduce the head count of older workers.” But the agency did not publicly release evidence supporting its claims.\n  The newly unsealed documents — which quote from internal company emails, and which were filed in a “statement of material facts” in the lawsuit brought by Ms. Liss-Riordan — appear to affirm those conclusions and show top IBM executives specifically emphasizing the need to thin the ranks of older workers and hire more younger ones.\n “We discussed the fact that our millennial population trails competitors,” says one email from a top executive at the time. “The data below is very sensitive — not to be shared — but wanted to make sure you have it. You will see that while Accenture is 72% millennial we are at 42% with a wide range and many units falling well below that average. Speaks to the need to hire early professionals.”\n “Early professionals” was the company’s term for a role that required little prior experience.\n Another email by a top executive, appearing to refer to older workers, mentions a plan to “accelerate change by inviting the ‘dinobabies’ (new species) to leave” and make them an “extinct species.”\n A third email refers to IBM’s “dated maternal workforce,” an apparent allusion to older women, and says: “This is what must change. They really don’t understand social or engagement. Not digital natives. A real threat for us.”\n Mr. Pratt, the spokesman, said that some of the language in the emails “is not consistent with the respect IBM has for its employees” and “does not reflect company practices or policies.” The statement of material facts redacts the names of the emails’ authors but indicates that they left the company in 2020.\n  Both earlier legal filings and the newly unsealed documents contend that IBM sought to hire about 25,000 workers who typically had little experience during the 2010s.  At the same time, “a comparable number of older, non-Millennial workers needed to be let go,” concluded a passage in one of the newly unsealed documents, a ruling in a private arbitration initiated by a former IBM employee.\n  Similarly, the E.E.O.C.’s letter summarizing its investigation of IBM found that older workers made up over 85 percent of the group whom the company viewed as candidates for layoffs, though the agency did not specify what it considered “older.”\n The newly unsealed documents suggest that IBM sought to carry out its strategy in a variety of ways, including a policy that no “early professional hire” can be included in a mass layoff in the employee’s first 12 months at the company. “We are not making the progress we need to make demographically, and we are squandering our investment in talent acquisition and training,” an internal email states.\n  The lawsuit also argues that IBM sought to eliminate older workers by requiring them to move to a different part of the country to keep their jobs, assuming that most would decline to move. One internal email stated that the “typical relo accept rate is 8-10%,” while another said that the company would need to find work for those who accepted, suggesting that there was not a business rationale for asking employees to relocate.\n And while IBM employees designated for layoffs were officially allowed to apply for open jobs within the company, other evidence included in the new disclosure suggests that the company discouraged managers from actually hiring them. For example, according to the statement of material facts, managers had to request approval from corporate headquarters if they wanted to move ahead with a hire.\n Several of the plaintiffs in a separate lawsuit brought by Ms. Liss-Riordan appeared to have been on the receiving end of these practices. One of them, Edvin Rusis, joined IBM in 2003 and had worked as a “solution manager.” He was informed by the company in March 2018 that he would be laid off within a few months. According to his legal complaint, Mr. Rusis applied for five internal positions after learning of his forthcoming layoff but heard nothing in response to any of his applications.\n Mr. Pratt, the spokesman, said that the company’s efforts to shield recent hires from layoffs, as well as its approach to relocating workers, were blind to age, and that many workers designated for layoffs did secure new jobs with IBM.\n  The ProPublica story from 2018 identified employees in similar situations, and others who were asked to relocate out of state and decided to leave the company instead.\n The company has faced other age discrimination claims, including a lawsuit filed in federal court in which plaintiffs accused the company of laying off large numbers of baby boomers because they were “less innovative and generally out of touch with IBM’s brand, customers and objectives.” The case was settled in 2017, according to ProPublica.\n In 2004, the company  agreed to pay more than $300 million to settle with employees who argued that its decision in the 1990s to replace its traditional pension plan with a plan that included some features of a 401(k) constituted age discrimination.\n The federal Age Discrimination in Employment Act prohibits discrimination against people 40 or over in hiring and employment on the basis of their age, with limited exceptions.\n The act also requires companies to disclose the age and positions of all people within a group or department being laid off, as well as those being kept on, before a worker waives the right to sue for age discrimination. Companies typically require such waivers before granting workers’ severance packages.\n But IBM stopped asking workers who received severance packages to waive their right to sue beginning in 2014, which allowed it to cease providing information about the age and positions of workers affected by a mass layoff.\n Instead, IBM required workers receiving a severance package to bring any discrimination claims individually in arbitration — a private justice system  often preferred by corporations and other powerful defendants. Mr. Pratt said the change was made to better protect workers’ privacy.\n  While some former employees preserved their ability to sue IBM in court by declining the severance package, many former employees accepted the package, requiring them to bring claims in arbitration. Ms. Liss-Riordan, who is running for attorney general of Massachusetts, represents employees in both situations.\n The particular legal matter that prompted the release of the documents in federal court was a motion by one of the plaintiffs whose late husband had signed an agreement requiring arbitration, and whose arbitration proceeding IBM then sought to block.\n IBM argued that the plaintiff sought to pursue the claim in arbitration after the window for doing so had passed, and that some of the evidence the plaintiff sought to introduce was confidential under the arbitration agreement. The plaintiff argued that those provisions of the arbitration agreement were unenforceable.\n The judge in the case, Lewis J. Liman, has yet to rule on the merits of that argument. But in January, Judge Liman ruled that documents in the case, including the statement of material facts, should be available to the public.\n IBM asked a federal appellate court to stay Judge Liman’s disclosure decision, but a three-judge panel of the U.S. Court of Appeals for the Second Circuit rejected the company’s argument, and the full circuit court also declined to grant a stay. The New York Times filed an amicus brief to the circuit court arguing that the First Amendment applied to the documents in question.", "posttime": "2022-02-15 11:20:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "灭绝,dinobabies,员工", "title": "让恐龙灭绝：IBM推动年轻劳动力", "title_en": "Making 'Dinobabies' Extinct: IBM's Push for a Younger Work Force", "transed": 1, "url": "https://www.nytimes.com/2022/02/12/business/economy/ibm-age-discrimination.html", "via": "", "real_tags": ["灭绝", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073386, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，我的血腥情人节以一支乐队不情愿地从深海海底召集的口吻发布了一条尖锐的公共服务公告：“刚刚注意到Spotify在我们不知情的情况下为我们的歌曲编造了假歌词，”爱尔兰鞋匠在推特上写道。“这些歌词实际上是完全错误的，具有侮辱性。”Cocteau Twins的西蒙·雷蒙德（Simon Raymonde）插话报道说，他们也在流媒体服务上发现了他们著名的椭圆形歌曲的胡言乱语抄本。Raymonde没有指出任何特定的歌曲，但根据流媒体平台，他们的歌曲“Violaine”以“Ik does a dashik Tend”开头，然后逐渐达到高潮，“Oh eat off your toe”\n唉，Spotify在接下来的一周的股价暴跌并不能证明公众对80年代空灵的alt rockers的忠诚。但对于某种一丝不苟的艺术家来说，这些抒情的疏忽和同时发生的乔·罗根的崩溃是同一枚硬币的两面。流媒体巨头打败了市场，垄断了市场，现在，已经成为听众“可恶的不可或缺”的行业，正在用垃圾污染这个市场。\n抒情的斯纳福并不局限于Spotify。在过去十年中，一个名为Musixmatch的数据平台已经在歌词领域占据了主导地位，并与主要出版公司达成了次级许可协议。你在Spotify、潮汐音乐和亚马逊音乐上看到的歌词通常通过Musixmatch，通过一条数据管道，将该平台庞大的转录社区与一小部分付费质量控制监视器连接起来。（Apple Music有一个专门的歌词团队，负责处理大部分抄本。）\n抒情的工业综合体可能会让一些艺术家感到，这是大科技公司对音乐进行无穷无尽优化的又一个进步。实用的流媒体接口已经减少了艺术家的创意投入，统一的专辑列表没有标签或线条注释，缩略图大小的艺术品，轨迹列表和信用卡像电子表格一样呈现。歌词似乎只是流媒体巨头要征服的又一个空间。\n在2010年Musixmatch出现之前（以及之前被称为Rap Genius的网站为“诠释世界”筹集了数百万风险资本之前），抒情网站是一个更为天真的互联网的残迹，它承载着自由信息交换的无政府承诺。当像SongMeans这样的网站出现时，没有人感到惊讶。网络上播放的是未经许可、不准确的歌词，简陋的布局让人对其盗版精神产生了怀疑。尽管如此，一代音乐迷还是开始依赖这些非正式的数据库，寻求指导，如果不是权威的话。一个目前极为分散的歌词转录行业诞生了。\nMusixmatch是一种集中片段的尝试。从一个角度来看，它代表着互联网从一个零碎的小玩意儿仓库向一个大数据游乐场的转变，这个游乐场没有遇到它无法商品化的“1”或“0”。另一方面，Musixmatch声称占据歌词发行市场90%的份额，它帮助开创了歌词复制的狂野西部时代。通过他们的出版商，当我们观看授权歌词时，作曲人实际上获得了版税，尽管版税很小。\nMusixmatch对准确性的态度很难是放任的，这在商业上毫无意义。超过70万名艺术家签署了其“官方艺术家认证计划”，该计划允许作曲者为自己的歌词开绿灯，防止更改。毫不奇怪，我的血腥情人节和Cocteau双胞胎都不在其中，但Musixmatch表示，团体只需询问：在看到我的血腥情人节推文后，他们联系了乐队的标签和出版公司，授权将歌词大规模删除，然后迅速执行。\nMusixmatch通过吸引足够多的成员来利用假定的群体智慧来建立自己的帝国；其网站宣传了一个由2000万志愿者组成的社区，创始人兼首席执行官马克斯·乔乔拉（Max Ciociola）肯定这一惊人数字是正确的。凭借一款时尚、充满活力的应用程序，该平台通过积分和徽章等奖励措施，将转录和调整过程游戏化，当Musixmatch识别出准确的贡献时，这些奖励就会产生。通过考试的顶尖贡献者可以获得“策展人”身份。目前约有5000名贡献者在该平台上运行并进行质量检查，并获得小额报酬。不过，这位发言人强调，策展人的角色并不构成一项工作。人们做这项工作“因为他们对这个空间充满热情”\n这条“内容供应链”覆盖了近200个国家的贡献者，他们使用90多种语言。最上层是内部编辑，他们分配歌曲、校对歌词，并尽最大努力保证质量，最终赋予歌词“由Musixmatch验证”的状态，比艺术家验证低一级。这个核心团队大约有100人，由全职员工和承包商组成。人工智能剔除了可疑内容，包括从其他网站剪切和粘贴的歌词。\n系统发出的每一首完整的歌词都有一个质量分数，Musixmatch会与流媒体服务分享。Ciociola辩称，流媒体服务知道《我的血腥情人节》和《可可豆双胞胎》的歌词质量较低。不管怎样，流光乐队选择发表歌词要么是一个经过计算的风险，要么被认为无关紧要。\n有一件事是明确的，关于这种故意高深莫测的音乐，它超越了Musixmatch这样的服务的范围；正如Cocteau Twins的西蒙·雷蒙德（Simon Raymonde）在推特上所说，“如果我们想把歌词放在任何地方，我们早在30多年前就会这么做了。”这件事说明了技术资本主义在面对艺术中的一个关键因素时的混乱，这是无法解释的。不过，我认为问题不在于Musixmatch及其协议，而在于该服务在准官方许可的情况下，在平台上的单方面推出，这些平台已经因将艺术身份扁平化和将音乐重新打包为可缩放内容而备受争议。在获得了这些权利的再授权后，Musixmatch完全有权将源代码抄本聚集在一起，并在网上出售。但艺术家应该知道谁的话被放进了他们的嘴里，如果他们愿意，他们有权选择退出。\n当被问及Musixmatch是否应该允许用户标记无法辨认的歌词时，Ciociola解释道，“我们讨论的是数百万首歌曲中的几个案例。”他在一份声明中补充说，那个“艺术家、词曲作者和整个创作者生态系统终于将歌词视为一种资产。所有主要的DSP都在其服务中提供令人惊叹的歌词体验，Musixmatch内容的质量也越来越高。我们已经大量投资于高质量的工程师，以确保创作者、版权所有者和版权所有者获得最佳体验s、 最后但并非最不重要的是音乐迷。但前面还有很长的路要走。\"", "note_en": "Last month, in the tone of a band reluctantly summoned from some deep seabed,  My Bloody Valentine issued  a prickly public service announcement: “Just noticed that Spotify has put fake lyrics up for our songs without our knowledge,” the Irish shoegazers tweeted. “These lyrics are actually completely incorrect and insulting.”  Cocteau Twins’ Simon Raymonde chimed in to report that they, too, had found gibberish transcriptions of their famously elliptical songs on streaming services. Raymonde didn’t point to any particular song, but according to streaming platforms, their song “Violaine” begins, “Ik does a dashik dozen,” before meandering toward a climax of, “Oh eat off your toe.”\n  Spotify’s  stock tumble the following week was not, alas, a testament to the public’s allegiance to ethereal ’80s alt-rockers. But for a certain breed of meticulous artist, these lyrical oversights and the concurrent  Joe Rogan debacle are two sides of the same coin. Streaming giants outfoxed and cornered the market, and now, having become “ odiously indispensable” to listeners, are polluting that market with garbage.\n The lyric snafu was not limited to Spotify. Over the past decade, a data platform called Musixmatch has assumed dominion over the world of lyrics, securing sub-licensing deals with the major publishing companies. The lyrics you see on Spotify, Tidal, and Amazon Music usually come through Musixmatch, via a data pipeline that links the platform’s enormous transcriber community with a small core of paid quality-control monitors. (Apple Music has a dedicated lyrics team handling most of its transcriptions.)\n  The lyric industrial complex may strike some artists as another advance in big tech’s inexhaustible optimization of music. Utilitarian streaming interfaces already curtail artists’ creative input, with uniform album listings that feature no label or liner notes, thumbnail-sized artwork, and tracklists and credits presented like spreadsheets. Lyrics, it seems, are just one more space for streaming giants to conquer.\n  Before Musixmatch came along in 2010 (and before the site formerly known as Rap Genius raised venture-capital millions in its bid to “annotate the world”), lyric sites were disheveled relics of a more innocent internet—one that held an anarchic promise of free information exchange. Nobody was surprised when a site like SongMeanings.net hosted unlicensed, inaccurate lyrics—the janky layout left no doubt of its bootleg spirit. A generation of music fans nonetheless came to depend on these informal databases, for guidance if not authority. A lyric transcription industry—for now wildly fragmented—was born.\n  Musixmatch is an attempt to centralize the fragments. From one angle, it represents the internet’s transformation from a scrappy repository of nicknacks to a big-data playground that hasn’t met a “1” or a “0” that it can’t commodify. The flipside is that Musixmatch, which claims a 90 percent share of the lyric-distribution market, has helped to usher out a  Wild West era of lyric reproduction. Through their publishers, songwriters effectively receive a royalty, albeit a tiny one, when we view licensed lyrics.\n Musixmatch’s approach to accuracy is hardly laissez-faire—that would make no business sense. More than 700,000 artists have signed up to its “Official Artist Verified Program,” which lets songwriters greenlight their own lyrics and prevent changes. Unsurprisingly, neither My Bloody Valentine nor Cocteau Twins were among them, but Musixmatch says groups need only ask: After seeing My Bloody Valentine’s tweet, they contacted the band’s label and publishing company to authorize the lyrics’ wholesale removal, then carried it out in speedy fashion.\n  Musixmatch built its empire by attracting enough members to harness a presumed wisdom of crowds; its website advertises a community of 20 million volunteers, an eye-popping figure that Max Ciociola, the founder and CEO, affirms is correct. With a sleek, vibrant app, the platform gamifies the transcribe-and-tweak process with incentives like points and badges, which accrue when Musixmatch discerns an accurate contribution. Top contributors who pass an exam can attain “Curator” status—about 5,000 now operate on the platform—and conduct quality checks, receiving small payments in return. Still, curator roles do not constitute a job, the spokesperson stresses. People do the work “because they are passionate about this space.”\n This “content supply chain” spans contributors in nearly 200 countries working in more than 90 languages. Up top are the in-house editors who assign songs, proofread lyrics, and take their best shot at quality assurance, ultimately bestowing lyrics with “verified by Musixmatch” status—one rung below artist verification. This central team, roughly 100 strong, is a mix of full-time employees and contractors. AI weeds out suspicious content, including lyrics cut-and-pasted from other sites.\n Each completed lyric that the system spits out comes with a quality score, which Musixmatch shares with streaming services. Ciociola contends streaming services knew that the My Bloody Valentine and Cocteau Twins lyrics had a low quality rating. The streamers’ choice to publish the lyrics anyway was either a calculated risk or one deemed inconsequential.\n One thing that is clear about this willfully inscrutable music is that it transcends the scope of a service like Musixmatch; as Cocteau Twins’ Simon Raymonde tweeted, “If we’d wanted our lyrics put up anywhere we would’ve done it 30 odd years ago.” The affair illustrates tech capitalism’s discombobulation when faced with a key element in art, which is the inexplicable. I think the problem, though, is not Musixmatch and its protocol so much as the service’s unilateral rollout, with quasi-official imprimatur, on platforms already under fire for flattening artistic identity and repackaging music as scaleable content. Having sub-licensed the rights, Musixmatch is perfectly entitled to crowd-source transcriptions and sell them on. But artists should know whose words are being put in their mouths—and that, should they wish, they have the right to opt out.\n Asked if Musixmatch should allow users to flag indecipherable lyrics, Ciociola reasons, “We’re talking about a few cases out of millions of songs.” He adds, in a statement, that “artists, songwriters, and the whole creator ecosystem are finally considering Lyrics as an asset. All major DSPs are providing amazing Lyrics experiences across their services, and Musixmatch content has become more and more high quality. We have massively invested in high-quality engineers to ensure the best experience for creators, rights owners, and—last but not least—music fans. But there’s still a long journey ahead.”", "posttime": "2022-02-15 11:17:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "spotify,song,歌词", "title": "Spotify上虚假歌词的结局", "title_en": "How Fake Song  Lyrics Ended Up On Spotify", "transed": 1, "url": "https://pitchfork.com/thepitch/how-fake-my-bloody-valentine-and-cocteau-twins-lyrics-ended-up-on-spotify/", "via": "", "real_tags": ["spotify", "song", "歌词"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073384, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从2月28日开始，“员工将有30天的时间调整日常工作，并采用他们与经理商定的工作偏好。”\n微软告诉员工，他们将需要在下个月重返办公室，这是自Omicron冠状病毒变种席卷全国以来，微软首次重返公司校园。\n该公司长期以来一直表示，将采用混合工作环境，大多数员工最多有50%的时间可以在家工作。周一上午，该公司高管克里斯·卡波塞拉（Chris Capossela）在一篇关注西雅图附近总部的博客文章中表示，从2月28日开始，“员工将有30天时间调整日常工作，并采纳他们与经理商定的工作偏好。”\n卡波塞拉指出，大多数雇员居住的金县疫苗接种率很高，该州住院率和死亡人数下降是决定的因素。包括西雅图在内的金县居民是全国接种疫苗最多的地区之一，超过91%的5岁或5岁以上的人至少接种过一次疫苗。\n虽然声明的重点是微软的总部所在州，微软的大多数员工都在那里工作，但卡波塞拉说，该公司的湾区网站“将于2月28日全面开放，我们预计，如果条件允许，我们在美国的许多其他地点也将效仿。”\n微软总部位于美国第一次大规模冠状病毒爆发的地点附近，是2020年3月第一家关闭办公室的主要雇主。", "note_en": "Starting Feb. 28, “employees will have 30 days to make adjustments to their routines and adopt the working preferences they’ve agreed upon with their managers.”\n Microsoft told employees that they will need to return to office next month, transitioning back to its corporate campus for the first time since the Omicron coronavirus variant tore through the nation.\n The company has long said it would embrace a hybrid work environment, with most employees able to work from home up to 50 percent of the time. In  a Monday morning blog post focused on its headquarters near Seattle, Chris Capossela, an executive, said that starting Feb. 28, “employees will have 30 days to make adjustments to their routines and adopt the working preferences they’ve agreed upon with their managers.”\n Mr. Capossela cited the high vaccination rates in King County, where most employees live, and declining hospitalizations and deaths in the state as factors in the decision. Residents in King County, which includes Seattle, are among the most vaccinated in the country, with more than 91 percent of those who are 5 or older having received at least one shot.\n While the announcement was focused on the company’s home state, where most of Microsoft’s employees are based, Mr. Capossela said the company’s Bay Area sites “will fully open on Feb. 28, and we anticipate many of our other U.S. locations will follow suit as conditions allow.”\n  Based near the location of the  first major coronavirus outbreak in the United States, Microsoft was  the first major employer to shutter its offices in March 2020.", "posttime": "2022-02-15 11:13:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,员工,tells", "title": "微软要求员工做好返回办公室的准备", "title_en": "Microsoft Tells Workers To Prepare To Return To the Office", "transed": 1, "url": "https://www.nytimes.com/2022/02/14/technology/microsoft-rto.html", "via": "", "real_tags": ["microsoft", "微软", "员工", "tells"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073383, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电动汽车初创企业Polestar利用其有史以来的第一个超级碗广告，间接向其竞争对手开枪，包括特斯拉和大众。\n30秒的位置叫做&#34；不妥协&#34；很简单，很中肯。它以公司的照片为特色&#39；s Polestar 2电动汽车，带有&#34；第34位；\n在&#34之后的单词；没有&#34；在广告期间，范围从一般条款到&#34；柴油机门和#34；和&#34；征服火星&#34；\n预计将于今年上市的电动汽车初创企业Polestar，利用其有史以来的第一个超级碗广告，间接向其竞争对手开枪，包括特斯拉和大众。\n30秒的位置叫做&#34；不妥协&#34；很简单，很中肯。它以公司的照片为特色&#39；s Polestar 2电动汽车，带有&#34；没有&#34；接下来是针对其他传统超级碗商业广告和汽车公司的词汇和短语。\n在&#34之后的单词；没有&#34；在广告期间，范围从&#34；史诗配音&#34；和&#34；肮脏的秘密&#34；至&#34；柴油机门&#34；——指的是之前与大众汽车（Volkswagen）的柴油排放丑闻，以及&#34；征服火星&#34；——对特斯拉及其首席执行官埃隆·马斯克的批评，后者计划在2026年前将人类送上火星。\n广告结束于&#34；第2名和第34名；然后&#34；北极星2号和34号；该公司&#39；这是一辆全电动的高性能汽车。\n&#34;超级碗是一个标志性事件，我&#39；我很高兴能带来Polestar和#39；向如此广泛的观众传达的信息&#34；Polestar首席执行官托马斯·英格拉斯在一份声明中说&#34;我们是一个年轻而雄心勃勃的品牌。我们相信&#39；没有妥协&#39；，对于我们的设计语言，我们的可持续发展努力，以及我们汽车的性能，我们想在这则广告中分享这一理念。这是进一步提高我们品牌在美国及其他地区的知名度的完美场所&#34;\nPolestar由沃尔沃汽车公司（Volvo Car AB）及其所有者浙江吉利控股集团有限公司（Zhejiang Geely Holding Group Co.）控制。今年9月，该公司宣布与一家在美国上市的空白支票公司合并，该公司由亿万富翁亚历克·戈尔（Alec Gores）和投资银行古根海姆（Guggenheim Partners）支持，企业价值200亿美元。", "note_en": "EV start-up Polestar used its first-ever Super Bowl ad to indirectly take shots at its competitors, including Tesla and Volkswagen.\n The 30-second spot, called &#34;No Compromises,&#34; is simple and to the point. It features shots of the company&#39;s Polestar 2 electric vehicle with the word &#34;No.&#34;\n Words following &#34;No&#34; during the ad range from general terms to &#34;dieselgate&#34; and &#34;conquering Mars&#34;\n Electric vehicle start-up Polestar, which is expected to go public this year, used its first-ever Super Bowl ad to indirectly take shots at its competitors, including  Tesla and  Volkswagen.\n The 30-second spot, called &#34;No Compromises,&#34; is simple and to the point. It features shots of the company&#39;s Polestar 2 electric vehicle with the word &#34;No,&#34; followed by words and phrases directed at other traditional Super Bowl commercials and car companies.\n  Words following &#34;No&#34; during the ad range from general terms such as &#34;epic voiceovers&#34; and &#34;dirty secrets&#34; to &#34;dieselgate&#34; – referring to a former diesel emissions scandal with Volkswagen – and &#34;conquering Mars&#34; – a critique on Tesla and its CEO  Elon Musk, who has plans to land humans on  Mars by 2026.\n The commercial ends at &#34;No. 2&#34; and then &#34;Polestar 2,&#34; the company&#39;s all-electric performance car.\n &#34;The Super Bowl is an iconic event and I&#39;m excited to bring Polestar&#39;s message to such a wide audience,&#34; Polestar CEO Thomas Ingenlath said in a statement. &#34;We are a young and ambitious brand. We believe in &#39;no compromises&#39;, for our design language, our sustainability efforts, and the performance of our cars, and we wanted to share that philosophy with this ad. This is the perfect place to further raise awareness of our brand in the US, and beyond.&#34;\n  Polestar is controlled by Volvo Car AB and its owner Zhejiang Geely Holding Group Co. In September, the company announced a  deal to go public during the first half of this year by merging with a U.S.-listed blank-check firm backed by billionaire Alec Gores and investment bank Guggenheim Partners at an enterprise value of $20 billion.", "posttime": "2022-02-15 11:11:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,特斯拉,大众汽车,bowl", "title": "电动汽车初创公司Polestar在超级碗广告中向特斯拉、马斯克和大众汽车开枪", "title_en": "EV Start-up Polestar Takes Shots At Tesla, Musk and Volkswagen In Super Bowl Ad", "transed": 1, "url": "https://www.cnbc.com/2022/02/13/ev-start-up-polestar-takes-shots-at-teslas-elon-musk-in-super-bowl-ad.html", "via": "", "real_tags": ["广告", "特斯拉", "大众汽车", "bowl"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073381, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从历史上看，每个超级碗周日最让人难以忍受的部分都是广告。今年也不例外，无数广告试图展示metaverse，说服观众他们错过了加密技术，并为在线和实体赌场吸引新鲜血液。结果好坏参半。\nCoinbase在一则名为WAGMI（“我们&#39；我们都会成功”）的广告中，精心制作了一个二维码在屏幕上跳动的广告，每次碰到边缘都会改变颜色，就像老式DVD菜单一样。扫描二维码——这会立即剥夺你进入天堂的权利——将用户带到该页面，Coinbase提供15美元的比特币注册费，并有机会参加比赛，以100万美元的比特币赢得三个奖项之一。\n由于广告流量的增加，这个链接的网页几乎立刻就消失了，人们嘲笑支付数百万美元让数百万观众访问一个从网上蜂拥而至的网站。\n“Coinbase在超级碗广告上花费1600万美元引导人们访问他们的网站，并花费0美元确保网站在广告开始10秒后不会崩溃，这是非常互联网化的，”爱德华·斯诺登在中断期间在推特上写道。\n不过，对Coinbase来说，这则广告很成功。在一篇博客文章中，该公司对广告表示祝贺，并就广告如此出色的原因采访了Coinbase首席营销官凯特·鲁奇（Kate Rouch），该公司透露自己看到了&#34；一分钟内，我们的登录页面点击量超过2000万次&#34；其中&#34；导致我们暂时限制我们的系统&#34; 该公司首席执行官布莱恩·阿姆斯特朗（Brian Armstrong）在推特上对这则广告表示幸灾乐祸：在《广告周刊》（AdWeek）中排名第一，在苹果应用商店（Apple App Store）中排名第二，仅次于百事超级碗（Pepsi Super Bowl）中场休息秀和NFL的应用。\n事实证明，在一个广受关注的体育赛事中，除了一个QR码，提供免费的资金，以及赢得300万美元的机会，都是在你的应用程序中建立兴趣的好方法。当主板向Coinbase咨询广告时，该公司将主板转向了Rouch&#39；并重申了其要点。\nCoinbase宣传的这一活动是一个更大的倡议活动的一部分#34；超过1亿美元的类似激励措施#34；为加密技术的世界带来更多新鲜血液——在加密技术最近的抛售和价格暴跌之后，这一点极其重要。Coinbase已经为用户提供了一个机会，如果他们参加一门关于它的课程，就可以赚取价值几美元的各种代币，这意味着如果他们观看视频教程并完成测验。\nCoinbase在为其广告的明显成功而大获全胜的同时，也花时间解释了为什么这绝对不像互联网泡沫，许多批评人士说，这是对Sunday#39；s广告。\n“有很多人将其与互联网时代进行比较，并猜测许多在今年的超级碗上做广告的加密公司将不可避免地失败，”鲁奇在Coinbase&#39；s的博客文章。“我们不这么想，从我们看到的早期反应来看，超级碗观众也不这么想。”\n鲁奇坚称，超级碗中加密广告的数量仅为&#34；这又是一个信号，表明加密技术正在成为主流，并处于文化时代精神的中心&#34;\n那&#39；这是一种看问题的方式。另一个原因是，加密公司在过去几年里积累了大量的战争资金，他们现在正面临着一个关键时刻，因为监管者开始从他们的昏迷中觉醒，而且由于NFT、一系列欺诈项目和代币、荒谬的DAO等原因，关键的反弹持续加剧。因此，他们正在利用自己的财力来打开公众的心扉、思想和钱包。那&#39；它与时代精神无关，与推动一个产品和一个行业有关。当然，这是所有广告的重点，但还有&#39；It’假装没有意义。\n注册即表示您同意使用条款和隐私政策&amp；接收来自Vice Media Group的电子通信，其中可能包括市场推广、广告和赞助内容。", "note_en": "The most insufferable part of every Super Bowl Sunday has historically, without fail, been the ads. This year was no exception, with an unrelenting barrage of ads trying to manifest the metaverse, convince viewers they’re missing out on crypto, and lure new blood to online and physical casinos. Results were mixed.\n  Coinbase, in one ad named WAGMI (“we&#39;re all going to make it”), crafted an advertisement that bounced a   QR code around the screen, changing colors each time it hit the edge like an old-school DVD menu. Scanning the QR code―which immediately forfeits your right to enter heaven―takes the user to   this page, where Coinbase offers $15 in Bitcoin for signing up as well as a chance to enter a contest to win one of three prizes for $1 million worth of Bitcoin.\n    The linked webpage went down almost immediately thanks to the increased traffic from the ad, and ridicule at the idea of paying millions of dollars to send millions of viewers to a down site poured in from around the web.\n  “Coinbase spending $16,000,000 on a Superbowl ad to direct people to their website and $0 to make sure that website doesn&#39;t crash 10 seconds after the ad starts is so very internet,”   tweeted Edward Snowden amid the outage.\n  To Coinbase, though, the ad was a success. In   a blog post congratulating itself on the advertisement and interviewing Coinbase Chief Marketing Officer Kate Rouch about why the ad was so good, the company revealed it saw &#34;20M+ hits on our landing page in one minute&#34; which &#34;led to us temporarily throttling our systems.&#34; Chief executive Brian Armstrong   took to Twitter to gloat about the ad:   ranked #1 by AdWeek and peaking at #2 in the Apple App Store, just ahead of apps for the Pepsi Super Bowl Halftime Show and the NFL.\n  As it turns out, putting up nothing but a QR code in the middle of a widely-watched sports event and offering free money as well as a chance to win $3 million is a good way to build interest in your app. When Motherboard reached out to Coinbase about the ad, the company directed Motherboard to Rouch&#39;s blog post and reiterated its main points.\n  This campaign advertised by Coinbase is part of a larger initiative offering &#34;over $100M of similar incentives&#34; to bring in more fresh blood to the world of crypto―incredibly important in the wake of crypto’s recent sell-off and price crash. Coinbase   already offers users the chance to earn a few dollars worth of various tokens if they take a course on it, meaning if they watch video tutorials and complete quizzes on them.\n  While taking a victory lap for the apparent success of its ad, Coinbase took the time to explain why this is definitely not at all like the dotcom bubble, which many critics have said is an apt comparison for Sunday&#39;s ads.\n  “There have been a lot of comparisons to the dot.com era and speculation that many of the crypto companies advertising in this year’s Super Bowl will inevitably fail,” said Rouch in Coinbase&#39;s blog post. “We don’t think about it that way and judging from the early response we’ve seen, Super Bowl viewers don’t either.”\n  Rouch insisted that the sheer number of crypto ads in the Super Bowl was &#34;yet another signal that crypto is bursting into the mainstream, and at the center of the cultural zeitgeist.&#34;\n  That&#39;s one way to see it. Another is that crypto companies have accrued huge war chests over the past few years, and they’re now facing a critical moment as regulators begin to awaken from their stupor and critical backlash continues to pick up thanks to NFTs, a long series of fraudulent projects and tokens, absurd DAOs, and more. And so, they’re using their deep pockets to open the hearts, minds, and wallets of the public. That&#39;s got little to do with a zeitgeist and everything with pushing a product and an industry. Which, of course, is the point of all advertising, but there&#39;s no point in pretending otherwise.\n  By signing up, you agree to the  Terms of Use and  Privacy Policy &amp; to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.", "posttime": "2022-02-15 11:07:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,coinbase,swears", "title": "Coinbase发誓这一切都不像超级碗广告后的网络泡沫", "title_en": "Coinbase Swears This All Isn't Like the Dotcom Bubble After Super Bowl Ad SNAFU", "transed": 1, "url": "https://www.vice.com/en/article/4aw7v9/coinbase-swears-this-all-isnt-like-the-dotcom-bubble-after-super-bowl-ad-snafu", "via": "", "real_tags": ["广告", "coinbase", "swears"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "棋盘是一个矩阵，所以它涉及一个叫做线性代数的整个数学领域。\nn皇后之谜可以追溯到150多年前，直到n=27时才得以解决。\n哈佛大学的一位数学家（大部分）解决了一位150岁的女王&#39；这是一个有趣的n皇后之谜。\n哈佛大学博士后研究员迈克尔·西姆金（Michael Simkin）最近发表了一项研究（这意味着它尚未经过同行评审）；美国数学科学与应用中心（Center of Mathematic Sciences and Applications）对这一棘手的数学问题的解决方案进行了评估，该问题大致基于国际象棋规则。\n女王在很大程度上被认为是棋盘上最强大的棋子，因为她可以朝任何方向移动，包括对角线。那么，有多少皇后可以在棋盘上坐下来，而不会彼此相撞#39；什么样的道路？这里的逻辑类似于数独游戏，在棋盘上点着皇后，这样他们就不会&#39；不相交。\n想象一个经典的棋盘，它是一个八乘八的方阵。最著名的谜题版本与棋盘匹配，因为它涉及八个皇后，本例中有92个解决方案。但是&#34；n皇后问题&#34；不&#39；不要就此止步；那&#39；因为它的性质是渐进的，这意味着它的答案接近一个未定义的值，达到无穷大。\n到目前为止，专家们已经明确地解决了在27乘27板上最多27个皇后的所有自然数（计数数）。然而，对于两个或三个问题没有解决方案，因为有&#39；没有符合标准的皇后区定位。但是27岁以上的人呢？\n考虑到这一点：对于八个皇后来说，只有92个解决方案，但是对于27个皇后来说，有超过200个四万亿的解决方案。它&#39；It’不难看出，如果没有比现在更强大的计算能力，解决27以上数字的问题会变得极其笨拙，甚至不可能。\n那&#39；这是Simkin和#39；他的作品进入了竞技场。他的工作通过对n增加时解的数量的精确数学估计来接近这个主题。最终，他得出了以下公式：（0.143 n）n。换句话说，有大约（0.143 n）n种方法可以放置皇后，这样就没有人在n乘n的棋盘上互相攻击。\n数学本身是一个复杂的矩阵代数分类，需要50页的篇幅来浏览和证明。它&#39；有趣的是，从技术上讲，西姆金&#39；s的结果仍然只是一个估计！但它&#39；这比数学家们迄今为止所研究的要好。\n&#34;例如，在有100万个皇后的超大棋盘上，0.143乘以100万，得到大约143000个皇后。这个数字将被提高到100万次方，这意味着它&#39；它自身繁殖了那么多次。最后的答案是一个500万位数的数字&#34；哈佛在新闻稿中解释道。\n此内容是从{embed name}导入的。你可以在他们的网站上找到其他格式的相同内容，或者你可以找到更多信息。\n为了解决这个问题，西姆金首先计算了皇后在董事会中的平均分布。他使用这些值来确定下限值，这意味着特定值n将具有的最小解数。使用一种被称为&#34的策略；熵方法&#34；Simkin研究了他创建的网格的一个子单元（并命名为a&#34；queenon&#34；）找到上限值。\n这两种方法都使用平均性和/或随机性作为帮助建模正确值的方法。Simkin发现，他为下限值和上限值建立的两个不同函数几乎相同，这意味着候选答案库在它们之间非常紧密，从而建立了可靠的数学估计。\n所有这些艰苦的工作意味着，自1869年以来，我们第一次有了解决n皇后区问题的线索。对于Simkin和他在哈佛的系来说，这是一个巨大的成就，但具有讽刺意味：他没有&#39；我不会下棋&#34;我仍然喜欢玩的挑战，但是，我想，数学更宽容，&#34；他在新闻稿中解释道。\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。你可能会在piano上找到更多关于这个和类似内容的信息。木卫一", "note_en": "A  chess board is a matrix, so it involves an entire field of math called  linear algebra.\n The  n queens puzzle dates back over 150 years and is solved up to  n=27.\n   A mathematician from Harvard University has (mostly) solved a 150-year-old Queen&#39;s gambit of sorts: the delightful  n queens puzzle.\n In newly  self-published research (meaning it has not yet been peer-reviewed), Michael Simkin, a postdoctoral fellow at Harvard&#39;s Center of Mathematical Sciences and Applications, estimated the solution to the thorny math problem, which is based loosely on the rules of chess.\n  The queen is largely understood to be the most powerful piece on the board because she can move in any direction, including diagonals. So how many queens can fit on the chess board without falling into each other&#39;s paths? The logic at play here is similar to a  sudoku puzzle, dotting queens on the board so that they don&#39;t intersect.\n Picture a classic chess board, which is an eight-by-eight matrix of squares. The most well-known version of the puzzle matches the board because it involves eight queens—and there are 92 solutions in this case. But the &#34; n queens problem&#34; doesn&#39;t stop there; that&#39;s because its nature is asymptotic, meaning its answers approach an undefined value that reaches for the infinite.\n Up until now, experts have explicitly solved for all the natural numbers (the counting numbers) up to 27 queens in a 27-by-27 board. However, there is no solution for two or three, because there&#39;s no possible positioning of queens that satisfies the criteria. But what about numbers above 27?\n Consider this: for eight queens, there are just 92 solutions, but for 27 queens, there are over 200 quadrillion solutions. It&#39;s easy to see how solving the problem for numbers higher than 27 becomes extremely unwieldy or even impossible without more  computing power than we have at the moment.\n  That&#39;s where Simkin&#39;s work enters the arena. His work approached the topic through a sharp mathematical estimate of the number of solutions as  n increases. Ultimately, he   arrived at the following formula: (0.143 n)  n. In other words, there are approximately (0.143 n)  n ways that you can place the queens so that none are attacking one another on an  n-by- n chessboard.\n The math itself is a complex assortment of matrix algebra that takes 50 pages to walk through and prove. And it&#39;s interesting that, technically, Simkin&#39;s results are still just an estimate! But it&#39;s better than what mathematicians have been working with up until now.\n &#34;On the extremely large chessboard with one million queens, for example, 0.143 would be multiplied by one million, coming out to about 143,000. That figure would then be raised to the power of one million, meaning it&#39;s multiplied by itself that many times. The final answer is a figure with five million digits,&#34; Harvard explains in a  press release.\n This content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n  To come to his solution, Simkin first took the averages of the distribution of queens around the board. He used those values to establish the lowerbound value, meaning the minimum number of solutions that a particular value of  n will have. Using a strategy known as the &#34;entropy method,&#34; Simkin studied a subunit of the grid that he created (and named a &#34;queenon&#34;) to find the upperbound value.\n Both approaches use averageness and/or randomness as a way to help model the correct value. Simkin discovered that the two different functions he established for lowerbound and upperbound values are almost the same—that means the candidate pool of answers is smushed between them very tightly, establishing a solid mathematical estimate.\n All of this hard work means that, for the first time since 1869, we have an inkling of a solution to the  n queens problem. For Simkin and his department at Harvard, this is a huge achievement, but an ironic one: he doesn&#39;t play chess. &#34;I still enjoy the challenge of playing, but, I guess, math is more forgiving,&#34; he explains in the release.\n     This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2022-02-15 11:02:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "国际象棋,mathematician,皇后", "title": "哈佛数学家证实150年前的国际象棋谜题", "title_en": "Harvard Mathematician Proves 150-Year Old Chess Puzzle", "transed": 1, "url": "https://www.popularmechanics.com/science/math/a39024248/harvard-mathematician-solves-150-year-old-chess-problem/", "via": "", "real_tags": ["国际象棋", "皇后"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软正在启用微软防御系统&#39；攻击面减少&#39；默认情况下阻止黑客的安全规则&#39；试图从LSASS进程窃取Windows凭据。\n当威胁参与者破坏网络时，他们试图通过窃取凭据或利用漏洞从侧面传播到其他设备。\n窃取Windows凭据的最常见方法之一是在受损设备上获得管理员权限，然后转储Windows中运行的本地安全授权服务器服务（LSASS）进程的内存。\n此内存转储包含登录到计算机的用户的Windows凭据的NTLM哈希，这些用户可以被强制使用明文密码，或用于通过哈希攻击登录到其他设备。\n下面展示了威胁参与者如何使用流行的Mimikatz程序从LSASS中转储NTLM哈希。\n虽然Microsoft Defender会阻止Mimikatz等程序，但LSASS内存转储仍然可以传输到远程计算机以转储凭据，而无需担心被阻止。\n为了防止威胁参与者滥用LSASS内存转储，微软引入了防止访问LSASS进程的安全功能。\n其中一个安全特性是Credential Guard，它将LSASS进程隔离在虚拟化容器中，以防止其他进程访问它。\n但是，此功能可能会导致与驱动程序或应用程序发生冲突，导致某些组织无法启用它。\n作为一种缓解Windows凭据盗窃而不引起凭据保护引入的冲突的方法，微软将很快在默认情况下启用Microsoft Defender攻击面减少（ASR）规则。\n规则&#39；阻止从Windows本地安全授权子系统&39窃取凭据；防止进程打开LSASS进程并转储其内存，即使它具有管理权限。\n这一新变化是安全研究员科斯塔斯在本周发现的，他发现了微软的一个更新&#39；s ASR规则文档。\n&#34;攻击面缩减（ASR）规则“阻止从Windows本地安全授权子系统（lsass.exe）窃取凭据”的默认状态将从未配置更改为已配置，默认模式设置为阻止。所有其他ASR规则将保持默认状态：未配置&#34; 微软在更新的文件中解释了ASR规则。\n&#34;规则中已经加入了额外的过滤逻辑，以减少最终用户通知。客户可以将规则配置为审核、警告或禁用模式，这将覆盖默认模式。此规则的功能是相同的，无论该规则是在默认打开模式下配置的，还是在手动启用块模式下配置的&#34;\n由于攻击面减少规则往往会在事件日志中引入误报和大量噪音，因此微软之前默认情况下没有启用安全功能。\n然而，微软最近开始以牺牲便利性为代价，通过删除管理员和Windows用户使用的增加攻击面的常见功能来选择安全性。\n例如，微软最近宣布，他们将在4月份禁止在Office应用程序中启用下载的Office文档中的VBA宏，从而扼杀了一种流行的恶意软件分发方法。\n本周，我们还了解到，微软已经开始弃用WMIC工具，该工具通常用于安装恶意软件和运行命令。\n虽然默认情况下启用ASR规则将显著影响Windows凭据的窃取，但无论如何它都不是一个灵丹妙药。\n这是因为只有运行Microsoft Defender作为主要防病毒软件的Windows Enterprise许可证才支持完整的攻击面减少功能。然而，BleepingComputer&#39；s测试表明，LSASS ASR规则也适用于Windows 10和Windows 11 Pro客户端。\n此外，安全研究人员还发现了内置的Microsoft Defender排除路径，允许威胁参与者从这些文件名/目录运行工具，以绕过ASR规则并继续转储LSASS进程。\n默认情况下，将启用ASR规则来强化LSASS，但请记住，这不是&#39；不是银弹，有很多方法可以解决这个问题。。。这一定是我最喜欢的照片之一。啁啾com/fuQYJ3ZcAn\n-亚当·切斯特（Adam Chester）2022年2月9日\nMimikatz开发者Benjamin Delpy告诉BleepingComputer，微软可能为另一条规则添加了这些内置排除，但由于排除会影响所有规则，它绕过了LSASS限制。\n&#34;例如，如果他们想从规则中排除一个目录，&#34；阻止可执行文件运行，除非它们符合流行率、年龄或受信任列表标准&34；它&#39；只有这条规则是不可能的。排除适用于所有ASR规则。。。包括LSASS访问和#34；，Delpy在一次关于即将到来的变化的对话中向BleepingComputer解释。\n然而，尽管存在所有这些问题，Delpy认为这一变化是微软向前迈出的重要一步，并认为它将对威胁参与者产生重大影响；s窃取Windows凭据的能力。\n&#34;它&#39；这是我们多年（几十年？）来一直要求的。它&#39；这是一个很好的步骤，我&#39；I’我很高兴看到从互联网上下载时，+宏被默认禁用。我们现在开始看到与现实世界中的攻击真正相关的措施；德尔比继续说。\n&#34;没有正当理由支持打开LSASS进程的进程。。。仅支持与身份验证相关的错误/遗留/蹩脚产品（大多数情况下：&#39；）&#34;\nBleepingComputer已联系微软，以了解更多有关默认情况下何时启用此规则的信息，但尚未得到回复。", "note_en": "Microsoft is enabling a Microsoft Defender &#39;Attack Surface Reduction&#39; security rule by default to block hackers&#39; attempts to steal Windows credentials from the LSASS process.\n When threat actors compromise a network, they attempt to spread laterally to other devices by stealing credentials or using exploits.\n One of the most common methods to steal Windows credentials is to gain admin privileges on a compromised device and then dump the memory of the Local Security Authority Server Service (LSASS) process running in Windows.\n This memory dump contains NTLM hashes of Windows credentials of users who had logged into the computer that can be brute-forced for clear-text passwords or used in  Pass-the-Hash attacks to login into other devices.\n A demonstration of how threat actors can use the popular Mimikatz program to dump NTLM hashes from LSASS is shown below.\n  While Microsoft Defender block programs like Mimikatz, a LSASS memory dump can still be transferred to a remote computer to dump credentials without fear of being blocked.\n  To prevent threat actors from abusing LSASS memory dumps, Microsoft has introduced security features that prevent access to the LSASS process.\n One of these security features is Credential Guard, which isolates the LSASS process in a virtualized container that prevents other processes from accessing it.\n However, this feature can lead to conflicts with drivers or applications, causing some organizations not to enable it.\n As a way to mitigate Windows credential theft without causing the conflicts introduced by Credential Guard, Microsoft will soon be enabling a Microsoft Defender  Attack Surface Reduction (ASR) rule by default.\n The rule, &#39; Block credential stealing from the Windows local security authority subsystem,&#39; prevents processes from opening the LSASS process and dumping its memory, even if it has administrative privileges.\n  This new change was  discovered this week by security researcher  Kostas who spotted an update to Microsoft&#39;s ASR rules documentation.\n &#34;The default state for the Attack Surface Reduction (ASR) rule “Block credential stealing from the Windows local security authority subsystem (lsass.exe)” will change from  Not Configured to  Configured and the default mode set to  Block. All other ASR rules will remain in their default state:  Not Configured.,&#34; Microsoft  explained in the updated document on the ASR rule.\n &#34;Additional filtering logic has already been incorporated in the rule to reduce end user notifications. Customers can configure the rule to  Audit,  Warn or  Disabled modes, which will override the default mode. The functionality of this rule is the same, whether the rule is configured in the on-by-default mode, or if you enable Block mode manually. &#34;\n As Attack Surface Reduction rules tend to introduce false positives and a lot of noise in Event Logs, Microsoft had previously not enabled the security feature by default.\n However, Microsoft has recently begun to choose security at the expense of convenience by removing common features used by Admins and Windows users that increase attack surfaces.\n For example, Microsoft recently announced that they would  prevent VBA macros in downloaded Office documents from being enabled within Office applications in April, killing off a popular distribution method for malware.\n This week, we also learned that Microsoft had  begun the deprecation of the WMIC tool that threat actors commonly use to install malware and run commands.\n  While enabling the ASR rule by default will significantly impact the stealing of Windows credentials, it is not a silver bullet by any means.\n This is because the full Attack Surface Reduction feature is only supported on Windows Enterprise licenses running Microsoft Defender as the primary antivirus. However, BleepingComputer&#39;s tests show that the LSASS ASR rule also works on Windows 10 and Windows 11 Pro clients.\n  Furthermore, security researchers have discovered built-in Microsoft Defender exclusion paths allowing threat actors to run their tools from those filenames/directories to bypass the ASR rules and continue to dump the LSASS process.\n ASR rule to harden LSASS is being turned on by default, but remember that this isn&#39;t a silver bullet, plenty of ways around this... this has to be one of my favourites  pic.twitter.com/fuQYJ3ZcAn\n— Adam Chester (@_xpn_)  February 9, 2022\n Mimikatz developer Benjamin Delpy told BleepingComputer that Microsoft probably added these built-in exclusions for another rule, but as exclusions affect  ALL rules, it bypasses the LSASS restriction.\n &#34;For example, if they want to exclude a directory from the rule, &#34;Block executable files from running unless they meet a prevalence, age, or trusted list criterion,&#34; it&#39;s not possible for this rule only. Exclusion is for ALL of the ASR rules... including LSASS access&#34;, Delpy explained to BleepingComputer in a conversation about the upcoming changes.\n However, even with all of these issues, Delpy sees this change as a major step forward by Microsoft and believes it will significantly impact a threat actor&#39;s ability to steal Windows credentials.\n &#34;It&#39;s something we have asked for years (decades?). It&#39;s a good step and I&#39;m very happy to see that + Macro disabled by default when coming from the Internet. We now start to see measures really related to real world attacks,&#34; continued Delpy.\n &#34;There is no legitimate reason to support a process opening the LSASS process... only to support buggy / legacy / crappy products - most of the time - related to authentication :&#39;).&#34;\n BleepingComputer has reached out to Microsoft to learn more about when this rule will be enabled by default but has not heard back.", "posttime": "2022-02-15 10:56:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,windows,密码,defender,规则", "title": "Microsoft Defender将很快阻止Windows密码盗窃", "title_en": "Microsoft Defender Will Soon Block Windows Password Theft", "transed": 1, "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-defender-will-soon-block-windows-password-theft/", "via": "", "real_tags": ["microsoft", "windows", "密码", "defender", "规则"]}]