[{"category": "", "categoryclass": "", "imagename": "3f0ad5daf5d1c5f7e3a95db731c7a31c.jpeg", "infoid": 1016922, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sunny Dhillon是旧金山Signia Ventures的早期投资者，在那里他投资于零售技术、电子商务基础设施和物流，以及消费者和企业软件初创公司。\n这就引出了一个问题：在面临比大流行前更大的挑战的情况下，杂货商如何确保他们的商店继续有利可图地运营？\n就像微履行中心(MFC)、暗店和其他履行解决方案一直在帮助电子杂货商优化盈利能力一样，各种新旧技术可以帮助实体店保持相关性，并继续大量生产现金。\n今天，我们为大流行后的零售杂货商提出三个“必做之事”：依靠数据、依靠生物和依靠硬件。\n在商店购物的标志是一致的供应和广泛的新鲜商品选择-通常比在线购物更多。但随着店内顾客数量的持续波动，计划库存和最大限度地减少浪费对杂货店经理来说已经变得越来越困难。杂货商平均扔掉超过12%的现货，这会蚕食本已微薄的利润率。\n虽然电子杂货商正在自动化和优化他们的履行操作，但实体杂货商可以自动化和优化他们的库存计划机制。要做到这一点，他们必须利用现有的客户、业务和外部数据宝库，为门店经理收集有价值的见解。\n沃尔玛(Walmart)的伊甸园科技(Eden Technologies)就是一个先锋例子。这个内部工具是从公司的黑客松项目中剥离出来的，已经在全国43个配送中心部署，并承诺在未来几年为沃尔玛节省超过20亿美元。例如，如果一批原本打算供应数百英里外的商店的产品被认为即将成熟，该工具可以帮助将其转移到最近的商店，使用FDA的标准和100多万张图像来推动其分析。\n同样，Fresh Technologies和Shelf Engine等合资企业也建立了平台，利用多年的客户和销售历史数据，以及季节性和其他外部因素，帮助门店经理确定订购数量和时间。结果是积极的-货架引擎客户的毛利率增加了25%以上，再次客户减少了高达45%的食物浪费。", "note_en": "Sunny Dhillon is an early-stage investor at  Signia Ventures in San Francisco where he invests in retail tech, e-commerce infrastructure and logistics, alongside consumer and enterprise software startups.\n  This begs the question: With even greater challenges than pre-pandemic, how can grocers ensure their stores continue to operate profitably?\n Just as micro-fulfillment centers (MFCs), dark stores and  other fulfillment solutions have been helping e-grocers optimize profitability, a variety of old and new technologies can help brick-and-mortar stores remain relevant and continue churning out cash.\n Today, we present three “must-dos” for post-pandemic retail grocers: rely on the data, rely on the biology and rely on the hardware.\n   The hallmark of shopping in a store is the consistent availability and wide selection of fresh items — often more so than online. But as the number of in-store customers continues to fluctuate, planning inventory and minimizing waste has become ever more so a challenge for grocery store managers. Grocers on average  throw out more than 12% of their on-shelf produce, which eats into already razor-thin margins.\n While e-grocers are automating and optimizing their fulfillment operations, brick-and-mortar grocers can automate and optimize their inventory planning mechanisms. To do this, they must leverage their existing troves of customer, business and external data to glean valuable insights for store managers.\n Eden Technologies of Walmart is a pioneering example. Spun out of a company hackathon project, the internal tool has been deployed at over 43 distribution centers nationwide and promises to save Walmart over $2 billion in the coming years. For instance, if a batch of produce intended for a store hundreds of miles away is deemed soon-to-ripen, the tool can help divert it to the nearest store instead,  using FDA standards and over 1 million images to drive its analysis.\n  Similarly, ventures such as  Afresh Technologies and  Shelf Engine have built platforms to leverage years of historical customer and sales data, as well as seasonality and other external factors, to help store managers determine  how much to order and when. The results have been nothing but positive — Shelf Engine customers have increased gross margins by  over 25% and Afresh customers have reduced food waste by  up to 45%.", "posttime": "2020-08-08 02:39:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "物联网,推动,data,杂货商", "title": "\n物联网和数据科学将在大流行后时代推动FoodTech", "title_en": "\n\t\t\t\tIoT and data science will boost foodtech in the post-pandemic era\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/iot-and-data-science-will-boost-foodtech-in-the-post-pandemic-era/", "via": "", "real_tags": ["物联网", "推动", "data", "杂货商"]}, {"category": "", "categoryclass": "", "imagename": "94b610cb94b805f7801107225c33c814.jpg", "infoid": 1016921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "换句话说，谁投资一家初创公司，与他们带来的总资本一样重要，甚至更重要。\n7月份，在TechCrunch的虚拟早期活动中，Emerging Capital的杰克·萨珀指出，对创始人来说，了解进入董事会的人很重要，因为他们可能会在很长一段时间内成为公司的一部分，要解雇他们真的很难。但萨珀补充说，建立联系并不像人们想象的那么容易。\n筹资过程要求创始人在短时间内做出决定之前，与众多投资者举行会议。萨珀说：“任何一方都不能真正充分了解对方，知道这是否是他们想要进入的关系。”\n“你想和给你能量的人一起工作，”他补充道。这就是为什么我强烈鼓励你在结束种子期后不久就开始了解潜在的A系列领先优势。“。\n萨珀建议，在创始人完成种子轮融资后，尽快确定几个潜在的潜在线索，从而延长通常较短的首轮时间框架。创始人不应该随便挑一个名气大、资金雄厚的人。相反，他建议将重点放在适合其初创企业业务类别或行业的投资者身上。", "note_en": "In other words,  who invests in a startup matters as much — or more — than the total capital they’re bringing with them.\n It’s important for founders to get to know the people coming onto their board because they’ll likely be a part of the company for a long time, and it’s really hard to fire them,  Jake Saper   of Emergence Capital noted during TechCrunch’s virtual Early Stage event in July. But forging a connection isn’t as easy as one might think, Saper added.\n The fundraising process requires founders to pack in meetings with numerous investors before making a decision in a short period of time. “Neither party really gets to know the other well enough to know if this is a relationship they want to enter into,” Saper said.\n “You want to work with people who give you energy,” he added. “And this is why I strongly encourage you to start to get to know potential Series A leads shortly after you close your seed round.”\n   Saper recommends extending the typically short Series A time frame by identifying a handful of potential leads as soon as a founder has closed their seed round. Founders shouldn’t just pick any one with a big name and impressive fund. Instead, he recommends focusing on investors who are suited to their startup’s business category or industry.", "posttime": "2020-08-08 02:39:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "挑选,series,创始人", "title": "\n如何挑选合适的首轮投资者", "title_en": "\n\t\t\t\tHow to pick the right Series A investors\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/how-to-pick-the-right-series-a-investors/", "via": "", "real_tags": ["挑选", "series", "创始人"]}, {"category": "", "categoryclass": "", "imagename": "082d30504b134a874cd72f2ea71b3e4a.png", "infoid": 1016920, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，数十个Reddit频道遭到黑客攻击，显示支持唐纳德·特朗普竞选连任的信息，Reddit遭到大规模黑客攻击。\n在撰写本文时，黑客攻击仍在进行中，但我们被告知Reddit的安全团队已经意识到了这个问题，并且已经开始修复被破坏的频道。\n下面提供了受影响通道(子红线)的部分列表。这包括NFL的Reddit频道，许多电视节目，海盗湾，迪士尼乐园，迪士尼的复仇者联盟，几个城市频道，等等。加在一起，这些频道拥有数千万订户。\n\nReddit安全团队尚未就此次黑客攻击发表官方声明，但事件的大规模规模表明，入侵者可能获得了高特权版主或管理员账户的访问权限。\n有问题的频道所有者已被要求在此Reddit ModSupport线程中报告问题。\n在Reddit遭到黑客攻击之前，Reddit在6月下旬禁止了唐纳德·特朗普(Donald Trump)支持者的频道r/the_Donald。Reddit表示，在接到骚扰、欺凌和暴力威胁的报告后，它决定禁止该频道，因为它违反了社区规则。\n今天的这一噱头让人想起6月底和7月初发生的类似事件，当时有1800多个Roblox账户被黑客入侵，并带有类似的支持特朗普连任的信息。", "note_en": "A massive hack has hit Reddit today after tens of Reddit channels have been hacked and defaced to show messages in support of Donald Trump&#39;s reelection campaign.\n The hacks are still ongoing at the time of writing, but we were told Reddit&#39;s security team is aware of the issue and has already begun restoring defaced channels.\n A partial list of impacted channels (subreddits) is available below. This includes Reddit channels for the NFL, many TV shows, The Pirate Bay, Disneyland, Disney&#39;s Avengers, several city channels, and more. Combined, the channels have tens of millions of subscribers.\n \n The Reddit security team has not provided an official statement on the hack, but the large scale of the incident suggests that the intruder(s) might have gained access to a high-privileged moderator or admin account.\n Channel owners who are having problems have been asked to report problems in this  Reddit ModSupport thread.\n The Reddit hack also comes after  Reddit banned r/The_Donald, a channel for Donald Trump supporters, in late June. Reddit said it took the decision to ban the channel for breaking its community rules after reports of harassment, bullying, and threats of violence.\n Today&#39;s stunt is reminiscent to a similar one that took place at the end of June and the start of July, when  more than 1,800 Roblox accounts were hacked and defaced with a similar pro-Trump reelection message.", "posttime": "2020-08-08 02:39:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,黑客攻击,hack,频道", "title": "大规模黑客攻击Reddit", "title_en": "Massive Hack Hits Reddit", "transed": 1, "url": "https://www.zdnet.com/article/hackers-are-defacing-reddit-with-pro-trump-messages/", "via": "", "real_tags": ["黑客", "黑客攻击", "hack", "频道"]}, {"category": "", "categoryclass": "", "imagename": "4a911c99ebba6dce3445dd27547417db.jpeg", "infoid": 1016919, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦/纽约(路透社)-自从世界卫生组织(World Health Organization)1月份宣布这种新型冠状病毒为国际卫生紧急情况以来，Facebook Inc(FB.O)已经删除了700多万条关于该病毒的虚假声明，这些内容可能会对相信他们的人构成直接的健康风险。\n这家社交媒体巨头长期以来一直因其处理平台上的错误信息的方式而受到议员们的抨击。该公司表示，近几个月来已禁止此类说法，称“社交疏远是行不通的”，因为它们构成了“迫在眉睫”伤害的风险。根据这些规定，脸书周三撤下了美国总统唐纳德·特朗普发布的一段视频，他在视频中声称，儿童对新冠肺炎“几乎免疫”。\n但据该公司疫苗政策负责人杰森·赫希(Jason Hirsch)称，在大多数情况下，脸书没有删除有关仍在开发中的新新冠肺炎疫苗的错误信息，理由是此类声称没有达到其迫在眉睫的伤害门槛。赫希告诉路透社，该公司正在“努力”解决如何监管有关尚未证实的新疫苗的声明的两难境地。\n赫希在接受路透采访时表示，“在地面事实变得更加具体之前，我们能做的事情是有上限的.”他首次公开谈及该公司正试图如何处理冠状病毒疫苗问题.。\nFacebook的事实核查合作伙伴之一Full Fact的编辑汤姆·菲利普斯(Tom Phillips)这样看待这个难题：“你如何对一种还不存在的疫苗进行事实核查？”\n路透社(Reuters)、Facebook事实核查人员和其他研究人员对帖子的审查发现，目前，在一个月度活跃用户超过26亿的平台上，从毫无根据的说法到关于开发疫苗的复杂阴谋论，各种错误信息正在激增。\n公共卫生专家告诉路透社(Reuters)，令人担忧的是，社交媒体上错误信息的传播可能会阻止人们最终服用疫苗。疫苗被视为遏制这场大流行的最好机会。这场大流行已在全球范围内感染了数百万人，导致数十万人死亡，其中仅美国就有15.8万人。\n与此同时，言论自由倡导者担心在不确定时期增加审查，以及病毒被驯服很久之后的持久影响。\n事实核查人员告诉路透社，对于新的新冠肺炎疫苗来说，区分真假也比关于有既定安全记录的疫苗的内容复杂得多。\n脸书的代表说，该公司一直在咨询大约50名公共卫生、疫苗和言论自由方面的专家，就如何应对有关新的新冠肺炎疫苗的说法做出回应。\n尽管第一批疫苗预计几个月内不会投放市场，但民意调查显示，许多美国人已经对接种新的新冠肺炎疫苗感到担忧，这种疫苗正在以创纪录的速度开发。路透社/益普索(Reuters/Ipsos)在7月15日至21日进行的一项民意调查显示，约28%的美国人表示，他们对接种疫苗不感兴趣。其中，超过50%的人表示对发展速度感到紧张。超过三分之一的人表示，他们不信任疫苗研发的幕后黑手。\n总部设在英国的非营利组织对抗数字仇恨中心(Center For Counting Digital Hate)在7月份报告称，社交媒体网站上的反疫苗内容正在蓬勃发展。在CCDH研究的所有社交媒体平台上，Facebook群组和页面占总抗疫苗人数的一半以上。\n今年4月，位于威斯康星州沃基沙的42岁市政承包商迈克尔·施耐德(Michael Schneider)在Facebook上创建了一个名为“拒绝科罗娜V@X和螺丝比尔·盖茨”的公开群组，这个群指的是一位亿万富翁，他的基金会正在帮助资助疫苗的开发。在不到四个月的时间里，该组织的成员增加到了1.4万人。路透社发现，这是过去几个月里创建的十几个致力于反对新冠肺炎疫苗和政府可能强制要求它的想法的组织之一。\n施耐德告诉路透社，他对新冠肺炎疫苗持怀疑态度，因为他认为它开发得太快了，不安全。“我认为很多人都吓坏了，”他说。\n关于新冠肺炎疫苗的帖子在脸书上被贴上了含有虚假信息的标签，但没有被删除，其中包括施耐德链接到Youtube上的一段视频，该视频声称新冠肺炎疫苗将改变人们的dna，还有一篇帖子声称疫苗将给人们带来冠状病毒。(见路透社事实核查：reut.rs/30t1toW]。\nFacebook表示，这些帖子没有违反其与迫在眉睫的伤害相关的政策。“如果我们简单地移除所有阴谋论和恶作剧，它们将存在于互联网和更广泛的社交媒体生态系统的其他地方。当这些恶作剧出现在其他地方时，这有助于提供更多的背景信息。“一位女发言人说。\nFacebook不会标记或删除表达反对疫苗的帖子或广告，如果它们不包含虚假声明的话。赫希说，Facebook认为用户应该能够表达这样的个人观点，对反疫苗观点进行更积极的审查也可能促使人们对疫苗犹豫不决，转向反疫苗阵营。\n赫希说，Facebook决定删除哪些内容的关键是两个考虑因素。如果一篇帖子被识别为包含简单的虚假信息，它将被贴上标签，Facebook可以通过限制向多少人展示该帖子来缩小其覆盖范围。例如，施耐德发布的视频就采用了这种方法，视频显示新冠肺炎疫苗可以改变人的dna。\n如果虚假信息可能造成迫在眉睫的危害，那么它将被完全删除。上个月，根据这些规定，该公司删除了一段吹嘘羟基氯喹是一种冠状病毒疗法的视频-尽管这段视频获得了数百万的点击量。\n2019年3月，Facebook表示，将开始降低散布任何疫苗错误信息的团体和页面的排名和搜索建议。当人们在Facebook平台上搜索疫苗信息时，Facebook的算法还会提升与世界卫生组织(WHO)等组织的链接。\n一些公共卫生专家希望脸书在考虑关于未来新冠肺炎疫苗的虚假声明时降低他们的移除标准。约翰·霍普金斯大学彭博公共卫生学院(Johns Hopkins Bloomberg School Of Public Health)的社会科学家鲁帕利·利马耶(Rupali Limaye)一直在与Facebook谈判，他说：“我认为这样的平台有责任确保他们删除任何可能导致伤害的东西。”“因为它是一种致命的病毒，我认为它不应该只是‘迫在眉睫’。”\n但哥本哈根智库Justitia的执行董事雅各布·姆昌马(Jacob Mchangama)担心大规模删除的后果：“当这种病毒有望得到控制时，这可能会对言论自由产生长期影响，”他说，Facebook曾就其疫苗方法征求过意见。\n有关其他疫苗的错误信息很少达到Facebook的危险门槛。\n然而，去年在巴基斯坦，该公司进行了干预，以消除有关脊髓灰质炎疫苗运动的虚假说法，这些虚假说法导致了针对卫生工作者的暴力行为。在太平洋岛国萨摩亚，Facebook删除了疫苗错误信息，因为低疫苗接种率正在加剧危险的麻疹爆发。\n“关于疫苗，这不是理论上的线条…。我们确实试图确定什么时候可能会有错误信息造成的迫在眉睫的伤害，我们试图在这些情况下采取行动，“Hirsch告诉路透社。\n为了打击不符合删除标准的错误信息，Facebook付钱给外部事实核查人员-包括路透社(Reuters)的一个部门-他们可以将帖子评级为虚假，并附上解释。该公司表示，95%的情况下，看到事实核查人员警告标签的人不会点击进入内容。[bit.ly/33z7Jh6]。\n尽管如此，事实核查计划仍被一些研究人员批评为对平台上病毒式错误信息的数量和速度反应不足。事实核查人员也不会对政客的帖子进行评分，他们也不会评判完全属于私人或隐藏团体的帖子。\n脸书上的事实核查人员告诉路透社，确定关于新冠肺炎疫苗的虚假声明比事实核查关于已有安全记录的已建立疫苗的声明要困难得多。\nFacebook的另一个事实核查合作伙伴科学反馈公司(Science Feedback)的创始人伊曼纽尔·文森特(Emmanuel Vincent)表示：“我们看到了很多内容，但我们甚至不知道如何处理这些内容。”他表示，正在研发的疫苗数量太多，很难驳斥有关疫苗如何工作的说法。\n在5月发表在《自然》杂志上的一项研究中，物理学家尼尔·约翰逊的研究小组发现，在2019年2月至10月的全球麻疹疫情期间，Facebook上活跃的反疫苗接种小组的数量几乎是支持接种疫苗的小组的三倍，而且增长速度更快。\n约翰逊说，自从这项研究发表以来，反疫苗的观点和新冠肺炎疫苗阴谋在该平台上蓬勃发展，并补充说，“这有点像类固醇。”", "note_en": "LONDON/NEW YORK (Reuters) - Since the World Health Organization declared the novel coronavirus an international health emergency in January, Facebook Inc (  FB.O) has removed more than 7 million pieces of content with false claims about the virus that could pose an immediate health risk to people who believe them.\n  The social media giant, which has long been under fire from lawmakers over how it handles misinformation on its platforms, said it had in recent months banned such claims as ‘social distancing does not work’ because they pose a risk of ‘imminent’ harm. Under these rules, Facebook took down a video post on Wednesday by U.S. President Donald Trump in which he claimed that children are “almost immune” to COVID-19.\n But in most instances, Facebook does not remove misinformation about the new COVID-19 vaccines that are still under development, according to the company’s vaccine policy lead Jason Hirsch, on the grounds that such claims do not meet its imminent harm threshold. Hirsch told Reuters the company is “grappling” with the dilemma of how to police claims about new vaccines that are as yet unproven.\n “There’s a ceiling to how much we can do until the facts on the ground become more concrete,” Hirsch said in an interview with Reuters, talking publicly for the first time about how the company is trying to approach the coronavirus vaccine issue.\n Tom Phillips, editor at one of Facebook’s fact-checking partners Full Fact, sees the conundrum this way: “How do you fact check about a vaccine that does not exist yet?”\n For now, misinformation ranging from unfounded claims to complex conspiracy theories about the developmental vaccines is proliferating on a platform with more than 2.6 billion monthly active users, a review of posts by Reuters, Facebook fact-checkers and other researchers found.\n The worry, public health experts told Reuters, is that the spread of misinformation on social media could discourage people from eventually taking the vaccine, seen as the best chance to stem a pandemic that has infected millions and killed hundreds of thousands worldwide, including 158,000 people in the United States alone.\n At the same time, free speech advocates fret about increased censorship during a time of uncertainty and the lasting repercussions long after the virus is tamed.\n Drawing the line between true and false is also more complex for the new COVID-19 vaccines, fact-checkers told Reuters, than with content about vaccines with an established safety record.\n Facebook representatives said the company has been consulting with about 50 experts in public health, vaccines, and free expression on how to shape its response to claims about the new COVID-19 vaccines.\n Even though the first vaccines aren’t expected to go to market for months, polls show that many Americans are already concerned about taking a new COVID-19 vaccine, which is being developed at a record pace. Some 28% of Americans say they are not interested in getting the vaccine, according to a Reuters/Ipsos poll conducted between July 15-21. Among them, more than 50% said they were nervous about the speed of development. More than a third said they did not trust the people behind the vaccine’s development.\n The U.K.-based non-profit Center for Countering Digital Hate reported in July that anti-vaccination content is flourishing on social media sites. Facebook groups and pages accounted for more than half of the total anti-vaccine following across all the social media platforms studied by the CCDH.\n One public Facebook group called “REFUSE CORONA V@X AND SCREW BILL GATES,” referring to the billionaire whose foundation is helping to fund the development of vaccines, was started in April by Michael Schneider, a 42-year-old city contractor in Waukesha, Wisconsin. The group grew to 14,000 members in under four months. It was one of more than a dozen created in the last few months which were dedicated to opposing the COVID-19 vaccine and the idea that it might be mandated by governments, Reuters found.\n Schneider told Reuters he is suspicious of the COVID-19 vaccine because he thinks it is being developed too fast to be safe. “I think a lot of people are freaking out,” he said.\n Posts about the COVID-19 vaccine that have been labeled on Facebook as containing &#34;false information&#34; but not removed include one by Schneider linking to a YouTube video that claimed the COVID-19 vaccine will alter people’s DNA, and a post that claimed the vaccine would give people coronavirus. (See Reuters fact-check:  reut.rs/30t1toW]\n Facebook said that these posts did not violate its policies related to imminent harm. “If we simply removed all conspiracy theories and hoaxes, they would exist elsewhere on the internet and broader social media ecosystem. This helps give more context when these hoaxes appear elsewhere,” a spokeswoman said.\n Facebook does not label or remove posts or ads that express opposition to vaccines if they do not contain false claims. Hirsch said Facebook believes users should be able to express such personal views and that more aggressive censorship of anti-vaccine views could also push people hesitant about vaccines towards the anti-vaccine camp.\n  At the crux of Facebook’s decisions over what it removes are two considerations, Hirsch said. If a post is identified as containing simply false information, it will be labeled and Facebook can reduce its reach by limiting how many people will be shown the post. For example, it took this approach with the video Schneider posted suggesting the COVID-19 vaccine could alter people’s DNA.\n If the false information is likely to cause imminent harm, then it will be removed altogether. Last month, under these rules, the company removed a video touting hydroxychloroquine as a coronavirus cure – though only after it racked up millions of views.\n In March 2019, Facebook said it would start reducing the rankings and search recommendations of groups and pages spreading misinformation about any vaccines. Facebook’s algorithms also lift up links to organizations like the WHO when people search for vaccine information on the platform.\n Some public health experts want Facebook to lower their removal standards when considering false claims about the future COVID-19 vaccines. “I think there is a duty (by) platforms like that to ensure that they are removing anything that could lead to harm,” said Rupali Limaye, a social scientist at the Johns Hopkins Bloomberg School of Public Health, who has been in talks with Facebook. “Because it is such a deadly virus, I think it shouldn’t just have to be ‘imminent.’”\n But Jacob Mchangama, the executive director of Copenhagen-based think tank Justitia who was consulted by Facebook about its vaccine approach, fears the fallout from mass deletions: “This may have long-term consequences for free speech when this virus is hopefully contained,” he said.\n Misinformation about other vaccines has rarely met Facebook’s threshold for risking imminent harm.\n However, in Pakistan last year, the company intervened to take down false claims about the polio vaccine drive that were leading to violence against health workers. In the Pacific island state of Samoa, Facebook deleted vaccine misinformation because the low vaccination rate was exacerbating a dangerous measles outbreak.\n “With regard to vaccines, it’s not a theoretical line … we do try to determine when there is likely going to be imminent harm resulting from misinformation and we try to act in those situations,” Hirsch told Reuters.\n To combat misinformation that doesn’t meet its removal criteria, Facebook pays outside fact-checkers – including a Reuters unit – who can rate posts as false and attach an explanation. The company has said that 95 percent of the time, people who saw fact-checkers&#39; warning labels did not click through to the content. [ bit.ly/33z7Jh6]\n Still, the fact-checking program has been criticized by some researchers as an inadequate response to the amount and speed of viral misinformation on the platforms. Fact-checkers also do not rate politicians’ posts and they do not judge posts that are exclusively in private or hidden groups.\n Determining what constitutes a false claim regarding the COVID-19 shot is much harder than fact-checking a claim about an established vaccine with a proven safety record, Facebook fact-checkers told Reuters.\n “There is a lot of content that we see and we don’t even know what to do with it,” echoed Emmanuel Vincent, founder of Science Feedback, another Facebook fact-checking partner, who said the number of vaccines in development made it difficult to debunk claims about how a shot would work.\n In a study published in May in the journal Nature, physicist Neil Johnson’s research group found that there were nearly three times as many active anti-vaccination groups on Facebook as pro-vaccination groups during a global measles outbreak from February to October 2019, and they were faster growing.\n Since the study was published, anti-vaccine views and COVID-19 vaccine conspiracies have flourished on the platform, Johnson said, adding, “It’s kind of on steroids.”", "posttime": "2020-08-08 02:38:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,发布,新冠,claims,疫苗", "title": "脸书及其事实核查合作伙伴表示，他们正在努力解决如何监管有关尚未发布的新冠肺炎新疫苗的说法的两难境地", "title_en": "Facebook and its fact-checking partners say they are grappling with the dilemma of how to police claims about new COVID-19 vaccines that are as yet unreleased", "transed": 1, "url": "https://www.reuters.com/article/us-health-coronavirus-facebook-insight/facebooks-dilemma-how-to-police-claims-about-unproven-covid-19-vaccines-idUSKCN2530I8", "via": "", "real_tags": ["facebook", "发布", "新冠", "claims", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "1ed0b971a6b2bcbc0bb7b035c85610b3.jpg", "infoid": 1016918, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2016年，里卡多·洛里(Ricardo Lori)是Talkspace的狂热用户-这是一款应用程序，可以让人们全天与有执照的治疗师发短信和聊天。洛里是纽约市的一名兼职演员，他一直在与抑郁和焦虑作斗争，他认为这款应用帮助他摆脱了一段虐待的关系。他相信Talkspace宣称的使命，即“让所有人都能获得并负担得起治疗”，当这家初创公司为他提供客户支持部门的一份工作时，洛里欣喜若狂。\nTalkspace已经从投资者那里筹集了超过1亿美元，它在曼哈顿中城的老Studio 54大楼有一间办公室，提供所有常见的福利-会议室里有一张乒乓球桌，公司冰箱里有啤酒和葡萄酒，还有员工想要的所有治疗。“我觉得自己处在世界上最好的地方，”洛里说。\n一位名叫琳达·萨科(Linda Sacco)的高管在公司博客上对自己的治疗过程进行了概述后，向洛里先生提出了一个私下的要求。她想给员工一种典型用户体验的感觉。她可以和公司的联合创始人之一罗尼·弗兰克(Roni Frank)通读他两周的治疗聊天日志，然后与员工分享其中的摘录吗？\n洛里考虑了他的治疗过程，其中包括关于他的性生活和不安全感的深刻的个人信息。萨科向洛里保证，他们不会让他透露姓名。“如果我不是一个真正的信徒，我可能会说，‘你疯了吗？’但我太喜欢这个地方了，“洛里先生说。他同意了。\n2016年12月的一个周五下午，在一次全体员工会议上，员工们聚集在13楼的一间会议室里。乒乓球桌被折叠起来，这样萨科和弗兰克就可以盘腿坐在地板上，进行戏剧性的朗读。萨科扮演的是治疗师；弗兰克扮演的是女性版的洛里先生。\n当洛里先生喝着一大杯红酒看着的时候，他注意到有几个员工一直朝他这边看。之后，营销部的一名成员走过来，问他是否还好。随后，弗兰克的丈夫、首席执行官奥伦·弗兰克(Oren Frank)在电梯里向他表示感谢。不知何故，有传言说洛里先生是重演的客户。\n洛里开始重新考虑Talkspace是否是他想象中的梦寐以求的雇主，以及Talkspace是否值得信赖，以保护其用户的隐私。\n“所有的事情都是在员工知情同意的情况下进行的，”萨科说，她现在已经不在Talkspace工作了。Talkspace的律师约翰·赖利(John Reilly)说：“当时，这名员工对他们与治疗师进行的Talkspace治疗表示非常自豪，并心甘情愿地告诉多名同事，这份成绩单是他们的。”洛里说，他是在清楚自己的身份广为人知后才这么做的。\n尽管发生了令人尴尬的事件，洛里还是在公司又呆了两年，直到2018年被解雇。他起诉Talkspace歧视和非法解雇，声称他被告知他的焦虑和抑郁干扰了他的工作。这起诉讼于2020年初达成和解。洛里要求公司删除他的博客帖子，但公司没有这样做，这也是洛里决定与记者分享他的故事的部分原因。\n洛里和其他前Talkspace员工(由于担心被起诉而要求不具名)描述了一家雄心勃勃的公司，希望将治疗合法化--但他们表示，该公司的营销做法存在问题，并将治疗成绩单视为另一种有待挖掘的数据资源。他们的说法表明，风险投资支持的初创企业快速成长的需求有时可能与专业治疗的核心价值相冲突，包括严格的保密和患者福利。\n今年，随着大流行、经济衰退和一场让美国人神经崩溃的选举，这些担忧与更多的人相关：今年5月，Talkspace告诉“华盛顿邮报”(The Washington Post)，其客户群自2月中旬以来跃升了65%。\n加州大学伯克利分校(University of California，Berkeley)英语系讲师汉娜·泽文(Hannah Zeavin)说，“心理健康护理的应用确实存在问题。”她所著的关于远程治疗的书计划明年由麻省理工学院出版社(MIT Press)出版。“这些首先是企业平台。其次，他们提供治疗。“。\nTalkspace的首席医疗官尼尔·莱博维茨(Neil Leibowitz)说：“Talkspace通过与患者就近见面，使治疗更容易负担得起，从而实现了治疗和精神病学的民主化。”“这种需求是深刻的，特别是在这个不安的时刻，我们为我们的治疗师团队所取得的成就感到非常自豪。”\n注册Talkspace很快。用户创建账户，填写调查问卷，并选择治疗师，他们以独立承包商的身份为平台工作。那些注册了“无限信息治疗加”计划的人，每月260美元，可以随时向治疗师发送信息，并承诺每天都会有回复。价格较高的订阅层提供30分钟的“实时会话”。虽然用户可以通过文本、音频和视频发送消息，但Talkspace通常被认为是一个短信平台。\n这家公司是由奥伦和罗尼·弗兰克夫妇于2011年创立的，他们是一对以色列夫妇，在他们的关系被婚姻咨询“拯救”后，他们感到受到了鼓舞。弗兰克先生有市场营销背景，而弗兰克女士是一名软件开发人员。\n弗兰克是该公司临床服务的负责人；截至8月6日，她的LinkedIn页面显示，她拥有纽约精神分析研究生院(New York Graduate School Of Mental Analysis)的精神分析和心理治疗硕士学位，但她从未完成这个项目。在泰晤士报的询问之后，学位申请被删除了。赖利先生说，弗兰克女士“攻读了硕士学位，但在完成之前就离开了她的项目，创办了Talkspace。她在LinkedIn上的个人资料是在她学习的时候创建的，当《纽约时报》让我们注意到这一点时，这个疏忽的错误很快就被纠正了。\n这款应用于2014年发布，媒体积极报道，但客户评论不温不火，根据泰晤士报的一项分析，谷歌和苹果应用商店的评分约为三星(满分5星)。用户抱怨软件故障和治疗师反应迟钝。\n据四名前员工称，在2015年和2016年，该公司寻求提高评级：它要求工人写积极的评价。一名员工说，Talkspace当时的营销主管要求他在谷歌电子表格中汇编100条虚假评论，这样员工就可以将它们提交到应用商店。\n洛里说，Talkspace给员工提供了“一次性”手机，以帮助规避应用商店检测虚假评论的技术。“他们说，‘不要在这里做。在家里做吧。给我们五星级评级，因为我们有太多差评了，‘“洛里说。\nTalkspace的律师赖利驳斥了这一说法，称员工可以自由地以任何他们喜欢的方式撰写评论。赖利在一份电子邮件声明中说，“我们提醒员工，如果他们要离开审查，请用他们的个人手机--而不是Talkspace办公网络，因为那样会导致应用商店出现问题。”“需要澄清的是：我们从未使用过假身份或鼓励任何人这样做；没有涉及‘一次性’手机的活动，相对于大量未完成的评论，这个想法本身就是无稽之谈。”\n洛里先生仍然保留着Talkspace送给他的iPhone4。在背面，有一个白色的贴纸，上面写着“#7 App Store登录”，以及一个雅虎电子邮件地址和密码。另外两名前员工表示，工人们可以使用一次性手机。\n“虚假评论对消费者具有欺骗性，”圣克拉拉大学高科技法律研究所联席主任埃里克·戈德曼(Eric Goldman)说。戈德曼说，如果Talkspace的员工在离开评论时没有披露他们的角色，“那么公司鼓励的评论在多个法律方面都是有问题的。”\n发布虚假的在线评论被认为是一种欺骗性的商业行为，可能违反反虚假广告的法律。纽约州总检察长和联邦贸易委员会(Federal Trade Commission)已经对发布此类审查的公司处以罚款，尽管后果也可能不那么严重。在联邦贸易委员会指控化妆品品牌SUNDAY Riley发布虚假评论后，它只是让该公司同意不再这样做。\n谷歌和苹果禁止开发者征集欺诈性评论。苹果公司表示，违规者可能会从App Store中删除他们的应用程序。\nTalkspace还抓住了全国焦虑的时刻作为提升的机会。2016年11月9日，也就是唐纳德·特朗普(Donald Trump)当选后的第二天早上，弗兰克在Twitter上写道：“纽约市漫漫长夜。今早醒来就录得销售记录。“。该公司告诉记者，用户蜂拥至该应用程序来帮助处理新闻。CNBC和“华盛顿邮报”发表了关于Talkspace“流量激增7倍”的报道，弗兰克先生分享了一个“Fast Company”链接，声称“销量激增7倍”。\n根据App Annie和Sensor Tower两家应用程序分析公司的数据，Talkspace的下载量在选举后的几个月里有所下降。“纽约时报”分析了3600多条关于Talkspace应用的评论。2016年大选后，无论是正面还是负面的审查数量都没有大幅增加。\nTalkspace的首席医疗官莱博维茨博士于2018年加入该公司，他在一封电子邮件中说：“我们看到选举后使用量有所上升，正如文章提到的那样，来自担心选举结果的现有客户的流量有所上升。”App Analytics未能捕捉到一些元素：我们的大部分流量都在网络上。\n特朗普的竞选推文是弗兰克和Talkspace在社交媒体上有时未经过滤的存在的例子--这种不敬在初创企业中很常见，但在致力于精神卫生保健的组织中却很少见。\n2016年，一位名叫罗斯的男子在推特上抱怨称，该公司的地铁广告“旨在激发你需要他们的服务。”Talkspace的官方推特账号回应说，“食物广告会让人饿，对吧？”并补充说，“我明白你的意思，罗斯，但是医疗专业人士需要有人来买东西。”该公司后来删除了这些信息，并屏蔽了这名男子。(罗斯在一篇中等水平的帖子中写到了这次交流；当时报最近要求置评时，他删除了这篇帖子，并以个人原因要求不透露自己的全名。)。\n弗兰克在自己的Twitter账户上称这名男子是“可爱的无聊巨魔”，并嘲笑他每年在治疗上花费2万美元，称Talkspace可以提供“一个更实惠的选择”。该公司拒绝对这一事件发表评论。\n治疗会议本质上是非常敏感的--它们旨在成为一个神圣不可侵犯的空间，让人们坦诚他们的秘密，分享他们最深的弱点。\nTalkspace的网站向用户承诺，他们的对话将是“安全和保密的”，但人们可能不会像他们想象的那样对他们的数据进行控制。例如，用户不能删除他们的成绩单，因为它们被认为是医疗记录。\nTalkspace的隐私政策规定，“非识别和聚合信息”可用于“更好地设计我们的网站”和“用于研究和趋势分析”。留下的印象是一个超然的、客观的过程。但前雇员和治疗师告诉“泰晤士报”，个人用户的匿名对话经常被审查和挖掘，以获得洞察力。\n纽约的治疗师卡丽莎·布伦南(Karissa Brennan)从2015年到2017年通过Talkspace提供服务，包括向洛里提供服务。她说，在她向一名客户提供了Talkspace以外的治疗资源的链接后，一名公司代表联系了她，说她应该寻求让她的客户留在这款应用程序内。\n“我当时就想，‘你怎么知道是我干的？’”布伦南女士说。“他们说这是私人的，但事实并非如此。”\n该公司表示，只有在算法审查出于某种原因标记出互动的情况下才会发生这种情况-例如，如果治疗师向客户推荐医用大麻。布伦南女士说，就她记忆所及，她发送了一个指向焦虑工作表的链接。\nTalkspace还一直在分析记录，以便开发监控和增强治疗师工作的机器人。在2019年的一次演示中，一名专门研究机器学习的Talkspace工程师表示，这项研究很重要，因为当治疗师只通过短信交流时，可能会错过面对面治疗期间可能捕捉到的客户陷入困境的某些线索。软件或许能更好地捕捉到这些线索。\n去年，弗兰克先生为“纽约时报”写了一篇评论文章，鼓励人们将他们的健康数据提供给研究人员。“我们需要数据。我们所有的数据。我的和你的，“他写道，并争辩说，分析匿名数据集可以改善治疗。\nTalkspace收集的匿名数据不仅仅用于医学进步；它还被用来更好地销售Talkspace的产品。两名前员工表示，该公司的数据科学家与营销团队分享了客户文字记录中的常见短语，以便更好地瞄准潜在客户。\n该公司对此表示异议。赖利说：“我们是一家专注于数据的公司，数据科学和临床领导层将不时与他们的同事分享见解。”“这可以包括评估可以帮助我们改进最佳实践的关键信息。”\n他补充说：“它从来没有，也永远不会被用于营销目的。”\n许多有执照的治疗师与Talkspace签约的原因类似于司机为优步工作的原因。该公司提供稳定的客户流，负责行政任务，并处理一些保险问题。\n“基于文本的治疗的美妙之处在于，我们在客户所在的地方与他们会面，让他们有机会接触到一些不同的东西，”该公司让他接受采访的Talkspace治疗师雷沙夫娜·查普尔(Reshawna Chapple)博士说。“对我来说，这是为了方便。”\n查普尔博士说，“Talkspace允许我把手放进很多不同的罐子里。”他通过Talkspace与30名客户交流，亲自治疗15名客户，目前在佛罗里达大学担任全职教授。她还与Talkspace签订了一份合同，为其他治疗师提供建议。\n根据该公司的说法，在该平台上工作的大约3000名治疗师根据他们写给用户的字数或通过视频或音频交谈的频率，根据他们写给用户的字数或通过视频或音频交谈的频率，通过“参与度”获得报酬，并获得留住客户的奖金。\n根据多位治疗师的说法，Talkspace特别关注他们与在谷歌、克罗格和捷蓝航空等公司工作的客户的互动，这些“企业合作伙伴”为员工提供Talkspace作为一种福利。(“纽约时报”向员工提供Talkspace是一种福利。)。\n一位通过Talkspace提供治疗两年的大学教授说，当公司认为谷歌的两个客户等待回复的时间太长时，公司联系了她。\n首席医疗官莱博维茨博士说：“像所有企业一样，我们根据规模和范围来关注客户。”\n去年，Talkspace引入了一项新功能：用户可以在发送要求治疗师在一定时间范围内做出回应的消息后按下按钮。如果治疗师没有及时回应，他们的工资可能会被扣掉。\n平台上的一些治疗师感到震惊，部分原因是该功能要求他们按需工作，而不是按照自己的时间表工作。更重要的是，他们问道：给有焦虑和边界问题的客户一个按钮，让他们立即得到满足，这有害吗？\n“这是一种企业模式：不管发生什么，你都需要对顾客做出回应，”莎拉·桑德(Shara Sand)说，她是一名心理学家，在纽约有自己的诊所。“设限和设限是治疗的一部分。如果你不能做到四个小时不和你的治疗师交谈，你病得很重，需要比短信应用程序更高水平的护理。“。\nTalkspace被宣传为无限制的“全天候”信息疗法。该公司表示：“你的治疗师会全天看到你的信息并回复你。”治疗师得到了不同的建议：“设定你的营业时间，每天检查你的客户，每周五天。”\n该公司表示，这两条信息并不冲突。“我不认为这是期望上的差异，”Talkspace的执业治疗师雷切尔·奥尼尔(Rachel O‘Neill)说，他的头衔是临床有效性主任。“这不是全天候的治疗，而是全天候的沟通能力。”\n一些传统的心理健康专业人士对这种自由流动的模式提出了质疑，他们说，治疗的好处来自定期、有计划的检查-有明确的开始和结束，有助于标志进展。\n“这在精神分析中被称为‘框架’。是房间的问题。这是会议将持续多长时间的问题。要花多少钱？“伯克利分校的齐文女士说。“界限对于治疗的历史来说真的很重要。如果短信被等同于没有边界，那就是一个真正的问题。“。\n关于远程治疗有多有效的研究一直很有限。其中大部分要么是由Talkspace自己进行的，要么是通过视频会议进行的，而不仅仅是文本治疗。\n莱博维茨博士说：“Talkspace的首要任务是为患者提供高质量的护理，并推动患者期望的临床结果。”“Talkspace已经与许多顶尖的学术大学合作进行了研究，”他说，并补充说，这项工作已经产生了“10篇在同行评议期刊上经过审查的论文”。\n林恩·布夫卡(Lynn Bufka)是美国心理协会(American mental ological Association，简称APA)负责实践转型和质量的高级主管，他说，关于基于文本的治疗的研究一直基于人们是否满意的调查。\n布夫卡博士说：“关于这是否对临床有好处的研究要少得多。”“我们会对依赖文本治疗提出警告，特别是当症状更严重的时候。我们会敦促人们寻求直接治疗，目前是通过电话或视频。“。\n2018年，名为心理治疗行动网络(Mental Treatation Action Network)的治疗师倡导团体给美国儿科学会和奥运会选手迈克尔·菲尔普斯写了一封信。菲尔普斯曾出现在Talkspace的广告中，称该公司是一个“有问题的治疗提供者，积极销售未经测试的高风险疗法”。收到这封信后，美国医学会改变了对治疗技术广告的政策，停止让Talkspace在会议上展示。\n2019年，在Talkspace与医疗巨头UnitedHealth旗下的Optum签署了一项协议，为其200万客户提供远程治疗后，该倡导组织又给美联社写了一封“警告信”。Talkspace起诉该组织诽谤，要求赔偿4000万美元。由于司法原因，这起诉讼被驳回。\n“也许他们的产品和服务对某些人有帮助，”心理治疗行动网络的创始人之一琳达·迈克尔斯(Linda Michaels)说。“但这不是治疗。”\n直到2018年，Talkspace的用户协议都说了同样的话：“本网站不提供治疗。它提供与有执照的治疗师进行治疗对话。“。自那以后，该公司删除了这一条款。\n“那是非常古老的，”莱博维茨博士说。“该公司已经有了相当大的发展。”\n洛里不再使用Talkspace应用程序。但他仍然在看他最初通过这个平台认识的治疗师布伦南女士。\n他说：“即使是通过这家有毒的公司，美好的事情也可能会发生。”“总体而言，这是一个令人悲哀的故事，公司本来可以是什么样子，现在是什么样子。”", "note_en": "In 2016, Ricardo Lori was an avid user of Talkspace — an app that lets people text and chat with a licensed therapist throughout the day. A part-time actor in New York City, Mr. Lori struggled with depression and anxiety, and he credited the app with helping him get out of an abusive relationship. He was a believer in Talkspace’s stated mission to make “ therapy available and affordable for all,” and when the start-up offered him a job in its customer support department, Mr. Lori was ecstatic.\n Talkspace, which has raised more than $100 million from investors, had an office in the old  Studio 54 building in midtown Manhattan, with all the usual perks — a Ping-Pong table in the conference room and beer and wine in the company fridge, plus all the therapy employees wanted. “I felt like I was at the best place in the world,” Mr. Lori said.\n After he  wrote a general account of his therapy sessions on the company blog, an executive named Linda Sacco came to Mr. Lori with an intimate request. She wanted to give employees a sense of a typical user’s experience. Could she and one of the company’s co-founders, Roni Frank, read through two weeks of his therapy chat logs and then share excerpts with the staff?\n Mr. Lori thought about his sessions, which included deeply personal information about his sex life and insecurities. Ms. Sacco assured Mr. Lori that they would keep him anonymous. “If I wasn’t such a true believer, I probably would have said, ‘Are you nuts?’ But I was so enamored of the place,” said Mr. Lori. He agreed.\n  At an all-hands meeting on a Friday afternoon in December 2016, employees gathered in a 13th-floor conference room. The Ping-Pong table was folded up so that Ms. Sacco and Ms. Frank could sit on the floor, cross-legged and back-to-back, for a dramatic reading. Ms. Sacco played the role of the therapist; Ms. Frank played a female version of Mr. Lori.\n As Mr. Lori drank a tall glass of red wine and watched, he noticed that a few employees kept glancing his way. Afterward, a member of the marketing department approached and asked if he was OK. Later, Oren Frank, Ms. Frank’s husband and the chief executive officer, thanked him in the elevator. Somehow, word had gotten around that Mr. Lori was the client in the re-enactment.\n Mr. Lori began to reconsider whether Talkspace was the dream employer he’d imagined — and whether it could be trusted to protect the privacy of its users.\n “Everything was done with employee-informed consent,” said Ms. Sacco, who no longer works at Talkspace. John Reilly, a lawyer for Talkspace, said, “At the time, the employee expressed great pride over their Talkspace treatment with their therapist, and willingly told multiple co-workers that the transcript was theirs.” Mr. Lori said he did so only after it became clear that his identity was widely known.\n  Despite the embarrassing episode, Mr. Lori stayed with the company for two more years, until he was let go in 2018. He sued Talkspace for discrimination and wrongful termination, claiming he was told that his anxiety and depression were interfering with his work. The lawsuit settled at the beginning of 2020. Mr. Lori asked the company to take down his blog post; the company didn’t, which is part of why Mr. Lori decided to share his story with a reporter.\n Mr. Lori and other former Talkspace employees, who asked not to be named for fear of being sued, describe a company with an admirable ambition to destigmatize therapy — but that they say has questionable marketing practices and regards treatment transcripts as another data resource to be mined. Their accounts suggest that the needs of a venture capital-backed start-up to grow quickly can sometimes be in conflict with the core values of professional therapy, including strict confidentiality and patient welfare.\n This year, with a pandemic, a recession and an election shredding Americans’ nerves, those concerns are relevant to more people than ever before: In May, Talkspace told The Washington Post that its client base had  jumped 65 percent since mid-February.\n “The app-ification of mental health care has real problems,” said Hannah Zeavin, a lecturer in the English department at the University of California, Berkeley whose book about teletherapy is scheduled to be published next year by MIT Press. “These are corporate platforms first. And they offer therapy second.”\n “Talkspace has democratized access to therapy and psychiatry by meeting patients where they are in their lives and making treatment more affordable,” said Neil Leibowitz, Talkspace’s chief medical officer. “The need is profound, especially now in this time of unease, and we are so proud of what our team of therapists is achieving.”\n  Signing up with Talkspace is quick. Users create an account, fill out a questionnaire, and get a choice of therapists, who work for the platform as  independent contractors. Those who sign up for the “Unlimited Messaging Therapy Plus” plan, at $260 a month, can send a therapist messages at any time and are promised daily responses. Higher-priced subscription tiers offer “live sessions” of 30 minutes. While users can send messages by text, audio and video, Talkspace is known popularly as a platform for texting.\n The company was founded in 2011 by Oren and Roni Frank, an Israeli couple who felt inspired after their relationship was “ saved” by marriage counseling. Mr. Frank had a background in marketing, and Ms. Frank was a software developer.\n Ms. Frank is the company’s head of clinical services; as of Aug. 6, her LinkedIn page said she had a master’s degree in psychoanalysis and psychotherapy from the New York Graduate School of Psychoanalysis, but she never completed the program. The degree claim was deleted after an inquiry from The Times. Mr. Reilly said Ms. Frank “studied for an M.A. but left her program before completion to launch Talkspace. Her LinkedIn profile was created while she was studying, the inadvertent error was corrected as soon as the NYT brought this to our attention.”\n The app launched in 2014 to  positive press but lukewarm customer reviews, with ratings of about three stars out of five on both the Google and Apple app stores, according to a Times analysis. Users complained about glitchy software and unresponsive therapists.\n In 2015 and 2016, according to four former employees, the company sought to improve its ratings: It asked workers to write positive reviews. One employee said that Talkspace’s head of marketing at the time asked him to compile 100 fake reviews in a Google spreadsheet, so that employees could submit them to app stores.\n Mr. Lori said that Talkspace gave employees “burner” phones to help evade the app stores’ techniques for detecting false reviews. “They said, ‘Don’t do it here. Do it at home. Give us five-star ratings because we have too many bad reviews,’” Mr. Lori said.\n Mr. Reilly, the Talkspace lawyer, disputed this account, saying that employees were free to write reviews any way they liked. “We alerted employees if they were to leave a review, to do it from their personal phones — not from the Talkspace office network, as that would cause issues with the app store,” Mr. Reilly said in an emailed statement. “To be clear: We have never used fake identities or encouraged anybody to do so; there is no event involving ‘burner’ phones, and the idea in and of itself is nonsensical relative to the large number of reviews outstanding.”\n  Mr. Lori still has the iPhone 4 that Talkspace gave him. On the back, there is a white sticker on which someone has written “#7 App Store login,” along with a Yahoo email address and password. Two other former employees said burner phones were made available to workers.\n “Fake reviews are deceptive to consumers,” said Eric Goldman, co-director of the High Tech Law Institute at Santa Clara University. If the Talkspace employees didn’t disclose their role when leaving reviews, “then the company-encouraged reviews are problematic on multiple legal fronts,” Mr. Goldman said.\n Posting fake online reviews is considered a deceptive business practice and can violate laws against false advertising. The  New York attorney general and the  Federal Trade Commission have fined companies for posting such reviews, though consequences can also be less severe. After the F.T.C. accused the cosmetics brand Sunday Riley of posting fake reviews, it simply  made the company agree not to do so again.\n Google and Apple forbid developers from soliciting fraudulent reviews. Apple  says violators may have their apps removed from the App Store.\n  Talkspace has also seized on moments of national anxiety as opportunities for promotion. On Nov. 9, 2016, the morning after the election of Donald Trump, Mr. Frank  wrote on Twitter: “Long night in NYC. Woke up this morning to record sales.” The company told reporters that users were flocking to the app to help process the news. CNBC and  The Washington Post published stories about Talkspace’s “ 7-fold spike in traffic,” and Mr. Frank  shared a Fast Company link claiming a “7x spike in sales.”\n  According to data from two app analytics firms, App Annie and Sensor Tower, the number of Talkspace downloads declined in the months after the election. The Times analyzed more than 3,600 reviews of the Talkspace app. There was no significant increase in the number of reviews, positive or negative, following the 2016 election.\n Dr. Leibowitz, Talkspace’s chief medical officer, who joined the company in 2018, said in an email: “We saw an uptick in use after the election, including, as the piece mentions, an uptick in traffic from existing clients concerned about election results. App analytics fail to capture a few elements: Much of our traffic is on the web.”\n The Trump election tweets are examples of the sometimes unfiltered social media presence of Mr. Frank and Talkspace — an irreverence familiar among start-ups but unusual among organizations devoted to mental health care.\n In 2016, a man named Ross complained on Twitter that the company’s subway ads “were designed to trigger you into needing their services.” Talkspace’s official Twitter account responded, “Ads for food make people hungry, right?” and added, “I get what you’re saying, Ross, but medical professionals need people to buy things.” The company later deleted the messages and blocked the man. (Ross wrote about the exchange in a Medium post; when The Times asked for comment recently, he deleted it and asked that his full name be withheld, citing personal reasons.)\n From his own Twitter account, Mr. Frank called the man a “sweet bored troll” and mocked him for spending $20,000 a year on therapy, saying Talkspace could offer “a more affordable alternative.” The company declined to comment about the episode.\n  Therapy sessions are incredibly sensitive by their nature — they are intended to be a sacrosanct space for people to confess their secrets and share their deepest vulnerabilities.\n Talkspace’s website promises users that their conversations will be “safe and confidential,” but people may not have as much control as they might think over what happens to their data. Users  can’t delete their transcripts, for example, because they are considered medical records.\n Talkspace’s  privacy policy states that “non-identifying and aggregate information” may be used “to better design our website” and “in research and trend analysis.” The impression left is a detached and impersonal process. But former employees and therapists told The Times that individual users’ anonymized conversations were routinely reviewed and mined for insights.\n Karissa Brennan, a New York-based therapist, provided services via Talkspace from 2015 to 2017, including to Mr. Lori. She said that after she provided a client with links to therapy resources outside of Talkspace, a company representative contacted her, saying she should seek to keep her clients inside the app.\n “I was like, ‘How do you know I did that?’” Ms. Brennan said. “They said it was private, but it wasn’t.”\n The company says this would only happen if an algorithmic review flagged the interaction for some reason — for example, if the therapist recommended medical marijuana to a client. Ms. Brennan says that to the best of her recollection, she had sent a link to an anxiety worksheet.\n Talkspace also has been analyzing transcripts in order to develop  bots that monitor and augment therapists’ work. During a presentation in 2019, a Talkspace engineer specializing in machine learning  said the research was important because certain cues that a client is in distress that could be caught during in-person sessions might be missed when a therapist is only communicating by text. Software might better catch those cues.\n Last year, Mr. Frank wrote  an opinion article for The Times encouraging people to make their health data available to researchers. “We need data. All of our data. Mine and yours,” he wrote, arguing that analysis of anonymous data sets could improve treatment.\n The anonymous data Talkspace collects is not used just for medical advancements; it’s used to better sell Talkspace’s product. Two former employees said the company’s data scientists shared common phrases from clients’ transcripts with the marketing team so that it could better target potential customers.\n The company disputes this. “We are a data-focused company, and data science and clinical leadership will from time to time share insights with their colleagues,” Mr. Reilly said. “This can include evaluating critical information that can help us improve best practices.”\n He added: “It never has and never will be used for marketing purposes.”\n  Many licensed therapists sign up with Talkspace for reasons similar to why drivers work for Uber. The company provides a steady stream of clients, takes care of administrative tasks and deals with some insurance issues.\n “The beauty of text-based therapy is we are meeting clients where they are, and giving them access to something different,” said Dr. Reshawna Chapple, a Talkspace therapist whom the company made available for an interview. “It’s about convenience for me.”\n “The thing that Talkspace allows me to do is to put my hands in a lot of different pots,” said Dr. Chapple, who communicates with 30 clients via Talkspace, treats 15 in person, and works as a full-time professor at the University of Florida. She also has a contract with Talkspace to advise other therapists.\n The approximately 3,000 therapists who work on the platform are paid by “engagement,” according to the company, based on the number of words they write to users or how often they talk by video or audio, with bonuses for client retention.\n According to multiple therapists, Talkspace paid special attention to their interactions with clients who worked at places like Google, Kroger and JetBlue — “enterprise partners” that provide Talkspace to employees as a perk. (The New York Times offers Talkspace to its workers as a benefit.)\n A college professor who provided therapy via Talkspace for two years said the company reached out to her when it thought two clients from Google had been waiting too long for a response.\n “Like all businesses, we focus on clients based on size and scope,” said Dr. Leibowitz, the chief medical officer.\n Last year, Talkspace introduced a new feature: a  button that users could press after sending a message that required the therapist to respond within a certain time frame. If the therapists don’t respond in time, their pay can be docked.\n Some therapists on the platform were alarmed, in part because the function required them to work on demand, rather than on their own schedule. More significantly, they asked: Is it harmful to give clients with anxiety and boundary issues a button to press for immediate gratification?\n “That’s a corporate model: You need to respond to the customer no matter what,” said Shara Sand, a psychologist with her own practice in New York. “Limit-setting and boundary-setting is part of the therapy. If you can’t manage not to talk to your therapist for four hours, you are very ill and need a higher level of care than a texting app.”\n  Talkspace is advertised to users as unlimited, “24/7” messaging therapy. “Your therapist will see your messages and respond to you throughout the day,” the company  says. Therapists  get a different pitch: “Set your business hours, and check in on your clients daily, five days per week.”\n The company says the two messages are not in conflict. “I don’t think it’s a discrepancy in expectations,” said Rachel O’Neill, a licensed therapist at Talkspace whose title is director of clinical effectiveness. “It’s not 24/7 therapy, it’s 24/7 ability to communicate.”\n Some traditional mental health professionals question the free-flowing format, saying that the benefits of therapy stem from regular, scheduled check-ins — sessions with clear beginnings and endings that help mark progress.\n “It’s called the ‘frame’ in psychoanalysis. It’s the room. It’s how long the session will last. How much it will cost,” said Berkeley’s Ms. Zeavin. “Boundaries are really important to the history of therapy. If texting is equated with no boundaries, that’s a real problem.”\n There has been  limited study into how effective teletherapy is. Much of it either has been conducted by  Talkspace itself or has involved therapy via  video sessions, not just text.\n “Talkspace’s No. 1 priority is quality of care for patients and driving the clinical outcomes desired by patients,” said Dr. Leibowitz. “Talkspace has conducted research in partnership with many of the top academic universities,” he said, adding that the work has yielded “10 vetted papers in peer-reviewed journals.”\n Lynn Bufka, the senior director for practice transformation and quality at the American Psychological Association, or A.P.A., said the research on text-based therapy has been based on surveys of whether people find it satisfactory.\n “There’s been much less research into whether there’s a clinical benefit,” Dr. Bufka said. “We would offer cautions around relying on text therapy, particularly when there is greater severity in terms of symptoms. We would urge people to seek direct care, which at this time would be by phone or video.”\n In 2018, a therapists advocacy group called the Psychotherapy Action Network wrote a letter to the A.P.A. and to the Olympian Michael Phelps, who has appeared in ads for Talkspace, calling the company a “problematic treatment provider who aggressively sells an untested, risky treatment.” After receiving the letter, the A.P.A. changed its  policy on therapy-tech ads and stopped letting Talkspace exhibit at conferences.\n  In 2019, after Talkspace signed a deal with Optum, a unit of the health care giant UnitedHealth, to provide teletherapy to its two million customers, the advocacy group wrote another  letter of “alarm” to the A.P.A. Talkspace  sued the group for defamation, claiming damages of $40 million. The lawsuit was dismissed for jurisdictional reasons.\n “Maybe their products and services are helpful to certain people,” said Linda Michaels, a founder of the Psychotherapy Action Network. “But it’s just not therapy.”\n Until 2018, the  Talkspace user agreement said the same thing: “This Site Does Not Provide Therapy. It provides Therapeutic conversation with a licensed therapist.” The company has since removed the clause.\n “That is very old,” said Dr. Leibowitz. “The company has evolved quite a bit.”\n Mr. Lori no longer uses the Talkspace app. But he is still seeing the therapist, Ms. Brennan, whom he originally met via the platform.\n “Even through this toxic company, wonderful things can happen,” he said. “It’s such a sad story in totality, of what the company could have been versus what it is.”", "posttime": "2020-08-08 02:37:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,应用,app,talkspace", "title": "短信治疗应用Talkspace的前员工表示，该公司提供一次性手机来撰写虚假的应用评论，没有充分尊重客户隐私", "title_en": "Former staff at therapy-by-text app Talkspace say the company provided burner phones to write fake app reviews and doesn't adequately respect client privacy", "transed": 1, "url": "https://www.nytimes.com/2020/08/07/technology/talkspace.html", "via": "", "real_tags": ["手机", "应用", "app", "talkspace"]}, {"category": "", "categoryclass": "", "imagename": "906cb609254f9015051d9e0de49e059a.jpg", "infoid": 1016916, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "东芝自1985年以来一直在制造笔记本电脑，并声称是第一个以现在熟悉的翻盖外形规格制造大众市场电脑的公司。到20世纪90年代，该公司开始在卫星范围内生产坚固的主力设备，并开始利用小巧轻便的Portégé范围实现有意义的移动工作。\n这些产品让东芝在20世纪90年代末一直占据世界笔记本电脑市场份额的领先地位，并在21世纪头10年的大部分时间里保持着这一地位。即使个人电脑市场在那十年里巩固了下来，东芝也经常跻身于所有个人电脑供应商的前五名之列，尽管东芝只涉足过台式机。\n随着本世纪头十年的推进，东芝的设备与一直令人印象深刻的ThinkPad和MacBook Air相比变得平淡无奇，而戴尔和惠普也有所改善。东芝也从未真正尝试过激发消费者的想象力，这无助于增长。\n随着个人电脑市场萎缩，联想(Lenovo)、戴尔(Dell)和惠普(HP)在2010年代主导个人电脑销售，东芝(Toshiba)刚刚成为一个不太可能被列入笔记本电脑采购名单的品牌。\n到了2018年，该公司看到了不祥之兆，并以极低的价格将其个人电脑业务部门出售给了夏普(仅3600万美元易手)，但保留了该公司19.9%的股份，并有权购买夏普持有的股票。\n夏普很快将业务更名为“Dynawaok”，这是东芝在日本使用的产品名称，并着手发布新机型和重振品牌。而且它做得相当好，正如我们最近对新的PortégéX30L-G进行的审查所显示的那样。\n这就把我们带到了2020年6月30日，当时夏普行使了选择权，收购了它尚未拥有的19.9%的Dynabok股份。周二，东芝转让了这些股份，并于周四宣布了这笔交易。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "Toshiba has made laptops since 1985 and claims to have been the first to make a mass-market computer in the now-familiar clamshell form factor. By the 1990s the company was producing solid workhorses in the Satellite range and started to make meaningful stretches of mobile work possible with the small, thin and light Portégé range.\n  Those products saw Toshiba lead the world for laptop market share through the late 1990s and retain that position for much of the 2000s. Even as the PC market consolidated in that decade, Toshiba was often ranked among the top five of all PC vendors despite only ever dabbling in desktops.\n  As the 2000s rolled along Toshiba devices became bland in comparison to the always-impressive ThinkPad and the MacBook Air, while Dell and HP also improved. Toshiba also never really tried to capture consumers’ imaginations, which didn&#39;t help growth.\n  As the PC market contracted and Lenovo, Dell and HP came to dominate PC sales in the 2010s, Toshiba just became a less likely brand to put on a laptop shopping list.\n    By 2018 the company saw the writing on the wall and sold its PC business unit to Sharp for a pittance – just $36m changed hands - but retained a 19.9 percent share of the company with an option in Sharp’s favour to buy that stock.\n  Sharp quickly renamed the business to “Dynabook”, a product name Toshiba had used in Japan, and set about releasing new models and reviving the brand. And it’s done rather well, as shown in our  recent review of the new Portégé X30L-G.\n  Which brings us to June 30th, 2020, when Sharp exercised its option to acquire the 19.9 percent of Dynabook shares it did not already own. On Tuesday, Toshiba transferred those shares and announced the transaction on Thursday.\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-08-08 02:36:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,笔记本电脑,formally,东芝", "title": "东芝正式并最终退出笔记本电脑业务", "title_en": "Toshiba formally and finally exits laptop business", "transed": 1, "url": "https://www.theregister.com/2020/08/07/toshiba_sells_last_dynabook_shares/", "via": "", "real_tags": ["电脑", "笔记本电脑", "formally", "东芝"]}, {"category": "", "categoryclass": "", "imagename": "d1edc1e8272a823d1870b3fa662d1a2f.jpg", "infoid": 1016915, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专业提示：我们8月份的网络研讨会系列只对参加Disrupt2020的人开放。不要错过-现在就购买一个颠覆性的数字创业通道套餐，并获得所有三个独家网络研讨会的入场券。然后，准备好向数以千计的全球Disrupt2020与会者介绍您的初创公司。谈到机会敲门。\n媒体的报道可以决定一家初创公司的成败，特别是在初创阶段。以简洁、引人入胜的方式分享你的创业故事-旅程、能力和优势-吸引了媒体的兴趣。而积极的媒体报道会吸引潜在的客户和投资者，从而推动您的业务向前发展。\n尽管如此，没有人生来就知道这项基本技能--需要时间和实践才能培养出来。在如何与科技媒体交流方面，没有人比科技媒体给出更好的建议。加入TechCrunch的撰稿人和编辑Greg Kumparak、Anthony Ha和Ingrid Lunden的行列，在与媒体交谈时，他们可以透露提示和最佳实践。\n你会拿出可行的步骤，尽可能最好地展示你自己和你的创业公司。当您在数字创业通道中展示时，这将派上用场。来自世界各地的数百名科技记者将在那里寻找可以讲述的精彩故事。给他们一些值得写的东西。\n别忘了--这只是三个网络研讨会中的第一个，这些研讨会致力于帮助数字创业巷的参展商在Disrupt展会上抓住每一丝机会。请务必将这两个网络研讨会添加到您的日历中：\n8月19日-新冠肺炎对初创企业世界的影响，小组成员有纳斯达克创业中心执行董事尼古拉·科尔津和PitchBook风险投资分析师卡梅隆·斯坦菲尔。\n8月26日-与Cleo Capital的Sarah Kunst和First round Capital的Brett Berson的小组成员一起筹款和招聘最佳实践。\n在数字创业巷展出，让你向全球观众展示你令人难以置信的创业。购买一个颠覆数字创业巷套餐，参加8月12日三场独家网络研讨会中的第一场，轻松与媒体交谈，学习如何尽可能地给人留下最好的印象。\n贵公司是否有兴趣赞助或参展Disrupt2020？请填写此表格与我们的赞助销售团队联系。", "note_en": "Pro tip: Our August webinar series is open only to folks exhibiting at Disrupt 2020. Don’t miss out —  buy a Disrupt Digital Startup Alley Package  now and gain entry to all three exclusive webinars. Then get ready to introduce your startup to thousands of global Disrupt 2020 attendees. Talk about opportunity knocking.\n Media coverage can make or break a startup, especially in the early stages. Sharing your startup story — the journey, the capabilities, the benefits — in a concise, compelling way draws media interest. And positive media coverage attracts the potential customers and investors that can drive your business forward.\n  Still, no one’s born knowing this essential skill — it takes time and practice to develop. And no one gives better advice on how to talk to tech media than, well, tech media. Join TechCrunch writers and editors  Greg Kumparak,  Anthony Ha and  Ingrid Lunden as they divulge tips and best practices when it comes to talking with the press.\n You’ll come away with actionable steps to present yourself and your startup in the best possible light. That’ll come in handy while you exhibit in  Digital Startup Alley. Hundreds of tech journalists from around the world will be there searching for great stories to tell. Give them something worth writing about.\n And don’t forget — this is just the first of three webinars devoted to helping  Digital Startup Alley exhibitors wring every ounce of opportunity out of their time at Disrupt. Be sure to add these two webinars to your calendar:\n August 19 —  COVID-19’s Impact on the Startup World with panelists Nicola Corzine, Executive Director of the Nasdaq Entrepreneurship Center, and Cameron Stanfill, a VC analyst at PitchBook.\n August 26 — Fundraising and Hiring Best Practices with panelists Sarah Kunst of Cleo Capital and Brett Berson of First Round Capital.\n Exhibiting in Digital Startup Alley lets you showcase your incredible startup to a global audience. Buy a  Disrupt Digital Startup Alley Package, join the first of three exclusive webinars on August 12th, get comfortable talking to the press and learn how to make the best impression possible.\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? Contact our sponsorship sales team by   filling out this form .", "posttime": "2020-08-08 01:07:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "合作,ts,创业", "title": "\n与媒体合作的注意事项-报名参加", "title_en": "\n\t\t\t\tDo’s and Don’ts of Working with the Press – Sign up to attend\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/dos-and-donts-of-working-with-the-press-sign-up-to-attend/", "via": "", "real_tags": ["合作", "ts", "创业"]}, {"category": "", "categoryclass": "", "imagename": "5117bff6392e28e4d0207c5f282e944d.jpg", "infoid": 1016914, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于巴尔的摩的公司并不是唯一承诺打击恶意广告(例如强迫访问者重定向到另一个网站的广告)的组织。但正如联合创始人Seth Demsey去年告诉我的那样，Clean.io提供了“对谁可以加载JavaScript的细粒度控制”。\n首席执行官马特·吉利斯本周通过电子邮件告诉我，挑战将“永远”演变。\n吉利斯写道：“就像一家反病毒公司需要不断更新自己的定义和改进保护措施一样，我们也需要时刻警惕这样一个事实，即不良行为者会不断试图逃避检测，翻过你摆在他们面前的墙，绕过你的墙。”\n该公司表示，它的技术目前已在700多万个网站上为客户使用，其中包括WarnerMedia的Xandr(前身为AppNexus)、波士顿环球报(The Boston Globe)和Imgur。\nClean.io现在总共筹集了750万美元。A系列由翠贝卡风险投资伙伴公司(Tribeca Venture Partners)牵头，房地产风险投资公司(Real Ventures)、内环资本公司(Internal Loop Capital)和砂石资本伙伴公司(GRIT Capital Partners)。\n吉利斯说，他最初计划在2月底筹款，但由于新冠肺炎的原因，他不得不搁置了这些计划。他最终通过Zoom完成了所有的推销工作(“我在纽约的小公寓中看到了比我应得的份额更多的东西”)，他称赞翠贝卡的奇普·米凯姆(他之前的投资包括AppNexus)是“世界级的合作伙伴”。\n当然，这场流行病对数字广告的影响远远不止暂停了吉利斯的筹款过程。当谈到恶意广告时，他说，随着数字广告成本在3月下旬急剧下降，“糟糕的演员利用了这个机会。”\n“从3月中旬到5月初，我们看到威胁级别持续飙升，”吉利斯继续说。“由于大流行带来的攻击水平增加，对我们的解决方案的需求依然强劲。现在，出版商比以往任何时候都更需要保护他们的用户体验和收入。“", "note_en": "The Baltimore-based company isn’t the only organization promising to fight  malvertising (such as ads that force visitors to redirect to another website). But as  co-founder wrote Seth Demsey told me last year, Clean.io provides “granular control over who gets to load JavaScript.”\n CEO Matt Gillis told me via email this week that the challenge will “always” be evolving.”\n  “Just like an antivirus company needs to constantly be updating their definitions and improving their protections, we always need to be alert to the fact that bad actors will constantly try to evade detection and get over and around the walls that you put in front of them,” Gillis wrote.\n The company says its technology is now used on more than 7 million websites for customers including WarnerMedia’s Xandr (formerly AppNexus), The Boston Globe and Imgur.\n  Clean.io has now raised a total of $7.5 million. The Series A was led by  Tribeca Venture Partners,   with participation from Real Ventures, Inner Loop Capital, and Grit Capital Partners.\n Gillis said he’d initially planned to fundraise at the end of February, but he had to put those plans on hold due to COVID-19. He ended up doing all his pitching via Zoom (“I saw more than my fair share of small NY apartments”) and he praised Tribeca’s Chip Meakem (who previous investments include AppNexus) as “a world class partner.”\n Of course, the pandemic’s impact on digital advertising goes far beyond pausing Gillis’ fundraising process. And when it comes to malicious ads, he said that with the cost of digital advertising declining precipitously in late March, “bad actors capitalized on this opportunity.”\n “We saw a pretty constant surge in threat levels from mid-March until early May,” Gillis continued. “Demand for our solutions have remained strong due to the increased level of attacks brought on by the pandemic. Now more than ever, publisher need to protect their user experience and their revenue.”", "posttime": "2020-08-08 01:07:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,打击,battle", "title": "\nClean.io筹集500万美元继续打击恶意广告技术", "title_en": "\n\t\t\t\tClean.io raises $5M to continue its battle against malicious adtech\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/clean-io-series-a/", "via": "", "real_tags": ["广告", "打击", "battle"]}, {"category": "", "categoryclass": "", "imagename": "052950b9fe952df087d86d75490a7ad3.jpg", "infoid": 1016913, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何时候，一个行业正在转型，都是初创企业资本化的大好时机。这就是为什么我们很高兴Lerer Hippeau的执行合伙人Eric Hippeau和我们一起做客Extra Crunch Live节目。\n这一集将于8月13日美国东部时间下午2点/太平洋时间上午11点播出。观众可以提出自己的问题，但你必须是额外的Crunch会员才能进入聊天。如果您还没有报名，现在就是您的机会！\n埃里克·希佩奥在与人共同创立莱勒·希佩奥之前曾担任赫芬顿邮报的首席执行官。他还曾担任Ziff-Davis的董事长兼首席执行官，Ziff-Davis曾是计算机杂志的顶级出版商。他是BuzzFeed和万豪国际的董事会成员。\nLerer Hippeau投资组合公司包括Axios、BuzzFeed、Genius、Chartbets和Giphy。虽然该公司在媒体方面有经验，但这并不意味着投资组合完全专注于媒体。其他投资组合公司包括Casper、WayUp、Warby Parker、Mirror、HungryRoot、Glossier、Everlan、Brit+Co.和AllBirds，仅举几例。\n作为一名早期投资者，Hippeau知道公司需要做些什么才能引起风投的注意，并将交易带过终点线。我们将与Hippeau讨论一些筹资的注意事项，他对这个流行病世界中诞生的下一代初创公司的期望，以及他最感兴趣的投资领域。\n如前所述，我们鼓励额外的Crunch成员将他们自己的问题带到这次讨论中。有备而来！\nHippeau加入了Extra Crunch Live的全明星嘉宾阵容，包括马克·库班、罗洛夫·博塔、柯尔斯滕·格林、艾琳·李和查尔斯·哈德森。你可以在这里查看完整的剧集名单。\n详细信息：日期：8月13日(星期四)上午11：00/东部时间下午2：00/格林尼治标准时间下午6：00缩放信息：https://zoom.us/j/92633495658将此活动添加到您的日历中", "note_en": "Anytime an industry is in the midst of a transformation is a great time for startups to capitalize. That’s why we’re amped to have  Lerer Hippeau’s   Managing Partner  Eric Hippeau   join us for an episode of Extra Crunch Live.\n The episode will air at 2pm ET/11am PT on August 13. Folks in the audience can ask their own questions, but you must be an  Extra Crunch member to access the chat. If you still haven’t signed up,  now’s your chance!\n  Eric Hippeau served as CEO for the Huffington Post before cofounding Lerer Hippeau. HE also served as Chairman and CEO at Ziff-Davis, a former top publisher of computer magazine. He sits on the board of BuzzFeed and Marriott International.\n Lerer Hippeau portfolio companies include Axios, BuzzFeed, Genius, Chartbeat and Giphy. And while the firm has experience in media, that doesn’t mean that the portfolio is squarely focused on it. Other portfolio companies include Casper, WayUp, Warby Parker, Mirror, HungryRoot, Glossier, Everlane, Brit + Co., and AllBirds, to name just a few.\n As an early stage investor, Hippeau knows what it takes for companies to get the attention of VCs and take the deal across the finish line. We’ll chat with Hippeau about some of the do’s and don’ts of fundraising, his expectation for the next-generation of startups born in this pandemic world, and which sectors he’s most excited to invest in.\n As previously mentioned, Extra Crunch members are encouraged to bring their own questions to this discussion. Come prepared!\n Hippeau joins an all-star cast of guests on Extra Crunch Live, including Mark Cuban, Roelof Botha, Kirsten Green, Aileen Lee and Charles Hudson. You can check out the  full slate of episodes here.\n  Details: Date: Thursday, August 13th @ 11am PT/2pm ET/6pm GMT Zoom Info:  https://zoom.us/j/92633495658  Add this event to your calendar", "posttime": "2020-08-08 01:07:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,时间,live,hippeau", "title": "\nExtra Crunch Live：加入Eric Hippeau于8月13日太平洋时间上午11点/美国东部时间下午2点的现场问答", "title_en": "\n\t\t\t\tExtra Crunch Live: Join Eric Hippeau for a live Q&A on August 13 at 11am PT/2pm ET\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/extra-crunch-live-join-eric-hippeau-for-a-live-qa-on-august-13-at-11am-pt-2pm-et/", "via": "", "real_tags": ["美国", "时间", "live", "hippeau"]}, {"category": "", "categoryclass": "", "imagename": "0839dac24b2c70037bd0338314de79a3.jpg", "infoid": 1016912, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你不知道，我们正在进行的投手和投球网络研讨会系列是一个投球-离开-大师班-混搭。这是一个机会，可以把你最好的推销交给一个专家小组，他们会提供无价的评论，帮助你制作一个更有说服力的推销。更好的投球意味着更多的机会，阿米利特？\n任何人都可以通过参加投手和投球活动而受益，但只有参加数字创业大道(Digital Startup Alley)的公司才能参与竞争。想要有资格参加下周的活动吗？点击此处购买Disrupt Digital Startup Alley软件包。\n我们将随机选择五家初创公司进行推介，接受直接反馈，并有机会获得最高奖项。我们喜欢奖品…。尤其是那些有助于建立更好的创业公司的公司。获奖的创始人将获得与Ccela的咨询会议，这是一家将早期初创企业与加速器和孵化器联系起来的公司，可以帮助他们扩大业务规模。\n这是在数字创业巷展出的另一个重要原因。您可以独家访问我们的三部分互动网络研讨会系列。检查下面的日期和主题。\n8月12日：与媒体合作的所作所为和不应做的事情。\n我们将在8月12日公布推介阵容--以及那些创始人需要给他们留下深刻印象的具体风投评委。请记住，只有参加Disrupt2020的初创公司才有资格进行推介。如果你想参与行动，今天就给自己买个数字创业通道套餐吧。\n在这里注册，和我们一起参加8月13日的下一场投手和大赛。嘿，即使你不参加比赛，你也会听到很多关于如何提高你的演讲技能和最大限度地利用你60秒的投球的好建议。\n贵公司是否有兴趣赞助或参展Disrupt2020？请填写此表格与我们的赞助销售团队联系。", "note_en": "If you’re not in the know, our ongoing Pitchers and Pitches webinar series is a pitch-off-masterclass-mashup. It’s a chance to deliver your best pitch to a panel of experts who will provide invaluable critique to help you craft a more compelling pitch. Better pitches equal more opportunities, amirite?\n Anyone can benefit by  attending Pitchers &amp; Pitches, but only companies exhibiting in  Digital Startup Alley can compete. Want to be eligible to pitch in next week’s event?  Buy a Disrupt Digital Startup Alley Package here.\n  We’ll randomly select five startups to pitch, receive direct feedback and have a shot at taking the top prize. We love prizes…especially the kind that help build a better startup. The winning founders receive a consulting session with  cela, a company that connects early-stage startups to accelerators and incubators that can help scale their businesses.\n Here’s another great reason to exhibit in  Digital Startup Alley. You get exclusive access to our  three-part interactive webinar series. Check the dates and topics below.\n August 12: The Do’s and Don’ts of Working with the Press\n We’ll announce the pitching lineup — and the specific VC judges those founders need to impress — on August 12. Remember, only startups exhibiting at Disrupt 2020 are eligible to pitch. If you want in on the action,  get yourself a Digital Startup Alley Package today.\n Register here and join us for the next Pitchers &amp; Pitches on August 13. And hey, even if you don’t compete, you’ll hear loads of good advice on ways to improve your presentation skills and make the most of your 60-second pitch.\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? Contact our sponsorship sales team by  filling out this form.", "posttime": "2020-08-08 01:07:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "投手,pitchers", "title": "\n报名参加8月13日的下一场投手和投球比赛", "title_en": "\n\t\t\t\tSign up for the next Pitchers & Pitches competition on 8/13\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/sign-up-for-the-next-pitchers-pitches-competition-on-8-13/", "via": "", "real_tags": ["投手", "pitchers"]}, {"category": "", "categoryclass": "", "imagename": "cb84599c3f63c30dda5ffc86df97c1b6.jpg", "infoid": 1016911, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一名数字营销和客户体验领导者，埃文·科恩(Evan Kohn)是Pypestream的首席商务官，在那里他创建了PypePro，这是财富500强公司使用的一种人工智能入职方法。\n领导者越来越多地采用会话分析，这是CX数据的一种新范式。重点将不再是用户对呈现给他们的内容的反应，而是他们通过自然语言传达的“意图”。能够通过对话界面捕获意图数据的公司可以积极主动地与客户互动，提供超个性化体验，并在市场中更好地定位自己。\n会话人工智能为这些界面和自动化系统提供动力，并将数据输入会话分析引擎，预计这个市场将从2019年的42亿美元增长到2024年的157亿美元。随着公司将他们的品牌“对话化”，并向客户开放新的界面，人工智能不仅可以为CX提供决策信息，比如如何设计客户之旅-例如精心策划的购买体验和购买路径-而且还可以告诉CX如何发展整体产品和服务产品。这种洞察力优势可能会成为早期采用者的游戏规则改变者和竞争优势。\n今天，从初级的单任务聊天机器人到安全的、以用户为中心的、可扩展的人工智能，会话解决方案的复杂程度差异很大。要释放有意义的会话分析，公司需要确保除了使用自然语言理解(NLU)解析客户意图这一基本要素之外，还部署了一些关键要素。\n虽然意图数据很有价值，但公司将通过收集情绪和语气数据，包括通过表情符号分析，来提升他们的参与度。这样的数据可以使自动化适应客户的处置，因此，如果检测到对逾期账单的愤怒，则可以提供快速解决途径。如果客户在购买产品后表达了喜悦，人工智能可以通过追加销售来回应，并为未来的客户旅行收集更敏锐和可行的反馈。", "note_en": "A digital marketing and customer experience leader, Evan Kohn is chief business officer at  Pypestream, where he created PypePro, an AI onboarding methodology used by Fortune 500 firms.\n  Leaders  are increasingly adopting conversational analytics, a new paradigm for CX data. No longer will the emphasis be on how users react to what is presented to them, but rather what “intent” they convey through natural language. Companies able to capture intent data through conversational interfaces can be proactive in customer interactions, deliver hyper-personalized experiences, and position themselves more optimally in the marketplace.\n  Conversational AI, which powers these interfaces and automation systems and feeds data into conversational analytics engines, is a market predicted to grow from $4.2 billion in 2019 to $15.7 billion in 2024. As companies “conversationalize” their brands and open up new interfaces to customers, AI can inform CX decisions not only in how customer journeys are architected–such as curated buying experiences and paths to purchase–but also how to evolve overall product and service offerings. This insights edge could become a game-changer and competitive advantage for early adopters.\n Today, there is wide variation in the degree of sophistication between conversational solutions from elementary, single-task chatbots to secure, user-centric, scalable AI. To unlock meaningful conversational analytics, companies need to ensure that they have deployed a few critical ingredients beyond the basics of parsing customer intent with natural language understanding (NLU).\n While intent data is valuable, companies will up-level their engagements by collecting sentiment and tone data, including via emoji analysis. Such data can enable automation to adapt to a customer’s disposition, so if anger is detected regarding a bill that is overdue, a fast path to resolution can be provided. If a customer expresses joy after a product purchase, AI can respond with an upsell offer and collect more acute and actionable feedback for future customer journeys.", "posttime": "2020-08-08 01:06:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "客户,analytics", "title": "\n对话式分析即将永远改变客户体验", "title_en": "\n\t\t\t\tConversational analytics are about to change customer experiences forever\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/conversational-analytics-are-about-to-change-customer-experiences-forever/", "via": "", "real_tags": ["客户", "analytics"]}, {"category": "", "categoryclass": "", "imagename": "502cea1a78517cbf009cceec7c421137.jpg", "infoid": 1016910, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "YouTube上发生了很多事情，谷歌视频网站多年来一直向订阅者发送电子邮件，让他们选择提醒新上传的内容和直播流。YouTube将在下周删除这些电子邮件，因为很少有人会打开收件箱里的新视频提醒。\n8月13日(星期四)，新的YouTube视频电子邮件通知-针对那些订阅它们的人-将会消失。这包括新的上传、直播和首播。未来主要也是唯一的提醒方式将是Android、iOS和网络通知。当然，更多的人在社交媒体上发现新视频，要么直接从创建者那里，要么在分享时。\nYouTube的基本原理是如何“打开不到0.1%的电子邮件”。有关您的“帐户、强制服务公告等”的消息。留下来，谷歌希望今天更广泛的变化将帮助“你更容易地发现和关注重要的电子邮件”。这反映出越来越多的公司希望减少信息过载。\n人们告诉我们，这些电子邮件会导致收件箱超载-我们希望这一变化能帮助您更容易地发现并关注重要的电子邮件。\nYouTube告诉创建者，当我们尝试关闭这些电子邮件时，它“没有看到观看时间有任何影响。”\n事实上，我们的测试显示，当我们不发送这些电子邮件时，更多的人会使用移动推送通知和他们的订阅源。\n你正在阅读朝九晚五的谷歌新闻，这些专家日复一日地发布关于谷歌及其周边生态系统的新闻。请务必查看我们的主页以获取所有最新新闻，并关注Twitter、Facebook和LinkedIn上的朝九晚五谷歌，随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "A lot happens on YouTube, and the Google video site has for ages emailed subscribers that opted into alerts about new uploads and livestreams. YouTube is  getting rid of these emails next week as very few people opened alerts about new videos from their inbox.\n  On Thursday, August 13, new YouTube video email notifications — for those subscribed to them — are going away. This covers new uploads, livestreams, and premieres. The primary and only alert method going forward will be Android, iOS, and web notifications. Of course, many more people find out about new videos on social media, either directly from a creator or when shared.\n The rationale for YouTube is how “less than 0.1% of these emails are opened.” Messages about your “account, mandatory service announcements, etc.” remain, with Google hoping that the broader change today will help “you more easily spot and pay attention to the important emails.” It reflects companies increasingly wanting to reduce information overload.\n People have told us that these emails contribute to inbox overload – we hope this change helps you more easily spot and pay attention to the important emails\n    YouTube tells Creators that it “didn’t see any impact to watch time when we experimented with turning off these emails.”\n In fact, our tests showed that when we don’t send these emails, more people engage with mobile push notifications and their Subscriptions feed.\n  You’re reading 9to5Google — experts who break news about Google and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Google on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-08-08 01:06:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,下周,stop", "title": "YouTube下周将停止向订户发送有关新视频的电子邮件", "title_en": "YouTube Will Stop Emailing Subscribers About New Videos Next Week", "transed": 1, "url": "https://9to5google.com/2020/08/07/youtube-new-video-emails/", "via": "", "real_tags": ["youtube", "下周", "stop"]}, {"category": "", "categoryclass": "", "imagename": "64bc20317ba940ba9ac3a9443f1981bb.jpeg", "infoid": 1016909, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿--“华尔街日报”(The Wall Street Journal)查阅的采访和文件显示，一家与美国国防和情报界有联系的美国小公司已经将其软件嵌入到众多移动应用程序中，使其能够跟踪全球数亿部手机的动向。\n由两名具有情报背景的美国退伍军人创立的弗吉尼亚州公司Anomality Six LLC在营销材料中表示，该公司能够从500多个移动应用程序中提取位置数据，部分是通过自己的软件开发工具包(SDK)，该工具包直接嵌入到一些应用程序中。如果消费者允许包含该软件的应用程序访问手机的GPS坐标，SDK将允许公司获取手机的位置。\n应用程序发行商通常允许第三方公司付费将SDK插入到他们的应用程序中。SDK制造商随后出售从应用程序中获得的消费者数据，应用程序发行商将获得一大笔收入。但消费者没有办法知道SDK是否嵌入到应用程序中；大多数隐私政策都不会披露这些信息。Anomality Six表示，它在一些应用程序中嵌入了自己的SDK，在其他情况下，它会从其他合作伙伴那里获得位置数据。\nAnomality Six是一家联邦承包商，向美国政府的分支机构和私营部门客户提供全球定位数据产品。该公司告诉“华尔街日报”(Wall Street Journal)，它只限制向非政府、私营部门的客户出售美国手机移动数据。\n美国政府的许多机构已经得出结论，联邦机构从广告中获得的移动数据是合法的。据“华尔街日报”报道，几家执法机构正在利用此类数据进行刑事执法，而众多美国军方和情报机构也在获取此类数据。\n广告和营销界的许多私营公司买卖地理位置数据，有时会将其转售给政府机构或承包商。但由一家与美国国家安全机构关系密切的企业直接收集此类数据是不寻常的。\n法庭记录和采访显示，异常六号是由国防承包退伍军人创立的，他们在职业生涯的大部分时间里与政府机构密切合作，并创建了一家公司，部分迎合国家安全机构的需求。\n“华尔街日报”审查了为军方官员准备的文件，其中描述了该公司的能力。该公司在最近一次向参议员罗恩·怀登(Ron Wyden)办公室的简报中还解释了自己的商业做法，怀登的工作人员随后向“华尔街日报”描述了这一情况。这位俄勒冈州民主党人一直在对出售美国人的位置数据进行调查。\n该公司在回答本文问题时表示：“Anomality Six是一家经验丰富的小企业，负责处理和可视化来自移动设备的位置数据，以进行分析和洞察。”我们利用来自众多第一方来源的详细位置数据提供对组、行为和模式的洞察。该公司表示，它承认政府对此类数据的使用进行了“严格的审查”，但表示它处理的所有数据都是商业上可用的，并符合所有法律。\n美国政府从世界各地毫无戒心的用户那里批量获取手机数据是正确的吗？为什么或者为什么不？加入下面的对话。\n异常六号表示，它将支持监管，要求应用程序更多地披露数据是如何收集和使用的。无法确定该公司与之合作的具体应用程序，该公司以保密协议为由拒绝置评。数据经纪人和应用程序制造商之间的合作伙伴关系通常是商业数据销售领域内严格保密的商业秘密。\n营销专家、基于位置的营销协会(Location Based Marketing Association)创始人阿西夫·汗(Asif Khan)表示，政府获取消费者位置数据一直是该行业的一个长期问题。该协会是一个代表广告和营销公司的行业组织，负责处理位置数据。他说，应用程序制造商应该向消费者更透明地告知消费者，一旦收集到数据，可能会如何使用。\n“你可以争辩说，政府和任何商业实体一样，有权购买这些数据，如果数据可以从商业供应商那里获得的话，”汗说。“但你也需要能够清楚地说，‘这些数据可能会被政府利用’。”\n“我认为普通消费者毫无头绪，”他说。\n在从应用程序中提取的数据中，每部手机通常由一个字母数字标识符表示，该标识符与手机所有者的姓名没有关联。但随着时间的推移，手机的移动模式可以让分析师推断出手机的所有权-例如，手机在晚上和夜间的位置很可能是手机所有者居住的地方。\n世界各地的消费者经常对政府获取和使用这些数据一无所知。尽管从消费者应用程序收集数据，但Anomality Six在其网站上没有隐私政策，也没有在加州注册为数据经纪人。2018年通过的一项州法律通常要求公司详细说明他们是如何获取和使用消费者数据的。该公司表示，它不符合加州法律对数据经纪人的定义，也不需要注册。加州总检察长办公室没有回复记者的置评请求。\n根据对众多业内人士的采访，美国对位置数据的买卖几乎没有监管，导致了一位业内资深人士所说的“狂野西部”。知情人士说，消费者开始期待免费的应用程序，应用程序制造商已经转向出售用户数据，以支付开发和运行该软件的成本。\nAnomality Six的服务类似于一家名为巴别街(Babel Street)的公司，该公司为情报机构和执法机构提供社交媒体监控服务。两年前，巴别街(Babel Street)对Anomality Six及其创始人提起的诉讼，为人们提供了一扇窗口，让人们得以了解竞争激烈且基本上保密的市场，即向美国政府提供消费者定位产品。\n诉讼称，Anomality Six的两名创始人曾在巴别街工作，并于2018年离职。\n前陆军反间谍官员布兰丹·赫夫(Branda Huff)曾管理过巴别街与国防部的关系，也曾为许多其他国防承包商工作。法庭记录显示，另一位名叫杰弗里·海因茨(Jeffrey Heinz)的人也曾在美国陆军服役，曾管理巴别街与司法部、美国网络司令部(U.S.Cyber Command)、文职联邦机构和情报界的关系。\n巴别街的一款名为“Locate X”的产品包括数百万部手机的位置记录，这些记录来自消费者应用程序。根据巴贝尔的诉讼，这两名前雇员开始制造一种产品来与之竞争。Anomality Six拒绝对这起诉讼置评，这起诉讼于去年达成庭外和解。\n根据“华尔街日报”审查的合同和用户协议，巴别街并不公开宣传Locate X，并约束客户和用户甚至对其存在保密。根据法庭记录，Locate X是在美国政府官员的投入下开发的，被致力于收集“开源”情报(即从公开来源获取的信息)的军事情报单位广泛使用。联邦合同数据显示，巴别街还与国土安全部、司法部和许多其他民事机构签订了合同。巴别街没有回复记者的置评请求。\n根据对知情人士的采访和“华尔街日报”查阅的文件，巴别街和Anomaly Six的产品都可以用来将以更传统的方式收集的情报与社交媒体数据、卫星图像和来自私营部门的消费者数据结合起来，从秘密的人力来源到秘密截获。\n这些信息被收集到所谓的“生活模式”分析中，可以提供对潜在情报目标的习惯和行为的更丰富的理解，并可能预测他们未来的行为。\n美国并不是唯一一个试图将移动位置数据用于战略优势的国家。美国国家安全局(National Security Agency)本月警告军方和情报界人员，出于对这些数据可能被对手用来泄露有关美国行动的敏感国家安全信息的担忧，要严格限制他们移动设备上的位置跟踪功能。\n“华尔街日报”上个月还报道称，作为美国陆军一个项目的一部分，一组使用巴别街软件的学术研究人员能够监控俄罗斯军事设施的设备移动情况。\n这样的爆料展示了即使是商业数据也能泄露世界上一些最安全的设施的敏感信息，并引发了人们对企业营销和政府监控之间界限模糊的隐私担忧。\n“了解到像这样的公司声称拥有来自世界各地多年的位置数据，这真的很令人担忧。乔治敦大学(Georgetown University)法学教授、该校通信与技术法律诊所(Communications&Amp；Technology Law Clinic)主任劳拉·莫伊(Laura Moy)表示：“这样的爆料层出不穷。”\n“用户不知道，当他们安装天气应用程序、游戏或任何其他无害的应用程序时，他们的私人位置数据将被收集和出售。显然，这就是这里正在发生的事情，我们对这种做法没有透明度，“莫伊说。\nAnomality Six没有列在任何公共支出合同中，巴别街对政府实体的许多销售也没有反映在公开文件中。Anomality Six说，它与美国政府的合同是非机密的，但是保密的，而且在没有得到这些机构的许可的情况下，它不能透露它正在与哪些机构合作。", "note_en": "WASHINGTON—A small U.S. company with ties to the U.S. defense and intelligence communities has embedded its software in numerous mobile apps, allowing it to track the movements of hundreds of millions of mobile phones world-wide, according to interviews and documents reviewed by The Wall Street Journal.\n  Anomaly Six LLC a Virginia-based company founded by two U.S. military veterans with a background in intelligence, said in marketing material it is able to draw location data from more than 500 mobile applications, in part through its own software development kit, or SDK, that is embedded directly in some of the apps. An SDK allows the company to obtain the phone’s location if consumers have allowed the app containing the software to access the phone’s GPS coordinates.\n  App publishers often allow third-party companies, for a fee, to insert SDKs into their apps. The SDK maker then sells the consumer data harvested from the app, and the app publisher gets a chunk of revenue. But  consumers have no way to know whether SDKs are embedded in apps; most privacy policies don’t disclose that information. Anomaly Six says it embeds its own SDK in some apps, and in other cases gets location data from other partners.\n  Anomaly Six is a federal contractor that provides global-location-data products to branches of the U.S. government and private-sector clients. The company told The Wall Street Journal it restricts the sale of U.S. mobile phone movement data only to nongovernmental, private-sector clients.\n    Numerous agencies of the U.S. government have concluded that mobile data acquired by federal agencies from advertising is lawful. Several law-enforcement agencies are  using such data for criminal-law enforcement, the Journal has reported, while numerous U.S. military and intelligence agencies also acquire this kind of data.\n  Many private-sector companies in the advertising and marketing world buy and sell geolocation data, sometimes reselling it to government agencies or contractors. But the direct collection of such data by a business closely linked to U.S. national security agencies is unusual.\n  Anomaly Six was founded by defense-contracting veterans who worked closely with government agencies for most of their careers and built a company to cater in part to national-security agencies, according to court records and interviews.\n    The firm’s capabilities were described in documents prepared for military officials that were reviewed by the Journal. The company also explained its business practices in a recent briefing to the office of Sen. Ron Wyden, whose staff then described it to the Journal. The Oregon Democrat has been conducting a probe into the sale of Americans’ location data.\n  “Anomaly Six is a veteran-owned small business that processes and visualizes location data sourced from mobile devices for analytics and insights,” the company said in response to questions for this article. “We leverage detailed location data from numerous first-party sources to provide insights into groups, behaviors, and patterns.” The company said it acknowledged the “intense scrutiny” around the government use of such data, but said all the data it works with is commercially available and compliant with all laws.\n  Is it right for the U.S. government to be acquiring cell phone data in bulk from unsuspecting users all over the world? Why or why not? Join the conversation below.\n  Anomaly Six said it would support regulation to require more disclosure by apps of how data is collected and used. The exact apps the company partners with couldn’t be determined and the company declined to comment, citing confidentiality agreements. The partnerships between data brokers and app makers are typically closely held trade secrets within the world of commercial-data sales.\n  Asif Khan, a marketing expert and founder of the Location Based Marketing Association, a trade group representing advertising and marketing companies who deal in location data, said the government acquisition of consumer location data has been a longstanding issue for the industry. He said app-makers  should be more transparent with consumers about how the data may be used once it is collected.\n  “You could argue that the government has the right, just like any commercial entity, to buy the data, if the data is available from a commercial supplier,” said Mr. Khan. “But you also need to be able to clearly say ‘this data could be used by government.’”\n  “I think the average consumer doesn’t have a clue,’ he said.\n  In the data drawn from apps, each cellphone is typically represented by an alphanumeric identifier that isn’t linked to the name of the cellphone’s owner. But the movement patterns of a phone over time can allow analysts to deduce its ownership—for example, where the phone is located during the evenings and overnight is likely where the phone-owner lives.\n    Consumers world-wide are often in the dark about governments’ acquisition and use of such data. Despite collecting data from consumer apps, Anomaly Six doesn’t have a privacy policy on its website, nor is it registered as a data broker in California, where a state law passed in 2018 typically requires companies to detail how they are acquiring and using consumer data. The company says it doesn’t meet the definition of a data broker under California law and isn’t required to register. The California attorney general’s office didn’t respond to a request for comment.\n  According to interviews with numerous people in the industry, there is little regulation in the U.S. about the buying and selling of location data, leading to what one industry veteran called “the Wild West.” Consumers have come to expect free apps, and app makers have turned to selling user data to pay for the costs of developing and running the software, people familiar with the industry.\n  Anomaly Six’s offerings are similar to those of a company called Babel Street, which provides social-media monitoring services to the intelligence community and law-enforcement agencies. A lawsuit filed by Babel Street two years ago against Anomaly Six and its founders offers a window into the competitive and largely secretive market of providing consumer location products to the U.S. government.\n  The two founders of Anomaly Six formerly worked for Babel Street and left in 2018, according to the lawsuit.\n  Brandan Huff, a former Army counterintelligence officer, had managed Babel Street’s relationship with the Defense Department and had also worked for numerous other defense contractors. The other, Jeffrey Heinz, was also previously in the U.S. Army and had managed Babel Street’s relationships with the Justice Department, U.S. Cyber Command, civilian federal agencies and the intelligence community, court records show.\n  One of Babel Street’s products, called “Locate X,” includes the location records of millions of cellphones, drawn from consumer apps. The two former employees set out to build a product to compete with it, according to Babel’s lawsuit. Anomaly Six declined to comment on the lawsuit, which was settled out of court last year.\n  Babel Street doesn’t publicly advertise Locate X and binds clients and users to secrecy about even its existence, according to contracts and user agreements reviewed by the Journal. Developed with input from U.S. government officials, according to court records, Locate X is widely used by military intelligence units who work on gathering “open source” intelligence, or information taken from publicly available sources. Babel Street also has contracts with the Department of Homeland Security, the Justice Department, and many other civilian agencies, federal contracting data shows. Babel Street didn’t respond to a request for comment.\n  Both Babel Street’s and Anomaly Six’s products can be used to combine intelligence gathered in more traditional ways, from clandestine human sources to secret intercepts, with social media data, satellite imagery, and consumer data from the private sector, according to interviews with people familiar with the process and documents reviewed by the Journal.\n  The information, gathered into what’s known as a “pattern of life” analysis, can provide a richer understanding of the habits and behaviors of potential intelligence targets, and to possibly predict their future behavior.\n  The U.S. isn’t alone in attempting to use mobile-location data for strategic advantage. The National Security Agency this month  warned military and intelligence community personnel to sharply limit the location-tracking features on their mobile devices, out of concern that the data could be used by adversaries to reveal sensitive national security information about U.S. operations.\n  A group of academic researchers using Babel Street’s software were able to  monitor the movement of devices at Russian military facilities as part of a project for the U.S. Army, the Journal also reported last month.\n  Such revelations showcase the power of even commercial data to reveal sensitive information about some of the most secure facilities in the world—and raise privacy concerns about the blurring the lines between corporate marketing and government surveillance.\n  “It’s really alarming to learn about companies like this that claim to have years’ worth of location data from all over the world. Revelations like this just keep coming,” said Laura Moy, a law professor at Georgetown University and director of the school’s Communications &amp; Technology Law Clinic.\n  “Users have no idea that when they install a weather app, a game, or any other innocuous-seeming app that their private location data is going to be harvested and sold. Apparently that’s what’s happening here, and we have no transparency into the practice,” said Ms. Moy.\n  Anomaly Six isn’t listed in any public spending contracts, and many of Babel Street’s sales to government entities aren’t reflected in public documents either. Anomaly Six said its contracts with the U.S. government were unclassified but confidential, and that it couldn’t reveal which agencies it was working with without permission from those agencies.", "posttime": "2020-08-08 01:05:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,手机,程序,sdk,contractor", "title": "美国政府承包商Anomality Six通过嵌入500多个应用程序的SDK从全球数亿部手机收集和销售位置数据", "title_en": "US government contractor Anomaly Six collects and sells location data from hundreds of millions of phones globally via its SDK that is embedded in 500+ apps", "transed": 1, "url": "https://www.wsj.com/articles/u-s-government-contractor-embedded-software-in-apps-to-track-phones-11596808801?mod=djemalertNEWS", "via": "", "real_tags": ["美国", "手机", "程序", "sdk"]}, {"category": "", "categoryclass": "", "imagename": "5a2cd11d83b3194ba400316725bddcd3.jpeg", "infoid": 1016908, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名15岁的高中生在网上发布了一张拥挤的学校走廊的病毒式照片，她说学校将她停学5天，原因是她涉嫌违反了社交媒体政策。但自那以后，学校做出了让步，解除了停学。\n汉娜·沃特斯(Hannah Watters)是佐治亚州达拉斯北鲍尔丁高中(North Paulding High School)的一名学生。周二，她在推特上发布了一张照片，称走廊拥堵，口罩覆盖率为10%。她的推文获得了1800次转发和4500个赞。她还发布了一段10秒的视频，视频中显示了这所拥有2000名学生的学校的走廊，并表示第二天中午左右她被停学了。\n根据BuzzFeed的一篇文章，沃特斯说，我违反的政策规定，我未经许可在走廊使用手机，在社交媒体上使用手机，未经同意发布未成年人的照片。沃特斯称她的行为是好的、必要的麻烦-显然是指约翰·刘易斯的一句话-说尽管冠状病毒正在流行，但学校重新开学，她担心学生、教职员工的安全。\n据“亚特兰大宪法报”报道，她的母亲琳恩·沃特斯(Lynne Watters)说，这家人正在挑战停职的决定。她的母亲在一条短信中说，大二学生允许在课间使用手机，直到正常的放学时间后才会在社交媒体上发帖。她写道，我觉得他们是在选择性地执行有问题的规则，并补充说，汉娜在学校从来没有遇到过麻烦。\n报纸上的文章说，另一名学生因同样的原因被学校停学，但没有透露另一名学生的名字。我们今天联系了学区，如果得到回应，我们会更新这篇文章。\n沃特斯的上诉显然是成功的。汉娜·沃特斯(Hannah Watters)今天早上在推特上写道：今天早上，我的学校打电话来，他们已经删除了我的停职。对所有支持我的人，我对你们感激不尽。\n根据“宪法”杂志的文章，州立学校负责人理查德·伍兹今天在一份声明中表示，根据宪法，纪律决定是地方教育委员会的职权范围，但他鼓励地区和学校透明运营，并确保学生和教职员工不会因为表达他们的担忧而受到惩罚。该报还援引佐治亚州立大学公共卫生学院临床副教授哈里·海曼(Harry Heiman)博士的话说，走廊照片显示，学生和教职员工的担忧不会受到惩罚。该报还援引佐治亚州立大学公共卫生学院(School Of Public Health)临床副教授哈里·海曼(Harry Heiman)博士的话说，走廊照片显示，学生和教职员工表达了他们的担忧。不会发生的。#34；\n这不是这是否会导致大流行蔓延的问题。海曼说，这只是一个速度有多快、人数有多少的问题。在学校重新开学之前，学校足球队的一些成员已经对新冠肺炎的检测呈阳性。\n在一段泄露的录音中，北保尔丁高中校长加布·卡莫纳警告学生们，未经许可在社交媒体上发布对我们不利的照片或视频，后果将不堪设想。\n保定县学区负责人布莱恩·奥托特周二晚上就其中一张病毒式的照片向家长们发了一条信息，称新闻媒体上的一些人和社交媒体上的一些人拍下了这张照片，并在没有任何背景的情况下利用它来批评我们重新开学的努力。换班很困难，校区仍在继续工作。他写道，为了找到可行的方法进一步限制学生聚集，但学生们在进入下一节课的过程中，只会在这个走廊环境中短暂停留一段时间。\n奥托特承认这张照片看起来不太好看，但他称其为不幸的是，在这个即时交流的时代，这类问题可以在没有足够背景的情况下如此迅速地升级。虽然许多学生在照片中没有戴口罩，但他写道，戴口罩是个人选择，没有实际的方法来强制要求他们戴口罩。TMZ公布了奥托特写给家长的便条。\nOtot的报告还说，在开学的第一周，学生们将在周一到周三进行面对面学习，周四和周五进行远程学习，这样我们所有的学校都可以退一步，评估目前情况。周四/周五的停课意味着沃特斯没有错过一整天的面授课程。\n佐治亚州州长布莱恩·坎普7月15日发布了一项行政命令，声明城镇不能强制要求佩戴口罩，他起诉亚特兰大，试图推翻该市的口罩强制令。尽管如此，亚特兰大也在学校实施面具强制令。亚特兰大和州长正在进行和解谈判。", "note_en": "A 15-year-old high school student who posted a viral photo of a crowded school hallway says the school suspended her for five days for allegedly violating a social-media policy. But the school has since backed down and lifted the suspension.\n Hannah Watters, a student at North Paulding High School in Dallas, Georgia, posted a  photo to Twitter on Tuesday, noting the &#34;jammed&#34; hallways and &#34;10 percent mask rate.&#34; Her tweet received 1,800 retweets and 4,500 likes. She also posted a  10-second video of a hallway at the 2,000-student school and says she was suspended around noon the next day.\n  &#34;The policies I broke stated that I used my phone in the hallway without permission, used my phone for social media, and posting pictures of minors without consent,&#34; Watters said, according to a  BuzzFeed article. Watters  called her actions &#34;good and necessary trouble&#34;—an apparent reference to a  John Lewis quote—saying she is worried about the safety of students, faculty, and staff as the school reopens despite the ongoing coronavirus pandemic.\n Her mother, Lynne Watters, said &#34;the family is challenging the suspension,&#34;  according to the Atlanta Journal-Constitution. &#34;Cell phone use is allowed in between classes and the sophomore waited until after regular school hours to post to social media, her mother said in a text message. &#39;I feel they are selectively enforcing the rule in question,&#39; she wrote, adding that Hannah has never been in trouble at school.&#34;\n The newspaper article said one other student was suspended from the school for the same reason but didn&#39;t name the other student. We contacted the school district today and will update this article if we get a response.\n Watters&#39; appeal was apparently successful. &#34;This morning my school called and they have deleted my suspension,&#34; Hannah Watters  tweeted this morning. &#34;To everyone supporting me, I can&#39;t thank you enough.&#34;\n State Schools Superintendent Richard Woods said in a statement today that &#34;discipline decisions are constitutionally the purview of local boards of education,&#34; but he encouraged &#34;districts and schools to operate with transparency, and to ensure that students and staff are not penalized for expressing their concerns,&#34; according to the Journal-Constitution article. The newspaper also quoted  Dr. Harry Heiman, clinical associate professor at Georgia State University&#39;s School of Public Health, as saying that the hallway photo showed &#34;exactly the kind of situation that school planning should ensure doesn&#39;t happen.&#34;\n &#34;It&#39;s not a question of if that&#39;s going to cause spread of the pandemic. It&#39;s only a question of how quickly and to how many people,&#34; Heiman said. Some members of the school football team had already  tested positive for COVID-19 before the school reopened.\n  In a leaked audio recording, North Paulding High School Principal Gabe Carmona was heard  warning students of &#34;consequences&#34; for posting photos or video &#34;on social media that is negative in our light without permission.&#34;\n Paulding County School District Superintendent Brian Otott wrote a  message about one of the viral photos to parents Tuesday night, saying that &#34;some in the news media and some individuals on social media are taking this photo and using it without context to criticize our school reopening efforts.&#34; Class changes are difficult, and the school district is &#34;continuing to work... to find practicable ways to further limit students from congregating,&#34; but &#34;students are in this hallway environment for just a brief period as they move to their next class,&#34; he wrote.\n Otott admitted that &#34;the photo does not  look good,&#34; but he called it &#34;unfortunate that in this day and age of instant communication these types of issues can escalate so quickly without sufficient context.&#34; While many students were shown without masks, he wrote that &#34;wearing a mask is a personal choice and there is no practical way to enforce a mandate to wear them.&#34; Otott&#39;s note to parents was  published by TMZ.\n Otott&#39;s note also said that during this first week of school, students are going in-person from Monday to Wednesday and &#34;learning remotely on Thursday and Friday so that all of our schools can step back and assess how things are going so far.&#34; The Thursday/Friday closure means that Watters did not miss a full day of in-person instruction.\n Georgia Governor Brian Kemp  on July 15 issued an executive order stating that cities and towns cannot impose mask-wearing requirements, and he sued Atlanta in an attempt to overturn the city&#39;s mask mandate. Despite that, Atlanta is  imposing a mask mandate in schools as well. Atlanta and the governor are in  settlement talks.", "posttime": "2020-08-08 00:40:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,推特,停职,suspends,学校", "title": "HS停职青少年，他们在推特上发布了挤满了不戴面具的学生的走廊照片", "title_en": "HS suspends teen who tweeted photo of hallway packed with maskless students", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/08/hs-suspends-teen-who-tweeted-photo-of-hallway-packed-with-maskless-students/", "via": "", "real_tags": ["发布", "推特", "停职", "suspends", "学校"]}, {"category": "", "categoryclass": "", "imagename": "3a9519a5338994031b8af9e02c6fa671.jpg", "infoid": 1016907, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "温德尔·布鲁克斯(Wendell Brooks)已经从英特尔辞职，以寻求其他机会。我们感谢温德尔做出的所有贡献，并祝愿他未来一切顺利。“一位公司发言人在一次相当平淡的欢送中告诉TechCrunch。\n一直负责并购和国际投资的Anthony Lin将临时接任。有趣的是，当布鲁克斯升职时，他也负责并购业务。\n林书豪是否会继续担任这一角色还有待观察，但当我在2015年与布鲁克斯交谈时，当时他即将接替索德哈尼，他听起来肯定已经准备好接受手头的任务。他当时说：“要保持这样的记录，我还有很长的路要走。”我认为这是一个扩大组织重点的巨大机会，我们可以在这里为投资组合的公司提供战略价值。“。\n在同一次采访中，布鲁克斯描述了他的投资哲学，说他更喜欢领导，而不是作为二级投资者。他说：“我倾向于认为，与被动投资者相比，首席投资者能够更多地影响初创公司的商业论点、进入市场的路线、方向和技术。”他补充说，它还倾向于获得能够提供额外影响力的董事会席位。\n他将他的公司与传统的风险投资公司进行了比较，他说，就投资记录而言，他们和传统的风险投资公司一样好，甚至更好，作为战略投资者，他们也带来了其他一些优势。“一些传统的风投专注于打造公司价值。我们可以提供战略指导，并与其他风险投资公司相比，对一些公司的建设表示赞赏。“。\n在该公司的整个生命周期中，它已经向1500多家公司投资了129亿美元，其中692家公司通过IPO或收购退出。就在今年，在布鲁克斯的领导下，该公司迄今投资了2.25亿美元，其中包括11笔新投资和26笔对投资组合中已有公司的投资。", "note_en": "“ Wendell Brooks   has resigned from  Intel   to pursue other opportunities. We thank Wendell for all his contributions and wish him the best for the future,” a company spokesperson told TechCrunch in a rather bland send off.\n Anthony Lin, who has been leading mergers and acquisitions and international investing, will take over on an interim basis. Interestingly, when Brooks was promoted, he too was in charge of mergers and acquisitions.\n  Whether Lin keeps that role remains to be seen, but when I spoke to Brooks in 2015 as he was about to take over from Sodhani, he certainly sounded ready for the task at hand. “I have huge shoes to fill in maintaining that track record,” he said at the time. “I view it as a huge opportunity to grow the focus of organization where we can provide strategic value to portfolio companies.”\n In that same interview, Brooks described his investment philosophy, saying he preferred to lead, rather than come on as a secondary investor. “I tend to think the lead investor is able to influence the business thesis, the route to market, the direction, the technology of a startup more than a passive investor,” he said. He added that it also tends to get board seats that can provide additional influence.\n Comparing his firm to traditional VC firms, he said they were as good or better in terms of the investing record, and as a strategic investor brought some other advantages as well. “Some of the traditional VCs are focused on a company building value. We can provide strategic guidance and compliment some of the company building over other VCs,” he said.\n Over the life of the firm, it has invested $12.9 billion in over 1,500 companies with 692 of those exiting via IPO or acquisition. Just this year, under Brooks’ leadership, the company invested $225 million so far, including 11 new investments and 26 investments in companies already in the portfolio.", "posttime": "2020-08-08 00:39:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,brooks", "title": "\n温德尔·布鲁克斯辞去英特尔资本总裁一职", "title_en": "\n\t\t\t\tWendell Brooks has resigned as president of Intel Capital\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/07/wendell-brooks-has-resigned-as-president-of-intel-capital/", "via": "", "real_tags": ["英特尔", "brooks"]}]