[{"category": "", "categoryclass": "", "imagename": "c72a91408e7830be28fd2ddf7f6ec5a1.jpg", "infoid": 1008338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "共和党参议员周二提出了非法合法访问加密数据(LAED)法案，该法案如果获得通过，将要求科技公司允许执法部门访问加密数据，以执行搜查令。\n南卡罗来纳州参议院司法委员会主席林赛·格雷厄姆(Lindsey Graham)在与共和党同僚田纳西州参议员玛莎·布莱克本(Marsha Blackburn)和阿肯色州参议员汤姆·科顿(Tom Cotton)介绍这项立法时，在一份声明中表示，恐怖分子和犯罪分子经常使用技术，无论是智能手机、应用程序还是其他手段，来协调和沟通他们的日常活动。在他声称发生过恐怖主义案件和其他涉及严重犯罪活动的事件后，执法受到了阻碍。在这份声明中，参议院司法委员会主席林赛·格雷厄姆(Lindsey Graham)与田纳西州参议员玛莎·布莱克本(Marsha Blackburn)和阿肯色州参议员汤姆·科顿(Tom Cotton)一起介绍了这项立法。\n格雷厄姆在他的声明中说：我的立场很明确：在执法部门获得必要的法院授权后，他们应该能够检索信息来帮助他们的调查。我们的立法尊重和保护守法的美国人的隐私权。这也让恐怖分子和罪犯注意到，他们再也不能躲在科技的背后来掩盖他们的踪迹了。\n这项立法实质上是要求公司通过解密或通过某些其他机制，确保直接访问加密内容。\n沙龙采访了网络安全专家，他们都认为拟议中的立法威胁到公民自由，可能会产生意想不到的后果。\n这样做的问题在于它从根本上不了解加密是如何工作的。美国公民自由联盟(American Civil Liberties Union)高级立法顾问尼玛·辛格·古利亚尼(Neema Singh Guliani)告诉沙龙，你不能只为好人创建后门。任何时候你削弱加密，你就在系统本身和产品本身的网络安全方面削弱了它。该提案与我们过去看到的类似，也类似于过去那些也被认为存在根本缺陷而被拒绝的议定书。同样，这并不能反映出公司不仅清楚了解加密的价值，而且还不清楚公司会如何做法案声称要求的事情。(工业和信息化部电子科学技术情报研究所陈皓)。\n前华盛顿邮报记者布赖恩·克雷布斯(Brian Krebs)专门报道牟利的网络罪犯，目前经营着krebsonsecurity.com网站，他也有类似的观察。\n克雷布斯告诉沙龙，我认为确实想要这种能力的政府派别真的需要小心他们的愿望。他们想要这种神奇的能力，法院命令他们可以窥视任何上了锁的数字盒子的内部，看看里面有什么。但这些雄心壮志--顺便说一句，这并不是什么新鲜事，政府某些部门几十年来一直在推动--只是误导了，因为任何沿着这些路线进行的努力都将不可避免地带来相当大的不确定性和意想不到的后果。\n他补充说，我认为你可以认为这是在要求授权检查任何数字锁的盒子。很有可能，我们会打开潘多拉的盒子。也就是说，如果授予当局同样的能力，我们的对手，无论是民族国家、有组织犯罪还是其他人，基本上都会利用或滥用同样的能力来对付我们。\n古利亚尼认为，普通美国人应该害怕这种潜在的政府越权，特别是那些出国旅行或在国内从事抗议活动的人。\n古里亚尼说，他们应该害怕，因为每个人都依赖强加密，特别是当我们这些天回到家的时候。如果人们依赖互联网和数字通信，你就需要依靠强加密来保护你免受黑客攻击，特别是当你正在抗议或在国外保护自己免受政府攻击的时候。甚至在我们在美国看到的抗议活动中，我们也看到活动人士鼓励使用强加密来确保人们的隐私。\n新美国开放技术研究所(New America‘s Open Technology Institute)高级政策分析师安迪·威尔逊·汤普森(Andi Wilson Thompson)也认为，拟议中的立法是不祥的。\n汤普森解释说：我认为这真的很危险。考虑到它试图修改的法规种类繁多，我认为这是对加密的更全面的攻击，这一事实确实令人担忧。我认为这比我们最近看到的许多事情更令人担忧，因为他们试图解决这个问题的时间和方式都是如此。\n像克雷布斯一样，她指出政府寻求这种权力已经有一段时间了。\n汤普森指出，政府，特别是司法部，几十年来一直在推动这一点，但特别是在过去的五年里，为执法人员进入市场提供后门腐败。每当发生任何类型的恐怖袭击或公共犯罪情况时，他们都可以说加密阻止了信息的访问，因为加密的电话或通信或其他东西，每次发生这种情况时，他们都会想出一个借口。\n马修·罗兹萨(Matthew Rozsa)是沙龙的特约撰稿人。他拥有罗格斯大学纽瓦克分校的历史学硕士学位，并在利哈伊大学攻读历史学博士学位。他的作品曾出现在Mic、Quartz和MSNBC上。\n更多信息来自", "note_en": "Republican senators on Tuesday introduced the Lawful Access to Encrypted Data (LAED) Act, a bill that if passed would require technology companies to allow law enforcement to access encrypted data in order to carry out their warrants.\n &#34;Terrorists and criminals routinely use technology, whether smartphones, apps, or other means, to coordinate and communicate their daily activities,&#34; Senate Judiciary Committee Chairman  Lindsey Graham of South Carolina said in a  statement while introducing the legislation with his Republican colleagues, Sens. Marsha Blackburn of Tennessee and  Tom Cotton of Arkansas. After claiming that there have been terrorism cases and other incidents involving &#34;serious criminal activity&#34; in which law enforcement was  hindered by not being able to access encrypted information, Graham accused technology companies of not honoring court orders.\n  &#34;My position is clear: After law enforcement obtains the necessary court authorizations, they should be able to retrieve information to assist in their investigations,&#34; Graham said in his statement. &#34;Our legislation respects and protects the privacy rights of law-abiding Americans. It also puts the terrorists and criminals on notice that they will no longer be able to hide behind technology to cover their tracks.&#34;\n &#34;What this legislation would do is essentially require companies to ensure access to encrypted content right there, by decrypting it or through some other mechanisms.&#34;\n Salon spoke with cybersecurity experts, all of whom agreed that the proposed legislation threatens civil liberties and could have unintended consequences.\n  &#34;The problem with that is that it fundamentally doesn&#39;t understand how encryption works. You can&#39;t create a backdoor just for &#39;good guys,&#39;&#34; Neema Singh Guliani, Senior Legislative Counsel of the American Civil Liberties Union, told Salon. &#34;Anytime you weaken encryption, you weaken it in terms of the cybersecurity of the system itself and the product itself. The proposal is similar to what we&#39;ve seen in the past and similar to those past protocols that were also rejected as fundamentally flawed. This similarly doesn&#39;t reflect a clear understanding of not only the value of encryption, but how companies would even do what the bill purports to require.&#34;\n Brian Krebs, a former Washington Post journalist who specializes in covering profit-seeking cybercriminals and runs the website  krebsonsecurity.com, had a similar observation.\n &#34;I think the factions of government that did want this capability really need to be careful what they wish for,&#34; Krebs told Salon. &#34;They want this magical ability with a court order to peer inside of any locked digital box and see what&#39;s there. But these kinds of ambitions — which are not new by the way, certain parts of the government have been pushing for this for decades — it&#39;s just misguided, because any effort along these lines is invariably going to introduce a fair amount of uncertainty and unintended consequences.&#34;\n  He added, &#34;I think you could think of it as asking for the authority to look inside any digitally locked box. In all likelihood, we&#39;ll open Pandora&#39;s box. That is to say, the same ability, if granted to the authorities, will essentially be used or abused against us by our adversaries, whether they be nation-states, organized crime or others.&#34;\n Guliani argued that ordinary Americans should be frightened of this potential government overreach, especially those who travel abroad or engage in protest activity at home.\n  &#34;They should be scared as everybody relies on strong encryption, especially when we&#39;re home these days,&#34; Guliani said. &#34;If people are relying on the internet and digital communications, you rely on strong encryption to protect you from hackers, especially if you&#39;re protesting or are abroad to protect your yourself from the government. Even in the protest we&#39;ve seen in the U S we&#39;ve seen activists encourage the use of strong encryption to make sure that people have their privacy.&#34;\n Andi Wilson Thompson, Senior Policy Analyst at New America&#39;s Open Technology Institute, also argued that the proposed legislation is ominous.\n &#34;I think it&#39;s really dangerous,&#34; Thompson explained. &#34;I think that the fact that it&#39;s a more comprehensive assault on encryption is really concerning, given the wide variety of statutes that it is trying to amend. And I think that is much more concerning than a lot of things we&#39;ve seen recently, because of both the time and the way that they&#39;re attempting to address this.&#34;\n  Like Krebs, she noted that the government has sought this kind of power for a while.\n &#34;The government, especially the Justice Department, have been pushing for this for decades, but especially for the past five years, to have backdoor corruption for law enforcement access,&#34; Thompson pointed out. &#34;Every time there was any sort of terrorist attack or public criminal situation where they can say that encryption has prevented access to information because of the encrypted phone or communications or something, every time that happens, they come up with an excuse.&#34;\n  Matthew Rozsa is a staff writer for Salon. He holds an MA in History from Rutgers University-Newark and is ABD in his PhD program in History at Lehigh University. His work has appeared in Mic, Quartz and MSNBC.\n MORE FROM", "posttime": "2020-06-26 09:59:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "加密,encryption", "title": "告别隐私：林赛·格雷厄姆(Lindsay Graham)公布了一项法案，该法案将使加密无用。一位专家说，该法案“(错误地)理解了加密的工作原理。你不能只为‘好人’创建后门。”", "title_en": "Farewell to privacy: Lindsay Graham unveils a bill that would make encryption useless. The bill \"[mis]understands how encryption works. You can't create a backdoor just for 'good guys,'\" one expert says", "transed": 1, "url": "https://www.salon.com/2020/06/25/farewell-to-privacy-lindsay-graham-unveils-a-bill-that-would-make-encryption-useless/", "via": "", "real_tags": ["加密"]}, {"category": "", "categoryclass": "", "imagename": "e76f80a3a728909b6ee5bc24d33b2964.png", "infoid": 1008337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Commodore Basic(Cbmbasic)是Commodore 64上提供的Microsoft Basic 6502版本的100%兼容版本。您可以在交互模式下使用它，也可以将基本文件作为命令行参数传递。\n此源代码不模拟6502代码；所有代码都完全是本机代码。在1 GHz的CPU上，与1 MHz的6502相比，您可以获得1000倍的速度。\n您可以在交互模式下使用cbmbasic，只需运行不带参数的二进制文件，也可以在命令行上指定一个ASCII编码的BASIC程序。您还可以将cbmbasic用作UNIX脚本语言，方法是向Basic程序添加hashbang行并使其可执行。\n$ls-l hello.bas-rwxr-xr-x 1薄雾员工40 7 4月21：30你好。bas$cat hello.bas#！/usr/bin/cbmbasicPRINT&#34；Hello World！&#34；$./hello.bas Hello world！\ncbmbasic实现了一个小插件系统，允许开发人员添加额外的语句、函数等。现在，您可以用&#34；SYS 1&#34；打开它(用&#34；SYS 0&#34；关闭)，然后使用新的语句locate y，x(设置光标位置)，系统字符串(运行命令行命令)和扩展的等待端口MASK，它实现了比尔·盖茨的复活节彩蛋。\nBASIC解释器的核心在cbmbasic.c文件中，该文件与平台、字节顺序和位无关。对于所有I/O，它都调用到runtime.c中，因此只需更改runtime.c就可以使该项目适应任何操作系统。\n核心解释器无法处理的所有函数调用都会在runtime.c中的kernaldispatch()中结束，在那里，switch语句会将这些调用分派给C函数。对于Commodore Basic，runtime.c必须支持几个Commodore内核库例程。其中一些非常重要(Chrin、CHROUT)，而另一些仅用于某些基本语句(LOAD、SAVE、OPEN、SETTIM)。runtime.c还没有实现所有函数。\n您可以随意将此项目用于任何目的，如果您愿意，可以给予表扬，如果您愿意，还可以将改进反馈给作者，这样其他人就可以从中受益。有关许可证详细信息，请参阅来源。", "note_en": "&#34;Commodore BASIC&#34; (cbmbasic) is a 100% compatible version of Commodore&#39;s version of Microsoft BASIC 6502 as found on the Commodore 64. You can use it in interactive mode or pass a BASIC file as a command line parameter.\n This source does not emulate 6502 code; all code is completely native. On a 1 GHz CPU you get about 1000x speed compared to a 1 MHz 6502.\n       You can use cbmbasic in interactive mode by just running the binary without parameters, or you can specify an ASCII-encoded BASIC program on the command line. You can also use cbmbasic as a UNIX scripting language by adding a hashbang line to your BASIC program and making it executable.\n $ ls -l hello.bas -rwxr-xr-x 1 mist staff 40 7 Apr 21:30 hello.bas$ cat hello.bas #!/usr/bin/cbmbasicPRINT&#34;HELLO WORLD!&#34;$ ./hello.bas HELLO WORLD!\n cbmbasic implements a small plugin system that lets developers add additional statements, functions etc. Right now, you can turn this on with &#34;SYS 1&#34; (turn off with &#34;SYS 0&#34;), and use the new statements LOCATE  y,  x (set cursor position), SYSTEM  string (run command line command) and the extended WAIT  port,  mask, which implements the  Bill Gates easter egg.\n  The core of the BASIC interpreter is in the file  cbmbasic.c, which is platform, endianness and bitness independent. For all I/O, it calls out into  runtime.c, so it should be possible to adapt this project for any OS by just changing  runtime.c.\n All function calls that the core interpreter can&#39;t handle end up in kernal_dispatch() in  runtime.c, where a switch statement dispatches these to C functions. For Commodore BASIC,  runtime.c has to support several Commodore KERNAL library routines. Some of them are very important (CHRIN, CHROUT) and some are only used for certain BASIC statements (LOAD, SAVE, OPEN, SETTIM).  runtime.c does not implement all functions yet.\n  Feel free to use this project for any purpose, give credit if you like, and send back improvements to the authors, if you like, so that others can benefit from it. See source for license details.", "posttime": "2020-06-26 09:58:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "commodore,basic", "title": "作为脚本语言的Commodore BASIC", "title_en": "Commodore Basic as a Scripting Language", "transed": 1, "url": "https://github.com/mist64/cbmbasic", "via": "", "real_tags": ["commodore", "basic"]}, {"category": "", "categoryclass": "", "imagename": "73b9e21509039d3d6b080567c37e0a09.png", "infoid": 1008336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "in是一个面向控制台的天气预报服务，它支持各种信息表示方法，如控制台HTTP客户端(cURL、HTTPI或wget)的面向终端的ANSI序列、Web浏览器的HTML或图形查看器的PNG。\n您可以通过Shell或Web浏览器访问该服务，如下所示：\n$curl wttr.in城市天气：法国巴黎\\/晴朗。-.10-11°C-()-↑11公里/小时`-‘10公里/\\0.0毫米。\n(这不是你的实际位置--GitHub的CDN用自己的IP地址隐藏了你的真实IP地址，但它仍然是用你的语言发布的实时天气预报。)。\n想要获取特定位置的天气信息吗？您可以将所需位置添加到请求中的URL，如下所示：\n如果省略位置名称，您将获得基于您的IP地址的当前位置报告。\n使用3个字母的机场代码获取某机场的天气信息：\n$curl wttr.in/muc#国际航空运输协会的天气：德国慕尼黑国际机场MUC$curl wttr.in/ham#国际航空运输协会的天气：火腿，德国汉堡机场\n比方说，你想要了解一个城镇或城市以外的地理位置的天气--也许是一个城市、一个山名或某个特殊地点的一个吸引人的地方。在名称前添加字符~，以便在随后检索天气之前查找该指定分配名称：\n对于这些示例，您将在天气预报输出下面看到一条线，它显示了查找位置的地理位置结果：\n位置：станцияВосток，AAT，南极洲沃斯托克站[-78.4642714,106.8364678]地点：法国阿纳托尔大道5号，格罗斯-凯洛，7E，巴黎，法兰西岛，75007，法国[48.8582602，2.29449905432]地点：坦桑尼亚北部乞力马扎罗[-3.4762789，37.3872648]。\n您还可以使用IP地址(直接)或域名(前缀为@)指定位置：\n默认情况下，USCS单位用于来自美国的查询和世界其他地区的公制查询。您可以通过向URL添加“U”或“M”来覆盖此行为，如下所示：\n根据User-Agent字符串选择ANSI和HTML格式。可以通过在查询末尾添加.png来强制使用PNG格式：\n您可以将所有选项与png格式一起使用，就像在URL中一样，但是您必须用_而不是？分隔它们。和&amp；：\n当使用天气PNG向图片添加天气数据时，透明度是一个有用的功能：\n您可以使用wtr-switcher将一个特殊的wttr.in小部件嵌入到HTML页面中，该小部件显示当前或选定位置的天气状况。这就是它看起来的样子：wtr-Switcher-示例或在现实世界的网站上：https://feuerwehr-eisolzried.de/.。\n可用的预配置格式：1、2、3、4和使用百分比表示法的自定义格式(见下文)。\n$curl-s&39；wttr.in/{纽伦堡，汉堡，柏林}？格式=3&#39；纽伦堡：🌦+11⁰昌堡：🌦+8⁰C柏林：🌦+8⁰C。\nc天气条件，C天气条件文字名称，h湿度，t温度(实际)，f温度(感觉像)，w风，l位置，m月相🌑🌒🌓🌔🌕🌖🌗🌘，M月日，p降水量(Mm)，o降水概率，P气压(百帕)，D黎明*，S日出*，z天顶*，s日落*，d黄昏*。(时间显示在当地时区)。\n$curl wttr.in/London？Format=3伦敦：⛅️+7⁰C$curl wttr.in/London？Format=&#34；%l：+%c+%t&#34；伦敦：⛅️+7⁰C。\n请记住，在tmux.conf中使用时，必须将%转义为%，即在那里写入%%而不是%。\n在自动查询服务的程序(如tmux)中，最好使用一些合理的更新间隔。在tmux中，您可以使用status-interval对其进行配置。\n如果在查询中指定了几个、：分隔的位置，请将更新周期指定为附加查询参数PERIOD=：\n对于Emoji字体，我们推荐Noto Color Emoji，一个很好的选择是Emoji One字体；这两种字体都支持所有必要的Emoji字形。\n$cat~/.config/fonts.cong/fonts.conf&lt；？xml版本=&#34；1.0&#34；编码=&#34；UTF-8&#34；？&gt；&lt；！DOCTYPE字体配置系统&#34；fonts.dtd&34；&gt；&lt；fontconfig&gt；&lt；别名&gt；&lt；family&gt；serif&。/首选&gt；&lt；/alias&gt；&lt；alias&gt；&lt；family&gt；sans-serif&lt；/family&gt；&lt；首选&gt；&lt；家族&gt；Noto Color Emoji&lt；/family&gt；&lt；/首选&gt；&lt；/alias&gt；&lt；/alias&gt；&lt；别名&gt；&lt；Noto Color Emoji&lt；/Family&gt；&lt；/Preference&gt；&lt；/alias&gt；&lt；/fontconfig&gt；\n在视图代码v2下提供的实验数据丰富的输出格式中，可以获得大量额外的天气和天文信息：\n根据您的配置，您可能采取所有步骤，也可能只采取几个步骤。目前URXVT不支持与表情符号相关的字体，但我们可以使用Font-Symbola获得几乎相同的效果。因此，将以下行添加到您的.Xresources文件：\n您可以将其添加到首选字体之后，只有在需要时才会显示。然后，如果您看到或感觉自己遇到了间距问题，请添加以下内容：URxvt.letterSpace：0出于某种原因，URXVT有时会停止决定正确的单词间距，我们需要强制执行此操作。\nJSON格式是一种功能，它通过易于解析的格式提供对wttr.in数据的访问，而不需要用户创建复杂的脚本来重新解释wttr.in的图形输出。\n这将以JSON格式获取有关底特律地区的信息。J1格式代码用于允许将其他布局用于JSON输出。\n{&#34；Current_Condition&#34；：[{&#34；FeelsLikeC&#34；：&#34；25&#34；，&#34；FeelsLikeF&#34；：&#34；76&#34；，&#34；Cloudcover&#34；：&#34；100&#34；，&#34；湿度&#34；：&#34；76&#34；，&#34；观察时间&#34；：&。，&#34；沉淀MM&#34；：&#34；0.2&#34；，&#34；压力&#34；：&#34；1019&#34；，&#34；温度_C&#34；：&#34；22&#34；，&#34；温度_F&#34；：&#34；72&#34；，&#34；uvIndex&#34；：5，&#34；可见性&#34；：&#34；16&##。，&#34；weatherCode&#34；：&#34；122&#34；，&#34；weatherDesc&#34；：[{&#34；value&#34；：&#34；overcast&#34；}]，&#34；weatherIconUrl&#34；：[{&#34；value&#34；：&#34；&#34；}]，&#34；windir16Point&#34；：&#34；nne&#。windirDegree&#34；：&#34；20&#34；，&#34；winspeedKmph&#34；：&#34；7&#34；，&#34；winspeedMiles&#34；：&#34；4&#34；}]，.\n除了weatherCode之外，这些值中的大多数都是不言而喻的。weatherCode是一个枚举，您可以在WorldWeatherOnline网站或wttr.in源代码中找到它。\nPrometheus Metrics格式是一种功能，可通过易于解析的格式为监控系统提供对WTR.IN数据的访问，而无需用户创建复杂的脚本来重新解释WTTR.IN的图形输出。\n这将以普罗米修斯指标格式获取有关底特律地区的信息。p1格式代码用于允许使用普罗米修斯公制输出的其他布局。\n#Help Temperature_Feel_Like_摄氏度感觉像Celsiustemperature_feels_like_celsius{forecast=&#34；current&#34；}7中的温度#Help Temperature_Feel_Like_Fahrenheit感觉像Fahrenheittemperature_feels_like_fahrenheit{forecast=&#34；current&#34；}45中的温度[截断]。\nwttr.in还可以用来检查月相。此示例说明如何在完全输出模式下查看当前月相：\n对于某些字体，🌘的表示是模棱两可的，因为它看起来要么几乎是阴影的，要么几乎是亮的，这取决于你的终端是亮模式还是暗模式。依靠彩色字体(如Noto-Fonts)可以解决此问题。\n代表🌘也是模棱两可的，因为它在北半球的意思是最后一个季度，但在南半球是第一季度的意思。在热带地区，它也不意味着什么。这是Unicode知道的一个限制，但是在wttr.in中还没有解决这个问题。\n有关相应的跟踪问题，请参见#247、#364，有关Pyphoon的信息，请参阅Pyphoon#1。欢迎任何帮助。\nin支持可以用世界上任何语言指定的多语言地点名称(这可能令人惊讶，但世界上许多地点都没有英文名称)。\n查询字符串应以Unicode(十六进制编码或非十六进制编码)指定。查询字符串中的空格必须替换为+：\n$curl wttr.in/станция+Восток天气报告：станцияВосток阴天。-65--47°C。-()。↑23公里/小时(_.__)__)15公里0.0毫米。\n用于输出的语言(位置名称除外)不依赖于输入语言，它要么是英语(默认情况下)，要么是在查询标头中指定的浏览器的首选语言(如果查询是从浏览器发出的)(Accept-Language)。\n使用Console客户端时，可以使用如下命令行选项显式设置语言：\n第三个选项是使用查询中使用的DNS名称选择语言：\nwttr.in目前被翻译成54种语言，而且支持的语言数量还在不断增加。\n请参阅/：翻译以了解有关翻译过程的更多信息，查看支持的语言和贡献者列表，或了解如何帮助将wttr.in翻译为您的语言。\n当前存在两个与Windows相关的问题，它们会阻止本页上的示例开箱即用，无法完全按照预期工作。在微软解决这些问题之前，有几个解决办法。要绕过这两个问题，您可以在Windows Subsystem for Linux(WSL)上使用诸如bash之类的shell，或者继续阅读其他解决方案。\n当前的Win32版本的cURL是有限制的。在未来的Windows版本中解决并推出Win32 cURL问题之前，建议您改用Powershell的Invoke-Web-Request命令：\n第二个问题与某些Windows终端应用程序(如默认的conhost.exe)使用的对角箭头图示符的宽度有关。在撰写本文时，ConEmu.exe、ConEmu64.exe和构建在ConEmu之上的终端应用程序(如Cmder(cmder.exe))默认使用这些双宽字形。所有这些程序的结果都是一样的，要么是某些风向缺少字符，要么是输出中的表格损坏，或者两者兼而有之。某些第三方终端应用程序已经解决了风向图示符问题，但修复方法取决于您使用的字体和终端应用程序。在终端应用程序中显示对角线风向图示符的一种方法是使用当前在Microsoft应用商店中提供的Windows终端。Windows终端目前是一个预览版，将在即将发布的版本中作为默认终端应用程序推出。如果使用Windows终端后输出仍有偏差，请尝试最大化终端窗口。另一种显示对角线风向的方法是使用正斜杠和反斜杠替换有问题的字符，如下所示。\n如果您想以PNG文件格式获取天气报告，您还需要安装：\n此外，您还需要安装Geoip2数据库。您可以使用可从(http://dev.maxmind.com/geoip/geoip2/geolite2/).)下载的免费数据库GeoLite2。\n如果要对GeoLite2未覆盖的IP地址使用IP2Location服务，则必须获取该服务的API密钥，然后保存到~/.ip2location.key文件中：\n如果您没有这个文件，该服务将被自动跳过(这不是一个大问题，因为MaxMind数据库非常好)。\n拥有WorldWeatherOnline密钥后，可以将其保存到WWO密钥文件中：~/.wwo.key\n配置以下环境变量，它们定义本地wttr.ininstall、GeoLite数据库和Wego安装的路径。例如：\n建议您还配置将用于访问该服务的Web服务器：\nserver{Listen[：：]：80；server_name wttr.in*.wttr.in；access_log/var/log/nginx/wttr.in-access.log main；error_log/var/log/nginx/wttr.in-error.log；Location/{Proxy_Pass http://127.0.0.1:8002；Proxy_Set_Header Host$HOST；Proxy_Set_Header X-Real-IP$Remote_Addr；Proxy_Set_Header X-Forwarded-for$Remote_addr。CLIENT_BODY_BUFFER_SIZE 128k；PROXY_CONNECT_TIMEOUT 90；PROXY_SEND_TIMEOUT 90；PROXY_READ_TIMEOUT 90；PROXY_BUFFER_SIZE 4K；Proxy_Buffers 4 32k；PROXY_BUSY_BUFFER_SIZE 64k", "note_en": "wttr.in is a console-oriented weather forecast service that supports various informationrepresentation methods like terminal-oriented ANSI-sequences for console HTTP clients(curl, httpie, or wget), HTML for web browsers, or PNG for graphical viewers.\n    You can access the service from a shell or from a Web browser like this:\n $ curl wttr.inWeather for City: Paris, France \\ / Clear .-. 10 – 11 °C ― ( ) ― ↑ 11 km/h `-’ 10 km / \\ 0.0 mm\n   (It&#39;s not your actual location - GitHub&#39;s CDN hides your real IP address with its own IP address,but it&#39;s still a live weather report in your language.)\n   Want to get the weather information for a specific location? You can add the desired location to the URL in yourrequest like this:\n  If you omit the location name, you will get the report for your current location based on your IP address.\n Use 3-letter airport codes in order to get the weather information at a certain airport:\n $ curl wttr.in/muc # Weather for IATA: muc, Munich International Airport, Germany$ curl wttr.in/ham # Weather for IATA: ham, Hamburg Airport, Germany\n Let&#39;s say you&#39;d like to get the weather for a geographical location other than a town or city - maybe an attractionin a city, a mountain name, or some special location. Add the character  ~ before the name to look up that speciallocation name before the weather is then retrieved:\n  For these examples, you&#39;ll see a line below the weather forecast output that shows the geolocationresults of looking up the location:\n Location: Vostok Station, станция Восток, AAT, Antarctica [-78.4642714,106.8364678]Location: Tour Eiffel, 5, Avenue Anatole France, Gros-Caillou, 7e, Paris, Île-de-France, 75007, France [48.8582602,2.29449905432]Location: Kilimanjaro, Northern, Tanzania [-3.4762789,37.3872648]\n You can also use IP-addresses (direct) or domain names (prefixed with  @) to specify a location:\n     By default the USCS units are used for the queries from the USA and the metric system for the rest of the world.You can override this behavior by adding  ?u or  ?m to a URL like this:\n     The ANSI and HTML formats are selected basing on the User-Agent string.The PNG format can be forced by adding  .png to the end of the query:\n  You can use all of the options with the PNG-format like in an URL, but you haveto separate them with  _ instead of  ? and  &amp;:\n    Transparency is a useful feature when weather PNGs are used to add weather data to pictures:\n     You can embed a special wttr.in widget, that displays the weather condition for the current or a selected location, into a HTML page using the  wttr-switcher. That is how it looks like:  wttr-switcher-example or on a real world web site:  https://feuerwehr-eisolzried.de/.\n     Available preconfigured formats: 1, 2, 3, 4 and the custom format using the percent notation (see below).\n    $ curl -s &#39;wttr.in/{Nuremberg,Hamburg,Berlin}?format=3&#39;Nuremberg: 🌦 +11⁰CHamburg: 🌦 +8⁰CBerlin: 🌦 +8⁰C\n  c Weather condition, C Weather condition textual name, h Humidity, t Temperature (Actual), f Temperature (Feels Like), w Wind, l Location, m Moonphase 🌑🌒🌓🌔🌕🌖🌗🌘, M Moonday, p precipitation (mm), o Probability of Precipitation, P pressure (hPa), D Dawn*, S Sunrise*, z Zenith*, s Sunset*, d Dusk*.(times are shown in the local timezone)\n  $ curl wttr.in/London?format=3 London: ⛅️ +7⁰C $ curl wttr.in/London?format=&#34;%l:+%c+%t&#34; London: ⛅️ +7⁰C\n Keep in mind, that when using in  tmux.conf, you have to escape  % with  %, i.e. write there  %% instead of  %.\n In programs, that are querying the service automatically (such as tmux), it is better to use some reasonable update interval. In tmux, you can configure it with  status-interval.\n If several,  : separated locations, are specified in the query, specify update periodas an additional query parameter  period=:\n     For the Emoji font, we recommend  Noto Color Emoji, and a good alternative option would be the  Emoji One font;both of them support all necessary emoji glyphs.\n  $ cat ~/.config/fontconfig/fonts.conf&lt;?xml version=&#34;1.0&#34; encoding=&#34;UTF-8&#34;?&gt;&lt;!DOCTYPE fontconfig SYSTEM &#34;fonts.dtd&#34;&gt;&lt;fontconfig&gt; &lt;alias&gt; &lt;family&gt;serif&lt;/family&gt; &lt;prefer&gt; &lt;family&gt;Noto Color Emoji&lt;/family&gt; &lt;/prefer&gt; &lt;/alias&gt; &lt;alias&gt; &lt;family&gt;sans-serif&lt;/family&gt; &lt;prefer&gt; &lt;family&gt;Noto Color Emoji&lt;/family&gt; &lt;/prefer&gt; &lt;/alias&gt; &lt;alias&gt; &lt;family&gt;monospace&lt;/family&gt; &lt;prefer&gt; &lt;family&gt;Noto Color Emoji&lt;/family&gt; &lt;/prefer&gt; &lt;/alias&gt;&lt;/fontconfig&gt;\n   In the experimental data-rich output format, that is available under the view code  v2,a lot of additional weather and astronomical information is available:\n            Depending on your configuration you might be taking all steps, or only a few. URXVT currenly doesn&#39;t support emoji related fonts, but we can get almost the same effect using  Font-Symbola. So add to your  .Xresources file the following line:\n  You can add it  after your preferred font and it will only show up when required.Then, if you see or feel like you&#39;re having spacing issues, add this:  URxvt.letterSpace: 0For some reason URXVT sometimes stops deciding right the word spacing and we need to force it this way.\n     The JSON format is a feature providing access to  wttr.in data through an easy-to-parse format, without requiring the user to create a complex script to reinterpret wttr.in&#39;s graphical output.\n   This will fetch information on the Detroit region in JSON format. The j1 format code is used to allow for the use of other layouts for the JSON output.\n  {&#34;current_condition&#34;: [ { &#34;FeelsLikeC&#34;: &#34;25&#34;, &#34;FeelsLikeF&#34;: &#34;76&#34;, &#34;cloudcover&#34;: &#34;100&#34;, &#34;humidity&#34;: &#34;76&#34;, &#34;observation_time&#34;: &#34;04:08 PM&#34;, &#34;precipMM&#34;: &#34;0.2&#34;, &#34;pressure&#34;: &#34;1019&#34;, &#34;temp_C&#34;: &#34;22&#34;, &#34;temp_F&#34;: &#34;72&#34;, &#34;uvIndex&#34;: 5, &#34;visibility&#34;: &#34;16&#34;, &#34;weatherCode&#34;: &#34;122&#34;, &#34;weatherDesc&#34;: [ { &#34;value&#34;: &#34;Overcast&#34; } ], &#34;weatherIconUrl&#34;: [ { &#34;value&#34;: &#34;&#34; } ], &#34;winddir16Point&#34;: &#34;NNE&#34;, &#34;winddirDegree&#34;: &#34;20&#34;, &#34;windspeedKmph&#34;: &#34;7&#34;, &#34;windspeedMiles&#34;: &#34;4&#34; }],...\n Most of these values are self-explanatory, aside from  weatherCode. The  weatherCode is an enumeration which you can find at either  the WorldWeatherOnline website or  in the wttr.in source code.\n  The  Prometheus Metrics format is a feature providing access to  wttr.in data through an easy-to-parse format for monitoring systems, without requiring the user to create a complex script to reinterpret wttr.in&#39;s graphical output.\n   This will fetch information on the Detroit region in Prometheus Metrics format. The  p1 format code is used to allow for the use of other layouts for the Prometheus Metrics output.\n    # HELP temperature_feels_like_celsius Feels Like Temperature in Celsiustemperature_feels_like_celsius{forecast=&#34;current&#34;} 7# HELP temperature_feels_like_fahrenheit Feels Like Temperature in Fahrenheittemperature_feels_like_fahrenheit{forecast=&#34;current&#34;} 45[truncated]\n   wttr.in can also be used to check the phase of the Moon. This example shows how to see the current Moon phasein the full-output mode:\n        With some fonts, the representation  🌘 is ambiguous, for it either seemalmost-shadowed or almost-lit, depedending on whether your terminal is inlight mode or dark mode. Relying on colored fonts like  noto-fonts worksaround this problem.\n The representation  🌘 is also ambiguous, for it means &#34;last quarter&#34; innorthern hemisphere, but &#34;first quarter&#34; in souther hemisphere. It also meansnothing in tropical zones. This is a limitation that Unicode is aware about.But it has not been worked around at  wttr.in yet.\n See #247, #364 for the corresponding tracking issues,and  pyphoon#1 for pyphoon. Any help is welcome.\n  wttr.in supports multilingual locations names that can be specified in any language in the world(it may be surprising, but many locations in the world don&#39;t have an English name).\n The query string should be specified in Unicode (hex-encoded or not). Spaces in the query stringmust be replaced with  +:\n $ curl wttr.in/станция+ВостокWeather report: станция Восток Overcast .--. -65 – -47 °C .-( ). ↑ 23 km/h (___.__)__) 15 km 0.0 mm\n The language used for the output (except the location name) does not depend on the input languageand it is either English (by default) or the preferred language of the browser (if the querywas issued from a browser) that is specified in the query headers ( Accept-Language).\n The language can be set explicitly when using console clients by using command-line options like this:\n    The third option is to choose the language using the DNS name used in the query:\n  wttr.in is currently translated into 54 languages, and the number of supported languages is constantly growing.\n See  /:translation to learn more about the translation process,to see the list of supported languages and contributors, or to know how you can help to translate wttr.inin your language.\n   There are currently two Windows related issues that prevent the examples found on this page from working exactly as expected out of the box. Until Microsoft fixes the issues, there are a few workarounds. To circumvent both issues you may use a shell such as  bash on the  Windows Subsystem for Linux (WSL) or read on for alternative solutions.\n  There is a limitation of the current Win32 version of  curl. Until the  Win32 curl issue is resolved and rolled out in a future Windows release, it is recommended that you use Powershell’s  Invoke-Web-Request command instead:\n   The second issue is regarding the width of the diagonal arrow glyphs that some Windows Terminal Applications such as the default  conhost.exe use. At the time of writing this,  ConEmu.exe,  ConEmu64.exe and Terminal Applications built on top of ConEmu such as Cmder ( cmder.exe) use these double-wide glyphs by default. The result is the same with all of these programs, either a missing character for certain wind directions or a broken table in the output or both. Some third-party Terminal Applications have addressed the wind direction glyph issue but that fix depends on the font and the Terminal Application you are using.One way to display the diagonal wind direction glyphs in your Terminal Application is to use  Windows Terminal which is currently available in the  Microsoft Store. Windows Terminal is currently a preview release and will be rolled out as the default Terminal Application in an upcoming release. If your output is still skewed after using Windows Terminal then try maximizing the terminal window.Another way you can display the diagonal wind direction is to swap out the problematic characters with forward and backward slashes as shown  here.\n            If you want to get weather reports as PNG files, you&#39;ll also need to install:\n       Also, you need to install the geoip2 database.You can use a free database GeoLite2 that can be downloaded from ( http://dev.maxmind.com/geoip/geoip2/geolite2/).\n  If you want to use the IP2location service for IP-addresses that are not covered by GeoLite2,you have to obtain a API key of that service, and after that save into the  ~/.ip2location.key file:\n  If you don&#39;t have this file, the service will be silently skipped (it is not a big problem,because the MaxMind database is pretty good).\n    After you have a WorldWeatherOnline key, you can save it into theWWO key file:  ~/.wwo.key\n     Configure the following environment variables that define the path to the local  wttr.ininstallation, to the GeoLite database, and to the  wego installation. For example:\n   It&#39;s recommended that you also configure the web server that will be used to access the service:\n server { listen [::]:80; server_name wttr.in *.wttr.in; access_log /var/log/nginx/wttr.in-access.log main; error_log /var/log/nginx/wttr.in-error.log; location / { proxy_pass http://127.0.0.1:8002; proxy_set_header Host $host; proxy_set_header X-Real-IP $remote_addr; proxy_set_header X-Forwarded-For $remote_addr; client_max_body_size 10m; client_body_buffer_size 128k; proxy_connect_timeout 90; proxy_send_timeout 90; proxy_read_timeout 90; proxy_buffer_size 4k; proxy_buffers 4 32k; proxy_busy_buffers_size 64k; proxy_temp_file_write_size 64k; expires off; }}", "posttime": "2020-06-26 09:56:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "卷曲,curl", "title": "卷曲Wttr.in", "title_en": "Curl Wttr.in", "transed": 1, "url": "https://github.com/chubin/wttr.in", "via": "", "real_tags": ["卷曲", "curl"]}, {"category": "", "categoryclass": "", "imagename": "f009ed3be9fa0fa52d888112d4df4382.jpg", "infoid": 1008335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人脑利用成对的眼睛和耳朵的输入之间的细微差异来构建三维体验和导航环境。尽管人类也有两个独立的鼻道，同时从太空中不重叠的区域取样，但它是否以及如何影响嗅觉尚不清楚。在这里，我们证明，鼻孔间气味强度的适度差异始终会使受试者感知到的自我运动方向偏向浓度较高的一侧，尽管他们无法报告哪个鼻孔的气味更强烈。这些发现表明，人类有一种潜意识中引导导航的立体嗅觉。人类导航依赖于我们成对的眼睛和耳朵的输入。虽然我们也有两个鼻道，但几乎没有经验表明鼻孔间的差异会导致人类嗅觉的方向性，而不涉及三叉神经系统。通过使用光流捕捉视觉场景中表面元素的表观运动模式，我们通过正式的心理物理测试证明，非三叉神经气味的适度二线浓度差异始终会使受试者感知到的自我运动方向偏向浓度较高的一侧，尽管他们无法用语言表达哪个鼻孔气味更强烈。我们进一步表明，这种影响取决于鼻孔间气味浓度的比率，而不是两个鼻孔之间浓度的数值差异。综上所述，我们的发现提供了行为证据，证明人类通过立体嗅觉嗅觉，并在空间导航中下意识地利用立体嗅觉线索。", "note_en": "The human brain exploits subtle differences between the inputs to the paired eyes and ears to construct three-dimensional experiences and navigate the environment. Whether and how it does so for olfaction is unclear, although humans also have two separate nasal passages that simultaneously sample from nonoverlapping regions in space. Here, we demonstrate that a moderate internostril difference in odor intensity consistently biases recipients’ perceived direction of self-motion toward the higher-concentration side, despite that they cannot report which nostril smells a stronger odor. The findings indicate that humans have a stereo sense of smell that subconsciously guides navigation.Human navigation relies on inputs to our paired eyes and ears. Although we also have two nasal passages, there has been little empirical indication that internostril differences yield directionality in human olfaction without involving the trigeminal system. By using optic flow that captures the pattern of apparent motion of surface elements in a visual scene, we demonstrate through formal psychophysical testing that a moderate binaral concentration disparity of a nontrigeminal odorant consistently biases recipients’ perceived direction of self-motion toward the higher-concentration side, despite that they cannot verbalize which nostril smells a stronger odor. We further show that the effect depends on the internostril ratio of odor concentrations and not the numeric difference in concentration between the two nostrils. Taken together, our findings provide behavioral evidence that humans smell in stereo and subconsciously utilize stereo olfactory cues in spatial navigation.", "posttime": "2020-06-26 09:36:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "立体,navigate,导航", "title": "人类用立体嗅觉导航", "title_en": "Humans Navigate with Stereo Olfaction", "transed": 1, "url": "https://www.pnas.org/content/early/2020/06/17/2004642117", "via": "", "real_tags": ["立体", "navigate", "导航"]}, {"category": "", "categoryclass": "", "imagename": "efb9fc988104764d487cb1e8880168db.jpeg", "infoid": 1008334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着官员们考虑采取措施解决警察的暴行和种族主义问题，加利福尼亚州的圣克鲁斯成为美国第一个禁止预测性警务的城市，数字权利专家表示，这可能会在全美范围内引发类似的行动。市长贾斯汀·卡明斯(Justin Cummings)周三表示，在理解预测性警务和面部识别如何对有色人种存在严重偏见之后，我们正式禁止在圣克鲁斯市使用这些技术。尽管他的政府将与警方合作，“帮助消除警务中的种族主义”，但市长贾斯汀·卡明斯(Justin Cummings)周三表示，我们已经正式禁止在圣克鲁斯市使用这些技术。他的政府将与警方合作，“帮助消除警务中的种族主义”，市长贾斯汀·卡明斯(Justin Cummings)周三表示。经过周二晚上的投票。美国各地的警方已经使用了近十年的预测性警务，它依靠算法来解读警方记录，分析逮捕或假释数据，派遣警察瞄准慢犯，或者识别可能发生犯罪的地方。但批评人士表示，它强化了种族主义的警务模式-低收入的少数族裔社区历史上一直被过度警戒，所以数据显示它们是犯罪热点，导致向这些地区部署更多警察。“正如圣克鲁斯正确认识到的那样，预测性警务是正确的。”美国公民自由联盟的一名律师。\n总部位于圣克鲁斯的PredPol公司是这项技术的先驱，该公司表示，它支持城市决议的要求，即预测性警务“不会使偏见永久化”，以及其他标准。\n“鉴于美国种族不平等的制度化状态，这是一个合法的过滤器，适用于公共实体获得的任何新技术，无论是否用于公共安全，”该公司周二在Twitter上表示。\n波士顿市议会周三投票禁止人脸监控技术，此举也受到数字维权人士的欢迎。", "note_en": "As officials mull steps to tackle police brutality and racism, California’s Santa Cruz has become the first U.S. city to ban predictive policing, which digital rights experts said could spark similar moves across the country.   “Understanding how predictive policing and facial recognition can be disportionately biased against people of color, we officially banned the use of these technologies in the city of Santa Cruz,” Mayor Justin Cummings said on Wednesday.   His administration will work with the police to “help eliminate racism in policing”, the seaside city’s first male African-American mayor said on his Facebook page, following a vote on Tuesday evening.   Used by police across the United States for almost a decade, predictive policing relies on algorithms to interpret police records, analyzing arrest or parole data to send officers to target chronic offenders, or identifying places where crime may occur.   But critics says it reinforces racist patterns of policing - low-income, ethnic minority neighbourhoods have historically been overpoliced so the data shows them as crime hotspots, leading to the deployment of more police to those areas.   “As Santa Cruz rightly recognized, predictive policing and facial recognition are dangerous, racially biased technologies that should never be used by our government,” said Matt Cagle, a lawyer with the ACLU.\n PredPol Inc, the Santa Cruz-headquartered firm that pioneered the technology, said that it supported the city resolution’s requirement that predictive policing “will not perpetuate bias”, among other criteria.\n “Given the institutionalized state of racial inequality in America, this is a legitimate filter to be applied to any new technology acquired by a public entity, whether used for public safety or not,” it said on Twitter on Tuesday.\n Boston’s city council on Wednesday voted to ban face surveillance technology, a move also welcomed by digital rights activists.", "posttime": "2020-06-26 09:17:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "禁止,cruz,表示", "title": "圣克鲁斯禁止预测性警务", "title_en": "Santa Cruz bans predictive policing", "transed": 1, "url": "https://www.santacruzworks.org/news/santa-cruz-is-the-first-city-to-city-ban-predictive-policing", "via": "", "real_tags": ["禁止", "cruz", "表示"]}, {"category": "", "categoryclass": "", "imagename": "db94f1774d5e33ed4f528ae27814f51e.jpeg", "infoid": 1008333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "投资者今年正在应对痛苦，但吉姆·西蒙斯(Jim Simons)和复兴科技公司(Renaissance Technologies LLC)正在积累如此巨大的收益，以至于2020年可能是这家对冲基金公司有史以来表现最好的年份之一。\n据投资者说，这家总部位于长岛的公司的旗舰对冲基金Medallion今年截至4月14日已经上涨了24%。这一表现在一定程度上要归功于3月份9.9%的涨幅，3月份对全球股市来说是残酷的一个月。即使在收取了高额的投资者手续费之后，Medallion还是获得了收益，其中包括从所有交易收益中提取36%或更多的提成，以及", "note_en": "Investors are dealing with pain this year, but Jim Simons and Renaissance Technologies LLC are racking up such huge gains that 2020 could be one of the hedge-fund firm’s best years ever.\n  The Long Island-based firm‘s flagship Medallion hedge fund has risen 24% this year through April 14, according to investors. The performance is thanks in part to a 9.9% gain in March, a brutal month for global stock markets. Medallion’s gains come even after its hefty investor fees, which include a cut of 36% or more of all trading gains and...", "posttime": "2020-06-26 09:15:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基金,fund", "title": "文艺复兴100亿美元的勋章基金今年迄今在动荡的市场中获得了24%的收益", "title_en": "Renaissance's $10B Medallion Fund Gains 24% Year to Date in Tumultuous Market", "transed": 1, "url": "https://www.wsj.com/articles/renaissance-s-10-billion-medallion-fund-gains-24-year-to-datein-tumultuous-market-11587152401", "via": "", "real_tags": ["基金", "fund"]}, {"category": "", "categoryclass": "", "imagename": "05ad1c3f0c00bf1b7dc0439ed9298590.jpeg", "infoid": 1008331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据评论网站Yelp Inc.的数据，由于危机继续颠覆商业，在新冠肺炎大流行期间关闭的大多数企业本月仍然关闭。\nYelp还发现，在乔治·弗洛伊德(George Floyd)被杀后的种族平等运动中，人们对支持黑人拥有的企业的兴趣激增。", "note_en": "The majority of businesses that closed during the Covid-19 pandemic remained shut this month as the crisis continued to upend commerce, according to data from review site Yelp Inc.\n  Yelp also found a surging interest in supporting black-owned businesses amid racial-equality activism following the killing of George Floyd.", "posttime": "2020-06-26 09:14:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "yelp,listed,企业", "title": "由于新冠肺炎大流行，Yelp上上市的140,000家企业仍在关闭", "title_en": "140,000 Businesses Listed on Yelp Are Still Closed Because of Covid-19 Pandemic", "transed": 1, "url": "https://www.wsj.com/articles/140-000-businesses-listed-on-yelp-are-still-closed-because-of-covid-19-pandemic-11593057601", "via": "", "real_tags": ["yelp", "listed", "企业"]}, {"category": "", "categoryclass": "", "imagename": "f37991bedb6446a1a105f2cb1acbf7a8.jpg", "infoid": 1008330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，国会中的四名进步人士宣布，他们将引入全面立法，在全国范围内有效禁止政府使用面部识别和其他生物识别技术，理由是隐私权受到威胁，以及此类工具存在公认的缺陷。这一举措受到了公民自由倡导者的欢呼。\n面部识别和生物识别技术暂停法案(PDF)由马萨诸塞州参议员埃德·马基(Ed Markey)发起。和杰夫·默克利(D-Ore.)。和众议员Pramila Jayapal(D-Wash.)。和阿亚娜·普雷斯利(马萨诸塞州民主党人)。\n该法案得到了几个倡导团体的支持，包括美国公民自由联盟、改变的颜色、电子前沿基金会和为未来而战。\n面部识别是对付暴政的完美技术。它使歧视性警察自动化，并加剧了我们严重种族主义的刑事司法系统中现有的不公正，宣布为未来而战的副主任埃文·格里尔(Evan Greer)。\n她补充说，这项法案正是我们现在所需要的，该提案得到了该组织的全力支持。\n我们有千载难逢的机会让立法者最终完成他们的工作，并在整个美国范围内#BanFacialRecognition。但我们需要向国会发送大量电子邮件，并点亮他们的电话，要求他们通过这项法案。立即在https://t.co/lXUm7DnWco采取行动。\n格里尔继续说，国会应该尽快通过这项法案，并敦促担心隐私问题的共和党议员支持该法案。一旦这项法案获得通过，国会应该迅速采取行动，通过立法，禁止公司、学校和其他私人机构将面部识别用于监视目的。\n格里尔的组织长期以来一直呼吁全面禁止面部识别，他还表示，面部识别就像核武器或生物武器。它对人类社会的未来构成了如此大的威胁，以至于任何潜在的好处都超过了不可避免的危害。这种本质上压抑的技术不能被改革或监管。它应该被废除。&#34；\n禁止联邦实体使用面部识别技术，只有通过国会法案才能解除；\n禁止联邦实体使用其他生物识别技术，包括语音识别、门禁识别和其他不变的物理特征识别，只有国会法案才能解除这一禁令；\n向州和地方实体(包括执法部门)提供联邦赠款资金的条件是，这些实体自行颁布暂停使用面部识别和生物识别技术的法令；\n禁止在任何司法程序中违反该法使用通过生物识别技术收集的信息；\n包括针对其生物特征数据被违反该法使用的个人的私人诉讼权利，并允许州总检察长强制执行；以及。\n允许各州和地方就面部识别和生物识别技术的使用制定自己的法律。\n这项提议是在明尼阿波利斯警方击毙手无寸铁的黑人乔治·弗洛伊德(George Floyd)整整一个月后提出的，这引发了要求种族正义的全国示威浪潮。密歇根州男子罗伯特·威廉姆斯(Robert Williams)于今年1月被底特律警方逮捕，此前国有面部识别软件错误地将他识别为商店行窃嫌疑人。他在周三发表在《华盛顿邮报》(Washington Post)上的一篇关于他经历的评论文章中提到了正在进行的抗议活动。\n我们的记者比以往任何时候都更加努力地工作，为你们带来对我们民主的生存至关重要的新闻。但是没有你我们做不到。今天请支持我们的2020年中活动。赌注从未像现在这样高。\n密歇根州ACLU高级幕僚律师菲利普·市长(Philip Mayor)-与麦卡斯基律师事务所(McCaskey Law，PLC)的维多利亚·伯顿-哈里斯(Victoria Burton-Harris)一起代表威廉姆斯-周三就这一事件对底特律警察局提起行政诉讼。\n罗伯特·威廉姆斯(Robert Williams)的女儿们不可能看不到她们的父亲被错误逮捕，但我们可以确保没有其他人会经历威廉姆斯家族所做的事情。\n无论他们走到哪里，都不应该害怕政府追踪和识别他们的面孔。美国公民自由联盟(ACLU)高级立法顾问尼玛·辛格·古利亚尼(Neema Singh Guliani)周四在一份声明中表示，没有人应该经历威廉姆斯家族所经历的事情，他对新法案表示欢迎。国会已经停止了人脸识别的使用，并阻止联邦资金投资于侵入性和歧视性的监控。这项法案应该立即获得通过。\n威廉姆斯和他的律师周三强调，研究一再揭示面部识别技术的缺陷和偏见，这种技术对女性和有色人种的错误率通常更高。面部识别和生物识别技术暂停法案的发起人承认，这项研究--特别是威廉姆斯案--以及正在进行的抗议活动，呼吁采取紧急行动，解决系统性种族主义和暴力警察问题。\n马基说，面部识别技术不仅对我们的隐私构成严重威胁，它还会在身体上危及美国黑人和我们国家的其他少数族裔人口。当我们努力消除渗透到我们社会每一个部分的系统性种族主义时，我们不能忽视这些技术带来的危害。此时此刻，唯一负责任的事情就是禁止政府和执法部门使用这些监视机制。\n面部识别技术从根本上是有缺陷的，存在系统偏见，在我们的社会中没有立足之地。\n随着各个城市采取大胆行动，禁止政府使用这项技术，我很自豪地提出立法，在联邦范围内禁止使用这项技术。https://t.co/D9XBiGu0QZ。\n在没有联邦政府采取行动禁止或限制面部识别技术的情况下，当地领导人已经采取行动--包括周三的波士顿市议会(Boston City Council)，代表该市大部分地区的普雷斯利(Pressley)周四指出。普雷斯利作为一名黑人女性，属于这类工具错误率最高的人群，她还指责面部识别技术从根本上是有缺陷的，存在系统偏见，在我们的社会中没有立足之地。\n这位女议员说，黑人和棕色人种已经受到了过度监视和过度监管，我们必须防止政府机构利用这项有缺陷的技术进一步监视有色人种社区，这一点至关重要。这项法案将大胆地确认这个国家每个人的公民自由，并保护他们不受政府和执法部门不公正和歧视性监视的生活权利。", "note_en": "In a move cheered by civil liberties advocates, a quartet of progressives in Congress announced on Thursday they will introduce sweeping legislation to effectively ban government use of facial recognition and other biometric technology nationwide, citing threats to privacy rights and the well established flaws of such tools.\n  The  Facial Recognition and Biometric Technology Moratorium Act (pdf) is sponsored by Sens. Ed Markey (D-Mass.) and Jeff Merkley (D-Ore.) and Reps. Pramila Jayapal (D-Wash.) and Ayanna Pressley (D-Mass.).\n The bill is backed by several advocacy groups including the ACLU, Color of Change, Electronic Frontier Foundation, and Fight for the Future.\n &#34;Facial recognition is the perfect technology for tyranny. It automates discriminatory policing and exacerbates existing injustices in our deeply racist criminal justice system,&#34;  declared Fight for the Future deputy director Evan Greer.\n This bill is &#34;exactly what we need right now,&#34; she added, giving the proposal the group&#39;s &#34;full endorsement.&#34;\n We have a once in a lifetime chance to get lawmakers to finally do their jobs and  #BanFacialRecognition across the entire US. But we need to flood Congress with emails and light up their phones with calls demanding they pass this bill. Take action now at  https://t.co/lXUm7DnWco\n &#34;Congress should pass this bill as soon as possible,&#34; Greer continued, urging GOP lawmakers worried about privacy to support it. &#34;Once this bill is passed, Congress should move quickly to pass legislation that also bans corporations, schools, and other private institutions from using facial recognition for surveillance purposes.&#34;\n Greer, whose group has long called for a total ban, also said that &#34;facial recognition is like nuclear or biological weapons. It poses such a threat to the future of human society that any potential benefits are outweighed by the inevitable harms. This inherently oppressive technology cannot be reformed or regulated. It should be abolished.&#34;\n  Place a prohibition on the use of facial recognition technology by federal entities, which can only be lifted with an act of Congress;\n Place a prohibition on the use of other biometric technologies, including voice recognition, gate recognition, and recognition of other immutable physical characteristics, by federal entities, which can only be lifted with an act of Congress;\n Condition federal grant funding to state and local entities, including law enforcement, on those entities enacting their own moratoria on the use of facial recognition and biometric technology;\n  Prohibit the use of information collected via biometric technology in violation of the Act in any judicial proceedings;\n Includes a private right of action for individuals whose biometric data is used in violation of the Act and allows for enforcement by state Attorneys General; and\n Allow states and localities to enact their own laws regarding the use of facial recognition and biometric technologies.\n The proposal comes exactly one month after Minneapolis police  killed George Floyd, an unarmed black man, which sparked a  national wave of demonstrations demanding racial justice. Robert Williams, a Michigan man who was  arrested by Detroit police in January after state-owned facial recognition software misidentified him as a shoplifting suspect,  referenced the ongoing protests in an op-ed about his experience published Wednesday in the  Washington Post.\n Our journalists are working harder than ever to bring you journalism that is essential to the survival of our democracy. But we can&#39;t do it without you. Please support our 2020 Mid-Year Campaign today. The stakes have never been higher.\n  ACLU of Michigan senior staff attorney Philip Mayor—who, along with Victoria Burton-Harris of McCaskey Law, PLC, is representing Williams—filed an administrative complaint Wednesday against the Detroit Police Department over the incident.\n Robert Williams&#39; daughters can&#39;t unsee their father&#39;s wrongful arrest, but we can make sure no one else has to go through what the Williams family did.\n &#34;No one should have to fear the government tracking and identifying their face wherever they go. No one should have to go through what the Williams family has gone through,&#34; ACLU senior legislative Counsel Neema Singh Guliani  said in a statement Thursday, welcoming the new bill. &#34;It&#39;s past time Congress halted the use of face recognition and stopped federal money from being used to invest in invasive and discriminatory surveillance. This bill should immediately pass.&#34;\n Williams and his attorneys on Wednesday emphasized that studies have repeatedly revealed the  flaws and biases of facial recognition technology, which generally has higher error rates for women and people of color. The sponsors of the Facial Recognition and Biometric Technology Moratorium Act acknowledged that research—and Williams&#39; case specifically—along with the ongoing protests calling for urgent action to tackle systemic racism and violent policing.\n &#34;Facial recognition technology doesn&#39;t just pose a grave threat to our privacy, it physically endangers Black Americans and other minority populations in our country,&#34; said Markey. &#34;As we work to dismantle the systematic racism that permeates every part of our society, we can&#39;t ignore the harms that these technologies present... In this moment, the only responsible thing to do is to prohibit government and law enforcement from using these surveillance mechanisms.&#34;\n Facial recognition technology is fundamentally flawed, systemically biased &amp; has no place in our society.\n As cities across  #MA7 take bold action to ban government use of this technology, I&#39;m proud to introduce legislation to outlaw its use federally.  https://t.co/D9XBiGu0QZ\n In the absence of federal action to ban or limit facial recognition tech, local leaders have moved to do so— including the Boston City Council on Wednesday, which Pressley, who represents much of the city, noted Thursday. Pressley—who, as a Black woman, belongs to the demographic with  the highest error rate for these kinds of tools—also charged that &#34;facial recognition technology is fundamentally flawed, systemically biased, and has no place in our society.&#34;\n &#34;Black and brown people are already over-surveilled and over-policed, and it&#39;s critical that we prevent government agencies from using this faulty technology to surveil communities of color even further,&#34; the congresswoman said. &#34;This bill would boldly affirm the civil liberties of every person in this country and protect their right to live free of unjust and discriminatory surveillance by government and law enforcement.&#34;", "posttime": "2020-06-26 08:56:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,法案,immediately,识别", "title": "这项法案应该立即通过：为美国禁止面部识别的新立法鼓掌", "title_en": "'This Bill Should Immediately Pass': Applause for New US Legislation to Ban Facial Recognition", "transed": 1, "url": "https://www.commondreams.org/news/2020/06/25/bill-should-immediately-pass-applause-new-us-legislation-ban-facial-recognition", "via": "", "real_tags": ["美国", "法案", "识别"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008329, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一次漫长的旅行！我沉默了一段时间，没有定期在我的博客上发帖。不过，别担心，我很好。取而代之的是，我围绕冠状病毒的这种情况，专注于写一本书“现代CPU的性能分析和调优”(Performance Analysis And Tuning On Modern CPU)。我差不多一年前就开始写这本书了，所以我很高兴我终于可以向人们展示一些东西了。现在，初稿已经准备好了，我欢迎每个人来评论这本书，甚至可能会给它增加一些东西。我知道现在很多人都在苦苦挣扎，所以我决定把这本书免费提供给所有人。最终，每个人都可以下载它的PDF版本。\n我为什么要这么做？我开始这本书时只有一个简单的目标：教育开发人员更好地理解在现代硬件上运行的应用程序的性能。大多数开发人员习惯于只查看应用程序的源代码，而不试图了解他们所做更改的性能影响。我知道对我们中的许多人来说，引擎盖下发生的事情是一种黑物质。我知道这很难，但希望有了这本书，现代硬件的性能世界将变得更容易理解。\n这本书是关于什么的？您是否曾与同事就某段代码的性能进行过辩论？那么您可能知道预测哪个版本工作得最好有多难。由于现代处理器中有如此多的移动部件，即使对代码进行很小的调整也会引发显着的性能变化。除了所有的复杂性之外，硬件还有许多支持性能分析的功能。没错，CPU能够告诉我们性能瓶颈是什么以及它们出现在哪里。因此，本书重点介绍了从CPU角度看您的代码是什么样子，并提供了特定于硬件的优化方法。本书的核心是围绕如何在代码中找到合适的位置来提高性能。\n1.引言2.引言。衡量绩效3.。CPU微体系结构1014。性能分析中的术语和度量5。性能分析接近5.1。代码规范5.2。追踪5.3。工作负载特征5.4。抽样5.5。静态性能分析5.6.。编译器优化报告6.。性能分析的CPU功能6.1。自上而下的微体系结构分析(TMAM)6.2.。最后一个分支机构记录(LBR)6.3。处理器基于事件的采样(PEBS)6.4。英特尔处理器跟踪(PT)7.针对CPU 7.1的源代码调整。数据驱动优化7.2。CPU前端优化7.3。CPU后端优化7.4。优化不良投机7.5。其他调谐区域8。优化多线程应用程序。\n这本书是给谁看的？本书主要是为从事性能关键型项目的开发人员编写的。这包括以下领域：高性能计算(HPC)、高频交易(HFT)、Gamedev、数据中心(Facebook、Google等)和其他领域。但我希望它对任何C++开发人员都有用：您可以使用这本书来学习性能分析，它将与您可能拥有的其他技能很好地结合在一起。书中的所有示例都是用C/C++编写的，但它们在很大程度上适用于任何本地编程语言(如C、C++、Rust、Go甚至Fortran)。虽然这本书相当低级，但我希望即使是刚刚开始性能相关工作的开发人员也能读懂。\n我把我所有的知识和经验都奉献给了这本书，我渴望与社区分享它。我决定将这本书向每个人开放，我欢迎每个人都来评论这本书，为这本书贡献自己的力量。我希望，通过这种方式，我们可以将不同领域人员的最佳性能实践和专业知识结合起来。", "note_en": "It has been a long journey! I was silent for a while, haven’t posted regularly on my blog. But don’t worry, I’m fine. Instead, I took this situation around coronavirus and focused on writing a book “ Performance Analysis and Tuning on Modern CPU”. I started writing this book almost a year ago, so I’m happy I finally can show something to the people. Right now, the  early draft is ready and I’m welcoming everybody to review the book and maybe even add something to it. I know a lot of people are struggling right now, so I decided to make the book  FREE for all. Eventually, everyone will be able to download PDF version of it.\n Why I started it? I started this book with one simple goal in mind: educate developers to better understand performance of their applications running on modern HW. Most of developers are used to look no further than the source code of their application without trying to understand performance implications of the changes they make. I know for many of us what happens under the hood is sort of black matter. I know it’s hard, but hopefully with this book, performance world of modern HW will become more accessible.\n What is the book about? Have you ever debated with a coworker about performance of a certain piece of code? Then you probably know how hard it is to predict which version is going to work best. With so many moving parts inside the modern processors even a small tweak to the code can trigger significant performance change. Besides all its complexity, HW has many features that support performance analysis. That’s right, CPUs are capable of telling us what performance bottlenecks are and where they occur. Thus, the book focuses on how your code looks like from the CPU perspective and provides recipes for HW specific optimizations. The core of the book is centered around how to find the right place in the code to improve performance.\n  1. Introduction2. Measuring Performance3. CPU Microarchitecture 1014. Terminology And Metrics In Performance Analysis5. Performance Analysis Approaches 5.1. Code Instrumentation 5.2. Tracing 5.3. Workload Characterization 5.4. Sampling 5.5. Static Performance Analysis 5.6. Compiler Optimization Reports6. CPU Features For Performance Analysis 6.1. Top-Down Microarchitecture Analysis (TMAM) 6.2. Last Branch Record (LBR) 6.3. Processor Event-Based Sampling (PEBS) 6.4. Intel Processor Traces (PT)7. Source Code Tuning For CPU 7.1. Data-Driven Optimizations 7.2. CPU Front-End Optimizations 7.3. CPU Back-End Optimizations 7.4. Optimizing Bad Speculation 7.5. Other Tuning Areas8. Optimizing Multithreaded Applications\n Who is this book for? Primarily, this book is written for developers working in performance critical projects. This includes the following areas: High performance computing (HPC), High Frequency Trading (HFT), GameDev, Data Centers (Facebook, Google, etc), and other areas. But I hope it will be useful for any C++ developer: you can use this book to learn performance analysis which will stack up nicely with other skills you might have. All examples in the book are written in C/C++, but to the large extent they are applicable to any native programming language (like C, C++, Rust, Go and even Fortran). While this book is fairly low-level, I hope, it will be accessible even to developers that are just starting performance related work.\n I gave this book all my knowledge and experience and I’m eager to share it with community. I decided to make this book open to everyone and  I welcome everyone to review and contribute to the book. I hope, this way we can combine best performance practices and expertise from people in different areas.", "posttime": "2020-06-26 08:55:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,perf", "title": "我的性能书的草稿已经准备好了-Easyperf", "title_en": "Draft of my perf book is ready – Easyperf", "transed": 1, "url": "https://easyperf.net/blog/2020/06/24/Draft-Of-Perf-Book", "via": "", "real_tags": ["性能", "perf"]}, {"category": "", "categoryclass": "", "imagename": "274aa70a202b62235c8d429c647d5a77.jpeg", "infoid": 1008328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿(美联社)-政府和行业官员表示，唐纳德·特朗普(Donald Trump)总统正准备指示联邦政府彻底改革招聘制度，将求职者的技能置于大学学位之上。\n特朗普将于周五签署一项行政命令，在为政府提供工人政策建议的董事会会议上，为美国最大的雇主勾勒出新的方向。\n总统的女儿兼顾问伊万卡·特朗普(Ivanka Trump)是美国劳动力政策咨询委员会(American Workforce Policy Consulting Board)的联合主席，她一直致力于改善职业培训，以满足雇主不断变化的需求。\n联邦政府是美国最大的雇主，拥有210万文职工人，不包括邮政服务员工。\n伊万卡·特朗普(Ivanka Trump)预测，联邦政府招聘的变化将创造一支更具包容性和才华的劳动力队伍。她鼓励私营部门效仿政府的做法。\n她在一份声明中告诉美联社：“我们正在实现联邦招聘的现代化，以寻找具备相关能力和知识的候选人，而不是简单地根据学位要求进行招聘。”“我们鼓励世界各地的雇主审视他们的招聘做法，并批判性地思考像这样的举措如何有助于实现员工队伍的多元化和加强。”\n该委员会的另一位联席主席、商务部长威尔伯·罗斯(Wilbur Ross)表示，技能培训和学徒制度的需求与冠状病毒大流行迫使数百万人失业之前一样迫切，这推动5月份全国失业率超过13%。\n罗斯告诉美联社：“美国人渴望上班，但他们需要我们的帮助。”\n白宫并没有完全取消学位要求，而是会在拥有学位不那么重要的工作中强调技能。\n助手们说，这一变化将为美国人创造更多为联邦政府工作的机会，因为它认识到一些学习发生在教室之外。\n伊万卡·特朗普(Ivanka Trump)和其他政府官员一直在推动增加学徒机会，并推动将此类培训和职业教育作为传统两年或四年制大学学位课程的替代方案。\n人事管理办公室将负责执行总统的命令。\nIBM就是朝这个方向发展的公司之一。该公司执行主席吉尼·罗梅蒂(Ginni Rometty)通过白宫说，去年，该公司在美国的新员工中有15%具有非传统背景，因为评估他们的标准是技能，而不是只看他们的学历。\n预计将参加周五会议的罗曼提说：“我们从该国的新地区招聘，包括服务不足的社区，这促进了我们收到的申请更加多样化。”\n在会议上，劳动力顾问委员会预计还将宣布由苹果、IBM和非营利性广告委员会领导的私营部门广告活动的细节，以促进替代教育途径。", "note_en": "WASHINGTON (AP) — President Donald Trump is preparing to direct the federal government to overhaul its hiring to prioritize a job applicant’s skills over a college degree, administration and industry officials say.\n Trump is set to sign an executive order Friday outlining a new direction for the nation’s largest employer during a meeting of the board that advises the administration on worker policy.\n Ivanka Trump, the president’s daughter and adviser, is co-chair of the American Workforce Policy Advisory Board and has worked on improving job training to meet employers’ changing needs.\n  The federal government is the nation’s largest employer with 2.1 million civilian workers, excluding postal service employees.\n Ivanka Trump predicted the change in federal government hiring would create a more inclusive and talented workforce. She encouraged the private sector to follow the administration’s lead.\n “We are modernizing federal hiring to find candidates with the relevant competencies and knowledge, rather than simply recruiting based on degree requirements,” she told The Associated Press in a statement. “We encourage employers everywhere to take a look at their hiring practices and think critically about how initiatives like these can help diversify and strengthen their workforce.”\n Commerce Secretary Wilbur Ross, the board’s other co-chair, said the need for skills training and apprenticeships is as great as it was before the coronavirus pandemic forced millions of people out of work, pushing the national unemployment rate above 13% in May.\n “Americans are eager to get to work but they need our help,” Ross told AP.\n The White House isn’t eliminating degree requirements altogether but instead will stress skills in jobs where having a degree is less important.\n Aides say the change will create more opportunities for Americans to work for the federal government by recognizing that some learning happens outside of classrooms.\n Ivanka Trump and other administration officials have pushed to increase opportunities for apprenticeships and have promoted such training and vocational education as alternatives to traditional two-year or four-year college degree programs.\n The Office of Personnel Management will be responsible for implementing the president’s order.\n IBM is among the companies that have moved in this direction. Last year, 15% of its new U.S. hires had nontraditional backgrounds because they were evaluated based on skills instead of looking only at their degrees, Ginni Rometty, the company’s executive chairman, said via the White House.\n  “We hired from new areas of the country, including under-served communities, and this promoted more diversity in the applications we received,” said Rometty, who is expected to participate in Friday’s meeting.\n At the meeting, the workforce advisory board is also expected to announce details of a private-sector ad campaign led by Apple, IBM and the nonprofit Ad Council to promote alternate pathways to education.", "posttime": "2020-06-26 08:54:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "放在,federal,招聘", "title": "特朗普希望联邦招聘把重点放在技能上，而不是学位上", "title_en": "Trump wants federal hiring to focus on skills over degrees", "transed": 1, "url": "https://apnews.com/da3c08790765a57a4dc6a258d252acef", "via": "", "real_tags": ["放在", "federal", "招聘"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Verizon正在从Instagram和Facebook上撤下广告，这是迄今为止抵制这家社交网络的运动中最大的名字，因为这家社交网络在阻止其平台上的仇恨言论方面做得不够。\n该公司周四表示，将加入Ben&amp；Jerry‘s、巴塔哥尼亚(Patagonia)和REI等其他公司的行列，暂停Facebook旗下平台的广告投放，直到该公司“能够创造出令我们满意的可接受的解决方案”。\nVerizon首席媒体官约翰·尼蒂(John Nitti)在一份声明中说，“我们有严格的内容政策，当它们被违反时，我们是零容忍的，我们会采取行动。”“我们将暂停我们的广告，直到Facebook能够创造出一个可以接受的解决方案，让我们感到舒适，并与我们与YouTube和其他合作伙伴所做的事情保持一致。”\nFacebook在周三与广告商的电话会议上承认了越来越大的压力，一名Facebook高管承认，与该平台上的客户存在“信任赤字”。\n周三，包括反诽谤联盟、全国有色人种协进会和改变颜色在内的倡导团体发起了“为盈利而停止仇恨”活动。它要求广告商向这家科技巨头施压，要求其对其平台上的种族主义和仇恨内容采取更严格的政策，在7月份暂停与该公司的所有广告支出。\n作为活动的一部分，这些组织提醒Verizon，它在Facebook上的一则广告出现在阴谋组织QAnon的一段视频旁边，视频中使用了仇恨和反犹的言论。\n根据这场运动，Facebook在“放大白人至上主义者的信息”和“允许煽动暴力”的同时，每年获得700亿美元的广告收入。\n这些倡导团体辩称，Facebook未能解决错误信息和仇恨言论，尽管它有与白人民族主义者和新纳粹主义者合作的历史，据称允许对有色人种社区的住房歧视，也未能删除否认大屠杀的帖子，但Facebook未能使布莱巴特新闻成为“值得信赖的新闻来源”。\n最近几周，Facebook面临的缓和仇恨言论的压力有所加快，因为该平台拒绝标记唐纳德·特朗普(Donald Trump)的虚假和煽动性声明，尽管竞争对手平台Twitter采取了行动。\n反诽谤联盟(Anti-Defamation League)最近的一项研究发现，受访者经历的绝大多数(77%)在线骚扰发生在Facebook上。\n“还有更多的进展要取得，但我们继续在技术和流程上进行重大投资，以帮助我们消除Facebook上的仇恨、骚扰和欺凌，”一名公司发言人在回应这项研究时表示。\n针对广告商的抵制，Facebook全球业务集团副总裁卡罗琳·埃弗森(Carolyn Everson)在一份声明中表示：“我们非常尊重任何品牌的决定，并将继续专注于消除仇恨言论和提供关键投票信息的重要工作。”", "note_en": "Verizon is pulling its advertising from Instagram and Facebook, the biggest name so far in  a growing movement to boycott the social network for not doing enough to stop hate speech on its platforms.\n  The company said on Thursday it will join other companies including Ben &amp; Jerry’s, Patagonia and REI in suspending advertising from Facebook-owned platforms until the company “can create an acceptable solution that makes us comfortable”.\n “We have strict content policies in place and have zero tolerance when they are breached, we take action,” Verizon’s chief media officer, John Nitti, said in a statement. “We’re pausing our advertising until  Facebook can create an acceptable solution that makes us comfortable and is consistent with what we’ve done with YouTube and other partners.”\n Facebook  acknowledged the growing pressure on a call with advertisers on Wednesday, where a Facebook executive admitted there is a “trust deficit” with its clients on the platform.\n The “Stop Hate for Profit” campaign was launched Wednesday by advocacy groups including the Anti-Defamation League, the NAACP and Color Of Change. It asks advertisers to pressure the tech giant to adopt stricter policies against racist and hateful content on its platforms by pausing all spending on advertising with the company for the month of July.\n As part of the campaign, the groups alerted Verizon that one of its advertisements on Facebook had appeared next to a video from the  conspiracy group QAnon drawing on hateful and antisemitic rhetoric.\n Facebook makes $70bn in annual advertising revenue while “amplifying the messages of white supremacists” and “permitting incitement to violence”, according to the campaign.\n The advocacy groups argue Facebook has failed to address misinformation and hate speech by making  Breitbart News a “trusted news source” despite its history of working with white nationalists and neo-Nazis,  allegedly allowing housing discrimination against communities of color, and  failing to remove Holocaust denial posts.\n The pressure on Facebook to moderate hate speech has accelerated in recent weeks as the platform refused to flag false and incendiary statements from  Donald Trump, despite moves from rival platform Twitter to do so.\n A  recent study by the Anti-Defamation League found that the vast majority (77%) of online harassment experienced by respondents took place on Facebook.\n “There is more progress to be made but we continue to make significant investments in technology and processes to help us remove hate, harassment and bullying from Facebook,” a company spokesperson said in response to the study.\n In response  to the advertiser boycotts, Carolyn Everson, the vice-president of Facebook’s global business group, said in a statement: “We deeply respect any brand’s decision, and remain focused on the important work of removing hate speech and providing critical voting information.”", "posttime": "2020-06-26 08:36:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,facebook,仇恨,pulls", "title": "Verizon因对仇恨言论不采取行动而从Facebook撤下广告", "title_en": "Verizon pulls ads from Facebook over inaction on hate speech", "transed": 1, "url": "https://www.theguardian.com/technology/2020/jun/25/verizon-advertising-facebook-hate-speech-boycott", "via": "", "real_tags": ["广告", "facebook", "仇恨", "pulls"]}, {"category": "", "categoryclass": "", "imagename": "52d1b3a7b8a8743334df1074a3439d92.jpg", "infoid": 1008325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四晚上，福特直播了其最新款F-150皮卡的发布仪式。卡车对福特的重要性怎么说都不为过；F系列为该公司带来了数百亿美元的收入，它经常位居美国市场最畅销轻型车排行榜的榜首。因此，该公司为其第14代卡车重新设计并不是一项轻率的任务-据这家汽车制造商称，超过1000个小时的客户调查为这一美国主食的最新演变提供了信息。今年秋天上市时，它将是福特有史以来最先进的轻型卡车，将通过空中更新实现新功能，并首次推出混合动力选项，并将于一两年后推出电动汽车版本。\n对于2021年车型，福特在动力总成方面提供了多种选择。其中大部分是从第13代F-150延续下来的，包括自然吸气式3.3L V6，涡轮增压2.7L和3.5L V6 EcoBoost发动机，自然吸气式5.0L V8，以及3.0L涡轮柴油。(确切的功率和扭矩输出尚未披露。)。所有这些都使用相同的10速自动变速器。作为标准，F-150是后轮驱动，但它也可以配置为全轮驱动，带有开放或锁定的后差速器。\n这些新的、令人兴奋的补充被称为PowerBoost，这是福特对平行混合动力车的说法。它结合了3.5L EcoBoost V6与35kW(47hp)电机，电机集成在变速器中，由1.5kWh锂离子电池组供电。该包是液体冷却的，位于框架导轨之间，因此对内部体积或负载床没有负面影响。有没有总功率或扭矩的数字还没有，但我们被告知应该拖到12,000磅(5,443公斤)。\n同样，福特将公布接近卡车出现在展厅时的燃油经济性数据，但它表示，满箱汽油预计将行驶700英里(1126公里)。由于PowerBoost F-150的油箱是30.6加仑，这相当于每加仑22.8英里(10.32l/100公里)。作为背景，MY2020 3.5L EcoBoost F-150的综合行驶里程为19mpg(12.4l/100 km)。\n除了帮助提高燃油效率，混合动力F-150的目标是在工作场所或后门活动中提供帮助。作为标准配置，它可以通过安装在货床侧面的120V、20A和240V、30A插座提供高达2.4kW的电源。或者，如果你需要使用很多电动工具，或者想在露营时开一些非常大的扬声器和电视，你可以选择一个7.2kW的增强型系统。(常规动力的F-150可以选择2.0千瓦的机载电源系统。)。\nF-150的许多其他新增加也涉及到使卡车更好地适应人们的生活方式。一种选择允许变速杆向下折叠到中控台，这样您就可以在前排座位之间拥有一个完全平坦的工作面-无论是笔记本电脑还是午餐。通向客舱的地板是完全平坦的，您可以在后排座位下面有一个可上锁的储物柜，用来存放贵重物品。还有可选的前排躺椅，可以折叠到近180度，有点像商务舱的座椅。因此，午餐后(或笔记本电脑课程)，你可以在再次拿起电动工具之前打个盹。\n福特公司说，80%的全尺寸卡车车主使用他们的卡车来拖运货物，因此这使得货物进出装载床变得更容易。你可以使用钥匙卡，通过脚踏开关，甚至使用福特互联汽车应用程序来部署电动跑板。后门包括超长负载的捆绑位置，也可以兼作开瓶器。它还有内置的口袋，这样你就可以把C形夹子固定在上面，压住你正在做的东西。还有一个选项，可以用一个工作面来规范后门，其中包括尺子、铅笔架、一个杯架和一个存放移动设备的地方。\n连接性升级是第14代F-150的另一个重大变化。您可以将驾驶员面前的主仪表显示屏指定为8英寸数字显示屏，而不是两个中间有4英寸显示屏的模拟刻度盘。作为标准，F-150将配备一个新的8英寸触摸屏信息娱乐系统，运行Sync 4，这是福特基于QNX的信息娱乐平台的最新版本。或者，您也可以选择具有扩展UI的12英寸触摸屏系统。如果你安装了这两个精美的屏幕，它们都将在各自的处理器上运行，尽管福特目前不会告诉我们太多关于硬件的信息，除了车辆使用以太网作为其电子神经系统这一事实。\nApple CarPlay和Android Auto将无线工作，Sync 4还将包括Waze和Alexa等第三方应用程序。虽然底层软件是相似的，F-150；的同步4UI与我们在野马-E电动跨界车中看到的同步4A系统有根本的不同。我本希望在这篇文章中分享一些主要仪器展示和信息娱乐的图片，但不幸的是，它们没有包括在福特与我们分享的图片中。但该公司在主仪表盘上采用了时尚但易读的主题，其特色是卡车的实时动画，该动画会根据你正在使用的驾驶模式而变化。\n在新F-150的各种高级驾驶辅助功能中，人们最感兴趣的可能是主动驾驶辅助功能。它是福特公司对通用汽车超级巡航或特斯拉自动驾驶系统的回应，并且可以在分隔车道的高速公路上进行免提巡航。像超级巡航(但不是自动驾驶)一样，主动驾驶辅助系统使用适当的驾驶员监控系统来确保驾驶员的眼睛盯着前方的道路。如果你订购了这项功能，福特会在你的F-150发货时安装硬件，但直到2021年软件准备就绪时，它才会真正激活。这将通过空中更新或经销商访问来完成，届时将需要支付激活费。\n我们与福特进行了交谈，以准备今天的发布，该公司告诉我们，它正在计划定期更新在线旅行社。与野马马赫-E一样，小的更新将在后台执行，如果较大的更新要求卡车在更新发生时停放并停止行动，您将能够安排这些更新，这样当您需要卡车能够驾驶时，它们就不会发生。", "note_en": "On Thursday evening, Ford livestreamed the launch of its newest F-150 pickup truck. It&#39;s hard to overstate how important the truck is for Ford; the F-Series has earned the company tens of billions of dollars, and it regularly tops the chart of best-selling light vehicles in the US market. So redesigning the truck for its 14th generation is not a task the company has undertaken lightly—according to the automaker, more than a thousand hours of customer research has informed this latest evolution of an American staple. When it goes on sale this fall, it will be Ford&#39;s most advanced light truck ever, with over-the-air updates enabling new features and for the first time, a hybrid option, and a battery EV version due in a year or two.\n  For model year 2021, Ford is providing a variety of options when it comes to powertrains. Most of these carry over from the 13th-generation F-150, including a naturally aspirated 3.3L V6, turbocharged 2.7L and 3.5L V6 EcoBoost engines, a naturally aspirated 5.0L V8, and a 3.0L turbodiesel. (Exact power and torque outputs are not being disclosed yet.) All these use the same 10-speed automatic transmission. As standard, the F-150 is rear-wheel drive, but it can also be configured with all-wheel drive, with an open or locking rear differential.\n The new, exciting addition to these is called PowerBoost, which is Ford-speak for a parallel hybrid. It combines the 3.5L EcoBoost V6 with a 35kW (47hp) electric motor that&#39;s integrated into the transmission and fed by a 1.5kWh lithium-ion battery pack. The pack is liquid-cooled and located between the frame rails, so there&#39;s no negative effect on interior volume or the load bed. There&#39;s no overall power or torque figure yet, but we are told it should tow up to 12,000lbs (5,443kg).\n Similarly, Ford will release fuel-economy figures closer to when the truck appears in showrooms, but it says to expect 700 miles (1,126km) on a full tank of gas. Since the gas tank on a PowerBoost F-150 is 30.6 gallons, that works out to 22.8mpg (10.32l/100km). For context, a  MY2020 3.5L EcoBoost F-150 gets a combined 19mpg (12.4l/100km).\n As well as helping fuel efficiency, the hybrid F-150 aims to be helpful on a worksite or tailgate event. As standard, it can supply up to 2.4kW of power via both 120V, 20A and 240V, 30A outlets mounted in the side of the cargo bed. Or, you can option an uprated 7.2kW system if you need to use a  lot of power tools,or want to drive some really big speakers and a TV while camping. (The conventionally powered F-150s can option a 2.0kW onboard power system.)\n  Many of the other new additions to the F-150 also involve making the truck work better with people&#39;s lifestyles. One option allows the gearshift lever to fold down into the center console so you can have a completely flat work surface—whether for your laptop or your lunch—between the front seats. The floor to the cabin is completely flat, and you can have a lockable stowage locker underneath the rear seats for hiding valuables. And there are optional reclining front seats that fold to nearly 180-degrees, a bit like a business class airplane seat. So after lunch (or a laptop session), you can have a power nap before picking up the power tools again.\n Ford says 80 percent of full-size-truck owners use their trucks for hauling stuff, so it&#39;s made getting things in and out of the load bed easier. You can deploy power running boards using the key fob, via a kickswitch, or even with the Ford connected car app. The tailgate includes tie-down locations for extra-long loads, that also double as bottle openers. It also has pockets built in so you can fix C-clamps to it to hold down things you&#39;re working on. And there&#39;s an option to spec the tailgate with a work surface that includes rulers, pencil holders, a cupholder, and a place to keep your mobile device.\n  A connectivity upgrade is another big change for the 14th-generation F-150. You can spec the main instrument display in front of the driver as an 8-inch digital display, rather than two analog dials with a 4-inch display between them. As standard, the F-150 will come with a new 8-inch touchscreen infotainment system running Sync 4, the latest version of Ford&#39;s QNX-based infotainment platform. Or you can choose a 12-inch touchscreen system with an expanded UI. If you have both the fancy screens fitted, they&#39;ll each run on their own processors, although Ford wouldn&#39;t tell us much about the hardware right now, other than the fact that the vehicle uses Ethernet for its electronic nervous system.\n Apple CarPlay and Android Auto will work wirelessly, and Sync 4 will also include third-party apps like Waze and Alexa. Although the underlying software is similar, the F-150&#39;s Sync 4 UI is radically different to the Sync 4A system  we saw in the Mustang Mach-E electric crossover. I was hoping to share some images of the main instrument display and infotainment in this article, but unfortunately they weren&#39;t included in the images Ford shared with us. But the company has gone for a stylish but legible-looking theme on the main instrument panel, which features a live animation of the truck that changes depending upon the drive mode you&#39;re using.\n Among the various advanced driver assists on the new F-150, the one people might be most interested in is called Active Drive Assist. It&#39;s Ford&#39;s answer to  General Motors&#39; Super Cruise or Tesla&#39;s Autopilot, and it allows for hands-free cruising on divided-lane highways. Like Super Cruise ( but not Autopilot), Active Drive Assist uses a proper driver-monitoring system to ensure the driver&#39;s eyes are on the road ahead. If you order this feature, Ford will ship your F-150 with the hardware installed, but it won&#39;t actually be activated until some time in 2021 when the software is ready. That will be done by an over-the-air update or dealer visit, and it will require an activation fee at that time.\n We spoke with Ford in the lead-up to today&#39;s launch, and the company told us that it&#39;s planning a regular tempo of OTA updates.  As with the Mustang Mach-E, small updates will be performed in the background, and if larger updates require the truck to be parked and out of action while they take place, you&#39;ll be able to schedule those so they don&#39;t happen when you need the truck to be able to drive.", "posttime": "2020-06-26 08:15:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,所知,including", "title": "我们对新款福特F-150卡车所知的一切--包括混合动力车", "title_en": "Everything we know about the new Ford F-150 truck—including the hybrid", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/everything-we-know-about-the-new-ford-f-150-truck-including-the-hybrid/", "via": "", "real_tags": ["福特", "所知", "including"]}, {"category": "", "categoryclass": "", "imagename": "a2cfd327a13047e67d14b5e89a6a42b5.jpg", "infoid": 1008323, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“巧克力瘦身！”头条新闻铺天盖地。一组德国研究人员发现，如果人们每天吃一块巧克力棒，那么低碳水化合物饮食的人减肥速度会快10%。它登上了欧洲最大的日报“图片报”(Bild)的头版，紧随其后的是关于德国之翼坠毁事件的最新消息。从那时起，它在互联网和其他地方迅速传播，在20多个国家和六种语言中成为新闻。这件事在电视新闻节目中得到了讨论。它出现在光滑的印刷品上，最近一次出现在Shape杂志6月号上(“为什么你必须每天吃巧克力”，第128页)。研究发现，巧克力不仅能加速减肥，还能提高胆固醇水平，提高整体幸福感。“图片报”的报道引用了这项研究的主要作者、饮食与健康研究所研究主任约翰尼斯·博汉农博士的话：“最棒的是你可以在任何地方买到巧克力。”\n我是约翰尼斯·博汉南博士。嗯，实际上我叫约翰，我是一名记者。我确实有博士学位，但它是研究细菌的分子生物学的，而不是人类。饮食与健康研究所？那不过是一个网站而已。\n除了这些谎言，这项研究是百分之百真实的。我和我的同事们在德国招募了真实的人体受试者。我们进行了一项实际的临床试验，将受试者随机分配到不同的饮食方案中。我们报道的巧克力在统计上的显著益处是基于实际数据。事实上，这是饮食研究领域的一项相当典型的研究。也就是说：这是一门可怕的科学。结果是毫无意义的，媒体向世界各地数百万人大肆宣扬的健康主张也是完全没有根据的。\n去年12月，我接到一位名叫彼得·昂内肯(Peter Onneken)的德国电视台记者的电话。他和他的合作者戴安娜·勒布尔(Diana Löbl)正在制作一部关于垃圾科学饮食行业的纪录片。他们想让我帮助证明，把糟糕的科学变成节食时尚背后的大头条是多么容易。而Onneken想要以贡佐的方式来做这件事：通过参与来揭示饮食研究-媒体复合体的腐败。\n这个电话并不完全出人意料。前一年，我为“科学”(Science)组织了一项收费开放获取期刊的诱捕行动，这是学术出版业中一个快速增长、利润丰厚的新领域。为了找出这些出版商中有多少人信守承诺，进行严格的同行审查，我提交了有可笑缺陷的论文，并统计了有多少出版商拒绝了这些论文。(答案是：不到一半。)。\nOnneken和Löbl已经准备好了一切：招募研究对象的几千欧元，运行这项研究的一名德国医生，以及处理数据的一位统计学家朋友。奥内肯听说了我的杂志“刺痛”，认为我会知道如何把它整理起来并出版。唯一的问题是时间：这部电影计划在春末在德国和法国的电视台播出(下周首映)，所以我们真的只有几个月的时间来完成这件事。\n我们能出版一些东西吗？可能吧。但除此之外呢？我以为它肯定会失败的。我们科学记者喜欢认为自己比一般的黑客更聪明。毕竟，我们必须充分理解神秘的科学研究才能解释它。对于没有科学基础的记者来说，一旦他们为他们的报道寻找外部来源-实际上任何人都有科学学位，更不用说真正的营养科学家-他们会发现这项研究是可笑的薄弱的。更不用说在谷歌上搜索没有找到约翰尼斯·博汉南或他所谓的研究所的任何踪迹。健康科学快报的记者们在一英里外就能闻到这一点。但我不想听起来很悲观。“让我们看看我们能走多远，”我说。\nOnneken和Löbl没有浪费时间。他们利用Facebook在法兰克福各地招募受试者，向任何愿意节食3周的人提供150欧元的奖励。他们明确表示，这是一部关于节食的纪录片的一部分，但他们没有透露更多细节。在一个寒冷的一月早晨，5名男性和11名女性出现，年龄在19岁到67岁之间。\n参与恶作剧的全科医生冈特·弗兰克(Gunter Frank)主持了这项临床试验。奥内肯是在读了弗兰克写的一本抨击饮食伪科学的畅销书后把他拉进来的。测试苦巧克力作为膳食补充剂是他的主意。当我问他为什么时，弗兰克说这是“全食”狂热分子的最爱。他说：“苦巧克力味道不好，所以一定对你有好处。”“这就像一种宗教。”\n在一轮问卷调查和血液测试以确保没有人患有进食障碍、糖尿病或其他可能危及他们的疾病后，弗兰克随机将受试者分配到三个节食组中的一个。其中一组遵循低碳水化合物饮食。另一组遵循相同的低碳水化合物饮食，外加每天1.5盎司。一块黑巧克力。其余的是控制组，他们被指示不要改变他们目前的饮食。在21天的时间里，他们每天早上都称体重，研究以最后一轮问卷和血液测试结束。\nOnneken随后求助于他的朋友亚历克斯·德罗斯特-哈尔斯(Alex Droste-Haars)，他是一名金融分析师，负责处理这些数字。一个周末后喝啤酒，然后..。中头奖了！两个治疗组在研究过程中都减掉了约5磅，而对照组的平均体重在零上下波动。但是吃低碳水化合物饮食加巧克力的人呢？他们减肥的速度快了10%。这一差异不仅在统计上显著，而且巧克力组在幸福感调查中有更好的胆固醇读数和更高的得分。\n我知道你在想什么。这项研究确实显示巧克力组的体重加速下降--我们不应该相信它吗？科学不就是这样运作的吗？\n这里有一个肮脏的科学小秘密：如果你测量关于少数人的大量东西，几乎可以保证你会得到一个“具有统计学意义”的结果。我们的研究包括来自15个人的18项不同的测量-体重、胆固醇、钠、血液蛋白水平、睡眠质量、幸福感等。(有一个主题被删除了。)。那个研究设计是假阳性的秘诀。\n把这些尺寸想象成彩票。每个人都有很小的机会以“有意义的”结果的形式得到回报，我们可以编造一个故事，然后卖给媒体。你买的票越多，你赢的可能性就越大。我们不知道确切的结果是什么-标题可能是巧克力改善睡眠或降低血压-但我们知道我们得到至少一个“有统计学意义的”结果的机会相当大。\n每当你听到这个短语，它就意味着某个结果的p值很小。字母p似乎有图腾般的力量，但它只是一种衡量数据中信噪比的方法。“显著”的传统界限是0.05，这意味着你的结果只有5%的可能性是随机波动的。彩票越多，得到假阳性的机会就越大。那么您需要买几张票呢？\n在我们的18项测量中，我们有60%的机会在p&lt；0.05中得到一些“有意义的”结果。(测量结果不是独立的，所以可能会更高。)。这场比赛对我们有利。\n这叫做p-hacking--篡改你的实验设计和数据，把p压到0.05以下--这是个大问题。大多数科学家都是诚实的，而且在不知不觉中做到了这一点。他们得到否定的结果，让自己相信自己做错了，然后重复这个实验，直到“奏效”。或者他们丢弃“离群值”数据点。\n但是，即使我们小心翼翼地避免了p-hack，我们的研究也注定会因为受试者的数量很少而失败，这放大了不可控因素的影响。仅举一个例子：女性的体重在她的月经周期中可以波动多达5磅，远远大于我们的巧克力组和低碳水化合物组之间的体重差异。这就是为什么你需要使用大量的人，并平衡不同治疗组的年龄和性别。(我们没有费心。)。\n你与其试着解读我们的结果，还不如读一读茶叶。巧克力可能是减肥的加速器，也可能是相反的。你甚至不能相信我们的非巧克力低碳水化合物组与对照组相比所经历的减肥。谁知道控制组的那几个人吃的是什么呢？我们甚至都没问他们。\n幸运的是，科学家们正逐渐意识到这些问题。一些期刊正试图完全取消p值显著性测试，以推动科学家养成更好的习惯。而且几乎没有人再认真对待少于30个对象的研究。有信誉的期刊的编辑在把它们发给同行评审员之前，会立即拒绝它们。但是，有很多期刊更关心金钱而不是声誉。\n现在是与世界分享我们的科学突破的时候了。我们需要尽快发表我们的研究，但由于它是如此糟糕的科学，我们需要完全跳过同行评议。方便的是，这里有假期刊出版商的名单。(这是我的单子，还有一张单子。)。由于时间紧迫，我同时向20家期刊提交了我们的论文--“高可可含量的巧克力作为减肥加速器”。然后我们交叉手指，等待着。\n我们的论文在24小时内被多家期刊接受发表。不用说，我们根本没有面临同行评审。我们最终选择的热切追求者是国际医学档案馆(International Archives Of Medicine)。它过去是由巨头出版商BioMedCentral运营的，但最近易手了。这家新出版商的首席执行官卡洛斯·瓦斯克斯(Carlos Vasquez)给约翰尼斯发了一封电子邮件，告诉他我们已经制作了一份“杰出的手稿”，只需600欧元，“我们的顶级期刊就可以直接接受”。\n报纸出来了，是时候制造点噪音了。我给一位在科学公关工作的朋友的朋友打了电话。她教我一些抢头条的肮脏把戏。每天听到我所经历的事情的另一面是令人毛骨悚然的。\n关键是利用记者令人难以置信的懒惰。如果你把信息安排得恰到好处，你就可以塑造媒体上出现的故事，就像你自己写这些故事一样。事实上，这就是你正在做的事情，因为很多记者刚刚复制和粘贴了我们的文本。\n看看我炮制的新闻稿。它什么都有。用记者的行话来说：性感的领带，清晰的坚果格拉夫，一些有力的引语，还有踢腿。甚至不需要阅读科学论文，因为关键细节已经被概括了。我特别注意保持它的准确性。这样做的目的不是欺骗记者，而是用一篇关于研究论文的完全典型的新闻稿来引诱他们。(当然，缺少的是受试者的数量和各组之间微小的体重差异。)。\n但一份好的新闻稿是不够的。记者们也渴望“艺术”，向他们的读者展示一些漂亮的东西。因此，Onneken和Löbl拍摄了一些宣传视频剪辑，并委托自由职业艺术家写了一首原声民谣，甚至还写了一首关于巧克力和减肥的说唱。(事实证明，你几乎可以在互联网上雇人做任何事情。)。\nOnneken写了一份德国新闻稿，并直接联系了德国媒体。一个“独家”故事的承诺是非常诱人的，即使它是假的。然后，他在奥地利的通讯社上猛烈抨击了德国的新闻稿，而英国的新闻稿则通过新闻通讯社(Newswire)发布。没有质量控制。这是留给记者们的。\n当我们的诱饵散发到这个世界上时，我感到骄傲和厌恶交织在一起，令人毛骨悚然。\n我们甚至在知道大鱼上钩之前就钓上了大鱼。“图片报”匆忙发布了他们的故事--“吃巧克力的人保持苗条！”--根本没有联系我。很快，我们登上了“每日星报”、“爱尔兰审查者”、“世界报”的德文网站、“印度时报”(赫芬顿邮报的德文和印度网站)，甚至还登上了德克萨斯州的电视新闻和一档澳大利亚早间脱口秀节目。\n当记者们与我联系时，他们总是敷衍了事地问我问题。“你认为巧克力为什么会加速减肥呢？您对我们的读者有什么建议吗？“。几乎没有人问我们测试了多少受试者，也没有人报告这个数字。似乎没有一个记者联系过外部研究人员。没有引用任何内容。\n这些出版物虽然拥有大量读者，但并不完全是新闻美德的典范。因此，他们会简单地抓住一些数字好友作为标题，收获页面浏览量，然后继续前进，这也就不足为奇了。但是，即使是那些被认为是严格的媒体也没有发现漏洞。\n“Shape”杂志对我们研究的报道-在6月刊翻到第128页-使用了事实核查人员的服务，但同样乏善可陈。检查员所做的就是让我检查几句话，以确保准确性，并检查我名字的拼写。报道甚至详细说明了减肥巧克力的适当可可含量(81%)，甚至提到了两个具体的品牌(“在杂货店和亚马逊网站上都有售”)。\n一些人躲过了子弹。“男性健康”的一名记者通过电子邮件采访了我，问了我一些同样的非探索性问题。她说这篇报道选在了他们九月刊上，所以我们永远不会知道。\n但最令人失望的是吗？没有人吃过我们的自助餐巧克力音乐录像带。取而代之的是，他们使用了含糊的女性吃巧克力的色情图片。也许，既然真相已经浮出水面，这首音乐就会焕发出自己的生命力：\n那你为什么要在乎呢？迫切需要可靠信息的人面临着一系列令人眼花缭乱的饮食指导-盐是坏的，盐是好的，蛋白质是好的，蛋白质是坏的，脂肪是坏的，脂肪是好的-这些指导就像天气一样变化。但是科学会解决这个问题的，对吧？现在我们称肥胖是一种流行病，资金将流向最优秀的科学家，所有这些噪音都会平息下来，给我们留下关于病因和治疗的明确答案。\n也可能不是。外科医生彼得·阿提亚(Peter Attia)哀叹道，即使是资金充足、严肃的减肥科学研究也令人困惑，而且没有定论。阿提亚是一家名为营养科学倡议(Nutrition Science Initiative)的非营利性组织的联合创始人。例如，妇女健康倡议--此类倡议中规模最大的倡议之一--对饮食和健康几乎没有产生明确的见解。“结果令人困惑，”阿提亚说。“他们花了10亿美元，甚至不能证明低脂饮食是好是坏。”阿提亚的非营利组织正试图筹集1.9亿美元来回答这些根本问题。但他说，很难将注意力集中在肥胖科学上。“噪音太大了。”你可以为此感谢像我这样的人。我们记者必须养活每天的新闻野兽，而饮食科学是我们丰盛的号角。关于红酒的好处或果糖的危险，读者总是听不够。它不仅是普遍相关的--它与我们所有人每天至少做三次决定有关--而且它是科学！我们甚至不需要离开家去做任何报道。我们只需将杯子浸入每天流经我们收件箱的科学新闻稿流中即可。贴上一张漂亮的股票照片，你就完成了。\n节食科学节拍的唯一问题是它是科学。你必须知道如何阅读一篇科学论文，并真正费心去做。太久以来，报道这一消息的人一直把它当作八卦，呼应他们在新闻稿中找到的任何东西。希望我们的小实验能让记者和读者都更加怀疑。如果一项研究甚至没有列出有多少人参与其中，或者大胆地声称饮食具有“统计学意义”，但没有说明效果有多大，你应该想知道为什么。但在很大程度上，我们没有。这很遗憾，因为记者正在成为事实上的同行评议制度。当我们失败的时候，世界上充斥着垃圾科学。\n这部悲喜剧中有一线希望。虽然记者只是反驳我们的“调查结果”，但许多读者却深思熟虑，表示怀疑。在网上评论中，他们提出了记者本应提出的问题。\n“为什么每个人的卡路里都不算呢？”一位读者在健美论坛上问道。“[饮食与健康研究所网站]的域名是在3月初注册的，数十个博客和新闻杂志(参见谷歌)传播了这项研究，但不知道背后是什么，也不知道是谁在背后支持它，”德国领先的在线杂志之一“焦点”(Focus)故事下面的一位读者说。或者，正如“每日快报”4月4日报道的一位有先见之明的读者所说：“在营养方面，每一天都是愚人节的日子。”\n更正：彼得·阿提亚引用的研究名为“妇女健康倡议”(Women‘s Health Initiative)，而不是“妇女健康研究”(Women’s Health Study)，它是同类研究中规模最大的，而不是最大的。此外，当这篇文章发表时，错误地展示了“每日邮报”对一项巧克力研究的报道截图，而不是这篇报道中讨论的那一项。发表后的第二天，我们把它换成了“每日邮报”对这项研究的实际报道的截图。", "note_en": "“Slim by Chocolate!” the headlines blared. A team of German researchers had found that people on a low-carb diet lost weight 10 percent faster if they ate a chocolate bar every day. It made the front page of  Bild, Europe’s largest daily newspaper, just beneath their update about the Germanwings crash. From there, it ricocheted around the internet and beyond, making news in more than 20 countries and half a dozen languages. It was discussed on television news shows. It appeared in glossy print, most recently in the June issue of  Shape magazine (“Why You Must Eat Chocolate Daily,” page 128). Not only does chocolate accelerate weight loss, the study found, but it leads to healthier cholesterol levels and overall increased well-being. The  Bild story quotes the study’s lead author, Johannes Bohannon, Ph.D., research director of the Institute of Diet and Health: “The best part is you can buy chocolate everywhere.”\n    I am Johannes Bohannon, Ph.D. Well, actually my name is John, and I’m a journalist. I do have a Ph.D., but it’s in the molecular biology of bacteria, not humans. The   Institute of Diet and Health? That’s nothing more than a website.\n Other than those fibs, the study was 100 percent authentic. My colleagues and I recruited actual human subjects in Germany. We ran an actual clinical trial, with subjects randomly assigned to different diet regimes. And the statistically significant benefits of chocolate that we reported are based on the actual data. It was, in fact, a fairly typical study for the field of diet research. Which is to say: It was terrible science. The results are meaningless, and the health claims that the media blasted out to millions of people around the world are utterly unfounded.\n    I got a call in December last year from a German television reporter named Peter Onneken. He and his collaborator Diana Löbl were working on a documentary film about the junk-science diet industry. They wanted me to help demonstrate just how easy it is to turn bad science into the big headlines behind diet fads. And Onneken wanted to do it gonzo style: Reveal the corruption of the diet research-media complex by taking part.\n    The call wasn’t a complete surprise. The year before, I had run a sting operation for  Science on   fee-charging open access journals, a fast-growing and lucrative new sector of the academic publishing business. To find out how many of those publishers are keeping their promise of doing rigorous peer review, I submitted ridiculously flawed papers and counted how many rejected them. (Answer:   fewer than half.)\n  Onneken and Löbl had everything lined up: a few thousand Euros to recruit research subjects, a German doctor to run the study, and a statistician friend to massage the data. Onneken heard about my journal sting and figured that I would know how to pull it all together and get it published. The only problem was time: The film was scheduled to be aired on German and French television in the late spring (  it premieres next week), so we really only had a couple of months to pull this off.\n Could we get something published? Probably. But beyond that? I thought it was sure to fizzle. We science journalists like to think of ourselves as more clever than the average hack. After all, we have to understand arcane scientific research well enough to explain it. And for reporters who don’t have science chops, as soon as they tapped outside sources for their stories—really anyone with a science degree, let alone an actual nutrition scientist—they would discover that the study was laughably flimsy. Not to mention that a Google search yielded no trace of Johannes Bohannon or his alleged institute. Reporters on the health science beat were going to smell this a mile away. But I didn’t want to sound pessimistic. “Let’s see how far we can take this,” I said.\n    Onneken and Löbl wasted no time. They used Facebook to recruit subjects around Frankfurt, offering 150 Euros to anyone willing to go on a diet for 3 weeks. They made it clear that this was part of a documentary film about dieting, but they didn’t give more detail. On a cold January morning, 5 men and 11 women showed up, aged 19 to 67.\n  Gunter Frank, a general practitioner in on the prank, ran the clinical trial. Onneken had pulled him in after reading a popular book Frank wrote railing against dietary pseudoscience. Testing bitter chocolate as a dietary supplement was his idea. When I asked him why, Frank said it was a favorite of the “whole food” fanatics. “Bitter chocolate tastes bad, therefore it must be good for you,” he said. “It’s like a religion.”\n   After a round of questionnaires and blood tests to ensure that no one had eating disorders, diabetes, or other illnesses that might endanger them, Frank randomly assigned the subjects to one of three diet groups. One group followed a low-carbohydrate diet. Another followed the same low-carb diet plus a daily 1.5 oz. bar of dark chocolate. And the rest, a control group, were instructed to make no changes to their current diet. They weighed themselves each morning for 21 days, and the study finished with a final round of questionnaires and blood tests.\n Onneken then turned to his friend Alex Droste-Haars, a financial analyst, to crunch the numbers. One beer-fueled weekend later and... jackpot! Both of the treatment groups lost about 5 pounds over the course of the study, while the control group’s average body weight fluctuated up and down around zero. But the people on the low-carb diet plus chocolate? They lost weight 10 percent faster. Not only was that difference statistically significant, but the chocolate group had better cholesterol readings and higher scores on the well-being survey.\n   I know what you’re thinking. The study  did show accelerated weight loss in the chocolate group—shouldn’t we trust it? Isn’t that how science works?\n   Here’s a dirty little science secret: If you measure a large number of things about a small number of people, you are almost guaranteed to get a “statistically significant” result. Our study included 18 different measurements—weight, cholesterol, sodium, blood protein levels, sleep quality, well-being, etc.—from 15 people. (One subject was dropped.) That study design is a recipe for false positives.\n  Think of the measurements as lottery tickets. Each one has a small chance of paying off in the form of a “significant” result that we can spin a story around and sell to the media. The more tickets you buy, the more likely you are to win. We didn’t know exactly what would pan out—the headline could have been that chocolate improves sleep or lowers blood pressure—but we knew our chances of getting at least one “statistically significant” result were pretty good.\n Whenever you hear that phrase, it means that some result has a small  p value. The letter  p seems to have totemic power, but it’s just a way to gauge the signal-to-noise ratio in the data. The conventional cutoff for being “significant” is 0.05, which means that there is just a 5 percent chance that your result is a random fluctuation. The more lottery tickets, the better your chances of getting a false positive. So how many tickets do you need to buy?\n   With our 18 measurements, we had a 60% chance of getting some“significant” result with  p &lt; 0.05. (The measurements weren’t independent, so it could be even higher.) The game was stacked in our favor.\n  It’s called p-hacking—fiddling with your experimental design and data to push  p under 0.05—and it’s   a big problem. Most scientists are honest and do it unconsciously. They get negative results, convince themselves they goofed, and repeat the experiment until it “works.” Or they drop “outlier” data points.\n   But even if we had been careful to avoid p-hacking, our study was doomed by the tiny number of subjects, which amplifies the effects of uncontrolled factors. Just to take one example: A woman’s weight can fluctuate as much as 5 pounds over the course of her menstrual cycle, far greater than the weight difference between our chocolate and low-carb groups. Which is why you need to use a large number of people, and balance age and gender across treatment groups. (We didn’t bother.)\n You might as well read tea leaves as try to interpret our results. Chocolate may be a weight loss accelerator, or it could be the opposite. You can’t even trust the weight loss that our non-chocolate low-carb group experienced versus control. Who knows what the handful of people in the control group were eating? We didn’t even ask them.\n  Luckily, scientists are getting wise to these problems. Some journals are trying to phase out  p value significance testing altogether to nudge scientists into better habits. And almost no one takes studies with fewer than 30 subjects seriously anymore. Editors of reputable journals reject them out of hand before sending them to peer reviewers. But there are plenty of journals that care more about money than reputation.\n  It was time to share our scientific breakthrough with the world. We needed to get our study published pronto, but since it was such bad science, we needed to skip peer review altogether. Conveniently, there are lists of fake journal publishers. (This is   my list, and here’s   another.) Since time was tight, I simultaneously submitted our paper—“Chocolate with high cocoa content as a weight-loss accelerator”—to 20 journals. Then we crossed our fingers and waited.\n   Our paper was accepted for publication by multiple journals within 24 hours. Needless to say, we faced no peer review at all. The eager suitor we ultimately chose was the   t  he International Archives of Medicine. It used to be run by the giant publisher BioMedCentral, but recently changed hands. The new publisher’s CEO, Carlos Vasquez, emailed Johannes to let him know that we had produced an “outstanding manuscript,” and that for just 600 Euros it “could be accepted directly in our premier journal.”\n    With the paper out, it was time to make some noise. I called a friend of a friend who works in scientific PR. She walked me through some of the dirty tricks for grabbing headlines. It was eerie to hear the other side of something I experience every day.\n  The key is to exploit journalists’ incredible laziness. If you lay out the information just right, you can shape the story that emerges in the media almost like you were writing those stories yourself. In fact, that’s literally what you’re doing, since many reporters just copied and pasted our text.\n Take a look at the   press release I cooked up. It has everything. In reporter lingo: a sexy lede, a clear nut graf, some punchy quotes, and a kicker. And there’s no need to even read the scientific paper because the key details are already boiled down. I took special care to keep it accurate. Rather than tricking journalists, the goal was to lure them with a completely typical press release about a research paper. (Of course, what’s missing is the number of subjects and the minuscule weight differences between the groups.)\n   But a good press release isn’t enough. Reporters are also hungry for “art,” something pretty to show their readers. So Onneken and Löbl shot some promotional video clips and commissioned freelance artists to write an acoustic ballad and even a rap about chocolate and weight loss. (It turns out you can hire people on the internet to do nearly anything.)\n  Onneken wrote a German press release and reached out directly to German media outlets. The promise of an “exclusive” story is very tempting, even if it’s fake. Then he blasted the German press release out on wire service based in Austria, and the English one went out on NewsWire. There was no quality control. That was left to the reporters.\n I felt a queazy mixture of pride and disgust as our lure zinged out into the world.\n   We landed big fish before we even knew they were biting.  Bild rushed their story out—“Those who eat chocolate stay slim!”—without contacting me at all. Soon we were in the    Daily Star, the    Irish Examiner,     Cosmopolitan’s German website, the    Times of India, both the   German and   Indian site of the Huffington Post, and even   television news in Texas and an   Australian morning talk show.\n  When reporters contacted me at all, they asked perfunctory questions. “Why do you think chocolate accelerates weight loss? Do you have any advice for our readers?” Almost no one asked how many subjects we tested, and no one reported that number. Not a single reporter seems to have contacted an outside researcher. None is quoted.\n   These publications, though many command large audiences, are not exactly paragons of journalistic virtue. So it’s not surprising that they would simply grab a bit of digital chum for the headline, harvest the pageviews, and move on. But even the supposedly rigorous outlets that picked the study up failed to spot the holes.\n Shape magazine’s reporting on our study—turn to page 128 in the June issue—employed the services of a fact-checker, but it was just as lackadaisical. All the checker did was run a couple of sentences by me for accuracy and check the spelling of my name. The coverage went so far as to specify the appropriate cocoa content for weight-loss-inducing chocolate (81 percent) and even mentioned two specific brands (“available in grocery stores and at amazon.com”).\n  Some dodged the bullet. A reporter from  Men’s Health interviewed me by email, asking the same sort of non-probing questions. She said that the story was slated for their September issue, so we’ll never know.\n But most disappointing? No one dipped into our buffet of chocolate music videos. Instead, they used vaguely pornographic images of women eating chocolate. Perhaps this music will take on a life of its own now that the truth is out:\n    So why should you care? People who are desperate for reliable information face a bewildering array of diet guidance—  salt is bad,   salt is good,   protein is good,   protein is bad,   fat is bad,   fat is good—that changes like the weather. But science will figure it out, right? Now that we’re calling obesity an epidemic, funding will flow to the best scientists and all of this noise will die down, leaving us with clear answers to the causes and treatments.\n   Or maybe not. Even the well-funded, serious research into weight-loss science is confusing and inconclusive, laments Peter Attia, a surgeon who cofounded a nonprofit called the   Nutrition Science Initiative. For example, the   Women’s Health Initiative—one of the largest of its kind—yielded few clear insights about diet and health. “The results were just confusing,” says Attia. “They spent $1 billion and couldn’t even prove that a low-fat diet is better or worse.” Attia’s nonprofit is   trying to raise $190 million to answer these fundamental questions. But it’s hard to focus attention on the science of obesity, he says. “There’s just so much noise.”  You can thank people like me for that. We journalists have to feed the daily news beast, and diet science is our horn of plenty. Readers just can’t get enough stories about the benefits of red wine or the dangers of fructose. Not only is it universally relevant—it pertains to decisions we all make at least three times a day—but it’s science! We don’t even have to leave home to do any reporting. We just dip our cups into the daily stream of scientific press releases flowing through our inboxes. Tack on a snappy stock photo and you’re done.\n   The only problem with the diet science beat is that it’s  science. You have to know how to read a scientific paper—and actually bother to do it. For far too long, the people who cover this beat have treated it like gossip, echoing whatever they find in press releases. Hopefully our little experiment will make reporters and readers alike more skeptical.  If a study doesn’t even list how many people took part in it, or makes a bold diet claim that’s “statistically significant” but doesn’t say how big the effect size is, you should wonder why. But for the most part, we don’t. Which is a pity, because journalists are becoming the de facto peer review system. And when we fail, the world is awash in junk science.\n  There was one glint of hope in this tragicomedy. While the reporters just regurgitated our “findings,” many readers were thoughtful and skeptical. In the online comments, they posed questions that the reporters should have asked.\n “Why are calories not counted on any of the individuals?” asked a reader on a   bodybuilding forum. “The domain [for the Institute of Diet and Health web site] was registered at the beginning of March, and dozens of blogs and news magazines (see Google) spread this study without knowing what or who stands behind it,” said   a reader beneath the story in Focus, one of Germany’s leading online magazines.   Or as one prescient reader of the   4 April story in the  Daily Express put it, “Every day is April Fool’s in nutrition.”\n  Correction:  The study referenced by Peter Attia was called the Women’s Health Initiative, not the Women’s Health Study, and it was one of the largest of its kind, not the largest. Also, when it was published, this article erroneously featured a screenshot showing the Daily Mail’s coverage of a chocolate study, but not the one discussed in this story. The day after publication, we replaced it with a screenshot of the Daily Mail’s    actual coverage  of the study.", "posttime": "2020-06-26 07:53:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认为,millions,研究", "title": "我愚弄了数百万人，让他们认为巧克力有助于减肥(2015)", "title_en": "I Fooled Millions into Thinking Chocolate Helps Weight Loss (2015)", "transed": 1, "url": "https://io9.gizmodo.com/i-fooled-millions-into-thinking-chocolate-helps-weight-1707251800", "via": "", "real_tags": ["认为", "millions", "研究"]}, {"category": "", "categoryclass": "", "imagename": "44801770939a0a20a33244f2bcfb51b3.jpeg", "infoid": 1008322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-Verizon Communications Inc.周四表示，它将暂停Facebook Inc.上的广告，此前一场运动得到了广泛支持，该运动呼吁这家社交媒体巨头在阻止其平台上的仇恨言论方面做得不够。\nVerizon的一位代表说：“我们将暂停我们的广告，直到Facebook能够创造出一个可以接受的、让我们感到舒服的解决方案。”\nVerizon加入了一批美国公司的行列，这些公司已经停止在Facebook上投放广告，以支持由几个美国民权组织发起的停止仇恨牟利运动，尽管Facebook正在努力遏制日益增长的反抗活动。\n冰激凌品牌Ben&amp；Jerry‘s和户外用品公司巴塔哥尼亚(Patagonia)和The North Face等10个品牌此前表示将暂停在社交媒体网站上投放广告。\nFacebook负责全球业务的副总裁卡罗琳·埃弗森(Carolyn Everson)表示：“我们尊重任何品牌的决定，并继续专注于消除仇恨言论和提供关键投票信息的重要工作。”", "note_en": "(Reuters) - Verizon Communications Inc said on Thursday it was pausing advertising on Facebook Inc following widespread support for a campaign that called out the social media giant for not doing enough to stop hate speech on its platforms.\n “We’re pausing our advertising until Facebook can create an acceptable solution that makes us comfortable,” a Verizon representative said.\n Verizon joins a list of U.S. companies that have stopped advertising on Facebook in support of the Stop Hate for Profit campaign, started by several U.S. civil rights groups, even as Facebook worked to contain the growing revolt.\n Ice cream brand Ben &amp; Jerry’s and outdoor gear companies Patagonia and The North Face are among 10 brands that previously said they would suspend ads on the social media site.\n  “We respect any brand’s decision and remain focused on the important work of removing hate speech and providing critical voting information,” said Carolyn Everson, vice president of global business for Facebook.", "posttime": "2020-06-26 07:33:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,facebook,抵制,suspends", "title": "Verizon暂停Facebook广告，加入日益高涨的抵制行动", "title_en": "Verizon suspends advertising on Facebook, joins growing boycott", "transed": 1, "url": "https://www.reuters.com/article/us-facebook-ads-boycott-verizon/verizon-suspends-advertising-on-facebook-joins-growing-boycott-idUSKBN23W3HK", "via": "", "real_tags": ["广告", "facebook", "抵制", "suspends"]}, {"category": "", "categoryclass": "", "imagename": "6ac9288da50b4af7a5038aa13ec0bf97.png", "infoid": 1008321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "继我上一篇帖子“为什么我喜欢嘿，但它不适合我”之后，这里有一个简短的指南，关于把嘿的一些功能带回我的电子邮件服务。\n我将使用Fastmail进行演示，因为这是我的主要电子邮件，所以您需要调整一些内容以适应您自己的应用程序/服务。一定要查看手册/帮助页面，以便弄清楚如何操作。(在某些情况下，这可能根本不可能)。\n只是为了好玩，我会尽可能多地重新创建嘿，但请记住，我实际上不会像那样使用我的电子邮件，🙂拿走你喜欢的，剩下的就留下。\n在“远程图像”下，确保选择“总是在显示远程图像之前询问”(或其他允许从联系人获取远程图像的选项)。\n在“邮件”下，选择“隐藏阅读窗格”，以便更集中地查看每封邮件。\n仍在邮件中，请选择按文件夹而不是标签进行组织。这让它变得更容易(老实说，我只是更喜欢文件夹而不是标签)。\n转到通知页面。如果您需要通知，请立即打开它，但请从我的VIP联系人中选择。VIP联系人是一个快速邮件组，可在此用于限制值得通知的重要邮件。\n如下图所示，如果您有过滤器，您还可以指定应在其中使用通知的其他文件夹。\n现在让我们添加几个文件夹。在文件夹设置中，添加以下文件夹。\n我把屏幕移到了顶部，因为它真的是一种收件箱。您可以随意给它们其他颜色，以帮助区分它们。我还使用了Fastmail的一些高级文件夹设置来自定义其中一些文件夹的行为。\nFeed获取时事通讯和其他不重要的内容。因此，如果没有未读项目(或如果为空)，则可以将其隐藏。我还启用了31天后删除消息的选项。\n我们可以使用高级搜索条件，然后将这些搜索另存为文件夹，以便再次快速访问它们。可以把它想象成“虚拟文件夹”。我会用其中的3个。文档、PDF和预留。文档和PDF只是查看带有此类附件的电子邮件的快捷方式。YMMV，所以让它们像您认为的那样对您有用。SaveSide将使用邮件的“固定”状态。当然，如果您愿意，您也可以创建一个同名的文件夹，然后将邮件移入或移出该文件夹。但我更喜欢把它们放在文件夹里整理。\n现在，让我们看看如何创建规则(也称为筛选器)来将新邮件放在适当的位置。\nFastmail规则的系统按顺序处理规则，因此哪条规则排在第一位很重要。在这里，我们希望筛选程序是最优先的，因为在首先筛选之前，任何内容都不应该进入任何其他文件夹。\n筛选规则是最简单的。我们将依赖联系人是否在我们的联系人列表中。但我稍后会解释它的工作原理。\n至于饲料和纸迹，我认为我们可以制作出比嘿更好的东西。我认为嘿依赖于手动过滤器。您决定将哪个电子邮件地址发送到提要或纸质跟踪，然后它会一直应用相同的规则。这可能并不理想。因此，我是这样做的：如果我们发现电子邮件标题中有list-id，内容中有“取消订阅”一词，我们可以非常确定这是一份时事通讯。\n显然，你仍然可以创造出其他方式。例如，一个好的方法是为时事通讯创建一个联系人组，然后按该组进行过滤。然后，您可以在第一次收到电子邮件时将联系人添加到该组。到目前为止，我觉得没有必要这么做。\n对于纸质小道，我再次认为我的系统更好，因为它避免了我一个接一个地做决定。我试图创建一个智能过滤器，它不仅可以在英语中使用，也可以在我自己的母语上使用。只要在你认为合适的时候多加几个字就行了。\n我的收件箱是我的首要任务，但有时事情会在屏幕上结束(特别是在开始时，当你需要“批准”你的联系人时)。当您想要/有时间时，打开屏幕中的消息并决定。\n打开一封电子邮件，问问自己，我是否要完全阻止此发件人？要执行此操作，请单击更多按钮，然后选择阻止发件人。(您可以稍后在设置的筛选器部分撤消此操作)。然后删除该消息。\n如果您确实想接收来自此联系人的更多电子邮件，请在标题中单击其名称，然后添加到联系人。这将在下次绕过屏幕过滤器。您现在可以将此邮件移动到您的收件箱、存档、删除…。\n至于稍后回复，只需将收件箱(或其他文件夹)中的任何电子邮件拖到该收件箱中即可。这是一种对需要回复的电子邮件进行分类的便捷方式。\n如果你想留出一些电子邮件(供参考，等等)。只要把它们固定住，我们的智能搜索文件夹就会完成剩下的工作。\n我希望这是有用的！事实上，我认为嘿组织电子邮件的方式并不是最好的，但肯定是进步了一步(或几步！)。从人们通常杂乱无章的收件箱方式中脱颖而出，这是对他们的赞誉。\n如果Fastmail可以改进并添加几个简单的功能来更好地使用文件夹，比如。\n按每个文件夹显示未读或总计数-这将允许将文件夹/标签用作列表(我不在乎是否未读，只需告诉我有多少封电子邮件)。\n更好地组织保存的搜索。我很希望能把它们列在清单上，特别是“钉住”的那个。\n我是不是错过了做得更好的创造性方式？你知道怎么扩大这个吗？我很想听听更多的想法🙂。\n假设您正在写信意味着您不想阻止他/她，这将省去您以后必须筛选电子邮件的麻烦😉", "note_en": "Following up on my last post “Why I loved Hey but it isn’t for me” here’s a short guide on bringing some of Hey’s features back into my email service.\n I’ll be demo-ing this using Fastmail because it’s my main email, so you will need to adapt somethings to your own app/service. Make sure to check the manual/help pages in order to figure out how to do it. (in some cases it might not be possible at all).\n Just for fun, I’ll be re-creating as much as possible of Hey, but keep in mind I don’t actually use my email like that 🙂 Take what you like and leave the rest.\n   Under  Remote images make sure to select   Always ask before showing remote images (or the other option that allows remote images from your contacts).\n Under  Mail, select  Hide reading pane, to have a more focused view of each message.\n Still in  Mail , choose to organize by  Folders instead of Labels. This makes it easier (and honestly I just prefer folders to labels).\n  Head to the  Notifications page. If you want notifications, turn it now, but select from  My VIP Contacts. VIP Contacts is a Fastmail group, which can be used here to restrict important messages that are notification worthy.\n As shown in the picture below, in case you have filters, you can also specify other folders where notifications should be used.\n   Let’s add a few folders now. In the Folders settings, add the following folders\n  I moved the Screener to the top, as it is a kind of an Inbox, really. Feel free to give them other colors to help distinguish them. I’ve also used some of Fastmail’s advanced folder settings to customize the behavior of some of these folders.\n The Feed gets newsletters and other non-important stuff. So you can  hide it if there are no unread items (or if empty). I’ve also enabled the option to  delete messages after 31 days.\n    We can use advanced search criteria and then save those searches as folders to quickly access them again. Think of it as “virtual folders”. I’ll be using 3 of them.  Docs, PDFs and  Set Aside.  Docs and  PDFs are just a quick way to see emails with these kind of attachments. YMMV, so make them as you see useful for you.  Set Aside will use the “pinned” state of messages. Of course that, if you prefer, you could also just create a folder with this same name, and move the messages in and out of the folder. But I prefer to keep them organized in folders.\n     Now lets see how to create rules (aka filters) to put new messages in their proper places\n Fastmail rules’ system processes rules in order, so it matters which rule comes first. Here we want the screener to be the top priority because nothing should go to any other folder before being screened first.\n The  Screener rule is the most simple one. We will rely on a contact being or not part of our contact list. But I’ll explain the workings later.\n  For the  Feed and  Paper Trail I think we can make something even better than Hey’s. I think Hey relies on manual filters. You decide which email address goes to the feed or paper trail, and then it applies the same rule all the time. This may not be ideal. So here’s how I did it: if we find that there is a  list-id in the email header and the word  “unsubscribe” in the contents, we can be pretty sure this is a newsletter.\n  You can obviously still create other ways. For  instance, a good method would be to create a contact group for newsletters and then filter by the group. You can then just add contacts to that group the first time you receive an email. So far, I didn’t feel the need for this.\n For the  Paper Trail, again I think my system is better as it avoids me doing decisions one-by-one. I tried to create a smart filter that works not only in english but on my own native language as well. Just add more words as you see fit\n    My Inbox is my priority, but sometimes things will end up in the Screener (especially in the beginning when you need to “approve” your contacts). When you feel like it/have time, open the messages in the Screener and decide\n  Open an email and ask yourself, do I want to completely block this sender? To do so, click the  More button and select  Block sender. (you can undo this later in the Filters sections of the settings). Then delete the message.\n  If you do want to receive more emails from this contact, click it’s name in the header and then  Add to contacts. This will bypass the screener filter next time. You can now move this message to your Inbox, archive, delete…\n  As for  Reply Later, it’s as simple as dragging any email from your Inbox(or other folder) to that one. It’s a convenient way to sort out emails that need a reply.\n If you want to  Set Aside some emails (for reference, etc). Just  pin them and our smart search folder will do the rest.\n   I hope this was useful! I actually think Hey’s way to organize emails is not the best, but its definitely a step up (or several!) from the usual chaotic way people have their inboxes, so kudos to them.\n I’d love if Fastmail could improve and add a few simple features that would make a ton of difference to better use folders like\n showing the unread OR total count by each folder – this would allow folders/labels to be used as lists (I dont care if its unread or not, just tell me how many emails are there)\n better organization of saved searches. I would love to be able to bring them up in the list, especially the “pinned” one.\n Did I miss some creative way to do something even better? Do you know how to expand this? I’d love to hear more ideas 🙂\n     Assuming that if you are writing means you don’t want to block him/her, this will save you the trouble of having to screen the email later 😉", "posttime": "2020-06-26 07:33:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hey,电子邮件", "title": "使用Fastmail重新创建一些嘿的功能", "title_en": "Re-creating some of Hey's features using Fastmail", "transed": 1, "url": "https://www.nunodonato.com/2020/06/25/a-guide-on-re-creating-heys-features/", "via": "", "real_tags": ["hey", "电子邮件"]}]