[{"category": "", "categoryclass": "", "imagename": "3e2daccd2661200864bc63e62700a615.jpg", "infoid": 1012168, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，苹果发布了适用于其所有平台的软件更新，包括iPhone、iPad、Mac、Apple Watch、Apple TV和HomePod。更新应该全天向世界各地的用户推出。\n一般来说，更新的范围相当小。和往常一样，iOS13.6和iPadOS13.6是最强大的，但它们仍然很小。旗舰功能是在iPhone上增加了对数字汽车钥匙的支持。此外，苹果还在Apple News+中添加了语音解说故事，并在News应用程序中扩展了本地新闻和定制选项。在健康应用程序中还有一个新的症状类别，以及各种错误修复。\n以下是苹果针对iOS13.6的发行说明。iPadOS13.6与iPadOS13.6类似，但没有数字汽车钥匙和新闻音频功能。此外，苹果还包括了iOS13.6的安全更新。\niOS13.6增加了对数字汽车钥匙的支持，在Apple News+中引入了音频故事，并在Health应用程序中包含了一个新的症状类别。此版本还包括错误修复和改进。\n动力储备可以让你在iPhone电池耗尽后解锁并启动汽车长达五个小时。\n音频故事是Apple News+中一些最佳读物的专业解说版本，由Apple News编辑选择并制作，作为Apple News+订阅的一部分。\n今日苹果新闻是一个新的、免费的音频简报，来自苹果新闻编辑当天的头条新闻，也可以在播客应用程序中找到。\n新的音频标签使查找今日苹果新闻和苹果新闻+音频故事变得容易\nCarPlay允许您在旅途中收听今日苹果新闻和Apple News+音频故事。\n今日订阅源中的本地新闻广泛报道了旧金山、旧金山湾区、洛杉矶、休斯顿和纽约市。\n您的Apple News每日时事通讯现在可以用反映您兴趣的故事进行个性化。\n健康应用程序中的新症状类别，包括从周期跟踪和ECG记录的症状。\n能够记录新症状，如发烧、发冷、喉咙痛或咳嗽，并与第三方应用程序共享。\n添加新设置以选择在使用Wi-Fi时是否自动将更新下载到您的设备。\n解决了从iCloud Drive同步数据时可能导致应用程序无响应的问题。\n修复了可能导致eSIM上的数据漫游显示为禁用的问题，即使eSIM仍处于活动状态\n修复了一个问题，该问题导致萨斯喀彻温省的一些电话显示为从美国始发。\n修复了阻止某些iPhone 6S和iPhone SE设备注册Wi-Fi呼叫的问题。\n解决了在连接到某些第三方硬件键盘时可能导致软件键盘意外出现的问题。\n修复了可能导致日语硬件键盘错误映射为美国键盘的问题。\n提供一种机制，供管理员指定要从始终在线的VPN连接承载的流量中排除的域。\nMacOS Catalina 10.15.6和watchOS 6.2.8则更为低调。Mac软件更新扩展了Apple News中的本地新闻提供和定制选项，增加了一个新选项来优化兼容HDR的Mac笔记本电脑上的视频流，以延长电池续航时间，并包括重大修复和安全更新。以下是更新说明：\nMacOS Catalina Mac10.15.6在您的‌Apple News‌的今日馈送中介绍本地新闻，并提高您的Mac的安全性和可靠性。\n今日订阅源中的本地新闻广泛报道了旧金山、旧金山湾区、洛杉矶、休斯顿和纽约市\n更多故事可从订阅‌苹果新闻‌+的当地新闻提供商获得。\n您来自‌苹果新闻‌的每日时事通讯现在可以用反映您兴趣的故事进行个性化。\n增加了一个新选项，可在兼容HDR的Mac笔记本电脑上优化视频流，以延长电池续航时间。\nWatchOS 6.2.8在Apple Watch系列5上增加了数字汽车钥匙支持，并将ECG功能和不规则的炉床节奏通知扩展到巴林、巴西和南非。以下是备注：\n‌苹果手表‌系列4或更高版本上的心电应用程序现已在巴林、巴西和南非推出。\n苹果还发布了twOS 13.4.8和HomePod更新13.4.8。据苹果称，这两款产品都提供了稳定性改进和错误修复，但没有新功能。\n本月早些时候，苹果宣布了其工厂的更大年度更新，包括iOS14，iPadOS14，twOS14，watchOS7和MacOS11 Big Sur。我们很可能只会看到像今天这样的小更新，直到那些新版本在9月或10月推出。", "note_en": "Today, Apple released software updates for all of its platforms, including the iPhone, iPad, Mac, Apple Watch, Apple TV, and HomePod. The updates should be rolling out to users around the world throughout the day.\n In general, the updates are fairly small in scope. As usual, iOS 13.6 and iPadOS 13.6 are the beefiest, but they&#39;re still small. The flagship feature is the addition of support for digital car keys on the iPhone. Additionally, Apple has added voice-narrated stories to Apple News+, as well as expanded local news and customization options in the News app. There&#39;s also a new &#34;symptoms&#34; category in the Health app, plus a variety of bug fixes.\n Here are Apple&#39;s release notes for iOS 13.6.  iPadOS 13.6 is similar but lacks digital car keys and the News audio features. Additionally, Apple has included  security updates for iOS 13.6.\n iOS 13.6 adds support for digital car keys, introduces audio stories in Apple News+, and contains a new symptoms category in the Health app. This release also includes bug fixes and improvements.\n  Power reserve lets you unlock and start your car for up to five hours after iPhone runs out of battery\n  Audio stories are professionally narrated versions of some of the best reads from Apple News+, selected and produced by the Apple News editors as part of your Apple News+ subscription\n Apple News Today is a new, free audio briefing on the day&#39;s top stories from the Apple News editors, also available in the Podcasts app\n A new Audio tab makes it easy to find Apple News Today and Apple News+ audio stories\n CarPlay allows you to listen to Apple News Today and Apple News+ audio stories while on the road\n Local news in your Today feed provides extensive coverage of San Francisco, the Bay Area, Los Angeles, Houston, and New York City\n  Your daily newsletter from Apple News can now be personalized with stories that reflect your interests\n  New category for symptoms in the Health app, including symptoms logged from Cycle Tracking and ECG\n Ability to log new symptoms, like fever, chills, sore throat or coughing, and share them with third-party apps\n  Adds a new setting to choose if updates automatically download to your device when on Wi-Fi\n Addresses an issue that could cause apps to become unresponsive when syncing data from iCloud Drive\n Fixes an issue that could cause data roaming to appear to be disabled on eSIM even though it remained active\n Fixes an issue thats causes some phone calls from Saskatchewan to appear as originating from the United States\n  Fixes an issues that prevented some iPhone 6S and iPhone SE devices from registering for Wi-Fi Calling\n Resolves an issue that could cause the software keyboard to appear unexpectedly when connected to certain third-party hardware keyboards\n Fixes an issue that could cause Japanese hardware keyboards to be incorrectly mapped as a U.S. keyboard\n  Provides a mechanism for administrators to specify domains to exclude from traffic carried by always-on VPN connections\n macOS Catalina 10.15.6 and watchOS 6.2.8 are more modest still. The Mac software update expands local news offerings and customization options in Apple News, &#34;adds a new option to optimize video streaming on HDR-compatible Mac notebooks for improved battery life,&#34; and includes big fixes  and security updates. Here are the update notes:\n macOS Catalina‌ 10.15.6 introduces local news in your Today feed in ‌Apple News‌ and improves the security and reliability of your Mac.\n  Local news in your Today feed provides extensive coverage of San Francisco, the Bay Area, Los Angeles, Houston, and New York City\n More stories available from local news providers with a subscription to ‌Apple News‌+\n Your daily newsletter from ‌Apple News‌ can now be personalized with stories that reflect your interests\n  Adds a new option to optimize video streaming on HDR-compatible Mac notebooks for improved battery life\n watchOS 6.2.8 adds digital car-key support on the Apple Watch series 5, and expands ECG capability and irregular hearth rhythm notifications to Bahrain, Brazil, and South Africa. Here are the notes:\n ECG app on ‌Apple Watch‌ Series 4 or later now available in Bahrain, Brazil, and South Africa\n Apple also released tvOS 13.4.8 and HomePod update 13.4.8. Both offer stability improvements and bug fixes but no new features, according to Apple.\n Earlier this month, Apple announced its plants for its larger annual updates, including iOS 14, iPadOS 14, tvOS 14, watchOS 7, and macOS 11 Big Sur. We are likely to continue to see only small updates like today&#39;s until those new versions roll out in September or October.", "posttime": "2020-07-16 06:06:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,ios,apple,苹果,releases", "title": "苹果发布iOS和iPadOS 13.6、MacOS 10.15.6和watchOS 6.2.8", "title_en": "Apple releases iOS and iPadOS 13.6, macOS 10.15.6, and watchOS 6.2.8", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/07/apple-updates-ios-to-13-6-with-digital-car-keys-local-news-and-more/", "via": "", "real_tags": ["发布", "ios", "apple", "苹果", "releases"]}, {"category": "", "categoryclass": "", "imagename": "76a7a85cb1067fba96a4ef02b85691d0.jpg", "infoid": 1012167, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他说：“与全球其他许多业务一样，优选地受到了新冠肺炎的影响。今天，我们不得不做出一个令人心碎的裁员决定，“首席人事办公室艾琳·弗林(Erin Flynn)在给TechCrunch的一份声明中写道，并补充说，”今天的艰难决定为我们的业务继续取得成功奠定了基础。“。\n这家初创公司是由丹·西罗克(Dan Siroker)和皮特·库门(Pete Koomen)于2009年创立的，其想法是帮助客户体验网站的不同版本，也就是众所周知的A/B测试，看看哪种迭代最可靠。成立一年后，这家初创公司在2010年通过了Y Combinator，并于2013年签署了在旧金山租用5.6万平方英尺办公室的租约。\nOptimizely上一次从高盛(Goldman Sachs)筹集了5000万美元的D系列融资，使其迄今获得的风险资本总额达到2亿美元。其他投资者包括指数风险投资公司(Index Ventures)、安德森·霍洛维茨(Anddreessen Horowitz)和GV。\n今年6月，Optimizely表示，它每天处理的活动超过60亿次。客户包括Visa、BBC、IBM、“华尔街日报”、Gap、StubHub和Metromile。\nOptimizely没有被列为申请PPP贷款，这是政府创建的一个帮助企业避免裁员的计划。这些贷款在硅谷引发了争议，因为一些人认为风险投资支持的企业应该求助于投资者，而不是政府，以获得额外的资本。\n考虑到最近的收益报告显示，企业级SaaS公司普遍受益于冠状病毒大流行，Optimizely的裁员有些出人意料。在在线工作环境中，基础设施和软件服务变得日益重要。例如，Box帮助人们管理云中的内容，调整后的利润和收入超出了预期。那么，为什么Optimizely在苦苦挣扎呢？\n除了市场对一家企业的看法外，裁员的原因还有很多。Optimzely的客户既有企业界的重量级人物，也包括在这场流行病中举步维艰的企业，包括StubHub和Metromile-这两家公司都进行了裁员。\n虽然裁员的速度正在放缓，但裁员本身并没有消失。正如股票告诉我们的那样，这是一个动荡的时期，企业正在寻找保持财务安全的方法。", "note_en": "“As with so many other businesses globally,  Optimizely   has been impacted by COVID-19. Today, we have had to make a heartbreaking decision to reduce the size of our workforce,” Erin Flynn, chief people office, wrote in a statement to TechCrunch, adding that “today’s difficult decision sets up our business for continued success.”\n The startup was founded in 2009 by Dan Siroker and Pete Koomen, on the idea that it helps to have customers experience different versions of the website, also known as A/B testing, to see what iteration sticks best. A year after founding, the startup went through Y Combinator in 2010 and in 2013 it signed a lease for a 56,000-square-foot office in San Francisco.\n  Optimizely last raised $50 million in  Series D financing from Goldman Sachs, bringing its total venture capital secured to date at $200 million. Other investors include Index Ventures, Anddreessen Horowitz and GV.\n In June, Optimizely said it handles more than 6 billion events a day. Customers include Visa, BBC, IBM, Wall Street Journal, Gap, StubHub, and Metromile.\n Optimizely was not listed as applying for a PPP loan, a program created by the government to help businesses avoid laying off staff. The loans were met with controversy in Silicon Valley, as some thought venture-backed businesses should turn to investors, instead of the government, for extra capital.\n Optimizely’s layoffs are somewhat surprising given  recent earnings reports that show that enterprise SaaS companies have broadly benefited from the coronavirus pandemic. In an online work world, infrastructure and software services become more vital by the day. Box, for example, helps people manage content in the cloud and it beat expectations on adjusted profit and revenue. So why is Optimizely struggling?\n There are a ton of reasons for layoffs beyond what the market thinks about a business. Optimzely’s customers are a mix of heavy-hitters in enterprise, but also include businesses that have struggled during this pandemic, including StubHub and Metromile —  both of which had layoffs.\n While  the pace of layoffs is slowing down, cuts themselves aren’t disappearing. As the stocks show us, it’s a volatile time and businesses are looking for ways to stay financially safe.", "posttime": "2020-07-16 06:05:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "支持,backed,裁员", "title": "\n基准支持的Optimized确认已裁员15%", "title_en": "\n\t\t\t\tBenchmark-backed Optimizely confirms it has laid off 15% of staff\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/benchmark-backed-optimizely-confirms-it-has-laid-off-15-percent-of-staff/", "via": "", "real_tags": ["支持", "backed", "裁员"]}, {"category": "", "categoryclass": "", "imagename": "afb0e6fa361b035e06496a9d127a399d.png", "infoid": 1012166, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "超级语言：天生失明的人说话时会打手势。当我教手势课时，我总是喜欢指出这一事实，因为它给了我们一个有趣的视角来了解我们是如何学习和使用手势的。到目前为止，我主要引用了贾娜·艾弗森(Jana Iverson)和苏珊·戈尔丁-梅多(Susan Goldin-Meadow)1998年的一篇论文，分析了年轻盲人的手势和言语。盲人不仅会做手势，而且他们使用的手势的频率和类型似乎与视力正常的人的手势没有太大不同。如果人们在没有看到手势的情况下学习手势(最有可能的是，从来没有人展示过)，那么学习一门语言肯定有一些东西，这意味着你会得到手势作为额外的奖励。盲人甚至会在与其他盲人交谈时打手势，有视力的人在打电话时也会打手势--所以我们知道，当人们与能看到自己手势的人说话时，并不只是打手势。今年早些时候，一份新的论文发表，增加了这个故事。Şeyda ÖzçalışKan，ChéLucero和Susan Goldin-Meadow观察了说土耳其语和英语的盲人的手势，看看他们的手势是否与说这些语言的有视力的人不同。一些有视力的演讲者被蒙住眼睛，另一些人则可以看到他们的对话伙伴。之所以选择土耳其语和英语，是因为已经确定，说这两种语言的人在谈论物品移动的视频时，手势总是不同的。说英语的人更有可能在一个手势中一起显示姿势(例如，“滚”或“跳”)和轨迹(例如，“从左到右”，“向下”)，而土耳其语说的人会将这些特征显示为两个独立的手势。这反映了这样一个事实，英语中的“roll down”是一个动词从句，而在土耳其语中，相应的从句应该是yuvarlanarak iniyor，翻译过来就是两个动词“roll down”。因为我们知道盲人确实会做手势，ÖzçalışKan的团队想要弄清楚他们的手势是否像其他说他们语言的人一样。说土耳其语的盲人有没有像他们的动词一样把手势的举止和轨迹分开？说英语的人把它们结合起来了吗？当然，播放视频的标准方法对盲人参与者不起作用，所以研究人员建立了事件的三维模型，让人们在讨论之前感受到这些事件。结果表明，说土耳其语的盲人的手势与视力正常的人一样，说英语的人也是如此。所有说土耳其语的人的手势与所有说英语的人明显不同，无论他们的视力如何。这意味着这些特殊的手势模式与一种语言的语法属性有很深的联系，而不是我们通过观察其他说话者来学习的。参考文献：Jana M.Iverson和Susan Goldin-Meadow。1998年。为什么人们说话时会打手势。“自然”，396(6708)，228-228。Şeyda ÖzçalışKan，ChéLucero和Susan Goldin-Meadow。2016年。像本土说话者一样，看手势是必要的吗？“心理科学”27(5)737-747。Asli Ozyurek&Sotaro Kita。1999年。英语和土耳其语的表达方式和路径：言语、手势和概念化的差异。在认知科学学会第二十一届年会上发表(第507-512页)。埃尔鲍姆。这么多有趣的潜在后续研究！例如，土耳其-英语双语者是否在每种语言中都使用适当的手势，或者他们是否表现出第一语言的迁移效应？在我看来，可能有一些手势是伴随语言而来的，而另一些手势可能是通过模仿来学习的(可能是像滚动和向下这样的标志性手势，而不是像竖起大拇指这样的任意手势)。", "note_en": "superlinguo: People who are blind from birth will gesture when they speak. I always like pointing out this fact when I teach classes on gesture, because it gives us an an interesting perspective on how we learn and use gestures. Until now I’ve mostly cited a 1998 paper from Jana Iverson and Susan Goldin-Meadow that analysed the gestures and speech of young blind people. Not only do blind people gesture, but the frequency and types of gestures they use does not appear to differ greatly from how sighted people gesture. If people learn gesture without ever seeing a gesture (and, most likely, never being shown), then there must be something about learning a language that means you get gestures as a bonus. Blind people will even gesture when talking to other blind people, and sighted people will gesture when speaking on the phone - so we know that people don’t only gesture when they speak to someone who can see their gestures.  Earlier this year a new paper came out that adds to this story. Şeyda Özçalışkan, Ché Lucero and Susan Goldin-Meadow looked at the gestures of blind speakers of Turkish and English, to see if the *way* they gestured was different to sighted speakers of those languages. Some of the sighted speakers were blindfolded and others left able to see their conversation partner.  Turkish and English were chosen, because it has already been established that speakers of those languages consistently gesture differently when talking about videos of items moving. English speakers will be more likely to show the manner (e.g. ‘rolling’ or bouncing’) and trajectory (e.g. ‘left to right’, ‘downwards’) together in one gesture, and Turkish speakers will show these features as two separate gestures. This reflects the fact that English ‘roll down’ is one verbal clause, while in Turkish the equivalent would be yuvarlanarak iniyor, which translates as two verbs ‘rolling descending’.  Since we know that blind people do gesture, Özçalışkan’s team wanted to figure out if they gestured like other speakers of their language. Did the blind Turkish speakers separate the manner and trajectory of their gestures like their verbs? Did English speakers combine them? Of course, the standard methodology of showing videos wouldn’t work with blind participants, so the researchers built three dimensional models of events for people to feel before they discussed them.  The results showed that blind Turkish speakers gesture like their sighted counterparts, and the same for English speakers. All Turkish speakers gestured significantly differently from all English speakers, regardless of sightedness. This means that these particular gestural patterns are something that’s deeply linked to the grammatical properties of a language, and not something that we learn from looking at other speakers.  References  Jana M. Iverson & Susan Goldin-Meadow. 1998. Why people gesture when they speak. Nature, 396(6708), 228-228. Şeyda Özçalışkan, Ché Lucero and Susan Goldin-Meadow. 2016. Is Seeing Gesture Necessary to GestureLike a Native Speaker?Psychological Science\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t27(5) 737–747. Asli Ozyurek & Sotaro Kita. 1999. Expressing manner and path in English and Turkish: Differences in speech, gesture, and conceptualization. In Twenty-first Annual Conference of the Cognitive Science Society (pp. 507-512). Erlbaum.  So many interesting potential follow-up studies! For example, do Turkish-English bilinguals use the appropriate gestures in each language, or do they show transfer effects from their first language? It also seems plausible to me that there might be some gestures that come with language while others might be learned by imitation (perhaps iconic gestures like rolling and down versus arbitrary gestures like thumbs up). ", "posttime": "2020-07-16 06:04:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打手势,people,手势", "title": "盲人打手势(这有什么大不了的)", "title_en": "Blind people gesture (and why that’s kind of a big deal)", "transed": 1, "url": "https://allthingslinguistic.com/post/150001033323/blind-people-gesture-and-why-thats-kind-of-a-big", "via": "", "real_tags": ["打手势", "people", "手势"]}, {"category": "", "categoryclass": "", "imagename": "5a30f586ad4f4af399015d89a9bee293.png", "infoid": 1012165, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，我开发了一款听写应用程序，旨在解决我对其他听写应用程序最大的不满之一：它们不能处理标点符号。作为一名作家，我梦想着大声说出我的故事，但冷酷的现实是，直到最近，每一个听写应用程序都要求你在所有句子的末尾说“句号”、“问号”或“结束引用”。这就像每次你想要添加标点符号时，从键盘上站起来做一个跳跃千斤顶一样自然。\n这导致我创建了一款应用程序，通过使用你在每句话末尾释放的一键输入和一些自然语言处理来简化添加标点符号的过程，以确定它是问题、声明还是对话。这只是一种权宜之计，直到语音听写变得足够智能，可以添加标点符号--谷歌的Live Transcribe和Otter.ai等应用程序最终实现了这一点。然而，他们两人都不知道什么时候用引号加东西。当我决定尝试用听写在24小时内完成NaNoWriMo挑战(在一个月内写出一本5万字的小说)时，我不得不拼凑出自己的小脚本来添加引号和格式化对话框。它很乏味，而且工作得很好，但一点也不优雅。当时我希望有一种更好的方式通过人工智能来做到这一点(我甚至试图制作一个小的ML模型来做到这一点)。进入OpenAI的API。\n我尝试使用OpenAI的API做的第一件事是编写一个脚本来简化我用来检测对话框和添加适当标点符号的数百行代码和导入的NLP库。第一个结果让我大吃一惊。\n我向API提供了一些如何格式化文本的示例，其中一些文本应该编写为对话框：\n输入：正在发生的事情。输出：正在发生什么？输入：钥匙在桌子上，她说。输出：钥匙在桌子上，她说。&#34；&#34；&#34；输入：这很有趣。输出：这很有趣。&#34；&#34；&#34；输入：你要去哪里问阿曼达。输出：这很有趣。&#34；&#34；&#34；&#34；输入：你要去哪里问阿曼达。输出：这很有趣。&#34；&#34；&#34；输入：你要去哪里问阿曼达。输出：这很有趣。&#34；&#34；&#34；&#34；输入：你要去哪里问阿曼达。输出阿曼达问道。&#34；&#34；\n输入：孩子们去万圣节派对了，玛妮回答。输出：孩子们去了万圣节派对，玛尼回答。\n它了解每个演讲者是谁，在哪里放引号，甚至在什么时候是一个声明或问题。这是我还没有看到任何语音到文本应用程序所做的事情。\n从文本中解析对话和问题是您可以使用大量代码和语法规则来完成的事情。但是一些更主观的东西呢？\n段落极具挑战性，仅凭语法规则不能告诉你如何将文本拆分成不同的表达方式。但是，如果我给API几个我自己的文本不带和带分段符的例子，它就能很好地计算出何时将文本拆分成单独的想法。\n我们从几个例子开始，说明我是如何将文本分成几个段落的：\n输入：这不是一条严格的规则，但它有一些有用的解释力。这是否只是一个符合现有数据的理论还有待观察。朱利安在读完这篇文章后打电话给我，鼓励我沿着这些思路做更多的研究。我不愿称我们为朋友。他的生活只有5分钟，你会强烈地意识到，一旦谈话结束，他就会转到一长串谈话对象名单上的下一个名字。我接电话时声音有点沙哑。“嘿，朱利安。”输出：这不是一条苛刻的规则，但它有一些有用的解释力。朱利安在读完这篇文章后打电话给我，鼓励我沿着这条线做更多的研究。我不愿称我们为朋友，这还有待观察。他的生活只有5分钟，你会强烈地意识到，一旦谈话结束，他就会转到一长串谈话对象名单上的下一个名字。我接电话时声音有点沙哑。“嗨，朱利安。”&#34；&#34；&#34；&#34；(我再提供三个与前面的例子类似的例子。)。\n这只是API试图弄清楚如何将文本拆分成段落的“第一枪”示例。有了更多的示例，它甚至会变得更好，但实际上，这是一个非常令人印象深刻的示例，说明了API如何甚至可以获得某种程度上的任意规则：\n输入：我在树林中赛跑，绕过生锈的垃圾堆，试图找到离开这里的缝隙的路。我的脚碰到了一块半埋着的金属片，我被绊倒了。当我的肘部撞到一辆丰田西里卡的侧视镜上时，有一种冰冷的疼痛。当我把胳膊拉出来的时候，我的皮肤上有玻璃碎片，门上有血迹。该死的。我试着用袖子擦去血迹，但我所做的就是把它涂抹在面板上。我看到楼上的一盏灯穿过树丛亮着。不太好。她一定听到了。输出：我在树林里赛跑，绕过生锈的垃圾堆，试图找到离开这里的缝隙的路。我的脚碰到了一块半埋着的金属片，我被绊倒了。当我的肘部撞到一辆丰田塞利卡的侧视镜上时，有一种冰冷的疼痛，当我把胳膊拉出来的时候，我的皮肤上有玻璃碎片，车门上有血迹。该死的，我试着用袖子擦去血迹，但我所做的就是把它涂在嵌板上。我看到楼上的灯从树丛里亮了起来。不太好。她肯定听到我说的话了。\n从听起来多余的角度来看，这是巨大的。段落结构是因作者而异的东西，以及人们如何定义段落-完整的思想、单个动作、瞬间等等。API的美妙之处在于，我只需向它提供几个如何定义段落的示例，它就可以快速地从这些示例中学习。\n使用OpenAI的API让我想起了拥有智能手机的头几年。我花了很长时间才意识到，我口袋里有一台相机、一台录音机、一个电视演播室和世界上所有的电子信息。我会看到一些东西，然后忘记我有相机，或者有一个问题，然后忘记答案是一秒钟的方式。人们花了很长时间才真正理解了那个神奇设备的用途。\n当我使用OpenAI的API时，这个想法经常出现在我脑海中。例如，如果我需要知道段落中的主要字符，我只需编写几行代码就可以向API显示我想要的内容。\n输入：我妹妹采访了我们镇长。主要人物：姐妹行动：采访市长。输入：道格开始将板条箱装到汤姆的卡车后座上。主要人物：道格行动：装载板条箱。输入：黑兹尔，约翰和艾米用生日派对给贝丝带来了惊喜。\n输入：Kelly通过对讲机打电话给Bill，告诉他她正在点燃火箭。主要角色：KellyAction：点燃火箭。\n如果我想让API在文本段落中给我一个演员和导演的列表，它可以使用这样的脚本来做到这一点。\n输入：有一部由道格·利曼(Doug Liman)执导、汤姆·克鲁斯(Tom Cruise)主演的新电影以太空为背景。演员：汤姆·克鲁斯导演：道格·利曼(Doug Liman)；输入：昆汀·塔伦蒂诺(Quentin Tarantino)、布拉德·皮特(Brad Pitt)和莱昂纳多·迪卡普里奥(Leonardo DiCaprio)已经拍摄了几部电影。演员：布拉德·皮特(Brad Pitt)、莱昂纳多·迪卡普里奥(Leonardo DiCaprio)导演：昆汀·塔伦蒂诺(Quentin Tarantino)。\n如果我想让API格式化地址，这相当简单，它只需要一个示例：\n输入：比尔·凯恩，德克萨斯州奥斯汀韦奇街23334号输出：比尔·凯恩，德克萨斯州奥斯汀，韦奇街23334，邮编：78652；#34；&#34；输入：吉尔·汤普森2121好莱坞道伯班克加州91505输出：吉尔·汤普森2121好莱坞道伯班克，CA 91505。\n如果API能够提取内容并从几个示例中学习，这意味着它可以接受所有类型的文本，并将其重新格式化为其他内容。如果我想编写一个网站的代码，我可以制作自己的速记，然后将我想要格式化为HTML的文本提供给API。\n输入：文本输入表单2占位符电子邮件输出：&lt；Input id=&#34；Form2&#34；Type=&#34；Text&#34；placeholder=&#34；Email&#34；&gt；&#34；&#34；&#34；Input：Title Interest Things输出：&lt；Title&gt；Interest Things&lt；/Title&gt；&#34；&#34；&#34；&#34；输入：段落这些是您可以做的一些有趣的事情。段落，比如通过说话来创建代码。输出：&lt；p&gt；这些是您可以做的一些有趣的事情。&lt；/p&gt；&lt；p&gt；喜欢通过说话来创建代码。&lt；/p&gt；&#34；&#34；&#34；\n只需上面的几个示例，就能理解我想要在这样的请求中得到什么：\n我只用了两分钟就用API创建了一个简单的HTML解释器的自然语言。\n让我们让API做一些我们没有训练它去做的事情：\n只需几个示例，API就会意识到我们是在使用HTML制作东西。它掌握上下文的能力使API能够在我说“div”和“content”时理解我想要的div元素，并且应该在里面放一个段落和我给它的文本。这太疯狂了。\n每当我想要将文本从一种形式更改为另一种形式时，我都会尝试考虑OpenAI API。这甚至可能是将一个想法的文本变成一个更详细的段落，或者把一个无结构的序列变成有意义的东西。它识别模式和理解上下文的能力继续让我感到惊讶。", "note_en": "A few years ago I built an app for dictation that was intended to solve one of the biggest frustrations I had with other dictation applications: They didn’t handle punctuation. As a writer I dreamed about just speaking my stories aloud, but the cold hard reality was that until recently, every dictation application required you to end all of your sentences by saying “Period”, “Question mark” or “End quote.” This is about as natural as getting up from your keyboard and doing a jumping jack everytime you want to add punctuation.\n This led to me creating an app that simplified adding punctuation by using a one-button input you released at the end of each sentence and some natural language processing to figure out if it was a question, a statement or dialog. It was only a stopgap until voice dictation got smart enough to add punctuation – which finally happened with applications like Google’s Live Transcribe and Otter.ai. However neither of them understand when to put something in quote marks. When I decided to try to do the NaNoWriMo challenge (writing a 50,000 word novel in a month) in just 24-hours using dictation, I had to hack together my own little script to add quote marks and format dialog. It was tedious and worked well-enough, but there was nothing elegant about it. I wished at the time there was a better way to do this through AI (I even tried to make a small ML model to do this.) Enter  OpenAI’s API.\n One of the first things I tried to do with OpenAI’s API was write a script to simplify the hundreds of lines of code and the imported NLP library I was using to detect dialog and add appropriate punctuation. I was stunned by the first result.\n I supplied the API with some examples of how to format text where some of it should be written as dialog:\n Input: What&#39;s happening.Output: What&#39;s happening?&#34;&#34;&#34;Input: The keys are on the table she said.Output: &#34;The keys are on the table,&#34; she said.&#34;&#34;&#34;Input: This is interesting.Output: This is interesting.&#34;&#34;&#34;Input: Where are you going asked Amanda.Output: &#34;Where are you going?&#34; asked Amanda.&#34;&#34;&#34;\n  Input: The kids went to the Halloween party Marnie replied.Output: &#34;The kids went to the Halloween party,&#34; Marnie replied.\n It understood who each speaker was, where to put the quote marks and even when it was a statement or question. This is something I’ve yet to see any speech to text application do.\n  Parsing dialog and questions from text is something you can do with a lot of code and rules for grammar. But what about something that’s a bit more subjective?\n Paragraphs are extremely challenging  and grammar rules alone can’t tell you how to break text into distinct expressions. However, if I give the API a few examples of my own text without and with paragraph breaks, it’s pretty good at figuring out when to break up the text into separate thoughts.\n We start with a context of a few examples of how I break my text into paragraphs:\n Input: It wasn’t a hard rule, but it had some useful explanatory power. It remains to be seen if it’s just a theory that fits the available data. Julian called me after reading the article and encouraged me to do more research along those lines. I’d hesitate to call us friends. He lives his life in five-minute chunks, and you’re keenly aware that as soon as this conversation ends, he’s going to go to the next name on a very long list of people he talks to. I answer the phone with a slightly froggy voice. “Hey, Julian.”Output: It wasn’t a hard rule, but it had some useful explanatory power. It remains to be seen if it’s just a theory that fits the available data.Julian called me after reading the article and encouraged me to do more research along those lines.I’d hesitate to call us friends. He lives his life in five-minute chunks, and you’re keenly aware that as soon as this conversation ends, he’s going to go to the next name on a very long list of people he talks to. I answer the phone with a slightly froggy voice. “Hey, Julian.”&#34;&#34;&#34;(I provide three more examples similar to the previous ones.)\n This is just a “first shot” example of the API trying to figure out how to break my text into paragraphs. With more examples it gets even better, but as is, it’s a pretty impressive example of how the API can even pick up somewhat arbitrary rules:\n Input: I race through the woods, weaving around the rusted junk heaps, and try to find my way toward the gap out of here. My foot hits a half-buried piece of metal, and I trip. There’s an icy pain as my elbow smashes into the side-view mirror of a Toyota Celica. When I pull my arm free, there are bits of glass in my skin and blood on the door. Damn it. I try to wipe the blood away with my sleeve, but all I do is smear it over the panel. I see an upstairs light turn on through the trees. Not good. She has to have heard me.Output: I race through the woods, weaving around the rusted junk heaps, and try to find my way toward the gap out of here. My foot hits a half-buried piece of metal, and I trip. There’s an icy pain as my elbow smashes into the side-view mirror of a Toyota Celica.When I pull my arm free, there are bits of glass in my skin and blood on the door. Damn it.I try to wipe the blood away with my sleeve, but all I do is smear it over the panel.I see an upstairs light turn on through the trees. Not good. She has to have heard me.\n At the point of sounding redundant, this is huge. Paragraph structure is something that varies from author to author and how someone defines a paragraph – a complete thought, a single action, a moment in time, etc. The wonderful thing about the API is that I only have to provide it with a few examples of how I define a paragraph and it can quickly learn from them.\n  Using OpenAI’s API reminds me of the first few years of having a smartphone. It took me a long time to realize that I had a camera, a voice recorder, a TV studio and all the electronic information in the world in my pocket. I’d see something and forget that I had a camera or have a question and forget an answer was a second a way. It took a long time to really understand the utility of that magical device.\n As I play with OpenAI’s API this thought occurs to me a lot. For example, if I need to know the main character in a paragraph, I only have to write a few lines to show the API what I want.\n Input: My sister interviewed the mayor of our town.Main character: SisterAction: Interviewing the mayor&#34;&#34;&#34;Input: Doug started loading crates onto the back of Tom&#39;s truck.Main character: DougAction: Loading crates&#34;&#34;&#34;Input: Hazel, John and Amy surprised Beth with a birthday party.Main character: BethAction: Surprise\n  Input: Kelly called Bill over the intercom and told him she was igniting the rocket.Main character: KellyAction: Igniting the rocket\n If I want the API to give me a list of the actors and directors in text passage it can do that using a script like this.\n Input: There&#39;s a new movie by Doug Liman starring Tom Cruise set in space.Actors: Tom Cruise Directors: Doug Liman&#34;&#34;&#34;Input: Quentin Tarantino, Brad Pitt and Leonardo DiCaprio have made several movies.Actors: Brad Pitt, Leonardo DiCaprio Directors: Quentin Tarantino&#34;&#34;&#34;Input: Tom Hanks likes to work a lot with Stephen Spielberg.Actors: Tom Hanks Director: Steven Spielberg &#34;&#34;&#34; Input: Christopher Nolan works with Michael Caine in several of his films.\n   If I want the API to format an address, that’s fairly easy and it only takes one example:\n Input: Bill Kane 23334 Wedge Street austin texas 78652Output: Bill Kane 23334 Wedge Street Austin, TX 78652&#34;&#34;&#34;Input: jill thompson 2121 hollywood way burbank ca 91505Output: Jill Thompson 2121 Hollywood Way Burbank, CA 91505\n  if the API is capable of picking up content and learning from a few examples, that means it can take all kinds of text and reformat it into something else. If I want to code a website, I can make my own shorthand and then give the API the text I want formatted into HTML.\n Input: Text input form 2 placeholder emailOutput: &lt;input id=&#34;form2&#34; type=&#34;text&#34; placeholder=&#34;Email&#34;&gt;&#34;&#34;&#34;Input: Title Interesting things Output: &lt;title&gt; Interesting things &lt;/title&gt;&#34;&#34;&#34;Input: Paragraph These are some of the interesting things you can do. Paragraph Like create code by speaking.Output: &lt;p&gt; These are some of the interesting things you can do.&lt;/p&gt;&lt;p&gt; Like create code by speaking. &lt;/p&gt;&#34;&#34;&#34;\n All it takes is a few examples from above to understand what I want in a request like this:\n  It only took me two-minutes to create a simple natural language to HTML interpreter using the API.\n  Let’s ask the API do something we didn’t train it to do:\n    All it took was a handful of examples for the API to recognize we were making things with HTML. Its ability to grasp context allowed the API to understand when I said “Div” and “contents” that I wanted a div element and that it should put a paragraph inside of there with the text I gave it. This is insane.\n  I try to think about the OpenAI API anytime I want to change text from one form to another. This could even be changing the text of an idea into a more detailed paragraph or an unstructured sequence into something that makes sense. It’s ability to pick up patterns and understand context continues to amaze me.", "posttime": "2020-07-16 06:03:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,格式化,api,文本", "title": "关于智能格式化和代码生成的OpenAI API入门读物", "title_en": "OpenAI API Primer on Smart Formatting and Code Generation", "transed": 1, "url": "https://andrewmayneblog.wordpress.com/2020/06/13/openai-api-alchemy-smart-formatting-and-code-creation/", "via": "", "real_tags": ["代码", "格式化", "api", "文本"]}, {"category": "", "categoryclass": "", "imagename": "5571265500be37c521bdba4d73d8298b.png", "infoid": 1012164, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三下午，巴拉克·奥巴马(Barack Obama)、埃隆·马斯克(Elon Musk)、杰夫·贝佐斯(Jeff Bezos)、坎耶·韦斯特(Kanye West)、乔·拜登(Joe Biden)、沃伦·巴菲特(Warren Buffet)、苹果(Apple)和其他许多人的账户都被攻破，他们都发布了推文，将用户。该骗局引导该账户的追随者将一定数量的比特币发送到区块链地址。\nTwitter的一位发言人告诉TechCrunch，公司正在“调查”此事，但没有立即置评。\n截至发稿时，与被黑客攻击的推文相关的区块链地址已经积累了价值超过10万美元的比特币。", "note_en": "Accounts belonging to Barack Obama, Elon Musk, Jeff Bezos, Kanye West, Joe Biden, Warren Buffet, Apple and many others had their accounts compromised Wednesday afternoon, all posting tweets directing users to a Bitcoin scam. The scam directs the account’s followers to send a certain number of Bitcoin to a blockchain address.\n A Twitter spokesperson told TechCrunch the company was “looking into” the matter but didn’t immediately comment.\n  By the time of publication, the blockchain address associated with the hacked tweets had amassed more than $100,000 worth of Bitcoin.", "posttime": "2020-07-16 05:43:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,账户,stock,推文", "title": "\nTwitter股价在几个小时后下跌，争先恐后地遏制备受瞩目的账户黑客攻击", "title_en": "\n\t\t\t\tTwitter stock slides after-hours amid scramble to contain high-profile account hacks\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/twitter-stock-slides-after-hours-amid-scramble-to-contain-high-profile-account-hacks/", "via": "", "real_tags": ["黑客", "账户", "stock", "推文"]}, {"category": "", "categoryclass": "", "imagename": "2be1d0df049eb6ba0c0df69718e8da8f.jpg", "infoid": 1012163, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "慈善机构吸烟与健康行动(ASH)的一项调查显示，自新冠肺炎大流行以来，已有100多万人戒烟。\n在前四个月戒烟的人中，41%的人说这是对冠状病毒的直接反应。\n另外，伦敦大学学院(UCL)发现，截至2020年6月的一年里，戒烟人数比2007年开始调查以来的任何一年都要多。\n在4月15日至6月20日期间，由民意测验机构YouGov代表Ash登记的具有代表性的10000人样本被问及他们的吸烟习惯。\n这一结果被用来估计英国戒烟总人数。\n在过去四个月戒烟的人中，略低于一半的人表示，大流行对他们的决定起到了作用。这可能归因于一系列因素，包括健康问题，在社交场合与世隔绝或不再吸烟时获得烟草的机会。\n作为吸烟工具包研究的一部分，伦敦大学学院的一个团队自2007年以来每月向英国1000人询问他们的吸烟习惯。\n在截至2020年6月的一年里，参与调查的吸烟者中有7.6%戒烟-几乎比平均水平高出三分之一，是自十多年前开始调查以来的最高比例。\nASH主任德博拉·阿诺特说：自从新冠肺炎袭击英国以来，可能已经有100多万吸烟者成功戒烟，但还有数百万人继续吸烟。\nAsh正在发起一项由卫生和社会保健部资助的戒烟运动，目标是该国吸烟率最高的地区的人。\n住在纽卡斯尔的特伦斯·克拉格斯在医院吸氧一段时间后戒烟-尽管他的冠状病毒检测呈阴性。\n我几乎喘不过气来，他说。我一直在寻找新鲜空气。他告诉BBC，(大流行)更多的是激励人们远离它们，尽管目前由于压力太大，事情变得更加困难。\n自2005年以来，东北部吸烟者数量的降幅比英格兰任何地方都大。\nZoe Covid症状跟踪器应用程序的数据显示，吸烟者比不吸烟者患上冠状病毒感染的三大典型症状-发烧、持续咳嗽和呼吸急促的可能性高14%。\n这款应用程序由盖伊医院和圣托马斯医院以及伦敦国王学院的研究人员开发，分析了超过240万名英国参与者的数据。\n他们的分析发现，新冠肺炎检测呈阳性的吸烟者住院的可能性是携带冠状病毒的非吸烟者的两倍多。\n这与美国的一项研究相一致，该研究发现，携带冠状病毒住院的吸烟者死亡的可能性是后者的1.8倍。\n尽管ZOE研究中少数接受冠状病毒检测的吸烟者似乎比不吸烟者检测呈阳性的可能性较小，但那些接受冠状病毒检测的吸烟者更有可能报告严重症状。\n来自世界各地的一些研究表明，吸烟实际上可能对冠状病毒有保护作用。这是基于医院患者群体，与他们在更广泛的人口中的人数相比，吸烟者似乎代表不足。\n牛津大学循证医学中心的杰米·哈特曼·博伊斯(Jamie Hartmann-Boyce)博士表示，有一个生物学上看似合理的解释--尼古丁可能会阻止病毒用来进入细胞的受体。\n她说，这在所有研究中并不一致，目前还不清楚这些研究的数据是否可靠。\n她指出，吸烟本身，而不是仅仅通过贴片或口香糖摄入尼古丁，是唯一致命的，这意味着对健康的危害远远超过任何潜在的好处。\n英国公共卫生的指导意见指出：有强有力的证据表明，吸烟通常与发展为呼吸道病毒感染的风险增加有关。\n吸烟会损害肺部和呼吸道，损害免疫系统，降低你抵抗感染的能力。", "note_en": "More than one million people have given up smoking since the Covid-19 pandemic hit, a survey for charity Action on Smoking and Health (Ash) suggests.\n Of those who had quit in the previous four months, 41% said it was in direct response to coronavirus.\n Separately, University College London (UCL) found more people quit smoking in the year to June 2020 than in any year since its survey began in 2007.\n  Between 15 April and 20 June, a representative sample of 10,000 people, enrolled by pollster YouGov on behalf of Ash, were asked about their smoking habits.\n  The results were used to estimate the total number of people giving up smoking in the UK.\n Just under half of people who had quit in the past four months said the pandemic had played a role in their decision. That may have been down to a range of factors including health concerns, access to tobacco while isolating or no longer smoking socially.\n A team at University College London has been asking 1,000 people a month in England about their smoking habits since 2007 as part of the Smoking Toolkit Study.\n In the year to June 2020, 7.6% of smokers taking part in the survey quit - almost a third higher than the average and the highest proportion since the survey began more than a decade ago.\n  Ash director Deborah Arnott said: &#34;Over a million smokers may have succeeded in stopping smoking since Covid-19 hit Britain, but millions more have carried on smoking&#34;.\n  Ash is launching a stop-smoking campaign funded by the Department of Health and Social Care, targeting people in areas of the country with the highest rates of smoking.\n  Terrence Craggs, who lives in Newcastle, quit smoking after spending time in hospital on oxygen - although his coronavirus test was negative.\n &#34;I could hardly breathe,&#34; he said. &#34;I was hunting for air all the time. [The pandemic] is more of an incentive to stay off them, even though it&#39;s more difficult at the moment because of the stress,&#34; he told the BBC.\n The North East has seen a bigger fall in smoker numbers than anywhere in England since 2005.\n  Data from the Zoe Covid Symptom Tracker app suggested smokers were 14% more likely than non-smokers to develop the three &#34;classic&#34; symptoms of coronavirus infection - fever, persistent cough and shortness of breath.\n The app, created by researchers at Guy&#39;s and St Thomas&#39; hospitals and King&#39;s College London, analysed data from more than 2.4 million UK participants.\n Their analysis found  smokers with a positive Covid-19 test were more than twice as likely as non-smokers with coronavirus to be hospitalised.\n This aligns with   research from the US which found hospitalised smokers with coronavirus were 1.8 times more likely to die.\n Although the small number of smokers in the Zoe study who took a coronavirus test appeared to be less likely than non-smokers to test positive, those that did were more likely to report serious symptoms.\n Some studies from around the world have suggested smoking may actually have a protective effect against coronavirus. This is based on groups of hospital patients where smokers seemed to be underrepresented, compared with their numbers in the wider population.\n Dr Jamie Hartmann-Boyce, from the University of Oxford&#39;s Centre for Evidence-Based Medicine, said there was a &#34;biologically plausible&#34; explanation - that nicotine could be blocking the same receptors use by the virus to get into your cells.\n  &#34;This isn&#39;t consistent across studies and it&#39;s unclear if the data from these studies are reliable,&#34; she said.\n Smoking itself, rather than just taking in nicotine through a patch or gum, is &#34;uniquely deadly&#34; she pointed out, meaning the the health harms far outweigh any potential benefit.\n Public Health England&#39;s guidance states: &#34;There is strong evidence that smoking tobacco is generally associated with an increased risk of developing respiratory viral infections.\n &#34;Smoking causes damage to the lungs and airways and harms the immune system, reducing your ability to fight infection.&#34;", "posttime": "2020-07-16 05:42:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "戒烟,quit,吸烟", "title": "吸烟者戒烟人数创十年来新高", "title_en": "Smokers Quit in Highest Numbers in a Decade", "transed": 1, "url": "https://www.bbc.com/news/health-53403610", "via": "", "real_tags": ["戒烟", "quit", "吸烟"]}, {"category": "", "categoryclass": "", "imagename": "92e318c1e0a6483ddf5d930dddd3462d.png", "infoid": 1012162, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代人可能在几十个应用程序上都有个人资料。无论是社交媒体应用程序、音乐/视频流还是工作空间资源，我们每个人都必须管理包含个人信息的帐户。随着时间的推移，这些孤立的应用程序之间的联系越来越紧密。Twitter允许新闻网站直接发推文，Discorde在Facebook上搜索推荐的朋友，Jira使用Github个人资料创建用户账户。这种允许应用程序代表您相互对话的趋势被称为“委托访问”，并且已经成为我们在线生活中必不可少的一部分。\n然而，由于这些应用程序保护其数据的方式，开发人员遇到了一个挑战：我们如何委派访问权限？几乎每个应用程序都受到基本用户名/密码模式的保护。要允许应用程序A从应用程序B访问它需要的数据，需要经常代表应用程序A登录到应用程序B-这是多么笨拙！解决方法是为应用程序A提供登录到应用程序B的用户名和密码凭据，这是有问题的，原因如下：\nOAuth的形成是为了解决这种进退两难的情况：如何在不危及最终用户数据的情况下提供委托访问。\n它有助于理解有关协议的常见术语。注意：就本文而言，OAuth指的是OAuth 2.0，这是自2012年以来的最新版本。\n客户端：希望访问资源服务器并代表资源所有者执行操作的应用程序。\n授权服务器：知道资源所有者并可以授权客户端访问资源服务器的服务器。\n归根结底，OAuth的存在是为了在不损害用户数据的情况下为第三方应用程序提供对安全资源的有限访问。考虑到特斯拉有一个“代客模式”，您需要一个代客钥匙卡。这张钥匙卡通知车辆，它将以有限的功能操作，限制最大速度和加速度，并锁定后备箱。此技术在概念上与OAuth的操作方式相同。特斯拉车主让贴身男仆有限地进入他/她的特斯拉，而不需要提供主车钥匙。\nOAuth在社交媒体应用中相当受欢迎。您可能熟悉这样的请求：\n图1：使用OAuth，Spotify(客户端)能够代表Bob(资源所有者)在没有凭据的情况下访问Facebook(资源服务器)。\n当接收到这样的弹出窗口时，OAuth协议在后台运行如下：\nSpotify向Bob发送一条消息，请求获得访问他的公共资料、朋友列表、电子邮件和生日的权限。\nFacebook API验证授权并为Spotify发送访问令牌以访问受保护的资源。\n通过使用奖励和令牌(我们将在下面讨论)，Spotify将获得Bob的代客卡到他的Facebook账户。\n上面的部分提供了50,000英尺的OAuth工作原理视图。现在，让我们来看看引擎盖下的情况，看看使协议能够正常工作的部分。\n在上一节中，我们讨论了OAuth的抽象设计-客户端、资源所有者、授权/资源服务器。在这个系统中，还包括：\n作用域和令牌是OAuth实现精细访问控制的方式。它们一起代表了“做某事的许可”。令牌是“权限”部分，作用域定义了什么是“做某事”。想一想电影票：范围是您被授权观看的电影的名称，而电影票本身是令牌，只有影院员工才能验证它是真实的。在我们的特斯拉示例中，范围是使用代客键启动时启用哪些车辆功能。访问令牌是代客钥匙本身，只有当钥匙由特斯拉经销商发放时，特斯拉车辆才能识别。\n回到图2，我们可以看到授权服务器具有与资源服务器不同的API。从功能上讲，授权服务器用于验证和授权客户端，而资源服务器承载所请求的资源。为了让资源服务器知道是否接受信息查询，它必须知道请求者是否已被授权。这就是访问令牌的用武之地；它的存在是为了通知资源服务器请求者已经经过授权服务器的审查，并且有权进行查询。通过使用令牌作为代理，抽象了提供凭据的需要。接入令牌通常作为JWT承载令牌发布。这些令牌经过加密签名，对客户端没有意义，但是当由资源服务器解码时，它们包含重要信息。访问令牌中包含的变量之一是其作用域。\n因为作用域限制了可以做的事情，所以它们本身必须由资源(如Facebook)定义。通常，有四种类型的作用域：\n作用域可以得到一些东西，做一些事情，两者兼而有之，或者两者都不做。上面的Facebook和Spotify示例是一个读权限的实例，而路透社请求在tweet上发布一篇文章则是写权限。定义作用域是指定如何允许第三方访问用户数据的极其强大的工具。要了解如何使用作用域，请尝试阅读Slake和Google等公司的文档，这些公司都演示了作用域参数的不同排列。\n还有另一种类型的令牌，称为刷新令牌。它们不是访问资源的“键”，而是用于在它们不再起作用时自动获得新的访问令牌(例如，已过期)。像Facebook这样的应用程序可以通过强制使用可选刷新令牌来定期验证授权，以获得新的访问令牌，从而实现更高程度的安全性。刷新令牌有一个重要功能：可以通过使其无效并返回客户端对特权资源的访问来撤销它们。\n授权规定了客户端获取访问令牌的操作顺序。这些独特的顺序称为流。回到我们电影院的类比，有两种方式可以获得门票：(1)在电影院购买(2)在线购买。您选择的方法决定了您将如何获得门票。在大区购买可能如下所示：\n正如您所看到的，授权并不像令牌那样是重要的东西，而是指示要使用哪个流。我们已经介绍了一种类型的授权刷新令牌(参见图3)。不同的授权针对特定的使用情形进行了优化，并将影响最终用户与客户端应用程序的交互方式以及所应用的安全措施。理解构成每种赠款类型的不同参数很重要，但这将使本文变成一篇短篇小说。相反，在下面的Github研究中，我们将重点介绍最常见的授权类型：授权码授权。\n回想一下，OAuth在HTTPS上工作。资源所有者、客户端和授权服务器之间的所有通信都通过URI进行。这些URI是包含作为字符串一部分的参数的查询。这些参数中包含授权服务器需要了解要遵循哪个流的信息。在这一点上，重要的是要注意，有两种类型的客户端：机密客户端和公开客户端。可以信任机密客户端安全地持有令牌，这是访问资源所必需的。这样的客户端可以包括服务器端应用程序。不能信任公共客户端存储客户端凭据。这些类型的客户端包括移动或Javascript浏览器应用程序。\n授权码授权__-授权码授权可能是最常见的授权类型(参见图4)。本质上，客户端接收授权服务器发出的唯一代码，然后将其交换为令牌。通过将接收令牌所需的步骤分解为两个不同的查询，授权服务器能够在颁发令牌之前验证有关客户端的重要信息。\n带PKCE扩展的授权码授权-此授权码授权变体用于无法信任存储凭据的公共客户端。使用PKCE扩展(代码交换公钥)，客户端和服务器传输散列以验证通信未被截获。\n客户端凭据-在某些情况下，客户端请求的是自己的访问权限，而不是资源所有者的访问权限。这些实例发生在机器之间，例如需要访问云存储的任何后端服务。在这种情况下，客户端将发出一个请求，该请求将包括参数‘client_id’和‘client_ret’，授权服务器可以验证这些参数以颁发访问令牌。此类型的授权应仅用于机密客户端，并且必须首先注册。\n设备代码-此授权扩展适用于没有浏览器或键盘体验糟糕的联网设备，如使用控制器和虚拟键盘登录游戏机。如果您已将智能电视连接到您的视频流帐户，则您可能已经使用过此流。\n把所有这些概念放在一起，我们可以进行一个案例研究。Teleport是一款开源远程访问工具，允许用户使用OAuth通过Github单点登录(SSO)进行登录。让我们看看怎么做！\n我们准备好出发了！如上所述，我们将遵循授权码授予。这是因为令牌所有者是用户，而客户端是服务器端应用程序。远程端口不是托管的，所以让我们假设我们已经在您的基础设施中安全地安装了它。如果没有，则应使用PKCE扩展。\n远程端口用户单击“登录”，并使用HTTPS GET请求中包含的以下参数进行重定向：\nAUTHORIZATION_SERVER是GAS公开的URL。所有资源应用程序都将提供可重定向到的URL，通常是API。对于吉瑟布，这是https://github.com/login/oauth/authorize。\nclient_id为GAS提供一个字符串，它可以根据授权客户端的注册表检查该字符串。像Github这样的应用程序将需要注册客户端以帮助识别它们。我们使用12345作为ID。\nredirect_uri用Teleport需要的所有变量通知GAS将Teleport用户定向回哪个URL。对于本例，我们可以将重力文档中提供的示例重定向URL作为https://teleport.example.com:3080/v1/webapi/github/callback。\n范围定义了访问资源的限制。这些作用域由资源应用程序在内部定义。我们可以在这里看到吉瑟布的望远镜。查看Teleport的repo时，我们发现惟一需要的范围是Read：org，它允许Teleport读取组织成员、团队成员和组织项目。\nstate是由Teleport随机生成并与授权服务器来回传递的字符串。通过传递此字符串，客户端和授权服务器都知道它们在通信之间与同一设备通话。在本例中，假设州字符串是Syl(我的狗的名字)。\n综合所有这些参数，远程端口用户在接受登录提示后被定向到的URI将如下所示：\n一旦GAS接收到查询，它将对照远程端口的注册表验证client_id。知道Teleport正在等待授权码后，GAS会将用户带着传递的代码和状态参数发送回重定向URL。我们的下一站是：\n收到代码后，Teleport会自动查询GAS，以换取包含code、redirect_uri和client_id参数的令牌。提供了两个附加参数：\nCLIENT_SECRET来自客户端注册过程中的Github。此字符串应该是秘密的，不能公开访问。因为Teleport托管在我们自己的基础设施上，我们知道这些基础设施是安全的，所以我们可以放心地传递此参数。否则，我们将使用PKCE扩展并散列生成的字符串。在这种情况下，我们的秘密是引力。\n回想一下，将代码交换为令牌需要POST请求。综上所述，Teleport现在发送一个查询：\n使用CLIENT_SECRET和代码，授权服务器能够验证Teleport客户端的请求，并发出自编码的JWT承载令牌，该令牌带有范围和过期时间(可以包括刷新令牌)。这样的令牌可能如下所示：\n{“ACCESS_TOKEN”：“IEZKr6ePPtxZBED”，“TOKEN_TYPE”：“承载”“范围”：“Read：org”，“Expires_In”：3600}。\n现在我们已经获得了访问令牌，剩下的就是代表Teleport用户发出API请求并接收所需的资源。我们通过在HTTPS授权头中将访问令牌作为承载凭证传递来实现这一点。回想一下，我们的作用域是Read：org，这意味着我们可以成功调用的方法很少。考虑到这一点，我们的标题可能类似于：\n成功！如果你已经走到这一步，恭喜你！尽管OAuth提供了一个经常被忽视的便利，但它是一个复杂的协议，需要时间来实现。我们刚刚介绍的示例是OAuth流可能的一百种排列之一。此时，我希望您对该协议有一个全面而充分的概念性理解，以便您能够轻松地自己探索该协议。", "note_en": "The modern human likely has profiles on dozens of applications. Whether it’s social media applications, music/video streaming, or workspace resources, each of us must manage accounts that contain personal information. Over time, these siloed applications have become increasingly connected. Twitter allows news sites to directly tweet, Discord searches Facebook for suggested friends, and Jira creates user accounts using Github profiles. This trend of allowing applications to talk to each other on your behalf is called “Delegated Access” and has become a necessary part of our online lives.\n However, because of the way these applications protect their data, developers run into a challenge:  How do we delegate access? Almost every application is protected by a basic username/password schema. To allow Application A to access the data it needed from Application B would require constantly logging into Application B on behalf of Application A - how unwieldy! The workaround was to give Application A the username and password credentials to log in to Application B, which was problematic for few reasons:\n  OAuth was formed as a solution to this Catch-22 situation: How to provide delegated access without putting the end user’s data at risk.\n  It helps to understand the common jargon around the protocol. Note: for the purposes of this article, OAuth refers to OAuth 2.0, the most recent iteration since 2012.\n Client: Application that wants to access the Resource Server and perform actions on behalf of the Resource Owner\n Authorization Server: Server that knows the Resource Owner and can authorize the Client to access the Resource Server\n  Boiling down to its core purpose, OAuth exists to provide third party applications limited access to secure resources without compromising the user’s data. Consider that Teslas have a “Valet Mode” for which you need a valet keycard. This keycard informs the vehicle that it is to operate with limited functionality, restricting the max speed and acceleration and locking the trunk. This technique is conceptually identical to how OAuth operates. The Tesla Owner gives the valet limited access to his/her Tesla without needing to provide the main vehicle key.\n OAuth is quite popular for social media apps. You are likely familiar with requests like these:\n Figure 1: Using OAuth, Spotify (client) is able to access Facebook (resource server) without credentials on behalf of Bob (resource owner)\n When receiving a pop-up like this, the OAuth protocol operates in the background as follows:\n  Spotify sends a message to Bob requesting the rights to access his public profile, friend list, email and birthday.\n   Facebook API verifies grant and sends an access token for Spotify to access protected resources.\n Through the usage of grants and tokens, which we will discuss next, Spotify is given Bob’s valet card to his Facebook account.\n  The section above gave the 50,000 foot view of how OAuth works. Now let’s look under the hood and see the parts that enable the protocol to function.\n In the previous section, we discussed the abstracted design of OAuth - clients, resource owner, authorization/resource server. Within this system, there are also:\n    Scopes and tokens are how OAuth implements granular access controls. Together they represent a “permission to do something.” The token is the “permission” part and the scope defines what the “do something” is. Think of a movie ticket: the scope is the name of the movie you are authorized to watch and the ticket itself is the token, which only a theater employee can validate as authentic. From our Tesla example, the scope is what vehicle functions are enabled when started with the valet key. The access token is the valet key itself, which the Tesla vehicle can recognize only if the key was issued by the Tesla dealership.\n Going back to Figure 2, we can see that the authorization server has a different API than the resource server. Functionally, the authorization server exists to validate and authorize the client whereas the resource server hosts the resources being requested. For the resource server to know whether or not to honor a query for information, it must know if the requestor has been authorized. This is where the access token comes in; it exists to inform the resource server that the requestor has been vetted by the authorization server and has permission to make the query. By using tokens as a proxy, the need for providing credentials is abstracted. Access tokens are commonly issued as  JWT Bearer Token. These tokens are cryptographically signed to be meaningless to the client, but when decoded by the resource server, they contain important information. One of the variables included within the access token is its scope.\n Because scopes limit what can be done, they must inherently be defined by the resource, such as Facebook. Conventionally, there are four types of scopes:\n  Scopes can either get something, do something, do both, or neither. The Facebook and Spotify example above is an instance of read access, whereas Reuters requesting to tweet an article is write access.  Defining scope is an incredibly powerful tool for specifying how third parties are allowed to access user data. To understand how scopes can be used, try reading the documentation of companies like  Slack and  Google which all demonstrate different permutations of a scope’s parameters.\n There is another type of token called refresh tokens. They are not “keys” to access resources, but are used to automatically obtain new access tokens when they are no longer functional (eg. Expired). Applications like Facebook can enforce a greater degree of security by periodically verifying authorization through the enforced usage of optional  refresh tokens to obtain new  access tokens. Refresh tokens have an important feature: they can be  revoked by invalidating them and walking back client access to privileged resources.\n   Grants dictate the order of operations for a client to obtain an access token. These unique orderings are called flows. Going back to our movie theater analogy, there are two ways to be granted a ticket: (1) Purchase in the theater (2) Purchase online. The method you’ve chosen dictates what you will do to obtain the ticket. Purchasing in theater may look like:\n    As you can see, grants are not material things in the same way a token is, but instead indicate which flow is to be used. We’ve already covered one type of grant - refresh tokens (see Figure 3). Differing grants are optimized for specific use cases and will affect how end-users interact with client applications and which security measures apply. Understanding the different parameters that make up each grant type is important but would turn this article into a short novella. Instead, in the Github study below, we will focus on the most common grant type: Authorization Code Grant.\n Recall that OAuth works over HTTPS. All communication between the resource owner, client, and authorization server happens by way of URIs. These URIs are queries with parameters included as part of the string. Contained within these parameters is the information an authorization server needs to understand which flow to follow. At this point, it’s important to note that there are two types of clients: Confidential and Public. Confidential clients can be trusted to securely hold the token, which is necessary for accessing resources. Such clients may include server-side applications. Public clients cannot be trusted to store client credentials. These types of clients include mobile or Javascript browser applications.\n Authorization Code Grant_ _- Authorization code grants are perhaps the most common grant type (see Figure 4). In essence, the client receives a unique code issued by the authorization server, which is then exchanged for a token. By breaking up the steps required to receive the token into two distinct queries, the authorization server is able to verify important information about the client before issuing the token.\n  Authorization Code Grant with PKCE Extension - This variant of the authorization code grant is used for public clients that cannot be trusted to store credentials. Using the PKCE extension (Public Key for Code Exchange), the client and servers transfer a hash to verify that communications are not intercepted.\n  Client Credentials - In some cases, clients are requesting access for themselves, not for resource owners. These instances take place between machines, such as any back-end services that need to access cloud storage. In this case, the client will make a request that will include parameters ‘client_id’ and ‘client_secret’, which the authorization server can verify to issue access tokens. This type of grant should only be used with confidential clients and must be registered first.\n  Device Code - This grant extension works for internet-connected devices that do not have browsers or have a terrible keyboard experience, like signing into a gaming console using a controller and virtual keyboard. You may have already used this flow if you’ve connected a smart TV to your video streaming account.\n   Putting all these concepts together, we can run through a case study. Teleport, an open-source remote access tool, allows users to log in through Github single sign-on (SSO) using OAuth. Let’s see how!\n   We’re ready to start! As covered above, we will follow the Authorization Code Grant. This is because the token owner is a user and the client is a server-side application. Teleport is not hosted, so let’s assume we’ve installed it safely within your infrastructure. If not, the PKCE extension should be used.\n        Teleport user clicks “Log In,” and is redirected with the following parameters included in the HTTPS GET request:\n   authorization_server is the URL that GAS is exposed to. All resource applications will provide a URL to redirect to, usually an API. For Github, this is  https://github.com/login/oauth/authorize\n  client_id provides a string to the GAS, which it can check against a registry of authorized clients. Applications like Github will require clients to be  registered to help identify them. Let’s use  12345 as the ID.\n redirect_uri informs the GAS which URL to direct the Teleport user back to with all the variables that Teleport needs. For this example, we can take the sample redirect URL provided in the Gravitaional  documentation as  https://teleport.example.com:3080/v1/webapi/github/callback\n scope defines the limitations in accessing resources. These scopes are internally defined by the resource application. We can see  Github’s scopes here. When looking at  Teleport’s repo, we find that the only scope require is  read:org which lets Teleport read organization membership, team membership, and organization projects\n state is a string randomly generated by Teleport and passed back and forth with the authorization server. By passing this string, both the client and authorization server know they are speaking to the same device between communications. For this example, let’s say the state string is Syl (my dog’s name).\n Putting together all these parameters, the URI a Teleport user is directed to after accepting the login prompt will look like:\n   Once the GAS receives the query, it will verify the  client_id against a registry for Teleport. Knowing Teleport is expecting an authorization code, the GAS will send the user back to the redirect URL with the code and the state parameter that was passed. Our next stop is:\n   After receiving the code, Teleport will automatically query the GAS to exchange the code for a token with the  code,  redirect_uri, and  client_id parameters included. Two additional parameters are present:\n client_secret comes from Github during the client registration process. This string should be a secret and not publicly accessible. Because Teleport is hosted on our own infrastructure, which we know to be safe, we feel comfortable passing this parameter. Otherwise, we would use the PKCE extension and hash a generated string. In this case, our secret is  gravitational\n Recall that exchanging a code for a token requires a POST request. Putting this together, Teleport is now sending a query:\n   Using the  client_secret and  code the authorization server is able to verify the Teleport client’s request and issues a JWT bearer token that is self encoded with a scope and expiry time (a refresh token can be included). Such a token may look like:\n { “access_token”:“IEZKr6ePPtxZBEd”, “token_type”:”bearer” “scope”:“read:org”, “expires_in”:3600}\n  Now that we have obtained the access token, all that is left is to make an API request on behalf of the Teleport user and receive the resources desired. We do this by passing the access token as a Bearer credential in the HTTPS  authorization header. Recall our scope was  read:org meaning we have very few methods we can successfully call. With that in mind, our header may look something like:\n     Success! If you have made it this far, Congratulations! Despite providing an often overlooked convenience, OAuth is a complex protocol that will take time to implement. The example we just went through is one of a hundred permutations of what an OAuth flow may look like. At this point, I hope you have a comprehensive and sufficient conceptual understanding to feel comfortable exploring the protocol by yourself.", "posttime": "2020-07-16 05:41:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "了解,oauth,客户端", "title": "您需要了解的关于OAuth的所有信息(2.0)", "title_en": "Everything You Need to Know About OAuth (2.0)", "transed": 1, "url": "https://gravitational.com/blog/everything-you-need-to-know-about-oauth/", "via": "", "real_tags": ["了解", "oauth", "客户端"]}, {"category": "", "categoryclass": "", "imagename": "11ccdaa94ea14160c3c2c5e17458c921.jpg", "infoid": 1012161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位富有魅力的首席执行官，喜欢戏剧性的，并有一个大胆的计划，要制造世界上第一辆大众市场电动汽车。你可能认为我说的是特斯拉，但在Model S开动方向盘的几年前，日产就试图用它的Leaf电池电动车征服这一局面。好的，那位首席执行官现在走了，Leaf的销量没有达到日产希望的水平。但明年，这家日本汽车制造商将凭借阿里亚(Ariya)第二次尝到樱桃的甜头，这是一款周三上午在日本向世界展示的新款Bev。\n你可能正在经历一种似曾相识的感觉--这是非常正常的，因为去年的东京车展和今年的CES上都展示了一款几乎不加掩饰的阿里亚概念车，在那里，一些幸运的鸭子甚至可以驾驶它。(我想，这会教会我呆在家里。)。它的大小和外形与该公司最畅销的Rogue跨界车大致相同，日产希望阿里亚能在销售图表上追随这款车的脚步-在发布会上，日产新任首席执行官阿希瓦尼·古普塔(Ashiwani Gupta)表示，该公司预计到2023财年末，其电动汽车和电动车型的年销量将超过100万辆。阿里亚族将在实现这一目标方面发挥重要作用。(请在2023年3月底的日历上做上标记，看看是否能实现这一目标。)。\n从外观上看，它的大小和形状与畅销的“盗贼”跨界车大致相同。从内部看，它完全是品味高雅的极简主义，日产的新闻材料将其描述为类似于星际飞船上的时尚咖啡厅休息室，我之所以这么说，并不是为了嘲笑写这句话的人，因为我认为他们可能说对了什么。与大众集团即将推出的基于MEB的电动跨界车一样，阿里亚充分利用了Bev滑板布局，最大限度地增加了电池组顶部的机舱空间。在关机的情况下，它似乎模仿了Model3的无按钮美学，配备了大型触摸屏信息娱乐系统。但打开Ariya，背光触觉控制就会出现，设置在黑色的木制仪表盘上。\n动力总成是全新的，有几种不同的配置。你可以选择160kW(215马力)的单前马达，或者290kW(389马力)的双马达全轮驱动，日产称之为4orce。我们希望后者驾驶起来会很有趣，因为日产说4orce是其传奇的GT-R Atessa四轮驱动系统的精神产物。\n还有一对电池组-一个可用63kWh(总计65kWh)，另一个续航里程更长，可用87kWh(总计90kWh)。选择较大的背包和单马达，你的Ariya一次充电应该可以行驶300英里(482公里)(无论是通过7.2kW的交流充电，还是使用CCS插头的130kW直流充电)。你也不必担心电池的寿命：与第一代或第二代Leaf不同的是，Ariya将使用主动热管理。\nAriya将于大约一年后在日本上市，美国将于2021年晚些时候开始销售，起价为4万美元。", "note_en": "A charismatic CEO with a penchant for the dramatic, and a bold plan to build the world&#39;s first mass-market electric vehicle. You probably think I&#39;m talking about Tesla, but years before the Model S turned a wheel, Nissan tried to conquer that ground with its Leaf battery EV. OK,  that CEO is gone now, and the Leaf failed to sell in quite the volume Nissan hoped. But next year, the Japanese automaker gets a second bite at the cherry with the Ariya, a new BEV that was revealed to the world on Wednesday morning in Japan.\n You might be experiencing a touch of deja-vu—that&#39;s perfectly normal, because a thinly veiled concept of the Ariya was shown off at last year&#39;s Tokyo auto show and  this year&#39;s CES, where some lucky ducks even got to drive it. (That will teach me to stay home, I guess.) It&#39;s roughly the same size and shape as the company&#39;s best-selling Rogue crossover, and Nissan hopes that the Ariya follows in that car&#39;s footsteps with regards to the sales chart—at the reveal its new CEO Ashiwani Gupta said that &#34;the company expects sales of its EVs and e-POWER electrified models to be more than 1 million units a year by the end of fiscal 2023. The Ariya will play a significant role in attaining that goal.&#34; (Mark your calendars for the end of March 2023 to see if that pans out.)\n On the outside, it&#39;s roughly the same size and shape as  the best-selling Rogue crossover. On the inside it&#39;s all tasteful minimalism, which Nissan&#39;s press materials descrive as &#34;akin to a sleek cafe lounge on a starship&#34;, and I include that not to mock whoever wrote that because I think they might be on to something. As with Volkswagen Group&#39;s forthcoming MEB-based electric crossovers, the Ariya makes full use of the BEV skateboard layout to maximize cabin space atop the battery pack. With the car powered off, it appears to mimic the button-free aesthetic of the Model 3, complete with large touchscreen infotainment system. But turn the Ariya on and backlit haptic controls appear, set in the black wooden dash.\n The powertrain is all-new, and comes in a few different configurations. You&#39;ll be able to spec it with either a 160kW (215hp) single front motor, or 290kW (389hp) twin-motor all-wheel drive, which Nissan is called 4ORCE. We&#39;re hoping the latter is going to be fun to drive, because Nissan says that 4ORCE is the spiritual offspring of its legendary GT-R ATESSA all-wheel drive system.\n And there are a pair of battery packs—one with 63kWh usable (65kWh total) and a longer-range pack with a useable 87kWh (90kWh total). Pick the bigger pack and the single motor, and your Ariya should be able to do 300 miles (482km) on a single charge (either by 7.2kW AC, or 130kW DC using a CCS plug). You shouldn&#39;t have to worry about battery longevity, either: unlike the first- or  second-generation Leafs, the Ariya will use active thermal management.\n The Ariya goes on sale roughly a year from now in Japan, with US sales beginning later in 2021 at a starting price of $40,000.", "posttime": "2020-07-16 05:21:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "跨界,electric,日产", "title": "这是日产的下一款电动跨界车，将于2021年上市，售价4万美元", "title_en": "Here’s Nissan’s next electric crossover, on sale in 2021 for $40,000", "transed": 1, "url": "https://arstechnica.com/cars/2020/07/heres-nissans-next-electric-crossover-on-sale-in-2021-for-40000/", "via": "", "real_tags": ["跨界", "electric", "日产"]}, {"category": "", "categoryclass": "", "imagename": "4a2414e8d46c3bdc190456313760a6c8.jpg", "infoid": 1012160, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然这三家公司都位于西海岸，但诉讼指控这两家科技巨头违反了伊利诺伊州一项名为生物识别信息隐私法(BIPA)的法律。诉讼将万斯和詹妮克列为原告，但也代表伊利诺伊州的“所有其他类似情况的个人”寻求集体诉讼地位。在诉讼中，这两名原告要求每一次违反法律的行为赔偿5000美元，这项禁令禁止这些公司使用伊利诺伊州居民的“生物特征识别器”，并销毁已经存储的任何相关面部数据。\n“在努力改进面部识别技术的过程中，被告微软违反了伊利诺伊州的生物特征信息隐私法…。除其他事项外，通过非法收集、获取、存储、使用、拥有原告Vance和Janecyk以及所有其他类似情况的伊利诺伊州居民和公民(以下称为“阶级成员”)的生物特征识别符和信息并从中获利，“这是针对微软各州的诉讼版本。\n诉讼中引用的法律是在十多年前通过的，旨在保护伊利诺伊州居民，使他们的生物特征数据不会在未经明确许可的情况下被获取或存储。随着面部识别变得更加常见和更具争议性，涉及BIPA的诉讼现在出现得有些频繁。在美国缺乏联邦隐私保护的情况下，伊利诺伊州的法律对那些习惯于在几乎没有监督的情况下从美国人那里提取数据的公司来说，构成了一个有趣的障碍。\n今年1月，Facebook支付5.5亿美元了结了一起由BIPA引发的集体诉讼。这起诉讼是在2015年代表伊利诺伊州居民提起的，指控这家社交媒体巨头在没有向用户披露的情况下从用户图像中收集面部识别数据。当时，Snapchat、谷歌和Shutterfly都面临着类似的诉讼。\n2019年，美国巡回上诉法院驳回了Facebook关于面部识别数据不算作生物识别数据的指控，称“未经同意(就像这里指控的那样)使用面部识别技术开发面部模板侵犯了个人的私人事务和具体利益。”\n这些公司对面部识别系统进行培训的IBM数据集也引发了自己的争议。正如NBC新闻去年报道的那样，IBM声称其面孔多样性数据集“纯粹是为了学术研究”而设计的，而不是为了公司自己的商业利益。IBM的数据集显然是从超过1亿张获得Creative Commons许可的Flickr图像中挑选出来的，这一决定提出了自己的伦理问题，涉及面部图像的使用，以及是否应该允许企业在没有摄影师和他们拍摄的人同意的情况下，利用开放许可的图像进行面部识别应用。", "note_en": "While all three companies are based on the West Coast, the suit accuses the tech giants of running afoul of an Illinois law known as the  Biometric Information Privacy Act (BIPA). The suit names Vance and Janecyk as plaintiffs but also seeks class action status on behalf of “all other similarly situated individuals” in Illinois. In the lawsuit, the pair of plaintiffs seek $5,000 per violation of the law, an injunction barring the companies from using Illinois residents’ “biometric identifiers” and the destruction of any relevant facial data that’s been stored.\n “In its effort to improve its facial recognition technology, Defendant  Microsoft   violated Illinois’ Biometric Information Privacy Act… by, among other things, unlawfully collecting, obtaining, storing, using, possessing and profiting from the biometric identifiers and information of Plaintiffs Vance and Janecyk and all other similarly situated Illinois residents and citizens (hereinafter, the “Class Members”),” the version of the suit  against Microsoft states.\n  The law cited in the suit, passed more than a decade ago, is designed to protect Illinois residents from having their biometric data harvested or stored without their explicit permission. Lawsuits involving BIPA pop up with some frequency now, as facial recognition becomes both more commonplace and more controversial. In the absence of federal privacy protections in the U.S., the Illinois law poses an interesting hurdle for companies that are used to extracting data from Americans with little oversight.\n In January of this year,  Facebook paid $550 million to settle a class action lawsuit stemming from BIPA. The suit was filed on behalf of Illinois residents in 2015 and alleged that the social media giant collected facial recognition data from user images without disclosing it to users. At the time, Snapchat, Google, and Shutterfly faced similar suits.\n In 2019, a U.S. Circuit Court of Appeals court swatted away Facebook’s claim that facial recognition data did not count as biometric data, stating that “development of face template using facial-recognition technology without consent (as alleged here) invades an individual’s private affairs and concrete interests.”\n The IBM dataset the companies trained facial recognition systems on also poses its own controversies. As  NBC News reported last year, IBM claimed that its Diversity in Faces dataset was designed “purely for academic research” and not for the company’s own commercial interests. The IBM dataset was apparently culled from more than 100 million Creative Commons-licensed Flickr images, a decision that raised its own ethical questions around the use of facial imagery and if corporations should be allowed leverage images with open licensing for facial recognition applications without the consent of photographers and the people they photograph.", "posttime": "2020-07-16 05:20:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,亚马逊,微软,谷歌,microsoft", "title": "\n诉讼指控微软、亚马逊和谷歌违反伊利诺伊州面部识别隐私法", "title_en": "\n\t\t\t\tLawsuits allege Microsoft, Amazon and Google violated Illinois facial recognition privacy law\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/facial-recognition-lawsuit-vance-janecyk-bipa/", "via": "", "real_tags": ["google", "亚马逊", "微软", "谷歌", "microsoft"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012158, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN订户已向您提供以下仅限订阅的内容。数以千计的用户依赖LWN获取来自Linux和自由软件社区的最好消息。如果您喜欢这篇文章，请考虑接受右边的试用报价。感谢您访问LWN.net！\n免费试用LWN 1个月：无需付款或信用卡。现在激活您的试用订阅，看看为什么成千上万的读者订阅LWN.net。\nLua版本5.4于6月底发布；它是这种轻量级脚本语言自1993年创建以来的第15个主要版本。5.4中的新功能", "note_en": "The following subscription-only content has been made available to you by an LWN subscriber. Thousands of subscribers depend on LWN for the best news from the Linux and free software communities. If you enjoy this article, please consider accepting the trial offer on the right. Thank youfor visiting LWN.net!\n Try LWN for free for 1 month: no payment or credit card required.  Activate your trial subscription now and see why thousands of readers subscribe to LWN.net.\n Lua version 5.4 was released at theend of June; it is the fifteenth major version of the lightweight scriptinglanguage since its creation in 1993.  New in 5.4", "posttime": "2020-07-16 05:19:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特性,lua,lwn", "title": "Lua 5.4中的新特性", "title_en": "What's New in Lua 5.4", "transed": 1, "url": "https://lwn.net/SubscriberLink/826134/b1b87e4187435cec/", "via": "", "real_tags": ["特性", "lua", "lwn"]}, {"category": "", "categoryclass": "", "imagename": "558f8c137182818a0de4f38404208786.png", "infoid": 1012157, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最简单、最值得信赖的交易搜索引擎和区块资源管理器。", "note_en": "The easiest and most trusted transaction search engine and block explorer.", "posttime": "2020-07-16 05:18:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,交易,twitter,btc,信赖", "title": "Twitter黑客攻击中的实时BTC交易", "title_en": "Live BTC transactions in Twitter hack", "transed": 1, "url": "https://www.blockchain.com/btc/address/bc1qxy2kgdygjrsqtzq2n0yrf2493p83kkfjhx0wlh?page=2", "via": "", "real_tags": ["黑客", "交易", "twitter", "btc", "信赖"]}, {"category": "", "categoryclass": "", "imagename": "12836d356022ff415c0e1b6e21454bdf.jpeg", "infoid": 1012156, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，我一直在做一个实验。我想跟踪我大脑的输出，看看它是否对我的生活和我设法追踪到的事情有什么真正的影响。\n我随身带了将近一年的日记。我会写下我的日常活动，包括待办事项清单，最重要的是，每天写作的十个想法。\n在过去的一个月里，我几乎完全停了下来。我注意到我提出想法的方式和我普遍的焦虑程度有了很大的不同。我的想法变得稀少了，我的焦虑情绪爆发了，回到了写日记之前的水平。\n写下此刻的想法。那些不速之客通常是最有价值的。--弗朗西斯·培根。\n一个想法或想法总是从最基本的概念开始。它就像被微风吹起的蒲公英绒毛一样飘进你的脑海。你伸出手，轻轻地抓住它，检查它。\n在检查时，您会注意到其中的细节，甚至可能会进一步挑剔它们。当你进一步理论和创造性地探索时，这样的想法在你的脑海中可能会变得复杂和令人兴奋。\n我过去总是对自己说，“哦，这很有趣。我稍后会继续考虑这个问题。“。事实是，除非我把它写下来，否则几乎不会发生。一旦我把它写在纸上，我可以随时重新考虑这个想法，并完全重新投入到这个概念中来。\n通常情况下，如果我不写下这些东西，它们就会永远丢失。我没有他们的记录，也不能进一步详述。通过把它们写下来，你可以跟踪你的思维输出。你会惊讶于你的大脑能输出多少，有多少是好的。\n当然，我有一大堆疯狂的想法要和好的想法搭配，但关键是，如果我没有把它们都写下来，我永远不会对好的想法进行更高层次的思考。\n在把事情写下来，习惯了每天都可以参考的日程表之后，我意识到有多少重要的细节都从我的脑海中溜走了。\n我一周有几次让重要的东西溜走。在我开始列出待办事项清单之前，我过去常常对自己很苛刻，但我意识到我是在无缘无故地责怪自己。这是我有生以来第一次明白，我的大脑无法毫无错误地跟踪一个复杂的日程安排。\n我曾经认为我只是不善于组织和安排优先事项，但事实并非如此。大脑在这些事情上做得很好，它只需要把它们写下来作为参考。一旦你确信你不会忘记重要的事情，你的头脑就会变得清晰和自由去做其他事情。\n否则，你就会不断地想着他们。你可怜的大脑试图自己记录每件事。这是我大部分焦虑和过度思考的根源。只有当我不再把事情写下来，回到我的老路后，我才明白这一点。\n把它放下。抓住机会。这可能很糟糕，但这是你做任何真正好的事情的唯一方法。--威廉·福克纳(William Faulkner)。\n你的大脑是一个很好的出口。它会给你带来比你想象中更伟大的想法。我的一些最好的文章来自我在散步和工作时记下的想法。我后来重新参观了它们，并能够进一步探索它们。\n在一天结束的时候，当我回顾我的日程表、想法和想法时，我可以选择什么是重要的，什么是不重要的。我意识到我有一些重复出现的无用的想法，通过识别思维模式，我成功地注意到了它们，并减少了它们。\n从某种意义上说，写下东西让我能够过滤出好的东西，并专注于生产更多的东西。第一次，我感觉自己控制了自己的思想。没有文档则不存在的控件。\n这就像一个反馈循环。把你的大脑想象成一座核电站。每天，有数百名合格的科学家和工程师记录和记录辐射水平、温度、程序的时间戳和调整参数的结果。\n如果这没有被记录下来，你可以想象很快事情就会开始瓦解，我们就会生活在有毒的荒地里。这片有毒的荒地正是当你不积极记录输出以供检查时在你的脑海中发生的事情。\n这是我们很快忘记并认为理所当然的日常琐事。当我回顾我的日记时，我意识到每天发生的对我现在的幸福或成功至关重要的事情。\n通读它们让我想起它们在我生活中的重要性，以及我的大脑是如何在几个小时内轻易忘记它们的。回顾我与人们的互动，或某些事情给我带来的感受，我会非常感激。\n我想起了我和妹妹散步的时候，这让我很想念她。下次我回家时，我肯定会花些时间和她聊天，提醒她那段时间。\n这让我想起了我为之付出的小小胜利，但这些胜利在过去的几个星期里一落千丈。每当我感到没有动力，或者好像什么都没有完成时，我所要做的就是翻阅我的日记。我提醒自己到目前为止发生的所有伟大的事情。\n因此，通过将思想、情感、想法、记忆和成就放在一起，你有效地减轻了你的思想负担，释放了令人难以置信的带宽，让你可以活在当下。你将不再担心尚未发生的事情，你将不再沉溺于过去。\n没有什么好写的。你所要做的就是坐在打字机前流血。--欧内斯特·海明威", "note_en": "I’ve been running an experiment for the past few months. I wanted to track the output of my brain and see if it made any real difference in my life and the things that I manage to keep track of.\n I kept a journal with me for almost a year. I would write down my day to day activities, including to-do lists and, most importantly, ten ideas for writing every day.\n For the last month, I’ve stopped almost entirely. I’ve noticed a significant difference in the way I approach coming up with ideas and my general anxiety levels. My ideas have grown sparse, and my anxiety has flared up, back to pre-journaling levels.\n  Write down the thoughts of the moment. Those that come unsought for are commonly the most valuable. —  Francis Bacon\n An idea or thought always starts with the most basic conception. It floats into your mind like a dandelion fluff picked up by a breeze. You reach out, seize it gently, and examine it.\n Upon examination, you notice the fine details and maybe even pick at them further. Thoughts like this can become complex and exciting in your mind as you theorize and creatively explore further.\n I always used to think to myself, “oh, that’s interesting. I’ll continue thinking about that later.” The truth is, it rarely happens unless I write it down. Once I have it down on paper, I can revisit that idea whenever I want, and fully re-engage my brain on that concept.\n Typically, when I don’t write these things down, they are lost forever. I have no record of them and can’t expand on them further. By writing them down, you can keep track of the output of your mind. You’ll be shocked by how much your brain can put out, and how much of it is good.\n Of course, I have tons of whack ideas to go with the good ones, but the point is I would have never achieved a higher level of thinking on the good ideas had I not been writing all of them down.\n  After writing things down and getting used to having a schedule I could refer to daily, I realized how many important details slipped my mind.\n I let essential things slip a few times a week. I used to be hard on myself for it, before I started making to-do lists, but I realized I was blaming myself for no good reason. For the first time in my life, I understood that my brain wasn’t capable of keeping track of a sophisticated schedule without error.\n I used to think I was just bad at organization and prioritizing, but that wasn’t true. The brain is excellent at those things, it just needs to write them down for reference. Once you are confident that you won’t forget the important stuff, your mind becomes clear and free for other things.\n Otherwise, you think about them constantly. Your poor brain tries to keep track of everything on its own. This is were most of my anxiety and overthinking stemmed from. It only made sense to me after I stopped writing things down and reverted to my old ways.\n  Get it down. Take chances. It may be bad, but that’s the only way you can do anything really good. —  William Faulkner\n Your brain is a great outlet. It suggests ideas to you that are greater than you think. Some of my best articles are from ideas I took down on walks and at work. I revisited them later and was able to explore them further.\n At the end of the day, when I review my schedule, ideas, and thoughts, I can choose what matters and what doesn’t. I realize that I have re-occurring thoughts that are useless, and by identifying the thought patterns, I have successfully been able to notice them and lessen them.\n In a sense, writing things down has allowed me to filter out the good stuff, and focus on producing more of it. For the first time, I feel like I have control over my mind. Control that doesn’t exist without documentation.\n It’s like a feedback loop. Think of your brain like a nuclear power plant. Every day, there are hundreds of qualified scientists and engineers writing down and recording radiation levels, temperatures, times stamps on procedures, and results of adjusted parameters.\n If this wasn’t being recorded, you can imagine that it wouldn’t be long before things started to fall apart, and we would be living in a toxic wasteland. This toxic wasteland is precisely what happens in your mind when you don’t actively record the output for examination.\n  It’s the small day to day stuff that we forget about quickly and take for granted. When I go back through my journals, I realize all the day to day things that happened that were crucial to my current well being or success.\n Reading them over reminds me of their importance in my life, and how my brain so easily forgets about them within a few hours. Going back over interactions I had with people or how certain things made me feel gives me enormous gratitude.\n I am reminded of the time I went for a walk with my younger sister, and it makes me miss her. The next time I’m home, I’m sure to spend some time talking to her and reminding her of that time.\n I am reminded of the little wins I’ve worked so hard for that have slipped over the weeks. Whenever I feel unmotivated, or like I haven’t accomplished anything, all I have to do is flip through my journal. I remind myself of all the great things that have happened so far.\n So by putting it all together — thoughts, emotions, ideas, memories, and achievements — you are effectively taking a massive load off your mind and freeing up incredible bandwidth for living in the now. You’ll stop worrying about things that have not yet happened, and you’ll stop dwelling on the past.\n There is nothing to writing. All you do is sit down at a typewriter and bleed. — Ernest Hemingway", "posttime": "2020-07-16 05:18:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "power,想法", "title": "写下东西的力量", "title_en": "The Power of Writing Things Down", "transed": 1, "url": "https://medium.com/swlh/the-power-of-writing-things-down-1ba353352c22", "via": "", "real_tags": ["power", "想法"]}, {"category": "", "categoryclass": "", "imagename": "17bfe9d0bf95190f7b910aab1f82d8e3.jpg", "infoid": 1012155, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着SpaceX公司准备为其StarLink宽带服务进行Beta测试，互联网用户已经深入StarLink网站，找到了即将进行的Beta测试的新细节，以及将安装在客户住宅外的用户终端的图像。\nReddit用户昨天表示，他们对Starlink支持网站和主网站进行了一些数据挖掘，从不同角度发现了关于测试版、服务条款和卫星天线图像的常见问题。\nSpaceX首席执行官埃隆·马斯克昨晚在推特上写道，最新版本的菜肴(也称为用户终端)看起来与照片中看到的略有不同。马斯克写道：注意：底座附近的柱子上的插销消失了&在生产版本中，amp；供电的以太网线不那么显眼。\n马斯克此前曾将该终端描述为一根棍子上的不明飞行物。SpaceX公司获得了联邦通信委员会的批准，将部署100万架UFO。\nSpaceX最近更新了Starlink网站，你可以填写一张表格，以获取有关Starlink新闻和您所在地区服务可用性的最新信息。公开测试版测试预计将于秋季开始。\nReddit上发布的Starlink常见问题解答称，Starlink Beta将从美国北部和加拿大南部开始，居住在华盛顿州地区的农村和/或偏远社区。对Starlink Beta计划的访问将取决于用户的位置以及附近地区的用户数量。\n在描述目前的卫星网络，以及测试者需要在家中清晰地看到天空时，FAQ说，Starlink系统目前由近600颗围绕地球运行的卫星组成，这些卫星可以在北纬44度到52度之间的非常特定的范围内提供互联网服务。您的Starlink碟子需要清晰的北方天空视图才能与Starlink卫星通信。没有清晰的视野，星联菜肴就不能很好地连接，你的服务会非常差。\n在昨天的另一条推文中，马斯克指出，Starlink终端有马达可以自动定向，以获得最佳视角，因此不需要专业的安装人员。马斯克写道，航站楼可以放在花园里、屋顶上、桌子上，几乎可以放在任何地方，只要它能看到广阔的天空。他还写道，一旦提供服务，在Starlink.com上订购只需不到一分钟的时间。\n测试员被要求平均每天投入30分钟到1小时来测试Starlink服务，并根据服务条款定期提供反馈。来自SpaceX的反馈请求将以调查、电话、电子邮件和其他方式提供。不参与可能导致终止您的Beta计划参与，您必须退还您的Starlink工具包。Beta测试员将不被允许公开分享有关他们使用该服务的任何信息。\n除了从太空接收信号的用户终端外，StarLink的客户还需要一台路由器来提供家中的Wi-Fi。SpaceX本周获得了FCC对其Starlink路由器的批准，但由于保密请求，该路由器的照片尚未公开。\nFCC提交的一份文件称，该路由器是双频的，支持2.4 GHz和5 GHz的传输。它除了支持802.11b、802.11a/g和802.11n等旧标准外，还支持数据传输速率高达866.7 Mbps的802.11ac Wi-Fi标准。", "note_en": "As SpaceX readies beta testing for its Starlink broadband service, Internet users have dug into the Starlink website and found new details on the upcoming beta tests and images of the user terminals that will be installed outside customers&#39; homes.\n Reddit users yesterday said they did some  data mining of the Starlink support website and main site,  uncovering an FAQ about the beta trials,  terms of service, and  images of the  satellite dish from different  angles.\n     SpaceX CEO Elon Musk  wrote on Twitter last night that the latest version of the dish (also called a user terminal) looks slightly different than what is seen in the photos. &#34;Small note: latch on post near base is gone &amp; powered Ethernet wire is less obtrusive in production version,&#34; Musk wrote.\n Musk has previously described the terminal as a &#34; UFO on a stick.&#34; SpaceX received Federal Communications Commission  approval to deploy 1 million of them.\n  SpaceX recently updated the  Starlink website with a form you can fill out to &#34;get updates on Starlink news and service availability in your area.&#34; Public beta tests are  expected to begin in the fall.\n The Starlink FAQ posted on Reddit says that &#34;Starlink Beta will begin in the Northern United States and lower Canada, with those living in rural and/or remote communities in the Washington state area. Access to the Starlink Beta program will be driven by the user&#39;s location as well as the number of users in nearby areas.&#34;\n Describing the current satellite network and the need for beta testers to have a clear view of the sky from their homes, the FAQ says, &#34;The Starlink system is currently made up of nearly 600 satellites orbiting the Earth that can provide Internet service in a very specific range—between 44 and 52 degrees north latitude. Your Starlink dish requires a clear view of the Northern sky in order to communicate with the Starlink satellites. Without the clear view, the Starlink dish cannot make a good connection and your service will be extremely poor.&#34;\n In another tweet yesterday,  Musk noted that the &#34;Starlink terminal has motors to self-orient for optimal view angle,&#34; eliminating the need for an expert installer. The terminal can be placed &#34;in garden, on roof, table, pretty much anywhere, so long as it has a wide view of the sky,&#34; Musk wrote. He also  wrote that once service is available, it &#34;will take less than a minute to order on Starlink.com.&#34;\n Beta testers are asked to &#34;dedicate an average of 30 minutes to 1 hour per day testing the Starlink Services and providing feedback on a periodic basis,&#34; according to the terms of service. &#34;Feedback requests from SpaceX will come in the form of surveys, phone calls, emails, and other means. Not participating can result in termination of your Beta Program participation and you must return your Starlink Kit.&#34; Beta testers will not be allowed to share anything about their use of the service publicly.\n  Besides the user terminals that receive signals from space, Starlink customers will need a router to supply Wi-Fi in their homes. SpaceX this week got FCC  approval for its Starlink router, but photos of the router are not yet public because of a  confidentiality request.\n An  FCC filing says the router is dual-band, supporting 2.4GHz and 5GHz transmissions. It supports the 802.11ac Wi-Fi standard with data transfer rates of up 866.7Mbps, in addition to older standards including 802.11b, 802.11a/g, and 802.11n.", "posttime": "2020-07-16 04:58:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "终端,spacex,starlink", "title": "SpaceX Starlink测试版的详细信息与用户终端的照片一起出现", "title_en": "Details on SpaceX Starlink beta emerge along with photos of user terminals", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/07/details-on-spacex-starlink-beta-emerge-along-with-photos-of-user-terminals/", "via": "", "real_tags": ["终端", "spacex", "starlink"]}, {"category": "", "categoryclass": "", "imagename": "312a5f350ca9bee46cb3510a25a6dd55.jpg", "infoid": 1012154, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GoHealth的定价高于预期的IPO区间，在此过程中出售的股票比最初计划的要多。通过以每股21美元的价格出售4350万股票-比之前18美元至20美元区间的上限高出1美元，比3950万股的目标高出400万股-这家保险科技公司本周将超过9亿美元计入资产负债表。\n首次亮相是芝加哥工业和科技领域的一次胜利。以IPO价格计算，GoHealth的价值略低于67亿美元，这还不包括可能出售给承销商的股票，这将提高其估值。\n然而，尽管GoHealth的定价好于预期，但其股价在下午的交易中下跌，跌至每股19.00美元，截至撰写本文时，下跌了9.5%。这些下跌与nCino、Lemonade和其他公司最近的首次公开募股形成了鲜明对比，这些公司的股票在上市后立即升值。\n然而，GoHealth的首席执行官在接受TechCrunch采访时强调了公司的长期愿景。在GoHealth的第一个交易日接受克林特·琼斯(Clint Jones)采访时，这位高管告诉TechCrunch，他的公司的股票获得了超额认购，并在IPO过程中实现了积累长期投资者的目标。\n这位首席执行官说，该公司打算用其新基金招聘员工，其中包括1000多名持牌保险经纪人。\n当被问及该公司是否有计划用其IPO资金收购规模较小的公司时，琼斯告诉TechCrunch，在收购技术平台或拥有特定人才的较小团队方面，该公司可能会采取“机会主义”态度。对于在保险市场世界其他领域竞争的许多初创公司-TechCrunch已经覆盖了这个领域，包括为保险科技初创公司提供的一系列融资-一家新富起来的上市公司可能会提供一个有趣的退出机会。\n该公司强劲的IPO定价，尽管首日交易有些疲软，但对于感兴趣地关注其公开募股的相关规模较小的公司来说，感觉就像是一场洗礼；GoHealth的交易进展情况可能有助于为精选的保险科技初创公司估值定下基调。\n然而，今天我们又推出了另一款独角兽科技产品。GoHealth通向公开市场的道路并不像一些人那样直截了当，但它还是做到了。", "note_en": "GoHealth   priced above its  anticipated IPO range, selling more shares than initially planned in the process. By vending 43.5 million shares at $21 apiece — $1 per share more than the top of its preceding $18 to $20 range, and four million shares more than its target of 39.5 million — the insurance technology company put more than $900 million onto its balance sheet this week.\n The debut is a win for Chicago’s industry and tech scenes. GoHealth was worth a little less than $6.7 billion at its IPO price, not counting shares that may be sold to its underwriters, which would boost its valuation.\n  Despite its better-than-anticipated pricing, however, GoHealth shares sagged in afternoon trading, slipping to $19.00 per share, down 9.5% as of the time of writing. The declines stand in contrast to the recent debuts of  nCino,   Lemonade and others, which saw their shares instantly gain value after going public.\n GoHealth’s CEO, however, stressed the long-term vision of his company in an interview with TechCrunch. Speaking with  Clint Jones during GoHealth’s first trading day, the executive told TechCrunch that his company’s offering was oversubscribed, and had met its goal of accumulating long-term investors during its IPO process.\n The company intends to hire with its new funds, including 1,000 more licensed insurance agents, the CEO said.\n  Asked whether the company has plans to acquire smaller companies with its IPO funds, Jones told TechCrunch that it could be “opportunistic” regarding buying tech platforms, or smaller teams with particular talent. For the many startups competing in other parts of the insurance marketplace world — TechCrunch has  covered the space extensively, including a  bevy of funding rounds  for insurtech startups — a newly wealthy public company could provide an interesting exit opportunity.\n The company’s strong IPO pricing, if somewhat slack first-day’s trading, feels akin to a wash for related, smaller firms watching its public offering with interest; how GoHealth trades moving forward could help set the tone for select insurtech startup valuations.\n For today, however, we have yet another unicorn tech-ish offering all wrapped up. GoHealth’s path to the public market’s  wasn’t as straightforward as some, but it got there all the same.", "posttime": "2020-07-16 04:58:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "gohealth,shares", "title": "\nGoHealth的股价在大规模IPO后下跌", "title_en": "\n\t\t\t\tGoHealth’s shares dip after upsized IPO\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/gohealths-shares-dip-after-upsized-ipo/", "via": "", "real_tags": ["gohealth", "shares"]}, {"category": "", "categoryclass": "", "imagename": "7f9bd504597370b5b33c43bc323ee1e5.jpg", "infoid": 1012153, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在StackHawk，Bennet将继续专注于开源项目的开发，该公司表示，该项目是世界上使用最频繁的安全扫描工具之一。\nStackHawk已经将开源项目用于其底层扫描技术，并通过分层安全测试自动化、与开发工具的集成以及用于新开发范例的功能来建立业务。\n“自从创立ZAP以来，我们的愿景一直是为开发者提供应用程序安全，”Bennetts在一份声明中说。虽然该项目已被安全团队和笔试人员广泛采用，但我很高兴能与一个致力于实现我们针对DEVS的AppSec最初愿景的团队合作，该团队也相信发展开放源码社区。“。\nStackHawk的创始人Joni Klippert、Scott Gerlach和Ryan Servers and Bennetts找到了共同的理由，他们认为漏洞编辑工具通常是为外部企业安全团队开发的，而不是为与他们正在开发的应用程序最接近的开发人员开发的。\n西蒙在ZAP项目上的工作使安全和开放源码世界变得更好。很明显，我们在将应用安全带到开发者手中的使命上高度一致，“StackHawk的首席执行官兼创始人克利珀特在一份声明中说。西蒙加入StackHawk团队提供了一个令人兴奋的机会，可以在ZAP开源项目中进行更多投资，同时还可以建立能力，使企业开发团队能够轻松地将AppSec简化到他们的CI/CD管道中。“。\n自从Bennetts第一次从事ZAP工作以来的11年里，OWASP基金会合并的安全扫描器因其动态应用程序安全测试而在开发人员社区中流行起来。\n招聘结束后，StackHawk表示不会有太大变化。Bennetts将继续致力于开源项目，而公司将继续围绕扫描仪构建功能。\n这家总部位于丹佛的公司已经从Flybridge、Costanoa Ventures、Matchtick Ventures和Foundry Group等投资者那里筹集了近500万美元的融资。", "note_en": "At StackHawk, Bennets will continue to focus on the development of the open source project, which the company said is among the world’s most frequently used security scanning tools.\n StackHawk already uses the open source project for its underlying scanning technology and has built a business by layering on security test automation, integrations with development tools and functionality for new development paradigms.\n  “Since founding ZAP, the vision has always been to deliver application security to developers,” Bennetts said, in a statement. “While the project has been widely adopted by security teams and pen testers, I’m excited to work with a team dedicated to delivering our original vision of AppSec for devs and that also believes in growing the open source community.”\n StackHawk founders Joni Klippert, Scott Gerlach and Ryan Servers and Bennetts found common cause in their belief that bug editing tools are too often built for external enterprise security teams instead of the developers who are closest to the apps they’re building.\n “Simon’s work on the ZAP project has both changed the security and open-source worlds for the better. It became clear that we were highly aligned in our mission to bring application security into the hands of developers,” said Klippert, the chief executive and founder of StackHawk, in a statement. “Simon joining the StackHawk team provides an exciting opportunity to invest more in the ZAP open source project, while also building capabilities that make it easy for enterprise development teams to streamline AppSec into their CI/CD pipelines.”\n In the eleven years since Bennetts first began working on ZAP, the OWASP Foundation-incorporated security scanner has become popular among the developer community for its dynamic application security testing.\n After the hire, StackHawk said that nothing much will change. Bennetts will continue to work on the open source project while the company will continue to build functionality around the scanner.\n The Denver-based company has raised nearly $5 million in financing from investors including  Flybridge,   Costanoa Ventures, Matchstick Ventures and  Foundry Group  .", "posttime": "2020-07-16 04:57:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,漏洞,开发,位于,denver", "title": "\n总部位于丹佛的漏洞检测服务公司StackHawk聘请了开源项目Zed Attack Proxy的开发者", "title_en": "\n\t\t\t\tStackHawk, the Denver-based bug detecting service, hires developer of open source project Zed Attack Proxy\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/stackhawk-the-denver-based-bug-detecting-service-hires-developer-of-open-source-project-zed-attack-proxy/", "via": "", "real_tags": ["开源", "漏洞", "开发", "位于", "denver"]}]