[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1029605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们在学校里被教授集合论时，我想知道为什么他们用了整整一章的数学来教我们如何将项目分类。具有相似属性的实体组合在一起不是很明显吗？\n十多年后，我意识到，当他们教给你一些东西时，也许整个主题并不重要，重要的是关于这个主题的一小部分信息，这些信息将来可能会派上用场。\n为什么这个看似微不足道的事实会成为我精神健全的关键呢？更重要的是，它如何帮助我防止代码库变成意大利面？‍。\n我正在构建一个客户支持工具，CS工程师可以在其中解决从多个沟通渠道提出的客户问题。\n因此，根据其设计，我们需要一个UI元素来指示每个通道有多少对话处于无人值守状态。\n正如您可能已经猜到的那样，浏览器页面的每次刷新都会检索此信息，因此在每次刷新时通过对话数据库为每个支持渠道运行计数查询效率不是很高。\n当然，一开始这可能不是什么大事，但如果我们将规模扩大到我们计划使用该产品的一半，这样的查询将比我希望的更快地在背后咬我一口。\n我想到的解决方案是缓存每个支持渠道的打开对话计数。起初这是有道理的，但当我再想一想时，它很快就变成了一场噩梦。\n好的，我计划在缓存中保存打开的对话的计数，这意味着每次打开对话时，我会递增计数，而每次关闭对话时，我会递减计数，这是不是意味着，每次打开对话时，我都会递增计数，而每次关闭对话时，我会递减计数？\n好的，这听起来不是很糟糕，但是我如何触发这个递增/递减操作呢？我想每当数据库中的会话更新时，我都可以这样做。\n但是等等，我不能在每次更新对话时都触发它，如果对话是打开的，但对话中的一些其他数据在状态仍为打开时被更新，该怎么办？\n只有当状态从打开更改为关闭或从关闭更改为打开时，我是否必须编写IF-ELSE条件才能运行递增/递减操作？\n如果会话更新完成运行，但递增/递减操作由于某种原因失败，或反之亦然，会发生什么情况？如何在不损坏数据的情况下重新运行更新？\n如果您还没有猜到我带着这篇文章要去哪里，这里有一个很好的视觉帮助。\n那么集合论是如何让我走出困境的呢？如果我为每个支持渠道维护一组属于开放对话的ID，会怎么样？\n现在我要做的就是：在每次会话更新时，如果状态为打开，则将该会话ID添加到集合中，如果状态为关闭，则将其从集合中删除。\n当然，该集合将存储在RAM上，是的，与仅为每个支持通道存储单个计数相比，它将占用更多内存，但我们所做的只是存储ID，而不是整个数据对象，因此它在内存方面几乎不会花费太多成本。\n这对解决问题有什么帮助呢？如果你想要打开对话的数量，只要得到集合中元素的数量，如果你愿意的话，就是集合的基数。\n因为一个集合不能有重复项。无论我将一个项目添加到集合中多少次，唯一的对话ID只能添加一次，同样，一旦执行了删除操作，对同一对话ID的后续删除操作也不会对数据产生影响。数据已经变成了幂等项。\n这意味着在执行会话更新操作时不需要if-Else条件。我所需要做的就是根据更新后对话的状态执行添加/删除操作。\n是否有显式状态更新并不重要。每次更新都可以触发此逻辑，并且数据保持不损坏。如果任何操作中途失败，只需重新运行会话更新即可。\n要做到这一点，最明显的方法是对每个支持通道使用类似这样的JSON字典数据结构。\n如果需要将会话添加到集合中，请使用关键字作为会话ID更新字典，并将值设置为true或1。对于删除操作，请首先检查会话ID是否已在字典中，然后将其从字典中删除。如果它还不存在，请不要执行任何操作。\n该字典现在可以存储在内存中的变量中，并在整个应用程序中使用。要获取支持频道的打开对话计数，只需获取字典中存在的关键字数量即可。\n显然，其他人在我之前就意识到了集合作为数据结构的重要性，因为Redis-一个用于缓存数据的优雅的内存数据库-已经提供了集合数据结构以及允许您在集合中添加、删除和查找项目数量的操作。\n我强烈建议在您的应用程序中使用它，而不是在变量中维护字典，因为Redis的优秀人员已经解决了由于维护内存缓存而可能出现的许多其他问题。\n也许重温我们小时候学到的一些概念是有价值的，看看它们是否仍然相关，是否能以某种方式应用于现实世界。\n至少，这会给我们一个了结，给我们灌输希望，也许我们学到的一切在当时看起来毫无用处，但在我们的生活中，可能会有某些方面派上用场，我们只需要保持我们的眼睛，耳朵，最重要的是我们的思想开放。", "note_en": "When we were taught the Set theory at school, I wondered why they dedicated an entire chapter in math to teach us about how to group items into categories. Isn’t it obvious that entities that have similar properties get clubbed together?\n More than a decade later I realised that when they teach you something, maybe the entire topic is not as important as that one small nugget of information about this topic that might come in handy down the line.\n     Why did this seemingly insignificant fact become the key to my mental sanity? And more importantly how did it help me prevent my codebase from turning into spaghetti?  ‍\n  I am building a  customer support tool where the CS agent can solve customer queries raised from multiple channels of communication.\n So by its very design we required a UI element which indicated how many conversations are left unattended for each of the channels.\n    As you may have guessed, this information is being retrieved on every refresh of the browser page and therefore running a count query through the conversation database for each support channel on every refresh is not very efficient.\n Sure, it may not be a big deal at first but if we scale to even half of what we plan to hit with this product, a query like this will bite me in the rear sooner than I would want it to.\n  The solution that occurred to me was to cache the count of open conversations for each support channel. This made sense at first but it quickly turned into a nightmare when I gave it a little more thought.\n Okay so I plan to save a count of the open conversations in the cache, which means every time a conversation is opened I increment the count and every time a conversation is closed, I decrement the count?\n Alright that doesn’t sound so bad but how do I trigger this increment/decrement operation? I suppose I could do it whenever a conversation gets updated in the database.\n  But wait, I can’t trigger it every single time a conversation is updated, what if a conversation is open but some other data in the conversation gets updated while the status is still open?\n Do I have to write an if-else condition to run the increment/decrement operation only when status changes from open to closed or from closed to open?\n What happens if a conversation update finished running but the increment/decrement operation failed for some reason or vice versa? How do I re-run an update without corrupting the data?\n In case you haven’t guessed where I was heading with this, here is a nice visual aid.\n     So how did Set theory get me out of this mess? What if I maintained a Set of IDs that belong to open conversations for each support channel?\n All I have to do now is this: On every conversation update, if status is open, I add that conversation ID to the Set and I remove it from the Set if status is closed.\n This Set would be stored on the RAM of course and yes it would take up more memory than storing just a single count for every support channel but all we are doing is storing IDs and not the entire data object so it would hardly cost much in terms of memory.\n How does this help with the problem? Well, if you want the count of open conversations just get the number of elements in the Set, the cardinal number of the Set if you will.\n  Because a Set cannot have duplicates. It does not matter how many times I add an item to a Set, a unique conversation ID can be added to it only once and similarly once a remove operation is performed, subsequent remove operations on the same conversation ID won’t have an affect on the data. The data has become idempotent.\n This means that I don’t need an if-else condition when a conversation update operation is performed. All I need to do is perform an add/remove operation based on the status of the conversation post update.\n It doesn’t matter if there is an explicit status update or not. Every update can trigger this logic and the data remains incorrupt. If any of the operations fail midway, the conversation update can just be re-run.\n     The most obvious way to do this is to use a JSON dictionary data structure like this for every support channel.\n    If a conversation needs to be added to the Set, update the dictionary with the key as the conversation id and value as true or 1. For remove operations first check if the conversation id is already in the dictionary and remove It from the dictionary. Do nothing if it’s not already present.\n This dictionary can now be stored in a variable in memory and used throughout the application. To get the count of open conversations for a support channel, just get the number of keys present in the dictionary.\n  Clearly somebody else figured out the importance of a Set as a data structure way before I did, because  Redis - an elegant In memory database used for caching data already offers the Set data structure along with operations that let you add, remove and find number of items in a Set.\n I would highly recommend using this in your application instead of maintaining a dictionary in a variable because the good folks at Redis already solve a host of other problems that might occur as a result of maintaining an in-memory cache.\n     Perhaps there is some merit in revisiting some of the concepts we learnt as children and see if they are still relevant and can somehow be applied to the real world.\n At the very least this would give us closure and instil hope that maybe everything we were taught that seemed useless at the time has a certain aspect to it that might come in handy at some point or the other in our lives and we just have to keep our eyes, ears and most importantly our minds open.", "posttime": "2020-10-18 23:09:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据结构,data,集合", "title": "集合数据结构将我从痛苦的世界中解救出来", "title_en": "The Set data structure saved me from a world of pain", "transed": 1, "url": "https://www.sankalpjonna.com/posts/the-set-data-structure-saved-me-from-a-world-of-pain", "via": "", "real_tags": ["数据结构", "data", "集合"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论是大自然的声音，吹风机的嗡嗡声，还是吊扇不停的嗡嗡声，白噪音应用程序已经被全球数百万人下载，希望能获得更好的夜间睡眠。然而，研究表明，没有很好的证据表明它们有效，甚至可能会使情况变得更糟。\n真正的白噪音是人类可以听到的所有频率发出的嘶嘶的嘶嘶声，这些频率是随机发射的，而且是等强度的。近年来，已经开发了许多应用程序和设备，使用它-或者其他令人放松的声音，如风扇的嗡嗡声或海浪的撞击声-帮助人们入睡。\n他们取得了巨大的成功--苹果设备上的睡前风扇应用程序已经有超过300万次的下载量，而安卓的白噪音发生器则有超过100万次的下载量。一种理论认为，它们有助于淹没其他烦人的声音，如街道噪音；另一种理论是，每晚听同样的声音可能会引发一种巴甫洛夫式的反应，人们学会将其与入睡联系在一起。但是它真的起作用了吗？\n马蒂亚斯·巴斯纳(Mathias Basner)是费城宾夕法尼亚大学医学院(University Of Pennsylvania School Of Medicine)的精神病学教授，他和同事系统地回顾了科学文献，确定了38项研究，调查了噪音作为睡眠辅助的作用。虽然有一些证据表明持续的噪音减少了个人入睡的时间，但证据的质量非常差，至少有一项研究表明，噪音可能会导致更多的睡眠中断。\n“如果这些应用或设备只能做好事，我真的不会在意。但是因为可能会有负面后果，所以我会很小心。“Basner说，他的研究已经发表在”睡眠医学评论“杂志上。“我不会广泛推荐它们，因为没有证据表明它们确实在起作用。”\n他还担心不让听觉系统在一夜之间关闭的潜在不良影响，尽管这也还没有经过测试。他说：“每当我们暴露在声音和噪音中时，内耳都会将其转化为神经信号，然后由大脑进行解释。”“这是一个活跃的过程，会产生代谢物，其中一些已被证明对内耳有害。你可能希望有一段时间，在这段时间里，听觉系统可以放松下来，再生，并为下一个觉醒时期做好准备。“。\n牛津大学睡眠医学教授科林·埃斯皮(Colin Espie)同意，关于持续噪音和睡眠的研究质量很差。“即使是这个想法在概念上也是非常有限的，”他说。“在睡眠不佳时需要克服的主要问题是忙碌或心急如焚。”人们在精神上是无法关闭的。白噪音就像任何其他单调的刺激一样，几十年来已经在很多方面尝试了很多次，(证明它有效的)证据很少。“。\n瑞士巴塞尔大学时间生物学中心的负责人克里斯蒂安·卡约琴教授说：“我认为更好的[形式]连续白噪音掩盖了高度间歇性的背景噪音，这就是为什么推荐给上夜班的人，他们白天经常需要在‘嘈杂’的环境中睡觉。”在那里我可以看到好处，但在相对安静的环境中睡觉时就看不到了。任何连续或不连续的声音刺激都有可能中断睡眠过程。“\n他补充说：“我宁愿推荐像Sleepio这样的正念应用程序，因为它们是基于睡眠医学研究的良好证据，特别是针对失眠的认知行为疗法。”", "note_en": "Whether it is nature sounds, the whine of a hairdryer or the incessant hum of a ceiling fan, white noise apps have been downloaded by millions of people around the world in the hope of getting a better night’s sleep. However, research suggests there is no good evidence that they work, and may even be making things worse.\n True white noise is the hissy fizzing sound of all the frequencies that humans can hear being fired off randomly and at the same intensity. In recent years, numerous apps and devices have been developed that use it – or other “relaxing” sounds such as the hum of a fan or crashing waves – to help people fall asleep.\n They have been hugely successful – the Bedtime Fan app, available on Apple devices, has had more than 3m downloads, while the Android White Noise Generator has more than 1m. One theory is that they help to  drown out other bothersome sounds such as street noise; another is that listening to the same sound each night may trigger a kind of Pavlovian response, where people learn to associate it with falling asleep. But does it actually work?\n Mathias Basner, a professor of psychiatry at the University of Pennsylvania School of Medicine in Philadelphia, and colleagues systematically reviewed the scientific literature and identified 38 studies that have investigated noise as a sleep aid. Although there was some evidence that continuous noise reduced the amount of time it took individuals to fall asleep, the quality of the evidence was extremely poor, and at least one study suggested the noise may lead to more disrupted sleep.\n “If these apps or devices could only do good things, I wouldn’t really care. But because there may be negative consequences, I would just be careful,” said Basner, whose research has been published in the journal  Sleep Medicine Reviews. “I wouldn’t broadly recommend them, because there is no evidence that they are actually working.”\n He is also concerned about the potential ill-effects of not allowing the auditory system to switch off overnight, although this also has not yet been tested. “Whenever we’re exposed to sounds and noise, the inner ear is translating that into nerve signals that are then interpreted by the brain,” he said. “It is an active process, which generates metabolites, some of which have been shown to be harmful to the inner ear. You probably want to have a period where the auditory system can wind down, regenerate and prepare for the next wake period.”\n Colin Espie, a professor of sleep medicine at the University of Oxford, agrees the research quality of studies on continuous noise and sleep is poor. “Even the idea is a very limited one conceptually,” he said. “The main concern to overcome in poor sleep is the busy or racing mind. People can’t switch off mentally. White noise is just like any other monotonous stimulation, which has been tried many times in many ways over decades, and the evidence [for it working] is poor.”\n Prof Christian Cajochen, who heads the Centre for Chronobiology at the University of Basel in Switzerland, said: “I think the better [forms of] continuous white noise mask highly intermittent background noise, which is why it is recommended for nightshift workers who often need to sleep during the day in a ‘noisy’ environment. There I can see a benefit, but not when sleeping in a relatively quiet environment. Any acoustic stimulus being continuous or not has the potential to interrupt the sleep process.”\n He added: “I would rather recommend mindfulness apps like Sleepio, since they are based on good evidence coming from research in sleep medicine, particularly  cognitive behavioural therapy for insomnia.”", "posttime": "2020-10-18 22:31:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,助眠剂,noise,噪音", "title": "科学家称，白噪音作为助眠剂可能弊大于利", "title_en": "White noise as sleep aid may do more harm than good, say scientists", "transed": 1, "url": "https://www.theguardian.com/lifeandstyle/2020/oct/18/white-noise-as-sleep-aid-may-do-more-harm-than-good-say-scientists", "via": "", "real_tags": ["科学家", "助眠剂", "noise", "噪音"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年9月10日OpenWrt作为16年来最受欢迎的免费与开放源码(FOSS)无线路由器项目，在其成功的基础上，今天加入了保护协会，成为该项目的成员。FOSS无线路由器确保所有互联网用户的软件自由度。保护协会将帮助OpenWRT作为其新的财政赞助商继续蓬勃发展。OpenWrt在软件自由史上占有特殊的地位。OpenWRT的创建和发布表明，GPL的实施起到了作用，并促进了软件自由。2004年，Linksys发布了WRT54G路由器系列的固件代码，程序员和修修工重新获得了对自己路由器的控制权，并基于从GPL强制执行中解放出来的源代码推出了OpenWRT。今天，OpenWRT利用受GPL保护的软件自由，与使用无线路由器连接到互联网的每个人共享这种自由和控制。\n布拉德利·M·库恩(Bradley M.Kuhn)，我们的政策研究员和常驻黑客，在OpenWRT有很长的历史。“在我的职业生涯中，有几次我有机会与志同道合的开发人员和技术专家合作，他们的立场成为重大变革的催化剂。不过，最令人自豪的是我领导的联盟在Linksys&#39；WRT54G不合规的WRT54G上执行了GPL“，布拉德利说。他说：“多年后，我有机会通过我们在保护协会的工作来支持、捍卫和改进OpenWRT项目，这给我带来了巨大的喜悦。OpenWRT的结构主要是以用户为中心的草根项目，为尽可能多的无线路由器型号提供解放的售后固件。我甚至无法想象还有什么项目能比这更契合长春社的使命和重点，把自由/开源软件带给普通民众。“。在保护协会内部，就像我们的其他成员项目一样，一个小型的代表委员会将代表OpenWRT社区和领导层，以简化互动并与员工合作。最初的代表委员会将是John Crispin、Hauke Mehrten和Jo-Philipp Wich。Jo-Philipp今天很兴奋地代表委员会加入了保护协会，他说：“OpenWRT团队很自豪能作为保护协会成员项目继续我们在互联网软件自由方面的工作。保护协会对软件自由的承诺和它的非营利性专业知识使其自然适合OpenWRT。我们期待着改进我们项目的组织，并共同确保FOSS嵌入式路由器固件的未来开发和可用性“。甚至在OpenWRT今天加入之前，Therancy就已经以其他方式与OpenWRT项目进行了协作，其中包括许多OpenWRT的定期贡献者，他们也加入了Truancy针对Linux开发人员的GPL遵从性项目。保护协会还经常使用OpenWRT&#39；在各种型号上的移植状态作为参考，以评估无线路由器市场中的GPL合规性状态。以这种新的方式规范我们的各种连接对于OpenWRT和保护来说是令人兴奋的一步，我们都期待着为促进无线设备用户的软件自由状态做更多的工作。\nOpenWRT项目是一个面向嵌入式设备的基于Linux的操作系统。OpenWRT不是试图创建单个静态固件，而是通过包管理提供完全可写的文件系统。这使您从供应商提供的应用程序选择和配置中解脱出来，并允许您通过使用软件包来自定义设备以适合任何应用程序。对于开发人员来说，OpenWRT是构建应用程序的框架，而不必围绕它构建完整的固件；对于用户来说，这意味着完全定制的能力，以前所未有的方式使用设备。\n保护协会是一个足智多谋的非营利性组织，致力于通过发展软件自由运动，支持社区驱动的专有软件替代方案，并以实际行动捍卫自由软件构建者，帮助人们控制他们的计算体验。萨瑟西认为，软件的未来应该是面向每个人的，尤其是无线路由器等小型电子设备的家庭用户。\n本网站使用曲奇饼。通过使用该网站，您同意将Cookie存储在您的计算机上。此外，您承认您已阅读并理解我们的隐私政策。如果您不同意，请离开网站。有关Cookie的更多信息", "note_en": "September 10, 2020OpenWrt — building on their sixteen years of success as the most popular Free and Open Source ( FOSS) wireless router project — today joins  Conservancy as a member project.  FOSS wireless routers assure software freedom for all Internet users. Conservancy will help OpenWrt continue to thrive and grow as its new fiscal sponsor.OpenWrt occupies a special place in the history of software freedom. OpenWrt&#39;s creation and launch shows that  GPL enforcement works and advances software freedom. In 2004, when Linksys released the firmware code for the WRT54G router series, coders and tinkerers regained control over their own routers, and  launched OpenWrt based on the sources liberated from GPL enforcement. Today, OpenWrt leverages software freedom protected by the  GPL to share that freedom and control with everyone who uses wireless routers to connect to the Internet.\n  Bradley M. Kuhn, our Policy Fellow and Hacker-in-residence has a long history with OpenWrt. “A few times in my career, I&#39;ve had the opportunity to collaborate with like-minded developers and techologists who took a stand that became a catalyst for major change. The proudest, though, was when I led the coalition who enforced the  GPL on Linksys&#39; non-compliant WRT54G”, said Bradley. “It brings me great joy these many years later to have the opportunity to support, defend, and improve the OpenWrt project through our work at Conservancy. OpenWrt structures itself primarily as a user-focused, grassroots project to provide liberated after-market firmwares for as many wireless router models as possible. I cannot even imagine a project that fits better with the mission and focus of Conservancy to bring  FOSS to the general public.” Inside Conservancy, as with our other member projects, a small representation committee will represent the OpenWrt community and leadership to streamline interactions and work with staff. This initial representation committee will be John Crispin, Hauke Mehrtens, and Jo-Philipp Wich. Excited to join Conservancy today, on behalf of the committee, Jo-Philipp stated: “The OpenWrt team is proud to continue our work towards internet software freedom as a Conservancy member project. Conservancy&#39;s commitment to software freedom and its nonprofit expertise make it a natural fit for OpenWrt. We look forward to improving our project&#39;s organization and securing the future development and availability of  FOSS embedded router firmware together”.Even before OpenWrt&#39;s joining today, Conservancy collaborated in other ways with the OpenWrt project, including many regular contributors to OpenWrt joining  Conservancy&#39;s GPL Compliance Project for Linux Developers. Conservancy also often uses OpenWrt&#39;s porting status on various models as a reference to assess  GPL compliance status in the wireless router market. Formalizing our various connections in this new way is an exciting step for OpenWrt and Conservancy, and we all look forward to doing more to advance the state of software freedom for wireless device users.\n  The OpenWrt Project is a Linux-based operating system targeting embedded devices. Instead of trying to create a single, static firmware, OpenWrt provides a fully writable filesystem with package management. This frees you from the application selection and configuration provided by the vendor and allows you to customize the device through the use of packages to suit any application. For developers, OpenWrt is the framework to build an application without having to build a complete firmware around it; for users this means the ability for full customization, to use the device in ways never envisioned.\n  Conservancy is a resourceful, non-profit organization dedicated to helping people take control of their computing experience by growing the software freedom movement, supporting community-driven alternatives to proprietary software and defending free software builders with practical initiatives. Conservancy believes that the future of software should be for everyone, and in particular, home users of small electronic devices such as wireless routers.\n  This website uses cookies. By using the website, you agree with storing cookies on your computer. Also you acknowledge that you have read and understand our Privacy Policy. If you do not agree leave the website.  More information about cookies", "posttime": "2020-10-18 22:30:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,加入,joins,openwrt", "title": "OpenWRT加入软件自由保护协会", "title_en": "OpenWrt Joins Software Freedom Conservancy", "transed": 1, "url": "https://openwrt.org/openwrt_joins_conservancy", "via": "", "real_tags": ["软件", "加入", "joins", "openwrt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029601, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个页面最初是作为一个网站出现的，与JuliaMono的第一个版本相伴，现在它已经作为博客帖子合并到了这里。\nJuliaMono是一种等宽字体，设计用于在Julia编程语言和其他文本编辑环境中进行编程，这些环境需要广泛的专业和技术Unicode字符。这是一个有趣的实验，将在葡萄牙里斯本举行的2020年JuliaCon会议上展示(当然，这不是在里斯本实际发生的，而是在网上发生的)。\n最初的临时网站到处都使用JuliaMono，所以让我们试着让这个页面的其余部分也这样做。\n使用zygote：@adjointfunction忽略(F)尝试返回f()catch e；返回0；endend@adjoint函数忽略(F)尝试zygote._̄(__CONTEXT__，f)捕获e 0，y CONTEXT-&gt；NOT ENDEND。\nJuliaMono有不同的权重，因此您可以控制突出显示代码中的对比度：JuliaMono-Light、JuliaMono-Regular、JuliaMono-Medium、JuliaMono-Bold、JuliaMono-ExtraBold和JuliaMono-Black。[3]。\n(还有两种名称中包含“拉丁文”的字体的版本：这些是仅支持基本MacroMan/Windows1252“拉丁文”字符集的精简版本，主要用于作为占位符使用，主要是如果您希望更好地控制基于Web浏览器的应用程序中的字体加载时间。)。\n在行家手中(如下面Julia代码片段[4]的作者Zygmunt Szpak博士)，可用的Unicode字符的范围可能非常具有表现力：\n函数T(𝛉：：AbstractArray，𝒞：：Tuple{AbstractArray，vararg{AbstractArray}}，𝒟：：Tuple{AbstractArray，vararg{AbstractArray}})⊗=kron l=Length(𝛉)𝐈ₗ=SMatrix{l，l}(1.0i)𝐈ₘ=SMatrix{1，1}(1.0i)𝐓=@SMatrix zeros(l，l)N=Length(𝒟[1])ℳ，ℳʹ=𝒟Λ₁，Λ₂=𝒞𝚲ₙ=@MMatrix zeros(4，4)𝐞₁=@SMatrix[1.0；0.0；0.0]𝐞₂=@SMatrix[0.0；1.0；0.0]For n=1：n INDEX=SVector(1，2)𝚲ₙ[1：2，1：2].=Λ₁[n][INDEX，INDEX]𝚲ₙ[3：4，3：4].=Λ₂[n][INDEX，索引]𝐦=hom(ℳ[n])𝐦ʹ=hom(ℳʹ[n])𝐔ₙ=(𝐦⊗𝐦ʹ)∂ₓ𝐮ₙ=[(𝐞₁⊗𝐦ʹ)(𝐞₂⊗𝐦ʹ)(𝐦⊗𝐞₁)(𝐦⊗𝐞₂)]𝐁ₙ=∂ₓ𝐮ₙ*𝚲ₙ*∂ₓ𝐮ₙ&#39；𝚺ₙ=𝛉&#39；*𝐁ₙ*𝛉𝚺ₙ⁻？=inv(𝚺ₙ)𝐓₁=@S矩阵零(Float64，l，l)，k=1：l𝐞ₖ=𝐈ₗ[：，k]∂𝐞ₖ𝚺ₙ=(𝐈ₘ⊗𝐞ₖ&#39；)*𝐁ₙ*(𝐈ₘ⊗𝛉)+(𝐈ₘ⊗𝛉&#39；)*𝐁ₙ*(𝐈ₘ⊗𝐞ₖ)#在𝐓₁中累加结果会分配内存，#即使#SUM中的两个项都是数组。𝐓₁=𝐓₁+𝐔ₙ*𝚺ₙ⁻？*(∂𝐞ₖ𝚺ₙ)*𝚺ₙ⁻？*𝐔ₙ&#39；*𝛉*𝐞ₖ&#39；End𝐓=𝐓+𝐓₁End𝐓End\nἌδμηθ‘，ὁρᾷςγὰρτἀμὰπράγμαθ’ὡςἔχει，λέξαιθέλωσοιπρὶνθανεῖνἃβούλομαι.。\nЯ，пазачътВальоужбди，аскришомхапвакюфтенцазадщайгите.。\n“Dóna amor que seràs Feliç！”Aixó，il·lús company geniüt，jaés un llu it rètol Blavís d‘onze kWh.。\nZvlášťzákeřnèučeňsďolíčKy běžípodél zónyúlů。\nVOIX歧义d‘un cœur qui au zéphyr préfère les jattes de kiwi。\nΤαχίστηαλώπηξβαφήςψημένηγη，δρασκελίζειυπέρνωθρούκυνός.。\nHĩlanDiagua kuñanguéra oho peteĩsaʼyju ypaʼũme Gavóme Omboʼe hag̃UA ingyleñeʼẽmitãnguéare neʼẽndyʼỹ.。\nJófoximés don Quijote húszwattos lámpánálülve Egy pár bűvös cipőt készít.\n[ɢʷɯʔ.nas.doːŋ.Kʰlja][ŋAn.ȵʑI̯wo.ɕI̯uĕn.ɣWA]。\nĊuaiġbéṁórṡáċle dlúṫspád fíorḟinn tríhata moḋEA-ṗorcáinḃig.。\nMuļķa hipiji mēģina brīvi nogaršot celofānažņaudzējčūsku.。\nĮlinkDama fechtuotojošpaga subykčiojui huręžėapvalųarbūzą.。\nЅидарскипејзаж:шугавбилмезсочудењеџвакаќофтеикељнатуѓцех.。\nPchnąćw tęłódźjeża lub ośm skrzyń图.。\nLís ArgüiaàJúlia que braçáes，fé，chá，óxido，pôr，zângão»ERAM palavras do Português。\nШирокаяэлектрификацияюжныхгубернийдастмощныйтолчокподъёмусельскогохозяйства.\nАјшо，лепотоичежњо，заљубавсрцамогадођиуХаџићенакафу.。\n本杰明·皮迪奥纳·贝比达·德·奇维·弗鲁拉；Noé，sin Vergüenza，la más Champaña del menú。\nЧуєшїх，доцю，га?Кумеднажти，прощайсябезґольфів！\nJuliaMono的目标之一是包含一个典型程序员理所当然会找到的大多数字符。(除了所有这些表情符号-它们最好由操作系统处理。)。以下是随机选择的一千个左右：\n在JuliaMono中，每个字符的宽度都相同，因为这是等宽字体。通常，带有大量Unicode数学符号的字体不是等宽字体，因为它们旨在用于散文和\\(\\LaTeX\\)应用程序，而不是用于编程代码。\n从设计的角度来看，将每个字符强制放入相同大小的框中是一个问题。这就像是让每个人都可以坐在相同的飞机座椅上，不管是什么形状或大小--有些角色看起来肯定会不舒服。从来没有足够的空间容纳漂亮的“m”或“w”。\n(当然，大小不是一切-质量可以胜过数量，其他字体会提供不同的体验[8])。\n支持框绘制字符和DataFrames.jl输出(终端允许)也是一个好主意：\nJulia&GT；DF=DataFrame(A=样本，B=字形)df=10×2 DataFrame│Row│A│B│││String│String│├─┼─┼─┤│1│▁▂▁▁▂▄▅▁▄▁▁▅▆▂▇▅▂▇││1│Sample 2│▁▂▄▁▁▃▁▆▂▆▃▁▂▃▂▇▄││。3│示例3│▁▆▇▁▃▇▇▆▅▅▄▇▇▅▅▇▄▂││4│示例4│▅▁▄▁▆▃▁▃▇▂▂▇▅▇▃▆▃▁││5│示例5│▆▂▁▂▇▆▃▅▅▄▆▇▄▇▆▁▇││6│示例6│▁▁▇▂▂▇▃▅▂▂▆▂▄▄▁▄▂▇▆││7│示例7│▂▃▂▁▁▇。▁▂▆▂▁▇▁▄▃▂▁▄││8│示例8│▄▄▁▂▄▁▅▁▅▁▂▂▇▂▁▃▄▄││9│示例9│▁▁▁▂▁▆▃▄▄▁▂▂▃▂▁▅▁▆▃││10│示例10│▁▇▄▂▅▃▇▁▇▇▆▄▇▅▄▂▄▅▄│。\n如果想知道是否可以在Julia代码中使用Unicode字符作为标识符，请使用未记录的函数Base.isidentifier()。因此，例如，如果您想要使用dingbat(经典的Herman Zapf dingbat设计之一)，您可以在下面的输出中寻找合适的东西：\nJulia&gt；for n in 0x2700：0x27bf Base.isidentifier(String(Char(N)&amp；&amp；打印(字符(N))end✀✁✂✃✄✅✆✇✈✉✊✋✌✍✎✏✐✑✒✓✔✕✖✗✘✙✚✛✜✝✞✟✠✡✢✣✤✥✦✧✨✩✪✫✬✭✮✯✰✱✲✳✴✵✶✷✸✹✺✻✼✽✾✿❀❁❂❃❄❅❆❇❈❉❊❋❌❍❎❏❐❑❒❓❔❕❖❗❘❙❚❛❜❝❞❟❠❡❢❣❤❥❦❧➔➕➖➗➘➙➚。➛➜➝➞➟➠➡➢➣➤➥➦➧➨➩➪➫➬➭➮➯➰➱➲➳➴➵➶➷➸➹➺➻➼➽➾➿julia&gt；❤=println(&#34；i❤$&34；)❤(带1个方法的泛型函数)julia&gt；❤(&#34；julia&34；)i❤julia。\nJuliaMono是一种OpenType字体。OpenType技术提供强大的文本定位、模式匹配和字形替换特性，这些特性对于阿拉伯语和乌尔都语等语言至关重要。在英语中，当某些字体中的字母对(如fi)被替换为单个字形(如ﬁ)时，经常会看到opentype功能。自从活字印刷发明以来，这些连字就一直在使用，用更好看的替代方案取代了偶尔出现的笨拙的字符组合。\n老实说，我对它们在字体编码中的使用并不是很感兴趣(而且我也不是唯一的一个[9])。我喜欢看到我输入的内容，而不是字体决定替换它的内容。但是，在Julia的一些地方，合适的Unicode替代方案不被语言接受，我觉得当前使用的ASCII艺术糖果可以通过明智地使用替代字形来轻微增强。在一些地方，一些细微的调整可以增强语言的可读性，而不会带来歧义。\nJulialang=true#(！=0)(x，y)-&gt；(x+y)f(p：：int)=p*p@inbound if f in(Base.：+，Base.：-)if any(x-&gt；x&lt；：AbstractArray{&lt；：Number})名词=dict(Base：+=&gt；&#34；加法&#34；，Base：-=&gt；&#34；减法&#34；，)enddf2=DF|&gt；@groupby(_.a)|&gt；@map({a=key(_)，b=means(_.b)})|&gt；DataFrame#&lt；|。\nOpenType字体还允许您为某些字符选择不同的设计。这些被存储为“样式集”。\n所有选项都存储在字体中，并且通常由其内部的四个字母代码引用(真的不是最好的面向用户的设计)。例如，上面列出的上下文替换项集中存储在CALT功能中。\n有时，应用程序会在字体面板[11]中更直观地显示选项，通常隐藏在字体选择器对话框中的某个位置。\n所有这些花哨的技术都在您正在使用的应用程序和操作系统的控制之下。理想情况下，它们将为您提供一种简单的方式来打开和关闭各种OpenType功能。\n基于浏览器的编辑器(如Juno和VS Code)在其编辑器窗口中支持许多OpenType特性，但在终端/控制台窗口中不支持。它们提供了一个设置区域，您可以在其中键入CSS或JSON选择器来控制特性的外观，并且您必须知道特性代码。有些功能是选择加入的，而另一些则是选择退出的；这也可能因应用程序的不同而不同。\n终端/控制台应用程序也有很大不同；在MacOS上，终端和iTerm应用程序试图提供对OpenType功能的控制，并取得了不同程度的成功。在Linux上，一些终端应用程序(如Kitty)提供了相当好的支持，但其他应用程序(如Alacritty)到目前为止几乎没有提供任何支持。[12]。\n如果应用程序允许，您应该能够关闭CALT上下文连字，特别是因为相当多的人不会喜欢他们的代码中的任何一个。对于下面的清单，我使用CSS关闭了CALT集合(请参见此处)，然后启用一些可选的样式集：将字符(如0、g、a、j和@)与前面的清单进行比较：\nJulialang=true#(！=0)(x，y)-&gt；(x+y)f(p：：int)=p*p@inbound if f in(Base.：+，Base.：-)if any(x-&gt；x&lt；：AbstractArray{&lt；：Number})名词=dict(Base：+=&gt；&#34；加法&#34；，Base：-=&gt；&#34；减法&#34；，)enddf2=DF|&gt；@groupby(_.a)|&gt；@map({a=key(_)，b=means(_.b)})|&gt；DataFrame#&lt；|。\n(我最初喜欢更圆形的@标志的想法，但实际上它在小字体尺寸下不起作用，因为细节消失了。但不管怎样，我都留着它。)。\nUnicode系统中有几个区域已正式保留为空，因此可用于存储不属于该标准的字符。这些区域称为专用区域，有三个区域：\\ue000到\\uf8ff、\\UF0000到\\UFFFFD和U100000到U+10FFFD。\n在这些方面，每种字体都可以做自己的事情。例如，在JuliaMono中，如果您环顾一下\\ue800，您会发现一些熟悉的形状：\n在专用区域使用字符的明显缺点是，除非它们已转换为轮廓或位图，否则您必须将字体安装在希望它们正确呈现的任何位置。如果字体没有安装(例如在GitHub上)，你不知道会显示什么字形(如果有的话)。\n您可以将这些定义为在Julia REPL上可用。例如，假设您希望在julia会话中键入\\julialogo并激活juliaMono字体时，终端中可以使用julia Circle。运行以下命令：\n通常可以将Unicode值直接键入文本。当你不使用Julia REPL时，这是一项很有用的技能…。在MacOS上，在按住Option(⌥)键的同时键入四个十六进制数字(确保您使用的是Unicode十六进制输入键盘)。在Windows上，我认为您可以输入四个十六进制数字，然后是Alt，然后是X。在Linux上，可能是ctrl-Shift-u，然后是十六进制数字。\n要安装并激活字体，请从应用程序文件夹启动Font Book，然后将字体文件拖到标记为Font的中间窗格中。如果你正在使用不同的字体管理器，你已经知道该怎么做了。：)。\n要在Windows上安装并激活字体，请转到计算机|&gt；本地磁盘(C：)|&gt；Windows|&gt；字体。找到展开的.zip文件夹，并将字体文件从该文件夹拖到Fonts文件夹中。\n并将文件复制到那里。您可能希望(或必须)重新生成字体缓存：\n这种字体是在葡萄牙里斯本举行的2020年Julia编程语言大会(JuliaCon)上推出的，它(将)是我对庆祝活动的贡献。这是一项实验，目的是看看是否可以在头脑中使用特定的编程语言来设计字体。\n它包含Julia文档的Unicode输入章节中使用的所有字形(表情符号除外)。\n该字体包含一些特殊功能，如上下文替代、样式集和“连字”，以补充Julia语法。\n你可以访问朱莉娅博客的这面镜子。它已经有一段时间没有更新了(在Franklin.jl开发期间很有用)，但是所有的代码示例都使用JuliaMono。\n你可以浏览这本朱莉娅旧手册的本地副本。默认的Roboto-Mono字体已替换为JuliaMono-Regular。\n这不是问题！但我明白你的意思。工作环境选择(编辑器、字体、配色方案、背景音乐、首选饮料等)。这在很大程度上是个人的事情，在您使用特定设置的几个小时、几天和几周内，您会逐渐习惯它，而不熟悉的工作环境会看起来没有吸引力，甚至很难看。您可能需要尝试其他选择一段时间，然后才能更习惯它们。幸运的是，您不必使用Comic Code、Kakoune编辑器、Autechre的音乐、榴莲茶或其他任何新的和陌生的东西；只需坚持您当前最喜欢的！\n找到相关的CSS文件，并添加一个指向服务器上存储的WOFF2的链接。例如：\n这将使用jsDelivr CDN(内容分发网络)访问当前版本的常规字体。\n您可能更喜欢从您自己的服务器提供WOFF/2字体。您可能会遇到一个与跨域资源共享有关的问题，在某些浏览器上，这会阻止一个网页从另一个网页下载字体。\n在VS-Code中，您可以在迷宫(但谢天谢地是可搜索的)设置部分找到字体设置。\n要控制上下文和样式替代项的显示，请单击JSON中的编辑设置，然后查找editor.fontLigatures：\n这使用功能代码(此处列出)。这些都应该在一行中打开或关闭。\n或者，如果您只是不喜欢上下文替换，更喜欢斜杠零、简单的g和较浅的星号，请使用以下命令：\n这是个好问题。“出于安全原因”，如今有些浏览器甚至不愿让您访问自己本地磁盘上的内容。但是该字体的本地副本可能在您的特定设置中可用和访问。\n如果没有，您可以尝试使用Web字体，如上所述。例如，如果这里有一个Jupyter CSS文件：\n@FONT-FACE{FONT-FACE：JuliaMono-Regular；src：url(&#34；https://cdn.jsdelivr.net/gh/cormullion/juliamono/webfonts/JuliaMono-Regular.woff2&#34；)；}.rendered_html表{FONT-SIZE：16px！Important；}div.input_Area{Background：#def！Important；FONT-Size：16px！Important；}.CodeMirror{FONT-SIZE：16px！Important；Font-Family：&#34；JuliaMono-Regular&#34；！Important；FONT-Feature-Settings：&#34；零&#34；，&#34；SS01&#34；；字体变体连字：上下文；}。\n另一个很棒的问题。您确定要在绘图上使用等宽字体吗？如果您这样做了，那么在打印时询问字体应该很容易。但是，它永远不会像您希望的那样简单，这在字体世界中是很常见的。\n一些后端使用字体做他们自己的事情。例如，我根本无法说服GR后端使用JuliaMono。\n以下是使用JuliaMono进行绘图的一些代码。该图显示了Julia git存储库中使用的每个Unicode字符的出现频率，并使用这些字符作为绘图标记。我检查了每个文本文件，计算了所有字符的总数-有956044个字母“e”，以此类推。我使用pylot()；freqs DataFrame保存字符和计数。我已经使用Plots.font()创建了几个字体对象，这使得在lot()函数中使用不同的文本样式变得更容易。我还没有弄清楚如何使用字体系列的不同粗细。\n使用绘图，Plots.PlotMeasurespyplot()theme(：dark)juliamonofont8=Plots.font(Family=&#34；JuliaMono&#34；，8，Halign=：Center，Colorant&#34；White&34；)juliamonofont12=Plots.font(Family=&#34；JuliaMono&#34；，12，Halign=：Center，Colorant&#34；White&#34；)juliamonofont80=Plots.font(Family=&#34；JuliaMono&#34；，80，Halign=：Center，Colorant&#34；grey30&34；)Annotation=&#34；在Julia源文件&#34；p=Plot(1：100，freqs[1：100，2]，FontFamily=&#34；JuliaMono&#34；，March=20 mm，y Axis=：log10，Annotation=[(50,1000，Plots.text(Annotation，juliamonofont12)，(80，1_000_000，Plots.text(&#34；&#34；，juliamonofont80)]，line Width=0.25，Series_Annotation=Plots.text.(freqs[1：100，1]，Ref(Juliamonofont8))，xLabel=&#34；←较频繁|较不频繁→&34；，yLabel=&#34；出现次数(对数刻度)&#34；，labelfontsize=6，title_fontsize=14，格式化=：普通，大小=(800500)，标题=&#34；前100个字符\\n在Julia GitHub存储库中显示(P)。\n前9个字符“etanirsol”与典型的英语频率计数(如“etarionsh”)非常匹配。不出所料，括号在这里表现得非常好。\n尽管Julia文档中出现了3600多个唯一字符，但其中大约3000个字符只出现一次。除了JuliaMono中没有的表情符号之外，所有的表情符号都可以绘制出来，但长尾在视觉上并不是很有趣。\n要想绘制表情符号，你必须深入到Plots系统的内部。\n请注意，y轴标签位于随matplotlib提供的DejaVu Sans中。这是因为：log10缩放代码执行自己的\\(\\latex\\)-y操作，忽略当前字体。然而，至少我能够成功地插入Julia徽标，因为它是JuliaMono字体的一部分。\n在\\(\\LaTeX\\)文档中，您应该能够定义和使用本地字体。\nRobert Moss提供了一个出色的软件包，可帮助您协商在使用Unicode和\\(\\LaTeX\\)时可能遇到的各种字体问题：\n这取决于你是指网页字体还是指“桌面”字体。Web字体有两种风格，.WOFF和.WOFF2，其中2表示较新且稍微紧凑的格式。JuliaMono-Regular.woff是674KB，JuliaMono-Regular.woff2是619KB-大概是一个PNG图像的大小。\n作为比较，Julia手册(以及从v0.21开始使用Documenter.jl构建的每个手册)的.CSS文件的主题文件夹大约为700KB。因此，在这种情况下，WOFF2字体并没有那么糟糕。当然，每个Julia文档(Lato和Roboto)下载的两种Google字体都很小，只有14KB和11KB，每种字体都有221个字形。\n因此，如果您正在构建一个网站，或者为移动应用程序进行设计，WOFF2文件的大小将是衡量拥有可预测字符集的优势的一个重要因素。请注意，您可以使用Unicode范围特性在CSS中指定字体子集，该特性定义了一组您知道要使用的受限字符集，这样用户就不会下载他们不需要的任何字符集。\n您可以考虑使用‘-拉丁语’变体来避免初始加载时间。\n当然，您是对的，有很多编码字体，它们都非常适合用Julia和大多数其他语言进行编程。比较两种不同的字体，关键在于细微的相似和不同之处有多重要。也许使用一种字体，您会看到偶尔出现的空框或奇怪的替换，而不是您所希望的字符。或者，有时您可能不喜欢特定的字形。\n不过，更有可能的是，一种新字体的整体“感觉”--太窄、太宽、太密、太轻、太古怪、太单调、太一致、太多变--是个人品味问题，不受客观衡量的影响。JuliaMono的设计目标--易读、易用、不怪异、简单--意味着形状不会被压缩或压缩。它不是很时髦的薄。由于宽敞的空间，它可能会感觉相当“通风”\n.", "note_en": "This page first appeared as a website to acompany the first release of JuliaMono, and it&#39;s now been incorporated here as a blog post.\n  JuliaMono is a monospaced typeface designed for programming in the  Julia Programming Language and in other text editing environments that require a wide range of specialist and technical Unicode characters. It was intended as a fun experiment to be presented at the 2020 JuliaCon conference in Lisbon, Portugal (which of course didn’t physically happen in Lisbon, but online).\n   The original temporary website used JuliaMono everywhere, so let&#39;s try to make the rest of this page do the same.\n   using Zygote: @adjointfunction ignore(f) try return f() catch e; return 0; endend@adjoint function ignore(f) try Zygote._pullback(__context__, f) catch e 0, ȳ -&gt; nothing endend\n There are different weights of JuliaMono, so you can control the amount of contrast you have in your highlighted code:  JuliaMono-Light, JuliaMono-Regular,  JuliaMono-Medium,  JuliaMono-Bold,  JuliaMono-ExtraBold, and  JuliaMono-Black.   [3]\n (There are also versions of two of the fonts with “Latin” in the name: these are stripped down versions supporting just the basic MacRoman/Windows1252 “Latin” character sets, intended for use as place-holders, of interest mainly if you want to have more control over font loading times in web browser-based applications.)\n In the hands of a virtuoso (such as Dr Zygmunt Szpak, the author of the following Julia code fragment  [4]), the range of available Unicode characters can be quite expressive:\n function T(𝛉::AbstractArray, 𝒞::Tuple{AbstractArray, Vararg{AbstractArray}}, 𝒟::Tuple{AbstractArray, Vararg{AbstractArray}}) ⊗ = kron l = length(𝛉) 𝐈ₗ = SMatrix{l,l}(1.0I) 𝐈ₘ = SMatrix{1,1}(1.0I) 𝐓 = @SMatrix zeros(l,l) N = length(𝒟[1]) ℳ, ℳʹ = 𝒟 Λ₁, Λ₂ = 𝒞 𝚲ₙ = @MMatrix zeros(4,4) 𝐞₁ = @SMatrix [1.0; 0.0; 0.0] 𝐞₂ = @SMatrix [0.0; 1.0; 0.0] for n = 1:N index = SVector(1,2) 𝚲ₙ[1:2,1:2] .= Λ₁[n][index,index] 𝚲ₙ[3:4,3:4] .= Λ₂[n][index,index] 𝐦 = hom(ℳ[n]) 𝐦ʹ = hom(ℳʹ[n]) 𝐔ₙ = (𝐦 ⊗ 𝐦ʹ) ∂ₓ𝐮ₙ = [(𝐞₁ ⊗ 𝐦ʹ) (𝐞₂ ⊗ 𝐦ʹ) (𝐦 ⊗ 𝐞₁) (𝐦 ⊗ 𝐞₂)] 𝐁ₙ = ∂ₓ𝐮ₙ * 𝚲ₙ * ∂ₓ𝐮ₙ&#39; 𝚺ₙ = 𝛉&#39; * 𝐁ₙ * 𝛉 𝚺ₙ⁻¹ = inv(𝚺ₙ) 𝐓₁ = @SMatrix zeros(Float64,l,l) for k = 1:l 𝐞ₖ = 𝐈ₗ[:,k] ∂𝐞ₖ𝚺ₙ = (𝐈ₘ ⊗ 𝐞ₖ&#39;) * 𝐁ₙ * (𝐈ₘ ⊗ 𝛉) + (𝐈ₘ ⊗ 𝛉&#39;) * 𝐁ₙ * (𝐈ₘ ⊗ 𝐞ₖ) # Accumulating the result in 𝐓₁ allocates memory, # even though the two terms in the # summation are both SArrays. 𝐓₁ = 𝐓₁ + 𝐔ₙ * 𝚺ₙ⁻¹ * (∂𝐞ₖ𝚺ₙ) * 𝚺ₙ⁻¹ * 𝐔ₙ&#39; * 𝛉 * 𝐞ₖ&#39; end 𝐓 = 𝐓 + 𝐓₁ end 𝐓end\n   Ἄδμηθ’, ὁρᾷς γὰρ τἀμὰ πράγμαθ’ ὡς ἔχει, λέξαι θέλω σοι πρὶν θανεῖν ἃ βούλομαι.\n  Я, пазачът Вальо уж бди, а скришом хапва кюфтенца зад щайгите.\n  «Dóna amor que seràs feliç!». Això, il·lús company geniüt, ja és un lluït rètol blavís d’onze kWh.\n  Zvlášť zákeřný učeň s ďolíčky běží podél zóny úlů\n          Voix ambiguë d’un cœur qui au zéphyr préfère les jattes de kiwi.\n    Ταχίστη αλώπηξ βαφής ψημένη γη, δρασκελίζει υπέρ νωθρού κυνός.\n  Hĩlandiagua kuñanguéra oho peteĩ saʼyju ypaʼũme Gavõme omboʼe hag̃ua ingyleñeʼẽ mitãnguérare neʼẽndyʼỹ.\n  Jó foxim és don Quijote húszwattos lámpánál ülve egy pár bűvös cipőt készít.\n  [ɢʷɯʔ.nas.doːŋ.kʰlja] [ŋan.ȵʑi̯wo.ɕi̯uĕn.ɣwa]\n    Ċuaiġ bé ṁórṡáċ le dlúṫspád fíorḟinn trí hata mo ḋea-ṗorcáin ḃig.\n  Muļķa hipiji mēģina brīvi nogaršot celofāna žņaudzējčūsku.\n  Įlinkdama fechtuotojo špaga sublykčiojusi pragręžė apvalų arbūzą.\n  Ѕидарски пејзаж: шугав билмез со чудење џвака ќофте и кељ на туѓ цех.\n    Pchnąć w tę łódź jeża lub ośm skrzyń fig.\n  Luís argüia à Júlia que «brações, fé, chá, óxido, pôr, zângão» eram palavras do português.\n    Широкая электрификация южных губерний даст мощный толчок подъёму сельского хозяйства.\n    Ајшо, лепото и чежњо, за љубав срца мога дођи у Хаџиће на кафу.\n  Benjamín pidió una bebida de kiwi y fresa; Noé, sin vergüenza, la más champaña del menú.\n      Чуєш їх, доцю, га? Кумедна ж ти, прощайся без ґольфів!\n  One of the goals of JuliaMono is to include most of the characters that a typical programmer would reasonably expect to find. (Except for all those emojis - they are best handled by the operating system.) Here’s a thousand or so chosen at random:\n   In JuliaMono, every character is the same width, because this is a  monospaced typeface. Usually, typefaces with a lot of Unicode mathematical symbols are not monospaced, because they’re intended for use in prose and \\( \\LaTeX \\) applications, rather than in programming code.\n From a design perspective, forcing every character into the same size box is a problem. It’s like fitting every human being of whatever shape or size into identical airplane seats - some characters are bound to look uncomfortable. There’s never quite enough room for a nice-looking “m” or “w”.\n        (Of course, size isn’t everything - quality can beat quantity, and other fonts will offer different experiences  [8]).\n It’s also a good idea to support box-drawing characters and DataFrames.jl output (terminal permitting):\n julia&gt; df = DataFrame(A=samples, B=glyphs)df = 10×2 DataFrame│ Row │ A │ B ││ │ String │ String │├─────┼────────────────┼─────────────────────┤│ 1 │ sample 1 │ ▁▂▁▁▂▄▅▁▄▁▁▅▆▂▇▅▂▇ ││ 2 │ sample 2 │ ▁▂▄▁▁▃▁▆▂▆▃▁▂▃▂▇▄ ││ 3 │ sample 3 │ ▁▆▇▁▃▇▇▆▅▅▄▇▇▅▅▇▄▂ ││ 4 │ sample 4 │ ▅▁▄▁▆▃▁▃▇▂▂▇▅▇▃▆▃▁ ││ 5 │ sample 5 │ ▆▂▁▂▇▆▃▅▅▄▆▇▄▇▆▁▇ ││ 6 │ sample 6 │ ▁▁▇▂▂▇▃▅▂▂▆▂▄▄▁▄▂▇▆ ││ 7 │ sample 7 │ ▂▃▂▁▁▇▁▂▆▂▁▇▁▄▃▂▁▄ ││ 8 │ sample 8 │ ▄▄▁▂▄▁▅▁▅▁▂▂▇▂▁▃▄▄ ││ 9 │ sample 9 │ ▁▁▁▂▁▆▃▄▄▁▂▂▃▂▁▅▁▆▃ ││ 10 │ sample 10 │ ▁▇▄▂▅▃▇▁▇▇▆▄▇▅▄▂▄▅▄ │\n  If you want to know whether you can use a Unicode character as an identifier in your Julia code, use the undocumented function  Base.isidentifier(). So, for example, if you have the urge to use a dingbat (one of the classic  Herman Zapf dingbat designs), you could look for something suitable in the output of this:\n julia&gt; for n in 0x2700:0x27bf\t\t\tBase.isidentifier(string(Char(n))) &amp;&amp; print(Char(n))\t end✀✁✂✃✄✅✆✇✈✉✊✋✌✍✎✏✐✑✒✓✔✕✖✗✘✙✚✛✜✝✞✟✠✡✢✣✤✥✦✧✨✩✪✫✬✭✮✯✰✱✲✳✴✵✶✷✸✹✺✻✼✽✾✿❀❁❂❃❄❅❆❇❈❉❊❋❌❍❎❏❐❑❒❓❔❕❖❗❘❙❚❛❜❝❞❟❠❡❢❣❤❥❦❧➔➕➖➗➘➙➚➛➜➝➞➟➠➡➢➣➤➥➦➧➨➩➪➫➬➭➮➯➰➱➲➳➴➵➶➷➸➹➺➻➼➽➾➿julia&gt; ❤(s) = println(&#34;I ❤ $(s)&#34;)❤ (generic function with 1 method)julia&gt; ❤(&#34;Julia&#34;)I ❤ Julia\n  JuliaMono is an  OpenType typeface. OpenType technology provides powerful text positioning, pattern matching, and glyph substitution features, which are essential for languages such as Arabic and Urdu. In English, OpenType features are often seen when letter pairs such as  fi in certain fonts are replaced by a single glyph such as  ﬁ. These  ligatures have been used ever since printing with moveable type was invented, replacing the occasional awkward character combination with a better-looking alternative.\n To be honest, I’m not a big fan of their use in coding fonts (and I’m not the only one  [9]). I like to see exactly what I’ve typed, rather than what the font has decided to replace it with. But, there are a few places in Julia where suitable Unicode alternatives are not accepted by the language, and where I feel that the ASCII-art confections currently used can be gently enhanced by the judicious use of alternate glyphs. There are also a few places where some subtle tweaks can enhance the readability of the language without introducing ambiguity.\n    julialang = true # (!= 0)(x, y) -&gt; (x + y)f(p::Int) = p * p@inbounds if f in (Base.:+, Base.:-) if any(x -&gt; x &lt;: AbstractArray{&lt;:Number}) nouns = Dict( Base.:+ =&gt; &#34;addition&#34;, Base.:- =&gt; &#34;subtraction&#34;, ) endenddf2 = df |&gt; @groupby(_.a) |&gt; @map({a = key(_), b = mean(_.b)}) |&gt; DataFrame # &lt;|\n OpenType fonts also offer you the ability to choose different designs for certain characters. These are stored as a ‘stylistic set’.\n All the options are stored in the font, and are often referred to by their internal four letter code (not the best user-oriented design, really). For example, the contextual alternates listed above are collectively stored in the  calt feature.\n Sometimes, an application will show the options more visually in a Typography panel  [11], usually tucked away somewhere on a Font chooser dialog.\n   All this fancy technology is under the control of the application and the operating system you’re using. Ideally, they will provide an easy way for you to switch the various OpenType features on and off.\n Browser-based editors such as Juno and VS Code support many OpenType features in their editor windows, but not in the terminal/console windows. They provide a settings area where you can type CSS or JSON selectors to control the appearance of features, and you’ll have to know the feature codes. Some features are opt in, others are opt out; this too can vary from application to application.\n Terminal/console applications also vary a lot; on MacOS the  Terminal and  iTerm applications try to offer controls for OpenType features, with varying degrees of success. On Linux, some terminal applications such as  Kitty offer quite good support, but others such as  Alacritty offer little or none, as yet.   [12]\n If the application allows, you should be able to switch the  calt contextual ligatures off, particularly since quite a few people won’t like any of them in their code. For the following listing, I switch the  calt set off using CSS (see  here), and then enable some of the alternative stylistic sets: compare characters such as the  0,  g,  a,  j, and  @ with the previous listing:\n julialang = true # (!= 0)(x, y) -&gt; (x + y)f(p::Int) = p * p@inbounds if f in (Base.:+, Base.:-) if any(x -&gt; x &lt;: AbstractArray{&lt;:Number}) nouns = Dict( Base.:+ =&gt; &#34;addition&#34;, Base.:- =&gt; &#34;subtraction&#34;, ) endenddf2 = df |&gt; @groupby(_.a) |&gt; @map({a = key(_), b = mean(_.b)}) |&gt; DataFrame # &lt;|\n (I originally liked the idea of a more circular  @ sign, but in practice it doesn’t work at small point sizes, as the details disappear. But I’ve kept it anyway.)\n  There are a few areas of the Unicode system that have been officially kept empty and are thus available to store characters that are not part of the standard. These are called the  Private Use Areas, and there are three:  \\ue000 to  \\uf8ff,  \\UF0000 to  \\UFFFFD, and  U100000 to  U+10FFFD.\n Each typeface can do its own thing in these areas. In JuliaMono, for example, if you look around  \\ue800 you’ll find a few familiar shapes:\n  The obvious drawback to using characters in a Private Use Area is that you have to have installed the font wherever you want to see them rendered correctly, unless they’ve been converted to outlines or bitmaps. If the font isn’t installed (eg on github), you have no idea what glyph - if any - will be displayed.\n You can define these to be available at the Julia REPL. For example, say you want the Julia circles to be available in the terminal when you type  \\julialogo  in a Julia session with the JuliaMono font active. Run this:\n    It’s usually possible to type Unicode values directly into text. This is a useful skill to have when you’re not using the Julia REPL... On MacOS you hold the Option (⌥) key down while typing the four hex digits (make sure you’re using the Unicode Hex Input keyboard). On Windows I think you type the four hex digits followed by  ALT then  X. On Linux it might be  ctrl- shift- u followed by the hex digits.\n       To install and activate a font, launch Font Book from your Applications folder, and drag the font files into the middle pane labelled Font. If you&#39;re using a different font manager, you already know what to do. :)\n     To install and activate a font on Windows, go to Computer |&gt; Local Disk (C:) |&gt; Windows |&gt; Fonts. Locate the expanded .zip file folder, and drag the font files from there into the Fonts folder.\n        and copy the files there. You might want to (or have to) regenerate the font cache:\n      The typeface was introduced at the 2020 Julia Programming Language conference, JuliaCon, in Lisbon, Portugal, and it was (going to be) my contribution to the festivities. It was an experiment to see whether a font could be designed with a specific programming language in mind.\n  it has all the glyphs used in the Unicode Input chapter of the Julia documentation (except for the emojis)\n  the font contains special features such as contextual alternates, stylistic sets, and “ligatures” to complement Julia syntax\n  You can visit  this mirror of the Julia blog. It hasn’t been updated for a while (it was useful during the development of  Franklin.jl), but all the code examples use JuliaMono.\n You can browse through  this local copy of an old Julia manual. The default Roboto-Mono font has been replaced with JuliaMono-Regular.\n   That’s not a question! But I know what you mean. Choice of work environment (editor, font, colour scheme, background music, preferred beverage, etc.) is very much a personal thing, and over the hours, days, and weeks that you work with your particular setup, you’ll grow accustomed to it, and unfamiliar work environments will look unappealing or even ugly. You’d probably need to try any alternatives for a while before you get more accustomed to them. Fortunately, you don’t have to use  Comic Code, the  Kakoune editor, the music of  Autechre,  Durian tea, or anything else that’s new and unfamiliar; just stick to your current favourites!\n  Find the relevant CSS file, and add a link to the WOFF2 stored on the server. For example:\n  This accesses the current version the Regular font using the jsDelivr CDN (Content Delivery Network).\n You may prefer to serve the WOFF/2 fonts from your own server. One problem you might encounter is related to  Cross-origin resource sharing, which on some browsers prevents one web page from downloading fonts from another.\n   In VS-Code you’ll find the font settings somewhere in the labyrinthine (but thankfully searchable) Settings department.\n  To control the display of contextual and stylistic alternates, click on the Edit Settings in JSON, and look for  editor.fontLigatures:\n  This uses the feature codes ( listed here). These should all be switched on or off in a single line.\n   Or if you just don’t like the contextual alternates, prefer the slashed zero, a simpler g, and a lighter asterisk, use this:\n                 It’s a good question. Some browsers these days are reluctant to give even you access to things on your own local disk, “for security reasons”. But a local copy of the font may be available and accessible on your particular set-up.\n If not, you could try using web fonts, as above. For example, if there’s a Jupyter CSS file here:\n   @font-face {\tfont-family: JuliaMono-Regular;\tsrc: url(&#34;https://cdn.jsdelivr.net/gh/cormullion/juliamono/webfonts/JuliaMono-Regular.woff2&#34;);}.rendered_html table{ font-size: 16px !important;}div.input_area { background: #def !important; font-size: 16px !important;}.CodeMirror { font-size: 16px !important; font-family: &#34;JuliaMono-Regular&#34; !important; font-feature-settings: &#34;zero&#34;, &#34;ss01&#34;; font-variant-ligatures: contextual;}\n    Another great question. Are you sure you want a monospaced font on your plot? If you do, it should be easy enough to ask for the font when you plot. But it’s never as simple as you want it to be, as is usual in the world of fonts.\n  some backends do their own thing with fonts. For example, I couldn’t persuade the GR backend to use JuliaMono at all.\n Here’s some code that uses JuliaMono for a plot. The plot shows the frequency of occurrence of every Unicode character used in the Julia git repository, and uses the characters as plot markers. I went through every text file and totalled all the characters - there are 956044 letter “e”s, and so on. I’m using  pyplot(); the  freqs DataFrame holds the characters and the counts. I’ve created a few font objects using  Plots.font(), which makes it easier to use different text styles in the  plot() function. I haven’t yet worked out how to use the different weights of a font family.\n using Plots, Plots.PlotMeasurespyplot()theme(:dark)juliamonofont8 = Plots.font(family=&#34;JuliaMono&#34;, 8, halign=:center, colorant&#34;white&#34;)juliamonofont12 = Plots.font(family=&#34;JuliaMono&#34;, 12, halign=:center, colorant&#34;white&#34;)juliamonofont80 = Plots.font(family=&#34;JuliaMono&#34;, 80, halign=:center, colorant&#34;grey30&#34;)annotation = &#34;counting character frequencies\\nin Julia source files &#34;p = plot(1:100, freqs[1:100, 2], fontfamily = &#34;JuliaMono&#34;, margin = 20mm, yaxis = :log10, annotation = [ (50, 1000, Plots.text(annotation, juliamonofont12)), (80, 1_000_000, Plots.text(&#34;&#34;, juliamonofont80)) ], linewidth = 0.25, series_annotations = Plots.text.(freqs[1:100, 1], Ref(juliamonofont8)), xlabel = &#34;← more frequent | less frequent → &#34;, ylabel = &#34;occurrences (log scale) &#34;, labelfontsize = 6, titlefontsize = 14, formatter = :plain, size = (800, 500),\ttitle = &#34;Top 100 characters\\nin the Julia github repo &#34;, legend = false, )display(p)\n  The top 9 characters - “etanirsol” - are a good match for the typical English frequency count e.g. “etarionsh”. It&#39;s to be expected that parentheses make a very good showing, here.\n Although over 3600 unique characters occur in the Julia documentation, about 3000 of them appear just once. All of them, except the emojis which aren’t in JuliaMono, could be plotted, but the long tail isn’t very interesting visually.\n For plotting emoji characters, you’ll have to dive into the internals of the plots system...\n Notice that the y-axis labels are in DejaVu Sans, provided with matplotlib. That’s because the  :log10 scaling code does its own \\( \\LaTeX \\)-y business, ignoring the current font. However, at least I was able to insert the Julia logo successfully, since it’s part of the JuliaMono font.\n  In a \\( \\LaTeX \\) document, you should be able to define and use local fonts.\n Robert Moss put together an excellent package to help negotiate the various font issues that you might encounter when using Unicode and \\( \\LaTeX \\):\n         It depends if you mean the web fonts or the ‘desktop’ fonts. Web fonts come in two flavours,  .WOFF and  .WOFF2, where the  2 indicates a more recent and slightly more compact format.  JuliaMono-Regular.woff is 674KB,  JuliaMono-Regular.woff2 is 619KB - the size of a PNG image, perhaps.\n  For comparison, the Themes folder of  .CSS files for the Julia manual (and for every manual built with Documenter.jl since v0.21) is about 700KB. So in that light the WOFF2 fonts aren’t that bad. Of course, the two Google fonts downloaded by every Julia document (Lato and Roboto) are tiny, at 14KB and 11KB, with 221 glyphs in each.\n So, if you’re building a website, or designing for mobile applications, the size of the WOFF2 file(s) will be an important factor to weigh against the advantages of having predictable character sets. Note that you can specify font subsets in the CSS using the  unicode-range feature, which defines a restricted set of characters which you know are going to be used, so that users don’t download any that they won’t need.\n You could consider using the ‘-Latin’ variants to obviate the initial loading time.\n  You’re right, of course, there are many coding fonts, all perfectly adequate for the task of programming in Julia and most other languages. Comparing two different fonts is a matter of how important small similarities and differences are. Perhaps with one font you’ll see the occasional empty box or odd replacement rather than the character you were hoping for. Or perhaps sometimes you won’t like a particular glyph.\n More likely, though, the overall ‘feel’ of a new and unfamiliar font - too narrow, too wide, too dense, too light, too quirky, too dull, too consistent, too variable - is a matter of personal taste, immune to objective measurement. The design goals of JuliaMono - readable, easy to use, unquirky, simple - mean that the shapes aren’t compressed or condensed. It’s not fashionably thin. It might feel quite “airy” because of the generously-spac\n......", "posttime": "2020-10-18 22:29:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字体,julia,科学,monospaced", "title": "JuliaMono-一种用于科学和技术计算的等宽字体", "title_en": "JuliaMono – a monospaced font for scientific and technical computing", "transed": 1, "url": "https://cormullion.github.io/pages/2020-07-26-JuliaMono/", "via": "", "real_tags": ["字体", "julia", "科学"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029600, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您需要用于RT-11的程序TETRIS.SAV。您可以在这里找到它：在PDP11上，启动KERMIT.SAV并在他的提示下写下：在PC端：检查http://pdp-11.ru/mybk/hobot/ukdwk_archive/dwkwebcomplekt/rt11_symbol_games/与您的USB/串行转换器相关的内容！通常是/dev/ttyUSB0，但也可以是/dev/ttyUSB1或其他任何值。假设/dev/ttyUSB0是Coorect，您只需启动Kermit，并在他的提示下编写：之后，您可以在PC上使用get和send命令来传输文件。", "note_en": "You need TETRIS.SAV, the program for RT-11. You can found it here:  http://pdp-11.ru/mybk/hobot/ukdwk_archive/dwkwebcomplekt/rt11_symbol_games/    On PDP11, you launch KERMIT.SAV    and write at his prompt:    On PC side:    check what TTY is related to your USB/Serial converter! Normally is /dev/ttyUSB0 but can also be /dev/ttyUSB1 or whatever. Assuming /dev/ttyUSB0 is coorect, you just have to launch kermit, and write at his prompt:    After that, you can use GET and SEND commands on the PC to transfer files.", "posttime": "2020-10-18 22:29:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,苏联,soviet,dev", "title": "原版苏联俄罗斯方块关于大铁如何做(2017)", "title_en": "Original Soviet Tetris on Big Iron How To (2017)", "transed": 1, "url": "https://lab.dyne.org/OriginalTetrisHardwareHowto", "via": "", "real_tags": ["俄罗斯", "苏联", "soviet", "dev"]}, {"category": "", "categoryclass": "", "imagename": "a2d57f08193f59cde7cccbd8862bd6b7.jpg", "infoid": 1029599, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周六晚上，匿名留言板4Chan上用户的声明在网上疯传，人们表示，他们发现了一种在华盛顿在线取消选票的方法-而且俄勒冈州选民的登记可以更改，只需使用选民的姓名和出生日期。\n这些指控是，他们发现了一个漏洞，可能会为大规模系统性选民欺诈让路。\n据称，他们的利用改变了军队、海外或残疾人选民的登记。这些说法迅速在社交媒体上疯传-但在Twitter和Facebook上流传的一些(或全部)说法可能是误导性的或虚假的。\n似乎该网站将允许人们创建一张选票，只使用他们的名字和出生日期，但它必须打印，签名和返回。此外，它创建的表格，至少在俄勒冈州，需要有效的身份证号码或另一种被接受的身份证明形式的副本。\n更新华盛顿地址需要州驾照号码或州身份证。Https://t.co/8DTLONpEYP pic.twitter.com/PvGN8pZsie。\n“波特兰论坛报”记者赞恩·斯帕林在推特上写道：“‘标记我的选票’按钮与实际投票不同。它创建了一个表格，缺席选民必须向选举办公室提交。“。他补充说，“简单地点击这些按钮并不能产生投票。表格必须通过传真或电子邮件提交，除非您获得选举官员的缺席投票地位，否则表格不起作用。“。\n表格必须通过传真或电子邮件提交，除非选举官员授予您缺席投票地位，否则表格不起作用。\n俄勒冈州的投票规则确实需要有效的州身份证号码或您的社会保障号码的最后四位数字才能返回缺席选票。\n然而，社交媒体上挖掘所谓漏洞的人也声称，通过启动一个人在华盛顿的在线注册程序，它取消了该人已经投出的任何选票。\n不仅如此，如果继续走得足够远，你就会在没有任何签名的情况下使选票无效。Pic.twitter.com/PSQN6HdGh9。\nGateway专家无法独立核实这些说法，因为这将是选民欺诈。我们已经联系俄勒冈州选举办公室了解更多信息，如果提供回应，我们将更新这篇报道。\n显然，如果有人真的能取消已经寄出的选票，4chan用户可能暴露的漏洞带来的选民欺诈的可能性是令人瞠目结舌的巨大的。", "note_en": "Claims from users on the anonymous messageboard 4Chan went viral on Saturday evening, as people said they discovered a way that ballots can be cancelled online in Washington — and that an Oregon voter’s registration can be changed, using just the voter’s name and date of birth.\n  The claims were that they uncovered a vulnerability that could make way for large scale systemic voter fraud.\n Their exploit allegedly worked to change registration for voters who are in the military, overseas or disabled. The claims rapidly went viral across social media — but some (or all) of the assertions making their way around Twitter and Facebook may be misleading or false.\n       It seems as though the website will allow people to create a ballot for someone else, using just their name and date of birth, but it must be printed, signed and returned. Additionally, the form that it creates, at least in Oregon, requires a valid ID number or copy of another accepted form of identification.\n  Updating a Washington address requires a state driver license number or state ID card.  https://t.co/8DTLONpEYP  pic.twitter.com/PvGN8pZsie\n   Portland Tribune reporter Zane Sparling tweeted that “the ‘mark my ballot’ button is NOT the same as actually voting. It creates a form that absentee voters must submit to the elections office.” He added, “simply clicking these buttons does not create a vote. The form must be submitted by fax or email, and the form does not work unless you have been granted absentee ballot status by an elections official.”\n The form must be submitted by fax or email, and the form does not work unless you have been granted absentee ballot status by an elections official.\n   Oregon’s voting rules do require a valid state ID number or the last four digits of your social security number in order to return an absentee ballot.\n However, people on social media who were digging into the alleged vulnerability also claimed that by starting the process of changing a person’s registration online in Washington,   it cancels any ballot that the person has already cast.\n  Not only that, but by continuing far enough you invalidate the ballot without any signature.  pic.twitter.com/PSQN6HdGh9\n   The Gateway Pundit could not independently verify the claims, as that would be voter fraud. We have reached out to the Oregon State Elections Office for more information and will update this story if a response is provided.\n Obviously, if someone can in fact cancel out ballots that have already been sent in, the potential for voter fraud with the vulnerability 4chan users may have exposed is jaw-droppingly massive.", "posttime": "2020-10-18 22:09:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "users,选民", "title": "4chan用户声称已经找到了在俄勒冈州和华盛顿州在线轻松更改选民登记和取消投票的方法", "title_en": "4Chan Users Claim to Have Found Way to Easily Change People's Voter Registration and Cancel Ballots Online in Oregon and Washington", "transed": 1, "url": "https://www.thegatewaypundit.com/2020/10/breaking-4chan-users-claim-found-way-easily-change-peoples-votes-online-oregon-washington/", "via": "", "real_tags": ["users", "选民"]}, {"category": "", "categoryclass": "", "imagename": "d8dd10f4b7f7202d5f371ebffabc4c0b.jpg", "infoid": 1029598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看斯蒂夫·库里给比尔·盖茨的求职面试。\nNBA球星斯蒂夫·库里刚刚推出了一系列新的采访节目，他与比尔·盖茨的谈话一开始就像是在申请微软的职位一样，问了他一些问题。", "note_en": "Watch Steph Curry give Bill Gates a job interview\n NBA star Steph Curry, who just launched a new interview series, began his conversation with Bill Gates by asking him questions as if he were applying for a position at Microsoft.", "posttime": "2020-10-18 21:59:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,面试,微软,求职,gates", "title": "比尔·盖茨向微软“初级工程师”求职面试提问", "title_en": "Bill Gates Asked Microsoft's 'Junior Engineer' Job Interview Question", "transed": 1, "url": "https://www.cnn.com/videos/business/2020/10/15/steph-curry-bill-gates-interview-orig-jk.cnn/video/playlists/stories-worth-watching/", "via": "", "real_tags": ["microsoft", "面试", "微软", "求职", "gates"]}, {"category": "", "categoryclass": "", "imagename": "8d1a9939e1fe0351d11c27afd2f7d08f.jpeg", "infoid": 1029596, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "清理海洋是一项巨大的任务，特别是对于总部设在荷兰以外的一家非营利性组织来说，但有微软站在你这边是一个很好的奖励。\nBoyan Slat在2013年发起了海洋清理非营利组织，目标是清理大太平洋垃圾带。从那时起，该项目还实现了通过清理携带许多污染物的河流来防止新的废物进入海洋的目标。\n2018年，海洋清理组织参加了微软一年一度的黑客马拉松，志愿者们在这次活动中一起拍摄月球，试图提出创新的解决方案。由此产生的机器学习模型帮助海洋清理组织追踪塑料和其他废物，并告知该非营利性组织如何以及在哪里部署其巨大的自主塑料收集器。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "Cleaning up the oceans is a huge undertaking, especially for a single nonprofit based out of the Netherlands, but having  Microsoft on your side is a nice bonus.\n Boyan Slat launched  The Ocean Cleanup nonprofit in 2013, with the goal of cleaning up the  Great Pacific Garbage Patch. Since then, the project has also embraced the goal of preventing new waste from entering the ocean by cleaning up rivers the carry many of the pollutants.\n In 2018, The Ocean Cleanup was a participant in Microsoft&#39;s annual hackathon, where volunteers work together on moonshots to try to come up with innovative solutions. The resulting machine learning models have helped The Ocean Cleanup track plastic and other waste, and informed how and where the nonprofit deploys its giant autonomous plastic collectors.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-10-18 21:26:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,合作,teamed,组织", "title": "微软与一家非营利性组织合作，使用自动“拦截艇”清理海洋，并正在利用机器学习帮助其识别垃圾", "title_en": "Microsoft teamed up with a nonprofit using autonomous 'interceptor' boats to clean up the ocean and is helping it identify trash with machine learning", "transed": 1, "url": "https://www.businessinsider.com/microsoft-machine-learning-for-the-ocean-cleanup-project-2020-10?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+typepad%2Falleyinsider%2Fsilicon_alley_insider+%28Silicon+Alley+Insider%29", "via": "", "real_tags": ["microsoft", "微软", "合作", "teamed", "组织"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029594, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Google Chrome&39；s；Cookie和站点数据设置中(通过首选项菜单项或直接使用地址栏中的Chrome：//设置/Cookies访问)，您可以在退出Chrome&34；时启用清除Cookie和站点数据设置。然而，我发现Chrome不包括谷歌自己的网站，比如搜索和YouTube。\n我的设置只允许Twitter保留站点数据，你可以看到，在退出并重新启动后，所有的苹果数据都被删除了。\n在我退出并重新启动后，cookie被删除，但数据库存储、本地存储和服务人员仍然在那里！(你知道有这么多不同种类的网络存储吗？)。\n当您退出apple.com的Chrome设置(但不完全是youtube.com的设置)时，Chrome会尊重清除Cookie和站点数据的设置。为了防止YouTube保存数据，您必须将其添加到永远不能使用Cookie的站点。(请注意，在关闭窗口时将YouTube添加到始终清除cookie是不够的。)。\n退出并重新启动后，cookie将被删除，但本地存储仍在！\n同样，为了防止这种情况发生，您必须将google.com添加到永远不能使用Cookie的站点。\n也许这只是Google Chrome的一个漏洞，不是故意的行为，但问题是为什么它只影响谷歌网站，而不影响非谷歌网站。我在MacOS上使用最新的Google Chrome版本86.0.4240.75进行了测试，但在之前的Chrome版本中也出现了这种情况。我不知道是什么时候开始的。\n(有些人读了这篇文章后会说，使用Safari而不是Chrome！#34；但重要的是要注意到，Safari甚至没有在退出时清除站点数据的功能，所以Safari实际上更糟糕。在这方面，Safari落后了很多年。Firefox和所有基于Chromium的浏览器都已经有了退出时清除站点数据的功能。)", "note_en": "In Google Chrome&#39;s &#34;Cookies and site data&#34; settings, accessible via the Preferences menu item or directly with  chrome://settings/cookies in the address bar, you can enable the setting &#34;Clear cookies and site data when you quit Chrome&#34;. However, I&#39;ve discovered that Chrome exempts Google&#39;s own sites, such as Search and YouTube, from this setting.\n    My settings allow only Twitter to keep site data, and you can see that all of the Apple data was deleted after quit and relaunch.\n    After I quit and relaunch, the cookies are deleted, but the database storage, local storage, and service workers are still there! (Did you know there are so many different kinds of web storage?)\n  Chrome respects the &#34;Clear cookies and site data when you quit Chrome&#34; setting for  apple.com but not entirely for  youtube.com. In order to prevent YouTube from saving data, you have to add it to &#34;Sites that can never use cookies&#34;. (Note that adding YouTube to &#34;Always clear cookies when windows are closed&#34; is not sufficient.)\n    After quit and relaunch, the cookies are deleted, but the local storage is still there!\n  Again, to prevent this from happening, you have to add  google.com to &#34;Sites that can never use cookies&#34;.\n  Perhaps this is just a Google Chrome bug, not intentional behavior, but the question is why it only affects Google sites, not non-Google sites. I&#39;ve tested using the latest Google Chrome version 86.0.4240.75 for macOS, but this behavior was also happening in the previous version of Chrome. I don&#39;t know when it started.\n (Some people are going to read this article and say &#34;Use Safari instead of Chrome!&#34; But it&#39;s important to note that Safari doesn&#39;t even have the feature to clear site data on quit, so Safari is actually worse. In this respect, Safari is years behind. Firefox and all of the Chromium-based browsers already have the clear site data on quit feature.)", "posttime": "2020-10-18 21:05:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,google,谷歌,网站,exempts", "title": "Chrome免除谷歌网站的用户网站数据设置", "title_en": "Chrome exempts Google sites from user site data settings", "transed": 1, "url": "https://lapcatsoftware.com/articles/chrome-google.html", "via": "", "real_tags": ["chrome", "google", "谷歌", "网站", "exempts"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029593, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在此之前，我们采用了一个简单的视频管道，并在不牺牲Python运行时的灵活性的情况下使其尽可能快。你能走到9FPS到650FPS的程度是令人惊讶的，但我们没有达到完全的硬件利用率，流水线也没有线性扩展到单个GPU之外。有证据(使用gil_load衡量)表明，我们受到了一个基本的Python限制，即多线程争夺全局解释器锁(GIL)。\n在本文中，我们将进一步提高相同SSD300模型的性能，将Python抛诸脑后，向真正的生产部署技术迈进：\n火炬脚本。我们不会直接在Pytorch运行时中运行，而是使用TorchScript跟踪将我们的模型导出到一种可以使用libtorch C++运行时可移植执行的形式。\nTensorRT.。NVIDIA的这个工具包包括一个“深度学习推理优化器”--一个用于优化基于CUDA的计算图形的编译器。我们将利用这一点来挤出推理效率的每一滴。\nDeepStream公司。虽然GStreamer为我们提供了一个构建媒体管道的广泛元素库，但DeepStream用一组专门用于机器学习的GPU加速元素扩展了这个库。\n本文不会是带有代码示例的分步教程，但将展示将这些技术组合在一起时的可能性。关联的存储库位于以下位置：github.com/pbridger/deepstream-video-pipeline.。\nTorchScript和TensorRT都可以生成我们模型的部署就绪形式，那么为什么我们需要这两种形式呢？这些伟大的工具最终可能会成为竞争对手，但在2020年，它们是互补的-它们都有各自的弱点，可以由对方来弥补。\n火炬脚本。只需几行torch.jit代码，我们就可以从基本上任何Pytorch模型生成部署就绪的资产，该模型可以在libtorch运行的任何地方运行。它本身并不快(它提交的内核序列大致相同)，但是libtorch运行时在高并发的情况下会执行得更好。但是，如果不小心，TorchScript输出可能会带来性能和可移植性方面的意外(我将在后面的文章中介绍其中的一些内容)。\nTensorRT.。一个无与伦比的模型编译器，适用于NVIDIA硬件，但对于基于Pytorch或ONNX的模型，它支持不完整，可移植性差。有一个插件系统可以添加任意层和后处理，但没有专门部署团队的团队无法完成这项低级工作。TensorRT也不支持交叉编译，因此必须在目标硬件上直接优化模型-这对于嵌入式平台或高度多样化的计算生态系统不是很好。\n让我们从本系列上一篇文章的基线开始-目标检测分6步从9FPS到650FPS。\n在我之前的帖子中，GPU阶段的后处理在逻辑上最接近我们的第一个DeepStream流水线。在基于Python的优化之旅中，这是一个相当缓慢的早期阶段，但是DeepStream在批处理和内存传输方面的限制使其成为最佳比较。\n在我们建立并运行了基本的DeepStream管道之后，我们将从经验上理解并消除我们看到的限制。\n我们在DeepStream管道中同时使用TorchScript和TensorRT的方法是构建一个包含两个连续组件的混合模型-TensorRT前端将结果传递给完成计算的TorchScript后端。\n我们的混合管道最终将使用DeepStream的nvinfer元素直接在媒体管道中为TensorRT编译形式的SSD300模型提供服务。由于TensorRT无法编译整个模型(由于不支持的ONNX操作)，我们将把其余的操作作为TorchScript模块运行(通过parse-bbox-func-name挂钩)。\n但是，第一条管道将是最简单的，同时仍然遵循混合模式。TensorRT模型不进行任何处理，只是将帧传递给TorchScript模型，后者执行所有的预处理、推断和后处理。0%TensorRT，100%TorchScript。\n该流水线以110FPS的速度运行，没有跟踪开销。但是，这个TorchScript模型已经转换为FP16精度，因此直接与基于Python的管道进行比较有点误导。\n让我们使用NVIDIA的NSight Systems深入跟踪以了解执行模式。我已经放大到两个16帧批次的处理过程：\n查看GstNvInfer行上的红色NVTX范围，我们可以看到正在处理16帧批次的重叠范围。然而，从16个使用率峰值来看，GPU上的处理模式相当清晰-它是逐帧处理的。我们还看到设备和主机之间持续不断的内存传输。\n深入查看只有两帧处理，模式就更清晰了：\nNvinfer将成批的帧发送到已配置的模型引擎(我们的空TensorRT组件)-很好。\n然后，nvinfer将模型输出逐帧发送到后处理挂钩(我们的TorchScript组件)。\n由于我们已经将整个模型放到了TorchScript后处理钩子中，现在我们正在逐帧处理，没有批处理，这导致GPU利用率非常低。(这就是为什么我们要与没有批处理的Python管道进行比较的原因)。\n我们使用DeepStream与设计相反，但是要构建一个真正混合的TensorRT和TorchScript管道，我们需要批处理后处理。\nNvinfer的设计假设模型输出将逐帧进行后处理。这使得编写后处理代码稍微容易一些，但是默认情况下效率很低。预处理、推理和后处理逻辑应始终假定存在批处理维度。\n上面的NSight Systems视图还显示了设备到主机，然后是主机到设备的毫无意义的传输序列。紫色设备到主机内存的传输是由于nvinfer将张量发送到系统内存，为后处理代码使用它做好了准备。绿色的主机到设备的传输是我将这个内存放回它所属的GPU上。\n这是早期机器学习方法的遗产。现代深度学习管道将数据端到端地保存在GPU上，包括数据增强和后处理。有关这方面的示例，请参阅NVIDIA的DALI库。\n谢天谢地，NVIDIA为nvinfer管道元素提供了源代码。我做了两项更改，以更好地支持我们在后处理挂钩中进行重要工作的方法，并修复上述限制：\n现在，nvinfer模型引擎输出以单批形式发送到后处理挂钩。\n这些nvinfer更改没有发布，也不会出现在配套的存储库(github.com/pbridger/deepstream-video-pipeline))中，因为它们明显是nvinfer的派生版本，我不确定是否会获得许可。NVIDIA的朋友们，请随时联系：paul@paulbridge ger.com。\n由于DeepStream已被黑客攻击，而且没有任何模型更改，在没有跟踪开销的情况下进行测量时，此管道现在达到了350FPS。这比常规DeepStream的110 FPS要高。我想我们应该得到一张图表：\nPython管道中的并发1x2080Ti阶段现在在FPS和应用的优化方面是最接近的比较。这两条管道都具有批处理推理、在GPU端到端解码和处理视频帧以及批处理级别的并发性(请注意下面重叠的NVTX范围)。Python管道中的另一个并发级别是多个重叠的CUDA流。\n我们现在有很好的GPU利用率和非常少的不必要的内存传输，因此前进的道路是优化TorchScript模型。到目前为止，TensorRT组件完全是直通的，从预处理、推理到后处理的一切都在TorchScript中。\n现在是开始使用TensorRT优化器的时候了，准备好迎接一些刺激吧。\n根据NVIDIA的说法，TensorRT“极大地加速了深度学习推理性能”，那么为什么不用TensorRT编译100%的模型呢？\nPytorch导出到TensorRT由两个步骤组成，这两个步骤都提供了不完全支持的机会：\n如果您尝试为整个模型(包括后处理的SSD300)创建优化的TensorRT引擎，您将遇到的第一个问题是在后处理期间将REPEAT_INTERLEVE操作导出到ONNX。Pytorch 1.6不支持此导出，我不知道为什么。\n就像在整合编译器之前编写C++一样，通常可以重写模型代码来解决不支持的操作。请参见ds_ssd300_5.py以获取替换了REPEAT_INTERLEVE的示例，现在将导出到ONNX。但是，现在TensorRT编译因另一个不受支持的操作而失败-没有为op：ScatterND注册导入器。\n如果您有一个专门的部署团队--只需编写自定义插件和CUDA内核--处理所有这些问题是可以的，但是大多数团队没有这些资源或时间来进行投资。\n这就是混合方法工作得如此好的原因--我们可以从TensorRT优化中获得大部分模型的好处，并用TorchScript覆盖其余部分。\n从350FPS提升到920FPS是一个巨大的飞跃，我们仍然只使用一个2080Ti的GPU。让我们检查一下夜视系统，了解这是如何实现的：\n批次N的TensorRT推断现在与批次N-1的TorchScript后处理交错/并发，有助于填补利用率缺口。\nTensorRT预处理和推理比TorchScript版本快得多。大约43ms的TorchScript预处理和推理变成了大约16ms的等效TensorRT处理。\n这个Night Systems跟踪输出现在看起来有点像我们的目标：\n简而言之，是的，我们确实需要入侵DeepStream以获得最佳吞吐量。除非你喜欢360FPS的声音，当你可以达到920FPS的时候。这是一种倒退，所以我不会将其添加到我们的图表中。\n以下是我们使用TorchScript最终处理运行TensorRT优化模型时的跟踪：\n将我们的基于Python的流水线可用的硬件增加一倍，将吞吐量从350FPS提高到650FPS，大约增加了86%。这是一个单独的Python进程驱动两个非常强大的GPU，所以这是一个很好的结果。考虑到测量到的GIL争用在45%左右，进一步扩展将变得效率较低，可能需要多进程方法。\n我们的DeepStream管道是从Python启动的，但是除了每秒一次的空消息循环之外没有回调，所以没有机会争用GIL。在没有跟踪开销的情况下测量，这些DeepStream管道显示出完美的100%可伸缩性(至少从1个设备到2个设备)，最高可达1840 FPS。这就像圣诞节的早晨。\n顺便说一句，在启用NSight Systems跟踪的情况下，前面的大多数阶段的吞吐量下降了大约15%，而这条管道的吞吐量下降了40%。如果下载并分析链接的跟踪文件，您将看到这种差异。\n我们有一条能够实现1840FPS有效目标检测吞吐量的流水线，这是非常惊人的。这应该会令人信服地证明这些技术协同工作的有效性。\n尽管TensorRT优化带来了巨大的收益，DeepStream的高效可伸缩性也带来了巨大的收益，但TorchScript是这个故事中的默默无闻的英雄。轻松导出任何Pytorch模型而无需担心缺少层或操作的能力是巨大的。如果没有TorchScript和libtorch，我仍然会编写TensorRT插件。\n在以后的文章中，我将更深入地研究TorchScript导出过程，并解释一些可移植性和性能陷阱。\n上面使用的GStreamer/DeepStream管道没有反映100%的实际使用情况。如果您查看流水线图(例如，ds_3_2gpu_batch16_device.Pipeline.dot.png)，您将看到单个文件被多次读取并通过管道传输到nvstream mux组件。这就是将多个并发媒体流处理到单个推理引擎中的方式，但我这样做的真正原因是为了解决与批处理有关的nvstream mux的限制。有关详细信息，请阅读链接的问题，但是可以公平地说，nvstream mux不是用于在处理少量输入流时高效地组装大小的批。\n同样如上所述，我的“被黑客攻击的DeepStream”代码还没有公开提供。我会努力把它整理好，如果我确定许可情况，我会让它变得可用。\n最后，相关存储库中的代码并不是经过打磨的教程代码，它是粗制滥造的研究代码，所以买者自负。", "note_en": "Previously, we took a  simple video pipeline and made it as fast as we could without sacrificing the flexibility of the Python runtime. It’s amazing how far you can go —  9 FPS to 650 FPS — but we did not reach full hardware utilization and the pipeline did not scale linearly beyond a single GPU. There is evidence (measured using  gil_load) that we were throttled by a fundamental Python limitation with multiple threads fighting over the  Global Interpreter Lock (GIL).\n In this article we’ll take performance of the same  SSD300 model even further, leaving Python behind and moving towards true production deployment technologies:\n TorchScript. Instead of running directly in the Pytorch runtime, we’ll export our model using TorchScript tracing into a form that can be executed portably using the  libtorch C++ runtime.\n TensorRT. This toolset from Nvidia includes a “deep learning inference optimizer” — a compiler for optimizing CUDA-based computational graphs. We’ll use this to squeeze out every drop of inference efficiency.\n DeepStream. While  Gstreamer gives us an extensive library of elements to build media pipelines with, DeepStream expands this library with a set of GPU-accelerated elements specialized for machine learning.\n   This article will not be a step-by-step tutorial with code examples, but will show what is possible when these technologies are combined. The associated repository is here:  github.com/pbridger/deepstream-video-pipeline.\n  Both TorchScript and TensorRT can produce a deployment-ready form of our model, so why do we need both? These great tools may eventually be competitors but in 2020 they are complementary — they each have weaknesses that are compensated for by the other.\n TorchScript. With a few lines of  torch.jit code we can generate a deployment-ready asset from essentially any Pytorch model that will run anywhere libtorch runs. It’s not inherently faster (it is submitting approximately the same sequence of kernels) but the libtorch runtime will perform better under high concurrency. However, without care TorchScript output may have performance and portability surprises (I’ll cover some of these in a later article).\n TensorRT. An unparalleled model compiler for Nvidia hardware, but for Pytorch or  ONNX-based models it has incomplete support and suffers from poor portability. There is a plugin system to add arbitrary layers and postprocessing, but this low-level work is out of reach for groups without specialized deployment teams. TensorRT also doesn’t support cross-compilation so models must be optimized directly on the target hardware — not great for embedded platforms or highly diverse compute ecosystems.\n Let’s begin with a baseline from the previous post in this series —  Object Detection from 9 FPS to 650 FPS in 6 Steps.\n   The  Postprocessing on GPU stage from my previous post is logically closest to our first DeepStream pipeline. This was a fairly slow, early stage in the Python-based optimization journey but limitations in DeepStream around batching and memory transfer make this the best comparison.\n   After we get a basic DeepStream pipeline up and running we’ll empirically understand and then remove the limitations we see.\n   Our approach to using TorchScript and TensorRT together in a DeepStream pipeline will be to construct a hybrid model with two sequential components — a TensorRT frontend passing results to a TorchScript backend which completes the calculation.\n  Our hybrid pipeline will eventually use the  nvinfer element of DeepStream to serve a TensorRT-compiled form of the SSD300 model directly in the media pipeline. Since TensorRT cannot compile the entire model (due to unsupported  ONNX ops) we’ll run the remaining operations as a TorchScript module (via  the  parse-bbox-func-name hook).\n However, the first pipeline will be the simplest possible while still following the hybrid pattern. The TensorRT model does no processing and simply passes frames to the TorchScript model, which does all preprocessing, inference, and postprocessing. 0% TensorRT, 100% TorchScript.\n This pipeline runs at 110 FPS without tracing overhead. However, this TorchScript model has already been converted to  fp16 precision so a direct comparison to the Python-based pipeline is a bit misleading.\n  Let’s drill into the trace with  Nvidia’s Nsight Systems to understand the patterns of execution. I have zoomed in to the processing for two 16-frame batches:\n    Looking at the red NVTX ranges on the  GstNvInfer line we can see overlapping ranges where batches of 16 frames are being processed. However, the pattern of processing on the GPU is quite clear from the 16 utilisation spikes — it is processing frame-by-frame. We also see constant memory transfers between device and host.\n Drilling in to see just two frames of processing, the pattern is even more clear:\n     nvinfer sends batches of frames to the configured model engine (our empty TensorRT component) — great.\n nvinfer then sends the model output  frame by frame to the postprocessing hook (our TorchScript component).\n Since we have put our entire model into a TorchScript postprocessing hook we are now processing frame by frame with no batching, and this is causing very low GPU utilisation. (This is why we are comparing against a Python pipeline with no batching).\n We are using DeepStream contrary to the design, but to build a truly hybrid TensorRT and TorchScript pipeline we need batched postprocessing.\n The design of  nvinfer assumes model output will be postprocessed frame-by-frame. This makes writing postprocessing code a tiny bit easier but is inefficient by default. Preprocessing, inference and postprocessing logic should always assume a batch dimension is present.\n The Nsight Systems view above also shows a pointless sequence of device-to-host then host-to-device transfers. The purple device-to-host memory transfer is due to  nvinfer sending tensors to system memory, ready for the postprocessing code to use it. The green host-to-device transfers are me putting this memory back on the GPU where it belongs.\n This is a legacy of early machine learning approaches. Modern deep learning pipelines keep data on the GPU end-to-end, including data augmentation and postprocessing. See Nvidia’s  DALI library for an example of this.\n    Thankfully, Nvidia have provided source for the  nvinfer pipeline element. I’ve made two changes to better support our approach of doing significant work in the postprocessing hook and fix the above limitations:\n nvinfer model engine output is now sent in a single batch to the postprocessing hook.\n These  nvinfer changes are unreleased and are not present in the companion repository ( github.com/pbridger/deepstream-video-pipeline) because they are clearly derivative of  nvinfer and I’m unsure of the licensing. Nvidia people, feel free to get in touch:  paul@paulbridger.com.\n With hacked DeepStream and no model changes at all this pipeline now hits 350 FPS when measured with no tracing overhead. This is up from 110 FPS with regular DeepStream. I think we deserve a chart:\n  The  Concurrency 1x2080Ti stage from the Python pipeline is now the closest comparison both in terms of FPS and optimizations applied. Both pipelines have batched inference, video frames decoded and processed on GPU end-to-end, and concurrency at the batch level (note the overlapping NVTX ranges below). One additional level of concurrency in the Python pipeline is multiple overlapping CUDA streams.\n     We now have good GPU utilization and very few needless memory transfers, so the path forward is to optimize the TorchScript model. Until now the TensorRT component has been entirely pass-through and everything from preprocessing, inference and postprocessing has been in TorchScript.\n It’s time to start using the TensorRT optimizer, so get ready for some excitement.\n   According to Nvidia, TensorRT  “dramatically accelerates deep learning inference performance” so why not compile 100% of our model with TensorRT?\n The Pytorch export to TensorRT consists of a couple of steps, and both provide an opportunity for incomplete support:\n  If you try to create an optimized TensorRT engine for this entire model (SSD300 including postprocessing), the first problem you will run into is the export to ONNX of the  repeat_interleave operation during postprocessing. Pytorch 1.6 does not support this export, I don’t know why.\n Just like writing C++ in the days before conforming compilers, it’s often possible to rewrite model code to work around unsupported operations. See  ds_ssd300_5.py for an example that replaces  repeat_interleave and will now export to ONNX. However, now the TensorRT compilation fails with another unsupported operation —  No importer registered for op: ScatterND.\n Dealing with all this is fine if you have a dedicated deployment team — simply write custom plugins and CUDA kernels — but most teams don’t have those resources or time to invest in this.\n This is why the hybrid approach works so well — we can get the benefits of TensorRT optimization for most of our model and cover the rest with TorchScript.\n   920 FPS up from 350 FPS is a huge jump, and we are still only using a single 2080Ti GPU. Let’s check Nsight Systems to understand how this can be possible:\n     TensorRT inference for batch N is now interleaved/concurrent with TorchScript postprocessing for batch N-1, helping to fill in utilization gaps.\n The TensorRT preprocessing and inference are massively faster than the TorchScript version. Around 43ms of TorchScript preprocessing and inference have turned into around 16ms of equivalent TensorRT processing.\n This Nsight Systems trace output now looks a little like what we were aiming for:\n     In short, yes, we did need to hack DeepStream to get the best throughput. Unless you like the sound of 360 FPS when you could be hitting 920 FPS. This is a step backwards so I’m not adding it to our chart.\n Here is the trace when we run the TensorRT-optimized model with the TorchScript final processing:\n        Doubling the hardware available to our Python-based pipeline boosted throughput from 350 FPS to 650 FPS, around an 86% increase. This was a single Python process driving two very powerful GPUs so it’s a great result. Given the measured GIL contention at around 45% scaling further would have become less efficient, perhaps requiring a multi-process approach.\n Our DeepStream pipelines have been launched from Python, but with no callbacks beyond an empty once-per-second message loop so there is no chance of GIL contention. Measured without tracing overhead these DeepStream pipelines show perfect 100% scalability (at least from 1 to 2 devices), topping out at 1840 FPS. It’s like Christmas morning.\n  Incidentally, whereas most of the previous stages suffer from a roughly 15% hit to throughput with Nsight Systems tracing enabled this pipeline takes a 40% drop. You’ll see this difference if you download and analyze the linked trace files.\n  We have a pipeline capable of doing 1840 FPS of useful object detection throughput, and this is phenomenal. This should convincingly demonstrate the effectiveness of these technologies working together.\n Despite the huge gains delivered by TensorRT optimization and the efficient scalability of DeepStream,  TorchScript is the unsung hero of this story. The ability to easily export any Pytorch model without worrying about missing layers or operations is huge. Without TorchScript and  libtorch I would still be writing TensorRT plugins.\n In future articles I’ll delve deeper into the TorchScript export process and explain some of the portability and performance pitfalls.\n  The Gstreamer/DeepStream pipelines used above do not reflect 100% realistic usage. If you review the pipeline diagrams (e.g.  ds_3_2gpu_batch16_device.pipeline.dot.png) you’ll see a single file is being read and piped into the  nvstreammux component many times. This is how you would handle multiple concurrent media streams into a single inference engine, but the real reason I’ve done this is to work around a  limitation of  nvstreammux to do with batching. Read the linked issue for the details, but it is fair to say that  nvstreammux is not intended for assembling efficiently-sized batches when processing a small number of input streams.\n Also as noted above, my “Hacked DeepStream” code is not yet publically available. I’ll work to tidy this up and if I’m sure of the licensing situation I’ll make this available.\n Finally the code in the  associated repository is not polished tutorial code, it is hacky research code so caveat emptor.", "posttime": "2020-10-18 20:23:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "tensorrt,torchscript,模型", "title": "基于TorchScript、TensorRT和DeepStream的1840FPS目标检测", "title_en": "Object Detection at 1840 FPS with TorchScript, TensorRT and DeepStream", "transed": 1, "url": "https://paulbridger.com/posts/video-analytics-deepstream-pipeline/", "via": "", "real_tags": ["tensorrt", "模型"]}, {"category": "", "categoryclass": "", "imagename": "605302bc373811415817f9629f1b37d8.jpg", "infoid": 1029591, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项关于地球上人类健康的大规模新统计，整理和推断了204个国家数百种疾病和伤害的统计数据，大多是好消息。人们更健康，而且他们保持这种状态的时间更长。坏消息是：如果这些人是穷人，有色人种，生活在美国，而且正在流行，那就不是真的。\n数以千计的国际研究人员正在进行的工作，全球疾病负担项目的基础是华盛顿大学-这是健康指标和评估研究所工作的重要部分，你可能还记得今年早些时候它对冠状病毒大流行的极度悲观但高度激励的模型。有了GBD，这种建模经验填补了那些不收集所有相同数据的国家的空白，但总体而言，这项工作吞噬了来自政府和医疗保健组织的各种流行病学和健康结果数字，并按年龄和性别列出了谁患了什么疾病。这是204个国家和地区的286个死因，369种疾病和伤害，以及87个风险因素，这些数字可以追溯到1990年。发表在医学杂志“柳叶刀”(The Lancet)上的最新数据显示，这一趋势持续到2019年。(比尔和梅林达·盖茨基金会是主要的资金来源。)。\n在某种程度上，全球疾病负担报告是对过去的一次爆炸，是对一个现在已经消失的星球的健康状况的审视--是以前最好的，也是以前最糟糕的。慢性病正在破坏现代医学和公共卫生的成果。但在疫情爆发10个月后，英国疾病控制与预防中心的报告是新冠肺炎将利用的漏洞的地图。它也是一个激光指示器，指明了通往更光明时间线的道路。\n总体而言，死亡人数最多的不是新冠肺炎这样的传染病。全球头号杀手是高血压；第二是与烟草使用有关的疾病。事实上，前10名中的所有东西都是同样的人口规模的东西，需要系统性的改变才能解决。那就是空气污染；导致糖尿病、肥胖症和心脏病的营养缺口；以及酗酒。儿童和产妇死亡率仍然潜入全球前十名。\n在过去的十年里，吸烟实际上已经减少了，而“代谢风险”--肥胖、高血糖、高血压、高胆固醇--则出现了相反的趋势。这四个人总共造成了2019年2690万人的死亡，占GBD报告所描述的全球健康损失的近20%。这是生命的损失，但也是生命末期健康年数的损失，这是由死亡调整寿命年(DALY)捕捉的统计数据。自1990年以来，这一数字上升了50%。", "note_en": "A massive new accounting of the health of humans on Earth, collating and inferring stats on hundreds of diseases and injuries across 204 nations, has mostly good news. People are healthier, and they stay that way for longer. The bad news: That’s not true if those people are poor, are people of color, live in the United States, and there’s a pandemic.\n  The ongoing work of thousands of international researchers, the  Global Burden of Disease project is based at the University of Washington—it’s a big part of the work of the Institute for Health Metrics and Evaluation, which you might remember from its  hyper-pessimistic but highly motivating models of the coronavirus pandemic earlier in the year. With GBD, that modeling experience fills in the gaps from countries that don’t gather all the same data, but overall the work slurps in all kinds of epidemiological and health outcome numbers from governments and health care organizations and tabulates who gets what illness by age and sex. That’s 286 causes of death, 369 diseases and injuries, and 87 risk factors in 204 countries and territories, with numbers going back to 1990. The  latest bolus of data, published in the medical journal  The Lancet, brings that up through 2019. (The Bill and Melinda Gates Foundation is the major source of funding.)\n In a way, the Global Disease Burden report is a blast from the past, a look at the health of a planet now gone—the best of Before Times and the worst of Before Times. Chronic diseases were undermining the gains of modern medicine and public health. But 10 months into a pandemic, the GBD report is a map to the vulnerabilities that COVID-19 would exploit. It&#39;s also a laser-pointer showing the way to a brighter timeline.\n Overall, the things that kill the most people aren’t communicable diseases like COVID-19. The number-one killer worldwide is high blood pressure; number two is disease related to tobacco use. In fact, everything on the top-10 list is the same population-scale stuff that takes systemic change to fix. That’s air pollution; nutritional gaps that lead to diabetes, obesity, and heart disease; and alcohol abuse. Childhood and maternal mortality still sneaks into the top 10 worldwide, too.\n Smoking has actually declined over the past decade, while “metabolic risks”—obesity, high blood sugar, high blood pressure, high cholesterol—have gone in the other direction. Together those four were responsible for 26.9 million deaths in 2019 and nearly 20 percent of what the GBD report describes as health loss worldwide. That’s loss of life, but also loss of healthy years at the end of life, a statistic captured by death-adjusted life years, or DALYs. That number has gone up 50 percent since 1990.", "posttime": "2020-10-18 20:02:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,冠状病毒,coronavirus,先天,conditions", "title": "冠状病毒大流行的先天条件", "title_en": "The preexisting conditions of the coronavirus pandemic", "transed": 1, "url": "https://arstechnica.com/science/2020/10/the-preexisting-conditions-of-the-coronavirus-pandemic/", "via": "", "real_tags": ["病毒", "冠状病毒", "先天"]}, {"category": "", "categoryclass": "", "imagename": "7463ef74f56cd67a8cd454bd6d41a478.jpeg", "infoid": 1029590, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "只要电影制作已经存在，就有必要在镜头前建立梦幻世界。最早借鉴自戏剧的技术是：彩绘窗帘和木制二维背景。然后，我们把世界画到玻璃上，把它们拍到胶片上，把真假混为一谈。与此同时，艺术家们想出了如何将之前拍摄的电影投影到演员身后的屏幕上。这些天来，我们颠覆了这个故事，将真正的演员放入只存在于计算机中的数字环境中。但现在，我们正在融合非常古老和非常新的东西：“虚拟”工作室中的数字背景可以结束绿幕电影的枯萎，以及它的无数问题。这就是在英国牛津郡的一家前报社正在进行的实验，第一部“全虚拟”电影刚刚在那里拍摄。\n杰森·金斯利·奥比(Jason Kingsley OBE)是现代历史电视(Modern History TV)的主持人，这是一个YouTube频道，有解释中世纪历史的简短纪录片，他喜欢这个频道。\n但这是他日常工作的一个副业，作为Rebellion Developments的联合创始人兼首席执行官，Sniper Elite背后的英国制片厂。然而，叛逆并不只是制作游戏，它拥有漫画巨头2000AD，也就是法官Dredd和Rogue Trooper背后的名字，以及出版商Abaddon和Solaris。现在，该公司正在建造自己的工作室，以其庞大的IP库为基础创作电视剧和电影。\n珀西瓦尔是一部短片，首先在金斯利前面提到的YouTube频道播出，这标志着Rebellion的电影制作雄心翻开了新的篇章。这段5分钟的短片描绘了金斯利饰演的圆桌上一位战痕累累的骑士，他在森林中濒临死亡。亚瑟王快要死了，(圣杯)不见了。当一些未知的力量介入时，这位名义上的骑士就会四分五裂，鲜血淋漓。突然，时间加快了，帮助他康复，并将他送到一座教堂的诡异废墟，在那里他接受了一个激发新探索的愿景。\nReverlion说，这是世界上第一部“全虚拟”的制作，所有的动作都完全在一圈大平板显示器的光环前进行。这些监视器连接到运行虚幻引擎的PC，在那里生成虚拟环境。从本质上说，过去的彩绘窗帘和哑光画已经被显示游戏引擎镜头的LED电视所取代。\n你可能以前听说过这项技术。第一个高调使用它的例子是迪士尼的“曼达洛人”，它在这些制片厂拍摄了大部分场景，但不是所有的场景。在那个例子中，这个动作是在20英尺高的270度马蹄形LED显示屏上拍摄的。\n长期以来，“星球大战”一直是推动电影制作技术发展的旗手。前传电影拍摄于1997年至2003年之间，在很大程度上依赖于在绿幕上拍摄演员，后来又增加了CGI背景。这个过程，演员站在蓝色或绿色的窗帘前，被称为“色键”或“色键”。在星球大战之后，色键变得无处不在，即使是预算适中的特效电影也是如此。在本世纪中期，几乎完全使用这种技术的电影出现了一股趋势，包括“天空机长”和“明日世界”、“罪恶之城”和“300”。\n如今，绿幕无处不在：例如，来自复仇者联盟(Avengers Assemble)的纽约之战大多是在新墨西哥州的绿幕工作室拍摄的，然后由一支CGI艺术家大军修修补补了几个月。\n虚拟制片厂有可能对电影制作产生重大影响。因为背景和环境已经在照片中可见，所以不需要在之后添加它们。这也让演员们更好地掌握了他们正在做的事情，因为在完全绿色的空白中表演会阻碍表演，这是可以理解的。这也比把你的摄制组送到世界各地的丛林和沙漠拍摄要容易得多，也便宜得多，即使是像曼达洛人这样预算高昂的电视剧也很难负担得起。\n何孙是起义军VFX的头目。他之前曾执导过《狮子王》(2019年)、《玛琳菲森：邪恶情妇》和前述的曼达洛人。他原本计划用租来的LED墙做一个视觉效果实验，但是：“杰森(金斯利)说‘我们来拍电影吧！’”制片厂将只存在三天，但新冠肺炎意味着任何制作都只能使用骨干剧组。在准备时间不到三周的情况下，拍摄作为一种测试，看看虚拟演播室是否能在一些最艰苦的条件下交付。\nEben Bolter BSC是第5大道、iBoy和The Feed背后的摄影师，他被请来拍摄和照亮珀西瓦尔。Bolter解释说，这部电影的设计是为了展示虚拟工作室可以通过Chroma-Key提供什么。第一个但可能最不明显的好处是，与绿幕或蓝幕相比，虚拟演播室可以实现更好的照明。“杰森想穿上他(自己的)盔甲，我觉得‘太棒了’，”博尔特说，“因为马上就有了这个反射面……”蓝屏和绿屏会是个问题。“。在后期制作中，任何反射的绿色或蓝色色调都很难去除。\n色键的另一个缺点是，它极大地减少了摄影师关于如何拍摄电影的选择。博尔特说：“变形镜头是老式的，在数码摄影中我们喜欢使用它们，因为它们给我们带来了一种古老的感觉，让它感觉更有形和更扎实。”他引用了迈克尔·曼的“热”(1995)，里面充满了椭圆形的波克，作为这些老镜头如何创造“美丽”图像的一个例子。博尔特说，VFX摄制组“讨厌变形镜头，因为他们必须在后期制作中人为地模仿[椭圆形波克]”，从而使重效果的镜头看起来不那么真实。珀西瓦尔是用老式的变形镜头拍摄的，拍摄对象背后的物体可能会变得模糊，还有像工作室里的烟雾这样的氛围-所有这些在后期制作中都很难做好，或者做得很贵。\n博尔特补充说，如果他想在外景拍摄珀西瓦尔，那将是一个漫长的过程。他说：“如果我在月光下的森林里，我们会从晚上9点拍摄到早上7点，这太可怕了，月光下的森林很有趣，因为它太假了。”\n“夜晚的树林(漆黑一片)就像布莱尔女巫项目。没有“月光下的森林”这回事。我们的起重机上有很大的灯，我们都是用背光照明的，“Bolter说。他继续说，如果在拍摄当天，摄制组需要调整灯光，拆下每台起重机并移动它来改变设置是一个漫长的过程。\n在“珀西瓦尔”中，骑士被“推”过时间，虚幻的时间流逝中，白天和黑夜飞逝而过。由于工作室有一个覆盖在屋顶内部的屏幕，团队可以建造一个数字月亮来在天空中移动，就像它在现实中所做的那样。但与观众对电影月光效果的期望相比，这并不是“看起来和感觉都正确”。然而，在几分钟内，博尔特就把月亮换成了白色的圆形JPEG，滚动到天花板上，创造了一种更具电影感的感觉。与在现实世界中需要几个小时的时间相比，能够在虚幻引擎内在短短几分钟内做出改变是一种启示。\n传统的大成本电影依赖于预先可视化；粗制滥造的剪辑可以帮助创作者更好地理解他们的电影。如此多的VFX素材在拍摄结束后的18个月内都不会完成，所以这些[剪辑]可以帮助他们了解电影会是什么样子。它还可以帮助他们计划拍摄，在布景建造者拿出钻头和锤子之前挑选拍摄角度和照明风格。有了虚拟演播室，“所有的VFX和布景扩展都是在摄像机内和片场内完成的，”Sun说。Percival的环境没有雇佣大量的CGI艺术家，而是由三位艺术家在短短两周内在虚幻引擎中创建的。“虚拟制作，”孙说，“是一项实时技术，它是实时呈现的，而且是交互式的。”\n“我们有大量的电子邮件和Dropbox，”博尔特说，“用CGI渲染(艺术家们)建造的东西，我们就能说‘好的，这很棒，把那个拿走，把那个移走。’”摄制组甚至可以在他去拍摄的路上对布景进行最后一分钟的修改，“然后，突然，一个小时后，它就变了。”与传统电影的设置相比，这几乎是奢侈的，特别是就提供给电影制片人的控制水平而言。\n从长远来看，拍摄特定场景的成本应该比去某个地点旅行的成本低得多，这一点很有帮助。博尔特建议拍摄一个假想的短片，场景是两个人在日落时在沙漠中交谈，拍摄可能需要长达三周的时间。“你必须派一个摄制组去摩洛哥，去沙漠，每天大约有15分钟的拍摄时间。”相比之下，博尔特可以自己飞到摩洛哥，“拍摄一个[背景]板”，然后可以在虚拟演播室的屏幕上一遍又一遍地播放。突然之间，这一过程需要一天的时间，并带来了所有的成本节约。\n正是这一部分让奥兰多·佩德雷戈萨(Orlando Pedregosa)等为制作过程提供资金的人感到兴奋。他是Film.io公司的首席制片官，该公司是一家支持电影和电视项目的公司。他说，LED屏幕可以节省近“99%的建设和制作设计预算”，背景板镜头节省了大约“70%，这要归功于交通、保险、酒店和演员/剧组费用的减少。”他说，按实际价值计算，一部电影的一次设置可能节省高达150万欧元(合170万美元)。考虑到现在大流行对电影院的影响--由于放映变得不切实际，主要的连锁店在接下来的几个月里面临关闭--越便宜越好。\n博尔特认为，对于虚拟工作室所能做的事情，我们仅仅触及了皮毛。“如果你想(为一部电影)建造一座办公楼，你可以疯狂地拥有一千个隔间，”他说，“或者一个极其荒谬的查理·考夫曼(Charlie Kaufman)式的环境，你只需要建造一个隔间(作为一个真实的布景)，然后挡住实体布景的边缘来掩盖问题。”这也是一个关键的缺点，因为虚拟演播室有许多物理限制需要解决。“你有天花板，有地板，这些东西不能[与墙]融合在一起，”博尔特说。拍摄水平景观的自由是很大的，但你不能上下摇摆，而不冒着让人们看到非常明显的接合的风险。\n“天花板是用来照明的，真的，除非你在看别人鼻子的时候拍了一些奇怪的照片，”博尔特说。这取决于电影制片人如何绕过这些限制，这可以通过使用计算机内的虚拟摄像机移动来实现。“背景本身可以‘传送带’，模拟迈克尔·贝旋转的稳定镜头，”博尔特说，只要真实的摄影棚里没有道具或场景，因为“树不会旋转”。\n值得一提的是，这项技术还没有到你可以把每个项目都扔在它面前并期待成功的地步。博尔特说，目前的配置“约为90%”，“肉眼看起来是720便士--令人印象深刻，但仅够好。”珀西瓦尔的目标不是照片现实主义，而是倾向于舞台般的、空灵的品质，但除非你已经知道，否则你不会猜到它是在电视前拍摄的。我还看到过来自起义军的其他未发表的演示，看起来更逼真。一段摩托车骑过伦敦市中心(视频)的测试序列令人难以置信。一个穿着漂浮连衣裙的人站在山顶(想想香水广告)的镜头看起来类似于在威尔士乡村拍摄的。给它一两年的时间，让技术成熟一点，这可以成为任何数量的电影和电视节目的可行工具。\nRebellion很可能会希望将虚拟演播室作为建立其新的多媒体帝国的最佳方式。2018年，它宣布正在与邓肯·琼斯(月球、魔兽、哑巴)合作拍摄一部盗贼士兵电影。这也让酝酿已久的“德雷德法官：巨型城市一号”项目迫在眉睫。用传统的绿幕技术制作这样一部电视剧肯定会花费巨资，但也许这种技术会让这样的项目在财务上可行。", "note_en": "For as long as filmmaking has existed, there has been a need to build fantastic worlds in front of cameras. The earliest techniques borrowed from theatre: Painted curtains and wooden, two-dimensional backdrops. Then, we painted worlds onto glass, photographing them onto the film itself to blend the real and the fake. At the same time, artists worked out how to project previously-shot film onto a screen behind the actors. These days, we’ve flipped this story, dropping real actors into digital environments that only exist inside computers. But now we’re blending the very old and the very new: Digital backdrops in “virtual” studios could end the blight of green-screened cinema, and its myriad problems. That’s what’s being experimented on in a former newspaper press in Oxfordshire, UK, where the first “all virtual” film has just been shot.\n Jason Kingsley OBE is the presenter of   Modern History TV, a YouTube channel with short documentary clips explaining the history of the Middle Ages, which  he loves.\n  But that is a side project to his day job, as co-founder and CEO of Rebellion Developments, the  British studio behind   Sniper Elite. Rebellion doesn’t just make games, however, and owns comics giant 2000AD, the name behind Judge Dredd and Rogue Trooper, as well as publishers Abaddon and Solaris. Now, the company is building its own studio to create TV series and movies based upon its vast library of IP.\n Percival is a short film, first broadcast on  Kingsley’s aforementioned YouTube channel, and  marks a new chapter in Rebellion’s filmmaking ambitions. The five-minute clip depicts a battle-scarred knight of the round table played by Kingsley, who is close to death in a forest. King Arthur is dying, the (Holy) grail is missing. The titular knight is left broken and bloodied when some unknown force gets involved. Suddenly, time speeds up, aiding his recovery, and transporting him to the eerie ruins of a church, where he receives a vision that inspires a new quest.\n Rebellion says that it’s the world’s first “all virtual” production, with all of the action playing out entirely in front of a halo of large flat screen displays. These monitors are connected to PCs running Unreal Engine, where the virtual environments are produced. Essentially, the painted curtains and matte paintings of yesteryear have been replaced with LED TVs showing footage from a game engine.\n You might have heard of the technique before. The first high-profile instance of its use was Disney’s   The Mandalorian , which shot the majority, but not all, of its scenes in these studios. In that instance, the action was filmed in a 270-degree horseshoe of LED displays 20 feet high.\n  Star Wars has long been a standard-bearer for titles that push the state of the art of filmmaking. The prequel movies, shot between 1997 and 2003, leaned heavily on shooting actors on green screens, with CGI backgrounds added in afterward. This process, of standing actors in front of blue or green curtains, is known as “Chroma-Key” or “Chroma-Keying.” And after Star Wars, Chroma-Key became ubiquitous for even modestly-budgeted films with special effects. The mid-noughties saw a trend of films almost exclusively using the technique, including  Sky Captain and the World of Tomorrow,  Sin City and  300.\n These days, green screen is everywhere: the battle of New York from  Avengers Assemble, for instance, was mostly shot on a  New Mexico green screen studio and then tinkered with for months by an army of CGI artists.\n Virtual studios have the potential to make a big difference to film-making. Because the background and environments were already visible in the shot, there was no need to add them in afterward. It also gives actors a better handle on what they’re doing, since performing in an entirely green void can understandably hamper performances. It’s also a lot easier, and cheaper, to shoot than sending your crew across the globe to real-world jungles and deserts that even a lavishly-budgeted show like  The Mandalorian could hardly afford.\n He Sun is the head of Rebellion VFX. He has previously worked on  The Lion King (2019), Maleficent: Mistress of Evil and the aforementioned  Mandalorian. He had originally planned to run a visual effects experiment with a rented LED wall, but: “Jason [Kingsley] said ‘let’s make a movie!” The studio would exist for just three days, but COVID-19 would mean that any production could only use a skeleton crew. With less than three weeks of preparation time, the shoot was run as a test to see if the virtual studio could deliver under some of the toughest conditions.\n  Eben Bolter BSC is the cinematographer behind   Avenue 5 ,   iBoy and   The Feed, and was brought in to shoot and light  Percival. Bolter explained that the film was designed to show what a virtual studio could offer over Chroma-Key. The first, but perhaps least obvious, benefit was how virtual studios enabled better lighting compared to green or blue screen. “Jason wanted to wear his [own] suit of armor and I thought ‘great’,” said Bolter, “because straight away you’ve got this reflective surface [...] blue and green screen would be a problem.” Any reflected green or blue hues would be difficult to remove in post-production.\n Another Chroma-Key drawback is that it dramatically reduces the options available to cinematographers about how they shoot films. “Anamorphic lenses are old-fashioned, and in digital photography we love to use them because they give us that  old-ness, to make it feel more tangible and grounded,” Bolter said. He cited Michael Mann’s   Heat (1995), filled with oval bokeh, as an example of how these older lenses create “beautiful” images. VFX Crews, said Bolter, “hate anamorphic lenses because they have to artificially emulate [oval bokeh] in post-production,” making effects-heavy shots look less real as a consequence.  Percival is shot with a vintage anamorphic lens, with objects behind the subject that could fall away to blur and atmospheres like in-studio smoke -- all things that would be difficult, or expensive to do well, in post-production.\n  Bolter added that if he wanted to shoot  Percival on location, it would be a long process. “If I was in a moonlit forest, we’d [shoot] from 9pm to 7am, which  is horrible, and a moonlit forest is interesting because it’s  so fake,” he said.\n “Woods at night are [pitch dark] like the  Blair Witch Project. There’s no such thing as a ‘moonlit forest’. We have massive lights on cranes and we backlight it all,” Bolter said. He continued that if, on the day of the shoot, the crew needs the lights to be adjusted, it’s a long process to take down each crane and move it to change the setup.\n In  Percival, the knight is “pushed” through time with a faux-timelapse in which the days and nights fly past. Since the studio has a screen covering the inside of the roof, the team could build a digital moon to move across the sky as it would in reality. But this didn’t “look and feel right” compared to the audience’s expectations of how cinematic moonlight works. In a matter of minutes, however, Bolter swapped the moon for a white, circular JPEG that rolled across the ceiling to create a  more cinematic feel. Compared to the hours it would have taken in the real world, being able to make the change in mere minutes inside the Unreal engine was a revelation.\n Traditional big-budget movies rely on pre-visualization; crudely-made clips that help creators get a better sense of their film. So much of the VFX material won’t be finished for 18 months after shooting finishes, so these [clips] help them understand what the film will look like. It also helps them plan the shoot, picking shot angles and lighting styles before set builders bust out the drills and hammers. With a virtual studio, “All of the VFX and set extension is done in-camera and on set,” said Sun. Rather than employ a legion of CGI artists, Percival’s environments were created in Unreal Engine by three artists in just  two weeks. “Virtual production,” said Sun, “is a real-time technology, it’s rendered in real-time, and it’s  interactive.”\n  “We had this massive chain of emails and Dropboxes,” said Bolter, “with CGI renders of what [the artists] built, and we’d be able to say ‘okay, this is great, take that away, move that.’” The crew could even make last-minute changes to the set as he was traveling to the shoot, “then, suddenly, an hour later, it’s changed.” Compared to the setup of traditional films, this was almost luxurious, especially in terms of the levels of control afforded to filmmakers.\n It helps that, in the longer term, it should be far less expensive to shoot specific scenes than it would to travel to a location. Bolter suggested a hypothetical short scene featuring two people talking in a desert at sunset, which could take up to three weeks to shoot. “You’d have to fly a crew to Morocco, go out into the desert, and you’d have about 15 minutes of filming per day.” By comparison, Bolter could fly himself to Morocco, “shoot a [background] plate” which could then be played back on the virtual studio’s screens over and over again. Suddenly, that sequence takes a day, with all of the cost savings that brings.\n It this part that excites the people who are bankrolling the production process, like Orlando Pedregosa. He’s Chief Production Officer at  Film.io, a company backing film and TV projects, who said that LED screens can offer savings close to “99 percent of the construction and production design budget,” with background plate shots saving around “70 percent, thanks to a reduction in items like transport, insurance, hotels and cast/crew expenses.” In real terms, he said that’s a potential saving of up to €1.5 million ($1.7 million) on a single set-up for a movie. Given the effect the pandemic is having on cinema right now -- with  major chains facing closure for the next few months as screenings become impractical -- cheaper is better.\n  Bolter believes that we’ve barely scratched the surface for what virtual studios can do. “If you wanted to build an office block [for a movie], you can go crazy and have a thousand cubicles,” he said, “or an infinitely ridiculous, Charlie Kaufman-esque environment and you just need to build one cubicle [as a real set] and block the edges of the physical set to hide the problems.” That’s one of the key downsides, too, since the virtual studio has a number of physical limitations to work around. “You’ve got the ceiling, you’ve got the floor, and those things don’t blend together [with the wall],” said Bolter. The freedom to shoot horizontal vistas is great, but you can’t pan up and down without risking people seeing the very obvious join.\n “The ceiling is for lighting, really, unless you’re doing some sort of weird shot when you’re looking up someone’s nose,” said Bolter. It’s on filmmakers to work around these limits, which could be possible using virtual camera movements inside the computer. “The background itself can ‘conveyor’ around, to fake the sort of Michael Bay  spinning steadicam shots,” said Bolter, so long as there are no props or scenery in the real studio, since “trees won’t spin.”\n It’s worth saying that the technology is not at the point where you could dump every project in front of it and expect success. Bolter says that the current setup is “around 90 percent,” and looks “720p to the naked eye -- impressive, but only nearly good enough.”  Percival isn’t aiming for photorealism, and leans into its stagey, ethereal quality, but you wouldn’t guess it was shot in front of a TV unless you already knew. And I have seen other, unpublished demos from  Rebellion that looked a lot more realistic. A test sequence of a motorbike riding through (video) of central London is unbelievable. Footage of a person in a floaty dress standing on top of a hill (think: a perfume commercial) similarly looks like it was shot in the Welsh countryside. Give it a year or two, for the technology to mature even a little, and this could become a viable tool for any number of films and TV shows.\n It’s likely that Rebellion will want to use virtual studios as the best way to build its new  multimedia  empire. In 2018, it announced that it was working with Duncan Jones ( Moon,   Warcraft ,   Mute) on a   Rogue Trooper  movie. And it’s also got the long-in-the-works  Judge Dredd: Mega City One project looming on the horizon. Making a TV series on that scale would surely cost a huge amount with traditional green screen techniques, but perhaps this technology will make projects like this financially viable.", "posttime": "2020-10-18 19:51:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,ios,电脑,studios", "title": "虚拟制片厂，在连接到个人电脑的平板显示器的光环前进行电影制作，提供了一种真正的绿色屏幕的替代方案", "title_en": "Virtual studios, where the filmmaking takes place in front of a halo of flat screen displays connected to PCs, are offering a real alternative to green screens", "transed": 1, "url": "https://www.engadget.com/percival-rebellion-virtual-studio-filmmaking-160053709.html", "via": "", "real_tags": ["电影", "ios", "电脑", "studios"]}, {"category": "", "categoryclass": "", "imagename": "0bdd52682869d20484e109da96b37a9b.jpg", "infoid": 1029589, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "渥太华大学的研究人员与以色列科学家合作，在世界上第一次能够在实验室中制造出可能应用于现代技术的光学框架结。他们的工作为分发秘密密钥的新方法打开了大门-用于加密和解密数据，确保安全通信和保护私人信息。该小组最近在“自然通讯”上发表了他们的发现。这是非常重要的，特别是从拓扑聚焦的角度来看，因为框架结为拓扑量子计算提供了一个平台，资深作者，渥太华大学结构光加拿大研究教授易卜拉欣·卡里米教授解释道。\n此外，我们使用这些非平凡的光学结构作为信息载体，并开发了一种用于经典通信的安全协议，其中信息被编码在这些有框架的结中。\n研究人员推荐了一个简单的自己动手的课程，以帮助我们更好地理解框架结，也就是那些也可以被描述为表面的结。\n第一作者、渥太华大学校友、麻省理工学院(MIT)博士生雨果·拉洛克(Hugo Larocque)说，拿出一张狭长的纸，试着做出一篇，这是第一作者雨果·拉洛克(Hugo Larocque)说的。\n由此产生的对象被称为框架结，并且具有非常有趣和重要的数学特征。\n研究小组试图在光束范围内实现相同的结果，这带来了更高的难度。经过几次尝试(打结看起来更像打结的绳子)，研究小组找到了他们正在寻找的东西：一种打结的丝带结构，这是框式打结的典型特征。\n雨果·拉洛克(Hugo Larocque)解释说，为了添加这条丝带，我们的团队依靠光束整形技术来操纵光的矢量性质，雨果·拉洛克(Hugo Larocque)解释说。通过改变光场沿无框架光学结的振荡方向，我们能够通过将这些振荡场描绘出的线条粘合在一起，为后者分配一个帧。&#34；；我们通过改变光场沿非框架光学结的振荡方向，将这些振荡场描绘出的线条粘合在一起，从而为后者分配了一个帧。\n根据研究人员的说法，结构光束正被广泛用于编码和分发信息。\n这项研究的合著者、渥太华博士后研究员Alessio D&39；Errico博士说，到目前为止，这些应用仅限于物理量，这些物理量可以通过在给定位置观察光束来识别。\n我们的工作表明，丝带方向上的扭曲数结合素数因式分解可以用来提取纽结的所谓辫子表示。\n这些对象的结构特征可以用来指定处理程序，雨果·拉洛克补充道。在这种情况下，这个程序需要保密，同时在各方之间传播它，人们需要一种方法来加密它，然后再解密它。我们的工作解决了这个问题，建议使用我们的光学框架结作为这些程序的加密对象，这些程序稍后可以通过我们也介绍的辫子提取方法恢复。\n首次利用这些复杂的3-D结构来开发分发秘密密钥的新方法。此外，在量子计算、通信和无耗散电子学中利用拓扑概念也引起了广泛而强烈的兴趣。结也是由特定的拓扑属性来描述的，这在密码协议中到目前为止还没有考虑到。&#34；\n该项目背后的想法是在2018年希腊克里特岛的一次科学会议上与以色列研究人员进行讨论时产生的。\n来自内盖夫的本古里安大学和以色列的巴伊兰大学的科学家们开发了质数编码协议。\n该项目随后跨越地中海和大西洋，最后到达位于渥太华大学高级研究中心的卡里米博士的实验室。这就是实验程序开发和进行的地方。然后对得到的数据进行分析，并通过一个专门设计的程序提取编织结构。\n雨果·拉洛克(Hugo Larocque)说，目前的技术使我们有可能高精度地操纵光束的不同特征，如强度、相位、波长和偏振。这允许使用全光方法对信息进行编码和解码。量子密码协议和经典密码协议都是利用这些不同的自由度设计出来的。\n我们的工作为使用隐藏在激光束传输中的更复杂的拓扑结构来分发秘密密钥开辟了道路。\n此外，我们开发的实验和理论技术可能有助于发现拓扑量子计算的新实验方法，有望超越当前量子计算技术中与噪音相关的问题，易卜拉欣·卡里米博士补充道。\n“作为信息载体的光学框架结”这篇论文最近发表在“自然通讯”杂志上。更多信息：Hugo Larocque等人，作为信息载体的光学框架结，自然通信(2020)。DOI：10.1038/s41467020-18792-z", "note_en": "In a world first, researchers from the University of Ottawa in collaboration with Israeli scientists have been able to create optical framed knots in the laboratory that could potentially be applied in modern technologies. Their work opens the door to new methods of distributing secret cryptographic keys—used to encrypt and decrypt data, ensure secure communication and protect private information. The group recently published their findings in  Nature Communications.    &#34;This is fundamentally important, in particular from a topology-focused perspective, since framed knots provide a platform for topological quantum computations,&#34; explained senior author, Professor Ebrahim Karimi, Canada Research Chair in Structured Light at the University of Ottawa.\n  &#34;In addition, we used these non-trivial optical structures as information carriers and developed a security protocol for classical communication where information is encoded within these framed knots.&#34;\n    The researchers suggest a simple do-it-yourself lesson to help us better understand framed knots, those   that can also be described as a surface.\n  &#34;Take a narrow strip of a paper and try to make a  ,&#34; said first author Hugo Larocque, uOttawa alumnus and current Ph.D. student at MIT.\n  &#34;The resulting object is referred to as a framed knot and has very interesting and important mathematical features.&#34;\n  The group tried to achieve the same result but within an optical beam, which presents a higher level of difficulty. After a few tries (and knots that looked more like knotted strings), the group came up with what they were looking for: a knotted ribbon structure that is quintessential to framed knots.\n   &#34;In order to add this ribbon, our group relied on beam-shaping techniques manipulating the vectorial nature of light,&#34; explained Hugo Larocque. &#34;By modifying the oscillation direction of the light field along an &#34;unframed&#34; optical knot, we were able to assign a frame to the latter by &#34;gluing&#34; together the lines traced out by these oscillating fields.&#34;\n  According to the researchers, structured light beams are being widely exploited for encoding and distributing information.\n  &#34;So far, these applications have been limited to physical quantities which can be recognized by observing the beam at a given position,&#34; said uOttawa Postdoctoral Fellow and co-author of this study, Dr. Alessio D&#39;Errico.\n  &#34;Our work shows that the number of twists in the ribbon orientation in conjunction with prime number factorization can be used to extract a so-called &#34;braid representation&#34; of the knot.&#34;\n    &#34;The structural features of these objects can be used to specify   processing programs,&#34; added Hugo Larocque. &#34;In a situation where this program would want to be kept secret while disseminating it between various parties, one would need a means of encrypting this &#34;braid&#34; and later deciphering it. Our work addresses this issue by proposing to use our optical framed knot as an encryption object for these programs which can later be recovered by the braid extraction method that we also introduced.&#34;\n  &#34;For the first time, these complicated 3-D structures have been exploited to develop new methods for the distribution of secret cryptographic keys. Moreover, there is a wide and strong interest in exploiting topological concepts in quantum computation, communication and dissipation-free electronics. Knots are described by specific topological properties too, which were not considered so far for cryptographic protocols.&#34;\n     The idea behind the project emerged in 2018, during a discussion with Israeli researchers at a scientific meeting in Crete, Greece.\n  Scientists from Ben-Gurion University of the Negev and Bar-Ilan University, in Israel, developed the prime number encoding protocol.\n  The project then crossed the Mediterranean Sea and the Atlantic Ocean before ending up in Dr. Karimi&#39;s lab located in the Advanced Research Complex at the University of Ottawa. That&#39;s where the experimental procedure was developed and conducted. The resulting data were then analyzed, and the braid structure extracted through a specially devised program.\n    &#34;Current technologies give us the possibility to manipulate, with high accuracy, the different features characterizing a light beam, such as intensity, phase, wavelength and polarization,&#34; said Hugo Larocque. &#34;This allows to encode and decode information with all-optical methods. Quantum and classical cryptographic protocols have been devised exploiting these different degrees of freedom.&#34;\n  &#34;Our work opens the way to the use of more complex topological structures hidden in the propagation of a laser beam for distributing secret cryptographic keys.&#34;\n  &#34;Moreover, the experimental and theoretical techniques we developed may help find new experimental approaches to topological quantum computation, which promises to surpass noise-related issues in current quantum computing technologies,&#34; added Dr. Ebrahim Karimi.\n  The paper &#34;Optical framed knots as information carriers&#34; was recently published in  Nature Communications.        More information:\t\t\t\t\t\t\t\t\t\t\t\tHugo Larocque et al, Optical framed knots as information carriers,  Nature Communications (2020).  DOI: 10.1038/s41467-020-18792-z", "posttime": "2020-10-18 19:39:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编码,knots,结构", "title": "分类结：研究人员创建光学框架结来编码信息", "title_en": "Classified knots: Researchers create optical framed knots to encode information", "transed": 1, "url": "https://phys.org/news/2020-10-optical-encode.html", "via": "", "real_tags": ["编码", "knots", "结构"]}, {"category": "", "categoryclass": "", "imagename": "32f000287cf37abdb097caa42fd9aa7e.png", "infoid": 1029587, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年，一个由来自三所不同大学的6名葡萄牙研究人员组成的团队决定研究这个问题，最终发表了一篇题为“跨编程语言的能源效率”的论文。他们运行了用27种不同语言编写的10个编程问题的解决方案，同时仔细监控每个问题的用电量-以及速度和内存使用情况。\n具体地说，他们使用了计算机语言基准游戏(Computer Language Benchmark Game)中的10个问题，这是一个用于比较性能的免费软件项目，其中包括一组标准的简单算法问题，以及一个运行测试的框架。(它的前身是“伟大的计算机语言枪战”。)。“这使我们能够获得一套具有可比性、代表性和广泛性的程序…。以及编译/执行选项和编译器版本。“。\n运行各种基准测试很重要，因为最终它们的结果会根据执行的测试而有所不同。例如，总的来说，C语言被证明是最快的，也是最节能的。但在涉及扫描DNA数据库以寻找特定基因序列的基准测试中，铁锈是最节能的-而C排在第三位。\n然而，即使在同样的测试中，“最好”的语言也取决于你的标准是什么。在那次测试中，C语言也被证明只是第二快的语言(同样，排在Rust之后)。但如果根据内存使用情况对结果进行排序，拉斯特的排名整整下降了9位。虽然Fortran是这项测试的第二高能效语言，但当结果按执行时间排序时，它也下降了整整六位。\n研究人员指出，他们“严格遵循”CLBG项目关于编译器版本和最佳优化标志的指导方针。功耗是使用英特尔的一种工具-运行平均功率限制工具-进行测量的，每个程序不只执行一次，而是执行10次，“以减少冷启动和缓存影响的影响，并能够分析测量的一致性并避免异常值。”(出于这个原因，他们报告说“测量结果相当一致”。)。为了增加一致性，所有的测试都是在运行Linux Ubuntu Server 16.10(内核版本4.8.0-22-通用)的台式机上进行的，具有16 GB的RAM和3.20 GHz的Haswell Intel Corei5-4460 CPU。\n与Pascal相比，Lisp的平均能耗(131.34J)是C的2.27倍，执行时间(4926.99ms)是C的2.44倍，所需的内存(126.64MB)是Pascal的1.92倍。\n他们还比较了编译语言和解释语言的结果(对运行在虚拟机上的语言进行了单独的分类)。本文还对不同的编程范例进行了单独的比较-包括函数式编程和命令式编程，以及面向对象的编程和脚本。\n这篇论文仔细研究了一个常见的假设，即速度更快的程序总是使用更少的能量，指出它并不像物理定律说的E(能量)=T(Ime)x P(Power)那么简单。研究人员指出，这在一定程度上是因为电力没有以一致的速度消耗，这表明这可能会影响其他研究人员调查程序的运行时间是否影响其能耗的工作。(“关于这个问题的结论有时会有分歧…”)。在他们的一项基准测试中，Chapel程序的执行时间比用Pascal语言编写的同等程序少55%-然而，Pascal程序使用的能源却少了10%。\n因此，尽管人们仍然普遍认为，当程序运行得更快时，能耗会降低，但研究人员毫不含糊地表示，“速度更快的语言并不总是最节能的。”\n这可能是一个很难回答的问题，因为功耗受到许多因素的影响(包括编译器的质量和使用的库)。但最终，研究人员甚至能够根据能耗是由CPU还是DRAM消耗来细分能耗-得出的结论是，大部分电量(约88%)平均由CPU消耗，无论基准程序是在虚拟机上编译、解释还是运行。\n有趣的是，口译语言显示出稍高的变化，CPU有时消耗高达92.90%的功率，或低至81.57%。\n在研究了他们的结果后，研究人员还得出结论，DRAM的峰值使用和能源消耗之间的关系“几乎不存在”。\n这项研究对这个长期存在的问题提供了更多的见解：更快的速度更环保吗？是的，确实“最节能的五种语言在按执行时间排序时保持了它们的排名，并且在能量和时间值上都有很小的差异。”\n事实上，对于十分之九的基准问题，最高分(速度和能效)来自总体速度最快、最节能的前三名语言之一-这并不让研究人员感到惊讶。众所周知，正如我们的数据所显示的那样，这三大语言(C、C++和Rust)在执行性能方面进行了大量优化和高效。\n但是，当您按照运行时对其他24种语言进行排名时，您看到的顺序与对它们进行能效排名时所看到的顺序不同。只有四种语言保持相同的能量和时间顺序(OCaml、Haskel、Sracket和Python)，其余语言则完全混乱。\n即使是在单独的基准测试中，也有快速执行的语言并不是最节能的情况。\n还有其他有趣的结果。编译语言“往往”是最节能、运行速度最快的语言--他们的论文甚至可以用数字来量化这种差异。平均而言，编译语言执行解决方案消耗120J[焦耳]，而对于虚拟机和解释语言，此值分别为576J和2365J。\n研究人员在比较执行时间时也应用了同样的精确度，得出的结论是，“编译语言平均耗时5103毫秒，虚拟机语言耗时20623毫秒，解释语言耗时87614毫秒。”\n在这两个类别的前五种语言中，有四种是编译的。(例外？Java。)。\n翻译速度最慢的五种语言都是：Lua、Python、Perl、Ruby和TypeScript。并解释了消耗能量最多的五种语言：Perl、Python、Ruby、JRuby和Lua。\n但与此同时，当使用正则表达式操作字符串时，五种最节能的语言中有三种是解释型语言(TypeScript、JavaScript和PHP)，“尽管它们在其他场景中往往不是很节能”。\n编译语言也占据了使用的内存空间最少的前五个位置。\n“平均而言，编译语言需要125MB，虚拟机语言需要285MB，解释语言需要426MB，”研究人员报告说。与此同时，解释型语言占据了五个垫底位置中的四个，这意味着它们消耗的内存空间最多：JRuby、Dart、Lua和Perl。(虽然Erlang不是一种解释型语言，但它也会出现在后五名中，介于Dart和Lua之间)。\n如果按编程范例分类，命令式语言需要116Mb，面向对象的需要249Mb，功能性的需要251Mb，最后是脚本需要421Mb。\n事实上，在比较不同的范例时，命令式编程常常排在首位。与面向对象、函数式和脚本范型的基准程序相比，其基准程序的平均能耗也要低得多，运行速度也快得多。\n但有很多因素需要考虑。“很明显，不同的编程范例，甚至同一范例中的语言，对能耗、时间和内存都有完全不同的影响，”研究人员写道。然而，其中哪一个最重要将取决于您的方案。(例如，后台任务并不总是需要最快的运行时间。)。\n而且一些应用程序需要考虑两个因素，例如，能源使用和执行时间。在这种情况下，“C是最好的解决方案，因为它在两个单一目标中都占主导地位，”研究人员写道。如果您试图在使用较少内存的情况下节省时间，那么C、Pascal和Go“是等价的”-如果您观察所有三个变量(时间、能源使用和内存使用)，情况也是如此。但是，如果您只是想在节省能源的同时使用较少的内存，那么您的最佳选择是C或Pascal。\n在论文的最后，研究人员补充说，为了进一步研究，他们希望检查随着时间的推移，总内存使用量是否与消耗的能量有更好的相关性。\n他们在网上分享他们的数据，这表明这使得未来的研究人员更容易进行比较，例如.NET语言或JVM语言。对于使用移动应用程序、物联网系统或其他使用有限电源的应用程序的开发人员来说，功耗是一个主要问题。\n但最终，这项研究可能也会给程序员留下他们最讨厌的东西：模棱两可。研究人员报告说，如果你在寻找一种最好的编程语言，“这个问题没有具体和最终的答案。\n研究人员总结道：“虽然每个基准测试中能源效率最高的语言几乎总是最快的，但事实是没有哪种语言总是比其他语言更好。”“一种语言的使用情况是决定该语言是否是最节能的选择的核心方面。”", "note_en": "Last year a team of six researchers in Portugal from three different universities decided to investigate this question, ultimately releasing a paper titled “ Energy Efficiency Across Programming Languages.” They ran the solutions to 10 programming problems written in 27 different languages, while carefully monitoring how much electricity each one used — as well as its speed and memory usage.\n  Specifically, they used 10 problems from the  Computer Language Benchmarks Game, a free software project for comparing performance which includes a standard set of simple algorithmic problems, as well as a framework for running tests. (It was formerly known as “The Great Computer Language Shootout.”) “This allowed us to obtain a comparable, representative, and extensive set of programs… along with the compilation/execution options, and compiler versions.”\n It was important to run a variety of benchmark tests because ultimately their results varied depending on which test was being performed. For example, overall the C language turned out to be the fastest and also the most energy efficient. But in the benchmark test which involved scanning a DNA database for a particular genetic sequence, Rust was the most energy-efficient — while C came in third.\n Yet even within that same test, the “best” language depends on what your criterion is. For that test C also turned out to be only the  second fastest language (again, placing behind Rust). But Rust dropped a full nine positions if the results were sorted by memory usage. And while Fortran was the second most energy efficient language for this test, it also dropped a full six positions when the results were instead sorted by  execution time.\n  The researchers note that they “strictly followed” the CLBG project’s guidelines about compiler versions and the best optimization flags. Power consumption was measured using a tool from Intel — the  Running Average Power Limit tool — with each program executed not just once, but 10 times, “to reduce the impact of cold starts and cache effects, and to be able to analyze the measurements’ consistency and avoid outliers.” (For this reason, they report that “the measured results are quite consistent.”) For added consistency, all of the tests were on a desktop running Linux Ubuntu Server 16.10 (kernel version 4.8.0-22-generic), with 16GB of RAM and a 3.20GHz Haswell Intel Core i5-4460 CPU.\n  “Lisp, on average, consumes 2.27x more energy (131.34J) than C, while taking 2.44x more time to execute (4926.99ms), and 1.92x more memory (126.64Mb) needed when compared to Pascal.”\n They also compared the results from compiled languages versus interpreted languages (with a separate category for languages that run on virtual machines). And the paper also includes a separate comparison of the different programming paradigms — including both functional and imperative programming, plus object-oriented programming and scripting.\n  The paper took a hard look at the common assumption that a  faster program will always use less energy, pointing out that it’s not as simple as the law of physics that says E(nergy) = T(ime) x P(ower). This is partly because power isn’t expended at a consistent rate, the researchers note, suggesting that may be impacting the work of other researchers investigating whether a program’s running time affects its energy consumption. (“Conclusions regarding this issue diverge sometimes…”) In one of their benchmark tests, a Chapel program took 55 percent less time to execute than an equivalent program written in Pascal — and yet that Pascal program used 10 percent less energy.\n So while there’s still a common belief that energy consumption goes down when programs run faster, the researchers state unequivocally that “a faster language is not always the most energy efficient.”\n It can be a hard question to answer, since power consumption is affected by many factors (including the quality of the compiler and what libraries are used). But ultimately the researchers were even able to break down energy consumption based on whether it was being consumed by the CPU or DRAM — concluding that the majority of power (around 88 percent) was consumed by the CPU, on average, whether the benchmark program was compiled, interpreted, or run on a virtual machine.\n Interestingly, interpreted languages showed a slightly higher variation, with the CPU sometimes consuming as much as 92.90 percent of the power or as little as 81.57 percent.\n After studying their results, the researchers also concluded that the relationship between peak usage of DRAM and energy consumption “is almost non-existent.”\n The research provides some more insights into the perennial question: is faster greener? Yes, it’s true that “the top five most energy-efficient languages keep their rank when they are sorted by execution time and with very small differences in both energy and time values.”\n In fact, for nine out of 10 benchmark problems, the top score (for both speed and energy efficiency) came from one of the top three overall fastest and most energy-efficient languages — which didn’t surprise the researchers. “It is common knowledge that these top three languages (C, C++, and Rust) are known to be heavily optimized and efficient for execution performance, as our data also shows.”\n But you  don’t see the same order when you rank the other 24 languages by their run-time as you do when you rank them for energy efficiency. “Only four languages maintain the same energy and time rank (OCaml, Haskel, Racket, and Python), while the remainder are completely shuffled.”\n And even on individual benchmark tests, there are cases where fast-performing languages are not the most energy efficient.\n  There were other interesting results. Compiled languages “tend to be” the most energy-efficient and fastest-running — and their paper can even quantify that difference with a number. “On average, compiled languages consumed 120J [joules] to execute the solutions, while for a virtual machine and interpreted languages this value was 576J and 2365J, respectively.”\n The researchers also applied the same precision when comparing execution times, concluding that on average, “compiled languages took 5103ms, virtual machine languages took 20623ms, and interpreted languages took 87614ms.”\n Of the top five languages in both categories, four of them were compiled. (The exception? Java.)\n  The five  slowest languages were all interpreted: Lua, Python, Perl, Ruby and Typescript. And the five languages which consumed the most energy were  also interpreted: Perl, Python, Ruby, JRuby, and Lua.\n But at the same time, when manipulating strings with regular expression, three of the five  most energy-efficient languages turn out to be interpreted languages (TypeScript, JavaScript, and PHP), “although they tend to be not very energy efficient in other scenarios.”\n Compiled languages also took the top five slots for least amount of memory space used.\n  “On average, the compiled languages needed 125Mb, the virtual machine languages needed 285Mb, and the interpreted needed 426Mb,” the researchers report. Meanwhile interpreted languages claimed four of the five  bottom spots, meaning they consumed the most memory space: JRuby, Dart, Lua, and Perl. (While Erlang is not an interpreted language, it would also appear in the bottom five, between Dart and Lua).\n “If sorted by their programming paradigm, the imperative languages needed 116Mb, the object-oriented 249Mb, the functional 251Mb, and finally the scripting needed 421Mb.”\n In fact, when comparing the different paradigms, imperative programming often came out on top. Its benchmark programs also used far less energy on average —  and ran much faster — than the benchmark programs for object-oriented, functional, and scripting paradigms.\n  But there’s a lot of factors to consider. “It is clear that different programming paradigms and even languages within the same paradigm have a completely different impact on energy consumption, time, and memory,” the researchers write. Yet which one of those is most important will depend on your scenario. (Background tasks, for example, don’t always need the fastest run-time..)\n And some applications require the consideration of two factors — for example, energy usage and execution time. In that case, “C is the best solution, since it is dominant in both single objectives,” the researchers write. If you’re trying to save time while using less memory, C, Pascal, and Go “are equivalent” — and the same is true if you’re watching all  three variables (time, energy use, and memory use). But if you’re just trying to save  energy while using less memory, your best choices are C or Pascal.\n At the end of the paper, the researchers add that for further study, they’d like to examine whether total memory use  over time correlates better with energy consumed.\n They’re  sharing their data online, suggesting it makes it easier for future researchers to compare, for example, .NET languages or JVM languages. For developers working with mobile applications, Internet-of-Things systems, or other apps drawing from limited power supplies, power consumption is a major concern.\n But in the end, the study may also leave programmers with the thing they hate most: ambiguity. The researchers report that if you’re looking for a single-best programming language, “this question does not have a concrete and ultimate answer.\n “Although the most energy efficient language in each benchmark is almost always the fastest one, the fact is that there is no language which is consistently better than the others,” the researchers conclude. “The situation on which a language is going to be used is a core aspect to determine if that language is the most energy-efficient option.”", "posttime": "2020-10-18 18:44:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,编程语言,languages,语言", "title": "哪种编程语言耗电最少？", "title_en": "Which Programming Languages Use the Least Electricity?", "transed": 1, "url": "https://thenewstack.io/which-programming-languages-use-the-least-electricity/", "via": "", "real_tags": ["编程", "编程语言", "languages", "语言"]}, {"category": "", "categoryclass": "", "imagename": "dad14c33e4b7c2a621ebb5b0d43d7d78.png", "infoid": 1029586, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年早些时候，我们在CoinDesk上发表了一篇关于使用密码确保选举安全的文章。你可以在这个论坛的第一部分和第二部分阅读和讨论更多关于密码投票如何工作的细节，以及为什么它会解决我们今天面临的许多问题。几个月前，InterCoin开始在以太平台上构建应用程序和智能合约。虽然它的可伸缩性不足以为日常资金或大规模选举提供动力，但也许就在那里…", "note_en": "Where we are  Earlier this year, we published an article in CoinDesk about using crypto to secure our elections. You can read and discuss more on this forum in part 1 and part 2 that go into some detail about how crypto-powered voting would work, and why it would solve many problems that we face today.  A few months ago, Intercoin started building applications and smart contracts on the Ethereum platform. While it’s not scalable enough to power everyday money or massive elections, perhaps Ethere...", "posttime": "2020-10-18 18:10:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "合约,governance,选举", "title": "智能合约的投票与治理", "title_en": "Voting and Governance by Smart Contract", "transed": 1, "url": "https://community.intercoin.org/t/intercoin-defi-votingcontract-and-governance", "via": "", "real_tags": ["合约", "选举"]}]