[{"category": "", "categoryclass": "", "imagename": "298d8f3057dc003a7cbba11d32533313.jpg", "infoid": 1072519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "棒球是数据如何影响业务的最佳示例之一。这本书和电影“Moneyball”展示了奥克兰田径的GM Billy Beane如何通过引入先进的统计分析来改变这项运动，而不是简单地依靠人童童童童童童工队的报道。今天，棒球由分析师统治，与经验丰富的棒球专业人士一样 - 但可以有太多的数据？", "note_en": "Baseball is one of the best examples of how data can impact a business. The book and movie  “Moneyball” showed how Oakland Athletics’ GM Billy Beane changed the sport by introducing advanced statistical analysis instead of simply relying on reports from human scouts. Today, baseball is ruled by analysts as much as experienced baseball professionals — but could there be too much data?\n Alex Spier writing in the Boston Globe’s  Sunday Baseball Notes column recently pointed out that Boston Red Sox Manager Alex Cora will have 11 coaches on staff this year for 26 players. Compare that with Terry Francona in 2011, who had six for 25, and you can see the number has nearly doubled.\n Spier attributes this in part to the growing amount of data that teams are collecting, which requires more people to observe, interpret, and implement a plan to leverage. As Spier wrote, “The result? Several teams now feature three hitting coaches, and staffs keep growing in an effort to distill the mountains of information into a digestible form for the 26 players on a roster.”\n  Baseball is like a laboratory for advanced statistical analysis, and businesses could learn a lot from watching how the sport deals with expanding datasets.\n Companies shovel data into data lakes, tinker with machine learning models, and use this information to make decisions, but they still face fundamental decisions every day that involve their ever-growing mountain of information. Sure, machines and software can help sort it out — indeed, they are getting better at it — but anyone who has dealt with poorly targeted advertising or email marketing knows there’s much work to be done.\n  Deepak Jeevankumer, managing director at Dell Technologies Capital, says the difference in play now compared to 2014 is that companies now are focused on getting insights to the people who need it faster. “Big Data has become less relevant than ‘fast data.’ E-commerce shoppers, streaming media consumers, gamers, stock/crypto traders and enterprise marketeers are demanding fast insights and fast knowledge,” Jeevankumer told me.\n He believes data needs to be analyzed at its source while streaming, and in real-time after a query is created, and that startups that create solutions that allow companies (and baseball teams) to do this will be more successful in the long run.", "posttime": "2022-01-10 00:19:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可用,companies,棒球", "title": "有更多的数据可用，公司是否具有更聪明的决策？", "title_en": "\n\t\t\t\tWith more data available than ever, are companies making smarter decisions?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/07/with-more-data-available-than-ever-are-companies-making-smarter-decisions/", "via": "", "real_tags": ["可用", "companies", "棒球"]}, {"category": "", "categoryclass": "", "imagename": "94c6fef7330750055515144af4e53a28.jpg", "infoid": 1072518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "稍后的十年发展，VR耳机已经更好，更好 - 但是在这一点上可以安全地说，VR的采用将是......渐进的。如果我们都注定要结束耳机（他们VR，AR或两种混合物）绑在我们的脸上，那么少于一大件事*和千分之一的结果。这里是一个击败军刀;那里的超自然。递增更好/更轻/更快的耳机。也许人们习惯于在工作中使用耳机进行培训。也许每个人都突然同意了一个偏见的东西。\n它将支持FOVEATED渲染，这是一种奇特的方式，说明它可以通过优先考虑愿景中心的渲染来更有效地使用处理能力。\n多年来，VR耳机已经弄清楚了整个批次，但它们仍然非常令人生心。虽然他们真正多么小了？", "note_en": "A decade of development later, VR headsets have gotten better and better — but it’s safe to say, at this point, that VR’s adoption will be … gradual. If we’re all destined to end up with headsets (be they VR, AR or some mix of the two) strapped to our faces, it’ll be less about one-big-thing* and more the result of a thousand tiny steps. A Beat Saber here; a Supernatural there. Incrementally better/lighter/faster headsets. Maybe folks get used to using headsets for training purposes at work. Maybe everyone suddenly agrees on  what a metaverse is.\n This bit-by-bit advancement held true this year at  CES. There was plenty of VR/AR news, none of it earth shattering — but each another step in the progression.\n  (* the one potential meteor strike, of course, being if Apple does what it loves to do and swoops in late, drops its version and turns the category on its head. That’s been the rumor  for a while now.)\n    We’ve known for a while now that Sony has been working on a next-gen headset for the PlayStation 5, following up on the PS VR headset it released in 2016. But beyond a kind of light “We’re working on it!” announcement back in early 2021 and some details about the controllers a few months later, they hadn’t shared many specifics.\n  They’re still keeping some cards close, but they shared a few more details on what’s now officially known  as the PS VR2. Such as:\n It’ll have a wider field of view than the first-gen headset, at 110 degrees versus 96.\n  It’ll be able to track the motion of your eyes, potentially allowing you to do stuff like highlight interface elements just by looking at them.\n It’ll support foveated rendering, which is a fancy way of saying it can use processing power more efficiently by prioritizing the rendering of whatever’s in the center of your vision.\n They’re building new controllers for it (pictured below) with finger detection and the PS5’s mind-bending adaptive triggers.\n  What’ll the headset look like? Unknown! When will it actually ship? TBD! But with the PS VR being one of the few headsets to even kind of rival the  Oculus Meta Quest in terms of ease of use, it’s nice to see Sony continuing to build here.\n   What’s the best way to handle input in VR? Most of the popular headsets have settled on some sort of controller in each hand. What if you just make your  hand the controller, instead?\n Hand tracking isn’t a brand new idea, of course. Companies  have come and gone with hand tracking as their primary focus.\n But HTC’s approach here is a bit different. Instead of relying entirely on cameras, they’re hoping you’ll strap sensor-packed bands to each wrist to help the system track what the cameras can’t see — like when one hand is obscuring the other, or you’ve got your arm back behind you for a golf swing. The company also demonstrated the sensors working while attached to other objects, like ping pong paddles and a NERF gun.\n The company says the sensors should start shipping later this year for $129. One catch? For now, at least, it’ll only work with HTC’s Vive Focus 3 headset.\n   VR headsets have gotten a whole lot sleeker over the years, but they’re still pretty beefy. How much smaller can they really get, though?\n Panasonic subsidiary Shiftall has been working on an “ultra-lightweight, ultra-high-resolution” headset called the Meganex. With speakers built into the frames and a 1.3″ (2560×2560) display for each eye, they end up looking more like a massive pair of steampunk sunglasses than a headset. While designed to be lightweight and foldable, don’t expect to move around  too much in these ones — you’ll need to attach them to computer via USB-C to do the heavy graphical lifting.\n    Microsoft already uses Qualcomm chips for their HoloLens headsets, but the companies made things a bit more official this week. At Qualcomm’s keynote it was announced that the two will work together to develop chips built specifically for use in AR headsets, with said chips supporting each of their augmented reality development platforms (Microsoft Mesh and Snapdragon Spaces.)\n   It’s not flashy hardware, but it’s potentially important on the software side of things: Nvidia this week opened up Omniverse, its collection of tools for helping 3D content creators work together in real time.\n  Omniverse is Nvidia’s platform for allowing creators, designers and engineers to collaboratively build virtual worlds. It’s the company’s platform that brings together design tools and assets from first- and third-party applications into a single hardware and software ecosystem. Until now, Omniverse and the various Nvidia tools that support it were in beta, but at CES today, the company took off the beta label and made Omniverse generally available to creators.\n   This one seems mostly like a concept for now, so … well, don’t fall in love just yet. But TV/phone/air conditioner maker TCL is dabbling in the AR glasses space, pitching something akin to Google Glass in a package that looks much more like a standard pair of specs. “Holographic optical waveguide technology” pushes visuals onto the lens and into your field of view, and their concept video above promises touch-based controls built into the frames.", "posttime": "2022-01-10 00:18:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ar,vr", "title": "VR和AR继续在CES 2022煨", "title_en": "\n\t\t\t\tVR and AR continue to simmer at CES 2022\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/07/vr-and-ar-continue-to-simmer-at-ces-2022/", "via": "", "real_tags": ["ar", "vr"]}, {"category": "", "categoryclass": "", "imagename": "7f5397905636e5537b23df747befac7e.jpg", "infoid": 1072517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年我们得到了，什么，三星预算旗舰和从并行事件的最新onlyplus设备的预览？当然，LG和HTC  - 这两种形式涉及的情况都没有得到帮助 - 要么是智能手机游戏。华为，在展会上有一个主要存在，几年后，不会很快参加CES。\n喊出可能是一个更合理的价格远程配件。如果没有别的，anker知道如何保持成本; $ 220将获得视频栏，这是一种一体化的网络摄像头解决方案。您可以使用基于AI的图片框架进行2K相机，与内置灯塔和扬声器相结合。它不会替换更高级的工作室设置（或者，对于这件物，蛋白石），但这是一个坚实的插头和播放解决方案，适用于那些在（相对）便宜的人的家庭视频游戏。", "note_en": "This year we got, what, Samsung budget-flagship and a preview of the latest OnePlus device from a parallel event? Certainly things weren’t helped along by the fact that LG and HTC — which were both involved in the show in some form — are either mostly or entirely out of the smartphone game. And Huawei, which had a major presence at the show a few years back, won’t be participating in CES any time soon.\n Much of that vacuum has been filled by transportation. Over the past decade, CES has transformed into a major automotive show, as carmakers look to prove to the world that they’re on the bleeding edge of tech, from autonomy to in-car systems to sending robots to the  Martian metaverse. Certainly the show kept  Kirsten and Rebecca very busy this week.\n  CES continues to be a major event on the consumer hardware side of things, as well, even if there aren’t as many phones as there once were. It’s still a major showcase for PCs, connected health, smart home gadgets, accessories and even robotics. It’s also a fascinating look into how the industry is evolving. Take fitness — the sheer volume of wearables has reduced, though companies are experimenting with newer form factors like rings. Meanwhile, there’s been a surge in companies looking to take on the likes of Peloton and Mirror.\n  At what was a pretty subdued showing for wearables, Garmin managed to grab some headlines with its hybrid Sport smartwatch. Hybrid smartwatches have been an admittedly mixed bag over the years, but Garmin has proven to be a surprisingly strong brand in the wearables category. And the  Vivomove Sport is a pretty great looking watch, with a clean design that will appeal to those put off by flashier smartwatches.\n Trackers had a bit of moment, in the wake of the popularity of products like Tile and Apple AirTags. This year the former got another PC partner, in Lenovo, as the  ThinkPad X1 got Tile tracking support, allowing users to find their lost laptop for up to 14 days, even when powered down. Targus, meanwhile, built Apple’s Find My support directly into  its latest backpack.\n   But Chipolo gets the nod here with the introduction of  CARD. The device, which also supports Find My, is slightly larger than a credit card and designed to live in a wallet, so you get an alert whenever you leave the product behind. I currently own one AirTag, which I use for my keys. As someone who has misplaced his wallet more than once in my adult life, I’d say this is a fairly compelling use case that would make me consider shelling out for another.\n  Devin dropped the AXE11000 Tri-Band Wi-Fi 6E Router at the end of his whole  what my work from home set up would look like if I was independently wealthy roundup (paraphrasing here). This thing is pretty wild — especially as far as the world of routers go. The system features motorized antenna that adjust to get a stronger signal. No word on price there, but you’re likely going to pay for that luxury on top of TP-Link’s already high base price. But can you really put a price tag on faster Wi-Fi?\n  Shout-out to what’s likely to be a far more reasonably price remote accessory. If nothing else, Anker knows how to keep costs down; $220 will get you  the Video Bar, which is a kind of all-in-one webcam solution. You get a 2K camera with AI-based picture framing, coupled with a built-in lightbar and speakers. It’s not going to replace more advanced studio setups (or, for that matter, the Opal), but it’s a solid plug and play solution for those looking to up their home video game on the (relatively) cheap.\n  Earlier this week, I wrote a lot of words about CES’s evolution as a robotics show. One of the biggest sticking points there is the general lack of viable home robotics, beyond the Roomba and an army of fellow robotic vacuums. I was happy to get a better look at  Labrador’s system this week, however, because it addresses a very real need — specifically those with limited mobility looking to remain independent. The system is effectively a mobile helping hand for the home.\n  It’s not CES without fun new form factors, and the  Asus Zenbook 17 Fold OLED takes the cake by a mile this year, adopting the foldable phone form factor into a full laptop. What’s most stunning about the thing is that the company actually plans to release the thing. I suspect I’m not alone in assuming this thing was just a concept the first time I saw a render, but Asus is planning to release the system in Q2 of this year. So we’ll see soon enough how close the commercial product looks to these shots.\n  Samsung skipped its usual sensory bombardment this year. There weren’t any robots, just bespoke washing machines and budget phones, but it did manage to sneak in a fun projector, of all things. Despite their relatively limited appeal, companies keep trying to make projectors happen, and at the very least,  this one is small, well-built and looks good. It’s also $900, which means it’s likely destined to stay in its niche.", "posttime": "2022-01-10 00:18:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谈谈,ces,视频", "title": "让我们谈谈CES小工具", "title_en": "\n\t\t\t\tLet’s talk CES gadgets\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/07/lets-talk-ces-gadgets/", "via": "", "real_tags": ["谈谈", "ces", "视频"]}, {"category": "", "categoryclass": "", "imagename": "4658a25722c81f4d175f2fa00cb60beb.jpg", "infoid": 1072516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您好，欢迎2021年1月7日的每日紧缩！星期五，雪地落在树林里的狄更斯。但它在科技界没有下雪的一天。一点也不。事实上，一个风险公司今天提高了10家资本。你能猜到谁？\nPeter Reinhardt Leavel Twilio：请记住，当Twilio购买了32亿美元的时间？它还购买了分部的首席执行官Peter Reinhardt，作为交易的一部分。然而，现在，刽子手的申请是“在魅力工业的全职首席执行官，他在2018年共同创立的碳化初创公司”，“Ron Miller报道。我不能相当地连接魅力和碳，但我们会留意创业公司的下一步。\n我们已经注意到新数据规则和消费者日益增长的渴望对更多隐私的影响，但这是另一个日志来抛弃坏消息火灾：作为公司收入的百分比，营销预算从2020年的11％暴跌到6.4％去年。\n最后，来自CES，一系列电动移动性两轮车，为每个人住在一个​​没有放弃其灵魂的城市，为懒惰人提供更多停车场。", "note_en": "Hello and welcome to Daily Crunch for January 7, 2021! It’s Friday and the snow is falling like the dickens in my neck of the woods. But it was no snow day in the tech world. Not at  all. In fact, one venture firm raised 10 figures of capital today. Can you guess who?\n Before we jump in, today’s TechCrunch staff highlight is  Grace Mendenhall, a member of  the Equity team who is also a documentary film editor. And she’s frankly just the best. Now, the news! — Alex\n   a16z reloads with $9B in new capital:  The venture capital money arms race continued this week with news that Andreessen Horowitz has put together $9 billion to invest in venture deals, growth deals and biotech more specifically. As TechCrunch notes, the resulting dollar figure is a boost on the group’s last trio of similar funds. There is, it appears, an infinite capital appetite in today’s startup market.\n Roblox pulls Chinese app:  Five months after launching with Tencent in China, Roblox’s LuoBuLeSi was taken down. What happened? It may be that Roblox has some work to do on the data side of its service, something that it hinted at in a statement. Regardless, the move is yet another example of how hard it is for non-Chinese companies to build and sell digital products in the country.\n India to investigate Google: In the wake of industry complaints from news groups, India’s Competition Commission “said Friday that Google dominates certain online services and its initial view is that Google has broken the local antitrust laws,” TechCrunch reports. Given how big and lucrative the Indian market is, this is not good news for Mountain View.\n  Before we jump into all the startup news of the day, TechCrunch has a little treat for you. We got veteran venture capitalist Matt Murphy on the phone as 2021 came to a close  to chat about prior tech booms, prior tech busts and what he sees as the strengths and weaknesses of today’s venture game. It’s a great weekend read.\n  Pendulum raises $5.9M for narrative tracking: This is a fun one, as the company’s target market is utterly new to me. Per our reporting, Pendulum “helps companies, governments and other organizations track harmful narratives on social media platforms and elsewhere on the web.” I guess you and I currently do this by reading lots of tweets, but seeing a company build software for it makes good sense.\n Peter Reinhardt leaves Twilio:  Remember when Twilio bought Segment for $3.2 billion? It also bought Segment’s CEO, Peter Reinhardt, as part of the deal. Now, however, the exec is leaving to “be full-time CEO at Charm Industrial, a carbon mitigation startup he co-founded in 2018,” Ron Miller reports. I can’t quite connect  charm and  carbon, but we’ll keep an eye out for what the startup does next.\n Avataar raises $45M for “life-sized 3D product evaluation”: No, this is not “Avatar,” like the movie. It’s Avataar, a U.S.- and India-based startup that helps consumers “visualize products in real-life size and feel in their living room” using their phones. Given that we all want to buy more stuff online, but it’s not always easy to picture a new footstool in situ, I like what the company is up to. Unsurprisingly, Avataar is working with e-commerce brands in categories like furniture.\n Bfree wants to update the irksome business of credit collections: If you have ever gotten a call from a person who thinks that you owe them or someone that they represent money, you may have harkened back to how much more fun it was to get a root canal. Bfree, a “Nigerian credit management fintech,” as TechCrunch puts it, is working to build something that it considers to be more ethical debt collection. The company just raised $1.7 million and is busy recruiting in 16 markets, we report.\n From the CES Beat: TechCrunch’s coverage of the great consumer electronics confab continued today, with posts up on  the promises of elder tech and, well,  all things metaverse, good and bad.\n If you need  even more startup news and notes and analysis this weekend,  the Equity team has you covered.\n After talking to marketing leaders for a year, here’s my advice for CEOs\n  This is a fantastic time to launch a startup, but if you’re trying to grow one — well, winter is coming.\n We’ve already noted the impacts of new data regulations and consumers’ growing desire for more privacy, but here’s another log to toss on the bad news fire: As a percentage of company revenue, marketing budgets plummeted from 11% in 2020 to 6.4% last year.\n “This is the lowest proportion allocated to marketing in the history of Gartner’s Annual CMO Spend Survey,” the research company reported.\n Rebecca Lynn, co-founder and general partner at Canvas Ventures, has had dozens of conversations with early-stage founders in recent months.\n In a TechCrunch+ guest post, she covers the “downward pressure on the efficiency of marketing dollars” and shares several strategies that are producing results — as well as some “crazy” ideas “that seemed ridiculous at the time.”\n (TechCrunch+ is our membership program, which helps founders and startup teams get ahead.  You can sign up here .)\n  Apple keeps working on its fitness product: TechCrunch has news up today regarding Apple’s fitness product, the somewhat lamely named Fitness+. What’s new? Collections, which we write are ”curated series of workouts and meditations” that are targeted at a particular goal. Also new is what’s called “Time to Run,” an “audio running experience,” as we put it. Why doesn’t Apple just buy Peloton? I don’t know.\n When does a Twitter Space become a podcast?  We’re going to find out. Twitter is working on recording its live-audio product, called Spaces. And the social network is saying that it will include replay analytics. Which is super cool? Twitter’s product team is seemingly bringing its really solid 2021 product cadence into the new year.\n And finally, from CES, a   roundup of electric mobility two-wheelers for everyone out there who lives in a city that hasn’t given up its soul to provide more parking for lazy folks.\n   If you have a software consultant that you think other startup founders should know about, fill out the survey  here.\n    Testimonial: “Ridhi and team 91Ninjas bring in good domain knowledge, high-quality thinking and focused execution. We chose them for their expertise, disciplined approach and excellent work ethic. Thanks to team 91Ninjas, our inbound marketing engine has picked up good momentum. After coming onboard, they rapidly kick-started work on multiple fronts. In particular, we witnessed good traction on the social media and content front. We saw a good surge in organic traffic on blogs and our search appearance on domain-specific keywords has improved a lot.”", "posttime": "2022-01-10 00:17:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可视化,avataar,product", "title": "每日紧缩：Avataar培养了$ 45M系列B，以改善3D电子商务产品可视化", "title_en": "\n\t\t\t\tDaily Crunch: Avataar raises $45M Series B to improve 3D e-commerce product visualizations\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/07/avataar-raises-45m-series-b-to-improve-3d-e-commerce-product-visualizations/", "via": "", "real_tags": ["可视化", "avataar", "product"]}, {"category": "", "categoryclass": "", "imagename": "128002777efb53036f15a687c3290a92.jpg", "infoid": 1072515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（TechCrunch +）在与营销领导者交谈过一年后，这是我对CEO的建议：帆布企业联合创始人和帆布企业联合创始人和普通合伙人的建议是关于增长营销团队面临的最新挑战，并分享了一些她给予的建议从首席执行官和营销领先领域收到。她的帖子包括来自Lauren Weinberg，CMO的评论，块，一个医疗CMO Doug Sweeney等。\n营销人员：Ridhi Singh，创始人，91Ninjas推荐给：Udit Dhawan，Dropshop Network Private Limited，https://www.brandsofbharat.in/（udit提供了这个链接，它提供给不同的网站，而不是他工作的公司，不确定我们应该包括两者？）推荐：“我遇到了91ninjas的一些社交帖子，为其他初创公司留下了深刻的印象。他们对社会有一种非常不同的方法，它可以吸引我。他们是一个好思想家的团队，并知道如何讲究品牌故事并参与用户。他们听到你的声音，了解业务目标，然后向后工作，以制作一个可以帮助您实现目标的自定义策略。他们的逻辑方法，无缝的执行和工作完成态度使它们从别人那里脱颖而出。对于初创公司来说，他们是他们工作方式的好选择（就像你的内部团队）和他们带来的价值。“", "note_en": "(TechCrunch+) After talking to marketing leaders for a year, here’s my advice for CEOs: Rebecca Lynn, co-founder and general partner of Canvas Ventures, wrote about the latest challenges facing growth marketing teams and shared some of the the advice she’s given and received from CEOs and marketing leads. Her post includes commentary from Lauren Weinberg, CMO at Block, One Medical CMO Doug Sweeney, and others.\n    (TechCrunch+) 5 growth marketing predictions for 2022: Growth marketer Jonathan Martinez shares his growth marketing predictions for 2022, along with advice on incrementality testing, influencer marketing, video ads and other tactics.\n When discussing the adtech space, Martinez says, “Of all the platforms being spawned, ones that use artificial intelligence is one I’m keeping a close eye on for the time-saving ability it provides growth marketers.”\n  (TechCrunch+) 4 trends that will define e-commerce in 2022: Ben Parr, president and co-founder of Octane AI, helps us start off 2022 with his e-commerce predictions. Parr looks ahead at what’s coming down the pike, including web3 and NFTs, and gives his advice on how your startup should proceed.\n Should online sellers start planning now to start stocking NFTs? Parr noted that Shopify is testing a pilot program for Shopify Plus customers that helps them sell non-fungible tokens via its platform, but he still suggests a wait-and-see approach:\n “Unless you’re deep in web3-land or have a large enough budget for brand experimentation, you should probably wait until the technology becomes more mature or only dip your toe in the water to start,” writes Parr. “A great NFT launch requires a lot more work than making a JPEG and putting it on the blockchain.”\n  Marketer: Ridhi Singh, founder,  91Ninjas  Recommended by: Anish Khadiya,  itilite  Testimonial: “Ridhi and team 91Ninjas bring in good domain knowledge, high-quality thinking, and focused execution. We chose them for their expertise, disciplined approach, and excellent work ethics. Thanks to team 91NInjas, our inbound marketing engine has picked up good momentum. After coming onboard, they rapidly kick-started work on multiple fronts. In particular, we witnessed good traction on the social media and content front. We saw a good surge in organic traffic on blogs and our search appearance on domain-specific keywords has improved a lot.”\n Marketer: Ridhi Singh, founder,  91Ninjas  Recommended by: Udit Dhawan, Dropshop Network Private Limited, https://www.brandsofbharat.in/  ( UDIT provided this link which goes to a different site than the company he works for, not sure if we should include both?)  Testimonial: “I came across some social posts done by 91Ninjas for other startups and was impressed by their work. They had a very different approach to social and it appealed to me. They are a team of good thinkers and know how to tell brand stories and engage users. They hear you out, understand the business goal and then work backward to craft a custom strategy that can help you achieve your goals. Their logical approach, seamless execution, and getting work done attitude makes them stand out from others. For startups, they are a good choice given the way they work (just like your internal team) and the value they bring in.”", "posttime": "2022-01-10 00:17:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "techcrunch,营销", "title": "本周在TechCrunch专家：电子商务趋势，增长营销预测", "title_en": "\n\t\t\t\tThis week in TechCrunch Experts: E-commerce trends, growth marketing predictions\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/01/07/this-week-in-techcrunch-experts-e-commerce-trends-growth-marketing-predictions/", "via": "", "real_tags": ["营销"]}]