[{"category": "", "categoryclass": "", "imagename": "fb3428fd89716a153657fb4a99ebf30c.jpeg", "infoid": 1032187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究小组在2003年已经发现证据表明，现在的太阳比前1000年更活跃。一个新的数据集允许他们将研究时间的长度延长到11400年，这样就可以覆盖自上一次冰河时代以来的整个时间长度。这项研究表明，目前大约从1940年开始的太阳活动高峰期在过去的8000年中是独一无二的。这意味着与过去相比，太阳产生了更多的太阳黑子，但也产生了更多的耀斑和喷发，将巨大的气体云喷射到太空中。所有这些现象的起源和能源都是太阳的磁场。\n自17世纪初发明望远镜以来，天文学家就定期观测太阳黑子。这些是太阳表面的区域，由于它们所蕴藏的强磁场，来自太阳内部的能量供应减少了。因此，太阳黑子的平均温度为5800摄氏度，与非磁性环境相比，太阳黑子的温度要低约1500度，而且看起来很暗。太阳表面可见太阳黑子的数量随太阳11年的活动周期而变化，而太阳的活动周期受长期变化的影响。例如，在17世纪下半叶几乎看不到太阳黑子。\n对于许多关于太阳活动的起源及其对地球气候长期变化的潜在影响的研究来说，自1610年以来存在太阳黑子系统记录的时间间隔太短了。早期的太阳活动水平必须从其他数据中得出。这些信息以宇宙成因同位素的形式储存在地球上。这些是高能宇宙射线粒子与高层大气中空气分子碰撞产生的放射性原子核。其中一种同位素是C-14，半衰期为5730年的放射性碳，这在测定木制品年龄的C-14方法中广为人知。C-14的产生量在很大程度上取决于到达大气的宇宙射线粒子的数量。反过来，这个数字又会随着太阳活动水平的不同而变化：在活动频繁的时候，太阳磁场提供了有效的屏蔽，抵御这些高能粒子，而宇宙射线的强度在活动较低的时候会增加。因此，太阳活动越多，C-14的产生率就越低，反之亦然。\n通过大气中的混合过程，宇宙射线产生的C-14到达生物圈，其中一部分被合并到树木的生物量中。一些树干可以在它们死亡数千年后从地下恢复，并可以测量它们树轮中储存的C-14的含量。C-14被纳入的年份是通过比较寿命重叠的不同树木来确定的。通过这种方式，人们可以倒退测量11400年来C-14的生产率，直到最后一个冰河时代结束。研究小组使用这些数据计算了这11400年来太阳黑子数量的变化。太阳黑子的数量也是衡量太阳活动的其他各种现象强度的一个很好的量度。\n过去的太阳活动重建方法是用一致的定量物理模型描述连接同位素丰度和太阳黑子数的复合链中的每一个环节，通过比较历史上直接测量的太阳黑子数记录和极地冰盾中宇宙成因同位素Be-10的较短重建来检验和测量。这些模型涉及宇宙线产生同位素，行星际磁场(开放太阳磁通量)对宇宙射线通量的调制，以及大尺度太阳磁场与太阳黑子数之间的关系。这样，第一次可以定量可靠地重建自上一次冰河时代结束以来的整个时间的太阳黑子数。\n由于太阳的亮度随太阳活动而略有不同，新的重建也表明，今天的太阳比8000年前更加明亮。这种效应是否会在上个世纪对地球的全球变暖做出重大贡献还是个悬而未决的问题。萨米·K·索兰基(Sami K.Solanki)周围的研究人员强调，自1980年左右以来，除了11年周期的变化外，太阳活动一直保持在大致恒定(高)的水平上，而在此期间，全球气温经历了强劲的进一步上升。另一方面，过去几个世纪中太阳活动和地面温度的非常相似的趋势(除了最近20年的显著例外)表明，太阳和气候之间的关系仍然是一个挑战。", "note_en": "The research team had already in 2003 found evidence that the Sun is more active now than in the previous 1000 years. A new data set has allowed them to extend the length of the studied period of time to 11,400 years, so that the whole length of time since the last ice age could be covered. This study showed that the current episode of high solar activity since about the year 1940 is unique within the last 8000 years. This means that the Sun has produced more sunspots, but also more flares and eruptions, which eject huge gas clouds into space, than in the past. The origin and energy source of all these phenomena is the Sun&#39;s magnetic field.\n Since the invention of the telescope in the early 17th century, astronomers have observed sunspots on a regular basis. These are regions on the solar surface where the energy supply from the solar interior is reduced owing to the strong magnetic fields that they harbour. As a consequence, sunspots are cooler by about 1,500 degrees and appear dark in comparison to their non-magnetic surroundings at an average temperature of 5,800 degrees. The number of sunspots visible on the solar surface varies with the 11-year activity cycle of the Sun, which is modulated by long-term variations. For example, there were almost no sunspots seen during the second half of the 17th century.\n For many studies concerning the origin of solar activity and its potential effect on long-term variations of Earth&#39;s climate, the interval of time since the year 1610, for which systematic records of sunspots exist, is much too short. For earlier times the level of solar activity must be derived from other data. Such information is stored on Earth in the form of &#34;cosmogenic&#34; isotopes. These are radioactive nuclei resulting from collisions of energetic cosmic ray particles with air molecules in the upper atmosphere. One of these isotopes is C-14, radioactive carbon with a half life of 5730 years, which is well known from the C-14 method to determine the age of wooden objects. The amount of C-14 produced depends strongly on the number of cosmic ray particles that reach the atmosphere. This number, in turn, varies with the level of solar activity: during times of high activity, the solar magnetic field provides an effective shield against these energetic particles, while the intensity of the cosmic rays increases when the activity is low. Therefore, higher solar activity leads to a lower production rate of C-14, and vice versa.\n By mixing processes in the atmosphere, the C-14 produced by cosmic rays reaches the biosphere and part of it is incorporated in the biomass of trees. Some tree trunks can be recovered from below the ground thousands of years after their death and the content of C-14 stored in their tree rings can be measured. The year in which the C-14 had been incorporated is determined by comparing different trees with overlapping life spans. In this way, one can measure the production rate of C-14 backward in time over 11,400 years, right to the end of the last ice age. The research group have used these data to calculate the variation of the number of sunspots over these 11,400 years. The number of sunspots is a good measure also for the strength of the various other phenomena of solar activity.\n The method of reconstructing solar activity in the past, which describes each link in the complex chain connecting the isotope abundances with the sunspot number with consistent quantitative physical models, has been tested and gauged by comparing the historical record of directly measured sunspot numbers with earlier shorter reconstructions on the basis of the cosmogenic isotope Be-10 in the polar ice shields. The models concern the production of the isotopes by cosmic rays, the modulation of the cosmic ray flux by the interplanetary magnetic field (the open solar magnetic flux), as well as the relation between the large-scale solar magnetic field and the sunspot number. In this way, for the first time a quantitatively reliable reconstruction of the sunspot number for the whole time since the end of the last ice age could be obtained.\n  Because the brightness of the Sun varies slightly with solar activity, the new reconstruction indicates also that the Sun shines somewhat brighter today than in the 8,000 years before. Whether this effect could have provided a significant contribution to the global warming of the Earth during the last century is an open question. The researchers around Sami K. Solanki stress the fact that solar activity has remained on a roughly constant (high) level since about 1980 - apart from the variations due to the 11-year cycle - while the global temperature has experienced a strong further increase during that time. On the other hand, the rather similar trends of solar activity and terrestrial temperature during the last centuries (with the notable exception of the last 20 years) indicates that the relation between the Sun and climate remains a challenge for further research.", "posttime": "2020-10-30 07:51:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现在,sun,太阳黑子", "title": "太阳现在比过去8000年更活跃(2004年)", "title_en": "The Sun is more active now than over the last 8000 years (2004)", "transed": 1, "url": "https://www.mpg.de/research/sun-activity-high", "via": "", "real_tags": ["现在", "sun", "太阳黑子"]}, {"category": "", "categoryclass": "", "imagename": "3772c2ba59e74172aae5686420d7b71a.jpg", "infoid": 1032186, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加入我的频道，成为会员，通过PATREON：https://www.youtube.com/channel/UCjr2bPAyPV7t35MvcgT3W8Q/join享受优惠和支持我：https://www.patr...", "note_en": "Join my channel and become a member to enjoy perks https://www.youtube.com/channel/UCjr2bPAyPV7t35MvcgT3W8Q/join Support me through Patreon: https://www.patr...", "posttime": "2020-10-30 07:46:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,监听,listening,https", "title": "你的手机在监听你--超声波跨设备跟踪[视频]", "title_en": "Your phone is LISTENING to you – ultrasonic cross-device tracking [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=j1FfVK6sj4I", "via": "", "real_tags": ["手机", "监听", "listening", "https"]}, {"category": "", "categoryclass": "", "imagename": "fcdf681fe29ab922c7c9966d607f9ba0.jpg", "infoid": 1032185, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FSD选项已经作为一个可选的附加功能提供，以补充特斯拉的Autopilot驾驶员辅助技术，尽管在本月测试版发布之前，这些功能本身还没有提供给特斯拉的车主。尽管如此，这只是一个有限的测试版，但这是马斯克和特斯拉最接近实际推出的FSD绰号下的东西--在特斯拉生产特斯拉多年后，他们一直在戏弄一种完全自动的模式。\n尽管名为FSD，但根据SAE International定义的标准，FSD并不是业内大多数人所定义的完全、4级或5级自主，也不是大多数从事自动驾驶工作的人所接受的标准。马斯克将其设计为具有“自动驾驶能力，但有时需要监督和干预”的车辆，而根据SAE标准，4级和5级(通常被认为是“真正的自动驾驶”)不需要司机干预。\n尽管如此，根据早期用户的反馈，这项技术在某些方面确实令人印象深刻-尽管在没有公众监督的情况下测试任何类型的自动驾驶软件似乎确实是一个令人难以置信的冒险举动。马斯克曾表示，在年底之前，我们应该会看到FSD技术在测试版之后广泛推出，所以他似乎对其性能绝对有信心。\n提价可能是他和公司信心的另一个迹象。马斯克一直坚称，用户通过提前向特斯拉交纳资金来获得折扣，以帮助其开发稍后到来的技术，因此从许多方面来看，现在涨价是有道理的。这显然也有助于特斯拉提高利润率，尽管它的利润已经超过了分析师的收入和利润预期。", "note_en": "The FSD option has been available as an optional add-on to complement Tesla’s Autopilot driver assistance technology, even though the features themselves haven’t been available to Tesla owners before the launch of the beta this month. Even still, it’s only in limited beta, but this is the closest Musk and Tesla have come to actually launching something under the FSD moniker – after having teased a fully autonomous mode in production Teslas for years now.\n Despite its name, FSD isn’t what most in the industry would define as full, Level 4 or Level 5 autonomy per the standards defined by SAE International and accepted by most working on self-driving. Musk has designed it as vehicles having the ability “to be autonomous but requiring supervision and intervention at times,” whereas Levels 4 and 5 (often considered ‘true self-driving’) under SAE standards require no driver intervention.\n   Still, the technology does appear impressive in some ways according to early user feedback – though testing any kind of self-driving software unsupervised via the general public does seem an incredibly risky move. Musk has said that we should see a wide rollout of the FSD tech beyond the beta before year’s end, so he definitely seems confident in its performance.\n The price increase might be another sign of his and the company’s confidence. Musk has always maintained that users were getting a discount by handing money over early to Tesla in order to help it develop technology that would come later, so in many ways it makes sense that the price increase comes now. This also obviously helps Tesla boost margins, though it’s already riding high on earning that beat both revenue and profit expectations from analysts.", "posttime": "2020-10-30 07:30:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,驾驶,increased,fsd", "title": "\n特斯拉已将其“全自动驾驶”选项价格提高至1万美元", "title_en": "\n\t\t\t\tTesla has increased the price of its “Full Self-Driving” option to $10,000\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/29/tesla-has-increased-the-price-of-its-full-self-driving-option-to-10000/", "via": "", "real_tags": ["特斯拉", "驾驶", "increased", "fsd"]}, {"category": "", "categoryclass": "", "imagename": "02315de62ff35620f452b863836d0390.png", "infoid": 1032184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国国家航空航天局(NASA)的起源、光谱解释、资源识别、安全、雷神探险(OSIRIS-Rex)任务成功地装载了航天器的样本返回舱(SRC)和丰富的小行星Bennu样本。", "note_en": "NASA’s Origins, Spectral Interpretation, Resource Identification, Security, Regolith Explorer (OSIRIS-REx) mission has successfully stowed the spacecraft’s Sample Return Capsule (SRC) and its abundant sample of asteroid Bennu.", "posttime": "2020-10-30 07:30:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,美国宇航局,美国,osiris,样本", "title": "美国宇航局的OSIRIS-REX成功地储存了小行星本努的样本", "title_en": "NASA's OSIRIS-REx Successfully Stows Sample of Asteroid Bennu", "transed": 1, "url": "http://www.nasa.gov/press-release/nasa-s-osiris-rex-successfully-stows-sample-of-asteroid-bennu/", "via": "", "real_tags": ["nasa", "美国宇航局", "美国", "osiris", "样本"]}, {"category": "", "categoryclass": "", "imagename": "0e17782ebfc3a298bfec7d687c40c0a5.jpg", "infoid": 1032183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果各种服务的付费订阅量创下5.85亿的新高，该公司预计到今年年底将达到6亿。\n在苹果公司9月份的季度财报电话会议上，苹果首席财务官卢卡·马埃斯特里(Luca Maestri)表示，Apple TV+、Apple Arade和Apple Card等新服务正在为用户和服务收入的增长做出贡献。\n苹果表示，所有地区的服务在9月这个季度都达到了历史最高水平。该公司在App Store、iCloud、Apple Music、广告和支付服务等细分市场创造了新的纪录。\n与去年同期相比，苹果的付费用户数量增加了1.35亿，比去年同期增长了约25%。此外，苹果公司表示，它有望在2020年底达到并超过6亿付费用户的新增订户目标。\n苹果首席执行官蒂姆·库克也证实，其Apple One捆绑服务将于10月30日(星期五)推出，新的Apple Fitness+服务定于2020年晚些时候推出。\n在电话会议中，库克将苹果在这一细分市场的增长归功于其提供的服务数量。库克还指出，苹果对其在该领域的毛利率感到满意，目前的投资组合提供了各种利润率不同的平台。换句话说，库克坚称其服务增长是可持续的，公司对预测很有信心。\nAppleInsider与会员有合作关系，通过会员链接购买的产品可能会赚取佣金。这些合作关系不会影响我们的编辑内容。", "note_en": "Apple&#39;s number of paid subscriptions for its various Services hit a new high of 585 million, and the company expects to hit 600 million by the end of the year.\n  During the company&#39;s September quarter earnings call, Apple CFO Luca Maestri said that new services like  Apple TV+,  Apple Arcade, and  Apple Card are contributing to user and Services revenue growth.\n Services in all regions were at an all-time high during the September quarter, Apple said. The company set new records in subsegments such as the  App Store,  iCloud,  Apple Music, advertising, and payment services.\n Year-over-year, Apple&#39;s number of paid subscribers grew by 135 million, representing about 25% growth since the year-ago period. Additionally, Apple said it is on-track to &#34;reach and exceed&#34; its increased subscriber target of 600 million paid subscribers by the end of calendar year 2020.\n Apple CEO  Tim Cook also confirmed that its  Apple One bundled services will launch on Friday, Oct. 30, with a launch of the new  Apple Fitness+ service slated for later in 2020.\n During the call, Cook attributed Apple&#39;s growth in the segment to the number of services it has available. Cook also noted that Apple is pleased with its gross margins in the area, and that its current portfolio offers various platforms with different margin profiles. In other words, Cook maintained that its services growth is sustainable, and the company is &#34;quite confident about projection.&#34;\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2020-10-30 07:29:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,apple,苹果,达到,track", "title": "苹果报告称，第四季度其服务的付费订阅量创历史新高，达到5.85亿，同比增长1.35亿，预计到2020年底将达到6亿", "title_en": "Apple reports an all-time high of 585M paid subscriptions for its services in Q4, growing by 135M YoY, on track to reach 600M by the end of 2020", "transed": 1, "url": "https://appleinsider.com/articles/20/10/29/apples-services-now-have-585m-paid-subscribers-on-track-to-hit-600m-by-end-of-2020", "via": "", "real_tags": ["2020", "apple", "苹果", "达到", "track"]}, {"category": "", "categoryclass": "", "imagename": "d6122541b4df9d83c82e2cd6f53a583e.jpg", "infoid": 1032181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "土星的卫星土卫六已经很奇怪了，现在又变得有点怪异了。天文学家在其大气中检测到环丙烯(C3H2)，这是一种极其罕见的碳基分子，活性极强，只能在实验室条件下存在于地球上。\n事实上，它非常罕见，以前从未在大气层、太阳系或其他地方检测到过。唯一能保持稳定的另一个地方是星际空间的冷空洞。但它可能是更复杂的有机分子的基石，有一天可能会导致生命。\n美国宇航局戈达德太空飞行中心的天体生物学家梅丽莎·特纳(Melissa Traer)说，我们认为泰坦是一个现实生活中的实验室，在那里我们可以看到类似于生命在这里生存的古代地球的化学物质。她是即将于2027年发射的蜻蜓任务中调查月球的首席科学家之一。\n我们将寻找比C3H2更大的分子，但我们需要知道大气中发生了什么，才能理解导致复杂有机分子形成并降落到地表的化学反应。\n环丙烯--甚至连NASA的研究人员都将其描述为一种非常奇怪的小分子--在大气条件下往往不会持续很长时间，因为它很容易快速地与其他分子反应，形成其他化合物。\n一旦它这样做了，它就不再是环丙烯了。在星际空间中，任何气体或尘埃通常都很冷，而且非常弥散，这意味着化合物不会有太多相互作用，环丙烯可以在周围徘徊。\n泰坦与星际空间非常不同。它有点潮湿，有碳氢化合物湖，碳氢化合物云，以及以氮气为主的大气，还有一点甲烷。大气层的厚度是地球大气层(也主要是氮气)的四倍。科学家们认为，在地表之下有一片巨大的咸水海洋。\n2016年，由美国宇航局戈达德太空飞行中心的行星科学家康纳·尼克松领导的一个团队利用位于智利的阿塔卡马大毫米/亚毫米阵列(ALMA)探测月球大气层，寻找有机分子。\n正是在地表上方稀薄的高层大气中，他们探测到了一种未知的化学特征。通过将其与化学特征数据库进行比较，研究小组确定该分子为环丙烯亚甲基。这种高度的大气稀薄很可能有助于该分子的存活，但为什么它会出现在泰坦上，而没有出现在其他世界，这是一个谜。\n当我意识到我看到的是环丙烯时，我的第一个想法是，嗯，这真的是意想不到的，尼克松说。泰坦在我们的太阳系中是独一无二的。事实证明，它是新分子的宝库。\n环丙烯是特别令人感兴趣的，因为它是众所周知的环分子；它的三个碳原子连接成一个环(嗯，是三角形，但原理是一样的)。虽然环丙烯本身并不具有生物学作用，但DNA和RNA的碱基都是基于这样的分子环。\n美国宇航局戈达德太空飞行中心的天体生物学家亚历山大·塞伦说，它们的循环性质开启了这一额外的化学分支，使你能够构建这些具有生物重要性的分子。\n分子越小，它的潜力就越大--涉及更小分子和更少键的反应预计会比涉及更大、更复杂分子的反应发生得更快。这意味着涉及更小分子的反应，纯粹通过数字，预计会产生更多样化的结果。\n以前，苯(C6H6)被认为是在任何大气(包括泰坦)中发现的最小的碳氢环分子。环丙烯亚甲基被打败了。\n泰坦已经是有机化学活动的聚集地。氮气和甲烷在阳光下分解，引发一连串的化学反应。这些反应是否会导致生命是科学家们迫切想要回答的问题。\n美国宇航局喷气推进实验室的地质学家罗莎莉·洛佩斯说，我们正在努力弄清楚泰坦是否适合居住。因此，我们想知道大气中的哪些化合物到达了地表，然后，这些物质是否能穿过冰壳到达下面的海洋，因为我们认为海洋是适宜居住的条件所在。\n在这一研究过程中，找出大气中存在哪些化合物是非常重要的一步。环丙烯可能很小，而且很奇怪，但这种极其罕见的分子可能是泰坦化学之谜的关键部分。现在我们只需要弄清楚它是如何适应的。", "note_en": "Titan, the already pretty weird moon of Saturn, just got a little bit weirder. Astronomers have detected cyclopropenylidene (C3H2) in its atmosphere - an extremely rare carbon-based molecule that&#39;s so reactive, it can only exist on Earth in laboratory conditions.\n   In fact, it&#39;s so rare that it has never before been detected in an atmosphere, in the Solar System or elsewhere. The only other place it can remain stable is the cold void of interstellar space. But it may be a building block for more complex organic molecules that could one day lead to life.\n &#34;We think of Titan as a real-life laboratory where we can see similar chemistry to that of ancient Earth when life was taking hold here,&#34;  said astrobiologist Melissa Trainer of NASA&#39;s Goddard Space Flight Center, one of the chief scientists set to investigate the moon in the upcoming Dragonfly mission launching in 2027.\n &#34;We&#39;ll be looking for bigger molecules than C3H2, but we need to know what&#39;s happening in the atmosphere to understand the chemical reactions that lead complex organic molecules to form and rain down to the surface.&#34;\n Cyclopropenylidene – which even NASA researchers  describe as a &#34;very weird little molecule&#34; – doesn&#39;t tend to last long in atmospheric conditions, because it reacts very quickly and easily with other molecules, forming other compounds.\n   Once it does so, it&#39;s no longer cyclopropenylidene. In interstellar space, any gas or dust is usually very cold, and very diffuse, which means compounds aren&#39;t interacting much, and cyclopropenylidene can hang around.\n Titan is very different from interstellar space. It&#39;s sort of soggy, with  hydrocarbon lakes,  hydrocarbon clouds, and a predominantly  nitrogen atmosphere, with a bit of methane. The atmosphere is four times thicker than Earth&#39;s atmosphere (which is also  dominated by nitrogen). Under the surface, scientists think there&#39;s a  huge ocean of salt water.\n In 2016, a team led by planetary scientist Conor Nixon of NASA&#39;s Goddard Space Flight Centre used the Atacama Large Millimeter/submillimeter Array (ALMA) in Chile to probe the moon&#39;s atmosphere, looking for organic molecules.\n It was in the tenuous upper atmosphere, high above the surface, where they detected an unknown chemical signature. By comparing it to a database of chemical profiles, the team identified the molecule as cyclopropenylidene. It&#39;s likely that the thinness of the atmosphere at that altitude contributes to the molecule&#39;s survival, but why it appears on Titan and no other world is a mystery.\n   &#34;When I realised I was looking at cyclopropenylidene, my first thought was, &#39;Well, this is really unexpected,&#39;&#34;  Nixon said. &#34;Titan is unique in our Solar System. It has proved to be a treasure trove of new molecules.&#34;\n Cyclopropenylidene is of particular interest because it&#39;s what is known as a ring molecule; its three carbon atoms are linked together in a ring (well, a triangle, but the principle is the same). Although cyclopropenylidene itself is not known to play a biological role, the nucleobases of DNA and RNA are based on such molecular rings.\n &#34;The cyclic nature of them opens up this extra branch of chemistry that allows you to build these biologically important molecules,&#34;  said astrobiologist Alexander Thelen of NASA&#39;s Goddard Space Flight Centre.\n The smaller the molecule, the more potential it has - reactions involving smaller molecules with fewer bonds are expected to happen faster than reactions involving larger, more complicated molecules. That means reactions involving smaller molecules, purely through numbers, are expected to result in a more diverse range of outcomes.\n Previously, benzene (C6H6) was thought to be the smallest hydrocarbon ring molecule found in any atmosphere (including Titan&#39;s). Cyclopropenylidene has it beat.\n Titan is already a hive of organic chemical activity. The nitrogen and methane break up in the sunlight,  triggering a cascade of chemical reactions. Whether those reactions could result in life is a question scientists are dying to answer.\n &#34;We&#39;re trying to figure out if Titan is habitable,&#34;  said geologist Rosaly Lopes of NASA&#39;s Jet Propulsion Laboratory. &#34;So we want to know what compounds from the atmosphere get to the surface, and then, whether that material can get through the ice crust to the ocean below, because we think the ocean is where the habitable conditions are.&#34;\n Working out which compounds are present in the atmosphere is a very important step in that research process. Cyclopropenylidene may be small, and strange, but this extremely rare molecule could be a key piece of the Titan chemistry puzzle. Now we just have to figure out how it fits in.", "posttime": "2020-10-30 07:21:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "奇怪,molecule,分子", "title": "在土卫六上探测到的“奇怪”分子从未在任何大气中被发现", "title_en": "'Weird' Molecule Detected on Titan Has Never Been Found in Any Atmosphere", "transed": 1, "url": "https://www.sciencealert.com/scientists-have-just-found-a-really-bizarre-molecule-in-titan-s-atmosphere", "via": "", "real_tags": ["奇怪", "molecule", "分子"]}, {"category": "", "categoryclass": "", "imagename": "f651525e9d98a72eb0f9e1f54581c010.png", "infoid": 1032178, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "支持安全、聪明、真实的新闻报道。注册我们的Axios AM&Amp；PM时事通讯，变得更聪明、更快。\n支持安全、聪明、真实的新闻报道。注册我们的Axios AM&Amp；PM时事通讯，变得更聪明、更快。\n\nTwitter首席执行官杰克·多尔西(Jack Dorsey)在周三的听证会上回答共和党参议员特德·克鲁兹(Ted Cruz)的提问时说，Twitter没有能力影响选举，因为有充足的额外信息来源。\n字里行间：这一说法肯定会激起左翼和右翼的愤怒。保守派辩称，Twitter和Facebook的温和决策有助于民主党人，而自由派则认为，这些平台不愿有效地打击错误信息，以安抚共和党人。\n推动新闻：多尔西将与Facebook首席执行官马克·扎克伯格和谷歌首席执行官桑达尔·皮查伊一起，就《通信体面法案》(Communications Decency Act)第230条远程作证。这部备受讨论的法律允许科技平台对内容进行审查，而不会对此承担法律责任。\n倒叙：2016年总统大选后不久，扎克伯格说，在外国演员试图利用Twitter、谷歌和Facebook干预选举的消息曝光之前，认为Facebook可以影响选举的想法是疯狂的。\n事实核查：克鲁兹一直在抨击Twitter关于限制“纽约邮报”(New York Post)对亨特·拜登(Hunter Biden)有争议的报道的决定，并利用他在听证会上的提问时间斥责了多尔西。他还在听证会前明确表示，他正在寻找打架的机会。\n该死的是谁选了你，让你负责允许媒体报道什么？&#34；克鲁兹问多尔西。多尔西说，当用户注册Twitter时，他们同意Twitter的服务条款。\n多尔西说，推特不会影响选举，因为人们可以选择使用其他通信渠道。", "note_en": "Support safe, smart, REAL journalism. Sign up for our Axios AM &amp; PM newsletters and get smarter, faster.\n Support safe, smart, REAL journalism. Sign up for our Axios AM &amp; PM newsletters and get smarter, faster.\n \n   Twitter CEO Jack Dorsey said Twitter does not have the ability to influence elections because there are ample additional sources of information, in response to questioning from Republican Sen. Ted Cruz during a hearing Wednesday.\n Between the lines: The claim is sure to stir irritation on both the right and left. Conservatives argue Twitter and Facebook&#39;s moderation decisions help Democrats, while liberals contend the platforms shy from effectively cracking down on misinformation to appease Republicans.\n Driving the news: Dorsey is testifying remotely alongside Facebook CEO Mark Zuckerberg and Google CEO Sundar Pichai on Section 230 of the Communications Decency Act, the much-discussed law that allows tech platforms to moderate content and not be held legally liable for it.\n Flashback: Shortly after the 2016 presidential election, Zuckerberg said it was &#34;crazy&#34; to think Facebook could sway an election, before revelations emerged that foreign actors attempted to meddle in the election using Twitter, Google and Facebook.\n Reality check: Cruz has been hammering Twitter for its decisions around limiting access to the New York Post&#39;s controversial coverage of Hunter Biden, and used his questioning time at the hearing to berate Dorsey. He also made clear prior to the hearing he was  looking for a fight.\n &#34;Who the hell elected you and put you in charge of what the media are allowed to report?&#34; Cruz asked Dorsey. Dorsey said when users sign up for Twitter, they agree to its terms of service.\n Dorsey said Twitter does not influence elections because people have the choice of using other communications channels.", "posttime": "2020-10-30 07:01:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,dorsey,twitter", "title": "杰克·多尔西：推特对选举没有影响", "title_en": "Jack Dorsey: Twitter has no influence over elections", "transed": 1, "url": "https://www.axios.com/jack-dorsey-twitter-has-no-influence-over-elections-351bd1b6-3326-451b-9b19-4d2cf5c3deec.html", "via": "", "real_tags": ["推特", "dorsey", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "ee12a554c07336b3cffa2a0e13af838f.jpg", "infoid": 1032177, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于那些需要从模拟信号转换为数字信号的项目，而所使用的微控制器没有这种功能，有这种类型的模块ADS1115是很有趣的，它可以提供这种16位精度的ADC转换功能。\n此外，即使您的项目使用的微控制器具有这样的功能，但是您需要其他功能，这种电子元件对于扩展转换功能也可能很有意义。\n基波信号转换器有两种类型，但也有其他芯片能够同时进行这两种类型的转换。它们是：\nCAD(模数转换器)或ADC(模数转换器)：是一种将模拟信号转换为数字信号的设备。为此，您可以使用对模拟信号进行编码的二进制代码。例如，将二进制值与特定电压或电流值相关联。例如，4位分辨率可以从0000到1111，并且可以分别对应于0v和12v。不过，如果使用符号位，则可以测量负值和正值。\nCDA(数模转换器)或DAC(数模转换器)：它是一种与上述相反的设备，即将二进制数据转换为模拟电流或电压信号。\n使用这些转换器，可以从一种类型的信号传递到另一种类型的信号，如您将在ADS1115的情况下看到的，这将对应于第一种情况。\nADS1115是一个信号转换模块。它所做的就是将模拟转换成数字。您可能认为Arduino开发板本身已经包括内部ADC，以便在使用模拟输入时能够执行此任务，并且它们可以与微控制器信号兼容。\n是的，没错，他们在UNO，Mini和Nano中有6个10位分辨率的ADC。但是使用ADS1115，您可以添加另一个16位分辨率的内核，该分辨率高于Arduino内核，另外您还可以释放Arduino外壳。其中15位用于测量，最后一位用于模拟信号的符号，因为如您所知，模拟信号可以是负的也可以是正的。\n此外，此模块还提供了使其非常易于使用所需的一切。要将它连接到您的Arduino，您可以使用I2C，因此非常简单。它甚至包括一个标有ADDR的引脚，您可以使用该引脚从4个可用于此组件的地址中选择一个地址。\n另一方面，您必须了解ADS1115有两种测量模式，一种是差动测量模式，另一种是单端测量模式：\n差分：它每次测量使用两个ADC，将通道数量减少到2个，但它带来了一个明显的优势，那就是它可以测量负电压，而且不容易受到噪声的影响。\n单端：它有四个通道，因为它不像前一个情况那样同时使用这两个通道。每个通道均为15位。\n除这些模式外，它还包括比较器模式，在该模式下，当任何通道超过可在草图源代码中配置的阈值时，通过ALRT引脚生成警报。\n如果您想进行5V以下的测量，但精度更高，您应该知道ADS1115有一个PGA，可以将电压增益从6.144V调整到0.256V。请始终记住，在任何情况下都可以测量的最大电压将是使用的电源电压(5V)。\n如果您想查看ADS1115的所有技术细节，以了解其在电子级别的限制，或根据制造商的建议可以在哪些条件下工作，您可以使用网络上提供的数据手册。例如，您可以从TI(德州仪器)下载此文件。\n对于引脚和连接，我之前已经对ALRT信号做了一些评论，其中还包括关于ADDR的内容。但它有其他引脚，您也必须知道正确的集成与您的Arduino板或任何其他情况。ADS1115模块中提供的引脚为：VDD：2V至5.5V电源。您可以通过从Arduino主板将其连接到5V来为其供电。\nSCL和SDA：I2C的通信引脚。在这种情况下，它们应该根据您的Arduino型号使用合适的针脚。\n地址：转向销。默认情况下，它连接到GND，地址为0x48，但您可以选择其他地址：\n如果您想使用单端，您可以将想要测量的模拟电流或电压连接在GND和可用的4个模拟引脚之一之间。\n作为差分读取模式情况下的连接示例，您可以看到上图。它串联使用1.5节电池，在这种情况下，在A0和A1之间增加3V的电压，这样Arduino板就可以通过I2C测量每个时刻的电压值。显然，您可以使用任何其他信号来测量，在本例中是电池，但它可以是任何您想要的…。\n如果您想购买ADS1115，您应该知道您已经准备好以相当便宜的价格与Arduino集成的模块。你可以在许多电子产品商店里找到它们，也可以在eBay、Aliexpress和亚马逊上找到。例如：\n要开始，首先在Arduino IDE中安装相应的库。要做到这一点，你可以使用最著名的，Adafruit。为此，您可以执行以下步骤：\n现在您已经准备好开始了，您可以访问安装库的代码或以下网址提供的示例。\n在这些示例中，您将看到比较器模式、差分模式和单端模式。您可以查看示例以开始使用它们，并根据需要修改它们或编写更复杂的代码。欲了解更多信息，我推荐我们的PDF格式免费入门课程。", "note_en": "For those projects where a conversion from analog to digital signal is needed, and the microcontroller used does not have this capability, it is interesting to have this type of   module ADS1115, which provides this ADC conversion capability with 16-bit accuracy.\n Furthermore, this electronic component may also be interesting to extend the   conversion capabilities, even if the microcontroller you are using for your project has such capability but you need something else.\n   There are two types of fundamental signal converters, but there are also other chips capable of doing both types of conversion at the same time. These are:\n CAD (Analog to Digital Converter) or ADC (Analog to Digital Converter): is a type of device that converts the analog signal into a digital signal. To do this, you can use a binary code that encodes the analog signal. For example, associating a binary value to a specific voltage or current value. For example, with 4-bit resolution can go from 0000 to 1111, and could correspond to 0v and 12v respectively. Although if you use a sign bit you can measure negative and positive values.\n CDA (Digital-to-Analog Converter) or DAC (Digital-to-Analog Converter): it is a device that does the opposite to the above, that is, it transforms binary data into an analog current or voltage signal.\n  With these converters it is possible to pass from one type of signal to another, as you will see in the case of the  ADS1115, which would correspond to the first case.\n   The ADS1115 is a signal converter module. What it does is  convert from analogue to digital. You may think that the  Arduino development board itself already includes internal ADCs to be able to do this task when using the analog inputs and that they can be compatible with the microcontroller signals.\n Yes, that’s right, they have 6 10-bit resolution ADCs in the UNO, Mini and  Nano. But with the ADS1115 you add another one with a 16-bit resolution, higher than the Arduino one, plus you can free the Arduino shell. Fifteen of them are for the measurement and one last bit for the sign of the analog signal, because as you know, the analog signal can be negative or positive.\n In addition, this module provides everything you need to make it very simple to use. To connect it to your Arduino you can  use the I2C , so   is really simple. It even includes a pin marked ADDR with which you can select one of the 4 addresses available for this component.\n On the other hand, you have to understand that the ADS1115 has two measurement modes, one is  the differential and the other the single ended:\n Differential: it uses two ADCs for each measurement, reducing the number of channels to 2, but it brings a clear advantage, which is that it can measure negative voltages and is not as vulnerable to noise.\n Single ended: it has four channels as it does not use both as in the previous case. Each of the channels is 15-bit.\n Besides those modes, it includes a comparator mode in which an alert is generated through the  ALRT pin when any of the channels exceeds a threshold value that can be configured in the source code of the sketch.\n If you want to make   measurements below 5v, but with higher accuracies, you should know that the ADS1115 has a PGA that can adjust the voltage gain from 6.144v to 0.256v. Always keeping in mind that the maximum voltage that can be measured in any case will be the supply voltage used (5v).\n  If you want to see all the technical details of the ADS1115 to know its limits at the electronic level or the conditions under which it can work according to the manufacturer’s recommendations, you can use the datasheets that you can find on the network. For example, you can download this from  TI (Texas Instruments)\n For   the pinout and connection, previously I have already commented something about the ALRT signal that includes also about ADDR. But it has other pins that you must also know for a correct integration with your Arduino board or for any other case. The pins available in the ADS1115 module are:VDD: 2v to 5.5v power supply. You can power it by connecting it to 5v from your Arduino board.\n SCL and SDA: communication pins for the I2C. In this case they should go to the appropriate pins according to your Arduino model.\n ADDR: steering pin. By default it is connected to GND, which results in the address 0x48, but you can choose other addresses:\n  If you want to use  single end you can connect the analog current or voltage you want to measure between GND and one of the 4 analog pins available.\n As an example of connection in the case of  a differential reading mode, you can see the previous image. In it, batteries of 1.5 are used in series, adding 3v that are connected between A0 and A1 in this case so that the Arduino board can measure through the  I2C the values obtained of voltage in each moment. Obviously, you can use any other signal to measure, in this case it is a battery, but it can be whatever you want…\n   If you want to buy the ADS1115, you should know that you have modules ready to integrate with Arduino for quite cheap prices. You can find them in many electronics stores, as well as on eBay, Aliexpress and Amazon. For example:\n    To start, first install the corresponding library in your Arduino IDE. To do this, you can use the most famous one,  Adafruit. To do this, you can follow these steps:\n  Now you are ready to start, you can access the code of the installed library or the examples available at\n  Among the examples you will see both for the  comparator mode, differential mode and single end mode. You can see the examples to start using them and modify them according to your needs or write more complex code. For more information, I recommend our free introduction course in PDF.", "posttime": "2020-10-30 07:01:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "arduino,analog", "title": "ADS1115：Arduino模数转换器", "title_en": "ADS1115: Analog-to-Digital Converter for Arduino", "transed": 1, "url": "https://www.oshardware.net/ads1115/", "via": "", "real_tags": ["arduino", "analog"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032176, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：Hittmeir最近提出了一个确定性算法，该算法可证明在$N^{2/9+o(1)}$位运算中计算正整数$N$的素因式分解。在这一突破之前，这个问题最广为人知的复杂性界限是$N^{1/4+o(1)}$，这一结果可以追溯到20世纪70年代。在这篇文章中，我们进一步推广了Hittmeir的技术，得到了一个严格的、确定性的分解算法，其复杂度为$N^{1/5+o(1)}$。\nArxivLabs是一个框架，允许合作者直接在我们的网站上开发和共享新的arxiv功能。\n与arxivLabs合作的个人和组织都接受并接受了我们开放、社区、卓越和用户数据隐私的价值观。Arxiv致力于这些价值观，只与坚持这些价值观的合作伙伴合作。\n你有一个为arxiv&39；社区增加价值的项目的想法吗？了解有关arxivLabs的更多信息以及如何参与其中。\n书目工具代码推荐器", "note_en": "Download PDF  Abstract: Hittmeir recently presented a deterministic algorithm that provably computesthe prime factorisation of a positive integer $N$ in $N^{2/9+o(1)}$ bitoperations. Prior to this breakthrough, the best known complexity bound forthis problem was $N^{1/4+o(1)}$, a result going back to the 1970s. In thispaper we push Hittmeir&#39;s techniques further, obtaining a rigorous,deterministic factoring algorithm with complexity $N^{1/5+o(1)}$.\n      About arXivLabs   arXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\n  Both individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\n  Have an idea for a project that will add value for arXiv&#39;s community?   Learn more about arXivLabs and   how to get involved.\n    Bibliographic Tools      Code      Recommenders", "posttime": "2020-10-30 07:01:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,整数,algorithm", "title": "确定性整数因式分解的指数五分之一算法", "title_en": "An exponent one-fifth algorithm for deterministic integer factorisation", "transed": 1, "url": "https://arxiv.org/abs/2010.05450", "via": "", "real_tags": ["算法", "整数", "algorithm"]}, {"category": "", "categoryclass": "", "imagename": "4168dbe01951eea0dee72563ed55f316.jpg", "infoid": 1032175, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "海盗船游戏公司今天宣布，它已经收购了iOS同名软件背后的软件开发商EPocCam。很容易理解为什么这家游戏公司会在2020年对这样的收购感兴趣。新冠肺炎的大流行导致了全球远程工作的激增-因此，比以往任何时候都有更多的人参加电话会议。\nEPocCam应用程序是专门为将iPad和iPhone转变为MacOS和Windows PC的网络摄像头而设计的。这款软件可以在许多流行的电话会议应用程序上运行，包括Zoom、Skype、Google Meet和微软团队--这比我目前运行的Beta网络摄像头软件要好得多。\n这笔交易将EPocCam品牌纳入海盗船的埃尔加托(Elgato)保护伞下。早在2018年年中，海盗船就收购了该公司的游戏品牌。这笔交易反过来又发现埃尔加托的其他公司重新命名了其Eve系统-一家明确专注于智能家居和家庭自动化的公司。\n虽然大多数笔记本电脑和台式机在内置网络摄像头方面都相当缺乏，但iPhone已经取得了长足的进步。因此，用户利用这种成像能力是有意义的。当然，随着该公司现在归一个游戏品牌所有，很明显，视频游戏直播将成为这里价值发挥的重要组成部分。\n这款应用程序已经在Elgato品牌下重新发布，包括与现有产品的更深层次整合。该公司承诺，进一步的更新“已经在开发中”。", "note_en": "Corsair   Gaming  today announced that it has acquired EpocCam, the software developer behind the iOS software of the same name. It’s easy to see why the gaming company would be interested in such an acquisition in 2020. The COVID-19 pandemic has lead to a worldwide spike in remote working — and, as a result, more people are teleconferencing than ever.\n The EpocCam app is designed specifically to turn iPads and iPhones into a webcam for both macOS and Windows PCs. The software works across a number of popular teleconferencing applications, including Zoom, Skype, Google Meet and Microsoft Teams — which is more than I can say for the beta webcam software I’m currently running.\n The deal brings the EpocCam brand under Corsair’s Elgato umbrella. Corsair purchased the company’s gaming brand back in mid-2018. That deal, in turn, found the rest of Elgato rebranding its Eve System — a company expressly focused on smart home and home automation.\n  While most laptops and desktops are fairly lacking in the built-in webcam department, iPhones have taken great strides. So it makes sense for users to take advantage of that imaging power. Of course, with the company now owned by a gaming brand, it’s clear that video game live-streaming is going to be a big part of the value play here.\n The app has already been relaunched under the Elgato brand, including deeper integration with its existing products. The company promises that further updates are “already in development.”", "posttime": "2020-10-30 06:40:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,收购,acquires", "title": "\n海盗船收购iPhone网络摄像头应用EPocCam", "title_en": "\n\t\t\t\tCorsair acquires EpocCam, a webcam app for iPhone\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/29/corsair-acquires-epoccam-a-webcam-app-for-iphone/", "via": "", "real_tags": ["iphone", "收购", "acquires"]}, {"category": "", "categoryclass": "", "imagename": "04336532d1b51bf7c735c5b1333b7293.jpeg", "infoid": 1032173, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook在冠状病毒大流行开始时看到的增长激增似乎正在放缓。Facebook作为第三季度收益的一部分报告称，该公司最有利可图的广告市场-加拿大的美国用户增长已经下降。\n该公司目前在北美拥有1.96亿用户，略低于上一季度的1.98亿。该公司在一份声明中表示，下降是意料之中的，可能会持续到今年年底。\n脸书在一份新闻稿中写道：“不出所料，2020年第三季度，我们看到美国和加拿大的脸书DAU和MAU比2020年第二季度略有下降，而由于新冠肺炎疫情的影响，这两个水平都有所上升。”“我们预计，2020年第四季度，这一趋势将持续下去，与2020年第三季度相比，美国和加拿大的DAU和MAU数量将持平或略有下降。”\nFacebook本季度在美国流失的用户+公司预计，随着人们重新开始更多地使用后COVID pic.twitter.com/fWPn2b60zc，它接下来将失去更多用户。\n-Karissa Bell(@karissabe)2020年10月29日。\n该公司此前报告称，由于广泛的冠状病毒关闭，今年年初的增长大幅飙升。然而，Facebook并没有在所有地方都看到同样的放缓，这家社交网络在亚洲和“世界其他”市场继续增加新用户。该公司还继续兜售其“应用系列”指标，这些指标结合了Facebook、Instagram、WhatsApp和Messenger。根据该公司的数据，这一数字在9月份上升到25.4亿“每日活跃人数”。\n经济放缓似乎也没有影响Facebook的营收，该季度营收高达214亿美元，较去年增长22%，好于分析师对该公司的预期。Facebook上季度公布的广告收入超过180亿美元，尽管广告商进行了广泛的抵制。", "note_en": "The surge in growth Facebook saw at the start of the coronavirus pandemic appears to be slowing down. User growth in the United States in Canada — the company’s most lucrative ad market — has declined, Facebook reported as part of its  third-quarter earnings.\n The company now has 196 million users in North America, down slightly from 198 million last quarter. In a statement, the company said the decrease was expected, and could continue through the end of the year.\n  “As expected, in the third quarter of 2020, we saw Facebook DAUs and MAUs in the US &amp; Canada decline slightly from the second quarter 2020 levels which were elevated due to the impact of the COVID-19 pandemic,” Facebook wrote in a  press release. “In the fourth quarter of 2020, we expect this trend to continue and that the number of DAUs and MAUs in the US &amp; Canada will be flat or slightly down compared to the third quarter of 2020.”\n   Facebook lost users in the US this quarter + company expects it will lose more next as people get back to more &#34;normal&#34; use post-COVID  pic.twitter.com/fWPn2b60zc\n— Karissa Bell (@karissabe)  October 29, 2020\n  The company had previously reported a large  surge in growth at the start of the year due to widespread coronavirus lockdowns. Facebook isn’t seeing the same slowdown everywhere, though, and the social network is continuing to add new users in Asia and its “rest of world” markets. The company also continued to tout its “family of apps” metrics, which combines Facebook, Instagram, WhatsApp and Messenger. That number rose to 2.54 billion “daily active people” in September, according to the company.\n The slowdown also doesn’t seem to have affected Facebook’s revenue, which was up to $21.4 billion for the quarter, an increase of 22 percent from last year and better than analyst expectations for the company. Facebook reported more than $18 billion in ad revenue  last quarter, despite a well-publicized advertiser boycott.", "posttime": "2020-10-30 06:35:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,美国,losing", "title": "Facebook正在失去美国和加拿大的用户", "title_en": "Facebook is losing users in the US and Canada", "transed": 1, "url": "https://www.engadget.com/facebook-q3-2020-earnings-204642328.html", "via": "", "real_tags": ["facebook", "美国", "losing"]}, {"category": "", "categoryclass": "", "imagename": "8e14106858486c437024bab167895bd9.jpg", "infoid": 1032172, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于一位开源开发者的努力，在Linux系统上玩Windows游戏将变得更加容易和更具包容性。\n总部位于剑桥的Collabora专门从事开源咨询和开发，并一直在努力改进Linux内核，以在Valve的要求下更好地支持游戏，Valve一直是这项工作的赞助商。\n虽然Linux上的游戏在过去几年中取得了很大的进步，但绝大多数游戏仍然是专门为Windows开发的。Valve将这个仅限Windows的游戏生态系统引入Linux的方法是通过仿真。\n为此，它开发了一个名为Proton的开源工具(派生自开源Wine兼容层)，它允许纯Windows游戏在Linux上运行，而没有任何明显的性能损失。\n来自Collabora的加布里埃尔·克里斯曼·伯塔齐(Gabriel Krisman Bertazi)在最近举行的开源峰会“欧洲2020”(Europe 2020)上发表讲话，谈到了Linux游戏的现状。\n在他的演讲中，Gabriel谈到了Collabora一直在做的所有工作，以满足Valve的要求，通过Steam play进一步改善对Linux上Windows游戏的支持(通过Proton)。\n最大的缺失之一是对反作弊机制的支持，这会导致相当多的Windows游戏无法加载到Linux上。Gabriel讨论了Collabora用来消除这一障碍的各种策略，以及他希望他们在这方面的工作如何进入Linux Kernel 5.11。\n虽然Gabriel的演讲是针对开发人员的，但它显示了Valve在改进Linux游戏方面的积极意图。除了Collabora之外，这家广受欢迎的游戏开发商和发行商还在与CodeWeavers和其他开发商合作，以改进Linux图形堆栈。", "note_en": "Playing Windows games on  Linux systems is set to get much easier and more inclusive due to the efforts of one open-source developer.\n  Cambridge-based Collabora specializes in open source consultancy and development, and has been working to improve the Linux kernel to better support gaming on the behest of Valve, who has been sponsoring the work.\n  While gaming on Linux has made major positive strides in the last few years, a vast majority of games still continue to be developed exclusively for Windows. Valve’s approach to bring this Windows-only gaming ecosystem to Linux is through emulation.\n   To that end it has developed an open source tool called Proton (forked from the open source Wine compatibility layer), which allows Windows-only games to run atop Linux, without any noticeable performance penalties.\n  Speaking at the recent Open Source Summit, Europe 2020, being held virtually for the first time, Gabriel Krisman Bertazi from Collabora talked about the &#34;State of Linux Gaming&#34;.\n  During his presentation Gabriel talked about all the work Collabora has been doing to fulfill Valve&#39;s requirements to further improve support for Windows games on Linux with Steam Play (via Proton).\n One of the big missing pieces of the puzzle is support for anti-cheat mechanisms, which causes quite a lot of Windows games to fail to load on Linux. Gabriel discussed the various strategies Collabora employed to remove this hurdle and how he expects their work in this regard to make its way into Linux Kernel 5.11.\n While Gabriel’s talk was aimed at developers it shows Valve’s positive intentions when it comes to improving gaming on Linux. In addition to Collabora, the popular game developer and distributor is also working with CodeWeavers and other developers to improve the Linux graphics stack.", "posttime": "2020-10-30 06:35:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,linux,gaming", "title": "Linux游戏将会变得更好", "title_en": "Linux gaming is set to get a whole lot better", "transed": 1, "url": "https://www.techradar.com/uk/news/major-improvement-for-windows-gaming-on-linux-expected-next-year", "via": "", "real_tags": ["游戏", "linux", "gaming"]}, {"category": "", "categoryclass": "", "imagename": "3aa6ac0005a0e1c24b094d3de2f3e8d0.jpg", "infoid": 1032171, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果今天在收盘后公布了第四季度的收益，这是一个有点奇怪的季度，因为与前几年(包括去年)不同的是，本季度的数据不包括iPhone的发布。IPhone12的各种型号在今年的10月和11月发货，而不是9月份。\n首席执行官蒂姆·库克在电话会议上自豪地宣布，除了iPhone之外，所有产品类别的收入都实现了两位数的同比增长，但iPhone是重要的：苹果的总收入同比仅增长了1%，而iPhone的收入下降了近21%。\n虽然iPhone并没有帮助提高利润，但苹果在此期间推出了其他产品，包括重新设计的iPad Air和两款苹果手表：Apple Watch Series 6和Apple Watch SE。IPad的收入同比大幅增长46%(总计68亿美元)，Mac的收入也很强劲，达到90亿美元，比去年同期增长了28%。\n到目前为止，苹果对服务的日益重视已经是一个家喻户晓的故事，但库克在财报电话会议上对投资者发表的讲话中继续讲述了这一点。服务同比增长16.3%，总计145.5亿美元--这比除iPhone(本季度为264.4亿美元)以外的任何其他产品类别的收入都要高。\n库克特别指出，Apple TV+这个季度表现不错。在外人看来，去年这个时候，流媒体服务的推出速度似乎很慢-特别是与大获成功的迪士尼+(Disney+)形成鲜明对比的是，迪士尼+几乎在同一时间开始服务。但库克以积极的语气谈到Apple TV+，并将这部由泰德·拉索(Ted Lasso)主演的电视剧称为显著的成功。这部由杰森·苏代基斯(Jason Sudeikis)主演的体育喜剧因其积极、振奋人心的氛围而广受好评，它可能是苹果电视(Apple TV)迄今最热门的一部--尽管苹果并没有像许多人希望的那样公布关于苹果电视+收视率的数据。\n苹果也再次拒绝为下个季度提供指导-考虑到涉及的全球不确定性，苹果和其他一些公司在整个大流行期间一直坚持这一做法。一些分析师曾认为，苹果可能会在本季度重新提供指导，但由于一些地区(包括美国)的COVID案件急剧上升，似乎还不太可能出现这种情况。\n这意味着分析师、投资者和其他观察人士不知道苹果对iPhone12和12Pro的预期会有多好。目前，本季每四款新iPhone中就有两款已经发货，所以我们将在下个季度看到这一数字--这通常是苹果最好的，正是因为有了这些新iPhone的销售。\n苹果股价在盘后交易中下跌约5%，因为一些投资者对iPad和Mac销量的激增不足以弥补iPhone的短期下跌感到失望。这就是说，苹果公布的收益与分析师对本季度的预期非常接近。", "note_en": "Apple announced its fourth-quarter earnings today after the bell, and it was something of a strange quarter because, unlike some previous years (including last year), this quarter&#39;s numbers did not include an iPhone launch. The iPhone 12&#39;s various models ship in October and November instead of September this year.\n CEO Tim Cook proudly announced double-digit YOY growth in all product categories besides iPhone on the call, but the iPhone is important: Apple&#39;s total revenue was up only 1 percent year-over-year, with iPhone revenue down almost 21 percent.\n While the iPhone didn&#39;t help push up the bottom line, Apple did launch other products during the period, including the redesigned  iPad Air and two Apple Watches: the  Apple Watch Series 6 and the Apple Watch SE. iPad revenue was up a substantial 46 percent YOY (it totaled $6.8 billion), and Mac revenue was also strong at $9 billion, or 28 percent more than the same quarter last year.\n Apple&#39;s increasing emphasis on services is a well-trodden story by this point, but it continued in Cook&#39;s remarks to investors on the earnings call. Services were up 16.3 percent year-over-year, totaling $14.55 billion—that&#39;s more revenue than any other product category besides the iPhone ($26.44 billion in this down quarter).\n Cook specifically called out Apple TV+ as having a good quarter. The streaming service appeared to outsiders to have a slow launch this time last year—especially in contrast to the  massively successful Disney+, which began service at almost the same time. But Cook spoke of Apple TV+ in a positive tone and named the series  Ted Lasso as a notable success. The sports comedy starring Jason Sudeikis has drawn praise for its positive, uplifting vibe, and it might be Apple TV+&#39;s biggest hit yet—though Apple has not released as many numbers about Apple TV+ viewership as many would like.\n Apple also declined yet again to give guidance for the next quarter—a practice it and some other companies have stuck to throughout the pandemic, given the global uncertainties involved. Some analysts had thought Apple might return to giving guidance this quarter, but with COVID cases on a sharp rise in some regions (including the United States), it seems that wasn&#39;t in the cards just yet.\n That means that analysts, investors, and other observers have no idea how well Apple expects the iPhone 12 and 12 Pro to sell. Currently, two out of four new iPhone models this season are already shipping, so we&#39;ll see those numbers in the next quarter—which is usually Apple&#39;s best, precisely because of those new iPhone sales.\n Apple shares dropped about 5 percent in value in after-hours trading as some investors were disappointed that the surge in iPad and Mac sales wasn&#39;t enough to make up for the iPhone&#39;s short-term decline. That said, Apple&#39;s reported earnings hewed closely to what analysts expected from this quarter.", "posttime": "2020-10-30 06:17:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,iphone,弥补,earnings", "title": "苹果财报显示iPad和Mac销售强劲不能弥补iPhone", "title_en": "Apple earnings show strong iPad and Mac sales can’t make up for the iPhone", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/apple-earnings-show-strong-ipad-and-mac-sales-cant-make-up-for-the-iphone/", "via": "", "real_tags": ["apple", "苹果", "iphone", "弥补", "earnings"]}, {"category": "", "categoryclass": "", "imagename": "fb719cc8e8abddd7383a5aeade0d895c.jpg", "infoid": 1032170, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大小对螳螂虾来说很重要，它们表现出明显的偏好在珊瑚碎石中挖洞，洞穴的体积与它们自己的身体大小很接近，或者只是稍大一点-换句话说，大到足以容纳它们的身体，但又小到足以保卫入口。但根据发表在“动物行为”杂志上的一篇新论文，有时螳螂虾会妥协。如果洞穴已经被占据，并且接近理想的大小，或者稍微小一点，螳螂虾就会为这个洞穴战斗更长时间，更努力-而且更有可能赢得比赛。\n正如我们之前报道的那样，螳螂虾有许多不同的品种：大约有450个已知物种。但它们通常可以分为两类：一类是用矛状附属物刺伤猎物(#34；矛)；另一类是用又大又圆又像锤子的爪子砸碎猎物(#34；猛禽附属物)。这些攻击速度如此之快--每秒高达23米，即每小时51英里--而且威力巨大，它们经常会在水中产生空泡，产生冲击波，作为后续打击，使猎物晕倒，有时甚至会杀死猎物。有时撞击甚至会产生声致发光，空化气泡在坍塌时会产生短暂的闪光。\n2018年的一项研究发现，这种强有力的打击的秘诀似乎不是来自笨重的肌肉，而是来自虾手臂上弹簧加载的解剖结构，类似于弓箭。虾的肌肉拉动手臂上的马鞍形结构，使其弯曲并储存势能，这些势能随着棍状的爪子的摆动而释放。今年早些时候，科学家们发现，与直觉相反的是，螳螂虾在空中挥拳的速度是它的一半，这表明这种动物可以精确地控制它的攻击行为，这取决于周围的介质。\n埃克塞特大学(University Of Exeter)的帕特里克·格林(Patrick Green)和杜克大学(Duke University)的J·S·哈里森(J.S.Harrison)是“动物行为”这篇新论文的作者。他们很感兴趣的是，这一物种螳螂(Neogonodactylus Bredini)的资源价值评估是什么。众所周知，这一物种的雄性和雌性螳螂都会争夺珊瑚碎石洞穴，这些洞穴提供了免受捕食者的保护，并为交配和孵化卵提供了一个安全的空间。如果一个偏爱的洞穴已经被占据，就会引发一场争夺谁得到这个洞穴的争斗。这些比赛通常包括一场仪式化的高强度打击(螳螂虾粉碎！)，防御螳螂虾也会用它的装甲尾板来堵住洞口，不让入侵者进入。\n这类动物竞赛在自然界中很常见，动物似乎能够评估这种有争议的资源的价值，并相应地调整它们的行为。这种遭遇通常是用线性或绝对的价值评估来描述的，例如，在女性在场的情况下，雄性会更具攻击性。类似地，雌性寄生蜂将争夺产卵的最理想寄主。例如，宿主越大，后代孵化时可以获得的食物就越多。过去的研究表明，女性的产卵量似乎是一个促成因素(或选择性力量)，决定了她们争夺潜在寄主的力度有多大，以及她们赢得这样一场比赛的可能性有多大。\n过去的研究表明，螳螂虾会选择大小(体积)与自身身体大小(质量)相匹配的洞穴，寄居蟹也是如此。就寄居蟹而言，在资源评估方面似乎存在权衡：拖拽较大的贝壳需要更多的能量，但能提供更多的保护，而较小的贝壳则相反。格林和哈里森建议，当涉及到争夺所需的贝壳时，寄居蟹可能更喜欢首选大小或略大的贝壳，而对大得多或小得多的贝壳的重视程度较低。\n这将是二次资源价值评估的一个例子，在该评估中，资源在某一峰值水平被最高估值。该值从该峰值开始在任一方向上递减。换句话说，有一个最佳的最佳点，或者说金发地带，在那里，一种资产被认为是恰到好处的，动物会相应地调整自己的行为-例如，当这种理想的资产受到竞争时，通过更积极地战斗。格林和哈里森认为类似的二次资源价值评估也可能适用于螳螂虾-也就是说，螳螂虾在拥有理想数量的洞穴中会有更高的价值，在争夺对这样的洞穴的控制权时，会更具攻击性，更有可能获胜。\n为了验证他们的假设，研究人员进行了两组实验：选择实验，螳螂虾可以自由选择\n研究人员用透明的塑料管建造了模拟洞穴，只有一个开口，用黑色乙烯基包着，顶部有一个清晰的区域，使他们能够观察到里面发生了什么。螳螂虾是从巴拿马加勒比海沿岸海草床的洞穴中收集的。研究人员还对上演的比赛(总共36场)进行了录像，如果其中一只格斗虾似乎面临严重受伤或死亡的危险，就会进行干预。\n他们发现，总体而言，占领螳螂的虾在69%的战斗中成功地保卫了它们的洞穴不受入侵者的侵扰。但在入侵的螳螂虾争夺略小于理想大小的洞穴的情况下，这些几率发生了戏剧性的变化；在这种情况下，入侵者赢得了67%的战斗，通常是通过先发制人和更频繁地攻击。\n格林在谈到结果时说，我们知道动物可以评估各种因素，包括对手的大小和奖品的价值，来决定是否战斗以及战斗的强度。在这种情况下，由于一个较小的洞穴可能被较小的对手占据，看起来螳螂虾会在家的大小上妥协，如果这意味着更容易战斗的话。我们可能会假设动物为了最大的资产而战斗得最卖力，但这项研究是为一些需要付出最大努力的东西预留最大努力的一个例子。在这种情况下，螳螂虾似乎会在家的大小上做出妥协，如果这意味着更容易战斗的话。我们可能会认为，动物为了最大的资产而战斗得最卖力，但这项研究是为一些需要最大努力的事情预留最大努力的一个例子。恰到好处。&#39；&#34；\n有一些警告，最明显的是样本量的限制。格林和哈里森还承认，模拟洞穴是标准化的，有固定的长度和直径，与自然形成的洞穴不同，自然形成的洞穴通常有更多的可变尺寸。光滑的管子与在岩石和碎石中形成的天然洞穴有明显的不同。\n他们写道，螳螂虾是天然洞穴的巧妙修饰者，它们使用附属物撞击来加宽过窄的洞穴，并使用岩石和沙子来填充过大的洞穴。虽然我们测试的人不能通过罢工来扩大模拟洞穴，也许有更多的时间来建立居住权，但个人会填入更大的模拟洞穴。", "note_en": "Size matters to the small-but-mighty mantis shrimp, which show a marked preference for burrows in coral rubble with volumes that closely match their own body size or are just a bit larger—in other words, large enough to accommodate their body, but small enough that they can defend the entrance. But according to  a new paper published in the journal Animal Behavior, sometimes a mantis shrimp will compromise. If a burrow is already occupied and is close to the ideal size, or a bit  smaller, the mantis shrimp will fight longer and harder for that burrow—and be more likely to win the contest.\n As  we previously reported,  mantis shrimp come in many different varieties: there are some 450 known species. But they can generally be grouped into two types: those that stab their prey with spear-like appendages (&#34;spearers&#34;) and those that smash their prey (&#34;smashers&#34;) with large, rounded, and hammer-like claws (&#34;raptorial appendages&#34;). Those strikes are so fast—as much as 23 meters per second, or 51mph—and powerful, they often produce cavitation bubbles in the water, creating a shock wave that can serve as a follow-up strike, stunning and sometimes killing the prey. Sometimes a strike can even produce  sonoluminescence, whereby the cavitation bubbles produce a brief flash of light as they collapse.\n A  2018 study found that the secret to that powerful punch seems to arise not from bulky muscles but from the spring-loaded anatomical structure of the shrimp&#39;s arms, akin to a bow and arrow. The shrimp&#39;s muscles pull on a saddle-shaped structure in the arm, causing it to bend and store potential energy, which is released with the swinging of the club-like claw. And  earlier this year, scientists discovered that, counterintuitively, the mantis shrimp  punches at half the speed in air, suggesting that the animal can precisely control its striking behavior, depending on the surrounding medium.\n  Patrick Green of the University of Exeter and J.S. Harrison of Duke University—authors of the new paper in Animal Behavior—were interested in exploring what&#39;s known as &#34;resource value assessment&#34; in mantis shrimp of the smashing variety ( Neogonodactylus bredini). Both male and female mantis shrimp in this species are known to compete over coral rubble burrows, which provide protection from predators and a safe space to mate and brood eggs. If a preferred burrow is already occupied, it can trigger a fight over who gets the burrow. Those competitions typically involve a ritualized exchange of high-force strikes (mantis shrimp SMASH!), with the defending mantis shrimp also using its armored tailplate to block the burrow entrance from intruders.\n These sorts of animal competitions are quite common in nature, and animals seems to be able to assess the value of such &#34;contested resources&#34; and adjust their behavior accordingly. Such encounters are typically described in terms of a linear or categorical value assessment, in which, for example, males will fight more aggressively in the presence of females. Similarly, female parasitoid wasps will compete over the most desirable hosts in which to lay their eggs. The larger the host, the more food will be available for the offspring when they hatch, for example. Past studies have suggested that a female&#39;s egg load seems to be a contributing factor (or selective force) in how aggressively they fight over a potential host and how likely they are to win such a competition.\n  Past studies have shown that mantis shrimp pick burrows whose sizes (volume) mesh well with their own body size (mass), as do hermit crabs. In the case of hermit crabs, there seems to be a tradeoff at play when it comes to resource assessment: dragging around a larger shell requires more energy but offers more protection from predators, while the reverse is true for smaller shells. Green and Harrison suggest that, when it comes to competing for a desired shell, hermit crabs may prefer shells that are the preferred size or slightly larger, while placing less value on shells that are much larger or smaller.\n This would be an example of quadratic resource value assessment, in which resources are valued most highly at a certain peak level. That value decreases in either direction from that peak. In other words, there is an optimal sweet spot, or &#34;Goldilocks zone,&#34; where an asset is deemed to be &#34;just right&#34; and the animal will adapt its behavior accordingly—e.g., by fighting more aggressively when such a desirable asset is contested. Green and Harrison thought a similar quadratic resource value assessment might also apply to mantis shrimp—namely, that mantis shrimp would place a higher value on burrows with an ideal volume and would be more aggressive, and more likely to win, when fighting for control of such burrows.\n To test their hypothesis, the researchers conducted two sets of experiments: &#34;choice experiments,&#34; where mantis shrimp could freely choose unoccupied burrows of varying sizes, and &#34;staged contests,&#34; where &#34;defending&#34; and &#34;intruding&#34; mantis shrimp were randomly matched in a competition over a preferred burrow. Green and Harrison predicted that their experiments would show that competitors would fight longer and harder and would be more likely to win when their body length closely matched the volume of the contested burrow—and that these factors would decrease the further that match deviated from the ideal, in either direction.\n  The researchers built mock burrows out of clear plastic tubing with a single opening, wrapped in black vinyl, with a clear area at the top to enable them to observe what was happening inside. The mantis shrimp were collected from burrows in seagrass beds along the Caribbean coast of Panama. The researchers also videotaped the staged contests (a total of 36) and intervened if it seemed like one of the fighting shrimp was in danger of significant injury or death.\n They found that, overall, the occupying mantis shrimps successfully defended their burrows from intruders in 69 percent of the fights. But those odds changed dramatically in cases where the intruding mantis shrimp were competing for burrows slightly smaller than their ideal size; intruders won 67 percent of the fights in those circumstances, typically by striking first and striking more often.\n &#34;We know that animals can assess a variety of factors, including the size of the opponent and the value of the prize, when deciding whether to fight and how hard to fight,&#34;  said Green of the results. &#34;In this case, as a smaller burrow is probably occupied by a smaller opponent, it seems mantis shrimps will compromise on the size of the home if it means an easier fight. It might be assumed that animals fight hardest for the biggest assets, but this study is an example of maximum effort being reserved for something that&#39;s &#39;just right.&#39;&#34;\n There were some caveats, most notably sample-size constraints. Green and Harrison also acknowledged that the mock burrows were standardized, with set lengths and diameters, unlike naturally occurring burrows, which usually have more variable dimensions. And the smooth tubing is markedly different from the natural burrows formed in rock and rubble.\n &#34;Mantis shrimp are adept modifiers of natural burrows, using appendage strikes to widen too-narrow burrows and using rock and sand to fill in too-large burrows,&#34; they wrote. &#34;While the individuals we tested could not widen mock burrows by striking, perhaps with more time in which to establish residency, individuals would have filled in larger mock burrows.&#34;", "posttime": "2020-10-30 06:16:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "家园,shrimp,洞穴", "title": "螳螂虾碎！在争夺完美家园的斗争中，大小很重要", "title_en": "Mantis shrimp SMASH! Size matters in fights over the perfect home", "transed": 1, "url": "https://arstechnica.com/science/2020/10/mantis-shrimp-smash-size-matters-in-fights-over-the-perfect-home/", "via": "", "real_tags": ["家园", "shrimp", "洞穴"]}, {"category": "", "categoryclass": "", "imagename": "ba5ba14271694d9038173b7d9d5f0b44.jpg", "infoid": 1032169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌母公司Alphabet今天下午发布了第三季度收益报告，远远超出了华尔街的预期，这在很大程度上要归功于YouTube，其收入增至50亿美元(而2019年第三季度为38亿美元)。\n谷歌云的收入也从去年的24亿美元增长到最近一个季度的34.4亿美元。总体而言，Alphabet公布的营收为462亿美元，每股收益为16.40美元，而分析师预测的营收为428.8亿美元，每股收益为11.21美元。\nSpotify首席执行长埃克(Daniel Ek)说，公司将“进一步扩大涨价”，尽管公司没有详细说明其计划，但首席执行长丹尼尔·埃克(Daniel Ek)说，涨价将发生在对Spotify来说更成熟的市场。\nMicrosoft现在允许您将自己的数据类型引入Excel-这意味着您可以拥有“Customer”数据类型，例如，将来自第三方服务的丰富客户数据引入Excel。\n为什么苹果今年第四季度的收益看起来不一样--苹果最新发布的iPhone比今年晚了几周，错过了在第四季度公布的窗口。\n甜甜圈推出了WaterCooler，这是一种与同事在线社交的简单方式-这家初创公司还宣布，它已经筹集了1200万美元的总资金，由Accel牵头。\n一键式住房初创公司Atmos又从Khosla、房地产战略公司和TikTok明星乔什·理查兹那里筹集了400万美元-据首席执行官尼克·多纳休称，用户已经开始在该平台上设计“第一打房子”。\n小卖部俱乐部希望帮助以前被监禁的人找到社区-虽然7000万个工作岗位专注于帮助有犯罪记录的人找到工作，但其新的网络小卖部俱乐部旨在成为人们寻找社区的地方。\n风投公司在第三季度向欧洲初创企业注入了大量资金，但早期的交易撮合似乎受到了影响-后期和更大规模的风投趋势继续改变着私人资本的格局。\n在这场“先买后付”的战争中，贝宝(PayPal)已准备好占据主导地位--Button的斯蒂芬·米尔班克(Stephen Milbank)写道，采用“先买后付”的最大限制是它的可用性。\nTwitter API访问权限的改变正在赶走第三方开发者--8月12日，Twitter启动了对其2012年API的全面重建。\n(提醒：Extra Crunch是我们的会员计划，旨在使初创企业的信息民主化。您可以在这里注册。)。\n欧洲限制大型科技公司可以推动自己的服务和使用第三方数据-欧盟委员会执行副总裁玛格丽特·维斯特格(Margrethe Vestager)证实，定于几周后提出的一项立法提案将旨在禁止她所说的“不公平的自我偏好”。\n康卡斯特表示，孔雀有近2200万注册用户，但目前还不清楚其中有多少是付费的，而不是免费的。\n技术乐观主义…。在这个经济中？-最新一集的Equity着眼于未来十年的巨大创业机会。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "Google’s parent company  Alphabet   released its third-quarter earnings report this afternoon,  coming in well ahead of Wall Street expectations thanks in large part to YouTube, which saw revenue rise to $5.0 billion (compared to $3.8 billion during Q3 2019).\n  Google Cloud also grew revenue from $2.4 billion last year to $3.44 billion in the most recent quarter. Overall, Alphabet reported revenue of $46.2 billion and earnings per share of $16.40, compared to analyst predictions of $42.88 billion in revenue and EPS of $11.21.\n   Spotify CEO says company will ‘further expand price increases’ — Although the company didn’t detail its plans, CEO Daniel Ek said the hikes will take place in markets that are more mature for Spotify.\n Microsoft now lets you bring your own data types to Excel — That means you can have a “customer” data type, for example, bringing in rich customer data from a third-party service into Excel.\n Why Apple’s Q4 earnings look different this year — With Apple’s latest iPhone launch running a few weeks behind this year, it missed the window to be included on Q4.\n  Donut launches Watercooler, an easy way to socialize online with co-workers — The startup also announced that it has raised $12 million in total funding, led by Accel.\n One-click housing startup Atmos raises another $4M from Khosla, real estate strategics and TikTok star Josh Richards — According to CEO Nick Donahue, users have started designing the “first dozen homes” on the platform.\n Commissary Club wants to help formerly incarcerated people find community —  While 70 Million Jobs focuses on helping people with criminal records find jobs, its new network Commissary Club is designed to be a place for folks to find community.\n  VCs poured capital into European startups in Q3, but early-stage dealmaking appeared to suffer — The VC trends of later and larger continue to change the landscape of private capital.\n In the ‘buy now, pay later’ wars, PayPal is primed for dominance — Button’s Stephen Milbank writes that the greatest limitation to buy-now-pay-later adoption is its availability.\n Twitter’s API access changes are chasing away third-party developers — On August 12, Twitter launched a complete rebuild of its 2012 API.\n (Reminder: Extra Crunch is our membership program, which aims to democratize information about startups.  You can sign up here.)\n  Europe to limit how big tech can push its own services and use third-party data — Commission EVP Margrethe Vestager confirmed that a legislative proposal due in a few weeks will aim to ban what she called “unfair self-preferencing.”\n Comcast says Peacock has nearly 22M sign-ups — But it’s not clear how many of them are paid versus free.\n Tech optimism…in this economy? — The latest episode of Equity looks at big startup opportunities for the coming decade.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-10-30 06:13:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,crunch", "title": "\nDaily Crunch：谷歌本季度业绩不错", "title_en": "\n\t\t\t\tDaily Crunch: Google had a good quarter\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/29/daily-crunch-google-earnings/", "via": "", "real_tags": ["google", "谷歌", "crunch"]}]