[{"category": "", "categoryclass": "", "imagename": "4bf0acef46c96975d722c0c359bef6eb.png", "infoid": 1004327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NLP的研究人员已经知道，Google非常流行的BERT(Transformers的双向编码器表示)语言模型，基于大量数据进行训练，即使在不了解分层语法结构的情况下也能很好地执行句法语法判断任务。但它还能做得更好吗？这就是DeepMind和加州大学伯克利分校的研究人员在一项新的研究中开始发现的，该研究增加了句法偏见，以确定它们是否可以帮助伯特更好地理解，以及在哪里可以帮助伯特实现更好的理解。\n该方法受到知识提炼(KD)过程的启发，该过程使用递归神经网络语法(RNNG)来提高可扩展语言模型(LMS)的句法能力。由于RNNG是从左到右预测单词的分层句法LM，因此将它们插入到在双向上下文中预测单词的BERT中是具有挑战性的。因此，研究人员创建了一种新的预训练设置，该设置提取了RNNG在上下文中的词的边缘分布，但仍然完全兼容，并保持BERT的其余部分不变，以保持其可扩展性。\n在均匀分布的双向背景下提取RNNG的近似边缘(“UF-KD”)。\n提取RNNG在双向背景下的近似边缘，并采用一元分布(“UG-KD”)。\n研究人员在六个不同的结构化预测任务上评估了他们的结构提取的BERT，包括句法、语义和共指解析，以及流行的GLUE(通用语言理解评估)基准。\n测试结果表明，所有四个结构提取的BERT模型在相对错误率降低2-21%的同时，性能都一致优于标准的BERT基线。\n研究结果表明，句法归纳偏向对包括非句法预测任务在内的各种结构化预测任务都是有益的，而且这些偏向还可以提高下游任务的微调样本效率。\n研究人员提出，未来的潜在研究可以着眼于设计易于扩展的模型，将更强的结构性偏见概念整合在一起。", "note_en": "NLP researchers already know that Google’s hugely popular BERT (Bidirectional Encoder Representation from Transformers) language model, trained on large amounts of data, performs very well on syntactic grammatical judgment tasks even with no knowledge of hierarchical syntactic structures. But can it do even better? That’s what DeepMind and University of California, Berkeley researchers set out to discover in a new study that adds syntactic biases to determine whether and where they can help BERT achieve better understanding.\n The approach was inspired by Knowledge Distillation (KD) procedures which improve the syntactic competence of scalable language models (LMs) with recurrent neural network grammars (RNNGs). Since RNNGs are hierarchical syntactic LMs that predict words from left to right, inserting them to BERT, which predicts words in a bidirectional context, is challenging. Researchers thus created a new pretraining setting which distills the RNNG’s marginal distribution over words in context but is still completely compatible, and kept the rest of BERT unchanged to maintain its scalability.\n  Distill the RNNG’s approximated marginal under the bidirectional context, with uniform distribution (“UF-KD”)\n Distill the RNNG’s approximated marginal under the bidirectional context, with unigram distribution (“UG-KD”)\n The researchers evaluated their structure-distilled BERTs on six diverse structured prediction tasks covering syntactic, semantic, and co-reference resolution, as well as on the popular GLUE (General Language Understanding Evaluation) benchmark.\n The test results show that all four structure-distilled BERT models consistently outperform the standard BERT baseline while reducing the relative error rate by 2–21 percent.\n  The findings suggest that syntactic inductive biases can be beneficial for a diverse range of structured prediction tasks, including those that are non-syntactic, and that these biases can also improve fine-tuning sample efficiency on downstream tasks.\n The researchers propose potential future research could look into designing easily scalable models that integrate stronger notions of structural biases.", "posttime": "2020-05-30 05:50:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "伯特,syntactic,句法", "title": "DeepMind说句法偏见“帮助伯特做得更好”", "title_en": "DeepMind Says Syntactic Biases ‘Helped Bert Do Better’", "transed": 1, "url": "https://medium.com/syncedreview/deepmind-says-syntactic-biases-helped-bert-do-better-c4fe8bf2e11d", "via": "", "real_tags": ["伯特", "syntactic", "句法"]}, {"category": "", "categoryclass": "", "imagename": "2c2cd7da89ba329a2b3d6191d0a22b63.gif", "infoid": 1004325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是对SpaceX公司在博卡奇卡开发的新型宇宙飞船--星际飞船的一次测试。最终，该公司希望用它来取代猎鹰9号和猎鹰重型火箭，但星际飞船仍处于非常早期的开发阶段，而这些飞行器已经经过飞行验证，已经过了好几次了。\nSpaceX刚刚获得美国联邦航空局(FAA)的批准，可以驾驶其星际飞船原型进行短程亚轨道测试飞行。我们的目标是在静态射击测试后短距离飞行SN4原型，但现在显然不可能，因为在周五的测试之后，车辆似乎已经在爆炸中完全摧毁，正如你在下面来自NASASpaceflight.com的数据流中看到的那样。\n爆炸发生在德克萨斯州当地时间下午1点49分左右，大约在完成发动机试火两分钟后。我们已经联系了SpaceX公司，以了解更多关于今天事件的原因，以及是否有人在爆炸中受伤。SpaceX在进行这些测试时通常会采取大量的安全预防措施，包括确保该区域没有任何人员或其他人。\n这并不是SpaceX的星际飞船原型第一次遭遇灾难性的结局；之前的几个测试飞行器在进行测试时屈服于压力测试。这就是为什么航天公司在开发过程中经常测试和压力测试运载火箭-以确保最终运行的运载火箭在需要的时候是令人难以置信的安全和可靠的。\nSpaceX已经在研究更多的原型，包括在博卡奇卡附近组装SN5，所以一旦它可以清理测试台并进入最新的原型，它很可能会迅速恢复测试计划。这与SpaceX在商业机组项目上的工作是完全不同的，因此历史性的首次载着宇航员的试射应该按计划在周六或周日进行，具体取决于天气。", "note_en": "This was a test in the development of Starship, a new spacecraft that SpaceX has been developing in Boca Chica. Eventually, the company hopes to use it to replace its Falcon 9 and Falcon Heavy rocket, but Starship is still very early in its development phase, whereas those vehicles are flight-proven, multiple times over.\n SpaceX had just  secured FAA approval to fly its Starship prototype for short, suborbital test flights. The goal was to fly this SN4 prototype for short distances following static fire testing, but that clearly won’t be possible now, as the vehicle appears to have been completely destroyed in the explosion following Friday’s test, as you can see below in the stream from NASASpaceflight.com.\n   The explosion occurred around 1:49 PM local time in Texas, roughly two minutes after it had completed its engine test fire. We’ve reached out to SpaceX to find out more about the cause of today’s incident, and whether anyone was hurt in the explosion. SpaceX typically takes plenty of safety precautions when running these tests, including ensuring the area is well clear of any personnel or other individuals.\n This isn’t the first time one of SpaceX’s Starship prototypes has met a catastrophic end; a couple of previous test vehicles succumbed to pressure testing while being put through their paces. This is why space companies test frequently and stress test vehicles during development — to ensure that the final operational vehicles are incredibly safe and reliable when they need to be.\n SpaceX is already working on additional prototypes, including assembling SN5 nearby in Boca Chica, so it’s likely to resume its testing program quickly once it can clear the test stand and move in the newest prototype. This is a completely separate endeavor from SpaceX’s work on the Commercial Crew program, so that historic first test launch with astronauts on board should proceed either Saturday or Sunday as planned, depending on weather.", "posttime": "2020-05-30 05:35:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,星际,fire,测试", "title": "SpaceX的星际飞船SN4运载火箭原型在发动机静态点火试验后爆炸", "title_en": "SpaceX's Starship SN4 Launch Vehicle Prototype Explodes After Static Engine Fire Test", "transed": 1, "url": "https://techcrunch.com/2020/05/29/spacexs-starship-sn4-launch-vehicle-prototype-explodes-after-static-engine-fire-test/", "via": "", "real_tags": ["火箭", "星际", "fire", "测试"]}, {"category": "", "categoryclass": "", "imagename": "df90e30517c987b5e42f83aa01dbd9e9.png", "infoid": 1004323, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX的下一代星际飞船火箭的第四个原型周五在该公司位于德克萨斯州南部的试验场进行测试后立即爆炸。在SpaceX点燃测试火箭上的发动机后不久，一个巨大的火球将车辆吞没在火焰中，几乎没有硬件仍然屹立不倒，显然对测试地点造成了破坏。\n这次失败的测试发生在SpaceX公司将为NASA执行一次无关的发射的前一天，该发射将把两名宇航员送到国际空间站。这项历史性的任务将乘坐SpaceX的主力猎鹰9号火箭在佛罗里达州的卡纳维拉尔角进行，该火箭之前已经飞行了100多次。\n虽然星际飞船原型的失败与即将到来的美国国家航空航天局(NASA)任务无关，但SpaceX首席执行官埃隆·马斯克(Elon Musk)确实告诉“航空周刊”，SpaceX计划暂停星际飞船的开发，而该公司则专注于第一次载人飞行。马斯克在5月26日发表的一篇播客采访中告诉“航空周刊”：“我已经调整了SpaceX公司的优先事项，使其非常专注于机组人员的发射。”“因此，这将减缓星际飞船前线的进展。”\n这次失败的测试发生在SpaceX将为NASA执行一次关键发射的前一天。\n刚刚爆炸的原型旨在测试SpaceX未来的星际飞船的设计，该公司希望制造一种巨型火箭，将人们送到月球和火星等深空目的地。SpaceX公司一直在该公司位于德克萨斯州博卡奇卡的工作地点建造各种测试版本的星际飞船。今天，该公司点燃了最新的星际飞船原型上的主猛禽发动机，同时按住了车辆，这是一种被称为静态火灾的测试。这是SpaceX在过去几周内进行的第五次静态火灾测试。\n这次爆炸标志着摧毁星际飞船原型的又一次失败。SpaceX在导致车辆爆炸或内爆的加压测试中已经失去了之前的三个测试版本。这艘特殊的星际飞船在测试过程中比其他星际飞船走得更远。这次最新的故障似乎不太可能有任何东西可以挽救，而且试验场周围的区域似乎也受到了一些破坏。目前还不清楚是否有人在爆炸中受伤。SpaceX在发表之前没有回复记者的置评请求。\n如果星际飞船原型完好无损，SpaceX计划在未来几天进行低空飞行测试。5月28日，美国联邦航空管理局授予SpaceX公司许可证，允许其在博卡奇卡以外的地方使用该运载火箭执行“亚轨道可重复使用运载火箭任务”。联邦航空局还在6月1日对发射场实施了空中限制，防止车辆在该地区上空低于26000英尺的高度飞行。现在，随着SpaceX公司致力于下一款原型的研发，这些限制很可能会被取消。", "note_en": "A fourth prototype of SpaceX’s next generation Starship rocket exploded right after a test at the company’s south Texas test site on Friday. Shortly after SpaceX ignited the engine on the test rocket, a massive fireball engulfed the vehicle in flames, leaving very little hardware still standing and apparently causing damage to the test site.\n The failed test comes just a day before SpaceX is set to perform an  unrelated launch for NASA that will send two astronauts to the International Space Station. That historic mission will take place out of Cape Canaveral, Florida, on SpaceX’s workhorse Falcon 9 rocket, which has flown more than 100 times before.\n While the failure of the Starship prototype is not linked to the upcoming NASA mission, SpaceX CEO Elon Musk did tell  Aviation Week that SpaceX planned to put a pause on Starship development while the company focused on its first crewed flight. “I have redirected SpaceX’s priorities to be very focused on the crew launch,”  Musk told  Aviation Week during a podcast interview published on May 26th. “So that’s going to slow things down on the Starship front.”\n The failed test comes just a day before SpaceX is set to perform a critical launch for NASA\n The prototype that just exploded is meant to test out the design for SpaceX’s future Starship, a giant rocket the company wants to create to send people to deep space destinations like the Moon and Mars. SpaceX has been building various test versions of the Starship down at the company’s work site in Boca Chica, Texas. Today, the company ignited the main Raptor engine on the latest Starship prototype while holding the vehicle down, a type of test known as a static fire. It was the fifth static fire test SpaceX had conducted over the last couple of weeks.\n The explosion marks yet another failure that’s destroyed a Starship prototype. SpaceX already  lost three previous test versions of the vehicle during pressurized tests that either caused the vehicles to burst or implode. This particular Starship  got further along in the testing process than the others. With this latest failure, it seems unlikely that anything is salvageable, and there seems to be some damage to the area surrounding the test site, too. It’s unclear if anyone was hurt in the explosion. SpaceX did not respond to a request for comment before publication.\n Had the Starship prototype remained intact, SpaceX had plans to fly the vehicle on a low-altitude flight test in the coming days. On May 28th, the Federal Aviation Administration  granted SpaceX a license to conduct “suborbital reusable launch vehicle missions” with the vehicle out of Boca Chica. The FAA also placed air restrictions over the launch site for June 1st, preventing vehicles from flying below 26,000 feet over the area. Now, those restrictions will likely be lifted as SpaceX works on its next prototype.", "posttime": "2020-05-30 05:18:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞船,loses,spacex", "title": "SpaceX在爆炸中失去另一艘星际飞船原型", "title_en": "SpaceX loses another Starship prototype in explosion", "transed": 1, "url": "https://www.theverge.com/2020/5/29/21274931/spacex-starship-prototype-rocket-explosion-static-fire-test", "via": "", "real_tags": ["飞船", "loses", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004319, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当执法机构吹捧他们最新的网络刑事逮捕时，被告经常被描绘成一个虚张声势的逃犯，从事着复杂的、有利可图的甚至令人兴奋的活动。但新的研究表明，由于网络犯罪已经变得以付费服务为主，支持这些企业所需的绝大多数日常活动实际上都是令人麻木和乏味的，强调这一现实可能是打击网络犯罪、引导犯罪者走上更好道路的一种更有效的方式。\n这一发现来自剑桥大学网络犯罪中心的研究人员发布的一篇新论文，该论文研究了建立、维护和捍卫非法企业所需的质量和工作类型，这些企业在网络犯罪即服务市场中占据了很大份额。特别是，学者们将重点放在僵尸网络和DDoS出租或“引导”服务、地下论坛的维护以及恶意软件即服务产品上。\n在考察这些业务时，学者们强调，参与网络犯罪的人的浪漫观念忽略了支持在线非法经济所需做的工作中往往平凡、机械的方面。研究人员得出结论，对于许多涉案人员来说，网络犯罪只不过是一份枯燥的办公室工作，维持着这些全球市场所依赖的基础设施，这项工作的性质与合法系统管理员的活动几乎没有什么不同。\n该报告的合著者、剑桥网络犯罪中心主任理查德·克莱顿(Richard Clayton)表示，这些发现表明，政策制定者和执法机构在发布夸张的新闻稿时，可能对任何人都没有好处，这些新闻稿将他们的网络犯罪调查称为针对老练的行为者。\n“每个人看待网络犯罪的方式都是，他们都对摇滚明星和所有令人兴奋的东西感兴趣，”克莱顿告诉Krebson Security。“这传达出的信息是，网络犯罪有利可图，令人兴奋，而对于大多数涉案人员来说，情况绝对不是这样。”\n“我们发现，随着网络犯罪发展成为工业化的非法经济，一系列乏味的支持性劳动形式也随之激增，就像主流工业化经济体一样。我们认为，发达增长国家的网络犯罪经济体已经开始创造自己乏味的、低成就感的工作岗位，变得不再那么注重魅力、越轨和身份认同，而更多地关注稳定以及风险的管理和扩散。研究文献表明，那些参与其中的人最初很可能是被媒体对黑客和技术偏差的激动人心的描绘所吸引。\n“然而，他们实际参与的工作和做法，并不反映早期”黑客“社区的兴奋和探索，而更类似於贩毒团伙的低级工作，即赚取微薄的金钱，为他们有朝一日可能成为主要参与者的抱负而乏味地工作。”这造成了相同的无聊条件…。当现实浮出水面时，这些地位和财务目标在非法经济中就像在正规就业市场一样受阻时，就会出现在主流工作中。“。\n研究人员利用了对从事这类企业的人的采访，对前或改过自新的犯罪黑客的案例研究，以及地下论坛和聊天渠道居民的窃取帖子。他们把重点放在保持各种犯罪服务有效运作和不受入侵者、内部冲突、执法或竞争对手干扰所需的活动上。\n例如，运行有效的引导服务需要大量的管理工作和维护，其中很多工作涉及不断扫描、征用和管理可用于放大在线攻击的大量远程系统集合。\n启动服务(也称为。“压力者”)，就像许多其他网络犯罪即服务产品一样，它们的生死往往取决于其正常运行时间、有效性、公平对待客户以及快速响应用户询问或担忧的声誉。因此，这些服务通常需要对客户支持工作所需的员工进行大量投资(通过票务系统或实时聊天服务)，当付款出现问题或客户不了解如何使用服务时。\n在对一家靴子服务的前管理员的一次采访中，这位老板告诉研究人员，在厌倦了与客户打交道后，他辞职了，继续正常的生活。这些客户认为维持服务运行所需的所有繁琐工作都是理所当然的。采访内容如下：\n“在做了将近一年之后，我失去了所有的动力，真的不在乎了。所以我就离开了，继续生活。这根本不够有挑战性。制造压力源很容易。提供运行它的动力是棘手的部分。当你不得不全力以赴，全神贯注的时候。当你不得不坐在电脑屏幕前，每4小时扫描、过滤，然后再过滤超过30安培时，就会变得很烦人。“。\n研究人员指出，这种倦怠是客户支持工作的一个重要特征，“这种工作的特点不是对曾经有趣的活动逐渐解脱，而是一旦达到可以从这项工作中获得的社会和金融资本的低上限，就会逐渐建立起无聊和不抱幻想的感觉。”\n运行恶意软件即服务产品也会给开发人员带来损失，当运行良好的服务出现间歇性中断时，他们很快就会发现自己被客户支持请求和负面反馈淹没了。\n事实上，臭名昭著的宙斯特洛伊木马(Zeus特洛伊木马)的作者-一个强大的密码窃取工具，为从被黑客攻击的企业窃取的数亿美元铺平了道路-据说已经辞去了工作，并发布了恶意软件的源代码(从而催生了整个恶意软件即服务产品行业)，主要是为了将技能集中在不那么乏味的工作上，而不是支持数百名客户。\n报告还说：“虽然它们听起来很迷人，但提供这些网络犯罪服务需要与许多非犯罪企业相同水平的枯燥、例行工作，如系统管理、设计、维护、客户服务、打补丁、修复漏洞、记账、回应销售查询等。”\n在某种程度上，宙斯的作者经历可能不是最好的例子，因为他想摆脱支持数百名客户的愿望，最终导致他将注意力和资源集中在构建更复杂的恶意软件威胁上-他将基于点对点的Gameover恶意软件租赁给了一小部分有组织犯罪集团。\n同样，本月“连线”杂志的封面文章介绍了马库斯·哈钦斯(Marcus Hutchins)，他说他“很快就厌倦了他的僵尸网络和托管服务，他发现这些服务涉及安抚许多‘发牢骚的客户’。”所以他辞职了，开始专注于他更喜欢的事情：完善自己的恶意软件。\n剑桥大学的克莱顿和他的同事们认为，后两个例子更多的是例外，而不是规则，他们的研究指出了打击网络犯罪的重要政策含义，这些含义往往被忽视或忽视：即关注注意力和无聊经济学的干预措施，以及尽可能使这类工作变得费力和乏味的干预措施。\n许多网络安全专家经常说，关闭域名和其他与网络犯罪业务有关的基础设施无异于一场打地鼠的游戏，因为肇事者只是为了恢复运营而搬到其他地方。但剑桥大学的研究人员指出，每一次删除都会给管理员重新建立网站带来更多重复、乏味的工作。\n研究人员指出：“最近的研究表明，Booter市场特别容易受到针对这项基础设施工作的干预，这使得这些服务器经理的工作更加乏味，风险也更大。”\n该文件特别注意到，它对非法经济中未经培训的管理工作的“无聊”的描述不应被视为指责合法系统管理员的宝贵和复杂的工作。这份文件注意到，它对非法经济中未经培训的管理工作的“乏味”的描述不应被视为指责合法系统管理员的宝贵和复杂的工作。相反，它是要认识到，这是一种与工程工作不同的知识和技能，需要以不同的方式传授、学习和管理。\n作者的结论是，执法和政策专业人员围绕网络犯罪使用的主要信息传递形式的改变，可能也会支持以这种方式重新调整干预的重点：\n“如果参与这些经济体实际上是基于不正常的愿望，而不是不正常的经验，那么目前占主导地位的信息传递方法往往侧重于这些行为的危险和有害性质，网络犯罪分子拥有的高水平技术技能，在非法网络经济中赚取的大量资金，以及被发现、逮捕和起诉的风险，这可能会适得其反，只会助长推动这项工作的愿望。”相反，通过强调这些工作的繁琐、低技能、低收入和低地位的现实，信息传递可能会劝阻那些参与离经叛道的在线亚文化的人从在论坛上发帖到犯下低级犯罪的飞跃。\n“此外，强调合法经济中缺乏系统管理员和‘测笔员’工人的转移注意力的干预措施(”如果你在一份合适的工作中做同样的事情，可能会得到丰厚的报酬“)，需要认识到，途径、动机和经历可能比预期的要平淡无奇。”\n“事实上，将网络犯罪分子概念化为热爱和理解技术的高技能、有创造力的青少年，可能会误解这些市场所依赖的大多数人的特征，这些人往往是低技能的管理人员，对他们维护和管理的系统知之甚少，他们的方法更类似于维护者的实践知识，而不是软件工程师或安全研究人员的系统知识。找到所有这些无聊的人在合法经济中找到合适的工作，可能既是为了提供基本培训，也是为了让超级巨星空降到关键职位。", "note_en": "When law enforcement agencies tout their latest cybercriminal arrest, the defendant is often cast as a bravado outlaw engaged in sophisticated, lucrative, even exciting activity. But new research suggests that as cybercrime has become dominated by pay-for-service offerings, the vast majority of day-to-day activity needed to support these enterprises is in fact mind-numbingly boring and tedious, and that highlighting this reality may be a far more effective way combat cybercrime and steer offenders toward a better path.\n  The findings come in a new paper released by researchers at  Cambridge University’s Cybercrime Centre, which examined the quality and types of work needed to build, maintain and defend illicit enterprises that make up a large portion of the cybercrime-as-a-service market. In particular, the academics focused on botnets and DDoS-for-hire or “booter” services, the maintenance of underground forums, and malware-as-a-service offerings.\n In examining these businesses, the academics stress that the romantic notions of those involved in cybercrime ignore the often mundane, rote aspects of the work that needs to be done to support online illicit economies. The researchers concluded that for many people involved, cybercrime amounts to little more than a boring office job sustaining the infrastructure on which these global markets rely, work that is little different in character from the activity of legitimate system administrators.\n Richard Clayton, a co-author of the report and director of Cambridge’s Cybercrime Centre, said the findings suggest policymakers and law enforcement agencies may be doing nobody a favor when they issue aggrandizing press releases that couch their cybercrime investigations as targeting sophisticated actors.\n “The way in which everyone looks at cybercrime is they’re all interested in the rockstars and all the exciting stuff,” Clayton told KrebsOnSecurity. “The message put out there is that cybercrime is lucrative and exciting, when for most of the people involved it’s absolutely not the case.”\n  “We find that as cybercrime has developed into industrialized illicit economies, so too have a range of tedious supportive forms of labor proliferated, much as in mainstream industrialized economies. We argue that cybercrime economies in advanced states of growth have begun to create their own tedious, low-fulfillment jobs, becoming less about charismatic transgression and deviant identity, and more about stability and the management and diffusion of risk. Those who take part in them, the research literature suggests, may well be initially attracted by exciting media portrayals of hackers and technological deviance.”\n “However, the kinds of work and practices in which they actually become involved are not reflective of the excitement and exploration which characterized early ‘hacker’ communities, but are more similar to low-level work in drug dealing gangs, involving making petty amounts of money for tedious work in the service of aspirations that they may one day be one of the major players. This creates the same conditions of boredom…which are found in mainstream jobs when the reality emerges that these status and financial goals are as blocked in the illicit economy as they are in the regular job market.”\n The researchers drew on interviews with people engaged in such enterprises, case studies on ex- or reformed criminal hackers, and from scraping posts by denizens of underground forums and chat channels. They focused on the activity needed to keep various crime services operating efficiently and free from disruption from interlopers, internecine conflict, law enforcement or competitors.\n  For example, running an effective booter service requires a substantial amount of administrative work and maintenance, much of which involves constantly scanning for, commandeering and managing large collections of remote systems that can be used to amplify online attacks.\n  Booter services (a.k.a. “stressers”) — like many other cybercrime-as-a-service offerings — tend to live or die by their reputation for uptime, effectiveness, treating customers fairly, and for quickly responding to inquiries or concerns from users. As a result, these services typically require substantial investment in staff needed for customer support work (through a ticketing system or a realtime chat service) when issues arise with payments or with clueless customers failing to understand how to use the service.\n In one interview with a former administrator of a booter service, the proprietor told researchers he quit and went on with a normal life after getting tired of dealing with customers who took for granted all the grunt work needed to keep the service running. From the interview:\n “And after doing [it] for almost a year, I lost all motivation, and really didn’t care anymore. So I just left and went on with life. It wasn’t challenging enough at all. Creating a stresser is easy. Providing the power to run it is the tricky part. And when you have to put all your effort, all your attention. When you have to sit in front of a computer screen and scan, filter, then filter again over 30 amps per 4 hours it gets annoying.”\n The researchers note that this burnout is an important feature of customer support work, “which is characterized less by a progressive disengagement with a once-interesting activity, and more by the gradual build-up of boredom and disenchantment, once the low ceiling of social and financial capital which can be gained from this work is reached.”\n  Running a malware-as-a-service offering also can take its toll on developers, who quickly find themselves overwhelmed with customer support requests and negative feedback when a well-functioning service has intermittent outages.\n  Indeed, the author of the infamous ZeuS Trojan — a powerful password stealing tool that paved the way for  hundreds of millions of dollars stolen from hacked businesses — is  reputed to have quit the job and released the source code for the malware (thus spawning an entire industry of malware-as-a-service offerings) mainly to focus his skills on less tedious work than supporting hundreds of customers.\n “While they may sound glamorous, providing these cybercrime services require the same levels of boring, routine work as is needed for many non-criminal enterprises, such as system administration, design, maintenance, customer service, patching, bug-fixing, account-keeping, responding to sales queries, and so on,” the report continues.\n To some degree, the ZeuS’s author experience may not be the best example, because his desire to get away from supporting hundreds of customers ultimately led to his focusing attention and resources on building a far more sophisticated malware threat — the  peer-to-peer based Gameover malware that he leased to a small group of organized crime groups.\n Likewise,  the cover story in this month’s  Wired magazine profiles  Marcus Hutchins, who said he “quickly grew bored with his botnets and his hosting service, which he found involved placating a lot of ‘whiny customers.’ So he quit and began to focus on something he enjoyed far more: perfecting his own malware.”\n  Cambridge’s Clayton and his colleagues argue the last two examples are more the exception than the rule, and that their research points to important policy implications for fighting cybercrime that are often discounted or overlooked: Namely, interventions that focus on the economics of attention and boredom, and on making such work as laborious and boring as possible.\n Many cybersecurity experts often remark that taking down domain names and other infrastructure tied to cybercrime businesses amounts to little more than a game of whack-a-mole, because the perpetrators simply move somewhere else to resume their operations. But the Cambridge researchers note that each takedown creates further repetitive, tedious, work for the administrators to set up their sites anew.\n “Recent research shows that the booter market is particularly susceptible to interventions targeted at this infrastructural work, which make the jobs of these server managers more boring and more risky,” the researchers note.\n The paper takes care to note that its depictions of the ‘boredom’ of the untrained administrative work carried out in the illicit economy should not be taken as impugning the valuable and complex work of legitimate system administrators. “Rather, it is to recognize that this is a different kind of knowledge and set of skills from engineering work, which needs to be taught, learned, and managed differently.”\n The authors conclude that refocusing interventions in this way might also be supported by changes to the predominant forms of messaging used by law enforcement and policy professionals around cybercrime:\n “If participation within these economies is in fact based in deviant aspiration rather than deviant experience, the currently dominant approaches to messaging, which tend to focus on the dangerous and harmful nature of these behaviors, the high levels of technical skill possessed by cybercrime actors, the large amounts of money made in illicit online economies, and the risk of detection, arrest, and prosecution are potentially counterproductive, only feeding the aspiration which drives this work. Conversely, by emphasizing the tedious, low-skilled, low-paid, and low-status reality of much of this work, messaging could potentially dissuade those involved in deviant online subcultures from making the leap from posting on forums to committing low-level crime.”\n “Additionally, diversionary interventions that emphasize the shortage of sysadmin and ‘pen tester’ workers in the legitimate economy (“you could be paid really good money for doing the same things in a proper job”) need to recognize that pathways, motivations, and experiences may be rather more prosaic than might be expected.”\n “Conceptualizing cybercrime actors as high-skilled, creative adolescents with a deep love for and understanding of technology may in fact mischaracterize most of the people on whom these markets depend, who are often low-skilled administrators who understand fairly little about the systems they maintain and administer, and whose approach is more akin to the practical knowledge of the maintainer than the systematic knowledge of a software engineer or security researcher. Finding all these bored people appropriate jobs in the legitimate economy may be as much about providing basic training as about parachuting superstars into key positions.”", "posttime": "2020-05-30 05:02:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小贴士,choice", "title": "择业小贴士：网络犯罪大多很无聊", "title_en": "Career Choice Tip: Cybercrime Is Mostly Boring", "transed": 1, "url": "https://krebsonsecurity.com/2020/05/career-choice-tip-cybercrime-is-mostly-boring/", "via": "", "real_tags": ["小贴士", "choice"]}, {"category": "", "categoryclass": "", "imagename": "2bbd83174b0e695018227959d0904ebb.jpg", "infoid": 1004318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "政府似乎已经在包括“太阳报”和“每日邮报”在内的全国性报纸上策划了一场大规模的内容营销闪电战，以确保对其冠状病毒反应的一些积极报道。\n在整个5月份，在选定的几天里，赞助的社论在午夜左右发布，指出政府是如何帮助企业“上路”的。\n一些类似的文章已经出现在地区性出版物上，每一篇都强调了支持是如何帮助该地区的公司的。\nFOI已经提交了一份申请，以确定积极的媒体宣传活动的成本，但未经证实的估计表明，成本可能高达数十万英镑。\n他们可能会成为“All in，All Together”广告活动的一部分，该活动声称将为陷入困境的报业带来3500万英镑的收入。\n但据本周的“私家眼”报道，这笔钱主要流向了已经拥有相当可观收入的大型报业集团。\n卡迪夫大学社区新闻中心对其独立的当地新闻出版商网络进行了调查，发现他们中没有人从广告支出中获得一分钱。\n许多入选的图书似乎也是最同情政府应对当前危机的图书，这使得营销热潮变得更加令人困惑。\n杰克是一名商业和经济记者，也是“伦敦经济报”(The London Economic，TLE)的创始人。他曾为“星期日电讯报”、BBC新闻撰稿，并每周为“大问题”撰稿。杰克在班戈的威尔士大学攻读历史，并拥有泰恩河畔纽卡斯尔大学的新闻硕士学位。\n在此浏览器中保存我的姓名、电子邮件和网站，以便下次我发表评论时使用。", "note_en": "The government appears to have orchestrated a wide-scale content marketing blitz across national newspapers including the Sun and the Daily Mail in a bid to secure some positive coverage of its coronavirus response.\n Sponsored editorials were posted at around midnight on selected days throughout May pointing to how the government is helping to keep businesses “on the road”.\n  A number of similar pieces have appeared in regional publications, each highlighting how the support is helping firms in the area.\n  An FOI request has been filed to ascertain the cost of the positive media campaign, but unverified estimates suggest it could run into the hundreds of thousands of pounds.\n  They are likely to form part of the “All in, all together” advertising campaign which claimed to be putting  £35 million in the pockets of the beleaguered newspaper industry.\n But according to this week’s Private Eye, the money is largely going to large newspaper groups which already have not-so-inconsiderable revenues.\n The centre for community journalism at Cardiff University surveyed its network of independent local news publishers and found none of them had received a penny from the advertising spend.\n  Many of the titles selected also seem to be the ones who are most sympathetic to the governments response to the current crisis, making the marketing bonanza all the more perplexing.\n   Jack is a business and economics journalist and the founder of The London Economic (TLE).He has contributed articles to The Sunday Telegraph, BBC News and writes for The Big Issue on a weekly basis.Jack read History at the University of Wales, Bangor and has a Masters in Journalism from the University of Newcastle-upon-Tyne.\n   Save my name, email, and website in this browser for the next time I comment.", "posttime": "2020-05-30 05:01:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "付钱,government,新闻", "title": "英国政府付钱给报纸正面报道新冠肺炎", "title_en": "The UK government is paying newspapers for positive COVID-19 coverage", "transed": 1, "url": "https://www.thelondoneconomic.com/news/the-government-is-paying-the-sun-and-daily-mail-for-positive-coverage-of-its-coronavirus-response/28/05/", "via": "", "real_tags": ["付钱", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004317, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目录。\n本作品采用知识共享署名-ShareAlike 4.0国际许可协议授权。版权所有(C)2007-2020，David Beazley Fork Me on GitHub", "note_en": "Table of Contents\n    This work is licensed under a  Creative Commons Attribution-ShareAlike 4.0 International License. Copyright (C) 2007-2020,  David Beazley  Fork me on  GitHub", "posttime": "2020-05-30 05:01:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,python,许可", "title": "实用Python编程：dabeaz的课程", "title_en": "Practical Python Programming: A course by dabeaz", "transed": 1, "url": "https://dabeaz-course.github.io/practical-python/Notes/Contents.html", "via": "", "real_tags": ["编程", "python", "许可"]}, {"category": "", "categoryclass": "", "imagename": "78f069e031bc8061e9002faba764ac30.jpg", "infoid": 1004316, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据“纽约时报”周五报道，谷歌取消了对2000多名同意做合同工或临时工的招聘。\n上个月，首席执行官桑达尔·皮查伊(Sundar Pichai)向员工承认，由于冠状病毒大流行给各行业的企业带来了不确定性，招聘和投资将放缓。\n据报道，谷歌决定取消承包商和临时工的聘用，这再次引起了人们对该公司大部分员工的关注，他们没有享受到与全职员工相同的福利和保护。\n“纽约时报”(New York Times)周五最先报道，谷歌取消了对2000多名同意作为承包商或临时工工作的人的邀请。\n在“泰晤士报”看到的一封电子邮件中，谷歌上周告诉承包机构，它已经放慢了招聘和投资的步伐，而且不会像我们年初计划的那样引入更多的新员工。谷歌表示，它不会继续聘用它通过这些机构带来的员工。\n谷歌一位发言人不愿对“纽约时报”报道中的细节置评，比如被取消报价的承包商数量，但在一份声明中表示：正如我们已经公开表示的那样，我们正在放慢招聘和投资的步伐，因此没有像我们年初计划的那样招收更多的新员工--包括全职和临时员工。我们将继续在一些战略领域招聘员工。\n上个月，首席执行官桑达尔·皮查伊(Sundar Pichai)向员工承认，由于冠状病毒大流行给各行业的企业带来了不确定性，招聘和投资将放缓。在备忘录中，皮查伊表示，谷歌在2019年增加了2万名员工，并计划今年也这样做。根据备忘录，当时它已经带来了4000名新员工，还有1000名员工计划很快开始工作。\n一位发言人当时告诉CNBC，谷歌将在少数战略领域保持发展势头，并让许多已经被聘用但尚未开始工作的人加入谷歌。\n根据CNBC看到的内部材料，4月晚些时候，一名全球董事警告称，其市场部将削减预算并冻结招聘。\n据报道，谷歌决定取消承包商和临时工的聘用，这再次引起了人们对该公司大部分员工的关注，他们没有享受到与全职员工相同的福利和保护。这些员工，在公司内部通常被称为TVC(临时、供应商和承包商)，至少占谷歌约30万员工的一半。\n但在谷歌的历史上，他们的不同地位经常被强调，比如据CNBC报道，谷歌在4月份告诉合同工，他们不能再访问为全职员工保留的技能培训工具。\n尽管如此，谷歌在新冠肺炎危机期间还是对合同工做出了一些让步。CNBC在3月份报道，谷歌采取行动，将危机期间工作即将结束的临时员工的合同延长60天。", "note_en": "Google rescinded offers for more than 2,000 people who had agreed to work as contractors or temps, The New York Times reported Friday.\n Last month, CEO Sundar Pichai acknowledged to employees that hiring and investments would slow as the coronavirus pandemic created uncertainty for businesses across industries.\n Google&#39;s reported decision to rescind offers from contractors and temp workers once again draws attention to a vast portion of the company&#39;s workforce that does not enjoy the same benefits and protections of its full-time employees.\n Google rescinded offers for more than 2,000 people who had agreed to work as contractors or temporary employees,  The New York Times first reported Friday.\n In an email viewed by the Times, Google told contracting agencies last week that it has been &#34;slowing our pace of hiring and investment, and are not bringing on as many new starters as we had planned at the beginning of the year.&#34; Google said it would not &#34;not be moving forward to onboard&#34; the workers it had brought on through the agencies.\n  A Google spokesperson would not comment on details in the Times report, like the number of contractors whose offers were rescinded, but said in a statement: &#34;As we&#39;ve publicly indicated, we&#39;re slowing our pace of hiring and investment, and as a result are not bringing on as many new people – full-time and temporary – as we&#39;d planned at the beginning of the year. We&#39;re continuing to hire in a number of strategic areas.&#34;\n Last month, CEO Sundar Pichai  acknowledged to employees that hiring and investments would slow as the coronavirus pandemic created uncertainty for businesses across industries. In the memo, Pichai said Google added 20,000 employees in 2019 and had planned to do the same this year. At the time, it had brought on 4,000 new employees and a thousand more were scheduled to start soon, according to the memo.\n A spokesperson told CNBC at the time that Google would be &#34;maintaining momentum in a small number of strategic areas, and onboarding the many people who&#39;ve been hired but haven&#39;t started yet.&#34;\n Later in April, a global director warned of budget cuts and hiring freezes in its marketing department,  according to internal materials viewed by CNBC.\n  Google&#39;s reported decision to rescind offers from contractors and temp workers once again draws attention to a vast portion of the company&#39;s workforce that does not enjoy the same benefits and protections of its full-time employees. Such workers, commonly known inside the company as TVCs (temporary, vendors and contractors) make up at least half of Google&#39;s roughly 300,000-person workforce.\n  But their differential status has been highlighted periodically in Google&#39;s history, like in April when Google told contract workers they could no longer access skills training tools reserved for full-time employees, as  CNBC reported.\n Still, Google has made some concessions to contract workers during the Covid-19 crisis. Google moved to extend contracts for temporary staff whose work was about to end during the crisis by 60 days,  CNBC reported in March.", "posttime": "2020-05-30 05:01:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,临时工,rescind,员工", "title": "谷歌称将撤销对数千名承包商和临时工的工作邀请", "title_en": "Google said to rescind job offers for thousands of contractors, temps", "transed": 1, "url": "https://www.cnbc.com/2020/05/29/google-said-to-rescind-job-offers-for-thousands-of-contractors-temps.html", "via": "", "real_tags": ["google", "谷歌", "临时工", "rescind", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004315, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是对原文章的更新，更短、更简单、更合乎逻辑、更正确。\n许多开发人员工具，如IDE、框架、库和链接器，都试图为JavaScript提供某种级别的类型安全。本文解释了什么是类型安全，为什么需要类型安全，以及如何使用原生JavaScript实现类型安全。\n类型安全是编程语言阻止或防止类型错误的程度。当向函数或表达式提供意外或不兼容的类型值(通常作为参数或上下文)时，会发生类型错误。将一个数字除以一个数组就是一个很好的例子，通常这是没有意义的，但是JavaScript支持这个操作，通常会得到令人惊讶和不想要的结果。\n让我们看看在Javascript中使用一些边缘邪教中流行的简约风格来创建类型错误是多么容易。这是可怕的代码，所以请不要复制它。我们会边走边改进。\n那没花太长时间！当我们向重复调用提供‘-3’参数时，发生第一个类型错误。该值应该是一个整数，但是我们提供了一个字符串。然后所有的地狱都挣脱了。\n当调用Repeats时，它会创建一个“无穷无尽”的循环条件，很快就会消耗其执行环境中的所有可用资源。这会导致NodeJS进程、或浏览器选项卡、或整个浏览器进程或主机操作系统的强制终止。\n如果我们观察While循环中计数值的变化，我们会看到以下一系列：&#39；-3&#39；，&#39；-31&#39；，&#39；-311&#39；，&#39；-3111&#39；，.。测试条件Counts&lt；0确实将Counts字符串转换为数字，但为时已晚：该值始终小于0，并且在每次迭代时都是负值。这是因为表达式COUNTS+=1总是将数字1转换成字符串&#39；1&#39；并将其附加到counts变量。\nJavaScript几乎缺少所有的类型控件，因为它最初并不是用来运行大型应用程序的。没有类型声明，返回类型不可靠，没有静态类型检查，只有一个自己的动态检查。\nJavaScript没有正式声明变量类型的方法。变量可以包含在执行过程中随时可以更改的任何类型。没有标识类型的符号，变量名不受约束。我们可能都见过一两个JavaScript应用程序，在不同的上下文中，单个类似于符号的手表被用作对象、地图、列表、布尔标志、字符串、整数和浮点数。然而，在实践中，JavaScript中使用的大多数变量并不打算更改上下文中的类型，因为这样做会造成不必要的混乱。\n其他语言提供“通配符”变量来引用任何类型的值。它们通常很容易识别，因为它们有一个独特的语法。开发人员知道他们需要小心处理这些“通配符”。在JavaScript中，所有变量都是“通配符”。\nJavaScript表达式的返回类型通常不可靠。许多JavaScript操作符都是多态的，将根据使用的变量类型返回不同类型的值。例如，JavaScript‘+’运算符可以连接字符串、添加数字或将字符串转换为数字。当混合变量类型时，返回值可能会令人吃惊，如下所示。\n//已确认使用Google V8版本6.0.286.52控制台。日志(进程。版本。v8)；var x，y；//expression//|返回值|强制|运算x=3；//|3|-|x=3+1；//|4|-|+num x=3+&#39；1&#39；；//|&#39；31&#39；|3=&gt；&#39；3&#39；|+str x=3+[]；//||&#39；3&#39；|[]=。&#39；|+str x=3+[21]；//|&#39；321&#39；|[21]=&gt；&#39；21&#39；|+str x=3+{}；//|&#39；3[对象对象]&#39；|{}=&gt；str|+str x=&#39；3&#39；-2；//|1|&#39；3&#39；=&gt。3&#39；+2；//|#39；32&#39；|2=&gt；&#39；2&#39；|+str x=+&#39；3&#39；；//|3|&#39；3&#39；=&gt；3|cast_num x=0+&#39；3&#39；；//|&#39；03&#39；|0=&gt；&#39；0&#39；//|nan|-|nan x=y+&#39；3&#39；；//|&#39；unfined3&#39；|undef=&gt；str|+str。\n此行为(使用GoogleV8版本6.0.286.52确认；请参见NodeJavaScript)在四个主要的-e&#39；console.log(process.versions.v8)；&#39；)引擎(V8、IonMonkey、Nitro、Chakra)和其他十几个引擎之间可能是一致的。然而，不太受欢迎的运营商可能在发动机之间存在某些差异，这可能会导致头痛。\n其他语言的行为没有那么复杂，因为它们通常具有更严格的类型检查、更严格的强制规则、更少的多态运算符和更少的供应商。例如，Perl使用点(.)。用于连接字符串的运算符和用于添加数字的加号(+)运算符。Perl还使用$、@和%之类的信号(前缀)来指示类型，并使用特殊语法来标识“通配符”(type-glob)引用。\n许多语言都提供了某种级别的静态类型检查。例如，Java在编译期间解析大多数变量类型。如果JavaScript有类似的机制，我们将无法运行我们的应用程序，直到我们解决了编译错误。在这个虚构世界中，我们的JavaScript编译输出可能如下所示：\n00：OK|x=3；|01：OK|x=3+1；|02：COMPILE_ERROR：TYPE_MISMATCH|x=3+&#39；1&#39；|03：COMPILE_ERROR：TYPE_MISMATCH|x=3+[]；|04：COMPILE_ERROR：TYPE_MISMATCH|x=3+[21]；|06：COMPILE_ERROR：TYPE_MISMATCH|x=3+{}；|07：COMPILE_ERROR：TYPE_MISMATCH|x=&#39。|08：COMPILE_ERROR：TYPE_MISMATCH|x=&#39；3&#39；+2；|09：COMPILE_ERROR：TYPE_MISMATCH|x=+&#39；3&#39；|10：COMPILE_ERROR：TYPE_MISMATCH|x=0+&#39；3&#39；；|11：COMPILE_ERROR：TYPE_MISMATCH|x=y++3；|12：COMPILE_ERROR：TYPE_MISMATCH|x=y+&#39；3&#39；\n静态(编译时)类型检查的最大优点可能是它可以提高性能：在编译过程中可以解析的每个类型检查都会删除每次调用函数或方法时需要调用的类型检查。这可以在应用程序运行时删除大量调用，从而提高性能。\n静态类型检查并非在所有情况下都有效，尤其是在处理来自未知或不可信来源的数据时。在这些情况下，我们求助于运行时的动态类型检查。用于此目的的原生JavaScript工具是有限的。例如，typeof方法不区分对象和数组。\n类型错误可能很难识别和调试。当一个例程未能检查类型时，错误的结果可能会向上传播到调用堆栈，从而导致一连串的错误。如果变量没有命名以指示其预期类型，则很难发现原始缺陷，如下所示：\n//此赋值中的类型错误非常明显，let total_str=watch_list/use_bool；//明显的问题//-从除法运算返回的应该是数字，而不是字符串//-在大多数情况下除以列表将导致NaN//-布尔值将强制为0或1//这里是通过使用正确的类型let total_num=watch_list修复的问题。长度/USE_COUNT；\n是的，预期的变量类型就是那么重要。我们不得不维护大量的第三方模块，在这些模块中，变量名没有提供类型或用途的提示，或者更糟糕的是，它们明显具有误导性。我们宁愿以可变的方式命名我们的变量，并利用节省下来的时间专注于新的挑战。\n正如我们已经展示的，类型错误可能导致严重的应用程序故障和安全漏洞。设想一些NodeJS代码没有正确键入-检查其JSON API。只需在API请求中发送字符串而不是数字，就可以实现拒绝服务(DOS)攻击并关闭整个群集。这种事情时有发生。\n有几种方法可以提高JavaScript类型安全性。一种方法涉及使用库或框架，例如需要转换代码或以其他方式预处理代码的流或打字脚本。在这里，我们提出一个更简单的解决方案，它可能特别适合较小的项目，并且只需要三个步骤。\n就本文而言，类型转换是使用一组非常严格的规则将值转换为所需数据类型的过程。我们的类型转换函数要么返回请求的值类型，要么返回默认情况下未定义的故障值。\n我们可以从hi_core项目中获得易于安装的类型转换方法(在终端中输入npm install hi_core)。如果编辑exampleapplication，则可以使用xhi.util.js中的所有强制转换方法。\nnpm install hi_Score CD hi_Score bin/xhi设置google-chrome./index.html#打开JavaScript控制台访问xhi._util_Functions。\n您不必使用整个库；如果需要，只需从xhi.util.js复制方法即可。去吧，你不会伤害任何人的感情的。这些类型转换方法如下所示，并且在项目中都经过了彻底的测试和良好的文档编制。\n所有类型转换方法都有一个或两个参数。只有当转换明确时，才会在类型之间转换数字、字符串和整数。示例如下所示。\n//return_data=CastInt(&lt；Value-to-Cast&gt；[，&lt；Failure-Value&gt；])；return_data=CastInt(0)；//0 return_data=CastInt(&#39；0&#39；)；//0 return_data=CastInt(&#39；a&#39；)；//未定义的return_data=CastInt([])；//未定义的return_data=CastInt。，0)；//0 return_data=CastInt([]，0)；//0。\nJavaScript试图强制类型，但结果往往不理想。空白单元格是通常会引发类型错误异常的情况。\n强制转换方法是可预测的、显式的和自我记录的，只转换最明确的值。空白单元格是返回失败值(默认情况下未定义)的条件。这些方法不会抛出任何异常。\n让我们调整我们的示例函数以使用CastInt和CastFn，以确保提供的参数是正确的类型。如果不是，该函数将返回，不进行任何进一步处理。\n函数重复(arg_counts，arg_run){var counts=CastInt(Arg_Count)var run=CastFn(Arg_Run)if(！(counts&amp；&amp；run)){return}While(Counts&lt；){Run(Counts)Counts+=1}}函数报告(INFO){console。log(Info)}重复(&#39；-3&#39；，报告)。\n类型转换处理运行时类型检查。静态检查的大多数好处可以通过命名变量来指示它们的预期类型来实现。如果我们遵循这个约定，大多数静态类型错误就会变得不言而喻。让我们使用JS代码标准快速参考中的命名约定重写代码。\n函数repeatFn(Arg_Map){var map=CastMap(arg_map，{})，int=CastInt(map.。_int_，0)，fn=CastFn(贴图。_fn_)，idx；如果(！fn){return；}(idx=int；idx&lt；0；idx++){fn(Idx)；}}函数printToConsole(Idx){console。log(Idx)；}repeatFn({_int_：&#39；-3&#39；，_fn_：printToConsole})；\n此代码现在将传递ESLint。多亏了命名约定，我们可以告诉我们fn应该是一个函数，idx应该立即是一个整数，而不需要阅读其他代码，添加标记注释，或者执行任何转换。\n我们使用的完整JS代码标准讨论了为什么简单的命名约定可以极大地减少注释的需要。如果你对这类东西感兴趣，我们认为这是一本有趣而引人入胜的书。\n现在我们有了一致的按类型命名的变量和更好的格式，我们可以轻松地阅读代码来创建内联API文档。使用代码标准中的指南，我们得到以下内容：\n//BEGIN实用程序方法/REPEATFN/摘要：REPEATFn({_INT_：&lt；INTEGER&gt；，_FN_：&lt；function&gt；)//目的：只要//COUNTER&#39；INT&39；INT&lt；为&lt；0，就重复调用函数&#39；fn&#39；。每次调用后，&#39；int&#39；递增1。如果&#39；int&#39；//的初始值不是&lt；0，则不会调用函数&#39；fn&#39；。//示例：repeatFn({//_int_：-3，//_fn_：function(Idx){console.log(Idx)}//})；//参数：(已命名)//_fn_：要执行的函数。//索引(Idx)的当前值作为其唯一参数提供。//_int_：idx的初始值。idx在执行//_fn_之后递增。因此，值&#39；-1&#39；将导致_fn_(Idx)；//单次执行；//返回：未定义//抛出：无//函数repeFn(Arg_Map){var map=CastMap(arg_map，{})，int=CastInt(map.。_int_，0)，fn=CastFn(贴图。_fn_)，idx；如果(！fn){return；}for(idx=int；idx&lt；0；idx++){fn(Idx)；}}//结束实用程序方法/repeatFn/function printToConsole(Idx){console。log(Idx)；}repeatFn({_int_：&#39；-3&#39；，_fn_：printToConsole})；\n还记得我们在哪里恳求您不要复制我们的第一个代码示例吗？改为复制此代码。它不受大多数类型错误的影响，可读、可测试、可维护、可压缩，并且有很好的文档记录。\n我们可以使用内联API文档以及伊斯坦布尔和nodeunit等工具为类型安全的RepeatFn函数创建测试。查看hi_Score的测试套件，看看如何实现这一点。\n这项简单的技术与流和打字相比如何？我们打算出版一部续集来回答这个问题。\n请记住，只有在处理外部数据和公共方法的输入时才使用类型转换。依靠命名约定在私有方法和变量中传递预期类型的变量。\n我们希望您会发现这一点很有用！请在下面的评论中分享您的想法和经验。", "note_en": "This is an update from the  original article.It is shorter, simpler, more logical, and more correct.\n  Many developer tools like IDEs, frameworks, libraries, and linters tryto provide some level of  type safety to JavaScript. This articleexplains what type safety is, why we want it, and how we can get itusing native JavaScript.\n  Type safety is the extent a programming language discourages or prevents type errors. A type error occurs when an unintended or incompatible typevalue is provided to a function or expression, usually as an argumentor context. Dividing a number by an array is a perfect example.Usually this doesn’t make sense, yet JavaScript support this very operation,often with surprising and unwanted results.\n Let’s see how easy it is to create a type error in Javascript using the tersesemantic style popular in some fringe cults.  This is awful code, so pleasedon’t copy it. We’ll improve it as we go along.\n  That didn’t take long! The first type error occurs when we provide the ‘-3’argument to the  repeats invocation. This value should be an integer, but weinstead provide a string. Then all hell breaks loose.\n When  repeats is invoked it creates an ‘endless’ loop condition that willrather quickly consume all available resources within its executionenvironment. This results in a force-kill of a NodeJS process, or a browsertab, or the entire browser process, or the host OS.\n If we watch the progression of the value of  counts in the  while loop wesee the following series:  &#39;-3&#39;, &#39;-31&#39;, &#39;-311&#39;, &#39;-3111&#39;, .... The testcondition  counts &lt; 0  does convert the  counts string into a number, butby then it is too late: the value is always less than 0 and it only gets morenegative with each iteration. That’s because the expression  counts+=1 alwaysconverts the number  1 into a string  &#39;1&#39; and  appends it to the  countsvariable.\n      JavaScript is missing almost all type controls because it was not originallyintended to run large-scale applications. There are no type declarations,return types are not reliable, there is no static type-checking, and one mustroll-their-own dynamic checking.\n  JavaScript has no means to formally declare a variable type. A variable maycontain any type which may be changed at any time during execution. There areno  sigils to identify type, and a variable name is unconstrained. Weprobably all have seen a JavaScript application or two where a single symbollike  watches is used as an object, a map, a list, a boolean flag, a string,an integer, and a floating point number all in different contexts. Yet inpractice most variables used in JavaScript are not  intended to change type within a context because doing so is needlessly confusing.\n Other languages provide a ‘wild card’ variables to reference any type ofvalue. These are usually easy to identify because they have a unique syntax.Developers know they these ‘wild cards’ need to be handled with care. InJavaScript, all variables are ‘wild cards.’\n  The return types of JavaScript expressions are often not reliable. ManyJavaScript operators are  polymorphic and will return values of differenttypes dependant on the types of variables used. For example, the JavaScript‘+’ operator can concatenate strings  or add numbers  or converts a stringto a number. The return value can be suprising when varilable types are mixedas illustrated below.\n // Confirmed using Google V8 version 6.0.286.52 console . log ( process . versions . v8 ); var  x ,  y ; // expression // | returned value | Coercion | Op x  =  3 ;  // | 3 | - | x  =  3  +  1 ;  // | 4 | - | +num x  =  3  +  &#39; 1 &#39; ;  // | &#39;31&#39; | 3 =&gt; &#39;3&#39; | +str x  =  3  +  [];  // | &#39;3&#39; | [] =&gt; &#39;&#39; | +str x  =  3  +  [  21  ];  // | &#39;321&#39; | [ 21 ] =&gt; &#39;21&#39; | +str x  =  3  +  {};  // | &#39;3[object Object]&#39; | {} =&gt; str | +str x  =  &#39; 3 &#39;  -  2 ;  // | 1 | &#39;3&#39; =&gt; 3 | -num x  =  &#39; 3 &#39;  +  2 ;  // | &#39;32&#39; | 2 =&gt; &#39;2&#39; | +str x  =  +  &#39; 3 &#39; ;  // | 3 | &#39;3&#39; =&gt; 3 | cast_num x  =  0  +  &#39; 3 &#39; ;  // | &#39;03&#39; | 0 =&gt; &#39;0&#39; | +str x  =  y  +  3 ;  // | NaN | - | NaN x  =  y  +  &#39; 3 &#39; ;  // | &#39;undefined3&#39; | undef =&gt; str | +str\n This behavior (confirmed using Google V8 version 6.0.286.52; see  node -e&#39;console.log(process.versions.v8);&#39;) is probably consistent across the acrossthe four primary JavaScript engines (V8, IonMonkey, Nitro, Chakra) and the dozen of others. However less popular operators probably have somevariance across the engines that can cause headaches.\n Other languages have less complex behaviors because they usually have strictertype checking, stricter coercion rules, fewer polymorphic operators, and fewervendors.  Perl, for example, uses the dot ( .) operator to  join stringsand the plus ( +) operator to add numbers. Perl also uses  sigals(prefixes) like  $,  @, and  % to indicate types and a special syntax toidentify ‘wild-card’ (type-glob) references.\n  Many languages provide some level of static type checking.  Java, forexample, resolves most variable types during compilation. If JavaScript had asimilar mechanism we wouldn’t be able to run our application until we resolvedthe compile errors. In this imaginary world, our JavaScript compile outputmight look like this:\n 00: ok | x = 3; |01: ok | x = 3 + 1; |02: compile_error: type_mismatch | x = 3 + &#39;1&#39;; |03: compile_error: type_mismatch | x = 3 + []; |04: compile_error: type_mismatch | x = 3 + [ 21 ]; |06: compile_error: type_mismatch | x = 3 + {}; |07: compile_error: type_mismatch | x = &#39;3&#39; - 2; |08: compile_error: type_mismatch | x = &#39;3&#39; + 2; |09: compile_error: type_mismatch | x = + &#39;3&#39;; |10: compile_error: type_mismatch | x = 0 + &#39;3&#39;; |11: compile_error: type_mismatch | x = y + 3; |12: compile_error: type_mismatch | x = y + &#39;3&#39;; |\n Perhaps the greatest advantage of static (compile-time) type checking is thatit can improve performance: every type check that can be resolved  onceduring a compile removes a type check that would need to be invoked on  everycall of a function or method. This can remove a large number of calls when theapplication is run and thus improves performance.\n  Static type checking does not work in all situations, especially when dealingwith data from unknown or untrusted sources. In those cases we resort to dynamic type checking at run-time. Native JavaScript tools for this purposeare limited. For example, the  typeof method does not distinguish between anobject and an array.\n  Type errors can be hard to identify and debug. When one routine fails to checkfor type an incorrect result can propagate up the call stack resulting in acascade of errors. The originating flaw can be hard to spot if variablearen’t named to indicate their intended type, like so:\n   // Type errors in this assignment are pretty obvious let  total_str  =  watch_list  /  use_bool ; // Problems made obvious // - The return from a divide operation should be a number, not a string // - Dividing a list will result in NaN in most circumstances // - The boolean will coerce to 0 or 1 // Here is the problem fixed by using proper types let  total_num  =  watch_list . length  /  use_count ;\n Yes, the intended variable type  is that important. We’ve had to maintainplenty of third-party modules where variable names provide no hint of type orpurpose, or worse, are patently misleading. We’d rather name our variablessensibly and use the time saved to focus on new challenges.\n  As we have shown, type errors can result in severe application failures andsecurity holes. Imagine some NodeJS code that doesn’t properly type-check itsJSON API. One could implement a Denial Of Service (DOS) attack and shut downan entire cluster by simply sending strings instead of numbers in APIrequests. This stuff happens.\n  There are a few ways to improve JavaScript type safety. One approach involvesusing libraries or frameworks such as  Flow or  TypeScript thatrequire transpiling or otherwise prepocessing the code. Here we propose asimpler solution that may be especially well-suited for smaller projects andrequires only three steps.\n   Typecasting, for the purposes of this article, is the process of converting avalue into the desired data type using a very strict set of rules. Ourtypecasting functions either return  the requested value type or  afailure value which is  undefined by default.\n We can get typecast methods from the  hi_score project which is easy toinstall (type  npm install hi_score into a terminal). If you edit the exampleapplication you can use all the  cast methods from  xhi.util.js.\n npm  install hi_score  cd hi_score bin/xhi setup google-chrome ./index.html  # Open the JavaScript console to access xhi._util_ functions\n You don’t have to use the whole library; you can just crib the methods from xhi.util.js if you want. Go ahead, you won’t hurt anyone’s feelings. Thetypecast methods are as follows and have all been thoroughly tested and quitewell docmented in the project.\n  All typecast methods take one or two arguments. Only numbers, strings, andintegers are converted between types and only when the conversion isunambiguous. Examples are shown below.\n // return_data = castInt( &lt;value-to-cast&gt; [, &lt;failure-value&gt;] ); return_data  =  castInt (  0  );  // 0 return_data  =  castInt (  &#39; 0 &#39;  );  // 0 return_data  =  castInt (  &#39; a &#39;  );  // undefined return_data  =  castInt (  []  );  // undefined return_data  =  castInt (  &#39; a &#39; ,  0  );  // 0 return_data  =  castInt (  [],  0  );  // 0\n JavaScript tries hard to coerce types, and the results are often undesirable.Blank cells are conditions where a type error exception is usually thrown.\n  The  cast methods are they are predictable, explicit, and self-documenting.The only convert the most unambigous values. Blank cells are conditions wherethe failure value ( undefined by default) will be returned. No exceptionsare thrown by these methods.\n   Let’s adjust our example function to use  castInt and  castFn to ensure theprovided arguments are the correct type. If they are not, the function willreturn without any further processing.\n function  repeats ( arg_counts ,  arg_run ) {  var  counts  =  castInt ( arg_counts )  var  run  =  castFn ( arg_run )  if  ( ! ( counts  &amp;&amp;  run )){ return }  while  ( counts  &lt;  0 )  {  run ( counts )  counts += 1  } } function  reports ( info ) {  console . log ( info ) } repeats ( &#39; -3 &#39; ,  reports )\n   Typecasting handles run-time type checking. Most benefits of static checkingcan be realized by naming our variables to indicate their intended type. Moststatic type errors become self-evident if we adhere to this convention. Let’srewrite our code using the name convention from the  JS Code standard quickreference.\n function  repeatFn  (  arg_map  )  {  var  map  =  castMap (  arg_map ,  {}  ),  int  =  castInt (  map . _int_ ,  0  ),  fn  =  castFn (  map . _fn_  ),  idx  ;  if  (  !  fn  )  {  return ;  }  for  (  idx  =  int ;  idx  &lt;  0 ;  idx ++  )  {  fn (  idx  );  } } function  printToConsole  (  idx  )  {  console . log (  idx  );  } repeatFn ({  _int_  :  &#39; -3 &#39; ,  _fn_  :  printToConsole  });\n This code will now pass ESLint. Thanks to the naming convention we can tellthat tell that  fn should be a function and and  idx should be an integerimmediately without the need to read other code, add mark-up comments, oremploy any transpiling.\n The  full JS Code standard we use discusses  why a simple namingconvention can vastly reduce the need for comments. We think it’s aninteresting and compelling read if you’re into that kind of thing.\n Now that we have consistent named-by-type variables and better formatting, wecan easily read the code to create in-line API documentation. Using the guidefrom the  code standard we get the following:\n // BEGIN utility method /repeatFn/ // Summary : repeatFn({ _int_ : &lt;integer&gt;, _fn_ : &lt;function&gt; ) // Purpose : Repeatedly call a function &#39;fn&#39; as long as the // counter &#39;int&#39; is &lt; 0. After each call, &#39;int&#39; is // incremented by 1. If the initial value of &#39;int&#39; // is not &lt; 0 the function &#39;fn&#39; is not called. // Example : repeatFn({ // _int_ : -3, // _fn_ : function (idx ) { console.log( idx ) } // }); // Arguments : ( named ) // _fn_ : The function to execute. The current value of the // index (idx) is provided as its sole argument. // _int_ : The initial value of idx. Idx is incremented after // _fn_ is executed. Thus a value of &#39;-1&#39; will result in a // single execution of _fn_( idx ); // Returns : undefined // Throws : none // function  repeatFn  (  arg_map  )  {  var  map  =  castMap (  arg_map ,  {}  ),  int  =  castInt (  map . _int_ ,  0  ),  fn  =  castFn (  map . _fn_  ),  idx  ;  if  (  !  fn  )  {  return ;  }  for  (  idx  =  int ;  idx  &lt;  0 ;  idx ++  )  {  fn (  idx  );  } } // END utility method /repeatFn/ function  printToConsole  (  idx  )  {  console . log (  idx  );  } repeatFn ({  _int_  :  &#39; -3 &#39; ,  _fn_  :  printToConsole  });\n Remember where we begged you not to copy our first code example? Copy thiscode instead. It is impervious to most type errors, readable, testable,maintainable, compressable, and well documented.\n We can use the in-line API docs along with tools like  Istanbul and nodeunit to create tests for our type-safe  repeatFn function. Check outthe test suite for  hi_score to see how this can be accomplished.\n  How does this simple technique compare with  Flow and  TypeScript? Westill intend to publish a sequel that will answer this question.\n Remember to use typcasting only when processing external data and inputs ofpublic methods. Rely on the name convention to communicate intended type ofvariables in private methods and variables.\n We hope you found this useful! Please share your thoughts and experiences inthe comments below.", "posttime": "2020-05-30 04:45:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,safety,类型", "title": "原生JavaScript的类型安全", "title_en": "Type Safety with Native JavaScript", "transed": 1, "url": "https://mmikowski.github.io/typecast-02/", "via": "", "real_tags": ["java", "safety", "类型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004314, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当涉及两个以上变量时，优化太阳能电池优化可能会变得复杂。由于变量之间的潜在相互作用，天真的方法是穷尽地探索每一种可能的组合，这项任务随着变量数量的增加呈指数级增长，很快就成为家庭实验者不可能完成的任务。一种更简单的方法是将大型项目分解为组件，每个组件都有一个可以独立优化的主要功能。一旦确定了该函数，任务就简化为一系列单变量优化。在我的太阳能电池设计中，我首先确定了每一层的主要功能，不包括先前开发的导电膏状触点。\n从导电的锡氧化层开始，我开始探索我在上一篇文章中停止的地方。在1-2%的范围内使用锑作为掺杂剂的进一步测试产生了非常不稳定的结果，只是偶尔生产出足够高质量的太阳能电池导电玻璃。我相信这可能是因为锡和氯化锑的挥发性不同，使得成功沉积对温度有很高的依赖性。出于这个原因，我重新使用氟作为掺杂剂，使用我之前的方法。最终，我决定使用0.40M氯化亚锡和0.10M氟化二铵的蒸馏水溶液，这种溶液在大约500摄氏度的温度下喷涂在窗户玻璃上时，可以可靠地产生高度透明的导电涂层。根据最初的文章，我发现15毫升的这种溶液对大小为3英寸乘3英寸的玻璃来说是足够的。\n转到氧化锌半导体层，我发现去除之前使用的硼掺杂剂效果不大。此外，多篇研究论文表明，在ZnO/Cu2O太阳电池中加入较大比例的镁可以使ZnO/Cu2O太阳电池的禁带宽度变宽，从而提高电池的开路电压。通过实验，我发现含有0.40M醋酸锌和0.04M醋酸镁的溶液在大约2%的乙酸中产生的电池电压最高。只需要少量的这种溶液，大约需要5ml就可以形成合适的涂层。\n到目前为止，铜氧化层需要的时间投资最大。在电镀溶液中掺入各种杂质的尝试普遍遭到失败，要么没有效果，要么毁了电镀液。然而，在这次实验中，我发现了一种独特的溶液制备程序，它可以在不使用外部掺杂剂的情况下生成高度透明和中等导电性的氧化铜层。\n我没有像以前那样使用预制的乳酸钠，而是从LotionCrafter购买的50毫升水和25毫升90%乳酸开始。为此，我加入了10克硫酸铜，它在搅拌和温和加热的情况下非常缓慢地溶解。一旦它完全溶解，然后我把温度提高到80摄氏度，让溶液在四个小时的过程中蒸发到40毫升。最后，在搅拌时滴加6M氢氧化钠溶液，慢慢调节pH值至10，然后用蒸馏水调节体积至100ml。上面的图片记录了这个过程。有趣的是，这种溶液是不言而喻的；在中性pH时，它会变成深蓝黑色，当pH达到10时，它会变得略微紫色和透明。\n这一过程的结果是电镀液在室温下略有粘性，以至于pH纸在打破表面之前会在液体中形成压痕。我相信这是因为蒸发过程，当硫酸铜溶解，铜被乳酸络合时，会形成游离的硫酸盐(硫酸)，这是一种已知的乳酸聚合催化剂。我的理论是短链聚乳酸是在溶液中形成的，它是一种比乳酸单体更好的络合剂。不幸的是，我无法证实这一点。无论如何，在应用中，这种粘性镀液有两个有趣的特性。首先，它非常稳定，可以煮或冷冻，没有明显的降解。其次，在70-80摄氏度的温度和大约1-3 mA/cm的电流密度下，它将沉积一层基本上没有雾气的透明氧化铜，类似于红色彩色玻璃。这种类型的层没有针孔，并且可以在几乎没有开路电压损失的情况下硫化。当我能够可靠地生产这种材料时，我认为这一层已经完成了。\n最后，硫化铜层的优化是完全直截了当的。将由前三层组成的电池浸泡在硫化钠的稀溶液中会产生一层薄薄的硫化铜导电层，该溶液的浓度被限制在大约0.001M。超过该值会产生不规则的硫化物层，\n作为我的导电玻璃的延伸，这种制造太阳能电池的方法同样简单，一般的家庭实验者都可以完成，而且不需要机床或其他昂贵的设备。以这种方式生产的电池可以用作电源或光传感器，并且机械性能足够坚固，可以很容易地集成到其他设备中。在我开始这个项目刚一年多的时候，我现在认为它已经完成了。希望其他人能够复制和改进我在这里的工作，并将太阳能进一步带入业余实验领域。不过现在，我将继续制作更简单的东西。\n指数", "note_en": "Optimized Solar Cell\r          Optimization can become complex when more than two variables are involved. Due to potential interactions between variables, the naive approach is to exhaustively explore every possible combination, a task which grows exponentially as the number of variables increases, quickly becoming impossible for the home experimenter. A simpler approach is to break down a large project into components, each of which has a single primary function that can be optimized independently. Once this function is identified, the task is reduced to a series of single-variable optimizations. In the case of my solar cell design, I first identified the primary function of each layer, excluding the conductive paste contacts which had been developed  earlier.\n    Starting with the conductive tin oxide layer, I began exploring where I left off in my previous  article. Further tests using antimony as a dopant in the range of 1-2% yielded highly variable results, only occasionally producing conductive glass of a high enough quality for solar cells. I believe this is possibly due to a difference in volatility between the tin and antimony chlorides, making successful deposition highly temperature-dependent. For this reason I returned to using fluorine as a dopant, using my  earlier method. Ultimately, I settled on using a solution of 0.40M stannous chloride and 0.10M ammonium bifluoride in distilled water, which reliably produced a highly transparent conductive coating when sprayed on window glass at roughly 500C. As per the original article, I found 15mL of this solution to be adequate for glass up to 3 by 3 inches in size.\n  Moving on to the zinc oxide semiconducting layer, I found that removing the previously-used boron dopant had little effect. Furthermore, a number of research papers indicated that adding magnesium in fairly large proportions could widen the bandgap of zinc oxide, increasing the open-circuit voltage of ZnO/Cu2O solar cells. Through experimentation I found that a solution containing 0.40M zinc acetate and 0.04M magnesium acetate in roughly 2% acetic acid produced cells with the highest voltage. Only a small amount of this solution is necessary, with roughly 5mL being needed to form a suitable coating.\n  The copper oxide layer required the largest time investment by far. Attempts to dope the plating solution with various impurities were universally met with failure, by either having no effect or by ruining the plating bath. During this experimentation however, I discovered a unique procedure for preparing the solution, which results in a highly transparent and moderately conductive copper oxide layer without the use of external dopants.\n          Rather than using pre-made sodium lactate as I had done  previously, I began with 50mL of water and 25mL of 90% lactic acid, which I purchased from  Lotioncrafter. To this I added 10 grams of copper sulfate, which dissolved very slowly with stirring and gentle heating. Once it had fully dissolved, I then raised the temperature to 80C and let the solution evaporate down to 40mL over the course of four hours. Finally, I slowly adjusted the pH to 10 by adding 6M sodium hydroxide solution dropwise while stirring, then adjusted the volume to 100mL with distilled water. This process is documented in the pictures above. Interestingly, the solution is self-indicating; it becomes a dark blue-black at a neutral pH, then becomes slightly purple and transparent when the pH reaches 10.\n  The result of this procedure is a plating bath that is slightly viscous at room temperature, to the extent that pH paper will form an indentation in the liquid before breaking the surface. I believe that this is due to the evaporation process; as the copper sulfate dissolves and the copper is complexed by lactic acid, free sulfate (sulfuric acid) is formed, which is a known polymerization catalyst for lactic acid. My theory is that short-chain polylactic acid is formed in solution, which is a better complexing agent than the lactic acid monomer. Unfortunately, I have no way of verifying this. Regardless, in application this viscous plating bath has two interesting properties. First, it is extremely stable and can be boiled or frozen with no visible degradation. Second, at a temperature of 70-80C and a current density of roughly 1-3mA/cm, it will deposit a substantially haze-free layer of transparent copper oxide, resembling red stained glass. This type of layer has no pinholes, and can be sulfided with little to no loss of open-circuit voltage. When I could produce this type of material reliably, I considered this layer completed.\n  Finally, the optimization of the copper sulfide layer was entirely straightforward. Dipping a cell made up of the previous three layers into a dilute solution of sodium sulfide creates a thin conductive layer of copper sulfide, the concentration of this solution being limited to roughly 0.001M. Exceeding this creates an irregular sulfide layer, which tends to flake off. The only remaining variable, then, is dipping time. Long exposure tends to create leakage paths through the copper oxide layer, and through experimentation I found that the useful range is between 1 and 10 seconds, with 3 seconds producing the optimal balance of open-circuit voltage and short-circuit current. After this process, the cell can be rinsed with tap water; distilled water could be used for tighter process control, but I haven&#39;t found this necessary.\n  With all of the layers optimized, I then encountered one final problem. Cells produced this way would, if exposed to sunlight for an hour or two, permanently lose roughly half of their open-circuit voltage. I determined that this was likely caused by residual water inside the cell. An additional drying step for 30 minutes at 110C eliminated this problem, although cells produced this way still temporarily lose some voltage when exposed to light or heat. At this point the optimization was complete, so I made a number of large (1-1/2 x 2 inch) solar cells and documented the procedure in the video below. The solar cell shown in the video (and at the top of the page) has a maximum open-circuit voltage of 525mV and a maximum short-circuit current of 6.5mA, or roughly 0.9mA/cm over an active area of 7.5cm.\n\r\r      As an extension of my conductive glass, this method for making solar cells is likewise simple enough for the average home experimenter to accomplish, and requires no machine tools or other expensive equipment. The cells produced this way can be used as power sources or light sensors, and are mechanically robust enough to be easily incorporated into other devices. At just over a year since I began this project, I now consider it complete. Hopefully others will be able to replicate and improve upon my work here, and bring solar power further into the realm of amateur experimentation. For now though, I will return to making simpler things.\n        Index", "posttime": "2020-05-30 04:30:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "简化,optimized,电池", "title": "简化优化型太阳能电池", "title_en": "Simplifier – Optimized Solar Cell", "transed": 1, "url": "https://simplifier.neocities.org/optsolar.html", "via": "", "real_tags": ["简化", "optimized", "电池"]}, {"category": "", "categoryclass": "", "imagename": "187ac2f2c258eaba2dabbf420146e9ef.jpg", "infoid": 1004313, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "写字楼里的工作人员可能面临暴露于2019年导致冠状病毒病的病毒的风险(新冠肺炎)。写字楼雇主、大楼业主和管理人员以及大楼运营专家可以采取措施，创造一个安全健康的工作场所，并保护工人和客户。\n首先回顾疾控中心针对企业和雇主的临时指南。这将提供所有雇主都可以用来保护其员工和客户的指导方针和建议。\n确保您设施内的通风系统运行正常。对于已关闭或受阻的建筑供暖、通风和空调(HVAC系统)，请查看ASHRAE Standard 180-2018《商业建筑HVAC系统检查和维护的标准实践》pdf图标外部图标中提供的新施工启动指南。\n通过打开门窗、使用风扇等方法尽可能增加新风的流通。不要打开窗户和门，如果这样做会对当前或以后的居住者(包括儿童)造成安全或健康风险(例如，允许一氧化碳、霉菌或花粉等室外环境污染物进入建筑物)。\n评估建筑物及其机械和生命安全系统，以确定建筑物是否已准备好投入使用。检查与长时间设施关闭相关的危险，如霉菌生长外部图标、啮齿动物或害虫pdf图标外部图标或积水系统问题，并采取适当的补救措施。\n对工作场所的外部图标进行彻底的危险评估，以识别可能增加新冠肺炎传播风险的潜在工作场所危险。\n确定员工可以与他人密切接触(6英尺以内)的工作和公共区域，例如会议室、休息室、自助餐厅、更衣室、登记区域、候机区和进出路线。\n将工作场所的所有员工纳入沟通计划-例如，管理层、员工、公用事业员工、救援员工、清洁员工、维护员工和监督员工。\n如果承包商受雇于工作场所，应制定计划，与承包公司就修改工作流程和承包商的要求进行沟通，以防止新冠肺炎传染。\n使用控制层次结构开发危险控制，以减少工人之间的传播。包括以下所述控件组合。\n修改或调整座椅、家具和工作站pdf图标外部图标，以保持员工之间6英尺的社交距离。在可能的情况下安装透明盾牌或其他物理屏障，在不允许社交距离的情况下将员工和访客分开。\n安排接待处或其他公共座位区的椅子，方法是转动、覆盖(用胶带或布料覆盖椅子，使座位不能使用)、间隔或移走椅子，以保持社交距离。\n使用各种方法在设施的所有区域(包括工作区和其他区域，如会议室、休息室、停车场、出入口区域和更衣室)对员工进行物理隔离。使用标志、胶带标记或其他视觉提示，如地板上的贴纸或彩色胶带，间隔6英尺，以指示当无法设置物理障碍时应站在哪里。\n将高接触的公共物品，如咖啡壶、饮水机和散装零食，替换为预包装的单一服务物品。\n采取措施改善建筑内的通风状况：提高新风百分比(例如，使用节能器模式的HVAC操作)，可能高达100%(首先验证与HVAC系统的温湿度控制能力以及与室外/室内空气质量考虑因素的兼容性)。\n在环境条件和建筑要求允许的情况下，考虑使用自然通风(即，在可能的情况下打开窗户，这样做是安全的)，以增加室外空气对室内空气的稀释。\n改善中央空气过滤：在不显著降低设计风量的情况下，将空气过滤外部图标调至尽可能高(MERV 13或14)。\n检查滤清器外壳和机架以确保适当的滤清器安装，并检查是否有最大限度地减少滤清器旁路的方法。\n通过重新评估送风和排气扩散器和/或风门的位置，并调整区域送风和排气流速以建立可测量的压差，生成从干净到较不干净的空气流动PDF图标外部图标。让员工在“干净”通风区服务的区域工作，这些区域不包括游客接待处或健身设施(如果开放)等高风险区域。\n考虑使用便携式高效微粒空气(HEPA)风扇/过滤系统来帮助增强空气净化pdf图标外部图标(特别是在高风险区域)。\n当大楼被占用时，确保洗手间设施中的排气扇正常工作并满负荷运转。\n考虑使用紫外线杀菌照射(UVGI)pdf图标外部图标作为帮助灭活病毒的补充。\n积极鼓励有新冠肺炎症状的员工或与新冠肺炎同在家中有生病家属的员工通知上级，留在家中。\n上班时似乎有症状的员工或白天生病的员工应该立即与其他人分开，如果他们不使用口罩，就应该提供口罩，并送回家，并向他们的医疗保健专业人员提供如何跟进的说明和指导。\n生病的员工应遵循疾控中心建议的步骤。员工在与医疗保健提供者协商后，在满足停止家庭隔离的标准之前，不应重返工作岗位。\n在怀疑或确认患有新冠肺炎的人进入工作场所后，进行加强清洁消毒。\n考虑在员工进入工作现场之前对其进行日常面对面或虚拟健康检查(例如，症状和/或体温筛查)。\n有关如何安全地进行员工筛查的指导，请参阅疾控中心新冠肺炎的一般业务常见问题。\n制定和实施政策，防止员工在等待筛选时聚集在一起，并保持员工之间6英尺的间隔。\n尽可能错开班次、开始时间和休息时间，以降低公共区域(如筛选区、休息室和更衣室)的员工密度。\n考虑在停车场和入口处张贴标志，要求客人和参观者在到达设施时从车里打电话通知管理或保安。\n考虑在停车场和入口处张贴标志，要求客人和参观者尽可能穿着布面覆盖物，如果他们生病了不要进入大楼，如果可能的话，离员工6英尺远。\n对高接触表面进行清洁消毒，遵循清洁消毒指导，制定、遵循、维护定期清洁计划，降低人们接触导致表面新冠肺炎的病毒的风险。\n定期清洁工作场所中所有经常接触的表面，如工作站、键盘、电话、扶手、打印机/复印机、饮水机和门把手。如果坚硬的表面明显被污染(脏)，在消毒前用洗涤剂或肥皂和水清洗。\n对于消毒，最常见的，EPA注册的家用消毒剂应该是有效的，以及稀释的家用漂白剂或含至少70%酒精的酒精溶液。环保局网站上提供了一份经环保局批准用于对抗导致新冠肺炎外部图标的病毒的产品清单。遵守所有清洁和消毒产品的制造商说明(例如，浓度、使用方法和接触时间)。\n为员工提供一次性湿巾和其他清洁材料，以便他们在每次使用前都能正确擦拭经常接触的表面。\n让员工有足够的时间洗手，并获得肥皂、清水和一次性纸巾。提醒员工勤洗手，经常用肥皂和水洗手至少20秒。如果没有肥皂和水，他们应该使用含至少60%酒精的洗手液。\n建立社交疏远的政策和做法：提醒员工，即使人们没有表现出症状，也可能会传播新冠肺炎。将与员工、客户和其他人的所有密切互动(6英尺以内)视为潜在的风险来源。\n限制电梯的使用和占用，以保持至少6英尺的社交距离。\n鼓励在任何小组活动中使用户外座位区和社交距离，如午餐、休息和会议。\n对于使用公共交通或拼车上下班的员工，考虑提供以下支持：向员工提供激励，鼓励他们使用最大限度减少与他人近距离接触的交通方式，例如为独自上下班或单人乘车的停车提供报销。\n在入口处和关键位置张贴标志和提示，指导手部卫生、新冠肺炎症状和咳嗽打喷嚏礼仪。如果需要，这应该包括非英语国家的标志。\n员工在业务的所有区域都应该穿着布面遮盖住鼻子和嘴巴。(工业和信息化部电子科学技术情报研究所陈皓)。\n美国疾病控制与预防中心建议佩戴布面罩作为一种措施，以遏制佩戴者的呼吸道飞沫，并有助于保护他们的同事和普通公众。如果员工呼吸困难，无法忍受佩戴，或者在没有帮助的情况下无法将其取下，则员工在工作时不应佩戴面罩。布面覆盖物不被认为是个人防护装备。他们可能会阻止工作人员，包括那些不知道自己感染了病毒的人，将病毒传播给其他人，但可能不会保护穿戴者免受导致新冠肺炎的病毒的影响。\n提醒员工和客户，疾控中心建议在其他社交距离措施难以维持的公共场所穿戴布质面罩，特别是在以社区为基础的重要传播区域。然而，戴上布质面罩并不能取代练习社交距离的需要。\n沟通和培训应易于理解，使用员工所说或所读的首选语言，并包含准确和及时的信息。主题应该包括感染的迹象和症状、生病时呆在家里、社交距离、个人防护装备、手卫生习惯，以及识别和最大限度地减少在工作场所、家庭和社区的潜在传播途径。可以根据当地的情况和需要考虑其他主题。\nCDC有免费、简单的海报可供下载和打印，其中一些海报被翻译成不同的语言。\n提供有关员工感到不适时应采取哪些措施的信息和培训(例如，工作场所休假政策、当地和州卫生部门信息)。\n阅读CDC面向企业和雇主的临时指南，了解有关创建新病假政策、清洁和员工沟通政策的更多建议，以帮助保护您的员工和客户。\n你作为雇主，有责任回应新冠肺炎的关切，并告知员工你工作场所的危险。你可以使用这些额外的来源了解更多关于降低工作中接触新冠肺炎的风险的信息：", "note_en": "Workers in office buildings may be at risk for exposure to the virus that causes coronavirus disease 2019 (COVID-19). Office building employers, building owners and managers, and building operations specialists can take steps to create a safe and healthy workplace and protect workers and clients.\n Start by reviewing the  CDC Interim Guidance for Businesses and Employers. This will provide guidelines and recommendations that all employers can use to protect their workers and clients.\n Ensure that ventilation systems in your facility operate properly. For building heating, ventilation, and air conditioning (HVAC systems) that have been shut down or on setback, review new construction start-up guidance provided in  ASHRAE Standard 180-2018, Standard Practice for the Inspection and Maintenance of Commercial Building HVAC Systems pdf icon   external icon .\n Increase circulation of outdoor air as much as possible by opening windows and doors, using fans, and other methods. Do not open windows and doors if doing so poses a safety or health risk for current or subsequent occupants, including children (e.g., allowing outdoor environmental contaminants including carbon monoxide, molds, or pollens into the building).\n Evaluate the building and its mechanical and life safety systems to determine if the building is ready for occupancy. Check for hazards associated with prolonged facility shutdown such as  mold growth external icon ,  rodents or pests pdf icon   external icon , or  issues with stagnant water systems, and take appropriate remedial actions.\n Conduct a thorough  hazard assessment external icon  of the workplace to identify potential workplace hazards that could increase risks for COVID-19 transmission.\n Identify work and common areas where employees could have close contact (within 6 feet) with others — for example meeting rooms, break rooms, the cafeteria, locker rooms, check-in areas, waiting areas, and routes of entry and exit.\n Include all employees in the workplace in communication plans — for example management, staff, utility employees, relief employees, janitorial staff, maintenance staff, and supervisory staff.\n If contractors are employed in the workplace, develop plans to communicate with the contracting company regarding modifications to work processes and requirements for the contractors to prevent transmission of COVID-19.\n Develop hazard controls using  the hierarchy of controls to reduce transmission among workers. Include a combination of controls noted below.\n Modify or adjust seats, furniture, and workstations pdf icon   external icon  to maintain social distancing of 6 feet between employees. Install transparent shields or other physical barriers where possible to separate employees and visitors where social distancing is not an option.\n Arrange reception or other communal seating area chairs by turning, draping (covering chair with tape or fabric so seats cannot be used), spacing, or removing chairs to maintain social distancing.\n Use methods to physically separate employees in all areas of the facilities including work areas and other areas such as meeting rooms, break rooms, parking lots, entrance and exit areas, and locker rooms. Use signs, tape marks, or other visual cues such as decals or colored tape on the floor, placed 6 feet apart, to indicate where to stand when physical barriers are not possible.\n Replace high-touch communal items, such as coffee pots, water coolers, and bulk snacks, with alternatives such as pre-packaged, single-serving items.\n Take steps to improve ventilation in the building: Increase the percentage of outdoor air (e.g., using economizer modes of HVAC operations) potentially as high as 100% (first verify compatibility with HVAC system capabilities for both temperature and humidity control as well as compatibility with outdoor/indoor air quality considerations).\n   Consider using natural ventilation (i.e., opening windows if possible and safe to do so) to increase outdoor air dilution of indoor air when environmental conditions and building requirements allow.\n Improve central air filtration: Increase air filtration external icon  to as high as possible (MERV 13 or 14) without significantly diminishing design airflow.\n Inspect filter housing and racks to ensure appropriate filter fit and check for ways to minimize filter bypass\n  Generate clean-to-less-clean air movement  pdf icon   external icon by re-evaluating the positioning of supply and exhaust air diffusers and/or dampers and adjusting zone supply and exhaust flow rates to establish measurable pressure differentials. Have staff work in areas served by “clean” ventilation zones that do not include higher-risk areas such as visitor reception or exercise facilities (if open).\n Consider using portable high-efficiency particulate air (HEPA) fan/filtration systems to help  enhance air cleaning pdf icon   external icon  (especially in higher risk areas).\n Ensure exhaust fans in restroom facilities are functional and operating at full capacity when the building is occupied.\n Consider using  ultraviolet germicidal irradiation (UVGI) pdf icon   external icon  as a supplement to help inactivate the virus.\n Actively encourage employees who have  symptoms of COVID-19 or who have a sick family member at home with COVID-19 to notify their supervisor and stay home.\n Employees who appear to have  symptoms upon arrival at work or who become sick during the day should immediately be separated from others, provided a face mask if they are not using one, and sent home with instructions and guidance on how to follow-up with their health care professional.\n Sick employees should follow  CDC-recommended steps. Employees should not return to work until the criteria to  discontinue home isolation are met, in consultation with their healthcare provider.\n Perform enhanced  cleaning and disinfection after anyone suspected or confirmed to have COVID-19 has been in the workplace.\n Consider conducting daily in-person or virtual health checks (e.g., symptoms and/or temperature screening) of employees before they enter the work site.\n See  CDC’s COVID-19 General Business FAQs for guidance on how to safely conduct employee screening.\n Develop and implement a policy to prevent employees from congregating in groups while waiting for screening, and maintain a 6-foot separation between employees.\n Stagger shifts, start times, and break times as feasible to reduce the density of employees in common areas such as screening areas, break rooms, and locker rooms.\n Consider posting signs in parking areas and entrances that ask guests and visitors to phone from their cars to inform the administration or security when they reach the facility.\n Consider posting signs in parking areas and entrances that ask guests and visitors to wear cloth face coverings if possible, to not enter the building if they are sick, and to stay 6 feet away from employees, if possible.\n Clean and disinfect high-touch surfaces Follow the  Guidance for Cleaning and Disinfecting to develop, follow, and maintain a plan to perform regular cleanings to reduce the risk of people’s exposure to the virus that causes COVID-19 on surfaces.\n Routinely clean all frequently touched surfaces in the workplace, such as workstations, keyboards, telephones, handrails, printer/copiers, drinking fountains, and doorknobs. If hard surfaces are visibly soiled (dirty), clean them using a detergent or soap and water before you disinfect them.\n For disinfection, most common, EPA-registered, household disinfectants should be effective as well as  diluted household bleach solutions or alcohol solutions with at least 70% alcohol. A list of  products that are EPA-approved for use against the virus that causes COVID-19 external icon  is available on the EPA website. Follow the manufacturer’s instructions for all cleaning and disinfection products (e.g., concentration, application method, and contact time).\n Provide employees with disposable wipes and other cleaning materials so that they can properly wipe down frequently touched surfaces before each use.\n Provide employees adequate time to wash their hands and access to soap, clean water, and single use paper towels. Remind employees to  wash their hands often with soap and water for at least 20 seconds. If soap and water are not available, they should use hand sanitizer with at least 60% alcohol.\n Establish policies and practices for social distancing: Remind employees that people may be able to spread COVID-19 even if they do not show symptoms. Consider all close interactions (within 6 feet) with employees, clients, and others as a potential source of exposure.\n  Limit use and occupancy of elevators to maintain social distancing of at least 6 feet.\n Encourage the use of outdoor seating areas and social distancing for any small group activities such as lunches, breaks, and meetings.\n For employees who commute to work using public transportation or ride sharing, consider offering the following support: Offer employees incentives to use forms of transportation that minimize close contact with others, such as offering reimbursement for parking for commuting to work alone or single-occupancy rides.\n Post signs and reminders at entrances and in strategic places providing instruction on  hand hygiene,  COVID-19 symptoms, and  cough and sneeze etiquette. This should include signs for non-English speakers, as needed.\n   Employees should wear  a cloth face covering to cover their nose and mouth in all areas of the business.\n CDC recommends wearing a cloth face covering as a measure to contain the wearer’s respiratory droplets and help protect their co-workers and members of the general public. Employees should not wear cloth face coverings at work if they have trouble breathing, any inability to tolerate wearing it, or if they are unable to remove it without assistance. Cloth face coverings are not considered personal protective equipment. They may prevent workers, including those who don’t know they have the virus, from spreading it to others but may not protect the wearers from exposure to the virus that causes COVID-19.\n Remind employees and clients that CDC recommends wearing cloth face coverings in public settings where other social distancing measures are difficult to maintain,  especially in areas of significant community-based transmission. Wearing a cloth face covering, however, does not replace the need to practice social distancing.\n Communication and training should be easy to understand, be in preferred languages spoken or read by the employees, and include accurate and timely information. Topics should include signs and symptoms of infection, staying home when ill, social distancing, personal protective equipment, hand hygiene practices, and identifying and minimizing potential routes of transmission at work, at home, and in the community. Other topics may be considered based on local context and need.\n CDC has free, simple  posters available to download and print, some of which are translated into different languages.\n Provide information and training on what actions employees should take when they are not feeling well (e.g., workplace leave policies, local and state health department information).\n Read the  CDC Interim Guidance for Businesses and Employers to learn about more recommendations for creating new sick leave policies, cleaning, and employee communication policies to help protect your workers and clients.\n You, as the employer, are responsible for responding to COVID-19 concerns and informing employees of the hazards in your workplace. You can use these additional sources for more information on reducing the risk of exposures to COVID-19 at work:", "posttime": "2020-05-30 04:29:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建议,recommends,员工", "title": "CDC建议对美国办事处进行全面改革", "title_en": "CDC recommends sweeping changes to American offices", "transed": 1, "url": "https://www.cdc.gov/coronavirus/2019-ncov/community/office-buildings.html", "via": "", "real_tags": ["建议", "员工"]}, {"category": "", "categoryclass": "", "imagename": "587281d78f50fd46b41927cc7d666828.jpg", "infoid": 1004310, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索肯特州立大学枪击案(也称为5月4日大屠杀或肯特州立大学大屠杀)，[3][4][5]1970年5月4日，俄亥俄州国民警卫队在俄亥俄州肯特市枪杀了13名手无寸铁的肯特州立大学学生。这些杀戮事件发生在一次和平集会上，抗议美国军队将越南战争扩大到中立的柬埔寨，以及国民警卫队在校园的存在。这一事件标志着美国历史上第一次有学生在反战集会中遇害。\n28名国民警卫队士兵在13秒内发射了大约67发子弹，造成4名学生死亡，9人受伤。19岁的学生艾莉森·贝丝·克劳斯(Allison Beth Krause)、20岁的杰弗里·格伦·米勒(Jeffrey Glenn Miller)、20岁的桑德拉·李·舍尔(Sandra Lee Scheuer)和19岁的威廉·诺克斯·施罗德(William Knox Schroeder)遇难，另有9人受伤。除施罗德外，所有人都在现场死亡，不久后，施罗德在附近拉文纳的罗宾逊纪念医院被宣布死亡。[6][7]。\n克劳斯和米勒等300多名学生聚集在一起，抗议柬埔寨运动的扩大。一周前，美国总统理查德·尼克松(Richard Nixon)在4月30日的电视讲话中宣布了这一计划。Scheuer和Schroeder是在距离射击线300多英尺的地方观察过程的数百人中的一员，其中许多人像他们一样是在课间。[8][9]。\n这起致命的枪击事件立即在全国各地的校园引发了巨大的愤怒。超过400万名学生参加了数百所大学、学院和高中的有组织的罢工，这是美国历史上规模最大的此类罢工，如果不是世界上的话。1970年的学生罢工进一步影响了公众舆论，当时美国在越南战争中的角色已经引起了社会争议。[11]。\n在理查德·尼克松上任之前，在约翰·F·肯尼迪和林登·B·约翰逊总统的领导下，越南战争已经升级。在约翰逊的领导下，美国在越南的驻军人数从1963年他取代肯尼迪时的1.6万人飙升至1968年的50多万人，但没有取得切实的成果。1968年尼克松当选时，他承诺结束冲突。然而，1969年11月，美军在越南一个村庄屠杀347至504名平民的美莱大屠杀事件被曝光，这加剧了越南各地特别是年轻人的反对。1969年12月1日，当第二次世界大战以来的第一次征兵抽签发生时，参军的性质也发生了变化。新程序消除了之前选秀过程中允许的延期，让许多大学生和教师对自己眼前的未来不确定。\n1970年入侵柬埔寨的升级激怒了那些认为这只会扩大冲突并入侵一个中立的主权国家而加剧冲突的人。在美国各地，校园爆发了抗议活动，“时代”周刊称这是一场全国性的学生罢工，为1970年5月初的事件埋下了伏笔。\n1968年秋天，学生争取民主社会(SDS)和校园黑人学生组织举行静坐抗议校园内的警察招聘人员。250名黑人学生走出校园，成功争取特赦抗议者。[12]。\n1969年4月1日，SDS成员试图带着与警方发生冲突的要求清单进入行政大楼。作为回应，该大学撤销了肯特州立大学SDS章节宪章。4月16日，涉及两名抗议者的纪律听证会导致SDS的支持者和反对者之间发生了对抗。俄亥俄州公路巡逻队接到电话，58人被捕。由于这一事件，四名SDS领导人被判入狱6个月。[12]\n1970年4月10日，青年国际党(又称伊比派)领导人杰里·鲁宾在校园里讲话。在当地报道的评论中，他说：依皮计划的第一部分是杀死你的父母。他们是第一批压迫者。两周后，前学生、SDS成员比尔·安东雷尔(Bill Anthrell)在一次活动中分发传单，他说他要在活动中给一只狗加凝固汽油弹。这场活动原来是一场反对凝固汽油弹的宣讲活动。[12]。\n尼克松总统宣布柬埔寨入侵是由美国作战部队发起的。\n在肯特州立大学，大约500名学生于5月1日在下议院(位于校园中心的一个传统上用作集会或抗议集会场所的长满草的小山)上举行了一场示威活动。随着人群在下午1点前散去上课，计划在5月4日举行另一场集会，以继续抗议越南战争扩大到柬埔寨。这引起了广泛的愤怒，许多抗议者呼吁将战争带回家。一群历史系学生埋葬了一本美国宪法，象征尼克松杀死了它。[13]树上挂了一个牌子，上面写着：&#34；为什么后备军大楼还屹立不倒？&#34；[14]。\n午夜时分，当人们离开一家酒吧，开始向警车投掷啤酒瓶，并打破市中心店面的窗户时，镇上的麻烦爆发了。在这个过程中，他们打碎了一扇银行窗户，引发了警报。消息传得很快，为了避免麻烦，几家酒吧提前关门。不久，更多的人加入了破坏公物的行列。\n警察赶到时，已经聚集了120人。人群中的一些人在街上点燃了一堆小篝火。人群中似乎混合了骑自行车的人、学生和路过的人。人群中的一些人开始向警察投掷啤酒瓶，然后开始向他们大喊大叫。整个肯特郡的警察部队以及来自该县和周边社区的警察都被召去执勤。肯特州市长勒罗伊·萨特罗姆(LeRoy Satrom)宣布进入紧急状态，打电话给俄亥俄州州长吉姆·罗兹(Jim Rhodes)的办公室寻求帮助，并下令关闭所有酒吧。提前关闭酒吧的决定只会加剧该地区的紧张局势。警方最终成功地使用催泪瓦斯驱散了市中心的人群，迫使他们搬回了几个街区的校园。[9]。\n市政府官员和市中心的企业收到了威胁，谣言四起，称激进革命者在肯特郡摧毁了这座城市和大学。几个商家报告说，他们被告知，如果他们不展示反战口号，他们的生意将被烧毁。肯特郡警察局长告诉市长，根据一位可靠的线人，后备役部队大楼、当地的征兵站和邮局当晚都是被摧毁的目标。[15]有未经证实的谣言说，学生们藏匿武器，密谋在当地供水中加入LSD，还有学生修建隧道，目的是炸毁镇上的主要商店。[16]萨特罗姆会见了肯特市官员和俄亥俄州陆军国民警卫队的一名代表。由于谣言和威胁，萨特罗姆担心地方官员无法处理未来的骚乱。[9]会后，萨特罗姆决定打电话给罗兹，请求向肯特派遣国民警卫队，这一请求立即得到了批准。\n召集国民警卫队的决定是在下午5点做出的，但保安直到晚上10点左右才到达镇上。这时，校园里正在进行一场大规模的示威活动，校园预备役军官训练团(ROTC)大楼正在燃烧。[17]纵火犯从未被逮捕，也没有人在火灾中受伤。根据总统校园骚乱委员会的报告：\n美国联邦调查局(FBI)对后备役军官学校大楼火灾的调查显示，在积极参与火灾的人中，很大一部分是肯特州立大学的学生。也有证据表明焚烧是事先计划好的：铁路照明弹、砍刀和冰锥通常不会携带到和平集会上。[18]\n有报道称，肯特郡的一些消防员和警察在试图扑灭大火时被石头和其他物体击中。几家消防车公司不得不被叫来，因为抗议者把消防水龙带进了下议院，并砍伤了它。[19][20][21]国民警卫队逮捕了许多人，主要是因为违反宵禁，并使用了催泪瓦斯；至少有一名学生被刺刀轻伤。[22]。\n在肯特消防站的一次记者招待会上，情绪激动的罗兹州长敲打着桌子，在他的演讲录音中可以听到他的敲打声。[24]他称学生抗议者不是美国人，称他们是决心摧毁俄亥俄州高等教育的革命者。\n我们在肯特市看到的情况尤其明显，这可能是持不同政见者团体迄今犯下的最恶毒的校园暴力形式。他们制定了明确的焚烧、摧毁和向警察、国民警卫队和公路巡逻队投掷石块的计划。……这就是我们要动用俄亥俄州执法机构的每一个部门把他们赶出肯特郡的时候。我们要根除这个问题。我们不打算治疗这些症状。.而这些人只是从一个校园搬到另一个校园，恐吓整个社区。他们比棕色衬衫、共产主义分子、夜间骑手和义务警员还要糟糕。他们是我们在美国收容的最坏的一类人。现在我想说的是。他们不会接管校园。我认为我们面对的是美国有史以来最强大、训练有素、好斗的革命组织。[25]。\n罗兹还声称，他将获得法院命令，宣布进入紧急状态，禁止进一步的示威活动，并给人的印象是已经宣布了类似戒严令的情况；然而，他从未试图获得这样的命令。[9]。\n当天，一些学生在骚乱发生后来到肯特郡市中心帮助清理工作，当地商人对此反应不一。萨特罗姆市长迫于惊恐的市民的压力，下令宵禁，直到另行通知。\n晚上8点左右，校园下议院举行了另一场集会。到晚上8点45分，警卫队使用催泪瓦斯驱散人群，学生们在林肯和美因河交叉口重新集结，举行静坐示威，希望能与市长萨特罗姆和大学校长罗伯特·怀特会面。晚上11点，警卫宣布宵禁生效，并开始强迫学生返回宿舍。有几个学生被卫兵用刺刀刺伤。[26][26]。\n5月4日(星期一)，按照三天前的计划，抗议活动原定于中午举行。大学官员试图禁止集会，分发了12000份传单，声明活动被取消。尽管做出了这些努力，估计仍有2000人聚集在泰勒霍尔附近的大学公共场所。抗议活动开始时，校园里的铁制胜利钟(历史上曾被用来标志足球比赛的胜利)敲响，标志着集会的开始，第一名抗议者开始讲话。\nA连和C连，俄亥俄州国民警卫队(ARNG)第2/107装甲骑兵(ARNG)的1/145步兵和G部队，试图驱散学生。驱散的合法性后来在随后的不当死亡和伤害审判中进行了辩论。在上诉时，美国第六巡回上诉法院裁定当局确实有权驱散人群。[28][28]\n驱散过程在上午晚些时候开始，校园巡警哈罗德·赖斯(Harold Rice，29岁)乘坐一辆国民警卫队吉普车，走近学生，宣读驱散或面临逮捕的命令。抗议者的回应是投掷石块，击中一名校园巡警，并迫使吉普车撤退。[9]。\n就在中午之前，警卫回来了，再次命令人群驱散。当大多数人群拒绝时，警卫使用了催泪瓦斯。由于有风，催泪瓦斯几乎没有驱散人群的作用，一些人向警卫队的防线发射了第二批石块，并高喊着离开校园的猪！学生们向戴着防毒面具的国民警卫队投掷催泪瓦斯罐。\n当人群显然不会驱散时，A连和G部队的77名国民警卫队士兵开始向数百名抗议者推进，他们的M1加兰步枪上固定着刺刀。随着卫兵的推进，抗议者在毯子山上空撤退，离开了公共区域。翻过小山后，学生们松散地沿着泰勒大厅的前面向东北方向移动，一些学生继续向普伦蒂斯大厅前面的停车场(略在泰勒大厅的东北方向，与泰勒大厅垂直)前进。卫兵们追赶抗议者翻过小山，但他们没有像抗议者那样向左转，而是继续笔直前进，走向一个被铁丝网围栏围住的运动练习场。他们在这里呆了大约10分钟，不知道如何离开这个地区，除了返回他们的路径：他们把自己困在了一个用栅栏围起来的角落里。在此期间，大部分学生聚集在大约150至225英尺(46至69米)外的警卫左边和前面，在泰勒大厅的阳台上。其他人散布在泰勒大厅和普伦蒂斯大厅停车场之间，还有一些人站在停车场里，或者按照之前的命令分散在停车场。\n而在练习场上，警卫们一般都面对着大约100码(91米)远的停车场。他们中的一些人一度跪下并将武器对准停车场，然后又站了起来。卫兵们一度松散地挤成一团，似乎在互相交谈。他们已经清除了下议院地区的抗议者，许多学生已经离开，但一些人留了下来，仍然愤怒地与士兵对峙，一些人投掷石块和催泪瓦斯。大约10分钟后，卫兵们开始沿着他们的脚步回到山上，向公共区域进发。泰勒大厅阳台上的一些学生开始慢慢地向士兵们走去，因为他们越过了山顶，回到了下议院。\n在他们爬回毛毯山的过程中，几名警卫停了下来，半转身盯着学徒堂停车场的学生。据目击者称，下午12点24分，一位名叫迈伦·普赖尔(Myron Pryor)的中士转过身，开始用他的.45手枪向学生人群开枪。离学生最近的一些警卫也转身向学生开枪。总体而言，77名警卫中至少有29人声称使用了他们的武器，估计使用了67发子弹。尽管约翰·基夫纳(John Kifner)在“纽约时报”(New York Times)上报道称，枪击似乎持续了整整一分钟或更长时间，但枪击事件被确定为持续了13秒。关于为什么要开枪的问题仍存在广泛争论。\n俄亥俄州国民警卫队副总司令告诉记者，一名狙击手向卫兵开枪，这仍是一个有争议的指控。许多卫兵后来作证说，他们担心自己的生命安全，这在一定程度上受到了质疑，部分原因是他们与死伤学生之间的距离。“时代”杂志后来得出结论，肯特州立大学并非意外扣动扳机。总统校园骚乱委员会避免调查枪击事件发生的原因。取而代之的是，它严厉批评了抗议者和卫兵，但它得出的结论是，不分青红皂白地向一群学生开枪并随后造成的死亡是不必要的，没有理由的，也是不可原谅的。\n突然，他们转过身来，跪了下来，好像他们被命令了，他们一起做，瞄准了。就我个人而言，我站在那里说，他们不会开枪的，他们不能那样做。如果他们要开枪，那就是一片空白。[35]。\n子弹肯定是朝我这边来的，因为当子弹从你头上擦过时，就会裂开。我撞到了弯道后面的地面，抬头看了看。我看到一个学生被撞了。他被绊倒了，跌倒在他朝汽车跑去的地方。另一个学生试图把他拉到车后，子弹从车窗射进来。\n当这个学生落在汽车后面时，我看到另一个学生倒在路边，在汽车的另一边，大约离我躺的地方有25或30码。可能是25秒、30秒、35秒的零星射击。\n枪声停止了。我躺在那里大概10到15秒。我站起来，看到四五个学生在停车场周围躺着。到了这个时候，这就像是集体歇斯底里。学生们在哭，他们在尖叫救护车。我听到一些女孩的尖叫声，她们没有空白，她们没有空白，没有，她们没有。\n另一位目击者是克里西·海德(Chrissie Hynde)，她是普雷德斯乐队未来的主唱，当时是肯特州立大学(Kent State University)的学生。在2015年的自传中，她描述了她所看到的：\n然后我听到了纹身的声音。我还以为是烟花呢。一种怪异的声音传遍了大街小巷。安静的感觉就像是重力把我们拉到了地上。然后一个年轻人的声音：他们他妈的杀了人！一切都放慢了脚步，寂静变得更加沉重。\n后备军大楼现在只有几英寸厚的木炭，被国民警卫队包围。他们都单膝跪着，用步枪指着.。我们!。然后他们开枪了。\n当我走到我可以看到他们的地方时，仍然不清楚发生了什么。卫兵们自己看起来都惊呆了。我们看着他们，他们也看着我们。他们只是孩子，19岁，和我们一样。但是穿着制服。就像我们在越南的孩子一样。[36]。\n德沃未来的贝斯手/歌手杰拉尔德·卡萨莱(Gerald Casale)也目睹了枪击事件。[37]在2005年接受《佛蒙特州评论》采访时，他回忆了自己看到的情况：\n我能告诉你的是，它彻底彻底地改变了我的生活。我是一个白人嬉皮士男孩，然后我看到两个我认识的人的背部有M1步枪的出口伤口。\n四个遇难者中有两个是我的朋友，杰弗里·米勒和艾莉森·克劳斯。我们都在躲避这些狗娘养的。这完全是彻头彻尾的胡说八道。实弹和防毒面具--我们谁也不知道，谁也想不到.。他们朝正在逃离他们的人群开枪！\n我不再是嬉皮士，我开始产生权力下放的想法。我真的，真的很生气。[38]。\n枪击事件发生后，许多愤怒的学生立即准备向国民警卫队发动全面攻击。以地质学教授兼教员元帅格伦·弗兰克(Glenn Frank)为首的许多教职员工恳求学生离开下议院，不要屈服于暴力升级：\n我不在乎你们这辈子是不是从来没有听过任何人的话。我现在求你了。如果你现在不散开，他们就会搬进来，那只能是一场屠杀。请你听我说好吗？上帝啊，我不想成为这件事的一部分……哦！[39]。\n演讲20分钟后，学生们离开了下议院，救护车人员在照看伤员，警卫也离开了该地区。弗兰克教授的儿子也在场，他说：“他绝对救了我和数百人的命。”\n..", "note_en": "Jump to navigation  Jump to search  The  Kent State shootings (also known as the  May 4 massacre or the  Kent State massacre),  [3]  [4]  [5] were the shootings of 13 unarmed  Kent State University students in  Kent, Ohio by the  Ohio National Guard on May 4, 1970. The killings took place during a peace rally against the  expanding involvement of the Vietnam War into  neutral Cambodia by United States military forces as well as the National Guard presence on campus. The incident marked the first time that a student had been slain in an anti-war gathering in United States history.\n Twenty-eight  National Guard soldiers fired approximately 67 rounds over a period of 13 seconds, killing four students and wounding nine others. Students  Allison Beth Krause, 19,  Jeffrey Glenn Miller, 20,  Sandra Lee Scheuer, 20, and  William Knox Schroeder, 19, were killed and nine others were injured, one of whom suffered permanent  paralysis. All perished at the scene except Schroeder, who was pronounced dead at  Robinson Memorial Hospital in nearby Ravenna shortly afterward.  [6]  [7]\n Krause and Miller were among the upward of 300 students who had gathered to protest the expansion of the Cambodian Campaign, which President  Richard Nixon had announced in an April 30 television address one week earlier. Scheuer and Schroeder were in the crowd of several hundred others who had been observing the proceedings at distances of more than 300 feet from the firing line, many like them between classes.  [8]  [9]\n The fatal shootings triggered immediate and massive outrage at campuses around the country. More than 4 million students participated in organized walk-outs at hundreds of universities, colleges and high schools, the largest such strike in the history of the United States if not the world. The  student strike of 1970  [10] further affected public opinion at an already socially contentious time over the  role of the United States in the Vietnam War.  [11]\n    The  Vietnam War had escalated under Presidents  John F. Kennedy and  Lyndon B. Johnson before  Richard Nixon took office. Under Johnson, the number of American troops in Vietnam soared from 16,000 when he replaced Kennedy in 1963 to more than 500,000 in 1968 but with no tangible results. When Nixon was elected  in 1968, he promised to end the conflict. However, in November, 1969, the  My Lai Massacre by American troops of between 347 and 504 civilians in a Vietnamese village was exposed, which heightened opposition especially among younger people around the country. The nature of military participation also changed on Dec. 1, 1969, when the first  draft lottery since World War II took place. The new procedure eliminated deferments allowed in the prior draft process, leaving many college students and teachers unsure of their immediate futures.\n The escalation of the  invasion of Cambodia in 1970 angered those who believed it only exacerbated the conflict by enlarging it and invading a neutral, sovereign nation. Across the U.S., campuses erupted in protests in what   Time called &#34;a nation-wide student strike&#34;, setting the stage for the events of early May, 1970.\n   In the fall of 1968, the  Students for a Democratic Society (SDS) and a campus Black Student Organization staged a  sit-in to protest police recruiters on campus. Two hundred fifty black students walked off campus in a successful amnesty bid for the protesters.  [12]\n On April 1, 1969, SDS members attempted to enter the administration building with a list of demands where they clashed with police. In response, the university revoked the Kent State SDS chapter charter. On April 16 a disciplinary hearing involving two of the protesters resulted in a confrontation between supporters and opponents of SDS. The  Ohio State Highway Patrol was called and fifty-eight people were arrested. Four SDS leaders spent six months in prison as a result of the incident.  [12]\n On April 10, 1970,  Jerry Rubin, a leader of the  Youth International Party (also known as the Yippies), spoke on campus. In remarks reported locally, he said: &#34;The first part of the Yippie program is to kill your parents. They are the first oppressors.&#34; Two weeks after that, Bill Anthrell, an SDS member and former student, distributed flyers to an event in which he said he was going to  napalm a dog. The event turned out to be an anti-napalm  teach-in.  [12]\n   President Nixon announced that the &#34; Cambodian Incursion&#34; had been launched by United States combat forces.\n  At Kent State University, a demonstration with about 500 students  [13] was held on May 1 on the Commons (a grassy knoll in the center of campus traditionally used as a gathering place for rallies or protests). As the crowd dispersed to attend classes by 1 p.m., another rally was planned for May 4 to continue the protest of the  expansion of the Vietnam War into  Cambodia. There was widespread anger, and many protesters issued a call to &#34;bring the war home&#34;. A group of history students buried a copy of the  United States Constitution to symbolize that Nixon had killed it.  [13] A sign was put on a tree asking: &#34;Why is the  ROTC building still standing?&#34;  [14]\n Trouble exploded in town around midnight, when people left a bar and began throwing beer bottles at police cars and breaking windows in downtown storefronts. In the process they broke a bank window, setting off an alarm. The news spread quickly and it resulted in several bars closing early to avoid trouble. Before long, more people had joined the vandalism.\n By the time police arrived, a crowd of 120 had already gathered. Some people from the crowd lit a small bonfire in the street. The crowd appeared to be a mix of bikers, students, and transient people. A few members of the crowd began to throw beer bottles at the police, and then started yelling obscenities at them. The entire Kent police force was called to duty as well as officers from the county and surrounding communities. Kent Mayor  LeRoy Satrom declared a  state of emergency, called the office of Ohio Governor  Jim Rhodes to seek assistance, and ordered all of the bars closed. The decision to close the bars early only served to increase tensions in the area. Police eventually succeeded in using  tear gas to disperse the crowd from downtown, forcing them to move several blocks back to the campus.  [9]\n  City officials and downtown businesses received threats, and rumors proliferated that radical revolutionaries were in Kent to destroy the city and university. Several merchants reported they were told that if they did not display anti-war slogans, their businesses would be burned down. Kent&#39;s police chief told the mayor that according to a reliable informant, the  ROTC building, the local army recruiting station, and post office had been targeted for destruction that night.  [15] There were unconfirmed rumors of students with caches of arms, plots to spike the local water supply with  LSD, and of students building tunnels for the purpose of blowing up the town&#39;s main store.  [16] Satrom met with Kent city officials and a representative of the  Ohio Army National Guard. Because of the rumors and threats, Satrom feared that local officials would not be able to handle future disturbances.  [9] Following the meeting, Satrom made the decision to call Rhodes and request that the National Guard be sent to Kent, a request that was granted immediately.\n The decision to call in the National Guard was made at 5:00 p.m., but the guard did not arrive in town that evening until around 10 p.m. By this time, a large demonstration was underway on the campus, and the campus  Reserve Officers&#39; Training Corps (ROTC) building was burning.  [17] The arsonists were never apprehended, and no one was injured in the fire. According to the report of the  President&#39;s Commission on Campus Unrest:\n Information developed by an FBI investigation of the ROTC building fire indicates that, of those who participated actively, a significant portion weren&#39;t Kent State students. There is also evidence to suggest that the burning was planned beforehand: railroad flares, a machete, and ice picks are not customarily carried to peaceful rallies.  [18]\n There were reports that some Kent firemen and police officers were struck by rocks and other objects while attempting to extinguish the blaze. Several fire engine companies had to be called because protesters carried the fire hose into the Commons and slashed it.  [19]  [20]  [21] The National Guard made numerous arrests, mostly for curfew violations, and used tear gas; at least one student was slightly wounded with a  bayonet.  [22]\n  During a press conference at the Kent firehouse, an emotional Governor Rhodes pounded on the desk,  [23] pounding which can be heard in the recording of his speech.  [24] He called the student protesters un-American, referring to them as revolutionaries set on destroying higher education in Ohio.\n We&#39;ve seen here at the city of Kent especially, probably the most vicious form of campus-oriented violence yet perpetrated by dissident groups... they make definite plans of burning, destroying, and throwing rocks at police and at the National Guard and the Highway Patrol. ...this is when we&#39;re going to use every part of the law enforcement agency of Ohio to drive them out of Kent. We are going to eradicate the problem. We&#39;re not going to treat the symptoms. ...and these people just move from one campus to the other and terrorize the community. They&#39;re worse than the  brown shirts and the communist element and also the  night riders and the vigilantes. They&#39;re the worst type of people that we harbor in America. Now I want to say this. They are not going to take over [the] campus. I think that we&#39;re up against the strongest, well-trained, militant, revolutionary group that has ever assembled in America.  [25]\n Rhodes also claimed he would obtain a court order declaring a state of emergency that would ban further demonstrations and gave the impression that a situation akin to  martial law had been declared; however, he never attempted to obtain such an order.  [9]\n During the day, some students came to downtown Kent to help with clean-up efforts after the rioting, actions which were met with mixed reactions from local businessmen. Mayor Satrom, under pressure from frightened citizens, ordered a curfew until further notice.\n Around 8 p.m., another rally was held on the campus Commons. By 8:45 p.m., the Guardsmen used tear gas to disperse the crowd, and the students reassembled at the intersection of Lincoln and Main, holding a sit-in with the hopes of gaining a meeting with Mayor Satrom and University President Robert White. At 11:00 p.m., the Guard announced that a curfew had gone into effect and began forcing the students back to their dorms. A few students were bayoneted by Guardsmen.  [26]\n    On Monday, May 4, a protest was scheduled to be held at noon, as had been planned three days earlier. University officials attempted to ban the gathering, handing out 12,000 leaflets stating that the event was canceled. Despite these efforts, an estimated 2,000 people gathered  [27] on the university&#39;s Commons, near Taylor Hall. The protest began with the ringing of the campus&#39;s iron Victory Bell (which had historically been used to signal victories in football games) to mark the beginning of the rally, and the first protester began to speak.\n Companies A and C, 1/ 145th Infantry and Troop G of the 2/ 107th Armored Cavalry, Ohio National Guard (ARNG), the units on the campus grounds, attempted to disperse the students. The legality of the dispersal was later debated at a subsequent wrongful death and injury trial. On appeal, the  United States Court of Appeals for the Sixth Circuit ruled that authorities did indeed have the right to disperse the crowd.  [28]\n The dispersal process began late in the morning with campus patrolman Harold Rice  [29] riding in a National Guard Jeep, approaching the students to read an order to disperse or face arrest. The protesters responded by throwing rocks, striking one campus patrolman and forcing the Jeep to retreat.  [9]\n Just before noon, the Guard returned and again ordered the crowd to disperse. When most of the crowd refused, the Guard used  tear gas. Because of wind, the tear gas had little effect in dispersing the crowd, and some launched a second volley of rocks toward the Guard&#39;s line and chanted &#34;Pigs off campus!&#34; The students lobbed the tear gas canisters back at the National Guardsmen, who wore  gas masks.\n When it became clear that the crowd was not going to disperse, a group of 77 National Guard troops from A Company and Troop G, with bayonets fixed on their  M1 Garand rifles, began to advance upon the hundreds of protesters. As the guardsmen advanced, the protesters retreated up and over Blanket Hill, heading out of the Commons area. Once over the hill, the students, in a loose group, moved northeast along the front of Taylor Hall, with some continuing toward a parking lot in front of Prentice Hall (slightly northeast of and perpendicular to Taylor Hall). The guardsmen pursued the protesters over the hill, but rather than veering left as the protesters had, they continued straight, heading toward an athletic practice field enclosed by a chain link fence. Here they remained for about 10 minutes, unsure of how to get out of the area short of retracing their path: they had boxed themselves into a fenced-in corner. During this time, the bulk of the students congregated to the left and front of the guardsmen, approximately 150 to 225 ft (46 to 69 m) away, on the veranda of Taylor Hall. Others were scattered between Taylor Hall and the Prentice Hall parking lot, while still others were standing in the parking lot, or dispersing through the lot as they had been previously ordered.\n While on the practice field, the guardsmen generally faced the parking lot, which was about 100 yards (91 m) away. At one point, some of them knelt and aimed their weapons toward the parking lot, then stood up again. At one point the guardsmen formed a loose huddle and appeared to be talking to one another. They had cleared the protesters from the Commons area, and many students had left, but some stayed and were still angrily confronting the soldiers, some throwing rocks and tear gas canisters. About 10 minutes later, the guardsmen began to retrace their steps back up the hill toward the Commons area. Some of the students on the Taylor Hall veranda began to move slowly toward the soldiers as they passed over the top of the hill and headed back into the Commons.\n  During their climb back to Blanket Hill, several guardsmen stopped and half-turned to keep their eyes on the students in the Prentice Hall parking lot. At 12:24 p.m.,  according to eyewitnesses, a sergeant named Myron Pryor turned and began firing at the crowd of students with his .45 pistol.  A number of guardsmen nearest the students also turned and fired their rifles at the students. In all, at least 29 of the 77 guardsmen claimed to have fired their weapons, using an estimate of 67 rounds of ammunition. The shooting was determined to have lasted 13 seconds, although John Kifner reported in  The New York Times that &#34;it appeared to go on, as a solid volley, for perhaps a full minute or a little longer.&#34;  [32] The question of why the shots were fired remains widely debated.\n    The  adjutant general of the Ohio National Guard told reporters that a  sniper had fired on the guardsmen, which remains a debated allegation. Many guardsmen later testified that they were in fear for their lives, which was questioned partly because of the distance between them and the students killed or wounded.  Time magazine later concluded that &#34;triggers were not pulled accidentally at Kent State.&#34; The  President&#39;s Commission on Campus Unrest avoided probing the question of why the shootings happened. Instead, it harshly criticized both the protesters and the Guardsmen, but it concluded that &#34;the indiscriminate firing of rifles into a crowd of students and the deaths that followed were unnecessary, unwarranted, and inexcusable.&#34;  [34]\n    Suddenly, they turned around, got on their knees, as if they were ordered to, they did it all together, aimed. And personally, I was standing there saying, they&#39;re not going to shoot, they can&#39;t do that. If they are going to shoot, it&#39;s going to be blank.  [35]\n  The shots were definitely coming my way, because when a bullet passes your head, it makes a crack. I hit the ground behind the curve, looking over. I saw a student hit. He stumbled and fell, to where he was running towards the car. Another student tried to pull him behind the car, bullets were coming through the windows of the car.\n As this student fell behind the car, I saw another student go down, next to the curb, on the far side of the automobile, maybe 25 or 30 yards from where I was lying. It was maybe 25, 30, 35 seconds of sporadic firing.\n The firing stopped. I lay there maybe 10 or 15 seconds. I got up, I saw four or five students lying around the lot. By this time, it was like mass hysteria. Students were crying, they were screaming for ambulances. I heard some girl screaming, &#34;They didn&#39;t have blank, they didn&#39;t have blank,&#34; no, they didn&#39;t.  [35]\n Another witness was  Chrissie Hynde, the future lead singer of  The Pretenders and a student at Kent State University at the time. In her 2015 autobiography she described what she saw:\n  Then I heard the tatatatatatatatatat sound. I thought it was fireworks. An eerie sound fell over the common. The quiet felt like gravity pulling us to the ground. Then a young man&#39;s voice: &#34;They fucking killed somebody!&#34; Everything slowed down and the silence got heavier.\n The ROTC building, now nothing more than a few inches of charcoal, was surrounded by National Guardsmen. They were all on one knee and pointing their rifles at ... us! Then they fired.\n By the time I made my way to where I could see them it was still unclear what was going on. The guardsmen themselves looked stunned. We looked at them and they looked at us. They were just kids, 19 years old, like us. But in uniform. Like our boys in Vietnam.  [36]\n Gerald Casale, the future bassist/singer of  Devo, also witnessed the shootings.  [37] While speaking to the  Vermont Review in 2005, he recalled what he saw:\n  All I can tell you is that it completely and utterly changed my life. I was a white hippie boy and then I saw exit wounds from M1 rifles out of the backs of two people I knew.\n Two of the four people who were killed, Jeffrey Miller and Allison Krause, were my friends. We were all running our asses off from these motherfuckers. It was total, utter bullshit. Live ammunition and gasmasks—none of us knew, none of us could have imagined ... They shot into a crowd that was running away from them!\n I stopped being a hippie and I started to develop the idea of devolution. I got real, real pissed off.  [38]\n  Immediately after the shootings, many angry students were ready to launch an all-out attack on the National Guard. Many faculty members, led by geology professor and faculty marshal  Glenn Frank, pleaded with the students to leave the Commons and to not give in to violent escalation:\n I don&#39;t care whether you&#39;ve never listened to anyone before in your lives. I am begging you right now. If you don&#39;t disperse right now, they&#39;re going to move in, and it can only be a slaughter. Would you please listen to me? Jesus Christ, I don&#39;t want to be a part of this ... !  [39]\n After 20 minutes of speaking, the students left the Commons, as ambulance personnel tended to the wounded, and the Guard left the area. Professor Frank&#39;s son, also present that day, said, &#34;He absolutely saved my life and hundreds of others&#34;. \n......", "posttime": "2020-05-30 03:57:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "枪击案,state,学生", "title": "肯特州枪击案", "title_en": "Kent State Shootings", "transed": 1, "url": "https://en.wikipedia.org/wiki/Kent_State_shootings", "via": "", "real_tags": ["枪击案", "state", "学生"]}, {"category": "", "categoryclass": "", "imagename": "b33a25f1b3f42b20e6582f5f7a0e0b49.jpg", "infoid": 1004309, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在撰写本文时，Kubernetes大约6岁，在过去的两年中，它的受欢迎程度不断上升，一直是最受欢迎的平台之一。今年，它成为第三大最受欢迎的平台。如果您还没有听说过Kubernetes，那么它是一个允许您运行和编排容器工作负载的平台。\n容器最初是一个Linux内核进程隔离构造，它包含2007年的cgroup和2002年的名称空间。当LXC在2008年可用时，容器变得更像是一种东西，Google开发了自己的内部“在容器中运行所有东西的机制”，名为Borg。快进到2013年，Docker发布，彻底普及了面向群众的货柜。当时，Mesos是编排容器的主要工具，然而，它并没有被广泛采用。Kubernetes于2015年发布，并迅速成为事实上的容器编排标准。\n为了试图理解库伯内斯的受欢迎程度，让我们考虑一些问题。开发人员上一次就部署生产应用程序的方式达成一致是什么时候？您知道有多少开发人员按开箱即用方式运行工具？今天有多少云运营工程师不了解应用程序的工作原理？我们将在本文中探索答案。\n来自木偶和厨师的世界，Kubernetes的一个重大转变是从作为代码的基础设施转向作为数据的基础设施-具体地说，就是YAML。Kubernetes中的所有资源，包括实例、配置、部署、卷等，都可以简单地表示为一个YAML文件。例如：\napiVersion：v1Kind：PODMEDATA：名称：站点和标签：Podadata应用程序：WebSpec：容器：-Name：前端端口：nginx：nginx端口：-ContainerPort：80%-ContainerPort：80-ContainerPort：-ContainerPort：80。\n这种表示使DevOps或站点可靠性工程师更容易完全表达他们的工作负载，而不需要用Python、Ruby或Javascript等编程语言编写代码。\nGitOps或Git Operations版本控制。使用这种方法，您可以将所有的Kubernetes YAML文件保存在git存储库中，这样您就可以准确地知道何时进行了更改、由谁进行了更改，以及具体更改了哪些内容。这提高了整个组织的透明度，避免了成员需要去哪里查找他们需要的东西的模棱两可，从而提高了效率。同时，只需合并一个拉流请求，就可以更轻松地自动更改Kubernetes资源。\n可扩展性。通过将资源定义为YAML，集群运营商可以非常轻松地更改Kubernetes资源中的一两个数字来改变伸缩行为。Kubernetes具有水平Pod Autoscaler，可帮助您确定特定部署必须能够处理低流量和高流量所需的最小和最大Pod数量。例如，如果您运行的展开可能需要更多容量，因为流量突然增加，则可以将maxReplicas从10更改为20：\napiVersion：autoscaling/v2beta2ind：HorizontalPodAutoscaler元数据：名称：myapp配置名称空间：defaultspec：配置比例TargetRef：配置配置apiVersion：app/v1配置配置类型：部署配置配置名称：myapp-Deployment：minReplicas：1配置maxReplicas：20配置规格：配置类型：配置类型：配置资源配置类型。\n安全和控制。YAML是验证在Kubernetes中部署了什么以及如何部署内容的好方法。例如，当涉及到安全性时，一个重要的问题是您的工作负载是否以非root用户身份运行。我们可以使用像conftest这样的工具(一个YAML/JSON验证器)和Open Policy Agent(一个策略验证器)来检查您的工作负载的SecurityContext是否允许容器作为根运行。为此，用户可以使用简单的Open Policy Agent rego策略，如下所示：\n软件包mainden[msg]{*input.ind=&#34；Deployment&#34；不是input.spec.template.spec.securityContext.runAsNonRoot=true。容器不能以根用户身份运行。}。\n云提供商集成。科技行业的一个主要趋势是在公共云提供商中运行工作负载。在云提供商组件的帮助下，Kubernetes允许每个集群与其运行的云提供商集成。例如，如果用户在AWS的Kubernetes中运行应用程序，并希望可以通过服务访问该应用程序，云提供商将帮助自动创建LoadBalancer服务，该服务将自动调配Amazon Elastic Load Balizer以将流量转发到应用程序Pod。\nKubernetes具有很强的可扩展性，开发人员非常喜欢这一点。现有的资源有Pod、Deployment、StatefulSet、Secrets、ConfigMaps等，但用户和开发人员可以通过自定义资源定义的形式添加更多资源。例如，如果我们想定义一个CronTab资源，我们可以使用如下内容来实现：\napiVersion：apitensions.k8s.io/v1Kind：CustomResourceDefinitionMetadata：名称：crontdis.my.orgspec：ngroup：my.org；版本：apiversion1-name：v1；apiversions.k8s.io服务的类型：true；存储：true：crontab.my.orgspea：cstomResourceDefinitionMetadata：crontdis.my.orgspec：组：my.org；版本：-name：v1；类型：Object：True；存储：True；：Schema：；打开APIV3Schema：；类型：Object：：Object：Object_。*类型：对象*属性：*；^(\\d+|\\*)(/\\d+)？(\\s+(\\d+|\\*)(/\\d+)？){4}$&#39；*副本：*类型：整数*范围：命名空间名称：*复数：crontab：单数：crontab*。\napiVersion：&#34；my.org/v1&#34；Kind：CronTabMetadata：名称：my-cron-objectspec：cronSpec：&#34；*/5&#34；cronSpec：&#34；*/5&#34；图片：my-cron-image和副本：5。\nKubernetes可扩展性的另一种形式是开发人员能够编写自己的运算符，该运算符是在遵循控制循环模式的Kubernetes集群中运行的特定进程。运营商允许用户通过与Kubernetes API对话来自动化CRD(自定义资源定义)的管理。\n社区有几个工具，允许开发人员创建自己的运算符。其中一个工具是Operator Framework及其Operator SDK。SDK为开发人员快速开始创建操作符提供了一个框架。例如，您可以从它的命令行开始，如下所示：\n.|_cmd||_Manager|_main.go|_go.mod|_Deploy||_role.yaml||_角色_binding.yaml||_服务帐户.yaml||_operator.yaml|_tools.go|_go.sum|_.gitignore|_version||_version.go|_Build||_bin|_。USER_SETUP|_入口点||_Dockerfile|_pkg||_API|_apis.go||_Controller|_Controler.go。\n如果开发人员需要更多的控制，他们可以修改Golang文件中的样板代码。例如，要修改控制器的详细信息，他们可以对Controler.go文件进行更改。\n另一个项目Kudo允许您只使用声明性YAML文件来创建操作符。例如，Apache Kafka操作员的定义如下所示，它允许用户使用以下几个命令在Kubernetes之上安装Kafka集群：\n$kubectl kudo安装Kafka--instance=my-kafka-name\\bnb_cpu_cpu=3000m\\r nbc_cpu=zk-p zooKeeper_uri=zk-zooKeeper-0.zk-hs：2181\\f25$kubectl kudo安装kafka--instance=my-kafka-name\\cpu=3000m\\p broker_cpu=3000m\\**p broker_count=5-p broker*-p broker_count=5-p broker*。*-p NUM_NETWORK_THREADS=10-p NUM_IO_THREADS=20。\n在过去的几年里，Kubernetes每隔三四个月就会有一次重大发布，这意味着每年都会有三到四个主要发布。新功能的引入数量并没有减慢，上一次发布的版本中有30多个不同的添加和更改就是明证。此外，就像Kubernetes项目Github活动所表明的那样，即使在这些困难的时期，捐款也没有显示出放缓的迹象。\n新功能使群集操作员在运行各种不同的工作负载时更加灵活。软件工程师也喜欢有更多的控件来将他们的应用程序直接部署到生产环境中。\nKubernetes受欢迎的另一个重要方面是它强大的社区。首先，Kubernetes在2015年被捐赠给一个供应商中立的家庭，当时它发布了1.0版：云本地计算基金会(Cloud Native Computing Foundation)。\n随着项目的推进，也有范围广泛的社区SIG(特殊利益集团)瞄准Kubernetes的不同区域。他们不断添加新功能，使其更加用户友好。\nCloud Native Foundation还组织了CloudNativeCon/KubeCon，在撰写本文时，这是世界上有史以来最大的开源活动。该活动通常每年举行三次，聚集了数千名技术专家和专业人士，他们希望改善Kubernetes及其生态系统，并利用每三个月发布的一些新功能。\n此外，Cloud Native Foundation有一个技术监督委员会，该委员会与其SIG一起研究基金会在云本地生态系统中的新项目和现有项目。大多数项目都有助于提升Kubernetes的价值主张。\n最后，我相信如果没有社会人士有意识地互相包容，欢迎任何新来者，库伯内斯便不会取得今天的成功。\n开发人员未来面临的主要挑战之一是如何更多地关注代码的细节，而不是代码运行所在的基础设施。为此，无服务器正在成为解决这一挑战的领先架构范例之一。已经有非常先进的框架，比如Kative和OpenFaas，它们使用Kubernetes从开发人员那里抽象出基础设施。\n我们在本文中简要介绍了Kubernetes，但这只是冰山一角。用户可以利用更多的资源、功能和配置。我们将继续看到新的开源项目和技术来增强或发展Kubernetes，正如我们所提到的，贡献和社区不会有任何进展。\n标签：公告、容器、Kubernetes、无服务器、堆栈溢出", "note_en": "At the time of this article, Kubernetes is about  six years old, and over the last two years, it has risen in popularity to consistently be one of the  most loved platforms. This year, it comes in as  the number three most loved platform. If you haven’t heard about Kubernetes yet, it’s a platform that allows you to run and orchestrate container workloads.\n Containers began as a Linux kernel process isolation construct that encompasses  cgroups from 2007 and  namespaces from 2002. Containers became more of a thing when  LXC became available in 2008, and Google developed its own internal ‘run everything in containers mechanism’ called  Borg. Fast forward to 2013, and Docker was released and completely popularized containers for the masses. At the time,  Mesos was the primary tool for orchestrating containers, however, it wasn’t as widely adopted. Kubernetes was released in 2015 and quickly became the de facto container orchestration standard.\n To try to understand the popularity of Kubernetes, let’s consider some questions. When was the last time developers could agree on the way to deploy production applications? How many developers do you know who run tools as is out of the box? How many cloud operations engineers today don’t understand how applications work? We’ll explore the answers in this article.\n  Coming from the world of  Puppet and  Chef, one of the big shifts with Kubernetes has been the move from infrastructure as code towards infrastructure as data—specifically, as YAML. All the resources in Kubernetes that include Pods, Configurations, Deployments, Volumes, etc., can simply be expressed in a YAML file. For example:\n apiVersion: v1kind: Podmetadata:  name: site  labels:    app: webspec:  containers:    - name: front-end      image: nginx      ports:        - containerPort: 80\n This representation makes it easier for DevOps or site reliability engineers to fully express their workloads without the need to write code in a programming language like Python, Ruby, or Javascript.\n  GitOps or Git Operations Version Control. With this approach, you can keep all your Kubernetes YAML files under git repositories, which allows you to know precisely when a change was made, who made the change, and what exactly changed. This leads to more transparency across the organization and improves efficiency by avoiding ambiguity as to where members need to go to find what they need. At the same time, it can make it easier to automatically make changes to Kubernetes resources by just merging a pull request.\n Scalability. Having resources defined as YAML makes it super easy for cluster operators to change one or two numbers in a Kubernetes resource to change the scaling behavior. Kubernetes has Horizontal Pod Autoscalers to help you identify a minimum and a maximum number of pods a specific deployment would need to have to be able to handle low and high traffic times. For example, if you are running a deployment that may need more capacity because traffic suddenly increases, you could change  maxReplicas from  10 to  20:\n apiVersion: autoscaling/v2beta2kind: HorizontalPodAutoscalermetadata:  name: myapp  namespace: defaultspec:  scaleTargetRef:    apiVersion: apps/v1    kind: Deployment    name: myapp-deployment  minReplicas: 1   maxReplicas: 20  metrics:  - type: Resource    resource:      name: cpu      target:        type: Utilization        averageUtilization: 50\n Security and Controls. YAML is a great way to validate what and how things get deployed in Kubernetes. For example, one of the significant concerns when it comes to security is whether your workloads are running as a non-root user. We can make use of tools like  conftest, a YAML/JSON validator, together with the  Open Policy Agent, a policy validator to check that the   SecurityContext of your workloads doesn’t allow a container to run as a root. For that, users can use a simple Open Policy Agent  rego policy like this:\n package maindeny[msg] {  input.kind = &#34;Deployment&#34;  not input.spec.template.spec.securityContext.runAsNonRoot = true  msg = &#34;Containers must not run as root&#34;}\n Cloud Provider Integrations. One of the major trends in the tech industry is to run workloads in the public cloud providers. With the help of the  cloud-provider component, Kubernetes allows every cluster to integrate with the cloud provider it’s running on. For example, if a user is running an application in Kubernetes in AWS and wants that application to be accessible through a service, the cloud provider helps automatically create a  LoadBalancer service that will automatically provision an  Amazon Elastic Load Balancer to forward the traffic to the application pods.\n  Kubernetes is very extensible, and developers love that. There are a set of existing resources like Pods, Deployments,  StatefulSets, Secrets,  ConfigMaps, etc. However, users and developers can add more resources in the form of  Custom Resource Definitions. For example, if we’d like to define a  CronTab resource, we could do it with something like this:\n apiVersion: apiextensions.k8s.io/v1kind: CustomResourceDefinitionmetadata:  name: crontabs.my.orgspec:  group: my.org  versions:    - name: v1      served:  true      storage:  true      Schema:        openAPIV3Schema:          type: object          properties:            spec:              type: object              properties:                cronSpec:                  type: string                  pattern: &#39;^(\\d+|\\*)(/\\d+)?(\\s+(\\d+|\\*)(/\\d+)?){4}$&#39;                replicas:                  type: integer                  minimum: 1                  maximum: 10  scope: Namespaced  names:    plural: crontabs    singular: crontab    kind: CronTab    shortNames:    - ct\n  apiVersion: &#34;my.org/v1&#34;kind: CronTabmetadata:  name: my-cron-objectspec:  cronSpec: &#34;* * * * */5&#34;  image: my-cron-image  replicas: 5\n Another form of Kubernetes extensibility is its ability for developers to write their own  Operators, a specific process running in a Kubernetes cluster that follows the  control loop pattern. An Operator allows users to automate the management of CRDs (custom resource definitions) by talking to the Kubernetes API.\n The community has several tools that allow developers to create their own Operators. One of those tools is the  Operator Framework and its  Operator SDK. The SDK provides a skeleton for developers to get started creating an operator very quickly. For example, you can get started on its  command line with something like this:\n   .|____cmd| |____manager| | |____main.go|____go.mod|____deploy| |____role.yaml| |____role_binding.yaml| |____service_account.yaml| |____operator.yaml|____tools.go|____go.sum|____.gitignore|____version| |____version.go|____build| |____bin| | |____user_setup| | |____entrypoint| |____Dockerfile|____pkg| |____apis| | |____apis.go| |____controller| | |____controller.go\n     If developers need to have even more control, they can modify the boilerplate code in the Golang files. For example, to modify the specifics of the controller, they can make changes to the  controller.go file.\n Another project,  KUDO, allows you to create operators by just using declarative YAML files . For example, an operator for Apache Kafka would be defined with something like  this, and it allows users to install a Kafka cluster on top of Kubernetes with a couple of commands:\n   $ kubectl kudo install kafka --instance=my-kafka-name \\            -p ZOOKEEPER_URI=zk-zookeeper-0.zk-hs:2181 \\            -p ZOOKEEPER_PATH=/my-path -p BROKER_CPUS=3000m \\            -p BROKER_COUNT=5 -p BROKER_MEM=4096m \\            -p DISK_SIZE=40Gi -p MIN_INSYNC_REPLICAS=3 \\            -p NUM_NETWORK_THREADS=10 -p NUM_IO_THREADS=20\n  Over the last few years, Kubernetes has had major releases every three or four months, which means that every year there are three or four major releases. The number of new features being introduced hasn’t slowed, evidenced by over 30 different additions and changes in its  last release. Furthermore, the contributions don’t show signs of slowing down even during these difficult times as indicated by the  Kubernetes project Github activity.\n The new features allow cluster operators more flexibility when running a variety of different workloads. Software engineers also love to have more controls to deploy their applications directly to production environments.\n  Another big aspect of Kubernetes popularity is its strong community. For starters, Kubernetes was donated to a vendor-neutral home in 2015 as it hit version 1.0: the  Cloud Native Computing Foundation.\n There is also a wide range of  community SIGs (special interest groups) that target different areas in Kubernetes as the project moves forwards. They continuously add new features and make it even more user friendly.\n The Cloud Native Foundation also organizes CloudNativeCon/KubeCon, which as of this writing, is the largest ever open-source event in the world. The event, which is normally held up to three times a year, gathers thousands of technologists and professionals who want to improve Kubernetes and its ecosystem as well as make use of some of the new features released every three months.\n Furthermore, the Cloud Native Foundation has a  Technical Oversight Committee that, together with its  SIGs, look at the foundations’ new and  existing projects in the cloud-native ecosystem. Most of the projects help enhance the value proposition of Kubernetes.\n Finally, I believe that Kubernetes would not would not have the success that it does without the conscious effort by the community to be inclusive to each other and to be welcoming to any newcomers.\n  One of the main challenges developers face in the future is how to focus more on the details of the code rather than the infrastructure where that code runs on. For that,  serverless is emerging as one of the leading architectural paradigms to address that challenge. There are already very advanced frameworks such as  Knative and  OpenFaas that use Kubernetes to abstract the infrastructure from the developer.\n We’ve shown a brief peek at Kubernetes in this article, but this is just the tip of the iceberg. There are many more resources, features, and configurations users can leverage. We will continue to see new open-source projects and technologies that enhance or evolve Kubernetes, and as we mentioned, the contributions and the community aren’t going anywhere.\n Tags:  bulletin,  containers,  kubernetes,  serverless,  stackoverflow", "posttime": "2020-05-30 03:57:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内斯,kubernetes", "title": "为什么库伯内斯变得这么受欢迎？", "title_en": "Why is Kubernetes getting so popular?", "transed": 1, "url": "https://stackoverflow.blog/2020/05/29/why-kubernetes-getting-so-popular/", "via": "", "real_tags": ["内斯"]}, {"category": "", "categoryclass": "", "imagename": "7f49ec72966c5056c92cc3b6f87ff75b.png", "infoid": 1004308, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你好，戈多特斯！是我，法比奥！在过去的几个月里，多亏了Mozilla的大力赞助，我一直致力于为Godot4.0带来一个巨大的惊喜，即使编辑器可以作为HTML5应用程序使用。\n这并不意味着我们会像其他引擎那样完全转向Web。它仅作为本机编辑器的补充选项提供，作为降低入门门槛的一种方式。让我再解释一下。\nGodot引擎支持将游戏导出到HTML5平台(即浏览器)。既然编辑器本身是使用Godot引擎API编写的，那么也应该可以在浏览器中运行编辑器。\n编辑器直到现在还不能在浏览器中运行的原因是由于一些历史上的Web浏览器限制，主要是缺乏对线程的支持，但也缺乏对文件系统的访问。\n随着WebAssembly、WebAssembly线程、Javascript SharedArrayBuffer的引入，可能还有即将推出的本机文件系统API，现在在Web上运行编辑器时应该可以获得近乎本机的用户体验。\n它将降低新用户的门槛，他们将能够在不需要下载任何东西的情况下试用该引擎。\n为实现这一目标所做的任何修改也将改进HTML5导出本身(假设编辑器制作得像戈多游戏)。\n它将允许在无法安装/下载应用程序的环境(例如学校的计算机和平板电脑)中以合理的方式使用Godot，促进将引擎用于教育目的(这是我们作为一个开源社区深信不疑的)。\n这并不意味着Godot将完全转移到Web上，也不意味着Web浏览器版本将是专业发展的推荐方式，但在可能有用的情况下，它将是一个额外的选择(同样，选择教育部门作为例子)。\n再次强调这一点：老练的本土编辑永远是我们的主要关注点。\n在必要的前言之后，让我们来看新闻：在浏览器中运行的Godot编辑器原型正在此地址呈现。\n注意：在撰写本文时，此原型需要最新的基于Chromium的浏览器或Firefox Nighly。\n这是一个非常早期的版本，但它允许运行编辑器(包括项目经理)，创建简单的项目，同时将文件存储在浏览器本地存储或外部云服务中(目前支持Dropbox，但由于速度限制，不推荐使用Dropbox)。将来，标准的WebDAV支持将允许更多的提供商和更快的速度。)。请参阅下面的已知限制部分。\n打开URL时，系统将询问您如何加载引擎，特别是选择持久性支持。有4个选项可用：\n无-不使用持久性，关闭浏览器或刷新页面时将丢失所有内容。\nIndexedDB-将使用IndexedDB API存储您的文件。在台式机上通常限制为50兆字节，在移动设备上通常限制为5兆字节(这是目前推荐的存储类型)。\nDropbox-将您的文件存储在专门为测试应用程序创建的Dropbox文件夹中。您还可以将文件直接上传到Dropbox，这些文件将在引擎中可用(刷新页面后！)。这是一个功能非常强大的工具，但目前加载和保存都非常慢(它需要在启动时下载整个文件夹，并且更改将异步存储)。这方面的改进非常需要，Dropbox支持目前是作为概念验证提供的，绝不推荐。云支持(通过标准WebDAV)迟早会成为使用Web编辑器的首选方式。注意：在您阅读时，由于最大用户数的限制，Dropbox支持可能无法工作。\n文件系统API-将使用新的Web文件系统API，这可能会在未来公开本地文件系统支持，如果浏览器供应商就此达成一致的话。同样，这是作为概念验证提供的，目前对浏览器的支持非常有限。\n您还可以选择将zip文件预加载到所选的虚拟文件系统，从而允许您快速测试演示项目并在编辑器浏览器中加载您的脱机项目。一旦项目经理启动，您将需要在预加载压缩项目时通过“Scan”选项扫描虚拟文件系统中的新项目。带有可用项目列表和其他选项的编辑器配置将根据您的持久化方法进行存储。\n导入项目或创建新项目后，您将能够通过拖放对其进行编辑、创建新场景、创建新脚本和上传资源。您还可以通过Play按钮在编辑器中运行编辑器项目。额外的HTML UI允许您关闭游戏和编辑器，并在它们之间切换。\n如上所述，这是一个非常早期的原型，并且有一些已知的限制：\n浏览器对SharedArrayBuffer的支持仍然有限。Chrome的最新版本以及Mozilla Firefox的夜间版本都可以运行(测试版和稳定版还没有启用SharedArrayBuffer)。其他浏览器未经测试。\n仍然不能很好地支持导入和使用音频资产(并且可能会导致死锁，提示浏览器要求用户停止脚本)。\n通过HTML UI关闭项目管理器和游戏是可行的，但是关闭编辑器可能会死锁，并且总是会导致内存泄漏。\n有时出现错误时刷新页面是不够的，这主要是由于浏览器没有正确清除WebAssembly内存。您可能会发现自己处于这样一种情况(通常是在多次重新加载之后)，您必须打开一个新的浏览器窗口/选项卡，然后再次访问URL才能运行编辑器。\n编辑器实例和正在运行的游戏之间的调试器连接当前不起作用，因此编辑器中不会引发print()输出或错误。但是，可以从浏览器控制台访问它们。\n走到这一步需要相当长的时间(我从2月份就开始做了)，但是很多这方面的工作也会极大地改善HTML5的输出。以下是你将在Godot4.0中看到的一些不错的东西：\n导出的游戏现在可以正常退出，调用get_tree().exit()将在HTML5导出中按预期工作，从而释放用户计算机中的内存(例如，如果您在同一页中呈现更多游戏，并允许用户在它们之间切换，这可能会很有用，这样您就不必重新加载页面来释放内存)。\n文件丢弃支持。用户将能够在游戏窗口中放置文件，您将通过FILES_DROP信号使它们在游戏中可用。\nHTML5导出中添加了基本OS。执行支持，允许您捕获那些通过JavaScript代码调用的代码。(这在原型中用于在项目经理/项目编辑器之间切换，以及运行游戏。)。\n更安全、更小的JS代码，通过闭包编译器可以更好地缩小所需的JS支持代码。\n我还会在HTML5平台上做相当多的改进，其中一些也会让其他平台受益。这是一个不为人知的高峰：\n编辑器的手势，允许从触摸设备使用编辑器(例如，这也有利于制作原生的Android或iOS版本的编辑器)。\n更好的HTML5音频支持，试图将音频处理(例如，效果、混音)卸载到单独的线程中。\n更容易与外部JS库(特别是异步JS库)进行接口，因此您不必依赖复杂的JavaScript.eval。", "note_en": "Hello Godotters! It&#39;s-a me, Fabio! In the last few months, thanks to the great sponsorship of  Mozilla I&#39;ve been working on a big surprise for Godot 4.0, namely making the editor available as an HTML5 application.\n This  DOES NOT mean that we will move completely to the Web like other engines did. It will only be provided as a complementary option to the native editor, as a way to lower the entry barrier. Let me explain further.\n  Godot Engine supports exporting games to the HTML5 platform (i.e. browsers). Given that the editor itself is written using the Godot Engine API it should be possible to run the editor in browsers as well.\n The reason why the editor wasn’t able to run in browsers up until now was due to some historical Web browsers limitations, mostly lack of support for threading, but also file system access.\n With the introduction of  WebAssembly, WebAssembly threads, Javascript  SharedArrayBuffer, and possibly an upcoming  Native FileSystem API, it should now be possible to have an almost-native user experience when running the editor on the Web.\n  It will  lower the barrier for new users, which will be able to try out the engine without the need to download anything.\n Any modification towards reaching that goal  will also improve the HTML5 export itself (given that the editor is made like a Godot game).\n It will allow to use Godot in a reasonable way in environments where installing/downloading applications is not an option (e.g. schools’ computers and tablets),  fostering the usage of the engine for educational purposes (which is something we, as an open source community, deeply believe in).\n This DOES NOT mean that Godot will move completely to the Web, nor that the Web browsers version will be the recommended way for professional development, but it will be an additional option for cases where it might be useful (again, pick the education sector as an example).\n To stress this out again:  The good-old native editor will always be our main focus.\n After this necessary preface, let’s get to the news:  a Godot Editor prototype running in browsers is being presented at  this address.\n Note: As of this writing, this prototype requires a  recent Chromium-based browser or  Firefox Nightly.\n This is a very  early stage version, but it allows to run the editor (including the project manager), and make simple projects, while storing the files in either your browser local storage, or an external cloud service (Dropbox is currently supported, but not recommended due to speed limitations. In the future, standard WebDAV support will allow for more providers and better speeds.) See the  &#34;Known limitations&#34; section below.\n  When opening the URL you will be asked how to load the engine, specifically, selecting the persistence support. There are 4 options available:\n None – no persistence will be used, you will lose everything when you close the browser or refresh the page.\n IndexedDB – will use the IndexedDB API to store your files. This is usually limited to 50 megabytes on desktop, and 5 megabytes on mobile (this is the RECOMMENDED storage type for now).\n Dropbox – will store your files in a Dropbox folder, created specifically for the test application. You will also be able to upload files directly to Dropbox and they will be available in the engine (after refreshing the page!). This is a very powerful tool, but is currently quite slow, both when loading and saving (it will need to download the whole folder on startup, and changes will be stored asynchronously). Improvements in this area are much needed, and Dropbox support is provided as a proof-of-concept for now and in no way recommended. Cloud support (via standard WebDAV) will in time become the preferred way to use the web editor.  Note: At the time of your reading, Dropbox support might not work due to limits in terms of maximum number of users.\n FileSystem API – will use the new Web FileSystem API, which could potentially expose native file system support in the future, if browser vendors agree on a safe way to do that. This is, again, provided as a proof-of-concept and browser support is very limited for now.\n  You can also opt to preload a zip file to the chosen virtual file system, allowing you to quickly test demo projects and load your offline projects inside the editor browser. Once the project manager starts, you will need to scan the virtual file system for new projects via the “Scan” option when preloading a zipped project. The editor config with the available projects list and other options will be stored according to your persistence method.\n    Once you have imported a project, or after creating a new one, you will be able to edit it, create new scenes, create new scripts, and upload assets via drag and drop. You will also be able to run your editor project inside the editor via the play button. Extra HTML UI allows you to close the game and the editor, and switch between them.\n     As stated above, this is a very early stage prototype, and there are some known limitations:\n SharedArrayBuffer support is still limited among browsers. Recent versions of  Chrome will work, as well as Mozilla  Firefox Nightly builds (the beta and stable versions don’t have SharedArrayBuffer enabled yet). Other browsers are untested.\n Importing and using audio assets is still not well supported (and may cause a deadlock prompting the browser to ask the user to stop the script).\n Closing the project manager and game the via the HTML UI works, but closing the editor might deadlock and will always cause a memory leak.\n Sometimes refreshing the page when an error occurs is not enough, this is mostly due to browsers not clearing WebAssembly memory correctly. You might find yourself in a situation (after many realoads usually) where you have to open a new browser window/tab and visit the URL again for the editor to be able to run.\n The debugger connection between the editor instance and the running game does not work currently, so  print() output or errors will not be raised in the editor. They are however accessible from the browser console.\n  Getting this far required quite a bit of time (I&#39;ve been working on it since February), but a lot of this work will greatly improve the HTML5 export too. Here are a few nice things that you will see in Godot 4.0:\n The exported game can now exit properly, calling  get_tree().quit() will work as expected in HTML5 exports, freeing up the memory in the user machine (this could for example be useful if you present more games in the same page, and allow the user to switch among them, so you don&#39;t have to reload the page to free up memory).\n Files drop support. The user will be able to drop files in the game window, and you will get them available in the game via the   files_dropped signal\n  Rudimental   OS.execute support has been added to the HTML5 export, allowing you to &#34;catch&#34; those call via JavaScript code. (This is used in the prototype to switch between project manager/project editor, and to run the game.)\n  Safer and smaller JS code, via Closure Compiler to better minify the required JS support code.\n  There are still quite a few improvements that I will work on in the HTML5 platform, some of which will also benefit other platforms. Here is a sneak peak:\n Gestures for the editor, allowing using the editor from touch devices (this will also be beneficial to make native Android or iOS versions of the editor for example).\n Better HTML5 Audio support, trying to offload audio processing (e.g. effects, mixing) into a separate thread.\n  Easier interface to external JS libraries (expecially asynchronous ones), so you don&#39;t have to rely on complex   JavaScript.eval.", "posttime": "2020-05-30 03:56:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "godot,editor,编辑器", "title": "在Web浏览器中运行的Godot编辑器", "title_en": "Godot Editor running in a web browser", "transed": 1, "url": "https://godotengine.org/article/godot-editor-running-web-browser", "via": "", "real_tags": ["godot", "editor", "编辑器"]}, {"category": "", "categoryclass": "", "imagename": "0f9b3bf0af67163dc4f9c89b4e91a433.jpg", "infoid": 1004306, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "韩国200多所学校在重新开学几天后就被迫关闭，原因是病毒病例出现了新的激增。\n周三早些时候，随着国家开始放松病毒限制，数千名学生已经返回学校。\n但就在一天后，又记录了79例新病例，这是两个月来最高的单日数字。\n这个仓库位于富川市，由该国最大的电子商务公司Coupang运营，官员们表示，该设施没有严格遵守感染控制措施。卫生官员甚至在工人的鞋子和衣服上发现了新冠肺炎的痕迹。\n随着韩国继续测试该中心的数千名员工，案件数量可能会继续上升。\n周五记录了约58例新病例，使全国病例总数达到11402例。\n目前，富川共有251所学校被迫关闭。“韩国时报”的一篇报道援引教育部的话说，首都首尔还有117所学校也推迟了重新开学。\n首尔的一名学生被发现感染了这种病毒，她的母亲在Coupang仓库工作。\n首尔及其周边城市的公园和博物馆现在已经关闭，企业被敦促鼓励更灵活的工作，人们再次被要求避免大规模集会。\n今年早些时候，韩国经历了该病毒最严重的爆发之一，但由于一项广泛的追踪、检测和治疗计划，它似乎已得到控制。\n然而，最近几周出现了新的聚居区，其中一个与本月早些时候一名男子光顾首尔梨泰院夜生活区的五家夜总会和酒吧有关。", "note_en": "More than 200 schools in South Korea have been forced to close just days after they re-opened, due to a new spike in virus cases.\n Thousands of students had earlier on Wednesday returned to school as the country began easing virus restrictions.\n But just a day later, 79 new cases were recorded, the highest daily figure in two months.\n  The warehouse, in the city of Bucheon, is run by the country&#39;s biggest e-commerce firm Coupang, and officials have said the facility was not strictly complying with infection control measures. Health officials even discovered traces of Covid-19 on workers&#39; shoes and clothes.\n   It&#39;s possible that South Korea will continue to see a rise in cases as it continues to test thousands of employees from the centre.\n Some 58 new cases were recorded on Friday, bringing the total number of cases nationwide to 11,402.\n  A total of 251 schools in Bucheon have now been forced to close.  A report by the Korea Times, quoting the Ministry of Education, says a further 117 schools in the capital Seoul have also postponed their re-opening.\n One student in Seoul, whose mother worked at the Coupang warehouse, had been found to have the virus.\n  Public parks and museums across Seoul and its surrounding cities have now been closed, businesses are being urged to encourage more flexible working, and people are once again being asked to avoid mass gatherings.\n South Korea endured one of the worst outbreaks of the virus earlier this year, but had appeared to have brought it under control, thanks to an extensive &#34;trace, test and treat&#34; programme.\n Recent weeks, however, have seen new clusters emerge, including one linked to a man who visited five nightclubs and bars in Seoul&#39;s nightlife district of Itaewon earlier this month.", "posttime": "2020-05-30 03:40:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,韩国,south", "title": "冠状病毒：韩国在经历数周来最大涨幅后再次关闭学校", "title_en": "Coronavirus: South Korea closes schools again after biggest spike in weeks", "transed": 1, "url": "https://www.bbc.com/news/world-asia-52845015", "via": "", "real_tags": ["冠状病毒", "病毒", "韩国", "south"]}, {"category": "", "categoryclass": "", "imagename": "2876176d1939fb1bf9cd094dea21ed87.jpg", "infoid": 1004303, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这起诉讼由哥伦比亚大学骑士第一修正案研究所(Knight First Amendment Institute)、布伦南司法中心(Brennan Center For Justice)和辛普森·萨切尔·巴特利特律师事务所(Simpson Thacher；Bartlett)提起，旨在撤销国务院关于签证申请者在获得美国签证前必须披露其社交媒体账号的要求，以及有关保留和传播这些记录的相关规定。\n去年，美国国务院开始要求签证申请人提供他们现在和以前的社交媒体用户名，这一举措每年影响到数百万申请前往美国旅行的非公民。这一规则变化是特朗普政府扩大其“增强型”筛查协议的努力的一部分。当时有报道称，如果国务院确定“需要这些信息来确认身份或进行更严格的国家安全审查”，就会使用这些信息。\n在一份支持这起诉讼的文件中，Twitter和Reddit都表示，社交媒体政策“毫无疑问地冷却了大量言论”，这些规定违反了第一修正案“匿名发言和私下交往”的权利。\nTwitter和Reddit总共拥有超过5.6亿用户，他们表示，他们的用户-其中许多人在他们的平台上没有使用真实姓名-被迫“为了去美国旅行而放弃匿名”，这“违反了第一修正案匿名发言和私下交往的权利”。\n简报称：“Twitter和Reddit大力捍卫在其平台上为人们匿名发声的权利，匿名个人在这些平台上进行相应的交流，期望在没有具体表现出迫切需求的情况下，他们的身份不会被披露。”\n“这种期望让思想自由交流在这些平台上蓬勃发展。”\nTwitter美洲政策负责人杰西卡·赫雷拉-弗拉尼根(Jessica Herrera-Flanigan)表示，社交媒体规则“侵犯了这两项权利，我们很自豪能在这些关键的法律问题上给予支持。”Reddit的总法律顾问本·李(Ben Lee)称这项规定是政府“侵入性的越权”。\n目前还不清楚有多少签证申请者(如果有的话)因为他们的社交媒体内容而被拒签。但自从社交媒体规则生效以来，批准的签证持有者拒绝进入美国发布其他人的社交媒体帖子的案例层出不穷。当时17岁的哈佛大学大一新生伊斯梅尔·阿贾维(Ismail Ajjawi)在波士顿洛根国际机场(Boston Logan International Airport)被拒之门外，此前美国边境官员搜查了他的手机，原因是他在社交媒体上发布了关于阿贾维朋友的帖子-而不是他自己的帖子。\n美国-阿拉伯反歧视委员会的法律和政策主任Abed Ayoub当时告诉TechCrunch，Ajjawi的案件并不是孤立的。一周后，TechCrunch了解到另一名男子因一位远房熟人发送的WhatsApp消息而被拒绝进入美国。", "note_en": "The lawsuit, brought by the Knight First Amendment Institute at  Columbia University,   the Brennan Center for Justice and law firm Simpson Thacher &amp; Bartlett, seeks to undo both the State Department’s requirement that visa applicants must disclose their social media handles prior to obtaining a U.S. visa, as well as related rules over the retention and dissemination of those records.\n Last year, the State Department  began asking visa applicants for their current and former social media usernames, a move that affects millions of non-citizens applying to travel to the United States each year. The rule change was part of the Trump administration’s effort to expand its “enhanced” screening protocols. At the time, it was reported that the information would be used if the State Department determines that “such information is required to confirm identity or conduct more rigorous national security vetting.”\n In a filing supporting the lawsuit, both Twitter and Reddit said the social media policies “unquestionably chill a vast quantity of speech” and that the rules violate the First Amendment rights “to speak anonymously and associate privately.”\n Twitter and Reddit, which collectively have more than 560 million users, said their users — many of which don’t use their real names on their platforms — are forced to “surrender their anonymity in order to travel to the United States,” which “violates the First Amendment rights to speak anonymously and associate privately.”\n “Twitter and Reddit vigorously guard the right to speak anonymously for people on their platforms, and anonymous individuals correspondingly communicate on these platforms with the expectation that their identities will not be revealed without a specific showing of compelling need,”  the brief said.\n “That expectation allows the free exchange of ideas to flourish on these platforms.”\n Jessica Herrera-Flanigan, Twitter’s policy chief for the Americas, said the social media rule “infringes both of those rights and we are proud to lend our support on these critical legal issues.” Reddit’s general counsel Ben Lee called the rule an “intrusive overreach” by the government.\n It’s not known how many, if any, visa applicants have been denied a visa because of their social media content. But since the social media rule went into effect, cases emerged of approved visa holders  denied entry to the U.S. for other people’s social media postings. Ismail Ajjawi, a then 17-year-old freshman at Harvard University, was turned away at Boston Logan International Airport after U.S. border officials searched his phone after taking issue with social media postings of Ajjawi’s friends — and not his own.\n Abed Ayoub, legal and policy director at the American-Arab Anti-Discrimination Committee, told TechCrunch at the time that Ajjawi’s case was not isolated. A week later, TechCrunch learned of  another man who was denied entry to the U.S. because of a WhatsApp message sent by a distant acquaintance.", "posttime": "2020-05-30 02:54:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "app,推特,账号,media,美国", "title": "推特，Reddit挑战美国强制签证申请人披露社交媒体账号的规定", "title_en": "Twitter, Reddit Challenge US Rules Forcing Visa Applicants To Disclose Their Social Media Handles", "transed": 1, "url": "https://techcrunch.com/2020/05/29/twitter-reddit-visa-social-media-handles/", "via": "", "real_tags": ["app", "推特", "账号", "media", "美国"]}]