[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073488, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "终于到了，红衣主教的第一个版本。\n红衣主教\nCardinal的创建首先是为了让Rack成为一个合适的开源音频插件。\n需要指出的是，Cardinal项目及其作者并不希望原始/官方框架项目有任何不好的地方。\nCardinal提供了3种插件变体——Main、Synth和FX。\nFX和Synth变体都有2个音频输出，而Main有8个。\nMain提供8个音频输入和输出以及10个CV输入和输出。\nSynth提供2个音频输出，但没有音频输入或CV端口。\n最后，FX提供2个音频输入和输出，但没有CV端口。\n红衣主教\n除了一些bug之外，Cardinal可以被认为是稳定的。\n参数扩展器模块尚未按时准备好，但将在未来的版本中很快推出。基本的\n我们想添加几个模块，但正在仔细评估它们，因为我们在Cardinal中添加的任何模块都需要永远保留在那里，以便向后兼容。\n我希望尽快尝试的是另一种处理MIDI到CV转换的方法，我不知道&#39；我不喜欢Rack目前的做法。\n如果你喜欢这个项目并且想帮忙，这里有一些基本的建筑说明\n目前我们都在IRC的#枢机室。利伯拉。聊天服务器。\n在运行时无法在现有的基数二进制文件上安装新模块，但我们可以向构建中添加新模块。\n安装说明可在\n目前还没有主要的官方媒体内容，\n存在一些CC-0/公共域基数补丁\n就这样，下载、安装并享受乐趣吧！", "note_en": "It is finally here, the first release of  Cardinal. \r Has been slowly brewing behind the scenes, and now ready for the masses. \r First, some introductions...\n    Cardinal\r is a free and open-source virtual modular synthesizer plugin. \r It is based on the popular  VCV Rack\r but with a focus on being a fully self-contained plugin version.\n  Cardinal was created first and foremost as a way to have Rack as a proper open-source audio plugin. \r A proper audio plugin should be self-contained as much as possible, as to not interfere with the DAW/Host. Loading external modules clearly goes against this idea. \r Not to mention being  open-source, otherwise we are at the mercy of the wishes of a company for what we can and cannot do, which is not that great... \r (in case you were not aware, VCV&#39;s Rack plugin version, called &#34;Rack Pro&#34;, is a commercial closed-source product)\n  It needs to be said that Cardinal project and its authors do not wish anything bad to the original/official Rack project. \r In fact, Cardinal wouldn&#39;t exist if not for Rack v2 release. (which has many needed things to make a plugin version work) \r\r Cardinal and Rack should be able to co-exist friendly and peacefully, as they clearly have different targets. \r It is likely most people will prefer to use Rack Pro for its official support and its big module collection (including commercial ones). \r\r A feature comparison between Cardinal and Rack Pro can be seen\r  here.\n      Cardinal provides 3 plugin variants -  Main,  Synth and  FX. \r They are all equivalent in performance and behaviour, with only the IO and metadata that changes. \r This is because some hosts are very strict on which plugins are allowed as instruments vs FX, so separate variants of the same plugin are needed.\n  FX and  Synth variants both have 2 audio outputs, while  Main has 8. \r All variants have MIDI input and output support.\n  Main provides 8 audio inputs and outputs and 10 CV inputs and outputs. \r Note that due to VST2 format not supporting CV ports, this variant is not available for VST2.\n  Synth provides 2 audio outputs but no audio inputs or CV ports. \r Plugin type is set as &#34;instrument&#34;.\n  And finally  FX provides 2 audio inputs and outputs, but no CV ports. \r Plugin type is set as regular &#34;effect&#34;.\n        Additionally Cardinal\r  provides its own modules\r for DAW/Host automation, time position and internal plugin hosting.\n    With the exception of a few bugs, Cardinal can be considered stable. \r Though currently the following should be noted:\n    A parameter expander module was not ready on time for this release, but will come soon in a future release.   Fundamental\r is on a similar situation, there are some artwork license issues that prevent us from using Fundamental exactly as we want. \r We plan to redo Fundamental&#39;s panel graphics in a more liberal license, so it then can be included in Cardinal.\n  There are a few modules we want to add, but they are being evaluated carefully as going forward anything we add in Cardinal needs to remain there forever, for backwards compatibility. \r They must also have a GPLv3+ compatible license, which not all of them do. \r Not to mention a clear artwork/graphics license... it is amazing how many of these projects do not care or understand about software licenses :( \r Overall it makes packaging quite difficult, so it is natural that new modules are not added as fast as we wished for.\n  Something I hope to try soon is an alternative way to handle MIDI to CV conversion, as I don&#39;t like the way Rack does it at the moment. \r The current Cardinal &#34;core&#34; modules follow the same exact approach as the official Rack, to make the transition easier,\r but some kind of &#34;MIDI v2&#34; modules will be done eventually.\n    If you like the project and want to help out, there are basic building instructions\r  here, \r And an overview of the source code is available\r  here.\n  Currently we are all on  #cardinal IRC room in irc.libera.chat server. \r Come join us in your favorite IRC client or through a Matrix bridge.\n  Installing new modules on an existing Cardinal binary is not possible at run-time, but we can add new modules to the build. \r Details on this are available\r  here. \r Also check\r  this wiki page\r where we discuss possible modules to include.\n    Install instructions are available on\r  this wiki page. \r If you are using the KXStudio repositories you can simply install  cardinal-lv2,  cardinal-vst2 or  cardinal-vst3 packages as usual. \r Consult the wiki page linked above for details on other distributions, or otherwise use the prebuilt binaries on the\r  Cardinal releases page.\n  There is no Cardinal official media content as of yet,\r but if you are looking for tutorials just look for &#34;VCV Rack&#34; stuff which pretty much applies to Cardinal unchanged. \r Some modules will appear slightly different, or not be available, but the overall idea on how to use it is the same.\n  A few CC-0 / public domain Cardinal patches are present\r  directly in the source code. \r You can use those as your starting point, they are fully free to do what you want with.\n  And that is it, go download, install and have fun! \r If you find an issue or want to request a potentially useful feature, please use the\r  Cardinal issue tracker. \r And happy Valentine&#39;s day too. \\o/", "posttime": "2022-02-15 17:40:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,免费,free,cardinal", "title": "Cardinal：免费开源模块化synth插件", "title_en": "Cardinal: Free and open-source modular synth plugin", "transed": 1, "url": "https://kx.studio/News/?action=view&url=cardinal-2202-is-now-released", "via": "", "real_tags": ["开源", "免费", "free", "cardinal"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073487, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1995年1月1日，协调世界时15分，北海Draupner天然气平台上的向下看激光记录了测量仪器检测到的最著名的反常波。波浪高25.6米，波峰高18.5米（方框A）。据估计，该地区的有效波高约为12米。测量结果证实了巨大流氓波的存在，此前水手们曾轶事地报道过这种情况。它引发了一系列研究，旨在确定当时的气象和海浪状况，并对这一事件提供物理解释。\n二维波能谱：波能在频率和方向上的分布。这个数量是任何现代波浪模型的预测变量。\n波峰高度：波顶与未受干扰水面之间的高度。\n有效波高：波谱积分平方根的四倍。它与最高三分之一波浪的平均高度密切相关。\n涌浪：源自遥远风暴且不受当地风影响的波浪系统。\n波峰周期：对应于1D波能谱最高值的频率的倒数。\nECMWF最近制作的高分辨率回顾性预报（事后预测）以前所未有的细节展示了1995年1月1日风场、气压场和波场的演变，并为Draupner波事件的发生提供了新的线索。他们认为，由向南移动的极低层驱动的波浪与大量的本地风生波浪系统相互作用，产生了有利于观测到的大型流氓波的条件。\nCavaleri等人（2016a）对Draupner波起源的研究进行了概述。Sunde（1995年）报告了详细的分析，Haver（2004年）总结了详细的分析。据经常报道，位于瑞典上空的一个低压产生了强劲的西北气流，导致大量的东南传播波覆盖整个北海。Adcock等人（2011年）利用了基于ERA中期再分析数据的专门再分析。ERA过渡系统使用ECMWF的综合预测系统（IFS）的模型周期31r2，以更高的分辨率运行（TL799，对应于约25公里的水平网格间距），以产生新的情况调查。然而，阿德科克等人的模拟分辨率仍然过于粗糙，无法捕捉事件的细节。这里报道了一个新的、非常详细的总体情况描述，这是以前没有的。通过使用高分辨率预报的当前分辨率TCo1279（相当于约9 km的水平网格间距）（Hólm et al.，2016），利用IFS周期41r1而非41r2（目前已用于TCo1279的操作引入）对气象和波浪条件进行后测，获得了该数据。\nDraupner风暴被建模为一系列预测，从TL799再分析提供的初始条件开始。模拟中使用的模型版本受益于用于ERA过渡的IFS周期31r2和IFS周期41r1之间的所有模型升级。\n本文报告的所有结果均从分析开始获得，有效期为1995年1月1日00 UTC。图1提供了1月1日气象条件的顺序视图。一个低压系统集中在瑞典上空。协调世界时00时（图1a），挪威海岸外清晰可见极低。它带来了来自北方的冷空气的能量增加。在Draupner（由每个面板中心附近的黑色三角形表示），风向约为315°（即西北风）。在接下来的12小时内（图1b-c），极地低压迅速向南移动，其西侧风速增加。它在大约15 UTC时到达德拉普纳纬度（图1d）。在平台区域，当时10米的风速超过20米/秒，方向转向更北。在接下来的几个小时里，低压继续向南和东南移动，大约在午夜时分到达靠近德国边境的荷兰海岸。\n如图2所示，极低之后有一大片向南传播的波。对二维波浪能谱的详细分析表明，在畸形波事件发生时，平台上存在部分横渡海况。图中还显示了ECMWF当时获得的少量现场波高观测值。在Draupner，最大模拟有效波高接近11米，比报告高度低约1米。在分析极低层的运动时，出现了一个有趣的细节。\n根据模型输出，可以直接估计出低压移动的速度约为15 m/s。这对于动态波的产生来说太快了，即对于一个波系统来说，它以与低压相同的速度移动，并持续接收来自低压的能量。对于15m/s的波群速度，相应的波峰周期约为19s，这比Draupner风暴研究中通常发现的要大得多。\n然而，考虑到当时的气象条件，可以假设在该频率范围内或略低于该频率范围内存在波能。这些波分量随着风暴移动，同时接收来自与大部分风-海频谱的非线性相互作用的能量（而不是直接来自风，因为它们的相速度高于风速）。因此，最高波浪的区域遵循低潮的轨迹。Cavaleri等人（2016a）将其解释为频谱中的“动态锁定”低频部分，该部分由频谱中的风海部分的非线性相互作用提供，并随着风暴以相同的速度移动。只有在协调世界时15分，当低潮中心经过Draupner区域附近时，“锁定”低频波分量与大量本地风力发电系统一起出现。\n显然，高水平分辨率是这一最新模拟成功的关键因素。正如Cavaleri等人（2016a）所示，在TL799上进行同样的实验并不会产生一个明确的极低，而是一个在瑞典上空的大尺度环流中嵌入了略强风的区域。类似地，通过将TL799运行与专用再分析的相应预测进行比较，结果表明，自ERA过渡以来的模型改进也是一个促成因素，因为与旧模型相比，强风区域更受限制。\n至于这一事件的可预测性，长期预测并不擅长预测极低的演变。早期分析没有相关信息可能有几个原因，分辨率就是其中之一。极地低压只有在向南移动时，才能在分析地图上看到。它从遥远的北方（约66°N）到荷兰海岸的整个飞行轨迹不到24小时。在协调世界时1月1日之前，没有关于其存在的线索，因此也没有可能的预测。这表明缺乏观测，由于人们对北极的强烈兴趣，目前这种情况可能正在得到缓解。例如，EUMETNET在该地区部署了额外的海洋浮标，可以高精度测量表面压力。\n基于上述模拟，Cavaleri等人（2016b）分析了Draupner波，借鉴了最近关于极端波分布和波峰高度的研究成果。从这个有利的角度来看，德拉普纳事件，就像文献中报道的大多数大浪一样，失去了许多围绕它的神秘感：这样的波浪是大风暴的一个常规部分，遇到它们只是一个概率问题，取决于所考虑的时空尺度。\n在排水器的情况下，波浪条件，包括高度和光谱形状，使得遇到特别高的波浪和波峰的可能性特别大。由于两个交叉低频波系统的存在，这种事件发生的概率可能会增加。由于国际单项体育联合会最近的改进和分辨率的提高，只能对这两个系统进行适当的建模。Cavaleri等人（2016b）引入了“动力涌浪”的概念，以确定波谱中随风暴移动而不接收风能量的部分，因为其相速度较高，但通过风海谱活跃部分的非线性相互作用，波谱变得更具能量。这种情况可能比人们想象的更常见，尤其是在快速移动的风暴中。\nAdcock，T.A.A.，P.H.Taylor，S.Yan，Q.W.Ma&amp；P.A.E.M.杨森，2011年：德拉普纳波是否发生在横渡的海洋中？过程。皇家Soc的。A、 467。3004–3021.\nL.卡瓦雷利、F.芭芭里奥尔、A.贝内塔佐、L.贝尔托蒂、J.-R.比德洛特、P.A.E.M.杨森和；N.Wedi，2016a：《德拉普纳浪潮：全新的视角和新兴的视角》。已被《地球物理研究杂志-海洋》接受发表。\nL.卡瓦雷利、F.芭芭里奥尔、A.贝内塔佐、J.-R.比德洛特和；P.A.E.M.杨森，2016b：《德拉普纳波：新兴观点和非线性的作用》。提交至《美国气象学会公报》。\nS.哈弗，2004年：1995年1月1日，在Draupner导管架上测量到一个可能的畸形波事件。布列斯特流氓海浪工作室。\n霍姆，E.，R.福布斯，S.朗，L.马格努森；S.Malardel，2016：新车型周期带来更高的分辨率。ECMWF通讯第147号，第14-19页。\nSunde，A.，1995年：Knjempebølger i Nordsjøen（北海的极端波浪），Vær&amp；克里玛，18岁。（挪威语）", "note_en": "On 1 January 1995 at 15 UTC, the most famous freak wave to be detected by a measuring instrument was recorded by a downward-looking laser at the North Sea Draupner gas platform. The wave was 25.6 m high, with an 18.5 m crest height (Box A). The significant wave height in the area is estimated to have been almost 12 m. The measurement confirmed the existence of giant rogue waves, which had previously been reported anecdotally by sailors. It prompted a number of studies which aimed to determine the meteorological and wave situation at the time and to provide a physical explanation of the event.\n 2D wave energy spectrum: The distribution of wave energy both in frequency and direction. This quantity is the prognostic variable of any modern wave model.\n  Crest height: The height between the top of the wave and the undisturbed water surface.\n  Significant wave height: Four times the square root of the integral of the wave spectrum. It closely corresponds to the average height of the highest one third of waves.\n Swell: A wave system originating from a distant storm and not affected by local winds.\n Wave peak period: The reciprocal of the frequency corresponding to the highest value of the 1D wave energy spectrum.\n High-resolution retrospective forecasts (hindcasts) recently produced at ECMWF show the evolution of wind, pressure and wave fields on 1 January 1995 in unprecedented detail and shed fresh light on how the Draupner wave event may have come about. They suggest that waves driven by a southward-moving polar low interacted with a substantial local wind-generated wave system to produce the conditions conducive to the observed large rogue wave.\n  An overview of studies into the origin of the Draupner wave is given by  Cavaleri et al. (2016a). A detailed analysis was reported by  Sunde (1995) and summarised by  Haver (2004). It is often reported that a depression located over Sweden generated a vigorous north-westerly flow leading to substantial south-east propagating waves covering the whole North Sea.  Adcock et al. (2011) made use of a dedicated reanalysis based on ERA-Interim reanalysis data. The ERA-Interim system, which uses model cycle 31r2 of ECMWF’s Integrated Forecasting System (IFS), was run at an increased resolution (TL799, corresponding to a horizontal grid spacing of about 25 km) to produce a new investigation of the situation. However, the resolution of  Adcock et al.’s simulation was still too coarse to capture the fine details of the event. A new, highly detailed description of the overall situation not previously available is reported here. It was obtained by hindcasting the meteorological and wave conditions using the current resolution of high-resolution forecasts, TCo1279, corresponding to a horizontal grid spacing of about 9 km ( Hólm et al., 2016), with IFS Cycle 41r1 rather than 41r2, which has now been used for the operational introduction of TCo1279.\n The Draupner storm was modelled as a series of forecasts starting from initial conditions provided by the dedicated TL799 reanalysis. The model version used in the simulation benefits from all model upgrades between IFS Cycle 31r2, used for ERA-Interim, and IFS Cycle 41r1.\n   All results reported here have been obtained starting from the analysis valid at 1 January 1995 00 UTC. Figure 1 provides a sequential view of the meteorological conditions on 1 January. A low-pressure system is centred over Sweden. At 00 UTC (Figure 1a), a polar low is clearly visible off the coast of Norway. It brings with it an energetic increased flux of cold air from the north. At Draupner (represented by the black triangle near the centre of each panel), the wind direction is about 315° (i.e. from the northwest). Over the next 12 hours (Figure 1b–c), the polar low moves rapidly southward, with increased wind speeds on its western flank. It reaches the Draupner latitude at about 15 UTC (Figure 1d). In the area of the platform, the 10-metre wind speed at that time exceeds 20 m/s, and the direction is turning more northerly. In the following hours the low keeps moving south and southeast, reaching the Dutch coast close to the German border at about midnight.\n  As shown in Figure 2, an extensive area of southward-propagating waves follows the polar low. A detailed analysis of the 2D wave energy spectra indicates the presence of partly crossing-sea conditions at the platform at the time of the freak wave event. The small number of in-situ wave height observations obtained at the time by ECMWF are also shown. At Draupner, the maximum modelled significant wave height is close to 11 m, about 1 m lower than the reported height. An interesting detail emerges when analysing the motion of the polar low.\n From the model output, it is straightforward to estimate that the speed at which the low was moving was about 15 m/s. This is too fast for dynamical wave generation to occur, i.e. for a wave system to move at the same speed as the low and to continuously receive energy from it. For a wave group speed of 15 m/s, the corresponding wave peak period is around 19 s, which is much larger than typically found in studies of the Draupner storm.\n However, given the prevailing meteorological conditions, it can be assumed that there was wave energy in this frequency range or just below it. These wave components were moving with the storm, while at the same time receiving energy from nonlinear interactions with the bulk of the wind-sea frequency spectrum (and not directly from the wind as their phase speed was higher than the wind speed). As a result, the area of the highest waves followed the trajectory of the low.  Cavaleri et al. (2016a) interpret this as a ‘dynamically locked’ low-frequency part of the spectrum, which is fed by non-linear interactions with the wind-sea part of the spectrum and moves with and at the same speed as the storm. It is only at 15 UTC, when the centre of the low passed near the Draupner area, that the ‘locked’ low-frequency wave components are present together with a substantial local wind-generated system.\n  It is clear that the high horizontal resolution is an essential element in the success of this latest simulation. As shown by  Cavaleri et al. (2016a), running the same experiment at TL799 does not produce a well-defined polar low but rather an area with slightly more intense winds embedded in the large-scale circulation caused by the depression over Sweden. Similarly, by comparing this TL799 run with the corresponding forecast from the dedicated reanalysis, it was shown that model improvements since ERA-Interim were also a contributing factor, since with the old model the area with intense wind was much more confined.\n As for the predictability of the event, longer-range forecasts were not very good at anticipating the evolution of the polar low. There might be several reasons why earlier analyses did not have the relevant information, resolution being one of them. The polar low was only noticeable in the analysis map when it was already on its way south. Its whole trajectory from the far north (about 66° N), where it was identified, to the Dutch coast took less than 24 hours. There was no clue of its existence, and hence no possible prediction based on it, before 1 January 00 UTC. This points to a lack of observations, which is today possibly being alleviated as a result of a strong interest in the Arctic. For example, EUMETNET have deployed additional marine buoys in the area, which measure surface pressure with high accuracy.\n  Based on the simulations described above,  Cavaleri et al. (2016b) have analysed the Draupner wave, drawing on recent work on the distribution of extreme waves and crest heights. From this vantage point, the Draupner event, like probably most of the large waves reported in the literature, loses much of the mystery surrounding it: such waves are a regular part of large storms and coming across them is just a matter of probability depending on the spatial and temporal scales considered.\n In the case of the Draupner, the wave conditions, both in terms of height and spectral shape, made encountering a particularly high wave and crest particularly likely. The probability of such an event may have been enhanced by the presence of two crossing low-frequency wave systems that could only be properly modelled because of recent improvements in the IFS and the use of increased resolution.  Cavaleri et al. (2016b) have introduced the concept of ‘dynamical swell’ to identify the part of the wave spectrum which moves with the storm without receiving energy from the wind because of its higher phase speed, but which is made more energetic via nonlinear interactions from the active part of the wind-sea spectrum. This condition may be more common than had been thought, particularly in the case of fast-moving storms.\n  Adcock,  T.A.A.,  P.H. Taylor,  S. Yan,  Q.W. Ma &amp;  P.A.E.M. Janssen, 2011: Did the Draupner wave occur in a crossing sea?  Proc. of the Royal Soc. A,  467. 3004–3021.\n Cavaleri,  L.,  F. Barbariol,  A. Benetazzo,  L. Bertotti,  J.-R. Bidlot,  P.A.E.M. Janssen &amp;  N. Wedi, 2016a: The Draupner wave: a fresh look and the emerging view. Accepted for publication in  Journal of Geophysical Research – Oceans.\n Cavaleri,  L.,  F. Barbariol,  A. Benetazzo,  J.-R. Bidlot, &amp;  P.A.E.M. Janssen, 2016b: The Draupner wave: the emerging view and the role of non-linearity. Submitted to  Bulletin of the American Meteorological Society.\n Haver,  S., 2004: A possible freak wave event measured at the Draupner jacket January 1 1995.  Rogue Waves Workshop, Brest.\n Hólm,  E.,  R. Forbes,  S. Lang,  L. Magnusson &amp;  S. Malardel, 2016: New model cycle brings higher resolution.  ECMWF Newsletter  No. 147, 14–19.\n Sunde,  A., 1995: Kjempebølger i Nordsjøen (Extreme Waves in the North Sea),  Vær &amp; Klima,  18. (In Norwegian)", "posttime": "2022-02-15 17:35:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "浪潮,draupner,波浪", "title": "德拉普纳浪潮（2016）", "title_en": "The Draupner Wave (2016)", "transed": 1, "url": "https://www.ecmwf.int/en/newsletter/148/meteorology/what-conditions-led-draupner-freak-wave", "via": "", "real_tags": ["浪潮", "draupner", "波浪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073486, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：在分布压缩中，一个目标是使用少量代表点准确总结概率分布$\\mathbb{P}$。通过从马尔可夫链中采样$n$点，并用$\\widetilde{\\mathcal{O}（1/\\sqrt{n}）$差异到$\\mathbb{P}$识别$\\sqrt{n}$点，接近最优的细化程序实现了这一目标。不幸的是，这些算法在样本量为$n$时存在二次或超二次计时问题。为了解决这一缺陷，我们引入了compress++，这是一个简单的元过程，用于加速任何细化算法，但误差最多为4美元。当与Dwivedi和Mackey（2021）的二次时间核减半和核细化算法相结合时，Compress++在$\\mathcal{O}（\\sqrt{log n/n}）$积分误差下提供$\\sqrt{n}$n}$点，并且在$\\mathcal{O}（n\\log 3 n）$时间和$\\mathcal{O}（\\sqrt{n}\\log 2 n）$空间上优于Monte Carlomaxim平均差异。此外，在给定任何二次时间输入的情况下，Compress++享受相同的近似线性时间，并通过平方根因子减少了超二次算法的运行时间。在我们的基准测试中，使用高维蒙特卡罗样本和马尔可夫链，针对具有挑战性的微分方程后验概率，Compress++在数量级更短的时间内匹配或接近匹配其输入算法的精度。", "note_en": "Download PDF  Abstract: In distribution compression, one aims to accurately summarize a probabilitydistribution $\\mathbb{P}$ using a small number of representative points.Near-optimal thinning procedures achieve this goal by sampling $n$ points froma Markov chain and identifying $\\sqrt{n}$ points with$\\widetilde{\\mathcal{O}}(1/\\sqrt{n})$ discrepancy to $\\mathbb{P}$.Unfortunately, these algorithms suffer from quadratic or super-quadraticruntime in the sample size $n$. To address this deficiency, we introduceCompress++, a simple meta-procedure for speeding up any thinning algorithmwhile suffering at most a factor of $4$ in error. When combined with thequadratic-time kernel halving and kernel thinning algorithms of Dwivedi andMackey (2021), Compress++ delivers $\\sqrt{n}$ points with$\\mathcal{O}(\\sqrt{\\log n/n})$ integration error and better-than-Monte-Carlomaximum mean discrepancy in $\\mathcal{O}(n \\log^3 n)$ time and $\\mathcal{O}(\\sqrt{n} \\log^2 n )$ space. Moreover, Compress++ enjoys the same near-linearruntime given any quadratic-time input and reduces the runtime ofsuper-quadratic algorithms by a square-root factor. In our benchmarks withhigh-dimensional Monte Carlo samples and Markov chains targeting challengingdifferential equation posteriors, Compress++ matches or nearly matches theaccuracy of its input algorithm in orders of magnitude less time.", "posttime": "2022-02-15 17:35:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时间,compression", "title": "近线性时间的分布压缩", "title_en": "Distribution Compression in Near-Linear Time", "transed": 1, "url": "https://arxiv.org/abs/2111.07941", "via": "", "real_tags": ["时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073485, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在上一篇关于元组迭代的文章中，我们介绍了基本知识。因此，我们实现了一个函数模板，它接受一个元组，并可以很好地将其打印到输出中。还有一个版本带有operator&lt&书信电报；。\n今天我们可以进一步了解其他一些技术。第一个是来自C++17的std:：apply，它是元组的辅助函数。今天的文章还将介绍一些策略，使迭代更通用，并处理定制的可调用对象，而不仅仅是打印。\n这是小系列的第二部分。请参阅本文的第一篇文章，其中我们讨论了基础知识。\nstd:：tuple的一个方便助手是C++17中的std:：apply函数模板。它接受一个元组和一个可调用对象，然后使用从元组中获取的参数调用这个可调用对象。\n#包括&lt；iostream&gt#包括&lt；tuple&gt；int sum（int a，int b，int c）{返回a+b+c；}无效打印（std:：string_视图a、std:：string_视图b）{std:：cout&lt；&lt；&lt；&lt；&lt；&lt；a&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；b&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；）\\n&#34；；}int main（）{std:：tuple number{1,2,3}；标准：cout&lt&书信电报；标准：：应用（总和、数字）&lt&lt&#39;\\n&#39；std：：tuple strs{&#34；Hello&#34；，&#34；World&#34；}；std：：应用（打印，strs）；}\n如您所见，std:：apply接受sum或print函数，然后“展开”元组，并使用适当的参数调用这些函数。\n关键是std:：apply隐藏了所有索引生成和对std:：get&lt&gt；。这就是为什么我们可以用std:：apply替换打印函数，然后不使用index_序列。\n我想到的第一种方法是：创建一个变量函数模板，该模板采用Args。。。并将其传递给std:：apply:\n模板&lt；字体名。。。Args&gt；void printImpl（const Args&amp；tupleArgs）{size_t index=0；auto printElem=[&amp；index]（const auto&amp；x）{if（index++&gt；0）std:：cout&lt；&lt；&lt；&lt；&lt；34；&gt；std:：cout&lt；&lt；x；（普列特莱姆（图普里格斯），…）；]模板&lt；字体名。。。Args&gt；void printTupleApplyFn（const std：：tuple&lt；Args…&gt；&gt；&gt；{std：：cout&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&gt；&gt；&gt；&lt；&lt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；[34；]\n问题在于out printImpl是一个可变函数模板，因此编译器必须实例化它。当我们调用std:：apply时，实例化不会发生，而是在std:：apply内部发生。当我们调用std:：apply时，编译器不知道如何调用可调用对象，因此在这个阶段它无法执行模板推导。\n#包括&lt；iostream&gt#包括&lt；tuple&gt；模板&lt；字体名。。。Args&gt；void printImpl（const Args&amp；tupleArgs）{size_t index=0；auto printElem=[&amp；index]（const auto&amp；x）{if（index++&gt；0）std:：cout&lt；&lt；&lt；&lt；&lt；34；&gt；std:：cout&lt；&lt；x；（普列特莱姆（图普里格斯），…）；]模板&lt；字体名。。。Args&gt；void printTupleApplyFn（const std:：tuple&lt；Args…&gt；&gt；tp）{std:：cout&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；34；（&gt；std:：apply（printImpl&lt；Args…&gt；，tp）；/&lt；std:：cout&lt；&lt；&lt；&lt；&lt；&gt；）和int main（）{std:：tuple tp{10,20,3.14}；printTupleApplyFn（tp）；}\n在上面的示例中，我们帮助编译器创建了请求的实例化，因此它很乐意将其传递给std:：apply。\nstruct HelperCallable{template&lt；typename…Args&gt；void操作符（）（const Args&amp；tupleArgs）{size_t index=0；auto printElem=[&amp；index]（const auto&amp；x）{if（index++&gt；0）std:：cout&lt；&lt；&lt；&lt；34；&gt；std:：cout&lt；&lt；x；}；（普列特莱姆（图普里格斯），…）；}；模板&lt；字体名。。。Args&gt；void printTupleApplyFn（const std：：tuple&lt；Args…&gt；&gt；&gt；{std：：cout&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&lt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt；&gt\n现在，我们所做的，只是传递一个可帮助调用的对象；它是一个具体的类型，因此编译器可以毫无问题地传递它。没有模板参数推导。然后，在某个时刻，编译器将调用HelperCallable（args…），调用该结构的运算符（）。现在一切都很好，编译器可以推断出类型。换句话说，我们推迟了问题的解决。\n因此，我们知道代码可以与助手可调用类型配合使用……那么lambda呢？\n#包括&lt；iostream&gt#包括&lt；tuple&gt；模板&lt；typename TupleT&gt；void printtupleappy（const-TupleT&amp；tp）{std：：cout&lt；&lt；&lt；&lt；34；（&#34；std：：apply（[]（const-auto&amp；…tupleArgs）{size_-t index=0；auto-printElem=[&amp；index]（const-auto&amp；x）{if（index++gt；0）std：：cout&lt；&lt；&lt；&lt；&lt；&lt；&gt；34；&gt；&gt；（普列特莱姆（图普里格斯），…）；}，tp）标准：：cout&lt&lt&#34;)&#34; ; } intmain（）{std:：tuple tp{10,20,3.14,42和#34；hello和#34；}；printTupleApply（tp）；}\n正如你所看到的，我们在一个lambda中有一个lambda。它类似于我们使用运算符（）的自定义类型。您还可以通过C++透视图来了解转换：这个链接\n因为我们的可调用对象得到一个可变参数列表，所以我们可以使用这些信息，使代码更简单。\n内部lambda中的代码使用索引检查是否需要打印分隔符——它检查是否打印第一个参数。我们可以在编译时执行此操作：\n#包括&lt；iostream&gt#包括&lt；tuple&gt；模板&lt；typename TupleT&gt；void printTupleApply（const-TupleT&amp；tp）{std:：apply（[]（const-auto&amp；first，const-auto&amp；restArgs）{auto-printElem=[]（const-auto&amp；x）{std:：cout&lt；&lt；&lt；&lt；&lt；&lt；&lt；x；}；标准：cout&lt&lt&#34;（&#34；&lt；&lt；第一；（printElem（restArgs），…）；），tp）；标准：cout&lt&lt&#34;)&#34; ; } intmain（）{std:：tuple tp{10,20,3.14,42和#34；hello和#34；}；printTupleApply（tp）；}\n这段代码在元组没有元素时会中断——我们可以通过在if constexpr中检查它的大小来修复这一问题，但现在让我们跳过它。\n到目前为止，我们主要关注打印元组元素。所以我们有一个“固定”函数，每个参数都被调用。为了进一步阐述我们的想法，让我们尝试实现一个接受通用可调用对象的函数。例如：\n模板&lt；typename TupleT，typename Fn，std:：size\\u t。。。Is&gt；每个元组无效（元组&amp；tp，Fn&amp；Fn，标准：：索引序列&lt；Is…&gt；）{（fn（std：：get&lt；Is&gt；（std：：forward&lt；TupleT&gt；（tp）），…）；}模板&lt；typename TupleT，typename Fn，std:：size\\u t TupSize=std:：tuple\\u size\\u v&lt；标准：：移除_cvref_t&lt；TupleT&gt&gt&gt；对于每个元组无效（TupleT&amp；tp，Fn&amp；Fn）{对于每个元组impl（std:：forward&lt；TupleT&gt；（tp），std:：forward&lt；Fn&gt；（Fn），std:：make_index_sequence&lt；TupSize&gt；{}\n首先，代码使用通用引用（转发引用）传递元组对象。这是支持各种用例所必需的，尤其是当调用方想要修改元组中的值时。这就是为什么我们需要在所有地方使用std:：forward。\n这是C++20 trait中的一个新助手类型，它确保我们从通过通用引用获得的类型中获得“真实”类型。\n下面是一个关于元组迭代链接到Stackoverflow的问题的很好的总结：\n作为T&amp&amp；是转发引用，T将是tuple&lt&gt&amp；或者tuple&lt&gt；康斯特；当左值传入时；但是std:：tuple_size只适用于tuple&lt&gt；，所以我们必须去掉引用和可能的常量。在C++20添加std:：remove_cvref_t之前，使用decation_t是一种简单（如果过度杀戮）的解决方案。\n我们讨论了一个索引序列的实现；我们也可以在std：：apply中尝试同样的方法。它能产生更简单的代码吗？\n模板&lt；typename TupleT，typename Fn&gt；每一个tuple2（TupleT&amp；amp；tp，Fn&amp；Fn）{std:：apply（[&amp；Fn]（auto&amp；…args）{（Fn（args），…）；}无效，标准：前进&lt；TupleT&gt；（tp）；}\n模板&lt；typename TupleT，typename Fn&gt；对于每个tuple2（TupleT&amp；tp，Fn&amp；Fn）{std:：apply（[&amp；Fn]&lt；typename…T&gt；（T&amp；…args）{（Fn（std:：forward&lt；T&gt；（args）），…）}，无效，标准：前进&lt；TupleT&gt；（tp）；}\n此外，如果要坚持使用C++17，可以对参数应用decltype：\n模板&lt；typename TupleT，typename Fn&gt；每一个tuple2（TupleT&amp；tp，Fn&amp；Fn）{std:：apply（[&amp；Fn]（auto&amp；…args）{（Fn（std:：forward&lt；decltype（args）&gt；（args）），…）；}，标准：前进&lt；TupleT&gt；（tp）；}\n背景任务是打印元组元素，并找到转换它们的方法。在这个过程中，我们经历了变量模板、索引序列、模板参数推导规则和技巧、std:：apply和删除引用。\n我很高兴讨论变化和改进。请在下面的评论中告诉我你的想法。\nC++模板：David Vandevoorde、Nicolai M. Josuttis、Douglas Gregor的完整指南（第二版）\n我&#39；如果你&#39；对现代C++有兴趣！了解最近C++标准的所有主要特征！看看这里：", "note_en": "In the previous article on the tuple iteration, we covered the basics. As a result, we implemented a function template that took a tuple and could nicely print it to the output. There was also a version with  operator &lt;&lt;.\n Today we can go further and see some other techniques. The first one is with  std::apply from C++17, a helper function for tuples. Today’s article will also cover some strategies to make the iteration more generic and handle custom callable objects, not just printing.\n This is the second part of the small series. See the first article  here where we discuss the basics.\n  A handy helper for  std::tuple is the  std::apply function template that came in C++17. It takes a tuple and a callable object and then invokes this callable with parameters fetched from the tuple.\n  #include  &lt;iostream&gt;  #include  &lt;tuple&gt;    int  sum ( int  a ,  int  b ,  int  c )  {  return  a  +  b  +  c ;  } void  print ( std :: string_view  a ,  std :: string_view  b )  {  std :: cout  &lt;&lt;  &#34;(&#34;  &lt;&lt;  a  &lt;&lt;  &#34;, &#34;  &lt;&lt;  b  &lt;&lt;  &#34;) \\n &#34; ; }  int  main ()  {  std :: tuple  numbers  { 1 ,  2 ,  3 };  std :: cout  &lt;&lt;  std :: apply ( sum ,  numbers )  &lt;&lt;  &#39;\\n&#39; ;  std :: tuple  strs  { &#34;Hello&#34; ,  &#34;World&#34; };  std :: apply ( print ,  strs ); }\n  As you can see,  std::apply takes  sum or  print functions and then “expands” tuples and calls those functions with appropriate arguments.\n    The critical thing is that  std::apply hides all index generation and calls to  std::get&lt;&gt;. That’s why we can replace our printing function with  std::apply and then don’t use  index_sequence.\n  The first approach that came to my mind was the following - create a variadic function template that takes  Args... and pass it to  std::apply:\n template  &lt; typename ...  Args &gt; void  printImpl ( const  Args &amp; ...  tupleArgs )  {  size_t  index  =  0 ;  auto  printElem  =  [ &amp; index ]( const  auto &amp;  x )  {  if  ( index ++  &gt;  0 )  std :: cout  &lt;&lt;  &#34;, &#34; ;  std :: cout  &lt;&lt;  x ;  };  ( printElem ( tupleArgs ),  ...); } template  &lt; typename ...  Args &gt; void  printTupleApplyFn ( const  std :: tuple &lt; Args ... &gt;&amp;  tp )  {  std :: cout  &lt;&lt;  &#34;(&#34; ;  std :: apply ( printImpl ,  tp );  std :: cout  &lt;&lt;  &#34;)&#34; ; }\n      The problem lies in the fact that out  printImpl is a variadic function template, so the compiler has to instantiate it. The instantiation doesn’t happen when we call  std::apply, but inside  std::apply. The compiler doesn’t know how the callable object will be called when we call  std::apply, so it cannot perform the template deduction at this stage.\n  #include  &lt;iostream&gt;  #include  &lt;tuple&gt;   template  &lt; typename ...  Args &gt; void  printImpl ( const  Args &amp; ...  tupleArgs )  {  size_t  index  =  0 ;  auto  printElem  =  [ &amp; index ]( const  auto &amp;  x )  {  if  ( index ++  &gt;  0 )  std :: cout  &lt;&lt;  &#34;, &#34; ;  std :: cout  &lt;&lt;  x ;  };  ( printElem ( tupleArgs ),  ...); } template  &lt; typename ...  Args &gt; void  printTupleApplyFn ( const  std :: tuple &lt; Args ... &gt;&amp;  tp )  {  std :: cout  &lt;&lt;  &#34;(&#34; ;  std :: apply ( printImpl &lt; Args ... &gt; ,  tp );  // &lt;&lt;   std :: cout  &lt;&lt;  &#34;)&#34; ; } int  main ()  {  std :: tuple  tp  {  10 ,  20 ,  3.14 };  printTupleApplyFn ( tp ); }\n  In the above example, we helped the compiler to create the requested instantiation, so it’s happy to pass it to  std::apply.\n  struct  HelperCallable  {  template  &lt; typename ...  Args &gt;  void  operator ()( const  Args &amp; ...  tupleArgs )  {  size_t  index  =  0 ;  auto  printElem  =  [ &amp; index ]( const  auto &amp;  x )  {  if  ( index ++  &gt;  0 )  std :: cout  &lt;&lt;  &#34;, &#34; ;  std :: cout  &lt;&lt;  x ;  };  ( printElem ( tupleArgs ),  ...);  } }; template  &lt; typename ...  Args &gt; void  printTupleApplyFn ( const  std :: tuple &lt; Args ... &gt;&amp;  tp )  {  std :: cout  &lt;&lt;  &#34;(&#34; ;  std :: apply ( HelperCallable (),  tp );  std :: cout  &lt;&lt;  &#34;)&#34; ; }\n  Now, what we do, we only pass a  HelperCallable object; it’s a concrete type so that the compiler can pass it without any issues. No template parameter deduction happens. And then, at some point, the compiler will call  HelperCallable(args...), which invokes  operator() for that struct. And it’s now perfectly fine, and the compiler can deduce the types. In other words, we deferred the problem.\n So we know that the code works fine with a helper callable type… so how about a lambda?\n #include  &lt;iostream&gt;  #include  &lt;tuple&gt;   template  &lt; typename  TupleT &gt; void  printTupleApply ( const  TupleT &amp;  tp )  {  std :: cout  &lt;&lt;  &#34;(&#34; ;  std :: apply ([]( const  auto &amp; ...  tupleArgs )  {  size_t  index  =  0 ;  auto  printElem  =  [ &amp; index ]( const  auto &amp;  x )  {  if  ( index ++  &gt;  0 )  std :: cout  &lt;&lt;  &#34;, &#34; ;  std :: cout  &lt;&lt;  x ;  };  ( printElem ( tupleArgs ),  ...);  },  tp  )  std :: cout  &lt;&lt;  &#34;)&#34; ; } int  main ()  {  std :: tuple  tp  {  10 ,  20 ,  3.14 ,  42 ,  &#34;hello&#34; };  printTupleApply ( tp ); }\n   As you can see, we have a lambda inside a lambda. It’s similar to our custom type with  operator(). You can also have a look at the transformation through C++ Insights:  this link\n  Since our callable object gets a variadic argument list, we can use this information and make the code simpler.\n  The code inside the internal lambda uses  index to check if we need to print the separator or not - it checks if we print the first argument. We can do this at compile-time:\n #include  &lt;iostream&gt;  #include  &lt;tuple&gt;   template  &lt; typename  TupleT &gt; void  printTupleApply ( const  TupleT &amp;  tp )  {  std :: apply  (  []( const  auto &amp;  first ,  const  auto &amp; ...  restArgs )  {  auto  printElem  =  []( const  auto &amp;  x )  {  std :: cout  &lt;&lt;  &#34;, &#34;  &lt;&lt;  x ;  };  std :: cout  &lt;&lt;  &#34;(&#34;  &lt;&lt;  first ;  ( printElem ( restArgs ),  ...);  },  tp  );  std :: cout  &lt;&lt;  &#34;)&#34; ; } int  main ()  {  std :: tuple  tp  {  10 ,  20 ,  3.14 ,  42 ,  &#34;hello&#34; };  printTupleApply ( tp ); }\n  This code breaks when tuple has no elements - we could fix this by checking its size in  if constexpr, but let’s skip it for now.\n  So far we focused on printing tuple elements. So we had a “fixed” function that was called for each argument. To go further with our ideas, let’s try to implement a function that takes a generic callable object. For example:\n   template  &lt; typename  TupleT ,  typename  Fn ,  std :: size_t ...  Is &gt; void  for_each_tuple_impl ( TupleT &amp;&amp;  tp ,  Fn &amp;&amp;  fn ,  std :: index_sequence &lt; Is ... &gt; )  {  ( fn ( std :: get &lt; Is &gt; ( std :: forward &lt; TupleT &gt; ( tp ))),  ...); } template  &lt; typename  TupleT ,  typename  Fn ,  std :: size_t  TupSize  =  std :: tuple_size_v &lt; std :: remove_cvref_t &lt; TupleT &gt;&gt;&gt; void  for_each_tuple ( TupleT &amp;&amp;  tp ,  Fn &amp;&amp;  fn )  {  for_each_tuple_impl ( std :: forward &lt; TupleT &gt; ( tp ),  std :: forward &lt; Fn &gt; ( fn ),  std :: make_index_sequence &lt; TupSize &gt; {}); }\n  First, the code uses universal references (forwarding references) to pass tuple objects. This is needed to support all kinds of use cases - especially if the caller wants to modify the values inside the tuple. That’s why we need to use  std::forward in all places.\n     This is a new helper type from the C++20 trait that makes sure we get a “real” type from the type we get through universal reference.\n  Here’s a good summary from a question about tuple iteration  link to Stackoverflow:\n As  T&amp;&amp; is a forwarding reference,  T will be  tuple&lt;...&gt;&amp; or  tuple&lt;...&gt; const&amp; when an lvalue is passed in; but  std::tuple_size is only specialized for  tuple&lt;...&gt;, so we must strip off the reference and possible const. Prior to C++20’s addition of  std::remove_cvref_t, using  decay_t was the easy (if overkill) solution.\n  We discussed an implementation with index sequence; we can also try the same with std::apply. Can it yield simpler code?\n  template  &lt; typename  TupleT ,  typename  Fn &gt; void  for_each_tuple2 ( TupleT &amp;&amp;  tp ,  Fn &amp;&amp;  fn )  {  std :: apply  (  [ &amp; fn ]( auto &amp;&amp;  ... args )  {  ( fn ( args ),  ...);  },  std :: forward &lt; TupleT &gt; ( tp )  ); }\n   template  &lt; typename  TupleT ,  typename  Fn &gt; void  for_each_tuple2 ( TupleT &amp;&amp;  tp ,  Fn &amp;&amp;  fn )  {  std :: apply  (  [ &amp; fn ] &lt; typename  ... T &gt; ( T &amp;&amp;  ... args )  {  ( fn ( std :: forward &lt; T &gt; ( args )),  ...);  },  std :: forward &lt; TupleT &gt; ( tp )  ); }\n  Additionally, if you want to stick to C++17, you can apply  decltype on the arguments:\n template  &lt; typename  TupleT ,  typename  Fn &gt; void  for_each_tuple2 ( TupleT &amp;&amp;  tp ,  Fn &amp;&amp;  fn )  {  std :: apply  (  [ &amp; fn ]( auto &amp;&amp;  ... args )  {  ( fn ( std :: forward &lt; decltype ( args ) &gt; ( args )),  ...);  },  std :: forward &lt; TupleT &gt; ( tp )  ); }\n    The background task was to print tuples elements and have a way to transform them. During the process, we went through variadic templates, index sequence, template argument deduction rules and tricks, std::apply, and removing references.\n I’m happy to discuss changes and improvements. Let me know in the comments below the article about your ideas.\n   C++ Templates: The Complete Guide (2nd Edition) by David Vandevoorde, Nicolai M. Josuttis, Douglas Gregor\n  I&#39;ve prepared a valuable bonus if you&#39;re interested in Modern C++!  Learn all major features of recent C++ Standards! Check it out here:", "posttime": "2022-02-15 17:28:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,std", "title": "C++模板：如何迭代STD:tuple：STD:应用和更多", "title_en": "C++ Templates: How to Iterate through std:tuple: std:apply and More", "transed": 1, "url": "https://www.cppstories.com/2022/tuple-iteration-apply/", "via": "", "real_tags": ["c++", "std"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦/多伦多，2月14日（路透社）-一个致力于传播泄露数据的网站称，在一个广受该组织支持者欢迎的筹款平台据称遭到黑客攻击后，该网站获得了大量关于反对大流行卫生措施的加拿大运动捐赠者的信息。\n分布式拒绝机密（DDoS）周日晚些时候在其网站上表示，它拥有来自美国基督教筹款网站GiveSendGo的30兆字节的捐赠者信息，包括姓名、电子邮件地址、邮政编码和互联网协议地址。\n随着渥太华和其他地方的当局试图控制卡车司机领导的集会，为加拿大抗议活动提供资金已成为一个关键的关注点。卡车司机封锁了加拿大各地的城市和过境点，要求包括总理贾斯汀·特鲁多的证词。\nGiveSendGo发言人在周一的一封电子邮件中表示，该网站仍在向&#34；2022年和#34年的自由护航；而且捐款没有被退还。这位发言人没有立即对黑客行为本身发表评论。\n然而，该网站似乎处于离线状态。网站访问者收到一条消息，称其正在维护和&#34；我们很快就会回来&#34;\nGiveSendGo此前曾声称，它不受加拿大法院冻结这些资金的命令的约束。\nDaily Dot digital news outlet的一名记者在Twitter上表示，GiveSendGo网站一夜之间遭到黑客攻击，其头版被电影#34；冷冻和#34；以及一份宣言，指责它支持#34；渥太华的一次暴动&#34;\n路透社无法立即证实黑客攻击和泄密指控，尽管分布式拒绝保密长期以来一直是右翼组织泄密数据的托管地，包括极右翼的爱国者阵线和誓词守护者。\nDDoS表示，由于捐赠者信息包含敏感的个人信息，它不会公开这些数据，而是将其提供给&#34；记者和研究人员&#34;\nDDoS自称是一家非营利组织，致力于为公众利益免费传输数据。\n在主流众筹平台GoFundMe阻止向自称自由护航队捐款后，GiveSendGo成为向抗议者筹集资金的主要渠道。本月早些时候，该组织表示已为抗议活动筹集了800万美元。\n北美&#39；加拿大边境服务机构2019冠状病毒疾病组织最新的贸易联系在星期日晚些时候重新开放，结束了为期六天的封锁，加拿大警方在清除了抗议者的战斗结束CVID-19限制之后。阅读更多\n伦敦拉斐尔·萨特和多伦多安娜·梅勒·帕普尼报道；霍华德·戈勒编辑", "note_en": "LONDON/TORONTO, Feb 14 (Reuters) - A website devoted to disseminating leaked data says it was given reams of information about donors to a Canadian movement opposed to pandemic health measures after a fundraising platform popular with supporters of the group allegedly suffered a hack.\n Distributed Denial of Secrets (DDoS) said on its website late on Sunday that it had 30 megabytes of donor information from the U.S.-based Christian fundraising site GiveSendGo, including names, email addresses, ZIP codes and internet protocol addresses.\n The funding of the Canadian protests has emerged as a key point of interest as authorities in Ottawa and elsewhere try to get a grip on rallies led by truckers that have been blockading cities and border crossings across Canada with demands that include the deposition of Prime Minister Justin Trudeau.\n  In an email on Monday, a GiveSendGo spokesperson said that the site was still soliciting donations to the &#34;Freedom Convoy 2022&#34; campaign and that donations were not being refunded. The spokesperson did not immediately comment on the hack itself.\n The site, however, appeared to be offline. Website visitors were met with a message that it was under maintenance and &#34;we will be back very soon.&#34;\n GiveSendGo had previously asserted it was not subject to a Canadian court order that froze these funds.\n A journalist at the Daily Dot digital news outlet said on Twitter that the GiveSendGo site suffered a hack overnight and had its front page briefly replaced by a clip from the movie &#34;Frozen&#34; and a manifesto accusing it of supporting &#34;an insurrection in Ottawa.&#34;\n Reuters could neither immediately confirm the hack nor the leak claims, although Distributed Denial of Secrets has a long record of hosting leaked data from right-wing organizations, including the far-right Patriot Front and the Oath Keepers.\n DDoS said that because the donor information contained sensitive personal information, it would not be making the data available publicly but would instead be offering it to &#34;journalists and researchers.&#34;\n DDoS describes itself as a non-profit devoted to enabling the free transmission of data in the public interest.\n GiveSendGo became a prime conduit for money to the protesters after mainstream crowdfunding platform GoFundMe blocked donations to the self-declared Freedom Convoy. Earlier this month the group said it had raised $8 million for the protests.\n North America&#39;s busiest trade link reopened for traffic late on Sunday, ending a six-day blockade, Canada Border Services Agency said, after Canadian police cleared the protesters fighting to end COVID-19 restrictions.   read more\n  Reporting by Raphael Satter in London and Anna Mehler Paperny in Toronto; Editing by Howard Goller", "posttime": "2022-02-15 17:14:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,canada,网站", "title": "据报道，黑客袭击事件后，加拿大卡车车队捐赠者的名字被泄露", "title_en": "Names of Canada truck convoy donors leaked after reported hack", "transed": 1, "url": "https://www.reuters.com/world/us/leak-site-says-it-has-been-given-list-canada-truck-convoy-donors-after-reported-2022-02-14/", "via": "", "real_tags": ["黑客", "canada", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，一种现象开始流行起来。有人，可能不是开发人员，认为需要有一种方法来辨别另一个开发人员是否有能力担任开发人员的角色。于是，代码测试被发明了。从白板分类树，到fizzbuzz，到编码katas，再到实际开发产品，它有很多种口味。我们可以深入了解公司是否为这项工作付费，或者他们是否强迫一个人在观众面前完成这项工作的细微差别——但这一切都不是重点。\n让我们来谈谈一种新现象，以及为什么它实际上更糟。德夫雷尔测试。\n首先，让我澄清一下。我是个很棒的考生。我是那种喜欢考试的书呆子。但那是在过去，那时我没有简历或简历，我需要证明我做了什么，学到了什么。\n快进到今天。大多数在DevRel领域工作超过5分钟的人都有一些作品集、在线展示和大量工作。这可能只是他们写的博客帖子的一堆链接，或几次会议谈话的视频列表，甚至是他们与不同社区合作的一堆社交媒体帖子。\n让我们暂时回避这样一个事实：大多数面试公司都相信你比他们更需要你。对于技术领域的大多数部门来说，这是一种误解。大多数组织都需要有人来填补这个职位。在德夫雷尔的世界里，这是非常正确的，因为合格的个人比空缺职位少得多。\n像这样的误解往往会导致寻找方法，以毫无意义的方式审查潜在的候选人。当涉及到开发人员时，需要进行测试。通常情况下，你需要在工作时间或在不同技术背景的人的监督下完成之前设定的任务。这是你展示自己有多聪明的机会。\n同样，你是带着简历来的。这应该足够好了。大多数管理工作不需要某种测试。大多数人力资源和招聘人员都不需要考试。C级工作不需要考试。所有这些都是根据报纸和采访得出的。他们甚至没有Github历史记录或相关语言列表。\n让我们回到德夫雷尔。对于DevRel从业者所做的事情，有一份清晰的书面记录，甚至比一个开发人员还要多。测试的价值在哪里？练习报告？一篇测试博客文章？\n这部分是DevRel的开发部分。尽管已经一次又一次地证明这些东西没有价值，但开发者世界已经将其留给了世界上的DevRel候选人。\n如果一个组织无法通过LinkedIn和快速搜索将其整合起来，那么也许是时候认识到，他们还不够先进，无法为之工作。当然，应聘者应该被要求证明自己的价值——但测试并不是实现这一点的方法。不再是一个多层次的面试结构。\n结束DevRel候选测试。结束开发人员候选测试。这伤害了每个人，浪费了每个人的时间。", "note_en": "A few years ago, a phenomenon began to take hold. Someone, probably not a developer, thought there needed to be a way to discern if another developer had the chops to fill a developer role. So the Code Test was invented. It’s seen many flavors, from the white board sorting tree, to fizzbuzz, to code katas, to actually working on the product. We can get into the nuance of whether companies pay for this work or if they force one to do it in front of an audience - but none of that is really the point.\n      Let’s talk about a new phenomenon and why it’s actually even worse. The DevRel test.\n  First, let me be clear. I’m a great test taker. I was one of those nerdy kids who loved taking tests. But that was in the old days, when I didn’t have a CV or a resumé and I needed to prove what I had done and what I had learned.\n  Fast forward to today. Most people who have been in the DevRel field for more than 5 minutes have some sort of portfolio, an online presence, a body of work. This might just be a bunch of links to blog posts they’ve written or a list of videos from a couple conference talks - even a bunch of social media posts they’ve used to work with different communities.\n  Let’s eschew for a moment the fact that most interviewing companies are functioning on the belief that you need them more than they need you. This is a misconception for most sections of the technology field. Most organizations need someone to fill a role. This is extremely true in the world of DevRel as there are many fewer qualified individuals than there are open positions.\n  Misconceptions like this often lead to finding ways to vet potential candidates in ways that don’t make sense. When it comes to developers, a test is given. Often unpaid you are expected to perform the task set before you either on your time or while being overseen by people of varying technical backgrounds. This is your opportunity to show how clever you are.\n  Again, you came in with a resumé or a CV. That should be good enough. Most management jobs do not require some kind of test. Most HR and recruiter roles do not require a test. C-level jobs do not require a test. All these are landed just based on the paper and the interview. They don’t even have a Github history or list of relevant languages coded in.\n  So let’s swing this back to DevRel. Even more than a developer, there is a clear paper trail on what a DevRel practitioner has done. Where is the value of a test? A practice presentation? A test blog post?\n  Part of this is the Dev part of DevRel. Even though it has been proven  again and  again and  again these things have no value, the developer world has bequeathed this to the DevRel candidates of the world.\n    If an organization can’t piece it together from LinkedIn and a quick search, maybe it’s time to realize they aren’t a company advanced enough to work for. Sure, a candidate should be expected to prove their value - but tests aren’t the way to do it. Not anymore than a multi-level interviewing structure.\n  End the DevRel candidate test. End the Developer candidate test. It’s hurting everyone and wastes everyone’s time.", "posttime": "2022-02-15 17:12:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,测试,tests", "title": "代码测试毫无意义——对DevRel来说更是如此", "title_en": "Code Tests are pointless – doubly so for DevRel", "transed": 1, "url": "https://devrelate.io/post/19-end-the-pointless-devrel-test", "via": "", "real_tags": ["代码", "测试", "tests"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073481, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "20多年来肆虐美国西部的极端干旱现在被列为至少1200年来最干旱的22年时期，科学家发现，人类对地球的加热正在加剧这场特大干旱。\n在他们的研究中，科学家们考察了北美洲西南部800年前的主要干旱，并确定本世纪迄今为止该地区的干旱程度已经超过了16世纪末的特大干旱，这是有记录以来最干旱的22年。该研究的作者还得出结论，干旱状况可能会持续到今年，从过去来看，可能会持续数年。\n研究人员发现，如果没有全球变暖，目前的干旱不会如此严重。他们估计，干旱的严重程度中有42%是由于温室气体在大气中积累造成的温度升高。\n加州大学洛杉矶分校（UCLA）气候科学家、该研究的主要作者帕克·威廉姆斯（Park Williams）说：“研究结果确实令人担忧，因为它表明，由于气候变化，我们现在面临的干旱状况要严重得多。”。“但这也有相当大的空间让旱情恶化。”\n威廉姆斯和他的同事将目前的干旱与800年代到1500年代之间持续23年到30年的其他七次特大干旱进行了比较。\n从数千棵树上提取的木芯使科学家得以重建几个世纪前的土壤湿度。他们使用了从蒙大拿州到加利福尼亚州再到墨西哥北部约1600个地点的树木数据。\n周一发表在《自然气候变化》杂志上的这项研究补充了越来越多的研究，表明随着化石燃料的燃烧继续推高温度，加剧干燥趋势，美国西部面临重大挑战。\n威廉姆斯是一个团队的成员，该团队在2020年发表了一项类似的研究。当时，他们发现自2000年以来的干旱是继16世纪末的特大干旱之后第二严重的。在过去两年里，由于普遍存在高温和干旱，目前的干旱已经超过了这一极限。\n一些科学家将西部地区的这种趋势描述为“干旱化”，并表示该地区必须做好准备，随着气温继续攀升，干燥才能继续。\n威廉姆斯说，从干旱期到湿润期，西部地区容易出现极端的变化，比如溜溜球上下波动，但随着气候变化，这些变化现在“叠加在严重的干旱趋势上”。\n研究人员说，自2000年以来，北美西南部的平均温度比过去50年的平均温度高1.6华氏度。气温升高加剧了干旱，蒸发增加，土壤干燥，溪流和河流中的水流减少。\n威廉姆斯说，较高的温度会使大气更加干渴，土壤和植被会变得干燥，就像“我们打开加热器时，室内植物会干涸一样。”。\n科学家指出，科罗拉多河在2020和2021年的水流量在一个多世纪的记录中减少到了两年平均最低水平。\n这条河向七个州供水，从怀俄明州到加利福尼亚州，再到墨西哥北部。但它长期被过度使用，干旱加剧了问题。在过去的一年里，该国最大的两座水库米德湖和鲍威尔湖的水位降至有记录以来的最低水平。\n威廉姆斯说：“我们需要了解，西部的水资源预算正在我们脚下迅速变化。”。“我们需要为一个更加干燥的未来做好准备，不要过于依赖希望，当天气再次变湿时，我们可以恢复正常的水资源管理。”\n炎热干燥的年份对整个加利福尼亚州和西部的供水和景观造成了重大损失。加利福尼亚州的水库在过去两年中有所减少。在犹他州，大盐湖已经下降到创纪录的低水平。极端高温导致了野火爆炸。在莫哈韦沙漠，科学家将鸟类数量的大幅下降归因于气候变化带来的更热、更干燥的条件。\n威廉姆斯说，即使没有气候变化，过去20年对该地区来说自然也是“厄运期”。但他说，如果没有气候变化的影响，“这场干旱甚至不会接近最严重的特大干旱。”\n一些长期干旱包括1213年至1237年和1271年至1300年的干旱。在那个世纪里，人们认为在四角地区的村庄里生活和耕作的土著人因干旱而离开了悬崖边的家园。\n科学家们研究了数百名其他研究人员数十年来收集的数据，这些研究人员通过钻取长寿树的木芯，如道格拉斯冷杉、皮尼翁松、黄松和蓝橡树。\n他们发现目前的旱灾包括两年- 2002年和2021年，这是过去1200年中最干旱的一年。威廉姆斯说，随着过去一年干旱的激增，这22年的平均干旱程度已经超过了大多数较长的特大干旱。\n16世纪末的干旱在23年后突然结束，当时潮湿的条件席卷了整个地区。但目前的旱情没有减弱的迹象。\n根据美国干旱监测网站，美国西部96%的地区现在异常干旱或更严重，88%的地区处于干旱状态。\n科学家预测，旱灾很可能至少会持续到今年。他们考虑了一个假设的未来情景，基于过去1200年所有40年期间的土壤湿度，然后叠加了近年来发生的相同数量的气候变化导致的干燥。他们发现，在94%的模拟中，干旱至少持续了23年。在75%的模拟中，干旱持续了30年。\n威廉姆斯说：“当它处于非常耗尽的状态时，需要很长时间才能把桶装满。”。“要在未来几年内结束这场旱灾，需要非常幸运。在过去1200年的数据中，这种幸运的例子只有几个。”\n威廉姆斯与哥伦比亚大学拉蒙特·多尔蒂地球观测站的研究人员本杰明·库克和杰森·斯默登合著了这项研究。他们使用29个气候模型来估计气候变化带来的更高温度的影响。\n威廉姆斯说，当他们分析干旱在没有气候变化的情况下是如何演变的时，他们发现该地区将在2005年和2006年的雨季摆脱干旱，然后在2007年再次出现干旱。\n科学家们用10年的运行平均值来评估长期趋势，因此一个潮湿的年份，比如2019年，不足以结束大部分干旱年份的运行。\n这项研究集中在整个地区，但因地区而异。虽然从亚利桑那州到落基山脉的干旱最为严重，但研究表明，加州大部分地区经历了22年来最干旱的时期之一，尽管不是绝对最干旱的时期。\n威廉姆斯说，这项研究应该作为一个警告，在未来的几年和几十年里，干燥可能会变得更糟。\n威廉姆斯说：“上千年发生的特大干旱是在没有气候变化的情况下发生的。”。当这种特大干旱再次发生时，它们将“发生在一个由于人为气候变化而导致大气人为变暖的世界，这将是绝对灾难性的。”\n国家大气研究中心（National Center for Atmospheric Research）的气候科学家艾拉·辛普森（Isla Simpson）没有参与这项研究。她说，她认为这些方法是可靠的，这些发现对以前的科学做出了重要贡献。\n辛普森说：“鉴于过去两年的情况有多严重，这次更新真的很有用。”。\n她说，目前的干旱部分是由于降水量少，但实际上是气温升高的影响加剧了干旱，这是“非常明显的气候变化信号”\n辛普森说：“就温度而言，我们已经摆脱了20世纪的气候，这将对蒸发和土壤湿度产生影响。”。她补充说，从干旱到湿润仍然会有自然的波动，“但由于人为气候变化，在长期干旱化过程中，我们正在经历这种变化，这将使事件变得更加严重。”\n威廉姆斯说，这项研究指出了科罗拉多河等水源长期过度使用的实际问题，在过去一个世纪里，科罗拉多河推动了从洛杉矶到凤凰城等城市的发展。他说，地下水的普遍枯竭是该地区关键水储备过度消耗的另一个症状。\n他说，西方的许多人可能感觉不到他们正在经历一场特大干旱，因为“我们的系统中现在有所有这些缓冲区，比如地下水和大型水库。”\n“但我们现在正在迅速利用这些后盾，以至于我们面临着在10年或20年内无法获得这些后盾的真正风险，”他说，“无论是这一事件尚未结束，还是下一次大旱灾已经开始。”", "note_en": "The extreme dryness that has ravaged the American West for more than two decades now ranks as the driest 22-year period in at least 1,200 years, and scientists have found that this megadrought is being intensified by humanity’s heating of the planet.\n In their research, the scientists examined major droughts in southwestern North America back to the year 800 and determined that the region’s desiccation so far this century has surpassed the severity of a megadrought in the late 1500s, making it the driest 22-year stretch on record. The authors of the study also concluded that dry conditions will likely continue through this year and, judging from the past, may persist for years.\n The researchers found the current drought wouldn’t be nearly as severe without global warming. They estimated that 42% of the drought’s severity is attributable to higher temperatures caused by greenhouse gases accumulating in the atmosphere.\n “The results are really concerning, because it’s showing that the drought conditions we are facing now are substantially worse because of climate change,” said Park Williams, a climate scientist at UCLA and the study’s lead author. “But that also there is quite a bit of room for drought conditions to get worse.”\n  Williams and his colleagues compared the current drought to seven other megadroughts between the 800s and 1500s that lasted between 23 years and 30 years.\n   Wood cores extracted from thousands of trees enabled the scientists to reconstruct the soil moisture centuries ago. They used data from trees at about 1,600 sites across the region, from Montana to California to northern Mexico.\n   The  study, which was published Monday in the journal Nature Climate Change, adds to a growing body of research that shows the American West faces major challenges as the burning of fossil fuels continues to push temperatures higher,  intensifying the drying trend.\n  Williams was part of a team that published a similar  study in 2020. At the time, they found the drought since 2000  was the second-worst after the late 1500s megadrought. With widespread heat and dryness over the past two years, the current drought has passed that extreme mark.\n Some scientists describe the trend in the West as “ aridification” and say the region must prepare for the drying to continue as temperatures continue to climb.\n Williams said the West is prone to extreme variability from dry periods to wet periods, like a yo-yo going up and down, but these variations are now “superimposed on a serious drying trend” with climate change.\n  The average temperature in southwestern North America since 2000 has been 1.6 degrees Fahrenheit warmer than the average during the previous 50 years, the researchers said. The warmer temperatures have compounded the drought by increasing evaporation, drying soils and leaving less water flowing in streams and rivers.\n Higher temperatures make the atmosphere thirstier, drying out soil and vegetation in much the same way that “our house plants dry out when we turn on the heater,” Williams said.\n The scientists pointed out that the flow of the Colorado River during the 2020 and 2021 water years shrank to the lowest two-year average in  more than a century of recordkeeping.\n The river supplies water across seven states, from Wyoming to California, and to northern Mexico. But it has been chronically overused, and the drought has compounded the problems. Over the past year, its two largest reservoirs, Lake Mead and Lake Powell,  declined to their lowest levels on record.\n “We need to understand that the water budget of the West is changing beneath our feet rapidly,” Williams said. “We need to be prepared for a much drier future and to not rely so much on hope that when it gets wet again, we can just go back to business-as-usual water management.”\n The hot, dry years have taken a major toll on water supplies and landscapes throughout California and the West. California’s reservoirs have  dropped during the past two years. In Utah, the Great Salt Lake has  declined to record-low levels. Extreme heat has contributed to  explosive wildfires. And in the Mojave Desert, scientists have attributed  major declines in bird populations to hotter, drier conditions brought on by climate change.\n   Even without climate change, the past two decades would have been a “bad luck period” naturally for the region, Williams said. But without the influence of climate change, he said, “this drought wouldn’t even be coming close to matching the worst of the megadroughts.”\n Some of the long droughts included those from 1213 to 1237 and from 1271 to 1300. During that century, the Indigenous people who lived and farmed in villages in the Four Corners region are thought to have  left their cliffside homes because of drought.\n  The scientists studied data compiled over decades by hundreds of other researchers, who extracted wood cores by boring into long-lived trees such as Douglas firs, piñon pines, ponderosa pines and blue oaks.\n They found the current drought has included two years — 2002 and 2021 — that rank among the driest in the past 1,200 years. And with the surge in drying over the past year, Williams said, these 22 years have already been drier on average than most of the longer megadroughts.\n The late 1500s drought ended abruptly after 23 years when wet conditions swept across the region. But the current drought shows no signs of subsiding.\n According to the  U.S. Drought Monitor website, 96% of the Western U.S. is now abnormally dry or worse, and 88% of the region is in drought.\n   The scientists projected it’s highly likely the drought will continue at least through this year. They considered a hypothetical future scenario based on soil moisture during all 40-year periods in the past 1,200 years and then superimposed the same amount of climate change-driven drying that has occurred in recent years. They found that in 94% of their simulations, the drought continued for at least a 23rd year. And in 75% of the simulations, the drought lasted 30 years.\n “When it’s in a very depleted state, it takes a long time to fill the bucket back up,” Williams said. “It would take exceptional luck to end this drought in the next few years. There’s only been a couple of examples of that type of luck in the last 1,200 years of data that we have.”\n Williams coauthored the study with researchers Benjamin Cook and Jason Smerdon of Columbia University’s Lamont-Doherty Earth Observatory. They used 29 climate models to estimate the influence of higher temperatures unleashed by climate change.\n When they analyzed how the drought would have evolved without climate change, they found that the region would have emerged from drought during wet years in 2005 and 2006, and then drought would have set in again in 2007, Williams said.\n The scientists used a 10-year running average in assessing long-term trends, so a single wet year, such as 2019, wasn’t enough to end the run of mostly parched years.\n The research focused on the entire region, but there were differences depending on the area. While the dryness has been most extreme in areas from Arizona to the Rocky Mountains, the study showed that much of California experienced one of the driest 22-year periods, though not the absolute driest.\n Williams said the research should serve as a warning that the drying could get much worse in the years and decades to come.\n “The big megadroughts that occurred last millennium occurred in the absence of climate change,” Williams said. When such megadroughts return, they’ll be occurring “in a world where the atmosphere is also artificially warmer because of human-caused climate change, which would be absolutely catastrophic.”\n Isla Simpson, a climate scientist at the National Center for Atmospheric Research who wasn’t involved in the study, said she thinks the methods are solid and the findings make an important contribution to previous science.\n “It’s really useful to have this update, given how severe the last two years have been,” Simpson said.\n She said the current drought has occurred in part due to low precipitation, but it’s really the effect of higher temperatures that has worsened the drying and is “very clear climate change signal.”\n   “We have emerged out of the climate of the 20th century in terms of temperature, which will have an impact on evaporation and soil moisture,” Simpson said. There will still be the natural swings from dry to wet, she added, “but we’re experiencing this variability now within this long-term aridification due to anthropogenic climate change, which is going to make the events more severe.”\n Williams said the research points to real problems in the chronic overuse of water sources like the Colorado River, which fueled the growth of cities from Los Angeles to Phoenix over the past century. He said the widespread depletion of groundwater is another symptom of overdrawing the region’s critical water reserves.\n Many people in the West may not feel like they’re living through a megadrought, he said, because “we have all of these buffers in our system now, like groundwater and large reservoirs.”\n “But we are utilizing those backstops so rapidly right now that we’re at real risk of those backstops not being there for us in 10 or 20 years,” he said, “when either this event still hasn’t ended, or when the next megadrought has already begun.”", "posttime": "2022-02-15 17:05:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "气候变化,megadrought", "title": "西部大干旱是1200年来最严重的，气候变化加剧了这种情况", "title_en": "Western megadrought is worst in 1,200 years, intensified by climate change", "transed": 1, "url": "https://www.latimes.com/environment/story/2022-02-14/western-megadrought-driest-in-1200-years", "via": "", "real_tags": ["气候变化"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约市议会议员查询", "note_en": "NYC Council Member Lookup", "posttime": "2022-02-15 17:04:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察局,surveillance,议会", "title": "纽约警察局的监控机器", "title_en": "The NYPD’s Surveillance Machine", "transed": 1, "url": "https://nypd-surveillance.amnesty.org/", "via": "", "real_tags": ["警察局", "议会"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073478, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在意识到需要一个由工程师组成的文字团队才能使我们的自我管理的Solr基础设施保持最新并正常工作后，我们正在转向一个托管搜索解决方案——Elasticsearch！\n更具体地说，我们正在迁移到Elasticsearch，它由Amazon Web Services（AWS）托管和管理。这两个搜索引擎有很多相似之处，但确实需要一些术语、模式和思维的翻译。\n超过2021，我们已经将一个较小的搜索索引完全迁移到弹性搜索，并且目前正在使用弹性搜索来搜索一些新的搜索域。迄今为止的旅程教会了我们很多Solr和Elastic之间的关键区别，以及人们可能不知道的细微差别，除非他们经历了类似的迁移。\n我们把这篇博文放在一起是为了帮助其他正在考虑这样一个练习的人。\n我们从2014年开始在Canva使用Solr，当时它是最活跃的社区中最成熟的选择。现在，在2022年，Elasticsearch不再是一个乏味且有点不可靠的新手，而是已经证明自己是一个可靠的搜索引擎，拥有强大的开发者社区和支持。\n现在，雇佣具有Elasticsearch经验的工程师变得更容易了，雇佣熟悉Solr的人也更难了。\n以下各节并排比较了我们如何体验Solr和Elasticsearch，我们对它们的喜爱和挣扎，以及我们希望在迁移之前了解Elasticsearch的情况。我们希望这将有利于希望做同样事情的团队。\n我们（作为工程师）与技术互动的关键区别在于基础设施的管理方式。以下是要考虑的方面。\n必须单独管理以解决问题。如果你在管理Solr，你还必须管理Zookeeper。\n自动缩放可以添加节点以保持最小复制，但不支持在AZs（AWS可用性区域）之间进行平衡。\n自动缩放不会平衡副本以防止危险的拓扑。我们观察到自动缩放的几种不良行为。\n两个节点被指定为同一碎片的副本，如果其中一个崩溃，会给幸存者带来巨大的负载，通常还会导致幸存者死亡。\n将多个节点作为副本添加到单个领导者，同时导致领导者尝试将其数据同时分发给两个新的追随者。这偶尔会让领导倒台。\n我们有一些自我管理的脚本，以确保碎片的副本位于不同的节点中并跨AZ，但这不是现成的。\n碎片根据复制值放置在节点上，复制值在索引创建时定义，或由索引模板指定。\nsolrconfig。xml，其中包含一些设置，例如自定义默认手持器、zookeeper超时和自动提交间隔。\n可以使用具有这些设置默认值的索引模板创建索引，但更改模板不会更改活动索引的配置。要更改活动索引的配置，必须直接将设置或映射应用于该索引。\nElasticsearch处理索引配置的方式与Solr相比有很大变化。了解什么是索引模板以及如何使用它们有助于将Solr配置文件转换为Elasticsearch上下文。\n索引模板包含定义索引的设置和映射。它们指定一个索引模式（例如test-*），该模式应用于与该模式匹配的所有新索引。\n映射定义字段以及它们应该使用的分析器/标记器。映射也可以标记为&#34；动态&#34；：&#34;严格的&#34；，这要求您显式地添加要为映射编制索引的字段（就像Solr中的大多数字段一样）；如果要编制索引的文档包含映射中未定义的字段，则无法编制索引。\n还可以使用组件模板创建索引模板。例如，不同的组件模板可能各自定义：\n然后，可以使用这三个模板创建索引模板，将它们的组合配置应用于新索引。\nElasticsearch和Solr具有类似的标记化器和分析器，但对模式的定义不同，并且有自己的索引行为。\n&lt；字段名=&#34；品牌&#34；类型=&#34；简单的文字&#34；索引=&#34；正确&#34；存储=&#34；假&#34；必需=&#34；假&#34；多值=&#34；正确&#34/&gt&书信电报；字段类型名称=&#34；简单的文字&#34；等级=&#34；索尔。文本字段和#34；位置增量差距=&#34；100&#34;&gt&书信电报；分析仪&gt&书信电报；标记器类=&#34；索尔。WhitespaceTokenizerFactory&#34/&gt&书信电报；过滤等级=&#34；索尔。小写字母filterFactory&#34/&gt&书信电报；过滤等级=&#34；索尔。ASCIIFoldingFilterFactory&#34/&gt&lt/分析仪&gt&lt/fieldType&gt；\n{&#34；设置&#34；：{&#34；简单文本&#34；{&#34；标记器&#34；：&#34；标准&#34；&#34；过滤器&#34；[&#34；小写&#34；&#34；&#&#34;映射&#34；：{&#34；动态&#34；：&#34；严格&#34；&#34；属性&#34；：{&#34；品牌&#34；{&#34；类型&#34；：&#34；文本&#34；}\n要求字段由字段名显式定义，或作为动态字段定义，例如title-*。\n对于大多数查询，Solr和Elasticsearch之间有直接等价物，但通常具有不同的标签和查询结构；\n获取/搜索{&#34；查询&#34；{&#34；布尔&#34；{&#34；必须&#34；[{&#34；匹配&#34；{&#34；头衔&#34；：&&#34；搜索&#34；}，{&#34；匹配&#34；：{&#34；内容&#34；：&#34；弹性搜索&#34；}]&#34;过滤器&#34；：[{&#34；任期&#34；：{&#34；状态&#34；：&#34；出版&#34；}，{&#34；范围&#34；：{&#34；出版日期&#34；：{&#34；gte&#34；：&#34；2015-01-01&#34；}\n获取/搜索{&#34；#源&#34；：{&#34；包括&#34；：[&#34；名称&#34；&#34；id&#34；]&#34;查询&#34；：{&#34；术语&#34；：{&#34；用户&#34；：&#34；kimchy&#34；}\nElasticsearch支持将对象字段映射为嵌套数据类型。以这种方式映射的对象捕获结构化数据，可以单独查询，也可以作为字段集合查询。\n放置my-index-000001{&#34；映射&#34；{&#34；属性&#34；{&#34；用户&#34；{&#34；类型&#34；&#34；嵌套&#34；&#属性&#34；{&#34；第一&&&#34；#类型&&&#34；#&#34;最后&#34；：{&#34；类型&#34；：&#34；文本&#34；}&#34;第34组：{&#34；类型&#34；：&#34；关键字&#34；}}}\n把my-index-000001/#u doc/1{&#34；组&#34；&#34；粉丝&#34；&#34；用户&#34；[{&#34；第一&#34；&#34；约翰&&#34；&#34；&#最后&#34；&&#，{&#34；第一&#34；&#34；爱丽丝&#34；&#34；最后&#34；&#34；怀特&#34；}\n//匹配具有匹配//first或last of&#34的任何用户对象的文档；罗伯特&#34；获取my-index-000001/#u search{&#34；query&#34；{&#34；bool&#34；{&#34；must&#34；：[{&#34；match&#34；user.&&&#34；&&&#34；Robert&#34；}}匹配具有单个用户对象的文档，这些对象匹配//first of&#34；简&#34**和**第34项中的最后一项；史密斯和#34；获取my-index-000001/#u search{&#34；query&#34；{&#34；bool&#34；{&#34；must&#34；：[{&#34；match&#34；user.first&#34；&#Jane&#34；}，{&#34；匹配&#34；：{&#34；用户。最后&#34；：&#34；史密斯&#34；}}}\n我们向Elasticsearch的迁移解锁了一些向量搜索选项，通过将向量编码为二进制doc_值，可以将字段映射为密集和稀疏向量。值得注意的是，lucene（以及Elasticsearch和Solr）正在这一领域添加功能，包括Solr最近对HNSW向量搜索的支持。\n维护文档和API参考，以及活跃的在线社区。尽管我们非常感谢Solr和Zookeeper的Apache邮件列表，但拥有在线论坛是一种胜利。\n如果您想要一个非结构化搜索，可以将任何内容放入索引中，那么动态字段是很好的选择，但是如果您想要一个有保证字段的结构化搜索，那么必须在索引之前设置它。\nElasticsearch无法指定所有文档都需要一个给定的字段，或者一个给定的字段必须只有一个值，因为您需要一个带有故障处理器的摄取管道。\n这似乎是一件小事（而且可能是），但从Solr的角度来看。xml模式到Elasticsearch&#39；在JSON模板中，您必须为所有有见地的注释找到一个新的家，比如我们不想使用小写用户名的原因。\n另一件小事情，但来自Solr，在Solr中很容易获得一个图，并查看哪些节点在哪个碎片上以及它们的当前状态，Elasticsearch需要一种不同的思维方式来调试。例如，如果Elasticsearch集群为黄色，则必须在没有漂亮图片的情况下调试它。\n抽象的奇妙之处使infra超级容易设置，这使得确定哪些节点或实例出现故障变得更加困难。幸运的是，我们已经成功地用节点和索引的度量设置了仪表板，以便能够发现异常值。\n您可以将额外的文件（例如包含同义词的文件）上载到集合，并按id引用它们。但是，此id是在上载时设置的，不可更改或指定。\n这些是从我们的第一个搜索引擎迁移到Elasticsearch框架中吸取的经验教训。我们现在正在努力将我们规模更大、设置更完善的服务，以及它们整整7年的模式，转变为Elasticsearch！\n从最初的迁移开始，我们很高兴不需要设置一个带有仔细记录设置的动物园管理员。我们也感谢移民之旅教会我们的所有知识。\n围绕我们迁移的另一个大问题是Elasticsearch和OpenSearch产品的发展和差异。我们目前使用的是Elasticsearch 7.10，能够追踪任何一个流，并将继续关注他们各自的搜索功能和托管选项。\nBrandon Janson，Nic Laver，Yiwei Han，Stuart Cam：他在我们的搜索平台上工作，迁移关键的搜索组件。", "note_en": "After realizing that it took a literal team of engineers to keep our self managed Solr infrastructure up to date and working, we are moving to a managed search solution — Elasticsearch!\n More specifically, we are migrating to Elasticsearch, which is hosted and managed by  Amazon Web Services (AWS). Both search engines have a lot of similarities, but do require some translation of terminology, patterns and thinking.\n Over 2021, we have migrated one of our smaller search indexes fully to Elasticsearch and are currently in the process of using Elasticsearch for some new search domains. The journey so far has taught us a lot about the key differences between Solr and Elastic, as well as the nuances that people may not be aware of unless they go through a similar migration.\n We have put together this blog post to help others who are considering such an exercise.\n  We have been using Solr since 2014 at Canva when it was easily the most established option with the most active community. Now, in 2022, Elasticsearch is no longer the unexciting and somewhat unreliable new kid on the block, but has proven itself to be a reliable search engine with a strong developer community and support.\n   It is now easier to hire engineers with Elasticsearch experience, and harder to hire people familiar with Solr.\n  The following sections provide side by side comparisons of how we experienced Solr and Elasticsearch, what we like and struggle with from each, and the things we wish we knew about Elasticsearch before the migration. We hope it will benefit teams looking to do the same thing as we did.\n     A key difference in how we (as engineers) interact with the technologies is how the infrastructure is managed. Here are aspects to consider.\n        Must be managed separately to Solr. If you’re managing Solr, you must also manage  Zookeeper.\n     Autoscaling can add nodes to maintain minimum replication, but does not support balancing across AZs (AWS availability zones).\n The autoscaling does not balance replicas to prevent dangerous topologies. We observed several undesirable behaviours of the autoscaling.\n  Two nodes being assigned as replicas of the same shard resulting in a large load on the survivor if one crash, often also taking out the survivor.\n Adding multiple nodes as replicas to a single leader concurrently causing the leader to try and distribute its data to both new followers at once. This took down the leader occasionally.\n We have some self-managed scripts to ensure that replicas of a shard are in distinct nodes and across AZs, but this is not out of the box.\n  Shards are placed on nodes based on a replication value, defined on Index creation, or specified by an index template.\n    solrconfig.xml, which contains settings, such as custom default handers, zookeeper timeouts, and auto commit intervals.\n  You can create indexes using an  index template with default values for these settings, but changing the template does not change the configuration of live indexes. To change the configuration of a live index, you must apply settings or mappings directly to that index.\n  The way Elasticsearch handles the configuration of an index is a big change from Solr. Understanding what  index templates are and how they can be used helps translate the Solr configuration files to the Elasticsearch context.\n Index Templates contain the settings and the mappings that define an index. They specify an index pattern (such as  test-*) that is applied to all new indexes matching this pattern.\n Mappings define fields and the analyzers/tokenizers they should use. Mappings can also be labeled as  &#34;dynamic&#34;: &#34;strict&#34;, which requires you to explicitly add fields that are to be indexed to the mapping (like most fields in Solr); if a document to be indexed contains a field that is not defined in the mapping, it will fail to be indexed.\n  You can also create index templates using component templates. For example, different component templates might each define:\n  You could then create an index template using these three templates, applying their combined configuration to new indexes.\n  Elasticsearch and Solr have similar tokenizers and analyzers but define the schema differently and have their own indexing behaviours.\n  &lt;field name=&#34;brand&#34; type=&#34;simple_text&#34; indexed=&#34;true&#34; stored=&#34;false&#34; required=&#34;false&#34; multiValued=&#34;true&#34;/&gt; ... &lt;fieldType name=&#34;simple_text&#34; class=&#34;solr.TextField&#34;  positionIncrementGap=&#34;100&#34;&gt;  &lt;analyzer&gt;  &lt;tokenizer class=&#34;solr.WhitespaceTokenizerFactory&#34;/&gt;  &lt;filter class=&#34;solr.LowerCaseFilterFactory&#34;/&gt;  &lt;filter class=&#34;solr.ASCIIFoldingFilterFactory&#34;/&gt;  &lt;/analyzer&gt;  &lt;/fieldType&gt;\n  {  &#34;settings&#34;: {  &#34;simple_text&#34;: {  &#34;tokenizer&#34;: &#34;standard&#34;,  &#34;filter&#34;: [  &#34;lowercase&#34;,  &#34;asciifolding&#34;  ]  } ...  },  &#34;mappings&#34;: {  &#34;dynamic&#34;: &#34;strict&#34;,  &#34;properties&#34;: {  &#34;brand&#34;: {  &#34;type&#34;: &#34;text&#34;,  }  } ...  } }\n   Requires fields to be explicitly defined by a field name, or as a dynamic field, eg.  title-*.\n    For most queries, there are direct equivalents between Solr and Elasticsearch, but typically with different labels and query structure;\n                  GET /_search  {   &#34;query&#34;: {   &#34;bool&#34;: {   &#34;must&#34;: [   { &#34;match&#34;: { &#34;title&#34;: &#34;Search&#34;}},   { &#34;match&#34;: { &#34;content&#34;: &#34;Elasticsearch&#34; }}   ],   &#34;filter&#34;: [   { &#34;term&#34;: { &#34;status&#34;: &#34;published&#34; }},   { &#34;range&#34;: { &#34;publish_date&#34;: { &#34;gte&#34;: &#34;2015-01-01&#34;}}}   ]   }   }  }\n     GET /_search  {   &#34;_source&#34;: {   &#34;includes&#34;: [ &#34;name&#34;, &#34;id&#34; ]  },   &#34;query&#34; : {   &#34;term&#34; : { &#34;user&#34; : &#34;kimchy&#34; }   }  }\n    Elasticsearch supports mapping object fields as  nested data types. Objects mapped this way capture structured data, and can be queried both individually or as a collection of fields.\n  PUT my-index-000001 {  &#34;mappings&#34;: {  &#34;properties&#34;: {  &#34;user&#34;: {  &#34;type&#34;: &#34;nested&#34;,  &#34;properties&#34;: {  &#34;first&#34;: {  &#34;type&#34;: &#34;text&#34;  },  &#34;last&#34;: {  &#34;type&#34;: &#34;text&#34;  }  }   },  &#34;group&#34;: {  &#34;type&#34;: &#34;keyword&#34;  }  }  } }\n  PUT my-index-000001/_doc/1 {  &#34;group&#34; : &#34;fans&#34;,  &#34;user&#34; : [   {  &#34;first&#34; : &#34;John&#34;,  &#34;last&#34; : &#34;Smith&#34;  },  {  &#34;first&#34; : &#34;Alice&#34;,  &#34;last&#34; : &#34;White&#34;  }  ] }\n  // match documents that have any user objects that match  // first or last of &#34;Robert&#34; GET my-index-000001/_search {  &#34;query&#34;: {  &#34;bool&#34;: {  &#34;must&#34;: [  { &#34;match&#34;: { &#34;user.*&#34;: &#34;Robert&#34; }}  ]  }  } } // match documents that have individual user objects that match  // first of &#34;Jane&#34; **and** last of &#34;Smith&#34; GET my-index-000001/_search {  &#34;query&#34;: {  &#34;bool&#34;: {  &#34;must&#34;: [  { &#34;match&#34;: { &#34;user.first&#34;: &#34;Jane&#34; }},  { &#34;match&#34;: { &#34;user.last&#34;: &#34;Smith&#34; }}  ]  }  } }\n  Our migration to Elasticsearch unlocks some vector search options with the ability to map fields as dense and sparse vectors, by encoding vectors as binary doc_values. It is worth noting that  lucene (and hence both Elasticsearch and Solr) is adding features in this space, including  Solr’s recent support for HNSW Vector search.\n  Maintained docs and API references, as well as an active online community. As much as we appreciate the Apache mailing lists for Solr and Zookeeper, having online forums is a win.\n   Dynamic fields are great if you want an unstructured search that lets you put anything into an index, but if you instead want a structured search with guaranteed fields, you must set this up before indexing.\n Elasticsearch doesn’t have a way to specify that all documents require a given field, or that a given field must have only one value, for that you would need an ingest pipeline with a fail processor.\n  This seems like a small thing (and it probably is) but when going from Solr’s  .xml schema to Elasticsearch&#39;s JSON templates, you must find a new home for all your insightful annotations, such as reasons why we don’t want to lowercase  username.\n  Another small thing, but coming from Solr, where it easy to get a graph and see which nodes are on which shard and their current status, Elasticsearch requires a different way of thinking to debug. If an Elasticsearch cluster is yellow, for example, you must debug this without the pretty picture.\n The wonder of abstraction that makes the infra super easy to set up makes it  harder to work out which node or instances are failing. We, fortunately, have had success in setting up dashboard with metrics by node and by index so that outliers can be spotted.\n  You can upload extra files, such as those that contain synonyms, to a collection and reference them by  id. This  id, however, is set on upload and isn’t mutable, or specifiable.\n  These are the lessons learnt from migrating the first of our search engines to the Elasticsearch framework. We are now tackling bringing our larger and more set up services, with their full 7 years of patterns, over to Elasticsearch!\n From our initial migrations, we’re excited to not need to set up a zookeeper with careful logging settings. We also appreciate all the learnings that our migration journey has taught us.\n The remaining big question surrounding our migration is the development and divergence of offerings from Elasticsearch and OpenSearch. We are currently on  Elasticsearch 7.10, with the ability to pursue either stream, and will continue to watch their respective offerings carefully with respect to search features and managed options with interest.\n   Brandon Janson,  Nic Laver,  Yiwei Han,  Stuart Cam: who worked on our search platform, migrating key search components.", "posttime": "2022-02-15 16:52:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "迁移,solr", "title": "从Solr迁移到Elasticsearch及其差异", "title_en": "Migrating from Solr to Elasticsearch, and their differences", "transed": 1, "url": "https://canvatechblog.com/migrating-from-solr-to-elasticsearch-and-their-differences-c08863268c68?gi=355f870d2f0a", "via": "", "real_tags": ["迁移", "solr"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个拥有如此多专有设备和单功能机器的市场上，手头有树莓Pi这样的多功能设备可能会有很大帮助。没有人比加里·克罗夫特更清楚这一点，他正在用树莓皮4和树莓皮HQ相机从他的三眼显微镜中捕捉令人印象深刻的画面。克罗夫特说，现成的相机非常昂贵，但事实证明，覆盆子皮HQ相机是一种更实惠、更具可比性的替代品。\n加里·克罗夫特现在专攻计算机科学，但对生物学一直有着浓厚的兴趣。克罗夫特解释说，他对微生物学的探索始于孩提时代，当时他祖父送给他一台旧显微镜。如今，克罗夫特拥有一种功能更强的三目显微镜，不仅可以查看标本，还可以记录标本。\n在这个项目中，克罗夫特使用树莓皮4处理来自HQ摄像头模块的输入，该模块通过C支架连接到显微镜。Pi 4正在运行一个GUI界面来控制摄像头，并将视频文件转换为更兼容的格式。mp4格式。这是由树莓皮4提供的额外能量实现的。\n克罗夫特计算出相机总投资约为115美元（85英镑），不考虑Pi或三目显微镜的成本。最终，他定制的相机设备以每秒30帧的速度生成高质量的图像和高清视频。现成的替代品起价约为350英镑（470美元），仅提供约10 fps。\n本项目中使用的代码是用Python编写的，是供用户探索的开源代码。克罗夫特和#39；s的解决方案是使用Python和tKinter GUI框架构建的。克罗夫特创建了一个由五个按钮组成的简单用户界面，可以控制相机的开/关、拍照和开始/停止录制。\n如果你想更深入地了解这个Raspberry Pi项目，请访问Croft的GitHub页面，留意未来的更新。克罗夫特表示，计划为ISO设置、延时功能和帧速率调整等添加GUI控件。克罗夫特也在考虑增加一个流媒体选项，以便视频通话中分享视频片段。与此同时，你可以在YouTube上查看他的官方频道，看看他的一些很酷的微观发现。", "note_en": "In a market with so many proprietary devices and one-function machines, it can be a big help to have something versatile like a   Raspberry Pi on hand. No one knows that better than  Gary Croft who’s using a  Raspberry Pi 4 with a   Raspberry Pi HQ Camera to capture impressive footage from his trinocular microscope. According to Croft, off-the-shelf cameras are notably expensive but the Raspberry Pi HQ Camera has proved to be a more affordable and comparable alternative.\n  Gary Croft specializes in computer science these days but has always had an affinity for biology. Croft explains, his foray into microbiology began as a child with an old microscope gifted to him as a child from his grandfather. Today, Croft has a more capable trinocular microscope designed to not only view specimens but also record them.\n   In this project, Croft is using a Raspberry Pi 4 to process input from the HQ camera module which is connected to the microscope via the C mount. The Pi 4 is running a GUI interface to control the camera as well as convert the video files to a more compatible .mp4 format. Something enabled by the extra power provided by the Raspberry Pi 4.\n   Croft calculates the total camera investment at around $115 (£85) without factoring in the cost of the Pi or the trinocular microscope. In the end, his custom camera rig produces high-quality images and HD video at 30 fps. Off the shelf alternatives start at around £350 ($470) and only provide approximately 10 fps.\n  The code used in this project is written in Python and is open source for users to explore. Croft&#39;s solution was built using Python and the tKinter GUI framework. Croft created a simple user interface of five buttons which handle turning the camera on / off, take picture and start / stop recording.\n  If you want to get a closer look at this  Raspberry Pi project, head over to Croft’s  GitHub page and keep an eye out for future updates. Croft indicated plans for additional GUI controls for things like ISO settings, time-lapse features and frame rate adjustment. Croft is also looking into adding a streaming option so that the footage can be shared in video calls. In the meantime, you can check out his official channel on  YouTube to see some of his cool microscopic findings.", "posttime": "2022-02-15 16:42:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,hq,pi", "title": "Raspberry Pi以115美元的价格通过HQ摄像头捕捉到微观奇观", "title_en": "Raspberry Pi Captures Microscopic Wonders with HQ Camera for $115", "transed": 1, "url": "https://www.tomshardware.com/news/raspberry-pi-hq-camera-microscope-project", "via": "", "real_tags": ["hq", "pi"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073475, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国证券交易委员会（Securities and Exchange Commission）今天指控BlockFi Lending LLC（BlockFi）未能登记其零售加密借贷产品的报价和销售。在这一首次同类诉讼中，SEC还指控BlockFi违反了1940年《投资公司法》的注册规定。为了解决SEC的指控，BlockFi同意支付5000万美元的罚款，停止其未注册的贷款产品BlockFi利息账户（BIAs）的要约和销售，并试图在60天内使其业务符合《投资公司法》的规定。BlockFi的母公司还宣布，它打算根据1933年的《证券法》注册一种新贷款产品的发行和销售。在今天宣布的平行行动中，BlockFi同意向32个州额外支付5000万美元的罚款，以解决类似指控。\n&#34;这是第一个涉及加密借贷平台的此类案例；SEC主席加里·根斯勒说&#34;今天的和解表明，加密市场必须遵守久经考验的证券法，如1933年的《证券法》和1940年的《投资公司法》。这进一步表明，委员会愿意与加密平台合作，以确定它们如何遵守这些法律。我要感谢并赞扬我们出色的SEC工作人员和州监管机构在这项和解协议上的努力与合作&#34;\n&#34;提供BlockFi’s BIAs等证券的加密借贷平台应立即注意今天的决议，并遵守联邦证券法和#34；美国证券交易委员会执法部门负责人格比尔·S·格雷瓦尔说&#34;遵守我们的注册和披露要求对于为投资者提供在加密资产领域做出明智投资决策所需的信息和透明度至关重要&#34;\n根据SEC的命令，从2019年3月4日到今天，BlockFi向公众提供并出售了偏见。通过偏见，投资者将加密资产借给BlockFi，以换取该公司承诺每月支付可变利息。该命令认定，BIAs是适用法律下的证券，因此，该公司被要求登记其BIAs的要约和销售，但未能登记或有资格获得SEC登记豁免。此外，该命令还发现，BlockFi作为一家未注册的投资公司运营了18个月以上，因为它发行了证券，还持有投资证券（不包括现金）总资产的40%以上，包括向机构借款人提供的加密资产贷款。\n该命令还发现，BlockFi在其网站上就其贷款组合和贷款活动的风险水平发表了虚假和误导性声明，持续两年多。\n在不承认或否认SEC调查结果的情况下，BlockFi同意了一项停止令，禁止其违反《证券法》的注册和反欺诈规定以及《投资公司法》的注册规定。BlockFi还同意停止在美国提供或销售BIAs。\nSEC的调查由格温·利卡多（Gwen Licardo）、克雷格·韦尔特（Craig Welter）和肯尼斯·戈特利布（Kenneth Gottlieb）在布伦特·W·威尔纳（Brent W.Wilner）的协助下进行，由零售战略工作组组长哈恩·L·金（Hane L.Kim）监督；美国证券交易委员会纽约地区办事处副区域主任劳拉·沙洛夫·梅拉班；还有网络部门负责人克里斯蒂娜·利特曼。SEC感谢作为北美证券管理者协会成员的州监管机构的协助。\n美国证券交易委员会（SEC）投资者教育与倡导办公室（Office of Investor Education and Advocation and Enforcement）的零售战略工作组（Retail Strategy Task Force）发布了一份关于加密资产计息账户的投资者公告。投资者可以在Investor上找到有关加密资产的更多信息。州长。", "note_en": "The Securities and Exchange Commission today charged BlockFi Lending LLC (BlockFi) with failing to register the offers and sales of its retail crypto lending product. In this first-of-its-kind action, the SEC also charged BlockFi with violating the registration provisions of the Investment Company Act of 1940. To settle the SEC’s charges, BlockFi agreed to pay a $50 million penalty, cease its unregistered offers and sales of the lending product, BlockFi Interest Accounts (BIAs), and attempt to bring its business within the provisions of the Investment Company Act within 60 days. BlockFi’s parent company also announced that it intends to register under the Securities Act of 1933 the offer and sale of a new lending product. In parallel actions announced today, BlockFi agreed to pay an additional $50 million in fines to 32 states to settle similar charges.\n &#34;This is the first case of its kind with respect to crypto lending platforms,&#34; SEC Chair Gary Gensler said. &#34;Today’s settlement makes clear that crypto markets must comply with time-tested securities laws, such as the Securities Act of 1933 and the Investment Company Act of 1940. It further demonstrates the Commission’s willingness to work with crypto platforms to determine how they can come into compliance with those laws. I’d like to thank and commend our remarkable SEC staff and state regulators for their efforts and collaboration on this settlement.&#34;\n &#34;Crypto lending platforms offering securities like BlockFi’s BIAs should take immediate notice of today’s resolution and come into compliance with the federal securities laws,&#34; said Gurbir S. Grewal, Director of the SEC’s Division of Enforcement. &#34;Adherence to our registration and disclosure requirements is critical to providing investors with the information and transparency they need to make well-informed investment decisions in the crypto asset space.&#34;\n According to the SEC’s order, from March 4, 2019 until today, BlockFi offered and sold BIAs to the public. Through BIAs, investors lent crypto assets to BlockFi in exchange for the company’s promise to provide a variable monthly interest payment. The order finds that BIAs are securities under applicable law, and the company therefore was required to register its offers and sales of BIAs but failed to do so or to qualify for an exemption from SEC registration. Additionally, the order finds that BlockFi operated for more than 18 months as an unregistered investment company because it issued securities and also held more than 40 percent of its total assets, excluding cash, in investment securities, including loans of crypto assets to institutional borrowers.\n The order also finds that BlockFi made a false and misleading statement for more than two years on its website concerning the level of risk in its loan portfolio and lending activity.\n Without admitting or denying the SEC’s findings, BlockFi agreed to a cease-and-desist order prohibiting it from violating the registration and antifraud provisions of the Securities Act and the registration provisions of the Investment Company Act. BlockFi also agreed to cease offering or selling BIAs in the United States.\n The SEC’s investigation was conducted by Gwen Licardo, Craig Welter, and Kenneth Gottlieb, with assistance from Brent W. Wilner, under the supervision of Hane L. Kim, Chief of the Retail Strategy Task Force; Lara Shalov Mehraban, Associate Regional Director of the SEC’s New York Regional Office; and Kristina Littman, Chief of the Cyber Unit. The SEC appreciates the assistance of state regulators that are members of the North American Securities Administrators Association.\n The SEC’s Office of Investor Education and Advocacy and Enforcement’s Retail Strategy Task Force has issued an  Investor Bulletin on Crypto Asset Interest-bearing Accounts. Investors can find additional information about crypto assets at Investor.gov.", "posttime": "2022-02-15 16:40:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "agrees,blockfi", "title": "Blockfi同意支付1亿美元罚款并进行注册", "title_en": "Blockfi agrees to pay $100M in penalties and pursue registration", "transed": 1, "url": "https://www.sec.gov/news/press-release/2022-26", "via": "", "real_tags": ["agrees", "blockfi"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎来到我的个人网站和博客，在这里你可以找到一些关于我的信息、联系方式、社交媒体链接以及我的博客帖子", "note_en": "Welcome to my personal website and blog, here you can find some information about me, contact, social media links as well as    my blog posts", "posttime": "2022-02-15 16:39:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,博客", "title": "Python增强计划即将为您带来的Python特性", "title_en": "Upcoming Python features brought to you by Python Enhancement Proposals", "transed": 1, "url": "https://martinheinz.dev/blog/67", "via": "", "real_tags": ["python", "博客"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个博客中，我将介绍我的自动音乐创作方法，包括理论、算法和Python包实现ch0p1n。\n举一个简单的例子，想象你把一只猫放在钢琴上，随机按下键来产生音乐。因此，音乐是预先确定的算法的结果，而不是你瞬间的情绪或作曲技巧的结果。这就是为什么它被称为自动合成。\n自动作文有许多不同的方法或范例。1我采取的方法受到了阿诺德·勋伯格、海因里希·申克和威廉·卡普林理论的启发。关键的想法是，在一些常见的操作下，音乐可以从有限的材料中发展或产生。我将在以下三个部分中解释我的方法的理论基础。\n让我们来看一个例子，贝多芬第一首钢琴奏鸣曲的开头：\n事实上，蓝色框架中的结构可以仅通过转置红色框架中的结构来生成。因此，为了创作这篇文章，我只需要在红色框架中创建结构，然后重用或稍微修改它以生成蓝色框架中的结构，而不是从头开始创建两个结构。\n同样的情况也发生在其他地方。如下所示，四个框架结构也非常相似：\n这种重复使用是否只存在于贝多芬的音乐中？不，这可能发生在每一部音乐作品中。无论一部音乐作品持续多长时间，或者它的声音有多变化多端，其核心材料的数量总是很少的。\n然而，有时候，一种材料可以被修改得太多以至于你几乎认不出来，比如在下面的例子中，肖邦的夜曲作品9第一首的开头：\n这两个框架结构看起来和听起来都非常不同，但在我的方法中，蓝色框架中的结构仍然可以通过在红色框架中详细阐述结构来生成，而不是它们完全不相关。这是因为这两个结构有一些共同的形态特征，它们具有相同的背景和声级数，并且从音乐形式的角度来看，蓝色框架中的结构确实是红色框架中结构的重复。2.\n请注意，在声明一个结构可以由其他结构生成时，我并没有断言贝多芬或肖邦在作曲时确实这样做或故意这样做。相反，我的观点是，我们可以使用这种音乐生成的视角来正式化或自动化音乐创作的过程。\n一旦创建了一个结构，就可以对其应用一些常见的操作来生成新的结构。我将在下面讨论一些操作。\n我要讲的第一个操作是重复。它意味着在不改变形态的情况下，以新的和谐方式重复一个结构。\n蓝色框架中的结构是红色框架中结构的换位。这两种结构具有相同的形态，尽管它们适应不同的背景和声。\n肖邦的夜曲是另一个例子。蓝色框架中的伴奏主题与红色框架中的主题重复：\n在重复中，根据一些语音引导规则，一些音调会移动到最近的音调以适应新的和声。3其中一些变化如下所示：\n下一个操作是精化。这意味着向结构中添加传递注释、相邻注释和其他类型的注释。肖邦的夜曲就是一个例子，在重复中加入了许多元组：\n有时，详细描述更多地是从分数中推断出来的，而不是表现在分数中。海因里希·申克（Heinrich Schenker）的理论区分了音乐的表层结构和深层结构，表层结构是深层结构细化的结果，如下例所示：\n例如，在上面的分数中，b部分可以通过阐述c部分生成。\n精化的相反操作是简化。例如，在上述分数中，b部分可以减少为c部分。\n我要说的最后一个操作是碎片化。这意味着从材料中取出一块碎片。\n正如贝多芬的奏鸣曲一样，蓝色框架中的结构是红色框架中的一个片段：\n可以修改红色框架中的片段以生成橙色框架中的结构；蓝色框架中的片段可以修改以生成绿色框架中的结构。这两块碎片取自紫色框架中的结构。\n有更多的操作可以应用到音乐材料上，但我就到此为止。我所介绍的四个操作对于本博客来说已经足够了。\n根据音乐形式，创建和生成的结构可以组合成更大的结构。音乐形式是音乐材料组织的一种方式。\n例如，贝多芬奏鸣曲的开头有形式句。下面是威廉·卡普林的系统是如何分析这句话的：2\n肖邦夜曲的开始是从一个更大的结构形式复合时期，这是远比句子复杂。\n我不会在这里深入讨论音乐形式的问题。我强烈推荐威廉·卡普林关于这个话题的优秀教材2。我的重点是，音乐材料应该根据音乐形式进行组合，以产生有意义的音乐。\n我们首先需要严格定义音乐材料和结构，我们一直在模糊地谈论这些。\n让我们回到贝多芬的奏鸣曲。下面是它的前两个栏：\n这首曲子有两种声音或乐句。每一段音乐都由音符、休止符或和弦组成，而和弦也由音符组成。音符有几个属性，这里只考虑音高和持续时间。我们将分别处理音符的音高和持续时间内容，而不是将音符表示为单个对象。\n音高可以用科学的音高符号或MIDI音符数字来表示。为了便于操作，通常使用后者。例如，音高C4由MIDI音符编号60表示。\n在Python中，和弦的音高内容可以用列表表示。例如，在Python中，我们可以使用[&#39；C4&#39；，&#39；A-3&#39；，&#39；F3&#39；]或[60,56,53]代表红色框架中和弦的音高内容：\n持续时间可以用数字表示。例如，季度票据的持续时间为1。\n一条音乐线的音高内容可以用我所说的音高线来表示。在Python中，音高线是一个列表，其成员为无、数字或数字列表。使用Python包类型，节线可以定义为：\n一条音乐线的持续时间内容可以用持续时间线来表示。在Python中，持续时间行是成员为数字的列表。\n最后，和声和音阶可以用音高等级列表来表示。例如，在Python中，C大调和声可以用[&#39；C&#39；，&#39；E&#39；，&#39；G&#39；]来表示或者[0,4,7]。\n你可能经常听到这个词。母题在结构上是一条音乐线，通常长度较短。主题是音乐的基石。它们可以被重复、细化、分割和组合，从而产生音乐。\n例如，以下是勋伯格如何分析贝多芬奏鸣曲的开头：5\n在他的分析中，这首曲子的旋律部分只能由三个主题生成。\n有不同种类的图案。例如，以下乐谱中有两种主题：\n红色框架中的图案可以称为伴奏图案，因为它们出现在这首夜曲的伴奏行中。它们也可以被称为和声母题，因为它们只包含和声音符。蓝色框架中的主题可以称为旋律主题，因为它们出现在旋律线中，或者如果它们包含非和声音符，则称为非和声主题。\n在接下来的几节中，我将讨论可应用于Motif的常见操作的实现。\n我的Python包ch0p1n中的函数transpose（）用于沿比例变换图案。\n音高主题=[60,67,76,72]#[#39；C4&#39；&#39；G4&#39；&#39；E5&#39；&#39；C5&#39；]持续时间主题=[1,1,1,1]\n我们可以用show（）在score中显示这个主题，它构建在Python包music21上：\n来自ch0p1n。utils import show（音高线=[pitch_motif]、音长线=[duration_motif]、组=1、#高音杆键中的声音数=0、米=和#39；4/4和#39；、谱号=[和#39；g和#39；，&#39；f和#39；]））\n来自ch0p1n。motif import transpose pitch_motif_transposed=transpose（pitch_motif=pitch_motif，scale=[0,2,4,5,7,9,11]，step=1）\n显示（音高线=[pitch_motif_transposed]，duration_lines=[duration_motif]，group=1，#高音杆键中的声音数=0，meter=&#39；4/4&#39；，谱号=[&#39；g&#39；，&#39；f&#39；]））\n看起来不错。每一个音高都在C大调音阶上上升了一步。\n由于和声是一种特殊的音阶，我们可以使用转置（）在和声中重复主题，比如G大调和声：\n音高调换=调换（音高调换=音高调换，音阶=[7,11,2]，#G大调和声阶=1）\n表演（音高线条=[音高主题+音高主题转置]，音长线条=[音长主题*2]，组=1，键=0，节拍=&#39；4/4&#39；，谱号=[&#39；g&#39；，&#39；f&#39；]））\n最初的主题在第一栏，第二栏转置。你可以看到G大调和声中的每个音高是如何上升一步的。\n然而，在某些情况下，transpose（）并不好用。仍然在上面的例子中，假设我们用step=-1将motif向下转一步，而不是向上转一步：\n第二小节中的转置主题是不可接受的，因为它没有音高等级G来完全具体化G大调和声。\n我们可以通过ch0p1n中的函数lead（）来改善这种情况。这个函数的名字来源于声音引导的概念，意思是一个主题中的每个音符都一步一步地引导到一个给定和声中的音符。\n来自ch0p1n。motif import lead pitch_motif=lead（pitch_motif=pitch_motif，harmony=[7,11,2]，35;G大调和声步数=[-1,0]，complete=False，Simular=None）\n步数=[-1，0]意味着每个音高如果符合和声，将移动零步，同时向下移动一步。换句话说，每个音高可能会在lead（）下的给定和声中生成多个音高，因此返回的结果是音高主题列表，而不是单个。稍后我将讨论完整参数和类似参数。\n#合并itertools导入链展示中的'pitch_Motions'（pitch_lines=[列表（链（*pitch_Motions））]，duration_lines=[duration_motif*2]，group=1，key=0，meter=&39；4/4&#39; ,  谱号=[&#39；g&#39；，&#39；f&#39；]）\n虽然第一小节中的主题与转置（）产生的不可接受的主题相同，步骤=-1，但第二小节中的主题是好的，这充分体现了G大调和声。\n使用complete=True，我们可以筛选出不和谐完整或不完全具体化给定和谐的音高主题：\n音高母题=引导（音高母题=音高母题，和声=[7,11,2]，步数=[1,0]，完整=正确，相似=无）\n在参数相似的情况下，我们可以筛选出与原始基调轮廓不同的基调图案。在这篇介绍性博客中，我将跳过这一部分。\n函数thread（）用于在连续的和声中重复一个主题，或在和声中穿插一个主题。让我们尝试一下前面定义的主题：\n来自ch0p1n。motif import thread pitch_motif=thread（pitch_motif=pitch_motif，duration_motif=duration_motif，和声=[5,9,0]，[7,11,2]，#F，G durations=[2,2]，steps=[1]）show（pitch lines=pitch_motif，duration_lines=[duration_motif]组=1，键=0，米=39；2/4&#39; ,  谱号=[&#39；g&#39；，&#39；f&#39；]）\n主题的前两个音符改编为F大调和声，而最后两个音符改编为G大调和声。\n到目前为止，我只讨论了和声主题。为了处理非谐波图案，这是更复杂的，我们首先需要考虑如何精心制作图案。\n简单地说，精化就是给主题添加注释。ch0p1n中的函数deployate（）正好用于此目的。\n来自ch0p1n。motif import deployate motif=deployate（音高=pitch_motif，持续时间=duration_motif，参考=2，步数=1，-1]，音阶=0,2,4,5,7,9,11]，位置=39；左&#39；）\n表演（音高线=[pitch_motif+motif[0]]，持续时间线=[duration_motif+motif[1]]，组=1，键=0，音阶=&#39；4/4&#39；，谱号=[&#39；g&#39；，&#39；f&#39；]））\n参数引用指示在何处添加注释或阐述主题。例如，reference=2表示在第三个注释处添加注释。我们可以详细说明最后一点：\nmotif=精心设计（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=3，#最后一个音符步数=[-1，-1]，音阶=[0,2,4,5,7,9,11]，位置=&#39；左&#39；）\n参数步骤指定要添加的音符的音高。例如，steps=[-1，-1]表示参考注释应向下移动一步以生成第一个注释，然后此注释应向下移动一步以生成第二个注释。让我们用这个参数添加三个降序注释：\nmotif=精致（音高#音高#音高#音高#音高#音高#音长#音高#音高#音长#音高#音高#音高#音高#音长#音高#音长#音高#音高#音高\n通过这些步骤，您还可以重复一些注释或为主题添加休息，如以下示例所示：\nmotif=精心设计（音高_motif=音高_motif，持续时间_motif=持续时间_motif，参考=2，步骤=[0,0，无]#重复两次音符，然后添加休息）\n参数比例指定移动参考注释以生成要添加的注释的比例。例如，scale=[0,2,4,5,7,9,11]表示它是C大调音阶。我们可以用C色阶来代替：\nmotif=精细（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=2，步骤=[-1，-1]，音阶=列表（范围（12）），#C色阶位置=&#39；左&#39；）\n参数位置指定添加注释相对于参考注释的位置。例如，position=&#39；左&#39；指示将注释添加到参考注释的左侧。我们可以在右边添加注释：\nmotif=精心设计（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=2，步数=[-1，-1]，音阶=[0,2,4,5,7,9,11]，位置=&#39；右侧&#39；#在右侧添加注释）\n请注意，带有&#39；左&#39；和&#39；对&#39；，添加的注释采用参考注释的持续时间。如果你想从参考注释之前或之后的注释中提取持续时间，请使用&#39；前&#39；或&#39；接下来&#39；。例如\nmotif=精心设计（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=2，步数=[-1，-1]，音阶=[0,2,4,5,7,9,11]，位置=&#39；上一个&#39；#从上一个音符中选取持续时间）\n参数比率指定添加的笔记持续时间的百分比。例如，比率=1/2意味着添加的注释占参考注释持续时间的50%：\nmotif=精心设计（音高#motif=音高#motif，持续时间#motif=持续时间#motif，参考=2，步骤=[-1，-1]，音阶=[0,2,4,5,7,9,11]，位置=&#39；左&#39；，比率=1/2#占参考音符持续时间的50%）\n精简与精化相反。这是从一个主题中删除注释。ch0p1n的相应函数是reduce（）。\n来自ch0p1n。motif import reduce motif=reduce（音高motif=motif[0]，持续时间motif=motif[1]，开始=2，结束=3，位置=&#39；右&#39；）\n参数start和end指定要删除的注释。参数位置指定要向其添加已删除注释的持续时间的参考注释。\n背景和声为Fm，圆圈音符不符合和声，因此为非和声。\n音高主题=[65,68,72,77,80,79,77,76,77，无]持续时间主题=[1,1,1,1,1.5,1/6,1/6,1/6,1,1]\n音高主题，持续时间主题=减少（音高主题，持续时间主题，开始=5，结束=7，位置=&#39；左&#39；）#以下显示相同（[pitch_motif]，[duration_motif]，key=-4）\n音高主题，持续时间主题=精心设计（音高主题，持续时间主题，参考=4，步数=[-1，-1，-1]，音阶=[5,7,8,10,0,1,4]，位置=&#39；右&#39；，比率=1/4）\n碎片化是将一个主题分解成几个较短的主题，或从一个主题中提取一个片段。ch0p1n中相应的函数是divide（）和fragment（）。\n音高主题=[82,84,85,81,82,78]+[77]*4+[78,77,75,72,73,70]持续时间主题=[0.5]*6+[1]*4+[0.5]*4+[2,1]\n使用divide（），我们可以将这个图案分成三个长度相等的较短图案：\n&gt&gt&gt；主题[（[82,84,85,81,82,78,77]，[0.5,0.5,0.5,0.5,0.5,1]），（[77,77,77,78,77]，[1,1,1,0.5,0.5]，[75,72,73,70]，[0.5,0.5,2,1]）]\n来自ch0p1n。motif import fragment motif=fragment（音高、持续时间、开始=6、结束=9、比率=1/2、适合度=&#39；右&#39；）显示（[motif[0]，[motif[1]，[key=-5，meter=&#39；6/4&#39；）\n参数start和end指定片段的开始注释和结束注释。比率=1/2表示片段的长度应该是原始图案的50%，为了实现这一点，fit=&#39；右&#39；表示尾音应该延长。\n现在是时候把这一切放在一起了。首先，我们试着用少量的材料，在我们已经讨论过的操作下，生成贝多芬奏鸣曲的开头。\n为了简化问题并使模式更加清晰，我将从原始乐谱中删除含糊、发音、动态、优雅音符和其他一些音符：\n这首曲子由两个声部或乐谱组成，高音管中的旋律线和低音管中的伴奏线。\n总之，要创作贝多芬奏鸣曲的开头，核心材料是\n旋律音高主题=[65,68,72,77,80,77]旋律音长主题=[1,1,1,1,2,2]\n#Fm，C7，Fm，C7，Fm，Gdim，C7和声=[[5,8,0]，[0,4,7,10]，[5,8,7,10]，[5,8,0]，[7,10,1]，[0,4,7,10]#F谐波小调音阶=[5,7,8,10,0,1,4]\ndef生成贝多芬奏鸣曲（旋律、音高、旋律、音长、伴奏、伴奏、音高、和声、，\n......", "note_en": "In this blog, I will introduce my approach to automatic musical composition, including the theory, the algorithm, and a Python package implementation  ch0p1n.\n   As a trivial example, imagine that you put a cat on a piano to randomly press keys to generate music. The music is thus the result of a predetermined algorithm rather than of your instantaneous emotions or compositional skills. This is why it is called  automatic composition.\n Automatic composition has many different approaches or paradigms.  1 The approach I take is inspired by the theories of Arnold Schoenberg, Heinrich Schenker and William Caplin. The key idea is that  music can develop or be generated from limited materials under some common operations. I will explain the theoretical foundation of my approach in the following three sections.\n  Let’s see an example, the beginning of Beethoven’s first piano sonata:\n       In fact, the structure in the blue frame can be generated by merely transposing the structure in the red one. Therefore, to compose this piece, I need only to create the structure in the red frame, then reuse or slightly modify it to generate the structure in the blue frame, rather than create both structures from scratch.\n The same situation happens in other parts too. As indicated below, the four framed structures are also highly similar:\n  Does this kind of reuse exist only in Beethoven’s music? No, this probably happens in every musical work.  No matter how long a musical work lasts or how varied it can sound, the amount of its core materials is always small.\n   Sometimes, however, a material can be modified so much that you can barely recognize it, as in the following example, the beginning of Chopin’s nocturne Op.9 No.1:\n     The two framed structures look and sound quite different, but, in my approach, it is still that the structure in the blue frame can be generated by elaborating the structure in the red one, rather than that they are totally unrelated. It is so because the two structures have some morphological characteristics in common, they have the same background harmonic progression, and from the perspective of musical form, the structure in the blue frame is indeed a repetition of the structure in the red one.  2\n Please note that, in stating that a structure can be generated from other structure, I do not assert that Beethoven or Chopin actually did this or deliberately did this when composing music. Rather, my point is that we can use this music generation perspective to formalize or automate the process of musical composition.\n  Once a structure is created, some common operations can be applied to them to generate new structures. I will talk about some operations below.\n The first operation I will talk about is  repetition. It means repeating a structure in a new harmony without changing its morphology.\n   The structure in the blue frame is a  transposition of the structure in the red one. The two structures have the same morphology, although they are adapted to different background harmonies.\n The Chopin’s nocturne is another example. The accompaniment motif in the blue frame is a repetition of the one in the red frame:\n  In the repetition, some pitches move to their nearest pitches to fit the new harmony, according to some  voice-leading rules.  3 Some of these changes are indicated below:\n     The next operation is  elaboration. It means adding passing notes, neighbor notes, and other types of notes to a structure. The Chopin’s nocturne is an example, in which a lot of tuplets are added in the repetition:\n  Sometimes, elaborations are rather inferred from than showed in scores. Heinrich Schenker’s theory differentiates music’s superficial structure from its deep structure(s), and the superficial structure is the outcome of elaboration of a deep structure, as showed in the following example:  4\n  In the above score, for example, piece b can be generated by elaborating piece c.\n The opposite operation of elaboration is  reduction. For example, in the above score, piece b can be reduced to piece c.\n The last operation I will talk about is  fragmentation. It means taking a fragment from a material.\n As in the Beethoven’s sonata, the structure in the blue frame is a fragment from the structure in the red one:\n       The fragment in the red frame can be modified to generate the structure in the orange frame; the fragment in the blue frame can be modified to generate the structures in the green frames. The two fragments are taken from the structure in the purple frame.\n There are more operations can be applied to musical materials, but I will stop here. The four operations I have introduced are enough for the purpose of this blog.\n  Created and generated structures can be combined into larger structures, according to musical forms. A  musical form is a way in which musical materials should be organized.\n For example, the beginning of the Beethoven’s sonata has the form  sentence. Below is how this sentence is analyzed in William Caplin’s system:  2\n  The beginning of the Chopin’s nocturne is from a larger structure of the form  compound period, which is far more complex than sentence.\n I will not go deep into the subject of musical forms here. I highly recommend William Caplin’s excellent textbook  2 on this topic. My key point is that musical materials should be combined according to musical forms to generate meaningful music.\n      We first need to strictly define musical  materials and  structures, which we have been talking about quite vaguely.\n Let’s return to the Beethoven’s sonata. Below is its first two bars:\n  This piece of music has two voices or musical lines. Each musical line consists of notes, rests or chords which consist of notes too. A note has several attributes, among which only pitch and duration will be considered here. Rather than represent notes as single objects, we will handle their pitch and durational contents separately.\n Pitches can be represented by  scientific pitch notations or  MIDI note numbers. Mostly, the latter are used, for ease of operation. For example, pitch C4 is represented by MIDI note number 60.\n  The pitch contents of a  chord can be represented by list in Python. For example, in Python we can use  [&#39;C4&#39;, &#39;A-3&#39;, &#39;F3&#39;] or  [60, 56, 53] to represent the pitch contents of the chord in the red frame:\n  Durations can be represented by numbers. For example, quarter note’s duration is 1.\n The pitch contents of a  musical line can be represented by what I call  pitch line. In Python, a pitch line is a list whose members are  None, numbers or lists of numbers. With Python package  typing, pitch line can be defined as:\n  The durational contents of a musical line can be represented by  duration line. In Python, a duration line is a list whose members are numbers.\n Finally,  harmonies and  scales can be represented by lists of  pitch classes. For example, in Python C major harmony can be represented by  [&#39;C&#39;, &#39;E&#39;, &#39;G&#39;] or  [0, 4, 7].\n  You may have heard this term a lot. A  motif is structurally a musical line, usually short in length. Motifs are the building blocks of music. They can be repeated, elaborated, fragmented and combined to generate music.\n For example, the following is how Schoenberg analysed the beginning of the Beethoven’s sonata:  5\n  In his analysis, the melody part of this piece can be generated from only three motifs.\n There are different kinds of motifs. For example, two kinds of motifs are framed in the following score:\n  The motifs in the red frames can be called  accompaniment motifs as they appear in the accompaniment line of this nocturne. They can also be called  harmonic motifs as they consist of only harmonic notes. The motifs in the blue frames can be called  melodic motifs as they appear in the melody line, or  non-harmonic motifs if they contain non-harmonic notes.\n In the following several sections, I will talk about the implementation of the common operations that can be applied to motifs.\n  The function  transpose() from my Python package  ch0p1n is for transposing a motif along a scale.\n  pitch_motif  =  [ 60 ,  67 ,  76 ,  72 ] # [&#39;C4&#39;, &#39;G4&#39;, &#39;E5&#39;, &#39;C5&#39;] duration_motif  =  [ 1 ,  1 ,  1 ,  1 ]\n  We can show this motif in score with  show(), which is built on Python package  music21:\n from  ch0p1n.utils  import  show show (  pitch_lines  =  [ pitch_motif ],  duration_lines  =  [ duration_motif ],  group  =  1 ,  # the number of voices in the treble staff  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n   from  ch0p1n.motif  import  transpose pitch_motif_transposed  =  transpose (  pitch_motif  =  pitch_motif ,  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  step  =  1 )\n   show (  pitch_lines  =  [ pitch_motif_transposed ],  duration_lines  =  [ duration_motif ],  group  =  1 ,  # the number of voices in the treble staff  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n  It looks good. Every pitch has moved up by one step along the C major scale.\n Since harmony is a special kind of scale, we can use  transpose() to repeat the motif in a harmony, say, the G major harmony:\n pitch_motif_transposed  =  transpose (  pitch_motif  =  pitch_motif ,  scale  =  [ 7 ,  11 ,  2 ],  # G major harmony  step  =  1 )\n  show (  pitch_lines  =  [ pitch_motif  +  pitch_motif_transposed ],  duration_lines  =  [ duration_motif  *  2 ],  group  =  1 ,  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n  The original motif is in the first bar, and the transposed the second. You can see how each pitch moves up by one step in the G major harmony.\n In some cases, however,  transpose() does not work well. Still in the above example, suppose we transpose the motif down rather than up by one step with  step = -1:\n  The transposed motif in the second bar is not acceptable because it contains no pitch class G to fully reify the G major harmony.\n  We can improve this situation with function  lead() from  ch0p1n. The function got its name from the concept of voice-leading, which means every note in a motif  leads by step to the note(s) in a given harmony.\n  from  ch0p1n.motif  import  lead pitch_motifs  =  lead (  pitch_motif  =  pitch_motif ,  harmony  =  [ 7 ,  11 ,  2 ],  # G major harmony  steps  =  [ - 1 ,  0 ],  complete  =  False ,  similar  =  None )\n steps = [-1, 0] means each pitch will move zero step if it fits the harmony, and at the same time one step downwards. In other words, each pitch may generate more than one pitch in the given harmony under  lead(), and the result returned is thus a list of pitch motifs rather than a single one. I will talk about parameters  complete and  similar later.\n    # to merge `pitch_motifs` from  itertools  import  chain show (  pitch_lines  =  [ list ( chain ( * pitch_motifs ))],  duration_lines  =  [ duration_motif  *  2 ],  group  =  1 ,  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n  While the motif in the first bar is as same as the unacceptable one generated by  transpose() with  step = -1, the motif in the second bar is good, which fully reifies the G major harmony.\n With  complete = True, we can screen out the pitch motifs which are not harmonically complete or do not fully reify the given harmony:\n pitch_motifs  =  lead (  pitch_motif  =  pitch_motif ,  harmony  =  [ 7 ,  11 ,  2 ],  steps  =  [ - 1 ,  0 ],  complete  =  True ,  similar  =  None )\n   With parameter  similar, we can screen out the pitch motifs which do not have the same contour as the original one. I will skip this part in this introductory blog.\n  The function  thread() is for repeating a motif in consecutive harmonies or  threading a motif through harmonies. Let’s try it on the motif defined earlier:\n from  ch0p1n.motif  import  thread pitch_motifs  =  thread (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  harmonies  =  [[ 5 ,  9 ,  0 ],  [ 7 ,  11 ,  2 ]],  # F, G  durations  =  [ 2 ,  2 ],  steps  =  [ 1 ] ) show (  pitch_lines  =  pitch_motifs ,  duration_lines  =  [ duration_motif ],  group  =  1 ,  key  =  0 ,  meter  =  &#39;2/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n  The first two notes of the motif are adapted to the F major harmony, while the last two notes to the G major harmony.\n So far, I have talked only about harmonic motifs. To deal with non-harmonic motifs, which is more complex, we need first to consider how to elaborate motifs.\n  Simply speaking, elaboration is adding notes to a motif. The function  elaborate() from  ch0p1n serves the exact purpose.\n  from  ch0p1n.motif  import  elaborate motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;left&#39; )\n  show (  pitch_lines  =  [ pitch_motif  +  motif [ 0 ]],  duration_lines  =  [ duration_motif  +  motif [ 1 ]],  group  =  1 ,  key  =  0 ,  meter  =  &#39;4/4&#39; ,  clefs  =  [ &#39;g&#39; ,  &#39;f&#39; ] )\n    The argument  reference indicates where to add notes or elaborate the motif. For example,  reference = 2 means the notes are added at the third note. We can elaborate the last note instead:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  3 ,  # the last note  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;left&#39; )\n  The argument  steps specifies the pitches of the notes to add. For example,  steps = [-1, -1] indicates that the reference note should move one step downwards to generate the first note, then this note should move one step downwards to generate the second note. Let’s add three descending notes with this argument:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ 1 ,  1 ,  1 ],  # three descending notes  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;left&#39; )\n  With  steps, you can also repeat some note or add rests to a motif, as in the following example:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ 0 ,  0 ,  None ]  # repeat the note twice then add a rest )\n  The argument  scale specifies the scale along which to move the reference note to generate the notes to add. For example,  scale = [0, 2, 4, 5, 7, 9, 11] indicates that it is the C major scale. We can use C chromatic scale instead:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  list ( range ( 12 )),  # C chromatic scale  position  =  &#39;left&#39; )\n  The argument  position specifies the position of the added notes relative to the reference note. For example,  position = &#39;left&#39; indicates that the notes are added at the left side of the reference note. We can add the notes at the right side:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;right&#39;  # add the notes at the right side )\n  Please note that, with  &#39;left&#39; and  &#39;right&#39;, the added notes take durations from the reference note. If you want that the durations are taken from the note before or after the reference note, use  &#39;previous&#39; or  &#39;next&#39;. For example,\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;previous&#39;  # take durations from the previous note )\n  The argument  ratio specifies the percentage of duration the added notes take. For example,  ratio = 1/2 means that the added notes take 50% of the duration of the reference note:\n motif  =  elaborate (  pitch_motif  =  pitch_motif ,  duration_motif  =  duration_motif ,  reference  =  2 ,  steps  =  [ - 1 ,  - 1 ],  scale  =  [ 0 ,  2 ,  4 ,  5 ,  7 ,  9 ,  11 ],  position  =  &#39;left&#39; ,  ratio  =  1 / 2  # take 50% of the duration of the reference note )\n   Reduction is the opposite of elaboration. It is removing notes from a motif. The corresponding function from  ch0p1n is  reduce().\n    from  ch0p1n.motif  import  reduce motif  =  reduce (  pitch_motif  =  motif [ 0 ],  duration_motif  =  motif [ 1 ],  start  =  2 ,  end  =  3 ,  position  =  &#39;right&#39; )\n  The arguments  start and  end specify the notes to remove. The argument  position specifies the reference note to which to add the durations of the removed notes.\n    The background harmony is Fm, and the circled notes are non-harmonic since they do not fit the harmony.\n     pitch_motif  =  [ 65 ,  68 ,  72 ,  77 ,  80 ,  79 ,  77 ,  76 ,  77 ,  None ] duration_motif  =  [ 1 ,  1 ,  1 ,  1 ,  1.5 ,  1 / 6 ,  1 / 6 ,  1 / 6 ,  1 ,  1 ]\n  pitch_motif ,  duration_motif  =  reduce (  pitch_motif ,  duration_motif ,  start  =  5 ,  end  =  7 ,  position  =  &#39;left&#39; ) # the same below show (  [ pitch_motif ],  [ duration_motif ],  key  =  - 4 )\n      pitch_motif ,  duration_motif  =  elaborate (  pitch_motif ,  duration_motif ,  reference  =  4 ,  steps  =  [ - 1 ,  - 1 ,  - 1 ],  scale  =  [ 5 ,  7 ,  8 ,  10 ,  0 ,  1 ,  4 ],  position  =  &#39;right&#39; ,  ratio  =  1 / 4 )\n   Fragmentation is breaking a motif up into several shorter motifs or taking a fragment from a motif. The corresponding functions from  ch0p1n are  divide() and  fragment().\n    pitch_motif  =  [ 82 ,  84 ,  85 ,  81 ,  82 ,  78 ]  +  [ 77 ] * 4  +  [ 78 ,  77 ,  75 ,  72 ,  73 ,  70 ] duration_motif  =  [ 0.5 ] * 6  +  [ 1 ] * 4  +  [ 0.5 ] * 4  +  [ 2 ,  1 ]\n With  divide(), we can divide this motif into, say, three shorter motifs of equal length:\n  &gt;&gt;&gt;  motifs [  ([ 82 ,  84 ,  85 ,  81 ,  82 ,  78 ,  77 ],  [ 0.5 ,  0.5 ,  0.5 ,  0.5 ,  0.5 ,  0.5 ,  1 ]),  ([ 77 ,  77 ,  77 ,  78 ,  77 ],  [ 1 ,  1 ,  1 ,  0.5 ,  0.5 ]),  ([ 75 ,  72 ,  73 ,  70 ],  [ 0.5 ,  0.5 ,  2 ,  1 ]) ]\n       from  ch0p1n.motif  import  fragment motif  =  fragment (  pitch_motif ,  duration_motif ,  start  =  6 ,  end  =  9 ,  ratio  =  1 / 2 ,  fit  =  &#39;right&#39; ) show ([ motif [ 0 ]],  [ motif [ 1 ]],  key  =  - 5 ,  meter  =  &#39;6/4&#39; )\n  The arguments  start and  end specify the start note and the end note of the fragment.  ratio = 1/2 indicates that the fragment’s length should be 50% of the original motif, and to accomplish this,  fit = &#39;right&#39; indicates that the end note should be prolonged.\n  Now it is time to put it all together. Let’s first try to generate the beginning of the Beethoven’s sonata from a small amount of materials, under the operations that we have been talking about.\n To simplify the problem and to make patterns more discernible, I will remove slurs, articulations, dynamics, grace notes, and some other notes from the original score:\n  This piece consists of two voices or musical lines, the melody line in the treble staff and the accompaniment line in the bass staff.\n         In summary, to generate the beginning of the Beethoven’s sonata, the core materials are\n    melodic_pitch_motif  =  [ 65 ,  68 ,  72 ,  77 ,  80 ,  77 ] melodic_duration_motif  =  [ 1 ,  1 ,  1 ,  1 ,  2 ,  2 ]\n    # Fm, C7, Fm, C7, Fm, Gdim, C7 harmonies  =  [  [ 5 ,  8 ,  0 ],  [ 0 ,  4 ,  7 ,  10 ],  [ 5 ,  8 ,  0 ],  [ 0 ,  4 ,  7 ,  10 ],  [ 5 ,  8 ,  0 ],  [ 7 ,  10 ,  1 ],  [ 0 ,  4 ,  7 ,  10 ] ] # F harmonic minor scale scale  =  [ 5 ,  7 ,  8 ,  10 ,  0 ,  1 ,  4 ]\n  def  generate_beethoven_sonata (  melodic_pitch_motif ,  melodic_duration_motif ,  accompaniment_pitch_motif ,  accompaniment_duration_motif ,  harmonies , \n......", "posttime": "2022-02-15 16:20:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "作曲,automatic,音高", "title": "我的自动作曲方法", "title_en": "My approach to automatic musical composition", "transed": 1, "url": "https://flujoo.github.io/en/my-approach-to-automatic-musical-composition/", "via": "", "real_tags": ["作曲", "automatic", "音高"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Matt Mullenweg是WordPress背后的Automattic公司的创始人兼首席执行官。com讨论了“异步工作”以及他认为混合模式将消亡的原因\n世界各地的公司都在努力寻找工作的未来。Matt Mullenweg是WordPress背后的Automattic公司的创始人兼首席执行官。com说，他的员工们已经过上了这种生活。\n在疫情期间，许多白领已经习惯了不正常的工作时间，他们打乱了传统的9-5上班时间，以适应照顾孩子或其他责任。自Automattic 2005年成立以来，这种灵活性一直是常态。Automattic是所谓的异步工作的先驱，它不仅为工人提供了位置上的灵活性，还为他们的工作时间提供了灵活性。该公司在97个国家拥有1876名员工，他们在“异步”的基础上工作，这意味着他们可以自行设定时间表。虽然他们必须实现目标，但他们可以控制自己的工作时间和工作量。\n《华尔街日报》将向您收取$+税（如果适用）。您可以随时在客户中心或致电客户服务部更改账单偏好。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客服取消订阅。", "note_en": "Work     Matt Mullenweg, founder and CEO of Automattic, the company behind WordPress.com, talks about ‘asynchronous work’ and why he thinks hybrid models will die out\n   Companies everywhere are struggling to figure out the future of work. Matt Mullenweg, founder and CEO of Automattic, the company behind WordPress.com, says his employees  are already living it.\n  During the pandemic, many white-collar workers grew accustomed to  working unusual hours, scrambling their traditional 9-5 schedules to adjust for childcare or other responsibilities. Since Automattic’s 2005 founding, such flexibility has been the norm. Automattic was a pioneer of so-called asynchronous work, which offers workers not only flexibility on their location, but on their hours, too. The company has 1,876 employees in 97 countries who work on an “asynchronous” basis, meaning they set their own schedules. While they must hit their goals, they control when and how much they work.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-02-15 16:13:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "执行官,lets", "title": "首席执行官让他的员工随时随地工作——无论他们想在哪里工作", "title_en": "CEO Lets His Employees Work Whenever They Want–From Wherever They Want", "transed": 1, "url": "https://www.wsj.com/articles/the-next-wave-in-remote-work-flexibility-in-locationand-hours-11643993475", "via": "", "real_tags": ["执行官", "lets"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一，GiveSendGo的网站称其处于“维护中”，几小时后该网站被劫持并重定向到据信由黑客控制的页面，该页面不再加载。重定向的页面2019冠状病毒疾病，他们在加拿大首都的卡车司机反对强制性的CVID-19疫苗接种，造成交通和贸易的广泛破坏超过一周。\n该页面还包含一个链接，指向一个包含数万条记录的文件，这些记录被称为“原始捐赠数据”，涉及那些向自由护航队捐款的人。\n不久后，非营利泄密网站Distributed Denial of Secrets表示，它从GiveSendGo收到了30兆字节的捐赠者信息，包括自我报告的姓名、电子邮件地址、邮政编码和IP地址。\n分布式拒绝机密网站（Distributed Denial of Secrets）表示，这些数据只会提供给研究人员和记者。该网站以托管涉及极右翼团体的一系列泄露数据而闻名。\n据记者米凯尔·塔伦（Mikael Thalen）称，此次漏洞与早些时候的一次安全漏洞是不同的。在那次安全漏洞中，GiveSendGo将一个亚马逊托管的S3存储桶暴露在了互联网上，存储了上千份身份证件。塔伦在一夜之间首次报告了数据漏洞。\n上个月，总部位于马萨诸塞州波士顿的GiveSendGo成为“自由护航队”的主要捐款服务机构，GoFundMe停止了众包活动，并冻结了数百万美元的捐款，理由是警方报告称渥太华各地发生了暴力事件。上周末，加拿大一家法院发布命令，禁止使用GiveSendGo募集的资金，该公司表示将对此进行抗辩。\n本月早些时候，抗议者为自由车队筹集了800多万美元。\n更新以澄清分布式拒绝机密的数据是针对自由护航数据的，而不是针对每一场战役。", "note_en": "On Monday, GiveSendGo’s website said it was “under maintenance,” hours after the site was hijacked and redirected to a page believed to be controlled by the hackers, which no longer loads. The redirected page condemned the truckers who descended on Canada’s capital to oppose mandatory COVID-19 vaccinations, causing widespread disruption to traffic and trade for more than a week.\n The page also contained a link to a file containing tens of thousands of records of what was described as “raw donation data” about those who donated to the Freedom Convoy.\n  A short time later, nonprofit leak site Distributed Denial of Secrets said it had received 30 megabytes of donor information from GiveSendGo, including self-reported names, email addresses, ZIP codes and IP addresses.\n Distributed Denial of Secrets, a site known for hosting sets of leaked data involving far-right groups, said that the data would only be provided to researchers and journalists.\n   The breach is separate from an earlier security lapse, in which GiveSendGo left exposed to the internet an Amazon-hosted S3 bucket  storing over a thousand identity documents, according to journalist Mikael Thalen, who  first reported the data breach overnight.\n The Boston, Massachusetts-based GiveSendGo became the primary donation service for the “Freedom Convoy” last month after GoFundMe halted the crowdsourcing campaign and froze millions of dollars in donations, citing police reports of violence across Ottawa. Over the weekend, a Canadian court issued an order halting access to the funds collected by GiveSendGo, which the company said it would defy.\n Earlier in the month, the protesters raised more than $8 million for the Freedom Convoy.\n Updated to clarify that the data given to Distributed Denial of Secrets was for the Freedom Convoy data, not every campaign.", "posttime": "2022-02-15 16:12:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,捐赠者,leak,数据", "title": "GiveSendGo入侵后，黑客泄露了“自由护航”捐赠者的名字", "title_en": "Hackers leak names of ‘Freedom Convoy’ donors after GiveSendGo breach", "transed": 1, "url": "https://techcrunch.com/2022/02/14/freedom-convoy-donor-leak-givesendgo/", "via": "", "real_tags": ["黑客", "捐赠者", "leak", "数据"]}]