[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1000217, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lyft刚刚进行了一轮大规模裁员，导致982人失业，288人被迫休假，该公司也在少数几个城市对其滑板车业务踩刹车。\nLyft的一位发言人在给TechCrunch的一份声明中表示：我们将把我们的资源集中在能够产生最大影响、最好地服务于城市和乘客的地方。我们继续投资于自行车和滑板车业务，但我们做出了艰难的决定，将资源从三个滑板车市场转移到我们为长期成功做好准备的机会上。\n在昨天发给奥克兰骑手的一封电子邮件中，Lyft表示将不再提供滑板车，立即生效。\n莱夫特写道：谢谢你骑我们的滑板车。我们知道让他们走很难。不过别担心--Lyft在奥克兰还在继续前进，在这段时间里，它会帮助你到达你需要去的地方。\nLyft还永久关闭了在奥斯汀和圣何塞的业务。在决定永久关闭奥斯汀之前，Lyft在3月中旬暂时移除了滑板车，然后在4月初将其带回，以更好地为必要的工人服务。\n据Lyft网站介绍，未来，Lyft滑板车将只在丹佛、洛杉矶、圣地亚哥、圣莫尼卡和华盛顿特区出售。目前，Lyft在迈阿密的运营仍处于暂停状态。\nLyft并不是唯一家在大流行期间受到影响的摩托车运营商。例如，莱姆和伯德都暂停了在某些市场的运营。在这些时期，伯德也同样面临着财务问题。今年3月，鸟牌裁员约30%。\n但即使在大流行之前，Lyft已经停止了在一些城市的滑板车业务。例如，Lyft在11月结束了在纳什维尔、圣安东尼奥、亚特兰大、凤凰城地区、达拉斯和哥伦布的业务。当时，Lyft还解雇了20名员工。", "note_en": "Lyft,   which just had a massive round of layoffs wherein 982 people lost their jobs and 288 were furloughed, is also pumping the brakes on its scooter operations in a handful of cities.\n &#34;We’re focusing our resources where we can have the biggest impact and best serve cities and riders,&#34; a Lyft spokesperson said in a statement to TechCrunch. &#34;We’re continuing to invest in our bike and scooter business, but have made the tough decision to shift resources away from three scooter markets and toward opportunities where we are set up for longer-term success.&#34;\n In an  email sent to Oakland riders yesterday, Lyft said scooters would no longer be available, effective immediately.\n &#34;Thanks for riding our scooters,&#34; Lyft wrote. &#34;We know it&#39;s tough to let them go. But don&#39;t worry - Lyft is still moving forward in Oakland, and is here to help you get to where you need to go during this time.&#34;\n Lyft has also permanently shut down its operations in  Austin and  San Jose. The decision to shut down permanently in Austin came after Lyft temporarily removed the scooters in mid-March and then brought them back in early April to better serve essential workers.\n Moving forward, Lyft scooters will only be available in Denver, Los Angeles, San Diego, Santa Monica and Washington, D.C., according to the company&#39;s site. Right now, Lyft&#39;s operations in Miami are still paused.\n Lyft is not the only scooter operator that has been affected during the pandemic. Lime and Bird, for example,  have both paused operations in certain markets. Bird has also similarly faced financial troubles during these times. In March,  Bird laid off about 30% of its workforce.\n But even before the pandemic, Lyft had ceased scooter operations in a number of cities. In November, for example,  Lyft ended its operations in Nashville, San Antonio, Atlanta, the Phoenix area, Dallas and Columbus. At the time, Lyft also laid off 20 employees.", "posttime": "2020-05-02 17:59:47", "tags": "结束,ends,滑板车,lyft", "title": "Lyft结束在奥克兰、奥斯汀和圣何塞的电动滑板车业务", "title_en": "Lyft ends electric scooter operations in Oakland, Austin and San Jose", "transed": 0, "url": "https://news.yahoo.com/lyft-ends-electric-scooter-operations-171711550.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["结束", "ends", "滑板车", "lyft"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000216, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年，普林斯顿大学和芝加哥大学的研究人员发表了一项关于所谓“暗模式”的研究结果。黑暗模式是在线企业用来操纵用户做一些能让企业赚更多钱的事情的策略。\n例如，无法最小化的电子邮件捕获弹出窗口或几乎不可能取消的重复计费方案。\n虽然研究得出的结论是它们通常是有效的，但过度咄咄逼人的使用可能会引起强烈的反弹，从而侵蚀信任，损害你的品牌。如果减少在线用户的欺骗体验法案成为法律，其中一些策略可能很快就会成为非法的。\n所有这些都让我思考相反的策略，让我更信任一家企业。我会称它们为反黑暗模式。以下是几个例子：\n最近，由于冠状病毒的原因，我们不得不在网上举行了一次定期会议。因为我已经将Zoom用于虚拟会议，所以我考虑使用他们的网络研讨会解决方案。这是一次一次性的活动，我不需要重复的网络研讨会解决方案，所以我小心翼翼地行事，以免如果我忘了取消，就会被锁定在永远的账单方案中。\n你猜怎么着？他们只有一个月的选择权(见上图)，我查过了。我立刻觉得这是一家我可以信任的公司。大多数其他人永远不会提供这个选项，或者即使他们提供了，它也会在页面底部用小字体打印-或者更糟糕的是，需要您通过客户支持。\n那周晚些时候，在我所在的一个大型论坛上，有人问我关于网络研讨会的解决方案。由于我的积极体验，我立即向2000多名会员推荐了Zoom。我怀疑这种基于信任的口碑推荐(以及产品的简单性)对Zoom的曲棍球棒曲线增长做出了很大贡献(他们甚至在冠状病毒之前就做得很好)。\n与上述1)密切相关的是让免费试用用户知道他们将在计费日期前几天被计费。一家提供7天免费试用的公司更进一步：在让我知道我很快就会收到账单的同时，他们说了一些类似的话：“以防万一你需要额外的时间，我们又增加了两天的免费天数。”您将在第9天收到账单。“。这件事让我想付至少一个月的钱。在此之前，我一直处于边缘。\n当你在谷歌上购买机票时，显示的标题价格与Checkout的价格相同。这。\n这让我信任谷歌，在过去的几年里，我没有在其他地方买过票！\n例如，以下是从西雅图到达拉斯的往返机票的标题价格197美元：\n当我点击到结账页面时，196.20美元实际上便宜了80美分。最重要的是，他们已经将所有税费都包括在了整体价格中。\n将这种方法与潘多拉的方法进行对比，即在播放当前歌曲的同时销售演唱会门票。大约一年前，当我在听一首“Boyz II Men”的歌曲时，我注意到一则西雅图旅游约会的广告。低价引起了我的兴趣，我点击了一下。当我到收银台的时候，价格已经涨到了将近30%到40%，包括所有的税、附加费、便利费和天知道还有什么其他的费用！我再也没有点击过潘多拉上的演唱会门票销售广告。..。\n很多时候，我选择了免费的报告或电子书，结果却被每天的电子邮件所困扰。我立即取消订阅，我怀疑其他许多人也是这样做的。除非你是一个明确的每日时事通讯类型的企业，否则对于一个新的列表成员来说，这是太多的电子邮件了。\n借助于市场营销中经常使用的求爱类比，就像从第一次约会到每天出现在她门口，问她是否准备好了一样！你很快就会把她拒之门外，而如果你慢慢来，可能会发展出一段有意义的关系。\n我记得德里克·西弗斯(Derek Sivers)讲过的一个故事，讲的是一家公司销售音乐CD的方式，每周通过电子邮件发送名单一两次，并提供推荐。这是一项利润丰厚的业务，由音乐爱好者经营，他们关心为不同的音乐品味推荐最相关的CD。\n然后他们被收购了，投资者们想：如果你每周发两次电子邮件，一年就能赚100万美元，我们每天发电子邮件至少可以赚到三倍。他们发出了游行命令，“从现在开始，每天发一封电子邮件”。随着最初的音乐人所有者的离开，西装推荐了随机的CD，这导致了销量的下降，尽管电子邮件频率更高。\n不到一年，他们就倒闭了！这份名单已经被激进的促销活动烧毁了，大多数人不再打开电子邮件，或者干脆取消订阅。", "note_en": "Last year researchers at Princeton and the University of Chicago   published the results of a study  on so called “dark patterns”. Dark patterns are tactics online businesses use to manipulate users to do things that will make the business more money.\n For example, email capture popups that cannot be minimized or recurring billing schemes that are nearly impossible to cancel.\n While the research concluded they are generally effective, overly aggressive use can cause a backlash that erodes trust and hurts your brand. Some of these tactics might soon be illegal if the   Deceptive Experiences to Online Users Reduction Act  becomes law.\n All this got me thinking about opposite tactics that make me trust a business more. I will call them anti-dark-patterns. Here are a few:\n      Recently, we had to hold one of regular meetups online due to the corona virus. As I already used Zoom for virtual meetings, I looked into using their webinar solution. It was a one-time event and I did not need a recurring webinar solution, so I treaded cautiously to avoid being locked into a forever billing scheme if I forgot to cancel.\n Guess what? They had an option for just one month (see image above), which I checked. I immediately felt that this is a company I could trust. Most others would never offer this option, or if they did, it would be in tiny print at the bottom of the page—or worse yet, require you to go through customer support.\n Later that week, someone on a large forum I belong to asked about webinar solutions. Due to my positive experience, I instantly recommended Zoom to more than 2,000 members. I suspect this kind of word of mouth referral based on trust (as well as product simplicity) has contributed a lot to Zoom’s hockey stick curve growth (they were doing well even before the corona virus).\n     Closely related to 1) above is letting a free trial user know that they will be billed, a few days before the billing date. One company with a 7-day free trial took it even a step further: while letting me know I would be billed soon, they said something along the lines of  “just in case you need extra time, we’ve thrown in two more free days. You will be billed on the 9  th  day”.  Something about this made me want to pay for at least a month. Before, I was on the borderline.\n     When you buy plane tickets on Google, the headline price shown is the same price at Checkout. This\n makes me trust Google and in the last few years I have not bought my tickets anywhere else!\n  For example, below is a headline price of $197 for a round-trip ticket from Seattle to Dallas:\n      When I click through to the checkout page, it is actually 80 cents cheaper at $196.20. Most importantly, they already included all the taxes and fees in the headline price.\n      Contrast this approach with Pandora’s, when selling concert tickets alongside the current song playing. About a year ago, while listening to a  Boyz II Men song, I noticed an ad for a tour date in Seattle. Intrigued by the low price, I clicked through. By the time I got to the checkout, the price had ballooned to almost 30% to 40% more, with all the taxes, surcharges, convenience fees and god-knows-what other fees! I have never again clicked on a concert ticket sale ad on Pandora.  ...\n      Many a time I have opted in for a free report or eBook only to be hounded by daily emails. I unsubscribe immediately, as I suspect many others do. Unless you are explicitly a daily newsletter kind of business, this is too much email for a new list member to handle.\n  To piggyback on the courtship analogy often used in marketing, it is like going from first date to showing up at her door every day asking if she is ready to do it! You will quickly turn her off, whereas if you had taken it a little slower, a meaningful relationship might have developed.\n    I recall a story told by   Derek Sivers  (I think) about a company that sold music CDs by emailing their list once or twice a week with a recommendation. It was a nice profitable business ran by music enthusiasts who cared about recommending the most relevant CDs for different musical tastes.\n  Then they got acquired and the investors figured: If you make a million a year emailing twice a week, we can make at least three times as much by emailing daily. They gave the marching orders, “from now on, send a daily email”. With the original musician owners gone, the suits recommended random CDs which resulted in fewer sales despite a higher email frequency.\n  And in less than a year they were out of business! The listed got burned out from the aggressive promotions and most people no longer opened the emails or simply unsubscribed.", "posttime": "2020-05-02 17:59:41", "tags": "rust,saas,simple,电子邮件,trust", "title": "在电子商务和SaaS中建立信任的反黑暗模式非常简单", "title_en": "Surprisingly Simple Anti-Dark-Patterns That Build Trust in Ecommerce and SaaS", "transed": 0, "url": "https://capitalandgrowth.org/answers/Article/3202235/Surprisingly-Simple-Anti-Dark-Patterns-that-Build-Trust-in-Ecommerce-and-Saas", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["rust", "saas", "simple", "电子邮件", "trust"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000215, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然自动更正功能有时会让每一位iPhone用户感到沮丧，但我认为这是一项极其复杂的功能，很难做到正确无误。在使用它13年后，我发现我有一个清单，上面列出了我希望看到的一些小变化，而不是几个真正大的变化。\n我想让这更多的建议列表，只是撕裂到自动更正。请注意，我可以始终密切关注补全栏，但在键入单词时必须查看三种可能的拼写是很麻烦的。\n自动更正功能喜欢通过选择一个比我们实际输入的更常见的单词来智取我们。\n在某些情况下，这可能是一个受欢迎的惊喜，但我觉得当它改变了我的有效词汇时，它的挫折感超过了这一点。如果我真的指的是更常见的那个，我可以自己修复它，随着时间的推移，系统会知道这是我使用的一个词。\n其中的一种变体是在有效单词后加上结尾。例如，我输入“flummox”(一个有效的单词)，系统自动将其更正为“flummoked”，可能是因为它是一个更常用的单词。\n2)当用户重新键入自动大写更正时，不保留大写。\n这很接近我清单的首位。事情是这样的。\n自动更正对我来说是大写的“芝加哥”，太棒了。但是当我改变我的句子时，它把“where”这个词不恰当地大写了。注意：您可以双击“Chicago”来绕过它，但是文本编辑可能很麻烦，所以我通常只使用退格键。\n请注意，您可以关闭自动大写，但在句子中只将第一个单词和专有名称(如Chicago)大写是很好的。\n当我点击空格键时，有时会点击太高而击中上面一行的字母。我希望进行自动更正，以查看我输入的是真正的单词，但将c、v和b与它们混合在一起。例如：\n特别是当我键入一个很长的单词时，我会更多地使用补全栏来节省时间。但很多时候，它的单词形式不是我要找的。例如，如果我想输入“flummox”，所以我开始输入“flummo”，但注意到我没有得到我想要的建议。\n我不是UI设计师，但我喜欢点击并按住完成栏中的“flummox”，它会显示所有不同的可用形式(单数、复数、时态、词性)。对于较长的单词或难以键入的单词，确保键入正确会节省时间。\n5)隐藏的“Replace…”该功能运行得如此之好，为什么自动更正功能不使用它呢？\n很多人都不知道这一点，但是如果你有一个拼写错误的单词，并且加了下划线，你可以双击它，选择Replace…。(如果有)，您会得到一些建议。\n根据我的经验，这些建议真的非常非常好，而且因为加了下划线，所以它们是自动更正不能理解的单词。\n那么为什么这个“取代…”呢？功能似乎是…。好多了？\n如果您键入100个单词的文本，有多少个单词会被自动更正为错误的？我不知道答案，但我猜大概有10个。修理一个坏的自动校正是非常单调乏味的。很少有人知道的一种方法是您可以使用撤消。\n如果你不介意猛烈摇晃你的手机，冒着损坏的风险，这是一个很好的选择。另一个可能是撤消按钮，该按钮可能会在自动更正发生后短暂出现在屏幕上。或者把它塞进完成栏。\n遗憾的是，请注意撤消功能有非常多的错误。有时它会突出显示单词和前面的空格。其他时候，它会高亮显示从前两次修正到当前光标位置的所有内容。\n有时我打出一整段话，通读一遍，然后意识到有很多不好的自动更正。我认为如果自动更正的单词能够突出显示，无论是在短时间内，还是在您完成键入之前，都会很好。\n这将允许您在上下文中捕获错误，而不是太晚。此外，根据您的打字风格，它还可以帮助识别更有可能是不正确的单词。\n这可能有用的一个具体情况是，它会更正比您上次键入的单词更早的单词。通常情况下，你的眼睛盯着当前的单词，很难注意到在此之前的变化。\n这与上面提到的撤消功能很好地配合使用。想象一下多次点击Undo以循环浏览需要修复的自动更正的单词。\n我不知道这将如何工作，但我发现自己想要一种暂时关闭自动完成的方法。也许我是在和一个我们在词典不熟悉的主题领域造词或用词的人交谈。也许我们用了很多缩略语。\n至于用户界面，我不知道你会如何做到这一点，但我认为这是一个有趣的想法。\n9)使完成栏更明显地显示点击空格或回车时将发生的情况。\n我发现完成栏在某些情况下真的很有用，但由于它的界面依赖于典型的Apple灰色和稍浅的灰色背景，我发现很难理解Comp", "note_en": "While auto-correct frustrates every iPhone user at one time or another, I imagine it’s an insanely complex feature to get right. After using it for 13 years now, I find that I have a list of  small things I’d love to see change rather than a few number of really  big changes.\n I wanted to make this more a list of suggestions that to just rip into auto-correct. Note that I can always keep a very close eye on the completion bar but to have to look at three possible spellings as I type a word is cumbersome.\n  Auto-correct likes to outsmart us by choosing a more common word than we actually typed.\n In some cases, it might be a welcome surprise, but I feel it’s outweighed by the frustration when it changes my valid word. If I really meant the more common one, I can fix it myself and the system will learn over time that it’s a word I use.\n  One variation on this is adding an ending to a valid word. For example, I typed “flummox” (a valid word) and it auto-corrected it to “flummoxed”, probably because it’s a more commonly used word.\n 2) When an auto-capitalized correction is retyped by the user, don’t preserve capitalization\n This is pretty close to the top of my list. Here’s what happens.\n      Auto-correct capitalized “Chicago” for me, which is wonderful. But when I changed my sentence, it capitalized the word “Where” inappropriately. Note you can double-tap “Chicago” to get around it, but text editing can be fiddly so I usually just backspace.\n  Note that you can turn off auto-capitalization, but it’s nice to just have the first word capitalized in a sentence and also proper names like Chicago.\n  When I tap the space bar, I sometimes tap it too high and hit a letter in the row above. I’d love auto-correct to see that I’m typing real words, but intermixing c, v, and b in with them. For example:\n    Especially when I’m typing a long word, I use the completion bar more to save time. But many times, it’ll have forms of the word that aren’t what I’m looking for. For example, if I want to type “flummoxes” so I start typing “flummo” and note I don’t get what I want for suggestions.\n  I’m not a UI designer, but I’d love to tap and hold on “flummox” in the completion bar and it would show all the different available forms (singular, plural, tenses, parts of speech). For a long word or one that is difficult to type, it would save time to make sure I type it correctly.\n 5) The hidden “Replace…” the feature works so well; why doesn’t auto-correct use it?\n A lot of people don’t know this, but if you have a misspelled word and it is underlined, you can double-tap on it, choose Replace… (if present) and you’ll get a number of suggestions.\n In my experience, the suggestions are really, really good and since it’s underlined, they are words that auto-correct couldn’t figure out.\n So why is it that this “Replace…” feature seems to be… better?\n   If you type 100 words of text, how many words are auto-corrected wrong? I don’t know the answer, but I’d guess about 10. It’s very tedious to fix a bad auto-correction. One way that few people know about is you can use Undo.\n If you don’t mind shaking your phone violently and risking damage, this is a great option. Another might be an Undo button that perhaps appears briefly on screen after an auto-correction takes place. Or squeeze it into the completion bar.\n   Sadly, note that the Undo feature is extremely buggy. Sometimes it highlights the word and the previous space. Other times it highlights everything from 2 corrections ago to the current cursor position.\n  Sometimes I type a whole paragraph, read it over, then realize that there were a number of bad auto-corrections. I think it would be nice if auto-corrected words would be highlighted, either for a short period of time, or until you are finished typing.\n This would allow you to catch errors in context rather than much later. Also, it’ll help identify words that may be more likely to be incorrect depending on your typing style.\n One specific case where this would be useful is where it corrects words earlier than the one you last typed. Typically, your eyes are on the current word and it’s hard to notice things changing before that.\n This works nicely with the Undo feature mentioned above. Imagine hitting Undo multiple times to cycle through auto-corrected words you need to fix.\n  I don’t know how this would work but I find myself wanting a way to temporarily turn off auto-complete. Maybe I’m speaking with someone where we make up words or use words in a subject area that the dictionary is not familiar with. Perhaps we use a lot of acronyms.\n As far as user interface, I don’t know how you would pull this off but I think it’s an interesting idea.\n 9) Make completion bar more obvious what is going to happen when tapping space or return\n I find the completion bar really useful in certain cases, but due to its interface that relies on the typical Apple grey on slightly lighter grey background, I find it hard to understand what the completion bar is supposed to do. There are at least three states I know of.\n     3&gt; I’m going to replace what you typed with the word circled in a slightly lighter grey\n  Since the two “colors” match the keyboard exactly, I think it’s hard to easily notice #2 and #3 especially. It’s a lot faster to type if you know it’s already guessed your word completely versus it has an idea but is not sure yet, so you need to type more.\n  The original purpose of auto-correct was to correct fat-fingering the keyboard. So, if I type nanana instead of banana, it found a word based on the fact that “n” and “b” are adjacent to each other.\n Nowadays, machine learning is all the rage, and the goal is often to be smarter than the user and choose words it thinks the user meant based on popularity or usage in the past or trending on Twitter.\n For fun, I typed the word “kerfuffle” but I accidentally type “keffuffle”—a one character difference between two adjacent keys. What does it suggest? Keep. If machines are supposed to learn, this one hasn’t learned that much!\n   When typing fast, sometimes I type a word and a character is missing. I find that auto-correct works well when the typed word is longer, but not shorter. I go back to my “kerfuffle” example. If I type “kerfffle” which is missing the “u” it doesn’t even suggest an alternative.\n I’m no expert, but a word that has 8 out of 9 characters in common and in order at least deserves to be in the suggestions bar.\n  One of the biggest sources of frustration, confusion, embarrassment, and relationship breakups is misinterpreted auto-corrected text.\n I’ll save the best idea for last (in my opinion). What if the recipient could see auto-corrected text highlighted in the message from you! Then if something were weird or unclear, they would know it’s not actually what you typed.\n  1&gt; You could have a way for the recipient to see what was originally typed\n 2&gt; The sender could quickly send a message to the effect of “I said A but really meant B” without having to type all that text\n   As I said at the start, auto-correct is a far harder technology to crack than most people realize. I consider my suggestions to be anywhere from simple to moderate to implement, with a few impossible ones thrown in.\n I think they would do a good job of improving the user experience of auto-correct and make people enjoy using it rather than getting frustrated by it sometimes.", "posttime": "2020-05-02 17:59:29", "tags": "更改,auto,单词,word", "title": "关于自动更正，我要更改的内容", "title_en": "Things I'd Change About Auto-Correct", "transed": 0, "url": "https://techreflect.net/2020/04/29/10-things-id-change-about-auto-correct", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["更改", "auto", "单词", "word"]}, {"category": "", "categoryclass": "", "imagename": "337d76ee473b168b224aefb34d6f7bb1.jpg", "infoid": 1000214, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有什么比刽子手的工作更能代表法国大革命前的态度了。从事这项工作的人服务于王室的意愿，按照上层阶级的命令处理死亡和酷刑。按照官方说法，他们因这个角色而受到尊敬。非正式地，他们因此而受到鄙视。贵族们认为他们是用来对付下层阶级的工具，以约束他们，但他们也把他们视为下层阶级的成员。所以，当革命来临时，一个刽子手.。\n和皮尔波特夫妇一样，桑森夫妇也把处决作为一种家族贸易。这并不是真正的巧合。很难让男人加入到勒布罗的行列中来，因此法律规定，如果刽子手找不到学徒，那么他的儿子或女婿将不得不取代他们的位置。这是一件很困难的事情，所以法律规定，如果刽子手找不到学徒，那么他的儿子或女婿将不得不取代他们的位置。他们中第一个从事这一行当的是一位名叫查尔斯·桑森·德·朗瓦尔的贫穷贵族。他娶了一个刽子手的女儿，要么是为了爱情(家族传说说她是他的护士后.。\n查尔斯娶的女儿在生下他们的儿子时死于死亡，儿子也叫查尔斯。这个查尔斯长大后接替了他父亲的工作，娶了一个叫安妮-马特的令人敬畏的女人。小查尔斯于1726年去世，留下一个7岁的儿子查尔斯-让-巴蒂斯特和一个5岁的儿子尼古拉斯-查尔斯-加布里埃尔。查尔斯-让-巴蒂斯特(Charles-Jean-Baptiste)现在正式成为巴黎的国家刽子手，这是一个有利可图的职位，安妮-马特·桑森(Anne-Marthe Sanson)并不打算放弃这个职位。所以那个..。\n查尔斯-亨利在很小的时候就知道，他的家族贸易是一种被整个世界蔑视的行业。按照通常的安排，他们在家里从来没有讨论过这件事，而桑森夫妇也只谈到了“工作”。为了保护他免受“工作”的耻辱，年轻的查尔斯·亨利被匿名录取到鲁昂普罗维登斯修女开办的一所相当有声望的学校。他在那里学医，希望能逃离他的家族手艺。不幸的是，在……的年龄。\n起初，查尔斯-亨利和他的父亲一样，不得不把实际的处决留给“助手”。1757年，他自己在18世纪最血腥的处决之一中扮演了助手的角色，这个人试图做查尔斯·亨利将因杀死摄政王而臭名昭著的事情。罗伯特-弗朗索瓦·达米恩斯(Robert-François Damiens)是一名失业的前仆人，似乎一直患有某种形式的精神疾病。他指责路易十五的原因是詹森教(天主教的一个教派)被统治为异端，所以当国王被。\n1757年3月28日早晨，罗伯特-弗朗索瓦·达米恩斯被带到巴黎市中心的一个绞刑架上。那里有一大群人(包括臭名昭著的卡萨诺瓦)目睹了他受到字面上的中世纪酷刑。官方的刽子手是查尔斯-亨利的叔叔尼古拉斯-查尔斯-加布里埃尔·桑森(Nicolas-Charles-Gabriel Sanson)。查尔斯-亨利和其他几个人提供了帮助。从外面看是可怕的，但从里面看几乎是滑稽可笑的。法国上一次杀死君主是在1610年，而.。\n尼古拉斯-查尔斯-加布里埃尔在达明斯被处决后退休，这对他来说显然是走得太远了一步。另一方面，查尔斯-亨利似乎有相反的反应。这件可怕的事非但没有让他放弃行当，反而让他习惯了。在此之后，没有其他工作能比这更糟糕了。这并不是说一帆风顺。一个值得注意的事件发生在1766年，当时他父亲的一位老朋友是“作品”的主角。托马斯·亚瑟，拉利伯爵，是一位法国贵族。\n托马斯·亚瑟和提奎特夫人都出身高贵，这就是为什么他们认为斩首是他们的处决方法。大多数其他罪犯都被绞死了，尽管那些罪行被认为更令人发指的人被认为是更复杂的死亡形式。异教徒被烧死，造假者被活活煮熟，杀人犯面临被“摔在轮子上”的危险。他们被绑在一个圆形轮子上，用铁棒折断了四肢，最后被打死。更富有同情心的理想是……。\n带头冲锋的是约瑟夫-伊格内斯·吉洛廷(Joseph-Ignace Guillotin)，他是一名医生，于1789年当选为巴黎联合国大会代表之一。Guillotin实际上反对对本金判处死刑，但他认为第一步应该是让这个过程尽可能地无痛。他提出了一项动议，即所有死刑判决都应以机械方式斩首。动议获得通过。斩首机器最初被称为“路易赛特”，以它的设计者的名字命名……。\n查尔斯-亨利·桑森(Charles-Henri Sanson)是断头台的坚定倡导者，尽管他的动机可能有点自私。这不仅会使他的工作轻松很多，而且还意味着他将不再需要维护大量的执行工具。他承担了测试原型的工作，从稻草包开始。紧随其后的是活羊，然后是人的身体。这台机器被宣布成功，并成为第一个官方指南", "note_en": "There ’s nothing that epitomises the attitudes of pre-Revolutionary France quite like the job of executioner. The men in this job served the royal will, dealing out death and torture as decreed by the upper classes. Officially they were esteemed for this role. Unofficially they were despised for it. The aristocrats saw them as tools to be deployed against the lower classes to keep them in line, but they also saw them as members of those lower orders. And so, when the Revolution came, an executioner  ...\n  Like the  Pierrepoints, the Sansons made executions a family trade. This wasn’t really a coincidence. It was difficult to get men to join the ranks of  les Bourreaux, and so the law said that if an executioner could not find an apprentice then his son or son-in-law would have to take their place. The first of them to take up the trade was an impoverished nobleman named Charles Sanson de Longval. He married the daughter of an executioner, either for love (family legend said that she was his nurse after  ...\n The daughter who Charles married died giving birth to their son, also named Charles. This Charles grew up to take on his father ’s job, and married a formidable woman named Anne-Marthe. Charles junior died in 1726, leaving behind a seven year old son named Charles-Jean-Baptiste and a five year old son named Nicolas-Charles-Gabriel. Officially Charles-Jean-Baptiste was now the state executioner for Paris, a lucrative position and one that Anne-Marthe Sanson had no intention of giving up. So the  ...\n  Charles-Henri learned at an early age that his family trade was one held in contempt by the world at large. By common arrangement it was never discussed by them at home, and the Sansons only ever spoke of “the work ”. In order to safeguard him from the disgrace of “the work ”, young Charles-Henri was enrolled anonymously at a fairly prestigious school run by the Sisters of Providence of Rouen. There he studied medicine, hoping to be able to escape his family trade. Unfortunately at the age of  ...\n  Initially, like his father, Charles-Henri had to leave the actual executions to “assistants ”. In 1757 he himself played assistant to one of the goriest executions of the 18th century, on a man who tried to do what Charles-Henri would become infamous for –regicide. Robert-François Damiens was an unemployed ex-servant who seems to have been suffering from some form of mental illness. He blamed Louis XV for Jansenism (a sect of Catholicism) having been ruled heretical, and so when the King was  ...\n On the morning of the 28th March 1757 Robert-François Damiens was taken to a scaffold in the center of Paris. There a massive crowd (which included the infamous Casanova) were witness to him being subjected to literally medieval tortures. The official executioner was Charles-Henri ’s uncle, Nicolas-Charles-Gabriel Sanson. Charles-Henri and several others assisted. From the outside it was terrifying, but from the inside it was almost farcical. France ’s last regicide had been in 1610, and the  ...\n  Nicolas-Charles-Gabriel retired after the Damiens execution, it apparently being one step too far for him. Charles-Henri, on the other hand, seems to have had the opposite reaction. Far from putting him off his trade, the gruesome event inured him to it. No other job could be so bad after it. That wasn ’t to say it was smooth sailing. One notable incident came in 1766 when an old friend of his father ’s was the subject of “the work ”. Thomas Arthur, the comte de Lally, was a French nobleman  ...\n Thomas Arthur and Madame Tiquet were both high-born, which is why they rated decapitation as their method of execution. Most other criminals were hanged, though those whose crimes were considered more heinous rated more elaborate forms of death. Heretics were burned, counterfeiters were boiled alive and murderers faced being “broken on the wheel ”. They were lashed to a circular wheel and had their limbs broken with an iron bar before being finished off. As the more compassionate ideals of  ...\n  Leading the charge was Joseph-Ignace Guillotin, a doctor who had been elected as one of the deputies for Paris to the General Assembly in 1789. Guillotin was actually against the death penalty on principal, but thought that the first step would be to make the process as painless as possible. He proposed a motion that all death sentences should be decapitations carried out by mechanical means. The motion was passed. The decapitation machine was originally called a “louisette ”, after its designer  ...\n Charles-Henri Sanson was a huge advocate of the guillotine, though his motives may have been slightly selfish. Not only would it make his job a lot easier, but it would also mean that he would no longer need to maintain a vast array of execution tools. He took on the job of testing the prototype, starting with straw bales. These were followed by living sheep and then human corpses. The machine was declared a success and the first official guillotine was created by Tobias Schmidt, a maker  ...\n  At first glance, you might have expected the French Revolution to have been bad news for Charles-Henri. Here was a man who dealt out death on behalf of the upper classes, after all. He was well-paid; enough that his fancy green coats actually set a fashion at court. And he was descended from a noble family. But the Revolution was not the sudden violent upheaval that popular imagination portrays. It began with social reform, and it was middle-class artisans like the Sansons who were at the  ...\n It was no light thing to execute a king. When King Charles of England was executed, his executioner ’s identity was a closely held secret. And in validation of that secrecy, after the Restoration every member of Parliament who had voted for his execution was tracked down and themselves executed in far more tortuous fashion. Charles ’executioner had been either Irish or Scottish, too. [1] But the principles of the Republic meant that it was important to them that Louis be executed by a  ...\n  The execution took place in January of 1793. It was a gloomy damp morning, and reportedly the King was silent except for some prayers on his two-hour coach ride to the scaffold. Once he arrived there was some confusion, which led to a rumour that the king had tried to fight his way free. This wasn ’t true though, and apparently was due to the king ’s protests when he found out that his hands were to be bound with a length of rope. His confessor persuaded him (by pointing out that Jesus  ...\n That same blood now bound Charles-Henri Sanson to the Revolution, which had much more need of his services as the frenzy of execution known as “the Reign of Terror ”went into full swing. In the first half of 1793 the Committee of Public Safety took power, and over the course of the year the number of those sent to the guillotine grew larger and larger. The victims were not just nobles left over from the Revolution, now they included the political opponents of Robespierre and his cronies.  ...\n  The end of Robespierre led to the end of the Terror, as the new government sought to disassociate themselves from the excesses of the previous regime. The death penalty remained, however, and “th work ”continued. Charles-Henri Sanson retired in 1795, handing over his position to his younger son Henri. Both of Charles-Henri ’s sons had followed into his trade but the eldest and original heir, Gabriel, had died in a workplace accident several years earlier. While holding a head up to  ...\n In his retirement Charles-Henri retained a macabre celebrity. One famous story is that he was visited by Emperor Napoleon Bonaparte. Napoleon asked him if the people he had killed as an executioner weighed on his conscience. Charles-Henri joked:\n  Napoleon ’s response was not recorded. Charles-Henri continued in his retirement until 1806, when his ill-health caught up with him and he died. Henri continued as the High Executioner of Paris until 1839, when he was replaced by his own son Henri-Clement. Henri-Clement was the last Sanson to be an executioner, and the story of how he lost his job is somewhat sordid. He was always a spendthrift, and deep in debt he wound up either selling or pawning his guillotine, which dated back  ...\n  [1] There were three men who were picked as executioner, and only they knew which one wielded the axe. Famously one went to live in Galway afterwards where he used the money to establish a pub, amusingly titled “The King’s Head”.", "posttime": "2020-05-02 17:59:22", "tags": "皇家,henri,executioner", "title": "查尔斯-亨利·桑森，皇家刽子手(2018年)", "title_en": "Charles-Henri Sanson, Royal Executioner (2018)", "transed": 0, "url": "https://www.headstuff.org/culture/history/charles-henri-sanson-royal-executioner/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["皇家", "henri"]}, {"category": "", "categoryclass": "", "imagename": "d7dff94627b83a84f86a2a446193613d.jpg", "infoid": 1000213, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国国家航空航天局(NASA)周四授予三家公司建造能够让人类登上月球的航天器的合同，这引发了一场新的太空竞赛，NASA希望这将推动美国自1972年以来首次重返月球表面。\n杰夫·贝佐斯(Jeff Bezos)旗下的太空公司Blue Origin、弗吉尼亚州莱斯顿信息技术公司Leidos的子公司Dynetics，以及埃隆·马斯克(Elon Musk)的SpaceX赢得了合同，这给了NASA三个相互竞争的选择，因为NASA正在争先恐后地完成白宫的雄心勃勃的任务，即到2024年将人类送上月球。(贝佐斯拥有《华盛顿邮报》。)。\n波音公司，通常是NASA的主要承包商之一，但其太空计划经历了多次挫折和延迟，也提交了投标，但没有被选中。\n美国国家航空航天局局长吉姆·布里登斯廷在接受华盛顿邮报采访时表示，他仍然相信美国国家航空航天局能够在2024年的最后期限前完成飞行，尽管太空发射系统的首次飞行将再次推迟，这一次将推迟到2021年11月。太空发射系统是波音公司制造的将把宇航员送上月球的火箭。\n尽管如此，着陆器合同的宣布-这是自20世纪60年代阿波罗时代以来NASA授予的第一份月球航天器合同-是朝着让美国宇航员快速登月并建立NASA希望成为月球表面永久存在的目标迈出的重要一步。\n布里登斯廷说，登月“开始让人感觉非常、非常真实”。“这是非常令人兴奋的。自1972年以来，人们曾多次尝试重返月球，但均未实现。“。\n然而，目前还不清楚NASA的最新努力是否会实现，该努力以阿波罗的孪生姐妹的名字命名为“阿耳特弥斯”。\n为了让自己有更好的机会在2024年完成这一壮举，美国国家航空航天局改变了计划。最初，美国国家航空航天局(NASA)将把宇航员送到绕月轨道上的一个前哨，也就是众所周知的“门户”(Gateway)。从那里，它们会下降到月球表面。但现在NASA表示，虽然它仍然长期致力于Gateway，但很可能不会在下一次登月时使用它。\n相反，它打算将由洛克希德·马丁公司建造的猎户座航天器中的宇航员送到月球轨道，在那里它将与着陆器会合并对接，着陆器将把他们带到月球表面。不过，NASA官员表示，计划可能会改变。\n然而，要想让登月成为现实，NASA和白宫必须向持怀疑态度的国会推销他们的计划，国会尚未批准一项预计在2024年之前耗资350亿美元的计划。美国国家航空航天局(NASA)和SLS计划的主承包商波音公司(Boeing)也必须在火箭方面取得重大进展。政府问责局最近的一份报告说，尽管经过多年的发展，火箭“在装满燃料时可能会发生泄漏。“最近的另一份报告，由……。\n美国国家航空航天局(NASA)也在努力在急剧加快的时间表下到达月球。最初，它计划在2028年之前让人类登上月球。但副总统彭斯去年指示航天局在2024年之前“不惜一切必要手段”做到这一点。\nNASA载人航天负责人道格拉斯·洛弗罗(Douglas Loverro)在接受采访时表示，尽管存在许多挑战，但该计划是可以实现的。\n“这是第一大步，但这只是第一步，”他说。他说：“我们有很多工作要做。现在困难的部分开始了。要做到这一点，需要美国国家航空航天局(NASA)和业界最好的人才。“。\nNASA官员拒绝就波音不在名单上一事发表评论。这个航空航天巨头的损失是因为它不仅在SLS火箭上苦苦挣扎，而且在它正在开发的将NASA宇航员送到低地球轨道上的国际空间站的星际客机(Starliner)航天器上也遇到了困难。最近的一次没有机组人员的测试任务进行得如此糟糕，以至于该公司决定重新安排飞行。\n对于Blue Origin来说，授予合同是一次重大胜利。该公司由贝佐斯于2000年创立，多年来一直敦促航天局返回月球，特别是在南极，科学家在那里发现了冰形式的水。\n自2017年以来，Blue一直在推销其名为蓝月亮的着陆器，贝佐斯曾表示，他将亲自大举投资。贝佐斯说，去年，Blue Origin宣布编辑公司与洛克希德·马丁公司、诺斯罗普·格鲁曼公司和德雷珀公司合作开发了这个项目--“一个国家优先考虑的国家队”。“这是一种如此雄心勃勃的事情，需要与合作伙伴共同完成。”这是快速返回月球的唯一途径。我们不是要回月球参观的。我们要去..。\nBlue Origin的首席执行官鲍勃·史密斯(Bob Smith)在新闻发布会上表示，这一努力将“谦虚地站在阿波罗的肩膀上”。…。我知道我代表我们团队中的许多人说，登月是我们进入这一行业的原因，我们对此非常兴奋。\n美国国家航空航天局表示，蓝色起源号的项目进展最快，并授予它最大的奖金，5.79亿美元。Dynet", "note_en": "NASA on Thursday awarded three companies contracts to build spacecraft capable of landing humans on the moon, sparking a new space race that NASA hopes will propel the United States back to the lunar surface for the first time since 1972.\n Blue Origin, the  space outfit owned by Jeff Bezos; Dynetics, a subsidiary of Leidos, a Reston, Va.-based information technology firm; and  Elon Musk’s SpaceX won contracts, giving NASA three options that would compete against each other as NASA scrambles to meet an ambitious White House mandate to put humans on the moon by 2024. (Bezos owns The Washington Post.)\n Boeing, typically among NASA’s key contractors but whose space program has experienced multiple setbacks and delays,  also submitted a bid but was not selected.\n  In an interview with The Washington Post, NASA Administrator Jim Bridenstine said he remains confident NASA will be  able to meet the 2024 deadline, even though the first flight of the Space Launch System, the Boeing-built rocket that would launch astronauts to the moon, will be  pushed back again, this time to November 2021.\n  Still, the announcement of contracts for the landers — the first lunar spacecraft contracts NASA has awarded since the 1960s’ Apollo era — is a significant step toward getting the U.S. crews to the moon quickly and building what NASA hopes will become a permanent presence on the moon’s surface.\n A lunar landing is “starting to feel very, very real,” Bridenstine said. “It’s very exciting. There have been lots of attempts to go back to the moon since 1972, but none have materialized.”\n   It’s not clear yet, however, that NASA’s latest effort, dubbed “Artemis” after the twin sister of Apollo, will materialize, either.\n To give itself a better shot at pulling off the feat by 2024, NASA has changed its plans. Initially NASA was going to fly its astronauts to an outpost in orbit around the moon, known as the Gateway. From there, they would descend to the lunar surface. But now NASA says that while it remains committed to the Gateway for the long term, it will likely not use it for the next moon landing.\n  Instead it intends to fly  astronauts in the Orion spacecraft, built by Lockheed Martin, to lunar orbit, where it would meet up and dock with the lander, which would take them to the moon’s surface. Still, NASA officials said, the plan could change.\n  For a moon landing to become a reality, however, NASA and the White House must sell their plan to a skeptical Congress, which has not yet signed off on a program projected to  cost $35 billion through 2024. NASA and Boeing, the prime contractor on the SLS program, also must make significant progress on the rocket. A recent Government Accountability Office report said that despite years of development, the rocket “may develop leaks when it is filled with fuel. ”Another recent report, by the  ...\n  NASA also is struggling to get to the moon under a drastically expedited timeline. Initially it was planning to land humans on the moon by 2028. But Vice President Pence last year directed the space agency to do it by 2024 “by any means necessary.”\n  Despite the many challenges, the plan is attainable, Douglas Loverro,  NASA’s head of human spaceflight, said in an interview.\n  “This is a first giant step, but it’s only the first step,” he said. “We have so much work ahead of us. Now the hard part begins. And it’s going to take the best of NASA and the best of industry to get there.”\n NASA officials declined to comment on Boeing’s absence from the list. The loss for the aerospace behemoth comes as it has struggled not only with the SLS rocket, but with the Starliner spacecraft it is developing to fly NASA astronauts to the International Space Station in low Earth orbit. A recent test mission without crews onboard went so badly that the  company decided to refly the flight.\n  For Blue Origin, the contract award is a major victory. Founded in 2000 by Bezos, the company has for years been urging the space agency to return to the moon, specifically the south pole, where scientists have discovered water in the form of ice.\n  Blue has been pitching its lander,  called Blue Moon, since 2017, and Bezos has said he would invest heavily in it himself. Last year,  Blue Origin announcedit was teaming up on the project with Lockheed Martin, Northrop Grumman and Draper —“a national team for a national priority, ”Bezos said. “This is the kind of thing that ’s so ambitious that it needs to be done with partners. This is the only way to get back to the moon fast. We ’re not going back to the moon to visit. We ’re going  ...\n   Bob Smith, Blue Origin’s CEO, said at a news conference that the effort would “humbly stand on the shoulders of Apollo. … I know I speak for many on our team that going to the moon is the reason why we got into this business, and we couldn’t be more excited about that.&#34;\n NASA said that  Blue Origin was furthest alongwith its project and awarded it the largest award, $579 million. Dynetics, which has paired with the Sierra Nevada Corp., would receive $253 million and scored the highest marks, according to NASA ’s source selection document. SpaceX, which bid its Starship spacecraft, won $135 million. The contracts are for the first stage of the program and would last through February 2021. After that, NASA could decide whether to proceed with all three  ...\n  The award was the latest in a string of wins for SpaceX, which is poised to fly  NASA’s astronauts to the space station on May 27. NASA had previously awarded SpaceX a contract, worth as much as $7 billion, to resupply the Gateway with cargo.\n   During the news conference Musk said the announcement would ultimately help move humanity into deep space. “I think we’ve got potential for an incredibly exciting future in space, with a base on the moon and ultimately sending people and having a self-sustaining city on Mars,” he said.\n While the Gateway likely won’t be used for the next lunar landing, Bridenstine said the agency is “100 percent committed to the Gateway. That being said, we are also committed to going as fast as possible.”\n Bridenstine said SpaceX’s Falcon Heavy rocket could be used to launch the habitat and power and propulsion elements of an orbiting space station after they are assembled on the ground.\n  Though the astronauts would only be on the surface of the moon for a number of days, as in Apollo, the goal would be to study the region around the moon’s south pole to help NASA set up a permanent presence there. NASA is particularly interested in the ice discovered in the perpetually shadowed craters, and how it could be used to sustain life and even be converted into rocket fuel.\n  “I view this as learning to fly to the moon again and learning the right way so we can do it again and again,” Loverro said. “This is not a flash in the pan. It is the first step of many steps we’re going to take there.”", "posttime": "2020-05-02 17:59:18", "tags": "blue,nasa", "title": "SpaceX，Blue Origin，Dynetics赢得宇航员登月合同", "title_en": "SpaceX, Blue Origin, Dynetics win contracts to land astronauts on moon", "transed": 0, "url": "https://www.washingtonpost.com/technology/2020/04/30/jeff-bezos-elon-musk-win-contracts-spacecraft-land-nasa-astronauts-moon/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["blue", "nasa"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000212, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天，我得知我们将关闭Cliqz-我自2017年以来一直为其工作的公司。通过反思我在这段时间里学到了什么，以及我想为我的职业生涯带来的教训，我正在消化这个沉重的消息。\nCliqz是一家来自德国慕尼黑的科技公司。栗树环绕着我们的办公室。每周四我们大楼前都有一个当地的农贸市场。(错过了这个和烤鸡的味道，特别是现在在电晕锁定期间)。我们大约有70人，大部分是工程师。他们中的大多数被称为亚历山大、亚历山德拉、阿列克谢或亚历克斯。我们的咖啡机每两个月就坏一次--几乎与我们的后端时间相同。\n我们为自己设定了一个使命，那就是建立一种更好的方式来搜索和浏览互联网。我们决定不采取简单的方式来搭乘已经存在的技术。这意味着我们正在从头开始构建我们自己的搜索引擎。近七年来，我们一直在坚持不懈地工作。直到昨天。\nCliqz输掉了与谷歌的战斗。没有办法粉饰这件事。这种巨大的技术垄断没有给来自欧洲的以隐私为中心的小型竞争对手留下创新和提出新想法的空间。如果Cliqz没有参加战斗-还会有谁呢？如果我们从来没有尝试过改变一个系统或者想出一些新的东西，我们就永远不会做出改变。\n克利克斯的任务没有错。我们的技术没有错。我们只是没有足够的支持来完成它。\n这是一个警钟。亲爱的政界人士、投资者和消费者：支持那些支持你们的公司。帮助他们帮助你。\n无论是作为个人还是作为公司实体，我们都有选择。我会明智地使用我的。我现在比以往任何时候都更关注那些提供产品和服务的公司，这些公司希望为我们的民主、我们的星球和我们的经济做出积极的改变。我会尽力选择大卫而不是歌利亚。你会怎么做？\n当你像我在Cliqz担任品牌经理那样从事创造性的工作时，你的想法总是会遭遇挫折。我工作的很大一部分是想出新的想法--有时好得离谱，有时愚蠢透顶--来影响人们。一些次要的想法是：改变Cliqz的名字，改变浏览器的颜色来选择情人节的颜色，在色情网站上做广告(好的，那个做到了)。\n正如创造性工作的本质一样，总会有人不喜欢你的想法。那该怎么处理呢？\n首先，穿着他们的鞋子走一英里。从他们的角度来看。你能从这个感同身受的地方学到什么吗？其次，把你的注意力和精力集中在那些支持你想法的人身上，然后从那里开始。通常，兴奋会带来更多的兴奋。很快，你就会有更多的人加入进来，并通过有用的建议和反馈来推动你的想法。\n大多数为Cliqz工作的人都是各自领域的佼佼者--浏览器、搜索引擎、隐私。这些都是高度智能的技术专家。我在市场部工作。有时感觉我们说的是完全不同的语言。表情符号VS Python。\n我不习惯一家如此强烈受科技驱动的公司。我们创新是因为我们有能力。我们为我们的用户付出了额外的努力，因为这是正确的做法-即使没有人会注意到或欣赏它。\n愤世嫉俗的人可能会说，Cliqz之所以失败，是因为我们对技术的强烈热情，以及对业务发展缺乏动力。如果让我选择，我总是会选择与非常聪明--有时有点固执--的技术专家合作。他们的动机来自于诚实和真实的地方，而不是纯粹的利润和增长。\nCliqzer知道一件事：如何狂欢。我们非常幸运地拥有一支敬业的人才和文化团队，他们为我们举办了最令人难以置信的活动和派对。“我未来可能不会这么幸运了，但我学到的是：休息一下。”跳起舞来吧。多庆祝你的胜利，而不是沉溺于失败。带上你的同事出去走走。为你们的成就相互补充和欣赏。\n我非常感谢这次疯狂的骑行，感谢我的团队，对我来说就像一家人一样。我感谢无畏、诚实和脆弱的领导，特别是来自营销主管科琳娜·克里斯托(Corina Cristal)的领导。我在克里茨身上倾注了太多心血，我一点也不后悔。这就是我未来想要的工作方式：带着激情、同理心和一个似乎太大的挑战。", "note_en": "Yesterday, I learned that we’re closing down Cliqz—the company I worked for since 2017. I’m digesting this heavy news by reflecting on what I learned during this time and the lessons I’d like to carry with me for my career.\n  Cliqz is a tech company from Munich, Germany. Chestnut trees surround our office. Every Thursday there’s a local farmers’ market in front of our building. (Missing this and the grilled chicken smell especially now during Corona lock-down). We’re around seventy people—mostly engineers. Most of them are called Alexander, Alexandra, Alexei, or Alex. Our coffee machine breaks every two months—about the same time as our backend.\n  We set for ourselves the mission to build a better way to search and browse the Internet. We decided against the easy way to piggyback on already existing technology. Which means that we’re building our very own search engine from scratch. For almost seven years, we’ve been relentlessly working on it. Until yesterday.\n    Cliqz lost the fight against Google. There’s no way to sugarcoat this. This gigantic tech monopoly left no room for a small, privacy-centric competitor from Europe to innovate and bring up new ideas. If Cliqz is not taking up the fight — who else is? If we never even try to change a system or come up with something new, we’re never going to make a change.\n  Cliqz’s mission wasn’t wrong. Our technology wasn’t wrong. We just didn’t have enough support to pull it off.\n This is a wake-up call. Dear politicians, investors, and consumers:  Support companies that support you. Help them to help you.\n We all have choices, as individuals and as corporate entities. I will use mine wisely. My attention will now more than ever go to companies that offer products and services that want to make a positive change, for our democracy, for our planet, for our economy.  I’ll try my best to pick David over Goliath. What will you do?\n   When you work in a creative role like I did at Cliqz as a Brand Manager, you’ll always experience pushbacks on your ideas. A big part of my job was to come up with new—sometimes weirdly good and sometimes plain stupid—ideas to reach people. Some of the back-burner ideas were: Changing the Cliqz name, turning the browser colors to pick for Valentine’s day, advertising on porn websites (okay, that one made it).\n As the nature of a creative job is, there will always be people who don’t like your idea. How to deal with that?\n  First, walk a mile in their shoes. See it from their perspective. Is there something you can learn from this place of empathy? Secondly, focus your attention and energy on the people who are in favor of your idea and take it from there. Usually, excitement creates more excitement. Soon enough, you’ll have many more people joining in and fueling your idea with useful recommendations and feedback.\n   Most people who work for Cliqz are the very best in their field—browsers, search engines, privacy. These are highly intelligent tech experts. I worked in the Marketing department.  Sometimes it felt like we were speaking entirely different languages. Emoji vs. Python.\n  I wasn’t used to a company that is so strongly driven by tech. We innovated because we could. We went the extra mile for our users because it was the right thing to do—even if nobody would ever notice or appreciate it.\n  A cynic might say that Cliqz failed because of our strong passion for technology and a missing drive from business development. If I were presented with the choice, I’d always choose to work with highly intelligent—sometimes a bit stubborn—tech experts. Their motivation comes from a place of honesty and authenticity and is not driven by pure profit and growth.\n    Cliqzers know one thing: How to party. We were incredibly lucky to have a dedicated Talent and Culture team that pulled off the most incredible events and parties for us. I will probably not be this lucky in the future but what I learned is:  Take a break. Dance it off. Celebrate your victories more than you wallow your failures. Grab your colleagues and go for walks. Complement and appreciate each other for your achievements.\n  I’m incredibly thankful for this crazy ride and my team that feels like a family to me. I’m thankful for fearless, honest, and vulnerable leadership, especially from the Marketing leader Corina Cristal. I poured so much of myself into Cliqz and I’m not regretting any of it. This is the way I’d like to work in the future:  With passion, empathy, and a challenge that seems way too big.", "posttime": "2020-05-02 17:59:04", "tags": "cliqz", "title": "Cliqz正在关闭", "title_en": "Cliqz is shutting down", "transed": 0, "url": "https://www.linkedin.com/pulse/what-i-learned-cliqz-victoria-gassmann/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["cliqz"]}, {"category": "", "categoryclass": "", "imagename": "bc487c9fe8f6365a55042d5603ca3a3b.jpg", "infoid": 1000211, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我开始使用Kubernetes和Infrastructure as Code时，我很快发现我需要一个秘密管理解决方案，但当我在谷歌上搜索时，似乎并没有就一种可以普遍适用于所有情况的最佳实践方法达成坚实的共识。因此，今年早些时候，我为自己设定了一个目标，要发现现有的应用程序和基础设施机密管理解决方案，提出我认为最好的解决方案，并培养对它的实际掌握。在追寻的同时。\n大多数人对云知识管理系统是什么或做什么缺乏技术和通俗的理解。\n这些人没有意识到，虽然在过去没有安全的方式在Git中存储加密的秘密，但从那时起，加密技术已经发展起来，现在可以在Git中安全地存储加密的秘密，这要归功于AWS KMS、Azure KeyVault或GCP KMS等云提供商KMS解决方案。\nVault的大部分炒作是有根据的，因为几十年来一直没有好的秘密管理解决方案，然后是Terraform制造商的Vault，它具有内置的秘密轮换，随着时间的推移进行积极维护，拥有出色的文档、支持和社区，并且Vault是唯一符合我对理想秘密管理解决方案的要求的*解决方案。我说保险库被夸大了，因为我经常看到它被推荐为治疗所有应该适用于所有人的黄金标准…。\n通过REST API或独立于平台的CLI二进制文件与任何技术堆栈完美集成。(如果它与Terraform、Ansible、Kubernetes和CICD管道顺利集成，则可获得额外奖励)。\n面向未来的大型社区或长期维护的历史(我不想要废弃软件，除非它可能是永恒的/功能完整的废弃软件，如Unix Utilities)。\n真正安全(我应该能够让任何安全负责人相信它是防弹的，足以通过安全审计。)。\n支持粒度ACL+开发人员机密创建自助服务选项项目级隔离：项目A的运营人员不应该看到项目B的生产机密。\n版本化的机密(可协助过渡和自动化、部署、回滚和支持技术债务方案，其中机密和配置交织在配置文件和数据库连接字符串中。)。\n*注：Mozilla sops也符合我的要求，但我当时并没有意识到这一点，因为我原本以为做git加密的秘密没有安全的方法。\n许多工具涉及将解密密钥存储在用户的主目录或密钥环中，这导致加密数据和密钥在同一台机器上。\n在这种情况下，泄露的解密密钥在统计上是不可避免的(漏洞乘以repo的克隆数乘以时间)。\n不可能撤销泄露的解密密钥。如果您担心解密密钥可能已经被泄露，但它被泄露的可能性很低，那么由于git的分布式历史记录，撤销密钥是不可行的。即使您可以清除GIT服务器的历史记录，并使用新的加密密钥重新加密所有秘密，仍将存在可以使用旧密钥解密的repo的历史克隆。\n如果怀疑有妥协的可能，唯一可行的对策是轮换所有的证书，这是一项昂贵的操作，管理层通常不愿凭直觉放弃。\n一些git加密工具是步枪解决方案：运行命令解密机密，然后在将其推送到repo之前忘记加密。\n每当我找到秘密管理解决方案时，我都会注意到我可以将其分为4个主要类别：\n具体到单一的技术堆栈(Ansible、Chef、Puppet、Salt、Jenkins)(我出于2和5个原因而不考虑这些)。\n使用您自己的Secrets Management Service(有几个潜在可行的选项，但是每个选项都引入了它自己的复杂性，所以专注于一个是有意义的。Hashicorp的Vault显然是赢家，因为它有许多功能、文档、大型社区以及长期支持和开发的记录。)。\n完成分析后，我花了一个月的空闲时间在用于存储静态机密的Vault服务器上工作，以帮助我掌握Vault的工作原理，我希望它安全、易于维护和易于使用。为此，我尽了最大努力启用TLS，将Vault配置、角色、策略和Kubernetes Infrastructure作为高可用性Vault/Consul集群的代码添加到GIT资源库中，使用KMS自动解封，编写良好的自述文档，启用版本化的键值存储，.。\n金库仍然需要一个地方来储存它的秘密。(Vault将其基础设施作为代码机密存储在哪里？KMS自动解封的HTTPS证书和IAM密码)。\n保险库在很多方面都很昂贵。(您必须支付基础设施和存储费用。这还不够简单，你可以从头开始设置它，编写一份自述文件，并在一小时内培训几个人如何使用它，使用基础设施作为代码和预制的自述文件", "note_en": "When I started working with Kubernetes and Infrastructure as Code, I quickly found out that I needed a secrets management solution, but when I googled around there didn ’t seem to be a solid consensus on a best practice approach that could be universally applied to all situations. So, earlier this year I set a goal for myself to discover what application and infrastructure secret management solutions exist, come up with which one I thought was best and develop a working mastery of it. While pursuing  ...\n  The majority of people don’t have a technical to layman’s-terms understanding of what a Cloud KMS is or does.\n Those same people don’t realize that although in the past there was no safe way to store encrypted secrets in Git, Cryptography has evolved since then, and now safely storing encrypted secrets in Git is possible thanks to Cloud Provider KMS Solutions such as AWS KMS, Azure KeyVault, or GCP KMS.\n Most of Vault ’s hype is warranted as for decades there were no good secrets management solutions, and then here comes Vault from the makers of Terraform, with built-in secrets rotation, actively maintained over time, with great docs, support, and a community, and Vault was the only* solution that met my requirements for what the ideal secrets management solution looks like. I say Vault ’s overhyped because I often see it recommended as the gold standard cure all that should be applied to all  ...\n  Integrates nicely with any tech stack via REST API or platform independent CLI binaries. (Bonus if it has smooth integrations with Terraform, Ansible, Kubernetes, and CICD Pipelines)\n Future Proof Large Community or a history of being maintained over time (Don’t want abandonware, unless it’s could be timeless/feature complete abandonware like Unix Utilities)\n Truly secure (I should be able to convince any security head that it’s bulletproof enough to pass a security audit.)\n Support for Granular ACLs + Dev secret creation self-service options Project level isolation: Ops of project A, shouldn’t see project B’s prod secrets.\n Versioned secrets (Can assist with staging and automating, deployments, rollbacks, and supporting technical debt scenarios where secrets and configuration are intertwined in config files and database connection strings.)\n *Note: Mozilla SOPS also met my requirements, but I didn’t realize it at the time because I originally thought there was no safe way to do git encrypted secrets.\n  Many tools involve storing the decryption key in the user’s home directory or keyring, which leads to the encrypted data and the key being on the same machine.\n In that scenario compromised decryption keys are a statistical inevitability (Vulnerabilities multiplied by clones of the repo multiplied by time)\n It’s impossible to revoke a leaked decryption key. If you’re worried a decryption key could have been compromised, but the probability that it was compromised is low, revoking the key isn’t an option, due to git’s distributed history. Even if you could purge the history of the git server and re-encrypt all the secrets with new encryption keys, there would still exist a historic clone of the repo that could be decrypted with the old key.\n If a compromise is suspected the only viable countermeasure is to rotate all the credentials, which is an expensive operation that management usually isn’t willing to back on a hunch.\n Some of the git encryption tools are footgun solutions: Run command to decrypt secret, then forget to encrypt it before pushing it up to the repo.\n Whenever I found a secrets management solution I noticed I could group it into 4 main categories:\n Specific to a single tech stack (Ansible, Chef, Puppet, Salt, Jenkins) (I dismissed these for reasons 2 and 5)\n  Roll your own Secrets Management Service (There were a few potentially viable options, but each introduced it’s own complexity so it made sense to focus on one. Hashicorp’s Vault was the clear winner given its number of features, documentation, big community, and track record for long term support and development.)\n With my analysis complete, I spent a month of spare time working on a Vault Server for storing static secrets to help me gain a working mastery of Vault, I wanted it to be secure, easy to maintain, and easy to use. I did my best to achieve this by enabling TLS, adding Vault Configuration, Roles, Policies, and Kubernetes Infrastructure as Code for a highly available Vault/Consul Cluster to a git repo, using KMS auto unseal, writing good readme documentation, enabling versioned key-value store,  ...\n  Vault still needs a place to store its secrets. (Where does Vault store its Infrastructure as code secrets? HTTPS cert and IAM password for KMS Auto Unseal)\n Vault ’s very expensive in more ways than one. (You have to pay for infrastructure and storage. It ’s not simple enough that you could set it up from scratch, write a readme, and train a few people on how to use it within an hour, using Infrastructure as Code and a premade readme in a git repo can help, but even then there ’s still a lot to learn. Ops will need to spend time maintaining it with backups, upgrades, and monitoring. Devs need to spend time writing custom wrapper scripts to  ...\n Vault makes life harder for people who need to store secrets, so they’ll avoid using it, which hurts its goal of being a central secrets repo. (Devs need to learn several new commands to interface with Vault or rely on slow Vault GUIs. The majority of preexisting tools are designed to interface with files on a file system. So using tools like vimdiff now require extra steps of logging in, fetching the secret, converting it to a file, and removing the file when done.)\n The default implementation has a security vulnerability that ’s expensive to secure. (If someone gets root access to a Vault Server, they can get the master decryption key by doing a memory dump. Hosting Vault on Kubernetes or Cloud VMs leads to more opportunities to get root access. In order to fully mitigate the risk of root access, you ’d need to provision machines with Intel Software Guard Extensions, and run your Vault Servers on those in SCONE Security Enclaves (containers running  ...\n Given these drawbacks, I decided to dive deeper and research further, that research lead me to  Soluto’s Kamus where I was introduced to 2 cool concepts: GitOps and zero-trust secrets encryption. That got me leaping through a rabbithole of encryption techniques. At the end of the journey I came up with the following mental schema.\n         KMS is a trusted service that encrypts and decrypts data on behalf of clients, it basically allows a user or machine to encrypt and decrypt data using their identity instead of encryption/decryption keys. (A client authenticates against a KMS, which checks their identity against an ACL, if they have decryption rights, the client can send encrypted data in a request to the KMS, which will then decrypt the data on behalf of the client, and send the decrypted data back to the client over  ...\n   KMSs are extremely secure, they make it feasible to go a decade without leaking decryption keys. KMS encryption technique’s invention introduced 3 killer pieces of functionality: When responding to a known breach: Before KMS decryption keys would get leaked: you can ’t revoke a decryption key, which means you ’d need to rotate several decryption keys, re-encrypt all data with the new keys, and try your best to purge old encrypted data. While doing all of this you ’ll need to fight with  ...\n Management of encrypted data shifts from an impossible task involving distributed decryption keys, to a trivial task of managing a centralized ACL. It now becomes possible to easily revoke, edit, and assign granular access to encrypted data; and as a bonus since Cloud KMS, IAM, and SSO Identity Federations integrate  ...\n Crypto Anchoring techniques become possible: Network ACLs can be applied to KMS to make it so data can only be decrypted in your environment.\n KMS decryption rates can be monitored for a baseline, when an anomalous rate occurs, alerts and rate limiting can be triggered.\n  Opportunities for decryption keys to get leaked are near zero because clients don’t interact directly with decryption keys.\n Cloud Providers can afford to hire the best security professionals and implement expensive operational processes that are required to keep the backend systems as secure as possible, so backend key leakage opportunities are also near zero.\n My new understanding of advanced encryption techniques lead me to realize that KMS could be leveraged to prevent decryption keys from being leaked. That plus the ability to revoke decryption rights without needing to make any changes to encrypted files makes truly secure encrypted files in Git a reality. I revisited a few Git based encryption solutions I ’d previously dismissed and discovered that Mozilla SOPS satisfied all of my criteria for an ideal secrets management solution. It  ...\n    One of the footguns in other Git based encryption solutions was that someone could accidentally push a decrypted secret to the git repo. With SOPS when you want to edit a file, the file stays encrypted on disk, gets decrypted in RAM where you can edit it with vim, and when you save the edited file it gets re-encrypted before being written to disk. At the same time, it does offer the flexibility to quickly decrypt a few files so you can use a tool like vimdiff.\n  It doesn’t require infrastructure and it’s as cheap as KMS. You could easily set it up, train a few people, and write a readme file within an hour, here’s an example of how easy it is to setup and use:\n        This will open the vim editor so you can type what you want to store in the secret. This simple command is used to both create and edit files.\n     SOPS will use your AWS credentials stored in  ~/.aws to authenticate against KMS so you can encrypt and decrypt without a password. SOPS will also recursively look for .sops.yaml files so it’ll auto discover metadata about how it should encrypt and decrypt things, which has two important ramifications: first, a user doesn’t have to learn a ton of commands or flags. Second, an additional  .sops.yamlfile can be added to a subfolder representing a production environment or different project,  ...\n SOPS encourages workflows patterns that make life easier. Devs can store their secrets encrypted right next to and in sync with the version of the code that uses it. Secrets management suddenly gains all the benefits of git: auditable change management, peer reviews via pull requests, diffs of edits to secrets are meaningful because only edited values will get updated on edits, vs the entire file getting re-encrypted, this also makes merge conflicts less likely. Consistency and  ...\n Hashicorp Vault will have trouble achieving its goal of being a centralized secret repo for your organization because users will find it hard to use, devops will find it troublesome to maintain, and management could find it expensive. SOPS, on the other hand, is pain-free to use, easy to learn, cheap to maintain, and supports workflow patterns that make life easier! These things together mean as long as someone can pitch it to the organization, there will be no barriers to adoption,  ...\n I’d like to clarify that the purpose of this article isn’t to say Vault’s bad and you should use SOPS and KMS instead. I wrote this article for 3 reasons: One, I love to teach. Two, I wanted to point out some shortcomings of Vault. Three, KMS with SOPS is an amazing combo that’s massively underrated: no one seems to know about it, I never encountered a proper explanation of either during my research, and according to  Google Trendsthere are not many searches of SOPS compared to  ...\n I ’d like to end this article by saying that I wholeheartedly recommend everyone learn SOPS, KMS, and Vault. Why learn Vault if it ’s hard and SOPS with KMS does the same thing with ease? Two reasons really: One, Vault is among the best in class when it comes to PKI and secrets rotation, both of which can be needed to satisfy many government and banking security compliance standards. Two, Vault gets easier to use every year: The community has accepted it as a clear winner and  ...", "posttime": "2020-05-02 17:58:58", "tags": "sops,机密,vault", "title": "Mozilla sops with KMS和Git被低估(2019年)", "title_en": "Mozilla SOPS with KMS and Git is underrated (2019)", "transed": 0, "url": "https://oteemo.com/2019/06/20/hashicorp-vault-is-overhyped-and-mozilla-sops-with-kms-and-git-is-massively-underrated/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["sops", "机密", "vault"]}, {"category": "", "categoryclass": "", "imagename": "b6b334717a87d419b8e50ceab9f1d1e6.jpg", "infoid": 1000210, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Google Cloud Data Catalog是一个完全托管且可伸缩的元数据管理服务。它可以帮助您的组织从一个简单的界面快速发现、了解和管理您的所有数据。Data Catalog可从Google Cloud控制台内访问，无需任何前期设置即可立即访问数据发现。\nData Catalog服务现已全面推出，在全球23个不同地区提供区域化服务。除了针对潜在中断提供更高的恢复能力外，区域化服务还在每个支持的区域提供静态元数据驻留，同时提供分布在多个区域的所有数据资产的统一视图。\n如今，大多数组织都在处理数量庞大且数量不断增加的数据资产，并且希望开放对这些数据的访问，以便业务用户可以通过自助服务找到合适的数据资产。过去的方法无法扩展，需要繁琐的设置，并且不能为所有人提供轻松的数据发现。\n在Google，我们也面临着针对大型且不断增长的数据资产的挑战，并构建了一个内部数据目录服务，以帮助为所有数据用户带来全面的元数据管理。您可以看到更多用于在商品中构建有效数据目录的技术：组织Google的数据集。data Catalog建立在此基础上，为所有Google Cloud用户提供可伸缩的托管服务，用于BigQuery、Pub/Sub和Cloud Storage中的数据。以下是有关Data Catalog如何.。\n自动同步技术元数据技术所有Google BigQuery数据资产(如数据集、表和视图)的技术元数据将持续同步到data Catalog中。这意味着您可以立即开始使用Data Catalog，不需要处理任何繁琐的设置。Data Catalog还自动同步来自发布/订阅的技术元数据和来自云存储的用户创建的文件集。这些文件集很容易创建-您只需指定一个带有通配符的模式，并将其应用于存储桶。一个文件集..。\n技术元数据与业务元数据技术元数据指源系统中可用的元数据。BigQuery表的技术元数据包括表名、表描述、列名、列类型、列描述、创建日期、最后修改日期等。对于发布/订阅，技术元数据指的是发布/订阅主题名称和创建日期。对于云存储文件集，技术元数据是指文件集名称、用于创建文件集的模式、创建.。\n业务元数据是指对业务和运营目的至关重要但在技术元数据中不可用的元数据的集合。业务元数据可能包括特定数据资产的负责人、数据资产是否包含个人身份信息(PII)、数据是否被批准用于官方用途、数据资产的数据保留策略、数据资产的生命周期阶段、数据质量分数、任何已知的数据质量问题，或者.。\n只需在Google Cloud项目中启用data Discovery data Catalog，就可以从该项目中使用它。data Catalog不仅发现启用API的项目中的数据资产，而且发现跨所有项目和所有地区的数据资产。对BigQuery、Pub/Sub和Cloud Storage之外的数据资产的支持在data Catalog路线图中，而对非Google Cloud数据源的支持则通过开源连接器提供(见下文)。\n只需键入关键字并查找所有匹配的数据资产，即可使用Data Catalog搜索所有数据资产。您还可以缩小搜索范围，以在特定项目、系统、数据资产类型或在特定时间段创建的数据资产中查找数据资产。\n对于Google业务元数据的结构化标记，我们认为，简单的字符串标记一旦广泛使用，就不足以捕捉丰富的业务元数据。使用Data Catalog，您可以创建具有如下结构的标记：每个标记包含多个属性，并且每个属性属于String、Double、Boolean、Enumerated和DateTime类型之一。创建结构化标签是一个分两步进行的过程。首先，在标记模板中定义标记的结构，然后使用.创建标记。\n如下所示，数据资产上的结构化标签为所有数据用户提供了丰富的业务元数据。作为数据分析师或数据科学家，您可以搜索特定的标记，并通过标记集合提供的业务上下文更好地理解您的数据资产。作为数据管理员或数据调控者，您可以通过使用有关数据质量和数据治理的元数据来更好地管理数据资产。\n元数据目录访问控制与云身份与访问管理(Cloud IAM)集成。所有操作(包括搜索数据发现)都根据适用的访问控制规范提供服务。如果用户A已读取", "note_en": "Google Cloud  Data Catalog is a fully managed and scalable metadata management service. It can help your organization quickly discover, understand, and manage all your data from one simple interface. Accessible from within the  Google Cloud console, Data Catalog allows immediate access to data discovery without requiring any upfront setup.\n The Data Catalog service is now generally available, providing regionalized service in 23 different regions globally. In addition to providing higher resilience against potential outages, the regionalized service delivers metadata residency at rest in each of the supported regions while providing a unified view of all data assets distributed across multiple regions.\n Most organizations today are dealing with a large and growing number of data assets, and want to open up access to that data so business users can find the right data assets through self-service. Past approaches have failed to scale up, required tedious set up, and did not deliver easy data discovery for all.\n At Google, we also faced this challenge for large and growing data assets, and built an internal data catalog service to help bring comprehensive metadata management to all data users. You can see more about the techniques used to build an effective data catalog in  Goods: Organizing Google’s Datasets. Data Catalog builds on that foundation, bringing a scalable managed service to all Google Cloud users for data within BigQuery, Pub/Sub, and Cloud Storage. Here are some details on how Data Catalog  ...\n Auto-syncing technical metadata Technical metadata for all  Google BigQuery data assets like datasets, tables, and views is synced into Data Catalog on a continuous basis. This means you can start using Data Catalog instantly and don’t need to deal with any tedious setup. Data Catalog also auto-syncs technical metadata from  Pub/Sub and user-created filesets from  Cloud Storage. These filesets are simple to create —you just need to specify a pattern with wildcards and apply it to a bucket. A fileset  ...\n  Technical metadata vs. business metadata Technical metadata refers to metadata that is available in the source system. Technical metadata for a BigQuery table includes table name, table description, column names, column types, column descriptions, creation date, last modification date, and more. For Pub/Sub, technical metadata refers to Pub/Sub topic names and date created. For Cloud Storage filesets, technical metadata refers to the fileset name, the pattern used for creating the fileset, creation  ...\n Business metadata refers to the collection of metadata that is critical for business and operational purposes but is not available in technical metadata. Business metadata might include the person responsible for a particular data asset, whether the data asset contains personally identifiable information (PII), if the data is approved for official use, the data retention policy for the data asset, the life cycle stage of the data asset, the data quality score, any known data quality issues, or  ...\n Data discovery Data Catalog can be used from a Google Cloud project by simply enabling it in that project. Data Catalog discovers data assets that are located not only in the project where the API is enabled but across all projects and across all regions. Support for data assets outside of BigQuery, Pub/Sub and Cloud Storage are in the Data Catalog roadmap, while support for non-Google Cloud data sources are available through open-source connectors (see below).\n You can use Data Catalog to search for all your data assets by simply typing a keyword and discovering all matching data assets. You can also narrow down your search to locate data assets in specific projects, systems, types of data assets, or data assets created during specific time periods.\n  Structured tags for business metadata At Google, we believe that simple string tags, once used widely, are no longer sufficient to capture the richness of business metadata. With Data Catalog, you can create tags with structure such that each tag contains multiple attributes, and each attribute is of one of the types  string, double, boolean, enumerated, and  datetime. Creating structured tags is a two-step process. First, define the structure of your tag in a tag template, then create tags with  ...\n As illustrated below, the structured tags on data assets provide rich business metadata to all data users. You as a data analyst or a data scientist can search for specific tags and better understand your data assets with the business context provided by the collection of tags. You as a data curator or a data governor can better manage data assets by using the metadata on data quality and data governance.\n  Access control for metadata Data Catalog is integrated with Cloud Identity and Access Management (Cloud IAM). All operations, including search for data discovery, are serviced in accordance with the applicable access control specifications. If user A has read access to a data asset and user B does not have any access to that data asset, a search carried out by user A reveals the data asset, while the same search carried out by user B does not return the data asset.\n Metadata can be sensitive in nature and data governance teams might want certain business metadata tags to be visible only to select groups of users. Data Catalog provides access control on templates, and the access control extends to all tags created using that template.\n Auto-tagging PII data with Cloud DLP Data Catalog’s integration with Cloud Data Loss Prevention (Cloud DLP) enables users to run Cloud DLP inspection jobs on BigQuery and  automatically create Data Catalog tags for identifying PII data. You can find this in the Cloud DLP interface. You can also refer to the Google tutorial  Create Data Catalog tags by inspecting BigQuery data with Cloud Data Loss Prevention and use the accompanying  source code.\n  Data Catalog support for non-Google Cloud data assets The Data Catalog API supports ingestion of technical metadata from non-Google Cloud data assets as well. The open-source connectors are organized in four Google Cloud Github repositories:  datacatalog-connectors contains the common components for all connectors;  datacatalog-connectors-rdbms has connectors for Oracle, SQL Server, Teradata, Redshift, PostgreSQL, MySQL, Vertica, and Greenplum;  datacatalog-connectors-bihosts connectors for Looker  ...\n  You can attach structured metadata tags on the Data Catalog entries for data assets that reside outside of Google Cloud. The single interface of Data Catalog lets you discover, annotate, and manage all your data assets.\n Next steps with Data Catalog  Data Catalog is now GA and provides self-service data discovery at scale to enterprise users across all regions. Getting started with Data Catalog couldn’t be easier, as it does not require any setup to quickly discover, understand, and manage all your data in Google Cloud and supports ingesting on-premises metadata from non-Google Cloud data sources. Learn more about  Data Catalog, check out our  comprehensive documentation, or try the  Quickstart guide.", "posttime": "2020-05-02 17:58:54", "tags": "data,数据", "title": "使用Data Catalog发现、了解和管理您的数据，GCP现已正式上市", "title_en": "Discover, understand and manage your data with Data Catalog, now GA In GCP", "transed": 0, "url": "https://cloud.google.com/blog/products/data-analytics/data-catalog-metadata-management-now-generally-available", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["data", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000209, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何推动像AWS Lambdanan这样的技术的东西都需要非常快。它需要是安全的。虽然AWS本可以采用现有技术，但为了满足这两个主要要求，他们选择了构建新的“鞭炮”(Firecracker)，既快速(它可以在125ms内引导Linux并开始执行用户空间进程)又安全，它使用硬件虚拟化等技术将一个Lambda环境与另一个环境隔离开来。在这篇文章中，我们将深入探讨如何……。\n虽然阅读大量源代码并弄清楚引擎盖下发生的事情当然很有趣，但这不如启动您最喜欢的编辑器并在Linux下创建一个轻量级虚拟机环境那么有趣。使用Sparkler，将构建一个虚拟机监视器(VMM)来管理虚拟机，同时为其运行的虚拟机提供特定的环境。我们还将编写一个在虚拟机内部运行的小型“操作系统”。VMM模拟..。\n如果您想了解KVM是如何工作的，同时熟悉示例代码，我建议您阅读这篇关于Sparkler的文章。\n运行未经修改的操作系统，特别是源代码不可用的操作系统，意味着虚拟机必须非常类似于真实的PC。QEMU或Virtual Box确实使用KVM来尽可能加快来宾速度，但它们也使用BIOS例程、各种传统设备和外围设备(如显卡、声卡和存储卡)来模拟真实的PC。这就是为什么很容易运行现成的MS-DOS、Microsoft Windows或二进制Linux发行版(如Fedora或Ubuntu)的原因。\n但是，对于这些传统设备和其他设备，KVM直接对它们的支持非常有限。此外，当操作系统引导时，引导加载程序通常依赖BIOS例程来处理屏幕、键盘和磁盘等硬件。例如，QEMU使用SeaBIOS作为其BIOS固件的选择，并且附带SeaBIOS。如果没有BIOS例程，它就不是一台真正的PC，这将阻止它运行现成的操作系统。\n最重要的收获是，有很多遗留代码，如BIOS和成熟外围设备的仿真，在设计为尽可能接近地仿真PC的虚拟化系统中，这些代码相对非常慢。\n当PC启动时，CPU处于实模式或16位模式。BIOS运行开机自检或开机自检，将引导加载程序从指定的引导设备读取到RAM中的设置位置，并将控制权移交给它。引导加载程序通常使用BIOS例程来显示文本、读取磁盘、获取系统信息等。\n事实证明，Linux内核根本不需要BIOS例程。执行此操作的是引导加载程序。Linux有所谓的“引导协议”，它告诉引导加载程序或引导时存在的任何其他程序，如何布局内核和RAM中的支持数据结构，以及如何将控制权传递给内核。对于x86体系结构，引导协议可用于实模式、32位和64位模式。\n因此，就像我们将监控程序二进制文件加载到分配的客户内存中一样，Firecracker加载Linux内核，按照Linux内核引导协议设置所需的数据结构，如初始栈、命令行参数。请参见Firecracker Git Repo中的以下文件：\n这样就不需要在引导过程中加载任何BIOS例程。这通过消除启用引导加载程序或根本不需要BIOS例程所需的所有复杂性，简化了虚拟机的设计。\n在小型Sparkler监视器程序中，也没有使用任何BIOS例程。另外，因为根本没有BIOS。例如，printstr例程使用out x86指令输出字符，这会导致VM退出。这些出口由Spakler程序处理，该程序使用putc()库函数将字符显示到终端上。类似的事情也发生在“爆竹”中。通过内存映射为Linux内核设置了一个虚拟串行控制台.。\n“爆竹”的另一个聪明之处在于，它运行Linux内核的虚拟机只有很少的设备。x86上的Linux假定存在中断控制器和间隔计时器。这些都是非常基本的，因为CPU没有内置这些。虽然可以在VMM中模拟这些设备，但KVM提供了一种更好的替代方法。它能够在内核中为您模拟它们。这是件大事。请记住，只要没有VM.。\n如果您查看由Firecracker模拟的PS/2键盘控制器的源代码，您会注意到它非常稀疏，并且它只实现了一个主函数rigerctrl_alt_del()，这非常不言而喻。\nVirtIO需要更多的解释。真正的硬件设备有各种各样的怪癖，而且编程相当复杂", "note_en": "Anything that powers technology like  AWS Lambdaneeds to be really fast. And it needs to be secure. While AWS could have gone with existing technology, to satisfy both these main requirements, they went with building something new, Firecracker, that is both really fast –it can boot Linux and start executing user space processes in 125ms –and secure –it uses hardware virtualization and more to isolate one Lambda environment from the other. In this article, we ’ll take a deep dive and look at how  ...\n   While it certainly is fun to read a lot of source code and figuring out what is going on under the hood, it is not as much fun as firing up your favorite editor and whipping up a lightweight virtual machine environment under Linux. With  Sparkler, will build a virtual machine monitor (VMM) that manages a virtual machine while providing a certain environment to the virtual machine, which it runs. We will also write a tiny “operating system ”which will run inside the virtual machine. The VMM emulates  ...\n If you are interested in understanding how KVM works while getting your hands dirty with example code, I recommend you read this  article on Sparkler.\n  Running unmodified operating systems, especially ones for which source code isn ’t available means that the virtual machine has to very closely resemble a real PC. QEMU or Virtual Box do use KVM to speed up guests as much as possible, but they also emulate a real PC with BIOS routines, various legacy and peripheral devices like graphics, sound and storage cards. This is why is is easy to run off-the-shelf versions of MS-DOS, Microsoft Windows or binary Linux distributions like Fedora or Ubuntu  ...\n But, as for these legacy and other devices, KVM directly has very limited support for these. Also, when operating system boot, the boot loader usually depends on BIOS routines to deal with hardware like the screen, keyboard and disks. QEMU uses  SeaBIOS as its choice of BIOS firmware, for example and it ships with it. Without BIOS routines being present, it wouldn’t be a real PC and this will stop it from running off-the-shelf operating systems.\n The most important takeaways are that there is a lot of legacy code like the BIOS and emulation of full-blown peripherals, which is relatively very slow in virtualization systems that are designed to emulate a PC as closely as possible.\n  When a PC starts, the CPU is in real mode or 16-bit mode. The BIOS runs the power-on self-test or POST, reads in the boot loader from the designated boot device to a set location in RAM and passes control over to it. The boot loader usually uses BIOS routines to display text, read disks, get system information etc.\n It turns out that the Linux kernel does not need BIOS routines at all. It is the boot loader that does. Linux has what is know as a “boot protocol”, which tells the boot loader or any other program present at boot time, how to lay out the kernel and supporting data structures in RAM and how to pass control to the kernel. For the x86 architecture,  boot protocols are available for real mode, 32-bit and 64-bit modes.\n So, just like how we loaded the monitor program binary into the allocated guest memory, Firecracker loads the Linux kernel, setting up the required data structures like initial stack, command line parameters, as per the Linux kernel boot protocol. See the following files from the Firecracker Git repo:\n  This does away with the need for having any BIOS routines loaded during the boot process. This simplifies the design of the virtual machine by removing all the complexity required to enable a boot loader or having a need for BIOS routines at all.\n In the tiny Sparkler monitor program, there is no use of any BIOS routines as well. Also, because there is no BIOS at all. The  print_str routine for example, uses the  OUT x86 instruction to output characters, which causes a VM exit. These exits are handled by the  sparkler program, which uses the  putc()library function to display the character on to the terminal. Something very similar happens in Firecracker as well. A virtual serial console is setup for the Linux kernel via memory-mapped  ...\n  The other clever thing about Firecracker is that the virtual machine in which it runs the Linux kernel has very few devices. Linux, on x86 assumes the presence of an interrupt controller and an interval timer. These are really fundamental since the CPU doesn ’t have these built in. While it is possible to emulate these devices in the VMM, KVM provides a way better alternative. It is able to emulate them in-kernel for you. This is a big deal. Remember that as long as there is not VM  ...\n   If you look at the source code of the PS/2 keyboard controller emulated by Firecracker, you’ll notice that it is really sparse and it implements only one main function  trigger_ctrl_alt_del(), which is pretty self-explanatory.\n  VirtIO needs a bit more explanation. Real hardware devices have all kinds of quirks and are fairly complicated to program. When you have operating systems that can ’t be modified, but come with drivers for some hardware devices, it makes sense to emulate them. That way, it becomes possible to run these operating systems unmodified. But with Linux ’s rich history of virtualization, there are more high-performance solutions available. Modern Linux kernels ship with drivers for a virtual  ...\n VirtIO was developed initially by Rusty Russell for  LGuest, which made its way into the kernel in 2007, but was removed in 2017. VirtIO however, continues to thrive. VirtIO now has a  specificationand device drivers are available in-tree in the Linux kernel. The concept behind VirtIO is very simple. It specifies a way for the guest and host to communicate efficiently. It defines various device types like: network, block, console, entropy, memory balloon and SCSI host. It supports  ...\n Since the Linux kernel also ships with device drivers for VirtIO devices, all the host needs to do is to emulate the specially-designed-for-virtualization VirtIO devices and have Linux work seamlessly with them, with much better performance compared to emulating some other real hardware device Linux also supports.\n There is another very powerful feature of the Linux kernel called vhost. These are basically VirtIO devices emulated in the kernel directly, which means that there is no need to context switch to the VMM to deal with I/O from VirtIO devices. At the time of this writing however, Firecracker emulates both the network and the block VirtIO devices in the VMM and does not depend on vhost for further acceleration.\n At the time of this writing, Linux kernel 5.4 hasn’t yet been released, but there is a  patch that implements virtio-fs, which allows efficient sharing of files and directories between hosts and guest. This way, a directory containing the guests’ file system can be on the host, much like how Docker works.\n  For a use case like AWS Lambda, it might not be a such good idea to just run processes (inside which Lambda functions run) belonging to different accounts on the same physical or virtual server. It would be a security nightmare. You can ’t blame an architect however, if she chose to run processes from different accounts inside of Linux containers (using something like Docker). The only thing is we don ’t really know what holes exist yet, letting processes break their container  ...\n With containers being the main unit of abstraction, one common worry about Kubernetes security is the Linux API’s attack surface. Well, there has been improvement in this direction with projects like  Kata Containers, which run micro-VMs that use hardware virtualization for the containers, while providing a Kubernetes compatible interface so that Kubernetes can be used to orchestrate these containers. Similar to Firecracker, Intel started a project,  NEMU, which is QEMU cleaned  ...\n From the interface perspective, another important point to consider is the minimal set of devices supported by Firecracker. This further reduces the available attack surface.\n  Firecracker goes much further than just resting on security that hardware-based virtualization buys. There are two primary mechanisms used to secure the Firecracker process further. First, it can be deployed via a  jailor utility, which uses  chroot() and  cgroups to restrict the Firecracker process. Furthermore, it also  uses seccomprules to limit what the Firecracker process can do on the host system. Rules are setup carefully to only allow system calls that Firecracker explicitly  ...\n  Firecracker is a VM environment specially built to run only the Linux kernel, doing away with legacy BIOS or devices, while leveraging modern, virtualization techniques like VirtIO and securing the Firecracker process with  chroot(),  cgroupsand seccomp rules. On one side we have the most generic virtualization systems like QEMU and Virtual Box which can run pretty much any OS targeted at PCs, whereas on the other side, we have systems like Firecracker that are specialized  ...\n We also went into great detail of how KVM works by building a virtual machine monitor (VMM) in C. This is the piece that interfaces with KVM to create a hardware based virtual machine in which we ran a small program written in assembly language which talks to the VMM using devices that the VMM emulates. While there is a simple “console ”device that lets the VM input and output text, there are other more complex devices that can read a tweet, get the weather and air quality  ...", "posttime": "2020-05-02 17:58:50", "tags": "爆竹,firecracker,引导", "title": "AWS爆竹是如何运作的：深度潜水(2019年)", "title_en": "How AWS Firecracker works: A deep dive (2019)", "transed": 0, "url": "https://unixism.net/2019/10/how-aws-firecracker-works-a-deep-dive/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["爆竹", "引导"]}, {"category": "", "categoryclass": "", "imagename": "901ab920e314748ccb160fea4f7fdc82.jpg", "infoid": 1000208, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "私募股权公司不会获得Dot-org的控制权，Dot-org是数百万非营利性组织、非政府组织和社区团体的数字房地产。\n周四晚上，负责监管互联网命名系统的互联网名称与数字地址分配公司(Internet Corporation For Assigned Names And Numbers)董事会决定，否决将dot-org的权利出售给ethos Capital，后者出价超过10亿美元。\nICANN主席马尔滕·波特曼(Maarten Botterman)在一篇博客文章中写道，在权衡了所有考虑因素后，拒绝ethos的提议是“合理的，也是正确的做法”。\n自从计划中的出售在11月宣布以来，这笔交易就引发了强烈的反对。Dot-org最为人所知的是具有公民使命的非营利组织的网络社区，如红十字会(redCross s.org)、人权观察(hrw.org)和NPR(npr.org)。\n对许多人来说，将.com-org的控制权交给一家私募股权公司几乎是异端邪说。越来越多的反对者最终包括互联网先驱、非营利组织领导人和加利福尼亚州总检察长泽维尔·贝塞拉(Xavier Becera)。\n反对者提出了几个担忧，包括价格大幅上涨、投资不足和审查制度的风险。为了解决这些担忧，ethos Capital承诺成立一个由外部专家组成的“管理委员会”，并做出“公共利益承诺”，以抑制价格上涨，而不是审查网络内容。\n但批评人士仍然不信服。他们不相信一家私募股权公司，出于为投资者提供丰厚回报的需要，会按照他们认为的在线公民社会领域的最佳利益行事。\n在周五的一次采访中，博特曼说，董事会15名有投票权的成员中，有“令人信服的多数”反对ethos Capital的竞购。他说，最主要的担忧是，如果私募股权公司获得控制权，显然“缺乏对一直打算用于.com-org的精神的保证”。\nICANN周四的裁决和目前管理.com-org的安排是互联网命名系统神秘治理和历史的副产品。\n2002年，ICANN授予另一家非营利性组织公共利益注册中心(Public Interest Registry)经营dot-org域名的权利。部分理由是，域名不应该纯粹在商业基础上进行管理-例如，不像.com和dot-net。\n反过来，公共利益登记处又由互联网协会(Internet Society)控制，互联网协会是一个帮助制定互联网标准、教育计划和政策的非营利性组织。注册处持有一份管理.com-org的合同，该合同于去年续签了10多年。\n但根据注册规则，ICANN必须批准其做法和所有权的重大变化。\n互联网协会认为，出售给ethos Capital是一种获得捐赠的方式，为其运营提供资金，并摆脱它想要一段时间以来一直想做的经营.com-org的业务。\n在本周的一次采访中，互联网协会(Internet Society)首席执行官安德鲁·沙利文(Andrew Sullivan)表示，ethos Capital的竞标是它收到的几个提议之一-似乎是把有互联网经验的人与财政资源结合起来，帮助.com-org成长和繁荣。\n“我们认为这是一笔不错的交易，这对所有人都有好处，”沙利文说。\n沙利文说，如果ICANN拒绝了ethos Capital的交易，互联网协会没有立即的后备计划，并补充说，dot-org将像以前一样运营。“我们不会忽视.com-org，”他说。\n对ethos Capital竞购的反对采取了多种形式，包括1月份由一群互联网资深人士和非营利性领导人提出的另一项提案，该提案名为“.org注册合作公司”(Cooperative Corporation of.org Registrants)。在该合作社最初的七名董事中，有ICANN的第一任主席埃斯特·戴森(Esther Dyson)和ICANN的第一任总裁迈克·罗伯茨(Mike Roberts)。沙利文在本周的采访中说，互联网协会尚未与该合作社的创始人进行会谈。..。\n4月14日，戴森和罗伯茨写信给加州总检察长贝塞拉，敦促他反对这笔私募股权交易。ICANN在加利福尼亚州注册成立。(这封信还写给了宾夕法尼亚州总检察长，那里是公共利益登记处(Public Interest Registry)的注册地。)。\n今年1月，贝塞拉表达了对这笔交易的担忧，并要求提供文件。然后，在4月15日写给ICANN首席执行官兼董事会主席的一封信中，贝塞拉站在了这笔交易的反对者一边，并得出结论，如果ICANN不批准拟议中的出售，那么dot-org域名和“全球互联网社区--无数加州人都是其中的一部分--会得到更好的服务。”\nICANN董事会经过长时间的审议，看到了反对的广度和强度，得出了同样的结论。\n安德鲁·A说：“私募股权公司在网络上拥有这项重要的公共资产的想法令很多人深恶痛绝。”", "note_en": "A private equity firm will not gain control of dot-org, the digital real estate that is home to millions of nonprofits, nongovernmental organizations and community groups.\n The board of the Internet Corporation for Assigned Names and Numbers, which oversees the internet naming system, decided on Thursday night to veto the sale of the rights to dot-org to Ethos Capital, which had offered more than $1 billion.\n Maarten Botterman, the chair of ICANN, wrote in  a blog post that after all the considerations were weighed, rejecting Ethos’s proposed bid was “reasonable, and the right thing to do.”\n Ever since the planned sale was announced in November, the deal had stirred  fierce opposition. Dot-org is best known as the cyber neighborhood to nonprofit organizations with civic missions like the Red Cross (redcross.org), Human Rights Watch (hrw.org) and NPR (npr.org).\n To many, handing control of dot-org to a private equity firm seemed almost like heresy. The growing ranks of opponents eventually included internet pioneers, nonprofit leaders and the attorney general of California, Xavier Becerra.\n  The opponents raised several concerns, including the risk of steep price increases, underinvestment and censorship. Ethos Capital tried  to address those worries by pledging to set up a “stewardship council” of outside experts and making “public interest commitments” to restrain price increases and not censor web content.\n But critics remained unconvinced. They did not believe that a private-equity firm, driven by the need to deliver rich returns for investors, would act in the best interests of what they regard as the domain of online civic society.\n In an interview on Friday, Mr. Botterman said a “convincing majority” of the 15 voting members of the board opposed the Ethos Capital bid. The overarching concern, he said, was the apparent “lack of guarantees that the spirit that was always intended for dot-org” would be preserved if the private equity firm gained control.\n ICANN’s ruling on Thursday and the current arrangements for managing dot-org are byproducts of the arcane governance and history of the internet naming system.\n In 2002, ICANN granted the Public Interest Registry, another nonprofit, the right to run the dot-org domain. Part of the rationale was that the domain should not be managed on a purely commercial basis — unlike dot-com and dot-net, for example.\n The Public Interest Registry, in turn, is controlled by the Internet Society, a nonprofit that helps develop internet standards, education programs and policy. The registry holds a contract to manage dot-org, which was renewed last year for 10 more years.\n But under the rules governing the registry, ICANN must approve major changes in its practices and ownership.\n The Internet Society saw the sale to Ethos Capital as a way to gain an endowment to fund its operations and get out of the business of operating dot-org, which it wanted to do for some time.\n In an interview this week, Andrew Sullivan, chief executive of the Internet Society, said the Ethos Capital bid was one of several proposals it had received — and one that appeared to combine people who had internet experience with the financial resources to help dot-org grow and prosper.\n “We viewed it as a good transaction and that would be good for everyone,” Mr. Sullivan said.\n If ICANN rejected the Ethos Capital deal, the Internet Society had no immediate backup plan, Mr. Sullivan said, adding that dot-org would be run as before. “We will not neglect dot-org,” he said.\n The opposition to the Ethos Capital bid took a number of forms, including  an alterative proposal made in Januaryby a group of internet veterans and nonprofit leaders called the Cooperative Corporation of .ORG Registrants. Among the cooperative ’s initial seven directors are Esther Dyson, who was the first chair of ICANN, and Mike Roberts, ICANN ’s first president. The Internet Society, Mr. Sullivan said in the interview this week, has not yet had talks with the cooperative ’s founders.  ...\n On April 14,  Ms. Dyson and Mr. Roberts wrote to Mr. Becerra, California’s attorney general, urging him to oppose the private equity deal. ICANN is incorporated in California. (The letter was also addressed to the attorney general of Pennsylvania, where the Public Interest Registry is incorporated.)\n In January, Mr. Becerra had expressed concerns about the deal and requested documents. Then, in  a letter to ICANN’s chief executive and board chair on April 15, Mr. Becerra sided with the deal’s opponents and concluded that the dot-org domain and “the global internet community — of which innumerable Californians are a part — are better served if ICANN withholds approval of the proposed sale.”\n The ICANN board came to the same conclusion, after lengthy deliberations and seeing the breadth and intensity of the opposition.\n “The idea of a private equity firm owning this crucial public asset on the web was just anathema to a lot of people,” said Andrew Allemann, editor of Domain Name Wire, an industry news site.", "posttime": "2020-05-02 17:58:44", "tags": "equity,互联网,internet", "title": "一家私募股权公司被禁止收购.org", "title_en": "A Private Equity Firm Is Blocked from Buying .Org", "transed": 0, "url": "https://www.nytimes.com/2020/05/01/technology/dot-org-sale.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["equity", "互联网", "internet"]}, {"category": "", "categoryclass": "", "imagename": "7efb8a53bc9021d324ed7ab92080354d.jpeg", "infoid": 1000207, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德克萨斯大学奥斯汀分校运动学和健康教育系人体行为实验室，德克萨斯州奥斯汀。\n通讯地址：德克萨斯大学奥斯汀分校运动学和健康教育系人体行为实验室爱德华·F·科伊尔，One University Station，Austin，TX 78712；电子邮件：coyle@austin.utexas.edu。\n根据财务利益披露，E.F.Coyle拥有德克萨斯体育营养训练和健身公司(Sports Texas Nutrition Training and Fitness，Inc.)的股份，该公司销售本研究中使用的惯性负荷测功器。这项研究的结果并不构成美国运动医学院的认可。结果清楚、诚实，没有捏造、篡改或不适当的数据处理。\n餐后高血脂(即甘油三酯)(PPL)是心血管疾病的危险因素。缺乏体力活动，特征是长时间坐着和步数低，会提高PPL，因此患病的风险也会增加。\n这项研究确定了中断长时间坐着(即8小时不活动)和每小时仅持续4秒的自行车冲刺(即每小时4-s×5×8-h=160-s/天；冲刺)是否改善了PPL。4秒短跑使用了惯性负荷测功器，然后是45秒的坐姿休息。\n四名男性和四名女性参加了两项试验。干预措施包括8小时的坐姿(SIT)，或每小时中断5次冲刺的相等坐姿时间的试验。干预后的第二天早上，在6小时内测量PPL和脂肪氧化。每两小时测量一次血糖、胰岛素和甘油三酯浓度，并计算曲线下增量面积(AUC)。\n不同干预措施之间对血浆胰岛素或血糖AUC的影响没有差异(p&gt；0.05)。然而，与SIT相比，Sprint组血浆甘油三酯增量AUC408±119vs.593±88 mg/dL/6h降低了31%(P=0.009)，全身脂肪氧化增加了43%(P=0.001)。\n这些数据表明，在健康的年轻人中，每小时最大强度的极短周期冲刺(4s)中断长时间的静坐可以显着降低第二天的餐后血浆甘油三酯反应，并增加高脂肪饮食后的脂肪氧化。鉴于这些改善是由每天160秒的非疲劳运动引起的，这就提出了这样一个问题：什么是最少的运动量，才能显著改善脂肪代谢和其他…", "note_en": "Human Performance Laboratory, Department of Kinesiology and Health Education, University of Texas at Austin, Austin TX\n  Address correspondence to: Edward F. Coyle, Human Performance Laboratory, Department of Kinesiology and Health Education, University of Texas at Austin, One University Station, Austin, TX 78712; E-mail:   coyle@austin.utexas.edu\n  As a matter of Financial Interests Disclosure, E.F. Coyle owns equity in Sports Texas Nutrition Training and Fitness, Inc., a company that sells the  inertial load ergometer used in this study. The results of this study do not constitute endorsement by the American College of Sports Medicine. The results are presented clearly, honestly, and without fabrication, falsification, or inappropriate data manipulation.\n   High postprandial plasma lipids (i.e.; triglycerides) (PPL) are a risk factor for cardiovascular disease. Physical inactivity, characterized by  prolonged sitting and a low step count elevates PPL and thus risk of disease.\n    This study determined if the interruption of  prolonged sitting (i.e.; 8-h of inactivity) with hourly cycling sprints of only 4-s duration each (i.e.; 4-s x 5 per h x 8-h = 160-s per day; SPRINTS) improves PPL. The 4-s sprints employed an  inertial load ergometer and were followed by 45-s of seated rest.\n    Four men and four women participated in two trials. Interventions consisted of an 8-h period of sitting (SIT), or a trial with equal sitting time interrupted with five SPRINTS every hour. The morning after the interventions, PPL and fat oxidation were measured over a 6-h period. Plasma glucose, insulin, and triglyceride concentrations were measured bihourly and incremental area under the curve (AUC) was calculated.\n    No differences (p&gt;0.05) between interventions were found for plasma insulin or glucose AUC. However, SPRINTS displayed a 31% (408±119 vs. 593±88 mg/dL/6h; p=0.009) decrease in plasma triglyceride incremental AUC and a 43% increase in whole body fat oxidation (P=0.001) when compared to SIT.\n    These data indicate that hourly very short bouts (4 s) of maximal intensity cycle sprints interrupting  prolonged sittingcan significantly lower the next day ’s postprandial plasma triglyceride response and increase fat oxidation after a high fat meal in healthy young adults. Given that these improvements were elicited from only 160-s of non-fatiguing exercise per day, it raises the question as to what is the least amount of exercise that can acutely improve fat metabolism and other  ...", "posttime": "2020-05-02 17:58:40", "tags": "代谢,sprints,小时", "title": "每小时4秒冲刺预防餐后脂肪代谢受损", "title_en": "Hourly 4-second sprints prevent impairment of postprandial fat metabolism", "transed": 0, "url": "https://journals.lww.com/acsm-msse/Abstract/9000/Hourly_4_s_Sprints_Prevent_Impairment_of.96302.aspx", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["代谢", "sprints", "小时"]}, {"category": "", "categoryclass": "", "imagename": "9474ea8db5f6e9eda3b58228ce625d5e.png", "infoid": 1000206, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“一切都好吗？”一位朋友问道。“很忙，但等事情缓和下来，我会花点时间放松一下。”我回答说。最近，我发现自己每次被问到过得怎么样时，都会给出不同的答案。“有这么多工作要做，但希望下周会更好。”无时无刻不在忙碌可能会给我们一种生产力的错觉，这可能会让我们感到放心，但我们太忙而不能享受生活难道不存在风险吗？\n不幸的是，对一些人来说，忙碌不是一种选择。学生做兼职来支付学费，父母有两份工作只是为了维持生计-并不是每个人都有按照自己认为合适的方式管理时间的奢侈。但许多人确实有这种灵活性，但他们从一项任务匆忙到另一项任务，从来没有后退一步问一句：我真的享受到了这些吗？或者这些任务实际上让我太忙了，没有时间享受生活？\n研究表明，人类倾向于不惜一切代价保持忙碌，即使这项活动对他们来说毫无意义。休斯顿大学的布雷尼·布朗博士将“疯狂忙碌”描述为我们用来避免面对生活真相的一种麻木策略。\n我们害怕游手好闲，因为停止游手好闲意味着我们必须真正考虑我们想要从生活中得到什么，我们现在拥有什么。有时候，差距感觉太大了，我们宁愿呆在仓鼠轮子上。\n忙碌是一种防御机制。这是一种避免仅仅是存在的方式。有责任，有最后期限，有很长的任务清单…。我们的感官过载会让我们相信我们正朝着正确的方向前进，或者至少是朝着一个方向前进。但是，我们不假思索地处理的不断循环的任务往往会让我们停滞不前。谁会自豪地回首往年的待办事项清单，心想：“哇，我今年完成了这么多任务。”\n我们应该考虑我们工作的质量，而不是用我们生产的工作量来衡量进展。不仅是产出的质量(通常由外部设计的衡量标准来衡量)，还包括它对我们的精神和身体健康产生的影响的质量。“这份工作是否让我感觉到智力上的刺激，我是否学到了新东西，它是否帮助我培养了好奇心，它是否给了我与有趣的人交流的机会？”当工作代表着……时，这些都是明智的问题。\n“你不能两次踏入同一条河，因为其他的水还在源源不断地流着，”据说赫拉克利特说。时间就像一条河流。如果你太忙而不能享受生活--太忙而无暇与朋友和家人共度时光，太忙无暇学习绘画或弹吉他，太忙无暇徒步旅行，太忙无暇为自己做点好吃的--这些时刻就会消失，你也再也找不回来那些时间了。\n你可能会觉得太晚了。不是这样的。像许多人一样，我个人也经历过时间焦虑症--反复出现的想法是，开始或完成一件新的事情为时已晚-但现实是，你可能还有很多年在等着你。定义“好好度过的时间”对你来说意味着什么，并为这些时刻腾出空间，这是你能给未来的自己最好的礼物之一。\n下次你想学点新东西，或者朋友问你想不想一起做点什么或聊聊天，你会自然而然地回答：“我只是太忙了”，花几分钟认真考虑一下你是否真的太忙了，如果是这样的话，从长远来看，这种忙碌是否比学习新东西或花时间和朋友在一起对你更有价值。\n也许你实际上正在经历一个临时阶段，你正在做一个令人兴奋但又非常耗费精力的项目--这没什么。这样的活动让你觉得非常有激情，实际上是在养育你。但是，如果“我只是太忙了”成为你反复回答的问题，你可能需要考虑一下，在这么长的一段时间里，是否有可能如此兴奋。\n再说一次，如果是这样的话，幸运的是你-问题是我们通常甚至没有花时间去考虑另一种选择，那就是我们的工作让我们的大脑麻木了。忙于令人兴奋的工作是件好事。太忙而没有时间享受生活，花时间和你爱的人在一起，发掘你的全部潜力，这不是。如果你属于那些确实有选择的人，考虑最大限度地利用你的幸运处境。", "note_en": "“How are things?” asked a friend. “It’s busy, but I’ll take some time to relax when things ease up,” I replied. I recently caught myself giving a variation of this answer every time I was asked how I was doing. “So much work, but hopefully it will be better next week.” Being busy all the time can give us an  illusion of productivity which may feel reassuring, but isn’t there a risk we are too busy to enjoy life?\n For some people, being busy is unfortunately not an option. Students working part-time to pay for their studies, parents with two jobs just to stay afloat—not everyone has the luxury of managing their time the way they see fit. But many people do have this flexibility, and yet rush from one task to another without ever taking a step back to ask: am I  really enjoying any of this? Or are these tasks actually making me too busy to enjoy life?\n Research shows that humans tend to do whatever it takes to keep busy, even if the activity feels meaningless to them. Dr Brené Brown from the University of Houston describes being “crazy busy” as a numbing strategy we use to avoid facing the truth of our lives.\n We are scared of idleness because stopping would mean having to really consider what we want out of life and what we currently have. Sometimes, the gap feels so wide, we’d rather stay on the hamster wheel.\n Being busy is a defense mechanism. It’s a way to avoid just  being. Having responsibilities, deadlines, a long task list… Overloading our senses can make us believe we are moving in the right direction, or at least in  a direction. But the constant cycle of tasks we tackle without ever thinking often leaves us stagnant. Who proudly looks back at their old to-do lists at the end of the year and thinks: “Wow, I tackled so many tasks this year”?\n Instead of measuring progress by the quantity of work we produce, we should consider the quality of our work. Not just the quality of the output, as usually measured by externally-designed metrics, but the quality of the impact it has on our mental and physical well-being. “Did the work feel intellectually stimulating, did I learn something new, did it help me cultivate my  curiosity, did it give me the opportunity to connect with interesting people? ”are sensible questions to ask when work represents  ...\n  “You cannot step into the same river twice, for other waters are continually flowing on,” supposedly said Heraclitus. Time is like a river. If you’re too busy to enjoy life—too busy to spend time with friends and family, too busy to learn how to paint or play the guitar, too busy to go on that hike, too busy to cook something nice for yourself—these moments will be gone, and you will never get that time back.\n You may think it’s too late. It’s not. Like many people, I personally experience  time anxiety—the recurring thought that it’s too late to start or accomplish something new—but the reality is you probably still have many years in front of you. Defining what “time well spent” means to you and making space for these moments is one of the greatest gifts you can make to your future self.\n Next time you think of  learning something new, or a friend asks you if you want to do something together or have a chat, and your automatic answer is: “I’m just too busy”, take a few minutes to actually consider whether you are actually too busy, and, if that’s the case, whether this busyness is more valuable to you in the long-term than learning something new or spending time with your friend.\n Maybe you are actually going through a temporary phase where you’re working on an exciting but all-consuming project—and that’s fine. Such activities you feel extremely passionate about are actually nurturing. But if “I’m just too busy” is becoming a recurrent answer of yours, you may want to consider whether it is possible to be  that excited over such a long period of time.\n Again, if that’s the case, lucky you—the problem is we usually don’t even take the time to consider the alternative, which is that we’re numbing our minds with work. Being busy with exciting work is good. Being too busy to enjoy life, spending time with the people you love, and exploring your full potential is not. If you belong to the people who do have a choice, consider making the most of your fortunate situation.", "posttime": "2020-05-02 17:58:34", "tags": "enjoy,时间", "title": "我们是不是太忙了，没有时间享受生活？", "title_en": "Are we too busy to enjoy life?", "transed": 0, "url": "https://nesslabs.com/too-busy-to-enjoy-life", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["enjoy", "时间"]}, {"category": "", "categoryclass": "", "imagename": "7fd309d1d236851fd6344ed383d105e5.jpg", "infoid": 1000205, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阀门周四宣布，SteamVR不再支持MacOS，这样它的团队就可以专注于Windows和Linux。\n正如UploadVR指出的那样，Mac用户仍然可以通过运行Windows和Parallels Desktop或VMware Fusion等虚拟化软件来使用SteamVR。Valve表示，通过右键单击Steam中的SteamVR并选择Properties&gt；Betas，虚拟现实平台的旧版本也可以在Mac上访问。\n苹果软件工程主管克雷格·费德里吉(Craig Federighi)宣布，SteamVR将在2017年WWDC上登陆Mac，但最近Valve的一项调查显示，超过95%的Steam用户正在运行Windows或Linux。\n多份报告表明，苹果计划在2021年或2022年发布AR/VR组合耳机，随后在2023年发布更时尚的AR眼镜。\n这一点都不令人意外。苹果一直对那些想要编写跨平台、持久代码、不建议使用OpenGL和32位支持等事情的开发人员并不友好，而且总的来说，总是让人们很难保持旧代码的正常工作。见鬼，过渡到ARM的传言表明情况会变得更糟。同时，Windows仍然可以运行20年前的二进制文件，没有太多问题。Windows是保持代码长时间工作的黄金标准，其次…。\n不足为奇的是，只有一小部分Mac电脑拥有使用VR所需的GPU。此外，考虑到Mac用户群与PC相比较小的事实.。对于阀门来说，这是不值得的。没有真正的游戏玩家真正使用Mac来玩游戏，他们使用的是Windows PC和游戏机。\n这只是一个问题或市场份额，Mac电脑对于游戏来说是很棒的。操作系统超级稳定，金属相当快。像你这样的有毒评论是另一个原因。\n有毒吗？当它是有效的批评时，它是无毒的。我希望Mac上的游戏能蓬勃发展。苹果在实现这一目标方面做得很少。MacOS可能已经做好了黄金时间的准备，但让我们现实一点吧，硬件方面非常缺乏利用这一点的能力。\n他们应该在宣布支持的同时宣布停止支持。任何一个玩游戏的人都知道Mac上任何一种逼真的VR解决方案都是白日做梦。苹果顽固地支持游戏所需的标准。大型游戏开发人员不会为了5%的市场份额(这5%的Steam Mac用户中的大多数都是……)而将他们的整个图形子系统改写成Metal和所有其他以苹果为中心的API。\n记住，这些有毒的回复只是意见，无用的，无关的意见。对于讨厌苹果的人来说，这只是一种偏见的确认。几十年来，我们一直在倾听仇恨者的刺耳声音，他们的预测从来没有实现过。\n我不是一个讨厌苹果的人。自2005年以来，Mac电脑一直是我的日常司机……。但是对于游戏，特别是虚拟现实呢？这是一条死胡同。这就是个人电脑的用途。是的，我几乎可以在任何Mac电脑上玩Civ6。那真是太棒了！但几乎没有Mac支持VR的最低规格，而且那些支持VR的规格非常昂贵，要么没有GPU升级选项，要么非常昂贵，所以它们的保质期非常短。\n苹果(Apple)上周发布了2020年的新款iPhone SE，这是一款售价399美元的低价智能手机，采用与苹果旗舰iPhone相同的A13芯片升级了iPhone 8组件。我们在周五做了一段完整的动手视频，但我们花了一个周末的时间来看看iPhone SE的摄像头与iPhone8和iPhone11Pro相比有多大。订阅MacRumors YouTube频道可以获得更多视频。..。\n苹果从未以低于999美元的价格出售OLED显示屏的新iPhone，但随着iPhone12的阵容预计将包括更广泛的型号，这种情况可能很快就会改变。据YouTube频道首页科技的乔恩·普罗瑟(Jon Prosser)称，今年iPhone12的起价可能为649美元。普罗瑟说，这一消息来自他的同一消息来源，他准确地透露了新iPhone SE的发布情况。\n许多人在外出、逛商店和其他任务时都戴着口罩遮住脸部，苹果的Face ID iPhone在脸部被口罩遮挡时不会解锁。在今天早上发布的iOS13.5测试版中，苹果简化了当检测到戴口罩的人时密码弹出的速度，使得使用密码进入iPhone变得更容易……。\n在今天涵盖2020年第二财季的财报电话会议上，苹果首席执行官蒂姆·库克提供了一些关于在全球健康危机期间，我们可以期待苹果推出新产品的一些见解。库克表示，苹果仍在继续运营，苹果员工正在习惯在家工作。在公司的某些领域，有些……。\n苹果公司今天向开发者发布了即将推出的iOS和iPadOS 13.5更新的第三个测试版，两周前播种了第二个测试版，一个月前发布了带有iCloud文件夹的iOS和iPadOS 13.4", "note_en": "Valve on Thursday  announced that SteamVR no longer supports macOS so that its team &#34;can focus on Windows and Linux.&#34;\n As noted by  UploadVR, Mac users will still be able to use SteamVR by running Windows with virtualization software like Parallels Desktop or VMware Fusion. Valve says legacy builds of the virtual reality platform will also remain accessible on the Mac by right-clicking on SteamVR in Steam and selecting Properties &gt; Betas.\n Apple software engineering chief Craig Federighi announced that SteamVR was coming to the Mac at WWDC 2017, but a  recent Valve survey indicated that more than 95 percent of Steam users are running Windows or Linux.\n Multiple reports have indicated that Apple plans to release a  combination AR/VR headset by 2021 or 2022, followed by sleeker AR glasses by 2023.\n This is not surprising at all. Apple has not been friendly to developers who want to write cross-platform, enduring code, doing things like deprecating OpenGL and 32-bit support and just in general constantly making it difficult for people to keep old code working. Hell, the rumors of transitioning to ARM suggests this is going to get even worse.  Meanwhile Windows can still run binaries from 20 years ago without much issue. Windows is the gold standard for keeping code working for a long time, second  ...\n Not surprised, only a tiny fraction of Mac machines have the GPU required to use VR.  Also, given the fact that Mac user base is small compared to PCs... it&#39;s not worth while for Valve.  No serious gamer really uses a Mac for games, they use Windows PCs, and Consoles.\n It is only a question or market share, Macs can be great for gaming. OS is super stable, Metal is pretty fast. Toxic comment like yours are another reason.\nToxic? It&#39;s not toxic when it&#39;s a valid criticism. I want gaming on Mac to thrive. Apple has done little on their end to bring this to reality. MacOS may be ready for prime time, but lets be real the hardware side is very lacking to take advantage of that.\n They should have announced they were discontinuing support at the same time they were announcing support for it. Anyone who is involved with gaming at all knew any type of realistic VR solution on Mac was a pipe dream.  Apple is stubborn in their support for the standards needed for gaming. The big game devs aren&#39;t going to rewrite their entire graphics subsystems to Metal and all of the other Apple centric API&#39;s for some piece of a 5% market share (most of that 5% of Steam Mac users are  ...\n Remember, these toxic replies are just opinions, useless, irrelevant opinions. For the Apple haters this is just bias confirmation. We’ve listened for decades to the cacophony of the haters and nothing they predicted has ever come to pass.\nI&#39;m not an Apple hater... Macs have been my daily driver since 2005... But for gaming, and especially VR? It&#39;s a dead end. That&#39;s what PCs are for. Yes, I can play Civ 6 on just about any Mac. That&#39;s great! But almost no Macs support the minimum specs for VR, and the ones that do are very expensive and have either no or very expensive GPU upgrade options, so they have a very short shelf life.\n  Apple last week launched its new 2020 iPhone SE, a low-cost $399 smartphone that features iPhone 8 components upgraded with the same A13 chip available in Apple&#39;s flagship iPhones. We did a full hands-on video back on Friday, but we took the weekend to see how the iPhone SE&#39;s camera measures up to the iPhone 8 and iPhone 11 Pro.\rSubscribe to the MacRumors YouTube channel for more videos. ...\n Apple has never sold a new iPhone with an OLED display for under $999, but with the iPhone 12 lineup expected to include a wider range of models, that could soon change.\riPhone 12 pricing could start at $649 this year, according to Jon Prosser of the YouTube channel Front Page Tech. Prosser says this information comes from his same source who accurately revealed the new iPhone SE&#39;s launch...\n Many people are wearing masks that cover their faces when going outside, visiting stores, and other tasks, and Apple&#39;s Face ID iPhones do not unlock when the face is obscured by a mask.\rIn the iOS 13.5 beta, released this morning, Apple has streamlined the speed with which the passcode pops up when a person wearing a mask is detected, making it easier to get into an iPhone with a passcode...\n During today&#39;s earnings call covering the second fiscal quarter of 2020, Apple CEO Tim Cook provided some insight on what we can expect from Apple in terms of new products during the global health crisis. A mockup of an iPhone 12 with smaller notch Cook said that Apple is continuing to operate, and that Apple employees are getting used to working from home. &#34;In some areas of the company, some ...\n Apple today seeded the third betas of upcoming iOS and iPadOS 13.5 updates to developers, two weeks after seeding the second betas and a month after releasing iOS and iPadOS 13.4 with iCloud Folder Sharing, iPad trackpad support, and more.\riOS and ‌‌iPadOS‌‌ 13.5 can be downloaded from the Apple Developer center or over the air after the proper developer profile has been installed. ...\n VESA today announced that it has released DisplayPort Alt Mode 2.0, paving the way for future USB4 devices to support DisplayPort 2.0.\rAnnounced in June 2019, DisplayPort 2.0 has a max effective bandwidth of 77.4 Gbps, nearly triple that of DisplayPort 1.4. The new standard enables support for displays with up to 16K resolution, higher refresh rates, HDR support at higher resolutions,...\n Intel today officially announced its lineup of 10th-generation &#34;Comet Lake&#34; desktop processors, which includes a number of chips that would be appropriate for the iMac. AnandTech details all 32 of the new processors in organized tables, but only a handful of the chips would make their way into the iMac.\rAt the top of the list is the flagship Core i9-10900K that Intel calls the world&#39;s...\n Google has announced that its Meet videoconferencing service will be free to use for anyone with a Google account from next month. Following a gradual rollout through May, Meet will no longer be exclusive to paying G-Suite members, and will remain open to Google account holders until September 30, 2020. Google Meet offers many of the features that have made Zoom so popular in recent...\n Apple today announced financial results for the second fiscal quarter of 2020, which corresponds to the first calendar quarter of the year.\rFor the quarter, Apple posted revenue of $58.3 billion and net quarterly profit of $11.2 billion, or $2.55 per diluted share, compared to revenue of $58.0 billion and net quarterly profit of $11.6 billion, or $2.46 per diluted share, in the year-ago quarter...\n Customers who have purchased the new 2020 iPhone SE have found a surprising missing feature - Haptic Touch does not work with notifications.\rOn the 2020 iPhone SE, long pressing on a notification in the Notification Center or on the Lock screen does not appear to bring up rich notification options to allow iPhone SE users to interact with incoming content. Rich notifications accessed with ...", "posttime": "2020-05-02 17:58:29", "tags": "mac,drops,苹果,apple", "title": "在WWDC 2017年后不到三年，Valve Drops Mac对SteamVR的支持", "title_en": "Valve Drops Mac Support for SteamVR Less Than Three Years After WWDC 2017", "transed": 0, "url": "https://www.macrumors.com/2020/05/01/valve-drops-steamvr-mac-support/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["mac", "drops", "苹果", "apple"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000203, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我意识到我在一遍又一遍地问谷歌助手同样的问题。比如现在的天气怎么样？或者我今天的日程表上有什么？因此，我开始为我的树莓PI构建一个小仪表盘，我可以代替它进行检查。\n我花了大约20美元买了一个Waveshare 2.7英寸的电子纸帽子(B)。这个版本配有一个印刷电路板，可以直接插在树莓PI的通用输入/输出(GPIO)引脚上。您还可以使用随附的导线，以避免阻塞未使用的GPIO引脚。\n我按照Waveshare wiki的安装说明启动了hello world程序之一-有C和Python两个版本。与其他Raspberry PI硬件附件相比，实现这一点的步骤以及示例程序非常容易实现。\n我开始仔细阅读Python示例的源代码，以了解EPD库是如何工作的。该屏幕B版为三色，可显示白、黑、红三色，分辨率为264x176。示例首先清除屏幕(用白色填充)，然后创建两个层，这两个层是Pillow库中的Image对象。其中一层是黑色内容，另一层是红色内容。然后将它们传递给渲染函数EPD：：Display。\n#initialize the EPD classepd=epd2in7b.EPD()EPD.init()#从清晰的(白色)背景开始.Clear()#定义简单的字体24=ImageFont.truetype(os.path.join(picdir，&#39；Font.ttc&#39；)，24)#创建空的图像对象/层HBlackimage=Image.new(&#39；1&#。，(EPD.high，EPD.width)，255)#渲染黑色部分Black_Draw=ImageDraw.Draw(HBlackImage)BLACK_DRAW.text((1，1)，top_text，font=font_Large，Fill=0)#Calculate.。\n对于原型，我将显示当前的天气和来自BBC的一些新闻头条。Open Weather和News API都有慷慨的自由层。对于这些特性中的每一个，我都将编写返回文本的函数，我可以从中创建图层。\n我将使用Python3.5中的格式化字符串(而不是高级的f字符串)，因为这是Raspian(默认的Raspberry PI操作系统)附带的。\ndef get_weet()：&#39；&#39；&#39；&#39；获取格式化的天气描述。例如：`里士满，GB：晴空`&#39；&#39；&#39；owm=pyowm.OWM(Open_Weet_Key)servation=owm.weet_at_place(Location)w=观察.get_weet()Detailed=w.get_Detailed_status().Capitalize()temp_data=w.get_temp(&#39；摄氏度；)current_temp=str(temp_data[&#34；])min_temp=str(temp_data[&#34；temp_min&#34；])max_temp=str(temp_data[&#34；temp_max&#34；])text=&#39；{}：{}\\n{}°C({}°C.。\n遗憾的是，News API没有可用的最新库，所以我使用请求进行HTTP调用并解析数据。我可以显示大约三个标题(每个标题都有一个额外的换行)。文本需要手动换行，以防止其脱离屏幕。\ndef get_news(Limit=3)：&#39；&#39；&#39；&#39；从BBC获取一些列表格式的新闻标题。例如，“备受赞誉的瑞典作家佩尔·奥洛夫·恩奎斯特去世了-PM重返工作岗位，这是对这个国家的一个提振。错误的说法是，瑞典没有采取认真的措施。”URL=&#39；https://newsapi.org/v2/top-headlines?sources=bbc-news&amp；apiKey={}&#39；。格式(News_Api_Key)resp=request.get(url=url)data=resp.json()文章=[文章[&#39；标题&#39；]用于数据中的文章.。\n使用这两段文本，我创建了图像层。我希望天气在黑色的图层上，字体稍大一点。新闻将在红色的图层下面。下面是一个函数，它接受EPD类的一个实例以及两段文本。\ndef show_text(EPD，top_text=&#39；&#39；，Bottom_text=&#39；&#39；)：&#39；&#39；&#39；给定EPD实例和文本部分，渲染文本。&#39；&#39；&#39；&#39；HBlackImage=Image.new(&#39；1&#39；，(epd2in7b.EPD_Height，epd2in7b.EPD_Width)，255)HRedImage=Image.new(&#39；1&#39；，(epd2in7b.EPD_HEIGHT，epd2in7b.EPD_WIDTH)，255)#渲染黑色部分BLACK_DRAW=ImageDraw(HBlackImage)BLACK_DRAW.text((1，1)，top_text，font=font_Large，Fill=0)#计算黑色的深度.。\n这两个Image对象包含简单的数据，并不“知道”它们是什么颜色。渲染为位图格式时，它们看起来如下所示。\n注意第二层为第一层留出的空间，这样文本就不会重叠。\n这个程序的主要功能是确保我们只在有人醒着的时候才显示仪表板。我希望避免文档警告的重影。传递给show_text函数的EPD类在这里初始化。\n定义m", "note_en": "I realized I was asking Google Assistant the same questions over and over again. Like  What’s the current weather? or  What’s on my calendar for today? So I set out to build a small dashboard for my Raspberry Pi that I could check instead.\n I bought a  Waveshare 2.7inch e-Paper HAT (B) for ~$20. This version comes with a printed circuit board that slots right onto the general-purpose input/output (GPIO) pins of a Raspberry Pi. You can also use the included wires to avoid blocking the unused GPIO pins.\n  I followed the installation instructions from the  Waveshare wiki and fired up one of the hello world programs — there are  versions in C and Python. The steps to get this going, as well as the example programs, are quite accessible compared to other Raspberry Pi hardware accessories.\n  I started picking through the source code of the Python examples to understand how  epd-library works. The version  B of this screen is tri-colored, it can display white, black, and red, and the resolution is 264x176. The examples start by clearing the screen (filling it with white) and then create two layers which are  Image objects from the  Pillow library. One of the layers is the black content and the other layer is the red content. These are then passed to the render function  EPD::display.\n  # initialize the EPD classepd  = epd2in7b .EPD ( )epd .init ( ) # start with a clear (white) backgroundepd .Clear ( ) # define a simple fontfont24  = ImageFont .truetype (os .path .join (picdir ,  &#39;Font.ttc&#39; ) ,  24 ) # create empty image objects/layersHBlackimage  = Image .new ( &#39;1&#39; ,  (epd .height , epd .width ) ,  255 )HRedimage  = Image .new ( &#39;1&#39; ,  (epd .height , epd .width ) ,  255 ) # render the black sectionblack_draw  = ImageDraw .Draw (HBlackImage )black_draw .text ( ( 1 ,  1 ) , top_text , font =FONT_LARGER , fill = 0 ) # calculate  ...\n For the prototype, I’ll show the current weather and some news headlines from the BBC.  Open Weather and  News API both have generous free-tiers. For each of these features, I’ll write functions that return text which I can create layers from.\n I’ll be using  formatted strings from Python 3.5 (as opposed to the superior  f-strings) because that’s what  Raspian (the default Raspberry Pi operating system) comes with.\n  def  get_weather ( ) :  &#39;&#39;&#39; Get the formatted weather description. E.g. `Richmond, GB: Clear sky` &#39;&#39;&#39; owm  = pyowm .OWM (OPEN_WEATHER_KEY ) observation  = owm .weather_at_place (LOCATION ) w  = observation .get_weather ( ) detailed  = w .get_detailed_status ( ) .capitalize ( ) temp_data  = w .get_temperature ( &#39;celsius&#39; ) current_temp  =  str (temp_data [ &#34;temp&#34; ] ) min_temp  =  str (temp_data [ &#34;temp_min&#34; ] ) max_temp  =  str (temp_data [ &#34;temp_max&#34; ] ) text  =  &#39;{}: {}\\n{}°C ({}°C  ...\n News API sadly doesn’t have an up-to-date library available so I use  requests to make an HTTP call and parse the data. I can display about three headlines (including an extra wrapped line for each). The text needs to be manually  wrapped to stop it going off-screen.\n def  get_news (limit = 3 ) :  &#39;&#39;&#39; Get some news headlines from the BBC formatted in a list. E.g. `- Acclaimed Swedish author Per Olov Enquist dies - PM&#39;s return to work &#39;a boost for the country&#39; - &#39;Myth that Sweden has not taken serious steps&#39;` &#39;&#39;&#39; url  =  &#39;https://newsapi.org/v2/top-headlines?sources=bbc-news&amp;apiKey={}&#39; . format (NEWS_API_KEY ) resp  = requests .get (url =url ) data  = resp .json ( ) articles  =  [article [ &#39;title&#39; ]  for article  indata  ...\n With these two sections of text, I create the image layers. I want the weather to be on the black-colored layer with a slightly larger font. The news will be underneath on the red-colored layer. Here’s a function that takes an instance of the EPD class as well as two sections of text.\n def  show_text (epd , top_text = &#39;&#39; , bottom_text = &#39;&#39; ) :  &#39;&#39;&#39; Given an EPD instance, and sections of text, render the text. &#39;&#39;&#39; HBlackImage  = Image .new ( &#39;1&#39; ,  (epd2in7b .EPD_HEIGHT , epd2in7b .EPD_WIDTH ) ,  255 ) HRedImage  = Image .new ( &#39;1&#39; ,  (epd2in7b .EPD_HEIGHT , epd2in7b .EPD_WIDTH ) ,  255 )  # render the black section black_draw  = ImageDraw .Draw (HBlackImage ) black_draw .text ( ( 1 ,  1 ) , top_text , font =FONT_LARGER , fill = 0 )  # calculate the depth of the black  ...\n The two Image objects contain simple data and don’t ‘know’ what color they are. They look like this when rendered to bitmap format.\n  Notice the space that the second layer leaves for the first layer so that the text doesn’t overlap.\n  The main function of this program makes sure that we only display the dashboard during hours when someone will be awake. I want to avoid  ghosting which the documentation warns about. The EPD class that gets passed to the  show_text function is initialized here.\n def  main ( ) :  try : epd  = epd2in7b .EPD ( ) logging .info ( &#34;Init and Clear&#34; ) epd .init ( ) epd .Clear ( ) show_text (epd , top_text =get_weather ( ) , bottom_text =get_news ( ) )  # leave the dashboard up for half an hour time .sleep ( 60 * 30 ) logging .info ( &#34;Clear...&#34; ) epd .init ( ) epd .Clear ( )  except IOError  as e : logging .info (e ) sys .exit ( )  except KeyboardInterrupt : logging .info ( &#34;ctrl + c:&#34; ) epd2in7b .epdconfig .module_exit ( ) sys .exit ( ) while  True : t  = datetime .datetime .now ( )  # rest the screen  ...\n   I’m not sure if I’ll flesh this prototype out into an open source project so for now the full source code is in a  gist.\n  I didn’t invest any time in working with the four buttons on the left of the screen (they’re labelled KEY1, KEY2, etc. in the above picture) but I think it would be worthwhile to integrate them in a fleshed out dashboard — they connect as standard GPIO buttons.\n I’ve learned that e-ink screens are worth the investment for me and I might look into getting a much larger version. The viewing angle is like that of a  Kindle and although it’s small it’s beautiful to look at and has a more ‘real’ feel than a laptop or smartwatch screen.\n I look forward to seeing this technology progress and the commercial applications that arise. I saw that Whole Foods Market were using them in-store back  in 2016. It would be nice to have less LEDs staring at me whenever I leave the house!", "posttime": "2020-05-02 17:58:19", "tags": "电子,ink,epd", "title": "拼凑电子墨水仪表盘", "title_en": "Hacking Together an E-ink Dashboard", "transed": 0, "url": "https://healeycodes.com/hacking-together-an-e-ink-dashboard/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["电子", "ink", "epd"]}, {"category": "", "categoryclass": "", "imagename": "0208961fb41757a462921fab70557098.jpg", "infoid": 1000202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "鲁娜·桑德维克(Runa Sandvik)致力于记者的数字安全工作，她的工作经验来自于她在“纽约时报”、新闻自由基金会(Freedom Of The Press Foundation)和托尔项目(Tor Project)的工作经历。\n网上剥削儿童是一种可怕的犯罪，需要有效的应对措施。参议员林赛·格雷厄姆(R-SC)在1月份首次提出的一项法案草案正是打算提供这一点。然而，技术专家警告说，该法案不仅无法应对挑战，还会给自己带来新的问题。我的工作是让记者能够安全地开展工作--与他人沟通，研究敏感新闻，发表有冲击力的新闻。这项法案给记者带来了重大伤害。\n根据消除滥用和猖獗忽视互动技术(或赚取IT)的法案，一个政府委员会将为科技公司应该如何打击这类材料定义最佳实践。从表面上看，盈利IT提出了一种有效的方法。“纽约时报”(New York Times)9月份的一项调查发现，“许多科技公司未能充分监管其平台上的性虐待图像。“调查突出了这些公司提供的功能，这些功能提供……。\n在现实中，被批评的功能与保护我们在线隐私的功能完全相同。他们帮助我们私下阅读“华盛顿邮报”，并确保我们只能看到记者创造的真实内容。它们允许我们彼此交流。它们赋予我们表达自我的能力。它们使我们能够与记者建立联系，这样真相就可以登上新闻版面。这就提出了一个问题，即该法案是主要保护儿童，还是主要破坏在线言论自由。..。\n需要指出的是，盈利IT并不试图禁止使用这些功能。事实上，法案根本没有具体提到它们。但是，如果我们看看公司将如何应用“最佳实践”，很明显，政府打算让这些功能难以提供，政府正寻求阻止公司提供-并增加使用-这些功能。通过接受赚取IT，我们将放弃我们的能力-以及我们孩子的未来……。\n其中四个“最佳实践”与要求公司有能力“识别”儿童性虐待材料有关。不幸的是，如果没有识别任何和所有其他类型的材料的能力，就不可能识别这些材料-比如与消息来源沟通的记者，分享有争议观点的活动家，或者试图对冠状病毒发出警报的医生。没有什么能阻止政府后来将法案扩大到涵盖其他非法…。\n我们的数字生活受到相同功能的保护，这些功能允许一些坏人在网上做坏事。他们在我们访问“华盛顿邮报”网站、使用Signal应用程序联系其中一名记者或使用Tor浏览器向其匿名举报热线提交信息时保护我们。这些功能都支持隐私，这是新闻流程的核心组成部分。它们使记者能够毫无畏惧或偏袒地追寻和讲述真相。不仅在美国，而且在全球范围内。我们应该..。\n“纽约时报”的同一项调查发现，致力于打击网上剥削儿童的执法机构“人手不足，资金不足，尽管它们被要求处理的案件数量要大得多。“国家失踪和被剥削儿童中心(NCMEC)，由国会于1984年成立，目的是减少儿童性剥削，防止儿童受害，”没有足够的装备来满足日益增长的需求。“那么，值得一问的是，为什么赚取IT不能赋予我们力量……。\n我们必须考虑到这项法案未能实现其所宣称的目标的可能性。它不会保护在线儿童，而且会给他们的数字存在和自由说话的能力带来伤害。每个人都应该得到良好的安全，我们有责任在不损害我们的数字权利的情况下找到防止伤害的方法。强迫公司削弱我们的保护，以便让执法部门有更多的洞察力，这就相当于强迫人们在他们的房间里生活得没有锁和窗帘.。\n这并不是说我们必须接受任何解决方案。但不可能是这个。", "note_en": "Runa Sandvik works on digital security for journalists, founded upon her experiences working at The New York Times, the Freedom of the Press Foundation and The Tor Project.\n Online child exploitation is a horrific crime that requires an effective response. A  draft bill, first proposed by Sen. Lindsey Graham (R-SC) in January, intends to provide exactly that. However, technology experts warn the bill not only fails to meet the challenge, it creates new problems of its own. My job is to enable journalists to do their work securely —to communicate with others, research sensitive stories and publish hard-hitting news. This bill introduces significant harm to journalists  ...\n Under the Eliminating Abusive and Rampant Neglect of Interactive Technologies (or EARN IT) Act, a government commission would define  best practices for how technology companies should combat this type of material. On the surface, EARN IT proposes an impactful approach. A New York Times  investigationin September found that “many tech companies failed to adequately police sexual abuse imagery on their platforms. ”The investigation highlighted features, offered by these companies, that provide  ...\n In reality, the criticized features are exactly the same ones that protect our privacy online. They help us read The Washington Post in private and ensure we only see authentic content created by the journalists. They allow us to communicate with each other. They empower us to express ourselves. And they enable us to connect with journalists so the truth can make the page. This raises the question of whether the bill will primarily protect children or primarily undermine free speech online.  ...\n It should be pointed out that EARN IT does not try to ban the use of these features. In fact, the bill does not specifically mention them at all. But if we look at how companies would apply the “best practices, ”it becomes clear that the government is intending to make these features difficult to provide, that the government is looking to discourage companies from offering —and increasing the use of —these features. By accepting EARN IT, we will give up our ability —and our children ’s future  ...\n  Four of the “best practices” relate to requiring companies to have the ability to “identify” child sexual abuse material. Unfortunately, it’s not possible to identify this material without also having the ability to identify any and all other types of material — like a journalist communicating with a source, an activist sharing a controversial opinion or a doctor trying to  raise the alarm about the coronavirus. Nothing prevents the government from later expanding the bill to cover other illegal  ...\n Our digital life is protected by the same features that allow some bad people to do bad things online. They protect us as we visit The Washington Post  website, use the  Signal app to contact one of its journalists or use the  Tor Browser to submit information to their  anonymous tip line. These features all enable privacy, a core component of the journalistic process. They enable journalists to pursue and tell the truth, without fear or favor. And not just in the U.S., but globally. We should  ...\n The same New York Times  investigationfound that law enforcement agencies devoted to fighting online child exploitation “were left understaffed and underfunded, even as they were asked to handle far larger caseloads. ”The National Center for Missing and Exploited Children (NCMEC), established by Congress in 1984 to reduce child sexual exploitation and prevent child victimization, “was ill equipped for the expanding demands. ”It ’s worth asking, then, why EARN IT does not instead empower  ...\n We must consider the possibility that this bill fails to achieve its stated goal. That it will not protect children online, and will introduce harm to their digital presence and ability to speak freely. Everyone deserves good security, and it ’s on us to find ways to prevent harm without compromising on our digital rights. To force companies to weaken our protection to give law enforcement greater insight would be the equivalent of forcing people to live without locks and curtains in their  ...\n That’s not to say we have to accept no solution. But it can’t be this one.", "posttime": "2020-05-02 17:58:15", "tags": "威胁,threatens,记者,bill", "title": "新法案威胁记者保护消息来源的能力", "title_en": "New bill threatens journalists’ ability to protect sources", "transed": 0, "url": "https://techcrunch.com/2020/05/01/new-bill-threatens-journalists-ability-to-protect-sources/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["威胁", "threatens", "记者", "bill"]}]