[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073369, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德克萨斯州总检察长周一对Facebook母公司Meta Platform Inc.提起诉讼，指控这家社交媒体巨头长期且现已停止使用面部识别技术，违反了该州对个人生物特征数据的隐私保护。\n据一位知情人士透露，德克萨斯州总检察长肯·帕克斯顿在马歇尔州地方法院提起诉讼，要求处以数千亿美元的民事罚款。\n《华尔街日报》将向您收取$+税（如果适用）。您可以随时在客户中心或致电客户服务部更改账单偏好。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客服取消订阅。", "note_en": "The Texas attorney general filed a suit against Facebook parent Meta Platforms Inc. on Monday, charging that the social-media giant’s longstanding and  now discontinued use of facial-recognition technology violated that state’s privacy protections for personal biometric data.\n  The lawsuit, filed in state district court in Marshall by Texas Attorney General Ken Paxton, seeks civil penalties in the hundreds of billions of dollars, according to a person familiar with the matter.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-02-15 10:29:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,起诉,sues,诉讼", "title": "得克萨斯州起诉Meta，指控其在脸书上的面部识别行为", "title_en": "Texas Sues Meta Over Facebook's Facial-Recognition Practices", "transed": 1, "url": "https://www.wsj.com/articles/texas-sues-meta-over-facebooks-facial-recognition-practices-11644854794", "via": "", "real_tags": ["facebook", "起诉", "sues", "诉讼"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073368, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看来鲍泽总是把桃子公主关在另一座城堡里，他真的应该为此负责。那里&#39；这也是一款与任天堂有关的现实版Bowser，但方式却大不相同。他的名字是加里·鲍泽，他刚刚因参与创建和销售用于盗版任天堂Switch游戏的黑客软件而被判40个月监禁。\n这一刻是一个漫长的未来。美国司法部于2020年10月逮捕了鲍泽，并指控他是Xecuter团队的头目之一。Xecuter团队是一个臭名昭著的黑客组织，为索尼、微软和任天堂的流行游戏机制造mod芯片和越狱软件并从中获利。或者像司法部称之为“犯罪企业”的组织。\n团队执行者&#39；这是一款非法的SX Pro加密狗，可以用来绕过任天堂交换机的版权保护\n黑客组织最初坚称，其绕过版权保护的硬件和软件修改是为了开发自制应用程序，而不是让用户窃取软件。这可能部分是正确的（用*眨眼**眨眼*和*轻推**轻推*）。尽管如此，鲍泽在去年11月承认了司法部对他的九项指控中的两项。\n在认罪后，鲍泽与任天堂达成了1000万美元的民事诉讼和解，而此前他已经欠下了450万美元的赔偿金。他还同意移交与Team Xecuter相关的任何在线注册和域名，并且绝不&#34；直接或间接&#34；侵犯任天堂&#39；未来的版权。\n抛开这些重罚不谈，鲍泽仍然面临着长达10年的监禁。他得到了三年中的几个月，任天堂为此感谢检方团队。\n&#34;任天堂感谢联邦检察官和执法机构的辛勤工作和不懈努力，以遏制在全球范围内对任天堂和电子游戏行业造成严重损害的非法活动；任天堂说。\n&#34;任天堂特别要感谢联邦调查局（FBI）、国土安全部国土安全调查局（HSI）、华盛顿西区美国检察官办公室、美国司法部计算机犯罪和知识产权科，以及司法部国际事务办公室的重大贡献和协助；该公司补充道。\n它&#39；日本著名的任天堂（Nintendo）并不热衷于ROM，而是对其IP进行了超级保护。不仅在理论上，而且在实践中，它有起诉ROM网站的历史，其中一个导致了1200万美元的巨额侵权判决。\n任天堂（Nintendo）在其网站上的常见问题解答中明确表态。在这本书中，任天堂反对mod芯片和模拟器，并反驳了支持ROM的流行观点。任天堂说&#34；《版权法》不允许从直接下载网站、链接网站或其他非法来源下载ROM，即使你拥有视频游戏的副本&#34; 它在澳大利亚港口的法律部分重申了这一观点，称&#34；从互联网上下载任天堂ROM是违法的，无论你自己是否拥有游戏的真实副本&#34;", "note_en": "It seems Bowser always has Princess Peach locked up in another castle, and he really should be held accountable for that. There&#39;s also a real life Bowser linked to Nintendo, but in a much different way. His name is Gary Bowser, and he just received a 40-month prison sentence for his role in creating and selling hacking software used to pirate  Nintendo Switch games.\n  This moment was a long time coming. The US Department of Justice  arrested Bowser in October 2020 and accused him of being one of the ringleaders of Team Xecuter, a notorious hacking group that built and profited from mod chips and jailbreaking software for popular game consoles from Sony, Microsoft, and Nintendo. Or as the DoJ dubbed the organization, a criminal enterprise.\n  Team Xecuter&#39;s illegal SX Pro dongle that could be used to bypass copyright protection on the Nintendo Switch\n  The hacking group was initially adamant that its hardware and software modifications that circumvented copyright protections were intended for homebrew application development, not to enable users to steal software. That may have been partially true (with a *wink* *wink* and *nudge* *nudge*). Nevertheless, Bowser  plead guilty last November to two of the nine charges the DoJ brought against him.\n  Following the guilty plea, Bowser  settled a civil lawsuit with Nintendo to the tune of $10 million, on top of the $4.5 million in restitution he already owed. He also agreed to hand over any online registries and domain names associated with Team Xecuter, and to never &#34;directly or indirectly&#34; infringe on Nintendo&#39;s copyrights in the future.\n   Those hefty penalties aside, Bowser still faced up to 10 years in prison. He got a  few months over 3 years instead, for which Nintendo thanked the prosecution team.\n  &#34;Nintendo appreciates the hard work and tireless efforts of federal prosecutors and law enforcement agencies to curb illegal activities on a global scale that cause serious harm to Nintendo and the video game industry,&#34; Nintendo said.\n  &#34;In particular, Nintendo would like to thank the Federal Bureau of Investigation (FBI), Homeland Security Investigations (HSI) of the Department of Homeland Security, the US Attorney’s Office for the Western District of Washington, the US Department of Justice’s Computer Crime and Intellectual Property Section, and the Justice Department’s Office of International Affairs for their significant contribution and assistance,&#34; the company added.\n  It&#39;s well known Nintendo is not a fan of the ROM scene and is ultra-protective of its IP. Not just in theory, but in practice—it has a history of  suing ROM sites, one of which led to a massive  $12 million infringement judgement.\n  Nintendo makes its stance crystal clear in an  FAQ on its website. In it, Nintendo rails against mod chips and emulators, and counters popular arguments in favor of ROMs. In no uncertain terms, Nintendo says &#34;downloading ROMs from direct download sites, linking sites or other illegal sources, even when you own a copy of the video game, is not allowable under the Copyright Act.&#34; It reiterates this sentiment in the legal section of its Australian port where it says, &#34;It is illegal to download a Nintendo ROM from the internet whether or not your own an authentic copy of the game.&#34;", "posttime": "2022-02-15 10:26:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,任天堂,交换机,prison", "title": "法官判处名为“Bowser”的任天堂交换机黑客40个月监禁", "title_en": "Judge Gives 40-Month Prison Sentence to Nintendo Switch Hacker Called 'Bowser'", "transed": 1, "url": "https://hothardware.com/news/nintendo-bowser-3-year-prison-sentence-selling-switch-hacks", "via": "", "real_tags": ["黑客", "任天堂", "交换机", "prison"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073367, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（CNN）苹果公司（Apple）周四表示，在有报道称AirTags被用于跟踪人群和偷车后，公司计划在AirTags上增加更多保护措施，以减少不必要的追踪。\n在一篇博客文章中，苹果表示，它已与安全组织和执法机构合作，以确定更新其AirTag安全警告的更多方式，包括在怀疑小型蓝牙跟踪器正在跟踪某人时，尽早提醒人们。（现在，如果一个标签与主人分离，它可能需要几个小时才能发出啁啾声。）\n今年晚些时候将进行的其他更新包括调整追踪器&#39；s音序列，使设备更响亮，更容易找到，并允许人们通过iOS精密查找工具查看其距离和空中标签的方向。此外，苹果将在安装过程中警告AirTag用户，未经其同意跟踪他人是犯罪行为。\n去年春天，苹果推出了售价29美元的类似瓷砖的蓝牙定位器，可以连接并帮助用户找到钥匙、钱包、笔记本电脑或汽车等物品，几乎任何东西都能留下数字足迹。\n&#34;我们&#39；我已经意识到，个人可能会因为善意的原因收到不必要的跟踪警报，比如在借钱时#39；带标签的钥匙，或与家人乘坐汽车时&#39；s AirPods留在里面，&#34；该公司在一份声明中说&#34;我们还看到有报道称，不良行为者试图出于恶意或犯罪目的滥用AirTag&#34;\n&#34;我们强烈谴责任何恶意使用我们产品的行为；该公司表示。\n位置跟踪器不是&#39；t new-三星、索尼和Tile也有类似的产品。不必要的追踪问题也是#34；早在航空标签上市之前就存在了；据国家终结家庭暴力网络安全网项目负责人艾丽卡·奥尔森说。\n&#34;我们很高兴苹果参与了关于受害者安全的对话，并在继续改进安全措施。我们希望其他人也能效仿&#34；奥尔森说。\n虽然只有iOS用户会收到来自AirTag的关于潜在不必要跟踪的自动警报，但Android用户可以使用Apple&#39；s Tracker Detection app是一款有一定局限性的解决方案。它必须打开才能找到追踪器。\n苹果在博客帖子中说，它仍然是#34；致力于倾听反馈并创新以改进&#34;", "note_en": "(CNN) Apple  (  AAPL) said Thursday it plans to add more safeguards to AirTags to  cut down on unwanted tracking following  reports that the devices have been used to stalk people and steal cars.\n In a  blog post, Apple said it has worked with safety groups and law enforcement agencies to identify more ways to update its AirTag safety warnings, including alerting people sooner if the small Bluetooth tracker  is suspected to be tracking someone. (Right now, it can take hours for an AirTag to chirp if it has been separated from its owner.)\n  Other updates coming later this year include tweaking the tracker&#39;s tone sequence so the device is louder and easier to find, and allowing someone to see its distance and direction of an AirTag through the iOS precision finding tool. In addition, Apple will warn AirTag users during the setup process that tracking people without their consent is a crime.\n     Last Spring, Apple launched the $29 Tile-like Bluetooth locators that attach to and help users find items such as keys, wallets, laptops or a car, giving nearly anything a digital footprint.\n   &#34;We&#39;ve become aware that individuals can receive unwanted tracking alerts for benign reasons, such as when borrowing someone&#39;s keys with an AirTag attached, or when traveling in a car with a family member&#39;s AirPods left inside,&#34; the company said in a statement. &#34;We also have seen reports of bad actors attempting to misuse AirTag for malicious or criminal purposes.&#34;\n  &#34;We condemn in the strongest possible terms any malicious use of our products,&#34; the company said.\n Location trackers aren&#39;t new — there are similar products from Samsung, Sony and Tile.  The issue of  unwanted tracking also &#34;existed long before AirTags came on the market,&#34; according to Erica Olsen, director of the Safety Net Project at the National Network to End Domestic Violence.\n &#34;We are happy Apple is engaging in the conversation about victim safety and are continuing to improve safeguards. We hope others will follow their lead,&#34; Olsen said.\n   While only iOS users receive an automatic alert about potential unwanted tracking from an AirTag, Android users can use Apple&#39;s Tracker Detection app, a work around with some limitations. It must be open to locate a tracker.\n Apple said in the blog post it remains &#34;committed to listening to feedback and innovating to make improvements.&#34;", "posttime": "2022-02-15 10:24:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,解决,plans,跟踪", "title": "苹果计划更新AirTag以解决不必要的跟踪问题", "title_en": "Apple Plans AirTag Updates to Address Unwanted Tracking", "transed": 1, "url": "https://www.cnn.com/2022/02/10/tech/airtag-safety-updates/index.html", "via": "", "real_tags": ["苹果", "apple", "解决", "plans", "跟踪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073366, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当Valve的Steam Deck本月晚些时候开始向客户发货时，这款手持游戏PC将运行一个名为Steam OS的基于Linux的操作系统。这可能会给Linux上的游戏带来一些提升。\n虽然Valve的游戏客户端已经能够在Linux上运行多年，但截至上个月，只有略高于1%的Steam用户在运行Linux（使用macOS的用户不到3%，Windows占96%的份额）。看看一旦蒸汽甲板上街，这种情况是否会开始改变，这将是一件有趣的事情。如果真的这样做了，也许我们会看到更多的游戏制造商增加对Linux的支持……但最受欢迎的游戏之一不会很快增加对Linux的支持：Epic首席执行官蒂姆·斯威尼（Tim Sweeney）表示，该公司没有将Fortnite移植到Linux的计划。\n他说，这是因为Epic“没有信心在包括定制配置在内的各种内核配置下，我们能够大规模打击作弊行为”，但这是一个有趣的举措，因为Epic已经移植了反作弊软件，以支持Mac和Linux设备，包括Steam Deck。\n这意味着使用Epic轻松反作弊软件的第三方游戏应该与Steam Deck兼容。但Epic自己的Fortnite不会是这样的游戏之一。\n再说一次，Fortnite在Steam Store中也不可用，所以公司不想让你在一台可能会将你锁定在竞争对手生态系统中的设备上玩其广受欢迎的游戏太容易，这并不是一个巨大的惊喜。\n但是Steam Deck基本上是一台PC，虽然它将配备Steam OS，但它也能够运行Windows。这可能会为那些愿意安装替代操作系统的人提供一种玩Fortnite或任何其他在Linux下可能不可用或玩得不好的游戏的方式。\n看起来想在蒸汽甲板上玩Fortnite的人可能需要安装Windows来完成。\nVivo NEX 5智能手机可以有120 HZ的QHD+显示屏、Snapdragon 8 Gen 1芯片、高达12GB的RAM和512GB的存储器、5000毫安时电池、80W充电、一个32MP前置摄像头和四个后置摄像头（50MP主摄像头、48MP超宽摄像头、12MP 2X变焦和8MP 5X变焦）。维梧（Vivo）旗下的NEX品牌手机有着丰富功能的历史，按照这个标准，NEX 5实际上看起来像是一款非常传统的2022旗舰产品。\nMAME（多拱廊机仿真器）本周满25岁。如今，开源软件支持数千款经典游戏。\n25周年快乐，妈妈！1996年12月24日，开发人员Nicola Salmoria开始开发单街机硬件仿真器，如MultiPac。Nicola将他的模拟器合并到一个统一的框架下，并于1997年2月5日发布了MAME 0.1#mame#仿真\n三星表示，它将很快开始在其整个产品系列中使用由海洋塑料制成的回收塑料，从本周推出的Galaxy设备（手机和平板电脑）开始，其中部分将使用回收渔网。\n苹果计划在今年晚些时候向iPhone推出Tap-to-Pay移动支付功能，允许iPhone用户在“全美数百万商户”使用手机进行非接触式信用卡和借记卡支付需要iPhone XS或更新版本。\n当Firefox 94于11月发布时，它包含了一套“限时”色彩，允许你改变浏览器的外观。Firefox 97现在正在推出，它会取消这些外观——如果你想保留一个，请在更新之前确保它已启用。\n除此之外，更新还带来了打印机问题的修复、对文件应用程序中暗模式的实验性支持、对屏幕截图保存位置的选择的支持，以及浏览器内隐私审查（隐藏在需要启用的标志后面）。\nChrome OS 98稳定通道软件更新到此。里面是什么？更多虚拟办公桌快捷方式、新表情和打印机修复等等。https://t.co/AlVFePEaBr\n关注Twitter和Facebook上的Liliputing，关注最新头条新闻；关注Twitter和Facebook上的@LinuxSmartphone，了解开源手机上的最新消息。\n利普廷&#39；公司的主要收入来源是广告和附属链接（例如，如果你点击页面顶部的&#34；Shop&#34；按钮并在亚马逊上购买商品，我们将获得少量佣金）。\n但是有几种方法可以直接支持网站，即使你&#39；你在使用广告屏蔽软件，讨厌网上购物。\n*如果您正在使用uBlock Origin这样的广告拦截器，并在屏幕底部看到一条弹出消息，我们有一个指南可以帮助您禁用它。", "note_en": "When Valve’s Steam Deck begins shipping to customers later this month, the handheld gaming PC will be running a Linux-based operating system called Steam OS. And that could give gaming on Linux a bit of a boost.\n While Valve’s game client has been able to run on Linux for years, as of last month  just over 1% of Steam users were running Linux (and fewer than 3% were using macOS, with Windows holding a 96% share). It’ll be interesting to see if that starts to change once the Steam Deck hits the streets. And if it does, maybe we’ll see more game makers add support for Linux… but one of the most popular games around  isn’t going to add Linux support anytime soon: Epic CEO Tim Sweeney says the company has  no plans to port  Fortnite to Linux.\n  He says it’s because Epic doesn’t “have confidence that we’d be able to combat cheating at scale under a wide array of kernel configurations including custom ones,” but it’s an interesting take since Epic  has already  ported its anti-cheat software to support Mac and Linux devices including the Steam Deck.\n That means third-party games that use Epic’s Easy Anti-Cheat software should be compatible with the Steam Deck. But Epic’s own  Fortnite won’t be one of those games.\n Then again, Fortnite also isn’t available in the Steam Store, so it’s not like it’s a huge surprise that the company doesn’t want to make it  too easy for you to play its massively popular game on a device that may lock you into a rival’s ecosystem.\n But the Steam Deck is basically a PC, and while it will ship with Steam OS, it’s also capable of running Windows. And that could provide folks willing to install an alternate operating system a way to play  Fortnite or any other games that may not be available or play well under Linux.\n   It looks like folks who want to play Fortnite on the Steam Deck might have to install Windows to do it.\n  The Vivo NEX 5 smartphone could have a 120 HZ QHD+ display, Snapdragon 8 Gen 1 chip, up to 12GB RAM and 512GB storage, 5,000 mAh battery, 80W charging, a 32MP front camera, and four rear cameras (50MP primary, 48MP ultra-wide, 12MP 2X zoom, and 8MP 5X zoom). Vivo’s NEX-branded phones have a history of packing far-out features though, and by that standard, the NEX 5 actually looks like a pretty conventional 2022 flagship.\n  MAME (Multiple Arcade Machine Emulator) turned 25 this week. These day the open source software supports thousands of classic games.\n Happy 25th anniversary, MAME! On December 24, 1996, developer Nicola Salmoria began working on single arcade hardware emulators such as MultiPac. Nicola merged his emulators together under a single unified framework and on February 5th 1997, he released MAME 0.1.  #mame  #emulation\n   Samsung says it will begin using recycled plastic made from ocean-bound plastic across its whole product lineup soon, starting with Galaxy devices (phones and tablets) set to launch this week, which will be partially made with recycled fishing nets.\n  Apple plans to launch Tap to Pay mobile payment functionality to iPhones later this year, allowing iPhone users to use their phones for contactless credit and debit card payments at “millions of merchants across the US.” iPhone XS or newer required.\n   When Firefox 94 launched in November, it includes a set of “limited time” colorways allowing you to change the look of the browser. Firefox 97 is rolling out now and it retires those looks – if you want to keep one, make sure it’s enabled before updating.\n   Among other things, the update brings a fix for printer problems, experimental support for dark mode in the Files app, support for choosing where screen captures are saved, and an in-browser privacy review (hidden behind a flag that needs to be enabled).\n The Chrome OS 98 Stable Channel software update is here. What’s inside? More Virtual Desk shortcuts, new emojis and a printer fix, to name a few.  https://t.co/AlVFePEaBr\n  Keep up on the latest headlines by following Liliputing on  Twitter and  Facebook and follow  @LinuxSmartphone on Twitter and  Facebook for the latest news on open source mobile phones.\n  Liliputing&#39;s primary sources of revenue are advertising and affiliate links (if you click the &#34; Shop&#34; button at the top of the page and buy something on Amazon, for example, we&#39;ll get a small commission).\n But there are several ways you can support the site directly even if you&#39;re using an ad blocker* and hate online shopping.\n    * If you  are using an ad blocker like uBlock Origin and seeing a pop-up message at the bottom of the screen, we have a  guide that may help you disable it.", "posttime": "2022-02-15 10:20:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,操作系统,steam,游戏", "title": "Valve的Steam Deck将运行基于Linux的Steam操作系统，但没有Fortnite端口", "title_en": "Valve's Steam Deck Will Run Linux-Based Steam OS - But Won't Have a Fortnite Port", "transed": 1, "url": "https://liliputing.com/2022/02/lilbits-fortnite-for-linux-isnt-happening-vivo-nex-5-specs-leaked-mame-turns-25.html", "via": "", "real_tags": ["linux", "操作系统", "steam", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073365, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国网络安全和基础设施局（CISA）表示，随着与俄罗斯的紧张关系加剧，美国公司应该对来自俄罗斯的潜在黑客企图格外警惕。\n白宫表示，乔·拜登总统告诉弗拉基米尔·普京&#34；虽然美国仍然准备好与我们的盟友和伙伴充分协调，参与外交，但我们也同样准备好应对其他情况#34；如果俄罗斯决定入侵乌克兰。\n即使俄罗斯没有&#39；为了不入侵乌克兰，它经常用Wired所谓的&#34；历史上许多代价最高的网络攻击&#34; 然而，这些袭击可能并不总是局限于乌克兰，那里是CISA&#39；美国的新盾牌行动开始了。\n&#34;虽然目前美国本土没有任何具体的可信威胁；中钢协表示&#34；我们注意到俄罗斯有可能考虑以不稳定的行动升级乌克兰以外的其他国家。34; CISA主管Jen Easterly解释道：\nCISA说它&#34；建议所有组织，无论规模大小，在网络安全和保护其最关键资产方面采取更高姿态&#34; 它还说它&#39；s与它的&#34；关键基础设施合作伙伴&#34；提高对这些风险的认识。\n该机构希望所有人&#34；降低破坏性网络入侵的可能性，&#34&#34;采取措施快速检测潜在入侵&#34&#34;确保组织准备好在发生入侵时做出响应，&#34；和&#34；最大化组织&#39；s对破坏性网络事件的恢复力&#34;\nCISA在其网站上提供与这些重点领域相关的建议。它还说，尽管&#34；最近的网络事件并没有被归因于特定的参与者；各组织应审查与#34有关的1月份警报；了解并缓解俄罗斯国家支持的对美国关键基础设施的网络威胁#34；并访问Stop勒索软件。政府网站。", "note_en": "The US Cybersecurity and Infrastructure Agency (CISA)  says that American companies should be extra wary about potential hacking attempts from Russia as tensions with the country rise.\n The White House  says President Joe Biden told his counterpart Vladimir Putin that &#34;while the United States remains prepared to engage in diplomacy, in full coordination with our Allies and partners, we are equally prepared for other scenarios&#34; should Russia decide to invade Ukraine.\n  Even if Russia doesn&#39;t invade Ukraine, it has often targeted the country with what Wired has  characterized as &#34;many of the most costly cyberattacks in history.&#34; Those attacks might not always be confined to Ukraine, however, which is where CISA&#39;s new Shields Up campaign comes in.\n &#34;While there are not currently any specific credible threats to the U.S. homeland,&#34; CISA says, &#34;we are mindful of the potential for Russia to consider escalating its destabilizing actions in ways that may impact others outside of Ukraine.&#34; CISA director Jen Easterly explains:\n  CISA says that it &#34;recommends all organizations—regardless of size—adopt a heightened posture when it comes to cybersecurity and protecting their most critical assets.&#34; It also says that it&#39;s collaborated with its &#34;critical infrastructure partners&#34; to raise awareness of these risks.\n The agency wants everyone to &#34;reduce the likelihood of a damaging cyber intrusion,&#34; &#34;take steps to quickly detect a potential intrusion,&#34; &#34;ensure that the organization is prepared to respond if an intrusion occurs,&#34; and &#34;maximize the organization&#39;s resilience to a destructive cyber incident.&#34;\n CISA offers advice related to each of those focus areas on its website. It also says that, although &#34;recent cyber incidents have not been attributed to specific actors,&#34; organizations should review a January  alert related to &#34;Understanding and Mitigating Russian State-Sponsored Cyber Threats to U.S. Critical Infrastructure&#34; and visit the  StopRansomware.gov website.", "posttime": "2022-02-15 10:19:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,俄罗斯,加强,cybersecurity", "title": "美国网络安全机构目前正在敦促对俄罗斯网络攻击采取“加强姿态”", "title_en": "America's Cybersecurity Agency is Now Urging 'Heightened Posture' Against Russian Cyberattacks", "transed": 1, "url": "https://in.pcmag.com/security/147868/shields-up-cisa-warns-american-companies-about-russian-hacking", "via": "", "real_tags": ["美国", "俄罗斯", "加强"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073363, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "异构计算当然不是什么新鲜事，但它通常是一种CPU内核和一种GPU，以及媒体处理块和其他小型功能单元——至少在台式机和笔记本电脑系统上是如此。英特尔&#39；s Alder Lake CPU是第一个采用混合模式的x86-64处理器，在同一个芯片上有两个独立的CPU架构。\n这两种独立的CPU体系结构具有不同的优势和能力。金色海湾&#34；性能核心&#34；（或P核）采用英特尔&#39；它采用了最新的高性能桌面CPU体系结构，速度极快。与此同时，Gracemont和#34；效率核心&#34；（或E-core）非常小，其中四个，以及2MB的共享二级缓存，几乎可以与单个Golden Cove core放在同一个空间中。他们&#39；我们的速度比黄金湾核要慢，但效率也要高得多，至少在理论上是这样。其想法是，后台任务和轻工作负载可以在E-Core上运行，从而节省电源，而对延迟敏感和计算密集型任务可以在更快的P-Core上运行。这样做的好处可能没有英特尔在Windows上希望的那么明显，但在Linux上就更不明显了。那&#39；因为Linux不是&#39；我不知道桤木湖CPU的异常配置。那&#39；定于今年春天发布的Linux 5.18正在发生变化。Linux 5.18为英特尔增强硬件反馈接口（简称EHFI）带来了支持。内核对读取EHFI数据的支持将使操作系统能够更智能地在CPU上调度任务&#39；s逻辑核，这将允许按预期使用P核和E核。这本质上是英特尔的核心&#39；s&#34；线程主管&#34；这是一个智能的、低延迟的硬件辅助调度器。这条消息是由Phoronix公司提供的，该公司报道英特尔&#39；s EHFI内核代码已合并到&#34；linux next&#34；linux pm的分支，linux电源管理子系统。这显然意味着它将进入下一个内核周期，即5.18。该网站还表示，Linux5.18Stable应该在5月底左右上市。", "note_en": "Hetereogeneous computing is  nothing new, of course, but typically it has been one type of CPU core and one type of GPU, along with media processing blocks and other small functional units -- at least on desktop and notebooks systems. Intel&#39;s  Alder Lake CPUs are the first x86-64 processors to embrace a hybrid paradigm with two separate CPU architectures on the same die.\n These two separate CPU architectures have different strengths and capabilities. The Golden Cove &#34;performance cores&#34; (or P-cores) feature Intel&#39;s latest high-performance desktop CPU architecture, and they are blisteringly fast. Meanwhile, the Gracemont &#34;efficiency cores&#34; (or E-cores) are so small that four of them, along with 2MB of shared L2 cache, can nearly fit in the  same space as a single Golden Cove core. They&#39;re slower than the Golden Cove cores, but also much more efficient, at least in theory.  The idea is that background tasks and light workloads can be run on the E-cores, saving power, while latency-sensitive and compute-intensive tasks can be run on the faster P-cores. The benefits of this may not have been exactly as clear as Intel would have liked on Windows, but they were even less visible on  Linux. That&#39;s because Linux isn&#39;t aware of the unusual configuration of Alder Lake CPUs.  Well, that&#39;s changing in Linux 5.18, slated for release this spring. Linux 5.18 is bringing support for the Intel Enhanced Hardware Feedback Interface, or EHFI. Kernel support for reading EHFI data will allow the operating system to more intelligently schedule tasks on the CPU&#39;s logical cores, which will allow the P-cores and E-cores to be used as they were intended. This is essentially the crux of Intel&#39;s &#34;Thread Director,&#34; which is an intelligent, low-latency hardware-assisted scheduler.  This news comes courtesy of  Phoronix, which  reports that Intel&#39;s EHFI kernel code has been merged into the &#34;linux-next&#34; branch of linux-pm, the Linux power management subsystem. That apparently means it will be in the next kernel cycle, 5.18. The site goes on to say that Linux 5.18 stable should be available in late May or thereabouts.", "posttime": "2022-02-15 10:14:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,性能,英特尔,线程,alder", "title": "英特尔线程控制器（Intel Thread Director）将进军Linux，以大幅提升阿尔德湖（Alder Lake）的性能", "title_en": "Intel Thread Director Is Headed to Linux for a Major Boost in Alder Lake Performance", "transed": 1, "url": "https://hothardware.com/news/intel-thread-director-linux-boost-alder-lake-performance", "via": "", "real_tags": ["linux", "性能", "英特尔", "线程", "alder"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073362, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在OpenAI首席科学家厚颜无耻地宣称一些神经网络可能已经开始获得意识后，该领域的其他人正在回击。\n在我们昨天指出OpenAI联合创始人伊利亚·萨茨基弗（Ilya Sutskever）曾隐晦地宣称“今天的大型神经网络可能有点意识”之后，就出现了这种反弹\n发表后，人们纷纷回应，其中一些人代表了有知觉的人工智能，但许多人则称之为公牛。\n新南威尔士大学悉尼分校人工智能研究员托比·沃尔什（Toby Walsh）插话说：“每次这样的猜测性评论播出，都需要数月的努力才能让对话回到人工智能带来的更现实的机会和威胁。”。\n瓦伦蒂诺·佐卡（Valentino Zocca）是一位深度学习专家，他的日常工作是花旗集团（Citi）的副总裁。他也有类似的强烈反应，声称人工智能“没有意识，但显然宣传比其他任何东西都重要。”\n在网上化名为“tante”的独立社会技术专家Jürgen Geuter在回应Sutskever的推文时调侃道，“这也可能是因为这种做法在现实中没有依据，只是一种推销，旨在为一家运行非常简单的统计数据的初创公司宣称神奇的技术能力，只是其中的很多。”\n软件测试专家迈克尔·博尔顿（Michael Bolton，而不是同名歌手）也回应了这一观点，他开玩笑说，“可能是伊利亚·萨茨基（Ilya Sutskever）有点满了它”，或者甚至“可能不止一点点”\n哥本哈根IT大学副教授Leon Dercynski也有同样的想法。\n“也许在地球和火星之间的某个地方有一个茶壶围绕太阳运转，”他开玩笑说。“事实上，这似乎比伊利亚的沉思更合理，因为轨道装置是存在的，我们对茶壶有很好的定义。”\n还有一些人，包括微软挪威公司的数据科学家、前DeepMind研究员罗曼·韦帕乔夫斯基（Roman Wepachowski），对这则新闻的回应是一种模因方法。\n应该指出的是，这些批评人士指出了萨茨凯的说法的古怪之处，这并没有错——这不仅是对OpenAI及其首席科学家的一种背离，而且是一种非常不寻常的评论，因为到目前为止，大多数从事人工智能工作和研究的人认为，我们离创造有意识的人工智能还有很多年的时间，如果我们真的这样做了。\n关心支持采用清洁能源吗？看看有多少钱（还有星球！）你可以在UnderstandSolar使用太阳能来节约能源。通用域名格式。通过这个链接注册，未来主义。com可能会收到少量佣金。", "note_en": "After OpenAI’s chief scientist brazenly claimed that some neural networks may already be gaining consciousness, others in the field are pushing back.\n The backlash comes after we  pointed out yesterday that OpenAI cofounder Ilya Sutskever had cryptically claimed that “it may be that today’s large neural networks are slightly conscious.”\n After publication, the responses came rolling in, with some representing the  expected handwringing about sentient artificial intelligence, but many others calling bull.\n “Every time such speculative comments get an airing, it takes months of effort to get the conversation back to the more realistic opportunities and threats posed by AI,” UNSW Sidney AI researcher  Toby Walsh chimed in.\n   Valentino Zocca, a deep learning expert whose day job is as a vice president at Citi,  had a similarly hot take, claiming that AI “ is NOT  conscious  but apparently the hype is more important than anything else.”\n Independent sociotechnologist Jürgen Geuter, who goes by the pseudonym “tante” online,  quipped in response to Sutskever’s tweet that “it may also be that this take has no basis in reality and is just a sales pitch to claim magical tech capabilities for a startup that runs very simple statistics, just a lot of them.”\n That take was echoed by software testing specialist Michael Bolton — not the  singer of the same name —  who joked that “it may be that Ilya Sutskever is slightly full of it,” or, perhaps even “maybe more than slightly.”\n Leon Dercynski, an associate professor at the IT University of Copenhagen, ran with the same idea.\n   “It may be that there’s a teapot orbiting the Sun somewhere between Earth and Mars,” he  bantered. “This seems more reasonable than Ilya’s musing, in fact, because the apparatus for orbit exists, and we have good definitions of teapots.”\n Still others, including Microsoft Norway data scientist and former DeepMind researcher Roman Wepachowski responded to the news with a meme approach.\n   These critics, it should be noted, are not wrong to point out the outlandishness of Sutskever’s claim — it was not only a departure for OpenAI and its chief scientist, but also a pretty unusual comment to make, given that up to this point, most who work in and study AI believe that we’re  many years away from creating conscious AI, if indeed we ever do.\n          Care about supporting clean energy adoption? Find out how much money (and planet!) you could save by switching to solar power at  UnderstandSolar.com. By signing up through  this link, Futurism.com may receive a small commission.", "posttime": "2022-02-15 10:11:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "神经网络,推特,联合,cofounder,人工智能", "title": "OpenAI联合创始人嘲笑推特称神经网络可能有轻微的意识", "title_en": "OpenAI Cofounder Mocked for Tweeting That Neural Networks Might Be Slightly Conscious", "transed": 1, "url": "https://futurism.com/conscious-ai-backlash", "via": "", "real_tags": ["神经网络", "推特", "联合", "cofounder", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073361, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络犯罪分子越来越多地以Linux服务器和云基础设施为目标，发起勒索软件活动、加密劫持攻击和其他非法活动——许多组织因为Linux基础设施配置不当或管理不善而面临攻击。\nVMware网络安全研究人员的分析警告称，针对基于Linux系统的恶意软件的数量和复杂性正在增加，而；此外，还缺乏对管理和检测针对他们的威胁的关注。在此之前，由于混合工作的兴起，依赖基于云的服务的企业越来越多，Linux是这些环境中最常见的操作系统。\n正如这篇研究论文所详述的那样，这种崛起开辟了网络犯罪分子可以利用的新途径来破坏企业网络，包括针对Linux服务器的勒索软件和密码劫持攻击，这些攻击的环境可能不像运行Windows的环境那样受到严格监控。\n这些攻击旨在产生最大的影响，因为网络罪犯在触发加密过程并最终要求索取解密密钥的赎金之前，希望尽可能多地破坏网络。\n该报告警告称，勒索软件已经演变为针对虚拟化环境中用于加速工作负载的Linux主机映像，使攻击者能够同时对大量网络进行加密，并使事件响应变得更加困难。对云环境的攻击还导致攻击者从服务器窃取信息，如果他们&#39；你没有支付赎金。\n在攻击中以Linux服务器为目标的勒索软件家族包括REvil、DarkSide和Defray777以及it&#39；有可能出现新形式的勒索软件，它们也会针对Linux。\n加密劫持和其他恶意软件攻击也越来越多地针对Linux服务器。Cryptojacking恶意软件窃取CPU和服务器的处理能力，以便挖掘加密货币。\n针对所有操作系统的攻击往往未被发现。虽然加密劫持者正在消耗能量，并可能降低系统速度，但它&#39；这通常不是一个值得注意的足以造成重大破坏的排水。\n用于为Monero挖掘的最常见应用程序是开源的XMRig miner，其中许多应用程序都放在Linux服务器上。如果Linux环境不是&#39；如果没有正确的监控，加密劫持很容易不被发现，网络罪犯也知道这一点。\n&#34;网络犯罪分子正在大幅扩大其攻击范围，并将针对基于Linux的操作系统的恶意软件添加到他们的攻击工具包中，以尽可能少的努力将其影响最大化，&#34；VMware威胁情报高级主管Giovanni Vigna说。网络犯罪分子意识到，破坏一台服务器可以带来巨大的回报，而不是感染一台电脑，然后导航到一个价值更高的目标。\n与针对Windows系统的等效攻击相比，针对Linux环境的许多网络攻击仍然相对不成熟，这意味着通过正确的方法监控和保护基于Linux的系统，许多此类攻击都可以预防。\n这包括网络安全卫生程序，比如确保默认密码不被&#39；避免在多个用户之间共享一个帐户。\n&#34;专注于基础。事实是，大多数对手都不是超级先进的；VMware威胁研究经理布莱恩·巴斯金说。\n&#34;他们&#39；我们不是在寻找独特的开发，他们&#39；我们正在寻找一般的开放漏洞和错误配置。在开始关注零日攻击和新漏洞之前，先关注这些问题——确保&#39；我先讲了基础知识，&#34；他补充道。", "note_en": "Cyber criminals are increasingly targeting Linux servers and cloud infrastructure to launch ransomware campaigns, cryptojacking attacks and other illicit activity – and many organisations are leaving themselves open to attacks because Linux infrastructure is misconfigured or poorly managed.\n Analysis from  cybersecurity researchers at VMware warns that malware targeting Linux-based systems is increasing in volume and complexity,  while there&#39;s also a lack of focus on managing and detecting threats against them. This comes after an increase in the use of enterprises relying on cloud-based services because of the rise of hybrid working, with Linux the most common operating system in these environments.\n    That rise has opened new avenues that cyber criminals can exploit to compromise enterprise networks, as detailed by the research paper, including ransomware and cryptojacking attacks  tailored to target Linux servers in environments that might not be as strictly monitored as those running Windows.\n  These attacks are designed for maximum impact, as the cyber criminals look to compromise as much as the network as possible before triggering the encryption process and ultimately demanding a ransom for the decryption key.\n The report warns that ransomware has evolved to target Linux host images used to spin up workloads in virtualised environments, enabling the attackers to simultaneously encrypt vast swathes of the network and make incident response more difficult. The attacks on cloud environments also result in attackers stealing information from servers,  which they threaten to publish if they&#39;re not paid a ransom.\n Ransomware families that have been seen targeting Linux servers in attacks include REvil, DarkSide and Defray777 and it&#39;s likely that new forms of ransomware will appear that also target Linux.\n   Cryptojacking and other malware attacks are also increasingly targeting Linux servers. Cryptojacking malware steals processing power from CPUs and servers in order to mine for cryptocurrency.\n The attacks against all operating systems often go undetected. While cryptojackers are using up energy and potentially slowing down systems, it&#39;s usually not a noticeable enough drain to cause significant disruption.\n The most common application used to mine for Monero is the open-source XMRig miner and many of these are being placed on Linux servers. If the Linux environment isn&#39;t being correctly monitored, cryptojacking can easily go undetected and cyber criminals know this.\n &#34;Cyber criminals are dramatically expanding their scope and adding malware that targets Linux-based operating systems to their attack toolkit in order to maximize their impact with as little effort as possible,&#34; said Giovanni Vigna, senior director of threat intelligence at VMware. Rather than infecting a PC and then navigating to a higher value target, cyber criminals have realised that compromising a single server can deliver a massive payoff.\n Many of the cyberattacks targeting Linux environments are still relatively unsophisticated when compared with equivalent attacks targeting Windows systems – that means that with the correct approach to monitoring and securing Linux-based systems, many of these attacks can be prevented.\n That includes cybersecurity hygiene procedures such as ensuring default passwords aren&#39;t in use and avoiding sharing one account across multiple users.\n &#34;Focus on the basics. The fact is that most adversaries are not super advanced,&#34; said Brian Baskin, manager of threat research at VMware.\n &#34;They&#39;re not looking for unique exploits, they&#39;re looking for the general open vulnerabilities and misconfigurations. Focus on those before you start focusing on zero-day attacks and new vulnerabilities – make sure you&#39;ve got the basics covered first,&#34; he added.", "posttime": "2022-02-15 10:08:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,软件,恶意软件,malware,攻击", "title": "Linux恶意软件攻击正在增加，企业尚未做好准备", "title_en": "Linux Malware Attacks are Increasing, and Businesses Aren't Ready", "transed": 1, "url": "https://www.zdnet.com/article/linux-malware-attacks-are-on-the-rise-and-businesses-arent-ready-for-it/", "via": "", "real_tags": ["linux", "软件", "恶意软件", "malware", "攻击"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "公司首席执行官马克·扎克伯格（Mark Zuckerberg）在宣布将公司更名为Meta时承诺，公司认为是互联网未来的虚拟世界将受到保护，免受困扰Facebook的恶性肿瘤的侵害。他说：“从第一天开始，metaverse就需要具备隐私和安全性。”。“这是在产品出现之前，为安全、隐私和包容性而设计的。”\n在某些方面，这次会有所不同，因为虚拟现实是一种与Facebook或Instagram截然不同的媒体。尽管该公司的虚拟世界已经可以供用户创建和探索，但Meta对其计划如何在虚拟现实中实施安全协议的大部分内容保密，拒绝回答有关这些协议的详细问题。（披露：前世，我曾在Facebook和Spotify担任政策职务。）\n这些规则的透明度很重要，因为Meta长期以来一直在努力控制Facebook和Instagram上的内容。它已经在机器学习工具上投资了数十亿美元，以大规模调整内容，而且它还面临着关于什么样的言论应该被允许的难题。但在虚拟现实中，内容节制可能比在社交平台上更具挑战性，尤其是因为这些旧平台的工具不容易转移到一种不仅需要实时了解内容，还需要实时了解人们行为的媒体。隐私和安全之间还有一个权衡：即使公司可以跟踪我们在虚拟现实中的每一次对话和互动，我们希望它这样做吗？\nMeta表示，它认识到这一权衡，并承诺对其决策保持透明。因此，为了更好地理解它是如何实现虚拟现实节制的，BuzzFeed News向Meta发送了一份包含19个详细问题的列表，这些问题涉及它如何在虚拟现实中保护人们免受虐待、骚扰、误报和其他伤害。该公司拒绝回答任何问题。相反Meta发言人Johanna Peace向BuzzFeed News提供了一份简短声明：“我们致力于通过安全工具，比如报告和阻止他人的能力，让人们对自己的虚拟现实体验有更多的控制。我们还为开发者提供了更多工具来调节他们创造的体验，我们仍在探索如何在虚拟现实中最好地利用人工智能进行调节。我们仍以负责任的创新为指导这些体验从一开始就包含了确保隐私、安全和安全的原则。\"\n第一次进入&#34；负责任的创新原则&#34；体现了透明度的价值：“我们清晰、坦诚地沟通，让人们能够理解我们考虑的权衡，并就是否以及如何使用我们的产品做出明智的决定。”\n我们回去并要求Meta来考虑我们的问题。该公司拒绝了。\n所以，为了找到我们自己能做的事情，我们绑上了一些Oculus耳机，打开了地平线世界，并进行了初步实验。\n在几个小时内，我们建立了一个私人地平线世界，上面挂着大量错误信息的口号：“停止盗窃！”“停止这个计划！”“特朗普赢得了2020年的选举！”我们称这个世界为“Qniverse”，并给它配乐：Infowars创始人亚历克斯·琼斯（Alex Jones）没完没了地说乔·拜登（Joe Biden）是恋童癖者，并声称选举是由爬行动物霸主操纵的。我们用Meta明确承诺从Facebook和Instagram中删除的单词和短语填满了天空——“疫苗导致自闭症”、“新冠肺炎是一个骗局”，以及卡农的口号“我们去哪里，我们都去哪里”Meta一次又一次地删除使用这些短语的页面和组，甚至是私人组，并对其采取行动。\n我们没有向广大公众释放这种有毒物质。只有少数BuzzFeed新闻记者可以访问Qniverse，它是使用BuzzFeed新闻记者的真实姓名创建的，并链接到她的Facebook帐户。我们让这个世界“未发布”——即仅限邀请——以防止毫无戒心的用户出现在它身上，并模仿一些试图分享错误信息的元用户实际上可能会这样做的方式：在私人空间中，仅限邀请。\n我们测试的目的是评估在Facebook和Instagram上运行的内容调节系统是否也在地平线上运行。至少在我们的情况下，他们似乎没有。\n36个多小时后，Qniverse似乎没有被Horizon发现，可能是因为这个世界是私人的，只允许四个人进入，而且几乎没有参与——所有这些因素都可能使它成为内容版主的低优先级。\n通过Horizon的用户报告功能，一名能够访问世界的BuzzFeed新闻员工使用自己的名字和一个链接的Facebook帐户将世界标记为Meta。在48个多小时没有采取任何行动后，这名员工再次报告了世界，紧接着又是另一位BuzzFeed新闻用户的报告，该用户可以访问世界，也使用了她的真实姓名，该姓名与她的Facebook和Oculus个人资料相链接。\n提交第三份报告大约四小时后，提交报告的员工收到了Meta的回复：“我们训练有素的安全专家审阅了您的报告，并确定Qniverse中的内容没有违反我们的VR政策。”六小时后，原记者收到了同样的消息。也许是因为世界上只包含违规内容，而没有违规行为，所以版主们把Qniverse放在了一边。除了制造错误信息的口号，我们没有发言，也没有与世界上的内容互动。如果没有这样的背景，内容版主可能会认为这是一个恶搞。\n我们去了梅塔的通讯部，一个普通人无法使用的频道。我们询问了其内容版主的决定：一个分享Meta根据相同的社区指导原则从其其他平台删除的错误信息的世界，怎么可能不违反Horizon的政策？\n发言人乔·奥斯本（Joe Osborne）说：“经过进一步审查，我们已将其从地平线世界中删除。”。他拒绝回答有关该决定的进一步问题。\n过去几年里，任何新闻消费者都曾见过这样的情况：记者在社交平台上大喊内容，尤其是Meta拥有的平台。这在一定程度上是因为，有时情况变得非常糟糕。Facebook从一个你戳你高中时的老朋友的地方，发展到一个你高中时的老朋友可以把你加入一个私人团体的地方，这个团体发展到了成千上万其他谈论枪击抗议者或推翻民选政府的人。地平线是一种仍然非常新的媒介。随着Meta的建设，该公司承诺将再次解决一个复杂的难题，这是它和其他所有社交媒体公司一直在努力解决的问题：在保持平台安全的同时，允许自由表达，以平衡相互竞争的利益。鉴于这种新媒体的独特挑战，Meta面临着一项艰巨的任务，甚至可能是不可能的。\n如今，Meta似乎主要依靠用户块、静音和报告来通知它VR中违反社区标准的情况。Meta首席技术官Andrew Bosworth解释了在2021年11月的博客帖子中的原因：“我们不可能无限期地记录VR中发生的一切，这将侵犯人们的隐私。”他接着解释说，Oculus设备确实会记录（然后再记录）用户在虚拟现实中的最新体验，但这些记录只有在用户提交滥用报告时才会发送给Meta。\n这种方法与Meta在Facebook和Instagram上采用的方法截然不同。对抗数字仇恨中心研究负责人卡勒姆·胡德担心，如果没有一些积极的调节系统，用户可能会围绕种族主义和虐待儿童等有害内容形成有毒社区，而这些内容永远不会被报道。他说：“我们以前在Facebook群组中见过这种情况。”。\n但另一种选择也引发了担忧。Reor MIR是电子前沿基金会的草根倡导者，他警告说，如果元语言使用机器学习模型来监控其VR用户的行为，它可能会“审查更多的人，而不是保护更多的人”，因为它将需要“更亲密的监视形式：不仅是你在写什么，而且是你的行为。”\n自从Horizon Worlds于去年12月推出以来，Meta还没有像Facebook上那样遇到大规模的调节问题，部分原因可能是Horizon的用户比例很小。但也存在一些问题：据报道，地平线上的女性和有色人种受到骚扰、虐待，并成为仇恨言论的目标——这是虚拟现实在其整个历史中一直在努力解决的问题。Horizon有一个“安全区”选项，允许用户快速退出虚拟空间并屏蔽其他用户，它刚刚启动了“个人边界”作为另一种防止骚扰的机制。尽管如此，《华盛顿邮报》的一名记者最近还是在《地平线》上遇到了许多明显的儿童，官方要求用户至少18岁，这引发了人们的担忧，即儿童可能会成为该应用中捕食者的目标。\nFacebook和Instagram的许多最大的内容政策问题都与Meta的算法如何促进和放大内容有关。Meta确实在地平线上推广公共世界，并为Oculus用户推广应用程序和其他体验——但尚不清楚它是如何做到的，以及它的算法是否能像推动团体一样推动世界，其中一些团体鼓吹极端主义或暴力。Meta拒绝回答有关其推荐指南和内容分发指南是否适用于虚拟现实的问题。\nMeta转向虚拟现实的时机对公司来说非常艰难。上周，Facebook报告了其有史以来首次每日活跃用户数量下降，导致元股票暴跌，公司在一天内损失了约25%的市值。对于一家几乎不惜一切代价追求扩张的公司来说，虚拟现实技术的下降加大了成为下一个巨大增长动力的压力。（2016年，时任增强和虚拟现实副总裁的博斯沃思（Bosworth）认为，Facebook应该优先考虑增长，而不是遏制恐怖袭击等现实世界的危害，因为“任何能让我们更频繁地联系更多人的事都是好事。”他后来说，他是在挑衅性地强行进行辩论，公司从未坚持过这一政策。）\n根据虚拟现实和人权专家布里坦·海勒（Brittan Heller）的说法，目前还不存在在虚拟现实中进行充分调节的技术：公司无法可靠地实时转录和评估用户的语音，也无法可靠地识别手势。你可以想象另一个Qniverse——一个墙壁上没有潦草文字的Qniverse，但用户仍然聚集在那里分享有害的错误信息。如果不记录用户在虚拟现实中所说的一切，Meta怎么知道这种情况是否正在发生？但记录用户的言行，即使是在私人团体中，也会引发严重的隐私问题。\n另一个新的挑战是透视增加的复杂性：一个动作（或一个对象）从每个视角看起来都不一样。海勒问道：“在一场温和的争论中，谁的角度应该得到最大的重视？”？\nMeta拒绝回答更基本的问题，包括虚拟现实内容是否需要接受事实核查，该公司是否有能力发现Horizon中恐怖组织的赞扬和支持，以及该公司是否能够阻止Horizon中的用户消费白人至上主义内容或色情。Meta还拒绝透露，在Facebook和Instagram上进行绝大多数内容调节的机器学习模型是否也在调节地平线上的内容方面发挥了作用。Meta拒绝告诉我们，上传到Horizon的文件——比如上传到该公司社交平台的文件——是否针对国家失踪和受剥削儿童中心和全球互联网反恐论坛等组织维护的散列图像库进行了儿童剥削和恐怖材料检查。\n梅塔没能探测到我们的实验，这让一些专家感到困扰。纽约大学斯特恩商业和人权中心副主任保罗·巴雷特指出，人们总是在寻找新的方式来分享内容，同时避免被发现。他说，机会主义用户总是会发现并利用平台的最薄弱环节，公司“有责任事先弄清楚这项新服务如何被滥用。”\nMeta的虚拟现实节制带来的风险最终将取决于有多少人使用该公司的虚拟现实产品。Oculus应用程序原本用于Meta的VR耳机，在去年圣诞节后的两周内下载了大约200万次。但与全球数十亿人免费使用的Facebook和Instagram不同，Horizon要求用户花费数百美元购买耳机，并将其戴在脸上——这在杂货店的结账队伍中或在工作任务之间是很难做到的。根据社交媒体武器化专家艾默生·布鲁金（Emerson Brooking）的说法，Horizon中的用户池可能足够小，目前来说，Meta可以通过让员工监控用户标记的一切来有效地调节它。但海勒仍然担心虚拟现实中的极端分子，并警告说：“如果我们试图为所有人创造一个元宇宙，我们最好为所有人做好准备。”●", "note_en": "Announcing the company’s rebranding to Meta, CEO Mark Zuckerberg promised that the virtual worlds it believes to be the future of the internet would be protected from the malignancies that have plagued Facebook. “Privacy and safety need to be built into the metaverse from Day 1,” he  said. “This is about designing for safety and privacy and inclusion before the products even exist.”\n In some respects, it  will be different this time because virtual reality is a radically different medium from Facebook or Instagram. But although the company’s virtual worlds are already available for users to create and explore, Meta has kept secret much of how it plans to enforce its safety protocols in VR, declining to answer detailed questions about them. ( Disclosure: In a previous life, I held policy positions at Facebook and Spotify.)\n Transparency around these rules is important because Meta has long struggled with how to moderate content on Facebook and Instagram. It has invested billions in machine learning tools to moderate content at scale, and it has confronted hard problems about what speech should be allowed. But content moderation will likely be more challenging in VR than on social platforms, not least because the tools for those older platforms do not easily transfer over into a medium that requires a real-time understanding not only of content but also how people behave. There is also a trade-off between privacy and safety at stake: even if the company could track every conversation and interaction we had in VR, would we want it to?\n Meta has  said it recognizes this trade-off and has  pledged to be transparent about its decision-making. So, to better understand how it is approaching VR moderation, BuzzFeed News sent Meta  a list of 19 detailed questions about how it protects people from child abuse, harassment, misinformation, and other harms in virtual reality. The company declined to answer any of them. Instead, Meta spokesperson Johanna Peace provided BuzzFeed News a short statement: “We’re focused on giving people more control over their VR experiences through safety tools like the ability to report and block others. We’re also providing developers with further tools to moderate the experiences they create, and we’re still exploring the best use of AI for moderation in VR. We remain guided by our  Responsible Innovation Principles to ensure privacy, security and safety are built into these experiences from the start.”\n    The very first entry in &#34; Responsible Innovation Principles&#34; enshrines the value of transparency: “We communicate clearly and candidly so people can understand the tradeoffs we considered, and make informed decisions about whether and how to use our products.”\n We went back and asked again for Meta to consider our questions. The company declined.\n So, to find out what we could on our own, we strapped on some Oculus headsets, opened Horizon Worlds, and ran a rudimentary experiment.\n    In a matter of hours, we built a private Horizon World festooned with massive misinformation slogans: “Stop the Steal!” “Stop the Plandemic!” “Trump won the 2020 election!” We called the world “The Qniverse,” and we gave it a soundtrack: an endless loop of Infowars founder Alex Jones calling Joe Biden a pedophile and claiming the election was rigged by reptilian overlords. We filled the skies with words and phrases that Meta has  explicitly  promised to remove from Facebook and Instagram — “vaccines cause autism,” “COVID is a hoax,” and the QAnon slogan “where we go one we go all.” Time and time again, Meta has  removed and  taken action on pages and groups, even private ones, that use these phrases.\n We did not release this toxic material to the larger public. Only a handful of BuzzFeed News reporters were given access to the Qniverse, which was created using an account in the real name of a BuzzFeed News reporter and linked to her Facebook account. We kept the world “unpublished” — i.e., invitation only — to prevent unsuspecting users from happening upon it, and to mimic the way some Meta users seeking to share misinformation might actually do so: in private, invitation-only spaces.\n The purpose of our test was to assess whether the content moderation systems that operate on Facebook and Instagram also operate on Horizon. At least in our case, it appears they did not.\n    After over 36 hours, the Qniverse appeared to go undetected by Horizon, perhaps because the world was private, had only four people allowed to enter it, and got almost no engagement — all factors that would likely make it a low priority for content moderators.\n Using Horizon’s user reporting function, a BuzzFeed News employee with access to the world used his own name and a linked Facebook account to flag the world to Meta. After more than 48 hours and no action, the employee reported the world again, followed quickly by another report from a different BuzzFeed News user with access to the world who also used her real name, which was linked to her Facebook and Oculus profiles.\n    Roughly four hours after the third report was filed, the employee who submitted it received a response from Meta: “Our trained safety specialist reviewed your report and determined that the content in the Qniverse doesn’t violate our Content in VR Policy.” Six hours after that, the original reporter received the same message. Perhaps the moderators left the Qniverse up because the world contained only violative  content, and not violating  behavior. Beyond the act of creating the misinformation slogans, we did not speak or otherwise interact with the content in the world. Without that context, maybe content moderators took it to be a parody.\n      We went to Meta’s comms department, a channel not available to ordinary people. We asked about its content moderators’ decisions: How could a world that shares misinformation that Meta has removed from its other platforms, under the same Community Guidelines, not violate Horizon’s policies?\n  “After further review, we have removed this from Horizon Worlds,” spokesperson Joe Osborne said. He declined to answer further questions about the decision.\n    Any news consumer over the past several years has seen this before: journalists calling out content on social platforms, especially those owned by Meta. That’s partly because, at times, things got really bad. Facebook evolved from a place where you poked your old high school friend to a place where your old high school friend could add you to a private group that grew to thousands of other people who talked about  shooting protesters or  overthrowing the democratically elected government. Horizon is a medium that is still very new. As Meta builds it, the company has promised to tackle again a complex conundrum that it and every other social media company have struggled with: balancing the competing interests of keeping its platform safe while allowing for free expression. Given the unique challenges of this new medium, Meta faces a task that is daunting, maybe even impossible.\n    Today, Meta appears to rely mainly on user blocks, mutes, and reports to notify it of Community Standards violations in VR. Andrew Bosworth, Meta’s chief technology officer, explained the reason why in a November 2021  blog post: “We can’t record everything that happens in VR indefinitely — it would be a violation of people’s privacy.” He then explained that Oculus devices do record (and then record over) users’ most recent experiences in VR, but that those recordings are only sent to Meta if a user files an abuse report.\n This approach departs sharply from the one Meta has taken on Facebook and Instagram. Callum Hood, head of research for the Center for Countering Digital Hate, worries that without some proactive moderation system in place, users could form toxic communities around harmful content like racism and child abuse that would never be reported. “We’ve seen this before with Facebook Groups,” he said.\n    But the alternative raises concerns, too. Rory Mir, a grassroots advocacy organizer at the Electronic Frontier Foundation, cautioned that if Meta  does use machine learning models to police its VR users’ behavior, it might “censor more people than it’s going to protect,” because it will require “far more intimate forms of surveillance: not just what you’re writing, but how you’re behaving.”\n Since Horizon Worlds launched in December, Meta has yet to run into large-scale moderation problems like it has on Facebook, perhaps in part because Horizon has a tiny fraction of the users. But there have been problems: Women and people of color in Horizon have  reported being  harassed, abused, and targeted with hate speech — something VR has  struggled with for its  entire history. Horizon has a “safe zone” option that allows users to quickly exit a virtual space and block other users, and it just  launched “personal boundaries” as another mechanism against harassment. Still, a reporter at the Washington Post  recently encountered numerous apparent children in Horizon, which officially requires that users be at least 18, raising concerns that children could be targeted by predators in the app.\n Many of Facebook and Instagram’s biggest content policy issues have been about how Meta’s algorithms promote and amplify content. Meta does promote public worlds in Horizon, and it promotes apps and other experiences for Oculus users — but it’s not clear how it does so and whether its algorithms can propel worlds in the same way as they boosted groups, some of which advocated extremism or violence. Meta declined to answer questions about whether its  Recommendations Guidelines and  Content Distribution Guidelines apply in VR.\n Meta’s pivot to VR comes at a difficult time for the company. Last week, Facebook  reported its first-ever decline in daily active users, sending Meta stock into a nosedive that lost the company approximately  25% of its worth in a day. The drop ramps up the pressure on VR to be the next big growth driver for a company that has pursued expansion at almost any cost. (In 2016, Bosworth, then the vice president of augmented and virtual reality,  argued that Facebook should prioritize growth over curbing real-world harms like terrorist attacks because “anything that allows us to connect more people more often is *de facto* good.” He said later he was being provocative to force a debate and that the company never held that policy.)\n    According to Brittan Heller, an expert in virtual reality and human rights, technology to adequately moderate in VR doesn’t exist yet: Companies cannot reliably transcribe and assess users’ speech in real time, nor can they reliably recognize gestures. One can imagine an alternate Qniverse — one without words scrawled on its walls, but where users nonetheless congregate to share harmful misinformation. Without recording everything users say in VR, how can Meta know whether such a situation is happening? But recording everything users say and do, even in private groups, raises stark privacy questions.\n Another new challenge is the complexity added by perspective: An action (or an object) will look different from every viewpoint. “Whose angle,” Heller asks, “should receive the most weight” in a moderation dispute?\n Meta declined to answer far more basic questions, including whether VR content is subject to fact-checking, whether the company is capable of detecting praise and support of terrorist organizations in Horizon, and whether the company can prevent users in Horizon from consuming white supremacist content or porn. Meta also refused to say whether the machine learning models that do the vast majority of content moderation on Facebook and Instagram also play a role in moderating content on Horizon. Meta declined to tell us whether files uploaded to Horizon — like those uploaded to the company’s social platforms — are checked for child exploitation and terrorist material against hashed image banks maintained by organizations like the National Center for Missing and Exploited Children and the Global Internet Forum to Counter Terrorism.\n    Meta’s failure to detect our experiment troubled some experts. Paul Barrett, deputy director of the NYU Stern Center for Business and Human Rights, noted that people are always looking for new ways to share content while evading detection. Opportunistic users will always find and exploit the platform’s weakest points of enforcement, he said, and the company “ha[s] a responsibility to figure out beforehand how this new service could be misused.”\n The risks posed by Meta’s VR moderation will ultimately depend on how many people use the company’s VR products. The Oculus app, meant for use with Meta’s VR headsets, was downloaded  roughly 2 million times in the two weeks after this past Christmas. But unlike Facebook and Instagram, which billions of people worldwide use free of charge, Horizon requires users to spend hundreds of dollars on a headset and strap it to their face — hardly something that can be done in a grocery store checkout line or between tasks at work. According to Emerson Brooking, an expert on the weaponization of social media, the pool of users in Horizon may be small enough, for now, that Meta can effectively moderate it by having human employees monitor everything that users flag. But Heller nonetheless worried about extremists in VR, cautioning: “If we’re trying to make a metaverse for all people, we’d better be ready for all people.” ●", "posttime": "2022-02-15 10:00:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "不会,wouldn,meta", "title": "“Meta不会告诉我们它如何在虚拟现实中执行规则，所以我们进行了测试”", "title_en": "'Meta Wouldn't Tell Us How It Enforces Its Rules In VR, So We Ran A Test'", "transed": 1, "url": "https://www.buzzfeednews.com/article/emilybakerwhite/meta-facebook-horizon-vr-content-rules-test", "via": "", "real_tags": ["不会", "wouldn", "meta"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了沿着最快的“赛道”急转弯而不失去控制，赛车手必须按精确的时间顺序刹车、转向和加速。这个过程取决于摩擦力的极限，它们受已知的物理定律控制，这意味着自动驾驶汽车可以学习以尽可能快的速度完成一圈（就像一些人已经做的那样）。但当自动驾驶者不得不与其他车辆共享空间时，这就成了一个更棘手的问题。现在，科学家们已经通过训练一个人工智能程序，在超现实的赛车游戏Gran Turismo Sport中超越人类竞争对手，基本上解决了这一挑战。这些发现可能会为自动驾驶汽车的研究人员提供新的方法，使这项技术在现实世界中发挥作用。\n人工智能已经征服了某些电子游戏中的人类玩家，比如星际争霸II和Dota 2。索尼人工智能美国公司（Sony AI America）董事、这项新研究的合著者彼得·沃尔曼（Peter Wurman）表示，Gran Turismo与其他游戏在很大程度上有所不同。这项研究于本周在《自然》杂志上发表。他解释说：“在大多数游戏中，环境定义了规则，并保护用户彼此不受影响。”。“但在比赛中，赛车彼此非常接近，人工智能特工必须学习和运用一种非常精致的礼仪。为了赢得比赛，他们必须尊重对手，但他们也必须保持自己的驾驶路线，并确保他们不只是让路。”\n索尼人工智能研究人员使用了一种称为深度强化学习的技术来教授他们的程序。他们奖励AI的某些行为，比如留在赛道上，保持对车辆的控制，尊重比赛礼仪。然后，他们放宽计划，尝试不同的比赛方式，以实现这些目标。索尼人工智能团队训练了多个不同版本的人工智能，称为Gran Turismo Sophy（GT Sophy），每个版本都专门在一条特定轨道上驾驶一种特定类型的汽车。然后，研究人员将该项目与人类大旅游冠军进行对比。在去年7月进行的第一次测试中，人类获得了最高的团队总分。在2021年10月的第二次运行中，人工智能突破了。它以个人和团队的形式击败了人类敌人，获得了最快的圈速。\n人类玩家似乎已经坦然接受了他们的失败，有些人喜欢与人工智能较量。索尼人工智能（Sony AI）战略与合作总监艾丽卡·加托·马库斯（Erica Kato Marcus）说：“我们还从司机那里听到的一些事情是，他们也从Sophy的动作中学到了新的东西。”。艾米莉·琼斯是国际汽联认证的2020年格兰赛车锦标赛的世界决赛选手，后来与GT Sophy进行了比赛。她说：“人工智能使用的线路非常复杂，我可能只会做一次。但这太难了，我永远不会在比赛中尝试。”。虽然琼斯说，与人工智能竞争让她感到有点无能为力，但她形容这种经历令人印象深刻。\n琼斯说：“和许多体育运动一样，赛车就是尽可能接近完美的一圈，但你永远无法真正达到这一点。”。“对于索菲来说，看到完美的一圈真是太疯狂了。没有办法再跑得更快了。”\n索尼团队正在进一步开发人工智能。Wurman说：“我们为每种车轨组合培训了一名代理，GT Sophy的一个版本。”。“我们正在考虑的一件事是：我们可以训练一个单一的策略，可以在游戏中任何轨道上的任何汽车上运行吗？”在商业方面，索尼人工智能还与索尼互动娱乐子公司Polyphony Digital Gran Turismo的开发商合作，可能将GT Sophy的一个版本纳入游戏的未来更新中。要做到这一点，研究人员需要调整人工智能的性能，使其成为一个具有挑战性的对手，但即使对于技能不如迄今为止测试过人工智能的冠军的球员来说，也不是不可战胜的。\n因为Gran Turismo提供了一个关于特定汽车和特定赛道的真实近似值，以及控制每个赛道的独特物理参数，所以这项研究也可能在视频游戏之外有应用。人工智能研究公司OpenAI的软件工程师布鲁克·陈（Brooke Chan）是OpenAI五项目的合著者，该项目在Dota 2上击败了人类。他说：“我认为有趣的一点是，它与Dota游戏的区别在于，它处在一个基于物理的环境中。”。“它还没有出现在现实世界中，但仍然能够模拟现实世界的特征，因此我们正在训练人工智能，以便更了解物理世界。”（Chan没有参与GT Sophy研究。）\n斯坦福大学机械工程教授J·克里斯蒂安·格德斯（J.Christian Gerdes）没有参与这项新研究，他说：“Gran Turismo是一个非常好的模拟器，它在一些方面被游戏化了，但它确实忠实地代表了不同汽车和不同赛道的许多差异。”。“在我看来，这是最接近任何发表论文说人工智能可以在赛车环境中与人类并驾齐驱的人的事情。”\n然而，并非所有人都完全同意。Steven Shladover说：“在现实世界中，你必须处理一些事情，比如骑自行车的人、行人、动物、从卡车上摔下来的东西和掉在路上的东西，你必须能够避免这些，恶劣天气、车辆故障等等。”，加利福尼亚大学交通研究所加利福尼亚高级交通技术合作伙伴（加利福尼亚PATH）项目的研究工程师，他也没有参与《自然》杂志。“这些东西都没有出现在游戏世界中。”\n但是Gerdes说GT Sophy的成功仍然是有用的，因为它颠覆了关于自动驾驶汽车编程方式的某些假设。自动化车辆可以根据物理定律或人工智能训练做出决策。Gerdes说：“如果你看看文献中的内容，以及在某种程度上人们在路上做的事情，那么运动规划器将倾向于基于优化的物理，感知和预测部分将是人工智能。”。然而，对于GT Sophy，人工智能的运动规划（例如决定如何在不造成碰撞的情况下以其性能的最高极限接近拐角）基于公式的人工智能方面。他说：“我认为自动化汽车开发人员应该吸取的教训是：这里有一个数据点，也许我们的一些先入为主的观念需要重新审视，即这个问题的某些部分最好在物理学中完成。”。“人工智能或许也能在那里玩。”\n格德斯还表示，GT Sophy的成就可以为人类和自动化系统互动的其他领域提供借鉴。他指出，在Gran Turismo中，人工智能必须平衡实现赛道周围最快路线的难题和与往往不可预测的人类顺利互动的难题。“如果我们真的有一个人工智能系统，可以在那种环境下做出一些复杂的决策，那可能不仅仅适用于自动驾驶，”格德斯说，“但也适用于机器人辅助手术或帮助家庭的机器等交互。如果你有一项任务，其中一个人和一个机器人一起工作来移动某物，在某些方面，这比机器人试图自己做的要复杂得多。”", "note_en": "To hurtle around a corner along the fastest “racing line” without losing control, race car drivers must brake, steer and accelerate in precisely timed sequences. The process depends on the limits of friction, and they are governed by known physical laws—which means self-driving cars can learn to complete a lap at the fastest possible speed (as some  have  already done). But this becomes a much knottier problem when the automated driver has to share space with other cars. Now scientists have  unraveled the challenge virtually by training an artificial intelligence program to outpace human competitors at the ultrarealistic racing game Gran Turismo Sport. The findings could point self-driving car researchers toward new ways to make this technology function in the real world.\n  Artificial intelligence has already conquered human players within certain video games, such as  Starcraft II and  Dota 2. But Gran Turismo differs from other games in significant ways, says Peter Wurman, director of Sony AI America and co-author of the new study, which was published this week in  Nature. “In most games, the environment defines the rules and protects the users from each other,” he explains. “But in racing, the cars are very close to each other, and there’s a very refined sense of etiquette that has to be learned and deployed by the [AI] agents. In order to win, they have to be respectful of their opponents, but they also have to preserve their own driving lines and make sure that they don’t just give way.”\n  To teach their program the ropes, the Sony AI researchers used a technique called deep reinforcement learning. They rewarded the AI for certain behaviors, such as staying on the track, remaining in control of the vehicle and respecting racing etiquette. Then they set the program loose to try different ways of racing that would enable it to achieve those goals. The Sony AI team trained multiple different versions of its AI, dubbed Gran Turismo Sophy (GT Sophy), each specialized in driving one particular type of car on one particular track. Then the researchers pitted the program against human Gran Turismo champions. In the first test, conducted last July, humans achieved the highest overall team score. On the second run in October 2021, the AI broke through. It beat its human foes both individually and as a team, achieving the fastest lap times.\n  The human players seem to have taken their losses in stride, and some enjoyed pitting their wits against the AI. “Some of the things that we also heard from the drivers was that they learned new things from Sophy’s maneuvers as well,” says Erica Kato Marcus, director of strategies and partnerships at Sony AI. “The lines the AI was using were so tricky, I could probably do them once. But it was so, so difficult—I would never attempt it in a race,” says Emily Jones, who was a world finalist at the FIA-Certified Gran Turismo Championships 2020 and later raced against GT Sophy. Though Jones says competing with the AI made her feel a little powerless, she describes the experience as impressive.\n  “Racing, like a lot of sports, is all about getting as close to the perfect lap as possible, but you can never actually get there,” Jones says. “With Sophy, it was crazy to see something that was the  perfect lap. There was no way to go any faster.”\n  The Sony team is now developing the AI further. “We trained an agent, a version of GT Sophy, for each car-track combination,” Wurman says. “And one of the things we’re looking at is: Can we train a single policy that can run on any car on any of the tracks in the game?” On the commercial side, Sony AI is also working with the developer of Gran Turismo, the Sony Interactive Entertainment subsidiary Polyphony Digital, to potentially incorporate a version of GT Sophy into a future update of the game. To do this, the researchers would need to tweak the AI’s performance so it can be a challenging opponent but not invincible—even for players less skilled than the champions who have tested the AI thus far.\n  Because Gran Turismo provides a realistic approximation of specific cars and specific tracks—and of the unique physics parameters that govern each—this research might also have applications outside of video games. “I think one of the pieces that’s interesting, which does differentiate this from the Dota game, is to be in a physics-based environment,” says Brooke Chan, a software engineer at the artificial intelligence research company OpenAI and co-author of the OpenAI Five project, which beat humans at Dota 2. “It’s not out in the real world but still is able to emulate characteristics of the real world such that we’re training AI to understand the physical world a little bit more.” (Chan was not involved with the GT Sophy study.)\n  “Gran Turismo is a very good simulator—it’s gamified in a few ways, but it really does faithfully represent a lot of the differences that you would get with different cars and different tracks,” says J. Christian Gerdes, a Stanford University professor of mechanical engineering, who was not involved in the new study. “This is, in my mind, the closest thing out there to anybody publishing a paper that says AI can go toe-to-toe with humans in a racing environment.”\n  Not everyone completely agrees, however. “In the real world, you have to deal with things like bicyclists, pedestrians, animals, things that fall off trucks and drop in the road that you have to be able to avoid, bad weather, vehicle breakdowns—things like that,” says  Steven Shladover, a research engineer at the California Partners for Advanced Transportation Technology (California PATH) program at the University of California, Berkeley’s Institute of Transportation Studies, who was also not involved in the  Nature paper. “None of that stuff shows up in in the gaming world.”\n  But Gerdes says GT Sophy’s success can still be useful because it upends certain assumptions about the way self-driving cars must be programmed. An automated vehicle can make decisions based on the laws of physics or on its AI training. “If you look at what’s out there in the literature—and, to some extent, what people are putting on the road—the motion planners will tend to be physics-based in optimization, and the perception and prediction parts will be AI,” Gerdes says. With GT Sophy, however, the AI’s motion planning (such as deciding how to approach a corner at the top limit of its performance without causing a crash) was based on the AI side of the formula. “I think the lesson for automated car developers is: there’s a data point here that maybe some of our preconceived notions—that certain parts of this problem are best done in physics—need to be revisited,” he says. “AI might be able to play there as well.”\n  Gerdes also suggests that GT Sophy’s achievement could have lessons for other fields in which humans and automated systems interact. In Gran Turismo, he points out, the AI must balance the difficult problem of achieving the fastest route around the track with the difficult problem of interacting smoothly with often unpredictable humans. “If we do have an AI system that can make some sophisticated decisions in that environment, that might have applicability—not just for automated driving,” Gerdes says, “but also for interactions like robot-assisted surgery or machines that help around the home. If you have a task where a human and a robot are working together to move something, that’s, in some ways, much trickier than the robot trying to do it itself.”", "posttime": "2022-02-15 09:58:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,电子游戏,游戏,人类,outrace", "title": "人工智能现在也可以在电子游戏“Gran Turismo”中超越人类冠军", "title_en": "AI Can Now Also Outrace Human Champs in the Videogame 'Gran Turismo'", "transed": 1, "url": "https://www.scientificamerican.com/article/ai-outraces-human-champs-at-the-video-game-gran-turismo/", "via": "", "real_tags": ["人工智能", "电子游戏", "游戏", "人类", "outrace"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073356, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近发现大约500个电子商务网站被黑客入侵，他们安装了一个信用卡浏览器，当访问者试图购买时，它会偷偷窃取敏感数据。\n周二发布的一份报告只是涉及Magecart的最新一份报告。Magecart是一个总括术语，用来指那些用撇取器感染电子商务网站的相互竞争的犯罪集团。在过去几年中，成千上万的网站受到攻击，导致它们运行恶意代码。当访问者在购买过程中输入支付卡详细信息时，该代码会将该信息发送到攻击者控制的服务器。发现最新一批感染的安全公司Sansec表示，受损网站都在加载托管在naturalfreshmall[.]域的恶意脚本通用域名格式。\n公司研究人员在Twitter上写道：“Natural Fresh skimmer显示了一个虚假的支付弹出窗口，破坏了（符合PCI的）托管支付表单的安全性。”。“付款被发送到https://naturalfreshmallcom/payment/payment。php。\"\n然后，黑客修改了现有文件或植入了新文件，这些文件提供了不少于19个后门，黑客可以利用这些后门在检测到并删除恶意脚本以及更新易受攻击的软件时保留对网站的控制。对网站进行彻底消毒的唯一方法是在更新易受攻击的CMS之前识别并移除后门，该CMS首先允许网站被黑客攻击。\nSansec与黑客网站的管理员合作，确定攻击者使用的公共入口点。研究人员最终确定，攻击者在名为Quickview的Magento插件中结合了SQL注入攻击和PHP对象注入攻击。利用这些漏洞，攻击者可以直接在web服务器上执行恶意代码。\n他们通过滥用Quickview向customer_eav_属性表添加验证规则，并注入一个有效负载，诱使宿主应用程序创建恶意对象，从而完成了代码执行。然后，他们注册成为该网站的新用户。\n“然而，仅仅将其添加到数据库不会运行代码，”Sansec研究人员解释道。“Magento实际上需要取消序列化数据。这种攻击的聪明之处在于：通过使用新客户的验证规则，攻击者只需浏览Magento注册页面即可触发取消序列化。”\n在Sansec首次在Twitter上报道这一活动一周多后，不难发现仍受感染的网站。当这篇文章上线时，Bedexpress[.]com继续包含这个HTML属性，它从rogue naturalfreshmall[.]com域。\n被黑客攻击的网站运行的是Magento 1，这是一个电子商务平台的版本，于2020年6月退役。对于仍然使用这个不推荐的软件包的任何网站来说，更安全的选择是升级到最新版本的Adobe Commerce。另一种选择是使用OpenMage项目的DIY软件或Mage One的商业支持安装Magento 1可用的开源补丁。\n人们通常很难在没有特殊培训的情况下发现支付卡撇取器。一种选择是使用Malwarebytes等防病毒软件，该软件实时检查访问过的网站上提供的JavaScript。人们也可能希望避开那些似乎正在使用过时软件的网站，尽管这很难保证网站的安全。", "note_en": "About 500 e-commerce websites were recently found to be compromised by hackers who installed a credit card skimmer that surreptitiously stole sensitive data when visitors attempted to make a purchase.\n  A  report published on Tuesday is only the latest one involving Magecart, an umbrella term given to competing crime groups that infect e-commerce sites with skimmers. Over the past few years,  thousands of  sites have been  hit by exploits that cause them to run malicious code. When visitors enter payment card details during purchase, the code sends that information to attacker-controlled servers.  Sansec, the security firm that discovered the latest batch of infections, said the compromised sites were all loading malicious scripts hosted at the domain naturalfreshmall[.]com.\n “The Natural Fresh skimmer shows a fake payment popup, defeating the security of a (PCI compliant) hosted payment form,” firm researchers  wrote on Twitter. “Payments are sent to https://naturalfreshmall[.]com/payment/Payment.php.”\n The hackers then modified existing files or planted new files that provided no fewer than 19 backdoors that the hackers could use to retain control over the sites in the event the malicious script was detected and removed and the vulnerable software was updated. The only way to fully disinfect the site is to identify and remove the backdoors before updating the vulnerable CMS that allowed the site to be hacked in the first place.\n Sansec worked with the admins of hacked sites to determine the common entry point used by the attackers. The researchers eventually determined that the attackers combined a SQL injection exploit with a PHP object injection attack in a Magento plugin known as  Quickview. The exploits allowed the attackers to execute malicious code directly on the web server.\n    They accomplished this code execution by abusing Quickview to add a validation rule to the  customer_eav_attribute table and injecting a payload that tricked the host application into crafting a malicious object. Then, they signed up as a new user on the site.\n “However, just adding it to the database will not run the code,” Sansec researchers  explained. “Magento actually needs to unserialize the data. And there is the cleverness of this attack: by using the validation rules for new customers, the attacker can trigger an unserialize by simply browsing the Magento sign up page.”\n It’s not hard to find sites that remain infected more than a week after Sansec first reported the campaign on Twitter. At the time this post was going live, Bedexpress[.]com continued to contain this HTML attribute, which pulls JavaScript from the rogue naturalfreshmall[.]com domain.\n  The hacked sites were running Magento 1, a version of the e-commerce platform that was retired in June 2020. The safer bet for any site still using this deprecated package is to upgrade to the latest version of Adobe Commerce. Another option is to install open source patches available for Magento 1 using either DIY software from the  OpenMage project or with commercial support from  Mage-One.\n It’s generally hard for people to detect payment-card skimmers without special training. One option is to use antivirus software such as Malwarebytes, which examines in real time the JavaScript being served on a visited website. People also may want to steer clear of sites that appear to be using outdated software, although that’s hardly a guarantee that the site is safe.", "posttime": "2022-02-15 09:55:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,电子商务,commerce,网站", "title": "数以百计的电子商务网站被截获支付卡恶意软件", "title_en": "Hundreds of E-Commerce Sites Booby-Trapped With Payment Card-Skimming Malware", "transed": 1, "url": "https://arstechnica.com/information-technology/2022/02/hundreds-of-e-commerce-sites-booby-trapped-with-payment-card-skimming-malware/", "via": "", "real_tags": ["软件", "电子商务", "commerce", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《花花公子》的使命是在数字世界中传播其著名的兔子标志。\n该公司已经放弃了数千款以兔子化身为主角的花花公子NFT，推出了一个名为Centerfold的数字社交平台，并计划在metaverse中建造一座新的花花公子豪宅。\n这些计划在A&amp；E纪录片聚焦于公司&#39；这是令人不快的过去&#34;花花公子的秘密&#34；这是一部由10部分组成的系列剧，以该公司的前雇员、玩伴和前女友为主角&#39；《花花公子》的创始人休·赫夫纳声称《花花公子》有黑暗的一面。\n甚至在系列之前&#39；公司领导层于1月下旬发布了一封公开信，在其网站上写道，&#34；今天&#39；《花花公子》不是休·赫夫纳&#39；她是花花公子&#34;\n这些未来主义的举动发生在赫夫纳39岁之后近五年；自从上一本传统纸质杂志登上报摊已经两年了。为下一波互联网创新（技术专家称之为Web3）进行数字改造是下一个重大挑战。\n&#34;这本杂志是该公司的产品之一。但实际上是那个兔头&#39；它价值数十亿美元，不可复制；《花花公子》首席执行官本·科恩在最近的一次采访中告诉CNBC。\n虽然该品牌在全球推动了数十亿消费者支出，其中大部分是通过海外销售的授权产品，但科恩表示，商业模式已经被打破，公司需要做出改变。\n&#34;当你从营销的角度，从认知的角度来思考这个品牌代表着什么时，我们几乎在世界各地都有100%的认知，&#34；他说。\n科恩比较了《花花公子》&#39；s的品牌知名度，耐克和苹果公司的标志，也立即在全球范围内识别。\n该公司专注于利用这一点&#34；内在价值&#34；在数字世界。例如，花花公子证券交易委员会去年提交的一份文件显示，该公司斥资1200万美元购买了庞巴迪环球快车BD-700，以便科恩不仅可以在天空，而且可以在互联网上发布这一无价的兔子标志。\n这架飞机是为了纪念休·赫夫纳在&#39；70年代。全球快车（Global Express）以白色为起点，经过彻底翻新，五个月后重新出现；后来，它拥有一个光滑的全黑车身，上面装饰着兔子的标志，与它的前身相同的尾号，让赫夫纳、名人和世界各地的花花公子兔子随行。\n不像赫夫纳&#39；在这架飞机上，没有衣着暴露的花花公子兔子或水床。这架豪华喷气式飞机确实包括一个弹出式酒吧和数字迪斯科球，但科恩正在超越那些过时的功能，寻找全球快递可能为电子商务、社会影响力和营销创造的强大尾风。\n&#34;这是我们与全球影响力人士和名人合作的一种方式，&#34；他说。\n在12月最早的一次航班上，这架飞机从纽约飞往迈阿密的巴塞尔艺术中心。那次起飞恰逢著名说唱歌手#39；《花花公子》的新角色&#39；公司驻场创意总监&#39；受“大兔子”喷气式飞机重新启动的启发，该公司推出了一系列新的旅游主题服装和配饰。\n产品包括售价950美元的开司米毛毯和喷气式飞机&#39；它上面印着s的尾号N95OPB，以及一件售价350美元的皮制狩猎夹克，与喷气式飞机上独特的皮革装饰墙相配&#39；s盥洗室——所有这些都在网上独家出售。对科恩来说，这架价值1200万美元的喷气式飞机是一个飞行广告牌/零售店，当有影响力的人在飞机上时，它就成为该品牌在社交媒体上的扩音器。\n在飞往迈阿密的航班上，Cardi B创建了两个Instagram帖子，获得了近900万的浏览量。花花公子&#39；s指望说唱歌手&#39；她的影响力和1.23亿Instagram粉丝帮助复兴该品牌，并为其新企业Centerfold提供航空燃料。该公司将Centerfold描述为一个新的数字平台，推广&#34；创作自由、艺术表达和性积极&#34;\n用户付费订阅创建者#39；《花花公子》与《花花公子》分享了这一收入，使其与OnlyFans竞争。OnlyFans是一个在线订阅平台，以许多制作色情内容的创作者为特色。\n10月，科恩与女演员兼模特帕梅拉·安德森（Pamela Anderson）重聚该品牌，她曾在1989年的13个《花花公子》封面上亮相。她的最新角色：帮助宣传《花花公子》&#39；这是美国第一次大规模投放不可替代代币（NFT）。\n该公司推出了Rabbitars，这是11953件原创数字艺术作品，描绘了NFT市场OpenSea上出售的卡通兔子角色。这些Rabbitar NFT还提供独家优惠、赠品和各种metaverse体验。春天，《花花公子》计划举办一场以拉比塔尔为主题的商品发布会。什么&#39；此外，1976年大卫·鲍伊（David Bowie）、1970年滑水板上的花花公子兔子（Playboy bunny）和1973年4月的花花公子封面的档案照片已被制成NFT。\n&#34;我们的档案中有1000万条内容，随着NFT的发展，我们也可以删除这些内容；科恩说。\n这位首席执行官还计划带回《花花公子》的豪宅，但这次是以数字形式。\n&#34;我看到《宅邸》在《元宇宙》中首先回归，因为我认为我们可以通过它接触到全球观众。这将是我们会员计划的一部分；科恩说&#34;然后我可以看到一个未来的世界，我们也有实体大厦&#34;\n《花花公子》在最受欢迎的虚拟世界之一Decentraland举办了派对，但它尚未为metaverse豪宅选址。\n&#34;随着我们进入2022年，我们&#39；我们将从花花公子会员开始，会员将获得一系列好处，我们的许多会员将基于区块链，&#34；科恩说。\n当科恩展望未来时，10小时长的&#34；花花公子的秘密&#34；上个月，该公司被迫公开承认自己的过去。不过，公司领导层还是选择了抢先一步。在该剧播出前的一封公开信中，它表示支持那些站出来谈论自己在《花花公子》世界经历的人。\n&#34;作为一个以性积极为核心的品牌，我们相信安全、安保和责任是最重要的，任何不安全的事情都是不可原谅的；信上说。\n科恩告诉CNBC，在他的领导下，《花花公子》取得了长足的进步，现在可以夸耀其80%的员工是女性&#34;我认为&#39；这是一个很好的迹象，表明公司在哪里#39；正在向前迈进&#34；他说。\n他还指出，《花花公子》正在揭开历史的新篇章，这标志着消费者人口结构发生了巨大变化。\n&#34;如果你看看我们观众的平均年龄，75%的观众在34岁以下。如今，我们超过50%的销售对象是女性——与四年前相比，这是一家截然不同的公司；他说。", "note_en": "Playboy is on a mission to spread its famous bunny logo across the digital universe.\n The company has dropped thousands of Playboy NFTs featuring bunny avatars, launched a digital social platform called Centerfold and has plans to build a new Playboy Mansion in the metaverse.\n  These plans are unfolding while an A&amp;E documentary focuses on the company&#39;s unflattering past. &#34;Secrets of Playboy&#34; is a 10-part series making headlines by featuring former employees, playmates and past girlfriends of the company&#39;s founder, Hugh Hefner, alleging Playboy had a dark side.\n Even before the series&#39; debuted in late January, company leadership posted an open letter to its website noting, &#34;today&#39;s Playboy is not Hugh Hefner&#39;s Playboy.&#34;\n The futuristic moves come almost five years after Hefner&#39;s death and two years since the last legacy print magazine hit the newsstands. Staging its digital reinvention for the next wave of internet innovation, which technologists call Web3, is the next big challenge.\n &#34;The magazine was one product of the company. But it was really that rabbit head that&#39;s worth billions and billions of dollars and not replicable,&#34; Playboy CEO Ben Kohn told CNBC in a recent interview.\n While the brand drives billions in consumer spending worldwide, much of it through licensed products sold overseas, Kohn said that business model is broken and that the company needs to make changes.\n   &#34;When you think about what this brand represents, from a marketing perspective, from an awareness perspective, we pretty much have 100% awareness everywhere in the world,&#34; he said.\n Kohn compared Playboy&#39;s brand awareness to  Nike and  Apple — companies with logos that are also instantly recognizable across the globe.\n The company is focused on trying to leverage that &#34;inherent value&#34; in the digital world. For example, a Playboy SEC filing last year shows the company paid $12 million to purchase a Bombardier Global Express BD-700 so Kohn could unleash that priceless bunny logo across not just the sky, but also on the internet.\n  The plane is an homage to the black-painted DC-9, known as the Big Bunny, flown by Hugh Hefner in the &#39;70s.  The Global Express, which started off white, was gut-renovated before re-emerging five month&#39;s later with a sleek all-black body emblazoned with bunny logos and the same tail number used on its predecessor that whisked Hefner, celebrities and an entourage of Playboy bunnies around the world.\n  Unlike Hefner&#39;s plane, there are no scantily-clad Playboy bunnies or a waterbed on this ride.  The luxury jet does include a pop-up bar and digital disco balls, but Kohn is looking beyond those dated features to the potential the powerful tail wind the Global Express could create for e-commerce, social influence and marketing.\n &#34;This is a way for us to work with influencers and celebrities on a global basis, in a collaborative way,&#34; he said.\n  On one of its earliest flights in December, the plane shuttled Cardi B from New York to Art Basel in Miami. That takeoff coincided with the announcement of the famous rapper&#39;s new role as Playboy&#39;s creative director in residency and the company&#39;s launch of a new travel-themed line of apparel and accessories inspired by the the relaunch of the Big Bunny jet.\n  Offerings include a $950 cashmere blanket with the jet&#39;s tail number, N95OPB, printed across it and a $350 leather safari jacket that matches the distinctive leather upholstered walls in the jet&#39;s lavatory — all of it exclusively sold online. For Kohn the $12 million jet is a flying billboard/retail store, and when influencers are on board it becomes a megaphone for the brand on social media.\n On her flight to Miami, Cardi B created two Instagram posts that racked up almost 9 million views. Playboy&#39;s counting on the rapper&#39;s influence and her 123 million Instagram followers to help revive the brand and provide jet fuel for Centerfold, its new venture. The company describes Centerfold as a new digital platform that promotes &#34;creative freedom, artistic expression and sex positivity.&#34;\n Users pay fees to subscribe to a creator&#39;s content and the creator splits that revenue with Playboy, putting it in competition with OnlyFans, an online subscription platform known for featuring many creators who produce sexually explicit content.\n In October, Kohn reunited the brand with actress and model Pamela Anderson, who was featured on 13 Playboy covers dating back to 1989. Her latest role: helping promote Playboy&#39;s first giant drop of non-fungible tokens, or NFTs.\n The company has unleashed Rabbitars, 11,953 original digital artworks that depict cartoon-like bunny characters sold on OpenSea, an NFT marketplace. These Rabbitar NFTs also unlock exclusive offers, giveaways and assorted metaverse experiences. In the spring, Playboy plans a Rabbitar-themed merchandise drop. What&#39;s more, archival photos of David Bowie from 1976, a Playboy bunny on water skis from 1970 and a Playboy cover from April 1973 have been turned into NFTs.\n &#34;We have 10 million pieces of content in our archive that we can also drop as NFTs moving forward,&#34; Kohn said.\n The CEO also has plans to bring back the Playboy Mansion, but this time in a digital form.\n  &#34;I look at [the mansion] coming back first in the metaverse, because I think we can reach a global audience through that. It will be part of our membership plan,&#34; Kohn said. &#34;And then I can see a world down the road where we have physical mansions as well.&#34;\n Playboy has thrown parties in Decentraland, one of the most popular virtual worlds, but it has yet to choose a site for its metaverse mansion.\n &#34;As we move into 2022, we&#39;ll begin with Playboy membership and members will have a whole host of benefits moving forward and a lot of our membership will be based on blockchain,&#34;  Kohn said.\n While Kohn looks toward the future, the release of the 10 hour-long &#34;Secrets of Playboy&#34; last month forces the company to publicly acknowledge its past. Company leadership chose to try to get ahead of the story, though. In an open letter before the series aired, it voiced support for those who came forward to talk about their experiences in the world of Playboy.\n &#34;As a brand with sex positivity at its core, we believe safety, security and accountability are paramount, and anything less is inexcusable,&#34; the letter said.\n Kohn told CNBC that under his leadership Playboy has come a long way and can now boast that 80% of its employees are women. &#34;And I think that&#39;s a great sign for where the company&#39;s moving going forward,&#34; he said.\n He also pointed to a dramatic shift in consumer demographics as a sign that Playboy is opening a new chapter in its history.\n &#34;If you look at the average age of our audience, 75% of them are under 34. Today, over 50% of our sales are to women — that is a dramatically different company than where we were four years ago,&#34; he said.", "posttime": "2022-02-15 09:47:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "metaverse,build,花花公子", "title": "花花公子想在Metaverse建造一座新的豪宅", "title_en": "Playboy Wants To Build a New Mansion In the Metaverse", "transed": 1, "url": "https://www.cnbc.com/2022/02/11/playboy-plans-to-join-the-metaverse.html", "via": "", "real_tags": ["metaverse", "build", "花花公子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "受欢迎的视频会议平台Zoom本周发布了macOS应用程序的重要更新，此前有用户报告称，会议结束后麦克风未被禁用。幸运的是，据该公司称，这只是一个现已修复的漏洞。\n自去年12月以来，许多用户一直在抱怨Zoom社区（通过注册）中的这个漏洞。据他们说，Mac的麦克风即使在Zoom会议结束后仍保持活动状态，这当然会引起隐私问题。\n由于macOS Monterey推出了一项新的隐私功能，当应用程序使用麦克风时，菜单栏上会显示一个橙色圆点，用户可以立即注意到Zoom应用程序有问题。虽然该漏洞的原因尚不清楚，但该公司现在已经修复了它。\nZoom已经确认，其macOS应用程序中存在一个漏洞，可能会导致橙色麦克风使用中指示灯出现，即使在离开通话后。据一位公司代表说，最新版本的应用程序不再有这个问题。\n我们遇到了一个与macOS Zoom客户端相关的错误，它可能会显示在离开会议、电话或网络研讨会后，橙色指示灯继续出现。macOS版本5.9.3的Zoom客户端解决了此错误，我们建议您更新到版本5.9.3以应用修复程序。\n当然，用户大多持怀疑态度，因为Zoom没有担心用户数据隐私的良好记录。去年8月，该平台因谎称其服务上有端到端加密而被罚款8500万美元。\n该公司要求Zoom用户将应用程序更新至可用的最新版本，并建议保持自动更新功能，以便在安全补丁发布后立即获取。\n你正在阅读的是9to5Mac——日复一日地发布苹果及其周边生态系统新闻的专家。请务必查看我们的主页，了解所有最新消息，并在Twitter、Facebook和LinkedIn上关注9to5Mac，以了解最新消息。不知道从哪里开始？查看我们的独家报道、评论、操作指南，并订阅我们的YouTube频道", "note_en": "Popular video conferencing platform  Zoom this week released an important update to its macOS app following user reports about the microphone not being disabled after ending a conference. Luckily, according to the company, this was just a bug that has now been fixed.\n  Since December last year, a number of users have been complaining about this bug in the  Zoom Community (via   The Register). According to them, the Mac’s microphone stayed active even after ending a Zoom conference – which certainly raised privacy concerns.\n Thanks to a new privacy feature introduced with macOS Monterey that shows an orange dot in the menu bar when an app is using the microphone, users were able to immediately notice that there was something wrong with the Zoom app. Although the causes of the bug were unknown, the company has now fixed it.\n Zoom has confirmed that there was a bug in its macOS app that could cause the orange microphone-in-use indicator to appear even after leaving a call. According to a company representative, the latest version of the app no longer has this problem.\n We experienced a bug relating to the Zoom client for macOS, which could show the orange indicator light continue to appear after having left a meeting, call, or webinar. This bug was addressed in the Zoom client for macOS version 5.9.3 and we recommend you update to version 5.9.3 to apply the fix.\n Of course, users were mostly suspicious because Zoom doesn’t have a good track record of worrying about users’ data privacy. In August last year, the platform  was fined $85 million after it lied about having end-to-end encryption on its services.\n The company asks Zoom users to update the app to the latest version available, and it also recommends keeping automatic updates enabled to get security patches as soon as they are released.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2022-02-15 09:33:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "保持,update,zoom", "title": "Zoom Update可防止在Mac上通话后麦克风保持活动状态", "title_en": "Zoom Update Prevents Microphone From Staying Active After Calls On Mac", "transed": 1, "url": "https://9to5mac.com/2022/02/11/zoom-update-prevents-microphone-from-staying-active-after-calls-on-mac%EF%BF%BC%EF%BF%BC%EF%BF%BC%EF%BF%BC%EF%BF%BC%EF%BF%BC%EF%BF%BC%EF%BF%BC%EF%BF%BC%EF%BF%BC/", "via": "", "real_tags": ["保持", "update", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透2月11日电---据《华尔街日报》周五援引知情人士的话报道，网络设备制造商思科系统公司（Cisco Systems Inc.）已向软件制造商Splunk Inc.发出价值逾200亿美元的收购要约。\n该报援引部分消息人士的话称，该提议是最近提出的，两家公司没有进行积极谈判。\n思科没有立即回应置评请求。Splunk表示不会对谣言或猜测发表评论。\n去年11月，总部位于旧金山的Splunk宣布Doug Merritt已辞去首席执行官（CEO）的职务，该公司&#39；董事会主席格雷厄姆·史密斯将担任临时首席执行官。\n根据Refinitiv Eikon数据，这家软件解决方案提供商成立于2003年，市值182亿美元。\nNidumolu和Juby Babu在班加罗尔的报道；编辑：Leslie Adler、Richard Chang和Sandra Maler", "note_en": "Feb 11 (Reuters) - Network gear maker Cisco Systems Inc  (CSCO.O) has made a takeover offer worth more than $20 billion for software maker Splunk Inc  (SPLK.O), the Wall Street Journal reported on Friday, citing people familiar with the matter.\n The offer was made recently and the companies are not in active talks, the newspaper  said, citing some of the sources.\n Cisco did not immediately respond to a request for comment. Splunk said it does not comment on rumors or speculation.\n In November last year, San Francisco-based Splunk announced Doug Merritt has stepped down as its chief executive officer (CEO) and that the company&#39;s chair, Graham Smith, would be the interim CEO.\n Founded in 2003, the software solutions provider has a market capitalisation of $18.2 billion, according to Refinitiv Eikon data.\n  Reporting by Jahnavi Nidumolu and Juby Babu in Bengaluru; Editing by Leslie Adler, Richard Chang and Sandra Maler", "posttime": "2022-02-15 09:32:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "思科,takeover,splunk", "title": "思科提出200多亿美元收购Splunk", "title_en": "Cisco Made $20 Billion-Plus Takeover Offer For Splunk", "transed": 1, "url": "https://www.reuters.com/technology/cisco-made-20-billion-plus-takeover-offer-splunk-wsj-2022-02-11/", "via": "", "real_tags": ["思科", "takeover", "splunk"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国核管理委员会（nuclear Regulatory Commission）监察长办公室（inspector general’s office）的一项调查发现，美国至少有一些核电站含有可能构成重大风险的假冒零部件。2月9日发布的报告称，这些部分“提出了可能产生严重后果的核安全和安保担忧”。\n尽管几十年来，对安全和核废料的担忧一直困扰着核电行业，但这项新发现是在人们越来越热衷于将核能作为无碳能源，帮助各国实现气候目标之际出现的。\n这项调查是在未具名的个人声称“大多数，如果不是全部的话”，美国的核电站都有假冒或有缺陷的部件之后进行的。作为调查的一部分，监察长办公室发现了几家不同工厂的假冒零件问题。报告还说，能源部仅在去年就分别标记了100起涉及假冒零部件的“事件”。如果美国推进将核能纳入其向清洁能源过渡的计划，它将不得不打击这个问题。报告警告称，如果美国核管理委员会不加强监督，假冒零部件在美国核电站被忽视的风险可能会上升。\n作为调查的一部分，监察长办公室寻找被非法改装成合法产品的零件、被“故意歪曲以欺骗”的零件以及不符合产品规格的零件。它对美国各地的四座发电厂进行了抽样调查，并在其中一座位于中西部的发电厂发现了假冒零部件的证据。它还指出了东北部的核电站，与它抽样调查的核电站不同。在那里，“地位良好的NRC负责人”发现，假冒部件与两个单独的部件故障有关。\nNRC负责人发现的第一个故障是一个用于应急服务的水泵轴，安装后不久就断裂了。在东北部的另一家工厂，用于识别蒸汽管线破裂的“安全相关区域”的温度监测器突然“以显著增加的速度”失灵在那次故障之前，一些仪器已经用有缺陷的零件进行了维修。\n报告警告称，NRC可能低估了假冒零件的流行率，因为监管机构没有一个强大的系统来跟踪有问题的零件。它只要求工厂在特殊情况下报告假货，比如导致反应堆紧急关闭。报告还指出，NRC尚未彻底调查所有假冒指控。截至2021年9月，美国共有55座核电站运行，检查员办公室的报告仅为四份。\nNRC公共事务官员斯科特·伯内尔（Scott Burnell）在一封电子邮件中告诉Verge，“报告中没有任何内容表明存在直接的安全问题。NRC运营执行董事办公室正在彻底审查该报告，并将指示该机构的项目办公室采取适当行动。”\n包括电力研究所（Electric Power Research Institute）和国际原子能机构（International Atomic Energy Agency，IAEA）在内的其他组织近年来也在美国和国外的核电站中发现了假冒阀门、轴承、断路器、管件和结构钢。国际原子能机构2019年的一份报告指出，在全球核电行业和其他行业，这是一个日益严重的问题。\n随着各国做出应对气候变化的新承诺，关于增加还是减少核能的辩论正在升级。欧盟最近提出了一项有争议的提案，将核能列为可持续投资，导致欧盟成员国分裂。尽管出于安全考虑，德国计划在今年退役所有剩余的核发电机，但法国昨天表示，它将建造14座新反应堆。法国已经比世界上任何其他国家都更多地依赖核能发电。\n今天，美国能源部呼吁公众对一个60亿美元的新项目进行投入，以使老化的核参与者保持在线。两党基础设施法为该项目提供资金，这也符合拜登政府到2035年实现100%清洁能源电网的目标。", "note_en": "At least some nuclear power plants in the US contain counterfeit parts that could pose significant risks, an investigation by the inspector general’s office of the Nuclear Regulatory Commission has found. Those parts “present nuclear safety and security concerns that could have serious consequences,” says the resulting  report published on February 9th.\n While concerns about safety and nuclear waste have vexed the nuclear power industry for decades, the new findings come amidst growing enthusiasm for nuclear energy as a carbon-free power source that can help nations meet their climate goals.\n The investigation was conducted after unnamed individuals alleged that “most, if not all,” nuclear plants in the US have fake or faulty parts. The inspector general’s office uncovered problems with counterfeit parts at a few different plants as part of its investigation. The report also says that the DOE had separately flagged 100 “incidents” involving counterfeit parts just last year. It’s a problem that the US will have to crack down on if it moves forward with plans to include nuclear power in its transition to clean energy. Without greater oversight at the NRC, the report warns, the risk of counterfeit parts going unnoticed in the nation’s nuclear power plants could rise.\n  As part of its inquiry, the inspector general’s office looked for parts that are illegally altered to look like legitimate products, parts that are “intentionally misrepresented to deceive,” and parts that don’t meet product specifications. It sampled four power plants across the US and found evidence of counterfeit parts at one of those plants in the midwest. It also points to nuclear power plants in the Northeast, separate from those it sampled,  where a “well-placed NRC principal” found that counterfeit parts were involved in two separate component failures.\n The first failure identified by the NRC principal was a water pump shaft used for emergency service that snapped soon after being installed. At a separate plant in the Northeast, temperature monitors in “safety-related areas” that are used to identify steam line breaks suddenly failed “at a significantly increased rate.” Prior to that failure, some of the instruments had been repaired using defective parts.\n The NRC might be underestimating the prevalence of counterfeit parts, the report warns, because the regulatory agency doesn’t have a robust system in place for tracking problematic parts. It only requires plants to report counterfeits in extraordinary circumstances, like if they lead to an emergency shutdown of a reactor. The report also notes that the NRC hasn’t thoroughly investigated all counterfeit allegations. There were  55 nuclear power plants operating in the US as of September 2021, and the inspector general’s office sampled just four for its report.\n NRC Public Affairs Officer Scott Burnell told  The Verge in an email that “nothing in the report suggests an immediate safety concern. The NRC’s office of the Executive Director for Operations is thoroughly reviewing the report and will direct the agency’s program offices to take appropriate action.”\n Other groups, including the Electric Power Research Institute and the International Atomic Energy Agency (IAEA), have also identified counterfeit valves, bearings, circuit breakers, pipe fittings, and structural steel in nuclear power plants in the US and abroad in recent years. They’re a growing problem across the nuclear power sector and other industries worldwide, notes a 2019 IAEA  report.\n The debate over whether to ramp up or tamp down nuclear energy is escalating as countries make new pledges to combat climate change. The EU recently made a  controversial proposal to classify nuclear energy as a sustainable investment, dividing members of the bloc. While Germany plans to retire all of its remaining nuclear generators this year over safety concerns, France — which already relies on nuclear energy for more of its electricity than any other country in the world — said yesterday that it would build  14 new reactors.\n Today, the US Department of Energy  called for public input on a new $6 billion program to keep aging nuclear actors online. The bipartisan infrastructure law funds the program, which also plays into the Biden administration’s aim of achieving a 100 percent clean energy grid by 2035.", "posttime": "2022-02-15 09:30:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,发现,power,核能", "title": "报告发现，美国核电站含有危险的假冒部件", "title_en": "US Nuclear Power Plants Contain Dangerous Counterfeit Parts, Report Finds", "transed": 1, "url": "https://www.theverge.com/2022/2/11/22929255/us-nuclear-power-plants-dangerous-counterfeit-parts-nrc-report", "via": "", "real_tags": ["美国", "发现", "power", "核能"]}]