[{"category": "", "categoryclass": "", "imagename": "7d3c8e80c7f7775265e373b7a25ddc8b.jpg", "infoid": 1069128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔即将推出的 Alder Lake 平台的新泄漏表明，这些芯片的性能可能优于 AMD 的 Ryzen 5000 系列。基准测试显示，旗舰英特尔酷睿 i9-12900K 在 Cinebench R20 中的性能比 AMD 的 Ryzen 5950X 在多核测试中高出约 18%，在单核测试中高出惊人的 28%。泄密者 OneRaichu 表示，i9-12900K 的合格样品在 Cinebench R20 的多核测试中获得了 11,600 以上的分数，在单核测试中获得了 810 分以上。这些结果使处理器在与 AMD 的直接竞争中遥遥领先，尤其是在单核性能方面。在 Guru3D 的测试中，锐龙 5950X 在 Cinebench R20 中获得了 10,409 的多核分数和 643 的单核分数。这使 12900K 的单核性能提高了约 11%，多核性能提高了 23%。泄密者表示，12900K 的结果是在没有超频的情况下通过水冷收集的，因此最终得分可能会更高。 PCGamer 的测试对 12900K 更有利。它对 5950X 的测试表明，12900K 在多核测试中的速度可以提高 18%，在单核测试中可以提高 28%。更有趣的是，测试显示12900K的速度是它将在多核测试中取代的i9-11900K的两倍多。 12900K 的分数与上周进行的性能评估相匹配。在多核和单核性能提升之间，12900K 可以巩固英特尔作为游戏和生产力的首选品牌。也就是说，我们还没有任何确定的基准。据传，Core i9-12900K 配备 16 个内核和 24 个线程，时钟速度高达 5.3GHz。该处理器采用领先的英特尔Alder Lake平台，采用big.LITTLE内核设计，在同一处理器上利用高性能和高效率的内核。\n这种混合设计出现在许多移动处理器中。处理器能够将工作委派给适当的内核，而不是用大量的电源来打包每个内核。因此，要求高的任务将交给大核，而轻量级的任务将交给小核，从而提高了处理器的效率。有传言称即将推出的 Windows 11 将利用这种混合设计，将单核性能提高多达 8.2%。我们不知道泄露的基准测试使用的是什么操作系统，更不用说整体系统配置了。但是，Windows 11 可以进一步改善结果，特别是在强调单核的任务中。英特尔还没有揭开 Alder Lake 的面纱。尽管多次泄漏和谣言让我们对范围如何形成有了一个不错的了解，但我们必须等待发布和进一步测试才能得出任何明确的结论。如果结果接近 OneRaichu 的建议，英特尔可能会在令人失望的 Rocket Lake 发布后爬回榜首。", "note_en": "A new leak for Intel’s upcoming  Alder Lake platform shows that the chips may outperform AMD’s Ryzen 5000 series. The benchmark shows the flagship Intel Core i9-12900K outperforming AMD’s Ryzen 5950X in Cinebench R20 by around 18% in the multi-core test and a staggering 28% in the single-core test.\n Leaker  OneRaichu said a qualification sample of the i9-12900K earned a score of above 11,600 in the multi-core test and above 810 in the single-core test in Cinebench R20. Those results put the processor firmly ahead of its direct competition from AMD, particularly when it comes to single-core performance.\n  In  Guru3D’s testing, the Ryzen 5950X earned a multi-core score of 10,409 and a single-core score of 643 in Cinebench R20. That puts the 12900K at around 11% faster in single-core performance and 23% faster in multi-core performance.\n The leaker says the results for the 12900K were gathered with a water-cooling without overclocking, so it’s possible the final score could be even higher.\n PCGamer’s tests are even more favorable to the 12900K. Its testing of the 5950X reveals that the 12900K could be as much as 18% faster in the multi-core test and 28% faster in the single-core test. Even more interesting, the testing reveals that the 12900K is more than twice as fast as the i9-11900K that it will replace in the multi-core test.\n The scores for the 12900K match  a performance estimate that made the rounds last week. Between multi-core and single-core performance gains, the 12900K could cement Intel as the go-to brand for both gaming and productivity. That said, we don’t have any firm benchmarks yet.\n  The  Core i9-12900K is rumored to come with 16 cores and 24 threads with a boost clock speed of up to 5.3GHz. Leading Intel’s Alder Lake platform, the processor adopts a big.LITTLE core design that utilizes high-performance and high-efficiency cores on the same processor.\n This hybrid design shows up in many mobile processors. Instead of packing each core with a ton of power, the processor is able to delegate work to an appropriate core. So, a demanding task will go to the big core while a lightweight one will go to a little core, which improves the processor’s efficiency.\n The upcoming Windows 11 is  rumored to take advantage of this hybrid design, offering up to an 8.2% improvement in single-core performance. We don’t know what operating system the leaked benchmarks were using, much less the overall system configuration. However, Windows 11 could improve results further, particularly in tasks that stress a single core.\n Intel hasn’t lifted the veil on Alder Lake yet. Although multiple leaks and rumors give us a decent idea of how the range is shaping up, we have to wait for launch and further testing to draw any firm conclusions. If the results are anywhere near what OneRaichu is suggesting, Intel could crawl its way back to the top after the disappointing  Rocket Lake launch.", "posttime": "2021-07-23 06:49:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,intel,性能", "title": "泄露的英特尔 i9-12900K 基准测试显示优于 Ryzen 5950X", "title_en": "Leaked Intel i9-12900K Benchmark Shows Gains Over the Ryzen 5950X", "transed": 1, "url": "https://www.digitaltrends.com/computing/leaked-intel-12900k-benchmark-outperforms-amd-5950x/", "via": "", "real_tags": ["英特尔", "intel", "性能"]}, {"category": "", "categoryclass": "", "imagename": "d5d1b828613c2c64957da08fdccd57c8.png", "infoid": 1069127, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "机密计算支持始终加密且可验证的数据处理 - 在云中和其他地方。开发过去需要神秘知识和重大代码更改的机密应用程序。使用 EGo，您可以跳过它并像往常一样开发 Go 代码。使用 EGo，您无需重构您的应用程序即可在安全的飞地中运行它。只需使用三个简单的命令来构建、签名和运行您的代码——无论是 10 行还是 100,000 行具有复杂依赖关系的 Go。最好的事？ EGo 是完全开源的。在这篇博文中，我们将分享 EGo 的设计方法、我们在开发 EGo 时面临的最大挑战以及我们的一些关键原则。此外，我们还对 EGo 未来的其他计划进行了小规模预览。当我们开始在 EGo 上工作时，我们已经为可信执行环境构建了一个名为 Edgeless RT 的 SDK。这个项目是我们全面支持 Go 的内部解决方案，但与大多数其他 SDK 一样，它对新用户有很大的进入门槛。在使用 RT 时，我们问自己如何使机密计算更易于访问；特别是对于在机密计算社区中迈出第一步的新用户。我们的愿景很明确：我们希望创建一个提供有意义的易用性的 SDK。我们希望通过尽可能接近已知且经过验证的 Go UX 来实现这一目标。这将通过仔细选择要突出显示和忽略哪些机密计算的细节来完成，将一些更令人困惑的方面移到背景中，使最相关的功能成为中心舞台。经过仔细考虑，基于 Go 构建 SDK 感觉是一个自然的选择。首先，Go 是最相关和最直接的编程语言之一。最重要的是，它的内存安全功能提供了一个理想的安全层。但最重要的是，我们希望为那些对机密计算安全功能感兴趣但不一定对学科的来龙去脉感兴趣的开发人员提供一个简单的解决方案。针对那些最能从机密计算中受益的用例定制 EGo 是合乎逻辑的步骤——而且由于云原生空间为此类实现提供了最大的潜力，我们寻求支持其领先的编程语言。很难预测未来将在机密计算中建立什么标准，但我们认为，大多数现实世界的应用程序迟早会默认在安全区中运行大部分代码。通过将所有代码移动到 enclave，移植已经存在的应用程序成为一个简单的过程。在将 Go 移植到 enclave 时，我们必须处理语言及其编译器的一些技术上具有挑战性的细节。一种是 Go 程序如何访问操作系统的服务，如文件系统或网络套接字。 Linux 上的大多数语言都编译为与 libc 接口的本机代码。 （libc 实现了标准 C 库以及 POSIX API。）反过来，libc 执行系统调用以从操作系统内核请求服务。 Go 然而直接执行 SYSCALLs 本身。在飞地内，这是一条非法指令，因为按照设计，不应访问 TEE 之外的任何内容。为了解决这个问题，我们必须修改 Go 编译器，以便将 SYSCALL 重定向到 libc：\n然后，飞地的 libc/syscall 层要么在内部处理系统调用，要么调用主机，例如，在网络上写入文件或发送数据。此外，我们必须扩展 Open Enclave。 Open Enclave 是机密计算领域最成熟的 SDK 之一，但它仍然缺乏一些基本的 POSIX 功能，例如 pthread 和 mmap。幸运的是，当我们开始开发 EGo：Edgeless RT 时，我们已经构建了 Open Enclave 的扩展版本。你可以在这里找到 Open Enclave，它是一个具有卓越代码质量的项目。最后思考：使用 EGo，我们忽略了我们从其他 CC SDK 中了解到的关于工作流的所有信息。我们的方法将用户放在首位。因此，我们让 EGo 尽可能接近 Go，同时增加了签名、证明和密封的关键功能。设计工具和 API，使其难以被错误使用：EGo 消除了深入研究高级机密计算主题（例如所需的加密参数）的需要。相反，当用户调用“ego sign myapp”时，如果尚不存在，EGo 只会生成一个合适的密钥。 “SealWithProductKey(plaintext []byte)”也是如此：此 API 函数处理所有 SGX 密封细节，例如添加一些元数据以确保密钥在 CPU 微码更新后仍然有效。这使得开发变得简单而安全，并温和地促使用户从一开始就正确使用 EGo。实施是关键：在 EGo 中，我们将开发职责分给了三个开发人员：一名开发人员担任产品负责人，并首先创建了一个工作原型以确保项目的可行性。然后，所有三位开发人员详细计划了进一步的实施，然后他们将工作量分摊到自己身上。自然，这需要额外的时间，但同时通过公共项目库确保高质量，然后通过单元测试、集成测试和代码审查迭代扩展。尽管 EGo 已经使构建和部署 Go 机密应用程序变得非常容易，但我们才刚刚开始。以下是我们目前正在开发的功能的简短概述： 可重现的构建：我们认为机密计算与开源结合特别有意义：对一段封闭源代码的远程证明声明的意义是有限的。用户应该能够建立从证明报告到 Github 项目等的连接。理想情况下，飞地的身份应该映射准确的源代码版本。为了实现这一点，我们将向 EGo 添加可重现的构建，以便（高级）用户可以编译应用程序并将生成的 enclave 哈希与证明报告中的哈希进行比较。\n云外机器上的简化证明：目前，如果您想在云环境之外运行 EGo，您必须设置一些证明基础设施。当然，这很乏味，与我们追求的简单性不符。这就是为什么我们正在考虑简化证明的方法，以便 EGo 可以在开发机器或本地部署上使用而不会出现任何进一步的麻烦。透明文件加密：这是一个还在考虑阶段的功能。机密计算环境中的文件加密比在传统环境中更难实现，这就是为什么一些 SDK 一开始不提供它的原因。那些这样做，要么有缺陷，要么有使用限制。目前，EGo 有一个未加密的主机文件系统和一个临时的飞地内存文件系统。我们的目标是通过使用透明加密挂载目录的能力来补充这一点。现在好奇吗？如果您想了解有关 EGo 的更多信息，您应该查看我们的 GitHub 存储库或使用以下命令开始：此外，您应该查看由 EGo 维护者 Moritz Eckert 于 6 月 30 日举办的网络研讨会“轻松构建机密 Go 应用程序”。请点击这里免费注册。", "note_en": "Confidential computing enables the always-encrypted and verifiable processing of data — in the cloud and elsewhere. Developing confidential apps used to require arcane knowledge and significant code changes.  With EGo, you can skip that and develop your Go code as usual. With EGo, you don’t need to refactor your app to run it in a secure enclave. Just use three simple commands to build, sign, and run your code — be it 10 or 100,000 lines of Go with complex dependencies. Best thing? EGo is completely open-source.\n In this blog post, we share EGo’s design approach, the biggest challenges we faced while developing EGo, and some of our key principles. Furthermore, we give a small preview of what else is planned for EGo in the future.\n  When we started our work on EGo, we had already built an SDK for Trusted Execution Environments called  Edgeless RT. This project was our internal solution for comprehensive Go support, but like most other SDKs, it had significant entry barriers for new users. While using RT, we asked ourselves how we could make confidential computing more accessible; especially for new users who are taking their first steps in the  confidential computing community.\n Our vision was clear: we wanted to create an SDK that offers meaningful  ease of use. We wanted to achieve this by sticking as closely as possible to the known and proven Go UX. This would be done by carefully choosing which specifics of confidential computing to highlight and which to ignore, moving some of the more confusing aspects into the background so the most relevant features take the center stage.\n After careful consideration, building the SDK based on Go felt like a natural choice. First off, Go is one of the most relevant and straightforward programming languages. On top of that, its memory safety features provide a desirable layer of security. But most of all, we wanted to provide a simple solution for developers who are interested in confidential computing security features but not necessarily in the ins and outs of the discipline. It was a logical step to tailor EGo to those use cases which can benefit from confidential computing the most — and since the cloud-native space offers the largest potential for such implementations, we sought to support its leading programming language.\n  It is difficult to predict what standards will be established in confidential computing in the future, but we think it is likely that, sooner or later, most real-world apps will run most of their code within the enclave by default. By moving all code into the enclave, porting already existing applications becomes a straightforward process.\n  When porting Go to the enclave, we had to deal with some technically challenging specifics of the language and its compiler. One is how Go programs access the operating system’s services like filesystems or network sockets. Most languages on Linux that compile to native code interface with libc. (libc implements the standard C library as well as the POSIX API.) libc, in turn, executes system calls to request services from the OS’s kernel. Go however directly executes SYSCALLs itself. Inside an enclave, this is an illegal instruction since nothing is supposed to access anything outside the TEE by design. To solve this, we had to modify the Go compiler such that SYSCALLs are redirected to libc instead:\n  The enclave’s libc/syscall layer then either handles syscalls internally or calls out to the host, e.g., to write files or send data on a network.\n Additionally, we had to extend Open Enclave. Open Enclave is one of the most mature SDKs in the confidential computing realm, but it still lacks some essential POSIX features such as pthread and mmap. Luckily, we had already built an extended version of Open Enclave when we started the development of EGo:  Edgeless RT.  You can find Open Enclave here, it is a project with exceptional code quality.\n  Think from the end: With EGo, we ignored everything we knew about workflows from other CC SDKs. Our approach puts the user first. Therefore, we kept EGo as close as possible to Go, while adding the key features of signing, attestation, and sealing.\n Design tools and APIs such that they are hard to use incorrectly: EGo removes the need to take a deep dive into advanced confidential computing topics such as required crypto parameters. Instead, when a user calls “ego sign myapp”, EGo simply generates a fitting key if none exists yet. The same happens with “SealWithProductKey(plaintext []byte)“: this API function handles all the SGX sealing details like adding some metadata to ensure that the key remains valid after a CPU microcode update. This makes development simple as well as secure and gently nudges users towards using EGo correctly from the start.\n Implementation is key: With EGo, we split our development duties between three devs: One developer acted as the product owner and first created a working prototype to ensure the feasibility of the project. Further implementation was then planned in detail by all three developers, who then split the workload among themselves. Naturally, this took additional time but simultaneously ensured high quality via the common project base, which was then expanded iteratively with unit tests, integration tests, and code reviews.\n  Although EGo already makes it super easy to build and deploy Go confidential apps, we’re just getting started. Here is a short overview of the features we are currently working on:\n Reproducible builds: We think that confidential computing especially makes sense in combination with open source: the meaningfulness of a remote attestation statement over a piece of closed source code is limited. Users should be able to make a connection from an attestation report to, e.g., a Github project. Ideally, an enclave’s identity should map an exact source code version. To achieve this, we will add reproducible builds to EGo so that (advanced) users can compile an app and compare the resulting enclave hash with the one from the attestation report.\n Simplified attestation on machines outside the cloud: Currently, if you would like to run EGo outside of a cloud context, you have to set up some attestation infrastructure. Of course, this is tedious and does not match the simplicity we are going for. That’s why we are thinking of ways to simplify attestation so that EGo can be used on dev machines or on-premises deployments without any further hassle.\n Transparent file encryption: This is a feature that is still in the consideration stage. File encryption in a confidential computing context is trickier to get right than in a conventional context, which is why some SDKs don’t offer it in the first place. Those that do, either have flaws or usage limitations. Currently, EGo has an unencrypted host filesystem and a temporary in-enclave-memory filesystem. Our goal would be to complement this with the ability to mount directories with transparent encryption.\n Curious now? If you want to learn more about EGo you should check out our  GitHub repo or just get started with the following commands:\n  Also, you should check out the  webinar “Build Confidential Go Apps with Ease” held by EGo maintainer Moritz Eckert on June 30.   Click here to register for free.", "posttime": "2021-07-23 06:48:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "构建,built,ego", "title": "我们如何构建 EGo", "title_en": "How we built EGo", "transed": 1, "url": "https://blog.edgeless.systems/how-we-built-ego-c02220360503", "via": "", "real_tags": ["构建", "built", "ego"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069126, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为新西兰人找到安全且顶级的新西兰赌场并不容易。新西兰 CasinoDeps 选择了由 UKGC 和 MGA 保护和许可的最佳赌场网站。 --- 如果您是喜欢没有 Gamstop 赌博计划的在线赌场的英国玩家，请查看 William Terry 选择的 Non Stop 赌场。它们与英国的常规网站一样，评级最高且合法。 --- 寻找接受英国玩家的非 Gamstop 赌场网站？ Bradley Oliva 提供了一份 Gap 赌场列表，这些赌场是没有该计划的 Gamstop 品牌。 --- Peliopas voi auttaa sinua nettikasinot。 Tunne kasinopelisi ennen kuin pelaat。 --- 新的英国赌场正在发布 - 对非英国玩家也是独立的和开放的，查看列表，你可以在这里找到它。 --- 据 PokerPlayerNewspaper 报道，英国赌博委员会的赌场不在 gamstop 上，并且已经发现了缺陷。 --- --- Lyd kaikki parhaat netti kasinot ja niiden kasinobonukset ktevsti yhdelt sivulta！ --- 通过选择信誉良好且安全的澳大利亚在线赌场，玩得开心并轻松获得大奖。 Casinority 是您选择网络上最好的赌场网站的可靠助手。 --- --- 正在寻找值得信赖的在线赌场？查看 CasinoPilot.co.uk 上的最佳网站列表，您可以在这些网站上安全地玩游戏。 --- 从 NewCasinoUK.com 上精选的最新英国赌场网站中选择一家新的在线赌场，并获得独家奖金。 --- --- 日本人向けの( ベストオンラインカジノレビュー)。 --- 我们建议您访问 Casino-online.com 以查找有关美国最佳在线赌场的资源。您将玩 100 次免费旋转的老虎机（无存款奖金）。 --- 加拿大最好的在线赌场。您值得信赖的评论、评级和寻找加拿大最佳在线赌场的来源 --- www.Casimboo.com 是最新的在线赌场，为英国和更多地区增光添彩。玩家可以享受 100 款经过验证的游戏，保证支付。这个很棒的在线赌场受 UKGC 和 MGA 监管，这意味着您将获得公平和安全的游戏体验。 --- Justuk.club 为英国玩家提供安全且经过检查的非赌博娱乐场列表。由杰森法雷尔验证。 --- 你是 PS4 的粉丝吗？访问 PS4 主页以获取最新的 PlayStation 4 文章、新闻、评论等。视频游戏迷应该访问 GamerBolt.com 以获取有关视频游戏场景的最新信息和信息。使用 PS5 Home 准备 PlayStation 5 - PlayStation 5 之家 专业赌徒可以使用此非 GamStop 赌场列表在英国免费玩在线赌场游戏。澳大利亚正在改变他们的赌博规定。在线赌场澳大利亚将更难玩，但澳大利亚人仍然有一些选择。寻找最好的赌场玩？那么 BondiBet 赌场是您的选择。对于所有讲中文的赌徒来说，最好的在线赌场评论网站 CasinoHex-CN 提供了有关在线赌博的详细指南。", "note_en": "It&#39;s not easy to find safe and  top NZ casinos for Kiwis. New Zealand CasinoDeps has picked the best casino sites secured and licensed by the UKGC and MGA. --- If you&#39;re a British player who prefers online casino without Gamstop gambling scheme, check out  Non Stop casinos picked by William Terry. They are top-rated and legal like regular UK sites. --- Looking for non Gamstop casino websites accepting UK players? Bradley Oliva has provided a list of  Gap casinos that are Gamstop-free brands without the scheme. --- Peliopas voi auttaa sinua  nettikasinot. Tunne kasinopelisi ennen kuin pelaat. --- New UK casinos are being released - independent and open for non-UK players as well, check the list,  you can find it here. --- The UK gambling commission have  casinos which is not on gamstop and flaws have been found, PokerPlayerNewspaper reports. --- --- Lyd kaikki parhaat  netti kasinot ja niiden kasinobonukset ktevsti yhdelt sivulta! --- Have fun and get big wins easy by choosing reputable and safe  Australian online casino. Casinority is your reliable assistant in opting only for the best casino sites in the web. --- --- Looking for a trusted place to play casino online? Check a list of the  best sites on CasinoPilot.co.uk where you can play in a safe environment.\n --- Choose a  new online casino from a selection of the latest UK casino sites on NewCasinoUK.com and grab an exclusive bonus. --- --- 日本人向けの( ベストオンラインカジノレビュー)。\n --- Check the best  online casinos and play pokies only at trusted sites. --- We recommend that you visit  casino-online.com to find resources on the best online casinos in USA.  You will play slots with 100 free spins (no deposit bonus). --- Best online casino  in Canada. Your trusted source for reviews, ratings, and finding the best online casinos in Canada --- www.Casimboo.com  is the latest online casino to grace the UK and many more areas. Players can enjoy 100&#39;s of verified games with guaranteed pay-outs. This awesome online casino is regulated by the UKGC and the MGA meaning you&#39;ll get a fair and safe gaming experience. --- Justuk.club  offers a secure and checked list of non gamstop casinos for UK players. Verified by Jason Farrell. --- Are you a  PS4 fan? Visit  PS4 Home for the latest PlayStation 4 articles, news, reviews &amp; more.\n    Video games fans should visit  GamerBolt.com for the latest informative news and information surrounding the video game scene.\n    Prepare for the PlayStation 5 with   PS5 Home - The Home of PlayStation 5        Professional gamblers can use this  non GamStop casinos listing to get free access to playing online casino games in the United Kingdom.    Australia is changing their gambling regulations.  Online casino Australia will be harder to play but there are still some options for Aussies. Looking for the best casino to play at? Then  BondiBet casino is your option to choose.\n For all Chinese-speaking gamblers best online casino review site  CasinoHex-CN offers a detailed guide about online gambling.", "posttime": "2021-07-23 06:48:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,电子游戏,game,赌场", "title": "Vgmaps.com：电子游戏地图集", "title_en": "Vgmaps.com: The Video Game Atlas", "transed": 1, "url": "http://vgmaps.com/", "via": "", "real_tags": ["游戏", "电子游戏", "game", "赌场"]}, {"category": "", "categoryclass": "", "imagename": "905fb94d8ef8a9de67f7e1ca444ef116.jpeg", "infoid": 1069125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着 COVID-19 病例在全国范围内继续攀升——一些州出现垂直上升——公共卫生专家再次强烈呼吁美国人获得现成的高效、安全的 COVID-19 疫苗。尽管疫苗剂量供过于求，但全国只有约 49% 的地区全面接种了疫苗——而且许多州和地区的疫苗接种覆盖率仍然较低。与此同时，超传播的 delta 冠状病毒变种继续在未接种疫苗的社区中肆虐。它现在占全国测序病例的 83%。虽然病例总体上升，但在疫苗接种率低的地方上升最快。例如，路易斯安那州只有大约 36% 的人口接种了疫苗，而且是增长最快的地区之一。每日新增病例数现在可与冬季激增的病例数相媲美。但该国约有五分之一的新病例发生在佛罗里达州。该州的头号热点是杰克逊维尔周边地区，该地区感染率最高。其中包括贝克县，该县只有 20% 的人口接种了疫苗。阿肯色州、密苏里州、内华达州和密西西比州的疫苗接种覆盖率也相对较低。美国疾病控制与预防中心主任罗谢尔·瓦伦斯基周四在白宫新闻发布会上说：“我们正处于这场大流行病的又一个关键时刻，病例再次增加，一些医院已达到其产能。” “我们需要团结起来，作为一个国家，团结一致，用我们现有的工具保护我们自己、我们的孩子、我们的社区、我们的国家和我们的未来的健康。”在新闻发布会上，瓦伦斯基和美国国家过敏和传染病研究所所长安东尼·福奇重申了每个人都应该接种疫苗的所有理由，并试图消除对所谓“突破性”感染的担忧。 “这些疫苗是我们在现代医学中最有效的疫苗之一，”瓦伦斯基说，他提到了美国可用的三种疫苗的高有效率。这两种 mRNA 疫苗（辉瑞/BioNTech 和 Moderna 的疫苗）在临床试验中的有效率都在 90% 以上。强生公司的疫苗效力稍低——在美国为 72%——但仍然相当高。请注意，这些数字非常高，但不是 100%，福奇警告说。 “预计接种后会出现感染，”他说，并补充说，“没有一种疫苗是 100% 有效的。”\n福奇强调，疫苗的主要目标是预防严重疾病和死亡——这三种疫苗都做得很好，即使是针对 delta 变体也是如此。例如，在对接种过辉瑞 / BioNTech 疫苗的人进行的真实世界研究中，完整的两剂疫苗在预防因 delta 变体感染而住院方面的有效率为 96%。同样，阿斯利康疫苗（其设计与强生疫苗非常相似）对 delta 住院治疗的有效率为 92%。此外，初步实验室研究表明，所有三种疫苗都可以促进中和抗体和持久的细胞防御，从而阻止 delta 变体和其他相关变体。目前，97% 的 COVID-19 住院患者未接种疫苗，99.5% 死于 COVID-19 的患者也未接种疫苗。尽管如此，一些接种疫苗的人会在达到完全接种疫苗的状态后被感染——也就是说，在接种第二剂 mRNA 疫苗或接种一剂强生疫苗两周后。通常，这些突破性感染没有症状或症状相对较轻。值得注意的是——正如昨天发表在 Slate 上的一篇文章所做的那样——相对轻微的感染不一定是无害的。他们可能会很不愉快。但是在家里躺几天，感觉浑身发冷，发烧和发冷，这比住院、需要吸氧、或者更糟——进入重症监护室，使用呼吸机，甚至死亡要好得多. “即使我们在接种疫苗后看到感染……对严重疾病的有效性仍然很大，”福奇说，“这又是我们所有人不断说的另一个论点：接种疫苗。”在与记者的反复交流中，福奇还驳斥了对强生疫苗对 delta 变体无效的无端担忧。这种担忧主要是由本周《纽约时报》上的一篇文章引起的，该文章专注于仅关注抗体水平的未发表数据。该研究（尚未经过同行评审）声称，与针对其他病毒版本的中和抗体水平相比，强生疫苗导致针对 delta 变体的中和抗体水平较低。 《纽约时报》宣称，数据表明，接受强生一次性注射的数百万人现在需要加强注射。但专家很快予以回击。他们指出，疫苗不会单独引发抗体——它们还会引发其他关键的细胞免疫防御，以防止感染和疾病。此外，没有明确的中和抗体水平，在这一点上一个人被认为是不受保护的。最后，其他数据表明强生疫苗接种后的免疫反应是稳健和持续的。简而言之，该研究并未着眼于疫苗的功效，而且数据并未表明需要加强免疫。在周四的新闻发布会上，福奇称强生疫苗是“一种非常有效的疫苗”。 “现在没有理由相信服用强生疫苗的人需要任何形式的加强剂量，”他说。 “没有数据表明情况确实如此。”\n《泰晤士报》此后对原报道和标题进行了重大修改，但该报并未注意到任何这些变化。标题不再称疫苗“无效”；相反，标题说它“可能不太有效”。文章的顶部也进行了修改，以指出未发表的数据可能无法反映疫苗功效。为了提高美国的疫苗接种率，福奇和瓦伦斯基周四重申，迄今为止的全部数据表明，手头的疫苗对大流行的冠状病毒，甚至是 delta 变体都是安全且高效的。在安全性方面，疫苗通常会产生轻微、短暂的副作用，例如注射部位周围的疼痛，以及可能一天左右的天气感觉。但严重的副作用极为罕见。尽管一些未接种疫苗的人表示他们担心未确定的长期副作用，但疫苗接种的历史数据表明，如果出现任何副作用，他们往往会在接种疫苗后六周内发生。因此，新的副作用不太可能突然变得明显。尽管突破性病例始终是任何疫苗的关注点，但接种疫苗的人如果想保持谨慎，可以继续遵循一些健康措施，例如戴口罩和避开人群。 Walensky 补充说，在 delta 变种的传播中，对于接种率低且传播率高的地区的人们来说，采取额外的预防措施可能值得考虑。 “如果你没有接种疫苗，请认真对待 delta 变种，”瓦伦斯基恳求道。 “这种病毒没有松懈的动力，它仍在寻找下一个易受感染的人。请考虑接种疫苗并采取预防措施，直到你这样做为止。”对于那些从 COVID-19 中康复的人，Walensky 指出，疾病预防控制中心“强烈建议”他们也接种疫苗。她说：“它为您提供更持久、更强大的保护，其覆盖的广度和深度足以克服目前在该国流行的变种。”对于那些仍然犹豫是否接种疫苗的人，瓦伦斯基敦促他们仔细检查他们犹豫背后的原因。 “如果你对疫苗仍有疑问，我们欢迎他们，”她说。 “我对您的要求是：提出您的问题。与您的医疗保健提供者交谈。与您的药剂师交谈。与已接种疫苗的朋友和邻居交谈并回答您的问题，以便您在做出这个关键决定时感到舒适和知情.”这一点与最近在阿拉巴马州一篇令人心碎的文章中发表的另一篇文章有​​关，其中一位在伯明翰医院工作的医生描述了她在病床上照顾未接种疫苗的 COVID-19 患者的情况。这篇文章之所以感动有几个原因，包括对错误信息如何困扰这种大流行的令人心碎的描述。文章援引一位医生的话说：\n当我接诊一名未接种疫苗的新 COVID 患者时，我尽量不带偏见，但我真的只是开始问他们，“你为什么还没有接种疫苗？”我只会直截了当地问它，以尽可能不带评判的方式。他们中的大多数人都非常诚实，他们会给我答案。 “我和这个人谈过，我在 Facebook 上看到了这件事，我收到了这封电子邮件，我在新闻上看到了这个，”你知道，这些都是我没有接种疫苗的原因。我经常问他们的一个问题是，您是否与您的初级保健医生预约并征求他们对您是否应该接种疫苗的意见？到目前为止，没有人对这个问题的回答是肯定的。美国医学协会最近的一项民意调查发现，超过 96% 的执业医生已全面接种 COVID-19 疫苗。在剩下的人中，45% 的人表示他们计划接种疫苗。", "note_en": "As COVID-19 cases continue to climb across the country—with some states seeing vertical rises—public health experts are once again emphatically imploring Americans to get the highly effective, safe COVID-19 vaccines that are readily available.\n Despite an oversupply of vaccine doses, only about 49 percent of the country is fully vaccinated overall—and many states and areas have lower vaccination coverage still. Meanwhile, the hypertransmissible delta coronavirus variant continues to blaze through unvaccinated communities. It now accounts for 83 percent of sequenced cases nationwide.\n While cases are rising overall, they&#39;re rising fastest in places with low vaccination rates. Louisiana, for instance, only has about 36 percent of its population fully vaccinated, and it is seeing one of the steepest rises. Daily new case counts now rival those seen in the winter surge. But about one in every five new cases in the country is in Florida. The state&#39;s top hot spot is the area around Jacksonville, which has the highest rates of infection in the state. That are includes Baker county, which has only 20 percent of its population vaccinated. Arkansas, Missouri, Nevada, and Mississippi are also seeing sharp rises—all with relatively low vaccination coverage.\n &#34;We are yet at another pivotal moment in this pandemic, with cases rising again and some hospitals reaching their capacity,&#34; Rochelle Walensky, director of the Centers for Disease Control and Prevention, said in a White House press briefing Thursday. &#34;We need to come together as one nation, unified in our resolve to protect the health of ourselves, our children, our community, our country, and our future, with the tools we have available.&#34;\n  In the press briefing, Walensky and Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, reiterated all the reasons that everyone should get vaccinated and also tried to tamp down concern over so-called &#34;breakthrough&#34; infections.\n &#34;These vaccines are some of the most effective that we have in modern medicine,&#34; Walensky said, referencing the high efficacy rates of the three vaccines available in the US. The two mRNA vaccines (Pfizer/BioNTech and Moderna&#39;s vaccines) had efficacy rates above 90 percent in clinical trials. The Johnson &amp; Johnson vaccine efficacy was a bit lower—72 percent in the US—but is still quite high.\n Note, those numbers are very high, but not 100 percent, Fauci cautioned. &#34;Infections after vaccination are expected,&#34; he said, adding, &#34;no vaccine is 100 percent effective.&#34;\n The primary goal of vaccines is to protect against severe disease and death—which all three vaccines do very well, even against the delta variant, Fauci emphasized. In a real-world study of people who had been vaccinated with the Pfizer/BioNTech vaccine, for instance, the full two doses were  96 percent effective at preventing hospitalization from infections with the delta variant. Similarly, the AstraZeneca vaccine—which is very similar in design to the Johnson &amp; Johnson vaccine—was 92 percent effective against hospitalization from delta. In addition,  preliminary laboratory studies have shown that all three vaccines can prompt neutralizing antibodies and durable cellular defenses that can thwart the delta variant and other concerning variants. Currently, 97 percent of people hospitalized with COVID-19 are unvaccinated, as are 99.5 percent of those dying of COVID-19.\n    Still, some vaccinated people will get infected after reaching a fully vaccinated state—that is, two weeks after getting either the second dose of an mRNA vaccine or the one dose of the Johnson &amp; Johnson vaccine. Typically, these breakthrough infections have no symptoms or have relatively mild symptoms. It&#39;s worth noting—as  a piece published in Slate did yesterday—that relatively mild infections aren&#39;t necessarily harmless; they can be quite unpleasant. But being laid out at home for a few days, feeling crummy with a fever and chills, is significantly better than a stay in the hospital, needing oxygen, or worse—landing in the intensive care unit, being on a ventilator, or even dying.\n &#34;Even though we are seeing infections after vaccination... the effectiveness against severe disease is still substantial,&#34; Fauci said, &#34;which is yet again another argument which all of us say continually: Get vaccinated.&#34;\n  In a back-and-forth with reporters, Fauci also shot down unwarranted concern that the Johnson &amp; Johnson vaccine was not effective against the delta variant. The concern was largely driven by an article this week in The New York Times that focused on unpublished data looking only at antibody levels. The study (which has not been peer-reviewed) claimed that the Johnson &amp; Johnson vaccine prompted lower levels of neutralizing antibodies against the delta variant, compared with neutralizing antibodies levels against other versions of the virus. The New York Times declared that the data suggests that the millions of people who received the one-and-done Johnson &amp; Johnson shot now need a booster shot.\n But experts were quick to push back. They noted that vaccines don&#39;t prompt antibodies alone—they also elicit other critical cellular immune defenses to protect from infection and disease. Moreover, there is no clear level of neutralizing antibody at which point a person is deemed unprotected. Lastly,  other data has suggested that immune responses after the Johnson &amp; Johnson vaccine are robust and sustained. In short, the study wasn&#39;t looking at vaccine efficacy, and the data does not suggest the need for boosters.\n In the press briefing Thursday, Fauci called the Johnson &amp; Johnson vaccine &#34;a very effective vaccine.&#34;\n &#34;There is no reason to believe right now that people who have taken the J&amp;J vaccine are in need of a booster dose of any sort,&#34; he said. &#34;There are no data to indicate that that is the case.&#34;\n The Times has since significantly altered  the original story and its headline, though the paper did not note any of those changes. The headline no longer calls the vaccine &#34;ineffective;&#34; instead, the headline says it &#34; may be less effective.&#34; The top of the story has also been amended to note that the unpublished data may not reflect vaccine efficacy.\n  In an effort to boost vaccination in the US, Fauci and Walensky reiterated Thursday that the totality of data so far suggests that the vaccines at hand are safe and highly effective against the pandemic coronavirus, even the delta variant. In terms of safety, the vaccines do often produce mild, short-lived side effects, such as pain around the injection site and possibly a day or so of feeling under the weather. But serious side effects are exceedingly rare. Though some unvaccinated people have said they are concerned about unidentified  long-term side effects, historical data on vaccination indicates that, if any side effects are going to arise, they tend to do so within six weeks of vaccination. Thus it&#39;s unlikely that new side effects are suddenly going to become apparent.\n    Though breakthrough cases are always a concern with any vaccine, vaccinated people can continue to follow some health measures such as mask-wearing and avoiding crowds if they want to be cautious. Taking extra precautions may be worth considering for people in areas with low vaccination rates and high transmission amid the spread of the delta variant, Walensky added.\n &#34;If you are not vaccinated, please take the delta variant seriously,&#34; Walensky pleaded. &#34;This virus has no incentive to let up, and it remains in search of the next vulnerable person to infect. Please consider getting vaccinated and take precautions until you do.&#34;\n For those who have recovered from COVID-19, Walensky noted that the CDC &#34;strongly recommends&#34; that they too get vaccinated. &#34;It gives you longer-lasting and more robust protection with the breadth and depth of coverage needed to conquer the variants currently circulating in this country,&#34; she said.\n And for those still hesitant to get vaccinated, Walensky urged them to closely examine what was behind their hesitation. &#34;If you still have questions about the vaccines, we welcome them,&#34; she said. &#34;My request to you is this: Ask your questions. Talk to your healthcare provider. Talk to your pharmacist. Talk to your friends and neighbors who have gotten vaccinated and get your questions answered so that you feel comfortable and informed in making this critical decision.&#34;\n The point connects with another made recently in  a heartbreaking article out of Alabama, in which a doctor working in a Birmingham hospital described caring for her unvaccinated COVID-19 patients on their death beds. The piece was moving for several reasons, including a heartbreaking description of how misinformation has plagued this pandemic. The article quoted a doctor as saying:\n I try to be very non-judgmental when I&#39;m getting a new COVID patient that&#39;s unvaccinated, but I really just started asking them, &#34;Why haven&#39;t you gotten the vaccine?&#34; And I&#39;ll just ask it point-blank, in the least judgmental way possible. And most of them, they&#39;re very honest, they give me answers. &#34;I talked to this person, I saw this thing on Facebook, I got this email, I saw this on the news,&#34; you know, these are all the reasons that I didn’t get vaccinated.\n And the one question that I always ask them is, did you make an appointment with your primary care doctor and ask them for their opinion on whether or not you should receive the vaccine? And so far, nobody has answered yes to that question.\n A recent poll by the American Medical Association found that  more than 96 percent of practicing doctors have been fully vaccinated against COVID-19. And of those remaining, 45 percent said they planned to get vaccinated.", "posttime": "2021-07-23 06:15:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,专家,plead,疫苗", "title": "“接种疫苗！认真对待德尔塔！”美国专家恳求案件激增", "title_en": "“Get vaccinated! Take delta seriously!” US experts plead as cases skyrocket", "transed": 1, "url": "https://arstechnica.com/science/2021/07/get-vaccinated-take-delta-seriously-us-experts-plead-as-cases-skyrocket/", "via": "", "real_tags": ["美国", "专家", "plead", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "fa9987756a47ccf800fbc641f055eb21.jpeg", "infoid": 1069124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "单击“注册”，即表示您同意接收来自 Insider 的营销电子邮件以及其他合作伙伴的优惠，并接受我们的服务条款和隐私政策。加利福尼亚州公平就业机构周二对游戏巨头动视暴雪提起诉讼，指控这家《使命召唤》发行商存在“无处不在的兄弟会男孩”，女性员工经常受到骚扰。该文件称，在一次所谓的事件中，“一名新晋升的男性主管将他的职责委托给了他现在的女性下属，以支持玩使命召唤”。据彭博社报道，加州公平就业和住房部 (DFEH) 在对女性员工的工作条件进行了两年的调查后，起诉了动视暴雪及其两家子公司——动视出版和魔兽世界的创造者暴雪娱乐。 DFEH 在周二向洛杉矶最高法院提交的文件中表示，该公司的女性受到歧视，受到“不断的性骚扰”，摸索，为“基本相似的工作”支付较少的报酬，并在她们投诉时遭到公司 HR 的报复。 “不出所料，被告的‘兄弟会男孩’文化是骚扰和歧视女性的温床，”诉讼称。动视暴雪的一位发言人在一份声明中表示，“DFEH 描绘的画面不是今天的暴雪工作场所。”\n“DFEH 包括对暴雪过去的歪曲，在许多情况下是虚假的描述。我们在整个调查过程中与 DFEH 非常合作，包括向他们提供大量数据和充足的文件，但他们拒绝告诉我们他们认为什么问题， “声明说。 “我们重视多样性，并努力营造一个为每个人提供包容性的工作场所。我们公司或行业或任何行业都不允许任何形式的性行为不端或骚扰，”发言人说。 “我们认真对待每一项指控并调查所有索赔。在与不当行为有关的案件中，我们已采取行动解决问题。”该诉讼详细声称，一些男性员工参与了“立方体爬行”，他们会“喝大量的酒精”并在办公室的隔间之间移动，经常对女性同事表现出不恰当的行为。诉讼称，一些男性员工对魔兽世界团队的女性员工进行了性挑逗，还对强奸发表了贬损言论。该机构在文件中称，动视暴雪的一名女员工在出差期间自杀身亡。诉讼称，她之前曾与之发生性关系的一名男性同事也在这次旅行中。 DFEH 说，警方发现男主管在旅途中带来了塞子和润滑剂。 DFEH 说，另一名员工表示，这名女性在去世前曾在工作中遭受性骚扰。\n目前尚不清楚这次旅行是何时发生的。动视暴雪发言人在给 Insider 的一份声明中表示，该员工的自杀“与本案无关”。该诉讼称，动视暴雪的女性员工（据称占其员工总数的 20% 左右）的晋升速度也较慢，而担任高管职位的女性“薪水、激励薪酬和总薪酬低于男性同龄人”，援引动视暴雪自己在证券交易委员会的记录。 DFEH 表示，它以薪酬不平等、性别歧视、非法性骚扰、报复以及未能防止歧视、骚扰和报复为由提起诉讼。该机构表示，它是为了公共利益和动视暴雪的女性员工提起诉讼。该机构正在寻求赔偿和惩罚性赔偿，以及女性工人的未付工资和损失工资等要求，但没有具体说明具体数额。注册来自 Insider 的通知！及时了解您想知道的内容。形成“X”的两条​​交叉线。它指示一种关闭交互或关闭通知的方式。", "note_en": "By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n    California&#39;s fair employment agency  filed a lawsuit against gaming giant  Activision Blizzard on Tuesday, accusing the Call of Duty publisher of a &#34;pervasive frat boy&#34; in which female employees were routinely harassed.\n In one alleged incident, a &#34;newly promoted male supervisor delegated his responsibilities to his now female subordinates in favor of playing Call of Duty,&#34; the filing said.\n The California Department of Fair Employment and Housing (DFEH) sued  Activision Blizzard and two subsidiaries — Activision Publishing and World of Warcraft creator  Blizzard Entertainment — after a two-year investigation into working conditions for female staff,  Bloomberg Law first reported.\n DFEH said in Tuesday&#39;s filing to the Los Angeles Supreme Court that women at the company were discriminated against, subjected to &#34;constant sexual harassment,&#34; groped, paid less for &#34;substantially similar work,&#34; and retaliated against by company HR when they complained.\n     &#34;Unsurprisingly, [the] Defendants&#39; &#39;frat boy&#39; culture is a breeding ground for harassment and discrimination against women,&#34; the lawsuit said.\n A spokesperson for Activision Blizzard said in a statement that &#34;the picture the DFEH paints is not the Blizzard workplace of today.&#34;\n &#34;The DFEH includes distorted, and in many cases false, descriptions of Blizzard&#39;s past. We have been extremely cooperative with the DFEH throughout their investigation, including providing them with extensive data and ample documentation, but they refused to inform us what issues they perceived,&#34; the statement said.\n &#34;We value diversity and strive to foster a workplace that offers inclusivity for everyone. There is no place in our company or industry, or any industry, for sexual misconduct or harassment of any kind,&#34; the spokesperson said.\n     &#34;We take every allegation seriously and investigate all claims. In cases related to misconduct, action was taken to address the issue.&#34;\n  The lawsuit detailed claims that some male workers engaged in &#34;cube crawls&#34; where they would &#34;drink copious amounts of alcohol&#34; and move between cubicles in the office, often behaving inappropriately towards their female coworkers.\n Some male workers made sexual advances to female employees on the World of Warcraft team, and also made derogatory comments about rape, the lawsuit claimed.\n     The agency said in the filing that one female Activision Blizzard worker died by suicide during a business trip. A male coworker she had previously had a sexual relationship with was also on the trip, the suit said. Police found that the male supervisor had brought a butt plug and lubricant on the trip, DFEH said.\n Another employee said the woman had suffered sexual harassment at work before her death, DFEH said.\n It is not clear when the trip happened. An Activision Blizzard spokesperson said in a statement to Insider that the employee&#39;s suicide had &#34;no bearing whatsoever on this case.&#34;\n The lawsuit alleged that Activision Blizzard&#39;s female workers — which it said makes up around 20% of its workforce — were also promoted more slowly, while  women in executive roles earned &#34;less salary, incentive pay, and total compensation than their male peers,&#34; citing Activision Blizzard&#39;s own records with the Securities and Exchange Commission.\n     DFEH said that it filed the suit on grounds of unequal pay,  sex discrimination, unlawful sexual harassment, retaliation, and for failure to prevent discrimination, harassment, and retaliation. The agency said it was suing in the public interest and for Activision Blizzard&#39;s female employees.\n The agency is seeking compensation and punitive damages, and unpaid and lost wages for female workers, among other demands, although did not specify how much.\n  Sign up for notifications from Insider! Stay up to date with what you want to know.\n            Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-07-23 06:15:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,主管,female,女性", "title": "加利福尼亚州起诉游戏巨头动视暴雪，指控对女性员工的普遍骚扰。诉讼称，一名男性主管将他的工作委托给一名女性员工，以便他可以玩《使命召唤》。", "title_en": "California sued gaming giant Activision Blizzard, alleging widespread harassment of female staff. A male supervisor delegated his work to a female employee so he could play Call of Duty, the suit said.", "transed": 1, "url": "https://www.businessinsider.com/activision-blizzard-delegated-work-to-play-call-of-duty-lawsuit-2021-7", "via": "", "real_tags": ["游戏", "主管", "female", "女性"]}, {"category": "", "categoryclass": "", "imagename": "9c8ee3b2243ead55cea048ca61d92ee9.jpg", "infoid": 1069123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于班加罗尔的公司在由 Khosla Ventures 领投的一轮种子资金中获得了 500 万美元的新现金注入，Founders Fund、Lachy Groom 和包括 Palo Alto Networks 首席执行官 Nikesh Arora、CRED 首席执行官 Kunal Shah、 Zerodha 创始人 Nithin Kamath 和 DST Global 合伙人 Tom Stafford。甚至，一家医疗保健会员公司的目标是覆盖该国大多数保险公司没有的东西，包括让初级保健医生像在其他国家一样容易和容易获得。班纳吉在印度长大，他说这个国家与美国相似，都有政府和私立医院。他告诉 TechCrunch，两者的不同之处在于，私人医疗保险对印度来说是一个相对较新的概念。他估计只有不到 5% 的人拥有它，即使人们为保险付费，它也主要涵盖事故和紧急情况。这意味着常规初级保健咨询、测试和扫描不在承保范围内。而且，这些政策是如此令人困惑，以至于许多人直到为时已晚才意识到它们没有得到保障。 Ialongo 补充说，这导致人们要求医生让他们住院，以便支付账单。当 Banerjee 和 Giglio 开始看到健康保险政策有多么复杂时，他们正在共同经营另一家初创公司。班纳吉说，每年约有 5000 万印度人生活在贫困线以下，许多人无法支付医疗费用。他们开始研究保险业，并与医院高管讨论索赔问题。他们发现最大的问题之一是激励失调——医院向患者收费过高和治疗过度。相反，Even 正在采取与 Kaiser Permanente 类似的方法，因为该公司将充当服务提供商，因此可以降低护理成本。甚至于 2 月投入运营，并于 6 月推出。它正准备在今年第四季度推出，到目前为止，等候名单上的人数已超过 5,000 人。对于 18 至 35 岁的人，其健康会员产品每年的费用约为 200 美元，涵盖一切：与初级保健医生的无限制咨询、诊断和扫描。 Ialongo 说，随着年龄的增长，成员资格也会随之而来。\n创始人打算使用新资金来建立他们的运营团队、产品和与医院的整合。他们已经与 100 家医院合作，并与 Narayana Hospital 建立了合作伙伴关系，迄今为止已提供 2,000 多次 COVID 疫苗接种，并在第二轮中提供更多疫苗。 “扩大规模需要一段时间，”班纳吉说。 “对我们来说，理论上，随着我们获得更好的定价，我们最终会比其他人更便宜。我们的目标是覆盖政府无法覆盖的人群，并找到减少统计数据的方法。”", "note_en": "The Bangalore-based company received a fresh cash infusion of $5 million in seed funding in a round led by Khosla Ventures, with participation from Founders Fund, Lachy Groom and a group of individuals including Palo Alto Networks CEO Nikesh Arora, CRED CEO Kunal Shah, Zerodha founder Nithin Kamath and DST Global partner Tom Stafford.\n Even, a healthcare membership company, aims to cover what most insurance companies in the country don’t, including making going to a primary care doctor as easy and accessible as it is in other countries.\n  Banerjee grew up in India and said the country is similar to the United States in that it has government-run and private hospitals. Where the two differ is that private health insurance is a relatively new concept for India, he told TechCrunch. He estimates that less than 5% of people have it, and even though people are paying for the insurance, it mainly covers accidents and emergencies.\n This means that routine primary care consultations, testings and scans outside of that are not covered. And, the policies are so confusing that many people don’t realize they are not covered until it is too late. That has led to people asking doctors to admit them into the hospital so their bills will be covered, Ialongo added.\n Banerjee and Giglio were running another startup together when they began to see how complicated health insurance policies were. About 50 million Indians fall below the poverty line each year, and many become unable to pay their healthcare bills, Banerjee said.\n They began researching the insurance industry and talking with hospital executives about claims. They found that one of the biggest issues was incentive misalignment — hospitals overcharged and overtreated patients. Instead, Even is taking a similar approach to Kaiser Permanente in that the company will act as a service provider, and therefore, can drive down the cost of care.\n Even became operational in February and launched in June. It is gearing up to launch in the fourth quarter of this year with more than 5,000 people on the waitlist so far. Its health membership product will cost around $200 per year for a person aged 18 to 35 and covers everything: unlimited consultations with primary care doctors, diagnostics and scans. The membership will also follow as the person ages, Ialongo said.\n The founders intend to use the new funding to build out their operational team, product and integration with hospitals. They are already working with 100 hospitals and secured a partnership with Narayana Hospital to deliver more than 2,000 COVID vaccinations so far, and more in a second round.\n “It is going to take a while to scale,” Banerjee said. “For us, in theory, as we get better pricing, we will end up being cheaper than others. We have goals to cover the people the government cannot and find ways to reduce the statistics.”", "posttime": "2021-07-23 06:14:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ventures,医院", "title": "Khosla Ventures 领投 Even 的 500 万美元种子资金，为印度提供他们的保险没有的医疗保健", "title_en": "\n\t\t\t\tKhosla Ventures leads Even’s $5M seed to give India the kind of healthcare their insurance doesn’t\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/khosla-ventures-leads-evens-5m-seed-to-give-india-the-kind-of-healthcare-their-insurance-doesnt/", "via": "", "real_tags": ["ventures", "医院"]}, {"category": "", "categoryclass": "", "imagename": "79ad17ad62ba5ce8c82d08ac5d9b81e4.jpg", "infoid": 1069122, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎收看 2021 年 7 月 22 日的 Daily Crunch。今天我们为您带来了很多新闻，但有一个显着的转折。通常我们有很多创业新闻和一些来自大型科​​技公司的笔记。今天我们有很多来自两者的东西，所以请系好安全带。此外，美国交通部长皮特·布蒂吉格（Pete Buttigieg）也来了。因为 TechCrunch 涵盖了微型交通、适当的移动性和交通的未来世界，所以我们有几个问题要问这个人。 — Alex Gopuff 再次筹集资金：TechCrunch 今天爆料称，软银支持的快递公司 Gopuff 正在筹集更多资金。我们的消息来源说 10 亿美元，估值约为 150 亿美元。 Axios 证实了这一消息。在为全球即时交付杂货筹集了大量资金之后，潜在的资金将随之而来。加拿大的风险投资市场比太阳还热：TechCrunch 对全球、美国、印度、欧洲和拉丁美洲创业市场的探索今天继续进行，并着眼于北美。事实证明，加拿大的初创公司在进行大型风险投资时正享受着一年的地狱般的时光。互联网瘫痪了。原因如下：Akamai 的 DNS 系统今天遇到了一个坑洞，占用了相当大的互联网。很多东西都坏了，包括 Couchbase 网站，就在你卑微的仆人正准备与其 CEO 谈论其最近的 IPO 时（更多在这里）。现在一切恢复正常，但不要忘记互联网不是一系列管子。它是一系列用胶带粘在一起的漏水管。让我们谈谈初创公司。今天，我们拥有从无密码技术到新风险基金和机器人综述的所有内容。但如果您需要更多，这里是 Greylock 的 Mike Duboe 解释如何定义增长和建立您的团队。 Mindtech 为合成人类观察筹集了 325 万美元：不，这就是它所做的。这家总部位于英国的公司的服务希望在数字人类上训练闭​​路电视摄像机，使客户免于棘手的隐私问题。这是风险投资资金似乎流向一个实际上有点疯狂的想法的时代之一？\nSendlane 希望您花更多钱：Sendlane 现在拥有 2000 万美元的新资本，希望帮助其客户使用客户数据来帮助保持购物者的忠诚度并增加支出。我会称这有点令人毛骨悚然，但随后我会听起来像我这个 luddite。 All Raise 为女性和非二元创始人推出虚拟训练营：随着风险投资竞争到新的高度，它并没有在所有地方平等落地。事实上，一些数据来源表明，今年 VC 实际上变得越来越不多样化。 All Raise 希望通过帮助更多的创始人而不是像我这样的人筹集资金来反击这一点。好的。 Magic 筹集了 2700 万美元以摆脱密码：Magic 是一家将终其一生努力实现其名声的初创公司，刚刚筹集了大量资金以实现其对密码更少关注的未来愿景。 TechCrunch 报告说，它的技术允许开发人员“用几行代码实现各种无密码身份验证方法”。什么有五个字母的名字和 30 亿美元？可悲的是，这不是你或我。是指数！这家风险投资公司筹集了价值不到 30 亿美元的新基金，比一年前筹集的资金多出一大笔钱。热的零利率政策十年使热启动夏季成为可能，这反过来又助长了热无聊的现金季节，导致每个风险投资公司筹集到足够的资金来让他们的全科医生失眠。乐趣！对于您的机器人爱好者，TechCrunch 提供了来自该行业的新摘要。享受！由于庞大的履行中心、无缝的物流网络和无处不在的互联网接入，许多地区的消费者现在可以在早餐时订购杂货和一套新的炊具，并且可以合理地期望所有东西都能按时到达晚餐。在拉丁美洲，缺乏技术基础设施使得交付操作不那么复杂——产品从零售商的装货码头交付到客户的前门——但这些供应链通常使用电子表格、纸和笔进行管理。\nWIND Ventures 的投资者 Bob Ma 表示，管理送货路线或自动派遣司机的算法“在拉丁美洲零售物流领域几乎闻所未闻”。但由于消费者需求不断增长，以及对最后一英里交付初创公司的投资不断扩大，马云表示，该地区正处于一个转折点。由于拉丁美洲的中产阶级在过去十年中增长了 50%，电子商务仅占所有零售的 6%，因此近年来出现了几家独角兽，还有更多的人在等待。 （Extra Crunch 是我们的会员计划，可帮助创始人和初创团队取得成功。您可以在此处注册。）让我们先从交通新闻开始，然后再谈谈其他的 Big Tech。 Daily Crunch 询问了 TechCrunch 交通专家和一般英镑的人 Kirsten Korosec 为什么今天有这么多关于她的节拍的消息。 “我不知道为什么，让它停下来，”她开玩笑说，然后补充说，“可以说，有这么多汽车制造商承诺转向所有电线，我们可以期待更多关于他们计划如何确保他们有的公告电池容量和其他原材料。” Rivian 将目光投向了第二家工厂：刚结束生产延迟的电动汽车公司 Rivian 正以另一家工厂的形式为未来做规划。该公司承认正在寻找第二家工厂。我们的阅读？这个电动车的事情并没有放慢速度。\n说到这里，特斯拉将直接从商品生产巨头必和必拓那里采购镍。如果市场像预期的那样发展，这将是电动汽车所需原材料的饥饿游戏。特斯拉希望确保它不会缺货。我们在谈论多少需求？好吧，梅赛德斯将建造八 - 八！ — 电池厂。现在我们已经阅读了新闻，这个想法是有道理的，但它仍然让我们坐下来考虑它的含义。内燃机时代即将结束。优步以 2.25 美元的价格收购 Transplace：为了解决我们的移动出行问题，优步正在通过其支票簿采取行动，这次以数十亿美元的价格收购了一家数字物流公司 Transplace。这项努力将符合优步更大的货运愿望。该公司曾表示打算在今年实现调整后的盈利能力。与此同时，Waymo 宣布将在匹兹堡开设办事处，这肯定会给已经竞争激烈的人才招聘流程带来更大压力。 Spotify 和 Giphy 联手：呃，你想在你的音乐播放器里放 GIF 吗？好吧，如果是这样，那么好消息是：Spotify“与在线 GIF 数据库 GIPHY 建立了新的合作伙伴关系，以通过 GIF 发现新音乐。”凉爽的？微软收购 CloudKnox：微软今天继续推动向每个专注于网络安全的风险投资家提供现金回报，总部位于雷德蒙德的软件巨头收购了 CloudKnox。这是今年微软一家专注于网络安全的小型初创公司的第四笔交易。 Visa 收购 Currencycloud：Visa 可能仍因无法收购金融科技 API 提供商 Plaid 而受到轻微打击，目前正忙于收购其他公司。这次是 Currencycloud，它构建了其他金融科技 API。撇开玩笑不谈，这笔交易将以不到 10 亿美元的价格将这家规模较小的公司的汇款和货币转账技术带入 Visa。\n我们正在与初创公司创始人联系，告诉我们他们在需要最新的增长营销实践时会向谁求助。在此处填写调查。感言：“除了写一本关于开发者营销的书外，Adam 还从作为开发者和开发者倡导者的丰富经验中汲取经验，以确保他的客户制定成功的战略。”", "note_en": "Hello and welcome to Daily Crunch for July 22, 2021. Today we have a lot of news for you, but with a notable twist. Normally we have lots of startup news and a few notes from Big Tech companies. Today we have a lot from both, so strap in.\n Also,  U.S. Secretary of Transportation Pete Buttigieg is coming to Disrupt. Because TechCrunch covers the worlds of micromobility, mobility proper and the future of transit, we have a few questions for the man. —  Alex\n   Gopuff is raising again: TechCrunch broke the news today that Gopuff, the SoftBank-backed delivery company, is raising more capital. Our sources say $1 billion at around a $15 billion valuation. Axios confirmed the news. The potential funding will follow in the wake of lots of capital raised for instant-delivery grocery around the world.\n Canada’s venture capital market is hotter than the sun: TechCrunch’s exploration of the global, U.S, Indian, European and Latin American startup markets continued today with a look at North North America. It turns out that Canadian startups are enjoying one hell of a year when it comes to landing big venture rounds.\n The internet went down. Here’s why: Akamai’s DNS system hit a pothole today, taking down a pretty big chunk of the internet. Lots of stuff broke, including the Couchbase website right as your humble servant was prepping to chat with its CEO about its recent IPO (more  here). Things are back to normal now, but don’t forget that the internet is not a series of tubes. It’s a series of leaky tubes held together with duct tape.\n  Let’s talk about startups. Today we have everything from passwordless tech to new venture funds and a robotics roundup. But if you need even more, here’s  Greylock’s Mike Duboe explaining how to define growth and build your team.\n Mindtech raises $3.25M for synthetic human watching: No really, that’s what it does. The U.K.-based company’s service wants to train CCTV cameras on digital humans, saving customers from knotty privacy issues. This is one of those times when venture capital dollars appear to be flowing to an actually kinda wild idea?\n Sendlane wants you to spend more: Sendlane, now flush with $20 million in new capital, wants to help its customers use data on  their customers to help keep shoppers loyal and spend more. I would call this slightly creepy but then I would sound like the luddite that I am.\n All Raise launches virtual bootcamp for women and nonbinary founders: As venture funding races to new heights, it’s not landing everywhere equally. In fact, some data sources indicate that VC is actually getting less diverse this year. All Raise wants to push back on that by helping more founders other than folks who  look like me raise capital. Good.\n Magic raises $27M to get rid of passwords: Magic, a startup that will spend its life trying to live up to its name, just raised a huge amount of money to pursue its vision of a less password-focused future. Its tech allows developers to “implement a variety of passwordless authentication methods with just a few lines of code,” TechCrunch reports.\n What has a five-letter name and 3 billion more dollars? Sadly, it’s not you or me. It’s Index! The venture capital firm has put together new funds worth just under $3 billion, a big chunk more money than it raised, er,  a year ago. Hot Startup Summer is being made possible by Hot Zero Interest Rate Policy Decade, which in turn is helping fuel Hot Bored Cash Season, leading to every venture capital firm raising enough money to cause their GPs to lose sleep. Fun!\n And for your robotics fans out there, TechCrunch has  a new digest from the industry here. Enjoy!\n  Thanks to sprawling fulfillment centers, seamless logistics networks and ubiquitous internet access, consumers in many regions now order groceries and a new set of cookware during breakfast and can reasonably expect everything to arrive in time for dinner.\n In Latin America, a lack of technology infrastructure makes delivery operations less complex — products are delivered from a retailer’s loading dock to a customer’s front door — but these supply chains are often managed with spreadsheets, paper and pen.\n Algorithms that manage delivery routes or automatically dispatch drivers “are almost unheard of in the Latin America retail logistics sector,” says Bob Ma, an investor at WIND Ventures.\n But thanks to growing consumer demand and expanding investment in last-mile delivery startups, Ma says the region is at a turning point.\n Since Latin America’s middle class has grown 50% in the last decade and e-commerce constitutes just 6% of all retail, several unicorns have emerged in recent years, with more waiting in the wings.\n  (Extra Crunch is our membership program, which helps founders and startup teams get ahead.  You can sign up here .)\n  Let’s start with transportation news and then talk about the rest of Big Tech.\n Daily Crunch asked TechCrunch transportation guru and generally sterling person Kirsten Korosec just why there was so much news today from her beat. “I have no idea why, just make it stop,” she joked, before adding that she “can say that with so many automakers making commitments to move to all electric lines, we can expect more announcements about how they plan to ensure they have battery capacity and other raw materials.”\n  Rivian sets sights on second factory: Fresh off production delays, EV company Rivian is planning for the future in the form of another factory. The company admitted to being in the process of looking for a second plant. Our read? This electric car thing is not slowing down.\n Speaking of which,   Tesla will source nickel directly from commodity production giant BHP. It’s going to be the Hunger Games out there for the raw materials needed for electric cars if the market evolves as it is expected to. Tesla wants to make sure it doesn’t lack supplies.\n How much demand are we talking about? Well,   Mercedes is going to build eight —  eight! — battery plants. Now that we’ve read the news, the idea makes sense, but it still made us sit up and consider its implications. The days of the internal combustion engine are coming to an end.\n Uber buys Transplace for $2.25B:  Rounding out our mobility rundown, Uber is making moves with its checkbook, this time buying Transplace, a digital logistics company, for a few billion. The effort will fit into Uber’s larger freight aspirations. The company has said that it intends to reach adjusted profitability this year.\n Meanwhile,   Waymo announced it is opening an office in Pittsburgh, where it will certainly put even more pressure on an already competitive talent recruiting process.\n  Spotify and Giphy team up:  Er, have you wanted GIFs in your music player? Well, good news if so: Spotify has “a new partnership with online GIF database GIPHY to enable discovery of new music through GIFs.” Cool?\n Microsoft buys CloudKnox:  Microsoft’s push to provide cash returns to every cybersecurity-focused venture capitalist continued today, with the Redmond-based software giant buying CloudKnox. It’s the fourth deal  this year for a smaller cybersecurity-focused startup from Microsoft.\n Visa buys Currencycloud:  Visa, likely still stinging slightly from its inability to buy fintech API provider Plaid, is busy buying other companies. This time it’s Currencycloud, which builds  other fintech APIs. Jokes aside, the deal will bring the smaller company’s remittance and currency-transfer tech into Visa for just under $1 billion.\n   We’re reaching out to startup founders to tell us who they turn to when they want the most up-to-date growth marketing practices.  Fill out the survey here.\n    Testimonial: “In addition to writing a book on developer marketing, Adam draws from deep experience as a developer and developer advocate to make sure his clients set a winning strategy in motion.”", "posttime": "2021-07-23 06:14:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "akamai,crunch", "title": "每日紧缩：Akamai 表示，当今普遍的互联网中断“不是网络攻击的结果”", "title_en": "\n\t\t\t\tDaily Crunch: Today’s widespread internet outage ‘not a result of a cyberattack,’ says Akamai\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/daily-crunch-todays-widespread-internet-outage-not-a-result-of-a-cyberattack-says-akamai/", "via": "", "real_tags": ["akamai", "crunch"]}, {"category": "", "categoryclass": "", "imagename": "7743f9ca130288e85de0622806b61dac.jpg", "infoid": 1069121, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "热门游戏《使命召唤》、《魔兽世界》和《糖果粉碎传奇》背后的视频游戏工作室正面临加利福尼亚州的一项民事诉讼，指控其涉及性别歧视、性骚扰和可能违反该州同工同酬法的指控。美国州公平就业和住房部周三提交的一份投诉称，动视暴雪公司“培育了一种性别歧视文化”，女性的薪酬低于男性，并受到持续的性骚扰，包括摸索。 （动视和暴雪娱乐于 2008 年合并。）投诉还称，这家游戏公司的官员知道骚扰事件，不仅没有阻止，反而对发声的女性进行报复。在被称为 Gamergate 的针对视频游戏界女性的在线骚扰活动多年之后，加利福尼亚州的诉讼描绘了一个仍然不受欢迎甚至对女性员工怀有敌意的行业。 DFEH 主任凯文·基什 (Kevin Kish) 表示：“所有雇主都应确保员工获得平等报酬，并采取一切措施防止歧视、骚扰和报复。” “这对男性主导行业的雇主尤其重要，例如技术和游戏。”在提供给 NPR 的一份声明中，动视暴雪发言人表示，该公司近年来一直致力于改善其公司文化，并指责 DFEH 在诉诸诉讼之前没有充分尝试解决针对它的索赔。声明中写道：“DFEH 包括对暴雪过去的歪曲，在许多情况下是错误的描述。” “DFEH 描绘的画面不是今天的暴雪工作场所。”\n该诉讼称，与调查人员交谈的动视暴雪的女员工“几乎普遍证实”她们在公司的时间“类似于在兄弟会的房子里工作”。诉讼称，男性员工在工作时喝酒，宿醉后上班。所谓的性骚扰包括对女性身体的评论和关于强奸的笑话，以及男性同事不情愿地触摸女性员工。该投诉是 DFEH 为期两年调查的结果，声称对女性的不平等待遇超出了公司文化，体现在她们工作中更正式的部分。据称，无论是在受雇时还是在受雇期间，妇女的工资都低于男子。诉讼称，尽管在某些情况下，她们的工作量比男性同龄人多，但她们也被分配到较低级别的职位，并没有得到晋升。一位女士说，她的经理告诉她，她不会升职，因为“她可能会怀孕，而且太喜欢当妈妈了。”诉讼称，对有色人种女性而言，性别歧视更为严重。至少有两名非洲裔美国女性报告说被挑出来并进行微观管理。诉讼称，一些提出歧视或骚扰投诉的女性面临非自愿调动、被选中裁员或被剥夺某些机会。动视暴雪在其声明中表示，它不会容忍不当性行为或性骚扰，并指出已对所有索赔进行了调查，并补充说这让员工更容易举报违规行为。\n该公司还表示，它努力为“同等或基本相似的工作”支付员工薪酬，并确保薪酬由“非歧视性因素”驱动，例如绩效。发言人说：“我们有信心展示我们作为平等机会雇主的做法，为我们的员工营造一个支持性、多元化和包容性的工作场所，我们致力于在未来几年继续努力。” “令人遗憾的是，DFEH 不想就他们认为在调查中看到的内容与我们接触。”但是，在提起诉讼以证实其中包含的一些指控后，几名前雇员周三在社交媒体上发表了看法。 “暴雪声称 DFEH 的报告是虚假的/误导性的/不负责任的，”前暴雪娱乐员工 Cher Scarlett 发推文说。 “我可以告诉你，我在阅读这份报告之前就知道会发生什么，因为在我在那里的那段时间——只有一年——我目睹了所有这些事情。”", "note_en": "The video game studio behind the hit franchises Call of Duty, World of Warcraft and Candy Crush is facing a civil lawsuit in California over allegations of gender discrimination, sexual harassment and potential violations of the state&#39;s equal pay law.\n  A  complaint, filed by the state Department of Fair Employment and Housing on Wednesday, alleges that Activision Blizzard Inc. &#34;fostered a sexist culture&#34; where women were paid less than men and subjected to ongoing sexual harassment including groping. (Activision and Blizzard Entertainment merged in 2008.)\n  Officials at the gaming company knew about the harassment and not only failed to stop it but retaliated against women who spoke up, the complaint also alleges.\n  Years after the online harassment campaign known as  Gamergate targeted women in the video game world, the California lawsuit depicts an industry that can still be unwelcoming and even hostile to female employees.\n  &#34;All employers should ensure that their employees are being paid equally and take all steps to prevent discrimination, harassment, and retaliation,&#34; said DFEH Director Kevin Kish. &#34;This is especially important for employers in male-dominated industries, such as technology and gaming.&#34;\n       In a statement provided to NPR, an Activision Blizzard spokesperson said the company had worked to improve its company culture in recent years and accused the DFEH of not adequately trying to resolve the claims against it before resorting to a lawsuit.\n  &#34;The DFEH includes distorted, and in many cases false, descriptions of Blizzard&#39;s past,&#34; the statement read. &#34;The picture the DFEH paints is not the Blizzard workplace of today.&#34;\n    The lawsuit alleges that Activision Blizzard&#39;s female workers who spoke to investigators &#34;almost universally confirmed&#34; that their time at the company was &#34;akin to working in a frat house.&#34;\n  Male employees drank on the job and came to work hungover, the lawsuit said. The alleged sexual harassment ranged from comments about women&#39;s bodies and jokes about rape to the unwanted touching of female employees by their male peers.\n  The complaint, which was the result of a two-year investigation by DFEH, claims that the unequal treatment of women went beyond company culture to the more formal parts of their jobs.\n     Women were allegedly paid less than men, both when they were hired and during the course of their employment. They were also assigned to lower-level positions and passed over for promotions, despite doing more work than their male peers in some cases, according to the lawsuit. One woman said her manager told her she wouldn&#39;t be promoted because &#34;she might get pregnant and like being a mom too much.&#34;\n  The sex discrimination was even worse for women of color, the suit claims. At least two African-American women reported being singled out and micromanaged.\n    Some of the women who came forward with complaints of discrimination or harassment faced involuntary transfers, were selected for layoffs or were denied certain opportunities, the suit said.\n    Activision Blizzard, in its statement, said it did not tolerate sexual misconduct or harassment and noted that investigated all claims, adding that it was making it easier for employees to report violations.\n  The company also said it strives to pay its employees &#34;fairly for equal or substantially similar work&#34; and ensure that pay is driven by &#34;non-discriminatory factors,&#34; such as performance.\n  &#34;We are confident in our ability to demonstrate our practices as an equal opportunity employer that fosters a supportive, diverse, and inclusive workplace for our people, and we are committed to continuing this effort in the years to come,&#34; the spokesperson said. &#34;It is a shame that the DFEH did not want to engage with us on what they thought they were seeing in their investigation.&#34;\n  But several former employees took to social media Wednesday after the lawsuit was filed to corroborate some of the allegations it contained.\n  &#34;Blizzard has claimed that the DFEH report is false/misleading/irresponsible,&#34; former Blizzard Entertainment employee Cher Scarlett  tweeted. &#34;I can tell you that I knew what was going to be in this report before I read it because during my time there - for only a YEAR - I witnessed ALL OF THESE THINGS.&#34;", "posttime": "2021-07-23 06:10:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "起诉,sues,女性", "title": "加州起诉动视暴雪的薪酬不平等和性骚扰", "title_en": "California Sues Activision Blizzard Over Unequal Pay, Sexual Harassment", "transed": 1, "url": "https://www.npr.org/2021/07/22/1019293032/activision-blizzard-lawsuit-unequal-pay-sexual-harassment-video-games", "via": "", "real_tags": ["起诉", "sues", "女性"]}, {"category": "", "categoryclass": "", "imagename": "582145122dca2183df893e2ef7cc004e.png", "infoid": 1069120, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于色情公司购买了一个流行的、已不复存在的视频托管网站的域名，所以铁杆色情内容被嵌入在所有普通网站上。正如推特用户@dox_gay 指出的那样，铁杆色情片现在被嵌入在赫芬顿邮报、纽约杂志、华盛顿邮报和许多其他网站的页面上。这是因为一个名为 5 Star Porn HD 的色情网站为 Vidme 购买了域名，Vidme 是 YouTube 的一个简短竞争对手，成立于 2014 年，并于 2017 年关闭。其 Twitter 帐户仍在运行，但域名已失效。似乎任何 vid.me 嵌入现在都重定向到 5 Star Porn HD 主页。网站 vid.me 也重定向到那里。例如，如果您查看这篇纽约杂志关于前众议院多数党领袖约翰博纳“令人毛骨悚然的亲吻脸”的文章，您会看到博纳的照片以及一个男人用巨大阴茎操女人的照片。此页面的存档版本显示该页面以前嵌入了 vid.me；该页面的源代码显示相同。在赫芬顿邮报上，一篇关于 Martin Shkreli 被 Twitter 禁止的文章增加了标题为“进入 Porsha 的屁股”和“我们为什么不标记团队你的 GF？”的视频。一篇关于特朗普在共和党辩论中的表现的前特朗普总统 Uproxx 文章用标题为“Aria Lee 回来了”和“顽皮的间谍女孩第 2 部分”的视频缩略图进行了说明。这很有趣，很不幸，也是一个更大问题的例子：互联网是一种集体幻觉，由于链接腐烂而逐渐消失。", "note_en": "Hardcore porn is embedded all over regular-ass websites because a porn company has purchased the domain of a popular, defunct video hosting site.\n  As  pointed out by Twitter user @dox_gay, hardcore porn is now embedded on the pages of the Huffington Post,  New York magazine,  The Washington Post, and a host of other websites. This is because a porn site called 5 Star Porn HD bought the domain for Vidme, a brief YouTube competitor founded in 2014 and  shuttered in 2017. Its Twitter  account is still up, but the domain lapsed.\n   Seemingly any vid.me embeds now redirect to the 5 Star Porn HD homepage. The site vid.me also redirects there. For example, if you check out this  New York  magazine article about former House Majority leader John Boehner&#39;s &#34;creepy kissy face,&#34; you will see photos of Boehner but also images of a man with a gigantic penis fucking a woman.\n  Archived versions of this page show that there was formerly a vid.me embed on the page; the page&#39;s source code shows the same.\n    Over at the Huffington Post, an article about Martin Shkreli  being banned from Twitter is augmented with videos titled “Getting Into Porsha’s Ass” and “Why Don’t We Tag Team Your GF?”\n   A pre-Trump-presidency Uproxx article about Trump’s performance at a GOP debate is illustrated with thumbnails for videos titled “Aria Lee Is Back For More” and “Naughty Spy Girls Part 2.”\n   This is funny, unfortunate, and also, an example of a much larger problem: The  internet is a collective hallucination that is fading away thanks to link rot.", "posttime": "2021-07-23 06:10:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "域名,视频,porn,文章", "title": "一家色情公司购买了已倒闭的视频服务 Vidme 的域名后，包括 WaPo 在内的新闻网站上的旧报道正在显示嵌入的色情视频", "title_en": "Old stories on news sites including WaPo are displaying embedded porn videos after the domain for the defunct video service Vidme was bought by a porn company", "transed": 1, "url": "https://www.vice.com/en/article/qj8xz3/a-defunct-video-hosting-site-is-flooding-normal-websites-with-hardcore-porn", "via": "", "real_tags": ["域名", "视频", "porn", "文章"]}, {"category": "", "categoryclass": "", "imagename": "d9ef8e6f150ec0fabb32f3d907586c05.jpg", "infoid": 1069119, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦上诉法院周二裁定，尽管 Viasat 提起诉讼，SpaceX 仍可以继续发射宽带卫星。 Viasat 在 5 月起诉联邦通信委员会，并要求法官暂停，以阻止 SpaceX 正在进行的低地球轨道 (LEO) 卫星发射，这些卫星为 Starlink 互联网服务提供动力。为了获得停留，Viasat 必须证明它有可能赢得其指控 FCC 不当批准卫星发射的诉讼。美国哥伦比亚特区巡回上诉法院的一个三名法官小组没有被说服，他们在简短的命令中表示“Viasat 没有满足暂停等待法院审查的严格要求。”然而，法官确实批准了加快上诉的动议，因此案件的进展速度应该比正常情况要快。 Viasat 担心，一旦 Starlink 退出测试阶段并得到更广泛的应用，其从地球同步卫星提供的较慢的互联网服务将失去客户。 Viasat 有一些 LEO 卫星计划，但与 SpaceX 正在发射的数千颗卫星或 SpaceX 已经在运行的 1,500 颗左右的卫星相比，没有任何接近。 Viasat 声称，FCC 在批准 SpaceX 卫星发射时没有遵守《国家环境政策法案》(NEPA)，因为该委员会“拒绝进行任何环境评估”。 Viasat 告诉 DC 巡回法庭，SpaceX 的发射应该停止，因为当卫星被带出轨道时可能会对环境造成危害；改变夜空的光污染；轨道碎片；可能影响 Viasat 的碰撞风险；并且因为“Viasat 将遭受不必要的竞争伤害”。 “该法院可能会撤销 [FCC] 命令，并指示委员会至少对 Starlink 进行一些 NEPA 审查，”Viasat 写道。 “任何 [SpaceX] 发射都应该在审查之后进行，而不是之前。本法院应在审查之前暂缓执行该命令。” Viasat 认为，如果 FCC 的命令最终得到维持，中止不会对 SpaceX 造成太大伤害。 “如果该法院维持委员会的 NEPA 裁决，中止的唯一影响就是将 SpaceX 根据 [FCC] 命令发射卫星的能力推迟几个月，” Viasat 写道。\nViasat 写道，SpaceX“打算利用其对环境不负责任的星座来扩大其在地理上的影响力并直接与 Viasat 竞争，从而解释了其财务问题。SpaceX 发射卫星的速度使得此次上诉期间损害的程度和风险特别高。 ” Viasat 表示，它“至少在与 Starlink 相同高度运行一颗卫星”，并且“与国防部签订了一份合同，在与 Starlink 卫星相同的轨道范围内运行一颗高价值的 LEO 卫星，它打算在接下来的六到十二个月内推出。” Viasat 声称“失败的 SpaceX 卫星和涉及 SpaceX 卫星的碰撞产生的碎片可能会损坏、禁用或摧毁 Viasat 的卫星。” Dish Network 也在与 SpaceX 的 FCC 批准抗争，Dish 的案子与 Viasat 的上诉合并。评委们为 Viasat 和 Dish 设定了 8 月 6 日提交开场摘要的截止日期。 FCC 的截止日期为 9 月 21 日，SpaceX 的截止日期为 9 月 28 日。Dish 和 Viasat 的截止日期为 10 月 12 日，最终摘要将于 10 月 26 日到期。口头辩论将在“第一个合适的日期”之后进行。内裤。 FCC 和 SpaceX 上个月提交了简报，反对 Viasat 的暂停动议。美国联邦通信委员会告诉法官，它“仔细审查并合理驳回了 Viasat 的索赔......对于每一类所谓的环境影响，委员会详细考虑了所称的影响，并发现证据不足，表明 SpaceX 的许可证修改......需要进一步审查。” FCC 已多次批准 SpaceX 发射卫星。 2018 年，FCC 批准了 4,408 颗海拔 1,100-1,300 公里的卫星。 2019 年，该机构批准了一项许可修改，将其中 1,584 颗卫星的轨道高度降低了一半。 Viasat 挑战的 FCC 命令是 2021 年 4 月授予的另一项许可证修改，将其余 2,824 颗卫星的高度降低到 540-570 公里。美国联邦通信委员会在其法庭简报中表示，许可变更属于“通常不会对人类环境产生重大影响的行为”。 FCC 表示，在这种“绝对排除”下，NEPA 不要求进行审查，除非在“特殊情况”下可能会产生“重大环境影响”。 FCC 确实要求 SpaceX 解释它将如何防止轨道碎片、太空碰撞以及卫星再入时的人员伤亡。 FCC 还对许可证施加了条件。\n“SpaceX 的轨道碎片减缓计划解释说，卫星能够进行机动以避免碰撞，并且较低的高度有助于通过确保卫星更快地下降到大气层并在其使用寿命结束时被摧毁来最大限度地减少碎片，”美国联邦通信委员会告诉法官。 “SpaceX 还通过解释说，SpaceX 已经修改了除最初 75 颗卫星之外的所有卫星的设计，以便‘卫星的任何部件都不会在重返大气层后幸存下来，从而减少人员伤亡，从而解决了部分卫星在重返大气层后可能造成的潜在伤亡风险。风险为零。&#39;”美国联邦通信委员会表示，它“在条件包括遵守当前和未来的轨道碎片规则的情况下批准了修改。” FCC 对 Viasat 的动议提出了更多论据，并告诉法官 Viasat“依赖于主要是经济损害的投机性断言，这些断言不能证明 Viasat 存在的可能性，更不用说显示不可挽回的伤害，从而证明在上诉期间暂停等待的特殊补救措施是合理的。”美国联邦通信委员会表示，停止卫星发射将对“SpaceX 以及将宽带卫星服务推进到美国偏远或服务欠缺地区的公众利益”造成损害。 SpaceX 的文件称，Viasat 做出了“透明的竞标，以将《国家环境政策法》和特别停留救济程序作为商业战争的武器来增选”，并补充说：Viasat 新发现的环保主义被其每一次行动所掩盖。 Viasat 没有提出任何与任何其他卫星授权相关的环境问题，包括 SpaceX 授权在不同的高度运行 Starlink 卫星及其先前的要求（几乎与此处讨论的问题相同）降低许多这些卫星。相反，Viasat——一个以前试图完全逃避委员会监管的非美国被许可人——最终依靠“竞争损害”来支持其中止请求。但抑制竞争和保护利润并不是 NEPA 的目的。", "note_en": "SpaceX can keep launching broadband satellites despite a lawsuit filed by Viasat, a federal appeals court ruled Tuesday.\n Viasat  sued the Federal Communications Commission in May and  asked judges for a stay that would halt SpaceX&#39;s ongoing launches of low Earth orbit (LEO) satellites that power Starlink Internet service. To get a stay, Viasat had to show that it is likely to win its lawsuit alleging that the FCC improperly approved the satellite launches.\n A three-judge panel at the US Court of Appeals for the District of Columbia Circuit was not persuaded, saying in a  short order that &#34;Viasat has not satisfied the stringent requirements for a stay pending court review.&#34; The judges did grant a motion to expedite the appeal, however, so the case should move faster than normal.\n  Viasat is worried that its slower Internet service delivered from geostationary satellites will lose customers once Starlink is out of beta and more widely available. Viasat has some LEO-satellite plans but nothing close to the thousands of satellites that SpaceX is launching or the 1,500 or so SpaceX already has in operation.\n Viasat alleged that the FCC did not comply with the National Environmental Policy Act (NEPA) when it approved SpaceX satellite launches because the commission &#34;refused to conduct  any environmental assessment.&#34; Viasat told the DC Circuit court that SpaceX launches should be halted because of potential environmental harms when satellites are taken out of orbit; light pollution that  alters the night sky; orbital  debris;  collision risks that may affect Viasat; and because &#34;Viasat will suffer unwarranted competitive injury.&#34;\n &#34;This court is likely to vacate the [FCC] order and direct the commission to conduct at least  some NEPA review of Starlink,&#34; Viasat wrote. &#34;Any [SpaceX] launches should occur after that review, not before. This court should stay the order pending its review.&#34;\n    Viasat argued that a stay won&#39;t harm SpaceX much if the FCC order is ultimately upheld. &#34;If this court upholds the commission&#39;s NEPA ruling, the only effect of the stay would be to delay SpaceX&#39;s ability to launch satellites pursuant to the [FCC] order by some number of months,&#34; Viasat wrote.\n  Viasat explained its financial concerns by writing that SpaceX &#34;intends to use its environmentally irresponsible constellation to extend its reach geographically and directly compete with Viasat. The rate at which SpaceX is launching satellites makes both the extent and risk of harm during this appeal particularly high.&#34;\n Viasat said it &#34;operates at least one satellite at the same altitude as Starlink&#34; and that it has a &#34;contract with the Department of Defense to operate a high-value LEO satellite in the same orbital range as the Starlink satellites, which it intends to launch in the next six to twelve months.&#34; Viasat alleged that &#34;failed SpaceX satellites and debris from a collision involving a SpaceX satellite can damage, disable, or destroy Viasat&#39;s satellites.&#34;\n Dish Network is also fighting SpaceX&#39;s FCC approval, and Dish&#39;s case was consolidated with Viasat&#39;s appeal. The judges set an August 6 deadline for Viasat and Dish to file opening briefs. The FCC will have until September 21, and SpaceX will have a deadline of September 28. Dish and Viasat will have until October 12 to file replies, and final briefs are due October 26. Oral arguments will follow &#34;on the first appropriate date&#34; after briefs.\n  The FCC and SpaceX last month filed briefs opposing Viasat&#39;s motion for a stay. The  FCC told judges that it &#34;closely examined and reasonably rejected Viasat&#39;s claims... As to each category of alleged environmental impact, the Commission considered the alleged effect in detail and found insufficient evidence that SpaceX&#39;s license modification... requires further review.&#34;\n The FCC has given SpaceX several approvals of satellite launches. In 2018, the FCC approved 4,408 satellites at altitudes of 1,100-1,300 km. In 2019, the agency granted a license modification that cut the orbital altitude of 1,584 of those satellites in half.\n    The FCC order that Viasat challenged was another license modification  granted in April 2021 that lowered the altitude of the remaining 2,824 satellites to 540-570 km. The FCC said in its court brief that the license change fell into a category &#34;of actions that normally do not have a significant effect on the human environment.&#34; Under this &#34;categorical exclusion,&#34; a review is not required by NEPA except in &#34;extraordinary circumstances&#34; in which there may be &#34;significant environmental impact,&#34; the FCC said.\n The FCC did require SpaceX to explain how it will prevent orbital debris, collisions in space, and casualties upon satellite reentry. The FCC also imposed conditions on the license.\n &#34;SpaceX&#39;s orbital debris mitigation plan explained that the satellites are capable of maneuvering to avoid collisions, and that the lower altitude helps minimize debris by ensuring satellites more quickly descend into the atmosphere and are destroyed at the end of their useful lives,&#34; the FCC told judges. &#34;SpaceX also addressed the potential casualty risk resulting from portions of satellites surviving reentry by explaining that SpaceX had revised the design of all but the initial 75 satellites so that &#39;no components of... the satellite will survive atmospheric re-entry, reducing casualty risk to zero.&#39;&#34; The FCC said it &#34;granted the modification with conditions including compliance with current and future orbital debris rules.&#34;\n   The FCC had more arguments against Viasat&#39;s motion, telling judges that Viasat &#34;relies on speculative assertions of primarily economic harm that do not demonstrate a likelihood that Viasat has standing, much less show irreparable injury justifying the extraordinary remedy of a stay pending appeal.&#34; Halting the satellite launches would create harm &#34;to SpaceX and to the public interest in advancing broadband satellite service to remote or underserved areas of the United States,&#34; the FCC said.\n SpaceX&#39;s filing alleged that Viasat made a &#34;transparent bid to co-opt the National Environmental Policy Act and the procedure for extraordinary stay relief as weapons of commercial warfare,&#34; adding:\n Viasat&#39;s newfound environmentalism is belied by its actions at every turn. Viasat failed to raise any environmental concerns in connection with any other satellite authorization, including SpaceX&#39;s authorization to operate Starlink satellites at a different altitude and its prior request (nearly identical to the one at issue here) to lower many of those satellites. To the contrary, Viasat—a non-US licensee that has previously sought to escape Commission regulation altogether—ultimately relies on &#34;competitive harm&#34; to support its stay request. But stifling competition and protecting profits is not what NEPA is about.", "posttime": "2021-07-23 05:37:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "赢得,wins,viasat", "title": "SpaceX 赢得法院裁决，允许其继续发射 Starlink 卫星", "title_en": "SpaceX wins court ruling that lets it continue launching Starlink satellites", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/07/spacex-wins-court-ruling-that-lets-it-continue-launching-starlink-satellites/", "via": "", "real_tags": ["赢得", "wins", "viasat"]}, {"category": "", "categoryclass": "", "imagename": "3683b74fd4c1b3c00b3c3fddb297bed3.jpeg", "infoid": 1069118, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据美联储周一公布的数据，第一季度最富有的 1% 的美国人控制着约 41.52 万亿美元。然而，底层 50% 的美国人总共只控制了约 2.62 万亿美元，比顶层 1% 的人少了大约 16 倍。第一季度所有美国家庭的财富都增加了。根据美联储 2021 年 6 月 10 日发布的单独数据，总体而言，第一季度家庭和非营利组织的净资产增至 136.9 万亿美元，比 2020 年底增长 3.8%。但这些收益并未分配相等。净值本质上是计算一个人的所有资产——包括支票和储蓄账户中的现金、金融投资以及拥有的任何房地产或车辆的价值——减去他们的所有债务，包括信用卡余额、学生贷款和抵押贷款。根据美联储的数据，最近家庭财富的增长主要归功于股票持有量，增加了约 3.2 万亿美元。房屋价值的上涨也发挥了作用，房地产持有量增加了 1 万亿美元。但一些批评人士认为，美联储的低利率政策提振了股市，给那些拥有股票和投资的人带来了优势。例如，根据美联储的数据，截至 2021 年第一季度，最富有的 10% 的美国人拥有美国约 89% 的股票和共同基金。美国最底层的 50% 家庭持有大约 0.5% 的股份。的确，在过去的几十年里，最富有的美国人和最底层的美国家庭之间的鸿沟已经扩大。 1990 年第一季度，最富有的 1% 的人拥有的财富大约是最底层的美国人的 6 倍。美联储主席杰罗姆鲍威尔周二在书面证词中表示，自 Covid-19 大流行开始以来，美国经济已经“持续改善”，但指出反弹并不均衡。\n鲍威尔说：“经济衰退并没有平等地降临到所有美国人身上，那些最无力承担负担的人受到的打击最大。”他指出，服务业的低薪工人以及黑人和西班牙裔美国人的失业率持续存在。然而，鲍威尔认为大流行带来了乐观的理由，特别是对于那些过去被抛在后面的人。 “那些历来被抛在后面的人最有可能在拥有大量就业机会的强劲经济中繁荣起来，”他说。 “当每个人都可以为繁荣做出贡献并分享繁荣的好处时，我们的经济将变得更强大、表现更好。”", "note_en": "The wealthiest 1% of Americans controlled about $41.52 trillion in the first quarter, according to  Federal Reserve data released Monday. Yet the bottom 50% of Americans only controlled about $2.62 trillion collectively, which is roughly 16 times less than those in the top 1%.\n Wealth across all U.S. households increased during the first quarter. Overall,  the net worth of households and nonprofits rose to $136.9 trillion during the first quarter, a 3.8% increase from the end of 2020, according to separate data published by the Federal Reserve on June 10, 2021. But those gains weren&#39;t distributed equally.\n  Net worth is essentially a calculation of all of a person&#39;s assets — including cash in checking and savings accounts, financial investments and the value of any real estate or vehicles owned — minus all their debt, including credit card balances, student loans and mortgages.\n The recent gains in household wealth, in particular, can be largely attributed to stock holdings, which were up about $3.2 trillion, according to the Fed. The rise in home values also played a role, with real estate holdings increasing by $1 trillion.\n  But  some critics contend that the Fed&#39;s low interest rate policies have boosted the stock market, giving an edge to those who own stocks and investments. The wealthiest 10% of Americans, for example, own about 89% of stocks and mutual funds held in the U.S. as of the first quarter of 2021,  according to Fed data. The bottom 50% of U.S. households hold around 0.5%.\n It is true that the divide between the wealthiest Americans and the bottom half of U.S. households has widened over the last few decades. In the first quarter of 1990, the top 1% had roughly six times the wealth as the bottom half of Americans.\n   In a written testimony, Federal Reserve Chairman Jerome Powell said Tuesday that the U.S. economy has seen &#34;sustained improvement&#34; since the start of the Covid-19 pandemic but noted that the bounce back has not been equal.\n &#34;The economic downturn has not fallen equally on all Americans, and those least able to shoulder the burden have been the hardest hit,&#34; Powell said. He noted that unemployment persists among lower-wage workers in the service sector and among Black and Hispanic Americans.\n Yet Powell sees reason for optimism coming out of the pandemic, particularly for those who have been left behind in the past. &#34;Those who have historically been left behind stand the best chance of prospering in a strong economy with plentiful job opportunities,&#34; he said.\n &#34;Our economy will be stronger and perform better when everyone can contribute to, and share in, the benefits of prosperity.&#34;", "posttime": "2021-07-23 05:33:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,wealth,拥有", "title": "最顶层的美国人拥有的财富大约是底层 50% 的 16 倍", "title_en": "The top% of Americans have about 16 times more wealth than the bottom 50%", "transed": 1, "url": "https://www.cnbc.com/2021/06/23/how-much-wealth-top-1percent-of-americans-have.html", "via": "", "real_tags": ["美国", "wealth", "拥有"]}, {"category": "", "categoryclass": "", "imagename": "e6adfaf83dbb9570cd9187e6714d7546.jpg", "infoid": 1069117, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论您的目标是改善健康、心理平静还是实现超越，呼吸技巧都可以帮助您实现目标 您永远不知道何时会遇到改变您人生轨迹的人。对我来说，大约发生在五年前，当时我不知道自己在做什么，报名参加了荷兰的一门课程，该课程由传奇的寒冷暴露大师 Wim Hof 开办。霍夫是一位非凡的老师，以其世界纪录和其他耐力壮举而闻名，例如之前因完成有史以来最长的冰浴而获得冠军，在北极圈内进行赤脚半程马拉松比赛，以及穿着雪茄攀登珠穆朗玛峰的大部分短裤。他让人们爱上低温的方法中最重要的元素之一就是他所说的“有意识的呼吸”。通过控制呼吸，他将在冰水中的体验，这通常是为了生存而战，变成了一种深刻的冥想。当我遇到 Hof 时，我的生活一直在挣扎——我总是生病，感到沮丧和不快乐。我一直在寻找改善免疫系统和增加能量水平的方法。那时我不知道我的许多问题的答案会如此明显：只要呼吸。呼吸影响我们体内的许多过程，这些过程直接影响我们的身心健康。每天，我们需要大约 20,000 次呼吸，所以多年来它加起来。每次吸气时，我们的心率都会加快，而每次呼气时，它都会减慢。神经系统对呼吸频率的变化特别敏感。通过我们的呼吸，我们可以将我们的状态从压力转变为放松，或从感觉沉闷转变为精力充沛。从长远来看，通过更加关注我们的呼吸方式，我们可以有益于我们的健康和长寿。简而言之，我们可以根据需要改变我们的呼吸，这可能是访问我们其余生理机能的一种方法。我从霍夫和其他人那里学到的东西给了我很大的启发和改变，我觉得我别无选择，只能把它传给别人，今天，我是一名呼吸教练。什么是呼吸法？它可以被描述为“呼吸意识”和“有意识的呼吸”。每次我们注意到我们的呼吸或改变我们的呼吸模式以达到特定的结果时，我们就是在练习呼吸。今天，呼吸是新的瑜伽。从治疗课程到体育课，它随处可见，虽然它目前很流行，但它远非新鲜事物。很难确定人类决定有意使用呼吸的第一个时刻，但您可以在数百年前的印度教经文中找到有意识呼吸的早期迹象，例如在公元前 2 世纪和 2 世纪之间的某个时间编写的《博伽梵歌》中行政长官：\n还有一些人倾向于通过止息过程保持入定，通过提供出气入入出入息、入入出入出入息的运动来练习，最后保持入出入止，停止所有呼吸。其他人则减少进食过程，将呼出的气息提供给自己作为牺牲。构成苯教传统基础的Tonpa Shenrab Miwoche 的西藏教义更古老，可以追溯到18,000 年前。呼吸技巧也已在瑜伽中使用了 2000 多年。事实上，呼吸法几乎存在于所有传统和文化中：神话、哲学、各种仪式、成年礼、治疗方法、精神和宗教实践、武术和冥想。对于许多人来说，呼吸不仅仅是空气的纯粹物理运动。它通常被描述为能量、生命力、宇宙本质、渗透现实各个层面的重要原则，包括无生命的物体。它是灵或魂。不同的文化指的是同一种现象，但名称不同，例如：prana、qi、ki、lung、ruach、spiritus、mana、rouh 和 pneuma。在瑜伽中，呼吸不仅被认为是精神发展的途径，也是保持身体健康的一种简单方式。在瑜伽呼吸调息法中，对练习进行了很好的描述，每个练习都有自己的目的——包括活力、净化或放松。很长一段时间，大多数主流医生对呼吸法都没有兴趣，但这种情况在 1950 年代开始发生变化。例如，在研究呼吸频率影响健康的方式之后，乌克兰出生的医生康斯坦丁·布泰科 (Konstantin Buteyko) 创造了一种治疗呼吸障碍的技术，例如哮喘、一般呼吸困难和鼻炎，以及治疗高血压。他的方法被用于俄罗斯各地的医院。现在，“Buteyko 方法”虽然被认为是一种替代医学，但已在全球范围内用于治疗呼吸模式障碍。总的来说，我相信我们对神经系统的现代理解和科学研究正在证实瑜伽呼吸练习具有预期的效果。我们正在重新发现瑜伽士很久以前就知道的东西。如今，运动员也对呼吸运动产生了兴趣。在体育运动中，它始终是一场军备竞赛。谁找到了一种以微不足道的方式改进的新方法，就可以在竞争中获得巨大的优势。运动员正在转向传统的瑜伽呼吸控制练习，作为调节身体和加强呼吸系统的一种手段——某些呼吸练习可以提高身体使用氧气的效率。呼吸法与耐力运动尤其相关。 Buteyko 方法表明，鼻呼吸和呼吸流量限制有助于提高身体对二氧化碳 (CO 2) 的耐受性。屏气方法也被广泛测试，作为一种增加身体负荷和创造有益的长期适应的方式，类似于高原训练。然而，尽管呼吸很重要并且呼吸练习越来越流行，但仍有许多人从未考虑过生命的这一基本方面。如果不是因为我们的自主神经系统，我敢打赌我们中的许多人可能会因为在阅读电子邮件时忘记呼吸而死亡。在本指南中，我将向您展示一些基本的呼吸技巧。无论您是希望获得优势的奥林匹克级别运动员，还是正在努力应对慢性焦虑，或者只是好奇，您都在呼吸，那么为什么不开始利用呼吸来为自己谋利呢？即使在与这么多人一起工作之后，呼吸法的潜力——我们所有人都可以使用的工具——仍然让我大吃一惊。它可以像学习三分钟的放松程序一样简单，也可以是自我发展的终生旅程的开始——无论哪种方式，欢迎呼吸。如果您非常忙碌并且觉得自己没有太多时间进行呼吸训练，但又想通过呼吸来改善健康和幸福感，我建议您尝试实施最基本的原则之一：练习用鼻子呼吸而不是用嘴呼吸。这是你可以一整天……和晚上做的事情。\n它减缓流入的气流，这对神经系统有镇静作用（具体来说，它激活副交感神经系统，这有助于促进平静和放松）。空气在肺泡中流动速度较慢，停留时间较长，在那里进行气体交换。这使氧气有更多时间在血液中扩散，从而使氧气摄取量增加 10-20%。进入肺部的空气经过调节以更好地适应身体——根据外部环境加热或冷却。通过鼻子呼吸，您排出的水分最多可减少 40%（这意味着您不太容易脱水）。它避免了与长期过度口呼吸相关的问题，例如牙齿问题、上呼吸道发炎、头部前倾甚至下巴形状的变化。鼻子堵了怎么办？您应该尽一切努力解除封锁。有时，这只是克服呼吸急促感觉不适的一种情况。您可能已经习惯了口呼吸，以至于一开始用鼻呼吸会感觉不自然。但是你用鼻子呼吸的次数越多，它就越容易。如果你真的很挣扎，鼻扩张器、膏药或喷雾剂（清洁鼻孔）会在早期和几周内帮助你。如果您的鼻中隔偏曲（分隔鼻孔的骨骼和软骨错位）会干扰鼻呼吸，您可以考虑与您的医生讨论进行矫正手术。如果您的鼻腔只是轻微堵塞，您可以通过一个简单的练习来帮助清除它们：轻轻呼气，捏住鼻子并屏住呼吸。在您屏气的高峰期，CO 2 和一氧化氮会积聚，两者都是血管扩张剂，有助于疏通通道。\n什么时候应该用鼻子呼吸？一个好的指导是分三个阶段思考它：在休息和低强度时，你可以一直处于阶段 1。当你开始移动甚至举起重物时，你可以尝试尽可能长时间地停留在这个阶段。在努力变得太困难的时候，进入阶段 2。如果你增加更多的负荷，接近你的最大容量，那么阶段 3 将是必要的。一旦努力减少，您可以分别回到第 2 阶段和第 1 阶段。您在生活中可以采取的另一个改善呼吸的基本步骤是考虑您的姿势。它是双向的——不良姿势会限制你的呼吸，而呼吸模式紊乱会对你的肌肉系统产生负面影响。为了更好地管理我们的姿势，我们需要仔细观察横膈膜，它在核心稳定中起着关键作用。它是一块巨大的圆顶状肌肉，位于我们的肋骨下方，将胸腔和腹腔分开。当您吸气时，横膈膜向下移动，从而在您的肺部产生压力差并吸入空气。当您放松时，隔膜会向上移动，空气就会排出。这里是自然呼吸的指导——吸气是主动的，吸入空气，呼气是被动的，因为你只是放松，不必把空气推出。仰卧或舒适地坐在地板或椅子上。您可以将手放在身体上以获得触觉反馈。将注意力集中在吸气上，观察您的腹部在空气被吸入肺部时扩张。发生这种情况时，您的上胸部和肩膀应该保持静止。每次呼气都是被动的——只要放松，空气就会排出；没有必要推动。片刻之后，一旦它变得轻松，将注意力转移到下肋骨周围的腹部区域的两侧。尝试接合下肋骨 - 每次吸气时，它们都应该稍微向两侧扩张。这将是一个比前面更微妙的动作。\n在这个区域再花几分钟后，把注意力集中在你的下背部。想象一下，每次吸气时，下背部都会被轻轻激活，每次呼气时它都会放松。随着时间的推移，您将能够毫不费力地将这三个区域（正面、侧面和背面）结合起来，这样吸气时的膨胀不仅在腹部前部，而且在您身体周围 360 度都能感受到。如果一开始你没有感觉到肋骨或下背部有任何活动，别担心，给它一些时间。每天花几分钟练习这个，其余时间正常呼吸。即使你不专注于呼吸，随着时间的推移，你会发现它变得更充实、更放松。与浅胸式呼吸相比，横膈膜呼吸有多种好处。它更放松，使气体交换过程更有效率。由精神或身体疲惫引起的氧化压力可以通过横膈膜呼吸来缓解。我们经常听说呼吸可以提高我们的免疫系统，这有一定的道理。横膈膜呼吸有助于移动淋巴（流经淋巴系统的液体），从而使病原体通过淋巴结，在那里它们可以用特定的淋巴细胞进行治疗。另一个好处是增加了心脏的血流量。最后，如果你将横膈膜作为肌肉来加强（通过有规律的横膈膜呼吸），你会增加你的身体耐力。通过练习，呼吸可以帮助您在一定程度上控制压力反应，这是您可以想象的最重要的超能力之一。由于您的身体受节律控制——您的神经系统接收稳定的气流作为安全提示，并相应地调整其他身体过程——您可以利用这一点。一种方法是通过瑜伽中的常见练习，我们在其中呼吸和呼气。目的是找到一个舒适的呼吸长度，一旦变得轻松，节奏就可以放慢。通常，经过几分钟有节奏的呼吸后，您会感觉到身体副交感神经系统的转移，这是自主神经系统的一个分支，不仅可以帮助我们的身体修复和恢复，还可以提高我们的社交参与度。有节奏的呼吸也显示出有助于治疗抑郁和焦虑的希望。以下是试一试的方法：\n找一个舒适的姿势，坐着或躺着。闭上眼睛，用鼻子呼吸。放慢呼吸速度，遵循吸气 6 秒和呼气 6 秒的模式。如果这太难了，请选择更短的计数，例如 3 或 4 秒，然后相同。当 6 秒的节奏变得轻松时，您可以尝试将长度延长到 8 秒、10 秒，甚至更长。此外，为了获得更大的放松效果，您可以尝试将呼气时间延长为吸气时间的两倍。如果您在一切顺利的情况下花时间练习这种呼吸方式，您会发现在呼吸期间使用它来让自己平静下来会更有效。不安的时刻。你可以为你的心理过程做的最重要的事情之一是让适量的氧气进入你的大脑和重要器官。你的呼吸频率是关键。您正在寻找的是缓慢而轻柔的呼吸。当我们的呼吸又快又浅时，我们主要是在“死空间”中移动空气，这是不参与气体交换的空气量（不被身体利用）。这就是为什么我们想要缓慢而深呼吸的原因，这可以让我们更好地进行气体交换。二氧化碳 (CO 2) 是空气中的气体，它会触发更快的呼吸频率——我们有一种将其从系统中排出的自然本能——所以减缓呼吸的一个关键是让我们更习惯于 CO 2。我们经常认为CO 2 作为负面的东西，我们必须摆脱的副产品。然而，CO 2 作为血管扩张剂在我们体内起着非常重要的作用。它还有助于从血液中释放氧气，这被称为玻尔效应。这就是为什么提高身体对 CO 2 的耐受性是有益的，有助于细胞吸收氧气。\n当您通过鼻子呼气时，您保留的 CO 2 比通过嘴呼气时多，因此尽可能多地练习鼻呼吸是第一步。除此之外，为了更好地控制呼吸，无论您是在治疗哮喘还是提高运动成绩，您都应该专注于提高对 CO 2 的耐受性。 我之前提到的 Buteyko 方法中的“呼吸轻”运动非常适合这个（为了确保您的安全，在尝试此练习之前请咨询您的医生）：从舒适的坐姿开始。睁大你的眼睛，或者，如果它可以帮助你更多地专注于呼吸，那就闭上眼睛。在用鼻子轻轻呼吸的同时，观察你吸入和呼出的空气量。开始将呼吸深度降低约 20-30%，直到您开始感到轻微的空气饥饿但不恐慌（您的呼吸频率应保持不变，处于通常的休息水平）。如果您将呼吸深度减少太多，到了强烈不适的程度，请恢复正常呼吸，重新设置并再次开始减少。找到一个平衡点，你可以感觉到轻微的空气饥饿，但可以继续这样呼吸 5-10 分钟。始终，在练习时，请确保您的整个身体都处于放松状态。如果您是呼吸练习的新手，请缓慢而轻柔地开始，只有在您感到舒适时才能进行。一旦你掌握了这个窍门，你就可以每天练习这个。根据 Buteyko 方法，当您提高对 CO 2 的耐受性时，您的呼吸会变得更轻、更轻松，并且您的平均呼吸频率会减慢。从业者还建议，这一过程有助于将氧从血红蛋白释放到细胞中，并有助于改善血液循环。如果您有积极的生活方式，这是增加耐力和延缓疲劳的好方法。\n在瑜伽中，称为 kumbhaka 的呼吸保持练习已经使用了数百年。许多大师指出这样一个事实，即练习有规律的呼吸保持不仅可以带来更大的健康，还可以增强耐力。现代科学发现为此提供了初步支持，表明几次屏气可以触发多种机制，帮助我们在没有空气的情况下停留更长时间。在呼吸滞留期间，我们的脾脏会收缩，释放出富含携氧红细胞的血液。我们还经历了促红细胞生成素激素的释放，这不仅进一步增加了红细胞计数，而且提高了线粒体的效率。与活跃的人一起工作时，很多时候我被问到这样一个问题：“我怎样才能通过呼吸来提高我的身体表现？”事实证明，有意识的屏气可能是可用于此目的的最强大的工具之一。运动表现与可以运输和利用的氧气量相关，而屏气训练可以建立这种能力。在运动中使用高原训练来提高身体表现也是基于类似的原则。处于低氧区（或“缺氧”）会迫使我们的身体适应，以便在回到海平面后，我们可以享受性能提高带来的好处。屏气有效地模拟了这种环境。 “呼气保持”或“高度模拟”技术可用于降低您体内的氧饱和度，即使只是片刻。作为训练计划的一部分，即使是在缺氧状态下的这些短暂时刻也能形成有意义的优势。由于呼吸保持是一项复杂的技术，我始终建议您应该向合格的老师学习。您的老师将向您展示如何在轻轻呼气后最大程度地屏住呼吸（将大约 30-40% 的空气留在肺部）。为了安全有效的培训，您的老师应该使用脉搏血氧仪来监测您的氧气水平。呼吸是影响我们健康的最重要因素之一。在所有文化中，它已在各种仪式、治疗和精神实践中使用了几个世纪。呼吸使我们能够影响我们的自主神经系统和我们身体的化学反应。许多最近用于治疗或运动的呼吸技巧都起源于瑜伽等传统练习。研究支持古老方法的功能。注意鼻呼吸是您可以采取的简单第一步，它将改善您的呼吸习惯并为您带来健康益处。实施正确的膈肌呼吸模式是改善姿势和核心稳定性的关键。\n减少 str 的最简单方法......", "note_en": "Whether your aim is improved health, mental calm or achieving transcendence, breathing techniques can help you get there\n You never know when you’re going to meet someone who will change the course of your life. For me, it happened about five years ago when, without knowing what I was getting myself into, I signed up to a course in the Netherlands run by Wim Hof – the legendary master of cold exposure.\n Hof is an extraordinary teacher, best known for his world records and other endurance feats, such as previously holding the title for completing the longest-ever ice bath, running a barefoot half-marathon in the Arctic Circle and climbing most of Mount Everest dressed in shorts. One of the most important elements of his method for making people fall in love with low temperatures is what he calls ‘conscious breathing’. By controlling the breath, he turns the experience of being in freezing water, which would normally be a fight for survival, into something profoundly meditative.\n Back when I met Hof, my life was a constant struggle – I was always getting ill, feeling depressed and generally unhappy. I was looking for ways to improve my immune system and increase my energy levels. I didn’t know then that the answer to many of my questions would be this obvious: just breathe.\n Respiration influences many of the processes in our body that have a direct impact on our physical and mental health. Each day, we take around  20,000 breaths, so over the years it adds up. With every inhalation, our heart rate speeds up and with every exhalation, it slows down. The nervous system is especially sensitive to changes in breathing rate. Through our breath, we can change our state from stress to relaxation, or from feeling dull to being energised. Longer term, through being more attentive to the way we breathe, we can benefit our health and longevity. In short, we can change our breathing on demand, which can be a hack to accessing the rest of our physiology.\n I was so inspired and transformed by what I learned from Hof and others that I felt I had no choice but to pass it on to others and, today, I work as a breathwork coach. What is breathwork? It can be described as ‘breath consciousness’ and ‘conscious breathing’. Every time we notice our breath or change our breathing pattern to achieve a specific outcome, we are practising breathwork.\n Today, breathwork is the new yoga. It can be found everywhere from therapy sessions to gym classes, but, while it’s currently in vogue, it’s far from new. It’s hard to pinpoint the first moment when humans decided to use breathing intentionally, but you can find early indications of conscious breathing in Hindu scriptures dating back hundreds of years, for instance in the  Bhagavadgita, composed sometime between the  2nd century BCE and the  2nd century CE:\n Still others, who are inclined to the process of breath restraint to remain in trance, practise by offering the movement of the outgoing breath into the incoming, and the incoming breath into the outgoing, and thus at last remain in trance, stopping all breathing. Others, curtailing the eating process, offer the outgoing breath into itself as a sacrifice.\n The Tibetan teachings of Tonpa Shenrab Miwoche that form the basis of the Bon tradition, which considers the breath to be important, are even older, dating back  18,000 years. Breathing techniques have also been used in yoga for more than  2,000 years. In fact, breathwork has been present in nearly all traditions and cultures: in mythology, philosophy, various rituals, rites of passage, healing methods, spiritual and religious practices, martial arts and meditation.\n For many people, the breath is something much more than just the purely physical movement of air. It is often described as the energy, life force, cosmic essence, the vital principle that permeates reality on all levels including inanimate objects. It is the spirit or the soul. Different cultures refer to the same phenomenon but by different names, such as:  prana,  qi,  ki,  lung,  ruach,  spiritus,  mana,  rouh and  pneuma.\n In yoga, the breath is considered not only the path of spiritual development, but also as a simple way of staying in good health. In the yogic breathing  pranayama, the practices are well described, each with its own purpose – including energising, cleansing or relaxing. For a long time, most mainstream medical practitioners had no interest in breathwork, but that began to change in the 1950s. For instance, following his research into the ways that breathing rate impacts health, Konstantin Buteyko, a Ukrainian-born doctor, created a technique for dealing with breathing disorders such as asthma, general breathlessness and rhinitis, and also as a treatment for hypertension. His method was used in hospitals across Russia. Now the ‘Buteyko method’, although it’s considered a form of alternative medicine, is used across the globe to treat breathing-pattern disorders. Overall, I believe our modern understanding of the nervous system and scientific studies are confirming that the yogic breathing practices have their intended effect. We’re rediscovering what the yogis knew a long time ago.\n These days, athletes are also taking an interest in breathwork. In sports, it’s always an arms race. Whoever finds a new way of improving by a minuscule margin can have a huge advantage over their competition. Athletes are turning to traditional yogic breath-control practices as a means for conditioning the body and strengthening the respiratory system – certain breathing exercises can improve how efficiently the body uses oxygen. Breathwork is especially pertinent to endurance sports. The Buteyko method suggests that nasal breathing and breath-flow restriction can help to raise the body’s tolerance to carbon dioxide (CO 2). Breath-holding methods have also been tested widely as a way of increasing the load on the body and creating beneficial long-term adaptations similar to altitude training.\n Yet, despite the importance of the breath and the rising popularity of breathwork, so many people never give any consideration to this fundamental aspect of life. If it weren’t for our autonomic nervous system, I bet many of us would probably die by just forgetting to breathe while reading an email. In this Guide, I will show you some basic breathwork techniques. Whether you’re an Olympic-level athlete looking to gain an edge, you’re struggling to cope with chronic anxiety or you’re just curious, you’re breathing anyway, so why not start to use your breath to your benefit? Even after having worked with so many people, the potential of breathwork – a tool that’s available to all of us – still blows my mind. It could be as simple as learning a three-minute relaxation routine, or it could be the start of a lifetime journey into self-development – either way, welcome to breathwork.\n If you’re extremely busy and don’t feel that you have much time for breathwork, but you’d like to work on your breathing to improve health and wellbeing, I suggest that you try implementing one of the most basic of principles: practise breathing through your nose rather than through your mouth. This is something that you can do throughout the whole day… and night.\n  It slows the incoming airflow, which has a calming effect on the nervous system (specifically, it activates the parasympathetic nervous system, which helps promote calm and relaxation).\n The air is travelling slower and stays longer in the alveoli, where gas exchange happens. This gives oxygen more time to diffuse in the bloodstream, which can result in  10-20 per cent greater oxygen uptake.\n  The air going into the lungs is conditioned to better suit the body – warmed up or cooled down, depending on the external environment.\n By breathing through your nose, you  expel up to  40 per cent less water (meaning you’re less prone to dehydration).\n It avoids the problems associated with long-term excessive mouth breathing, such as dental problems, inflammation of the upper airways, forward head posture and even changes in the shape of the jaw.\n What if your nose is blocked? You should try to do everything you can to unblock it. Sometimes it’s just a case of overcoming the discomfort of the feeling of a shortness of breath. You might be so used to mouth breathing that nasal breathing will feel unnatural at first. But the more you breathe through your nose, the easier it’s going to be. If you’re really struggling, nose dilators, plasters or sprays (to clear the nostrils) will help you in the early days and weeks. If you have a deviated septum (a misalignment of the bone and cartilage that separates the nostrils), which interferes with nasal breathing, you might consider speaking to your doctor about having a corrective operation.\n If your nasal passages are just lightly blocked, you can help to clear them using a simple exercise: perform a small exhale, pinch your nose and hold your breath. During the peak of your breath-hold, CO 2 and nitric oxide will accumulate, both of which are vasodilators, which will help the passages to unblock.\n When should you be breathing through your nose? A good instruction is to think about it in three phases:\n  At rest and low intensity, you can be in  phase 1 the entire time. When you start moving or even lifting heavy things, you can try to stay in this phase as long as possible. At a point where the effort becomes too hard, then move to  phase 2. If you increase the load even more, getting closer to your maximum capacity, then  phase 3 will be necessary. Once the effort decreases, you can go back to  phase 2 and 1, respectively.\n  Another basic step that you can take in life to improve your breathing is to consider your posture. It works both ways – bad posture will restrict your breathing, and disrupted breathing patterns can negatively influence your muscular system. To better manage our posture, we need to take a closer look at the diaphragm, which plays a key role in core stabilisation. It’s a big, dome-shaped muscle situated under our ribs that divides the thoracic and the abdominal cavities. When you inhale, the diaphragm moves down creating the difference in pressure in your lungs and pulling in air. When you relax, the diaphragm moves up and the air goes out. Here lies the guidance to natural breathing – the inhalation is active, drawing the air in and the exhalation is passive, as you just relax and don’t have to push the air out.\n  Lie down on your back or sit comfortably on the floor or in a chair. You can place your hands on your body for tactile feedback.\n Bring your attention to the inhale, observing your belly expanding while the air is being pulled into your lungs. While this happens, your upper chest and shoulders should remain still.\n Each exhalation is passive – just relax and the air goes out; there’s no need to push.\n  After a short while, once it becomes effortless, move your attention to the sides of the abdominal area around the lower ribs. Try to engage the lower ribs – with every inhalation they should be expanding slightly to the sides. This will be a more subtle movement than in the front.\n After spending another few minutes in this area, focus on your lower back. Imagine that, with every inhalation, the lower back is gently activated, and with every exhalation it relaxes.\n With time, you will be able to effortlessly combine these three areas (front, sides and back) so that the expansion during inhalation is felt not only in the front of the belly, but  360 degrees around your body.\n If at first you don’t feel any activation of your ribs or your lower back, don’t worry, give it some time.\n Spend a few minutes each day practising this and just breathe normally for the rest of the time. Even when you’re not focused on your breathing, with time you’ll find that it becomes fuller and more relaxed.\n Compared with shallow chest-breathing, diaphragmatic breathing has various benefits. It’s more  relaxing and it makes the process of gas exchange more efficient. The oxidative stress caused by mental or physical exhaustion can be  mitigated by diaphragmatic breathing. We often hear that breathing can improve our immune system, and there’s some truth to this. Diaphragmatic breathing helps to move the lymph (the fluid that flows through the lymphatic system), therefore moving pathogens through the lymph nodes where they can be treated with specific lymphocytes. Another benefit is the increased blood flow to the heart. Finally, if you strengthen the diaphragm as a muscle (through regular diaphragmatic breathing), you’ll increase your physical endurance.\n  With practice, breathwork can help give you a degree of control over your stress response, one of the most important superpowers you can imagine. Since your body is governed by rhythms – your nervous system picks up the steady flow of air as a cue for safety and adjusts other bodily processes accordingly – you can use this to your advantage.\n One way is via a common practice in yoga, in which we breathe in and out to a count. The aim is to find a comfortable length of the breath and, once it becomes easy, the rhythm can be slowed down. Usually, after a few minutes of rhythmic breathing, you will feel the shift to your body’s parasympathetic nervous system, the branch of the autonomic nervous system that not only helps our bodies repair and recover, but also improves our social engagement. Rhythmic breathing has also shown promise in helping to treat depression and anxiety. Here’s how to give it a go:\n Find a comfortable position, sitting or lying down. Close your eyes and breathe through your nose.\n  Slow your breath down so that you follow a pattern of inhaling for  6 seconds and exhaling for  6 seconds.\n If this is too hard, pick a shorter count such as  3 or 4 seconds in, and the same out.\n  When the  6-seconds rhythm becomes easy, you can try to extend the length to  8 seconds,  10 seconds, or even longer. Also, for a greater relaxation effect, you could try breathing out for twice as long as you breath in.\n If you spend time practising this form of breathing when all is well, you will find it more effective when you use it to calm yourself during moments of unease.\n  One of the most significant things that you can do for your mental processes is to get the right amount of oxygen into your brain and vital organs. The rate of your breath holds the key to that. What you’re looking for is slow and gentle breathing. When our breathing is fast and shallow, we’re mostly moving the air in the ‘dead space’, which is the volume of air that doesn’t take part in the gas exchange (it isn’t utilised by the body). This is why we want slow and deep breathing, which gives us a much better gas exchange.\n Carbon dioxide (CO 2) is the gas in air that triggers a faster breathing rate – we have a natural instinct to expel it from our system – so one key to slowing our breath down is to get more accustomed to CO 2. We often think of CO 2 as something negative, a by-product that we have to get rid of. However, CO 2 plays a very important role in our body as a vasodilator. It also helps to release oxygen from the blood, which is known as the Bohr effect. This is why increasing your body’s tolerance to CO 2 can be beneficial, helping your cells’ uptake of oxygen.\n When you exhale through your nose, you keep more CO 2 than when exhaling through your mouth, so practising nasal breathing as often as possible is the first step. Beyond that, to be more in control of your breath, whether you’re dealing with asthma or improving your sports performance, you should focus on improving your tolerance to CO 2. The ‘breathe light’ exercise from the Buteyko method that I mentioned earlier is perfect for this (to ensure your safety, check with your doctor before trying this exercise):\n Start in a comfortable seated position. Keep your eyes open or, if it helps you to focus more on the breath, then keep them closed.\n While breathing lightly through your nose, observe the volume of air that you’re breathing in and out.\n Start to reduce the depth of your breath by about  20-30 per cent, to the point where you start to feel a slight air hunger but not panic (your breathing rate should stay the same, at its usual resting level). If you reduce the depth of breath too much, to the point of strong discomfort, go back to normal breathing, reset and start to reduce again.\n Find a balance where you can feel a slight air hunger, but can continue breathing like this for  5-10 minutes.\n Always, when practising, make sure that your whole body is relaxed. If you’re new to breathwork, start slowly and gently, and progress only when you feel comfortable. Once you get the hang of this, you can practise this daily.\n According to the Buteyko method, as you raise your tolerance to CO 2, your breathing becomes lighter and more effortless, and your average breathing rate slows down. Practitioners also suggest that this process facilitates the release of oxygen from haemoglobin into the cells, as well as helping to improve your blood circulation. If you have an active lifestyle, it’s a great way to increase your endurance and delay the moment of fatigue.\n  In yoga, the practice of breath retention called  kumbhaka has been used for hundreds of years. Many masters have pointed to the fact that practising regular breath retention can result not only in greater health but also in enhanced stamina. Modern scientific findings are providing tentative support for this,  showing that a few breath-holds can trigger several mechanisms that help us to stay without air for longer. During breath retention, our spleen contracts, releasing blood that’s very rich in oxygen-carrying red blood cells. We also experience a release of the hormone erythropoietin, which not only further increases the red blood-cell count, but increases the efficiency of mitochondria.\n When working with active people, many times I’m asked the question: ‘How can I increase my physical performance through breathing?’ It turns out that a conscious breath-hold can be one of the most powerful tools available for this purpose. Athletic performance correlates with the amount of oxygen that can be transported and utilised, and training in breath-holding can build this capacity.\n The use of altitude training in sports to improve physical performance is based on similar principles. Being in a low-oxygen zone (or ‘hypoxia’) forces our body to adapt, so that, after returning to sea level, we can enjoy the benefits of increased performance. Breath-holding effectively simulates this kind of environment. The ‘exhale-hold’ or ‘altitude-simulation’ technique can be used to drop the oxygen saturation in your body, if only for a brief moment. As part of a training programme, even these short moments in hypoxia can build up to a meaningful advantage. Since breath retention is a complex technique, I always recommend that you should learn it with a qualified teacher. Your teacher will show you how to perform a maximum breath-hold after a light exhalation (leaving about  30-40 per cent of the air in your lungs). For safe and effective training, your teacher should use a pulse oximeter to monitor your oxygen levels.\n Breathing is one of the most important factors for our health. In all cultures, it has been used for centuries in various rituals, healing and spiritual practices. Breathing allows us to influence our autonomic nervous system and our body’s chemistry.\n Many recent breathing techniques, used therapeutically or in sports, have their origins in traditional practices such as yoga. Research supports the functionality of ancient methods.\n Paying attention to nasal breathing is a simple first step you can take that will improve your breathing habits and bring you health benefits.\n Implementing the right diaphragmatic breathing patterns is the key to improving posture and core stabilisation.\n The simplest way of reducing str\n......", "posttime": "2021-07-23 05:32:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "呼吸,breathe", "title": "如何呼吸", "title_en": "How to Breathe", "transed": 1, "url": "https://psyche.co/guides/how-to-breathe-your-way-to-better-health-and-transcendence", "via": "", "real_tags": ["呼吸", "breathe"]}, {"category": "", "categoryclass": "", "imagename": "d13df3ca5cefdd669f17aa9b345b8efe.jpg", "infoid": 1069116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是艾格尼丝·卡拉德 (Agnes Callard) 公共哲学系列专栏的一部分；在这里阅读更多。这些词存在供您阅读。我写它们是为了向你传达一些想法。这些不是我为你写的第一句话——那些更糟。我写了又重写，目的是澄清我的意思。我想确保你带走的正是我所想的，我想简洁而引人入胜，因为我注意到你的时间和注意力的竞争要求。你可能认为我说的一切都是琐碎而显而易见的，因为当然所有的写作都是这样。写作是一种交流方式；它存在以供阅读。但事实上，这并不是所有写作的运作方式。尤其是，这不是学术写作的运作方式。学术写作不是为了与读者交流而存在的。在学术界，或者至少在我所在的那部分，我们写作，大多数时候，与其说是为了被阅读，不如说是为了出版。让我通过对我自己的学术阅读习惯的忏悔来说明。虽然我喜欢阅读，并且阅读很多，但我的阅读很少来自最近的哲学期刊。我在我的专业领域阅读新文章的主要场合是当我被要求审稿或以其他方式评估它们时，当我帮助某人准备发表时，以及当我需要在我自己的论文中引用时。这会告诉你一些关于学术写作的东西，以及它是如何被裁判过程塑造的——主要是在意识层面上。一个简单的事实是，学​​术界的“成功”是期刊接受度的问题，而这反过来又会在个人简历中形成一行字。此类引用的数量与相关期刊的声望相结合，是获得、保持和提升学术工作的重要因素。 “计数”是有效词。可以计算的是将要完成的工作。在人文学科中，没有人计算是否有人阅读我们的论文。只有它们是否发布，以及在哪里发布。我观察到这些压力随着时间的推移而升级：如今，那些仅仅申请研究生院的人已经发表了一两篇论文也就不足为奇了。为了出版而写作——而不是为了被阅读——是学术界的“应试教育”。结果是很少有人真正想要阅读的论文。首先，写作是超复杂的。是的，想法也很复杂，但专业期刊上的文章经常包含一层复杂性，超出了表达观点所需的程度。它不是为了风格和可读性而编辑的。最重要的是，学术写作痴迷于其他学术写作——寻找“文献中的空白”，而不是回答一个直接有趣或重要的问题。\n当然，出版是获得读者的必要步骤，但着眼于它的学者就像高尔夫球手或棒球运动员在接触球时停止挥杆。没有跟进，你得到的是短暂的、生涩的动作；我们学者已经成为小而笨拙的想法的传播者。在对学术写作提出这些主张时，我首先想到的是我自己的学术领域——哲学——尽管我怀疑我的观点是概括性的，至少在学术人文学科上是这样。提供一个轶事：2019 年春天，我正在教乔伊斯的青年艺术家肖像；因为我通常不教文学，我想我应该看看最近关于乔伊斯的二级文学。我发现的是深奥和超复杂的，充满了术语和间接。我不觉得我在学习任何可以用来让我自己或我的学生更容易理解小说含义的东西。我愿意承担一些责任：如果我愿意花更多的精力阅读它们，我相信我可以从这些作品中得到一些东西。尽管如此，我并不缺乏理解乔伊斯分析所需的智力；我觉得所有这些作家都可以为我写更多。但是，无论我的观点是否适用于人文学科，我都会承认，我对哲学问题的紧迫性远远超过了一些被称为“人文学科”的抽象实体。我爱乔伊斯，我爱荷马，但我没有投资于当前奖学金的质量。我担心的是哲学。当我被问及哲学中“大思想”的来源时——那种会让超哲学世界站起来并引起注意的人——我很难列出 1950 年以后出生的人。考虑到前十年产生的：丹尼尔·丹尼特、索尔·克里普克、大卫·刘易斯、德里克·帕菲特、约翰·麦克道威尔、彼得·辛格、GA Cohen 和玛莎·努斯鲍姆。在我看来，这些人中的每一个都至少在我们可以判断一个哲学家的一个类别中凌驾于他们之后的每个人之上：广度、深度、独创性或公众影响的程度。或者考虑一下这个出生在大约二十年前（1919-1938 年）的群体，其智力生育能力卓越：伊丽莎白·安斯科姆、菲利帕·富特、斯坦利·卡维尔、哈里·法兰克福、伯纳德·威廉姆斯、托马斯·内格尔、罗伯特·诺齐克、理查德·罗蒂、希拉里·普特南，约翰·罗尔斯。人们经常会问这些哲学家：“为什么人们不再像这样写哲学了？”这不仅仅是关于写作风格的一点。他们的作品很吸引人——它提出了新的问题，向读者推销了这些问题的重要性，并将自己呈现为哲学的切入点。这就是为什么我们所有人都一遍又一遍地分配他们的工作，考虑到自他们那个时代以来哲学家的数量激增，这是一个惊人的事实。这不仅仅是几个特殊数字的问题。几年前，我偶然浏览了 1940 年至 1950 年间顶级期刊（伦理学）的过往期——这对世界或学术界来说都不是一个轻松的十年。我假设这些论文的质量会比现在发布的要低得多。请记住，这是一个不仅不需要发表文章才能找到工作的时代，甚至不需要获得博士学位。不需要；哲学家要少得多，而让一篇论文被期刊接受的过程也大大减少了竞争。总的来说，我认为那十年的论文在精确性、清晰度和“学术性”方面缺乏一些东西，但也更具吸引力和雄心，在语气和写作风格上更加多样化，并且写得更好。或许，一定程度的学术竞争是有益的，但近年来的激烈竞争似乎比同质化和停滞不前更能产生卓越的成果。因为“质量”最可靠的标志是熟悉程度，所以机器鼓励将创新保持在最低限度——仅在边缘，刚好足以发表。它限制了思想空间。随着时间的推移，我们在哲学研究中投入的所有努力、才能和哲学​​训练，最终会越来越少。如果我想在自己的一篇论文上取得进展，我肯定会在 2020 年获得 Ethics 的一篇论文更好的服务——我更有可能想要引用它。但如果我只是好奇地浏览一些哲学读物，我会选择那些过时的问题之一。我们今天可能会打出更多的球，但没有一个能打得更远。有些人看到了出路：他们称之为“公共哲学”。但是认为这代表了我所描述的问题的逃避是错误的。我们没有两种哲学体系，“学术哲学”和“公共哲学”。 “公共哲学”，包括你目前正在阅读的那篇文章，主要是由学术哲学家写的——也就是说，在绝大多数情况下学习并获得博士学位的人通过在公共哲学领域工作谋生。学术哲学体系。\n我不反对广泛地使用“哲学家”这个称号，包括那些在向普通听众演讲方面比我或我的任何在学术哲学范围内运作得更严格的同事更成功的公共知识分子：从Judith Butler 和 Bruno Latour 致 Slavoj Žižek、Camille Paglia 和 Steven Pinker。但是，成为“哲学家”是一回事，从某种意义上说，它是公众或其子集的知识灵感的来源，而成为哲学社区的成员又是另一回事。后一种指定要求一个人不仅要在争论上对这样的社区负有责任，而且还要求通过教育、培训和管理参与该社区的维护和自我繁殖。学术哲学是我们拥有的系统。你不能跳船，因为无处可跳。被困在阅读狭隘、无聊、深奥的论文的可悲之处不在于它们有多糟糕，而在于它们有多好。当我足够了解内部人员时，可以让作者在演讲或写作中反复提问，这种反对和回击的过程往往会暴露出驱动作品的真实而有力的思路.哲学家们并没有停止热爱知识，尽管我们必须在越来越狭窄的范围内，如果我们要生存，就必须追求它。哲学界的一些人会为这种“缩小”辩护，认为这是哲学日益科学化的标志。但是，无论哲学的某些部分变得多么科学，以下差异始终存在：与科学不同，哲学无法使不从事哲学的人受益。哲学技术——思想、论点、区别、问题——不能存在于人类思维之外。人们不需要像我碰巧那样崇拜苏格拉底，认为哲学是一门特别对话的学科。所有学术作品都会在“总有更多话要说”或“欢迎更正”的弱意义上进行回应，但哲学演讲、论文和书籍专门旨在挑衅、煽动、法庭反驳和反例。我们的任务不是从人类的盘子里解决一些问题，而是用我们寻找答案的需要感染其他人。哲学家是一种特别需要寻求真理的人。就像吸血鬼、僵尸和狼人一样，我们是需要陪伴的生物，他们会不惜一切代价创造它。没有人认为柏拉图、笛卡尔、康德和其他人在所有事情上都是正确的；尽管如此，几个世纪和几千年后，我们不仅不能停止谈论他们，而且不能停止与他们交谈，与他们交谈。他们让我们成为他们中的一员，我们需要继续付出。图片来源：“美国士兵，打字员，在有序​​的房间里工作”，维多利亚州立图书馆\n为了鼓励更多这样的哲学写作，请考虑订阅 The Point。本周使用代码 PERISH，首次订阅可享受 25% 的折扣（3 次印刷版和无限制的在线访问）。", "note_en": "This is part of a series of columns on public philosophy by Agnes Callard; read  more here.\n These words exist for you to read them. I wrote them to try to convey some ideas to you. These are not the first words I wrote for you—those were worse. I wrote and rewrote, with a view to clarifying my meaning. I want to make sure that what you take away is exactly what I have in mind, and I want to be concise and engaging, because I am mindful of competing demands on your time and attention.\n You might think that everything I am saying is trivial and obvious, because of course all writing is like this. Writing is a form of communication; it exists to be read. But that is, in fact, not how all writing works. In particular, it is not how academic writing works. Academic writing does not exist in order to communicate with a reader. In academia, or at least the part of it that I inhabit, we write, most of the time, not so much for the sake of being read as for the sake of publication.\n Let me illustrate by way of a confession regarding my own academic reading habits. Although I love to read, and read a lot, little of my reading comes from recent philosophy journals. The main occasions on which I read new articles in my areas of specialization are when I am asked to referee or otherwise assess them, when I am helping someone prepare them for publication and when I will need to cite them in my own paper.\n This tells you something about academic writing, and how deeply it is shaped—mostly not at a conscious level—by the refereeing process. The simple fact is that “success” in academia is a matter of journal-acceptance, which in turn makes for a line in one’s CV. The number of such citations, taken together with the prestige of the relevant journals, is what counts for getting, keeping and being promoted in an academic job.\n “Counts” being the operative word. What can be counted is what will get done. In the humanities, no one counts whether anyone  reads our papers. Only whether they are published, and where. I have observed these pressures escalate over time: nowadays it is unsurprising when those merely applying to graduate schools have already published a paper or two.\n Writing for the sake of publication—instead of for the sake of being read—is academia’s version of “teaching to the test.” The result is papers few actually want to read. First, the writing is hypercomplex. Yes, the thinking is also complex, but the writing in professional journals regularly contains a layer of complexity beyond what is needed to make the point. It is not edited for style and readability. Most significantly of all, academic writing is obsessed with other academic writing—with finding a “gap in the literature” as opposed to answering a straightforwardly interesting or important question.\n Of course publication is a necessary step along the way to readership, but the academic who sets their sights on it is like the golfer or baseball player who stops their swing when they make contact with the ball. Without follow-through, what you get are short, jerky movements; we academics have become purveyors of small, awkwardly phrased ideas.\n  In making these claims about academic writing, I am thinking in the first instance of my own corner of academia—philosophy—though I suspect that my points generalize, at least over the academic humanities. To offer up one anecdote: in spring 2019 I was teaching Joyce’s  Portrait of the Artist as a Young Man; since I don’t usually teach literature, I thought I should check out recent secondary literature on Joyce. What I found was abstruse and hypercomplex, laden with terminology and indirect. I didn’t feel I was learning anything I could use to make the meaning of the novel more accessible to myself or to my students. I am willing to take some of the blame here: I am sure I could have gotten something out of those pieces if I had been willing to put more effort into reading them. Still, I do not lack the intellectual competence required to understand analyses of Joyce; I feel all of those writers could have done more to write for me.\n But whether my points generalize across the humanities or not, I will confess that I feel the urgency of the problem for philosophy much more than for some abstract entity called “the humanities.” I love Joyce, I love Homer, but I am not invested in the quality of current scholarship on either. It’s philosophy that I worry about.\n When I am asked for sources of “big ideas” in philosophy—the kind that would get the extra-philosophical world to stand up and take notice—I struggle to list anyone born after 1950. It is sobering to consider that the previous decade produced: Daniel Dennett, Saul Kripke, David Lewis, Derek Parfit, John McDowell, Peter Singer, G. A. Cohen and Martha Nussbaum. In my view, each of these people towers over everyone who comes after them in at least one of the categories by which we might judge a philosopher: breadth, depth, originality or degree of public influence. Or consider this group, born in roughly the two decades prior (1919-1938), remarkable in its intellectual fertility: Elizabeth Anscombe, Philippa Foot, Stanley Cavell, Harry Frankfurt, Bernard Williams, Thomas Nagel, Robert Nozick, Richard Rorty, Hilary Putnam, John Rawls. These are the philosophers about whom one routinely asks, “Why don’t people write philosophy like this anymore?” And this isn’t only a point about writing style. Their work is inviting—it asks new questions, it sells the reader on why those questions matter and it presents itself as a point of entry into philosophy. This is why all of us keep assigning their work over and over again, a striking fact given how much the number of philosophers has ballooned since their time.\n And it’s not just a matter of a few exceptional figures. A few years ago, I happened to browse through back issues of a top journal ( Ethics) from 1940-1950—not an easy decade for the world, or academia. I went in assuming those papers would be of much lower quality than what is being put out now. Keep in mind, this is a time when not only was publication not required for getting a job, even a Ph.D. was not required; there were far fewer philosophers, and getting a paper accepted at a journal was a vastly less competitive process.\n In general, I would describe the papers from that decade as lacking something in terms of precision, clarity and “scholarliness,” but also as being more engaging and ambitious, more heterogeneous in tone and writing style, and better written. Perhaps some amount of academic competition is salutary, but the all-consuming competition of recent years, it appears, has been less productive of excellence than of homogeneity and stagnation. Because the most reliable mark of “quality” is familiarity, the machine incentivizes keeping innovation to a minimum—only at the margin, just enough to get published. It constricts the space of thought. Over time, we end up with less and less to show for all the effort, talent and philosophical training we are throwing into philosophical research. If I wanted to make progress on one of my own papers, I’d certainly be better served with a paper from  Ethics in 2020—I’m much more likely to want to cite it. But if I were just curiously browsing for some philosophical reading, I’d go for one of those back issues. We might be hitting more balls today, but none of them is going far.\n Some see a way out: they call it “public philosophy.” But it is a mistake to think that this represents an escape from the problem I am describing. We do not have two systems for doing philosophy, “academic philosophy” and “public philosophy.” “Public philosophy,” including the piece of it you are currently reading, is written mostly by academic philosophers—which is to say, people who studied, received Ph.D.s at and in the vast majority of cases make a living by working within the academic philosophy system.\n I have no objection to applying the title “philosopher” broadly, including to those public intellectuals who have had so much more success in speaking to a general audience than I or any of my colleagues who operate more strictly within the confines of academic philosophy: from Judith Butler and Bruno Latour to Slavoj Žižek, Camille Paglia and Steven Pinker. But it is one thing to be a “philosopher” in the sense of being a source of intellectual inspiration to the public, or a subset thereof, and another to be a member of a philosophical community. The latter designation requires a person not only to be beholden to such a community argumentatively, but also calls for participation in the maintenance and self-reproduction of that community through education, training and management. Academic philosophy is the system we have. You can’t jump ship, because there’s nowhere to jump.\n  The sad thing about being stuck reading narrow, boring, abstruse papers is not how bad they are, but how good they are. When I am enough of an insider to be in a position to engage the writer in back-and-forth questioning, either in speech or in writing, that process of objection and pushback tends to expose a real and powerful line of thought driving the piece. Philosophers haven’t stopped loving knowledge, despite the increasingly narrow confines within which we must, if we are to survive, pursue it.\n Some in the philosophical community will defend this “narrowing” as a sign of the increasingly scientific character of philosophy. But no matter how scientific some parts of philosophy become, the following difference will always remain: unlike science, philosophy cannot benefit those who don’t engage in it. Philosophical technology—ideas, arguments, distinctions, questions—cannot live outside the human mind.\n One doesn’t need to idolize Socrates, as I happen to, to think that philosophy is an especially dialogical discipline. All academic work invites response in the weak sense of “there is always more to be said,” or “corrections welcome,” but philosophical talks, papers and books specifically aim to provoke, to incite, to court pushback and counterexample. Our task is not to take some questions off humanity’s plate, but to infect others with our need to find answers.\n The philosopher is an especially needy kind of truth-seeker. Like vampires, zombies and werewolves, we are creatures who need company, and who will do whatever it takes to create it.\n No one thinks that Plato, Descartes, Kant and the rest were right about everything; nonetheless, centuries and millennia later, we cannot stop talking not just about them, but to them, with them. They made us into one of them, and we need to keep paying that forward.\n Photo credit: “American soldiers, typists, at work in the Orderly Room,”  State Library of Victoria\n In the interest of encouraging more philosophical writing like this, consider  subscribing to The Point.  Use the code  PERISH this week for  25% off your first subscription (with 3 print issues and unlimited online access).", "posttime": "2021-07-23 05:32:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,出版,publish,哲学", "title": "出版与灭亡 (2020)", "title_en": "Publish and Perish (2020)", "transed": 1, "url": "https://thepointmag.com/examined-life/publish-and-perish-agnes-callard/", "via": "", "real_tags": ["2020", "出版", "publish", "哲学"]}, {"category": "", "categoryclass": "", "imagename": "bb047aa65cefa6d990c44747634b27b3.png", "infoid": 1069115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与旧的 Windows 10 相比，Windows 11 包含一些非常显着的视觉变化。 安装 Windows 11 预览版（目前在 Windows Insider 程序中可用）后，您会立即注意到一个新的居中任务栏、全新的“开始”菜单，以及其他视觉改进。像往常一样，新操作系统带来了新功能并删除了一些以前可用的功能。 Microsoft 已经发布了 Windows 11 中已删除和弃用的功能列表，但事实证明，还有一些更多未宣布且非常奇怪的更改。用户注意到 Windows 11 中的任务栏不再支持拖放。在 Windows 10 中，您可以通过将文件拖到任务栏上的应用程序来打开文件。此外，相同的逻辑适用于固定应用程序快捷方式。在 Windows 11 中似乎这些都不起作用。在 Windows 11 中任何拖放文件或任务栏快捷方式的尝试最终都会在光标附近出现一个停止图标。虽然有些人认为无法将对象拖放到 Windows 11 中的任务栏是一个错误，但微软确认这一更改是有意的。在反馈中心，一位微软代表表示 Windows 11 目前不支持拖放，但该公司“感谢用户的反馈”。在 Windows 11 中，任务栏失去了用户在 Windows 10 中喜欢的其他一些非常受欢迎的功能。例如，您不能再将任务栏移到顶部、右侧或左侧。 Windows Timeline 也不见了，但可以肯定地说，很少有用户会错过该功能。很难说微软为什么要在 Windows 11 中删除任务栏的拖放功能。如果这个有争议的更改让您以及其他成千上万的内部人员感到沮丧，请务必将您的反馈发送给 Microsoft。", "note_en": "Windows 11 contains some quite drastic and visual changes compared to the good-old Windows 10. After installing Windows 11 preview builds, which are currently available in the Windows Insider program, you will notice right away a new  centered taskbar, brand-new Start menu, and other visual refinements.     As usual, a new operating system brings new features and removes some of the previously available ones. Microsoft has already published a list of removed and deprecated features in Windows 11, but as it turns out, there are some more unannounced and quite weird changes. Users noticed that the taskbar in Windows 11 no longer supports drag and drop. In Windows 10, you can open a file by dragging it onto an app on the taskbar. Also, the same logic works with pinning app shortcuts. It appears none of that works in Windows 11. Any attempt to drag and drop a file or a shortcut to the taskbar in Windows 11 ends up with a stop icon appearing near the cursor. While some think that inability to drag and drop an object to the taskbar in Windows 11 is a bug, Microsoft confirmed the change is intentional. On Feedback Hub, a Microsoft representative said Windows 11 currently does not support drag and drop, but the company &#34;appreciates users feedback.&#34; In Windows 11, the taskbar lost some other quite popular features users enjoyed in Windows 10. For example, you can no longer move the taskbar to the top, right, or left. Windows Timeline is gone too, but it is safe to say very few users will miss that feature. It is hard to tell why Microsoft would want to remove drag and drop for the taskbar in Windows 11. If this controversial change frustrates you, as well as thousands of other insiders, make sure to send your feedback to Microsoft.", "posttime": "2021-07-23 05:31:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,microsoft,windows,确认,confirms", "title": "微软确认 Windows 11 中的任务栏不再支持拖放", "title_en": "Microsoft confirms taskbar in Windows 11 no longer supports drag and drop", "transed": 1, "url": "https://winaero.com/microsoft-confirms-taskbar-in-windows-11-no-longer-supports-drag-and-drop/", "via": "", "real_tags": ["微软", "microsoft", "windows", "确认", "confirms"]}, {"category": "", "categoryclass": "", "imagename": "3fb7748b37034093b8de83d9255557ba.png", "infoid": 1069114, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "王说，就像处于巅峰状态的职业运动员仍然需要指导一样，高管们也需要外部验证和评论他们的表现和表现。这些见解对于高管们来说可能很难自己理解，并且可能需要一定程度的诚实，而这对于 CEO 期望从与公司有关的任何人那里得到的都是具有挑战性的。罗杰·费德勒——这位赢得 20 次大满贯赛事的著名网球运动员——他有一位教练，但他不仅仅是一位教练，他还有一位网球教练。我很确定罗杰知道比赛规则以及他需要击球的所有不同击球方式，那他为什么要找教练呢？答案实际上是关于拥有第二双眼睛；当您处于当下时……很难看到自己并评估自己。 （时间戳：4:52）一个很好的例子——你可能在一次董事会会议上，你的一名董事会成员批评你的营销副总裁，一种思考方式是“哦，好吧，这里有一些事情我们需要为这个人解决问题，”但是教练可能会让你大开眼界的另一种观点，实际上可能这个人认为你没有雇用合适的人。 （时间戳：8:59）虽然顾问可以帮助初创公司驾驭战术情况，但治疗师可能更专注于帮助客户驾驭情绪状态并改善自己。王说，教练存在于创业顾问和有执照的治疗师之间的一个非常模糊的灰色地带，但教练更侧重于提高自己作为商业领袖的能力，而不是解决一个特别棘手的创业问题。", "note_en": "Just like professional athletes at the top of their game still need coaching, executives can need external validation and comment on where they are and aren’t delivering, Wang says. These insights can be tough for executives to catch on their own and might require a level of honesty that can be challenging for a CEO to expect from anyone involved with their company.\n Roger Federer — the famous tennis player who has won 20 Grand Slam events — he has a coach, but he doesn’t just have a coach, he has a coach for tennis. I’m pretty sure Roger knows the rules of the game and all the different strokes he needs to hit, so why would he have a coach? The answer is really that it’s about having a second set of eyes; when you’re in the moment … it’s hard to be able to see yourself and assess yourself.   (Timestamp: 4:52)\n  A good example — you might be at a board meeting and one of your board members is being critical of your VP of marketing, and one way to think of that is “Oh, OK, here are some things we need to solve for this person,” but another point of view that a coach might open your eyes to, is actually maybe this person thinks you’re not hiring the right people.   (Timestamp: 8:59)\n While advisers can help startups navigate tactical situations, therapists may be more focused on helping clients navigate emotional states and improve themselves. Coaching exists in a very nebulous gray area between startup advisers and licensed therapists, Wang says, but coaching is more focused on improving yourself as a business leader rather than solving a particularly vexing startup issue.", "posttime": "2021-07-23 04:57:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ventures,教练", "title": "Cowboy Ventures 的 Ted Wang：CEO 教练是“拥有第二双眼睛”", "title_en": "\n\t\t\t\tCowboy Ventures’ Ted Wang: CEO coaching is ‘about having a second set of eyes’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/cowboy-ventures-ted-wang-ceo-coaching-is-about-having-a-second-set-of-eyes/", "via": "", "real_tags": ["ventures", "教练"]}]