[{"category": "", "categoryclass": "", "imagename": "3cd425f1a70d099254391121bde6d652.jpg", "infoid": 1069924, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿——蓝色起源创始人杰夫贝索斯表示，如果美国宇航局授予它第二份载人着陆系统（HLS）合同，他的公司将承担超过 20 亿美元的成本。贝索斯在 7 月 26 日致美国宇航局局长比尔纳尔逊的一封信中表示，如果美国宇航局授予该公司 HLS 奖励，该公司将在新奖项的头几年免除高达 20 亿美元的付款，并支付演示任务的费用。 SpaceX 在 4 月份收到的用于开发和演示载人登月着陆器。贝索斯在信中写道：“我们随时准备帮助 NASA 降低其技术风险并解决其预算限制，并使 Artemis 计划重新走上更具竞争力、可信度和可持续发展的道路。”贝索斯在提案中表示，Blue Origin 将免除本财年和下两个财年的任何付款，最高可达 20 亿美元。 “这个提议不是延期，而是彻底和永久地放弃这些付款，”他写道。 “这项提议为政府拨款行动提供了时间来迎头赶上。” Blue Origin 还将自费执行“探路者任务到月球下降元件的低地球轨道，以进一步退出开发和安排风险。”这将是对无人登月演示的补充，该公司称这是其开发月球着陆器系统“基线计划”的一部分。 Bezos 补充说，Blue Origin 将接受一份固定价格的工作合同，这是 NASA 对 HLS 已经要求的。这封信是让 NASA 授予第二份 HLS 合同的最新提议，这是该机构最初计划的。然而，由于预算限制，它在 4 月宣布将向 SpaceX 颁发单一的 HLS 奖项。 SpaceX 的出价最低，为 29 亿美元，而蓝色起源领导的“国家队”为 59.9 亿美元，第三位竞标者 Dynetics 为 85-9 亿美元。\nBlue Origin 的官员抱怨说，与 SpaceX 不同，他们在 HLS 竞赛期间没有得到修改价格的机会，贝索斯在他的信中重申了这一论点。 “那是一个错误，这是不寻常的，而且是一个错失的机会，”他说。 “由于近期预算问题，美国宇航局改变了其最初的双源采购战略，而这一提议消除了这一障碍。” NASA 官员在 4 月份表示，由于可用资金有限，他们没有进行谈判。 “我什至没有足够的资金来尝试与 Blue Origin 谈判一个可能会授予合同的价格，”美国宇航局人类探索和运营副局长凯西·卢德斯在来源选择声明中写道，她概述了她选择的理由只有SpaceX。 Blue Origin 和 Dynetics 均就 HLS 奖项向政府问责局提出抗议。 GAO 有一个 8 月 4 日的最后期限来裁决抗议活动。机构官员拒绝讨论有关其 HLS 计划的细节，理由是抗议活动造成了“停电”。尼尔森在 7 月 21 日华盛顿邮报的网络研讨会上说：“由于存在争议，与 SpaceX 的合同现在被搁置。” “我们期待在接下来的几周内发布公告，在此基础上，我们将继续进行。”纳尔逊游说国会提供额外资金，以便无论 GAO 抗议的结果如何，都能支持第二家 HLS 提供商。他在网络研讨会上说：“我们需要更多的钱来加强和促成这种竞争，以便有其他参与者参与进来。”他此前曾告诉国会拨款者，NASA 将需要 54 亿美元的额外资金来支持第二家 HLS 提供商，这表明这笔资金可以包含在单独的就业和基础设施资金计划中。然而，没有迹象表明此类资金会被包括在内，众议院版本的 2022 财年支出法案为 HLS 提供了 13.45 亿美元，仅比该机构的要求高出 1.5 亿美元。", "note_en": "WASHINGTON — Blue Origin founder Jeff Bezos says his company will cover more than $2 billion in costs if NASA will award it a second Human Landing System (HLS) contract.\n In  a July 26 letter to NASA Administrator Bill Nelson, Bezos said the company would waive up to $2 billion in payments in the first years of a new award, as well as pay for a demonstration mission, should NASA give the company an HLS award like the one SpaceX received in April to develop and demonstrate a crewed lunar lander.\n “We stand ready to help NASA moderate its technical risks and solve its budgetary constraints and put the Artemis Program back on a more competitive, credible, and sustainable path,” Bezos wrote in the letter.\n  In his proposal, Bezos said that Blue Origin will waive any payments both in the current fiscal year as well as the next two, up to $2 billion. “This offer is not a deferral, but is an outright and permanent waiver of those payments,” he wrote. “This offer provides time for government appropriation actions to catch up.”\n Blue Origin would also carry out at its own expense “a pathfinder mission to low-Earth orbit of the lunar descent element to further retire development and schedule risks.” That would be in addition to an uncrewed lunar landing demonstration that the company says was part of its “baseline plan” for developing the lunar lander system.\n Bezos added that Blue Origin would accept a firm-fixed-price contract for the work, something that NASA had already required for HLS.\n The letter is the latest bid to get NASA to award a second HLS contract, something the agency had originally planned. However, in April  it announced it was making a single HLS award to SpaceX because of budget constraints. SpaceX offered the lowest bid at $2.9 billion, compared to $5.99 billion by the Blue Origin-led “National Team” and $8.5–9 billion by Dynetics, the third bidder.\n Blue Origin officials complained that, unlike SpaceX, they were not given a change to revise their price during the HLS competition, an argument Bezos reiterated in his letter. “That was a mistake, it was unusual, and it was a missed opportunity,” he said. “NASA veered from its original dual-source acquisition strategy due to perceived near-term budgetary issues, and this offer removes that obstacle.”\n NASA officials said in April they did not negotiate because of the limited funding it had available. “I do not have enough funding available to even attempt to negotiate a price from Blue Origin that could potentially enable a contract award,” Kathy Lueders, NASA associate administrator for human exploration and operations, wrote in the source selection statement outlining her rationale for selecting only SpaceX.\n Both Blue Origin and Dynetics filed protests with the Government Accountability Office regarding the HLS awards. The GAO has an Aug. 4 deadline to rule on the protests.\n Agency officials have declined to discuss details about its HLS plans, citing a “blackout” imposed by the protest. “The contract to SpaceX is held in abeyance right now as it is contested,” Nelson said in a July 21 webinar by  The Washington Post. “We’re expecting an announcement in the next few weeks and, on the basis of that, we will then proceed.”\n Nelson has lobbied Congress for additional funding to be able to support a second HLS provider regardless of the outcome of the GAO protests. “We need some more money to enhance and procure that competition so that there are other players that get involved,” he said in the webinar.\n He previously told congressional appropriators that  NASA would need $5.4 billion in additional funding to support a second HLS provider, suggesting that money could be included in a separate jobs and infrastructure funding package. However, there’s been no sign that such funding would be included, and  a House version of a fiscal year 2022 spending bill provided $1.345 billion for HLS, just $150 million above the agency’s request.", "posttime": "2021-07-27 08:39:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,offers,hls", "title": "贝索斯为 NASA 登月器合同提供数十亿美元的奖励", "title_en": "Bezos offers billions in incentives for NASA lunar lander contract", "transed": 1, "url": "https://spacenews.com/bezos-offers-billions-in-incentives-for-nasa-lunar-lander-contract/", "via": "", "real_tags": ["nasa", "offers", "hls"]}, {"category": "", "categoryclass": "", "imagename": "8cca25e24d65ff3ed98fafee780bd0b8.jpeg", "infoid": 1069923, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "未接种疫苗的人群中持续出现的 COVID-19 激增正在推动美国采取更多疫苗强制措施、重新使用口罩和其他缓解措施。由于该国约有 51% 的地区未完全接种疫苗，而且超传染性三角洲变异体迅速传播，该国的大流行前景严峻且越来越严峻。所有 50 个州的病例仍在增加，过去两周增加了 170%，病例增加的速度也在加快。 COVID-19 在疫苗接种率相对较低的地方蓬勃发展。阿肯色州和路易斯安那州的新病例率最高，这两个州只有 36% 的居民接种了疫苗。佛罗里达州、密苏里州和密西西比州的未接种疫苗人数也在激增。全国因 COVID-19 住院的人数增加了 58%，其中 97% 的患者未接种疫苗。全国范围内的死亡人数也在增加，增加了 20%，而且几乎完全是在未接种疫苗的人群中。在周日的 Face the Nation 采访中，前外科医生杰罗姆·亚当斯 (Jerome Adams) 强调，激增以及随后试图遏制这种激增的缓解措施是个人决定不接种 COVID-19 疫苗的结果。 “更多的缓解措施即将到来，”亚当斯警告说，“无论是掩饰还是关闭，或者是你的孩子不得不返回虚拟学习，这都会到来。它即将到来是因为这种流行病再次失控，而且它是因为我们没有足够的人接种疫苗，所以变得失控。”他鼓励人们接种疫苗以保护自己和周围的人，并“帮助每个美国人享受我们想要恢复的自由。”亚当斯的预测很快得到了验证。周日，顶级传染病专家安东尼·福奇告诉美国有线电视新闻网，正在“积极考虑”对联邦口罩指南的修订。然而，当前的激增已经刺激了一些地方（例如洛杉矶）对口罩的新需求。在delta蔓延的情况下，一些专家甚至建议升级到N95口罩。\n与此同时，周一出现了源源不断的新疫苗指令，以应对激增的情况。美国医学会加入了 50 多个其他医疗保健组织，以支持医疗工作者的 COVID-19 疫苗接种任务。 “由于最近 COVID-19 激增以及安全有效疫苗的可用性，我们的医疗保健组织和社会提倡所有医疗保健和长期护理雇主要求其员工接种 COVID-19 疫苗，”联合声明开始了。 AMA 前任主席苏珊·贝利 (Susan Bailey) 在一份声明中补充说：“为了我们患者和同事的安全，所有医疗保健人员都必须接种 COVID-19 疫苗，这一点至关重要。” “在美国接种了超过 3 亿剂疫苗，在全球接种了近 40 亿剂，我们知道这些疫苗在预防 COVID-19 引起的严重疾病和死亡方面是安全且高效的。”与此同时，退伍军人事务部周一宣布，已要求其所有前线卫生工作者接种 COVID-19 疫苗，使其成为第一个这样做的联邦机构。在纽约市，市长比尔·德布拉西奥 (Bill de Blasio) 宣布，所有市政府雇员都需要接种疫苗或接受每周一次的 COVID 检测。同样，在加利福尼亚州，州政府雇员和医护人员也需要接种疫苗或定期接受检测，州长加文·纽瑟姆宣布。同样在周一，代表数百家企业的旧金山酒吧老板联盟宣布，从 7 月 29 日星期四开始，企业将要求室内顾客提供疫苗接种证明或过去 72 小时的 COVID-19 阴性检测结果.", "note_en": "The ongoing COVID-19 surge among unvaccinated people is pushing the US toward more vaccine mandates, renewed mask use, and other mitigation efforts.\n With around 51 percent of the country not fully vaccinated and the hypertransmissible delta variant spreading rapidly, the country&#39;s pandemic outlook is grim and getting grimmer. Cases are still increasing in all 50 states and  up 170 percent in the last two weeks, with the pace of case increases also  accelerating.\n COVID-19 is thriving in places with relatively low vaccination rates. Arkansas and Louisiana have the highest rates of new cases, and both states have only 36 percent of their residents vaccinated. Florida, Missouri, and Mississippi are also seeing surges among the unvaccinated.\n Hospitalizations for COVID-19 are up 58 percent across the nation, and 97 percent of those patients are unvaccinated. Deaths are also increasing nationwide, up 20 percent, and almost exclusively among unvaccinated people.\n In  an interview Sunday on  Face the Nation, former Surgeon General Jerome Adams underscored that the surge—and the subsequent mitigation efforts to try to tamp it down—is the consequence of individuals&#39; decisions to not get vaccinated against COVID-19.\n &#34;More mitigation is coming,&#34; Adams warned, &#34;whether it&#39;s masking or whether it&#39;s closures or whether it&#39;s your kids having to return to virtual learning, that is coming. And it&#39;s coming because this pandemic is spiraling out of control yet again, and it&#39;s spiraling out of control because we don&#39;t have enough people vaccinated.&#34; He encouraged people to get vaccinated to protect themselves, those around them, and also &#34;help every single American enjoy the freedoms that we want to return to.&#34;\n     Adams&#39; forecast was swiftly validated. On Sunday, top infectious disease expert Anthony Fauci told CNN that revisions to the federal masking guidelines are under &#34; active consideration.&#34; The current surge has already spurred renewed mask requirements in some places, such as  Los Angeles, however. And some experts have even  recommended upgrading to N95 masks amid the spread of delta.\n Meanwhile, Monday saw a steady stream of new vaccine mandates in response to the surge.  The American Medical Association joined more than 50 other health care organizations to support COVID-19 vaccination mandates for healthcare workers.\n &#34;Due to the recent COVID-19 surge and the availability of safe and effective vaccines, our health care organizations and societies advocate that all health care and long-term care employers require their workers to receive the COVID-19 vaccine,&#34; the joint statement started.\n “It is critical that all people in the health care workforce get vaccinated against COVID-19 for the safety of our patients and our colleagues,” Susan Bailey, immediate past president of the AMA, added in a statement. “With more than 300 million doses administered in the United States and nearly 4 billion doses administered worldwide, we know the vaccines are safe and highly effective at preventing severe illness and death from COVID-19.”\n Meanwhile, the  Department of Veterans Affairs on Monday announced that is has mandated that all of its frontline health workers be vaccinated against COVID-19, making it is the first federal agency to do so. In  New York City, Mayor Bill de Blasio announced that all city government employees would need to be vaccinated or submit to weekly COVID testing. Likewise, in  California, state employees and healthcare workers will also need to get vaccinated or regularly submit to testing, Gov. Gavin Newsom announced.\n Also on Monday,  the San Francisco Bar Owner Alliance, which represents hundreds of businesses, announced that, starting Thursday, July 29, establishments will require indoor customers to provide proof of vaccination or a negative COVID-19 test result from the past 72-hours.", "posttime": "2021-07-27 08:02:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,口罩,surge,疫苗", "title": "未接种疫苗的 COVID 激增正在推动美国采取更多的强制措施、口罩、缓解措施", "title_en": "COVID surge in unvaccinated is pushing US to more mandates, masks, mitigation", "transed": 1, "url": "https://arstechnica.com/science/2021/07/covid-surge-in-unvaccinated-is-pushing-us-to-more-mandates-masks-mitigation/", "via": "", "real_tags": ["美国", "口罩", "surge", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "869f839d9a599d54d129842848f70fbe.jpg", "infoid": 1069922, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“W3C 不会成为任何人的老板，决定将由每个浏览器做出”谷歌更新了引入“隐私沙盒”浏览器技术和逐步淘汰第三方的时间表饼干。新的时间表将隐私沙盒中的技术包分为五个阶段：讨论、测试、在 Chrome 中实施（称为“准备采用”）、过渡状态 1，在此期间 Chrome 将“监控采用和反馈”，然后是下一个阶段涉及在“2023 年末”结束的三个月内逐渐减少对第三方 cookie 的支持的阶段。尽管“2023 年末”听起来可能还有很长的路要走，但时间表显示，有争议的 FLoC（队列联合学习）的“讨论”计划在 2021 年第三季度结束——只有几个月的时间——以及对 First Party Sets 被 W3C 技术架构组拒绝，因为它“对当前形式的网络有害”，计划于 11 月中旬左右结束。谷歌表示，“扩展的讨论和测试阶段通常会产生更好、更完整的解决方案，测试和准备采用用例的时间表可能会相应改变”，因此日期并不是一成不变的。没有任何建议会被撤回的建议；该公司似乎相信它可以通过调整而不是放弃其建议来缓解担忧。 W3C 网络孵化器社区组 (WICG) 将讨论各个部分，但在上周的 FLEDGE WICG 电话会议上，Google 隐私沙盒技术负责人 Michael Kleber 表示 W3C 不会决定哪些技术实施，至少在 FLEDGE（以前称为 TURTLEDOVE）的背景下，它可以以比今天更私密的方式拍卖个性化广告。 FLEDGE 正在与微软设计的 PARAKEET 和 MaCAW 争夺注意力。在被广告技术公司 Xandr 的员工系统架构师 Julien Delhommeau 询问，如果 WICG 会在是否采用 FLEDGE 或 PARAKEET/MaCAW 方面有发言权，Kleber 说：“W3C 不会成为任何人的老板，决定将在每个浏览器上制作。目标不是让一个赢家，其他所有人都输——W3C 的目标是提出一堆想法，了解每个想法的积极性，并得出一个幻想具有最必要的功能。从长远来看，每个浏览器似乎都希望融合，因此弄清楚如何实现融合很重要。”\n谷歌隐私沙盒的目的是减少用户跟踪，同时仍然使广告技术行业能够向用户展示定制的广告。 “网站如何通过让第三方展示广告和衡量广告效果来资助内容——但不允许个人用户被分析？”谷歌开发者倡导者 Sam Dutton 问道。该公司辩称，从网络广告中去除个性化会大大减少广告收入。它运行自己的测试，为自己的广告管理系统禁用随机选择的用户的第三方 cookie（跟踪网络上的用户）。 “我们观察到，对于全球 500 强出版商，治疗组的平均收入下降了 52%，每个出版商的平均收入下降了 64%，”谷歌报告说。因此涉及大笔资金，以及围绕网络影响力集中在少数大公司手中等问题的细微差别，尤其是谷歌。据 Kleber 说，当被问及是否可以从网络中删除个性化广告时，他说：“虽然世界上大多数网站在你所倡导的替代方案中会损失 50-70% 的收入，但谷歌不是一个其中。”他提出这一说法的基础是“谷歌的大部分收入来自谷歌搜索上出现的广告”，这些广告不需要跟踪技术。正如我们在此指出的，除了苹果之外，在这场辩论中，谷歌和广告技术行业的声音比隐私倡导者的声音更大。 ® 由于电力法规，戴尔不会将高耗能的 PC 运送到加利福尼亚和美国其他五个州\n戴尔不再向美国的某些州运送高耗能的游戏 PC，因为它们需要的能源超出当地标准允许的范围。例如，寻求从戴尔网站购买 Alienware Aurora Ryzen Edition R10 游戏台式机并将其运送到加利福尼亚的客户现在会收到一条消息，告诉买家他们运气不好。该网站称：“由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗规定，该产品不能运往这些州。” “任何发往这些州的订单都将被取消。”继续阅读您也可以成为 Windows 域控制器并为所欲为，使用这个奇怪的 WONTFIX 技巧，微软本月完成了一个漏洞帽子戏法，因为在其操作系统中发现了另一个安全漏洞。而这个甚至不需要身份验证来发挥它的魔力。可以使用命名奇妙的 PetitPotam 技术来利用安全性缺陷。它涉及滥用 Redmond 的 MS-EFSRPC（加密文件系统远程协议）来接管企业 Windows 网络。对于渗透测试人员和在 Windows 网络中站稳脚跟的歹徒来说，它似乎是理想的选择。\n具体来说，安全研究员 Gilles Lionel 发现可以使用 MS-EFSRPC 强制设备（包括 Windows 域控制器）通过远程攻击者控制的 NTLM 中继进行身份验证。最终结果是一个身份验证证书，授予攻击者域控制器级别的服务访问权限，允许他们征用整个域。继续阅读还记得 Zen Internet 告诉他联系他的议员关于垃圾服务的家伙吗？是的，它仍然没有修复来自萨里莱瑟黑德的宽带客户，在他的 ISP 未能解决重复的线路断开问题后，他被告知“与您的 MP 交谈”，现在他被告知在 Openreach 未能解决问题后，他可以离开合同而不受处罚问题。罗素集团大学的网络经理艾伦·布朗 (Alan Brown) 于 2 月与我们取得联系，他对他所经历的糟糕服务以及从他的 ISP、位于罗奇代尔的 Zen Internet 和 Openreach 工程师那里收到的相互矛盾的信息感到恼火。仅在一天，他就告诉我们，他的服役中断次数不少于 28 次。继续阅读\n新发布的数据表明，由于 COVID-19，韩国正在经历硅片和方便面的复兴。该国南部的出口表现出色，7 月前 20 天的日均值同比增长 32.8%。韩国海关总署公布的数据显示，半导体同比增长 33.9%，无线通信同比增长 68.1%，工业精密设备同比增长 15.1%。与此同时，计算机外围设备的数字下降了 7.8%。考虑到去年在全球范围内出现的与大流行相关的供应问题，尤其是半导体行业的供应问题，对许多人来说，增加是个好消息。继续阅读英国软件许可经销商 ValueLicensing 在指责美国巨头违反英国和欧盟竞争法后，对微软进行 2.7 亿英镑的法律摊牌的第一部分的审判日期。这家英国公司今天在一份声明中宣布，高等法院将于 2022 年 3 月 30 日至 31 日举行关于微软试图取消 ValueLicensing 案件的听证会。 ValueLicensing 的创始人兼总经理 Jon Horley 表示：“这项高等法院的索赔涵盖了微软滥用其市场支配地位对我们业务造成的损害，有效地摧毁了桌面产品的二手软件市场。我们并不是唯一的受害者。自 2016 年以来，由于微软的反竞争活动而遭受损失。”\n继续阅读正在考虑升级到 Debian Bullseye？注意 Exim 和任何使用 Python 2.x 的变化 Debian 项目已将 Debian 11（也称为 Bullseye）的发布日期设置为 8 月 14 日。 Debian 本身就是一个重要的发行版，但也有影响力，因为它是许多其他发行版的基础，包括 Ubuntu、Mint、Devuan、Knoppix、Tails、Raspbian、Pop!_OS、SteamOS 等。在开发者公告邮件列表的帖子中，发布团队表示：“我们计划于 2021 年 8 月 14 日发布。”自 Debian 10 “Buster”于 2019 年 7 月 6 日发布以来已经过去了两年多。除了“紧急错误修复”之外，测试版本现在“完全冻结”。继续阅读 简而言之，Deepmind 和欧洲生物信息学研究所发布了一个数据库，其中包含由该公司的 AI 模型 AlphaFold 预测的 350,000 多个 3D 蛋白质结构。\n该数据涵盖了人体内 20,000 种左右的蛋白质，可供任何人研究。我们被告知，从斑马鱼到大肠杆菌等 20 种其他生物的蛋白质组也在其中，随着时间的推移，还会增加数亿个结构。 DeepMind 的首席执行官 Demis Hassabis 表示：“在世界各地的科学家手中，这种新的蛋白质年鉴将促进和加速研究，从而促进我们对这些生命组成部分的理解。”他希望它将成为一种宝贵的资源，用于发现新药和我们对疾病的了解。继续阅读为了真正展示财富，在耳后轻轻涂抹打印机墨水，而不是香奈儿 5 升办公室必需品的成本高达 2,410 英镑——高于 2003 年的 1,700 英镑，发现哪个？打印机墨水继续被列为最昂贵的液体之一，一升家庭办公室必需品的成本与一瓶非常高端的起泡酒或橡木陈酿干邑的价格相同。消费者倡导者哪个？发现从打印机制造商处购买的墨水比第三方替代品的价格高出 286%。\n将笔尖浸入一个墨水瓶中，然后在吸墨纸上轻轻擦去多余的笔尖，哪个？发现用于 WorkForce WF-7210DTW 打印机的彩色墨水（青色、品红色、黄色）的合装包售价为 75.49 英镑，来自爱普生。继续阅读 BORK!BORK!BORK! Windows XP 即将迎来 20 岁生日，但令人振奋的是，该操作系统仍然可以保证取代其作为世界末日三骑士之一的地位。虽然实际上不是在蓝色屏幕上，但 Windows XP 的丑陋面孔已经显示出它位于 CMOS 错误和另一个屏幕之间，它只是决定结束这一切。继续阅读在之前看过悬崖之后，肯特郡议会再次考虑将 5 亿英镑用于外包 肯特郡议会正在邀请 IT 服务公司和 BPO 专家竞标一项 5 亿英镑的框架协议，该协议旨在为企业提供一系列外包服务英国公共当局。\n在本周发布的一份合同通知中，该委员会通知他们市场参与这项价值 5 亿美元的交易，希望供应商能够“提高效率，提供灵活可靠的解决方案，实现转型并满足 [...理事会的] 业务目标。”通知称，托管服务框架协议旨在将“日常管理职责和职能的外包作为一种战略方法，通过提高效率、有效性和降低运营成本来转变和改进业务流程”。继续阅读专栏 您可以在一英里外发现浏览器大战的老手。并非 20 年前，这些可怕的冲突在世界各地的桌面上展开，留下了深深的伤痕。只需在 95 年代的任何人群中低声说“在 IE6 中观看效果最佳”，然后看着成年男女像婴儿一样哭泣，因为他们的手抓住一只无形的鼠标点击那个久违的关闭窗口。到 Gen XP，一切都结束了，Internet 桌面完全处于 Empire 的控制之下。然后是 Chrome 和 Firefox 的 Rebel Alliance，在短短几年内我们就被解放了。像和平时期的每一代人一样，此后的人们已经忘记了冲突。他们认为自由是理所当然的。桌面是一个古老的战场，就像波罗的海战舰一样陈旧。我们是移动的，我们是云，所有访问锁定都被淘汰的地方。继续阅读\nThe Register - 技术社区的独立新闻和观点。部分情况发布", "note_en": "&#39;The W3C doesn&#39;t get to be the boss of anyone, the decisions are going to be made at each of the browsers&#39;\n  Google has updated the schedule for its introduction of &#34;Privacy Sandbox&#34; browser technology and the phasing out of third-party cookies.\n The  new timeline has split the bundle of technologies in the Privacy Sandbox into five phases: discussion, testing, implementation in Chrome (called &#34;Ready for adoption&#34;), Transition State 1 during which Chrome will &#34;monitor adoption and feedback&#34; and then the next stage that involves winding down support for third-party cookies over a three-month period finishing &#34; late 2023.&#34;\n Although &#34;late 2023&#34; might sound a long way off, the timeline has revealed that &#34;discussion&#34; of the contentious FLoC (Federated Learning of Cohorts) is planned to end in Q3 2021 – just a couple of months away – and that discussion for First Party Sets,  rejected by the W3C Technical Architecture Group as &#34; harmful to the web in its current form,&#34; is scheduled to end around mid-November.\n   Google said that &#34;extended discussions and testing stages often produce better, more complete solutions, and the timeline for testing and ready for adoption of use cases might change accordingly,&#34; so the dates are not set in stone. There is no suggestion that any of the proposals will be withdrawn; the company appears to believe it can alleviate concerns by tweaking rather than abandoning its proposals.\n     Discussion of the various pieces is set to take place in the W3C  Web Incubator Community Group (WICG), though at a FLEDGE WICG Call last week, Google&#39;s Michael Kleber, tech lead for Privacy Sandbox, suggested that the W3C would not be deciding which technologies are implemented, at least in the context of FLEDGE (formerly TURTLEDOVE), which enables auctions for personalised ads in a more private manner than today.\n  FLEDGE is competing for attention with the Microsoft-devised  PARAKEET and MaCAW. Asked by Julien Delhommeau, staff system architect at adtech company Xandr, if the WICG would get a say in whether FLEDGE or PARAKEET/MaCAW would be adopted, Kleber  said: &#34;The W3C doesn&#39;t get to be the boss of anyone, the decisions are going to be made at each of the browsers. The goal isn&#39;t to have one winner and everyone else losing – the goal of W3C is to put out a bunch of ideas, understand the positives of each, and come to a chimera that has the most necessary features. Every browser seems to want convergence, long term, so figuring out how to make convergence happen is important.&#34;\n The purpose of Google&#39;s Privacy Sandbox is to reduce user tracking while still enabling the adtech industry to show customised advertising to users.\n &#34;How can websites fund content by enabling third parties to show ads and measure ad performance – but not allow individual users to be profiled?&#34;  asked Google Developer Advocate Sam Dutton. The company argued that removing personalisation from web advertising would greatly reduce advertising revenue. It ran its  own tests, disabling third-party cookies (which track users across the web) for randomly selected users, for its own ad manager system.\n   &#34;We observed that for the top 500 global publishers, average revenue in the treatment group decreased by 52 per cent, with a median per-publisher decline of 64 per cent,&#34; Google reported.\n Therefore big money is involved, and nuances around questions like centralisation of yet more influence over the web in the hands of a few large companies, not least Google.\n According to Kleber, when  asked if personalised advertising could be removed from the web, he said &#34;while most of the sites in the world would lose 50-70 per cent of their revenue in the alternative you&#39;re advocating for, Google is not one of them.&#34; He made this claim on the basis that &#34;Google makes most of its money from the ads that appear on Google Search,&#34; which do not require tracking technology.\n   As we noted  here, with the exception of Apple, the voices of Google and the adtech industry are louder in this debate, than those of the privacy advocates. ®\n    Dell won&#39;t ship energy-hungry PCs to California and five other US states due to power regulations\n     Dell is no longer shipping energy-hungry gaming PCs to certain states in America because they demand more energy than local standards allow.\n  Customers seeking to purchase, for example, an  Alienware Aurora Ryzen Edition R10 Gaming Desktop from Dell&#39;s website and have it shipped to California are now presented with a message that tells buyers they&#39;re out of luck.\n  &#34;This product cannot be shipped to the states of California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states,&#34; the website says. &#34;Any orders placed that are bound for those states will be canceled.&#34;\n  Continue reading\n  You, too, can be a Windows domain controller and do whatever you like, with this one weird WONTFIX trick\n     Microsoft completed a vulnerability hat-trick this month as yet another security weakness was uncovered in its operating systems. And this one doesn&#39;t even need authentication to work its magic.\n  The security shortcoming can be exploited using the wonderfully named  PetitPotam technique. It involves abusing Redmond&#39;s  MS-EFSRPC (Encrypting File System Remote Protocol) to take over a corporate Windows network. It seems ideal for penetration testers, and miscreants who have gained a foothold in a Windows network.\n  Specifically, security researcher Gilles Lionel found it was possible to use MS-EFSRPC force a device, including Windows domain controllers, to authenticate with a remote attacker-controlled NTLM relay. The  end result is an authentication certificate that grants the attacker domain-controller-level access to services, allowing them to commandeer the entire domain.\n  Continue reading\n  Remember the bloke who was told by Zen Internet to contact his MP about crap service? Yeah, it&#39;s still not fixed\n     A broadband customer from Leatherhead, Surrey, who was told to &#34;speak to your MP&#34; after his ISP failed to resolve repeated line disconnections has now been informed he can leave his contract without penalty after Openreach failed to resolve the problem.\n  Alan Brown, a network manager at a Russell Group University,  got in touch with us in February exasperated at the poor service he was experiencing and the contradictory information he&#39;d received from his ISP, Rochdale-based Zen Internet, and Openreach engineers.\n  On one day alone he told us he&#39;d experienced no fewer than 28 breaks in service.\n  Continue reading\n  Newly released data suggests South Korea is having a silicon and instant noodle renaissance, both thanks to COVID-19.\n  The south side of the nation had a great month for exports as the daily average for the first 20 days of July grew by 32.8 percent year-on-year.  Data released by the Korea Customs Service detailed a year-on-year increase in semiconductors by 33.9 per cent, wireless communication by 68.1 per cent, and industrial precision equipment by 15.1 per cent. Meanwhile, figures decreased for computer peripheral equipment by 7.8 per cent.\n  The increases are welcome news to many given the pandemic-related supply issues seen globally last year and this, specifically those in the  semiconductor industry.\n  Continue reading\n  British software licence reseller ValueLicensing has a trial date for the first part of a £270m legal showdown against Microsoft after accusing the US behemoth of breaking UK and EU competition laws.\n  A High Court hearing of Microsoft&#39;s attempt to strike out ValueLicensing&#39;s case will take place on 30-31 March 2022, the British company announced in a statement today.\n  Jon Horley, founder and MD of ValueLicensing, said: &#34;This High Court claim covers the damage to our business through Microsoft&#39;s abuse of its dominant market position, effectively destroying the pre-owned software market for desktop products. We are not the only victim to have suffered loss as a result of Microsoft&#39;s anticompetitive activity since 2016.&#34;\n  Continue reading\n  Thinking about upgrading to Debian Bullseye? Watch out for changes in Exim and anything using Python 2.x\n     The Debian Project has set a release date of 14 August for Debian 11, also known as Bullseye.\n  Debian is an important distribution in its own right, but also influential since it is the basis for many others including Ubuntu, Mint, Devuan, Knoppix, Tails, Raspbian, Pop!_OS, SteamOS and more.\n  In a post to the developer announcements mailing list, the release team  said: &#34;We plan to release on 2021-08-14.&#34; This is a little over two years since the release of Debian 10 &#34;Buster,&#34; which came out 6 July 2019. The testing release is now &#34;completely frozen&#34; other than to &#34;emergency bug fixes.&#34;\n  Continue reading\n  In brief Deepmind and the European Bioinformatics Institute released a database of more than 350,000 3D protein structures predicted by the biz&#39;s AI model AlphaFold.\n  That data covers the 20,000 or so proteins made in the human body, and is  available for anyone to study. The proteomes of 20 other organisms, from Zebrafish to E.coli bacteria, are also in there, too, and hundreds of millions of more structures will be added over time, we&#39;re told.\n  “In the hands of scientists around the world, this new protein almanac will enable and accelerate research that will advance our understanding of these building blocks of life,”  said DeepMind’s CEO Demis Hassabis. He hopes that it will be a valuable resource that will be used in the discovery of new drugs and our understanding of diseases.\n  Continue reading\n  For a true display of wealth, dab printer ink behind your ears instead of Chanel No. 5\n  Litre of the office essential costs as much as £2,410 – up from £1,700 in 2003, finds Which?\n     Printer ink continues to rank as one of the most expensive liquids around with a litre of the home office essential costing the same as a very high-end bottle of bubbly or an oak-aged Cognac.\n  Consumer advocate Which? has found that ink bought from printer manufactures can be up to  286 per cent more expensive than third-party alternatives.\n  Dipping its nib in one inkwell before delicately wiping off the excess on some blotting paper, Which? found that a multipack of colour ink (cyan, magenta, yellow) for the WorkForce WF-7210DTW printer costs £75.49 from Epson.\n  Continue reading\n  BORK!BORK!BORK! Windows XP is coming up to a 20th birthday yet it is heartening to see that the OS can still be guaranteed to take its place as one of the three horsemen of the borkpocalypse.\n  While not actually on a screen of blue, the ugly face of Windows XP has shown itself nestled between a CMOS error and another screen that has simply decided to end it all.\n  Continue reading\n  After staring over the precipice once before, Kent County Council considers £500m in outsourcing again\n     Kent County Council is inviting IT services companies and BPO specialists to bid for places on a £500m framework agreement set to offer a range of outsourcing services to the English public authority.\n  In  a contract notice published this week, the council put them market on notice to bid to be part of the cool half-billion deal, in the hope suppliers can &#34;improve efficiency, provide an agile and reliable solution that will transform and meet [the council&#39;s] business objectives.&#34;\n  The Framework Agreement for Managed Services is set to see &#34;the outsourcing [of] day-to-day management responsibilities and functions as a strategic method for transforming and improving business processes, through efficiencies, effectiveness and cutting operating costs,&#34; the notice said.\n  Continue reading\n  Column You can spot a veteran of the Browser Wars a mile off. These fearsome conflicts, fought across the desktops of the world not 20 years ago, left deep scars. Just whisper &#34;Best viewed in IE6&#34; in any crowd of Generation 95&#39;ers, and watch grown men and women weep like babies as their hands grasp for an invisible mouse to click on that long-gone Close Window.\n  By Gen XP, it was all over and the internet desktop was under total Empire control. Then came the Rebel Alliance of Chrome and Firefox, and in a few short years we were liberated.\n  Like every peacetime generation, those since have forgotten the conflict. They assume that freedom is here by right. The desktop is an antique battleground, as obsolete as warships in the Baltic. We are mobile, we are cloud, all places where access lock-in is baked out.\n  Continue reading\n  The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2021-07-27 07:53:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,chrome,google,沙盒,updates", "title": "谷歌更新不受欢迎的隐私沙盒的时间表，到 2023 年将杀死 Chrome 中的第三方 Cookie", "title_en": "Google Updates Timeline For Unpopular Privacy Sandbox, Which Will Kill Third-Party Cookies In Chrome By 2023", "transed": 1, "url": "https://www.theregister.com/2021/07/26/google_privacy_sandbox_roadmap/", "via": "", "real_tags": ["谷歌", "chrome", "google", "沙盒", "updates"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "假设我们最近在 Kubernetes 集群上遇到了一个错误。正如我们系统中经常发生的问题一样，我们首先注意到可见错误，我们可以将其声明为“构建未完成”。现在我们要回溯以找出发生了什么。一种常见的技术是精益思想普及的“五个为什么”。所以我们问“为什么构建没有完成”，我们发现“Kubernetes 无法启动 pod，并且操作在 1 小时后超时。”我们当然可以在一个步骤中辩论这是否是一个“为什么”或其中的两个，但这不是现在的关键话题。主要的是，这是关于因果关系的直接陈述。 “Pod no start”直接导致“build no done”。此分析的下一步显示 pod 无法启动，因为卷已满，文件过多。再次，直接因果关系。接下来是棘手的部分。为什么卷已满，文件太多？在这一点上，我们很可能会看到解释的性质发生了变化。可能会提供以下内容的一些变体：您是否注意到所有这些“原因”是如何以未发生的事情的形式陈述的？它们是“反事实”。反事实是关于如果过去发生的事情不同，现在世界可能会如何不同的陈述。这是一种“另类历史”的想法。这就是问题所在：反事实不能成为原因。根据定义，反事实没有发生，因此它不可能引起任何事情。只有实际发生的事件才能成为其他事件的原因。因果关系应以“Because X then Y”的形式表述。 “If not X then not Y”这句话不是一种解释，而是一种对过去可能如何以不同方式展开的一厢情愿的思考。\n在执行五个为什么时，重要的是要避免这种反事实的飞跃。坚持实际发生的事件。请注意，在我之前概述的事件分析中，列出了三个反事实。他们每个人都独立地足以避免这一事件。但这并不是我们可以构建的仅有的三个反事实：我可以继续，但你可能觉得前三个比这三个更合理。在某种程度上，原始系列比这三个更“接近”现实。尽管如此，我可以在无限的时间内继续构建反事实。 “如果地球不适合居住，那么我们就不会在这里关心我们的 CI 构建没有完成。”一旦你开始制作反事实，它们真的没有尽头。同样，那是因为这些不是发生的事件。只有有限数量的事件实际发生，所以因果关系链是有限的。无数的事情没有发生，所以我们总能找到更多的“缺失的东西”来责备。这也是人们在分析事件链时发生冲突的地方。一个人可能会假设一个不同的人或团队没有做过的事件的反事实。那个人或团队自然会生气——感觉就像他们受到了指责。 （更糟糕的是，因为没有做某事而被指责，所以他们被称为疏忽大意！）他们将被迫提出自己的反事实，这可能会吸引另一支球队。如果负面结果很重要，那么这片假设云就会变成一场“责备风暴”，希望像雨点一样降临在某人身上。防御上升，学习停止。反事实的飞跃表明人们在哪里停止寻找原因并跳到思考解决方案。尝试将反事实重新表述为关于未来预防的声明：如果我们监视“卷已满”情况，则不会再发生这种情况如果我们从旧版本中清除文件，则不会再发生这种情况。\n这些都是有用的陈述。当以这种方式表述时，他们显然是在谈论未来，而不是假设另一段历史。 （你可能已经注意到，我还偷偷用了一堆“我们”陈述来代替上面更具体的属性。）只要我们清楚这些反事实不是已经发生的问题的原因，而是变化对于我们可以防止未来发生的现实，我们可以使用它们而不会引发指责风暴。作为一种实用技术，在五个为什么或事后审查期间，当有人提出反事实作为原因时，我建议在停车场的前瞻性版本中捕捉潜在变化。这种重新表述还有助于剔除更牵强的概念......那些感觉有点“在那里”甚至以前很傻的人。让我们用上面的第二组来试试：如果我们在 CI 集群中使用静态 VM 而不是 Kubernetes，那么这种情况就不会再发生了。 （可能是正确的说法，虽然有些缺乏支持。）如果我们使用人类在命令行而不是 CI 工作，那么这种情况就不会再发生了。 （可能。人类的适应性更强，可以确定何时清除文件。但可能还有其他不良影响。）如果我们直接在生产实例上编辑文件而不是将代码放入存储库，那么这种情况就不会再次发生. （嗯……绝对是治愈比疾病更糟糕的情况！）\n最后一个也让我说明了之前的反事实。你可能会对第二组感到更多的阻力，因为如果那句话是真的，你会不自觉地考虑负面后果。人类非常擅长假设这些反事实。面对糟糕的结果，我们的大脑会不由自主地立即猜测出一棵大树的交替历史。并且同样迅速地，我们修剪那些我们知道会产生比我们的结果更糟糕的其他负面影响的树枝的树。试想一下，“如果我们挑起一场终结文明的核战争，那么这种 CI 构建失败就不会再发生了。”因此，当我提出一个反事实说“如果我们直接在生产实例上编辑文件，这种情况不会再次发生”时，您的本能反应是说，“是的，但是。”这是现在考虑离当前现实的两步之遥。第一步是想象发生反事实的替代历史。第 2 步是推断该替代历史后果的负面结果。有时，我们甚至通过假设更多的反事实来弥补第一个的负面后果，从而进一步远离现实。反事实对实际发生的事情没有任何说明。他们表达了一厢情愿的想法，希望能有一段没有发生坏事的历史。因为它们代表“没有发生的事件”，所以它们不可能引起任何事情。然而，陈述一个反事实可能会引发一轮无益的指责风暴。尝试重新表述作为对过去事件的解释提供的反事实，这样您就可以将它们表述为注入以防止再次发生。当然，您还必须考虑这些注射会产生什么其他影响！在分析任何事情时，要注意反事实的陷阱。当您需要重建事件链时，这是事后审查、回顾、项目事后分析和其他情况的常见陷阱。", "note_en": "Suppose we’ve had a recent error with a Kubernetes cluster. As often happens with a problem in our systems, we noticed it first in terms of the visible error, which we could state as “ Builds did not complete.” Now we want to trace backwards to figure out what happened. A common technique is the “Five Whys” popularized by Lean thinking. So we ask “Why did builds not complete” and we find “Kubernetes could not start the pod, and the operation timed out after 1 hour.”\n We could certainly debate whether that’s a single “why” or two of them in one step, but that’s not the key topic right now. The main thing is that this is a straightforward statement about causality. “Pod no start” leads directly to “build no done.”\n The next step in this analysis reveals that the pod would not start because a volume was full with too many files. Again, direct causality.\n The tricky bit comes next. Why was the volume full with too many files? At this point, we’re likely to see a change in the nature of the explanation. Some variation of the following might be offered:\n  Do you notice how all these “causes” are stated in the form of something that didn’t happen? They are “counterfactuals.”\n A counterfactual is a statement about how the world might be different now if something had happened differently in the past. It’s a kind of “alternate history” idea.\n Here’s the rub: a counterfactual  cannot be a cause. By definition the counterfactual did not happen, therefore it cannot have caused anything. Only events that actually occur can be causes of other events. Causality should be stated in a form “Because X then Y”. The statement “If not X then not Y” is not an explanation, it is a kind of wishful thinking about how the past might have unfolded differently.\n When performing Five Whys it is important to avoid this counterfactual leap. Stick to the events that actually occurred.\n  Notice in the incident analysis I outlined earlier, there are three counterfactuals listed. Each of them independently would have been sufficient to avert the incident. But these are hardly the only three counterfactuals we could construct:\n  I could go on, but you probably felt like the first three were somehow more reasonable than these three. In some way, the original set are “closer” to actual reality than these three. Nonetheless, I could go on constructing counterfactuals for an unlimited period of time. “If the Earth hadn’t been habitable then we would not be here to care about our CI builds not finishing.” Once you start making counterfactuals, there’s really no end to them. Again, that’s because these are not events that happened. Only a finite number of events actually happened so the chain of causality is finite. An infinite number of things didn’t happen so we can always find more “missing things” to blame.\n  This is also where people come into conflict when analyzing the chain of events. One person might posit a counterfactual about an event a different person or team didn’t do. That person or team naturally bristles–it feels like they are being blamed. (And worse, being blamed for  not doing something, so they are being called negligent!) They would be impelled to put forward their own counterfactual which might haul in yet another team. If the negative outcome was significant, this cloud of hypotheticals becomes a “blamestorm” looking to rain down on somebody. Defenses go up, and learning stops.\n   The counterfactual leap indicates where people stop looking for causes and jump to thinking about solutions. Try to reformulate the counterfactual as a statement about future prevention:\n If we monitor for “volume full” conditions, then this won’t happen again\n If we clean up files from old builds, then this won’t happen again.\n These are useful statements. When formulated this way, they’re clearly talking about the future and not hypothesizing an alternate history. (You might have noticed that I also snuck in a bunch of “we” statements in place of the more specific attributes above.)\n As long as we remain clear that these counterfactuals are not the  cause of the problem that already happened, but are changes to our reality that can prevent  future occurrences, we can use them without inducing blamestorming.\n As a practical technique, during a Five Whys or post-incident review, when someone poses a counterfactual as a cause, I suggest capturing it in the forward-looking version in a parking lot of potential changes.\n  This reformulation also helps weed out the more far-fetched conterfactuals… the ones that felt kind of “out there” or even silly before. Let’s try it with the second set from above:\n If we use static VMs instead of Kubernetes for our CI cluster, then this won’t happen again. (Possibly true statement, though somewhat lacking in support.)\n If we use a human working at the command line instead of CI, then this won’t happen again. (Probably. Humans are more adaptable and can figure out when to purge files. But there are likely to be other undesirable effects.)\n If we edit files directly on production instances instead of putting code in a repository, then this won’t happen again. (Umm… definitely a case where the cure is worse than the disease!)\n This last one also lets me illustrate something about the counterfactuals from before. You might have felt more resistance to the second set because you were automatically thinking about negative consequences if that statement had been true. Humans are very good at hypothesizing these counterfactuals. Faced with a bad outcome, our brains spontaneously and instantly conjecture a large branching tree of alternate histories. And just as quickly, we prune that tree of those branches which we know would produce other negative effects that are  worse than the outcome we had. Just imagine, “If we provoke a nuclear war that ends civilization, then this CI build failure won’t happen again.”\n So when I pose a counterfactual that says “if we edit files directly on production instances, this won’t happen again,” your instinctive response is to say, “yeah,  but.” This is now thinking about two steps away from the current reality. Step 1 is to imagine the alternative history where the counterfactual had occurred. Step 2 is to extrapolate the negative outcome of the consequences of that alternative history. Sometimes we even go further steps away from reality by postulating still more counterfactuals that could compensate for the negative consequences of the first one.\n  Counterfactuals don’t say anything about what actually happened. They express wishful thinking about an alternate history where the bad event  didn’t happen. Because they represent “events that didn’t occur” they cannot have caused anything. However,  stating a counterfactual can trigger an unhelpful round of blamestorming. Try to reformulate counterfactuals offered as explanations for past events so you can state them as injections to prevent recurrence. Of course, you must also contemplate what other effects those injections would have!\n Watch out for the pitfall of counterfactuals when analyzing anything. It’s a common trap for post-incident reviews, retrospectives, project post-mortems, and other cases when you need to reconstruct a chain of events.", "posttime": "2021-07-27 07:52:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "事实,counterfactuals,发生", "title": "反事实不是因果关系", "title_en": "Counterfactuals are not causality", "transed": 1, "url": "https://www.michaelnygard.com/blog/2021/06/counterfactuals-are-not-causality/", "via": "", "real_tags": ["事实", "发生"]}, {"category": "", "categoryclass": "", "imagename": "a8c0b0fd35b05ad3a3a042d98c011dde.jpg", "infoid": 1069920, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当新生哺乳动物第一次睁开眼睛时，它已经可以对周围的世界产生视觉感知。但是，在他们体验到视觉之前，这是怎么发生的呢？耶鲁大学的一项新研究表明，从某种意义上说，哺乳动物甚至在出生之前就梦想着他们即将体验的世界。在 7 月 23 日的《科学》杂志上，由威廉齐格勒三世神经科学教授兼眼科和视觉科学教授迈克尔克雷尔领导的一个团队描述了在小鼠睁眼之前从新生儿视网膜发出的活动波。这种活动在出生后不久就消失了，取而代之的是一个更成熟的视觉刺激神经传输网络，在那里信息被进一步编码和存储。 “在睁眼时，哺乳动物能够做出非常复杂的行为，”该研究的资深作者、耶鲁大学研究副教务长克莱尔说。但是，让我们感知运动和导航世界的回路是如何形成的？事实证明，我们生来就有能力做出这些行为，至少在基本形式上是这样。”在这项研究中，由耶鲁大学研究生葛欣欣和张凯茜领导的克雷尔团队探索了这些活动浪潮的起源。耶鲁大学的团队在小鼠出生后不久但睁开眼睛之前对其大脑进行成像，发现这些视网膜波的流动模式模仿了动物在环境中向前移动时会发生的活动。 “这种早期梦境般的活动具有进化意义，因为它允许老鼠预测睁开眼睛后会经历什么，并准备好立即应对环境威胁，”克雷尔指出。\n更进一步，耶鲁大学的团队还研究了负责传播模拟新生小鼠向前运动的视网膜波的细胞和回路。他们发现，阻断星爆无长突细胞（视网膜中释放神经递质的细胞）的功能，可以防止波向模拟向前运动的方向流动。这反过来又会损害小鼠出生后对视觉运动做出反应的能力的发展。有趣的是，在小鼠的成年视网膜内，这些相同的细胞在更复杂的运动检测电路中起着至关重要的作用，使它们能够对环境线索做出反应。当然，老鼠与人类的不同之处在于它们在出生后不久就能够快速驾驭环境。然而，人类婴儿也能够立即检测物体并识别运动，例如手指在他们的视野中移动，这表明他们的视觉系统在出生前也准备好了。 “这些大脑回路在出生时是自组织的，一些早期的教学已经完成，”克莱尔说。 “这就像在你睁开眼睛之前就梦想着你会看到什么。”", "note_en": "As a newborn mammal opens its eyes for the first time, it can already make visual sense of the world around it. But how does this happen before they have experienced sight?\n A new Yale study suggests that, in a sense, mammals dream about the world they are about to experience before they are even born.\n Writing in the July 23 issue of Science, a team led by  Michael Crair, the William Ziegler III Professor of Neuroscience and professor of ophthalmology and visual science, describes waves of activity that emanate from the neonatal retina in mice before their eyes ever open.\n This activity disappears soon after birth and is replaced by a more mature network of neural transmissions of visual stimuli to the brain, where information is further encoded and stored.\n “At eye opening, mammals are capable of pretty sophisticated behavior,” said Crair, senior author of the study, who is also vice provost for research at Yale.” But how do the circuits form that allow us to perceive motion and navigate the world? It turns out we are born capable of many of these behaviors, at least in rudimentary form.”\n In the study, Crair’s team, led by Yale graduate students Xinxin Ge and Kathy Zhang, explored the origins of these waves of activity. Imaging the brains of mice soon after birth but before their eyes opened, the Yale team found that these retinal waves flow in a pattern that mimics the activity that would occur if the animal were moving forward through the environment .\n  “This early dream-like activity makes evolutionary sense because it allows a mouse to anticipate what it will experience after opening its eyes, and be prepared to respond immediately to environmental threats,” Crair noted.\n Going further, the Yale team also investigated the cells and circuits responsible for propagating the retinal waves that mimic forward motion in neonatal mice. They found that blocking the function of starburst amacrine cells, which are cells in the retina that release neurotransmitters, prevents the waves from flowing in the direction that mimics forward motion. This in turn impairs the development of the mouse’s ability to respond to visual motion after birth.\n Intriguingly, within the adult retina of the mouse these same cells play a crucial role in a more sophisticated motion detection circuit that allows them to respond to environmental cues.\n Mice, of course, differ from humans in their ability to quickly navigate their environment soon after birth. However, human babies are also able to immediately detect objects and identify motion, such as a finger moving across their field of vision, suggesting that their visual system was also primed before birth.\n “These brain circuits are self-organized at birth and some of the early teaching is already done,” Crair said. “It’s like dreaming about what you are going to see before you even open your eyes.”", "posttime": "2021-07-27 07:52:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "哺乳动物,dream,运动", "title": "哺乳动物在出生前就梦想着他们即将体验的世界", "title_en": "Mammals dream about the world they are about to experience before they are born", "transed": 1, "url": "https://news.yale.edu/2021/07/22/eyes-wide-shut-how-newborn-mammals-dream-world-theyre-entering", "via": "", "real_tags": ["哺乳动物", "dream", "运动"]}]