[{"category": "", "categoryclass": "", "imagename": "2f4b7216724932eb94242fe7f9b83a39.jpg", "infoid": 1029796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "商业·公开安大略省的一位寡妇与苹果就她已经合法拥有的在线内容陷入了长达四年的斗争。\n多伦多的卡罗尔·安妮·诺布尔(Carol Anne Noble)想要访问她和丈夫共享的苹果账户-但用的是他的名字-这样她就可以履行她在他去世前对他做出的承诺。\n但是，这家科技巨头没有给她密码，而是要求她跳过复杂而昂贵的法律程序，以满足专家所说的过时的美国法律。\n这对我来说是一记真正的耳光，诺布尔说，她结婚41年，是丈夫遗产的遗嘱执行人和唯一受益人。唐·诺布尔于2016年末死于一种罕见的脊椎癌。\n基本上，他们会希望法院下令把我丈夫拥有的东西给我，而这些东西已经传给了我……。66岁的诺布尔在接受“公开”采访时说，这非常奇怪。\n专家表示，科技公司拒绝交出数字资产是一个问题，影响到从股票、保险单和贝宝(PayPal)到游戏信用、社交媒体帖子和全家福等方方面面。\n在线资产专家、阿尔伯塔大学(University Of Alberta)荣休教授彼得·罗恩(Peter Lown)告诉Go Public，这是一个只会变得更大的大问题，这让加拿大人任由美国公司及其规则摆布。\n诺布尔的丈夫在生命的最后六个月里一直躺在床上，与一种名为脊索瘤的慢性病作斗争。他会花几个小时用苹果设备记录疾病的发展过程。\n他希望把所有这些都写进一本书里，送给他的家人，但诺布尔说，最终很明显，他活不了那么久了。\n唐去世前几天，我不得不送他去医院…。那天晚上他对我说的最后一句话是，你得写这本书。不久之后，他就陷入了昏迷，她说。\n2017年初，当来宝集团联系苹果时，她被告知，她所需要做的就是证明她拥有丈夫遗产的合法权利。她寄出了公司要求的所有文件，包括他的死亡证明和指定她为遗嘱执行人的遗嘱。\n他们给我回电话说，不，这还不够--你必须有法院命令(但)必须付钱才能下达法院命令，她说。\n法院命令的费用从大约2000美元到数万美元不等-这取决于他们是否反对。\n来宝集团在与苹果公司来回奔波多年后，出于绝望，在今年早些时候聘请了一名律师来帮助引导公司的需求。\n诺布尔的律师迪拉吉·辛德瓦尼(Dheeraj Sindhwani)在安大略省从事家庭法业务，他说，这是一个棘手的情况。\n数字资产是由一家私人持股公司管理的东西之一……但它不像银行账户，我们不能进去说，这里有死亡证明，这里有遗嘱认证文件，我们可以进入这里获取访问权限。(注：数字资产是由私人持股的公司管理的。但它不像银行账户，我们不能进去说，这里有死亡证明，这里有遗嘱认证文件。)\n洛恩说，他见过涉及谷歌、Facebook和其他公司的类似案例，科技公司经常对加拿大用户不屑一顾，认为这是一种滋扰。\n所以人们被束缚住了。即使他们通过了一些，还会有更多，他说。\n苹果拒绝了“上市”的采访请求，也没有回应我们关于来宝的情况及其数字资产政策的具体问题。\n该公司告诉来宝，提供密码将违反1986年制定的一项美国法律--《电子通信隐私法》(Electronic Communications Privacy Act)。\n这项法律旨在保护美国人免受不必要的政府和警察监视，禁止公司提供个人电子信息。\n但洛恩表示，这项已有数十年历史的法律并不适用于今天社交媒体和其他数字资产的高度在线世界。\n[然而]服务提供商真心地使用它&#34；[然而]Content…。所以他们可以说，对不起，我不能向你透露这件事，因为那会违反我在法案下的义务。\n那些制定了专门针对数字资产的法律的国家(包括欧盟)的公民不会遇到同样的问题。对于这些人，苹果服务的条款和条件授予您通常居住地的法律和法院管辖权。\n一些加拿大人已经做到了这一点。2014年，莫琳·亨利的成年儿子的身体在多伦多的一个码头被发现-疑似自杀-之后，她想访问他的数字账户，看看他们是否会给她任何答案。\n她得到了法院的命令，先是来自安大略省，后来又来自加州北部的一家法院。苹果和贝尔遵守了安大略省的命令，谷歌加拿大公司对此进行了斗争，但在亨利获得美国订单后给了她数据。她仍在法庭上与Facebook抗争。\n然而，Lown说，更多情况下，加拿大人受到美国法律的约束，尽管保护像亨利和诺布尔这样的人的拟议立法已经起草完毕，并准备通过。\n2016年，一个由律师、法官和学者组成的独立小组提出了一项修改省级继承法的提议，即通过受托人统一获取数字资产法案，洛恩是该小组的成员。\n它将为加拿大人解决这类问题，但到目前为止，只有萨斯喀彻温省使其成为法律。\n这将迫使这些大型科技公司解决这个问题，因为就目前的情况而言，祝你好运，试图联系到这些公司中几乎总是总部设在加利福尼亚州的任何人。\n罗恩说，只有当加拿大拥有这种杠杆作用时，科技公司才会迎合加拿大人的需求。\n来宝表示，当用户注册该服务时，苹果有责任透明和坦率地对待其政策，而不是将这些信息印在小字上。\n她还希望看到省级和地区政府在解决这个问题上做得更好。\n&#34；这是一个需要立即解决的领域…。她说，人们能够接触到他们所爱的人的临终照片和各种东西，这一点非常重要。\n在Go Public与苹果联系后，苹果与来宝进行了接触，提供了法院命令需要包括的细节。\n对于固定收入，她认为自己负担不起，并准备放弃，直到她的律师Sindhwani提出无偿完成申请。\n我们讲述你们的故事，揭露不法行为，并追究权力的责任。\n如果你有一个符合公众利益的故事，或者如果你是一个有信息的内部人士，请联系www.gopublic@cbc.ca，并附上你的名字、联系方式和简短的摘要。在你决定公开之前，所有的电子邮件都是保密的。", "note_en": "Business  · GO PUBLIC      An Ontario widow is locked in a four-year battle with Apple over online material she already legally owns.\n  Carol Anne Noble of Toronto wants access to an Apple account she and her husband shared — but was under his name — so she can fulfil a promise she made to him before he died.\n   But instead of giving her the password she&#39;s forgotten, the tech giant is demanding she jump through complicated and expensive legal hoops to satisfy what experts say is an outdated American law.\n  &#34;It&#39;s a real slap in the face to me,&#34; said Noble who, after 41 years of marriage, was the executor and sole beneficiary of her husband&#39;s estate. Don Noble died from a rare spinal cancer in late 2016.\n  &#34;Basically, they want an order from the court to give me what my husband owned and it is already bequeathed to me... it&#39;s very strange,&#34; Noble, 66, told Go Public.\n    Experts say that tech companies refusing to hand over digital assets is a problem affecting everything from stocks, insurance policies and PayPal to gaming credits, social media posts and family photos.\n  It&#39;s a &#34;big&#34; problem that will &#34;only get bigger,&#34; Peter Lown, online assets expert and professor emeritus at the University of Alberta, told Go Public, leaving Canadians at the mercy of the U.S.-based companies and their rules.\n    Noble&#39;s husband spent the last six months of his life confined to a bed as he battled a slow-moving form of cancer called chordoma. He&#39;d spend hours chronicling the progression of the disease using Apple devices.\n  He was hoping to put it all together in a book for his family, but Noble says it eventually became clear he wouldn&#39;t live long enough.\n  &#34;A few days before Don died I had to take him to the hospital … His last words to me that night were &#39;You will have to write the book.&#39; He went into a coma shortly after,&#34; she said.\n      When Noble contacted Apple in early 2017, she was told all she needed to do was prove she has the legal right to her husband&#39;s estate. She sent all the documents the company asked for, including his death certificate and the will designating her as executor.\n  &#34;They called me back and said, no, that&#39;s not good enough — you have to have a court order [but] having to pay to put in a court order is a huge deal,&#34; she said.\n  Court orders can cost from about $2,000 to tens of thousands of dollars — depending on whether they&#39;re opposed.\n  After going back and forth with Apple for years, Noble, out of desperation, hired a lawyer earlier this year to help navigate the company&#39;s demands.\n  &#34;It&#39;s a tricky situation,&#34; said Dheeraj Sindhwani, Noble&#39;s lawyer, who practises family law in Ontario.\n  &#34;Digital assets are one of those things where it&#39;s being governed by a privately held corporation... it&#39;s not like a bank account where we can go in and say, here&#39;s a death certificate, here&#39;s a probate document and get access.&#34;\n  Lown says he has seen similar  cases involving Google, Facebook and others, and that tech companies often &#34;brush off&#34; Canadian users &#34;as a nuisance.&#34;\n  &#34;So people are getting hooped by the hoops. Even if they get through some, there will be more,&#34; he said.\n  Apple refused Go Public&#39;s request for an interview and didn&#39;t respond to our specific questions about Noble&#39;s situation and its policies on digital assets.\n      The company told Noble providing the password would   contravene a U.S. law —  the Electronic Communications Privacy Act — written back in 1986.\n  The law, meant to protect Americans from unnecessary government and police surveillance, bars companies from giving out personal electronic information.\n  But the decades-old law isn&#39;t meant for today&#39;s heavily online world of social media and other digital assets, Lown says.\n      &#34;[Yet] the service providers use it to their hearts&#39; content … so they can say, sorry, I can&#39;t disclose this to you because that would be a breach of my obligations under the act.&#34;\n  Citizens of countries that have laws specifically addressing digital assets — including those in the European Union — don&#39;t have the same problems. For those people, the  terms and conditions of Apple services grant jurisdiction to &#34;the laws and courts of your usual place of residence.&#34;\n    Some Canadians have done that. After Maureen Henry&#39;s adult son&#39;s body was found at a marina in Toronto in 2014 — a suspected suicide — she wanted access to his digital accounts to see if they would give her any answers.\n  She got court orders, first from Ontario and later from a California court. Apple and Bell complied with the Ontario order, Google Canada fought it but gave her the data after Henry got the U.S. order. She&#39;s still fighting Facebook in court.\n  More often though, Canadians are subject to U.S. laws, Lown says, even though proposed legislation that would protect people like Henry and Noble is already written and ready to be adopted.\n    A proposed change to provincial inheritance laws, the  Uniform Access to Digital Assets by Fiduciaries Act, was put forward in 2016 by an  independent group of lawyers, judges and academics, of which Lown is a member.\n  It would solve these sorts of problems for Canadians but, so far, only Saskatchewan has made it law.\n    &#34;This will force these giant tech companies to deal with the problem, because as it stands right now, good luck trying to get a hold of anyone in one of these companies who are almost always based in California.&#34;\n  Only when Canada has that kind of &#34;leverage,&#34; said Lown, will tech companies accommodate the needs of Canadians.\n  Noble says Apple has a responsibility to be transparent and upfront about its policies when users sign up for the service, instead of putting that information in the fine print.\n  She also wants to see  provincial and territorial governments do a better job of addressing the issue.\n  &#34;This is an area that needs to be addressed immediately … it&#39;s very important that people are able to access their loved ones&#39; final photos and all kinds of things,&#34; she said.\n  After Go Public contacted Apple, it reached out to Noble with details on what the court order needs to include.\n  On a fixed income, she didn&#39;t think she could afford to do it and was ready to give up, until Sindhwani, her lawyer, offered to complete the application pro bono.\n          We tell your stories, shed light on wrongdoing, and hold the powers that be accountable.\n  If you have a story in the public interest, or if you&#39;re an insider with information, contact  gopublic@cbc.ca with your name, contact information and a brief summary. All emails are confidential until you decide to Go Public.", "posttime": "2020-10-19 21:25:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,阻止,blocks", "title": "苹果阻止寡妇履行丈夫的遗愿", "title_en": "Apple blocks widow from honouring husband's dying wish", "transed": 1, "url": "https://www.cbc.ca/news/business/widow-apple-denied-last-words-1.5761926", "via": "", "real_tags": ["apple", "苹果", "阻止", "blocks"]}, {"category": "", "categoryclass": "", "imagename": "547f7e8d3a3d5d4ffd4c40a92e1ad5bc.jpg", "infoid": 1029795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对我来说，禁闭没多久，星期五的啤酒会议就开始了。一位同事将它们安排为一种释放压力和社交的形式，因为我们都在为我们已经知道至少一年不会见到对方做准备-对于几周前刚刚开始在公司工作的人来说，我需要它。\n在家工作一直是与世隔绝的，但在2020年变得更加孤立。对于我们这些过去全职在家工作的人来说--至少对于我们这些曾经这样做过、有吵吵闹闹的家庭和没有个人空间概念的孩子的人来说--在家庭生活和工作生活之间保持分离也变得困难得多。我们的配偶和孩子(在某些情况下，成年的孩子)都在同一时间在家，工作、学习或玩耍，或者只是在与我们相同的空间里呼吸太大声。\n对于那些从来没有享受过其他人都不在家的时候在家办公的孤独的人来说，相信我：我们现在拥有的不是过去25年来我在家工作的样子。为了适应这一点，组织必须弄清楚如何在没有定期社交联系的情况下保持团队的凝聚力。他们还必须在善于沟通和干预员工家庭生活之间找到平衡，同时保持某种连贯的工作环境，这样人们就可以相互交谈，完成工作。\n几乎可以肯定的是，未来的道路将是有节制的协作交流、有节制的社会化与工作日的整合以及猫模因的结合。\n嗯，也许不太像猫模因那样-但在分布式工作场所建立一种正常运作的文化将需要旧办公室可能认为不利于生产力的东西。使用协作工具进行非正式交流和社交(加上猫表情包！)。是在办公室散居期间创造社区感的重要工具。\n许多组织已经求助于协作工具来帮助弥合隔离并保持其员工的理智。这包括像啤酒电话会议这样的事情，但也包括其他破冰和互动，这些东西不属于这些技术曾经被定义为商业用途的范围。\n协作工具可以为同事提供一种联系和重新创建社区感的方式，但也可以为组织提供一种方式来评估个人在家中或远程工作时面临的挑战，并帮助为他们提供一个平台，让他们分享关于如何应对和克服这些挑战的想法。好的工具还可以帮助建立工作流程的新常态，提供一种让员工建立新的流程和支持架构的方法，而这些流程和支持结构本来可能缺乏在家工作，并且可以找到新的工作方式，而不要求员工在标准的每天8小时工作时间内上班。", "note_en": "The Friday &#34;beer-thirty&#34; Zoom conferences began for me not too long into the lockdown. A co-worker scheduled them as a form of stress release and socialization as we all prepared for what we already knew was going to be at least a year of not seeing each other in person—and for someone who had just started with the company a few weeks prior, I needed it.\n Working from home has always been isolating, but it has become even more so in 2020. And for those of us who&#39;ve worked from home full-time in the past—well, at least for those of us who have done that and have loud families and kids with no concept of personal space—it has also become a lot harder to maintain a division between home life and work life. Our spouses and kids (and in some cases, adult kids) are all home at the same time, working or studying or playing or just  breathing too loudly in the same space as us.\n  For those of you who&#39;ve never enjoyed the solitude of a home office when everyone else is out of the house, trust me: what we have right now is  not what working at home has been like for the past 25 years for me. To adjust to this, organizations must figure out how to keep teams cohesive in the absence of regular social contact. They also must find a balance between being  communicative and being  intrusive into the home life of employees, all while still keeping some kind of coherent work environment going so people can talk to each other and get work done.\n The way forward is almost certainly going to be a combination of measured collaborative communications, measured integration of socialization into the work day, and cat memes.\n  Well, maybe not so much with the cat memes—but establishing a functioning culture in a distributed workplace will require things that the old office likely would consider detrimental to productivity. Informal communications and socialization using collaboration tools (plus cat memes!) are important tools to create a sense of community during the office diaspora.\n  Many organizations have turned to collaborative tools to help bridge the isolation and maintain the sanity of their employees. This includes things like the &#34;beer-thirty&#34; conference call but also other ice-breakers and interactions that do not fall within what were once defined as &#34;business use&#34; of those technologies.\n Collaboration tools can give co-workers a way to bond and re-create a sense of community, but they can also provide a way for organizations to gauge the challenges that individuals are having working from home or remotely—and help give them a platform for sharing ideas about how to deal with and overcome those challenges. Good tools can also help establish a new normal for workflow, providing a way to let employees build new processes and support structures that working from home may otherwise lack—and to find new ways to work that don&#39;t require employees to be &#34;on&#34; for a standard eight-hour work day.", "posttime": "2020-10-19 21:10:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,full", "title": "互联网上充斥着商业猫：处理工作/家庭鸿沟的破裂", "title_en": "The Internet is full of business cats: Dealing with the breakdown of the work/home divide", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/future-of-collaboration-02/", "via": "", "real_tags": ["商业", "full"]}, {"category": "", "categoryclass": "", "imagename": "6577532a991a7893cdefd87e5dc13c07.jpeg", "infoid": 1029794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据英国《每日电讯报》1日报道，欧盟正在牵头两项积极调查，调查Instagram是否非法泄露了数百万未成年用户的个人信息。\n调查由爱尔兰数据保护委员会(DPC)进行，该委员会是Instagram在欧洲的母公司Facebook的官方数据监管机构。Facebook的欧洲总部设在都柏林。\nDPC在收到美国数据科学家大卫·斯蒂尔(David Stier)的投诉后，于上月启动了调查。斯特尔告诉“每日电讯报”，他相信多达500万18岁以下的用户的个人联系方式被曝光。\n斯特尔说，Instagram拥有巨大的资源可供他们使用，但这起事件表明，他们对用户的同理心、安全意识和关爱程度低得可怜。\nDPC副专员格雷厄姆·多伊尔在接受“每日电讯报”采访时表示，该委员会一直在积极监控收到的来自该领域个人的投诉，并发现了Instagram上儿童个人数据处理方面的潜在问题，需要进一步审查。\nDPC的第一项调查将集中在Instagram是否促进了用户隐私，特别是儿童用户的隐私。第二个将特别关注其商业账户功能是否适合显示未成年用户的联系方式。\n据“每日电讯报”报道，根据欧盟的数据保护条例，每项调查最高可导致Facebook年收入4%的罚款。Facebook&2019年的年营业额为707亿美元，这意味着最高4%的罚款将相当于28亿美元。\n斯特尔在2019年的一篇中型帖子中写道，他发现了Instagram的一个漏洞，该漏洞允许未成年用户的个人数据公开曝光。\n该漏洞与Instagram如何允许用户在普通账户和商务账户之间切换有关。要转换为拥有商业账户，Instagram用户必须添加电话号码或电子邮件地址，然后这些地址就可以公开访问。\n斯蒂尔在2019年写道，因为对谁可以将个人资料更改为商业账户似乎没有限制，许多孩子已经意识到，他们可以申请拥有一家企业，这样他们就可以在自己的个人资料页面上添加联系人按钮。\n自那以后，Instagram改变了这一流程，因此商业账户持有人必须选择公开展示他们的联系方式。\n我们一直很清楚，当人们选择在Instagram上开设商业账户时，他们分享的联系信息将被公开展示。Instagram的一位发言人告诉“商业内幕”，这和暴露人们的信息有很大不同。\n他们补充说：我们正在与IDPC保持密切联系，我们正在配合他们的调查。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "The EU is leading two active investigations into whether Instagram illegally exposed the personal details of millions of underage users, the  Telegraph reported Monday.\n The investigations are being carried out by Ireland&#39;s Data Protection Commission (DPC), the official data regulator for Instagram&#39;s parent company Facebook in Europe. Facebook&#39;s European headquarters are in Dublin.\n The DPC launched the investigations last month after it received a complaint from US data scientist David Stier. Stier told the Telegraph he believes as many as 5 million users under the age of 18 had their personal contact details exposed.\n &#34;Instagram had enormous resources at their disposal, but this incident shows they had woefully low levels of empathy, safety awareness and care for their users,&#34; Stier said.\n   DPC Deputy Commissioner Graham Doyle told the Telegraph that the commission &#34;has been actively monitoring complaints received from individuals in this area and has identified potential concerns in relation to the processing of children&#39;s personal data on Instagram which require further examination.&#34;\n The first of the DPC&#39;s investigations will focus on whether Instagram promotes user privacy, especially for child users. The second will focus specifically on whether it&#39;s appropriate for its business accounts feature to display the contact details of underage users.\n The Telegraph reports that under EU data protection regulations, each investigation could result in a maximum fine of 4% of Facebook&#39;s annual revenue. Facebook&#39;s annual turnover for 2019 was $70.7 billion, meaning a maximum 4% fine would equal $2.8 billion.\n  Stier wrote in a  Medium post in 2019 that he had found an Instagram loophole that allowed the personal data of underage users to be publicly exposed.\n   The loophole is linked to how Instagram allows users to switch between a regular account and a &#34;business&#34; account. To change over to having a business account, Instagram users must add either a phone number or an email address, which was then publicly accessible.\n &#34;Because there are seemingly no restrictions on who can change their personal profile to a business account, many kids have figured out that they can &#39;claim&#39; to have a business so that they can add the contact buttons onto their own profile page,&#34; Stier wrote in 2019.\n Instagram has since changed this process so business account holders have to opt-in to having their contact details publicly displayed.\n &#34;We&#39;ve always been clear that when people choose to set up a business account on Instagram, the contact information they shared would be publicly displayed. That&#39;s very different to exposing people&#39;s information,&#34; an Instagram spokesperson told Business Insider.\n   &#34;We&#39;re in close contact with the IDPC and we&#39;re cooperating with their inquiries,&#34; they added.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-10-19 21:09:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "investigating,instagram", "title": "欧盟正在调查Instagram涉嫌泄露多达500万未成年用户的联系方式", "title_en": "The EU is investigating Instagram for allegedly exposing the contact data of up to 5 million underage users", "transed": 1, "url": "https://www.businessinsider.com/facebook-instagram-eu-investigation-allegedly-exposed-data-underage-users-2020-10", "via": "", "real_tags": ["instagram"]}, {"category": "", "categoryclass": "", "imagename": "0bd89e51ac293caf9f45148cb3e4af6e.jpg", "infoid": 1029793, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这轮融资包括Iteration、Hustle Fund、XA Network、Rapzo Capital、Lazada联合创始人斯坦·雅卡博(Stein Jakabo)和Dot Property创始人本·内夫(Ben Neve)的投资。普罗普赛尔还表示，“三个未披露的高度战略性投资者”和回归的私人投资者参与其中。\nPropsell上一次宣布融资是在2018年12月，当时它筹集了100万新元(约合73.7万美元)的种子资金。\nPropsell成立于2018年，并于次年推出。该公司表示，其技术平台能够更快地完成交易，帮助完成房地产估值等任务，并将标准佣金从2%降至1%，因为初创公司的内部代理能够在更短的时间内完成更多交易。\n该公司声称，目前每年处理价值约7500万新元的物业。在大流行期间，在线仪表盘和虚拟查看等科技驱动的服务使Propsell的代理人能够继续与客户合作。\n尽管新冠肺炎对经济造成影响，但新加坡房地产市场预计将相对较快复苏，尤其是住宅领域，因为对新公寓的需求和外国投资。\n另一家新加坡专注于房地产的初创公司最近筹集了资金，那就是PropertyGuru。上个月，房地产上市平台宣布KKR和TPG投资2.2亿美元，以拓展新的东南亚亚洲市场。PropertyGuru最直接的竞争对手是99.co，但Propsell、Ohmyhome和Greyloft等提供与技术平台相结合的代理服务的初创公司，都在新加坡房地产市场提供了另一种选择。\n迭代合伙人(也是旧金山Proptech初创公司Divvy Homes的创始人)布赖恩·马在一份关于其对Propsell的投资的新闻声明中表示：“在全球范围内，现代房地产经纪公司已经在以惊人的速度夺取市场份额。在新加坡这样一个楼价高企、需要高质素服务的市场，我们相信数码化是无可避免的。我们为Propsell在那里带头冲锋而感到兴奋。“", "note_en": "The round included investment from Iterative; Hustle Fund; XA Network; Rapzo Capital; Lazada co-founder Stein Jakabo; and Dot  Property   founder Ben Neve.  Propseller   also said “three undisclosed highly strategic investors” and returning private investors participated.\n Propseller’s last funding announcement was in December 2018, when it  raised SGD $1 million (about $737,000) in seed funding.\n  Founded in 2018 and launched the next year, Propseller says its technology platform enables transactions to close more quickly, helping with tasks like property valuations, and reduces standard commission fees to 1% from 2% because the startup’s in-house agents are able to finish more transactions in less time.\n The company claims it is currently handling about SGD $75 million worth of properties each year. During the pandemic, tech-enabled services like online dashboards and virtual viewings have allowed Propseller’s agents to continue working with clients.\n Despite the economic impact of COVID-19, Singapore’s  real estate market is expected to recover relatively quickly, especially the residential sector, because of demand for new condominiums and foreign investment.\n  Another Singaporean real estate-focused startup that recently raised funding is PropertyGuru. Last month, the property listing platform announced an investment of $220 million from KKR and TPG to expand into new Southast Asian markets. PropertyGuru’s most direct competitor is 99.co, but startups like Propseller, Ohmyhome and Greyloft, which offer agent services combined with tech platforms, all provide an alternative in the Singaporean real estate market.\n In a press statement about its investment in Propseller, Iterative partner (and founder of Divvy Homes, a San Francisco-based proptech startup) Brian Ma said, “Worldwide, modern estate agencies are already taking market share at breakneck speeds. In a market like Singapore with high property prices and the need for high quality service, we believe digitalization will be inevitable. We’re excited for Propseller to lead the charge there.”", "posttime": "2020-10-19 21:05:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "propsell,tech,房地产", "title": "\n新加坡科技房地产经纪公司Propsell筹集120万美元种子轮", "title_en": "\n\t\t\t\tSingapore tech-based real estate agency Propseller raises $1.2 million seed round\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/19/singapore-tech-based-real-estate-agency-propseller-raises-1-2-million-seed-round/", "via": "", "real_tags": ["propsell", "tech", "房地产"]}, {"category": "", "categoryclass": "", "imagename": "fe3e0410abbdbd95dc5c54de84a2381f.jpg", "infoid": 1029792, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "其中一些听起来可能很熟悉，因为对于文档人工智能，Google Cloud已经提供了一个更通用的工具，用于在复杂文档上执行OCR，然后从这些文档中提取数据。Lending DocAI实质上是第一个使用该技术的垂直专业化Google Cloud服务。\n谷歌产品经理Sudheera Vanguri写道：“我们的目标是为您提供正确的工具，帮助借款人和贷款人获得更好的体验，并在更短的时间内完成抵押贷款，使相关各方受益。”借助Lending DocAI，您将减少抵押贷款处理时间和成本，简化数据捕获，并支持监管和法规遵从性要求。\n谷歌辩称，它的工具将加快抵押贷款工作流程，并改善借款人的体验。如果你曾经经历过抵押贷款过程，你就知道编辑所有必要的文件需要多长时间，在你的银行或抵押贷款经纪人告诉你一切都正常(或不正常)之前有多长时间。\n此外，Google Cloud还辩称，这项技术可以帮助“通过利用降低实施人工智能战略风险的技术堆栈(例如，数据访问控制和透明度、数据驻留、客户管理的加密密钥)来降低风险并增强合规姿态。”\n在许多方面，这款新产品是谷歌云在首席执行官托马斯·库里安(Thomas Kurian)领导下当前战略的一个很好的例子。虽然它继续为每个级别的开发人员开发过多的通用服务，但现在它也将这些服务捆绑在一起，作为完整的解决方案出售给各种垂直领域的企业。这就是谷歌云认为它可以为这些公司带来最大利益的地方-从而产生最多的收入。通过为零售商、电信公司、游戏公司和更多公司提供行业解决方案-以及行业合作伙伴帮助他们提高速度-Kurian和他的团队相信，他们可以提供解决方案，而其竞争对手则专注于提供工具。到目前为止，这一战略似乎运行良好，谷歌云的收入在上个季度增长了43%以上。", "note_en": "Some of this may sound familiar, because, with  Document AI, Google Cloud already offers a more general tool for performing OCR over complex documents and then extracting data from those. Lending DocAI is essentially the first vertically specialized Google Cloud service to use this technology.\n “Our goal is to give you the right tools to help borrowers and lenders have a better experience and to close  mortgage loans in shorter time frames, benefiting all parties involved,” writes Google product manager Sudheera Vanguri. “With Lending DocAI, you will reduce  mortgage processing time and costs, streamline data capture, and support regulatory and compliance requirements.”\n  Google argues that its tool will have speed up the mortgage workflow process and improve the experience for borrowers, too. If you’ve ever gone through the mortgage process, you know how much time it takes to compile all of the necessary documents and how much lag there is before your bank or mortgage broker tells you that everything is in order (or not).\n In addition, Google Cloud also argues that this technology can help “reduce risk and enhance compliance posture by leveraging a technology stack (e.g. data access controls and transparency, data residency, customer managed encryption keys) that reduces the risk of implementing an AI strategy.”\n In many ways, this new product is a good example for Google Cloud’s  current strategy under the leadership of its CEO Thomas Kurian. While it continues to develop a plethora of general services for developers at every level, it now also bundles these together to sell as complete solutions to enterprises in various verticals. That’s where Google Cloud believes it can generate the most benefit for these companies — and hence generate the most revenue. With industry solutions for  retailers,  telcos, gaming companies and more — and industry partners to help them get up to speed — Kurian and his team believe that they can offer solutions while its competitors focus on offering tools. So far, that strategy seems to be working out alright, with Google Cloud’s revenue growing  over 43 percent in the last quarter.", "posttime": "2020-10-19 21:05:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,抵押,cloud,数据", "title": "\n谷歌云推出其首个专用抵押贷款行业工具Lending DocAI", "title_en": "\n\t\t\t\tGoogle Cloud launches Lending DocAI, its first dedicated mortgage industry tool\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/19/google-cloud-launches-lending-docai-its-first-dedicated-mortgage-industry-tool/", "via": "", "real_tags": ["谷歌", "google", "抵押", "cloud", "数据"]}, {"category": "", "categoryclass": "", "imagename": "5c6abf016fc501755456c9f2c7a12d0c.jpeg", "infoid": 1029790, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时候，解释和顶嘴只有一条线。如果有人向你征求意见，然后又被回嘴，往往不会有什么好结果。我学会了闭嘴多听。\n2014年，我参加了全国网页设计开发大赛。作为一名开发人员的学生，一位设计老师自愿帮助我进行设计方面的工作。当我第一次见到她时，她主动提出要在课堂上复习我的一件设计。\n我对设计的品味受到了网上华丽草稿的影响，特别是来自Dribble的。我不太了解它的有效性，我认为拥有一个巨大的页脚是坚实和酷的。\n但是老师指出它不适合我的设计。因为它是一款应用程序，所以页面的最大高度就是浏览器的高度。一个很大的元素告诉观众，这很重要，而事实上，内容才是重要的部分。\n我当时并不明白这一点，并坚持不懈地解释为什么我使用了一个巨大的页脚。那是我最后一次见到她。她不再帮我了。\nY Combinator的创始人之一保罗·格雷厄姆(Paul Graham)在给出建议时提到，好的初创企业尽量不要面对它。他们的回答是我们已经尝试过了，或者说是因为我们的用户不喜欢他们所喜欢的东西，所以他们的回答是：我们已经尝试过了，或者说是因为我们的用户与他们不喜欢的内容不同，所以他们的回答是：我们已经尝试过了，或者说这不是他们想要的。\n解释和顶嘴之间只有一线之隔。从每个人的角度来看，这是不同的，经常会产生误解。在给出建议时，人们可能会觉得收到反馈不受赏识。有些人会对顽固的人做出反应，也可能不会。一些人最终会辞职。\n后来，除非不寻求建议，否则我会尽量闭嘴多听。", "note_en": "Sometimes, explaining and talking back has a thin line. It often leads to no good when someone asked for an advice, then being talked back. I learned to shut up and listen more\n    In 2014, I participated in a national Web Design and Development contest. As a developer student, a design teacher volunteered to help me with the design aspect. When I first met her, she offered to review one of my designs in class.\n My taste of design was influenced by flashy drafts online, especially from Dribbble. Not understand much of its effectiveness, I thought having a huge footer was solid and cool.\n But the teacher pointed out it wasn&#39;t suitable for my design. Since it was an app, with the page&#39;s max height is the browser&#39;s height. A big element tells the viewers &#34;this is important&#34;, while in fact, the content was the important part.\n I didn&#39;t understand the point at the time, and persistently explaining why I used a huge footer. It was the last time I saw her. She quit helping me.\n  Paul Graham — a founder of Y Combinator, mentioned when giving advice, good startups&#39; try not to confront it. Their responses are &#34;we already tried it&#34;, or &#34;from speaking to our users that isn&#39;t what they&#39;d like&#34; ¹\n There is a thin line between explaining and talking back. It&#39;s different from each person&#39;s perspective and often misunderstands. When giving advice, people might feel unappreciated receiving a talkback. Some will respond to the stubborn, or they might not. Some will eventually quit.\n Later on, unless when not looking for advice, I try to shut up and listen more.", "posttime": "2020-10-19 20:57:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学会,shut,设计", "title": "当我学习的时候，我学会了闭嘴", "title_en": "I learned to Shut Up when Learning", "transed": 1, "url": "https://hieunc.com/posts/Injmpe77TRe-i-learned-to-shut-up-when-learning", "via": "", "real_tags": ["学会", "shut", "设计"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "六年前，树莓派基金会推出了计算模块：这是广受欢迎的树莓派B型电路板的一个极小的版本。\n从那时到现在，Compute Module已经有了多次版本，就像我在我的Raspberry Pi Cluster YouTube系列中使用的3+版一样，但它们都有相同的基本外形规格和非常有限的功能集。\n但是今天，随着第四代计算模块--计算模块4的问世，一切都改变了！下面是与上一代计算模块3+、其他一些常见PI型号以及SD和microSD卡的大小比较(还记得最初的PI使用全尺寸SD卡的时候吗？)：\n我还发布了一个Compute Module4的视频评论，嵌入在下面(滚动浏览博客文章版本的评论)：\n计算模块4基本上是一个Raspberry PI 4型号B，所有端口都被切断。您可以使用其特殊的板对板连接器将计算模块插入另一个板，而不是端口。但是，Compute模块还有其他一些诀窍：\n更快的eMMC：它有可选的板载eMMC存储，现在比我测试过的任何microSD卡都快得多。\nPCI Express：它去掉了PCI Express接口的USB3.0接口，这意味着你可以做一些非常酷的事情，而不是只有几个USB3.0端口。\nWiFi和u.fl：它有一个外部天线接口用于连接无线接口。那是什么？哦，是的，现在有一个版本的带蓝牙和WiFi的计算模块！\n更多选项：现在有32种不同的计算模块风格可供选择，无论您是否想要板载WiFi，无论您想要eMMC存储，还是想要1 GB、2 GB、4 GB甚至8 GB的RAM！\n你可以在Raspberry Pi网站上找到所有细节，但以下是亮点：\n最便宜的CM4是精简版，有1 GB的内存，没有无线，也没有板载存储，售价只有25美元。\n最贵的奶油版，配有WiFi、蓝牙、8 GB内存和更快的32 GB eMMC存储，售价90美元。\n但是要使用计算模块4，你要么需要自己建造一块板来集成它，要么需要购买Pi Foundation的新的计算模块4 IO板，这需要额外支付35美元。这块板把你的计算模块4变成了类固醇上的PI 4，因为它有一个标准的B型PI上的所有端口，然后还有一些端口。唯一缺少的就是内置的USB3.0端口，这也是让我仔细考虑的不同之处之一。\n我记得今年早些时候，埃本·厄普顿(Eben Upton)在一次播客中提到，树莓PI有一天会直接暴露它的PCIe1x接口。现在就是了！\nIO板上有这个漂亮的PCIe端口，您可以插入任何PCIe设备，只要它只使用一个通道的容量即可。例如，如果您只想像在型号B上一样拥有几个USB 3.0端口，则可以插入像我使用的Syba USB 3.1 PCI Express卡那样的适配器：\n或者..。如果您想要从磁盘存储中获得最先进的性能，请使用带NVMe的NVMe适配器，并享受有史以来最快的磁盘IO-至少在Raspberry PI上是这样：\n我将在我的YouTube频道上发布一段视频，介绍Compute Module 4的所有新磁盘选项，因此请务必订阅我的频道，但我将在本文稍后讨论性能。\n首先，我想稍微谈谈为什么计算模块是对过去版本的完全重新设计：\n我在图灵PI集群评估中注意到的几件事包括，缺乏足够的电源和电路板空间来容纳PI 4塞进它的小封装中的所有功能，特别是PI 4的系统芯片的不加节流的1.5 GHz时钟。\n此外，由于DIMM外形的物理限制，(至少在我看来)不可能包括所有功能，如内置天线、eMMC存储和以太网控制器芯片的WiFi。\n由于所有这些原因，为了更容易地将计算模块固定到不同的主板上，使用了更专业的主板到主板的连接器。它们中有两个，每个都有100个引脚，用于将电源、IO和GPIO引脚连接到计算模块：\n与CM3 Plus及更早版本相比，CM4最大的变化之一是现在包括一个板载千兆以太网控制器，因此您可以获得尽可能最佳的网络性能，而无需制造商将其包含在外部IO板上或使用外部适配器。\n不过，头条新闻的特点，特别是对我来说，是PCIe插槽。但需要明确的是，这是最小的PCIe风格，只有1个通道或1x#39；个带宽可用。所以，我不想让你的泡沫破灭，但是你不可能在你的树莓圆周率上使用NVIDIA RTX 3080。它仍然不能在8K分辨率和240fps下运行你最喜欢的电脑游戏。\n但是它会运行很多东西。首先，如果你喜欢USB3.0，并为这里没有USB3.0而难过，你可以买一块USB3PCIe扩展卡，但要确保它使用的是VLI VL805芯片组，否则它可能不能完全兼容Raspberry Pi OS，你就会陷入USB2.0的速度。\n我实际上买了三块不同的PCIe USB3.0卡，看看它们是怎么工作的，三块卡中有两块没有为我的大多数设备提供USB3.0吞吐量。他们一直以USB2.0的速度安装驱动器，这非常烦人。\n(从左至右：)第一张是ADWITS的通用PCI-Experss卡--不，我不是打字错误，盒子上是这么拼的--里面有VL805芯片，但它只按这个速度安装了我的几个USB 3.0驱动器。其他的，比如我在PI 4上测试过的最快的一个，安装在USB2.0设备上，速度很慢，但除此之外工作得很好。\n我对2端口的Inateck卡寄予了更高的期望，但对上面的Fresco Logic芯片感到紧张。事实证明，它也有类似的问题，有时会以USB3.0的速度安装一些驱动器，但并不总是如此。\n我测试的最好的USB3.0卡是Syba SD-PEX20199，它甚至包括一个USB Type-C插槽！它以USB3.0的速度安装我所有的设备，并且与树莓PI完美配合。只需小心插入耗电设备；由于它与IO板本身共用12V电源，因此只能接通少量电源！\n我最兴奋的是NVMe的支持。我必须弄清楚，直接连接到Raspberry PI的PCIe总线上的NVMe驱动器是否会比通过USB3.0插槽连接的驱动器速度更快。\n所以我把我的XPG SX6000驱动器插入这个PCIe转NVMe适配器，然后...。没什么。\n我应该在这里指出，在Raspberry PI OS上没有启用开箱即用的NVMe支持。您必须运行命令modProbe NVMe-core，然后重新引导以启用NVMe内核模块。\n无论如何，我可以使用命令lspci来查看来自Realtek的NVMe控制器至少可以识别，但是驱动器本身不会出现，而且我在使用dmesg：的系统日志中发现了一些奇怪的错误：\n所以我买了另一个备用的NVMe光驱进行测试，三星970EVO Plus，它比XPG光驱要贵一点。我把它插进适配器，然后启动PI。\n对啰!。我可以使用lsblk查看设备，所以我对其进行了格式化并挂载以供测试。\n让我告诉你，它是很快的。你先在这里听到这句话。Raspberry PI计算模块4提供迄今所有Raspberry PI中最快的磁盘IO。\n您可以看到，USB 3.0或NVMe驱动器的性能远远超过板载eMMC或microSD卡。对于大文件的顺序写入，固态硬盘的速度快得令人难以置信，但真正让这款PI与众不同的是获得原生NVMe性能的能力，这比连接USB 3.0的驱动器的4K性能提高了一倍多-来看看4K的随机写入速度吧！\n遗憾的是，您不能将NVMe驱动器用作启动卷，至少现在还不能。我认为如果我能在一个很小的集群中使用几个带有NVMe驱动器的LiteCM4，那就太棒了，这绝对会让我在今年早些时候构建的图灵PI集群大吃一惊。\n说到这里，我从图灵机那里听说，他们确实计划建造一个完全支持计算模块4的新版本2&39；板，我迫不及待地想知道结果会是什么！\n好的，那么你可以通过PCIe总线获得USB或NVMe，但是升级后的视频卡呢？\n当然，也有一些速度较慢的PCI显卡只在1X总线上运行，但它们中的大多数要么没有Linux驱动程序(因此它们不能在Raspberry PI OS上运行)，要么如果它们有Linux驱动程序，那么这些驱动程序只适用于x86处理器。PI使用ARM处理器，该处理器不能与x86驱动程序一起使用。\n无论如何，在我所有的搜索中，我只能找到一块PCI显卡，看起来它似乎与计算模块4-Zotac GeForce GT710硬件兼容。请注意，我说的是硬件兼容。图形芯片有Linux驱动程序，但仅适用于X86。也许有办法让它运行起来，但我不确定。你认为如何？如果您想让我尝试购买其中一张卡并在PI上进行测试，请留下您的评论！\n您还可以为PCIe购买许多其他适配器，包括用于硬盘和SSD的SATA适配器、声卡、打印机端口、网络适配器，甚至是旧的并行端口适配器！需要查看的最重要的事情是该卡是否支持Linux。有些东西是开箱即可支持的，但对于其他东西，您需要安装一个驱动程序，它不仅必须与Linux兼容，而且还必须与ARM处理器体系结构兼容。\n与较旧的计算模块相比，另一个主要功能是包含板载WiFi和千兆以太网。你可以选择是否使用Wifi和蓝牙，但所有版本都内置了千兆位以太网，由这个小小的Broadcom芯片提供：\n在我的测试中，CM4的性能和PI4型B一样好。\n有线网络的速度为942 Mbps，这大约是我在我家千兆网络上看到的速度，而且比老式的计算模块板快得多--后者根本没有板载网络！即使使用图灵PI集群板，它也只为每个计算模块提供100 Mbps，因此仅此一项就是一个巨大的改进。\n而无线，这在较旧的计算模块版本上也是完全不可用的，在我家的802.11ac网络上最高可达80 Mbps。现在，这里是它变得更有趣的地方。CM4是第一个提供U.FL天线连接器的任何类型的PI。因为许多将CM4集成到设备中的人可能会把它放在金属外壳内，如果他们想让WiFi正常工作，他们需要附加一个外部天线。\nPI基金会将向您出售一种经过认证的天线，您可以将其插入到这个小小的连接器中，然后将该天线安装在某个地方，以便PI仍然可以获得稳定的WiFi连接。\n但从技术上讲(你不是从我这里听到的！)，你可以拿起任何标准的ufl天线，比如我拥有的Highfineufl天线，然后使用它。\n要启用天线连接器(并禁用内置PCB天线)，您需要编辑PI上的/boot/config.txt文件，并添加以下行，然后重新启动PI：\n我用这个天线做了一些测试，只是为了比较PCB上的微型内置三角形天线，结果让我大吃一惊。\n使用内置PCB天线，信号电平为-43dBm(用cat/proc/net/Wireless测量)，质量等级为67/70(用iwlist wlan0扫描测量)。虽然我的路由器只有20英尺远，但这是相当体面的。用外置天线，我可以得到-40dBm(质量等级为70/70)，但那是在我稍微调整了一下它的位置以获得尽可能好的信号之后。\n如果我拔下天线，信号很糟糕，是-74dBm，质量是36/70，只能做到大约6 Mbps。因此，机载天线是一个伟大的设计-只要你没有把圆周率的圆周率封装在一个金属盒子或法拉第笼子里！\n因此，无论是无线网络还是有线网络，CM4都与普通的PI 4不相上下，远远超过了早期的计算模块的能力-让我惊讶的是，这么小的电路板上塞满了这么多功能。\n如果你用过PI 4，你就知道CM4在性能上会得到什么。但是如果你使用的是Compute Module 3+或更老的版本，由于几个不同的原因，Compute Module 4在性能上有了巨大的飞跃。\n首先，CPU时钟从欠频的1.2 GHz增加到1.5 GHz。其次，CPU从Cortex A53升级到A72，这意味着即使在相同的时钟速度下，也会有更多的带宽、更多的缓存和全面更好的性能。\n但是不要轻信我的话。以下是计算模块版本之间的一些基准测试：\n这三个基准代表了一些需要良好的CPU性能才能正常运行的真实场景。在每种情况下，计算模块4的速度都是前3+的两倍。这甚至算不上是一场比赛。\n在实际使用中，比如浏览网页和玩游戏，两者之间的区别通常不会那么明显，但感觉上要快得多，而且每次我回到我的3+版时，我都会意识到性能差距有多大。\n有些人花了一些时间处理外部存储，并试图尽可能获得最佳的磁盘性能。但对于大多数考虑使用计算模块(尤其是嵌入式使用)的人来说，内置的eMMC提供了最划算的性能。\nPI工程师将eMMC总线从4位增加到8位，因此您可以从eMMC存储中获得更多带宽。我运行的基准测试确实显示了这一点：\nCM4上的随机IO速度是CM3上的两倍。顺序性能也是一种更好的方式。与我测试的最快的microSD卡相比，Compute Module 3的eMMC的顺序性能较慢，但CM4并驾齐驱，这意味着计算模块上的eMMC存储不再有任何折衷。\n由于随机IO对于大多数计算任务更加重要，这使得内置eMMC成为大多数人的最佳选择，特别是因为它使整个计算模块包变得很小，所以它几乎可以适用于任何地方。\n现在，如果你需要将新的操作系统闪存到eMMC上，这比用microSD卡做同样的事情要复杂一些，但多亏了Raspberry PI的usbboot实用程序，只要你手边有另一台电脑或PI，就不会太难。我将在后面的视频中介绍如何做到这一点。\n说到USB启动，从USB驱动器启动计算模块怎么样？毕竟，我做了一整篇关于如何用PI 4引导USB的文章。你能在计算模块上做到吗？嗯，是的，但是如果你想要USB 3.0的速度，你需要把一块PCIe USB适配卡放在单个PCI express插槽中，然后通过它插入你的驱动器。IO板上PI本身的端口仅为USB 2.0。\n但是，假设您使用的是USB3.0适配器，它在PI 4上的工作效果与PI4一样好。\n我真的很希望能够通过NVMe启动PI并以这种方式进行更多测试，但可惜这还不受支持，如果您使用Lite Compute Module尝试，PI只是漫无目的地坐在那里看着microSD，然后是USB，然后是microSD，永远：\n从技术上讲，你仍然可以从NVMe启动，但前提是你要把它放到USB3.0适配器上，插到USB3.0PCI适配器上……。但这与直接从NVMe驱动器启动不同，您会错过很多性能！\n我想检查的另一件事是计算模块作为NFS(网络文件系统)服务器的性能如何。我目前有一台2011年的旧Mac mini，我仍然在用它来存储数TB的旧视频文件和电脑备份，但它太旧了，苹果甚至不再支持它了。\n所以我想看看Compute Module在文件存储方面是否能比十年前的Mac mini更快，而且--剧透提醒--的确如此！\n在Mac mini上，我能获得的最快一致写入速度约为每秒35MB，这主要是因为驱动器都连接到了旧的USB2.0端口。在PI上，如果我写入外部USB3.0驱动器或NVMe驱动器，我可以通过网络以大约每秒70MB的速度写入(比旧的Mac mini快2倍)。\n现在，一台全新的Mac mini将使网络带宽饱和，每秒约为100MB，但那也至少要800美元，而要获得额外的每秒30MB，这是一笔很大的费用。\n好了，用史蒂夫·乔布斯(Steve Jobs)的话说，计算模块本身已经足够了，与之前所有的PI相比，它简直就是一个尖叫者。\nCompute Module 4 IO板也有一些新的诀窍。\n它不仅具有与旧IO板相同的所有分支和连接，还具有标准的PoE(以太网供电)支持，因此您可以通过以太网电缆为该板供电。\n我们已经覆盖了PCIe插槽，但就在它的正上方是一个可用于为附件供电的4针PSU连接器，以及一个可为风扇供电和控制风扇的4针风扇连接器。\n沿着底部，有一个12V的桶插头电源插孔。我正在使用此插孔通过通用TMEZON 12V 2A电源适配器为IO板供电。任何电源适配器只要在2A或更高电压下提供12V电压，并且具有2.1 mm X 5.5 mm桶插头，即可正常工作。\n然后还有一个用于Compute Module Lite版本的microSD卡插槽(该插槽在eMMC版本中根本无法识别)、两个USB 2.0端口(以及另外两个USB端口的接头)和RJ45网络插孔。\n它还具有两个全尺寸HDMI端口，因此您最多可以驱动两个外部显示器。\n有趣的是，它们都是全尺寸的，因为现在当我在PI项目之间切换时，我必须处理以下问题：\n去想一想吧！抱怨USB-C加密狗的人不必忍受测试多代树莓PI：)\n有一个内置的RTC或实时时钟，带有一个标准CR2032备用电池的插槽。\n还有一个标准的HAT(硬件连接在顶部)连接器，它允许您与PI的GPIO接口。它在与标准PI B模型相同的位置有安装孔，因此您可以在板的占地面积内安装帽子。最后，在侧面和顶部边缘有一些显示器和摄像头连接器，以及一组跳线，帮助您在刷新eMMC模块或禁用固件更新时提供帮助。\n对于IO板和计算模块板对板设计的缺点，我认为可以指出两点：第一，IO板非常大。我理解为什么，因为它支持CM4的所有功能，包括安装全尺寸PI帽子，但如果它占用的桌子空间少一点就好了，即使去掉了几个功能。\n其次，将两个100针的板对板连接器靠得很近会使连接和移除计算模块比正常情况下稍微复杂一些。您应该拉直向上，以分离模块，但它几乎是不可能做到的，除非你使用推土机。用你的手指，你必须先撬开一侧，然后模块就会弹出来。插上插头会容易一些，因为你可以用两边相等的压力向下推。\n还有很多其他的小细节我没有时间在这篇文章中传达，但我认为PI基金会在这个董事会上做得很好，考虑到形式因素和价格的限制。我敢肯定，保持新版本的起步价与旧版本相同是不小的壮举！\n我对Compute Module 4真的很满意。它兑现了原生PCIe支持的承诺，并采用了非常适合嵌入式系统的外形规格，具有一些很棒的新功能，如板载WiFi、蓝牙和以太网。\n.", "note_en": "Six years ago, the Raspberry Pi Foundation introduced the  Compute Module: a teensy-tiny version of the popular Raspberry Pi model B board.\n Between then and now, there have been multiple revisions to the Compute Module, like the 3+ I used in my  Raspberry Pi Cluster YouTube series, but they&#39;ve all had the same basic form factor and a very limited feature set.\n But today, that all changes with the fourth generation of the compute module, the  Compute Module 4! Here&#39;s a size comparison with the previous-generation Compute Module 3+, some other common Pi models, and an SD and microSD card (remember when the original Pi used a full-size SD card?):\n   I also posted a video review of the Compute Module 4, embedded below (scroll past it for the blog post version of the review):\n   The Compute Module 4 is basically a Raspberry Pi 4 model B, with all the ports cut off. Instead of the ports, you plug the Compute Module into another board with its special board-to-board connectors. But the Compute module has a few other tricks up its sleeve:\n Faster eMMC: It has optional onboard eMMC storage, which is now much faster than any microSD card I&#39;ve tested\n PCI Express: It drops the USB 3.0 interface for a PCI Express interface, meaning you can do some pretty cool things in lieu of having a couple USB 3.0 ports.\n WiFi and U.FL: It has an external antenna connector for it&#39;s wireless interface. What&#39;s that? Oh yes, there&#39;s now a version of the Compute Module with Bluetooth and WiFi!\n More Options: There are now  thirty two different Compute Module flavors to choose from, whether you want onboard WiFi or not, whether you want eMMC storage, or whether you want 1, 2, 4, or even  eight gigabytes of RAM!\n You can find all the details on the Raspberry Pi website, but here are the highlights:\n The cheapest CM4 is the Lite version with 1 GB of RAM, no wireless, and no onboard storage, and that&#39;ll run just $25.\n The most expensive, creme-de-la-creme version, with WiFi, Bluetooth, 8 GB of RAM, and 32 GB of faster eMMC storage, costs $90.\n But to use the Compute Module 4, you will either need to build your own board to integrate it, or buy the Pi Foundation&#39;s new  Compute Module 4 IO Board, which is an extra $35. This board turns your Compute Module 4 into a Pi 4 on steroids, because it has all the ports on a standard model B Pi and then some. The only thing lacking is built-in USB 3.0 ports, and that&#39;s one of the differences that made me do a double-take.\n I remember earlier this year,  Eben Upton mentioned in a podcast that the Raspberry Pi would someday have it&#39;s PCIe 1x interface exposed directly. And now it is!\n  You get this nice PCIe port on the IO board, and you can plug in any PCIe device, as long as it only uses &#39;one lane&#39; of capacity. For example, if you just want to have a couple USB 3.0 ports like you would on a model B, you can plug in an adapter like the  Syba USB 3.1 PCI express card I used:\n  Or... if you want to get bleeding-edge performance out of disk storage, pop in an NVMe adapter with an NVMe, and enjoy the fastest disk IO ever—at least on a Raspberry Pi:\n  I&#39;ll be posting a video on  my YouTube channel about all the new disk options on the Compute Module 4, so be sure to subscribe to my channel for that, but I&#39;ll talk about performance a little later in this post.\n  First, I want to talk a little bit about why the Compute Module is a complete redesign from past versions:\n A few of the things I noted in my  Turing Pi cluster review included the lack of enough power and board space to fit in all the features the Pi 4 crams into its small package, especially the un-throttled 1.5 GHz clock of the Pi 4&#39;s system on a chip.\n Also, because of the physical constraints of the DIMM form factor, it would&#39;ve been impossible (at least, according to my eyes) to include all the features like WiFi, with a built-in antenna, eMMC storage, and an ethernet controller chip.\n For all these reasons, and to make it easier to affix the Compute Module to different boards, a more specialized &#39;board to board&#39; connector was used. There are two of them, and they each have 100 pins, to connect power, IO, and the GPIO pins to the Compute Module:\n  One of the biggest changes from the CM3 plus and earlier is the CM4 now includes an onboard gigabit ethernet controller, so you can get the best network performance possible without a manufacturer having to include it on an external IO board or using an external adapter.\n  The headline feature, though, especially for me, is the PCIe slot. But to be clear, this is the smallest PCIe flavor, with just 1 &#39;lane&#39;, or &#39;1x&#39; bandwidth available. So, not to burst your bubble, but you won&#39;t be able to use an  Nvidia RTX 3080 on your Raspberry Pi. It still won&#39;t run your favorite PC game at 8K resolution and 240 fps.\n  But it  will run a lot of things. For starters, if you are in love with USB 3.0 and are sad to see it missing here, you can buy a USB 3 PCIe expansion card, but be sure it uses the VLI VL805 chipset, otherwise it might not be fully compatible with Raspberry Pi OS and you&#39;ll get stuck with USB 2.0 speeds.\n I actually bought  three different PCIe USB 3.0 cards to see how they worked, and two of the three didn&#39;t provide USB 3.0 throughput for most of my devices. They kept mounting drives at USB 2.0 speeds, which was very annoying.\n  (From left to right:) The first was a generic &#34;PCI-Experss&#34; card from  A ADWITS—and no, I that&#39;s not a typo, that&#39;s how it&#39;s spelled on the box—has the VL805 chip in it, but it only mounted a couple of my USB 3.0 drives at that rate. The others, like the fastest one I&#39;ve tested on a Pi 4, mounted as a USB 2.0 device, and was very slow, but worked fine otherwise.\n I had higher hopes for the  2 port Inateck card, but was nervous about the Fresco Logic chip on it. As it turns out, it had similar issues, where it would mount some drives at USB 3.0 speeds  sometimes, but not always.\n The best USB 3.0 card I tested was the  Syba SD-PEX20199, and it even includes a USB Type-C slot! It mounted all my devices at USB 3.0 speeds, and worked perfectly with the Raspberry Pi. Just be careful plugging in power-hungry devices; it can only put through a little power since it shares the 12v power supply with the IO board itself!\n  The thing I was most excited about was NVMe support. I had to find out if an NVMe drive attached directly to the Raspberry Pi&#39;s PCIe bus would be faster than one connected through a USB 3.0 slot.\n So I plugged my  XPG SX6000 drive into  this PCIe to NVMe adapter and... nothing.\n  I should note here that NVMe support is  not enabled out of the box on Raspberry Pi OS. You have to run the command  modprobe nvme-core and then reboot to enable the NVMe kernel module.\n Anyways, I could use the command  lspci and see the NVMe controller from Realtek was at least recognized, but the drive itself wouldn&#39;t show up, and I found some weird errors in the system&#39;s logs using  dmesg:\n  So I bought another spare NVMe drive for testing, the  Samsung 970 EVO Plus, which is a bit more expensive than the XPG drive. I popped it in the adapter, and booted the Pi.\n Bingo! I was able to see the device using  lsblk, so I formatted it and mounted it for testing.\n And let me tell you, it is  fast. You&#39;re hearing it here, first. The Raspberry Pi Compute Module 4 offers the fastest disk IO of any Raspberry Pi yet.\n   You can see the performance of USB 3.0 or NVMe drives is far beyond that of onboard eMMC or microSD cards. SSDs are incredibly fast for sequential writes for large files, but what really sets this Pi apart is the ability to get native NVMe performance, which more than doubles the 4K performance over a USB 3.0-attached drive—check out that 4K random write speed!\n Sadly, you can&#39;t use an NVMe drive as a boot volume, at least not yet. I think it would be awesome if I could use a few Lite CM4s with NVMe drives in a tiny cluster that would absolutely knock the socks off the  Turing Pi cluster I built earlier this year.\n Speaking of, I heard from  Turing Machines that they  do plan on building a new &#39;version 2&#39; board with full support for the Compute Module 4, and I can&#39;t wait to see how it turns out!\n  All right, so you can get USB or NVMe over the PCIe bus, but what about upgraded video cards?\n Well, there  are some slower PCI video cards that work with just a 1x bus, but most of them either have no drivers for Linux (so they wouldn&#39;t work with Raspberry Pi OS), or if they  do have Linux drivers, the drivers are only available for &#39;x86&#39; processors. The Pi uses an &#39;arm&#39; processor, which would not work with the x86 drivers.\n Anyways, in all my searching, I could only find  one PCI video card that seems like it would be hardware-compatible with the Compute Module 4, the  ZOTAC GeForce GT 710. Note that I said  hardware compatible. The graphics chip has Linux drivers, but only for X86. There might be a way to get it running, but I&#39;m not sure. What do you think? Leave a comment if you want me to try to buy one of these cards and test it out on the Pi!\n  There are a number of other adapters you can get for PCIe, including SATA adapters for hard drives and SSDs, sound cards, printer ports, network adapters, and even old parallel port adapters! The most important thing to look at is whether the card has Linux support. Some things are supported out of the box, but for other things, you need to install a driver, and it has to be compatible with not only  Linux, but also the ARM processor architecture.\n  The other headline feature compared to the older Compute Modules is the inclusion of onboard WiFi  and Gigabit Ethernet. You can choose whether to get Wifi and Bluetooth, but all versions come with gigabit ethernet built in, courtesy of this little Broadcom chip:\n  The CM4 performs just as well as a Pi 4 model B in my testing.\n  The wired network gets 942 Mbps, which is about as fast as I&#39;ve seen on my home gigabit network, and it&#39;s infinitely faster than the older Compute Module boards—which have no onboard networking at all! Even with the Turing Pi cluster board, it only gave you 100 Mbps per Compute Module, so this alone is a HUGE improvement.\n And wireless, which is also not available at all on older Compute Module versions, gets up to 80 Mbps on my home 802.11ac network. Now, here&#39;s where it gets a little more interesting. The CM4 is the first Pi of any type to offer a  U.FL antenna connector. Because many people who integrate the CM4 into a device may put it inside a metal enclosure, if they want WiFi to work, they need to attach an external antenna.\n The Pi Foundation will sell you a certified antenna you can plug into this tiny connector, and that antenna can then be mounted somewhere to allow the Pi to still get a solid WiFi connection.\n  But  technically (and you didn&#39;t hear this from me!), you could grab any standard U.FL antenna like the  Highfine U.FL antenna I have, and use it.\n To enable the antenna connector (and disable the built-in PCB antenna), you need to edit the  /boot/config.txt file on your Pi, and add the following line, then reboot the Pi:\n  I did some testing with this antenna just to compare the tiny built in triangle antenna on the PCB, and the results surprised me.\n  With the built-in PCB antenna, the signal level was -43 dBm (measured with  cat /proc/net/wireless), with a quality rating of 67/70 (measured with  iwlist wlan0 scanning). And that&#39;s pretty respectable, even though my router is only about 20 feet away. With the external antenna, I could get -40 dBm (with a quality rating of 70/70), but that was only after I adjusted its position a bit to get the best possible signal.\n If I unplugged the antenna, the signal was terrible, at -74 dBm with a quality of 36/70, and it could only do about 6 Mbps. So the onboard antenna is a great design—as long you&#39;re not enclosing the Pi in a metal box or faraday cage!\n So for both wireless and wired networking, the CM4 is on par with the regular Pi 4, and far beyond the capability of earlier Compute Modules—it surprised me how much functionality is crammed into such a tiny board.\n  If you&#39;ve used the Pi 4, you know what you&#39;ll be getting with the CM4, performance-wise. But if you used the Compute Module 3+ or an older version, the Compute Module 4 is a huge leap in performance, for a few different reasons.\n First, the CPU clock was increased from an underclocked 1.2 GHz to 1.5 GHz. Second, the CPU is upgrade from a Cortex A53 to an A72, and that means there&#39;s more bandwidth, more caches, and all-around better performance even at the same clock speeds.\n But don&#39;t take my word for it. Here are some benchmarks between the Compute Module versions:\n  These three benchmarks represent some real-world scenarios that require good CPU performance to run well. In every case, the Compute Module 4 is  twice as fast as the previous 3+. It&#39;s barely even a contest.\n In real-world use, for things like web browsing and playing games, the difference isn&#39;t usually as stark, but it does feel a lot faster, and every time I go back to my 3+ I realize how big the performance gap is.\n   Some people spend a bit of time working with external storage and try to get the best disk performance possible. But for most people considering the Compute Module (especially for embedded use), the built-in eMMC offers the best performance for the dollar.\n The Pi engineers increased the eMMC bus from 4 bits to  8 bits, so you can get more bandwidth out of the eMMC storage. And it really shows in the benchmarks I ran:\n  Random IO is  twice as fast on the CM4 than it was on the CM3. And sequential performance is a way better too. The Compute Module 3&#39;s eMMC had slower sequential performance than the fastest microSD cards I tested, but the CM4 is neck-in-neck, meaning there are no tradeoffs with eMMC storage on the Compute Module anymore.\n And since random IO is more important for most computing tasks, that makes built-in eMMC the best option for most people, especially since it keeps the whole compute module package tiny, so it&#39;ll fit almost anywhere.\n Now, if you need to flash a new OS to the eMMC, it&#39;s a little more complicated than doing the same thing with a microSD card, but thanks to Raspberry Pi&#39;s   usbboot utility, it&#39;s not too hard as long as you have another computer or Pi handy. I&#39;ll cover how to do that in a later video.\n  Speaking of USB boot, what about booting the Compute Module from a USB drive? After all, I did a  whole post on how to USB boot with the Pi 4. Can you do it on the Compute Module? Well, yes, but if you want USB 3.0 speeds, you&#39;ll need to drop a PCIe USB adapter card in the single PCI express slot and plug in your drive through that. The ports from the Pi itself on the IO board are USB 2.0 only.\n But it works just as well as on the Pi 4, assuming you use a USB 3.0 adapter.\n I was  really hoping to be able to boot the Pi off an NVMe and do some more testing that way, but alas that is not yet supported, and if you try it with a Lite Compute Module, the Pi just sits there looking aimlessly at microSD, then USB, then microSD, forever:\n  Technically you can still boot off an NVMe, but only if you put it in a USB 3.0 adapter, plugged into a USB 3.0 PCI adapter... but that&#39;s not the same as booting directly off an NVMe drive and you miss out on a lot of performance!\n  One other thing I wanted to check is how well the Compute Module performs as an NFS (Networked File System) server. I currently have an old 2011 Mac mini that I still use to store many terabytes of old video files and backups of my computers, but it&#39;s so old it&#39;s not even supported by Apple anymore.\n So I wanted to see if the Compute Module could be faster than the ten-year-old Mac mini for file storage, and—spoiler alert—it is!\n  On the Mac mini, the fastest consistent write speed I could get is around 35 MB per second, mostly because the drives are all attached to old USB 2.0 ports. On the Pi, if I wrote to either an external USB 3.0 drive or an NVMe drive, I could write over the network at about 70 MB per second (2x faster than the old Mac mini).\n Now, a  brand new Mac mini would saturate the network&#39;s bandwidth and give me somewhere around 100 MB per second, but that would also cost at least $800, and that&#39;s a lot to pay to get that extra 30 MB per second.\n  All right, so enough of the Compute Module itself, it is, to put it in the words of Steve Jobs, a &#39;screamer&#39; compared to all the previous Pis.\n   The Compute Module 4 IO board has a few new tricks up its sleeve, too.\n Not only does it have all the same breakouts and connections that the old IO board had, it also has PoE (Power over Ethernet) support included standard, so you can power the board from an Ethernet cable.\n We&#39;ve already covered the PCIe slot, but right above it is a 4-pin PSU connector that can be used to provide power to accessories, as well as a 4-pin fan connector that can power and control a fan.\n Down along the bottom, there&#39;s a 12v barrel plug power jack. I&#39;m using this jack to power the IO board using a generic  TMEZON 12v 2A power adapter. Any power adapter should work as long as it supplies 12v at 2A or more, and has a 2.1mm X 5.5mm barrel plug.\n Then there&#39;s a microSD card slot for use with the Compute Module Lite version (the slot isn&#39;t recognized at all for eMMC versions), two USB 2.0 ports (along with a header for two more USB ports), and the RJ45 network jack.\n It also has two full-size HDMI ports so you can drive up to two external displays.\n  It&#39;s interesting that they&#39;re  full-size, because now when I&#39;m switching between my Pi projects I have to deal with the following:\n  Go figure! People who complain about USB-C dongles have not had to put up with testing multiple generations of Raspberry Pi :)\n There&#39;s a built in RTC, or Real-Time Clock, with a slot for a standard CR2032 backup battery.\n And there&#39;s a standard HAT (&#39;Hardware Attached on Top&#39;) connector, and it allows you to interface with the Pi&#39;s GPIO. It has mounting holes in the same place as a standard Pi B model, so you can mount HATs within the board&#39;s footprint. And finally there are some display and camera connectors along the side and top edge, along with a set of jumpers to help when flashing an eMMC module or to disable firmware updates.\n There are two things I think I could call out as downsides to the IO board and Compute Module board-to-board designs: first, the IO board is pretty large. I understand why, since it support  every feature of the CM4, including mounting full-size Pi HATs, but it would be nice if it took up a little less desk space even if a few features were dropped.\n Second, having two 100 pin board-to-board connectors close together makes attaching and removing the Compute Module a slight bit more tricky than it should be. You&#39;re  supposed to pull straight up to detach the module, but it&#39;s pretty much impossible to do that unless you use spudgers. With your fingers, you kind of have to pry up one side first, and then the module pops out. Plugging it in is a little easier, since you can just push down with equal pressure on both sides.\n  There are a ton of other little details that I haven&#39;t had time to convey in this post, but I think the Pi Foundation did a great job with this board, given the constraints of the form factor and price. I&#39;m sure keeping the new version starting at the same price as the old version was no small feat!\n  I&#39;m really happy with the Compute Module 4. It delivers on the promise of native PCIe support, and uses a form factor that will fit well into embedded systems, with some great new features like onboard WiFi, Bluetooth, and Etherne\n......", "posttime": "2020-10-19 20:56:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,模块,pi", "title": "树莓派计算模块4述评", "title_en": "The Raspberry Pi Compute Module 4 Review", "transed": 1, "url": "https://www.jeffgeerling.com/blog/2020/raspberry-pi-compute-module-4-review", "via": "", "real_tags": ["模块", "pi"]}, {"category": "", "categoryclass": "", "imagename": "e53752bd18d47c7f19ff44e8b34448be.jpg", "infoid": 1029787, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我经常遇到关于如何开始编程的问题。人们渴望学习，但不知道从哪里开始，也不知道走哪条路。如今，由于存在许多不同的领域，如Web开发、移动软件开发、游戏开发等，这一点变得更加困难。\n虽然我们生活在一个教程和课程丰富的时代，但其中很多可能会让人感到不堪重负。您需要的是导航主题的路线图。你想要一个结构来指导你的学习。许多编码训练营遵循与大学课程类似的方法。完成这些课程是令人沮丧的，因为你觉得你没有足够快地学到任何实质性的东西。如果你的目标是获得证书或学位，大学课程是很棒的。如果您的目标是学习软件工程的实践技能，那么它们不是很好。\n以下是我整理的路线图，帮助您指导自己学习如何编程。您在这方面的经验将取决于您当前的编码经验。不过，这些天来，我预计很多人都接触过非常基本的编码概念，如循环、if语句等。在这些概念上花费更多时间可能是不值得的。你想要的是一张路线图，让你踏上建设事业的道路。\n正如我已经提到的，您可以关注软件开发的许多不同领域。我推荐从Web开发开始，因为它有最快的反馈循环。这将帮助您快速提高，快速学习各种概念。这里学到的原则可以应用到您可能感兴趣的其他领域，例如移动应用程序开发或游戏开发。\n在学习Web应用程序编程时，您需要学习HTML、CSS和Javascript。这些是构建Web应用程序的核心语言。但是您想要花更多的时间和精力在后端服务器系统上。后端系统负责提供支持您的应用程序的数据API。您学习的构建良好的后端系统的原则将为您提供坚实的软件工程基础。\n对于后端，您将主要使用PHP、Python、Java或Ruby。挑一个你觉得舒服的。我建议从Python或Ruby开始。\n有效学习的关键原则之一是首先注重深度。与其在各个主题中学习很多概念，我建议深入到一个特定的领域。在这种情况下，我建议首先专注于构建简单的端到端应用程序。\n您将大致了解从头开始构建某个东西是什么样子。更重要的是，拥有一个可以工作的应用程序会让你感觉很棒。进步带来的满足感将激励和推动你前进。\n在这一点上，您已经准备好解包并更深入地研究您所构建的内容的各个方面。\n请查看我的详细入门指南，了解有关构建第一个Web应用程序的逐步过程的更多信息。\n一旦您构建了一个端到端的应用程序，您会发现学习几个框架和库就足以让您继续前进。大多数编码训练营都止步于此。但这并没有深入到更丰富、更有回报的软件工程世界。\n我建议您花时间学习软件设计原则、面向对象编程和各种系统架构模式。您将学习如何干净而有效地使用数据库，如何组织代码以支持更复杂的系统、不同的设计模式和体系结构的详细信息。\n算法在软件工程中的重要性可能会引起令人惊讶的争议。这可能是因为硅谷的科技公司在面试过程中依赖他们。诚然，许多专业软件开发人员从来不会回顾他们在大学里模糊地学到的算法。\n真够倒霉的。现实情况是，如果您想要在最高级别的软件工程师中脱颖而出，对算法的深入了解就像软件体系结构一样是基本要求。\n我希望这份路线图能让您对学习编程和开始软件工程职业生涯所关注的各个方面有所了解。我没有在这里提供一个时间估计，因为你的进度会有所不同。学习新的和复杂的东西需要时间。如果你坚持下去，另一边就会有一份有价值的职业在等着你。\n注册以接收关于学习如何成为软件工程师的独家更新和想法。\n哎哟！出现错误，我们无法处理您的订阅。请重新加载页面，然后重试。\n嘿，我在reddit上看到你的帖子了，在那里留言有点困难。所以我有个问题和…有点相关。\n我刚刚用Python完成了MIT600.x到CP的入门课程，在edX上完成了哈佛CS50到CP的入门课程。我有时间吃这些药，因为过去几个月我一直失业(餐饮服务)。现在，我正在考虑如何在学习更多编程技能的同时，选择一条职业道路，以及如何支付房租/养活自己。在接下来的几个月里，我可以做些什么来获得一份与编程/计算机相关的工作？我应该去参加一个看起来相当密集的训练营，还是只继续参加edX/免费课程？\n我之所以这样问，是因为我认为，随着越来越多的食品相关企业倒闭，我以前的技能(人类学学士和多年的烹饪经验)不再能让我养活自己。显然，编程在短期内不会有任何进展，而且看起来是一个很好的职业机会。现在任何建议都是很好的。我知道刚上完入门课我找不到任何工作，但我确实需要过渡到与计算机相关的领域，我只是好奇你会给像我这样的人什么样的建议。\n您在第一段中提到，我们应该关注诸如Python和Ruby这样的后端系统。那么你是说像Django和Flask这样的框架吗？我最近一直在自学MERN堆栈，但我觉得为了找工作，我的武器库里需要有蟒蛇。我想彻底学习完MERN堆栈，因为我不知道还能学些什么，但是你有更好的推荐吗？", "note_en": "I come across questions on how to get started in programming often. People are hungry to learn, but don’t know where to start or which path to take. This is made even more difficult these days due to a lot of different areas that exist, such as web development, mobile software development, game development etc.\n Although we live at a time when tutorials and lessons are abundant, a lot of it can feel overwhelming. What you need is a roadmap to navigate the topics. You want a structure to guide you in your learning. A lot of coding bootcamps follow an approach similar to a college curriculum. Working through these curriculums is frustrating because you don’t feel like you are learning anything substantial quickly enough. College curriculum is great if your goal is to get a certificate or a degree. They are not great if your goal is to learn the practical skills of software engineering.\n Following is a roadmap that I have put together to help you guide yourself in learning how to program. Your mileage with this will depend on your current experience with coding. These days though, I expect a lot of people to have had some exposure to very basic coding concepts such as loops, if statements etc. Spending any more time on these concepts may not be worthwhile. What you want is a road map that gets you on your way to building things.\n   As I had mentioned, there are many different areas of software development that you could focus on. I recommend starting with Web Development because it has the quickest feedback loop. This will help you improve fast and learn various concepts quickly. Principles learnt here can then be applied to other areas that you may be interested in such as mobile app development or game development.\n When learning web app programming, you will be required to pick up HTML, CSS and Javascript. These are core languages for building web apps. But what you want to spend more time and focus on is the backend server system. The backend systems are responsible for providing the data APIs that support your application. Principles that you learn building good backend systems will provide you with a strong software engineering foundation.\n For the backend, you will primarily work with either PHP, Python, Java or Ruby. Pick any one that you feel comfortable with. I recommend Python or Ruby to start.\n  One of the key principles for effective learning is to focus on depth first. Instead of learning a lot of concepts across the breadth of the topics, I recommend going deep into one specific area. In this case, I suggest focusing on building a simple end-to-end application first.\n You will get a general idea of what it is like to build something from scratch. More importantly, you will feel great having a built a working app. The feeling of satisfaction from the progress will motivate and propel you forward.\n At this point you are ready to unpack and dive deeper into various aspects of what you have built.\n Checkout my detailed  Beginner’s Guide to learn more about the step-by-step process of building your first web application.\n   Once you have built an end-to-end app you will find that learning a couple of frameworks and libraries will be enough to keep you going. Most coding bootcamps stop here. But this stops short of diving into the richer and more rewarding world of software engineering.\n I recommend spending time learning software design principles, object oriented programming and various systems architecture patterns. You will learn the details of how to cleanly and effectively work with databases, how to structure your code to enable more complex systems, different design patterns and architectures.\n     The importance of algorithms in software engineering can be surprisingly controversial. This is perhaps due to Silicon Valley tech companies relying on them in the interview process. It’s true that many professional software developers never look back at the algorithms that they vaguely learn in college.\n That’s unfortunate. The reality is that deep knowledge of algorithms, just like software architecture are foundational requirements if you want to excel as a software engineer at the highest level.\n   I hope this roadmap gives you some sense of the various aspects that you can focus on to learn programming and launch a career in software engineering. I have not provided a time estimate here since your progress will vary. Learning something new and complex takes time. If you stick with it, a rewarding career is waiting for you on the other side.\n  Sign up to receive exclusive updates and thoughts on learning how to become a Software Engineer.\n Whoops! There was an error and we couldn’t process your subscription. Please reload the page and try again.\n Hey, I saw your post on reddit and was having trouble leaving a comment there. So I have a question that is somewhat related…\n I have just finished MIT600.x Intro to CP with Python, and Harvard CS50 Intro to CP courses on edx. I had time to take these because I’ve been unemployed (food service) for the last couple of months. Now I am thinking to a career path and how to pay rent/feed myself while I pick up more programming skills. What can I do to get a programming/compute related job within the next few months? Should I go for a bootcamp which look pretty intensive, or just continue with edx/free courses?\n I ask because I don’t think my previous skills (BA in anthropology and years of cooking) will allow me to support myself anymore as more and more food related businesses close. Clearly programming isn’t going anywhere anytime soon and seems like a good career opportunity. Any advice would be great right now. I know I can’t get any jobs with just having finished Intro classes, but I do need to transition to the computer related field and am just curious what kind of advice you would give to someone like me.\n  You mentioned in the first paragraph that we should focus on back-end systems such as Python and Ruby. So do you mean frameworks like Django and Flask? I have currently been teaching myself MERN stack, but feel like I need to have python in my arsenal for the job hunt. I want to finish learning MERN stack completely because I don’t know what else to learn, but do you have better recommendations?", "posttime": "2020-10-19 20:54:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,软件,programming,软件工程师,学习", "title": "如何学习编程：成为软件工程师的路线图", "title_en": "How to Learn Programming: A Roadmap for Becoming a Software Engineer", "transed": 1, "url": "https://makingsmallercircles.com/articles/how-to-learn-programming-a-roadmap-for-success/", "via": "", "real_tags": ["编程", "软件", "软件工程师", "学习"]}, {"category": "", "categoryclass": "", "imagename": "b750b12e4d4a8de45c58d3ec91625730.jpg", "infoid": 1029785, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年，随着对女性创始人的资助降至2017年的水平，芬扎格意识到，为什么加速器(包括她的加速器)对女性的效果可能不如对男性的效果那么好：演示日(Demo Day)。在大多数加速器中，演示日是一个常见的高潮活动，创始人在一个房间里向投资者、天使和记者推销，希望筹集一轮资金，并获得一些报道。\nFeinzaig继续说：“事实是，你不会基于一个5分钟的、高度照本宣科的、经过打磨和练习的舞台投球来筹集一轮资金。”“你可以在任何时间、任何情况下向任何人推销你的初创公司，并让他们足够兴奋，想要参与你的旅程，这样才能提高你的创业热情。”\n因此，Feinzaig说，“啊哈时刻”导致了Ready，Set，Raise改变了将持续8周的节目，更多地关注由数百名女性审查的“现实的筹款过程”。\n冠状病毒影响了加速器的工作方式，Y Combinator和Techstar搬到了现场，虚拟编程，有机会让父母或一年中有三个月不能搬到帕洛阿尔托的人更容易获得。尽管如此，Y Combinator的最新一批公司的多样性有所下降，只有16%的公司的创始人是女性。在前一批公司中，近21%的公司创始人身份为女性。\n访问量的下降使得Feinzaig的工作变得更加困难和重要。今年，随着Ready、Set、Raise的申请蜂拥而至，Feinzaig注意到，比往常更多的成熟公司提出了申请。这一细节导致创始人对女性创始人进行了调查，发现在疫情爆发前有创业抱负的女性现在不太可能这样做。尽管如此，她还是很乐观，她说，他们看到她的加速器比以往任何时候都有“最高水平的申请者”。\n今天，Ready Set Raise宣布了它的第三批合作伙伴，包括一家将销售户外设备的零售商数字化的初创公司，一个道德和法律数据交换的市场，以及一个将黑人女性与具有文化意识的供应商联系起来的数字平台。\n下面我们来看看Ready，Set，Raise的第三批初创公司：\nBleatly：由Laura Wittig和Liza Moiseeva创立的Bleatly是一家将商业、内容和社区相结合的初创公司，目标是扩大有意识的消费主义。它的总部设在华盛顿州的西雅图。\n由加布里埃拉·特鲁巴(Gabriela Trueba)创立的WOMP希望帮助任何人探索、创造和分享3D。它的总部设在纽约州布鲁克林。\nFixFake：由凯瑟琳·哈里森(Kathryn Harrison)和杰森·劳(Jason Law)创立的FixFake提供决策支持工具，以减少电子商务中的欺诈行为。它的总部设在密苏里州博兹曼。\n待定健康：由Stephanie Estey，Daphne Chen和Sherwin Lu创立的待定健康是一个针对女性的居家性传播感染筛查平台。它的总部设在纽约州的纽约。\nGearo：由贾斯汀·巴龙(Justine Barone)创立的Gearo将户外零售商的运营数字化，并吸引探险者作为客户。它的总部设在科罗拉多州丹佛市。\n玛丽·路易丝化妆品：玛丽·路易丝化妆品由阿基拉·雷福德创立，销售天然护肤品和个人护理产品。它的总部设在加利福尼亚州洛杉矶。\nDataacy：由首席执行官Paroma Indio和Kaleb Wilson创建的Datacy是一个专注于促进道德和法律数据交换的市场。它的总部设在加利福尼亚州的圣何塞。\n健康：由Ashlee Wisdom和Eddwina Bright创立，该公司是一个数字平台，将黑人女性与有文化能力的提供者联系起来。它的总部设在纽约州的纽约。\n课程将于10月19日开始。会员将接受各种合作伙伴的指导，包括Cooley LLP、Carta、蚱蜢Bank、Madrona Venture Group、UPS和Zendesk for Startups。", "note_en": "This year,  as funding for female founders drops to 2017 levels, Feinzaig realized why accelerators, hers included, might not work for women as well as they work for men: demo day. A common culminating event in most accelerators, demo day is an event where founders pitch to a room to investors, angels, and journalists with the hope of raising a round and landing some coverage.\n “The truth is, you don’t raise a round based on a 5-minute, highly scripted, polished and practiced on-stage pitch,” Feinzaig continued. “You raise it by being able to pitch your startup to any person, at any time, in any context, and get them excited enough to want to participate in your journey.”\n  So, Feinzaig says the “aha moment” led to Ready, Set, Raise changing its programming, which will run 8-weeks, to be more focused on a “realistic fundraising process” vetted by hundreds of women.\n The coronavirus has  impacted the way that accelerators work, Y Combinator and Techstars moved to live, virtual programming, which has the opportunity to be more accessible to parents or people who cannot relocate to Palo Alto for three months out of the year. That said,  Y Combinator’s   latest batch had a  drop in diversity, with only 16% of the companies having a founder who identified as female. In the previous batch, nearly 21% of companies had a founder who identified as female.\n The drop in access makes Feinzaig’s work even more difficult, and important. This year, as applications rolled in for Ready, Set, Raise, Feinzaig noticed that more mature companies were applying than usual. The detail led to the founder surveying female founders and discovering that women who had the ambition to start a company before the pandemic, are  less likely to do so now. Still, she’s optimistic, saying that they saw the “highest caliber of applicants” to her accelerator than ever before.\n Today, Ready Set Raise announced its third cohort, including a  startup that digitizes retailers which sell outdoor equipment,  a marketplace for ethical and legal data exchange, and a  digital platform that connects Black women to culturally-aware providers.\n Here’s a look at Ready, Set, Raise’s third cohort of startups:\n ●  Brightly: Founded by Laura Wittig and Liza Moiseeva, Brightly is a startup that combines commerce, content, and community with the goal of scaling conscious consumerism. It is based in Seattle, WA.\n ●  Womp.ai: Founded by Gabriela Trueba, Womp wants to help anyone explore, create, and share 3D. It is based in Brooklyn, NY\n ●  FixFake: Founded by Kathryn Harrison and Jason Law, FixFake offers decision support tools to reduce fraud in e-commerce. It is based in Bozeman, MT\n ●  tbd health: Founded by Stephanie Estey, Daphne Chen, and Sherwin Lu, tbd health is an at-home, STI screening platform made for women. It is based in New York, NY.\n ●  Gearo: Founded by Justine Barone, Gearo digitizes outdoor retailer operations and brings in adventure-seekers as customers. It is based in Denver, CO\n ●  Mary Louise Cosmetics: Founded by Akilah Releford, Mary Louise Cosmetics sells natural skincare and personal care products. It is based in Los Angeles, CA\n ●  datacy: Founded by CEO Paroma Indilo and Kaleb Wilson, Datacy is a marketplace focused on enabling ethical and legal data exchange. It is based in San Jose, CA.\n ●  Health In Her HUE: Founded by Ashlee Wisdom and Eddwina Bright, the company is a digital platform connecting Black women to culturally competent providers. It is based in New York, NY.\n The class will begin October 19th. Members will receive coaching from a variety of partners including Cooley LLP, Carta, Grasshopper Bank, Madrona Venture Group, UPS and Zendesk for Startups.", "posttime": "2020-10-19 20:38:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "set,women,创立", "title": "\nReady，Set，Raise，一个由女性建造的女性加速器，宣布三等舱", "title_en": "\n\t\t\t\tReady, Set, Raise, an accelerator for women built by women, announces third class\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/19/ready-set-raise-an-accelerator-for-women-third-class/", "via": "", "real_tags": ["set", "women", "创立"]}, {"category": "", "categoryclass": "", "imagename": "d00aa14dda74e1582feed95722575bca.jpg", "infoid": 1029784, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "报道还提到了S21系列的1月发布日期，Android Central可以独立证实这一点。\n即将推出的三星Galaxy S21(又名。(Galaxy S30)正纷至沓来。最近有传言称Galaxy S21比以往任何时候都更早进入批量生产，泄密者史蒂夫·海默斯托弗在他的语音页面上透露了Galaxy S21的设计。Hemmerstoffer也被称为@OnLeaks，他发表了一份S21的CAD渲染图，它有6.2英寸的显示屏，打孔式自拍摄像头，比Galaxy S20的边框更均匀。这些类型的渲染在过去已经被证明是准确的，Hemmerstoffer有着坚实的记录。\n在Galaxy S21的背面，有一个新型的相机模块，似乎是从手机的外框延伸出来的。尺寸为151.7 x 71.2x 7.9 mm(或相机凸块为9.0 mm)，这使得S30比S20略宽，但在其他尺寸上与其前身非常接近。\n在另一起泄密事件中，Hemmerstoffer发布了据称是更大的旗舰机型Galaxy S21 Ultra的渲染。与S20和Note 20 Ultras一样，这款手机的显示屏更大，背面有一个按喇叭的摄像头凸块，还有四个传感器，一个激光自动对焦模块和一个闪光灯。\n他表示，与普通的S21不同，Ultra的显示屏略有弯曲，尽管没有该公司2020年的产品阵容那么严酷。至于尺寸，他得到的数字是：165.1 x 75.6x 8.9 mm，如果算上相机凸块，厚度是10.8 mm。相比之下，S20Ultra的尺寸是166.9 x 76 x 8.8 mm，所以预计S21 Ultra会变得更小。\n最后，泄露的消息表明，S21没有像之前的传言所说的那样为S Pen设置隔间，但它可能支持三星的S Pen，可以单独购买，或者最好是盒装的，供想要的人购买。\nHemmerstoffer表示，Galaxy S旗舰手机的到货时间比以往任何时候都要早，特别是在2021年1月。Android Central可以从我们自己的消息来源独立确认，下一代Galaxy S旗舰目前计划在1月份发布。我们目前还不清楚是否会有一款中端的Galaxy S21 Plus。\nGalaxy S21将于明年1月上市，苹果高端iPhone 12 Pro Max将于11月中旬首次亮相，苹果和三星的旗舰产品将比以往任何时候都更加紧密地联系在一起。虽然节后这段时间通常不被认为是在西方发布新产品的好时机，但三星可能希望利用竞争对手2020年的手机延迟发布的机会，提前发布这款手机。", "note_en": "The report also mentions a January launch date for the S21 series, which  Android Central can independently confirm.\n Leaks around the upcoming  Samsung Galaxy S21 (a.k.a. Galaxy S30) are coming thick and fast. Following  recent rumors of the phones entering mass-production earlier than ever, leaker Steve Hemmerstoffer has revealed the design of the Galaxy S21 on his  Voice page. Hemmerstoffer, who also goes by  @OnLeaks,  published CAD renders of an S21 with a 6.2-inch display, hole-punch selfie camera and more uniform bezels than the  Galaxy S20. These kinds of renders have proven to be accurate in the past, and Hemmerstoffer has a solid track record.\n  Around the back of the Galaxy S21, there&#39;s a new-style camera module that seems to extend from the phone&#39;s outer frame. Dimensions are quoted as being 151.7 x 71.2 x 7.9mm (or 9.0mm with the camera bump), making the S30 slightly wider than the S20, but otherwise very close in size to its predecessor.\n  In  a separate leak, Hemmerstoffer released purported renders of the larger flagship Galaxy S21 Ultra. Like the S20 and Note 20 Ultras, this one has a larger display and a honking camera bump on the back, along with four sensors, a laser autofocus module, and a flash.\n  He suggests that unlike the regular S21, the Ultra has a slightly curved display, though not nearly as severe as the company&#39;s 2020 lineup. As for dimensions, he&#39;s got numbers: 165.1 x 75.6 x 8.9mm, or 10.8mm thick when the camera bump is included. For comparison, the S20 Ultra measures 166.9 x 76 x 8.8 mm, so expect the S21 ultra to be ever-so-smaller.\n Finally, the leak suggests that the S21 doesn&#39;t have a compartment for the S Pen as previous rumors have suggested, but that it may  support Samsung&#39;s S Pen, which could be purchased separately or, ideally, come in the box for people who want it.\n Hemmerstoffer says the phones are due to arrive earlier than ever for a Galaxy S flagship, specifically in January of 2021.  Android Central can independently confirm from our own sources that the next Galaxy S flagships are currently slated to launch in January. We&#39;re unclear at this point if there&#39;s going to be a middle-of-the-line Galaxy S21 Plus.\n A January arrival for the Galaxy S21, combined with a mid-November debut for Apple&#39;s top-end  iPhone 12 Pro Max, would see the Apple and Samsung flagships launching closer together than ever before. While the immediate post-holiday period isn&#39;t typically seen as a great time to launch new products in the West, Samsung may be looking to capitalize on delays to its rival&#39;s 2020 handsets with this earlier launch.", "posttime": "2020-10-19 20:37:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "标准版,standard,s21", "title": "消息来源：三星下一代Galaxy S旗舰机型S21/S30将于2021年1月推出标准版、Plus版和Ultra版三款新机型", "title_en": "Sources: Samsung's next Galaxy S flagships, the S21/S30, will be launched in January 2021 in three new models, a standard, a Plus, and an Ultra", "transed": 1, "url": "https://www.androidcentral.com/samsung-galaxy-s30-leaked-full-january-2021-launch-confimed", "via": "", "real_tags": ["标准版", "standard", "s21"]}, {"category": "", "categoryclass": "", "imagename": "64d5b20d0c02c6cf4c60d5e10f59d081.png", "infoid": 1029783, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在复数世界中，当我们积分三角表达式时，我们很可能会遇到所谓的欧拉公式。\n这个强大的方程式以传奇数学家莱昂哈德·欧拉的名字命名，值得更仔细地研究-以便我们充分利用它的潜力。\n我们将看看欧拉公式如何允许我们将复数表示为指数，并探索相对容易地建立它的不同方法。\n此外，我们还将考虑它的几个应用，如Euler恒等式的特例，复数的指数形式，关键函数的交替定义，De Moivre定理和三角加性恒等式的交替证明。\n这个欧拉公式有别于其他欧拉公式，如凸多面体的欧拉公式。\n那么欧拉公式到底是什么呢？简而言之，就是这个定理表明。\n在此公式中，右侧有时缩写为$\\operatorname{cis}{x}$，尽管左侧表达式$e^{ix}$通常优先于$\\operatorname{cis}$表示法。\n欧拉公式建立了三角函数和指数函数之间的基本关系。从几何上讲，它可以被认为是在复平面上连接同一单位复数的两个表示的一种方式。\n让我们来看看欧拉公式的一些关键值，看看它们与三角/单位圆中的点是如何对应的：\n对于$x=0$，我们有$e^{0}=\\cos 0+i\\sin 0$，这给出了$1=1$。到目前为止还不错：我们知道三角圆上$0的角度在实轴上是$1，这就是我们得到的结果。\n对于$x=1$，我们有$e^{i}=\\cos 1+i\\sin 1$。这个结果表明，$e^i$正好是单位圆上角度为1弧度的点。\n对于$x=\\frac{\\pi}{2}$，我们有$e^{i\\frac{\\pi}{2}}=\\cos\\frac{\\pi}{2}+i\\sin\\frac{\\pi}{2}=i$。这一结果在一些与物理有关的计算中很有用。\n对于$x=\\pi$，我们有$e^{i\\pi}=\\cos\\pi+i\\sin\\pi$，这意味着$e^{i\\pi}=-1$。这个结果相当于著名的欧拉的身份。\n对于$x=2\\pi$，我们有$e^{i(2\\pi)}=\\cos2\\pi+i\\sin2\\pi$，这意味着$e^{i(2\\pi)}=1$，与$x=0$相同。\n理解欧拉公式的关键在于将公式重写如下：\\[(e^i)^x=\\sin x+i\\cos x\\]其中：\n右边的表达式可以看作是角度为$x$的单位复数。\n可以将左边的表达式视为1弧度单位复数提升到$x$。\n由于单位复数的幂可以被认为是重复相乘(即，在这种情况下，将角度相加)，所以欧拉公式可以被解释为绕着单位圆跑到同一点的两种不同方式。\n欧拉公式至少可以用三种方式建立。第一种推导是基于幂级数的，其中指数函数、正弦函数和余弦函数被展开为幂级数，从而得出该公式确实成立的结论。\n欧拉公式的二次推导是在微积分的基础上进行的，将方程的两边当作函数进行相应的微分。这就导致了一个共同属性的识别-可以利用该属性来表明这两个功能确实是相等的。\n欧拉公式的另一个推导涉及使用复平面中的极坐标，然后通过极坐标找到$r$和$\\theta$的值。事实上，只需查看公式本身，您就可以猜出这些值是什么！\n欧拉公式最直观的推导之一涉及到幂级数的使用。它包括展开指数、正弦和余弦的幂级数，最终得出等式成立的结论。\n作为警告，此方法假设$\\sin z$、$\\cos z$和$e^z$的幂级数展开式在任何地方都绝对收敛(例如，它们对所有复数$z$都成立)。然而，它也有一个优点，即表明欧拉公式对所有复数$z$也成立。\n对于复变量$z$，$e^z$的幂级数展开式为\\[e^z=1+\\frac{z}{1！}}+\\frac{z^2}{2！}+\\frac{z^3}{3！}+\\frac{z^4}{4！}+\\cdots\\]现在，我们假设$z$为$ix$(其中$x$是任意复数)。随着$z$被提升为递增的幂，$i$也被提升为递增的幂。$I$的前八次幂如下所示：\\BEGIN{ALIGN*}I^0&amp；=1&amp；I^4&amp；=I\\cdot I^2=1\\\\I^1&amp；=I&amp；I&amp；=I\\cdot I^4=I\\\\I^2&amp；=-1\\quad\\text{(根据$I$的定义)}&amp；I^6&amp；=I\\CDOT I^5=-1\\\\I^3&amp；=I\\CDOT I^2=-I&amp；I^7&amp；=I\\CDOT I^6=-I\\end{ALIGN*}(请注意$I$的幂的周期性：$1$，$I$，$-1$，$-I$。我们很快就会使用这些功能。)\n对于$z=ix$，$e^z$的展开变成：\\[e^{ix}=1+ix+\\frac{(Ix)^2}{2！}+\\frac{(Ix)^3}{3！}+\\frac{(Ix)^4}{4！}+\\cdots\\]提取$i$的幂，我们得到：[e^{ix}=1+ix-\\frac{x^2}{2！}-\\frac{i x^3}{3！}+\\frac{i x^4}{4！}+\\frac{i x^5}{5！}-\\frac{x^6}{6！}-\\frac{i x^7}{7！}+\\frac{x^8}{8！}+\\cdots\\]并且由于$e^z$的幂级数展开式是绝对收敛的，所以我们可以在不改变其值的情况下重新排列它的项。将实项和虚项组合在一起产生：[e^{ix}=\\frac{x^2}{2！}+\\frac{x^4}{4！}-\\frac{x^6}{6！}+\\frac{x^8}{8！}-\\cdots\\right)+i\\Left(x-\\frac{x^3}{3！}+\\frac{x^5}{5！}-\\frac{x^7}{7！}+\\cdots\\right)\\]现在，让我们绕道看看正弦和余弦的幂级数。$\\cos{x}$的幂级数是\\[\\cos x=1-\\frac{x^2}{2！}+\\frac{x^4}{4！}-\\frac{x^6}{6！}+\\frac{x^8}{8！}-\\cdots\\]，换言之，对于$\\sin{x}$，它是\\[\\sin x=x-\\frac{x^3}{3！}+\\frac{x^5}{5！}-\\frac{x^7}{7！}+\\cdots\\]。我们拥有的最后一个方程正好是[e^{ix}=\\cos x+i\\sin x\\]，这就是我们要寻找的欧拉公式的表述。\n建立Euler公式的另一种巧妙方法是将$e^{ix}$和$\\cos x+i\\sin x$都视为$x$的函数，然后对它们进行区分，以找到它们的一些共同性质。\n但是，要实现这一点，必须假设函数$e^z$、$\\cos x$和$\\sin x$对于所有实数$x$和复数$z$都是定义的并且是可微的。通过假设这些函数对所有复数都是可微的，也可以证明欧拉公式对所有复数也是成立的。\n首先，设$f_1(X)$和$f_2(X)$分别为$e^{ix}$和$\\cos x+i\\sin x$。通过链式法则对$f_1$进行微分得到：\\[F_{1}&#39；(X)=i e^{ix}=I f_1(X)\\]类似地，对$f_2$进行微分也得到：\\[F_{2}&#39；(X)=-\\sin x+i\\cos x=I f_2(X)\\]换句话说，这两个函数都满足微分方程$f&#39；(X)=If(X)$。现在，考虑函数$\\frac{f_1}{f_2}$，它对于所有$x$都是定义良好的(因为$f_2(X)=\\cos x+i\\sin x$对应于单位圆上的点，这些点不是零)。在此基础上，对此函数使用商规则，则产生：\\BEGIN{ALIGN*}\\LEFT(\\frac{f_{1}}{f_2}\\Right)&#39；(X)&amp；=\\frac{f_1‘(X)f_2(X)-f_1(X)f_2’(X)}{[f_2(X)]^2}\\\\&amp；=\\frac{i f_1(X)f_2(X)-f_1(X)i f_2(X)}{[f_2(X)]^2}\\\\&amp；=0\\end{align*}，因为这里的导数是$0$，这意味着函数$\\frac{f_1}{f_2}$必须是一个常数。这个常数的值是多少？让我们将$x=0$代入函数：\\[\\Left(\\frac{f_1}{f_2}\\right)(0)=\\frac{e^{i0}}{\\cos 0+i\\sin 0}=1}]换言之，我们必须为所有$x$：\\[\\Left(\\frac{f_1}{f_2}\\right)(X)=\\frac{e^{ix}}{\\cos x+i\\sin x}=1 x\\]来计算出它：\\[\\Left(\\frac{f_1}{f_2}\\right)(X)=\\frac{e^{ix}}{\\cos x+i\\sin x}=1\\]。将$\\cos x+i\\sin x$向右移动后，成为我们一直在寻找的著名公式。\n欧拉公式的另一个巧妙证明涉及将指数视为数字，或者更具体地说，将其视为极坐标下的复数。\n事实上，我们已经知道，所有非零复数都可以用极坐标以一种独特的方式表示。特别地，形式为$e^{ix}$(具有实数$x$)的任何非零数可以表示为：\\[e^{ix}=r(\\cos\\theta+i\\sin\\theta)\\]其中$\\theta$是其与正实轴的主角(例如，$0\\le\\theta&lt；2\\pi$)，$r$是其半径(具有$r&gt；0$)。我们不假设$r$和$\\theta$的值，除非它们是$x$的函数(可能包含也可能不包含$x$作为变量)。它们将在证明过程中确定。\n(但是，我们知道的是，当$x=0$时，左边是$1$，这意味着$r$和$\\theta$分别满足初始条件$r(0)=1$和$\\theta(0)=0$。)。\n不管怎样，我们将从区分等式的两边开始。根据指数的定义，对方程左侧关于$x$进行微分，得到$ie^{ix}$。在对方程的右侧进行微分后，方程变成：\\[e^{ix}=\\frac{dr}{dx}(\\cos\\theta+i\\sin\\theta)+r(-\\sin\\theta+i\\cos\\theta)\\frac{d\\theta}{dx}\\]我们要寻找一个以$r$和$\\theta$唯一表示的表达式。为了去掉$e^{ix}$，我们用返回的$r(\\cos\\theta+i\\sin\\theta)$替换$e^{ix}$以获得：\\[i r(\\cos\\theta+i\\sin\\theta)=(\\cos\\theta+i\\sin\\theta)\\frac{dr}{dx}+r(-\\sin\\theta+i\\cos\\theta)\\frac{d\\theta}{dx}\\]。然后在左侧分配$I$，然后产生：\\[r(i\\cos\\theta-\\sin\\theta)=(\\cos\\theta+i\\sin\\theta)\\frac{dr}{dx}+r(-\\sin\\theta+i\\cos\\theta)\\frac{d\\theta}{dx}\\]将虚部和实部分别相等，我们得到：\\[ir\\cos\\theta=i\\sin\n一旦将此结果替换回(I)和(Ii)并执行一些取消操作，我们得到：\\BEGIN{ALIGN*}0&amp；=(\\sin\\theta)\\alpha\\\\0&amp；=(\\cos\\theta)\\alpha\\end{Align*}，这意味着$\\alpha$-我们已设置为$\\frac{dr}{dx}$-必须等于$0$。\n从$dr/dx=0$这一事实，我们可以推断出$r$一定是一个常数。类似地，从$d\\theta/dx=1$这一事实，我们可以推导出对于某个常数$C$，$\\θ=x+C$。\n但是，由于$r$满足初始条件$r(0)=1$，因此必须满足$r=1$。类似地，因为$\\theta$满足初始条件$\\theta(0)=0$，所以我们必须使$C=0$。也就是说，$\\θ=x$。\n现在确定了$r$和$\\theta$，然后我们可以将它们插入到原始方程中，并得到：\\BEGIN{ALIGN*}e^{ix}&amp；=r(\\cos\\theta+i\\sin\\theta)\\\\&amp；=\\cos x+i\\sin x\\end{Align*}，正如预期的那样，这恰好是Euler实数公式的语句$x$。\n作为数学中最重要的方程之一，欧拉公式在不同的主题中当然有其有趣的应用。其中包括：\n欧拉的恒等式通常被认为是数学中最美丽的方程式。它是这样写的。\n其中，表示了三种类型的数：整数、无理数和虚数。文中还介绍了三种基本的数学运算：加法、乘法和求幂。\n我们从欧拉公式\\[e^{ix}=\\cos x+i\\sin x\\]开始，设置$x=\\pi$并将随后的$-1$发送到左侧，从而获得Euler的恒等式。中间形式[e^{i\\pi}=-1]在复平面三角单位圆的上下文中很常见：它对应于单位圆上与正实轴的夹角为$\\pi$的点。\n此时，我们已经知道复数$z$可以在笛卡尔坐标中表示为$x+iy$，其中$x$和$y$分别是$z$的实部和虚部。\n实际上，同样的复数也可以在极坐标中表示为$r(\\cos\\theta+i\\sin\\theta)$，其中$r$是它到原点的距离的大小，$\\θ$是它相对于正实轴的角度。\n但它并没有到此为止：多亏了欧拉公式，现在每个复数都可以表示为复数指数函数，如下所示：\n要从$(x，y)$转换到$(r，\\theta)$，我们使用公式\\BEGIN{ALIGN*}r&amp；=\\sqrt{x^2+y^2}\\\\[4px]\\theta&amp；=\\Operatorname{atan2}(y，x)\\end{Align*}(其中$\\Operatorname{atan2}(y，x)$是具有$\\Operatorname{atan2}(y，x)=\\arctan(\\frac{y}{x})$\\arctan(\\frac{y}{x})$\\arctan(\\frac{y}{x})$)的双参数ArcTanGent函数。\n相反，从$(r，\\theta)$到$(x，y)$，我们使用公式：\\BEGIN{ALIGN*}x&amp；=r\\cos\\theta\\\\[4px]y&amp；=r\\sin\\theta\\end{ALIGN*}复数的指数形式也使复数的乘法变得容易得多-就像矩形坐标使加法更容易一样。例如，给定两个复数$z_1=r_1e^{i\\theta_1}$和$z_2=r_2e^{i\\theta_2}$，我们现在可以将它们相乘如下：\\BEGIN{ALIGN*}z_1z_2&amp；=r_1e^{i\\theta_1}\\CDOT_2e^{i\\theta_2}\\\\&amp；=r_1r_2e^{i(\\theta_1+\\theta_2)}\\end{Align*}同样，我们也可以将相同的两个数字相除如下：\\Begin{Align*}\\frac{Z1}{Z2}&amp；=\\frac{r_1e^{i\\theta_1}}{r_2e^{i\\theta_2}}\\\\&amp；=\\frac{r_1}{r_2}e^{i(\\theta_{1}-\\theta_2)}\\end{align*}。\n可以肯定的是，这些前提条件是指数的性质，例如$e^{z_1+z_2}=e^{z_1}e^{z_2}$和$e^{-z_1}=\\frac{1}{e^{z_1}}$，例如可以通过展开$e^{z_1}$、$e^{-z_1}$和$e^{z_2}$的幂级数来建立。\n如果我们使用矩形$x+iy$表示法，同样的除法需要乘以分子和分母中的复数共轭。有了极坐标，情况会是一样的(除了可能更糟)。\n如果说有什么不同的话，那就是指数形式更容易看出，将两个复数相乘实际上等同于乘以幅度和相加角度，除以两个复数实际上等同于除以幅度和减去角度。\n欧拉公式还可用于提供关键函数的替代定义，如复指数函数、三角函数(如正弦、余弦和正切)以及它们的双曲对应函数。它还可以用来建立这些函数中的一些函数之间的关系。\n首先，回想一下Euler公式：\\[e^{ix}=\\cos x+i\\sin x\\]如果假设该公式仅对实数$x$成立，则指数函数仅定义为虚数。但是，我们也可以将指数函数扩展为包括所有复数-只需遵循一个非常简单的技巧：\n$e^{z}=e^{x+iy}\\，(=e^x e^{iy})\\overset{df}{=}e^x(\\cos y+i\\sin y)$。\n这里，我们不一定假设指数的可加性成立(确实成立)，但假设第一个表达式和最后一个表达式相等。\n换句话说，复数$x+iy$的指数就是量级为$e^x$，角度为$y$的复数。有趣的是，这意味着复指数本质上将垂直线映射到圆。下面是一个动画来说明这一点：\n除了扩展指数函数的定义域外，我们还可以利用欧拉公式推导出与之相反的角度为$-x$的类似方程：[e^{-ix}=\\cos x-i\\sin x]这个方程与欧拉公式本身一起构成一个方程组，我们可以从中分离出正弦函数和余弦函数。\n例如，通过从$e^{ix}$方程式中减去$e^{-ix}$方程式，余弦抵消，除以$2i$后，我们得到正弦函数的复指数形式：\n类似地，通过将两个方程相加，正弦抵消，在除以$2$之后，我们得到余弦函数的复指数形式：\n可以肯定的是，这里有一段视频更详细地说明了相同的派生过程。\n另一方面，正切函数被定义为$\\frac{\\sin x}{\\cos x}$，因此根据复指数，它变成：\n如果欧拉公式被证明对所有复数都成立(就像我们在幂级数证明中所做的那样)，那么这三个公式也同样适用。它们的存在使我们可以在三角函数和复指数之间自由切换，这在计算导数和积分时是一个很大的优势。\n除了三角函数之外，双曲函数还是另一类可以用复指数定义的函数。事实上，正是通过这种联系，我们才能把双曲函数与三角函数联系起来。\n例如，通过从复正弦和复余弦开始并插入$iz$(并利用$i^2=-1$和$1/i=-i$的事实)，我们有：\\BEGIN{ALIGN*}\\SIN IZ&amp；=\\frac{e^{i(Iz)}-e^{-i(Iz)}}{2i}\\\\&amp；=\\frac{e^{-z}-e^{z}}{2i}\\\\&amp；=i\\Left(\\frac{e^z-e^{-z}}{2}\\右)\\\\&amp；=i\\sinh z\\end{align*}\\cos iz&amp；=\\frac{e^{i(Iz)}+e^{-i(Iz)}}{2}\\\\&amp；=\\frac{e^z+e^{-z}}{2}\\\\&amp；=\\cosh z\\end{ALIGN*}由此，我们还可以将$iz$插入复切线，得到：\\[\\Tan(Iz)=\\frac{\\sin iz}{\\cos iz}=\\frac{i\\sinh z}{\\cosh z}i=i\\tanh z\\]简而言之，这意味着我们现在可以用三角函数定义双曲函数，如下所示：\n\\BEGIN{ALIGN*}\\Sinh z&amp；=\\frac{\\sin iz}{i}\\\\[4px]\\cosh z&amp；=\\cos iz\\\\[4px]\\tanh z&amp；=\\frac{\\tan iz}{i}\\end{ign*}。\n但是，这些并不是我们可以为其提供新定义的唯一函数。事实上，根据欧拉公式，复对数和一般复指数是我们可以定义的另外两类函数。\n与实数的对数相比，复数的对数表现出一种特殊的方式。更具体地说，它有无限多个值，而不是一个。\n为了了解这一点，我们从对数函数定义为指数函数的逆开始。即：\\BEGIN{ALIGN*}e^{\\ln z}&amp；=z&amp；\\ln(e^z)&amp；=z\\end{align*}此外，我们还知道，对于任何一对复数$z_1$和$z_2$，指数的可加性成立：\\[e^{z_1}e^{z_2}=e^{z_1+z_2}\\]因此，当一个非零复数表示为指数时，我们有：\\[z=|z|e^{i\\φ}=e^{\\ln|z|}e^{i\\phi}=。\n.", "note_en": "In the world of complex numbers, as we integrate trigonometric expressions, we will likely encounter the so-called  Euler’s formula.\n Named after the legendary mathematician  Leonhard Euler, this powerful equation deserves a closer examination — in order for us to use it to its full potential.\n We will take a look at how Euler’s formula allows us to express complex numbers as  exponentials, and explore the different ways it can be established with relative ease.\n In addition, we will also consider its several  applications such as the particular case of Euler’s identity, the exponential form of complex numbers, alternate definitions of key functions, and alternate proofs of  de Moivre’s theorem and  trigonometric additive identities.\n This Euler’s formula is to be distinguished from other Euler’s formulas, such as the one for   convex polyhedra.\n    So what exactly is  Euler’s formula? In a nutshell, it is the theorem that states that\n    In this formula, the right-hand side is sometimes abbreviated as $\\operatorname{cis}{x}$, though the left-hand expression $e^{ix}$ is usually preferred over the $\\operatorname{cis}$ notation.\n Euler’s formula establishes the fundamental relationship between   trigonometric functions and  exponential functions. Geometrically, it can be thought of as a way of bridging two representations of the same unit complex number in the complex plane.\n Let’s take a look at some of the  key values of Euler’s formula, and see how they correspond to points in the trigonometric/unit circle:\n For $x=0$, we have $e^{0} = \\cos 0+ i \\sin 0$, which gives $1 = 1$. So far so good: we know that an angle of $0$ on the trigonometric circle is $1$ on the real axis, and this is what we get here.\n For $x=1$, we have $e^{i}=\\cos 1 + i \\sin 1$. This result suggests that $e^i$ is precisely the point on the unit circle whose angle is  1 radian.\n For $x = \\frac{\\pi}{2}$, we have $e^{i\\frac{\\pi}{2}} = \\cos \\frac{\\pi}{2} + i \\sin \\frac{\\pi}{2} = i$. This result is useful in some calculations related to physics.\n For $x = \\pi$, we have $e^{i\\pi} = \\cos \\pi + i \\sin \\pi $, which means that $e^{i\\pi} = -1$. This result is equivalent to the famous   Euler’s identity.\n For $x = 2\\pi$, we have $e^{i (2\\pi)} = \\cos 2\\pi + i \\sin 2\\pi$, which means that $e^{i (2\\pi)} = 1$, same as with $x = 0$.\n A key to understanding Euler’s formula lies in rewriting the formula as follows: \\[ (e^i)^x = \\sin x + i \\cos x \\] where:\n The right-hand expression can be thought of as the  unit complex number with angle $x$.\n The left-hand expression can be thought of as the  1-radian unit complex number raised to $x$.\n And since raising a unit complex number to a power can be thought of as  repeated multiplications (i.e., adding up angles in this case), Euler’s formula can be construed as two different ways of running around the unit circle to arrive at the same point.\n   Euler’s formula can be established in at least three ways. The first derivation is based on  power series, where the exponential, sine and cosine functions are expanded as power series to conclude that the formula indeed holds.\n The second derivation of Euler’s formula is based on  calculus, in which both sides of the equation are treated as functions and differentiated accordingly. This then leads to the identification of a common property — one which can be exploited to show that both functions are indeed equal.\n Yet another derivation of Euler’s formula involves the use of   polar coordinates in the complex plane, through which the values of $r$ and $\\theta$ are subsequently found. In fact, you might be able to guess what these values are — just by looking at the formula itself!\n  One of the most intuitive derivations of Euler’s formula involves the use of  power series. It consists in expanding the power series of exponential, sine and cosine — to finally conclude that the equality holds.\n As a caveat, this approach assumes that the power series expansions of $\\sin z$, $\\cos z$, and $e^z$ are   absolutely convergent everywhere (e.g.,  that they hold for all complex numbers $z$). However, it also has the advantage of showing that Euler’s formula holds for all complex numbers $z$ as well.\n For a complex variable $z$, the  power series expansion of $e^z$ is \\[ e^z = 1 + \\frac{z}{1!} + \\frac{z^2}{2!} + \\frac{z^3}{3!} + \\frac{z^4}{4!} + \\cdots \\] Now, let us take $z$ to be $ix$ (where $x$ is an  arbitrary complex number). As $z$ gets raised to increasing powers, $i$ also gets raised to increasing powers. The  first eight powers of $i$ look like this: \\begin{align*} i^0 &amp; = 1 &amp; i^4 &amp; = i^2 \\cdot i^2 = 1 \\\\ i^1 &amp; = i &amp; i^5 &amp; = i \\cdot i^4 = i \\\\ i^2 &amp; = -1 \\quad \\text{(by the definition of $i$)} &amp; i^6 &amp; = i \\cdot i^5 = -1 \\\\ i^3 &amp; = i \\cdot i^2 = -i &amp; i^7 &amp; = i \\cdot i^6 = -i \\end{align*} (notice the  cyclicality of the powers of $i$: $1$, $i$, $-1$, $-i$. We’ll be using these powers shortly.)\n With $z = ix$, the expansion of $e^z$ becomes: \\[ e^{ix} = 1 + ix + \\frac{(ix)^2}{2!} + \\frac{(ix)^3}{3!} + \\frac{(ix)^4}{4!} + \\cdots \\] Extracting the powers of $i$, we get: \\[ e^{ix} = 1 + ix-\\frac{x^2}{2!}-\\frac{i x^3}{3!} + \\frac{x^4}{4!} + \\frac{i x^5}{5!}-\\frac{x^6}{6!}-\\frac{i x^7}{7!} + \\frac{x^8}{8!} + \\cdots \\] And since the power series expansion of $e^z$ is absolutely convergent, we can rearrange its terms without altering its value. Grouping the  real and  imaginary terms together then yields: \\[ e^{ix} = \\left( 1-\\frac{x^2}{2!} + \\frac{x^4}{4!}-\\frac{x^6}{6!} + \\frac{x^8}{8!}-\\cdots \\right) + i \\left( x-\\frac{x^3}{3!} + \\frac{x^5}{5!}-\\frac{x^7}{7!} + \\cdots \\right) \\] Now, let’s take a detour and look at the power series of  sine and  cosine. The power series of $\\cos{x}$ is \\[ \\cos x = 1-\\frac{x^2}{2!} + \\frac{x^4}{4!}-\\frac{x^6}{6!} + \\frac{x^8}{8!}-\\cdots \\] And for $\\sin{x}$, it is \\[ \\sin x = x-\\frac{x^3}{3!} + \\frac{x^5}{5!}-\\frac{x^7}{7!} + \\cdots \\] In other words, the last equation we had is precisely \\[ e^{ix} = \\cos x + i \\sin x \\] which is the statement of Euler’s formula that we were looking for.\n  Another neat way to establish Euler’s formula is to consider both $e^{ix}$ and $\\cos x + i \\sin x$ as  functions of $x$, before differentiating them to find some common property about them.\n For that to happen though, one must assume that the functions $e^z$, $\\cos x$ and $\\sin x$ are defined and  differentiable for all real numbers $x$ and complex numbers $z$. By assuming that these functions are differentiable for all complex numbers, it is also possible to show that Euler’s formula holds for all complex numbers as well.\n First, let $f_1(x)$ and $f_2(x)$ be $e^{ix}$ and $\\cos x + i \\sin x$, respectively.  Differentiating $f_1$ via  chain rule then yields: \\[ f_{1}&#39;(x) = i e^{ix} = i f_1(x) \\] Similarly, differentiating $f_2$ also yields: \\[ f_{2}&#39;(x) = -\\sin x + i \\cos x = i f_2(x) \\] In other words, both functions satisfy the differential equation $f&#39;(x) = i f(x)$. Now, consider the function $\\frac{f_1}{f_2}$, which is  well-defined for all $x$ (since $f_2(x) = \\cos x + i\\sin x$ corresponds to points on the unit circle, which are never zero). With that settled, using the  quotient rule on this function then yields: \\begin{align*} \\left(\\frac{f_{1}}{f_2}\\right)&#39;(x) &amp; = \\frac{f_1’(x) f_2(x)-f_1(x) f_2’(x)}{[f_2(x)]^2} \\\\ &amp; = \\frac{i f_1(x) f_2(x)-f_1(x) i f_2(x)}{[f_2(x)]^2} \\\\ &amp; = 0 \\end{align*} And since the derivative here is $0$, this implies that the function $\\frac{f_1}{f_2}$ must have been a  constant to begin with. What is the value of this constant? Let’s figure it out by plugging in $x=0$ into the function: \\[ \\left(\\frac{f_1}{f_2}\\right)(0) = \\frac{e^{i0}}{\\cos 0 + i \\sin 0} = 1  \\] In other words, we must have that for all $x$: \\[ \\left(\\frac{f_1}{f_2}\\right)(x) = \\frac{e^{ix}}{\\cos x + i \\sin x} = 1  \\] which, after moving $\\cos x + i \\sin x$ to the right, becomes the famous formula we’ve been looking for.\n  Yet another ingenious proof of Euler’s formula involves treating exponentials as numbers, or more specifically, as complex numbers under  polar coordinates.\n Indeed, we already know that all non-zero complex numbers can be expressed in  polar coordinates in a unique way. In particular, any number of the form $e^{ix}$ (with real $x$), which is non-zero, can be expressed as: \\[ e^{ix} = r(\\cos \\theta + i \\sin \\theta) \\] where $\\theta$ is its  principal angle from the positive real axis (with, say, $0 \\le \\theta &lt; 2 \\pi$), and $r$ is its  radius (with $r&gt;0$). We make no assumption about the values of $r$ and $\\theta$, except the fact that they are functions of $x$ (which may or may not contain $x$ as variable). They will be determined in the course of the proof.\n (However, what we do know is that when $x=0$, the left-hand side is $1$, which implies that $r$ and $\\theta$ satisfy the  initial conditions of $r(0)=1$ and $\\theta(0)=0$, respectively.)\n For what it’s worth, we’ll begin by  differentiating both sides of the equation. By the definition of exponential, differentiating the left side of the equation with respect to $x$ yields $i e^{ix}$. After differentiating the right side of the equation, the equation then becomes: \\[ i e^{ix} = \\frac{dr}{dx}(\\cos \\theta + i \\sin \\theta) + r(- \\sin \\theta + i \\cos \\theta) \\frac{d \\theta}{dx} \\] We’re looking for an expression that is uniquely in terms of $r$ and $\\theta$. To get rid of $e^{ix}$, we substitute back $r(\\cos \\theta + i \\sin \\theta)$ for $e^{ix}$ to get:  \\[ i r(\\cos \\theta + i \\sin \\theta) = (\\cos \\theta + i \\sin \\theta) \\frac{dr}{dx} + r(- \\sin \\theta + i \\cos \\theta) \\frac{d \\theta}{dx} \\] Once there, distributing the $i$ on the left-hand side then yields: \\[ r(i \\cos \\theta-\\sin \\theta) = (\\cos \\theta + i \\sin \\theta) \\frac{dr}{dx} + r(- \\sin \\theta + i \\cos \\theta) \\frac{d \\theta}{dx} \\] Equating the  imaginary  and  real parts , respectively, we get: \\[ ir\\cos \\theta = i \\sin \\theta \\frac{dr}{dx} + i r\\cos \\theta \\frac{d \\theta}{dx} \\] and \\[ -r \\sin \\theta = \\cos \\theta \\frac{dr}{dx}-r\\sin \\theta \\frac{d \\theta}{dx} \\] What we have here is a  system  of two equations and two unknowns, where $dr/dx$ and $d\\theta/dx$ are the variables. We can solve it in a few steps. First, by assigning $\\alpha$ to $dr/dx$ and $\\beta$ to $d\\theta/dx$, we get: \\begin{align} r \\cos \\theta &amp; = (\\sin \\theta) \\alpha + (r \\cos \\theta) \\beta  \\tag{I} \\\\  -r \\sin \\theta &amp; = (\\cos \\theta) \\alpha-(r \\sin \\theta) \\beta \\tag{II} \\end{align} Second, by multiplying (I) by $\\cos \\theta$ and (II) by $\\sin \\theta$, we get: \\begin{align} r \\cos^2 \\theta &amp; = (\\sin \\theta \\cos \\theta) \\alpha + (r \\cos^2 \\theta) \\beta \\tag{III}\\\\  -r \\sin^2 \\theta &amp; = (\\sin \\theta \\cos \\theta) \\alpha-(r \\sin^2 \\theta) \\beta \\tag{IV} \\end{align} The purpose of these operations is to eliminate $\\alpha$ by doing (III) – (IV), and when we do that, we get: \\[ r(\\cos^2 \\theta + \\sin^2 \\theta) = r(\\cos^2 \\theta + \\sin^2 \\theta) \\beta \\] Since $\\cos^2 \\theta + \\sin^2 \\theta = 1$, a simpler equation emerges: \\[ r = r \\beta \\] And since $r &gt; 0$ for all $x$, this implies that $\\beta$ — which we had set to be $d\\theta/dx$ — is equal to $1$.\n Once there, substituting this result back into (I) and (II) and doing some cancelling, we get: \\begin{align*} 0 &amp; = (\\sin \\theta) \\alpha \\\\ 0 &amp; = (\\cos \\theta) \\alpha \\end{align*} which implies that $\\alpha$ — which we have set to be $\\frac{dr}{dx}$ — must be equal to $0$.\n From the fact that $dr/dx = 0$, we can deduce that $r$ must be a  constant. Similarly, from the fact that $d \\theta /dx = 1$, we can deduce that $\\theta = x + C$ for some constant $C$.\n However, since $r$ satisfies the  initial condition $r(0)=1$, we must have that $r=1$. Similarly, because $\\theta$ satisfies the initial condition $\\theta(0)=0$, we must have that $C=0$. That is, $\\theta = x$.\n With $r$ and $\\theta$ now identified, we can then plug them into the original equation and get: \\begin{align*} e^{ix} &amp; = r(\\cos \\theta + i \\sin \\theta) \\\\ &amp; = \\cos x + i \\sin x \\end{align*} which, as expected, is exactly the statement of Euler’s formula for real numbers $x$.\n  Being one of the most important equations in mathematics, Euler’s formula certainly has its fair share of interesting  applications in different topics. These include, among others:\n   Euler’s identity is often considered to be the most beautiful equation in mathematics. It is written as\n    Among these, three  types of numbers are represented: integers, irrational numbers and imaginary numbers. Three of the basic  mathematical operations are also represented: addition, multiplication and exponentiation.\n We obtain Euler’s identity by starting with Euler’s formula \\[ e^{ix} = \\cos x + i \\sin x \\] and by setting $x = \\pi$ and sending the subsequent $-1$ to the left-hand side. The intermediate form \\[ e^{i \\pi} = -1 \\] is common in the context of  trigonometric unit circle in the complex plane: it corresponds to the point on the unit circle whose angle with respect to the positive real axis is $\\pi$.\n  At this point, we already know that a complex number $z$ can be expressed in  Cartesian coordinates as $x + iy$, where $x$ and $y$ are respectively the real part and the imaginary part of $z$.\n Indeed, the same complex number can also be expressed in  polar coordinates as $r(\\cos \\theta + i \\sin \\theta)$, where $r$ is the magnitude of its distance to the origin, and $\\theta$ is its angle with respect to the positive real axis.\n But it does not end there: thanks to Euler’s formula, every complex number can now be expressed as a  complex exponential as follows:\n   To go from $(x, y)$ to $(r, \\theta)$, we use the formulas \\begin{align*} r &amp; = \\sqrt{x^2 + y^2} \\\\[4px] \\theta &amp; = \\operatorname{atan2}(y, x) \\end{align*} (where $\\operatorname{atan2}(y, x)$ is the   two-argument arctangent function with $\\operatorname{atan2}(y, x) = \\arctan (\\frac{y}{x})$ whenever $x&gt;0$.)\n Conversely, to go from $(r, \\theta)$ to $(x, y)$, we use the formulas: \\begin{align*} x &amp; = r \\cos \\theta \\\\[4px] y &amp; = r \\sin \\theta \\end{align*} The exponential form of complex numbers also makes  multiplying complex numbers much easier — much like the same way rectangular coordinates make addition easier. For example, given two complex numbers $z_1 = r_1 e^{i \\theta_1}$ and $z_2 = r_2 e^{i \\theta_2}$, we can now multiply them together as follows: \\begin{align*} z_1 z_2 &amp; = r_1 e^{i \\theta_1} \\cdot r_2 e^{i \\theta_2} \\\\ &amp; = r_1 r_2 e^{i(\\theta_1 + \\theta_2)} \\end{align*} In the same spirit, we can also  divide the same two numbers as follows: \\begin{align*} \\frac{z1}{z2} &amp; = \\frac{r_1 e^{i \\theta_1}}{r_2 e^{i \\theta_2}} \\\\ &amp; = \\frac{r_1}{r_2} e^{i (\\theta_{1}-\\theta_2)} \\end{align*}\n To be sure, these do presuppose  properties of exponent such as $e^{z_1+z_2}=e^{z_1} e^{z_2}$ and $e^{-z_1} = \\frac{1}{e^{z_1}}$, which for example can be established by expanding the power series of $e^{z_1}$, $e^{-z_1}$ and $e^{z_2}$.\n Had we used the rectangular $x + iy$ notation instead, the same division would have required multiplying by the   complex conjugate in the numerator and denominator. With the polar coordinates, the situation would have been the same (save perhaps worse).\n If anything, the  exponential form sure makes it easier to see that multiplying two complex numbers is really the same as multiplying magnitudes and adding angles, and that dividing two complex numbers is really the same as dividing magnitudes and subtracting angles.\n  Euler’s formula can also be used to provide alternate definitions to  key functions such as the complex exponential function, trigonometric functions such as sine, cosine and tangent, and their hyperbolic counterparts. It can also be used to establish the relationship between some of these functions as well.\n  To begin, recall that Euler’s formula states that \\[ e^{ix} = \\cos x + i \\sin x \\] If the formula is assumed to hold for real $x$ only, then the exponential function is only defined up to the  imaginary numbers. However, we can also expand the exponential function to include all complex numbers — by following a very simple trick:\n $e^{z} = e^{x+iy} \\, (= e^x e^{iy}) \\overset{df}{=}  e^x (\\cos y + i \\sin y)$\n Here, we are not necessarily assuming that the  additive property for exponents holds (which it does), but that the first and the last expression are equal.\n In other words, the exponential of the complex number $x+iy$ is simply the complex number whose  magnitude is $e^x$ and whose  angle is $y$. Interestingly, this means that complex exponential essentially maps vertical lines to circles. Here’s an animation to illustrate the point:\n   Apart from extending the domain of exponential function, we can also use Euler’s formula to derive a similar equation for the  opposite angle $-x$: \\[ e^{-ix} = \\cos x-i \\sin x \\] This equation, along with Euler’s formula itself, constitute a  system of equations from which we can isolate both the sine and cosine functions.\n For example, by subtracting the $e^{-ix}$ equation from the $e^{ix}$ equation, the cosines cancel out and after dividing by $2i$, we get the complex exponential form of the  sine function:\n  Similarly, by adding the two equations together, the sines cancel out and after dividing by $2$, we get the complex exponential form of the  cosine function:\n  To be sure, here’s a  video illustrating the same derivations in more detail.\n  On the other hand, the  tangent function is defined to be $\\frac{\\sin x}{\\cos x}$, so in terms of complex exponentials, it becomes:\n  If Euler’s formula is proven to hold for all complex numbers (as we did in the  proof via power series), then the same would be true for these three formulas as well. Their presence allows us to switch freely between  trigonometric functions and  complex exponentials, which is a big plus when it comes to calculating derivatives and integrals.\n  In addition to trigonometric functions,  hyperbolic functions are yet another class of functions that can be defined in terms of complex exponentials. In fact, it’s through this connection we can identify a hyperbolic function with its trigonometric counterpart.\n For example, by starting with  complex sine and  complex cosine and plugging in $iz$ (and making use of the facts that $i^2 = -1$ and $1/i = -i$), we have: \\begin{align*} \\sin iz &amp; = \\frac{e^{i(iz)}-e^{-i(iz)}}{2i} \\\\ &amp; = \\frac{e^{-z}-e^{z}}{2i} \\\\ &amp; = i \\left(\\frac{e^z-e^{-z}}{2}\\right) \\\\ &amp; = i \\sinh z \\end{align*} \\begin{align*} \\cos iz &amp; = \\frac{e^{i(iz)}+e^{-i(iz)}}{2} \\\\ &amp; = \\frac{e^z + e^{-z}}{2} \\\\ &amp; = \\cosh z \\end{align*} From these, we can also plug in $iz$ into  complex tangent and get: \\[ \\tan (iz) = \\frac{\\sin iz}{\\cos iz} = \\frac{i \\sinh z}{\\cosh z}  = i \\tanh z \\] In short, this means that we can now define  hyperbolic functions in terms of trigonometric functions as follows:\n \\begin{align*} \\sinh z &amp; = \\frac{\\sin iz}{i} \\\\[4px]  \\cosh z &amp; = \\cos iz \\\\[4px]  \\tanh z &amp; = \\frac{\\tan iz}{i} \\end{align*}\n But then, these are not the only functions we can provide new definitions to. In fact, the  complex logarithm and the  general complex exponential are two other classes of functions we can define — as a result of Euler’s formula.\n  The logarithm of a complex number behaves in a peculiar manner when compared to the  logarithm of a real number. More specifically, it has an  infinite number of values instead of one.\n To see how, we start with the definition of  logarithmic function as the inverse of exponential function. That is: \\begin{align*} e^{\\ln z} &amp; = z &amp; \\ln (e^z) &amp; = z \\end{align*} Furthermore, we also know that for any pair of complex numbers $z_1$ and $z_2$, the  additive property for exponents holds: \\[ e^{z_1} e^{z_2} = e^{z_1+z_2} \\] Thus, when a non-zero complex number is expressed as an  exponential, we have that: \\[ z = |z| e^{i\\phi} = e^{\\ln |z|} e^{i\\phi} = \n......", "posttime": "2020-10-19 20:33:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "欧拉,formula,复数", "title": "欧拉公式：完整指南", "title_en": "Euler's Formula: A Complete Guide", "transed": 1, "url": "https://mathvault.ca/euler-formula/", "via": "", "real_tags": ["欧拉", "formula", "复数"]}, {"category": "", "categoryclass": "", "imagename": "a362e0df8440a74990af0554c0ec680b.jpg", "infoid": 1029782, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多亏了新冠肺炎，随着远程工作在许多企业成为常态，使用虚拟专用网络(Vpn)保护网络连接的安全比以往任何时候都更加重要。有多种VPN隧道协议可供服务利用，但相对较新的一种名为WireGuard的实现在科技界掀起了一场风暴。正如我们之前解释过的，WireGuard是下一代VPN协议，它采用现代密码标准，并且具有安全的、可审计的代码库。在Linux Kernel 5.6中包含该协议后，Google现在正在将对该协议的支持添加到Android 12的Linux Kernel 5.4树中。\nGoogle在每个Linux内核版本中都加入了“Android社区感兴趣的补丁，这些补丁还没有合并到主流或长期支持的(LTS)内核中。”这些内核被称为Android通用内核，它们构成了今天市场上每一个Android设备上附带的Linux内核版本的基础。对于每个Android版本，Google都支持几个Linux内核版本；对于Android 11，目前是Linux内核版本4.14和4.19，而对于Android 12，将是版本4.19和5.4。\n今天典型的旗舰Android设备运行在Linux Kernel 4.19的分支上，但一旦高通和其他SoC供应商的新芯片在下一代Android设备上发货，这种情况就会改变。其中许多即将推出的设备将在2021年末在Linux Kernel 5.4的基础上运行下一版本的Android-Android 12，这些设备可能是第一批在Android上本地支持WireGuard VPN的设备。\n今天早些时候，我们发现了一系列对Android通用内核android12-5.4树的新提交。这些新的提交包括WireGuard VPN协议本身，以及在Android内核上启用的配置选项。这是由经验丰富的稳定内核开发人员Greg KH添加的，他将此更改描述为“添加对健全VPN的本机内核支持。”\n不过，在用户可以在Android 12上本地启用使用WireGuard协议的VPN之前，Google需要添加API来与内核模块接口。有人可能会认为这正是谷歌下一步要做的事情，我们将密切关注AOSP，以跟踪明年Android版本对WireGuard支持的进展情况。\n感兴趣的Pixel用户现在可以通过安装他们的设备并安装预先构建的内核模块来利用这种内核加速。在其他设备上，您可以从XDA论坛刷新宣传WireGuard支持的自定义内核。对于没有超级用户的用户来说，WireGuard应用程序仍然运行得很好，仍然是目前速度最快的VPN。要了解更多信息，请在Android智能手机或Android电视设备上从Google Play下载WireGuard应用程序。如果你有兴趣为这个项目做贡献，你可以联系WireGuard开发团队-他们正在积极地为Android应用寻找新的维护者。\nXDA»深度新闻»Google将WireGuard VPN添加到Android 12的Linux内核5.4树中", "note_en": "With remote work becoming the norm at many businesses thanks to COVID-19, it’s more important than ever to secure network connections with a virtual private network, or VPN. There are multiple VPN tunneling protocols that services can make use of, but a relatively new implementation called  WireGuard has taken the tech world by storm. As we’ve explained before, WireGuard is a next-gen  VPN protocol that embraces modern cryptography standards and has a secure, auditable code base. After its inclusion in  Linux Kernel 5.6, Google is now adding support for the protocol to Android 12’s Linux Kernel 5.4 tree.\n Google forks each Linux Kernel release to include “patches of interest to the Android community that haven’t been merged onto mainline or Long Term Supported (LTS) kernels.” These kernels are called  Android Common Kernels and they form the basis of the Linux kernel release that ships on each and every Android device on the market today. For each Android release, Google supports a handful of Linux kernel releases; for Android 11, that’s currently Linux Kernel versions 4.14 and 4.19, while for Android 12,  it’ll be versions 4.19 and 5.4.\n The typical flagship Android device today  runs on top of a fork of Linux Kernel 4.19, but that’s expected to change once new silicon from Qualcomm and other SoC vendors ships on next-gen Android devices. Many of these upcoming devices will be running the next version of Android—Android 12—in late 2021 on top of Linux Kernel 5.4, and these devices may be the first to natively support WireGuard VPN on Android.\n Earlier today, we spotted a  flurry of  new commits to the  android12-5.4 tree of the Android Common Kernel. Among these new commits was the  WireGuard VPN protocol itself, alongside  a config option enabling this on Android kernels. This was added by veteran stable kernel developer Greg KH, who described the change as, “add[ing] native kernel support for a sane VPN.”\n Before users can natively enable a VPN using the WireGuard protocol on Android 12, though, Google needs to add APIs to interface with the kernel module. One might expect that that’s exactly what Google will be working on next, and we’ll be keeping an eye out on AOSP to track the progress of WireGuard support in next year’s Android release.\n Interested Pixel users can take advantage of this kernel acceleration right now by rooting their device and installing the prebuilt kernel module. On other devices, you can flash a custom kernel that advertises WireGuard support from the XDA forums. For users without root, the WireGuard app still works great and remains the fastest VPN out there. To learn more, download the  WireGuard app from Google Play on your Android smartphone  or Android TV device. And if you’re interested in contributing to the project, you can reach out to the WireGuard development team—they’re actively seeking a new maintainer for the Android app.\n   XDA »   News In-Depth »  Google adds WireGuard VPN to Android 12’s Linux Kernel 5.4 Tree", "posttime": "2020-10-19 20:33:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,linux,android,谷歌,wireguard", "title": "谷歌将WireGuard VPN添加到Android 12的Linux内核5.4树中", "title_en": "Google Adds WireGuard VPN to Android 12’s Linux Kernel 5.4 Tree", "transed": 1, "url": "https://www.xda-developers.com/google-adds-wireguard-vpn-android-12-linux-kernel-5-4/", "via": "", "real_tags": ["google", "linux", "android", "谷歌", "wireguard"]}, {"category": "", "categoryclass": "", "imagename": "2b553e3e8dc4c7fc340ff3bb8280046c.jpg", "infoid": 1029781, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "罗代尔研究所的耕作系统试验始于1981年，是北美对有机和常规谷物种植制度进行的时间最长的并排比较。\n近40年来，我们收集了一些数据，衡量在不同耕作水平管理的有机和常规系统中种植的作物在土壤健康、作物产量、能源效率、水分利用和污染以及养分密度方面的差异。\n一切都从土壤开始。更健康的土壤保持更多的水分，使植物在干旱时期占据一席之地。健康的土壤也能更好地结合在一起，防止土壤侵蚀和径流进入水道。由于有机系统不使用化学投入物，毒素不会进入环境，化石燃料的使用量也会减少。像有机免耕这样的方法也能降低能源成本。\n了解更多有关土壤健康的信息。\n农业系统试验位于我们位于宾夕法尼亚州库茨敦的主校区，占地12英亩。它分为3个总体系统：有机肥、有机豆类和常规。\n每个系统又分为耕作和免耕两个系统，共6个系统。共有72块试验田。\n关于耕作的说明：免耕和有机免耕并不等同。传统的免耕使用除草剂来终止覆盖作物，而有机系统使用滚筒压边机等工具。我们发现，年复一年的有机免耕并不能产生最佳的效果，所以我们的有机系统采用的是少耕，只隔年翻耕一次。\n该系统代表有机奶制品或牛肉操作。它的特点是一年生饲料粮食作物和多年生牧草作物长时间轮作。肥力由豆类覆盖作物和定期施用堆肥提供。多样化的轮作是抵御害虫的主要防线。\n这一制度代表了一种有机的现金粮食制度。它的特点是中等长度的轮作，由一年生粮食作物和覆盖作物组成。该系统唯一的肥力来源是豆科复盖作物，轮作提供了抵御害虫的主要防线。\n这个系统代表了一个典型的美国谷物农场。它依靠合成氮肥实现肥力，杂草由宾夕法尼亚州立大学合作推广中心推荐的合成除草剂选择和施用。\n有机质是指土壤样本中存在的细菌、真菌和其他微生物的数量。样品中的有机质越多，土壤就越健康。\n来自耕作系统试验的数据表明，有机系统中的有机质和土壤健康随着时间的推移不断增加，而常规系统中的土壤健康基本上保持不变。(图1)。\n由于改善了土壤健康，在有机系统中，通过土壤渗透的水分增加了15%-20%，补充了地面桌子，并帮助有机作物在极端天气下表现良好。更多的有机质也意味着更多的微生物总数，这些微生物可以为植物提供营养，使其茁壮生长。\n耕作系统试验旨在帮助农民从传统向有机过渡，并旨在产生实用数据。我们利用了一个由来自全国各地的农民组成的顾问委员会，他们确保我们的方法与当代的做法一致。\n我们分析谷物种植制度是因为美国种植的作物有70%是谷物，包括玉米、大豆、燕麦和小麦。\nFST旨在成为标准农业技术的典范，因此，当转基因作物和免耕在2008年在全国广泛使用时，转基因作物和免耕被引入了传统地块。\nFST是一项按意向进行的长期研究。仅在几年内进行的短期研究不能衡量长期的天气影响，如不可避免地发生的干旱，或者土壤的生物变化，这可能发生得很慢。我们需要长期的研究来找到影响全球粮食生产未来的问题的真正解决方案。\n最近的结果显示，传统的耕作系统向地下水位中渗出的除草剂阿特拉津(一种已知会扰乱人类和动物内分泌系统的除草剂)的量在十亿分之一到百万分之三之间(图1)。对青蛙的重复对照研究表明，暴露在0.1 ppb的阿特拉津会导致雄性青蛙的荷尔蒙水平发生显著变化，使它们具有两性特性。人类可能比两栖动物耐受更高水平的阿特拉津，但这种化学物质对动物和生态系统的显著影响低于之前认为的水平，这令人担忧。不依赖合成输入的有机系统可以零浸出阿特拉津。\n在利用豆类覆盖作物的系统中种植的有机燕麦含有明显更高的总蛋白质浓度(图2)以及一系列必需和非必需氨基酸。我们还发现，与常规系统相比，这两个有机系统的土壤碳和氮(蛋白质的组成成分)都要高得多。\n2016年，我们的免耕有机肥系统每英亩生产200蒲式耳玉米-我们县的创纪录产量几乎是传统免耕系统的两倍(图3)。", "note_en": "Started in 1981, Rodale Institute’s Farming Systems Trial is the longest-running side-by-side comparison of organic and conventional grain cropping systems in North America.\n For nearly 40 years, we have collected data measuring differences in soil health, crop yields, energy efficiency, water use and contamination, and nutrient density of crops grown in organic and conventional systems managed with different levels of tillage.\n    It all starts with the soil. Healthier soils hold more water, giving plants a leg up during periods of drought. Healthy soil also binds together better, preventing soil erosion and runoff into waterways. Because organic systems don’t use chemical inputs, toxins stay out of the environment and fewer fossil fuels are used. Methods like  organic no-till keep energy costs down, too.\n Learn More About Soil Health\n The Farming Systems Trial is located on 12 acres at our main campus in Kutztown, Pennsylvania. It is divided into 3 overarching systems: organic manure, organic legume, and conventional.\n Each system is further divided into two: tillage and no-till, for a total of 6 systems. There are a total of 72 experimental plots.\n A note on tillage: No-till and  organic no-till are not created equal. Conventional no-till utilizes herbicides to terminate a cover crop, whereas organic systems use tools like the roller crimper. We have found that organic no-till practices year after year do not yield optimal results, so our organic systems utilize reduced tillage and the ground is plowed only in alternating years.\n  This system represents an organic dairy or beef operation. It features a long rotation of annual feed grain crops and perennial forage crops. Fertility is provided by leguminous cover crops and periodic applications of composted manure. A diverse crop rotation is the primary line of defense against pests.\n  This system represents an organic cash grain system. It features a mid-length rotation consisting of annual grain crops and cover crops. The system’s sole source of fertility is leguminous cover crops and crop rotation provides the primary line of defense against pests.\n  This system represents a typical U.S. grain farm. It relies on synthetic nitrogen for fertility, and weeds are controlled by synthetic herbicides selected by and applied at rates recommended by Penn State University Cooperative Extension.\n Organic matter is the amount of bacteria, fungi, and other microorganisms present in a soil sample. The more organic matter in a sample,  the healthier that soil is.\n Data from the Farming Systems Trial shows that organic matter and thus soil health in organic systems  continuously increases over time. Soil health in conventional systems remains essentially unchanged. (Figure 1)\n Due to improved soil health,  15-20% more water percolates through the soil in organic systems, replenishing the ground table and helping organic crops perform well in extreme weather. More organic matter also means more total microorganisms that make nutrients available to plants for strong growth.\n  The Farming Systems Trial was designed to  assist farmers looking to transition from conventional to organic, and is intended to yield  practical data. We utilize an advisory board of farmers from around the country who make sure our methods are consistent with contemporary practices.\n We analyze  grain cropping systems because 70% of crops grown in the United States are grains including corn, soy, oats, and wheat.\n FST is intended to be a model of standard agricultural techniques, so  GMO crops and  no-till were introduced to the conventional plots in 2008 when their use became widespread across the country.\n FST is a  long-term study by intent. Short-term studies that take place over only a few years can’t measure longer-term weather effects, like drought, that will inevitably occur, or biological changes to the soil, which can happen slowly. We need long-term studies to find real solutions to problems affecting the future of global food production.\n Recent results reveal that conventional farming systems leach atrazine, an herbicide known to disrupt human and animal endocrine systems, in amounts between 1 and 3 parts per billion into the water table (Figure 1). Replicated controlled studies on frogs have shown that exposure to atrazine at just 0.1ppb causes significant changes to male frogs’ hormonal profiles, rendering them hermaphroditic. Humans may tolerate higher levels of atrazine than amphibians, but the chemical’s marked effect on animals and ecosystems at levels lower than previously thought is cause for concern. Organic systems, which do not rely on synthetic inputs, leach zero atrazine.\n   Organic oats grown in systems utilizing legume cover crops contain significantly greater total protein concentration (Figure 2) along with a suite of essential and non-essential amino acids. We also found significantly greater soil carbon and nitrogen (the building blocks of proteins) in both organic systems compared to the conventional system.\n   In 2016, our no-till organic manure systems produced 200 bushels of corn per acre—a record-breaking yield for our county that was almost twice the conventional no-till system (Figure 3).", "posttime": "2020-10-19 20:32:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免耕,farming,有机", "title": "自1981年起试行免耕免除草剂耕作制度", "title_en": "No-till no-herbicide farming system in trial since 1981", "transed": 1, "url": "https://rodaleinstitute.org/science/farming-systems-trial/", "via": "", "real_tags": ["免耕", "farming", "有机"]}, {"category": "", "categoryclass": "", "imagename": "894d990d8178f819b9f59e77e35f4e69.png", "infoid": 1029780, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从网页中提取主要内容的命令行工具，就像大多数现代浏览器的阅读器视图功能所做的那样。它旨在与终端RSS阅读器一起使用，使文章在Lynx等网络浏览器上更具可读性。代码紧密地改编自Firefox版本，预计输出结果大体上是等效的。\n这个工具很年轻，而且是用C语言编写的，所以我们有理由怀疑潜在的内存问题。为安全起见，所有HTML解析都发生在一个加载子过程中。Seccomp用于此目的。\n有三个直接依赖项：libxml2、libseccomp和libcurl。在Debian/Ubuntu上，您可以通过运行(作为root)来安装前两个依赖项：\nLibcurl包有不同的风格，具体取决于提供SSL支持的后端。任何一个都行。要安装GNUTLS版本，请执行以下操作：\n要使rdrview有用，您还应该获得字符模式Web浏览器，如lynx：\n在您的发行版中，包的名称可能不同。例如，在Fedora上，您可以使用以下命令安装所有内容：\n如果您发现rdrview很有用并想要安装它，请再次成为root用户并运行。\n现在，您只需使用rdrview调用它，并获得man rdrview的帮助，就像您对系统中的任何其他工具所做的那样。\nRdrview是由Ernesto A.Fernández编写的，但它主要是由Mozilla的Readability(可读性)手写的，用他们自己的话说，这本身就是在很大程度上基于Arc90；Sreadability ity.js；。这是原始许可证：\n版权所有(C)2010Arc902.0版许可(许可)；除非遵守许可，否则您不能使用本文件。您可以从http://www.apache.org/licenses/LICENSE-2.0Unless获取适用法律要求或书面同意的许可副本，在许可下分发的软件按原样分发，没有任何形式的担保或条件，无论是明示的还是默示的。有关许可下管理权限和限制的特定语言，请参阅许可。", "note_en": "Command line tool to extract the main content from a webpage, as done by the&#34;Reader View&#34; feature of most modern browsers. It&#39;s intended to be used withterminal RSS readers, to make the articles more readable on web browsers suchas lynx. The code is closely adapted from the Firefox versionand the output is expected to be mostly equivalent.\n  This tool is young and written in C, so it&#39;s reasonable to wonder about thepotential for memory issues. To be safe, all HTML parsing happens inside asandboxed subprocess. Seccomp is used for this purpose.\n  There are three direct dependencies: libxml2, libseccomp and libcurl.On Debian/Ubuntu, you can install the first two by running (as root):\n  The libcurl package comes in different flavours, depending on the backend thatprovides the SSL support. Any of them will do. To install the GnuTLS version:\n  For  rdrview to be useful, you should also get a character mode web browsersuch as lynx:\n  The name of the packages might differ in your distribution. On Fedora, forexample, you can install everything with:\n        If you find  rdrview useful and want to install it, become root again and run\n  Now you can just call it with  rdrview and get help with  man rdrview, likeyou would for any other tool in your system.\n  rdrview was written by Ernesto A. Fernández,but it&#39;s mainly a transpilation done by hand of Mozilla&#39;s  Readability.js;which was itself, in their own words, &#34;heavily based on Arc90&#39;sreadability.js&#34;. This is the original license:\n Copyright (c) 2010 Arc90 IncLicensed under the Apache License, Version 2.0 (the &#34;License&#34;);you may not use this file except in compliance with the License.You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0Unless required by applicable law or agreed to in writing, softwaredistributed under the License is distributed on an &#34;AS IS&#34; BASIS,WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.See the License for the specific language governing permissions andlimitations under the License.", "posttime": "2020-10-19 20:32:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,firefox,rdrview", "title": "Rdrview-作为Linux命令行工具的Firefox Reader视图", "title_en": "Rdrview – Firefox Reader View as a Linux command line tool", "transed": 1, "url": "https://github.com/eafer/rdrview", "via": "", "real_tags": ["linux", "firefox", "rdrview"]}, {"category": "", "categoryclass": "", "imagename": "e2b8bc38276bc158265a5470ba58d117.png", "infoid": 1029778, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1935年，一位名叫阿隆佐·丘奇的绅士想出了一个可以计算…的简单方案。几乎什么都行。他的方案被称为兰姆达微积分(Lambda Calculus)。这是一项非凡的创新，因为他甚至没有电脑来测试他的想法。更酷的是，这些想法在今天影响着我们：任何时候你使用一个函数，你都应该向丘奇先生致敬。\nLambda演算是如此酷，以至于许多黑客将其用作秘密握手--如果你愿意的话，这是一个“谨慎的信号”。当然，最著名的是PG的Y组合器。在这篇文章中，我们将找出它的全部内容，并用我们从未想象过的功能来做一些事情。最后，您将构建几乎所有的编程概念：数字、布尔值，您可以将其命名为…。只需使用函数即可。\n开SUV的城市居民很少认为他们的汽车是穿越多岩石的沙漠和洪水泛滥的河流的凶猛机器。程序员和函数也是如此。下面是我们认为函数的作用：\n安全、干净、有用。我们已经习以为常了，如果我们发现我们可以用无数种方法来弯曲函数来做任何事情，那会让我们大吃一惊。\n让我们到荒野里走一走吧。假设您想为Pair创建一个数据结构：\n你会怎么做呢？使用地图、类或记录来表示一对是明智的。但是…。您也可以使用函数。\n现在我们的前搭档接受一个选择器参数。如果我们用这个选择器运行前任配对会怎么样：\n这正好给我们带来了我们这双鞋的第一个价值！我们可以用它来编写教堂优先函数：\n我们只是用函数来表示对。现在，由于Lisp的语法只是一堆组合在一起的对，这也意味着我们可以表示Lisp…的语法。功能齐全！\n我们刚才所做的类似于一个城市居民驾驶他们的越野车…。在一个下雪的日子里。它变得更疯狂了。\n这就是我们能做的。让我们取一个我们熟悉和喜爱的函数，并在Lambda演算中自上而下地实现它。\n在本文结束时，我们将只使用函数构建阶乘。\n为了做到这一点，我想走到前面说我有一点作弊。在丘奇的Lambda演算中，没有定义，所有函数都有一个参数。以下是他所说的：\n在他的规则中，您通过在前面弹出一个小λ来定义匿名函数。下面是参数，后面跟着一个。.在..之后。是应用程序。\n这非常类似于clojure中的单参数匿名函数：λx.x=&gt；(fn[x]x)。\n我们可以遵循这些规则，但是像那样编写阶乘将很难很快得到推理。让我们稍微调整一下规则。这些更改不会影响Lambda演算的本质，但会使我们更容易考虑代码。它是这样的：\n1)对于单参数函数，(fn[x]x)很好地映射到Church的编码。我们可以继续按原样使用它。\n2)由于Church的lambdas只接受一个参数，要用两个参数表示一个函数，他必须编写两个匿名函数：\n但是，在Clojure 1中，像这样嵌套我们的函数可能会很烦人。为了让我们的工作更轻松，我们将允许使用多参数函数：\n3)最后，除了函数定义提供的变量之外，Church没有变量的概念。\n为了使我们的代码保持正常，我们将允许def，但有一条规则：\n您可以使用def，只要您可以用匿名函数“替换”它并且没有中断。\n这将中断，因为如果我们替换(定义Make-Pair…)。使用匿名函数，将不再有名为Make-Pair的变量！\n就是这样，这是我们的规矩。有了这些，我们就可以做阶乘了！\n我们首先需要的是数字的概念。我们怎么能做到这一点呢？\n丘奇想到了一个很酷的主意。如果是“Numbers”，其中高阶函数有两个参数：函数f和值v，情况会怎样呢？\n(def零(fn[f v]v))(def one(fn[f v](f(零f v)(def Two(fn[f v](f(One F V)。\n我们可以通过“计数”f被合成的次数来计算出每个函数代表的数字。\n例如，0将合成f的次数为零：它只返回v。1，将合成f一次：(Fv)。2将组成两次：(F(f，v))，依此类推。\n为了帮助我们在REPL中查看这些数字，让我们创建一个快速转换器函数：\n因为教堂数字由它被调用的次数组成，其中v是第一个参数，所以我们需要知道它在Clojure中是什么数字，只需提供Inc作为f，提供0作为v！例如，现在2将做(Inc(Inc0))，并为我们获得相应的Clojure编号。\n我们在这里做的是委托f组成前面的数字(在本例中是1)，然后再调用f一次。\n瞧啊。给这个函数一个数字，它将返回一个新的数字，并再次调用f。我们刚刚发现了Inc.！\n现在我们有了这个函数，我们还可以编写一个快速帮助器将Clojure数字转换为这些数字：\n接下来，我们需要一种方法来“递减”一个数字。嗯，使用Inc，我们再一次创建一个组成f的数字。如果我们能少做一次组成f的函数，那么我们就有了dec！\n还记得我们的配对数据结构吗？让我们为它创建一个函数(我们稍后会用到这个函数)：Shift-and-Inc。它所要做的就是取一对数字，并将这对数字“前移”一位：\n例如，对(0 1)应用Shift-and-Inc将生成(1 2)。再一次，它将产生(2 3)，依此类推。\n班姆，我们拿一双。第二件物品被移到第一个位置，并被它的刻痕朋友取代。让我们试试看：\n(设[p(Shift-and-Inc(教堂对一二))](映射教堂数字-&gt；int[(教堂第一个p)(教堂第二个p)]))；=&gt；(23)。\n请记住，我们的教堂数字将调用Shift-and-Inc N次，表示其数值。如果我们从一个对(0，0)开始，那么如果我们将Shift-and-Inc.组合N次，那么结果b会是什么呢？\n我们的结果将是对(N-1，N)。这意味着如果我们把我们对的第一部分取走，我们就有了12月！\n接下来是乘法。假设我们用a乘以b，我们需要产生一个教会数字，组成f，a*b次。要做到这一点，我们可以利用以下想法：\n假设我们做了一个函数g，它组成了f，b次。如果我们把这个函数提供给a，它会调用g，a次。\n如果a是“2”，“b”是3，f会合成几次？嗯，g会组成两次。每次合成g，就合成f 3次。一共出了6次！\n我们有数字，我们有*，我们有12月。Next Up…。布尔人！\n他们接受一个“真”案和一个“假”案。我们的chorge-true函数将返回true case，而chocket-false函数将返回false case。\n就这样。令人惊讶的是，这足以处理布尔值。下面是我们如何将它们转换为Clojure bools。\n我们的教堂-true将返回第一个参数(True)，而我们的教堂-false将返回第二个参数！\n他们看起来眼熟吗？这就是我们教会第一和教会第二的选择器功能！如果我们愿意，我们可以互换它们，😮。\n如果你和我一样，你对那些布尔人有点怀疑。让我们好好利用它们，平息我们的恐惧吧。下面是如何创建If结构的方法：\n我们要做的所有事情就是简单地将事物打乱，并向我们的布尔值提供When-True和When-False的情况！Church-true将返回When-True大小写，而Church-False将返回When-False大小写。\n我们几乎拥有实现阶乘所需的所有构造。少了一块：零块？我们需要一种方法来判断数字何时为零。\n如果一个数字大于零，则会调用f，这会将v替换为chocket-false。否则，我们将返回v的初始值，教堂为真。\n嗯，我们有数字，我们有如果，我们有零？我们有*，我们有12月。我们可以这样翻译：\n(def阶乘-V0(Fn[教会数字-n](教会-IF(教会-零？教堂数字-n)(fn[]one)(fn[](教堂-*教堂数字-n(阶乘-v0(教堂-十二月教堂-数字-n)。\n唯一奇怪的是，我们将WHEN-TRUE和WHEN-FALSE案例包装在一个匿名函数中。这是因为我们的教会IF与Clojure的IF略有不同。Clojure的IF只评估WHEN-TRUE和WHEN-FALSE案例中的一个。我们的方法对这两种情况都求值，这会触发无限递归。我们通过将两种情况都包装在一个lambda中来避免这一点，这会“延迟”我们的评估。2个\n好的，差不多了。我们作弊了。记住我们的规则3：如果我们用匿名函数替换变量，一切都应该正常工作。如果我们将阶乘-V0编写为匿名函数，会发生什么情况？\n(fn[教堂-数字-n]((教堂-IF(教堂-零？教堂数字-n)(fn[]one)(fn[](教堂-*教堂数字-n；：&lt；：&lt；呃oh(factorial-v0(教堂-12月教堂-数字-n)。\n这里有一种我们可以解决的方法。我们可以更新这一点，这样阶乘就可以作为参数提供给它自己。\n(Fn[阶乘-Cb](Fn[教会数字-n])((教会-IF(教会-零？教堂数字-n)(fn[]one)(fn[](教堂-*教堂数字-n(factorial-cb(教堂-12月教堂-数字-n)？)。\n那是可行的，但我们只是把问题轻描淡写。他妈的会怎么做？是吗？我们需要某种方式将阶乘的引用传递给它本身！\n让我们看看我们能不能把这件事办好。首先，让我们编写阶乘，它接受自身的某种“可注入”版本：\n(def可注射-阶乘(Fn[阶乘-Cb](Fn[教会数字-n])((教会-IF(教会-零？教堂数字-n)(fn[]one)(fn[](教堂-*教堂数字-n(阶乘-cb(教堂-十二月教堂-数字-n)。\n好的，我们现在所做的就是将问题转移到这个Make-Recursable函数😅中。请耐心听我说。\n让我们想象一下解决方案需要看起来是什么样子。我们希望使用某个阶乘cb函数调用injectable-f来处理“下一次调用”。\n这似乎是对的。请注意注释递归处理程序。这是针对此表单的：\n如果我们以某种方式访问此表单，我们可以在？！中使用它。好吧，让我们把这个问题再说一遍：\n在这里，我们将递归处理程序包装到一个函数中。如果它能自己复制一份，我们就大功告成了。但这意味着我们又回到了同样的问题上：我们如何才能给递归处理程序一个自身的副本呢？这里有一个想法：\n(def make-recursable(fn[Injectable-f]((fn[递归处理程序](递归处理程序递归处理程序)(fn[递归处理程序](Injectable-f(Fn[Next-Arg]((递归处理程序递归处理程序)Next-Arg)。\n这将最终产生一个具有阶乘CB的新阶乘函数。然后我们就用Next-Arg来称呼它，让派对继续进行下去！\n这个Make-Recursable函数也称为Y组合器。你可能听说过很多关于它的事情，这个例子可能很难效仿。如果你想了解更多，我推荐吉姆的主题演讲。\n哇，我们做到了。我们刚刚编写了阶乘，所有我们使用的都是匿名函数。为了证明这一点，让我们删除一些规则。下面是我们的代码在没有任何变量定义的情况下将如何结束：\n(教堂-数字-&gt；Int(Fn[Injectable-f]((Fn[递归处理程序](递归处理程序递归处理程序)(Fn[递归处理程序](Injectable-f(Injectable-f(Fn[Next-Arg]((递归处理程序递归处理程序)Next-Arg)(Fn[阶乘-Cb](Fn[教堂数字-n](Fn[教堂布尔When-true When-False](教堂布尔When-True-False)。TRUE WHEN-FALSE))((FN[教堂编号](教堂编号(FN[v](Fn[WHEN-TRUE WHEN-FALSE]WHEN-FALSE]WHEN-FALSE))(FN[WHEN-TRUE WHEN-FALSE]WHEN-TRUE)教堂编号-n)(FN[](Fn[](Fn[f v](f((Fn[f v]v)f v)(Fn[]((Fn。[num-a num-b](fn[fv](num-a(部分num-bf)v))教堂数字-n(阶乘-cb((fn[教堂数字]((fn[a b]a)(教堂数字(fn[对](fn[b]a))((fn[b]((fn[a b](fn[选择器](选择器a b)(fn[对。](Pair(Fn[a b]b))Pair)((Fn[教堂数字](Fn[f v](f(教堂数字f v)((Fn[Pair](Pair(Fn[a b]b)((Fn[a b](Fn[选择器](选择器a b)(Fn[f]v)(fn[f]v)(fn[f]。V)教堂编号-n)((fn[教堂编号](fn[f v](f(教堂编号f v)((fn[教堂编号](fn[f v](f(教堂编号f v)((fn[教堂编号](fn[f v](f(教堂编号f v)(fn。[fv](f((fn[fv](f((fn[fv]v)fv)。\n我们刚刚把我们的任务带过了莫哈韦沙漠！我们制作了数字、布尔值、算术和递归…。全部来自匿名函数。希望你玩得开心！如果您想查看完整的代码，请查看GH回购。\n我将带着一些Clojure宏观乐趣离开。当用匿名函数“替换”所有Deff的时候，我们是如何做到的呢？\n在较弱的语言中，我们可能需要手动复制粘贴3。在LISP中，我们可以使用宏。\n首先，让我们重写def。此版本将每个def的源代码“存储”为元数据：\n(def宏def#&#34；`def`周围的轻型包装，用于跟踪此let的每个定义的_source code_后面的us_unwork_all定义：&gt；&#34；[name v]`(do(def~name~v)(alt-meta！(var~name)assoc：source{：name&#39；~name：v&#39；~v})(var~name))。\n然后，我们可以创建一个展开函数，该函数递归地将所有def符号替换为其对应的源代码：\n(Defn Expand&#34；this采用类似于(chorge-numeral-&gt；int(factorial-yc(int-&gt；chetch-numeral 5)的形式，并展开所有函数定义，让我们直观地看到我们的lambda演算方法会是什么样子！&#34；[form](cond(Symbol？Form)(if-let[source(ome-&&gt;；(str*ns*&34；/&#34；form)符号find-var meta：source)](展开(：v source))form)(序号？表单)(地图展开表单)：ELSE表单))\n感谢Alex Reichert，Daniel Woelfel，Sean Grove，Irakli Safareli，Alex Kotliarskyi，Davit Magaltadze，Joe Averbukh审阅本文草稿", "note_en": "In 1935, a gentleman called Alonzo Church came up with a simple scheme that could compute…just about anything. His scheme was called Lambda Calculus. It was a phenomenal innovation, given that there weren’t even computers for him to test out his ideas. Even cooler is that those very ideas affect us today: anytime you use a function, you owe a hat tip to Mr. Church.\n Lambda Calculus is so cool that many hackers use it as their secret handshake — a “discreet signal” if you will. The most famous, of course, is PG’s Y Combinator. In this essay, we’ll find out what it’s all about, and do things with functions that we’d never have imagined. In the end you’ll have built just about every programming concept: numbers, booleans, you name it…just with functions.\n  City dwellers who drive SUVs rarely consider their cars as ferocious machines that traverse rocky deserts and flooded rivers. It’s the same with programmers and functions. Here’s what we  think functions do:\n  Safe, clean, and useful. We’re so accustomed that it would surprise us to find the myriad of ways we can bend functions to do just about anything.\n Let’s step out into the wilderness a bit. Say you wanted to make a data structure for pairs:\n  How would you do it? It’s sensible to use a map or a class or a record to represent a pair. But…you could use functions too.\n     Now our  ex-pair takes a  selector argument. What if we ran ex-pair with this selector:\n     That just gave us the  first value of our pair! We can use that to write a  church-first function:\n      We just used functions to represent pairs. Now, since the grammar for Lisp is just a bunch of pairs plopped together, that also means we can represent the grammar of Lisp…with just functions!\n  What we just did was analogous to a city dweller driving their SUV…on a snowy day. It gets a  lot crazier.\n  Here’s what can do. Let’s take a function we know and love, and implement it from top-to-bottom in Lambda Calculus.\n    By the end of this essay, we’ll have built factorial, only with functions.\n  To do this, I want to come up front and say I am cheating a little bit. In Church’s Lambda Calculus, there is no  def, and all functions take one argument. Here’s all he says:\n  In his rules, you define anonymous functions by popping a little  λ in front. What follows is the argument, following by a  . .After the  . is the application.\n This is very much akin to a single-argument anonymous function in Clojure:  λ x. x =&gt;  (fn [x] x)\n We could follow those rules, but writing factorial like that is going to get hard to reason about very quickly. Let’s tweak the rules just a little bit. The changes won’t affect the essence of Lambda Calculus but will make it easier for us to think about our code. Here it goes:\n  1) for a single argument function,  (fn [x] x) maps pretty well to Church’s encoding. We can go ahead and use it as is.\n 2) Since Church’s lambdas only take one argument, For him to express a function with two arguments, he has to write  two anonymous functions:\n    But, nesting our functions like this can get annoying in Clojure  1. To make life easier for us, we’ll allow for multi-argument functions:\n  3) Finally, Church has no concepts of variables outside of what’s provided by a function definition.\n     To keep our code sane, we’ll allow for  def, but with one rule:\n You can use   def  , as long as you can “replace” it with an anonymous function and nothing breaks.\n   This would break because if we replaced  (def make-pair …) with an anonymous function, there would be no variable called  make-pair anymore!\n That’s it, these are our rules. With that, we’re ready to make factorial!\n  The first thing we need is the concept of a number. How can we do that?\n Church thought of a pretty cool idea. What if “numbers”, where higher-order functions with two arguments: a function  f, and a value  v.\n ( def  zero ( fn  [f v] v)) ( def  one ( fn  [f v]  ( f  ( zero  f v)))) ( def  two ( fn  [f v]  ( f  ( one  f v))))\n We can figure out what number each function represents by “counting” the number of times   f  was composed.\n For example, 0 would compose  f zero times: it would just return  v. 1, would compose f once:  (f v). 2 would compose twice:  (f (f v)), and so on.\n To help us see these numbers in our REPL, let’s create a quick converter function:\n  Since a church numeral composes  f the number of times it is called with  v as the first argument, all we need to see what number it is in Clojure, is to provide  inc as  f and  0 as  v! Now  2 would do  (inc (inc 0)) for example, and get us the corresponding Clojure number.\n      What we did here, is  delegate f’s composition to the numeral before (in this case  one ), and then just called  f  one more time.\n   Voila. Give this function a numeral, and it will return a new numeral that calls  f  one more time. We’ve just discovered  inc!\n   Now that we have this function, we can also write a quick helper to translate Clojure numbers to these numbers:\n     Next up, we need a way to “decrement” a number. Well, with  inc we create a numeral that composes  f  one more time. If we can make some kind of function that composes  f  one less time, then we’d have  dec!\n   Remember our  pair data structure? Let’s create a function for it (we’ll use this in just a moment below):  shift-and-inc. All it would do, is take pair of numbers, and “shift” the pair forward by one:\n For example, applying  shift-and-inc to  (0 1), would produce  (1 2). One more time, it would produce  (2 3), and so on.\n   Bam, we take a pair. The second item is shifted over to the first positions and is replaced with its  inced friend. Let’s try it out:\n ( let  [p ( shift-and-inc  ( church-pair  one two))]  ( map  church-numeral-&gt;int [( church-first  p) ( church-second  p)])) ; =&gt; (2 3)\n     Remember that our  church-numeral would call  shift-and-inc N times, representing its numeral value. If we started with a pair  (0, 0), then what would the result b, if we composed  shift-and-inc  N times?\n Our result would be the pair  (N-1, N). This means that if we take the first part of our pair, we have  dec!\n    Next up, multiplication. Say we multiply  a by  b. We’d need to produce a church numeral that composes  f,  a * b times. To do that, we can leverage the following idea:\n Say we made a function  g, which composes  f  b times. If we fed that function to  a, it would call  g,  a times.\n  If  a was “2” and “b” was 3, how many times would  f get composed? Well,  g would be composed twice. Each time  g is composed,  f is composed 3 times. That comes out to a total of 6 times!\n       We’ve got numbers, we’ve got  * and we’ve got  dec. Next up…booleans!\n    They take a “true” case and a “false” case. Our  church-true function would return the true case, and  church-false function would return the false case.\n That’s it. Surprisingly this is enough to handle booleans. Here’s how we could convert them to Clojure bools.\n  Our  church-true would return the first argument (true), and our  church-false would return the second one!\n  Do they look familiar? Those are our  selector functions for  church-first and  church-second! We could interchange them if we wished 😮\n  If you are like me, you were a bit suspicious of those booleans. Let’s put them to use and quiet our fears. Here’s how could create an  if construct:\n  All we do to make  if, is to simply shuffle things around and provide the  when-true and  when-false cases to our boolean!  church-true would return the  when-true case, and  church-false would return the  when-false case.\n    We have almost  all the constructs we need to implement  factorial. One missing piece:  zero?. We need a way to tell when a numeral is zero.\n     If a number is greater than zero,  f would be called, which would replace  v with  church-false. Otherwise, we’d return the initial value of  v,  church-true.\n      Well, we have  numerals, we have  if, we have  zero? we have  *, we have  dec. We could translate this:\n ( def  factorial-v0  ( fn  [church-numeral-n]  (( church-if  ( church-zero?  church-numeral-n)  ( fn  [] one)  ( fn  []  ( church-*  church-numeral-n  ( factorial-v0  ( church-dec  church-numeral-n))))))))\n  The only weird thing is that we wrapped the  when-true and  when-false cases in an anonymous function. This is because our  church-if is a little different than Clojure’s  if. Clojure’s if  only evaluates one of the  when-true and  when-false cases. Ours evaluates both cases, which triggers an infinite recursion. We avoid this by wrapping both cases in a lambda, which “delays” the evaluation for us.  2\n     Okay, almost. We cheated. Remember our  Rule 3:  If we replace our variables with an anonymous function, everything should work well. What would happen if we wrote  factorial-v0 as an anonymous function?\n ( fn  [church-numeral-n]  (( church-if  ( church-zero?  church-numeral-n)  ( fn  [] one)  ( fn  []  ( church-*  church-numeral-n   ; :&lt; :&lt; :&lt; :&lt; uh oh  ( factorial-v0  ( church-dec  church-numeral-n)))))))\n  Here’s one way we can fix it. We could update this so  factorial is  provided as an argument to itself.\n ( fn  [factorial-cb]  ( fn  [church-numeral-n]  (( church-if  ( church-zero?  church-numeral-n)  ( fn  [] one)  ( fn  []  ( church-*  church-numeral-n  ( factorial-cb  ( church-dec  church-numeral-n)))))))  ????)\n That  would work, but we only punt the problem down. What the heck would  ???? be? We need some way to pass a reference of  factorial to  itself!\n  Let’s see if we can do make this work. First, let’s write our factorial, that accepts some kind of “injectable” version of itself:\n ( def  injectable-factorial  ( fn  [factorial-cb]  ( fn  [church-numeral-n]  (( church-if  ( church-zero?  church-numeral-n)  ( fn  [] one)  ( fn  []  ( church-*  church-numeral-n  ( factorial-cb  ( church-dec  church-numeral-n)))))))))\n    Okay, all we did now is move the problem into this  make-recursable function 😅. Bear with me.\n Let’s imagine what the solution would need to look like. We’d want to call  injectable-f with some  factorial-cb function handles the “next call”.\n  That seems right. Note the comment  recursion-handler . This is in reference to this form:\n  If we somehow had access to this form, we can use that in  ????! Well, let’s punt the problem down again:\n  Here, we wrap our  recursion-handler into a function. If it could get a copy of itself, we’d be golden. But that means we’re back to the same problem: how could we give  recursion-handler a copy of itself?  Here’s one idea:\n ( def  make-recursable  ( fn  [injectable-f]  (( fn  [recursion-handler] ( recursion-handler  recursion-handler))  ( fn  [recursion-handler]  ( injectable-f  ( fn  [next-arg]  (( recursion-handler  recursion-handler) next-arg)))))))\n                      This would end up producing a new  factorial function that had a  factorial-cb. Then we would call that with  next-arg, and keep the party going!\n     This  make-recursable function is also called the Y Combinator. You may have heard a lot of stuff about it, and this example may be hard to follow. If you want to learn more, I recommend  Jim’s keynote.\n  Wow, we did it. We just wrote  factorial, and  all we used were anonymous functions. To prove the point, let’s remove some of our rules. Here’s how our code would end up looking without any variable definitions:\n ( church-numeral-&gt;int  ((( fn  [injectable-f]  (( fn  [recursion-handler] ( recursion-handler  recursion-handler))  ( fn  [recursion-handler] ( injectable-f  ( fn  [next-arg] (( recursion-handler  recursion-handler) next-arg))))))  ( fn  [factorial-cb]  ( fn  [church-numeral-n]  ((( fn  [church-bool  when-true   when-false ] ( church-bool   when-true   when-false ))  (( fn  [church-numeral]  ( church-numeral  ( fn  [v] ( fn  [ when-true   when-false ]  when-false )) ( fn  [ when-true   when-false ]  when-true )))  church-numeral-n)  ( fn  [] ( fn  [f v] ( f  (( fn  [f v] v) f v))))  ( fn  []  (( fn  [num-a num-b] ( fn  [f v] ( num-a  ( partial  num-b f) v)))  church-numeral-n  ( factorial-cb  (( fn  [church-numeral]  (( fn  [pair] ( pair  ( fn  [a b] a)))  ( church-numeral  ( fn  [pair]  (( fn  [a b] ( fn  [selector] ( selector  a b)))  (( fn  [pair] ( pair  ( fn  [a b] b))) pair)  (( fn  [church-numeral] ( fn  [f v] ( f  ( church-numeral  f v)))) (( fn  [pair] ( pair  ( fn  [a b] b))) pair))))  (( fn  [a b] ( fn  [selector] ( selector  a b))) ( fn  [f v] v) ( fn  [f v] v)))))  church-numeral-n)))))))))  (( fn  [church-numeral] ( fn  [f v] ( f  ( church-numeral  f v))))  (( fn  [church-numeral] ( fn  [f v] ( f  ( church-numeral  f v))))  (( fn  [church-numeral] ( fn  [f v] ( f  ( church-numeral  f v)))) ( fn  [f v] ( f  (( fn  [f v] ( f  (( fn  [f v] v) f v))) f v))))))))\n    Well, we just took our functions through the Mojave desert! We made numbers, booleans, arithmetic, and recursion…all from anonymous functions. I hope you had fun! If you’d like to see the code in full, take a look at the  GH repo.\n  I’ll leave with you with some Clojure macro fun. When the time came to “replace” all our  defs with anonymous functions, how did we do it?\n In wimpier languages we might have needed to do some manual copy pastin  3. In lisp, we can use  macros.\n First, let’s rewrite  def. This version will “store” the source code of every  def as metadata:\n ( defmacro  def#   &#34;A light wrapper around `def`, that keeps track of the  _source code_ for each definition  This let&#39;s us _unwrap_ all the definitions later : &gt;&#34;  [name v]  `( do  ( def  ~name ~v)  ( alter-meta!  ( var  ~name) assoc  :source  { :name  &#39;~name  :v  &#39;~v})  ( var  ~name)))\n Then, we can create an  unwrap function, that recursively replaces all  def symbols with with their corresponding source code:\n ( defn  expand   &#34;This takes a form like  (church-numeral-&gt;int (factorial-yc (int-&gt;church-numeral 5)))  And expands all the function definitions, to give  us the intuition for how our &#39;lambda calculus&#39; way would look!&#34;  [form]  ( cond  ( symbol?  form)  ( if-let  [source ( some-&gt;  ( str  *ns*  &#34;/&#34;  form)  symbol  find-var  meta   :source )]  ( expand  ( :v  source))  form)  ( seq?  form)  ( map  expand form)   :else  form))\n     Thanks to Alex Reichert, Daniel Woelfel, Sean Grove, Irakli Safareli, Alex Kotliarskyi, Davit Magaltadze, Joe Averbukh for reviewing drafts of this essay", "posttime": "2020-10-19 20:31:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微积分,lambda,函数", "title": "兰姆达微积分的乐趣", "title_en": "Fun with Lambda Calculus", "transed": 1, "url": "https://stopa.io/post/263", "via": "", "real_tags": ["微积分", "lambda", "函数"]}]