[{"category": "", "categoryclass": "", "imagename": "1d44b0cedf48716de7eb64b56df9bad4.jpeg", "infoid": 1066996, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "启动Brightline筹集了7200万美元，以推动其虚拟行为健康解决方案的国家扩展，专门用于支持儿童，青少年及其家庭。\n   GV（以前谷歌企业）LED Brightline的B型系列，并参与新的投资者Optument，7次Wireventures和Gaingels，领先的风险投资联合支持多样性和代表LGBTQ社区和盟友。德布拉李，主席兼首席执行官Emeritus，BET网络，也为独立投资者贡献。\n  返回投资者在圆周包括OAK HC / FT，阈值风险，加州的蓝色盾牌，Massachusetts的蓝色交叉蓝盾，Sempervirens VC和城市轻资本。\n 该圆包括硅谷银行的700万美元的风险债务。明亮的线现在已经提高了迄今为止近1亿美元的资金。\n Brightline，以前艾米利奥医疗保健，为儿童及其家人制定了一种能够为能够为能够的行为健康住宅。根据Brightline的说法，该公司在行为健康状况飙升并对工作家庭产生不成比例的影响方面的行为健康状况的速度和对工人的生产率损失和员工造成的猖獗的生产率丧失和员工进行员工的影响。\n  根据人口普查局的数据，约有1000万岁的美国母亲与学龄儿童的母亲居住在2021年的校龄儿童的初期没有工作，比上年增加了140万美元。\n BrightLine对工作父母和护理人员的自身调查发现，50％的人报告称，在照顾孩子的行为健康需求的工作中失去了显着的生产力。 \n据Brightline高管表示，需要进行以家庭为导向的解决方案来提供行为保健服务。\n “在过去的一年里，各地的家庭都感受到了大流行对他们的孩子和日常生活的影响。我们看到更多的儿童，青少年和青少年，而不是以前与行为健康挑战 - 现在是我们在需要领先于未来的需要的时候，“Naomi Allen，Brightline Ceo和联合创始人在一份声明中说。 “我们很幸运能够在GV和我们所有的投资者中拥有令人难以置信的合作伙伴，他们加入了我们在儿童和家庭的生活中有所作为。最新的资金将使我们能够更快地创新，迅速扩大，帮助更多的儿童和家庭获得应得的照顾。“\n 据该公司称，Brightline将使用现金输液来扩展其全国范围内的虚拟护理，以推动公司＆＃39;由于该公司的领先国家雇主和主要卫生计划为其伴侣提供了对家庭的行为健康支持。\n “CDC数据显示，5中的美国儿童估计有1例精神或行为健康状况，但80％不会得到他们需要的照顾。 “小儿行为医疗保健通常不太可达，而不是对成年人的关心，”GV罗宾斯（Ben Robbins）表示，在GV董事会加入Brightline的董事会。 “Brightline解决了儿科行为健康服务的巨大未满足需求，并且在患者和家庭的需求基础上提供多种级别的护理。”\n Livongo创始人Glen Tullman，现任Transcarent and Managing合作伙伴的首席执行官，7名Wireventures，以及Laura Veroneau，Optum Ventures的合作伙伴，正在加入Brightline作为董事会观察员。\n BrightLine还宣布他们正在开始最大的扩张迄今为止，并在全国范围内推出新产品，并向新州扩展临床服务。\n 在2019年推出，Brightline＆＃39; S平台提供多学科护理团队，以家庭为重点的方法和基于证据的护理，以及创新的技术，Brightline能够以任何挑战为主的家庭。 \n远程医疗帮助使精神保健更容易通过消除往返以及经常预约的一些物流负担来获得儿童。\n  数字健康市场中有一些儿科初创性初创公司。 Hazel Health在学校护士内部经营虚拟护理诊所和办公室，通过远程健康将学生连接到医生，最近降落了3300万美元的资金。萌芽，一种技术化的自闭症护理和治疗计划，于7月推出，在种子资金1000万美元的后面推出。\n 黎明健康是另一个初创公司试图解决孩子心理保健中的差距。该公司于2020年2月推出，专门提供在线咨询服务，特别是青少年。\n Brighline推出了全国可用性的新产品，并正在向新州扩展临床服务。本夏天将在今年夏天提供家庭和第39页的Connect功能，提供家庭访问个性化内容和提示，互动练习和与支援的教练聊天的能力。\n 今年夏天，Brightline Coaching功能也在全国范围内扩大，提供了行为健康教练支持的家庭，以帮助应力，焦虑，组织技能，发脾气，破坏性行为和社会情感学习等问题。\n 该公司表示，截至2021年底，全国范围内提供奖金护理，以支持国家雇主和卫生计划。 Brightline的临床服务 - 包括行为治疗，药物支持和语音治疗 - 现在可以在加利福尼亚和马萨诸塞州提供，七月与华盛顿发射，几个州即将推出。 Brightline希望将这些服务扩展到全部50个州，到今年年底。 ", "note_en": "Startup Brightline scored $72 million to fuel the national expansion of its virtual behavioral health solution designed specifically to support children, teenagers, and their families.\n   GV (formerly Google Ventures) led Brightline’s series B round, with participation from new investors Optum Ventures, 7wireVentures, and Gaingels, the leading venture investment syndicate in support of diversity and representing the LGBTQ community and allies. Debra Lee, chairman and CEO Emeritus, BET Networks, also contributed to the round as an independent investor.\n  Returning investors in the round include Oak HC/FT, Threshold Ventures, Blue Shield of California, Blue Cross Blue Shield of Massachusetts, SemperVirens VC and City Light Capital.\n The round includes $7 million of venture debt from Silicon Valley Bank. Brightline has now raised a total of nearly $100 million in funding to date.\n Brightline, formerly Emilio Healthcare, developed a technology-enabled behavioral health home for children and their families. The company&#39;s growth comes at a time when rates of behavioral health conditions are skyrocketing across the country and having a disproportionate impact on working families—leading to rampant productivity loss and employees leaving the paid workforce in droves, according to Brightline.\n  Around 10 million American mothers living with their school-age children were not working at the start of 2021, a 1.4 million increase over the previous year, according to data from the Census Bureau.\n Brightline’s own survey of working parents and caregivers found that 50% reported losing significant productivity at work in caring for their children’s behavioral health needs.\n There is a need for family-oriented solutions to deliver behavioral health care services, according to Brightline executives.\n “In the past year, families everywhere have felt the impact of the pandemic on their children and daily lives. We’re seeing more children, adolescents, and teens than ever with behavioral health challenges—now is the time for us to get ahead of the coming wave of need,” said Naomi Allen, Brightline CEO and co-founder in a statement. “We are fortunate to have incredible partners in GV and all of our investors who joined us to make a difference in the lives of children and families. The latest funding will allow us to innovate even more quickly, expand rapidly, and help more children and families get the care they deserve.”\n Brightline will use the cash infusion to scale its virtual care across the country—fueling the company&#39;s growth as it partner with leading national employers and major health plans to bring behavioral health support to families, according to the company.\n “CDC data shows that an estimated 1 in 5 U.S. children has a diagnosed mental or behavioral health condition—yet 80% will not get the care they need. Pediatric behavioral health care is often less accessible and comprehensive than care for adults,” said Ben Robbins, psychiatrist and venture partner at GV who is joining Brightline’s board of directors. “Brightline addresses the huge unmet need of pediatric behavioral health services and is uniquely positioned to provide multiple levels of care based on the needs of patients and families.”\n Livongo founder Glen Tullman, now CEO of Transcarent and managing partner at 7wireVentures, and Laura Veroneau, partner at Optum Ventures, are joining Brightline as board observers.\n Brightline also announced that they are embarking on their biggest expansion to date, introducing new products with nationwide availability and expanding clinical services to new states.\n Launched in 2019, Brightline&#39;s platform offers multidisciplinary care teams, a family-focused approach and evidence-based care delivery, and innovative technology, Brightline is able to support families with whatever challenges they&#39;re facing.\n Telehealth helps to make mental health care easier to access for kids by doing away with some of the logistical burdens of getting to and from frequent appointments.\n  There are a few pediatric startups making inroads in the digital health market. Hazel Health operates virtual care clinics inside the school nurse&#39;s office to connect students to a physician via telehealth and recently landed a $33 million funding round. Sprout, a tech-enabled autism care and treatment program, launched in July on the back of $10 million in seed funding.\n Daybreak Health is another startup trying to tackle the gaps in mental health care for kids. The company launched in February 2020 and specializes in providing online counseling services, especially for teens.\n Brighline has launched new products with nationwide availability and is expanding clinical services to new states. The company&#39;s Connect feature, which provides families access to personalized content and tips, interactive exercises and the ability to chat with a coach for support, will be available nationwide this summer.\n The Brightline Coaching feature also expands nationwide this summer, which provides families with support from behavioral health coaches to help with issues like stress, anxiety, organizational skills, tantrums, disruptive behavior and social-emotional learning.\n Brightline Care will be available nationwide by the end of 2021 to support national employers and health plans, the company said. Brightline’s clinical services—including behavior therapy, medication support, and speech therapy—are now available in California and Massachusetts, with Washington launching in July and several more states coming soon. Brightline expects to expand these services to all 50 states by the end of this year.", "posttime": "2021-06-20 13:59:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "总量,led,brightline", "title": "为儿童和青少年提供虚拟行为健康疗法的Brightline培养了GV的7200万系列B，使其总量升至〜100米 ", "title_en": "Brightline, which provides virtual behavioral health therapy for children and teenagers, raises $72M Series B led by GV, bringing its total raised to ~$100M", "transed": 1, "url": "https://www.fiercehealthcare.com/digital-health/gv-backs-brightline-s-72m-boost-expand-pediatric-behavioral-health-services", "via": "", "real_tags": ["总量", "led"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066995, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近的一个kerfuffle周围的开源软件创造者要求他们的包裹不包括在一个更大的项目中已经变成了开源社区的一种兔子幻觉。软件包的创建者使用他们的社会权力，但不是他们的法律权力 - 尝试和影响用户行为时意味着什么？他们是否违反了开源的精神？或简单地制定承认开源现实的请求？\n  实际的前后是拉出请求讨论。互联网辩论的城堡，即黑客新闻将为您提供更大的社区反应感。简而言之，发生了什么：\n 开源软件包的创建者要求将包不包含在更大的项目中。创造者承认，纳入包裹在技术上是合法的，但是要求无论如何都没有包括它。作为在此重新打包的包裹的作者。我反对它被重新包装到这里。当许可证明智时，我无法阻止你，我希望你能尊重我的要求。谢谢你考虑尊重作者的愿望。\n  当由项目的维护者推出时，包创建者解释说，他们担心包括较大项目中的包裹将导致社区的许多支持请求。如果用户遇到[包装]的问题，他们会敲我的门。而且我不愿意支持这一点或接受这种负担。\n  下游维护者推动了更多信息或解释。创造者继续表达无情地在包含包含的包裹和关于决定的对话中\n  最终，创造者威胁要以一种与项目合法不相容的方式重新定义包裹\n 在线意见是在这种情况下分开的。但是，社区的一些重要部分已回答： \n可以从中学到什么？这种要求真的反对酿酒精神吗？\n  创造者并没有通过法律行动的威胁开始这种讨论。相反，创建者只是要求不包括包裹。然后，他们明确承认他们没有妨碍它的法律权力。\n 这是一个要求没有人有尊重的法律义务。然而，创造者使其成为（大概）他们认为，包裹维护者在一个受到黑色信函法律规则的一个世界的世界中生活。\n 这让我成为代表创造者的完全健康的回应。他们清楚地了解了在开源许可证下释放软件的后果以及包含在流行的软件包中的潜在后果。创造者通过社会请求而不是法律威胁表示这些问题，因为生活在社会中的一部分能够解决争议而不参加法庭。\n 我们永远不会知道，但它令我兴趣的是，创造者可能一直愿意把它留在那之上 - 作为可能或可能不遵守的要求 - 直到维持者决定跟进。\n 要清楚，维护者的初步反应也会让我作为合理的回应。他们可能想了解激励某人提出请求的担忧。他们可能还希望能够解决这些问题和/或将创造者与反对者讨论。\n 不幸的是，维护者的这种非常人的反应也恰好推动了创造者，通过提出关注来避免创造者希望避免 - 花时间与他们不了解他们的包裹。最终，在讨论继续之后，创造者决定威胁要以合法阻止包容的方式重新定义包裹。 \n重要的是要认识到，这次讨论在并行轨道上运行。一条赛道是基于法律要求（或缺乏法律要求）。另一个是基于社会/文化要求。\n 社会/文化轨道有可能与合法一样强大（事实上，这是这个想法的基础）。其存在表明，争议的合理解决不必依靠严格对法律权利的解释。社会不仅仅是法律！维护者可能会忽略请求，并在没有任何法律执法的情况下面临有意义的社会/文化后果。社会规范是真实的，在世界上产生真正的变化。即使在开源。\n  在翻盖方面，有问题的包在麻省理工学院许可下获得许可。该许可证包括一个非常清晰的“任何破坏不是我的问题”免责声明（在所有帽子中）：\n 该软件提供“原样”，没有任何类型，表达或暗示的保证，包括但不限于适销性，特定目的健康和非犯罪的保证。在任何情况下，作者或版权持有人应对任何索赔，损害赔偿或其他责任，无论是在合同，侵权行为的行动，侵权行为，否则，否则与软件或使用或其他交易中出现软件。\n 如果法律规则在这里重要的是，许可证的案文就是这一整个争端是一个非问题。 Creator提供了软件，并为此担心任何责任。如果软件有一个错误，为什么有人会回到他们身边？\n 当然，许可证的文本与社会期望不匹配。授权条款一边，创造者认识到，创作者维护包的开源软件社区中存在社会期望 - 或者至少是用户可以接受到创造者以便支持支持和/或旗帜错误。\n 虽然创造者似乎已经理解，但他们没有法律义务处理这些请求，他们还可以理解他们可能会对他们处理社会/文化义务。或者，最低限度的工具可用于开源软件创建者的工具使其难以忽略一定的请求。许可证术语没有许可证术语的数量没有变化。 \n这适用于关于数百万代码使用的小块没有任何对代码的维护者的代码如何使用的故事列表。在某些方面，这是一个成功的故事 - 一个随机的人可以创造数百万使用的东西！在其他方面，这是一个悲剧 - 一个随机的人可以创造一些让数百万人的东西如果缺失！\n 无论您如何看到这种动态，很明显，它可以为个人（和小团体）创造疑紧，以争取开源软件的成功。虽然像潮汐这样的公司正在努力解决这个问题，但意识到问题 - 并且谨慎对问题的影响 - 远未未能理解开源软件的精神。事实上，它可能是一种非常清晰地了解开源软件的精神如何与开源软件的现实相互作用。此外，关于这种动态作为社会反对而不是法律反对的框架问题似乎深入了解开源软件的精神。\n 作为一个相关的社区，这种类型的创造者负担是开源硬件社区应该了解并努力解决的事情。与此同时，我不相信它在软件中的硬件中完全相同。在开源硬件包括开源软件的范围内，问题基本相同。但是，当应用于硬件本身时，它不同。\n 这种差异依赖于，软件的设计和分配折叠成一步 - 只是将其发布到repo。在硬件中，这些步骤非常不同。设计开源硬件与分发实际硬件分开是单独的。这可能使单个人更难以维持在没有任何支持的情况下纳入数百万个项目的作品。但这是另一天的另一个博文。即使动态不相同，它肯定足够类似地思考并尝试避免在开放的硬件中。\n  这篇文章最初出现在OSHWA Blogtoday上我们很高兴地宣布开放的硬件期刊硬件X集成了o ... ...继续阅读 ", "note_en": "A recent kerfuffle around an open source software creator asking for their package not to be included in a larger project has turned into a kind of  rabbit-duck illusion for the open source community. What does it mean when the creator of a software package uses their social power - but not their legal power - to try and influence user behavior? Are they violating the spirit of open source? Or simply making requests that acknowledge open source realities?\n  The actual back-and-forth is in the  pull request discussion. The  citadel of internet debate that is Hacker News will give you a sense of the larger community response. Briefly, what happened was:\n The creator of an open source software package asked that the package not be incorporated into a larger project. The creator acknowledged that it was technically legal to incorporate the package, but asked that it not be included anyway.  As the author of the package that is being re-packaged here. I’m against it being repacked into here.While licensing wise I cannot stop you, I do hope you can honor my request.Thank you for considering respecting the author’s wishes.\n  When pushed by the project’s maintainers, the package creator explained that they were worried that including the package in the larger project would result in many support requests from the community.  If users experiencing issues with [the package], they will knock on my door. And I’m not willing to support that or accept that burden.\n  Downstream maintainers pushed for more information or explanation. The creator continued to express disinterest in having the package included and in a conversation about the decision\n  Eventually the creator threatened to relicense the package in a way that would make it legally incompatible with the project\n Online opinion is split on this situation. However, some substantial part of the community has responded with a  version of:\n  What can be learned from this? Is this kind of request really against the spirit of FOSS?\n  It is notable that the creator did not kick off this discussion with the threat of legal action. Instead, the creator simply requested that the package not be included. They then explicitly acknowledged that they did not have the legal power to prevent it.\n This was a request that no one had a legal obligation to respect. And yet, the creator made it because (presumably) they believed that the package maintainers lived in a world that was governed by more than black letter legal rules.\n This strikes me as a totally healthy response on behalf of the creator. They clearly understood the consequences of releasing software under an open source license and the potential consequences of being included in a popular software package. The creator expressed these concerns by way of a social request instead of a legal threat because part of living in society is being able to resolve disputes without going to court.\n We will never know, but it strikes me as entirely plausible that the creator may have been willing to leave it at that - as a request that may or may not be complied with - until the maintainers decided to follow up.\n To be clear, the maintainers’ initial response also strikes me as a reasonable one. They probably wanted to understand the concerns that would motivate someone to make the request. They may have also hoped to be able to address those concerns and/or talk the creator out of the objection.\n Unfortunately, this very human response by the maintainers also happened to push the creator to do exactly what the creator was hoping to avoid by raising the concern - spend time talking to people that they do not know about their package. Eventually, after the discussion continued, the creator decided to threaten to relicense the package in a way that would legally prevent inclusion.\n It is important to recognize that this discussion ran on parallel tracks. One track was based on legal requests (or the lack of legal requests). The other was based on social/cultural requests.\n That social/cultural track has the potential to be just as powerful as the legal one (in fact, it is the basis for  this idea). Its existence illustrates that the reasonable resolution of the dispute did not have to rely on a strict interpretation of legal rights. Society is more than the law! The maintainers could have ignored the request and faced meaningful social/cultural consequences without any sort of legal enforcement. Social norms are real and create real change in the world. Even in open source.\n  On the flip side, the package in question is licensed under an MIT license. That license includes a pretty clear “anything that breaks is not my problem” disclaimer (in all caps):\n THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n If the legal rules were all that mattered here, the text of the license makes this entire dispute a non-issue. The creator offers the software as-is and disclaims any responsibility for it. Why would anyone come back to them if the software had a bug?\n Of course, the text of the license does not match social expectations. Licensing terms aside, the creator recognizes that there is a social expectation in the open source software community that creators maintain packages - or, at a minimum, that it is acceptable for users to reach out to creators to ask for support and/or flag bugs.\n While the creator seems to have understood that they have no legal obligation to deal with these requests, they also understood that they might have a social/cultural obligation to deal with them. Or, at a minimum, that the tools available to open source software creators make it hard to ignore a flood of requests. No amount of pedantic textual analysis of the license terms changes that.\n  This fits in with a long list of stories about how small pieces of code are used by millions without any sort of support for maintainers of the code. In some ways, this is a success story - a random person can create something that is used by millions! In other ways, it is a tragedy - a random person can create something that will make millions of people angry if it breaks!\n Regardless of how you see this dynamic, it is pretty clear that it can create disincentives for individuals (and small groups) to strive for success in open source software. While companies like  Tidelift are working to help solve this problem, being aware of the problem - and wary of how the problem might impact you - is far from failing to understand the spirit of open source software. In fact, it may be an incredibly clear-eyed understanding of how the spirit of open source software interacts with the reality of open source software. Furthermore, framing concerns about that dynamic as a social objection instead of a legal objection seems deeply within the spirit of open source software.\n As a related community, this type of creator burden is something that the open source hardware community should be aware of and work to address. At the same time, I am not convinced that it is exactly the same type of problem in hardware as it is in software. To the extent that open source hardware includes open source software the problems are essentially identical. However, it is different when applied to the hardware itself.\n That difference rests in the fact that design and distribution of software is collapsed into a single step - just post it to the repo. In hardware those steps are quite distinct. Designing open source hardware is quite separate from distributing actual pieces of hardware. That may make it harder for a single person to be responsible for maintaining a piece that is incorporated into millions of projects without any sort of support. But that’s another blog post for another day. Even if the dynamic is not identical, it is certainly similar enough to think about and try to avoid in open hardware.\n  This post originally appeared on the OSHWA blogToday we are excited to announce that the open hardware journal HardwareX is integrating O...…  Continue reading", "posttime": "2021-06-20 13:58:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,许可证,govern,创造者", "title": "单独许可证在开源中不受行为 ", "title_en": "Licenses Alone Do Not Govern Behavior in Open Source", "transed": 1, "url": "https://michaelweinberg.org/blog/2021/06/17/licenses-and-social-norms/", "via": "", "real_tags": ["开源", "许可证", "govern", "创造者"]}, {"category": "", "categoryclass": "", "imagename": "fc3c31c58253862ab75e5fa9215631c1.jpg", "infoid": 1066994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索股票运营商的回忆是美国作家EdwinLefèvre的1923年罗马à谱号。它在第一个人中被一个人的人物引导，这是股票交易嘉合杰西的生活的灵感到那一点。 [1]\n 这本书仍在打印中（ISBN 0471770884）。 2009年12月，Wiley在Holdcover中发布了一个注释版，ISBN 0-470-48159-5，弥补了Lefèvre＆＃39;在图书中提到的实际人和地区之间的差距。它还包括对冲基金经理Paul Tudor Jones的前言。 [2]\n    1890-1910：利沃罗能够利用在不活动股上的出价股票，杠杆队在铲斗商店杠杆率为100至1的展示来易于赚钱。\n 1910-1920：Livermore是纽约证券交易所的股票交易商，在那里他一遍又一遍地爆发，因为他用了太多的杠杆。\n 20世纪20年代：利弗雷从事市场操纵，收费的25％的被操纵股票的市场价值。这是在1934年创建美国证券交易委员会之前。\n  在2008年的书中，骚动的年龄，艾伦格林斯潘叫书＆＃34;一个投资智慧的字体。并注意到这本书的报价如＆＃34;公牛和熊赚钱;猪被屠杀＆＃34;现在是谚语。 [3]\n 2005年3月的财富文章在＆＃34中列出了它;我们知道的最聪明的书籍和＃34;关于业务。 [4] \n在Jack D. Schwager的市场巫师中，许多投资者（包括Richard Dennis），称该书称为股票交易的主要材料来源。 ", "note_en": "Jump to navigation  Jump to search  Reminiscences of a Stock Operator is a 1923  roman à clef by American author  Edwin Lefèvre. It is told in the first person by a character inspired by the life of  stock trader  Jesse Livermore up to that point.  [1]\n The book remains in print (  ISBN  0471770884). In December 2009,  Wiley published an annotated edition in  hardcover,   ISBN  0-470-48159-5, that bridges the gap between Lefèvre&#39;s fictionalized account and the actual people and places referred to in the book. It also includes a foreword by  hedge fund manager  Paul Tudor Jones.  [2]\n    1890-1910: Livermore was able to make easy money by taking advantage of the  bid–ask spread on inactive stocks with leverage of 100-to-1 at  bucket shops.\n 1910-1920: Livermore was a  stock trader on the  New York Stock Exchange, where he went bust over and over again because he used too much leverage.\n 1920s: Livermore engaged in  market manipulation, charging fees of 25% of the market value of the manipulated stock. This was before the creation of the  U.S. Securities and Exchange Commission in 1934.\n  In his 2008 book,   The Age of Turbulence,  Alan Greenspan called the book &#34;a font of investing wisdom&#34; and noted that quotes from the book such as &#34;bulls and bears make money; pigs get slaughtered&#34; are now adages.  [3]\n A March 2005 article in   Fortune listed it among &#34;The Smartest Books We Know&#34; about business.  [4]\n In   Market Wizards by  Jack D. Schwager, many investors, including  Richard Dennis, quoted the book as a major source of material on stock trading.", "posttime": "2021-06-20 13:58:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股票,运营商,stock", "title": "股票运营商的回忆 ", "title_en": "Reminiscences of a Stock Operator", "transed": 1, "url": "https://en.wikipedia.org/wiki/Reminiscences_of_a_Stock_Operator", "via": "", "real_tags": ["股票", "运营商", "stock"]}, {"category": "", "categoryclass": "", "imagename": "26b7e3a87a757da7d48e9effcf396a0b.jpg", "infoid": 1066992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "韩国＆＃39; s＆＃39;韩国原子能研究所＆＃39;昨天透露，他们的内部网络上个月被朝鲜威胁演员使用VPN漏洞被攻击。\n 韩国原子能研究所或考掌，是韩国核电研究和应用的政府赞助研究所。\n 南朝鲜媒体Sisa Journal开始涉及该袭击时，本月早些时候首次报道了违约。当时，Kaeri最初证实然后否认攻击发生了。\n 在Kaeri昨天举行的发言和新闻发布会中，该研究所已正式证实了攻击并为试图掩盖事件而道歉。\n  Kaeri状态在朝鲜威胁行动者使用VPN漏洞突破内部网络后，袭击事件发生在6月14日。\n Kaeri表示，他们已更新未公开的VPN设备以解决漏洞。但是，访问日志显示十三个不同的未经授权的IP地址通过VPN获得对内部网络的访问。\n 其中一个IP地址与朝鲜国家赞助的黑客集团相关联，称为＆＃39;金苏基＆＃39;据信在朝鲜侦察局智力局智力机构下工作。 \n2020年10月，CISA在Kimsuky APT集团上发出了警报，并表示他们是＆＃34;可能是朝鲜制度的任务，与全球情报集合使命。＆＃34;\n 最近，Malwarebytes已发出关于Kimsuky（又名铊，黑人Banshee和天鹅绒Chollima）的报告一直在积极地使用＆＃39; Appleseed＆＃39;后门在网络钓鱼攻击。\n ＆＃34; Kimsuky命名为“외교부가판2021-05-05-07”中使用的诱饵之一，韩国语言翻译成“外交部2021-05-07”，这表明它旨在瞄准该部韩国外交，＆＃34;解释Malwarebytes＆＃39;关于威胁演员的报告＆＃39;最近的活动。\n ＆＃34;根据我们所收集的数据，我们已经确定它是Kimsuky高兴趣的一个实体。＆＃34;\n Malwarebytes指出，Kimsuky在最近的网络钓鱼攻击中瞄准了其他韩国政府机构，包括：\n  Kaeri表示，他们仍在调查攻击以确认已访问的信息。 ", "note_en": "South Korea&#39;s &#39;Korea Atomic Energy Research Institute&#39; disclosed yesterday that their internal networks were hacked last month by North Korean threat actors using a VPN vulnerability.\n The Korea Atomic Energy Research Institute, or KAERI, is the governement-sponsored institute for the research and application of nuclear power in South Korea.\n The breach was first reported earlier this month when South Korean media  Sisa Journal began covering the attack. At the time, KAERI initially confirmed and then denied that the attack occurred.\n In a  statement and press conference held yesterday by KAERI, the institute has officially confirmed the attack and apologized for attempting to cover up the incident.\n  KAERI states the attack took place on June 14th after North Korean threat actors breached their internal network using a VPN vulnerability.\n KAERI states that they have updated the undisclosed VPN device to fix the vulnerability. However, access logs show that thirteen different unauthorized IP addresses gained access to the internal network through the VPN.\n One of these IP addresses is linked to a North Korean state-sponsored hacking group known as &#39;Kimsuky&#39; that is believed to work under the North Korean Reconnaissance General Bureau intelligence agency.\n  In October 2020, CISA issued an  alert on the Kimsuky APT group and stated that they are &#34;likely tasked by the North Korean regime with a global intelligence gathering mission.&#34;\n More recently, Malwarebytes has issued a report on how Kimsuky (aka Thallium, Black Banshee, and Velvet Chollima) has been actively targeting the South Korean government using the &#39;AppleSeed&#39; backdoor in phishing attacks.\n &#34;One of the lures used by Kimsuky named “외교부 가판 2021-05-07” in Korean language translates to “Ministry of Foreign Affairs Edition 2021-05-07” which indicates that it has been designed to target the Ministry of Foreign Affairs of South Korea,&#34; explains  Malwarebytes&#39; report on the threat actor&#39;s recent activities.\n &#34;According to our collected data, we have identified that it is one entity of high interest for Kimsuky.&#34;\n Malwarebytes states that Kimsuky has targeted other South Korean government agencies in recent phishing attacks, including:\n  KAERI states that they are still investigating the attack to confirm what information has been accessed.", "posttime": "2021-06-20 13:22:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "缺陷,korea,朝鲜", "title": "韩国的核研究机构使用VPN缺陷攻击 ", "title_en": "South Korea's Nuclear Research agency hacked using VPN flaw", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/south-koreas-nuclear-research-agency-hacked-using-vpn-flaw/", "via": "", "real_tags": ["缺陷", "korea", "朝鲜"]}, {"category": "", "categoryclass": "", "imagename": "19667bfa80d03dec118342ad8ed947ac.jpg", "infoid": 1066991, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lingokids为其教育比赛平台筹集了4000万美元的资金。该公司表示，它现在与其移动应用程序达到了超过3000万个家庭。\n 该公司针对2-8名儿童的“PlayLearning”应用程序，因为它试图扩大他们的词汇，提高识字技能，并在一个有趣的安全环境中开发重要的21世纪技能。\n  Lingokids还邀请家庭参与他们的孩子们通过令人兴奋的游戏活动来参与他们的孩子们的乐徒学习之旅。总而言之，该公司的应用程序有超过600名学习活动和歌曲。这场比赛教授一系列主题和日常语言，以及21世纪的技能，如创造力，沟通，协作和批判性思维等。\n 该应用程序具有有趣，独特的人物，由GuillermoGarcía-Carsí（着名的卡通Pocoyó）和他的团队开发。 Lingokids课程以原来和牛津大学的新闻内容为特色，由公司的教育委员会专门制作，与Leapfrog，Hasbro，Disney和Nickelode等公司的早期语言学习的专家。\n Lingokids已经从PTPA，妈妈的选择奖，产品黑客奖项，eNlighted和教育应用商店等方案获得了赞誉。 Lingokids也被LinkedIn命名为2020年的顶级初创公司之一。该平台由Kidsafe Seal Program认证，并提供可广告的儿童安全环境。\n   以2016年推出，以旧金山为基础的Lingokids创建了“PlayLearning”应用程序，其大多数开发人员都在西班牙马德里。 Lingokids致力于支持孩子的学习之旅，给他们一个父母门户网站，每周报告，课程概述，活动时间表以及父母日常生活的咨询和提示，每天都会通过其父母的社区。\n “我刚从出口出来，我的妹妹让我帮助我的侄女学习英语，”Viedma说。 “我是一个带有计算机科学背景的游戏玩家。我一直想在我生命中的某些时候做游戏。所以我开始为我的2岁的侄女建立一些游戏。“ \nViedma希望远离被动视频体验。他的游戏工作，滚雪球。他组建了一家公司，开始制作他认为有趣的游戏。他们有真正的游戏元素，然后添加了生态元素。他们现在从拼图到无尽的跑步游戏。今天最大的市场是美国，其中60％的家庭是基于的。墨西哥和巴西也是大型市场。\n 第三次机构资助转向由未公开的投资者领导，参与GP Bullhound和现有投资者HV首都和Ravensburger等。该资金将用于进一步的国际扩张，为儿童的新的和投资形式的新增方式，以及全球招聘，特别是平台工程和开发团队。 Lingokids迄今为止筹集了6500万美元，达到了2020年利息，税收，折旧和摊销（EBITDA）的积极收益。\n Lingokids的首席执行官和创始人Cristóbalviedma在一次采访时表示，它的目标是帮助父母和看护人抚养孩子并分解教育障碍。他说，该公司提供了父母可以信任的优质教育选择，而且这些更重要的是。\n 在大流行期间，超过65％的儿童家庭报告使用在线学习，68％的父母表示，根据美国人口普查，他们现在依赖早期学习应用程序来补充孩子的教育。作为教育和互动内容的可信资源，Lingokids自大流行开始以来的用户数目，并准备改变早期教育市场。\n   通过这项新资金，Lingokids将迅速提高其国际增长。此外，它还将扩大其与科学技术工程和数学（Stew）相关的产品，以及许多孩子在过去的学年中错过的技能的学习就像情绪智力，同情和批判性思维。 Lingokids还将在AudioBooks和音频练习中开发新的音频内容，专注于与心理健康，谨慎和冥想有关的主题。\n “我们正在为2八岁的孩子们做早期的儿童教育，教导他们所有的基础知识，识字，阅读，写作，数学，逻辑和编程，”Viedma说。 “十亿个孩子正在访问数字内容。但虽然行业有很多公司，但我们是不同的。“\n 该公司针对家庭，客户是父母而不是学校。它创造了创造了对孩子们嬉戏的互动体验的原创内容。它通过移动应用程序到达那些孩子。 \n“我们是一个值得信赖的品牌，人们在寻找儿童安全学习时了解到，”Viedma说。\n Lingokids计划今年雇用世界各地的60人，为其团队接近100. Lingokids的最新补充包括Vladimir Klimov，担任内容战略和Tiago Prokeiro，前产品总监副总裁产品。\n   去年以前的投资，Lingokids还与国际玩具和拼图公司加入了Ravensburger。 Lingokids和Ravensburger将开发销售和新游戏和玩具离线以补充Lingokids的在线活动。\n 该公司的合作伙伴包括拯救儿童，儿童基金会，难民专员办事处和美国红十字会。该公司已由想要许可品牌的公司多次接近它或购买它，但Viedma表示，该公司希望投资自己的学习游戏和品牌。\n “公司的长期愿景正在为幼儿教育建立这一标志性品牌，”他说。 “一些经历是多人游戏，因为我们认为学习可能是一种社会体验。”\n 在覆盖游戏行业时，Gamesbeat＆＃39; S信条是＆＃34;热情符合业务的地方。＆＃34;这是什么意思？我们想告诉您新闻如何对您而言 - 不仅是在游戏工作室的决策者，而且作为游戏的粉丝。无论您是阅读我们的文章，聆听我们的播客，还是观看我们的视频，GamesBeat将帮助您了解该行业，并享受与之享受。你会怎么做？会员资格包括访问：成为会员 ", "note_en": "Lingokids has raised $40 million in funding for its  educational games platform. And the company said it now reaches more than 30 million families worldwide with its mobile apps.\n The company targets its “playlearning” app at children 2-8 as it tries to expand their vocabulary, improve their literacy skills, and develop important 21st-century skills in a fun, safe environment.\n  Lingokids also invites families to take part in their kids’ playlearning journey through exciting play-together activities. All told, the company’s apps have more than 600 learning activities and songs. The games teach an array of topics and everyday language, as well as 21st-century skills like creativity, communication, collaboration, and critical thinking.\n The apps feature fun, unique characters, developed by Guillermo García-Carsí (creator of the famous cartoon  Pocoyó) and his team. Featuring both original and Oxford University Press content, the Lingokids curriculum has been specially crafted by the company’s educational board with experts in early language learning from companies like LeapFrog, Hasbro, Disney, and Nickelodeon.\n Lingokids has received accolades from programs like PTPA, Mom’s Choice Awards, Product Hackers Awards, enlightED, and Educational App Store. Lingokids was also named one of the Top Startups in 2020 by LinkedIn. The platform is certified by the KidSafe Seal Program and offers a kid-safe environment that is ad-free.\n   Launched in 2016, the San Francisco-based Lingokids has created its “playlearning” app, and most of its developers are in Madrid, Spain. Lingokids is dedicated to supporting parents in their child’s learning journey, giving them a parents portal featuring each child’s progress with weekly reports, curriculum overviews, activity timeline, as well as advice and tips for parents’ everyday lives through its Parents Community.\n “I was just coming out from an exit, and my sister asked me to help my niece learn English,” Viedma said. “I was something of a gamer with a computer science background. I had always wanted to do games at some point in my life. So I started building some games for my 2-year-old niece.”\n Viedma wanted to get away from passive video experiences. His games worked, and the business snowballed. He formed a company and started making games that he thought were fun. They had real gameplay elements, and then added ecuational elements. They now range from puzzles to endless runner games. The biggest market today is the U.S., where 60% of the families are based. Mexico and Brazil are also large markets.\n The third institutional funding round was led by an undisclosed investor, with participation from GP Bullhound and existing investors HV Capital and Ravensburger, among others. The funding will be used for further international expansion, development of new and engaging forms of content for kids, as well as global hiring, especially for the platform engineering and development teams. Lingokids has raised $65 million to date, reaching positive earnings before interest, taxes, depreciation, and amortization (EBITDA) in 2020.\n Cristóbal Viedma, the CEO and founder of Lingokids, said in an interview with GamesBeat that its goal is to help parents and caretakers raise their kids and break down educational barriers. He said the company provides quality education options that parents can trust and these are more important than ever.\n During the pandemic, more than  65% of households with children reported the use of online learning, and 68% of parents said they now rely on early learning apps to supplement their children’s education, according to the U.S. Census. As a trusted resource for educational and interactive content, Lingokids tripled its number of users since the beginning of the pandemic, and is poised to transform the early education market.\n   With this new funding, Lingokids will rapidly increase its international growth. In addition, it will expand its offerings related to science technology engineering and math (STEM), and the learning of skills that many kids missed out on during the past school year like emotional intelligence, empathy, and critical thinking. Lingokids will also develop new audio content in audiobooks and audio-exercises, focusing on topics related to mental health, mindfulness, and meditation.\n “We’re doing early childhood education for kids ages two to eight years old, teaching them all the basics like language, literacy, reading, writing, mathematics, logic, and programming,” Viedma said. “A billion kids are accessing digital content. But while there are lots of companies in the industry, we are different.”\n The company targets families, with the customer being the parent rather than schools. It creates original content that creates playful interactive experiences for kids. And it reaches those kids through mobile apps.\n “We are a trusted brand that people learn about when they are looking for kids-safe learning,” Viedma said.\n Lingokids plans to hire an additional 60 people around the world this year, adding to its team of close to 100. The latest additions to Lingokids include Vladimir Klimov as director of content strategy and Tiago Pregueiro, former product director at Cabify, as vice president of product.\n   With its previous investment last year, Lingokids also joined forces with the international toy and puzzles company, Ravensburger. Lingokids and Ravensburger will develop merchandising and new games and toys offline to complement Lingokids’ online activities.\n The company’s partners include Save the Children, UNICEF, UNHCR and American Red Cross. The company has been approached multiple times by companies that want to license brands to it or buy it, but Viedma said the company wants to invest in its own learning games and brands.\n “The long-term vision of the company is building this iconic brand for early childhood education,” he said. “Some experiences are multiplayer, as we think learning can be a social experience.”\n GamesBeat&#39;s creed when covering the game industry is &#34;where passion meets business.&#34; What does this mean? We want to tell you how the news matters to you -- not just as a decision-maker at a game studio, but also as a fan of games. Whether you read our articles, listen to our podcasts, or watch our videos, GamesBeat will help you learn about the industry and enjoy engaging with it.  How will you do that? Membership includes access to:    Become a member", "posttime": "2021-06-20 13:15:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,程序,达到,claims", "title": "Lingokids通过其2-8岁的儿童“PlayLearning”应用程序提供教育游戏，提高了40万美元的C系列，并要求达到全球30米+家庭 ", "title_en": "Lingokids, which offers educational games through its “playlearning” app for kids aged 2-8, raises $40M Series C and claims to reach 30M+ families worldwide", "transed": 1, "url": "https://venturebeat.com/2021/06/15/lingokids-raises-40-million-for-playlearning-educational-games-platform/", "via": "", "real_tags": ["游戏", "程序", "达到", "claims"]}, {"category": "", "categoryclass": "", "imagename": "ecaa3eed2fc967ff1ee3a04f39b0aaa2.jpeg", "infoid": 1066990, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司周二表示，财富管理软件提供商Addepar Inc.从七个月前增加到201.17亿美元的估值增加到21.17亿美元。\n  Addepar表示，它已从纽约对冲基金公司D1 Capital Partners筹集了1.5亿美元。据熟悉该交易的人称，它以前在近10亿美元的资金回合后重视。早些时候在Addepar中的投资者于2009年由Palantir Technologies Inc.的联合创始人和串行企业家Joe Lonsdale成立，包括风险投资公司Valor股票伙伴和Westcap集团。\n  首席执行官Eric Poirier表示，湍流顾问通过投资顾问了解他们的客户投资组合可能会发生什么，这是Adadear最近的增长。加利福尼亚州的山景景色为投资顾问，银行和家庭办公室制作了旨在简化投资组合在资产类别的投资组合的跟踪。 Addepar目前追踪约2.7万亿美元的资产，自2020年中期自2020年中期每周增加150亿美元的资产。\n  “这是自从一开始以来的人类信任业务，并拥有一个人的金融专业用途为客户服务的技术是海洋变革，”Poirier先生说。\n      他拒绝说，如果公司有利可图或披露其收入，但是，Addep也在尚未以最快的步伐推动客户和资产。该公司表示，它认为市场总市场需求量超过200万亿美元。客户包括Alliancebernstein持有LP，Morgan Stanley和Stifel Financial，其投资臂以前投入Addepar。\n  Lonsdale先生，他是前三年的Addepar，现在是其董事会主席，将其描述为“融资的操作系统”。他说，他认为用户转到Adadear，因为软件汇总了帮助他们做出关于金钱决定所需的大量信息。\n  Lonsdale先生还表示，Addepar可以在几年内围绕其软件建造的应用程序生态系统。除了简化的性能报告外，Addepar还可以在一览之内，去年推出一个名为Marketplace的特征，提供有关对冲基金，私募股权基金和私营企业股票等投资产品的信息。 \nLonsdale先生说，建立了该公司的技术比预期更长。  他说：“事实证明，在财富管理中解决了很多难题”例如，在数千名监护人和基金管理人员中，数据分发数据。  Addepar计划利用资金扩大其全球销售部队，特别是在欧洲，并继续投资研发。 Poirier先生说，大约90％的客户群是美国目前的。  D1将采取董事会观察者角色。 D1主普拉特克Bhide表示，Addepar有机会迅速增长。 自2018年成立以来，对冲基金公司采用了杂交投资的杂交投资方法和私营公司。  出现在2021年6月16日，印刷版作为＆＃39;软件制造商价值为21.7亿美元。＆＃39; ", "note_en": "Wealth-management software provider Addepar Inc. more than doubled its valuation to $2.17 billion from seven months ago in its latest funding round, the company said Tuesday.\n  Addepar said it had raised $150 million from New York hedge-fund firm D1 Capital Partners. It was previously valued at nearly $1 billion after its last funding round in November, according to a person familiar with the deal.  Earlier investors in Addepar, founded in 2009 by Palantir Technologies Inc. co-founder and serial entrepreneur Joe Lonsdale, include venture firms Valor Equity Partners and WestCap Group.\n  Turbulent markets and a desire by investment advisers to know what could happen to their clients’ portfolios during the pandemic has spurred Addepar’s recent growth, said Chief Executive Eric Poirier. The Mountain View, Calif.-based company makes software for investment advisers, banks and family offices that aims to simplify the tracking of how investment portfolios perform across asset classes. Addepar currently tracks about $2.7 trillion of assets and has added an average $15 billion in assets a week since mid-2020.\n  “This has been a human trust business since the beginning of time, and having a human who is the financial professional use technology to serve their clients is a sea change,” said Mr. Poirier.\n      He declined to say if the company was profitable or to disclose its revenue but said Addepar was bringing on clients and assets at its fastest pace yet. The company says it thinks the total market demand for investible assets is more than $200 trillion globally. Clients include  AllianceBernstein Holding LP,  Morgan Stanley and  Stifel Financial  , whose investment arm previously invested in Addepar.\n  Mr. Lonsdale, who ran Addepar for its first three years and now is chairman of its board, described it as “an operating system for finance.” He said he sees users turning to Addepar because the software aggregates large amounts of information needed to help them make decisions about money.\n  Mr. Lonsdale also said Addepar could have an ecosystem of applications built around its software in several years. In addition to simplified performance reporting, Addepar lets clients view net worth at a glance and last year rolled out a feature called Marketplace that provides information about investment products such as hedge funds, private-equity funds and shares in private companies.\n  Mr. Lonsdale said building out the technology of the firm had taken longer than expected.\n  “It turns out there are a lot of hard problems to solve in wealth management” such as the distribution of data across thousands of custodians and fund administrators, he said.\n  Addepar plans to use the funding to scale up its sales force globally, particularly in Europe, and continue to invest in research and development. Roughly 90% of its client base is in the U.S. currently, Mr. Poirier said.\n  D1 will take a board observer role. D1 principal Prateek Bhide said Addepar has an opportunity to grow rapidly. The hedge-fund firm has employed a hybrid approach of investing in both public and private companies since its founding in 2018.\n  Appeared in the June 16, 2021, print edition as &#39;Software Maker Valued at $2.17 Billion.&#39;", "posttime": "2021-06-20 13:15:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,partners,addepar,投资", "title": "Addepar是财富管理软件的提供商，从D1 Capital Partners达到2.17亿美元的估值筹集了150米; 资料来源：Addepar于11月的〜1亿美元估价 ", "title_en": "Addepar, a provider of wealth management software, raises $150M from D1 Capital Partners at a $2.17B valuation; source: Addepar was valued at ~$1B in November", "transed": 1, "url": "https://www.wsj.com/articles/addepar-valued-at-2-17-billion-as-investors-bet-on-wealth-management-tech-11623756600?mod=djemalertNEWS", "via": "", "real_tags": ["软件", "partners", "addepar", "投资"]}, {"category": "", "categoryclass": "", "imagename": "75a9cc1b6393d9a1e22cbfa337298e13.png", "infoid": 1066989, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用随机选择节点来传递信息，以确保它在不泛滥网络的情况下达到群集中的所有节点\n  在一组节点中，每个节点需要将元数据信息传递给群集中的所有其他节点，而无需取决于共享存储。在一个大群集中，如果所有服务器与所有其他服务器通信，则可以消耗大量的网络带宽。即使某些网络链接遇到问题，信息也应该达到所有节点。\n 群集节点使用Gossip样式通信来传播状态更新。每个节点选择一个随机节点来传递它的信息。这是经常间隔完成的，每1秒钟说。每次，选择随机节点以传递信息。\n   消息不应消耗大量的网络带宽。应该有几百kBs的上限，确保应用程序＆＃39;数据传输不会受到群集中过多的消息。\n 元数据传播应该容忍网络和一些服务器故障。即使少量网络链路已关闭，也应该达到所有群集节点，或者一些服务器失败。\n  每个群集节点将元数据存储为与群集中的每个节点相关联的键值对列表：\n     在启动时，每个群集节点会添加关于自身的元数据，需要传播到其他节点。元数据的一个例子可以是节点侦听的IP地址和端口，＆＃39负责等。八卦实例需要了解至少一个其他节点以启动八字通信。众所周知的群集节点用于初始化八足实例称为种子节点或介绍者。任何节点都可以充当介绍者。 \npublic gossip（inetaddressandport listendaddress，list＆lt; inetaddressandport＆gt; seednodes，string nodeid）抛出ioException {this.listenaddress = listenaddress; //在其Seed节点的一部分中筛选此节点本身.SeedNodes = RemoveSfaddress（Seednodes）; this.nodeId = new nodeid（nodeid）; addlocalstate（gossipkeys.address，listendaddress.tostring（））; this..socketserver = new nioscoptlistener（newgossiprequestconsumer（），lisisidaddress）;私有void addLocalstate（String键，字符串值）{nodestate nodeState = clustermetadata.get（listenaddress）; if（nodestate == null）{nodestate = new nodestate（）; clustermetadata.put（nodeid，nodestate）; nodeState.Add（key，new serveoryedvalue（值，IncremenetVersion（）））; }\n 每个群集节点调度作业以定期将其传输到其他节点的元数据。\n  Private ScheduledThreadPoolExecutor Gossipexecutor =新的ScheduledThreadPoolExecutor（1）;私人长gossipintervalms = 1000;私人调度＆lt;？＆gt;任务费; public void start（）{socketserver.start（）;任务文件= gossipexecutor.scheduleatfixedrate（（） - ＆gt; dogossip（），gossipintervalms，gossipintervalms，timeunit.milliseconds）; }\n 调用计划任务时，它会从元数据映射的服务器列表中拾取一小组随机节点。定义为Gossip Fanout的小常量数，确定要作为八卦目标拾取的节点。如果已知任何内容，它会拾取一个随机种子节点，并将其发送到该节点的元数据映射。\n  public void dogossip（）{list＆lt; inetaddressandport＆gt; nextedclusternodes = liveodes（）; if（nexinnclusterternode.isusptey（））{sendgossip（Seednodes，Gossipfanout）; } else {sendgossip（joadingclusternodes，gossipfanout）;私人列表＆lt; inetaddressandport＆gt; liveodes（）{set＆lt; inetaddressandport＆gt; nodes = clustermetadata.values（）.stream（）.map（n  - ＆gt; inetaddressandport.parse（n.get（gossipkeys.address）.getvalue（）））.collect（collectors.toset（））; return removeselfaddress（节点）; }\n  私有void sendgossip（list＆lt; inetaddressandport＆gt; nearyClUsternodes，int gossipfanout）{if（nextedClusterternode.Isempty（））{return; for（int i = 0; i＆lt; gossipfanout; i ++）{inetaddressandport nodeaddress = pickrandomnode（nearyClusternodes）; sendgossipto（nodeaddress）;私有void sendgossipto（inetaddressandport nodeaddress）{try {getlogger（）。信息（＆＃34;向＆＃34发送八卦状态）; socketClient＆lt; RequestorResponse＆gt; socketClient =新的侧面（Nodeaddress）; gossipstatemessage gossipstatemessage = new gossipstatemessage（this.clustermetadata）; RequestorResponse Request = creategossipstateRequest（gossipstatemessage）; byte [] responseBytes = socketClient.Blocksend（请求）; gossipstatemessage rendalestate = deserialize（responseBytes）;合并（ReplaceState.getNodeStates（））; catch（ioException e）{getlogger（）。错误（＆＃34; io错误，同时将八卦状态发送到＆＃34; + nodeaddress，e）; Private RequestorResponse CreateGossipstateRequest（GossipStateMessage GossipStateMessage）{return new RequestorResponse（requestId.pushpullgossipstate.getId（），jsonserdes.serialize（gossipstatemessage），correlitationId ++）;}\n 接收GOSSIP消息的群集节点检查它拥有的元数据并找到三件事。 \n在此节点中的传入消息中的值＆＃39; s状态图\n  当节点具有输入消息中存在的值时，选择更高版本值\n 然后它将缺失值添加到自己的状态映射。无论从传入消息中缺少什么值，都将作为响应返回。\n 发送Gossip消息的群集节点会添加其从八卦响应到自己状态的值。\n  私有void handlegossiprequest（org.distrib.patterns.common.message＆lt; RequestorResponse＆gt;请求）{gossipstatemessage gossipstatemessage = deserialize（request.getrequest（））;地图＆lt; nodeid，nodestate＆gt; gossipedstate = gossipstatemessage.getnodeStates（）; getLogger（）。信息（＆＃34;来自＆＃34的合并状态; + Request.getClientsocket（））;合并（八卦斯特泰特）;地图＆lt; nodeid，nodestate＆gt; diff = delta（this.clustermetadata，gossedstate）; gossipstatemessage diffresponse = new gossipstatemessage（diff）; getlogger（）。信息（＆＃34;发送差异响应＆＃34; +差异）; Request.getClientsocket（）。写（new RequestorResponse（requestId.pushpullgossipstate.getId（），jsonserdes.serialize（diffresponse），Request.getRequest（）。getcorrelationId（）））; }\n 公共图＆lt; nodeid，nodestate＆gt; delta（map＆lt; nodeid，nodestate＆gt; frommap，map＆lt; nodeid，nodestate＆gt; tomap）{map＆lt; nodeid，nodestate＆gt; delta = new hashmap＆lt;（）; for（nodeid密钥：frommap.keyset（））{if（！tomap.containskey（key））{delta.put（key，frommap.get（key））;继续;从states = frommap.get（key）; nodestate tostates = tomap.get（key）; nodestate差异= fromstates.diff（tostates）; if（！diffstates.isusemaly（））{delta.put（key，差错）; }}返回delta;}\n 公共void合并（Map＆lt; nodeid，nodestate＆gt; Otherstate）{map＆lt; nodeid，nodestate＆gt; diff = delta（Otherstate，this.clustermetadata）; for（nodeid diffkey：diff.keyset（））{if（！thice.clustermetadata.containskey（diffkey））{this.clustermetadata.put（diffkey，diff.get（diffey））; } else {nodestate statemap = this.clustermetadata.get（diffkey）; statemap.putlal（diff.get（diffkey））; }}} \n每个群集节点在每个群集节点处每隔一秒一次发生此过程，每次选择不同的节点以交换状态。\n 上面的代码示例显示了节点的完整状态在GOSSIP消息中发送。这对新加入的节点很好，但是一旦状态是最新的，它就不必发送了完整状态。群集节点只需要自上次八卦以来发送状态更改。为了实现这一目标，每个节点都维护每次在本地添加新的元数据条目时递增的版本号。\n   群集元数据中的每个值都以版本号维护。这是模式版本为值的示例。\n  int版本;字符串值; public supmentedValue（String值，int版）{this.version =版本; this.value = value; public int getversion（）{返回版本; public string getValue（）{返回值; }\n   私有void sendknversions（inetaddressandport gossipto）抛出IoException {Map＆lt; nodeId，Integer＆gt; maxknnownnodeversions = getmaxknownnodeversions（）; RequestorResponse mepardversionRequest = new RequestorResponse（requestId.gossipversions.getId（），jsonserdes.serialize（新的gossipstateversions（maxknownnodeversionsions），0）; socketClient＆lt; RequestorResponse＆gt; socketClient =新侧面套接字（Gossipto）; byte [] hypernversionResponseBytes = SocketClient.BlockingsEnd（ketapversversionRequest）;私人地图＆lt; nodeid，整数＆gt; getmaxknnodeversions（）{return clustermetadata.entryset（）.stream（）.collect（collectors.tomap（e-＆gt; e.getkey（），e-＆gt; e.getvalue（）。maxversion（））; }\n   然后，当版本大于请求中的版本时，接收节点只能发送值。\n  地图＆lt; nodeid，nodestate＆gt; getmissingandnodestateshigherthan（map＆lt; nodeid，整数＆gt; nodemaxversions）{map＆lt; nodeid，nodestate＆gt; delta = new hashmap＆lt;（）; delta.cputall（legervacessednodeStates（nodemaxversions））; delta.putlal（漏洞（nodemaxversions））;返回三角洲;私人地图＆lt; nodeid，nodestate＆gt;漏洞（Map＆lt; nodeid，整数＆gt; nodemaxversions）{map＆lt; nodeid，nodestate＆gt; delta = new hashmap＆lt;（）;列表＆lt; nodeid＆gt; missingkeys = clustermetadata.keyset（）。stream（）。过滤器（key  - ＆gt;！nodemaxversions.containskey（key））。收集（收集器.Tolist（））; for（nodeid missingkey：missingkyys）{delta.put（lisskey，clustermetadata.get（忘掉））; }返回三角洲;私人地图＆lt; nodeid，nodestate＆gt;高reserversedNodeStates（Map＆lt; nodeid，整数＆gt; nodemaxversions）{map＆lt; nodeid，nodestate＆gt; delta = new hashmap＆lt;（）;设置＆lt; nodeid＆gt; keyset = nodemaxversions.keyset（）; for（nodeId节点：keyset）{整数maxversion = nodemaxversions.get（节点）; nodestate nodestate = clustermetadata.get（节点）; if（nodestate == null）{继续; nodestate deltastate = nodestate.statesgreaterthan（maxversion）; if（！deltastate.isusemal（））{delta.put（node，deltastate）; }}返回delta; } \nGossip在[Cassandra]中的实现优化了一种用三方握手优化状态交换，其中接收Gossip消息的节点也将从发件人提供所需的版本以及它返回的元数据。然后，发件人可以立即使用所请求的元数据响应。这避免了额外的消息，否则是必需的。\n [蟑螂]中使用的八卦协议为每个连接的节点维护状态。对于每个连接，它将发送到该节点的最后一个版本，并从该节点接收的版本。这是可以发送＆＃39;自上次发送的版本以来的状态。并询问＆＃39;来自上次收到的版本和＃39的状态;\n 也可以使用一些其他有效的替代方案，发送整个地图的哈希，如果哈希相同，则无效。\n 群集节点随机选择要发送八卦消息的节点。 Java中的示例实现可以使用java.util.random如下：\n  私有随机= new random（）;私有inetaddressandport pickrandomnode（list＆lt; inetaddressandport＆gt; nearyClusternodes）{intrandnnodeindex = wandom.nextint（nexindclusternodes.size（））; inetaddressandport gossipto = nugindclusterternode.get（randomnodeindex）;返回gossipto; }\n 可以存在其他考虑因素，例如最少联系的节点。例如，蟑螂中的八卦协议以这种方式选择节点。\n 维护群集中的可用节点列表是Gossip协议最常见的使用之一。使用两种方法。 \n[Swim-Gossip]使用一个单独的探测组件，该组件在群集中连续探测群集中的不同节点以检测它们是否可用。如果检测到节点是活着的或死亡，则该结果与八卦通信传播到整个群集。探测器随机选择一个节点以发送八卦消息。如果接收节点检测到这是新信息，则会立即将消息发送到随机选择的节点。这样，整个群集将在群集中快速已知群集中的节点或新连接的节点的故障。\n 群集节点可以定期更新自己的状态以反映其心跳。然后通过交换的八字消息传播到整个群集。然后，每个群集节点可以检查它是否已在固定的时间内接收到特定群集节点的任何更新，或者将节点的标记为下降。在这种情况下，每个群集节点独立地确定节点是否上或向下。\n 如果节点崩溃或重新启动，则版本后的值不起作用，因为所有内存状态都丢失。更重要的是，节点可以对相同键具有不同的值。例如，群集节点可以以不同的IP地址和端口启动，或者可以以不同的配置开始。生成时钟可用于标记每个值的生成，从而当元数据状态被发送到随机簇节点时，接收节点可以检测不仅仅是由版本号的变化，还可以与生成一起检测。\n 值得注意的是，这种机制不是必需的核心八卦协议工作。但它在实践中实施了它＆＃39，以确保正确跟踪状态更改。\n [Cassandra]使用Gossip协议进行组成员身份和群集节点的故障检测。还使用GOSSIP协议发送诸如分配给每个群集节点的令牌的每个群集节点的元数据。\n   BlockChain实现，如Hyperlowger Fabric，使用Gossip协议进行组成员身份和发送分类帐元数据。 ", "note_en": "Use random selection of nodes to pass on information to ensure it reaches all the nodes in the cluster without flooding the network\n  In a cluster of nodes, each node needs to pass metadata information it has, to all the other nodes in the cluster, without depending on a shared storage. In a large cluster, if all servers communicate with all the other servers, a lot of network bandwidth can be consumed. Information should reach all the nodes even when some network links are experiencing issues.\n Cluster nodes use gossip style communication to propagate state updates. Each node selects a random node to pass the information it has. This is done at a regular interval, say every 1 second. Each time, a random node is selected to pass on the information.\n   The messages should not consume a lot of network bandwidth. There should be an upper bound of say a few hundred Kbs, making sure that the applications&#39; data transfer is not impacted by too many messages across the cluster.\n The metadata propagation should tolerate network and a few server failures. It should reach all the cluster nodes even if a few network links are down, or a few servers have failed.\n  Each cluster nodes stores the metadata as a list of key value pairs associated with each node in the cluster as following:\n     At startup, each cluster node adds the metadata about itself, which needs to be propagated to other nodes. An example of metadata can be the IP address and port the node listens on, the partitions it&#39;s responsible for, etc. The Gossip instance needs to know about at least one other node to start the gossip communication. The well known cluster node, which is used to initialize the Gossip instance is called as a seed node or an introducer. Any node can act as an introducer.\n  public Gossip(InetAddressAndPort listenAddress, List&lt;InetAddressAndPort&gt; seedNodes, String nodeId) throws IOException { this.listenAddress = listenAddress; //filter this node itself in case its part of the seed nodes this.seedNodes = removeSelfAddress(seedNodes); this.nodeId = new NodeId(nodeId);  addLocalState(GossipKeys.ADDRESS, listenAddress.toString()); this.socketServer = new NIOSocketListener(newGossipRequestConsumer(), listenAddress); } private void addLocalState(String key, String value) { NodeState nodeState = clusterMetadata.get(listenAddress); if (nodeState == null) { nodeState = new NodeState(); clusterMetadata.put(nodeId, nodeState); } nodeState.add(key, new VersionedValue(value, incremenetVersion())); }\n Each cluster node schedules a job to transmit the metadata it has to other nodes at regular intervals.\n  private ScheduledThreadPoolExecutor gossipExecutor = new ScheduledThreadPoolExecutor(1); private long gossipIntervalMs = 1000; private ScheduledFuture&lt;?&gt; taskFuture; public void start() { socketServer.start(); taskFuture = gossipExecutor.scheduleAtFixedRate(()-&gt; doGossip(), gossipIntervalMs, gossipIntervalMs, TimeUnit.MILLISECONDS); }\n When the scheduled task is invoked, it picks up a small set of random nodes from the list of servers from the metadata map. A small constant number, defined as Gossip fanout, determines how many nodes to pick up as gossip targets. If nothing is known yet, it picks up a random seed node and sends the metadata map it has to that node.\n  public void doGossip() { List&lt;InetAddressAndPort&gt; knownClusterNodes = liveNodes(); if (knownClusterNodes.isEmpty()) { sendGossip(seedNodes, gossipFanout); } else { sendGossip(knownClusterNodes, gossipFanout); } } private List&lt;InetAddressAndPort&gt; liveNodes() { Set&lt;InetAddressAndPort&gt; nodes = clusterMetadata.values() .stream() .map(n -&gt; InetAddressAndPort.parse(n.get(GossipKeys.ADDRESS).getValue())) .collect(Collectors.toSet()); return removeSelfAddress(nodes); }\n  private void sendGossip(List&lt;InetAddressAndPort&gt; knownClusterNodes, int gossipFanout) { if (knownClusterNodes.isEmpty()) { return; } for (int i = 0; i &lt; gossipFanout; i++) {  InetAddressAndPort nodeAddress = pickRandomNode(knownClusterNodes); sendGossipTo(nodeAddress); }}private void sendGossipTo(InetAddressAndPort nodeAddress) { try { getLogger().info(&#34;Sending gossip state to &#34; + nodeAddress); SocketClient&lt;RequestOrResponse&gt; socketClient = new SocketClient(nodeAddress); GossipStateMessage gossipStateMessage = new GossipStateMessage(this.clusterMetadata); RequestOrResponse request = createGossipStateRequest(gossipStateMessage); byte[] responseBytes = socketClient.blockingSend(request); GossipStateMessage responseState = deserialize(responseBytes); merge(responseState.getNodeStates()); } catch (IOException e) { getLogger().error(&#34;IO error while sending gossip state to &#34; + nodeAddress, e); }}private RequestOrResponse createGossipStateRequest(GossipStateMessage gossipStateMessage) { return new RequestOrResponse(RequestId.PushPullGossipState.getId(), JsonSerDes.serialize(gossipStateMessage), correlationId++);}\n The cluster node receiving the gossip message inspects the metadata it has and finds three things.\n The values which are in the incoming message but not available in this node&#39;s state map\n  The higher version value is chosen when the node has the values present in the incoming message\n It then adds the missing values to its own state map. Whatever values were missing from the incoming message, are returned as a response.\n The cluster node sending the Gossip message adds the values it gets from the gossip response to its own state.\n  private void handleGossipRequest(org.distrib.patterns.common.Message&lt;RequestOrResponse&gt; request) { GossipStateMessage gossipStateMessage = deserialize(request.getRequest()); Map&lt;NodeId, NodeState&gt; gossipedState = gossipStateMessage.getNodeStates(); getLogger().info(&#34;Merging state from &#34; + request.getClientSocket()); merge(gossipedState); Map&lt;NodeId, NodeState&gt; diff = delta(this.clusterMetadata, gossipedState); GossipStateMessage diffResponse = new GossipStateMessage(diff); getLogger().info(&#34;Sending diff response &#34; + diff); request.getClientSocket().write(new RequestOrResponse(RequestId.PushPullGossipState.getId(), JsonSerDes.serialize(diffResponse), request.getRequest().getCorrelationId())); }\n public Map&lt;NodeId, NodeState&gt; delta(Map&lt;NodeId, NodeState&gt; fromMap, Map&lt;NodeId, NodeState&gt; toMap) { Map&lt;NodeId, NodeState&gt; delta = new HashMap&lt;&gt;(); for (NodeId key : fromMap.keySet()) { if (!toMap.containsKey(key)) { delta.put(key, fromMap.get(key)); continue; } NodeState fromStates = fromMap.get(key); NodeState toStates = toMap.get(key); NodeState diffStates = fromStates.diff(toStates); if (!diffStates.isEmpty()) { delta.put(key, diffStates); } } return delta;}\n public void merge(Map&lt;NodeId, NodeState&gt; otherState) { Map&lt;NodeId, NodeState&gt; diff = delta(otherState, this.clusterMetadata); for (NodeId diffKey : diff.keySet()) { if(!this.clusterMetadata.containsKey(diffKey)) { this.clusterMetadata.put(diffKey, diff.get(diffKey)); } else { NodeState stateMap = this.clusterMetadata.get(diffKey); stateMap.putAll(diff.get(diffKey)); } }}\n This process happens every one second at each cluster node, each time selecting a different node to exchange the state.\n The above code example shows that the complete state of the node is sent in the Gossip message. This is fine for a newly joined node, but once the state is up to date, it&#39;s unnecessary to send the complete state. The cluster node just needs to send the state changes since the last gossip. For achieving this, each node maintains a version number which is incremented every time a new metadata entry is added locally.\n   Each value in the cluster metadata is maintained with a version number. This is an example of pattern  Versioned Value.\n  int version; String value; public VersionedValue(String value, int version) { this.version = version; this.value = value; } public int getVersion() { return version; } public String getValue() { return value; }\n   private void sendKnownVersions(InetAddressAndPort gossipTo) throws IOException { Map&lt;NodeId, Integer&gt; maxKnownNodeVersions = getMaxKnownNodeVersions(); RequestOrResponse knownVersionRequest = new RequestOrResponse(RequestId.GossipVersions.getId(), JsonSerDes.serialize(new GossipStateVersions(maxKnownNodeVersions)), 0); SocketClient&lt;RequestOrResponse&gt; socketClient = new SocketClient(gossipTo); byte[] knownVersionResponseBytes = socketClient.blockingSend(knownVersionRequest); } private Map&lt;NodeId, Integer&gt; getMaxKnownNodeVersions() { return clusterMetadata.entrySet() .stream() .collect(Collectors.toMap(e -&gt; e.getKey(), e -&gt; e.getValue().maxVersion())); }\n   The receiving node can then send the values only if the versions are greater than the ones in the request.\n  Map&lt;NodeId, NodeState&gt; getMissingAndNodeStatesHigherThan(Map&lt;NodeId, Integer&gt; nodeMaxVersions) { Map&lt;NodeId, NodeState&gt; delta = new HashMap&lt;&gt;(); delta.putAll(higherVersionedNodeStates(nodeMaxVersions)); delta.putAll(missingNodeStates(nodeMaxVersions)); return delta; } private Map&lt;NodeId, NodeState&gt; missingNodeStates(Map&lt;NodeId, Integer&gt; nodeMaxVersions) { Map&lt;NodeId, NodeState&gt; delta = new HashMap&lt;&gt;(); List&lt;NodeId&gt; missingKeys = clusterMetadata.keySet().stream().filter(key -&gt; !nodeMaxVersions.containsKey(key)).collect(Collectors.toList()); for (NodeId missingKey : missingKeys) { delta.put(missingKey, clusterMetadata.get(missingKey)); } return delta; } private Map&lt;NodeId, NodeState&gt; higherVersionedNodeStates(Map&lt;NodeId, Integer&gt; nodeMaxVersions) { Map&lt;NodeId, NodeState&gt; delta = new HashMap&lt;&gt;(); Set&lt;NodeId&gt; keySet = nodeMaxVersions.keySet(); for (NodeId node : keySet) { Integer maxVersion = nodeMaxVersions.get(node); NodeState nodeState = clusterMetadata.get(node); if (nodeState == null) { continue; } NodeState deltaState = nodeState.statesGreaterThan(maxVersion); if (!deltaState.isEmpty()) { delta.put(node, deltaState); } } return delta; }\n Gossip implementation in  [cassandra] optimizes state exchange with a three-way handshake, where the node receiving the gossip message also sends the versions it needs from the sender, along with the metadata it returns. The sender can then immediately respond with the requested metadata. This avoids an extra message that otherwise would have been required.\n Gossip protocol used in  [cockroachdb] maintains state for each connected node. For each connection, it maintains the last version sent to that node, and the version received from that node. This is so that it can send &#39;state since the last sent version&#39; and ask for &#39;state from the last received version&#39;.\n Some other efficient alternatives can be used as well, sending a hash of the entire Map and if the hash is the same, then doing nothing.\n Cluster nodes randomly select the node to send the Gossip message. An example implementation in Java can use java.util.Random as following:\n  private Random random = new Random(); private InetAddressAndPort pickRandomNode(List&lt;InetAddressAndPort&gt; knownClusterNodes) { int randomNodeIndex = random.nextInt(knownClusterNodes.size()); InetAddressAndPort gossipTo = knownClusterNodes.get(randomNodeIndex); return gossipTo; }\n There can be other considerations such as the node that is least contacted with. For example, Gossip protocol in  Cockroachdb selects nodes this way.\n Maintaining the list of available nodes in the cluster is one of the most common usage of Gossip protocols. There are two approaches in use.\n [swim-gossip] uses a separate probing component which continuously probes different nodes in the cluster to detect if they are available. If it detects that the node is alive or dead, that result is propagated to the entire cluster with Gossip communication. The prober randomly selects a node to send the Gossip message. If the receiving node detects that this is new information, it immediately sends the message to a randomly selected node. This way, the failure of a node or newly joined node in the cluster is quickly known to the entire cluster.\n The cluster node can periodically update its own state to reflect its heartbeat. This state is then propagated to the entire cluster through the gossip messages exchanged. Each cluster node can then check if it has received any update for a particular cluster node in a fixed amount of time or else mark that node as down. In this case, each cluster node independently determines if a node is up or down.\n The versioned values does not work well if the node crashes or restarts, as all the in-memory state is lost. More importantly, the node can have different values for the same key. For example, the cluster node can start with a different IP address and port, or can start with a different configuration.  Generation Clock can be used to mark generation with every value, so that when the metadata state is sent to a random cluster node, the receiving node can detect changes not just by the version number, but also with the generation.\n It is useful to note that this mechanism is not necessary for the core Gossip protocol to work. But it&#39;s implemented in practice to make sure that the state changes are tracked correctly.\n [cassandra] uses Gossip protocol for the group membership and failure detection of cluster nodes. Metadata for each cluster node such as the tokens assigned to each cluster node, is also transmitted using Gossip protocol.\n   Blockchain implementations such as  Hyperledger Fabric use Gossip protocol for group membership and sending ledger metadata.", "posttime": "2021-06-20 13:14:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "八卦,gossip,节点", "title": "八卦传播 ", "title_en": "Gossip Dissemination", "transed": 1, "url": "https://martinfowler.com/articles/patterns-of-distributed-systems/gossip-dissemination.html", "via": "", "real_tags": ["八卦", "gossip", "节点"]}, {"category": "", "categoryclass": "", "imagename": "afab6ba73b70acbe35cb9d128ff6eea4.jpeg", "infoid": 1066988, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\n这是有趣的事情，同样的人绝对坚持，教会图灵论文意味着Muh电脑是一切的全部强大的模拟器，或者重复AI将取代每个人的工作将提出精心制作的原因，为什么上面列出的这些东西也是如此尽管大多数人在计算机工程中的VLSI时代解决了问题，但难以实现。现实是他们都很有可能，但没有人赚钱。工程师是一个被击败的部落;聘请一个“AI”（外星人或移民）奴隶更便宜，以写下Terraform或电子前端，而不是支付巧妙的工程师，足以建立自己的工具，使他们更加富有成效，世界更好。消费者将吸收它并随着计划过时购买更多的内存，并使硬件行业在商业中。计算机不是为了让你的生活更轻松;他们是为了监督和营销，为制造商提供消费者的好，他们希望您购买大量附加组件和升级，并尽快磨损。 ", "note_en": "There are a number of things that people theoretically know how to do, but which aren’t possible because of how software gets made. Some of these are almost forgotten, but there are at least examples of all of them in existence.\n Automated FFI parsers. In 2021 I should be able to point any interpreted language at a C include file and have all the functions described in it turned into reasonably safe FFIed function calls, complete with autogenerated documentation. For example, if I want javascript calls to libsodium, I shouldn’t have to write anything; javascript knows about C APIs. I’m not asking for runtimes to talk to each other, you can keep up the insipid RPC-serialization conga dance for that. I’m just asking for a technology that encapsulates C (and Fortran and …. maybe C++) function calls and makes them accessible to other runtimes without actually doing any work. Of course parsers that do useful things are hard; people would rather write new serialization protocols. There will always be exceptions where such things don’t work, but you should be able to do 95% of the work using metaprogramming. Crap that runs on the JVM; same story -not only could you technically parse .h files and turn them into JNI, you should be able to have all your hooks into Clojure or Scala or whatever without writing anything. Clojure at least seems well equipped to do it, but I’m pretty sure this hasn’t happened yet. You see pieces of  this idea  here and  there, but like everything else about modernity, they suck.\n While I’m talking about FFIs to high level languages, how about a VM that recognizes that it is not a unique snowflake, and that sometimes you have to call a function which may allocate memory outside its stack or something similarly routine but insane. Most VM designs I’ve seen are basically just student exercises; why not assume the outside world exists and has useful things to say? I think Racket has some good  ideas in this domain, but I’m pretty sure it could be done better and there should be a higher standard.\n Cloud providers should admit they’re basically mainframes and write an operating system instead of the ad-hoc collection of horse shit they foist on developers. Imagine if the EC2 were as clean as, I dunno,  z/OS, which has more or less been around since the 1960s. That would be pretty cool. I could read a single book instead of 100 books on all the myriad tools and services and frameworks offered by Oligarch Bezos. He would be hailed as a Jobs-like technical innovator if he had some of his slaves do this, and he would be remembered with gratitude, rather than as the sperdo who dumped his wife for sexorz with lip filler  Cthulhu. There’s no excuse for this from an engineering perspective; Bezos was smart enough to know he was going to do timesharing, he was also smart enough to constrain the spaghetti into something resembling an OS. Same story with all the other cloud services. Really, they should all run like Heroku and you’d never notice they were there. You could also draw flowcharts for most of this shit and replace devops with something that looks like labview. Nobody will do that either, as innovation in core software engineering, or even learning from the past in core software engineering is basically dead.\n Front ends could be drag and drop native GUIs instead of electron apps. There are still examples of this around, but it seems to be a dying paradigm. It’s fascinating to me that people find it easier to write a pile of React and HTML on top of electron rather than dragging and dropping native widgets for a framework like we did in the old days. Literally this was possible on a 286 PC/XT running DOS; it worked great, looked great, had fewer problems. You know why it doesn’t get done? Because doing it is kind of hard, and electron apps are “easy” in that there are tons of cheap, fungible engineers with those skills.  In general  native GUI frameworks are shit and they almost never include a GUI to develop them in. Even if you made something not as shitty as electron; maybe something that took 10mb instead of 500mb and didn’t gobble up all memory on your system that would be amazing. This is completely possible. People used to make GUI frameworks which did  more than electron apps, looked better and fit in the tens of kilobytes range.\n Compilers and interpreters should learn how modern computers work. Pretty much all compilers and interpreters think computers are a PDP-11 stack machine. There are consequences to this everyone knows about: security is fairly execrable. There’s other consequences though! For example, the fact that memory is godawful slow and there are multiple cache speeds is a very serious performance problem unless you’re dealing with trivial amounts of memory. There are no compilers which can help you with this, unless you count meta-compilers on limited problems like ATLAS-BLAS or FFTW. There are a few interpreted languages whose designers have awareness of this and at least don’t fight the OS over these facts, or attempt to insist they’re really running on a PDP-11.\n Operating systems don’t have to look like your crazy hoarder aunt’s house. I know it’s hard to believe, but in my lifetime there were excellent multitasking operating systems with superior GUIs, networking, development toolchains, RTOS subsystems, cryptography that made the NSA nervous, and they all fit on a  70mb tape drive, and they would support something like 20 people checking their email and compiling Fortran for general relativity calculations from emacs terms. Meanwhile, my phone needs a constant diet of gigabyte upgrades to continue functioning reliably as a fucking telephone; telephones theoretically don’t even need a single transistor. Even my linux machines are ridiculously bloated and seem to require daily updates and patches. Why does shit like DPDK exist? Because your OS is stuck in the 1990s when ethernet was 10mbps. There’s zero reason or excuse for this, other than modern programmers are like your crazy hoarder aunt because storage is cheap and competent coder time is expensive. Clean OS design has a lot of follow on benefits, such as rare patching, higher security and lower maintenance in general. I have 4 objects in my house who require constant OS  upgrades (used to be 5, but my macbook committed suicide after an “OS upgrade” so I now use it as a paperweight), not including my TV or my car; make a cleaner OS and life actually gets better instead of everyone being a sort of shitty IT slave to keep their refrigerator and telephone running. Instead of a nice OS, current year innovation  is the open source “ code of conduct” -apparently hoping you’ll attract enough people mentally ill enough to work for free, but sane enough to do useful work; arguably a narrow demographic.\n The funny thing is, the same people who absolutely insist that the Church Turing thesis means muh computer is all-powerful simulator of everything, or repeat the fantasy that AI will replace everyone’s jobs will come up with elaborate reasons why these things listed above are too hard to achieve in the corporeal world, despite most of them being solved problems from the VLSI era of computer engineering. The reality is they’re all quite possible, but nobody makes money doing them. Engineers are a defeated tribe; it’s cheaper to hire an “AI” (Alien or Immigrant) slave to write the terraform or electron front end rather than paying clever engineers well enough to build themselves useful tooling to make them more productive and the world a better place. Consumers will suck it up and buy more memory, along with planned obsolescence, keeping the hardware industry in business. Computers aren’t for making your life easier; they’re for surveillance and marketing, and for manufacturers a consumer good they hope you buy lots of add-ons and  upgrades for, and which wears out as soon as possible.", "posttime": "2021-06-20 13:14:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,software,购买", "title": "明显和可能的软件创新没有人 ", "title_en": "Obvious and possible software innovations nobody does", "transed": 1, "url": "https://scottlocklin.wordpress.com/2021/04/01/obvious-and-possible-software-innovations-nobody-does/", "via": "", "real_tags": ["软件", "software", "购买"]}, {"category": "", "categoryclass": "", "imagename": "672c80ec836afacf0491f39ecd8ee8f8.jpg", "infoid": 1066987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenZFS创建开发人员Matthew Ahrens将于上周将ZFS History-Raidz扩展大师的最追捧的特征合并到船舶中。新功能允许ZFS用户扩展单个RAIDZ VDev的大小。例如，您可以使用新功能将三个磁盘RAIDZ1转换为四个，五个或六个RAIDZ1。\n  OpenZFS是一个复杂的文件系统，事物必然会有点咀嚼，解释了该功能的工作原理。所以，如果你＆＃39; zfs newbie，你可能想回到我们的综合zfs 101介绍。除了作为文件系统之外，ZFS还是一个存储阵列和卷管理器，这意味着您可以将其送到整个磁盘设备，而不仅仅是一个磁盘设备。 ZFS存储系统的核心是ZPool  - 这是ZFS存储最基本的级别。 ZPool又包含vdevs，Vdevs包含它们中的实际磁盘。写入拆分为称为记录或块的单位，然后在VDEV中半均匀地分发。\n 存储vdev可以是五种磁盘，镜像，RAIDZ1，RAIDZ2或RAIDZ3中的五种类型之一。您可以将更多VDEV添加到ZPool，您可以将更多磁盘附加到单个或镜像vdev。但是，通过这种方式管理存储需要一些计划，并预算 - 哪些业余爱好者和家庭主妇经常areN＆＃39; t太热情。\n 传统的RAID，不共享＆＃34;池＆＃34; ZFS的概念通常提供扩展和/或重塑阵列的能力。例如，您可以将单个磁盘添加到六个磁盘RAID6数组中，从而将其转换为七磁盘RAID6阵列。正在进行的活蛋白，特别是痛苦，特别是在几乎全阵列上;它完全可能需要这样的任务可能需要一周或更长时间，阵列性能限制在整个时间的正常常规或更少。\n 从历史上看，ZFS已经避免了这种扩展。 ZFS最初是为商业用途而开发的，而实时阵列重新塑造通常是商业世界中的非启动器。将存储＆＃39;在最终的日子中对无法使用的水平丢弃，通常在工资单和开销中的成本更多，而不是购买完全新的硬件。现场扩展也是非常危险的，因为它涉及阅读和重写所有数据并将阵列放在临时，远远良好的测试中，而＃34;一半，一半，＆＃34;条件直到它完成。\n 对于具有许多磁盘的用户来说，新的RAIDZ扩展不太可能改变它们使用ZFS的方式。将VDEVS视为完整的单位而不是尝试在它们内部捣碎，它仍然更容易且更加实用。但是，使用单个vdev运行ZFS的业余爱好者，HomeBerbers和小用户可能会在新功能中获得大量使用。\n   从实际的角度来看，Ahrens＆＃39;新的VDev扩展功能仅为现有命令添加新功能，即ZPool Attach，通常用于将磁盘添加到单个磁盘VDEV（将其转换为镜像Vdev）或将额外磁盘添加到镜子（for示例，将双磁盘镜像转换为三个磁盘镜像）。 \n使用新的代码，您也能将新磁盘附加到现有的RAIDZ VDEV。这样做扩展了宽度的vdev，但不会更改vdev类型，因此您可以将一个六磁盘RAIDZ2 VDEV转换为七磁盘RAIDZ2 VDEV，但您可以将其转换为七磁盘RAIDZ3。\n 在发出ZPool附件命令后，扩展开始。在扩展期间，每个块或记录从vdev读取正在扩展，然后重写。重写块的扇区在VDev中的所有磁盘中分发，包括新磁盘，但条带本身的宽度不会改变。因此，在扩展完成后，RAIDZ2 VDEV从六个磁盘扩展到十块仍然仍然充满六个条纹。\n 因此，虽然用户将看到新磁盘提供的额外空间，但由于新磁盘，扩展数据的存储效率不会改进。在上面的示例中，我们从一个六盘RAIDZ2开始，标称存储效率为67％（每六个扇区中的四个是数据）到一个十盘RAIDZ2。新写入十盘RAIDZ2的数据具有80％-八个扇区的标称存储效率是数据 - 但旧的扩展数据仍然用六个条纹写入，因此它仍然具有旧的储存效率旧的67％ 。\n 值得注意的是，这是一个vdev的意外或奇异的状态，因为vdev是raidz已经使用动态，变量​​条带宽宽度来占块或记录太小，以在所有磁盘上条纹。一个vdev。\n 例如，如果您编写单个元数据块 - 包含文件＆＃39; s名称，权限和磁盘上的位置的数据 - 它适合磁盘上的单个扇区。如果您将元数据块写入一个十宽的RAIDZ2，则您不会写一个完整的十宽条纹，而是写一个尺寸的块宽的块;单个数据扇区加上两个奇偶校长扇区。所以＆＃34;尺寸＆＃34;在一个新扩展的RAIDZ VDEV aren＆＃39; t的东西是zfs困惑的东西。他们＆＃39;在办公室旁边只是另一天。\n  正如我们上面所讨论的那样，一个新扩展的RAIDZ VDev Won＆＃39; t看起来非常像是那种从＆＃34那样设计的那样;诞生＆＃34;  - 至少，不是起初。虽然混合中有更多的磁盘，但数据的内部结构是＆＃39; t的变化。\n 向VDEV添加一个或多个新磁盘意味着它应该能够稍高的吞吐量。即使遗留块Don＆＃39; t跨越Vdev的整个宽度，所添加的磁盘意味着更多主轴以分配工作。这可能会赢得＆＃39; t制作了jaw滴加速度，但七碟vdev上的六个条纹意味着您仍然可以同时读取或写两个块，因此可能有任何速度改进很小。 \n对性能的净影响可能很难预测。例如，如果从六个磁盘RAIDZ2扩展到七磁盘RAIDZ2，例如，您的原始六磁盘配置并没有任何填充。可以将128kib块均匀地切成四个32kib数据片，两个32kib奇偶校验件。七个磁盘之间的相同记录拆分需要填充，因为128kib /五个数据件并未出现偶数扇区。\n    同样，在某些情况下 - 特别是小型记录或volblocksize-vollblocksize  - 每个磁盘的工作量可能在较旧的，比较更广泛的更广泛的较窄的布局中可能会显着降低。将128kib块分成32kib块，用于六个RAIDZ2，每个磁盘可以更有效地读取或写入，而不是一个分成16kib件的十宽RAIDZ2，例如它＆＃39;无论是更多磁盘但较小的碎片将提供更多吞吐量，而不是更少的磁盘，但较大的碎片。\n 您可以确定的一件事是，新扩展的配置通常应执行以及原始的非扩展版本 - 一旦大多数数据是（重新）以新宽度编写，扩展VDev Won＆＃39 ; t执行任何不同，或者与从一开始时那样的任何不那么可靠。\n  初始扩展过程似乎奇怪的是，初始扩展过程并在新的宽度上重写所有现有块，而att＃39;毕竟，它＆＃39;无论如何阅读和重新编写数据，对吧？我们要求Ahrens为什么原始宽度留下，并且答案归结为＆＃34;它更容易，更安全。＆＃34;\n 识别的一个关键因素是在技术上，扩展ISN＆＃39; T移动块;它＆＃39;只是移动扇区。它的方式＆＃39;编写的，扩展代码没有必要知道ZFS＆＃39;逻辑块边界是 - 扩展例程不知道单个扇区是否是奇偶校验或数据，更不用说它属于哪个阻止它。\n 扩展可以遍历所有块指针来定位块边界，然后它将知道哪个扇区属于哪个块以及如何重塑块，而是根据Ahrens，做任何方式对ZFS＆＃39的方式非常侵入。磁盘格式。扩展需要在MetasLabs上不断更新SpaceMaps，以解释每个块的磁盘大小的变化 - 如果块是数据集的一部分，而不是zvol，更新每位数据集和每文件空间会计出色地。\n 如果它真的让你的牙齿痒痒地知道你在新鲜五个Vdev上有四个条纹，你可以在扩展完成后立即阅读并重新编写数据。最简单的方法是使用ZFS快照，ZFS发送，ZFS接收以复制整个数据集和ZVols。如果您＆＃39;重新担心ZFS属性，简单的MV操作将完成技巧。 \n然而，在大多数情况下推荐我们在大多数情况下推荐放松和让ZFS做它的事情。来自旧数据的overmed块areN＆＃39; t真正伤害了任何东西，当您自然删除和/或改变Vdev的使用寿命时，大多数都将根据需要自然地重新编写，而无需管理员干预或者由于痴迷阅读和重新编写所有内容，长期高存储负荷。\n  Ahrens＆＃39;新的代码在OpenZFS Master中，但尚未成为任何OpenZFS发布的一部分，更不用说别的人添加到其他人和＃39;我的存储库中。当我们期望在生产中看到代码时，我们问了Ahrens，不幸的是，它将是一段时间。\n RAIDZ扩展命中硕士太晚了，即即将到来的OpenZFS 2.1发布，预计很快（现在可以使用2.1发布候选人7）。它应该包含在下一个主要的OpenZFS释放中;它＆＃39为混凝土日期太早，但主要发布通常每年发生一次。\n 广泛地说，我们预计RAIDZ扩张在2022年8月2022年8月的某个地方的ubuntu和freebsd的应用中击中了生产，但是猜测。 Truenas可能会很好地将其进入生产中的生产，因为在官方命中释放状态之前，IxSystems倾向于从Master中提取ZFS功能。 ", "note_en": "OpenZFS founding developer Matthew Ahrens merged one of the most sought-after features in ZFS history—RAIDz expansion—into master last week. The new feature allows a ZFS user to expand the size of a single RAIDz vdev. For example, you can use the new feature to turn a three-disk RAIDz1 into a four, five, or six RAIDz1.\n  OpenZFS is a complex filesystem, and things are necessarily going to get a bit chewy explaining how the feature works. So if you&#39;re a ZFS newbie, you may want to refer back to our comprehensive ZFS 101  introduction.  In addition to being a filesystem, ZFS is a storage array and volume manager, meaning that you can feed it a whole pile of disk devices, not just one. The heart of a ZFS storage system is the zpool—this is the most fundamental level of ZFS storage. The  zpool in turn contains  vdevs, and  vdevs contain actual disks within them. Writes are split into units called  records or  blocks, which are then distributed semi-evenly among the  vdevs.\n A storage  vdev can be one of five types—a single disk, mirror,  RAIDz1,  RAIDz2, or  RAIDz3. You can add more  vdevs to a  zpool, and you can  attach more disks to a single or mirror  vdev. But managing storage this way requires some planning ahead and budgeting—which hobbyists and homelabbers frequently aren&#39;t too enthusiastic about.\n Conventional  RAID, which does not share the &#34;pool&#34; concept with ZFS, generally offers the ability to expand and/or reshape an array in place. For example, you might add a single disk to a six-disk  RAID6 array, thereby turning it into a seven-disk  RAID6 array. Undergoing a live reshaping can be pretty painful, especially on nearly full arrays; it&#39;s entirely possible that such a task might require a week or more, with array performance limited to a quarter or less of normal the entire time.\n Historically, ZFS has eschewed this sort of expansion. ZFS was originally developed for business use, and live array re-shaping is generally a non-starter in the business world. Dropping your storage&#39;s performance to unusable levels for days on end generally costs more in payroll and overhead than buying an entirely new set of hardware would. Live expansion is also potentially very dangerous since it involves reading and re-writing all data and puts the array in a temporary and far less well-tested &#34;half this, half that&#34; condition until it completes.\n For users with many disks, the new  RAIDz expansion is unlikely to materially change how they use ZFS. It will still be both easier and more practical to manage  vdevs as complete units rather than trying to muck about inside them. But hobbyists, homelabbers, and small users who run ZFS with a single  vdev will likely get a lot of use out of the new feature.\n   From a practical perspective, Ahrens&#39; new  vdev expansion feature merely adds new capabilities to an existing command, namely,  zpool attach, which is normally used to add a disk to a single-disk  vdev (turning it into a  mirror vdev) or add an extra disk to a  mirror (for example, turning a two-disk  mirror into a three-disk  mirror).\n    With the new code, you&#39;ll be able to  attach new disks to an existing  RAIDz vdev as well. Doing so expands the vdev in width but does not change the  vdev type, so you can turn a six-disk  RAIDz2 vdev into a seven-disk  RAIDz2 vdev, but you  can&#39;t turn it into a seven-disk  RAIDz3.\n Upon issuing your  zpool attach command, the expansion begins. During expansion, each  block or  record is read from the  vdev being expanded and is then rewritten. The sectors of the rewritten  block are distributed among all disks in the  vdev, including the new disk(s), but the width of the stripe itself is not changed. So a  RAIDz2 vdev expanded from six disks to ten will still be full of six-wide stripes after expansion completes.\n So while the user will see the extra space made available by the new disks, the storage efficiency of the expanded data will not have improved due to the new disks. In the example above, we went from a six-disk  RAIDz2 with a nominal storage efficiency of 67 percent (four of every six sectors are data) to a ten-disk  RAIDz2. Data  newly written to the ten-disk RAIDz2 has a nominal storage efficiency of 80 percent—eight of every ten sectors are data—but the old expanded data is still written in six-wide stripes, so it still has the old 67 percent storage efficiency.\n It&#39;s worth noting that this isn&#39;t an unexpected or bizarre state for a vdev to be in— RAIDz already uses a dynamic, variable stripe width to account for  blocks or  records too small to stripe across all the disks in a single  vdev.\n For example, if you write a single metadata block—the data containing a file&#39;s name, permissions, and location on disk—it fits within a single  sector on disk. If you write that metadata block to a ten-wide  RAIDz2, you don&#39;t write a full ten-wide stripe—instead, you write an undersized  block only three disks wide; a single data  sector plus two parity  sectors. So the &#34;undersized&#34;  blocks in a newly expanded  RAIDz vdev aren&#39;t anything for ZFS to get confused about. They&#39;re just another day at the office.\n  As we discussed above, a newly expanded  RAIDz vdev won&#39;t look quite like one designed that way from &#34;birth&#34;—at least, not at first. Although there are more disks in the mix, the internal structure of the data isn&#39;t changed.\n Adding one or more new disks to the  vdev means that it should be capable of somewhat higher throughput. Even though the legacy  blocks don&#39;t span the entire width of the  vdev, the added disks mean more spindles to distribute the work around. This probably won&#39;t make for a jaw-dropping speed increase, though—six-wide stripes on a seven-disk  vdev mean that you still can&#39;t read or write two  blocks simultaneously, so any speed improvements are likely to be minor.\n The net impact to performance can be difficult to predict. If you are expanding from a six-disk  RAIDz2 to a seven-disk  RAIDz2, for example, your original six-disk configuration didn&#39;t need any padding. A 128KiB  block can be cut evenly into four 32KiB data pieces, with two 32KiB parity pieces. The same record split among  seven disks requires padding because 128KiB/five data pieces doesn&#39;t come out to an even number of sectors.\n    Similarly, in some cases—particularly with a small  recordsize or  volblocksize set—the workload per individual disk may be significantly less challenging in the older, narrower layout than in the newer, wider one. A 128KiB  block split into 32KiB pieces for a six-wide  RAIDz2 can be read or written more efficiently  per disk than one split into 16KiB pieces for a ten-wide  RAIDz2, for example—so it&#39;s a bit of a crapshoot whether more disks but smaller pieces will provide more throughput than fewer disks but larger pieces did.\n The one thing you can be certain of is that the newly expanded configuration should typically perform as well as the original non-expanded version—and that once the majority of data is (re)written in the new width, the expanded  vdev won&#39;t perform any differently, or be any less reliable, than one that was designed that way from the start.\n  It might seem odd that the initial expansion process doesn&#39;t rewrite all existing  blocks to the new width while it&#39;s running—after all, it&#39;s reading and re-writing the data anyway, right? We asked Ahrens why the original width was left as-is, and the answer boils down to &#34;it&#39;s easier and safer that way.&#34;\n One key factor to recognize is that technically, the expansion  isn&#39;t moving  blocks; it&#39;s just moving  sectors. The way it&#39;s written, the expansion code doesn&#39;t need to know where ZFS&#39; logical  block boundaries are—the expansion routine has no idea whether an individual  sector is parity or data, let alone which  block it belongs to.\n Expansion could traverse all the  block pointers to locate  block boundaries, and  then it would know which  sector belongs to what  block and how to re-shape the  block, but according to Ahrens, doing things that way would be extremely invasive to ZFS&#39; on-disk format. The expansion would need to continually update  spacemaps on  metaslabs to account for changes in the on-disk size of each  block—and if the  block is part of a  dataset rather than a  zvol, update the per-dataset and per-file space accounting as well.\n If it really makes your teeth itch knowing you have four-wide stripes on a freshly five-wide vdev, you can just read and re-write your data yourself after expansion completes. The simplest way to do this is to use  zfs snapshot,  zfs send, and  zfs receive to replicate entire  datasets and  zvols. If you&#39;re not worried about ZFS properties, a simple  mv operation will do the trick.\n However, we&#39;d recommend in most cases just relaxing and letting ZFS do its thing. Your undersized  blocks from older data aren&#39;t really hurting anything, and as you naturally delete and/or alter data over the life of the  vdev, most of them will get re-written naturally as necessary, without the need for admin intervention or long periods of high storage load due to obsessively reading and re-writing everything all at once.\n  Ahrens&#39; new code is in OpenZFS master but is not yet a part of any OpenZFS release, let alone added to anyone else&#39;s repositories. We asked Ahrens when we might expect to see the code in production, and unfortunately, it will be a while.\n RAIDz expansion hit master too late to be included in the upcoming OpenZFS 2.1 release, expected very soon (2.1 release candidate 7 is available now). It should be included in the next major OpenZFS release; it&#39;s too early for concrete dates, but major releases typically happen about once per year.\n Broadly speaking, we expect RAIDz expansion to hit production in the likes of Ubuntu and FreeBSD somewhere around August 2022, but that&#39;s just a guess. TrueNAS may very well put it into production sooner than that, since ixSystems tends to pull ZFS features from master before they officially hit release status.", "posttime": "2021-06-20 13:14:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "粉丝,fans,扩展", "title": "ZFS粉丝，Enjoice  -  Raidz扩张将很快成为一件事 ", "title_en": "ZFS fans, rejoice – RAIDz expansion will be a thing soon", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/raidz-expansion-code-lands-in-openzfs-master/", "via": "", "real_tags": ["粉丝", "fans", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066985, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "赞助的顶部网站（或“赞助瓷砖”）是目前在有限数量的市场中的少数Firefox用户进行测试的实验特征。 Mozilla与广告合作伙伴合作，在Firefox主页（或新选项卡）上为Firefox用户提供赞助的瓷砖。 当用户单击赞助瓷砖时，Mozilla是支付的。  隐私是Mozilla＆＃39;特派团的基础，我们只与符合Firefox隐私标准的广告合作伙伴合作。 我们当前的合作伙伴是Admarketplace。  点击赞助瓦片时，Firefox通过Mozilla拥有的代理服务向我们的合作伙伴发送匿名的技术数据。 此数据不包括任何个人识别信息，只有在您单击赞助的顶端站点时才共享。 ", "note_en": "Sponsored Top Sites (or “sponsored tiles”) is an experimental feature currently being tested by a small percentage of Firefox users in a limited number of markets. Mozilla works with advertising partners to place sponsored tiles on the Firefox home page (or  New Tab) that would be useful to Firefox users. Mozilla is paid when users click on sponsored tiles.\n   Privacy is fundamental to Mozilla&#39;s mission and we only work with advertising partners that meet our privacy standards for Firefox. Our current partner is  adMarketplace.\n  When you click on a sponsored tile, Firefox sends  anonymized technical data to our partner through a Mozilla-owned proxy service. This data does not include any personally identifying information and is only shared when you click on a Sponsored Top Site.", "posttime": "2021-06-20 12:32:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "firefox,begins", "title": "Firefox开始在某些用户的默认主页/新标签页上测试赞助商 ", "title_en": "Firefox Begins Testing Sponsors on Some Users' Default Home Page/New Tab Pages", "transed": 1, "url": "https://support.mozilla.org/en-US/kb/sponsor-privacy", "via": "", "real_tags": ["firefox", "begins"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066983, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据德克萨斯大学奥斯汀·奥斯汀大学的媒体参与的一项新研究，新闻消费者和社交媒体平台用户优先考虑除去亵渎的删除剧情。\n 公众对社交媒体平台和新闻机构删除了令人反感评论的情况如何？\n 我们查看了注释删除的3个方面：删除内容的类型，解释细节，＆amp;人类或算法适度。 🧵https://t.co/xd8z5voay2 @utexasmoody\n  媒体参与中心与荷兰的Erasmus大学合作，葡萄牙北方大学合作，了解公众如何在美国，荷兰和葡萄牙中察觉和中风者。他们在美国975年调查了902人，葡萄牙993年。\n 在评论模板中，旨在看起来像常见的评论平台Disqus，研究人员随机显示了调查参与者社交媒体帖子。这是他们的方式：\n 参与者接触到含有仇恨言论或亵渎的社交媒体帖子。然后，他们从主持人接触到一个帖子 - 人类或算法 - 删除了初始帖子，因为它令人反感。此消息要么专门解释为什么删除帖子，给出了一般意义，为什么它被删除为网站的社区指南，或者没有解释。之后，参与者回答了关于删除的公平或合法性的问题以及主持人是多么透明或值得透明的问题。\n  在所有国家，调查参与者认为删除仇恨的言论比消除亵渎更公平和合法，并发现了所做的主持人，并提供了对更透明的原因的详细解释。在美国和荷兰，参与者发现主持人去除仇恨言论，比那些消除亵渎的人更值得信赖。虽然删除方法 - 无论是人类还是算法 - 都没有影响美国人和荷兰人如何感受到葡萄牙的内容删除，“与算法删除相比，人类主持人的删除是更公平和合法的。” \n主持人应该更多地关注仇恨言论，因为人们认为仇恨言论更需要删除而不是亵渎。  算法主持人可以同样地观察到人类主持人，尽管应该考虑特定的文化背景，因为每个国家可能不是这种情况。 ", "note_en": "News consumers and social media platform users prioritize the removal of hate speech over the removal of profanity, according to a new study by the Center for Media Engagement at the University of Texas, Austin.\n How does the public feel about social media platforms and news organizations deleting offensive comments?\n We looked at 3 aspects of comment deletion: type of deleted content, detail of the explanation, &amp; human or algorithm moderation. 🧵 https://t.co/Xd8Z5VOay2  @UTexasMoody\n  The Center for Media Engagement partnered with Erasmus University in the Netherlands and NOVA University in Portugal to understand how the public perceives comment deletion and the moderators who do it in the United States, the Netherlands, and Portugal. They surveyed 902 people in the United States, 975 in the Netherlands, and 993 in Portugal.\n In a comment template designed to look like the common commenting platform Disqus, researchers randomly showed survey participants social media posts. Here’s how they did it:\n Participants were exposed to a social media post that contained either hate speech or profanity. Then they were exposed to a post from a moderator — either a human or an algorithm — that deleted the initial post because it was offensive. This message either explained specifically why the post was deleted, gave a general sense of why it was deleted with a clickable link to community guidelines for the site, or offered no explanation. Afterward, participants answered questions about how fair or legitimate the deletion was and how transparent or trustworthy the moderator was.\n  In all countries, survey participants thought that removing hate speech was more fair and legitimate than removing profanity, and found the moderators who did so and offered a detailed explanation of why to be more transparent. In the U.S. and the Netherlands, participants found moderators removing hate speech to be more trustworthy than those who removed profanity. While the method of removal — either by a human or an algorithm — did not impact how Americans and Dutch people felt about content removal, in Portugal, “participants perceived deletions by human moderators as more fair and legitimate compared to deletions by algorithms.”\n  Moderators should focus more on hate speech, because people see hate speech as more in need of deletion than profanity.\n  Algorithmic moderators may be perceived equally to human moderators, although specific cultural contexts should be considered because this may not be the case in every country.", "posttime": "2021-06-20 12:31:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,仇恨,speech,删除", "title": "调查：社交媒体用户看到仇恨言论的删除，比消除亵渎更具公平，他们将讨论仇恨的主持人视为更值得信赖 ", "title_en": "Survey: social media users see the removal of hate speech as more fair than removing profanity, with moderators who removed hate speech seen as more trustworthy", "transed": 1, "url": "https://www.niemanlab.org/2021/06/comment-moderators-should-focus-more-on-hate-speech-than-profanity-a-new-study-suggests/", "via": "", "real_tags": ["rust", "仇恨", "speech", "删除"]}, {"category": "", "categoryclass": "", "imagename": "20045e6910b397b737151b247891ced2.jpg", "infoid": 1066982, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在费城郊区袭击了毒贩的联邦代理人发现大麻，并令他们惊讶的是，在鱼缸下方的秘密舱内藏的现金250万美元。\n 但是，在墙壁上发现这么多艺术 -  14张艺术，他们甚至更加惊讶地发现这么多的艺术品 -  14张山上堆放在距离经销商之家，罗纳德贝西亚诺几英里的储物单元。艺术家包括Renoir，Picasso和SalvadorDalí。\n “这跳了在我们身边，”家乡安全调查费城的特别代理人Brian A. Michael说。 “这件艺术品的数量不是你在每次调查中都遇到的东西。”\n  事实证明，Belciano先生使用艺术来洗涤他的一些药物现金，从费城博物馆行附近的成熟画廊购买了作品。\n 2015年，他通过利用艺术市场之一的签名特征 - 它的透明度，他被判处了超过五年的监禁，以便打击毒品，并洗钱非法所得款项。\n 数十亿美元的艺术每年都会改变双手，几乎没有公众审查。买家通常不知道他们正在购买的工作来源。卖家在黑暗中类似于工作的地方。没有任何购买要求提交文件的文书工作，使监管机构能够轻松跟踪艺术销售或利润，从政府可以审查其他大量资产的转移，如股票或房地产的方式不同的差异。\n 但是，担心贝尔西诺案件的当局不再是奇怪的，而是一种有用的艺术如何成为洗钱者的工具的寓言，正在考虑提高市场的监督并使其更加透明。 \n1月，国会扩大联邦反洗钱法规，旨在管理银行业，古物经销商。立法要求财政部加入其他机构，研究更长的规定是否应对更广泛的艺术市场施加。美国努力遵循欧洲最近通过的法律，经销商和拍卖房屋现在必须确定客户的身份并检查其财富的来源。\n “秘密，匿名和缺乏规定创造了一个令人犯着钱和逃避制裁的环境成熟，”美国参议院的常任条例在去年7月的一份报告中表示，支持增加审查。\n  到艺术世界退伍军人，他们以自行决定，传统和班级宣传匿名，而不是重复，这一围攻是一个过度反应，将损害市场。当他们说滥用的证据时，他们担心疏远别人探讨的问题。\n “我们处于偏执狂的阶段，即美国艺术经销商协会的总裁Andrew Schoelkopf在今年的一个行业小组中表示。 “这将是一大堆文书工作，很多合规性，我认为我们不会灭亡大部分问题。”\n 他们的担忧足够大，以至于经销商协会和主要拍卖房屋的游说者一直在华盛顿塑造了对此和其他监管措施的不断变化的政策。自2019年以来，克里斯蒂，苏富比和经销商协会的游说法案已接近100万美元。\n 尽管如此，艺术市场尚无质疑，在创建海关时，艺术市场的价值和范围。绘画常规地销售1000万美元，2000万美元，往往和他们挂起的五屋一样多。虽然艺术销售的利润受到奢侈品的强劲资本增长税，但追踪谁是追踪谁准确报告意外收获的能力是一种斗争。甚至讨论谁卖掉了什么是障碍。购买的一半是私人的，而不是在公开拍卖，所以许多价格从未成为公众。\n 最近的研究预计最富有的美国人逃税，导致拜登总统提高审计计划。虽然没有涉及艺术的广泛作弊的证据，但专家表示，这是明确的市场保密，为执法制度创造脆弱性，这很少探讨审计并严重依赖于收藏家的意愿，以使他们的利润普通。 \n“唯一知道的人，”Tulane Law School教授Khrista Mccarden曾专注于税法，“你是艺术画廊和上帝。”\n  艺术界的秘密有时会在圣巴特的伊甸园岩饭店等地方腾出，2014年午餐俯瞰着圣让湾的绿松石水域，俄罗斯亿万富翁德米特里E. Rybolovlev，收藏家们，被介绍了纽约艺术顾问沙迪海尔。当然，谈话转向艺术和金钱。\n  Rybolovlev先生从一个未知的卖家裸体支付了11800万美元的Modigliani裸体。 Heller先生证实，卖方是他的客户，对冲基金经理Steven A. Cohen。但有些东西已经关闭了。科恩先生只收取了9350万美元的地狱Helder说。\n Rybolovlev先生使用了一位艺术顾问，Yves Bouvier，使其和许多其他购买，总额近20亿美元。事实证明，布维尔先生以一个价格购买了作品，并将他们的巨大标记翻转到他的客户。\n 布维尔先生表示，它总是清楚他作为一个独立卖方经营，他们可以以自己的方式购买艺术和转售。但在随后的法律战斗中，Rybolovlev先生不仅仅是他的前顾问，而是艺术世界本身。\n “如果市场更加透明，这些事情不会发生，”他说。\n  这种保密的起源是什么？专家表示，在第15世纪的第15世纪可能会达到最早的艺术市场的日期，当时圣卢克，专业贸易组织，开始规范欧洲的艺术生产和销售。在此之前，艺术并非如此被贵族或职员委员会委托出售。但作为一个商家阶级的扩大，艺术市场所以，从讲习班和城市等城市的公共摊位经营，如安特卫普等。为了遏制竞争对手，隐瞒一个人的身份是有意义的，所以他们不能被盗，或者保持他们收取一个客户的秘密，以便他们可以向另一个客户收取不同的价格，激励今天坚持的信息。 \n市场的秘密不如曾经的秘密。例如，拍卖房屋今天发布了他们希望艺术品的价格估计。但是，它仍然是不透明的，这对一个世界的神秘和浪漫的浪漫带来了一个空气，其中价值和利润可以依赖于作为关于天才的短暂共识。\n 拍卖目录说作品来自“私人收藏”，往往是更多的。绘画有时是由业主的代表带到市场，其身份未知，甚至到安排销售，专家和官员的画廊说。购买者也使用代理人。例如，当Rybolovlev先生将Leonardo da Vinci的“Salvator Mundi”销售给沙特阿拉伯的皇冠萨尔曼·穆罕默德·萨尔曼时，它是由王子的朋友买的，这掩盖了谁购物。\n 在这种情况下，画廊依赖于代理商的完整性，他们有长期的事业。有时买家和卖家根本不是个人，而是贝壳公司，不透明的投资结构经常旨在隐瞒身份。\n “很少有人购买500万张绘画作为一个人，因为他们不会那样买其他方式，”纽约艺术家Cristin Tierney说。\n 一旦购买了许多工作，其中很多，包括世界上一些最具表现力和昂贵的，最终隐藏在海绵体，不符合税收庇护的免费港口，他们的下落很大程度上都未知。\n “艺术界的各种欺诈是几乎无限的，这是艺术界在圣地亚哥大学教授的赫伯特·莱撒洛（San Diego大学教授）表示，这是无穷无尽的。”法学院。\n  现在联邦政府正在考虑使用旨在打击金融机构洗钱的法律，以进一步规范艺术市场。法律，银行保密法，要求银行报告超过10,000美元的现金交易，突出可疑活动，了解客户的身份以及他们的财富来自何处。 \n国会已经授权财政部官员定制法规，以适应古物市场，这长期以来一直受到叙利亚和伊拉克等国家贩运的非法文物的担忧。现在，古代珍宝像罗马大理石雕像或埃及救济的经销商将被视为金融机构，联邦监管机构将研究限制是否应扩展到更广泛的艺术市场。\n 古物经销商担心遵守所谓的AML（反洗钱）法规的成本。他们说他们已经知道他们的客户足以知道他们没有非法活动。\n 纽约古代经销商Randall Hixenbaugh抱怨说，小型企业将被迫聘请合规官员。 “我甚至不能在这种可怕的经济气氛中雇用全职助理，”他在一封电子邮件中说。\n  如果新的狭窄延伸到更广泛的艺术市场，法律可能需要经销商和拍卖房屋，以确定实际业主是谁，甚至刺穿了壳牌公司的面纱。\n 克里斯蒂表示，它“欢迎有机会与美国监管机构合作，并在适当和可执行的”指导方针上。苏富比表示，它“拥有长期以来的尽职调查程序，并将遵守所有适用的法律法规。”\n 拍卖房屋已经回复了欧洲的变化，也在美国更加彻底审查了美国的客户。克里斯蒂的卖家在纽约拍卖中表示必须充分披露他们的身份。对于买家来说，它表示，当有任何风险建议时，它会核实任何代理人的身份，并努力确定资金来源。\n 但去年，参议院调查人员发现了艺术市场现已到位的政策中的差距。拍卖房屋和经销商被引用允许两个俄罗斯寡头，靠近弗拉基米尔·普京总统普京，制裁，使用艺术顾问前面的壳牌公司购买和销售艺术品。小组委员会得出结论认为，拍卖房屋在2011年和2019年之间交易中，并没有确定现实主人尽管自称是否采取了保障措施。 \n参议员Rob Portman，俄亥俄州共和党和报告的赞助商表示，“艺术行业不能信任自我警察。”\n 虽然拍卖房屋宣称具有强大的反洗钱计划，但我们发现促进交易的实际员工从未询问艺术中介是谁购买的绘画或者在何处，他在一份声明中说。\n 即使采用了更严格的规则，买家和卖家的名称也不会成为公众。但经销商和拍卖房屋需要确定他们在执法询问时正在处理谁。\n  洗钱涉及艺术多少钱？似乎没有人量化它，虽然很多专家都同意艺术市场是它蓬勃发展的自然场所。 “碎片是便携式的，周围有一个高水平的保密，谁拥有他们支付的东西和价值，并且在全球证人的研究员Nienke Palstra说，这是在某种程度上辩护的。\n 尽管如此，所取得的起诉人数不会自行建议问题是普遍存在的问题。\n 在一个典型的案例中，有人使用非法利润来购买艺术，在那里停车，直到稍后的销售导致“清洁”金钱，具有合法的血统。一个着名的案例涉及金融家jho低位，世界卫生组织波尔维尔·奥尔（PROVEROUNS）说，从聘请银行账户和壳牌公司网络的马来西亚政府基金中帮助了数十亿美元。然后，他洗了钱，检察官通过消费狂欢对艺术等事情说。 2014年，他拥有的开曼岛公司从苏富比的贷款中获得了1.07亿美元的贷款，使用了一些艺术作为抵押品。 （Low先生否认任何不法行为，仍然大。）\n  苏富比的和克里斯蒂说，一旦他们知道，他们就会停止与他做生意。他们没有被指控不法行为。 \n有些专家表示，如果需要报告可疑活动，那么，如果需要报告可疑活动，那么强行努力就会过于缺乏缺乏症状的人无法染味，并且如果需要经销商和拍卖房屋，则会变得明显。\n “你不知道你不知道的是什么，”前美国检察官彼得D. Hardy说。\n 收藏家的顾问表示，他们也不认为艺术交易的不透明性导致了对资本收益报告的重大作弊，尽管经销商没有义务向政府提供独立报告销售。\n “收藏家是突出的社区突出的商界人士，”纽约艺术管理和投资公司的校长迈克尔·普拉姆说，并通过复杂的税务和法律专业人士的建议，储蓄税收不报告资本收益和犯罪直接税务欺诈只是对他们的其他业务和社会利益的风险不值得。“\n 在人们未能从艺术销售中报告利润的情况下，一些顾问认为银行系统能够销售逃税。但其他专家表示，我的队伍其他监管机构太薄，无法跟进每年有数百万人的银行警报。\n “他们得到了这么多的报道，他们不可能跟进所有这些报道，”朱莉A.山是一座阿拉巴马州法学院教授大学的朱莉A.山。\n  他被捕四个月后，罗纳德贝西亚诺返回了I. Brewster＆amp; Co.，Childelphia画廊在哪里，调查人员说，他买了他习惯于洗钱的艺术。 \n但他不是在那里为自己购物。相反，根据法院记录，他介绍了他向丽莎介绍了Lisa的Gally Owner，Nathan Isen，他被确定为一个有许多现金的毒贩，根据法院记录。\n  “就像，我愿意像这样投入这样的投资，但我不知道，”根据他们的谈话的成绩单，她说。 “我不知道如何出售这一点。汽车，其他我可以摆脱容易的东西。就像这样我很紧张。“\n “它与销售汽车不同，”他说，“因为汽车必须有登记，标题和这一切以及一切。 ......这些都没有。 ......这些可能是，这些可能是你的祖母。你跟着我？”\n “所以我可以说，'嘿，这是我继承的东西，而不是我买的'”丽莎问道。\n “正确的。 “我发现它在一个旧货店，他们是10美元的一块，”伊森先生回答道。\n 伊森先生未被指控在贝尔西亚诺的案例中被告人，并且已经否认了贝尔西诺先生正在利用艺术来解放金钱，但由于他与丽莎的谈话，谁是戴着电线的卧底特工，他稍后会在2015年收取洗钱和辩护书。他被判处320小时的社区服务，并获得了15,000美元的罚款。\n 在他们的第一次谈话之后一周，丽莎回到了伊森的画廊先生，以20,000美元购买12个萨尔瓦多达利石刻。她的棕色纸袋里有现金。它闻到了毒品，她告诉杂志，因为她把它与她的大麻藏匿处。 \n根据法院论文，他告诉她，她没有为她的购买发票。  “没有发票？ 酷，“她回答道。 “没有收据，没有发票，我很好。 这就是我喜欢做生意的方式。“ ", "note_en": "The federal agents who raided a drug dealer’s house in a suburb of Philadelphia found marijuana and, to their surprise, $2.5 million in cash stashed in a secret compartment beneath a fish tank.\n But they were even more surprised to discover so much art — 14 paintings on the walls and another 33 stacked in a storage unit a few miles away from the home of the dealer, Ronald Belciano. The artists included Renoir, Picasso and Salvador Dalí.\n “That jumped out at us,” said Brian A. Michael, special agent in charge for Homeland Security Investigations Philadelphia. “That amount of artwork was not something you come across in every investigation.”\n  It turned out, Mr. Belciano used the art to launder some of his drug cash, purchasing the works from an established gallery near Philadelphia’s Museum Row.\n In 2015, he was  sentenced to more than five years in prison for dealing drugs and for laundering the illicit proceeds by taking advantage of one of the art market’s signature features — its opacity.\n Billions of dollars of art changes hands every year with little or no public scrutiny. Buyers typically have no idea where the work they are purchasing is coming from. Sellers are similarly in the dark about where a work is going. And none of the purchasing requires the filing of paperwork that would allow regulators to easily track art sales or profits, a distinct difference from the way the government can review the transfer of other substantial assets, like stocks or real estate.\n But now authorities who fear the Belciano case is no longer an oddity, but a parable of how useful art has become as a tool for money launderers, are considering boosting oversight of the market and making it more transparent.\n In January,  Congress extended federal anti-money laundering regulations, designed to govern the banking industry, to antiquities dealers. The legislation required the Department of the Treasury to join with other agencies to study whether the stricter regulations should be imposed on the  wider art market as well. The U.S. effort follows laws recently  adopted in Europe, where dealers and auction houses must now determine the identity of their clients and check the source of their wealth.\n “Secrecy, anonymity and a lack of regulation create an environment ripe for laundering money and evading sanctions,” the U.S. Senate’s Permanent Subcommittee on Investigations said  in a report last July in support of increased scrutiny.\n  To art world veterans, who associate anonymity with discretion, tradition and class, not duplicity, this siege on secrecy is an overreaction that will damage the market. They worry about alienating customers with probing questions when they say there is scant evidence of abuse.\n “We are in the paranoid-terrified phase of what’s going to come down the pike,” Andrew Schoelkopf, then the president of the Art Dealers Association of America, said at  an industry panel this year. “It’s going to be a whole lot of paperwork and a whole lot of compliance and I don’t think we will extinguish much of a problem.”\n Their concerns are great enough that lobbyists for the dealers’ association and major auction houses have been trying in Washington to shape the evolving policy on this and other regulatory measures. Since 2019, the lobbying bill for Christie’s, Sotheby’s and the dealers’ association has approached $1 million.\n Still, there is no question the art market has exploded in value and scope from the sleepy days when its customs were created. Paintings routinely sell for $10 million, $20 million, often as much as the penthouses in which they hang. Though the profits from art sales are subject to the robust capital gains tax on luxury goods of 28 percent, the I.R.S.’s ability to track who is accurately reporting windfalls is something of a struggle. Even figuring out who sold what is a hurdle. Half the purchases are in private, not at public auction, so many prices never become public.\n Recent  studies have projected substantial tax evasion by the richest Americans, which led to President Biden’s  plan to boost audits. While there is no evidence of widespread cheating involving art, experts say it’s clear the secrecy of the market creates vulnerabilities for an enforcement system that rarely conducts audits and relies heavily on the willingness of collectors to make plain their profits.\n “The only ones who know,” said Khrista McCarden, a professor at Tulane Law School who specializes in the tax code, “are you, the art gallery and God.”\n  The secrets of the art world sometimes tumble out at places like the Eden Rock hotel on St. Barts, where in a lunch in 2014 overlooking the turquoise waters of St. Jean Bay, the Russian billionaire Dmitry E. Rybolovlev, a collector, was introduced to Sandy Heller, a New York art adviser. Naturally, the conversation turned to art, and money.\n  Mr. Rybolovlev had paid $118 million for a Modigliani nude from an unknown seller. Mr. Heller confirmed that the seller had been his client, the hedge fund manager Steven A. Cohen. But something was off. Mr. Cohen had charged only $93.5 million, Heller said.\n Mr. Rybolovlev had used an art adviser, Yves Bouvier, to make that and many other purchases, totaling nearly $2 billion. It turned out Mr. Bouvier was buying the works at one price and flipping them at huge markups to his client.\n Mr. Bouvier has said it was always clear he was operating as an independent seller who could buy the art and resell on his own terms. But  in the legal battle that has ensued, Mr. Rybolovlev has castigated not only his former adviser, but the art world itself.\n “If the market were more transparent, these things wouldn’t happen,” he said.\n  What is the origin of such secrecy? Experts say it likely dates to the earliest days of the art market in the 15th and 16th centuries when the Guilds of St. Luke, professional trade organizations, began to regulate the production and sale of art in Europe. Until then, art was not so much sold as commissioned by aristocratic or clerical patrons. But as a merchant class expanded, so did an art market, operating from workshops and public stalls in cities like Antwerp. To thwart competitors, it made sense to conceal the identity of one’s clients so they could not be stolen, or to keep secret what they charged one customer so they could charge another client a different price, incentives to guard information that persist today.\n  The market is less secretive than it once was. Auction houses, for example, today publish estimates of prices they expect artworks to achieve. But so much about it remains opaque, which lends an air of mystery and romance to a world where values and profits can rely on something as capricious as a fleeting consensus on genius.\n Auction catalogs say works are from “a private collection,” often nothing more. Paintings are at times brought to market by representatives of owners whose identities are unknown, even to the galleries arranging the sale, experts  and officials say. Purchasers use surrogates, too. When Mr. Rybolovlev sold Leonardo da Vinci’s “Salvator Mundi” to Crown Prince Mohammed bin Salman of Saudi Arabia, for example, it was bought by a friend of the prince, which obscured who was shopping.\n In these circumstances, the galleries rely on the integrity of the agents, with whom they have long done business. Sometimes the buyers and sellers are not individuals at all, but shell companies, opaque investment structures often designed to conceal identity.\n “Very rarely is anybody buying a $5 million painting as a person because they don’t buy anything else that way,” said Cristin Tierney, a New York gallerist.\n And once works are purchased, many of them, including some of the world’s most expressive and expensive, end up  hidden away in cavernous, nondescript, tax-sheltered free ports, their whereabouts largely unknown.\n “The variety of frauds in the art world is almost infinite and that is facilitated by the fact that the art world operates with a secrecy that no other investor would dream of operating in,” said Herbert Lazerow, a professor at the University of San Diego School of Law.\n  Now the federal government is considering using a law designed to combat money laundering at financial institutions to further regulate the art market. The law, the  Bank Secrecy Act, requires banks to report cash transactions of more than $10,000, highlight suspicious activity and understand the identity of their customers and where their wealth comes from.\n Congress has  already authorized Treasury officials to tailor the regulations to fit the antiquities market, which has long been burdened by worries about illicit artifacts trafficked from countries like Syria and Iraq. Now dealers of ancient treasures like Roman marble statues or Egyptian reliefs will be treated like financial institutions, and federal regulators will study whether the restrictions should be extended to the broader art market.\n Antiquities dealers are concerned about the cost of complying with the so-called AML (anti-money laundering) regulations. They say they already know their customers well enough to know they are not engaged in illicit activities.\n Randall Hixenbaugh, a New York antiquities dealer, complained that small businesses would be forced to hire compliance officers. “I can’t even afford to hire a full-time assistant in this horrible economic climate,” he said in an email.\n  If the new strictures are extended to the much broader art market, dealers and auction houses would likely be required by law to determine who the actual owners are, even pierce the veils of shell companies.\n Christie’s said it “welcomes the opportunity to work with U.S. regulators on appropriate and enforceable” guidelines. Sotheby’s said it “has long-established due diligence procedures and will comply with all applicable laws and regulations.”\n Auction houses have already responded to the changes in Europe with more thorough vetting of their customers in the United States, too. Christie’s says sellers at its New York auctions must fully disclose their identity. For buyers, it says it verifies the identity of any agent and works to identify the sources of funds when there is any suggestion of risk.\n But last year, Senate investigators found gaps in the policies the art market now has in place. Auction houses and dealers  were cited for having allowed two Russian oligarchs, close to President Vladimir V. Putin and under sanctions, to buy and sell art using shell companies fronted by an art adviser. The subcommittee concluded that the auction houses, in transactions between 2011 and 2019, did not determine who the real owners were despite professing to have adopted safeguards.\n Senator Rob Portman, an Ohio Republican and a sponsor of the report, said  “the art industry cannot be trusted to self-police.”\n “While the auction houses claimed to have robust anti-money laundering programs, we found that the actual employees who facilitated the transactions never asked who the art intermediary was buying the painting for or where the money was coming from,” he said in a statement.\n Even if the tighter rules were adopted, the names of buyers and sellers would not become public. But dealers and auction houses would need to determine who they are dealing with in case of law enforcement inquiry.\n  How much money laundering involves art? No one seems to have quantified it, though many experts agree the art market is  a natural place for it to flourish. “Pieces are portable, there is a high level of secrecy around who owns what and the value that they’re paying, and it’s debatable in some ways,” said Nienke Palstra, a researcher at Global Witness.\n Still, the number of prosecutions that have been made would not, by itself, suggest the problem is ubiquitous.\n In a typical case, someone uses illicit profits to purchase art, parking the money there until a later sale results in “clean” money with a legitimate pedigree. A famous case concerns the financier Jho Low, who  prosecutors say helped siphon billions of dollars from a Malaysian government fund employing a network of bank accounts and shell companies. He then laundered the money, prosecutors say, via a spending spree on things like art. In 2014, a Cayman Island company he owned received a $107 million  loan from Sotheby’s using some of the art as collateral. (Mr. Low denied any wrongdoing and remains at large.)\n  Sotheby’s and Christie’s said they stopped doing business with him once they knew he was under investigation. They were not accused of wrongdoing.\n Some experts say enforcement efforts have simply been too anemic to detect laundering, and that the size of the problem will become apparent if dealers and auction houses are required to report suspicious activities.\n “You don’t know what you don’t know,” said Peter D. Hardy, a former U.S. prosecutor.\n Advisers to collectors say they also do not believe that the opacity of art transactions has led to major cheating on the reporting of capital gains, even though dealers have no obligation to provide independent reporting of sales to the government.\n “Collectors are savvy business people of prominent standing in their communities,” said Michael Plummer, principal at an art management and investment firm in New York, “and advised by sophisticated tax and legal professionals — saving tax dollars by not reporting capital gains and committing outright tax fraud is just not worth the risk to their other business and social interests.”\n In cases where people fail to report the profits from art sales, some advisers think the banking system is able to flag possible tax evasion. But other experts said the ranks of I.R.S. and other regulators were too thin to follow up on the millions of banking alerts that come in each year.\n “They get so many reports, they could not possibly follow up on all of them,” said Julie A. Hill, a University of Alabama School of Law professor.\n  Four months after his arrest, Ronald Belciano returned to I. Brewster &amp; Co., the Philadelphia gallery where, investigators said, he had bought the art he used to launder money.\n But he was not there to shop for himself. Instead, he introduced the gallery owner, Nathan Isen, to Lisa, who he identified as a drug dealer with lots of cash to spend on art, according to court records.\n  “Like, I’m willing to invest in stuff like this, but this I don’t know,” she said, according to a transcript of their conversation. “I don’t know how to sell this. Cars, other things I can get rid of easy. Like this I’m nervous about.”\n “It’s different than selling a car,” he said, “’cause car has to have the registration, the title, and this and that and everything. … These are nothing. … These could have been, these could have been your grandmother’s. You follow me?”\n “So I can say, ‘hey, this is stuff that I inherited not that I bought,’” Lisa asked.\n “Right. ‘I found it at a thrift store, they were $10 a piece,’” Mr. Isen replied.\n Mr. Isen had not been accused of wrongdoing in Belciano’s case and has denied knowing Mr. Belciano was using the art to launder money, but as a result of his conversations with Lisa, who was an undercover agent wearing a wire, he would later be charged with money laundering and plead guilty in 2015. He was sentenced to 320 hours of community service and received a $15,000 fine.\n A week after their first conversation, Lisa returned to Mr. Isen’s gallery to buy 12 Salvador Dalí lithographs for $20,000. She had the cash in a brown paper bag. It smelled of drugs, she told the gallerist, because she kept it with her marijuana stash.\n He told her she was not getting an invoice for her purchases, according to the court papers.\n “No invoices? Cool,” she replied. “No receipt, no invoice, I’m good with that. That’s the way I like to do business.”", "posttime": "2021-06-20 12:30:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,美国,购买,launderers", "title": "因为洗钱者购买Dalís，美国看着艺术销售面纱 ", "title_en": "As Money Launderers Buy Dalís, U.S. Looks at Lifting the Veil on Art Sales", "transed": 1, "url": "https://www.nytimes.com/2021/06/19/arts/design/money-laundering-art-market.html", "via": "", "real_tags": ["艺术", "美国", "购买"]}, {"category": "", "categoryclass": "", "imagename": "de1f3593eda68ac27964434658234910.png", "infoid": 1066981, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Hardware里面是控制器的PCB文件，基于ESP32，搭载MPU6050，通过CAN总线连接驱动器。\n Structure里面是车身结构设计文件，step是Fusion导出的可能有些BUG，建议直接下载这个Fusion360的工程在软件里打开： https://a360.co/2TOtZRd\n 软件部分由于涉及到FOC驱动器的耦合并不是通用的所以暂时未放出，不过我后面会开源一个包括源码的迷你简化版的自行车完整方案（使用小型直流电机），大家可以等待一阵子。\n 另外，我正在整理一个机器人嵌入式开发框架（REF），会统一抽象出机器人开发中常用的一些工具和开发模式，到时候也会单独更新一个仓库。\n 修改仓库属性不小心把star都弄没了哭...各位同学劳烦再小手点一下星星~ 😘 ", "note_en": "Hardware里面是控制器的PCB文件，基于ESP32，搭载MPU6050，通过CAN总线连接驱动器。\n Structure里面是车身结构设计文件，step是Fusion导出的可能有些BUG，建议直接下载这个Fusion360的工程在软件里打开： https://a360.co/2TOtZRd\n 软件部分由于涉及到FOC驱动器的耦合并不是通用的所以暂时未放出，不过我后面会开源一个包括源码的迷你简化版的自行车完整方案（使用小型直流电机），大家可以等待一阵子。\n 另外，我正在整理一个机器人嵌入式开发框架（REF），会统一抽象出机器人开发中常用的一些工具和开发模式，到时候也会单独更新一个仓库。\n 修改仓库属性不小心把star都弄没了哭...各位同学劳烦再小手点一下星星~ 😘", "posttime": "2021-06-20 12:30:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "衣着,bike,开发", "title": "玄自行车：自行骑行，无衣着自行车 ", "title_en": "XUAN-Bike: Self-riding, riderless bike", "transed": 1, "url": "https://github.com/peng-zhihui/XUAN-Bike", "via": "", "real_tags": ["衣着", "bike", "开发"]}, {"category": "", "categoryclass": "", "imagename": "bf229992a8e56d06320e7bb8cae1d9d0.jpg", "infoid": 1066980, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德州是通过记录破碎热波遭受的几个州之一，这将电网推向它们的极限。德克萨斯州的电力可靠性委员会或埃尔思，敦促居民通过提高恒温器的温度，但是几个智能恒温器所有者表示他们的设备被远程控制以节省能量，让他们在没有线索的情况下离开他们为什么。\n  事实证明，其中一些只是没有读完细版。根据当地ABC-联盟WFAA的报告，休斯顿地区的几名居民在不知不觉中注册了一个名为“智能救护者德克萨斯州”的计划，作为促销的一部分，根据本地ABC-联盟WFAA在周五。该协议指出，为了进入抽奖活动，电信客户在高能源需求期间控制其恒温器的允许控制其恒温器。\n Brandon English，其中一个居民WFAA谈到了，他说他周三从上班抵达回家，发现他的智慧恒温器的温度已经抬起，而他的妻子和刚出生的女儿勒佩。\n    “他们已经睡得足够了，这房子已经达到了78度，”英语说。 “所以他们醒来出汗。”\n  他发现他发现并表示关注远程温度调整如何影响他的家庭健康的人，他从该计划中取消了。\n   “我的女儿在过热的点吗？”英语告诉WFAA。 “她3个月了。他们很快就脱水。“\n EnergyHub的网站表示，它与包括谷歌和亚马逊在内的几个恒温器提供商合作，其客户列表包括国家网格，中心点能量和埃尔科等主要能源公司。 \n在节能期间，该程序“将参与恒温器的温度提高了多达4度，以减少电网的能量消耗并减轻压力，”Energyhub的客户解决方案副总裁Erika Diamond表示，在电子邮件对Gizmodo的电子邮件陈述中周六。她补充说，客户通常会收到从他们的能源提供者或其恒温器制造商加入该计划的要约，并可以随时选择选择。平均而言，这些节能事件每年夏天发生在两到八次之间，钻石今天告诉美国。\n 在基于休斯顿的NBC联盟KPRC 2的声明中，中心点能源表示，它于6月16日从下午2点进行“测试缩减事件”。到下午5点，并通知Energyhub，以减少其住宅客户的能源消耗，同意参加智能救护者德克萨斯州计划。一旦收到通知，EnergyHub调整了恒温器以进行参与客户。\n   “智能储蓄者Texas通过使用恒温器制造商和安全经销商合作伙伴来注册连接的恒温器所有者来帮助支持电网可靠性，以便在电网最需要它时参与能量使用。\n 恒温器所有者通常会收到从他们的移动应用程序或通过电子邮件中的制造商或服务提供商参与的要约。在需求响应事件期间，智能保护员德州将参与恒温器的温度提高到4度，以降低能耗并减轻电网上的压力。每个参与者都积极同意该计划的条款，并随时选择退出需求响应事件。\n  在德克萨斯州和全国范围内，减少能源消耗的能力对于管理网格至关重要。 EnergyHub在全国各地的50多家使用超过50个实用程序来利用连接的设备来满足网格需求。这是一种可靠地减少通过EnergyHub和我们连接的恒温器合作伙伴的技术对网格上的负载的工具。“\n         换句话说，德克萨斯州的消费者太愚蠢了阅读他们正在签名的合同。 ", "note_en": "Texas is one of   several states suffering through a record-breaking heat wave that’s pushing electric grids to their limits. The Electric Reliability Council of Texas, or ERCOT, has   urged residents to do their part by raising the temperature on their thermostats, but several smart thermostats owners say their devices have been controlled remotely to conserve energy, leaving them in sweltering homes without a clue as to why.\n  Turns out, some of them just didn’t read the fine print. Several residents in the Houston area said they’d unknowingly enrolled in a program called “Smart Savers Texas” as part of a promotion, according to a report from local ABC-affiliate   WFAA on Friday. The agreement states that in exchange for an entry into sweepstakes, electric customers grant permission for the program’s operator, EnergyHub, to control their thermostats during periods of high energy demand.\n Brandon English, one of the residents WFAA spoke with, said he arrived home from work on Wednesday to find the temperature on his smart thermostat had been jacked up while his wife and newborn daughter napped.\n    “They’d been asleep long enough that the house had already gotten to 78 degrees,” English said. “So they woke up sweating.”\n  He unenrolled from the program as soon as he found out and expressed concern about how the remote temperature adjustment could affect his family’s health.\n   “Was my daughter at the point of overheating?” English told WFAA. “She’s 3 months old. They dehydrate very quickly.”\n EnergyHub’s website says it’s partnered with several thermostat providers, including   Google and Amazon, and its   list of clients includes major energy companies such as National Grid, CenterPoint Energy, and ERCOT.\n  During energy saving events, the program “increases the temperature on participating thermostats by up to four degrees to reduce energy consumption and relieve stress on the grid,” said Erika Diamond, vice president of customer solutions at EnergyHub, in an emailed statement to Gizmodo on Saturday. She added that customers will typically receive an offer to join the program from their energy provider or the manufacturer of their thermostat and can opt-out at any time. On average, these energy saving events occur between two to eight times each summer, Diamond told   USA Today.\n In a statement to Houston-based NBC affiliate   KPRC 2, CenterPoint Energy said it conducted a “test curtailment event” on June 16 from 2 p.m. to 5 p.m., and notified EnergyHub to reduce energy consumption for their residential customers that agreed to participate in the Smart Savers Texas program. Once it received the notification, EnergyHub adjusted the thermostats for participating customers.\n   “Smart Savers Texas helps support grid reliability by working with thermostat manufacturer and security dealer partners to sign up connected thermostat owners to participate in reducing energy use when the grid needs it most.\n Thermostat owners typically receive an offer to participate from their manufacturer or service provider within their mobile app or via email. During a demand response event, Smart Savers Texas increases the temperature on participating thermostats by up to four degrees to reduce energy consumption and relieve stress on the grid. Every participant actively agrees to the terms of the program and can opt-out of a demand response event at any time.\n  The ability to reduce energy consumption is critical to managing the grid, in Texas and nationwide. EnergyHub works with more than 50 utilities across the country to harness connected devices to meet grid needs. This is a tool to reliably reduce load on the grid enabled through the technology of EnergyHub and our connected thermostat partners.”\n         In other words, Texas consumers too stupid to read the contracts they’re signing.", "posttime": "2021-06-20 12:29:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电力公司,power,恒温器", "title": "德克萨斯州电力公司正在居民的智能恒温器上远程提高临时 ", "title_en": "Texas Power Companies Are Remotely Raising Temps on Residents' Smart Thermostats", "transed": 1, "url": "https://gizmodo.com/texas-power-companies-are-remotely-raising-temperatures-1847136110", "via": "", "real_tags": ["电力公司", "power", "恒温器"]}, {"category": "", "categoryclass": "", "imagename": "28ac4f3a7e6550a5ffe82d9ed8068891.jpg", "infoid": 1066979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "出于某种原因，不止一位哈佛教授使新闻成为克里威尔人的简便。担任法律教授在四年内，发现自己被吸引到一个欺诈和虚假指责的网络中，直到他终于没有工作，无家可归者，并且在法律费用中占用了300,000美元来保护自己。\n 在另一个案例中，一名哈佛大学科学家在癌症研究中工作无情地致力于他自己的信任朋友和同事，其中一些人失去了他们的房屋和储蓄，超过600,000美元。他迅速但天真地派了一切到尼日利亚诈骗者，他们答应了他一个酷的5000万美元回报。被捕后，他仍然无法承认在愚弄周围的人之后被愚弄自己。\n   如果条件是正确的，它仍然可以展示即使是最聪明的人仍然可以像我们其余的那样容易忍受或贪婪。\n 研究人员往往思考了如何以及为什么某些人为诈骗的人，特别是对他人来说似乎如此明显的心理。诈骗者针对某些人的特征，包括可以很容易地利用的脆弱性，例如Naiveté，过度利用，在一个人的智力或能力中过度自信，对生活立即取得成功的过度乐观，或者对帮助他人感到愉快的愿望。随着互联网的沟通变得更加复杂，所以骗局所以。许多人仍然落在它，因为骗子艺术家继续瞄准企业以及个人。\n 然而，在您甚至与神秘的尼日利亚王子达到个人互动的水平之前，这次短暂的语言学家Deborah Schaffer可以为您提供4-1-9的关于如何在首次进入时识别骗局电子邮件的语言模式你的收件箱并在讨人喜欢的话，如果被打破，华而无人的语言。\n    尼日利亚419缺点（该号码是指尼日利亚刑法的欺诈部分）实际上是互联网上最古老的骗局。他们实际上可以追溯到20世纪20年代，以良好称为西班牙囚犯的信心技巧的形式。被要求越来越多的受害者越来越多的资金来释放你所尊重的外国记者（自然不存在的人），在西班牙残酷被监禁，以换取大量奖励（从未来过）。\n 在更新的419尼日利亚骗局中，要求潜在的标记支付小额预付款费用，或者要求发送他们的银行信息或个人详细信息，以帮助移动已被锁定的资金，也许在外国，或者某个地方困难。作为回报，他们承诺了一个更大的基金回报。由于故事来说，也许它来自一位政府官员的流亡王子的金库，或者垂死的慈善家急于留下他或她的财富，在值得的电子邮件收件人上。 \n虽然Schafer发现了她的419封电子邮件的一半起源于尼日利亚，其余的是来自其他地方，通常是其他非洲和中东国家。真正有趣的是如何在这些配置中使用语言。这些故事是彼此多彩的变化，但用于告诉他们的语言是捕捉潜在标记（贪婪）想象力，缓解他们的恐惧，并建立持续受害者和僵局之间的关系的关键。\n 众所周知，大多数电子邮件由英语的非扬声器组成，从许多语法和标点错误，破碎的语法，缺失的单词和恶毒人士（“将立面达到其实际结论的意愿”中，这是明确的“追求夏洛”）。有了这么多错误，这门语言怎么欺骗任何人？通常，受害者知道该消息来自非扬声器，或者他们可能是非正式的英语扬声器本身，可能并不总是识别语法错误。这些是丑陋的语言警告标志，有助于删除大多数人的大多数人足以逃避陷阱并留下令人难以置信的故事留下兴趣的较小百分比。\n 尽管缺乏英语流畅性，但诈骗者似乎已阅读并吸收了最大的语言Derring故事。 419诈骗电子邮件充满了异常的佛罗里达语，意思是说服和哄骗读者咬住子弹并遵守，如开放问候（“赛季的赞美，我祈祷这封信就会迎接你”）和道歉（赦免这封信的突然;它是由于它的快速性“）。诈骗者使奉承的自由利用奉承（“您已经被副手向我保证了对您的能力和可靠性的信心和可靠性，以控制需要最大机密性的高净值的企业交易。”），宗教上诉援引上帝的希望寻找共同的地面，甚至保密和阴谋（“第一，我必须征求您对这笔交易的最严格的信心;这是其性质完全保密和最重要的秘密。”）。\n Schaffer还展示了419个诈骗者使用策略，例如将读者施加压力，现在为时已晚（迫切地回复我！“）并确保所提出的计划是相当安全的（”此交易是100％无风险“）而且巨大的价值和价值。诈骗者在笨拙的漫画中使用技术，军事，金融或其他专业语言进行了非凡的努力（“政府官员。。。。。。。。。。。。授予各部委和寄生虫在众多经发放的合同” ）为了保持作为律师，一般银行或银行官员的借口。\n  您可以通过点击任何营销信息的提供链接随时取消订阅。\n  这一切都以不切实际的，而且很有趣的叙述，许多普通人不熟悉，死亡百万富翁亲戚的生活，抵消了他们的运气，慈善家和王子，他们想要为他人做好事，令人痛苦的商业管理人员和石油Tycoons，所有人都失去了他们的方式，需要你的帮助。通过讲述这些高大的故事，并在同情上演奏同情，Grifters试图将他们的受害者侵入一个债券，使他们能够深入投入计划和尽可能长时间的结果。他们感到投入和忠诚的时间越长，他们就越越否认它是一个骗局。有时他们从来没有。\n 语言诈骗者用来留下深刻印象和奉承是如此明显和业余的，这似乎令人惊讶的是任何人都可以被带走。然而，许多普通人每年都会陷入陷阱。然而，这种语言令人惊讶的是，作为故事受害者的一部分往往是有说服力的，往往希望和想要真实。这是一个简单的骗局，但似乎有效，当它达到愿意忽视警告标志以寻找可以使一段时间内的生命的救生症来说，这一切都以悲伤结束。 \nJSTOR是学者，研究人员和学生的数字图书馆。 JSTOR日常读者可以在JSTOR上免费访问我们的文章背后的原始研究。  您可以通过点击任何营销信息的提供链接随时取消订阅。 ", "note_en": "For some reason, more than one Harvard professor has made the news for being the easy mark of grifters. Take  the law professor who, over the course of four years, found himself drawn into a web of fraud and false accusations, until he was finally out of a job, homeless, and out $300,000 in legal fees to defend himself.\n In another case,  a Harvard scientist working in cancer research heartlessly conned his own trusting friends and colleagues, some of whom lost their homes and savings, out of $600,000. He promptly, but naively, sent it all to Nigerian scammers, who had promised him a cool $50 million in return. After being arrested, he still could not admit to having been fooled himself after fooling so many of the people around him.\n   It just goes to show that even the smartest person can still be as gullible or as greedy as the rest of us, if the conditions are right.\n Researchers often have pondered  the psychology of how and why certain people fall for scams, especially ones that appear to be so obvious to others.  Scammers target certain human traits, including vulnerabilities that can be easily exploited, such as naiveté, overconfidence in one’s intelligence or abilities, an overly optimistic expectation of immediate success in life, or a desire to feel good about helping others. As communication on the internet has gotten more sophisticated,  so have the scams. Many still fall for it, as con artists continue to target businesses as well as individuals.\n Before you even get to the level of a personal interaction with a mysterious Nigerian prince, however,  this short study by linguist Deborah Schaffer can give you the 4-1-9 on how to recognize the linguistic patterns of a scam email when it first enters your inbox and greets you in flattering, if broken, flowery language.\n    Nigerian 419 cons (the number refers to the fraud section of the Nigerian Criminal Code) are practically the oldest scams on the internet. They can actually be traced back to the 1920s, in the form of a confidence trick most gothically known as the Spanish Prisoner. The victims are asked to pay out more and more money to release the wealthy relative of your respectable foreign correspondents (who naturally doesn’t exist), cruelly imprisoned in Spain, in return for a large reward (that never comes).\n In the updated 419 Nigerian scam, the potential mark is asked to pay a small advance fee, or asked to send their bank information or personal details to help move funds that have been locked up, perhaps in a foreign country, or somewhere plausibly difficult. In return, they’re promised a much larger fund in return. As the story goes, perhaps it comes from the coffers of a prince in exile, a government official on the take, or a dying philanthropist anxious to bequeath his or her wealth upon a deserving email recipient.\n While Schaffer found half of her collection of 419 emails originated from Nigeria, the rest were from elsewhere, often other African and Middle Eastern countries. What’s really interesting is how language is used in these con jobs. The stories are colorful variations of each other, but the language used to tell them are key to capturing a potential mark’s (greedy) imagination, relieving their fears, and building a bond and relationship between an ongoing victim and grifter.\n It’s well-known that most of the emails are composed by nonnative speakers of English, as is clear from the many grammatical and punctuation mistakes, broken syntax, missing words, and malapropisms ( “the will to personify the façade to its practical conclusion” for  “pursue the charade”). With so many mistakes, how can this language really fool anyone? Often, victims know the message comes from a nonnative speaker, or they may be nonnative English speakers themselves and may not always recognize grammatical errors. These are the ludicrous linguistic warning signs that helpfully remove most people who are savvy enough to escape the trap and leave the much smaller percentage who stay to be intrigued, starry-eyed, by an implausible story.\n Despite this lack of English fluency, the scammers seem to have read and absorbed the most swashbuckling tales of linguistic derring do. 419 scam emails are full of unusually florid language, meant to persuade and cajole the reader into biting the bullet and complying, such as in opening greetings ( “Compliments of the season, and I pray that this mail meet you in go”) and apologies ( “Pardon the abruptness of this letter; it is due to its exigency”). Scammers make liberal use of flattery ( “You have been recommended by an associate who assured me in confidence of your ability and reliability in prosecuting a business transaction of high net value requiring maximum confidentiality.”), religious appeals invoking God in the hopes of finding common ground, even secrecy and intrigue ( “First, I must solicit your strictest confidence in this transaction; this is by virtue of its nature as being utterly confidential and top secret.”).\n Schaffer also shows how 419 scammers use strategies such as pressuring readers to act now before it’s too late ( “Get Back To Me Urgently!”) and assuring them that the proposed schemes are quite safe ( “This transaction is 100% risk free”) and of immense worth and value. The scammers make extraordinary efforts to use technical, military, financial or otherwise professional language in a clumsy caricature of what formal, educated English sounds like ( “government officials . . . awarded themselves contracts that were grossly over-invoiced in various ministries and parastatals”) to keep up the pretence of being a barrister, a brigadier-general, or a bank official.\n  You may unsubscribe at any time by clicking on the provided link on any marketing message.\n  This is all wrapped up in unrealistic, yet intriguing narratives that many ordinary people are not familiar with, of the lives of dead millionaires’ relatives, down on their luck, philanthropists and princes who want to do good for others, distressed business executives and oil tycoons, all who’ve lost their way and need your help. By telling these tall tales, and playing on sympathy, grifters try to entice their victims into a bond that keeps them deeply invested in the scheme and the outcome for as long as possible. The longer they feel invested and loyal, the more they’ll continue to deny it’s a scam. Sometimes they never do.\n The language scammers use to impress and flatter is so obvious and amateurish that it can seem astonishing that anyone could ever be taken in. Yet many ordinary people do fall into the trap every year. The language, however puzzling, is designed to be persuasive as part of story victims are often wishing and wanting to be real. It’s a simple scam, but appears to be effective when it reaches credulous types who are willing to ignore the warning signs in search of a treasure hunting adventure that can make a life extraordinary for a while, before it all ends in grief.\n        JSTOR is a digital library for scholars, researchers, and students. JSTOR Daily readers can access the original research behind our articles for free on JSTOR.\n  You may unsubscribe at any time by clicking on the provided link on any marketing message.", "posttime": "2021-06-20 12:29:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "language,语言", "title": "诈骗者如何使用语言来欺骗受害者 ", "title_en": "How scammers use language to trick their victims", "transed": 1, "url": "https://daily.jstor.org/the-life-changing-linguistics-of-nigerian-scam-emails/", "via": "", "real_tags": ["language", "语言"]}]