[{"category": "", "categoryclass": "", "imagename": "5a460c23775e48df7bed8323eb73eda2.jpg", "infoid": 1071116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冒着疏远这本杂志的大多数读者的风险，这里有一个供词。我讨厌 Python 很长一段时间。我的问题不在于语言本身，即使缩进规则让我失望了一段时间。不，我让自己远离 Python 的原因是不幸接触了一些（对我来说太多了）傲慢自大的 Python 开发人员。嗯，那个，以及 Python 2 和 3 之间的过渡的无人区。当然，这是不幸的。但几年后，实用主义自然又把我带回了 Python；与其说是语言本身，我现在既不喜欢也不讨厌，而是可用库的数量（及其出色的质量）。引起人们对 Python 重新产生兴趣的另一个重要因素是人们期待已久的 Python 2 弃用公告。这一事件标志着语言的一个主要成熟点，也是一个迫切需要的。 Python 的生态系统非常出色，机器学习的兴起巩固了其作为新 Fortran 的地位，同时它也成为了新的伪代码，甚至是新的 BASIC。如今，开发人员忽视 Python 不仅很难，而且是不明智的。本文是对在线和离线媒体进行六个月探索的产物，旨在了解 Python 已渗透到我们的工艺中。结果连这位作者都感到意外。 Python 不仅无处不在，它已成为计算机行业的“默认”编程语言。如上所述，让我接触 Python 的第一件事是它的库。我需要完成工作（谁不做？）而 Python 正好拥有我需要的库。它的标准 csv 包是我大约 20 年前探索和使用的第一个包；接下来是 argparse、doctest 和 shutil，它们都是标准库的一部分。操作 CSV 格式的数据需要我将其导出为其他格式； Python-OpenXML 提供了第一个解决方案，后来通过 Pandas 进行了增强以操作 Excel 文件。渐渐地，我开始越来越多地使用 Python。在某个时候，我得到了一份 Django 应用程序开发人员的工作，这是一个夸大其词的框架“为有截止日期的完美主义者”；一个充满傲慢和不应有的优点的妙语。值得庆幸的是，如今云原生 Python 应用程序是围绕不那么单一的选项构建的，例如 Flask、Pyramid 或 Tornado。\n在 IDE 方面，PyCharm、Spyder 或 Wing 正在争取开发人员的注意力，其中许多人正在迁移到带有 Microsoft 自己的 Python 扩展的 Visual Studio Code（顺便说一下，他们最近对 Python 生态系统非常感兴趣）。开发人员可能有兴趣使用 mypy、Flake8 或 Pylint 来检查他们的代码质量。大多数 Python 脚本在命令行中开始和结束它们的生命。但是对于那些对提供 GUI 感兴趣的人来说，选择比比皆是：用于触摸屏应用程序的 Kivy、古老的 wxPython、强大的 Python 的 Qt，以及它经常被忽视的兄弟 PySide2。在频谱的实验部分，REMi 和 Gooey 值得特别提及；前者将脚本转换为成熟的 Web 应用程序，后者将任何 CLI 脚本转换为桌面 GUI 应用程序。 Python 还与其他语言和运行时具有很强的互操作性。只需提及 SWIG 和 Boost.Python，就可以实现与 C 和 C++ 的互操作性；和 Jython，使其能够在 JVM 中使用——在撰写本文时仍然缺乏对 Python 3 的支持。说到该语言的替代实现，还必须提到由 Guido van Rossum 推荐的 PyPy 和用于 .NET 的 IronPython，其 Python 3 alpha 实现最近发布。 Python 是包管理器和构建系统的沃土：Conan、Poetry、Wheels、redo（递归构建系统），当然还有古老的 pip，以及最近的 pipx（相当于 JavaScript 的 npx 命令）。最近许多突破性的想法都由 Python 提供支持：Ansible；海鞘； Atheris 代码覆盖工具； authentik（Keycloak 的替代品）；解析 HTML 的 Beautiful Soup；凹凸版本; Celery 用于分布式队列处理；点击和Typer替换argparse；饼干刀； Depix 从像素化屏幕截图中恢复密码；图表； Ecco 探索 NLP 模型；一目了然地监控您的服务器； GOMP 比较 Git 分支；冰淇淋; jrnl 写你的日记； lorem 创建占位符文本； Outrun 在单独的机器上运行命令；操作图像的枕头； pdoc 生成 API 文档； PyGithub; pyyaml;二维码;彩虹流；拉马努金机；对您的 HTTP 需求的请求；丰富的控制台文本格式； TOML 因为没有足够的配置语言；秃鹫寻找死代码； youtube-dl 在线下载视频；微信矩阵协议客户端；我在哪里; Whoosh 搜索库；还有更多。\n如果 Rust 似乎是大改写的语言，那么 Python 绝对是第一个版本的语言。在过去的十年中，Python 单句柄取代了 Fortran，成为科学计算的首选编程语言。这一切都始于 Numpy，然后是 Jupyter notebooks，这个概念松散地基于 Knuth 的文学编程思想。紧随其后的是 Anaconda、SciPy、PyTorch，剩下的就是历史了。特别是，机器学习的流行在很大程度上归功于这些工具的预先存在。安装 Python 仍然是一项艰巨的任务，通常是生态系统新手的最大障碍，尤其是考虑到网上有大量相互矛盾的建议。愿本节消除一些混淆，通过作者在不同环境中安装 Python 所使用的经过验证的技术。 Windows 用户可以简单地使用 Chocolatey 来安装他们的 Python 环境，并准备好使用。不使用 Homebrew 可以更好地为 Mac 用户服务；本文作者衷心建议 Mac 和 Linux 用户使用 pyenv 代替。无论您使用哪种技术来安装 Python，请始终为每个项目使用一个虚拟环境。这确保它们是自包含的，具有明确定义的依赖关系，并保证可以在其他人的计算机上工作。 $ python3 -m venv .venv$ source .venv/bin/activate$ pip install PyYAML$ pip install PyGithub$ pip freeze &gt; requirements.txt# 稍后...$ pip install -r requirements.txt 虚拟环境也可以帮助开发者获得他们在 Docker 容器中的代码很容易；请记住将 --no-cache-dir 选项传递给 Dockerfiles 中的 pip install。永远不要忘记在你的项目中添加一个合适的 .gitignore 文件。\n学习 Python 的材料并不缺乏。以下书籍可以作为起点，按指定的顺序： 如果您对在线教程感兴趣，我在这里只会提到 Python 基础知识和真正的 Python，但简短的 DuckDuckGo 搜索将带来更多资源。 Python 的创造者，也被称为“终生仁慈的独裁者”，有着相当辉煌的职业生涯，受到媒体的密切关注。在过去的 15 年里，他一直在 Google 和 Dropbox 之间度过。在前者中，他参与了 Mondrian 代码审查工具的创建，该工具于 2006 年编写以取代基于邮件的工作流程。后来，他可以说启动了第一个流行的 PaaS，即 Google AppEngine，其第一个支持的运行时当然是 Python。一个奇怪的事实：Python 尚未出现在 Jean Sammet 创建的 HOPL 会议中。有趣的是，Van Rossum 先生于 2006 年开始撰写此类论文，将在 HOPL III 中发表，但经过多次反复之后，他改用这些材料创建了一个关于 Python 历史的新博客。在谷歌之后，Van Rossum 先生从 2013 年到 2019 年 10 月退休，他去了 Dropbox。在撰写本文时，据说他在 mypy 静态类型检查器工作——或者至少，项目博客是这么说的.当然，并不是所有用 Python 制作的东西都是成功的。只需提及 GadflyB5 SQL 关系数据库或 Mercurial；本身就是优秀的工具，但被更流行的选项所掩盖。 reStructuredText 也通常被驳回，开发人员通常更喜欢 Markdown 或 Asciidoc。尽管如此，Python 还是成为了让开发人员发笑的无尽素材。 Python 有禅意。 Python 让开发人员歌唱。 Texas Instrument TI-84 Plus CE-T Python 版计算器可以编辑和运行 Python 代码。人们在 Excel 电子表格中使用 Python 而不是 VBA。他们使用 Python 创建 Gimp 插件或渲染电影。他们用它编写无服务器应用程序以在 5 分钟内处理 558K 事务。它在 2007、2010、2018 和 2020 年被评为 TIOBE 年度编程语言。其语法已从英语翻译成德语、中文、爪哇语、立陶宛语、西班牙语、瑞典语和俄语等。人们问自己WTF Python。\n尽管我不再讨厌 Python，但每次我在 REPL 中输入 quit 并得到音调失灵的“使用退出（）或 Ctrl-D（即 EOF）退出”消息时，我仍然会面对面掌。", "note_en": "At the risk of alienating most of the readership of this magazine, here is a confession. I hated Python for a very long time. My issue was not with the language per se, even though the indentation rules have put me off for a while. No, the reason I kept myself away from Python was the unfortunate contact with some (too many for my taste) hubris-filled Python developers. Well, that, and the  no man’s land that was the transition between Python 2 and 3.\n That was, of course, unfortunate. But after a few years, pragmatism naturally brought me back to Python again; not so much the language  per se, which I now neither like nor dislike, but the sheer amount of libraries available (and their excellent quality). Another big contributing factor to this renewed interest in Python was the long awaited announcement of the deprecation of Python 2; this event signals a major point of maturity in the language, and one that was badly required.\n The ecosystem around Python is outstanding, and the rise of Machine Learning cemented its status as the new Fortran, while at the same time it became the new pseudocode, or even, the new BASIC.\n These days it is not only hard, but unwise for a developer to ignore Python. This article is the product of six months of exploration in online and offline media, to find out how much Python has permeated our craft. The result was a surprise even to this author. Python is not only everywhere, it has become a “default” programming language for the computer industry.\n  As stated above, the first thing that brought me into Python was its libraries. I needed to get stuff done (who does not?) and Python had precisely the libraries I needed. Its standard  csv package was the first one I explored and used with intensity, almost 20 years ago; next came  argparse,  doctest, and  shutil, all part of the standard library.\n Manipulating data in CSV format took me to export it to other formats;  Python-OpenXML provided a first solution, later enhanced with  Pandas to manipulate Excel files.\n Little by little, I started to use Python more and more. At some point I got a job as a  Django application developer, a framework pompously marketed “for perfectionists with deadlines”; a punchline filled with hubris and undeserved merit. Thankfully these days Cloud Native Python apps are built around less monolithic options such as  Flask,  Pyramid, or  Tornado.\n In terms of IDEs,  PyCharm,  Spyder, or  Wing, are fighting for the attention of developers, many of whom are migrating to Visual Studio Code with Microsoft’s own  Python extension (who by the way are very interested in the Python ecosystem  lately).\n Developers might be interested to use  mypy,  Flake8 or  Pylint to check the quality of their code.\n Most Python scripts start and end their life in the command line. But for those interested in providing a GUI, choices abound:  Kivy for touchscreen apps, the venerable  wxPython, the powerful  Qt for Python, and its often overlooked sibling  PySide2. In the experimental part of the spectrum,  REMi, and  Gooey deserve special mentions; the former turning scripts into fully-fledged web apps, and the latter transforming any CLI script into a desktop GUI application.\n Python has also strong interoperability with other languages and runtimes. Suffice to mention  SWIG and  Boost.Python, enabling interoperability with C and C++; and  Jython, enabling its use in the JVM–still lacking support for Python 3 at the time of this writing.\n Speaking about alternative implementations of the language, one must also mention  PyPy, recommended by Guido van Rossum for its speed, and  IronPython for .NET, whose Python 3 alpha implementation was  recently released.\n Python is a fertile ground for package managers and build systems:  Conan,  Poetry,  Wheels,  redo (a recursive build system), and of course the venerable  pip, together with the more recent  pipx (an equivalent to JavaScript’s  npx command).\n Many ground-breaking ideas have been powered by Python lately:  Ansible;  asciinema; the  Atheris code coverage tool;  authentik (replacement for Keycloak);  Beautiful Soup to parse HTML;  bump2version;  Celery for distributed queue processing;  Click and  Typer to replace  argparse;  Cookiecutter;  Depix to recover passwords from pixelized screenshots;  Diagrams;  Ecco to explore NLP models;  Glances to monitor your servers;  GOMP to compare Git branches;  IceCream;  jrnl to write your journals;  lorem to create placeholder text;  Outrun to run commands in a separate machine;  Pillow to manipulate images;  pdoc to generate API docs;  PyGithub;  PyYAML;  qrcode;  rainbowstream;  Ramanujan Machine;  Requests for your HTTP needs;  Rich for formatting text in the console;  TOML because there are not enough configuration languages;  Vulture to find dead code;  youtube-dl to download videos online;  Weechat Matrix protocol client;  whereami; the  Whoosh search library; and so much more.\n If Rust seems to be the language of the  great rewrite, Python is definitely the language of the first release.\n  In the past decade, Python single-handledy replaced Fortran as the programming language of choice for scientific computing. It all started with  Numpy, and then followed with  Jupyter notebooks, a concept loosely based on Knuth’s idea of  literate programming. Followed  Anaconda,  SciPy,  PyTorch, and the rest is history. In particular, the rise in popularity of  Machine Learning owes a great deal to the pre-existence of these tools.\n  Installing Python is still a non trivial task, and usually the biggest hurdle for developers new to the ecosystem, particularly given the sheer number of contradicting advice online. May this section remove some of the confusion, through proven techniques this author has used to install Python in different environments.\n Windows users can simply use  Chocolatey to get their Python environment installed, and ready to use. Mac users are better served by  not using Homebrew for it; the author of this text heartily recommends using  pyenv instead for both Mac and Linux users.\n No matter which technique you use to install Python, always use a  virtual environment per project. This ensures they are self contained, with well-defined dependencies, and are guaranteed to work in other people’s computers.\n $ python3 -m venv .venv$ source .venv/bin/activate$ pip install PyYAML$ pip install PyGithub$ pip freeze &gt; requirements.txt# Later on...$ pip install -r requirements.txt\n Virtual environments also help developers get their code inside Docker containers easily; remember to pass the  --no-cache-dir option to  pip install in your Dockerfiles. Never forget to add a  proper .gitignore file to your project.\n  There is no shortage of material to learn Python. The following books might serve as a starting point, in the order specified:\n  If you are interested in online tutorials, I will only mention here  Python basics and  Real Python, but a short DuckDuckGo search will bring many more resources.\n  The  creator of Python, also known as its “Benevolent Dictator for Life”, has had quite an illustrious career, closely monitored by the press. In the past 15 years he spent his time between Google and Dropbox. In the former he contributed to the creation of the  Mondrian code review tool, written in 2006 to  replace a mail-based workflow. Later on, he arguably kicked-off the first popular PaaS,  Google AppEngine, whose first supported runtime was, of course,  Python.\n A curious fact: Python had not yet been featured in the  HOPL conferences created by  Jean Sammet. Interestingly enough, Mr. Van Rossum  started working in such paper in 2006, to be presented in  HOPL III, but after much back and forth, he used the material to start a new blog about the  history of Python instead.\n After Google, Mr. Van Rossum went to Dropbox, from  2013 to his  retirement in October 2019. At the time of this writing he is said to be working in the  mypy static type checker–or at least, that is what the project  blog says.\n  Of course, not everything made with Python was successful. Suffice to mention the  GadflyB5 SQL relational database, or  Mercurial; excellent tools in their own right, but shadowed by much more popular options.  reStructuredText also is generally dismissed, developers usually prefering Markdown or Asciidoc.\n Still, Python became endless material for  memes that  make  developers  laugh. There is a  Zen of Python. Python made developers  sing. The Texas Instrument  TI-84 Plus CE-T Python Edition calculator can edit and run Python code. People use  Python inside Excel spreadsheets instead of VBA. They create  Gimp plugins or  render movies with Python. They write  serverless applications with it to  process 558K transactions in 5 minutes. It was named the  TIOBE Programming Language of the Year in 2007, 2010, 2018 and 2020. Its syntax has been translated from English to  German, Chinese, Javanese, Lithuanian, Spanish, Swedish, and  Russian, among  others. People ask themselves  WTF Python.\n Even though I do not hate Python anymore, I still facepalm every time I type  quit in the REPL and get the tone-deaf  &#34;Use quit() or Ctrl-D (i.e. EOF) to exit&#34; message instead.", "posttime": "2021-08-02 15:28:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,state", "title": "2021 年 Python 的状态", "title_en": "The State of Python in 2021", "transed": 1, "url": "https://deprogrammaticaipsum.com/the-state-of-python-in-2021/", "via": "", "real_tags": ["python", "state"]}, {"category": "", "categoryclass": "", "imagename": "abfb45add594833bb9ce21bee6cfa93e.jpg", "infoid": 1071114, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航 跳转到搜索 Kin 是微软为社交网络用户设计的短命手机系列。 [1] 微软将手机的目标人群描述为 15 到 30 岁之间的男性和女性。 [2] 它由夏普公司 [3] 制造，并通过 Verizon Wireless 销售。 [4] 从收购 Danger Incorporated 开始，微软投资了两年时间和大约 10 亿美元来开发 Kin 平台，[5] [6]。 Kin 基于 Windows CE。 [8] Kin ONE 和 TWO 于 2010 年 5 月 14 日上市。两个月内，Verizon 因销售不佳而停止销售手机。 [9] 微软取消了其在欧洲发布的计划，停止推广这些设备，停止生产，并将 Kin 开发团队重新分配给其他项目。 [10] 微软更新了其未售出的 Kin 库存，固件删除了它们的社交和基于网络的功能，并于 2010 年 12 月通过 Verizon 商店将这些重新设计的设备作为有限功能手机提供，Kin ONEm 和 TWOm。 2011 年 1 月，微软关闭了 kin.com 网站，该网站控制了早期手机的大部分功能。 Kin TWOm 于 2011 年 8 月停产； [11] 直到 2013 年 6 月，仍然可以在交易网站上找到未售出的库存。 [12] Kin 项目最初以代号 Project Pink 为人所知，并在微软执行官 J Allard 的指导下开始。 [13] 为了抢占先机，微软在 2008 年收购了制造 Danger Hiptop/T-Mobile Sidekick 的 Danger Incorporated，收购价格传闻约为 5 亿美元。 [14] [15] 2009 年 9 月，ZDNet 消息来源报道说 Project Pink 将带来全新的软件堆栈和服务。 [16] 一些报告预测，新的手机平台将基于 Zune 媒体设备。 [17] 该项目由 Roz Ho 管理，她创造了项目名称“粉红色”，这是她最喜欢的颜色。工程师和项目经理使用 Twitter 哈希标签“#TMDP”在代码中相互交流——这个首字母缩写词扩展为“真实、疯狂、深沉（粉红色）”，代表 Roz Ho 最喜欢的电影和项目名称。工程师们被告知他们应该对这个项目充满热情，“真的，疯狂，深深”。当达到里程碑或测试成功时，Roz Ho 会在会议或电子邮件中大声喊出“Truly、Madly、Deeply”来为团队加油。 Kin 是在微软的高级移动体验 (PMX) 部门内部由一个包括 Danger 员工在内的团队开发的。 [18] 据说手机制造商和网络运营商最初对 Kin 充满热情，并相互竞相参与该项目。 [13]\n据 Engadget 称，微软高管层存在嫉妒和竞争，Windows Phone 高级副总裁 Andy Lees 设法从 Allard 手中夺取了 Kin 项目的控制权，并将其转移到他的 Windows Phone 部门。 [13] Kin 的前身 Danger 的 Sidekick 基于 Java 编程语言，但 Engadget 说 Andy Lees 希望 Kin 运行内部的 Microsoft 操作系统。 [13] 微软计划将 Kin 建立在 Windows Phone 上。然而，由于 Windows Phone 的延迟，该软件必须直接基于 Windows CE。 [18] Engadget 声称 Andy Lees 对 Kin 项目缺乏热情。 [13] 尽管如此，微软又花了两年时间开发 Kin，直到 2010 年发布。微软 Kin 的揭幕始于该公司于 2010 年 4 月 12 日向选定的记者发出邀请参加旧金山的神秘活动。标语邀请函上写着“是时候分享了”。然而，就在几个小时后，一位消息人士证实该活动是关于粉红色项目（官方名称尚未公布）。 [20] 该活动在一家名为 Mighty 的夜总会举行，并由微软娱乐和设备部门总裁罗比·巴赫 (Robbie Bach) 进行了演讲。 [21] 微软因电话的在线视频广告而受到批评，该广告描绘了一名男性青少年将一个 Kin 放在他的衬衫下以拍摄他裸露的胸部。然后他被展示将图像发送给一名女性青少年。消费者报告小组将该广告描述为“彻头彻尾的令人毛骨悚然的序列”，暗示它促进了色情短信。作为回应，微软删除了视频中“不当”的部分。 [22] Kin 销售不佳。微软高管告诉《纽约时报》，他们对 Verizon Wireless 员工没有足够积极地推广手机感到失望。 [23] 在上市仅 48 天后，微软于 2010 年 6 月 30 日停止了 Kin 系列产品 [24]，到 2010 年 7 月中旬，Verizon 已将所有未售出的手机退还给微软。 [9] 其在英国运营商沃达丰 (Vodafone) 上的欧洲发行计划被取消。 [25] [26] “The Kin 从第一天起就是一个错误，”Enderle Group 的首席分析师 Rob Enderle 告诉 eWeek 杂志。 “他们将 Kin 从 Sidekick 平台转换为 Windows CE 所花费的额外时间使其上市晚了大约一年半，而合并可能又增加了一年半。这会延迟 1.5 到 3 年，具体取决于您何时开始计时。” [27] 2010 年 11 月 18 日，Verizon Wireless 的网站确认 Kin ONE 和 Kin TWO 重新上市，其功能手机操作系统经过重新设计，重新标记为 Kin ONEm 和 Kin TWOm。由于新手机没有使用 kin.com 网站，因此不需要数据计划。同年 12 月，新版手机抵达 Verizon 商店。 [28] 随着更名和重新归类为功能手机而不是智能手机，这些设备的价格大幅下降，Kin ONEm 从 50 美元降到免费，Kin TWOm 从 100 美元降到 50 美元，新的两年合同。\n新的功能手机操作系统删除了基于 Web 和社交网络的集成功能，例如 Kin Loop、Kin Spot 和 Kin Studio。 [29] 较新的“m”手机（由型号旁边的“m”和角落上的两个黄点标识）可以通过按住“r”、“b”和“电源”（该过程也会删除手机的所有存储数据和设置）。 kin.com 网站已于 2011 年 1 月停用，并删除了网站上存储的所有用户图片和其他信息。 Verizon 向所有受影响的手机用户提供免费的 3G 智能手机以旧换新服务。 [30] Kin 网站关闭后，最初的 Kin ONE 和 TWO 失去了对从 ONEm 和 TWOm 中删除的相同社交功能的访问权限，使它们本质上也是不需要数据计划的功能手机。微软将 Kin 设备描述为“社交手机”，[4] 跨越功能手机和智能手机市场，强调社交网络和内容共享，但没有可下载的应用程序或游戏。 [31] Kin 上的主屏幕被称为 Loop，并充当来自 Facebook、Twitter、Windows Live 和 MySpace 的社交网络连接以及来自网络提要的网络内容的聚合器。评论员注意到 Loop 的 15 分钟更新延迟，CNET 的 Ina Fried 将其描述为“奇怪”。 [32] PC World 认为这种延迟与微软声称手机“始终连接”的说法不一致。 [33] 用户无法调整此间隔，[34] 尽管可以使用屏幕刷新按钮手动触发更新，或者锁定然后解锁手机。 [需要引用] 微软将电池寿命和不成熟的社交网络 API 列为延迟的原因； Engadget 推测，微软可能一直在利用延迟消息来鼓励 Verizon 提供价格较低的数据计划，这对该平台的青少年目标受众具有吸引力。 [35] Kin 不支持将照片或视频上传到 Twitter。 [36] 也不支持转推、直接消息、查看单人更新以及从 Loop 打开 Twitter 链接。 [34] Spot 是一项功能，允许用户将电子邮件地址或电话号码添加到 SMS 或 MMS，或将内容（例如，文本、URL 或照片）附加到电子邮件中。 [34]\nSpot 表示为靠近屏幕底部中心的无所不在的彩色点。要添加地址字段，用户将收件人的照片拖到 Spot，然后单击 Spot，打开允许用户创建新电子邮件、SMS 或 MMS 的页面。 [34] Spot 也可用于设置电子邮件附件，通过用户将内容拖到 Spot，然后将收件人的照片拖到 Spot，然后可以发送包含这些附件的电子邮件。 [34] 然而，Kin 不支持非电子邮件媒体（如彩信）的附件，并且不能用于将内容发送到社交媒体网站。 [34] Kin 手机中的内容，例如照片、视频和消息，会自动同步到名为 Kin Studio 的云服务，然后可以通过其他设备上的浏览器访问。 Kin Studio 网站是用 Silverlight 编写的，其外观与 Kin UI 相似，甚至包括一个用于共享内容的 Spot。 [37] Kin Studio 于 2011 年 1 月关闭。Kin ONE 配备了具有标准清晰度视频录制功能的 5 兆像素相机。 Kin TWO 包括一个 8 兆像素的摄像头，可录制 720p 视频。照片会在原始手机上自动进行地理编码，“m”手机上禁用了该功能。 [38] Kin 没有照片编辑软件。 [39] 对于媒体，Kin 设备与 Zune 桌面软件同步。此外，这些手机与 Zune Pass 兼容。与同时代的 Zune 设备非常相似，除了运营商网络上的 3G 之外，Kin 手机还可以通过 WiFi 连接播放音乐。 [40] 对于 Mac 用户，Microsoft 与 Mark/Space 合作提供了一种媒体同步工具，可以从 iTunes 中提取音频和视频文件以及从 iPhoto 中提取照片。 [37] Kin 不支持从 YouTube 或 Hulu 等网站播放视频，尽管这些设备可以通过 WiFi 或 3G 从浏览器观看 YouTube 视频。 [41] [需要澄清] Kin 没有应用程序商店，也不能在手机上安装第三方应用程序。 [41] PC World 将其描述为“令人困惑”。 [33] 此外，网络浏览器不支持 Flash 网络应用程序，[42] 并且没有手机游戏。 [42] 微软曾表示他们打算最终合并 Kin 和 Windows Phone 平台，然后可下载应用程序可用于合并平台。 [43] 联系人列表只能由 Verizon 商店员工从另一部手机复制。消费者无法通过任何已知方式（通过无线、通过内存或 SIM 卡、通过蓝牙和 vCard 无线连接，或通过直接 USB 电缆连接）来执行此操作。\nKin 没有日历或约会应用程序，[41] 也没有与 Outlook 日历或 Google 日历同步的能力。 [36] 一些评论员建议社交电话应该能够共享社交活动日历。 [36] Kin 无法进行即时消息 (IM)，或使用任何 IM 客户端，[41] 这对于专为消息传递而设计并针对青年市场的手机来说很奇怪。 [36] 发现手机内的 ROM 包含支持 AOL Instant Messenger、Windows Live Messenger 和 Yahoo! 的 IM 系统的基础。 Messenger，但它从未投入使用。据推测，该软件的未来修订版将启用即时消息传递。 [44] 在美国，移动电话提供商 Verizon Wireless 出售带有语音计划的 Kin 电话，起价为每月 39.99 美元。可选的 Zune Pass 音乐访问费用为每月 14.99 美元。 [45] kin.com 网站于 2011 年 1 月停止使用后，虽然可选的 Zune Pass 仍然可用，但最初的 Kin ONE 和 Kin TWO 不需要数据计划。 Microsoft Kin 被描述为 Windows Phone 的“近亲”，[46] 具有共享的用户界面特征。根据微软的说法：“KIN 和 Windows Phone 共享通用的操作系统组件、软件和服务。我们将寻求围绕这两种产品的单一平台以及一致的硬件规格进行调整。” [46] 微软表示，Kin 和 Windows Phone 的底层基础是由相似的核心技术结合在一起的。两种操作系统都运行相同的 Silverlight 平台，[46] 微软表示最终将 Windows Phone 与 Kin 合并。 [43]\n2010 年 11 月，微软和 Verizon 重新推出了 Kin 手机，将它们重新标记为无需数据计划的功能手机。手机的价格也被削减了。 Kin TWO 之前的两年合同价格为 100 美元，而新款 Kin TWOm 的合同价格为 20 美元。同样，Kin ONE 以前的合同价格为 50 美元，现在合同价格为 0 美元。重新调整用途的“m”手机上的新固件删除了操作系统的几个以数据为中心的功能，包括许多设备的社交元素，如 Loop 主屏幕、Spot 和对 Kin Studio 云存储站点的访问，于 2011 年 1 月关闭。由于缺乏数据计划要求和较低的前期价格，微软和 Verizon 希望做他们最初计划的事情：占领青少年市场。 Zune Pass 是旧 Kin 设备的一项看似充满数据的功能，但仍可用于重新调整用途的手机，尽管它现在只能通过 Wi-Fi 流式传输音乐，即使客户启用了 3G 数据，以节省数据。这样做是为了适应 Verizon 新的分层数据计划，这标志着用户无限数据的终结。用户还可以通过 Zune 软件将音乐、播客、电视节目和电影同步到他们的 Kin 手机。音乐也可以直接下载到手机上，但只能通过 Wi-Fi 下载。播客、电视节目和电影只能通过 Windows PC 上的 Zune 软件同步到手机。 “m”系列增加了一个日历和一个计算器应用程序，以解决人们对这些功能缺失的抱怨，即使是最基本的功能手机通常也有这些功能。尽管日历应用程序具有定时警报和提醒以及日、月和年视图等基本功能，但它无法与 Microsoft Outlook、Microsoft Exchange 甚至 Windows Live Hotmail 同步。随着社交网络功能的停止，手机不再对图片进行地理编码。原始版本中缺少的其他功能仍然不存在，包括禁止蓝牙访问文件传输和无线打印。 Kin TWOm 无法转发以前发送的消息。短信以聊天风格格式发送，使其无法挑出特定的短信。\n“KIN 使用专门为 KIN 制作的专有浏览器。不能使用或下载其他浏览器。Silverlight 用于创建 KIN 工作室，而不是浏览器。” [47] 浏览器将自己标识为“IEMobile 6.12”。完整的用户代理字符串是： Kin Studio、Kin Loop 和 Kin Two 上的 GPS 软件；从 Kin TwoM 中删除（服务不再可用）^ Priya Ganapati（2010 年 4 月 2 日）。 “动手实践：Kin 手机能让微软再次酷起来吗？”。有线.com。 ^ abcd “Microsoft 推出新一代社交电话 KIN，一款新的 Windows Phone”（新闻稿）。微软。 2010 年 4 月 12 日。原件存档于 2010-04-15。 ^ ab“Verizon 退回未售出的 Kin 手机，拉动在线销售，2010 年 7 月 18 日”。 Electronista.com。 2010 年 7 月 18 日。原始存档于 2013 年 5 月 17 日。 ^ 悉尼迈尔斯 (2011-08-27)。 “Verizon 停止使用 KIN TWOm，为我们的顶级通讯电话列表中的 KIN ONEm 腾出空间”。电话狗。 ^ Om Malik（2008 年 2 月 12 日）。 “微软为危险付出了多少？”。千兆欧姆。\n^ Mary-Jo Foley（2009 年 9 月 24 日）。 “微软粉红色：&#39;只是一个伙伴&#39; 或更多？”。 ZDNet 。 ^ Daniel Eran Dilger（2009 年 10 月 12 日）。 “微软的 Sidekick/Pink 问题归咎于 dogfooding 和破坏”。苹果内幕。 ^ ab“微软的粉红色斗争溢出到Sidekick”。频道网。 UBM 频道。 2009 年 10 月 12 日。原件存档于 2010 年 7 月 20 日。 ^ 伊娜炸 (2010-04-05)。 “微软的神秘事件揭晓 | 超越二进制 - CNET 新闻”。新闻网。 ^ 弗里德，伊娜 (2010-04-12)。 “微软推出 Kin 手机（实时博客）| 超越二进制 - CNET 新闻”。新闻网。 ^ 阿什莉·万斯（2010 年 7 月 4 日）。 “微软电话。有人在吗？”。纽约时报 。 ^ Helft, Miguel（2010 年 6 月 30 日）。 “Microsoft Kin 在 48 天后停产”。纽约时报 。\n^ Helft, Miguel（2010 年 6 月 30 日）。 “Microsoft Kin 在 48 天后停产”。纽约时报 。 ^ Lowensohn, 乔希 (2010-11-19)。 “Kin 的安静回归在失败的小工具中很少见 | 微软 - CNET 新闻”。新闻网。 ^ 霍利斯特，肖恩 (2010-12-11)。 “Kin Studio 将于 1 月 31 日关闭，Verizon 将为受影响的客户提供免费电话”。 Engadget.com 。 ^ abcdefg 约书亚·托波尔斯基（2010 年 5 月 5 日）。 “微软健一和二评论”。搞定。 ^ 霍利斯特，肖恩（2010 年 4 月 13 日）。 “Microsoft Kin 通知有长达十五分钟的延迟”。搞定。网志公司。 ^ abcd 密斯，金妮（2010 年 4 月 12 日）。 “微软健二：时尚，但缺少一些关键功能”。华盛顿邮报。电脑世界。 ^ ab Thurrott, Paul（2010 年 4 月 12 日）。 “Microsoft KIN：发布时的注意事项”。 Windows Phone 的秘密。\n^ “微软 Kin One 和 Kin 二：规格和视角”。移动杂志。 2010 年 4 月 13 日。原件存档于 2010 年 4 月 17 日。 ^ 布坎南，马特（2010 年 4 月 12 日）。 “Microsoft Kin：Sidekick 粉丝的完美手机”。小发明。高客传媒。 ^ abcd 泽曼，埃里克（2010 年 4 月 12 日）。 “微软 Kin 平台的第一印象”。信息周刊。博闻科技网。 ^ abc“Windows Phone 7 和 KIN 比思想更亲近的表亲”。电话独家新闻。 2010 年 5 月 12 日。原件于 2013 年 1 月 31 日存档。^ ab“微软推出 Kin！”。 Tegra 开发人员专区（新闻稿）。英伟达。 2010 年 4 月 13 日。原件存档于 2010 年 4 月 16 日。 ^ ab “微软的 Kin 是第一款 Tegra 智能手机”（新闻稿）。电脑世界。 2010 年 4 月 12 日。 ^ ab“包括 Tegra 详细信息的 Zune HD 规格”（新闻稿）。 PC 世界和 Windows。 2009 年 8 月 19 日。", "note_en": "Jump to navigation  Jump to search  Kin was a short-lived  mobile phone line from  Microsoft designed for users of  social networking.  [1] Microsoft described the phones&#39; target demographic as men and women between ages 15 and 30.  [2] It was manufactured by  Sharp Corporation  [3] and sold through  Verizon Wireless.  [4]\n Microsoft invested two years and about US$1 billion developing the Kin platform,  [5]  [6] beginning with their acquisition of  Danger Incorporated.  The Kin was based on  Windows CE.  [8]\n The Kin ONE and TWO went on the market on May 14, 2010. Within two months, Verizon stopped selling the phones because of poor sales.  [9] Microsoft scrapped its planned European release, stopped promoting the devices, ceased production, and reassigned the Kin development team to other projects.  [10]\n Microsoft updated its unsold Kin inventory with firmware that removed their social and web-based features, and in December 2010 offered these re-purposed units through Verizon stores as limited  feature phones, the Kin ONEm and the TWOm. In January 2011, Microsoft shut down the kin.com website, which controlled most of the earlier phones&#39; features.\n The Kin TWOm was discontinued in August 2011;  [11] unsold inventory could still be found for sale on  deals sites as late as June 2013.  [12]\n     The Kin project was first known by the codename  Project Pink, and began under direction of Microsoft executive  J Allard.  [13] In order to gain a head start, Microsoft acquired  Danger Incorporated, which built the  Danger Hiptop/T-Mobile Sidekick,  in 2008 for a purchase price rumored to be around US$500 million.  [14]  [15] In September 2009, a  ZDNet source reported that Project Pink would bring an entirely new software stack and services.  [16] Some reports predicted that the new mobile phone platform would be based on the  Zune media device.  [17] The project was managed by  Roz Ho, who coined the project name, &#34;Pink&#34;, her favorite color. Engineers and project managers used the Twitter hash tag &#34; #TMDP&#34; to communicate in code with one another—the acronym expands to &#34; Truly, Madly, Deeply (Pink)&#34; for Roz Ho&#39;s favorite movie and the project name. Engineers were told they should feel passion for the project, &#34;Truly, Madly, Deeply&#34;. When milestones were reached or there was a successful test, Roz Ho would cheer the team on by exclaiming &#34;Truly, Madly, Deeply&#34; in meetings or emails.\n Kin was developed inside Microsoft&#39;s Premium Mobile Experiences (PMX) division by a group that included employees from Danger.  [18] Handset manufacturers and network carriers were said to be initially enthusiastic about Kin, and vying with each other to be involved with the project.  [13]\n According to   Engadget, there was jealousy and rivalry in Microsoft&#39;s executive ranks, and Windows Phone Senior Vice President Andy Lees managed to wrest control of the Kin project away from Allard, and move it under his Windows Phone division.  [13] Danger&#39;s Sidekick, the predecessor to Kin, was based on the  Java programming language, but  Engadget says that Andy Lees wanted Kin to run an in-house Microsoft operating system.  [13] Microsoft planned to base Kin on  Windows Phone. Due to delays with Windows Phone, however, the software instead had to be based directly upon  Windows CE.  [18]\n Engadget claims that Andy Lees lacked enthusiasm for the Kin project.  [13] Nonetheless, Microsoft spent a further two years developing the Kin until its release in 2010.\n  The unveiling of Microsoft Kin began when the company sent out invitations to select reporters for a mystery event in San Francisco on April 12, 2010. The tagline on the invitation said &#34;It&#39;s time to share&#34;. However, just hours later a source confirmed that the event was about Project Pink (the official name not having been announced yet).  [20] The event was held in a night club called Mighty and featured a presentation given by  Robbie Bach, president of Microsoft&#39;s Entertainment and Device division.  [21]\n Microsoft was criticized for an online video advertisement for the phone that depicted a male teenager putting a Kin under his shirt to photograph his naked chest. He was then shown sending the image to a female teenager. The  Consumer Reports group described the advertisement as a &#34;downright creepy sequence,&#34; suggesting that it promoted  sexting. In response, Microsoft deleted the &#34;inappropriate&#34; portion of the video.  [22]\n  Kin suffered from poor sales. Microsoft executives told  The New York Times that they were dismayed that  Verizon Wireless staff were not promoting the phones actively enough.  [23] After only forty-eight days on the market, Microsoft discontinued the Kin line on June 30, 2010  [24] and by mid-July 2010 Verizon had returned all their unsold phones to Microsoft.  [9] Its planned European release on UK carrier Vodafone was canceled.  [25]  [26]\n “The Kin was a mistake from Day One,” Rob Enderle, principal analyst of Enderle Group, told   eWeek magazine. “The extra time they took to convert the Kin from the Sidekick platform to Windows CE made it about a year and a half late to market, and the merger likely added another year and a half. That’s 1.5 to 3 years late depending on when you start the clock.”  [27]\n  On November 18, 2010 Verizon Wireless&#39;s website confirmed that the Kin ONE and Kin TWO were back on the market with a reworked feature phone operating system, re-badged as Kin ONEm and Kin TWOm. Since the new phone did not use the kin.com website it did not require a data plan. The new version of the phone arrived at Verizon stores in December of that year.  [28] Along with the name change and re-classification as feature phones rather than smartphones, the prices of the devices were slashed, with the Kin ONEm reduced from $50 to free, and the Kin TWOm reduced from $100 to $50, with a new two-year contract.\n The new feature phone OS removed the web-based and social networking integration features such as Kin Loop, Kin Spot, and Kin Studio.  [29] The newer &#34;m&#34; phones (identified by &#34;m&#34; next to the model number and two yellow dots on the corners) could be &#34;downgraded&#34; to the original firmware version via holding &#34;r&#34;, &#34;b&#34;, and &#34;power&#34; upon turning on the device (a procedure that also erases all the phone&#39;s stored data and settings).\n The kin.com website was discontinued on January 2011, and all user pictures and other information stored on the website were deleted. Verizon offered a free trade-in to a  3G smartphone to all affected phone owners.  [30] After the Kin website shut down, the original Kin ONE and TWO lost access to the same social features that were removed from the ONEm and TWOm, making them also essentially feature phones that did not require a data plan.\n  Microsoft described Kin devices as &#34;social phones&#34;,  [4] straddling the  feature phone and smartphone markets, with an emphasis on  social networking and sharing of content, but without downloadable apps or games.  [31]\n  The home screen on Kin was called  Loop, and served as an  aggregator for social networking connections from  Facebook,  Twitter,  Windows Live, and  MySpace as well as web content from  web feeds.\n Commentators noted Loop&#39;s 15-minute delay for updates, which CNET&#39;s  Ina Fried described as &#34;odd&#34;.  [32]  PC World argued this delay was at odds with Microsoft&#39;s claim that the phone is &#34;always-connected&#34;.  [33] Users could not adjust this interval,  [34] although updates could be manually triggered with an on-screen refresh button, or locking then unlocking the phone. [   citation needed] Microsoft cited battery life and immature social networking  APIs as reasons for the delay;  Engadget speculated that Microsoft may have been using the delayed messaging to encourage Verizon to offer lower-priced data plans, which would be attractive to the platform&#39;s teenage target audience.  [35]\n Kin did not support uploading photos or videos to  Twitter.  [36] Retweets, direct messages, viewing single person updates, and opening Twitter links from the Loop were also not supported.  [34]\n  Spot was a feature that allowed users to add an  e-mail address or telephone number to an  SMS or  MMS, or to attach content (e.g., text, URLs or photos) to emails.  [34]\n The Spot was represented as an omnipresent colored dot near the bottom center of the screen. To add an address field, the user dragged a recipient&#39;s photo to the Spot, then clicked on the Spot, opening a page that allowed the user to create a new email, SMS or MMS.  [34]\n The Spot could also be used to set up  e-mail attachments, by the user dragging the content to the Spot, then dragged the recipient&#39;s photo to the Spot, after which an email could be sent containing those attachments.  [34] However, Kin did not support attachments to non-e-mail media such as MMS and could not be used to send content to social media sites.  [34]\n  Content from the Kin phone, such as photos, videos and messages, was automatically synchronized to a  cloud service called  Kin Studio, and would then be accessible via a browser on other devices. The Kin Studio website was written in  Silverlight and its appearance was similar to the Kin UI, even including a Spot for sharing content.  [37] Kin Studio was shut down in January 2011.\n   The Kin ONE had a five- megapixel camera with  standard-definition video recording capabilities. The Kin TWO included an eight-megapixel camera with  720p video recording. Photos were automatically  geocoded on the original phones, a feature disabled on the &#34;m&#34; phones.  [38] There was no photo editing software for Kin.  [39]\n  For media, Kin devices synced with  Zune desktop software. In addition, the phones were compatible with  Zune Pass. Much like contemporaneous Zune devices, Kin phones could also stream music over a WiFi connection in addition to 3G on the carrier&#39;s network.  [40] For Mac users, Microsoft, in collaboration with Mark/Space, provided a media syncing tool that pulled audio and video files from  iTunes and photos from  iPhoto.  [37] Kin did not support playing video from sites such as  YouTube or  Hulu, although the devices could watch  YouTube videos from the browser through WiFi or 3G.  [41] [   clarification needed]\n  Kin had no  app store and no third-party  apps could be installed on the phones.  [41]   PC World described this as &#34;baffling&#34;.  [33] Further, the web browser did not support  Flash web applications,  [42] and there were no games for the phones.  [42] Microsoft had stated their intention to eventually merge the Kin and Windows Phone platforms, with downloadable apps then being available for the combined platform.  [43]\n   Contact lists could only be copied from another phone by Verizon store employees. There was no way for the consumer to do this by any known means ( over the air, via a memory or  SIM card, wirelessly via  Bluetooth and  vCard, or via direct USB cable connection).\n Kin had no calendar or appointment application,  [41] nor any ability to sync with  Outlook calendar or  Google Calendar.  [36] Some commentators suggested that a social phone should be able to share a social events calendar.  [36]\n Kin was unable to  Instant Message (IM), or use any IM client,  [41] which was considered odd for a phone built for messaging and aimed at the youth market.  [36] It was discovered that the  ROM inside the phones contained the foundation for an IM system supporting  AOL Instant Messenger,  Windows Live Messenger, and  Yahoo! Messenger, but it was never made operational. It was speculated that future revisions of the software would have enabled instant messaging.  [44]\n  In the  United States, cellular telephone provider  Verizon Wireless sold the Kin phones with a voice plan starting at $39.99 per month. An optional  Zune Pass cost $14.99 per month for music access.  [45]\n After the kin.com website was discontinued in January 2011, the original Kin ONE and Kin TWO did not require a data plan, although the optional  Zune Pass was still available.\n  The Microsoft Kin has been described as a &#34;close cousin&#34; to  Windows Phone,  [46] with shared user interface characteristics. According to Microsoft:\n &#34;Both KIN and Windows Phone share common OS components, software and services. We will seek to align around a single platform for both products as well as consistent hardware specifications.&#34;  [46]\n Microsoft said that the underlying fundamentals of Kin and  Windows Phone were held together by similar core technologies. Both operating systems ran the same  Silverlight platform,  [46] with Microsoft&#39;s stated intention being to eventually merge Windows Phone with Kin.  [43]\n  In November 2010, Microsoft and Verizon re-launched the Kin phones, re-labeling them as feature phones with no required data plan. The prices of the phones also were slashed. Where the Kin TWO was formerly $100 on a two-year contract, the new Kin TWOm was offered at $20 on contract. Similarly, the Kin ONE, formerly $50 on a contract, was now $0 on contract.\n The new firmware on the repurposed &#34;m&#34; phones removed several data-centric features of the operating system, including many of the devices&#39; social elements such as the Loop home screen, the Spot, and access to the Kin Studio cloud storage site, which was shut down in January 2011. With the lack of a data plan requirement and lower prices up front, Microsoft and Verizon hoped to do what they originally planned: capture the teenage market.\n  One seemingly data-laden feature of the old Kin devices which remained available for the repurposed phones was  Zune Pass, although it was now able to stream music only over Wi-Fi, even when customers had 3G data enabled, to conserve data. This was done to accommodate Verizon&#39;s new tiered data plans, which marked the end of unlimited data for users.\n Users were also able to sync music, podcasts, TV shows, and movies to their Kin phones through the Zune software. Music could be downloaded directly to the phones as well, though only over Wi-Fi. Podcasts, TV shows, and movies could only be synced to the phone via the Zune Software on a Windows PC.\n  The &#34;m&#34; series added a calendar and a calculator application, to address complaints that these were missing functions that even the most basic feature phone typically has. Although the calendar application had basic features such as timed alerts and reminders, as well as day, month, and year views, it could not be synchronized with  Microsoft Outlook,  Microsoft Exchange, or even  Windows Live  Hotmail.\n  Along with the discontinued social networking features, the phones no longer  geocoded pictures. Other features missing on the original version continued to be absent, including disallowing Bluetooth access for  file transfer and  wireless printing.\n The Kin TWOm was unable to forward previously sent messages. Text messages were sent in a chat style format, making it unable to single out a specific text message.\n  &#34;The KIN uses a proprietary browser made specifically for the KIN. No other browsers can be used or downloaded. Silverlight was used for the creation of the KIN studio, not the browser.&#34;  [47] The browser identified itself as &#34;IEMobile 6.12.&#34; The full user agent string was:\n      Kin Studio, Kin Loop, and GPS software on Kin Two; removed from Kin TwoM (services are no longer available)\n    ^   Priya Ganapati (2 April 2010).  &#34;Hands-On: Can Kin Phones Make Microsoft Cool Again?&#34;. wired.com .\n ^     a     b     c     d    &#34;Microsoft Ushers in the Next Generation of the Social Phone With KIN, a New Windows Phone&#34; (Press release). Microsoft. 12 April 2010. Archived from  the original on 2010-04-15 .\n     ^     a     b    &#34;Verizon returns unsold Kin phones, pulls online sales, July 18, 2010&#34;. Electronista.com. July 18, 2010. Archived from  the original on May 17, 2013 .\n  ^   Sydney Myers (2011-08-27).  &#34;Verizon discontinues KIN TWOm, making room for the KIN ONEm on our Top Messaging Phones list&#34;.  PhoneDog .\n   ^   Om Malik (12 February 2008).  &#34;How Much Did Microsoft Pay For Danger?&#34;.   GigaOM .\n  ^   Mary-Jo Foley (24 September 2009).  &#34;Microsoft Pink: &#39;Just a Sidekick&#39; or more?&#34;.   ZDNet .\n ^   Daniel Eran Dilger (12 October 2009).  &#34;Microsoft&#39;s Sidekick/Pink problems blamed on dogfooding and sabotage&#34;.   AppleInsider .\n ^     a     b    &#34;Microsoft&#39;s Pink Struggles Spill Over To Sidekick&#34;.  ChannelWeb.  UBM Channel. 12 October 2009. Archived from  the original on 20 July 2010 .\n  ^   Fried, Ina (2010-04-05).  &#34;Microsoft&#39;s mystery event revealed | Beyond Binary - CNET News&#34;. News.cnet.com .\n ^   Fried, Ina (2010-04-12).  &#34;Microsoft launches Kin phones (live blog) | Beyond Binary - CNET News&#34;. News.cnet.com .\n  ^   Ashlee Vance (4 July 2010).  &#34;Microsoft Calling. Anyone There?&#34;.  The New York Times .\n ^   Helft, Miguel (June 30, 2010).  &#34;Microsoft Kin Discontinued After 48 Days&#34;.  The New York Times .\n ^   Helft, Miguel (30 June 2010).  &#34;Microsoft Kin Discontinued After 48 Days&#34;.   The New York Times .\n    ^   Lowensohn, Josh (2010-11-19).  &#34;Kin&#39;s quiet return a rarity among failed gadgets | Microsoft - CNET News&#34;. News.cnet.com .\n ^   Hollister, Sean (2010-12-11).  &#34;Kin Studio closing January 31st, Verizon offers free phones to affected customers&#34;. Engadget.com .\n    ^     a     b     c     d     e     f     g   Joshua Topolsky (5 May 2010).  &#34;Microsoft Kin One and Two review&#34;.  Engadget.\n ^   Hollister, Sean (13 April 2010).  &#34;Microsoft Kin notifications have up to fifteen minute delay&#34;.   Engadget.  Weblogs, Inc. .\n ^     a     b     c     d   Mies, Ginny (12 April 2010).  &#34;Microsoft Kin Two: Stylish, but Missing Some Key Features&#34;.   The Washington Post.  PCWorld .\n ^     a     b    Thurrott, Paul (12 April 2010).  &#34;Microsoft KIN: Notes from the launch&#34;.  Windows Phone Secrets .\n ^    &#34;Microsoft Kin One and Kin Two: Specs and perspective&#34;.  Mobile Magazine. 13 April 2010. Archived from  the original on 17 April 2010 .\n  ^   Buchanan, Matt (12 April 2010).  &#34;Microsoft Kin: The Perfect Phone for Sidekick Fans&#34;.   Gizmodo.  Gawker Media .\n ^     a     b     c     d   Zeman, Eric (12 April 2010).  &#34;First Impressions Of Microsoft&#39;s Kin Platform&#34;.   InformationWeek. UBM TechWeb .\n     ^     a     b     c    &#34;Windows Phone 7 and KIN Closer Cousins Than Thought&#34;. Phone Scoop. 12 May 2010. Archived from  the original on 31 January 2013.\n  ^     a     b    &#34;Microsoft launches the Kin!&#34;.  Tegra Developer Zone (Press release). nVidia. 13 April 2010. Archived from  the original on 16 April 2010 .\n ^     a     b    &#34;Microsoft&#39;s Kin are the first Tegra smartphones&#34; (Press release). PC World. 12 April 2010 .\n ^     a     b    &#34;Zune HD specs including Tegra Details&#34; (Press release). PC World And Windows. 19 August 2009 .", "posttime": "2021-08-02 15:27:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,kin", "title": "微软健", "title_en": "Microsoft Kin", "transed": 1, "url": "https://en.wikipedia.org/wiki/Microsoft_Kin", "via": "", "real_tags": ["microsoft", "微软", "kin"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个页面上，我从我的 .bash_aliases 文件中收集了一些选定的点点滴滴。除了本网站上提供的一些黑客和脚本选择外，这些是我在用我的电脑放屁时最常使用的自制装置。我相信这是从 *BSD 世界偷来的一个漂亮的小块。在 systemd Linux 安装上，这将使计算机进入睡眠状态。 # system health informationalias inf=&quot;uname -sr &amp;&amp; uptime| sed &#39;s/ //&#39; &amp;&amp; sensor|grep Pack &amp;&amp; \\ lscpu|grep &#39;CPU MHz:&#39; &amp;&amp; acpi &amp;&amp; \\ echo -n &#39;Memory in use:&#39; &amp;&amp; free -m|grep Mem|\\ awk &#39;{print \\$3+\\$5\\&quot; megs\\&quot;}&#39;&quot; 这将显示正常运行时间、CPU 温度、当前 CPU 频率、电池状态和 RAM 使用情况。使用的各种命令在平台和发行版之间会有所不同。示例输出：Linux 5.4.0-72-generic00:05:42 up 3 days, 9:36, 4 users, load average: 0,05, 0,10, 0,09Package id 0: +39.0°C (high = +105.0°C, crit = +105.0°C)CPU MHz: 1152.108Battery 0: 不充电, 100%Memory in use: 947 megs 这仅列出当前工作目录中的目录。来自 Amiga 方面，它是荒谬的是，这是多么不直观。 dir dirs，有人吗？但你知道这句话怎么说的：“伯克利有两种主要产品：LSD 和 UNIX。我们不认为这是巧合。”现在我已经设法将它们结合起来！列出、解压并创建 .tgz 档案。为什么要使用 atar？我不记得了，但现在我已经习惯了。\n# show posix 命令参考function posix { if [ -z &quot;$1&quot; ];然后 (dillo &quot;$HOME/docs/posix-2018/idx/utilities.html&quot; &gt;/dev/null &amp;) else HTMLFILE=&quot;$HOME/docs/posix-2018/utilities/$1.html&quot; if [ -s &quot; $HTMLFILE&quot;]; then (dillo &quot;$HTMLFILE&quot; &gt;/dev/null &amp;) else echo &quot;No matching file for &#39;$1&#39;&quot; fi fi} 使用 Dillo 查看所有 POSIX shell 命令的列表，或单个命令的 POSIX 文档。我已经从这里下载了官方文档（个人免费使用）并将其解压到我的主目录中，这样我就可以使用 posix awk 来阅读非常全面的 awk 描述。该文档通常比手册页好得多，并且包含实际有用的示例。 # 做个笔记功能笔记 { if [ -z &quot;$1&quot; ];然后回显“没有输入笔记。” else echo &quot;$@&quot; &gt;&gt; &quot;$HOME/docs/_line_notes&quot; fi}# display notesfunction notes { FN=&quot;$HOME/docs/_line_notes&quot; if [ ! -f &quot;$FN&quot; ];然后回显“没有笔记（文件丢失）。”返回 fi if [ -z &quot;$1&quot; ];然后 LINECOUNT=&quot;10&quot; else LINECOUNT=&quot;$1&quot; fi LNUM=$(wc -l &quot;$FN&quot;|cut -d &quot; &quot; -f1) echo &quot;显示 $LNUM 笔记的最大 $LINECOUNT。&quot; tail &quot;$FN&quot; -n &quot;$LINECOUNT&quot;}# 清除所有notesfunction clearnotes { rm &quot;$HOME/docs/_line_notes&quot; touch &quot;$HOME/docs/_line_notes&quot;} 使用note，我可以像这样做一个快速的笔记： $注意 hjalfi asm 1:20 这将表明我已经观看了一个小时二十分钟的 Hjalfi 为宇宙飞船编写了一个汇编程序和模拟器，这样我就知道下次在哪里继续观看，只需输入：$ notes 非常漂亮！", "note_en": "On this page I&#39;ve gathered some selected bits and pieces frommy  .bash_aliases file. Apart from the selection of hacks and scripts available on this site,these are the homemade contraptions I use most frequently when fartingaround with my computer.\n     A nifty little piece I believe to be stolen from the *BSD world.On a systemd Linux installation, this will put the computer to sleep.\n  # system health informationalias inf=&#34;uname -sr &amp;&amp; uptime| sed &#39;s/ //&#39; &amp;&amp; sensors|grep Pack &amp;&amp; \\ lscpu|grep &#39;CPU MHz:&#39; &amp;&amp; acpi &amp;&amp; \\ echo -n &#39;Memory in use: &#39; &amp;&amp; free -m|grep Mem|\\ awk &#39;{print \\$3+\\$5\\&#34; megs\\&#34;}&#39;&#34;\n This will show the uptime, CPU temperature, current CPU frequency,battery status and RAM usage. The various commands used will differsomewhat between platforms and distributions. Example output:\n Linux 5.4.0-72-generic00:05:42 up 3 days, 9:36, 4 users, load average: 0,05, 0,10, 0,09Package id 0: +39.0°C (high = +105.0°C, crit = +105.0°C)CPU MHz: 1152.108Battery 0: Not charging, 100%Memory in use: 947 megs\n   This lists just the directories in the current working directory.Coming from the  Amiga side of things,it&#39;s preposterous how unintuitive this is.  dir dirs, anyone?But you know how the saying goes: &#34;There are two major products to come out of Berkeley: LSD and UNIX. We don&#39;t believe this to be a coincidence.&#34;Now I have managed to combine them!\n   Lists,  unpacks and cre ates .tgz archives.Why  atar? I don&#39;t remember, but now I&#39;m used to it.\n    # show posix command referencefunction posix { if [ -z &#34;$1&#34; ]; then (dillo &#34;$HOME/docs/posix-2018/idx/utilities.html&#34; &gt;/dev/null &amp;) else HTMLFILE=&#34;$HOME/docs/posix-2018/utilities/$1.html&#34; if [ -s &#34;$HTMLFILE&#34; ]; then (dillo &#34;$HTMLFILE&#34; &gt;/dev/null &amp;) else echo &#34;No matching file for &#39;$1&#39;&#34; fi fi}\n Use  Dillo to view eithera list of all POSIX shell commands, or the POSIX documentation fora single command. I&#39;ve downloaded the official documentation from here(it&#39;s free for personal use) and keep it unpacked in my home directory,so I can just use  posix awk to read a very comprehensivedescription of awk. This documentation is often much better than man pagesand contains actually useful examples.\n  # take a notefunction note { if [ -z &#34;$1&#34; ]; then echo &#34;No note entered.&#34; else echo &#34;$@&#34; &gt;&gt; &#34;$HOME/docs/_line_notes&#34; fi}# display notesfunction notes { FN=&#34;$HOME/docs/_line_notes&#34; if [ ! -f &#34;$FN&#34; ]; then echo &#34;No notes (file missing).&#34; return fi if [ -z &#34;$1&#34; ]; then LINECOUNT=&#34;10&#34; else LINECOUNT=&#34;$1&#34; fi LNUM=$(wc -l &#34;$FN&#34;|cut -d &#34; &#34; -f1) echo &#34;Showing max $LINECOUNT of $LNUM notes.&#34; tail &#34;$FN&#34; -n &#34;$LINECOUNT&#34;}# clear all notesfunction clearnotes { rm &#34;$HOME/docs/_line_notes&#34; touch &#34;$HOME/docs/_line_notes&#34;}\n Using  note, I can make a quick note like so:  $ note hjalfi asm 1:20 which will indicate that I&#39;ve watched one hour and twenty minutesof  Hjalfi writes an assembler and emulator for a spaceship,so that I know where to  continue watching next timeby simply typing:  $ notes Pretty nifty!", "posttime": "2021-08-02 15:27:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bashrc,quot", "title": "最好的 .bashrc", "title_en": "Best of .bashrc", "transed": 1, "url": "https://www.datagubbe.se/bestofbash/", "via": "", "real_tags": ["bashrc", "quot"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071112, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所以最近我花了大量时间离线或使用不可靠的互联网（旅行：叹息：）。所以，我一直在 IPFSing 一些有助于离线访问的代码文档。 IPFS 的 TLDR 是一个内容寻址系统，这意味着它不关心内容的托管位置；只是什么托管。这使得备份最新版本的网站以供离线访问非常容易，还有许多其他优点。离线时，直到 http://github.com/ipfs/go-ipfs/issues/8245 被弄清楚，这些 URL 中的任何一个的域都必须设置为最新的 CID（内容 ID（有点像哈希） )) 在 /ipfs/&lt;CID&gt; 而不是 /ipns/&lt;domain&gt;，除非您的 DNS 脱机工作。以下所有网站暂时由我手动更新，因此，它们可能会滞后（每隔几天），直到我能找到自动化来做到这一点。我也想 IPFS https://cht.sh，但它似乎是一个我还没有接触过的更复杂的系统。如果我早点意识到我的情况，我会下载所有的 cheat.sh，但我没有 :( IETF - 最常见的 RFCs /ipns/ietf.karmanyaah.malhotra.cc，也在 Gemini 上我只是 rsynced rfc -editor.org 并且格式相同。我有一些更好的想法，例如，URL 不是 /bcp/bcp1234.html，而是 /html/bcp/1234，但我还没有开始编写所有脚本TLDR - 手册页但更简单将整个 repo 缓存在本地 IPFS 节点上的另一个优点是新的查找速度更快。以下可以添加到您的 shell 初始化文件（例如 ~/.bashrc）中。这会将 TLDR URL 设置为您的本地 IPFS 实例；同时禁用缓存，因为 IPFS 无论如何都是完美的*缓存。\nArch Wiki - 最好的 GNU/Linux Wiki（最好的发行版/社区（有争议？下面的评论部分））/ipns/archwiki.karmanyaah.malhotra.cc 在调试系统设置和 Linuxy 方面总是有用的，不仅适用于 Arch，还适用于其他系统。我正在使用 Arch Wiki Docs，它与用于生成 Arch 包 arch-wiki-docs 的脚本相同。这个过程有一些问题——最明显的是链接不起作用——但如果有人有更好的下载脚本，我愿意尝试一下。这些文档不是我作为该项目的一部分托管的，而是在 IPFS 上的，这非常好。 Unifiedpush.org - 尊重推送通知的自由规范（和实现） /ipns/unifiedpush.org + F-Droid Repo /ipns/repo.unifiedpush.org 这由我托管在同一台服务器上，但它是 S1m（ @sim_g:matrix.org)（UnifiedPush 的主要开发者）在我第一次帮助建立这个网站时向我介绍了 IPFS；在这个文档项目之前很长一段时间。这本机托管在 IPFS 上。 jargon.karmanyaah.malhotra.cc - “行话文件，黑客俚语的综合纲要，阐明了黑客传统、民间传说和幽默的许多方面。”您可能已经注意到，其中许多站点也通过 HTTP 或 Gemini 提供服务。这和固定到服务器上的 IPFS 是由检查 IPNS 地址上最新 CID 的 cron 作业完成的。如果 CID 不同，它会将站点添加到 MFS（稍后会详细介绍）并替换 /srv/ 目录中此数据的副本。然后，这些文件由 Caddy 和 gmnisrv 提供。所有这一切都由这个 Ansible playbook 使用这里的主脚本模板部署。当我在 Mastodon 上吹嘘要设置单个镜像时，@mala@mastodon.social 回应了有关将 IETF 镜像固定在 Estuary 的建议。 Estuary 是一项 Filecoin 服务，目前只接受邀请，似乎对公共数据集是免费的。 mala@mastodon.social 也收到了我的邀请。使用现有的 IPFS 资源很容易，我只是编写了一个脚本来调用 add-ipfs api 端点，最终将 CID 保存到 Filecoin 上，通过 IPFS 检索它。该脚本可以在 repo 中找到。虽然没有太多切线，但我认为 Filecoin 是一个非常有趣的想法，具有很大的潜力，我希望它能够像其他一些愚蠢的加密货币一样传播开来，这些加密货币会无缘无故地浪费资源并抬高价格。\n在以下解决方案之前，对于我的个人网站，我尝试将 DNSLink 指向 IPNS，然后指向 IPFS；虽然它确保内容非常容易更新，但解析速度非常慢。当发布者离开时，这可能是完全 p2p 命名方案的本质的基础；也许只是缺乏实施；我不知道，我对这个领域的了解还不够，无法提供帮助。所以，我切换到另一个选项。我基本上使用以下脚本来发布我的 IPFS DNSLink。请注意，以下内容被修剪为具有教育意义，真实版本可以在 repo 中找到。 DOMAIN 和 DIR 是这里的输入。前提是该 DNSLink 记录应该已经存在。 cloudflare 访问令牌和区域 ID 存储在 Bitwarden 中并使用 rbw 访问。 BW_ENTRY =cloudflare_malhotra.cc_token LOC = &quot;/website/ $DOMAIN &quot; # 在 MFS 中存储的位置 CID = $(ipfs add $DIR -rpQ --pin = false --cid-version =1 $CUSTOM_IPFS_ADD_OPTIONS ) if ipfs files ls - l &quot; $LOC &quot; | grep -q $CID ;然后 echo 已经将 $CID 添加到 $LOC else echo 添加 $CID 到 $LOC ipfs files cp /ipfs/ $CID &quot; $LOC / $( date +%F_%T ) &quot; fi RECORD_DOMAIN = &quot;_dnslink. $DOMAIN &quot; # password是令牌，自定义字段用于区域 SECRETS = &quot; $(rbw get $BW_ENTRY --full ) &quot; CLOUDFLARE_TOKEN = &quot; $( echo &quot; $SECRETS &quot; | head -n 1 ) &quot; ZONE_ID = &quot; $( echo &quot; $SECRETS &quot; | grep -i zone | cut -d &#39; &#39; -f 2 ) &quot; function curl { curl -s -H &quot;Authorization: Bearer $CLOUDFLARE_TOKEN &quot; -w &#39;\\n&#39; -H &quot;Content-Type:application/json&quot; $@ } RECORD_ID = $(curl &quot;https://api.cloudflare.com/client/v4/zones/ $ZONE_ID /dns_records?name= $RECORD_DOMAIN &quot; | jq &quot;.result[0].id&quot; -r )curl &quot;https ://api.cloudflare.com/client/v4/zones/ $ZONE_ID /dns_records/ $RECORD_ID &quot; -X PATCH --data &quot;{ \\&quot; content \\&quot; : \\&quot; dnslink=/ipfs/ $CID \\&quot; }&quot;这些 CID 也被添加到 MFS（go-ipfs 的可变文件系统）中，但没有固定。将它们放在 MFS 中可以确保它们不会被垃圾收集，但可以让我可以人类可读地删除非常旧的版本，而使用未命名的引脚可能会困难得多。但是，ATM，自 2021 年 5 月 22 日以来我网站的所有版本都使用不到 7 MB 的空间，因为 IPFS 对未更改的文件进行了重复数据删除。此外，多个版本的 IETF 文档（其中文件保持 99.9% 相同）仅消耗几兆字节的空间。从我的网站的角度来看，IPFS 提供了完美的方式来缓存 bust URL，并为 CSS 和 JS 资产提供完美的（即不可变的）浏览器缓存。它还为开发人员重新思考静态资产和 API 之间的区别提供了独特的机会；以及在很大程度上静态 API（对于多个用户相同）实际上可以无限地水平扩展。在 IPFS 上设置静态站点的开销目前远不止 rsync 或将文件 scping 到服务器，但我认为扩展潜​​力弥补了这一点（尽管不可否认，在个人博客的规模上，它甚至没有问题，但理想:叹:)。从互联网状况不佳的人的角度来看（我只能在这里推测，因为我家里有良好的互联网），随着 IPFS 的开销正在减少，希望它为人们提供了连接到其他方式无法拥有的资源的可能性。这对于实际的星际物质也可能有用（概念不是当前的实现）。如果公共站点（新闻、电影等）在 IPFS 上具有只读模式，那么一名宇航员或太空游客应该可以请求某事物，然后该事物在本地缓存，供以后可能需要它的另一个人使用，而不是而不是每次都必须从地球上一路请求。此外，随着最近的元素 - 协议实验室的事情，MSC2706 将根据他们的博客文章受到关注，这非常好。", "note_en": "So recently I spent a considerable amount of time offline or with unreliable internet (travelling :sigh:). So, I’ve been IPFSing a few code documentation things that could help with offline access.\n   The TLDR of IPFS is it’s a content addressed system, which means it doesn’t care  where the stuff is hosted; just  what is hosted. This makes it really easy to back up the latest version of a website for offline access, among  many other advantages.\n  When going offline, until  http://github.com/ipfs/go-ipfs/issues/8245 is figured out, the domain for any of these URLs will have to be set to the most current CID (Content ID (kinda the hash)) at /ipfs/&lt;CID&gt; instead of /ipns/&lt;domain&gt;, unless your DNS works offline.\n All of the following sites are updated manually for the time being by me so, they might lag behind (every couple of days) until I can figure out automation to do that.\n  I also want to IPFS  https://cht.sh, but it seems like a more complex system that I haven’t gotten around to. If I had realized my situation earlier I would’ve downloaded all of cheat.sh, but I didn’t :(\n IETF - Most commonly known for RFCs   /ipns/ietf.karmanyaah.malhotra.cc, also on  Gemini  I just  rsynced rfc-editor.org and the formatting is the same. I have some better ideas, for example instead of URLs being /bcp/bcp1234.html, it could be /html/bcp/1234, but I haven’t gotten around to scripting all that yet.\n TLDR - Man Pages but simpler  An additional advantage of having the whole repo cached on a local IPFS node, is that new lookups are wayyy faster. The following can be added to your shell initialization file (e.g. ~/.bashrc).  This sets the TLDR URL to your local IPFS instance; also disabling the cache since IPFS is the perfect* cache anyways.\n Arch Wiki - The best GNU/Linux Wiki (for the best Distro/Community (controvertial? comments section below))   /ipns/archwiki.karmanyaah.malhotra.cc  Always useful in deubgging system setup and Linuxy things for not only Arch, but also other systems. I’m using   Arch Wiki Docs which is the same script used to generate the Arch package  arch-wiki-docs. There are some problems with this process - most notably links don’t work - but if someone has a better downloader script, I would be willing to try it.\n  These are docs that are not hosted by me as part of this project, but are on IPFS which is very nice.\n unifiedpush.org - A spec (and implementations) for freedom respecting push notifications   /ipns/unifiedpush.org + F-Droid Repo  /ipns/repo.unifiedpush.org  This  is being hosted by me on the same server, but it was S1m (@sim_g:matrix.org) (main UnifiedPush developer) who introduced me to IPFS when I was first helping build this website; a long time before this documentation project. This is natively hosted on IPFS.\n  jargon.karmanyaah.malhotra.cc - ‘Jargon File, a comprehensive compendium of hacker slang illuminating many aspects of hackish tradition, folklore, and humor.’  mirror of the original one\n  As you might have noticed, many of these sites are also served over HTTP or Gemini. This, and the IPFS pinning onto a server is done by a cron job which checks for the latest CID on the IPNS address. If the CID is different, it adds the site to MFS (more info later) and replaces the copy of this data in the  /srv/ directory. Then, those files are served by Caddy and gmnisrv. All of this is deployed by  this Ansible playbook with the main  script template here.\n  While I was tooting on Mastodon about individual mirrors being set up,  @mala@mastodon.social responded with a suggestion about pinning the IETF mirror on  Estuary. Estuary is a Filecoin service that’s currently invite only and it seems to be free for public datasets. mala@mastodon.social also got me an invite for it. It’s easy enough to use with existing IPFS resources, I just wrote a script that calls the  add-ipfs api endpoint which eventually saves the CID onto Filecoin, retreiving it over IPFS. The script can be found  here in the repo.\n While not going on too much of a tangent, I think Filecoin is a very interesting idea with a lot of potential, and I hope it goes viral unlike some other stupid cryptocurrencies that waste resources and drive up prices for no reason  coughchia cough.\n  Before the following solution, for my personal websites, I tried pointing DNSLink to IPNS and then that to IPFS; while it made sure the content was super easy to update, it was extremely slow to resolve. Maybe it’s fundamental to the nature of a fully p2p naming scheme when the publisher goes away; maybe the implementation is just lacking yet; I don’t know, and I don’t know enough about this field to be able to help. So, I switched to the other option. I use essentially the following script to publish my IPFS DNSLink. Note the following is trimmed to be educational, the real version can be found  in the repo.  DOMAIN and  DIR are the inputs here. Preconditions are that that DNSLink record should already exist. The cloudflare access token and zone id is stored in Bitwarden and accessed with  rbw.\n BW_ENTRY =cloudflare_malhotra.cc_token LOC = &#34;/website/ $DOMAIN &#34;  # location to store in MFS CID = $(ipfs add  $DIR  -rpQ  --pin = false  --cid-version =1  $CUSTOM_IPFS_ADD_OPTIONS ) if ipfs files  ls  -l  &#34; $LOC &#34; |  grep  -q  $CID ;  then  echo already added  $CID to  $LOC else  echo adding  $CID to  $LOC ipfs files  cp /ipfs/ $CID  &#34; $LOC / $( date +%F_%T ) &#34; fi RECORD_DOMAIN = &#34;_dnslink. $DOMAIN &#34; # password is token and the custom field is for zone SECRETS = &#34; $(rbw get  $BW_ENTRY  --full ) &#34; CLOUDFLARE_TOKEN = &#34; $( echo  &#34; $SECRETS &#34; |  head  -n 1 ) &#34; ZONE_ID = &#34; $( echo  &#34; $SECRETS &#34; |  grep  -i zone |  cut  -d  &#39; &#39;  -f 2  ) &#34; function curll  { curl  -s  -H  &#34;Authorization: Bearer  $CLOUDFLARE_TOKEN &#34;  -w  &#39;\\n&#39;  -H  &#34;Content-Type:application/json&#34;  $@ } RECORD_ID = $(curll  &#34;https://api.cloudflare.com/client/v4/zones/ $ZONE_ID /dns_records?name= $RECORD_DOMAIN &#34; | jq  &#34;.result[0].id&#34;  -r )curll  &#34;https://api.cloudflare.com/client/v4/zones/ $ZONE_ID /dns_records/ $RECORD_ID &#34;  -X PATCH  --data  &#34;{ \\&#34; content \\&#34; : \\&#34; dnslink=/ipfs/ $CID \\&#34; }&#34;\n These CIDs are also added to the MFS ( go-ipfs’s Mutable File System) but are not pinned. Having them in the MFS makes sure they won’t be garbage collected, but makes it so I can human-readably remove extremely old versions whereas with unnamed pins that can be much more difficult. Though, ATM, all versions of my website since May 22 2021 use just under 7 MB of space because the unchanged files are deduplicated by IPFS. Also, multiple versions of the IETF documents - where files remain 99.9% the same - consume barely a few megabytes more space.\n  From the perspective of my website, IPFS provides the perfect way to cache bust URLs and have perfect (i.e. immutable) browser caches for CSS and JS assets. It also provides a unique oppurtunity for developers to rethink the difference between static assets and API; and how largely static APIs (same for multiple users) could be practically infinitely horizontally scaled. The overhead for setting up a static site on IPFS is currently much more than just  rsync or  scping the files to the server, but I think the scaling potential makes up for that (though admitedly at the scale of a personal blog it doesn’t even matter, but ideals :sigh:).\n From the perspective of someone with bad internet (I can only speculate here because I have good internet at home), as the overhead of IPFS is being reduced, hopefully it opens up possibilties for people to connect to resources they couldn’t otherwise have. This also could be useful (the concept not the current implementation) for actual interplanetary stuff. If common sites (news, movies etc) have a read-only mode on IPFS, it should be possible for one astronaut or space tourist to request a thing, and then that thing be locally cached for another person who might need it later, rather than having to request all the way from Earth each time.\n Additionally with the recent Element - Protocol Labs thing,  MSC2706 will be getting attention according to their blog post, which is very nice.", "posttime": "2021-08-02 14:25:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ipfsify,ipfs", "title": "IPFSify 文档", "title_en": "IPFSify Documentation", "transed": 1, "url": "https://karmanyaah.malhotra.cc/tech/2021/07/ipfsifying-documentation/", "via": "", "real_tags": ["ipfsify", "ipfs"]}, {"category": "", "categoryclass": "", "imagename": "859d6694bf7846ac26f1a87cd95c07b5.jpg", "infoid": 1071110, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在提交给印度市场监管机构的文件中，PolicyBazaar 表示，它希望通过发行新股筹集 5.04 亿美元，其余资金将通过现有投资者出售股份来推动。这家拥有 12 年历史的初创公司——由软银、Falcon Edge Capital、Tiger Global 和 InfoEdge 支持——表示可能会考虑在 IPO 前一轮融资中筹集约 1 亿美元。他们在文件中表示，软银计划出售价值超过 2.5 亿美元的股票，而 PolicyBazaar 创始人则希望出售价值 5270 万美元的股票。 PolicyBazaar 作为一个聚合器，允许用户在其网站上比较和购买来自数十家保险公司的保单——包括人寿、健康、旅行、汽车和财产等类别，而无需通过传统代理商。它在印度和中东开展业务。在印度，目前该国 13 亿人口中只有一小部分人可以获得保险，一些分析人士表示，数字公司对于将这些服务带给大众来说可能至关重要。根据评级机构 ICRA 的数据，截至 2017 年，保险产品覆盖的人口不到 3%。 据世界银行称，印度人的平均年收入约为 2,100 美元。 ICRA 估计，在购买保险产品的印度人中，他们在 2017 年的支出不到 50 美元。“印度人寿保险市场预计将以每年 18.8% 的速度增长，在 2030 财年达到 31.9 万亿卢比（4250 亿美元）在有利的宏观指标、金融产品和服务意识的提高、产品和流程的数字化和简化、在线分销渠道、产品创新和定制以及有利的政府政策和监管推动的推动下，”这家初创公司在论文中说。在今年年初的一份报告中，伯恩斯坦 (Bernstein) 的分析师估计 PolicyBazaar 占据在线保险分销市场 90% 的份额。该平台在印度与 Acko 和亚马逊竞争，还销售贷款、信用卡和共同基金。这家初创公司表示，它每月销售超过一百万份保单。\n“印度的保险市场渗透率不足。在渗透率不足的环境中，通过 Policybazaar 等网络聚合器进行的数字分发形成了不到 1% 的行业。这为增长提供了很大的空间，”伯恩斯坦分析师写信给客户。上个月首次公开亮相的 Zomato 以及金融科技公司 Paytm 和 MobiKwik 最近几周已申请首次公开募股。", "note_en": "In  papers submitted to the market regulator in India, PolicyBazaar said it is looking to raise $504 million by issuing new shares while the rest will be driven by sale of shares by existing investors.\n The 12-year-old startup — backed by SoftBank, Falcon Edge Capital, Tiger Global, and InfoEdge — said it may consider raising about $100 million in a pre-IPO round. Softbank plans to sell shares worth over $250 million, while PolicyBazaar founders are looking to sell shares worth $52.7 million, they said in the papers.\n  PolicyBazaar serves as an aggregator that allows users to compare and buy policies — across categories including life, health, travel, auto and property — from dozens of insurers on its website without having to go through conventional agents. It operates in India as well as the Middle East.\n  In India only a fraction of the nation’s 1.3 billion people currently have access to insurance and some analysts say that digital firms could prove crucial in bringing these services to the masses. According to rating agency ICRA, insurance products had reached less than 3% of the population as of 2017.\n An average Indian makes about $2,100 in a year, according to World Bank. ICRA estimated that of those Indians who had purchased an insurance product, they were spending less than $50 on it in 2017.\n “India’s life insurance market is expected to grow at 18.8% p.a. to reach ₹ 31.9 trillion (US$ 425 billion) in FY2030, driven by favorable macro indicators, rising awareness towards financial products and services, digitization and simplification of products and processes, online channels for distributions, innovations and customizations in products and favorable government policies and regulatory push,” the startup said in the papers.\n In a report early this year, analysts at Bernstein estimated that PolicyBazaar commands 90% of share in the online insurance distribution market. The platform, which competes with Acko as well as Amazon in India, also sells loans, credit cards and mutual funds. The startup says it sells over a million policies a month.\n “India has an under-penetrated insurance market. Within the under-penetrated landscape, digital distribution through web-aggregators like Policybazaar forms &lt;1% of the industry. This offers a large headroom for growth,” Bernstein analysts wrote to clients.\n Zomato, which had a  stellar public debut last month, as well as fintech firms Paytm and MobiKwik have filed for their initial public offerings in recent weeks.", "posttime": "2021-08-02 13:40:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "融资,online,印度", "title": "印度在线保险公司 PolicyBazaar 申请 IPO，寻求融资超过 8 亿美元", "title_en": "\n\t\t\t\tIndian online insurer PolicyBazaar files for IPO, seeks to raise over $800 million\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/01/indian-online-insurer-policybazaar-files-for-ipo-seeks-to-raise-over-800-million/", "via": "", "real_tags": ["融资", "online", "印度"]}]