[{"category": "", "categoryclass": "", "imagename": "44da347c376fb41fc6d18059b4a7b208.jpg", "infoid": 1066715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "©2020财富媒体IP Limited。 版权所有。 使用本网站构成接受我们的使用条款和隐私政策| CA通知收集和隐私声明| 不要出售我的个人信息| Ad Coolices财富是Fortune Media IP Limited的商标，在美国和其他国家/地区注册。 财富可能会收到本网站上的产品和服务的某些链接赔偿。 优惠可能如有更改，恕不另行通知。 引用延迟至少15分钟。 互动数据提供的市场数据。 ETF和Morningstar，Inc。提供的互联网数据Dow Jones术语＆amp; 条件：http：//www.djindexes.com/mdsidx/html/tandc/indexestandcs.html。 S＆amp; P索引数据是Chicago Mercantile Exchange Inc.及其许可方的财产。 版权所有。 条款＆amp; 使适应。 由交互式数据托管解决方案提供支持和实现。 ", "note_en": "© 2020 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our  Terms of Use and  Privacy Policy |  CA Notice at Collection and Privacy Notice |  Do Not Sell My Personal Information |  Ad Choices  FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by  Interactive Data. ETF and Mutual Fund data provided by  Morningstar, Inc. Dow Jones Terms &amp; Conditions:  http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html. S&amp;P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved.  Terms &amp; Conditions. Powered and implemented by  Interactive Data Managed Solutions.", "posttime": "2021-06-18 22:37:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ai,led,数据", "title": "Fiddler AI，它使工具帮助工程师监控机器学习系统，由Insight Partners领导的3200万系列 ", "title_en": "Fiddler AI, which makes tools to help engineers monitor machine learning systems, raises $32M Series B led by Insight Partners", "transed": 1, "url": "https://fortune.com/2021/06/17/fiddler-investment-explainable-ai/", "via": "", "real_tags": ["ai", "led", "数据"]}, {"category": "", "categoryclass": "", "imagename": "e0c3ea28a5aa92cd77885f5d0476b662.jpg", "infoid": 1066714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“我们最大的责任是为我们的......”媒体霸主！找到了剪辑，在这里分享它。评论：“虽然我们的民主是非常危险的...... ", "note_en": "\"Our greatest responsibility is to serve our...\" Media overlords!Found the clip, sharing it here.Reminder: \"While it is extremely dangerous to our democracy....", "posttime": "2021-06-18 22:36:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电台,local,剪辑", "title": "多个本地新闻电台说出来的逐字[视频] ", "title_en": "Multiple local news stations say the same thing verbatim [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=ksb3KD6DfSI", "via": "", "real_tags": ["电台", "local", "剪辑"]}, {"category": "", "categoryclass": "", "imagename": "415ada5a89d7ad9ed97697c7602f269e.jpg", "infoid": 1066713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数百年多年前，人们开发了巧妙的方法，以确保他们的信件窥探眼睛 - 他们只用纸张，粘合剂和褶皱来做。\n 晚上于1587年2月8日晚上，一个被监禁的玛丽女王苏格兰女王组成了她的最后一封信给她的姐夫。 ＆＃34;今晚，晚餐后，我一直在建议我的判决：我要像早上八个罪犯一样被执行，＆＃34;她写了。 ＆＃34;天主教的信仰和我的上帝的主张 - 赋予英国王冠的权利是我被谴责的两个问题。＆＃34;令她悲伤的接受她的命运，她让他照顾她的事务并支付她的仆人，祝他＆＃34;健康和漫长而幸福的生活＆＃34;\n 玛丽写完后写作后，她开始折叠信来保护其内容。她没有想要她的俘虏窥探 - 特别不是她表弟女王伊丽莎白I.然而，在1500年代没有使用信封 - 尤其是纸张昂贵 - 而且当时没有值得信赖的邮政局。\n 相反，玛丽从纸质边缘切割薄薄的条带，然后将她的信息折叠成一个小矩形。通过矩形戳刀子来制作一个洞，然后她通过搭配地带，循环它并收紧它几次，创造一个＆＃34;螺旋锁和＃34;不需要蜡或粘合剂，但很遗憾，如果有人试图潜行看起来，他们将不得不通过地带撕开，所以她的姐夫会知道这条消息已经被截获。\n  苏格兰苏格兰女王远离唯一熟练的艺术＆＃34的人; Letterlocking＆＃34; - 中世纪后期（1250-1500）和早期现代时期（1500-1815），这项技术在整个欧洲变得普遍。通过各种聪明模式的折叠和切割字母，人们试图隐藏他们与不需要的读者的对应，以及＆＃34;锁和＃34;来自无数类型。\n ＆＃34;这不是人们在特殊场合所做的一些特别的东西。这是您在发明信封之前发送信的方式，＆＃34;伦敦大学伦敦国王高校文学中的讲师Daniel Starza Smith。 ＆＃34;所以，如果它＆＃39; sa商业信，如果它＆＃39; sa love letter，如果它＆＃39; sa spy字母，如果它＆＃39; sa外交字母，他们＆＃39;重新使用戴克莱。所以它没有局限于专家，皇室或间谍大师的东西。任何能够发送信函的人都在使用亚太人。＆＃34;\n 但在现在，我们＆＃39;只有开始了解技术＆＃39;在历史中的重要性。近年来，明显被遗忘的封锁技巧的整个分类已经被发现。 \n当保守者Jana Dambrogio在意大利的梵蒂冈秘密档案馆中的文档缓存中砍伐时，戴锁的现代研究开始了。在2000年代初，她是来自档案馆外的第一名女子＆＃39;在那里允许在那里工作的保守实验室。在她的第一天，她获得了在1500年代后期的Fondo Veneto Sezione II上工作的机会，其中许多尚未修复地图，信件，法律和会计文件的高速缓存。\n 当她完成了她的保护工作时，Dambrogio并没有遵循写作，因为它通常在意大利语方言，但她确实注意到了剪纸，折痕和折叠纸。虽然可能弄错了对未经训练的眼睛造成的损害，但她意识到这是凭借戴克莱的证据。所以，她有条理地描述了她观察到了什么。\n  当Dambregio返回美国时 - 她现在在马萨诸塞州的麻省理工学院 - 那些原始文件的说明和模型将有用。 ＆＃34;梵蒂冈的数千个字母，但这少数人建模开始帮助我们构建戴克隆的语言，＆＃34;她解释道。\n 与Starza Smith连接后，她和她的同事开始寻求更多的遗传锁的例子，无论他们能找到它们，通常都隐藏在旧档案馆和博物馆收藏中。\n 几年前，他们遇到了一个特别丰富的赏金：整个行李箱从17世纪的欧洲富有2,600封信，已经未送达 - 其中577个未开封。\n  该系列已被一名已婚的邮政管理员和邮政信箱保存，称为Simon Brienne和Marie Germain，他住在荷兰。在1600年代，信件的收件人必须支付以获得它们，因此出于各种原因 - 贫困，搬迁或死亡 - 信件通常未能到达目的地。许多人有文字＆＃34; niet hebben＆＃34;在荷兰语中潦草地潦草地潦草地潦草地说，这意味着＆＃34;拒绝＆＃34;这对夫妇及其员工希望受到收件人最终壳牌的希望，因此昵称：“存钱罐”（Spaarpotje）。无意中，他们编制了这一时期最富有的耶利亚档案之一。\n 许多信件都是日常通信，但总的说，他们在1600年代绘制了欧洲生活的详细信息。 ＆＃34;这些信件代表了社会横截面的思想，关心和梦想：大使大使，公爵和公爵，商人，出版商和间谍有可能，也是演员和音乐家，普通恋人，挣扎难民，以及妇女以及男性，＆＃34;写一位研究该系列的研究人员。 \n除了他们发现的各种其他来源之外，Brienne系列已允许Dambrogio和Starza Smith确定在早期现代时代人们所知的一系列封锁技术。\n 随着时间的推移，这对编译了基本上是一个＆＃34;周期性表＆＃34;封锁。这包括至少18种不同的格式，从最简单的锁定 - 用蜡密封的滚动涡旋滚动 - 一旦密封有12个边缘的分组。根据如何抗篡改，它们还描述了是否具有狭缝或褶皱，以及锁定锁的安全性的属性。虽然一个确定的窥探器可能是可能的，但是在某些情况下，在某些情况下，在某些情况下难以选择，但别无选择，或者撕裂一张纸，或者明显地打破粘合剂的难度。\n  我最近在一个在麻省理工学院组织的研讨会上锁定了一封信，让A＆＃34;三角锁和＃34;这个特别的一个不是在Brienne系列中发现的，但是是从欧洲和英格兰的1700年代到1700年代使用的技术。\n 令人惊讶的是，我被这个过程的聪明才智击中了。我们从A4张纸和一些录像带开始，达摩码头通过台阶导致我们：＆＃34;从底部切断三角形......折叠短边的短边......不要折叠皱折弯曲它......用一点点狭缝，穿过小三角形。＆＃34;\n 我们最终看起来有点像这样。通过字母戳的三角形，然后折叠在边缘上并用胶水或蜡粘在一起。\n  您可以使用此视频演示或下面的Team＆＃39;如下图所示，尝试自己的三角锁。\n 图中的第二个（中间）是在Brienne收藏中的两个表兄弟之间的一封信中的模型，即最近的团队＆＃34;实际上展开＆＃34;使用X射线显微镜图。这意味着它们可以打开折叠而无需悬垂任何锁。 \n如果你想要一个真正的折叠挑战，第三个（底部）被称为＆＃34;匕首陷阱＆＃34;基于英国情报信，从意大利发出1601年，该算子和Starza Smith在英国国家档案。它是我们遇到的最安全，复杂，耗时的信件，我们遇到了最安全，复杂，耗时的信件;虽然它似乎是来自外面的简单褶皱的信，但它基本上是笨拙的困难，其中一个隐藏的纸条内部＆＃34;旅行＆＃34;打开时，揭示它已被解锁。 （这个视频步行可能有所帮助。）\n  今天，当人们考虑将他们的消息保持从窥探的眼睛中，他们倾向于专注于数字通信，例如＆＃34;端到端加密＆＃34; WhatsApp或信号等服务。但是，戴克莱斯表明，安全沟通的冲动比许多人更旧。\n ＆＃34;就像人类走过地球并想要记录一些东西，那里有一直需要有自由裁量权，＆＃34; Dambrogio说。古希腊人和埃及人使用密封件对通信和通知。和千年前的中奥泊托米亚的文件往往被封装在叫做大疱的粘土信封中。\n 篡改沟通的这些技巧有时甚至在关键历史事件中发挥了作用。当玛丽女王的苏格兰人锁定了她的上一封信时，她敏锐地意识到执政权力可能读到她的信息，并希望她的姐夫知道他们是否已经知道。毕竟，先前截获的信是她面临她的困境的原因：她被授权授权刺激伊丽莎白第一块。\n 此外，当时戴克莱成为一种新镜头，以查看历史，并以几个世纪以来我们寻求彼此相互联系的方式。作为Starza Smith指出了玛丽的重要性和＃39;最终行为的意义：＆＃34;人们经常说她在被执行之前的最后一件事就是写一封信。不对！她所做的最后一件事就是锁一封信。＆＃34;\n    通过在Facebook上喜欢我们加入一百万个未来的粉丝，或在推特或Instagram上关注我们。\n 如果您喜欢这个故事，请注册每周BBC.com功能时事通讯，称为“基本名单”。每周五，英国广播公司的未来，文化，工作期和旅行，文化，工作期和旅行，文化，工作期和旅行的精心挑选。 ", "note_en": "Hundreds of years ago, people developed ingenious methods to secure their letters from prying eyes – and they did it with only paper, adhesive and folds.\n Late at night on 8 February 1587, an imprisoned Mary Queen of Scots composed her  last ever letter to her brother-in-law. &#34;Tonight, after dinner, I have been advised of my sentence: I am to be executed like a criminal at eight in the morning,&#34; she wrote. &#34;The Catholic faith and the assertion of my God-given right to the English crown are the two issues on which I am condemned.&#34; With a sad acceptance of her fate, she asked him to take care of her affairs and pay her servants, wishing him &#34;good health and a long and happy life&#34;.\n After Mary had finished writing, she then began to fold up the letter to secure its contents. She didn&#39;t want her captors snooping – and particularly not her cousin Queen Elizabeth I. However, envelopes were not used in the 1500s – not least because paper was expensive – and there was no trustworthy postal service at the time.\n Instead, Mary cut a thin strip from the paper margin, before folding up her message into a small rectangle. After poking the knife through the rectangle to make a hole, she then fed the strip through, looping it and tightening it a few times, creating a &#34;spiral lock&#34;. No wax or adhesive was required, but crucially, if someone tried to sneak a look, they would have to rip through the strip, so her brother-in-law would know the message had been intercepted.\n  Mary Queen of Scots was far from the only person who was skilled in the art of &#34;letterlocking&#34; – the technique became common throughout Europe during the Late Middle Ages (1250-1500) and Early Modern periods (1500-1815). By folding and cutting letters in various clever patterns, people attempted to hide their correspondence from unwanted readers, and the &#34;locks&#34; came in myriad types.\n &#34;This isn&#39;t something special that people do on special occasions. This is how you send a letter before the envelope is invented,&#34; explains Daniel Starza Smith, a lecturer in Early Modern English literature at King’s College London. &#34;So, if it&#39;s a business letter, if it&#39;s a love letter, if it&#39;s a spy letter, if it&#39;s a diplomatic letter, they&#39;re all using letterlocking. So it&#39;s not something confined to experts, royalty or spy masters. Anyone who is capable of sending a letter is using letterlocking.&#34;\n But in the present day, we&#39;re only beginning to understand the technique&#39;s importance in history. In recent years, a whole taxonomy of apparently forgotten letterlocking tricks have been uncovered.\n    The  modern study of letterlocking began when the conservator Jana Dambrogio was leafing through a cache of documents in the Vatican Secret Archives in Italy. In the early 2000s, she had been the first woman from outside the archive&#39;s conservation laboratory who was allowed to work there. On her first day, she was offered the chance to work on the  Fondo Veneto Sezione II, a cache of maps, letters, legal and accounting documents from the late 1500s, many of which had not been repaired.\n As she completed her conservation work, Dambrogio didn&#39;t always follow the writing, since it was often in old Italian dialects, but she did notice cuts, creases and folds in the paper. While it could be mistaken for damage to the untrained eye, she realised it was evidence of letterlocking. So, she methodically described what she observed.\n  When Dambrogio returned to the US – she&#39;s now based at MIT in Massachusetts – those notes and models of the original documents would come in useful. &#34;There are probably thousands of letters of the Vatican, but this handful that I modelled started to help us build the language of letterlocking,&#34; she explains.\n After connecting with Starza Smith, she and her colleagues began to seek out more examples of letterlocking wherever they could find them, often hidden away in old archives and museum collections.\n A few years ago, they came across one particularly rich bounty: a whole trunk full of 2,600 letters from 17th-Century Europe which had gone undelivered – 577 of which were unopened.\n  The collection had been kept by a married postmaster and postmistress called Simon Brienne and Marie Germain, who lived in the Netherlands. In the 1600s, the recipients of letters had to pay to receive them, so for various reasons – poverty, relocation or death – letters often failed to reach their destination. Many had the words &#34; niet hebben&#34; scribbled on them in Dutch, which means &#34;refused&#34;. The couple and their employees kept them in the hope that recipients might eventually shell out, hence the trunk&#39;s nickname: “the piggy bank” ( spaarpotje). Inadvertently, they had compiled one of the richest epistolary archives of the period.\n Many of the letters were everyday correspondence, but collectively they paint a detailed picture of life in Europe during the 1600s. &#34;The letters represent the thoughts, cares, and dreams of a cross-section of society: there are missives by ambassadors, dukes and duchesses, merchants, publishers, and spies, but also by actors and musicians, ordinary lovers, struggling refugees, and by women as well as men,&#34; write the researchers who have been  studying the collection.\n  Along with various other sources they found, the Brienne Collection has allowed Dambrogio and Starza Smith to identify a range of letterlocking techniques known to people during the Early Modern Age.\n Over time, the pair have compiled what is essentially a  &#34;periodic table&#34; of letterlocking. This includes at least 18 different formats, ranging from the simplest of locks – a rolled scroll sealed with wax – to a packet which has 12 edges once sealed. They also describe attributes such as whether they feature slits or tucks, as well as rating the security of locks, according to how tamper-resistant they would have been. While it might have been possible for a determined snooper to reinstate some locks undetected, the difficulty of doing so varied – in some cases, they&#39;d have no choice but to rip a strip of paper, or visibly break the adhesive.\n  I had a go at locking a letter myself recently in a workshop that the pair organised at MIT, making a &#34;triangle lock&#34;. This particular one wasn&#39;t found in the Brienne Collection, but was a technique used from the 1400s to the 1700s across Europe and England.\n It was surprisingly complex, and I was struck by the ingenuity of the process. We started with an A4 sheet of paper and some tape, with Dambrogio leading us through the steps: &#34;cut off a triangle from the bottom… fold short edge to short edge…don&#39;t make a sharp crease, just bend it …make a little slit and thread the little triangle through.&#34;\n And what we ended up with looked a bit like this. The triangle shape, poked through the letter, is then folded over the edges and stuck down with glue or wax.\n  You can try the triangle lock for yourself using  this video demonstration, or the team&#39;s diagram below, along with two others that they have identified.\n The second one in the diagram (middle) is modelled after a letter between two cousins from the Brienne Collection that the team recently  &#34;virtually unfolded&#34; using X-ray microtomography. This meant that they could open up the folds without having to unseal any of the locks.\n And if you fancy a true folding challenge, the third (bottom) is called the &#34;dagger trap&#34;, based on a British intelligence letter, sent from Italy in 1601, which Dambrogio and Starza Smith found in the UK National Archives. It was &#34;the most secure, complicated, and time-consuming letter we’ve encountered&#34;. While it would have appeared to be a simple pleated letter from the outside, it was essentially booby-trapped, with a hidden strip of paper inside that &#34;trips&#34; when opened, revealing it had been unlocked. (This  video walk-through may help.)\n  Today, when people think about keeping their messages secure from prying eyes, they tend to focus on digital communication, such as the &#34;end-to-end encryption&#34; of services such as WhatsApp or Signal. But letterlocking demonstrates that the urge to communicate securely is much older than many might assume.\n &#34;As far back as humans have walked the Earth and wanted to document something, there&#39;s been a need to have discretion,&#34; says Dambrogio. The Ancient Greeks and Egyptians used seals for correspondence and notarisation. And the documentation of Mesopotamia, thousands of years ago, was often encased in clay envelopes called  bullae.\n These tricks for tamper-resistant communication have sometimes even played a role in pivotal historical events. When Mary Queen of Scots locked her last letter, she was acutely aware that the ruling powers might read her message, and wanted her brother-in-law to know if they did. After all, a previously intercepted letter was the reason that she faced her predicament: she had been caught authorising a plot to assassinate Elizabeth I.\n In this light, then, letterlocking becomes a new lens through which to view history and the ways we have sought to connect with one another over the centuries. As Starza Smith points out about the significance of Mary&#39;s final actions: &#34;People often say the last thing she did before she was executed was to write a letter. Not true! The last thing she did was to  lock a letter.&#34;\n    Join one million Future fans by liking us on    Facebook , or follow us on    Twitter  or    Instagram .\n If you liked this story,    sign up for the weekly bbc.com features newsletter , called “The Essential List”. A handpicked selection of stories from    BBC Future ,    Culture ,   Worklife, and    Travel , delivered to your inbox every Friday.", "posttime": "2021-06-18 22:36:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "折叠,folds", "title": "聪明的折叠秘密 ", "title_en": "The clever folds that kept letters secret", "transed": 1, "url": "https://www.bbc.com/future/article/20210616-how-the-forgotten-tricks-of-letterlocking-shaped-history", "via": "", "real_tags": ["折叠", "folds"]}, {"category": "", "categoryclass": "", "imagename": "02430d02ca4e74c26963b99d637ae11c.jpg", "infoid": 1066711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去14年的大部分时间里，我一直是一个服务员。我已经工作了70小时了。我在上午3点离开工作，只能在我回家的路上抢劫后10点上午10点展示。我忽略了伤害，以避免让我的转变覆盖的麻烦。\n  这份工作不是迷人的，但它可能是有益的。然而，最近，我几乎每天阅读一个新的故事，迫使餐馆迫使餐馆削减小时或完全靠近。根据华盛顿邮政的一块这样的作品，罪魁祸首是“失业福利和大流行援助”，这提供了比典型的招待所工作更多的钱 - 我们被告知工人宁愿留在过于慷慨的政府的生活中。纽约邮政，因为它的一部分责备“说他们最好收集Covid-eastif-账单的失业支票。”\n  据推测，这位人的人从来不必依靠那些“加强”失业救济救济救济，因为我确实在这大流行病的九个月内。我知道这是熬夜令人担忧的票据。我曾经走过我的公寓，列出了我可以卖的所有物品的列表。\n  没有人选择这样的生活，而不是要付出好的，可靠的工作。相反，在Covid-19之前，该行业深入缺陷，大流行只会让事情变得更糟。工人仍然远离，因为行业从未尊重他们，如果restaurateurs希望没有任何改变，并且返回到一个巨大的熟悉的个人队伍的一堆巨大的人，他们就可以抵消所有滥用的人对于微薄的工资，他们被误解了。\n  在锁定前，我在一家餐厅工作，为一顿常见的一顿士准备的一顿饭收取225美元，为“经验”为“经验”。在那里，我看到了每一个愤怒的厨师刻板印象，你可以想象：板块和平底锅划过厨房，尖叫，甚至身体虐待。我已经看到锅手柄加热，直到它们发光，留在炉顶，为毫无戒心的线条烹饪，而员工笑的其他人。来自员工和员工之间的客人以及员工的种族主义和性别歧视猖獗。\n  这种虐待始终堆叠在低薪和业主之上，他们不能总是被计算在及时支付员工。我被告知要等待几天支付薪水，并且由于“会计问题”而没有经历直接存款。在大多数州的大多数州的前方员工支付低于最低工资，并使他们的大部分收入在提示中，这令人不一致地有利于白人。厨师，当他们得到支付时，通常是工资盗窃和未付加班的受害者。\n  现在，在所有这些问题之上，我们被要求在整个全球大流行中工作，一个对餐馆工人特别致命的。尽管疫苗广泛可用，但只有大约一半的美国成年人都是接种疫苗的，并且无法算上运营商，以优先考虑自己的员工的安全。今年夏天，我在一家餐馆工作，整个员工接触到有科迪德的人。我们关闭了一天。 \n工作的性质也发生了变化。在最好的情况下，我每天晚上都会成为几十个小庆典的一部分 - 人们来到吐司约婚，婚礼，生日和促销活动。让人们每晚都快乐深刻令人满意。但现在，服务器已经变成了警察：我们必须为根本不关心的食客执行无数，不断变化的规则和法规。每天晚上都是，“不，你不能移动表格;不，你的朋友无法加入你的十大;不，你不能站起来走走掩盖。“有些人是理解，但大多数时候，客人都会做出反应，尽管我们个人起草了这些规则，专门起草了他们的夜晚。他们求求，他们扣留提示，他们尖叫着我们，在极端情况下，他们攻击我们。\n  要求更好的工作条件被视为懒惰和权利的迹象。我无法计算有多少次对管理层会面的次数，“你总是可以在其他地方工作。”吮吸它并穿上一个幸福的脸是唯一能证明你是一个“真正的专业”的唯一方式。\n  这是我所知道的唯一职业，我迫切希望这个行业成功。没有理由它不能。大多数员工离开他们的餐厅工作说，如果他们刚刚支付稳定，生活的工资，他们会留下来。\n  我理解这种在我们的行业上运作的这种流行的破坏 -  80,000家餐馆在全国各地永久封闭 - 我幸运的是目前在与大型业主的某个地方一起工作，尊重并尊重员工尊严和尊重。但我不应该在“幸运的人”中算上自己。\n  这个时期出来的餐厅最强的人将由理解这一点的业主经营，谁知道将员工福利首先是唯一的真正前进的方式。我们为我们的工作感到自豪;我们只想为那些以简单的尊重而重视的人，这些人从太多的用餐室中消失了。\n  本网站受reCAPTCHA和Google隐私政策的保护和服务条款。\n    通过提交您的电子邮件，您同意我们的条款和隐私声明，并收到我们的电子邮件信件。 ", "note_en": "For most of the past 14 years, I’ve been a waiter. I’ve worked 70-hour weeks. I’ve left work at 3:00 a.m, only to show back up at 10:00 a.m., after getting robbed on my way home. I’ve ignored injuries to avoid the hassle of getting my shift covered.\n  The job is not glamorous, but it can be rewarding. Lately, however, I read a new story almost daily about a  massive  worker  shortage that’s forcing restaurants to cut hours or close altogether. According to  one such piece in the Washington  Post, the culprit is “unemployment benefits and pandemic assistance,” which offer more money than a typical hospitality job — we’re being told that workers would rather stay home living off an overly generous government. The New York  Post, for its part,  blames “workers who say they’re better off collecting COVID-relief-bill enhanced unemployment checks.”\n  Presumably, people who say this have never had to rely on those “enhanced” unemployment benefits to survive, as I did for nine months of this pandemic. I know what it’s like to stay up all night worrying about bills. I once walked through my apartment making a list of all the belongings I could sell if I needed to.\n  Nobody chooses to live like this instead of going to a good-paying, reliable job. Instead, the industry was deeply flawed before COVID-19, and the pandemic only made things worse. Workers are staying away because the industry has never treated them with respect, and if restaurateurs expect to change nothing, and return to a time when they could count on a huge stack of résumés from highly skilled individuals who would put up with all manner of abuse for meager pay, they are mistaken.\n  Long before lockdown, I worked in a restaurant that charged $225 for a meal prepared largely by an army of  stagiaires, unpaid kitchen staff working for “experience.” There, I saw every angry-chef stereotype you can imagine: plates and pans thrown across kitchens, screaming, even physical abuse. I’ve seen pot handles heated until they’re glowing and left on a stove top for an unsuspecting line cook to grab while the rest of the staff chuckles. Racism and sexism, both from guests to staff and among employees, are rampant.\n  That abuse has always been stacked on top of low pay and owners who can’t always be counted on to pay their employees in a timely manner. I’ve been told to wait a few days before cashing paychecks, and have had direct deposits not go through because of “accounting issues.” Front-of-house staffers are paid  less than minimum wage in most states and make the majority of their income in tips, which disproportionately  benefit white men. Cooks, when they’re paid at all, are frequently victims of  wage theft and  unpaid overtime.\n  Now, on top of all these issues, we’ve been asked to work throughout a global pandemic, one that has been  particularly deadly for restaurant workers. Even though vaccines are widely available, only about half of American adults are vaccinated, and operators can’t be counted on to prioritize their own employees’ safety. This summer, I worked at a restaurant where the entire staff was exposed to someone with COVID. We closed for one day.\n  The  nature of the work has changed, too. Under the best circumstances, I get to be part of dozens of small celebrations every night — people come to toast engagements, weddings, birthdays, and promotions. It is deeply gratifying to make people happy every night. But now, instead of being providers, servers have been turned into cops: We must enforce countless, ever-changing rules and regulations for diners who simply don’t care. Every night it’s, “No, you can’t move the tables; no, your friends can’t join your ten-top; no, you can’t stand up and walk around maskless.” Some people are understanding, but most times, guests react as though we personally drafted these rules specifically to ruin their night. They beg, they withhold tips, they scream at us, and in extreme cases, they  assault us.\n  Asking for better working conditions is treated as a sign of laziness and entitlement. I can’t count how many times a complaint to management has been met with, “You could always work somewhere else.” Sucking it up and putting on a happy face is the only way to show that you’re a “true professional.”\n  This is the only career I’ve ever known and I desperately want this industry to succeed. There’s no reason it can’t. The  majority of staff leaving their restaurant jobs say they would stay if they were just paid a stable, living wage.\n  I understand the devastation that this pandemic wrought on our industry — 80,000 restaurants have  closed permanently across the country — and I am fortunate to currently work somewhere with great owners who pay well and treat their employees with dignity and respect. But I shouldn’t have to count myself among “the lucky ones.”\n  The restaurants that come out of this period the strongest will be run by owners who understand this, and who know that putting the welfare of their employees first is the only real way forward. We take pride in our work; we only want to work for people who value that commitment with simple respect that has disappeared from far too many dining rooms.\n  This site is protected by reCAPTCHA and the Google  Privacy Policy and  Terms of Service apply.\n    By submitting your email, you agree to our  Terms and  Privacy Notice and to receive email correspondence from us.", "posttime": "2021-06-18 22:35:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "租用,restaurants,员工", "title": "为什么租用工人这么难的餐馆 ", "title_en": "Why It’s So Hard for Restaurants to Hire Workers", "transed": 1, "url": "https://www.grubstreet.com/2021/06/why-restaurants-are-struggling-to-find-workers.html", "via": "", "real_tags": ["租用", "员工"]}, {"category": "", "categoryclass": "", "imagename": "cc35c0950881e2e8e784d95cbf3ecb63.png", "infoid": 1066710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很激动到释放.NET 6预览5.我们现在在.NET 6的下半部分，并开始看到有重大的功能。一个很好的例子是.NET SDK工作负载，它是我们的.NET Unifigation Vision的基础，并支持支持更多的应用程序类型。与其他特征一样，它即将到来提供引人注目的最终用户体验。\n   有关Web，数据访问和跨平台UI方案的最新功能，请参阅ASP.NET核心，EF核心和.NET MAUI帖子。\n Visual Studio 2022预览1今天也释放，.NET 6预览5包含在该版本中。 .NET 6也使用Visual Studio 16.11和Mac 8.9的Visual Studio进行了测试。我们建议您使用这些构建，如果您想尝试使用Visual Studio .NET 6。\n 查看新的对话帖子，用于深入的工程师到工程师讨论最新.NET功能。\n  SDK Workloads是一个新的.NET SDK功能，使我们能够为新的应用程序类型添加支持 - 如移动和网页装配 - 而不增加SDK的大小。\n 工作负载功能已更新为包含列表和更新动词。这些新功能提供了预期的最终经验的感觉。您将能够用一些简单的命令快速建立您的首选环境，并随着时间的推移保持最新状态。\n  更新动词查询nuget.org for更新的工作负载清单，更新本地清单，下载已安装工作负载的新版本，然后删除所有旧版本的工作负载。这类似于APT更新和APT升级 - 即（基于Debian的Linux Distrs）。 \nDotnet Workload命令在给定SDK的上下文中运行。想象一下，您已安装.NET 6和.NET 7。如果您使用两者，工作负载命令将提供不同的结果，因为工作负载将是不同的（至少不同版本的相同工作负载）。\n 如您所见，工作负载功能本质上是.NET SDK的包管理器。工作负载首先在.NET 6预览4释放中引入。\n  包验证工具将使Nuget库开发人员能够验证其软件包是否一致且形成良好。\n  验证程序包对所有特定于运行时的实现具有相同的公众API。\n    在.NET 5中，我们将大约250分析仪与.NET SDK发布了大约250分析仪。他们中的许多已经存在，但是被带出乐队作为尼古特包。我们为.NET 6添加了更多分析仪。\n 默认情况下，大多数新分析仪都在信息级别启用。您可以通过配置这样的分析模式来在警告级别启用这些分析仪：＆lt; anyysismode＆gt; allenelabledydefault＆lt; / analysismode＆gt ;.\n 我们发布了我们想要的.NET 6（加上一些额外）的分析仪集，然后使大部分抢劫抢。 \nCredit到Newell Clark和Meik Tranel的以下实施中包含的预览5.请注意，社区在以前的预览中贡献了其他实施。\n    CA1416平台兼容性分析仪已经使用操作系统/运行时的方法识别平台警卫，例如operatingSystem.IsWindows和Operatingsystem.IsWindowsVersionAtlest。但是，分析仪不识别出类似于在字段或属性中缓存的平台检查结果等其他保护可能性，或者在辅助方法中定义复杂的平台检查逻辑。\n 为了允许自定义保护可能性，我们添加了新的属性支持oSplatformGuard和UnsupportedOsplatformGuard，用于使用相应的平台名称和/或版本注释自​​定义警卫成员。该注释由平台兼容性分析仪的流分析逻辑识别和尊重。\n  [Unsupportedosplatformguard（＆＃34;浏览器＆＃34;）] //平台保护属性\r#if target_browser.\r 内部BOOL isporpported =＆gt;错误的;\r＃别的\r 内部BOOL isporpported =＆gt;真的;\r＃万一\r\r [UnsupportedoSplatform（＆＃34;浏览器＆＃34;）]\r void apinotsupportedonbrowser（）{}\r\r void m1（）\r {\r apinotoupportedonbrowser（）; //警告：所有平台可访问此呼叫站点。＆＃39; apinotoupportedonbrowser（）＆＃39;不支持：＆＃39;浏览器＆＃39;\r\r 如果（签发）\r {\r apinotoupportedonbrowser（）; //不警告\r }\r }\r\r [支持DOSPLATFORM（＆＃34; Windows＆＃34;）]\r [SupportedOsplatform（＆＃34; Linux＆＃34;）]\r void apionlyworkonwindowslinux（）{}\r\r [SupportedOsplatformGuard（＆＃34; Linux＆＃34;）]\r [SupportedOsplatformguard（＆＃34; Windows＆＃34;）]\r 私有readonly bool _iswindoworlinux = operatingsystem.Islinux（）|| Operatingsystem.IsWindows（）;\r\r void m2（）\r {\r apionlyworkonwindowslinux（）; //此呼叫站点可以在所有平台上访问。＆＃39; apionlyworkonwindowslinux（）＆＃39;只支持：＆＃39; Linux＆＃39 ;,＆＃39; windows＆＃39;\r\r if（_iswindoworlinux）\r {\r apionlyworkonwindowslinux（）; //不警告\r }\r }\r}\n  您现在可以为具有Application.SetDefaultFont的应用程序设置默认字体。您使用的模式类似于设置高DPI或视觉样式。\n 班级计划\r{\r [Stathread]\r 静态void main（）\r {\r application.sethighdpimode（highdpimode.systemaware）;\r application.enablevisualstyles（）;\r application.setcompatibletextrenderingdefault（false）;\r\r+ application.setdefaultfont（新字体（新的fontfamily（＆＃34; Microsoft Sans Serif＆＃34;），8f））;\r\r application.run（新form1（））;\r }\r}\n      默认字体在.NET Core 3.0中更新。但是，这一变化引入了一些用户迁移.NET Framework应用程序到.NET核心的重要障碍。这种新的变化使得为应用程序选择所需的字体并删除该迁移障碍。 \n从包裹中删除框架是一个源头破裂的变化。与此同时，继续为我们发货的所有框架构建增加了包的复杂性和大小。在过去，我们通过收获解决了这个问题，基本上意味着：\n 在构建过程中，我们下载了早期版本的包并收集了早期框架的二进制文件，我们不再为\n 虽然这意味着您可以随时更新，而无需担心我们会丢弃框架，这也意味着如果您使用收获的二进制文件，您将永远不会收到任何错误修复或新功能。换句话说，收获的资产无法维修，现在隐藏，因为从你的角度来看，你能够继续将包装更新到以后的版本，甚至认为你正在消耗我们不再的同样的旧二元包更新。\n 从.NET 6预览5开始，我们计划不再执行任何形式的收获，以确保我们运送的所有资产都可以提供服务。这意味着我们正在为任何比这些框架的框架丢弃支持：\n  如果您当前正在引用从早期框架中引用受影响的包，则您将不再能够将引用的包更新为更高版本。您的选择要么将项目重新出口到稍后的框架版本或未更新引用的包（通常不是巨大的收回，因为您已经消耗了冻结的二进制文件）。\n 有关更多详细信息，请参见“受影响的软件包的完整列表”，请参阅DotNet /公告：丢弃旧框架版本。\n  我们一直在改善Microsoft.extensions API此版本。在预览5中，我们专注于托管和依赖注入。在预览4中，我们添加了一个用于日志记录的编译时源生成器。 \n我们在ihostbuilder上添加了一个新的ConfigureHostOptions API，使应用程序设置更简单（例如，配置关机超时）：\n   使用hostbuilder host = new（）\r .configureServices（服务=＆gt;\r {\r 服务.Configure＆lt; hostoptions＆gt;（o =＆gt;\r {\r o.shutdowntimeout = timespan.fromminutes（10）;\r }）;\r }）\r 。建造（）;\r\rhost.run（）;\n  您可能已经注意到服务提供商的处理将在碰巧注册IASyncDisposable服务时抛出InvalidOperationException。\n 新的CreateAsyncope API提供了一个简单的解决方案，您可以在以下示例中看到：\n   使用系统;\r使用system.threading.tasks;\r使用Microsoft.extensions.DependentIn注意;\r\r等待使用var提供程序= new serviceCollection（）\r .addscoped＆lt; foo＆gt;（）\r .buildserviceprovider（）;\r\r//这个使用可以抛出InvalidOperationException\r使用（var scope = provider.createscope（））\r{\r var foo = scope.serviceprovider.getrequiredservice＆lt; foo＆gt;（）;\r}\r\rflass foo：iasyncdisposable\r{\r Public ValueTask DisposeAsync（）=＆gt;默认;\r}\n     几乎所有.NET Serializers的骨干都是反射。反射是某些场景的重要功能，但不是作为高性能云天然应用的基础（通常（de）序列化和处理大量的JSON文件）。反射是启动，内存使用和装配修剪的问题。\n 运行时反射的替代方案是编译时源生成。源生成器生成可以编译为库或应用程序构建的一部分的C＃源文件。在编译时生成源代码可以为.NET应用程序提供许多好处，包括改进的性能。 \n在.NET 6中，我们包括一个新的源生成器作为System.Text.json的一部分。 JSON源生成器与JSonserializer配合使用，并且可以以多种方式配置。是你决定你是否使用新的源生成器。它可以提供以下好处：\n  例如，而不是在运行时在运行时动态生成方法以在（de）序列化期间使用反射（使用私有内存并具有启动成本），而不是在（de）序列化期间设置类属性，而是可以生成更简单且有效地分配的代码或者直接检索到闪电快速闪电的属性。\n 您可以使用system.text.json nuget包的最新预览版本尝试源生成器。我们正在致力于在SDK内包括源生成器的提案。\n  默认情况下，JSON源生成器为给定的序列化类型发出序列化逻辑。通过生成直接使用UTF8JSONWRITER的源代码，可以提供比使用现有的JSonserializer方法更高的性能。简而言之，源生成器提供了一种在编译时向您提供不同实现的方式，以便更好地使运行时体验。\n 缩放，JSonserializer是一个强大的工具，具有许多功能（甚至更新！），可以从/进入JSON格式的.NET类型的（DE）序列化。它很快，但是当序列化例程只需要一个功能子集时可以具有一些性能开销。前进，我们将更新JSonserializer和新源生成器一起。\n  命名空间测试\r{\r 内部类jsonmessage.\r {\r 公共字符串消息{get;放; }\r }\r}\n 源生成器可以配置为为示例jsonMessage类型的实例生成序列化逻辑。请注意，jsoncontext类名称是任意的。您可以使用所生成的源您想要的任何类名。 \n使用system.text.json.serialization;\r\r命名空间测试\r{\r [JSonserializable（Typeof（jsonMessage）]\r 内部部分类jsoncontext：jsonserializercontext\r {\r }\r}\n 我们已经定义了一组通过JSonserializerOptionsAttribute提供了一系列支持源生成模式的JSonserializer功能，该功能提供了最佳的序列化吞吐量。这些功能可以提前指定给源生成器，以避免在运行时额外检查。如果未使用该属性，则在运行时假定默认的JSonserializationOptions。\n 作为构建的一部分，源生成器通过以下形状增强了jsonContext部分类：\n 内部部分类jsoncontext：jsonserializercontext\r{\r 公共静态jsoncontext默认{get; }\r\r 公共jsontypeinfo＆lt; jsonmessage＆gt; jsonmessage {得到; }\r\r 公共jsoncontext（JSonserializerOptions选项）{}\r\r 公共覆盖jsontypeinfo gettypeinfo（类型类型）=＆gt; ......\r}\n 使用此模式的串行程序调用看起来像以下示例。此示例提供了最佳性能。\n 使用hememstream ms = new（）;\r使用utf8jsonwriter writer = new（ms）;\r\rjsoncontext.default.jsonmessage.serialize（写道，新jsonmessage {＆＃34;你好，世界！＆＃34;}）;\r撰写者.Flush（）;\r\r// Writer包含：\r// {＆＃34;消息＆＃34;：＆＃34;你好，世界！＆＃34;}\n 或者，您可以继续使用JSonserializer，而是将生成的代码的实例与JsonContext.default.jsonMessage传递给它。 \n这两个过载之间的差异是第一个使用键入的元数据实现 -  jsontypeinfo＆lt; t＆gt; - 第二个是使用更普遍的UNTYWED实现，该实现可以在上下文实例中确定是否存在键入的实现。结果，它有点慢（由于类型测试）。如果没有给定类型的源生成的实现，则erializer会抛出令人效归的泄漏。它不会回到基于反射的实现（作为明确的设计选择）。\n 基于UTF8JSONWWRITER的最快和最优化的源代生成模式 - 目前仅适用于序列化。类似于反序列化的支持 - 基于UTF8JSONREADER  - 可以根据您的反馈提供将来提供。\n 但是，源生成器还会发出可以效益反序列化的类型元数据初始化逻辑。要使用预先生成的METADATA反常化JSONMESSAGE的实例，您可以执行以下操作：\n     可以在派生的，部分jsonserializercontext实例上通过[JSonserializable]源代码生成多种类型，而不是一个。\n 源生成器还支持对象上的嵌套对象和集合成员，而不仅仅是原始类型。\n  压缩对于通过网络传输的任何数据非常重要。 WebSocket现在启用压缩。我们使用了WebSockets，RFC 7692的Permessage-Leflate扩展的实现。它允许使用缩小算法压缩WebSockets消息有效载荷。\n 此功能是GitHub上网络的顶级用户请求之一。您可以通过API评论1和API评论提供API，遵循我们的旅程1和API评论2。 \n我们意识到，使用压缩与加密一起可能导致攻击，如犯罪和违规行为。这意味着不能在单个压缩上下文中与用户生成的数据一起发送秘密，否则可以提取秘密。为了让用户注意这些影响，并帮助他们权衡风险，我们将API更名为危险的DeflateOptions。我们还添加了关闭特定消息的压缩的能力，因此如果用户想要发送秘密，它们可以在没有压缩的情况下安全地执行此操作。\n IVAN还有一个随访，减少了当压缩禁用约27％时Websocket的内存占用空间。\n 从客户端启用压缩很容易，请参阅下面的示例。但是，请记住，服务器可以协商设置，例如，请求较小的窗口，或完全拒绝压缩。\n var cws = new clientwebsocket（）;\rcws.options.dangereDeflateOptions = new websocketDeflateOptions（）\r{\r clientmaxwindowbits = 10，\r servermaxwindowbits = 10.\r};\n 最近还添加了对ASP.NET核心的WebSocket压缩支持。它将包含在即将推出的预览中。\n  袜子是一个代理服务器实现，可以处理任何TCP或UDP流量，使其成为一个非常通用的系统。它是一个已添加到.NET 6的长期社区请求。\n 此更改为Socks4，Socks4a和Socks5增加了支持。例如，它可以通过SSH测试外部连接或连接到TOR网络。 \nWebProxy类现在接受Socks方案，就像在以下示例中所看到的那样。\n var handler = new httpclienthandler\r{\r Proxy =新的WebProxy（＆＃34; Socks5：//127.0.0.1&#34;，9050）\r};\rvar httpclient = new httpclient（handler）;\n   我们一直在为上一对夫妻.NET版本添加对OpenTeLemetry的支持，作为我们对可观察性的关注的一部分。在.NET 6中，我们正在为OpenTeLemetry指标API添加支持。通过为OpenTeMetry添加支持，您的应用可以与其他OpenTeLemetry系统无缝互操作。\n system.diagnostics.metrics是OpenTeleMetry指标API规范的.NET实现。指标API明确地设计用于处理原始测量，通常有意图，有效和同时产生这些测量的连续摘要。\n API包括仪表类，可用于创建仪器对象（例如计数器）。 API公开了四种仪器类：计数器，直方图，观察到和观察奖励，以支持不同的指标方案。此外，API公开了MeterListener类以允许监听仪器的录制测量以获取聚合和分组目的。\n OpenTeLemetry .NET实现将扩展为使用这些新的API，它为度量标准可观察性方案添加了支持。\n  米计=新仪表（＆＃34; io.opentelemetry.contrib.mongodb＆＃34 ;,＆＃34; v1.0＆＃34;）;\r 计数器＆lt; int＆gt;计数器= meter.createcounter＆lt; int＆gt;（＆＃34;请求＆＃34;）;\r 逆报署（1）;\r counter.add（1，keyvaluepair.Create＆lt; String，Object＆gt;（＆＃34;请求＆＃34;＆＃34;阅读＆＃34;））; \nmeterlistener listener = new meterlistener（）;\r listener.instrumentpublished =（仪器，meterlistener）=＆gt;\r {\r if（internice.name ==＆＃34;请求＆＃34;＆amp;＆amp;＆amp;＆amp;＆amp;＆amp;＆amp;＆amp; name .name ==＆＃34; io.opentelemetry.contrib.mongodb＆＃34;）\r {\r meterlistener.enablemeasurementEvents（仪器，null）;\r }\r };\r listener.setmeasurementEventCallback＆lt; int＆gt;（（仪器，测量，标签，状​​态）=＆gt;\r {\r console.writeline（$＆＃34; interner：{interner.name}录制了测量{measurement}＆＃34;）;\r }）;\r listener.start（）;\n  从十进制和十六进制字符串中解析了分析来自十进制和十六进制字符串。我们看到高达89％的改善，如下图所示。\n    向量＆lt; t＆gt;现在支持在C＃9中添加的nint和nuint原始类型。例如，此更改应使其更简单地使用带有指针或平台依赖的长度的SIMD指令。\n  .NET加密API支持使用OpenSSL 3作为Linux上的首选本机加密提供程序。 .NET 6如果可用，将使用OpenSSL 3。否则，它将使用OpenSSL 1.x.\n  Chacha20Poly1305类已被添加到System.Security.cryptography。为了使用Chacha20 / Poly1305算法，必须由底层操作系统支持。静态播放属性可用于确定算法是否在给定的上下文中支持。\n    该团队一直在添加Object-C支持，其目标是具有单一目标-C互操作性的.NET。到目前为止，Objective-C互操作系统是在Mono嵌入式API周围构建的，但我们决定它不是跨越运行时分享的正确方法。因此，我们创建了一个新的.NET API，它将启用一个Object-C互操作体验，最终将在两个运行时工作。\n Objective-C Interop的这个新API在NSAuteLeasePool的运行时立即支持，这使得能够支持Cocoa的参考记忆管理系统。您现在可以配置是否希望每个托管线程都有隐式NSAutorEaseAsePool。这使得能够以每线程释放可可对象。 \n自从.NET 6开始，Monovm已添加大量诊断功能。这使得它已启用托管事件/ enceListener，eventPipe和诊断程序等功能。 它已使用Dotnet-Trace，Dotnet-Counters，DotNet-Stack等应用程序启用，用于在移动设备（iOS / Android）以及桌面上运行的应用程序。  这些新功能开辟了分析Monovm生成的NetTrace文件的能力，如Priveview / Speed  ...... ", "note_en": "We are thrilled to release .NET 6 Preview 5. We’re now in the second-half of the .NET 6 release, and starting to see significant features coming together. A great example is .NET SDK Workloads, which is the foundation of our  .NET unification vision and enables supporting more application types. Like other features, it is coming together to provide a compelling end-to-end user experience.\n   See the  ASP.NET Core,  EF Core, and  .NET MAUI posts for more detail on what’s new for web, data access, and cross-platform UI scenarios.\n Visual Studio 2022 Preview 1 is also releasing today and .NET 6 Preview 5 is included in that release. .NET 6 has also been tested with  Visual Studio 16.11 and  Visual Studio for Mac 8.9. We recommend you use those builds if you want to try .NET 6 with  Visual Studio.\n Check out the new  conversations posts for in-depth engineer-to-engineer discussions of the latest .NET features.\n  SDK workloads is a new .NET SDK feature that enables us to add support for new application types — like  mobile and  WebAssembly — without increasing the size of the SDK.\n The workloads feature has been updated to include  list and  update verbs. These new capabilities provide a sense of the expected final experience. You’ll be able to quickly establish your preferred environment with a few simple commands and to keep it up-to-date over time.\n  The  update verb queries  nuget.org for updated workload manifests, updates local manifests, downloads new versions of the installed workloads, and then removes all old versions of a workload. This is analogous to  apt update and  apt upgrade -y (used on Debian-based Linux distros).\n The  dotnet workload commands operate in the context of the given SDK. Imagine you have both .NET 6 and .NET 7 installed. If you use both, the workloads commands will provide different results since the workloads will be different (at least different versions of the same workloads).\n As you can see, the workloads feature is essentially a package manager for the .NET SDK. Workloads were first introduced in the  .NET 6 preview 4 release.\n  Package Validation tooling will enable NuGet library developers to validate that their packages are consistent and well-formed.\n  Validate that the package has the same set of publics APIs for all runtime-specific implementations.\n    In .NET 5, we shipped approximately 250 analyzers with the .NET SDK. Many of them already existed but were shipped out-of-band as NuGet packages. We’re  adding more analyzers for .NET 6.\n By default most of the new analyzers are enabled at Info level. You can enable these analyzers at Warning level by  configuring the analysis mode like this:  &lt;AnalysisMode&gt;AllEnabledByDefault&lt;/AnalysisMode&gt;.\n We published the set of analyzers we wanted for .NET 6 (plus some extras) and then made most of them  up-for-grabs.\n Credit to  Newell Clark and  Meik Tranel for the following implementations, included in Preview 5. Note that the community has contributed other implementations in previous previews.\n    The CA1416 Platform Compatibility analyzer already recognizes platform guards using the methods in OperatingSystem/RuntimeInformation, such as  OperatingSystem.IsWindows and  OperatingSystem.IsWindowsVersionAtLeast. However,  the analyzer does not recognize any other guard possibilities like the platform check result cached in a field or property, or complex platform check logic is defined in a helper method.\n For  allowing custom guard possibilities we  added new attributes  SupportedOSPlatformGuard and  UnsupportedOSPlatformGuard for annotating the custom guard members with the corresponding platform name and/or version. This annotation is recognized and respected by the Platform Compatibility analyzer’s flow analysis logic.\n  [UnsupportedOSPlatformGuard(&#34;browser&#34;)] // The platform guard attribute\r#if TARGET_BROWSER\r internal bool IsSupported =&gt; false;\r#else\r internal bool IsSupported =&gt; true;\r#endif\r\r [UnsupportedOSPlatform(&#34;browser&#34;)]\r void ApiNotSupportedOnBrowser() { }\r\r void M1()\r {\r ApiNotSupportedOnBrowser(); // Warns: This call site is reachable on all platforms.&#39;ApiNotSupportedOnBrowser()&#39; is unsupported on: &#39;browser&#39;\r\r if (IsSupported)\r {\r ApiNotSupportedOnBrowser(); // Not warn\r }\r }\r\r [SupportedOSPlatform(&#34;Windows&#34;)]\r [SupportedOSPlatform(&#34;Linux&#34;)]\r void ApiOnlyWorkOnWindowsLinux() { }\r\r [SupportedOSPlatformGuard(&#34;Linux&#34;)]\r [SupportedOSPlatformGuard(&#34;Windows&#34;)]\r private readonly bool _isWindowOrLinux = OperatingSystem.IsLinux() || OperatingSystem.IsWindows();\r\r void M2()\r {\r ApiOnlyWorkOnWindowsLinux(); // This call site is reachable on all platforms.&#39;ApiOnlyWorkOnWindowsLinux()&#39; is only supported on: &#39;Linux&#39;, &#39;Windows&#39;.\r\r if (_isWindowOrLinux)\r {\r ApiOnlyWorkOnWindowsLinux(); // Not warn\r }\r }\r}\n  You can now  set a default font for an application with  Application.SetDefaultFont. The pattern you use is similar to setting high dpi or visual styles.\n class Program\r{\r [STAThread]\r static void Main()\r {\r Application.SetHighDpiMode(HighDpiMode.SystemAware);\r Application.EnableVisualStyles();\r Application.SetCompatibleTextRenderingDefault(false);\r\r+ Application.SetDefaultFont(new Font(new FontFamily(&#34;Microsoft Sans Serif&#34;), 8f));\r\r Application.Run(new Form1());\r }\r}\n      The  default font was updated in .NET Core 3.0. However that change introduced a significant hurdle for some users migrating .NET Framework apps to .NET Core. This new change makes it straightforward to choose the desired font for an app and removes that migration hurdle.\n  Dropping a framework from a package is a source breaking change. At the same time, continuing to build for all frameworks we ever shipped increases the complexity and size of a package. In the past, we’ve solved this issue by  harvesting, which basically meant:\n During build, we download the earlier version of the package and harvest the binaries for earlier frameworks we no longer build for\n While this means that you can always update without worrying that we drop a framework it also means that you’ll never get any bug fixes or new features if you consume a harvested binary. In other words, harvested assets can’t be serviced which is now hidden because from your point of view you’re able to keep updating the package to a later version even thought you’re consuming the same old binary that we’re no longer updating.\n Starting with .NET 6 Preview 5, we plan to no longer perform any form of harvesting to ensure that all assets we ship can be serviced. This means we’re dropping support for any framework that is older than these:\n  If you’re currently referencing an impacted package from an earlier framework, you’ll no longer be able to update the referenced package to a later version. Your choice is to either retarget your project to a later framework version or not updating the referenced package (which is generally not a huge take back because you’re already consuming a frozen binary anyways).\n For more details, including the full list of impacted packages, see  dotnet/announcement: Dropping older framework versions.\n  We’ve been improving  Microsoft.Extensions APIs this release. In Preview 5, we’ve focused on hosting and dependency injection. In Preview 4, we added a  compile-time source generator for logging.\n   We added a new ConfigureHostOptions API on IHostBuilder to make application setup simpler (e.g. configuring the shutdown timeout):\n   using HostBuilder host = new()\r .ConfigureServices(services =&gt;\r {\r services.Configure&lt;HostOptions&gt;(o =&gt;\r {\r o.ShutdownTimeout = TimeSpan.FromMinutes(10);\r });\r })\r .Build();\r\rhost.Run();\n  You might have noticed that disposal of a service provider will throw an  InvalidOperationException when it happens to register an IAsyncDisposable service.\n The new  CreateAsyncScope API provides a straightforward solution, as you can see in the following example:\n   using System;\rusing System.Threading.Tasks;\rusing Microsoft.Extensions.DependencyInjection;\r\rawait using var provider = new ServiceCollection()\r .AddScoped&lt;Foo&gt;()\r .BuildServiceProvider();\r\r// This using can throw InvalidOperationException\rusing (var scope = provider.CreateScope())\r{\r var foo = scope.ServiceProvider.GetRequiredService&lt;Foo&gt;();\r}\r\rclass Foo : IAsyncDisposable\r{\r public ValueTask DisposeAsync() =&gt; default;\r}\n     The backbone of nearly all .NET serializers is reflection. Reflection is a great capability for certain scenarios, but not as the basis of high-performance cloud-native applications (which typically (de)serialize and process a lot of JSON documents). Reflection is a problem for  startup, memory usage, and  assembly trimming.\n The alternative to runtime reflection is compile-time  source generation.  Source generators generate C# source files that can be compiled as part of the library or application build. Generating source code at compile time can provide many benefits to .NET applications, including improved performance.\n In .NET 6, we are including a new source generator as part of  System.Text.Json. The JSON source generator works in conjunction with  JsonSerializer, and can be configured in multiple ways. It’s your decision whether you use the new source generator. It can provide the following benefits:\n  For example, instead of dynamically generating methods at runtime to get and set class properties during (de)serialization using  Reflection.Emit (which uses private memory and has start-up costs), a source generator can generate code that more simply and efficiently assigns or retrieves a value directly to/from properties, which is lightning fast.\n You can try out the source generator by using the latest preview version of the  System.Text.Json NuGet package. We are working on a  proposal for including source generators within the SDK.\n  By default, the JSON source generator emits serialization logic for the given serializable types. This delivers higher performance than using the existing  JsonSerializer methods by generating source code that uses  Utf8JsonWriter directly. In short, source generators offer a way of giving you a different implementation at compile-time in order to make the runtime experience better.\n Zooming out,  JsonSerializer is a powerful tool which has many features (and even more coming!) that can improve the (de)serialization of .NET types from/into the JSON format. It is fast, but can have some performance overhead when only a subset of features are needed for a serialization routine. Going forward, we will update  JsonSerializer and the new source generator together.\n  namespace Test\r{\r internal class JsonMessage\r {\r public string Message { get; set; }\r }\r}\n The source generator can be configured to generate serialization logic for instances of the example  JsonMessage type. Note that the class name  JsonContext is arbitrary. You can use whichever class name you want for the generated source.\n using System.Text.Json.Serialization;\r\rnamespace Test\r{\r [JsonSerializable(typeof(JsonMessage)]\r internal partial class JsonContext : JsonSerializerContext\r {\r }\r}\n We have defined a  set of  JsonSerializer features that are supported with the source generation mode that provides the best serialization throughput, via  JsonSerializerOptionsAttribute. These features can be specified to the source generator ahead of time, to avoid extra checks at runtime. If the attribute is not used, then default  JsonSerializationOptions are assumed at runtime.\n As part of the build, the source generator augments the  JsonContext partial class with the following shape:\n internal partial class JsonContext : JsonSerializerContext\r{\r public static JsonContext Default { get; }\r\r public JsonTypeInfo&lt;JsonMessage&gt; JsonMessage { get; }\r\r public JsonContext(JsonSerializerOptions options) { }\r\r public override JsonTypeInfo GetTypeInfo(Type type) =&gt; ...;\r}\n The serializer invocation with this mode could look like the following example. This example provides the best possible performance.\n using MemoryStream ms = new();\rusing Utf8JsonWriter writer = new(ms);\r\rJsonContext.Default.JsonMessage.Serialize(writer, new JsonMessage { &#34;Hello, world!&#34; });\rwriter.Flush();\r\r// Writer contains:\r// {&#34;Message&#34;:&#34;Hello, world!&#34;}\n Alternatively, you can continue to use  JsonSerializer, and instead pass an instance of the generated code to it, with  JsonContext.Default.JsonMessage.\n    The difference between these two overloads is that the first is using the typed metadata implementation —  JsonTypeInfo&lt;T&gt; — and the second one is using a more general untyped implementation that does type tests to determine if a typed implementation exists within the context instance. It is a little slower (due to the type tests), as a result. If there is not a source-generated implementation for a given type, then the serializer throws a  NotSupportedException. It does not fallback to a reflection-based implementation (as an explicit design choice).\n The fastest and most optimized source generation mode — based on  Utf8JsonWriter — is currently only available for serialization. Similar support for deserialization — based on  Utf8JsonReader — may be provided in the future depending on your feedback.\n However, the source generator also emits type-metadata initialization logic that can benefit deserialization as well. To deserialize an instance of  JsonMessage using pre-generated type metadata, you can do the following:\n     Multiple types can be included for source generation via  [JsonSerializable] on a derived, partial  JsonSerializerContext instance, not just one.\n The source generator also supports nested object and collection members on objects, not just primitive types.\n  Compression is important for any data transmitted over a network.  WebSockets now enable compression. We used an implementation of  permessage-deflate extension for WebSockets,  RFC 7692. It allows compressing WebSockets message payloads using DEFLATE algorithm.\n This feature was one of the top user requests for Networking on GitHub. You can follow our journey to providing that API via  API review 1 and  API review 2.\n  We realized that using compression together with encryption may lead to attacks, like  CRIME and  BREACH. It means that a secret cannot be sent together with user-generated data in a single compression context, otherwise that secret could be extracted. To bring user’s attention to these implications and help them weigh the risks, we renamed our API to  DangerousDeflateOptions. We also added the ability to turn off compression for specific messages, so if the user would want to send a secret, they could do that securely without compression.\n There was also a  follow-up by  Ivan that reduced the memory footprint of the WebSocket when compression is disabled by about 27%.\n Enabling the compression from the client side is easy, see the example below. However, please bear in mind that the server can negotiate the settings, e.g. request smaller window, or deny the compression completely.\n var cws = new ClientWebSocket();\rcws.Options.DangerousDeflateOptions = new WebSocketDeflateOptions()\r{\r ClientMaxWindowBits = 10,\r ServerMaxWindowBits = 10\r};\n WebSocket compression support for ASP.NET Core was also recently added. It will be included in an upcoming preview.\n  SOCKS is a proxy server implementation that can process any TCP or UDP traffic, making it a very versatile system. It is a  long-standing community request that has been  added to .NET 6.\n This change adds support for Socks4, Socks4a, and Socks5. For example, it enables testing external connections via SSH or  connecting to the Tor network.\n The  WebProxy class now accepts  socks schemes, as you can see in the following example.\n var handler = new HttpClientHandler\r{\r Proxy = new WebProxy(&#34;socks5://127.0.0.1&#34;, 9050)\r};\rvar httpClient = new HttpClient(handler);\n   We’ve been  adding support for OpenTelemetry for the last couple .NET versions, as part of our focus on  observability. In .NET 6, we’re adding  support for the  OpenTelemetry Metrics API. By adding support for OpenTelemetry, your apps can seamlessly interoperate with other  OpenTelemetry systems.\n System.Diagnostics.Metrics is the .NET implementation of the  OpenTelemetry Metrics API specification. The Metrics APIs are designed explicitly for processing raw measurements, generally with the intent to produce continuous summaries of those measurements, efficiently and simultaneously.\n The APIs include the  Meter class which can be used to create instrument objects (e.g. Counter). The APIs expose four instrument classes:  Counter,  Histogram,  ObservableCounter, and  ObservableGauge to support different metrics scenarios. Also, the APIs expose the  MeterListener class to allow listening to the instrument’s recorded measurement for aggregation and grouping purposes.\n The  OpenTelemetry .NET implementation will be extended to use these new APIs, which add support for Metrics observability scenarios.\n  Meter meter = new Meter(&#34;io.opentelemetry.contrib.mongodb&#34;, &#34;v1.0&#34;);\r Counter&lt;int&gt; counter = meter.CreateCounter&lt;int&gt;(&#34;Requests&#34;);\r counter.Add(1);\r counter.Add(1, KeyValuePair.Create&lt;string, object&gt;(&#34;request&#34;, &#34;read&#34;));\n  MeterListener listener = new MeterListener();\r listener.InstrumentPublished = (instrument, meterListener) =&gt;\r {\r if (instrument.Name == &#34;Requests&#34; &amp;&amp; instrument.Meter.Name == &#34;io.opentelemetry.contrib.mongodb&#34;)\r {\r meterListener.EnableMeasurementEvents(instrument, null);\r }\r };\r listener.SetMeasurementEventCallback&lt;int&gt;((instrument, measurement, tags, state) =&gt;\r {\r Console.WriteLine($&#34;Instrument: {instrument.Name} has recorded the measurement {measurement}&#34;);\r });\r listener.Start();\n  Parsing of BigIntegers from both decimal and hexadecimal strings has been improved. We see  improvements of up to 89%, as demonstrated in the following chart.\n    Vector&lt;T&gt;  now supports the  nint and  nuint primitive types, added in C# 9. For example, this change should make it simpler to use SIMD instructions with pointers or platform-dependent lengths.\n  .NET cryptography APIs support using  OpenSSL 3 as the preferred native cryptography provider on Linux. .NET 6 will use OpenSSL 3 if it is available. Otherwise, it will use OpenSSL 1.x.\n  The  ChaCha20Poly1305 class has been added to  System.Security.Cryptography. In order to use the ChaCha20/Poly1305 algorithm, it must be supported by the underlying operating system. The static  IsSupported property can be used to determine if the algorithm is supported in a given context.\n    The team has been  adding Objective-C support, with the goal of having a single  Objective-C interop implementation for .NET. Up until now, the  Objective-C interop system was built around the Mono embedding API but we decided it wasn’t the right approach to share across runtimes. As a result we’ve create a new .NET API that will enable a single Objective-C interop experience that will eventually work on both runtimes.\n This new API for Objective-C interop has brought immediate support in both runtimes for   NSAutoreleasePool, which  enables support for Cocoa’s reference-counted memory management system. You can now  configure whether you want each managed thread to have an implicit  NSAutoreleasePool. This enables the release of Cocoa objects on a per-thread basis.\n  A lot of  diagnostics features have been added into MonoVM since beginning of .NET 6. This has enabled features like managed EventSource/EventListener, EventPipe and DiagnosticsServer. It has enabled using diagnostics tools like  dotnet-trace,  dotnet-counters,  dotnet-stacks for apps running on mobile devices (iOS/Android) as well as desktop.\n These new features opens up ability to analyse nettrace files generated by MonoVM in tools like PrefView/Speed\n......", "posttime": "2021-06-18 22:34:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "net", "title": ".NET 6预览5 ", "title_en": ".NET 6 Preview 5", "transed": 1, "url": "https://devblogs.microsoft.com/dotnet/announcing-net-6-preview-5/", "via": "", "real_tags": ["net"]}, {"category": "", "categoryclass": "", "imagename": "9fa6147035fef74ed249a5b689f2bbbd.jpg", "infoid": 1066709, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pornhub昨天被34名妇女起诉，指示该网站托管视频，未经他们的同意，并从其他非致密内容中获利，涉及强奸，儿童性虐待和人口贩运。\n 参与诉讼的受害者，14表示，他们是被指控或被判犯有性行为犯罪的人的受害者，14人表示，他们在Pornhub上的视频中是未成年的。\n “这是为他们犯下违法行为和非法内容的公司和个人对其犯罪承担责任的时候，”其中一项原告在CNN报告的会议上表示。 “我加入了这个诉讼，因为我为自己和无数的受害者寻求正义，而不是＆＃39; t出头的无数受害者。”\n Pornhub的母公司，拥有或经营超过150个色情网站的Mindgeek，被包含在诉讼中。 Pornhub，这是互联网上最大的色情网站之一，去年12月在纽约时报专栏作家尼古拉斯克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特·克里斯特和妇女在塑料袋中窒息的镜头。“\n  当时，该网站每年收到680万个新视频，使其成为网络上最大的视频平台之一。在Kristof的文章之后，MasterCard和Visa调查了该网站。该公告发送了Pornhub扰乱，而在两天内，该网站通过未认定的用户阻止上传，并删除了下载验证模型程序中的有偿下载除了上传视频（“除了验证的模型程序之外，”该网站当时表示）。但是，更改不够，而且万事达卡和签证都禁止了他们的支付网络。几天后，Pornhub清除了数百万用户上传的视频，代表了网站内容的三分之二。\n  2月份，Pornhub宣布它通过依靠软件和“一支广泛的人类主持人团队”来审查每次上传时，它已经扩大了努力。它还从Facebook拍摄了一个页面，让非营利组织做了一些升降机，给他们一个“可信的旗记程序”，它将禁用视频这些群体认为是非法内容的群体。最后，他们开始与第三方合作，yoti，验证其用户的身份。尽管有这些措施，Pornhub不遵循更传统的色情产业中的其他标准。例如，它没有验证网站上托管的视频中的每个人的年龄，也没有确认他们同意被拍摄或上传的视频。\n    诉讼由Brown Rudnick LLP提交，并通过名为ComptickingHub的网站发现了几个签署的涉嫌受害者，该网站旨在关闭Pornhub。该网站由称为Exodus Cry Cry的宗教组织经营，CBS新闻注明本集团“一直批评其努力将性产业和废弃色情制品归咎于犯罪。” \n然而，代表诉讼妇女的律师迈克尔鲍普告诉CBS，他没有寻求Outhaw在线色情片，而是符合传统的色情规则和法规。 “这种情况不是色情，这是关于强奸。这是一个合法的行业，同意人们每一个参与的权利。它只需要合法而不是非法内容。“他告诉CBS。\n 昨天的诉讼不是Pornhub第一次被起诉托管涉嫌以性行为贩运的视频。在12月，万事达卡和签证后不久开始调查，40名妇女提出了一份诉讼，称他们是Wimentdoporn的受害者，该公司是一个公司的制片人诱导受害者“假冒建模广告，虚假承诺和欺骗性的前台公司，最终旨在威胁要威胁这些威胁妇女在做爱视频中，“作者司法部Randy Grossman在最近的一位被判犯罪的制作人和行动者被判犯有与他的工作中被判犯罪的制作人和演员之一后表示。在2月诉讼中，原告声称“MindGeek认识的女孩通过使用欺诈，胁迫和恐吓贩运其受害者作为其习惯性商业惯例的一部分，以使妇女拍摄视频。”\n Canada的隐私专员也正在调查MindGeek。询问是关于妇女提出的投诉指示Pornhub驳回了他们未经同意上传视频的要求。 ", "note_en": "Pornhub was sued yesterday by 34 women alleging that the site hosted videos without their consent and profited from other nonconsensual content involving rape, child sexual abuse, and human trafficking.\n Of the victims involved in the lawsuit, 14 said they were victims of people charged with or convicted of sex crimes, and 14 said they were underage in the videos served on Pornhub.\n “It is time for the companies and individuals who have profited off of nonconsensual and illegal content be held liable for their crime,” one of the plaintiffs said in a conference call reported by  CNN. “I joined the lawsuit because I seek justice for myself and the countless victims who don&#39;t come forward.”\n Pornhub’s parent company, MindGeek, which owns or runs over 150 pornographic websites, was included in the lawsuit. Pornhub, which is among the largest pornography websites on the internet, drew scrutiny last December when New York Times columnist Nicholas Kristof published a feature alleging that it “monetizes child rapes, revenge pornography, spy cam videos of women showering, racist and misogynist content, and footage of women being asphyxiated in plastic bags.”\n  At the time, the site reportedly received 6.8 million new videos per year, making it one of the largest video platforms on the web. In the wake of Kristof’s article, MasterCard and Visa  investigated the site. The announcement sent Pornhub scrambling, and within two days, the site  blocked uploads by unidentified users and removed the ability to download videos (except for “paid downloads within the verified Model Program,” the site said at the time). The changes weren’t enough, though, and MasterCard and Visa both  banned it from their payment networks. Several days later, Pornhub  purged millions of user-uploaded videos, representing around two-thirds of the site’s content.\n  In February, Pornhub announced that it had expanded moderation by relying on both software and “an extensive team of human moderators” who review every upload. It also took a page from Facebook and let nonprofit groups do some of the lifting, giving them a “trusted flagger program” that would disable videos those groups thought contained illegal content. Lastly, they began working with a third party, Yoti, to  verify the identities of its users. Despite those measures, Pornhub does not follow other standards that are followed in the more traditional pornography industry. It does not, for example, verify the ages of everyone in videos hosted on the site, nor does it confirm that they consented to the videos being taken or uploaded.\n    The lawsuit was filed by Brown Rudnick LLP, and several of the alleged victims who signed on were found through a site called Traffickinghub, which seeks to shut down Pornhub. The site is run by a religious organization known as Exodus Cry, and  CBS News notes the group “has been criticized for its efforts to criminalize parts the sex industry and abolish pornography altogether.”\n Yet Michael Bowe, the lawyer representing the women in the lawsuit, told CBS that he was not seeking to outlaw online porn but bring it in line with traditional pornography rules and regulations. “This case is not about porn, it’s about rape. This is a legitimate industry that consenting people have every right to participate in. It just needs to be done legally and not with illegal content.” he told CBS.\n Yesterday’s lawsuit wasn’t the first time Pornhub has been sued for hosting videos that allegedly featured sex trafficking. In December, shortly after MasterCard and Visa began their investigations, 40 women  filed a lawsuit saying they were victims of GirlsDoPorn, a company whose producers lured victims with “fake modeling ads, false promises and deceptive front companies, ultimately devolving to threats to coerce these women into making sex videos,” Acting US Attorney Randy Grossman  said after a recent sentencing hearing for one of the producers and actors who was convicted of crimes associated with his work for the site. In the February lawsuit, the plaintiffs alleged that “MindGeek knew GirlsDoPorn was trafficking its victims by using fraud, coercion, and intimidation as part of its customary business practices to get the women to film the videos.”\n MindGeek is also  under investigation by Canada’s privacy commissioner. The inquiry came about after women filed complaints stating that Pornhub dismissed their requests to take down videos uploaded without their consent.", "posttime": "2021-06-18 21:59:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "据称,sued,pornhub", "title": "Pornhub据称据称为“不协调，不同意”视频起诉 ", "title_en": "Pornhub sued for allegedly serving “under-age, non-consensual” videos", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/06/pornhub-hosted-rape-revenge-porn-and-child-sex-abuse-videos-lawsuit-alleges/", "via": "", "real_tags": ["据称", "sued", "pornhub"]}, {"category": "", "categoryclass": "", "imagename": "eabb7d86bbddb21639a3b41a71cc6512.jpg", "infoid": 1066708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自沃尔特芦苇陆军研究所和海军医学研究中心的科学家与宾夕法尼亚大学和Acuitas治疗学的研究人员合作，基于mRNA技术开发一种新型疫苗，这些技术可保护动物模型中的疟疾，在NPJ疫苗中发表它们的研究结果。 2019年，全球估计有2.29亿例疟疾和409,000人死亡，在人类发病率，死亡率，经济负担和区域社会稳定方面创造了非凡的成本。全世界，疟原虫是寄生虫物种，导致绝大多数死亡。严重疾病风险最高的人包括孕妇，儿童和疟疾天真的旅行者。疟疾对策历史上一直是国防部的优先研究领域，因为这种疾病仍然是对美国专业区域的最大威胁。\n  一个安全，有效的疟疾长期以来一直是科学家的难以捉摸的目标。最先进的疟疾疫苗是RTS，S，是与Wriair合作开发的第一代产品。 RTS，S是基于P. falciparum的普通孢子蛋白，是最危险和广泛的疟疾寄生虫。虽然RTS，S是对抗疟疾的影响，但田间研究揭示了有限的无菌疗效和保护持续时间。与RTS，S和其他第一代疟疾疫苗相关的局限性导致科学家评估了疟疾疫苗的新平台和第二代方法。\n  ＆＃34;最近患有Covid-19的疫苗的成功突出了基于MRNA的平台的优势 - 特别是高度针对性的设计，灵活，快速的制造和能力以尚未探索的方式促进强烈的免疫反应; Wrair＆＃39;疟疾生物制剂分公司和纸上的高级作者，埃弗里纳·瓦诺沃博士＆＃34;我们的目标是将这些进步转化为对疟疾的安全，有效的疫苗。＆＃34;\n  与RTS，S一样，疫苗依赖于P. falciparum＆＃39; S环孢子蛋白引发免疫应答。然而，该方法不必直接施用蛋白质的形式，而是使用MRNA  - 伴有脂质纳米颗粒，该脂质纳米颗粒免受过早降解，有助于刺激免疫系统 - 以促使细胞为循环孢子蛋白蛋白质的编码。那些蛋白质然后引发针对疟疾的保护反应，但实际上不能引起感染。\n  ＆＃34;我们的疫苗实现了对小鼠疟疾感染的高水平保护，＆＃34;在纸上的一名腕子研究员凯瑟琳Mallory说，并在论文上的提交和领导作者。 ＆＃34;虽然更多的工作仍然在临床测试前仍然存在，但这些结果是一个令人鼓舞的迹象，即有效的mRNA的疫苗是可实现的。＆＃34;引用：mRNA疫苗在6月20日从HTTPS://medicalXpress.com/news/2021-06-mrna -vaccine-yields- forl-malaria.html中检索疟疾（2021年，6月18日）对疟疾的疟疾（2021年6月18日）完全保护\n  本文件受版权保护。除了私人学习或研究目的的任何公平交易外，没有书面许可，没有任何部分。内容仅供参考。 ", "note_en": "Scientists from the Walter Reed Army Institute of Research and Naval Medical Research Center partnered with researchers at the University of Pennsylvania and Acuitas Therapeutics to develop a novel vaccine based on mRNA technology that protects against malaria in animal models, publishing their findings in  npj Vaccines.    In 2019, there were an estimated 229 million cases of malaria and 409,000 deaths globally, creating an extraordinary cost in terms of human morbidity, mortality, economic burden, and regional social stability. Worldwide, Plasmodium falciparum is the parasite species which causes the vast majority of deaths. Those at highest risk of severe disease include pregnant women, children and malaria naïve travelers. Malaria countermeasures development has historically been a priority research area for the Department of Defense as the disease remains a top threat to U.S.   deployed to endemic regions.\n  A safe, effective malaria   has long been an elusive target for scientists. The most advanced malaria vaccine is RTS,S, a first-generation product developed in partnership with WRAIR. RTS,S is based on the circumsporozoite protein of P. falciparum, the most dangerous and widespread species of malaria parasite. While RTS,S is an impactful countermeasure in the fight against malaria, field studies have revealed limited sterile efficacy and duration of protection. The limitations associated with RTS,S and other first-generation malaria vaccines have led scientists to evaluate new platforms and second-generation approaches for malaria vaccines.\n  &#34;Recent successes with vaccines against COVID-19 highlight the advantages of mRNA-based platforms—notably highly targeted design, flexible and rapid manufacturing and ability to promote strong immune responses in a manner not yet explored,&#34; said Dr. Evelina Angov, a researcher at WRAIR&#39;s Malaria Biologics Branch and senior author on the paper. &#34;Our goal is to translate those advances to a safe, effective vaccine against malaria.&#34;\n  Like RTS,S, the vaccine relies on P. falciparum&#39;s circumsporozoite protein to elicit an immune response. However, rather than administering a version of the protein directly, this approach uses mRNA—accompanied by a lipid nanoparticle which protects from premature degradation and helps stimulate the immune system— to prompt cells to code for circumsporozoite protein themselves. Those proteins then trigger a protective response against malaria but cannot actually cause infection.\n  &#34;Our vaccine achieved high levels of protection against malaria infection in mice,&#34; said Katherine Mallory, a WRAIR researcher at the time of the article&#39;s submission and lead author on the paper. &#34;While more work remains before clinical testing, these results are an encouraging sign that an effective, mRNA-based   vaccine is achievable.&#34;             Citation: mRNA vaccine yields full protection against malaria in mice (2021, June 18) retrieved 18 June 2021 from https://medicalxpress.com/news/2021-06-mrna-vaccine-yields-full-malaria.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2021-06-18 21:59:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "疟疾,疫苗,vaccine", "title": "mRNA疫苗产生对小鼠疟疾的完全保护 ", "title_en": "mRNA vaccine yields full protection against malaria in mice", "transed": 1, "url": "https://medicalxpress.com/news/2021-06-mrna-vaccine-yields-full-malaria.html", "via": "", "real_tags": ["疟疾", "疫苗", "vaccine"]}, {"category": "", "categoryclass": "", "imagename": "bb612aedcb5a2e85ff6b4b9eda0a2f53.jpg", "infoid": 1066706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "布鲁塞尔，6月18日（路透社） - 字母表（GOOGL.O）单位谷歌可能面临其最大的监管威胁，欧盟反托拉斯监管机构在今年年底之前将正式调查进入其利润丰厚的数字广告业务。这件事。\n 它将标志着欧盟竞赛执法者对谷歌的一个新的前沿。它在过去十年中，该公司罚款超过80亿欧元（98亿美元），用于阻止在线购物，Android智能手机和在线广告中的竞争对手。\n 其中一个人表示，欧盟探测将重点关注谷歌＆＃39;职位达到广告商，出版商，中间人和竞争对手，其中一位人民表示，这表明上周的法国反垄断局比法国反垄断局＆＃39;\n 去年，谷歌在线广告募集了1470亿美元的收入，而不是世界上任何其他公司。广告在其属性，包括搜索，youtube和gmail，占大部分销售和利润。\n 大约16％的收入来自其显示或网络业务，其中其他媒体公司使用Google技术在其网站和应用程序上销售广告。\n 两个单位都在火灾中。美国司法部由一些国家加入谷歌去年滥用其在搜索广告中的主导地位。一群由德克萨斯州领导的国家在后期诉讼中重点关注房屋网络侧的反竞争行为。\n 上周法国与谷歌定居了2.68亿美元，并对与网络业务相关的类似指控的各种承诺，该单位还必须与英国和＃39;竞争监管机构密切合作即将到来的软件变更，作为结算日期的结算的一部分。阅读更多 \n委员会拒绝发表评论。谷歌没有立即回复评论请求。\n 新的欧盟询问最终可能会瞄准所有谷歌和＃39;帝国。市场研究员Emarketer期望谷歌今年控制27％的全球在线广告支出，其中搜索广告和10％的显示器为57％。\n 虽然这些数字可能不会在第一个腮红，广告商和竞争对手争夺谷歌＆＃39;各种软件在市场上很多方面发挥作用，而该公司无法避免。\n 他们说谷歌利用依赖买家，卖家和中介机构已经提取了各方的高费用，并阻止竞争对手与它相当竞争。\n 在今年早些时候发送给谷歌竞争对手和第三方的调查问卷中，欧盟看门狗询问广告商是否在使用谷歌中间人允许广告商或媒体机构购买许多来源广告库存时接受折扣。阅读更多\n 委员会应在律师事务所Hausfeld的合作伙伴兼任的合伙人的开始之前结束持续的案件，并为谷歌提出若干申诉人。\n ＆＃34;来自从业者和＃39; S的角度来看，从行业和＃39; S的观点同样重要的是将调查带入当地搜索和谷歌＆＃39;在其他当局已将调查打开到谷歌和＃39; SDECH，＆＃34;他说。 ", "note_en": "BRUSSELS, June 18 (Reuters) - Alphabet  (GOOGL.O) unit Google could face its biggest regulatory threat, with EU antitrust regulators set to open a formal investigation into its lucrative digital advertising business before the end of the year, said people familiar with the matter.\n It would mark a new front by the EU competition enforcer against Google. It has in the last decade fined the company more than 8 billion euros ($9.8 billion) for blocking rivals in online shopping, Android smartphones and online advertising.\n An EU probe would focus on Google&#39;s position vis-a-vis advertisers, publishers, intermediaries and rivals, one of the people said, indicating deeper scrutiny than the French antitrust agency&#39;s case concluded last week.\n Google made $147 billion in revenue from online ads last year, more than any other company in the world. Ads on its properties, including search, YouTube and Gmail, accounted for the bulk of sales and profits.\n About 16% of revenue came from its display or network business, in which other media companies use Google technology to sell ads on their website and apps.\n Both units are under fire. The U.S. Justice Department, joined by some states, sued Google last year for abusing its dominance in search ads. A group of states led by Texas in a later lawsuit focused on anti-competitive behaviour on the network side of the house.\n France last week settled with Google for $268 million and various commitments over similar allegations related to the network business, and the unit also must work closely with Britain&#39;s competition regulator on upcoming software changes as part of a settlement reached days later.  read more\n The Commission declined to comment. Google did not immediately respond to a request for comment.\n A new EU inquiry could end up targeting all of Google&#39;s ad empire. Market researcher eMarketer expects Google to control 27% of global online ad spending this year, including 57% for search ads and 10% of display.\n While the numbers may not look monopolistic at first blush, advertisers and rivals contend that Google&#39;s various software play a role in so many facets of the market that the company is impossible to avoid.\n They say Google takes advantage of the dependence buyers, sellers and intermediaries have on it to extract high fees from all sides and block rivals from fairly competing with it.\n In a questionnaire sent to Google rivals and third parties earlier this year and seen by Reuters, the EU watchdog asked if advertisers receive rebates when they use Google intermediaries which allow advertisers or media agencies to buy advertising inventory from many sources.   read more\n The Commission should conclude ongoing cases before starting new ones, said Thomas Hoppner, a partner at law firm Hausfeld, and who advises several complainants against Google.\n &#34;From the practitioner&#39;s point of view and from the industry&#39;s point of view, it appears equally important to bring investigations into local search and Google&#39;s job search to an end when other authorities have opened investigations into Google&#39;s adtech,&#34; he said.", "posttime": "2021-06-18 21:52:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,google,广告,谷歌,广告业务", "title": "来源：欧盟反垄断监管机构计划在年底之前对谷歌的数字广告业务进行正式调查 ", "title_en": "Sources: EU antitrust regulators plan to open a formal investigation into Google's digital advertising business before the end of the year", "transed": 1, "url": "https://www.reuters.com/technology/eu-antitrust-regulators-probe-googles-adtech-business-by-year-end-sources-2021-06-18/", "via": "", "real_tags": ["rust", "google", "广告", "谷歌", "广告业务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们对GNU Coreutils的界面和操作进行了非常仔细的考虑，但遗憾的是由于倒退兼容性，这些实用程序可能会混淆一些行为或默认值。该信息将继续更新并与Coreutils FAQ重叠，此列表集中在较少频繁的潜在问题上。\n chmod -r是冗余和棘手的。如果例如，从VFAT复制一个目录，并希望在文件中关闭CHMOD-644上的可执行位，这将无法重复，因为它可以从DIR中删除可执行位。这是可实现的方法：Cutn＆＃39; t使用由任意空白分隔的字段和＃39; s往往更好地使用awk oreven join -a1 -o1。$字段$ file / dev / null uct -s仅抑制不分隔符的行。因此，如果您有一个缺少现场的行，它确实包含一些分隔符，则输出空行\n 同样，如果您想要在没有分隔符时输出空行需要将分隔符（如：\n  dd iflag = fullblock通常是在从FIFO /管道读取时所需的内容，你经常得到一个简短的读数，这意味着如果你指定＆＃34，你会得到太少的数据。如果您指定＆＃34，则计算＆＃34;或者太多数据;同步＆＃34;例如：注意自版本8.10以来，我们确实在某些情况下发出警告，但没有计数= 1 aboveas短读数通常与＆＃34的习语一起使用计数= 1;虽然可能是DD Iflag =非阻塞是一个Moredirect和一般方式来做这件事吗？ dd conv = noerror真的也需要conv = syncso认为，如果从失败磁盘读取，则一个人得到正确对齐的数据，用nuls替换为unuls.note如果块中的任何位置都有读取错误，则将丢弃整个块。因此，在速度（更大）之间的平衡并最小化数据丢失（更小）。这在更专用的toollike ddrescue中，可以更简单，更为动态。\n dd skip = 0x100不跳过跳过的东西和＃34; 0x＆＃34;前缀被视为零乘法器.Coreuls＆gt; = 8.26至少会警告这一点，建议使用＆＃34; 00x＆＃34;如果这真的是意图。\n 有关完全可移植性，请在解析DF的输出时，需要-P选项。避免了线包装，虽然自版本8.11（2011年4月）以来，虽然DF将不再包装线条来帮助避免这款GOTCHA。此外，如果需要解析标题，则-p选项将使用更标准化（但含糊不清）的Wording.See也是块大小问题。如果两个或多个硬链接指向同一文件，则仅计算其中一个链接。文件参数顺序会影响哪些链接，并更改参数顺序可能会更改DU输出的数字。注意这也影响了困惑的指定目录：$ cd git / coreutils $ du-s ./tests593120 ./tests593120 ./$ du -s ./tests ./＃深度首先获取列出的项目（虽然独立计数）10036。/tests583084 ./＃注意顺序即使具有隐式独立$ du -s  -  separate-dirs ./tests ./tests ./128 ./tests16268 ./$ du -s  -  separate-dirs ./tests16268 ./tests16268 ./\nNote Du Donn＆＃39; t特殊处理Refrinked文件，因此将计算回流文件的所有实例。 Echo是非便携式，其行为在系统和shell内置等中发散等等。一个应该真正考虑使用printf。这个shell会话说明了一些不一致的东西。您看到的位置，您认为CoreutilsStandlone版本：$ echo -e -n＃输出没有$ echo -n -e $ echo  -  -n＃选项终结器输出 -  -n $ posixly_correct = 1 envecho -e -ne -n​​ $ posixly_correct = 1 envecho -n -e＃无输出无论‽ \nWarning: Can only detect less than 5000 characters", "note_en": "We make very careful considerations about the interface and operationof the GNU coreutils, but unfortunately due to backwards compatibilityreasons, some behaviours or  defaultsof these utilities can be confusing. This information will continue to be updated and overlaps somewhat with the  coreutils FAQ,with this list focusing on less frequent potential issues.\n chmod -R is redundant and tricky.If for example you copy a dir from VFAT and want to turn off executable bits on filesusing  chmod -R 644,that will fail to recurse as it removes the executable bits from dirs.This is achievable in various ways:  cut doesn&#39;t work with fields separated by arbitrary whitespace.It&#39;s often better to use  awk oreven  join -a1 -o1.$field $file /dev/null cut -s only suppresses lines without delimiters.Therefore if you have a line with a missing fieldbut it does contain some delimiters, a blank line is output\n Similarly, if you want to output a blank line when there are no delimitersone needs to append a delimiter like:\n  dd  iflag=fullblock is usually what you wantbecause when reading from a fifo/pipe you often get a short read,which means you get too little data if you specify &#34; count&#34;,or too much data if you specify &#34; sync&#34;. For example: Note we do warn in certain cases since version 8.10, but not with count=1 aboveas short reads are often used with count=1 as an idiom to &#34;consume available data&#34;,though perhaps  dd iflag=nonblock would be a moredirect and general way to do that? dd  conv=noerror really also needs  conv=syncso that if reading from failing disk,one gets correctly aligned data, with unreadable bits replaced with NULs.Note if there is a read error anywhere in a block,the whole block will be discarded. So one needsto balance between speed (bigger) and minimized data loss (smaller).This is simpler and more dynamic in a more dedicated toollike  ddrescue.\n dd  skip=0x100 doesn&#39;t skip anythingas the &#34;0x&#34; prefix is treated as a zero multiplier.coreutils &gt;= 8.26 will warn about this at least,suggesting to use &#34;00x&#34; if that really was the intention.\n For full portability the  -P option is neededwhen parsing the output from df. Line wrapping is avoided, thoughdf will no longer wrap lines since version 8.11 (Apr 2011) to helpavoid this gotcha. Also if one needs to parse the header,the  -P option will use more standardised (but ambiguous) wording.See also the  Block size issue. If two or more hard links point to the same file, only one of thehard links is counted. The FILE argument order affects which links arecounted, and changing the argument order may change the numbers that du outputs. Note this also impacts specified directories which is confusing: $ cd git/coreutils$ du -s ./ ./tests593120 ./$ du -s ./tests ./  # depth first gets items listed (though counted independently)10036 ./tests583084 ./ # Note order is significant even with implicit independence$ du -s --separate-dirs ./tests ./128 ./tests16268 ./$ du -s --separate-dirs ./ ./tests16268 ./\nNote du doesn&#39;t handle  reflinked files specially,and thus will count all instances of a reflinked file.  echo is non portable and its behaviour diverges betweensystems and shell builtins etc. One should really consider using printf instead.This shell session illustrates some inconsistencies.Where you see  env being used, that is selecting the coreutilsstandalone version: $ echo -e -n  # outputs nothing$ echo -n -e$ echo -- -n  # option terminator outputted-- -n$ POSIXLY_CORRECT=1 env echo -e -n-e -n$ POSIXLY_CORRECT=1 env echo -n -e  # no output either ‽\n The exit status of expr is a confusing gotcha.POSIX states that exit status of 1 is used if &#34;the expression evaluates to null or zero&#34;,which you can see in these examples: $ expr 2 - 1; echo $?10$ expr 2 - 2; echo $?01$ expr substr 01 1 1; echo $?01$ expr &#39; &#39; : &#39;^ *$&#39;; echo $?10$ expr &#39;&#39; : &#39;^ *$&#39;; echo $?01 # number of matched characters returned$ expr 0 : &#39;[0-9]$&#39;; echo $?10 # actual matched characters returned$ expr 0 : &#39;\\([0-9]\\)$&#39;; echo $?01\nThe string matching above is especially confusing, thoughdoes conform to POSIX, and is consistent across solaris, FreeBSD and GNU utils. As for changing the behaviour, it&#39;s probably not possible due tobackwards compatibility issues. For example the &#39;^..*$&#39; casewould need to change the handling of the &#39;*&#39; in the expression,which would break a script like: printf &#39;%s\\n&#39; 1 2 &#39;&#39; 3 |while read line; do expr &#34;$line&#34; : &#39;^[0-9]*$&#39; &gt;/dev/null || break # at first blank line echo process &#34;$line&#34;done\nNote, using a leading ^ in the expression is redundant and non portable. ls -lrt will also reverse sort names for fileswith matching timestamps (common in /dev/ and /proc/ etc.)This is as per POSIX but probably not what the user wanted.There is no way to reverse by time and have non reversed name sorting.  ln -nsf is needed to update symlinks,though note that this will overwrite existing files,and cause links to be created within existing directories.  mkdir -p --mode=... only applies the mode to theright-most directory. Any parent directories are created with&#39;u+wx&#39; modified by umask. If you want to control the mode for all created dirs,you can use a umask like Note that the user &#39;wx&#39; bits can not be cleared for parent dirs.Note also that special mode bits like setuid are not set atomically,either with --mode on the right-most directory, or a subsequent chmod requiredfor created parent directories. Note also to be careful with  chmod -R  If changing the umask before invoking mkdir is not that easy - maybebecause not called via a shell -, then an alternative to the aboveumask method is to specify each of the target directories separately,e.g.: But it is important to know that &#39;mkdir&#39; does not adjust the permissionbits if any of those directories already existed.If you do want to ensure a directory hierarchy with particular permissionsone can use the `install` command instead like:   nl defaults to  -d &#39;\\:&#39; by default.Therefore any lines that contain only  &#39;\\:&#39;,  &#39;\\:\\:&#39;or  &#39;\\:\\:\\:&#39; will reset numbering.If you want to number lines irrespective on content then you need to specify  -d &#39;&#39;,or alternatively use the less flexible  cat -n option. The checksum utilities like md5sum, sha1sum etc. add backslashes to the output namesif those names contain &#39;\\n&#39; or &#39;\\&#39; characters. Also &#39;*&#39; is added to the outputwhere O_BINARY is significant (CYGWIN). Therefore automatic processing of theseutilities require one to  unescape first.  rm -rf does not mean &#34;delete as much as possible&#34;. It only avoids prompts.For example with a non writeable dir, you will not be ableto remove any contents. Therefore this is sometimes necessary to:  A very common issue encountered is with the default ordering of the  sort utility.Usually what is required is a simple byte comparison, though by default the collationorder of the current locale is used. To use the simple comparison logic you can LC_ALL=C sort ... as detailed in the FAQ. As well as being slower, the locale based ordering can often be surprising.For example some character representations,like the full width forms of latin numbers, compare equal to each other. $ printf &#39;%s\\n&#39; ２ １ | ltrace -e strcoll sortsort-&gt;strcoll(&#34;\\357\\274\\222&#34;, &#34;\\357\\274\\221&#34;) = 0２１$ printf &#39;%s\\n&#39; ２ １ | sort -u２\nThe equal comparison issue with --unique can even impact inthe &#34;C&#34; locale, for example with  --numeric-sort dropping items unexpectedly.Note this example also demonstrates that --unique implies --stable,to select the first encountered item in the matching set.  Related to locale ordering, there is the  i18n patchon Fedora/RHEL/SUSE which has its own issues. Note disabling the locale specifichandling as described above effectively avoids these issues.  Example 2: case folding results in incorrect ordering:  Fields specified with  -k are separated by default by runs of blank characters (space and tab),and by default the blank characters preceding a field are  included in the comparison,which depending on your locale could be significant to the sorting order. This is confusing enoughon its own, but is compounded with the  --field-separator and  --ignore-leading-blanks options.Ignoring leading blanks (-b) is particularly confusing, because... Also precisely specifying a particular field, requires both the start  and endfields specified. I.E. to sort on field 2 you use -k2 ,2. These field delineation issues along with others are so confusing,that the  sort --debug option was addedin version 8.6 to highlight the matching extent and other consequences of the various options.\n  sort -R does randomize the input similarlyto the shuf command, but also ensures that matching keys are grouped together.shuf also provides optimizations when outputting a subset of the input.  split produces file names that may be surprising,as it defaults to a two letter suffix for initial files, butto support an arbitrary number of files, has a feature to widen the letters inthe output file names as needed. The widening scheme ensures file names are sorted correctlywhen using standard shell sorting, when subsequently listing orconcatenating the resultant files. For example:  split behaves the same with the --numeric-suffixes/-d option, which couldlead to unexpected numeric sequences. This was done again to ease sortingof the output (which is usually not inspected by humans for large sequences),but mainly for backwards compatibility with existing concatenation scriptsthat use standard sorting. The recommended solution is to specify a -a/--suffix-length parameterwhich still allows for standard ordering at the shell,but with more natural numbers:  tac like  wc has issues dealing with files withouta last &#39;\\n&#39; character.  tail -F is probably what you want rather than -fas the latter doesn&#39;t follow log rotations etc. tee by default will exit immediately upon receiving SIGPIPEto be POSIX compliant and to support applications like yes | tee log | timeout process.Now this is problematic in the presence of &#34;early close&#34; pipes,often seen when combining tee with bash &gt;(process substitutions).Starting with coreutils 8.24 (Jul 2015), tee has the new -p, --output-erroroption to control the operation in such cases. $ seq 100000 | tee &gt;(head -n1) &gt; &gt;(tail -n1)114139$ seq 100000 | tee -p &gt;(head -n1) &gt; &gt;(tail -n1)1100000\n The mode of operation of test depends on the number of arguments.Therefore you will not get an expected error in cases like test -s $file || echo no data &gt;&amp;2,if &#34;$file&#34; is empty or unset. That&#39;s because test(1) will thenbe operating in string testing mode, which will return successdue to &#34;-s&#34; being interpreted as a true expression.Instead ensure the variable is appropriately quoted to avoid such issues: test -s &#34;$file&#34; || echo no data &gt;&amp;2.  wc -l on a file in which the last linedoesn&#39;t end with &#39;\\n&#39; character will return a value of one-less thanmight be expected as wc is standardised to just count &#39;\\n&#39; characters.POSIX in fact doesn&#39;t consider a file without a &#39;\\n&#39; as the last characterto be a text file at all. Also by only counting &#39;\\n&#39; characters resultsin consistent counts whether counting concatenated files, ortotaling individual files.  wc -L counts the maximum  display width for a line,considering only valid, printable characters, but not terminal control codes. # invalid UTF-8 sequence not counted:$ printf &#34;\\xe2\\xf2\\xa5&#34; | wc -L0 # unprintable characters  even in the C locale are not counted:$ printf &#34;\\xe2\\x99\\xa5&#34; | LC_ALL=C wc -L0 # Bytes can be counted using sed:$ printf &#34;\\xe2\\x99\\xa5&#34; | LC_ALL=C sed &#39;s/././g&#39; | wc -L3 # Terminal control chars are not handled specially:$ printf &#39;\\x1b[33mf\\bred\\x1b[m\\n&#39; | tee /dev/tty | wc -L red10\n The  df,  du,  ls --block-sizeoption is unusual in that appending a  B to the unit, changes it  from binary to decimal.I.E. KB means 1000, while K means 1024. In general the units representations in coreutils are unfortunate,but an accident of history.POSIX species &#39;k&#39; and &#39;b&#39; to mean 1024 and 512 respectively.Standards wise &#39;k&#39; should really mean 1000 and &#39;K&#39; 1024.Then extending from that we now have (which we can&#39;t change for compatibility reasons): Note there is new flexibility to consider when controlling theoutput of numeric units, by leveraging the  numfmtutility. For example to control the output of du you could definea function like:  Discussed separately at  Time zone ambiguities", "posttime": "2021-06-18 21:51:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coreutils,输出", "title": "Coreutils Gotchas（2015年） ", "title_en": "Coreutils Gotchas (2015)", "transed": 1, "url": "https://www.pixelbeat.org/docs/coreutils-gotchas.html", "via": "", "real_tags": ["coreutils", "输出"]}, {"category": "", "categoryclass": "", "imagename": "2ba9f13b54930402d8045c07800023b0.jpg", "infoid": 1066703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当戒指想要提高IT监控摄像机并将其自我称为战斗公司燃烧的销售时，它踏上了许多初创公司熟悉的品牌大使营销活动。但而不是追逐Instagram影响者或击败博主，而是该公司，而是洛杉矶警察局的官员。\n 多年来，包括在亚马逊的公司早期所有权期间，戒指不少于100个官员或价值数万美元的免费设备或折扣代码，并且可能更多，根据洛杉矶时报的新报告。\n 通过公共纪录的LA时获取电子邮件请求揭示戒指员工鼓励LAPD官员“传播关于这种门铃的消息，以便在社区减少犯罪”并提供免费赠品和折扣。\n “戒指及其与警察部门（包括LAPD）的关系，只是一个新兴问题的一个例子，其中缺乏明确的公共部门结束和私人监督资本主义开始，”穆罕默德·塔杰尔，高级员工律师南加州的ACLU告诉ARS。\n 作为影响者竞选的词语传播通过LAPD，无论如何都没有被戒指员工达到的官员，要求免费产品和折扣。\n “我们有一个兴趣询问..”玛丽亚雷德写道。 “每年，我们都有一个西拉分部海滩派对......我们使用我们的MEDLY站基金并购买一些礼品，以作为奖品抽奖。没有我问，你看到我在哪里使用这封电子邮件吗？更重要的是，我们希望您来参加您。带一些朋友，我们的款待。“ 8月Cziment，戒指的业务总监，回答说：“我们很乐意捐赠一个戒指门铃，也许是一个新的太阳能安全标志如果感兴趣？ :)“\n 在一名官员发送了一封纳入宣传语言的电子邮件后，另一个车站在免费的免费赠品中获得了超过12,000美元的免费赠品。 \nLAPD当然有一个道德代码。它说，官员可能不会“使用他们的立场直接或间接无名的特权或豁免”，他们“他们”不接受任何可能合理地解释为影响其影响的任何礼物，小费或有利于的人关于城市企业的行动。“但对于许多案例，时代未发现，LAPD似乎没有关注。折扣代码“通常与我们的道德准则不冲突”，“DET。梅根aguilar告诉拉时代。 “当然，每种情况都按案例进行了看待。”\n 一封电子邮件交换显示官员如何模糊倡导一类安全摄像机等安全产品 - 这是允许的，有时会鼓励 - 为特定品牌等销售人员。官员Eric Mollinedo通过2016年4月询问促销戒指的Cziment询问促销代码和免费的门铃，提到他将在公共安全展览会上展开展位。 Cziment愉快地向他发送了一个免费的单位以及展位的传单。 Mollinedo之后通过电子邮件发送，“今天是一个美好的一天，在公共安全展览会上......谈到了戒指和（5）名人/储备官员购买他们！”\n 泰勒州泰勒州泰勒州王室，表示这种安排并不令人惊讶。 “特别是戒指有偷猎警察院长和高管的历史，雇用他们，然后使用他们与他们以前的生活的联系兜售戒指的商品，”他说。 “它真的是一个旋转的门环创造，以获得全国各地的市场份额。这提高了关于腐败的整个道德问题，涉及差额的差额，以及围绕披露的道德规范。“\n  戒指的活动是在公司与LAPD合作的时候来到洛杉矶的威尔希尔帕克街区的500个免费视频门铃，以试图证明其犯罪索赔。 2016年3月，LAPD和Ring宣布宣布联合新闻发布会，在邻居安装只有40个摄像机后，盗窃六个月下降了55％。后来，公司会修改结果，说下降七个月，而不是六个月。\n    既没有同行审查，戒指都没有发布其研究的具体细节，但麻省理工学院技术审查报告对调查结果产生了疑虑。在收到邻里协会的安装相机的位置并在审查这些地区的公共数据后，记者标记哈里斯发现，与上一年相比，盗窃事实上增加了。更重要的是，到2017年，盗窃七年来飙升至最高。尽管如此，戒指继续推出其“犯罪战斗”能力。\n  环绕其邻近应用程序的时间绕过其影响者的活动，允许用户在附近的视频上分享和评论。 LAPD可访问专用环形门户以定位和请求素材。该公司将门户票为节约时间，在视频中发言，它向警察部门发送，“不再走门到门，寻找相机并要求镜头。”所有调查人员必须做的是设置一个特定的时间和地区的感兴趣的时间和领域，环助攻联系相机日志与查询匹配的用户。\n 除了与LAPD的安排外，戒指还在美国举办了数百名警察部门，以便他们进入执法门户。 Tajsar说，戒指的隐私政策是“LAX”。 \n“这正是为什么戒指对警察部门营销如此积极的营销，”塔杰尔说。 “他们认为警察部门是猫的爪子。他们可以为他们做戒指的营销，而不是直接到我们的戒指。“\n 门户网站还允许执法在许多情况下以申请权证的需求，这提供了司法监督和更大的透明度。由于许多戒指用户自愿发布视频到邻居应用程序，部门可以访问更多愿意与他们共享镜头的人。\n 在LA时联系戒指之前，该公司更新了其政策，因此人们可以通过添加称为“援助请求”的邮寄类别来查看执法机构的素材请求。挂钩？您必须使用邻居应用来查看镜头。\n 私人受控监视网络的传播，为执法人员提供准备好的访问有关的隐私倡导者。 “这里的虐待潜力是巨大的，”塔杰尔说。\n “违法行为，”国家律师协会的律师和前任执行董事，律师和前任执行董事“，它有这么多的公民自由空间。 “当你有人民对财产或暴力犯罪的恐惧升级时，它会改变他们解释沿着街道上的人的普通行为或响起他们的门铃，”她说，“这可以[导致]彩色社区[作为犯罪是错误的。“ ", "note_en": "When Ring wanted to boost sales of it surveillance cameras and burnish its self-styled image as a crime-fighting company, it embarked on a brand-ambassador marketing campaign that would be familiar to many startups. But rather than chase down the Instagram influencers or beat bloggers, the company instead wooed officers at the Los Angeles Police Department.\n For years, including during Amazon’s early ownership of the company, Ring gave no fewer than 100 LAPD officers free devices or discount codes worth tens of thousands of dollars, and possibly more, according to a new report from the  Los Angeles Times.\n Emails obtained by the LA Times through a public records request reveal Ring employees encouraging LAPD officers to “spread the word about how this doorbell is proven to reduce crime in neighborhoods” and offering freebies and discounts.\n “Ring and its relationship with police departments, including the LAPD, is but one example of a burgeoning problem in which there is a lack of clarity as to where the public sector ends and private surveillance capitalism begins,” Mohammad Tajsar, senior staff attorney with the ACLU of Southern California, told Ars.\n As word of the influencer campaign spread through the LAPD, officers who weren’t approached by Ring employees reached out to them anyway, requesting free products and discounts.\n “We have a favor to ask..,” wrote Officer Maria Gray. “Every year, we have a West LA Division Beach party... We use our measly station fund and buy some gifts to raffle off as prizes. Without me asking, do you see where I’m going with this email? More importantly, we’d love for you to come and attend. Bring some friends, our treat.” August Cziment, Ring’s director of operations, replied, “We’d be happy to donate a Ring Doorbell and perhaps a new Solar Powered Security sign if that’s of interest? :)”\n Another station received more than $12,000 in freebies after an officer sent an email containing promotional language that he first had Cziment approve.\n     LAPD has an  ethics code, of course. It says that officers may not “use their position to secure directly or indirectly unwarranted privileges or exemptions for themselves or others” and they “shall not accept any gifts, gratuities or favors of any kind which might reasonably be interpreted as an attempt to influence their actions with respect to City business.” But for many of the cases the Times uncovered, the LAPD did not appear to be concerned. Discount codes are “generally not in conflict with our Code of Ethics,” Det. Meghan Aguilar told the LA Times. “Of course, each situation is looked at on a case by case basis.”\n One email exchange shows how officers blurred the lines between advocating for a class of security products like security cameras—which is allowed and sometimes encouraged—and becoming outright salespeople for specific brands like Ring. Officer Eric Mollinedo emailed Ring’s Cziment in April 2016 asking for promo codes and a free doorbell, mentioning that he would be working a booth at a public safety fair. Cziment happily sent him a free unit along with flyers for the booth. Mollinedo later emailed Cziment, saying, “Was a good day today at the Public Safety fair... talked up Ring and had (5) officers/reserve officers purchase them!”\n Tajsar, the ACLU attorney, said this sort of arrangement isn’t surprising. “Ring in particular has a history of poaching police chiefs and executives, hiring them, and then using them to peddle Ring’s wares with the connections they have from their former lives,” he said. “It really is a revolving door Ring has created to gain market share across the country. That raises a whole host of ethical concerns about corruption, pay to play, and ethics rules around disclosures.”\n  Ring’s campaign came at a time when the company had partnered with LAPD to give out 500 free video doorbells in Los Angeles’ Wilshire Park neighborhood in an attempt to prove its crime-fighting claims. In March 2016, LAPD and Ring held a  joint news conference announcing that, after installing just 40 cameras in the neighborhood, burglaries had dropped by 55 percent in six months. Later, the company would amend the results, saying the drop occurred over seven months, not six.\n    Neither claim was peer-reviewed, and Ring hasn’t released the specifics of its study, but a report by  MIT Technology Review cast doubt on the findings. After receiving the locations of the installed cameras from the neighborhood association and after examining public data on crime in those districts, reporter Mark Harris found that burglaries had, in fact, increased when compared with the previous year. What’s more, by 2017, burglaries had surged to their highest in seven years. Nonetheless, Ring  continued to tout its “crime fighting” capabilities.\n  Ring wound down its influencer campaign around the time it rolled out its Neighbors app, which allows users to share and comment on nearby videos. LAPD was given access to a special Ring-provided portal to locate and request footage. The company bills the portal as a time-saver,  saying in videos it sends to police departments, “No more going door-to-door to look for cameras and asking for footage.” All investigators have to do is set a specific time and area of interest and Ring assists in contacting users whose camera logs match the query.\n In addition to the arrangement with the LAPD, Ring has made deals with  hundreds of police departments across the US to give them access to the law enforcement portal. Ring’s privacy policy regarding footage is “lax,” Tajsar said.\n “That’s exactly why Ring is so aggressively marketing toward police departments,” Tajsar said. “They see police departments as the cat’s paw. They can do Ring’s marketing for them rather than Ring coming directly to us.”\n The portal also allows law enforcement in many instances to sidestep the need for a warrant, which provides judicial oversight and greater transparency. Since many Ring users voluntarily post videos to the Neighbors app, departments have access to a pool of people who are more willing to share footage with them.\n After the LA Times contacted Ring for comment ahead of the story, the company updated its policies so people can view footage requests from law enforcement agencies by adding a post category called “Request for Assistance.” The hitch? You have to use the Neighbors app to see the footage.\n The spread of a privately controlled surveillance network that offers ready access for law enforcement has privacy advocates concerned. “The potential for abuse here is tremendous,” Tajsar said.\n “It has so much room for civil liberties violations,” Heidi Boghosian, a lawyer and former executive director of the National Lawyers Guild, told the LA Times. “When you have the escalation of people’s fears of property or violent crime, it changes the way they interpret ordinary actions of someone walking down the street or ringing their doorbell,” she said, “And that can [lead to] communities of color [being] falsely accused of crimes.”", "posttime": "2021-06-18 21:15:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "相机,免费,警察,gave,戒指", "title": "环给警察免费相机建造和促进监控网络 ", "title_en": "Ring gave cops free cameras to build and promote surveillance network", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/06/ring-gave-police-officers-free-cameras-as-part-of-an-influencer-marketing-campaign/", "via": "", "real_tags": ["相机", "免费", "警察", "gave", "戒指"]}, {"category": "", "categoryclass": "", "imagename": "73c48979c963e22bef198bf40f0f6371.jpg", "infoid": 1066702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于网络犯罪分子采用更复杂的策略，因此赎金软件攻击正在全球上升。联邦调查局报告称，在2020年的美国赎制厂的总损失增加了225％。根据网络安全创业，企业每11秒攻击，平均而损失损失达到200亿美元。在此背景下，Cyber​​ ay全球赎金软件研究测量了这些攻击对企业造成的金融和声誉造成的损害。\n 处理赎制软件攻击的后果可能是复杂且昂贵的。绝大多数组织由于赎金软件攻击而产生重大的业务影响，包括收入损失（66％），对本组织品牌的损害（53％），无计划的劳动力减少（29％），甚至完全关闭业务（25 ％）。\n   一个组织经历了赎金软件攻击后，实现的前5名解决方案包括安全意识培训（48％），安全运营（SOC）（48％），端点保护（44％），数据备份和恢复（43％）和电子邮件扫描（41％）。攻击后的最少部署的解决方案包括Web扫描（40％），端点检测和响应（EDR）和扩展检测和响应（XDR）技术（38％），防病毒软件（38％），移动和短信安全解决方案（36 ％）和托管安全服务提供者（MSSP）或托管检测和响应（MDR）提供程序（34％）。只有3％的受访者表示，在赎金软件攻击后，他们没有提出任何新的安全投资。\n Cyber​​ Aeron的研究发现，由于同样的威胁行为者，这些组织在过去的任何组织中选择支付赎金需求的组织并没有免疫因果赎制软件攻击。事实上，通过第二次攻击袭击了80％的支付赎金的组织，几乎一半被同一威胁小组击中。\n 本研究向关键行业垂直的林软件攻击的业务影响有所了解，并揭示了可以利用以改善赎金软件防御的数据。例如，在一个组织经历了赎金软件攻击之后，实现的前两个解决方案包括安全意识培训（48％）和安全操作（48％）。这项研究强调了预防是管理赎制软件风险的最佳策略，并确保您的组织不在第一位击败赎金软件攻击。\n 1,263个网络安全专业人员参与了Cyber​​ ay委托的研究，并由Censuswide攻击，与来自美国，英国，西班牙，德国，法国，阿拉伯联合酋长国和新加坡不同行业的参与者。\n  VidtureBeat＆＃39; S使命是成为技术决策者的数字城市广场，以获得有关转型技术和Transact的知识。您网站提供有关数据技术和策略的基本信息，以指导您的领导您的组织。我们邀请您成为社区的成员，访问：门控思想领导者内容和对我们奖化事件的折扣访问，如转换2021：了解更多 \n成为会员 ", "note_en": "Ransomware attacks are on the rise globally as cybercriminals adopt more  sophisticated tactics. The Federal Bureau of Investigation reported a  225% increase in total losses from ransomware in the United States in 2020. According to Cybersecurity Ventures, businesses are under attack every 11 seconds, on average, and damage losses are projected to  reach $20 billion worldwide. Against this backdrop, the Cybereason Global Ransomware Study measured how much financial and reputational damage these attacks wreak on businesses.\n Dealing with the aftermath of a ransomware attack can be complicated and costly. The vast majority of organizations experienced  significant business impact due to ransomware attacks, including loss of revenue (66%), damage to the organization’s brand (53%), unplanned workforce reductions (29%), and even closure of the business altogether (25%).\n   After an organization experienced a ransomware attack, the top 5 solutions implemented included security awareness training (48%), security operations (SOC) (48%), endpoint protection (44%), data backup and recovery (43%), and email scanning (41%). The least deployed solutions post-attack included web scanning (40%), endpoint detection and response (EDR) and extended detection and response (XDR) technologies (38%), antivirus software (38%), mobile and SMS security solutions (36%), and managed security services provider (MSSP) or managed detection and response (MDR) provider (34%). Only 3% of respondents said they did not make any  new security investments after a ransomware attack.\n Cybereason’s study found that the majority of organizations that chose to pay ransom demands in the past were not immune to subsequent ransomware attacks, often by the same threat actors. In fact, 80% of organizations that paid the ransom were hit by a second attack, and almost half were hit by the same threat group.\n This study offers insight into the business impact of ransomware attacks across key industry verticals and reveals data that can be leveraged to improve ransomware defenses. For example, after an organization experienced a ransomware attack, the top two solutions implemented included security awareness training (48%) and security operations (48%). This research underscores that prevention is the best strategy for managing ransomware risk and ensuring your organization does not fall victim to a ransomware attack in the first place.\n 1,263 cybersecurity professionals took part in the study commissioned by Cybereason and fielded by Censuswide, with participants in varying industries from the United States, United Kingdom, Spain, Germany, France, United Arab Emirates, and Singapore.\n  VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-06-18 21:09:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,攻击,cited", "title": "研究：通过第二次赎金软件攻击击中了80％的组织犯了赎金的组织; 66％的Orgs在攻击后引用收入损失，53％引用品牌损坏 ", "title_en": "Study: 80% of organizations that paid a ransom were hit by a second ransomware attack; 66% orgs cited revenue losses after the attack and 53% cited brand damage", "transed": 1, "url": "https://venturebeat.com/2021/06/16/cybereason-80-of-orgs-that-paid-the-ransom-were-hit-again/", "via": "", "real_tags": ["软件", "攻击", "cited"]}, {"category": "", "categoryclass": "", "imagename": "34fe81a44a08da300af184952b58d436.jpeg", "infoid": 1066701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄勒冈州现在是美国的第三国，允许死亡的选择，这是对环境福利的普及：人类堆肥。\n  Gov.Katie Brown在周二签署了房屋比尔2574年法律，增加了西岸国家批准的生活选项的自然有机化量。帕姆沼泽（D  - 南部杰克逊县）赞助和开发，该法案遇到了俄勒冈人对传统死亡的可持续替代品的兴趣日益增长。\n    “这是人们思考的艰难问题;它不是一个决定我们任何人都能避免的决定，“沼泽通过电话告诉主板。 “它对所有消费者都有呼吁，肯定不是所有的消费者，而是对我们的许多人真正寻找如何考虑我们在生活后继续思考地球的足迹。”\n  这一举动从全国各地的环保主义者呼吁宣布，以清理生活结束行业。最常见的身体处置方法具有巨大的环境影响：传统墓葬，其中尸体用甲醛拆卸，并将地下放置在地下，永久占据大量的土地，并已被发现将毒素浸入附近的土壤和水道。火化 - 其中一个身体被烧成灰烬 - 是一种能量吮吸，并发出损害污染物和二氧化碳进入大气中的，有助于全球变暖。\n  相比之下，所谓的天然有机物还原的过程，将身体分解成土壤，具有小的环境足迹。例如，建议，该国的首个人类堆肥殡仪馆这样做：尸体被放置在一个带有有机材料的圆筒中，如木屑，植物和稻草，然后用钩子重复加热并重新转化几周分解成富含营养的土壤，可以送回家庭或用于种植。\n   人类堆肥是最新的环境死亡人员选择，以获得全国各地的牵引力，因为可用的公墓空间从火葬券下降和排放。\n  在人类堆肥之前，在没有化学物质的情况下，在没有化学物质的情况下制备身体并在有机可生物降解的容器中种植的绿色墓葬，通常在1998年的树苗中出现，作为传统的高冲击埋葬方法的替代方案。绿色葬礼委员会。作为一种环保优越的死亡方法，它也会因某些人而更轻松地估算死亡。这是一个困难的话题，乔蒂昂布勒，保护墓葬联盟的董事会成员说，但知道你或爱人可以通过堆肥或绿墓来死亡 - 使其更容易处理。 \n“感觉就像一个非常和平的选择，”布尔说。 “那些有人变成的土壤可以用来滋养植物的想法对人们来说感觉非常好。它有助于打破一些禁忌的死亡和死亡。“\n  俄勒冈州的法律于2022年7月生效，遵循邻国的类似势头。华盛顿成为美国的第一个，以合法化2019年的自然有机物减少，这导致了重点的开放。 5月，科罗拉多州做了相同的事。\n  在大多数国家，这种做法仍然是违法的，让那些想要一系列生态友好的生活选项卡住了有限的选择。但纽约和特拉华州等国家的立法者在最近几个月审议了将改变这一点的票据。如果在全国范围内采用，人类堆肥可能会减少美国葬礼行业的环境影响，而且能改变我们谈论死亡的方式。\n  “我们的文化一直处于证人或避免模式，”她说。 “我认为它＆＃39;是一个更大的运动的指导者...远离恐惧，以及如何使死亡和死亡更加有意义，更亲人的吸引力，”她说。 ", "note_en": "Oregon is now the third state in the US to allow a deathcare option that’s gaining popularity for its environmental benefits: human composting.\n  Gov. Katie Brown signed   House Bill 2574 into law on Tuesday, adding natural organic reduction to the range of approved after-life options in the west coast state. Sponsored and developed by Rep. Pam Marsh (D - Southern Jackson County), the bill met Oregonians’ growing interest in sustainable alternatives to traditional deathcare.\n    “This is a hard issue for people to think about; it&#39;s not a decision that any of us get to avoid,” Marsh told Motherboard over the phone. “It has an appeal, certainly not to all consumers, but to many of us who are really looking for ways to think about how our footprint on the earth continues after life is gone.”\n  The move heeds a   growing call from environmentalists across the country to clean up the end-of-life industry. The most common methods of body disposal come with hefty environmental impacts: traditional burials, in which a corpse is embalmed with formaldehyde and placed in a casket underground, permanently   occupy large swaths of land and have been found to   leach toxins into nearby soil and waterways. Cremation–in which a body is burned into ash—is an energy suck and emits damaging   pollutants and   carbon dioxide into the atmosphere, contributing to global warming.\n  By comparison, the process of so-called   natural organic reduction, which breaks down the body into soil, has a small environmental footprint. For example,   Recompose,   the country’s first human composting funeral home does it like this: a corpse is placed in a cylinder with organic materials, like wood chips, plants, and straw, then heated and turned repeatedly for several weeks with a hook until it’s broken down into a nutrient-rich soil that can be delivered back to the family or used for planting.\n   Human composting is the latest of a handful of environmental deathcare options to gain traction across the country as available   cemetery space declines and emissions from cremation mount .\n  Before human composting gained traction,   green burials—in which the body is prepared without chemicals and planted underground in an organic, biodegradable container, often underneath a tree sapling—emerged in 1998 as an alternative to traditional high-impact burial methods, according to the   Green Burial Council. Lauded as an environmentally superior deathcare method, it also makes reckoning with death easier for some. It’s a difficult topic, says Jodie Buller, board member of the Conservation Burial Alliance, but knowing that you or a loved one can die sustainably—through composting or green burials—makes it easier to handle.\n  “It feels like a very peaceful option,” Buller said. “The idea that the soil that someone becomes then can be used to nourish plants feels really good to people. It helps break down some of that taboo around death and dying.”\n  Oregon’s law, slated to go into effect in July, 2022, follows similar momentum in neighboring states. Washington became the first in the U.S. to legalize natural organic reduction in   2019, which led to the   opening of   Recompose. In May, Colorado   did the same.\n  The practice remains illegal in most states, leaving those who want an eco-friendly end-of-life option stuck with a limited range of options. But legislators in states like   New York and   Delaware have, in recent months, considered bills that would change this. If adopted widely across the country, human composting could cut down on the U.S. funeral industry’s environmental impact and, Buller says, change the way we talk about death.\n  “Our culture has been in either witness or avoidance mode,” she said. “I think it&#39;s a signifier of larger movements… away from fear, and toward curiosity, around how to make death and dying more meaningful and more personally engaging,” she said.", "posttime": "2021-06-18 21:08:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,legalized,死亡", "title": "俄勒冈州的人类堆肥已经合法化了 ", "title_en": "Oregon Has Legalized Human Composting", "transed": 1, "url": "https://www.vice.com/en/article/z3xz3j/oregon-has-legalized-human-composting", "via": "", "real_tags": ["人类", "legalized", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "0869a9cd88355e0107b572d1e2c4b5c5.jpeg", "infoid": 1066700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "盖因是一个数据增强库，目前支持四个模态（音频，图像，文本＆amp;视频）和超过100个增强。每个模态的增强都包含在自己的子图书馆内。这些子库包括基于函数和基于类的转换，构图运算符，并可以选择提供有关应用的变换的元数据，包括其强度。\n 盖因是一个伟大的图书馆，可以利用在模型培训中增加数据，或评估模型的稳健性差距！我们以旨在包括许多特定数据增强的特定数据增强，用户在Facebook＆＃39等互联网平台上的现实生活中执行 - 例如在图像/视频上覆盖文本/ emojis，从社交媒体中重新发布截图。虽然以速度包含更多通用数据增强，但如果您＆＃39;重新撰写副本检测，讨厌语音检测或版权侵权，那么它将特别适用于这些＆＃34;互联网用户＆＃34;数据增强类型是预先存在的。\n  要查看更多的增强示例，请在README中打开COLAB笔记本电脑，为每种方式！ （例如图像Readme＆amp; Colab）\n        或者克隆刚才如果要能够运行我们的单位测试，贡献拉索请求等：\n git clone git@github.com：FacebookResearch / Athly.git [可选，但推荐]公园Create-N AGLY＆amp;＆amp;＆amp;公园激活了AGLY＆amp; Conda安装pippip安装-e ably /\n 注意：在某些环境中，PIP＆＃39; T按预期安装Python-Magic。在这种情况下，您需要另外运行：\n       我们提供各种媒体资产以与我们的一些增强一起使用。这些资产包括： \nEmojis（Twemoji） - 版权所有2020 Twitter，Inc等贡献者。在麻省理工学院许可证下许可的代码。在CC-BY 4.0下许可的图形。\n 字体（NOTO字体） -  NOTO是谷歌公司的商标.NOTO字体是开源的。所有Noto字体都在SIL Open Font许可证版本1.1下发布。\n 屏幕截图模板 - 由Facebook的设计师创建的图像专门用于以速度使用。您可以使用它们在图像和视频库中的overlay_onto_screenshot增强，以使其看起来像您的源图像/视频在类似于Facebook或Instagram的社交媒体饲料中截图。\n   @misc {bitton2021augly，作者= {bitton，乔安娜和papakipos，zoe}，标题= {evly：一个音频，图像，文本和视频的数据增强库。 }，如何发表= {\\ url {https://github.com/facebookresearch/augly}}，年= {2021}}\n  以速度为许可，如许可证文件所示。请注意，AGILLY使用的一些依赖项可能会在不同的术语下获得许可。 ", "note_en": "AugLy is a data augmentations library that currently supports four modalities ( audio,  image,  text &amp;  video) and over 100 augmentations. Each modality’s augmentations are contained within its own sub-library. These sub-libraries include both function-based and class-based transforms, composition operators, and have the option to provide metadata about the transform applied, including its intensity.\n AugLy is a great library to utilize for augmenting your data in model training, or to evaluate the robustness gaps of your model! We designed AugLy to include many specific data augmentations that users perform in real life on internet platforms like Facebook&#39;s -- for example making an image into a meme, overlaying text/emojis on images/videos, reposting a screenshot from social media. While AugLy contains more generic data augmentations as well, it will be particularly useful to you if you&#39;re working on a problem like copy detection, hate speech detection, or copyright infringement where these &#34;internet user&#34; types of data augmentations are prelevant.\n  To see more examples of augmentations, open the Colab notebooks in the README for each modality! (e.g. image  README &amp;  Colab)\n        Or clone AugLy if you want to be able to run our unit tests, contribute a pull request, etc:\n git clone git@github.com:facebookresearch/AugLy.git[Optional, but recommended] conda create -n augly  &amp;&amp; conda activate augly  &amp;&amp; conda install pippip install -e AugLy/\n NOTE: In some environments,  pip doesn&#39;t install  python-magic as expected. In that case, you will need to additionally run:\n       We provide various media assets to use with some of our augmentations. These assets include:\n Emojis ( Twemoji) - Copyright 2020 Twitter, Inc and other contributors. Code licensed under the MIT License. Graphics licensed under CC-BY 4.0.\n Fonts ( Noto fonts) - Noto is a trademark of Google Inc. Noto fonts are open source. All Noto fonts are published under the SIL Open Font License, Version 1.1.\n Screenshot Templates - Images created by a designer at Facebook specifically to use with AugLy. You can use these with the  overlay_onto_screenshot augmentation in both the image and video libraries to make it look like your source image/video was screenshotted in a social media feed similar to Facebook or Instagram.\n   @misc{ bitton2021augly,  author =   {Bitton, Joanna and Papakipos, Zoe },  title =   {AugLy: A data augmentations library for audio, image, text, and video. },  howpublished =   {\\url{https://github.com/facebookresearch/AugLy} },  year =   {2021 }}\n  AugLy is MIT licensed, as found in the  LICENSE file. Please note that some of the dependencies AugLy uses may be licensed under different terms.", "posttime": "2021-06-18 21:08:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增强,multimodal,图像", "title": "丑陋：来自FB研究的新多峰数据增强库 ", "title_en": "AugLy: A new multimodal data augmentation lib from FB Research", "transed": 1, "url": "https://github.com/facebookresearch/AugLy", "via": "", "real_tags": ["增强", "图像"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066699, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在数据库字段和信息检索中，存在一个非常常见的场景。我有一个我想要存储的（分类）整数的列表，我希望尽可能高效地这样做。有几十种方法这样做，这是一个研究的热门话题。这是如此有用，因为您可以在排序的整数列表中运行这么多的地方，并获得大量优势。与通用压缩例程不同，我们通常可以利用我们理解我们试图与之合作的数据并获得更好结果的事实。\n 我需要压缩整数的原因（实际上，Int64值）是我试图跟踪一些数据的匹配，因此我跟踪的整数实际上是用户在Voron内部的数据偏移量。这导致了一些不同的场景，我必须处理：\n  我正在尝试弄清楚以尽可能高效的方式存储后面的两个选项的最佳方法。\n 第一个停止是Daniel Lemire的博客，自然地，因为他已经广泛写了这篇文章。我看了以下方案：FastPFOR和StreamVByte。它们具有稍微不同的目的，但基本上，FastP将使用位流，而StreamVbyte使用的字节导向模式。从理论上讲，您可以从Fastp for获得更好的压缩率，但StreamVByte应该更快。另一个整数压缩系统来自Facebook的大猩猩纸，这是一个更大的方案，包括时间序列值压缩。但是，该方案的一部分会谈论如何压缩整数（它们使用它来存储特定操作的刻度）。我们实际上是在RavendB内部的时间序列支持。\n 我不会覆盖深度，这里是大猩猩压缩的论文，相关描述在4.1.1节。足以说他们正在使用比特流和Deltas计算的三角洲。基本上，如果保持相同距离的值，则无需录制所有值，您可以自然地计算。在最佳情况下，Gorilla压缩需要每个值的单个比特，假设结果类似地间隔。\n 为我的目的，我希望尽可能高的压缩率，我需要只存储整数列表。大猩猩压缩的问题是，如果我们没有获得相同距离的数字，我们需要记录它们不同的金额。这意味着，至少，我们每张值至少需要9位。这令人遗憾地增加了。\n 另一方面，对于POR，有一个不同的系统。 PFOR计算批量整数所需的最大位数，然后录制这些值。我发现本文中的二进制包装部分（2.6）是最明确的解释，这是如何完成的。但是，POR的问题是，如果您有一个大的异常值，则会不必要地浪费大量的比特。 \n我决定看看我是否可以为此做点什么，并创建一个在一次批量的128个整数上工作的编码器。这个编码器将：\n 检查录制整数的增量所需的最大位数。沿着已经拯救了我们很多。\n 然后我们检查批处理的顶部和底部半数，看看我们是否会获得单独录制它们的好处。在这种情况下，将独立地记录到批处理中的一部分的单个大值（或其中一组）。\n 最后，如果我们还会分析我们进一步的批次，而不是仅记录有意义的位范围。这个想法是尝试在批处理中找到具有相同距离彼此相同的范围。我们可以将这些产品编码为重复而不是每个独立值。这最终可以节省令人惊讶的空间。\n 您可以在此处查看研究结果。我会注意你这是原始的，但结果很有希望。我能够通过一点击败（在压缩率方面）标准PFOR实现，代码较少。\n 我也在查看逼真的数据集的压缩率为30％ -  40％。如果数据正确设置，我能够利用重复的三角形优化，我可以紧紧包装。\n 目前，据说我可以在8KB缓冲区中向上推出10,000 int64值，而没有任何重复的Δ。如果我可以充分利用Deltas，它可以在8KB缓冲区中进入500,000 int64值。 \n我经常提及三角洲的原因，我很可能会录制大小相同的值，因此我们将获得彼此相同的空间的抵消。 在这种情况下，我的编码器进入镇，压缩率基本上是疯狂的。  这是一小部分更大的工作，但这是我第一次在Voron的水平上代码。 这很好玩。 ", "note_en": "In the database field and information retrieval in general, there is a very common scenario. I have a list of (sorted) integers that I want to store, and I want to do that in an as efficient a manner as possible. There are dozens of methods to do this and this is a hot topic for research. This is so useful because there are so many places where you can operate on a sorted integer list and gain massive benefits. Unlike generic compression routines, we can usually take advantage of the fact that we understand the data we are trying to work with and get better results.\n The reason I need to compress integers (actually, int64 values) is that I’m trying to keep track of matches for some data, so the integers that I’m tracking are actually file offsets for user’s data inside of Voron. That lead to a few different scenarios that I have to deal with:\n  I’m trying to figure out what is the best way to store the later two options in as efficient manner as possible.\n The first stop was  Daniel Lemire’s blog, naturally, since he has wrote about this extensively. I looked at the following schemes: FastPFor and StreamVByte. They have somewhat different purposes, but basically, FastPFor is using a bits stream while StreamVByte is using byte oriented mode. Theoretically speaking, you can get better compression rate from FastPFor, but StreamVByte is supposed to be faster. Another integer compression system come from the Gorilla paper from Facebook, that is a bigger scheme, which include time series values compression. However, part of that scheme talks about how you can compress integers (they use that to store the ticks of a particular operation). We are actually using that for the time series support inside of RavenDB.\n I’m not going to cover that in depth, here  is the paper on Gorilla compression, the relevant description is at section 4.1.1. Suffice to say that they are using a bit stream and delta of deltas computation. Basically, if you keep getting values that are the same distance apart, you don’t need to record all the value, you can compute that naturally. In the best case scenario, Gorilla compression needs a single bit per value, assuming the results are spaced similarly.\n For my purpose, I want to get as high a compression rate as possible, and I need to store just the list of integers. The problem with Gorilla compression is that if we  aren’t getting numbers that are the same distance apart, we need to record the  amount that they are different. That means that at a minimum, we’ll need a minimum of 9 bits  per value. That adds up quickly, sadly.\n On the other hand, with PFor, there is a different system. PFor computes the maximum number of bits required for a  batch of integer, and then record just those values. I found the Binary Packing section (2.6) in  this paper to be the clearest explanation on how that works exactly.  The problem with PFor, however, is that if you have a single large outlier, you’ll waste a lot of bits unnecessarily.\n I decided to see if I can do something about that and created an encoder that works on batches of 128 integers at a time. This encoder will:\n Check the maximum number of bits required to record the  deltas of the integers. That along already saves us a lot.\n Then we check the top and bottom halves of the batch, to see if we’ll get a benefit from recording them separately. A single large value (or a group of them) that is localized to a part of the batch will be recorded independently in this case.\n Finally, instead of only recording the meaningful bit ranges, we’ll also analyze the batch we get further. The idea is to try to find ranges within the batch that have the same distance from one another. We can encode those as repetitions instead of each independent value. That can end up saving a surprisingly amount of space.\n You can look at the results of  my research here. I’ll caution you that this is raw, but the results are promising. I’m able to beat (in terms of compression rate) the standard PFor implementation by a bit, with a  lot less code.\n I’m also looking at a compression rate of 30% – 40% for realistic data sets. And if the data is setup just right and I’m able to take advantage of the repeated delta optimization, I can pack things  real tight.\n Currently numbers say that I can push upward of 10,000 int64 values in an 8KB buffer without any repeated deltas. It goes to just under 500,000 int64 values in an 8KB buffer if I can take full advantage of the deltas.\n The reason I mention the delta so often, it is very likely that I’ll record values that are roughly the same size, so we’ll get offsets that are the same space from one another. In that case, my encoder goes to town and the compression rate is basically crazy.\n This is a  small piece of a much larger work, but this is the first time in a while that I got to code at Voron’s level. This is  fun.", "posttime": "2021-06-18 21:08:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "整数,integer", "title": "排序整数压缩 ", "title_en": "Sorted Integer Compression", "transed": 1, "url": "https://ayende.com/blog/193955-A/sorted-integer-compression", "via": "", "real_tags": ["整数", "integer"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066697, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\nWarning: Can only detect less than 5000 characters\n[2] A. G.Klein等，＆＃34;历史\r麦克马多站，南极洲，环境\r透视，＆＃34;极地地理31,119（2008）。\n  [3] W. Shafer，＆＃34;五\rMcMurdo站的多年核电，＆＃34;南极J. United.\r2，第2,38号（1967年）。\n  [4] L. H. Suid，军队＆＃39;核电计划：\r支持机构的演变（Praeger，1990）。\n  [5] J. B. Brown，V.W. Storhok和J. E. Gates，\r＆＃34; PM-3A的松土检查检查\r类型1串行2核心。第I部分。燃料管的松土，＆＃34;\rBattelle Memorial Institute，28日2月28日。\n  [6] K. Sieradzki和R. C. Newman，\r＆＃34;压力 - 腐蚀裂解，＆＃34; J. Phy。化学。固体48,1101\r（1987）。\n  [7]＆＃34;上限辐射剂量评估\r1962年间McMurdo站的军事人员，南极洲和\r1979年，＆＃34;美国国防威胁减少机构，\r DTRA-TR-12-003，2013年6月。\n  [8]＆＃34;离子辐射的来源和影响，\r未经2008年报告，＆＃34;联合国科学委员会的影响\r原子辐射，报告和附件\r A，B，\r C，D，\r和e，2010。 ", "note_en": "During the 1960s and early 1970s, McMurdo Staion, the \rlargest research base in the Antarctic, was powered by a medium-sized, \rportable nuclear reactor. [1] The extreme temperatures in Antarctica \rnecessitated large amounts of fuel oil to maintain operations, making \rthe prospect of nuclear power, an attractive alternative. [1] During its \r10 year lifetime, the nuclear power station produced over 78 million \rkilowatt hours of electricity and produced 13 million gallons of fresh \rwater using the excess steam in a desalination plant. [1] Though this \rdevice reduced the necessity for fuel imports, it was plagued with \rproblems which ultimately forced its early retirement in 1972. The cost \rassociated with nuclear power in the Antarctic made it impractical, and \rdiesel-electric generators have since powered the base. [1] The PM-3A \rnuclear reactor that powered McMurdo Station stands as the only nuclear \rpower station to operate on the Antarctic continent.\n    The ice-free southern tip of the Hut Point Peninsula \ron Ross Island in Antarctica has a history of over 100 years of \rexploration and scientific history and is the site of the present day \rMcMurdo Station. [2] This site is located just 729 nautical miles from \rthe South Pole and is where Robert F. Scott staged the first expedition \rto the South Pole in 1902. [2] The United States established a permanent \rbase at this site beginning in December 1955 as part of Operation Deep \rFreeze I. [2] Known as Naval Air Facility McMurdo, this site was to \rserve as a sea port and logistics base from which to build and support a \rresearch facility at the geographic South Pole. [2] The name McMurdo was \rchosen to honour a lieutenant on the British ship HMS Terror that \rdiscovered Ross Island on an Antarctic expedition in 1841. [2] In 1958, \rthe site was renamed to McMurdo Station and has since maintained the \rability to support a population of over 1200 people. [2] McMurdo Station \rserves as the hub for activity in the Antarctic and is currently \roperated by the United States Antarctic Program (USAP), a division of \rthe Nation Science Foundation (NSF). [2]\n      The decision to install a nuclear power station at \rMcMurdo station was based on several factors. [3] First, there were \rdifficulties associated with supplying the large fuel demands required \rfor operations. Aircraft, diesel-electric generators, heating units, and \rvarious types of land vehicles consumed fuel in excess of half of the \rtotal freight delivered to Antarctica in the late 1950s. [3] To further \rcomplicate supply chain logistics, McMurdo can only be accessed by \rsupply ships during the aural summer months (summer in the southern \rhemisphere), thus requiring all supplies for the entire year to be \rdelivered during this short time frame. [3] It was concluded that an \rincreased supply of electricity from nuclear power would give rise to a \rmore efficient use of freight, reduced costs, as well as electric \rheating to replace the fire hazards associated with oil-fired heating \runits. [3] In addition, experience would be gained from installing and \roperating a nuclear power plant in an isolated and harsh environment. \r[3]\n  In August 1960, the United States Congress authorized \rthe design and construction of a nuclear reactor for McMurdo. [3] That \rsame month, the U.S. Atomic Energy Commission contracted the Martin \rMarietta Company of Baltimore, Maryland to design, fabricate, test, \rpackage, transport, install, and initially operate the PM-3A (A for \rAntarctic) nuclear reactor on site in Antarctica. [4] The PM-3A reactor \ris a portable, medium sized nuclear reactor, the third of its type. [4] \rTwo others of this type were built and fielded prior to the PM-3A. [4] \rThe first was the PM-1, also built by Martin, which was used to power a \rremote radar station in Wyoming as part of the North American Aerospace \rDefense Command (NORAD). [4] The PM-2A (A for Arctic) was built by the \rAmerican Locomotive Company to power the remote US military base known \ras Camp Century setup in Northern Greenland. [4] Each of these reactors \rwas in the 1.25-2.0 MW power range, PM-1 and PM-3A were operational by \r1962, with PM-2A being operational in 1960. [4]\n    Fig. 3: Components of the PM-3A arriving at McMurdo. \r (Source:  United States\r Antartcia Program. Courtesy of the\r  NSF)\n  The PM-3A nuclear reactor was above all meant to be \rportable as it was designed with the LC-130 aircraft in mind as its \rdelivery system. [3] Although McMurdo is accessible by ship, it was \roriginally thought that this reactor would power bases inland such as \rthat located at the South Pole which are accessible only by aircraft. \r[3] For reliability and transportability reasons, the PM-3A was designed \rto be a pressurized water reactor. [3] Its core utilized highly enriched \ruranium, 93.1% in relative amount of the isotope U-235, whose fuel \rassembly was roughly the size of an oil drum. [5] Fig. 2 shows the \rinstallation of the PM-3A core onsite. The reactor arrived in modules at \rMcMurdo in December of 1961 by way of the USNS Arneb. [3] Fig. 3 shows \rone of the nuclear reactor modules being unloaded at McMurdo. The PM-3A \rwas assembled on a foundation of solid volcanic rock at an altitude of \r300 feet on the side of Observation Hill, a site that overlooks McMurdo \rStation. [3] Fig. 4 shows the completed reactor site overlooking McMurdo \rStation.\n  The PM-3A was operated by the Naval Nuclear \rPropulsion Unit consisting of a crew of 25. [3] The reactor went \rcritical in March of 1962 and supplied useful electricity to McMurdo in \rJuly of 1962. [3] It took a total of 23 months to complete testing and \rdebugging of the PM-3A nuclear plant. [3] After this time, control of \rthe plant was turned over from the Martin Company to the US Navy. [3] \rOnce fully operational, the role of the plant was twofold, to produce \relectricity for McMurdo in the amount of 1.8 MW as well as to produce \rsteam to operate a desalination plant for the production fresh drinking \rwater in the amount of 14,000 gallons per day. [3]\n    With a total of 438 malfunctions during its \roperational lifetime from 1964 to 1972, the reactor at McMurdo proved to \rbe an unreliable source of power generation, available only 72% of the \rtime. [1] Because of this, in May of 1972, it was determined by an \rindependent assessment from the Bechtel Corporation that the PM-3A was \rnot cost effective and that replacement with modern diesel-electric \rgenerators would require less staff and would also be more reliable. [1] \rIn September 1972, the PM-3A was shut down for routine maintenance and \rinspection. [1] It was determined that conditions existed in the system \rfor chloride stress corrosion cracking, a situation where sudden failure \rcan occur in normally ductile materials under tension in a corrosive \renvironment. [1,6] Inspection of a an accessible section of pipe \rrevealed no incidences of this occurring, however, the Navy refused to \rrule out cracking on surfaces which could not be inspected and thus \rcalled for a full dismantling and inspection of the reactor before it \rcould be deemed safe. [1] The cost associated with this full inspection \rand possible repair of reactor components was a major factor in the \rdecision to decommission the plant. [1]\n    After 10 years of operation, the PM-3A was \rpermanently shut down in 1972, achieving only half of the expected \rdesign life of 20 years. [1] The next step was clean up of the reactor \rsite. The PM-3A and generated radioactive waste could not remain at \rMcMurdo due to the internationally agreed upon Antarctic Treaty which \rprevents both nuclear weapons testing as well as nuclear waste dumping \rin the Antarctic. [7] As such, a large-scale effort was undertaken to \rremove the reactor components, buildings, and contaminated soil for a \rtotal of 365 metric tons of radioactive waste to the continental United \rStates. [7] It was later determined that there were indeed cracks in the \rcontainment vessel which leaked coolant water into the crushed gravel \rthat had been used as the reactor shield which is what resulted in such \ra large area of contamination. [4] As such, more than 9000 cubic meters \rof contaminated soil was relocated to the continental US. [1] In total, \rseven enriched uranium fuel cores were shipped to McMurdo, three of \rwhich had yet to be used as the plant was expected to operate for \rseveral more years. [7] The reactor cores, components, and highly \rradioactive gravel that was used to shield the reactor were shipped to \rthe Department of Energy Savannah River Plant in South Carolina. [1] The \rremaining low-level contaminated soil was shipped to the Naval base at \rPort Hueneme, California. [1] The clean up operation lasted until 1979 \ras work on the site could be performed only during the austral summer. \r[7]\n    As a result of the multiple malfunctions of the PM-3A \ras well as it&#39;s clean up activities, there have been concerns that the \rhealth of personnel involved with the reactor may have been adversely \raffected. [7] Although members of the Navy Nuclear Propulsion Unit were \rcontinuously monitored for radiation, many of the military support crew \rwere not. [7] As such, a study was undertaken by the Department of \rDefense to estimate an upper bound on radiation exposure for these \rindividuals based on the worst cases of the available data from McMurdo. \r[7] Levels of radioactivity in the water were monitored once the PM-3A \rwas used in the production of drinking water. [7] During the first few \ryears of fresh water production (between 1967 and 1969) there were \rseveral instances of abnormally high amounts of tritium in the drinking \rwater. [7] In addition, there was a case of abnormally high amounts of \rlong-lived beta activity in the drinking water in 1969. [7]\n    In addition to problems with the drinking water and \renvironmental contamination, there were several recorded instances of \rcrew radiation exposure, some resulting in injury. [7] During the plant \roperation, 223 reports of abnormal levels of radiation were recorded. \r[7] Of these cases, 14 resulted in injury and 123 resulted in exposure \rin the amount of 0.350 rem over a period of 7 days. [7] This is a \rsubstantial amount of radiation when it is estimated that, one average, \ra typical yearly dose from background sources is 0.240 rem. [8] The \rremaining 86 instances were abnormal radiation levels detected within \rthe plant and its immediate surroundings. [7] The conclusion was that a \rsupport member would have received a maximum dose of 0.2 to 0.6 rem to \rthe thyroid or 0.2 to 0.5 rem to the red bone marrow per austral summer \rtour. [7] The upper bound here is equivalent a typical radiation dosage \rreceived by a person living in the United States from typical background \rradiation and medical procedures. [7] It is, however, recognized that \rthere were personnel who may have been exposed to radiation outside the \rconfines of factors and data considered in those figures that may be \religible for compensation. [7] In addition, the estimated dose above \rdoes not include members who were part of the decommissioning procedures \rwho may have inhaled or ingested contaminated particles. [7]\n    The nuclear reactor installed at McMurdo Station was \rthe first and only to operate on the Antarctic continent. It operated \rfor 10 years and greatly reduced the need for fossil fuels in the \rAntarctic. Although it was initially thought to be a cost saving device, \rits unreliability, large operational crew, and large clean up proved it \rto be an expensive experiment. As a memorial, a plaque now stands at the \rsite of the nuclear power station in McMurdo commemorating the people \rand services of the PM-3A.\n  © Tyler Reid. The author grants permission to \rcopy, distribute and display this work in unaltered form, with \rattribution to the author, for noncommercial purposes only. All other \rrights, including commercial rights, are reserved to the author.\n    [1]\t&#34; McMurdo Station Reactor \rSite Released For Unrestricted Use,&#34; Antarctic J. United States \r 15, No. 1, 1 (1980).\n  [2]\tA. G. Klein  et al., &#34;The Historical \rDevelopment of McMurdo Station, Antarctica, an Environmental \rPerspective,&#34; Polar Geography  31, 119 (2008).\n  [3]\tW. Shafer, &#34; Five\rYears of Nuclear Power at McMurdo Station,&#34; Antarctic J. United \rStates  2, No. 2, 38 (1967).\n  [4]\tL. H. Suid,  The Army&#39;s Nuclear Power Program: \rThe Evolution of a Support Agency (Praeger, 1990).\n  [5] J. B. Brown, V. W. Storhok, and J. E. Gates, \r&#34; Postirradiation Examination of the PM-3A \rType 1 Serial 2 Core. Part I. Postirradiation of Fuel Tubes,&#34; \rBattelle Memorial Institute, 28 Feb 67.\n  [6]\tK. Sieradzki and R. C. Newman, \r&#34;Stress-Corrosion Cracking,&#34; J. Phys. Chem. Solids  48, 1101 \r(1987).\n  [7]\t&#34;Upper-Bound Radiation Dose Assessment for \rMilitary Personnel at McMurdo Station, Antarctica, between 1962 and \r1979,&#34; U.S. Defense Threat Reduction Agency, \r DTRA-TR-12-003, June 2013.\n  [8]\t&#34;Sources and Effects of Ionizing Radiation, \rUNSCEAR 2008 Report,&#34; United Nations Scientific Committee on the Effects \rof Atomic Radiation,  Report and Annexes \r A,  B, \r C,  D, \rand  E, 2010.", "posttime": "2021-06-18 21:07:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "station,power,辐射", "title": "McMurdo Station，南极洲核电站 ", "title_en": "Nuclear Power at McMurdo Station, Antarctica", "transed": 1, "url": "http://large.stanford.edu/courses/2014/ph241/reid2/", "via": "", "real_tags": ["station", "power", "辐射"]}]