[{"category": "", "categoryclass": "", "imagename": "68712c3f82223fe87bb89a18f65dceed.jpg", "infoid": 1010174, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界各地的研究人员正在研究下一代冠状病毒测试，这种测试不需要繁琐的设备或训练有素的人员，只需不到一小时就能得出答案。\n最新的所谓的医疗现场测试可以在医生的办公室甚至在家里进行，这将是对今天现状的一个受欢迎的升级：令人不适的棉签蜿蜒在鼻子上，可能需要几天的时间才能产生结果。\n现在市场上为数不多的医疗设备经常是不准确的。研究人员说，即将到来的测试可能会产生更可靠的结果，有可能导致全国范围内的现场测试。但大多数新的竞争者仍处于早期阶段，几个月内不会出现在诊所。\n一些正在开发中的测试用收集唾液的塑料管代替了令人发痒的棉签。另一些人将患者样本浸入化学鸡尾酒中，当他们检测到冠状病毒基因时，这些鸡尾酒就会亮起来。另一种类型的测试在几分钟内就能识别出冠状病毒蛋白，使用的是一种廉价的设备，这种设备很容易批量生产，并在低资源环境下部署。\n哥伦比亚大学(Columbia University)的泽夫·威廉姆斯(Zev Williams)博士说，“为了对抗这种病毒，我们需要广泛而频繁地进行测试，并迅速拿到结果。”他正在开发一种冠状病毒唾液测试，可以在大约30分钟内完成。“这需要我们在测试方式上进行真正的范式转变。”\n一旦扩大并分布，医院就可以使用更快的测试来快速筛查急诊室患者。学校和工作场所可以购买它们来监测儿童和员工的健康。通过额外的修修补补，一些测试甚至可以开发成像怀孕测试一样简单地工作，在一个人的家里舒适地产生干净的阳性或阴性结果。\n约翰霍普金斯大学健康安全中心的Amesh Adalja博士说，“检测可以做得越快越容易，”它们就越普遍。“这将帮助人们恢复一些表面上的常态。”\n现在市场上的大多数诊断测试都在寻找冠状病毒特有的遗传物质。(这将诊断测试与抗体测试区分开来，抗体测试对血液进行采样，并显示一个人过去是否接触过病毒。)。\n黄金标准的方法是将一根具有吸收性的长棉签插入鼻子几英寸，直到它到达鼻咽部，鼻腔通道与喉咙相交的气道部分，也是冠状病毒的常见目标。\n哈佛大学病毒学家费尔南达·费雷拉(Fernanda Ferreira)在4月份接受了鼻咽拭子检测，她说，“当你看到拭子的时候，你会觉得，‘哦，不，我的脸没有那么深。’”“事实证明是这样的。”", "note_en": "Researchers around the world are working on the next generation of coronavirus tests that give answers in less than an hour, without onerous equipment or highly trained personnel.\n The latest so-called point-of-care tests, which could be done in a doctor’s office or even at home, would be a welcome upgrade from today’s status quo: uncomfortable swabs that snake up the nose and can take several days to produce results.\n The handful of point-of-care devices now on the market are  frequently inaccurate. The up-and-coming tests could yield more reliable results, researchers say, potentially leading to on-the-spot testing nationwide. But most of the new contenders are still in early stages, and won’t be available in clinics for months.\n Some of the tests in development swap brain-tickling swabs for plastic tubes that collect spit. Others dunk patient samples into chemical cocktails that light up when they detect coronavirus genes. Another type of test identifies coronavirus proteins in minutes, using a cheap device that’s easy to produce in bulk and deploy in low-resource settings.\n “To combat this virus, we need to test widely and frequently, and get the results back quickly,” said Dr. Zev Williams at Columbia University, who is developing a  coronavirus spit test that can run in about 30 minutes. “That requires a genuine paradigm shift in the way we go about testing for it.”\n Once scaled up and distributed, faster tests could be used in hospitals to quickly screen emergency room patients. Schools and workplaces could buy them to monitor the health of children and employees. With additional tinkering, some tests could even be developed to work as simply as a pregnancy test, yielding a clean-cut positive or negative result in the comfort of a person’s home.\n “The quicker and easier tests can be done,” the more ubiquitous they can be, said Dr. Amesh Adalja at the Johns Hopkins University Center for Health Security. “That’s going to help people get back to some semblance of normalcy.”\n Most diagnostic tests on the market now hunt for bits of genetic material specific to the coronavirus. (This distinguishes diagnostic tests from antibody tests, which sample the blood and show if a person has been exposed to the virus in the past.)\n The gold-standard method involves funneling a long, absorbent swab a few inches into the nose until it hits the nasopharynx, the part of the airway where the nasal passage meets the throat and a common target of the coronavirus.\n “The moment you see the swab, you’re like, ‘Oh no, my face isn’t that deep,’” said Fernanda Ferreira, a virologist at Harvard University who took a nasopharyngeal swab test in April. “Turns out it is.”", "posttime": "2020-07-07 03:23:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,coronavirus,冠状病毒,新一代,fast", "title": "新一代冠状病毒快速检测即将到来", "title_en": "A New Generation of Fast Coronavirus Tests Is Coming", "transed": 1, "url": "https://www.nytimes.com/2020/07/06/health/fast-coronavirus-tests.html", "via": "", "real_tags": ["病毒", "冠状病毒", "新一代", "fast"]}, {"category": "", "categoryclass": "", "imagename": "36359019c5810c7650d73f161b02c36a.jpg", "infoid": 1010172, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年，监测凌日系外行星调查卫星TESS的科学家发现，一颗巨行星在大约735光年外的TOI-849恒星的近轨道上运行。“自然”杂志最近发表了一篇来自系外行星和宜居性中心的科学家的论文，详细描述了这颗行星。\nTOI-849b的质量大约是地球的40倍，这通常意味着它是一个气体巨星，重量在土星和海王星之间。然而，它的半径比海王星小，尽管它的质量是海王星的两倍多。由于在气态世界中很难看出这是如何发生的，科学家们认为，这颗行星可能曾经是一个气态巨人，现在几乎被剥离成了它的固体核心。另一种选择是，它可能是以一种非常不寻常的方式形成的，这使得它从一开始就避免了积累太多的气体。\nTOI-849b&849b的主恒星是一颗晚期的G级黄矮星，比我们的太阳稍冷一些，大约比我们的太阳年长20亿年，其质量和半径大约是太阳的十分之九。TOI-849b离它的宿主非常近-它的轨道周期略高于18小时。这意味着与其恒星的最远距离只有0.02天文单位(地球和太阳之间的典型距离)。作为参考，我们自己的水星绕太阳公转的距离是太阳的近20倍，几乎是0.4AU。\nTOI-849b的半径、质量和周期将它牢牢地放在一个被称为海王星热沙漠的区域内--在这个轨道区域，物理原理似乎很少形成大型行星。大质量和近轨道周期的行星之所以罕见，可能是由于恒星驱动的两个过程的结合：光蒸发和潮汐破坏。光蒸发是气体和粒子在强烈辐射下的电离，造成它们的弥散；潮汐作用力是质量的近端和远端的引力之差，它会引起拉伸效应。\n导致TOI-849b；自身气体封套大体上丢失的因素可能包括任何能增加足够能量将其大气消散回太空的东西。这意味着行星碰撞、潮汐破坏和光蒸发的任意组合。或者，它可能是在气体很少的时候形成的，可能是由于恒星寿命相对较晚的一次行星形成，或者是由于原行星圆盘上基本上没有气体的缝隙造成的。\n虽然我们还不知道TOI-849b；的不同寻常的形成和历史的细节，但它的发现为天体物理学家提供了迷人的行星形成机制的线索，并为可能的气体巨核的组成提供了新的见解。", "note_en": "In 2018, scientists monitoring TESS—the Transiting Exoplanet Survey Satellite—discovered a giant planet in close orbit around the star TOI-849, roughly 735 light years away. Nature recently published a paper from scientists at the Centre for Exoplanets and Habitability that describes this planet in detail.\n TOI-849b is roughly 40 times the mass of Earth, which would normally indicate a gas giant, weighing in somewhere between Saturn and Neptune. Yet its radius is smaller than Neptune&#39;s, although it has more than double Neptune&#39;s mass. Since it&#39;s hard to see how that can happen in a gaseous world, the scientists suggest that the planet may once have been a gas giant, stripped now nearly to its solid core. The alternative is that it might have formed in a highly unusual way that allowed it to avoid accumulating much gas in the first place.\n TOI-849b&#39;s host star is a late G-class yellow dwarf, a little cooler and approximately 2 billion years older than our Sun, with about nine-tenths its mass and radius. TOI-849b is very close to its host—its orbital period is a little over 18 hours. That means the farthest distance from its star is only 0.02  Astronomical Units (the typical distance between Earth and our Sun). For reference, our own Mercury orbits the Sun nearly 20 times more distantly, at almost 0.4 AU.\n  The radius, mass, and period of TOI-849b place it firmly in a zone that&#39;s called the &#34;hot-Neptune desert&#34;—an orbital region where the physics are such that large planets appear to very rarely form. The rarity of planets with large mass and close orbital period is likely due to a combination of two processes driven by the star: photoevaporation and tidal disruption. Photoevaporation is the ionization of gases and particles from intense radiation, causing their dispersion; tidal force is the difference between gravitational force at the near and far sides of a mass, which causes a stretching effect.\n  Factors leading to TOI-849b&#39;s own largely missing gas envelope could include anything that added enough energy to dissipate its atmosphere back into space. That means any combination of planetary collision, tidal disruption, and photoevaporation. Alternatively, it could have just formed at a time when there was very little gas present, perhaps due to a planetary formation relatively late in its star&#39;s life or from a gap in the  protoplanetary disk largely devoid of gases.\n Although we don&#39;t yet know the details of TOI-849b&#39;s unusual formation and history, its discovery offers astrophysicists fascinating clues to the mechanics of planetary formation and new insights to the likely composition of gas giant cores.", "posttime": "2020-07-07 03:05:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "海王星,hot,行星", "title": "在炎热的海王星沙漠中的系外行星是此类行星中的第一颗。", "title_en": "Exoplanet in the hot-Neptune desert is the first of its kind", "transed": 1, "url": "https://arstechnica.com/science/2020/07/recently-discovered-exoplanet-may-be-a-heated-up-gas-giant-core/", "via": "", "real_tags": ["海王星", "hot", "行星"]}, {"category": "", "categoryclass": "", "imagename": "83e45ecc9fd669d0ed6cd67e0f541811.png", "infoid": 1010171, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们下一次关注Xbox Series X的新游戏将在7月23日。微软公司今天宣布，届时将举行下一届Xbox游戏展示会，从太平洋时间上午9点开始在多个数字平台上进行流媒体播放。\n与微软5月份的促销活动不同，微软5月份的促销活动聚焦于即将推出的游戏机的第三方发布标题，而7月23日的活动预计将讨论微软自己的Xbox游戏工作室的第一方独家产品。这可能包括“光晕无限”的新镜头，它在几周前看到了一个新的预告片。\n微软上个月在一篇博客文章中表示，Xbox Series X现在掌握在我们15个Xbox游戏工作室团队手中，以及我们全球游戏开发和出版工作室网络中最知名的公司手中，确保Xbox Series X将为新一代重磅游戏提供动力，比如光环无限。\n第一方工作室的阵容现在包括微软6月份收购的mental onauts 2开发者Double Fine，以及微软去年11月收购的外部世界开发商黑曜石娱乐公司(Obsidian Entertainment)。\n早在2月份，微软就确认，所有Xbox游戏工作室的游戏都将使用Smart Delivery，[确保]你只需购买一次游戏，就可以在[你]选择玩的任何一款Xbox游戏机上玩最好的可用版本。在1月份的一次采访中，Xbox游戏工作室负责人马特·布蒂(Matt Booty)指出，这意味着Xbox Series X在上市的头一两年里不会有任何真正的下一代独家产品。", "note_en": "Our next look at new games for the Xbox Series X will be coming on July 23. That&#39;s when Microsoft will be holding its next Xbox Games Showcase,  the company announced today, streaming on multiple digital platforms starting at 9am Pacific Time.\n Unlike  Microsoft&#39;s May promotional event, which focused on third-party launch titles for the upcoming console, the July 23 event is expected to discuss first-party exclusives from Microsoft&#39;s own Xbox Game Studios. That likely includes new footage of  Halo Infinite, which  saw a new teaser trailer a few weeks ago.\n &#34;Xbox Series X is now in the hands of our 15 Xbox Game Studios teams and the biggest names from our network of game development and publishing studios worldwide, ensuring Xbox Series X will power a new generation of blockbuster games, like  Halo Infinite,&#34; Microsoft  said in a blog post last month.\n That lineup of first-party studios now includes  Psychonauts 2 developer Double Fine, which  Microsoft acquired June, and  The Outer Worlds developer Obsidian Entertainment, which  Microsoft acquired last November.\n Back in February, Microsoft confirmed that  all Xbox Game Studios titles will use Smart Delivery to &#34;[ensure] you only have to purchase a title once in order to play the best available version for whichever Xbox console [you] choose to play on.&#34; In  a January interview, head of Xbox Game Studios Matt Booty noted that this means Xbox Series X won&#39;t feature any true &#34;next-generation&#34; exclusives for its first year or two of availability.", "posttime": "2020-07-07 03:05:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,游戏,microsoft,xbox", "title": "微软下一代Xbox Series X游戏展示会将于7月23日举行", "title_en": "Microsoft’s next Xbox Series X game showcase coming July 23", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/microsofts-next-xbox-series-x-game-showcase-coming-july-23/", "via": "", "real_tags": ["微软", "游戏", "microsoft", "xbox"]}, {"category": "", "categoryclass": "", "imagename": "72a3d26caca466b96b149abc6121135f.jpeg", "infoid": 1010170, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哈佛大学今年秋季学期欢迎新生和其他一些学生进入校园，但在冠状病毒流行的情况下，所有课程都在网上授课。\n学费不会从49,653美元下调，尽管远程注册的学生不会支付食宿费。\n哈佛大学说，如果条件允许该学院保持40%的居住密度，它希望邀请高年级学生来校园度过春季学期。\n哈佛大学周一宣布，今年秋季学期，哈佛大学将欢迎新生和其他一些学生进入校园，但学生们将不得不每三天进行一次冠状病毒检测，课程将在网上授课，而且不会享受学费折扣。\n如果高年级学生在家里没有足够的技术，或者有困难的家庭环境，他们可以申请返校。本科生住在校园的总比例将被限制在40%左右。\n哈佛表示：假设我们在春季学期保持40%的密度，我们会再带回一个班级，目前我们的首要任务是把高年级学生吸引到校园来。根据这项计划，一年级学生将在春季回国远程学习。该公司预计将在12月初发布关于春季的决定。\n随着美国冠状病毒病例继续激增，哈佛大学是最新一所宣布秋季学期计划的学校。\n哈佛大学此前宣布，所有教学都将在网上进行。今天，它还表示，学费不会从49653美元打折，尽管远程注册的学生不会支付住宿费。本学期将于9月9日如期开始。2，所有住在校园里的学生都将在感恩节前离开。\n预计该计划下的许多学生在下一学年的任何时候都不会住在校园里，哈佛将允许所有注册的全年远程学习的本科生在2021年在哈佛暑期学校参加两门课程，免收学费。\n与其他已经宣布秋季计划的大学相比，哈佛大学的计划更具限制性。上周，耶鲁大学宣布将允许60%的本科生重返校园。宾夕法尼亚大学(University Of Pennsylvania)和康奈尔大学(Cornell University)等其他常春藤盟校计划重新开放大部分宿舍，并举办一些面对面的课程。\n普林斯顿大学周一还宣布，将在秋季招收大一和大三学生，在春季招收大二和大四学生，新冠肺炎将在入学时进行测试，此后将定期进行测试。大多数课程都将是远程上课。同样位于新泽西州的罗格斯大学(Rutgers University)周一宣布，秋季学期将提供大部分远程课程和极其有限的校园住宿。", "note_en": "Harvard University is welcoming freshmen and some other students to campus this fall semester but teaching all classes online amid the coronavirus pandemic.\n Tuition will not be lowered from $49,653, although students enrolled remotely will not pay room and board fees.\n Harvard said it hopes to invite seniors to campus for the spring semester assuming conditions allow the college to maintain 40% residential density.\n Harvard University  is welcoming freshmen and some other students to campus this fall semester, but students will have to take coronavirus tests every three days, classes will be taught online and it won&#39;t discount tuition, the school announced Monday.\n Upperclassmen will be able to petition to return if they don&#39;t have sufficient technology at home or have challenging family circumstances. The total percentage of undergraduates living on campus would be limited to around 40%.\n  &#34;Assuming that we maintain 40% density in the spring semester, we would again bring back one class, and our priority at this time is to bring seniors to campus,&#34; Harvard said. &#34;Under this plan, first years would return home and learn remotely in the spring.&#34; It expects to release a decision about the spring in early December.\n Harvard is the latest school to announce its fall semester plans as coronavirus cases continue to spike in the U.S.\n Harvard previously announced that all teaching would occur online. Today it also said tuition will not be discounted from $49,653, although students enrolled remotely won&#39;t pay housing fees. The semester will begin as scheduled on Sept. 2, and all students living on campus will be expected to leave by Thanksgiving.\n  Anticipating that many students under this plan will not live on campus for any part of the upcoming academic year, Harvard will allow all enrolled undergraduates studying remotely for the entire year to take two courses on campus at the Harvard Summer School in 2021 with tuition waived.\n  Harvard&#39;s plan is more restrictive than those of other universities that have been announcing their fall plans. Last week Yale University announced it would allow 60% of undergraduates to return to campus. Other Ivy League schools such as the University of Pennsylvania and Cornell University plan to reopen most of their residential halls and hold some in-person classes.\n Princeton University also  announced Monday it would bring freshmen and juniors to campus in the fall and sophomores and seniors in the spring, with Covid-19 testing upon arrival and &#34;regularly thereafter.&#34; Most classes would be remote. Rutgers University, also in New Jersey, announced Monday that its fall semester would feature a majority of remote classes and &#34; extremely limited&#34; on-campus housing.", "posttime": "2020-07-07 03:05:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,大学,coronavirus,冠状病毒,进入", "title": "哈佛大学将在今年秋天允许一些学生进入校园，只要他们每3天做一次冠状病毒检测", "title_en": "Harvard Will Allow Some Students on Campus This Fall So Long as They Take Coronavirus Tests Every 3 Days", "transed": 1, "url": "https://www.cnbc.com/2020/07/06/harvard-will-allow-some-students-on-campus-this-fall-so-long-as-they-take-coronavirus-tests-every-three-days.html", "via": "", "real_tags": ["病毒", "大学", "冠状病毒", "进入"]}, {"category": "", "categoryclass": "", "imagename": "b51a38ca384549856d4f1ca611472118.gif", "infoid": 1010169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇帖子延续了关于算法思维解决一个众所周知的问题的讨论，这个问题被称为买卖股票的最佳时间。\n这个问题的解决很难，我不认为它是一个很好的面试问题，但它仍然是一个很好的练习，可能需要一个中级开发人员几个小时才能解决。\n为了获得最大值，在阅读解决方案之前，您应该分配足够的时间来尝试以有效的方式解决它。\n我们得到了一个代表股票价格的整数列表；我们必须找出假设至多两个没有重叠的买入-卖出交易的情况下可以获得的最大利润。\n乍一看，问题看起来很简单；我们很快就会看到事实并非如此！\n思考这个问题，我们可以看到存在三种“类型”的解决方案：\n将此方法转换为按2点和4点创建所有配对并返回最大利润的函数非常简单：\n为了简化性能测试，让我们创建一个函数来返回一个随机价格序列，并针对不同大小的输入运行get_max_Profit函数：\n请注意，20个点的序列需要几毫秒，但当我们增加到200点时，我们很快就会达到13秒以上。\n之所以会出现这种情况，是因为我们的解决方案非常慢；请注意，我们计算的是从价格中取2点和4点的所有可能的对，这意味着所需的利润计算次数由以下公式给出：\n很明显，我们需要一个更聪明的解决方案，使我们能够以更有效的方式解决这个问题。\n随着我们更深入地思考问题，我们意识到，对于价格曲线中的每个数据点，我们都有一个从左到右的最大利润交易，这意味着如果我们迭代所有的点并存储所有的总和(只计算正值)，它们的最大值将是所需的值。\n在这种情况下，我们的解决方案的复杂性将与数组的大小乘以在曲线左右两侧查找较大事务的成本成正比。\n要尝试这种方法，我们需要创建一个函数，该函数将接收一段价格并为其返回最大可能的利润。不过，重要的是，我们希望避免像以前那样创建所有可能的配对，并将查找最大利润交易的过程减少为每个分区的一次传递。经过一番思考，我们最终得到了以下解决方案：\n请注意，计算最大利润现在是0.16，与我们以前得到的13.29相比，看起来有了很大的改进，但我们还有更多的工作要做。\n虽然比以前快得多，但随着曲线大小的增长，该函数会迅速减慢。\n在我们继续前进并尝试改进我们的解决方案之前，了解我们当前基于两个基本概念的解决方案将会很有帮助：\n我们可以通过迭代所有点并比较它们的左右总和来计算最大利润。\n计算分部最大利润的算法很有趣，所以让我们仔细研究一下。\n计算子序列的最大利润交易是我们解决方案的核心，我们需要很好地消化它，以便理解问题的解决方案。\n根据价格顺序[8，12，1，9，6，11]，很容易得出结论，可以获得的最大利润是10(在第三个点买入，在第十个点卖出)：\n为了找出这一利润，我们需要迭代整个曲线，并在每个点“记住”我们到目前为止看到的最低和最高价格。更重要的是，我们需要确保最低价格出现在最高价格之前；这就是该算法有点棘手的地方。\n当我们继续前进(向右)时，如果我们发现一个新的最低价格，我们将存储的较低值重新初始化为新的值，并将最大值设置为零，否则，如果我们已经达到一个新的较大值，我们将用它替换到目前为止的较大值。\n此时，如果我们将当前利润与之前的利润进行比较，则可以很容易地计算任何迭代点的较大利润，这正是此代码正在执行的操作：\n因为我们迭代传递给函数的所有价格，所以其复杂度为O(M)(m是传入数组的长度)。\n如前所述，要计算零个、一个或两个交易的最大可能利润，我们需要迭代整个价格序列(长度为n)，并为每个点调用左侧和右侧的Brutal_find_max_Delta函数。请注意，对于每个点，复杂度将是：O(M)+O(n-m)或O(N)。\n因此，虽然这种方法与以前的解决方案相比有了改进，但仍然很慢，需要进一步改进。\n在我们的解决方案中，我们注意到真正“昂贵”的是左右最大值的计算；这使我们思考是否可以通过重用一些已经计算的数据来简化他们的计算。我们的方法是创建一个新的列表，其长度与传入的价目表相同，其中每个点都将具有左侧的最大利润。\n这样做似乎很容易更改brtal_find_max_delta值以跟踪每个点的最大值：\n只需简单修改left_side_max_deltas，我们就可以编写一个类似的函数来计算点右侧的最大值：\n其中，每个数据点表示可在其右侧找到的最大区域，如下图所示：\n既然我们已经准备好从左到右的最大利润曲线创建函数，我们就可以编写一个函数来解决这个问题：\n我们的解决方案的时间复杂度是O(N)，并且由于我们将预先计算的最大值保存在内存中，所以我们的内存复杂度也是O(N)。\n请注意，新解决方案的速度有多快；现在计算100,000个数据点的价格曲线只需不到十分之一秒，这意味着我们已经达成了一个有效且可接受的解决方案。\n为了解决我们的问题，我们最初创建了一个非常简单的解决方案，但非常慢，稍微深入一点思考，我们可以将其性能提高到更快，然后我们发现了一个技巧，使我们能够为我们的问题提出一个有效的算法；同样的过程也适用于大多数需要特殊算法的问题。", "note_en": "This posting continues the discussion about algorithmic thinking solving a well know problem that is known as    Best Time to Buy and Sell Stock.\n The solution to this problem is hard and I do not believe that it makes a good interview question but it is still a good exercise that might take an intermediate developer a few hours to solve.\n To gain the maximum value you should allocate enough time to try to solve it in an efficient way before you read the solution.\n  We are given a list of integers representing stock prices; we must find the maximum profit that can be made assuming at most two no overlapping BUY – SELL transactions.\n        From the first glance, the problem looks simple; as we will see shortly it is not!\n Thinking about the problem we can see that there exist three “types” of solutions:\n  It is trivial to convert this approach to a function that creates all the pairs by 2 and 4 points and return the maximum profit:\n  To make performance testing easier lets create a function to return a random price sequence and run the get_max_profit function for different sizes of input:\n    Note that a sequence of 20 points requires a few milliseconds but as we ramp up to 200 we are quickly reaching more than 13 seconds.\n This happens because our solution is extremely slow; note that we are calculating all the possible pairs for 2 and 4 points taken from prices meaning that the number of the required profit calculations are given by the following formula:\n    It is clear that we need to a smarter solution that will allow us to solve it in a more efficient way.\n  As we think the problem deeper, we realize that for each data point in the prices curve we have a left – right maximum profit transaction meaning that if we iterate though all the points and store all the totals (counting only positive values) their maximum  will be the desired value.\n In this case the complexity of our solution will be proportional to the size of the array multiplied by the cost of finding the larger transaction in the left – right sides of the curve.\n To try this approach we need to create a function that will receive a subsection of prices and return the maximum possible profit for it what is important though is that we want to avoid the creation of all possible pairs as we have done before and reduce the finding of the largest profit transaction to a single pass per subsection. After a little thinking we end up with the following solution:\n    Note that calculating the maximum profit now takes 0.16 which compared to the 13.29 that we have gotten before looks like a great improvement but we still have more work to do.\n     Although much faster than before, the function slows down quickly as the size of the curve grows.\n Before we move forward and try to improve our solution it will be helpful to understand our current solution which is based on two basic concepts:\n We can calculate the maximum profit by iterating through all the points and compare their left – right totals\n  The algorithm to calculate the maximum profit for a subsection is interesting so lets take a closer look onto it..\n  Calculating the transaction with the maximum profit for a sub-sequence is at the heart of our solution and we need to digest it well in order to understand the solution to our problem.\n Given the sequence of prices [8, 12, 1, 9, 6, 11] it is easy to conclude that the maximum profit that can be made is 10 (buy on the third point and sell in the tenth) :\n  To find out this profit we will need to iterate through the whole curve and at each point “remember” the lowest and highest prices we have seen so far. More than this we need to be sure that the lowest price occurs before the highest; this is what makes this algorithm a bit tricky.\n As we move forward (to the right) if we discover a new lowest price we reinitialize our stored lower value to the new one and also set the maximum value to zero otherwise if we have reached a new larger value we are replacing the larger value so far with it.\n At this point it is simple to calculate the larger profit for any iteration point if we compare the current profit with the previous, this is exactly what this code is doing:\n  Since we are iterating through all the prices passed to the function its complexity is O(m) (m is the length of the passed in array).\n As said before to calculate the maximum possible profit for zero, one or two transactions we need to iterate through the whole sequence of prices (whose length is n) and for each point call the brutal_find_max_delta function for the left and right side. Note the for each point the complexity will be: O(m) + O(n-m) or O(n).\n   So, although this approach is an improvement when compare to the previous solution, it is still very slow and needs to be improved further.\n   In our solution about we note that what is really “expensive” is the calculation of the left – right maximums; this makes us to think if we can simplify their calculations by re-using some of the already calculated data. Our approach will be to create a new list having the same length as the passed in list of prices where each point will have the left-wise maximum profit.\n Doing so appears to be quite easy changing the brutal_find_max_delta to keep track of the maximums per point:\n        With a simple modification of the left_side_max_deltas we can write a similar function to calculate the maximums from the right side of a point:\n      where each data point represents the maximum area that can be found on the right of it as can be seen in this graph:\n   Now that we have the left – right maximum profit curve creation functions ready we can write a function to allow us to solve the problem:\n  The time complexity of our solution is O(n) and since we are keeping the pre-calculated maximums in memory our memory complexity is also O(n).\n    Notice how dramatically faster the new solution is;a price curve of 100,000 data points now takes less than a tenth of a second to be calculated meaning that we have reached an effective and acceptable solution.\n  To solve our problem we initially created a very simple solution which was very slow, thinking a little deeper we were able to improve its performance to be faster and then we discovered a trick that allowed us to come up with an efficient algorithm for our problem; the same process is applicable to most of the problems that require a special algorithm.", "posttime": "2020-07-07 03:04:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股票,买卖,selling,问题", "title": "买卖利润最大的股票", "title_en": "Buying and Selling stocks with maximum profit", "transed": 1, "url": "http://codingismycraft.com/index.php/2020/07/05/buying-and-selling-stocks-with-maximum-profit/", "via": "", "real_tags": ["股票", "买卖", "selling", "问题"]}, {"category": "", "categoryclass": "", "imagename": "7d2a9c1be12d4523250aad0b9f4cf429.jpg", "infoid": 1010168, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个故事的一个版本最早出现在贝尔通讯之前的CNN商业版上。不是订户？你可以在这里报名。\n这些只是6月中旬被美联储(Federal Reserve)抢购债务的部分公司，这是美联储史无前例地干预信贷市场的一部分。CNN的母公司美国电话电报公司(AT&Amp；T)是另一家。\n发生了什么：美联储周日披露了数亿美元的个人公司债券购买计划，同时确定了近800家符合条件的发行人，可以最终购买其债券。\n美联储(Federal Reserve)的行动受到投资者的称赞，因为它在3月份信贷市场迅速恶化后，放松了信贷市场的状况，避免了可能引发一波破产潮的潜在灾难性的企业现金紧缩。\n高盛(Goldman Sachs)在周一给客户的报告中表示，美联储宣布将在一级和二级市场购买公司债券，足以迅速缓解压力。\n首席经济学家简·哈祖斯(Jan Hatzius)表示，仅仅是后盾的存在就帮助恢复了私人信贷的流动。\n高盛(Goldman Sachs)表示，事实证明，这项政策在抗击这场危机方面非常有效。但根据这家投行的说法，目前还不清楚美联储是否应该将其作为对抗未来经济衰退的常规工具。\n这场危机预计将是严重但短暂的，降低了支撑本应被允许倒闭的低效僵尸公司的风险。下一次可能不会是这样。\n此外，人们担心，持续的公司债券购买承诺可能会造成所谓的道德风险，鼓励公司从选择性较低的贷款机构借入更多资金，因为他们预期美联储的干预将限制风险。\n高盛(Goldman Sachs)表示，在下一次衰退中，成本效益权衡不太可能同样有利。\n美联储的行动也没有让信贷市场完全不受复杂和快速变化的前景的影响。如果大流行迫使另一波可能破坏复苏的伤痕累累的停摆，贷款条件可能会再次收紧。\nFXTM首席市场策略师侯赛因·赛义德(Hussein Sayed)周一告诉客户，重新实施经济停摆的风险很高，如果货币政策刺激不能转化为经济活动的反弹和企业盈利前景的改善，那么未来货币政策刺激将变得不那么有效。货币政策刺激解释了资产价格从3月低点开始的大部分复苏。\n联合利华(Unilever)、星巴克(Starbucks)和威瑞森(Verizon)等大公司签署了一项广告抵制协议，以抗议Facebook关于仇恨言论的政策-这增加了公司的赌注，并打击了其股票。\n最新消息：Facebook股价周五暴跌超过8%，创下3月份以来最糟糕的一天。他们在盘前交易中下跌了近4%。\n首席执行官马克·扎克伯格(Mark Zuckerberg)周五宣布了一项扩大仇恨言论的政策，其中包括禁止以少数族裔、移民和寻求庇护者为替罪羊的广告。Facebook还将在有新闻价值但违反该平台政策的用户帖子上贴上警告标签。\n但这些举措似乎并没有让许多广告商满意。好时表示，在宣布这一消息后，它将加入抵制行动。福克斯商业报道，百事公司也将其名字添加到名单中。\n现实核查：Facebook去年大约700亿美元的收入几乎全部来自广告收入。但根据营销情报公司Pathmatics的数据，支出最高的100个品牌只占收入的6%。\n其中大部分来自中小型企业。我的CNN商业同事布莱恩·冯(Brian Fung)报道，数万人需要在相当长的一段时间内采取行动，才能对Facebook的底线造成重大影响。\n看看这个空间：随着公司暂停社交媒体广告，Twitter的股价也在下跌。该公司的股票周五下跌超过7%，在盘前交易中下跌了3%。\n我的CNN商业同事克莱尔·达菲(Clare Duffy)和马特·伊根(Matt Egan)报道，美国水力压裂技术的先驱切萨皮克能源公司(Chesapeake Energy)上周末申请破产保护-这是冠状病毒大流行期间申请破产保护的最大石油和天然气公司。\n切萨皮克曾经是美国第二大天然气生产商，这要归功于早期对水力压裂的押注。切萨皮克已故创始人兼首席执行官奥布里·麦克伦登(Aubrey McClendon)被认为是将美国转变为全球最大石油和天然气供应国的页岩热潮的领导者之一。\n但随着该公司努力应对低迷的能源价格和堆积如山的债务，破产传言甚嚣尘上。\n冠状病毒危机加剧了这些挑战。尽管最近回升至每桶40美元，但由于供应过剩和在家工作订单导致的需求暴跌，今年油价大幅下跌。\n彭博情报(Bloomberg Intelligence)信贷分析师斯宾塞·卡特(Spencer Cutter)表示：在当前的大宗商品价格环境下，切萨皮克公司在烧钱的同时，产量在下降，这是不可持续的。\n含义：需求开始复苏，帮助原油价格再次上涨。但随着生产商与资不抵债作斗争，它们仍处于太低的水平，无法防范一连串的破产。", "note_en": "A version of this story first appeared in CNN Business&#39; Before the Bell newsletter. Not a subscriber? You can sign up   right here .\n  These are just some of the companies whose debt was  snapped up by the Federal Reserve as of mid-June, part of the central bank&#39;s unprecedented intervention in credit markets. CNN parent company AT&amp;T is another.\n What&#39;s happening: The Fed disclosed hundreds of millions of dollars in purchases of individual corporate bonds on Sunday, while identifying nearly 800 eligible issuers whose bonds it could buy down the line.\n   The action by the Federal Reserve has been lauded by investors for easing conditions in credit markets after they rapidly deteriorated in March, avoiding a potentially catastrophic corporate cash crunch that could have triggered a wave of bankruptcies.\n  In a note to clients Monday, Goldman Sachs said the Fed&#39;s announcement that it would buy corporate bonds in the primary and secondary markets was enough to quickly provide relief.\n  &#34;The mere presence of the backstops helped to restore the flow of private credit,&#34; chief economist Jan Hatzius said.\n The policy has proved &#34;remarkably powerful&#34; to fight this crisis, Goldman Sachs said. But it&#39;s not clear the Fed should use it as a regular tool to fight future recessions, per the investment bank.\n This crisis is expected to be severe but short, lowering the risk of propping up inefficient &#34;zombie&#34; firms that should be allowed to fail. That may not be the case next time around.\n Plus, there are fears that an ongoing commitment to corporate bond purchases could create a so-called &#34;moral hazard,&#34; encouraging companies to borrow more from less-selective lenders on the expectation that Fed intervention would limit risks.\n &#34;It is unlikely that the cost-benefit tradeoff will be quite as favorable in the next recession,&#34; Goldman Sachs said.\n The Fed action has also not made credit markets completely impervious to a complex and fast-changing outlook. Should the pandemic force another wave of bruising shutdowns that could derail the recovery, lending conditions could tighten again.\n &#34;The risks of reimposing lockdowns are high, and monetary policy stimulus which explains most of the recovery in asset prices from the March lows will become less effective going forward if it doesn&#39;t translate into a rebound in economic activity and better prospects for corporate earnings,&#34; Hussein Sayed, chief market strategist at FXTM, told clients Monday.\n  Big corporate names like Unilever, Starbucks and Verizon are signing onto an  advertising boycott in protest of Facebook&#39;s policies on hate speech — raising the stakes for the company and hitting its stock.\n The latest: Facebook shares plunged more than 8% on Friday, logging their worst day since March. They&#39;re down nearly 4% in premarket trading.\n  CEO Mark Zuckerberg announced an expanded policy on hate speech Friday, which includes banning ads that scapegoat minorities, immigrants and asylum seekers. Facebook will also apply warning labels to user posts that are newsworthy but violate the platform&#39;s policies.\n But the moves don&#39;t appear to have satisfied many advertisers. Hershey&#39;s said it would join the boycott following the announcement. Fox Business  reports that PepsiCo is adding its name to the list, too.\n Reality check: Nearly all of Facebook&#39;s roughly $70 billion in revenue last year came from advertising dollars. But the highest-spending 100 brands account for only  6% of income, according to Pathmatics, a marketing intelligence firm.\n The bulk comes from small and medium-sized businesses. Tens of thousands would need to act over a significant period of time to put a big dent in Facebook&#39;s bottom line, my CNN Business colleague Brian Fung reports.\n Watch this space: Twitter shares are also falling as companies pause social media advertising. The company&#39;s stock dropped more than 7% on Friday and is down 3% in premarket trading.\n  Chesapeake Energy, a pioneer of US fracking, filed for  bankruptcy protection over the weekend — the largest oil and gas company to do so during the coronavirus pandemic, my CNN Business colleagues Clare Duffy and Matt Egan report.\n Chesapeake was once the nation&#39;s number two natural gas producer thanks to early bets on fracking. Aubrey McClendon, Chesapeake&#39;s late founder and CEO, was considered one of the leaders of the shale boom that transformed the United States into the world&#39;s largest oil and natural gas supplier.\n But bankruptcy rumors swirled as the company grappled with depressed energy prices and a mountain of debt.\n The coronavirus crisis exacerbated those challenges. Despite a recent recovery to $40 per barrel, the price of oil has fallen sharply this year because of excess supply and plunging demand caused by stay-at-home orders.\n &#34;In the current commodity price environment, Chesapeake is burning cash at the same time production is declining, which is not sustainable,&#34; said Spencer Cutter, credit analyst at Bloomberg Intelligence.\n What it means: Demand is starting to recover, helping crude prices rise again. But they&#39;re still too low to guard against a string of bankruptcies as producers fight insolvency.", "posttime": "2020-07-07 03:03:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现在,owns", "title": "美联储现在拥有沃尔玛的债务", "title_en": "The Fed now owns Walmart's debt", "transed": 1, "url": "https://www.cnn.com/2020/06/29/investing/premarket-stocks-trading/index.html", "via": "", "real_tags": ["现在", "owns"]}, {"category": "", "categoryclass": "", "imagename": "37054ef52b338e49b81cd477f8876d6e.jpg", "infoid": 1010167, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2013年，一名前往突尼斯的美国收藏家进入苏斯墓穴(Sousse Caracombs)--这是一座古老的墓地，里面存放着世界上一些最古老的基督教墓葬--在墓穴翻修期间偷走了一个头骨，上面有一块非常黑的古代铜版画(据他所说)。这位收藏家将这个头骨以550美元的价格挂在Facebook的一个私人群里出售，并在销售清单上讲述了他被抢劫的故事。\n该小组的其他成员对被洗劫的头骨感到兴奋，一些人发帖评论说，它是多么美丽。收藏家可能没有意识到的是，这群人并不像看起来那么私密。一名直播科学记者假扮成对头骨感兴趣的人，渗透到了私人Facebook群和其他几个类似的群中，并在10个月的时间里跟踪正在出售的人体遗骸。\nLive Science的调查揭示了一个人类遗骸经常在出售时几乎没有关于其起源的信息的世界-这引发了人们对它们是如何获得的问题。虽然苏斯地下墓穴的头骨与众不同，因为收藏家公开承认他洗劫了它，但Live Science记录了无数其他没有背景故事的人类遗骸，留下了一个悬而未决的问题：这些遗骸中有多少是被洗劫或被盗的？\n任何个人都没有必要或正当理由拥有任何人类遗骸。\n世界上大多数国家(包括突尼斯)都禁止抢劫考古遗址和墓地。在美国，没有任何州的法律允许或承认出售人类遗骸是合法的。相反，北卡罗来纳州维克森林法学院(Wake Forest School Of Law)的墓地和丧葬法专家坦尼娅·马什(Tanya Marsh)说，在许多州，这显然是非法的。马什在接受Live Science采访时表示，在私人团体中，一些卖家声称他们的骨头是从医学院得到的；但即使这些说法是真的，人体遗骸也不例外，即使有文件证明它们来自医学院或博物馆的藏品。\n瑞安·塞德曼(Ryan Seidemann)和克里斯汀·哈林(Christine Hling)在给Live Science的一封联合撰写的电子邮件中表示，人们怀疑是否有人，甚至是那些为科学捐赠遗骸的人，曾经想过或期望成为个人的私人古董。两人都在路易斯安那州土地和自然资源部门民事部门的总检察长办公室工作，塞德曼领导该部门，哈林是一名考古学家。\n更清晰的是来自坟墓或埋葬的人类遗骸。这些人打算让他们的遗体留在他们的墓地里。塞德曼和霍林说，出于私人拥有或占有遗体的目的而违反这一意图既是合法的，也是道德的违反。在我们看来，法律和伦理方面的影响是显而易见的：任何个人都没有必要或正当理由拥有任何人类遗骸，无论它们是成人的遗骸还是儿童的遗骸。\n在线打击犯罪联盟的联合创始人格雷琴·彼得斯(Gretchen Peters)表示，人体遗骸交易从根本上是对死者的不尊重，并在世界各地鼓励盗墓。该联盟是一个打击犯罪和腐败的组织。\n每一个从坟墓中被盗的头骨或文物都会成为一段缺失的历史，成为考古学家和其他人了解我们之前的文明的窗口。例如，苏斯墓穴绵延约3.1英里(5公里)，容纳了大约15,000人的遗骸，其中包括许多早期基督徒，他们会将墓穴作为集会地点，以避免罗马人的迫害。当时，大约2000年前，突尼斯由罗马帝国统治。通过研究这些遗骸，考古学家一直在了解随着越来越多的人皈依基督教，突尼斯的生活发生了怎样的变化。例如，学者们正在保护墓穴中的马赛克，并正在寻找人们接受基督教后艺术风格如何变化的线索。\n苏斯地下墓穴头骨的卖家位于华盛顿州，并在Facebook的私人群中出售了许多其他人类遗骸。Live Science通过Facebook联系了收藏家，并假扮成对头骨感兴趣的人。收藏家没有回答这些问题，销售帖子后来被删除了。\n突尼斯文化部和突尼斯的一些考古学家也没有回应有关苏斯头骨的置评请求。\n苏斯头骨只是在网上私人出售无证人类遗骸的冰山一角。胎儿、婴儿和儿童的遗骸在这些私人Facebook群中特别受欢迎。一位买家在帖子中写道，他们正在寻找儿童的骨骼或器官。他们会找到许多待售的。买家和卖家通常不会讨论他们为什么对儿童和胎儿遗骸感兴趣。\n在价格较高的一端，卖家声称18世纪去世时6岁的木乃伊儿童被张贴在网上出售，售价为11,000欧元(12,247美元)。销售公告中没有提供出处信息，但卖家用大写字母写道，这不是一起盗墓案。\n一个价格较低的例子是一个卖家所说的可能是年轻少女头骨的头骨，售价为1300美元。销售公告中没有列出来源信息，尽管卖方声称这些信息是合法获得的，并有适当的进口文件。目前尚不清楚是否有任何遗骸来自犯罪行为，尽管这项调查没有找到明确的证据表明现代犯罪受害者正在进入人类遗骸贸易。“生活科学”联系的专家们对这个问题从怀疑到可能都有不同的看法。\n另一位卖家在帖子中写道，另一位卖家以1000美元的价格贴出了一个少年的头骨；这个少年的智齿还没有突出出来。卖家声称头骨来自费城的一所医学院。目前还不清楚卖家是如何得到它的。\n胎儿遗骸成群结队出售，有时保存在液体罐子里。例如，一个软组织看起来保存完好的小胎儿被张贴在网上出售，售价为2350美元。它被列为退休医学标本，没有提供其他信息。\n几乎足月的胎儿售价为6495美元。卖家在帖子中声称，它来自一个古老的教学收藏品。卖家还声称，胎儿的母亲希望通过保存这个标本来活下去，并激发人们对人体的好奇心和进一步的教育。\n这合法吗？这可能会因地区而异。马什说，美国没有平权法律允许出售或拥有人类胎儿。马什说，州立法机构有一种趋势，即通过将胎儿遗骸视为人类遗骸的法规-这些新法规的影响之一是，无论胎龄如何，胎儿遗骸都将被要求埋葬、埋葬或火化，而明确禁止出售人类遗骸的法规也将适用于胎儿遗骸，&34；马什说，这些新法规的影响之一是，无论胎龄如何，胎儿遗骸都将被要求埋葬、埋葬或火化，而明确禁止出售人类遗骸的法规也将适用于胎儿遗骸。\n现有法律的执行情况如何则是另一个问题。红拱文化遗产法律与政策研究公司(Red Arch Culture Heritage Law&Amp；Policy Research)律师里克·圣希莱尔(Rick St.Hilaire)表示，根据他的经验，州历史保护官员、部落官员和海关官员往往对人体遗骸交易最了解。圣希莱尔说，这一领域不会引起执法部门的主流关注，并指出这个问题没有人口贩运和毒品执法部门那么多的关注。\n塞德曼和霍林说，一些执法机构可能知道这种交易，但不知道有哪些法律选择可以阻止人类遗骸的商品化。\n调查文化遗骸贩运的Athar项目的联席主任凯蒂·保罗(Katie Paul)说，Facebook实际上有一项政策，禁止在他们的网站上出售人类遗骸，但在执行方面做得很差。\n由于互联网和社交媒体上的商业监管如此之差，它简直就像是没有治安官的狂野西部。\n卖家有时会张贴部分由人类遗骸制成的物品，如包含人骨的刀和手杖。有一根手杖出售，售价300美元，手柄是由人的股骨制成的，卖家声称这根股骨来自一具可以追溯到19世纪的骨架。卖家说：不要错过这件独一无二的东西。同一卖家还以260美元的价格出售了一把由股骨制成的刀柄。\n其中一件特别不同寻常的物品是理查德·萨顿(Richard Sutton)博士1917年版的“皮肤病”(Disease Of The Skin)，卖家用人皮反弹。卖家声称，用于制作皮革的人体遗骸来自一份退休的医学标本。卖家补充说，这种材料是我亲自购买的，让它变成皮革，并亲自装订。卖家的要价是6500美元，并成功售出。\n这些例子只代表了在这些私人团体中进行的销售的一小部分。还有更多令人感兴趣的人类遗骸，例如一具秘鲁拉长头骨，售价10500美元。帖子中没有提供来源信息。这是一笔特别令人担忧的交易，因为秘鲁一直受到抢劫的蹂躏，全球遗产基金(Global Heritage Fund)估计有10万座坟墓被洗劫。\n在秘鲁和世界其他地方发现的细长头部的人的头骨来自于捆绑头部的做法。研究人员在2018年的“当代人类学”(Current Anthropolology)杂志上报道，绑头巾在公元1300年左右在秘鲁变得流行起来，可能被用来表示一个人属于什么社会群体。\n许多网站已经禁止或限制出售人类遗骸。例如，eBay已经禁止了这一销售，虽然Instagram上有人体遗骸出售，但Live Science发现，近几个月来，Instagram上一些出售遗骸的账户已经被关闭。\n从私人群组发布的图片中，Live Science调查发现，许多成员似乎在购买人体遗骸，以便在家中展示。人们的遗骸经常陈列在橱柜和桌子上。偶尔会有一具骷髅被陈列在椅子上。在少数情况下，头骨上有雕刻，包括一个上面有异教徒山羊般的神巴霍梅特的图像。有时收藏家会对头骨进行改装，这样它们就可以用来盛放鲜花了。\n安大略省卡尔顿大学(Carleton University)的肖恩·格雷厄姆(Shawn Graham)和卡尔顿大学(Carleton University)的达米恩·赫弗(Damien Huffer)在一封联合撰写的电子邮件中说，收藏家购买人类遗骸的动机似乎多种多样。两人都是研究人类遗骸交易的考古学家。一些收藏家似乎是被对死亡的迷恋所驱使，而另一些收藏家则对试图复制博物馆展出的人类遗骸感兴趣。研究人员说，那些从事人体遗骸交易的人似乎也有一种亲切感。\nLive Science采访的一些专家表示，Facebook需要执行其现有政策，禁止在他们的平台上出售人体遗骸。格雷厄姆和赫弗表示，执法机构需要更好地执行现有法律，禁止出售人体遗骸。\n此外，根据彼得斯的说法，政府应该通过法规，让社交媒体公司承担从其平台上删除非法交易的责任。彼得斯说，由于互联网和社交媒体上的商业监管不力，这简直就像是没有治安官的荒野西部。\nLive Science还联系了Facebook，提醒该公司注意人骨交易。作为回应，一位发言人表示，一旦他们意识到一个组织违反了他们的政策，他们就会对他们采取行动。截至7月3日，Live Science发现，其中三个私人群组已被关闭，尽管其他群组仍在运营。\n天哪，这肯定真的影响到计划生育事业了。当百事可乐不得不把它当做人体遗骸对待时，它会怎么处理它以胎儿为基础的HEK293调味料呢？\n回覆", "note_en": "In 2013, an American collector visiting Tunisia entered the Sousse catacombs — an ancient necropolis that holds some of the oldest Christian burials in the world — and stole a skull with a &#34;very dark ancient patina&#34; (as he described it) during renovations of the catacombs. The collector put the skull up for sale in a private Facebook group for $550, telling his tale of looting in the sales listing.\n  Other members of the group were excited by the looted skull, with some posting comments about how &#34;beautiful&#34; it was. What the collector may not have realized was that the group wasn&#39;t as private as it seemed. A Live Science reporter posing as a person interested in skulls had infiltrated the private Facebook group, and several other groups like it, and for 10 months kept track of human remains that were being sold.\n  The Live Science investigation unlocked a world in which human remains are often sold with little information about their origins — raising questions about how they were acquired. While the Sousse catacomb skull was exceptional in that the collector openly admitted he looted it, Live Science documented countless other human remains with no back stories, leaving open the question: How many of these remains were looted or stolen?\n    &#34;There is no need or justification for any private individual to own any human remains.&#34;\n Most countries around the world (including Tunisia) have banned the looting of archaeological sites and graveyards. In the United States, &#34;there is no law in any state which grants permission or acknowledges that it is legal to sell human remains. On the contrary, it is expressly illegal in a number of states,&#34; said Tanya Marsh, an expert in cemetery and funeral law at Wake Forest School of Law in North Carolina. In the private groups, some sellers claimed that they got their bones from medical colleges; but even if those claims were true, &#34;there are no exceptions for human remains even if there is documentation that they are from the collection of a medical school or museum,&#34; Marsh told Live Science.\n &#34;It is doubtful that any person, even those donating their remains for science, ever wanted to be or expected to be a personal curio for an individual,&#34; said Ryan Seidemann and Christine Halling in a jointly written email to Live Science. Both work in the Office of Louisiana&#39;s Attorney General in the Lands &amp; Natural Resources Section Civil Division, with Seidemann leading the division and Halling as an archaeologist.\n  &#34;Even more clear are the human remains that derive from tombs or burials. Those people intended for their remains to stay in their burial space. Violation of this intent for the purposes of seeking to privately own or possess the remains is both a legal and an ethical violation,&#34; Seidemann and Halling said. &#34;The legal and ethical implications are clear in our opinion: There is no need or justification for any private individual to own any human remains, whether they are the remains of adults or children.&#34;\n Gretchen Peters, co-founder of the &#34;Alliance to Counter Crime Online,&#34; an organization fighting crime and corruption, said that the trade in human remains is &#34;fundamentally disrespectful to the dead&#34; and is encouraging grave robbing around the world.\n    Each skull or artifact stolen from graves becomes a missing piece of history, a window no longer available for archaeologists and others into civilizations before ours. For instance, the Sousse catacombs, which extend about 3.1 miles (5 kilometers) — contain the remains of about 15,000 people including many early Christians who would have used the catacombs as a meeting place to avoid Roman persecution. At the time, some 2,000 years ago, Tunisia was ruled by the Roman Empire. By studying those remains, archaeologists have been learning about how life changed in Tunisia as more people converted to Christianity. For instance, scholars are in the process of conserving the mosaics in the catacombs and are searching for clues about how art styles changed as people adopted Christianity.\n  The seller of the Sousse catacomb skull is based in Washington state and sold numerous other human remains in the private Facebook groups. Live Science contacted the collector through Facebook and posed as a person interested in the skull. The collector didn&#39;t reply to the questions and the sale posting was later deleted.\n Tunisia&#39;s Ministry of Culture and a few archaeologists in Tunisia also didn&#39;t respond to requests for comment about the Sousse skull.\n    The Sousse skull is just the tip of an iceberg of private online sales of undocumented human remains. The remains of fetuses, infants and children are particularly popular in these private Facebook groups. One buyer wrote in a post that they were &#34;looking for children&#39;s skeletal pieces or organs.&#34; They would have found many for sale. Buyers and sellers did not usually discuss why they were interested in child and fetus remains.\n On the higher-price end a mummified child, who the seller claimed was 6 years old when he or she died in the 1700s, was posted for sale for 11,000 euros ($12,247). No provenance information was given in the sale posting, but the seller wrote in large caps that it is &#34;NOT A GRAVE ROBBERY.&#34;\n  A lower-priced example is a skull of what a seller said was probably a &#34;young teen female&#34; offered for $1,300. No provenance information was listed in the sales posting, although the seller claimed that it was legally acquired and had proper import documentation. Whether or not any of the remains came from a criminal act is not known, though this investigation didn&#39;t turn up clear evidence that modern-day crime victims are making their way into the human remains trade. Experts contacted by Live Science had a range of opinions on this question from doubtful to possible.\n   Another seller posted the skull of a &#34;young teenager&#34; for $1,000; the teenager&#39;s &#34;wisdom teeth not protruding yet,&#34; the seller wrote in the posting. The seller claimed the skull came from a &#34;medical school in Philadelphia.&#34; It&#39;s not clear how the seller got it.\n Fetal remains were sold in the groups, sometimes preserved in jars of liquid. For example, a tiny fetus whose soft tissue appeared well preserved was posted for sale for $2,350. It was listed as a &#34;retired medical specimen,&#34; with no other information given.\n An &#34;almost full-term&#34; fetus was selling for $6,495. The seller claimed in the posting that it was from an &#34;old teaching collection.&#34; The seller also claimed that the mother of the fetus &#34;wanted this specimen to live on via preservation and to stimulate curiosity and further education about the   human body.&#34;\n Is this legal? That may vary by region. &#34;There is no affirmative law in the United States that permits the sale or possession of human fetuses,&#34; Marsh said. &#34;There is a trend of state legislatures adopting statutes that treat fetal remains as human remains — one of the impacts of those new statutes is that fetal remains, regardless of gestational age, would be required to be buried, entombed or cremated and statutes which expressly forbid the sale of human remains would also apply to fetal remains,&#34; Marsh said.\n  How well existing laws are enforced is another question. Rick St. Hilaire, a lawyer with Red Arch Cultural Heritage Law &amp; Policy Research, said that in his experience state historic preservation officers, tribal officers and customs officials tend to be most aware of the human remains trade. &#34;This area is not one that would attract mainstream attention among law enforcement,&#34; said St. Hilaire, noting that the issue does not get as much attention as human trafficking and drug enforcement does.\n Some &#34;law enforcement agencies may be aware of the trade, but unaware of the legal options that exist to stop the commodification of human remains,&#34; Seidemann and Halling said.\n Facebook actually has a policy that   bans the sale of human remains on their site, but does a poor job of enforcing it, said Katie Paul, co-director of the ATHAR project, which investigates the trafficking of cultural remains.\n &#34;Because commerce on the internet and on social media is so poorly regulated, it&#39;s literally like the Wild West with no sheriffs.&#34;\n  Sellers sometimes posted items made partly of human remains, such as knives and walking sticks that incorporated human bone. One walking cane, on sale for $300, had a handle made of a human femur, and the seller claimed that the femur came from a skeleton dating back to the 19th century. &#34;Don&#39;t miss out on this one of a kind piece,&#34; the seller said. The same seller also offered a knife with a handle made out of bone femur for $260.\n One particularly unusual item was a 1917 edition of the book &#34;Diseases of the Skin&#34; by Dr. Richard Sutton that the seller rebound with &#34;human leather.&#34; The seller claimed that the human remains used to create the leather came from a &#34;retired medical specimen.&#34; The seller added, &#34;I personally acquired the material, had it turned into leather, and performed the binding myself.&#34; The asking price was $6,500 and was successfully sold.\n  These examples represent only a small fraction of the sales that went on in these private groups. There were many more human remains of interest, such as a Peruvian elongated skull selling for $10,500. No provenance information was given in the posting. This is a particularly fraught sale, as Peru has been ravaged by looting, with the Global Heritage Fund estimating that 100,000 tombs have been plundered.\n  The   skulls of people with elongated heads, found in Peru and other parts of the world, come from the practice of head-binding. Head binding in Peru became popular around A.D. 1300 and may have been used to signify what social groups a person belonged to, researchers reported in 2018 in the journal Current Anthropology.\n Many sites have banned or restricted the sale of human remains. For instance, eBay has banned the sale, and while human remains are sold on Instagram, Live Science found that some accounts on Instagram that sell them have been shut down in recent months.\n   From images posted in the private groups, the Live Science investigation found that many members appear to be purchasing human remains for display in their homes. Human remains were often shown in cabinets and on desks. Occasionally a skeleton would be displayed sitting in a chair. In a few instances, skulls had engravings carved into them, including one with an image of the pagan goat-like deity Baphomet on it. Sometimes collectors modified skulls so that they could be used to hold flowers.\n  Collectors appear to have a variety of motivations for buying human remains, said Shawn Graham, of Carleton University in Ontario, and Damien Huffer, of Carleton University, both archaeologists who study the trade in human remains, in a jointly written email. Some collectors seem to be driven by a fascination with death, while other collectors have an interest in trying to replicate displays of human remains shown in museums. There also seems to be a sense of kinship among those in the human remains trade, the researchers said.\n  A number of experts that Live Science talked to said that Facebook needs to enforce its   existing policy banning the sale of human remains on their platform. Graham and Huffer said that law enforcement agencies need to get better at enforcing existing laws against the sale of human remains.\n In addition, according to Peters, governments should pass regulations that put the onus on social media companies to remove illegal transactions from their platforms. &#34;Because commerce on the internet and on social media is so poorly regulated, it&#39;s literally like the Wild West with no sheriffs,&#34; Peters said.\n Live Science also contacted Facebook to alert the company of the human bone trade. In response, a spokesperson said that once they become aware that a group has violated their policies they take action against them. As of July 3, Live Science found that three of the private groups had been shut down, although others remain in operation.\n     Man, that must really cut in to Planned Parenthood&#39;s business. What will Pepsi ever do with it&#39;s fetal-based HEK 293 flavouring when it has to be treated as human remains?\n   Reply", "posttime": "2020-07-07 03:03:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,skulls,遗骸", "title": "被掠夺的头骨和人体遗骸正在Facebook上的黑市上出售", "title_en": "Looted skulls and human remains are being sold in black markets on Facebook", "transed": 1, "url": "https://www.livescience.com/human-bone-trade-facebook.html", "via": "", "real_tags": ["facebook", "skulls", "遗骸"]}, {"category": "", "categoryclass": "", "imagename": "57443f67e09f7bfc0b64f7409df7ef62.jpg", "infoid": 1010166, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在以前，也就是大流行之前，官方许可的一级方程式比赛的年度分期付款会在锦标赛中途到达。但我们已经不在很久以前了，在2020年，F1在奥地利的红牛圈开始了一个简短的、社交距离较远的赛季。因此，当F12020本周发布时-明天是豪华舒马赫版，周五是标准版-它将把球员带到另一个宇宙，在那里没有新冠肺炎，F1比赛将于3月份在澳大利亚照常开始。\nCodemaster的车队可能并不打算在2020年的F1比赛中采用多元角度，但如果今年教会了我们什么的话，那就是充分利用我们发过的牌。这种数字发布的好处是，它意味着你可以在越南河内和荷兰赞德沃特的新赛道上一轮对一轮地比赛，比他们将在肉类空间举办第一场F1赛事早了近一年。但是，增加几条新的赛道并不是科迪避免事情变得陈旧的唯一方式-对于一项每年都不会发生巨大变化的运动的官方特许经营来说，这不是一件微不足道的壮举。\n也许F1 2020最大的新增玩法是一种新的职业模式。这个叫我的车队，因为它不是加入现有的10支车队中的一支，而是让你扮演一个新的车队所有者(以及F1赛车手)的角色。你可以选择车队名称，设计制服和标志，找到冠军赞助商，并为车队选择第二名车手。然后，在比赛间隙，你将管理团队，这(希望)会带来比你花费更多的钱，同时让每个部门都感到高兴。\n就像在过去的几个F1分期付款一样，也有类似RPG的元素，涉及到比赛中对媒体的采访。你如何回答他们的问题会影响团队中不同部门的士气，也会影响你在这项运动中的地位。\n这些新增功能并不能让这款游戏像赛车经理那样更像一个战略模拟游戏，但它们确实为游戏增加了一个额外的维度，超越了开车兜圈子，最好比其他人开得更快。如果你不想走我的车队路线，那么F1 2019年的其他职业生涯模式路线仍然存在，而且是正确的-请参考那篇评论以了解更多信息。--如果你不想走我的车队路线，那么从F1 2019开始的其他职业模式路线仍然存在，而且是正确的-请参考那篇评论了解更多信息。要了解更多关于游戏在每个比赛周末的工作方式，请查看我们对2018年F1的评论，因为它在这里基本上没有变化。\n与最近的F1比赛相比，另一个新功能是分屏(本地)多人游戏的回归，它加入了在线多人和esports模式，供那些不想只是与AI比赛的人使用。\n驾驶一辆F1赛车达到极限显然并不容易--这被认为是赛车运动的巅峰是有原因的。但是像F1 2020这样的比赛需要吸引比世界上最好的车手更广泛的观众。为此，Codemaster增加了休闲模式，它简化了菜单，使驾驶偏离赛道变得更容易，并为不想太集中注意力的球员增加了一些额外的助攻。(但是，此模式仅用于脱机播放。)。\n但对于那些想要更逼真的模拟体验的人，你可以根据自己的喜好配置各种助手，一直到专业模式，让你自己做所有的工作。对于那些质疑这款游戏在真实驾驶F1赛车时的模拟效果如何的人，请注意乔治·罗素(George Russell)对F1 2020的赞誉。罗素是梅赛德斯-AMG年轻车手项目的成员，目前作为威廉姆斯F1的两名赛车手之一，已经进入了他在威廉姆斯F1的第二年。拉塞尔在Twitch上表示，他对赛车在比赛中处理方式的改进感到震惊，据报道，其他现任F1车手帮助Codemaster提高了F12020的真实性。\n我在现实生活中没有开过F1赛车，但我确实每年都会驾驶几款不同的赛车游戏，我很高兴地告诉大家，就玩起来的乐趣而言，FI2020是其中最好的。这是一个令人难以置信的参与轮子和踏板，你可以定制游戏，以匹配您正在寻找的难度水平。它看起来不错，听起来就像你所希望的涡轮增压混合动力F1赛车的声音一样好。如果你是这项运动的爱好者，它可能值得一试。\n很好地模拟了驾驶一辆现代F1赛车需要多少多项任务。\n职业模式很吸引人，提供了几种不同的方式来比赛整个赛季。\n由于大流行，真正的F1今年根本不会去河内或赞德沃特。", "note_en": "In the before times, pre-pandemic, the annual installment of the officially licensed Formula 1 game would arrive about midway through the championship. But we&#39;re not in the long-long ago anymore,  and in our 2020, F1 started an abbreviated, socially distanced season at the Red Bull Ring in Austria. So when  F1 2020 launches this week—tomorrow for the Deluxe Schumacher Edition, Friday for the standard edition—it takes players to an alternate universe where there was no COVID-19 and where F1 racing started as usual in Australia, in March.\n The team at Codemasters probably didn&#39;t intend for a multiverse angle for  F1 2020, but if this year has taught us anything, it&#39;s to make the best of the cards we&#39;re dealt. The upside to this digital release is it means you can race wheel-to-wheel at new tracks in Hanoi in Vietnam and Zandvoort in the Netherlands almost a year before they&#39;ll host their first F1 events in meatspace. But the addition of a couple of new circuits isn&#39;t the only way that Codies have kept things from getting stale—no mean feat for an official franchise for a sport that doesn&#39;t really change a huge amount year-to-year.\n  Probably the biggest new addition to  F1 2020&#39;s gameplay is a new career mode. This one is called My Team, because instead of joining one of the existing 10 teams, it puts you in the role of a new team owner (as well as F1 racing driver). You get to pick the team name, design a livery and logo, find a title sponsor, and choose a second driver for the team. Then, in between races, you&#39;ll manage the team, which (hopefully) involves bringing in more money than you spend, all the while keeping each department happy.\n As in the  past couple of  F1 installments, there are also RPG-like elements involving in-game interviews with the media. How you answer their questions affects the morale of different departments in the team as well as you&#39;re standing in the sport.\n These additions don&#39;t quite make the game as much of a strategy sim as something like  Motorsport Manager, but they do add an extra dimension to the game beyond &#34;drive car around and around, preferably faster than everyone else.&#34; If you don&#39;t feel like going the My Team route, the other career-mode pathways from  F1 2019 are still present and correct— refer to that review for more information. For more on how the gameplay works during each race weekend,  please check out our review of  F1 2018, since it is largely unchanged here.\n Another new feature compared to recent  F1 games is the return of split-screen (local) multiplayer, which joins the online multiplayer and esports modes for those of you who don&#39;t want to just race against the AI.\n  Driving an F1 car at the limit is obviously not easy—there&#39;s a reason its considered the pinnacle of motorsport. But a game like  F1 2020 needs to appeal to a much wider audience than the very best drivers in the world. To that end, Codemasters have added a &#34;casual mode&#34;, which simplifies menus, makes driving off-track easier, and adds some extra assists for players who don&#39;t want to concentrate too hard. (This mode is only for offline play, however.)\n But for those who do want a more realistic sim experience, you can configure the various assists to your liking, all the way to &#34;pro mode,&#34; which makes you do all the work yourself. For those who question how well the game simulates actually driving a real F1 car, take note of the praise issued for  F1 2020 by George Russell, who is a member of Mercedes-AMG&#39;s young driver program and currently in his second year with Williams F1 as one of its two racing drivers.  Russell said on Twitch that he was shocked by the improvement to the way the cars handle in the game, and other current F1 drivers  have reportedly helped Codemasters improve the realism of  F1 2020.\n I&#39;ve not driven an F1 car in real life, but I do get to drive a fair few different racing games each year, and I&#39;m happy to report that  F1 2020 is up there with the best of them in terms of being fun to play. It&#39;s incredible engaging with a wheel and pedals, and you can customize the game to match the difficulty level you&#39;re looking for. It looks good and sounds as good as you can hope a turbocharged hybrid F1 car to sound. If you&#39;re a fan of the sport, it&#39;s probably worth picking it up.\n  Does a good job simulating just how much multitasking goes into driving a modern F1 car.\n Career Mode is engaging and offers several different ways to race through an entire season.\n  Actual F1 won&#39;t visit Hanoi or Zandvoort at all this year because of the pandemic.", "posttime": "2020-07-07 02:44:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,赛车,codemasters,f1", "title": "F1 2020回顾-Codemaster再次赢得赛车比赛", "title_en": "F1 2020 reviewed—Codemasters takes another racing game win", "transed": 1, "url": "https://arstechnica.com/gaming/2020/07/f1-2020-race-in-an-alternate-universe-where-there-is-no-covid-19/", "via": "", "real_tags": ["2020", "赛车", "f1"]}, {"category": "", "categoryclass": "", "imagename": "764ef417a2143eb9a859a3abb4475764.jpg", "infoid": 1010163, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些预告片展示了特斯拉在汽车行业普及的一项运动，即在新车型中融入大触摸屏。\n人们对梅赛德斯的下一代MBUX信息娱乐系统知之甚少，该系统将在2021年的S级车型中首次亮相。根据梅赛德斯的预告片和最新视频以及泄露的照片，似乎一个巨大的肖像式触摸屏将成为新MBUX系统的核心。梅赛德斯没有透露屏幕的大小，也没有透露屏幕将包含哪些功能。然而，看起来气候控制功能都在中央触摸屏上。\n关于该系统和S级的更多信息将在几天后发布。梅赛德斯-奔驰(Mercedes-Benz)将于上午5：30发布下一代MBUX系统。美国东部时间7月8日，作为一系列数字披露的一部分，将提供2021年S级的信息片段。其他视频定于7月29日和8月12日。S级的全球首映式预计将在9月份举行。\n第一代梅赛德斯-奔驰(Mercedes-Benz)用户体验或MBUX系统于2018年1月在CES科技贸易展上亮相，并在这家汽车制造商的A级掀背车中首次亮相。这对梅赛德斯来说是一个背离，该公司历史上一直将其最好的技术留给其最高级别的车型-S级通常是第一款通常获得最新和最伟大技术的汽车。梅赛德斯似乎正在回归这一战略，新版MBUX将进军2021年的S级。\n如果与戴姆勒董事会成员马库斯·舍费尔(Markus Schäfer)的视频有任何迹象的话，下一代MBUX可能会继续强调语音。根据视频，2021年款梅赛德斯S级也将配备平视显示器。", "note_en": "The teasers illustrate a movement in the automotive industry popularized by Tesla to incorporate large touchscreens in new models.\n Little is known about Mercedes’ next-generation MBUX infotainment system, which will debut in the 2021 S-Class. It appears, based on Mercedes’ teaser image and  latest video as well as  leaked photos that a large portrait-style touchscreen will be the centerpiece of the new MBUX system. Mercedes didn’t reveal the size of the screen or what functions will be incorporated into it. However, it appears that the climate control functions are head to the central touchscreen.\n   More information about the system and the S-Class is coming in just a couple of days. Mercedes-Benz will unveil the next-gen MBUX system at 5:30 a.m. EST July 8 as part of a series of digital reveals that will give snippets of information on the 2021 S-Class. The other videos are set for July 29 and August 12. The world premiere of the S-Class is expected to be held in September.\n The first-generation Mercedes-Benz User Experience or MBUX system was  unveiled in January 2018 at the CES tech trade show and debuted in the automaker’s A Class hatchback. That was a departure for Mercedes, which has historically reserved its best tech for its highest-class models — the S Class being the first vehicle to typically get the latest and greatest tech. Mercedes appears to be returning to that strategy with the new version of MBUX heading to the 2021 S-Class.\n  The next-gen MBUX will likely continue its emphasis on voice, if the video with Daimler board member Markus Schäfer is any indication. The 2021 Mercedes S-Class will also have a head-up display, according to the video.", "posttime": "2020-07-07 02:24:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "轿车,jumps,mbux", "title": "\n梅赛德斯-奔驰2021年S级轿车跳上巨型触摸屏大潮", "title_en": "\n\t\t\t\tMercedes-Benz 2021 S-Class jumps on the giant touchscreen bandwagon\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/06/mercedes-benz-2021-s-class-jumps-on-the-giant-touchscreen-bandwagon/", "via": "", "real_tags": ["轿车", "jumps", "mbux"]}, {"category": "", "categoryclass": "", "imagename": "df5c9a47dbdbcf50c83165fad9c61742.png", "infoid": 1010161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2018年末，我们决定增加对Reaction Native in Heap的一流支持。这意味着将Heap的自动捕获理念引入React Native平台：在Reaction Native应用程序上安装Heap应该意味着捕获与该应用程序的所有用户交互。这包括点击、更改文本字段等。\n这篇文章将介绍我们是如何做到这一点的：添加定制代码作为应用程序构建过程的一部分。我们将讨论抽象语法树、如何构建Babel插件以将代码注入到Reaction Native，以及我们在此过程中使用的一些工具。\n在Web上，Heap通过向整个DOM添加onClick事件侦听器来捕获站点点击(Siteclicks)等上的所有用户行为。在iOS上，Heap通过方法切换安装了几个关键UIKit API的自定义实现。但是Reaction Native没有提供任何类型的全局钩子，我们可以使用它来自动捕获用户交互。\n使自动捕获工作的一种简单方法是创建我们自己的Reaction Native repo分支，并发布一个包含自定义代码更改的包。然而，这将是一个很大的维护负担，因为每次Facebook发布新的Reaction Native版本时(不仅仅是当该特定的Reaction Native代码更改时)，我们都需要发布新的Reaction Native Heap SDK版本。更广泛地说，这将是一个糟糕的开发人员体验。\n集思广益之后，我们想出了一个更好的主意：在构建时将代码注入到Reaction Native。Reaction Native Metro捆绑程序捆绑了几乎所有Reaction Native应用程序的Javascript代码，因为它是框架的默认Javascript捆绑程序。对于像JSX这样的语法特性，Metro捆绑器使用Babel，这是一个源代码到源代码编译器，可以将像JSX和实验性语言特性这样的东西转换成普通的Javascript。\nBabel在内部对抽象语法树进行操作以执行其编译。抽象语法树(AST)是源代码的语法结构以树的形式表示。很多处理代码的工具都使用AST：编译器、解释器、链接器和格式器。例如，代码格式化程序更漂亮，它通过将代码解析成AST，然后以预定义的样式重新打印AST来自动格式化源代码。\n在研究和探索AST时，我们发现ASTExplorer.net特别有用。它允许您粘贴源代码并选择用于源代码(语言、解析器、转换)的配置，它将为该代码生成AST，并且对于转换，显示结果代码。\n我们将在这篇文章中经常使用ASTExplorer，因为我们展示了如何为Heap构建解决方案。\n就其本身而言，Babel不会做任何事情；但它实际上是相同的代码-&&gt；相同的代码。要让它做任何事情，我们需要插件，这些插件将Babel配置为以特定方式对AST执行操作。Babel公开了许多允许用户遍历和修改AST节点的API。\n您可以使用现有的插件，也可以编写自己的插件。例如，现有的求幂运算符插件采用如下代码：\n巴别塔变换使用访问者模式。当Babel访问特定类型的节点时，Babel调用为该节点类型提供的相应函数。Babel将路径对象(到被访问节点的路径表示)传递给该函数，以允许访问被访问节点。\n对于求幂运算符示例，我们可以通过实现BinaryExpression节点的函数，将看起来像x**y的二进制表达式转换成看起来像Math.pow(x，y)的代码：\n现在我们已经具备了使用Babel修改源代码的AST所需的基本工具，让我们注入一些插装代码。\n我们可以捕获的最基本的交互是触摸可触摸的组件。这些是用户可以通过触摸它们与之交互的组件。示例包括TouchableOpacity、TouchableNativeFeedback和TouchableHighlight。在这篇文章中，我们将重点关注TouchableOpacitys。\n如果您手动标记一个可触摸组件，您可能会向该可触摸组件的onPress处理程序添加一些类似analytics.trace(‘Toured Button’)的代码。例如：\n我们不想将插装注入到应用程序代码中(就像我们在上面添加了跟踪代码的onPress应用程序处理程序)，因为代码结构在不同的应用程序之间可能会有很大差异，而且我们无法看到代码的实际外观。\n相反，我们希望在Reaction Native库中找到一个在触摸TouchableOpacity时始终会触发的位置。一个很好的位置可能是在TouchableOpacity组件中调用onPress的地方：\n既然我们知道了要将检测代码注入到哪里，那么让我们编写一些代码来实现这一点。\n因此，我们希望将一些代码注入到这个特定的方法中，但是我们如何以编程方式将该方法标识为正确的位置呢？当然，它调用onPress，但我们不能只检测调用另一个名为onPress的函数的所有函数。让我们更多地看看周围的代码：\n使用上下文，我们可以找出几个地标，告诉我们这就是我们想要进行测试的地方：\n该方法是TouchableHandlePress，它作为渲染的Animated.View的onclick道具传入。\n为简单起见，让我们删除一些不相关的代码行，如其他方法、注释和导入：\n让我们找出AST中与每个要点相对应的部分来进行推理：\n有一个键名为Mixins的ObjectProperty，在该子树中有一个标识符Touchable\n有一个ID名为TouchableOpacity的VariableDeclarator。但是，由于我们希望最终将我们的解决方案应用于其他Touchable，因此我们将忽略这一点。\n虽然这些都是相关的，但检测的目标节点是touch chableHandlePress函数。让我们重新表述这些AST功能以与此节点相关：\n该节点有一个父节点，该父节点是CallExpression，其被调用方名称为createReactClass。\n正如您可能认为的那样，这种方法有点启发式。Reaction Native库中的代码可以并且确实会更改，我们有时确实需要更新我们的插件来处理这些代码更改。类似地，如果非反应原生代码与我们的插件正在寻找的AST模式匹配，我们可能也会检测该代码，尽管这是不太可能的。\n现在我们知道了要在AST中查找什么模式，让我们编写一些代码来查找我们的目标节点。\n让我们从向基本的Babel转换访问器添加一个方法开始。在我们的示例中，我们正在寻找一个ObjectProperty节点，因此让我们从一个为所有ObjectPropertys执行的函数开始：\n接下来，我们知道我们正在查找的节点有一个键名为TouchableHandlePress，所以让我们添加一个条件来检查这一点：\n接下来，我们希望查看该节点是否有一个父节点，该父节点是被调用方名称为createReactClass的CallExpression。我们可以使用巴别塔路径上的findParent方法来完成此操作：\n最后，我们要检查该节点是否有与Touble Mixin同级的节点。让我们在帮助器中实现此逻辑。\n我们可以访问路径容器字段中的节点同级数组。我们可以通过检查节点是否属于ObjectProperty类型，以及是否具有键名Mixins和值类型ArrayExpression来在此数组中搜索Mixins节点。\n找到Mixins节点后，我们需要检查它是否包含可触摸的标识符。我们可以通过使用另一个Babel访问器调用Traverse来遍历节点子树来实现这一点，并提取一些状态：\n我们现在知道当前节点是我们需要注入代码的位置。所以让我们注入我们的仪器。\n我们将使用babel-types软件包为我们的检测创建新的AST节点：\n让我们从包装原始函数并调用它开始。如果我们正常编写代码，则可以通过调用函数的call_property来调用函数对象：\n让我们对此函数执行此操作。我们将首先构建一个成员表达式(即访问call属性)，然后使用下面的参数和event参数调用该表达式：\n接下来，让我们构建要注入的代码。我们可以通过创建多个AST节点来创建此CallExpression，但为了简单和可读性起见，我们使用Babel模板来完成此操作：\n现在让我们把它们放在一起。我们也将对此使用模板：\n最后，让我们从刚刚创建的函数体构建一个新函数：\n现在，我们有了一个新函数，它包装了原始函数，并包含了一些插装代码，但它实际上还不是AST的一部分-它只是我们创建的一个新AST。我们需要使用这个新函数来替换旧函数：\n就是这样！“我们已经用我们的检测代码用等价的函数替换了原始函数。点击此处查看完整的插件。\n现在我们已经编写了插件代码，让我们对其进行测试。我们可以从对Reaction Native库中的TouchableOpacity.js文件运行此转换开始。以下是该文件在没有转换的情况下的外观：\n让我们通过默认插件(即模块中包含的插件：Metro-Reaction-Native-Babel-Preset Preset)和我们的插件运行该文件。我们可以使用Babel CLI执行此操作：\n看起来起作用了！*让我们实现检测处理程序并运行应用程序：\n在这里，我们可以从中提取元数据(表示用户触摸的组件)和电子邮件(交互触发的事件)，以创建并发送一个原始事件，我们可以稍后使用它进行分析。\n正如我们已经看到的，巴别塔插件可以是强大的。您可以将我们今天讨论的方法应用于应用程序性能检测之类的事情，比如自动计时onPress处理程序。或者您可能想要构建一个插件来创建一些新的Javascript语法，比如求幂。或者，您可以开发自己的ESLint规则。或者，如果您需要自动化大规模的代码更改，比如使用新的API，在升级依赖项之后自动修复中断更改，或者需要进行大型重构，您可以使用像jcodeshift和codemode-js这样的工具来使用Babel转换来更新整个代码库。\n如果您希望构建自己的插件，或者想更深入地了解编写Babel插件，请务必阅读Babel插件手册。在我学习巴别塔的时候，这个资源是无价的。", "note_en": "In late 2018, we decided to add first-class support for React Native in Heap. This meant bringing Heap’s autocapture philosophy to the React Native platform: installing Heap on a React Native app should mean that all user interactions with the app are captured. This includes taps, changes to text fields, and more.\n This post will look at how we did this: adding custom code as part of the app build process. We’ll talk about abstract syntax trees, how we built a Babel plugin to inject code into React Native, and some of the tools we used along the way.\n  On the web, Heap captures all user behavior on a siteclicks, etc. by adding an   onclick event listener  to the entire DOM. On iOS, Heap installs custom implementations of a few key UIKit APIs via   method swizzling . But React Native doesn’t provide any sort of global hook we can use to autocapture user interactions.\n An easy way to make autocapture work would be to create our own fork of the React Native repo, and release a package with the custom code changes. This would be a large maintenance burden, however, since we’d need to release a new React Native Heap SDK version   every  time Facebook releases a new React Native version (not just when that particular piece of React Native code changes). More generally, this would be a bad developer experience.\n After brainstorming, we came up with a better idea: inject code into React Native at   build time . The React Native Metro Bundler bundles Javascript code for almost all React Native apps, since it is the default Javascript bundler for the framework. For syntax features like   JSX , the Metro Bundler uses   Babel , a source-to-source compiler that transforms things like JSX and experimental language features into plain Javascript.\n  Babel operates on Abstract Syntax Trees internally to perform its compilation. An   Abstract Syntax Tree  (AST) is a representation of the syntactic structure of source code in the form of a tree. Lots of tools that work with code use ASTs: compilers, interpreters, linters, and formatters. For example, the code formatter Prettier auto-formats source code by parsing the code into an AST, then re-printing the AST in a predefined style.\n When looking at and exploring ASTs, we found ASTExplorer.net to be especially useful. It allows you to paste in source code and select the config used for the source code (language, parser, transforms) and it will generate the AST for that code, and, for transforms, show the resultant code.\n  We’ll be using ASTExplorer often in this post as we show how we built the solution for Heap.\n  On its own, Babel doesn’t do anything;  it’s effectively same code in -&gt; same code out. To make it do anything, we need   plugins , which configure Babel to perform operations against the AST in a specific way. Babel exposes a number of APIs that allow the user to traverse and modify AST nodes.\n You can either use existing plugins, or write your own. For example, the existing   exponentiation-operator  plugin takes code that looks like this:\n    Babel transforms use a visitor pattern. When Babel visits a node of a specific type, Babel calls the corresponding function provided for that node type. Babel passes a  path object (the representation of the path   to  the visited node) to this function to allow for accessing the visited node.\n For the exponentiation operator example, we can transform binary expressions that look like   x ** y into code that looks like  Math.pow(x, y) by implementing a function for  BinaryExpression nodes:\n   Now that we have the basic tools we need to modify source code’s AST using Babel, let’s inject some instrumentation code.\n  The most basic interaction we can capture is a touch on a    Touchable component . These are components that users can interact with by touching on them. Examples include  TouchableOpacity,  TouchableNativeFeedback, and  TouchableHighlight. For the purposes of this post, we’ll be focusing on    TouchableOpacitys .\n If you were manually tagging a  Touchable component, you’d probably add some code that looks like  analytics.track(‘touched button’) to the  onPress handler for that  Touchable. For example:\n  We don’t want to inject instrumentation into   app  code (like the  onPress handler we added tracking code to above), since code structure can vary widely between apps, and we don’t have visibility into what the code would actually look like.\n Instead, we want to find a spot in the React Native library that will   always  fire when a  TouchableOpacity is touched. A good spot is probably where  onPress is called within the  TouchableOpacity component:\n   Now that we know  where we want to inject our instrumentation code, let’s write some code to do that.\n  So we want to inject some code into this particular method, but how do we programmatically identify this method as the right spot?  Sure, it calls  onPress, but we can’t just instrument all functions that call another function called  onPress. Let’s look at a bit more of the surrounding code:\n  Using the context, we can pull out a few landmarks that tell us   this  is where we want to instrument:\n The method is  touchableHandlePress, which is passed in as the  onClick prop for the rendered  Animated.View.\n     For simplicity, let’s remove some of the irrelevant lines of code, like other methods, comments, and imports:\n    Let’s identify the parts of the AST that correspond to each bullet point for our reasoning:\n There’s an  ObjectProperty with a key name of  mixins, and within that subtree, there’s an identifier of  Touchable\n There’s a  VariableDeclarator with an id name of  TouchableOpacity. However, since we want to eventually apply our solution to other Touchables, we’ll ignore this.\n While each of these is relevant, the target node for instrumentation is the  touchableHandlePress function. Let’s rephrase these AST features to relate to this node:\n That node has a   parent  that is a  CallExpression with a callee name of  createReactClass\n As you might be thinking, this approach is a bit of a heuristic. Code in the React Native library can and does change, and we do occasionally need to update our plugin to handle these code changes. Similarly, if non-React Native code matches the AST pattern our plugin is looking for, we would potentially instrument this code, too, though this is unlikely.\n Now that we know what pattern to look for in the AST, let’s write some code to find our target node .\n Let’s start by adding a method to a basic Babel transform visitor. In our case, we’re looking for an  ObjectProperty node, so let’s start with a function that executes for all  ObjectPropertys:\n  Next, we know that the node we’re looking for has a key name of  touchableHandlePress, so let’s add a conditional that checks this:\n  Next, we want to see if the node has a parent that’s a  CallExpression with a callee name of  createReactClass. We can do this using the  findParent method on the Babel  path:\n  Finally, we want to check if this node has a sibling with the  Touchable mixin. Let’s implement this logic in a helper.\n  We can access an array of node siblings in the  paths  container field. We can search this array for the  mixins node by checking if the node is of type  ObjectProperty, and has key name  mixins and value type  ArrayExpression.\n  Once we find the  mixins node, we need to check if it contains a  Touchable identifier. We can do this by traversing the node subtree by calling  traverse with another babel visitor, and extract some state:\n    We now know the current node is where we need to inject code. So let’s inject our instrumentation.\n   We’ll be using the  babel-types package to create new AST nodes for our instrumentation:\n  Let’s start by wrapping the original function, and calling it. If we were writing code normally, we could call a function object by calling the   function’s  call property :\n  Let’s do that for this function. We’ll start by building a member expression (i.e. accessing the  call property), and then call that expression with  this and the  event  argument:\n  Next, let’s build out the code to inject. We could create this  CallExpression by creating a number of AST nodes, but for simplicity and readability, let’s use Babel templating to do this:\n  Now let’s put it all together. We’ll use templating for this, too:\n  Lastly, let’s build a new function from the function body we’ve just created:\n  Now, we have a new function that wraps the original function, and contains some instrumentation code, but it’s not actually part of the AST yet – it’s just a new AST we’ve created. We need to use this new function to replace the old function:\n  And that’s it!  We’ve replaced the original function with an equivalent function with our instrumentation code. Check out the complete plugin  here.\n  Now that we’ve written the plugin code, let’s test it out. We can start by running this transform against the  TouchableOpacity.js file in the React Native library. This is what that file looks like with no transformation:\n  Let’s run this file through default plugins (i.e. the plugins included in the  module:metro-react-native-babel-preset preset) and our plugin. We can do this with the Babel CLI:\n    Looks like it works!  Let’s implement the instrumentation handler and run the app:\n    From here, we can extract metadata from  this (which represents the component the user touched) and  e (the event the interaction triggered) to create and send a raw event we can use later for analysis.\n  As we’ve seen, Babel plugins can be powerful. You could apply the approach we discussed today to things like application performance instrumentation, like automatically timing your  onPress handlers. Or maybe you want to build a plugin to create some new Javascript syntax, like exponentiation. Or you could develop your own   ESLint rule . Or, if you need to automate a large-scale code change, such as using a new API, automating fixes for breaking changes after upgrading a dependency, or a large refactor, you can use tools like   jscodeshift  and   codemode-js  to use babel transforms to update an entire codebase.\n If you’re looking to build a plugin of your own, or want to get a little bit more in-depth about writing Babel plugins, be sure to check out the   Babel Plugin Handbook . This resource was invaluable when I was learning Babel.", "posttime": "2020-07-07 02:23:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,babel,transforms", "title": "使用Babel变换在构建时注入分析代码", "title_en": "Using Babel transforms to inject analytics code at Build Time", "transed": 1, "url": "https://heap.io/blog/engineering/how-we-leveraged-asts-and-babel-to-capture-everything-on-react-native", "via": "", "real_tags": ["代码", "babel"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010159, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经典打字机页面商店各种产品上漂亮写字机的图片。\n打字机致敬真正的作家告诉我们为什么打字机仍然是这样做的方式。", "note_en": "The Classic Typewriter Page Store  Pictures of beautiful writing machines on all sorts of products.\n  Typewriter Tributes     Real writers tell us why typewriters are still the way to do it.", "posttime": "2020-07-07 02:03:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打字机,typewriter", "title": "经典打字机页面", "title_en": "The Classic Typewriter Page", "transed": 1, "url": "https://site.xavier.edu/polt/typewriters/", "via": "", "real_tags": ["打字机"]}, {"category": "", "categoryclass": "", "imagename": "d5df290036396cd1d89336aba3b192bb.jpg", "infoid": 1010158, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦斯托克韦尔附近的T​曾经是出租车马和马戏团动物的医院，但自1992年以来，它已经成为各种霉菌、基质、骨灰、胸肌和鼻涕的家园。该档案馆收藏着近六百年的排版设备，但其主要藏品与单字印刷技术有关。这个大写字母很重要：这不是美术家的单版印刷(单字印刷，见德加)，而是19世纪末莫纳印刷公司(MonTypte Corporation)创造的巨大而复杂的凸版热金属印刷系统。它和它的竞争对手林诺排版一起，在手工凸版印刷(见古腾堡)和计算机印刷之间架起了桥梁-或者说形成了连续体。在手工凸版印刷中，排字员将单个字符排成一行进行墨水印刷。在单字排版系统中，要打印的文本是从熔化的铅新鲜机铸而成的。打字员可以将文本输入键盘，机器就会发出金属镜子，而不是必须逐行逐字拼装一本书或一份报纸。\n让过程变得更快并不一定意味着让它变得更简单-而且锻造完美形成的主人公的线条已经很复杂了。金属字体最终会失去它的锋利和锋利，所以当旧的字母和符号(或“排序”)磨损时，人们使用模具(矩阵)铸造新的字母和符号(或“排序”)。单字印刷依靠母版铸造新的字体，而这些UR字符必须不时地更换，方法是将钢制冲头打到黄铜上。排版世界是一个充满反省和双重的世界。冲头被抬起，矩阵被压低。在每个阶段，金属都需要变得更硬：将字母的字形切割到冲头中的反冲头必须是回火钢，加热到850°C。不难理解为什么印刷商经常有金属加工背景，或者为什么切割冲孔的人接受过其他精密工艺的培训，如宝石雕刻。要拿起一块像蚂蚁一样小的钢片，剪掉多余的材料，留下这个9.5点的字母‘a’，需要的力量和精确度的组合在今天是难以想象的。即使是最有经验的打孔者每天也只能完成一封信：1818年，安东尼·贝塞默(Anthony Bessemer)在一次反伪造调查中作证说，他花了12周的时间才完成了一套61次的打孔机。这是一周六天痛苦而灵巧的工作。只有星期天没有工具、成堆的筛分烟尘(用来在你工作时检查指纹)和粘在手上和衣服上的微小金属屑。\n冲裁和排字生产由铸造厂控制，他们委托设计师制作字体，然后授权给出版商。比方说，如果你在1860年是一名印刷商，想要用卡斯隆字体印刷一本书，你必须向卡斯隆铸造厂申请。铸造厂的漫长寿命证明了它们对印刷文字形式的影响力：卡斯隆铸造厂从1720年运营到1937年，后来被出售给斯蒂芬森·布莱克铸造厂(Stephenson Blake Foundry)。(类型档案馆现在拥有斯蒂芬森·布莱克(Stephenson Blake)的收藏品，其中的文物可以追溯到14世纪的卡克斯顿，尽管字体权利很久以前就在其他地方--主要是比尔·盖茨(Bill Gates)。)。Montype也实施了类似的控制，档案馆有漂亮的记录簿证明了这一点。虽然每次印刷都是新铸造的，但矩阵是由公司持有的。如果你想买一套新的，或者想更换损坏或丢失的款式，你可以去莫诺排版。\nType Archive不同寻常的部分原因是，它拥有这个过程每个阶段的机器和工具：那些属于MonType的机器和工具，以及那些属于使用其系统的印刷商的机器和工具。一个房间里有不同字体的原始图案(金属模板)，用于压制冲床的巨型机器，以及将模板尺寸缩小到所需的点或微卡的受电弓。(楼层很久以前就为这座建筑曾经容纳过的动物进行了加固，所以可以承受这些多色金属的野兽。)。字体中的每个字符都有单一的原始图案，但是打孔器和矩阵必须以不同的大小创建。斜体和粗体也是分开制作的。在类型档案馆，这个竞技场由库马尔·拉杰普特(Kumar Rajput)主持，他从1965年开始为Monotype工作，在开始培训助手之前，他是世界上唯一能够操作这些机器和制造新打孔机的人。该档案馆受益于世界上那些地区的人的专业知识-印度就是其中之一-在西方放弃Montype后继续使用它。知识比机器更容易丢失。最初的方法，将设计师的人物图画变成金属模板，例如使用蜡、玻璃和电解，但没有成功复制。取而代之的是现在使用的计算机数控铣床-另一种自动化技术，它使我们能够看到数字和点的编码语言一次\nLRB的字体Quadraat的设计师Fred Smeijers写了一本非常好的书“Anti Pack”，这本书揭露了字体设计师的工作几个世纪以来没有改变的神话。我最感兴趣的是人文主义试图用数学来控制和了解世界，这从最早的设计师和印刷商身上可见一斑，以及今天对“随机不平等”的追求，也就是我们在屏幕上错过的朗朗上口的阅读。Quadraat的“Q”也有一个滑稽的尾巴，如果你在它后面加一个逗号，它们就会融合在一起，形成一个小小的花边，“Q，”，尽管没有人会知道这一点，因为你为什么要在Q后面加逗号？而且，数字是非内联的，阿拉伯语而不是罗马字母，这也很好，即使它确实会产生一些杂乱无章的组合：65381472。这些人物很有个性。当我看到大写字母P尾部的小开口时，我知道这将是一场猛烈的噩梦。现在只剩下位图了。但就像过去任何沮丧的排字工人一样，我们面临着局限性。在Quadraat中没有瑜伽[‘ȝ’]，所以在Amia Srinivasan在本期的文章中(在那些方括号中)，你可能会发现排版相似的Minion Pro的侵入。*。\n类型档案馆充满了意想不到的乐趣(最初的翻修工作进行时，在一个假天花板上发现了一些圆顶礼帽)。它从来没有资金或志愿者数量向公众完全开放-毕竟，它是一个活的档案馆：机器不停地运行，有项目，有佣金，有教程。它的大约800万件物品距离编目还有很长的路要走。但也有一些著名的展览利用了他们的藏品，总是欢迎好奇的参观者。把这样的收藏品收集起来并保持在一起，需要很强的勇气，才能为让其他人看到和理解这些材料的单调活动获得资金；需要更多的东西才能使它成为一场尖端的选角嘉年华。型式档案馆的幕后推手苏·肖两周前去世了。她的设计标准-无情地高-是由物理标准和措施所决定的，是从费伯和其他地方的长期经验中得出的，当时生产还在内部进行，编辑必须以详细的表格给你他们的书的尺寸，当你真正理解如果你计算错误，这对机器和读者的眼睛都会产生什么影响。她的美学和哲学原则是她自己的。", "note_en": "T ​   near Stockwell in London used to be a hospital for cab horses and circus animals, but since 1992 it has been home to every sort of mould, matrix, burin, bodkin and slug. The archive holds typographical apparatus from the last six hundred years, but its main collection relates to the technology of Monotype printing. That capital letter is important: this isn’t the single-print practice of fine artists (for ‘monotypes’, see Degas) but the huge and complex letterpress hot-metal printing system created by the Monotype Corporation in the late 1800s. Along with its competitor, Linotype, it bridged the gap – or formed the continuum – between manual letterpress printing (see Gutenberg), where a compositor arranges individual characters in rows for inking, and computerised printing. In the Monotype system, the text to be printed is freshly machine-cast from molten lead. Instead of having to assemble a book or newspaper line by line, letter by letter, the typesetter could type the text into a keyboard and a machine would issue forth its metal mirror.\n  Making a process quicker doesn’t necessarily mean making it simpler – and forging lines of perfectly formed lead characters was already complicated. Metal type eventually loses its sharpness and bite, so moulds (matrices) were used to cast new letters and symbols (or ‘sorts’) when the old ones wore down. Monotype relied on matrices to cast new type, and these ur-characters had to be replaced from time to time, by driving a steel punch into brass. The typographic world is one of reflections and doubles. The punch is raised, the matrix depressed. At each stage the metal needs to get harder: the counterpunch, which cuts the glyphs of a letter into the punch, must be tempered steel, heated to 850°C. It’s not difficult to see why printers have often had metalworking backgrounds or why the people who cut punches had training in other precision crafts, such as gemstone carving. It required a combination of strength and accuracy scarcely imaginable today to take a piece of steel as small as an ant and cut away the extraneous material to leave, for instance, this 9.5 point letter ‘a’. Even the most experienced punchcutters could only complete one letter a day: in 1818 Anthony Bessemer testified to an anti-forgery inquiry that it took him 12 weeks to finish a set of 61 punches. And it was aching, dexterous work, six days a week. Only Sundays were free from tools, piles of sifted soot (to check the print as you worked) and tiny metal filings stuck to hands and clothes.\n Punchcutting and type production were controlled by foundries, which commissioned designers to create typefaces that they then licensed to publishers. If you were a printer in 1860, say, and wanted to use a Caslon typeface for a book, you had to apply to the Caslon Foundry. The long life of foundries attests to their power over the forms that printed words have taken: the Caslon Foundry ran from 1720 to 1937, when it was sold to the Stephenson Blake Foundry. (The Type Archive now owns the Stephenson Blake collection, which has artefacts dating back to Caxton in the 1400s, though the typeface rights have long gone elsewhere – mostly to Bill Gates.) Monotype exerted a similar control and the archive has beautiful record books to prove it. Although the type is newly cast for each print run, the matrices were held by the corporation. If you wanted to get a new set or to replace damaged or missing sorts, you went to Monotype.\n Part of what makes the Type Archive unusual is that it has machines and tools from every stage of the process: those that were owned by Monotype and those owned by the printers who used its system. One room contains the original patterns (metal templates) for different typefaces, the giant machines used for pressing the punches and the pantographs that reduce the size of the template to the desired point or pica. (The floors were long ago reinforced for the animals the building once accommodated, so can bear these many-tonned iron beasts.) Every character in a typeface has a single original pattern, but punches and matrices had to be created in each different size. Italics and bold are made separately too. At the Type Archive, this arena is presided over by Kumar Rajput, who began working for Monotype in 1965 and who, until he started training assistants, was the only person in the world able to work these machines and make new punches. The archive has benefited from the expertise of people from those parts of the world – India is one of them – that continued to use Monotype after it was abandoned in the West. Knowledge is more easily lost than machinery. The original method of turning a designer’s drawing of a character into a metal template, for instance, by use of wax, glass and electrolysis hasn’t been successfully replicated. Instead computer numerical control milling machines are now used – another automated technology that allows us to see how coded languages of numbers and dots once had a physical reality.\n Of the many machines at the Type Archive, which include machines to make the parts for the other machines, the two most interesting belong to the casting room. This is where the real action happens. On one, a pneumatic (in the literal sense) keyboard in black, red, white, green and blue, the typesetter keys in the text to make corresponding perforations in a paper spool. The spool is then run into the casting machine, an amazing thing with its whirring ribbon, its bowl of slowly bubbling molten lead, its matrix-case, which holds the entire font and which moves according to the pattern on the paper. The lead is poured into the right matrix and then the type shoots out, fully formed, into a frame. Not all the characters are the same width: the machine automatically adjusts them (‘kerning’) so that they sit neatly together according to their typeface (this is one of the advantages Monotype had over Linotype, which creates blocks of text rather than single characters). The casting machine is a clattering, chattering steampunk fantasy, but it’s also incredibly refined. It contains more than four thousand parts, creates four inches of text in less than a minute and can run unattended for hours. And it’s no artefact: on my last visit to the Type Archive it was hooked up to a Mac laptop, like a patient on a drip, reading a Word file and sending out line after line of Hungry Dutch (the first new typeface created for Monotype in decades). Words familiar to anyone who works on a newspaper or at a publishing house – ‘leading’, ‘rules’, ‘justifying’, ‘kerning’ – are made real here, substance is given to points and picas, and the business of transposing and reproducing text is connected to something lost but still tangible: inches, pascals, horsepower.\n  The precision (‘accuracy to two ten-thousandths of an inch’) and clarity of Monotype was a big part of its appeal to publishers: the ease of reading allows you to see the wood, not the trees. If you don’t notice the print, it’s doing its job. The aspirations of hot metal printing – speed, regularity and so on – were met in the computerised technologies that supplanted it. But there were other aspirations inherent in the process, which people hold but machines can’t. We see their echoes in words like these, typed on a computer and printed via a computer. The programme we use at the  LRB, InDesign, spaces the words within a line and the lines down a page to be as visually undisturbing as possible, according to a set of rules and algorithms. The pleasingly uneven spaces between characters are written into the typeface. Look at the letters on this page. The gaps between individual characters vary to give the impression of even spacing; to account for the tail of a ‘y’ or the hook of an ‘f’; to stop a paired ‘AV’ from sitting miles apart from one another. Each letter has a kern relationship with its neighbour: o n e  f i n d s  i t  d o e s n ’ t  l o o k  n e a r l y  s o  n i c e  w i t h o u t  k e r n i n g . Or consider this 14-point o (the letter) and this 14-point 0 (the number). The hole in the middle is identical – once upon a time, the same punch would have been used to strike both. The difference lies in their balance: the letter ‘o’ is slightly asymmetrical; the number ‘0’ perfectly even. There are tricks played on the eye all the time, which we read even as we are reading. When the letter and the number run close together, as in the phrase ‘30,000 volumes’ in Neal Ascherson’s piece in this issue, that subtle distinction keeps you on track.\n It does something else too. The danger with computerisation is that, as the designer Bram de Does points out, ‘too much harmony is counterproductive in long-term reading, old-fashioned reading.’ You need something to grip onto, something other than the smooth and perfect contrast of a liquid crystal screen. The typeface helps, as does the texture of paper, the richness of ink. Dickens, who like many authors was not well inclined to his printer, wrote that\n this feeling of dislike to the printer altogether disappeared from the time I saw my own name in print. I now feel gratified at looking at the jolly letter O, the crooked S, with its full benevolent turns, the curious G, and the Q with its comical tail, that first awoke in me a sense of the humorous.\n Fred Smeijers, the designer of Quadraat, the  LRB’s typeface, has written a very good book,  Counterpunch, which disposes of the myth that the work of the type designer has remained unchanged for centuries. What’s most interesting to me is the humanist attempt to control and know the world mathematically, evidenced in the earliest designers and printers, and today’s pursuit of ‘random inequality’, the crunchiness of reading that we miss onscreen. Quadraat’s ‘Q’ also has a comical tail, and if you put a comma after it they meld together to form a little flourish, ‘Q,’, though no one will ever know that because why would you put a comma after a Q? And it’s nice, too, that the numbers are non-lining, Arabic rather than Romanised, even if it does produces some higgledy combinations: 65 38 14 72. These characters have character. When I see the little opening in the tail of the capital P, I know that this would have been a punchcutting nightmare. Now it’s just bitmaps. But like any frustrated typesetter of the past, we face limitations. There is no yogh [‘ȝ’] in Quadraat, so in Amia Srinivasan’s piece in this issue (and in those square brackets) you may spot the intrusion of the typographically similar Minion Pro. *\n The Type Archive is full of unexpected delights (when the original renovations were being made a number of bowler hats were discovered above a false ceiling). It has never had the money or the volunteer numbers to be fully open to the public – and, after all, it’s a living archive: the machines run continually with projects, commissions, tutorials. Its eight million or so items are a long way from being catalogued. But there have been notable exhibitions drawing on their holdings and curious visitors are always welcome. It takes a strong nerve to bring together a collection of this sort and keep it together, to get funding for the humdrum activities that allow other people to see and make sense of these materials; it takes something more to make it a cutting-edge casting carnival. Sue Shaw, the force behind the Type Archive, died a fortnight ago. Her standards of design – unrelentingly high – were informed by physical standards and measures, by long experience at Faber and other places when production was still done inhouse and editors had to give you the measurements of their books on detailed forms, when you really understood what it did both to the machine and to the eye of the reader if you miscalculated. Her aesthetic and philosophical principles were her own.", "posttime": "2020-07-07 02:03:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "类型,type,印刷", "title": "在类型档案馆", "title_en": "At the Type Archive", "transed": 1, "url": "https://www.lrb.co.uk/the-paper/v42/n13/alice-spawls/at-the-type-archive", "via": "", "real_tags": ["类型", "type", "印刷"]}, {"category": "", "categoryclass": "", "imagename": "e8ec80829c45ab9d6fd384432270110d.png", "infoid": 1010157, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，我是Sari Azout，这是第48版的Check Your Pulse，这是一份科技和初创企业时事通讯，旨在让你感觉自己是人。我试着让这封邮件成为你每周收到的最好的电子邮件之一。如果你已经收到了这封电子邮件，而且你不是订阅者，你可以通过点击下面这个红色的大按钮来加入。\n每次我坐下来写今天的帖子，我都会想出一个做其他事情的借口。这可能是精疲力竭的征兆。和孩子们呆在家里的四个月让我精疲力尽。总而言之，我将暂停几个星期。今年夏天晚些时候我会回到你的收件箱里。\n这份时事通讯的一个反复出现的主题是从零工经济向创作者经济的转变，从大型的横向社交网络向垂直的利基微型社区的转变。\n在零工经济中，贡献时间和数据的用户会得到线性奖励-为了赚得更多，优步司机需要开更多的车。平台呈指数级增长，而平台最重要的资产-驱动力-却线性增长。\n为了应对零工经济，人们正在考虑如何利用自己的技能和创造力，并将这些与互联网的独特品质-零边际分销成本-结合起来，以赚取不对称的时间回报。\n今年4月，Tachable的创始人在推特上表示，100名创作者在他们的平台上赚了超过100万美元。Visualize Value的杰克·布彻(Jack Butcher)出售一门很受欢迎的课程，标题是：创造一次，销售两次。Patreon的平台上有超过18万名创作者。\n我们的价值观正在改变。随着大型平台从用户的个人数据和时间中变得越来越富有，人们正试图重新获得控制权，新一波公司准备与他们对话。\nReddit推出了社区积分(Community Points)，这是一种让Reddit用户在他们最喜欢的社区中分得一杯羹的方式。\n正如司机是优步最大的资产一样，粉丝和社区成员也是创建者最大的资产。\n今天，新兴的创作者阶层正在使用Substack和OnlyFans等订阅工具实现货币化。订阅经济的问题是，粉丝没有机会拥有资产，而且订阅模式没有考虑到粉丝给他们的社区带来的价值。\n举一个真实世界的例子来说明：假设你每月支付20美元才能进入一个创始人社区。每个人都被收取相同的费用，无论他们的贡献水平如何。相反，如果社区拿出一部分费用流，并将其分发给对社区产生最积极影响的成员，会怎么样？\n虽然它还是一个新的空间，但有几家公司正在我所说的“参与式经济”中建设-在这种经济中，粉丝们参与到创作者的成功中来。Cent是创作者和粉丝共同赚取收入的网络。Roll和Rally正在为社会资金建设基础设施。将自己描述为“文化股票交易所”的基金会正在为创意产业带来新的收入来源和所有制形式。\n随着用例变得更加清晰，我希望密码领域有更多的公司使用创建者的语言。有一些技术复杂性需要克服，但我怀疑采用这些产品的关键障碍将是缺乏语言/市场适应性。创建者并不关心协议、治理令牌、铸币和原生资产等时髦词汇。他们关心的是：我如何才能与我的粉丝建立更好的关系？\n而且，越来越多的人似乎会给粉丝提供激励，帮助创作者取得成功，这似乎就是答案。\n我们现在正处于一个过渡的世界。创作者将他们的作品带到世界上的模式正在改变。旧的规则和假设正在瓦解，没有人知道新的规则和假设是什么。虽然这令人害怕，但也是一种解放。\n虽然我几乎不是密码爱好者，但合作经济网络的想法真的让我兴奋，因为它们是科技世界末日头条上充满希望的转折。\n我喜欢这样：提升别人的抱负是你可以用你的时间和生命做的最有价值的事情之一。在关键时刻，你可以显著提高其他人的抱负，特别是在他们相对年轻的时候，只需建议他们做一些比他们想象的更好或更雄心勃勃的事情。虽然这样做的成本相对较低，但对他们和更广泛的世界来说，好处可能是巨大的。事实上，这是你可以用你的时间和生命做的最有价值的事情之一。🔍✨。\n如果你正在寻找礼物的想法，我喜欢这个4k周的海报-一个强有力的提醒，生命是多么短暂。🔄。\n瑞安·霍利迪学到的33件事的清单充满了智慧💭👇🏽。\n最好、最礼貌的借口就是说你有规定。“我有个规定，我不能在电话里决定。”“我有一条规定，我不接受礼物。”“我有个规定，我不能再免费发言了。”人们尊重规则，他们接受拒绝[提议、请求、要求、机会]不是你的错，而是规则让你别无选择。\n你的上一本书不会写下一本。“。你总是从零开始。如果你认为你过去的成功保证了你什么，那么你就会被粗暴地觉醒。\n“我们需要彼此的时代”是一篇很有说服力的文章。我们的文化验证并颂扬那些站在大平台上向数百万人讲话的人，而忽视那些卑微、安静的工作，只照顾一个病人、一个孩子或地球上一个小地方的人。🌎。\n我喜欢在公共场合学习的想法。内森·巴切斯(Nathan Baschez)和丹·希珀(Dan Shipper)在一个新的播客“谈话疗法”(Talk Treatment)中记录了他们的时事通讯业务的推出过程，而Packy McCormick‘s则公开分享了他的时事通讯的发展过程，而不是无聊。💬。\nAirbnb的布莱恩·切斯基谈到了旅游的未来。人们想在家里工作的想法很有趣--只是不想在家里工作。✈️\n市场营销正在吞噬世界。对于美国的大多数软件企业来说，问题不再是技术知识。问题是在分销中加入一个楔子。🚀。\n一篇关于失败偏见的好文章。我们在硅谷犯的最大错误之一就是概括初创公司失败的原因。谷歌是第24个搜索引擎。Facebook至少是第十二家社交网络。有一天，一家公司会来做Theranos试图做的事情，许多公司会通过。考虑到我们的认知偏见，从过去学到太多是危险的。-🧠。\n我叫莎莉·阿祖特。我是一名设计思想家、策略师，也是Level Ventures和Rokk3r的早期初创投资者。我的使命是给技术和商业带来更多的人性和创造力。\n如果你喜欢这份时事通讯，如果你能和一两个朋友分享，我会很高兴的。你可以把他们送到这里注册。", "note_en": "Hi, I’m  Sari Azout and this is the the 48th edition of Check your Pulse, a tech and startups newsletter designed to make you feel human. I try to make this one of the best emails you get each week. If you’ve been sent this email and you’re not a subscriber, you can join by clicking on this big red button below.\n    Every time I sat down to write today’s post, I came up with an excuse to do something else. That’s probably a sign of burnout. Four months at home with the kids has taken a lot out of me. All this to say, I’ll be taking a pause for a few weeks. I’ll be back in your inbox later this summer.\n  One recurring theme of this newsletter has been the transition from  the gig economy to the creator economy and from  large horizontal social networks to vertical, niche micro-communities.\n In the gig economy, users who contribute time and data are rewarded linearly — to earn more, an Uber driver needs to drive more. The platform grows exponentially, while the platform’s most important asset — the driver — earns linearly.\n In response to the gig economy, people are thinking about ways to leverage their skills and creativity and combine those with the unique qualities of the Internet — zero marginal cost of distribution —  to  earn an asymmetric return on their time.\n In April, the founder of Teachable  tweeted that 100 creators had made over a million dollars on their platform.  Jack Butcher of Visualize Value sells a popular course titled:  create once, sell twice. Patreon has well over  180,000 creators on its platform.\n Our values are changing. And as large platforms get richer off their users’ personal data and time, people are trying to regain control and a new wave of companies is ready to speak to them.\n     Reddit launches Community Points, a way for Redditors to earn a piece of their favorite communities.\n       Just as drivers are Uber’s biggest asset, fans and community members are a creators’ biggest asset.\n Today, an emerging class of creators is monetizing using subscription tools like  Substack and  OnlyFans. The problem with the subscription economy is there is no opportunity for fans to own assets, and further, subscription models don’t take into account the value that fans bring to their communities.\n To illustrate with a real-world example: suppose you pay $20/month for access to a community of founders. Everyone is charged the same, regardless of their level of contribution. What if instead the community took a portion of the fee stream and distributed it to the members who most positively impacted the community?\n  While it’s still a nascent space, there are a few companies building in what I call “the participatory economy” — where fans participate in a creator’s success.  Cent is a network for creators and fans to earn income together.  Roll and  Rally are building infrastructure for social money. And  Foundation, which describes itself as a “stock exchange for culture” is bringing new revenue streams and forms of ownership to creative industries.\n    As the use cases become clearer, my hope is that more companies in the crypto space speak the language of creators. There are technical complexities to overcome, but I suspect the key barrier to adoption of these products will be lack of  language/market fit. Creators don’t care about buzzwords like protocols, governance tokens, minting, and native assets. What they care about is: how can I build a better relationship with my fans?\n And increasingly, it seems giving fans incentives to help a creator succeed is the answer.\n We&#39;re in a transitional world right now. The models by which creators get their work out into the world are changing. The old rules and assumptions are crumbling and nobody knows what the new ones are. It’s intimidating, but also liberating.\n And while I’m hardly a crypto-enthusiast, the idea of cooperative economic networks really excite me because they’re such a hopeful twist on the tech doomsday headlines.\n        I love this:   raising other people’s aspirations is one of the most valuable things you can do with your time and your life.  At critical moments in time, you can raise the aspirations of other people significantly, especially when they are relatively young, simply by suggesting they do something better or more ambitious than what they might have in mind.  It costs you relatively little to do this, but the benefit to them, and to the broader world, may be enormous. This is in fact one of the most valuable things you can do with your time and with your life. 🔍✨\n If you’re looking for gift ideas, I love this   4k weeks poster — a powerful reminder of how short life is. 🔄\n Ryan Holiday’s list of   33 things he’s learned is full of wisdom 💭👇🏽\n The best and most polite excuse is just to say you have a rule. “I have a rule that I don’t decide on the phone.” “I have a rule that I don’t accept gifts.” “I have a rule that I don’t speak for free anymore.” People respect rules, and they accept that it’s not you rejecting the [offer, request, demand, opportunity] but that the rule allows you no choice.\n Your last book won’t write your next one.” You are constantly starting at zero. If you think your past success guarantees you anything, you’re in for a rude awakening.\n The age of we need each other is a powerful essay.  Our culture validates and celebrates those who are out there with big platforms speaking to millions of people, while ignoring those who do humble, quiet work, taking care of just one sick person, one child, or one small place on this earth. 🌎\n        I love the idea of learning in public. Nathan Baschez and Dan Shipper are documenting the process of launching their   newsletter business in a new podcast,   Talk Therapy while Packy McCormick’s is openly sharing the process of growing his newsletter,   Not Boring. 💬\n AirBnB’s Brian Chesky on   the future of travel. There’s something interesting about the idea of people wanting to work from home - just not their homes. ✈️\n Marketing is eating the world.  For most software businesses in the US, the problem isn’t technical knowledge anymore. The problem is getting a wedge into distribution. 🚀\n A great essay on   failureship bias.  One of the biggest mistakes we make in Silicon Valley is generalizing reasons why startups fail. Google was the 24th search engine. Facebook was the at least the dozenth social network. A company will come around one day doing what Theranos tried to and many will pass. Learning too much from the past given our cognitive biases is dangerous. 🧠\n       My name is Sari Azout. I am a design-thinker, strategist, and early stage startup investor at  Level Ventures and  Rokk3r. My mission is to bring more humanity and creativity to technology and business.\n     If you&#39;re enjoying this newsletter, I&#39;d love it if you shared it with a friend or two.  You can send them here to sign up.", "posttime": "2020-07-07 02:03:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经济,economy", "title": "从零工经济到创作者经济再到参与式经济", "title_en": "From the gig economy to the creator economy to the participatory economy", "transed": 1, "url": "https://sariazout.substack.com/p/check-your-pulse-48", "via": "", "real_tags": ["经济", "economy"]}, {"category": "", "categoryclass": "", "imagename": "a481371724a9ce4c092aa2a55d2a9ce9.jpg", "infoid": 1010156, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在几次去矿井拍摄这些照片后，我震惊地意识到我们允许这样的破坏继续下去。当我发现欧特克支持莱茵集团(RWE)、开采煤炭和扩建煤矿时，我在Twitter上联系了首席执行官。他否认对此负责。他对气候紧急状态和行为的误解令我震惊。下面是完整的故事：", "note_en": "After a couple of visits at the mine to shoot these images, I was devastated to realize that we allow such destruction to continue. When I discovered that Autodesk is supporting RWE, the coal extraction and the expansion of the mine, I contacted the CEO on twitter. He denied responsibility.   His misunderstanding of the climate emergency and behavior blew my mind.   Here&#39;s the full story:", "posttime": "2020-07-07 02:03:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "煤炭,coal,矿井", "title": "欧特克与煤炭开采", "title_en": "Autodesk and Coal Mining", "transed": 1, "url": "https://autodesk.earth/", "via": "", "real_tags": ["煤炭", "coal", "矿井"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010155, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代码说它做什么。这对计算机很重要，因为代码是我们要求计算机做某事的方式。这对人类来说是可以的，只要我们永远不需要修改或调试代码。一旦我们这么做了，我们就有麻烦了。从根本上说，调试是更改程序所做的事情以匹配其应该做的事情的练习。它要求我们知道程序应该做什么，而代码中没有捕捉到这一点。有时这很容易：它做的是崩溃，它应该做的不是崩溃。在这些微不足道的案例之外，发现意图就更难了。\n应该做的时候调试是微妙的，例如在构建分布式系统协议时，尤其困难。在我们数以百万计的微型数据库论文中，我们说：\n我们的代码审查、模拟世界测试和设计会议经常引用我们协议的TLA+模型来解决Java代码或书面通信中的歧义。\n问题是，实现(在Physalia的情况下是Java代码)既是协议的不完美实现，也是协议过于具体的实现。它过于具体，因为它需要完全指定。虽然协议本身有一定的回旋余地和回旋余地，但计算机要求做到这一点。它也过于具体，因为它必须解决诸如低级性能问题之类的问题，而这些问题是规范无法解决的。\nArrayList中的这些值是因为顺序实际上很重要，还是因为O(1)个随机查找很重要，还是其他原因？这是最容易写的东西吗？当我改变它的时候会发生什么？\n业务逻辑代码虽然缺乏分布式协议的威望，但存在更多此类问题。代码都过度指定了业务逻辑，并且指定得不准确。@mcclure111的一条推文促使我写下了这条推文，她一针见血地写道：\n由于大多数软件没有正式的规范，大多数软件都是这样做的，因此在编辑其他人的代码时要尊重作者的意图，这是一种令人难以置信的压力。你不知道哪些怪癖是负重的。\n-mcc🏳️‍⚧️🏳️‍🌈(@mcclure111)2020年6月20日\n这是代码的一个主要问题：您不知道哪些怪癖是负重的。你可能记得，或者能够猜测，或者能够从基本原则中猜出来，或者不在乎，但所有这些事情都很慢，而且容易出错。我们能做些什么呢？\n文档不够酷。大多数软件工程师走出校门时似乎认为文档在他们之下(技术作家的工作)，或者他们的SE教授谈到的一些和Fortran一样古老的奇怪的事情。这在一定程度上是可以理解的。我自己的软件工程课程强调用UML刻意地记录实现。没有提到其他文件。用UML重写软件基本上对任何人都没有帮助。我完成了我的学位，认为文档是不必要的繁重工作。甚至敏捷宣言也同意我的观点：\n我后来发现，设计文档编码了在开发系统期间做出的意图和决策，有助于团队在短期内取得成功，而人们在长期内取得成功。摆脱了头脑中的一切，相信以后可以重新发现被遗忘的事实，这让我变得更有勇气，我可以走得更快。同样的道理也适用于团队。\n我看到成功的团队正在做的一件事是，不仅记录他们设计背后的内容和原因，而且记录他们是如何做出决定的。当需要对系统进行更改时-无论是为了调试还是为了响应不断变化的需求-这些文档都是无价的。当你一开始就不知道为什么会是这样的时候，很难决定改变某件事是否安全。记录你是如何做出决定的很重要，因为你是一个有缺陷的人，了解你是如何做出决定的，了解这个决定什么时候看起来很奇怪，或者令人惊讶，这是很有用的。\n此文档流程不一定是重量级的。除非你认为有帮助，否则你不必绘制费力的ER图。您可能应该完全忽略UML。取而代之的是，尽可能用散文清晰而简洁地描述系统。可以从为您的团队构建RFC模板开始，这可能会受到您在Web上找到的模板的启发。Squaspace的模板似乎是合理的。有些设计可以很好地适应RFC格式，有些则不适合。你最好在可能的地方写叙事性的文章。\n那么，请保管好这些文件。把它们存放在安全的地方。把它们浸泡在醋里，系在你的胸口上。您需要确保需要维护系统的人员能够找到它们。当他们在探索历史时，让他们感觉更像是图书馆的参观者，而不是劳拉·克罗夫特(Lara Croft)。\n我并不主张预先进行大设计。我们在项目实施过程中学到的许多最重要的东西。在实施完成数年后，我们学到了一些最重要的东西。设计文档不是静态的一次性提前交付，而是一个持续的过程。最重要的是，设计文档并不是对坏想法的承诺。如果它出了问题，就把它修好，然后继续往前走。文档不是与魔鬼的交易。\n很少有话题会像评论那样引起程序员的热议。我们被告知，评论是愚蠢的，或者是幼稚的，或者让人很难展示你在编写那些错综复杂的代码时有多有男子汉气概。如果它很难写，那么它也应该很难读。毕竟，你是代码界的詹姆斯·乔伊斯(James Joyce)。\n这意味着“揭示”作者意图的评论是有价值的，而揭示“没有作者意图”的评论就更有价值了。如果没有这些提示，你就会迷信地编辑，即使你不知道为什么也会保留怪癖。https://t.co/YhvWnXjp9i。\n-mcc🏳️‍⚧️🏳️‍🌈(@mcclure111)2020年6月20日。\n注释允许我们以编程语言并不总是能做到的方式将作者意图编码到我们的代码中。类型、特征、接口和变量名确实将意图放入代码中，但不是完全的(我明白了，请键入System Maximsts)。这些相同的东西允许我们传达缺乏意图-考虑随机访问与ArrayList-但也是不完整的。注释良好的代码应该使作者的意图清晰，特别是在意图在代码转换过程中丢失的情况下，或者在实现约束隐藏设计意图的情况下。链接回设计文档的代码注释特别有用。\n有些语言比其他语言更需要注释。有些，比如SQL，我发现几乎总是隐藏在实现细节后面的设计意图。\n对规范的需求源于两个观察结果。首先，在做之前想一想我们要做什么是个好主意，正如漫画家金登所写的那样：写作是大自然让你知道你的想法有多草率的一种方式。\n第二个观察结果是，要编写一个好的程序，我们需要考虑代码级别之上的问题。\n我发现规范，从叙述性写作的非正式规范到TLA+的正式规范，使编写程序的速度更快，并有助于减少错误。尽管我非常喜欢这篇文章，但我认为兰波特忽略了形式规范价值的一个关键部分：它是一个很棒的交流工具。在开发我构建的一些最棘手的系统时，我发现经过大量注释的正式规范是非常有用的文档。规范语言都是关于意图的，其中一些语言使得清晰地将意图与实现分开变得容易。\n我们在亚马逊广泛使用TLA+，事实证明它在Phsalia的开发中非常有用。我们的团队以三种方式使用TLA+：编写协议规范以检查我们是否深入理解它们，使用TLC模型检查器对规范的正确性和活动性进行模型检查，以及编写广泛注释的TLA+代码作为分布式协议的文档。虽然这三种方法都使用附加值，但TLA+作为一种自动测试(通过TLC)且极其精确的协议文档格式可能是最有用的。\n正式规范是优秀的文档。就像设计文档一样，它们不是一成不变的产物，而是我们对这个问题所学到的东西的反映。\n建立持久的、可维护的系统不仅需要与计算机通信，还需要在空间与他人通信，并在时间上与我们未来的自己通信。传达、记录和索引我们设计背后的意图是这幅画的重要组成部分。要么为它腾出时间，要么以后后悔。", "note_en": "Code says what it does. That&#39;s important for the computer, because code is the way that we ask the computer to do something. It&#39;s OK for humans, as long as we never have to modify or debug the code. As soon as we do, we have a problem. Fundamentally, debugging is an exercise in changing what a program does to match what it should do. It requires us to know what a program should do, which isn&#39;t captured in the code. Sometimes that&#39;s easy: What it does is crash, what it should do is  not crash. Outside those trivial cases, discovering intent is harder.\n Debugging when  should do is subtle, such as when building distributed systems protocols, is especially difficult. In our  Millions of Tiny Databases paper, we say:\n Our code reviews, simworld tests, and design meetings frequently referred back to the TLA+ models of our protocols to resolve ambiguities in Java code or written communication.\n The problem is that the implementation (in Physalia&#39;s case the Java code) is both an imperfect implementation of the protocol, and an overly-specific implementation of the protocol. It&#39;s overly-specific because it needs to be fully specified. Computers demand that, and no less, while the protocol itself has some leeway and wiggle room. It&#39;s also overly-specific because it has to address things like low-level performance concerns that the specification can&#39;t be bothered with.\n Are those values in an ArrayList because order is actually important, or because O(1) random seeks are important, or some other reason? Was it just the easiest thing to write? What happens when I change it?\n Business logic code, while lacking the cachet of distributed protocols, have even more of these kinds of problems. Code both over-specifies the business logic, and specifies it inaccurately. I was prompted to write this by a tweet from @mcclure111 where she hits the nail on the head:\n Since most software doesn&#39;t have a formal spec, most software &#34;is what it does&#34;, there&#39;s an incredible pressure to respect authorial intent when editing someone else&#39;s code. You don&#39;t know which quirks are load-bearing.\n— mcc 🏳️‍⚧️🏳️‍🌈 (@mcclure111)  June 20, 2020\n  This is a major problem with code:  You don&#39;t know which quirks are load-bearing. You may remember, or be able to guess, or be able to puzzle it out from first principles, or not care, but all of those things are slow and error-prone. What can we do about it?\n  Documentation is uncool. Most software engineers seem to come out of school thinking that documentation is below them ( tech writer work), or some weird thing their SE professor talked about that is as archaic as Fortran. Part of this is understandable. My own software engineering courses emphasized painstakingly documenting the implementation in UML. No other mention of documentation was made. Re-writing software in UML helps basically nobody. I finished my degree thinking that documentation was unnecessary busywork. Even the  Agile Manifesto agreed with me  1:\n  What I discovered later was that design documentation, encoding the intent and decisions made during developing a system, helps teams be successful in the short term, and people be successful in the long term. Freed from fitting everything in my head, emboldened by the confidence that I could rediscover forgotten facts later, I could move faster. The same applies to teams.\n One thing I see successful teams doing is documenting not only the  what and  why behind their designs, but the  how they decided. When it comes time to make changes to the system—either for debugging or in response to changing requirements—these documents are invaluable. It&#39;s hard to decide whether its safe to change something, when you don&#39;t know why it&#39;s like that in the first place. The record of how you decided is important because you are a flawed human, and understanding how you came to a decision is useful to know when that decision seems strange, or surprising.\n This documentation process doesn&#39;t have to be heavyweight. You don&#39;t have to draw painstaking  ER diagrams unless you think they are helpful. You should probably ignore UML entirely. Instead, describe the system in prose as clearly and succinctly as you can. One place to start is by building an RFC template for your team, potentially inspired by one that you find on the web.  SquareSpace&#39;s template seems reasonable. Some designs will fit well into that RFC format, other&#39;s won&#39;t. Prefer narrative writing where you can.\n Then, keep the documents. Store them somewhere safe. Soak them in vinegar  and tie them around your chest. You&#39;re going to want to make sure that the people who need to maintain the system can find them. As they are spelunking through history, help them feel more like a library visitor and less like Lara Croft.\n I&#39;m not advocating for Big Design Up Front. Many of the most important things we learn about a project we learn during the implementation. Some of the most important things we learn years after the implementation is complete. Design documentation isn&#39;t a static one-time ahead-of-time deliverable, but an ongoing process. Most importantly, design documentation is not a commitment to bad ideas. If it&#39;s wrong, fix it and move forward. Documentation is not a deal with the devil.\n  Few topics invite a programmer flame war like comments. We&#39;re told that comments are silly, or childish, or make it hard to show how manly you are in writing that convoluted mess of code. If it was hard to write, it should be hard to read. After all, you&#39;re the James Joyce of code.\n  This means comments that *reveal* authorial intent are valuable, and comments that reveal *there was no authorial intent* are even more valuable. Without those hints, you&#39;re left editing superstitiously, preserving quirks even when you don&#39;t know why.  https://t.co/YhvWnXjp9i\n— mcc 🏳️‍⚧️🏳️‍🌈 (@mcclure111)  June 20, 2020\n  Comments allow us to encode  authorial intent into our code in a way that programming languages don&#39;t always. Types, traits, interfaces, and variable names do put intent into code, but not completely (I see you, type system maximalists). These same things allow us to communicate a lack of intent—consider  RandomAccess vs  ArrayList—but are also incomplete. Well-commented code should make the intent of the author clear, especially in cases where that intent is either lost in the translation to code, or where implementation constraints hide the intent of the design. Code comments that link back to design documents are especially useful.\n Some languages need comments more than others. Some, like SQL, I find to nearly always obscure the intent of the design behind implementation details.\n   The need for specifications follows from two observations. The first is that it is a good idea to think about what we are going to do before doing it, and as the cartoonist Guindon wrote: &#34;Writing is nature&#39;s way of letting you know how sloppy your thinking is.&#34;\n The second observation is that to write a good program, we need to think above the code level.\n I&#39;ve found that specification, from informal specification with narrative writing to formal specification with TLA+, makes writing programs faster and helps reduce mistakes. As much as I like that article, I think Lamport misses a key part of the value of formal specification: it&#39;s a great communication tool. In developing some of the trickiest systems I&#39;ve built, I&#39;ve found that heavily-commented formal specifications are fantastically useful documentation. Specification languages are all about  intent, and some make it easy to clearly separate intent from implementation.\n  We use TLA+ extensively at Amazon, and it proved exceptionally useful in the development of Physalia. Our team used TLA+ in three ways: writing specifications of our protocols to check that we understand them deeply, model checking specifications against correctness and liveness properties using the TLC model checker, and writing extensively commented TLA+ code to serve as the documentation of our distributed protocols. While all three of these uses added value, TLA+’s role as a sort of automatically tested (via TLC),and extremely precise, format for protocol documentation was perhaps the most useful.\n Formal specifications make excellent documentation. Like design docs, they aren&#39;t immutable artifacts, but a reflection of what we have learned about the problem.\n  Building long-lasting, maintainable, systems requires not only communicating with computers, but also communicating in space with other people, and in time with our future selves. Communicating, recording, and indexing the intent behind our designs is an important part of that picture. Make time for it, or regret it later.", "posttime": "2020-07-07 02:02:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,说明,code", "title": "代码只说明它所做的事情", "title_en": "Code only says what it does", "transed": 1, "url": "http://brooker.co.za/blog/2020/06/23/code.html", "via": "", "real_tags": ["代码", "说明", "code"]}]