[{"category": "", "categoryclass": "", "imagename": "22c2c7fb5fd55ba95016d798b021c5cd.jpeg", "infoid": 1029091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-周四，美国总统唐纳德·特朗普(Donald Trump)的Twitter竞选账户被解封，此前这家社交媒体公司暂时对其进行了限制，称该账户中一段关于民主党总统候选人乔·拜登(Joe Biden)儿子的视频违反了规则。\n@TeamTrump账号发布的视频提到了周三“纽约邮报”(New York Post)的一篇报道，其中包含亨特·拜登(Hunter Biden)与一家乌克兰能源公司进行商业交易的据称细节，并表示这位前副总统已经会见了该公司的一名顾问。\n拥有220万粉丝的特朗普竞选团队在一条新的推文中表示，他们将“重新发布推特不想让你看的视频。”Twitter没有回应就该账户为何被解锁发表评论的请求。\n拜登竞选团队发言人安德鲁·贝茨(Andrew Bates)在一份声明中表示，共和党领导的参议院委员会此前得出结论，乔·拜登没有参与与乌克兰有关的不当行为。\nTwitter早些时候表示，这段视频违反了禁止发布私人信息的规定，并补充说，该账号可能需要删除该帖子才能继续发布推文。\n特朗普在推特上被问及这一举动时表示：“这一切都将以一场大诉讼告终，有些事情可能会非常严重，我不愿看到这些事情发生，但很可能不得不看到这种情况发生。”\nTwitter周三表示，“华盛顿邮报”的报道违反了其“黑客材料”政策，该政策禁止传播通过黑客攻击获得的包含私人信息或商业秘密的内容，或者将人们置于人身伤害的风险中。\nTwitter首席执行官杰克·多尔西(Jack Dorsey)周三在推特上表示，“我们围绕@nypost文章的行动进行的沟通不是很好。通过推特或DM阻止URL共享，却没有任何上下文说明我们为什么要阻止：这是不可接受的。“\nFacebook Inc.和Twitter周三采取积极措施，限制“华盛顿邮报”报道在发表后几个小时内的传播。\n周三，在白宫新闻秘书凯利·麦克纳尼(Kayleigh McEnany)分享了“华盛顿邮报”的故事后，Twitter也对她的账户施加了类似的限制。无论是@nypost还是@kayleighmcenany账号都有近一天的时间没有发推文了，这表明它们仍然被屏蔽。\n包括一名记者在内的其他推特用户表示，他们的账户已被暂停，因为他们发布了纽约邮报报道的链接。在删除了令人不快的推文后，这些账户被解锁。\n委员会主席林赛·格雷厄姆(Lindsey Graham)以及共和党参议员特德·克鲁兹(Ted Cruz)和乔什·霍利(Josh Hawley)表示，委员会将于10月20日(星期二)就发出传票进行投票，并计划在10月23日之前让多尔西出现在委员会面前。\n格雷厄姆说：“我们终于要有一份逾期已久的会计报告了。”“对我来说，这比我能想到的任何事情都更清楚地说明了这个问题。”\nTwitter、Facebook和Alphabet Inc.旗下谷歌(Google)的首席执行官也将于本月晚些时候出席参议院商务委员会(Senate Commerce Committee)的听证会，讨论第230条-互联网公司享有的一项宝贵的法律豁免权，该条款为科技公司提供保护，使其免受对用户发布的内容的责任。\n要求改革第230条并惩罚科技公司的呼声一直在增强，但国会今年就该法律采取行动的可能性微乎其微。", "note_en": "(Reuters) - U.S. President Donald Trump’s Twitter election campaign account was unblocked on Thursday after the social media company temporarily restricted it, saying a video from the account about Democratic presidential candidate Joe Biden’s son violated its rules.\n  The video posted by the @TeamTrump account referred to a New York Post story from Wednesday that contained alleged details of Hunter Biden’s business dealings with a Ukrainian energy company and said the former vice president had met with an adviser of the company.\n The Trump campaign, with 2.2 million followers, said in a new tweet it was “re-posting the video Twitter doesn’t want you to watch.” Twitter did not respond to a request for a comment about why the account had been unblocked.\n Biden campaign spokesman Andrew Bates said in a statement that Republican-led Senate committees have previously concluded that Joe Biden engaged in no wrongdoing related to Ukraine.\n  Twitter said earlier the video violated its rules against posting private information, adding the account may need to delete the post in order to continue tweeting.\n “It’s going to all end up in a big lawsuit and there are things that can happen that are very severe that I’d rather not see happen, but it’s probably going to have to,” Trump said, when asked about the move by Twitter.\n Twitter said on Wednesday the Post story violated its “hacked materials” policy, which bars the distribution of content obtained through hacking that contains private information or trade secrets, or puts people at risk of physical harm.\n  Twitter’s Chief Executive Jack Dorsey tweeted on Wednesday saying “our communication around our actions on the @nypost article was not great. And blocking URL sharing via tweet or DM with zero context as to why we’re blocking: unacceptable.”\n Facebook Inc and Twitter took proactive steps on Wednesday to restrict dissemination of the Post story in the hours after it was published.\n Twitter had placed similar restrictions on the account of White House Press Secretary Kayleigh McEnany on Wednesday, after she shared the Post story. Neither the @nypost or @kayleighmcenany accounts have tweeted in nearly a day, suggesting that they are still blocked.\n  Other Twitter, users, including a journalist, said their accounts had been suspended because they had posted a link to the New York Post story. The accounts were unblocked after they deleted the offending tweets.\n    Committee Chairman Lindsey Graham and Republican senators Ted Cruz and Josh Hawley said the committee will vote on sending the subpoena on Tuesday, Oct. 20 and plans to have Dorsey in front of the committee by Oct. 23.\n  “We’re going to finally have an accounting that is long overdue,” Graham said. “This to me crystallizes the problem better than anything I could think of.”\n  The CEOs of Twitter, Facebook and Alphabet Inc’s Google are also set to appear before the Senate Commerce Committee later this month at a hearing to discuss Section 230 - a prized legal immunity enjoyed by internet companies, which offers tech companies protection from liability over content posted by users.\n The calls to reform Section 230 and penalize tech companies has been intensifying but there is little chance of action on the law by Congress this year.", "posttime": "2020-10-16 02:41:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,发布,restricts,表示", "title": "推特限制特朗普的竞选账号发布推文", "title_en": "Twitter restricts Trump's campaign account from tweeting", "transed": 1, "url": "https://www.reuters.com/article/idUSKBN2702C4?il=0", "via": "", "real_tags": ["推特", "发布", "restricts", "表示"]}, {"category": "", "categoryclass": "", "imagename": "de9c5efe4f021ff749f7405bf4669da1.jpeg", "infoid": 1029090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的现金来自牵头这轮融资的考恩可持续投资顾问公司(Cowen可持续性Investment Advisors)，以及索罗斯基金管理公司(Soros Fund Management)、世代投资管理公司(Generation Investment Management)和Broadscale Group的资金。\n考恩以1.5亿美元拿下了这轮融资的大部分，而索罗斯、Generation和Broadscale又支付了5000万美元。\n在这笔新的注资之前，关于这家大型宏基电池系统开发商可能进行公开募股的猜测已经持续了一年之久。TechCrunch上一次报道是在2019年8月，据投资者称，Proterra的估值已达到10亿美元，当时将寻求潜在的IPO。\n该公司表示，新资金将用于支持该公司在电池和电动传动系统技术以及业务开发方面正在进行的研发努力，以增加该公司在更多商用车细分市场的足迹。\nProterra还在研究充电和能源管理技术开发，以降低与运营电动车队相关的车队管理成本。\n到目前为止，Proterra已经从投资者那里筹集了总计至少约10亿美元的股权和债务，投资者包括G2VP、凯鹏华盈(Kleiner Perkins Caufield&amp；Byers)、星座风险投资公司(Constulation Ventures)、三井物产公司(Mitsui&amp；Co.)以及宝马I风险投资公司(BMW I Ventures)、爱迪生能源公司(Edison Energy)、联邦运输管理局(Federal Transportation Administration)、通用汽车(General Motors)的风险投资部门和陶氏资本合伙公司。\nProterra主要为地方、州和联邦机构制造一次充电可以行驶350英里的公交车。加利福尼亚州伯灵格姆。该公司拥有多名前特斯拉员工担任领导职务，其中包括该公司前首席执行官Ryan Popple，该公司还将业务多元化，向其他重型和中型商用电动汽车制造商提供动力列车。\n该公司在一份声明中说，该公司目前正在与Thomas Build Bus、Van Hool、fcc、Bustech和Optimal-EV等OEM合作，将其技术驱动的100%电池电动汽车推向市场。\nProterra现任董事长兼首席执行官杰克·艾伦说：“随着对电池电动汽车和100%零排放车队的需求增长，我们很高兴能与CSI和我们的其他投资者合作，加快向所有人提供清洁、安静的交通工具的过渡，并在世界各地提供更多的Proterra动力汽车。”", "note_en": "The new cash comes from Cowen Sustainable Investment Advisors, which led the round, along with money from  Soros Fund Management,   Generation Investment Management and Broadscale Group.\n Cowen took the bulk of the round with $150 million while Soros, Generation and Broadscale forked over another $50 million.\n  This new capital infusion follows a year’s worth of speculation about a potential public offering for the big honkin battery systems developer. TechCrunch last reported in August 2019 that  Proterra had hit a $1 billion valuation according to investors and would be seeking a potential IPO at the time.\n  The company said the new money would go to support the company’s ongoing research and development efforst into battery and electric drivetrain technologies and business development to increase the company’s footprint in additional commercial vehicle segments.\n Proterra’s also looking at charging and energy management technology development to lower fleet management costs associated with operating electric fleets.\n To date, Proterra has raised equity and debt totaling at least roughly $1 billion from investors including G2VP, Kleiner Perkins Caufield &amp; Byers, Constellation Ventures, Mitsui &amp; Co. as well as BMW i Ventures, Edison Energy, the Federal Transportation Administration, General Motors’s venture arm and  Tao Capital Partners  .\n Proterra, mainly makes buses for local, state and federal agencies that can travel 350 miles on a single charge. The Burlingame, Calif. company, which has a number of former Tesla employees in leadership positions, including the company’s former chief executive Ryan Popple, has also diversified its business to provide its power trains to other heavy- and medium-duty commercial electric vehicle manufacturers.\n The company is now working with OEMs like Thomas Built Bus, Van Hool, FCCC, BusTech and Optimal-EV to bring 100% battery-electric vehicles powered by its technology to market, the company said in a statement.\n “As demand grows for battery-electric vehicles and 100% zero-emission fleets, we are excited to collaborate with CSI as well as our other investors to accelerate the transition to clean, quiet transportation for all and deliver even more Proterra Powered vehicles around the world,” said Jack Allen, Proterra’s current chairman and chief executive.", "posttime": "2020-10-16 02:38:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "proterra,big", "title": "\n生产大型喇叭电池系统和电动公交车的Proterra筹集了2亿美元", "title_en": "\n\t\t\t\tProterra, which makes big honkin battery systems and electric buses, raises $200 million\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/proterra-which-makes-big-honkin-battery-systems-and-electric-buses-raises-200-million/", "via": "", "real_tags": ["proterra", "big"]}, {"category": "", "categoryclass": "", "imagename": "3d9481ed25994f9464f5e13c6e2d63c8.jpeg", "infoid": 1029088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年是一堆糟糕的事情。而且也不小坏。当我们被困在家里，通过真实或虚拟的窗户看世界时，每一条令人沮丧的消息都感觉被放大了。\n像你们中的许多人一样，几周前我透过窗户近距离地看到了气候变化。它不再是微妙或抽象的，它是明亮的橙色，到处都是。这个问题突然显得比以往任何时候都更大、更紧迫。\n当地球着火的时候，罪魁祸首在我的街道上滚来滚去。单人驾驶的汽油动力汽车是地球上第二大温室气体排放者。\n但棘手问题的重大解决方案并不是一夜之间就能拼凑起来的。登月计划在很长一段时间内坚定不移地承诺，同时骑着期望的循环，从炒作到幻灭疯狂摇摆。\n然而，有时会有一些微小但意义重大的时刻，这些年的努力的影响和希望以非常切实的方式展示出来。\n本着这种精神，我很兴奋地告诉大家，我们刚刚达到了这样的时刻之一。\n今天，克鲁斯获得了加州车管所的许可，可以从我们的自动驾驶汽车中移除人力后备司机。我们不是第一家获得这一许可的公司，但我们将是第一家在美国大城市的街道上使用它的公司。\n在今年年底之前，我们将把车开到旧金山的街道上--没有汽油，也没有人开车。因为安全地移走司机是自动驾驶汽车的真正基准，也因为燃烧化石燃料不是建设交通运输未来的途径。\n我明白了--这件事的戏剧性可能很难理解。所有人都会看到一辆汽车，静静地开着车穿过这座城市。不是超速。不是坠机。只是静静地巡航。(老实说，我有时希望安全驾驶能像火箭发射一样发自肺腑-我们的视频会更精彩，我可以写更少的博客文章。)。\n但即使没有真正的发射升空，这也是我们的登月计划。而旧金山混乱不堪、布满砂砾的街道就是我们的发射台。这是执行邮轮任务的每个人倾注了多年的血汗和泪水的地方。这也是超过200万英里的城市测试将第一次真正上路的地方：一辆电动汽车，自动驾驶，在世界上最困难的驾驶城市之一导航。\n虽然在郊区做这件事会更容易，那里的驾驶复杂程度要低30-40倍，但我们的城市是世界交通危机的起点。这就是事故、污染、拥堵和无障碍的冲突之处。通常是字面意思。\n个人汽油动力汽车每年排放的二氧化碳几乎是其自身重量的三倍。巡航车没有喷出任何东西。\n在这场大流行中，美国人在道路上的死亡速度加快到了15年来的最快水平。较少的交通导致人们像白痴一样开车。更多的超速，酗酒和吸毒。安全带少了。自动驾驶汽车将拯救数百万人的生命。\n城市居民在社会疏远方面出现了可悲的转折，现在购买的汽车比以往任何时候都多。交通不仅会恢复正常，还会比以往任何时候都糟糕。但是，可以安全高效地共享的自动驾驶汽车将显著和永久地减少拥堵。\n对我们的城市、我们的世界和我们的气候的影响将是真实的，而且比你想象的要快。\n但今天，我要庆祝这一时刻--这是我们登月任务迈出的一小步，但意义重大。\n在接下来的几个月里，如果你碰巧看到我们的任何一辆车在路上，请向前挥手。里面可能没有任何人，但他们也能看到你，并感谢你的支持，因为他们推动了我们所有人的改变。", "note_en": "2020 has been a heap of bad. And not small bad either. As we’ve been stuck at home, viewing the world through either real or virtual windows, every bit of depressing news has felt magnified.\n Like many of you, I looked through my window a few weeks ago and saw climate change up close and personal. No longer subtle or abstract, it was bright orange and everywhere. The problem suddenly seemed more massive and immediate than ever.\n And while the planet is on fire, the culprits are literally rolling up and down my street. Single occupant, human-driven, gasoline-powered cars are the second largest contributors of greenhouse gases on Earth.\n  But big solutions to intractable problems aren’t just hacked together overnight. Moonshots take an unwavering commitment over a long time, while riding cycles of expectations that swing wildly from hype to disillusionment.\n From time to time, though, there will be small but significant moments where the impact and promise of those years of effort show themselves in a very tangible way.\n And in that spirit I’m excited to share that we’ve reached one of those moments just now.\n Today, Cruise received a permit from the California DMV to remove the human backup drivers from our self-driving cars. We’re not the first company to receive this permit, but we’re going to be the first to put it to use on the streets of a major U.S. city.\n Before the end of the year, we’ll be sending cars out onto the streets of SF — without gasoline and without anyone at the wheel. Because safely removing the driver is the true benchmark of a self-driving car, and because burning fossil fuels is no way to build the future of transportation.\n  I get it — the drama of this might be hard to appreciate. All anyone will see is a car, silently driving by itself through the city. Not speeding. Not crashing. Just quietly cruising. (Truthfully, I sometimes wish that safe driving could be as visceral as a rocket launch — our videos would be more exciting, and I could write fewer blog posts.)\n But even without a literal launch into the sky, this is our moonshot. And the chaotic, gritty streets of SF are our launchpad. This is where years of blood, sweat, and tears have been poured out by everyone on the Cruise mission. And it’s where over two million miles of city testing will truly hit the road for the first time: an electric car, driving by itself, navigating one of the most difficult driving cities in the world.\n And while it would be easier to do this in the suburbs, where driving is 30–40 times less complex, our cities are ground zero for the world’s transportation crisis. This is where accidents, pollution, congestion, and lack of accessibility collide. Often quite literally.\n  Personal, gasoline-powered vehicles spew nearly three times their own weight in carbon dioxide every year. Cruise cars spew none.\n The pandemic has seen the killing of Americans on our roads accelerate to the fastest rate in 15 years. Less traffic caused people to drive like idiots. More speeding, drinking and drugs. Fewer seatbelts. Self-driving cars will save millions of lives.\n City dwellers, in a sad twist on social distancing, are now buying more cars than ever. Traffic won’t just come back, it will suck worse than ever. But self-driving cars, which can be shared safely and efficiently, will reduce congestion dramatically and permanently.\n The impact on our cities, our world, and our climate will be real and sooner than you might think.\n But for today, I’m going to celebrate this one moment — this small but significant step on our own mission to the moon.\n And in the months ahead, if you happen to see any of our cars out on the road, go ahead and wave. There might not be anyone inside, but they see you too, and appreciate your support as they drive change for us all.", "posttime": "2020-10-16 02:33:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gm,驾驶", "title": "克鲁斯(GM)获得全无人驾驶汽车许可证", "title_en": "Cruise (GM) Receives Permit for Fully Driverless Cars", "transed": 1, "url": "https://medium.com/cruise/its-time-to-drive-change-f447f27cb353", "via": "", "real_tags": ["gm", "驾驶"]}, {"category": "", "categoryclass": "", "imagename": "c70691d3d073b023f3e3b423a1859a4a.jpg", "infoid": 1029086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Verizon在2018年因在一场野火中限制消防部门的无限制数据计划而引发争议，但这并没有阻止该公司推出大量广告，声称Verizon服务是消防员和其他紧急响应人员的必备服务。但其中几个广告显然做得太过分了，在T-Mobile向广告业自律机构提出投诉后，Verizon同意停止播放这些广告。\n美国国家广告部(NAD)今天在一份投诉结果公告中表示，Verizon承诺永久停止其面向消防员的5G Build Right和面向First Responders的5G Build Right广告以及其中提出的受到质疑的主张。(注：威瑞森5G Build Right for First Responders广告和其中提出质疑的主张)今天在一份投诉结果公告中表示，Verizon承诺永久停止其针对消防员的5G Build Right广告和针对First Responders广告的5G Build Right广告。\nNAD表示，它实际上没有审查消防员和急救人员的投诉，因为Verizon同意在调查之前撤回他们。但NAD调查了T-Mobile的其他指控，并建议Verizon停止或修改其他几个做出不支持声明的广告。Verizon同意遵守NAD的调查结果。\nVerizon仍在大肆宣扬其5G网络能够提升消防员拯救生命的能力。但是，为消防员打造的5G广告和为First Responders打造的5G广告不再出现在Verizon的YouTube频道上。\n一家商业跟踪网站提供了这则为消防员打造的5G广告的文字记录，这则广告现已停产，显然是在1月份Verizon推出以5G为重点的超级碗(Super Bowl)广告活动时首次亮相的。\n当我着火的时候，通常当你打开门的时候，浓烟都落到了地上，一片漆黑。在建筑火灾中，时间真的是至关重要的，因为它可能意味着生死。有了5G，我们将能够将(消防员)穿过面具的视频流回指挥中心，并将这些来自多个来源的视频拼接在一起，以提供更好的态势感知。5G超宽带是所有这些应用程序工作所必需的。\n但是，5G超宽带以任何实质性方式帮助消防员的可能性很小。5G超宽带是Verizon所说的毫米波服务，它提供极高的速度，但只在大城市的小范围内提供。这是因为毫米波频率传播不远，很容易被墙壁和其他障碍物阻挡。", "note_en": "Verizon&#39;s 2018 controversy over its  throttling of a fire department&#39;s &#34;unlimited&#34; data plan during a wildfire didn&#39;t stop the carrier from rolling out numerous ads claiming that Verizon service is a must-have for firefighters and other emergency responders. But a couple of those ads apparently went too far, and Verizon agreed to stop running them after a complaint that T-Mobile lodged with the advertising industry&#39;s self-regulatory body.\n &#34;Verizon committed to permanently discontinue its &#39;5G Built Right for Firefighters&#39; and &#39;5G Built Right for First Responders&#39; advertisements and the challenged claims made therein,&#34; the National Advertising Division (NAD) said today in an  announcement of the complaint&#39;s outcome.\n The NAD said it didn&#39;t actually review the firefighter and first-responder complaints on their merits because Verizon agreed to pull them before an investigation. But the NAD investigated other T-Mobile claims and recommended that Verizon discontinue or modify several other ads that made unsupported statements. Verizon agreed to comply with the NAD&#39;s findings.\n Verizon is  still hyping its 5G network&#39;s supposed ability to boost firefighters&#39; ability to save lives. But the &#34;5G Built Right for Firefighters&#34; and &#34;5G Built Right for First Responders&#34; ads no longer appear on Verizon&#39;s YouTube channel.\n A  commercial-tracking website provides a transcript for the now-discontinued &#34;5G Built Right for Firefighters&#34; ad, which apparently debuted in January as Verizon rolled out a  5G-focused Super Bowl ad campaign.\n  When I&#39;m going into a fire, usually when you open the door smoke is down to the ground, it&#39;s pitch black. Time is really of the essence in a structure fire because it can mean life or death. With 5G, we&#39;re going to be able to stream the video that [firefighters are] getting through their mask back to a command center and stitch those videos from multiple sources together to provide greater situational awareness. 5G Ultra Wideband is necessary for all of these applications to work.\n But there&#39;s very little chance that &#34;5G Ultra Wideband&#34; would help firefighters in any substantial way. 5G Ultra Wideband is what Verizon calls its millimeter-wave service, which offers extremely high speeds but is only available in small pockets of big cities. That&#39;s because millimeter-wave frequencies can&#39;t travel far and are easily blocked by walls and other obstacles.", "posttime": "2020-10-16 02:19:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,5g,声称,verizon", "title": "Verizon被迫撤下广告，声称消防员需要Verizon 5G", "title_en": "Verizon forced to pull ad that claimed firefighters need Verizon 5G", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/verizon-forced-to-pull-ad-that-claimed-firefighters-need-verizon-5g/", "via": "", "real_tags": ["广告", "5g", "声称", "verizon"]}, {"category": "", "categoryclass": "", "imagename": "08d8e1268fa54bf76ea4ef68fc8a5e35.jpg", "infoid": 1029084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "招聘中的本能感觉和“随心所欲”应该谨慎对待，决策应该始终基于你准确指出的与角色相关的证据。", "note_en": "Instinctive feelings and ‘going with your gut’ in hiring should be treated with caution and decisions should always be based on role-relevant evidence you pinpoint.", "posttime": "2020-10-16 02:14:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据,companies,相关", "title": "\n新兴公司靠数据茁壮成长。难道他们不应该用它来改进招聘决策吗？", "title_en": "\n\t\t\t\tEmerging companies thrive on data. Shouldn’t they use it to improve hiring decisions?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/emerging-companies-thrive-on-data-shouldnt-they-use-it-to-improve-hiring-decisions/", "via": "", "real_tags": ["数据", "companies", "相关"]}, {"category": "", "categoryclass": "", "imagename": "b8e4e6e17d5850ee55dcdc73a708b9b4.png", "infoid": 1029083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "牛津大学研究人员发明的这项测试在速度方面也具有显著优势，不需要任何样品准备，只需不到5分钟就能提供结果。这意味着它可能是开启大规模检测的技术之一-这不仅是控制当前的新冠肺炎大流行的关键需要，也是帮助我们应对未来潜在的全球病毒爆发的关键需要。牛津的方法实际上也是为此精心设计的，因为它有可能被配置成相对容易地检测到一些病毒威胁。\n实现这一点的技术是通过使用短的荧光DNA链作为标记来标记在患者收集的样本中发现的任何病毒颗粒。显微镜对样本和标记的病毒进行成像，然后机器学习软件使用该团队开发的算法分析来自动识别病毒，利用每种病毒因其不同的物理表面组成、大小和不同的化学成分而发出的荧光的不同而产生的差异。\n根据研究人员的说法，这项技术，包括样本采集设备、显微成像仪和荧光插入工具，以及计算能力，可以被微型化到几乎可以在任何地方使用的程度-包括“商业、音乐场地、机场”等等。现在的重点是创建一家衍生公司，以将该设备商业化，并将所有组件集成在一起。\n研究人员预计能够成立公司，并在明年初开始产品开发，有可能在大约六个月后批准使用一款设备，并准备好分销。开发一种新的诊断设备的时间表很紧，但面对这场大流行，时间表已经发生了很大的变化，而且还会继续这样做，因为我们不太可能看到在不久的将来会不会消失。", "note_en": "The test created by the Oxford researchers also offer significant advantages in terms of speed, providing results in under five minutes, without any sample preparation required. That means it could be among the technologies that unlock mass testing – a crucial need not only for getting a handle on the current COVID-19 pandemic, but also on helping us deal with potential future global viral outbreaks, too. Oxford’s method is actually well-designed for that, too, since it can potentially be configured relatively easily to detect a number of viral threats.\n The technology that makes this possible works by labelling any virus particles found in a sample collected by a patient using short, fluorescent DNA strands that act as markers. A microscope images the sample and the labelled viruses present, and then machine learning software takes over using algorithmic analysis developed by the team to automatically identify the virus, using differences that each one produces in terms of its fluorescent light emitted owing to their different physical surface makeup, size and individual chemical composition.\n This technology, including the sample collection equipment, the microscopic imager and the flourescence insertion tools, as well as the compute capabilities, can be miniaturized to the point where it’s possible to be used just about anywhere, according to the researchers – including “businesses, music venues, airports,” and more. The focus now is to create a spinout company for the purposes of commercializing the device in a format that integrates all the components together.\n The researchers anticipate being able to form the company, and start product development by early next year, with the potentially of having a device approved for use and ready for distribution around six months after that. It’s a tight timeline for development of a new diagnostic device, but timelines have changed already amply in the face of this pandemic, and will continue to do so as we’re unlikely to see if fade away anytime in the near future.", "posttime": "2020-10-16 02:14:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器,results,病毒", "title": "\n新的基于牛津机器学习的新冠肺炎测试可以在5分钟内给出结果", "title_en": "\n\t\t\t\tNew Oxford machine learning-based COVID-19 test can provide results in under 5 minutes\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/new-oxford-machine-learning-based-covid-19-test-can-provide-results-in-under-5-minutes/", "via": "", "real_tags": ["机器", "results", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "ba5ba14271694d9038173b7d9d5f0b44.jpg", "infoid": 1029082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这里有一个有趣的问题：聊天现在也将对消费者免费使用。目前，你必须是付费G Suite/Workspace用户才能访问这项服务(尽管不知何故在我的免费个人账户上启用了这项服务)。\n虽然聊天并不完全是Hangout的1对1替代，但它实际上为群聊以及围绕文件和任务的协作提供了大量附加功能，以及新的安全工具。聊天、房间和会议也将被深度集成到Gmail应用程序中，作为谷歌工作空间迁移的一部分。\n谷歌表示，它将自动将所有Hangout对话、联系人和历史记录迁移到聊天中，但目前还没有提供这方面的细节。谷歌表示，最终时机可能仍会改变。不过，目前还不清楚谷歌何时会强制所有人迁移并永久关闭Hangout服务器。\n这里还有更多细节：如果你在Google Fi上使用Hangout，Hangout的支持将在明年初消失。传统上，Fi用户可以从Hangout打电话和管理短信。这种体验将迁移到谷歌的消息应用程序上。\n如果你是谷歌语音的用户，也会发生类似的转变。对于语音呼叫和短信，Hangout用户现在将被定向到Voice应用程序，明年初，您的语音支持将从Hangout中删除。\n对于美国和欧洲的所有用户来说，从Hangout拨打电话的功能将在明年初消失-Hangout中的群组视频通话将过渡到11月会面。\n是的，这一切听起来都很复杂，但这是谷歌自己造成的问题。几年前，我们的想法是将Hangout的用户转移到其Allo和Duo应用程序和商业用户的聊天和会面(或当时他们被称为什么)。Allo失败了(使用Duo的人很少)，这让谷歌面临着一项艰巨的任务，那就是在可预见的未来保留老化的Hangout平台，并使整个过渡变得更加困难和复杂，以至于我不确定消费者是否真的理解正在发生的事情。", "note_en": "One interesting wrinkle here: Chat will now also become free to use for consumers. Currently, you have to be a paying G Suite/Workspace user to access the service (though somehow it’s enabled on my free personal account).\n While Chat isn’t an exact 1-to-1 replacement of Hangouts, it actually offers a bunch of additional features for group chats and collaboration around files and tasks, as well as new security tools. Chat, together with Rooms and Meet, will also be integrated deeply into the Gmail app as part of Google’s Workspace migration.\n   Google says it will automatically migrate all Hangouts conversations, contacts and history to Chat, but it’s not providing details about this yet. Final timing, Google says, may still shift. It’s not clear, though, when Google will force everyone to migrate and shut down the Hangouts servers for good.\n There are a few more details here: if you use Hangouts with Google Fi, Hangouts support will go away ‘early next year.’ Traditionally, Fi users were able to make calls and manage their text messages from Hangouts. That experience will migrate to Google’s Messages app.\n If you’re a Google Voice user, there’s a similar transition happening. For voice calls and text messages, Hangouts users will now be directed to the Voice app and early next year, your Voice support will be removed from Hangouts.\n And for all users in the U.S. and Europe, the ability to call phones from Hangouts will disappear at the beginning of next year — and group video calls in Hangouts will transition to Meet in November.\n Yeah — that all sounds complicated, but it’s a problem of Google’s own making. A few years ago, the idea was to move Hangouts users to its Allo and Duo apps and business users to Chat and Meet (or whatever they were called back then). Allo flopped (and few people use Duo), leaving Google with the unenviable task of keeping the aging Hangouts platform around for the foreseeable future and making the overall transition harder and more complicated, to the point where I’m not sure that consumers really understand what’s happening.", "posttime": "2020-10-16 02:14:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,免费,hangout,migrate", "title": "\n谷歌将在2021年让所有人从Hangout迁移到免费聊天", "title_en": "\n\t\t\t\tGoogle will let everyone migrate from Hangouts to Chat for free in 2021\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/hangouts-meet-chat/", "via": "", "real_tags": ["google", "谷歌", "免费", "hangout", "migrate"]}, {"category": "", "categoryclass": "", "imagename": "493d9669d72e5ffdfc0de614d121b7eb.jpg", "infoid": 1029081, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是Nanoleaf的第一条可以同时使用两种不同形状的产品线。这些三角形有大小两种，具有其他Nanoleaf面板上的所有功能，包括镜像屏幕和同步音乐。这些面板还包括谷歌助手、亚马逊Alexa、苹果Homekit和三星SmartThings。\n与过去的Nanoleaf产品不同，形状线中的面板使用固定到位的刚性连接器连接。安装解决方案也得到了改进，允许用户安装面板，而不必将每个面板都拧到墙上。\n这是我们在检查新形状线中的六边形嵌板时得出的结论。\nNanoleaf Hexagons是Nanoleaf阵容中的一个极好的补充，我认为与公司现有的选择相比，它们是最有可能吸引更广泛客户基础的型号。我个人并没有想到会成为Nanoleaf的忠实粉丝--我以前从来没有对他们提供的产品有过丝毫的兴趣。但当我一打开六边形的电源，我就惊讶地发现他们改善了空间的美学。\n整套套装的全尺寸三角形售价199美元，迷你三角形售价119美元。扩展包分别为59美元和119美元。", "note_en": "This is the first product line from Nanoleaf that can use two different shapes at the same time. The triangles are available in large and small sizes, and feature all of the functions found on other Nanoleaf panels including mirroring a screen, and syncing to music. The panels also Google Assistant, Amazon Alexa, Apple Homekit and Samsung Smartthings.\n  Unlike past Nanoleaf products, the panels in the Shape line connect using a rigid connector that snaps into place. The mounting solution is also improved, allowing users to install panels without having to screw each panel to the wall.\n Here’s what we concluded  when reviewing the hexagon panels in the new Shape line.\n The Nanoleaf Hexagons are a terrific addition to the Nanoleaf lineup, and I think they’re the model that’s mostly likely to appeal to a much broader customer base when compared to the company’s existing options. I personally didn’t expect to be that big a fan of Nanoleaf in general — I’d never been more than mildly interested in their offerings before. But as soon as I powered on the Hexagon, I was amazed at how much I felt like they improved the aesthetics of the space.\n The complete kits cost $199 for the full size triangles and $119 for the mini triangles. Expansion packs are $59 and $119, respectively.", "posttime": "2020-10-16 02:14:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nanoleaf,adds", "title": "\nNanoleaf在其改装后的形状生产线上增加了大小三角形", "title_en": "\n\t\t\t\tNanoleaf adds large and small triangles to its revamped Shape product line\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/nanoleaf-adds-large-and-small-triangles-to-its-revamped-shape-product-line/", "via": "", "real_tags": ["nanoleaf", "adds"]}, {"category": "", "categoryclass": "", "imagename": "3f061222bf568896778b732148245b17.jpg", "infoid": 1029080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加州机动车管理局(California DMV)是该州监管自动驾驶汽车测试的机构，该机构表示，许可证允许该公司在旧金山境内指定的街道上测试五辆自动驾驶汽车，而无需司机驾驶。自2015年以来，克鲁斯一直拥有测试自动驾驶汽车的许可证，安全司机在方向盘后面。\n周四，邮轮公司首席执行官丹·安曼在公司博客上写道：“我们不是第一家获得这一许可的公司，但我们将是第一家在美国大城市的街道上使用这一许可的公司。”“在今年年底之前，我们将把汽车送到旧金山的街道上--没有汽油，也没有人驾驶。因为安全移走司机才是自动驾驶汽车的真正标杆，也因为燃烧化石燃料不是建设交通未来的办法。“。\n安曼将无人驾驶许可证的发放描述为该公司的一个低调、关键但具有里程碑意义的时刻，该公司已致力于自动驾驶汽车技术六年。\n“这件事的戏剧性可能很难欣赏。所有人都会看到一辆汽车，静静地开着车穿过这座城市。不是超速。不是坠机。只是静静地巡航，“他写道。“但即使没有真正的发射升空，这也是我们的登月计划。而旧金山混乱不堪、布满砂砾的街道就是我们的发射台。这是执行邮轮任务的每个人倾注了多年的血汗和泪水的地方。这也是200多万英里的城市测试将首次真正上路的地方：一辆电动汽车，自动驾驶，在世界上最困难的驾驶城市之一导航。“。\n无人驾驶许可意味着没有人在方向盘后面，这是有一定限制的。机动车管理局表示，邮轮车辆的设计是为了在白天和晚上的任何时间在标示限速不超过每小时30英里的道路上行驶，但不会在大雾或大雨期间进行测试。任何申请无人驾驶许可证的公司都必须提供保险或相当于500万美元的保证金的证据，验证车辆是否能够在没有司机的情况下运行，符合联邦机动车安全标准或获得国家公路交通安全管理局(National Highway Traffic Safety Administration)的豁免，并且是SAE 4级或5级车辆。\n克鲁斯是加州第五家获得无人驾驶许可证的公司。Waymo、Autox、NURO和Zoox也拥有无人驾驶许可证。根据机动车管理局的数据，目前有60家公司拥有有效的许可证，可以在安全司机的帮助下测试自动驾驶汽车。", "note_en": "The California DMV, the agency that regulates autonomous vehicle testing in the state, said the permit allows the company to test five autonomous vehicles without a driver behind the wheel on specified streets within San Francisco. Cruise has had a permit to  test autonomous vehicles with safety drivers behind the wheel since 2015.\n “We’re not the first company to receive this permit, but we’re going to be the first to put it to use on the streets of a major U.S. city,” Cruise CEO Dan Ammann wrote Thursday on the  company’s blog. “Before the end of the year, we’ll be sending cars out onto the streets of SF — without gasoline and without anyone at the wheel. Because safely removing the driver is the true benchmark of a self-driving car, and because burning fossil fuels is no way to build the future of transportation.”\n  Ammann described the issuance of the driverless permit as a low, key but milestone moment for the company, which has been working on autonomous vehicle technology for six years.\n “The drama of this might be hard to appreciate. All anyone will see is a car, silently driving by itself through the city. Not speeding. Not crashing. Just quietly cruising,” he wrote. “But even without a literal launch into the sky, this is our moonshot. And the chaotic, gritty streets of SF are our launchpad. This is where years of blood, sweat, and tears have been poured out by everyone on the Cruise mission. And it’s where over two million miles of city testing will truly hit the road for the first time: an electric car, driving by itself, navigating one of the most difficult driving cities in the world.”\n The driverless permit, which means no humans will be behind the wheel, comes with certain restrictions. The Cruise vehicles are designed to operate on roads with posted speed limits not exceeding 30 miles per hour, during all times of the day and night, but will not test during heavy fog or heavy rain, the DMV said. Any company applying for with driverless permit must provide evidence of insurance or a bond equal to $5 million, verify vehicles are capable of operating without a driver, meet federal Motor Vehicle Safety Standards or have an exemption from the National Highway Traffic Safety Administration, and is a SAE Level 4 or 5 vehicle.\n Cruise is the fifth company to be  issued the driverless permit in California. Waymo, AutoX, Nuro and Zoox also have driverless permits. Currently, 60 companies have an active permit to test autonomous vehicles with a safety driver, according to the DMV.", "posttime": "2020-10-16 02:14:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "旧金山,无人驾驶,test", "title": "\n克鲁斯现在可以在旧金山的街道上测试无人驾驶车辆", "title_en": "\n\t\t\t\tCruise can now test driverless vehicles on the streets of San Francisco\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/cruise-can-now-test-driverless-vehicles-on-the-streets-of-san-francisco/", "via": "", "real_tags": ["旧金山", "无人驾驶", "test"]}, {"category": "", "categoryclass": "", "imagename": "bf723a47fc9a416dadcfc531bce1f83c.jpg", "infoid": 1029079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本文作者是SlicedBrand的创始人兼首席执行官。SlicedBrand是一家全球顶级公关机构，总部位于\r柏林。\n它有助于传播公司成功不可或缺的重要新闻公告和话题。它及时与媒体沟通，以确保准确的报道和控制对话。它建立了一种信任和参与的状态，推动公司的愿景和目标向前发展。当然，除非那家公司是特斯拉，在这种情况下，它不想要任何东西。\n据汽车博客electrik证实的众多内部消息来源称，今年以来，特斯拉一直在缓慢解散其内部公关部门，留下公司创始人埃隆·马斯克(Elon Musk)的唯一发言权。\n这给特斯拉创造了一个来自公司的信息黑洞。如果对新闻中发生的任何事情没有官方立场，事实就会被混淆。例如，考虑一下最近发生的自动驾驶碰撞或新车车顶脱落的案例。\n或者上个月，当特斯拉汽车发生重大停电时，媒体只能猜测。不再有公关部门对这些事件进行回复。看起来，特斯拉采取了一种危机管理策略，似乎认为最好的行动方针是忽视未来的危机，这些危机就会自己消失。不幸的是，对特斯拉来说，现实生活并非如此。", "note_en": "Ayelet Noff is the founder and CEO of  SlicedBrand, a top global PR agency headquartered in\rBerlin.\n  It helps spread important news announcements and topics integral to a company’s success. It communicates with the media in a timely manner to ensure accurate coverage and control the conversation. It builds a state of trust and engagement that propels a company’s vision and goals forward. Unless of course that company is  Tesla,   in which case it wants none of that.\n According to numerous internal sources  confirmed by automotive blog Electrik, Tesla has been slowly dissolving its internal PR department over the course of this year, leaving the sole voice of the company its founder, Elon Musk.\n  What this creates for Tesla is a black hole of information coming from the company. Facts will be obfuscated if there is no official position on whatever happens in the news. For instance, consider the recent cases of self-driving collisions or  a roof flying off a new car.\n Or last month, when there was  a major outage in Tesla vehicles, the press was left to speculate. There is no longer a PR department to reply to these incidents. It seems that Tesla has adopted a crisis management strategy that appears to think that the best course of action is to ignore future crises and they will just go away on their own. Unfortunately for Tesla, real life doesn’t work like that.", "posttime": "2020-10-16 02:14:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,公关,pr", "title": "\n特斯拉裁撤公关部门的决定可能会造成公关噩梦", "title_en": "\n\t\t\t\tTesla’s decision to scrap its PR department could create a PR nightmare\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/teslas-decision-to-scrap-its-pr-department-could-create-a-pr-nightmare/", "via": "", "real_tags": ["特斯拉", "公关", "pr"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊将不必为其直接销售给消费者的产品支付英国新的数字服务税，但在其网站上销售产品的小型零售商将面临更高的收费。\n这项税收旨在让亚马逊(Amazon)、谷歌(Google)和Facebook等科技公司在英国缴纳更多税款，预计最终每年将为英国财政部带来约5亿GB的收入。\n亚马逊已经表示，对在英国获得的收入征收2%的税将转嫁给卖家，但它不会将这笔费用增加到其平台上的广告费用上。\n根据泰晤士报的一篇报道，亚马逊去年在英国的总收入为137亿英镑，只缴纳了1440万英镑的公司税，将不必为其直接销售的商品缴税。\n新税不是针对销售额征收的，这也将惩罚乐购(Tesco)和约翰·刘易斯(John Lewis)等在线零售商，而是针对亚马逊(Amazon)和谷歌(Google)等公司向第三方收取的服务费。\n由于亚马逊的第三方卖家支付的金额将上涨2%，这家美国零售商实际上正在从直接销售给消费者的竞争商品中获得价格优势。\n“在我看来，这绝对令人愤慨，”赫尔利勋爵(Lord Leigh)在上议院表示。赫尔利是保守党同僚，也是该党前财务主管。“很明显，英国政府没有适当地对亚马逊征税，并允许它对自己通过市场销售的商品避税。”\n上个月，谷歌告诉其在英国的数万名广告客户，从11月开始，它将对谷歌和YouTube上提供的广告收取额外费用，以支付新的2%的英国税。据估计，此举每年将增加营销人员约1.2亿英镑的成本。\n今年6月，英国和其他欧洲国家表示，尽管美国退出了与经合组织(OECD)为实施国际商定版本而进行的谈判，但它们仍将实施数字税。\n亚马逊的一位发言人表示：“与许多其他公司一样，我们鼓励政府在经合组织层面寻求就数字经济征税达成一项全球协议，而不是单边征税，这样各国的规则就会一致，对企业来说也会更明确、更公平。”\n谷歌英国去年的收入为16亿英镑，高于去年的12亿英镑，但只缴纳了4400万英镑的英国公司税。", "note_en": "Amazon will not have to pay the  UK’s new digital services tax on products it sells directly to consumers but small traders who sell products on its site will face increased charges.\n The tax, which aims to get tech companies such as Amazon, Google and Facebook to pay more tax in the UK, is forecast to eventually bring in about  £500m annually to the exchequer.\n Amazon has already stated that the 2% tax on revenues made in the UK will be  passed on to sellers but it will not be adding the charge to the cost of advertising on its platform.\n According to  a report in the Times, Amazon, which  paid only £14.4m in corporation tax on total UK revenues of £13.7bn last year, will not have to pay the tax on goods it sells directly.\n The new tax is not being levied on sales, which would also penalise online retailers such as Tesco and John Lewis, but on the service fees that companies such as Amazon and  Google charge third parties.\n With Amazon’s third-party sellers facing a 2% rise in the amount they pay, the US retailer is effectively getting a price advantage on competing goods it sells directly to consumers.\n “This seems to me to be absolutely outrageous,” said Lord Leigh of Hurley, the Conservative peer and former party treasurer, in the House of Lords. “It is clear that the UK government is not taxing  Amazon properly and is allowing it to avoid tax on its own sales through the marketplace.”\n Last month, Google told its tens of thousands of advertising clients in the UK that from November it will charge an additional fee for ads served on Google and YouTube  to cover the new 2% UK tax. The move is estimated to add about £120m annually on to marketers’ costs.\n  In June, the UK and other European countries said they would still implement a digital tax despite the US pulling out of negotiations with the OECD to implement an internationally agreed version.\n A spokesman for Amazon said: “Like many others, we have encouraged the government to pursue a global agreement on the taxation of the digital economy at OECD level rather than unilateral taxes, so that rules would be consistent across countries and clearer and fairer for businesses.”\n Google UK reported £1.6bn in revenues last year, up from £1.2bn, but paid only £44m in UK corporation tax.", "posttime": "2020-10-16 02:14:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,amazon,亚马逊,英国,escape", "title": "亚马逊将逃脱英国数字服务税，这将打击较小的交易商", "title_en": "Amazon To Escape UK Digital Services Tax That Will Hit Smaller Traders", "transed": 1, "url": "https://www.theguardian.com/technology/2020/oct/14/amazon-to-escape-uk-digital-services-tax-that-will-hit-smaller-traders", "via": "", "real_tags": ["交易", "amazon", "亚马逊", "英国", "escape"]}, {"category": "", "categoryclass": "", "imagename": "6e554fa84199a90c2d5d047c4dbcc509.png", "infoid": 1029077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我们已经投资于构建有用和安全的产品，您可以使用这些产品与您生活中的人进行交流和保持联系。本月，我们推出了Google Workspace，其中包括你需要的一切-Gmail、日历、驱动器、聊天、会议等-现在可以在一个地方完成任何事情。Google Workspace对我们所有的商业客户都是开放的，明年我们也会把它带给其他所有人。\n今天，我们将分享这一变化对Hangout用户意味着什么的最新消息，包括那些通过Google Fi和Google Voice使用Hangout的用户。我们提供了未来从Hangout升级到Chat的详细信息。\n明年，聊天将成为一项免费服务-无论是在Gmail的集成体验中，还是在聊天独立应用程序中都是如此。聊天包括熟悉的Hangout功能，如直接和群发消息，以及有用的附加功能，如发送到收件箱、更快的搜索、表情符号反应和建议回复。通过聊天，您可以更轻松地与他人规划目标和相似的兴趣，共享文件并进行协作，并分配任务以帮助每个人保持一致。此外，Chat的功能与我们在Gmail中构建的强大网络钓鱼防护功能相同，因此如果通过Chat向您发送链接，系统会对照安全浏览的实时数据进行检查，如果发现是恶意的，则会进行标记。\n从2021年上半年开始，每个人都可以开始从闲聊升级到聊天。为确保平稳过渡，我们将帮助您自动迁移Hangout对话以及联系人和保存的历史记录。我们将分享更具体的指导，告诉您在开始过渡过程时可以采取哪些步骤。", "note_en": "Over the past few years, we’ve invested in building helpful and secure products you can use to communicate and stay connected with the people in your life. This month, we unveiled  Google Workspace, which includes everything you need—Gmail, Calendar, Drive, Chat, Meet and more—to get anything done, now in one place. Google Workspace is generally available to all our business customers and next year we’ll bring it to everyone else, too.\n  Today we’re sharing an update on what this change means for Hangouts users, including those who use Hangouts with Google Fi and Google Voice. And we’re providing details about the future upgrade from Hangouts to Chat.\n  Next year, Chat will become available as a free service—both in the integrated experience in Gmail and the Chat standalone app. Chat includes familiar Hangouts features like direct and group messaging, with helpful additions like send to inbox, faster search, emoji reactions and suggested replies. With Chat, you can more easily plan with others on goals and similar interests, share and collaborate on files, and assign tasks to help keep everyone on the same page. In addition, Chat features the same strong phishing protections we built in Gmail, so if a link is sent to you via Chat, it will be checked against real-time data from  Safe Browsing and flagged if it’s found to be malicious.\n  Starting in the first half of 2021, everyone can begin upgrading from Hangouts to Chat. To ensure a smooth transition, we will help automatically migrate your Hangouts conversations, along with contacts and saved history. We&#39;ll share more specific guidance on what steps you can take when we begin the transition process.", "posttime": "2020-10-16 02:13:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,程序,免费,服务", "title": "谷歌表示，聊天将于明年作为一项免费服务提供，既可以作为独立的应用程序，也可以集成到Gmail中；谷歌将在Hangout中删除对Fi的支持", "title_en": "Google says Chat will be available as a free service next year, both as a standalone app and integrated into Gmail; Google will remove Fi support in Hangouts", "transed": 1, "url": "https://blog.google/products/workspace/latest-google-hangouts-and-upgrade-google-chat/", "via": "", "real_tags": ["google", "谷歌", "程序", "免费", "服务"]}, {"category": "", "categoryclass": "", "imagename": "af0d77d13d2e6882857c56af5f90b091.jpg", "infoid": 1029076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从Crisp在2015年推出以来，我们将Crisp Chatbox设计为功能齐全，同时又不影响重量。我们反复尝试确保我们的Chatbox脚本(我们的每个用户网站访问者加载的)不会减慢我们的用户网站的速度，并以尽可能快的速度弹出视图。\n考虑到性能，我们已经至少减少了对供给库的依赖，并通过使用uglify和cssmin对生产资产进行后处理来最小化所有生产资产。后来，我们甚至将我们的字体文件(Noto Sans)分成了每个字母表的子文件，这将通常加载的字体文件大小从150KB降到了10KB-如果你会说拉丁语，为什么需要加载西里尔文字体字形呢？\n我们达到了市场上最轻的Chatbox，压缩大小为232KB(满载)，而其他Chatbox提供商通常会加载高达1兆字节(！！)。\n通过这篇快速文章，您将了解哪家公司提供最快的网站实时聊天解决方案。\n因此，我们接受了这样一个事实，即我们不能对其进行更多的优化。这是本周之前的事了。\n就用户体验而言，速度很重要，因为您的聊天小部件加载得越快，与网站访问者或客户互动的机会就越快。\n另一方面，加载速度是谷歌和其他搜索引擎众所周知的排名因素。\n在我们深入到我们如何优化Chatbox以使其更轻更快的技术解释之前，这里是我们的Chatbox与其他提供商的比较(应用了所有优化)。\n这就是为什么我们比较了不同的实时聊天软件，向你展示它们在加载速度方面的表现。\n我们分析了以下测量图表：Chatbox字节大小、加载时间、HTTP请求数、解析的DNS主机名和CDN服务器延迟。\n我们从欧盟通过光纤互联网和一个良好的WiFi接入点进行了这些比较。我们假设其他提供商在CDN上运行，并在欧盟内有一个存在点，以便将延迟保持在我们测量的最佳水平。使用的测试浏览器是Firefox82，它支持所有最新的优化和Web技术，例如HTTP/3。浏览器缓存在每次测试之前都会被清除。\nChatbox的大小越大，在速度较慢的网络上加载所需的时间就越长。越小越好。\n如何衡量：这个co是在打开实时聊天(点击按钮)后，通过欧盟的WiFi热点，通过汇总所有加载的资产从Firefox获得的。我们确保隔离特定于网站的资产，如操作员头像，因为它们的大小在不同网站之间差别很大，因此在此测量中不相关。另外，请注意，这些都是压缩大小，根据Chatbox提供商的不同，可以通过Gzip或Brotli(Brotli比Gzip好，通常高出10%)。\n加载Chatbox按钮的时间取决于许多因素，例如Chatbox字节大小、服务器延迟以及Chatbox在准备就绪之前加载的依赖项数量。越低越好。\n衡量方式：这一比较是从欧盟WiFi热点上的火狐(Firefox)获得的，方法是将Chatbox按钮首次显示在屏幕上所需的所有资源的所有顺序加载时间相加。在多个资源可以作为阻塞组的一部分并行加载的情况下，采用最大加载时间(为了反映实际)。\n会发出多个HTTP请求来加载Chatbox所需的所有资源，加载其用户设置，并建立实时消息传递通道。更多的HTTP请求可能会导致等待网络的时间更长，尽管这种测量对当今使用现代HTTP/2和HTTP/3协议的性能影响较小，这两种协议都将请求流水线传输到相同的重用连接上。(通常)越低越好。\n衡量方式：通过计算聊天按钮出现之前发送的所有HTTP请求，以及聊天按钮出现后发送的所有HTTP请求，从欧盟WiFi热点上的Firefox获得了这一比较，这是Chatbox服务(如操作员头像和WebSocket)所必需的。\nChatbox脚本可能需要访问不同子域(主机名)上的资源。主机名越多，DNS解析查询就越多，等待答案所花费的时间也就越多。这还可以防止在单个主机名上高效地流水线传输HTTP请求，因此需要协商不同的安全通道，从而导致将更多的CPU时间花费在硬加密工作上(假设使用HTTPS，这是2020年的标准)。越低越好。\n如何衡量：这个比较是通过欧盟WiFi热点上的Firefox获得的，列出了所有不同的解析主机名，以便Chatbox按钮和头像可以出现在屏幕上，并建立了WebSocket连接。\nCDN服务器的延迟是影响加载时间的关键。延迟是网络请求流向Chatbox服务器，然后返回第一个应答字节所需时间的基本度量。高延迟，加上大量HTTP请求，将导致极高的加载时间(因为需要多次往返)。越低越好。\n测量方法：此比较是从位于法国的一台服务器上的有线光纤连接获得的，该服务器已就其到互联网主干的低而稳定的延迟(通常为5ms)进行了测试，因此反映了一个人在理想条件下可以获得的来自欧盟的实际最小延迟。\n重要提示：此比较是在2020年10月写成的。自那以后，这里显示的数据可能发生了变化，因为其他Chatbox提供商可能已经推出了Chatbox的更新，这可能会使其变得更轻或更重。\n下面是我们进一步优化Chatbox的动机背后的背景故事：Crisp团队两周前来到了一年一度的远程务虚会。我们降落在一个偏僻的小岛上，来到了一座乡下的大房子里。房子设备齐全，有高速光纤互联网。不幸的是，由于厚厚的墙壁，这座房子的WiFi接收效果很差。糟糕的WiFi意味着更高的数据包丢失率，无论座机连接有多好。\n在轻度分组丢失的情况下，TCP带宽会显著降低，因为TCP算法倾向于降低每个丢失分组的带宽窗口，以调整到传输信道的最大限制带宽(这里：WiFi)。这会影响HTTP和一般Web浏览体验(HTTP在TCP上运行)。\n更糟糕的是，由于使用UDP的DNS不保证交付，也不重新传输丢失的数据，因此许多DNS查询从未得到响应。DNS失败意味着我们的Web浏览器经常无法解析主机名，最常见的是网站加载的第三方脚本，这些脚本解析了大量的主机名。\n据我们所知，Crisp Chatbox也受到了这个糟糕网络的影响。我们可以通过优化Chatbox运行方式中的某些因素来解决这个问题吗？让我想想。\n我们的技术团队花了数天时间调查是否有进一步实时聊天优化的机会，并反复在多个级别测试几个想法，并在进行最终实现之前检查对捆绑包大小和速度的任何影响。\n通过简化SVG的矢量路径，使用svgo可以将SVG的总大小减少50%，svgo也有一个很好的GUI可用(它们在主CSS中内联为base64)；\n播放声音时，例如。可以将接收到的消息重新编码为较低的比特率(取决于它们的编解码器，即AAC、MP3或Vorbis)，以达到使用高质量耳机的典型人耳不会察觉到太多质量差异的最低限度。对我们来说幸运的是，人的耳朵听力很差，所以我们可以欺骗他们降低音质；\n在我们针对所有现代浏览器的现代CSS构建中(它们仍然包含在我们的遗留样式表构建中)，可以禁用所有遗留浏览器(2017年前)的免费CSS属性；\nWoff字体可以从我们现代的CSS版本中移除，只保留WOFF2(由于特定于字母的Unicode范围规则，这些规则重复了数百次)；\n一些资源提示&#34；dns-prefetch&#34；和&#34；preconnect&#34；可以被删除，以避免不必要的DNS查询和TCP&amp；密码握手，当Chatbox关闭时，通常有1%的人看到它的域；\n设置主机名#34；settings.crisp.chat&#34；可以合并到子路径上的资产主机名#34；client.crisp.chat&#34；，这将节省1次DNS查询、1次TCP握手和1次密码协商，并允许重复使用已经打开的HTTP/2连接来加载Chatbox设置；\n某些CSS规则&#34；可见性：隐藏；&#34；可以调整为&#34；显示：无；&#34；以防止99%的Chatbox用户在屏幕上未显示时加载字体，从而节省20KB的数据和2个HTTP请求；\n通过我们的散列后处理器，可以进一步减少CSS类名，它接受人类可读的CSS类名，如&#34；.crisp-client-tainer&#34；，并将它们修改为散列类名，如&#34；.cc-2da1&#34；；\n内部的JavaScript属性和函数名可以通过uglify按类进行破坏，这将转换为例如。&#34；this.__LONG_PROPERTY_NAME&#34；到例如。&#34；this.Wr_&#34；(这节省了大量字节)；\n供应商提供的库应该用特殊的优化来构建，以删除未使用的代码，例如，我们用来建立到服务器的RTM消息传递连接的Socket.IO包含一个遗留的HTTP长轮询连接方法-这是相当繁重的！-尽管我们只需要在今天的现代浏览器中使用WebSocket连接方法；\n我们的Content Delivery Network以压缩格式提供所有脚本和样式表，优先使用Brotli压缩算法，并在浏览器不支持Gzip的情况下后退到Gzip。Brotli在减少资源大小方面比Gzip做得更好，并且正在成为当今的标准。\n我们在优化工作前后测量了所有核心Chatbox资产(脚本、样式表)的Brotli压缩大小：\n那可是一次不错的总减重啊！这并不包括加载的所有其他较小的资源，这些资源加起来总共减少了30%的大小。\n此外，我们还希望确保我们的包大小不会因为微小的代码更改而随着时间的推移而变得更大。因此，我们在生产构建结束时实现了一项检查，将生成的构建大小与预先配置的大小基线进行比较。跨过阈值意味着构建会被拒绝，并且不会部署到生产环境中，从而出错并提醒开发人员。\n➡️：是的，这是文章封面图片上的协和。当我们想到速度和重量时，它立刻浮现在我们的脑海中。太糟糕了，它不见了！", "note_en": "Since Crisp started in 2015, we designed the Crisp Chatbox to be full-featured, without compromising on lightweightness. We iterated on ensuring that our chatbox script, which every of our users website visitor load, would not slow down our users websites, and pop into view as quick as possible.\n With performance in mind, we already  reduced at a minimum our dependance on vendored libraries and  minified all of our production assets by post-processing them through  uglify and  cssmin. Later, we even split our font file (Noto Sans) into  sub-files for each alphabet, which smashed the typically-loaded font file size from 150KB down to 10KB —  if you speak a Latin language, why the hell would you need to load Cyrillic font glyphs?\n We got to a point where  we had the lightest chatbox on the market, with a  compressed size of  232KB (full load), where other chatbox providers would often load up to a megabyte (!!).\n Through this quick article, you&#39;ll understand which company offers the  fastest live chat solution for website.\n Hence, we got comfortable with the fact that we could not optimize it more.  That&#39;s until this week.\n  In terms of user experience, speed matter because  the faster your chat widget loads, the faster the chance to engage with your website visitor or your customer.\n  On the other hand,  loading speed is a well known  ranking factor for Google and other search engines.\n  Before we dive into the technical explanations of how we optimized our chatbox as to make it lighter and faster, here is a comparison of our chatbox versus other providers (with all the optimizations applied).\n That&#39;s why we&#39;ve  compared different live chat software to show you how they behave in terms of loading speed.\n We have crunched charts for the following measurements:  byte size of chatbox,  time to load,  number of HTTP requests,  DNS hostnames resolved and  latency to CDN servers.\n We are performing those comparisons  from the EU, over  fiber Internet and a  good WiFi access point. We assume that other providers run on a CDN, with a point of presence within the European Union as to keep latency to an optimum level for our measurements. The test browser used is  Firefox 82, which has support for all the latest optimizations and Web technologies, such as  HTTP/3. The browser cache gets purged before every test.\n     The larger the size of the chatbox, the longer it will take to load on slower network.  Smaller is better.\n  How this was measured: this co was acquired from Firefox over a WiFi hotspot in the EU, by summing all loaded assets, after opening the live chat (clicking on the button). We made sure to isolate website-specific assets such as operator avatars, as their size vary quite a bit between websites, and thus are not relevant in this measurement. Also, note that those are compressed sizes, either via Gzip or Brotli depending on the chatbox provider (Brotli is better than Gzip, usually by 10%).\n  The time to load the chatbox button depends on a number of factors such as chatbox byte size, server latency, and the number of dependencies the chatbox loads before it is ready.  Lower is better.\n  How this was measured: this comparison was acquired from Firefox over a WiFi hotspot in the EU, by summing all sequential loading times for all resources needed for the chatbox button to be first shown on screen. In the case multiple resources could be loaded in parallel as part of a blocking group, the maximum loading time is taken (in order to reflect the reality).\n  A number of HTTP requests are made to load all required resources for the chatbox, load its user settings and establish a Real-Time messaging channel. More HTTP requests may result in more time spend waiting for the network, though this measurement has less impact on performance today with modern HTTP/2 and HTTP/3 protocols, which both pipeline requests over the same re-used connection.  Lower is (usually) better.\n  How this was measured: this comparison was acquired from Firefox over a WiFi hotspot in the EU, by counting all HTTP requests sent before the chat button appeared, as well as all HTTP requests sent after the button appeared, necessary for chatbox service such as operator avatars and WebSocket.\n  A chatbox script may require to access resources on different subdomains (hostnames). More hostnames result in more DNS resolution queries, which incur more time spent waiting for an answer. This also prevents pipelining HTTP requests efficiently over a single hostname, and thus requires different secure channels to be negotiated, inducing more CPU time spent on hard cryptographic work (assuming HTTPS is used, which is the norm as of 2020).  Lower is better.\n  How this was measured: this comparison was acquired from Firefox over a WiFi hotspot in the EU, by listing all distinct hostnames resolved so that the chatbox button and avatars could appear on screen, and a WebSocket connection was established.\n  The latency to CDN servers is key to loading time. Latency is a basic measurement of the time it takes for a network request to flow to the chatbox servers, and then come back with the first answer byte. A high latency, coupled with a lot of HTTP requests, will result in incredibly high loading times (as multiple roundtrips are required).  Lower is (much) better.\n  How this was measured: this comparison was acquired from a wired fiber connection on a server located in France, which has been tested for its low and stable latency to Internet backbones (typically 5ms), hence reflecting the real minimum latency from the EU one can get in ideal conditions.\n Important note: this comparison was written as of October 2020. Data shown here might have changed since then, as other chatbox providers may have rolled out updates of their chatbox which could make it lighter, or heavier.\n   Here&#39;s the background story behind our motive to optimize even further the chatbox: the Crisp team arrived into its annual remote retreat 2 weeks ago. We landed on a remote island, and arrived into a large countryside house. The house is well-equiped, with fast fiber Internet. Unfortunately, the house had poor WiFi reception due to thick walls. Poor WiFi means elevated packet loss, no matter how good the landline connection is.\n Under light packet loss,  TCP bandwidth gets dramatically reduced, as the TCP algorithm tends to lower its bandwidth window for each lost packet as to adjust to the maximum limiting bandwidth of the transmission channel (here: WiFi).  This impacts HTTP and general Web browsing experience (HTTP runs on TCP).\n Worse,  a lot of DNS queries were never answered, due to DNS using UDP, which does not guarantee delivery and does not retransmit lost data. Failing DNS means that our Web browsers often fail to resolve hostnames, most often for third party scripts that websites load, which resolve  a lot of hostnames.\n To our realization, the Crisp chatbox was also impacted by this poor network. Could we fix that by optimizing certain factors in the way our chatbox runs?  Let&#39;s see.\n   Our technical team spent days investigating for any opening to further live chat optimization, and iterating on testing several ideas at multiple levels, and checking for any impact on bundle size and speed before working on a final implementation.\n  SVGs size could be reduced by 50% total, by simplifying their vector paths, using  svgo, which also has a nice  GUI available (those are inlined as Base64 in the main CSS);\n Sounds played when eg. receiving a message could be  re-encoded to a lower bitrate (depending on their codec, namely AAC, MP3 or Vorbis), to get to the lowest limit where the typical human ear would not perceive that much of a quality difference using good-quality headphones. Luckily for us, human ears are quite bad at hearing, so we can trick them lowering sound quality;\n Vendored CSS properties for all legacy browsers (pre-2017) could be disabled in our modern CSS build targeting all modern browsers (they are still included in our legacy stylesheet build);\n WOFF fonts could be removed from our modern CSS build, keeping WOFF2 only (those rules were repeated hundreds of time due to alphabet-specific unicode range rules);\n Some resource hints &#34; dns-prefetch&#34; and &#34; preconnect&#34; could be removed to  avoid unnecessary DNS queries and TCP &amp; crypto handshakes, to domains typically used by 1% of the people that see the chatbox when it is closed;\n The settings hostname &#34; settings.crisp.chat&#34; could be merged to the assets hostname &#34; client.crisp.chat&#34; on a sub-path, which would save 1 DNS query, 1 TCP handshake and 1 crypto negotiation, and allowed re-use of the already-open HTTP/2 connection to load the chatbox settings;\n Some CSS rules &#34; visibility: hidden;&#34; could be tuned to &#34; display: none;&#34; to  prevent fonts from being loaded when not shown in screen for 99% of chatbox users, saving 20KB of data, and 2 HTTP requests;\n CSS class names could be reduced even more,  via our hashing post-processor which takes in our human-readable CSS class names such as &#34;.crisp-client-container&#34;, and  mangle them to hashed class names such as &#34;.cc-2da1&#34;;\n JavaScript properties and function names that are internal could be  mangled per-class via  uglify, which would transform eg. &#34; this.__long_property_name&#34; to eg. &#34; this.Wr_&#34; (this saved  a lot of bytes);\n Vendored libraries should be built with special optimizations as to remove unused code, for instance  Socket.IO which we use to establish a RTM messaging connection to our servers contains a legacy HTTP long-polling connection method —  that is quite heavy! — though we only need to use the WebSocket connection method with today&#39;s modern browsers;\n   Our Content Delivery Network serves all scripts and stylesheets in a compressed format, using the Brotli compression algorithm in priority, and falls back to Gzip in the event the browser does not support it. Brotli is better at reducing resource size than Gzip is, and is becoming the norm nowadays.\n We measured the Brotli-compressed size of all core chatbox assets (scripts, stylesheets) before and after our optimization work:\n  That&#39;s a nice total reduction in weight! This does not account for all other smaller resources that get loaded, which  all add up to a reduction in size of 30%.\n As well, we wanted to make sure that our bundle size would not grow bigger over time due to minor code changes. Thus, we implemented a check at the end of our production build, which compares the resulting build size with pre-configured size baselines. Stepping over a threshold means that the build gets rejected and not deployed to production, erroring out and alerting the developer.\n  ➡️ Yes, that&#39;s a  Concorde on the article cover picture. It immediately came to our mind when we thought of speed and lightweightness. Too bad it&#39;s gone!", "posttime": "2020-10-16 01:51:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "优化,optimization,chatbox", "title": "40KB的优化为我们节省了50TB的带宽", "title_en": "A 40KB Optimization Saved Us 50TB of Bandwidth", "transed": 1, "url": "https://crisp.chat/blog/fastest-live-chat/", "via": "", "real_tags": ["优化", "chatbox"]}, {"category": "", "categoryclass": "", "imagename": "a9745e3abfb69dabe4f3171e635899d5.jpg", "infoid": 1029075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "David Lyford-Smith是解决电子表格谜团的专家。有一次，在以前的工作中，他收到了一张工资单，让他去寻找新的起跑者。它在一个随机的盒子里有数字40,335，工资单不清楚为什么会有这个数字。“因此，他们认为这是员工的加盟奖金，并起草了一份工资单草案，奖金为40335 GB，”他说。但是，当涉及到电子表格时，假设可能代价高昂。\n莱福德-史密斯不仅仅是一个电子表格发烧友。他是英格兰和威尔士特许会计师协会(ICAEW)的技术经理，负责管理其Excel社区小组-因此，他一直对这个范围内的数字持怀疑态度。“这就是Excel将日期存储为序列号的方式，”他说。他是对的：这不是一笔丰厚的签约奖金，而是新员工的开始日期。\nLyford-Smith是会计师、审计师和Excel高级用户社区的一部分，他们联合起来与导致数据大屠杀的不合逻辑的公式、复制和粘贴错误以及结构混乱进行了一场安静的斗争。\n上周，当政府承认一个简单的数据处理错误阻碍了接触者追踪工作时，它自己也陷入了电子表格噩梦。他们不是第一个遭受Excel诅咒的人，也不会是最后一个。去年，加拿大大麻种植者Canopy Growth在错误地公布了4000万GB的亏损后，不得不纠正其季度收益-实际数字是8800万GB，由于公式错误而计算错误。该公司股价下跌2%。波音公司在一个隐藏的电子表格列中泄露了员工的个人数据。投行对特斯拉收购Solar City的分析在电子表格中重复计算债务后，将该公司估值低估了4亿美元。这些可能是非常严重的错误，但它们并不少见。\n研究表明，超过90%的电子表格存在错误，大型企业使用的电子表格模型有一半存在“实质性缺陷”。鉴于全球约有7.5亿人使用Excel，有很多错误需要注意。一位著名的研究人员将电子表格称为企业IT的暗物质。这就是为什么像Lyford-Smith这样的人成为电子表格的捍卫者，通过纠正其他人的错误来降低风险。\n他们是一群有组织的人，这对电子表格专家来说可能并不令人惊讶。欧洲电子表格风险利益集团(EUSpRig)每年举办一次会议，收集研究报告(今年取消，转而举办网络研讨会系列)，整理其网站上的最佳实践、培训材料和恐怖故事-还有一个雅虎小组邮件列表，成员在那里提供提示和诀窍，分享资源链接，并挑选媒体对接触者追踪失败的报道。简而言之，他们找不出真正的问题是什么，因为报道是如此脱节和不清楚。一个流行的分享是YouTube上一个讽刺电子表格新闻网的剪辑，来自单口相声数学的马特·帕克(Matt Parker)-正如一位成员所发的那样，它“让我一天都很开心”。\n尽管有如此广泛的资源和经常成为头条新闻的失误，但这一活动大多是在没有事先通知的情况下进行的。EUSpRig董事长帕特里克·奥贝恩(Patrick O‘Beirne)表示，许多公司无视他们的警告，“因为他们认为这不会发生在他们身上。”“这与网络安全是一样的。没有人料到会受到网络钓鱼攻击。“。\n防范公司混乱的电子表格捍卫者来自各种背景，但许多人都是从会计和审计开始的，这些职业大量使用Excel。这类工作在两个环境中尤其常见：金融和保险巨头的内部，他们对风险管理有监管要求，以及咨询公司和会计师事务所。\nLyford-Smith的会计职业生涯始于一名审计师，在此过程中学习了电子表格技能，并培训了需要帮助的同事。“很明显，我们需要额外的关注，”他说。Lyford-Smith现在ICAEW工作，在他的最后一个职位上，他在BDO会计师事务所担任高级Excel从业者，他的电子邮件地址就是excel@。\n这是其他电子表格捍卫者遵循的相似道路：他们从编程或审计开始，通过自学而擅长Excel，然后开始看到我们其他人没有注意到的问题。希兰·德·席尔瓦(Hiran De Silva)是大公司的顾问，用电子表格建造系统，合同金额高达6位数。迪恩·巴克纳曾在金融服务管理局工作。阿德里安·米里克(Adrian Miric)是南非审计署(AuditExcel)的一名特许会计师，他在毕马威(KPMG)工作，设计和审计电子表格，并提供培训。在从事基础设施和金融建模工作后，肯尼·怀特劳-琼斯(Kenny Whitelaw-Jones)创立了咨询公司Gridline。\n他们的客户是大银行、监管者和跨国公司，他们不会觉得有人突然出现来批评他们的公式是一件令人愉快的事情。但莱福德-史密斯表示，在他的职业生涯中，公司通常都能很好地接受批评，并很高兴得到帮助。“几乎所有使用Excel的人都是自学的，”他说。“我认为他们意识到，通常有更好的方法来做到这一点。”在会计界之外，他认为电子表格没有得到应有的重视。“他们不被认为是严肃或适当的，”他说。\n当然，那些了解哪里可能出错的人对这些审计师所做的电子表格检查有很高的要求。怀特劳-琼斯说：“人们会付钱给我们，因为他们会说，‘天哪，我们要建造这个价值100万美元的东西，我们最好确保数字是正确的。’”\n当他们在代价高昂之前发现潜在代价高昂的错误时，情况尤其如此。巴克纳审计了一家大型银行为管理复杂的衍生品解决方案而制作的电子表格，发现收入模型计算利息的方式存在缺陷。巴克纳说：“如果这种情况继续下去，可能会让他们损失数亿美元。”“他们大吃一惊，因为有人可以走进来，看一看代码，就能看到那个错误。”\n问题是，当发现有缺陷或潜在风险的电子表格时，高管们会看到错误的二分法。他们倾向于相信他们可以继续按原样使用电子表格，或者升级到正式的定制软件解决方案，这将是昂贵的。但还有另一种方法：降低电子表格的风险。他说：“他们应该考虑他们能控制得多好，以及我们应该实施什么控制措施。”\n检查每个电子表格的过程是独一无二的。加的夫大都会大学计算讲师、EUSPRig成员西蒙·索恩(Simon Thorne)表示，有软件和工具可以寻找不一致的公式或结构问题，但仍然需要人工干预，因为这样的工具无法发现逻辑问题。\n这项工作的部分挑战是，电子表格捍卫者不仅必须是Excel专家，而且必须了解他们所在的行业。索恩说，除了编程错误和打字错误之外，还有逻辑上的错误-也许产品的成本而不是收入被计算在内。“逻辑在某种程度上是有缺陷的，它们(错误)很难被发现，因为你必须是领域专家才能理解这在某种情况下是错误的选择。”\n为了审计复杂的电子表格，Miric使用软件逐行查找错误，以及持续使用可能会突然出现的错误。一项基本的测试是改变输入，看看输出是否如预期的那样反应，也许会放入极高的数字或随机字母。简而言之，这意味着这项工作可以归结为花一整天的时间阅读电子表格。莱福德-史密斯说：“我会试着看一看，看看在没有人告诉我的情况下，我是否能理解它是如何工作的。”“通常，答案是否定的。”\n这是这项工作的一个共同主题：即使是制作电子表格的人也不总是能解释其中发生了什么。巴克纳首先询问正在使用什么数据-他说，令人不安的客户数量无法回答这个问题-并希望了解这些数据是从哪里拉进来的。一旦他列出了进入的数据源，然后试图了解数据输出将如何使用。在一个例子中，一个团队没有意识到他们的电子表格被用作公司链条更下游的另一个团队的数据源，于是更改了其中的值。这改变了另一个团队的产量数据。他说，潜在的影响可能有数亿美元。\n对于任何有预算的人来说尤其如此-如果我们自己的政府承包商将电子表格作为一种更便宜的选择，要知道资金较少的国家也同样依赖电子表格。米里克指出，对于他的一些非洲客户来说，定制软件根本不是一个选择。他说：“结果，电子表格几乎成了默认--尤其是在政府内部。”\n归根结底，问题不在于电子表格，而在于人。莱福德-史密斯说，像联系人追踪混乱这样的恐怖故事往往会引发对Excel的强烈反对。“但是Excel是普遍可用的，而且非常容易获得，”他说。“人们会继续使用它，通常问题不是系统问题，而是管理或风险问题。”在我们的Excel做得更好之前，我们需要人们保护这个世界不再依赖于设计不佳的电子表格。\n🎞️YouTube正在使用人工智能将过去重现生机。历史学家不高兴。\n🔊收听每周五播出的“科学、技术和文化周”连线播客。\n收看“连线日报”，这是关于科技、商业和科学领域所有重大新闻的严肃简报。在每个工作日英国时间下午12点的收件箱里。\n谢谢。您已经成功订阅了我们的时事通讯。你很快就会收到我们的回音。", "note_en": "David Lyford-Smith is an expert at solving spreadsheet mysteries. Once, in a previous job, he was sent a payroll form to look over for a new starter. It had the number 40,335 in a random box, and payroll wasn’t clear why it was there. “So they assumed it was a joining bonus for the employee and drew up a draft pay slip with a £40,335 bonus,” he says. But, when it comes to spreadsheets, assumptions can be costly.\n Lyford-Smith isn’t just a spreadsheet enthusiast. He’s the technical manager for the Institute of Chartered Accountants in England and Wales (ICAEW), running its Excel community group — and as such has always been suspicious of numbers in that range. “That’s how Excel stores dates, as serial numbers,” he says. He was right: that wasn’t a generous signing bonus, but the new hire’s starting date.\n  Lyford-Smith is part of a community of accountants, auditors and Excel power users who have joined forces in a quiet battle against illogical formulas, copy-and-paste errors, and structural chaos that cause data carnage.\n Last week, the government stumbled into its own spreadsheet nightmare when it admitted contact-tracing efforts were stymied by a simple data processing mistake. They’re not the first to fall victim to the curse of Excel – and they won’t be the last either. Last year, Canadian marijuana grower Canopy Growth  had to correct its quarterly earnings after incorrectly posting a £40 million loss — the real figure was £88m, miscalculated by a formula error. The company’s stock fell two per cent.  Boeing leaked employees’ personal data in a hidden spreadsheet column. An investment bank analysis of Tesla’s purchase of Solar City undervalued the company by $400m after  double counting its debt in a spreadsheet. These may be egregious errors, but they are hardly uncommon.\n  Research suggests  more than 90 per cent of spreadsheets have errors, and half of spreadsheet models used in large businesses have  “material defects”. Given some 750 million people use Excel globally, there are plenty of errors needing attention. One prominent  researcher calls spreadsheets the dark matter of corporate IT. And that’s why people like Lyford-Smith have become defenders of the spreadsheet, mitigating the risks by fixing everyone else’s mistakes.\n They’re an organised bunch, which is perhaps no surprise for spreadsheet specialists. The  European Spreadsheet Risks Interest Group (EUSpRig) runs an annual conference to gather research (cancelled this year in favour of a webinar series), and collates best practice, training materials, and horror stories on its website — and there’s also a Yahoo Groups mailing list, where members offer tips and tricks, share links to resources and pick apart press coverage of the contact tracing debacle. In short, they can’t figure out what the real problem was because the reporting is so disjointed and unclear. One popular share was a YouTube clip of a satirical  Spreadsheet News Network from Matt Parker of Stand-up Maths — as one member posted, it “made my day”.\n  Despite such extensive resources and the regular missteps that make headlines, this activity mostly goes without notice. Many companies disregard their warnings, “because they don’t think it’ll happen to them,” says Patrick O’Beirne, chairman of EUSpRig. “It’s the same as cybersecurity. Nobody expects to be hit by a phishing attack.”\n The spreadsheet defenders who guard against corporate chaos come from myriad backgrounds, but many get their start in accountancy and auditing — professions that make heavy use of Excel. Such work is particularly common in two settings: in-house at financial and insurance giants, who have regulatory requirements around risk management, as well as consultancies and accounting firms.\n Lyford-Smith started his accountancy career as an auditor, picking up spreadsheet skills along the way and training colleagues who needed help. “And there was very clearly a need for extra attention,” he says. Lyford-Smith now works for ICAEW, in his last role held the job title senior Excel practitioner for accounting firm BDO, where his email handle was just  excel@.\n  That’s a similar path followed by other spreadsheet defenders: they started in programming or auditing, got good at Excel by teaching themselves, and then started to see the problems the rest of us miss. Hiran De Silva was a consultant to big firms, working six-figure contracts to build systems with spreadsheets. Dean Buckner once worked for the Financial Services Authority. Adrian Miric a chartered accountant working for South Africa’s AuditExcel, where he designs and audits spreadsheets and offers training, cut his teeth at KPMG. After a career in infrastructure and financial modelling, Kenny Whitelaw-Jones founded consultancy Gridlines.\n  Their clients are big banks, regulators and multinational companies, who can’t find it pleasant to have someone swoop in to pick apart their formulas. But Lyford-Smith says throughout his career companies generally took criticisms well, and were happy to have the help. “Almost everybody who uses Excel is self-taught,” he says. “I think they’re aware there’s usually a better way of doing it.” Outside of the accounting world, he believes spreadsheets aren’t appreciated as much as they should be. “They aren’t seen as serious or proper,” he says.\n Of course, the spreadsheet checking done by these auditors is in high demand from those who understand what can go wrong. “People will pay us because they’re like, ‘Holy crap, we’re going to build this million dollar thing, we better make sure the numbers are right,’” says Whitelaw-Jones.\n That’s especially true when they spot potentially expensive errors before they become costly. Buckner audited a spreadsheet built by a large bank to manage complex derivatives solutions, spotting a flaw in how the revenue models calculated interest. “Had this carried on, it could have cost them hundreds of millions,” Buckner says. “They were gobsmacked that someone could walk in, look at the code and see that mistake.”\n The problem is that executives see a false dichotomy when a flawed or potentially risky spreadsheet is spotted. They tend to believe they can either continue using the spreadsheet as is or upgrade to a formal, bespoke software solution, which will be expensive. But there’s another way: mitigating the risks of the spreadsheet. “They should be thinking about how well they can control that, and what controls we should be implementing,” he says.\n  The process of examining each spreadsheet is unique. There are software and tools to look for inconsistent formulas or problems with the structure, but a human touch is still required, says Simon Thorne, a lecturer in computing at Cardiff Metropolitan University and a EUSpRig member, because logical problems can’t be picked up by such tools.\n Part of the challenge of this work is that spreadsheet defenders must not only be Excel experts but know the industry that they’re working in. Beyond programming errors and typos, there are also logical faults — perhaps the cost of a product is counted instead of its revenue, says Thorne. “The logic is flawed in some way, and they [errors] are hard to spot because you have to be a domain expert to understand that it’s the wrong choice in a scenario.”\n To audit a complex spreadsheet, Miric uses software to go line-by-line to spot errors, as well as ones that could crop up from continued use. One basic test is to change the inputs and see if the outputs react as expected, perhaps putting in extremely high figures or random letters. In short, that means this work comes down to spending entire days reading spreadsheets. “I would try and look at it and see if I could understand how it works without the person telling me,” says Lyford-Smith. “Usually, the answer would be no.”\n That’s a common theme for this work: even the people who make a spreadsheet can’t always explain what’s happening in it. Buckner begins by asking what data is being used — a disturbing number of clients can’t answer that one, he says — and looks to understand where it’s being pulled in from. Once he lists out the data sources going in, and then seeks to understand how the data outputs will be used. In one instance, a team didn’t realise their spreadsheet was used as a data source for another team further down the chain in the company, and changed a value in it. That changed the other team’s output figures. The potential impact could have been in the hundreds of millions of dollars, he says.\n That’s especially true for anyone on a budget — and if our own government contractors are turning to spreadsheets as a cheaper option, know that countries with less money are leaning on them just as much. Miric notes that bespoke software simply isn’t an option for some of his African clients. “As a result spreadsheets almost become the default – especially within governments,” he says.\n  In the end, the problem isn’t spreadsheets, but people. Lyford-Smith says horror stories such as the contact-tracing chaos tend to spark a backlash against Excel. “But Excel is universally available and very accessible,” he says. “People are going to keep using it and usually the problems aren’t systems problems, they’re management or risk problems.” Until we get better at Excel, we’ll need people to protect the world from its own dependence on poorly designed spreadsheets.\n    🎞️ YouTubers are using AI to bring the past to life.  Historians aren’t happy\n  🔊  Listen to The WIRED Podcast, the week in science, technology and culture,  delivered every Friday\n   Get WIRED Daily, your no-nonsense briefing on all the biggest stories in technology, business and science. In your inbox every weekday at 12pm UK time.\n  Thank You. You have successfully subscribed to our newsletter. You will hear from us shortly.", "posttime": "2020-10-16 01:50:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "勇士,warriors,电子表格", "title": "Excel勇士将世界从电子表格灾难中拯救出来", "title_en": "The Excel warriors saving the world from spreadsheet disaster", "transed": 1, "url": "https://www.wired.co.uk/article/spreadsheet-excel-errors", "via": "", "real_tags": ["勇士", "warriors", "电子表格"]}, {"category": "", "categoryclass": "", "imagename": "409f88aac0b41723b7400fcde05302cc.png", "infoid": 1029073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一时刻标志着多年来的创新和辛勤工作达到了顶峰。从早期设计新颖的存储和复制证据(它们是不可信赖地激励存储增长的基础)，到实现如此复杂的分散市场所需的高级系统工程，再到与Filecoin集成以使网络更加强大和可访问的令人惊叹的工具和项目生态系统-我们已经作为一个社区取得了长足的进步。\n通过一个开放的、分散的、可验证的存储层，你们共同帮助升级了网络。Filecoin网络代表了一种全新的对等存储和检索数据的方式，该方式通过密码证明进行保护，以验证数据随时间的推移是唯一存储和复制的。有了Filecoin，任何人都可以作为存储提供商参与进来，将其开放的硬盘空间货币化，并帮助存储人类最重要的信息。这为IPFS(星际文件系统)提供了重要的激励层，增强了已被数千个项目和开发人员使用的现有Web3存储基础架构。\n构建区块链就像构建软件火箭--需要一个庞大而有才华的团队才能实现。非常感谢为使Filecoin成为现实而奉献时间、想法和专业知识的每一个人。🙏。\n🔍帮助设计、分析和完善Filecoin网络和规范的来自世界各地的研究人员和专家。\n🧙‍♂️是来自IPFS、libp2p、ipld、Etherum、Web3和许多其他社区的许多开源开发人员，他们将早期的Filecoin设计转变为功能齐全的实现。\n🌐是一个庞大的全球Filecoin挖掘社区，帮助对实施进行压力测试和改进，以形成一个强大且不断增长的分散存储网络。\n📝数以百计的Filecoin存储客户端创建了工具，并将Filecoin作为其项目、应用程序和数据集的存储层进行了集成。\n🛠许多生态系统协作者通过构建面向用户的应用程序、开发人员API、钱包、托管服务、网络基础设施、区块链可视化工具等，使Filecoin网络更容易访问和更有用\n👨‍👩‍👧‍👦，整个Filecoin社区，他们多年来一直是项目使命和愿景的大使！\nFilecoin网络现已进入发射后的安静监控期，以确保网络平稳运行。在此期间，我们将密切跟踪网络性能，同时为Filecoin升空周做准备。到目前为止，网络是稳定的，社区成员报告说操作成功。🎉。\n下周，就是庆祝的时候了！和我们一起参加Filecoin启动周，这是一系列由社区策划的充满动感的演讲、研讨会和小组讨论，以庆祝Filecoin Mainnet的推出并探索该网络的未来。该活动将于2020年10月19日至23日举行。\n无论您是Filecoin专家还是刚刚入门，Liftoff都是学习、构建和探索的绝佳机会。还将有一些非常特别的嘉宾和精彩的公告，所以不要错过！你可以在这里注册参加。如果您想举办您自己的活动或庆祝活动，请今天提交您的课程。\n构建Filecoin一直是一项史诗般的探索。在为周一做准备的过程中，我们很想听听您的Filecoin故事--从您的Filecoin项目之旅的开始，到今天具有历史意义的里程碑--Mainnet升空。在过去3年中，这个社区遇到了许多新颖的挑战-从设计可高效、可伸缩地证明有效存储(SDR)的密码安全的证据系统，到建立和微调像DRAND这样的新系统-新的分布式随机性信标网络，以确保Filecoin有一个安全且有弹性的随机性来源；到在DataTerraNemo、DevCon5、Web3 Summit、Filecoin Ignite、IPFS生态产业峰会&amp；更多的活动中建立新的联系和协作；到在整个Space Race建立一个由矿工、客户和建设者组成的令人惊叹的社区。我们有那么多美好的回忆要分享--我们想听听你的！\n你有没有“啊哈！”在HackFS期间构建您的杀手级Filecoin DAPP的时刻？有没有一个太空竞赛社区冠军帮你调试那个令人恼火的错误消息，以完善你的挖掘设置？是否有人构建了一个令人惊叹的工具、功能或演示来帮助实现Filecoin的起飞？我们想听听你的故事！使用#FilecoinLiftoff❤️在推特上与我们分享您的照片和回忆。\n我喜欢从“Muneeb”开始的这趟回忆之旅。数以千计的顾问、研究人员、开发人员、开放源码软件贡献者、审计师、矿工、客户、生态系统合作伙伴以及更多人都参与了#Filecoin https://t.co/1T4SKIHc7f--您的@Filecoin故事是什么？👂Filecoin。\n-Molly(@omack28)2020年10月15日\nFilecoin项目是由充满活力和多样化的社区使之成为可能的，这些社区在这一过程中的每一步都做出了贡献。你是这个发射时刻的核心部分，我们迫不及待地想在Filecoin发射周的周一开始和你一起庆祝！", "note_en": "This moment marks the culmination of years of innovation and hard work. From the early days designing the novel proofs of storage and replication that are  fundamental to trustlessly incentivize storage growth, to the advanced systems engineering required to bring such a complex decentralized marketplace into existence, to the amazing ecosystem of tools and projects that have integrated with Filecoin to make the network more powerful and accessible — we have come   so far as a community.\n Together, you have helped  upgrade the web with an open, decentralized, verifiable storage layer. The Filecoin network represents a completely new way to store and retrieve data peer-to-peer – secured by cryptographic proofs to verify data is uniquely stored and replicated over time. With Filecoin, anyone can participate as a storage provider, monetize their open hard drive space, and help store humanity’s most important information. This provides an important incentive layer for  IPFS, the InterPlanetary File System - enhancing the existing web3 storage infrastructure already used by thousands of projects and developers.\n Building a blockchain is like building a software rocket - and it takes an immense and talented team to make it possible. Huge thank you to everyone who dedicated their time, ideas, and expertise to make Filecoin a reality. 🙏\n  🔍  The researchers and experts from around the world who helped architect, analyze, and refine the Filecoin network and specification\n 🧙‍♂️  The many open-source developers from communities like IPFS, libp2p, IPLD, Ethereum, web3, and many others who turned the early Filecoin designs into a functional, fully-featured implementation\n 🌐  The huge, global Filecoin mining community who helped stress-test and improve the implementations to form a robust and growing decentralized storage network\n 📝  The hundreds of Filecoin storage clients who have created tooling and integrations with Filecoin as the storage layer for their projects, applications, and datasets\n 🛠  The many ecosystem collaborators who make the Filecoin network more accessible and useful by building user-facing applications, developer APIs, wallets, custody services, network infrastructure, blockchain visualizers, and more\n 👨‍👩‍👧‍👦  The entire Filecoin community who have been ambassadors for the project’s mission and vision for many years!\n The Filecoin network has now entered a quiet post-launch monitoring period to ensure the network is operating smoothly. During this time, we’ll be tracking network performance closely while we prepare for Filecoin Liftoff Week. So far, the network is stable and community members are reporting successful operations. 🎉\n   Next week, it’s time to celebrate! Join us for  Filecoin Liftoff Week, an action-packed series of talks, workshops, and panels curated by the community to celebrate the Filecoin mainnet launch and explore the network’s future. The event takes place October 19-23, 2020.\n Whether you’re a Filecoin expert or just getting started, Liftoff is a great opportunity to learn, build, and explore. There will also be some very special guests and exciting announcements, so don’t miss it!You can register to attend  here. If you’d like to host your own event or celebration,  submit your session today.\n   Building Filecoin has been an epic quest. In preparation for Monday, we’d love to hear  your Filecoin stories – from the beginning of your journey with the Filecoin Project to today’s historic milestone,  Mainnet Liftoff. Over the past 3 years, this community has confronted many novel challenges – from designing a cryptographically secure proofs system that can efficiently and scalably prove useful storage ( SDR); to building and fine-tuning new systems like  drand – a new distributed randomness beacon network to ensure Filecoin has a secure and resilient source of randomness; to forming new connections and collaborations at events like  DataTerraNemo,  Devcon5,  Web3 Summit,  Filecoin Ignite,  IPFS Ecology Industry Summit &amp; more; to building an amazing community of miners, clients, and builders throughout  Space Race. We have so many great memories to share – and we want to hear yours!\n Did you have an “aha!” moment building your killer Filecoin dapp during  HackFS? Did a  Space Race community champion help you debug that infuriating error message to perfect your mining setup? Did someone build an amazing tool, feature, or demo that helped make Filecoin Liftoff possible? We want to hear your story! Share your pictures and memories with us on Twitter using  #FilecoinLiftoff ❤️\n Love this trip down memory lane from  @muneeb. It’s taken thousands of advisors, researchers, developers, OSS contributors, auditors, miners, clients, ecosystem partners, and more to reach  #FilecoinLiftoff — what’s your  @Filecoin story? 👂  https://t.co/1T4SKIHc7f\n— Molly (@momack28)  October 15, 2020\n The Filecoin Project is made possible by the vibrant and diverse community that has contributed at every step of the way. You’re a core part of this Liftoff moment, and we can’t wait to celebrate with you starting on Monday during  Filecoin Liftoff Week!", "posttime": "2020-10-16 01:50:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mainnet,filecoin", "title": "Filecoin Mainnet处于活动状态", "title_en": "Filecoin Mainnet Is Live", "transed": 1, "url": "https://filecoin.io/blog/mainnet-liftoff/", "via": "", "real_tags": ["mainnet", "filecoin"]}]