[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“今天早上的法语考试很难，我想我猜错了所有的问题。”1941年1月29日\n“我法语得了A，班上只有两个A。”1941年2月3日\n帕特里夏·海史密斯写这两篇日记时刚刚庆祝了她的20岁生日。著名心理惊悚片《火车上的陌生人》和才华横溢的瑞普利先生的未来作者是纽约巴纳德学院的一名学生，从第一学期起就开始认真地“写日记”。本系列汇集了她去世后在亚麻衣橱里发现的日记（八卦；日常）和笔记本（专注于工作；格言）的摘录。这56本日记（18本日记，38本笔记本）总计8000页。正如一篇社论指出的那样，这篇精选的文章总共有近1000页，“不应该被解读为自传……帕特的日记和笔记本记录了一段正在进行的生活。”一份非常详细的报告。第一条记录的日期是1941年1月6日，结尾是：“母亲非常怀有敌意。尤其是因为我不够女性化。”海史密斯与母亲的关系一直很不好，直到50年后母亲去世，海史密斯在1985年记录下，“如果我不存在，我母亲就不会变成半疯子。”麻烦的人际关系是作者一生的主题。她坦率地讲述了自己动荡的爱情生活。1941年4月，她在日记中说：“我的胃口是双重的：我渴望爱和思考。你知道，这两者结合起来可以带我去任何地方。我为此写了一首诗。”但就在几周后，她告诉我们：“我对自己的工作感到沮丧。我的发展不够，我经常认为这是性的。不知道。如果这四年（大学）都浪费了怎么办！浪费了！”他们当然不会浪费在文字或情人的记录上。20出头的海史密斯在享受纽约的诱惑时，每年为她的日记增加多达700页，从醉酒午餐到深夜勾搭。本系列的前一百页讲述的是一年，也就是她20岁那年。最终，她会开始在日记中写得更少，但这些早期的部分是最有价值的，为我们呈现了一幅毫无防备的肖像，一位年轻女性迈出了进入性和文学领域的第一步。我说的是“毫无防备”，但有证据表明，海史密斯一生中都在修改日记和笔记本。1942年，理查德·瓦格纳（Richard Wagner）的音乐“几乎所有的做爱都是好的”一词在1950年被添加了“多么恐怖！”到了1960年，她回顾了自己早期的作品，总结道：“我23岁，一个最不成熟、最迟钝、最以自我为中心的23岁。我所有的日记都应该扔进熔炉。”这种观念最晚出现在1992年，其目的是“挫败无所事事的好奇心”相反，当她任命德国出版商Diogenes Verlag为她的世界版权持有者时，她将自己的期刊列为自己作品的一部分。\n编辑这本非同寻常的藏书带来了巨大的挑战。海史密斯经常用多种语言写作，因此需要翻译。编辑安娜·冯·普兰塔决定按时间顺序展示日记和笔记本中的选集。脚注被要求识别有时只按首字母或昵称列出的字符。出现的是一个复杂作家的广阔肖像和一个引人注目的成长故事。\n然而…还有很多差距。她的最后一本日记始于1981年，将持续她接下来的十年，这与这位充满热情的大学生记录她的每一刻是一个很大的变化。Highsmith经常与名人和名人会面，但并不经常记录这些会面的很多情况。早在1943年4月，她就搬到了一个新的地址，“紧挨着彼得·蒙德里安，他用的是同一扇门。”这是我们听到的关于她的艺术邻居的消息。同样，在晚年，当珍妮·莫罗来访时，我们得知海史密斯正在考虑买一台传真机，“珍妮还说我应该买一台。”在这次访问中，没有出现其他情况。穆里尔·斯帕克值得一提，因为她同意照顾海史密斯的一只猫。没有提到Spark在她的小说《东河边的温室》（1973年）中讽刺了海史密斯，在这部小说中，异国情调的公主Xavier把蚕裹在胸前，就像海史密斯用胸罩走私蜗牛（她喜欢蜗牛，并将其作为宠物饲养）进出欧洲一样。然而，两位作者有一个共同点，那就是他们对写作材料的选择近乎迷信。\n“海史密斯在20出头的时候，每年给她的日记增加多达700页，同时享受纽约的诱惑，从醉酒的午餐到深夜的勾搭。”\n海史密斯一生都在使用同样的笔记本，这些笔记本来自哥伦比亚大学，而斯帕克的小说则是在爱丁堡一家书店提供的学校笔记本中手写的。亚瑟·科斯特勒获得了更多的空间，主要是因为海史密斯和他上床睡觉：“一个悲惨的、没有欢乐的插曲。”她二十几岁出头就有很多任务，大部分都是转瞬即逝的。虽然她的关系主要是与女性，但她发现自己爱上了一位名叫Rolf Tietgens的同性恋朋友。“我很想和他上床，”她承认，三周后她决定更喜欢她的朋友海伦。六周后，罗尔夫现在犯下了“令人作呕的行为，更精神变态，更神经质”的罪行\n1943年9月17日，我们收到了一张易变的便条：“一周前，克洛伊和我第一次一起上床睡觉！那是多么美妙，多么神圣！我肯定已经对她的思想感到厌倦了，但从来没有对她的美丽感到厌倦。”1945年1月，她告诉我们，她即将与八位最亲密的朋友见面，并与其中六位睡过觉。（同年，她绘制了一张当前和最近恋人的图表。）1948年7月，她连续三天与赫伯特·L（“迄今为止最好的。上帝也许我会学会爱男人”）、珍妮（“在这里过夜”）和马克（“三夜，三个人！”）睡在一起。她后来与马克订婚，但几乎立即启程前往英国，在那里她爱上了出版商的妻子，她最终在那不勒斯加入了她的行列。海史密斯的生活将变得更加漫无目的，仿佛她觉得自己无法固定在任何一个地方，就像她找不到一个真爱来支撑她一样。事实上，她表示自己更喜欢独处，但却情不自禁地陷入紧张的关系中，而这种关系总是酸溜溜的。一个情人在和海史密斯睡觉后第二天身体大出血（“很遗憾我要去欧洲，因为我们无法计划生活”）。另一个叫艾伦，当着她的面试图自杀。海史密斯在她的日记中写道：“我离开家时，她……在她嘴里戳了八颗药丸。”直到凌晨2点，她和朋友喝酒回家后，才发现艾伦处于昏迷状态。\n她的冷漠让人想起了她最著名的创作，骗子兼杀手汤姆·里普利。里普利的想法是1952年在波西塔诺的海史密斯提出的，但在她的日记中没有任何记录。正如冯·普兰塔所指出的，我们需要查阅海史密斯1990年的一篇文章来了解更多信息。同样，她的著名小说《猫头鹰的叫声》在她的笔记本中也没有直接提及，我们也没有听说帕特里夏·沙特尔的任命，她将在整个六七十年代担任她的经纪人。第二次世界大战结束后，她在欧洲各地旅行时，只提到了最近的创伤——“慕尼黑到处都是被炸毁的建筑”，但紧接着是“露丝非常感兴趣，因为我要买一辆车。”出于同样的原因，1941年12月8日的早期条目从“日本向美国宣战”到“在我1点30分与海伦交谈之前，学校里很悲惨”在每一个转折点上，个人因素都胜过历史因素。她的第一部小说《火车上的陌生人》主要是1948年在雅多作家的殖民地写的。杜鲁门·卡波特推荐了她。她在那里的时间显然很重要，后来她指定亚多为她的遗产受益人，这部小说是她第一次成功地试图表明“善与恶存在于生命中的一个人身上，因此我的主题是自我投射。”她对里普利的看法更进一步：“我曾预言过我会做的事，我已经在这本书中做了，也就是说，展示了邪恶对善良的明确胜利，并为此感到高兴。我也会让我的读者为此感到高兴。”1954年5月12日，海史密斯在日记中记录了她对自己第一部汤姆·里普利小说的进展感到多么高兴。然而，这也将是七年来的最后一次日记。当她的情人艾伦开始偷看日记时，海史密斯只会切换到笔记本上的条目，这些条目不那么私人（也不那么有趣）。\n“她最精彩的故事充满了流浪者和骗子，以及渴望置身其中的局外人。这本书让我们深入她的思想和身体。”\n根据冯·普塔拉的说法，当才华横溢的里普利先生出版时，她感到“突然变老，精疲力竭，无动于衷”金钱和健康问题将继续存在，以及针对她母亲的长期消耗战。恋人会来来去去去，海史密斯会继续写作，尽管拒绝仍然很常见。冯·普兰塔警告我们，随着年龄的增长，她也变得越来越刻薄：“她的一些贬损言论会让读者感到不快，尤其是当这些言论针对美国黑人和犹太人等长期被边缘化的群体时，尤其如此。”年轻的海史密斯对为一家犹太出版社工作嗤之以鼻，但这并不能阻止她接受这份工作。然而，后来，她提到一位熟人，“恨犹太人，爱共和党（一切让我厌恶的事！）”有大量证据表明海史密斯的丑陋信仰，但这一页上没有详细说明。即便如此，她肯定会辱骂以色列总理梅纳赫姆·贝京，并拒绝让她的书在他执政期间在以色列出版。她在写作方面的想法并不经常具有启发性，但许多想法都经过深思熟虑，至少有部分见解。“从逻辑上讲，艺术家是最不真诚的人，”她在1942年写道。“他们必须在一段时间内从事任何工作。杀人犯、诗人、风流韵事、叛徒、探险家、孩子、学者。他们都是这些人，而不是他们中的任何人，他们自己什么都不是。他们是他们自己的画布，是他们所有创作的翻版，如果不工作，他们就是粗布的肮脏污点，这不是他们的错。”她对犯罪故事的吸引力也很好：“我感兴趣的是杀人犯的心理，也感兴趣的是善与恶（压迫和毁灭）的对立层面。一个小小的叛变怎么能让一个变成另一个，一个强壮的头脑和身体的所有力量都被转移到谋杀或毁灭！这简直太迷人了！格雷厄姆·格林（Graham Greene）称她为“忧患诗人”。“她最精彩的故事充满了流浪者和骗子，以及渴望置身其中的局外人。这本书让我们深入她的思想和身体。\n我们每天都和她一起生活在非同寻常的、有时令人疲惫的细节中。出现的是一幅引人注目的画像，尤其是在一个人经历进化的前600页左右。（欢迎）过多的社论感叹让人注意到，这个故事尽管简明扼要，但仍然不完整。我们可能不知道是什么让里普利的创造者滴答作响，但我们确实了解了海史密斯这个女人，以及她的缺点和一切。1963年，哈珀（Highsmith的美国出版商）拒绝了她的一本书，导致作者指出：“现在我不认为写日记是愚蠢的。这是我生活中的一大危机。”换句话说，日记抵消了每一个危机时刻。它通过提供宣泄，让作者脚踏实地，头脑清醒。1955年，在记日记的间隙，她补充说，不写日记的一个缺点是“它带走了用文字写下东西的净化效果。它带走了分析，不管分析多么微小，当把东西写进文字时总是会出现。”\n冯·普兰塔和她的团队应该为这项庞大而复杂的学术事业而喝彩，因为他们允许我们在海史密斯的内心世界花费如此多的时间。\n伊恩·兰金（Ian Rankin）最近的Rebs惊悚片是《黑暗时代之歌》（猎户座）", "note_en": "“French exam this morning. It was difficult and I think I got all the questions I guessed wrong.”  29th January 1941\n “I got an A in French and there were only two As in the class.”  3rd February 1941\n  Patricia Highsmith had just celebrated her 20th birthday when she wrote these two journal entries. The future author of the celebrated psychological thrillers  Strangers on a Train and  The Talented Mr Ripley was a student at Barnard College in New York, and had begun “journaling” in earnest from her first semester. This present collection brings together extracts from her diaries (gossipy; quotidian) and her notebooks (work-focused; aphoristic), which were found in a linen closet after her death. The 56 journals (18 diaries, 38 notebooks) add up to eight thousand pages in total. As an editorial note states, this cherry-picked selection, amounting to almost one thousand pages, “should not be read as an autobiography… Pat’s diaries and notebooks provide a running account of a life in progress.” An extraordinarily detailed account at that. The first entry is dated 6th January 1941 and ends: “Mother is very hostile. Particularly because I am not feminine enough.” Highsmith’s troubled relationship with her mother would last until the latter’s death 50 years later, with Highsmith recording in 1985 that “my mother would not have become semi-insane, if I had not existed.” Troubled relationships were a theme of the author’s life. She is frank about her turbulent love life. In April 1941 she says in her diary: “My appetite is twofold: I hunger for love and for thought. Together those two can take me anywhere, you know. I wrote a poem about this.” But only a few weeks later she tells us: “I feel beaten down—discouraged from my work. I’m not developing enough, and I often think it’s sexual. Don’t know. What if these four years [at college] are lost! Wasted!” They certainly weren’t wasted in terms of words written or lovers taken. Highsmith in her early twenties adds as many as 700 pages a year to her journals, while enjoying New York’s temptations, from boozy lunches to late-night hook-ups. The first hundred pages of this collection deal with a single year, the year she turns 20. Eventually, she would start to write less in her journals, but these early sections are the most rewarding, presenting us with an unguarded portrait of a young woman taking the first tentative steps into the worlds of sex and literary endeavour. I say “unguarded,” but there is evidence that Highsmith went back and revised her diaries and notebooks throughout her life. A 1942 mention that Richard Wagner’s music is “almost any of it good to make love by” is amended in 1950 by the additional words “What horror!” By 1960 she looks back at her early writings and concludes: “I was twenty-three, a most immature, retarded, self-centred twenty-three. All my diaries should be thrown into a furnace.” This notion returns as late as 1992, the purpose being “to thwart idle curiosity.” Instead, she listed her journals as part of her oeuvre when she appointed her German publisher Diogenes Verlag as holder of her world rights.\n Editing this extraordinary collection presented immense challenges. Highsmith often wrote in a range of languages, so translators were needed. The editor Anna von Planta decided to present selections from both the diaries and the notebooks in chronological sequence. Footnotes were required to identify characters sometimes listed only by initials or nicknames. What emerges is a capacious portrait of a complex author and a compelling coming-of-age story.\n  And yet… There are many gaps. Her final diary, begun in 1981, would last her the next ten years—quite a change from the college student filled with zeal to record her every moment. Highsmith often meets the famous and the celebrated, but doesn’t often record much of note about those encounters. As early as April 1943, she moves to a new address “next to Piet Mondrian, who uses the same door.” This is as much as we hear about her artistic neighbour. Likewise, much later in life when Jeanne Moreau visits, we learn that Highsmith is thinking of buying a fax machine and “Jeanne also says I should have one.” Nothing else emerges from the visit. Muriel Spark merits a moment because she agrees to look after one of Highsmith’s cats. No mention is made that Spark went on to satirise Highsmith in her novel  The Hothouse by the East River (1973), where the exotic Princess Xavier keeps silkworms swaddled beneath her breasts—just as Highsmith was known to smuggle snails (which she loved and kept as pets) in and out of Europe in her bra. One thing both authors do share, however, is their almost superstitious choice of writing materials.\n “In her early twenties, Highsmith adds as many as 700 pages a year to her journals, while enjoying New York’s temptations, from boozy lunches to late-night hook-ups”\n Highsmith used the same notebooks throughout her life, sourced from Columbia University, while Spark’s novels were handwritten in school jotters, courtesy of an Edinburgh bookshop. Arthur Koestler garners rather more space, mostly because Highsmith goes to bed with him: “a miserable, joyless episode.” Her early twenties are filled with assignations, most of them fleeting. Though her relationships are mostly with women, she finds herself falling in love with a gay friend called Rolf Tietgens. “I should like very much to sleep with him,” she confesses, before three weeks later deciding she prefers her friend Helen. Six weeks further on and Rolf is now guilty of “disgusting behaviour, more psychopathic, more neurotic.”\n On 17th September 1943, we get this fickle note: “One week ago Chloe and I first went to bed together! And how wonderful, how godly it was! Could be—certainly am—bored by her mind already, but never by her beauty.” In January 1945, she tells us she is about to meet with eight of her closest friends and has slept with six of them. (That same year she drew up a chart of current and recent lovers.) In July 1948 in three successive days she sleeps with Herbert L (“the best yet. God—maybe I’ll learn to love men”), Jeanne (“spent the night here”), and Marc (“three nights, three people!”). She goes on to become engaged to Marc, but almost immediately sets sail for England, where she falls for her publisher’s wife, who ends up joining her in Naples. Highsmith’s life will become more peripatetic, as if she feels unable to anchor herself to any one place, just as she cannot find the one true love to sustain her. Indeed, she states that she prefers to be alone, yet cannot help embroiling herself in intense relationships that always sour. One lover suffers a physical haemorrhage the day after sleeping with Highsmith (“too bad I am going to Europe, for we can’t plan a life”). Another, Ellen, attempts suicide in her presence. Highsmith records in her diary: “She… was poking eight pills in her mouth as I left the house.” It is only when she returns home at 2am after drinks with friends that she finds Ellen in a coma.\n  Her coldness brings to mind her most famous creation, the con artist and killer Tom Ripley. The idea for Ripley came to Highsmith in Positano in 1952, but is not recorded anywhere in her journals. As von Planta notes, we needs must consult a 1990 essay by Highsmith to learn more. Likewise, her celebrated novel  The Cry of the Owl merits not a single direct mention in her notebooks, nor do we hear about the appointment of Patricia Schartle, who would be her agent throughout the sixties and seventies. During her trips across Europe in the immediate aftermath of the Second World War, there is a single mention of that recent trauma—“Munich shockingly filled with bombed-out buildings”—but this is immediately followed by “Ruth is very interested because I am buying a car.” By the same token, an earlier entry of 8th December 1941 segues from “Japan declares war on United States” to “miserable at school until I talked with Helen at 1.30.” The personal trumps the historic at every turn. Her first novel,  Strangers on a Train, was mostly written during a 1948 stay at the Yaddo writers’ colony. Truman Capote had recommended her. Her time there was obviously important—she later named Yaddo as beneficiary of her estate—and the novel was her first successful attempt to show that “good and evil are present in a single individual in life, hence my themes, which are self-projections.” She would take this further with Ripley: “What I predicted I would once do, I am doing already in this very book, that is, showing the unequivocal triumph of evil over good, and rejoicing in it. I shall make my readers rejoice in it, too.”On 12th May 1954, Highsmith records in her diary how happy she is at the progress of her first Tom Ripley novel. However, that would also be the last diary entry for seven years. When her lover Ellen starts sneaking peeks at the diaries, Highsmith switches only to notebook entries, which are less personal (and less interesting).\n “Her best stories are filled with wanderers and deceivers, outsiders who crave to be inside. This book takes us inside her mind and body”\n By the time  The Talented Mr Ripley is published, she feels, according to von Planta, “suddenly old, burned out, unmoored.” Money and health troubles would persist, along with the long war of attrition waged against her mother. Lovers would come and go, and Highsmith would keep writing, though rejection was still common. Von Planta warns us that, as she grew older, she also grew more bitter: “Some of her disparaging remarks readers will find offensive, especially when, as is frequently the case, they are addressed towards such perennially marginalised groups as Black Americans and Jews.” Young Highsmith is sniffy about working for a Jewish publishing house, but it doesn’t stop her taking the job. Later, however, she mentions an acquaintance who “hates the Jews, loves the Republicans (everything that disgusts me!)” There is plenty of evidence of Highsmith’s uglier beliefs, but it is not laid out on the page here in any great detail. Even so, she certainly reviles the Israeli prime minister Menachem Begin and refuses to allow her books to be published in Israel while he is in power. Her thoughts on writing are not often revelatory, but many are considered and at least partially insightful. “Artists are logically the most insincere people,” she writes in 1942. “They must be for a while whatever they work at. A murderer, a poet, a philanderer, a traitor, an explorer, a child, a savant. They are all these in turn, and none of them and nothing themselves. They are their own canvas, a palimpsest of all their creations, and if when not working they are a dirty smudge of coarse cloth, that is no fault of theirs.” She is also good on the appeal of the crime story to her: “I am interested in the murderer’s psychology, and also in the opposing planes, drives of good and evil (constriction and destruction). How by a slight defection one can be made the other, and all the power of a strong mind and body be deflected to murder or destruction! It is simply fascinating!” Graham Greene famously called her “the poet of apprehension.” Her best stories are filled with wanderers and deceivers, outsiders who crave to be inside. This book takes us inside her mind and body.\n We live each day with her in extraordinary, sometimes fatiguing detail. What emerges is a compelling portrait—especially in the first 600 or so pages—of an individual undergoing an evolution. The (welcome) plethora of editorial interjections gives notice that this story—despite its compendiousness—is still incomplete. We may not find out what makes the creator of Ripley tick, but we do get to know Highsmith the woman, flaws and all.In 1963, Harper (Highsmith’s US publisher) turned down one of her books, leading the author to note: “These are days when I do not think the writing of a diary is silly. It is a big crisis in my life.” In other words, the diary counteracts each moment of crisis. It keeps the author grounded and sane by providing catharsis. In 1955, during a gap in her diary-keeping, she adds that a disadvantage of not writing one is “it takes away the purging effects of putting down things in words. It takes away the analysis—which however slight, always emerges when something is put into words.”\n  Von Planta and her team are to be applauded for this vast and complex scholarly undertaking and for allowing us to spend so much time in Highsmith’s innermost world.\n  Ian Rankin’s most recent Rebus thriller is “A Song for the Dark Times” (Orion)", "posttime": "2022-02-15 03:56:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日记,highsmith,史密斯", "title": "帕特丽夏·海史密斯：日记和笔记本", "title_en": "Patricia Highsmith: Diaries and Notebooks", "transed": 1, "url": "https://www.prospectmagazine.co.uk/arts-and-books/patricia-highsmith-diaries-notebooks-review-ian-rankin", "via": "", "real_tags": ["日记", "highsmith", "史密斯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2022年的福特Maverick很受欢迎。它&#39；s福特&#39；这是世界上最便宜的产品，它提供了一个标准的混合动力系统，在任何卡车中都具有最好的燃油经济性，而且在正确的配置下，它仍然可以牵引4000磅的重量。它的占地面积小，实用性强，对于那些想用卡车为自己的DIY项目运送东西，但又没有F-150这样的皮卡车那么大的人来说，它的特立独行梦想成真了。\nDIY是特立独行者的游戏名称，正如我们&#39；我已经看过了。事实上，其中一辆皮卡车&#39；福特最酷的特点是它集成了一个名为FITS的插槽，即福特集成系带系统。这个小缺口让车主可以添加大量福特制造和自制的配件，这些配件可以通过3D打印机实现，比如杯子、垃圾袋、储物箱等等。现在，创建这些附件变得更容易了，因为福特已经正式发布了创建自己的FITS兼容配件所需的文件。\n福特公司承诺在这辆特立独行的汽车真正投入生产之前就发布这些文件。它&#39；这辆小型皮卡车开始撞上车道已经有几个月了，车主们不失时机地用老式的方法设计了适合自己的配件，比如卡钳和轮廓仪。\n此后，特立独行的店主积累了大量自制配件，向Thingiverse等3D打印存储库中添加了有趣且有用的物品，任何人都可以下载并打印。例如，有&#39；它是一个轻薄的杯托，一套可用来装四个购物袋的挂钩，Apple Magsafe支架（单配置和双配置），手机支架，任天堂开关支架，还有更多可供下载的东西，只需点击一个按钮。\n人们也开始为工厂没有提供的位置创造合适的位置。几家制造商已经建造了它们，以便在特立独行的市场上占据一席之地&#39；s的小型仪表板小隔间，而其他人则建造了与齿轮轨道安装系统兼容的支架，以便在不使用时在车库中轻松存放额外的支架。如果你没有&#39；Don’我不想拥有一辆特立独行的汽车，但仍然想使用其中一些sweet FITS配件，有人甚至设计了一个带螺丝孔的倒FITS系带，这样你就可以把任何一辆车变成与FITS兼容的车，不管是不是福特。\n如果你没有&#39；如果你没有3D打印机，但仍然想要FITS配件，那么有很多选择。有些人在Etsy和eBay上销售FITS配件，甚至在他们自己的独立网站上销售FITS配件。或者，您可以利用Shapeways等服务为您打印附件。\n你可以直接从福特&#39；s的网站。", "note_en": "The  2022 Ford Maverick is a hit. It&#39;s Ford&#39;s most affordable product, it offers a standard hybrid powertrain with the  best fuel economy of any truck around, and it still has the power to tow up to 4,000 pounds in the right configuration. Its small footprint and utilitarian nature make the Maverick a dream come true for people who want a truck to haul around stuff for their DIY projects, but without the size that comes with a pickup like the F-150.\n DIY is the name of the game for the Maverick,  as we&#39;ve already seen. In fact, one of the pickup&#39;s coolest features is its integration of a slot called FITS, the Ford Integrated Tether System. This small notch lets owners add on a myriad of  Ford-built and homebrew accessories that can be brought to life  using a 3D printer—think holders for cups and trash bags, storage bins, and more. Now, creating those attachments is getting a little bit easier because Ford has officially released the files needed to create your very own FITS-compatible accessories.\n   Ford has pledged to release these files since before the Maverick actually entered production. It&#39;s been a few months since the small pickup started hitting driveways, and owners wasted no time designing their own FITS-compatible accessories using old-fashioned methods, like a set of calipers and contour gauges.\n Maverick owners have since amassed a significant stockpile of homemade FITS accessories, peppering 3D printing repositories like Thingiverse with fun and useful items that anyone can download and print. For example, there&#39;s a  low-profile cup holder, a set of hooks useful for  holding up to four grocery bags, Apple Magsafe holders (in  single and  dual configurations),  phone mounts, a  Nintendo switch holder, and  much more available to download at the click of a button.\n People have also begun creating FITS slots for places not offered from the factory. Several makers have built them to take up space in the  Maverick&#39;s small dashboard cubby, while others have built mounts  compatible with GearTrack mounting systems to easily store extra mounts in the garage when not in use. And if you don&#39;t happen to own a Maverick but still want to use some of these sweet FITS accessories, someone has even  designed an inverted FITS tether with holes for screws, so you can turn any vehicle into a FITS-compatible one, Ford or not.\n  If you don&#39;t own a 3D printer and still want FITS accessories, there are options. Some people are selling FITS accessories on  Etsy and  eBay, or even their own independent  websites. Alternatively, you can utilize a service like  Shapeways to have an accessory printed for you.\n You can download the files needed to create your own accessories directly from  Ford&#39;s website.", "posttime": "2022-02-15 03:54:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,福特,发布,maverick,fits", "title": "福特发布了大量3D打印Maverick配件的蓝图文件", "title_en": "Ford Releases Blueprint Files for Tons of 3D-Printable Maverick Accessories", "transed": 1, "url": "https://www.thedrive.com/news/44276/ford-releases-blueprint-files-for-tons-of-3d-printable-maverick-accessories", "via": "", "real_tags": ["打印", "福特", "发布", "maverick", "fits"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我记得在Valentine&#39上休息了半天（当时我在德国多特蒙德的一家工人安全研究所做社会服务年的工作，用Borland Pascal开发了一个适用于7个窗口的应用程序）；1995年的今天，我要在第一天穿过小镇去一家不起眼的小店买我的Delphi 1。我记得他们只有CDROM版本的库存，而我没有&#39；我当时连一辆车都没有。但没关系——工作之后会支付软盘版本的费用，我们交换了🙃.\n前一年，我曾在汉诺威的CeBit看到德尔福（Borland&#39；的展位是我每年在世博会上的主要吸引力之一）的表演，并被它所震撼。自从Turbo Pascal 3以来一直是Pascal用户，目前正在Borland Pascal中与（极其简单的）Win32 API抗争，VCL不仅看起来是开创性的，而且看起来真的很神奇。事实证明确实如此。\n它&#39；现在是2022年，27年后，今年也是另一个周年纪念日，我为自己感到非常自豪。二十年前的今年（虽然可能不是今天）😅), 我当时的朋友、后来的同事亚历山德罗和我开始开发一个名为RemObjects SDK的小型库。\n这是网络发展的早期，SOAP也越来越受欢迎。SOAP既丑陋又臃肿，我们认为我们可以做得更好，同时仍然保持与SOAP的互操作性。事实证明我们可以。\nRemObjects SDK是一个更大的第三方组件包的一部分，该组件旨在为Delphi专业用户提供企业级功能，名为Project Dionysus。当时（现在）德尔福组件市场上许多最大的参与者都参与了进来，对于我们这两个凡人来说，即使是一个小小的贡献也能参与进来，这是一种莫大的荣誉。\nDiOnSUS项目从来没有起飞，但Delphi的SDK插件，成为我们公司的基础，Runbject软件，并且多年来获得了很多兄弟产品——无论是通过移植到其他平台上，还是在Delphi的其他工具上建立和扩展，比如我们最畅销的多层数据库框架，Delphi的数据摘要。\n当然，几年后，德尔菲和我们对语言的热爱也成为Oxygene（当时称为Chrome）的主要灵感之一。\n20年后，我自己也承认不太参与德尔福的日常工作，因为我在公司的其他平台和其他领域找到了自己的工作。但是，每天仍有数以千计的Delphi开发人员在使用Remoting SDK、Data Abstract和Hydra for Delphi，我们伟大的Delphi团队每天都在对版本10和版本6进行改进、更新和支持。事实上，我们&#39；本周，我们将向这三家公司重新发布一个重要的新更新。🙌🏼\n这里&#39；接下来的27年是Delphi，RemObjects软件通过为平台提供最先进的组件和工具而自豪地支持Delphi开发人员。🍹", "note_en": "I remember taking a half-day off work (I was doing my year of social services at an Institute for Worker&#39;s Safety in Dortmund, Germany, developing an app with Borland Pascal for 7 Windows) on Valentine&#39;s Day of 1995 to travel across town to a small obscure shop to pick up my copy of  Delphi 1 on day one. I remember they only had the CDROM version in stock, and I didn&#39;t even own a drive at the time. But it was OK — work would later pay for a floppy disk version, and we swapped 🙃.\n I had seen Delphi in action at CeBit in Hannover the year before (Borland&#39;s booth was one of the main draws for me at the expo, each year) and had been blown away by it. Having been a Pascal user since Turbo Pascal 3, and currently fighting with the (painfully simple) Win32 APIs in Borland Pascal, the VCL not only seemed groundbreaking, it seemed truly magical. And it turned out it was.\n It&#39;s 2022 now, 27 years later, and this year also marks another anniversary, one that I am very proud of myself.  Twenty years ago this year (although probably not to the day 😅), my then-friend-and-later-colleague Alessandro and I started working on a small library we called  RemObjects SDK.\n These were the early days of networking, and SOAP was getting traction. SOAP was ugly and bloated, and we thought we could do better, while still retaining interoperability  with SOAP. Turns out we could.\n RemObjects SDK was meant to be part of a larger bundle of third-party components that aimed at bringing Enterprise-level features to Delphi Professional users, called Project  Dionysus. Many of the then (and still now) biggest players in the Delphi component market were involved, and it was a great honor for us two mere mortals to get to include even a small contribution.\n Project Dionysus never took off, but  RemObjects SDK for Delphi did, becoming the foundation of our company, RemObjects Software, and over the years gaining many sibling products – both by being ported to other platforms and being built upon and extended by other tools for Delphi such as our best-selling multi-tier database framework,  Data Abstract for Delphi.\n And of course, Delphi and our love for the language became one of the major inspirations for  Oxygene (then called Chrome), a few years later, as well.\n Twenty years later, I myself am admittedly not very involved with Delphi day-to-day, having found my calling on other platforms and other areas of our company. But Remoting SDK, Data Abstract, and  Hydra for Delphi are still being used by thousands of Delphi developers, every single day and, at version 10 and 6 respectively, are being improved, updated, and supported by our great Delphi team, every day. In fact, we&#39;re shipping a  major new update to all three, this week. 🙌🏼\n Here&#39;s to the next 27 years of Delphi, and of RemObjects Software proudly supporting Delphi developers by shipping state-of-the-art components and tools for the platform. 🍹", "posttime": "2022-02-15 03:52:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生日快乐,birthday,delphi", "title": "27岁生日快乐，德尔菲", "title_en": "Happy 27th Birthday, Delphi", "transed": 1, "url": "https://blogs.remobjects.com/2022/02/14/delphi27th/", "via": "", "real_tags": ["生日快乐", "birthday", "delphi"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "20世纪60年代，美国实施了“犁铧行动”：即核弹可能用于和平，而不是战争。至少一些英国科学家。。。", "note_en": "In the 1960s, America was running \"Operation Plowshare\": the idea that perhaps nuclear bombs could be used for peace, not war. At least some British scientis...", "posttime": "2022-02-15 03:47:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "引爆,plan,美国", "title": "在约克郡引爆核弹的秘密计划", "title_en": "Secret plan to explode a nuclear bomb in Yorkshire", "transed": 1, "url": "https://www.youtube.com/watch?v=ceWZslOfEjs", "via": "", "real_tags": ["引爆", "plan", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我很少能从数学家那里听到鼓舞人心的话，但这句话来自已故的莫里斯·克莱恩，已经在我的脑海里回荡了好几个星期：\n创业公司经常被敦促继续前进；实现新目标，建设更多，更快、更大、更好地发展。Jotform最近刚满15岁，推出了我们十多年来的第一个新品牌，我受到了启发，停下来在后视镜里回顾。\n我在2006年创办了这家公司，其目标是创建简单的网络表单（并以大量星巴克咖啡为动力）。从早期开始，情况发生了很大变化。我们增加了数百名员工，在两大洲开设了三个办事处，并开发了一款拥有1000万用户的产品。我们还没有接受任何外部资金。\n我列出这些里程碑不是为了吹嘘，而是为了强调当你花时间追求一个单一的、不断发展的目标时可能发生的事情。没有人会说Jotform一夜成名——这就是重点。我们用自己的方式完成了这件事，多年来我学到了上千种感觉。所以，我想在一个地方收集我最好的建议。这是我在准备创办公司时对自己说的话。我希望它能帮助你，让你放心，无论你在创业之路上走到哪里。\n凭空想出一个伟大的商业想法几乎是不可能的。最成功的初创公司直接来自需求、挫折、不完整的经验，或者想做得更好的强烈愿望。当我在一家媒体公司工作时，我一直在为编辑编写表格——这是一项枯燥乏味的工作。有一天我想，“也许我应该开发一款产品，让这一切变得简单。”这就是约特福德的诞生。\n专家们经常建议创业者结对，但独自创业有很大的自由度。如果你担心自己没有所有必要的技能，阅读书籍，参加会议，听播客，尽你所能弥补这些差距。如果你的生意成功了，你可以雇佣优秀的人来填补你的困境。\n创办一家公司可能是孤立的，但要知道这种感觉是暂时的。不要让孤独把你击垮。利用安静的时间尽可能多地思考、计划和学习。最终，你会有一个团队陪伴你——你很有可能会错过那些安静、不受干扰的日子。\n在你有工作的时候创业是非常容易的。交易？到达巡航高度需要更长的时间。1998年，当我还是一名大学生时，我创造了我的第一个产品。在完成学位、在军队服役和全职工作期间，我继续出售它。当我离开工作的时候，这个产品取代了我的薪水，给了我一条无限的跑道来构建Jotform。如果你没有其他收入来源，在你还在工作的时候建立免费版本。在发布付费版本并建立坚实的订阅基础之前不要退出。\n没有人能（或应该）告诉你成功是什么样子的。不要浪费时间担心那些媒体宠儿的创始人或你的MBA同学做了什么。如果你获得了一点点动力，那就是成功。少数客户或少数销售人员意味着你走上了正确的道路。别急。把核心产品做好，然后继续。\n尽早在真实的人面前完成你的工作。这是最好的方式，看看他们是否会使用和支付你所建的东西。你等待的时间越长，你朝错误方向发展的可能性就越大——这可能是危险的。快速发布，提出问题，并应用反馈来不断改进。这听起来很简单，但令人惊讶的是，有这么多创始人害怕迈出这一关键的一步。\n你不能像万圣节的“不给糖就捣蛋”那样，在创业时等待顾客的出现。他们需要一个关心的理由；独特、有趣、新鲜或令人惊讶的事物。Jotform在出现之前就使用了拖放技术。这就是我们的角度，我将其应用于宣传新闻网站、撰写博客帖子和制定公关计划。考虑人们最关心的事情，并强调你的创业者如何支持他们忙碌的生活。\n像对待家人一样对待这些人。毕竟，他们是在你身上冒险。尽可能多地了解他们：他们想要什么？他们想避免什么？他们需要什么功能？什么让人困惑？企业产品的数量可能较小，但同样的逻辑也适用。提供卓越的支持并赢得他们的忠诚。\n构建一个产品意味着创造人们想要和需要的东西，然后不断改进。增长需要营销和销售。在早期，你需要在两者之间来回切换。改进你的工作。然后分享有用的、有价值的内容来发展你的平台——无论是在社交媒体上发帖、写博客、录制播客，还是任何适合你的内容。\n即使你有风投、天使、私募股权或祖母的支持（这并不丢脸），你从真正的客户那里得到的每一美元都是你真正赚来的。当你刚开始的时候，追求其他任何东西都可能是浪费时间，因为更重要的是掌握好基本知识。当然，也有例外。如果你有快速增长的竞争对手，你正在抢占土地，或者你需要实体基础设施，你可能需要财政支持。几乎所有其他的？你可以慢慢开始，用利润为你的成长提供资金。\n每一个新阶段都会带来不同的挑战，而创业就像细胞分裂一样。起初，你有一个庞大的、无定形的公司，角色和责任重叠。随着人数的增加，工作变得越来越精细。例如，人力资源分为人力资源部和招聘部，然后招聘部将重点放在不同的角色或地理区域，等等。\n我们跟踪各种数据，但有两个目标最重要：人们在使用我们的产品吗？我们的员工喜欢（并为此感到自豪）在这里工作吗？如果人们不积极使用你提供的服务，如果你的团队不愿意每天上班，那么所有的页面浏览量和跳出率都毫无意义。关注重要的事情。\n签下第一名员工是一大步。你可能需要一间办公室。这个合适的人也应该是全面发展的，这样他们可以处理很多不同的任务。但是，寻找一个能消除你生意中最大障碍的人。而且必须是你真正喜欢的人，因为你要花很多时间在一起。你喜欢和这个人共进午餐吗？不这可能行不通。明智地选择。\n2021，你需要办公室还是每个人都可以远程工作？你最初的决定为未来设定了方向。如果你在没有物理空间的情况下发射，你可能需要继续这样做。我强烈希望在办公室工作（如果安全的话），因为创业是一项集体运动。否则，这就像组建一支远程篮球队。为了加深人际关系，帮助人们更有效地合作，在工作日的间隙发生了很多事情。\n如果你真的有办公室，那就让它感觉像是第二个家。不要吝啬。为人们提供符合人体工程学的椅子、大桌子、立式办公桌、新鲜空气和自然光，以及植物。这些细节告诉你的员工，你关心他们的舒适度和工作效率。确保你的团队有更多的零食机和陈腐的咖啡来补充能量。\n团队中的前五名成员至关重要。在Jotform，他们为我们整个公司创建了原型。我们有一位设计师、增长专家、前端和后端开发人员，以及一位UX专业人士。这种组合非常成功，我们将整个公司组建成了类似的跨职能团队。注意什么在你的业务中起作用，并在你成长的过程中应用这种模式。\n我总是告诉我们的新实习生，“我们将教你们如何团队合作。”在学校，团队项目通常很糟糕，但我们确保实习生有令人满意的合作体验。你可以看到，当它们形成债券时，它是起作用的。他们一起共进午餐，分享胜利和失败的功劳，并相互感谢他们的贡献。你不能假装真正的尊重。\n大规模的招聘狂潮导致了大规模的混乱。如果你同时雇佣了一整组人，你就不能花时间和他们在一起，也不能了解他们。即使你的业务已经建立，一次添加太多人员也会妨碍现有员工分享你的系统和最佳实践——无论是正式还是非正式的。放慢脚步是避免文化崩溃的最佳方式。\n如果有人说了他们以前公司的坏话或泄露了他们的内幕，他们很有可能最终也会对你这样做。寻找有个性的人；那些不以自我为中心，真正想合作的人。\n热情、兴奋的人是值得的。确保他们快乐并帮助他们成长。如果有人被驱使，仔细倾听他们想去哪里，并制定计划帮助他们到达那里。定期检查并跟踪他们的进展——不要强迫有创造力的人进入一个盒子。保持开放，必要时让他们改变路线。你的整个生意会因此变得更强大。\n如果你能领导孩子，你就可以管理员工——我这样说没有一丝讽刺或不尊重。我们都需要安全和独立。如果孩子们感到不安全，他们就会停止游戏。有了强烈的依恋，他们就会开始茁壮成长。孩子们也需要空间去探索。当我需要我的孩子们做一些事情，比如穿上他们的鞋子，我会描述他们如何需要鞋子去公园。他们选择自己想要的鞋子，并独立穿上；我只是设定了参数。所有这些课程都适用于团队成员和员工。\n你不能设计公司文化。你不能写下来说，“这是我们的文化。”相反，文化只是公司运作方式的简写。例如，初级员工观察高级团队成员如何工作，然后跟随他们的领导。如果你想以某种方式完成某件事，请明确设定这些标准和期望。在日常操作中对其进行编码。\n小时候，我不是领导者。我是一个观察和参与的追随者。激发人们的情绪对我来说不是天生的，但这是我的责任。这就是为什么我会在每周五的演示日前做一个简短的演讲。传达你对工作的兴奋是有传染性的。人们听到并感受到它，它加强了你的部落。\n你不一定非得是一个外向的销售人员才能发表好的演讲。澄清你的想法，准备好你想说的话，用笔记代替阅读或记忆。每一次谈话都会帮助你提高，所有的练习都会随着时间的推移而累积起来。如果你感到有点紧张，请记住，关键是要与人沟通，而不是给他们留下深刻印象。\n这是一个不争的事实，就像万有引力定律一样：你可以在某些方面很出色，但不可能在所有方面都很出色。但是如果你把不太熟练的任务交给其他人，你可以把更多的时间花在最好的工作上。从小项目开始。让人们学习和培养自信，不要指望他们马上就能进步。\n一旦你授权，经常回访并提供一致的反馈。这样，另一个人（或团队）就掌握了成功所需的信息，你可以自由地集中精力，知道任务正在顺利进行。给人们时间和空间去寻找他们的节奏——尤其是在开始的时候。\n自己做每件事都不可避免地会适得其反。在创业初期，你可能需要扮演多个角色，但从长远来看，这是不可持续的。这一切都归结为信任：拒绝授权的人认为其他人不会尽其所能做好这项工作。解决方法在于在分配任务的同时传达愿景和背景。当有人明白他们为什么要承担一项任务时，他们很有可能会比你做得更好（甚至更好）。\n无论何时你写任何东西——一份文件、报告、演示文稿，甚至是一封重要的电子邮件——都要把它起草出来并放在一边。以后再来读。删掉多余的单词，缩短它，更快地切入要点。清晰不仅能消除困惑，还能传递信心和动力。这比我们想象的更重要。\n如果你真的想要什么，你会投入必要的时间和精力。努力获得动力可能表明你没有走上正确的道路——这没关系。对自己诚实。如果一切顺利，但你仍在苦苦挣扎，试着阅读你所在行业的成功公司。在办公室而不是家里工作。周末休息以避免精疲力竭。建立系统和常规，取代激励的需要。\n过滤器和自动化只能带你走这么远。如果你沉浸在电子邮件、沟通、管理任务和日常细节中，是时候寻求帮助了。我刚雇了一位出色的私人助理，在做了15年的生意之后。我可能应该在10年前采取这一步。不要等到你在水下滑得更远。\n动机与意义有关。当你相信某件事时，你就有动力去追求这个目标。正如法国作家安托万·德·圣埃克苏佩里（Antoine de Saint Exupéry）所写，“如果你想造一艘船，不要把人分成小组，派他们去森林伐木。相反，要教会他们渴望浩瀚无垠的大海。”\n研究表明，没有什么比在有意义的工作中取得进步更能提升情绪、感知和动机了——不管每一步有多小。如果你同时在做五个产品或项目，很难让人们对它们都感到兴奋。单一的专注确保每个人都在同一个团队中；朝着同一个目的地划船。每个人都可以看到他们的直接贡献如何推动整个团队向前发展。\n如果你陷入经济衰退或试图解决头痛的问题，那就去看书吧。找到最适合你情况的标题，开始阅读。几页之后，雾通常会消散，你的头开始变清。很快，你就会伸手去拿记事本，再次感到兴奋。\n错误、失误、公开的错误和失望会让人感到毁灭性的打击。尽你所能解决问题，然后放手。从这种情况中学习，为下一次做好准备，并制定应急计划来减少你的担忧。例如，我们刚刚聘请了第一位总法律顾问。单是这一步就减轻了我肩上的重量，帮助我晚上睡得更好。\n我不在乎成为公众人物，我从来都不在乎。当我和孩子们一起荡秋千时，想到在操场上被认出来，似乎很奇怪。然而，我通过写关于创业的文章搭建了一个平台。一个平台可以让你真正地分享和推广你的业务，而公众的声名狼藉往往是空洞的——而且几乎总是暂时的。\n去健身房，和你的团队一起打篮球，和你的孩子一起爬猴架，或者做任何让你感到充满活力和快乐的事情。这与季度收益报告同等重要（或更重要）。尽量不要在晚上10点以后工作。睡觉前放松下来，放下任何未完成的事情。明天是新的一天。\n哦，伙计，这可能是我最好的事情之一&#39；我已经读了很多年了\n纵容我们的前1000名用户对我们非常有用。它&#39；这可能是最好的建议。根据你的业务性质，它也可能是在纵容你的前100个用户。\n重要的是要像对待家人一样对待这些人，尽可能多地了解他们，提供非凡的支持，赢得他们的忠诚。\n更具体地说，你如何做到这一点，以及如何与他们沟通？\n恭喜你，艾特金。喜欢在IH上看到真正的独立黑客。我&#39；我是自举的超级粉丝，以下是我的&#39；我最好奇的是：（除了不把公司的一大部分让给投资者之外），你认为自举最被低估的优势之一是什么？\n读你写的东西总是很棒的。所有这些都是很好的教训。与&#34；其他人&#34；建议。谢谢。\n不可思议的帖子——里面有这么多金块。我喜欢&#39；慢慢成长，保持稳定&#39；而不是快速行动，忘记过去。\n最重要的是，创始人应该注意最后一段，照顾好自己。太多人忘记照顾#1。\n“如果你真的想要什么，你会投入必要的时间和精力。”💪\n“动机与意义有关。当你相信某件事时，你就有追求目标的动力。”\n前者也是我最喜欢的。如果你真的想要什么，时间不是借口。\n亲爱的IH，我想把这篇文章留作将来参考，你有什么办法吗？\n非常感谢@aytekin为我写了这么一篇精彩的帖子——这真的让我大开眼界。我&#39；我要把它打印出来，贴在我的柜子上作为参考！\n在IH或我遇到过的最好的内容。它&#39；它充满了智慧和可操作的建议。如果有这样的事情，这是注定要回到商业机器的。感谢您作为独立音乐人带领我们走过您的旅程。\n哇，这是我写的最好的文章之一&#39；我已经读了几年了，如此全面和激励，我认为你应该考虑写一本书。\n我可以立即联系到这个&#34；考虑人们最关心的事情，并强调你的创业者如何支持他们忙碌的生活。34;\n我点击阅读了一个全新的故事。突然我看到了什么！？艾特金坦克。我对自己说：我认识这个人&#39；这就是故事。😃\n&#34;纵容我们的前1000名用户&#34；我很快起草了一封电子邮件，感谢我的用户的订单，并告诉他们我有一个开放收件箱的政策，所以如果有任何我个人可以帮助的事情，他们总是可以直接联系我。✌️", "note_en": "Rarely do I come across inspiring quotes from mathematicians, but this one, from the late Morris Kline, has been echoing in my brain for weeks:\n  Startups are often urged to keep driving forward; to hit new targets, build more, and grow faster, bigger, better. As Jotform recently turned 15, and unveiled our first new brand in over a decade, I’ve been inspired to pause and look back in the rear-view mirror.\n I launched the company in 2006, driven by a vision to create simple web forms (and fuelled by gallons of Starbucks coffee). So much has changed since those early days. We’ve added hundreds of staff, opened three offices on two continents, and built a product with 10 million users. And we still haven’t taken any outside funding.\n I list these milestones not to brag, but to reinforce what’s possible when you take your time and pursue a single, evolving goal. No one would ever call Jotform an overnight success – and that’s the point. We’ve done it our way, and I’ve learned what feels like a thousand lessons over the years. So, I wanted to gather up my very best advice in one place. This is what I would tell myself as I prepared to launch the company. I hope it helps and reassures you, wherever you are on your startup journey.\n   It’s nearly impossible to conjure a great business idea from thin air. The most successful startups spring directly from need, frustration, incomplete experience, or the burning desire to do something better. When I worked for a media company, I was constantly coding forms for the editors – and it was boring, tedious work. One day I thought, “maybe I should build a product that makes this easy.” That’s how Jotform was born.\n  Experts often advise entrepreneurs to pair up, but there’s so much freedom in going it alone. If you’re worried that you don’t have all the necessary skills, read books, attend conferences, listen to podcasts, and do everything you can to patch those gaps. And if your business succeeds, you can hire brilliant people to fill in where you struggle.\n  Starting a company can be isolating, but know that this feeling is temporary. Don’t let loneliness knock you off course. Use quiet times to think and scheme and learn as much as you can. Eventually, you’ll have a team to keep you company – and there’s a good chance you’ll miss those quiet, distraction-free days.\n  It’s infinitely easier to start a business while you’re employed. The trade off? It takes longer to hit cruising altitude. I created my first product in 1998, while I was a college student. I continued to sell it while finishing my degree, serving in the military, and working full-time. By the time I left my job, that product replaced my salary and gave me an infinite runway to build Jotform. If you don’t have another revenue stream, build the free version of your offering while you’re still employed. Don’t quit until you release the paid version and establish a solid subscription base.\n  No one else can (or should) tell you what success looks like. Don’t waste time worrying about those media-darling founders or what your MBA classmates have done. If you’ve gained even a little traction, that’s success. A handful of customers or a few sales means you’re on the right track. Don’t rush. Get the core product right and keep going.\n  Get your work in front of real people as early as possible. It’s the best way to see if they’ll use and pay for what you’ve built. The longer you wait, the greater the chance you’re building in the wrong direction – and that can be dangerous. Release fast, ask questions, and apply the feedback to keep improving. It sounds simple, but it’s amazing how many founders are afraid to take this critical leap.\n  You can’t launch a business and wait for customers to show up, like trick-or-treaters on Halloween. They need a reason to care; something that’s unique, intriguing, fresh, or surprising. Jotform used drag-and-drop technology before it was a thing. That was our angle, and I applied it to pitch news sites, write blog posts, and develop PR plans. Consider what people care about most and emphasize how your startup supports their busy lives.\n   Treat these people like family. After all, they’ve taken a chance on you. Learn as much about them as you can: What do they want? What do they want to avoid? What features do they need? What’s confusing? Enterprise products may have smaller numbers, but the same logic applies. Provide exceptional support and earn their loyalty.\n  Building a product means creating something people want and need, and then continually making it better. Growth requires marketing and sales. In the early days, you need to switch back and forth between the two. Improve your work. Then share helpful, valuable content to grow your platform – whether that’s posting on social media, writing a blog, recording a podcast, or whatever works for you.\n  Even if you’re backed by VCs, angels, private equity, or your grandmother (no shame), every dollar you get from real customers is a dollar you’ve truly earned. Pursuing anything else can be a waste of time when you’re starting out, because it’s more important to get the basics right. Of course, there are exceptions. You may need financial support if you have fast-growing competitors, you’re in a land grab, or you need physical infrastructure. Almost everything else? You can start slowly and fund your growth with profits.\n  Every new stage brings different challenges – and growing a startup is like cell division. At first you have a big, amorphous company with overlapping roles and responsibilities. As you add more people, the work becomes increasingly granular. For example, HR splits into HR and recruiting, then recruiting splits to focus on different roles or geographical areas, and so on.\n  We track all kinds of data, but two targets matter more than anything: Are people using our product? Do our employees love (and feel proud of) working here? All the pageviews and bounce rates mean nothing if people aren’t actively using what you provide, and if your teams are loath to show up for work each day. Focus on what matters.\n   Signing your first employee is a big step. You might need an office. This right person should also be well-rounded, so they can handle lots of different tasks. But look for someone who can eliminate the biggest roadblocks in your business. And it has to be someone you actually like, because you’re going to spend a lot of time together. Would you enjoy having lunch with this person? No? It’s probably not going to work out. Choose wisely.\n  In 2021, do you need an office or can everyone work remotely? Your initial decision sets a course for the future. If you launch without a physical space, you’ll probably need to continue that way. I feel strongly about working from an office (assuming it’s safe), because startups are a group sport. Otherwise, it’s like assembling a basketball team that plays remotely. So much happens in the margins of a workday to deepen relationships and help people work together more effectively.\n  If you do have an office, make it feel like a second home. Don’t skimp. Give people ergonomic chairs, big tables, standing desk options, fresh air and natural light, and plants. These details show your employees that you care about their comfort and productivity. And make sure your teams have more than snack machines and stale coffee to stay fuelled.\n  The first five people on your team are essential. At Jotform, they created the prototype for our entire company. We had a designer, growth specialist, front-end and back-end developers, and a UX pro. That combination was so successful that we set the whole company up in similar, cross-functional teams. Watch for what works in your business and apply that model as you grow.\n  I always tell our new interns, “we’re going to teach you how to work as a team.” In school, team projects are usually terrible, but we ensure our interns have a satisfying, collaborative experience. You can see it’s working when they form bonds. They go to lunch together, share credit for wins and losses, and thank each other for their contributions. You can’t fake genuine respect.\n  Massive hiring sprees lead to mass confusion. If you hire a whole team of people, all at once, you can’t spend time with them or get to know them. Even if your business is already established, adding too many people in one shot prevents current employees from sharing your systems and best practices – both formally and informally. Going slowly is the best way to avoid cultural breakdown.\n  If someone bad-mouths or divulges inside stories from their previous company, there’s a good chance they’ll eventually do the same to you. Look for people with character; people who don’t enter with their egos, and who truly want to collaborate.\n  Passionate, excited people are worth their weight in gold. Ensure they’re happy and help them grow. If someone is driven, listen closely to where they want to go and map a plan to help them get there. Check in regularly and track their progress – and don’t force creative people into a box. Stay open and let them change course, if necessary. Your whole business will be stronger for it.\n   If you can lead children, you can manage employees – and I say this without a hint of sarcasm or disrespect. We all need both security and independence. If kids don’t feel secure, they shut down and stop playing. With strong attachments, they’ll begin to thrive. Kids also need space to explore. When I need my kids to do something, like put on their shoes, I describe how they need shoes to go to the park. They choose the shoes they want and put them on independently; I just set the parameters. All these lessons scale to team members and employees.\n  You can’t design company culture. It’s not something you can write down and say, “this is our culture.” Instead, culture is simply a shorthand for how your company functions. For example, junior employees watch how senior team members work, and then follow their lead. If you want something done a certain way, clearly set those standards and expectations. Encode it in daily operations.\n  As a kid, I wasn’t a leader. I was a follower who observed and participated. Stirring people’s emotions doesn’t come naturally to me, but it’s my responsibility. That’s why I give a short speech before each Friday’s Demo Day. Communicating your excitement about the work is contagious. People hear and feel it, and it strengthens your tribe.\n  You don’t have to be an extroverted salesperson to give good speeches. Clarify your thoughts, prepare what you want to say, and use notes instead of reading or memorizing. Every talk will help you improve, and all that practice adds up over time. If you feel a little jittery, remember that the point is to connect with people, not to impress them.\n  It’s an indisputable truth, like the law of gravity: You can be great at some things, but you can’t be great at everything. But if you delegate your less-proficient tasks to others, you can dedicate more time to your best work. Start with small projects. Let people learn and develop confidence, and don’t expect them to improve instantly.\n  Once you delegate, check back often and provide consistent feedback. That way, the other person (or team) has the information they need to succeed, and you’re free to focus, knowing the task is well underway. And give people time and space to find their rhythm – especially in the beginning.\n  Doing everything yourself will inevitably backfire. You may have to cover multiple roles in the early days of your startup, but that’s not sustainable for the long-term. It all comes down to trust: People who refuse to delegate don’t think someone else will do the job as well as they can. The fix lies in communicating vision and context along with the assignment. When someone understands why they’re undertaking a task, there’s a good chance they’ll do a great (and even better) job than you.\n   Whenever you write anything – a document, report, presentation, or even an important email – draft it and set it aside. Come back and read it later. Cut extra words, make it shorter, and get to the point faster. Clarity not only eliminates confusion, but it conveys confidence and momentum. It matters more than we think.\n  If you really want something, you’ll put in the necessary time and effort. Struggling to get motivated can indicate that you’re not on the right path – and that’s fine. Just be honest with yourself. If everything checks out, but you’re still struggling, try reading about successful companies in your industry. Work from an office instead of your home. Rest on the weekends to avoid burnout. Create systems and routines that replace the need for motivation.\n  Filters and automation can only take you so far. If you’re drowning in emails, communication, administrative tasks, and everyday details, it’s time to get some help. I just hired a fantastic personal assistant after 15 years in business. I probably should have taken this step 10 years ago. Don’t wait until you’re slipping further underwater.\n  Motivation is about meaning. When you believe in something, you have the drive to pursue that goal. As the French author Antoine de Saint-Exupéry wrote, “If you wish to build a ship, do not divide the men into teams and send them to the forest to cut wood. Instead, teach them to long for the vast and endless sea.”\n  Research shows that nothing boosts emotion, perception, and motivation more than making progress in meaningful work – no matter how small each step may be. If you’re working on five products or projects at once, it’s tough to get people excited about all of them. A singular focus ensures everyone’s on the same team; rowing toward the same destination. Each person can see how their direct contribution moves the whole group forward.\n  If you’re stuck in a slump or trying to untangle a head-throbbing problem, turn to books. Find the title that’s most applicable to your situation and start reading. After a few pages, the fog usually lifts and your head begins to clear. Soon enough, you’ll be reaching for a notepad and feeling excited again.\n  Errors, slipups, public mistakes, and disappointments can feel devastating. Do everything you can to address the problem and then let it go. Learn from the situation, prepare for next time, and create contingency plans to minimize your worries. For example, we just hired our first General Counsel. This step alone takes so much weight off my shoulders and helps me sleep better at night.\n  I don’t care about being a public figure. I never have. The thought of being recognized at the playground, while I’m swinging with my kids, seems bizarre. However, I’ve built a platform by writing about entrepreneurship. A platform enables you to authentically share and promote your business, while public notoriety is often quite empty – and it’s almost always temporary.\n  Hit the gym, play pickup basketball with your team, climb the monkey bars with your kids, or do whatever makes you feel alive and joyful. This matters just as much (or more) than the quarterly earnings report. Try not to work after 10 pm. Wind down before you go to bed and let go of anything unfinished. Tomorrow’s a new day.\n    Oh man, this is probably one of the best things I&#39;ve read over the last years\n  Pampering our first 1,000 users worked great for us. It&#39;s probably the best advice out there. Depending on the nature of your business, it could also be pampering your first 100 users.\n The important thing is to treat these people like family, to learn as much about them as you can, to provide exceptional support and earn their loyalty.\n  In more specific terms, how do you do this, and how do you communicate with them?\n  Congrats, Aytekin. Love to see true indie hackers on IH. I&#39;m a big fan of bootstrapping so here is what I&#39;m curious about the most: (apart from not giving away a big chunk of your company to investors), what do you think is one of the most underrated advantages of bootstrapping?\n  Always great to read what you write. All, great lessons. And so different from what &#34;everyone else out there&#34; advises. Appreciated.\n      Incredible post - so many golden nuggets in there. I love the &#39;grow slow, grow steady&#39; rather than move fast and forget about the past.\n Most importantly, founders should take note of the final paragraph  Take care of your whole self. Too many forget to look after #1.\n    “If you really want something, you’ll put in the necessary time and effort.” 💪\n “Motivation is about meaning. When you believe in something, you have the drive to pursue that goal.”\n  The former is my favorite, too. Time is not an excuse if you really do want something.\n    Dear IH, I want to save this post for future reference do you have any way to do it?\n  Thank you so much  @aytekin for writing such a wonderful post - it is truly an eye-opener for me. I&#39;m going to print this out and stick it on my cupboard for reference!\n  The best content ever published on IH or I ever come across. It&#39;s filled with nuggets of wisdom and actionable advice. This is destined for the business way-back machine if there is such a thing. Thank you for taking us through your journey as an Indie.\n  Wow, This was one of the best articles I&#39;ve read in years, so comprehensive and motivating, I think you should consider writing a book.\n        I could instantly connect with this - &#34;Consider what people care about most and emphasize how your startup supports their busy lives.&#34;\n  I clicked to read a brand new story. Suddenly what do I see!? Aytekin Tank. I said to myself: I know this person&#39;s story. 😃\n    &#34;Pampering our first 1,000 users&#34; I quickly draft an email to thank my users for the order and tell them that I have an open inbox policy, so if there is anything I can personally help with, they can always reach me directly. ✌️", "posttime": "2022-02-15 03:36:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "资金,learned", "title": "我从以0美元资金增长到1000万用户中学到的一切", "title_en": "Everything I’ve learned from growing to 10M users with $0 funding", "transed": 1, "url": "https://www.indiehackers.com/post/everything-i-ve-learned-from-growing-my-product-to-10-million-users-with-0-in-funding-925777ba88", "via": "", "real_tags": ["资金", "learned"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但这是一种鸡和蛋的情况，不是吗&#39；不是吗？我显然可以&#39；在没有资金的情况下，我们不能给社区一个生产就绪的项目，但似乎社区需要一个生产就绪的项目来资助它！\n你可以说&#34；这不是&#39；我们的生产还没有准备好，但足够稳定，可以进行试验，在帮助和资金的支持下，我们可以实现这一目标；。\n问题是，我不&#39；我自己不需要资金来完成这项工作，但我需要一个团队来将其转化为生产就绪的解决方案。\n你&#39；我们有点把这些事情当作二元问题：要么你有足够的资金来组建一个规模庞大的全职团队，要么你没有&#39；T要么该项目已经投产，要么还没有&#39；t、 我不&#39；我不这么认为&#39；这是一种有益的心态。\n我明白了，你和你的朋友们希望能够辞去工作，全职工作。唐&#39；我们不是所有人。但试着从这样的角度来思考：我们每周都有一定的工作时间，我们能做些什么？5人小时/周？10? 20?\n如果你的工作是强制性的全职（带薪），那么你可能需要兼职一段时间或休假。这取决于你的具体情况。\n据我所知，Patreon和Github赞助商页面最多只允许为一个开发项目提供资金，对吗？规模较小。\n帕特伦，我想是的，但那不是&#39；我不能阻止你雇佣帮手。那里的很多创作者都是这么做的。\n那里&#39；关于如何处理税务问题，或者如果你需要注册为合法企业，这并不是很多建议，但它确实与Open Collective相结合，这是你可以透明地向其他开发商支付资金的一种方式。\n在这一点上，您可能只是考虑将其构建为一个业务，这是开源产品可能实现的。你可以提供咨询服务或保证支持时间之类的服务，也可以提供bug奖励计划之类的服务。你不应该&#39；当然，我们不能指望它一夜之间就开始付账单，但如果你投入工作并建立联系，你就能做到。\n你也可以考虑成立一家非营利性公司，这样你就可以申请免税捐款，但那&#39；有很多文书工作。\n或者，找到一个适合HVM的具体用例，并在此基础上构建一个产品，然后将利润重新投入到HVM的开发中。我认为你们已经具备了这种素质：https://github.com/Kindelia/Kind#create-实时应用程序\nLinux基金会实际上有一篇文章谈到在开源方面建立业务：https://www.linuxfoundation.org/open-source-best-practices/building-a-business-on-open-source/\n但是如果&#34；其他人&#34；是开源社区的自愿成员，那么我&#39；我不确定这种模式是否有效。也许它适用于其他开源项目，但对于HVM，尤其是I&#39；我不太自信，因为它很大程度上依赖于很少有人（通常只有我）掌握的非常具体的知识。\n你&#39；我会感到惊讶的。使其发挥作用的关键有两个方面：模块化和知识的可访问性。任何人都不应该知道所有的部分是如何组合在一起才能在项目中工作的。当然，这适用于所有软件项目，而不仅仅是开源项目。\n以rustc本身为例。它&#39；这是一个非常复杂的程序，它的组件涉及许多特定领域的知识，世界上可能只有几百人能很好地理解这些知识，但你没有&#39；我不需要理解LLVM的复杂性&#39；s的优化过程实现了一个新的lint。\n它还有一页又一页的文档，解释不同部分是如何工作的，并将贡献者指向代码中感兴趣的地方。", "note_en": "But this is kind of a chicken-and-egg situation, isn&#39;t it? I obviously can&#39;t give the community a production-ready project without funding, but it seems like the community demands a production-ready project to want to fund it!\n You could state something like &#34;this isn&#39;t production-ready yet but is stable enough to experiment with, and with help and funding we can get it there&#34;.\n The thing is, I don&#39;t need funding to work on this myself, but I need a team to turn this into a production-ready solution.\n You&#39;re kind of treating these things as binary issues: either you have funding for a sizeable full-time team, or you don&#39;t; either the project is production-ready, or it isn&#39;t. I don&#39;t think that&#39;s a helpful mindset.\n I get it, you and your friends want to be able to quit your jobs and work on this full-time. Don&#39;t we all. But try to think of it in terms like: what can we get done with a given number of dedicated hours per week? 5 person-hours/week? 10? 20?\n If your jobs are mandatory full-time (salaried) then you may have to moonlight for a while or take time off. That depends on your specific situation.\n As far I understand, Patreon and Github Sponsor pages, at most, allow funding a single dev, right? It is a smaller scale.\n Patreon, I think so, but that doesn&#39;t stop you from hiring help. Lots of creators on there do that.\n  There&#39;s not a whole lot of advice for how to handle it on taxes or if you need to register as a legal business, but it does integrate with Open Collective, which is one way that you could transparently disburse funds to the other developers.\n On that note, you might just consider building it into a business, which  is possible with open-source products. You can offer stuff like consulting services or guaranteed support hours, or have something like a bug bounty program. You shouldn&#39;t be expecting it to start paying the bills overnight, of course, but if you put work into it and build connections, you can make it happen.\n You could also look into setting up a non-profit corporation so you can solicit tax-deductible donations, but that&#39;s a lot of paperwork.\n Alternatively, find a concrete use case that suits HVM and build a product on that, then put the profits back into development of HVM. I think you already have the makings of this in Kind:  https://github.com/Kindelia/Kind#create-live-applications\n The Linux Foundation actually has an article that talks about building a business on open-source:  https://www.linuxfoundation.org/open-source-best-practices/building-a-business-on-open-source/\n But if the &#34;other people&#34; are voluntary members of the open-source community, then I&#39;m not sure if that model would work. Perhaps it does for other open-source projects, but for HVM in particular, I&#39;m not so confident, because it relies a lot on very specific knowledge that few people (often just me) have.\n You&#39;d be surprised. The key to making it work is twofold: modularization, and accessibility of knowledge. No one person should have to know how all the parts fit together to work on the project. That applies to all software projects, of course, not just open-source in particular.\n As an example, take  rustc itself. It&#39;s a massively complex program that has components involving a lot of domain-specific knowledge intimately understood by perhaps just a few hundred people in the world, but you don&#39;t need to understand the intricacies of LLVM&#39;s optimization passes to implement a new lint.\n It also has  pages upon pages of documentation explaining how the different parts work and pointing contributors to places of interest in the code.", "posttime": "2022-02-15 03:28:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "记住,funding,资金", "title": "请记住，我的项目没有资金", "title_en": "Please, keep in mind there is zero funding for my projects", "transed": 1, "url": "https://old.reddit.com/r/rust/comments/snzu0w/please_keep_in_mind_there_is_zero_funding_for_my/", "via": "", "real_tags": ["记住", "funding", "资金"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我以前每天都用Roam，但现在不怎么用了。根据我在Twitter上看到的情况，以及对朋友们的随意调查，我认为我并不孤单。\n一年前，自瓦内瓦尔·布什（Vannevar Bush）描述memex以来，将笔记与双向链接联系起来的想法成为了思想空间工具中最大的一件事。自上而下的等级制度和标签系统成了人们日常生活中对所有记笔记错误的解释。因此，我们都争先恐后地使用双括号Express，决心构建我们自己的网络知识图表。但我们到底去了哪里？至少对我和我认识的大多数人来说，我们有一个垃圾堆，里面堆满了我们几乎从未重温过的粗糙链接和文本片段。我们为此感到内疚和悲伤。\n（不过，这是一个看起来非常吸引人的垃圾场。）发生这种情况的原因可能有很多：Roam的产品速度似乎非常慢，仍然没有很好的移动体验，他们有很多记录在案的社区问题。\n但有一个主要原因是我不再使用它：\n当我写笔记时，我会想，‘我要把这个放在哪里？’每次都困扰着我。这是一种直接而直接的痛苦。有时甚至会妨碍我做笔记。我一天有很多次这种感觉，感觉非常不舒服。\n罗姆的工作就是摆脱那种痛苦。有一段时间确实如此。但现在又回来了。\nRoam的核心理念是双向链接的概念。以前的笔记系统只允许在一个方向上链接：可以从一个笔记链接到另一个笔记，但链接到的笔记没有自动链接回原始笔记。\n相反，双向链接会自动创建从第一个音符到第二个音符以及从第二个音符到第一个音符的链接。Roam非常容易做到这一点，只需在[[括号]]中键入你的笔记片段，你就可以在笔记之间链接，如果你链接的笔记不存在，甚至可以创建新的笔记。\n其想法是创建一个高度网络化的笔记系统，笔记之间有很多链接。通过这样做，你可以增加与旧笔记的偶然相遇，降低丢失笔记的风险，并通常从整个笔记记录体验中，甚至生活本身中获得更多：\n我相信如果我使用它，我会从我的经历中学到更多，因为我不会忘记它们。我会从我读过的书中吸取更多的教训，因为我总是把它们放在手边。我会做出更好的决定，创作出更好的作品，也许我的头发甚至会开始看起来像康纳的一样有光泽（并排比较。我的头发怎么样？）罗姆的设计背后有大量的智慧和深刻的思考。但它真的对我有用吗？不是真的。如果我把写双向链接与实际查看笔记并点击其中的链接的时间百分比标出来，我估计会是这样的：\n事实证明，在写作或思考时，我很少处于这样一种状态：我想浏览大量的旧笔记，以找出该说什么或做什么。这感觉就像是在陈旧的垃圾中筛选。我最常见的行为就是写笔记。这就是为什么Roam需要帮助我思考，‘我不知道该把这个放在哪里。’如果它做得很好，我花在这个应用上的绝大多数时间都会很轻松。如果它做得那么糟糕，那会让我的经历如此痛苦，以至于我想切换系统。\n双向链接的天才之处在于，当我第一次开始使用它时，我脑海中神经质的仓鼠决定把“我应该把这个放在哪里”上的音量旋钮调低问题\n为什么？双向链接是一个非常好的故事。Roam的工作是让我相信，如果我只是像这样把笔记的片段包围起来，我真的不必担心再次找到笔记。它现在联网了！记笔记的需要远远超过了复习笔记的需要（见上图），所以Roam解决了我的问题。\n但过了一段时间，现实开始深入人心我并不像我想的那样经常回顾这些笔记。”我下一个自然而然的假设是，如果它们组织得更好，我可能会经历得更多。于是，这个问题又开始出现了我应该把这个放在哪里？”\n一旦我重新开始这样思考，我与Roam之间的各种其他问题就开始慢慢出现移动应用程序在哪里？”还有，‘为什么感觉产品没有改进呢？还有，‘为什么一切都感觉一团糟？’所有这些问题都存在，但只要我相信Roam解决了我的核心问题，就没有一个是重要的。但现在，它不是，突然，点解决方案的替代品，如苹果笔记和东西开始觉得有吸引力。整个事情都被解开了。\n我过去经常使用Roam做很多事情：写日记、记笔记、记录诸如待办事项清单之类的清单，以及做会议记录。\n因为我又开始担心把东西放在哪里，所以整个事情都从Roam转移开了。\n这可能看起来微不足道，或无用，或简化。但它其实很有价值。如果我们&#39；We’我们真的用Roam来调节不知道在哪里贴便条的情绪体验，那就意味着Roam可以对产品进行很多改变，从而在工作中表现得更好。\nRoam解决这个问题的最简单方法是改进搜索功能。。。\n想阅读这篇文章的其余部分，以及每周一次的数百篇其他文章和采访吗？以1美元开始试用。", "note_en": "I used to use   Roam every day, but I don’t use it much anymore. Based on what I can see on Twitter, and a casual survey of friends, I don’t think I’m alone.\n A year ago, the idea of networking our notes with bi-directional links became the biggest thing in the tools for thought space since Vannevar Bush described the  memex. Top-down hierarchies and tag systems became the  pet explanation du jour for everything that was wrong with note-taking. So we all hustled on to the Double-Bracket Express determined to build our own networked knowledge graphs. But where did we actually go? At least for me—and most of the people I know—we got a garbage dump full of crufty links and pieces of text we hardly ever revisit. And we feel guilty and sad about it.\n   (It is a very appealing looking garbage dump, however.)  There are probably a host of reasons why this happened: Roam’s product velocity seems to be incredibly slow, there still isn’t really a good mobile experience, they’ve had well-documented community issues—the list goes on.\n But there’s one main reason that I don’t use it anymore:\n When I write my notes the thought, ‘Where am I going to put this? ’ plagues me every time. It’s a direct and immediate pain. And it sometimes gets in the way of me even taking notes at all. I have this sensation many times a day and it’s deeply uncomfortable.\n Roam’s job was to get rid of that pain. And it did—for a while. But now it’s back.\n  The core idea that caught on with Roam is the concept of a bidirectional link. Previous note-taking systems allowed linking in only one direction: you could link from one note to another, but the note being linked to had no automatic link back to the original note.\n Bi-directional linking, by contrast, creates a link from the first note to the second, and from the second to the first automatically. Roam made this extremely easy to accomplish—just by typing pieces of your notes in [[ brackets ]] you could link between notes, and even create new ones if the note you were linking to didn’t already exist.\n The idea was to create a highly-networked system of notes with lots of links between them. By doing so, you could increase serendipitous encounters with old notes, and decrease your risk of losing a note, and generally get more out of the whole note-taking experience, or indeed life itself:\n  I believed that if I used it, I’d learn more from my experiences because I wouldn’t forget them. I’d take away more lessons from the books I’d read because I’d always have them close at hand. I’d make better decisions, produce better writing, and maybe my hair would even start to look as lustrous as Conor’s.      (Side-by-side comparison. How am I doing on the hair part?)There’s a ton of intelligence and deep thought behind Roam’s design. But did it actually work for me?  Not really. If I plotted out the percent of my time writing bidirectional links vs. actually looking at my notes and clicking through the links in them, this is what I estimate it would look like:\n  It turns out that I am rarely in a position, while writing or thinking, where I want to glance through lots of old notes as a way to figure out what to say or do. Mostly that feels like sifting through stale garbage.   My most common behavior is to Actually Write the Notes. That’s why Roam needs to help me with the thought, ‘I don’t know where to put this. ’ If it does that well, it makes the vast majority of my time spent in the app a breeze. If it does that poorly, it makes my experience so painful that I want to switch systems.\n The genius of bi-directional linking is that when I first started to use it, the neurotic hamster in my head decided to turn down the volume knob on the ‘Where should I put this? ’ question.\n Why? Bidirectional linking is a very good story. Roam’s job is to make me believe that if I just surround pieces of my notes like this [[ ]] I won’t really have to worry about finding the note again. It’s now networked! The need to take notes far outstripped the need to review them (see: graph above), so Roam solved my problem.\n After some time though, reality started to sink in. ‘I am not really going back through all of these notes as often as I thought I would. ’ My next automatic assumption is that if they were just organized better I might go through them more. And so, the question starts to creep in again. ‘Where should I put this? ’\n Once I’m back to thinking this way, all sorts of other problems that I have with Roam start to creep in. ‘Where is the mobile app?’ And, ‘why doesn’t it feel like the product is improving? And, ‘why does everything feel like a mess?’  All of these problems were present, but none were important so long as I believed Roam was solving my core issue. But now that it’s not,  suddenly, point-solution alternatives like Apple Notes and Things start to feel appealing. And the whole thing unravels.\n I used to use Roam for lots of things: a daily diary, book notes, keeping track of lists like my todo list, and taking meeting notes.\n   The whole thing moved away from Roam because I started to worry again about where to put things.\n This might seem trivial, or useless, or reductive. But it is actually quite valuable. If we&#39;re really using Roam to regulate the emotional experience of not knowing where to put a note, then that suggests a lot of product changes Roam could make to perform better at that job.\n   The easiest way for Roam to fix this would be to improve  the search function...\n Want to read the rest of this post and the hundreds of other essays and interviews on Every?   Start a trial for $1 .", "posttime": "2022-02-15 03:24:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漫游,fall,笔记", "title": "漫游的堕落", "title_en": "The Fall of Roam", "transed": 1, "url": "https://every.to/superorganizers/the-fall-of-roam#", "via": "", "real_tags": ["漫游", "fall", "笔记"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全世界都在庆祝美国独立20周年。2月14日。\n最新版本成为最快被采用的版本。NET有史以来，超过7000名来自微软以外的贡献者做出了超过21000份贡献。它包括C#10、F#5和许多新特性，以简化代码、加快迭代速度和提高性能。\n.NET Core 1.0在Red Hat DevNation上发布，展示了微软对拥抱Linux的认真态度，并展示了其对开源的承诺。\n这个NET编译器平台（Roslyn）于4月在Build上以开源形式发布，并于。NET基金会成立。去年11月，这家公司倒闭了。NET核心项目——一个跨平台、高性能的实现——始于GitHub。\n微软发布了ASP的源代码。MS-PL许可下的NET MVC。到2012年，它在Apache2.0下重新获得许可，成为微软首批大型开源项目之一。\nF#，第一个基于函数的。NET编程语言，由微软研究院的Don Syme开发。它最初是根据共享源代码许可证发布的，然后在2010年根据开放源代码许可证（Apache 2.0）重新发布。\n这个统一的IDE包括第一个。NET版本，允许您构建Windows客户端（Windows窗体）和Web（ASP.NET）应用程序，支持C#和Visual Basic。\n微软发布了下一代软件和服务的愿景和路线图——微软。NET平台。", "note_en": "The world celebrates the 20th anniversary of .NET on February 14.\r Join the party on Twitter by sharing your favorite .NET moments with\n  The latest release becomes the fastest adopted version of .NET ever, with over 7,000 contributors outside Microsoft making more than 21,000 contributions. It includes C# 10, F# 5, and many new features to simplify code, iterate faster, and perform better.\n  .NET Core 1.0 releases at Red Hat DevNation, showing how serious Microsoft is about embracing Linux and demonstrating its commitment to open source.\n  The .NET Compiler Platform (Roslyn) is released as open source at Build in April and the .NET Foundation is founded. In November, the .NET Core project -a cross-platform, high-performance implementation- begins on GitHub.\n  Microsoft releases the source code for ASP.NET MVC under MS-PL license. By 2012, it is relicensed under Apache 2.0 and becomes one of the first major open-source projects at Microsoft.\n  F#, the first functional-based .NET programming language, is developed by Don Syme in Microsoft Research. It was originally released under a shared source license and then re-released under an open-source license (Apache 2.0) in 2010.\n  This unified IDE includes the first .NET release that allows you to build Windows client (Windows Forms) and Web (ASP.NET) applications, supporting C# and Visual Basic.\n  Microsoft unveils the vision and road map for its next generation of software and services, the Microsoft .NET platform.", "posttime": "2022-02-15 03:15:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生活,years,net", "title": "20年的生活。网", "title_en": "20 Years of .NET", "transed": 1, "url": "https://dotnet.microsoft.com/en-us/", "via": "", "real_tags": ["生活", "years", "net"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073236, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然这种步枪可能没有传统火器的威力，但回顾一下ArcFlash实验室GR-1就可以看出为什么它不是玩具。\n昨天，ArcFlash实验室GR-1的视频评论出现在网上，这是一种电磁高斯步枪，去年它的制造商开始接受公众的预订单时出现了。我们做了一个关于它的故事，你可以在这里阅读。虽然这种以3D打印为主的电池驱动步枪乍一看似乎几乎像玩具一样，但这篇评论清楚地表明，它绝不是玩具。\n完整的视频可以在YouTube上找到，由小武器专家伊恩·麦科勒姆（Ian McCollum）制作。伊恩·麦科勒姆是武器研究服务的研究员，他经营着广受欢迎的博客“遗忘的武器”，后者专注于模糊的、实验性的和原型小武器。在对GR-1的回顾中，他介绍了高斯步枪的特点和能力，然后将其带到靶场进行射击。\n在视频评论中，McCollum在一篇被遗忘的武器博客文章中写道，“步枪”一词在本案中从技术上讲是一个误称。步枪通常被定义为在枪管内壁上有螺旋形（或螺旋形）凹槽。GR-1在技术上是一个光滑的孔，因为它的枪管是光滑的，没有这些凹槽。\nGR-1在2021年8月首次上市，并被称为“世界上第一个也是唯一的手持式高斯步枪”。当时，该步枪的标价为3375美元，据该步枪的网站显示，情况似乎仍然如此。该武器使用一系列带电线圈产生磁场，将直径小于半英寸的铁磁性或富铁金属弹头加速至每秒75米或240英尺。GR-1从一个弹匣中供给弹药，弹匣最多可以容纳10枚这样的子弹。\nArcFlash表示，GR-1配备了一个“先进的电容充电系统”，该系统允许其25v锂离子电池对线圈快速充电，使“步枪”大约每三秒充满一次电，在充电水平较低时可以更快地发射。武器&#39；s触发器系统允许用户在完全触发之前，用半个触发器对线圈进行预充电。\n步枪的枪托、弹匣和电池架都是3D打印的，而有些部分似乎是用螺栓固定的丙烯酸塑料制成的。根据手册，一个小LCD屏幕显示武器电池的电量、电容器的电量、线圈温度和“射击后诊断”。查看我们之前关于GR-1的报道，了解关于这一点的完整描述&#34；质量加速器#34；武器及其特点。\n对高斯步枪的大部分视频回顾都会引导观众了解其设计、功能以及如何操作非常规枪支。部分视频演示了如何装入弹匣、更换GR-1电池并为其充电，以及如何调整线圈的所需能量。\nMcCollum还指出，它增加了一个内置手电筒、绿色激光打靶，以及一个可滑动的后部支架，可以插入三种不同长度的弹匣，每个弹匣可以容纳不同大小的弹头。通过拉动步枪顶部的锁环，枪的后部可以延长或缩短，从而改变接收器的大小，从而改变可以插入的弹匣的大小。\n该评论指出了高斯步枪独有的几个重要安全特性，例如确保在不使用时移除电池，以及由于GR-1线圈产生的磁荷，步枪不应在距离任何有起搏器或类似敏感医疗设备的人50英尺以内使用。\n在靶场上，McCollum演示了GR-1在不同能量水平下的发射。高斯步枪在发射时出人意料地安静，在充电时只会发出微弱的呜呜声，在发射子弹时会发出机械的“咔哒”声。\n在视频演示过程中的几点（大约19:15），GR-1失火，迫使麦科勒姆不得不向前倾斜步枪，让未发子弹从枪管中掉出来。评论员表示，这可能是由于步枪弹匣接近空时出现的供料问题造成的。“未来不能解决我们所有的问题，不是吗？”麦科勒姆开玩笑地问道。\n在一发炮弹损坏了支撑着检阅中使用的目标的木制支架后，麦科勒姆指出，这表明GR-1能够造成真正的伤害。“这是一种严重的武器，”麦科勒姆说。“是的，就能量数字而言，与枪支相比，枪口的能量是微弱的，但这绝对是潜在的致命性，因此需要在对待它时尊重一个人是否拥有合适的枪支，”他说。\n在试射GR-1后检查目标时，McCollum发现一些子弹在飞行中倾向于翻滚，可能是因为枪管中没有来复枪和低初速。不过，对目标的命中分组相当紧密，这表明高斯步枪相当精确，至少在审查中测试的相对较近距离内是如此。\n虽然GR-1在去年首次亮相时遭到了一些嘲笑，但《被遗忘的武器》的评论清楚地表明，高斯步枪确实是一种拉塔尔武器，尽管它是一种非常规武器。这篇评论也让我们明白了一个事实，GR-1，至少是在评论中使用的那个，在很大程度上是一个原型，边缘仍然粗糙。在偶尔的失火，3D打印股票的一些粗糙的表面，以及看似鹅卵石的组件之间，这个概念远不是人们所认为的一个正常的大规模生产项目，至少在它的测试形式中是这样。\n尽管如此，只要花费大约3375美元，GR-1肯定会成为该系列有趣的话题。", "note_en": "While the rifle may not pack the punch of a traditional firearm, a review of the ArcFlash Labs GR-1 shows why it is not a toy.\n  A video review appeared online yesterday for the ArcFlash Labs GR-1, an electromagnetic Gauss rifle that surfaced last year when its manufacturer began taking pre-orders from the general public. We did a story about it then  which you can read here. While the largely 3D-printed battery-powered rifle may at first glance appear to be almost toy-like, the review makes it clear that it is anything but.\n The full video can be  found on YouTube and was made by small arms expert Ian McCollum, who is a researcher for  Armament Research Services and runs the popular blog  Forgotten Weapons, the latter of which focuses on obscure, experimental, and prototype small arms. In the review of the GR-1, he walks through the Gauss rifle’s features and capabilities before taking it to a range for target shooting.\n  In a Forgotten Weapons  blog post accompanying the video review, McCollum writes that the term ‘rifle’ is technically a misnomer in this case. Rifles are typically defined as having a spiraling (or helical) pattern of grooves cut into the inner wall of their barrels. The GR-1 is technically a  smoothbore, as its barrel is smooth and lacks these grooves.\n The GR-1 was first  listed for pre-sale in August 2021 and was described as the “world’s first and only handheld Gauss rifle.” At the time, the price was listed as $3,375, which still appears to be the case according to  the rifle’s website. The weapon uses a series of electrified coils to generate a magnetic field that accelerates  ferromagnetic, or iron-rich, metal slugs with diameters under half an inch to speeds up to 75 meters per second, or 240 feet per second. The GR-1 feeds ammunition from a magazine that can hold up to 10 such slugs.\n   ArcFlash says the GR-1 features an “advanced capacitor charging system” that allows its 25v lithium-ion battery to rapidly charge the coils, allowing the ‘rifle’ to fire at full charge approximately every three seconds, and more rapidly at weaker charge levels. The weapon&#39;s trigger system allows users to pre-charge the coils with a half-pull on the trigger before firing it with a complete pull.\n   The rifle’s stock, magazines, and battery holder are 3D-printed, while some sections appear to be acrylic plastic that has been bolted on. A small LCD screen displays the charge of the weapon’s battery, the charge of its capacitors, coil temperature, and “post-shot diagnostics,” according to  its manual. Check out our  prior coverage of the GR-1 for a full description of this &#34;mass accelerator&#34; weapon and its features.\n   The majority of the video review of the Gauss rifle walks viewers through its design, features, and how to operate the unconventional gun. Portions of the footage demonstrate of how to load magazines, change and charge the GR-1’s batteries, and how to adjust the desired energy of the coils.\n   McCollum also points out the addition of a built-in flashlight, green targeting laser, and a sliding rear stock that allows three different lengths of magazines to be inserted, each accommodating different sizes of slugs. By pulling a lock ring on the top of the rifle, the rear portion of the gun can be extended or shortened, changing the size of the receiver and therefore what size of magazine can be inserted.\n   The review points out several important safety features unique to the Gauss rifle such as making sure the battery is removed whenever not in use, and that due to the magnetic charge the GR-1’s coils produce, the rifle should not be used within 50 feet of anyone with a pacemaker or similarly sensitive medical device.\n When on the range, McCollum demonstrates the GR-1 firing at a variety of energy levels. The Gauss rifle is surprisingly quiet when discharging, only producing a faint whine while charging and a mechanical ‘click’ whenever a round is fired.\n   At a few points during the video demonstration ( roughly 19:15) the GR-1 misfires, forcing McCollum to have to tilt the rifle forward to allow the unfired round to fall out of the barrel. The reviewer states this is likely caused by feed issues that appear when the rifle’s magazine is close to empty. “The future can’t solve all of our problems, can it?” McCollum jokingly asks.\n After a round damaged the wooden stand holding up the targets used in the review, McCollum points out that this shows how the GR-1 is capable of inflicting real damage. “This is a serious weapon,” McCollum says. “Yes, in terms of energy numbers, the muzzle energy is wimpy compared to a firearm, but this is absolutely potentially lethal, so it does need to be treated with the respect that one accords a proper firearm,” he says.\n    When examining his target after testfiring the GR-1, McCollum found that some of the rounds tended to tumble in flight, likely due to the lack of rifling in the weapon’s barrel and low muzzle velocity. The grouping of hits on the target is fairly tight, though, indicating the Gauss rifle is fairly precise at least at the relatively close distances at which it was tested in the review.\n   While the GR-1 drew a few jeers when it first appeared last year, Forgotten Weapons’ review makes it clear that the Gauss rifle is indeed a lathal weapon, albeit an unconventional one. The review also drives home the fact that the GR-1, at least the specific one used in the review, is very much a prototype and still rough around the edges. Between the occasional misfires, the somewhat rough finish of the 3D printed stock, and the seemingly cobbled-together components, the concept is far from what one would consider a normal mass production item, at least in its tested form.\n Still, for around $3,375, the GR-1 sure would make for an interesting conversation piece at the range.", "posttime": "2022-02-15 03:12:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "射程,gun,步枪", "title": "3375美元的电磁枪在专家射程报告中被宣布为“严重武器”", "title_en": "$3,375 Electromagnetic Gun Declared “A Serious Weapon” in Expert Range Report", "transed": 1, "url": "https://www.thedrive.com/the-war-zone/44269/3375-electromagnetic-rifle-declared-a-serious-weapon-during-expert-range-report", "via": "", "real_tags": ["射程", "gun", "步枪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前，包括几乎所有西部地区在内，美国周边约一半地区正在经历中度至极端干旱。这并不令人惊讶，因为该地区普遍存在的干旱已经存在了相当长一段时间，鲍威尔湖和米德湖等主要水库的水位一直处于历史最低水平。但这场持续的干旱与过去相比如何？毕竟，该地区对干旱地区并不陌生。\n2020年的一篇论文在从南加州到怀俄明州的800年树木年轮重建的背景下研究了2000-2018年的数据。该团队发现，这可能是有记录以来第二个最干旱的时期，仅在16世纪末的一场特大干旱中被击败。\n当时，报纸&#39；作者猜测2019年的良好降水量足以结束持续的干旱。但是，一个特别邪恶的2021保持了干旱。因此，三的研究者加州大学洛杉矶分校的公园威廉姆斯和美国航空航天局的Benjamin Cook和Jason Smerdon决定通过2021更新数字。\n“大旱灾”这个词并不是坏电视节目中耸人听闻的名字；它&#39；这是过去一千年左右西南部发生的少数两三年干旱的一个术语，其中一些干旱对当时生活在那里的文明产生了历史性的影响。\n随着分析的更新，2000-2021年是800年前最干燥的22年。1571-1592年的特大干旱年份下滑至第二位。（尽管两个周期上的错误条重叠。）\n在这些年的2000到2021, 18年间，土壤湿度低于长期平均值。过去只有两次特大干旱达到了持续干旱的水平。2002年和2021年是整个记录中的第十一年和第十二年，从干燥的一年起已经过去了三个世纪。尽管一些特大旱灾集中在某个特定地区，但过去20年的旱灾在整个西部地区都很普遍。这是你在干旱中看到的，干旱更多地是由全球变暖而不是降水模式造成的。\n为了估计气候变化的影响，研究人员重复了他们对气候模型的分析，包括有无变暖的温度。他们之前的研究估计，2000-2018年干旱的严重程度中有46%是人为变暖造成的。尽管使用了新一代气候模型模拟，但在2000-2021年间，他们得到了42%的类似答案。\n这场干旱不是降水趋势强劲的结果，而是气温升高的影响。温暖的大气会蒸发更多的水分，同时也会减少夏季为西部河流提供水源的山地积雪的储存量。\n研究人员表示，目前的干旱可能会持续到今年年底，在这之后，它将相当于最短的23年特大干旱的持续时间。（最长的是30年。）这不是基于我们的天气展望的预感；它&#39；这是一个统计计算。研究人员从过去的旱灾重建中复制了40年的滚动窗口，并将它们每一个粘贴到2021年底，作为近期天气的可信样本。目前的干旱在94%的时间线中达到23年，在75%的时间线中达到30年。\n很有可能到2022年底，如果没有一些非常偶然的降水，当前的旱灾将不可避免地被归类为历史上的特大旱灾。\n研究人员写道，“之前的研究表明，持续的[人为气候变化]将越来越多地增加[北美西南部]在中断400年（至少1200年]以来最干旱的22年）后再次发生长期、广泛和严重特大干旱的可能性，其中包括至少1200年来最干旱的12个年份中的两个，这种最坏的情况似乎已经发生了。\"", "note_en": "About half of the contiguous US is  currently experiencing moderate to extreme drought—including almost all of the West. That shouldn’t come as a surprise, as widely pervasive drought has been present for quite a while now in this region, where major reservoirs like Lake Powell and Lake Mead are hovering around all-time low-water levels. But how does this ongoing drought compare to the past? After all, the region is no stranger to dry stretches.\n A  2020 paper examined the 2000-2018 data in the context of a tree ring reconstruction going back to the year 800 and stretching from Southern California to Wyoming. That team found that this was likely the second-driest period in the record, beat out only by a megadrought in the late 1500s.\n At the time, the paper&#39;s authors guessed that good precipitation in 2019 would be enough to end the extended drought. But instead, a particularly wicked 2021 kept the drought alive. As a result, three of those researchers—UCLA’s  Park Williams and NASA’s  Benjamin Cook and  Jason Smerdon—decided to update the numbers through 2021.\n  The term “megadrought” isn’t some sensationalist moniker from bad television; it&#39;s a term for the handful of two- to three-decade Southwestern droughts in the past millennium or so—some with history-defining impacts on the civilizations who lived there at the time.\n With the analysis updated, 2000-2021 ranks as the driest such 22-year period in the data going back to the year 800. The megadrought years of 1571-1592 slip into second place. (Though the error bars on the two periods overlap.)\n  Between 2000 and 2021, 18 of those years saw soil moisture below the long-term average. Only two past megadroughts meet that level of consistent dryness. The years 2002 and 2021 rank as the 11th and 12th driest years in the whole record—and it has been three centuries since a drier year occurred. And although some megadroughts were focused in a particular region, the drought of the last two decades has been widespread across the West. That’s what you would expect to see from a drought driven more by global warming than by precipitation patterns.\n To estimate the contribution of climate change, the researchers repeated their analysis of climate models run with and without warming temperatures. Their previous work had estimated that 46 percent of the severity of the 2000-2018 drought was due to human-caused warming. For 2000-2021, they get a similar answer of 42 percent despite using a new generation of climate model simulations.\n  This drought isn’t the result of strong trends in precipitation but rather the impacts of higher temperatures. A warmer atmosphere can evaporate more moisture from the land while also decreasing the storage of mountain snowpack that feeds Western rivers in the summer months.\n The researchers say that the current drought is likely to extend through the end of this year, after which point it would equal the length of the shortest megadroughts at 23 years. (The longest were 30 years.) That isn’t a hunch based on our weather outlook; it&#39;s a statistical calculation. The researchers copied a rolling 40-year window of years from the past drought reconstruction and pasted each of them onto the end of 2021 for plausible samples of near-future weather. The current drought reaches 23 years in 94 percent of those stitched-together timelines and hits 30 years in 75 percent of them.\n Odds are good that by the end of 2022, the current drought could inarguably be classified among the historical megadroughts, absent some extremely fortuitous precipitation.\n The researchers write, “Previous work indicated that continued [anthropogenic climate change] will increasingly enhance the odds of long, widespread, and severe megadroughts returning to [Southwest North America] after a hiatus of &gt;400 [years]. After the driest 22-year period in at least 1,200 [years], which included two of the driest 12 individual years in at least 1,200 [years], this worst-case scenario already appears to be coming to pass.”", "posttime": "2022-02-15 03:09:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,hitting,持续", "title": "美国西南部正处于严重干旱状态", "title_en": "The US Southwest is hitting megadrought status", "transed": 1, "url": "https://arstechnica.com/science/2022/02/the-us-southwest-is-seeing-its-deepest-drought-in-1200-years/", "via": "", "real_tags": ["美国", "hitting", "持续"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以太坊第二层解决方案“乐观主义”修复了一个允许非法持续创建以太代币的主要缺陷。\n据消息人士透露，乐观主义可能刚刚解决了一个重大的系统漏洞问题。这一潜在故障通过一名道德黑客Jay Freeman引起了以太坊开发人员的注意，他发现了代码中的缺陷，并将网络从重大盗窃风险中拯救了出来。\n据报道，该漏洞是由一名Etherscan员工触发的，现已被删除。如果问题没有得到及时解决，链上的恶意用户可能会利用该漏洞。这意味着网络参与者可以获得无限量的新ETH代币。\n在一篇全面的博文中，Jay准确地描述了这个漏洞如何导致世界上第二大加密货币的无限重复。他解释说，以太坊链上的任何开发者都可以自动使用它的一个分支来创建新的代币。具体来说，通过在曾经持有ETH令牌的智能合约上运行自毁操作码命令，可以触发持续再生。\n幸运的是，乐观主义通过在漏洞被利用之前及时修复漏洞，恢复了网络的完整性。在收到关于这个问题的消息后，开发团队在几个小时内对Kovan testnet和Operation Mainnet进行了修复。此外，其他与乐观主义有关的分支机构也收到了该缺陷的警告。因此，到目前为止，乐观主义和其他相关以太坊项目都是防虫的。\n该漏洞迅速解决后，乐观主义者迅速奖励了告密者杰伊·弗里曼200万美元。最近的奖项使弗里曼的赏金成为有史以来最高的赏金之一。然而，当一个人考虑到如果一个恶意的政党发现了这个小故障，可能会损失多少时，这是一个合理的奖励。此外，奖金还鼓励开发人员报告代码不一致，而不是利用代码不一致来达到自私的目的。\n除了乐观之外，据报道，其他第二层汇总也存在技术缺陷。12月出现了流行的缩放解决方案；Polygon默默地解决了一个漏洞，该漏洞将92%的MATIC代币暴露给了恶意方。幸运的是，两名道德黑客挺身而出，通知了网络，每人获得175万美元的奖励。几个月前，一名whitehat黑客报告并发现了一个漏洞，该漏洞可能耗资10亿美元。上周，虫洞以太坊桥损失超过3.25亿美元。\n第二层解决方案在为用户带来诸多好处（如降低交易费用）的同时，引入了显著的扩展改进。然而，最近的事件暗示，这可能是以一些安全问题为代价的。\n最近，一些DAO（分散自治组织）正在采取积极主动的方法来遏制故障。向白帽提供奖金，以识别和报告安全循环，仍然是挽救智能合约中潜在故障的一种切实可行的方法。", "note_en": "Ethereum layer-2 solution, Optimism, fixed a major flaw that would have permitted an illegal and continuous creation of ETH tokens.\n According to   sources , Optimism might have just solved a significant system vulnerability issue. The potential glitch got the attention of developers at   Ethereum  through an Ethical Hacker, Jay Freeman, who discovered flaws in the code and saved the network from significant theft risks.\n The bug, now curtailed, was reportedly   triggered by an Etherscan employee. Had the issue not been promptly resolved, malicious users on the chain could have exploited the flaw. This means a cyber actor could have gained access to the unlimited generation of fresh ETH tokens.\n In a comprehensive blog post, Jay   described  precisely how this vulnerability could lead to the infinite duplication of the second most-valued cryptocurrency in the world. He explained that any developer on Ethereum’s chain could automatically use one of its forks to create new tokens. Specifically, a continuous regeneration is triggered by running a SELF-DESTRUCT opcode command on a smart contract that once held ETH tokens.\n   Luckily, Optimism restored the integrity of the network by fixing the bug on time before it exploited it. After receiving word about the issue, the development team implemented a fix on Kovan testnet and Optimism Mainnet in a matter of hours. Additionally, other affiliated forks and bridges to Optimism were alerted of the defect. So, as of now, Optimism and other related Ethereum projects are bug-proof.\n Following the bug’s swift resolution, Optimism swiftly rewarded whistleblower Jay Freeman, an amount of $2 million. The recent award makes Freeman’s bounty one of the highest ever recorded. However, a reasonable reward when one considers how much could have been lost had a malicious party caught on with the glitch. Additionally, the bonus gives developers an incentive to report code inconsistencies instead of exploiting them for selfish ends.\n  Besides Optimism, other layer-2 rollups have been reported to suffer from technical weaknesses. December saw a popular scaling solution; Polygon  silently tackled a bug that   exposed  92% of MATIC tokens to malevolent parties. Luckily, two ethical hackers stepped up to notify the network and were rewarded $1.75 million each. A few months earlier, a whitehat hacker reported and identified a loophole that could have cost Polygon a billion dollars. Last week saw Ethereum bridge, Wormhole,   lose  more than $325 million.\n Layer-2 solutions have introduced significant scaling improvements amidst numerous benefits for users (such as reduced transaction fees). However, recent incidents hint that it might be at the cost of some security concerns.\n Of late, several DAOs (Decentralized Autonomous Organizations) are taking proactive approaches to curb glitches. Offering bounties to Whitehats to identify and report security loops remain a practical approach to salvage potential glitches in a smart contract.", "posttime": "2022-02-15 03:07:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,黑客,hat", "title": "白帽黑客因修复ETH创建漏洞而获得200万美元奖金", "title_en": "White hat hacker awarded $2M for fixing ETH-creation bug", "transed": 1, "url": "https://cryptoadventure.com/white-hat-hacker-awarded-2-million-for-fixing-eth-creation-bug/", "via": "", "real_tags": ["漏洞", "黑客", "hat"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sonic Robo Blast 2是一款3D开源Sonic the Hedgehog fangame，使用Doom Legacy port of Doom的改进版构建。SRB2的灵感来源于世嘉创世纪（Sega Genesis）的原创音速游戏，并试图以3D形式重现设计。而SRB2不是&#39；虽然还没有完全完成，但它已经拥有了大量的关卡、敌人、速度，以及原声游戏提供的许多乐趣。\n今天下载并体验Sonic Robo Blast 2！发布：：开发：：网站：：其他：：存档大家好！今年的第二轮比赛是有史以来最好的比赛之一。汇编中有很多很棒的地图。\n单人组的冠军是米哈埃尔·布勒，他进入了一个砖砌的破区。这个巨大的区域有坚实的平台，音乐借鉴了我们自己的CobaltBW。街区城堡明亮的颜色和建筑看起来非常漂亮。祝贺\n米哈埃尔·布勒还凭借其作品《彩色塔楼区》赢得了“捕获旗帜”部门的冠军，该区域与布里克德·巴斯特的主题相同。比赛组的冠军是迭戈，他们的参赛作品是大理石卫城区。地狱者队凭借进入迷雾花园区赢得了竞技场师的胜利。祝贺\n你可以在这里查看完整的比赛结果。如果你还没有查看这个竞赛包，你可以在这里下载。\n感谢所有参加这次比赛的人！OLDC 2022第1轮的截止日期是2022年6月1日协调世界时23:59（东部时间6:59）。到时候见！\n官方级别的设计比赛回来了！本轮共有21张单人地图、2张比赛地图、3张CTF地图和2张竞技场地图，共有24位创作者的28份参赛作品。进入审美思维，进入蒸汽穹顶，开始吧！游戏结束后，一定要为你最喜欢的地图投票。过来看！\n请注意，在SRB2 v2中。2.9，字符交换程序存在一些视觉错误。这些问题在即将发布的补丁v2中得到修复。2.10. 提交的一些地图中还存在其他各种错误。这些地图的补丁可能会在1月初发布。目前，我们已经消除了所有可能发现的软锁和崩溃，所以背包应该相当稳定。\n请在2022年1月16日东部时间下午6:59（UTC 23:59）之前提交投票。感谢所有参赛者，祝你们玩得开心！\n大家好！今年的第一轮比赛非常成功。让我们看看结果！\n单人组的赢家是Othius、Inazuma和Spectrious，他们的参赛作品是空心山区。这个神秘的地方充满了奇怪的液体。玩家可以通过向上跳来爬上它的溪流。关卡的一个部分有一个非常酷的神龛倒塌了。舞台有有趣的斜坡可供衍生，还有漂亮的定制资产可供观赏。恭喜你们三个！\n恭喜MK.exe赢得了比赛分区的未知荒地区！祝贺Ruberjig和Apolyon Woman凭借《金属疯狂地带》赢得CTF师的战斗胜利！\n你可以在这里查看完整的比赛结果。如果你还没有查看这个竞赛包，你可以在这里下载。\n感谢所有参加这次比赛的人！OLDC 2021轮2的最后期限是2021年12月1日在UTC的23点59分（6点59分EST）。到时候见！\n又到那个时候了，伙计们！嗯，确切地说，两天前又是那个时候——我发这篇文章迟到了。但这并不意味着现在还不是时候！没错，官方的水平设计比赛又回来了，这是另一个激动人心的部分！来吧，体验一些全新的，从未见过的地图！我们有单人地图，比赛地图，还有战斗CTF地图，总共有22个创作者的23个条目！在神秘的小行星基地还有什么奇迹等着我们呢？每种比赛类型谁将赢得奖杯？你是不是一个足够坏的家伙，可以投票给你最喜欢的地图？我当然希望你是，如果你是，那么点击这里开始！\n呸…啊哼。现在，销售宣传已经过时了，我想重点介绍一下OLDC这个迭代中新出现的一些生活质量特性。以下是我们的竞赛工作人员所做的准备：\n新闻及；在单人模式下按住点火按钮可返回中心\n在撰写本文时，我们建议玩家在靠近星柱时不要使用返回中心功能，除非他们想在返回时在错误的位置产卵。竞赛工作人员正在努力修复另外两个带有新功能的小错误，我们希望尽快推出这些修复。\n务必在2021年6月26日下午6点59分（UTC 23点59分）之前提交你的选票。感谢所有参赛者，祝最好的地图获胜！\n大家好！多亏了社区反馈，我们能够找到并修复一些妨碍玩家在Android设备上享受游戏的主要错误。如果你在OpenGL模式下只得到一个黑屏，那么这可能是你的补丁！更改日志很短，所以我会复制整个内容：\n修复用户在不应打开控制台的情况下能够打开控制台的问题\n嘿2.2.9出局了。在平常的地方拿。时间不早了，所以我只想转述一下变更日志中一些更有趣的台词：\n修复了通过命令行加载带有自定义保存数据的加载项时出现的错误（尤其是在从Zone Builder进行测试时）。\n增加了Lua的多任务库，允许读取和操作地图、线条和扇区上的标记；还添加了标记迭代器函数。\n在马拉松模式的记分屏幕中，暂停比赛不再是可能的。\n在合作级别中添加了首字母缩略词关键字。与map命令一起使用，例如，您可以使用map GFZ1扭曲到绿色花朵1。\n修复了安装程序可执行文件中的一个问题，在这个问题上，你不会总是被问到要在哪里安装游戏。\n在这个补丁中有很多错误修复和其他生活质量方面的东西。我们希望你喜欢。\n十多年后，SRB2留言板终于升级为现代界面。评级体系崩溃的日子一去不复返了。我们将不再需要处理移动浏览器上的次高级体验。我们回来了，我们比以往任何时候都好。我们非常感谢您在迁移过程中对我们的耐心。\n我们希望您喜欢新的插件&amp；更多系统。对于一篇新闻帖子来说，有太多的话要说，所以请查看关于如何向其提交文件的说明，以及您可能遇到的一些问题的答案。如果你的插件不知何故没有进入插件&amp；更多，请让我们知道！\n“那么，新留言板上还有哪些新功能？”你可能会问。首先，一个更明显的特征是：对帖子做出反应的能力。点击“酷！”点击帖子底部的按钮，让帖子作者知道你喜欢它。（它不会做任何其他事情，但他们可能会收到通知，这可能会给他们温暖和模糊的感觉。）\n现在，您可以设置一个横幅，该横幅显示在您的个人资料上，如果有人将鼠标悬停在您的个人资料图片上，则会显示在个人资料预览上。如果你不确定该设置什么，我可以推荐一张你最喜欢的地图截图吗？\n另一个有趣的功能是对表情符号的原生支持。点击帖子编辑器中的笑脸，浏览可用的表情符号。里面有一个文本框，可以让搜索表情符号变得更容易。我们添加了一些自定义的，您可能会从我们的Discord服务器中识别出来。\n我们还为代码块BBcode添加了一个扩展，它允许您指示代码使用的语言，并突出显示您想要的任何行。默认情况下，代码语言设置为Lua，并且还有几种语言可用。\n有很多新的风格可供选择，包括SRB2中每个角色的风格，还有更多。样式选择器仍然位于每个页面的左下角，就像旧论坛一样。\n竞赛优胜者现在将在他们的个人资料上看到他们的胜利。这些奖杯是徽章系统的一部分。我们将继续为每一个旧的C添加徽章，但任何其他新的徽章都将非常少。最近一次比赛的获胜者也将在其姓名下获得黄色横幅，而不是黄色用户名。对于所有这些样式，我们决定最好保持所有用户名的颜色相同。\n最后，这里有一个大问题：您现在可以在PC或移动设备上安装SRB2MB作为web应用程序。据我所知，它只支持Android和Windows 10。安装按钮应位于顶部导航栏上，如果您使用手机，则应位于侧面导航栏的底部。Opera似乎并不总是显示安装按钮，所以如果看不到，请尝试Chrome或其他浏览器。（不，它不在游戏商店里，傻鹅！）该web应用的外观和感觉与网站完全相同，您可以通过它访问SRB2主页和wiki。现在，我们的社区离这里只有一步之遥！\n有一个小警告：我们仍然需要从v2复制信息。1和v2。0个era插件，这样您就可以看到其中哪些是可重用的。这需要一段时间，所以请耐心等待！\n差不多就这些了。我可能忘了几件小事，但我相信你最终会找到的。我真诚地希望你们都觉得新的留言板是一个进步。我们当然已经尽了最大努力来实现这个目标。如果您有任何问题、评论、担忧或建议，请随时在“员工谈话”子论坛中发表帖子——我们很乐意听到。\n最后，我想向所有参与这次迁移的人表示感谢：阿拉姆格勃、爱丽丝、博恩西尔、查里布迪兹、D00D64、Inazuma、jameds、Larz T、LoganA、RoyKirbs、斯蒂尔和瓦伦。你们都很棒！\n情人节快乐！我们Sonic Team Junior非常喜欢我们的playerbase，所以我们做了两件很酷的事情：\n我们将为您提供v2的预发布版本。2.9. 在我们的Discord服务器上找到它！\n我们终于开始使用新的留言板软件了。在24小时内，该过程将开始，留言板将下降进行维护。再见，vBulletin！你好，Xenforo！\n和往常一样，感谢您留下来玩SRB2！没有你，我们就不会有今天！\n大家好！2020年秋季奥运会来了又走了。在祝贺获奖者之前，我想回顾一下我们将为未来比赛所做的一些改变。\n最大的变化是，未来的比赛将是每年两次，而不是每年四次。我们认识到，与OLDC最初创建时相比，创建地图更加困难，所需时间更长。我们希望给地图绘制者6个月而不是3个月的时间来绘制地图，这将导致更多的地图提交给每场比赛，并且地图质量将尽可能高。\n此外，我们现在将要求参与者在他们的地图提交帖子中包含他们的不和谐标签（也就是说，你的用户名——不是昵称——以及后面的四个数字）。通过这种方式，我们可以将参与者添加到SRB2官方Discord服务器上的一个特殊频道，专门回答他们关于比赛的问题。此频道还可用于在提交截止日期过后，让竞赛工作人员了解地图的最新修复。我们希望这比直接向竞赛人员发送有关此类主题的信息更容易，因为个别工作人员并不总是在线和/或提供帮助。（但是，如果您没有Discord帐户，则可以跳过此选项。）\n单人组的获胜者是Kwiin和Kanna，他们的参赛作品是Footage熔炉区。这张地图的主题似乎是借用了另一个名为Sonic的名字：在续集之后。我觉得这张地图有点挑战性。小心死亡坑和快速移动的平台！在音速游戏中，它使用斜坡的方式让人感觉非常自在，而且它的纹理效果很好。恭喜你，奎恩和坎娜！\n祝贺Joe Mewstard凭借Electric Avenue Zone赢得巡回赛冠军！祝贺克拉布凭借愚蠢的面部刺刀区域赢得竞技场师，以及凭借GFZFLR01区域赢得战斗CTF师！\n你可以在这里查看完整的比赛结果。如果你还没有查看这个竞赛包，你可以在这里下载。\n感谢所有参加这次比赛的人！OLDC 2021轮1的最后期限是2021年6月1日在UTC的23点59分（6点59分EST）。到时候见！\n大家好！我有好消息和坏消息。坏消息是，我们的留言板将在本周末（2020年12月26日和27日）进行维护。好消息是，这种维护涉及将留言板移动到新服务器。这应该意味着更高的稳定性，这是升级到新留言板软件过程中非常需要的一步。\n请注意，这意味着ingame服务器浏览器在此期间将无法正常工作。解决这个问题的最好方法是加入我们的Discord服务器。这个地方从来都不是空的，这是找到人一起玩网络游戏的好方法。\n由于通知时间很短，我们决定将OLDC投票截止日期延长一周。请在2021年1月2日下午6:59EST（UTC 11:59PM）投票。\n老帖子»", "note_en": "Sonic Robo Blast 2 is a 3D open-source Sonic the Hedgehog fangame built using a modified version of the Doom Legacy port of Doom. SRB2 is closely inspired by the original Sonic games from the Sega Genesis, and attempts to recreate the design in 3D. While SRB2 isn&#39;t fully completed, it already features tons of levels, enemies, speed, and quite a lot of the fun that the original Sonic games provided.\n Download and experience Sonic Robo Blast 2  today!     Releases ::  Development ::  Website ::  Other ::  Archive  Hello everybody! Round 2 of this year’s contest is among the best ones ever. There are so many great maps in the compilations.\n The winner of the single player division is Mikhael Blur with his entry, Bricked Busted Zone. This massive zone with solid platforming has music borrowed from our very own CobaltBW. The bright colors and architecture of the block castles look very nice. Congratulations!\n  Mikhael Blur also won the Capture the Flag division with his entry, Colorful Towers Zone, which shares Bricked Busted’s theming. The winner of the Match division is Diegão with their entry, Marble Acropolis Zone. InferNOr won the Battle Arena division with their entry, Misty Gardens Zone. Congratulations!\n  You can view the full contest results  here. If you haven’t checked out this contest pack yet, you can download it  here.\n Thanks to everyone who participated in this contest!  The deadline for OLDC 2022 Round 1 is  June 1st, 2022 at 23:59 UTC (6:59 EST). See you then!\n  The  Official Level Design Contest is back! This round has 21  single player maps, 2  match maps, 3  CTF maps, and 2  Battle Arena maps, totaling 28 entries by 24 creators. Get into an aesthetic mindset, drop into the vapor dome, and get going! Be sure to  vote for your favorite maps when you’re finished playing.  Check it out!\n  Be aware that in SRB2 v2.2.9, there are some visual errors with the character swappers. These issues are fixed in the upcoming patch, v2.2.10. Other various bugs are present in some of the submitted maps. Patches for these maps are likely coming sometime in early January. For now, we’ve eliminated every soft lock and crash we could find, so the pack should be pretty stable.\n Please submit your votes before   January 16th, 2022 @ 6:59 PM EST (23:59 UTC). Thanks to all our contestants, and have fun!\n  Hello everybody! Round 1 of this year’s contest has been a great success. Let’s see the results!\n The winners of the single player division are Othius, Inazuma, and Spectorious with their entry, Hollow Hill Zone. This mysterious place is full of strange liquid. Players can climb up streams of it by jumping up. One section of the level has a very cool shrine that collapses. The stage has fun slopes to spin off of and nice custom assets to look at. Congratulations, all three of you!\n   Congratulations to MK.exe for winning the Match division with Uncharted Badlands Zone! Congratulations to Ruberjig and Apollyon Woman for winning the Battle CTF division with Metallic Madness Zone!\n  You can view the full contest results  here. If you haven’t checked out this contest pack yet, you can download it  here.\n Thanks to everyone who participated in this contest!  The deadline for OLDC 2021 Round 2 is  December 1st, 2021 at 23:59 UTC (6:59 EST). See you then!\n  It’s that time again, folks! Well, rather, two days ago was that time again — I’m late to post this. But that doesn’t mean it isn’t still that time! That’s right,  the Official Level Design Contest is back for another exciting installment! Come on down and experience some brand-new, never-before-seen maps! We’ve got  single player maps, we’ve got  match maps, and we’ve got  battle CTF maps, totaling 23 entries by 22 creators! What wonders await in the mysterious asteroid base? Who will win the trophy for each game type? Are you a bad enough dude to  vote for your favorite maps? I sure hope you are, and  if you are, then  click right here to get started!\n  Phew…ahem. Now that the sales pitch is out of the way, I’d like to highlight some quality-of-life features new to this iteration of the OLDC. Here’s what our contest staff has whipped up:\n Press &amp; hold the Fire button in single player mode to return to the hub\n At the time of writing, we advise players not to use the return to hub function while standing close to a star post unless they would like to spawn in an erroneous location upon their return. There are a couple other minor bugs with the new features that contest staff are working to fix, and we hope to push said fixes soon.\n Be sure to submit your votes before   June 26th, 2021 @ 6:59 PM EST (23:59 UTC). Thanks to all our contestants, and may the best maps win!\n  Hello everybody! Thanks to community feedback, we were able to find and fix some major errors preventing players from properly enjoying the game on Android devices.  If you were getting nothing but a black screen in OpenGL mode, this could be the patch for you! The  changelog is short, so I’ll copy the whole thing:\n Fix the user being able to open the console in situations where it should not open\n  Hey. 2.2.9’s out. Grab it at  the usual place. It’s late, so I’ll just paraphrase some of the more interesting lines from  the changelog:\n Fixed an error when loading addons with custom savedata via the command line (notably, when testing from Zone Builder).\n   Added multitag library for Lua, which allows reading and manipulation of tags on mapthings, lines and sectors; also added tag iterator functions.\n        Pausing the game is no longer possible during the score tally screen in Marathon Mode.\n  Added acronym keywords to Co-op levels. For use with the map command, so e.g. you can warp to Green Flower 1 with map GFZ1.\n  Fixed an issue with the installer executables where you wouldn’t always be asked where you want to install the game.\n There are lots of bug fixes and other quality-of-life things in this patch. We hope you enjoy it.\n  After over a decade, the SRB2 Message Board is finally upgraded to a modern interface. Gone are the days of the broken ratings system. No more shall we have to deal with a subpar experience on mobile browsers. We’re back, and we’re better than ever. We greatly appreciate your patience with us during the migration process.\n We hope you like the new  Addons &amp; More system. There’s way too much to say about it for a single news post, so check out the  instructions on how to submit files to it as well as these  answers to some questions about it you probably have. If your addon somehow didn’t make it into Addons &amp; More, please let us know!\n “So, what other new features are on the new message board?” you might ask. First, one of the more obvious features: the ability to react to posts. Just click the “Cool!” button at the bottom of a post to let the post author know you like it. (It doesn’t do anything else, but they might get a notification for it, which could give them warm and fuzzy feelings.)\n You now have the ability to set a banner that displays on your profile and on the profile preview that appears if someone hovers over your profile picture. If you’re not sure what to set it to, may I suggest a screenshot of your favorite map?\n Another fun feature is native support for emoji. Click the smiley face in the post editor to browse available emoji. There’s a text box in it to make searching for emoji easier. We added some custom ones that you might recognize from our Discord server.\n We’ve also added an extension for the code block BBcode that lets you denote what language your code uses as well as highlight any lines you want. The code language is set to Lua by default, and several more languages are available.\n There are a bunch of new styles to pick from, including ones for every character in SRB2, with more on the way. The style selector is still on the bottom left of every page, just like the old forum.\n Contest winners will now see their wins displayed on their profiles. These trophies are part of the badges system. We will continue adding badges for every OLDC, but any other new badges will be few and far between. Winners of the most recent contest will also get a yellow banner under their name instead of a yellow username. With all these styles, we decided it’s best to keep all usernames the same color.\n Finally, here’s a big one: you can now install the SRB2MB on your PC or mobile device as a web app. As far as I know, it only supports Android and Windows 10. The Install button should be on the top navigation bar or on the bottom of the side navigation bar if you’re on mobile. Opera doesn’t always seem to show the Install button, so try Chrome or another browser if you don’t see it. (No, it’s not on the Play store, silly goose!) The web app looks and feels identical to the website, and you can access the SRB2 home page and the wiki through it. Now our community can always be just a tap away!\n There is one small caveat: we still need to copy over info from v2.1 and v2.0 era addons so you can see which of them are reusable. This will take a while, so please bear with us!\n Well, that’s pretty much everything. I probably forgot a couple of minor things, but I’m sure you’ll find them eventually. I sincerely hope you all find the new message board to be an improvement. We’ve certainly done our best to meet that goal. If you have any questions, comments, concerns, or suggestions, please feel free to make a post in the Talk to the Staff subforum — we’d love to hear it.\n I’d like to close by extending my gratitude to everyone involved with the migration: AlamGBC, Alice, Boinciel, Charybdizs, D00D64, Inazuma, jameds, Larz T, LoganA, RoyKirbs, SteelT, and Varren. You guys are all wonderful!\n  Happy Valentine’s Day! We at Sonic Team Junior love our playerbase so much that we’re doing two cool things:\n We’re giving you a prerelease build of v2.2.9. Find it on our Discord server!\n We are finally migrating to the new message board software. In under 24 hours, the process will begin, and the message board will go down for maintenance. Goodbye, vBulletin! Hello, Xenforo!\n As always, thanks for sticking around and playing SRB2! We wouldn’t be where we are without you!\n  Hello everybody! The Autumn 2020 OLDC has come and gone. Before I congratulate the winners, I would like to go over some changes we will be making for future contests.\n The biggest change is that future contests will be twice per year instead of four times per year. We recognize that creating maps is harder and takes longer than it did when the OLDC was first created. We hope that giving mappers six months instead of three months to work on maps will result in more maps submitted to each contest, and that the maps are as high quality as the mappers can manage.\n In addition,  we will now require participants to include their Discord tag in their map submission posts (that is, your username — NOT a nickname — and the four numbers after it). This way, we can add participants to a special channel on the SRB2 Official Discord Server dedicated to answering their questions about the contest. This channel can also be used to keep contest staff up to date on fixes to your maps after the submission deadline has passed. We hope this will be easier than sending direct messages to contest staff regarding such topics, since individual staff members are not always online and/or available to help. (You may skip this if you do not have a Discord account, however.)\n  The winners of the single player division are Kwiin and Kanna with their entry, Foliage Furnace Zone. The map’s theme appears to be borrowed from another fangame called  Sonic: After the Sequel. I found this map somewhat challenging. Watch out for death pits and fast-moving platforms! It uses slopes in ways that feel very much at home in a Sonic game, and its texture work is good. Congratulations, Kwiin and Kanna!\n   Congratulations to Joe Mewstard for winning the Circuit division with Electric Avenue Zone! Congratulations to Krabs for winning the Battle Arena division with Stupid Facestabber Zone, as well as winning the Battle CTF division with GFZFLR01 Zone!\n  You can view the full contest results  here. If you haven’t checked out this contest pack yet, you can download it  here.\n Thanks to everyone who participated in this contest!  The deadline for OLDC 2021 Round 1 is June 1st, 2021 at 23:59 UTC (6:59 EST). See you then!\n  Hello everybody! I have good news and bad news. The bad news is that our message board will be going down for maintenance this weekend (December 26th &amp; 27th, 2020). The good news is that  this maintenance involves moving the message board to a new server. This should mean more stability, which is a much needed step in the process of upgrading to the new message board software.\n Please be aware that this means the ingame server browser will not be functional during this time. The best way to work around this is to join our Discord server. The place is never empty, and it’s a great way to find people to play netgames with.\n Since this is on such short notice, we have decided to extend the OLDC voting deadline by one week.  Please cast your votes by January 2nd, 2021, 6:59pm EST (11:59pm UTC).\n  Older Posts »", "posttime": "2022-02-15 02:57:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,sonic,地图", "title": "Sonic Robo Blast 2：基于Doom的3D开源Sonic the Hedgehog fangame", "title_en": "Sonic Robo Blast 2: a 3D open-source Sonic the Hedgehog fangame built on Doom", "transed": 1, "url": "https://www.srb2.org/", "via": "", "real_tags": ["开源", "sonic", "地图"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "起初，有一个密度无限的小球。然后，一切都爆炸了，产生了我们今天看到的原子、分子、恒星和星系。\n或者至少是&#39；这就是我们&#39；在过去的几十年里，物理学家一直在告诉我们。\n但新的理论物理研究最近揭示了一个可能的窗口，可以看到非常早期的宇宙，表明它可能不是#34；很早&#34；毕竟相反，它可能只是爆炸反弹周期的最新一次迭代，已经持续了……好吧，至少一次，甚至可能永远。\n当然，在物理学家决定放弃大爆炸而支持爆炸反弹循环之前，这些理论预测需要经受住观察测试的冲击。\n科学家们对非常早期的宇宙有一幅非常好的图景，这就是我们所知道和喜爱的大爆炸理论。在这个模型中，很久以前，宇宙比现在小得多，热得多，密度也大得多。在138亿年前的那场早期的地狱中，所有构成我们的元素都是在十几分钟内形成的。\n甚至在更早的时候，这种想法认为，在某个时刻，我们的整个宇宙——所有的恒星，所有的星系，所有的一切——都有一个桃子大小，温度超过万亿度。\n令人惊讶的是，这个奇幻的故事符合当前所有的观察结果。天文学家已经做了一切，从观察年轻宇宙的剩余电磁辐射到测量最轻元素的丰度，发现它们都符合大爆炸的预测。据我们所知，这是我们早期宇宙的准确写照。\n但尽管如此，我们知道大爆炸的图景并不完整——在那里&#39；这是一块缺失的拼图，这是宇宙本身最早的时刻。\n问题是，我们用来理解早期宇宙的物理学（广义相对论和高能粒子物理学的一个极其复杂的混合体）在崩溃之前，只能走这么远。当我们试图深入宇宙的最初时刻时，数学问题变得越来越难解决，一直到它…结束的时候。\n我们还有待探索的地形的主要迹象是&#34；奇点&#34；或者是宇宙大爆炸开始时的一个密度无限的点。从表面上看，这告诉我们，在某一点上，宇宙被塞进了一个无限小、无限稠密的点。这显然是荒谬的，它真正告诉我们的是，我们需要新的物理学来解决这个问题——我们目前的工具包就是不&#39；这还不够好。\n为了拯救这一天，我们需要一些新的物理学，能够以超高能量处理重力和其他力的结合。那&#39；这正是弦论所宣称的：一个能够以超高能量处理重力和其他力的物理模型。这意味着弦理论声称它可以解释宇宙最早的时刻。\n弦理论最早的概念之一是&#34；ekpyrotic和#34；宇宙，来自希腊语的&#34；火灾和#34；或者开火。在这个场景中，我们所知道的大爆炸是由之前发生的其他事情引发的——大爆炸不是一个开始，而是一个更大过程的一部分。\n扩展ekpyrotic的概念产生了一种理论，又一次受到弦理论的推动，称为循环宇宙学。我认为，从技术上讲，宇宙不断自我重复的想法已经有数千年的历史，而且比物理学更早，但弦论为这个想法提供了坚实的数学基础。循环宇宙的运行完全如你所想象的那样，在巨大的刘海和巨大的嘎吱声之间不停地弹跳，有可能回到过去的永恒，也有可能进入未来的永恒。\n尽管这听起来很酷，但循环模型的早期版本很难匹配观测值——这在你&#39；我们正在努力做科学研究，而不仅仅是在篝火旁讲故事。\n主要的障碍是与我们对宇宙微波背景的观察一致，这是宇宙只有38万年历史时遗留下来的化石光。而我们可以&#39；如果你从理论上开始对婴儿宇宙的物理进行修补，你就不会直接看到那堵光墙，你会影响余辉光的模式。\n但多年来，火把一直被点燃；在2020年3月发表在《物理评论D》杂志上的一篇论文中，研究人员探索了数学中的皱纹，发现了一些以前错过的机会。加拿大麦吉尔大学的物理学家罗伯特·布兰登伯格和王子伟发现&#34；反弹&#34；当我们的宇宙缩小到一个难以置信的小点，回到大爆炸状态时，它&#39；It’我们可以把所有的东西都排好，以得到正确的观测测试结果。\n换言之，这个关键时期的复杂（当然，人们对其了解甚少）物理学事实上可能允许对我们在宇宙中的时间和位置进行根本性的修改。\n但为了全面测试这个模型，我们&#39；我们必须等待新一代的宇宙学实验，所以让我们&#39；让我们等着开香槟吧。\n有关大爆炸理论的一般概述，请查看&#34；你在宇宙中的位置&#34；保罗·M·萨特著，该书涵盖了该理论的发展历史以及宇宙本身的历史。PBS时空视频系列有一段很棒的视频，探讨了可能导致大爆炸的原因。另一个由西蒙斯基金会发布的视频，描述了物理学家Paul Steinhardt解释大反弹的想法。\n温伯格，S.&#34；引力与宇宙学：广义相对论的原理与应用，&#34；威利；儿子们，1972年。https://www.amazon.com/Gravitation-Cosmology-Principles-Applications-Relativity/dp/0471925675\n保罗·M·萨特（Paul M.Sutter）是纽约州立大学石溪分校（SUNY Stony Brook）和Flatiron研究所（Flatiron Institute）的天体物理学家，Ask a Spaceman和空间电台的主持人，以及《你在宇宙中的位置》（Your Place in the Universe）一书的作者。", "note_en": "In the beginning, there was an infinitely dense, tiny ball of matter. Then, it all went bang, giving rise to the  atoms, molecules, stars and  galaxies we see today.\n  Or at least, that&#39;s what we&#39;ve been told by physicists for the past several decades.\n  But new theoretical physics research has recently revealed a possible window into the very early universe, showing that it may not be &#34;very early&#34; after all. Instead it may be just the latest iteration of a bang-bounce cycle that has been going on for … well, at least once, and possibly forever.\n   Of course, before physicists decide to toss out the  Big Bang in favor of a bang-bounce cycle, these theoretical predictions will need to survive an onslaught of observation tests.\n   Scientists have a really good picture of the very early universe, something we know and love as the   Big Bang theory. In this model, a long time ago the universe was far smaller, far hotter and far denser than it is today. In that early inferno 13.8 billion years ago, all the elements that make us what we are were formed in the span of about a dozen minutes.\n  Even earlier, this thinking goes, at some point our entire universe — all the stars, all the galaxies, all the everything — was the size of a peach and had a temperature of over a quadrillion degrees.\n Amazingly, this fantastical story holds up to all current observations. Astronomers have done everything from observing the leftover   electromagnetic radiation from the young universe to measuring the abundance of the lightest elements and found that they all line up with what the Big Bang predicts. As far as we can tell, this is an accurate portrait of our early universe.\n But as good as it is, we know that the Big Bang picture is not complete — there&#39;s a puzzle piece missing, and that piece is the earliest moments of the universe itself.\n    The problem is that the physics that we use to understand the early universe (a wonderfully complicated mishmash of general   relativity and high-energy particle physics) can take us only so far before breaking down. As we try to push deeper and deeper into the first moments of our cosmos, the math gets harder and harder to solve, all the way to the point where it just … quits.\n The main sign that we have terrain yet to be explored is the presence of a &#34;singularity,&#34; or a point of infinite density, at the beginning of the Big Bang. Taken at face value, this tells us that at one point, the universe was crammed into an infinitely tiny, infinitely dense point. This is obviously absurd, and what it really tells us is that we need new physics to solve this problem — our current toolkit just isn&#39;t good enough.\n  To save the day we need some new physics, something that is capable of handling gravity and the other forces, combined, at ultrahigh energies. And that&#39;s exactly what string theory claims to be: a model of physics that is capable of handling gravity and the other forces, combined, at ultrahigh energies. Which means that string theory claims it can explain the earliest moments of the universe.\n One of the earliest string theory notions is the &#34;ekpyrotic&#34; universe, which comes from the Greek word for &#34;conflagration,&#34; or fire. In this scenario, what we know as the Big Bang was sparked by something else happening before it — the Big Bang was not a beginning, but one part of a larger process.\n Extending the ekpyrotic concept has led to a theory, again motivated by string theory, called cyclic cosmology. I suppose that, technically, the idea of the universe continually repeating itself is thousands of years old and predates physics, but   string theory gave the idea firm mathematical grounding. The cyclic universe goes about exactly as you might imagine, continually bouncing between big bangs and big crunches, potentially for eternity back in time and for eternity into the future.\n  As cool as this sounds, early versions of the cyclic model had difficulty matching observations — which is a major deal when you&#39;re trying to do science and not just telling stories around the campfire.\n The main hurdle was agreeing with our observations of the cosmic microwave background, the fossil light leftover from when the universe was only 380,000 years old. While we can&#39;t see directly past that wall of light, if you start theoretically tinkering with the physics of the infant cosmos, you affect that afterglow light pattern.\n  But the ekpyrotic torch has been kept lit over the years; and in a paper published in March 2020 in the journal  Physical Review D, researchers explore the wrinkles in the   mathematics and uncovered some previously missed opportunities. The physicists, Robert Brandenberger and Ziwei Wang of McGill University in Canada, found that in the moment of the &#34;bounce,&#34; when our universe shrinks to an incredibly small point and returns to a Big Bang state, it&#39;s possible to line everything up to get the proper observationally tested result.\n In other words, the complicated (and, admittedly, poorly understood) physics of this critical epoch may indeed allow for a radically revised view of our time and place in the cosmos.\n But to fully test this model, we&#39;ll have to wait for a new generation of cosmology experiments, so let&#39;s wait to break out the ekpyrotic champagne.\n   For a general overview of the Big Bang theory, check out &#34;  Your Place in the Universe &#34; by Paul M. Sutter, which covers the history of the development of the theory alongside the history of the universe itself. The PBS Spacetime video series has   a great video exploring the options for what may have caused the Big Bang.   Another video, published by the Simons Foundation, features physicist Paul Steinhardt explaining the Big Bounce idea.\n  Weinberg, S. &#34;Gravitation and Cosmology: Principles and Applications of the General Theory of Relativity,&#34; Wiley &amp; Sons, 1972.   https://www.amazon.com/Gravitation-Cosmology-Principles-Applications-Relativity/dp/0471925675\n Paul M. Sutter  is an astrophysicist at   SUNY  Stony Brook and the Flatiron Institute, host of   Ask a Spaceman  and   Space Radio , and author of   Your Place in the Universe .", "posttime": "2022-02-15 02:53:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "爆炸,big,宇宙", "title": "大爆炸之前发生了什么？", "title_en": "What happened before the Big Bang?", "transed": 1, "url": "https://www.livescience.com/what-came-before-big-bang.html", "via": "", "real_tags": ["爆炸", "big", "宇宙"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "背景：https://mobiledevmemo.com/apple-to-developers-heads-i-win-tails-you-lose/", "note_en": "Context: https://mobiledevmemo.com/apple-to-developers-heads-i-win-tails-you-lose/", "posttime": "2022-02-15 02:49:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,苹果,apple,platform,https", "title": "解释苹果将向开发者收取27%的平台外支付佣金", "title_en": "Explaining that Apple will charge devs 27% commission for off-platform payments", "transed": 1, "url": "https://www.youtube.com/watch?v=_hSJBih5NLU", "via": "", "real_tags": ["开发", "苹果", "apple", "platform", "https"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你&#39；在手机上重读这篇文章，你可能可以触摸并按住上面的号码，让你的手机为你提供apop up功能表，并提供一个呼叫选项。你&#39；不客气。", "note_en": "FWIW, if you&#39;re reading this on a cell phone, you might be able totouch and hold on the numbers above, getting your phone to give you apop-up menu with an option to call them. You&#39;re welcome.", "posttime": "2022-02-15 02:49:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,phreak,提供", "title": "仍然有效的phreak号码，都是安全免费的", "title_en": "Still-active phreak numbers, all safe and free", "transed": 1, "url": "https://stormrider.io/odd-numbers.html", "via": "", "real_tags": ["免费", "phreak", "提供"]}]