[{"category": "", "categoryclass": "", "imagename": "f388e6a282cdc96cfe83dec81b9e973c.jpg", "infoid": 1066946, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个有趣的错误：安全研究员发现，仔细制作的网络名称导致IOS的网络堆栈中的错误，可以完全禁用iPhone连接到Wi-Fi的能力。\n 在Twitter上，Carl Schou显示，在使用特定名称加入Wi-Fi网络后（“％P％S％S％S％N”），iPhone上的所有Wi-Fi功能都被禁用了该点。\n  一旦iPhone或iPad与名称“％p％s％s％s％n”加入网络，设备就无法连接到Wi-Fi网络或使用AirDrop等系统网络功能。重新启动设备后，此问题仍然存在（尽管解决方法确实存在，请参阅下文）。\n 虽然Schuo没详细详述他如何弄明白，但任何程序员都应该注意触发错误所需的时髦网络名称中的模式。\n 以下是可能的解释：“％[字符]'语法通常用于编程语言，以将变量格式化为输出字符串。在C中，“％n”说明符是指将写入格式字符串写入的字符数，以将传递给字符串格式函数的变量。 Wi-Fi子系统可能将不陈述的Wi-Fi网络名称（SSID）传递给执行字符串格式的某些内部库，这又导致任意内存写入和缓冲区溢出。这将导致内存损坏，iOS看门狗将杀死此过程，因此有效地禁用用户的Wi-Fi。\n 显然，这是一种晦涩难以置疑的事件，即任何人都不太可能意外地落入这方面，除非有一堆Wi-Fi Pranksters突然用毒出的名称突然打开Wi-Fi网络突然弹出。直到Apple在未来的操作系统更新中修复了此边缘案例，直到您的名称中的任何Wi-Fi网络留出了任何符号。\n 尽管如此，如果您以某种方式影响了这一点，错误似乎不会损坏硬件。 \n您应该能够重置所有网络设置并重新开始。 在设置中，转到一般 - ＆gt; 重置 - ＆gt; 重置网络设置。 这将在iPhone上重置所有已保存的Wi-Fi网络（以及蜂窝设置和VPN访问等其他内容），从而从内存中删除恶意网络名称的知识。 然后，您可以再加入您的标准家庭Wi-Fi。  在将我的个人WiFi加入SSID“％p％s％s％s％s％之后”后，我的iPhone永久禁用它是WiFi功能。 既不重新启动也不改变SSID修复它：〜）pic.twitter.com/2eue90jfu3  您正在阅读9To5MAC  - 在日复一日的日复一日地打破苹果及其周围生态系统的新闻的专家。 请务必查看我们的主页，以了解所有最新消息，然后在Twitter，Facebook和LinkedIn上关注9to5Mac以留在循环中。 不知道从哪里开始？ 查看我们的独家故事，评论，How-TO，以及订阅我们的YouTube频道 ", "note_en": "Here’s a funny bug: a security researcher has found that a carefully crafted network name causes a bug in the networking stack of iOS and can completely disable your iPhone’s ability to connect to Wi-Fi.\n On Twitter,  Carl Schou showed that after joining a Wi-Fi network with a specific name (“%p%s%s%s%s%n”), all Wi-Fi functionality on the iPhone was disabled from that point on.\n  Once an iPhone or iPad joins the network with the name “%p%s%s%s%s%n”, the device fails to connect to Wi-Fi networks or use system networking features like AirDrop. The issue persists after rebooting the device (although a workaround does exist, see below).\n Although Schuo does not detail exactly how he figured this out, any programmer should notice a pattern in the funky network name required to trigger the bug.\n Here’s the likely explanation: the ‘%[character]’ syntax is commonly used in programming languages to format variables into an output string. In C, the ‘%n’ specifier means to save the number of characters written into the format string out to a variable passed to the string format function. The Wi-Fi subsystem probably passes the Wi-Fi network name (SSID) unsanitized to some internal library that is performing string formatting, which in turn causes an arbitrary memory write and buffer overflow. This will lead to memory corruption and the iOS watchdog will kill the process, hence effectively disabling Wi-Fi for the user.\n Obviously, this is such an obscure chain of events that it is highly unlikely that any person accidentally falls into this, unless a load of Wi-Fi pranksters suddenly pop up in the wild with open Wi-Fi networks using the poisoned name. Until Apple fixes this edge case in a future OS update, just keep an eye out for any Wi-Fi networks with percent symbols in their name.\n Nevertheless, If you  are somehow affected by this, the bug does not appear to permanently damage your hardware.\n You should be able to reset all network settings and start over. In Settings, go to General -&gt; Reset -&gt; Reset Network Settings. This resets all saved Wi-Fi networks on the iPhone (as well as other things like cellular settings and VPN access), thereby removing the knowledge of the malicious network name from its memory. You can then join your standard home Wi-Fi once more.\n After joining my personal WiFi with the SSID “%p%s%s%s%s%n”, my iPhone permanently disabled it’s WiFi functionality. Neither rebooting nor changing SSID fixes it :~)  pic.twitter.com/2eue90JFu3\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-06-20 06:00:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wifi,iphone,网络,network", "title": "指定的网络名称可以在iPhone上完全禁用WiFi ", "title_en": "A specific network name can completely disable Wi-Fi on your iPhone", "transed": 1, "url": "https://9to5mac.com/2021/06/19/a-specific-network-name-can-completely-disable-wi-fi-on-your-iphone/", "via": "", "real_tags": ["wifi", "iphone", "网络", "network"]}, {"category": "", "categoryclass": "", "imagename": "74cb257a11144d2e92ba421947404682.png", "infoid": 1066945, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "prelockd是一个守护程序，锁定内存映射可执行文件和内存中的共享库，以提高低内存条件下的系统响应性。\n  是否有可能保留用于缓存的固定（可配置的）RAM，并提前触发OOM杀手，在从内存中逐出大多数UI代码之前？在我的用例中，我很高兴牺牲。 0.5GB并在系统冻结之前杀死失控任务。潜在的Oom杀手也会在这种情况下更好地工作。我几乎从未在接近完整的内存容量，它＆＃39; s始终是一个出错的单一任务，并带来了系统。\n     没有缓存意味着所有可执行的页面，RO页面（例如字体）都是通过内存传导，并且必须在每个用户动作上不断重新加载。\n 确实是一个困难的问题 - 再次可能不需要Somecached页面（流IO），并且应该尽快丢弃，其他（如MBApped可执行文件/ RO页面）在高记忆压力下驱逐时会导致捶打。\n  我想尝试禁用/限制对某些/ AllFile页面的驱逐（例如Exec页面）类似于禁用交换，但没有这样的机制。是的，需要解决的RO MMAPPE文件可能会出现问题，但在许多应用程序中，用户将有兴趣获得此类选项。\n  一旦交换运行，内核就可以选择。它只能通过回收重要的缓存来腾出空间。这将很快变坏，因为它最终将包括必须在正常工作时加载的可执行文件/库！\n 所以，我们不希望将内核陷入其中必须从主内存中删除可执行文件/库的情况。如果发生这种情况，您最终可以击中每个函数调用的磁盘。 \n在这个视频上：在Debian 10 Gnome的循环中运行快速内存Hogs，4个Gib梅特特没有交换空间。  prelockd启用：大约500 mib mlocked。 开始虽然是真的; 尾/开/零; 完成：没有冻结。 OOM杀手快速，系统快速恢复。  它＆＃39;很容易使用最新的Git快照构建DEB包。 安装构建依赖项：  $ git clone https://github.com/hakavlad/prelockd.git＆amp;＆amp; CD prelockd $ sudo make install $ sudo systemctl启用--now prelockd.service ", "note_en": "prelockd is a daemon that locks memory mapped executables and shared libraries in memory to improve system responsiveness under low-memory conditions.\n  Would it be possible to reserve a fixed (configurable) amount of RAM for caches, and trigger OOM killer earlier, before most UI code is evicted from memory? In my use case, I am happy sacrificing e.g. 0.5GB and kill runaway tasks  before the system freezes. Potentially OOM killer would also work better in such conditions. I almost never work at close to full memory capacity, it&#39;s always a single task that goes wrong and brings the system down.\n     No caches means all executable pages, ro pages (e.g. fonts) are evictedfrom memory and have to be constantly reloaded on every user action.\n It is indeed a difficult problem - somecached pages (streaming IO) will likely not be needed again and shouldbe discarded asap, other (like mmapped executable/ro pages of UIutilities) will cause thrashing when evicted under high memory pressure.\n  I would like to try disabling/limiting eviction of some/allfile pages (for example exec pages) akin to disabling swapping, butthere is no such mechanism. Yes, there would likely be problems withlarge RO mmapped files that would need to be addressed, but in manyapplications users would be interested in having such options.\n  Once swap runs out, the kernel stops having a choice. It can only make room by reclaiming important caches. And this will turn bad quickly, as it will eventually include the executables/libraries that must be loaded as they are doing work!\n So, we don&#39;t want to get the kernel into the situation where it must remove executables/libraries from main memory. If that happens, you can end up hitting the disk for  every function call.\n      On this video: running fast memory hogs in a loop on Debian 10 GNOME, 4 GiB MemTotal without swap space.\n prelockd enabled: about 500 MiB mlocked. Starting  while true; do tail /dev/zero; done: no freezes. The OOM killer comes quickly, the system recovers quickly.\n        It&#39;s easy to build a deb package with the latest git snapshot. Install build dependencies:\n          $ git clone https://github.com/hakavlad/prelockd.git  &amp;&amp;  cd prelockd$ sudo make install$ sudo systemctl  enable --now prelockd.service", "posttime": "2021-06-20 06:00:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "prelockd,页面", "title": "普利克德 ", "title_en": "Prelockd", "transed": 1, "url": "https://github.com/hakavlad/prelockd", "via": "", "real_tags": ["prelockd", "页面"]}, {"category": "", "categoryclass": "", "imagename": "c38d6deb89436bee4f49b0fcceee0361.jpg", "infoid": 1066943, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "浴室大学开发了一种令人难以置信的轻盈新材料，可以减少飞机发动机噪音和提高乘客舒适度。石墨烯氧化物 - 聚乙烯醇气凝胶每立方米重量仅为2.1kg，使其成为有史以来最轻的隔音。它可以用作在减少噪声的绝缘度最多16分贝 - 减少射流的105分贝咆哮，从而靠近吹风机的声音。\n  气凝胶＆＃39; S的蛋白酥皮样结构使其变得非常轻盈，这意味着它可以充当飞机发动机垫圈内的绝缘体，总体重量几乎没有增加。目前，研究团队正在进一步优化，以提供改进，为燃油效率和安全提供益处。\n  来自浴室的研究人员和第39页的材料和结构中心（MAST）已发表一种制造本质上的材料的方法。\n  迈克雷教授领导了这项研究，说：＆＃34;这显然是一种非常令人兴奋的材料，可以在最初在航空航天中以多种方式应用，但可能在许多其他领域，如汽车和海运等许多领域如在建筑和建设中。\n   ＆＃34;我们设法通过使用石墨烯氧化物和聚合物的液体组合产生这种极低的密度，该聚合物形成有鲜泡的气泡和冷冻浇铸。在非常基本的水平上，可以将该技术与鞭打相比，以创建蛋白甜饼 - 它＆＃39; S solid但含有大量空气，因此没有重量或效率的惩罚来实现舒适和噪音的大改善。＆＃34 ;\n  虽然团队＆＃39;初始焦点正在与航空航天的合作伙伴合作，但是在飞机发动机中将材料作为一个声音绝缘体测试，他们说它也可以用于在直升机或汽车发动机中创建面板。他们估计气凝胶可以在18个月内使用。更多信息：Mario Rapisarda等，超广岛氧化物/聚乙烯醇气体用于宽带和可调声学特性，科学报告（2021）。 DOI：10.1038 / S41598-021-90101-0 ", "note_en": "An incredibly light new material that can reduce aircraft engine noise and improve passenger comfort has been developed at the University of Bath.    The graphene oxide-polyvinyl alcohol aerogel weighs just 2.1kg per cubic metre, making it the lightest sound insulation ever manufactured. It could be used as insulation within   to reduce noise by up to 16 decibels—reducing the 105-decibel roar of a jet   taking off to a sound closer to that of a hair-dryer.\n  The aerogel&#39;s meringue-like structure makes it extremely light, meaning it could act as an insulator within aircraft engine nacelles, with almost no increase in overall weight. The material is currently being further optimised by the research team to offer improved  , offering benefits to fuel efficiency and safety.\n  Researchers from Bath&#39;s Materials and Structures Centre (MAST) have published a method for manufacturing the materials in the journal Nature  Scientific Reports.\n  Professor Michele Meo, who led the research, says: &#34;This is clearly a very exciting material that could be applied in a number of ways—initially in aerospace but potentially in many other fields such as automotive and marine transport, as well as in building and construction.\n   &#34;We managed to produce such an extremely low density by using a liquid combination of graphene oxide and a polymer, which are formed with whipped air bubbles and freeze-casted. On a very basic level, the technique can be compared with whipping   to create meringues—it&#39;s solid but contains a lot of air, so there is no weight or efficiency penalty to achieve big improvements in comfort and noise.&#34;\n  Although the team&#39;s initial focus is in working with partners in aerospace to test the material as a sound insulator in aeroplane engines, they say it could also be used to create panels in helicopters, or car engines. They estimate that the aerogel could be in use within 18 months.        More information:\t\t\t\t\t\t\t\t\t\t\t\tMario Rapisarda et al, Ultralight graphene oxide/polyvinyl alcohol aerogel for broadband and tuneable acoustic properties,  Scientific Reports (2021).  DOI: 10.1038/s41598-021-90101-0", "posttime": "2021-06-20 05:17:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "吹风机,material,减少", "title": "酥皮样材料可以使飞机像吹风机一样安静 ", "title_en": "Meringue-like material could make aircraft as quiet as a hairdryer", "transed": 1, "url": "https://phys.org/news/2021-06-meringue-like-material-aircraft-quiet-hairdryer.html", "via": "", "real_tags": ["吹风机", "material", "减少"]}, {"category": "", "categoryclass": "", "imagename": "0f4db8a0224c93bdf389a4a378231b11.jpg", "infoid": 1066942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1级1如果Facebook持续那么长😂似乎Facebook每天都会脱离商业\n   2级问题是有没有一个可行的选择。所以他们只是留在商业中。它真的变老了它＆＃39。\n      等级1我也得到了这一点。删除的最后一篇文章发布了我在朋友中献血＆＃39;姓名，因为他在白血病和医院的医院和医院用献血的账户。\n Facebook大约两个月前删除了那个帖子的垃圾邮件，但没有办法吸引它。\n 2级即时通讯现在30天禁止。问题：我们应该杀死一个孩子治疗每种疾病吗？我的答案：我们应该只杀死真正的生活战利品皇家环境。\n 1级，字面上同样的事情发生在我身上。发布了1张照片，我是一个非常正常的贡献者，并在我的支持收件箱中没有留言，没有理由。\n   等级2我有同样的问题！当我发布时，它说＆＃34;限制从发布...... Bla Bla到12月4日＆＃34;但是当我检查我的支持收件箱时，我没有禁令通知，它说＆＃34;没有违规行为＆＃34;那么wtf？ \n2级是的！ 我在社区妈妈组中发表了关于一个飞溅垫的评论，然后收到这条消息。 WTF Facebook？  2级别我也是，我张贴了一个完全良性的关于一个建造在该地区的新房，下一件事我知道我有六个月的群体限制。 这是一个故障吗？  2级你可以报告它如果您进入您的支持收件箱，如果您拍摄了一个SS报告......我刚刚报道了我的，我正在等待回复......如果你没有＆＃39; T有一个SS试图张贴 一个小组，它将在您的主馈电屏幕中备份与相同的消息，然后您可以让SS将其发送到FB🤷🏻♀️... ", "note_en": "level 1  If facebook last that long 😂 it seems as if Facebook is putting itself out of business everyday\n   level 2  Problem is there isn&#39;t a viable option. So they just stay in business. It&#39;s really getting old.\n      level 1  I got this too. Last post removed was posting that I donated blood in a friend&#39;s name because he is in the hospital with Leukemia and the hospital credits his account with blood donations.\n Facebook removed that post about two months ago for spam, but there was no way to appeal it.\n level 2  Im on a 30 day ban right now. The question: should we kill one child to cure every single disease? My answer: we should just kill all the humans in a real life Battle Royale setting.\n level 1  Literally the same thing happened to me. Posted 1 photo to a group I am a very regular contributor of and banned with no message in my support inbox and no reason.\n   level 2  I have the same issue! When I posted it said &#34;restricted from posting...bla bla till december 4&#34; but when I check in my support inbox there I have no ban notification, it says &#34;no infractions&#34;. So wtf?\n  level 2  Yes! I made a comment about a splash pad in my community mom group and then got this message. Wtf facebook?\n level 2  Me too, I posted something completely benign about a new house being built in the area and next thing I know I have a six month restriction in groups. Is this a glitch?\n level 2  You can report it if you go into your support inbox if you took a SS report it... I just reported mine and I am waiting on response... If you don&#39;t have a SS try to post into a group and it will show back up in your main feed screen with the same message then you can get the ss to send it in to fb 🤷🏻‍♀️...", "posttime": "2021-06-20 05:17:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,禁止,banning", "title": "Facebook禁止了成千上万的人200米 ", "title_en": "Facebook banning thousands of people for 200M years", "transed": 1, "url": "https://www.reddit.com/r/facebook/comments/o35h3q/add_me_to_the_200_million_year_restricted_list", "via": "", "real_tags": ["facebook", "禁止", "banning"]}, {"category": "", "categoryclass": "", "imagename": "c4e48cde2cd91d5956303a67fefc0abe.png", "infoid": 1066941, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "爵士乐表演的典型微韵律特质是他们的“摇摆感。”根据几项研究，不均匀的第八章果断对这种感知的质量造成果断。在本文中，我们分析了鼓手暗示的摆动比（搏动比率）在骑行钹上暗示。延长以前的工作，我们提出了一种基于起始序列中的模式识别的半自动摆比估计方法。作为主要贡献，我们介绍了一种名为SwingSogrog的新型时间摆比表示，其局部地捕获与摆动比随时间相关的信息。基于这一表示，我们建议通过动态编程跟踪乘员钹图案随时间随时间的最合理的轨迹。我们展示了这种可视化如何导致有趣的见解进入爵士乐音乐家共同的特殊性。\n 引用这篇文章：Christian Dittmar，Martin Pfleider，Stefan Balke＆amp; MeinardMüller（2018）a\n      爵士乐表演的典型微韵力是他们的“摇摆感。”根据几项研究，\n 不均匀的八分音符果断地促进了这种感知质量。在本文中，我们分析了\n 鼓手在乘车钹上暗示的摆动比（拍摄比率）。延长以前的工作，\n   被称为SwingSogrog，当地捕获与摆动比随时间相关的信息。基于\n 这一表示，我们建议追踪乘坐摆动比的最合理的轨迹 \nCymbal模式随着时间的推移通过动态编程。我们展示了这种可视化如何引导\n                                                                     ©2018作者。由Informa Informa Informa Informa Limited，贸易为泰勒＆amp;弗朗西斯集团\n 这是在Creative Commons atticution-n Oncommercial-Noderivatives许可证的条款下分发的开放式访问文章（http://creativecommons.org/licenses/by-nc-nd/\n 4.0 /）允许在任何媒体中的非商业重复使用，分布和再现，只要正确引用原始工作，并且没有改变，转换或建立\n    图1.原型RC图案的插图作为鼓表示法（顶部），时域信号（中间）和LLACF（底部）。除了\n 黑季度注意事项，相关的第八章由浅绿色（onbeat）编码，孵化，浅红色（opotbeat）。 （a）S = 1的摆动比\n 对应于直的第八章节，即在持续时间同时和offbeat。 （b）S = 2的摆动比对应 \n理想化的Tied-Triplet表示法。 （c）摆动比S = 3，在那里可以将onbeat称为点缀第八章节和offbeat作为  onbeatioi和δb∈r>; 0是off beat ioi，即  公式δa=δa+ b·s·1 + +Δb=δa+ b·  （2）Δb≤δa，即o ff beat ioi预计将是  aτ：= | {∈[1：l]： - τ≤ε≤τ} | / l。 （10）  沿着速度轴，带有FI XED O FFΔB= 100的FF击败IOI  图9.从1960年录制'红色门'的独奏部分的摆动照相分析。 有关讨论，请参见第5.2.1节。 \n图10.从1961年录制“下”的独奏部分的摆动照相分析。有关讨论，请参见第5.2.2节。\n    图11. 1957年“蓝色火车”记录的独奏部分的摆动图分析。有关讨论，请参见第5.2.3节。\n        帕森斯，W.，＆amp; Cholakis，E。（1995）。它并不意味着它\n ...... Dittmar等。地址爵士乐[45,44]和Marchand等人的微观偏差。 [107]确定＆＃34;挥杆水平＆＃34;不同的类型。这些作品涉及完整的节奏模式 - 由两个八个音符组成 - 作者使用从ODF计算的自相关作为特征。 ......\n ...通过查看自相关，可以以简单的方式获取有关事件的相对位置的信息，同样，因为它通过群集不同的模式出现而完成的3.2.1。这些作品的作者提出了有趣的微观偏差的表示，例如摆动 - 比[107]或摆动图[44]，这些偏差[44]，这些偏差[44]旨在带来仪表和节奏以外的性能的信息。这种文献中的这种努力有助于关闭表征音乐表现的差距以及自动分析工具可以检索的内容。 ......\n ......图9.1图9.1示出了第十六注释级别的微量立场的示例。微观偏差与其他节奏尺寸之间的相互作用有助于被描述为作为＆＃39的感觉;挥杆＆＃39;或＆＃39; groove＆＃39; [44,107,37]。这些偏差的系统使用是许多音乐类型的节奏和风格配置的结构性重要性。 ......\n 计算节奏分析处理从音乐音频提取和处理有意义的节奏信息。它被证明是一种高度复杂的任务，因为处理真正的录音需要能够在多级表示中处理其声学和语义复杂度。现有的节奏分析方法通常集中在其中一个水平，未能利用音乐丰富的结构并损害自动估计的音乐一致性。在这项工作中，我们提出了用于利用用于计算节律分析的多尺度信息的新方法。我们的模型占据了音频自然传达的相互关联的依赖关系，允许在不同时间尺度之间的相互作用，并考虑它们对它们的音乐相干性。特别是，我们对下场跟踪系统进行了系统分析，导致卷积的反复性架构，该卷积架构利用短期和长期声学建模;我们介绍了一个用于下跳闸跟踪的跳过条件随机场模型，旨在利用统一框架中的音乐结构信息（即音乐部分重复）;我们提出了一种语言模型，用于联合跟踪非洲美洲广场音乐中的节拍和微观时机。我们的方法系统地在各种数据集上进行了系统地评估，从西方音乐到更具文化特定的类型，并与最先进的系统相比和更简单的变化。整体结果表明，我们的下跳闸跟踪模型与现有技术相提并论，同时更加音乐。此外，我们的联合估计的模型和微观的估计的模型需要进一步迈向更可接定的系统。这里提出的方法提供了用于计算节律分析的新颖和更全面的替代方案，朝着更全面的音乐自动分析。 \n...在某些情况下，音乐中的事件存在关于底层常规估计级格栅的小规模的时间偏差，这里的现象称为微调。微观偏差与其他节奏尺寸之间的相互作用有助于被描述为作为＆＃39的感觉;挥杆＆＃39;或＆＃39; groove＆＃39; [8,9,30]。这些偏差的系统使用是许多音乐类型的节奏和风格配置的结构性重要性。 ......\n ......系统使用这些偏差在许多音乐类型的节奏和风格配置中具有结构性重要性。这是爵士乐[9,10,20,38]，古巴伦巴[2]，巴西桑巴[32,39]和乌拉圭Candombe [22]等。因此，在不考虑微观的情况下分析这些音乐类型，导致对他们节奏的有限了解。 ......\n ......该提案利用一些简化：假设恒定的节奏和摆动比，并根据第一次节拍的最可能位置传播节拍位置。最近的工作执行半自动分析仍然依赖于知情的节奏[9,10]，或者使用外部算法进行估计[30]。在Candombe和Samba的背景下，也使用半自动或启发式方法解决了微观表征[17,22,32]。 ......\n 音乐中的事件经常表现出小规模的时间偏差（微立线），相对于潜在的常规韵律网格。在某些情况下，与来自美国黑人的传统中的音乐一样，这种偏差系统地展示了他们在节奏和风格配置中的结构性重要性。在这项工作中，我们探讨了在非洲拉丁美洲音乐的计时器文书中自动和共同跟踪击败和微观的想法，特别是巴西桑巴和乌拉圭Candombe。为此，我们提出了一种基于条件随机字段的语言模型，该字段将节拍和发出似然集成为观察。我们使用深度神经网络获得这些激活，并使用适用于此任务的方案评估其在手动注释的数据上的性能。我们在适用于这些计时器仪器的受控条件下评估我们的方法，并研究微观型曲线＆＃39;依赖流派和表演者，说明了这种技术的有希望的方面，以更全面地了解这些音乐传统。\n ...作为一个中央效益，计算方法使基于语料库的研究大规模。最近进行了几项研究，包括流行音乐[13]，爵士[1,6,9]和西方古典音乐[2,17,21,24]，以及在群集的领域[14， 16,19]。对于进行此类语料库研究，许多不同的方面很重要。 ......\n ...超出其尺寸和组成，音乐数据的表示构成了一个重要方面。例如，可以给出数据作为符号转录[9,16]，作为图形分数[17]，或者作为音频记录[6,13,18]。在本文中，我们调查了音乐表示类型对语料库分析结果的影响。 ......\n ...... WJD的主要好处在于它的独奏旋律（基本频率F0）的清洁注释，为系统实验创造了受控环境。该数据作为许多音乐学研究的基础，主要关注性能分析[1,6,9]。 ...... \nWarning: Can only detect less than 5000 characters\nMaracatu de Baque Solto＆＃34;是一个狂欢节绩效，结合了音乐，诗歌和舞蹈，在韦纳邦科（东北巴西东北）的Zona da Mata Norte地区发生。 Maracatu Percussive音乐强烈重复，并且尽可能响亮，尽可能快地播放。两者来自mir和民族武士学视角，这使得一个复杂的音乐景观来分析和解释。在本文中，我们专注于提取微观概况，以了解了解马拉卡特的节奏性能如何促进健康和福祉。进行该分析，我们使用一系列具有联系麦克风获取的录制，这最小化了表演者之间的干扰。我们的分析表明，微观型材的差异基本上与更广泛学习的南美音乐中观察到的那些不同。特别是，我们突出了动态微管型的存在以及考试器械选择的重要性，这决定了如何理解性能。在整个工作中，我们强调了多学科方法的重要性，其中MIR，音频工程和民族武器学必须互动，为此音乐提供有意义的洞察力。\n 音乐表现使声学的声音或组合物的其他表示的声学实现。相同的组合物的不同性能可能在诸如定时或动态的性能参数方面变化，并且这些变化可能对听众如何感知音乐产生重大影响。传统上，音乐性能的分析是MIR研究界的外围主题，通常使用单个音频录制作为音乐作业的代表。本文从包括测量性能参数的若干角度来调查音乐性能分析（MPA）领域，这些参数对动作的关系和对听众的表演者或感知效果的意图，最后评估音乐表现。本文还讨论了MIR，因为它与MIR有关，指出了两个领域的合作和未来研究的机会。\n 经济实惠的数字采样技术的出现带来了音乐制作的巨大变化。经验丰富的基于样品的电子音乐（SBEM）的生产商能够理解采样源与其在新轨道中的错综复杂的关系，利用其性质来塑造其组合物的结构，Timbre和节奏。然而，对SBEM的自动分析围绕SBEM和其用于其样本的来源是一项挑战，它涉及来自音乐信息检索（MIR）和音频处理的许多任务。在本文中，我们开发模型和技术，以更好地了解不同级别的SBEM。特别是，我们为检索和分析任务提供了四种主要的技术贡献。首先，我们探讨Timbral改变如何影响音频指纹用于识别重叠样本的方法的光谱峰值映射。其次，我们使用基于非负矩阵因子解卷（NMFD）的音频分解来分析典型SBEM轨迹的结构。第三，我们通过设计基于级联谐波残差源分离（CHRP）的中级音频功能来研究Timbre和结构的相互作用。第四，我们应用随机森林来识别典型的采样源：鼓休息。鉴于他们在SBEM中的突出角色，我们致力于鼓休息。作为计算音乐学的应用，我们将用于计算桶中的局部摆动比的算法正规化，并适应基于自相关的方法来分析它们的微小性能。最后，我们向音乐生产提出了一种创造性应用，这允许组合两个单独的鼓断裂的时间和时间特性（Redrumming）。尽管SBEM的商业大规模成功和抽样的做法，但它们主要仍然远远关注正式的学术研究和MIR研究。在本文中，我们的总体目标是识别和正规化与SBEM相关的一些基本音频处理任务，提出可以进行进一步研究的方法。\n 音乐构成一个具有挑战性的多媒体情景。除了音乐录制外，还有许多其他媒体对象，包括符号音乐表示，录像，扫描的乐谱或文本元数据。开发允许用户的工具\n...... ", "note_en": "A typical micro-rhythmic trait of jazz performances is their ‘swing feel.’ According to several studies, uneven eighth notes contribute decisively to this perceived quality. In this paper we analyze the swing ratio (beat-upbeat ratio) implied by the drummer on the ride cymbal. Extending previous work, we propose a new method for semi-automatic swing ratio estimation based on pattern recognition in onset sequences. As a main contribution, we introduce a novel time-swing ratio representation called swingogram, which locally captures information related to the swing ratio over time. Based on this representation, we propose to track the most plausible trajectory of the swing ratio of the ride cymbal pattern over time via dynamic programming. We show how this kind of visualization leads to interesting insights into the peculiarities of jazz musicians improvising together.\n To cite this article:  Christian Dittmar, Martin Pfleiderer, Stefan Balke &amp; Meinard Müller (2018) A\n      A typical micro-rhythmic trait of jazz performances is their ‘swing feel.’ According to several studies,\n uneven eighth notes contribute decisively to this perceived quality. In this paper we analyze the\n swing ratio (beat-upbeat ratio) implied by the drummer on the ride cymbal. Extending previous work,\n   called swingogram, which locally captures information related to the swing ratio over time. Based on\n this representation, we propose to track the most plausible trajectory of the swing ratio of the ride\n cymbal pattern over time via dynamic programming. We show how this kind of visualization leads\n                                                                     © 2018 The Author(s). Published by Informa UK Limited, trading as Taylor &amp; Francis Group\n This is an Open Access article distributed under the terms of the Creative Commons Attribution-N onCommercial-NoDerivatives License (http://creativecommons.org/licenses/by-nc-nd/\n 4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited, and is not altered, transformed, or built upon in\n    Figure 1.  Illustration of prototypical RC patterns as drum notation (top), time-domain signal (mid), and LLACF (bottom). Besides the\n black quarter notes, the relevant eighth notes are coded by light green (onbeat), and hatched, light red (offbeat). (a) Swing ratio of  s =1\n corresponding to straight eighth notes, i.e. onbeat and offbeat having the same duration. (b) Swing ratio of  s = 2 corresponding to\n the idealized tied-triplet notation. (c) Swing ratio  s = 3, where the onbeat can be notated as a dotted eighth note and the offbeat as a\n            the onbeat IOI and  δ b ∈ R &gt; 0 be the oﬀbeat IOI, i.e. the\n    the formulas  δ a = δ a + b · s·  1 + s  − 1 and  δ b = δ a + b ·\n                (2)  δ b ≤ δ a , i.e. the oﬀbeat IOI is expected to be\n                                                      A τ :=  |{  ∈[  1 : L ]:−  τ ≤ ε  ≤ τ }| / L . (10)\n            along the tempo axis with a ﬁxed oﬀbeat IOI of  δ b = 100\n    Figure 9.  Swingogram analysis of a solo-section from the 1960 recording of ‘The Red Door’. See Section  5.2.1  for discussion.\n Figure 10.  Swingogram analysis of a solo-section from the 1961 recording of ‘Down Under’. See Section  5.2.2  for discussion.\n    Figure 11.  Swingogram analysis of a solo-section from the 1957 recording of ‘Blue Train’. See Section  5.2.3  for discussion.\n        Parsons, W., &amp; Cholakis, E. ( 1995 ). It don’t mean a thing if it\n ... Dittmar et al. address microtiming deviations in jazz [45, 44], and Marchand et al. [107] determine the &#34;level of swing&#34; of diverse genres. These works are concerned with simpler rhythmic patterns-consisting of two eight-notes-and the authors use the autocorrelation computed from an ODF as feature. ...\n ... By looking at the autocorrelation one can obtain information about the relative position of events in a straightforward manner, similarly as it is done by clustering different pattern occurrences as in 3.2.1. The authors of these works propose interesting representations of microtiming deviations such as the swing-ratio [107] or the swingogram  [44], which intend to bring information about the performance other than meter and tempo. This kind of effort in the literature helps closing the gap between what characterizes a musical performance and what automatic-analysis tools can retrieve. ...\n ... 1 Figure 9.1 illustrates an example of microtiming at the sixteenth note level. The interaction between microtiming deviations and other rhythmic dimensions contribute to what has been described as the sense of &#39;swing&#39; or &#39;groove&#39;  [44,107,37]. The systematic use of these deviations is of structural importance in the rhythmic and stylistic configuration of many musical genres. ...\n Computational rhythm analysis deals with extracting and processing meaningful rhythmical information from musical audio. It proves to be a highly complex task, since dealing with real audio recordings requires the ability to handle its acoustic and semantic complexity at multiple levels of representation. Existing methods for rhythmic analysis typically focus on one of those levels, failing to exploit music’s rich structure and compromising the musical consistency of automatic estimations. In this work, we propose novel approaches for leveraging multi-scale information for computational rhythm analysis. Our models account for interrelated dependencies that musical audio naturally conveys, allowing the interplay between different time scales and accounting for music coherence across them. In particular, we conduct a systematic analysis of downbeat tracking systems, leading to convolutional-recurrent architectures that exploit short and long term acoustic modeling; we introduce a skip-chain conditional random field model for downbeat tracking designed to take advantage of music structure information (i.e. music sections repetitions) in a unified framework; and we propose a language model for joint tracking of beats and micro-timing in Afro-Latin American music. Our methods are systematically evaluated on a diverse group of datasets, ranging from Western music to more culturally specific genres, and compared to state-of-the-art systems and simpler variations. The overall results show that our models for downbeat tracking perform on par with the state of the art, while being more musically consistent. Moreover, our model for the joint estimation of beats and microtiming takes further steps towards more interpretable systems. The methods presented here offer novel and more holistic alternatives for computational rhythm analysis, towards a more comprehensive automatic analysis of music.\n ... In some cases, the events in music present small-scale temporal deviations with respect to the underlying regular metrical grid, a phenomenon here referred to as microtiming. The interaction between microtiming deviations and other rhythmic dimensions contribute to what has been described as the sense of &#39;swing&#39; or &#39;groove&#39; [8, 9,30]. The systematic use of these deviations is of structural importance in the rhythmic and stylistic configuration of many musical genres. ...\n ... The systematic use of these deviations is of structural importance in the rhythmic and stylistic configuration of many musical genres. This is the case of jazz  [9,10,20,38], Cuban rumba [2], Brazilian samba [32,39] and Uruguayan candombe [22], among others. Consequently, the analysis of these music genres without considering microtiming leads to a limited understanding of their rhythm. ...\n ... The proposal exploits some simplifications: assuming constant tempo and swing ratio, and propagating beat positions based on the most likely position of the first beat. More recent works perform semi-automatic analysis still relying on informed tempo  [9,10], or using an external algorithm for its estimation [30]. Within the context of candombe and samba, microtiming characterization has also been addressed using either semi-automatic or heuristic methods [17,22,32]. ...\n Events in music frequently exhibit small-scale temporal deviations (microtiming), with respect to the underlying regular metrical grid. In some cases, as in music from the Afro-Latin American tradition, such deviations appear systematically , disclosing their structural importance in rhythmic and stylistic configuration. In this work we explore the idea of automatically and jointly tracking beats and microtiming in timekeeper instruments of Afro-Latin American music, in particular Brazilian samba and Uruguayan candombe. To that end, we propose a language model based on conditional random fields that integrates beat and onset likelihoods as observations. We derive those activations using deep neural networks and evaluate its performance on manually annotated data using a scheme adapted to this task. We assess our approach in controlled conditions suitable for these timekeeper instruments, and study the microtiming profiles&#39; dependency on genre and performer, illustrating promising aspects of this technique towards a more comprehensive understanding of these music traditions.\n ... As one central benefit, computational methods enable corpus-based studies on a large scale. Several studies have been conducted recently for different music genres including pop music [13], jazz [1, 6,9], and Western classical music [2,17,21,24], and also in the field of ethnomusicology [14,16,19]. For conducting such corpus studies, a number of different aspects are important. ...\n ... Beyond its size and composition, the representation of the music data constitutes an important aspect. For example, the data can be given as a symbolic transcription [9,16], as a graphical score [17], or as an audio recording  [6,13,18]. In this paper, we investigate the influence of the music representation type on the corpus analysis results. ...\n ... A major benefit of the WJD lies in its clean annotations of the solo melody (fundamental frequency, F0), which create a controlled environment for systematic experiments. The data served as basis for a number of musicological studies, which mainly focus on performance analysis [1, 6,9]. ...\n For musicological studies on large corpora, the compilation of suitable data constitutes a time-consuming step. In particular, this is true for high-quality symbolic representations that are generated manually in a tedious process. A recent study on Western classical music has shown that musical phenomena such as the evolution of tonal complexity over history can also be analyzed on the basis of audio recordings. As our first contribution, we transfer this corpus analysis method to jazz music using the Weimar Jazz Database, which contains high-level symbolic transcriptions of jazz solos along with the audio recordings. Second, we investigate the influence of the input representation type on the corpus-level observations. In our experiments , all representation types led to qualitatively similar results. We conclude that audio recordings can build a reasonable basis for conducting such type of corpus analysis.\n ... Moreover, music recommender systems could use the data to better rate the danceability and rhythmic similarity between different songs. Going more into musicological research, there is a high interest in determining microrhythmic properties such as swing, shuffle and groove [16]-  [18] inherent in music recordings. Robust ADT in conjunction with precise estimation of onset times (see discussion in Sect. ...\n ... For example, if the desired output is a musical score or tabulature, the time resolution for the detected onsets can be relatively coarse as onset times are quantized based on the smallest increment within a metrical grid (i.e., 16th or 32nd notes), for these kind of representations. For other applications, like analysis of (un-)intentional variation of onset timings by human performers (e.g.,for humanization), musicological studies of micro-timing [16]-  [18], or extraction of a precise symbolic representation (e.g.,MIDI files), a greater precision is required. Perceptionally, the lower bound of the time-gap which allows humans to identify two click sounds as separate is somewhere in the range of 8 -10 ms [90]. ...\n In Western popular music, drums and percussion are an important means to emphasize and shape the rhythm, often defining the musical style. If computers were able to analyze the drum part in recorded music, it would enable a variety of rhythm-related music processing tasks. Especially the detection and classification of drum sound events by computational methods is considered to be an important and challenging research problem in the broader field of Music Information Retrieval. Over the last two decades, several authors have attempted to tackle this problem under the umbrella term Automatic Drum Transcription (ADT). This paper presents a comprehensive review of ADT research, including a thorough discussion of the task-specific challenges, categorization of existing techniques, and evaluation of several state-of-the-art systems. To provide more insights on the practice of ADT systems, we focus on two families of ADT techniques, namely methods based on Non-negative Matrix Factorization and Recurrent Neural Networks. We explain the methods&#39; technical details and drum-specific variations and evaluate these approaches on publicly available datasets with a consistent experimental setup. Finally, the open issues and under-explored areas in ADT research are identified and discussed, providing future directions in this field.\n ... Dynagrams and tempograms, for example, are used to visualize various temporal levels of loudness and tempo variations, respectively.  Dittmar et al. (2018) devised swingogram representations by analyzing and tracking the swing ratio implied by the ride cymbal in jazz swing performance. This visualization enables insights into jazz improvisation such as the interaction between a soloist and the drummer. ...\n A musical performance renders an acoustic realization of a musical score or other representation of a composition. Different performances of the same composition may vary in terms of performance parameters such as timing or dynamics, and these variations may have a major impact on how a listener perceives the music. The analysis of music performance has traditionally been a peripheral topic for the MIR research community, where often a single audio recording is used as representative of a musical work. This paper surveys the field of Music Performance Analysis (MPA) from several perspectives including the measurement of performance parameters, the relation of those parameters to the actions and intentions of a performer or perceptual effects on a listener, and finally the assessment of musical performance. This paper also discusses MPA as it relates to MIR, pointing out opportunities for collaboration and future research in both areas.\n ... Microtiming deviations and their variation across time have been studied in the context of time-keeper instruments (e.g., in Brazilian samba [12], Uruguayan candombe [18], and jazz  [21]). While previous approaches focus on within-instrument rhythmic patterns, we also explore the microtiming generated between time-keepers and nontime-keeper instruments. ...\n Maracatu de baque solto&#34; is a Carnival performance combining music, poetry, and dance, occurring in the Zona da Mata Norte region of Pernambuco (Northeast Brazil). Maracatu percussive music is strongly repetitive, and is played as loud and as fast as possible. Both from an MIR and ethnomusicological perspective this makes a complex musical scene to analyse and interpret. In this paper we focus on the extraction of microtiming profiles towards the longer term goal of understanding how rhythmic performance in Maracatu is used to promote health and well-being. To conduct this analysis we use a set of recordings acquired with contact microphones which minimise the interference between performers. Our analysis reveals that the microtiming profiles differ substantially from those observed in more widely studied South American music. In particular, we highlight the presence of dynamic microtim-ing profiles as well as the importance of the choice of timekeeper instrument, which dictates how the performances can be understood. Throughout this work, we emphasize the importance of a multidisciplinary approach in which MIR, audio engineering, and ethnomusicology must interact to provide meaningful insight about this music.\n A musical performance renders an acoustic realization of a musical score or other representation of a composition. Different performances of the same composition may vary in terms of performance parameters such as timing or dynamics, and these variations may have a major impact on how a listener perceives the music. The analysis of music performance has traditionally been a peripheral topic for the MIR research community, where often a single audio recording is used as representative of a musical work. This paper surveys the field of Music Performance Analysis (MPA) from several perspectives including the measurement of performance parameters, the relation of those parameters to the actions and intentions of a performer or perceptual effects on a listener, and finally the assessment of musical performance. This paper also discusses MPA as it relates to MIR, pointing out opportunities for collaboration and future research in both areas.\n The advent of affordable digital sampling technology brought about great changes in music production. Experienced producers of sample-based electronic music (SBEM) are capable of understanding the intricate relationship between a sampled source and its use in a new track, harnessing its properties to shape the structure, timbre, and rhythm of their compositions. However, automated analysis of the phenomena surrounding both SBEM and the sources it uses for its samples is a challenge which involves many tasks from music information retrieval (MIR) and audio processing. In this thesis we develop models and techniques to better understand SBEM at different levels. In particular, we offer four main technical contributions to retrieval and analysis tasks. First, we explore how timbral changes affect the spectral peak maps used in audio fingerprinting as a means to identify overlapping samples. Second, we analyze the structure of typical SBEM tracks using audio decomposition based on non-negative matrix factor deconvolution (NMFD). Third, we investigate the interaction of timbre and structure by designing a mid-level audio feature based on cascaded harmonic-residual-percussive source separation (CHRP). Fourth, we apply random forests to identify the quintessential sampling source: drum breaks. Given their prominent role in SBEM, we devote considerable attention to drum breaks. As an application to computational musicology, we formalize an algorithm for calculating local swing ratio in drum breaks and adapt an autocorrelation-based method to analyze their microrhythmic properties. Finally, we present a creative application to music production which allows combining the temporal and timbral properties of two separate drum breaks (redrumming). Despite the massive commercial success of SBEM and the practice of sampling, they mostly remain outside the attention of formal academic studies and MIR research. In this thesis our overarching goal is to identify and formalize some of the fundamental audio processing tasks related to SBEM, proposing methods that can seed further research.\n Music constitutes a challenging multimedia scenario. Besides music recordings, there exist a number of other media objects including symbolic music representations, video recordings, scanned sheet music, or textual metadata. Developing tools that allow user\n......", "posttime": "2021-06-20 04:35:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,爵士乐,micro,音乐", "title": "跟踪爵士乐性能的微韵律变异（2017） ", "title_en": "Tracking Micro-Rhythmic Variation in Jazz Performances (2017)", "transed": 1, "url": "https://www.researchgate.net/publication/319392963_A_Swingogram_Representation_for_Tracking_Micro-Rhythmic_Variation_in_Jazz_Performances", "via": "", "real_tags": ["性能", "爵士乐", "micro", "音乐"]}]