[{"category": "", "categoryclass": "", "imagename": "0d6c0e5368313cef638c922bcd86f402.png", "infoid": 1008987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2005年6月作为在线讨论网站首次推出。15年后的今天，它终于采取行动，正式禁止仇恨言论和宣扬仇恨言论的团体。\n周一宣布的一项修订后的Reddit内容政策明确规定，禁止“煽动暴力或煽动基于身份或脆弱性的仇恨”的群组或用户。它说：“每个人都有权使用Reddit，不受骚扰、欺凌和暴力威胁。”\nReddit表示，随着内容政策的更新，该公司最初将禁止约2000个Subreddit，其中大部分是非活跃的。此次清洗包括支持唐纳德·特朗普的论坛The_Donald，该论坛因用户发布种族主义、歧视女性、反伊斯兰和反犹太主义内容而臭名昭著。唐纳德一度拥有近80万活跃用户。\n2015年，Reddit采取了一项新的内容政策，并禁止了几个公然带有种族主义色彩的Subreddits。但直到今天，官方规定仍然没有明确禁止仇恨或种族主义论坛。\nReddit首席执行官兼联合创始人史蒂夫·赫夫曼(Steve Huffman)在一篇关于新政策的帖子中表示，在支持网站社区和版主采取全面的反仇恨政策方面，“我承认我们做得不够”。\n赫夫曼写道：“我们致力于与你们合作，打击破坏我们使命的不良行为、辱骂行为和有毒社区，这些社区的存在完全是为了阻碍创造力、讨论和社区的存在，而正是这些创意、讨论和社区将我们所有人带到了Reddit。”\n一个模因说有色人种有投票权是令人恶心的。\n赫夫曼写道：“Reddit上的所有社区都必须真诚地遵守我们的内容政策。”该公司禁止了_Donald“，因为尽管有每一个机会，但它没有这样做。该社区一直在托管和提升比平均水平更多的违规内容“，并”激怒了我们和其他社区“。规模较小的ChapoTrapHouse也因为类似的原因被禁止。\n_Donald和ChapoTrapHouse在2019年就已经被该网站“隔离”了。根据Reddit的说法，这意味着他们“由于报告和解决违反Reddit的反暴力规则和内容政策其他方面的重大问题而受到限制。”Reddit的隔离处罚向Subreddits发出警告，阻止他们创造收入，并将他们的帖子排除在搜索和推荐之外。\n根据Reddit的数据，在因仇恨言论而被删除的2000名次级红人中，只有10%的人每天有超过10名活跃用户。在那些被禁的群体中，最活跃的10个群体(除了_Donald和ChapoTrapHouse之外)是：黑色幽默和迷因；消费产品；黑色笑话中心；性别批判；闹市区；走向地狱2；沃加克；和大豆男孩。\n在Reddit采取这一最新举措之前，多年来一直有批评人士呼吁该网站打击仇恨言论，而且在警察击毙乔治·弗洛伊德(George Floyd)后，全国范围内都在举行种族正义抗议活动。\nReddit禁止仇恨言论的新政策将“边缘化或弱势群体”定义为包括那些“基于他们实际和感知的种族、肤色、宗教、国籍、族裔、移民身份、性别、性别认同、性取向、怀孕或残疾”的群体。它还特别包括“重大暴力事件的受害者及其家人”，比如2012年康涅狄格州桑迪·胡克小学(Sandy Hook Elalization School)大规模枪击事件中遇害儿童的父母，他们一直是右翼阴谋论者的目标，他们奇怪地声称那次袭击是一场恶作剧。\n然而，根据Reddit的说法，仇恨言论禁令“并不能保护所有群体或所有形式的身份。”例如，该网站说，“这项规定不保护占多数或鼓吹这种仇恨袭击的群体。”\nReddit更新的内容政策还明确了一项新的要求，要求用户“遵守社区规则”，要求他们像赫夫曼所说的那样，“以真实的个人兴趣发表帖子”。该规则禁止旨在在子Reddit中“作弊或从事内容操纵”的活动，包括垃圾邮件、投票操纵、禁令规避或订阅者欺诈，以及任何其他“干扰或扰乱Reddit社区”的活动。\nReddit表示，截至2019年底，其月平均访问量超过4.3亿，月页面浏览量为210亿。", "note_en": "first launched as an online discussion site in June 2005. Now, 15 years later, it has finally taken action to officially ban hate speech and groups that promote it.\n A revised Reddit content policy, announced Monday, explicitly states that groups or users that “incite violence or that promote hate based on identity or vulnerability” are prohibited. “Everyone has a right to use Reddit free of harassment, bullying and threats of violence,” it says.\n With the updated content policy, Reddit is initially banning about 2,000 subreddits, most of which are inactive, the company said. Included in the purge is The_Donald, a pro-Donald Trump forum notorious for users posting racist, misogynistic, anti-Islam and anti-Semitic content. At one point, The_Donald had nearly 800,000 active users.\n In 2015, Reddit adopted a  new content policy and banned several blatantly racist subreddits. But until today, the official rules still did not explicitly forbid hate or racist forums.\n Reddit CEO/co-founder Steve Huffman, in an post about the new policy, said “I admit we have fallen short” in supporting the site’s communities and moderators with respect to adopting a comprehensive anti-hate policy.\n  “We are committed to working with you to combat the bad actors, abusive behaviors, and toxic communities that undermine our mission and exist solely to get in the way of the creativity, discussions, and communities that bring us all to Reddit in the first place,” Huffman wrote.\n  A meme saying it is sickening that people of color have the right to vote.\n “All communities on Reddit must abide by our content policy in good faith,” Huffman wrote. The company banned The_Donald “because it has not done so, despite every opportunity. The community has consistently hosted and upvoted more rule-breaking content than average” as well as “antagonized us and other communities.” The smaller ChapoTrapHouse was banned for similar reasons.\n Both The_Donald and ChapoTrapHouse already had been “quarantined” by the site in 2019. According to Reddit, that means they were “restricted due to significant issues with reporting and addressing violations of Reddit’s rules against violence and other aspects of the Content Policy.” Reddit’s quarantining penalty puts a warning in front of subreddits, prevents them from generating revenue, and excludes their posts from appearing in search and recommendations.\n Of the 2,000 subreddits removed for hate speech, only 10% have more than 10 active daily users, according to Reddit. The 10 most active groups among those banned (in addition to The_Donald and ChapoTrapHouse) are: darkhumorandmemes; consumeproduct; darkjokecentral; gendercritical; cumtown; imgoingtohellforthis2; wojak; and soyboys.\n The latest move by Reddit comes after years of critics calling for the site crack down on hate speech, and amid nationwide protests for racial justice after the police killing of George Floyd.\n  The new Reddit policy banning hate speech defines “marginalized or vulnerable groups” as including those “based on their actual and perceived race, color, religion, national origin, ethnicity, immigration status, gender, gender identity, sexual orientation, pregnancy, or disability.” It also specifically includes “victims of a major violent event and their families,” such as parents of kids killed the 2012 mass shooting at Connecticut’s Sandy Hook Elementary School, who have been targeted by right-wing conspiracy theorists bizarrely claiming the attack was a hoax.\n However,  according to Reddit, the hate-speech ban “does not protect all groups or all forms of identity.” The site says, for example, that “the rule does not protect groups of people who are in the majority or who promote such attacks of hate.”\n Reddit’s updated content policy also spells out a new requirement that users “abide by community rules,” asking them to, as Huffman put it, “post with authentic, personal interest.” The rule prohibits activity intended to “cheat or engage in content manipulation” in a subreddit, including spamming, vote manipulation, ban evasion, or subscriber fraud, as well as anything else to “interfere with or disrupt Reddit communities.”\n Reddit said it averaged more than 430 million monthly visitors and 21 billion monthly page views as of the end of 2019.", "posttime": "2020-06-30 21:39:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "暴力,violent,reddit", "title": "Reddit最终禁止仇恨言论，删除2000个种族主义和暴力论坛", "title_en": "Reddit Finally Bans Hate Speech, Removes 2,000 Racist and Violent Forums", "transed": 1, "url": "https://variety.com/2020/digital/news/reddit-bans-hate-speech-groups-removes-2000-subreddits-donald-trump-1234692898/", "via": "", "real_tags": ["暴力", "violent", "reddit"]}, {"category": "", "categoryclass": "", "imagename": "20edf1e811fdf90831c3cb11c8a898f9.jpg", "infoid": 1008984, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果在2020年2月单方面做出的一项决定在整个浏览器领域产生了反响，有效地迫使证书颁发机构(Certificate Authority)行业痛苦地接受了TLS证书398天的新默认期限。\n在苹果最初宣布后，Mozilla和Google也表示了类似的意图，将在他们的浏览器中实施同样的规则。\n从2020年9月1日开始，苹果、谷歌和Mozilla的浏览器和设备将对寿命超过398天的新TLS证书显示错误。\n这一举措非常重要，因为它不仅改变了互联网的核心部分--tls证书--的运作方式，还因为它背离了正常的行业惯例以及浏览器和CA之间的合作。\n这是一个由证书颁发机构(CA)、颁发用于支持HTTPS通信的TLS证书的公司和浏览器制造商组成的非正式组织，称为CA/B论坛。\n自2005年以来，该小组一直在制定关于TLS证书应该如何颁发以及浏览器应该如何管理和验证它们的规则。\n浏览器和CA通常讨论即将到来的规则，直到他们达成共识，然后他们通过所有成员都执行的规则。\n然而，纵观TLS 15年的历史，有一个话题每次被提起都总是惹恼人--这就是TLS证书的寿命。\nTLS的使用寿命从8年开始，多年来，浏览器制造商一直在逐步缩小它的使用寿命，将其降至5年，然后降至3年，然后降至2年。\n上一次变化发生在2018年3月，当时浏览器制造商试图将SSL证书的寿命从三年减少到一年，但在遭到CA的积极抵制后，妥协了两年。\n但距离他们将TLS的使用寿命从三年缩短到两年还不到一年，浏览器制造商再次尝试，这让CA们感到沮丧，他们当时认为他们达成了妥协，并将此事搁置一边。\n正如ZDNet去年夏天报道的那样，浏览器供应商再次尝试将TLS证书的寿命从两年提高到一年。2019年9月，谷歌呼吁对这项提案进行投票，但以失败告终。虽然这项提议获得了浏览器制造商100%的支持，但只有35%的CA投票批准了一年的TLS证书有效期。\n但在2月份，苹果违反了CA/B论坛的标准操作程序。苹果没有呼吁进行投票，而是简单地宣布了在其设备上实施398天寿命的决定，而不管CA/B论坛中的CA对这个问题的看法。\n两周后，Mozilla宣布了同样的消息，本月早些时候，谷歌也发布了类似的声明。\n简而言之，今年发生的事情证明了浏览器制造商控制了CA/B论坛，他们完全控制了HTTPS生态系统，CA只是参与者，没有实际权力。\n今年发生的事情也被HashedOut预测到了，HashedOut是一个致力于CA行业的CA友好新闻网站。\n该网站在2019年8月，也就是投票前一个月写道，如果CA投票否决了这项措施(2019年9月的投票)，浏览器可能会单方面采取行动，无论如何都会强制改变。\n它补充说，这并非没有先例，但在一个传统上像这样的合议性问题上也从未发生过。如果是这样的话，问CA/B论坛的意义是什么就变得公平了。因为在这一点上，浏览器基本上是由法令统治的，整个过程将只是一场闹剧。\n在局外人看来，所有这一切看起来都像是一些关于技术细节的愚蠢的戏剧和一场权力的戏剧。然而，浏览器制造商一直在努力争取更短的TLS证书是有原因的。\n规范是，一旦TLS证书被恶意软件、网络钓鱼或其他操作滥用，证书应由CA吊销。\n然而，在实践中，证书吊销过程多年来一直是乱七八糟的，很少有CA及时吊销证书，而不良证书多年来仍然有效，允许坏人在多次操作中使用和重复使用相同的证书。\n浏览器制造商辩称，通过缩短TLS证书的寿命，这些证书将更快地失效，即使它们是由松散的CA颁发的。\n此外，还有流量解密的问题。浏览器制造商预计，在未来的某个时候，威胁制造者将能够解密他们今天记录的HTTPS流量。\n浏览器制造商希望通过使用有效期较短的证书来保护流量，从而使这一过程对攻击者来说更加耗费资源。\nCA一直在与寿命较短的问题作斗争，因为他们认为这些问题实际上都不会有什么不同，因为恶意软件操作人员在使用过TLS证书一次后往往会放弃这些证书，特别是现在，因为许多公司在各种优惠和计划下提供免费的TLS证书。\n更短的生命周期只会给他们的IT团队带来更多的工作，并改变他们认为应该保持不变的行业标准--因为这就是标准应该如何工作，保持不变，而不是每年都更新。\n尽管如此，这个问题已经决定了，对于整个过程的结果，CA们远不满意。在CA/B论坛2020年5月的一次会议上，一些CA对苹果的决定做出了公开回应，许多CA的语气并不积极。\n另一家认证机构D-TRUST表示，它也被迫遵守这一新的TLS使用期限，但他们明确表示，他们不认为缩短证书使用期限会带来任何安全收益或其他好处。\n回复还在继续，用同样被动攻击性的语气回答。是的，我们会这么做，但我们对此并不满意。\n对于证书颁发机构：如果他们希望在此日期之后颁发的TLS证书在Apple、Google和Mozilla浏览器中得到认可，证书的有效期不能超过398天，否则证书将发出错误并断开连接。", "note_en": "A decision that Apple unilaterally took in February 2020 has reverberated across the browser landscape and has effectively strong-armed the Certificate Authority industry into bitterly accepting a new default lifespan of 398 days for TLS certificates.\n Following  Apple&#39;s initial announcement,  Mozilla and  Google have stated similar intentions to implement the same rule in their browsers.\n Starting with September 1, 2020, browsers and devices from Apple, Google, and Mozilla will show errors for new TLS certificates that have a lifespan greater than 398 days.\n  The move is an important one because it not only changes how a core part of the internet works -- TLS certificates -- but also because it breaks away from normal industry practices and the cooperation between browsers and CAs.\n Known as the CA/B Forum, this is an informal group made up of Certificate Authorities (CAs), the companies that issue TLS certificates used to support HTTPS traffic, and browser makers.\n   Since 2005, this group has been making the rules on how TLS certificates should be issued and how browsers are supposed to manage and validate them.\n Browsers and CAs usually discussed upcoming rules until they reached a common ground, and then they passed rules that all members implemented.\n   However, across its 15-year history, there&#39;s been one topic that has always ruffled the feathers every time it has been brought up -- and that&#39;s the lifespan of TLS certificates.\n TLS lifespans started at eight years, and through the years, browser makers have chipped away at it, bringing it down to five, then to three, and then to two.\n The previous change occurred in March 2018, when browser makers tried to reduce SSL certificate lifespans from three years to one but compromised for two years after an aggressive pushback from CAs.\n But barely a year passed since they cut the TLS lifespan from three to two years, and browser makers tried again, to the dismay of CAs, who, at that point, thought they reached a compromise and put the matter to bed.\n As ZDNet reported last summer, browser vendors tried again to bring the lifespan of TLS certificates from two to one year. The vote on this proposal, called by Google,  failed in September 2019. While the proposal gained 100% support from browser makers, only 35% of CAs voted to approve a one-year TLS certificate lifespan.\n  But in February, Apple broke standard CA/B Forum operating procedure. Instead of calling for a vote, Apple simply announced its decision to implement 398-day lifespans on its devices, regardless of what the CAs in the CA/B Forum thought of the issue.\n Two weeks later, Mozilla announced the same, and earlier this month, Google also followed through with a similar announcement.\n  What took place this year is, in no simpler words, a demonstration that browser makers control the CA/B Forum, and that they hold full control of the HTTPS ecosystem, and that CAs are merely participants with no actual power.\n What happened this year was also predicted by HashedOut, a CA-friendly news site dedicated to the CA industry.\n &#34;If the CAs vote this measure down [the September 2019 ballot], there&#39;s a chance the browsers could act unilaterally and just force the change anyway,&#34;  the site wrote in August 2019, a month before the vote.\n &#34;That&#39;s not without precedent, but it&#39;s also never happened on an issue that is traditionally as collegial as this,&#34; it added. &#34;If it does, it becomes fair to ask what the point of the CA/B Forum even is. Because at that point the browsers would basically be ruling by decree and the entire exercise would just be a farce.&#34;\n  To outsiders, all of this looks like some silly drama over technicalities and a play for power. However, there is a reason why browser makers have been pushing hard for shorter TLS certificates.\n  The norm is that once a TLS certificate has been abused for malware, phishing, or other operations, the certificate should be revoked by CAs.\n However, in practice, the certificate revocation process  has been a mess for years, with very few CAs revoking certificates in time, and bad certificates remaining valid for years, allowing bad guys to use and re-use the same cert for multiple operations.\n Browser makers argued that by reducing the TLS certificate lifespan, these certificates would become invalid faster, even if they were issued by slacking CAs.\n Furthermore, there is also the issue of traffic decryption. At one point in the future, browser makers anticipate that threat actors will be able to decrypt the HTTPS traffic they are logging today.\n By securing traffic with shorter-lasting certificates, browser makers hope to make this process more resource-intensive for attackers.\n CAs have been fighting against shorter lifespans because they believe none of these issues  actually make a difference, as malware operations tend to abandon TLS certificates after they used them once, especially now since many companies provide free TLS certificates under various offers and programs.\n Shorter lifespans just create more work for their IT teams and change industry standards that they believe should remain unchanged -- as this is how standards are supposed to work, by remaining the same, not by getting updated every year.\n Nonetheless, the issue has been decided, and CAs are nowhere near satisfied as to how the entire process played out. In a May 2020 meeting of the CA/B Forum, some CAs provided public responses to Apple&#39;s decision, and many didn&#39;t have a positive tone.\n  D-TRUST, another CA, said that it, too, was forced to comply with this new TLS lifespan, but they made it clear they didn&#39;t see &#34;any security gain or other benefits by shortening the certificate lifetime.&#34;\n  And the replies go on, in the same passive-aggressive tone of &#34;yeah, we&#39;ll do it, but we&#39;re not happy about it.&#34;\n  For certificate authorities: If they want the TLS certificates they issue after this date to be recognized in Apple, Google, and Mozilla browsers, the certificates must not have a lifespan that exceeds 398 days or the certificate will issue an error and connections will be dropped.", "posttime": "2020-06-30 21:37:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,强力,strong,ca", "title": "苹果强力推动整个CA行业进入一年证书寿命", "title_en": "Apple Strong-Arms Entire CA Industry Into One-Year Certificate Lifespans", "transed": 1, "url": "https://www.zdnet.com/article/apple-strong-arms-entire-ca-industry-into-one-year-certificate-lifespans/", "via": "", "real_tags": ["苹果", "apple", "强力", "strong", "ca"]}, {"category": "", "categoryclass": "", "imagename": "02c71cd11f1995a10289ac80ba918917.jpg", "infoid": 1008983, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊周一表示，将向为公司工作至6月的一线员工发放5亿美元的一次性奖金。一线员工是感染冠状病毒风险最高的员工。\n这一举措对该公司来说显然是一个逆转，此前数周，该公司因在大流行仍在继续的情况下削减冠状病毒危险薪酬而受到批评。亚马逊在3月中旬首次实施更高的工资后，在6月初取消了工人每小时2美元的危险津贴。危险工资的增加已经让公司损失了数亿美元。\n公司负责全球运营的高级副总裁戴夫·克拉克(Dave Clark)周一在给员工的一封信中写道：过去几个月，我们的一线运营团队经历了令人难以置信的旅程，我们想用一份特别的一次性感谢奖金来表达我们的感激之情。\n亚马逊的全职员工、全食超市(Whole Foods)员工和送货服务合作伙伴司机将获得500美元，而他们的兼职员工将获得250美元。亚马逊和全食超市(Whole Foods)担任领导职务的员工将获得1000美元，送货服务合作伙伴所有者将获得3000美元，6月份工作超过10小时的亚马逊Flex司机将每人获得150美元。\n这场流行病在亚马逊的员工中造成了不信任，一些人抗议这家电商巨头对病毒的健康和安全反应。工人和13个州的总检察长呼吁亚马逊公布更详细的冠状病毒病例和员工死亡信息。\n5月初，亚马逊还取消了一项广受欢迎的冠状病毒计划，该计划允许员工无限制地无薪休假，这成为亚马逊管理层和员工之间的另一个摩擦点。\n该公司已经制定了各种安全措施来保护仓库员工，包括提供口罩和消毒剂，以及进行体温检查。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "Amazon on Monday said it&#39;s paying out $500 million in  one-time bonuses to front-line employees -- those most at risk of contracting the   coronavirus -- who worked for the company through June.\n The move is an apparent reversal for the company following weeks of criticism for it cutting its coronavirus hazard pay even as the pandemic has continued. Amazon had eliminated its $2-an-hour hazard pay for workers at the start of June, after it first instituted the higher wages in mid-March. That hazard pay increases had already cost the company hundreds of millions of dollars.\n &#34;Our front-line operations teams have been on an incredible journey over the last few months, and we want to show our appreciation with a special one-time thank you bonus,&#34; Dave Clark, the company&#39;s SVP for worldwide operations, wrote in a note to workers Monday.\n  Full-time Amazon workers, Whole Foods employees and Delivery Service Partner drivers will get $500, while their part-time counterparts will receive $250. Amazon and Whole Foods employees in leadership positions will get $1,000, Delivery Service Partner owners will get $3,000 and Amazon Flex drivers who worked more than 10 hours in June will each get $150.\n The pandemic has   created distrust among Amazon&#39;s workforce, with some protesting the e-commerce giant&#39;s health and safety response to the virus. Workers and  13 state attorneys general have called on Amazon to   release more detailed information on coronavirus cases and deaths among its employees.\n At the start of May, Amazon also eliminated a popular coronavirus program that allowed workers to take unlimited unpaid time off, which has become another point of friction between Amazon management and employees.\n The company has instituted a variety of safety measures to protect warehouse employees, including providing masks and sanitizers and doing temperature checks.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-06-30 21:37:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冠状病毒,病毒,amazon,亚马逊,coronavirus", "title": "亚马逊将向接触冠状病毒最多的工人支付5亿美元奖金", "title_en": "Amazon To Pay $500 Million in Bonuses To Workers Most Exposed To Coronavirus", "transed": 1, "url": "https://www.cnet.com/news/amazon-to-pay-500-million-in-bonuses-for-workers-most-exposed-to-coronavirus/", "via": "", "real_tags": ["冠状病毒", "病毒", "amazon", "亚马逊"]}, {"category": "", "categoryclass": "", "imagename": "5d4507037a7899db704f78926be1b089.jpg", "infoid": 1008982, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "并不是每个人在闭上眼睛和唤起思想时都能在脑海中看到画面--我们中的许多人都认为这是一种理所当然的能力。\n虽然人们早在19世纪就意识到了这一现象，但还没有得到广泛的研究，直到最近才被命名为失语症。这种自愿产生的心理视觉意象的缺失被认为是2-5%的人经历过的。\n最近的研究表明，失语症确实是缺乏视觉意象，而不是缺乏对拥有内部视觉意象的意识-一些人在受伤后经历了这种能力的丧失。\n来自澳大利亚新南威尔士大学(新南威尔士大学悉尼分校)的认知神经学家阿列克谢·道斯说：我们发现失语症不仅仅与缺乏视觉意象有关，还与其他重要认知过程的广泛变化模式有关。\nDawes和他的同事询问了667人(其中267人自称为失语症患者)，对视觉化、记忆力、梦境和对创伤的反应进行了一系列8份问卷调查。\n这其中包括“视觉意象的生动程度”问卷--你可以在“幻想症网络”(Aphantasia Network)上找到该问卷的一个版本--参与者被要求对记忆的生动程度进行评分，从1分没有图像，我只知道我正在回忆的记忆从1分到5分，和正常视觉一样生动。\n据报道，失语症患者回忆过去、想象未来，甚至做梦的能力都降低了。道斯解释说，这表明视觉意象可能在记忆过程中起着关键作用。\n失语症患者不仅做梦的次数减少了，他们的梦也不那么生动，感觉上的细节也更少。\n新南威尔士大学未来思维实验室主任、认知神经学家乔尔·皮尔逊说，这表明，任何涉及感觉视觉成分的认知功能--无论是自愿的还是非自愿的--在失语症中都很可能会减弱，认知神经学家乔尔·皮尔森(Joel Pearson)是新南威尔士大学未来思维实验室的主任。\n研究小组在论文中写道，我们的数据还显示，失语症患者不仅报告无法可视化，而且平均而言，在所有其他感觉方式中，包括听觉、触觉、动觉、味觉、嗅觉和情感，他们报告的意象都相对减少。\n这支持了失语症患者探索自己失语症经历的个人报告。Aphantasic Alan Kendle分享了他意识到，与他不同的是，其他人可以听到他们脑海中播放的音乐的那一刻。\n起初我无法理解，在脑海中播放音乐的能力对我来说是非同寻常的-几乎就像电视上看到的魔术一样，他写道。\n但并非所有患有视觉失语症的人都没有其他感官想象，这表明我们体验内心的方式存在差异。\n研究人员指出，由于他们的研究依赖于自我报告，所以他们的结果可能会受到回应偏差的影响，即单向认同自己的人会根据他们认为身份认同的方式回答问题。\n但研究结果的其他方面表明，自我报告可能不会显著影响结果：答案不同，加上数据表明，空间能力-一种绘制物体之间关系和距离的能力-在志愿者中似乎没有受到影响。\n道斯总结道，我们才刚刚开始了解那些没有图像的人的内心世界有多么截然不同。\n关于我们每个人是如何体验内心世界的，还有很多需要探索的地方。如果你认为你可能有失语症，你可以通过在这里报名来帮助研究人员更多地了解这种现象。", "note_en": "Not everyone can see pictures in their minds when they close their eyes and summon thoughts - an ability many of us take for granted.\n While people have been aware of this phenomenon since the 1800s, it hasn&#39;t been widely studied, and was  only recently named &#39;aphantasia&#39;. This absence of voluntarily generated mental visual imagery is thought to be experienced by 2-5 percent of the population.\n   Recent studies suggest aphantasia is indeed a  lack of visual imagery rather than the lack of  awareness of having internal visual imagery - with some people experiencing loss of this ability after injuries.\n  &#34;We found that aphantasia isn&#39;t just associated with absent visual imagery, but also with a widespread pattern of changes to other important cognitive processes,&#34;  said cognitive neuroscientist Alexei Dawes from Australia&#39;s University of New South Wales (UNSW Sydney).\n Dawes and colleagues asked 667 people (267 of them who self-identified as having aphantasia) a series of eight questionnaires on visualisation, memory, dreaming, and response to trauma.\n This included the Vividness of Visual Imagery Questionnaire - you can find a version of that  here at  The Aphantasia Network - where participants were asked to rate the level of vividness of memories from one: &#34;no image at all, I only &#39;know&#39; that I am recalling the memory&#34; to five: &#34;as vivid as normal vision&#34;.\n &#34;People with aphantasia reported a reduced ability to remember the past, imagine the future, and even dream. This suggests that visual imagery might play a key role in memory processes,&#34;  explained Dawes.\n   Not only did aphantasics dream less often, their dreams were less vivid and had lower sensory details.\n &#34;This suggests that any cognitive function involving a sensory visual component – be it voluntary or involuntary – is likely to be reduced in aphantasia,&#34;  said cognitive neuroscientist Joel Pearson, director of UNSW Future Minds Lab.\n  &#34;Our data also showed that individuals with aphantasia not only report being unable to visualise, but also report comparatively reduced imagery, on average, in all other sensory modalities, including auditory, tactile, kinesthetic, taste, olfactory and emotion,&#34; the team wrote  in their paper.\n This backs up  personal reports from aphantasics exploring their own experiences with aphantasia. Aphantasic Alan Kendle shares the moment he realised that, unlike him, other people can hear music playing in their minds.\n &#34;I could not comprehend it initially, the ability to play music in the mind for me, was extraordinary – almost like a magic trick seen on television,&#34; he  wrote.\n But not all of those with visual aphantasia had their other sensory imaginings missing, suggesting variations in this way of experiencing our inner minds.\n   The researchers note that as their study relied on self-reporting so their results may be influenced by response biases, where people who identify themselves one way will answer questions according to how they believe that identity would.\n But other aspects of the findings suggest self-reporting may not be biasing the results that significantly: there were variations in answers coupled with data suggesting that spatial abilities - an ability to map relationships and distances between objects - appear to be unaffected in the volunteers.\n &#34;We&#39;re only just starting to learn how radically different the internal worlds of those without imagery are,&#34;  concluded Dawes.\n There is still so much to explore about how we each experience our internal minds&#39; world. If you think you might have aphantasia, you can help researchers understand more about this phenomenon by signing up  here.", "posttime": "2020-06-30 21:36:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "东西,mind,失语症", "title": "头脑中看不到东西的人也可能有记忆问题", "title_en": "People Who Can't See Things in Their Mind Could Have Memory Trouble Too", "transed": 1, "url": "https://www.sciencealert.com/some-people-can-t-picture-things-in-their-mind-and-it-might-make-it-hard-for-them-to-remember", "via": "", "real_tags": ["东西", "mind", "失语症"]}, {"category": "", "categoryclass": "", "imagename": "ba2edbc447453a76ca8065f152eec994.jpg", "infoid": 1008981, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着基于ARM的更高性能云计算的出现，人们越来越关注各种竞争对手在这一领域能做些什么。我们已经介绍了Ampere Computing以前的eMag产品，这些产品实际上来自于对Application Micro的收购，但下一代硬件被称为Altra，在对一些高性能计算进行了几个月的梳理后，该公司终于宣布了它的产品列表，以及即将于今年进行抽样的产品。\nAmpere的Altra是ARM的Neoverse N1企业核心的实现版本，与亚马逊的Graviton2非常相似，但这一次采用的是80核的配置。Graviton2旨在满足亚马逊对基于ARM的实例的需求，而Ampere的目标基本上是向其他大型云服务提供商(CSP)提供比Graviton2更好的解决方案。在致力于基于N1的设计的公司中，到目前为止，纸面上的安培是账面上最大、速度最快的公司。\n作为今天发布的产品的一部分，Ampere Altra系列将提供从32核到80核的部件，最高可达3.3 GHz，各种TDP最高可达250 W。正如我们在芯片上先前的新闻中所描述的，这是一款ARM v8.2内核，具有几个8.3+8.5功能，支持FP16和INT8，支持8通道DDR4-3200 ECC(每通道2个DIMM)，在1P或2P中每个插槽最多4 TiB内存。每个CPU将提供128个PCIe 4.0通道，其中32个可用于通过PCIe使用CCIX协议实施的套接字到套接字通信。这意味着每个方向50 Gb/s，以及用于附加卡的双插槽系统中的192个PCIe 4.0通道。每条PCIe通道都可以向下分支到x2。\n我必须把功劳归功于安培。这是我见过的最简单的产品命名方案。仅从这个命名方案中，英特尔就可以学到一百万件事。“q”代表水银，即底层SoC的代号，后跟核心计数和频率。\n此前，安培曾表示，他们的目标是在3.0 GHz，210W的80核，然而Q80-33正在将该频率再推300 MHz，再增加40W，我们了解到台积电的硅流出性能比预期的要好，因此推出了这个新的顶级处理器。\n在能效方面做一些基本的衡量标准是值得的。如果我们将TDP单独视为内核的功率，并对每核的瓦数做一些计算，那么Q80-33 SKU最高的Q80-33 SKU得分为1.06，处于中间位置(大多数CPU得分为0.95-1.25 GHz/W)。该指标列表中的亮点是Q64-24，它以最低的功耗提供了最高的频率：1.62 GHz/瓦。\n此外，仅仅因为我们有这些数字，AMD的大型罗马CPU在满载时每个内核的功耗约为3W，并且在所有CPU上的运行速度约为3.0 GHz。相比之下，Altra在Q80-30上的每个内核使用2.6W。这些Altra CPU没有涡轮增压机制，因此，Ampere给出的TDP指标是针对实际峰值功耗数字，因此上面列出的只是机箱制造的设计点，而不是部署在云中时功耗的完整表示。\nAmpere表示，他们有一些ODM将准备提供Altra系统，包括Gigabyte和Wiwynn，还有几个二线玩家也在混合中。这些系统应该在8月和9月更容易获得。\n当我们询问Ampere对这些芯片的兴趣时，该公司表示，CSP的兴趣实际上主要集中在高端双插槽部署上，即内核数量最高、频率最高的产品。尽管Ampere没有公开宣布价格，但该公司表示，他们的价格并不是CSP部署的障碍，主要客户已经对硬件进行了长达2个月的测试。目前宣布的客户包括Packet和CloudFlare，Packet为其关键客户提供早期访问。\nAmpere也是ARM上CUDA的主要合作伙伴之一，当与NVIDIA图形加速器配合使用时，它将为Altra提供全面的CUDA支持。\n如果这还不够，安培还在我们的预告简报会上说了一大堆金块。该公司将于今年晚些时候推出128核版本的Altra。\n这将是一种新的硅设计，超越了安培最初为Altra设计的80个内核，然而安培表示，虽然他们使用与常规Altra相同的平台，但他们已经在Altra Max的网状网互连中进行了广泛的调整和优化，以隐藏使用相同主内存速度时可能出现的额外争用。\nAltra Max将与Altra兼容插座和引脚，还支持双插座部署，Ampere表示，硅将在第四季度准备好与合作伙伴进行早期采样，并希望在2021年年中进入大批量生产。128核设计被赋予了代号Mystique，因此我们可能会期待看到这些CPU以字母M开头。\n正如之前报道的那样，安培的下一代产品线将使用代号Siryn(SIRE-INN)，并将基于台积电的5 nm工艺，将于2021年末进行采样。Ampere在我们的简报中表示，打算在Siryn中采用的使用IP的测试芯片已经流片-实际的Siryn芯片将在明年的某个时候流片。\nSiryn很可能会被称为“第二代Altra”，如果CPU的命名约定保持不变，这些将从“S80”开始，等等。安培已经表示，Siryn平台将是新的，特别是因为新技术(提到了PCIe 5.0和DDR5，但没有确认是否支持Siryn)。\n帖子点击了一条评论，认为这是关于Nvidia Ampere的，他们重新命名了SMS&34；Cores&34；或者是我弄错了什么。回覆\n一样！我有点希望这个架构名称没有被重复使用，但我想为知识产权的这一部分申请专利真的没有意义。回覆。\n这里也一样。我很惊讶他们没有在法庭上对此进行争辩，我能想到的唯一原因是安培是一个SI单位，而不是一个虚构的词，所以任何注册商标都必须非常狭窄。这里显然存在市场混乱。回覆。\n这也是一个人的名字。安培电脑能否成为安培的商标是值得怀疑的。而且，如果NVIDIA选择使用这个名字，就会给他们带来更多的宣传(而且作为一家新公司，这是一个额外的好处)。回覆。\n安培计算能否成为安培的商标值得怀疑。他们实际上申请了安培(仅限全部大写？)。商标于2017年11月重新注册-经过非常漫长的审查过程、其他各方(NVIDIA？)的反对、延期、分区请求、初始拒绝、单方面上诉等-于2020年2月注册：https://trademarks.justia.com/879/80/ampere-879808.。他们的安培计算(Ampere Computer)商标申请出奇地不那么幸运，尽管范围更窄，更具体。它目前正在进行第二次延期，还没有注册。回覆。\n安培是公司的名称，不是产品/CPU部件。安培计算(Ampere Computing)成立于2017年(早在Nvidia发布安培产品之前很久)，就注册了安培商标(几乎可以肯定，只是作为一家公司注册)。我怎么知道的？我甚至不需要看得太远，只需点击末尾的链接，然后查看顶部安培旁边的®。因此，NVIDIA没有也不可能在任何法院对安培提起诉讼，因为后者的存在时间相当长，其先前存在的商标及其(明显)狭隘。不过，安培有没有起诉英伟达的案子呢？几乎可以肯定的是，不是因为同样的原因，而是因为NVIDIA的法律团队将安培作为产品名称进行了审查。此外，NVIDIA最近与Ampere合作支持CUDA，他们还宣布了一款参考设计、GPU加速的Ampere eMag服务器。https://amperecomputing.com/回复。\n虽然我对这一切都是关于我永远不会碰的硬件感到非常难过，但我很高兴看到所有这些新来的公司都认真瞄准了服务器领域，并在十多年来第一次看到了一些真正的竞争开始在这一领域展开。这是我永远不会接触到的东西，但我很高兴看到所有这些新公司都认真瞄准了服务器领域，并在那里看到了一些真正的竞争的开始，这是十多年来的第一次。我希望我们能在适当的时候看到这些系统的基准，我也很有兴趣看看Nuvia会推出什么。回覆。\n这似乎都是因为英特尔笨手笨脚地失去了他们过去真正糟糕的工艺优势。情况如此糟糕，以至于他们不仅被抓住了，而且他们是否能回到平等的境地也是值得怀疑的。苹果肯定在几年前就看到了不祥之兆，这就是为什么他们重新开始生产自己的CPU，而不是停留在沉没的英特尔船上。计算的另一个明显趋势是多核。目前，发烧友/游戏玩家并不太在意它，因为基本上还没有真正在内核方面可以无限扩展的游戏引擎。但如果几代游戏机从现在开始，他们拥有32或64个核心CPU，我不会感到惊讶。一旦能够在大多数人都会运行的典型应用程序中最大限度地使用64核CPU，那么每个人都会想要它们。回覆。\n&gt；这似乎完全是因为英特尔在工艺优势方面犯了错误，他们过去拥有的领先优势实在是太糟糕了。不，这更多的是因为x86ISA的低效，这就是它在移动端失败的原因。在某一时刻，x86必然会失去动力。ARMv8还有更大的改进空间。这是不可避免的。回覆", "note_en": "With the advent of higher performance Arm based cloud computing, a lot of focus is being put on what the various competitors can do in this space. We’ve covered Ampere Computing’s previous eMag products, which actually came from the acquisition of Applied Micro, but the next generation hardware is called Altra, and after a few months of teasing some high performance compute, the company is finally announcing its product list, as well as an upcoming product due for sampling this year.\n Ampere’s Altra is a realized version of Arm’s Neoverse N1 enterprise core, much like Amazon’s Graviton2, but this time in an 80-core arrangement. Where Graviton2 is designed to suit Amazon’s needs for Arm-based instances, Ampere’s goal is essentially to supply a better-than-Graviton2 solution to the rest of the big cloud service providers (CSPs). Of the companies that have committed to an N1 based design, so far on paper Ampere is publically the biggest and fastest on the books.\n  The Ampere Altra range, as part of today’s release, will offer parts from 32 cores up to 80 cores, up to 3.3 GHz, with a variety of TDPs up to 250 W. As we’ve described in our previous  news items on the chip, this is an Arm v8.2 core with a few 8.3+8.5 features, offers support for FP16 and INT8, supports 8 channels of DDR4-3200 ECC at 2 DIMMs per channel, and up to 4 TiB of memory per socket in a 1P or 2P configuration. Each CPU will offer 128 PCIe 4.0 lanes, 32 of which can be used for socket-to-socket communications implemented with the CCIX protocol over PCIe. This means 50 GB/s in each direction, and 192 PCIe 4.0 lanes in a dual socket system for add-in cards. Each of the PCIe lanes can bifurcate down to x2.\n  I must credit Ampere here. This is by far the  easiest product naming scheme I’ve ever seen. Intel could learn a million things from this naming scheme alone. The ‘Q’ stands for QuickSilver, the codename of the underlying SoC, followed by a core count and a frequency.\n Previously Ampere had stated they were going for 80 cores at 3.0 GHz at 210 W, however the Q80-33 is pushing that frequency another 300 MHz for another 40 W, and we understand that the tapeout of silicon from TSMC performed better than expected, hence this new top processor.\n  It’s worth doing some basic metrics on power efficiency. If we take the TDP as solely the power for the cores, and do some math on Watts per Core, then GHz per Watt, the top Q80-33 SKU scores 1.06, around the middle of the pack (most CPUs score 0.95-1.25 GHz/W). The highlight of the list by this metric is the Q64-24, offering the most frequency for the least power: 1.62 GHz per Watt.\n Also, just because we have the numbers, AMD’s big Rome CPUs consume about 3 W per core at full load, and run at approximately 3.0 GHz on all CPUs. Altra, by comparison, uses 2.6 W per core on the Q80-30. These Altra CPUs have no turbo mechanism, and thus the TDP metrics being given by Ampere are for the literal peak power consumption numbers, so what is listed above is merely a design point for chassis building, rather than a full representation of power consumption when deployed in the cloud.\n  Ampere states they have a number of ODMs on board that will be ready to provide Altra systems, including Gigabyte and Wiwynn, with a couple of second tier players also in the mix. These systems should be more readily available in August and September.\n When we asked Ampere about the interest for these chips, the company stated that most of the interest from CSPs was actually at the high end dual socket deployments, for the highest core counts and the highest frequencies. Even though Ampere isn’t announcing pricing publically, the company states that their pricing has not been an obstacle for CSP deployments, with major customers testing the hardware for up to 2 months already. Current announced customers include Packet and CloudFlare, with Packet offering early access for its key clients.\n Ampere is also one of the lead partners for CUDA on Arm, and is set to offer full CUDA support for Altra when paired with NVIDIA graphics accelerators.\n  If that wasn’t enough, Ampere dropped a sizeable nugget into our pre-announcement briefing. The company is set to launch a 128-core version of Altra later this year.\n This will be a new silicon design, beyond Ampere&#39;s initial layout of 80 cores for Altra, however Ampere states that while they are using the same platform as the regular Altra, they have done extensive tweaking and optimizations within the mesh interconnect for Altra Max to hide the additional contention that might occur when using the same main memory speeds.\n  Altra Max will be socket and pin-compatible with Altra, also support dual socket deployments, and Ampere states that the silicon will be ready for early sampling with partners in Q4, and is looking to move into high volume in mid-2021.  The 128-core design was given the code-name Mystique, and so we might expect to see these CPUs start with the letter M.\n  The next generation of Ampere’s product line, as previously reported, is going to use the codename Siryn (sire-inn) and be built on TSMC’s 5nm process, set for sampling in late 2021. Ampere stated in our briefing that test chips that use IP meant to be adopted in Siryn have already taped out - the actual Siryn chip will tape out sometime in the next year.\n  Siryn will likely be marketed as ‘2 nd Generation Altra’, and if the naming convention of CPUs stays the same, these will start with ‘S80’ etc. Ampere has stated that the Siryn platform will be new, especially because of new technologies (PCIe 5.0 and DDR5 were mentioned, but not confirmed for Siryn).\n  POST A COMMENT      clicked thinking this was about Nvidia Ampere and that they renamed SMs &#34;cores&#34; or something  I was sadly mistaken.  Reply\n  Same! I&#39;m kinda wishing the architecture name wasn&#39;t reused, but I guess it really doesn&#39;t make sense to patent that part of the IP.  Reply\n  Same here. I&#39;m amazed they haven&#39;t battled this out in court, the only reason I can think of is that ampere is an SI unit and not an invented word so any registered trademark must be very narrow. There&#39;s definitively marketplace confusion here.  Reply\n  And it is the name of a guy also. IT is doubtful that Amperecomputing could trademark Ampere. And well, if nVidia chooses to use the name, more publicity for them (and being a new company, that is a bonus).  Reply\n  &#34;IT is doubtful that Amperecomputing could trademark Ampere&#34;. They actually filed for an &#34;AMPERE&#34; (only all caps?) trademark back on November 2017 and they had it registered -after a very long process of examinations, oppositions by other parties (Nvidia?), extensions, &#34;divisional requests&#34;, initial refusals, exparte appeals etc etc- on February 2020 :  https://trademarks.justia.com/879/80/ampere-879808...  Their &#34;AMPERE COMPUTING&#34; trademark application is bizarrely less lucky, despite being more narrow and specific. It is currently on its second extension and still has not been registered..  Reply\n  Ampere is the name of a company, not a product / CPU part. Ampere Computing registered &#34;Ampere&#34; as a trademark (almost certainly narrowly, as a company only) when they were founded back in 2017 (long before Nvidia&#39;s Ampere release). How do I know that? I don&#39;t even need to look far, just click the link at the end and check out that ® right next to &#34;Ampere&#34; at the top.  Nvidia, therefore, do not and cannot have a case against Ampere,in any court, due to the latter&#39;s rather long pre-existence, their pre-existing trademark and its (apparent) narrowness. Do Ampere have a case against Nvidia though? Almost certainly not due to the same reasons and due to the vetting of &#34;Ampere&#34; as product name by Nvidia&#39;s legal team. Furthermore Nvidia recently partnered with Ampere for CUDA support and they also announced a reference design GPU-accelerated Ampere eMAG server.   https://amperecomputing.com/  Reply\n  While I&#39;m more than a bit sad that this is all about hardware that I&#39;ll never touch, it&#39;s nice to see all these newcomer companies take serious aim at the server space and seeing the beginnings of some real competition there for the first time in over a decade. I hope we&#39;ll be able to see benchmarks of these systems in due time, and I&#39;m also interested to see what Nuvia will come out with.  Reply\n  It seems to be all about Intel having fumbled the process advantage lead they used to have really badly. So badly that not only did they get caught, it&#39;s questionable if they can ever even come back to parity.  Apple certainly saw the writing on the wall a few years ago, which is why they are moving back to producing their own CPUs again rather than staying on the sinking Intel ship.  Another clear trend in computing is many-core. For the moment, enthusiasts/gamers don&#39;t care that much about it because there are basically no game engines that are really infinitely scalable in terms of cores. But I wouldn&#39;t be surprised if a couple console generations from now, they have 32 or 64 core CPUs. Once it&#39;s possible to actually max out a 64-core CPU in the typical apps that most people would be running, then everyone will want them.  Reply\n  &gt; It seems to be all about Intel having fumbled the process advantage lead they used to have really badly.  No, it&#39;s more to do with the poor efficiency of the x86 ISA, which is why it failed in mobile. x86 was bound to run out of steam at some point. ARMv8 has a bit more room for improvement. This was inevitable.  Reply", "posttime": "2020-06-30 21:35:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "安培,product", "title": "安培的产品清单：80个内核，在250瓦时最高可达3.3 GHz；第四季度将有128个内核", "title_en": "Ampere’s Product List: 80 Cores, up to 3.3 GHz at 250 W; 128 Core in Q4", "transed": 1, "url": "https://www.anandtech.com/show/15871/amperes-product-list-80-cores-up-to-33-ghz-at-250-w-128-core-in-q4", "via": "", "real_tags": ["安培", "product"]}, {"category": "", "categoryclass": "", "imagename": "1c2d3b30300916aac9a67d3f86ba8a1c.jpg", "infoid": 1008980, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "商业·分析有没有感觉到在那些Zoom会议上遗漏了一些重要的东西？如果是这样的话，你并不孤单--而且有加拿大的科学来支持你。\n随着政界和商界领袖努力重启经济，希望让餐馆、零售商和工厂重新盈利，或许有充分的经济理由，让至少部分在家工作的人群尽快回到办公室，这样做是安全的。\n加拿大对电脑媒介交流的研究早在目前的封锁之前就开始了，研究表明视频聊天不足以取代现实生活中的互动。真正的东西，依赖于非语言的暗示，在创造融洽和传达想法方面非常有效。\n不仅如此，当我们坐在附近的办公桌前或一起吃午饭时，我们现在与同事的熟悉和信任依赖于我们坐在附近的办公桌前或一起吃午饭时从背后回忆起来的联系。\n随着封锁的扩大和同事组合的变化，仅使用远程视频聊天工具可能几乎不可能建立健康的、相互信任的工作关系。\n莱尔森大学(Ryerson University)泰德·罗杰斯商学院(Ted Rogers School Of Business)的组织行为学专家马赫迪·罗哈尼扎德(Mahdi Roghanizad)表示，这对商业不利。原因是：事实一再证明，好好阅读同事的信息对于提高业务效率、实现共同目标和建立信任至关重要。\n这就是为什么甚至在大流行封锁之前就远程工作的团队总是定期面对面会面的原因。最新研究表明，人与人之间的联系就像一种直觉魔术。\n罗哈尼扎德解释说，假设你是第一次见一个人。在两到五分钟的互动之后，你将有更好的机会对他们的合作或慷慨做出更准确的预测。这就是我们的大脑是如何进化的。\n罗哈尼扎德解释说，当视频到视频通信中的互动发生时，这种能力就消失了，就像今天通过Zoom、Google Meet或Skype发生的一样。罗哈尼扎德的职业生涯始于电气工程师，后来他使用硬科学的工具来调查计算机化通信的故障。\n这位科学家的兴趣始于十多年前，当时“哈佛商业评论”(Harvard Business Review)引用的一项研究显示，在说服人们为慈善事业捐款方面，面对面交流的效率比电子邮件高34%。\n对于今天我们这些拥有装满电子收件箱的人来说，这项研究的结果可能并不令人惊讶。然而，在当时，这被认为是革命性的，因为研究中的人预计电子邮件和个人接触的结果大致相同。\n这一结果激励了罗哈尼扎德和其他人去研究人与人之间的接触、增进联系和建立信任感的原因。\n根据一篇研究论文，候选人包括信息素(我们散发出的一种微妙的香味)，以及一系列柔和的手势和身体姿势，比如交叉双臂和向后倾斜，研究人员在各种组合中显示出这些手势和身体姿势都能激发信心，并能预测经济行为。\n罗哈尼扎德最新的研究正在帮助证明，如果没有现实生活中的接触，这些非语言暗示根本不会被人类大脑中负责科学家所称的心理理论--在团队工作的人之间创造理解--的关键互动部分所记录。\n罗哈尼扎德说，眼神接触是激活心理理论所必需的，当眼神接触不在那里时，我们的大脑就不会处理所有其他信号信息。\n他的研究表明，即使戴上太阳镜，大脑的这一部分也会短路，并关闭这一过程。\n弗朗西丝·韦斯特利(Frances Westley)是“如何影响我们周围的人进行社会变革”一书的作者，她说，在频繁的视频聊天中，她注意到交流很平淡，可能类似于与戴着深色太阳镜的熟人交谈。\n滑铁卢大学(University Of Waterloo)社会创新与恢复力研究所(Institute For Social Innovation And Resilience)的负责人韦斯特利表示，互动的质量和满意度肯定会降低，即使是与你非常熟悉的人也是如此。\n这可能是为什么被锁在自己公寓里的人如此渴望走出家门进行社交活动的原因之一，他们渴望心灵理论所暗示的原始的脑对脑接触和同理心。这也可能是导致缩放疲劳的另一个原因，因为人们很难找到屏幕上没有的信息。\n韦斯特利说，谈话多面性的丰富性被剥夺了，因为你看到的是你期望拥有它的人，他建议人们见面散步或交谈，以达成更完整的理解。\n犯罪学世界的研究表明，认为视频提供更多信息的印象是虚假的。研究表明，人们有能力辨别某人的谎言是否真的被视频欺骗了，你可以通过单独听音频，甚至通过阅读文字记录来做出更好的判断。\n罗哈尼扎德说，对于那些在家工作的人来说，即使视频聊天体验并不令人满意，但与以前共事过的同事打交道，可以让你利用之前现场互动中形成的信任和熟悉的痕迹。在聊天中结识新朋友是完全不同的，这严重损害了自信的合作。\n随着封锁的持续，无论是招聘、达成交易、进行新接触，还是与新员工或新职位的人合作，缺乏面对面的沟通渠道将越来越多地给有效的业务运营造成障碍，因为机构基本上会耗尽宝贵的社会资本储备。\n这是大流行引发的家庭革命工作可能不会像一些倡导者最近所说的那样持久或完整的另一个原因。", "note_en": "Business  · Analysis      Ever get the sense there is something vital missing on those Zoom meetings? If so, you&#39;re not alone — and there is Canadian science to back you up.\n  As political and business leaders push to reopen the economy hoping to get restaurants, retailers and factories making money again, there may be good economic reasons for putting at least some of the work-from-home crowd back into the office as fast as it&#39;s safe to do so.\n   Canadian research on &#34;computer-mediated communication,&#34; begun long before the current lockdown, shows video chat is an inadequate substitute for real-life interaction. The real thing, dependant on non-verbal cues, is extraordinarily more effective in creating rapport and getting ideas across.\n  Not only that, but the familiarity and trust we currently feel with coworkers during the lockdown&#39;s remote calls rests on connections remembered from back when we sat at a nearby desk or met for lunch.\n    As the lockdown stretches out and the mix of colleagues changes, it may be almost impossible to establish healthy trusting working relationships using remote video chat tools alone.\n  That&#39;s bad for business, said organizational behaviour specialist Mahdi Roghanizad from Ryerson University&#39;s Ted Rogers School of Business. The reason: getting a good reading on your fellow workers has been repeatedly shown to be essential for business efficiency, reaching common goals and establishing trust.\n      It is why teams   that worked remotely even before the pandemic lockdown always met periodically in person. The latest research shows human-to-human bonding is like a kind of intuitive magic.\n  &#34;Say you are seeing a person for the first time,&#34; explained Roghanizad. &#34;After two to five minutes of interaction, you will have a better chance of a more accurate prediction about their cooperativeness or generosity. This is how our brain evolved.&#34;\n    &#34;This ability goes away when the same interaction happens in video-to-video communication as is happening today through Zoom or Google Meet or Skype,&#34; explained Roghanizad, who started his career as an electrical engineer and has since used the tools of hard science to investigate the failures of computerized communication.\n    The scientist&#39;s interest began more than decade ago with research quoted in the Harvard Business Review that showed face-to-face communication was   34 per cent more effective than email in persuading people to donate to a good cause.\n  To those of us today with loaded electronic in-boxes, the results of that research may not be surprising. At the time, however, it was considered revolutionary because people in the study expected outcomes for email and personal contact to be about the same.\n  The results inspired Roghanizad and others to look into the reasons why person-to-person contact increased bonding and established a sense of trustworthiness.\n    Candidates included pheromones — the subtle fragrances we give off — plus a series of muted hand and body gestures such as crossing your arms and leaning back that in various combinations researchers have shown inspire confidence and &#34;are predictive of economic behaviour,&#34; according to one   research paper.\n  Roghanizad&#39;s most recent research is helping to prove is that without real-life contact, those non-verbal cues simply don&#39;t register in a key interactive part of the human brain responsible for what scientists call &#34;  theory of mind&#34; —that creation of understanding between people working in groups.\n    &#34;Eye contact is required to activate that theory of mind and when the eye contact is not there, the whole other signal information is not processed by our brain,&#34; said Roghanizad.\n  His research has shown that even wearing sunglasses short circuits that portion of the brain and shuts the process down.\n    Frances Westley, author of the book    Getting to Maybe on how to influence those around us toward social change, said she has noticed a flatness in communication in her frequent video chats perhaps similar to having a conversation with an acquaintance who is wearing dark sunglasses.\n  &#34;The quality of the interaction and the satisfaction of the interaction, even with people you know quite well, is definitely diminished,&#34; said Westley, a leader at the University of Waterloo&#39;s Institute for Social Innovation and Resilience.\n    That may be one reason why people locked down in their own apartments are so anxious to get out and socialize, hungering for the primal brain-to-brain contact and empathy implied by the theory of mind. It may also be another reason for &#34;  Zoom fatigue&#34; as people struggle to find information that just isn&#39;t available on screen.\n  &#34;The richness of the multifaceted nature of the conversation is deprived and because you are seeing the person you expect to have it,&#34; said Westley, who suggests people meet for a physically distanced walk or conversation to reach a more complete understanding.\n  Research from the world of criminology has shown the impression that video provides more information is spurious. Studies show the ability to recognize if someone&#39;s lying is actually   deceived by video and that you can make a better judgement from listening to audio alone or even by reading a transcript.\n    For those working from home, even if the video chat experience isn&#39;t as satisfying, dealing with colleagues you have worked with before allows you to use the vestiges of trust and familiarity developed during previous live interactions, said Roghanizad. Meeting new people in chats is entirely different, leaving confident collaboration seriously impaired.\n  As the lockdown stretches on, for hiring, for making deals, making new contacts or working with new staff or people in new positions, the lack of in-person communication will increasingly create barriers to effective business operations as institutions use up what is essentially a precious reserve of social capital.\n  This is one more reason that the work from home revolution caused by the pandemic may not be as long-lasting or as complete as some advocates have recently suggested.", "posttime": "2020-06-30 21:35:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,聊天,chats,研究", "title": "视频聊天短路，这是信任必不可少的大脑功能", "title_en": "Video chats short circuit a brain function essential for trust", "transed": 1, "url": "https://www.cbc.ca/news/business/zoom-trust-business-pandemic-1.5628638?cmp=rss", "via": "", "real_tags": ["rust", "聊天", "chats", "研究"]}, {"category": "", "categoryclass": "", "imagename": "4e3e0b3c3e6d939e764d31f6c80216f8.png", "infoid": 1008978, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "KDE社区是#MovingToGitlab！在2019年11月宣布迁移到GitLab的最初决定后，KDE已经正式完成了迁移的第一阶段，贡献者已经开始在inv.kde.org上每天使用GitLab。请继续阅读，了解有关KDE迁移故事的更多信息。\nKDE是一个为台式机和移动设备创建开源软件的国际社区。KDE软件兼容多种平台，包括GNU/Linux、FreeBSD、Windows、MacOS和Android。他们的产品被数以百万计的家庭和办公室员工使用，并正在世界各地的学校部署。\nKDE社区拥有来自全球各地的2700多名艺术家、设计师、程序员、翻译员、作家和其他贡献者，KDE社区正在蓬勃发展。\n这个社区总共为Qt开发人员创建和维护了200多个应用程序和数不清的附加组件、插件和类型库、1000多个存储库、80多个框架和2600多个项目。KDE软件被翻译成100多种语言，以实现广泛的全球覆盖。\n自从机会出现以来，采用GitLab一直是自然而然的下一步。简化新贡献者的入职是我们在KDE社区的主要目标之一。KDE e.V.总裁Aleix Pol表示：能够让项目贡献者轻松参与他们维护的产品的测试和交付，这对我们的生态系统来说肯定是一个转折点。\nKDE董事会成员、KDE入职团队核心成员Neofytos Kolokotronis补充说，通过使用一个提供大多数开源开发人员现在都熟悉的界面和工作流程的平台，我们相信我们正在降低新贡献者加入我们的门槛，并为我们的社区在未来几年的规模提供基础。Neofytos Kolokotronis是KDE的董事会成员，也是KDE入职团队的核心成员。他补充说，通过使用一个提供了大多数开源开发人员现在都熟悉的界面和工作流程的平台，我们相信我们正在降低新贡献者加入我们的门槛，并为我们的社区在接下来的几年里扩大规模提供基础。\n对于像KDE这样的老牌社区来说，迁移到新工具是一项很大的工作。移民决策需要仔细的沟通和收集社区共识的复杂任务。\nKDE团队在遵循了一系列精心设计的步骤后做出了迁移的决定。首先，他们与sysadmin团队进行了交谈，然后组建了一个迁移团队来评估这一举措。接下来，系统管理员团队完成了对GitLab功能的彻底研究，并将社区的需求与这些产品功能进行了比较。然后，他们创建了一个流程，允许KDE对一些项目运行较短的测试周期，记录流程，并向社区提供反馈。\n迁移开始于一些更小、更敏捷的KDE团队，他们对测试和提供反馈非常感兴趣。在这个周期成功完成后，KDE开始迁移拥有更大代码库和更多贡献者的团队。一旦所有主要问题都解决了，他们就对计划搬迁的所有剩余项目进行了最后的切换。sysadmin团队记录了每个步骤之后的结果，并将其直接与KDE社区共享，以接收反馈并就如何继续进行收集共识。\n由于转换到GitLab直接属于KDE精简新贡献者入职目标的范围，KDE入职团队也从一开始就参与其中，与领导这项工作的sysadmin团队密切合作。社区从一开始就参与决策，并对迁移的每个阶段保持最新状态，在此过程中所有问题和关注都得到了回答和解决。\n这对我们来说是一个重大的变化，但我们对我们的社区如何在长时间的讨论中进行协作感到非常满意。Neofytos表示：我们相信，通过共同努力，我们在前进的过程中做出了最好的决定。\nKDE面临的最大挑战是他们要处理的数据量太大，以及如何将其集成到众多正在使用的工具中(包括Phabricator)。拥有1,000多个存储库，这次迁移是一项艰巨的任务。\n为了应对这一挑战，KDE决定分阶段进行迁移，而不是一次性完成。通过分阶段迁移，他们能够分别处理不同的数据类型，如存储库和任务。\nKDE开发了定制工具，以便在整个迁移过程中更轻松地进行批量更新。这些工具帮助设置项目的名称、描述和头像，以及一些设置，例如受保护的分支和合并方法。通过使用这些用于批量更新的自定义工具，KDE还能够避免向单个贡献者授予维护人员访问权限。根据系统管理员的访问和权限策略，KDE仅允许维护人员访问。\nKDE移植了定制的Git钩子，以确保某些检查和操作在迁移到GitLab之后继续进行。其中包括检查以确保文件编码符合KDE要求，并根据需要关闭Bugzilla安装上的bug。\n为了支持他们的翻译社区(他们的工作流程中仍然使用Subversion)，KDE还构建了从GitLab导出SSH密钥的工具，以避免在两个地方更新这些密钥。\nKDE还调整了用于构建和开发KDE软件的工具，使其与GitLab中的新存储库结构兼容。\n在这一点上，KDE克服了他们的大部分迁移障碍。准备工作完成后，清理了一些系统，以便更好地与GitLab配合工作，实际迁移大约需要一天时间。\n但是，在KDE将持续集成(CI)和任务管理过渡到GitLab之前，还有更多的挑战。为了跟踪KDE迁移，您可以查看KDE正在跟踪的问题列表。\n迁移到GitLab的组织面临的一个共同挑战是决定如何构建他们的小组，以便最好地支持他们的社区工作流程，并允许他们遵守他们的政策。\nKDE决定通过在GitLab的顶层建立一系列小组作为类别来应对这一挑战。然后，KDE的1200个存储库被分类到这些类别中的每一个。\nKDE形成了这一架构策略，以帮助使项目更容易被发现。KDE希望避免人们需要无休止地滚动存储库的不切实际。设置顶级类别还允许开发人员更容易地了解他们最感兴趣的类别的合并请求。\n关于权限，KDE使用单一的KDE Developers主组来管理成员资格和权限级别。那里的每个人都有权访问开发人员。然后，除了包含KDE网站和基础设施存储库的组之外，该组被邀请到所有包含存储库的组。这种处理权限的方法允许KDE维护单一的真理来源。\nKDE之所以使用GitLab的社区版，是因为他们致力于开源。他们是我们GitLab for Open Source项目的成员，在整个迁移过程中一直积极与GitLab团队成员合作。使用GitLab for Open Source计划进行大规模迁移的好处之一是，社区经常在评估期及以后提供一些额外的帮助。\n例如，GitLab for Open Source计划有一个用于KDE迁移的公共跟踪器，用于交流和更好地一目了然地了解特别重要的问题。这使得KDE、GitLab和更大的开放源码社区可以一起协作应对挑战。\nNeofytos表示，GitLab的协作和透明价值观确实大放异彩。我们赞赏他们对接受社区成员的合并请求和考虑新功能的建议持开放态度。到目前为止，我们与GitLab社区的成员和GitLab团队的成员-从开发人员到项目经理再到产品所有者-都有很好的合作经历。\n现在KDE迁移的第一阶段已经完成，我们期待着在迁移的其余阶段继续与KDE协作。\nKDE有一个令人惊叹的社区，他们欢迎新成员！现有会员很乐意就新成员的贡献提供反馈，目的是帮助他们学习。每天都有越来越多的人加入不断增长的KDE大家庭--而且总是有更多的空间！\nKDE拥有丰富的基础设施，包括Web资源、论坛、邮件列表、IRC(聊天)和许多其他联系方式。要了解更多关于加入KDE社区的信息，请访问他们的“参与进来”页面，该页面为来自各种背景的所有贡献者提供指导。\n正在考虑为您的开源项目或组织进行迁移吗？了解更多有关GitLab for Open Source项目的信息，请不要犹豫，请通过opensource@gitlab.com与我们联系。关注我们的社交媒体标签#MovingToGitlab，了解更多迁移故事、提示和诀窍。\n非常感谢KDE&39；的Aniqa Khokhar，Ben Cooksley，Bhushan Shah，Neofytos Kolokotronis和Paul Brown在这篇博客文章中合作。", "note_en": "The  KDE community is #MovingToGitlab! After announcing the original decision to migrate to GitLab in November 2019, KDE has officially completed phase one of their migration, and contributors have begun to use GitLab on a daily basis at invent.kde.org. Read on to learn more about KDE&#39;s migration story.\n  KDE is an international community that creates open source software for desktops and mobile devices. KDE software is compatible with multiple platforms, including GNU/Linux, FreeBSD, Windows, macOS, and Android. Their products are used by millions of home and office workers and are being deployed in schools around the world.\n With more than 2,700 artists, designers, programmers, translators, writers, and other contributors from across the globe, the KDE community is thriving.\n Together, this community creates and maintains more than 200 applications and countless add-ons, plugins, and Plasmoids, 1000+ repositories, 80+ frameworks for Qt developers, and more than 2,600 projects. KDE software is translated into more than 100 languages to enable vast global reach.\n  &#34;Adopting GitLab has been as a natural next step since the opportunity was presented. Simplifying the onboarding of new contributors is one of our main goals in the KDE community. Being able to allow project contributors to easily participate in how the products they maintain are tested and delivered will certainly be a turning point for our ecosystem,&#34; says  Aleix Pol, President of KDE e.V.\n &#34;By using a platform offering an interface and workflow that most open source developers are nowadays familiar with, we are confident that we are lowering the bar for new contributors to join us, and are providing the foundation for our community to scale in the following years,&#34; added  Neofytos Kolokotronis, member of KDE e.V.&#39;s Board of Directors and a core member of KDE&#39;s Onboarding team.\n Moving to new tools is a lot of work for established communities like KDE. Migration decisions require careful communication and the complex task of gathering community consensus.\n The KDE team made the decision to migrate after following a series of carefully designed steps. First, they talked to the sysadmin team and then formed a migration team to evaluate the move. Next, the sysadmin team completed a thorough study of GitLab&#39;s features and did an intake and comparison of the community&#39;s needs against those product features. Then, they created a process that allows KDE to run short test cycles with some projects, document the process, and provide feedback to the community.\n The migration started by moving some smaller and more agile KDE teams that were very interested in testing and providing feedback. After this cycle was completed successfully, KDE started migrating teams with a larger codebase and more contributors. Once all of the major issues were resolved, they made the final switch for all remaining projects they planned to move. The sysadmin team documented the results after each step and shared them directly with the KDE community to receive feedback and gather consensus on how to proceed.\n As the switch to GitLab fell directly under the scope of KDE&#39;s  &#34;Streamlined Onboarding of New Contributors&#34; goal, the KDE Onboarding team was also involved from the start, working very closely with the sysadmin team, who were leading the effort. The community was involved in the decision-making from the beginning, and stayed up-to-date on each phase of the migration, and all questions and concerns were answered and addressed along the way.\n &#34;This was a major change for us, but we are very satisfied with how our community collaborated over long discussion threads. We believe that by working together we made the best decisions as we moved forward,&#34; says Neofytos.\n  The biggest challenge for KDE was the sheer volume of data they were dealing with and how it was integrated into the numerous tools in use (including  Phabricator). With more than 1,000 repositories, this migration was a big undertaking.\n To address this challenge, KDE decided to approach the migration in phases rather than do it all at once. By phasing the migration, they were able to deal with different data types, such as repositories and tasks, separately.\n KDE developed custom tools to make bulk updates easier throughout the migration process. These tools help set the name, description, and avatar of the projects alongside a number of settings, for example, protected branches, and merge methods. By using these custom tools for bulk updates, KDE was also able to avoid granting maintainer access to individual contributors. KDE only allows maintainer access for sysadmins per their access and permissions policy.\n KDE ported custom Git hooks to ensure that certain checks and actions continued after the move to Gitlab. These include checks to ensure file encodings match KDE requirements and that bugs on their Bugzilla installation were closed as needed.\n In order to support their translation community, which still uses Subversion in their workflow, KDE also built tooling to export SSH keys from GitLab to avoid the need to update these in two places.\n KDE also adjusted the tools used to build and develop KDE software to make them compatible with the new repository structure in GitLab.\n At this point, KDE overcame most of their migration hurdles. Once the preparation work was finished to clean up a number of systems to work more natively with GitLab, the actual migration took about one day.\n But there are a few more challenges left before KDE can transition continuous integration (CI) and task management over to GitLab. To follow along with the KDE migration, you can take a look at the  list of issues that KDE is tracking.\n  A common challenge for organizations moving to GitLab is deciding how to structure their groups to best enable their community&#39;s workflows and allow them to abide by their policies.\n KDE decided to tackle this challenge by setting up a series of groups at the top level of GitLab to act as categories. KDE&#39;s 1,200 repositories were then sorted into each of these categories.\n KDE formed this architectural strategy to help make projects more discoverable. KDE wanted to avoid the impracticality of people needing to scroll endlessly through repositories. Setting up top-level categories also allows developers to get an easier overview of merge requests for the categories they are most interested in.\n With regards to permissions, KDE uses a single master &#34;KDE Developers&#34; group to manage membership and permission levels. Everyone there is given &#34;Developer&#34; access. This group is then invited to all of the groups containing repositories except for the ones containing the KDE website and infrastructure repos. This method of dealing with permissions allows KDE to maintain a single source of truth.\n  KDE is using the  Community Edition of GitLab because of their commitment to open source. They are a member of our  GitLab for Open Source program, and have been actively collaborating with GitLab team members throughout the migration. One of benefits of using the GitLab for Open Source program for large migration efforts is that the community often offers some extra assistance through the evaluation period and beyond.\n For example, the GitLab for Open Source program has a  public tracker for KDE&#39;s migration, which is used to communicate and better understand at a glance the issues that are especially important. This allows KDE, GitLab, and the larger open source community to collaborate on challenges together.\n &#34;GitLab&#39;s values of  collaboration and  transparency really shine through,&#34; says Neofytos. We appreciate their openness to accepting merge requests from community members and considering proposals for new features. We have had a great experience so far collaborating with members of the GitLab community and members of the GitLab team – from developers to program managers to product owners alike.&#34;\n Now that phase one of the KDE migration is complete, we look forward to continuing to collaborate with KDE through the remaining phases of the migration.\n    KDE has an amazing community and they welcome new members! Existing members are happy to provide feedback on newcomers&#39; contributions with the goal of helping them learn. Every day more and more people join the ever-growing KDE family – and there&#39;s always room for more!\n KDE has a rich infrastructure of web resources, forums, mailing-lists, IRC (chat), and many other ways to get in touch. To learn more about joining the KDE community, visit their &#34; Get Involved&#34; page, which offers guidance to all contributors from all backgrounds.\n  Considering a migration for your open source project or organization? Learn more about our  GitLab for Open Source program and don&#39;t hesitate to contact us at opensource@gitlab.com. Follow our social media hashtag #MovingToGitlab for more migration stories, tips, and tricks.\n A big thank you to KDE&#39;s Aniqa Khokhar, Ben Cooksley, Bhushan Shah, Neofytos Kolokotronis, and Paul Brown for collaborating on this blog post.", "posttime": "2020-06-30 21:33:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社区,community,kde", "title": "KDE社区正在迁移到GitLab", "title_en": "The KDE community is moving to GitLab", "transed": 1, "url": "https://about.gitlab.com/blog/2020/06/29/welcome-kde/", "via": "", "real_tags": ["社区", "community", "kde"]}, {"category": "", "categoryclass": "", "imagename": "1b6fbb9fc7df6ae39a3747dea625f809.png", "infoid": 1008977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据世界卫生组织(WHO)的数据，溺水是意外死亡的第三大原因，全球每年估计有32万人死亡。虽然救生员在帮助保护海滩和游泳池方面发挥着至关重要的作用，但无论有没有双筒望远镜的帮助，人眼都很难在大量人群中或在远处发现遇险的游泳者。Sightbit正在利用人工智能提醒救生员注意潜在的溺水事件，并标记其他危险情况，如无人看管的儿童和激流。\n总部位于以色列的Sightbit成立于2019年，是从内盖夫本古里安大学(BGU)剥离出来的。这所公立研究型大学通过其仙人掌资本风险投资基金(Cactus Capital VC Fund)对校友进行投资，并向Sightbit提供了种子前资金，Sightbit目前正在筹集额外资金，作为种子轮的一部分。Sightbit联合创始人兼首席执行官内塔内尔·埃利亚夫说：“世界各地的投资者都向我们伸出了橄榄枝，我们已经收到了融资提议。”\nSightbit在标准的现成相机上增加了软件，称其基于深度学习和计算机视觉技术，并使用卷积神经网络进行目标检测。埃利亚夫告诉VentureBeat，该系统接受了“数万张照片”的培训，以帮助检测和降低危险情况。\nSightbit采用每月软件即服务订阅模式，并管理现场软件配置。它还可以帮助安装摄像头，尽管埃利亚夫指出，许多海滩已经出于安全目的安装了摄像头。\nVB Transform 2020 Online-7月15-17日。加入领先的人工智能高管：注册免费直播。\nSightbit的系统使用风险评估模型对海滩的各个部分进行评级，该模型考虑了拥挤和天气状况，然后估计给定的一天需要多少救生员。该系统对游泳者等看起来举步维艰的人发出实时警报，而预测性分析可以帮助救生员预测风险并采取预防措施。一个相机可以延伸到大约1000英尺(300米)的海岸线上，尽管这个大小的区域通常由三个相机覆盖。\n埃利亚夫说：“Sightbit警告以闪光框的形式出现在个人和危险周围。”“救生员可以点击警报，然后程序会放大…。并准确地看到警报的位置。“。\nSightbit的系统可能会从根本上改变救生员的做法，用屏幕和自动警报取代瞭望塔和双筒望远镜。然而，该公司并没有将其服务定位为人类救生员的替代品。它更多的是加强现有的方法，包括已经在一些海滩上使用的相机。有了Sightbit，指挥中心的救生员可以继续用肉眼监控，同时在屏幕上出现警报时做出响应。\n埃利亚夫说：“人类并不适合坐在塔里跟踪游泳者。”“这不是人们生来就是要做的事情。短期内，在戒备森严的海滩上，Sightbit只是救生员的助手，帮助他们做得更好。没有救生员可以一直照看所有的游泳者--但是Sightbit可以。而且救生员不能总是看到远处塔边的游泳者。但Sightbit可以提供额外的有利位置。“。\n据埃利亚夫说，在设计过程中咨询了救生员，该系统不需要任何特殊培训。监视器显示水和海滩的全景，类似于安全摄像头显示，而仪表板叠加在视频馈送上，并且在单个屏幕上提供多个视图。还可以显示其他数据，如人数、天气状况以及是否有激流。每个救生员都可以控制他们希望看到的警报和危险。\n当可用救生员较少时，这项技术还可以帮助保护海滩，或者可以在没有救生员服务的海岸延伸地区使用。\n埃利亚夫说：“大多数游泳场所都是无人看守的场所。”“今天，仅在美国，所有指定游泳的海岸海滩中，只有不到一半的海滩随时都有救生员。当然，当救生员驻扎时，通常只在夏季几个月，不是全天候，而且只在海滩上最受欢迎的地方。“。\n虽然救生员需要在附近才能避免溺水事件，但并不是所有的海上危险都需要立即干预，这使得紧急服务人员有时间到达事故现场。\n埃利亚夫继续说：“尤其是，被激流困住的游泳者通常不会立即溺水，只有在他们疲惫并被冲到海里后才会溺水。”我们的软件可以精确定位和跟踪游泳者的位置，必要时我们可以通过小型无人机将救援管带给遇险的游泳者。\nSightbit最近在以色列的Palmachim海滩启动了第一个商业试点项目，该海滩声称夏季有100多万游客，目前正与五名救生员一起使用。上个月启动的第一阶段安装，覆盖了400米(1312英尺)的海滩，而第二阶段，从下周开始，将再覆盖400米。\n埃利亚夫解释说：“我们正在研究救生员如何使用该系统，以测试界面，并考虑如何将该系统整合到救生员的日常实践中。”\n许多类似的“智慧海滩”计划正在世界各地展开。其中包括澳大利亚的智能海滩项目，该项目部署了传感器来统计游客数量并发现危险情况，使救生员和地方当局能够分配足够的资源。其他一些公司也在为救生员开发主动警报系统，包括瑞典的SwimEye公司和以色列的珊瑚检测系统公司。SwimEye公司已经建立了一种计算机视觉系统，可以在游泳池的水下放置摄像头，以色列的珊瑚检测系统公司也提供了类似的产品。\n虽然Sightbit的技术可以部署在任何可以找到游泳者的地方-包括游泳池-但该公司最初的目标是海滩。该程序的成功将取决于其准确性和可靠性，救生员可能会过度依赖一项尚未在现场环境中进行充分测试的技术。但埃利亚夫相信这项技术将证明自己，假设它被正确使用，该公司目前正计划在美国和欧洲的海滩上进行更多的试点。\n埃利亚夫说：“Sightbit的重点是及早发现可能导致溺水的危险情况。”“该系统将能够以99.9%的准确率检测到这些情况。”", "note_en": "Drowning is the third leading cause of accidental death,  according to World Health Organization (WHO) data, with an estimated 320,000 fatalities each year globally. While lifeguards play a crucial role in helping safeguard beaches and pools, the human eye struggles to spot swimmers in distress in large crowds or at a distance — with or without the help of binoculars.  Sightbit is harnessing AI to alert lifeguards to potential drowning incidents, as well as flagging other hazardous situations, such as unattended children and rip currents.\n Founded in 2019, Israel-based Sightbit is a spinout from  Ben-Gurion University of the Negev (BGU). The public research university invests in alumni via its  Cactus Capital VC fund and has provided pre-seed funding to Sightbit, which is currently raising additional funds as part of a seed round. “Investors around the world have reached out to us, and we have already received funding offers,” Sightbit cofounder and CEO Netanel Eliav said.\n   Sightbit augments standard off-the-shelf cameras with software it says is based on  deep learning and computer vision technology, with convolutional neural networks for  object detection. Eliav told VentureBeat the system was trained on “tens of thousands of photo stills” to help detect and de-escalate dangerous situations.\n Sightbit operates a monthly software-as-a-service subscription model and manages onsite software configuration. It can also help with camera installation, though Eliav noted many beaches already have cameras installed for security purposes.\n  VB Transform 2020 Online - July 15-17. Join leading AI executives:  Register for the free livestream.\n Sightbit’s system rates sections of a beach using a risk assessment model that considers crowdedness and weather conditions and then estimates how many lifeguards are needed on a given day. The system issues real-time alerts for things like swimmers who appear to be struggling, while predictive analytics can help lifeguards anticipate risk and take preventative actions. A single camera can be stretched to cover roughly 1,000 feet (300 meters) of shoreline, though an area this size is typically covered by three cameras.\n “Sightbit warnings appear as flashing boxes around individuals and hazards,” Eliav  said. “The lifeguard can click on the alert, and then the program zooms in … and sees exactly where the alert is.”\n  Sightbit’s system could fundamentally change lifeguarding practices, with watchtowers and binoculars replaced by screens and automated alerts. However, the company isn’t pitching its service as a replacement for human lifeguards. It’s more about augmenting current methods, including the  cameras already being used on some beaches. With Sightbit, lifeguards at a command center can continue monitoring with their naked eye while responding to alerts as they come in on their screen.\n “Humans aren’t optimized for sitting in a tower and tracking swimmers,” Eliav said. “It’s just not something that people are built for. For the short-term, at guarded beaches, Sightbit is simply an assistant to the lifeguard to help them do their jobs even better. No lifeguard can watch all swimmers, all the time — but Sightbit can. And lifeguards cannot always see swimmers far off to the side of the tower. But Sightbit can provide extra vantage points.”\n Lifeguards were consulted in the design process, according to Eliav, and the system doesn’t require any special training. A monitor displays a panoramic view of the water and the beach, similar to a security camera display, while a dashboard is superimposed over the video feed, and multiple views are available on a single screen. Additional data can also be displayed, such as the number of people, weather conditions, and whether there are rip currents. Each lifeguard can control which alerts and hazards they wish to see.\n  The technology could also help safeguard beaches when fewer lifeguards are available or could be used on stretches of coast that have no lifeguard service.\n “Unguarded sites constitute the majority of swimming sites,” Eliav said. “Today in the U.S. alone, less than half of all coastal beaches that [are] designated for swimming have lifeguards at any time. And of course, when lifeguards are stationed, it’s typically just during the summer months, not for all daylight hours, and only at the most popular spots along the beach.”\n While lifeguards need to be nearby to avert drowning incidents, not all sea hazards require immediate intervention, which allows time for emergency services to get to the scene of an incident.\n “In particular, swimmers caught in rip currents do not usually drown immediately, only after they are tired and are being swept out to sea,” Eliav continued. “Our software can pinpoint and track a swimmer’s location, and when necessary we can bring rescue tubes to swimmers in distress via small drones.”\n  Sightbit recently launched its first commercial pilot program at Israel’s Palmachim Beach, which claims more than a million visitors during the summer season, and is currently being used alongside five lifeguards. Phase one of the installation, which launched last month, covers 400 meters (1312 feet) of the beach, while phase 2, starting next week, will cover an additional 400 meters.\n “We are examining how lifeguards use the system in terms of testing the interface and considering how the system is integrated into lifeguards’ daily practices,” Eliav explained.\n  A number of similar “smart beach” initiatives are underway around the world. These include  the Smart Beaches project in Australia, where sensors are deployed to count visitors and spot dangerous conditions, allowing lifeguards and local authorities to allocate adequate resources. A number of other companies are working on proactive alert systems for lifeguards, including Sweden’s  SwimEye, which has built a computer vision system that places a camera underwater in swimming pools, and Israel’s  Coral Detection Systems, which offers a similar product.\n While Sightbit’s technology could be deployed anywhere swimmers can be found — including pools — the company is initially targeting beaches. The program’s success will depend on its accuracy and dependability, and there’s a risk lifeguards could become overly reliant on a technology that hasn’t yet been fully tested in a live environment. But Eliav is confident the technology will prove itself, assuming it’s used correctly, and the company is currently planning additional pilots on beaches across the U.S and Europe.\n “Sightbit is focused on early detection of dangerous situations that can lead to drowning,” Eliav said. “The system will be able to detect these situations to 99.9% accuracy.”", "posttime": "2020-06-30 21:32:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,deploys,救生员", "title": "Sightbit在海滩上部署人工智能，帮助救生员发现苦恼的游泳者", "title_en": "Sightbit deploys AI on beaches to help lifeguards spot distressed swimmers", "transed": 1, "url": "https://venturebeat.com/2020/06/26/sightbit-deploys-ai-on-beaches-to-help-lifeguards-spot-distressed-swimmers/", "via": "", "real_tags": ["人工智能", "deploys", "救生员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新的研究发现，每天盯着深红光三分钟可以显著改善视力下降，这是人类首次进行此类研究。\n伦敦大学学院领导的一项新研究发现，每天盯着深红光三分钟可以显著改善视力下降，这是人类首次进行此类研究。\n科学家们认为，发表在“老年学杂志”上的这一发现可能标志着新的负担得起的家庭眼科疗法的曙光，帮助全球数百万视力自然下降的人。\n在英国，目前65岁以上的人大约有1200万：50年后，这一数字将增加到2000万左右，所有人都会因为视网膜老化而出现一定程度的视力下降。\n主要作者，伦敦大学学院眼科研究所的格伦·杰弗里教授说：随着年龄的增长，你的视觉系统会显著衰退，尤其是超过40岁的时候。\n你的视网膜敏感度和色觉都会逐渐受损，随着人口老龄化，这是一个越来越重要的问题。\n为了阻止或扭转这种衰退，我们试图用短时间的长波光重新启动视网膜老化的细胞。\n在40岁左右的人类中，眼睛视网膜中的细胞开始老化，这种老化的速度在一定程度上是由于细胞的线粒体(其作用是产生能量(称为ATP)并促进细胞功能)也开始衰退。“。\n线粒体密度是最大的视网膜感光细胞，这是有很高的能量需求。结果，视网膜比其他器官衰老得更快，一生中ATP减少了70%，导致光感受器功能显著下降，因为它们缺乏能量来发挥正常作用。\n研究人员以他们之前在老鼠、大黄蜂和果蝇身上的发现为基础，当他们的眼睛暴露在670纳米(长波长)的深红光下时，这些人的视网膜光感受器的功能都得到了显著的改善。\n杰弗里教授说，线粒体具有影响其性能的特定光吸收特性：跨越650到1000 nm的较长波长被吸收，并改善线粒体性能以增加能量产生。\n视网膜的光感受器群体由调节色觉的视锥和提供周边视觉和适应弱光视觉的视杆组成。\n在这项研究中，招募了24人(男性12人，女性12人)，年龄在28岁到72岁之间，没有眼部疾病。在研究开始时，所有参与者的眼睛都被测试了他们的视杆和视锥的敏感度。通过让参与者在黑暗中检测暗淡的光线信号来测量暗适应眼睛(瞳孔放大)的杆状敏感度，并通过受试者识别对比度很低、看起来越来越模糊的彩色字母来测试视锥功能，这一过程被称为颜色对比度。\n然后，所有参与者都拿到了一个小的LED手电筒带回家，并被要求在两周的时间里每天盯着它的深红色670 nm光束3分钟。然后重新测试他们的杆状和圆锥体敏感度。\n研究人员发现，670 nm的光对年轻人没有影响，但在40岁及以上的人中，取得了显著的改善。\n在一些40岁及以上的人中，视锥颜色对比敏感度(辨别颜色的能力)提高了高达20%。在更容易老化的光谱中蓝色部分的改善更为显着。\n在40岁左右及以上的人中，杆状敏感度(在弱光下看东西的能力)也有明显的改善，尽管不如颜色对比度。\n杰弗里教授说：我们的研究表明，通过简单的短暂暴露在光波长下，给视网膜细胞中衰退的能量系统充电，就像给电池充电一样，我们的研究表明，有可能显著改善老年人下降的视力。\n这项技术简单且非常安全，使用的是特定波长的深红色光，该光被视网膜中的线粒体吸收，为细胞功能提供能量。\n我们的设备制造成本约为12 GB，因此公众很容易接触到这项技术。\n材料由伦敦大学学院提供。注意：内容可以根据样式和长度进行编辑。\nGlen Jeffery，Magella Neveu，Victor Chong，Chris Hogg，Sobha SiVaprasad，Manjot Grewal，Harpreet Shinhmar。光学改善的线粒体功能弥补了老年人视力下降的问题。老年学期刊：A辑，2020年；doi：10.1093/gerona/gla155。\n下面是您可能感兴趣的相关文章。科学日报与TrendMD网络中的学术出版物共享链接，并根据需要从第三方广告商那里赚取收入。", "note_en": "Staring at a deep red light for three minutes a day can significantly improve declining eyesight, finds a new study, the first of its kind in humans.\n Staring at a deep red light for three minutes a day can significantly improve declining eyesight, finds a new UCL-led study, the first of its kind in humans.\n    Scientists believe the discovery, published in the  Journals of Gerontology, could signal the dawn of new affordable home-based eye therapies, helping the millions of people globally with naturally declining vision.\n In the UK there are currently around 12 million people aged over 65: in 50 years this will increase to around 20 million and all will have some degree of visual decline because of retinal ageing.\n Lead author, Professor Glen Jeffery (UCL Institute of Ophthalmology) said: &#34;As you age your visual system declines significantly, particularly once over 40.\n &#34;Your retinal sensitivity and your colour vision are both gradually undermined, and with an ageing population, this is an increasingly important issue.\n &#34;To try to stem or reverse this decline, we sought to reboot the retina&#39;s ageing cells with short bursts of longwave light.&#34;\n In humans around 40 years-old, cells in the eye&#39;s retina begin to age, and the pace of this ageing is caused, in part, when the cell&#39;s mitochondria, whose role is to produce energy (known as ATP) and boost cell function, also start to decline.\n     Mitochondrial density is greatest in the retina&#39;s photoreceptor cells, which have high energy demands. As a result, the retina ages faster than other organs, with a 70% ATP reduction over life, causing a significant decline in photoreceptor function as they lack the energy to perform their normal role.\n Researchers built on their previous findings in mice, bumblebees and fruit flies, which all found significant improvements in the function of the retina&#39;s photoreceptors when their eyes were exposed to 670 nanometre (long wavelength) deep red light.\n &#34;Mitochondria have specific light absorbance characteristics influencing their performance: longer wavelengths spanning 650 to 1000nm are absorbed and improve mitochondrial performance to increase energy production,&#34; said Professor Jeffery.\n The retina&#39;s photoreceptor population is formed of cones, which mediate colour vision and rods, which provide peripheral vision and adapt vision in low/dim light.\n For the study, 24 people (12 male, 12 female), aged between 28 and 72, who had no ocular disease, were recruited. All participants&#39; eyes were tested for the sensitivity of their rods and cones at the start of the study. Rod sensitivity was measured in dark adapted eyes (with pupils dilated) by asking participants to detect dim light signals in the dark, and cone function was tested by subjects identifying coloured letters that had very low contrast and appeared increasingly blurred, a process called colour contrast.\n     All participants were then given a small LED torch to take home and were asked to look into its deep red 670nm light beam for three minutes a day for two weeks. They were then re-tested for their rod and cone sensitivity\n  Researchers found the 670nm light had no impact in younger individuals, but in those around 40 years and over, significant improvements were obtained.\n Cone colour contrast sensitivity (the ability to detect colours) improved by up to 20% in some people aged around 40 and over. Improvements were more significant in the blue part of the colour spectrum that is more vulnerable in ageing.\n Rod sensitivity (the ability to see in low light) also improved significantly in those aged around 40 and over, though less than colour contrast.\n Professor Jeffery said: &#34;Our study shows that it is possible to significantly improve vision that has declined in aged individuals using simple brief exposures to light wavelengths that recharge the energy system that has declined in the retina cells, rather like re-charging a battery.\n &#34;The technology is simple and very safe, using a deep red light of a specific wavelength, that is absorbed by mitochondria in the retina that supply energy for cellular function.\n &#34;Our devices cost about £12 to make, so the technology is highly accessible to members of the public.&#34;\n    Materials provided by   University College London.  Note: Content may be edited for style and length.\n    Glen Jeffery, Magella Neveu, Victor Chong, Chris Hogg, Sobha Sivaprasad, Manjot Grewal, Harpreet Shinhmar.  Optically improved mitochondrial function redeems aged human visual decline.  The Journals of Gerontology: Series A, 2020; DOI:  10.1093/gerona/glaa155\n  Below are relevant articles that may interest you. ScienceDaily shares links with scholarly publications in the  TrendMD network and earns revenue from third-party advertisers, where indicated.", "posttime": "2020-06-30 21:32:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深红色,eyesight,视网膜", "title": "通过观察深红色光线改善视力下降", "title_en": "Declining eyesight improved by looking at deep red light", "transed": 1, "url": "https://www.sciencedaily.com/releases/2020/06/200629120241.htm", "via": "", "real_tags": ["深红色", "eyesight", "视网膜"]}, {"category": "", "categoryclass": "", "imagename": "811c7b3546a09e08ece7bc5a11245de0.jpg", "infoid": 1008974, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "弗里德里希·海克斯在林道举行的1983-33届诺贝尔奖得主会议上发表关于进化与自发秩序的演讲。我们知道查尔斯·达尔文的电动汽车理论。", "note_en": "Friedrich Hayeks lecture on Evolution & Spontaneous order at the 1983 - 33rd Meeting of Nobel Laureates at Lindau. We know that Charles Darwin's theory of ev...", "posttime": "2020-06-30 21:31:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "进化,hayek,得主", "title": "弗里德里希·哈耶克谈进化与自发秩序(1983)[视频]", "title_en": "Friedrich Hayek on Evolution and Spontaneous Order (1983) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=yQhqZ-iWMRM", "via": "", "real_tags": ["进化", "hayek", "得主"]}, {"category": "", "categoryclass": "", "imagename": "0ca30eb60e9bb7167c8eac3582e1ea94.jpeg", "infoid": 1008973, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佛罗伦萨文艺复兴时期绘画的杰作之一，在胭脂红教堂的布兰卡奇教堂的壁画周期(1424-1428年)，从从天堂坠落的场景开始。虽然马萨西奥的贡献让这个循环变得真正伟大，但这里的领军大师是马索里诺，他也描绘了开场的图景。在片中，我们看到第一对夫妇在树下轻盈地跳舞，哥特式的姿势，诱人的蛇从树上盘旋在他们身上。但这条蛇有一个奇怪的人头：一张迷人的女性面孔，还有一顶驼背的金色发冠。这女的谁啊？消息灵通的人会立即回答：莉莉丝，亚当的前夫，自从歌德的“女巫星期六”(1808)以来，这个受过教育的欧洲人就认识她了：“梅菲斯托：亚当斯·厄斯特·弗劳！我在Acht von ihren Schönen Haaren，Vor diesem Schmuck，MIT Dem sie Einzig Pangt，Wn sie Damit den Jungen Mann erlangt，所以lä«t sich ihn所以秃顶。“。\n米菲斯托菲尔斯：亚当的第一任妻子是她。当心她可爱的卷发里的诱惑，她头发上华丽的鞋底装饰品！当他成功地诱捕了一个年轻人时，她很快就把他从她的骗局中解救出来了。“。\n这张照片也是前拉斐尔学派的创始人但丁·加布里埃尔·罗塞蒂(Dante Gabriel Rossetti)在1881年出版的题为“身体之美”的十四行诗中取自歌德的，然而，这首十四行诗最初与他的画莉莉丝夫人(1866-1873年)一起拍摄，标题是“Lo！就像那个年轻人的眼睛在你身上燃烧一样，你的咒语也穿过了他，留下了他笔直的脖子，绕着他心脏的一头令人窒息的金发。“。\n另一幅令人印象深刻的拉斐尔之前的莉莉丝肖像画，约翰·科利尔，1892年，默西塞德，阿特金森美术馆。\n然而，我们知道魔鬼是谎言之父，因此，浮士德博士看到的提到莉莉丝的结婚证也是大假的。事实上，莉莉丝出现在希伯来圣经的一个地方，也就是以赛亚书34(13-16)中，上帝预言他将如何摧毁以东：“荆棘将侵占她的宫殿，荨麻和荆棘，她的堡垒。她将成为野狗的出没之地，猫头鹰的居所。沙漠中的生物会与鬣狗相遇，野山羊会互相吠叫。在那里，莉莉丝לִילִית也将躺下，为自己寻找休息的地方。猫头鹰将在那里筑巢下蛋，她将孵化它们，并在她翅膀的阴影下照顾她的幼崽。在那里，猎鹰也会聚集在一起，每只猎鹰都会和它的配偶在一起。“。莉莉丝的角色在这里和所有其他不祥的生物一起，标志着上帝让以东变得多么荒凉。但是关于它到底是一种什么样的存在，我们没有被告知，因为它的名字是hapax legomenon，这个词在圣经中只出现过一次。然而，如果它可以用来表示破坏的程度，那它一定是那个时期的犹太人所熟悉的。就像我们今天读到的，一个地方变成了吸血鬼和兽人的家，德古拉的巢穴。近百年奇幻文学的产物，很大程度上是大众意识中的产物，不需要解释。单词lili和līlītu在美索不达米亚语苏美尔语、阿卡迪亚语和亚述语中的意思是“ʻ精神”，在一些文本中是一种生活在风中的带病精神。很可能就是从那里，从这个意义上讲，巴比伦的犹太人和“圣经”说的是亚拉姆语。在公元4到6世纪，“咒语碗”在该地区很普遍：这些咒语藏在房屋的底部或地面，作为陷阱来捕捉闯入房屋的百合花。这些碗被当地所有的文化和语言所使用。其中数百份是从犹太人那里发现的，这些文本都是用亚拉姆语写成的。圣经或塔木德文献。宾夕法尼亚博物馆收藏的公元6世纪犹太咒语(上图)和当代咒语(下图)。\n通常情况下，圣经译本不知道如何处理这个名字。七十年，希腊语翻译的散居犹太人将鬣狗和莉莉丝合并在一起，命名为“onocentaur”，并将理解为Satyre的山羊翻译为“恶魔”。“καὶσυναντήσουσινδαιμόνιαὀνοκενταύροιςκαὶβοήσουσινἕτεροςπρὸςτὸνἕτερονἐκεῗἀναπαύσονταιὀνοκένταυροιεὗρονγὰραὑτοῗςἀνάπαυσιν”\n魔鬼必遇见角龙，彼此哀号。角龙必在那里安息，在那里找安息的地方。\n基本上，紧随其后的是圣杰罗姆的拉丁文译本Vulgate，它将莉莉丝翻译成希腊神话中吞噬儿童的女恶魔拉米亚：“et occurrent daemonia onocentauris et pilosus clabit Alter ad ateum，ibi cuavit lamia et Invenit Sibi Requiem”(“et occurrent daemonia onocentauris et pilosus clabit alt ad ateum，ibi cuavit lamia et Invenit Sibi Requiem”)。\n“魔鬼将会遇见一条近距龙，毛茸茸的生物会互相哭喊。喇嘛也住在那里，它在那里找到了休息的地方。“。\n“ʻonocentaur”的意思只比“莉莉丝”稍微清楚一点。根据ὄνος=DONKEY，它被解释为一种驴-半人马。这就是12世纪的佛朗哥-佛兰德兽医用来描述恶魔与月牙龙相遇的方式：在犹太拉比文献中，这个名字只出现了四次，总是提到以赛亚的文本，在某种意义上说是“邪恶的精神”，直到公元8-10年，也就是直到中世纪，希伯来的一篇名为“本西拉的字母表”的论文才把它变成了一个人，而在公元8-10世纪，也就是直到中世纪，希伯来的一篇名为“本·西拉的字母表”的论文才把它变成了一个人。这篇论文包含了两次22句阿拉姆语和希伯来语谚语，按照希伯来语字母表排列，并用米德拉什故事阐明了每个谚语的含义。根据我们这里感兴趣的故事，本·西拉用护身符治愈了尼布甲尼撒国王生病的小儿子。当国王问他在护身符上写了什么时，本·西拉告诉他，上帝从尘土中捏出了第一对人类夫妇，因此他们是平等的。因此，这个名叫莉莉丝的女人不想按照犹太性道德的要求躺在亚当的床上，但她想要高高在上。她反抗并逃往红海，在那里她与恶魔交配。上帝派了三位天使来追赶她，塞诺伊、桑森诺伊和塞曼格洛夫，但是他们都没能把她带回来。他们唯一能同意的是，虽然她现在作为一个恶魔有能力感染新生儿，但如果这三个天使的名字写在什么地方，她不会伤害那里的孩子。文学认为这个tractate是一种讽刺，由无聊的yeshivbohers带来的恶搞汇编，一个巨大的恶作剧充满了书生气的塔木德胡闹各种淫秽，从放屁通过手淫到乱伦(例如，本·西拉自己据说出生于先知耶利米和他自己的女儿的联盟)。这就是我们必须认真对待莉莉丝作为亚当第一任妻子的传统。的确，在“创世纪”的双重创造故事中，上帝首先按照自己的形象创造了男人和女人(创世记1：27)，然后他从男人的肋骨创造了女人(创世纪2：22)。对于信奉圣经字面解释的人来说，这是两个创造：但是，第一个女人在哪里呢？这一逻辑上的中断是由yeshivbohers与莉莉丝弥补的，这在圣经和犹太法典中没有任何真正的意义。然而，在他们之前，犹太和基督教的训诂传统都没有提出和回答这个问题，特别是没有通过创造一个“第一任妻子”来提出和回答这个问题。无论如何，建议避免儿童死亡的护身符听起来太好了，不能掉以轻心。安全胜过遗憾，护身符在犹太圈子里开始成为现实，并被广泛使用，直到20世纪。一个中世纪的护身符，上面写着三个鸟一样的天使的名字，来自阿姆斯特丹1701年版的Sepher Raziel HaMalach(大天使拉齐尔的秘籍)(上图)，一个18世纪印刷的kimpetbrivl(Kind+Bit+Briv，儿童床单)(下图)，以及一个19世纪的银色护身符，上面写着莉莉丝的形象，来自耶路撒冷以色列博物馆的藏品(更多信息如下)。\n随着护身符的出现，莉莉丝作为亚当的第一任妻子的想法逐渐在犹太民间的宗教信仰中扎根。然而，当基督徒第一次熟悉这个他们认为是非常古老和神圣的秘密知识的犹太传统时，这个想法更加令他们兴奋。这就发生在15世纪末的佛罗伦萨，当时在洛伦佐·德·美第奇的柏拉图学院，第一位基督教卡巴拉作家皮科·德拉·米兰多拉是其中的一员，他们开始翻译卡巴拉和拉比文学的节选。这就是这个主题是如何出现在作为学院参观者的艺术家的作品中的。例如，菲利皮诺·里皮(Filippino Lippi)在圣玛丽亚·诺维拉(Santa Maria Novella)的菲利波·斯特罗齐教堂(Filippo Strozzi Chapel)画了前四位族长，包括亚当(Adam)保护他的小儿子塞斯(Seth)免受莉莉丝的伤害(同时他还梦幻般地看着他浓密的红色头发的前男友)。一些艺术历史学家在米开朗基罗的西斯廷教堂的诱惑中也看到了莉莉丝，或者在博世的“地上欢乐园的第一个女人”中也看到了莉莉丝，但他们的论点并不令人信服：这些作品可以从中世纪的基督教传统中完美地解释出来，我们将在下面看到这一点。然而，新柏拉图主义思潮在16世纪消亡了。莉莉丝被歌德复活，并被前拉斐尔派提升到新的高度，成为“维多利亚时代的偶像”，以至于她现在被认为是女权主义的守护神，成为第一个没有放弃与男性平等的女性。看看现代圣经翻译是如何随着莉莉丝神话的传播而变化的，以及由叶什瓦博、歌德和前拉斐尔派创造的莉莉丝是如何变化的，这是很有趣的。\n从意大利作家的作品到意大利画家的作品，绘制主题也只有一步之遥。14世纪20年代初，保罗·乌切洛(Paolo Uccello)受委托在佛罗伦萨的圣玛丽亚·诺维拉(Santa Maria Novella)所谓的绿色修道院绘制创作和秋天的循环。这些画在1966年的阿诺洪水中遭到严重破坏，当马萨西奥在这里创作三位一体的壁画时，这些画仍然新鲜，同时也在布兰卡奇教堂的壁画周期中工作，那里很快就会出现一个类似的女性头像诱惑者。我们已经看过演员了，让循环开始吧。\n马格雅鲁尔", "note_en": "One of the masterpieces of Florentine Renaissance painting, the fresco cycle 1424-1428) in the Brancacci Chapel of the Carmine Church, begins with the scene of the Fall from Paradise. While the cycle was made truly great by Masaccio’s contribution, the leading master here was Masolino, and he also painted the opening picture. In it, we see the first couple in a light, dancing, Gothic posture under the tree from which the tempting snake hovers over them. But this snake has a strangely human head: a charming female face with a hunge blonde crown of hair.  Who is this woman?  The well-informed would immediately reply: Lilith, Adam’s ex, who has been known to the educated European since Goethe’s  Witch Saturday (1808):   “MEPHISTO: Adams erste Frau! Nimm dich in Acht von ihren schönen Haaren, Vor diesem Schmuck, mit dem sie einzig prangt, Wenn sie damit den jungen Mann erlangt, So läßt sich ihn so bald nicht wieder fahren.”\n  “MEPHISTOPHELES: Adam’s first wife is she. Beware the lure within her lovely tresses, The splendid sole adornment of her hair! When he succeeds therewith a youth to snare, Not soon again she frees him from her jesses.”\n This picture is also taken from Goethe by Dante Gabriel Rossetti, the founder of the Pre-Raphaelite school, in his sonnet entitled  Body’s Beauty, published in 1881, which, however, originally accompanied his picture  Lady Lilith (1866-1873) with the title  Lilith:   „Lo! as that youth’s eyes burned at thine, so went Thy spell through him, and left his straight neck bent And round his heart one strangling golden hair.”\n     The other impressive Pre-Raphaelite portrait of Lilith by John Collier, 1892, Merseyside, Atkinson Art Gallery\n However, we know that the devil is the father of lies, and thus the marriage certificate shown to Dr. Faust that mentions Lilith is also a big fake.  In fact, Lilith appears in one single place in the Hebrew Bible, in Isaiah 34 (13-16), where the Lord foretells how He would destroy Edom:   “Thorns will overrun her citadels, nettles and brambles her strongholds. She will become a haunt for jackals, a home for owls. Desert creatures will meet with hyenas, and wild goats will bleat to each other. There the  lilith  לִילִית will also lie down and find for themselves places of rest. The owl will nest there and lay eggs, she will hatch them and care for her young under the shadow of her wings. There also the falcons will gather, each with its mate.”  The role of the  lilith is here to mark, along with all the other ominous beings, how desolate the Lord makes Edom. But as to exactly what kind of being it is, we are not told, since the name is a  hapax legomenon, a word that only occurs once in the Bible. Nevertheless, it must have been familiar to the Jews of the period if it could be used to indicate the extent of destruction. As if we were reading today that a place has become a home for vampires and orcs, the nest of Dracula. The products of the fantasy literature of the last hundred years are pretty much in the public consciousness, they don’t need to be explained.  The words  lili and  līlītu in the Mesopotamian languages Sumerian, Akkadian and Assyrian, meant ʻspirit’, in some texts a disease-bearing spirit living in the wind. It was probably from there and in this sense transferred into the Aramaic language spoken by the Jews of Babylon and the Bible. In the 4th to 6th century AD,  “bowls of incantation” were widespread in the area: these were hidden in the base or ground of the houses as traps to catch the  liliths intruding in the houses. These bowls were used by all local cultures and languages. Several hundred of them have been found from Jews with texts in Aramaic. biblical or talmudic references.   A Jewish bowl of incantation from the 6th century (above) and its contemporary counterpart collected by Penn Museum (below)\n    Typically, Bible translations did not know what to do with the name. The Septuagint, the Greek translation of the Diaspora Jews merges the hyenas with the  lilith under the name “onocentaur”, and translates the goat, understood as a satyre, as “demon”.   “καὶ συναντήσουσιν δαιμόνια ὀνοκενταύροις καὶ βοήσουσιν ἕτερος πρὸς τὸν ἕτερον ἐκεῗ ἀναπαύσονται ὀνοκένταυροι εὗρον γὰρ αὑτοῗς ἀνάπαυσιν”\n  “and demons will meet onocentaurs, and they will cry to each other; there will rest the onocentaurs, finding a resting place there.”\n Basically, this translation is followed by the Vulgate, the Latin translation of St. Jerome, which translates the  lilith as  lamia, a child-devoring female demon in Greek mythology:   “et occurrent daemonia onocentauris et pilosus clamabit alter ad alterum, ibi cubavit lamia et invenit sibi requiem”\n  “and demons will meet onocentaurs, and hairy beings cry to each other. The  lamia also abides there, it finds a resting place there.”\n The meaning of ʻonocentaur’ was only slightly clearer than that of the  lilith. Based on ὄνος = donkey, it was interpreted as a kind of donkey-centaur. This is how a  12th-century Franco-Flemish bestiary depicts the encounter of the demon with the onocentaur:     In Jewish rabbinic literature, the name only occurs four times, always referring to the text of Isaiah, in a sense of “evil spirit” until the 8-10th c. AD, that is, well into the Middle Ages, when a Hebrew treatise called  The Alphabet of Ben Sira made it a person. The treatise contains twice 22 proverbs in Aramaic and Hebrew, arranged according to the Hebrew alphabet, and illuminates the meaning of each with a Midrashic story. According to the story that interests us here, Ben Sira heals the sick little son of King Nebuchadnezzar with an amulet. When the king asks him what he wrote on the amulet, Ben Sira tells him that God kneaded the first human couple from the dust of earth, and they were thus equal. The woman, Lilith, therefore, did not want to lie under Adam in the bed, as required by Jewish sexual morals, but she wanted to be above. She rebelled and fled to the Red Sea, where she mated with demons. God sent three angels after her, Senoy, Sansenoy and Semangelof, who, however, failed to bring her back. All they could agree with her was that although she as a demon now had power to infect newborn children, nevertheless if the names of these three angels were written somewhere, she would not hurt the child there.  Literature considers this tractate  a kind of satire, a compilation of parodies brought together by bored  yeshivabohers, a huge hoax full of pedantic talmudic  hochmetsing over assorted smut, from farting through masturbation to incest (for example, Ben Sira himself is said to be born from the union of Prophet Jeremiah with his own daughter). This is how seriously we have to take the tradition of Lilith as Adam’s first wife. True, in the double creation story of the Book of Genesis, God first creates the man and the woman in His own image (Gen 1:27), and then He creates the woman from the rib of the man (Gen 2:22). For believers in the literal interpretation of the Bible, these were  two creations: but then, where is the first woman? This logical hiatus was made up for by the  yeshivabohers with the  lilith which stood without any real meaning in the Bible and the Talmud. Before them, however, neither the Jewish nor the Christian exegetical tradition raised and answered this question, especially not by creating a “first wife”.  In any case, the amulet recommended against child death sounded too good to be left behind.  Better safe than sorry, the amulet began to become a reality in Jewish circles, and was widely used until the 20th century.   A medieval amulet, with the names of the three angels in the three bird-like figures, from the Amsterdam 1701 edition of  Sepher Raziel HaMalach (Archangel Raziel’s Secret Book) (above), a 18th-century printed  kimpetbrivl (kind+bet+briv, child-bed-letter) from the Jewish Museum in Berlin (below), and a 19th-century silver amulet with the figure of Lilith from the collection of the Israel Museum in Jerusalem (more below)\n       And along with the amulet, the idea of Lilith as Adam’s first wife gradually took root in Jewish folk religiosity. However, this idea excited Christians even more, when they first became acquainted with this Jewish tradition which they considered a very ancient and holy secret knowledge. This happened just in Florence at the end of the 15th century, when in Lorenzo de’ Medici’s Platonic Academy, of which Pico della Mirandola, the first Christian kabbalist, was a member, they started translating excerpts from the Kabbalah and rabbinic literature. This is how the motif appeared in works of artists who were visitors of the Academy.    Filippino Lippi, for example, painted in the Filippo Strozzi Chapel of Santa Maria Novella the first four patriarchs, including Adam as he protects his little son Seth from Lilith (while he still casts a dreamy look at his ex of rich red hair). Some art historians also see Lilith in Michelangelo’s temptress in the Sistine Chapel, or in Bosch’s first woman in the Garden of Earthly Delights, but their arguments are not convincing: these works can be perfectly explained from the medieval Christian tradition, which we will see below.           The Neoplatonic trend, however, died out in the 16th century. Lilith was resurrected by Goethe, and elevated to new heights and made  a “Victorian icon” by the Pre-Raphaelites, so much that she is now  considered a feminist patron saint as the first woman who did not renounce her equality with man.  It is interesting to see how modern Bible translations change with the spread of the Lilith myth, and how Lilith, created by the  yeshivabohers, Goethe and the Pre-Raphaelites, moves into the barren homestead of the  lilith as a harmful spirit of Is 34:14. Luther still translates  lilith as  Kobold, the later versions as  Gespenster, ʻspirits’, while the Geneva Schlechter of 2000 as  Lilith. The earliest English versions as  lamia, borrowed from the Vulgate, the King James Version as  screech owl, while the later English versions represented it more and more as  lilith, and even  Lilith. The first – Protestant – Hungarian version has  éji boszorkány (night witch), while the new Catholic version has  Lilith. The myth seems to have done a good job, and soon you will be able to prove from the Bible itself that Lilith was a central figure of ancient Jewish faith, at least since the time of Isaiah.     The very first printed amulet against Lilith. Amsterdam, c. 1700. “Adam and Eve, excluding Lilith. Senoy, Sansenoy and Semangelof guardian angels, break the Satan.”\n The image of the maiden-headed serpent tempting Adam and Eve in paradise, however, had been born much before the Jewish esoteric tradition was translated in the Medici court: in fact, not long after the  yeshivabohers’ arsing-about gave birth to Lilith as Adam’s first wife. Its author, Petrus Comestor was the head of the 12th-century Parisian theological school, who in 1173 published his  Historia scholastica, the “popular Bible” of the Middle Ages, which became a basic handbook of the university curriculum and was translated into most European vernaculars. He wrote:   “Because Lucifer was afraid of being found out by the man, he approached the woman, who had less foresight and was [like] «wax to be twisted into vice» and this by means of the serpent; for the serpent at that time was erect like a man, since it was laid prostrate when it was cursed. … He also chose a certain kind of serpent … which had the countenance of a virgin, because like favors like; and he moved its tongue to speak, though it knew nothing itself, just as he speaks through the frenzied and the possessed.”   A maiden-headed snake standing on two feet in Hugo van der Goes’  The fall of man (after 1479), in Vienna’s Kunsthistorisches Museum\n        Book of Hours, Bruges or Ghent, 15th c. Beinecke Rare Book and Manuscript Library, MS 287, fol. 46r\n  And here you have that “certain kind of serpent” chosen by Lucifer: the  draconcopes (=ʻsnake-footed’). From the  Hortus Sanitatis,1491. Originally from Vincent of Beauvais’ 13th-century  Speculum naturale:  “Draconcopedes serpentes magni sunt, et potentes, facies virgineas habentes humanis similes, in draconum corpus desinentes.” ( Dracontopedes are large and strong snakes, whose maiden-face is similar to the man, but their body ends in snake body.)\n The image was adopted by many authors. One of its most popular distributors was the 12th-century Norman-English mystery play  Le Jeu d’Adam, which, in three acts, presented creation, the Fall and the prophecies about the coming of the Savior ( here you can see its modern presentation). The piece, played across Europe, was mostly performed in front of the main gates of the cathedrals, and at a certain point displayed a “cleverly contrived” snake on a tree. It was certainly maiden-headed, because its figure also passed on to the carvings of the portals made at that time.    Another important mediator of the image was Boccaccio’s  On Famous Women (De mulieribus claris), also translated into many languages. The series of famous women began with Eve, whose story, in the 14th- and 15th-century manuscripts, was illustrated with the Fall, invariably with a maiden-headed snake. The most moving example is the  manuscript at the Getty Museum illustrated by the  Boucicaut Master between 1413 and 1415, in the opening picture of which Boccaccio, sitting at his desk at the left side wall of the Paradise, is waiting for old Adam and Eve arriving from the right, to record oral history with them.      Très Riches Heures du duc de Berry, Limbourg brothers, between 1411 and 1415, fol. 25v\n  Boccaccio,  The Fall of Princes, translated by John Lydgate, 1450-60. British Library, Harley 1766, fol. 11r\n    It was only a step away from the work of an Italian author to an Italian painter to paint the motif as well. In the early 1420s, Paolo Uccello was commissioned to paint the cycle of Creation and Fall in the so-called Green Cloister of Santa Maria Novella in Florence. The pictures – which were severely damaged by the 1966 flood of Arno – were still fresh when Masaccio worked here  on the fresco of the Trinity, and in parallel on the fresco cycle of the Brancacci Chapel, where a similar woman-headed tempter would soon appear.           We have seen the actors; let the cycle begin.\n   magyarul", "posttime": "2020-06-30 21:30:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lilith,犹太", "title": "莉莉丝和德拉康科普", "title_en": "Lilith and the Draconcopes", "transed": 1, "url": "http://riowang.blogspot.com/2020/06/lilith-and-the-draconcopes.html", "via": "", "real_tags": ["lilith", "犹太"]}, {"category": "", "categoryclass": "", "imagename": "c43b5ba5c78304a46542cf8540a743b8.jpg", "infoid": 1008971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们详细研究过的每个视觉模型都包含能检测曲线的神经元。早在2013年的文献中就已经暗示了视觉模型中的曲线检测器(参见Zeiler&amp；Fergus中的数字)，神经科学中也对类似的神经元进行了仔细的研究。我们在先前对早期视觉的概述中简要讨论了曲线，但希望更深入地研究它们。这篇文章是深入研究曲线检测器的三篇文章的第一部分：它们的行为，它们是如何从早期的神经元中构建的，以及它们在模型中的流行程度。\n我们之所以这样做，是因为我们认为可解释性社区在几个关键问题上存在分歧。具体地说，神经网络表示是否由有意义的特征 - (即跟踪图像的可伸缩属性的特征)组成？一方面，有许多论文报道了一些看似有意义的功能，如眼睛检测器、头部检测器、汽车检测器等等。与此同时，有相当数量的怀疑，只有部分反映在文献中。一个令人担忧的问题是，表面上看起来有意义的特征实际上可能并不是它们看起来的那样。几篇论文提出，神经网络主要检测纹理或难以察觉的模式，而不是前面描述的那种有意义的特征。最后，即使存在一些有意义的功能，它们也可能不会在网络中扮演特别重要的角色。一些人通过以下结论来协调这些结果：例如，如果人们观察到看起来像是狗头检测器的东西，那么它实际上是与狗头相关的特殊纹理的检测器。\n这种分歧真的很重要。如果每个神经元都是有意义的，并且它们的连接形成了有意义的电路，我们相信这将开辟一条完全逆向工程和解释神经网络的道路。当然，我们知道并不是每个神经元都是有意义的，就像在放大中所讨论的那样，我们看到的主要问题是我们所说的多语义神经元，它们对多种不同的特征做出反应，似乎是为了将许多特征压缩到更少的神经元中。我们希望这件事能解决。但我们认为它足够近，这条路很容易走。不过，我们的立场绝对不是共识。此外，这似乎好得令人难以置信，在其他领域也出现了类似的失败承诺。例如，遗传学过去似乎一直乐观地认为，基因具有个体功能，人类基因组计划将使我们能够“挖掘奇迹”，这一立场现在似乎被认为是天真的。 - 的怀疑绝对是有根据的！\n我们相信，曲线检测器是在这一分歧上取得进展的一个很好的工具。曲线检测器看起来像是边缘检测Gabor滤波器的一小步，社区普遍认为Gabor滤波器通常形成于第一卷积层。此外，人工曲线很容易生成，为严格的研究打开了许多可能性。事实上，它们只有几层卷积层，这意味着我们可以跟随每一串神经元回到输入。同时，该模型实现的用于曲线检测的底层算法相当复杂。如果这篇论文让怀疑者相信至少存在曲线检测器，那似乎是向前迈出了实质性的一步。同样，如果它出现一个更精确的分歧点，那也将推动对话。\n在进行详细的实验之前，让我们先来看看3b中的10条曲线神经元是如何工作的，这是一个高水平的略微简化的故事。\n每个曲线检测器都实现了相同算法的一个变体：它响应各种各样的曲线，优先选择特定方向的曲线，并且随着方向的改变逐渐减少触发。曲线神经元不受外观属性的影响，如亮度、纹理和颜色。\n曲线探测器具有稀疏的激活，仅对图像的10%的空间位置感受场大小的裁剪做出反应。在ImageNet上，通常在他们开火时激活得很弱。当它们被强烈激活时，它是对具有与其特征可视化相似的方向和曲率的曲线的响应。\n值得后退一步反思一下，像曲线检测器这样看似有意义的功能的存在是多么令人惊讶。这个网络没有明确的动机去形成有意义的神经元。这并不是说我们优化了这些神经元，使其成为曲线检测器！相反，InceptionV1被训练成将图像分类成从曲线中移除的许多级别的抽象，并且不知何故曲线检测器脱离了梯度下降。\n此外，在各种自然图像中检测曲线在经典的计算机视觉中是一个困难且可以说是未解决的问题。这是我们试图实现程序化的曲线检测以将它们与曲线神经元进行比较的意义所在。我们发现，从业者通常必须在几种算法之间进行选择，每种算法都有重要的折衷，例如对不同种类的视觉“噪音”(例如，纹理)的鲁棒性，即使是在比ImageNet中的自然图像简单得多的图像中也是如此。例如，StackOverflow上的这个答案声称“一般来说，[曲线检测]问题是一个非常具有挑战性的问题，除了玩具示例，没有好的解决方案。”此外，许多经典的曲线检测算法速度太慢，不能实时运行，或者通常需要难以处理的内存量。InceptionV1似乎学会了这个问题的灵活而通用的解决方案，使用五个卷积层实现。我们将在下一篇文章中看到所使用的算法是简单易懂的，此后我们已经手动重新实现了它。\n当我们说这些神经元探测曲线的时候，我们到底在说什么？我们认为，有时对于神经元是否检测到特定刺激存在分歧的部分原因是，人们可能会提出各种不同的主张。很容易证明，从经验上讲，当曲线探测器强烈发射时，刺激是可靠的曲线。但还有其他几种说法可能更具争议性：\n因果曲线检测器真正检测曲线特征，而不是与曲线相关的另一个刺激。我们相信我们的特征可视化和可视化属性实验建立了因果联系，因为“反向运行”会产生一条曲线。\n通用性：曲线检测器对各种各样的曲线刺激作出反应。它们可以容忍很大范围的半径，并且在很大程度上不受颜色、亮度和质地等美容属性的影响。我们相信，我们用合成刺激明确测试这些不变性的实验是最令人信服的证据。\n纯度：曲线检测器不是多义的，它们没有有意义的二级功能。导致曲线检测器弱激活的图像(如边或角度)是InceptionV1用于实现曲线检测的算法的自然扩展。我们相信，我们对不同激活程度的数据集示例进行分类并可视化它们的属性的实验表明，任何二级函数都需要是罕见的。在下一篇文章中，我们将探索实现曲线检测器的算法的机制，为这一主张提供进一步的证据。\n特征可视化使用最优化来找到最大化给定目标的神经网络的输入。我们经常使用的目标是使神经元尽可能强烈地激发，但在本文中我们将通篇使用其他目标。特征可视化功能强大的一个原因是它告诉我们因果关系。由于输入是从随机噪声开始的，并且优化像素而不是生成先验，因此我们可以确信结果图像中的任何属性都有助于实现目标。\n阅读功能可视化是一项技能，如果您以前没有花太多时间阅读这些图像，那么它们可能会让您感到迷失方向。最重要的是要去掉曲线的形状。您可能还会注意到，曲线的每一侧都有明亮的相反色调颜色：这反映了在曲线边界看到颜色机会的偏好。最后，如果你仔细看，你会注意到垂直于曲线边界的小线。我们将这种对小垂直线的微弱偏好称为“梳理”，稍后将对此进行讨论。\n每次我们使用特征可视化来使曲线神经元尽可能强烈地放电时，我们都会得到曲线的图像，即使我们明确鼓励使用多样性项创建不同类型的图像。这有力地证明了曲线检测器并不是我们通常使用的意义上的多义性，大致相等地偏爱不同种类的刺激。\n特征可视化可以找到最大限度地导致神经元放电的图像，但是这些超刺激是否代表神经元的行为呢？当我们看到特征可视化时，我们通常会想象神经元强烈地激发与其性质相似的刺激，随着刺激表现出较少的视觉特征，神经元会逐渐变弱。但是人们可以想象神经元的行为在非极端激活中完全不同的情况，或者在极端刺激的混乱版本中它确实激发得很弱的情况，但它也有第二类刺激，它对它的反应很弱。\n如果我们想要了解神经元在实践中的行为，没有什么可以替代简单地观察它是如何对数据集中的图像做出实际反应的。\n在研究数据集时，我们将重点介绍3b：379，因为有些实验需要大量的手工劳动。但是，本节的核心思想将适用于3b中的所有曲线检测器。\n3B：379多久开一次火？当它开火的时候，它多久会猛烈开火一次？当它不开火的时候，它是不是经常受到强烈的抑制，或者只是处于开火的边缘？我们可以通过可视化数据集中的激活分布来回答这些问题。\n在研究RELU网络时，我们发现观察预激活值的分布是有帮助的。由于RELU只是截断了左手侧，因此很容易推断激活后的值，但它也向我们显示了在其他情况下神经元离放电有多近。查看预激活值还可以避免分布的狄拉克增量峰值为零。我们发现3b：379的预活化平均值约为-200。它只在整个数据集11%的情况下触发，因为负值将由RELU激活函数设置为零。\n如果我们看一张概率的对数图，我们会发现激活机制遵循指数分布，观察到神经网络的激活通常遵循指数分布的观察是由Brice Ménard首先向我们提出的，他观察到除了几个网络的第一层之外，所有的网络都是这种情况。这有点令人惊讶，既是因为它们似乎完全遵循指数分布，也是因为人们经常期望随机变量的线性组合形成高斯，与曲线图中的一条直线相对应。这样做的一个结果是，由于概率密度在高斯的e−x e^{-x}e−x而不是e−x 2 e^{-x^2}e−x 2处衰减，我们应该期望分布有长尾。\n要定性地理解此分布的不同部分，我们可以通过激活渲染一组图像，随机采样导致3b：379激活不同数量的图像。被子上有图案。引起最强烈激活的图像具有类似于神经元特征可视化的曲线。导致微弱正激活的图像是不完美的曲线，要么太平，要么偏离方向，要么有其他缺陷。导致重新启动前接近零的图像往往是直线或没有圆弧的图像，尽管有些图像是偏离方向约45度的曲线。最后，引起最强烈负激活的图像的方向与神经元的理想曲线相距超过45度。\n图像的被子揭示了各种激活的模式，但它们可能会产生误导。由于神经元对接受野大小的图像片段的激活只是一个单一的数字，我们不能确定图像的哪一部分导致了这种情况。因此，我们可能会被虚假的关联所愚弄。例如，由于导致3b：379激发最强烈的许多图像是时钟，我们可能认为神经元检测的是时钟，而不是曲线。\n为了了解为什么图像会刺激神经元，我们可以使用特征可视化来可视化图像对神经元的属性。\n我们用来研究神经元家族的大多数工具，包括特征可视化，都可以用在使用属性的特定图像的上下文中。\n关于如何在神经网络中进行属性识别，有大量的工作要做。)。这些方法试图描述导致神经元放电的是哪些像素或较早的神经元。在复杂非线性函数的一般情况下，对于哪些属性方法是原则性的，以及它们是否可靠，存在着很大的分歧。但在线性情况下，归因通常是一致的，大多数方法都会崩溃到相同的答案。在x，w⋅x w\\cdot x w⋅x的线性函数中，分量x i x_i x i​对输出的贡献是w i x i w_ix_i w i​x i​。描述每个分量贡献的属性向量(或张量)为(w 0 x 0，w w 1 x 1，…。)(w_0x_0，~w_1x_1，~\\ldots)(w 0​x 0​，w 1​x 1​，…。)。\n由于神经元的预激活函数和偏差值是其前一层神经元的线性函数，因此我们可以使用这种公认的归因方法。具体地说，3b的预激活值中的曲线检测器是3a的线性函数。描述前一层中的所有神经元如何影响给定神经元的属性张量是逐点激活乘以权重。\n我们通常使用特征可视化来创建超刺激来激活单个神经元，但我们也可以使用它来激活神经元的线性组合。通过将特征可视化应用于属性张量，我们正在创建最大限度地激活3a中的神经元的刺激，这导致了3b：379的激发。此外，我们将使用属性张量的绝对值，它向我们显示导致神经元放电的特征以及抑制它的特征。这对于观察影响我们的治愈神经元的曲线相关视觉属性很有用，即使这种影响是为了让它发射得更少。\n将这些组合在一起得到FeatureVisualization(abs(W⊙h p r e v))\\text{FeatureVisualization}(\\text{abs}(W\\odoth_{prev}))FeatureVisualization(abs(W⊙h p r e v​))，其中W W是给定神经元的权重，h p r e v h_{prev}h p r e v​是前一个隐藏层的激活。在实践中，我们发现将这些属性可视化参数化为灰度化和透明化是有帮助的，这使得可视化对于非专家来说更容易阅读。示例代码可以在笔记本中找到。\n我们还可以使用属性来更深入地重温前面的数据集示例的被子，看看为什么每个图像都会导致3b：379着火。您可以单击图在查看原始图像和属性矢量要素可视化之间切换。\n虽然上面的实验可视化了3a中的每个神经元，但属性是一个强大而灵活的工具，可以用来以各种方式应用于电路研究。例如，我们可以可视化图像如何在3b之前的早期视觉中流经每个神经元家族，将图像的激活矢量和属性矢量可视化到沿途每个家族的神经元曲线。每个激活矢量将显示一个家庭在图像中看到了什么，每个属性矢量将向我们显示它是如何帮助激活3b：379的。\n在下一节中，我们将介绍一种从数据集图像中提取信息的不太复杂的技术：蒙住眼睛，不让自己看到神经元的激活，并手动对图像进行分类。\n本文作者尼克·卡马拉塔(Nick Cammarata)手动将800多幅图像分为四组：曲线、不完美曲线、无关图像或相反曲线。我们从3b：379次激活中随机抽取了固定数量的图像，每箱100张，我们不是从这些垃圾箱中挑选出来的。本文中的数据来自我们的第一次图像采样。在标记时，尼克只能看到图像的像素，而不能看到其他信息，如神经元的激活或归因可视化。他在贴标签时使用了以下准则：\n曲线：图像中有一条与神经元特征可视化方向相似的曲线。这条曲线横跨图像的大部分宽度。\n不完美曲线：图像有一条类似于神经元特征可视化的曲线，但至少有一个明显的缺陷。可能它太平了，有一个角度打断了圆弧，或者方向稍微偏了一点。\n相反的曲线：图像中有一条曲线与神经元的特征可视化相差超过45度。\n在手工标记这些图像之后，我们将我们的标记与相同图像上的3b：379次激活进行了比较。使用堆积图我们可以看到，不同的标签清晰地分为不同的激活。有趣的是，在标记过程中，尼克觉得很难将样本分组，因为许多图像似乎都落入了规则的边界内。当我们看到激活明显地分为不同级别的激活时，我们感到很惊讶。\n尽管如此，仍然有许多图像会导致神经元激活，但不被归类为曲线或不完美的曲线。当我们将属性可视化到3b：379时，我们看到许多图像包含微妙的曲线。\n尼克发现很难从数百张曲线图像中检测出细微的曲线，因为他开始体验到长时间观察一种刺激时出现的余像效应。因此，他发现很难判断微妙的曲线是否仅仅是知觉错觉。通过可视化属性，我们可以揭示神经元在图像中看到的曲线，向我们显示我们的标记过程遗漏的曲线。在这些情况下，3b：379似乎是一个超人的曲线探测器。\n这些图表对比较我们的手工标签很有帮助，但它们提供的情况并不完整。虽然3b：379在强烈射击时似乎对曲线刺激有很高的选择性，但这只是它开火的一小部分情况。大多数时候，它根本不会开火，而且当它开火时，通常是非常微弱的。\n要了解这一点，我们可以查看来自所有ImageNet示例的激活幅度的概率密度，这些概率密度被分成与我们手工标记的数据集相同的每个激活幅度(x轴)的类比率。\n从这个角度来看，我们甚至看不到我们的神经元强烈激发的情况！当我们向右移动时，概率密度呈指数衰减，所以这种激活是很少见的。在某种程度上，如果这些神经元真的检测到曲线，这是我们应该预料到的，因为清晰的曲线很少出现在图像中。\n也许更令人担忧的是，尽管曲线只是3b：379仅微弱发射或没有发射的情况的一小部分，但这张图似乎表明，在这些情况下，大多数被归类为曲线的刺激也会下降，这是因为神经元强烈放电的情况更罕见许多个数量级。这似乎至少是部分内容。\n..", "note_en": "Every vision model we’ve explored in detail contains neurons which detect curves. Curve detectors in vision models have been hinted at in the literature as far back as 2013 (see figures in Zeiler &amp; Fergus  ), and similar neurons have been studied carefully in neuroscience  . We  briefly discussed curve in our earlier overview of early vision, but wanted to examine them in more depth. This article is the first part of a three article deep dive into curve detectors: their behavior, how they’re built from earlier neurons, and their prevalence across models.\n We’re doing this because we believe that the interpretability community disagrees on several crucial questions. In particular, are neural network representations composed of meaningful features — that is, features tracking articulable properties of images? On the one hand, there are a number of papers reporting on seemingly meaningful features, such as eye detectors, head detectors, car detectors, and so forth  . At the same time, there’s a significant amount of skepticism, only partially reflected in the literature. One concern is that features which seem superficially to be meaningful may in fact not be what they appear  . Several papers have suggested that neural networks primarily detect textures or imperceptible patterns  rather than the kind of meaningful features described earlier. Finally, even if some meaningful features exist, it’s possible they don’t play an especially important role in the network . Some reconcile these results by concluding that if one observes, for example, what appears to be a dog head detector, it is actually a detector for special textures correlated with dog heads.\n This disagreement really matters. If every neuron was meaningful, and their connections formed meaningful circuits, we believe it would open a path to completely reverse engineering and interpreting neural networks. Of course, we know not every neuron is meaningful,  As discussed in Zoom In, the main issue we see is what we call polysemantic neurons which respond to multiple different features, seemingly as a way to compress many features into a smaller number of neurons. We’re hopeful this can be worked around. but we think it’s close enough for this path to be tractable. However, our position is definitely not the consensus view. Moreover, it seems too good to be true, and rings of the similar failed promises in other fields For example, genetics seems to have been optimistic in the past that genes had individual functions and that the human genome project would allow us to “mine miracles,” a position which now seems to be regarded as having been naive. — skepticism is definitely warranted!\n We believe that curve detectors are a good vehicle for making progress on this disagreement. Curve detectors seem like a modest step from edge-detecting Gabor filters, which the community widely agrees often form in the first convolutional layer. Furthermore, artificial curves are simple to generate, opening up lots of possibilities for rigorous investigation. And the fact that they’re only a couple convolutional layers deep means we can follow every string of neurons back to the input. At the same time, the underlying algorithm the model has implemented for curve detection is quite sophisticated. If this paper persuades skeptics that at least curve detectors exist, that seems like a substantial step forward. Similarly, if it surfaces a more precise point of disagreement, that would also advance the dialogue.\n   Before running detailed experiments, let’s look at a high level and slightly simplified story of how the curve 10 neurons in 3b work.\n  Each curve detector implements a variant of the same algorithm: it responds to a wide variety of curves, preferring curves of a particular orientation and gradually firing less as the orientation changes. Curve neurons are invariant to cosmetic properties such as brightness, texture, and color.\n    Curve detectors have sparse activations, firing in response to only 10% of spatial positions  Receptive-field sized crops of an image. across ImageNet, and usually activating weakly when they do fire. When they activate strongly, it’s in response to curves with similar orientation and curvature to their feature visualization.\n   It’s worth stepping back and reflecting on how surprising the existence of seemingly meaningful features like curve detectors is. There’s no explicit incentive for the network to form meaningful neurons. It’s not like we optimized these neurons to be curve detectors! Rather, InceptionV1 is trained to classify images into categories many levels of abstraction removed from curves and somehow curve detectors fell out of gradient descent.\n Moreover, detecting curves across a wide variety of natural images is a difficult and arguably unsolved problem in classical computer vision This is our sense from trying to implement programmatic curve detection to compare them to curve neurons. We found that practitioners generally had to choose between several algorithms, each with significant trade-offs such as robustness to different kinds of visual “noise” (for instance, texture), even in images much less complex than the natural images in ImageNet. For instance,  this answer on StackOverflow claims “The problem [of curve detection], in general, is a very challenging one and, except for toy examples, there are no good solutions.” Additionally, many classical curve detection algorithms are too slow to run in real-time, or require often intractable amounts of memory.. InceptionV1 seems to learn a flexible and general solution to this problem, implemented using five convolutional layers. We’ll see in the next article that the algorithm used is straightforward and understandable, and we’ve since reimplemented it by hand.\n What exactly are we claiming when we say these neurons detect curves? We think part of the reason there is sometimes disagreement about whether neurons detect particular stimuli is that there are a variety of claims one may be making. It’s pretty easy to show that, empirically, when a curve detector fires strongly the stimulus is reliably a curve. But there are several other claims which might be more contentious:\n Causality Curve detectors genuinely detect a curve feature, rather than another stimulus correlated with curves. We believe our feature visualization and visualizing attribution experiments establish a causal link, since “running it in reverse” produces a curve.\n Generality: Curve detectors respond to a wide variety of curve stimuli. They tolerate a wide range of radii and are largely invariant to cosmetic attributes like color, brightness, and texture. We believe that our experiments explicitly testing these invariances with synthetic stimuli are the most compelling evidence of this.\n Purity: Curve detectors are not polysemantic and they have no meaningful secondary function. Images that cause curve detectors to activate weakly, such as edges or angles, are a natural extension of the algorithm that InceptionV1 uses to implement curve detection. We believe our experiments classifying dataset examples at different activation magnitudes and visualizing their attributions show that any secondary function would need to be rare. In the next article, exploring the mechanics of the algorithm implementing curve detectors, we’ll provide further evidence for this claim.\n   Feature visualization  uses optimization to find the input to a neural network that maximizes a given objective. The objective we often use is to make the neuron fire as strongly as possible, but we’ll use other objectives throughout in this article. One reason feature visualization is powerful is that it tells us about causality. Since the input starts with random noise and optimizes pixels rather than a generative prior, we can be confident that any property in the resulting image contributed to the objective.\n  Reading feature visualizations is a bit of a skill, and these images might feel disorienting if you haven’t spent much time with them before. The most important thing to take away is the curve shape. You may also notice that there are bright, opposite hue colors on each side of the curve: this reflects a preference to see a chance in color at the boundary of the curve. Finally, if you look carefully, you will notice small lines perpendicular to the boundary of the curve. We call this weak preference for small perpendicular lines “combing” and will discuss it later.\n Every time we use feature visualization to make curve neurons fire as strongly as possible we get images of curves, even when we explicitly incentivize the creation of different kinds of images using a  diversity term. This is strong evidence that curve detectors aren’t polysemantic in the sense we usually use it,  roughly equally preferring different kinds of stimuli.\n Feature visualization finds images that maximally cause a neuron to fire, but are these superstimuli representative of the neuron’s behavior? When we see a feature visualization, we often imagine that the neuron fires strongly for stimuli qualitatively similar to it, and gradually becomes weaker as the stimuli exhibit those visual features less. But one could imagine cases where the neuron’s behavior is completely different in the non-extreme activations, or cases where it does fire weakly for messy versions of the extreme stimulus, but also has a secondary class of stimulus to which it responds weakly.\n If we want to understand how a neuron behaves in practice, there’s no substitute to simply looking at how it actually responds to images from the dataset.\n   As we study the dataset we’ll focus on    3b:379 because some experiments required non-trivial manual labor. However, the core ideas in this section will apply to all curve detectors in 3b.\n How often does    3b:379 fire? When it fires, how often does it fire strongly? And when it doesn’t fire, is it often strongly inhibited, or just on the verge of firing? We can answer these questions by visualizing the distribution of activations across the dataset.\n When studying ReLU networks, we find it helpful to look at the distribution of pre-activation values. Since ReLU just truncates the left hand side, it’s easy to reason about the post-activation values, but it also shows us how close the neuron is to firing in other cases. Looking at pre-activation values also avoids the distribution having a dirac delta peak at zero. We find that    3b:379 has a pre-activation mean of about -200. It fires in just 11% of cases across the dataset, since negative values will be set to zero by the ReLU activation function.\n If we look at a log plot of probability, we see that the activating regime follows an exponential distribution The observation that neural network activations generally follow an exponential distribution was first made to us by Brice Ménard, who observed it to be the case over all but the first layer of several networks. This is mildly surprising both because of how perfectly they seem to follow an exponential distribution, and also because one often expects linear combinations of random variables to form a Gaussian., corresponding to a straight line in the plot. One consequence of this is that, since probability density decays at         e  − x e^{-x}     e         − x rather than         e  −  x 2 e^{-x^2}     e         −  x        2 of a Gaussian, we should expect the distribution to have long tails.\n  To understand different parts of this distribution qualitatively we can render a quilt of images by activation, randomly sampling images that cause    3b:379 to activate different amounts. The quilt shows a pattern. Images that cause the strongest activations have curves that are similar to the neuron’s feature visualization. Images that cause weakly positive activations are imperfect curves, either too flat, off-orientation, or with some other defect. Images that cause pre-ReLU activations near zero tend to be straight lines or images with no arcs, although some images are of curves about 45 degrees off orientation. Finally, the images that cause the strongest negative activations have curves with an orientation more than 45 degrees away from the neuron’s ideal curve.\n  Quilts of images reveal patterns across a wide range of activations, but they can be misleading. Since a neuron’s activation to a receptive-field sized crop of an image is just a single number, we can’t be sure which part of the image caused it. As a result, we could be fooled by spurious correlations. For instance, since many of the images that cause    3b:379 to fire most strongly are clocks, we may think the neuron detects clocks, rather than curves.\n To see  why an image excites a neuron, we can use feature visualization to visualize the image’s attribution to the neuron.\n   Most of the tools we use for studying neuron families, including feature visualization, can be used  in context of a particular image using attribution.\n There is a significant amount of work on how to do attribution in neural networks (eg.  ). These methods attempt to describe which pixels or earlier neurons are responsible for causing neurons to fire. In the general case of complex non-linear functions, there is a lot of disagreement over which attribution methods are principled and whether they are reliable  . But in the linear-case, attribution is generally agreed upon, with most methods collapsing to the same answer. In a linear function of        x x    x,        w ⋅ x w\\cdot x    w  ⋅    x, the contribution of the component         x i x_i     x        i ​    to the output is         w i  x i w_ix_i     w        i ​     x        i ​   . The attribution vector (or tensor) describing the contribution of each component is        (  w 0  x 0 ,    w 1  x 1 ,   … ) (w_0x_0, ~w_1x_1, ~\\ldots)    (  w        0 ​     x        0 ​    ,     w        1 ​     x        1 ​    ,    … ).\n Since a neuron’s pre-activation function and bias value is a linear function of neurons in the layer before it, we can use this generally agreed upon attribution method. In particular, curve detectors in 3b’s pre-activation value is a linear function of 3a. The attribution tensor describing how all neurons in the previous layer influenced a given neuron is the activations pointwise multiplied by the weights.\n We normally use feature visualization to create a superstimulus that activates a single neuron, but we can also use it to activate linear combinations of neurons. By applying feature visualization to the attribution tensor, we are creating the stimulus that maximally activates the neurons in 3a that caused    3b:379 to fire. Additionally, we will use the absolute value of the attribution tensor, which shows us features that caused the neuron to fire and also features that inhibited it. This can be useful for seeing curve-related visual properties that influenced our cure neuron, even if that influence was to make it fire less.\n Combining this together gives us        FeatureVisualization ( abs ( W ⊙  h  p r e v ) ) \\text{FeatureVisualization}(\\text{abs}(W \\odot h_{prev}))     FeatureVisualization (  abs ( W  ⊙     h         p r e v ​    ) ), where        W W    W is the weights for a given neuron, and         h  p r e v h_{prev}     h         p r e v ​    is the activations of the previous hidden layer. In practice, we find it helpful to parameterize these attribution visualizations to be grayscale and transparent, making the visualization easier to read for non-experts  . Example code can be found in the notebook.\n We can also use attribution to revisit the earlier quilt of dataset examples in more depth, seeing why each image caused    3b:379 to fire. You can click the figure to toggle between seeing raw images and attribution vector feature visualizations.\n  While the above experiment visualizes every neuron in 3a, attribution is a powerful and flexible tool that could be used to apply to studies of circuits in a variety of ways. For instance, we could visualize how an image flows through each  neuron family in early vision   before 3b, visualizing the image’s activation vector and attribution vector to curve neurons at each family along the way. Each activation vector would show what a family saw in the image, and each attribution vector would show us how it contributed to activating    3b:379.\n In the next section we’ll look at a less sophisticated technique for extracting information from dataset images: blindfolding yourself from seeing neuron activations and classifying images by hand.\n   Nick Cammarata, an author of this paper, manually labelled over 800 images into four groups: curve, imperfect curve, unrelated image, or opposing curve. We randomly sampled a fixed number of images from    3b:379 activations in bins of 100 We did not cherry-pick from these bins. The data in this paper is from our first sampling of images.. While labeling, Nick could only see the image’s pixels, not additional information such as the neuron’s activations or attribution visualizations. He used the following rubric in labeling:\n Curves: The Image has a curve with a similar orientation to the neuron’s feature visualization. The curve goes across most of the width of the image.\n Imperfect Curve: The image has a curve that is similar to the neuron’s feature visualization, but has at least one significant defect. Perhaps it is too flat, has an angle interrupting the arc, or the orientation is slightly off.\n  Opposing Curve: The image has a curve that differs from the neuron’s feature visualization by more than 45 degrees.\n After hand-labeling these images, we compared our labels to    3b:379 activations across the same images. Using a stackplot we see that different labels separate cleanly into different activations Interestingly, during labeling Nick felt it was often difficult to place samples into groups, as many images seemed to fall within the boundaries of the rubric. We were surprised when we saw that activations clearly separate into different levels of activation..\n  Still, there are many images that cause the neuron to activate but aren’t classified as curves or imperfect curves. When we visualize attribution to    3b:379 we see that many of the images contain subtle curves.\n  Nick found it hard to detect subtle curves across hundreds of curve images because he started to experience the  Afterimage effect that occurs when looking at one kind of stimulus for a long time. As a result, he found it hard to tell whether subtle curves were simply perceptual illusions. By visualizing attribution, we can reveal the curves that the neuron sees in the image, showing us curves that our labeling process missed. In these cases, it seems    3b:379 is a superhuman curve detector.\n  These charts are helpful for comparing our hand-labelled labels but they give an incomplete picture. While    3b:379 seems to be highly selective for curve stimuli when it fires strongly, this is only a tiny fraction of cases where it fires. Most of the time, it doesn’t fire at all, and when it does it’s usually very weakly.\n To see this, we can look at the probability density over activation magnitudes from all ImageNet examples, split into the same per-activation-magnitude (x-axis) ratio of classes as our hand labelled dataset.\n  From this perspective, we can’t even see the cases where our neuron fires strongly! Probability density exponentially decays as we move right, and so these activations are rare. To some extent, this is what we should expect if these neurons really detect curves, since clear-cut curves rarely occur in images.\n Perhaps more concerning is that, although curves are a small fraction of the cases where    3b:379 only weakly fire or didn’t fire, this graph seems to show that the majority of stimuli classified as curves also fall in these cases, as a result of neurons firing strongly being many orders of magnitude rarer. This seems to be at least partl\n......", "posttime": "2020-06-30 21:28:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "检测,detecting,曲线", "title": "曲线检测神经元", "title_en": "Curve Detecting Neurons", "transed": 1, "url": "https://distill.pub/2020/circuits/curve-detectors/", "via": "", "real_tags": ["检测", "detecting", "曲线"]}, {"category": "", "categoryclass": "", "imagename": "1517e8cb6172cebad245dc6b330954ea.png", "infoid": 1008970, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TL；DR：我发现了一份作业的打印本，那是我在学生时代为OpenBSD和Linux实现系统调用时必须做的。我丢失了原始的LaTeX文件，所以我决定重写它，这样我就有了一份数字副本。这篇文章最初介绍了OpenBSD中不再存在的可加载内核模块(LKM)，但我删减了这一部分。我还删减了Linux部分，因为我当时并不关心它，只做了最少的及格；-)。\n像往常一样，非常感谢在Patreon或GitHub上赞助我的人，你可以在这里阅读更多关于我的赞助的信息。\n这里的内容是基于我在2005年写的一个任务，这绝不是鼓励您编写系统调用并将其发送到OpenBSD的教程。\n人们经常互换使用这两个词，但理解程序和进程之间的区别很重要，特别是因为可能允许同一个程序在一个进程中使用系统调用，而不允许在另一个进程中使用系统调用，而且还因为该进程是Syscall API的一部分。\n程序是一个可执行文件，其中包含一组旨在执行和执行某些操作的指令，它以结构化文件的形式驻留在文件系统中，该文件对谁可以或不可以执行它施加了限制。\n进程是该程序的一个实例，运行在它自己的内存空间中，拥有自己的特权。\n如果我们使用/bin/ls，它是一个列出目录和文件的程序。当用户执行它时，将创建一个进程，该进程将在不与其他进程共享的内存空间中以该用户的权限实际运行该程序。\n类UNIX系统有一个体系结构，其中代码在两个主要区域执行：内核和用户区域。\n内核负责提供和限制对设备的访问，对正在执行的程序可以做什么实施限制，并为程序提供可以在其中执行的虚拟内存空间。\n程序在用户土地上执行，并在进程初始化期间对内核分配给它的内存执行操作。当程序需要访问设备或需要内核执行它自己不允许执行的操作时，它会请求内核触发系统调用。系统调用是内核的一部分，并代表进程作为内核的一部分运行。\n系统调用是内核提供的一种服务，以便用户域进程可以请求内核代表它做一些事情，通常是用户域程序不能或不允许自己做的事情。\n从程序的角度来看，它是一个有点特殊的函数，它可以像调用任何其他函数一样调用它，但是它不在进程内存空间中运行。程序只知道系统调用接口，但没有访问它的实现的权限，所以它可以调用它，向它传递参数，从它获得结果，但不检查它运行时系统调用内部发生了什么。它不能对它进行调试。\n这会带来副作用。在性能方面，系统调用会将执行切换到代价高昂的内核。然后，系统调用中的bug与函数调用中的bug具有不同的影响：内存损坏bug可能导致进程终止，而系统调用中的相同内存损坏bug可能导致系统崩溃。\n系统调用实现(调用时将在内核中运行的系统调用的实际代码)和系统调用接口(系统调用接口是从用户端应用程序调用系统调用的方式)。区分两者很重要，因为在OpenBSD中，系统调用实现的原型与系统调用接口的原型不匹配，这一点我们很快就会看到。\n显然，非特权帐户不允许更改内核，因为它在系统上强制执行权限。因此，至少在安装修改后的内核时，必须使用特权帐户。\n系统源可直接从OpenBSD项目获得。对于此分配，我们需要以下档案：\n访问系统源后，可以使用以下命令重新构建内核：\n重建只需要几分钟，并且在新内核不稳定的情况下会自动执行前一个内核的备份副本。\n如果对内核的更改影响userland工具，则可能需要重新构建系统。例如，如果您更改ps、top或unam等工具使用的struct proc，则可能会出现这种情况。重新构建非常简单，如下所示：\n重建需要比内核多得多的时间，根据您的体系结构的不同，重建的时间可能从几分钟到几个小时不等。\n首先，我们将实现不带参数的sys_告别()系统调用。它的原型是：\n#include&lt；sys/tyes.h&gt；#include&lt；sys/param.h&gt；#include&lt；sys/systemm.h&gt；#include&lt；sys/kernel.h&gt；#include&lt；sys/proc.h&gt；#include&lt；sys/mount t.h&gt；#include&lt；sys/syscallargs.h&gt；/*。在控制台上*/sys_再见(struct proc*p，void*v，register_t*retval){printf(&#34；再见，残酷世界！\\n&#34；)；return(0)；}。\n我们的第一个系统调用只显示句子“再见，残酷的世界！”它允许我们看到系统调用的原型在用户端和内核之间是不同的。OpenBSD为所有系统调用提供了唯一的API，无论它们向用户端公开的原型是什么。\n此处包含的标头是syscall API正确操作所需的最小集合。有些可能看起来没有被我们的函数使用，但将在构建时用于内核的内部管路。系统调用并不局限于其实现，正如我们稍后将看到的那样，一些元素将间接地、自动地累加起来。\n我们的第一个系统调用将丢弃其参数(struct proc*p、void*v和register_t*retval)，使用printf()并返回0以指示调用者执行正常。这里，printf()对于userland printf()不会被误解，前者用于输出到控制台，而不是标准输出。\n我们的第二个系统调用sys_showparams()接受一个int参数并将其值打印到控制台。它的原型如下所示：\n#include&lt；sys/tyes.h&gt；#include&lt；sys/param.h&gt；#include&lt；sys/systemm.h&gt；#include&lt；sys/kernel.h&gt；#include&lt；sys/proc.h&gt；#include&lt；sys/mount t.h&gt；#include&lt；sys/syscallargs.h&gt；/*向控制台显示整型参数值*/sys_showparams(struct proc*p，void*v，register_t*retval){struct sys_showparams_args/*{syscallarg(Int)val；}*/*uap=v；printf(&#34；showparams(%d)\\n&#34；，scarg(uap，val))；return(0)；}。\n与前一个函数不同，此函数不会忽略其参数，因为它必须提取在userland接口中传递的整数参数。为此，它声明了一个指向struct sys_showparams_args结构的指针，并使其指向其第二个参数void*v。很明显，此参数shomehow表示系统调用的userland参数。struct sys_showparams_args的定义不是我们实现的一部分，因为它是在构建时自动生成的。它的每个字段都对应于。而不必担心体系结构的对齐或字节顺序。\n系统调用sys_retparam()接受int参数，小于等于1024则返回，否则失败返回-1，将errno设置为EINVAL。其原型与sys_showparams()类似：\n#include&lt；sys/tyes.h&gt；#include&lt；sys/param.h&gt；#include&lt；sys/systemm.h&gt；#include&lt；sys/kernel.h&gt；#include&lt；sys/proc.h&gt；#include&lt；sys/mount t.h&gt；#include&lt；sys/syscallargs.h&gt；/*小于等于1024*/sys_retparam(struct proc*p，void*v，register_t*retval){struct sys_retparam_args/*{syscallarg(Int)val；}*/*uap=v；unsign int val；val=scarg(uap，val)；if(val&gt；1024)return(EINVAL)；*retval=v；unsign int val；/sys_retparam(struct proc*p，void*v，register_t*retval){struct sys_retparam_args/*{syscallarg(Int)val；}*/*uap=v；unsign int val；val=scarg。\n事情变得稍微复杂一些，我们需要深入到函数外部发生的事情来了解发生了什么。问题是：如果我们必须在成功的情况下返回0，在错误的情况下返回正值，那么如何让系统调用在成功的情况下返回正值呢？\n解决方案驻留在系统调用的第三个参数中。系统调用返回的值没有映射到userland中的系统调用接口返回的值。系统调用中的返回值仅用于确定执行是否正确或设置错误。userland接口返回的值实际上放在系统调用实现的第三个参数中，这实际上是一个由两个寄存器组成的数组。\n该数组的第一个索引表示EAX寄存器，在syscall API调用我们的实现(可能会对其进行修改)之前将其初始化为0。第二个索引很少使用，它允许解决fork()的情况，fork()返回两个值，一个用于父进程，另一个用于子进程。\n我们的最后一个系统调用sys_retpid()接受一个int参数，如果为0，函数将返回进程PID，如果为1，则返回父进程PID，在所有其他情况下返回FAIL，并将errno设置为EINVAL。它的原型如下所示：\n#include&lt；sys/tyes.h&gt；#include&lt；sys/param.h&gt；#include&lt；sys/systemm.h&gt；#include&lt；sys/kernel.h&gt；#include&lt；sys/proc.h&gt；#include&lt；sys/mount t.h&gt；#include&lt；sys/syscallargs.h&gt；/**如果val==0，则返回当前PID*如果val==1*return-1，则返回父PID，否则将errno设置为EINVAL*/sys_retpid(struct proc*p，void*v，register_t*retval){struct sys_retpid_args/*{syscallarg(Int)val；}*/*uap=v；unsign int val；val=scarg(uap，val)；if(val。如果(val==0)*retval=p-&gt；p_pid；Else*retval=p-&gt；p_pptr-&gt；p_pid；return(0)；}。\n最后一个调用允许说明函数不是在Userland中执行，而是真正在内核中执行，它允许我们访问当前进程以外的内存。在这里，我们取消引用与我们的进程相关联的struct proc，但也引用了一个指向不同struct proc的指针，我们可以使用struct proc中的各种链表来访问当前进程在userland中不可用的资源。\n请注意，这只是一个示例，在需要时应小心进行适当的锁定，如果系统调用访问已释放的资源，则结果不是进程崩溃，而是系统崩溃。\n本文的初始版本始于2005年，提供了静态链接和可加载内核模块。从那时起，LKM接口从OpenBSD中删除，我也删除了这些部分，因为它们现在没有实际用途。\n/usr/src/sys/kern.syscalls.master是用于添加系统调用的主文件。它用于重新生成syscall API使用的一组数组和内部结构。\n/usr/src/sys/kern/init_sysen.c包含系统发送表。表中的每个元素都描述了syscall的参数数量、与这些参数相关联的结构以及实现系统调用的函数。\n第一步是编辑/usr/src/sys/kern.syscalls.master并找到一个未使用的系统调用号，如果没有新的系统调用号，则添加一个新的调用号。文件格式非常简单，它由一个syscall号、一个系统调用类型和一个伪原型组成。\n重新构建上述文件以考虑新的系统调用并生成其参数所需的结构，剩下的工作就是在添加了包含系统调用实现的文件之后重新构建内核。\n此时，一旦使用新内核重新引导系统，我们的系统调用就可以由通过使用syscall()系统调用知道其编号的userland应用程序使用。\n为了能够按名称使用它们，您必须用make init_sysen.c阶段生成的文件更新include文件/usr/include/sys/syscall.h和/usr/include/sys/sycallargs.h，然后在/usr/src/lib/libc/sys/Makefile.inc中添加我们的对象文件(不带sys_前缀)后重新构建libc。", "note_en": "TL;DR:I found a printed copy of an assignment I had to do back when I was a student to implement a system call for OpenBSD and Linux.I lost the original LaTeX file so I decided to rewrite it so I have a digital copy.The article originally covered loadable kernel modules (LKM) which is no longer a thing in OpenBSD, I trimmed that part.I also trimmed the Linux part because I didn&#39;t care about it back then and did the minimum to pass ;-)\n  As usual,a  huge thanks goes to the people  sponsoring me on   patreon or   github, you can   read more about my sponsorship here.\n   The content here is based on an assignment I wrote in 2005.This is by no mean a tutorial to encourage you to write system calls and send them to OpenBSD.\n   People often use the two words interchangeably but it is important to understand the difference between a program and a process,particularly because the same program may be allowed to use a system call in a process and not in another,but also because the process is part of the syscall API.\n A program is an executable which contains a set of instructions that are meant to be executed and do something.It resides as a structured file on the filesystem which enforces restrictions as to who can or cannot execute it.\n A process is an instance of that program,running in its own memory-space,with its own privileges.\n If we take  /bin/ls,it is a program that lists directories and files.When a user executes it,a process is created which will actually run the program with the privileges of that user,in a memory space that’s not shared with other processes.\n  Unix-like systems have an architecture where code is executed in two main areas:the kernel and userland.\n The kernel is in charge of providing and limiting access to devices,enforcing restrictions as to what an executing program can do,and providing programs with a virtual memory space in which they can execute.\n A program executes in userland and perform operations on memory that’s allocated to it by the kernel during the initialisation of the process.When the program needs to access a device or needs the kernel to perform an operation that it’s not allowed to perform itself,it asks the kernel to trigger a system call.The system call is a function that’s part of the kernel and that runs as part of it on behalf of the process.\n  A system call is a service provided by the kernel so that a userland process can request the kernel to do something on its behalf,usually something that the userland program is not able or not allowed to do on its own.\n From the point of view of a program,it is a somewhat special function that it can call similarly to any other function,but which doesn’t run in the process memory space.A program only knows about the system call interface but doesn’t have access to its implementation,so it can call it, pass parameters to it, obtain a result from it,but not inspect what happens inside the system call as it runs.It can’t debug it.\n This comes with side-effects.Performance-wise,a system call switches the execution to kernel which is costly.Then bugs in a system call have a different impact from bugs in a function call:a memory corruption bug may cause the process to terminate,whereas the same memory corruption bug in a system call may cause the system to crash.\n  The system call implementation,which is the actual code of the system call that’s going to run inside the kernel when called,and the system call interface,which is how the system call is meant to be called from a userland application.It is important to differentiate both as,in OpenBSD,the prototype for the system call implementation does not match the prototype for the system call interface as we’ll see shortly.\n    It is obvious that an unprivileged account is not allowed to alter the kernel as it enforces permissions on the system.For that reason, it is mandatory to use a privileged account at least for installing a modified kernel.\n  The system sources are available directly from the OpenBSD project.For this assignement,we will need the following archives:\n     Once you have access to the system sources, you can rebuild the kernel using the following commands:\n  The rebuild only takes a few minutes and a backup copy of the previous kernel is performed automatically in case the new kernel is unstable.\n  Rebuilding the system may be necessary if changes to the kernel affect userland tools.It may be the case for example if you alter  struct proc which is used by tools such as  ps,  top or  uname.Rebulding is as simple as:\n  Rebuilding takes much more time that for a kernel and can range from several minutes to hours depending on your architecture.\n  For a start,we’ll implement the  sys_goodbye() system call which takes no parameters.Its prototype is:\n   #include  &lt;sys/types.h&gt;  #include  &lt;sys/param.h&gt;  #include  &lt;sys/systm.h&gt;  #include  &lt;sys/kernel.h&gt;  #include  &lt;sys/proc.h&gt;  #include  &lt;sys/mount.h&gt;  #include  &lt;sys/syscallargs.h&gt;   /* displays &#34;Goodbye, cruel world !&#34; on the console */ sys_goodbye ( struct  proc  * p ,  void  * v ,  register_t  * retval ) {\t printf ( &#34;Goodbye, cruel world ! \\n &#34; );\t return  ( 0 ); }\n  Our first system call only displays the sentence “Goodbye, cruel world !” on the console.It allows us to see that the prototype of a system call differs between the userland and the kernel.OpenBSD provides a unique API for all system calls,no matter the prototype they expose to userland.\n The headers that are included here are the minimal set required for proper operations of the syscall API.Some might seem unused by our function but will be used at build time for the kernel’s internal plumbing.The system call does not limit itself to its implementation,a few elements will add up indirectly and automatically as we’ll see later.\n Our first system call will discard its parameters (struct proc *p, void *v and register_t *retval),use  printf()and return 0 to indicate to the caller that execution went fine.Here,  printf() is not to be misinterpreted for the userland  printf(), the former is used to output to console and not standard output.\n  Our second system call,  sys_showparams(), takes an  int parameter and prints its value to the console.Its prototype is the following:\n   #include  &lt;sys/types.h&gt;  #include  &lt;sys/param.h&gt;  #include  &lt;sys/systm.h&gt;  #include  &lt;sys/kernel.h&gt;  #include  &lt;sys/proc.h&gt;  #include  &lt;sys/mount.h&gt;  #include  &lt;sys/syscallargs.h&gt;   /* displays value of integer parameter to console */ sys_showparams ( struct  proc  * p ,  void  * v ,  register_t  * retval ) {\t struct  sys_showparams_args  /* { \t\tsyscallarg(int)\t\tval; \t} */  * uap  =  v ;\t printf ( &#34;showparams(%d) \\n &#34; ,  SCARG ( uap ,  val ));\t return  ( 0 ); }\n  Unlike the previous one,this function does not ignore its parameters as it has to extract the integer parameter passed in the userland interface.To do so,it declares a pointer to a  struct sys_showparams_args structure and has it point to its second parameter,  void *v.It becomes clear that this parameter shomehow represents the userland parameters to a system call.The definition of  struct sys_showparams_args is not part of our implementation because it is automatically generated at build time.Each of its fields correspond to a parameter in the userland interface and the  SCARG() macro allows dereferencing the structure correctly,without having to worry about alignement or endianness of the architecture.\n  The system call  sys_retparam() takes an  int parameter and returns it if its lesser than or equal to 1024,otherwise it will fail and return -1, setting  errno to  EINVAL.Its prototype is similar to that of  sys_showparams():\n   #include  &lt;sys/types.h&gt;  #include  &lt;sys/param.h&gt;  #include  &lt;sys/systm.h&gt;  #include  &lt;sys/kernel.h&gt;  #include  &lt;sys/proc.h&gt;  #include  &lt;sys/mount.h&gt;  #include  &lt;sys/syscallargs.h&gt;   /* returns value of integer parameter if lesser or equal to 1024 */ sys_retparam ( struct  proc  * p ,  void  * v ,  register_t  * retval ) {\t struct  sys_retparam_args  /* { \t\tsyscallarg(int)\t\tval; \t} */  * uap  =  v ;\t unsigned  int  val ;\t val  =  SCARG ( uap ,  val );\t if  ( val  &gt;  1024 )\t\t return  ( EINVAL );\t * retval  =  val ;\t return  ( 0 ); }\n  Things get slightly more complex and we will need to dive into what happens outside the function to understand what happens.The problem is the following:if we must return 0 in case of a success and a positive value in case of an error,then how can we have a system call return a positive value in case of success ?\n The solution resides in the third parameter to our system call.The value returned by our system call does not map to the value returned by the system call interface in userland.The return value in our system call is only here to allow determining if the execution was correct or set errno.The value that’s returned by the userland interface is actually placed in third parameter to our system call implementation,which is really an array of two registers.\n The first index of that array represents the EAX register,it is initialized to 0 by the syscall API before it calls our implementation that may modify it.The second index is rarely used,it allows solving the case of  fork() which returns two values,one for the parent process and one for the child process.\n  Our last system call,  sys_retpid(), takes an  int parameter which will cause the function to return the process pid if 0,the parent process pid if 1 and fail with  errno set to  EINVAL in all other cases.Its prototype is the following:\n   #include  &lt;sys/types.h&gt;  #include  &lt;sys/param.h&gt;  #include  &lt;sys/systm.h&gt;  #include  &lt;sys/kernel.h&gt;  #include  &lt;sys/proc.h&gt;  #include  &lt;sys/mount.h&gt;  #include  &lt;sys/syscallargs.h&gt;   /*  * returns current pid if val == 0  * returns parent pid if val == 1  * return -1 and sets errno to EINVAL otherwise  */ sys_retpid ( struct  proc  * p ,  void  * v ,  register_t  * retval ) {\t struct  sys_retpid_args  /* { \t\tsyscallarg(int)\t\tval; \t} */  * uap  =  v ;\t unsigned  int  val ;\t val  =  SCARG ( uap ,  val );\t if  ( val  !=  0  and  val  !=  1 )\t\t return  ( EINVAL );\t if  ( val  ==  0 )\t\t * retval  =  p -&gt; p_pid ;\t else\t\t * retval  =  p -&gt; p_pptr -&gt; p_pid ;\t return  ( 0 ); }\n  This last call allows illustrating that the function does not execute in userland but really in kernel,it allows us to access memory beyond that of the current process.Here, we dereference the  struct proc associated to our process but also a pointer to a different  struct proc,we can use the various linked lists inside  struct proc to access resources that are not available to the current process in userland.\n Note that this is just an example and that care should be taken to do proper locking when required,if the system call accesses a resources that’s been released,the result is not the process crash but a system crash.\n  The initial version of this article dates from 2005 and presented both static linking and loadable kernel modules.Since then,the LKM interface was removed from OpenBSD,I have removed these parts as they serve no practical purpose today.\n   /usr/src/sys/kern.syscalls.master is the main file used for adding a system call. It is used to rebuild a set of arrays and internal structures that are used by the syscall API.\n  /usr/src/sys/kern/init_sysent.c contains the sysent table. Each element of the table describes the number of parameters to the syscall, the structure that’s associated to these parameters and the function that implements the system call.\n The first step is to edit  /usr/src/sys/kern.syscalls.master and find an unused system call number,adding a new one if none is available.The file format is very simple,it consists of a syscall number, a system call kind and a pseudo-prototype.\n   The files described above are rebuilt to take into account the new system calls and produce the structures needed for their parameters.All is left to do is rebuild the kernel after having added the files containing the implementations of the system calls.\n     At this point,once the system is rebooted with the new kernel,our system calls are usable by userland application that know their numbers through the use of the  syscall() system call.\n To be able to use them by name,you will have to update the include files  /usr/include/sys/syscall.h and  /usr/include/sys/sycallargs.h with the ones generated during the  make init_sysent.c phase, then rebuild the libc after adding our object files (without their sys_ prefix) in  /usr/src/lib/libc/sys/Makefile.inc.", "posttime": "2020-06-30 21:28:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "openbsd,system,系统", "title": "实现OpenBSD的系统调用", "title_en": "Implementing a System Call for OpenBSD", "transed": 1, "url": "https://poolp.org/drafts/2020-05-28-015100-copy/", "via": "", "real_tags": ["openbsd", "system", "系统"]}, {"category": "", "categoryclass": "", "imagename": "80f3fa17fd6ac9dbe331ae928d23405a.jpg", "infoid": 1008969, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯坦福大学精神病学教授Leanne Williams博士说，目前用于诊断和治疗抑郁症的方法充其量是不精确的，在很大程度上依赖于对调查问题的主观回答。更糟糕的是，这些方法可以导致治疗选择，进一步推迟患者的康复随着疾病的进展。\n威廉姆斯说，目前的治疗方法是一个反复试验的过程。它是一刀切的。如果第一种疗法不起作用，就会尝试第二种疗法。我们需要一个更精确的工具来首先选择最好的治疗方案。\n威廉姆斯和她的合作者开始定义一种更有效的模型，他们希望这种模型能很快用于临床。在最近的一项研究中，他们部署了一种算法来解释抑郁症患者特有的脑波模式，目的是更好地查明哪些症状会随着治疗而改变。\n我们知道抑郁症的异质性很强，至少有1000种独特的症状组合可以诊断为抑郁症，威廉姆斯说，他是斯坦福大学精确心理健康与健康中心的主任。我们发现脑波测量可以用来帮助识别哪些症状在抗抑郁药物治疗后会改变，哪些不会。\n根据美国国家精神卫生研究所的数据，严重抑郁症是美国最常见的精神障碍，2017年约有7%的成年人受到影响。在这些人中，大约有一半从未得到诊断；对于那些得到诊断的人来说，按照目前的试验和错误过程，找到正确的治疗可能需要数年时间。\n威廉姆斯研究收集了518名被诊断为抑郁症的患者的数据，这些患者被随机分成三种不同的抗抑郁药中的一种进行为期八周的治疗。基于脑波数据，该算法成功地预测了哪些症状在治疗后有所改善，其中包括自知力和体重减轻等七种症状的表现最好。\n创造新的、客观的、高科技的实验室测试来帮助诊断精神障碍一直是威廉姆斯和其他翻译神经科学家的目标。临床医生目前依赖于调查，而不是进行血液测试或使用心脏监测仪的测量结果：要么是患者，要么是医生自己列出症状。如果患者有一定数量的各种不同的症状-包括情绪低落、食欲变化、丧失洞察力、精力丧失和注意力不集中-那么他们就会被广泛诊断为临床抑郁症。\n在新模型中，威廉姆斯与斯坦福大学人工智能医疗训练营的研究人员合作，由计算机科学兼职教授安德鲁·吴(Andrew Ng)博士领导的一个小组。研究小组着手设计一种算法，能够预测各种抑郁症状通过抗抑郁治疗的改善。个人症状数据与脑电图(EEG)测试的个人记录相结合，EEG测试监测参与者的大脑电活动。\n我们可以应用人工智能来学习数据中的复杂关系，计算机科学博士生普拉纳夫·拉杰普卡尔(Pranav Rajpurkar)说，他与硕士生杨景波(音译)共同参与了这项研究。我们能够了解并发现患者在治疗开始时的抑郁症状--和脑电图读数--与他们8周后的抑郁症状之间的有趣关系。\nRajpurkar说，该算法还能够识别具有与不良结果风险较高相关的临床症状的个人，如自杀。由于诊断的主观性，这些症状可能会被遗漏。例如，标有洞察力差的症状，这意味着患者可能无法意识到他们的病情程度，经常被忽视。\n她说：我们需要新的模型，比如这个模型，以提供这些抑郁风险因素的客观衡量标准，以确定哪些人可能受益于更密集的治疗，或者抗抑郁药以外的治疗，目标是尽快获得最佳治疗。", "note_en": "Current methods used to diagnose and treat depression are imprecise at best, relying largely on subjective answers to survey questions, said  Leanne Williams, PhD, Stanford professor of psychiatry. At worse, these approaches can result in treatment choices that further postpone a patient&#39;s recovery as the disease progresses.\n &#34;Currently treatments are a trial and error process,&#34; Williams said. &#34;It&#39;s one size fits all. If the first treatment doesn&#39;t work, a second gets tried. We need a more precise tool to pick the best treatment option first.&#34;\n Williams and her collaborators set out to define a more effective model, which they hope can be used in clinics soon. In a recent  study, they deployed an algorithm to interpret brainwave patterns unique to individuals with depression, with the goal of better pinpointing which symptoms change with treatment.\n &#34;We know that depression is very heterogenous, and that there are at least 1,000 unique combinations of symptoms that can be diagnosed as depression,&#34; said Williams, who is the director of  Stanford&#39;s Center for Precision Mental Health and Wellness. &#34;We&#39;ve found that brainwave measurements can be used to help identify which particular symptoms change with antidepressant treatment and which do not.&#34;\n  Major depression is the most common mental disorder in the United States, affecting about 7% of adults in 2017, according to the  National Institute of Mental Health. Among those, about half never get diagnosed; and for those who do, finding the right treatment can take years with the current trial and error process.\n For Williams&#39; study, data was collected from 518 patients diagnosed with depression randomized to eight weeks of treatment with one of three different antidepressants. Based on brainwave data, the algorithm successfully predicted which symptoms improved with treatment, with highest performance for seven symptoms including insight and loss of weight.\n Creating new, objective, high-tech lab tests to help diagnose mental disorders has long been the goal of Williams and other translational neuroscientists. Instead of running blood tests or using measurements taken from heart monitors, clinicians currently rely on a survey: Either the patient or the physician lists the symptoms themselves. If a patient has a certain number of a wide variety of different symptoms --  among them low mood, appetite changes, loss of insight, loss of energy and poor concentration --  they receive a broad  diagnosis of clinical depression.\n  For the new model, Williams collaborated with researchers at  Stanford&#39;s AI for Healthcare Bootcamp in a group led by  Andrew Ng, PhD, adjunct professor of computer science. The team set out to design an algorithm able to predict improvement of various depressive symptoms with antidepressant treatment. Individual symptom data were combined with individual recordings from electroencephalography (EEG) tests which monitored electrical activity in the brains of the participants.\n &#34;We can apply artificial intelligence to learn complex relationships in data,&#34; said  Pranav Rajpurkar, a PhD student in computer science, who shared lead authorship of the study with  Jingbo Yang, a master&#39;s student. &#34;We are able to learn and discover interesting relationships between a patient&#39;s depression symptoms -- and EEG readings -- at start of treatment, and their depression symptoms eight weeks in.&#34;\n The algorithm was also able to identify individuals with clinical symptoms associated with a higher risk of poor outcomes, such as suicide, Rajpurkar said. These symptoms may otherwise have been missed due to the subjective nature of diagnosis. For example, the symptom labeled &#39;poor insight&#39;, which means that the patient may not be able to realize the extent of their illness, often gets overlooked.\n &#34;We need new models, such as this one, to provide objective measures of these depression risk factors to identify people who may benefit from more intensive treatments, or treatments other than antidepressants, with the goal of getting the best treatment fast,&#34; she said.", "posttime": "2020-06-30 21:27:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,模式,predicts,治疗", "title": "人工智能基于脑电波模式预测有效的抑郁症治疗", "title_en": "AI predicts effective depression treatment based on brainwave patterns", "transed": 1, "url": "https://scopeblog.stanford.edu/2020/06/24/ai-predicts-effective-depression-treatment-based-on-brainwave-patterns/", "via": "", "real_tags": ["人工智能", "模式", "predicts", "治疗"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "另一方面，如果您需要自定义某些Lua特性，则需要在构建和安装Lua之前编辑src/luaconf.h。编辑后的文件将是已安装的文件，并且将由您构建的任何LUA客户端使用，以确保一致性。通过编辑Lua源代码，专家可以进行进一步的定制。如果您没有使用常用的Unix工具，那么构建Lua的说明取决于您使用的编译器。您将需要创建用于构建库、解释器和编译器的项目(或编译器使用的任何项目)，如下所示：library：lapi.c lcode.c lctype.c ldebug.c ldo.c ldump.c lfunc.c lgc.c llex.c lmem.c lobject.c lopcodes.c lparser.c lstate.c lstring.c ltable.c ltm.c lundump.c lvm.c。\n要在您自己的程序中使用Lua作为库，您需要知道如何在编译器中创建和使用库。此外，要为Lua动态加载C库，您需要知道如何创建动态库，并且需要确保那些动态库可以访问Lua API函数-但是不要将Lua库链接到每个动态库。对于Unix，我们建议将Lua库静态链接到主机程序中，并将其符号导出用于动态链接；src/Makefile对Lua解释器执行此操作。对于Windows，我们建议Lua库为DLL。在所有情况下，编译器luac都应该静态链接。如上所述，在构建Lua之前，您可以编辑src/luaconf.h来定制一些功能。以下是Lua5.4中引入的主要更改。参考手册列出了必须引入的不兼容性。Lua是根据麻省理工学院许可条款分发的自由软件，如下所示；它可以用于任何目的，包括商业目的，绝对免费，无需征得我们的同意。唯一的要求是，如果您确实使用Lua，那么您应该在您的产品或其文档中的某个地方包含适当的版权声明来给予我们信任。有关详细信息，请参阅此。版权所有©1994-2020 Lua.org，PUC-Rio。特此免费授予获得本软件及相关文档文件(软件)副本的任何人不受限制地交易本软件的权利，包括但不限于使用、复制、修改、合并、发布、分发、分许可和/或销售本软件副本的权利，以及允许获得本软件的人员这样做的权利，但须满足以下条件：上述版权通知和本许可通知应包括在本软件的所有副本或主要部分中。(#*_)。本软件按原样提供，不提供任何形式的担保，包括但不限于适销性、特定用途适用性和不侵权担保。在任何情况下，AUTHORS或版权所有者均不对因软件或软件中的使用或其他交易引起、产生或与之相关的任何索赔、损害赔偿或责任，无论是在合同诉讼、侵权诉讼或其他诉讼中承担任何责任。", "note_en": "On the other hand, if you need to customize some Lua features, you&#39;ll need to edit  src/luaconf.h before building and installing Lua. The edited file will be the one installed, and it will be used by any Lua clients that you build, to ensure consistency. Further customization is available to experts by editing the Lua sources.  If you&#39;re not using the usual Unix tools, then the instructions for building Lua depend on the compiler you use. You&#39;ll need to create projects (or whatever your compiler uses) for building the library, the interpreter, and the compiler, as follows: library: lapi.c lcode.c lctype.c ldebug.c ldo.c ldump.c lfunc.c lgc.c llex.c lmem.c lobject.c lopcodes.c lparser.c lstate.c lstring.c ltable.c ltm.c lundump.c lvm.c lzio.clauxlib.c lbaselib.c lcorolib.c ldblib.c liolib.c lmathlib.c loadlib.c loslib.c lstrlib.c ltablib.c lutf8lib.c linit.c\n To use Lua as a library in your own programs, you&#39;ll need to know how to create and use libraries with your compiler. Moreover, to dynamically load C libraries for Lua, you&#39;ll need to know how to create dynamic libraries and you&#39;ll need to make sure that the Lua API functions are accessible to those dynamic libraries — but  don&#39;t link the Lua library into each dynamic library. For Unix, we recommend that the Lua library be linked statically into the host program and its symbols exported for dynamic linking;  src/Makefile does this for the Lua interpreter. For Windows, we recommend that the Lua library be a DLL. In all cases, the compiler luac should be linked statically. As mentioned above, you may edit  src/luaconf.h to customize some features before building Lua.  Here are the main changes introduced in Lua 5.4.The reference manuallists the incompatibilities that had to be introduced.    Lua is free software distributed under the terms of the MIT licensereproduced below;it may be used for any purpose, including commercial purposes,at absolutely no cost without having to ask us.The only requirement is that if you do use Lua,then you should give us credit by including the appropriate copyright notice somewhere in your product or its documentation.For details, see this. Copyright © 1994–2020 Lua.org, PUC-Rio. Permission is hereby granted, free of charge, to any person obtaining a copyof this software and associated documentation files (the &#34;Software&#34;), to dealin the Software without restriction, including without limitation the rightsto use, copy, modify, merge, publish, distribute, sublicense, and/or sellcopies of the Software, and to permit persons to whom the Software isfurnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included inall copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED &#34;AS IS&#34;, WITHOUT WARRANTY OF ANY KIND, EXPRESS ORIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THEAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHERLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS INTHE SOFTWARE.", "posttime": "2020-06-30 21:27:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lua", "title": "LUA 5.4.0", "title_en": "Lua 5.4.0", "transed": 1, "url": "https://www.lua.org/manual/5.4/readme.html#changes", "via": "", "real_tags": ["lua"]}]