[{"category": "", "categoryclass": "", "imagename": "c8c34e3493c8dc1b71bd37908f8008ec.jpg", "infoid": 1000524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哥伦比亚特区的一名美国地区法官周四签署了一项历史性的和解协议，为美国联邦贸易委员会(FTC)和Facebook之间长达8年的诉讼画上了句号。\n联邦贸易委员会早在2012年就就八项侵犯隐私的行为起诉Facebook，称Facebook对用户控制个人数据的能力做出了欺骗性的声明。联邦贸易委员会声称，Facebook误导用户使用默认设置，而这些默认设置并不像用户认为的那样隐私。同样在2012年，Facebook被勒令做出补救改变；然后，它被指控违反了这一命令-这导致了与联邦贸易委员会的更多诉讼。\n为了解决目前的诉讼，Facebook同意不会对数据安全做出虚假陈述，并将实施一项新的隐私计划。和解协议还要求Facebook支付50亿美元的民事罚款；这笔罚款远远高于联邦贸易委员会有史以来第二接近的罚款-最高可达2250万美元。\nFacebook和联邦贸易委员会之间新的最终和解协议是双方长时间激怒的产物-但仍需要法院批准才能生效。与所有类似的和解协议一样，法院必须宣布和解协议是公平、合理的，符合公众利益-这是一个相对较低的门槛。但法官蒂莫西·凯利(Timothy Kelly)在批准和解协议时并不像许多法官那样被动和超然。凯利对Facebook发表了一些严厉的言论，警告这家社交媒体巨头不要…。\n凯利写道：“在最高法院看来，美国指控Facebook同时违反法律和行政命令的肆无忌惮的方式令人震惊。”法官对这些指控的长篇大论对Facebook并不友好：\n起诉书中的指控反映了Facebook据称行为不当的许多方面。其中一些指控是离散的、考虑不周的决定，比如据称鼓励用户提供电话号码以更好地保护他们的账户，但随后在没有事先告知用户的情况下使用这些相同的号码进行广告。其他人似乎反映了Facebook直接欺骗用户的意愿，比如据称告诉公众它不会分享…。\n然后是严厉的警告：“如果各方回到本法院，因为美国再次声称-Facebook违背了承诺，继续违反法律或修改后的行政命令的条款，法院可能不会对拟议的决议的条款适用完全相同的尊重。\n换句话说，这最好是Facebook恶作剧的结束，否则联邦贸易委员会将不会是唯一一个落槌的人。\n但凯利也非常明确地表示，他认为立法部门应该考虑解决更深层次的问题。\n“这些指控，以及一些朋友的简报，让人质疑法律的充分性，这些法律规定了收集美国人个人信息并将其货币化的科技公司必须如何对待这些信息。但这些担忧在很大程度上是国会的问题，在这里无关紧要，“法官写道。", "note_en": "A U.S. district judge in the District of Columbia  signed off on a historic settlement Thursday, putting an end to 8-year-old litigation between the Federal Trade Commission (FTC) and Facebook.\n The FTC  sued Facebook back in 2012 over eight privacy violations, saying that Facebook made deceptive claims about users’ ability to control their personal data. The FTC alleged that Facebook misled its users into using default settings that weren’t nearly as private as users believed they were. Also in 2012, Facebook was ordered to make remedial changes; then, it allegedly violated that order – which resulted in yet more litigation with the FTC.\n To settle the current litigation, Facebook agreed that it would not make misrepresentations about data security and would implement a new privacy program. The settlement also obligates Facebook to pay $5 billion in civil penalties; that penalty is significantly larger than the next-closest penalty the FTC has ever won–which topped out at $22.5 million.\n The new finalized settlement between Facebook and the FTC is the product of lengthy netotiations between the parties – but still required court approval to take effect. As with all similar settlements, the court must declare the settlement fair, reasonable, and in the public interest – a relatively low bar. But Judge  Timothy Kellywasn ’t as passive and detached as many judges are when approving a settlement. Kelly served up some harsh words for Facebook, warning the social media giant not  ...\n ”In the Court’s view, the unscrupulous way in which the United States alleges Facebook violated both the law and the administrative order is stunning,” Kelly wrote. The judge’s recitations of those allegations at length were not kind to Facebook:\n The allegations in the Complaint reflect many ways in which Facebook purportedly acted improperly. Some of these allegations represent discrete and poorly considered decisions, such as allegedly encouraging users to provide phone numbers to better secure their accounts, but then using those same numbers for advertising without telling users beforehand. Others appear to reflect Facebook ’s willingness to deceive its users outright, such as allegedly telling the public that it would not share  ...\n Then came a stern warning: “In the event that the parties return to this Court because the United States alleges—once again—that Facebook has reneged on its promises and continued to violate the law or the terms of the amended administrative order, the Court may not apply quite the same deference to the terms of a proposed resolution.\n In other words, this had better be the end of Facebook’s shenanigans, or the FTC won’t be the only one to drop the hammer.\n But Kelly was also crystal clear that he thinks there are deeper problems that the legislative branch should considering solving.\n “And these allegations, and the briefs of some amici, call into question the adequacy of laws governing how technology companies that collect and monetize Americans’ personal information must treat that information. But those concerns are largely for Congress; they are not relevant here,” the judge wrote.", "posttime": "2020-05-04 04:29:49", "tags": "facebook,法官,judge", "title": "联邦法官对Facebook“肆无忌惮”的违法行为感到震惊", "title_en": "Federal Judge Stunned by Facebook’s ‘Unscrupulous’ Violation of the Law", "transed": 1, "url": "https://lawandcrime.com/lawsuit/federal-judge-stunned-by-facebooks-unscrupulous-violation-of-the-law-warns-of-much-deeper-problems", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["facebook", "法官", "judge"]}, {"category": "", "categoryclass": "", "imagename": "9becbf84d76197bc827f0d1646a96b26.jpg", "infoid": 1000523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经营自己的企业14年来，我失败了很多。谢天谢地，我没有统计过，但我可以说，我至少创办了50家企业/想法，其中3家成功了。当我说工作时，我并不是指继续做生意，我的意思是要么在当时给我带来一份像样的收入，要么是一笔对我或其他人有价值的体面资产。作为一名企业家，你要冒这么多风险，我不认为取代你的工作和在家工作是一件很有意义的事。\n初创公司群体喜欢美化失败，但我不喜欢。失败很糟糕。缓慢的失败更让人难受。这就是为什么有时候放弃是可以的，这样你就可以自由地转向一个想法，这个想法可能会给你带来创业社区没有太多谈论的东西：实际的成就感和成功。\n知道什么时候放弃几乎是不可能的，做出放弃的决定所带来的情感包袱是无法承受的。这就是为什么企业家，包括我自己，为了追随“想法无关紧要，只有执行重要”的流行趋势，把自己的生命浪费在永远不会奏效的糟糕想法上。\n想法很重要，如果你的想法很差劲，对你来说，那个时候，以你的资源，几乎肯定会失败。\n这里有一张清单，列出了当事情可能失败时要注意的事情。这些都是基于我的失败和我在我的圈子里看到的失败(大多是自筹资金的在线商人)。\n对于一个创业者来说，愿意去做你一无所知的事情可能是一个很好的品质，但只在一定程度上是这样。有时候创业者做得有些过火，我自己也做过。我开始了一项销售儿童玩具的生意，没有任何零售经验，或者对儿童一无所知，我试图开始制作盆栽摊位的生意，尽管我不是园丁，在制造方面也没有任何经验，我试图为冲浪者建立一个应用程序，尽管我是一个糟糕的冲浪者，而且有……。\n如果我思考那些对我起作用的想法，我就能够利用我现有的很多技能来让它们发挥作用。在我的技能不够的地方，我与其他有技能的人作为合作伙伴一起工作，以实现这一目标。\n多年来，我看到这么多人试图创业，特别是在线企业和应用程序等，但他们对自己在做什么一无所知。成功的软件初创公司几乎总是由人脉深厚、超级聪明的创业者在大型创业中心城市创办的，或者是那些真正伟大的软件工程师。对于一个不是程序员的人来说，想出一个软件创意并将其转变为一家成功的公司是极其罕见的。\n然而，人们一直在尝试(包括我自己)，并想知道为什么它不起作用。如果你坚持做一些你非常熟悉的事情，或者至少有对该领域非常了解、你的技能同样有价值的联合创始人，你的机会就会增加很多。\n我过去经常这样做，一下子冒出四五个点子。很多人都做同样的事情。我想他们听到了一些一般性的建议，说百万富翁平均有7个不同的收入来源，他们认为这意味着他们必须有7个企业。我可以告诉你，1个伟大的生意比7个狗屎生意更有价值的地狱。把你的时间、注意力和奉献分散到多个项目上几乎是不可能的。\n也很难避免这些创业冲动，特别是当一个项目进展不顺利时，一次涉足几个项目是很有诱惑力的。但我宣称，在与这种冲动作斗争方面，至少取得了暂时的成功。我大约3年前就不做了。\n我的上一笔生意因此而蒙受了巨大的损失。在经营公司的同时，我和我的联合创始人都参与了多个项目。最后，我们的副项目都没有做得很好，这种做法对主营业务造成了影响。\n我把这些经验带到了我目前(唯一)的黑啤酒花酿造业务中。一旦我开始在BlackHops全职工作，我就关闭了所有其他的个人项目。其中一家的年收入相对较低，为4-5万美元，比我当时通过黑啤酒花挣的工资还要多。我把它和我所有的项目都关掉了，把重点放在了黑啤酒花上。\n这是一个正确的决定。自从我们开始以来，我没有考虑过任何其他项目，黑啤酒花已经成长为全国增长最快的啤酒厂之一，也是该州最大的独立啤酒厂之一。就规模而言，它已经是我上一项业务收入的6-7倍，不到4年的时间就值8-10倍。\n专注是值得的，特别是如果你真的相信你正在关注的事情。拒绝价值较低的机会，转而选择价值较高的机会，这是伟大的企业家一直在做的事情。\n这可能听起来很苛刻，但你有没有好好想过，在这个特定的时候，你是否是这个特定想法的合适人选？我觉得有时候人们", "note_en": "After 14 years running my own businesses, I ’ve failed a lot. I haven ’t kept count thankfully, but I ’d say I ’ve started at least 50 businesses / ideas and out of those, 3 have worked. And when I say worked I don ’t mean staying in business, I mean resulting in either a decent income for me at the time or a decent asset that ’s worth something to me or someone else. With all the risks you take as an entrepreneur, I don ’t see replacing your job and getting to work from home as a significant  ...\n The startup community likes to glorify failure but I don’t. Failing sucks. Failing slow sucks infinitely more. That’s why it’s OK sometimes to give up, to free you up to move onto an idea that could bring you something that the startup community doesn’t talk about near as much: actual fulfilment and success.\n  Knowing when to give up is near impossible and the emotional baggage that comes with making the decision to give up is unbearable. That’s why entrepreneurs, myself included, waste years of their lives on shitty ideas that will never work, following the popular trend of “ideas don’t matter, only execution matters”.\n  Ideas matter a lot, and if yours is a shitty one, for you, at that time, with the resources you have, it will almost certainly fail.\n Here is a list of things to look out for when things might be set for failure. These are based on my failures and the failures I’ve seen around my circles (mostly self-funded online business folk).\n  Being willing to go into something you are clueless about can be a great trait for an entrepreneur, but only to a point. Sometimes entrepreneurs overshoot, I ’ve done it myself. I started a business selling kids toys without any experience in retail or without knowing anything about kids, I tried to start a business making pot plant stands despite not being a gardener and having zero experience in manufacturing, I tried to build an app for surfers despite being a terrible surfer and having  ...\n If I think about the ideas that have worked for me, I’ve been able to utilise a lot of my existing skills to make them work. And where my skills weren’t enough, I’ve worked with other skilled people as partners to pull it off.\n Over the years, I’ve seen so many people try to start businesses, especially online businesses and apps etc without any clue what they are doing. Successful software startups are almost always started by well connected, super smart entrepreneurs in big startup hub cities, or people who are really great software engineers themselves. It’s extremely rare for an individual who isn’t a programmer to think up a software idea and turn that into a successful company.\n Yet people try all the time (myself included) and wonder why it doesn’t work out. Your chances go up a lot when you stick with something you know extremely well, or at the very least have co-founders who know the field very well and your skills are equally valuable.\n  I used to do this all the time, with 4 or 5 ideas bubbling away at once all the time. Lots of people do the same thing. I think they heard some generic advice that said millionaires have on average 7 different income streams, and they think that means they have to have 7 businesses. I can tell you 1 great business is a hell of a lot more valuable than 7 shit ones. It’s near impossible to split your time, attention and dedication across multiple projects.\n It’s also very hard to avoid those entrepreneurial impulses, particularly when one project isn’t going well, it’s tempting to dabble in a few at once. But I claim at least temporary success at battling this impulse. I stopped doing it about 3 years ago.\n My last business suffered immensely because of this. Both me and my co-founder worked on multiple projects while running the business. In the end, none of our side projects did very well at all, and the approach took a toll on the main business.\n I took these lessons into my current (only) business  Black Hops Brewing. Once I started working full time at Black Hops, I shut down all of my other personal projects. One of them was generating $40-$50k a year in relatively passive income which was more than I was getting as a wage via Black Hops at the time. I switched it, and all of my projects off to focus on Black Hops.\n And it was the right decision. I haven’t thought about any other projects since we started and Black Hops has grown into one of the countries fastest growing breweries and one of the state’s largest independent breweries. Size wise it’s already 6-7 times the revenue of my last business, and it’s worth 8-10 times as much after less than 4 years.\n It pays to focus, especially if you really believe in the thing you are focusing on. Turning down lower value opportunities for higher value ones is something great entrepreneurs do all the time.\n  This might come across as harsh but have you had a really good think about whether you are the right person for this particular idea at this particular time? I think sometimes people look up to these outlier heroes who started amazing outlier companies and think they can do it as well. It’s OK to have some ambition, but it has to be tempered with some level of self awareness.\n Steve Jobs famously said “Life can be much broader once you discover one simple fact: Everything around you that you call life was made up by people that were no smarter than you.” This is a neat inspirational quote, but is it actually true?\n I’m a reasonably smart person, when I went to school I was slightly above average for my school. I got a good enough grade to get into Business at university and went on to start a few of my own businesses. But what about all the kids that were smarter than me at school do?\n When I look around, I see amazing houses that were designed by Architects after acing school, getting through a gruelling 5 years at university, a further 2 years in monitored practice, passing the Architects Accreditation Council of Australia exam then probably worked under an amazing Architect with 20-30 years experience for 5 years at least before they designed the house I ’m looking at. The roads and the bridges and the buildings are the same, built by engineers who were  ...\n Businesses in many ways are not that much different. The successful restaurants are normally started by the industry ’s best and most award-winning chefs, software apps are created by some of the smartest entrepreneurs and software engineers in capital-rich startup hubs like Silicon Valley. Have you ever listened to an interview with any of the founders of any of the major tech giants of our generation? Zuckerberg is a computing genius, an insanely aggressive risk taker, he  ...\n Not to say there’s no place for you and me in a world filled with access and enormous opportunity. But should we be trying to start the next Facebook? Probably not the right people for the job.\n  I ’ve noticed a lot of younger entrepreneurs have a strong social conscience, which is a great thing. But the idea of starting a charity of sorts that ’s also a business is a tricky one to get my head around. There are certainly examples of companies who have been started with a strong social conscience that have also been fantastic businesses. But for every one of those, there ’s way more companies that seem to make a lot of vague claims about donating a “% of profit ”to  ...\n When I think about entrepreneurs who have given large amounts to causes, the ones I think of like Bill Gates, Michael Bloomberg, Jeff Bezos etc were all ridiculously successful business people first, and philanthropists later. Many, like Gates, were well known for being ruthlessly competitive, happily monopolising industries and obliterating competitors. These guys were hard entrepreneurs, driven by creating revolutionary products and making shitloads of money.\n And that ’s completely fine as far as I ’m concerned, that ’s what entrepreneurs are supposed to do. If you can build some good natured help for people in need into your business model (or more importantly your brand), then go for it. But it should be a business first. There is a lot of nobility in starting a business that entrepreneurs often don ’t get credit for. Small businesses power our economies, they support families, they employ tax paying citizens and they pay their  ...\n  Marketing is the biggest problem in business, I should know after failing marketing in Business School and failing at marketing in most of my businesses. Convincing anyone to do something different to what they are currently doing is near impossible. I know you know this, as business owners we know when we have a good product or service or event or app or restaurant, we look around at our competitors and size them up and feel like our offering is just as good if not better.  ...\n In my circles of mainly self funded smaller businesses, we don’t have the big budgets to acquire customers with paid ad spend. Even if we could, we don’t have the analytics to know if the money is well spent or not. Figuring all of that out is expensive and it takes time. So normally what we do is we build a nice brand and a nice story around what we do.\n In my case my last business I had this ongoing (very real) story about an entrepreneur who failed for 7 years and then started a neat little productised service business in 7 days.\n The fact that it was 7 years of failure and 7 days to success was pure luck. The fact that the entrepreneur was me was even luckier.\n The business would offer unlimited WordPress fixes for a fixed monthly fee, the first of its kind with this type of idea. It took off. My failure story turned into a success story, and me and my co-founder used that story and momentum to build a nice business which we sold to GoDaddy less than 3 years later.\n With my current business, it’s a similar story (but way better). 3 guys sat around at a bar discussing brewing ideas, we decided to have a crack at one of the ideas and after realising it was a hit, we took the plunge and built our own brewery (with a lot of other cool shit happening along the way, which we happily accepted into  our story).\n In both causes we took our community and our audience along with us as we built the business, and we built the businesses while spending close to $0 on advertising.\n But this wasn’t about us geniuses thinking up a cool story and using it as a branding exercise. We just happened to find ourselves inside a great story. We were of course very happy to use that and be part of it and make it the centrepiece of our marketing.\n For these 2 businesses I ’ve got enormous amounts of free marketing and publicity over the years. We ’ve had international attention from the likes of Activision (Call of Duty ’s first official beer), TechCrunch, Fox news, Mashable and more. We ’ve had local attention including featuring on an episode of a TV show on Channel 9, being on 9 News and 7 News and the Gold Coast Bulletin and the Courier Mail and more. None of that cost us a cent, and without that kind  ...\n But what if you don’t have that luxury? What if you don’t find yourself inside a great story. I guess you could make it up, an approach that makes me ill to think about, but a lot of companies do it and it works for some. But I like to think most consumers see through it. The more likely outcome is the business won’t gain traction. You’ll miss out on the easiest solution to businesses biggest problems.\n It’s not great, but maybe it means you have to search out for an idea where you will find yourself inside a cool story.\n  One of the biggest traps for new entrepreneurs is they try to change the world too soon. They are inspired by entrepreneurs like Steve Jobs and Elon Musk and they want to be ‘disruptive’ and ‘make a dent in the universe’.\n Being inspired is great and super important, I’m also very inspired by these people and have been over many years. But trying to change too much is a struggle that most entrepreneurs aren’t ready for.\n Can you imagine the gargantuan task of convincing people who have driven petrol cars all their life to no longer buy petrol cars? Can you imagine being a startup car maker and competing against iconic companies that people tie their identities to? Competing against companies who have more than a century of lessons and innovation and brand building to fall back on? You want people to ignore all of that and buy a golf buggy?\n That’s what Elon faced when forming Tesla. It takes a special type of crazy person (meant in the most endearing way), to even think something like that would be possible.\n Elon made it happen with a shitload of money, a very healthy dose of luck, and because he’s a once in a generation entrepreneur.\n Most people don’t make this happen. Most good solid companies are started with a slight point of difference, a cool story, a good brand and a well timed offering. They won’t drastically change people’s buying behavior. This is especially true for underfunded entrepreneurs, who already have an enormous marketing challenge just to make people aware that they exist.\n As far as making people completely change their habits as a consumer? Good luck with that. Much better to provide a solution where customers are already paying for a solution.\n  At the risk of repeating everything I said in  The 7 Day Startup, it’s a very bad idea to make decisions based on assumptions instead of actual customer data. A founder’s only goal in starting a new business should be to get a viable product or service into the customers’ hands as soon as possible.\n This is a roadblock that new entrepreneurs have a huge issue with. It’s so much easier to just post a link in a Facebook group and ask for feedback, or jump on a mastermind call and discuss what hypothetically the customer might want.\n I don ’t want to downplay this mistake because it ’s an excruciatingly difficult challenge. It ’s not as simple as putting out a shit product and hoping for the best. Products have to be good (viable), if they don ’t look good and feel good and solve a proper problem and provide a different enough experience to what people are used to (without changing major behaviours), then they probably aren ’t viable. So how do you create something with all of those  ...\n But the alternative is pissing around for months, or years on ‘potential ’ideas fabricating hypothetical scenarios in your head based on assumptions, that only delay the inevitable. Having customers tell you they hate your idea, or not pay for it, or even worse, not being able to find customers, really sucks. But there ’s something that sucks way harder. Spending months or years of your life on the wrong idea and ultimately having it fail. I ’ve done  ...\n  This one shouldn’t come as a huge surprise, but there does have to be something interesting about your product or service offering. It doesn’t have to be a major change, in fact massive changes could do a lot more harm than good, it just has to be worth talking about. When I look back at my failed ideas, they weren’t particularly interesting. When I look at the few that have gone well, they’ve all had some little point of difference.\n And the thing that is interesting has to be interesting to the customer, not just to you. This is why I think sometimes it’s a bad idea for entrepreneurs to “scratch their own itch”. It’s super easy to be interested in your own shit. It’s way harder to get people to part with their money to purchase something that they were otherwise not planning on purchasing. There has to be something in your idea that is interesting to talk about.\n In my case my WordPress support business was the first of its kind to offer a monthly recurring fixed price service that was traditionally either invoiced hourly or quoted for larger jobs. It’s not a massive change, I was doing WordPress support for years and years before WP Curve. But I’d never done human services for a fixed monthly cost, and others in the industry hadn’t done much of it either, and that idea was interesting.\n In the brewing world I can apply the same methodology. The brewers that have done well all have something interesting about what they are doing. Whether it’s a cool founding story, excellent branding that grabs attention, or just awesome experimental beers that drive people to talk about them. The good ones are all doing something interesting.\n If what you are doing isn ’t especially interesting to your customers, it ’s going to be very difficult. And if you aren ’t sure, look at what your customers are saying about it. And I don ’t mean in reply for a testimonial request. Look at the words they use, how they use the product, how they say it ’s different, how excited about it are they. That will give you some hints, just be wary of people ’s tendency to support their friends and be excited  ...\n  Humans are constantly getting advice from their surroundings, and new entrepreneurs are so easily influenced it really worries me. I see and hear so much awful advice given out to entrepreneurs in Facebook groups, and in mentoring sessions, and from friends and family etc. New entrepreneurs take it all in.\n Fuck advice. You don’t need it. You need awareness, and it’s very difficult to cultivate, especially when you are a new entrepreneur.\n But since you are seeking some kind of advice (otherwise why would you be reading this), here’s my advice on taking advice:\n If you need advice, give a lot of thought to why. Are you not qualified to do this? Do you not have enough expertise in your founding team? Do you not have the courage to make your own decisions? Do you want to seek permission from someone?\n  Try to avoid taking business advice from people who say they are experts. People who are good at business, spend their time running their businesses, not “educating” others on how to run theirs.\n Look for category-specific advice. If you find someone who is epic at email marketing, it makes sense to get some advice on that topic, but don’t hero worship someone into thinking they are a suitable person to give you advice on all topics.\n Don’t take the approach of asking questions and taking the answer as a solution. Instead gather data and be an entrepreneur and make your own decisions. The best places to gather data is to talk with your team or co-founders (if you have them), or talk to or observe your customers interacting with your offering.\n Do what feels right, sorry I can’t do better than that but if it feels right it probably is.\n  Firstly thanks for reading this article. Is your business likely to fail? I don’t know, only you can know that but I hope these thoughts help you with that decision. And while I don’t want to glorify failure, moving from an idea that doesn’t work for you to one that does is a beautiful thing. It’s a scary move, but maybe it’s the right move.", "posttime": "2020-05-04 04:29:34", "tags": "商业,想法,business", "title": "你的商业想法可能会失败的迹象", "title_en": "Signs that your business idea will probably fail", "transed": 1, "url": "https://dannorris.me/9-signs-that-your-business-idea-will-probably-fail/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["商业", "想法", "business"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一支由反叛植物学家组成的日益崛起的国际力量手持粉笔在街头涂鸦，以突显生长在欧洲各地城镇小径和墙壁裂缝中的多样化但受到压迫的植物群的名称和重要性。从法国开始，给所到之处的野生植物命名的想法已经像病毒一样传播开来，人们用粉笔在社交媒体上分享自己的照片。超过12.7万人点赞了伦敦郊区一张用粉笔写下的树木名称的照片，而一段视频……。\n普雷塞克告诉“卫报”：“我想提高人们对人行道上这些野生植物的存在、知识和尊重的认识。那些从未花时间观察这些植物的人现在告诉我，他们的观点已经改变。从那以后，学校就联系我，与城市里的学生一起研究自然。“。\n法国从2017年起禁止在公园、街道和其他公共场所使用杀虫剂，并从2019年起禁止在花园中使用杀虫剂，导致该国对城市野花的认识激增。\n居住在伦敦的法国植物学家和活动家索菲·勒吉尔(Sophie Lguil)在帮助推广由特拉·博塔尼卡(Tela Botanica)领导的法国Sauvages de ma rue(“我的街道的野生事物”)粉笔运动后，发起了“不止杂草”活动，以改变人们对英国城市植物的看法。她已经获得许可，可以在哈克尼的高速公路上划上粉笔，并开辟粉笔小径，以突出我们脚下被遗忘的植物，并要求其他议会也允许这样做。\n本周，“卫报”(Guardian)的“灭绝时代”(Age Of Extinction)遗址着眼于世界各地城市和城市地区的生物多样性，将人们的目光投向隐藏在高楼大厦和繁忙道路之间、被低估的自然界。\n大约55%的世界人口居住在城市地区，预计到2050年，这一数字将上升到68%。自然在数十亿人的福祉和幸福中的作用将比以往任何时候都更加重要。虽然城市化是生物多样性丧失的主要驱动因素，但许多自然资源保护者和城市规划者正试图让建成区变得更加自然友好。城市绿地的作用甚至已经在一份阻止和扭转生物多样性丧失的联合国协议草案中正式确定，……。\n冠状病毒的爆发导致世界各地的城镇进入封锁状态，这使得野猪、鹿、猴子、狐狸甚至狮子等野生动物得以冒险进入以前由人类主导的领土。它还为我们提供了以前所未有的方式关注和欣赏城市自然世界的机会。\n在这一系列特别报道中，我们将关注动植物如何适应城市生活，现在需要注意什么，以及未来我们如何鼓励更多的野生城市。\n勒吉尔说：“法国的杀虫剂禁令发挥了重要作用，因为它迫使地方当局和人们的心态发生变化，并提高了人们的意识。”\n“我一直想在获得许可的情况下，在更大的范围内进行这项工作，我希望有更多的权威人士对创建步道感兴趣。”我们谈论了很多关于植物失明的问题--如果给植物命名可以让人们以不同的方式看待它们，那该怎么办？我对伦敦变得如此清洁感到绝望。植物可以有不同的管理方式，带来的好处是节约成本、生物多样性、教育。“。\n在英国，未经许可在小路或高速公路上用粉笔涂抹任何东西-跳房子、艺术或植物学名称-都是非法的，即使它能教育、庆祝和培养人们对大自然的兴趣和知识。\n一位匿名的伦敦树名Chalker说：“我每天散步时都会继续贴标签。我认为它真的深入到了人们现在所在的地方。\n“植物粉笔给人一种快速的自然联系，因为这些文字鼓励你抬起头来注意到你头顶上的树，树叶，树皮，昆虫，天空。”这些对心理健康都有好处。我们谁也管不了那么多--生活在一场全球大流行中已经足够让我们和睦相处了。但它给我带来了极大的快乐。“。\n英国植物园发言人特雷弗·迪恩斯表示，该慈善机构不能宽恕违法行为，但他补充说：“人们对涂鸦植物名称的反应令人难以置信，我认为这是某种深刻的东西的一部分。”这就好像植物在我们的世界中宣告了自己的位置。\n“在YouGov最近的一次民意调查中，16到24岁的人中只有6%的人能正确说出一张野生紫罗兰的名字。同一项民意调查显示，近70%的受访者希望能够辨认出更多的野花。\n他建议，随着喷洒和除草的减少，我们可能会在墙上和小路上看到多达400种植物。这是我们野生植物丰富度的10%。\n谢菲尔德的一项人行道调查发现183种不同的植物，剑桥的另一项调查发现墙上有186种植物。所有这些微小的壁龛组成了一幅极其复杂的挂毯，“Dines说。\n“每朵花都会计数，都会成为传粉者的目标--一小片荨麻上可能会长满毛毛虫。”而鸟爪草，一种并不少见的城市边缘植物，是一种更多的食用植物。", "note_en": "A rising international force of rebel botanists armed with chalk has taken up street graffiti to highlight the names and importance of the diverse but downtrodden flora growing in the cracks of paths and walls in towns and cities across Europe.  The idea of naming wild plants wherever they go – which began in France – has gone viral, with people chalking and sharing their images on social media. More than 127,000 people have  liked a photo of chalked-up tree names in a London suburb, while a  video  ...\n  Presseq told the Guardian: “I wanted to raise awareness of the presence, knowledge and respect of these wild plants on sidewalks. People who had never taken the time to observe these plants now tell me their view has changed. Schools have contacted me since to work with students on nature in the city.”\n France banned pesticide use in parks, streets and other public spaces in 2017 and in gardens from 2019, leading to a surge in awareness of urban wild flowers in the country.\n French botanist and campaigner Sophie Leguil, who lives in London, set up the  More Than Weeds campaign to change perceptions of urban plants in the UK after helping to spread the  Sauvages de  ma rue (“wild things of my street”) chalking campaign in France led by  Tela Botanica. She has won permission to chalk up Hackney’s highways and make chalk trails to highlight the forgotten flora at our feet and is asking other councils to allow the same.\n This week, the Guardian&#39;s Age of Extinction site is looking at biodiversity in cities and urban areas around the world, shining a spotlight on the under-appreciated world of nature hidden among the highrises and busy roads.\n Around 55% of the world ’s population live in urban areas and that number is projected to rise to 68% by 2050. Nature ’s role in the wellbeing and happiness of billions of people will be more important than ever. While urbanisation is a major driver of biodiversity loss, many conservationists and town planners are trying to make built-up areas more nature-friendly. The role of green spaces in urban areas has even been formalised in a draft UN agreement to halt and reverse biodiversity loss,  ...\n The Covid-19 outbreak has seen cities and towns across the world go into lockdown which has enabled wildlife such as wild boar, deer, monkeys, foxes and even lions to venture into territory previously dominated by humans. It has also offered us the chance to notice and appreciate the natural world in cities in an unprecedented way.\n In this special series of reports we&#39;ll be looking at how animals and plants adapt to city life, what to look out for right now and how we can encourage more wild cities in the future.\n “The pesticide ban in France has played a major role as it has forced local authorities and mentalities to change, and raised awareness,” said Leguil.\n “I’ve been wanting to do it on a larger scale, with permission, and I hope to get more authorities interested in creating trails. We talk a lot about plant blindness – what if putting names on plants could make people look at them in a different way? I despair at how sanitised London has become.  Plants can be managed differently, with benefits – cost-saving, biodiversity, education.”\n  In the UK it is illegal to chalk anything – hopscotch, art or botanical names – on paths or highways without permission, even if it educates, celebrates and fosters interest and knowledge in nature.\n One anonymous London tree name chalker said: “I’ll keep labelling as I go on my daily walks. I think it’s really tapped into where people are right now.\n “Botanical chalking gives a quick blast of nature connection, as the words encourage you to look up and notice the tree above you, the leaves, the bark, the insects, the sky. And that’s all good for mental health. None of us can manage that much – living through a global pandemic is quite enough to be getting on with. But it’s brought me a great amount of joy.”\n  UK Plantlife spokesman Trevor Dines said the charity could not condone breaking the law, but added: “The incredible response to graffiti plant names is astonishing and I think it’s part of something profound. It’s as if the plant is declaring its own place in  our world.\n “In a recent YouGov poll, just 6% of 16- to 24-year-olds were able to correctly name a picture of a wild violet. The same poll showed nearly 70% of respondents would like to be able to identify more wild flowers.”\n  With less spraying and weeding, we might expect to see up to 400 plant species on walls and paths, he suggests. That is 10% of our wild flora richness.\n “One survey of pavements in Sheffield found 183 different plants, another in Cambridge found 186 species on walls. All these little micro niches build up to a wonderfully complex tapestry,” Dines said.\n “Every flower counts and will be targeted by pollinators – a patch of nettles can be swamped with caterpillars. And bird’s-foot-trefoil, a not uncommon urban verge plant, is a food plant for more than 160 different invertebrates. If we change our perceptions and see the dandelion flower for what it is – an absolute lifeline to our bees in early spring – we might learn to love them more.”\n A  study by pollinator researchersrevealed that many wild urban “weeds ”rank very highly for the quantity of nectar and pollen each flower provides, often much higher than a variety of garden plants. The top trumps among the plants they measured included dandelions and their lookalikes –rough hawkbit, cat ’s-ear and sow-thistles –plus ragwort, viper ’s bugloss, mallows, self-heal, scentless mayweed, love-in-a-mist, wild mignonette, rosebay willowherb, thistles, creeping buttercup and  ...\n  Andrew Whitehouse, of conservation trust Buglife, said path and wall plants are also important as winter food sources when there is less blossom available for insects such as bumblebees. “Below the concrete, the roots create tiny microhabitats that support woodlice, worms, harvestmen, spiders, baby slugs and snails, which in turn become the food for birds and hedgehogs,” he added.\n Cllr Jon Burke, of Hackney Council, which has gone  pesticide-free in some areasand halved its use overall to increase wild flowers and boost insect biodiversity following public concern, said: “It is absurd that this chalking of plant names is criminal. It is something we welcome as an important and inspiring teaching tool for adults and children. How else will a kid ever know these names? The vocabulary of the natural world helps us access it, love it and desire to protect it. ” ...\n Criminal law expert James Gray of Drystone Chambers confirmed that chalking plant names in the UK is illegal without permission or “lawful excuse” and a rebel botanist could be fined up to £2,500 for painting or inscribing any picture, letter, sign, or other mark on a path, highway surface, tree or other structure.\n  Referring to Victor Hugo’s famous fictional police inspector, Gray added: “The Javerts of this world will see great harm in the scribbles of rogue botanists and call for prosecutions, others will see it as entirely harmless and perhaps even a refreshing diversion in our streets.”\n  He added: “Where the threshold lies will depend on the attitude of those charged with enforcing the law; beauty (or derangement) is in the eye of the magistrate.”\n Find more  age of extinction coverage here, and follow biodiversity reporters  Phoebe Weston and  Patrick Greenfield on Twitter for all the latest news and features", "posttime": "2020-05-04 04:07:31", "tags": "植物学家,botanists,植物,wild", "title": "反叛的植物学家正在用涂鸦来命名被遗忘的植物群。", "title_en": "Rebel botanists are using graffiti to name forgotten flora", "transed": 1, "url": "https://www.theguardian.com/environment/2020/may/01/not-just-weeds-how-rebel-botanists-are-using-graffiti-to-name-forgotten-flora-aoe", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["植物学家", "botanists", "植物", "wild"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要继续，请单击下面的框，让我们知道您不是机器人。\n请确保您的浏览器支持JavaScript和Cookie，并且您没有阻止它们加载。有关更多信息，您可以查看我们的和。", "note_en": "To continue, please click the box below to let us know you&#39;re not a robot.\n  Please make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our   and  .", "posttime": "2020-05-04 04:05:38", "tags": "合乎,pay,click", "title": "太合乎道德是不值得的", "title_en": "It Doesn’t Pay to Be Too Ethical", "transed": 1, "url": "https://www.bloomberg.com/opinion/articles/2020-05-01/it-doesn-t-pay-to-be-too-ethical", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["合乎", "pay", "click"]}, {"category": "", "categoryclass": "", "imagename": "a6b7dfeae77440bf67ee16612eded030.jpg", "infoid": 1000519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "包括冠状病毒数据在内的第一个华尔街财报季已经过去两周，大多数运营大型云部门的大型科技公司都公布了业绩。仅从增长率和营收数字来看，云计算似乎很好地经受住了冠状病毒风暴。AWS同比增长33%，季度营收首次突破100亿美元大关。Azure增长了59%，Google Cloud(包括GCP和GSuite)增长了52%，IBM的Cloud&amp；data Platforms类别.。\n但作为一个成熟的行业，云计算相对较新，尽管云计算作为一种形态因素和产品已经存在了20多年。LoudCloud(后来的Opsware)和Rackspace都是在互联网热潮破裂之前成立的。AWS于2006年与S3、SQS(简单队列服务)和EC2一起推出。\n目前冠状病毒引发的经济衰退，如果不是萧条，将是云计算行业首次成为大规模经济低迷的有意义的参与者。\n(注：在本文中，“云”指的是基础设施或平台即服务、IaaS或PaaS。它不包括基于云的SaaS产品，因为这些产品的类型和变体太多。)。\n在我们深入分析之前，让我们先建立一些通用定义和框架。\n华尔街有点技术性的金融定义是任何贝塔系数为负的东西。简而言之，它指的是任何价格走势与股市走势相反的证券；如果市场上涨，该证券就会下跌，反之亦然。黄金和美国国债就是典型的例子。比特币是更前卫、更不被理解的例子。\n还有一种更普通的方式来思考什么是不受衰退影响的。这是人们必须花钱的任何东西，不管经济有多糟糕，他们的个人财务状况有多糟糕。通常，这意味着公用事业(水电)、汽车保险以及食品和牙膏等基本消费品。\n当然，这些都是没有完全反映现实的启发式方法。一个常见的启发式方法是，酒精消费是不受衰退影响的。(当事情好的时候和坏的时候，你都会想喝醉。)。然而，某些学术研究表明，在2008年大衰退期间，酒精消费实际上有所下降。\n那么，我们应该如何评估云的抗衰退能力呢？如果我们想象每个云平台都是一家独立的公司，Investopedia的五个抗衰退公司特征似乎是这个练习的合理框架。如果你有以下特征之一，你就是一家抗衰退的公司：\n让我们看看云平台是否会具有这些特征中的一个或多个。\n不完全是。如果说有什么不同的话，那就是云平台更多地是这些关键维修服务的消费者。鉴于云基础设施对我们社会基本功能的重要性与日俱增，确实服务于云基础设施的业务(例如服务器和网络维护、数据中心的物理安全等)可能比云本身更能抵御衰退。无论哪种云的需求更大，即使整个行业都经历了彻底的.。\n不是的。某些云供应商可能是支持销售消费者必需品的商店的基础设施。显然，AWS本身现在是亚马逊的基础，亚马逊正在销售和交付许多消费者必需品。但大多数消费者并不知道或不关心他们的基本购物是否在云中进行。在整个互联网经济崩溃的世界末日场景中，人们将从实体选择中购买必需品。\n可能是吧。云的客户群广泛多样，从初创企业，到各行各业的大型企业，再到各级和规模的政府，不一而足。虽然其中一些客户在经济衰退期间会受到影响，但其他客户的需求会因为不同的原因而更大。展望当前经济衰退的未来，旅游公司和航空公司将不会使用那么多云，但Zoom、Slake和其他用于远程工作的产品将使用更多。许多初创企业和中小企业。\n不怎么有意思。对于许多企业来说，使用云可能是个好主意，但它不是边境或海关控制、上市公司的财务审计或石油管道检查。这类防衰退服务通常依附于特定的法律或法规，这些法律或法规要求它们定期发生，无论经济发生了什么。使用云是一种商业选择，绝不是要求或强制要求。\n很有可能。这是一个棘手的问题。云平台上发生的事情是由开源和专有技术混合提供支持的。一些数据中心设计是开源的，是开放计算项目的一部分。大多数硬件都是从销售专有技术的供应商那里获得的。M", "note_en": "Two weeks into the first Wall Street earnings season that includes COVID-19 data, most big tech companies that operate a large cloud unit have reported results. Judging from the growth rate and revenue numbers alone, the cloud seems to be weathering the coronavirus storm just fine. AWS grew 33% year-over-year and  hit the $10 billion USD quarterly revenue mark for the first time. Azure  grew by 59%, Google Cloud (includes both GCP and GSuite)  grew by 52%, and IBM ’s Cloud &amp; Data Platforms category  ...\n But as a full-fledged industry, the cloud is relatively new, even though cloud computing as a form factor and product has been around for more than two decades now.  Loudcloud (later Opsware) and  Rackspace were both founded before the dot com boom busted. AWS  was launched in 2006 with S3, SQS (Simple Queue Service), and EC2.\n The current COVID-19-induced recession, if not depression, will be the first time the cloud computing industry is a meaningful participant of a large-scale economic downturn.\n  (NOTE: in this post, “cloud” means either infrastructure or platform-as-a-service, IaaS or PaaS. It does not include cloud-based SaaS products, where there are too many types and variations.)\n  Before we dive into the analysis, let’s establish some common definitions and a framework first.\n  Wall Street&#39;s somewhat technical financial definition is anything that has a negative beta. In plain terms, it means any security whose price movement is opposite of the stock market’s; if the market goes up, that security goes down, and vice-versa. Gold and U.S. Treasury bonds are the classic examples. Bitcoin is the more edgy, less understood example.\n There’s also a more Main Street way to think about what is recession-proof. It’s anything that people must spend money on, regardless of how bad the economy is and how bad their personal financial situation is. Typically, that means things like utilities (electricity and water), car insurance, and essential consumer products like food and toothpaste.\n Of course, these are all heuristics that do not reflect reality completely. One common heuristic is that alcohol consumption is recession-proof. (You’d want to get drunk when things are good and when things are bad.) However, certain academic study has shown that alcohol consumption  actually decreased during the 2008 Great Recession.\n So how should we evaluate the cloud’s recession-proof-ness? Investopedia’s  five characteristics of a recession-resistant company seems to be a reasonable framework for this exercise, if we imagine each cloud platform to be an independent company. You are a recession-resistant company, if you have  one of the following characteristics:\n  Let’s see if a cloud platform would have one or more of these characteristics.\n  Not really.If anything, cloud platforms are more the consumer of these critical repair services. Given the increasing criticality of the cloud infrastructure to the essential functions of our society, the businesses that do serve the cloud infrastructure, e.g. server and network maintenance, physical security of data centers, etc., may be more recession proof than the cloud itself. Regardless of which cloud is more in demand, and even if the whole industry experiences a categorical  ...\n  No. Certain cloud vendors may be the infrastructure that support the stores that  do sell consumer essentials. Obviously, AWS itself is now the foundation to Amazon.com that  is selling and delivering many of the consumer essentials. But most consumers don’t know, or care, if their essential shopping is happening in the cloud or not. And in an apocalyptic scenario where the entire Internet economy collapses, people will adap and buy essential goods from brick and mortar options.\n  Probably yes. The customer base of the cloud is broad and diverse, from startups, to larger enterprises from all industries, to governments of all levels and sizes. While some of those customers will suffer during a recession, others will be more in demand for different reasons. Projecting into the future of our current recession, travel companies and airlines won ’t be using as much cloud, but Zoom, Slack, and other products used for remote work will use more. Many startups and SMBs  ...\n  Not really. Using the cloud may be a good idea for many businesses, but it’s not border or custom control, financial audits of public companies, or oil pipelines inspection. This category of recession proof services are typically attached to specific laws or regulations that require they happen regularly, no matter what’s happening to the economy. Using the cloud is a business choice, by no means a requirement or mandate.\n  Quite possibly. This is a tricky one. What happens on a cloud platform is powered by a mixture of open source and proprietary technology. Some of the data center designs are open sourced as a part of the Open Compute Project. Most of the hardwares is acquired from vendors selling proprietary technologies. Most of the fundamental software components are open sourced at their core, but tied together with proprietary code that works differently in one cloud versus another. The core  ...\n  If you don’t find this analysis unsatisfying, you are not alone. I’m not either. (And if you came to this post looking for recession proof stock picks, I’m sorry to disappoint you.) There isn’t an established category of recession proof businesses that fully captures all dimensions of the cloud industry.\n The cloud is part utilities, part commercial real estate, part railroad, and part something new that warrants its own framework.  (I welcome your input to develop a better analytical framework together.)\n There are also few data points that can help us understand and model how cloud platforms will perform during a recession. This COVID-19 recession will be the first one.\n Lastly, even if we do have a framework and enough information to establish that cloud platforms are indeed recession proof, it’s hard to invest in them in a targeted way. All the big cloud vendors are parts of bigger tech conglomerates. And the financials around their cloud units are inconsistent and convoluted -- Microsoft, Google, IBM, Oracle all have their own definition and “spin” on what should be considered “cloud”, which is  a point of frustration I’ve written about  many  ...\n Until Amazon decides to break AWS away into a separate entity, or when a cloud startup like  Digital Ocean eventually go public, just investing in cloud computing platforms in the public market is difficult. The best you can do is invest in one of the big tech companies with a cloud or a data center colocation company like Equinix.\n All the dissatisfactions aside, how the entire cloud industry will fare during this current crisis is worth watching and learning from, if only to prepare for the next recession. And there will be another recession.\n If you like what you&#39;ve read, please  SUBSCRIBE to the Interconnected email list. New posts will be delivered to your inbox (twice per week). Follow and interact with me on:  Twitter,  LinkedIn.\n     包括疫情数据在内的第一个华尔街财报季已经进行两周了。大多数运营大规模云计算业务的科技巨头都公布了财报。从增长率和收入数字来看，云似乎正在安然度过冠状疫情导致的经济风暴。AWS年同比增长33%， 首次达到100亿美元的季度收入大关。Azure 增长了59%，Google Cloud（包括GCP和GSuite） 增长了52%，IBM的Cloud &amp; Data Platforms类别（包括Red Hat） 增长了32%。阿里巴巴和Oracle尚未公布盈利情况。\n 但作为一个行业，云计算相对还是个新生事物，没有那么成熟，尽管云计算作为一种形式和产品已经存在20多年了。 Loudcloud（后来是Opsware）和 Rackspace都是在互联网泡沫破灭之前成立的。AWS是 2006年正是启动的，当时只有包括S3、SQS和EC2。\n 当前由COVID-19引发的经济衰退，甚至是大萧条，将是云计算行业第一次“参与”一个大规模的经济衰退。\n 既然目前还在不断增长云行业是否能够抵御衰退？\n （声明一下：本文中的“云”指的是IaaS或PaaS，而不包括基于云上的SaaS产品，因为其中种类太多。）\n  在开始分析之前，我们先建立一些通用的定义和思考框架。\n 什么样的企业能避免经济衰退的影响？\n 华尔街有个偏技术性的定义：任何有负beta的公司。简单地说就是任何价格变动与股市相反的东西；如果股市上涨，它就会下跌，反之亦然。黄金和美国国债就是典型的例子。比特币是一个更前卫、更难理解的例子。\n 还有一种更贴近老百姓日常生活的定义。那就是不管经济有多糟糕，个人财务状况有多糟糕，人们都必须买的东西，通常包括水电、汽车保险以及食品和像牙膏这种基本消费品。\n 当然，这些定义和例子都是各种“估算”，不能完全反映现实。一个常被提到的不受经济衰退的消费品就是酒。（日子好过要喝酒庆祝，日子不好过要喝酒解愁。）然而，一些学术研究发现，在2008年经济大萧条期间，在酒水上的 消费其实减少了。\n 那么，我们应该如何评估云的“抗经济衰退”性呢？如果我们把每个云平台都想象为是一家独立的公司，Investopedia 的抗衰退公司的 五大特征算是个合理的框架。只要有以下特征的其中一个，你就是一家能抗经济衰退的公司：\n  让我们看看一个云平台有没有这些特性。\n  Not really. 一个云更像是这些关键维修服务的消费者。鉴于云基础设施对社会基本运作的重要性在日益增加，为云提供服务的业务（如服务器和网络维护、数据中心安全保护等）可能比云本身更能抵御经济衰退。不管那个云厂商对用户更有吸引力，即使整个云行业都经历了一次彻底的衰退， 维护和保护这些云设施的服务应该不会停止。\n  No. 某些云厂商可能是某些卖消费者必需品的电商的基础设施。AWS本身就是Amazon电商的基础设施，也是许多消费者的购买必需品的地方。但大多数消费者不知道，也不关心他们购物的地方是否在用云。就算是世界末日，整个互联网经济崩盘，人们也会适应环境回到实体店购买必需品。\n  Probably yes. 云计算的客户种类多种多样，从初创企业到各行业的大型企业，到各级政府部门。虽然这些客户中的一些公司会在经济衰退期间遭受损失，但其他公司也会有更多的市场需求。如果看看目前的经济衰退，旅游公司和航空公司将不会使用那么多云计算，但Zoom、Slack和其他用于远程办公的产品将使用更多云计算。许多初创企业和中小型企业将被关闭，但医疗行业、疫苗研究和某些政府服务， 如申请失业保险，将需要更多的资源。这种转变可能不是完全成比例的，但云计算提供的资源的长期使用和消耗是不变的。\n  Not really. 对许多企业来说，使用云计算可能是个好主意，但云计算不能和边境或海关监控、对上市公司的财务审计或石油管道检查的必须性相提并论。这类抗经济衰退服务通常于某条法律或法规挂钩，无论经济状况怎么样，都必须继续。用不用云是个商业选择，不是个要求或指令。\n  Quite possibly. 这类产品分析起来有点复杂。在一个云平台上发生的事情是由开源和专有技术的混合驱动的。某些数据中心设计是开源的，是Open Compute Project的一部分。大多数硬件都是从专有技术的供应商买来的。大多数基本的软件组件的核心都是开源的，而把它们链接并运作起来的代码是专有的，之所以每个云平台的运作都有些不同。云为客户提供的核心价值是多维的：有些是技术、有些是运营、有些和财务有关。在经济衰退期间，对每个维度的影响都不同。那么那作为一种产品，云是否具有足够的专有性或专业性，足以让客户在经济低迷时期维持，甚至增加，在云上的支出？很有可能。\n  如果你对这篇分析的结果不满意，我同意。我也不满意。（如果你看这篇文章的目的是寻找不受经济衰退影响的股票，很抱歉我让你失望了。）目前还没有一个不受衰退影响的业务的分析框架能够完全涵盖整个云行业的所有方面。\n 一个云，部分像水电，部分像商业房地产，部分像铁路，部分完全新的事物，需要自己独特的分析框架。 （我欢迎大家的意见，共同想个更好的分析框架。）\n 目前也没有足够的数据能帮助我们理解和模拟云平台在衰退期间的业务表现。这次冠状疫情导致的衰退将是第一次。\n 即使我们有一个靠谱的框架和足够的信息来证明云确实能抵御经济衰退，也很难有针对性地对其进行投资。所有大型云厂商都是一个更大的巨头下的一部分。围绕其云计算部门的财务也不够一致，错综复杂。微软、谷歌、IBM、Oracle对云的定义都有自己“风格”。 对这一点的不满， 我之前多次写过。\n 除非Amazon那天决定将AWS拆分成一个独立的实体，或者Digital Ocean这样的云平台初创 企业那天上市，否则在股市上投资云计算平台是很困难的。能做的顶多就是投资一家有云计算的巨头，或者像Equinix这样的数据中心托管公司。\n 撇开所有的不满不谈，整个云产业在当前危机中将会表现如何，还是非常值得关注和学习。就算是为下一次衰退做准备，因为绝对还会有另一场经济衰退。\n 如果您喜欢所读的内容，请用email 订阅加入“互联”。新文章将会直接送到您的收箱（每周两次）。请在 Twitter、 LinkedIn上给个follow，跟我互动交流！", "posttime": "2020-05-04 03:44:36", "tags": "衰退,recession,cloud", "title": "云衰退是不是不受影响？", "title_en": "Is the Cloud Recession-Proof?", "transed": 1, "url": "https://interconnected.blog/is-the-cloud-recession-proof/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["衰退", "recession", "cloud"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2x1000 MP/秒4x 4K@60(HEVC)8x 4K@30(HEVC)16x 1080P@60(HEVC)32x 1080P@30(HEVC)。\n2x690 MP/秒2x 4K@60(HEVC)4x 4K@30(HEVC)12x 1080p@60(HEVC)24x 1080p@30(HEVC)16x 1080p@30(H.264)。\n2x1500 MP/秒2x 8K@30(HEVC)6x 4K@60(HEVC)12x 4K@30(HEVC)26x 1080p@60(HEVC)52x 1080p@30(HEVC)30x 1080p@30(H.264)。\n3x USB 3.1、4x USB 2.0 1 x8或1 x4或1 x2或2 x1 PCIe(第3代)。\n3x USB 3.1、4x USB 2.0 1 x8或1 x4或1 x2或2 x1 PCIe(第四代)", "note_en": "2x1000 MP/sec 4x 4K @ 60 (HEVC) 8x 4K @ 30 (HEVC) 16x 1080p @ 60 (HEVC) 32x 1080p @ 30 (HEVC)\n  2x690 MP/sec 2x 4K @ 60 (HEVC) 4x 4K @ 30 (HEVC) 12x 1080p @ 60 (HEVC) 24x 1080p @ 30 (HEVC) 16x 1080p @ 30 (H.264)\n  2x1500 MP/sec 2x 8K @ 30 (HEVC) 6x 4K @ 60 (HEVC) 12x 4K @ 30 (HEVC) 26x 1080p @ 60 (HEVC) 52x 1080p @ 30 (HEVC) 30x 1080p @ 30 (H.264)\n    3x USB 3.1, 4x USB 2.0 \r1 x8 or 1 x4 or 1 x2 or 2 x1 PCIe (Gen3)\n  3x USB 3.1, 4x USB 2.0 \r1 x8 or 1 x4 or 1 x2 or 2 x1 PCIe (Gen4)", "posttime": "2020-05-04 03:44:29", "tags": "nvidia,开发,内存,agx,mp", "title": "NVIDIA AGX Xavier开发套件：更新32 GB内存，售价699美元", "title_en": "Nvidia AGX Xavier Developer Kit: Refreshed with 32GB of RAM, for $699", "transed": 1, "url": "https://www.nvidia.com/en-us/autonomous-machines/embedded-systems/jetson-agx-xavier/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["nvidia", "开发", "内存", "agx", "mp"]}, {"category": "", "categoryclass": "", "imagename": "e1db85aae5d295ff754e6e3cdf7acf9d.jpg", "infoid": 1000517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据加州房地产经纪人协会(California Association Of Realtors)的数据，2019年旧金山湾区现有独户住宅的价格中值自2011年以来首次出现全年下降。\n房价中值降至92.8万美元，较2018年的95万美元下降了2.3%。\n推高房价的力量-该地区蓬勃发展的经济、长期的住房短缺和备受期待的首次公开募股(IPO)洪流-被负面因素所抵消，包括负担能力紧张、外流到成本更低的地区，以及针对住房拥有者的联邦税收减免缩减。\n该协会的数据不包括未加入多重挂牌服务的共管公寓、新建建筑和住宅。\n在旧金山湾区的九个县中，圣克拉拉的房价跌幅最大，为5.6%。然而，房地产经纪公司Compass的首席市场分析师帕特里克·卡莱尔(Patrick Carlisle)表示，这是前一年最强劲的一年，上涨了13.5%。\n他说，奥克兰-伯克利(Oakland-Berkeley)是去年最强劲的子市场，吸引了寻求比旧金山更低成本的“城市氛围”的买家。\nAbio Properties经纪人香农·普罗库普(Shannon Prokup)上周六和周日在伯克利阿什比大道(Ashby Avenue)挂牌的一套房子吸引了400多人参加开放日，这让她大吃一惊。这栋房子有两间卧室、一间浴室和1100平方英尺(约合223平方米)；售价为82.5万美元(约合人民币217万元)。“我没想到会有这么多人参加，”她说。但是“市场上没有一吨低于一百万美元。而且利率仍然很低。“。\n然而，整个阿拉米达县的价格去年下降了2.1%。马林县、圣马特奥县和索诺马县的价格也有所下降，但孔特拉科斯塔、纳帕县和索拉诺县的价格略有上涨。旧金山的房价中值为160万美元，即使到了2018年也是死气沉沉的。\nCarlisle说，旧金山的中间价在2019年第二季度创下新高，“可能是受IPO炒作的推动”。\n旧金山一系列大型公司上市，从3月份的Levi Strauss和Lyft，4月份的Pinterest，5月份的优步和6月份的Slake开始。这些公司的大多数员工，除了以直接上市方式出售股票的Slake之外，都被禁止在长达六个月的时间内出售股票。\n在3月和4月，“一群人说，‘我现在不打算卖，我会等到百万富翁出来。’然后有买家说，‘我们现在就需要买进，然后才能与所有这些百万富翁竞争，’“Carlisle说。“由于卖家在等待百万富翁，而买家试图抢先百万富翁进入市场，第二季度的情况变得更加糟糕。”\n而且不仅仅是在旧金山。东湾Abio Properties的联合创始人林妮特·爱德华兹(Linnette Edwards)表示：“这股热潮发生在一切都进行首次公开募股(IPO)之前。”“我有一些买家在IPO之前坚决要买房，”其中包括一对夫妇，他们当时正期待着一个孩子。“他们称之为婴儿IPO，”她说。\n旧金山的Compass经纪人杰森·巴托夫(Jason Buttorf)有一个客户，他为Slake工作。他和他的妻子多年来一直在金门高地租房，并看中了那里的房子。今年7月，在Slake上市后不久，他们的“梦想之家”上市，他们以超过250万美元的价格抢购一空。\n然而，到秋天来临时，市场“出奇地平静和平静，”巴托夫说。\n卡莱尔表示同意。“炒作对(市场)的影响可能比现实更大，”他说。\n价格通常在春季和夏季达到峰值，在秋季和冬季下降。房地产经纪人协会(Realtor Association)副首席经济学家乔丹·莱文(Jordan Levine)表示，与去年同期相比，湾区下半年的房价表现好于上半年，主要是因为利率下降。\n但毫无疑问，市场已经降温。旧金山湾区一套独栋现房的价格中值从2006年的72.7万美元下降到2009年的43万美元。2010年上升到50万美元(部分归功于首次购房者的信贷)，然后在2011年再次下降，降至46万美元。在那之后，它开始了一系列平流层的增长，使其在2018年达到95万美元。\nLevine说：“随着经济回暖，旧金山湾区的房价迅速反弹，那里的经济表现优于各州和全国。”“随着物价上涨，可负担性变得更成问题，这限制了一些物价升值.”\n他补充说，2018年生效的联邦税收改革也“与过去相比增加了购房成本”。国会将2017年后发放的贷款的抵押贷款利息扣除从100万美元降至75万美元的利息。它还将之前对所有州和地方税(包括所得税和财产税)的无限制扣除上限定为1万美元。\n“你可以看到这起到了一定作用，特别是在旧金山湾区，那里的大多数房主都将受到这些上限的影响，”Levine说。但是，他补充说，你不能全部归咎于税收变化。“我们已经看到", "note_en": "The median price paid for an existing, single-family home in the Bay Area fell in 2019 for the first full year since 2011, according to data from the California Association of Realtors.\n  The median price, the point at which half of homes sold for more and half for less, fell to $928,000, down 2.3% from $950,000 in 2018.\n  Forces pushing prices up — the region’s booming economy, chronic housing shortage and a hotly anticipated flood of initial public offerings — were offset by negative factors, including strained affordability, outmigration to cheaper locales and shrinking federal tax breaks for homeownership.\n  The association’s numbers do not include condominiums, new construction and homes that were not entered into a multiple listing service.\n  Of the nine Bay Area counties, Santa Clara had the biggest price drop, 5.6%. However, it had been the strongest the year before, rising 13.5%, said Patrick Carlisle, chief market analyst with Compass, a real estate brokerage.\n  Oakland-Berkeley was the strongest submarket last year, attracting buyers seeking an “urban ambience” at a lower cost than San Francisco, he said.\n  Abio Properties agent Shannon Prokup was stunned when a home she listed on Ashby Avenue in Berkeley attracted more than 400 people at open houses last Saturday and Sunday. The home has two bedrooms, one bathroom and 1,100 square feet; it is priced at $825,000. “I was not expecting that kind of turnout,” she said. But “there is not a ton on the market under a million dollars. And interest rates are still low.”\n  Prices in all of Alameda County, however, fell 2.1% last year. Prices were also down in Marin, San Mateo and Sonoma counties but up slightly in Contra Costa, Napa and Solano counties. San Francisco’s median price, $1.6 million, was dead even with 2018.\n  The median price in San Francisco hit a high in the second quarter of 2019, “probably driven by IPO hype,” Carlisle said.\n     A string of large San Francisco companies went public, starting with Levi Strauss and Lyft in March, Pinterest in April, Uber in May and Slack in June. Most employees of these companies, except for Slack, which sold shares in a direct listing, were prohibited from selling their shares for up to six months.\n  In March and April, “A bunch of people said, ‘I’m not going to sell now, I’ll wait until the millionaires come out.’ Then there were buyers who said, ‘We need to buy now before we are competing with all these millionaires,’” Carlisle said. “The second quarter got exacerbated by the sellers waiting for the millionaires and buyers trying to beat millionaires to the market.”\n  And it wasn’t just in San Francisco. “The rush happened before everything went IPO,” said Linnette Edwards, co-founder of Abio Properties in the East Bay. “I had buyers who were adamant about buying before the IPOs,” including one couple that was expecting a baby. “They called it baby IPO,” she said.\n     Jason Buttorf, a Compass agent in San Francisco, had a client who works for Slack. He and his wife had been renting in Golden Gate Heights and eyeing homes there for years. In July, shortly after Slack went public, their “dream home” came on the market and they snapped it up for over $2.5 million.\n  By the time fall rolled around, however, the market “was mysteriously quiet and uneventful,” Buttorf said.\n  Carlisle agreed. “The hype might have affected (the market) more than the reality,” he said.\n  Prices typically peak in the spring and summer and decline in the fall and winter. On a year-over-year basis, Bay Area home prices did better in the second half than the first, largely because interest rates declined, said Jordan Levine, the Realtor association’s deputy chief economist.\n  But there’s no doubt that the market has cooled. The median price paid for a single-family existing home in the Bay Area fell from $727,000 in 2006 to $430,000 in 2009. It rose to $500,000 in 2010 (thanks in part to a first-time home buyer credit), then dropped again in 2011, to $460,000. After that it embarked on a string of stratospheric increases that brought it to $950,000 in 2018.\n  “As the economy picked up, home prices in the Bay Area, where the economy was outperforming the state and nation, bounced back very quickly,” Levine said. “As prices have risen, affordability has become more of a problem, which limits some price appreciation.”\n  Federal tax changes that took effect in 2018 have also “increased the cost of homeownership compared to what it was in the past,” he added. Congress reduced the mortgage interest deduction on loans originated after 2017 to interest on $750,000 in debt, down from $1 million. It also capped the previously unlimited deduction for all state and local taxes combined, including income and property taxes, at $10,000.\n  “You are seeing that play a role, particularly in the Bay Area, where most homeowners are going to be impacted by those caps,” Levine said. But, he added, you can’t blame it all on tax changes. “We have seen the pace of growth slowing for several years.”\n  For the month of December only, the median price paid for a single-family, existing home in the Bay Area was $908,750, down 1.8% from November but up 6.9% from December 2018, according to numbers  released Friday by the Realtors association.\n  “December and January are almost always the lowest prices of the year,” Carlisle said. “The whole market is seasonal but the luxury market is fiercely seasonal.” High-end sellers leave for the holidays and take their homes off the market, assuming high-end buyers have also left. As a result, the market gets dominated by lower-end sales, which pulls down the median price.\n  The median price paid for a single-family home in San Francisco fell to $1.45 million in December, down 10.4% from November and down 3.3% from December 2018. That was the worst showing of any Bay Area county.\n  On a year-over-year basis, the December median price was up 3.7% in Alameda County, 8.6% in Contra Costa, 2.3% in Marin, 5.5% in Napa, 6.5% in Santa Clara, 7.2% in Solano and 1.3% in Sonoma. It fell 0.5% in San Mateo.\n  For the state as a whole, Levine predicts that low interest rates will continue to bolster buyer demand but shrinking inventories will keep sales from rising more than 1% or 2% this year. “We see price growth in the mid-single-digit range.”\n  Whether the Bay Area does better or worse than the state “is a tough call,” he said. The Bay Area “has upward momentum from the demand side,” as job growth keeps unemployment near record lows. But the inventory shortage is even more acute in the Bay Area, “which is spilling over to the demand side,” with people leaving the area in search of cheaper housing.\n  Kathleen Pender writes the Net Worth column in The San Francisco Chronicle. She explains how the big business and economic news of the day affect a household&#39;s net worth. She covers saving, investing, debt, taxes, housing, mortgages, retirement plans, employment and unemployment with a focus on issues specific to California and the Bay Area.\n When it comes to big financial decisions, she believes that the simplest answer is almost always the best and that people would stay out of money trouble if they didn&#39;t get involved in things they can&#39;t understand. Pender welcomes questions from readers and frequently answers them in her column.\n She majored in business journalism at the University of Missouri-Columbia and was a Knight-Bagehot fellow in business journalism at Columbia University.", "posttime": "2020-05-04 03:22:25", "tags": "旧金山,湾区,房价,area,价格", "title": "旧金山湾区房价中值自2011年以来首次年度下降", "title_en": "Bay Area median home price first annual drop since 2011", "transed": 1, "url": "https://www.sfchronicle.com/business/networth/article/Bay-Area-median-home-price-fell-2-3-last-year-14985353.php", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["旧金山", "湾区", "房价", "area", "价格"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个次要版本是使LibrePCB功能更强大和提高用户界面可用性的又一个重要步骤。\n用户界面进行了许多可用性改进，使创建库和项目更有效率。例如，原理图编辑器和电路板编辑器现在分别允许搜索符号。设备(#671)：\n此外，长度值(线宽、钻孔直径、坐标等)的所有输入字段。现在显示在工作空间设置中配置的单元中(#684)。每个输入域的单位甚至可以单独更改，并自动保存和恢复。现在您可以输入数学表达式，并可以选择附加一个单位(例如“mm”)，然后将对其求值：\n此版本增加了拾取与放置CSV文件导出(#639)，因此LibrePCB现在也适用于设计将由拾取与放置机器组装的PCB：\n此外，原理图和电路板(#656)都实现了SVG导出。这允许在矢量图形工具中为各种目的处理它们。\n±propos文件导出：BOM CSV导出现在用逗号分隔，而不是分号分隔(#678)。这提高了与CSV读取器的兼容性。\nLibrePCB 0.1.4对项目使用的文件格式与所有之前的0.1.x版本完全相同，因此完全兼容。\n然而，以前的版本有一个错误，允许在NetNames中有换行符(#603)。这在0.1.4中已经修复，因为我们预期(或希望…)。没有项目受到此错误的影响，没有实现自动升级机制。如果您仍然遇到无法使用LibrePCB 0.1.4打开项目的问题，则需要手动修复受影响的网络名称。请不要犹豫与我们联系，以获得迁移方面的帮助。\n2020-05-03", "note_en": "This minor release is one more important step to make LibrePCB more powerfuland to improve usability of the user interface.\n   The user interface got many usability improvements to make creating librariesand projects more efficient. For example the schematic- and board editors nowallow searching for symbols resp. devices( #671):\n  Furthermore, all input fields for length values (line width, drill diameter,coordinate etc.) are now displayed in the unit configured in the workspacesettings ( #684). The unit ofeach input field can even be changed individually and gets saved and restoredautomatically. And you can now enter mathematical expressions and optionallyappend a unit (e.g. “mm”) which will then be evaluated:\n   This release adds a pick&amp;place CSV file export( #639) so LibrePCB is nowalso suitable to design PCBs which will be assembled by pick&amp;place machines:\n  In addition, an SVG export has been implemented for both, schematics andboards ( #656). This allows topostprocess them in a vector graphics tool for various purposes.\n À propos file export: The BOM CSV export is now comma-separated instead ofsemicolon-separated ( #678).This improves compatibility with CSV readers.\n  LibrePCB 0.1.4 uses exactly the same file format for projects as all previous0.1.x releases and are thus fully compatible.\n However, previous versions had a bug which allowed to have linebreaks in netnames ( #603). This has beenfixed in 0.1.4, and since we expect (or hope…) no projects to be affected bythis bug, no automatic upgrade mechanism has been implemented. If you stillrun into the issue that a project cannot be opened with LibrePCB 0.1.4, theaffected net names need to be fixed manually. Please don’t hesitate to contact us to get help with the migration.\n                     2020-05-03", "posttime": "2020-05-04 02:16:14", "tags": "发布,librepcb,现在,csv", "title": "LibrePCB 0.1.4发布", "title_en": "LibrePCB 0.1.4 Released", "transed": 1, "url": "https://librepcb.org/blog/2020-05-03_release_0.1.4/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["发布", "librepcb", "现在", "csv"]}, {"category": "", "categoryclass": "", "imagename": "20ce961d77376a315371d78f48259bb7.jpg", "infoid": 1000514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如他小心翼翼地指出的那样，迈克尔·莱维特教授不是流行病学家。他是斯坦福大学医学院的结构生物学教授，也是2013年诺贝尔化学奖获得者，他的获奖作品是“复杂化学系统的多尺度模型的开发”。从纯统计学的角度来看，他自1月份以来一直密切关注冠状病毒大流行，当时我们大多数人甚至都没有意识到这一点。他第一次发言是在2月初，.", "note_en": "As he is careful to point out, Professor Michael Levitt is not an epidemiologist. He’s Professor of Structural Biology at the Stanford School of Medicine, and winner of the 2013 Nobel Prize for Chemistry for “the development of multiscale models for complex chemical systems.”   With a purely statistical perspective, he has been playing close attention to the Covid-19 pandemic since January, when most of us were not even aware of it. He first spoke out in early February,  ...", "posttime": "2020-05-04 02:15:57", "tags": "诺贝尔,科学家,获得者,prize,professor", "title": "诺贝尔奖获得者科学家迈克尔·莱维特教授：封锁是一个“巨大的错误”", "title_en": "Nobel prize winning scientist Prof Michael Levitt: lockdown is a “huge mistake”", "transed": 1, "url": "https://www.youtube.com/watch?v=bl-sZdfLcEk", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["诺贝尔", "科学家", "获得者", "prize", "professor"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新-我们正在继续努力解决今天在Ghost(Pro)上引入的额外防火墙导致的网络不稳定问题。现在开始恢复连接，我们正在努力恢复最大容量。有关今天早些时候安全问题的更多信息：\u2028我们的调查表明，我们的服务器管理基础设施(SaltStack，CVE-2020-11651 CVE-2020-11652)中的一个严重漏洞被用来试图在我们的服务器上挖掘加密货币。..。\n更新-美国东部夏令时2020年5月3日凌晨1：30左右，一名攻击者使用我们盐栈主机中的cve来访问我们的基础设施(有关更多信息，请参阅https://docs.saltstack.com/en/latest/topics/releases/3000.2.html)。这会影响Ghost(Pro)站点和Ghost.org计费服务。我们能够核实：-信用卡信息不受影响-没有凭据以明文形式存储没有直接证据表明私人客户数据、密码或其他信息具有.", "note_en": "Update - We are continuing work to address the network instability caused by additional firewalls introduced on Ghost(Pro) today. Connections are beginning to be restored now, and we are working toward getting back to full capacity. Further information on the security issue from earlier today: \u2028Our investigation indicates that a critical vulnerability in our server management infrastructure (Saltstack, CVE-2020-11651 CVE-2020-11652) was used in an attempt to mine cryptocurrency on our servers.  ...\n      Update - Around 1:30AM UTC on May 3rd, 2020 an attacker used a CVE in our saltstack master to gain access to our infrastructure (please see  https://docs.saltstack.com/en/latest/topics/releases/3000.2.html for more information). This affects both Ghost(Pro) sites and Ghost.org billing services.   We are able to verify that: - No credit card information is affected - No credentials are stored in plaintext   There is no direct evidence that private customer data, passwords or other information has  ...", "posttime": "2020-05-04 01:53:44", "tags": "基础设施,infrastructure,信息,information", "title": "Ghost.org基础设施被攻破", "title_en": "Ghost.org infrastructure breached", "transed": 1, "url": "https://status.ghost.org/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["基础设施", "信息"]}, {"category": "", "categoryclass": "", "imagename": "eb415cc1ff83a4b0164629465e2497f3.jpg", "infoid": 1000512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已经联系了Moovit的创始人兼首席执行官尼尔·埃雷兹(Nir Erez)以及英特尔发言人，就这些报道发表评论，并将随着我们的了解更新这篇报道。目前，Moovit的发言人没有直接否认这些报道和我们被告知的事情。\nMoovit的发言人说：“目前我们无可奉告，但如果有任何变化，我一定会让你知道。”\n消息人士告诉TechCrunch，这家初创公司-之前得到了英特尔资本的战略投资-将成为英特尔以色列汽车中心的一部分，该中心的落脚点是自动驾驶公司Mobileye，英特尔在2017年以153亿美元收购了该公司。\n目前还不清楚Moovit将在这个枢纽做什么，但作为规则，摄取和操作可靠的实时交通数据和智能路由-Moovit所做事情的关键-是启动和运行自动车辆服务的一些最具挑战性的方面。\n事实上，莫维特已经在与Mobileye和英特尔合作：后者在2018年领导了莫维特的上一轮5，000万美元的D系列融资，作为其中的一部分，英特尔高级副总裁兼Mobileye首席执行官/首席技术官阿姆农·沙斯华教授作为观察员加入了莫维特的董事会。\n吸引人才并将其融入英特尔更大的战略似乎是这笔交易的重要组成部分。在10亿美元中，员工将获得最终金额的约10%，作为留任方案的一部分，这一细节既由以色列希伯来语报纸The Marker报道，也由Wadi Ventures的分析师大卫·贝杜萨(David Bedussa)传递给我们。\n在Moovit上一轮融资时，这家初创公司的估值超过5亿美元，但在过去两年里它已经成长了很多。\n它生产了一款广受欢迎的独立应用程序，人们可以用它来找出在城市中导航的最佳方式，它还与优步(Uber)等公司整合，努力提供多式联运路线，使用从优步汽车和自行车到使用公共交通和步行等不同形式的交通工具。\n2018年，Moovit表示，其iOS、Android和移动网络应用程序在全球80个国家的2000个城市被1.2亿人使用。现在到2020年，这一数字超过8亿人次，覆盖102个国家和45种语言的3100个城市。\n除英特尔外，Moovit的其他投资者还包括宝马(BMW)、Sound Ventures、Gemini以色列、红杉以色列(Sequoia Israel)和路威酩轩集团(LVMH)。\n这笔收购(如果获得通过，还包括并购兴趣)发生在运输业的关键时刻。目前，世界各地的许多人都被要求限制他们的行动，以减缓冠状病毒病例的传播，这已经成为一种全球大流行；部分由于这场公共卫生危机，全球经济一直处于严重下滑之中。这两个都对汽车世界产生了直接影响，汽车世界的生产正在放缓…。\n与此同时，科技界的那些人一直在努力以尽可能优化的方式利用他们的资产，以帮助保持运转(可以说是这样)。\n因此，虽然消费者对Moovit应用的使用率将大幅下降，因为人们出行的次数减少了，但该公司已经推出了一系列冠状病毒服务，以帮助那些仍然需要保持运营，仍然需要从A到B的人。\n其中包括为交通数据管理器(与其正常的B2B产品不同，它是免费提供的)提供的一项特殊服务，以接收最新的交通和交通数据，并随后快速实施“数以千计的短期变化，使乘客能够只使用更新的、有效的路线来计划他们的旅行。”\n它还为Moovit应用程序用户启动了一项实时服务，以确保他们收到这些警报。第三，它推出了一项“紧急动员和按需”服务，让运输经理可以更快地重新调配路线上的公交车，以便更好地为仍在使用公共交通的基本工人提供服务。\n目前尚不清楚Moovit是否一直在努力筹集更多资金，或者它是否像其他许多初创公司在完成交易时感受到的那样拮据，或者这只是一个太好而无法拒绝的报价，或者即使它在冠状病毒之前就已经摆在桌面上了。考虑到Moovit现有的规模和范围，这是一项看起来值得在未来一段时间内运营的业务。", "note_en": "We have contacted Nir Erez, the founder and CEO of Moovit, as well as Intel spokespeople for a comment on the reports and will update this story as we learn more. For now, Moovit’s spokesperson has not denied the reports and what we have been told directly.\n “At this time we have no comment, but if anything changes I’ll definitely let you know,” Moovit’s spokesperson.\n  Sources tell TechCrunch that the startup — which had previously been backed by Intel Capital in a  strategic investment — will become part of Intel’s Israeli automotive hub, which is anchored by Mobileye, the autonomous driving company that  Intel acquired for $15.3 billion in 2017.\n It’s not clear yet what Moovit would be doing in that hub, but as a rule, ingesting and actioning reliable, real-time traffic data and intelligent routing — the crux of what Moovit does — are some of the most challenging aspects of getting autonomous vehicle services up and running.\n And in fact, Moovit had already been working with Mobileye and Intel: the latter led Moovit’s last round of funding, a  Series D of $50 million in 2018, and as part of that, Professor Amnon Shashua, Senior Vice President of Intel and CEO / CTO of Mobileye, joined  Moovit’s Board of Directors as an observer.\n Bringing on talent and integrating it into Intel’s bigger strategy appears to be a big part of the deal. Of the $1 billion, employees will get about 10% of the final amount as part of a retention package, a detail both reported by Israeli Hebrew-language newspaper  The Marker and passed to us by David Bedussa, an analyst with Wadi Ventures.\n At the time of Moovit’s last funding round, the startup was valued at over $500 million, but it has grown a lot in the last two years.\n It produces a popular, standalone app that people use to figure out the best way to navigate around cities, and it also integrates with the  likes of Uber in its efforts to provide multi-modal routes using different forms of transportation from Uber cars and bikes to using public transport and walking.\n In 2018, Moovit said its  iOS,  Android and  Web apps were used by 120 million people globally across 2,000 cities in 80 countries. Now in 2020, that figure is over  800 million riders across 3,100 cities in 102 countries and 45 languages.\n Other investors in Moovit in addition to Intel include BMW, Sound Ventures, Gemini Israel, Sequoia Israel and LVMH.\n The acquisition (if it goes through, but also the M&amp;A interest) comes at a critical moment in the world of transportation. Currently, many people around the world are being asked to curtail their movement to slow down the spread of COVID-19 cases in what has become a global pandemic; and partly as a result of that same public health crisis, the global economy has been in a major downswing. Both have had a direct impact on the automotive world, which is seeing a slowdown in production  ...\n At the same time, those in the world of tech have been working on leveraging their assets in as optimised a way as possible to help keep things moving (so to speak).\n So, while consumer usage of Moovit’s app will have drastically dropped off with people moving around less, the company has  launched a series of COVID-19 services to help those that still need to keep things operational, and still need to get from A to B.\n These have included a special service for transit data managers (which it’s offering for free, unlike its normal B2B products) to both receive updated transit and traffic data and subsequently put in place “ thousands of  short-term changes quickly, enabling riders to plan their trips with only updated, valid routes.”\n It has also started a real-time service for Moovit app users to make sure that they are getting those alerts. Thirdly, it has launched an “emergency mobilisation  on-demand” service that lets transportation managers redeploy buses on routes more quickly to better serve essential workers that are still using public transport.\n It’s not clear if Moovit had been working on raising more money, or if it had been feeling the same pinch that so many other startups have felt when it comes to closing deals, or if this was just an offer too good to refuse, or even if it was on the table before COVID-19. Given Moovit’s existing size and scope, it’s a business that looks like it will be worth running for some time to come.", "posttime": "2020-05-04 01:31:52", "tags": "英特尔,智能,buy,moovit", "title": "英特尔将以10亿美元收购智能城市交通初创公司Moovit的汽车部门", "title_en": "Intel to buy smart urban transit startup Moovit for $1B for its car division", "transed": 1, "url": "https://techcrunch.com/2020/05/03/intel-to-buy-smart-urban-transit-startup-moovit-for-1b-to-boost-its-autonomous-car-division/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["英特尔", "智能", "buy", "moovit"]}, {"category": "", "categoryclass": "", "imagename": "42d2debec3322710246ec36b05566990.jpg", "infoid": 1000510, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "林赛·M·切尔文斯基(Lindsay M.Chervinsky)博士是白宫历史协会的历史学家。她的书《内阁：乔治·华盛顿和美国机构的创建》将于2020年4月7日由哈佛大学出版社出版。在推特上关注她：@lmchervinsky。\n我一直对个人如何影响政策、政府和事件着迷。在18世纪90年代，内阁中有5个人，一小部分人对政府和事件的发展拥有比这更大的权力。当然，关于杰斐逊、汉密尔顿以及他们风雨飘摇的关系的书很多，但我想知道这个机构是从哪里来的。它不在宪法中，没有额外的立法创造了这个机构，而且我读到的一切……。\n当我决定解决这个问题时，我花了一些时间研究革命期间州政府的州长委员会、英国内阁和大陆陆军的战争委员会。但无可避免的是，我真的必须深入华盛顿和部长们的头脑，才能了解他们的互动和该机构的发展。虽然我当时并没有真正意识到这一点(毕竟，写一篇论文，然后你的.。\n第一：我读了一大堆传记。我想知道其他作家写了什么关于他们个性的文章，他们用什么证据来支持他们的论点，以及这些书有什么相似或不同之处。此外，当我真正开始挖掘档案材料时，我已经对叙事弧线有了一种感觉，这真的帮助我保持了事实的直截了当。\n第二：我搜索了财政部长亚历山大·汉密尔顿(Alexander Hamilton)、国务卿托马斯·杰斐逊(Thomas Jefferson)和乔治·华盛顿(George Washington)总统的信件，想找到任何提到内阁会议的地方。我很快了解到，华盛顿在担任总统期间拒绝使用内阁这个词，而是称他们为“我家的绅士”或“部长”。通过记录内阁开会的时间，我可以确定模式、危机时刻以及集会何时平息。\n第三：我追查了其他秘书的剩余信件，以确保我没有错过我主单上的任何会议。\n第四：我仔细研究了信件和笔记，试图了解会议的性质。谢天谢地，汉密尔顿和杰斐逊对内阁会议做了大量记录，华盛顿的信件有时暗示着不舒服或不愉快。例如，华盛顿有时会在会后邀请部长们和他一起吃家庭晚餐。他没有说原因，但我们知道这不是因为汉密尔顿和杰斐逊是最好的朋友。我开始假设.。\n这个过程中一个非常重要的部分是比较笔记。汉密尔顿经常对会议的进展做一个简短的提纲，然后加上关于他想要说的话或想要发表的演讲的笔记。然而，在杰斐逊的笔记中，他会写道，“汉密尔顿做了一个长达四分之三小时的陪审团演讲，就像他在对陪审团讲话一样具有煽动性和说服力。第二天，杰斐逊从他停下来的地方继续说：“再见面。”汉密尔顿又说了四分之三的话.。\n五：一旦我开始猜测他们可能对彼此有什么感觉，他们见面的房间，等等，我就探索了当时的社会风俗习惯。我调查了他们的着装，他们可能的姿势，对隐私的期望，等等。我非常相信你应该开始一个新的项目来探索历史学，但一旦你有了证据，你经常不得不再次回到它，并进一步考虑这些小细节是如何……的。\n第六：到目前为止，我已经让这个过程听起来像是超级数学化的，而且我确实试图真正有条不紊地寻找和记录内阁会议。但是历史不是数学，也不总是有一个方程式。我发现我到了一个我觉得我了解他们的地步。我相信自己会填写一些模糊的细节。我试着根据证据非常清楚我所知道的和我不知道的，但我不怕分享我所知道的。\n在写国务卿埃德蒙德·兰道夫(Edmund Randolph)在其他国务卿指控他向法国出卖国家机密后辞职时，我做出了这种信念上的飞跃。他们的通信有相当好的记录，兰道夫为自己的行为写了一本小册子，但没有一个球员写下自己的情感。依靠我对荣誉文化的了解(主要来自乔安妮·弗里曼)，华盛顿对丑闻的敏感度和退休的愿望，以及书面材料，……。\n当我写下关于兰道夫的那部分时，这是这本书的最后部分之一，我觉得我已经掌握了人们所能真正理解的发生在我们这个时代之前的事件。这对我来说既令人兴奋又很重要", "note_en": "Lindsay M. Chervinsky, Ph.D., is a historian at the  White House Historical Association. Her book,   The Cabinet: George Washington and the Creation of an American Institution will be published by Harvard University Press on April 7, 2020. Follow her on Twitter:  @lmchervinsky.\n  I ’ve always been fascinated by how individuals can influence policy, government, and events. At no time did a small group of people have more power over the development of government and events than in the 1790s when there were five people in the cabinet. Sure there are plenty of books on Jefferson, Hamilton, and their tempestuous relationship, but I wanted to know where the institution came from. It ’s not in the Constitution, no additional legislation created the body, and everything I read  ...\n When I decided to tackle this question, I spent some time exploring the governors ’councils in the state governments, the British cabinet, and the councils of war in the Continental Army during the Revolution. But there was no avoiding that I really had to get into the minds of Washington and the department secretaries in order to understand their interactions and the development of the institution. While I didn ’t really realize it at the time (after all, writing a dissertation and then your  ...\n One: I read a ton of biographies. I wanted to know what other authors had written about their personalities, what evidence they were using to back up their arguments, and how these books were similar or different. Plus, when I actually started digging into the archival material, I already had a sense of the narrative arc and that really helped me keep my facts straight.\n Two: I searched the letters of Secretary of the Treasury Alexander Hamilton, Secretary of State Thomas Jefferson, and President George Washington to find any mention of a cabinet meeting. I quickly learned that Washington refused to use the word cabinet during his presidency and instead referred to them as “the gentlemen of my family” or “the secretaries.” By documenting when the cabinet met, I could determine patterns, moments of crisis, and when gatherings subsided.\n Three: I tracked down remaining letters from the other secretaries to make sure I wasn’t missing any meetings on my master list.\n Four: I dug into the correspondence and notes to try and get a sense of the  character of the meetings. Thankfully, Hamilton and Jefferson kept copious notes about the cabinet meetings and Washington ’s letters sometimes hint at discomfort or unpleasantness. For example, Washington would sometimes invite the secretaries to join him for a family dinner after a meeting. He didn ’t say why, but we know it wasn ’t because Hamilton and Jefferson were the best of pals. I began to hypothesize  ...\n  One really important part of this process was comparing the notes. Hamilton would often write a quick outline of the meeting ’s progress and then include notes about what he wanted to say or the speech he wanted to give. In Jefferson ’s notes, however, he would write, “Hamilton made a jury speech of three-quarters of an hour, as inflammatory and declamatory as if he had been speaking to a jury. ”The next day, Jefferson picked up where he left off: “Met again. Hamilton spoke again three-quarters  ...\n Five: Once I started to speculate about how they might have felt about each other, the room where they were meeting, and more, I explored social customs and conventions at the time. I looked into how they dressed, how they might have postured themselves, expectations of privacy, etc. I ’m a big believer that you should start a new project exploring the historiography, but then you often have to return to it again once you have your evidence and further consider how the little details  ...\n Six: I ’ve made this process sound super mathematical until this point, and it ’s true that I tried to be really methodical about my approach to finding and documenting cabinet meetings. But history isn ’t math and there isn ’t always an equation. I found that I got to a point where I felt like I knew them. I trusted myself to fill in some of the fuzzy details. I try and be very clear about what I know for sure based on evidence and what I don ’t, but I ’m not afraid to share what I  ...\n I took this leap of faith when writing about Secretary of State Edmund Randolph ’s resignation after the other secretaries had accused him of selling state secrets to France. Their correspondence is fairly well documented and Randolph wrote a pamphlet defending his actions, but none of the players ever wrote about their emotions. Leaning on what I knew about honor culture (mostly from Joanne Freeman), Washington ’s sensitivity to scandal and desire to retire, and the written material,  ...\n By the time I wrote the section about Randolph, which was one of the final parts of the book, I felt I had mastered the material as much as one can ever really understand events that came before our time. It was exciting and important to me that I share that knowledge with others. It might have been easier to just say “here ’s what happened, here ’s what they wrote. ”But I think that ’s far less interesting and tells an incomplete story. The whole point of writing a book is to share  ...\n [1] Thomas Jefferson,  The Complete Anas of Thomas Jefferson, ed. Franklin B. Sawvel. (New York: Round Table Press, 1903), 150-57.", "posttime": "2020-05-04 01:09:40", "tags": "欧罗巴,intellectual,华盛顿,cabinet", "title": "写欧罗巴(™)总统内阁的思想史", "title_en": "Writing an Intellectual History of the Presidentâ€™s Cabinet", "transed": 1, "url": "https://s-usih.org/2020/03/writing-an-intellectual-history-of-the-presidents-cabinet/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["欧罗巴", "华盛顿", "cabinet"]}, {"category": "", "categoryclass": "", "imagename": "5bd9fa3dbf5cbbc46e1a23d5f896197d.jpg", "infoid": 1000509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着我们继续保持身体上的距离，我们可能很难感觉到我们所拥有的工具存在于社会中。即使使用Zoom和其他更随意的聊天应用，视频聊天也会给人一种平淡无奇的感觉。(对于我们这些有幸在家工作的人来说，下班后用我们用来做工作的同样工具拜访朋友，感觉并不总是很好。)。通常，我们坐在指定的视频聊天点，静止不动，自我检疫的贸易报告，可能还会拖来一只猫……。\n但是，即使我们的办公桌上没有更好玩的视频聊天应用程序，或者像Facebook的Portal和它的漫游之眼这样的创新，仍然有一些其他的东西没有被传达出去。有了平板电视，我们几乎感觉不到身体上的自我与彼此之间的关系。事实证明，空间社交可能是我们理所当然的事情。但游戏界多年来一直明白这一点。\n现在，我们比以往任何时候都更需要创造性的方式来感受与他人的同在。整个危机看起来对游戏行业来说是一个巨大的机会，但也是一个更超凡的数字社交体验的机会，而不仅仅是看起来像是下班后玩几轮使命召唤。希望这些体验可以如此富有想象力，以至于我们甚至还不知道它们会是什么样子。\n如果VR兑现了它的早期承诺，我们现在可能都住在里面了。拥有某种形式的共享虚拟世界的想法仍然很有说服力，但事实证明，额外的硬件太过令人望而却步(至少目前是这样)，即使是最酷的虚拟现实体验也仍然是利基市场。不过，很明显，我们想要走到一起，不仅仅是在Instagram DM和电子邮件线程中，而是作为导航共享空间的化身。不知怎么的。\n如果说Animal Crossing的主流跨界成功有任何迹象的话，那就是人们现在对虚拟空间有着巨大的胃口。即使有任天堂真正痛苦的在线多人体验，拜访朋友，用网互相击打，并向他们展示你的新住所，也有一些有趣和特别的事情。\n在“动物穿越”中，这真的是一种超越各部分之和的体验。上一次我发自内心地大笑，停不下来是在游戏开始后去拜访我妹妹的动物穿越岛(Animal Crossing Island)。尽管界面只有很少的表情和苛刻的人物限制，她奇怪的幽默感还是设法突破了游戏的限制。出于某些原因，这些限制使它变得更加特别。当我离开她的岛时，我为离开她而感到一阵悲伤……。\n这些经历是在个人层面上发生的，也是在集体层面上发生的-人们正在变得富有创造力。Rogue One的一位编剧刚刚制作了他自己的游戏中的动物穿越脱口秀节目，还有自己的小嘉宾沙发和城市景观。\n纽约的一家开发商甚至发起了一场开发会议，会议完全在一个动物穿越岛(Animal Crossing Island)上举行。就像一个普通的会议一样，“荒岛开发行动”吹嘘自己的演讲者、主持人，甚至在会议结束后将演讲上传到YouTube上。\n许多玩家也在使用动物穿越来进行更亲密的聚会，比如上个月庆祝斋月和逾越节，或者只是把遥远的朋友或家人聚集在一个地方。\n感谢每一位前来参加另一场“动物穿越苏霍尔”的人。与来自世界各地的各位交谈并与你们见面非常愉快&lt；3pic.twitter.com/G9a8SNTFe0。\n这场流行病向我们表明，主流虚拟存在的甜蜜点可能不仅仅是一场类似Zoom的视频会议，而是一种全面的虚拟现实体验。视频游戏，或者更具体地说，视频游戏作为平台，现在似乎正在引起共鸣，即使是在那些不愿认为自己是游戏玩家的人中也是如此。最后一点很重要。\n这是堡垒之夜的制作人史诗游戏一直在做的事情。堡垒之夜和“动物穿越”一样，把不玩游戏的人拉进来是有原因的。当然，堡垒之夜很有趣，也会让人上瘾，但很多游戏都很有趣，很容易上瘾--而堡垒之夜比那些游戏要难得多。\nEPIC真正的创新是其黄油般流畅的社交层，将玩家无缝地连接到不同的平台上。如果你能说服朋友下载一款应用程序，那你就是在做生意。当然，其他游戏也能做到这一点(当然，脑海中会浮现出“我的世界”和其他游戏)，但现在时机决定一切。堡垒之夜的团队正在巧妙地重复他们已经很好的想法。\n本周，EpicePic为堡垒之夜增加了一个新的故意降温的游戏模式，名为Party Royale-一个只是为了和朋友一起出去玩的新岛屿。这里到处都是可笑的非致命性武器，如可扔的汉堡和彩弹枪，派对皇室是一个指定的空间，在那里你可以带着一群人聊天，同时做一些愚蠢而有趣的事情，比如笨拙地踢足球(我和一个完全陌生的人做了这件事)。", "note_en": "As we continue to stay physically distant from one another, it can be hard to feel socially present with the tools we have. Even with  Zoom and other more  casual chat apps, video chat can feel sort of flat. (And for those of us lucky enough to be working from home, visiting friends after work with the same tools we use to  do work stuffdoesn ’t always feel great.) More often than not, we sit, stationary at our designated video-chat-spot, trade reports from self-quarantine and maybe drag in a cat  ...\n But even untethered from our desks with more playful video chat apps or innovations like Facebook’s Portal and its roving eye, there’s still something  else that doesn’t get conveyed. With flat screens, we have little sense of our physical selves in relation to one another. Socializing spatially, as it turns out, is something we probably took for granted. But the gaming world has understood this for years.\n  Now more than ever, we need creative ways to feel present with other people. The whole crisis looks like a huge opportunity for the gaming industry, but also one for more transcendent digital social experiences that don’t just look like playing a few rounds of Call of Duty after work. Hopefully, these experiences could be so imaginative that we don’t even know what they could look like yet.\n If VR had delivered on its early promise, we’d all probably be  living in it right now. The idea of having some kind of shared virtual realm is still a potent one, but the additional hardware has proven too prohibitive to get the average person on board (for now, at least) and even the coolest VR experiences remain niche. Still, it’s clear that we want to come together, not just in Instagram DMs and email threads, but as avatars navigating shared spaces. Somehow.\n   If the mainstream crossover success of Animal Crossing is any indication, people have a huge appetite for virtual spaces right now. Even with Nintendo’s truly painful online multiplayer experience, there’s something fun and special about visiting a friend, bopping each other with nets and showing them your new digs.\n In Animal Crossing, this is truly a more-than-the-sum-of-its-parts experience. The last time I genuinely laughed and  could not stopwas visiting my younger sister ’s Animal Crossing island right after the game launched. In spite of the interface ’s few emotes and harsh character limits, her weird sense of humor managed to bubble up through the game ’s limitations. And those constraints made it more special, for some reason. When I left her island I felt a pang of sadness at leaving her funny  ...\n These experiences are happening on an individual level, but also a collective one—and people are getting creative. One of the writers from Rogue One just made his own  in-game Animal Crossing talkshow, complete with its own tiny guest couch and cityscape view.\n  A developer in New York even launched a dev conference that took place entirely on an Animal Crossing island. Much like a normal conference, “ Deserted Island DevOps” boasted speakers, moderators and even talks to be uploaded to YouTube after the fact.\n Plenty of players are using Animal Crossing for more intimate get-togethers too, like celebrating  Ramadan and  Passover last month or just gathering far-flung friends or family together in one place.\n Thanks to everyone who came out to yet another  @animalcrossing Suhoor. It was super lovely to talk to and meet all of you from all around the world &lt;3  pic.twitter.com/G9a8SNTFe0\n  The pandemic is showing us that the sweet spot of mainstream virtual presence might be something more than a Zoom-like video conference but less than a full-on virtual reality experience. Video games, or more specifically video games as  platforms, seem to be resonating right now, even among the kinds of people who wouldn’t identify as gamers. That last bit is important.\n This is something that Fortnite maker Epic Games has been doing right for a while now. There’s a reason that Fortnite, like Animal Crossing, brought non-gamers into the fold. Sure, Fortnite is fun and addictive, but lots of games are fun and addictive—and Fortnite is much harder than a lot of those games.\n Epic’s real innovation is its buttery-smooth social layer that seamlessly connects players across platforms. If you can talk a friend into downloading an app, you’re in business. Of course, other games get this right too (Minecraft comes to mind, of course, and others) but timing is everything right now. And Fortnite’s team is cleverly iterating on its already-good ideas.\n  This week, Epic added a new deliberately chill game mode called Party Royale to Fortnite —a new island just for hanging out with friends. Littered with appropriately zany non-lethal weapons like throwable hamburgers and paintball guns, Party Royale is a designated space where you can take a group and chat while doing mindless yet amusing nonsense, like awkwardly kicking a soccer ball around (I did this with a total stranger for 20 minutes for some reason!) or driving virtual ATVs  ...\n And like much of Epic ’s battle royale hit, the island itself is over-the-top weird, stocked with everything from a pirate ship to a music festival grounds awash in colorful lights, gigantic neon dancers and a very psychedelic vibe, molly not included. There ’s even a drive-in movie screen, like another area of the main game, which could signal interesting things to come. If we ’re lucky and Epic expands it out, Fortnite ’s newest casual online virtual space could evolve into something  ...\n Fortnite is a game ostensibly about killing people before they kill you, but it’s also a concert venue—and that hints at Epic’s deeper ideas about the game as a versatile social platform. The game held its latest big in-game show event last month, this time featuring a skyscraper-height Travis Scott who performed as he stormed around a bucolic-turned-kaleidoscopic version of the Fortnite map.  12 million people tuned in, besting the 10 million who played during the more modest  Marshmello  ...\n   For anyone who’s spent any time in massively multiplayer online role-playing games ( MMORPGs), this will all sound familiar. These games have long, vibrant history of drawing huge numbers of people together into persistent shared virtual spaces and letting them express themselves. Curating outfits, decorating spaces and even making choices around playstyle and faction affiliation are all ways to express aspects of who you are and what you ’re about in a virtual world populated by  ...\n During its  peak ten years ago, World of Warcraft had as many active subscribers as players who tuned into the Travis Scott event—12 million. Since then, gaming exploded into the mainstream and by late 2018, Fortnite boasted almost  80 million active players. Online multiplayer itself bounded forward too, mostly through the success of blockbuster first-person shooters —usually grim, well-funded and vaguely or overtly militaristic games that routinely court one kind of gamer. Playful,  ...\n The wild popularity of  Minecraft carved out a path for cooperative gaming not just because building stuff is incredibly fun, though that’s true too, but because doing anything new with friends in a virtual space is really cool. Scrappier games like the incredible  No Man’s Skycould do for exploration what Minecraft did for building, but with an indie developer ’s budget, big ideas about multiplayer play can only get so far. Historically, the lion ’s share of industry resources  ...\n There’s a big opportunity right now for games offering a common social experience that’s magnetic enough to draw in the kind of people who don’t even play games. For those of us stuck at home, imaginative gaming worlds offer not just their usual escape from the moment’s stresses, but a way to share space when we can’t come together.", "posttime": "2020-05-04 00:47:27", "tags": "游戏,games", "title": "我们需要更多的视频游戏，首先是社交平台，其次是游戏", "title_en": "We need more video games that are social platforms first, games second", "transed": 1, "url": "https://techcrunch.com/2020/05/02/virtual-worlds-video-games-coronavirus-social-networks-fortnite-animal-crossing/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["游戏", "games"]}, {"category": "", "categoryclass": "", "imagename": "5277c3330dce834b3bd6a1868b0a1b43.png", "infoid": 1000508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第五期！这就对了，你就是这趟旅程的起点！如果有足够的兴趣，我每个月都会继续做这些，所以请和你的朋友们分享吧！\n成为Python开发人员是一个很棒的职业选择。Python现在是最流行的语言，有很多不断增长的工作需求(特别是在Web、数据科学和机器学习领域)。你有很多工作机会，你可以在世界各地工作，你可以解决棘手的问题。然而，有一件事很难，那就是跟上不断演变的生态系统。你想成为一名出色的python开发人员、程序员、程序员、软件开发人员，但你没有这样的能力.。\n这份月度时事通讯的重点是让你跟上行业的最新动态，保持你的技能敏锐，而不浪费你宝贵的时间。我将分享本月最重要的文章、播客和视频。想一想Tim Ferriss和帕累托原则(80/20规则)在软件开发世界的会面。能让你得到80%结果的20%是多少？\n如果你想成为下个月第一个拿到Python月刊并偶尔收到其他独家ZTM内容的人，可以在👇下面订阅。\n微软在他们的YouTube频道上发布了一个免费的Python教程。更多微软的善意将在这份时事通讯中发布，所以请抓紧时间……。哦，时代怎么变了。\n你有没有想过你自己..。我想了解有关Python中的字符串的所有信息，幸运的是，您的愿望实现了，因为本文为您提供了有关您奇怪的痴迷的所有细节。\n本周末您可以尝试使用OpenCV和Python构建一个有趣的项目：从视频和图像中检测年龄。它并不像你想象的那么难，而且会是一个很好的添加到你的投资组合中的东西。\n据说命名是编程中最难的事情之一。谁知道命名变量和类会这么难呢？这篇文章讨论了为什么不应该有一个实用程序模块。\nPython3.9将在5月晚些时候发布，但这并不意味着你现在就不应该学习新功能。大的是一个新的字典操作符|。请查看本文中的这篇文章和其他几篇文章。\n这是我在Python课程中讨论的主题，但最好重复一下。使用Python访问文件路径的传统方式是通过OS模块。但是，新的pathlib模块可能是更好的解决方案。点击此处阅读相关内容。\n在Python中测试代码时最流行的工具之一是使用pytest。在这篇pytest教程中，您将了解它是如何工作的，以及如何使用它测试您的代码。\n就是这样。不再。结局。Python2的最新版本已经发布，继续下去，Python中将不再有版本2的更新。2.7.18是最后一个。\n对于那些对如何正确部署Django应用程序感兴趣的人，这里有一个很好的演练，可以确保您覆盖了基础，并正确地做了每件事。\nPython中的生成器、迭代器、迭代器：何时何地。了解如何扩展代码，使其更容易遍历类的元素或动态生成数据。正如本文所建议的那样，当您将What用于需要循环的重复性任务时，它将带您完成这一过程。\n自从收购Github以来，微软继续尝试并主导程序员工具链市场，并提供更多价值。他们刚刚宣布为GitHub团队提供免费的私有存储库，合作者数量不限。如果你很好奇为什么微软一直在为我们做这些好事，我在过去的一篇文章中解释了他们的策略。\n伊朗版Telegram(由于制裁而无法访问官方Telegram消息应用程序)泄露了4200万用户数据。不太好。\n经过50年的努力，研究人员使硅发光。你刚才读了什么？在这件事上相信我。这是一篇关于硬件领域中发生的一些事情的超级有趣和容易阅读的文章。\n蒙古正计划恢复他们的传统字母表，并取代苏联时期采用的西里尔文字。我不确定这与网络开发有什么关系，但很有趣……。\n谷歌和苹果将开始在他们的移动设备上引入名为联系人追踪的功能。承诺让这一功能可用，允许构建应用程序，帮助报告冠状病毒病例，同时仍保持用户数据匿名。这里很好地回顾了这应该是如何工作的。\n在这些艰难的时期，对于大多数企业来说，这是一个糟糕的时期。这肯定对我们的工作和他们前段时间收购的公司Meetup没有帮助。WeWork现在不得不出售Meetup。\n这些天来，如果不听到一些关于Zoom视频会议应用的消息，你不可能做很多事情。在这些隔离时期，他们的迅速崛起见证了他们的用户基础的飙升。这也表明他们对自己这边的安全关注得有多少。就像[这个]((https://9to5mac", "note_en": "5th issue! That&#39;s right, you&#39;re right at the beginning of this journey! If there is enough interest, I will keep doing these every month so please share it with your friends!\n   Being a Python developer is a fantastic career option. Python is now the most popular language with lots of growing job demand (especially in the fields of Web, Data Science and Machine Learning). You have many job opportunities, you can work around the world, and you get to solve hard problems. One thing that is hard, however, is staying up to date with the constantly evolving ecosystem. You want to be a top-performing python developer, coder, programmer, software developer, but you don ’t have  ...\n This monthly newsletter is focused on keeping you up to date with the industry, keeping your skills sharp, without wasting your valuable time. I will be sharing the most important articles, podcasts and videos of the month. Think  Tim Ferriss and  the Pareto Principle (80/20 rule) meeting the Software Development world. What’s the 20% that will get you 80% of the results?\n If you want to be the first to get next month&#39;s issue of Python Monthly and receive other exclusive ZTM content once in a while, subscribe below 👇\n     Microsoft released a  free Python tutorial on their youtube channel. More Microsoft kindness is coming in this newsletter so hold on tight... oh how times have changed.\n  Have you ever thought to yourself...  I want to know everything about Strings in Python Well, lucky for you, your wish has come true because  this article gives you all the details for your weird obsession.\n  A fun project for you to try building this weekend using OpenCV and Python: Age Detection from video and images. It is not as hard as you think and will be a nice one to add to your portfolio.\n  It is said that naming things is one of the hardest things in programming. Who knew naming variables and classes was so hard?  This article gives an argument as to why you shouldn&#39;t have a  utils module.\n  Python 3.9 is coming later in May but that doesn&#39;t mean you shouldn&#39;t learn about the new features now. The big one is a new Dictionary operator  |. Check out this one plus a few others in  this article.\n  This is a topic I discuss in  my python course, but it is good to repeat. The traditional way to access file paths with python was through the  os module. However, the new  pathlib modules may be a better solution.  Read about it here.\n  One of the most popular tools when you test code in Python is using  pytest. In this  pytest tutorial you will learn how it works and how you can test your code with it.\n  That&#39;s it. No more. The end. The very last version of Python 2 has been released and moving forward there will no longer be version 2 updates in Python.  2.7.18 is the final one.\n  For those curious on how to properly deploy your Django apps,  here is a nice walkthrough to make sure you are covering your bases and doing everything properly.\n  Generators, Iterables, Iterators in Python:  When and Where. Learn how to extend your code to make it easy to loop through the elements of your classes or to generate data on the fly. As the article suggests, it takes you through when you use what for repetitive tasks that require looping.\n  Microsoft continues to try and dominate the programmer toolchain market and offer more value since acquiring Github. They just announced  free private repositories with unlimited collaborators for teams with GitHub. If you are curious why Microsoft keeps doing these nice things for us, I explained their strategy in a past post  here.\n  Iranian version of Telegram  (since they do not have access to the official Telegram messaging app because of sanctions)  leaked 42 million user data. Not good.\n After 50 Years of Effort, Researchers Made Silicon Emit Light. What did you just read? Trust me on this... this is a super interesting and easy to read article on some of the things happening in the hardware space.\n Mongolia is planning on restoring their traditional alphabet and replacing the Cyrillic script adopted under the Soviet period. Not sure how this is related to web development but pretty interesting...\n  Google and Apple are going to start introducing something called Contact Tracing on their mobile devices. The promise is to make this feature available that allows apps to be built that help with reporting of Covid-19 cases while still keeping user data anonymous.  Here is a nice recap of how this is supposed to work.\n It&#39;s a bad time for most businesses during these tough times. It definitely doesn&#39;t help WeWork and the company Meetup that they bought a while back.  WeWork has now had to sell Meetup.\n You can&#39;t do much these days without hearing some news about Zoom video conferencing app. Their meteoric rise during these quarantine times has seen their user base skyrocket. It also showed how little they have paid attention to security on their side. Like [this](( https://9to5mac.com/2020/04/03/zoom-vulnerabilities/) and  this. Reporting Zoom vulnerabilities might become an Olympic sport. Google wants to catch up now so they are making  Google Meet free for use  (used to be a  ...\n Apple  announced a more budget-friendly iPhone. Expect the Apple phone user base to increase because of this. Apple also gave  this programmer $75,000 for discovering a vulnerability in Safari that allowed unauthorized websites to access your camera on iOS and macOS.\n IBM is offering free COBOL programming courses because there is a bump in demand, and there are not a lot of people who still know this ancient programming language.\n Did you know that if you are a Windows user you can have Linux running by using something called the Windows Subsystem for Linux?  Well, the 2nd version, Windows Subsystem for Linux 2 is now generally available. As a Windows user, this means you can do a lot of terminal things that users on MacOS and Linux do and feel like part of the club.\n Google is slowing down hiring for the rest of 2020. Not good news for those trying to land a job at these big tech companies since I am sure the other big tech giants are doing the same.\n  Who needs to learn Unity? Psssht... Anybody can be a game developer using Google Docs now. That&#39;s right, here is a  choose your own adventure game built just with Google Documents.\n I have to share this because it is hilarious.  Check out the cover image of this website. Introducing the most depressing thing I have ever seen in remote office design. Just me?\n   Cognitive biases in software development. These types of articles to me are more important than overly technical ones. Being a good programmer isn&#39;t just about your technical knowledge. This article is a must read this month to understand some of the biases we have as programmers. Knowing that they exist will help you notice them in the future... hopefully.\n   Can you make a youtube video with a dynamic title? That is, a title that is constantly changing based on the number of views?  This video will blow your mind and teach you things that you may not have even realized.\n And remember, dealing with isolation is not suppose to be easy. Stay safe out there and take care of yourself.  This may help.\n    If you haven&#39;t already, subscribe below to receive Python Monthly next month along with exclusive ZTM posts and offers. If you&#39;re already subscribed, please share it with someone (use those little widgets on the left) who might find it useful, they&#39;ll love you and so will we!\n    By the way, my full time job is to teach people to code in the most efficient way possible as the Lead Instructor of  Zero To Mastery Academy. You can see a few of my courses below or see all of my courses by visiting the  courses page.", "posttime": "2020-05-04 00:46:18", "tags": "app,python,monthly", "title": "Python月刊-四月份发生了什么？", "title_en": "Python Monthly – What Happened in April?", "transed": 1, "url": "https://zerotomastery.io/blog/python-monthly-april-2020/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["app", "python", "monthly"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenBoard是一款开源、跨平台的交互式白板教学软件，主要设计用于中小学和大学。它既可以与交互式白板一起使用，也可以在具有笔-平板显示器和光束的双屏幕设置中使用。\nOpenBoard最初是从Open-Sankoré2.0派生出来的，而Open-Sankoré2.0本身就是基于Uniboard的。创建这个分支是为了将软件的重点重新放在其最初的核心功能和价值上，即教师在课堂上的工作，享有易用性的特权。因此，该软件的发展将按照这些核心原则进行。\n目前，OpenBoard由瑞士日内瓦州教育局(DIP)负责维护。洛桑大学在2003年开发了最初的Uniboard软件，它已经通过后勤和财政捐款的方式加入了这一努力。2019年将开发一个协会项目。\n2016年6月，洛桑、内沙特尔、弗里堡和日内瓦大学的代表、日内瓦和汝拉州的教育部以及沃德州(瑞士)的各机构代表举行了一次会议，共同思考OpenBoard所希望的发展。\n在瑞士各地，人们的兴趣正在迅速增长，欧洲和北美也是如此。应该创建一个瑞士法律非营利性组织。该组织将促进OpenBoard及其开源开发，并促进感兴趣的各方之间的合作。这是对导致这种叉子产生的核心原则的尊重，即重新专注于教师在课堂上的工作，优先于使用方便。", "note_en": "OpenBoard is an open source cross-platform teaching software for interactive whiteboard designed primarily for use in schools and universities. It can be used both with interactive whiteboards or in a dual-screen setup with a pen-tablet display and a beamer.\n  OpenBoard was originally forked from Open-Sankoré 2.0, which was itself based on Uniboard. This fork was created to refocus the software on its original core functionalities and values, that is the work of a teacher in a classroom, privileging the ease of use. The evolution of this software will therefore take place in accordance with these core principles.\n    Currently, OpenBoard is maintained by the Education Department (DIP) of the canton of Geneva, in Switzerland. The University of Lausanne, who developped the original Uniboard software in 2003 has joined the effort by means of a logistical and financial contribution. An association project will be developed in 2019.\n A meeting was held in June 2016 between representatives from the universities of Lausanne, Neuchâtel, Fribourg and Geneva, the departments of Education from the cantons of Geneva and Jura as well as various institutions from the canton of Vaud (Switzerland) to together reflect on the desired evolution of OpenBoard.\n  Interest is growing fast across Switzerland but also in Europe and North America. A swiss law non-profit organisation should be created. This organisation would promote OpenBoard and its open source development and foster collaboration between interested parties. This in respect of the core principles which led to the creation of this fork, that is the refocusing on the work of a teacher in a classroom, privileging the ease of use.", "posttime": "2020-05-04 00:46:15", "tags": "大学,面向,interactive,openboard,software", "title": "OpenBoard：面向学校和大学的交互式白板", "title_en": "OpenBoard: Interactive Whiteboard for Schools and Universities", "transed": 1, "url": "http://www.openboard.ch/index.en.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["大学", "面向", "openboard", "software"]}]