[{"category": "", "categoryclass": "", "imagename": "20f7cc581ee120e937806f5a83f1cd3d.png", "infoid": 1066680, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们显然有很多谈论，我们最近谈到了游戏更改，或者计划做，但我们不想分享任何一个。\n  然而，目前对我们来说非常相关的话题，我们可以没有透露任何具体修改游戏分享。今天＆＃39; S Post将是非常技术性的，与编程相关，所以如果您刚刚来到游戏新闻，您可以安全地跳过这一点。\n    现在，只有开发人员在这里，我可以分享我对鲍勃叔叔的新发现以及他对一些与编程项目管理相关的一些基本原则的非常好的解释，以及更多。如果你手上有8.5个免费的时间，我就会提出你看它，因为会有一些引用他在以后的提到。\n  我的一般思想是，我们保持代码的质量非常高，我们有一个合理的工作方法。但我们实际上是许多地方的选择性盲目的受害者。有趣的是，一些碎片代码在始于开始，在整个年份都非常好，即使它扩大了很多......而一些代码才会变得巨大恶化。\n    什么是蜡基金会，与您可能会问的编程有关如何？我的祖父是一个非常热情的蜜蜂守护者。我的童年在我们的花园里度过，在那里你必须小心你在哪里，你坐下的地方，你永远不会留下任何甜蜜的东西，因为你会很快找到一大块蜜蜂。我不得不帮助他并不时了解蜜蜂，我真诚地讨厌，因为我知道我永远不会拥有自己的蜜蜂。但他对了一件事，你学到的一切都会以某种方式对你有用。\n  一个你身边的蜜蜂，作业的是，蜂蜜是由蜜蜂带走的时候，你把蜂巢蜡的基础上，它看起来像这样：\n    它的主要功能是蜜蜂均匀地建立瓷砖，并且遵循已经存在的优化结构是自然的。这正是从一开始就具有良好和可扩展设计的代码发生的事情。 \n另一方面，有一个代码有一个懒惰的原创设计，或者从未预料到复杂性中的复杂性，并且每个变化都只是乱七八糟的一个少量补充。最终我们已经习惯了这一部分代码的想法只是地狱，而且制作小的变化很烦人。这意味着我们只是＆＃39; t就像代码的这一部分，我们希望尽可能少的时间与它一起工作。结果是，问题正在缓慢循环失控。\n  当我拿走叔叔鲍勃眼镜并开始环顾四周时，我很快就确定了这样的几个有问题的地方。这不是一件巧合，这些地方正在消除一个不成比例的大量开发时间，不仅是因为改变很难，而且因为它们充满了回归错误，并且通常是永无止境的问题来源。\n  这是拥有一家公司的美丽事物，该公司在股票市场上and＃39; t。想象一下，你有一家公司每季度慢慢慢，然后你对股东面对陈述，即解决它的方式，是为四分之一或两个，重构代码做出绝对没有新功能，学习新方法等等。怀疑股东将允许这一点。幸运的是，我们没有任何股东，我们了解这项投资的重要意义。不仅在项目中，而且还在我们的技能和知识中，所以我们下次做得更好。\n      如果有相同数量的人从开始完成工作，那么它看起来很合理，但它不是。这只是我的开始，现在有9个程序员。它可以通过游戏来解释越来越多的互联机制，这更难以维持。或者它也可能意味着代码的密度提高了如此大。这两个都没有足够的解释为什么有更多程序员并导致更快的开发。\n  这表明鲍勃叔叔描述了与我们相关的问题，解决方案实际上是改善我们发展的方式，而不是仅缩放人数。一旦我们有一个漂亮的干净基础，那么招聘新程序员并让他们加快代码即可更快。\n  现在让我解释我们所拥有的问题的一些典型例子，以及我们如何修复它们：\n    我们对GUI进行了很多关于GUI（例如FFF-216）以及我们如何从用户和程序员的角度来看，我们如何迭代地提出了我们发现的栏。来自FFF和编码的共同外带是，我们总是低估了复杂的GUI逻辑/样式/布局等。这意味着改善GUI写的方式具有大的潜在收益。 \n我们对GUI对象的结构和布局自0.17更新以来的方式感到满意。但是，码头，它仍然感觉比它应该更加愉快。主要问题是您需要触摸以添加一些交互元素所需的地方。让我向您展示一个例子，一个简单的按钮，用于在地图生成窗口中重置预设。\n          然后，我们需要覆盖MapGeneratorClass中ActionListener的方法，因此我们可以侦听单击操作。\n  最后，我们可以实现这种方法，我们如果我们考虑的元素/否则我们会进行实际逻辑\r void mapgeneratorgui :: onmouseclick（const agui :: mousevent＆amp;活动）\r{\r if（event.getsourceWidget（）==＆amp; this-＆gt; resetPreesetButton）\r this-和gt; onresetsettings（）;\r 否则if（event.getSourceWidget（）==＆amp; this-＆gt; randomizeseedbutton）\r this-＆gt; randomizeeed（）;\r ......\n\r这是一个带有一个简单动作的一个按钮的样板太多。我们在代码中注册了ActionListeners的500多个地方，所以想象膨胀的数量。\n  我们有点注意到，当我们使用lambdas来信号回调和类似的东西时，它往往更令人愉快。那么如果我们做到了这样的主要方式，那么做什么？\n  我们决定完全重写它的工作方式，所以而不是从事件捕获功能添加侦听器和过滤，我们可以确定：\n    这已经是一个很大的改进，因为添加和维护新的逻辑只需要您查看一个地方而不是几个地方，并且它通常更可读，更容易易于错误。 \n由于我们不需要保持指针对象进行比较，我们可以完全从课堂上删除它的定义，并在此时尚的许多地方匿名使它成为：\n  重写所有GUI内部人员（再次）是一项重要任务，但最终它真的很值得，现在我可以和＃39; T想象我们如何站得能够努力做旧的方式。它也导致了数千行代码被删除。\n      当您尝试制作代码清洁剂时，有几个主要目标可以追求。删除代码复制是第一个也是最大的优先级。当代码isn＆＃39; t结构良好时，函数太长，函数太长，或者名字是奇怪的，但如果你有5个版本的同一堆代码，那么这里有略有变化，它是最糟糕的兽。这只是一个时间的问题，直到错误修正/更改仅适用于某些变体，并且它变得越来越不那么明显，是否有变体之间的差异是意图或间接的。\n  手动构建逻辑是一个怪物，因为它已经支持的所有东西：\n    然后，所有这些逻辑都需要乘以2（当您懒惰和复制粘贴时），您可以拥有正常的建筑和幽灵大楼。\n  然后，您将整个代码乘以2倍再次憎恶。为什么？因为我们还需要在延迟隐藏模式下执行所有这些逻辑。听起来很糟糕，但它是＆＃39; t所有的，因为这个逻辑在整个历史上不断地修补并触及了不同的人，代码的核心是一种疯狂的长方法，代码看起来像叔叔提到的地平线鲍勃。\n  现在想象一下，你需要改变关于这个代码的事情，特别是当你考虑时，代码自然有许多角落的错误，或仅在代码的某些变体中固定。这是懒惰的长期设计如何导致生产力差的一个很好的例子。 \n长话短说，这是一个像我的业余爱好者的侧面项目才会完成，但最终，所有重复都是合并的，代码结构很好并进行了完全测试。管理代码需要与以前的状态相比的一小部分，因为读者不需要读取一堆代码只是为了获得大图片并能够改变任何东西。\n  这让我想起了类似种类的重构：＆＃34;一旦我们完成了这一点，它就实际上是一种乐于将东西添加到这个代码。＆＃34; isn＆＃39;它美丽吗？它不仅更有效和更少的越野车，与之工作也是更有乐趣的，并且在不管其他方面，往往更快地努力工作。\n      不，我们显然没有自动测试到达这一点，我们已经提到了几次（FFF-29，FFF-288等）。我们试图连续提高测试所涵盖的代码区域，这导致我们涵盖另一个地区GUI。这与重复低估了GUI需求的低估了低估了。它根本没有测试是这种低估的一部分，它发生了多少次，我们发布了一个释放，它只是因为我们没有测试了一个测试，它只是因为我们没有测试了愚蠢的简单而崩溃了。按钮。最后，它证明并不难以自动化GUI测试。\r\r 我们只需使用GUI创建测试环境（即使在没有图形的测试时，即使测试）。我们声明了一些帮助方法，允许一个非常简单的定义，我们希望光标移动，或者我们想要点击的内容：\n    然后，点击方法调用输入的低级别事件，因此测试所有事件处理和GUI逻辑的所有层。这是端到端测试的一个例子，这是一个有争议的主题，因为一些＆＃34;学校＆＃34;考试方法说，所有应该单独测试一切，所以在这种情况下，我们应该理论上只能测试，首先单击按钮，从而创建要处理的输入，然后，对输入工作的独立测试工作。在某些情况下，我喜欢这种方法，但我真的很喜欢，我可以只用几行代码渗透所有的逻辑层。 （在测试依赖性部分中更多）\n      我必须承认，我没有知道TDD真的是什么直到最近。我认为这是一些废话，因为它对某些功能的所有测试（没有尝试它或甚至编译它）来说，它听起来非常不切实无于并且不切实际，然后尝试实现满足它的东西。\n  但这不是TDD，它必须在A＆＃34中向我展示;对于假人＆＃34;让我意识到我有多错了。\n  TDD实际上是延长测试之间的恒定快速旋转，并使它们持续通过。因此，在编写测试时，您将编写代码以同时基本满足它们。这允许您立即测试您所写的内容，主要使用测试作为代码应确认的指令，这指出了思想过程，使您考虑您所在位置，并编写更具结构化和可测试的代码从一开始就。 \n所以之后＆＃34; aha＆＃34;实现TDD的时刻真的，我开始是即时粉丝。我现在正在努力尽量努力，尽可能地遵循TDD方法，并强迫它在团队中的其他人。它感觉速度慢，即使是恰到好处的简单逻辑也是正确的，但是测试已经证明了我已经多次证明了我，并阻止了在不久的将来讨厌低级调试会话。\n          如果测试应该真正独立，测试C，应该有一些A和B的模型，因此C的测试与系统A + B独立工作。共识似乎是，这导致更独立的设计等。\n  这可能适用于很多情况，但我相信随时随地试图实现这种方法是接近不可能的，它会导致很多杂乱和我＆＃39; m不是唯一一个有问题的杂乱。\n  例如，让我们说我们对地图上正确连接的电极测试。但是当我不知道地图上搜索地图上的实体正常工作时，我很难测试它。\n  我的结论是，只要依赖于依赖性也在测试中，就具有这样的依赖性，但是当你打破某些东西并且很多测试开始失败时，问题就会出现问题。当你做小的改变时，是/否的测试是足够的，但它始终是一个选择，特别是当你重构一些内部结构时，在这种情况下，你有点期待打破很多东西，而你一旦它再次编译，需要有一种方法来逐步修复它们。\n  如果测试没有任何特殊的结构，那么局势在100测试时都是非常不幸的，你剩下的就是尝试半随机选择一些测试，然后开始调试它。但是，当一些复杂的测试案件在中间失败时，它真的误导了，你花了很长时间调试它，只是意识到它是导致失败的一些非常简单的低级错误。\n  目标很容易，我希望得到我改变的最简单的失败情况。 \n为此，我实现了一个简单的测试依赖系统。测试以某种方式执行并列出，即当您要调试并检查测试时，您就知道其所有依赖项已经正常工作。我试图搜索其他人也使用依赖关系，以及他们如何做到，而且我惊奇地没有找到任何东西。\n      在重构鬼/真杆连接逻辑的重复时，我建立并使用了这种结构，它肯定会加速使它正常工作的过程，我自信地确信这是对我们的结构测试的方式可预见的未来。不仅它使测试结果更有用，但它迫使我们将测试套件分成更小的专业单位，这也很有帮助。\n      当Boskid加入团队作为QA Guy时，他的主要角色之一是确保在实际修复之前首先通过测试首次被发现的错误，并且通常改善我们的代码测试覆盖。这使得释放更有信心，我们的回归错误较少，直接转化为长期效率。我强烈认为，这清楚地表明并支持鲍勃叔叔所说的话。使用测试感觉较慢，但实际上是更快的。\n  测试覆盖范围是当应用程序运行时（通常意味着在此上下文中运行测试）时执行代码的部分的指示符。我从未使用过一个工具以衡量测试覆盖，但由于它是鲍勃叔叔的一个谈话之一，我试图第一次使用它。我找到了一个仅适用于Windows的工具，但需要最少的设置量，它是OpenCPPCoverage，它提供了如此：\n    它立即可见，即在测试中都不会触发两个条件命令。它基本上意味着代码只是测试，所以它应该被覆盖，或它＆＃39; s死代码，所以它应该被删除。我非常自信（再次），使用这可以帮助我们编写清洁高质量代码。\n        如果你被这一点移动，如果你读到这一点的情绪是，＆＃34;我希望我的老板有这些优先事项＆＃34;考虑在武器申请工作！ ", "note_en": "We obviously have a lot to talk about when it comes to the game changes we recently did, or plan to do, but we don&#39;t want to share any of it yet.\n  Yet, there is currently a topic very relevant to us and we can share it without revealing any specific changes to the game. Today&#39;s post will be quite technical and related to programming, so if you just came for the game news, you can safely skip this one.\n    Now that there are only developers here, I can share my new discovery of Uncle Bob and his  really nice explanation of some of the fundamental principles related to programming project management, and more. If you have 8.5 free hours on your hands, I propose you watch it, as there will be some references to what he mentions later on.\n  My general thought was, that we maintain the quality of the code to be quite high, and we have a reasonably good work methodology. But we were the victims of selective blindness in many places actually. It is interesting, how some pieces code were just good from start and stayed pretty good throughout all the years, even when it was expanded a lot... and some of the code just deteriorated heavily.\n    What is a wax foundation and how is it related to programming you might ask? My grandfather was a very enthusiastic bee-keeper. My childhood was spent in our garden, where you had to be careful where you step, where you sit down, and you could never leave anything sweet just laying around, because you would find a big pile of bees on top of it quite soon. I had to help him and learn about the bees from time to time, which I honestly hated, because I knew that I will never have any bees of my own. But he was right about one thing, everything you learn will be useful to you in one way or another.\n  One of the jobs you do around bees, is that when the honey is taken away from the bees, you put the wax foundation in the hive, which looks like this:\n    Its primary function is that the bees build their tiles evenly and quite fast, as it is just natural to follow the optimised structure that is already there. And this is exactly what happens with code that has a good and expandable design from the start.\n  On the other hand, there is code that either had a lazy original design, or it was never expected to grow so much in complexity, and each of the changes were just a small addition to the mess. Eventually we got used to the idea that this part of the code is just hell, and that making small changes is annoying. This implies that we just don&#39;t like this part of the code, and we want to spend as little time as possible working with it. And the result is that the problem is slowly spiralling out of control.\n  When I took the  Uncle Bob glasses and started looking around, I quickly identified several problematic places like this. It is not a coincidence, that these places were eating away an disproportionately large amount of the dev time, not only because making changes is hard, but because they are full of regression bugs and generally are a never-ending source of problems.\n  This is the beautiful thing about having a company that isn&#39;t on the stock market. Imagine you have a company that goes slower and slower every quarter, and then you confront the shareholders with the statement, that the way to solve it, is to do absolutely no new features for a quarter or two, refactor the code, learn new methodologies etc. I doubt that the shareholders would allow that. Luckily, we don&#39;t have any shareholders, and we understand the vital importance of this investment in the long run. Not only in the project, but also in our skill and knowledge, so we do better next time.\n      It would look pretty reasonable if there was the same amount of people working from start to finish, but it is not. It was just me at the very start, and now there are 9 programmers. It could be explained by the game getting bigger and growing a lot of interconnected mechanics, which is harder to maintain. Or it could also mean that the density of the code improved so much. Both of these are not enough explain why having more programmers doesn&#39;t result in faster development.\n  This indicates that the problems Uncle Bob describes are relevant to us, and the solution is actually to improve the way we develop rather than just scaling the amount of people. Once we have a nice clean foundation, then hiring new programmers and getting them up to speed with the code will be much faster.\n  Let me now explain a few typical examples of the problems we had, and how we proceeded to fix them:\n    We wrote a lot about the GUI (for example  FFF-216) and how we iteratively raised the bar of what we find acceptable both from both the user and programmer perspective. The common takeaways from the FFF and from the coding was, that we always underestimated how complicated GUI logic/styles/layouting etc. can become. This implies that improving the way the GUI is written has large potential gains.\n  We are happy with the way the GUI objects are structured and laid out since the 0.17 update. But codewise, it still feels much more bloaty than it should be. The main problem was the amount of places you needed to touch to add some interactive element. Let me show you an example, a simple button used to reset presets in the map generator window.\n          Then, we needed to override the method of the ActionListener in our MapGeneratorClass, so we could listen to the click actions.\n  And finally, we could implement the method, where we if/else through the elements we care about, to do the actual logic\r void MapGeneratorGui::onMouseClick(const agui::MouseEvent&amp; event)\r{\r if (event.getSourceWidget() == &amp;this-&gt;resetPresetButton)\r this-&gt;onResetSettings();\r else if (event.getSourceWidget() == &amp;this-&gt;randomizeSeedButton)\r this-&gt;randomizeSeed();\r ...\n\rThis is way too much boilerplate for one button with one simple action. We had over 500 places where we registered actionListeners in the code, so imagine the amount of bloat.\n  We kind of noticed, that when we use lambdas to signal callbacks and similar things in the GUI, it tends to be much more pleasant to use. So what if we made it the primary way to do the GUI?\n  We decided to completely rewrite the way it works, so instead of adding listeners and the filtering from the event catching functions, we can just specify:\n    Which is a big improvement already, as adding and maintaining the new logic only requires you to look at one place instead of several, and it makes it generally more readable and less prone to errors.\n  And since we don&#39;t need to  hold the pointer object for comparisons, we can completely remove its definition from the class, and make it anonymous on many places in this fashion:\n  Rewriting all the GUI internals (again) was a big task, but in the end it really felt to be well worth it, as now I can&#39;t imagine how we could stand doing it the old way. It also resulted in several thousands of lines of code being removed.\n      There are several main goals to pursue when you try to make the code cleaner. Removing code duplication is the first and biggest priority. It is reasonably easy to solve when the code isn&#39;t structured well, functions are too long, or names are weird, but if you have 5 versions of the same pile of code with slight changes here and there, it is the worst beast. It is just a question of time, until bugfixes/changes are only applied to some variants, and it becomes less and less obvious whether the differences between the variants are intended or circumstantial.\n  The manual building logic is a monster, because of all the things it supports already:\n    Then, all of this logic needs to be multiplied by 2 (when you are lazy and copy paste), as you can have normal building and ghost building.\n  And then, you multiply this whole code abomination by 2 again. Why? Because we also need to do all this logic in the  latency hiding mode. Sounds bad already, but it isn&#39;t all of it, since this logic was continually being patched and touched by different people throughout history, the core of the code was a crazy long method with the code looking like the horizon mentioned by Uncle Bob.\n  Now imagine that you need to change something about this code, especially when you take into consideration, that the code naturally had many corner cases wrong, or fixed only in some variant of the code. This is a great example of how lazy long-term design leads to poor productivity.\n  Long story short, this was approached like a hobby side project of mine that took weeks to be finished, but in the end, all the duplications were merged, the code is well structured and fully tested. Managing the code requires a small fraction of the time compared to the previous state, because the reader is not required to read a huge pile of code just to get the big picture and to be able to change anything.\n  This reminds me a quote from Lou after a similar kind of refactoring: &#34; Once we are done with this, it will be actually a pleasure to add stuff to this code.&#34;. Isn&#39;t it beautiful? It is not only more efficient and less buggy, it is also more fun to work with, and working on something enjoyable tends to go faster regardless of other aspects.\n      No, we obviously didn&#39;t get to this point without automated tests, and we mentioned them several times already ( FFF-29,  FFF-288, and more). We try to continuously raise the bar of what code areas are covered by tests, and this lead us to cover yet another area, the GUI. This aligns with the ever repeating underestimation of the amount of engineering care the GUI needs. Having it not tested at all is part of this underestimation, how many times it happened, that we made a release, and it just crashed on something stupid simple in a GUI, just because we didn&#39;t have a test that would click the buttons. And in the end, it proved to not be hard at all to automate the GUI tests.\r\r We just have a mode in which the testing environment is created with GUI (even when tests are run without graphics). We declared some helper methods, that allow a very simple definition of where we want the cursor to move, or what we want to click, like this:\n    The clicking method is then calling the low level events of input, so all layers of event processing and GUI logic are tested. This is an example of end-to-end test, which is a controversial topic, because some &#34;schools&#34; of test methodology say, that everything should be tested separately, so in this case, we should theoretically test only, that clicking the button first, which creates an InputAction to be processed, and then, have an independent test of the InputAction working properly. I like this approach in some cases, but most of the time I really like that I can penetrate all layers of the logic with only a few lines of code. (more in the Test dependencies part)\n      I have to admit, that I didn&#39;t know what TDD really was until recently. I thought that it is some nonsense, because it sounds really impractical and unrealistic to first write all the tests for some feature (without the ability to try it or even compile it), and then try to implement something that satisfies it.\n  But that is not TDD, and it had to be shown to me in a &#34;for dummies&#34; way for me to realize how wrong I was.\n  TDD actually is the constant fast swithing between extending the tests and making them pass continously. So as you write tests, you write code to satisfy them basically at the same time. This allows you to instantly test what you write, and mainly use tests as specifiation of what the code should acctually do, which guides the thought process to make you think about where you are headed to, and to write code that is more structured and testable from the very beginning.\n  So after the &#34;AHA&#34; moment of realizing what TDD really is, I started to be instant fan. I&#39;m now putting a lot of effort to try to follow the TDD methodology as much as possible, and to force it on others in the team as well. It feels slower, to write tests even for simple pieces of logic that just bound to be right, but the test proved me wrong several times already, and prevented annoying low-level debugging sessions in the near future.\n          If tests should be truly independent, test C, should have some mocks of A and B, so the test of C is independent of the system A + B working correctly. The consensus seems to be, that this leads to more independent design etc.\n  This might be applicable in a lot of cases, but I believe that trying to have this approach everywhere is close to impossible, and it would lead to a lot of clutter and  I&#39;m not the only one having problem with this.\n  For example, lets say that we have a test of electric poles connecting properly on the map. But I can hardly test it when I don&#39;t know that searching for entities on the map works properly.\n  My conclusion is, that having dependencies like this is fine, as long as the dependencies are also tested, but the problem comes when you break something and a lot of tests start to fail suddenly. When you do small changes the yes/no indication of tests is enough, but it isn&#39;t always an option, especially when you refactor some internal structure, in which case you kind of expect to break a lot of stuff, and you need to have a way to fix them step by step once it can compile again.\n  If the tests don&#39;t have any special structure, the situation when 100 tests all fail at the same time is very unfortunate, all you are left with is to try to pick some test semi-randomly, and start debugging it. But it is really misleading when some complicated test case fails in the middle, and you spend a long time debugging it, only to realise that it is some very simple low level bug that is causing the failure.\n  The goal is pretty easy, I want to be given the most simple fail case of my change.\n  For this, I implemented a simple test dependency system. The tests are executed and listed in a way, that when you get to debug and check a test, you know that all of its dependencies are already working correctly. I tried to search if others use the dependencies as well, and how they do it, and I surprisingly didn&#39;t find anything.\n      I built and used this structure when refactoring away the duplication of ghost/real poles connection logic and it certainly sped up the process of making it work properly, and I&#39;m confident that this is the way to structure test for us in the foreseeable future. Not only it makes test results more useful, but it forces us to split test suites into smaller more-specialised units, which certainly help as well.\n      When Boskid joined the team as the QA guy, one of his main roles was making sure that any discovered bug is first covered by a test before it gets actually fixed, and generally improving our code test coverage. This made the releases much more confident, and we had less regression bugs, which directly transitions into long-term efficiency. I strongly believe that this clearly indicates and supports what Uncle bob is saying. Working with tests  feels slower but it is actually faster.\n  Test coverage is an indicator of which parts of the code are executed when the application runs (which usually means running the tests in this context). I never used a tool to measure test coverage before, but since it was one of the topics Uncle Bob talked about, I tried to use it for the first time. I found a tool that works only on Windows, but requires the least amount of setup, which is  OpenCppCoverage, which provides an HTML output like this:\n    It is immediately visible, that both of the conditional commands are not triggered in tests. It basically means that either the code just isn&#39;t tested, so it should be covered, or it&#39;s dead code, so it should be removed. I&#39;m quite confident (again), that using this can help us a lot to write clean high quality code.\n        If you are moved by this, if your emotion when you read this is, &#34; I wish my boss had these priorities&#34;. Consider applying for a  job at Wube!", "posttime": "2021-06-18 19:39:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "因子,factorio,代码", "title": "来自因子团队的TDD ", "title_en": "TDD from the Factorio Team", "transed": 1, "url": "https://factorio.com/blog/post/fff-366", "via": "", "real_tags": ["因子", "factorio", "代码"]}, {"category": "", "categoryclass": "", "imagename": "52899f1d30fb51c27fefd15056ef9d1b.jpg", "infoid": 1066678, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "消息人士称，新一轮的e e将三岁的新德里总部公司评估为期25亿美元的拨款，要求匿名作为私人私人。圆形没有关闭，所以条款可能会改变，源警告。\n Bharatpe在新一轮之前筹集了大约2.33亿美元的股权，3500万美元的债务，今年2月的D系列系列率约为9亿美元，去年4.25亿美元。\n  印度新闻出口该款项首次举报了Tiger Global和Bharatpe之间的谈判，并表示这一轮将重视初创公司超过20亿美元。 Bharatpe拒绝发表评论。\n Bharatpe经营着名的服务，以帮助脱机商家接受数字付款和安全的营运资金。即使印度已经成为第二大互联网市场，拥有超过6亿用户的用户，其中大部分国家都仍然脱机。\n 在互联网范围之外的人中是运行小型企业的商人，如路边茶摊和邻里商店。为了使这些商家舒适地接受数字付款，Bharatpe依赖于支持政府支持的UPI支付基础设施的QR码和销售点。\n 该初创公司，服务于600多万商人，该公司表示，在去年11月，它已经部署了超过50,000台POS机器，并且每月交易价值超过12300万美元。它不收取通用QR码访问的商家，但希望通过贷款来赚钱。格罗弗表示，启动贷款业务在2020年增加了10倍。\n 星期五，印度的央行RBI授予内涵牌照的内容牌照，以建立一个小型金融银行。根据当地媒体，Centrum Financial Services与Bharatpe合作。 \n这是一个很大的人！ @bharatpeindia和centrum在收到它的小金融银行许可证的最后一站;原则上的原则＆＃39; 执照。  第一款金融气在临时，在印度获得银行许可证！ 换Fintech的面孔！ https://t.co/d84gem4nzh.  该启动还在努力推出两个新的B2C应用程序，其中一个新的B2C应用程序将在QR UPI上获得信誉，这是一个熟悉此事的另一个来源告诉TechCrunch。 消息人士称，新产品将在本月立即发布。 ", "note_en": "The new round, a Series E, is valuing the three-year-old New Delhi-headquartered firm at a pre-money valuation of $2.5 billion, sources said, requesting anonymity as the matter is private. The round hasn’t closed, so terms may change, sources cautioned.\n BharatPe, which prior to the new round had raised about $233 million in equity and $35 million in debt, was valued at about  $900 million in its Series D round in February this year, and $425 million last year.\n  Indian news outlet the CapTable  first reported about the talks between Tiger Global and BharatPe and said the round would value the startup at over $2 billion. BharatPe declined to comment.\n BharatPe operates an eponymous service to help offline merchants accept digital payments and secure working capital. Even as India has already emerged as the second-largest internet market, with more than 600 million users, much of the country remains offline.\n Among those outside of the reach of the internet are merchants running small businesses, such as roadside tea stalls and neighborhood stores. To make these merchants comfortable with accepting digital payments, BharatPe relies on QR codes and point of sale machines that support government-backed UPI payments infrastructure.\n The startup, which serves more than 6 million merchants, said it had deployed over 50,000 PoS machines by November of last year, and enables monthly transactions worth more than $123 million. It does not charge merchants for universal QR code access, but is looking to make money by lending. Grover said the startup’s lending business grew by 10x in 2020.\n On Friday, India’s central bank RBI  granted an in-principle licence to Centrum Financial Services to set up a small finance bank. Centrum Financial Services has  collaborated with BharatPe for the license, according to local media.\n This is a big one!  @bharatpeindia and Centrum at the final leg of a its Small Finance Bank license after receiving its &#39;in-principle&#39; license.\n First fintech in the offing to get a banking license in India! Changing face of fintech! https://t.co/d84GEM4NzH\n The startup is additionally also working to launch two new B2C apps, one of which will enable credit on QR UPI, another source familiar with the matter told TechCrunch. The new products will launch as soon as this month, the source said.", "posttime": "2021-06-18 19:02:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "global,bharatpe", "title": "Tiger Global在谈判25亿美元的价格上谈到Bharatpe ", "title_en": "\n\t\t\t\tTiger Global in talks to back BharatPe at $2.5 billion valuation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/18/tiger-global-in-talks-to-back-bharatpe-at-2-5-billion-valuation/", "via": "", "real_tags": ["global", "bharatpe"]}, {"category": "", "categoryclass": "", "imagename": "9e553b915cfdc2878ffee1771163f781.jpg", "infoid": 1066677, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乌克兰警方逮捕了一家臭名昭着的赎金瓶帮派的成员，最近针对美国大学，因为对全球执法来破解网络犯罪分子的压力安装。\n 乌克兰国家警察在一份声明中表示，它与国际刑警组织和美国和韩国当局合作，收取乌克兰的六名CL0P黑客集团成员，该集团将声称造成了20亿美元的受害者损害赔偿金位于美国和韩国。\n 该举措首次推出了国家执法机构首次开展了赎金瓶帮派的大规模逮捕，增加了其他国家的压力，遵循诉讼。俄罗斯是赎金瓶帮派的集线器，被归咎于通过未能起诉或引导它们来覆盆网络犯罪分子。\n CL0P是抓住目标数据的几个勒索软件之一，要求赎金释放它。如果目标拒绝支付，则该集团也越来越危及在线泄漏敏感信息，称为“双重敲诈”的策略。\n 最近的目标包括石油公司壳牌和国际律师事务所琼斯日，以及包括斯坦福和加州大学在内的美国大学。在大多数情况下，黑客在文件转移产品中挥动漏洞，该产品通过扩大危害其受害者损害他们的受害者。\n    在近几周的次数击中了击中关键基础设施的大胆攻击之后，赎金已经推动了逮捕。上个月，黑客扰乱了殖民地管道向美国东海岸的大部分供应石油 - 一个攻击白宫归因于基于俄罗斯的群体。\n 因此，政府正在增加压力，以抑制网络犯罪分子的活动。本周，美国总统Joe Biden与俄罗斯总统弗拉基米尔普京一起出席了日内瓦的峰会，其中两党都有预计讨论赎金软件的威胁。 \n一些专家声称莫斯科允许赎金软件犯罪分子在该国的有罪不罚现象上的谅解，即黑客不会瞄准俄语组织，如果呼吁这样做，将与政府分享访问。然而，在峰会之前，普京和拜登都建议他们对交换网络犯罪分子开放。\n 作为其CL0P Takedown的一部分，周三乌克兰警方表示，它在被捕者的家庭和汽车的基辅地区进行了21次搜索，抓住计算机设备，500万乌克兰Hryvnias（约185,000美元）和财产。警方共享的录像镜头展示了军官在似乎是富裕的社区，以及牵引包括特斯拉斯在内的豪华车。\n 警方还表示，它“设法关闭了”一些集团的数字基础设施。\n 目前尚不清楚那些被捕的人是否是本集团或附属公司的核心成员。声明说，被告在监狱中面临八年。\n ©2021金融时报有限公司保留所有权利。不要以任何方式重新分配，复制或修改。 ", "note_en": "Ukrainian police have arrested members of a notorious ransomware gang that recently targeted American universities, as pressure mounts on global law enforcement to crack down on cybercriminals.\n The Ukraine National Police said  in a statement on Wednesday that it had worked with Interpol and the US and South Korean authorities to charge six members of the Ukraine-based Cl0p hacker group, which it claimed had inflicted a half-billion dollars in damages on victims based in the US and South Korea.\n The move marks the first time that a national law enforcement agency has carried out mass arrests of a ransomware gang, adding to pressure on other countries to follow suit. Russia, a hub for ransomware gangs, has been blamed for harbouring cybercriminals by failing to prosecute or extradite them.\n Cl0P is one of several ransomware cartels that seize a target’s data, demanding a ransom to release it. The group has also increasingly threatened to leak sensitive information online if a target refuses to pay, a tactic known as “double extortion.”\n Recent targets have included oil company Shell and international law firm Jones Day, as well as several US universities including Stanford and the University of California. In most cases, the hackers wielded a vulnerability in a file transfer product run by Accellion to compromise their victims.\n    The arrests come as ransomware has been thrust into the spotlight in recent weeks, following a number of audacious attacks hitting critical infrastructure. Last month,  hackers disrupted the Colonial Pipeline supplying petroleum to much of the US East Coast—an attack the White House has attributed to a Russian-based group.\n As a result, governments are under increasing pressure to curb the activities of cybercriminals. This week, US President Joe Biden attended a summit in Geneva with Russia’s President Vladimir Putin, in which both parties were expected to discuss the threat of ransomware.\n Some experts allege Moscow allows ransomware criminals to operate with impunity in the country on the understanding that hackers will not target Russian-speaking organizations and will share access with the government if called upon to do so. Ahead of the summit, however, both Putin and Biden suggested they were  open to exchanging cybercriminals.\n As part of its Cl0P takedown, the Ukrainian police on Wednesday said that it had conducted 21 searches in the Kyiv region of homes and cars of those arrested, seizing computer equipment, 5 million Ukrainian hryvnias (around $185,000), and property. Video footage shared by the police showed officers raiding homes in what appeared to be wealthy neighborhoods, and towing luxury cars including Teslas.\n The police also said it had “managed to shut down” some of the group’s digital infrastructure.\n It is unclear whether those arrested were core members of the group or affiliates. The defendants face eight years in prison, the statement said.\n © 2021 The Financial Times Ltd.  All rights reserved. Not to be redistributed, copied, or modified in any way.", "posttime": "2021-06-18 18:22:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "全球,arrests,赎金", "title": "乌克兰在全球网络犯罪分子镇压中逮捕了勒克斯马州帮派 ", "title_en": "Ukraine arrests ransomware gang in global cybercriminal crackdown", "transed": 1, "url": "https://arstechnica.com/information-technology/2021/06/ukraine-arrests-ransomware-gang-in-global-cybercriminal-crackdown/", "via": "", "real_tags": ["全球", "arrests", "赎金"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066676, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。 您的浏览器将很快重定向到所要求的内容。 ", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2021-06-18 18:16:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帽子,hat", "title": "新的PoE +帽子问题：回应PI基金会 ", "title_en": "New PoE+ Hat Problems: Responding to the Pi Foundation", "transed": 1, "url": "https://www.martinrowan.co.uk/2021/06/raspberry-pi-poe-hat-responding-to-pi-foundation/", "via": "", "real_tags": ["帽子", "hat"]}, {"category": "", "categoryclass": "", "imagename": "cab952f2b7b7730918aa4771a6fe9411.jpg", "infoid": 1066675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚历山大·莫塔科夫（Alexander Polyakov）是普林斯顿大学的理论物理学家，在1981年瞥了一眼量子理论的未来。一系列谜团，从弦乐队的夸克与夸克的结合到质子中，要求他可以剪影的新数学工具刚刚制作。\n “科学中存在方法和公式，作为许多明显不同问题的掌握密钥，”他在物理信件B中的一个现在着名的四页信中写道，“目前我们必须开发一个艺术在随机表面上处理总和。“\n Polyakov的提案证明了很大。在他的论文中，他勾勒出了一个粗略描述了如何计算如何计算狂野混乱类型的平均值的公式，“Liouville场”。他的作品将物理学家带入了一个新的数学竞技场，一个是解锁称为弦的理论对象的行为并构建量子重力模型的一个必不可少的数学竞技场。\n 多年的辛劳将领导Polyakov对物理学中其他理论的突破性解决方案，但他从未完全理解Liouville领域背后的数学。\n 然而，过去七年来，一群数学家已经完成了许多研究人员认为不可能的。在一个有限的地标出版物中，他们使用完全严谨的数学语言重新译分Polyakov的公式，并证明了Liouville领域完美地模拟了现象Polyakov认为它会。\n  “在数学中花费了40年来进行四页，”法国科学研究中心的数学家，Aix-Marseille大学Rémi罗得乐研究中的法国国家科学研究中心中心的数学家Vincent Vargas说，Vincent Vargas说赫尔辛基大学，法国国家科学研究中心的弗朗索斯大卫，以及巴黎萨利大学的科林突。\n 三篇论文在数学世界之间造成一座桥梁和物理学的凌乱现实 - 他们通过在概率理论的数学领域打破新的地面来实现。这项工作还涉及关于在基本物理领域中占据中心阶段的物体的哲学问题：量子领域。 \n“这是数学物理学中的杰作，”宾夕法尼亚大学的数学家辛孙说。\n  在今天的物理学中，最成功的理论中的主要演员是填补空间的田间 - 从一个地方取得不同的值。\n 例如，在古典物理学中，单个字段会告诉您一切关于强制推动对象的一切。采取地球的磁场：指南针的抽搐揭示了该领域的影响（其力量和方向）在地球上的各个点。\n 领域也是量子物理学的核心。然而，由于量子理论的深度随机性，这里的情况更加复杂。从量子的角度来看，地球不产生一个磁场，而是无限数量的不同。有些看起来几乎就像我们在古典物理中观察的那种领域，但其他人都很疯狂地不同。\n 但物理学家仍然希望使预测 - 在这种情况下，理想地匹配的预测，在这种情况下，登山者在指南针上读取。将量子场的无限形式与单个预测同化，是“量子场理论”或QFT的强大任务。这是一个或多个量子字段的模型，每个量子域都具有其无限变化，行为和交互。\n 由巨大的实验支持驱动，QFT已成为粒子物理学的基本语言。标准模型是一种这样的QFT，描绘了像电子那样的基本颗粒，作为从电子领域的Infinent出来的模糊凸块。它已经通过了迄今为止的每一个实验测试（尽管各种组可能在找到第一孔的边缘上）。\n 物理学家玩很多不同的QFT。一些，如标准模型，渴望通过我们宇宙的四个维度（三个空间尺寸加上一维时间）来模拟真正的粒子。其他人描述了奇怪的宇宙中的异国情调颗粒，从二维平坦到六维超级世界。他们与现实的联系是偏远的，但物理学家希望他们能够获得他们可以回到我们自己的世界的见解。 \n基于法国数学家Joseph Liouville的1800年代在19世纪开发的复杂分析的方程，描述了一个完全随机的二维表面 - 即表面，像地壳一样，但其中一个高度每一点都是随机选择的。这种行星将用无限高峰的山脉爆发，每个山脉都通过用无限脸部滚动模具来分配。\n 这样的对象似乎似乎不像物理学的信息模型，但随机性不是没有模式。例如，钟曲线告诉你，您将有多可能在街上随机传递七脚篮球运动员。同样，球根云和斜斜线沿着随机模式，但仍然可以在其大规模和小规模特征之间辨别一致的关系。\n Liouville理论可用于识别所有可能随机锯齿状表面的无尽景观中的模式。 Polyakov意识到这种混乱的地形对于建模琴弦至关重要，在它们移动时挖出曲面。该理论也已应用于在二维世界中描述量子重力。爱因斯坦定义了严重性作为时空曲率，但将他的描述转化为量子场理论的语言创造了一个无限数量的空间时间 - 因为地球产生无限的磁场集合。 Liouville理论将所有这些表面包装在一起。它为物理学家提供了测量曲率的工具 - 因此，在随机2D表面上的每个位置处的引力。\n  “量子重力基本上意味着随机几何形状，因为量子意味着随机和重力装置几何形状，”太阳说。\n Polyakov探索随机曲面世界的第一步是写下定义发现特定尖峰球的几率的表达，因为钟曲线定义了满足特定高度某人的可能性。但他的配方没有导致有用的数值预测。\n 为了解决量子场理论，能够使用该领域来预测观察。在实践中，这意味着计算领域的“相关函数”，其通过描述一个点处的字段的测量值与另一个点的测量来捕获字段的行为。例如，计算光子字段中的相关函数可以为您提供量子电磁的教科书规律。\n Polyakov在更摘要之后：随机表面的本质，类似于使云或海岸线的云云或海岸线的统计关系类似。他需要Liouville领域的随意高度之间的相关性。几十年来，他尝试了两种不同的方式计算它们。他从一个名为Feynman路径积分的技术开始，最后开发一个称为Bootstrap的解决方法。两种方法以不同的方式出现，直到新工作背后的数学家以更精确的制定方式。 \n您可能想象一下，许多形式的核算量可以采取量子字段是不可能的。你会是对的。在20世纪40年代Richard Feynman，一项量子物理先驱，开发了一个处理这种令人困惑的处方的处方，但该方法被证明是严重的限制。\n 再一次，地球的磁场。您的目标是使用量子场理论来预测当您在特定位置读取罗盘读取时将观察到的。为此，Feynman建议将所有领域的表格汇总在一起。他认为，您的阅读将代表所有领域可能表单的平均值。添加具有正确加权的这些无限字段配置的过程称为Feynman路径积分。\n  这是一个优雅的想法，仅对选择量子字段产生混凝土答案。没有已知的数学过程可以有意义地平均覆盖一般的无限空间的无限数量的物体。路径积分是比精确的数学配方的物理哲学更多。数学家质疑它的存在作为有效的操作，并由物理学家依赖它的方式困扰。\n 德国波恩大学的数学家EveliinaPeltola说：“我被遗憾地被禁止为数学家。”\n 物理学家可以利用Feynman的路径积分来计算只有最无聊的字段 - 免费字段的完全相同函数，不会与其他字段甚至与其他字段互动。否则，他们必须融合它，假装田地是免费的，并加入温和的相互作用或“扰动”。此过程称为扰动理论，使它们在标准模型中大多数字段中的相关函数，因为大自然的力量发生得很弱。\n 但它不适用于Polyakov。虽然他初步推测，Liouville Field可能适用于添加轻度扰动的标准黑客，但他发现它自身互动太强烈。与自由领域相比，Liouville Field似乎数学上还有责备，其相关函数出现了无法实现的。\n   Polyakov很快开始寻找一个解决方法。 1984年，他与Alexander Belavin和Alexander Zamolodchikov合作，开发一种称为Bootstrap的技术 - 一个数学阶梯逐渐导致Field的相关函数。 \n要开始攀爬梯子，您需要一个功能，它表达了Mere In The Mere三个点之间的测量之间的相关性。这种“三点相关函数”加上了有关能量的一些附加信息，可以采用粒子的粒子，形成引导梯的底部梯级。\n 从那里开始一次点一点：使用三点函数来构造四点函数，使用四点函数来构造五点函数，等等。但如果您在第一个梯级中以错误的三点相关函数从错误的三点相关函数开始，则该过程会生成冲突的结果。\n Polyakov，Belavin和Zamolodchikov使用自举来成功解决各种简单的QFT理论，而是与Feynman路径积分一样，他们无法让它为Liouville领域工作。\n 然后在20世纪90年代两对物理学家 -  Harald Dorn和Hans-JörgOtto，以及Zamolodchikov和他的兄弟Alexei  - 设法击中了三点相关函数，使得可以缩放梯子，完全解决Liouville领域（和其简单的量子重力描述）。他们的姓名缩写为冠军作为Dozz公式，让物理学家涉及刘维尔领域的任何预测。但即使是作者也知道他们已经偶然到达了它，而不是通过健全的数学来抵达。\n  受过良好教育的猜测在物理学中有用，但他们不满足数学家，后来想要知道Dozz配方来自哪里。解决了Liouville领域的等式应该来自该领域本身的一些描述，即使没有人有最新的想法如何获得它。\n “它看着我就像科幻小说，”库基纳说。 “这永远不会被任何人证明。”\n  在2010年代初，Vargas和Kupiainen与概率理论罗得罗德和物理学家François大卫相连。他们的目标是搭配刘维尔野外的数学松散目的 - 将Polyakov被遗弃的Feynman路径正式塑造，即可能会使Dozz公式揭示。 \n正如他们开始的那样，他们意识到一位名叫Jean-Pierre Kahane的法国数学家已经发现了几十年来，结果将成为Polyakov主理论的关键。\n “在某种意义上是完全疯狂的，刘维尔没有在我们面前定义，”瓦尔加斯说。 “所有的成分都在那里。”\n 洞察力在2014年和2020年之间完成了三个里程碑纸张数学物理学。\n  他们首先抛光了Polyakov的失败的路径积分，因为Liouville Field本身非常互动，与Feynman的扰动工具不相容。所以相反，数学家使用了卡纳的想法，以重新狂野的Liouville领域作为一个较高的狂热的随机对象，称为高斯自由场。高斯自由领域的峰值不会在Liouville领域的峰值波动到与Liouville领域的峰值相同，这使得数学家可以以明智的方式计算平均值和其他统计措施。\n “以某种方式只是使用高斯自由领域，”Peltola说。 “从那时起，他们可以在理论中构建一切。”\n 2014年，他们推出了它们的结果：1981年的路径积分多书的一个新的和改进版本，但在可信高斯自由场方面完全定义。这是一个罕见的例子，其中Feynman的路径积分哲学已经发现了一个坚实的数学执行。\n “可以存在路径积分，确实存在，”德国电子同步rotron的物理学家JörgTeschner说。 \n通过手中的严格定义的路径，研究人员然后试图看出它们是否可以使用它来从Liouville字段中获得答案并导出其相关函数。目标是神话般的dozz公式 - 但它之间的海湾和路径积分似乎很大。\n “我们写在我们的论文中，只是为了宣传原因，我们想要了解Dozz公式，”库圭金说。\n  该团队花了多年的概率散步，确认它真正拥有让自动启动工作所需的所有功能。正如他们所做的那样，他们建立在早期的工作特质。最终，Vargas，Kupiainen和Rhodes成功地成功地发表于2017年的纸张，另一个在2020年10月，Colin Guillarmou。它们从路径积分派生DOZ和其他相关函数，并显示这些公式完全匹配的等式物理学家使用自举者。\n “现在我们已经完成了，”瓦尔加斯说。 “两个对象都是一样的。”\n 该工作解释了Dozz公式的起源，并连接引导程序 - 使用验证的数学对象概括为粗略。完全，它解决了Liouville领域的最终奥秘。\n “这是一个以某种方式结束时代，”Peltola说。 “但我希望它也是一些新的有趣事情的开始。”\n  vargas和他的合作者现在有一个独角兽，一个强烈地交互的qft，通过简短的数学公式以非触发方式完美地描述，这也使得数值预测。 \n现在百万美元问题是：这些概率方法有多远？它们是否可以为所有QFT生成整洁的公式？ vargas很快就会削弱这种希望，坚持认为他们的工具特定于刘维尔理论的二维环境。在较高的尺寸中，即使是自由田过于不规则，所以他怀疑该集团的方法能够能够处理我们宇宙中的引力领域的量子行为。\n 但是，Polyakov的“Master Key”的新鲜薄荷将打开其他门。它的效果已经感受到概率理论，数学家现在可以挥动以前的狡猾物理公式，不受惩罚。由Liouville Work，Sun和他的合作者已经从物理学进口方程来弥补，以解决有关随机曲线的两个问题。\n  物理学家也等待有形的福利，进一步走在路上。 Liouville领域的严格建设可以激发数学家，以证明其他似乎棘手的QFT的功能 - 不仅仅是玩具的重力，而且是真正的颗粒和力量直接在现实的最深刻的身体秘密的情况下的描述。\n “[数学家]会做我们甚至无法想象的事情，”周边学院的理论物理学家Davide Gaiotto说。 ", "note_en": "Alexander Polyakov, a theoretical physicist now at Princeton University, caught a glimpse of the future of quantum theory in 1981. A range of mysteries, from the wiggling of strings to the binding of quarks into protons, demanded a new mathematical tool whose silhouette he could just make out.\n “There are methods and formulae in science which serve as  master keys to many apparently different problems,” he wrote in the introduction to a now famous four-page letter in  Physics Letters B. “At the present time we have to develop an art of handling sums over random surfaces.”\n Polyakov’s proposal proved powerful. In his paper he sketched out a formula that roughly described how to calculate averages of a wildly chaotic type of surface, the “Liouville field.” His work brought physicists into a new mathematical arena, one essential for unlocking the behavior of theoretical objects called strings and building a simplified model of quantum gravity.\n Years of toil would lead Polyakov to breakthrough solutions for other theories in physics, but he never fully understood the mathematics behind the Liouville field.\n Over the last seven years, however, a group of mathematicians has done what many researchers thought impossible. In a trilogy of landmark publications, they have recast Polyakov’s formula using fully rigorous mathematical language and proved that the Liouville field flawlessly models the phenomena Polyakov thought it would.\n  “It took us 40 years in math to make sense of four pages,” said  Vincent Vargas, a mathematician at the French National Center for Scientific Research and co-author of the research with  Rémi Rhodes of Aix-Marseille University,  Antti Kupiainen of the University of Helsinki,  François David of the French National Center for Scientific Research, and  Colin Guillarmou of Paris-Saclay University.\n The three papers forge a bridge between the pristine world of mathematics and the messy reality of physics — and they do so by breaking new ground in the mathematical field of probability theory. The work also touches on philosophical questions regarding the objects that take center stage in the leading theories of fundamental physics: quantum fields.\n “This is a masterpiece in mathematical physics,” said  Xin Sun, a mathematician at the University of Pennsylvania.\n  In physics today, the main actors in the most successful theories are fields — objects that fill space, taking on different values from place to place.\n In classical physics, for example, a single field tells you everything about how a force pushes objects around. Take Earth’s magnetic field: The twitches of a compass needle reveal the field’s influence (its strength and direction) at every point on the planet.\n Fields are central to quantum physics, too. However, the situation here is more complicated due to the deep randomness of quantum theory. From the quantum perspective, Earth doesn’t generate one magnetic field, but rather an infinite number of different ones. Some look almost like the field we observe in classical physics, but others are wildly different.\n But physicists still want to make predictions — predictions that ideally match, in this case, what a mountaineer reads on a compass. Assimilating the infinite forms of a quantum field into a single prediction is the formidable task of a “quantum field theory,” or QFT. This is a model of how one or more quantum fields, each with their infinite variations, act and interact.\n Driven by immense experimental support, QFTs have become the basic language of particle physics. The  Standard Model is one such QFT, depicting fundamental particles like electrons as fuzzy bumps that emerge from an infinitude of electron fields. It has passed every experimental test to date (although various groups may be  on the verge of finding the first holes).\n Physicists play with many different QFTs. Some, like the Standard Model, aspire to model real particles moving through the four dimensions of our universe (three spatial dimensions plus one dimension of time). Others describe exotic particles in strange universes, from two-dimensional flatlands to six-dimensional uber-worlds. Their connection to reality is remote, but physicists study them in the hopes of gaining insights they can carry back into our own world.\n    The Liouville field, which is based on an equation from complex analysis developed in the 1800s by the French mathematician Joseph Liouville, describes a completely random two-dimensional surface — that is, a surface, like Earth’s crust, but one in which the height of every point is chosen randomly. Such a planet would erupt with mountain ranges of infinitely tall peaks, each assigned by rolling a die with infinite faces.\n Such an object might not seem like an informative model for physics, but randomness is  not devoid of patterns. The bell curve, for example, tells you how likely you are to randomly pass a seven-foot basketball player on the street. Similarly, bulbous clouds and crinkly coastlines follow random patterns, but it’s nevertheless possible to discern consistent relationships between their large-scale and small-scale features.\n Liouville theory can be used to identify patterns in the endless landscape of all possible random, jagged surfaces. Polyakov realized this chaotic topography was essential for modeling strings, which trace out surfaces as they move. The theory has also been applied to describe quantum gravity in a two-dimensional world. Einstein defined gravity as space-time’s curvature, but translating his description into the language of quantum field theory creates an infinite number of space-times — much as the Earth produces an infinite collection of magnetic fields. Liouville theory packages all those surfaces together into one object. It gives physicists the tools to measure the curvature —and hence, gravitation — at every location on a random 2D surface.\n  “Quantum gravity basically means random geometry, because quantum means random and gravity means geometry,” said Sun.\n Polyakov’s first step in exploring the world of random surfaces was to write down an expression defining the odds of finding a particular spiky planet, much as the bell curve defines the odds of meeting someone of a particular height. But his formula did not lead to useful numerical predictions.\n To solve a quantum field theory is to be able to use the field to predict observations. In practice, this means calculating a field’s “correlation functions,” which capture the field’s behavior by describing the extent to which a measurement of the field at one point relates, or correlates, to a measurement at another point. Calculating correlation functions in the photon field, for instance, can give you the textbook laws of quantum electromagnetism.\n Polyakov was after something more abstract: the essence of random surfaces, similar to the statistical relationships that make a cloud a cloud or a coastline a coastline. He needed the correlations between the haphazard heights of the Liouville field. Over the decades he tried two different ways of calculating them. He started with a technique called the Feynman path integral and ended up developing a workaround known as the bootstrap. Both methods came up short in different ways, until the mathematicians behind the new work united them in a more precise formulation.\n  You might imagine that accounting for the infinitely many forms a quantum field can take is next to impossible. And you would be right. In the 1940s Richard Feynman, a quantum physics pioneer, developed one prescription for dealing with this bewildering situation, but the method proved severely limited.\n Take, again, Earth’s magnetic field. Your goal is to use quantum field theory to predict what you’ll observe when you take a compass reading at a particular location. To do this, Feynman proposed summing all the field’s forms together. He argued that your reading will represent some average of all the field’s possible forms. The procedure for adding up these infinite field configurations with the proper weighting is known as the Feynman path integral.\n  It’s an elegant idea that yields concrete answers only for select quantum fields. No known mathematical procedure can meaningfully average an infinite number of objects covering an infinite expanse of space in general. The path integral is more of a physics philosophy than an exact mathematical recipe. Mathematicians question its very existence as a valid operation and are bothered by the way physicists rely on it.\n “I’m disturbed as a mathematician by something which is not defined,” said  Eveliina Peltola, a mathematician at the University of Bonn in Germany.\n Physicists can harness Feynman’s path integral to calculate exact correlation functions for only the most boring of fields — free fields, which do not interact with other fields or even with themselves. Otherwise, they have to fudge it, pretending the fields are free and adding in mild interactions, or “perturbations.” This procedure, known as perturbation theory, gets them correlation functions for most of the fields in the Standard Model, because nature’s forces happen to be quite feeble.\n But it didn’t work for Polyakov. Although he initially speculated that the Liouville field might be amenable to the standard hack of adding mild perturbations, he found that it interacted with itself too strongly. Compared to a free field, the Liouville field seemed mathematically inscrutable, and its correlation functions appeared unattainable.\n   Polyakov soon began looking for a workaround. In 1984, he teamed up with Alexander Belavin and Alexander Zamolodchikov to develop a technique called the  bootstrap — a mathematical ladder that gradually leads to a field’s correlation functions.\n To start climbing the ladder, you need a function which expresses the correlations between measurements at a mere three points in the field. This “three-point correlation function,” plus some additional information about the energies a particle of the field can take, forms the bottom rung of the bootstrap ladder.\n From there you climb one point at a time: Use the three-point function to construct the four-point function, use the four-point function to construct the five-point function, and so on. But the procedure generates conflicting results if you start with the wrong three-point correlation function in the first rung.\n Polyakov, Belavin and Zamolodchikov used the bootstrap to successfully solve a variety of simple QFT theories, but just as with the Feynman path integral, they couldn’t make it work for the Liouville field.\n Then in the 1990s two pairs of physicists —  Harald Dorn and Hans-Jörg Otto, and  Zamolodchikov and his brother Alexei — managed to hit on the three-point correlation function that made it possible to scale the ladder, completely solving the Liouville field (and its simple description of quantum gravity). Their result, known by their initials as the DOZZ formula, let physicists make any prediction involving the Liouville field. But even the authors knew they had arrived at it partially by chance, not through sound mathematics.\n  Educated guesses are useful in physics, but they don’t satisfy mathematicians, who afterward wanted to know where the DOZZ formula came from. The equation that solved the Liouville field should have come from some description of the field itself, even if no one had the faintest idea how to get it.\n “It looked to me like science fiction,” said Kupiainen. “This is never going to be proven by anybody.”\n  In the early 2010s, Vargas and Kupiainen joined forces with the probability theorist Rémi Rhodes and the physicist François David. Their goal was to tie up the mathematical loose ends of the Liouville field — to formalize the Feynman path integral that Polyakov had abandoned and, just maybe, demystify the DOZZ formula.\n As they began, they realized that a French mathematician named Jean-Pierre Kahane had discovered, decades earlier, what would turn out to be the key to Polyakov’s master theory.\n “In some sense it’s completely crazy that Liouville was not defined before us,” Vargas said. “All the ingredients were there.”\n The insight led to three milestone papers in mathematical physics completed between 2014 and 2020.\n  They first polished off the path integral, which had failed Polyakov because the Liouville field interacts strongly with itself, making it incompatible with Feynman’s perturbative tools. So instead, the mathematicians used Kahane’s ideas to recast the wild Liouville field as a somewhat milder random object known as the Gaussian free field. The peaks in the Gaussian free field don’t fluctuate to the same random extremes as the peaks in the Liouville field, making it possible for the mathematicians to calculate averages and other statistical measures in sensible ways.\n “Somehow it’s all just using the Gaussian free field,” Peltola said. “From that they can construct everything in the theory.”\n In 2014, they  unveiled their result: a new and improved version of the path integral Polyakov had written down in 1981, but fully defined in terms of the trusted Gaussian free field. It’s a rare instance in which Feynman’s path integral philosophy has found a solid mathematical execution.\n “Path integrals can exist, do exist,” said  Jörg Teschner, a physicist at the German Electron Synchrotron.\n With a rigorously defined path integral in hand, the researchers then tried to see if they could use it to get answers from the Liouville field and to derive its correlation functions. The target was the mythical DOZZ formula — but the gulf between it and the path integral seemed vast.\n “We’d write in our papers, just for propaganda reasons, that we want to understand the DOZZ formula,” said Kupiainen.\n  The team spent years prodding their probabilistic path integral, confirming that it truly had all the features needed to make the bootstrap work. As they did so, they built on earlier work by Teschner. Eventually, Vargas, Kupiainen and Rhodes succeeded with a paper posted in  2017 and another in October  2020, with Colin Guillarmou. They derived DOZZ and other correlation functions from the path integral and showed that these formulas perfectly matched the equations physicists had reached using the bootstrap.\n “Now we’re done,” Vargas said. “Both objects are the same.”\n The work explains the origins of the DOZZ formula and connects the bootstrap procedure —which mathematicians had considered sketchy — with verified mathematical objects. Altogether, it resolves the final mysteries of the Liouville field.\n “It’s somehow the end of an era,” said Peltola. “But I hope it’s also the beginning of some new, interesting things.”\n  Vargas and his collaborators now have a unicorn on their hands, a strongly interacting QFT perfectly described in a nonperturbative way by a brief mathematical formula that also makes numerical predictions.\n Now the  literal million-dollar question is: How far can these probabilistic methods go? Can they generate tidy formulas for all QFTs? Vargas is quick to dash such hopes, insisting that their tools are specific to the two-dimensional environment of Liouville theory. In higher dimensions, even free fields are too irregular, so he doubts the group’s methods will ever be able to handle the quantum behavior of gravitational fields in our universe.\n But the fresh minting of Polyakov’s “master key” will open other doors. Its effects are already being felt in probability theory, where mathematicians can now wield previously dodgy physics formulas with impunity. Emboldened by the Liouville work, Sun and his collaborators have already imported equations from physics to solve  two  problems regarding random curves.\n  Physicists await tangible benefits too, further down the road. The rigorous construction of the Liouville field could inspire mathematicians to try their hand at proving features of other seemingly intractable QFTs — not just toy theories of gravity but descriptions of real particles and forces that bear directly on the deepest physical secrets of reality.\n “[Mathematicians] will do things that we can’t even imagine,” said  Davide Gaiotto, a theoretical physicist at the Perimeter Institute.", "posttime": "2021-06-18 18:15:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "量子,quantum,理论", "title": "数学家证明了2D版的量子重力工作 ", "title_en": "Mathematicians Prove 2D Version of Quantum Gravity Works", "transed": 1, "url": "https://www.quantamagazine.org/mathematicians-prove-2d-version-of-quantum-gravity-really-works-20210617/", "via": "", "real_tags": ["量子", "quantum", "理论"]}]