[{"category": "", "categoryclass": "", "imagename": "58746eaa4ab6da2e26fef83c1bab3b99.jpeg", "infoid": 1069527, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论您是看好加密货币还是认为它是胡说八道，您都无法在世界上度过一天而不听说似乎每天都在涌现的各种数字货币。加密无处不在，而且——如果这取决于杰克·多尔西——它将创造世界和平。就饶舌歌手而言，至少自 2013 年以来，他们一直在贬低加密货币。在与时代对话时，多连字符唐纳德·格洛弗 (Donald Glover) 表示，比特币感觉比以黄金为后盾的货币“更真实”。 2017 年，在“Down”中，G-Eazy 说“忠诚的母狗获得加密货币”，而不幸的人只会获得 Lyft 代码。尽管在其他领域，加密货币被视为对环境资源的巨大影响，主要是让富人变得更富有，但在嘻哈音乐中，对加密货币的情绪往往更加热烈。 Soulja Boy 在 2018 年制作歌曲“Bitcoin”时声称他是第一个制作关于比特币的歌曲的说唱歌手。加密货币市场 Coinbase，在 IPO 后为他带来了一笔财富。最近，Big Sean 吹嘘给你的女孩一个价值 30,000 美元的 Dogecoin 的 Robinhood 投资组合，因为他对 Sada Baby 的“Little While”大加赞赏，因为 Dogecoin 的共同创建者 Jackson Palmer 谴责加密货币是一种右翼、超级——资本主义技术。与此同时，The Cool Kids 的一半说唱歌手 Michael Rocks 创作了一首歌曲，既涉及投资的魅力，也涉及加密货币世界中更黑暗、更堕落的元素。 “每个在音乐中提到加密货币的人——尤其是说唱音乐——总是采取这样的立场，‘是的，我是一个超级天才交易员。我刚刚在比特币上赚了 10 亿美元，伙计，&#39;”Rocks 说。 4 月，作为他的 Mystery School Twitch 直播的一部分，他制作了一首名为“Selling at the Bottom”的歌曲，以分享一种更现实的替代方案，而不是经常在社交媒体和嘻哈中描绘的阳光明媚的景象。在过去的两年里，他估计他已经制作了数百首关于热门话题的模因歌曲，每周推出两首——但“在底部销售”是最广为流传的，原始视频在推特上播放量超过 20 万次. “奇怪的是，当我放弃这些模因歌曲时，它们总是比我放弃一首&#39;真正的歌曲&#39;得到更多的爱、轮换、播放和观看。”Rocks 说。 “这很有趣。但这是有道理的，”他说，因为与他认为更小众的“实际”音乐相比，这个主题吸引了更广泛的观众。 “我只是想站在加密货币的另一面。完蛋了你拿L的。你会被打。你输了。”\nRocks 的视频与其他更明亮的加密货币描述形成鲜明对比，例如最近的 Coin Cloud ATM 广告，其中传奇导演 Spike Lee 将加密货币定位为“旧货币”的“包容性”替代品。作为过去几年对加密货币感兴趣的人，Rocks 想要制作一首歌来更真实地描绘成为加密货币交易者的感受——包括偏执狂、FOMO 和假装精明不知道怎么回事。 “不过，我是个骗子。所以如果你问，我会一起玩。如果我在我的空头交易中搞砸了，我会说我在做多头交易。如果我搞砸了我的多头交易，我会说我在做空，”他说。尽管 Rocks 显然是加密货币领域的狂热者，但他并没有像该领域通常带有的那种玫瑰色眼镜。 “十分之九，人们不赚钱，你做了他妈糟糕的交易，你的头寸被炸毁，埃隆马斯克出现在 SNL 并搞砸了你的整个投资组合。这就是实际加密交易的方式，”Rocks 解释说。他说，在比特币价格暴跌的时候，Rocks 在不到一个小时的时间里就实现了“底部卖出”。现在，这首歌是比特币走势的一种指标——如果你在 Twitter 上看到“在底部卖出”，你可以假设价格目前正在下跌。对于受 SNL 出现影响的货币，这一切都是有道理的。 Rocks 说，几年前，大多数人认为加密货币只是为了“犯罪或黑市狗屎”，如果他们甚至知道它是什么。 2019 年，在“迈巴赫音乐 VI”中，里克·罗斯 (Rick Ross) 暗指数字货币的隐私方面，说：“货币以加密形式出现，你知道他们窃听我们的电话。”尽管他没想到自己的歌曲会引起如此大的反响，但他从其他交易员那里得到了反馈，称他在捕捉支撑加密货币世界的不确定现实方面一针见血。其他人显然很不高兴，告诉他他不知道他在说什么。一些交易员还联系了 Rocks，要求他为他们的特定硬币制作一首歌，但他拒绝了。 “在加密货币领域，很多人都是骗子，或者在大多数情况下是小骗子，人们抽小硬币，只是想脱掉他们的包。”\n过去，一些说唱歌手因宣传非法首次代币发行或 ICO 而引起了美国证券交易委员会的注意。去年，美国证券交易委员会对 TI 处以 75,000 美元的罚款，因为他参与了“欺诈性加密货币计划”。今年，Game 在一项集体诉讼中被点名，该诉讼声称他因参与 2017 年涉及一家现已破产的大麻区块链公司的 ICO 而欺骗投资者。 Rocks 和他的同事 Cool Kid Chuck Inglish 讨论了如果你&#39;从主流说唱歌手那里得到你的线索，你可能会迟到，无论是时尚潮流，还是现在的加密货币投资。 “尤其是嘻哈音乐。它就像一个晴雨表，用于衡量您是否在某事上为时已晚，我们过去常常用时尚、服装和装备来参考它。我们总是将其作为基础，&#39;好吧，如果现在任何 X 通用流行说唱歌手都穿着这件衣服或这条服装系列，那么它就被播放出来了。 Rocks 说，一旦你开始听到“真正普通的说唱歌手”的评论，“就太晚了。” “你应该早点把钱存起来，因为一旦米克米尔开始谈论它，那就是旧消息了。”加密货币的未来仍然不确定。例如，在撰写本文时，Meek Mill 在 5 月份对狗狗币的 50,000 美元投资价值约为 15,709 美元。但是对于一组价格可以通过周六夜现场演出来影响的金融产品，来自 Cool Kids 之一的模因歌曲是告诉你风向的该死的风向标的一部分是有道理的。", "note_en": "Whether you’re bullish on cryptocurrency or think it’s bullshit, you cannot live a day in the world without hearing about the various digital currencies that are popping up on what seems to be a daily basis. Crypto is everywhere, and—if it’s up to Jack Dorsey—it will  create world peace.\n  Rappers, for their part, have been name-dropping cryptocurrencies since at least 2013.  In conversation with   Time, multihyphenate Donald Glover said that bitcoin felt “more real” than currencies backed by gold. In 2017, on “ Down,” G-Eazy rapped that “loyal bitches get crypto” while the less fortunate would simply get Lyft codes. Though in other spaces cryptocurrency is seen as a massive leech on  environmental resources that will primarily  enable the rich to get richer, in hip-hop, the sentiment towards cryptocurrency is often more glowing.\n   Soulja Boy  claims he was the first rapper to make a song about bitcoin when he made the song “ Bitcoin” in 2018. This year, Nas called himself “cryptocurrency Scarface” on DJ Khaled’s “ Sorry Not Sorry,” referencing an early investment in the cryptocurrency marketplace Coinbase, which netted him a fortune after its IPO. More recently, Big Sean bragged about giving your girl a Robinhood portfolio with $30,000 worth of Dogecoin, as he rapped on Sada Baby’s “ Little While,” as the co-creator of Dogecoin, Jackson Palmer, decried cryptocurrency as a  right-wing, hyper-capitalist technology.\n  Meanwhile, Sir Michael Rocks, the rapper and one-half of The Cool Kids, made a song that touches on both of the allure of investing and the darker, more depraved elements of the cryptocurrency world.\n   “Everybody who mentions crypto in music—especially rap music—has always taken the position of, ‘Yeah, I&#39;m a super genius trader. I just made a billion dollars on Bitcoin, man,’” Rocks said. In April, as part of his  Mystery School Twitch stream, he made a song called “Selling at the Bottom” to share a more realistic alternative to the sunny outlook often portrayed on social media and in hip-hop. Over the past two years, he estimates he’s made hundreds of meme-y songs riffing on trending topics, putting out two per week—but “Selling at the Bottom” has been the most widely circulated, with the original video exceeding 200,000 plays on Twitter.\n  “The weird part is when I drop these meme songs, they always get way more love and rotation and plays and views than if I dropped a ‘real song.’” Rocks said. “Which is pretty funny. But it makes sense,” he said, as the subject matter appeals to a broader audience than his “actual” music, which he considers more niche.\n    “I just wanted to take the position of the other side of what crypto&#39;s like. It&#39;s fucked up. You take L&#39;s. You get smacked. You lose.”\n  Rocks’s video is a stark contrast to other, brighter depictions of the cryptocurrency, such as a recent  commercial for Coin Cloud ATMs, in which the legendary director Spike Lee positions cryptocurrency as an “inclusive” alternative to “old money.”\n  As someone who’s taken an interest in cryptocurrency for the past several years, Rocks wanted to make a song to capture a more realistic depiction of what it’s like to be a crypto trader—complete with the paranoia, the FOMO, and feigning savvy when you don’t know what’s going on. “I&#39;m a liar, though. So if you ask, I&#39;ma play along. If I fuck up on my short trade I say I&#39;m trading long. If I fuck up on my long trade, I say I&#39;m trading short,” he raps.\n  Though Rocks is clearly an enthusiast in the cryptocurrency space, he doesn’t have the same rose-colored glasses that typically come with the territory.  “Nine times out of ten, people don&#39;t make any money, you make fucking terrible trades, and you get your position blown out,  Elon Musk comes on   SNL and fucks up your entire portfolio. That&#39;s how actual crypto trading goes,” Rocks explained.\n    Rocks made “Selling at the Bottom” in less than an hour, he said, at a time when Bitcoin prices were crashing. Now, the song is a sort of indicator of Bitcoin movement—if you see “Selling At the Bottom” making the rounds on Twitter, you can assume the price is currently dropping. For currencies that are affected by  SNL appearances, this all makes sense.\n  A couple years ago, Rocks said, most people thought cryptocurrency was just for “crime or black market shit,” if they even knew what it was. In 2019, on “ Maybach Music VI,” Rick Ross alludes to the privacy aspect of digital currency, rapping, “Currency come in crypto, you know they tapin&#39; our calls.”\n  Though he wasn’t expecting such a big response to his song, he’s gotten feedback from other traders that he hit the nail on the head of capturing the uncertain reality that underpins the cryptocurrency world. Others, apparently upset, told him he didn’t know what he was talking about. Some traders have also contacted Rocks to request he make a song for their specific coins, which he declined.\n  “In crypto, a lot of people are shills, or little scammers for the most part, people pumping little shitcoins, just trying to get their bags off.”\n  In the past, some rappers have drawn the attention of the Securities and Exchange Commission for promoting illicit  initial coin offerings, or ICOs. The S.E.C. hit  T.I. with a $75,000 penalty last year for his participation in a “fraudulent cryptocurrency scheme.” This year,  Game was named in a class-action lawsuit that claims he deceived investors for his participation in an ICO involving a  now-bankrupt cannabis blockchain company that took place in 2017.\n    Rocks and his fellow Cool Kid  Chuck Inglish have discussed how if you’re getting your cues from mainstream rappers, you’re likely late to the party, whether it’s fashion trends, or now, cryptocurrency investments.\n  “There&#39;s something in hip-hop especially. It&#39;s like a barometer for if you&#39;re too late on something, and we used to reference it with fashion, clothes, and gear. We always would base it on like, ‘Okay, if whatever X generic popular rapper right now is wearing this article of clothing, or this clothing line, then it&#39;s played out.’\n  Once you start hearing references from “really normal rappers,” Rocks said, “ it&#39;s getting too late.”\n  “You should have had your money in way earlier, because  once Meek Mill starts talking about it, it&#39;s old news.”\n  The future of cryptocurrency still feels uncertain.  Meek Mill’s $50,000 Dogecoin investment in May, for example, is worth approximately $15,709 at the time of writing. But for a set of financial products whose prices can be moved by   Saturday Night Live appearances, it makes sense that a meme song from one of the Cool Kids is part of the fucked-up weathervane that tells you which way the wind is blowing.", "posttime": "2021-07-25 07:14:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "货币,crypto", "title": "看看早在 2013 年就开始的嘻哈文化中加密货币的存在，包括模因歌曲、说唱歌手 Nas 的 Coinbase 投资和非法 ICO", "title_en": "A look at the presence of crypto in hip-hop culture, beginning as early as 2013, including meme songs, rapper Nas's Coinbase investment, and illicit ICOs", "transed": 1, "url": "https://www.vice.com/en/article/4avbvm/theres-a-crypto-bubble-in-hip-hop", "via": "", "real_tags": ["货币", "crypto"]}, {"category": "", "categoryclass": "", "imagename": "73122a39238b504689f53d15d28509ef.jpeg", "infoid": 1069526, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "财政部长珍妮特耶伦警告国会，如果立法者不提高债务上限，她的部门将需要在 8 月 2 日开始采取“非常规措施”。在给加利福尼亚州众议院议长南希佩洛西的一封信中，耶伦提醒立法者，财政部很快将暂停出售州和地方债券。虽然过去曾采取非常措施来防止美国违约，但目前尚不清楚耶伦的紧急资本将持续多久，因为采取了前所未有的刺激措施来对抗 Covid-19。财政部长珍妮特耶伦周五警告国会，如果立法者无法就提高或延长债务上限达成协议，她的部门将需要在 8 月 2 日开始采取“非常措施”，以防止美国政府违约。在给加利福尼亚州众议院议长南希佩洛西的一封信中，耶伦提醒立法者，财政部将在 7 月底暂停出售债券，这是美国为其债务提供融资的途径。 8 月 2 日之后，除非达成债务限额协议，否则财政部将开始采取“非常措施”来支付国会的法律和财务义务，这是一个临时解决方案，允许部长在数周内动用额外的政府账户。 “由于多种因素，特别措施可能持续的时间段存在相当大的不确定性，包括预测美国政府未来几个月的收支情况的挑战，以及相关收支不确定性的加剧加剧大流行的经济影响，”耶伦在一封信中告诉佩洛西。\n如果美国的未偿债务接近法定限额，财政部长和众议院议长之间的信息是必要的手续。尽管过去已经采取了非常措施来防止违约，但在 Covid-19 危机引发的前所未有的刺激措施面前，耶伦的紧急资金将持续多久尚不清楚。虽然美国从未拖欠债务，但最近的历史表明，不舒服地接近它会造成混乱。 2011 年，众议院共和党人拒绝通过提高债务上限，导致美国主权信用评级被下调，这扰乱了金融市场。经济学家表示，违约虽然极不可能，但将是一场灾难性事件，并对美国经济的多个部门构成重大威胁。当被问及耶伦的信时，白宫新闻秘书 Jen Psaki 强调应该根据上下文来看待这封信，并指出前几届政府也曾发出过类似的信件。 Psaki周五下午表示，这封信是“财政部长在重新实施债务限额时的标准做法”。 “在前两届政府期间，财政部长就债务限额向希尔发送了近 50 封信，其中一些在措辞、要求和更新方面与这封信非常相似。”尽管政府很冷静，但几乎可以肯定的是，由于民主党和共和党在几项关键立法上陷入僵局，国会将违反 8 月 2 日的最后期限。也许最值得注意的是，纽约州参议院多数党领袖查克·舒默 (Chuck Schumer) 距离在一项价值数万亿美元的物理基础设施交易上达成妥协还很远。众议院民主党人坚持认为，如果没有以乔·拜登总统的美国家庭计划为蓝本的单独立法，支持带薪休假、劳动教育和其他计划，他们不会通过一项改善国家道路、桥梁、宽带和水路的法案。\n就他而言，参议院少数党领袖米奇麦康奈尔本月早些时候告诉 Punchbowl 新闻，他“无法想象一个共和党人”投票提高债务限额，因为民主党人“对税收和开支。”", "note_en": "Treasury Secretary Janet Yellen warned Congress that her department will need to start &#34;extraordinary measures&#34; on Aug. 2 if lawmakers don&#39;t raise the debt ceiling.\n In a letter to House Speaker Nancy Pelosi, D-Calif., Yellen put lawmakers on notice that the Treasury Department soon suspend the sale of state and local bonds.\n While the extraordinary measures have been used in the past to prevent a U.S. default, it&#39;s unclear how long Yellen&#39;s emergency capital will last given unprecedented stimulus to combat Covid-19.\n Treasury Secretary  Janet Yellen on Friday warned Congress that her department will need to embark on &#34;extraordinary measures&#34; on Aug. 2 to prevent the U.S. government from defaulting if lawmakers are unable to strike a deal to raise or extend the debt ceiling.\n In a letter to House Speaker  Nancy Pelosi, D-Calif., Yellen put lawmakers on notice that the Treasury Department will at the end of July suspend the sale of bonds, the avenue by which the U.S. finances its debt obligations.\n  After Aug. 2 and barring a debt limit agreement, the Treasury will start taking &#34;extraordinary measures&#34; to pay for Congress&#39; legal and financial obligations, a temporary fix that allows the secretary to tap additional government accounts for a period of weeks.\n &#34;The period of time that extraordinary measures may last is subject to considerable uncertainty due to a variety of factors, including the challenges of forecasting the payments and receipts of the U.S. government months into the future, exacerbated by the heightened uncertainty in payments and receipts related to the economic impact of the pandemic,&#34; Yellen told Pelosi in a letter.\n The message between the Treasury secretary and the House speaker is a required formality should the outstanding debt of the U.S. near its statutory limit. While the extraordinary measures have been deployed in the past to prevent a default, it&#39;s unclear how long Yellen&#39;s emergency capital will last in the face of unprecedented stimulus efforts sparked by the  Covid-19 crisis.\n  While the United States has never defaulted on its debt, recent history shows that getting uncomfortably close to it can create chaos. In 2011, House Republicans&#39; refusal to pass a debt ceiling increase led to a downgrade of the U.S. sovereign credit rating that upset financial markets.\n Economists say default, though extremely unlikely,  would be a catastrophic event and would pose a significant threat to several sectors of the American economy.\n  Asked about Yellen&#39;s letter, White House press secretary Jen Psaki stressed that the communication should be taken in context and noted that similar letters have been sent in prior administrations.\n The letter is &#34;standard practice for Treasury secretaries when a debt limit is going to be reimposed,&#34; Psaki said Friday afternoon. &#34;During the previous two administrations, the Treasury secretary sent nearly 50 letters to the Hill on the debt limit, some of which were very similar, in wording and asks and updates, to this letter.&#34;\n Despite the administration&#39;s calm, it is virtually certain Congress will breach that Aug. 2 deadline with Democrats and Republicans gridlocked on several key pieces of legislation. Perhaps most notable is that Senate Majority Leader  Chuck Schumer, D-N.Y., remains far away from compromise over a trillion-dollar physical infrastructure deal.\n House Democrats insist that they won&#39;t pass a bill to improve the nation&#39;s roads, bridges, broadband and waterways without a separate piece of legislation modeled after President Joe Biden&#39;s American Families Plan to support paid worker leave, labor education and other programs.\n For his part, Senate Minority Leader Mitch McConnell, R-Ky., told Punchbowl News earlier this month that he &#34;can&#39;t imagine a single Republican&#34; voting to raise the debt limit amid Democrats&#39; &#34;free-for-all for taxes and spending.&#34;", "posttime": "2021-07-25 07:14:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "伦敦,urges,债务", "title": "耶伦敦促国会在 8 月 2 日前提高或暂停债务上限", "title_en": "Yellen urges Congress to raise or suspend the debt limit by Aug. 2", "transed": 1, "url": "https://www.cnbc.com/2021/07/23/yellen-urges-congress-to-raise-debt-limit-by-aug-2-or-treasury-will-take-extraordinary-measures-to-prevent-default.html", "via": "", "real_tags": ["伦敦", "urges", "债务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069525, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们接受预订，直到 10/15/21。预订完成后，我们将开始生产。预计发货日期仍是待定。运送到 USPS 国际运送服务支持的所有国家（有 COVID-19 限制）。非美国客户负责与此进口相关的任何地方税费或关税。如果我们无法运送到您的国家或由于其他不可预见的原因，我们可能会被迫取消订单，在这种情况下，您的款项将全额退还。我们无法提供退款，但如果您的设备在抵达 60 天内有缺陷，我们将更换您的设备，您将负责退货运费。", "note_en": "We are accepting pre-orders until 10/15/21. After pre-orders are closed we will begin production. Estimated shipping date is still TBD. Shipping to all countries supported by  USPS International Shipping Service (with  COVID-19 restrictions).  Non-US customers are responsible for any local taxes or duties associated with this import. If we are not able to ship to your country or for other reasons unforeseen we may be forced to cancel the order, in such case your money will be returned in full. We cannot provide refunds but we will replace your unit if it is defective upon arrival for up to 60 days,  you will be responsible for return shipping costs.", "posttime": "2021-07-25 07:13:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "midi,运送", "title": "Super MIDI Pak – 将您的 SNES 用作 MIDI 合成器", "title_en": "Super MIDI Pak – Use Your SNES as a MIDI Synthesizer", "transed": 1, "url": "https://www.supermidipak.com/", "via": "", "real_tags": ["midi", "运送"]}, {"category": "", "categoryclass": "", "imagename": "b0767bca52ca00a8aeda4e8148f7abca.png", "infoid": 1069524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时会提出用于去除二氧化碳的区块链或代币，但几乎没有什么优势。我回顾了设计机制的密码经济学原理，以及“矿化”的提议——岩尘与大气中的 CO 2 自然反应将其锁定在矿物质中——用于碳捕获以对抗全球变暖。密码经济学通常依赖于可审计性和挑战来创造所需的行为，而矿化提供了一种客观、可检查的碳信用形式。因此，人们可以建立一个简单的经济游戏，矿工索取进行矿化的代币作为碳抵消出售，挑战者审计他们假设的矿化矿床以寻找欺诈行为；平衡是对矿化量的诚实报告，产生真正的去中心化、可靠、防欺诈的“CO 2 代币”。区块链可以知道 CO 2 吗？ P2P 区块链有时被弃用作为寻找问题的解决方案。他们可以做货币，是的，但他们还能解决什么其他现实问题？他们能做些什么来帮助解决（而不是造成）全球变暖等危机？例如，我们能否创建一个以某种方式激励去除 CO 2 而不是排放 CO 2 的方法？但是区块链如何知道现实世界中发生了什么，比如避免了哪些碳排放，或者已经去除了哪些 CO 2 ？大多数关于“CO 2 硬币”的提议要么出于基本经济原因行不通，要么只不过是采用现有的碳信用/限额和交易计划并在其上贴上“区块链™”（区块链知道什么是可信的第三方告诉它知道，从头到尾）。下面我将描述一个可行但并非毫无意义的 CO 2 硬币如何工作的简单方案，并解释密码经济学原理如何自然地引导您进行这样的设计——“您本可以发明 CO 2 硬币！”密码经济学的原则是： 最小化信任；信任但要验证;分配信任；并激励维护信任。这对应于区块链可以轻松、困难或根本不知道的事情。信任：零/最小/分布式/激励。的目标有时被误解为零信任。如果一切都可以在零信任的情况下完成就好了，但这通常是不可能的。即使去中心化通常也太昂贵而无法实现：每个系统都希望中心化，因为它更有效（去中心化系统所做的任何事情，中心化系统都可以复制，但反之亦然 1），而像比特币或 BitTorrent 这样的系统只是像他们需要的那样去中心化。 （在 P2P 文件共享的情况下，最佳分布水平被证明是“不是非常”，但对于国际货币，它是“非常多”。）区块链交易：零信任。密码原语可以对正确性和知识做出许多“内部”保证。比特币可以在验证复式分类账遵循所有规则的意义上最小化信任（每笔交易总和为零，所有内容都经过加密签名，除非 PoW 等意图，否则货币不会无中生有地创造），方法是将其公开并让节点重新计算历史本身，证明它是正确的。 （有了更先进的零知识证明密码学，区块链甚至不需要存储完整的交易来让节点证明正确性！）因为货币是软件，软件可以“看到”其他软件，密码学也可以保证“以一种加密货币交易另一种加密货币的原子交换；最近，“快速贷款”引起了人们的注意，它们如何通过在单个原子步骤中进行贷款和交易来实现看似不可能的交易杠杆，以确保贷款要么得到偿还，要么永远不会发生。\n区块链：最低限度的信任。验证整个分类帐可能很昂贵，因此“轻”节点可以验证较少的内容，而是通过或使用检查点或信任其他节点；这种信任是有限的，因为他们自己仍然做很多密码学，并且在必要时仍然可以下载和验证完整的区块链。托管/挖矿：分布式信任。比特币通过让用户决定如何托管他们的资金来进一步分配信任：中本聪的目标并不是强迫每个用户成为自己的主权银行，而是允许选择信任哪家银行，包括但不限于他们自己。 2 比特币矿工也是分布式的：没有人可以阻止你挖矿，矿工可以在任何地方设置。但仅仅被分配是不够的，矿工通过他们在 PoW 和比特币上的投资被激励诚实地行事：审查交易、分叉、设置替代品、“脑裂”问题——矿工有很强的动力让一切都保持运转以维持他们出售铸造的硬币所需的汇率。区块链最终比率：激励。最后一个是最终的支持：激励。我们可以建立经济游戏和设计机制，使做正确的事情比做错误的事情更有利可图。差异可能很小，不能给我们密码学所能提供的非凡安全性，但经济游戏可以实现密码学无法做到的现实世界，这就足够了（“比特币越差越好”）。通过放弃一些东西，否则不可能的事情就可以做到。举 3 个可以完成软件可能永远无法完成的事情的激励/游戏的例子：买卖双方都锁定 1 倍的商品价格，而不是 2-of-3 而是 2-of-2 多重签名加密托管.托管要么销毁钱要么把钱寄给卖家；买方仅在货物按描述到达时才同意后者；买方没有作弊动机，卖方也无法通过作弊获利（他将损失定金），因此他将发送货物。一般来说，没有软件可以知道货物是否如买方预期的那样到达，缺少读心软件；但它不需要，只要买方发挥他的作用。不能保证卖家会合作：也许他会为了lulz 扔掉他的钱……？但它通常会起作用。证明的“大幅削减”变体：矿工（质押者）必须建立一个债券，如果出现双花，因为恶作剧，软件可以知道有 2 个相互冲突的交易，并且——而不用关心哪个是正确的现实世界——抓住保证金并向提供 2 个相互矛盾交易的任何人支付赏金，从而激励欺诈检测并强制执行良好行为。 TrueBit 虽然很复杂，但进一步扩展了我们对“存款”可以做什么的想法：TrueBit 试图实现可信赖的任意云计算的购买。\n这怎么可能？区块链不可能重做计算，自己重做计算是没有意义的，高级密码学可能不可用或覆盖有问题的计算；相反，TrueBit 创建了一个“验证游戏”，它首先信任雇佣的云服务来正确地执行购买的计算，让其他人挑战特定的子集（可以很便宜地完成）以换取赏金，但是——以确保会有人们完全具有挑战性——还会定期破坏结果以激励随机抽查。分叉游戏：Augur，一般的加密货币。一类重要的游戏是分叉游戏，它适用于所有加密货币，值得更详细地讨论。工作量证明机制减少了必要的信任，但仍然存在信任——只要用户必须相信他们下载了区块链，而不是因为分叉而对他们不可见，例如互联网审查或抑制替代区块链的 DoS 攻击（“日食攻击”）。没有数学方法可以知道你拥有“那个”区块链，宇宙中任何地方都不存在类似的区块链；这不是像区块链这样的软件可以知道的。 （股权证明也存在类似的问题。）相反，区块链基于建立经济激励的社会过程：比特币用户知道他们拥有“正确”的区块链，因为他们可以验证带外用户相信最新的区块“是什么”，或者他们的交易“出现”在他们想要使用的交易所，并且在罕见的分叉情况下，他们可以权衡哪个区块链看起来更“合法”⁠。比特币的最终基础是全球比特币社区，它通过愿意交换来赋予它价值。如果出现问题，整个社区将决定哪个是正确的。 （一个例子是后以太坊分叉：没有人有权力强迫每个人不使用黑客拥有的“以太坊经典”，而不是反黑客分叉，但大多数人选择了后者。作为 Yogi Berra问，“如果人们不想去参加球赛，你将如何阻止他们？”）因为社区发展缓慢，而且这种共识过程会引发圣战，这对每个参与者来说都非常耗费精力且代价高昂，这是虔诚地希望尽可能少地诉诸这种最终比率——但只要这种自由市场支持存在且可信，就不需要诉诸。 ：预测市场面临着“软件如何知道现实世界中发生的事情？”的同样问题，但可以设置激励机制来诚实报告。 Augur ( ) 将“分叉”构建到核心协议中：如果有足够的资金押在有争议的市场结果上，将 Augur 猫置于 true 和 false 的叠加状态，Augur 整体将明确分叉为两个 Augur，其中争议被分解为结果正确的结果和错误的结果，并且争论者被迫进入他们声称是正确的一种；然后，就像以太坊经典 vs 以太坊（或 Steem），用户将用脚投票决定哪个是他们认为合法、值得信赖的 Augur，哪个将正确解决市场，哪个被邪恶的解析器劫持，哪个是不值得信任的垃圾，可以出售急如星火。 3 如果争议者是欺诈者，他们的版本很快就会在很大程度上或完全毫无价值，就像以太坊经典相对于普通以太坊已经崩溃一样（在我写这篇文章时，49 美元对 2,110 美元）。\n设计方法：密码学→激励。因此，密码学只是加密经济学的开始。在设计一个密码经济系统时，我们可以根据需要回退：做软件可以通过密码学做的一切，以消除任何不必要的信任；然后，如有必要，我们可以围绕我们的信任进行传播，并使任何特定的信任成为可选；如果我们必须信任我们无法从中选择的群体，我们可以设置经济游戏来检测作弊并惩罚它，并奖励正确的行为。通过使用这些设计选项和权衡，我们可以想出各种有趣的新系统和市场，例如用于信息销售的 Darkleaks、代币管理的注册表或仲裁系统（Aragon Court/Kleros）。 “青蛙把饼干放在一个盒子里。 “那里”，他说。 “现在我们不会再吃饼干了。” “但我们可以打开盒子”，蟾蜍说。 “这是真的，”青蛙说。青蛙在盒子周围系了一些绳子。 “那里”，他说。 “现在我们不会再吃饼干了。” “但我们可以剪断绳子，打开盒子。”蟾蜍说。 “这是真的，”青蛙说。青蛙得到了梯子。他把盒子放在一个高架子上。 “那里，”青蛙说。 “现在我们不会再吃饼干了。” “但我们可以爬上梯子，从架子上取下盒子，剪断绳子，打开盒子”，蟾蜍说。 “这是真的，”青蛙说。\n碳信用安全漏洞。碳信用很容易被滥用，并且经常受到欺诈。即使在地面上也很难检查它们。他们真的像他们声称的那样液化并向地下注入了大量的 CO 2 吗？ （你怎么知道他们是否撒谎？）你怎么知道 2 个碳信用不指同一个行动？如果有人声称因不砍伐森林而获得碳信用额，你怎么知道反事实，如果你不向他们支付信用额，他们真的会砍伐森林——或者他们不会在未来砍伐森林？未来，或者他们并没有简单地改变他们打算减少的东西？或者甚至还有一片森林？区块链如何知道CO 2？关于区块链的最基本问题之一是：“区块链如何知道 X？”区块链如何知道你有多少硬币？比特币的汇率是多少？哪个交易是真实的？或者硬币从哪里来？所以对于 CO 2 碳信用区块链：“区块链如何知道有多少碳信用，它们是有效和真实的，以及谁拥有它们或已经使用它们？”作为软件的区块链不了解原子的真实物质世界。那么它怎么知道拥有森林的人应该申请多少碳信用额呢？受信任的第三方会告诉它吗？最简单的方法是让碳信用公司对每个代币进行简单的担保和签字，向买方保证他们已经完成了所有的尽职调查和反欺诈预防。该公司铸造 CO 2 代币，它保证代币都是有效的，并且对应于一吨去除的 CO 2，依此类推。这家公司必须在各方面都受到完全信任。这是 Nori 等实体讨论和实施的常用方案。第三方+区块链=浪费的安全剧院。在这样的方案中，为什么还要麻烦区块链呢？你完全信任它，所以将一些代币放在区块链上并没有什么新鲜事。 （如果你想向第三方证明——比如说，你是一家购买抵消是“绿色”的企业，并想向客户证明你确实购买了你所说的所有信用——他们可以简单地列出一个清单他们像你这样的买家网站。也许疯了，然后签名！）在区块链上记录这样的信用就像在你的门上锁上 5 把锁，而窃贼只会穿过门周围的干墙。区块链是浪费和膨胀。可审计的碳信用额……？我们能做得更好吗？ （再次：“区块链如何知道 CO 2 信用？”）我们需要某种碳信用来抵御这些欺诈问题：理想情况下，它应该（如 PoW 本身）是没有人通常会做的事情，所以没有问题反事实（如果真的发生了，那是因为碳信用）；它应该是不可逆的，所以只需要检查一次，不容易为了盈利而撤销；并且它应该可以由多方以低成本进行验证（排除诸如钻探和密封深井之类的事情，其中​​验证可能比表面上的碳捕获本身花费更多）。比特币的 PoW 本质上满足这些属性——除了 PoW 没有人出于任何其他原因计算双倍，而且它没有其他好处，所消耗的能量无法撤消或恢复，任何人都可以以 ~0 的成本验证哈希。是否有类似性质的碳信用？矿物吸收 CO 2。或“矿化”使用一些矿物，如或（由 Project Vesta 首选）使用 CO 2 与特定常见矿物在矿物内部的自然化学反应；这个过程在数千年中去除了许多千兆吨，但可以通过相当便宜的采矿和研磨加速进入年度吸收。 4（它是否足够便宜？谁知道呢。让我们假设细节会自行解决，矿化将成为碳捕获的一种竞争形式。）不可逆转，可观察，成本高。矿化仅自然发生极其缓慢，不可逆转，不可用于其他目的，难以运输，物理分布且易于审核。自然的缓慢意味着新的矿化确实是新的并且加速了（也许它会在一百万年内发生，但我们不能等那么久！）。反应的放热性质意味着它很便宜，因为它不需要能量输入来为反应提供动力（大多数碳捕获方法的失败），而且逆转它是昂贵的并且没有可想象的理由，所以无论如何，通过捕获碳矿化将保持捕获。缺乏其他用途意味着重复计算是行不通的：没有人可以出于某种不可告人的目的进行矿化，然后通过声称碳信用来进行双重挖掘（这很糟糕，因为如果他们无论如何都这样做，则没有额外的碳捕获是受到激励，而买家被敲诈）。难运输有助于验证，因为不能通过在几个热点附近快速移动来玩检查游戏。物理分布方面可以实现全球进入（虽然橄榄石或玄武岩的矿床可能是集中的，但它们并非只存在于世界上的 1 或 2 个地点）和竞争，分布信任。最后，化学反应的具体不可逆转的客观性质意味着任何特定的橄榄石/玄武岩粉尘样本都可以快速审核，只要走到一个随机的地方，用手舀起来，然后说，&#39;是的，那是半转化的橄榄石粉尘好吧&#39;。\n灰尘容易审核。这些特性意味着，鉴于在区块链上公开发布的矿物粉尘覆盖的土地位置以及保证金，任何第三方审计师都可以随机抽样几个点并验证 X m 3 原始矿物粉尘的存在，从而证明： Y 吨是为了碳捕获而新创建的，它不会反事实地、不可逆地和永久地从大气中去除 Z 吨 CO 2，并且不能通过移动到其他地方来重演（成本太高，灰尘当重新测试为“新”）或重复计算时（因为所有感兴趣的各方都可以使用公共分类账验证与之前或之后位置的非重叠），将不会是原始的考虑到所有这些，我们是否可以建立一个经济游戏，奖励诚实的采矿和矿化创造，同时以不太荒谬的成本检测和惩罚作弊者，从而最大限度地减少对任何实体的总信任和信任？可能是！这是一个设计示例，它最大限度地减少对第三方审核员的罕见调用的信任，仅拥有可以验证橄榄石/玄武岩粉尘存在/不存在的基本矿物分析技能：设置“CO 2 硬币”令牌（例如，您的标准），其中 1 枚硬币 = 1 吨移除的 CO 2。指定了一个“审计员”公钥 K，该公钥是可信的。任何人都可以创建 1 个代币，以换取 x 的股份（保证金或债券）和在某处定义矩形的 4 个坐标。如果坐标集出现在任何先前的标记中，则坐标集无效。令牌已创建，但不能为 y 个块传输。它现在可以作为 1 吨的碳信用额在市场上以某种价格 ≪ x 出售。代币可能会经过几个所有者，但最终会被想要申请抵消的实体“烧毁”（销毁或以其他方式不可转让）（例如，航空公司可能有一个公开的地址，用于购买数十亿吨代币）每年并“销毁”令牌，使客户能够独立检查）。挑战交易包含由审计者密钥 K 签名的消息，以及挑战者 C 的地址/密钥：“坐标不包含 1 吨重的灰尘”。在这样的消息中，x 被“削减”并发送给 C（他可能之前已经向审计员付款），并且令牌被取消。\n对审计员而非买方/卖方/矿工的信任最小化。在此设计中，只要审计员仅在他们不会签署有关特定物理位置不存在灰尘的谎言（以换取可能从削减的赌注中支付的贿赂）时才值得信赖，那么任何声称是创建代币将冒险......", "note_en": "Blockchains or tokens for carbon dioxide removal have sometimes been proposed, but provide little advantage.\n I review the principles of cryptoeconomics for designing mechanisms, and the proposal of “mineralization”—rock dust naturally reacting with atmospheric CO 2 to lock it into minerals—for carbon capture to fight global warming.\n Cryptoeconomics often relies on auditability &amp; challenges to create desired behavior, and mineralization provides an objective, checkable, form of carbon credits. Thus, one can set up a simple economic game where miners claim tokens for doing mineralization to sell as carbon offsets, and challengers audit their supposed mineralization deposits hunting for fraud; the equilibrium is honest reporting of mineralization quantities, yielding a true decentralized, reliable, fraud-resistant “CO 2 Coin”.\n Can a blockchain  know CO 2? P2P blockchains are sometimes deprecated as solutions in search of a problem. They can do currencies, yes, but what other real-world problem can they solve? Can they do anything to help solve (rather than cause) crises like global warming? Could we, for example, create a   which somehow incentivizes  removing CO 2 instead of emitting it? But how does a blockchain  know what happens in the real world, like what carbon emissions have been avoided, or what CO 2 has been removed? Most proposals for a “CO 2 Coin” either wouldn’t work for basic economic reasons, or are little more than taking existing carbon credits / cap-and-trade schemes and slapping “Blockchain™” on it (the blockchain knows whatever  the trusted third party tells it to know, start to finish). Below I describe a simple scheme for how a viable but not pointless CO 2 Coin might work, and explain how cryptoeconomics principles would lead you naturally to such a design—“you could have invented CO 2 Coin!”\n The principles of cryptoeconomics are to:  minimize trust; trust, but  verify;  distribute trust; and  incentivize upholding trust. This corresponds to things that a blockchain can know easily, with difficulty, or not at all.\n Trust: zero / minimal / distributed / incentives. The goal of   is sometimes misunderstood as  zero-trust. It would be nice if everything could be done with zero trust, but that is often impossible. Even decentralization is often too expensive to be feasible: every system  wants to be centralized because it is more efficient (anything a decentralized system does, a centralized system can copy, but not vice-versa  1), and systems like  Bitcoin or BitTorrent are only as decentralized  as they need to be⁠. (In the case of P2P filesharing, that optimal level of distribution turns out to be ‘not very’, but for international currencies, it is ‘very much’.)\n Blockchain transactions: zero trust. Cryptographic primitives can make many ‘internal’ guarantees about correctness and knowledge. Bitcoin can minimize trust in the sense of validating the double-entry ledger follows all the rules (every transaction sums to zero, everything is cryptographically signed, money is not created  ex nihilo except as intended by PoW etc) by making it public and letting nodes recompute the history themselves, proving it is correct. (With much more advanced zero-knowledge-proof cryptography like  , the blockchain doesn’t even need to store full transactions to allow nodes to prove correctness!) Because currencies are software and software can ‘see’ other software, cryptography can also guarantee “atomic swaps” in trading one cryptocurrency for another; more recently, “flash loans” have drawn note for how they enable seemingly-impossible trading leverage trustlessly by doing the loan &amp; trade in a single atomic step, ensuring that the loan either gets paid back or never happens.\n Blockchains: minimal trust. Validating the entire ledger can be expensive, so ‘light’ nodes can verify less of it, and instead trust other nodes via   or using checkpoint or  ; this trust is limited, because they still do much cryptography themselves, and can still download &amp; verify the full blockchain when necessary.\n Custody/ mining: distributed trust.  Bitcoin further distributes trust by letting users decide how to custody their funds: Satoshi did not aim at forcing every user to be their own sovereign bank, but allowing the  choice of which bank to trust, including but not limited to themselves.  2 The  Bitcoin miners are also distributed: no one can stop you from mining, and miners can set up anywhere. But simply being distributed is not enough, and miners are incentivized to act honestly by their investment in PoW &amp;  Bitcoin: censoring transactions, forking, setting up alternatives, “split brain” problems—miners are highly motivated to keep everything humming along to maintain the exchange rate they need to sell their minted coins.\n Blockchain  ultima ratio: incentives. This last is the ultimate backing: incentives. We can set up economic games and design mechanisms to make doing the right thing more profitable than doing the wrong thing. The difference may be small, and cannot give us the extraordinary security that cryptography can, but economic games can achieve real-world things cryptography is unable to, and this is enough ( “Bitcoin is Worse is Better”). By putting up something to lose, otherwise impossible things can be done. To give 3 examples of incentives/ games which can accomplish things software may never can would be:\n The buyer and seller both lock 1× the price of a good inside not a 2-of-3 but a 2-of- 2 multisig cryptographic escrow. The escrow either destroys the money or sends it to the seller; the buyer only agrees to the latter if the good arrives as described; the buyer has no incentive to cheat, and the seller can’t profit by cheating either (he will lose the deposit), so he will send the good.\n In general, no software can ever know that the good arrived as the buyer expected, short of mind-reading software; but it doesn’t need to, as long as the buyer plays his part. There is no guarantee that the seller will cooperate: maybe he’ll throw away his money for the lulz…? But it will usually work.\n “ slashing” variants on  proof  of  : the miners (stakers) must put up a bond, and if a double-spend surfaces, because shenanigans, software can know that there are 2 conflicting transactions, and—without caring  which one is right in the real world—seize the bond and pay a bounty to whomever provided the 2 contradictory transactions, thereby incentivizing fraud detection &amp; enforcing good behavior.\n TrueBit⁠, while complicated, extends our idea of what “deposits” can do even further: TrueBit tries to enable purchasing of trustworthy arbitrary cloud computation.\n How is that possible? Blockchains cannot possibly redo the computations, redoing the computation yourself is pointless, and advanced cryptography like   may not be available or cover the computations in question; TrueBit instead creates a “verification game” where it starts by trusting hired cloud services to do the purchased computations correctly, letting other people challenge specific subsets (which can be done cheaply) in exchange for a bounty, but—to ensure that there will be people challenging at all—also periodically  corrupting the results to incentivize random spot-checks.\n Forking games: Augur, cryptocurrencies in general. An important class of games is forking games, which apply to all cryptocurrencies and is worth discussing in more detail.\n Proof-of-Work mechanism reduces the necessary trust, but there is still trust involved—if only that the user must trust that they downloaded  the blockchain, as opposed to a fork which is invisible to them because of, say, Internet censoring or a DoS attack suppressing an alternate blockchain (an “eclipse attack”). There is no mathematical way to know you have ‘the’ blockchain, and no similar blockchain exists anywhere in the universe; this is not a thing that software like a blockchain can know. (A similar issue holds for proof-of-stake too.)\n Instead, the blockchain is grounded on  social processes which set up economic incentives: a  Bitcoin user knows they have the ‘right’ blockchain because they can verify out-of-band with users they trust what the latest block ‘is’, or that their transactions are ‘showing up’ at the exchange they want to use, and in the rare case of a fork, they can weigh  which blockchain appears more ‘legitimate’⁠. The ultimate grounding of  Bitcoin is in the worldwide  Bitcoin community which gives it value by being willing to exchange for it. If something goes wrong, the community at large decides which is right. (An example of this is the post-  Ethereum fork: no one has the power to coerce everyone to not use “Ethereum Classic” owned by the   hacker, rather than the anti-hacker fork, but most chose the latter fork. As Yogi Berra asked, “If people don’t want to go to the ball game, how are you going to stop them?”) Because communities are slow, and such consensus processes trigger  holy wars which are extremely exhausting and expensive for everyone involved, it is to be devoutly hoped that this  ultima ratio is resorted to as little as possible—but as long as this free-market  backstop exists &amp; is credible, it won’t  need to be resorted to.\n :  Prediction markets suffer the same problem of “how does the software know what wound up happening in the real world?”, but can set up incentives to report honestly.\n Augur ( ) builds ‘forking’ into the core protocol: should enough money be staked on a disputed market outcome, putting the Augur cat into a superposition of true &amp; false, Augur as a whole will explicitly fork into  two Augurs, in which the dispute is collapsed into one where the outcome was true and one where it was false, and the disputers are forced into the one they claim to be right; then, like Ethereum Classic vs Ethereum (or  Steem), users will vote with their feet about which one they regard as the legitimate trustworthy Augur which will resolve markets  correctly and which one has been hijacked by evil resolvers &amp; is untrustworthy garbage to be sold off posthaste.  3\n If the disputers are fraudulent, their version will quickly become largely or entirely worthless, just like Ethereum Classic has collapsed relative to regular Ethereum ($49 vs $2,110 as I write this).\n Design approach: cryptography → incentives. So, cryptography is only the start when it comes to cryptoeconomics. In designing a cryptoeconomic system, we can proceed by falling back as necessary: do everything that software can do by cryptography to eliminate any unnecessary trusting; then if necessary, we can spread around our trust and make any specific trust optional; if we must trust groups which we can’t choose from, we can set up economics games to detect cheating and punish it, and reward correct behavior. By playing with these design options and tradeoffs, we can come up with all sorts of interesting new systems &amp;  markets like  Darkleaks for information sales,  token-curated  registries⁠, or   like arbitration systems ( Aragon Court⁠/  Kleros).\n “Frog put the cookies in a box. “There”, he said. “Now we will not eat any more cookies.”\n “But we can open the box”, said Toad. “That is true”, said Frog.\n Frog tied some string around the box. “There”, he said. “Now we will not eat any more cookies.”\n “But we can cut the string and open the box.” said Toad. “That is true”, said Frog.\n Frog got a ladder. He put the box up on a high shelf. “There”, said Frog. “Now we will not eat any more cookies.”\n “But we can climb the ladder &amp; take the box down from the shelf &amp; cut the string &amp; open the box”, said Toad. “That is true”, said Frog.&#34;\n Carbon credit security flaws. Carbon credits are easily abused, and often subjected to fraud. They can be hard to examine even on the ground. Did they really liquefy and inject as many tons of CO 2 into the ground as they claimed? (How would you know if they lied?) How do you know 2 carbon credits don’t refer to the same action? If someone claims carbon credits from  not cutting down their forest, how do you know the counterfactual, and that they really were going to cut it down if you didn’t pay them for credits—or that they won’t cut it down in the future, or that they didn’t simply switch what they intended to cut down? Or that there is even a forest?\n How does a blockchain know CO 2? One of the most fundamental questions about a blockchain is: “how does the blockchain know about  X?” How does the blockchain know how many coins you have? What the exchange rate of  Bitcoin is? Which transaction is real? Or where a coin came from? So for a CO 2 carbon credit blockchain: “How does the blockchain  know how many carbon credits there are, that they are valid and real, and who owns them or has spent them?” A blockchain, being software, has no knowledge of the real material world of atoms. So how can it know anything about how many carbon credits someone owning a forest should claim?\n A trusted-third-party tells it? The simplest way is to have a carbon credit company simply guarantee and sign off on every token, guaranteeing the buyer that they have done all the diligence and anti-fraud prevention. The company mints CO 2 tokens, it guarantees the tokens are all valid and correspond to a ton of removed CO 2, and so on. This company must be utterly trusted in every respect. This is the usual scheme  discussed and implemented by entities like  Nori⁠.\n Third-Parties+Blockchain = wasteful security theater. In such a scheme, why even bother with a blockchain at all? You trust it utterly, so putting some tokens on a blockchain does nothing new. (If you want to prove to a third party—say, you’re a business buying offsets to be ‘green’ and want to prove to customers you really did buy all the credits you said you did—they can simply put a list on their website of buyers like you. Maybe go nuts, and  -sign it!) Recording such credits on a blockchain is like putting 5 locks on your door when the burglar will  just cut through the dry wall surrounding the door instead. A blockchain is waste &amp; puffery.\n Auditable carbon credits…? Can we do better? (Again: “how does the blockchain  know about CO 2 credits?”) We need some sort of carbon credit which resists these fraud problems: ideally, it should be (like PoW itself) something that nobody does normally, so there are no issues with counterfactuals (if it happens at all, then it happened because of the carbon credit); it should be irreversible, so it needs be checked only once, is not vulnerable to being undone for profit; and it should be verifiable at low cost by many parties (ruling out things like drilling &amp; sealing deep wells where verifying might cost more than the ostensible carbon capture itself does). Bitcoin’s PoW satisfies these properties intrinsically—nobody calculates double-  for any other reason than PoW and it has no other benefits, the energy spent cannot be undone or recovered, and a hash is verifiable at ~0 cost by anyone. Is there any carbon credit with similar properties?\n Minerals absorb CO 2.   or “mineralization” using a few minerals like   or   (prefered by  Project Vesta) uses natural chemical reactions of CO 2 with specific common minerals to   inside the mineral; this process removes many gigatons over millennia, but can be sped up into year-scale absorption by what turns out to be fairly cheap mining &amp; grinding.  4 (Will it be cheap enough? Who knows. Let’s proceed on the assumption that the details will work themselves out and mineralization will be a competitive form of carbon capture.)\n Irreversible, observable, costly. Mineralization happens only extremely slowly naturally, is irreversible, not useful for other purposes, difficult to transport, physically distributed, &amp; easily auditable. The natural slowness means new mineralization is indeed new and sped up (maybe it would’ve happened in a million years, but we can’t wait that long!). The exothermic nature of the reaction means both that it’s cheap because it requires no energy inputs to power the reaction (the downfall of most carbon capture methods) and also that  reversing it is expensive &amp; has no conceivable rationale so no matter what, carbon captured through mineralization will  stay captured. The lack of other uses means that double-counting won’t work: no one can mineralize for some ulterior purpose, and then double-dip by claiming carbon credits (this is bad because if they were doing it anyway, no  additional carbon capture is being incentivized, and buyers are being ripped off). The difficult-transport assists verification because one cannot play games with inspection by rapidly moving around a few hot spots. The physically distributed aspect enables global entry (while deposits of olivine or basalt may be concentrated, it is not as if they exist only in 1 or 2 spots in the world) and competition, distributing trust. And finally, the concrete irreversible objective nature of the chemical reaction means that any specific sample of olivine/ basalt dust can be quickly audited, if only by walking out to a random spot, scooping it up with one’s hands, and going, ‘yep, that’s half-converted olivine dust alright’.\n Dust easily auditable. These properties mean that, given the location of land coated in mineral dust posted publicly on a blockchain along with a security deposit, any third-party auditor can sample a few random spots and verify the presence of  X m 3 of virgin mineral dust, thereby proving that:  Y tons have been newly created for the sole purpose of carbon capture, which would not exist counterfactually, irreversibly &amp; permanently removing  Z tons of CO 2 from the atmosphere, and which cannot be replayed by moving elsewhere (too costly and the dust will not be virgin when re-tested as ‘new’) or double-counted (because all interested parties can verify the non-overlap with previous or later locations using the public ledger).\n With all this in mind, can we set up an economic game which rewards honest mining &amp; creation of mineralization, while detecting &amp; punishing cheaters at not too absurd a cost, which minimizes the total trust and the trust placed in any entity? Maybe! Here is an example of a design which minimizes trust down to rare invocations of a third-party auditor, possessing only basic mineralogical assay skills which can verify the presence/ absence of olivine/ basalt dust:\n set up a “CO 2 Coin” token (eg your standard  ), where 1 coin = 1 ton of removed CO 2. An ‘auditor’ public key  K is specified, which will be trusted.\n Anyone can create 1 token, in exchange for a stake (a security deposit or bond) of  x   and 4   coordinates defining a rectangle somewhere. The set of   coordinates is invalid if they appear in any previous token. The token is created, but cannot be transferred for  y blocks.\n It can now be sold on the market as a carbon credit for 1 ton for some price ≪  x. The token may go through a few owners, but eventually is ‘burned’ (destroyed or otherwise rendered nontransferable) by an entity which wants to claim an offset (eg an airline might have a publicly known address which it uses to buy a gigaton of tokens per year and ‘burn’ the tokens, enabling customers to independently check).\n A challenge transaction contains a message signed by the auditor key  K, and an address/ key for the challenger  C: “the   coordinates did not contain 1 removal-ton’s worth of dust”.\n On such a message, the  x   are ‘slashed’ and sent to  C (who has presumably previously paid the auditor), and the token is canceled.\n Trust minimized to auditor, not buyer/ sellers/ miners. In this design, as long as the  auditor is trustworthy only to the extent that they will not sign lies about dust not being present in a specific physical location (in exchange for bribes presumably paid out of the slashed stakes), then anyone claiming to be creating tokens will risk their \n......", "posttime": "2021-07-25 07:13:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "区块链,区块,decentralized,信任", "title": "CO₂ Coin：去中心化碳捕获区块链（2021）", "title_en": "CO₂ Coin: Decentralized Carbon Capture Blockchains (2021)", "transed": 1, "url": "https://www.gwern.net/CO2-Coin", "via": "", "real_tags": ["区块链", "区块", "信任"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伊莎贝尔·温、史蒂文·格罗斯、查兹·费尔斯通； “不可能”的躯体感觉和感知的（非）理性。开放思想 2021； 5 30-41。 doi: https://doi.org/10.1162/opmi_a_00040 不可能的数字以不可能的方式代表世界。从 MC Escher 的作品到任何流行的感知教科书，这样的经历表明，心理加工的某些原则是如何根深蒂固和不灵活的，以致于产生现实中不可能发生的荒谬甚至不连贯的结果。然而，这种不可能的体验大多仅限于视觉感知；其他感官方式是否有“不可能的数字”？在这里，我们将一个已知的魔术导入实验室，以报告和研究一种不可能的体感体验——一种可以用身体感受的体验。我们表明，即使在可以自由检查物体的全提示条件下，也可以让受试者单独体验单个物体比包含单个物体作为成员的一组物体感觉更重——这是不可能的，而且在现象学上是惊人的重量的经验。此外，我们认为这种现象——尺寸重量错觉的一个特例——反映了一种“反贝叶斯”感知更新，放大了对理性感知和认知模型的挑战。我们头脑中最引人注目和最令人费解的方面之一是它们允许“不可能”的体验：对世界的感知在物理上、几何上，甚至在概念上都是不连贯的。例如，当一个图像仔细地利用阴影和布局模式时，我们可能会将其视为具有三个 90° 角的三角形，或者是一个向各个方向下降的封闭楼梯（图 1），即使这样的对象实际上永远不可能存在.不可能的体验在直觉上是引人注目的，但它们在理论上也很重要：它们超越了普通的视觉错觉（例如，当刺激看起来比实际更大、更快或更暗时），揭示了心理处理的某些原则如何如此根深蒂固和僵化从而产生现实中不可能发生的荒谬甚至自相矛盾的结果。此外，它们以感知者体验本身固有的方式这样做，因此它们也超越了 (a) 潜在感知处理中的不一致（例如，Smeets &amp; Brenner，2008，2019；Sousa 等，2011） (b) 感知与高级知识之间的冲突 (Firestone &amp; Scholl, 2016a)。在许多不可能的人物中，单一的体验以一种不可能的方式代表了世界。尽管它们无处不在和流行，但不可能体验的范围和影响至少在两个重要方面受到限制。首先，虽然在所有感官模式中都发现了更传统的知觉错觉，但不可能的形象主要或仅出现在视觉感知中（试镜中可能有例外；Shepard，1964）；事实上，甚至可能难以理解其他感官不可能的体验（例如，不可能的味觉或嗅觉）。其次，所有已知的不可能人物都需要不自然或贫乏的观看条件，例如在二维表面上绘制的刺激，或精确排列的 3D 场景的意外视图（Deregowski，1969；Macpherson，2010；Penrose &amp; Penrose，1958）。事实上，这些因素可能削弱了这些现象的科学价值，将它们视为生态上无效的技巧，而不是理解心灵的理论上重要的数据。与这些经典示例相比，这里我们报告了一种不可能的感知体验，可以通过身体感受（而不是看到或听到），使用感知者可以自由检查的普通现实世界对象（而不是限制性的呈现条件）。我们认为不可能体验的空间比人们想象的要大，延伸到另一种感官模式。重要的是，我们进一步表明，目前的现象不仅仅是一种现象学的好奇心，而是通过放大对贝叶斯感知和认知模型的突出挑战，与关于头脑中“理性”处理的讨论相互作用。最后，我们将这种现象与研究趋势联系起来，专业魔术师已知的原则可以为心理调查提供信息（Ekroll 等，2017；Rensink &amp; Kuhn，2015）。我们在这里的工作利用了百年大小重量错觉的逻辑（Charpentier，1891）。在这种错觉的经典化身中，对象被展示了两个大小不同但重量相同的物体；令人惊讶的是，同时举起两个物体的受试者发现较小的物体比较大的物体感觉更重。尽管这种错觉背后的认知机制仍然令人惊讶地难以确定，但它发生的条件已被广泛编目，包括即使在仅使用触觉感知物体大小的盲人或蒙眼对象中也会出现错觉的变体（Ellis &amp; Lederman , 1993) 甚至回声定位 (Buckingham et al., 2015)。在这些和许多其他情况下，较小的物体比同等重量的较大物体感觉更重（有关评论，请参阅 Buckingham，2014 年）。由经典大小重量错觉引发的体验当然很奇怪（甚至不可能），但并非完全“不可能”；毕竟，较小的物体可能（并且通常是）由比较大物体密度更大的材料制成。但是，是否有办法以真正产生不可能的——甚至概念上不连贯的——感知的方式来修改这种错觉？事实上，一种鲜为人知的“酒吧把戏”错觉变体可能就是这样做的。该变体不是将一个对象与不相关的对象进行比较，而是要求受试者将一个对象与包括第一个对象作为成员的一组对象进行比较。想法是，在这些情况下，受试者可能会认为单独的单个物体比包括单个物体的一组更重。当然，一组物体的重量永远不会小于该组中的一个成员；因此，如果这确实是受试者所经历的，他们将有一种不可能的重量体验。 1\n据我们所知，后一种现象，如果发生的话，在科学文献中从未有过报道。 2 , 3 因此，我们 (a) 在这里介绍它，(b) 运行几个新的实验来探索它（并控制从未被讨论或测试过的替代解释），以及 (c) 表明它对理性模型提出了独特的挑战感知和认知，由于在生产过程中似乎发生了更新链。我们在一般性讨论中扩展了最后一种可能性，因为只有在描述了实验之后，这一挑战的性质才最清楚。支持本文中实验的所有原始数据都可以在材料档案中找到（参见 https://osf.io/g7kb8）。我们报告了我们如何确定我们的样本量、所有数据排除、所有操作以及研究中的所有度量。从约翰霍普金斯大学 (JHU) 社区招募了 30 名受试者。考虑到该效果对本文的每位作者来说主观上是多么明显，我们选择这个样本量是因为如果超过三分之二的受试者经历过这种错觉，它会产生统计上可靠的效果。这里的所有其他实验都使用这个样本量。受试者看到堆叠在一起的三个外观相同的不透明盒子，我们在这里将它们称为盒子 A、B 和 C。所有三个盒子都是 6.7 厘米 × 8.7 厘米 × 1.6 厘米，用蓝色 ABS 塑料 3D 打印。我们的材料档案中提供了创建这些盒子的说明。 4 受试者不知道的是，盒子 A（位于堆叠的顶部）装满了锌（250 克），而盒子 B 和 C 是空的（仅重 30 克；图 2）。受试者进行了两次举重，一个接一个。在一种情况下，他们一起举起了箱子 A、B 和 C；在另一个案例中，他们独自举起了 Box A。在实验 1 中，受试者以任何感觉自然的姿势简单地用手抓起箱子；后来的实验改变了这种抓握姿势。在两次提升之后（在受试者之间平衡的顺序），受试者被问到哪个提升感觉更重（或者，对于一半的受试者，哪个提升感觉更轻），并且实验者记录受试者的反应。绝大多数受试者报告说，单独的方框 A 感觉比方框 A、B 和 C 更重（90% 的受试者报告 A &gt; ABC，二项式概率检验，p &lt; .001；图 3）。 5 然而，这个结果应该是“不可能的”，因为一组对象的权重总和永远不会小于这些对象的一个​​子集的权重总和：除非盒子在电梯之间以某种方式发生变化，否则框 A 不能称重超过包括 Box A 作为成员的一组加权对象。\n事实上，这种体验是如此惊人，以至于受试者经常自发地、震惊地评论说这是不可能的，甚至在会议结束后要求再次提起物体。有趣的是，这些受试者报告说，即使在这些重复的提升过程中，这种错觉仍然存在，包括当受试者将所有三个盒子放在他们的手掌上，然后突然取下两个较轻的盒子时——将这种现象提炼成一个不可能的“时刻”，其中移除重量会引起这种感觉的增加重量。因此，这些结果通过实验证实了随意提起箱子时主观上显而易见的事情：在这些条件下，单独一个箱子比包含单个箱子作为成员的一组箱子重的感觉是不可能的。将这种效果解释为不可能体验的一个重要假设是，它不受受试者执行两次举重的方式差异的驱动。 （这对于解释大小重量错觉的其他实例也很重要。）例如，实验 1 中的受试者在举起所有三个箱子 (ABC) 和只举起一个 (A) 时不可避免地使用不同的抓握姿势，因为ABC 电梯需要在他们的手中容纳三倍的材料，因此需要更宽的抓握、更伸展的手指以及其他此类调整。这种差异能否解释感知重量的差异？实验 2 通过在盒子上附加类似手柄的“标签”排除了这种可能性，这样每次提升都是通过用手指捏住一个标签来执行的。如果这种影响在这些情况下持续存在，则不太可能用抓握姿势的差异来解释，因为两次举重都假定了相同的姿势。实验 2 与实验 1 相同，除非在此注明。三十个新科目参加。这一次，在箱子上系了两圈透明的钓鱼线——一圈环绕所有三个箱子（箱子 ABC），一圈只环绕较重的箱子（箱子 A），每个末端都以一个小“标签”固定电工胶带。受试者执行与实验 1 相同的提举，但在这里他们只是捏住拇指和食指之间的标签——并且在两次提举中以相同的方式这样做。与实验 1 一样，受试者报告说 A 感觉比 ABC 重（80%，p = .002；图 3），即使在整个升降机的抓握姿势相同时也是如此。这表明手形或手指伸展（等）的差异无法解释一个物体感觉比包含它作为成员的一组物体更重的不可能体验。尽管在自然抓握条件和等式抓握姿势条件下会出现这种现象，但在前两个实验中，进一步的可能性是，受试者对 ABC 举起的举力大于 A 举，这可能是因为他们预计 ABC 比举起重A. 在那种情况下，如果受试者在 ABC 上使用的力比在 A 上使用的力大得多，则 ABC 可能看起来比 A 轻（尽管参见 Flanagan &amp; Beltzner，2000）。这能解释目前观察到的结果吗？一方面，我们在实验 1 中注意到，受试者观察到（轶事）多次举重尝试后幻觉仍然存在；在这种情况下，受试者应该对箱子有正确的期望，这反过来应该使他们在重复提升时不会严重错误地校准他们的提升力。此外，已知经典的大小重量错觉不依赖于提升力的差异，即使在某些情况下确实观察到了这种差异（Buckingham，2014）。\n另一方面，即使在这样的条件下，内隐的或自动的期望也可能导致受试者在一种情况下比在另一种情况下施加更大的力量。因此，实验 3 甚至排除了这种可能性，根本不需要任何“抬起”，而是让受试者在双手放在桌子上时被动地感受盒子的重量。实验 3 与实验 1 相同，除非在此注明。三十个新科目参加。这一次，受试者没有抓住盒子，而是将手掌放在平坦的桌子上；然后，实验者自己将盒子（ABC 或 A，按平衡顺序）放在受试者被动张开的手掌上。这种方法不仅以另一种方式控制抓握姿势（因为受试者的手在两次抬起时都处于相同的姿势），而且还控制提升力，因为受试者施加的任何力都很小或不存在。在实验 1 中，受试者报告说 A 比 ABC 重（90%，p &lt; .001；图 3），即使他们根本没有“提起”箱子，只是感觉到他们被动张开的手掌受到压力。这表明抓握姿势和提升力的差异都不能解释一个物体比包含它的一组物体感觉更重的不可能体验。在三个实验中，受试者单独感知单个物体比包含该物体的一组物体重。我们将这种体验解释为对视觉感知中出现的“不可能的数字”的体感模拟。重要的是，目前的现象超出了已知的体感幻觉或不寻常的身体体验。例如，在“亚里士多德的幻觉”中，用交叉的食指和中指触摸一个人的鼻子会产生有两个鼻子的奇怪感觉（Hayward，2008；Lackner，1988）。类似地，刺激二头肌肌腱可以让人感觉好像自己的手臂在伸展（Goodwin et al., 1972）——以至于在足够的刺激后，一个人的手臂必须伸展到暗示在肌肉上休息一下。弯头。 6 然而，诸如此类的触觉错觉（另见 Guterstam 等人，2011 年；Guterstam 等人，2018 年）虽然引人注目且不寻常，但可以说缺乏当前现象真正“不可能”的特征（并且往往只涉及奇怪的身体感觉，而不是与其他物体的相互作用）。换句话说，长出一个新鼻子或将手臂伸过断点当然是生物学上难以置信的经历。但目前的现象不仅仅是奇怪或不寻常——它在物理上甚至概念上都是不连贯的。我们在这里强调的正是这种不连贯性，因为在我们看来，正是这种不连贯性使这种现象成为图 1 中不可能的视觉图形的体感模拟。正如这些图像显示出一种全局不连贯性（即使图像的许多区域是局部连贯），目前的经验具有相似的特征。虽然目前的现象确实依赖于时间上的延伸（电梯一个接一个地发生，但不是同时发生），但即使是不可能的视觉形象，也可以说是这种情况，很难一下子全部吸收。例如，在“不可能的楼梯”（图 1，中间）中，人们可能会发现自己的注意力在楼梯周围掠过，直到注意到局部转换加起来是一个不可能的全局图形。此外，鉴于目前的现象有可能明显减轻堆栈的重量（通过去除 B 和 C），但仍会导致重量增加，因此很可能将目前的现象提炼成一个不可能的“瞬间”，也许因此是一次不可能的体验。 7 进一步注意，尺寸重量错觉会扩展到本案并非已成定局。例如，另一种可能性是，体感处理可以访问持有对象中的部分/整体关系（类似于视觉感知中基于部分的分解；Hoffman &amp; Richards，1984；Lowet 等，2018；Singh 等al., 1999)，并且重量感知会尊重这种部分-整体关系的各种物理约束。没有发生这种情况的事实可能表明，触觉处理不会像视觉处理那样将对象分割成多个部分（或者至少可能不会将物理约束合并到它执行的任何基于部分的分割中，或者不能向前推进甚至在极短的时间范围内使用此类信息等）。\n除了增加不可能的知觉体验清单之外，我们的思想在当前情况下产生这种不可能或不连贯的结果这一事实可能至少以两种方式与经典和当代关于心理处理“合理性”的讨论相互作用。首先，经典的大小重量错觉——较小的物体感觉比同等重量的较大物体更重——有时被描述为违反贝叶斯推理规范（Brayanov &amp; Smith, 2010; Buckingham &amp; Goodale, 2013）。通常，大脑对不确定数据的解释被其先验所吸引，这与广泛的贝叶斯建议一致。例如，如果遇到一个物体，它的圆形视网膜图像与它是 (a) 球体或 (b) 一个细长的椭球体以恰到好处的角度观看以向观察者投射一个圆，通常会将该物体体验为一个球体——可以说是因为这种体验反映了视觉系统对哪些形状和视图最有可能的先验假设。换句话说，数据中的歧义被解决“有利于”人们在遇到这些数据之前的假设。相比之下，大小重量错觉似乎涉及对此类先验的排斥：人们期望较大的物体比较小的物体重，然后人们会收到模棱两可的或模棱两可的感官证据，表明哪个真正更重（因为它们确实重量相同）；但后来人们不知何故感觉较大的物体比同等重量的较小物体轻。换句话说，大脑似乎解决了“反对”大即重先验的模糊感官证据，而不是倾向于它——这是感知和认知实施或近似贝叶斯推理的明显反例。在我们看来，目前的结果进一步放大了这一挑战，并使这种更新模式的“非理性”更加明显。显然，尺寸权重错觉中的反规范偏见是如此强大，以至于它不仅可以产生不可能的结果（如经典的尺寸权重错觉，以及有时被描述为反贝叶斯的其他现象；魏和Stocker，2015 年；另见 Rahnev &amp; Denison，2018 年），但也有不可能的结果，其概率应该为零，因此对于理性的更新者来说应该是不可接受的——因为没有更新链应该以 A 比 ABC 重而结束（另见 Mandelbaum， 2019 年；曼德尔鲍姆等人，2020 年）。事实上，受试者在经历这种现象时所表达的惊讶——无论是在我们的研究中，还是在 Koseleff (1937) 中，受试者将他们的经历描述为“无逻辑的”——似乎与其他关于这种错觉的理性保留解释相反。例如，一个类......", "note_en": "Isabel Won, Steven Gross, Chaz Firestone; “Impossible” Somatosensation and the (Ir)rationality of Perception.   Open Mind 2021; 5 30–41. doi:  https://doi.org/10.1162/opmi_a_00040\n  Impossible figures represent the world in ways it cannot be. From the work of M. C. Escher to any popular perception textbook, such experiences show how some principles of mental processing can be so entrenched and inflexible as to produce absurd and even incoherent outcomes that could not occur in reality. However, impossible experiences of this sort are mostly limited to visual perception; are there “impossible figures” for other sensory modalities? Here, we import a known magic trick into the laboratory to report and investigate an impossible experience for somatosensation—one that can be physically felt. We show that, even under full-cue conditions with objects that can be freely inspected, subjects can be made to experience a single object alone as feeling heavier than a group of objects that includes the single object as a member—an impossible and phenomenologically striking experience of weight. Moreover, we suggest that this phenomenon—a special case of the size-weight illusion—reflects a kind of “anti-Bayesian” perceptual updating that amplifies a challenge to rational models of perception and cognition.\n    One of the most striking and puzzling aspects of our minds is that they permit “impossible” experiences: perceptions of the world that are physically, geometrically, or even conceptually incoherent. For example, when an image carefully exploits patterns of shading and layout, we may see it as a triangle with three 90° angles, or as a closed staircase that descends in every direction ( Figure 1), even though such objects could never actually exist. Impossible experiences are intuitively compelling, but they are also theoretically significant: They go beyond ordinary visual illusions (e.g., when stimuli appear larger, faster, or darker than they really are) in revealing how some principles of mental processing can be so entrenched and inflexible as to produce absurd and even self-contradictory outcomes that could not occur in reality. Moreover, they do so in a way that is intrinsic to the perceiver’s experience itself, such that they also go beyond (a) inconsistencies in the underlying perceptual processing (e.g., Smeets &amp; Brenner,  2008,  2019; Sousa et al.,  2011) and (b) conflicts between perception and higher level knowledge (Firestone &amp; Scholl,  2016a). In many impossible figures, a single experience represents the world in a way it cannot be.\n    Despite their ubiquity and popularity, the scope and impact of impossible experiences have been limited in at least two important ways. First, whereas more conventional perceptual illusions are found in all sensory modalities, impossible figures arise mostly or only within visual perception (with perhaps an exception in audition; Shepard,  1964); indeed, it may be difficult to even fathom impossible experiences for other senses (e.g., an impossible taste or smell). Second, all known impossible figures require unnatural or impoverished viewing conditions, such as stimuli drawn on two-dimensional surfaces, or accidental views of precisely arranged 3D scenes (Deregowski,  1969; Macpherson,  2010; Penrose &amp; Penrose,  1958). Indeed, these factors may have diminished the perceived scientific value of such phenomena, casting them as ecologically invalid tricks rather than theoretically significant data for understanding the mind.\n    In contrast to these classical examples, here we report an impossible perceptual experience that can be  physically felt (rather than seen or heard), using ordinary real-world objects that perceivers can freely inspect (rather than restrictive presentation conditions). We suggest that the space of impossible experiences is larger than has been appreciated, extending into another sensory modality. Importantly, we further suggest that the present phenomenon is not just a phenomenological curiosity, but rather that it interacts with discussions about “rational” processing in the mind by amplifying a prominent challenge to Bayesian models of perception and cognition. Finally, we connect this phenomenon to a research trend where principles known to professional magicians can inform psychological investigation (Ekroll et al.,  2017; Rensink &amp; Kuhn,  2015).\n    Our work here exploits the logic of the century-old size-weight illusion (Charpentier,  1891). In the classical incarnation of this illusion, subjects are shown two objects whose sizes differ but whose weights are identical; surprisingly, subjects who lift both objects find that the smaller object feels heavier than the larger object. Though the cognitive mechanisms underlying this illusion have remained surprisingly difficult to pin down, the conditions under which it occurs are extensively catalogued, including variants of the illusion arising even in blind or blindfolded subjects who sense the objects’ sizes using only touch (Ellis &amp; Lederman,  1993) or even echolocation (Buckingham et al.,  2015). In these and many other cases, a smaller object feels heavier than an equally weighted larger object (for a review, see Buckingham,  2014).\n  The experience elicited by the classical size-weight illusion is certainly odd (and even improbable), but it is not quite “impossible”; after all, the smaller object could be (and usually is) made of a denser material than the larger object. But might there be a way to modify this illusion in ways that truly do produce an impossible—and even conceptually incoherent—percept? Indeed, a lesser-known “bar trick” variant of the illusion might do just that. Instead of comparing one object to an unrelated object, this variant asks subjects to compare one object to a  group of objects that includes the first object as a member. The thought is that, under these circumstances, subjects might perceive the single object alone as heavier than a group including the single object. Of course, a group of objects could never weigh less than a member of that group; and so if this is indeed what subjects experience, they will have had an impossible experience of weight.   1\n  To our knowledge, this latter phenomenon, if it occurs at all, has never been reported in the scientific literature.   2 ,   3 We thus (a) introduce it here, (b) run several new experiments exploring it (and controlling for alternative explanations that have never been discussed or tested), and (c) suggest that it poses a unique challenge to rational models of perception and cognition, due to the chain of updating that seems to occur in producing it. We expand on this final possibility in the  General Discussion, since the nature of this challenge is clearest only after the experiments are described.\n        All of the raw data supporting the experiments in this article are available in a Materials Archive (see  https://osf.io/g7kb8). We report how we determined our sample size, all data exclusions, all manipulations, and all measures in the study.\n    Thirty subjects were recruited from the Johns Hopkins University (JHU) community. Given how subjectively apparent the effect was to each author of this article, we chose this sample size because it would produce a statistically reliable effect if more than two-thirds of subjects experienced the illusion. All other experiments here used this sample size.\n    Subjects saw three identical-looking opaque boxes in a stack, which we refer to here as Boxes A, B, and C. All three boxes were 6.7 cm × 8.7 cm × 1.6 cm, 3D-printed in blue ABS plastic. Instructions for creating these boxes are available in our materials archive.   4 Unbeknownst to subjects, Box A (located on top of the stack) was filled with zinc (250 g), while Boxes B and C were empty (weighing only 30 g;  Figure 2).\n    Subjects performed two lifts, one immediately after the other. In one case, they lifted Boxes A, B, and C together; in another case, they lifted Box A alone. Here in Experiment 1, subjects lifted the boxes simply by grasping them with their hands, in whatever posture felt natural; later experiments varied this grasp posture.\n  After the two lifts (order counterbalanced across subjects), subjects were asked which lift felt heavier (or, for half of subjects, which lift felt lighter), and the experimenter recorded the subject’s response.\n    Subjects overwhelmingly reported that Box A alone felt heavier than Boxes A, B, and C together (90% of subjects reporting A &gt; ABC, binomial probability test,  p &lt; .001;  Figure 3).   5 However, this result should be “impossible,” because the sum of weights over a set of objects could never be  less than the sum of weights over a subset of those objects: Unless the boxes somehow changed between lifts, Box A couldn’t weigh more than a group of weighted objects that  includes Box A as a member.\n    Indeed, the experience was so striking that subjects often spontaneously and astoundedly commented on its impossibility, and even requested to lift the objects again after the session was over. Anecdotally, those subjects reported that the illusion persisted even during these repeated lifts, including when subjects placed all three boxes on their palm and then suddenly removed the two lighter boxes—distilling the phenomenon into a single impossible “moment” wherein  removing weight caused the sensation of  adding weight.\n  These results thus confirmed experimentally what is also just subjectively apparent upon casually lifting the boxes: Under these conditions, a single box alone feels impossibly heavier than a group of boxes that includes the single box as a member.\n    An important assumption for interpreting this effect as an impossible experience is that it not be driven by differences in how subjects perform the two lifts. (This is also important for interpreting other instances of the size-weight illusion.) For example, subjects in Experiment 1 inevitably used a different grasp posture when lifting all three boxes (ABC) vs. when lifting just one (A), since the ABC lift required fitting three times as much material in their hands, and so required a wider grasp, more extended fingers, and other such adjustments. Could this sort of difference explain the difference in perceived weight? Experiment 2 ruled out this possibility by attaching handle-like “tabs” to the boxes, such that each lift was performed by pinching a single tab between one’s fingers. If the effect persists under these circumstances, then it is unlikely to be explained by differences in grasp posture, since the same posture was assumed for both lifts.\n    Experiment 2 was identical to Experiment 1 except as noted here. Thirty new subjects participated. This time, two loops of clear fishing line were attached to the boxes—one loop around all three boxes (Boxes ABC), and one loop around just the heavier box (Box A), with each ending in a small “tab” secured with electrical tape. Subjects performed the same lifts as in Experiment 1, but here they simply pinched the tabs between their thumb and index fingers—and did so in the same way across the two lifts.\n    As in Experiment 1, subjects reported that A felt heavier than ABC (80%,  p = .002;  Figure 3), even when equating grasp posture across the lifts. This suggests that differences in hand shape or finger extension (etc.) could not explain the impossible experience of one object feeling heavier than a group that includes it as a member.\n    Despite the phenomenon appearing under naturalistic grasping conditions and under conditions of equated grasp posture, a further possibility in the previous two experiments is that subjects exerted a greater lifting force for the ABC lift than the A lift, perhaps because they expected ABC to be heavier than A. In that case, ABC might have seemed lighter than A if subjects used much more force on ABC than on A (though see Flanagan &amp; Beltzner,  2000). Could this explain the results observed so far?\n  On one hand, we noted in Experiment 1 that subjects observed (anecdotally) that the illusion persisted after multiple lifting attempts; in that case, subjects should have then had the correct expectations about the boxes, which in turn should have caused them not to badly miscalibrate their lifting forces on repeated lifts. Moreover, the classical size-weight illusion is known not to depend on differences in lifting force, even if such differences are indeed observed in some cases (Buckingham,  2014).\n  On the other hand, even under such conditions, implicit or automatic expectations might have caused subjects to exert a greater force in one case than in another. Experiment 3 thus ruled out even this possibility, by not requiring any “lifting” at all but rather asking subjects to passively feel the weight of the boxes while their hands rested on a table.\n    Experiment 3 was identical to Experiment 1 except as noted here. Thirty new subjects participated. This time, rather than grasp the boxes, the subjects placed their hands palm up on a flat table; then, the experimenter herself placed the boxes (either ABC, or A, in a counterbalanced order) onto subjects’ passively open palms. This method not only controlled for grasp posture in yet another way (since the subjects’ hands were in the same posture for both lifts), but also for lifting force, since any force exerted by subjects was small or nonexistent.\n    As in Experiment 1, subjects reported that A was heavier than ABC (90%,  p &lt; .001;  Figure 3), even when they didn’t “lift” the boxes at all but simply felt their pressure against their passively open palms. This suggests that neither differences in grasp posture nor in lifting force explain the impossible experience of one object feeling heavier than a group that includes it.\n    In three experiments, subjects perceived a single object alone as heavier than a group containing that object. We interpret this experience as a somatosensory analog to “impossible figures“ that arise in visual perception.\n    Importantly, the present phenomenon goes beyond known somatosensory illusions or unusual bodily experiences. For example, in “Aristotle’s Illusion,” touching one’s nose with crossed index and middle fingers produces the bizarre feeling of having two noses (Hayward,  2008; Lackner,  1988). Similarly, stimulation of the biceps tendon can make one feel as though one’s arm is extending (Goodwin et al.,  1972)—so much so that, after enough stimulation, one’s arm would have to be so extended as to imply a break at the elbow.   6 However, haptic illusions such as these (see also Guterstam et al.,  2011; Guterstam et al.,  2018), while striking and unusual, arguably lack the genuinely “impossible” character of the present phenomenon (and tend to involve only strange bodily sensations rather than interactions with other objects). In other words, sprouting a new nose or extending one’s arm past its breaking point are certainly biologically implausible experiences; but the present phenomenon is not merely strange or unusual—it is physically or even conceptually  incoherent.\n  It is this incoherence that we emphasize here, since in our view it is what makes this phenomenon a somatosensory analog to the impossible visual figures in  Figure 1. Just as those images show a kind of global incoherence (even though many regions of the images are locally coherent), the present experience has a similar character. And although the present phenomenon does rely on being temporally extended (with the lifts occurring one after another but not literally at the same time), this is arguably the case even for impossible visual figures, which are difficult to take in all at once. For example, in the “impossible staircase” ( Figure 1, center), one may find one’s attention flitting around the staircase until one notices that the local transitions add up to an impossible global figure. Moreover, given that it is possible in the present phenomenon to visibly reduce the weight of the stack (by removing B and C) and yet cause a perceived  increase in weight, it may well be that the present phenomenon can be distilled into a single impossible “moment,” and perhaps thus a single impossible experience.   7\n  Note further that it was not a foregone conclusion that the size-weight illusion would extend to the present case. An alternative possibility, for example, was that somatosensory processing would have access to part/whole relations in held objects (in ways analogous to part-based decomposition in visual perception; Hoffman &amp; Richards,  1984; Lowet et al.,  2018; Singh et al.,  1999), and that heaviness perception would respect various physical constraints on such part-whole relations. The fact that this did not occur may suggest that haptic processing does not segment objects into parts in the same way as visual processing does (or at least may not incorporate physical constraints into whatever part-based segmentation it does carry out, or cannot carry forward such information for use even across extremely short time-scales, etc.).\n    Beyond adding to the inventory of impossible perceptual experiences, the fact that our minds generate such an impossible or incoherent outcome in the present case may interact with classical and contemporary discussions about the “rationality” of mental processing, in at least two ways.\n    First, the classical size-weight illusion—where smaller objects feel heavier than equally-weighted larger objects—has sometimes been described as defying Bayesian norms of inference (Brayanov &amp; Smith,  2010; Buckingham &amp; Goodale,  2013). Typically, the mind’s interpretation of uncertain data is  attracted toward its priors, in line with a broadly Bayesian recommendation. For example, if one encounters an object whose circular retinal image is equally consistent with it being (a) a sphere or (b) an elongated ellipsoid viewed at just the right angle to project a circle to the viewer, one typically experiences that object as a sphere—arguably because this experience reflects the visual system’s prior assumptions about which shapes and views are most likely. In other words, ambiguity in the data is resolved “in favor” of the assumptions one had prior to encountering those data. By contrast, the size-weight illusion instead seems to involve  repulsion from such priors: One comes in expecting the larger object to be heavier than the smaller object, and then one receives equivocal or ambiguous sensory evidence about which is truly heavier (since they really weigh the same); but then one somehow experiences the larger object as  lighter than the equally weighted smaller object. In other words, the mind seems to resolve the ambiguous sensory evidence “against” the larger-is-heavier prior, rather than toward it—an apparent counterexample to notions that perception and cognition implement or approximate Bayesian inference.\n  The present results, it seems to us, amplify this challenge further, and make the “irrationality” of this pattern of updating all the more stark. Evidently, the norm-defying bias in the size-weight illusion is so powerful that it can generate not only improbable outcomes (as in the classical size-weight illusion, as well as in other phenomena sometimes described as as anti-Bayesian; Wei &amp; Stocker,  2015; see also Rahnev &amp; Denison,  2018) but also impossible outcomes whose probability should be zero and that should therefore be unacceptable to a rational updater—since no chain of updating should end with A being heavier than ABC (see also Mandelbaum,  2019; Mandelbaum et al.,  2020).\n  Indeed, the astonishment that subjects express upon experiencing this phenomenon—both here in our study, as well as in Koseleff ( 1937), where subjects described their experience as “ unlogisch”—seems to tell against other rationality-preserving accounts of this illusion. For example, one classi\n......", "posttime": "2021-07-25 07:13:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "体感,somatosensation,可能", "title": "“不可能”的体感和知觉的（Ir）理性", "title_en": "“Impossible” Somatosensation and the (Ir)Rationality of Perception", "transed": 1, "url": "https://direct.mit.edu/opmi/article/doi/10.1162/opmi_a_00040/102173/Impossible-Somatosensation-and-the-Ir-rationality", "via": "", "real_tags": ["体感", "可能"]}, {"category": "", "categoryclass": "", "imagename": "f23c756916c3fd3b8078814fb3271e6e.jpg", "infoid": 1069522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 https://playwt.link/JoinLinusTechTips 免费加入我们的 War Thunder 使用我们的链接获得独家奖励 - 感谢您支持该频道！Windows 11 ...", "note_en": "Join us in War Thunder for FREE at https://playwt.link/JoinLinusTechTips Get an exclusive bonus using our link - thanks for supporting the channel!Windows 11...", "posttime": "2021-07-25 07:12:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,windows,安装,joinlinustechtips", "title": "如何安装 Linux 而不是 Windows 11", "title_en": "How to install Linux instead of Windows 11", "transed": 1, "url": "https://www.youtube.com/watch?v=_Ua-d9OeUOg", "via": "", "real_tags": ["linux", "windows", "安装"]}, {"category": "", "categoryclass": "", "imagename": "ce65c382b5edeba4dde3fd0ffcd76cfe.jpg", "infoid": 1069520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国司法部今天宣布，三人被指控串谋向伊朗出口美国商品，违反《国际紧急经济权力法》（IEEPA）和《伊朗交易和制裁条例》（ITSR），以及串谋向伊朗出口美国商品。从美国走私货物，并阴谋从事国际洗钱活动。 “被告欺骗美国公司，非法获得敏感的美国物品，并违反美国法律将这些物品通过阿联酋转运到伊朗，”负责国家安全的助理检察长约翰·C·德默斯 (John C. Demers) 说。 “此类行动削弱了对伊朗制裁的有效性。司法部致力于大力执行美国的制裁，并成功打击伊朗政权破坏稳定的活动。” “自 1979 年以来，为了保护美国人民的自由和安全，美国将向伊朗出口货物定为非法，”密歇根州东区的美国检察官马修施奈德说。 “本案中令人深感不安的指控是，被告密谋将高度复杂的美国制造设备和其他美国制造的物品出口到伊朗人的怀抱中。在我们为被告伸张正义时，我们将遵循此案的每一个线索，我们将继续帮助美国企业保护自己免受此类犯罪计划的侵害。” “国土安全调查局 (HSI) 使用出口管制法规来确保在美国开发的敏感技术不会落入那些打算伤害美国人或我们的盟友的人之手，”负责美国事务的特工万斯 R. 卡伦德 (Vance R. Callender) 说。密歇根州和俄亥俄州移民和海关执法局的国土安全调查 (HSI)。 “40 多年来，伊朗一直受到国际制裁，并且一直在偷偷摸摸地试图获得可用于对付冲突中的美国士兵或海外美国人的物品。 HSI 特工与私营行业合作伙伴和商务部合作，确保我们国家的国家安全形象。” “这份起诉书表明，出口执法办公室继续致力于执行我们国家的出口管制法律，”出口执法办公室 (OEE) 芝加哥外地办事处的负责人 Dan Clutch 说。 “我们将继续与我们的执法伙伴合作，打击威胁美国国家安全利益的伊朗非法采购网络。” Arash Yousefi Jam，又名 Arash Yousefijam，32 岁，伊朗国民，居住在加拿大安大略省。 Arash Jam于2020年12月23日被美国当局逮捕； Amin Yousefi Jam，又名 Amin Yousefijam，33 岁，伊朗国民，居住在加拿大安大略省；和\nAbdollah Momeni Roustani，也被称为 Abdollah Momeni、Ab Momeni 和 Amir Amiri，44 岁，据信居住在伊朗的伊朗国民。根据起诉书，2015 年 1 月至 2017 年 2 月期间，Arash Jam、Amin Jam 和 Abdollah Momeni 据称相互串谋，在美国获得货物并将其出口到伊朗。具体而言，被告被指控共谋欺诈和故意出口并违反经济制裁从美国向伊朗出口和发送 9 块放电板、1 块 CPU 板、2 台伺服电机和 2 根铁路曲轴。起诉书进一步称，作为阴谋的一部分，被告及其同谋计划并在美国境外——在伊朗和加拿大等地——在美国境内购买商品并运往伊朗。此外，起诉书称，被告使用第三方安排货物的付款和运输。进一步指控被告通过提供虚假和误导性信息，故意向位于美国的公司隐瞒最终用途的真实性质和商品最终用户的真实身份。最后，起诉书称，被告违反美国法律，在未获得必要许可的情况下，将货物从美国通过阿拉伯联合酋长国出口到位于伊朗的个人和实体。如果罪名成立，被告将面临最高 5 年联邦监禁和 250,000 美元的出口和走私违规罚款，以及 20 年的联邦监禁和 500,000 美元的洗钱违规罚款。此案正由恒生指数特工和商务部出口执法办公室调查。此案由密歇根州东区的助理美国检察官 Hank Moon 和国家安全部反情报和出口管制科的出庭律师 Adam Barry 起诉。司法部国际事务办公室提供了宝贵的协助。起诉书只是一项指控，而不是有罪的证据。被告被推定无罪，政府有责任在排除合理怀疑的情况下证明有罪。", "note_en": "The Justice Department announced today that three individuals have been charged in an indictment with conspiracy to export U.S. goods to Iran in violation of the International Emergency Economic Powers Act (IEEPA) and the Iranian Transactions and Sanctions Regulations (ITSR), as well as conspiracy to smuggle goods from the United States, and conspiracy to engage in international money laundering.\n “The defendants deceived U.S. companies, illegally obtained sensitive U.S. items, and transshipped those items through the UAE to Iran in violation of U.S. law,” said Assistant Attorney General for National Security John C. Demers.  “Such actions dilute the effectiveness of sanctions against Iran.  The Justice Department is committed to vigorously enforcing U.S. sanctions and to successfully countering the Iranian regime’s destabilizing activity.”\n “Since 1979, in order to protect the freedom and security of the American people, the United States has made it illegal to export goods to Iran,” said U.S. Attorney Matthew Schneider for the Eastern District of Michigan.  “The deeply disturbing allegations in this case are that the defendants conspired to export highly sophisticated American manufacturing equipment and other American-made items into the arms of the Iranians.  We will follow every single lead in this case as we pursue justice against the defendants, and we will continue to help American businesses protect themselves from criminal schemes like this.”\n “Homeland Security Investigations (HSI) uses export control statutes to ensure sensitive technologies developed in the United States do not fall into the hands of those that intend to harm Americans or our allies,” said Vance R. Callender, Special Agent in Charge of U.S. Immigration and Customs Enforcement&#39;s Homeland Security Investigations (HSI) in Michigan and Ohio.  “Iran has been subject to international sanctions for more than 40 years and has continuously and furtively tried to obtain items that could be used against U.S. soldiers in conflict or Americans abroad.  HSI special agents work in cooperation with private industry partners and the Department of Commerce to ensure our country’s national security profile.”\n “This indictment demonstrates the Office of Export Enforcement’s continued commitment to enforcing our nation’s export control laws,” said Special Agent in Charge Dan Clutch of the Office of Export Enforcement (OEE) Chicago Field Office.  “We will continue to work with our law enforcement partners to counter Iran’s illicit procurement networks that threaten U.S. national security interests.”\n  Arash Yousefi Jam, also known as Arash Yousefijam, 32, an Iranian national living in Ontario, Canada.  Arash Jam was arrested by U.S. authorities on December 23, 2020;\n  Amin Yousefi Jam, also known as Amin Yousefijam, 33, an Iranian national living in Ontario, Canada; and\n  Abdollah Momeni Roustani, also known as Abdollah Momeni, Ab Momeni, and Amir Amiri, 44, an Iranian national believed to be living in Iran.\n According to the indictment, between January 2015 and February of 2017, Arash Jam, Amin Jam, and Abdollah Momeni allegedly conspired with each other and others to obtain goods in the United States and export them to Iran.  Specifically, the defendants are alleged to have conspired to fraudulently and knowingly export and send nine electrical discharge boards, one CPU board, two servo motors, and two railroad crankshafts from the United States to Iran in violation of economic sanctions.\n The indictment further alleges that as part of the conspiracy, the defendants and their coconspirators planned and acted outside of the United States — in Iran and Canada, among other places — to purchase goods inside the United States to send to Iran.  In addition, the indictment alleges that the defendants used third parties to arrange for payment and transportation of the goods.  It is further alleged that the defendants intentionally concealed from companies located in the United States the true nature of the ultimate end use and true identities of the ultimate end users of the goods by providing false and misleading information.  Finally, the indictment alleges that the defendants caused the goods to be exported from the United States to individuals and entities located in Iran through the United Arab Emirates, without obtaining the necessary licenses, in violation of U.S. law.\n If convicted, the defendants face a statutory maximum penalty of five years in federal prison and a $250,000 fine on the export and smuggling violations, and 20 years in federal prison and a $500,000 fine on the money laundering violation.\n This case is being investigated by special agents of HSI and the Commerce Department, Office of Export Enforcement.  This case is being prosecuted by Assistant U.S. Attorney Hank Moon from the Eastern District of Michigan and Trial Attorney Adam Barry from the Counterintelligence and Export Control Section of the National Security Division.  The Justice Department’s Office of International Affairs provided valuable assistance.\n An indictment is only a charge and is not evidence of guilt.  The defendants are presumed innocent, and the burden is on the government to prove guilt beyond a reasonable doubt.", "posttime": "2021-07-25 07:08:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "产品,sentence,美国", "title": "从 eBay 购买伊朗朋友的 CPU 板和伺服产品，被判 5 年徒刑", "title_en": "5 years sentence for buying an Iranian friend CPU board& servo stuff from eBay", "transed": 1, "url": "https://www.justice.gov/opa/pr/three-charged-illegally-exporting-goods-iran", "via": "", "real_tags": ["产品", "sentence", "美国"]}, {"category": "", "categoryclass": "", "imagename": "3994d4af718cce9403d4bb5bbd0cbbf3.jpg", "infoid": 1069519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020 年 4 月的一个晚上，马克·赫林在田纳西州贝斯佩奇的家中，当时警察蜂拥而至。有英国口音的人曾致电萨姆纳县的紧急服务部门，并报告说在赫林先生的住所向一名妇女的后脑勺开枪。根据联邦法庭记录，来电者曾威胁说，如果警察来了，他会在前后门引爆管炸弹。当警察到达时，他们拔出枪，告诉 60 岁的计算机程序员和六岁的祖父赫林先生出来，让他的手露出来。当他走出去时，他失去了平衡，摔倒了。当天晚上，他在附近的一家医院被宣布死亡。根据法庭记录，死因是心脏病发作。据联邦检察官称，来电者是住在英国的未成年人。但检察官说，来电者知道赫林先生的地址，因为田纳西州劳德代尔县 20 岁的肖恩·桑德曼 (Shane Sonderman) 在网上发布了这些信息。周三，桑德曼先生在承认一项串谋罪后被判处五年徒刑。 “被告是一系列事件的一部分，”联邦检察官在法庭文件中说。检察官说，警察“准备好迎接生死攸关的局面”。 “先生。鲱鱼在枪口下死于心脏病。”\n桑德曼先生的律师布赖恩·R·霍夫曼（Bryan R. Huffman）说，他曾主张减刑，但认为五年“鉴于谢恩的罪责是公平的”。 “先生。桑德曼在多个场合表达了他的悔意。他对赫林先生的死表示遗憾，”霍夫曼先生周六在一封电子邮件中说。 “先生。桑德曼的家人也表达了他们的悔意。肖恩的行为影响了很多家庭，包括他自己的家人。”据他的家人和检察官说，赫林先生成为攻击目标是因为他拒绝出售他的推特账号@Tennessee。他的家人说，赫林先生聪明、直率、直言不讳，从十几岁起就喜欢电脑，并于 2007 年 3 月加入 Twitter，距离 Twitter 开始还不到一年。他 37 岁的女儿科琳娜·菲奇 (Corinna Fitch) 在接受采访时说，他知道人们想要他的把手，他之所以选择把手，是因为他热爱这个他出生和长大的州，并拒绝了 3,000 至 4,000 美元的出售要约。 “他会一笑置之，然后说，&#39;我不卖那个，&#39;”她说。赫林先生最后一次与他的三个女儿及其家人在一起是在他去世前一个月，在他的前妻弗兰赫林主持的周日晚宴上，赫林先生一直是赫林先生的朋友。\n赫林女士在照顾孙子孙女的时候，赫林先生经常过来帮他们洗澡，哄他们睡觉。 “孩子们叫他 Graggie，”因为他们不能说“granddaddy”，Fitch 女士说。检察官说，海林先生是桑德曼先生和“同谋”的至少六人之一，他们创建了虚假的在线账户，以寻找名字朗朗上口的社交媒体用户。然后，桑德曼先生和他的同谋会联系这些名字的持有人，要求他们放弃这些名字，以便他们可以出售它们。如果他们拒绝，“桑德曼和他的同谋将在骚扰活动中反复打电话和发短信轰炸业主，”检察官说。根据法庭文件，他们会在此人家中送餐或报告家中发生火灾。根据法庭文件，桑德曼先生或他的一名同谋在 2020 年 3 月写道：“我将需要 Instagram 帐户……否则我将继续殴打和骚扰您和您的家人。” 2020 年 4 月 27 日，桑德曼先生在短信和聊天应用 Discord 上发布了赫林先生及其家人的姓名和地址。那天晚上，英国的一名未成年人在赫林先生的住所打了一个电话，谎称发生了一起谋杀案。 （在一份声明中，Discord 表示，该公司“对我们服务中的非法活动采取零容忍态度，包括此类涉及拍打的案件，并已投入专门资源来打击这些形式的滥用行为。”）\n据他的家人说，当警方对虚假报告作出回应时，他们命令赫林先生翻过他家周围的高大牛门。 Herring 先生的女婿 Greg Hooge 说，他提出打开大门，但他们拒绝让他这样做，可能是因为他们担心炸弹会爆炸。 Hooge 先生说，由于太大而无法爬过去，Herring 先生费力地将他的大身子挤在栅栏下，栅栏有一个高出地面约一英尺的开口。霍格先生说，他站起来后不久就倒下了。赫林先生的亲属说，他们曾要求提供警方报告的副本以及当局在 4 月 27 日晚上拍摄的任何随身摄像机镜头。他们说这些要求都被拒绝了。在一份声明中，田纳西州西区代理美国检察官小约瑟夫 C 墨菲表示，他的办公室将继续调查拍打事件。 “我们的办公室将‘拍打’视为严重的犯罪行为，”墨菲先生说。 “它不必要地和危险地占用了急救人员的资源，并扰乱了受害者和其他人的生活。”联邦检察官在法庭记录中说，在他于 3 月 22 日认罪后，桑德曼先生继续“与其他人合谋在网上骚扰人们，以控制他们的社交媒体句柄”。他们没有提供更多细节，并拒绝透露英国的未成年人是否可以被引渡到田纳西州面临指控。在一份量刑备忘录中，霍夫曼先生说，桑德曼先生在被捕前没有犯罪史，但来自不稳定的环境，并且有一个“有严重精神疾病史”的家庭。\n霍夫曼先生写道，桑德曼先生也与精神疾病作斗争，他的父亲在桑德曼先生 18 岁两周后自杀了。他将桑德曼描述为一个年轻人，“不幸的是，由于年轻和缺乏经验，他发现自己处于自己造成的境地”。自从 Herring 先生去世后，其他被殴打的受害者纷纷联系 Herring 先生的家人，描述他们是如何受到类似骚扰的。赫林先生的亲属说，他们希望制定更严厉的法律来禁止打人，并希望对警察机构进行更多关于如何识别潜在假电话的培训。 “这将再次发生，”赫林先生 34 岁的女儿凯西门罗说，“这是不可避免的。”赫林女士说，她希望这场悲剧能够迫使父母更加密切地监控孩子在网上的行为。 “你真的，真的不知道他们在做什么，”她说。 “你认为你有，但你没有。”", "note_en": "Mark Herring was at home in Bethpage, Tenn., one night in April 2020 when the police swarmed his house.\n Someone with a British accent had called emergency services in Sumner County and reported having shot a woman in the back of the head at Mr. Herring’s address. The caller had threatened to set off pipe bombs at the front and back doors if officers came, according to federal court records.\n When the police arrived, they drew their guns and told Mr. Herring, a 60-year-old computer programmer and grandfather of six, to come out and keep his hands visible.\n As he walked out, he lost his balance and fell. He was pronounced dead that same night at a nearby hospital. The cause of death was a heart attack, according to court records.\n The caller was a minor living in the United Kingdom, according to federal prosecutors. But the caller knew Mr. Herring’s address because Shane Sonderman, 20, of Lauderdale County, Tenn., had posted the information online, prosecutors said.\n On Wednesday, Mr. Sonderman was sentenced to five years in prison after he pleaded guilty to one count of conspiracy.\n “The defendant was part of a chain of events,” federal prosecutors said in court documents. The police “arrived prepared to take on a life and death situation,” prosecutors said. “Mr. Herring died of a heart attack at gunpoint.”\n  Mr. Sonderman’s lawyer, Bryan R. Huffman, said he had argued for a lesser sentence but believed five years “was fair in light of Shane’s culpability.”\n “Mr. Sonderman has expressed his remorse on multiple occasions. He has expressed his regret regarding Mr. Herring’s death,” Mr. Huffman said in an email on Saturday. “Mr. Sonderman’s family had also expressed their remorse. There are many families affected by Shane’s actions, including his own family.”\n Mr. Herring was targeted because he refused to sell his Twitter handle, @Tennessee, according to his family and prosecutors.\n Smart, blunt and plain-spoken, Mr. Herring had loved computers since he was a teenager and joined Twitter in March 2007, less than a year after it started, his family said.\n He knew people wanted his handle, which he chose because of his love for the state, where he had been born and raised, and had rebuffed offers of $3,000 to $4,000 to sell it, his daughter Corinna Fitch, 37, said in an interview.\n “He would laugh it off and say, ‘I’m not selling that,’” she said.\n The last time Mr. Herring was with his three daughters and their families was a month before his death, at a Sunday dinner hosted by his ex-wife, Fran Herring, who had remained friends with Mr. Herring.\n Mr. Herring often came over when Ms. Herring was taking care of the grandchildren and would help bathe them and put them to bed.\n “The kids called him Graggie,” because they could not say “granddaddy,” Ms. Fitch said.\n Mr. Herring was among at least half a dozen people who were targeted by Mr. Sonderman and “co-conspirators,” who created fake online accounts to find social media users with catchy names, prosecutors said. Mr. Sonderman and his co-conspirators would then contact the holders of those names and ask them to give them up so they could sell them.\n If they refused, “Sonderman and his co-conspirators would bombard the owner with repeated phone calls and text messages in a campaign of harassment,” prosecutors said.\n They’d have food delivered at the person’s house or report fires at their homes, according to court documents.\n “Gonna need the instagram account … or i will continue to swat and harass you and your family,” Mr. Sonderman or one of his co-conspirators wrote in March 2020, according to court documents.\n On April 27, 2020, Mr. Sonderman posted the names and addresses of Mr. Herring and his family members on  Discord, a texting and talking app. That night, a minor in the United Kingdom made a call falsely reporting a murder at Mr. Herring’s address. (In a statement, Discord said the company has “zero-tolerance for illegal activity on our service, including cases like this that involve swatting, and have invested in dedicated resources to combat these forms of abuse.”)\n When the police responded to the false report, they ordered Mr. Herring to climb over the tall cattle gate around his property, according to his family. He offered to open the gate door, but they refused to let him do so, likely because they feared a bomb would go off, said Mr. Herring’s son-in-law Greg Hooge.\n Too big to climb over, Mr. Herring struggled to squeeze his large frame under the fence, which had an opening of about one foot above the ground, Mr. Hooge said.\n He collapsed soon after he stood back up, Mr. Hooge said. Mr. Herring’s relatives said they had asked for copies of police reports and any body camera footage taken by the authorities on the night of April 27. They said those requests had been denied.\n In a statement, Joseph C. Murphy Jr., acting United States Attorney for the Western District of Tennessee, said his office would continue to investigate swatting episodes.\n “Our office views ‘swatting’ as serious criminal conduct,” Mr. Murphy said. “It needlessly and dangerously ties up first responder resources and disrupts the lives of the victims and others.”\n After he pleaded guilty on March 22, Mr. Sonderman continued to “conspire with others to harass people online in order to obtain control of their social media handles,” federal prosecutors said in court records. They did not provide more details and declined to say whether the minor in the United Kingdom could be extradited to face charges in Tennessee.\n In a sentencing memorandum, Mr. Huffman said Mr. Sonderman had no criminal history before his arrest but came from an unstable environment and has a family with a “history of severe mental illness.’’\n Mr. Sonderman also struggled with mental illness, and his father killed himself two weeks after Mr. Sonderman turned 18, Mr. Huffman wrote.\n He described Mr. Sonderman as a young man who “unfortunately finds himself in a situation of his own making through youth and inexperience.”\n Since Mr. Herring’s death, other victims of swatting have reached out to Mr. Herring’s family to describe how they have been similarly harassed. Mr. Herring’s relatives said they wanted tougher laws against swatting and more training for police agencies on how to recognize potential fake calls.\n “This is going to happen again,” said Mr. Herring’s daughter Casey Monroe, 34. “It’s inevitable.”\n Ms. Herring said she hoped the tragedy would force parents to monitor more closely what their children do online.\n “You really, really don’t know what they’re doing,” she said. “You think you do, but you don’t.”", "posttime": "2021-07-25 07:07:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "员工,employee,先生", "title": "Twitter员工和祖父在被“拍打”后死亡", "title_en": "Twitter employee and grandfater died after getting “swatted”", "transed": 1, "url": "https://www.nytimes.com/2021/07/24/us/mark-herring-swatting-tennessee.html", "via": "", "real_tags": ["员工", "employee", "先生"]}, {"category": "", "categoryclass": "", "imagename": "8bd7641f25f7f07b690d924af98563d9.jpeg", "infoid": 1069518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Form Energy 是亿万富翁支持的初创公司，声称已开发出一种创新的低成本 150 小时电池，经过一年多的高调保密，终于公开了其电池化学成分。这家总部位于波士顿的公司表示，其第一个商业产品是“可充电铁空气电池，能够以与传统发电厂相比具有竞争力的系统成本和不到锂离子电池成本的 1/10 提供 100 小时的电力”。一种能够长期储存能量的廉价、安全的电池是可再生能源领域的圣杯，因为它能够以低成本解决风能和太阳能的可变性问题。法国财务顾问 Lazard 在其行业标准年度报告中将大型锂离子电池的平均存储成本 (LCOS) 定为 132-245 美元/兆瓦时，Form 的电池——以该成本的十分之一——将是最便宜的某种距离可用的能量存储类型。 Form Energy 表示：“这种电池可以连续使用多天，并将全年实现可靠、安全和完全可再生的电网。”或者正如钢铁巨头安赛乐米塔尔（Form Energy 的最新投资者）的全球研发主管 Greg Lydkovsky 所说，该技术“具有克服可再生能源间歇性供应的令人兴奋的潜力”。 Form Energy 总裁兼首席运营官 Ted Wiley 说：“我们已经完成了科学，剩下要做的就是从实验室规模的原型扩大到电网规模的发电厂。\n“[满负荷生产]，这些模块的发电成本仅为当今任何电网存储技术成本的十分之一。”据说电池通过“铁的可逆氧化”工作。在放电模式下，数以千计的细小铁球暴露在空气中，使它们生锈（即铁变成氧化铁）。当系统通电时，铁锈中的氧气被去除，并恢复为铁。 Wiley 表示，位于明尼苏达州的 Great River Energy 的 300MW“试点”项目将于 2023 年投产。该项目于去年 5 月宣布，最初是一个 1MW/150MWh 示范工厂，能够连续 150 小时输出 1MW .空气电池是一项相当新的发明，至少在过去十年中一直是研究的主题。加拿大初创公司 Zinc8 于 2019 年率先推出商业产品，宣布将部署具有提供 100 多个小时存储技术能力的锌空气电池系统。总部位于俄勒冈州的 ESS 声称市值为 11 亿美元，已经销售了一种以铁为主要成分的液流电池。\nESS 和 Form Energy 都由 Breakthrough Energy Ventures 部分拥有，这家风险投资公司得到了比尔盖茨和杰夫贝索斯等几位知名亿万富翁的支持。目前 Form Energy 的投资者还包括意大利石油巨头埃尼和麦格理资本，而安赛乐米塔尔周四披露了对该公司的 2500 万美元投资。电子邮件 Form Energy 是亿万富翁支持的初创公司，声称已开发出一种创新的低成本 150 小时电池，经过一年多的高调保密后，终于公开了其电池化学成分。这家总部位于波士顿的公司表示第一个商业产品是“可充电铁空气电池...... https://www.rechargenews.com/energy-transition/worlds-cheapest-energy-storage-will-be-an-iron-air-battery-says-jeff -bezos-backed-start-up/2-1-1044174", "note_en": "Form Energy, the billionaire-backed start-up that claimed to have developed an innovative low-cost 150-hour battery, has finally revealed its battery chemistry after more than a year of high-profile secrecy.\n  The Boston-based company says its first commercial product is a “rechargeable iron-air battery capable of delivering electricity for 100 hours at system costs competitive with conventional power plants and at less than 1/10th the cost of lithium-ion”.\n        A cheap, safe battery able to store energy for long periods of time is the holy grail of the renewable energy sector, as it would be capable of removing the issue of wind and solar’s variability at a low cost.\n  With French financial advisers Lazard putting the levelised cost of storage (LCOS) of large-scale lithium-ion batteries at $132-245/MWh in its industry-standard annual report, Form’s battery — at a tenth of that cost — would be the cheapest type of energy storage available by some distance.\n  “This battery can be used continuously over a multi-day period and will enable a reliable, secure, and fully renewable electric grid year-round,” said Form Energy.\n  Or as Greg Lydkovsky, global head of R&amp;D at steel giant ArcelorMittal — Form Energy’s latest investor — put it, the technology “holds exciting potential to overcome the intermittent supply of renewable energy”.\n  Form Energy president and chief operating officer Ted Wiley said: “We’ve completed the science, what’s left to do is scale up from lab-scale prototypes to grid-scale power plants.\n  “[At full production], the modules will produce electricity for one-tenth the cost of any technology available today for grid storage.”\n  The battery is said to work through “reversible oxidation of iron”. In discharge mode, thousands of tiny iron pellets are exposed to the air, which makes them rust (ie, the iron turning to iron oxide). When the system is charged with an electric current, the oxygen in the rust is removed, and it reverts back to iron.\n  Wiley said that a 300MW “pilot” project for Minnesota-based Great River Energy will be commissioned in 2023.\n  That project, announced in May last year, was originally due to be a 1MW/150MWh demonstration plant capable of outputting 1MW for 150 hours straight.\n     The air battery is a fairly recent invention that has been the subject of research for at least the past decade.\n  Canadian start-up Zinc8, was the first to break cover with a commercial product in 2019, announcing that it would be deploying a zinc-air battery system with the technological capability of providing 100-plus hours of storage.\n  And Oregon-based ESS, which claims to have a market value of $1.1bn, already sells a flow battery that uses iron as its primary ingredient.\n  Both ESS and Form Energy are part-owned by Breakthrough Energy Ventures, the venture capital company backed by  several high-profile billionaires, including Bill Gates and Jeff Bezos.\n  Current Form Energy investors also include Italian oil giant Eni and Macquarie Capital, while ArcelorMittal revealed a $25m investment in the company on Thursday.\n    Share:     Email   Form Energy, the billionaire-backed start-up that claimed to have developed aninnovative low-cost 150-hour battery, has finally revealed its battery chemistryafter more than a year of high-profile secrecy.The Boston-based company says its first commercial product is a “rechargeableiron-air bat...\n   https://www.rechargenews.com/energy-transition/worlds-cheapest-energy-storage-will-be-an-iron-air-battery-says-jeff-bezos-backed-start-up/2-1-1044174", "posttime": "2021-07-25 06:30:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "空气,energy,电池", "title": "最便宜的储能可能是新的铁空气电池", "title_en": "Cheapest Energy Storage Could Be New Iron-Air Battery", "transed": 1, "url": "https://www.rechargenews.com/energy-transition/worlds-cheapest-energy-storage-will-be-an-iron-air-battery-says-jeff-bezos-backed-start-up/2-1-1044174", "via": "", "real_tags": ["空气", "energy", "电池"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器将很快重定向到您请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2021-07-25 06:30:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,出厂,echo,请求", "title": "恢复出厂设置后 Amazon Echo Dot 不会擦除个人内容", "title_en": "Amazon Echo Dot Does Not Wipe Personal Content After Factory Reset", "transed": 1, "url": "https://www.cpomagazine.com/data-privacy/is-it-possible-to-make-iot-devices-private-amazon-echo-dot-does-not-wipe-personal-content-after-factory-reset/", "via": "", "real_tags": ["amazon", "出厂", "echo", "请求"]}, {"category": "", "categoryclass": "", "imagename": "18c7347cef9fc1f40595d8cd84b9ad28.jpeg", "infoid": 1069516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我的一位同事去了佛罗里达州。他去看望了家人，这是他期待已久的一次探访，此前他在大流行期间只去过一次，从纽约一路开车过来，“在垃圾箱后面撒尿”。现在每个人都接种了疫苗，飞到那里让每个人都聚集在一起，不戴口罩似乎是完全合理的。这是一种解脱和喜悦。他们甚至和数千人一起在室内观看曲棍球比赛。当我的同事回到家时，他开始觉得自己感冒了。他并没有多想——直到他接到他在佛罗里达州的一位家人打来的电话，他的 COVID-19 检测呈阳性。最终，那次旅行中聚集在一起的所有成年人都生病了，包括我同事的岳母和岳父。我同事的妻子也检测呈阳性；他没有，但考虑到他的症状，包括嗅觉丧失，这似乎是一个可能的 COVID 病例。当我和我的同事谈论这件事时，他仍在仔细筛选他的感受。一方面，他忘记了生病是多么痛苦，而他的病例——医学定义的“轻微病例”——让他昏倒了大约一天半。他、他的妻子和他的岳父仍然有一个挥之不去的咳嗽，他担心长期影响，特别是因为他的岳父正在接受严重健康问题的治疗。大多数情况下，他感到沮丧。他是一名记者——他非常关注新闻。他知道突破性的案例是可能的，但他已经看到很多保证，它们非常罕见而且没什么大不了的。 “我觉得我掌握的信息非常不准确，”他告诉我，“如果我知道我现在所知道的，我会以完全不同的方式做出决定。”例如，他会在曲棍球比赛中戴上口罩——尽管曲棍球比赛中没有人戴口罩，而且疾病控制与预防中心表示，接种疫苗的人在室内不戴口罩是可以的。他承认有可能他和他的家人真的很不走运——也许一年后，只要每个人都完全康复，他就能回顾这一切并说：“好吧，疫苗仍然完成了他们的工作。”但现在，他感到担忧——担心突破性病例比我们想象的更普遍，接种疫苗的人会比他们想象的更严重，对 delta 变体的担忧并没有被夸大，而且情况可能还会变得更糟。大多数情况下，他担心接种疫苗的人并不像我们许多人认为的那样清楚。他并不孤单。我们谈话的那天，道琼斯指数经历了数月以来最糟糕的一天，因为市场似乎也消化了同样的恐惧，即我们并没有像看起来那样接近大流行的“结束”。 COVID 病例在美国的许多地方激增，尤其是在密苏里州和阿肯色州等地，这些地方的疫苗接种率落后，并且正在经历由 delta 变种引发的严重疫情。上周，洛杉矶要求人们再次在室内公共场所戴口罩，无论他们的疫苗接种情况如何。所有这些都足以让很多人彻底崩溃。他们中的许多人都像我的同事一样，他们也听过我同事的故事——可怕的故事广为流传！——但知道疫苗科学的要点，现在不知道该相信什么。这个故事引发了一系列问题，这些问题基本上归结为自这场大流行开始以来我们一直试图为自己回答的问题：我如何保证自己和我所爱的人的安全？我需要放弃多少才能这样做？我应该怎么做才能尽可能保证其他人的安全？这些问题最重要的答案现在应该已经很熟悉了：疫苗有效。最重要的是，这些疫苗在完成这些疫苗应该做的主要事情方面非常有效：预防严重疾病和死亡。我的同事没有因为他的疾病进入（并且负担过重）医疗保健系统，这仍然是重点。在大量令人瞠目结舌的数字中——病例增长 50% 听起来很吓人，少数病例翻倍更少——我认为这张图表足够引人注目，很有用：\n但我也不认为这张图表意味着事情很简单，或者我同事的恐惧被夸大了。第二张图表右侧的条形不为零。即使有了这些非常有效的疫苗，仍然会出现感染——群体免疫是一场漫长的比赛，而不是一场短暂的比赛——其中一些感染会很严重。甚至有一小部分接种疫苗的人会死亡——根据 CDC 的数据，截至 7 月 12 日，已有 5,189 名接种疫苗的人因 COVID-19 住院，1,093 人死亡。 （即使这个有点可怕的数字也有警告：据报告，住院患者中有 1,456 人无症状，或因与 COVID 无关的事情住院。）还有很多我们不知道的，包括确切地说 delta 有多严重，以及有多严重delta 之后会发生什么。我们确实知道，为尽可能多的人接种疫苗是我们最大限度地减少不良影响的最佳途径，而且在美国，我们做得比许多人似乎愿意接受的要好。尽管如此，仅仅因为我们可以掌握疫苗有效（它们确实有效）的知识，并不意味着我们不应该努力更清楚地了解突破性病例。我同事的故事强调的是，我们需要重新调整我们对这些案例的看法，它们的可能性有多大，如果它们发生在你身上会有多大的问题，以及这是否意味着我们正在倒退进入另一场封锁。坏消息是，报道这篇文章改变了我对突破性病例风险的看法（我现在怀疑它比我想象的要高）以及获得一个会是什么样子（比我想象的更糟）。好消息是，我认为这并不意味着我们将重新回到封锁状态，尽管我认为我们将再次面临不得不更多地考虑我们的个人风险计算的任务——尤其是如果您想完全避免 COVID。但我学到的最有趣的事情是，如果您完全接种了疫苗，那么避免“轻度”的 COVID 病例，即使很糟糕，实际上可能并不像您想象的那么重要。鉴于我们刚刚花了一年半的时间大幅改变我们的生活以避免 COVID，以这种方式重新定位需要一点时间是可以理解的。但这是值得的。要意识到的最重要的事情是突破性案例将继续在我们的生活中浮出水面。纽约急诊医师达拉·卡斯 (Dara Kass) 说：“我们的目标从来不是消除令人讨厌的新冠病毒——而是消除它成为杀手。” （她再次强调，疫苗非常适合后者。）因此，即使您可能听说过突破性病例“罕见”，但这是一个主观评估，可能值得向上调整。除了这些模糊的特征之外，没有确切的百分比可用——而且 CDC 只跟踪导致住院或死亡的突破性病例，哈佛医生在医学院的博客上称这一决定“令人失望”。但是医学专业人士开始越来越多地考虑这个问题，并且怀疑它们会越来越频繁地发生——当我们这样做时，我们不应该感到惊讶。 “突破是下一个前沿，”哈佛大学的流行病学家比尔·哈纳奇 (Bill Hanage) 写信给我。 Kass 肯定了许多医生一直在传闻的轶事——绝大多数因 COVID 住院的患者都没有接种疫苗。但是，她补充说，“越来越多的接种疫苗的人将继续获得阳性的 COVID 检测。我们真的不知道官方有多少，也不知道这意味着什么。”我们知道在大多数情况下，突破性感染并不那么严重或致命，但我们根本不知道它们目前有多普遍——或者随着 delta 的继续蔓延，这种情况将会有多普遍。另一个脱节是我们认为的“重病”和真正的重病。我的同事说他无法想象将他所经历的疾病描述为“严重”以外的任何事情——他 36 小时无法做任何事情，并说这与使人虚弱的食物中毒相当。但是当我向几位医生询问此事时，他们不同意他的排名。 “从技术上讲，根据严格的病例定义，他似乎对 COVID-19 有轻微的感染，”急诊医生、有时也是 Slate 撰稿人 Jeremy Samuel Faust 写信给我。 “温和并不意味着愉快。事实上，您可能会发烧、发冷、身体疼痛，并且在一周或更长时间内感觉非常糟糕，但仍被归类为“轻度”。 “即使是中度（或严重）的 COVID 病例，也必须有明显的肺部受累，例如低氧水平证明，”浮士德说。 “这真的很痛苦。但你在家里，而不是在重症监护室。” Hanage 告诉我，他的一个接种疫苗的朋友刚刚感染了一个持续四天的轻度病例。这仍然意味着疫苗正在做像他这样的科学家认为他们会做的事情。他说：“疫苗接种有效地消除了全国医疗保健负担过重的威胁——尽管局部严重的疫情不仅有可能而且很可能发生。”\n如果可以突破的“轻度”COVID 病例比我们过去认为旅行的正常后果的感冒更严重，那就值得澄清。所以，是的：疫苗大大降低了疾病的严重程度。但是，用外行的话来说，你仍然会病得很重。它可以不仅仅是吸鼻子。 （坦率地说，你可以因轻度 COVID 而生病这一事实应该是避免患上医生所说的严重 COVID 的另一个原因。）我的同事也对他小组中的每个人都生病这一事实感到沮丧——他相信这是因为他们都接种了疫苗，如果他们接触到病毒，也许只有一个人会生病。 Hanage 说这也不完全正确：“鉴于总体上非常明显的传播聚集性，我对突破性感染聚集并不感到惊讶，”他说。即使只有一个人在曲棍球比赛中捡到它，他们之后也会继续在室内共度时光，并经历了持续的暴露。最让我的同事感到不安的是，他认为自己在做正确的事情时可能会将其他人置于危险之中——他的岳父因病而面临更高的风险，以及他的保姆和他的母亲，他们都是他们处于高危年龄。他用最多的词来概括自己的感受，就是尴尬。虽然在大流行期间没有人应该因生病而受到责备，但我当然可以理解——所有这一切中仍然有一个因素与我们的个人决定有着深刻而阴暗的联系，这些决定带有某种有问题的道德。在疫苗接种后的情况下，情况几乎更糟，在决定是否戴口罩时，也可以将其解读为对您对疫苗的信任程度的判断，或者您对自己的个性仍然采取 COVID 预防措施的程度。任何经历过您最近会戴口罩但现在突然没有人再戴口罩的情况的人都可能会产生共鸣。卡斯有一种有效的方式来表达这种感觉。她认为这是大流行中的又一个例子，有些人真的很努力地把每一件事都做好，而另一些人甚至懒得接种疫苗。正如我的同事香农·帕卢斯 (Shannon Palus) 在 3 月份所说的那样，“错误的人正在听取需要更加谨慎的呼吁。”回想起我同事的曲棍球比赛，疾病预防控制中心仍然建议任何未接种疫苗的人在公共场合在室内时都要戴口罩。我敢打赌，并不是那个体育场里的每个人都接种了疫苗。所有这些都让人们——是的，可能大部分是接种疫苗的人——重新思考他们认为疫苗已经为他们解答的基本问题：我可以不戴口罩去餐馆和酒吧吗？我可以回办公室吗？我可以见我奶奶吗？我可以去度假吗？我可以在面对人的工作中揭开面具吗？我可以举办婚礼或派对吗？这些问题的答案并不像“是的，如果你接种了疫苗”那么简单。这在一定程度上取决于您的团队中有多少人接种了疫苗，但实际答案与所有​​大流行时基本相同：这取决于您的风险承受能力，取决于当地病例数的情况（不过，随着越来越多的人旅行，这可能会成为不太可靠的工具），这取决于您团队中的任何独特的风险因素。 Kass 的观点让我觉得很新奇：她说她怀疑最终，很多人最终会通过遭受轻微的 COVID 感染来提高他们的免疫力。因此，任何人都不应该对接种疫苗后生病感到那么糟糕。重要的是让顺序正确：“如果每个接种疫苗的人仍然感染 COVID 但没有死亡，那就是成功，”她说。问题是接种疫苗的人感觉并不成功。另外，“如果你在接种疫苗后被感染，这就是你所谈论的一切，”她说。现在，可以理解的是，这让许多自以为无恙的接种疫苗的人感到害怕。但是疫苗——不管我们希望它们得到多少，甚至尽可能多地向我们承诺——并没有消除任何疾病的风险，因此它们并没有消除对个人风险计算的需求。 “即使他们最终没有住院，很多人患上突破性疾病也不会很有趣，”Hanage 说。仍然有充分的理由想要避免 COVID，即使是更温和的疫苗版本——如果您与高风险人群共度时光，例如无法从疫苗中获得相同功效的免疫功能低下者；如果您有未接种疫苗的孩子，您会担心（尽管孩子的情况略有不同）。但是您已经知道如何限制暴露的机会——您已经在这方面进行了大量练习。如果您旅行，请注意病例数（和疫苗接种率）。尽管 CDC 说您不必这样做，但在特定情况下可能仍要戴口罩，例如可能有很多未接种疫苗的人的室内情况。 “我认为在病例数高（或病例数和疫苗接种率低的某种组合）的地区，在室内公共场所戴口罩很有意义，”浮士德说。 “即使在病例数很少的波士顿，我也会在每个人的疫苗接种情况不可知的室内环境中戴口罩。”您也不必这样做 - 与以往一样，度过这种大流行意味着要承担对您来说合理的风险和预防措施。 （强制性警告：如果可以，请接种疫苗。）现在一切都让人感到如此困惑的原因是因为我们越来越接近 COVID 成为我们必须忍受的东西的地步——就像我们生活在一个数百万其他有风险但让我们开心的事情，比如开车或在有问题的餐馆吃肉。许多人对这些事情采取不同的方法。这也是我们最终必须适应这种风险的原因。会有指导，其中一些会以证据为基础，而另一些则不会，也许它会随着时间的推移而改变，我们都必须决定考虑多少。就像我们对一切所做的一样。", "note_en": "Recently, one of my colleagues took a trip to Florida. He went to see family, in a long-awaited visit that he had previously only managed to make once during the pandemic, driving the whole way from New York while “peeing behind dumpsters.” Now that everyone was fully vaccinated, it seemed totally reasonable to fly there and to have everyone gather, unmasked, together. It was a relief and a joy. They even went to a hockey game indoors with thousands of people.\n    When my colleague got home, he started to feel like he had a cold. He didn’t think much of it—until he got a call from one of his family members in Florida who had tested positive for COVID-19. Eventually, all the adults who gathered on that trip got sick, including my colleague’s mother-in-law and father-in-law. My colleague’s wife also tested positive; he didn’t, but given his symptoms, including loss of smell, it seemed like a probable COVID case.\n      As I spoke to my colleague about it, he was still sifting through exactly what he was feeling. He’d forgotten how miserable being sick is, for one thing, and his case—a “mild one” by medical definitions—knocked him out for about a day and a half. He, his wife, and his father-in-law still had a lingering cough, and he was worried about long-term effects, particularly because his father-in-law is undergoing treatment for a serious health issue.\n      Mostly, he felt frustrated. He’s a journalist—he’s pretty tuned in to the news. He knew breakthrough cases were possible, but he had seen many assurances that they were extremely rare and not that big of a deal. “I feel like I had very inaccurate information,” he told me, “and I would have made my decisions in a very different light if I knew what I know now.” He would have worn a mask at the hockey game, for example—even though no one was wearing a mask at the hockey game, and the Centers for Disease Control and Prevention said it’s  fine for vaccinated people not to wear masks inside.\n  He acknowledged it might be possible that he and his family just got really unlucky—and maybe a year from now, as long as everyone recovers fully, he’ll be able to look back on this and say “OK, well, the vaccines still did their job.” But right now, he feels worried—worried that breakthrough cases are more common than we think, that vaccinated people will get sicker than they think, that fears about the delta variant are not overblown, and that it might still get worse. Mostly, he’s worried that vaccinated people are not quite as in the clear as many of us seem to think we are.\n      He’s not alone. The day we spoke, the  Dow had its worst day in months as the markets seemed to ingest that same fear, that we’re not as close to the “end” of the pandemic as it seemed. COVID cases are spiking in many parts of the U.S., especially in places like Missouri and Arkansas, which are lagging behind in vaccination rates and  experiencing severe outbreaks fueled by the delta variant. Last week, Los Angeles mandated that  people wear masks when indoors in public spaces again, regardless of their vaccination status. All of this is enough to be thoroughly freaking plenty of people out. Many of them are people like my co-workers, who also heard my colleague’s story—scary stories travel widely!—but know the gist of the vaccine science and now are wondering what to believe. The story sparked a slew of questions that essentially boiled down  to the same ones we have all been trying to answer for ourselves since the start of this pandemic: How can I keep myself and my loved ones safe? How much do I have to give up to do so? And what am I supposed to do to keep everyone else as safe as possible, too?\n      The most important answer to these questions ought to be very familiar by now: The vaccines work. Most importantly, the vaccines are very effective at doing the main thing these vaccines are supposed to do:  prevent severe illness and death. My colleague didn’t enter (and overburden) the health care system with his disease, which is still essentially the point. And in the midst of a lot of eye-popping numbers being tossed around—cases growing by 50 percent sounds scary, a low number of cases doubling less so—I think this chart is striking enough to be useful:\n        But I also don’t think that this chart means things are simple, or that my colleague’s fears are overblown. The bars on the right side of that second chart are not zero. Even with these very effective vaccines, there are still going to be infections— herd immunity is a long game, not a short one—and some of those infections are going to be severe. There are even going to be a very small percentage of vaccinated people who die—according to the CDC, as of July 12, 5,189 vaccinated people have been hospitalized with COVID-19, and 1,093 have died. (Even that somewhat scary number has caveats: 1,456 of those hospitalized were reported asymptomatic, or were hospitalized for something not related to COVID.) There is still plenty we don’t know, including precisely how much worse delta is, and how much worse whatever comes after delta will be. We do know that vaccinating as many people as possible is our best path toward minimizing the badness of whatever that is, and that in the U.S., we are doing  better than many of us seem willing to accept.\n    Still, just because we can hold onto the knowledge that the vaccines are working (they are) doesn’t mean we shouldn’t strive to get a clearer understanding of breakthrough cases. What my colleague’s story underscores is that we need to reorient how we think about these cases, how likely they are, how problematic they are if they happen to you, and whether it all means we’re backsliding into another lockdown. The bad news is that reporting this article has changed how I’ve thought about the risk of breakthrough cases (I now suspect it’s higher than I had thought) and what it would be like to get one (worse than I had thought). The good news is that I don’t think that means we’re heading back toward lockdown, even though I think we are, once again, going to be tasked with having to think a little bit more about our personal risk calculus—especially if you want to avoid COVID entirely. But the most interesting thing I’ve learned is that if you are fully vaccinated, avoiding a “mild” case of COVID, even if it sucks, might not actually be as important as you think. Given that we have just spent a year and a half dramatically altering our lives to avoid COVID, reorienting in this way is understandably going to take a little bit of time. But it’s worth the effort.\n        The most important thing to realize is that breakthrough cases are going to continue to surface in our lives. “The goal was never to eradicate COVID from being annoying—it was to eradicate it from being a killer,” said Dara Kass, an emergency medicine physician in New York. (She emphasized, again, that the vaccines are very good at doing the latter.) And so even while you have likely heard that breakthrough cases are “rare,” that’s a subjective assessment that is probably worth adjusting upward. There hasn’t been a firm percentage available beyond these vague characterizations—and the  CDC is only tracking breakthrough cases that result in hospitalization or death, a decision a Harvard doctor called “ disappointing” on the medical school’s blog. But medical professionals are starting to think about this more and more, and the suspicion is that they will happen with increasing frequency—and we shouldn’t be surprised when we do.\n      “Breakthrough is the next frontier,” Bill Hanage, an epidemiologist at Harvard, wrote to me. Kass affirmed what many doctors have been reporting anecdotally—that the vast majority of patients ending up in hospitals with COVID are unvaccinated. But, she added, “more and more vaccinated people will keep getting positive COVID tests. We really don’t know how many officially or what that means.” We know breakthrough infections are not as serious or deadly in most cases, but we simply don’t know how common they currently are—or will be as delta continues to spread.\n    Another disconnect is what we think of as “severe illness” and what is  actually severe illness. My colleague said he could not imagine describing the illness he had experienced as anything other than “severe”—he was unable to do anything for 36 hours and said it was on par with having debilitating food poisoning. But when I asked a couple doctors about this, they disagreed with his ranking. “Technically, it sounds like he had a mild bout of COVID-19, by strict case definitions,” emergency physician and  sometime Slate contributor Jeremy Samuel Faust wrote to me. “Mild does not mean pleasant. In fact, you can have fever, chills, body aches, and feel downright terrible for a week or more and still be categorized as ‘mild.’ ”\n    To approach even a moderate (or severe) case of COVID, “there must be significant lung involvement as evidenced by low oxygen levels, for example,” Faust said. “It really can be miserable. But you’re at home, not in the ICU.”\n  Hanage told me that a vaccinated friend of his had just had a mild case that lasted four  days. And that still means the vaccines are doing what scientists like him believed they would. “Vaccination effectively removes the threat of nationally overburdened healthcare—even though locally serious outbreaks remain not only possible but likely,” he said.\n    If the “mild” cases of COVID that can break through are more severe than the colds we used to accept as a normal consequence of traveling, that is worth being clear about. So, yes: Vaccines greatly reduce the severity of illness. But you can still get very sick, in layman’s terms. It can be much more than a sniffle. (Frankly, the fact that you can get  that sick from mild COVID should be yet another reason to avoid getting what doctors call severe COVID.)\n    My colleague was also frustrated by the fact that everyone in his group got sick—he had believed that because they were all vaccinated, perhaps only one person would get ill if they came into contact with the virus. Hanage said that wasn’t quite true, either: “I’m not that surprised that breakthrough infections cluster, given the very pronounced clustering of transmission in general,” he said. Even if just one person picked it up at the hockey game, they continued to spend time together indoors afterward and experienced sustained exposure.\n  What was most upsetting to my colleague was the other people he might have put at risk while thinking he was doing the right thing—his father-in-law, who had higher risk due to his illness, and his nanny and his mother, both of whom are at higher-risk ages. The word he used the most to sum up his feelings was  embarrassed. While no one should be blamed for getting sick during a pandemic, I could certainly relate—there’s still an element of all of this that feels deeply and darkly connected to our personal decisions, which is tinged with a sort of problematic morality. It’s almost worse in the post-vaccine landscape, when deciding to mask or not can also be read as a judgment on how much you believe in vaccines, or how much you are still making taking COVID precautions your personality. Anyone who has been in a scenario where you recently would have worn a mask but now suddenly no one is wearing a mask anymore can likely relate.\n      Kass had a useful way of framing this feeling. She thinks it’s yet another example in the pandemic of some people trying really hard to do everything right, while others aren’t even bothering to get vaccinated. As my colleague Shannon Palus  put it in March, “The wrong people are heeding the calls for more caution.” Thinking back to my colleague’s hockey game, the CDC still recommends that  anyone who is unvaccinated wear a mask whenever they are indoors in public. I am willing to bet that not everyone in that stadium was vaccinated.\n  All of this is making people—yes, probably mostly vaccinated people—rethink the basic questions they thought their vaccine had answered for them: Can I go to restaurants and bars unmasked? Can I go back to the office? Can I see my grandma? Can I go on vacation? Can I unmask at my people-facing job? Can I have a wedding, or a party? The answer to those questions is not quite as easy as “yes, if you’re vaccinated.” It depends partly on how many in your group are vaccinated, but the actual answer is basically the same as it’s been all pandemic: It depends on your risk tolerance, it depends on what is happening with case counts locally (though, as more people travel, this might become a less reliable tool), and it depends on any unique risk factors in your group. Kass’ perspective felt novel to me: She said she suspects that in the end, a lot of people are going to end up boosting their immunity by suffering through a mild case of COVID. So no one should feel that bad about getting sick after they’re vaxxed. What matters is getting the order right: “If everyone who gets vaccinated still gets COVID but doesn’t die, that’s a success,” she said. The issue is that it doesn’t feel like a success for vaccinated people. Plus, “if you get infected after you’re vaxxed, it’s all you talk about,” she said. And right now, that’s understandably freaking out a lot of vaccinated people who thought they were in the clear.\n          But vaccines—as much as we want them to and as much as we maybe were even promised they would—have not wiped out the risk of any illness at all, and therefore they have not wiped out the need for personal risk calculus. “A lot of people getting breakthrough disease won’t be fun, even if they don’t end up in hospital,” Hanage said. There are still good reasons to want to avoid COVID, even a milder, vaxxed version—if you are spending time with higher-risk people, like the immunocompromised who can’t get the same efficacy from vaccines; if you have unvaccinated kids you’re worried about (though  kids are a slightly different situation). But you already know how to limit your chance of exposure—you’ve had plenty of practice at that. Pay attention to case counts (and vaccination rates) if you travel. Even though the CDC says you don’t have to, maybe still mask up in specific situations, like indoor situations where there might be lots of unvaccinated people. “I think in areas with high case counts (or some combination of cases and low vaccination rates), masking indoors in public makes a great deal of sense,” Faust said. “Even here in Boston, where the case counts are low, I would mask in indoor settings where everyone’s vaccination status is unknowable.”\n      You also  don’t have to do this—as ever, living through this pandemic means taking the risks and precautions that are reasonable to you. (Obligatory caveat: Get vaccinated if you can.) The reason why everything feels so confusing right now is because we’re getting closer and closer to the point where COVID is something that we just have to live with—just as we live with a million other things that are risky but make us happy, like driving or eating meat from a questionable restaurant. Many people take different approaches to these things. That’s what we’ll eventually have to settle into with this risk, too. There will be guidance, and some of it will be evidence-based and some of it won’t, and maybe it will shift over time, and we will all have to decide how much to take it into account. Like we do with everything.", "posttime": "2021-07-25 06:30:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "疫苗,people", "title": "接种疫苗的人应该了解他们的 delta varian 风险", "title_en": "What vaccinated people should know about their risk from the delta varian", "transed": 1, "url": "https://slate.com/technology/2021/07/covid-delta-variant-risk-vaccinated-breakthrough-cases.html", "via": "", "real_tags": ["疫苗", "people"]}, {"category": "", "categoryclass": "", "imagename": "77ce7bb3d385a50061ec40db64de969d.gif", "infoid": 1069515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天发表的三篇论文分享了关于这颗红色星球的地壳、地幔和熔核的新细节。", "note_en": "Three papers published today share new details on the crust, mantle, and molten core of the Red Planet.", "posttime": "2021-07-25 06:25:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国宇航局,nasa,火星,美国,洞察力", "title": "美国宇航局的洞察力揭示了火星的深层内部", "title_en": "NASA’s InSight Reveals the Deep Interior of Mars", "transed": 1, "url": "https://www.nasa.gov/feature/jpl/nasa-s-insight-reveals-the-deep-interior-of-mars", "via": "", "real_tags": ["美国宇航局", "nasa", "火星", "美国", "洞察力"]}, {"category": "", "categoryclass": "", "imagename": "57a3647bde7d6e7c92a194f49ef42978.jpg", "infoid": 1069513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约——美国卫生官员周四表示，他们现在有证据表明一种无法治愈的真菌在两家医院和一家疗养院蔓延。据美国疾病控制与预防中心报道，华盛顿特区的一家疗养院和达拉斯地区的两家医院爆发了“超级细菌”。少数患者患有侵袭性真菌感染，这些感染对所有三种主要药物都无效。疾病预防控制中心的梅根·莱曼博士说：“这确实是我们第一次开始看到耐药性聚集”，其中患者似乎相互感染。真菌，耳念珠菌，是一种有害的酵母形式被认为对有严重医疗问题的医院和疗养院患者是危险的。当它进入血液、心脏或大脑时最致命。当真菌通过患者接触或在受污染的表面上传播时，它会刺激医疗机构的爆发。卫生官员2019 年，医生在纽约诊断出三起病例，这些病例也对一类称为棘白菌素的药物产生抗药性，被认为是最后一线抗药性药物。防御。在这些情况下，没有证据表明感染已经在患者之间传播——科学家得出结论，对治疗过程中形成的药物产生了抵抗力。在 W在华盛顿特区阿什顿，一家专门收治重病患者的疗养院中有 101 例耳念珠菌病例，其中 3 例对所有三种抗真菌药物均具有抗药性。达拉斯地区两家医院的 22 人集群中，有两家具有这种抵抗力。设施未确定。\n这些病例发生在 1 月至 4 月。在对治疗完全抵抗的五人中，三人死亡 - 德克萨斯州的患者和华盛顿的一名患者。莱曼说，这两次疫情都在持续爆发，而且自 4 月以来还发现了其他感染。但没有报告这些增加的数字。调查人员查看了医疗记录，没有发现这些集群中的患者以前使用过抗真菌药的证据。卫生官员说，这意味着它们会在人与人之间传播。美联社健康与科学部得到霍华德休斯医学研究所科学教育部的支持。 AP 全权负责所有内容。", "note_en": "NEW YORK -- U.S.  health officials said Thursday they now have evidence of an untreatable fungus spreading in two hospitals and a nursing home.\n The “superbug” outbreaks were reported in a Washington, D.C, nursing home and at two Dallas-area hospitals, the Centers for Disease Control and Prevention reported. A handful of the patients had invasive fungal infections that were impervious to all three major classes of medications.\n  “This is really the first time we&#39;ve started seeing clustering of resistance&#34; in which patients seemed to be getting the infections from each other, said the CDC&#39;s Dr. Meghan Lyman.\n The fungus, Candida auris, is a harmful form of yeast that is considered dangerous to hospital and nursing home patients with serious medical problems. It is most deadly when it enters the bloodstream, heart or brain. Outbreaks in  health care facilities have been spurred when the fungus spread through patient contact or on contaminated surfaces.\n Health officials have sounded alarms for years about the superbug after seeing infections in which commonly used drugs had little effect. In 2019, doctors diagnosed three cases in New York that were also resistant to a class of drugs, called echinocandins, that were considered a last line of defense.\n In those cases, there was no evidence the infections had spread from patient to patient — scientists concluded the resistance to the drugs formed during treatment.\n  In Washington, D.C., a cluster of 101 C. auris cases at a nursing home dedicated to very sick patients included three that were resistant to all three kinds of antifungal medications. A cluster of 22 in two Dallas-area hospitals included two with that level of resistance. The facilities weren&#39;t identified.\n  Those cases were seen from January to April. Of the five people who were fully resistant to treatment, three died — both Texas patients and one in Washington.\n Lyman said both are ongoing outbreaks and that additional infections have been identified since April. But those added numbers were not reported.\n Investigators reviewed medical records and found no evidence of previous antifungal use among the patients in those clusters. Health officials say that means they spread from person to person.\n  The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "posttime": "2021-07-25 05:49:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "真菌,untreatable,患者", "title": "三人死于无法治愈的“超级细菌”真菌感染在两个不同的城市", "title_en": "Three Die After Untreatable 'Superbug' Fungus Infections in Two Different Cities", "transed": 1, "url": "https://abcnews.go.com/Health/wireStory/superbug-fungus-spread-cities-health-officials-78994818", "via": "", "real_tags": ["真菌", "患者"]}, {"category": "", "categoryclass": "", "imagename": "0ce343b8c97c70f908ff2540462f7117.jpg", "infoid": 1069512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这可能不是你所在的夏季，但无论你生活在世界的哪个角落，夏季阅读清单都是典型的，有点舒适。我喜欢凉爽的微风、躺椅、饮料和小吃......全部包裹在一起，一本好书倒过来。小说和非小说。戏剧、神秘、科学、浪漫……在评论中告诉我们你在读什么。我正在研究如何测量任何东西，这很酷。受到推崇的！ — Moshe Zadka 对于科幻小说爱好者，我推荐 Luis McMaster Bujold 的 Vorkosigan Saga。在阅读 Larry Wall 的演讲 Perl（第一种后现代计算机语言）之前，我从未听说过她：“请注意，我们仍然时不时地听到‘严肃文学’这个词。这应该是关于现实生活的文学。让我告诉你一些事情。我读过的最严肃的文学作品是洛伊斯·麦克马斯特·布约德 (Lois McMaster Bujold)。你们有人读过她吗？这也是我读过的最有趣的文学作品。它也是太空歌剧。“流派小说”，现代主义者冷笑。意思是它遵循某些惯例. 那又怎样？世界上没有人能像 Bujold 在她的 Vorkosigan 书中那样混合重力和轻浮。这绝对是关于现实生活的。所以如果它遵循太空歌剧惯例会怎样。十四行诗也遵循某些惯例，但我不看到他们这些天被嘲笑很多。当然，他们总是被称为&#39;严肃&#39;。”所以，我从 Vor 游戏开始，然后直到我完成所有系列才停止。动人，有趣，有趣。 ——Petr Beranek 我上周读完了阿里安娜·赫芬顿 (Arianna Huffington) 的《睡眠革命》。目前正在阅读埃里克·拉森 (Erik Larson) 的《白城中的魔鬼》。 —Lauren Maffeo 我的阅读清单上的下一个是 Great Good（星球大战：索龙登高系列的第 2 本书）。几年前我迷上了星球大战的书，并且一直在我阅读清单上的其他书之间阅读它们。我喜欢原始的索龙系列、阿索卡的书、达斯·贝恩的系列和达斯·普雷格斯的书。有些不是很好，比如 Outbound Flight（没有进入）、Master &amp; Apprentice（有点乏味）和绝地之光（“High Republic”系列的第一部）。然后有一些在中间，比如塔金书（有趣的人物）和西斯之王（可预测，但很好）。\n麦克劳德的《理解漫画》是一本好书！大约 8 年前，我在攻读硕士学位时阅读了这本书，当时我正在独立研究视觉修辞学。我和我的导师发现它是图像如何交流的非常有用的参考。另一个：Molly Bang 的图片。在学习图标（相同的视觉修辞课）时，我翻阅了很多次，以至于有些页面开始脱落。 — Jim Hall 有时，我想知道我没有读过什么，因为我的 Kindle 上总是有一两三本书。我是科幻和幻想的忠实读者，所以我刚刚读完了雨果和星云的冠军，一个叫做帝国的记忆。它有一个引人入胜的前提和良好的人物塑造，但我认为写作会更强大一些。与辅助司法一样，这本书探讨了殖民化的概念。但在《被称为帝国的记忆》中，殖民者看起来很像阿兹特克帝国。哦，这个帝国沉迷于复杂的诗歌。公民使用诗歌来加密电子邮件并提供游记。我最近最喜欢的书是《All Systems Red》，这是玛莎·威尔斯 (Martha Wells) 所著《谋杀机器人日记》中的第一本书。想象一下，你有一个人造人，他有点像克隆人，又有点像机器人。她有知觉和自我意识，可以在几秒钟内摧毁一个人或一座建筑物，并覆盖了她的州长程序，但实际上她只是想蜷缩在她的小房间里，狂看她最喜欢的信息娱乐节目。哦，她有社交恐惧症。除了能够摧毁飞船的部分，她和我很像。我最近读过的最好的书之一是马尔科姆·格拉德威尔 (Malcolm Gladwell) 的《轰炸机黑手党》(Bomber Mafia)。这是一个引人入胜的阅读。我还阅读了 Elizabeth Warren 的 Persist，我觉得这很有趣。我刚开始阅读 Stacey Abrams 的《正义在睡觉》。我最近读了比尔·奥莱利 (Bill O&#39;Reilly) 的《杀死疯马》和伊莎贝尔·阿连德 (Isabel Allende) 的《女人的灵魂》。那本书非常引人注目，我为我的女儿和儿媳买了一本。 — 唐·沃特金斯（Don Watkins） 我正在阅读克里斯汀·摩根（Christine Morgan）的新小说《Trench Mouth》，刚刚完成了原版大都会（Fritz Lang 改编的电影），接下来是阿曼达·蒙特尔 (Amanda Montell) 的《邪教：狂热的语言》。我还收到了 Gerold Leonard 的 Workplace Jazz 和 Culture is the Bass，我热切地等待着 Grady Hendrix 的 Final Girl Support Group，它将于下个月发布。 ——凯文·桑尼\n我有两本书正在阅读：Devon Price 的《懒惰不存在》。这是对过度强调生产力在我们的文化中如何走得太远的看法。而且，乔恩·米查姆（Jon Meacham）正在推进他的真理。这是约翰刘易斯的生平和经历。 ——史蒂夫·莫里斯 我全年的阅读仍然主要是古腾堡计划的书籍。最近我读了很多 Hillaire Belloc 的书，主要是他对各种主题的评论（“论任何事物”、“论一切事物”等等）。我也喜欢阅读 GK Chesterton 的文章。很难确定他在抱怨这个或那个时试图表达的真正意义是什么，但他仍然很有趣。目前，我正在阅读 HG Wells 的《三十个奇怪的故事》。我也读过他的一些评论，总体来说还不错。我读过的大部分书似乎都来自 19 世纪末或 20 世纪初。如果您从未读过，我会推荐一本书是伏尔泰的《老实人》。我经历了它从英语版本到法语版本来回跳跃。法国人似乎更有趣。我用我的平板电脑做这一切。我真正喜欢的是能够突出显示某些单词或短语，然后立即能够在平板电脑上在互联网上查找，或使用应用程序进行翻译。 — Greg Pittman 我推荐：Maria Konnikova 的 Mastermind 和 Tony Buzan 的 The Mind Map Book —Hüseyin GÜÇ 我通过几个工作书俱乐部阅读了很多与工作相关的书籍。我现在正在阅读的一本我非常喜欢的书是 Fosslien 和 Duffy-West 的《No Hard Feelings》。这是一本轻松的读物，讲述了情绪在工作中的表现方式，以及如何在工作中管理（您和其他人的）情绪。\n工作之余，我一直在阅读一些关于设计的书籍。我目前正在阅读 Scott McCloud 的《了解漫画》，我最近完成了 Scott Berkun 的非常有趣的《设计如何创造世界》，同时对我们周围日常事物的设计书籍进行了精彩的评论，并概述了如何（有意识和无意识）设计决策影响我们的生活，以及我们如何通过意识到我们何时做出自己的设计决策来改善世界。最后，我也一直在阅读一些历史非小说类小说。最近，我喜欢芭芭拉·塔奇曼 (Barbara Tuchman) 关于第一次世界大战爆发和早期的《八月之枪》。我期待着阅读关于爱尔兰文化身份在 19 世纪和 20 世纪演变的“爱尔兰人如何成为白人”（我从克里斯汀·邓巴-海斯特那里听说的一本书，他写了布莱恩推荐的书）。 —Dave Neary 有点不了解操作方法：我目前正在阅读 Learn You a Haskell for Great Good！它是 Haskell 编程语言的初学者指南，从我的角度来看，这是一件非常奇怪的事情。 — Stephan Avenwedde 在加拿大温哥华，我们迎来了夏季天气，同时也过了冬至；今天我们预计最高温度为 26ºC，到本周晚些时候，我们可能会达到 30ºC（这是异常温暖的附近）。但是很可爱，当然。我期待着在下午晚些时候用一杯清凉的饮料和一本好书来放松一下，所以正好赶上夏季阅读清单！我在智利的同事现在正在隔离，那里是冬天。马普切新年 We Tripantu 和 Aymara Willkakuti 即将来临，这是一个反思、庆祝和期待来年的时刻：我相信，所有的一切都希望变得更好！还有一个冬季学校假期，理论上是从 7 月 12 日到 23 日，在正常的一年里，在公园里追逐孩子一天后，这会给你一个机会去挖掘夏季阅读清单上的建议。在山上滑雪或雪橇。对于任何感兴趣的人，这里有一篇关于玻利维亚 Willkakuti 的简短英文文章，这里是另一篇关于阿根廷和智利 We Tripantu 的文章。 ——克里斯·赫尔曼森", "note_en": "It may not be the season of summer where you are, but summer reading lists are quintessential and somewhat cozy no matter what part of the world you live in. I love the idea of a cool breeze, a lounge chair, a drink, and a snack... all wrapped up together with a good book to pour over.\n Fiction and non-fiction. Dramas, mysteries, science, romance... let us know in the comments what you&#39;re reading.\n  I&#39;m working through   How to Measure Anything, which is pretty cool. Recommended! —Moshe Zadka\n  For science fiction lovers, I recommend Luis McMaster Bujold&#39;s   Vorkosigan Saga. I had never heard of her until reading Larry Wall&#39;s lecture   Perl, the first postmodern computer language: &#34;Note how we still periodically hear the phrase &#39;serious literature&#39;. This is literature that is supposedly about Real Life. Let me tell you something. The most serious literature I’ve ever read is by Lois McMaster Bujold. Any of you read her? It’s also the funniest literature I’ve ever read. It’s also space opera. &#39;Genre fiction,&#39; sneers the Modernist. Meaning it follows certain conventions. So what? Nobody in the world can mix gravity and levity the way Bujold does in her Vorkosigan books. It’s oh so definitely about real life. So what if it follows space opera conventions. Sonnets follow certain conventions too, but I don’t see them getting sneered at much these days. Certainly, they were always called &#39;serious&#39;.&#34;\n So, I started with the   Vor Game and then couldn&#39;t stop until I finished all of the series. Moving, funny, entertaining. —Petr Beranek\n  I finished reading   The Sleep Revolution by Arianna Huffington last week. Currently reading   The Devil in the White City by Erik Larson. —Lauren Maffeo\n   Next on my reading list is   Greater Good (book 2 in the Star Wars: Thrawn Ascendencyseries). I fell into the Star Wars books a few years ago, and have been reading them in between other books on my reading list. I loved the original  Thrawn series, the  Ahsoka book, the  Darth Bane series, and the  Darth Plagueis book. Some are not so great, like  Outbound Flight (didn&#39;t get into it),  Master &amp; Apprentice (kind of dull), and  Light of the Jedi (the first in the &#34;High Republic&#34; series). And then there are some in the middle, like the  Tarkin book (interesting character) and  Lords of the Sith (predictable, but good).\n McCloud&#39;s   Understanding Comics is a great book! I read it when I was working on my Master&#39;s degree, about 8 years ago, during my independent study on visual rhetoric. My instructor and I found it to be a very useful reference in how images communicate.\n Another one:   Picture This by Molly Bang. I thumbed through that so many times when learning about icons (same visual rhetoric class) that some of the pages started falling out. —Jim Hall\n  Sometimes, I wonder what I haven&#39;t been reading, because I always have a book or two or three on my Kindle.\n I am a huge reader of SciFi and Fantasy, so I just finished the Hugo and Nebula winner,   A Memory Called Empire. It has a fascinating premise and good characterizations, but I thought the writing would be a little stronger. Like Ancillary Justice, this book explores the idea of colonization. But in the case of A Memory Called Empire the colonizers look a lot like the Aztec Empire writ large. Oh, and this empire is obsessed with complicated poetry. Citizens use poems to encrypt email and provide travelogues.\n My favorite book in a while is   All Systems Red, the first book in The Murderbot Diaries, by Martha Wells. Imagine that you have an artificial human, who&#39;s a little bit of a clone and a little bit of a robot. She&#39;s sentient and self-aware, can destroy a human or a building in seconds flat, and has overwritten her governor program, but really she just wants to curl up in her cubby and binge-watch her favorite infotainment. Oh, and she has social anxiety. Except for the part about being able to destroy a spaceship, she&#39;s a lot like me.\n   One of the best recent books I read was   Bomber Mafia by Malcolm Gladwell. It was a fascinating read. I also read   Persist by Elizabeth Warren which I found interesting. I just started reading   While Justice Sleeps by Stacey Abrams. I recently read &#34;Killing Crazy Horse&#34; by Bill O&#39;Reilly and &#34;The Soul of a Woman&#34; by Isabel Allende. That book was so compelling that I bought copies for my daughter and daughter-in-law. —Don Watkins\n  I’m currently reading the new Christine Morgan novel   Trench Mouth, having just finished the original  Metropolis (the one Fritz Lang adapted the movie from), and next up is  Cultish: The Language of Fanaticism by Amanda Montell. I’ve also got  Workplace Jazz and  Culture is the Bass by Gerold Leonard in there, and am eagerly awaiting  Final Girl Support Group by Grady Hendrix, which will be out next month. —Kevin Sonney\n  I&#39;ve got two books I&#39;m reading:   Laziness Does Not Exist by Devon Price. This is a look at how the over-emphasis on productivity has gone too far in our culture. And,   His Truth is Marching On by Jon Meacham. This is a look at the life and experience of John Lewis. —Steve Morris\n  My year-round reading continues to be mainly books from Project Gutenberg. Recently I&#39;ve read a number of books by Hillaire Belloc, mainly his commentaries on various topics (&#34;On Anything&#34;, &#34;On Everything&#34; to name two). I also enjoy reading things by GK Chesterton. It can be hard to decide what the real point is that he is trying to make as he complains about this or that, but he&#39;s entertaining nonetheless.\n Currently, I&#39;m reading   Thirty Strange Stories by HG Wells. I&#39;ve also read a number of his commentaries, which are quite good generally. It seems that most books I read come from the late 19th or very early 20th century.\n  A book I would recommend if you&#39;ve never read it is   Candide by Voltaire. I went through it hopping back and forth from the English to the French versions. The French seemed just a bit more entertaining.\n I do all this with my tablet. Something I&#39;ve really gotten attached to is the ability to highlight some word or phrase, then immediately be able to look it up on the internet on the tablet, or translate with an app. —Greg Pittman\n  I recommend:   Mastermind by Maria Konnikova, and   The Mind Map Book by Tony Buzan —Hüseyin GÜÇ\n  I&#39;ve been reading a lot of work-related books through a couple of work bookclubs. One I&#39;m reading now that I really like is   No Hard Feelings by Fosslien and Duffy-West. It&#39;s a light read that talks about the ways emotions show up at work, and how to manage (your and other people&#39;s) emotions at work.\n Outside work, I&#39;ve been reading some books on design.   Understanding Comics by Scott McCloud is my current read, and I recently finished the very enjoyable   How Design Makes the World by Scott Berkun, simultaneously a great lit review of books on the design of everyday things around us, and an overview of how (conscious and unconscious) design decisions impact our lives, and how we can improve the world by being aware of when we make our own design decisions.\n Finally, I have also been reading some historical non-fiction. Most recently, I loved   The Guns of August by Barbara Tuchman about the outbreak and early days of World War One. And I&#39;m looking forward to reading &#34;How the Irish Became White&#34; (a book I heard about from Christine Dunbar-Hester, who wrote the book Bryan recommended) about the evolution of the Irish cultural identity through the 19th and 20th century. —Dave Neary\n  A little out of the how-to corner: I am currently reading   Learn You a Haskell for Great Good! It is a beginner&#39;s guide to the Haskell programming language, a very strange thing from my viewpoint. —Stephan Avenwedde\n  Here in Vancouver, Canada we have hit summer weather as well as passing the solstice; today we&#39;re expecting a high of 26ºC and by late in the week we may hit 30ºC (which is unusually warm hereabouts). But lovely, for sure. And I&#39;m looking forward to kicking back in the late afternoon with a nice cool beverage and a good book, so just in time for the summer reading list!\n My colleagues in Chile are in quarantine right now and it&#39;s winter there. The Mapuche new year We Tripantu and the Aymara Willkakuti are upon us, a time of reflection, celebration, and anticipation of the year to come: all, I am sure, hoping for better! There is also the winter school vacation that in theory runs from the 12th to the 23rd of July, which in a normal year would give an opportunity for digging into the recommendations on the summer reading list after a day of chasing the kids around a park or skiing or sledding in the mountains. For anyone interested, here is a short English article on  Willkakuti in Bolivia, and here is another on  We Tripantu in Argentina and Chile. —Chris Hermansen", "posttime": "2021-07-25 05:44:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,技术,recommended,阅读", "title": "开源技术专家推荐的28本书", "title_en": "28 Books recommended by open source technologists", "transed": 1, "url": "https://opensource.com/article/21/7/open-source-books", "via": "", "real_tags": ["开源", "技术", "阅读"]}, {"category": "", "categoryclass": "", "imagename": "5faa08c7a9018ac567151a024165470f.jpg", "infoid": 1069511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "洛杉矶——莱瓦尔·伯顿 (LeVar Burton) 寻求成为“危险”的新主持人！这位演员和那些通过请愿活动支持他的人充满信心、乐观地做出了努力。但是，当他作为一系列客座主持人之一录制他一周的第一集节目时，节目的节奏和追随亚历克斯·特雷贝克备受钦佩的脚步的挑战让伯顿大吃一惊。这位以《Roots》、《Star Trek: The Next Generation》和《Reading Rainbow》而闻名的资深演员说，周一开始播出的五部背靠背录音带开局很艰难。他向妻子寻求建议。斯蒂芬妮·科扎特·伯顿 (Stephanie Cozart Burton) 在生产休息期间作为他的化妆师在场担任教练。“在家里，感觉就像是真正轻松的半小时，但一点也不放松，”他说。“你可以&#39;不要让你的注意力在一纳秒内下降。”伯顿一直在观察和评估其他嘉宾主持人——换句话说，他在加拿大出生的特雷贝克从 1984 年到 2020 年 11 月因癌症去世，享年 80 岁前不久所担任的职位的竞争。艺术弗莱明是测验节目的原创和唯一的另一位主持人，在 1960 年代和 70 年代。虽然伯顿已经让该节目的制片人意识到他有兴趣被考虑，但在一份支持他作为新“危险！”的请愿书之后，他加入了名单。主持人着火了（迄今为止已有超过 250,000 个签名）。他面临着其他公开渴望成为主持人的人——包括 NFL 四分卫亚伦罗杰斯——但这位演员、导演、教育和扫盲倡导者认为自己是一个游戏节目的完美搭档奖励知识。\n伯顿与美联社谈论了他妻子的切中建议，为什么多样性对“危险！”很重要！以及他如何看待他在下个赛季的录音开始之前，今年夏天有望填补的工作机会。为了清晰和篇幅，对备注进行了编辑。伯顿：我从飞机上跳了下来。我走过热煤。这是一个真正的挑战。首先，因为 (&#39;Jeopardy!&#39;) 在文化中是独一无二的，它作为人们日常生活的一部分对人们意味着什么。事实上，只有两个主人曾经站在那个地方。压力，自然的倾向是想要不辜负亚历克斯的榜样，他的遗产。像所有主持人一样，我排练了一天，第二天我拍摄了五集“危险！”录完第一集后我回到后台，我对斯蒂芬妮说，“好吧，我做得怎么样？”她说，“嗯。”现在，这是一个爱我到足以告诉我真相的女人。她说不是我。伯顿：在接下来的四次击球机会中，我把做自己作为自己的事，忘记程序，忘记过程，停止尝试，停止关注错误的事情。你不会像亚历克斯那样顺利，放手吧。但是你能带来的就是你自己。所以这成了我关注的焦点。当它发生时，我开始玩得很开心。伯顿：我的整个职业生涯都在从事教育，我绝对相信（电视）媒体不仅仅是娱乐性的媒体。我尝试以一种尽可能多地将其他东西带到桌子上的方式来使用这种媒介。我认为“根源”和“星际迷航”和“阅读彩虹”，它们都有共同点，娱乐的共同点，是的 - 以及信息，鼓舞人心，启发性，教育性，令人振奋。我们可以做的不仅仅是通过媒体互相卖东西。 AP：来宾主机之间存在显着的多样性。 &#39;Jeopardy！&#39; 有它的第一个有色人种或女性作为主持人是否有价值？伯顿：没有什么像&#39;危险！&#39; in the cultural consciousness. It&#39;s not that I&#39;m trying to put it on the same level, but I liken it to Barack Obama being elected president in the United States in 2008. I personally never thought I would see that happen in my lifetime.他的选举意味着我们在一个研讨会的美国中吗？显然没有完全。但这是一个重要的一步。每次我们到达第一个里程碑，它会对我们说些什么。它也告诉我们一些我们的事情继续拥有这些第一次的时刻......白色是规范默认值。白色是默认值的原因是我们现在试图在这个国家进行的对话，有很多阻力。伯顿：我是一个异常乐观的人。听着，如果我没有得到这份工作，对我来说会是毁灭性的吗？不。我的意思是，它会受到伤害，我会感到失望。而且我会没事的，因为我所知道的我的生活本该属于我最重要的是，我为此而努力，我的热情得到了回报。我得到了我想要的，这是一个竞争工作的机会。如果我没有得到演出，这不是无关紧要的，但肯定是次要的。我得到了我想要的。机会——让我进房间。", "note_en": "LOS ANGELES -- LeVar Burton’s quest to become the new host of “Jeopardy!” has been a confident, upbeat effort by the actor and those who rooted him on with a petition drive.\n But when the day came to tape the first of his week&#39;s share of episodes as one of a succession of guest hosts, the show&#39;s pace and the challenge of following in Alex Trebek&#39;s much-admired footsteps threw Burton off stride.\n  It made for a rough start to the five back-to-back tapings that begin airing Monday, said the veteran actor known for “Roots,&#34; “Star Trek: The Next Generation&#34; and ”Reading Rainbow.&#34; He turned for advice to wife Stephanie Cozart Burton, who as his makeup artist was on hand to play coach during a production break.\n “Being at home, it feels like a really relaxed half-hour, but it&#39;s not relaxed at all,” he said. “You can&#39;t let your focus drop for a nanosecond.”\n Burton has been watching and assessing the other guest hosts — in other words, his competition for the position that the Canadian-born Trebek held from 1984 to shortly before his November 2020 death from cancer at age 80. Art Fleming was the quiz&#39;s show&#39;s original and only other host, in the 1960s and &#39;70s.\n Although Burton had made the show&#39;s producers aware of his interest in being considered, his addition to the roster came after a petition backing him as the new “Jeopardy!” host caught fire (with more than 250,000 signatures to date).\n He faces other openly eager would-be hosts — including NFL quarterback Aaron Rodgers — but the actor, director and education and literacy advocate sees himself as a solid match for a game show that rewards knowledge.\n Burton spoke with The Associated Press about his wife&#39;s on-point advice, why diversity matters for “Jeopardy!” and what he thinks of his chances for the job expected to be filled this summer, before next season&#39;s taping begins. Remarks have been edited for clarity and length.\n     BURTON: I’ve jumped out of airplanes. I’ve walked over hot coals. This was a real challenge. First of all, because (‘Jeopardy!’) is singular in the culture and what it means to people as a part of their daily lives. And the fact that there are only two hosts who have ever stood in that spot. The pressure, the natural tendency was to want to live up to Alex’s example, his legacy. I had, like all of the hosts, one day of rehearsal and the following day I shot five episodes of ‘Jeopardy!’ I came backstage after taping the first episode and I said to Stephanie, ‘Well, how did I do?’ She said, ‘ehhh.’ Now, this is a woman who loves me enough to tell me the truth. She said it wasn’t me.\n  BURTON: I made it my business for the next four chances at bat to just be myself, to forget about the procedure, to forget about the process, stop trying, stop focusing on the wrong thing. You’re not going to be smooth as Alex, let go of that. But what you can bring to the table is you. So that became my point of focus. And when it did, I started having fun.\n  BURTON: I’ve been about education my entire career, and I definitely believe in the medium (of television) as one where more than simply entertaining is the order of the day. I try and use the medium in a way that brings something else to the table as often as I can. I think that ‘Roots’ and ‘Star Trek’ and ‘Reading Rainbow,’ they all have that commonality about them, that common thread of entertainment, yes — and informational, inspiring, enlightening, educational, uplifting. We can do so much more than just sell each other stuff with the medium.\n AP: There&#39;s significant diversity among the guest hosts. Would there be value in &#39;Jeopardy!&#34; having its first person of color or woman as host?\n BURTON: There&#39;s nothing like ‘Jeopardy!’ in the cultural consciousness. It&#39;s not that I&#39;m trying to put it on the same level, but I liken it to Barack Obama being elected president in the United States in 2008. I personally never thought I would see that happen in my lifetime. Did his election mean that we were in a post-racial America? Obviously not at all. But it was an important step. Every time we reach that milestone of a first, it does say something about us. It also tells us something that we continue to have these moments of firsts.... that white is the normative default. The reason that white is the default is the conversation that we are trying to have in this country now, that there’s so much resistance to.\n  BURTON: I am a preternaturally optimistic person. Look, if I don’t get this job, will it be devastating to me? No. I mean, it will hurt, I’ll be disappointed. And I’ll be fine, because what I know about my life is that which is supposed to be for me comes my way. And that which is not mine, doesn’t. The most important thing is that I went for it and my passion was rewarded. I got what I wanted, which was an opportunity to compete for the job. If I don’t get the gig, it’s not immaterial, but it certainly is secondary. I got what I was after. The chance — get me in the room.", "posttime": "2021-07-25 05:43:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "burton,主持人", "title": "LeVar Burton：“危险”主持人演出开始“可怕”，结束乐趣", "title_en": "LeVar Burton: 'Jeopardy ' host gig began 'scary,' ended fun", "transed": 1, "url": "https://abcnews.go.com/Entertainment/wireStory/levar-burton-jeopardy-host-gig-began-scary-ended-79018577", "via": "", "real_tags": ["burton", "主持人"]}]