[{"category": "", "categoryclass": "", "imagename": "c4ae75a8624fe7d61d9bdf83cb1267d8.jpg", "infoid": 1015030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二，伊士曼柯达公司(纽约证券交易所代码：KODK)宣布转向药物成分开发，并宣布一笔巨额政府贷款后，该公司股价飙升222%。\nBenzinga‘s的联合盘前准备主持人丹尼斯·迪克(Dennis Dick)在周二上午的节目中表示，在消息传出之前，他注意到柯达股票和期权市场周一都出现了一些可疑的交易活动。\n“我只想知道昨天是谁拿到备忘录的？看看昨天新闻之前这玩意儿上的爆裂。那是一支很大的蜡烛。这是两个月来涨幅最大的一次。“迪克说。\n发生了什么？在这一重大消息公布前，柯达股价周一上涨25%。柯达公司表示，该公司的传统业务是生产相机，但自那以来它已转向区块链，现在正计划生产仿制药成分。\n“我会看看昨天是谁买了那玩意儿。迪克说：“如果有内幕买入发生，知道这是一种头条新闻，在我看来，这基本上就是在试图推高股价，这是一件很有趣的事情。”\n“我会追逐这件事吗？”绝对不行。我认为当尘埃落定时，这件事就会重新落下。“。\n怎么玩：迪克说，柯达的股价早在2017年就有类似的反应，当时该公司试图进入华尔街的区块链趋势。尽管区块链消息带来了巨大的短期涨幅，但在本周爆炸性上涨之前，柯达股价在过去三年中整体仍下跌了约80%。\n“我不会在8美元附近追逐它，因为我不知道烫手山芋之旅什么时候结束，但我认为做空它也必须小心，因为这些东西可能会变得疯狂。”这是现在的紧要关头，“迪克说。\n观看下面片段中的完整讨论，或在此处收听播客。\n盘前准备是由道具交易员Dennis Dick和前场内交易员Joel Elconin主持的每日交易节目。ET是Benzinga的YouTube频道，播客在Spotify、iTunes、Google Play、Soundcloud、Stitcher和TuneIn上。\n查看评论并加入讨论！", "note_en": "Eastman Kodak Company (NYSE:  KODK) shares skyrocketed 222% on Tuesday after the company announced it&#39;s  pivoting to drug ingredient development and announced a large government loan.\n Benzinga&#39;s  PreMarket Prep co-host Dennis Dick said on Tuesday morning’s show that he noticed some suspicious trading activity in both the Kodak stock and options market on Monday ahead of the news.\n “All I want to know is who got the memo yesterday? Look at the pop on this thing yesterday ahead of the news. That’s a big candle. That’s the biggest up move it’s had in two months,” Dick said.\n What Happened? Kodak shares were up 25% on Monday ahead of the big news. Kodak’s legacy business was producing cameras, but it has since pivoted to blockchain and now is planning to produce generic drug ingredients, the company said.\n   “I’d be looking at who was buying that thing yesterday. If there was some insider buying happening, that’s interesting knowing it’s this type of headline, which is basically just trying to drive the price up in my opinion,” Dick said.\n “Would I be chasing this? Absolutely not. I think when the dust settles, this thing will be back down.”\n How To Play It: Dick said Kodak’s share price reacted similarly back in 2017 when the company attempted to get in on the blockchain trend on Wall Street. Despite huge short-term spikes on the blockchain news, Kodak shares were still down about 80% overall in the past three years ahead of this week’s explosive gains.\n “I wouldn’t be chasing it up around $8 because I don’t know when the hot potato ride ends, but I think you’ve got to be careful shorting it as well because these things can go crazy. This is a squeeze now,” Dick said.\n  Watch to the full discussion in the clip below, or listen to the podcast   here\n  PreMarket Prep is a daily trading show hosted by prop trader Dennis Dick and former floor trader Joel Elconin. You can watch PreMarket Prep live every day from 8-9 a.m. ET  Benzinga&#39;s YouTube channel, and the podcast is on  Spotify,  iTunes,  Google Play,  Soundcloud,  Stitcher and  Tunein.\n    View Comments and Join the Discussion!", "posttime": "2020-07-30 04:25:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,药品,suspicious,股价", "title": "柯达在药品新闻之前有一些非常可疑的交易活动", "title_en": "Kodak Had Some Very Suspicious Trading Activity Ahead Of Drug News", "transed": 1, "url": "https://www.benzinga.com/news/20/07/16814320/kodak-had-some-very-suspicious-trading-activity-ahead-of-drug-news", "via": "", "real_tags": ["交易", "药品", "股价"]}, {"category": "", "categoryclass": "", "imagename": "6408cf3bc2ab2df2e9da37bb8a25a291.jpg", "infoid": 1015027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃博拉病毒和最初的SARS病毒突显了新出现的疾病给我们高度联系的现代社会带来的风险。虽然隔离感染者和限制疾病传播的标准方法在这些情况下有效，但它起作用的速度足够慢，足以让许多人感到紧张。但寨卡病毒和SARS-CoV-2在全球的传播表明，这些方法有其局限性，让我们面临风险。\n我们还能做些什么吗？爱达荷大学的斯科特·努斯默和詹姆斯·布尔的观点表明，我们现在有了在病毒传染给人类之前对其发起进攻的工具。该提议：用可以通过野生种群传播的基于病毒的疫苗来治疗威胁病毒的动物宿主。虽然这里有很多细节需要解决，但本文列出了我们如何确定这是否是一种可行的方法。\n有大量的宿主与我们人类共享病毒。这些威胁从熟悉的威胁，如携带狂犬病病毒的哺乳动物，到跨越流感大流行的农业物种，以及新出现的危险，如分别由老鼠和各种物种携带的汉坦病毒和冠状病毒。虽然将病毒传染给人类的物种没有真正的模式，但已经有成功的努力来识别病毒起源的宿主。Nuismer和Bull强调了由美国国际开发署(US Agency For International Development)运营的预测项目，在特朗普政府于3月份终止该项目之前，该项目发现了近1000种以前没有特征性的病毒。\n要弄清楚这些病毒中的哪一种可能构成威胁并不是一件简单的事情。但就目前而言，我们知道有大量病毒在动物体内传播，对人类构成威胁，因此不乏潜在的攻击目标。如果我们真的采取先发制人的方式与他们合作，我们就可以开始担心潜在的威胁了。\n那么，如何才能阻止一种甚至还没有感染我们的病毒呢？基本想法很简单：开发一种疫苗，并将其接种给携带病毒的动物。这种方法的明显挑战是向野生动物群体提供疫苗。不仅这些种群通常分布广泛，难以接近，而且许多动物(如汉坦病毒的情况下的小鼠)的寿命相当短。\nNuismer和Bull考虑的解决方案是使用一种病毒作为疫苗-具体地说，一种可以在给定初始剂量的情况下传播到人群之外的病毒。换句话说，疫苗将自我复制，并确保未接种疫苗的人群有机会获得一剂疫苗。这一基本想法已经用流行病学模型进行了探索，它可能会奏效，但到目前为止，它只在动物种群中接受了一次有限的测试。\n流行病学模型表明，这种传播可以根据用作疫苗的病毒的传染性进行微调。有了足够高的传染性，疫苗应该传播到任何没有充分隔离的宿主群体中。传染性较低的较弱病毒在最初接种后可能会传播一到两次，然后才会枯萎。根据我们对用作疫苗的病毒的了解和操纵程度，调整其特性以匹配人群的大小和分布，以及我们提供额外剂量的容易程度，是可能的。\n执行此操作有两种选择。第一种方法涉及从我们试图接种的病毒开始，并产生一种通常被称为减毒的弱化形式。这种方法已经被用于一些人类疫苗。不幸的是，已经有一些例子表明，减弱的病毒在人群中传播时重新进化出毒力。如果这种情况发生在一种对人类构成威胁的病毒上，我们的疫苗接种工作可能会无意中扩大可能将其传染给我们的动物池。出于这个原因，Nuismer和Bull不认为这是一个可行的选择。\n另一种选择是做一件正在对SARS-CoV-2进行试验的事情：设计一种基因，编码病毒中的一种蛋白质，将其作为靶标，进入一种可以在人群中传播的无害病毒。理想情况下，当无害的病毒感染新的动物时，它们产生的免疫反应将同时针对病毒的蛋白质和其中的一种，从而提供对两种病毒的免疫力。\n将不同病毒的基因改造成病毒是这种方法最不具挑战性的方面。它完全依赖于我们发现或产生感染目标物种的无害病毒的能力。如果我们确实使用了一种自然产生的病毒，那么我们就面临着目标人群对它具有预先存在的免疫力的风险。我们可能需要花时间调整它的传染性，以满足我们的需求。最后，在所有这些都做完之后，对病毒来说多余的蛋白质有可能最终丢失。“。\n当然，如果我们计划定期重新接种疫苗，那么蛋白质的损失不会是一个主要因素。但对于埃博拉这样的疫情来说，这可能是一个更大的挑战，因为新的疫情似乎起源于偏远地区。\n最后，作者推荐了一套基本的指导方针：使用基于无害病毒的东西，确保它是特定物种的，并确保一旦它被放入野生种群，它的传播就会受到限制。\n到目前为止，作者表示，这种方法总共尝试了一次。一种自然进化成无害形式的兔子病毒被改造成携带一种蛋白质的基因，这种蛋白质可以对一种更危险的病毒产生免疫力，这种病毒也是以兔子为目标的。一群兔子在被放到一个小岛上之前接种了这种病毒。在允许病毒传播了一段时间后，对其他一群兔子进行了测试，发现其中约有一半被感染。这表明传染性足够高，以至于兔子种群最终可能会从一次放生中达到群体免疫力。\nNuismer和Bull认为使用针对人类的病毒来测试这种方法是一个很好的模型。他们提出了类似狂犬病的疾病，这种疾病经过了深入的研究，并有许多已知的宿主。同样，他们认为岛上的种群是一个很好的选择，因为这将允许详细追踪疫苗通过动物传播的情况。如果这个方法奏效，我们就可以开始考虑在更广泛的人群中使用这种方法了。\n那么，采取攻势，在动物中启动先发制人的疫苗接种计划，对抗可能对我们构成威胁的病毒，这有意义吗？这里推荐的方法包括识别无害的特定物种的病毒，然后将它们改造成危险病毒的疫苗，这涉及到大量的工作。在受控环境中进行安全测试-有蝙蝠这样的非自愿参与者-将大大增加所涉及的努力。在某种程度上，它将变得类似于设计人类疫苗的努力。\n对于像狂犬病这样构成常规健康风险的疾病来说，所有这些努力可能都是值得的。但举一个目前相关的例子，仅蝙蝠身上就有大量的冠状病毒--还有非常多的蝙蝠种类--蝙蝠并不是唯一一种可以感染人类的冠状病毒的来源。其中大多数可能是无害的，需要进行广泛的工作来确定哪些可能对我们构成威胁。我们真的能指望保护自己不受与此相关的一切的影响吗？\n这是一个耐人寻味的想法，一旦我们更好地掌握了新出现的病毒带来的威胁，这种方法可能会被证明是一种有用的中和它们的方式。就目前而言，虽然我们当然已经有了这样做的技术，但它有意义追逐的目标数量足够少，这看起来不太可能有广泛的用处。", "note_en": "Viruses like Ebola and the original SARS have highlighted the risks that emerging diseases pose to our modern, highly connected society. While the standard approach of isolating the infected and limiting the spread of the disease worked in those cases, it works slowly enough to make many people nervous. But the global spread of Zika and SARS-CoV-2 shows that these approaches have their limits, leaving us at risk.\n Is there anything else we could do? A perspective by Scott Nuismer and James Bull of the University of Idaho suggests we now have the tools to go on the offensive against viruses before they transfer to humans. The proposal: treat animal hosts of threatening viruses with virus-based vaccines that can spread through wild populations. While there are a lot of details to work out here, the article lays out how we might determine if this could be a viable approach.\n  There are a huge number of hosts that share virus with our species. These range from familiar threats, like the mammals that carry the rabies virus, to our agricultural species that have spanned flu pandemics, as well as newly emerging dangers, such as hantaviruses and coronaviruses, carried by mice and a variety of species, respectively. While  there&#39;s no real pattern to the species that transfer viruses to humans, there have been successful efforts to identify the hosts from which viruses originated. Nuismer and Bull highlight the PREDICT program, run by the US Agency for International Development, which identified nearly 1,000 previously uncharacterized viruses before the Trump administration terminated it in March.\n  Figuring out which of those viruses might pose a threat is not a simple matter. But for the time being, there are a large collection of viruses that we  know circulate in animals and are a threat to humans, so there&#39;s no shortage of potential targets. If we actually get a preemptive approach to work with them, we can start worrying about potential threats.\n So how do you stop a virus that&#39;s not even infecting us yet? The basic idea is simple: develop a vaccine and give it to the animals that carry the virus. The obvious challenge to this approach is delivering the vaccine to a wild animal population. Not only are these populations often widely dispersed and difficult to access, but many of the animals (such as mice, in the case of hantavirus) have pretty short lifespans.\n The solution that Nuismer and Bull consider is to use a virus as the vaccine—specifically, a virus that can spread beyond the population given the initial dose. In other words, the vaccine will make copies of itself and ensure that the unvaccinated population has a chance to receive a dose. This basic idea has been explored using epidemiological models, and it would likely work, but it&#39;s only received a single, limited test in an animal population so far.\n  The epidemiological models indicate that this spread can be fine-tuned based on the infectivity of the virus being used as a vaccine. With a high-enough infectivity, the vaccine should spread throughout any populations of hosts that aren&#39;t sufficiently isolated. A weaker virus with a lower infectivity might spread once or twice after the initial inoculation before fizzling out. Depending on how well we know and can manipulate the virus being used as the vaccine, it might be possible to tune its properties to match the size and distribution of a population, as well as the ease with which we can deliver additional doses.\n There are two options for doing this. The first would involve starting with the virus that we&#39;re trying to vaccinate against and generating a weakened form, often termed &#34;attenuated.&#34; This approach has been used for some human vaccines. Unfortunately, there have been a number of instances where a weakened virus has re-evolved virulence while circulating in a population. If this were to happen with a virus that poses a threat to humans, it would be possible for our vaccination efforts to inadvertently expand the pool of animals that could transfer it to us. For that reason, Nuismer and Bull don&#39;t consider this a viable option.\n  The alternative is to do one of the things that is being  tried with SARS-CoV-2: engineer a gene that encodes a protein from the virus being targeted into an innocuous virus that can spread through the population. Ideally, as the harmless virus infects new animals, the immune response they generate will target both the virus&#39;s proteins and the one engineered into it, thus providing immunity to two viruses.\n Engineering a different virus&#39;s gene into a virus is the least challenging aspect of this approach. It&#39;s completely dependent upon our ability to find or generate harmless viruses that infect the target species. If we do use a naturally occurring virus, then we run the risk of the targeted population having a pre-existing immunity to it. We may need to spend time tuning its infectivity to match our needs as well. And finally, after all that&#39;s done, there&#39;s a chance that the protein, which is superfluous to the virus, will end up being lost.\n Of course, if we plan on reintroducing the vaccine regularly, then the loss of the protein won&#39;t be a major factor. But for something like Ebola, where new outbreaks seem to originate in remote areas, this may be more of a challenge.\n In the end, the authors recommend a set of basic guidelines: use something that is based on a harmless virus, make sure it&#39;s species-specific, and make sure that it&#39;s engineered to limit its spread once it&#39;s put in a wild population.\n  So far, the authors indicate that this method has been tried a grand total of once. A rabbit virus that had naturally evolved into a harmless form was engineered to carry the gene for a protein that would confer immunity to a more dangerous virus that also targeted rabbits. A group of rabbits were inoculated with this virus before being set loose on a small island. After some time to allow the virus to spread, a bunch of other rabbits were tested, and about half of them were found to have been infected. This suggests that the infectivity was high enough that the rabbit population could eventually hit herd immunity from a single release.\n Nuismer and Bull think that&#39;s a good model for testing the approach using a virus that targets humans. They suggest something like rabies, which has been intensely studied and has a number of known hosts. Again, they think that an island population is a good choice, as it will allow a detailed tracing of the vaccine&#39;s spread through the animals. If that works out, we can start considering the method&#39;s use in more widely dispersed populations.\n So does it make sense to take the offensive and start a pre-emptive vaccination program in animals against viruses that might be a threat to us? The approach recommended here, which involves identifying harmless, species-specific viruses and then engineering them to be vaccines for a dangerous one, involves a significant amount of work. Safety testing in a controlled environment—with involuntary participants like bats—will add considerably to the effort involved. At some point, it&#39;s going to become similar to the effort of designing a human vaccine instead.\n  For something that poses a regular health risk, like rabies, all this effort may be worthwhile. But to just take a currently relevant example, there are a large collection of coronaviruses in bats alone—along with a very large collection of bat species—and bats aren&#39;t the only species that has been the source of a coronavirus that&#39;s gone on to infect humans. Most of these are probably harmless, and extensive work will be needed to determine which might pose a threat to us. Can we really expect to protect ourselves from everything relevant there?\n It&#39;s an intriguing idea, and once we have a better grip on the threats posed by emerging viruses, the method may prove to be a useful way of neutralizing them. For now, while we&#39;ve certainly got the technology to do it, the number of targets that it makes sense to go after is small enough that this doesn&#39;t seem likely to be widely useful.", "posttime": "2020-07-30 04:01:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "疾病,emerging,病毒", "title": "我们能对新出现的疾病发起攻势吗？", "title_en": "Could we go on the offensive against emerging diseases?", "transed": 1, "url": "https://arstechnica.com/science/2020/07/could-we-go-on-the-offensive-against-emerging-diseases/", "via": "", "real_tags": ["疾病", "emerging", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "87ed10346899c843c6e9e53b25e2679a.jpg", "infoid": 1015025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在AMD第二季度财报电话会议上，AMD首席执行官丽莎·苏(Lisa Su)表示，该公司即将于2020年推出的所有产品都仍在按计划发布-这意味着Zen 3台式机CPU、RDNA 2&34；Big Navi GPU，以及PS5和Xbox Series X的控制台硬件。\n这对消费者来说是个好消息，但对英特尔(Intel)来说却是个坏消息。本周，英特尔对其工程部门进行了重组，此前不久，英特尔承认，我们要到2022年底甚至2023年才能看到它的7 nm台式机CPU。\n这并不像听起来那么糟糕--两家公司衡量制程规模的方式存在差异，英特尔7 nm制程的晶体管密度应该大致相当于AMD晶圆厂合作伙伴台积电(TSMC)的5纳米制程。不幸的是，这一延迟意味着台积电应该与英特尔现在预计推出自己的7 nm芯片的时间大致相同。\nAMD自身的好消息继续伴随着收益本身，营收同比增长26%，净利润同比增长1.22亿美元，增幅高达449%。苏将增长主要归因于Epyc和Ryzen CPU，特别关注Ryzen 4000手机-由于个别价格较低的移动处理器收入增加，该公司的平均销售价格实际上同比下降。苏接着说，来自移动Ryzen 4000的收入增长速度比我们历史上任何一款移动处理器都要快。\n我们还没有Zen3 CPU的确切日期，但它们一般预计将在2020年第三季度推出。我们也不确定哪些CPU系列最初会在Zen 3上推出--但Epyc似乎很可能会走在前面，因为它的下一代米兰是AMD到目前为止承诺在2020年推出的唯一一款具体的Zen 3产品。与此同时，大型导航图形处理器预计也将在同一时间推出，PS5和Xbox Series X预计也将赶在假期前上市。", "note_en": "During AMD&#39;s second-quarter  earnings call, CEO Lisa Su said that all of the company&#39;s upcoming 2020 product launches are still on schedule—meaning Zen 3 desktop CPUs, RDNA 2 &#34;Big Navi&#34; GPUs, and console hardware for the PS5 and Xbox Series X.\n This is great news for consumers but bad news for Intel, which  reorganized its engineering department this week shortly after  admitting that we won&#39;t be seeing its 7nm desktop CPUs until late 2022 or perhaps even 2023.\n This isn&#39;t  quite as bad as it sounds—there&#39;s a discrepancy between the way the two companies measure process size, and transistor density for Intel&#39;s 7nm process should be roughly equivalent to AMD fab partner TSMC&#39;s 5nm process. Unfortunately, the delay means TSMC should be debuting its 3nm parts around the same time that Intel now expects to be launch its own 7nm.\n AMD&#39;s own good news continued with the earnings themselves, with revenue up 26 percent and net income up $122 million—a whopping 449 percent—year on year. Su attributed the increase primarily to Epyc and Ryzen CPUs, with special focus on Ryzen 4000 mobile—the company&#39;s average sale price actually dropped year-on-year due to the increased revenue from the individually less-expensive mobile processors. Su went on to say that the revenue from mobile Ryzen 4000 ramped up &#34;faster than any mobile processor in our history.&#34;\n We don&#39;t yet have firm dates for Zen 3 CPUs, but they&#39;re generally expected to launch in Q3 2020. We also don&#39;t know for certain  which CPU lines will initially launch on Zen 3—but Epyc seems likely to lead the way, since its next-gen Milan is the only specific Zen 3 product AMD has committed to a 2020 launch so far. Meanwhile, Big Navi GPUs are  expected to launch around the same time, and PS5 and Xbox Series X are expected &#34;in time for the holidays.&#34;", "posttime": "2020-07-30 03:35:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ps5,delays,英特尔", "title": "AMD：PS5、Xbox系列X、Zen 3 CPU和rDNA 2 GPU无延迟", "title_en": "AMD: No delays for PS5, Xbox Series X, Zen 3 CPUs, and RDNA 2 GPUs", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/07/amd-no-delays-for-ps5-xbox-series-x-zen-3-cpus-and-rdna-2-gpus/", "via": "", "real_tags": ["ps5", "delays", "英特尔"]}, {"category": "", "categoryclass": "", "imagename": "c2ba8c9a3c0eab57822722b908b972df.jpg", "infoid": 1015023, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "众议院司法委员会(House Judiciary Committee)主席杰里·纳德勒(Jerry Nadler)暗示，作为正在进行的长达一年的反垄断调查的一部分，该委员会获得了新的文件。他表示，当时马克·扎克伯格(Mark Zuckerberg)和Facebook其他高管之间的电子邮件讲述了“一个非常令人不安的故事”。\n纳德勒接着宣布，Facebook收购Instagram违反了反垄断法。“如果这在交易时是非法合并，为什么现在Instagram不应该被拆分成一家独立的公司呢？”纳德勒问道。\n在2012年4月6日，也就是宣布收购Instagram的三天前，扎克伯格在视频问答环节中描述了这款社交照片分享应用构成的威胁，提到了Facebook自己的“不太棒”的移动应用，用户只“容忍”它。\n“它们生长得很好。我们需要把我们自己从洞里挖出来。好消息是，我们一直在这么做。坏消息是，他们增长得真的很快，他们有很大的动力，要把他们赶下台有点困难。我们在那里有一场硬仗要打。“。\n在委员会获得的电子邮件中，纳德勒引用扎克伯格的话说，“初创企业的一件事是你经常可以收购它们”--从Instagram开始，Facebook肯定已经做到了这一点。\n扎克伯格周三表示：“我一直很清楚，我们既把Instagram视为竞争对手，也把它视为我们服务的补充。”扎克伯格为公司辩护，并淡化了纳德勒的批评。\n扎克伯格声称：“当时，几乎没有人认为它们是一个普通的社交网络。”\n事实是，Instagram已经广受欢迎，苹果应用商店的日下载量超过10万次。TechCrunch的萨拉·佩雷斯(Sarah Perez)当时写道：“Instagram仅在iOS上就拥有2700万注册用户，它越来越多地将自己定位为一个独立的社交网络--而不仅仅是一款照片分享应用。”\n考虑到交易的环境，众议院司法主席威胁说，即使在八年后，取消合并也是合适的。\n“…。Facebook认为Instagram是一个强大的威胁，可能会将业务从Facebook手中抽走，所以Facebook没有与其竞争，而是收购了它，“纳德勒说。\n“这与反垄断法旨在防止的反竞争行为一模一样。”", "note_en": "Alluding to  new documents provided to the committee as part of its ongoing year-long  antitrust investigation, House Judiciary Committee Chairman Jerry Nadler said emails between Mark Zuckerberg and other Facebook executives at the time tell “a very disturbing story.”\n Nadler went on to declare that Facebook’s acquisition of  Instagram   violated antitrust laws. “If this was an illegal merger at the time of the transaction, why shouldn’t Instagram now be broken off into a separate company?” Nadler asked.\n  In a video  question and answer session on April 6, 2012 — three days before announcing the Instagram acquisition — Zuckerberg describes the threat posed by the social photo sharing app, mentioning Facebook’s own “not awesome” mobile app that users only “tolerate.”\n “They’re growing well. We need to dig ourselves out of a hole. The good news is, we’ve been doing that. The bad news is that they are growing really quickly, they have a lot of momentum and it’s kind of going to be tough to dislodge them. We have a hard battle ahead of ourselves there.”\n In emails obtained by the committee, Nadler quotes Zuckerberg saying “one thing about startups is you can often acquire them” — and beginning with Instagram, Facebook has certainly done that.\n  “I’ve always been clear that we viewed instagram as both a competitor and as a complement to our services,” Zuckerberg said Wednesday, defending the company and downplaying Nadler’s critiques.\n “At the time, almost no one thought of them as a general social network,” Zuckerberg claimed.\n The reality is that Instagram was already wildly popular, with more than 100,000 daily downloads in Apple’s App Store. “At 27 million registered users on iOS alone, Instagram was increasingly positioning itself as a social network in its own right — not just a photo-sharing app,” TechCrunch’s Sarah Perez  wrote at the time.\n Given the climate of the deal, the House Judiciary chairman threatened that unwinding the merger would be appropriate, even eight years later.\n “… Facebook saw Instagram as a powerful threat that could siphon business away from Facebook so rather than compete with it, Facebook bought it,” Nadler said.\n “This is exactly the same kind of anticompetitive action that the antitrust laws were designed to prevent.”", "posttime": "2020-07-30 03:34:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,警告,instagram", "title": "\n在收购Instagram之前，扎克伯格警告员工将进行一场“驱逐”Facebook竞争对手的“战斗”", "title_en": "\n\t\t\t\tBefore buying Instagram, Zuckerberg warned employees of ‘battle’  to ‘dislodge’ Facebook competitor\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/29/facebook-instagram-deal-illegal-nadler/", "via": "", "real_tags": ["facebook", "警告", "instagram"]}, {"category": "", "categoryclass": "", "imagename": "d165d30416312bf67bc2ed3219aa2209.jpg", "infoid": 1015022, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "智能眼镜公司诺斯(North)告诉顾客，他们花600美元(460英镑)购买的眼镜将在几天后停止工作。\n这家最近被谷歌收购的加拿大公司表示，其Focals眼镜将于周五停止使用。\n从那时起，拥有者将不能使用眼镜的任何功能，也不能连接到配套的应用程序。\n它承诺将把购买价格寄回原来的支付方式，并联系那些无法处理退款的客户。\n6月底，North宣布将被谷歌收购，不会发布计划中的第二代设备。\n该公司还表示，将逐步停止去年发布的第一代智能眼镜。\n顾客们发现，这意味着这款智能眼镜将通过该公司网站上发布的一份声明和电子邮件进行发布。\n然而，Focals眼镜附带处方镜片作为选项，这意味着它们可以作为日常处方眼镜使用。笨重的镜框内装有激光器、电池和其他套件，将不再能做普通眼镜不能做的任何事情。\nCCS Insight首席分析师本·伍德(Ben Wood)表示，从云计算硬件中提取功能并不少见-这在他身上以前就发生过。\n他警告说，如果你想成为早期采用者，并享受一家雄心勃勃的初创企业创造的一些有趣的新技术，那么他们总是有无法完成商业计划的风险。\n这可能意味着服务停止工作，或者你最终发现你不得不支付额外的费用来维持服务的连续性。\n有几个能上网的智能设备的例子，当公司改变其商业模式时，它们突然变得无法使用，失去了许多功能，甚至变得无法使用。\n友好的家用机器人Jibo开始告诉它的主人，它的服务器正在关闭，之后它的反应将是有限的-尽管一年多过去了，它仍然在工作。\n扬声器公司索诺斯(Sonos)不得不取消改用老式智能扬声器的计划，这些扬声器将不再接收更新，并最终停止工作。\n智能家居平台Wink最近宣布，之前免费的功能将被锁定在每月订阅之后，限制了功能。\n本周，该公司宣布，如果不收取每年48美元的订阅费，售价399美元的Mlow sous-vide电饭锅将失去其智能功能\n2013年，谷歌(Google)在其谷歌眼镜(Google Glass)产品上进行了一次早期的、但注定要失败的尝试，试图使智能眼镜成为主流。\n在收购North时，谷歌表示，该公司的技术专长将帮助其实现环境计算未来的愿景。\n尽管通知时间很短，但伍德表示，为北方客户提供全额退款的提议格外慷慨，从客户关系的角度来看，这是最好的方式。\n他说，对于谷歌来说，考虑到实际出售给真正终端用户的北方眼镜数量很少，这只是一个舍入误差。", "note_en": "Smart glasses company North has told customers that their $600 (£460) purchases will stop working in a few days&#39; time.\n The Canadian company, recently purchased by Google, says its Focals glasses will cease functioning on Friday.\n From then, owners will not be able to use &#34;any features&#34; of the glasses, or connect to the companion app.\n  It promised to send the purchase price back to the original payment method, and to contact those customers whose refunds it could not process.\n  At the end of June, North announced it was being acquired by Google, and would not release a planned second-generation device.\n It also said it would &#34;wind down&#34; its first generation smart glasses, released last year.\n Customers found out that meant the smart glasses would be rendered &#34;dumb&#34;  through a statement published on the company&#39;s website and by email.\n The Focals glasses, however, come with prescription lenses as an option, meaning they can function as everyday prescription eyewear. The bulky frames, housing a laser, battery, and other kit will no longer do anything that regular spectacles cannot do.\n Ben Wood, chief analyst at CCS Insight, said the pulling of features from cloud-powered hardware is not uncommon - and something that has happened to him before.\n &#34;If you want to be an early adopter and have some fun new tech that an ambitious start-up has created, there&#39;s always a risk that they won&#39;t be able to make the business plan stack up,&#34; he warned.\n &#34;That could either mean the service stops working or you end up finding you have to pay additional charges to maintain service continuity.&#34;\n   There have been several examples of internet-enabled smart devices that are suddenly rendered &#34;dumb&#34;, losing many features or even becoming unusable when the company changes its business model.\n  Friendly home robot  Jibo started telling its owners that its servers were being shut down and its reactions would &#34;be limited&#34; afterwards - though more than a year later,  it is still working\n Speaker firm  Sonos had to reverse plans to &#34;brick&#34; older smart speakers, which will no longer receive updates and  eventually stop working\n Smart home platform  Wink recently announced that previously free features would be locked behind a monthly subscription, limiting functionality\n This week, it was announced  the Mellow $399 sous-vide cooker will lose its smart functionality without a $48-a-year subscription\n  Google made  an early but ill-fated attempt to make smart glasses mainstream with its Google Glass product in 2013.\n When it bought North, Google said the company&#39;s &#34;technical expertise&#34; would help it realise its vision of an &#34;ambient computing&#34; future.\n And despite the short notice, Mr Wood says the offer of a full refund for North customers is &#34;exceptionally generous&#34;, and the best approach from a customer relations point of view.\n &#34;For Google, given the small number of North glasses that were actually sold to real end users, it&#39;s a rounding error,&#34; he said.", "posttime": "2020-07-30 03:33:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,智能,offers,眼镜", "title": "谷歌在智能眼镜停止工作后提供退款", "title_en": "Google Offers Refunds After Smart Glasses Stop Working", "transed": 1, "url": "https://www.bbc.com/news/technology-53581762", "via": "", "real_tags": ["google", "谷歌", "智能", "offers", "眼镜"]}, {"category": "", "categoryclass": "", "imagename": "3e0b6dbffe6370f5bd657c8d75c44c41.jpeg", "infoid": 1015020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透旧金山8月23日电-路透社(Reuters)周三查阅的文件显示，亚利桑那州正在牵头一项由美国多个州组成的调查，调查苹果公司(Apple Inc)故意放慢老款iPhone的速度是否违反了欺骗性贸易行为法。\n上周，一个科技监督组织发布的另一份文件显示，德克萨斯州总检察长可能会就与多州调查有关的此类违规行为起诉苹果，但没有具体说明指控。\n路透社(Reuters)通过公开记录请求获得的文件显示，在至少从2018年10月开始的正在进行的调查中，调查人员要求苹果提供有关iPhone“意外关机”以及该公司通过电源管理软件对设备进行节流或减速的数据。\n亚利桑那州和德克萨斯州的总检察长办公室拒绝置评。苹果没有立即回复记者的置评请求。\n苹果在2017年遭到抨击，当时用于测量手机处理器速度的软件制造商Primate Labs透露，一些iPhone随着年龄的增长变得更慢。\n苹果后来承认，当老化手机的电池难以提供处理器所需的峰值电流时，它降低了电力需求-这会降低处理器的速度。苹果表示，如果没有它的调整，iPhone将因电量激增而意外关闭。\n愤怒的iPhone用户说，这似乎证实了长期以来的怀疑，即苹果放慢了旧设备的速度，以鼓励用户购买新手机。苹果公开道歉，并大幅削减电池更换价格。\n今年早些时候，苹果同意支付高达5亿美元，以了结一起拟议中的与电池问题有关的集体诉讼。", "note_en": "SAN FRANCISCO (Reuters) - Arizona is leading a multi-U.S. state probe into whether Apple Inc’s deliberate slowing of older iPhones violated deceptive trade practice laws, documents reviewed by Reuters on Wednesday showed.\n Last week, a separate document released by a tech watchdog group showed the Texas attorney general might sue Apple for such violations in connection with a multi-state probe, without specifying charges.\n In the ongoing probe since at least October 2018, investigators have asked Apple for data about “unexpected shutdowns” of iPhones and the company’s throttling, or slowing down, of the devices through power management software, documents Reuters obtained through a public records request showed.\n The attorneys general offices in Arizona and Texas declined to comment. Apple did not immediately respond to a request for comment.\n Apple came under fire in 2017 when Primate Labs, the maker of software for measuring a phone’s processor speeds, revealed that some iPhones became slower as they aged.\n Apple later acknowledged that it reduced power demands - which can slow the processor - when an aging phone’s battery struggles to supply the peak current the processor demands. Apple said without its adjustments, iPhones would have unexpectedly shut down from power spikes.\n Outraged iPhone users said that appeared to confirm long-held suspicions that Apple slowed older devices to encourage users to buy new phones. Apple publicly apologized and slashed prices on battery replacements.\n Earlier this year, Apple agreed to pay up to $500 million to settle a proposed class-action lawsuit related to the battery issues.", "posttime": "2020-07-30 03:32:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,iphone,调查,practice", "title": "文件：亚利桑那州股份公司正在领导一项多州调查，调查苹果故意放慢iPhone的速度是否违反了欺骗性的贸易行为法", "title_en": "Documents: Arizona's AG is leading a multi-state probe into whether Apple's deliberate slowing of iPhones violated deceptive trade practice laws", "transed": 1, "url": "https://www.reuters.com/article/us-apple-probe-exclusive/exclusive-arizona-leads-multi-state-probe-into-older-iphones-slowing-shutting-down-idUSKCN24U2YX", "via": "", "real_tags": ["苹果", "apple", "iphone", "调查", "practice"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Debian和Linux社区其他地方的开发人员最近已经意识到GRUB2引导加载程序中存在一个严重问题，该问题允许不良行为者完全绕过UEFI安全引导。Debian Security Advisory4735中描述了该问题的全部细节。本文档的目的是解释此安全漏洞的后果，以及采取了哪些步骤来解决。\nUEFI安全引导(SB)是一种验证机制，用于确保由计算机的UEFI固件启动的代码是可信的。它的设计目的是在操作系统加载之前，在引导过程中保护系统免受恶意代码的加载和执行。\nSB使用加密校验和和签名工作。固件加载的每个程序都包括签名和校验和，并且在允许执行之前，固件将通过验证校验和和签名来验证该程序是可信的。在系统上启用SB时，将不允许任何尝试执行不受信任的程序。这会阻止意外/未经授权的代码在UEFI环境中运行。\n大多数x86硬件出厂时预装了Microsoftkey。这意味着这些系统上的固件将信任由Microsoft签名的二进制文件。大多数现代系统在出厂时都会启用SB-默认情况下，它们不会运行任何未签名的代码，但可以更改固件配置以禁用SB或注册额外的签名密钥。\n与许多其他基于Linux的操作系统一样，Debian使用一个名为shim的程序将这种信任从固件扩展到我们在早期引导期间需要保护的其他程序：GRUB2bootloader、Linux内核和固件更新工具(fwupd和fwupdate)。\n不幸的是，在读取和解析其配置的GRUB2引导加载器代码(grub.cfg)中发现了一个严重的错误。此错误会破坏信任链；通过利用此错误，可以在早期启动期间突破安全环境并加载未签名的程序。这个漏洞是由Eclypium的研究人员发现的，并被命名为BootHole。\n开发人员被要求对GRUB2&39；的源代码进行深入的审计，而不是仅仅修复一个错误。修复一个主要缺陷而不去寻找其他缺陷是不负责任的！一组工程师已经一起工作了几个星期，以确定和修复一系列进一步的问题。我们已经发现，在给定意外输入的情况下，内存分配可能会溢出的几个地方，数学计算中整数溢出可能会引起麻烦的几个地方，以及释放内存后可能使用内存的几个地方。所有这些的补丁都已经在社区中进行了共享和测试。\n在讨论GRUB2漏洞的同时，开发人员还谈到了Linux可能也允许安全引导绕过的情况。在那里发现了两个错误，这两个错误都允许root用户替换锁定系统上的ACPI表，而这是不允许的。已经发布了针对这些问题的修复程序。", "note_en": "Developers in Debian and elsewhere in the Linux community haverecently become aware of a severe problem in the GRUB2 bootloader thatallows a bad actor to completely circumvent UEFI Secure Boot. The fulldetails of the problem are describedin  Debian Security Advisory4735. The aim of this document is to explain the consequences ofthis security vulnerability, and what steps have been taken to addressit.\n   UEFI Secure Boot (SB) is a verification mechanism for ensuring thatcode launched by a computer&#39;s UEFI firmware is trusted. It is designedto protect a system against malicious code being loaded and executedearly in the boot process, before the operating system has beenloaded.\n SB works using cryptographic checksums and signatures. Eachprogram that is loaded by the firmware includes a signature and achecksum, and before allowing execution the firmware will verify thatthe program is trusted by validating the checksum and thesignature. When SB is enabled on a system, any attempt to execute anuntrusted program will not be allowed. This stops unexpected /unauthorised code from running in the UEFI environment.\n Most x86 hardware comes from the factory pre-loaded with Microsoftkeys. This means the firmware on these systems will trust binariesthat are signed by Microsoft. Most modern systems will ship with SBenabled - they will not run any unsigned code by default, but it ispossible to change the firmware configuration to either disable SB orto enrol extra signing keys.\n Debian, like many other Linux-based operating systems, uses a programcalled shim to extend that trust from the firmware to the otherprograms that we need to be secured during early boot: the GRUB2bootloader, the Linux kernel and firmware update tools (fwupd andfwupdate).\n  Unfortunately, a serious bug has been found in the GRUB2 bootloadercode which reads and parses its configuration (grub.cfg). This bugbreaks the chain of trust; by exploiting this bug, it is possible tobreak out of the secured environment and load non-signed programsduring early boot. This vulnerability was discovered by researchers atEclypsium and given the name  BootHole.\n Instead of just fixing that one bug, developers have been prompted todo an in-depth audit of GRUB2&#39;s source code. It would have beenirresponsible to fix one major flaw without also looking for others! Ateam of engineers have worked together for several weeks to identifyand repair a range of further issues. We have found a few places whereinternal memory allocations could overflow given unexpected inputs,several more places where integer overflow in math calculations couldcause trouble, and a few places where memory might be used afterfreeing it. Fixes for all of these have been shared and tested acrossthe community.\n   While discussing the GRUB2 flaws, developers also spoke about caseswhere Linux might also allow Secure Boot bypass. Two bugs wereidentified there, both allowing root to replace ACPI tables on alocked-down system when this should not be permitted. Fixes havealready been released for those issues.", "posttime": "2020-07-30 03:31:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,uefi,签名", "title": "GRUB2 UEFI SecureBoot漏洞：‘BootHole’", "title_en": "GRUB2 UEFI SecureBoot Vulnerability: 'BootHole'", "transed": 1, "url": "https://www.debian.org/security/2020-GRUB-UEFI-SecureBoot/", "via": "", "real_tags": ["漏洞", "uefi", "签名"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索大西洋城算法是一种概率多项式时间算法，至少有75%的时间是正确回答的(或者，在某些版本中，其他值大于50%)。大西洋城这个术语最早是在1982年由J.Finn在一篇题为“质数的概率检验比较”的未发表手稿中提出的。[1]。\n另外两类常见的概率算法是蒙特卡罗算法和拉斯维加斯算法。蒙特卡罗算法总是快速的，但只有可能是正确的。另一方面，拉斯维加斯的算法总是正确的，但可能只是速度快。大西洋城算法是有界概率多项式时间算法，可能是正确的，也可能是快速的。[2]。\n理查德·A·莫林(2003)。RSA和公钥加密。Chapman&Amp；Hall/CRC。第80页。\n威廉·J·特纳(2002年5月)。带Linbox库的黑盒线性代数。北卡罗来纳州立大学。第3页。", "note_en": "Jump to navigation  Jump to search  An  Atlantic City algorithm is a  probabilistic  polynomial time  algorithm that answers correctly at least 75% of the time (or, in some versions, some other value greater than 50%). The term &#34;Atlantic City&#34; was first introduced in 1982 by  J. Finn in an unpublished manuscript entitled  Comparison of probabilistic tests for primality.  [1]\n Two other common classes of probabilistic algorithms are  Monte Carlo algorithms and  Las Vegas algorithms. Monte Carlo algorithms are always fast, but only probably correct. On the other hand, Las Vegas algorithms are always correct, but only probably fast. The Atlantic City algorithms which are bounded probabilistic polynomial time algorithms are probably correct and probably fast.  [2]\n  ^   Richard A. Mollin (2003).  RSA and Public Key Cryptography. CHAPMAN &amp; HALL/CRC. p. 80.\n ^   William J Turner (May 2002).   Black Box Linear Algebra with the Linbox Library. North carolina State University. p. 3 .", "posttime": "2020-07-30 03:31:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,大西洋城,city,概率", "title": "大西洋城算法", "title_en": "Atlantic City Algorithm", "transed": 1, "url": "https://en.wikipedia.org/wiki/Atlantic_City_algorithm", "via": "", "real_tags": ["算法", "大西洋城", "city", "概率"]}, {"category": "", "categoryclass": "", "imagename": "bb482815484dd88c26d8b0d1bfc59671.png", "infoid": 1015017, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "捷蓝航空成为该国首家在清洁工作中使用尖端新紫外光技术作为对抗冠状病毒的手段的航空公司。\n纽约的肯尼迪机场和佛罗里达州的劳德代尔堡-好莱坞国际机场已经被选中试验新的UV系统，以处理捷蓝航空飞机内部的表面。\n捷蓝航空将使用该系统，同时继续使用其他清洁方法。在临床研究中，已发现当适当使用一定水平的紫外光时，能够显著减少某些病毒和细菌，包括SARS-CoV和MERS-CoV。\n这是一种看起来像饮料车和机器人的混合体，但它的目的是帮助继续对抗冠状病毒。\n周三，捷蓝航空(JetBlue)成为美国第一家在清洁工作中使用新的尖端紫外光技术作为对抗冠状病毒的手段的航空公司。\n纽约的肯尼迪机场和佛罗里达州的劳德代尔堡-好莱坞国际机场已经被选中试验新的UV系统，以处理捷蓝航空飞机内部的表面。\n霍尼韦尔的新UV机舱系统正作为捷蓝航空公司飞行员的一部分使用，这标志着美国航空公司首次实施了这项技术。机器人系统可以在不到10分钟的时间内穿越飞机机舱。\n霍尼韦尔UV客舱系统大约有一辆飞机饮料车的大小，有UV-C光臂，可以延伸到座椅顶部并扫过客舱，以处理飞机表面。\n捷蓝航空将使用该系统，同时继续使用其他清洁方法。在临床研究中，已发现当适当使用一定水平的紫外光时，能够显著减少某些病毒和细菌，包括SARS-CoV和MERS-CoV。\n捷蓝航空总裁兼首席运营官乔安娜·杰拉蒂(Joanna Geraghty)表示：“考虑到我们机组人员和客户的安全是我们的首要任务，捷蓝航空的安全从头开始就是通过确保机组人员健康、提供灵活性、增加空间、减少接触点以及保持表面清洁和消毒来保持安全的分层方法。”当我们希望通过利用尖端技术增加额外的保护层时，我们已经确定霍尼韦尔UV舱系统在有效协助我们对船上表面进行消毒方面是一个潜在的游戏规则改变者。“。\n霍尼韦尔已经在捷蓝航空的两个重点城市-纽约的约翰·F·肯尼迪国际机场(John F.Kennedy International Airport)和劳德代尔堡-好莱坞国际机场(Fort Lauderdale-好莱坞International Airport)向捷蓝交付了8台设备。这两个地点启动了为期90天的试点计划。\n霍尼韦尔航空公司总裁兼首席执行官迈克·马德森说：“捷蓝航空在几周前向他们展示这一新产品时，立即就对它产生了兴趣，现在捷蓝航空正在接收我们的第一批系统，”霍尼韦尔航空公司总裁兼首席执行官迈克·马德森(Mike Madsen)说。“我们已经迅速提高了UV客舱系统的产量，我们公司正在研究一系列解决方案，以帮助乘客更舒适地乘坐飞机。”", "note_en": "JetBlue has become the first airline in the country to use new cutting-edge UV light technology in its cleaning efforts as a means to fight the coronavirus.\n JFK Airport in New York, along with Fort Lauderdale-Hollywood International Airport in Florida, have been selected to pilot the new UV system to treat surfaces in JetBlue aircraft interiors.\n JetBlue will be using the system while continuing with other cleaning methods. In clinical studies, ultraviolet light has been found to be capable of significantly reducing certain viruses and bacteria, including SARS-CoV and MERS-CoV, when properly used at certain levels.\n It’s a device that looks like a blend between a beverage cart and a robot, but it is meant to help continue the fight against coronavirus.\n On Wednesday, JetBlue has become the first airline in the country to use new cutting-edge UV light technology in its cleaning efforts as a means to fight the coronavirus.\n JFK Airport in New York, along with Fort Lauderdale-Hollywood International Airport in Florida, have been selected to pilot the new UV system to treat surfaces in JetBlue aircraft interiors.\n  Honeywell’s new UV Cabin System is being used as part of a pilot by JetBlue Airways marking the first time a U.S. airline has implemented the technology. The robotic system can traverse an aircraft cabin in less than 10 minutes.\n The Honeywell UV Cabin System is roughly the size of an aircraft beverage cart and has UV-C light arms that extend over the top of seats and sweep the cabin to treat aircraft surfaces.\n JetBlue will be using the system while continuing with other cleaning methods. In clinical studies, ultraviolet light has been found to be capable of significantly reducing certain viruses and bacteria, including SARS-CoV and MERS-CoV, when properly used at certain levels.\n “Withthe safety of our crewmembers and customers our first priority, JetBlue’sSafety from the Ground Up initiative is maintaining a layered approach tosafety by ensuring healthy crewmembers, providing flexibility, adding space,reducing touchpoints, and keeping surfaces clean and sanitized,” said JoannaGeraghty, JetBlue’s president and COO. “As we look to add additional layers ofprotection by utilizing cutting-edge technology, we have identified theHoneywell UV Cabin System as a potential game changer when it comes toefficiently assisting in our efforts to sanitize surfaces onboard.”\n Honeywell has delivered eight of the devices to JetBlue at two of the airline’s focus cities, John F. Kennedy International Airport in New York and Fort Lauderdale-Hollywood International Airport. These two locations kicked off a 90-day pilot program.\n “JetBluetook an immediate interest in this new product when we demonstrated it for themjust a few weeks ago, and now JetBlue is receiving our first systems,” saidMike Madsen, Honeywell Aerospace president and CEO. “We’ve ramped up productionquickly on the UV Cabin System, and our company is working on a range ofsolutions to help make passengers more comfortable about flying.”", "posttime": "2020-07-30 03:30:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,采用,blue,系统", "title": "捷蓝航空公司采用紫外线清洁机器人", "title_en": "Jet Blue Deploys Ultraviolet Cleaning Robot", "transed": 1, "url": "https://www.nbcnewyork.com/news/coronavirus/jetblue-deploys-ultraviolet-cleaning-robot-at-jfk-airport-in-fight-against-coronavirus/2540269/", "via": "", "real_tags": ["机器人", "采用", "blue", "系统"]}, {"category": "", "categoryclass": "", "imagename": "26490be78637f5471269c91033881a30.jpg", "infoid": 1015016, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员周三表示，GRUB2是世界上使用最广泛的电脑启动程序之一，它存在一个漏洞，可以让攻击者在启动期间更容易运行恶意固件。这将影响数百万甚至可能数亿台机器。虽然GRUB2主要用于运行Linux的计算机，但利用该漏洞的攻击也可以在许多运行Windows的PC上执行。\n这个漏洞是由安全公司Eclypium的研究人员发现的，它对UEFI Secure Boot构成了又一个严重威胁，UEFI Secure Boot是一个行业标准，它使用加密签名来确保启动期间使用的软件受到计算机制造商的信任。Secure Boot旨在防止攻击者通过用恶意软件替换目标软件来劫持引导过程。\n所谓的Bootkit是最严重的感染类型之一，因为它们运行在软件堆栈的最低级别。这使得恶意软件比大多数恶意软件更隐蔽，可以在重新安装操作系统后幸免于难，并可以绕过操作系统内置的安全保护。\n研究人员已将该漏洞命名为Boot Hole，该漏洞源于GRUB2解析grub.cfg(引导加载程序的主要配置文件)中的文本时的缓冲区溢出。通过在文件中添加长文本字符串，攻击者可以溢出分配给文件的内存空间，并导致恶意代码溢出到内存的其他部分，然后在内存的其他部分执行恶意代码。\n配置文件未经过数字签名，因此Secure Boot不会检测到它何时被恶意更改。GRUB2也没有使用操作系统中的标准地址空间布局随机化、数据执行预防和其他反利用保护。这些遗漏使得已经在目标计算机上站稳脚跟的攻击者利用该漏洞变得微不足道。从那里，他们可以完全绕过许多人希望阻止Bootkit站稳脚跟的保护。\n然而，漏洞的严重性可以通过几件事来抵消。首先，攻击者必须拥有对计算机的管理权限或对计算机的物理访问权限。管理员级别的控制在现代操作系统上越来越难获得，因为它们在阻止利用方面取得了重大进展。在越境期间或当用户短暂失去对计算机的物理拥有时的类似时刻，物理访问可能更容易。但在大多数其他情况下，要求都很高，因此不太可能有很多用户受到影响。更重要的是，物理占有极大地限制了攻击的可扩展性。\n让Boot Hole变得不那么可怕的另外两个因素是：已经对计算机进行管理或物理控制的攻击者已经有很多其他方法来感染高级的隐形恶意软件。此外，还有其他几种用于绕过安全引导的已知技术。\nAtredis Partners负责研发的副总裁、软件开发专家HD Moore告诉我：“我认为安全引导不是今天个人电脑安全的基础，因为它很少有效，而且按照他们自己的说法，一年多来很容易绕过它，没有长期解决方案的迹象，”Atredis Partners负责研究和开发的副总裁、软件开发专家HD Moore告诉我，“我认为安全引导不是当今个人电脑安全的基础，因为它很少有效，而且按照他们自己的说法，一年多来很容易绕过它，目前还看不到长期解决方案。”“我不确定GRUB2中的缓冲区溢出有什么用，因为如果grub.cfg是未签名的，还有其他问题。它作为恶意软件载体可能很有用，但即使这样，如果可以使用自定义grub.cfg文件来链加载实际操作系统，也没有理由利用缓冲区溢出。\n其他研究人员似乎也同意这一评估。根据对漏洞的跟踪，CVE-2020-10713的严重级别为中度。\n摩尔提到的Eclypium索赔涉及到2月份撤销了一家引导加载程序安全公司卡巴斯基实验室(Kaspersky Lab)，该公司在启动被禁用的计算机的救援磁盘中使用了该公司的引导加载程序。撤销导致了如此多的问题，以至于监督验证过程的微软回滚了这一更改。这次撤销不仅突显了修补Boot Hole等漏洞的难度(稍后将详细介绍)，而且还强调了这样一个事实，即已经有可能绕过Secure Boot。\n利用的障碍和限制并不意味着漏洞不值得认真对待。Secure Boot正是针对利用Boot Hole所需的方案创建的。受影响的电脑和软件制造商的数量加剧了风险。Eclypium有一份更完整的受影响人员名单。它们是：", "note_en": "GRUB2, one of the world’s most-widely used programs for booting up computers, has a vulnerability that can make it easier for attackers to run malicious firmware during startup, researchers said on Wednesday. This would affect millions or possibly hundreds of millions of machines. While GRUB2 is mainly used in computers running Linux, attacks that exploit the vulnerability can be performed on many PCs running Windows as well.\n The vulnerability,  discovered by researchers from security firm Eclypsium, poses yet another serious threat to  UEFI Secure Boot, an industrywide standard that uses cryptographic signatures to ensure that software used during startup is trusted by a computer&#39;s manufacturer. Secure Boot was designed to prevent attackers from hijacking the boot process by replacing the intended software with malicious software.\n  So-called bootkits are among the most serious types of infections because they run at the lowest level of the software stack. That allows the malware to be stealthier than most malware, survive operating system reinstallations, and circumvent security protections built into the OS.\n Boot Hole, as the researchers have named the vulnerability, stems from a  buffer overflow in the way that GRUB2 parses text in grub.cfg, the boot loader’s main configuration file. By adding long text strings in the file, attackers can overfill the memory space allotted for the file and cause malicious code to spill into other parts of memory, where it then is executed.\n The configuration file isn’t digitally signed, so Secure Boot won’t detect when it has been maliciously altered. GRUB2 also doesn’t use  address space layout randomization,  data execution prevention, and other anti-exploit protections that are standard in operating systems. These omissions make it trivial to exploit the flaw by attackers who already have a foothold on the targeted computer. From there, they can fully bypass a protection many people expect to prevent bootkits from taking hold.\n   The severity of the vulnerability, however, is offset by a few things. First, the attacker must have either administrative rights over the computer or physical access to the machine. Administrator-level control is increasingly hard to gain on modern OSes because of major advances they’ve made to block exploits. Physical access may be easier during border crossings or similar moments when a user briefly loses physical possession of a computer. But the requirement is steep in most other scenarios, making it unlikely many users are affected. What’s more, physical possession greatly restricts the scalability of attacks.\n Two other factors that make Boot Hole less scary: attackers who already have administrative or physical control of a computer already have plenty of other ways to infect it with advanced and stealthy malware. Furthermore, there are several other known techniques for bypassing Secure Boot.\n “I’d argue that Secure Boot is not the foundation of PC security today, because it is rarely effective, and by their [Eclypsium’s] own claim, it has been easy to bypass for over a year now, with no long-term fix in sight,” HD Moore, vice president of research and development at Atredis Partners and an expert in software exploitation, told me. “I’m not sure what the buffer overflow in GRUB2 is useful for, since there are other problems if the grub.cfg is unsigned. “It may be useful as a malware vector, but even then, there is no reason to exploit a buffer overflow when a custom grub.cfg file can be used instead to chain load the real OS.”\n Other researchers seem to agree with the assessment. CVE-2020-10713, as the vulnerability is tracked, has a severity rating of Moderate.\n The Eclypsium claim Moore referred to involves a revocation in February of a bootloader security firm Kaspersky Lab used for in a rescue disk for starting up disabled computers. The revocation caused so many problems that Microsoft, which oversees the validation process,  rolled back the change. The revocation underscores not only the difficulty of patching flaws like Boot Hole (more about that later) but also the fact that it’s already possible to circumvent Secure Boot.\n  The hurdles and limitations of exploitation don’t mean that the vulnerability isn’t worth taking seriously. Secure Boot was created precisely for the scenario required to exploit Boot Hole. The risk is compounded by the number of affected computer and software makers. Eclypsium has a more complete list of those affected. They are:", "posttime": "2020-07-30 03:07:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "绝缘,neuters,计算机", "title": "新的缺陷绝缘器保护靴子，但没有理由恐慌。这就是为什么", "title_en": "New flaw neuters Secure Boot, but there’s no reason to panic. Here’s why", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/07/new-flaw-neuters-secure-boot-but-theres-no-reason-to-panic-heres-why/", "via": "", "real_tags": ["绝缘", "neuters", "计算机"]}, {"category": "", "categoryclass": "", "imagename": "386c643b439616c1e6c089fb82dc627a.jpg", "infoid": 1015015, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天在Y Combinator掌舵的是该公司总裁杰夫·拉尔斯顿(Geoff Ralston)。我们很高兴地告诉大家，拉尔斯顿将于明天中午太平洋时间和我们一起做客Extra Crunch Live。\nExtra Crunch Live是我们的虚拟演讲者系列，每个会议都充斥着来自顶级投资者、领导者和创始人的见解和指导。本次现场问答活动仅限额外的Crunch会员参加，因此请务必在此注册成为会员。\n一年多前，在萨姆·奥尔特曼(Sam Altman)离开公司专注于OpenAI后不久，拉尔斯顿担任了YC总裁一职。\n在那之后的几个月里，Y Combinator不得不重新想象它的运营方式；随着大流行在世界各地蔓延，YC(像许多组织一样)必须弄清楚如何在相距遥远的情况下合作。在大流行的最初几周，这意味着迅速将他们原本面对面的演示日转移到网上；后来，这意味着将整个加速器计划调整为完全远程的。\n虽然拉尔斯顿在总裁职位上仍然是相对较新的，但对YC来说绝不是新的。他于2012年作为合伙人加入加速器，他专注于教育技术的加速器Imagine K12于2016年完全融入YC的运营。", "note_en": "Steering the ship at  Y Combinator   today is its president,  Geoff Ralston  . We’re excited to share that Ralston will be joining us on  Extra Crunch Live tomorrow at noon pacific.\n Extra Crunch Live is our virtual speaker series, with each session packed with insight and guidance from the top investors, leaders and founders. This live Q&amp;A is exclusive to Extra Crunch members, so be sure to  sign up for a membership here.\n Ralston took on the YC President role a little over a year ago shortly after Sam Altman stepped away to  focus on OpenAI.\n In the months since, Y Combinator has had to reimagine much about the way it operates; as the pandemic spread around the world, YC (like many organizations) has had to figure out how to work together while far apart. In the earliest weeks of the pandemic, this meant quickly shifting their otherwise in-person demo day online; later, it meant adapting the entire accelerator program to be completely remote.\n While still relatively new to the president seat, Ralston is by no means new to YC. He joined the accelerator  as a partner in 2012, and his edtech-focused accelerator  Imagine K12 was fully merged into YC’s operations in 2016.", "posttime": "2020-07-30 03:06:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "crunch,yc", "title": "\nExtra Crunch Live：请与Y Combinator的杰夫·罗斯顿(Geoff Ralston)一起参加我们明天中午PDT的问答活动", "title_en": "\n\t\t\t\tExtra Crunch Live: Join our Q&A tomorrow at noon PDT with Y Combinator’s Geoff Ralston\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/29/extra-crunch-live-join-our-qa-tomorrow-at-noon-pdt-with-y-combinators-geoff-ralston/", "via": "", "real_tags": ["crunch", "yc"]}, {"category": "", "categoryclass": "", "imagename": "29dd234129a2bb758f0250d4cbda7d6b.jpg", "infoid": 1015014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容2012年2月下旬，Facebook首席执行官马克·扎克伯格给首席财务官大卫·埃伯斯曼发了一封电子邮件，提出收购规模较小的竞争对手的想法，包括Instagram和Path。他写道：“这些业务是新兴的，但已经建立的网络，这些品牌已经很有意义了，如果它们大规模增长，可能会对我们产生非常大的颠覆性影响。”“考虑到我们认为自己的估值相当激进，而且我们在移动领域很脆弱，我很好奇我们是否应该考虑收购其中的一两家。你觉得呢？“。\n埃伯斯曼对此表示怀疑。他在回信中写道：“我看到的所有研究都表明，大多数交易都未能创造出收购者期望的价值。”“我会要求你找到一份令人信服的说明，说明你试图实现的目标。”埃伯斯曼接着列出了收购公司的四个潜在原因，以及他对每一个原因的看法：中和竞争对手、获取人才、整合产品以改进Facebook服务，以及“其他”。\n扎克伯格在回复中说，这是中和竞争对手和改进Facebook的结合。“围绕着社会产品和有限数量的不同社会机制需要发明网络效应。一旦有人在某个特定的机械师上获胜，其他人就很难在不做一些不同的事情的情况下取代他们。\n扎克伯格继续说：“看待这一问题的一种方式是，我们真正购买的是时间。即使一些新的竞争对手如雨后春笋般涌现，现在收购Instagram、Path、Foursquare等，也会给我们一年或更长时间来整合它们的动态，然后才会有人再次接近它们的规模。在这段时间内，如果我们将他们使用的社会机制纳入其中，这些新产品将不会获得太多吸引力，因为我们已经大规模部署了他们的机制。“。\n他写道：“我的意思不是说我们会购买它们，以防止它们以任何方式与我们竞争。”\n今天，在众议院反垄断小组委员会就技术领域的反垄断问题举行的听证会上，扎克伯格和埃伯斯曼之间的电子邮件被披露，纽约州民主党众议员杰里·纳德勒(Jerry Nadler)就收购Instagram一事询问扎克伯格。委员会辩称，这些电子邮件，以及2012年的其他几条消息和文件显示，Facebook-尤其是扎克伯格-希望收购Instagram，以避免竞争。\n“Facebook自己承认...。将Instagram视为一个威胁，可能会将业务从Facebook抽走，“纳德勒在周三的听证会上表示。“因此，Facebook没有与之竞争，而是买下了它。这正是反垄断法旨在防止的反竞争收购行为。“。\n根据该委员会的说法，就不阻止公司与Facebook竞争一事做出澄清，本身就是扎克伯格知道他透露了太多信息的证据-这是一次精心策划的倒退，旨在帮助该公司避免未来对这笔交易的审查。(在向国会议员展示这些电子邮件时，反垄断委员会的律师给幻灯片贴上了“哎呀！”的标签。)\n到2012年4月初，扎克伯格正在朝着达成协议的方向迈进。“我只需要决定是否要收购Instagram，”他在提出收购Instagram的几天前发出的一系列电子邮件中写道。他写道：“Instagram可以在不成为大企业的情况下，对我们造成有意义的伤害。”他补充说，相比之下，如果Facebook没有收购Pinterest或Foursquare，而他们成功了，“我们只会后悔没有”在内部做到这一点。“我们在某种程度上已经在努力建造某种版本的Foursquare了。”\n根据该委员会的说法，这些电子邮件证明扎克伯格将Instagram视为对公司的潜在生存威胁-清楚地表明，这位首席执行官采取行动收购这款新兴应用是为了将Facebook与当前和未来的竞争隔离开来。Facebook方面表示，Instagram在某些方面与Facebook竞争，但也对其核心功能进行了补充。\n扎克伯格周三对国会表示：“我已经很清楚，Instagram是移动照片分享领域的竞争对手。”“当时还有很多其他人。他们与VSCO Cam和PicPlz等应用程序以及Path等公司展开竞争。它是我们存在的整个连接空间的一个子集。通过让他们加入我们，他们肯定从移动相机领域的竞争者变成了一款我们可以帮助发展、帮助更多人能够使用的应用程序。“。\n在Instagram被收购之前，它在硅谷非常受欢迎，Facebook并不是唯一有兴趣收购它的竞标者。Twitter在最初的日子里通过让用户在Instagram上找到他们使用Twitter的朋友，极大地帮助了Instagram，现在它积极地推销收购Instagram。正如莎拉·弗里尔(Sarah Frier)今年在她的书“没有过滤器”(No Filter)中所报道的那样，Twitter向该公司提供了价值5亿至7亿美元的股票。\n但Instagram联合创始人凯文·希斯特罗姆拒绝了这一提议，2012年4月的第一周，扎克伯格打电话提出收购该公司及其13名员工。由马特·科勒(Matt Cohler)领导的希斯特罗姆董事会鼓励他参加这次会议。科勒曾是Facebook的一名员工。当时，Facebook正在为首次公开募股(IPO)做准备，它还没有想好如何将其庞大的台式网络用户受众转移到正在迅速变得无处不在的移动电话上。\n“如果我们不能创造出能杀死Facebook的东西，就会有别的东西来。”\n当他们见面时，扎克伯格向希斯特罗姆提供了Twitter没有的东西：相对独立。作为加入Facebook的交换，公司将给他巨大的资源来建立Instagram，并让他作为首席执行官运营Instagram。据“福里尔”报道，希斯特罗姆对此表示同意，他与董事会分享的原因之一是，“如果Facebook采取措施复制Instagram或直接针对这款应用，这将使其增长变得更加困难。”Facebook的新员工入职指南中有这样一句话，“如果我们不能创造出能杀死Facebook的东西，就会有别的东西来。”\n众所周知，Systrom以10亿美元的价格出售了该公司，尽管最终收购价为7.15亿美元，因为这笔交易是在Facebook以动荡著称的首次公开募股(IPO)之后完成的，当时该公司的股票已经损失了大部分价值。(它恢复了！)。这笔交易经过了联邦贸易委员会(Federal Trade Commission)的标准审查，每家公司都聘请了自己的律师，以寻找任何证据证明这笔交易是反竞争的，不应获得批准。Facebook辩称，它没有与Instagram直接竞争-但最近推出的照片分享应用Facebook Camera确实与Instagram竞争，而且是市场上数十款照片分享应用之一。\n这种做法巧妙地搁置了Instagram的真正战略价值，即帮助Facebook积累世界上最大的用户基础，并围绕这些用户基础建立起占主导地位的广告业务。而这一价值并不是很明显；当交易宣布时，CNN认为扎克伯格“为一家热闹但没有商业模式的初创公司付出了高昂的价格”。\n扎克伯格的电子邮件表明，他比监管机构更清楚收购Instagram对Facebook的价值。\n联邦贸易委员会拒绝起诉，部分原因是自20世纪60年代以来的反垄断监管一直基于消费者损害的想法，这在很大程度上是通过价格上涨来衡量的。由于Facebook和Instagram都免费提供服务，联邦贸易委员会认为很难证明这笔交易会损害消费者。国会反垄断听证会的一个可能结果是对这一标准进行细化，以更严格地审查这样的交易。\nFacebook和Instagram在2012年都比今天小得多，当时还不清楚Instagram，特别是Instagram，会不会演变成比照片分享应用大得多的东西。近年来，随着它的用户激增超过10亿，它实际上成为了最初Facebook的续集-一个多用途的社交网络，其受众比其母公司年轻得多。\n“我认为联邦贸易委员会拥有所有这些文件……。并在当时一致投票决定不对收购提出挑战，“扎克伯格周三表示。“事后看来，Instagram可能会达到今天的规模，这一点看起来很明显。但在当时，这一点远非显而易见。“。\n联邦贸易委员会在2012年夏天完成了对这笔收购的审查，没有举行任何公开听证会，也没有发布公开报告。该机构指出，“在公共利益可能需要的情况下”，它可能会在未来某个未指明的日期重启调查。\n英国公平贸易办公室(Office Of Fair Trading)也对这笔交易进行了审查，加州公司部(California Department Of Companies)也进行了审查-这是一个罕见的举动。两人都没有找到任何理由阻止这笔交易。在收购后的几个月内，Instagram及其8000万用户属于Facebook。\n尽管如此，扎克伯格的电子邮件表明，他比监管机构更清楚收购Instagram-以及其他竞争对手的初创公司-对Facebook的价值有多大。\n2012年1月，一名高级工程师在Facebook内部帖子中写道：“Google+是在转移注意力。”“当Instragram和Pinterest这样的公司加速发展，创造我们本应预见到的新市场时，我们正被一个低劣的克隆产品分散了注意力。”\nInstagram交易完成后，扎克伯格给这位工程师发了电子邮件，提到了这篇帖子。“我记得你的内部帖子，说Instagram是我们的威胁，而不是Google+，”他说。“你基本上是对的。初创公司的一个特点是，你经常可以收购它们。\n扎克伯格给另一名员工发电子邮件祝贺他收购Instagram，“人们低估了关注谷歌的重要性，因为我们很可能总是会收购任何有竞争力的初创公司。”“但我们要买下谷歌还需要一段时间.”", "note_en": "Skip to main content                                                                                                                In late February 2012, Facebook CEO Mark Zuckerberg emailed his chief financial officer, David Ebersman, to float the idea of buying smaller competitors, including Instagram and Path. “These businesses are nascent but the networks established, the brands are already meaningful, and if they grow to a large scale the could be very disruptive to us,” he wrote. “Given that we think our own valuation is fairly aggressive and that we’re vulnerable in mobile, I’m curious if we should consider going after one or two of them. What do you think?”\n Ebersman was skeptical. “All the research I have seen is that most deals fail to create the value expected by the acquirer,” he wrote back. “I would ask you to find a compelling elucidation of what you are trying to accomplish.” Ebersman went on to list four potential reasons to buy companies and his thoughts on each: neutralizing a competitor, acquiring talent, integrating products to improve the Facebook service, and “other.”\n It’s a combination of neutralizing a competitor and improving Facebook, Zuckerberg said in a reply. “There are network effect around social products and a finite number of different social mechanics to invent. Once someone wins at a specific mechanic, it’s difficult for others to supplant them without doing something different.”\n  Zuckerberg continued: “One way of looking at this is that what we’re really buying is time. Even if some new competitors springs up, buying Instagram, Path, Foursquare, etc now will give us a year or more to integrate their dynamics before anyone can get close to their scale again. Within that time, if we incorporate the social mechanics they were using, those new products won’t get much traction since we’ll already have their mechanics deployed at scale.”\n  “I didn’t mean to imply that we’d be buying them to prevent them from competing with us in any way,” he wrote.\n  The emails between Zuckerberg and Ebersman were revealed today during the House antitrust subcommittee’s hearing on antitrust issues in tech, as Rep. Jerry Nadler (D-NY) questioned Zuckerberg about the Instagram acquisition. The emails, along with several other messages and documents from 2012, show that Facebook — and Zuckerberg, in particular — wanted to buy Instagram to avoid competition, the committee argued.\n “Facebook, by its own admission ... saw Instagram as a threat that could potentially siphon business away from Facebook,” Nadler said during the hearing on Wednesday. “So rather than compete with it, Facebook bought it. This is exactly the type of anti-competitive acquisition the antitrust laws were designed to prevent.”\n Sending a clarification about not preventing companies from competing with Facebook is itself evidence that Zuckerberg knew he’d revealed too much, according to the committee — a calculated walkback intended to help the company avoid future scrutiny of the deal. (In a presentation of the emails to members of Congress, the antitrust committee’s lawyers labeled the slide “Whoops!”)\n By the beginning of April 2012, Zuckerberg was moving toward a deal. “I just need to decide if we’re buying Instagram,” he wrote in a series of emails sent days before he made the offer to buy the company. “Instagram can hurt us meaningfully without becoming a huge business,” he wrote. By contrast, if Facebook didn’t buy Pinterest or Foursquare and they succeeded, “we’ll just regret not doing them” internally, he added. “We’re kind of already working on building some version of Foursquare.”\n   The emails are evidence that Zuckerberg viewed Instagram as a potential existential threat to the company, according to the committee — clear statements that the CEO moved to buy the upstart app to insulate Facebook from current and future competition. For its part, Facebook has said that Instagram competed with some aspects of Facebook but also complemented its core features.\n “I’ve been clear that Instagram was a competitor in the space of mobile photo sharing,” Zuckerberg told Congress on Wednesday. “There were a lot of others at the time. They competed with apps like VSCO Cam and PicPlz and companies like Path. It was a subset of the overall space of connecting that we exist in. And by having them join us, they certainly went from being a competitor in the space of being a mobile camera to an app that we could help grow and to help get more people to be able to use.”\n Instagram was hugely popular within Silicon Valley before it was acquired, and Facebook was not the only bidder interested in acquiring it. Twitter, which had helped Instagram immensely in its earliest days by letting users find their Twitter-using friends on the app, made an aggressive pitch to buy the company. As Sarah Frier reported this year in her book  No Filter, Twitter offered the company stock worth between $500 million and $700 million.\n But Instagram co-founder Kevin Systrom rejected the offer, and the first week of April 2012, Zuckerberg called and offered to acquire the company and its 13 employees. Systrom’s board — led by Matt Cohler, an early former Facebook employee — encouraged him to take the meeting. At the time, Facebook was preparing for its initial public offering, and it had not yet figured out how it would transport its large audience of desktop web users to the mobile phones that were rapidly becoming ubiquitous.\n “If we don’t create the thing that kills Facebook, something else will.”\n When they met, Zuckerberg offered Systrom something Twitter didn’t: relative independence. In exchange for joining Facebook, the company would give him enormous resources with which to build Instagram and let him run it as CEO. Systrom agreed, and among the reasons he shared with his board was “if Facebook took measures to copy Instagram or target the app directly, that would make it a lot more difficult to grow,” Frier reported. Facebook’s orientation guide for new employees contained the sentence, “If we don’t create the thing that kills Facebook, something else will.”\n Systrom famously sold the company for $1 billion, though the final purchase price was $715 million, as the deal closed in the aftermath of Facebook’s famously rocky IPO, when the company’s stock had lost much of its value. ( It recovered!) The deal underwent a standard review by the Federal Trade Commission in which each company hired its own lawyers to look for any evidence that the deal was anti-competitive and should not be approved. Facebook argued that it did not compete with Instagram directly — but that Facebook Camera, a recently launched photo sharing app, did and was one of dozens of photo sharing apps on the market.\n This approach neatly set aside the true strategic value of Instagram, which lay in helping Facebook amass the largest user base in the world, around which it would go on to build a dominant advertising business. And that value was not widely apparent; when the deal was announced, CNN opined that Zuckerberg was “ paying a steep price for a startup that has lots of buzz but no business model.”\n Zuckerberg’s emails suggest he knew better than regulators how valuable acquiring Instagram would be for Facebook\n The FTC declined to prosecute, in part because antitrust regulation since the 1960s has been based on the idea of consumer harm, measured largely through price increases. Because both Facebook and Instagram offered their services for free, the FTC believed it would have difficulty proving that the deal would harm consumers. One probable outcome of the congressional antitrust hearing is a refinement of that standard to more closely scrutinize deals like these.\n Both Facebook and Instagram were much smaller in 2012 than they are today, and it was then unclear that Instagram, in particular, would evolve to become something much bigger than a photo sharing app. In recent years, as it surged past 1 billion users, it effectively became a sequel to the original Facebook — an all-purpose social network with a much younger audience than its parent company.\n “I think the FTC had all of these documents ... and unanimously voted at the time not to challenge the acquisition,” Zuckerberg said on Wednesday. “In hindsight, it probably looks obvious that Instagram would have reached the scale that it has today. But at the time, it was far from obvious.”\n The FTC completed its review of the acquisition in the summer of 2012 without holding any open hearings or issuing a public report. The agency noted it might reopen the inquiry at an unspecified future date, “as the public interest may require.”\n The United Kingdom’s Office of Fair Trading also reviewed the deal, as did — in a rare move — the California Department of Corporations. Neither found any reason to block the deal. Within a few months of the acquisition, Instagram and its 80 million users belonged to Facebook.\n  Still, Zuckerberg’s emails suggest he knew better than regulators how valuable acquiring Instagram — and other competitive startups — would be for Facebook.\n “Google+ is a red herring,” a senior engineer wrote in an internal Facebook thread in January 2012. “We are getting distracted by a shitty clone while guys like Instragram and Pinterest ramp up and create new markets that we should’ve seen coming.”\n After the Instagram deal closed, Zuckerberg emailed the engineer, referencing the post. “I remember your internal post about how Instagram was our threat and not Google+,” he said. “You were basically right. One thing about startups is you can often acquire them.”\n “One reason people underestimate the importance of watching Google is that we can likely just always buy any competitive startups,” Zuckerberg emailed another employee who wrote to congratulate him on the Instagram acquisition. “But it’ll be a while before we can buy Google.”", "posttime": "2020-07-30 03:06:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电子邮件发送,zuckerberg,facebook", "title": "马克·扎克伯格通过电子邮件发送大纲计划，以中和竞争对手", "title_en": "Mark Zuckerberg Emails Outline Plan To Neutralize Competitors", "transed": 1, "url": "https://www.theverge.com/2020/7/29/21345723/facebook-instagram-documents-emails-mark-zuckerberg-kevin-systrom-hearing", "via": "", "real_tags": ["电子邮件发送", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "480a44b7bd89aa01a637d2a19964bd6c.jpg", "infoid": 1015013, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Snapchat周三发布了有史以来第一份多元化报告，报告显示，在有色人种和女性的平等代表性方面，该公司仍略落后于同行，尤其是在其技术团队中，但它在增加女性领导团队方面取得了进展。\n重要原因：这家总部位于洛杉矶、成立9年的科技公司花了一段时间才公开承认自己在纸面上存在的多样性缺陷。但过去几年发生的事件，比如创始人埃文·斯皮格尔(Evan Spiegel)兄弟会期间泄露的电子邮件，以及向下岗女性支付的和解款项，都促使该公司在最近几年更加认真地对待这一问题。\n大局：这份报告发布的同时，Facebook、谷歌、亚马逊和苹果这四家科技同行的首席执行官正在国会山就反垄断问题作证，吸引了记者和科技行业的大部分注意力。这份报告发布的同时，Facebook、谷歌、亚马逊和苹果这四家科技同行的首席执行官正在国会山就反垄断问题作证，吸引了记者和科技行业的大部分注意力。\n细节：报告发现，虽然某些团队的性别差异很明显，但Snapchat已经做出了一些改进。\n女性在Snapchat技术团队中的比例仍然只有16%，在技术团队领导层中的比例也只有7%。\n总体而言，2019年Snap全球劳动力中女性占比为32.9%，较2018年增长0.9%。该公司表示，它增加了更多的女性担任领导职务，也保留了更多的女性。\n在Snap的美国业务中，黑人和西班牙裔的比例偏低，分别占员工总数的4.1%和6.8%。2019年，这些人群在Snap的总体代表性分别增长了0.6%和0.5%。\n总体而言，Snapchat的领导层(董事+级别)是70.4%的白人，16.5%的亚裔，2.6%的黑人/非裔美国人，2.6%的西班牙裔/拉丁裔，0.9%的夏威夷原住民/太平洋岛民，7.0%的多种族。\nSnapchat的高级领导团队(VP+)74.2%是白人，12.9%是亚裔，3.2%是黑人/非裔美国人，3.2%是西班牙裔/拉丁裔，6.5%是多种族。\n看点：Snapchat承诺在未来三年实现新的多元化目标。\n它的目标是到2023年将科技行业的女性人数翻一番，到2025年将Snap未被充分代表的美国种族和少数民族人数翻一番。\n言外之意：多样性报告与Snapchat的第一份公开报告“公民快照”同时发布，该报告详细介绍了Snapchat解决环境和社区问题的工作，包括碳足迹和生活工资承诺。\nSnapchat表示，它正在通过减少能源消耗和购买合格的补偿来使其应用程序实现碳中性。\n该公司表示，它承诺每年向在其总部工作的所有员工支付超过7万美元的薪酬。", "note_en": "Snapchat on Wednesday released its first-ever diversity report, showing that the company is still slightly behind its peers in terms of equal representation of people of color and women, especially on its technology teams, but that it&#39;s made progress adding more women to its leadership team.\n Why it matters: It&#39;s taken a while for the nine-year-old Los Angeles-based tech firm to publicly confront its diversity shortcomings on paper. But incidents in the past few years, like  leaked emails from founder Evan Spiegel&#39;s fraternity days to  settlement payouts to laid off women, have pushed the firm to take the issue much more seriously in recent years.\n The big picture: The report was released at the same time that the CEOs of four of its tech peers — Facebook, Google, Amazon and Apple — were testifying on Capitol Hill about antitrust, capturing most of the attention of reporters and the tech industry.\n Details: The report finds that while gender disparities are stark on certain teams, Snapchat has made some improvements.\n Women still only make up 16% of Snapchat&#39;s tech teams and just 7% of its tech teams’ leadership.\n Overall, women made up 32.9% of Snap’s global workforce in 2019, an increase of 0.9% from 2018. The company says it&#39;s added more women to leadership roles and has retained more as well.\n Black and Hispanic people are underrepresented in Snap’s U.S. business, representing 4.1% and 6.8% of the workforce, respectively. In 2019, overall representation of these populations at Snap increased 0.6% and 0.5%, respectively.\n Overall, Snapchat&#39;s leadership (Director+ level) is 70.4% white, 16.5% Asian, 2.6% Black/African American, 2.6% Hispanic/Latino, 0.9% Native Hawaiian/Pacific Islander, and 7.0% multiracial.\n Snapchat&#39;s senior leadership team (VP+) is 74.2% white, 12.9% Asian, 3.2% Black/African American, 3.2% Hispanic/Latino and 6.5% multiracial.\n What to watch: Snapchat has committed to new diversity goals in the next three years.\n It&#39;s aiming to double the number of women in tech by 2023 and double the number of underrepresented U.S. racial and ethnic minorities at Snap by 2025.\n Between the lines: The diversity report was released in conjunction with Snapchat&#39;s first public &#34;CitizenSnap&#34; report, which details its work addressing environmental and community problems, including its carbon footprint and living wage commitment.\n Snapchat says it&#39;s making its app carbon neutral &#34;by cutting its energy use and buying qualified offsets.&#34;\n It says it&#39;s committed to paying more than $70,000 per year to all employees working at its headquarters.", "posttime": "2020-07-30 03:05:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,职位,roles,女性", "title": "Snap发布了其首份多元化报告：4.1%是黑人，6.8%是西班牙裔；女性在公司中占32.9%，在技术职位中占16%，在领导职位中占7%", "title_en": "Snap releases its first diversity report: 4.1% are Black, 6.8% are Hispanic; women make up 32.9% of the company, 16% of technical roles, 7% of leadership roles", "transed": 1, "url": "https://www.axios.com/snapchat-diversity-report-8a912bb5-b1e4-4010-89a6-6d83e3980d6d.html", "via": "", "real_tags": ["发布", "职位", "roles", "女性"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015012, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Ahold Delhaize美国公司的服务公司零售商务服务公司宣布，獾技术公司™将推出近500台多用途机器人，作为服务提供给东海岸的巨人/马丁和Stop&Amp；Shop杂货店。这些创新的机器人被认为是杂货零售业最大(如果不是最大的话)自主机器人的推出之一，它可以自动检测危险并改善店内运营，同时提高审计和合规报告的水平。在这一重要里程碑之前的一年里，獾技术公司(Badger Technologies)的机器人(被亲切地称为“马蒂”)穿过商店过道，寻找溢出、障碍物、碎片或任何可能给顾客和商店员工带来潜在安全风险的东西。一年来，獾技术公司的机器人精心策划并成功完成了试点工作。配备了导航系统、高分辨率摄像头、大量传感器和强大的软件，马蒂不知疲倦地扫描商店过道和货架，寻找任何不安全的条件。\n我们很高兴能成为这一重大机器人部署的一部分，并帮助Ahold Delhaize USA品牌展示多用途机器人如何改变食品杂货零售环境。通过使货架、过道和地板更安全，Marty使Ahold Delhaize美国本土品牌能够改善风险管理。\n一旦发现潜在的危险，这些漫游机器人就会向门店经理发送实时警报，因此问题可以很快得到纠正。此外，机器人还充当移动数据收集系统，用于存档信息和图像，包括日期和时间戳，以提高风险管理，帮助巨人/马丁和Stop&amp；Shop提高运营效率。\n此外，在机器人的连续商店循环期间收集的数据可以很容易地扩展，以解决缺货、平面图合规性和价格完整性问题。此外，Marty的持续数据捕获结果可以按需以定制报告或仪表板的形式提供，并可以无缝地融入现有的运营、供应链和ERP系统中，以获得可操作的业务洞察力。獾技术公司和零售商业服务公司共同将店内创新提升到一个新的水平，使用这一经过充分测试和验证的自动化零售解决方案。我们很高兴能与巨人/马丁和Stop&amp；Shop合作，部署同类产品中规模最大的机器人。此外，我们同样高兴地看到，当各个年龄段的购物者看到马蒂向他们滚动时，他们都会微笑，因为我们知道，仅仅是他的出现，就是为了让他们的商店之行成为一种更安全、更有意义的体验。蒂姆·罗兰(Tim Rowland)是捷普(Jabil)产品部门美獾技术公司(Badger Technologies)的首席执行官。", "note_en": "Today, Retail Business Services, the service company of Ahold Delhaize USA, announced the  rollout of nearly 500 multi-purpose robots from Badger Technologies™, which it is providing as a service to GIANT/MARTIN’S and Stop &amp; Shop grocery stores on the East Coast. Considered one of the largest—if not the largest—rollout of autonomous robots in the grocery retail industry, these innovative robots automate hazard detection and improve in-store operations while elevating audits and compliance reporting.  This major milestone follows a year of carefully orchestrated and successfully completed pilots where Badger Technologies’ robots, affectionately dubbed “Marty,” traversed store aisles looking for spills, obstacles, debris or anything that could impose potential safety risks for customers and store employees. Equipped with navigation systems, high-resolution cameras, a multitude of sensors and powerful software, Marty tirelessly scanned store aisles and shelves for any unsafe conditions.\n  We’re thrilled to be part of this major robot deployment and help Ahold Delhaize USA brands demonstrate how multi-purpose robots can transform grocery retail environments. By keeping shelves, aisles and floors safer, Marty enables Ahold Delhaize USA’s local brands to improve risk management.\n   Upon spotting a potential hazard, these roving robots sent real-time alerts to store managers, so issues could be quickly rectified. Additionally, the robots served as mobile data collection systems to archive information and images, including date and time stamps, for elevated risk management to help GIANT/MARTIN’S and Stop &amp; Shop improve operational efficiencies.\n Additionally, data gathered during the robots’ continuous store loops can be extended easily to address out-of-stock, planogram compliance and price integrity issues. What’s more, the results of Marty’s constant data capture can be delivered on-demand as custom reports or dashboards, as well as ingested seamlessly into existing operational, supply chain and ERP systems for actionable business insights.  Together, Badger Technologies and Retail Business Services are taking in-store innovation to the next level with this fully tested and verified automated retail solution. We’re excited to partner with GIANT/MARTIN’S and Stop &amp; Shop in deploying the largest robot rollout of its kind. Plus, we’re equally happy to see shoppers of all ages smile when they see Marty rolling toward them, knowing that his mere presence is designed to make their visits to the store a safer and more rewarding experience.  Tim Rowland is CEO of  Badger Technologies, a product division of Jabil.", "posttime": "2020-07-30 03:04:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,robots", "title": "自主机器人规则：杂货业最大规模的推广", "title_en": "Autonomous Robots Rule: Largest Rollout in Grocery Industry", "transed": 1, "url": "https://www.badger-technologies.com/blog/autonomous-robots-rule.html", "via": "", "real_tags": ["机器人", "robots"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1015011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很高兴地宣布Ruby3的新类型签名语言RBS。Ruby3长期声明的目标之一是添加类型检查工具。在与Matz和Ruby提交者团队进行了大量讨论之后，我们决定逐步增加一种名为“RBS”的基础类型签名语言，该语言将随Ruby3一起发布，并附带stdlib的签名。RBS命令行工具也将随Ruby3一起提供，因此您可以为自己的Ruby代码生成签名。\n类型化与非类型化对于编程语言来说是一个有30年历史的问题。类型化语言适用于较大的项目，但通常灵活性较差。非类型化语言允许快速开发，但使用它们扩展团队和代码库可能很困难。\n编程语言设计人员意识到了这些权衡，并试图结合其他语言的功能来抵消这一点。C#有一个称为动态的功能，它可以将类型检查从编译时延迟到运行时。在编译时允许赋值和读取任何类型的值，但可能会引发运行时错误以确保安全性。这几乎等同于非类型化语言！反之亦然？我们看到非类型化语言类型检查选项(PHP、Python)。我们也有生产中使用的非类型化语言的类型化方言(打字稿)。\nMatz早在四年前就宣布Ruby3将支持静态类型检查。在看到多个社区开发的类型检查器之后，Ruby提交者团队决定为社区构建类型检查器建立一个基础。Ruby3将提供为Ruby程序编写类型签名的能力，以及为Ruby标准库编写内置类型签名的能力。标准类型签名语言将使Ruby代码中的类型定义在类型检查器之间可移植，并鼓励社区为他们的gem和应用程序编写类型。\n我们为Ruby3定义了一种名为RBS的新语言，用于类型签名。签名是在.rbs文件中编写的，这与Ruby代码不同。您可以认为.rbs文件类似于TypeScript中的.d.ts文件或C/C++/objc中的.h文件。拥有不同文件的好处是不需要更改Ruby代码就可以开始类型检查。您可以安全地选择加入类型检查，而无需更改工作流的任何部分。\n#sig/merchant.rbsclass Merchant attr_read内标识：string attr_read名称：string attr_read Employees：array[Employee]def Initialize(Token：String，Name：String)-&gt；void def each_Employee：(){(Employee)-&gt；void}-&gt；void|()-&gt；枚举器[Employee，void]end。\nRbs文件定义了一个名为Merchant的类，它有助于读者理解该类的概述。\n该类有三个属性Token、Name和Employees。令牌和名称的类型为字符串。RBS还支持像Array这样的泛型类，我们可以从Employees属性的type中看到这一点。它是一组员工。\nRBS还描述了类中定义的方法及其类型。该类定义了Initialize和Each_Employee方法。Initialize方法需要将Token和Name作为关键字参数。Each_Employee方法接受一个块，或者返回一个枚举器实例。\nRBS是一种描述Ruby程序结构的语言。它为开发人员概述了代码以及定义了哪些类和方法。最大的好处是可以根据实现及其执行来验证类型定义！\n像Ruby这样的动态类型语言的类型系统开发不同于顺序静态类型语言。世界上已经有很多Ruby代码，Ruby的类型系统应该支持尽可能多的Ruby代码。\n这迫使类型系统设计者在与现有代码兼容的复杂性和正确性上做出妥协。我们可能不得不引入类型检查器功能来支持现有Ruby代码中可能不正确的模式。但是，添加功能会使类型系统变得复杂且难于理解。因此，我们将重点放在最重要的代码模式上，以最大限度地降低类型系统的复杂性。\n我们可以展示Ruby代码的两个重要特征，以及如何为它们指定类型。\n鸭子类型是Rubysts中流行的编程风格，它假定对象将响应特定的方法集。鸭子类型的好处是灵活性。它不需要继承、混合或实现声明。如果一个对象有一个特定的方法，它就可以工作。问题是，这个假设隐藏在代码中，使得代码很难一目了然。\n为了适应鸭子类型，我们引入了接口类型。接口类型表示一组独立于具体类和模块的方法。\n如果我们想定义一个需要一组特定方法的方法，我们可以用接口类型编写它。\nInterface_Appendable#需要`&lt；&lt；`运算符，该运算符接受`String`对象。Def&lt；&lt；：(String)-&gt；voidend#传递`Array[string]`或`IO`起作用。#传递`TrueClass`或`Integer`不起作用。def append：(_Appendable)-&gt；string。\n这比传统的鸭子类型要好，因为它定义了类或模块期望实现的显式接口，并为文档和编辑器插件提供了提示，以便将以前隐式的接口公开为可靠的、可操作的文档。\n非一致性是让表达式具有不同类型的值的另一种代码模式。它在Ruby中也很受欢迎，并介绍了：\nCLASS COMMENT#注释可以由用户或Bot定义作者进行：()-&&gt;；(User|Bot)#带/不带块的两个重载def Each_Reply：()-&gt；枚举器[COMMENT，void]|{(COMMENT)-&gt；void}-&gt；void...end。\n我们提供了一种编写类型的语言。那么，我们能对苏格兰皇家银行的文件做些什么呢？\n以下是拥有类型的主要好处列表。我们可以在RBS文件中编写类型，这些工具将通过以下方式帮助您编写Ruby代码：\n查找更多错误：我们可以检测到未定义的方法调用、未定义的常量引用，以及动态语言可能遗漏的更多内容。\nNil安全性：基于RBS的类型检查器具有可选类型的概念，即允许值为Nil的类型。类型检查器可以检查表达式是否为空，并为nil：NilClass`发现未定义的方法(save！)&#39；。\n更好的IDE集成：解析RBS文件可以让IDE更好地理解Ruby代码。方法名称完成运行得更快。动态错误报告检测到更多问题。重构可以更可靠！\n引导式鸭子分类：接口类型可以用于鸭子分类。它帮助API用户更准确地了解他们可以做什么。这是一个更安全的鸭子类型版本。\n当然，这些都不是免费的。我们如何为RBS构建工具，使开发人员可以更轻松地开始使用它？\n我们在RBS之上开发了静态类型检查器。Stop是用Ruby实现的静态类型检查器，它基于RBS。Solbet是一个静态类型检查器，它有自己的类型定义语言RBI，但计划在未来支持RBS。\n我们还在开发和开发其他工具，以扩展苏格兰皇家银行的工具链。RBS运行时类型检查器是Ruby Google Summer of Code项目之一，它使用RBS类型签名来实现运行时类型检查。类型分析器是一个探索性项目，它基于一种称为抽象解释的程序分析技术，从Ruby源代码生成RBS文件。还有一个支持Rails的项目。\n这篇文章介绍了RBS，这是Ruby3中用于类型的一个新部分。我解释了可以使用RBS编写的内容、RBS设计的关键概念，以及RBS带来的好处和工具。您为Ruby代码编写类型定义，我们的工具将分析您的代码。我们知道不是所有的Ruby爱好者都会改用类型化的Ruby，但是我们相信这值得在您的代码中尝试！\n在Square，我们正在测试基于RBS的类型检查解决方案，并继续对其进行迭代。我们正在为一些内部项目编写RBS文件，并使用START进行代码类型检查。我们正在从.proto文件构建RBS生成器。\n我期待着在几个月内分享这些实验的结果。", "note_en": "We&#39;re pleased to announce Ruby 3’s new language for type signatures, RBS. One of the long-stated goals for Ruby 3 has been to add type checking tooling. After much discussion with Matz and the Ruby committer team, we decided to take the incremental step of adding a foundational type signature language called “RBS,” which will ship with Ruby 3 along with signatures for the stdlib. RBS command line tooling will also ship with Ruby 3, so you can generate signatures for your own Ruby code.\n  Typed versus untyped is a 30-year-old issue for programming languages. Typed languages are suitable for larger projects but are often less flexible. Untyped languages allow for rapid development, but scaling teams and codebases with them can be difficult.\n Programming language designers are aware of these tradeoffs, and try to incorporate features of the other to offset this. C# has a feature called  dynamic which delays type checking from compile time to runtime. Assigning and reading any type of value is allowed at compile time but may raise a runtime error to ensure safety. This is almost equivalent to untyped languages! How about the opposite? We see untyped languages type checking options (PHP, Python). We also have typed dialects of untyped languages that are used in production (TypeScript).\n Matz declared that Ruby 3 will support static type checking four years ago. After seeing multiple community developed type checkers, the Ruby committer team decided to build a foundation for the community to build type checkers on. Ruby 3 will ship with the ability to write type signatures for Ruby programs as well as built-in type signatures for the Ruby standard libraries. The standard type signature language will make type definitions in Ruby code portable between type checkers and encourage the community to write types for their gems and apps.\n   We defined a new language called RBS for type signatures for Ruby 3. The signatures are written in  .rbs files which is different from Ruby code. You can consider the  .rbs files are similar to  .d.ts files in TypeScript or  .h files in C/C++/ObjC. The benefit of having different files is it doesn&#39;t require changing Ruby code to start type checking. You can opt-in type checking safely without changing any part of your workflow.\n  # sig/merchant.rbsclass Merchant attr_reader token: String attr_reader name: String attr_reader employees: Array[Employee] def initialize(token: String, name: String) -&gt; void def each_employee: () { (Employee) -&gt; void } -&gt; void | () -&gt; Enumerator[Employee, void]end\n The  merchant.rbs file defines a class called  Merchant, and it helps the reader to understand the overview of the class.\n The class has three attributes  token,  name, and  employees. The type of  token and  name are  String. RBS also supports generic classes like  Array as we can see with the type of  employees attribute. It is an  Array of  Employees.\n RBS also describes methods defined in the class and their types. The class defines the  initialize and  each_employee methods. The  initialize method requires  token and  name as keyword arguments. The  each_employee method accepts a block, or it returns an  Enumerator instance.\n RBS is a language to describe the structure of a Ruby program. It gives developers an overview of the code and what classes and methods are defined. The biggest benefit is that the type definition can be validated against both the implementation and its execution!\n  The development of a type system for a dynamically typed language like Ruby differs from ordinal statically typed languages. There&#39;s a lot of Ruby code in the world already, and a type system for Ruby should support as many of them as possible.\n This forces type system designers to make compromises on complexity and correctness for compatibility with existing code. We may have to introduce a type checker feature to support a pattern in existing Ruby code that may be incorrect otherwise. However, adding features makes the type system complicated and difficult to understand. So, we have focused on the most important code patterns to minimize the complexity of the type system.\n We can show two of the important characteristics of Ruby code and how we can give types for them.\n  Duck typing is a popular programming style among Rubyists that assumes an object will respond to a certain set of methods. The benefit of duck typing is flexibility. It doesn&#39;t require inheritance, mixins, or  implement declarations. If an object has a specific method, it works. The problem is that this assumption is hidden in the code, making the code difficult to read at a glance.\n To accomodate duck typing we introduced  interface types. An interface type represents a set of methods independent from concrete classes and modules.\n If we want to define a method which requires a specific set of methods we can write it with  interface types.\n interface _Appendable # Requires `&lt;&lt;` operator which accepts `String` object. def &lt;&lt;: (String) -&gt; voidend# Passing `Array[String]` or `IO` works.# Passing `TrueClass` or `Integer` doesn&#39;t work.def append: (_Appendable) -&gt; String\n This is better than traditional duck typing as it defines an explicit interface a class or module is expected to implement and provides hints for documentation and editor plugins to expose the formerly implicit interface as solid actionable documentation.\n  Non-uniformity is another code pattern of letting an expression have different types of values. It&#39;s also popular in Ruby and introduced:\n   class Comment # A comment can be made by a User or a Bot def author: () -&gt; (User | Bot) # Two overloads with/without blocks def each_reply: () -&gt; Enumerator[Comment, void] | { (Comment) -&gt; void } -&gt; void ...end\n   We provide a language to write types. So, what can we do with RBS files?\n The following is a list of major benefits of having types. We can write types in RBS files, and the tools will help you writing Ruby code by:\n Finding more bugs: We can detect an undefined method call, an undefined constant reference, and more things a dynamic language might have missed.\n Nil safety: Type checkers based on RBS have a concept of  optional types, a type which allows the value to be  nil. Type checkers can check the possibility of an expression to be  nil and uncovers undefined  method(save!)&#39; for nil:NilClass`.\n Better IDE integration: Parsing RBS files gives IDEs better understanding of the Ruby code. Method name completions run faster. On-the-fly error reporting detects more problems. Refactoring can be more reliable!\n Guided duck typing: Interface types can be used for duck typing. It helps the API users understand what they can do more precisely. This is a safer version of duck typing.\n Of course none of this comes for free. How are we building tools for RBS to make work easier for developers to start using it?\n We developed static type checkers on the top of RBS.  Steep is the static type checker implemented in Ruby and it is based on RBS.  Sorbet is a static type checker which has its own type definition language called RBI, but has plans to support RBS in the future.\n We are also developing and working on additional tools to expand the RBS toolchain. RBS runtime type checker is one of the Ruby Google Summer of Code projects, which uses RBS type signatures to implement runtime type checking.  type-profiler is an exploratory project to generate RBS files from Ruby source code based on a program analysis technique called Abstract Interpretation. There is also a  project for Rails support.\n  This post introduces RBS, a new part of Ruby 3 for types. I explained what you can write using RBS, the key concepts of the design of RBS, and the benefits and tools that come with RBS. You write type definitions for your Ruby code, and our tools will analyze your code. We know not all of Rubyists will switch to  typed Ruby, but we believe that it&#39;s worth trying with your code!\n At Square, we are testing RBS based type checking solutions and continuing to iterate on them. We are writing RBS files for some internal projects and type checking the code with Steep. We are building RBS generators from .proto files.\n I am looking forward to sharing the results of these experiments within a few months.", "posttime": "2020-07-30 03:03:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,rbs,类型", "title": "RBS，Ruby的新型签名语言", "title_en": "RBS, Ruby’s new type signature language", "transed": 1, "url": "https://developer.squareup.com/blog/the-state-of-ruby-3-typing", "via": "", "real_tags": ["ruby", "rbs", "类型"]}]