[{"category": "", "categoryclass": "", "imagename": "9de077a0aa5260779e782a4b30b9e1a1.jpg", "infoid": 1068085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在令人惊讶的最终令人惊讶的是，令人兴奋的Windows 11展示中，Microsoft CEO Satya Nadella来到视频饲料中来提供一些结束言论。他为Windows 11制定了他的愿景作为“平台创造者的平台”，而且这样做，他发出了一个微妙但仍然刺痛的苹果批评。\n Nadella的演讲几乎完全是为了构建一个窗户是创造者比acos或（特别是）iOS更好的创造平台。他认为“没有个人机构没有个人计算”，“坚持认为用户应该更控制他们的计算机。\n Nadella致电Microsoft更改了Microsoft正在进行它的应用程序存储规则，允许更多类型的应用程序，Android应用程序，以及最重要的 - 允许应用程序使用自己的付款系统，如果它们如此选择。他说，“一个平台只能为社会提供社会，如果其规则允许这个基础创新和类别创造。”言论毫无疑问地听起来含糊不清，而令人震惊的背景，但在目前的辩论，诉讼和立法关于应用商店规则的具体背景下，这是一个尖锐而直接的批评。\n 虽然，纳迪拉和微软都在任何事情都将他们的手指放在关于App Store政策的辩论中的新兴趋势：如何影响个别创造者。暗指本汤普森最近的关于“主权作家”的文章，Nadella表示，“Windows始终为消费者和消费者的创造者和代理主权站起来。”微软甚至到目前为止为创建者构建一个直接提示功能，进入Windows 11。\n 叫这个批评机会主义是公平的。毕竟，微软本身试图为Windows构建一个App Store生态系统，完全无法匹配我们为iPhone（或Android）的成功级别的级别。这是一种真实的，在科技中，弱者总是要求开放，直到他们是顶级狗 - 而微软的App Store绝对是弱者。但只是因为批评是机会主义并不意味着它不正确。\n Nadella通过从Arthur Schopenhauer（没有命名他的情况下，露齿暗指结束，可能是因为他非常有问题）：\n 作者可分为流星，行星和固定的星星。流星产生巨大的瞬间效果;我们抬头，喊“看到那里！”然后他们永远都走了。行星和彗星持续一段时间更长。 ......单独的固定恒星是恒定和不可改变的;他们在穹苍的立场是固定的;他们有自己的光芒，并且随时都是活跃的，因为他们没有通过我们的角度改变来改变他们的外观，因为他们没有视差。与其他人不同，他们不属于一个系统（国家），而是对世界来说。但只是因为它们所处得很高，他们的光芒通常需要多年前对地球居民可见。 \n这是一个很长的方式，虽然是短期激励措施，但纳迪拉正在玩一个非常长的游戏，与Windows 11一起玩。就像谷歌和Apple在他们的商业模式周围建造他们的公司一样，微软也是如此。但微软的商业模式与销售窗户无关，甚至不再削减应用程序销售。它是关于Microsoft 365，Azure和企业服务。\n 当Nadella说Windows是“平台创造者的平台”时，Microsoft的其他服务是其中一些其他平台 - 恰好在Windows上运行良好。暂时而言，Nadella的论点是Windows 11足够大，而且足够宽阔地为他人提供房间 - 而且其他平台不是。\n Nadella的完整言论如下。正如这个故事出版的那样，Nadella自己推文了他演讲的核心部分：\n Windows始终为消费者创造者和机构的主权站立，以及Windows 11我们在世界上具有更新的Windows角色。 pic.twitter.com/xhldf38b8d.\n -  Satya Nadella（@Satyanadella）2021年6月24日\n  我真的很高兴能和你在一起。今天标志着窗户历史上的主要里程碑。这是新一代的开始。我今天向您展示了您的表达，我们如何将来自操作系统本身的所有内容恢复到商店和饲料中的内容。\n 我想简要介绍我们在这里的方式。在整个历史中，Windows一直是世界的民主化力量。 Windows为消费者和企业创建了完全新的类别。它导致了许多世界上最成功的软件类别，从通信和生产力到设计和业务应用程序，每个都创建了自己的生态系统。网络本身出生并在窗户上长大。它是驱动的硅创新设备创新。它启用了这么多人 - 包括业余爱好者，开发商和企业家 - 所有梦想大;把他们的想法变成现实;并将他们的创作货币化。 \n使用Windows，您可以使用应用程序和构建应用程序。您可以玩游戏和设计游戏。您可以购买PC并构建PC。您可以加入您的社区并创建您的社区。您可以从企业中购买并启动自己的业务。凭借Windows 11，我们在世界上具有更新的Windows'角色。当我展望未来时，我看到三个明确的机会。\n 首先，Windows认识到没有个人代理没有个人计算。个人计算需要选择，我们需要培养和发展自己的代理商在计算本身上。我们希望删除今天经常存在的障碍，提供真正的选择和连接。\n 我们需要赋权选择我们运行的应用程序，我们消耗的内容，我们连接的人，甚至我们如何分配我们自己的注意力。操作系统和设备应该模仿我们的需求，而不是另外的方式。这就是为什么我们更容易与您想要的人连接，所需的内容，所需的应用程序所需的应用程序。\n 其次，Windows是世界创作的舞台。作为一个创造者，每次拿起一个Windows设备时，它就会成为你灵感的舞台，所以你可以梦想大，创造一些深刻和持久的舞台。由于消费和创造变化之间的平衡，创建正在发生海洋变化。\n 通过这一新一代Windows，我们释放我们每个人中固有的创新和聪明才智。我们希望在内容，消费和商业之间促进这些良性环 - 由每个人的社区驱动。这些周期应该自由流动，让人们对他们来说无摩托地访问应用程序，文件，游戏，电影，节目，内容和社区。我们希望授权您生产并激励您创造。这就是为什么我们在帮助您更高效方面引入完整的新用户体验。\n 最后，Windows不仅仅是一种操作系统;这是平台创造者的平台。它允许最广泛的设计空间，使人们能够建立自己的企业和社区。\n 今天，世界需要一个更开放的平台，一个允许应用程序成为自己的平台。 Windows是一个比Web更大的东西更大的平台，就像网络一样。这是我们对Windows 11的愿望，成为下一个Web的平台，下一个变革软件类别，下一个个性化内容业务。 \n如果其规则允许此基础创新和类别创建，平台只能为社会提供服务。这就是为什么我们引入新的商店商业模型和策略，以及为当地发布商创造新的机会，并在Windows上支持更多的Android应用程序的应用程序。\n 这是Windows新时代的第一个版本。我们正在建造未来十年及以后。当我反思这些章节来了，我提醒了来自19世纪的哲学家，他们将创造者与太阳系中的物体进行比较。他写了关于闪光但褪色的流星。燃烧的行星更长时间，但其能量被限制在自己的轨道上 - 并将它们与恒定的恒星进行了比较，而且光明自己的路径。\n 这是我们与Windows的雄心：帮助其他明星和整个星座出生和茁壮成长。我非常自豪地为窗户实现了什么以及如何为他人培养持久的机会。而且我期待着看到你用Windows 11实现了什么以及它将如何解锁世界上人们的持久机会。 ", "note_en": "At the end of a  surprisingly eventful, exciting presentation of Windows 11, Microsoft CEO Satya Nadella came on the video feed to deliver some closing remarks. He laid out his vision for Windows 11 as a “platform for platform creators,” and in doing so, he issued a subtle but nonetheless stinging critique of Apple.\n Nadella’s speech was almost entirely about building a case that Windows would be a better platform for creators than either macOS or (especially) iOS. He argued that “there is no personal computing without personal agency,” insisting that users should be more in control of their computers.\n Nadella called out the changes Microsoft is making to its app store rules, allowing more types of apps,  Android apps, and — most importantly —  allowing apps to use their own payment systems if they so choose. He said, “A platform can only serve society if its rules allow for this foundational innovation and category creation.” That rhetoric sounds vaguely nice and inspiring out of context, but in the specific context of the current debates, lawsuits, and legislation over app store rules, it’s a sharp and direct critique.\n More than anything, though, Nadella and Microsoft are putting their finger on an emerging trend in the debate about app store policies:  how they affect individual creators. Alluding to Ben Thompson’s recent article about “ sovereign writers,” Nadella says, “Windows has always stood for sovereignty for creators and agency for consumers.” Microsoft even went so far as to build a  direct tipping feature for creators into Windows 11.\n It’s fair to call this critique opportunistic. After all, Microsoft itself tried to build an app store ecosystem for Windows that utterly failed to match the level of success we’ve seen for the iPhone (or Android, for that matter). It’s a truism that, in tech, the underdog always calls for openness until they’re the top dog — and Microsoft’s app store is definitely the underdog. But just because a critique is opportunistic doesn’t mean it’s not  correct.\n Nadella ends by alluding to  this quote from Arthur Schopenhauer (without naming him, likely because he was   very  problematic):\n Authors can be divided into meteors, planets and fixed stars. The meteors produce a loud momentary effect; we look up, shout ‘see there!’ and then they are gone for ever. The planets and comets last for a much longer time. ... The fixed stars alone are constant and unalterable; their position in the firmament is fixed; they have their own light and are at all times active, because they do not alter their appearance through a change in our standpoint, for they have no parallax. Unlike the others, they do not belong to one system (nation) alone, but to the world. But just because they are situated so high, their light usually requires many years before it becomes visible to the inhabitants of earth.\n That’s a long way of pointing out that despite the short-term incentives, Nadella is playing a very long game with Windows 11. Just as Google and Apple build their companies around their business models, so does Microsoft. But Microsoft’s business model has nothing to do with selling Windows or even getting a cut of app sales anymore. It’s about Microsoft 365, Azure, and enterprise services.\n When Nadella says Windows is “a platform for platform creators,” Microsoft’s other services are some of those other platforms — that happen to work well on Windows. For the time being, Nadella’s argument is that Windows 11 is big enough and broad enough to make room for others, too — and that other platforms are not.\n Nadella’s full remarks are below. And just as this story was published, Nadella himself tweeted the core part of his speech:\n Windows has always stood for sovereignty for creators and agency for consumers, and with Windows 11 we have a renewed sense of Windows’ role in the world.  pic.twitter.com/xHldf38B8d\n— Satya Nadella (@satyanadella)  June 24, 2021\n  I’m really excited to be here with you all. Today marks a major milestone in the history of Windows. It’s the beginning of a new generation. I’m excited by what we have shown you today and how we are reimagining everything from the operating system itself to the browser to the store and the feed.\n And I want to reflect briefly on how we got here. Throughout its history, Windows has been a democratizing force for the world. Windows has created entirely new categories for both consumers and businesses. It’s led to many of the world’s most successful software categories, from communications and productivity to design and business applications, each of which has created their own ecosystems. The web itself was born and grew up on Windows. It’s driven silicon innovation device innovation. It’s enabled so many people — including hobbyists, developers, and entrepreneurs — to all dream big; turn their ideas into reality; and monetize their creation.\n  With Windows, you can consume apps and build apps. You can play games and design games. You can buy a PC and build a PC. You can join your community and create your community. You can buy from a business and start your own business. With Windows 11, we have a renewed sense of Windows’ role in the world. As I look ahead, I see three clear opportunities.\n First, Windows recognizes that there is no personal computing without personal agency. Personal computing requires choice, and we need to nurture and grow our own agency over computing itself. We want to remove the barriers that too often exist today and provide real choice and connection.\n We need to be empowered to choose the applications we run, the content we consume, the people we connect to, and even how we allocate our own attention. Operating systems and devices should mold to our needs, not the other way around. That’s why we are making it easier for you to connect with the people you want, the content you want, the apps you want across all devices you want.\n Second, Windows is the stage for the world’s creation. As a creator, every time you pick up a Windows device, it becomes a stage for your inspiration, so you can dream big and create something profound and lasting. Creation is going through a sea change as the balance between consumption and creation changes.\n With this new generation of Windows, we are unleashing the innovation and ingenuity inherent in each of us. We want to foster these virtuous loops between content, consumption, and commerce — driven by communities for everyone. These cycles should flow freely, giving people frictionless access to apps, files, games, movies, shows, content, and communities that matter to them. We want to empower you to produce and inspire you to create. It’s why we’re introducing a complete new user experience in helping you be more productive.\n And finally, Windows isn’t just an operating system; it’s a platform for platform creators. It allows for the broadest of design spaces, enabling people to build their own businesses and communities.\n Today, the world needs a more open platform, one that allows apps to become platforms in their own right. Windows is a platform where things that are bigger than Windows can be born, like the web. That’s our aspiration with Windows 11, to be the platform for the next web, the next transformational software category, the next personalized content business.\n A platform can only serve society if its rules allow for this foundational innovation and category creation. It’s why we’re introducing new store commerce models and policies, and creating new opportunities for local publishers, and supporting even more apps with Android apps on Windows.\n This is the first version of a new era of Windows. We’re building for the next decade and beyond. And when I reflect on those chapters to come, I’m reminded of an analogy from a 19th century philosopher who compared creators to objects in our Solar System. He wrote about meteors that flash but fade away. Planets that burned longer, but whose energy is confined to their own orbit — and compared them to stars that are constant and light the path of their own.\n That’s our ambition with Windows: to help other stars and entire constellations to be born and thrive. I am incredibly proud of what Windows has achieved and how it is fostered lasting opportunity for others. And I look forward to seeing what you achieve with Windows 11 and how it’ll unlock enduring opportunity for people in the world.", "posttime": "2021-06-25 03:33:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,苹果,微软,microsoft,apple", "title": "在他关闭的Windows事件备注中，Nadella发出了一个微妙但刺痛的苹果批评，将微软定位为Apple为开发人员的主要竞争 ", "title_en": "In his closing Windows event remarks, Nadella issued a subtle but stinging critique of Apple, positioning Microsoft as Apple's main competition for developers", "transed": 1, "url": "https://www.theverge.com/2021/6/24/22549007/microsoft-windows-11-satya-nadella-remarks-apple?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["windows", "苹果", "微软", "microsoft", "apple"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我今天滚动我的收件箱时，我偶然发现了一封来自我的前同事的电子邮件，他们想告诉我，谷歌搜索我的名字会产生一张关于一个偶然杀手的维基百科文章的照片与我的名字相同。\n    我很快弹出了我的浏览器，打开谷歌并用我的名字打字。事实上，我的照片出现在保加利亚串行杀手的描述中。\n    我的第一次反应是有人试图在我身上脱掉一些精心的恶作剧，但在打开维基百科文章之后，事实证明，那里有我没有照片。\n    事实证明，Google＆＃39; S知识图算法以某种方式错误地关联我的照片与维基百科文章有关串行杀手。这也是奇怪的奇怪，因为我的名字是特别或独特的;有几百人的名字，尽管尽管如此，我的个人照片最终与连环杀手相关联。我可以＆＃39;真的对自己解释了这一切，但它＆＃39;很奇怪。在任何情况下，我现在都在向谷歌报告这个知识图形错误的过程中。\n    在与一些朋友分享新闻并竭尽全力出现良好的局面之后，对发生的事情进行了短暂的谣言让我考虑到这可能会下降一条更暗的道路。当然，花时间阅读维基百科文章后，人们可以很容易地弄清楚我不是一个串行杀手，虽然人们永远不会那么肯定。然而，一个算法＆＃39; s的数十亿人使用的算法可以如此轻易地以这种方式弯曲信息真正可怕。\n  假新闻和取消文化的猖獗传播从字面上取得了所有人，而不是匿名脆弱的人。今天在互联网上存在的人必须照顾他们的＆＃34;在线代表和＃34;系统中的一个小错误可能导致任何可能在灾难中造成轻微不便的任何东西，这些灾难可能会在几天内减少人民的职业和声誉。直到今天，我总是有这种心态，即这样的事情和＃34;发生在其他人身上，但它可能永远不会发生在我身上＆＃34;我肯定是错的。\n  也许让单一的互联网公司＆＃34;组织世界＆＃39;信息＆＃34;可能是一个如此好主意。一些思想的食物。 ", "note_en": "As I was scrolling through my inbox today, I stumbled upon an e-mail from a former colleague of mine who wanted to inform me that a Google search of my name yields a picture of me linked to a Wikipedia article about a serial killer who happens to have the same name as mine.\n    I quickly popped out my browser, opened Google and typed in my name. And indeed, my photo appeared over a description of a Bulgarian serial killer.\n    My first reaction was that somebody was trying to pull off some sort of an elaborate prank on me, but after opening the Wikipedia article itself, it turned out that there&#39;s no photo of me there whatsoever.\n    It turns out that  Google&#39;s knowledge graph algorithm somehow falsely associated my photo with the Wikipedia article about the serial killer. Which is also surprisingly strange because my name isn&#39;t special or unique at all; there are literally hundreds of other people with my name, and despite of all that, my personal photo ended up being associated with a serial killer. I can&#39;t really explain to myself how this happened, but it&#39;s weird. In any case, I am now in the process of reporting this Knowledge Graph bug to Google.\n    After sharing the news with some friends and getting a good laugh out of the whole situation, a short rumination on what had happened made me consider how this could have gone down a much darker path. Sure, after taking the time to read the Wikipedia article, one can easily figure out that I&#39;m not a serial killer  though one can never be so sure. However, the fact that  an algorithm that&#39;s used by billions of people can so easily bend information in such ways is truly terrifying.\n  The rampant spread of fake news and cancel culture has made literally everyone who&#39;s not anonymous vulnerable. Whoever has presence on the internet today has to look after their &#34;online representation&#34;. A small mistake in the system can lead to anything from a minor inconvenience to a disaster that can decimate careers and reputations of people in the matter of days. Until today, I always had the mindset that such things &#34;happen to other people, but it will likely never happen to me&#34;. I was certainly wrong about that.\n  Maybe letting a single internet company &#34;organize the world&#39;s information&#34; probably isn&#39;t such a great idea. Some food for thought.", "posttime": "2021-06-25 03:32:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,turned,名字", "title": "谷歌让我成为一名连续杀手 ", "title_en": "Google turned me into a serial killer", "transed": 1, "url": "https://hristo-georgiev.com/google-turned-me-into-a-serial-killer", "via": "", "real_tags": ["google", "谷歌", "turned", "名字"]}, {"category": "", "categoryclass": "", "imagename": "9f342aa0bfc7903c14a0e70ab783cde7.jpg", "infoid": 1068082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经济学家使用两个基本标准评估政策：权益和效率。股权涉及不同群体在实施政策的不同群体或“丧失”的程度。效率与权衡，稀缺和机会成本有关。有效的策略在它使用的资源中创造了最大的价值（因为我们可以使用这些资源做其他有价值的东西）\n 经济学家将研究锁定和其他非药品干预措施（NPI）的股权和效率。成本效益分析将是这些研究的主办。成本效益分析的目的是考虑到由有关政策造成的社会成员的全套福利和成本。必须基于其所有成本和福利进行评估政策，而不仅仅是它们对Covid-19案件，住院，发病率和死亡率的影响。\n 诺贝尔劳特（诺贝尔）加里贝尔的“人力资本”的想法统一了许多这些成本和福利。人力资本的概念承认人们有天生的价值和断言，我们可以通过花时间和金钱对我们的社会联系，教育，技能和健康来投入自己。死亡是人力资本的最终驱逐舰，尽管由于死亡时，由于疾病和晚年，许多人已经失去了大量资金。\n NPI可以在人力资本方面创造福利和成本。潜在的好处包括拯救生命，并从减少的Covid-19传输中保存健康。由于孤立，不活动，教育，医疗，安全网，就业和收入，潜在成本包括死亡和恶化的健康。遗憾的是，一些成本仍然在我们之前仍然存在，包括癌症筛查和治疗的延迟的死亡，呈现出阿片类药物过量，并损害当今儿童的预期寿命因失去学业而受到危害。除了这些成本的总和，评估NPI的股权将需要仔细核算他们的利益和成本如何在年龄，收入，种族，种族，性别和国籍中不同。例如，虽然华盛顿州的乳腺癌筛查总体患者为50％，但在少数群体中，下降甚至更辛苦。\n 在我们之前，在努力确定哪种福利和成本是由哪些政策造成的艰难工作。来自人力资本概念的一个洞察力是评估NPI的公平和效率的顶线措施是按年龄对死亡率过多的影响。这衡量了每个年龄组中的全因死亡人数的程度与没有Covid-19和NPI的预期预期的程度。\n 哪些结果是致命，传染性病毒的不可避免的后果，并从未造成的伤口是非真正的政策？\n 鉴于“反事实”周围固有的不确定性，辩论将是有争议的。我们只能观察发生的事情，而不是选择另一条路径是否发生了什么。在益处方面，NPI有多少Covid-19死亡？其他NPI将被其他NPI所防止哪种Covid-19死亡，如更严格的庇护所要求，更广泛的测试可用性，或者简单地更好地沟通跨年龄和健康的广泛风险？ \n在成本方面，选择的NPI是多少非Covid过量死亡？ NPIS摧毁了就业机会的程度，增加贫困，防止教育，限制医疗服务，并产生政府债务吗？\n 一个常见的方法经济学家用来回答这些类型的问题是知情人士所善良的人们自愿选择为自己做的事情的反事力基准。因为这种基准从未存在过，我们留下了从不同缓解策略的成本和益处的推论，因为它们在世界各地实施。\n 各政府选择的NPI的可用数据显示，没有先进的证据表明那些更严格的人，更持续的NPI受益于较低的Covid-19负担或减少经济损害。为此，最近的工作发现，在巴西，NPI有效地增加了社会隔离可能导致更多的Covid-19死亡。也就是说，原始数据可以模糊兴趣和严格研究的因果关系，以了解NPI对人们生活的整体效应。\n  Covid-19的疾病负担和NPI的成本不成比例地影响穷人。穷人更有可能死于covid-19，目前尚不清楚这是尽管或因为所选的npis。他们也最有可能在所选政策下失去工作，收入和教育。如本周的研究重申，低收入工人持续了锁定成本的不成比例，因为他们的工作暂时违法。评估NPI的益处并将其称为穷人的成本，特别是优先事项。\n 学校封闭件几乎没有福利，虽然很大程度上没有升温，费用。这些政策直接伤害了从Covid-19具有可忽略不计的年轻人。随着他们的大部分生活仍然领先于他们，延长全职丧失的影响，持续的，亲自教育将继续阻碍当前的儿童队列数十年。他们已经被迫承担这些成本，尽管对他们周围的成年人没有任何好处。即使是现在，许多孩子正在被拒绝进入全职，亲自学校。目前正在开放的地方，儿童及其家庭的隔离议定书几乎没有任何好处。此外，必须未知的强制性掩蔽，疏散和受限制的活动和互动的成本仍然不为人知。\n “零Covid”政策失败成本效益分析。一旦免疫力带来了死亡和住院，Covid-19对人力资本的费用将相对于试图减少Covid-19案件的成本，将是微量的。尽管如此，许多领导人仍然拥抱零Covid-19政策，即使在广泛的免疫之后也为恢复正常活动。\n 锁定不是免费的午餐。一些经济学家最初认为，理所当然的订单会拯救生命并使经济受益。所有的免费午餐......即使那午餐必须被孤立。已经通过了十三个月，因为这些订单首次实施，许多人仍然在他们身下生活并带来痛苦的成本。 \n最近的一个同行评审的研究使这些成本令人窒息。只有两周的遮挡机构要求一百分点增加失业，效果大幅度和直接的效果。该研究还表明，这些成本没有购买：在减少的Covid-19传播或更少的Covid-19死亡方面没有产生任何福利，结果表明该任务可能实际上增加了Covid-19死亡。虽然实质性研究仍有待完成的措施，但已经清楚地表明，NPI的任何重要益处都必须是因为他们减少了Covid-19并发症和死亡，而不是对经济的狭隘界定的福利。但是，研究对这种益处的希望提供了很少的支持。事实上，全球南部可能最好通过采用“通过拯救经济拯救生命”的方法来实现，与自由乘客的口头禅相反，我们可以通过突破Covid-19来拯救经济。\n  在这个问题上的CG：版本中，我们提供推动这一点的统计数据，故事和研究，从全球亿万富翁的增长与全球贫困和粮食不安全的增长，以追踪政府决定如何关闭最受欢迎的本地零售商，剧院或餐厅导致涟漪上下收入分配和世界各地。这些故事讲述了这些效果，并通过我们的一生进行了研究。\n 经济框架通过装备在其效率和公平方面评估大流行政策来补充这些必要的观点。我希望您能够通过更清晰的观点来远离这个问题，了解如何从事关于我们所选择的政策是否有价值的持续谈话，赢得了他们赢得的人，以及我们如何选择更好的道路。\n  Jonathan Ketcham，Ph.D. ，是伯爵G.和Gladys C.戴维斯在W.P的业务中杰出的研究教授。 Carey School的亚利桑那州立大学经济局和抵押品全球编制委员会成员。 ", "note_en": "Economists evaluate policy using two fundamental criteria: equity and efficiency. Equity concerns the extent to which different groups would ‘win’ or ‘lose ’if policy were implemented. Efficiency has to do with tradeoffs, scarcity, and opportunity cost. Efficient policy creates the most value with respect to the resources it uses (given that we could do other valuable things with those resources)\n Economists will be studying the equity and efficiency of lockdowns and other non-pharmaceutical interventions (NPIs) for years to come. Cost-benefit analysis will be a workhorse of these studies. The aim of cost-benefit analysis is to account for the full set of benefits and costs to all members of a society caused by the policy in question. Policies must be evaluated based on all of their costs and benefits, not only their effects on COVID-19 cases, hospitalizations, morbidity and mortality.\n Nobel Laureate Gary Becker’s idea of “human capital” unifies many of these costs and benefits. The concept of human capital recognizes that people have innate value and asserts that we can invest in ourselves by spending time and money on our social linkages, education, skills, and health. Death is the ultimate destroyer of human capital, although by the time of death many people have lost substantial capital due to illness and old age.\n NPIs can create both benefits and costs in terms of human capital. Potential benefits include saved lives and preserved health from reduced COVID-19 transmission. Potential costs include death and  worsened health due to isolation, inactivity, and loss of education, medical care, safety nets, employment, and income. Some of these costs, sadly, remain ahead of us, including deaths from  delays in cancer screening and treatment, rising opioid overdose, and harms to the  life expectancy of today’s children due to lost schooling. Beyond the sum total of these costs, evaluating the equity of NPIs will require a careful accounting of how their benefits and costs differ across age, income, race, ethnicity, sex, and nationality. For example, while breast cancer screening in Washington state fell by 50% for women overall, the drop was even  more precipitous among minorities.\n Ahead of us lies the difficult work of determining which benefits and costs were caused by which policies. One insight derived from the human capital concept is that a top-line measure for evaluating the equity and efficiency of NPIs is their effects on  excess mortality by age. This measures the degree to which the number of all-cause deaths in each age group differs from what would have been expected without COVID-19 and NPIs.\n Which outcomes were inevitable consequences of the deadly, contagious virus, and which were self-inflicted wounds from unsound policies?\n The debate will be contentious given the inherent uncertainty around the “counterfactual.” We can only observe what occurred, not what would have happened if another path was chosen. On the benefits side, how many COVID-19 deaths did NPIs prevent? Which COVID-19 deaths would have been prevented by other NPIs such as stricter shelter-in-place mandates, wider availability of rapid testing, or simply better communication of the wide range of risks across age and health?\n On the cost side, how many non-COVID excess deaths did the chosen NPIs cause? To what extent did NPIs destroy jobs, grow poverty, prevent education, limit access to medical care, and incur government debt?\n A common approach economists use to answer these types of questions is the counterfactual benchmark of what well informed people would have voluntarily chosen to do for themselves. Because this benchmark never existed, we are left to draw inferences from the  costs and benefits of different mitigation strategies as they were implemented around the world.\n Available data on various governments’ chosen NPIs show no first-blush evidence that those with stricter, more sustained NPIs benefited from a lower COVID-19 burden or decreased economical damage. To this point, recent work found that in Brazil, NPIs that effectively increased social isolation  likely caused more COVID-19 deaths. That said, raw data can obscure causal relationships of interest and rigorous studies are necessary to understand NPI’s holistic effects on people’s lives.\n  The disease burden of COVID-19 and the costs of NPIs have disproportionately affected poor people. The poor were more likely to die from COVID-19, and it is unclear whether this is despite or because of the chosen NPIs. They were also most likely to lose jobs, income and education under the chosen policies. As explained in this week’s   Research Recap, low-income workers shouldered a disproportionate share of lockdown costs because their jobs were made temporarily illegal. Assessing the benefits of NPIs and weighing them against their costs for the poor specifically should be a top priority.\n School closures have had virtually no benefits and significant, though largely unmeasured, costs. These policies directly harmed young people who have negligible risk from COVID-19. With the majority of their lives still ahead of them, the effects of  extended loss of full-time, in-person education will continue to hinder the current cohort of children for many decades. They have been forced to bear these costs despite little to no benefit to the adults around them. Even now, many kids are being denied access to full-time, in-person school. Where schools are open currently, protocols for quarantining healthy are quite costly to children and their families with virtually no benefits. Further, the costs of mandatory masking, distancing, and restricted activities and interactions among school children remain unknown.\n “Zero-COVID” policies fail cost-benefit analyses. Once immunity brings deaths and hospitalizations down, the costs of COVID-19 on human capital will be minuscule relative to the costs of trying to reduce COVID-19 cases. Still, many leaders have embraced  Zero-COVID-19 policies going forward, advising against resumption of normal activities even after widespread immunity.\n Lockdowns are not a free lunch. Some economists initially believed that shelter-in-place orders would  save lives and benefit the economy. A free lunch for all…even if that lunch would have to be eaten in isolation. Thirteen months have passed since those orders were first implemented, and many are  still living under them and bearing their painful costs.\n A recent  peer-reviewed study makes these costs woefully clear. Just two weeks of shelter-in-place mandates increased unemployment by one percentage point, a substantial and immediate effect. The study also shows that these costs bought nothing: the mandates created no benefits in terms of reduced COVID-19 spread or fewer COVID-19 deaths, with results indicating that the mandates may have actually  increased COVID-19 deaths. While substantial research remains to be done, it is clear already that any important benefits from NPIs must be because they reduced COVID-19 complications and deaths and not from narrowly defined benefits to the economy. However, research  gives little support for hope of such benefits.  In fact, the Global South  may have been best served by adopting the approach of “saving lives by saving the economy”, contrary to the free-lunchers’ mantra that we can save the economy by squelching COVID-19.\n  In this issue of CG: Editions, we offer statistics, stories and studies that drive this point home, from juxtaposing the growth in worldwide billionaires with the growth in global poverty and food insecurity to tracing how government decisions to close a favorite local retailer, theater or restaurant causes ripples up and down the income distribution and around the world. The effects will be felt, the stories told, and the studies conducted over our lifetimes .\n The economic framework complements these essential perspectives by equipping us to evaluate pandemic policies in terms of their efficiency and equity. I hope that you will come away from this issue with a clearer view of how to engage in the ongoing conversation about whether our chosen policies were worthwhile, who won and who lost from them, and how we might choose a better path going forward.\n  Jonathan Ketcham, Ph.D. , is the Earl G. and Gladys C. Davis Distinguished Research Professor in Business in the W.P. Carey School’s Department of Economics at Arizona State University and a member of the Collateral Global editorial board.", "posttime": "2021-06-25 03:32:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "福利,policies,成本", "title": "必须对所有成本和福利进行大流行政策，不仅是Covid-19 ", "title_en": "Pandemic policies must be evaluated on all costs and benefits, not only Covid-19", "transed": 1, "url": "https://collateralglobal.org/article/no-free-lunch/", "via": "", "real_tags": ["福利", "policies", "成本"]}, {"category": "", "categoryclass": "", "imagename": "bd7a6230621d0da05608e0d93afc554f.png", "infoid": 1068080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天早些时候，我们通过微软的方式获得了第一次官方查看Windows 11。什么是Windows事件的新新手＆＃39;新的操作系统提供了多种重要的功能，对Windows 10习惯了习惯的几个重要的功能变化 - 这是一个与新的涂料涂料的相同旧操作系统。\n 然而，Windows 11绝对确实会得到那种新鲜的涂料。其新的桌面环境使半透明窗户敷料的繁重梳理成圆角，这是一种带来磨损玻璃窗格的效果。在许多方面，新的外观是让Compiz的Linux桌面环境激动2010年 - 但具有明显更高的分辨率和更加连贯的整体主题。\n Microsoft首席产品官Panos Panay将新的外观迎接有关情感的眉毛陈述：＆＃34;我们了解了[功能和实用性]的责任，比以往任何时候都更加责任，但它也必须是个人 - ，也许最重要的是，它最重要的是必须感到情绪化。＆＃34;\n 我们怀疑任何人，但班纳会有误认为是新的外观 - 但无处不在的半透明边界确实有助于向用户保证他们的真实工作仍然存在，不受欢迎，在新的个性化小部件饲料等弹出元素之后仍然存在。\n     早期版本的Windows尝试直接将新闻信息介绍进入开始菜单 - 一个很少的Windows用户似乎欣赏的功能，并且很多都讨厌。微软清楚地听到后者，但公司尚未愿意放弃自己，浏览器外面的新闻。在Windows 11中，Newsfeed已被分解为单独的对话框，类似于实际开始菜单的（但不是一部分）。\n 班凯浸入＆＃34;情感＆＃34;再次描述新的开始菜单和单独的新闻续集 - ＆＃34;它＆＃39;＆＃39;更接近您，简化，＆＃34;他说了新的中心位的开始菜单。新的“开始”菜单使用以前以前占用的空间由Newsfeed Tiles占用，而是提供对最近使用的文档和应用程序的访问。 ＆＃34;细节有关，＆＃34;班纳说的新菜单，继续说＆＃34;它是让您到达那个情绪空间的详细信息......要获得所需的工作。＆＃34;\n 单独的新闻稿 - 从左侧跳动，跳动和＃39;演示 - 有效地是那些缺少的地铁风格的瓷砖，现在由越来越多的行业标准术语和＃34;小部件＆＃34;并使用顶级搜索栏增强。 ＆＃34;所有流动的人都是如何让您带来一个令人难以置信的平静感，＆＃34;班扬咕咕了。 \n在向Microsoft合作伙伴导演Carmen Zlateff交给Microsoft Partner Director of之前，Panay花了一瞬间详细说明为什么Windows 11是＆＃34;美丽的内部。＆＃34;这主要意味着在Windows  - 改进中剔除性能改进，我们不幸的是没有具体的指标。\n 减少能源使用，适用于更长的电池寿命，班纳描述为制作Windows 11＆＃34;更负责任＆＃34;\n 与此衣物的改进声音清单一样重要，班扬不幸没有详细地对他们进行了详细信息。我们不知道为什么＆＃34;在任何浏览器上浏览更快，＆＃34;我们不知道为什么应该考虑Windows 11＆＃34;最安全的窗户。＆＃34;\n     Zlateff推出了两个主要的新型Windows任务管理和切换功能：捕捉布局和虚拟桌面。捕捉布局将熟悉任何＆＃39; s尝试桌面环境 - 它们金额将多个应用程序捕捉到固定的屏幕效率瓷砖布局。\n Windows 11＆＃39;瓷器实现似乎聪明，Zlateff直接绑在屏幕方向和分辨率上。用户可以选择布局，然后将应用程序拖动到布局所提供的固定边界 - 我们看到了六种可用布局的选择，每个可用布局从两到六个窗口位置支持。\n 建设到捕捉布局，Zlateff演示了Snap组 - 这些是一组应用程序，这些应用程序已被捕获到一个平铺的布局中，并且可以从任务栏作为组中的任务栏中递交或发送。您之间的Linux用户可能是思考＆＃34;所以，Snap组是Microsoft＆＃39;在虚拟桌面＆＃34;  - 但是Windows 11还支持Linux风格的完整虚拟桌面，作为单独的功能。 （对于非Linux-y读者：虚拟桌面是单独的，并且是单独的＆＃34;屏幕＆＃34;充满了应用程序;单击一个＆＃34的按钮;屏幕＆＃34;完全清除显示器并加载显示器＆＃34;屏幕＆＃39; s＆＃34;窗户的集合。）\n 可以使用单个任务栏中选择新的捕捉组，只要单独的应用程序被提升和降低 - 并且与各个应用程序一起举起，即也可以举起并与组一起举起并降低。 Zlateff描述了这种在各个应用程序之间或与＃34之间切换的能力;整个项目＆＃34;作为只在窗户上完成的东西。 \n最后，对对接和取消缓解笔记本电脑的支持显得大大提高。 Zlateff展示了作为笔记本电脑的单一显示布局重新排列的应用程序＆＃39; S第二，外部监视器被删除。但更重要的是，Zlateff显示了一旦显示器重新连接到它们一旦显示出来的应用程序。\n     Microsoft Communications Manager Phillip McClure推出了Windows 11＆＃39;通过说＆＃34; Windows [11]没有键盘适应您的Windows [11]而不是其他方式。＆＃34;这在很大程度上转化为更大的触摸目标和微妙的视觉提示，使MCCLURE上的平板电脑模式制作在MCCLURE和2合1触摸屏笔记本电脑上更简单地使用，但不显着改变Windows本身的外观和感觉。\n  更新的笔支持 -  MCCLURE简要展示了用手写笔的突出显示文本线，同时讨论全新的触手索触觉反馈\n 一个全新的触摸键盘 - 主题支持，支持滑动，位于平板电脑模式中的一拇指键入的最佳和清晰，设计，使用空格栏作为文本选择的光标控制\n 更新的语音识别 - 简要示范显示对自动标点符号的支持（例如，上升的色调获取问号）和内联语音命令（例如，＆＃34;删除该＆＃34;在决定时）\n 无线电视＆＃34;投影＆＃34;  - 类似于手机和＃34;铸造＆＃34;智能电视或chromecast。没有得到真正的细节\n McClure还将我们带回AI供电的小部件饲料。在一个简短的示威中，他告诉我们，新闻饲料和真实应用之间的清晰分离使他能够＆＃34;检查东西而不会打扰他的工作流程。＆＃34; \n游戏主管创建者体验Sarah Bond概述了Windows 11中的几个新的游戏相关功能：\n 自动HDR-此功能，最初在Xbox上介绍，展开游戏＆＃39;照明和颜色更高的动态范围。邦德在现场左/右分裂显示器中展示了Skyrim上的汽车HDR;效果强烈让人想起了移动摄像机和照片应用中的自动调节滤波器。\n DirectStorage  - 此Xbox功能允许游戏资产直接流到GPU，大大降低CPU影响。\n Xbox游戏传递 - 此订阅计划为成员访问了当前＆＃34; 100 +＆＃34的成员访问大型游戏库;包括来自Xbox Game Studios和Bethesda，所有EA Play和来自小型开发人员的第三方冠军的游戏。\n 可以播放交叉游戏和交叉保存支持的游戏＆＃34;无缝跨设备＆＃34;全球社区数百万球员。这包括一个在一个平台上保存游戏的玩家，然后在另一个平台上恢复。\n 可以通过Xbox App直接购买游戏 - 这希望在阀门和＃39; S蒸汽平台上直接瞄准，具有类似的外观和功能。\n     根据Panay，＆＃34的说法，Windows 11＆＃39;新改进的Microsoft Store;从地面上重建＆＃34;并使开发人员更容易以Win32应用程序，渐进式Web应用程序和通用网络平台应用程序并排托管和销售。 \nMicrosoft还在改变其商店的财务条款 - 班达将经过改良的商店描述为提供＆＃34;行业领先的收入份额＆＃34;对于开发人员。有趣的是，他也嘲笑了＆＃34的能力;带上自己的商务引擎和＃34;尽管没有详细的是，这与使用他们自己的商业发动机的商店添加的商店添加的商店，但是需要分享.T任何与微软的收入。\n 最后 - 也许最令人兴奋 - 新改造的Microsoft Store正在提供对Android应用程序的访问权限。 Panay将Android环境描述为由英特尔桥技术提供支持的，它展示了在电话型和平板电脑形窗口中完美的几个应用程序（包括Tiktok）。\n Android应用程序本身是＆＃34;通过Microsoft Store使用Amazon App Store发现。＆＃34;使用类似App Store＆＃39; D请参阅Fire HD平板电脑，Reskinned为Windows 11集成，展示了该访问。\n 开发人员对新的App Store更新有兴趣的开发人员可以在今天晚些时候参加Microsoft Store Dive Dive。 ", "note_en": "Earlier this morning, we got our first official look at Windows 11 by way of Microsoft&#39;s What&#39;s New For Windows  event. The new OS offers several significant, functional changes to what we&#39;ve become accustomed to in Windows 10—this isn&#39;t just the same old operating system with a fresh coat of paint.\n However, Windows 11 absolutely does get that fresh coat of paint. Its new desktop environment makes heavy use of translucent window dressing with rounded corners, an effect which brings to mind panes of frosted glass. In many ways, the new look is reminiscent of compiz-based Linux desktop environments circa 2010—but with significantly higher resolution and a more coherent overall theme.\n Microsoft Chief Product Officer Panos Panay ties the new look to eyebrow-raising statements about emotion: &#34;We understand the responsibility of [functionality and practicality] more than ever before, but it must also be personal—and maybe most importantly, it must feel  emotional.&#34;\n We doubt anyone but Panay will get misty-eyed about the new look—but the ubiquitous translucent borders do serve to reassure users that their real work is still present, untouched, behind pop-up elements such as the new personalized widget feed.\n     Earlier versions of Windows experimented with introducing a newsfeed directly into the Start menu—a feature that few Windows users seemed to appreciate, and many utterly loathed. Microsoft clearly heard the latter, but the company isn&#39;t willing to give up on its own, outside-the-browser newsfeed yet. In Windows 11, the newsfeed has been broken out into a separate dialog, similar to (but not a part of) the actual Start menu.\n Panay dipped into &#34;emotion&#34; once again while describing the new Start menu and separate newsfeed—&#34;it&#39;s what you  need, closer to you, simplified,&#34; he said of the new, center-located Start menu. The new Start menu uses space formerly occupied by newsfeed tiles to instead offer access to recently used documents and applications. &#34;The details matter,&#34; Panay said of the new menu, going on to say &#34;it is the details that enable you to get to that emotional space... to get the work you need done.&#34;\n The separate newsfeed—which opened from the left in Panay&#39;s demonstrations—is effectively those missing Metro-style tiles, now referred to by the more industry-standard term &#34;widgets&#34; and augmented with a top-mounted search bar. &#34;How it all flows together is meant to bring you to an incredible sense of calm,&#34; Panay gushed.\n     Before handing off to Microsoft Partner Director Carmen Zlateff, Panay spent a moment detailing why Windows 11 is &#34;beautiful on the inside.&#34; This mostly meant ticking off performance improvements in Windows—improvements for which we unfortunately have no concrete metrics.\n Decreased energy use, for longer battery life, which Panay describes as making Windows 11 &#34;more responsible&#34;\n As important as this laundry list of improvements sounds, Panay unfortunately went into no detail about them. We do not know why &#34;browsing on any browser is faster,&#34; and we don&#39;t know why Windows 11 should be considered &#34;the most secure Windows yet.&#34;\n     Zlateff introduced two major new-to-Windows task management and switching features: snap layouts, and virtual desktops. Snap layouts will be familiar to anyone who&#39;s tried a tiling desktop environment—they amount to a way to snap multiple applications into a fixed, screen-efficient tiled layout.\n Windows 11&#39;s tiling implementation appears smart, and Zlateff said it&#39;s tied directly to the screen orientation and resolution. The user can select a layout and then drag apps into the fixed borders offered by the layout—we saw a selection of six available layouts, each of which support from two to six window locations.\n Building onto snap layouts, Zlateff demonstrated snap groups—these are groups of applications which have been snapped into one of the tiled layouts and can be brought up or sent down from the taskbar as a group. The Linux users among you are probably thinking &#34;so, snap groups are Microsoft&#39;s take on virtual desktops&#34;—but Windows 11 also supports Linux-style full virtual desktops, as a separate feature. (For the non-Linux-y reader: virtual desktops are separate &#34;screens&#34; full of applications; clicking the button for one &#34;screen&#34; clears the monitor entirely and loads that &#34;screen&#39;s&#34; collection of windows.)\n The new snap groups can be selected with a single taskbar click, just as individual apps are raised and lowered—and right alongside the individual apps themselves, which can also be raised and lowered alongside the groups. Zlateff described this ability to switch between individual apps or between &#34;entire projects&#34; as something that can only be done on Windows.\n Finally, support for docking and undocking laptops appears greatly improved. Zlateff demonstrated apps rearranging themselves to a single-display layout as a laptop&#39;s second, external monitor is removed. But more importantly, Zlateff showed apps flowing  back exactly as they had been once the display was reconnected.\n     Microsoft Communications Manager Phillip McClure introduced Windows 11&#39;s updated input modes by saying &#34;Windows [11] without a keyboard adapts to you, instead of the other way around.&#34; This largely translates to bigger touch targets and subtle visual cues that make tablet mode on McClure&#39;s 2-in-1 touchscreen laptop simpler to use but without significantly altering the look and feel of Windows itself.\n  Updated pen support—McClure briefly demonstrated highlighting lines of text with a stylus, while discussing all-new stylus haptic feedback\n A brand-new touch keyboard—themeable, supports swiping, located optimally and clearly designed for one-thumb typing in tablet mode, uses space bar as cursor control for text selection\n Updated voice recognition—a brief demonstration shows support for automatic punctuation (e.g., rising tone gets a question mark) and inline voice commands (e.g., &#34;delete that&#34; while dictating)\n Wireless television &#34;projection&#34;—apparently similar to mobile phone &#34;casting&#34; to smart TV or Chromecast. No real details have been given\n McClure also brings us back to the AI-powered widget feed. In a brief demonstration, he tells us that the clear separation between news feed and real applications allows him to &#34;check stuff without disturbing his workflow.&#34;\n  Head of Game Creator Experience Sarah Bond outlined several new gaming-related features in Windows 11:\n Auto HDR—this feature, originally introduced on Xbox, expands games&#39; lighting and color to a higher dynamic range. Bond demonstrated Auto HDR on   Skyrim in a live left/right split display; the effect is strongly reminiscent of the automatic adjustment filters found in mobile camera and photo applications.\n DirectStorage—this Xbox feature allows game assets to stream directly to the GPU, with greatly reduced CPU impact.\n Xbox Game Pass—this subscription program gives members access to a large gaming library, currently &#34;100+&#34; games including first-day launches of games from Xbox Game Studios and Bethesda, all of EA Play, and third-party titles from both small and large developers.\n Cross-play and cross-save—supported games can be played &#34;seamlessly across devices&#34; with a global community of millions of players. This includes a player saving the game on one platform, then resuming it on another.\n Games can be purchased directly through the Xbox app—which looks to be taking direct aim at Valve&#39;s Steam platform, with similar appearance and features.\n     Windows 11&#39;s newly improved Microsoft Store is, according to Panay, &#34;rebuilt from the ground up&#34; and makes it easier for developers to host and sell Win32 apps,  Progressive Web Apps, and  Universal Web Platform apps side by side.\n Microsoft is also changing the financial terms of its store—Panay describes the revamped store as offering &#34;industry-leading revenue share&#34; for developers. Interestingly, he also teased at the ability to &#34;bring your own commerce engine&#34;—though with no detail for how this integrates with the Store—adding that devs using their own commerce engines don&#39;t need to share any revenue whatsoever with Microsoft.\n Finally—and perhaps most excitingly—the newly revamped Microsoft Store is offering access to Android applications. Panay described the Android environment as powered by Intel bridge technology, and it demonstrated several apps (including TikTok) running flawlessly in phone-shaped and tablet-shaped windows.\n The Android apps themselves are &#34;discoverable through the Microsoft Store using the Amazon app store.&#34; That accessibility was demonstrated with what looked like the same app store you&#39;d see on a Fire HD tablet, reskinned for Windows 11 integration.\n Developers interested in the new app store updates can attend a Microsoft Store deep dive later  today, at 3 pm EDT.", "posttime": "2021-06-25 02:55:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,windows-10,slapped", "title": "Windows 11远远超过一个拍摄于Windows 10的新主题 ", "title_en": "Windows 11 is much more than a new theme slapped onto Windows 10", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/microsoft-details-windows-11-with-new-ui-and-android-app-support/", "via": "", "real_tags": ["windows", "slapped"]}, {"category": "", "categoryclass": "", "imagename": "cd7cf67725092d3182172b1e932e320d.jpg", "infoid": 1068079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法国演员Omar Sy返回另一个淘汰赛转变为自我称为＆＃34;绅士小偷＆＃34;在Netflix＆＃39的第2部分中的Assane Diop; S惊喜的法国击中系列羽扇豆。在我今年早些时候的评论中，我叫第1部分A＆＃34;令人愉快的当代人类在法国侦探小说中的经典角色，Arsène羽扇豆 - 一个绅士小偷和伪装大师，他们基本上是夏洛克福尔摩斯的法国相当的法国。＆＃ 34;我很高兴发现第2部分更好，随着曲折，转弯和惊讶地揭示了纳大的，而不是牺牲那些丰富的富裕的安静时刻，这增加了一点深度。它＆＃39;迄今为止最佳的2021系列。\n  羽扇豆＆＃39;原创创造者莫里斯·勒布兰斯，在17部小说和39个Novellas的绅士小偷，所以有很多来源材料可以与之合作。 Netflix系列是Louis Leterrier的创建，他现在看到了2013年喉咙惊悚片，你看到了我，其中一支魔术师拉脱巧妙的抢劫案。所以它＆＃39很容易看出他为什么被绘制到这个项目。根据官方前提，＆＃34;作为一个少年，当他父亲被指控犯罪后他没有犯罪后，当他的父亲去世时，生命已经颠倒了。 25年后，Assane将使用Arsène羽扇豆，绅士窃贼作为他的灵感来报复他的父亲。＆＃34;\n  在第1部分中，我们遇到了塞内加尔出生的阿森（Omar Sy），而他在卢浮宫担任​​卑微的门户。在当时的展览上，在公开拍卖之前将这件作品销售给最高投标人，是曾经属于玛丽亚蒂·安托内特的珠宝项链。\n 这是最近回收的项链，他的父亲巴巴克（FargassAssandé）被富裕的金融家Hubert Pellegrini（HervéPierre）被偷窃的被错误地指责，当时Assane是一个男孩。 Assane出去了报复他的父亲＆＃39;后来的自杀。在将当地帮派成员欺骗诱饵后，DioP伪装自己作为富有的潜在买家，并崩溃 - 并最终与项链走开。 （飞行员从Leblanc＆＃39; Queen＆＃39; s项链中划了大量的leg＆＃39; sinlot episode的标题，其中包括原始故事的几个情节元素。\n    这只是对故事的开始，因为我们更多地了解了Assane＆＃39;包括他与童年甜心克莱尔（Ludivine Sagnier）的关系，他儿子Raoul（Etan Simon）的母亲 - 为什么他建模他的纵画计划论Arsène羽扇豆的漏洞。 Assane＆＃39;匿名持有风险，因为警方特别注意到那个高调的血统。罗曼队长（Vincent Londez），索非亚·贝尔科姆（Shirine Boutella）和Det。 Youssef Guedira（Soufiane Guerraab），是调查卢浮宫的团队的一部分。 Guedira也是羽扇豆Uber-an;他是该部门唯一一个注意到DIOP＆＃39;工作和虚构绅士窃贼之间的相似之处。\n    第1部分的唯一真正缺陷是它太短了，只有五个发作 - 它结束了一个疯狂的悬崖。这可能是由于大流行关机，因为第2部分非常直接连续同样更大的叙事弧，而不是用新的使命和拮抗剂呈现羽扇豆。在第1部分结束时，Assane相信他可以揭示佩莱格里尼＆＃39;对于媒体而言，只要发现一个＆＃39;当一个＆＃39; s敌人几乎控制新闻界时真的工作。 Pellegrini是一只狡猾的小照片，并派了他的一个悲伤，丽娜纳德（Adama Niane），因为他和他的家人一起前往Étretat，以标记Arsène羽扇豆的生日。 Assane在火车上的对抗中展示了Léonard，而是被绑架raoul报复的休瓜。\n    第2部分在ÉtreTAT绑架raous＆＃39; Assane誓言恢复了他的儿子，并为所有人带来了一次和佩莱格里尼，但是，因为Pellegrini在政府，媒体和警察部队在包括腐败的巴黎警察局加布里埃尔·杜曼州（ Vincent Garanger） - 为犯罪的框架assane＆＃39; t提交。 Assane现在是法国最想要的人。 \n因此，Assane和他的忠诚盟友，珠宝商Benjamin Ferel（Antoine Gouy），决定消失在隐藏时会发现一个新的计划。与此同时，Pellegrini为我们的绅士小偷设定了一个陷阱：纪念Arsène羽扇豆的交响乐表演，为他的女儿筹集资金＆＃39;慈善基础。克莱尔＆＃39;忠诚度终于被她儿子的消失所迫使被推到突破点。并且可能会在Assane和Pellegrini＆＃39; Seaught，Juliette（Clotilde Hesme）之间的旧浪漫的重新努力？\n 奥马尔SY仍然是突出表现，看起来更像是法国詹姆斯邦德。但他＆＃39;由恒星配套铸造，特别是粗糙，Hesme，Sagnier和Guerrab。杨氏铸造的铸造特别启发;你真的相信那些年轻人会长大到成年人＆＃39;在当天重新生根。\n 写作很紧张，故事沿着Aspreckeck速度拉链，沿途建立了一些真正的钉子尖锐的悬念。许多悬念源于令人想到的是，鉴于佩莱格里尼和巨大的资源和强大的狡猾，令人兴奋的悬念是多长时间的Assane可以维持高线法案。最终，是什么让这个系列如此令人愉快的是，一遍又一遍地的启示，即使净腹部开始收紧，也令人愉快地散发出他的各种拮抗剂。谁＆＃39;喜欢在弱者上欢呼？它＆＃39;也是一个热情的竞争力色情典范，我最喜欢的子系列之一。\n 羽扇豆的两个季节都在Netflix上流媒体，它们一起制作完美的狂欢腕表。 Netflix已经续订了第3部分的系列，所以我们＆＃39; LL更多的是未来的潇洒爆炸漏洞。用英语字幕看它用英文字幕 - 相信我，英语 - 配音版是畏缩诱导。 ", "note_en": "French actor Omar Sy returns in another knockout turn as self-styled &#34;gentleman thief&#34; Assane Diop in Part 2 of Netflix&#39;s surprise French hit series   Lupin. In my review earlier this year, I called Part 1 a &#34;delightful contemporary reimagining of a classic character in French detective fiction,  Arsène Lupin—a gentleman thief and master of disguise who was essentially the French equivalent of Sherlock Holmes.&#34; I was delighted to discover that Part 2 is even better, with twists, turns, and surprise reveals galore—all without sacrificing those crucial character-enriching quiet moments that add a bit of depth. It&#39;s the best series of 2021 thus far.\n  Lupin&#39;s original creator,  Maurice LeBlanc, featured his gentleman thief in 17 novels and 39 novellas, so there is plenty of source material to work with. The Netflix series is the creation of  Louis Leterrier, who directed the 2013 heist thriller   Now You See Me, in which a band of magicians pulls off ingenious robberies. So it&#39;s easy to see why he was drawn to this project. Per the official premise, &#34;As a teenager, Assane Diop&#39;s life was turned upside down when his father died after being accused of a crime he didn’t commit. 25 years later, Assane will use  Arsène Lupin, Gentleman Burglar as his inspiration to avenge his father.&#34;\n  In Part 1, we met the Senegal-born Assane (Omar Sy) while he&#39;s working as a lowly janitor at the Louvre. On exhibit at the time, in advance of a public auction to sell the piece to the highest bidder, was a jeweled necklace that once belonged to Marie Antoinette.\n It was this recently recovered necklace that his father, Babakar (Fargass Assandé), was falsely accused by wealthy financier Hubert Pellegrini (Hervé Pierre) of stealing when Assane was a boy. Assane was out for revenge for his father&#39;s subsequent suicide. After duping local gang members into pulling a decoy heist, Diop disguises himself as a wealthy potential buyer and crashes the auction—and ultimately walks away with the necklace. (The pilot drew heavily from LeBlanc&#39;s  The Queen&#39;s Necklace—the title of the pilot episode, which incorporates several plot elements of the original story.\n    That was just the beginning of the story as we learned more about Assane&#39;s history—including his relationship with childhood sweetheart Claire (Ludivine Sagnier), the mother of his son Raoul (Etan Simon)—and why he modeled his artful schemes on the exploits of Arsène Lupin. Assane&#39;s anonymity was at risk, since the police took particular notice of that high-profile heist. Captain Romain Laugier (Vincent Londez), Lt. Sofia Belkacem (Shirine Boutella), and Det. Youssef Guedira (Soufiane Guerrab), were part of the team investigating the Louvre heist. Guedira was also a Lupin  uber-fan; he was the only one in the department to notice the similarities between Diop&#39;s work and the fictional gentleman burglar.\n    The only real flaw with Part 1 was that it was  far too short—a mere five episodes—and it ended with a maddening cliffhanger. This was likely due to a pandemic shutdown, because Part 2 is very much a direct continuation of the same larger narrative arc rather than presenting Lupin with a fresh mission and antagonist(s). In the Part 1 finale, Assane believed he could reveal Pellegrini&#39;s rampant corruption to the media—only to find that doesn&#39;t really work when one&#39;s enemy pretty much controls the press. Pellegrini is a crafty little weasel and sent one of his goons, Léonard (Adama Niane), after Assane as he traveled to  Étretat with his family to mark the birthday of Arsène Lupin. Assane bested Léonard in their confrontation on the train, but the goon retaliated by kidnapping Raoul.\n    Part 2 picks up with Raoul&#39;s kidnapping at Étretat. Assane vows to recover his son and bring down Pellegrini once and for all, but that&#39;s going to be difficult since Pellegrini has used his extensive contacts in the government, media, and police force—including corrupt Paris police Commissioner Gabriel Dumont (Vincent Garanger)—to frame Assane for a crime he didn&#39;t commit. Assane is now the most wanted man in France.\n So Assane and his loyal ally, jeweler Benjamin Ferel (Antoine Gouy), decide to disappear for a bit to concoct a new plan while in hiding. Meanwhile, Pellegrini is setting a trap for our gentleman thief: a symphony performance in honor of Arsène Lupin to raise funds for his daughter&#39;s charitable foundation. Claire&#39;s loyalty has finally been pushed to the breaking point with the disappearance of her son. And might there be a rekindling of the old romance between Assane and Pellegrini&#39;s daughter, Juliette (Clotilde Hesme)?\n Omar Sy remains the standout performance, looking more like a French James Bond than ever. But he&#39;s bolstered by a stellar supporting cast, especially Gouy, Hesme, Sagnier, and Guerrab. The casting of young Assane and young Claire was particularly inspired; you really believe those young people would grow up into the adults we&#39;re rooting for in the present day.\n The writing is tight, and the story zips along at breakneck speed, building some genuine nail-biting suspense along the way. Much of that suspense arises from wondering just how long Assane can maintain the high-wire act, given Pellegrini&#39;s vast resources and formidable cunning. Ultimately, what makes this series so delightful is the revelation, over and over, of how Assane eventually outwits his various antagonists, even as the net begins to tighten. Who doesn&#39;t love to cheer on the underdog? It&#39;s also a terrific example of  competence porn, one of my favorite subgenres.\n Both seasons of  Lupin are now streaming on Netflix, and together they make the perfect binge-watch. Netflix has already renewed the series for Part 3, so we&#39;ll be getting lots more of Assane&#39;s dashing exploits in the future. Watch it in French with English subtitles—trust me, the English-dubbed version is cringe-inducing.", "posttime": "2021-06-25 02:55:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "奥马尔,omar,assane", "title": "综述：奥马尔SY普照比以往更明亮，就像羽扇豆第2部分的绅士小偷 ", "title_en": "Review: Omar Sy shines brighter than ever as gentleman thief in Lupin Part 2", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/review-lupin-part-2s-many-twists-and-reveals-will-delight-shows-fans/", "via": "", "real_tags": ["奥马尔", "omar", "assane"]}, {"category": "", "categoryclass": "", "imagename": "a2d85c34a355937a6a9deb65ce5c290d.png", "infoid": 1068078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tripp一直在建立沉浸式放松练习，该练习旨在混合有些经验，其中一些经验可以在引导的冥想应用中找到更多的自由形式体验，让用户从他们的一天拔掉，并在观看分形状时探索虚拟现实耳机内的想法，发光的树木和行星越过他们。\n 众所周知，启动有一些努力，以创建模仿人们在迷幻旅行中可能拥有的感情的视觉和音频体验 - 虽然做了如此的幻觉。\n  “许多人永远不会觉得舒服的迷幻，这是一种低摩擦的替代方案，可以以更加良好的方式提供一些体验，”CEO Nanea Reeves告诉TechCrunch。 “这个想法是将介绍结构和视频游戏力学在一起，看看我们是否可以真正破解你的感受。”\n 创业公司告诉TechCrunch他们已经关闭了由Vine Ventures和Mayfield的资金为1100万美元的资金，并参与综合。 Tripp在迄今为止的总资金中筹集了大约1500万美元。\n  VR初创公司在很大程度上努力在近年来赢得投资者热情，因为主要的科技平台唯一一个逐渐离开Facebook和索尼作为一个空间的唯一福利商，他们仍然在努力在努力通过时代努力。虽然大量的VR初创公司继续看待参与，但是五年前，许多投资者在空间内推翻了公司的推动，他们对具有更多广泛应用的游戏和计算机视觉初创公司。\n Reeves说，大流行有助于消费者拨入心灵和心理健康意识的重要性，这也推动了投资者在他们支持空间的项目中获得更大胆的项目。\n Tripp在Oculus和PlayStation VR商店和订阅体验中有应用程序，可以获得每月4.99美元的订阅。 \n该公司提供了各种导游的经验，但用户还可以使用公司的“Tripp Composer”来构建自己的视觉流动。 除了定制之外，特里普的主要销售人员将为消费者提供更越来越宽正的冥想体验，声称用户可以在耳机内部减轻课程减轻课程的压力。 启动还探索了该平台在企业办公健康解决方案中的用途。 Tripp目前在临床试验中，研究软件平台作为治疗装置的有效性。  该公司表示，到目前为止，用户已在应用程序内经历超过200万次会话。 ", "note_en": "Tripp has been building immersive relaxation exercises that seek to blend some of the experiences users may find in guided meditation apps with more free-form experiences that allow users to unplug from their day and explore their thoughts inside a virtual reality headset while watching fractal shapes, glowing trees and planets whir past them.\n As the name implies, there have been some efforts by the startup to create visuals and audio experiences that mimic the feelings people may have during a psychedelic trip — though doing so sans hallucinogens.\n  “Many people that will never feel comfortable taking a psychedelic, this is a low friction alternative that can deliver some of that experience in a more benign way,” CEO Nanea Reeves tells TechCrunch. “The idea is to take mindfulness structures and video game mechanics together to see if we can actually hack the way that you feel.”\n The startup tells TechCrunch they’ve closed a $11 Million in funding led by Vine Ventures and Mayfield with participation from Integrated, among others. Tripp has raised some $15 million in total funding to date.\n  VR startups have largely struggled to earn investor fervor in recent years as major tech platforms have sunsetted their virtual reality efforts one-by-one leaving Facebook and Sony as the sole benefactors of a space that they are  still struggling to monetize at times. While plenty of VR startups are continuing to see engagement, many investors which backed companies in the space five years ago have turned their attention to gaming and computer vision startups with more broad applications.\n Reeves says that the pandemic has helped consumers dial into the importance of mindfulness and mental health awareness, something that has also pushed investors to get bolder in what projects in the space that they’re backing.\n Tripp has apps on both the Oculus and PlayStation VR stores and subscription experiences that can be accessed for a $4.99 per month subscription.\n The company provides a variety of guided experiences, but users can also use the company’s “Tripp composer” to build their own visual flows. Beyond customization, one of Tripp’s major sells is giving consumers deeper, quicker meditative experiences, claiming that users can get alleviate stress with sessions as short as 8 minutes inside their headset. The startup is also exploring the platform’s use in enterprise in-office wellness solutions.  Tripp is currently in the midst of clinical trials to study the software platform’s effectiveness as a therapeutic device.\n The company says that users have gone through over 2 million sessions inside the app so far.", "posttime": "2021-06-25 02:54:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冥想,vr", "title": "迷幻VR冥想启动Tripp提高了1100万美元 ", "title_en": "\n\t\t\t\tPsychedelic VR meditation startup Tripp raises $11 million Series A\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/psychedelic-vr-meditation-startup-tripp-raises-11-million-series-a/", "via": "", "real_tags": ["冥想", "vr"]}, {"category": "", "categoryclass": "", "imagename": "8c95615e335ba6c4596ecccb9a6983d4.jpg", "infoid": 1068077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft即将推出的Windows 11 OS附带了几种新功能和改进。正如您所期望的主要操作系统更新，Microsoft还删除了Windows 10中可用的多个功能。例如，时间轴已消失。此外，平板电脑模式功能。您可以在下面的Windows 11中找到已删除的完整功能列表。\n Cortana将不再包含在第一个启动体验中或固定到任务栏中。\n 使用Microsoft帐户登录时，桌面壁纸无法播放到设备或设备。\n Internet Explorer已禁用。 Microsoft Edge是推荐的替代品，包括IE模式，在某些情况下可能有用。\n 数学输入面板被删除。数学识别器将按需安装并包括数学输入控制和识别器。在oneNote等应用中的数学墨水不会受到这种变化的影响。\n 新闻＆amp;兴趣已经进化。添加了新功能，可以通过单击任务栏上的窗口小部件图标来找到。\n   剪切工具继续可用，但Windows 10版本中的旧设计和功能已被替换为先前称为Snip＆amp的应用程序。草图。 \n在Windows 11中，启动显着更改，包括以下关键折旧和removals：不再支持名为Apps的名称组和文件夹，并且该布局目前不可调整。\n  现场瓷砖不再可用。有关光明，动态内容，请参阅新小部件功能。\n 删除了平板电脑模式，并包含新功能和功能，用于键盘附件和分离姿势。\n 更改任务栏功能，包括：某些图标可能不再出现在系统托盘（Systray）中，用于升级的设备，包括先前的自定义。\n 触摸键盘将在屏幕尺寸18英寸和更大的屏幕上不再停靠和脱锁键盘布局。\n 升级不会删除以下应用程序，但将不再安装在新设备上或清洁安装Windows 11时。它们可从商店下载：\n 文章中的某些链接可能不像使用adblocker一样可访问。请将我们添加到您的白名单中以使网站能够正常运行。 \n有关的 ", "note_en": "Microsoft’s upcoming Windows 11 OS comes with  several new features and improvements. As you expect from a major OS update, Microsoft is also removing several features that were available in Windows 10. For example, Timeline is gone. Also, the Tablet mode feature. You can find the full list of features that are removed in Windows 11 below.\n Cortana will no longer be included in the first boot experience or pinned to the Taskbar.\n Desktop wallpaper cannot be roamed to or from device when signed in with a Microsoft account.\n Internet Explorer is disabled.  Microsoft Edge is the recommended replacement and includes IE Mode which may be useful in certain scenarios.\n Math Input Panel is removed. Math Recognizer will install on demand and includes the math input control and recognizer. Math inking in apps like OneNote are not impacted by this change.\n News &amp; Interests has evolved. New functionality has been added which can be found by clicking the Widgets icon on the Taskbar.\n   Snipping Tool continues to be available but the old design and functionality in the Windows 10 version has been replaced with those of the app previously known as Snip &amp; Sketch.\n Start is significantly changed in Windows 11 including the following key deprecations and removals: Named groups and folders of apps are no longer supported and the layout is not currently resizable.\n  Live Tiles are no longer available. For glanceable, dynamic content, see the new Widgets feature.\n Tablet Mode is removed and new functionality and capability is included for keyboard attach and detach postures.\n Taskbar functionality is changed including: Some icons may no longer appear in the System Tray (systray) for upgraded devices including previous customizations.\n Touch Keyboard will no longer dock and undock keyboard layouts on screen sizes 18 inches and larger.\n The following apps will not be removed on upgrade but will no longer be installed on new devices or when clean-installing Windows 11. They are available for download from the Store:\n Some links in the article may not be viewable as you are using an AdBlocker. Please add us to your whitelist to enable the website to function properly.\n    Related", "posttime": "2021-06-25 02:47:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,电脑,features,功能", "title": "在Windows 11中已弃用或删除的功能列表，包括引导体验中的Cortana，开始菜单中的Live Tiles和平板电脑模式 ", "title_en": "List of features that are deprecated or removed in Windows 11, including Cortana in the boot experience, Live Tiles in the Start menu, and tablet mode", "transed": 1, "url": "https://mspoweruser.com/microsoft-list-of-features-that-are-deprecated-or-removed-in-windows-11/", "via": "", "real_tags": ["windows", "电脑", "features", "功能"]}, {"category": "", "categoryclass": "", "imagename": "2c463a4f7ce312c96157ab4ecd9e8af2.png", "infoid": 1068076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Yusuf Mehdi，Microsoft Corporate现代生活副总裁，搜索＆amp; 设备加入Yahoo Finance的Dan Howley和Yahoo Finance Live小组，讨论微软的最新消息。  完成CFA®计划，获得CFA宪章，并在投资管理方面获得无与伦比的专业知识。 ", "note_en": "Yusuf Mehdi, Microsoft Corporate Vice President of Modern Life, Search &amp; Devices joins Yahoo Finance’s Dan Howley and the Yahoo Finance Live panel to discuss the latest news from Microsoft.\n Complete the CFA® Program, earn the CFA charter, and gain unparalleled expertise in investment management.", "posttime": "2021-06-25 02:47:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,microsoft,apple,破解,company", "title": "微软第二家公司在Apple之后破解2T估值 ", "title_en": "Microsoft second company to crack $2T valuation, after Apple", "transed": 1, "url": "https://finance.yahoo.com/quote/MSFT/", "via": "", "real_tags": ["微软", "microsoft", "apple", "破解", "company"]}, {"category": "", "categoryclass": "", "imagename": "a42e3ae8e0bcda78b42e044fe95f1f64.jpg", "infoid": 1068075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "81M.ORG自2月初以来一直在跟踪白宫视频。今天我揭示了youtube删除的不喜欢的不喜欢的跑步计数，因为开始了81米.org。\n        81M.org追踪白宫释放的655个视频。白宫YouTube频道仅列出了427个视频。他们删除了228个视频！\n   顺便说一句，这不包括130,000岁的不喜欢在此处删除26到27日，如这里所发现的那样。\n  ＃zoe phin，2021/06/21＃文件：81m.sh＃运行：源81m.sh;所有＃输出：resous.txtvidlist（）{u =＆＃34; https：//81m.org&#34;最后= $（wget -qo-$ u | egrep -o＆＃39; / [0-9] +＆＃39; | tail -1 | tr -cd 0123456789）为我以$（seq $ lall）; wget -qo-＆＃34; $ u / $ i /＃34; | awk -f \\＆＃39; ＆＃39; $ 2〜/ OS \\ // {print＆＃34; https：//81m.org&#34; $ 2＆＃34; /data.tsv&#34;}＆＃39;完成| TEE Vidlist.csv} archive（）{mkdir -p数据以$（cat vidlist.csv）; dget -o data / $ {i：23：11} .csv $ i done} removals（）{for $（ls数据）; do awk -vv = $ {f：0：11}＆＃39; {d = $ 3-d;如果（d＆lt; 0）s + = d; d = $ 3}结束{print v＆＃34; ＆＃34; s}＆＃39;数据/ $ F DOOD | awk＆＃39; {print＆＃34; https：//www.youtube.com/watch？v =＆＃34; $ 1＆＃34; ＆＃34; 2美元; s + = $ 2}结束{print＆＃34; \\ ntotal：＆＃34; s}＆＃39; | TEE已删除.txt} totals（）{for $ $（ls data）; do tail -1数据/ $ f echo完成| awk＆＃39; {v + = $ 1; l + = $ 2; d + = $ 3}结束{print＆＃34;观点：＆＃34; v＆＃34; \\ nlikes：＆＃34; l＆＃34; \\ ndislikes：＆ ＃34; d}＆＃39;}全部（）{vidlist;档案;总计;去除; }\n 请仅使用此代码进行研究，而不是垃圾邮件垃圾邮件，我的匿名朋友制作了该网站。谢谢你。 ", "note_en": "81m.org has been keeping track of White House videos since early February. Today I reveal the running count of dislikes removed by YouTube since the inception of 81m.org.\n        81m.org tracked 655 videos released by the White House. Only 427 videos are listed on  White House’s YouTube Channel.  They removed 228 videos!\n   BTW, this does not include the 130,000 dislikes removed Jan 26 to 27, as discovered  here.\n  # Zoe Phin, 2021/06/21# File: 81m.sh# Run: source 81m.sh; all# Output: removed.txtvidlist() { u=&#34;https://81m.org&#34; last=$(wget -qO- $u | egrep -o &#39;/[0-9]+&#39; | tail -1 | tr -cd 0123456789) for i in $(seq $last); do wget -qO- &#34;$u/$i/&#34; | awk -F\\&#39; &#39; $2~/os\\//{print &#34;https://81m.org&#34;$2&#34;/data.tsv&#34;}&#39; done | tee vidlist.csv}archive() { mkdir -p data for i in $(cat vidlist.csv); do wget -O data/${i:23:11}.csv $i done}removals() { for f in $(ls data); do awk -vv=${f:0:11} &#39;{D=$3-d;if(D&lt;0)S+=D;d=$3}END{print v&#34; &#34;S}&#39; data/$f done | awk &#39;{print &#34;https://www.youtube.com/watch?v=&#34;$1&#34; &#34;$2; S+=$2}END{ print &#34;\\nTotal: &#34;S}&#39; | tee removed.txt}totals() { for f in $(ls data); do tail -1 data/$f echo done | awk &#39;{V+=$1;L+=$2;D+=$3} END {print &#34;Views: &#34;V&#34;\\nLikes: &#34;L&#34;\\nDislikes: &#34;D}&#39;}all() { vidlist; archive; totals; removals; }\n Please use this code only for research, and not to spam my anonymous friend who made that site. Thank you.", "posttime": "2021-06-25 02:47:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,white,白宫", "title": "Youtube删除了390万不喜欢白宫 ", "title_en": "YouTube removed 3.9M dislikes for White House", "transed": 1, "url": "https://phzoe.com/2021/06/21/youtube-removed-3-9-million-dislikes-for-white-house/", "via": "", "real_tags": ["youtube", "white", "白宫"]}, {"category": "", "categoryclass": "", "imagename": "88a29d1ad213be5cffb53095eabbf3b7.jpg", "infoid": 1068074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "支持当地新闻来源是突然的技术行业的担忧，而且与Windows 11，微软正在与本地新闻“内容创作者和作者”的前沿和中心一起添加集成。  在扩展天气和新闻任务栏窗口小部件中，它最近添加到Windows 10，它不仅突出显示了您所在领域的来源，而且它有权建立的付款功能。如视频流中所示，您可以支持直接现金的人 捐赠或微软积分，它显示了多少个拖车为每个人提供了贡献。  对于创建者和发布者，小部件还在Windows内打开新的房地产来提供个性化内容。 我们的愿望是为全球品牌和当地创作者创造一个充满活力的管道，以至于消费者和创造者都可以受益。 ", "note_en": "Supporting local news sources is suddenly something the tech industry worries about, and with Windows 11, Microsoft is adding integration with local news “content creators and authors” front and center.\n In an expansion on the  weather and news taskbar widget it recently added to Windows 10, it not only highlights sources in your areas, but it has a payment feature built right in. As shown in the video stream, you can support people with straight cash donations or Microsoft points, and it shows how many tippers are contributing to each person.\n For creators and publishers, Widgets also opens new real estate within Windows to deliver personalized content. Our aspiration is to create a vibrant pipeline for global brands and local creators alike, in a way that both consumers and creators can benefit.", "posttime": "2021-06-25 02:46:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,推进,feed,提供", "title": "Windows 11的新闻源已内置推进，以支持本地内容创建者 ", "title_en": "Windows 11’s news feed has built-in tipping to support local content creators", "transed": 1, "url": "https://www.theverge.com/2021/6/24/22548804/microsoft-windows-11-news-feed-creators-tipping", "via": "", "real_tags": ["windows", "推进", "feed", "提供"]}, {"category": "", "categoryclass": "", "imagename": "c8a5eb861a98376a94a1f224a8e53eaa.png", "infoid": 1068072, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当然，Snapchat对音乐的投资是对Tiktok上的音乐增长的直接反应。去年，Fleetwood Mac的1977年专辑“谣言”在“梦想”之后重新进入了“梦”的广告牌图表，在记录中的一首歌，在Tiktok上了病毒。舞蹈趋势也经常在Tiktok上进行病毒，这可以与歌曲所展示的艺术家的销售销售相关。因此，由Tiktok和Snapchat等应用程序许可的音乐越多，另一个Nathan Apodaca时刻的机会越多，这意味着平台的自由宣传。\n  奥利维亚罗德里戈这样的Gen Z艺术家已经利用这些社交平台来促进他们的新音乐。在Snap上，使用她的歌曲“驾驶执照”创建超过1000万个视频。 Rodrigo也是第一个在Snapchat上使用AR镜头的艺术家，以促进她的记录突发的首次亮相“酸”，而是公平，她还在Instagram上分享了AR效果。\n Olivia Rodrigo在她的新专辑中讲述了“deja vu”，您也可能从Snap的公告中获得Deja Vu。 Tiktok还在2月份达成了UMG。在此之前，11月，Tiktok宣布与索尼新的许可协议。与此同时，Snap的音乐伙伴组合包括华纳音乐集团，索尼音乐出版等等。这些交易不是排他性的 - 您可以在Snapchat，Tiktok和Instagram上使用“deja vu”进行视频。当涉及这样的交易时，这是一个不断的反动一致的反动之战。如果Tiktok达成协议，Snapchat需要与UMG进行交易，并保持竞争力，这就是我们今天所看到的。正如我们的朋友奥利维亚会说，它在这里野蛮。 ", "note_en": "Of course, Snapchat’s investment in music is a direct response to the growth of music on TikTok. Last year, Fleetwood Mac’s 1977 album “Rumours” re-entered the Billboard charts after “Dreams,” a song on the record, went viral on TikTok. Dance trends also often go viral on TikTok, which can correlate with a boost in sales for the artist whose song is featured. So, the more music that’s licensed by apps like TikTok and Snapchat, the more opportunity there is for  another Nathan Apodaca moment, which means free publicity for the platform.\n  Already, gen Z artists like Olivia Rodrigo have leveraged these social platforms to promote their new music. On Snap, over 10 million videos were created using her song “Driver’s License,” Snap reports. Rodrigo was also the first artist to use AR Lenses on Snapchat to promote her record-breaking debut “Sour,” but to be fair, she also shared AR effects on Instagram.\n Olivia Rodrigo sings about “ deja vu” on her new album, and you might also be getting deja vu from Snap’s announcement. TikTok also  struck a deal with UMG in February. And before that, in November, TikTok announced  a new licensing agreement with Sony. Meanwhile, Snap’s portfolio of music partners include Warner Music Group, Sony Music Publishing, and more. These deals aren’t exclusive — you can make a video with “deja vu” on Snapchat, TikTok, and Instagram alike. When it comes to deals like these, it’s a constant battle of reactionary one-upmanship. If TikTok makes a deal with UMG, Snapchat needs to strike a deal with UMG as well to remain competitive, which is what we’re seeing today. As our friend Olivia would say,  it’s brutal out here.", "posttime": "2021-06-25 02:10:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,通用,deal,音乐", "title": "snap与通用音乐组进行交易，将其目录添加到声音中 ", "title_en": "\n\t\t\t\tSnap makes a deal with Universal Music Group, adding its catalog to Sounds\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/snap-makes-a-deal-with-universal-music-group-adding-its-catalog-to-sounds/", "via": "", "real_tags": ["交易", "通用", "deal", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "85125b6ce7d5fa1c07b729fbba5916eb.jpg", "infoid": 1068071, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "暴露的Gitlab服务器是在周六的基于迪拜的Spidersilk中发现的，一个网络安全公司归功于在三星，ClearView AI和MoviePass的Samsung发现数据溢出。\n 组织使用Gitlab协作开发和存储其源代码 - 以及项目工作所需的秘密密钥，令牌和密码 - 在他们控制的服务器上。但是，公开的服务器可以从互联网访问，并配置了，所以从组织外部的任何人都可以创建用户帐户并登录普通的Spidersilk的首席安全官员Mossab Hussin告诉TechCrunch。\n 当TechCrunch访问Gitlab服务器时，登录页面显示它已接受新用户帐户。它还没有知道Gitlab服务器以这种方式可以访问的时间，但是Shodan的历史记录，用于公开设备和数据库的搜索引擎，显示Gitlab于3月18日在互联网上检测到。\n Spidersilk共享了几个屏幕截图，显示Gitlab服务器包含与属于纽约州信息技术服务办公室的服务器和数据库相关的秘密密钥和密码。担心曝光的服务器可以恶意地访问或篡改，启动要求帮助披露到状态的安全失误。\n 在找到服务器后，TechCrunch在短时间内提醒纽约州长办公室到曝光。向州长办公室提供众多曝光Gitlab服务器详细信息的电子邮件，但未回复。服务器周一下午脱机。\n 苏格兰乐队，纽约州信息技术服务办公室的发言人表示，服务器是“由供应商设置的测试盒，没有任何数据，它已经被其退役。” （Reif宣布他的回答“在背景上”并​​归因于国家官员，这将需要双方提前同意这些条款，但我们正在打印回复，因为我们没有机会拒绝这些条款。）\n 当被问到时，reif不会说供应商是谁或者如果服务器上的密码已更改。服务器上的几个项目标记为“生产”或“生产”的常见速写，这是积极使用的服务器的术语。 Reif也不会说该事件是否报告给州的司法部长办公室。达到后，司法部长的发言人不会通过新闻时间发表评论。 \nTechCrunch了解供应商是Indotronix-Avani，这是一家以纽约的一家公司在印度设有办事处，由风险投资公司Nigama Ventures拥有。 几个屏幕截图显示了Indotronix-Avani的项目经理修改了一些Gitlab项目。 供应商的网站吹捧纽约州的网站，以及其他政府客户，包括美国国务院和美国国防部。 ", "note_en": "The exposed GitLab server was discovered on Saturday by Dubai-based SpiderSilk, a cybersecurity company credited with discovering data spills at  Samsung,  Clearview AI and  MoviePass.\n Organizations use GitLab to collaboratively develop and store their source code — as well as the secret keys, tokens and passwords needed for the projects to work — on servers that they control. But the exposed server was accessible from the internet and configured so that anyone from outside the organization could create a user account and log in unimpeded, SpiderSilk’s chief security officer Mossab Hussin told TechCrunch.\n When TechCrunch visited the GitLab server, the login page showed it was accepting new user accounts. It’s not known exactly how long the GitLab server was accessible in this way, but  historic records from Shodan, a search engine for exposed devices and databases, shows the GitLab was first detected on the internet on March 18.\n SpiderSilk shared several screenshots showing that the GitLab server contained secret keys and passwords associated with servers and databases belonging to New York State’s Office of Information Technology Services. Fearing the exposed server could be maliciously accessed or tampered with, the startup asked for help in disclosing the security lapse to the state.\n TechCrunch alerted the New York governor’s office to the exposure a short time after the server was found. Several emails to the governor’s office with details of the exposed GitLab server were opened but were not responded to. The server went offline on Monday afternoon.\n Scot Reif, a spokesperson for New York State’s Office of Information Technology Services, said the server was “a test box set up by a vendor, there is no data whatsoever, and it has already been decommissioned by ITS.” (Reif declared his response “on background” and attributable to a state official, which would require both parties agree to the terms in advance, but we are printing the reply as we were not given the opportunity to reject the terms.)\n When asked, Reif would not say who the vendor was or if the passwords on the server were changed. Several projects on the server were marked “prod,” or common shorthand for “production,” a term for servers that are actively use. Reif also would not say if the incident was reported to the state’s Attorney General’s office. When reached, a spokesperson for the Attorney General did not comment by press time.\n TechCrunch understands the vendor is Indotronix-Avani, a New York-based company with offices in India, and owned by venture capital firm Nigama Ventures. Several screenshots show some of the GitLab projects were modified by a project manager at Indotronix-Avani. The vendor’s website touts New York State on  its website, along with other government customers, including the U.S. State Department and the U.S. Department of Defense.", "posttime": "2021-06-25 02:09:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,办公室,code,服务器", "title": "纽约州IT办公室使用的内部代码追溯在线公开 ", "title_en": "\n\t\t\t\tAn internal code repo used by New York State’s IT office was exposed online\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/an-internal-code-repo-used-by-new-york-states-it-office-was-exposed-online/", "via": "", "real_tags": ["代码", "办公室", "code", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "a919057f2135d746f3621c24b3e64f52.jpg", "infoid": 1068070, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "4月Dominguez是英俊的联合创始人兼首席执行官，该应用程序提供具有平等职业机会的美容专业人士。在创始帅哥之前，她在投资初学者担任副总统之前，在那里筹集并投入了超过1.3亿美元的投资创业。\n Nikki Dominguez是一个联合创始人和英俊的总统，一个应用程序，提供具有平等职业机会的美容专业人士。她还建造了两个美容院和一所学校，并将70名队伍队成了150多名造型师的团队。\n  我们在管道中的任何资助机会蒸发了。对于考虑到达新的和不足的创始人的投资者来说，这尤其如此。\n 但是，筹款市场在2020年迅速回来 - 某些人。虽然我们很高兴在大流行中期已经关闭了150万美元的种子上，但我们过去面临的挑战仍在继续。在去年夏天起飞的黑人生命物质运动后，散光只转过少数民族创始人，我们开始在2020年底再次追求筹款。我们可以通过投资者与我们的音高甲板互动或者问我们已经预先审查的问题关于我们和我们的业务的想法。\n 我们在跑步时的第二年，并且牵引着类似的，如果不是更好的话，那么其他以所获得资助的男性为中心的初创公司，我们仍然在筹款时遇到摩擦。难点是，我们没有任何具体证据，以及为什么少数民族和女性团队更加艰难的具体证据，以外，我们的明显挑战和个人经历。允许男人在鸡尾酒餐巾后面有愿景或想法，而女性需要完全建立企业和收入流。\n  DocSend，我们和数千个其他初创公司用于向投资者发出音高甲板的工具，分析了投资者如何与俯卧撑互动。最近的Docsend学习证实了我们的亨希，发现投资者确实审查了妇女和少数群体的企业的甲板。\n 例如，他们的数据显示投资者在预先种子阶段的所有女性团队的甲板的商业模式部分比全男性队伍中的商业模式部分花了20％。虽然在甲板的特定部分所花费的时间可能似乎表明更多的兴趣，但它实际上可以成为更严重审查和怀疑的迹象。 \n当你看看你投球的平均VC的化妆时，很可能是一个中年白人。当投球英俊 - 恢复美容行业的教育和社区的东西 - 您可以想象大多数VCS不了解手头的价值和机会。虽然美女是190亿美元的全球产业（美国600亿美元），但不遵循这个行业的投资者可能很难了解该行业如何运作，以及我们的业务如何适合这个蓬勃发展的市场的艰难时间。 。更进一步的是，由于“美丽”标签，投资者可能完全诋毁我们的业务。\n 所有这些因素都会导致更多时间分析业务模式 - 及其活力 - 在我们的音高甲板上铰接。实际上，VCS很忙，如果他们在您的业务的基础上花费更多时间，他们不明白。他们更有可能寻找您的业务无法正常工作的方式。而且，坦率地说，我们不是商学院毕业生或斯坦福校友，所以想要使他们的投资组合失败的投资者将更多的时间在我们知道如何建立业务时看看我们的甲板。\n  尽管如此，我们相信大部分时间，投资者甚至都不知道他们正在致力于这些偏见。他们没有意识到他们可能已经给你写下了，这是问题的一部分。对潜意识偏见的认识是实现积极变化的第一步。投资者可能认为他们只是通过参加会议或者在咖啡上提供指导，透明地，他们已经将你算出来了漏斗。\n 尽管障碍正在降低，但少数族创始人刚刚开始仍然有很难的时间徒步入门。大多数代表性的创始人没有建立的网络，使得甚至难以获得最初的介绍。这就是为什么这些创始人没有见面。因此，即使更多的投资者善意，创始人仍然无法访问他们需要发展业务的资本。\n 暗示有意义的变化需要时间和精力。真正致命的人将在未来几年和几十年中致力于这些问题。它只是在更长的时间范围内，我们将能够判断投资者是否有前途的变革。改变创始人的人口统计数据需要一年，一年一度又一次地又一次。\n 只有这样，我们才能看到伟大思想未来的时间不会受到这些想法的人口的人口统计学的阻碍。 ", "note_en": "April Dominguez is the co-founder and CEO of  Handsome, an app that provides beauty professionals with equal career opportunities. Prior to founding Handsome, she spent six years as a vice president at an investment startup that raised and invested over $130 million during her time there.\n Nikki Dominguez is the co-founder and president of  Handsome, an app that provides beauty professionals with equal career opportunities. She also built two beauty academies and one school and turned a team of 70 into a team of more than 150 stylists.\n  Any funding opportunities we had in the pipeline evaporated. This was especially true for investors considering attempts to reach new and underrepresented founders.\n But the fundraising market came back pretty quickly in 2020 — for some. And though we are thrilled to have closed a $1.5 million pre-seed round in the middle of a pandemic, the challenges we faced in the past continued. The spotlight only turned back on minority founders after the Black Lives Matter movement took off last summer, and we began to pursue fundraising again in late 2020. We could tell by how investors interacted with our pitch deck or asked us questions that they already had preconceived ideas about us and our business.\n We were in our second year of running  Handsome and had traction similar to, if not better than, other male-centric startups that were getting funded, yet we still ran into friction when fundraising. The hard part was that we didn’t have any concrete evidence as to why, or the extent to which, fundraising was harder for minority and female teams outside of our apparent challenges and personal experiences. Men are allowed to have a vision or an idea on the back of a cocktail napkin, while women need to have fully established businesses and revenue streams.\n  DocSend, a tool that we and thousands of other startups use to send out pitch decks to investors, analyzed how investors interact with pitch decks. A recent DocSend  study confirmed our hunch, finding that investors do indeed scrutinize the decks of businesses founded by women and minorities differently.\n For instance, their data showed investors spent 20% longer on the business model section of decks from all-female teams at the pre-seed stage than all-male teams. While more time spent on a particular section of a deck may seem to indicate more interest, it can actually be a sign of greater scrutiny and skepticism.\n  When you look at the makeup of the average VC you are pitching to, it is likely a middle-aged white man. When pitching Handsome — something that’s reimagining the education and community of the beauty industry — you can imagine that most VCs don’t understand the value and opportunity at hand. Although beauty is a $190 billion global industry ($60 billion alone in the U.S.), investors who don’t follow this industry might have a hard time understanding how big it is, how the industry works, and how our business fits into this thriving market. Even further, investors might completely discredit our business because of the “beauty” label.\n All these factors can lead to more time spent analyzing the business model — and its viability — articulated in our pitch deck. In reality, VCs are busy, and if they’re spending more time on the fundamentals of your business, they don’t understand it. It’s more likely they are looking for ways that your business won’t work. And, frankly, we are not business school graduates or Stanford alumni, so investors who want to de-risk their portfolios will spend more time looking at our deck to gauge if we know how to build a business.\n  Despite all this, we believe that most of the time, investors don’t even know they are acting on these biases. They don’t realize they may have already written you off, which is part of the problem. Awareness of a subconscious bias is the first step toward making positive change. Investors may think they’re widening the funnel simply by taking a meeting or providing mentorship over coffee when, subconsciously, they’ve already counted you out.\n Even though the barriers are being lowered, minority founders just starting out still have a hard time getting their foot in the door. Most underrepresented founders don’t have an established network, making it difficult to get even an initial introduction. That’s why these founders aren’t getting meetings. So even with more investor goodwill, founders are still unable to access the capital they need to grow their businesses.\n It takes time and effort to enact meaningful changes. Truly committed people are going to work on these issues over the coming years and decades. It’s only on a longer time scale that we’re going to be able to tell whether investors promising change have delivered. Changing the demographics of the founders you fund requires year in, year out consistency, again and again and again.\n Only then will we see a time when the future of great ideas is not hindered by the demographics of the people building businesses out of those ideas.", "posttime": "2021-06-25 02:09:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "多样性,diversity,投资者", "title": "为了维持多样性，投资者必须融入他们无意识的偏见 ", "title_en": "\n\t\t\t\tTo sustain diversity, investors must tune into their unconscious biases\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/to-sustain-diversity-investors-must-tune-into-their-unconscious-biases/", "via": "", "real_tags": ["多样性", "diversity", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "7742da2f060f0f661de9686784ffc747.jpg", "infoid": 1068069, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安全研究人员在Dell SupportAssist的Biosconnect功能中发现了四个主要的安全漏洞，允许攻击者在受影响设备的BIOS中远程执行代码。\n 根据戴尔＆＃39; S网站，SupportAssist软件是＆＃34;预安装在运行Windows操作系统的大多数Dell设备上，＆＃34; Biosconnect提供远程固件更新和OS恢复功能。\n Eclypsium研究人员发现的缺陷链具有8.3 / 10的CVSS基本得分，使特权远程攻击者能够冒充Dell.com并控制目标设备＆＃39; S启动过程以打破OS级安全控件。\n ＆＃34;这样的攻击将使对手能够控制设备＆＃39; S启动过程并颠覆操作系统和更高层次的安全控制，＆＃34; Eclypsium研究人员在提前与BleepingComputer共享的报告中解释。\n ＆＃34;该问题影响了129个消费者和商业笔记本电脑，台式机和平板电脑的戴尔模型，包括由安全启动和戴尔安全核心PC保护的设备，＆＃34;大约有3000万个单独的设备暴露于攻击。\n  Readearchers确定了一个问题，导致BIOS从BIOS到Dell（被追踪为CVE-2021-21571）和三个溢出漏洞（CVE-2021-21572，CVE-2021-21573和CVE-2021-21574）的一个问题。\n 两个溢出安全漏洞＆＃34;影响OS恢复过程，而另一个影响固件更新过程，＆＃34; Eclypsium说。 ＆＃34;所有三个漏洞都是独立的，每个漏洞都可能导致BIOS中的任意代码执行。＆＃34; \n漏洞中的其他信息可以在Eclypsium＆＃39; s报告中找到以及戴尔＆＃39; s咨询中的受影响设备模型的完整列表。\n  根据Eclypsium的说法，用户将不得不更新所有受影响系统的系统BIOS / UEFI。研究人员还建议使用除SupportAssist和＃39; s生物连接功能之外的替代方法，以应用其设备上的BIOS更新。\n 戴尔为受影响的系统和更新到Dell.com上受影响的可执行文件的更新提供BIOS / UEFI更新。\n CVE-2021-21573和CVE-2021-21574 Don＆＃39; T要求额外的客户行动，因为它们于2021年5月28日所解决的服务器端。但是，CVE-2021-21571和CVE-2021-21572漏洞需要戴尔客户BIOS更新将完全解决。\n 无法立即更新其系统的用户可以从BIOS设置页面中禁用Biosconnect或使用Dell命令|配置（DCC）＆＃39; S远程系统管理工具。\n ＆＃34;此处介绍的特定漏洞允许攻击者远程利用主机的UEFI固件，并在设备上的最特权代码中获取控制，＆＃34;研究人员得出结论。\n ＆＃34;这种远程剥削性和高权限的组合可能会使远程更新功能在未来攻击者的诱人目标，组织应确保相应地监控和更新其设备。＆＃34; \n这不是戴尔计算机的第一次通过SupportAssist软件中发现的安全漏洞已接触到攻击。\n 两年前，2019年5月，该公司修补了另一种高度严重的支持员工远程执行（RCE）漏洞，由2018年的安全研究员Bill Demirkapi报告引起的脆弱性。\n 此RCE允许未经身份验证的攻击者在具有目标系统的同一网络访问层上，以远程在未括的设备上执行任意执行。\n 安全研究员Tom Forbes在2015年发现Dell系统检测软件中的类似RCE漏洞，允许攻击者触发错误的程序，以便在没有用户交互的情况下下载和执行任意文件。\n SupportAssist再次修补一年后，于2020年2月，为一个安全漏洞解决了安全漏洞，因为DLL搜索命令劫持错误，使启用本地攻击者在易受攻击设备上以管理员权限执行任意代码。\n 最后但并非最不重要的是，上个月戴尔解决了一个缺陷，使得可以从非管理员用户升级到内核权限的权限，这是Dbutil驱动程序中找到的错误，这些错误与数百万个戴尔设备一起划船。 ", "note_en": "Security researchers have found four major security vulnerabilities in the BIOSConnect feature of Dell SupportAssist, allowing attackers to remotely execute code within the BIOS of impacted devices.\n According to Dell&#39;s website, the  SupportAssist software is &#34;preinstalled on most Dell devices running Windows operating system,&#34; while  BIOSConnect provides remote firmware update and OS recovery features.\n The chain of flaws discovered by Eclypsium researchers comes with a CVSS base score of 8.3/10 and enables privileged remote attackers to impersonate Dell.com and take control of the target device&#39;s boot process to break OS-level security controls.\n &#34;Such an attack would enable adversaries to control the device&#39;s boot process and subvert the operating system and higher-layer security controls,&#34; Eclypsium researchers explain in a report shared in advance with BleepingComputer.\n &#34;The issue affects 129 Dell models of consumer and business laptops, desktops, and tablets, including devices protected by Secure Boot and Dell Secured-core PCs,&#34; with roughly 30 million individual devices exposed to attacks.\n  The reasearchers identified one issue leading to an insecure TLS connection from BIOS to Dell (tracked as CVE-2021-21571) and three overflow vulnerabilities (CVE-2021-21572, CVE-2021-21573, and CVE-2021-21574).\n Two of the overflow security flaws &#34;affect the OS recovery process, while the other affects the firmware update process,&#34; Eclypsium says. &#34;All three vulnerabilities are independent, and each one could lead to arbitrary code execution in BIOS.&#34;\n Additional info on the vulnerabilities can be found in  Eclypsium&#39;s report and the complete list of affected device models in  Dell&#39;s advisory.\n  According to Eclypsium, users will have to update the system BIOS/UEFI for all affected systems. The researchers also recommend using an alternate method other than the SupportAssist&#39;s BIOSConnect feature to apply BIOS updates on their devices.\n Dell is providing BIOS/UEFI updates for impacted systems and updates to affected executables on Dell.com.\n CVE-2021-21573 and CVE-2021-21574 don&#39;t require require additional customer action as they were addressed server side on May 28, 2021. However, the CVE-2021-21571 and CVE-2021-21572 vulnerabilities require Dell Client BIOS updates to be fully addressed.\n Users who cannot immediately update their systems can disable BIOSConnect from the BIOS setup page or using the  Dell Command | Configure (DCC)&#39;s Remote System Management tool.\n &#34;The specific vulnerabilities covered here allow an attacker to remotely exploit the UEFI firmware of a host and gain control over the most privileged code on the device,&#34; the researchers concluded.\n &#34;This combination of remote exploitability and high privileges will likely make remote update functionality an alluring target for attackers in the future, and organizations should make sure to monitor and update their devices accordingly.&#34;\n  This is not the first time owners of Dell computers have been exposed to attacks by security vulnerabilities found in the SupportAssist software.\n Two years ago, in May 2019, the company patched another high-severity  SupportAssist remote code execution (RCE) vulnerability caused by an improper origin validation weakness and reported by security researcher Bill Demirkapi in 2018.\n This RCE allowed unauthenticated attackers on the same Network Access layer with targeted systems to remotely execute arbitrary executables on unpatched devices.\n Security researcher Tom Forbes found a similar RCE flaw  in the Dell System Detect software in 2015, allowing attackers to trigger the buggy program to download and execute arbitrary files without user interaction.\n SupportAssist was again patched one year later, in February 2020, to address a security flaw due to a DLL search-order hijacking bug that enabled local attackers to  execute arbitrary code with Administrator privileges on vulnerable devices.\n Last but not least, last month Dell addressed a flaw making it possible to  escalate privileges from non-admin users to kernel privileges, a bug found in the DBUtil driver that ships with tens of millions of Dell devices.", "posttime": "2021-06-25 02:02:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "漏洞,黑客,ios,代码,戴尔", "title": "研究人员在戴尔SupportAssist的生物连接功能中发现了四种主要漏洞，让黑客远程执行代码，影响129戴尔型号 ", "title_en": "Researchers discover four major vulnerabilities in Dell SupportAssist's BIOSConnect feature, letting hackers remotely execute code, affecting 129 Dell models", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/dell-supportassist-bugs-put-over-30-million-pcs-at-risk/", "via": "", "real_tags": ["漏洞", "黑客", "ios", "代码", "戴尔"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068068, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当C程序运行时，它通常通过参数ARGC（参数计数）和argv（参数向量）接收任何命令行参数。该程序是解释该字符串数组的内容。\n 有很多方法可以这样做，其中一个更简单的解决方案是getoptfunction（以下，getopt将引用getopt和getopt_long）.one扩展一些getopt实现优惠，它们在处理它时重新排序Argv的argnectents，导致数组首先出现所有选项，然后是非活动。\n 此重新排序分区数组。并且我们想要一个稳定的分区，所以所有选项的相关顺序，并且所有的非活动都是相同的。\n 去年我发布了Parg，一个简单的解析器，用于argv，它与getopt类似。它有一个单独的函数parg_reorder（），它执行此功能。我使用了一个简单的算法 - 分配临时数组的argv大小，解析参数，并从新阵列的末尾填写startand非活动的选项。然后将它们复制回来，将非活动倒在过程中的原始订单中。在后威尔，我可以立即将期权移入argv的最后一个地方。\n 这及时运行，但也需要额外的空间。条件要求可能是一个问题（例如嵌入式系统），索勒格看看我们是否可以做得更好。\n 以下代码示例是伪代码，并浏览一天。有关工作C ++代码，请参阅GitHub上的示例。\n 我们注意，如果我们已经分区了数组的两半，我们可以通过交换和来计算两者的分区。在阵列中交换相邻块有时旋转，并且可以在线性时间完成，例如使用反转（观察）。 \n所以我们可以使用鸿沟和征服。使用递归函数，该函数将在中间的阵列中进行，这会及时运行并需要堆栈空间。\n stable_partition_recuraive（第一，n，pred）{if（n == 1）{return pred（first）？第一+ 1：第一; left = stable_partition_rocuraive（第一，n / 2，pred）;中间=第一+ n / 2;右= stable_partition_rocuraive（中间，n  -  n / 2，pred）;旋转（左，中，右）;返回左+（右中间）; }\n 更好，但理想情况下，我们希望只使用恒定的额外空间。要实现这一点，我们可以使用与自下而上的合并排序相同的技术。我们首先在尺寸2的块中处理阵列，然后在大小4的块中（其大小2的两半是alereaparted的两半），等等，直到我们处理整个阵列作为一个块。\n stable_partition_bottomup（first，n，pred）{for（width = 1;宽度<n;宽度* = 2）{next =首先; for（i = 0; i＆lt; n; i + = 2 *宽）{limit = n  -  i＆lt; 2 *宽？ n  -  I：2 *宽; if（限制＆gt;宽度）{中间=下一个+宽度; left = std :: find_f_not（下一个，中间，pred）; next = leid + width right = std :: find_if_not（中间，下一个，pred）;旋转（左，中，右）;返回左+（右中间）; }\n  从某种意义上说，我们支付的价格避免递归是我们不记得两半的分区点，需要再次找到它们。易于使用谓词时间而不是。\n 但是，由于两半已经分区，我们可以使用二进制搜索来查找分区点。这减少了谓词ApplicationSto（自从）的数量，我们具有与递归算法的相同时间复杂性，但使用恒定的额外空间。\n stable_partition_bsearch（first，n，pred）{for（宽度= 1;宽度<n;宽度* = 2）{next =首先; for（i = 0; i＆lt; n; i + = 2 *宽）{limit = n  -  i＆lt; 2 *宽？ n  -  I：2 *宽; if（限制＆gt;宽度）{中间=下一个+宽度; left = std :: partition_point（下一个，中间，pred）; Next = leid + width right = std :: partition_point（中间，下一个，pred）;旋转（左，中，右）;返回左+（右中间）; } \n如果数组几乎分区，则这些算法仍然通过EveryStep。我们可以做一些类似于自然合并排序的东西，并重复需要旋转的下一个地方，如果我们发现没有，则停止。虽然必须小心，但如果我们只是寻找区域并旋转它们，我们会在交替上获得二次时间模式。相反，我们可以寻找并旋转中间两个，就像上面一样。\n stable_partition_natural（首先，最后一个，pred）{do {next = first;变化= false; do {left = std :: find_f_not（下一个，最后一个，pred）;中间= std :: find_if（左，最后，pred）;右= std :: find_f_not（中间，最后一个，pred）; next = std :: find_if（右，最后，pred）;如果（左！=中间＆amp;中间！=右）{旋转（左，中，右）;变化=真; }} while（下一个！=最后）; } while（改变）; }\n 尽可能在此过程中，虽然最坏的情况复杂性是相同的自下而上版本。由于宽度不再是固定的大小，因此我们对分区点的线性搜索拓扑进行了拓扑搜索，因此备注的数量返回。此外，我们必须使用predicateo找到中间和下一个起点，所以我们可能会使用比自下而上的版本更多的档案。\n 有一种算法可以在使用Conforstant额外空间（PDF）中执行稳定的分区，但它有些涉及，并且给定特定任务的约束不实际。\n 让我们回到重新排序的论点问题。这里有一个问题是WeCannot判断任何给定的元素是否是一个选项，选项参数或anonoption，而无需将整个数组解析到该点（即，我们不能随机访问）。\n 这是因为任何给定的元素都可以通过使用它的选项来之前，它选项参数（查看前一个元素是不够的，真的可能是一个选项参数而不是一个选项）。或者可能存在 - 某个地方，这意味着剩下的元素是非选择（除非该剩余元素实际上是前一个选项的选项参数）。\n 这使得自然算法具有良好的契合，因为它在每个循环中从左到右施加雷尼比。 \n那么这一切如何与Getopt实现进行比较？ 通过扫描来自ChiCurrent位置的任何非活动，然后将其扫描到每个呼叫中的两个呼叫中的重新排序，然后将它们旋转到阵列的末尾。 此效率地构建了最后的非活动阵列，同时向下移动尚未处理的部分。  这需要恒定的额外空间，但需要最坏的情况。这可能理论上可以在算法复杂性攻击中使用，大多数系统以某种方式限制命令行参数的大小。 作为最坏情况行为的一个例子，下行使用200,000nOnOptions运行LS（重定向缺少文件的错误消息），需要大约0.3秒（Fedora 24在VM中运行）：  而这一行以相同数量的参数运行LS，但allowaneNonOptions和选项（-a选项启用启动句点的文件，并且在这种情况下没有效果），并且需要11秒： ", "note_en": "When a C program runs, it usually receives any command-line arguments throughthe parameters  argc (argument count) and  argv (argument vector). It is upto the program to interpret the contents of this array of strings.\n There are many ways to do this, one of the simpler solutions is the  getoptfunction (in the following, getopt will refer to both getopt and getopt_long).One extension some getopt implementations offer, is that they reorder thecontents of  argv as they process it, resulting in an array where all theoptions appear first followed by the nonoptions.\n This reordering partitions the array. And we want a stable partition, so therelative order of all the options, and of all the nonoptions is the same.\n Last year I released  parg, a simple parser for  argv that works similarlyto getopt. It has a separate function,  parg_reorder(), that performs thisreordering. I used a simple algorithm for this – allocate a temporary arraythe size of  argv, parse the arguments, and fill in the options from the startand nonoptions from the end of the new array. Then copy them back, reversingthe nonoptions to their original order in the process. In hindsight, I couldhave moved the options into their final place in  argv right away.\n This runs in  time, but also requires  additional space. Thespace requirement could be a problem (for instance on embedded systems), solet’s see if we can do better.\n The code examples in the following are pseudo-code, and glance over somedetails. Please see the  examples on GitHub for working C++ code.\n We note that if we already partitioned the two halves of an array,, we can compute the partition of both by swapping and . Swapping adjacent blocks in an array is sometimescalled  rotating, and can be done in linear time, for instance using reversal(observing that ).\n  So we can use  divide and conquer. With a recursive function thatsplits the array at the middle, this runs in  time and requires stack space.\n stable_partition_recursive ( first ,  n ,  pred ) {\t if  ( n  ==  1 )  {\t\t return  pred ( first )  ?  first  +  1  :  first ;\t }\t left  =  stable_partition_recursive ( first ,  n  /  2 ,  pred );\t middle  =  first  +  n  /  2 ;\t right  =  stable_partition_recursive ( middle ,  n  -  n  /  2 ,  pred );\t rotate ( left ,  middle ,  right );\t return  left  +  ( right  -  middle ); }\n Much better, but ideally we would like to use only constant extra space.To achieve this, we can use the same technique as in bottom-up merge sort. We first process the array in blocks of size 2, thenagain in blocks of size 4 (whose two halves of size 2 are alreadypartitioned), and so on, until we process the entire array as one block.\n stable_partition_bottomup ( first ,  n ,  pred ) {\t for  ( width  =  1 ;  width  &lt;  n ;  width  *=  2 )  {\t\t next  =  first ;\t\t for  ( i  =  0 ;  i  &lt;  n ;  i  +=  2  *  width )  {\t\t\t limit  =  n  -  i  &lt;  2  *  width  ?  n  -  i  :  2  *  width ;\t\t\t if  ( limit  &gt;  width )  {\t\t\t\t middle  =  next  +  width ;\t\t\t\t left  =  std :: find_if_not ( next ,  middle ,  pred );\t\t\t\t next  =  middle  +  width\t\t\t\t right  =  std :: find_if_not ( middle ,  next ,  pred );\t\t\t\t rotate ( left ,  middle ,  right );\t\t\t }\t\t }\t }\t return  left  +  ( right  -  middle ); }\n  In a sense, the price we pay to avoid the recursion is that we do not rememberthe partition points of the two halves, and need to find them again. This meanswe use the predicate  times instead of .\n However, since the two halves are already partitioned, we can use binary searchto find the partition points. This reduces the number of predicate applicationsto  (since ), whichmeans we have the same time complexities as the recursive algorithm, but usingonly constant extra space.\n stable_partition_bsearch ( first ,  n ,  pred ) {\t for  ( width  =  1 ;  width  &lt;  n ;  width  *=  2 )  {\t\t next  =  first ;\t\t for  ( i  =  0 ;  i  &lt;  n ;  i  +=  2  *  width )  {\t\t\t limit  =  n  -  i  &lt;  2  *  width  ?  n  -  i  :  2  *  width ;\t\t\t if  ( limit  &gt;  width )  {\t\t\t\t middle  =  next  +  width ;\t\t\t\t left  =  std :: partition_point ( next ,  middle ,  pred );\t\t\t\t next  =  middle  +  width\t\t\t\t right  =  std :: partition_point ( middle ,  next ,  pred );\t\t\t\t rotate ( left ,  middle ,  right );\t\t\t }\t\t }\t }\t return  left  +  ( right  -  middle ); }\n If the array is almost partitioned, these algorithms still go through everystep. We can do something similar to natural merge sort, and repeatedlylook for the next place where a rotate is needed, stopping if we find none.We must be careful though, if we simply look for  areas and rotate them,we get quadratic time on alternating patterns. Instead we can look for and rotate the middle two, just like above.\n stable_partition_natural ( first ,  last ,  pred ) {\t do  {\t\t next  =  first ;\t\t change  =  false ;\t\t do  {\t\t\t left  =  std :: find_if_not ( next ,  last ,  pred );\t\t\t middle  =  std :: find_if ( left ,  last ,  pred );\t\t\t right  =  std :: find_if_not ( middle ,  last ,  pred );\t\t\t next  =  std :: find_if ( right ,  last ,  pred );\t\t\t if  ( left  !=  middle  &amp;&amp;  middle  !=  right )  {\t\t\t\t rotate ( left ,  middle ,  right );\t\t\t\t change  =  true ;\t\t\t }\t\t }  while  ( next  !=  last );\t }  while  ( change ); }\n At best this runs in , while the worst-case complexity is the same asthe bottom-up version. Since the widths are no longer fixed size, we have toperform a linear search for the partition points, so the number of predicateapplications is back to . Also, we have to use the predicateto find the middle and next starting point, so we may use more predicateapplications than the bottom-up version.\n There is an algorithm that can perform stable partitioning in  usingconstant extra space ( PDF), but it is somewhat more involved,and not practical given the constraints of the specific task.\n Let us return to the problem of reordering arguments. One issue here is that wecannot tell if any given element is an option, an option argument, or anonoption, without parsing the entire array up to that point (i.e. we cannotassume random access).\n This is because any given element could be preceded by an option that uses itas its option argument (looking at the previous element is not enough, sincethat might be an option argument instead of an option). Or there could be a -- somewhere, which means the remaining elements are nonoptions (unless that -- is in fact the option argument of a preceding option).\n This makes the natural algorithm a good fit, since it applies the predicatelinearly from left to right in each loop.\n So how does this all compare to getopt implementations? The two I checkedperform the reordering in each call by scanning over any nonoptions from thecurrent position, and then rotating them to the end of the array. Thiseffectively builds the array of nonoptions at the end, while moving down thepart that has not yet been processed.\n  This requires constant extra space, but takes worst-case  time.While this could theoretically be used in an algorithmic complexity attack,most systems limit the size of the command-line arguments in some way. As anexample of the worst-case behavior, the following line runs  ls with 200,000nonoptions (redirecting the error messages for missing file), and takes about0.3 seconds (Fedora 24 running in a VM):\n  Whereas this line runs  ls with the same number of arguments, but alternatingnonoptions and options (the  -a option enables showing files that start witha period, and has no effect in this case), and takes 11 seconds:", "posttime": "2021-06-25 02:01:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "排序,reordering", "title": "重新排序论点 ", "title_en": "Reordering Arguments", "transed": 1, "url": "http://hardtoc.com/2016/11/07/reordering-arguments.html", "via": "", "real_tags": ["排序"]}]