[{"category": "", "categoryclass": "", "imagename": "9e1fae072fc331af5f6ac84fa410d4f3.jpg", "infoid": 1004719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对Facebook的打击通常是因为它没有弄清楚自己的广告战略。也许是这样，但该公司从一开始就很大程度上是在讨好广告商。\n正如“社交网络”中所描述的那样，Facebook当时的首席财务官爱德华多·萨维林(Eduardo Saverin)在Facebook(当时名为TheFacebook)推出后立即来到纽约市销售广告。2004年4月与萨维林会面的其中一人保存了Facebook的第一个媒体工具包，该工具包提供给了Digiday。\n当时的facebook与今天的全球庞然大物相去甚远。这套媒体工具包刚刚推出两个多月，详细介绍了它在20所主要大学的7万名用户。但Facebook的宏伟计划在其计划中显而易见，其中包括在6个月内在200所大学推出服务。\nFacebook最初的推销与它今天给营销人员带来的信息略有不同。首先，Facebook没有敦促他们使用社交广告，而是提出要运营IAB的标准广告单元。然而，萨维林已经在强调Facebook的独特(和个人)数据，他解释说，营销者的目标可以是性取向，甚至是宿舍。\n下面是萨维林那年春天用来向潜在广告商推销的媒体工具包，这些资料是从他亲自会见的一位纽约营销员那里获得的。萨维林要求获得大约8万美元的广告承诺，用于定向展示广告投放，以接触到“数千”用户。\n国家地理Instagram主管乔什·拉布(Josh Raab)说：“病毒式传播的东西通常都是具有一定独创性的东西，以前从未有人做过。”\n对于寻找廉价和令人愉悦的广告的广告商来说，TikTok不是一个可行的选择。相反，这是为那些财力雄厚的人提供的溢价媒体购买。\n在一段新的视频中，来自GumGum、Martin Agency和Pinterest的专家们讨论了视频广告的未来-并概述了他们对视频广告如何减少破坏性的愿景。\n从赞助的角度来看，我们所知道的一切都改变了。我们问[客户]你们的解决方案是什么？我们的目标是成为战略合作伙伴，所以我们问你们希望如何进入这个领域，成功是什么样子的？\n对于媒体来说，事件总是达到目的的一种手段。一个成功的活动模式的驱动力是将一个具有共同兴趣的社区缝合在一起。", "note_en": "The knock on Facebook is often that it doesn’t have its ad strategy figured out. That might be, but the company courted advertisers pretty much from the get-go.\n As captured in “The Social Network,” Facebook’s then-CFO Eduardo Saverin was in New York City right after the launch of TheFacebook, as it was then called, to sell ads. One of those who met with Saverin in April 2004 saved Facebook’s first media kit, which was provided to Digiday.\n TheFacebook was a far cry from the global behemoth it is today. Just a bit over two months old, the media kit details its 70,000 users at 20 major colleges. But Facebook’s grand plans are evident in its projections, which include launching in 200 colleges in six months.\n Facebook’s original pitch was a bit different than the message it bring to marketers today. For one, Facebook wasn’t urging them to use social ads but instead offered to run IAB standard ad units. Yet Saverin was already emphasizing Facebook’s unique (and personal) data, explaining that marketer’s could target by sexual orientation or even by dorm.\n Below is the media kit Saverin was using to pitch potential advertisers that spring, obtained from a New York-based marketer he met with personally. Saverin was asking for ad commitments of around $80,000 for targeted display ad placements that would reach “thousands” of users.\n   “Things that are viral are often things that have a certain ingenuity and have not been done before,” said Josh Raab, National Geographic&#39;s director of Instagram.\n For advertisers looking for cheap and cheerful ads, TikTok isn’t a viable option. Rather, it’s a premium media buy for those with deep pockets.\n In a new video, experts from GumGum, The Martin Agency and Pinterest discuss the future of video advertising — and outline their vision for how video ads can be less disruptive.\n &#34;From a sponsorship perspective, everything we knew had changed. We asked [clients] &#39;what are you solving for?&#39; We aim to be the strategic partner, so we ask &#39;how do you want to be in this space, what does success look like?&#39;&#34;\n Events were always a means to an end for media. The driving force of a successful events model was stitching together a community with a common interest.", "posttime": "2020-06-02 03:27:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,facebook,saverin", "title": "爱德华多·萨维林(Eduardo Saverin)在2004年是如何销售Facebook广告的", "title_en": "How Eduardo Saverin sold Facebook ads in 2004", "transed": 1, "url": "https://digiday.com/media/how-eduardo-saverin-sold-facebook-ads-in-2004/", "via": "", "real_tags": ["广告", "facebook", "saverin"]}, {"category": "", "categoryclass": "", "imagename": "1c9e3681959587c7f9d4a349a3544d29.png", "infoid": 1004718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界上最好的超本地化API，用例驱动，完全可定制。\n了解您可以使用我们的MicroWeather API做些什么，或访问文档开始使用。\ncURL--请求POST--url&#39；https://api.climacell.co/v3/alerts?apikey=API_KEY&#39；--Header&#39；内容类型：应用程序/json&#39；--数据&#39；{&#34；unit_system&#34；：&#34；si&#34；，&#34；is_active&#34；：true，&#34；webhooks&#34；：[&#34；WEBHOOK_ID&#34；]，&#34；团体&#34；：[{&#34；Delivery&#34；：{&#34；sms&#34；：TRUE，&#34；Email&#34；：TRUE}，&#34；姓名&#34；：&#34；气候细胞波士顿员工&#34；}]，&#34；conditions&#34；：[{&#34；or&#34；：[{&#34；parameter&#34；：&#34；Rain&#34；，&#34；值&#34；：&#34；.15&#34；，&#34；操作员&#34；：&#34；lt&#34；}，{&#34；参数&#34；：&#34；温度&#34；，&#34；值&#34；：&#34；25&#34；，&#34；操作员&#34；：&#34；lt&#34；}]}]，&#34；通知&#34；：60，&#34；名称&#34；：&#34；气候单元总部的冷雨", "note_en": "The world’s best hyper-local API that’s use case driven and fully customizable.\n   See what you can do with our MicroWeather API or visit the docs to get started.\n curl --request POST --url &#39;https://api.climacell.co/v3/alerts?apikey=API_KEY&#39; --header &#39;content-type: application/json&#39; --data &#39;{&#34;unit_system&#34;:&#34;si&#34;,&#34;is_active&#34;:true,&#34;webhooks&#34;:[&#34;WEBHOOK_ID&#34;],&#34;groups&#34;:[{&#34;delivery&#34;:{&#34;sms&#34;:true,&#34;email&#34;:true},&#34;name&#34;:&#34;ClimaCell Boston Employees&#34;}],&#34;conditions&#34;:[{&#34;or&#34;:[{&#34;parameter&#34;:&#34;Rain&#34;,&#34;value&#34;:&#34;.15&#34;,&#34;operator&#34;:&#34;lt&#34;},{&#34;parameter&#34;:&#34;Temperature&#34;,&#34;value&#34;:&#34;25&#34;,&#34;operator&#34;:&#34;lt&#34;}]}],&#34;notice&#34;:60,&#34;name&#34;:&#34;Cold and Rainy in ClimaCell Headquarters&#34;}&#39;", "posttime": "2020-06-02 03:26:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "单元,api", "title": "气候单元天气API：完全可定制的超本地API", "title_en": "ClimaCell Weather API: fully customizable hyper-local API", "transed": 1, "url": "https://www.climacell.co/weather-api/", "via": "", "real_tags": ["单元", "api"]}, {"category": "", "categoryclass": "", "imagename": "655acb036251c239c4114ff84693a26e.png", "infoid": 1004717, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "准备好登上OneSignal火箭飞船了吗？", "note_en": "Ready to board the OneSignal rocket ship?", "posttime": "2020-06-02 03:10:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全栈,rust,hiring,onesignal", "title": "OneSignal正在招聘对Go和Rust感兴趣的全栈工程师", "title_en": "OneSignal is hiring Full-Stack engineers interested in Go and Rust", "transed": 1, "url": "https://onesignal.com/careers", "via": "", "real_tags": ["全栈", "rust", "hiring", "onesignal"]}, {"category": "", "categoryclass": "", "imagename": "fcad7b0864394ae081d2028e5ca049fa.jpg", "infoid": 1004716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Reliance Jio平台的重大交易突然在分析师、高管和读者中引发了兴趣，因为许多人对一些投资者写给几家年轻初创公司的类似大额支票持怀疑态度，其中许多公司现在都在努力弄清楚自己的财务状况。\n最近几周，包括印度在内的全球知名投资者都告诫初创企业，随着新的审查变得难以捉摸，它们应该做好“最糟糕的时刻”的准备。\n在印度的其他地方，世界第二大互联网市场，所有初创公司去年总共筹集了创纪录的145亿美元，公司正在经历几轮下跌(在那里，它们的估值被大幅下调)。天使投资人米腾·桑帕特(Miten Sampat)上周表示，如果初创企业真的获得投资报价，它们的估值应该会被减记40%-50%。\nFacebook的57亿美元投资对该公司的估值为570亿美元。但美国私募股权公司银湖(Silver Lake)、Vista、General Atlantic和KKR-过去五周宣布的所有其他交易-都为其在Jio平台的股份支付了12.5%的溢价，估值为650亿美元。\n一家印度公司是如何变得如此有价值的？它到底是做什么的？它和优步一样无利可图吗？它的未来是什么样子的？它为什么要筹集这么多资金呢？为什么它要发布这么多公告，而不是一个。\n2015年12月，亿万富翁穆凯什·安巴尼(Mukesh Ambani)在一次有3.5万人参加的聚会上简要介绍了他庞大的印度帝国，其中包括数百名宝莱坞名人和行业巨头。\n“信实工业拥有世界第二大聚酯业务。我们每年生产150万吨涤纶面料，这足以让每个印度人每年生产5米面料，“亚洲首富安巴尼说。", "note_en": "The major deals for Reliance Jio Platforms have sparked a sudden interest among analysts, executives and readers at a time when many are skeptical of similar big check sizes that some investors wrote to several young startups, many of which are today struggling to make sense of their finances.\n Prominent investors across the globe, including in India, have in recent weeks  cautioned startups that they should be prepared for the “worst time” as new checks become elusive.\n Elsewhere in India, the world’s second-largest internet market and where all startups together  raised a record $14.5 billion last year, firms are witnessing down rounds (where their valuations are slashed). Miten Sampat, an angel investor, said last week that startups should expect a 40%-50% haircut in their valuations if they do get an investment offer.\n Facebook’s  $5.7 billion investment valued the company at $57 billion. But U.S. private equity firms Silver Lake, Vista, General Atlantic, and KKR — all the other deals announced in the past five weeks — are paying  a 12.5% premium for their stake in Jio Platforms, valuing it at $65 billion.\n How did an Indian firm become so valuable? What exactly does it do? Is it just as unprofitable as Uber? What does its future look like? Why is it raising so much money? And why is it making so many announcements instead of one.\n   Billionaire  Mukesh Ambani   gave a rundown of his gigantic Indian empire at a gathering in December 2015 packed with 35,000 people including hundreds of Bollywood celebrities and industry titans.\n “Reliance Industries has the second-largest polyester business in the world. We produce one and a half million tons of polyester for fabrics a year, which is enough to give every Indian 5 meters of fabric every year, year-on-year,” said Ambani, who is Asia’s richest man.", "posttime": "2020-06-02 02:54:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "首富,richest", "title": "印度首富打造电信运营商人人都想分一杯羹", "title_en": "India's Richest Man Built a Telecom Operator Everyone Wants a Piece Of", "transed": 1, "url": "https://techcrunch.com/2020/06/01/indias-richest-man-built-a-telecom-operator-everyone-wants-a-piece-of/", "via": "", "real_tags": ["首富", "richest"]}, {"category": "", "categoryclass": "", "imagename": "88424ffe328b91f504fc352c963033e9.jpg", "infoid": 1004715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周日晚上，纽约市警察局的一个工会以对市长白思豪(Bill De Blasio)的有争议的袭击而闻名，该工会在推特上公布了他女儿的个人身份信息，包括住址和她的纽约州身份证号码。\n今年2月，慈善军士协会在Twitter上发帖抨击市长的女儿基亚拉·白思豪(Chiara De Blasio)在周六晚间的一次“非法集会”中被捕。该协会在2月份声称，纽约警察局的成员正在向市长“宣战”，该协会的这条推文攻击了市长的女儿基亚拉·白思豪(Chiara De Blasio)。\n据多家新闻媒体报道，纽约警察局在针对警察杀害手无寸铁的黑人乔治·弗洛伊德(George Floyd)的全国性抗议活动的第五个晚上逮捕了基亚拉·白思豪(Chiara De Blasio)。弗洛伊德涉嫌被明尼阿波利斯的四名警察谋杀，引发了数十个主要城市的抗议和与当局的暴力冲突。\nSBA由工会主席埃德·穆林斯(Ed Mullins)运营，他是市长最猛烈的批评者，其中包括一张电脑屏幕的照片，这似乎是他25岁女儿的逮捕报告。这份报告包括她的出生日期，纽约州身份证号码，以及各种传记细节，如身高、体重和公民身份。它还包括公寓号码和家庭地址，似乎是格雷西大厦，市长的住所(尽管邮政编码不匹配)。\nTwitter的政策明确禁止用户发布个人信息，包括身份证件，包括政府颁发的身份证。发布家庭地址“或其他与被认为是私人的地点有关的识别信息”也是被禁止的。\nSBA的推文持续了一个多小时，最终在几个用户(包括记者)指出这条推文被滥用后被删除。该账户被暂时锁定，直到这条推文被自愿删除。\nTwitter尚未回复记者的置评请求。Gizmodo联系了市长办公室，如果我们得到回应就会更新。\n根据The Gothamist的报道，尽管穆林斯的职责几乎完全与纽约市最引人注目的警察工会之一的运作有关，但前布鲁克林第67分局的纽约警察局警长穆林斯继续领取纳税人出资的133524美元的工资。“纽约时报”(The Gothamist)称，穆林斯曾是布鲁克林第67分局的一名警长，但他继续领取由纳税人出资的133524美元的工资。\n穆林斯对治安的看法和他对市长办公室的频繁攻击被广泛认为是有争议的。他有为前市长迈克·布隆伯格(Mike Bloomberg)领导下的拦截搜身计划辩护的历史，民权领袖认为这是一项种族定性行动，是大幅恶化少数族裔社区与纽约警察局关系的主要责任。\n在拦截搜身的情况下，2002年至2013年期间，纽约警察局以黑人和拉丁裔为目标，次数超过500万次，当时美国地区法院法官希拉·谢恩德林(Shira Scheindlin)裁定这种做法违宪。穆林斯称这种做法是“富有成效的”和“有效的政策”。\nSBA对白思豪和他女儿的最新攻击发生在市长为纽约警察局在布鲁克林对抗抗议者时咄咄逼人且往往是暴力的策略辩护的一天后。社交媒体上的视频显示，本周末，纽约警局的两辆车撞上了示威者的海洋，示威者投掷了一个交通锥和其他物体，将其中一些人撞倒在地。\n白思豪对这起事件的描述与网上流传的视频不符。虽然他声称“抗议者包围警车和威胁警察是不合适的”，但视频清楚地显示警车没有被包围。其中一辆车几乎整个时间都在向前行驶，没有人在后面冲。抗议者只是偶尔出现在第二辆车的尾部，这辆车也向前冲进了人群。\n白思豪周日试图收回他的声明，声称他不喜欢他看到的“一点”。\n针对乔治·弗洛伊德被杀的抗议活动已经持续了六天，蔓延的情况与直到上周还压制了同一条街道的大流行没有什么不同。从明尼阿波利斯开始的活动，到周日，弗洛伊德已经扩展到不少于40个城市。在那里，陌生人拍摄到弗洛伊德窒息并恳求他的生命。\n弗洛伊德在一名冷漠的白人警察的膝盖下乞求不要被杀近9分钟的视频撕裂了更广泛的长期被忽视的种族创伤。“妈妈！“我受够了，”这位中年男子一度被听到哭泣；在他的最后一句话中，这是一句令人痛心的话。直到后来才知道他的母亲两年前去世了。\n随着抗议活动的肆虐，日落后的洗劫和纵火事件已经变得司空见惯，促使几个城市实行严格的宵禁，并部署了国民警卫队。在阳光下游行数小时的抗议者-包括许多年轻的活动人士-利用他们的白人特权保护黑人抗议者免受伤害-指责当地官员故意将他们与抢劫者捆绑在一起。他们声称，这样做的目标是破坏他们的核心信息，即非法扑灭黑人生命的警察将面临正义-如果不是在法庭上，或者如果不是在街上。\n在街头拍摄并通过Twitter和Instagram分享的视频揭露了无数警察无视法律的事件-没有明显的理由暴力推搡和平示威者，在抗议者撤退的同时使用拳头、踢球、棍棒、弹丸枪、催泪瓦斯和震荡手榴弹进行攻击。新闻媒体成员似乎是警方的首要目标，无数记者和新闻工作者报告说，他们在高举记者证的时候遭到了“不那么致命”的子弹的袭击和枪击。\n拍摄的一些最令人震惊的视频显示，警察愤怒地随机爆炸，平民走在远离抗议活动的人行道上，没有明显的理由，用胡椒喷雾打他们的脸，推搡他们，然后漫不经心地走开。警方在其他城市也用车辆袭击了抗议者。\n周六在明尼阿波利斯拍摄的一段视频捕捉到了身着黑衣的蒙面警察，在一辆军用悍马的护送下，直接向站在一个安静社区门廊上的一名女子发射似乎是颜料罐的东西。就在开枪之前，可以听到其中一名警官的尖叫声：“把他们点燃！”\n这辆悍马似乎属于国民警卫队，国民警卫队在当天早些时候应明尼苏达州州长蒂姆·沃尔兹的要求部署了这辆悍马。然而，在昨天发给Gizmodo的一封电子邮件中，国民警卫队拒绝确认这辆车的所有权。\n更新时间：2020年6月1日凌晨3点。美国东部时间：以下推文发布于周日晚上11点13分，似乎显示一名纽约警察局官员拔枪指着向相反方向逃跑的示威者。", "note_en": "A New York City Police Department union known for its controversial attacks against Mayor Bill de Blasio tweeted out the personally identifying information of his daughter on Sunday night, including a residential address and her New York State ID number.\n  The tweet by the Sergeants Benevolent Association, which in February claimed that members of the NYPD were “  declaring war” against the mayor, attacked the mayor’s daughter, Chiara de Blasio, for being arrested during an “unlawful assembly” on Saturday night.\n Multiple news outlets   reported that NYPD arrested Chiara de Blasio during the fifth night of nationwide protests over the police killing of George Floyd, an unarmed Black man whose   alleged murder at the hands of four Minneapolis police officers sparked protests and violent clashes with authorities in dozens of major cities.\n  The SBA, run by union boss Ed Mullins, the mayor’s fiercest critic, included a photo of a computer screen which appeared to be his 25-year-old daughter’s arrest report. The report included her date of birth, New York state ID number, and various biographical details, such as height, weight, and citizenship status. It also included an apartment number and home address, which appeared to be Gracie Mansion, the mayor’s residence (though the zip code did not match.)\n Twitter’s policies expressly forbid users from posting personal information, including identity documents, including government-issued IDs. Posting home addresses “or other identifying information related to locations that are considered private” is also forbidden.\n    The SBA’s tweet remained up for more than an hour before eventually being taken down after a several users (including this reporter) flagged the tweet for abuse. The account was temporarily locked until the tweet was voluntarily deleted.\n  Twitter has yet to respond to a request for comment. Gizmodo reached out to the mayor’s office and will update if we get a response.\n Although his duties relate almost entirely to the operations of one of New York City’s most highly visible police unions, Mullins, a former NYPD sergeant of Brooklyn’s 67th Precinct, continues to receive a taxpayer-funded salary of $133,524, according to the   Gothamist.\n   Mullins’ views on policing and his frequent attacks on the mayor’s office are widely considered controversial. He has a history of   defending the stop-and-frisk program under former Mayor Mike Bloomberg, a racial profiling operation that civil rights leaders hold as chiefly responsible for dramatically worsening the relationship between minority communities and the NYPD.\n  Under stop-and-frisk, Blacks and Latinos were disproportionately targeted   more than 5 million times by the NYPD between 2002 and 2013, when U.S. District Court Judge Shira Scheindlin ruled the practice unconstitutional. Mullins has called the practice “productive” and “an effective policy.”\n The SBA’s latest attack on de Blasio and his daughter came day after the mayor   defended the NYPD’s aggressive and often violent tactics while facing off against protesters in Brooklyn. Video on social media showed two NYPD vehicles this weekend plowing into a sea of demonstrators, who threw a traffic cone and other objects, knocking some of them to the ground.\n   De Blasio’s description of the incident did not match footage of it circulating online. While he claimed it was “inappropriate for protesters to surround a police vehicle and threaten police officers,” video clearly shows the police vehicles were not surrounded. One of the vehicles was in forward motion nearly the entire time with no one rushing behind it. Protesters were only occasionally to the rear of a second vehicle, which also plunged forward into the crowd.\n  De Blasio attempted to walk back his statement a little on Sunday, alleging he did not like what he saw “one bit.”\n The protest over George Floyd’s killing has gone on for six days, spreading not unlike the pandemic that until last week had subdued the same streets. What started in Minneapolis, where Floyd was videoed by strangers choking and pleading for his life, had by Sunday expanded to no fewer than 40 cities.\n  The video of Floyd begging not to be killed for nearly nine minutes under the knee of an indifferent white cop tore wider long ignored racial wounds. “Momma! I’m through,” the middle aged man was at one point heard crying; the gut-wrenching phrase among his final words. Only later was it known   his mother had passed away two years prior.\n As protests rage, incidents of ransacking and arson have become commonplace after sunset, prompting strict curfews and the deployment of the National Guard in several cities. Protesters marching for hours under the sun—including many young activists utilizing   their white privilege to shield Black protesters from harm—accuse local officials of clumping them together purposefully with looters. The goal, they allege, is to undermine their central message, that cops who unlawfully extinguish Black lives  will come to face justice—in a courtroom, or if not, in the streets.\n   Footage captured on the streets and shared via Twitter and Instagram has laid bare countless incidents of police disregarding the law—violently shoving peaceful demonstrators for   no apparent reason and attacking using punches, kicks, clubs, pellet guns, tear gas, and concussion grenades even as protesters retreat. Members of the news media appear to be prime police targets, with countless journalists and news crews reporting they’ve been   attacked and   shot with “less-lethal” rounds while holding their   press badges high in the air.\n  Some of the most alarming footage taken shows police officers exploding with rage at   random civilians walking   on sidewalks far from protests with no apparent reason, hitting them in the face with pepper spray and shoving them before casually walking away. Police have   struck protesters with   vehicles in other cities, as well.\n   One video, taken in Minneapolis on Saturday, captured masked police officers clad in black escorted by a military Humvee firing what appeared to be paint canisters directly at a woman   standing on her porch in a quiet neighborhood. Just before firing, one of the officers can be heard screaming: “Light ‘em up!”\n The Humvee appeared to belong to the National Guard, which had deployed at Minnesota Gov. Tim Walz’s request earlier in the day. In an email to Gizmodo yesterday, however, the National Guard declined to confirm ownership of the vehicle.\n  Update: June 1, 2020, 3 a.m. ET: The following tweet was posted Sunday night at 11:13pm and appears to show an NYPD officer drawing a gun on demonstrators who are fleeing in the opposite direction.", "posttime": "2020-06-02 02:53:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,市长,union", "title": "纽约警察局联盟在推特上解雇市长的女儿", "title_en": "NYPD Union Doxes Mayor's Daughter on Twitter", "transed": 1, "url": "https://gizmodo.com/nypd-union-doxes-mayors-daughter-on-twitter-1843813751", "via": "", "real_tags": ["推特", "市长", "union"]}, {"category": "", "categoryclass": "", "imagename": "b15dd7befa4adb5426ccb4f3a6c4b4d3.png", "infoid": 1004713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多核OCaml：2020年5月欢迎收看多核OCaml团队2020年5月的更新！与之前的更新一样，非常感谢@shakthimaan和@kayceesrk帮助组装本月的综合报道。2020年5月的一个重大里程碑是多核OCaml从4.06一路改基到4.10！执行停止世界并行次要收集的并行次要GC变体是编译器的默认分支，这意味着现在与C绑定的兼容性很高……", "note_en": "Multicore OCaml: May 2020 Welcome to the May 2020 update from the Multicore OCaml team! As with previous updates, many thanks to @shakthimaan and @kayceesrk for help assembling this month’s roundup.  A major milestone in May 2020 has been the completion of rebasing of Multicore OCaml all the way from 4.06 to 4.10! The Parallel Minor GC variant that performs stop-the-world parallel minor collection is the default branch for the compiler, which means that compatibility with C bindings is now much ...", "posttime": "2020-06-02 02:52:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,ocaml,multicore,停止", "title": "多核OCaml：2020年5月更新", "title_en": "Multicore OCaml: May 2020 update", "transed": 1, "url": "https://discuss.ocaml.org/t/multicore-ocaml-may-2020-update/5898", "via": "", "real_tags": ["2020", "ocaml", "multicore", "停止"]}, {"category": "", "categoryclass": "", "imagename": "fde34a0b96ed88cf243a07710d2a77b4.jpg", "infoid": 1004712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "内罗毕-刚果卫生部长证实在该国的埃夸特尔省发现了一例新的埃博拉病例，上一次爆发这种高度致命的病毒是在2018年，最终导致33人死亡。\n周一早些时候，该省省长波波·博罗科·博伦布(Bobo Boloko Bolumu)在国家电台发表讲话，称可能有5例病例，其中4名感染者已经死亡。他说，这些病例是在省会姆班达卡发现的，姆班达卡拥有100多万人口，是刚果河和鲁基河交汇处的一个重要港口城市，这两个河流的贸易和运输非常繁忙。\n世界卫生组织总干事Tedros Adhanom Ghebreyesus周一晚些时候表示，刚果卫生部已经确认了六例病例。他说，世卫组织的反应已经在进行中。\n姆班达卡尚未确认有新型冠状病毒病例，尽管刚果各地已确认3000多例。冠状病毒和埃博拉病毒无关。埃博拉是非洲热带雨林的地方性疾病，只通过接触感染者的体液传播，在严重情况下表现为出血热，并伴有呕吐和大量内出血。\n刚果近两年来一直在与东北部省份单独爆发的埃博拉疫情作斗争，到目前为止，这场疫情已导致2272人死亡。今年4月，该国最严重的疫情爆发结束，距离宣布结束只有几天的时间，然后发现了新的病例。同一地区也是世界上正在爆发的最大规模麻疹疫情的发源地。\n最严重的埃博拉疫情主要发生在2013年底至2016年初的三个西非国家，当时有近3万人感染，超过1.1万人死亡。\n埃夸蒂尔的新疫情将是刚果自1976年首次发现该病毒以来的第11次疫情。实验疫苗被证明在防止埃博拉传播方面有效，但尚未找到治愈方法。存在不同的病毒株，不同的疫情的死亡率从25%到90%不等。\n摇摇欲坠的卫生基础设施以及对政府和外国援助组织的不信任阻碍了刚果和西非对埃博拉病毒的应对。当地人指责卫生官员和合同供应商在严格限制行动和业务的同时，利用资金雄厚的应对措施牟取暴利。然而，刚果政府在之前的大多数埃博拉疫情中都被称赞为快速识别和控制埃博拉病毒。", "note_en": "NAIROBI — Congo&#39;s health minister confirmed the discovery of a new Ebola case in the country&#39;s Équateur province, which last saw an outbreak of the highly deadly virus  in 2018, ultimately killing 33 people there.\n The province’s governor, Bobo Boloko Bolumbu, spoke on national radio earlier on Monday, saying there were five likely cases and that four of those infected had already died. He said the cases were found in Mbandaka, the provincial capital, which is home to more than 1 million people and is an important port city at the confluence of the Congo and Ruki rivers, which are heavily plied for trade and transport.\n The World Health Organization’s director general, Tedros Adhanom Ghebreyesus, said later on Monday that  six cases had been identified by Congo’s Health Ministry. He said the WHO’s response was already underway.\n   No cases of the novel  coronavirus have been confirmed in Mbandaka, although more than 3,000 have been confirmed across Congo. The coronavirus and Ebola are unrelated. Ebola, which is endemic to Africa’s tropical rainforests, is transmitted only through contact with an infected person’s bodily fluids and manifests as a hemorrhagic fever accompanied in severe cases by vomiting and extensive internal bleeding.\n Congo has grappled for almost two years with a separate Ebola outbreak in its northeastern provinces that has killed 2,272 people so far. In April, the end of that outbreak, the country’s worst, had been  just days away from being declared over when new cases were found. The same region is also home to the world’s largest ongoing measles outbreak.\n The worst outbreak of Ebola took place mainly across three West African countries between late 2013 and early 2016, when nearly 30,000 people were infected and more than 11,000 died.\n  The new outbreak in Équateur would be Congo’s 11th since the virus was first identified in 1976. Experimental vaccines have proved effective in preventing the spread of Ebola, but no cure has been found. Different strains of the virus exist, and different outbreaks have had mortality rates ranging from 25 to 90 percent.\n   Rickety health infrastructure and mistrust in governments and foreign aid organizations have impeded Ebola responses in Congo and West Africa. Locals have  accused health officials and contracted suppliers of using well-funded responses to enrich themselves while imposing strict restrictions on movement and business. Congo’s government, however, has been lauded as quick to identify and contain Ebola in most previous outbreaks.", "posttime": "2020-06-02 02:35:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "新一轮,outbreak,刚果", "title": "刚果城宣布新一轮埃博拉疫情最后一次出现是在2018年", "title_en": "New Ebola Outbreak Declared in Congo City That Last Saw the Virus in 2018", "transed": 1, "url": "https://www.washingtonpost.com/world/africa/new-ebola-outbreak-declared-in-congo-city-that-last-saw-the-virus-in-2018/2020/06/01/33a9f958-a3ff-11ea-898e-b21b9a83f792_story.html", "via": "", "real_tags": ["新一轮", "outbreak", "刚果"]}, {"category": "", "categoryclass": "", "imagename": "95ac484a508ff1226b5f4f1dee79f5ca.jpeg", "infoid": 1004711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": ".bigTop__review{不透明度：0；}.bigTop__VideoPlayerBox{位置：绝对；}.bigTop__VideoPlayerBox--被动{宽度：100%；高度：100%；顶部：0；左侧：0；不透明度：0；/*z索引：-1；*/}.bigTop__VideoPlayerBox--回退{位置：相对；z索引：0；}.bigTop__VideoPlayerBox--。不透明度：1；z-index：1；}.bigTop__VideoPlayer{位置：相对；填充-底部：56.25%；}.bigTop__codeholder{显示：无；}.bigTop__幻灯片显示{光标：指针；位置：绝对；底部：0；右侧：0；背景色：#FFF；填充：10px；宽度：300px；}.bigTop__button{边框宽度：2px；边框样式：实心；font。文本转换：大写；字体大小：12px；字母间距：1px；光标：指针；页边距：0；填充：6px 15px；框大小：边框；过渡：颜色300ms，背景颜色300ms；}.bigTop_button--嵌入{背景：透明；颜色：#FFF；边距：30px自动20px；最小宽度：175px；边框颜色：#FFF；}.bigTop_button--嵌入：ho.。边框颜色：#333；背景颜色：#fff；}.bigTop__button--黑色：悬停{color：#fff；back-color：#333；}.bigTop__Button--内联{空边距：15px 0；}.bigTop__Atmotional{填充：0；边距：0；背景大小：1px 1px；背景位置：-1px-1px；}.bigTop__atomalic：空{paddingBottom：0；背景大小：1px 1px；背景位置：-1px-1px；}.bigTop__atumular：空{paddingBottom：}.bigTop__大气视频，.bigTop__大气img{宽度：100%；显示：块；填充：0；页边距：0；}/*终端媒体css*//*caption/credit*/.bigTop__captioncredit{显示：块；字体系列：&#34；视网膜&#34；，Helvetica，宋体，无衬线；颜色：#666；边距：5px auto 0；填充：0 10px；框大小：边框；}.bigTop__Caption{font-size：14px；line-high：20px；font-weight：300；display：inline；}.bigTop_Credit{font-size：14px；line-high：20px；font-weight：300；text-change：uppercase；display：inline；}/*结束字幕/信用*//*视频播放按钮*/.bigTop__play{宽度：50px；高度：50px；光标：指针；边框：1px#999实心；背景颜色：RGBA(0，0，0，0.7)；边框半径：50%；文本缩进：-9999px；显示：块；框大小调整。.bigTop__play，.bigTop__VideoPlayerBox：HOVER+.bigTop__PLAY--独立，.bigTop__PLAY--HOVER{背景颜色：#0080c3；边框颜色：#0080c3；}.bigTop__PLAY：之前{宽度：0；高度：0；边框-顶部：11px纯色透明；边框-底部：12px纯色透明；边框-左边：18px实体#fff；内容：&#34；}.bigTop__VideoTrigger{光标：指针；宽度：100%；高度：100%；位置：绝对；顶部：0；左侧：0；}.bigTop__play--独立{位置：绝对；顶部：50%；左侧：50%；Transform：TranslateY(-50%)TranslateX(-50%)；-webkit-Transform：TranslateY(-50%)TranslateX(-50%)；Pointer-Events：None；}/*视频按钮*//*/.bigTopPage_Grid{padding：0 10px；框大小：边框大小：边框；左页边距：自动；右页边距：自动；}/*结束页面网格**/*/.plitTop.bigTop__rel{背景颜色：#222；}.plitTop.bigTop__text，.plitTop.bigTop__flash，.plitTop.bigTop__flash：link，.plitTop.。}.plitTop.bigTop--lightTheme.bigTop__rel{Background-color：#fff；}.plitTop.bigTop--lightTheme.bigTop__text，.plitTop.bigTop--lightTheme.bigTop_flash，.plitTop.bigTop--lightTheme.bigTop__flash：link，.plitTop.bigTop--lightTheme.bigTop_hed，.plitTop.bigTop。}.拆分顶部.bigTop__overlay--Bottom，.plitTop.bigTop__overlay--顶部{背景：初始；}.拆分顶部.bigTop__media{浮动：右；宽度：50%；}.拆分顶部.bigTop__captionCredit{文本对齐：右；颜色：#666；}.拆分顶部.bigTop__text.bigTop__text--底部，.plitTop.bigTop__text.bigTop_text--变换：平移(-50%，-50%)；-webkit-Transform：翻译(-50%，-50%)；宽度：50%；最小高度：初始；填充：0 30px；}.edit-Japan.plitTop.bigTop__hed，.edit-Japan.plitTop.bigTop__dek{text-align：Left；}/*仅限4个单元*/@媒体(最大宽度：639px){.plitTop.bigTop__rel{paddingTop：15px；}.plititOnly(最大宽度：639px){.plitTop.bigTop__rel{padd-Bottom：15px；}.plititOnly。}.plitTop.bigTop__captionCredit{text-align：Left；color：#f4f4f4；}.plitTop.bigTop--lightTheme.bigTop__captionCredit{color：#666；}.plitTop.bigTop__text.bigTop__text--Bottom，.plitTop.bigTop__text.bigTop__text--Bottom{positi", "note_en": ".bigTop__preview { opacity: 0;}.bigTop__videoPlayerBox { position: absolute;}.bigTop__videoPlayerBox--passive { width: 100%; height: 100%; top: 0; left: 0; opacity: 0; /*z-index: -1;*/}.bigTop__videoPlayerBox--fallback { position: relative; z-index: 0;}.bigTop__videoPlayerBox--fallback .videoHint { display: none !important;}.bigTop__videoPlayerBox--active { width: 100%; height: 100%; top: 0; left: 0; opacity: 1; z-index: 1;}.bigTop__videoPlayer { position: relative; padding-bottom: 56.25%;}.bigTop__codeholder { display: none;}.bigTop__slideshow { cursor: pointer; position: absolute; bottom: 0; right: 0; background-color: #fff; padding: 10px; width: 300px;}.bigTop__button { border-width: 2px; border-style: solid; font-family: &#39;Retina&#39;, Helvetica, Arial, sans-serif; font-weight: 600; text-transform: uppercase; font-size: 12px; letter-spacing: 1px; cursor: pointer; margin: 0; padding: 6px 15px; box-sizing: border-box; transition: color 300ms, background-color 300ms;}.bigTop_button--embedded { background: transparent; color: #fff; margin: 30px auto 20px; min-width: 175px; border-color: #fff;}.bigTop_button--embedded:hover { color: #333; background-color: #fff;}.bigTop__button--black { color: #333; border-color: #333; background-color: #fff;}.bigTop__button--black:hover { color: #fff; background-color: #333;}.bigTop__button--inline { margin: 15px 0 0;}.bigTop__atmospheric { padding: 0; margin: 0; background-size: 1px 1px; background-position: -1px -1px;}.bigTop__atmospheric:empty { padding-bottom: 56.25%; background-color: #000; background-size: cover; background-repeat: no-repeat;}.bigTop__atmospheric video,.bigTop__atmospheric img { width: 100%; display: block; padding: 0; margin: 0;}/******** end media CSS *******//******************caption/credit********************/.bigTop__captioncredit { display: block; font-family: &#34;Retina&#34;, Helvetica, Arial, sans-serif; color: #666; margin: 5px auto 0; padding: 0 10px; box-sizing: border-box;}.bigTop__caption { font-size: 14px; line-height: 20px; font-weight: 300; display: inline;}.bigTop__credit { font-size: 14px; line-height: 20px; font-weight: 300; text-transform: uppercase; display: inline;}/******** end caption/credit ******//******** Video Play Button *********/.bigTop__play { width: 50px; height: 50px; cursor: pointer; border: 1px #999 solid; background-color: rgba(0, 0, 0, 0.7); border-radius: 50%; text-indent: -9999px; display: block; box-sizing: border-box;}.bigTop__videoPlayerBox:hover + .bigTop__text &gt; .bigTop__play,.bigTop__videoPlayerBox:hover + .bigTop__play--standalone,.bigTop__play--hover { background-color: #0080c3; border-color: #0080c3;}.bigTop__play:before { width: 0; height: 0; border-top: 11px solid transparent; border-bottom: 12px solid transparent; border-left: 18px solid #fff; content: &#34; &#34;; position: absolute; display: block; margin-top: 13px; margin-left: 18px;}.bigTop__videoTrigger { cursor: pointer; width: 100%; height: 100%; position: absolute; top: 0; left: 0;}.bigTop__play--standalone { position: absolute; top: 50%; left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); pointer-events: none;}/***** Video Button *****//********************Make bigTop align to page grid***********************/.bigTopPage__grid { padding: 0 10px; box-sizing: border-box; margin-left: auto; margin-right: auto;}/*** end page grid **//********************splitTop styling***********************/.splitTop .bigTop__rel { background-color: #222;}.splitTop .bigTop__text,.splitTop .bigTop__flash,.splitTop .bigTop__flash:link,.splitTop .bigTop__hed,.splitTop .bigTop__dek { color: #fff;}.splitTop.bigTop--lightTheme .bigTop__rel { background-color: #fff;}.splitTop.bigTop--lightTheme .bigTop__text,.splitTop.bigTop--lightTheme .bigTop__flash,.splitTop.bigTop--lightTheme .bigTop__flash:link,.splitTop.bigTop--lightTheme .bigTop__hed,.splitTop.bigTop--lightTheme .bigTop__dek { color: #000;}.splitTop .bigTop__overlay { background-color: transparent;}.splitTop .bigTop__overlay--bottom,.splitTop .bigTop__overlay--top { background: initial;}.splitTop .bigTop__media { float: right; width: 50%;}.splitTop .bigTop__captioncredit { text-align: right; color: #666;}.splitTop .bigTop__text.bigTop__text--bottom,.splitTop .bigTop__text.bigTop__text--top { position: absolute; top: 50%; bottom: auto; left: 25%; transform: translate(-50%, -50%); -webkit-transform: translate(-50%, -50%); width: 50%; min-height: initial; padding: 0 30px;}.edition-japan .splitTop .bigTop__hed,.edition-japan .splitTop .bigTop__dek { text-align: left;}/* 4 unit only */@media (max-width: 639px) { .splitTop .bigTop__rel { padding-bottom: 15px; } .splitTop .bigTop__media { float: none; width: 100%; } .splitTop .bigTop__captioncredit { text-align: left; color: #f4f4f4; } .splitTop.bigTop--lightTheme .bigTop__captioncredit { color: #666; } .splitTop .bigTop__text.bigTop__text--bottom, .splitTop .bigTop__text.bigTop__text--bottom { position: relative; width: auto; top: auto; left: auto; margin: 40px 20px; padding: 0; transform: none; -webkit-transform: none; } .bigTop__flash.flashlineSVG { margin-left: 0; }}/* 4, 8 unit splitTop font styling */@media (max-width: 979px) { .splitTop .bigTop__text .bigTop__hed { font-size: 32px; line-height: 1.12; } .wsj-modern span.bigTop__flash.flashlineSVG { text-indent: 215px; } .splitTop .bigTop__text .bigTop__dek { font-size: 16px; line-height: 1.38; }}/* 12, 16 unit splitTop font styling */@media (min-width: 980px) { .splitTop .bigTop__text .bigTop__hed { font-size: 52px; line-height: 1; } .splitTop .bigTop__text .bigTop__dek { font-size: 20px; line-height: 1.3; }}/*** end splitTop styling **//*****SECTION SPECIFIC STYLING***/.magazine .bigTop__flash,.magazine .bigTop__flash:link,.magazine .bigTop__flash:visited,.magazine .bigTop__flash:active { font-family: &#39;Retina Wide&#39;, &#39;Retina Narrow&#39;, &#39;Retina&#39;, &#39;Arial&#39;, sans-serif;}.magazine .bigTop__hed { font-weight: 400;}.magazine .bigTop__dek { font-family: &#39;Exchange&#39;, &#39;Chronicle SSm&#39;, Georgia, serif;}/***************Set via media query and not via classesto prevent page jump/rerenderPreviously set via CSS classes, e.g. bigTop__text--static, bigTop__hed-s,but it took too long for the page to &#34;settle&#34;**//* 4 unit only */@media (max-width: 639px) { .bigTopHide--4, .bigTop__flash.bigTopHide--4 { display: none; } .bigTop { margin: 0 0 20px; } .bigTop__overlay { display: none; } .bigTop__media--image { padding-bottom: 66.77%; } .bigTop__text { position: static; margin-top: 15px; text-align: left; margin-left: 10px; margin-right: 10px; width: auto; } .bigTop__overlay { display: none; } .bigTop__flash, .bigTop__flash:link, .bigTop__flash:active, .bigTop__flash:visited { color: #0080c3; text-align: left; } .bigTop__hed { font-size: 32px; line-height: 1.125; color: #000; text-align: left; } .bigTop__dek { font-size: 17px; line-height: 24px; color: #666; text-align: left; } .bigTop__flash + .bigTop__hed { margin-top: 4px; } .bigTop__hed + .bigTop__dek { margin-top: 1px; } .bigTop__dek:last-child { margin-bottom: 15px; } .bigTop__hed:last-child { margin-bottom: 14px; } .bigTop_button--embedded { margin: 15px 0 10px; color: #000; border-color: #000; min-width: 150px; } .bigTop_button--embedded:hover { background-color: #000; color: #fff; } .bigTop__text--flex &gt; .bigTop__play, .bigTop__play--standalone { position: absolute; top: 28vw; /* half of bottom padding of video elem */ left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); pointer-events: none; } .bigTop__videoTrigger { height: 0; padding-bottom: 56.25%; } .bigTop__flash.flashlineSVG { background-size: contain; } .wsj-modern .bigTop__text span:before { margin-left: 10px; }}/* 8 unit */@media (min-width: 640px) and (max-width: 979px) { .bigTop__captioncredit, .bigTop__text { max-width: 640px; } .wsj-modern .splitTop span.bigTop .bigTop__flash.flashlineSVG { min-width: 282px; } .bigTop__text.bigTop__text--bottom { box-sizing: border-box; min-height: 40%; top: auto; bottom: 0; padding-bottom: 10px; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); box-sizing: border-box; } .wsj-modern .bigTop span.bigTop__flash.flashlineSVG { max-width: 239px; min-height: 15px; max-height: 15px; min-width: 350px; } .wsj-modern .splitTop.bigTop span.bigTop__flash.flashlineSVG { min-width: 279px; } .bigTop__text.bigTop__text--top { top: auto; bottom:60%; max-height: 40%; padding-top: 10px; box-sizing: border-box; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__hed { font-size: 42px; line-height: 1.095; } .bigTop__hed + .bigTop__dek { margin-top: 9px; } .bigTop__flash + .bigTop__hed { margin-top: 5px; } .bigTop_button--embedded { margin: 20px auto; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { position: static; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { margin-top: 15px; } .bigTop__text--flex &gt; .bigTop__play + .bigTop__flash { margin-top: 15px; } .wsj-modern .splitTop .bigTop__text span:before { margin-left: 10px; }}/* 8, 12, 16 unit */@media (min-width: 640px) { .bigTopHide--8, .bigTopHide--12, .bigTopHide--16, .bigTop__flash.bigTopHide--8, .bigTop__flash.bigTopHide--12, .bigTop__flash.bigTopHide--16 { display: none; } .bigTop__rel { overflow: hidden; /* fix horizontal scroll in IE11 */ } .bigTop__media--image { padding-bottom: 51.3%; } .bigTop__media--image &gt; .bigTop__preview--forceblur { --webkit-filter: blur(20px); filter: blur(20px); } .bigTop__text { position: absolute; top: 50%; left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); } .bigTop__dek { font-size: 20px; line-height: 28px; } .bigTop__text--static.bigTop__text { color: #000; position: static; transform: none; margin-left: auto; margin-right: auto; } .bigTop__text--inactive.bigTop__text--bottom, .bigTop__text--inactive.bigTop__text--center { opacity: 0; } .bigTop__text.bigTop__text--flex { flex-direction: column; display: flex; justify-content: flex-end; align-items: center; height: 100%; } .bigTop__text--clickthrough { pointer-events: none; } .bigTop__text--clickthrough &gt; .bigTop__flash, .bigTop__text--clickthrough &gt; .bigTop__hed, .bigTop__text--clickthrough &gt; .bigTop__dek { pointer-events: auto; } .bigTop__text.bigTop__text--flex.bigTop__text--center { justify-content: center; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { order: 2; }}/* 12 unit */@media (min-width: 980px) and (max-width: 1299px) { .bigTop__captioncredit { max-width: 960px; } .splitTop .bigTop__captioncredit { max-width: none; } .bigTop__play { width: 70px; height: 70px; } .bigTop__play:before { border-top-width: 16px; border-bottom-width: 17px; border-left-width: 26px; margin-top: 18px; margin-left: 25px; }}/* 12, 16 unit */@media (min-width: 980px) { .splitTop .bigTop__captioncredit { margin: 0; padding: 5px 5px 0 0; width: 50%; float: right; } .bigTop__hed { font-size: 52px; line-height: 1.077; } .edition-japan .bigTop__hed { font-size: 45px; } .bigTop__text { max-width: 960px; } .bigTop__text.bigTop__text--bottom { box-sizing: border-box; min-height: 30%; top: auto; bottom: 0; box-sizing: border-box; padding-bottom: 30px; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__text.bigTop__text--top { top: auto; bottom: 70%; max-height: 30%; padding-top: 10px; box-sizing: border-box; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__hed + .bigTop__dek { margin-top: 8px; } .bigTop__flash + .bigTop__hed { margin-top: 5px; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { /* need to do this because of IE11 */ position: absolute; top: 50%; left: 50%; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play + .bigTop__flash, .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play + .bigTop__hed { margin-top: 50px; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { margin-top: -45px; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { margin-top: 20px; } .bigTop__text--flex &gt; .bigTop__play + .bigTop__flash { margin-top: 15px; }}/* 16 unit */@media (min-width: 1300px) { .bigTop__captioncredit { max-width: 1280px; } .splitTop .bigTop__captioncredit { max-width: none; } .bigTop__play { width: 90px; height: 90px; } .bigTop__play:before { border-top-width: 20px; border-bottom-width: 22px; border-left-width: 33px; margin-top: 24px; margin-left: 33px; }}", "posttime": "2020-06-02 02:34:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "崩溃,investors,bigtop", "title": "个人投资者被复杂证券的崩溃烧伤", "title_en": "Individual Investors Get Burned by Collapse of Complex Securities", "transed": 1, "url": "https://www.wsj.com/articles/bankrupt-in-just-two-weeksindividual-investors-get-burned-by-collapse-of-complex-securities-11591020059", "via": "", "real_tags": ["崩溃", "investors", "bigtop"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "里奇·怀特豪斯2020年6月1日你好，我是VGHF创始人弗兰克·西法尔迪。今天，我将与里奇·怀特豪斯合作，为你们带来一个关于我们如何恢复和重新组装“雷霆的日子”的故事，这是一个未发行的、从未见过的标题，由Mindscape的克里斯·奥伯斯(Chris Oberth)合著。\n程序员兼设计师克里斯·奥伯斯(Chris Oberth)在2012年去世之前，在视频游戏行业有着漫长而多样的职业生涯。我认为，对我们大多数人来说，克里斯·奥伯斯(Chris Oberth)最终的游戏是食蚁兽(Anteater)，这是他在斯特恩工作期间设计和设计的街机游戏(或者你可能知道克里斯自己为家用电脑写的克隆游戏--Aardvark Ardy-或者他没有写的那个-Oil‘s Well)。对其他人来说，这可能是64号准将的冬季奥运会，也可能是他后来在令人难以置信的科技公司(Uncredible Technologies)的街机活动，比如时代杀手(Time Killers)或世界级保龄球(World Class Bowling)，或者是他在70年代末和80年代初在他的Apple II上开发的几个游戏(他喜欢吹嘘的是序列号为201的Apple II)。\n2020年初，奥伯斯幸存家人的一位朋友找到视频游戏历史基金会，帮助他们理解他留下的材料。在他经常工作的家里地下室里，多年没有碰过的是成堆的旧电脑、CD-R备份、软盘、笔记、盒式磁带、EPROM和数据磁带，这些都可以追溯到他70年代末最早的Apple II作品，他的家人同意借给我们进行评估。\n就像在查看这样的档案时经常出现的情况一样，我们的首要任务是试图找回克里斯丢失的任何作品-他开发的游戏，由于这样或那样的原因，从来没有商业化过。不幸的是，我们几乎没有发现他在斯特恩的遗迹，这意味着他未发行的以Wumpus为灵感的街机游戏“地窖”很可能永远消失了。但收藏品的其余部分让我们对他后来的家用电脑和控制台工作寄予厚望。\n一张5.25英寸的软盘尤其让我们眼前一亮，上面有手写的标签，上面写着“任天堂热棒出租车决赛”。这并不是一个已知的游戏名称，但我们知道克里斯至少为任天堂娱乐系统开发了一款游戏-美国角斗士(American Gladiators)。当时我们对他的职业生涯知之甚少，但幸运的是，Oberth晚年至少对早期复古游戏爱好者网站进行了两次采访-一次是采访德里克的地下室拱廊，另一次是2006年为“复古时代”采访的三人组(特别是在“复古时代月刊”第21期、第24期和第27期)。就是在后者中，克里斯简短地提到了一款未发布的NES游戏--为Mindscape制作的未发布版本的“雷霆三重天”(由Beam Software进行的另一次尝试最终取代了它的位置)。“热棒出租车”是我们失去的雷霆时代吗？或许被剥夺了电影许可证头衔？\n答案原来是…。说大也大吧。也许吧。在对磁盘进行了一次干净的通量撕裂，并根据其源代码和图形数据组装了一个二进制文件之后，我们剩下了一个可玩的NES游戏，虽然历史上很有趣，但还不是一个很好的游戏。如果说有什么不同的话，那就是这似乎是早期的概念验证工作，也许是奥伯斯第一次在一个对他来说是全新的平台上涉足。\n我们还有另外一个地方要看：一大堆大部分贴着标签的硬盘备份，跨越了几年，分布在近40张软盘上。这些不仅仅是文件上的磁盘，它们是用(多个)硬盘备份工具完成的，这意味着文件被分割和加密。我们要恢复这些东西的唯一方法是将整个堆栈数字化，然后再重新组装。\n我们在寻找“雷霆之日”剩余部分的第一个任务是从可用的存储介质中恢复尽可能多的数据，这些存储介质主要由5.25英寸的旧磁盘组成。其中一些磁盘有无法读取的扇区，但许多仍然完好无损。一些磁盘也可以立即读取，FAT12文件系统是在MS-DOS下创建的。然而，最有希望的一组是由21个磁盘组成的集合，其中包含4个独立硬盘分区的备份，采用PC Tools 5.1生成的专有格式。我们得到了一些帮助来解决这个问题，“PCTools 5.10。标签上写着“备份”。\n最初，我尝试通过DOSBox运行PC Tools备份程序，希望能够通过仿真恢复备份。我没有任何运气让程序识别DOSBox下的磁盘映像，我认为我可能必须对模拟器本身做一些更改才能走这条路。在这一点上，我决定绕道直接理解数据，并着手挖掘这些备份磁盘映像中的原始扇区数据。\n数据的结构并不太复杂。每个目录和文件记录都存储在压缩流中，其中命令字节用于指示3件事中的1件。0xDA表示“目录记录”，要追加到当前目录堆栈中。0xDB表示“文件记录”，后面紧跟实际的文件数据。0xDC表示“POP目录”，用于从目录堆栈中删除最新的目录。在记录中，我还能够识别MS-DOS样式的日期/时间字，这使我们能够在备份中的每个文件上放置准确的日期。\n这是一个很有希望的开始，使我们能够生成备份中包含的文件列表。我们很快就发现了许多源代码和数据，它们似乎几乎肯定代表了大奖：“雷霆重生”(Days Of Thundern)。不幸的是，仍然存在一个问题。尽管我能够从备份中生成完整的路径列表，但我们需要的大部分数据都是使用专有算法压缩的。查看这里使用的压缩可能很容易，但是加密也是在已经压缩的数据之上应用的。幸运的是，应用于数据的加密是通用的，而不是基于用户指定的密钥，否则我很可能仍然在逐步恢复数据，而不是键入这个！\n因此，从这里开始，我考虑了几种方法。第一种方法是创建自定义版本的DOSBOX，以便使PC Tools备份程序在与原始备份映像的仿真下正常运行。第二种方法是对PC工具使用的加密和压缩进行反向工程，这意味着要花很长时间来反汇编(理想情况下，调试)原始程序。我对反汇编比这更庞大、更复杂的系统并不陌生，但我认为自定义构建的DOSBOX在这种方法中都会是一个有用的工具，所以我只需要在备份数据以某种方式损坏的情况下就可以做到这一点。在这种情况下，我必须了解它的每一点，以便从残骸中抢救出一切可能的东西。\n第三种方法比上面任何一种方法都简单得多：使用真实的硬件！不幸的是，我手头没有必要的硬件，但我们能够立即得到有硬件的人的帮助。Foone能够启动并运行基于硬件的解决方案，虽然我们确实需要重新撕毁其中一个备份磁盘集来让PC工具将其吞噬，但我们最终能够恢复这4个硬盘分区中的每一个分区上的每一位数据。\n因为第三种方法起作用了，所以我从来没有深入到对PC工具使用的压缩算法进行逆向工程的战壕中。然而，坊间传闻，它似乎很可能是类似LZSS的东西。我使用PC Tools集合中的pcsecure.exe进行了一些简单的测试，它使用的压缩似乎与备份程序使用的压缩非常相似(虽然不完全相同，但基于从匹配数据压缩所获得的结果)。我还注意到，对于您通常认为对LZSS不利的某些情况，压缩失败并产生了更大的最终结果，例如一系列完全唯一的字节，从而产生了我期望的那种使用控制字节堆积数据的开销。\n乍一看，我们没有看到任何突出的预置ROM映像。当然，那太容易了。因此，有了4个硬盘分区要筛选的数据，我从名为C：\\ROMX\\BTR的目录开始，当我们只需查看文件名列表时，这是我们最想看到的目录。这个目录似乎包含了“雷霆之日”的所有源代码和一些数据。许多最初用于开发游戏的工具，包括汇编器/链接器，也都备份在C：\\util中。最初的汇编程序是X6502，它是公元2500年软件公司的6502交叉汇编程序。这里的汇编器和链接器都标记为版本4.03b。\n我构建了源代码，并将所有对象链接在一起，从而生成了6个独立的二进制文件。这将我们带到这个过程的下一部分，一个名为ROMX的程序。此程序是GTEK，Inc.提供的ROMulator软件包的一部分。值得注意的是，在撰写本文时，该公司的网站仍在运行。在我们的例子中，ROMX程序用于通过PC的RS232端口进行通信，将数据直接放入NES显像带的PRG/CHR存储器中。这使得开发人员可以\nROMX PB0.TSK[TS，M\\，%%0000，@0000-FFFF]ROMX PB1.TSK[%%0000，@4000-7fff]ROMX PB2.TSK[%%0000，@8000-BFFF]ROMX PB3.TSK[%%0000，@C000-FFF]ROMX PB4.TSK[%%0000，@10000-13fff]ROMX PB7.tsk[%%0000，@。\n上面的代码告诉我们应该将6个代码二进制文件(我之前提到的那些代码二进制文件)和2个预先生成的声音二进制文件放在哪里。当其中一个开发人员想要从PRG或CHR内存生成平面二进制文件时，而不是在另一个PC端进程中复制所有这些信息，他们只需运行ROMX并带参数从硬件转储所有数据并将其存储到一个文件中。\n在构建游戏的这一点上，很明显，我们仅根据PRG银行的数量就需要某种类型的映射器，所以我查看了源代码，看到了一些明确地与MMC1寄存器一起工作的代码。我用我的128KB PRG ROM构造了一个Ines头，相应地设置了映射器位，然后将一些随机垃圾扔到CHR ROM中进行测试。这款游戏在模拟器中成功启动，并开始在一大堆随机的磁贴数据上播放音乐，我认为这些数据可能应该是一个标题屏幕。\n通过在CHR ROM中运行带有一堆随机数据的游戏，我可以看到我们正在查看相当多的独特的瓷砖数据。这些数据的一些痕迹仍然留在震源及其周围。具体地说，有一个定制工具可以从Pictor CLP文件中解析出分块块，将它们写入临时文件，然后通过ROMX将它们上传到显式的cr地址。这一过程被一些小型汽车和扳手瓷砖套装所调用。然而，在很大程度上，大量的CHR数据都下落不明，也没有迹象表明CHR数据通常是如何通过ROMX上传的。\n在另一个目录C：\\ROMX\\CHEDIT中，我发现了一个自定义的NES磁贴编辑器，其中包含似乎属于《雷霆天下》的剩余数据。我能够将这里导出的一些.map和.pal数据与正在组装到PRG中的数据进行匹配，因为这是匹配的，所以我认为这里的.chr文件也将与任何属于CHR的文件相匹配。我从一个名为CAR.CHR的文件开始，着手找出它在CHR内存中的确切位置。这个问题的答案是0x3000，我通过查看标题屏幕成功地验证了这一点，即使CHR的其余部分充满了随机数据：\n验证这个特定的数据是否属于cr ROM是很好的，但是我仍然遗漏了很多数据，而且我在一个动画实用程序的脚本中发现了一些引用，这些引用指向驱动器路径上的跟踪和平铺图像，而这些路径在我们还原的备份中实际上并不存在。我担心会出现最坏的情况，那就是我们丢失了一大堆CHR数据以及重建它的源数据。\n知道我已经有了一个很好的大块CHR ROM的可能候选者，我从CAR.CHR中提取了一个唯一的字节字符串，并在备份中的每个文件中进行二进制搜索，希望我能幸运地命中一个预构建的CHR ROM块。第一次尝试没有运气。在这一点上，我选择了核选项。我提取了每个驱动器备份中所有已知格式的每个存档，并对我们设法恢复的每个其他磁盘映像执行了相同的操作。我再次搜索了整个文件，只找到了一个128KB的二进制文件。哦，是的。\n我很谨慎，不知道那个大小方便的128KB二进制文件是否真的会与我正在使用的源地图和磁贴地图匹配，特别是因为命中来自另一组单独的磁盘。不过，在这一点上看不到其他选择，我拿出该文件，并使用它来占据我构建的NES ROM中的整个CHR ROM，它就在那里。一切似乎都在它应该在的地方！\n终于，三十多年来第一次在这里看到了久违的雷霆之日！\n有了这些，我们的任务就成功了。不幸的是，我们似乎确实丢失了很多源数据，我仍然怀疑Said数据位于我们恢复的主备份中未包括的其他硬盘分区中的某个位置。如果不是因为我们成功地从一组看似无关的数据中找到了cr二进制文件，我们可能永远无法完整地恢复这款游戏，或者我们可能最终创作了自己的瓷砖，只是为了看看预期的可玩体验的一些外观。这正好说明，每一张软盘都很重要！\n在得到Chris Oberth家人的许可后，我们将在不久的将来在GitHub上发布可构建的源代码。与此同时，一群复古游戏爱好者为奥伯斯的遗孀举办了一系列与任天堂娱乐系统兼容的小打小闹的《雷霆三重天》(Days Of Think)墨盒，作为筹款活动。在这里可以买到。\n多亏了你们慷慨的慈善捐助，我们才得以花了几周时间关注奥伯斯的档案！如果没有像你这样的人，这种水平的工作真的是不可能的。如果你是VGHF的新手，或者你只是欣赏我们正在做的工作，如果可以的话，请考虑给予。每一美元都有帮助。\n我们正在保存视频游戏的历史，一次保存一个字节。现在捐赠", "note_en": "by Rich Whitehouse   June 1, 2020   Hey all, VGHF founder Frank Cifaldi here. Today I’m tag-teaming with Rich Whitehouse to bring you the story of how we recovered and re-assembled  Days of Thunder, an unreleased, never-before-seen title co-authored by Chris Oberth at Mindscape.\n Programmer and designer Chris Oberth had a long, diverse career in the video game industry before he passed away in 2012. I think for most of us, the definitive Chris Oberth game was  Anteater, the arcade title he designed and engineered during his time at Stern (or perhaps you know the clone that Chris himself wrote for home computers –  Ardy the Aardvark – or the one he didn’t –  Oil’s Well). For others, it might be  Winter Games for the Commodore 64, or perhaps his later arcade work at Incredible Technologies like  Time Killers or  World Class Bowling, or the handful of titles he developed on his Apple II in the late 70s and early 80s (on an Apple II with serial number 201, as he liked to brag).\n In early 2020, The Video Game History Foundation was approached by a friend of Oberth’s surviving family to help them make sense of the materials he had left behind. Untouched for years in the home basement he often worked from were piles of old computers, CD-R backups, floppy disks, notes, cassettes, EPROMs, and data tape going back to his earliest Apple II work in the late 70s, which his family agreed to loan to us for evaluation.\n As is often the case when looking at archives like this, our first priority was trying to recover any works of Chris’ that were lost – games he developed that, for one reason or another, were never available commercially. Unfortunately we found almost no remains of his time at Stern, which meant that his unreleased  Hunt the Wumpus-inspired arcade game  Crypt is likely gone forever. But the rest of the collection gave us high hopes for his later home computer and console work.\n  One disk in particular jumped out at us – a 5.25” floppy with a hand-written label that said “NINTENDO HOT ROD TAXI FINAL.” This is not a known title for a game, but we knew that Chris had developed at least one game for the Nintendo Entertainment System –  American Gladiators. We didn’t know much else about his career around this time, but fortunately Oberth conducted at least two interviews in his later years with early retro game enthusiast websites – one with  Derek’s Basement Arcade and a three-parter in 2006 for  Retrogaming Times (specifically in issues 21, 24, and 27 of “Retrogaming Times Monthly”). It was in the latter that Chris briefly mentioned an unreleased NES game – an unpublished version of  Days of Thunder done for Mindscape (a separate attempt done by Beam Software was ultimately published in its place). Was “Hot Rod Taxi” our lost  Days of Thunder? Perhaps stripped of its movie license title?\n  The answer turned out to be…sort of. Maybe. After making a clean flux rip of the disk and assembling a binary from its source code and graphics data, we were left with a playable NES game that, while historically interesting, was not much of a game yet. If anything, it appeared to be early proof-of-concept work, perhaps Oberth getting his feet wet for the first time on a platform that was brand new to him.\n We had one other place to look: a giant pile of mostly-labeled hard drive backups, spanning several years, across nearly 40 floppy disks. These weren’t merely disks on files, they were done with (multiple) hard drive backup tools, meaning files were split and encrypted. The only way we were going to recover anything on these was to digitize the entire stack and then re-assemble them afterward.\n    Our first task in finding what remained of  Days of Thunder was to recover as much data as possible from the available storage media, which consisted primarily of old 5.25” disks. Some of those disks had unreadable sectors, but many still were fully-intact. Some of the disks were also immediately readable, with FAT12 file systems created under MS-DOS. The most promising set of the bunch, however, was a collection of 21 disks containing backups of 4 separate hard drive partitions, in a proprietary format generated by  PC Tools 5.1. We had some help figuring that part out, “PCTools 5.10. Backup” was written on the labels.\n  Initially, I tried running the PC Tools backup program via  DOSBox in hopes that I might be able to restore the backups through emulation. I didn’t have any luck getting the program to recognize the disk images under DOSBox, and figured I might have to make a few changes to the emulator itself in order to go that route. At that point, I decided to take a detour toward understanding the data directly, and set about digging through the raw sector data in those backup disk images.\n The structure of the data wasn’t too complicated. Every directory and file record was stored in a packed stream, where command bytes were used to indicate 1 of 3 things. 0xDA means “directory record”, to be appended to the current directory stack. 0xDB means “file record”, immediately followed by the actual file data. 0xDC means “pop directory”, which removes the most recent directory from the directory stack. Within the records, I was also able to identify MS-DOS style date/time words, which gave us the ability to put precise dates on each of the files in the backup.\n This was a promising start, and allowed us to generate a list of files contained in the backups. We quickly spotted a lot of source code and data that seemed to almost certainly represent the big prize:  Days of Thunder. Unfortunately, there was still a problem. Even though I was able to generate a full path list from the backups, most of the data we were after was compressed using a proprietary algorithm. It may have been easy enough to eyeball the compression used here, but encryption was also applied on top of the already-compressed data. Fortunately, the encryption applied to the data was generic and not based on a user-specified key, or I’d likely still be chipping away at recovering the data instead of typing this!\n So from here, I considered a few approaches. The first approach was to create a custom build of DosBox in order to massage the PC Tools backup program into functioning correctly under emulation with the original backup images. The second approach was to reverse engineer the encryption and compression used by PC Tools, which would mean taking a good bit of time to disassemble (and, ideally, debug) the original program. I’m no stranger to disassembling systems more vast and complicated than this, but I figured a custom build of DosBox would be a useful tool in this approach either way, so I would only need to go this far in the event that the backup data was corrupt in some way. In that case, I’d have to understand every bit of it in order to salvage everything possible from the wreckage.\n  The third approach was a lot easier than either of the above: Use real hardware! Unfortunately, I didn’t have the necessary hardware on hand, but we were able to immediately enlist the help of  someone who did. Foone was able to get a hardware-based solution up and running, and although we did have to re-rip one of the backup disk sets to get PC Tools to swallow it, we were ultimately able to restore every bit of data on each of those 4 hard drive partitions.\n Because the third approach worked, I never did get down in the trenches of reverse engineering the compression algorithm used by PC Tools. Anecdotally, however, it seemed likely to be something  LZSS-like. I did some simple tests using  pcsecure.exe from the PC Tools collection, which appeared to use a compression very similar (although not identical, based on results achieved by compressing from matched data) to the compression used by the backup program. I also noted that the compression fell over and produced larger end results for some of the cases that you’d normally expect to be bad for LZSS, such as a series of completely unique bytes, producing the kind of overhead that I’d expect from peppering the data with control bytes.\n  Upon first glance, we didn’t see anything that stood out as being a pre-built ROM image. Of course, that would’ve been too easy. So with 4 hard drive partitions worth of data to sift through, I started in a directory named  C:\\ROMX\\BTR, which is the directory we were most excited to see back when all we had to look at was a list of filenames. This directory seemed to contain all of the source code, and some data, for  Days of Thunder. Many of the tools originally used to develop the game, including the assembler/linker, were also backed up in  C:\\UTIL. The original assembler was X6502, a 6502 cross assembler by 2500 A.D. Software, Inc. Both the assembler and linker here were marked as Version 4.03b.\n I built the source and linked all of the objects together, which generated 6 separate binaries. This brings us to the next part of the process, a program called ROMX. This program is part of a ROMulator package by GTEK, Inc. The company’s website, really quite remarkably,  is still up as of this writing. In our case, the ROMX program was used to communicate over the PC’s RS232 port, placing data directly in a NES development cartridge’s  PRG/CHR memory. This allowed developers to quickly update and test their code and/or graphic changes on real hardware. Even more conveniently, they were able to selectively update only a particular set of banks in order to reduce iteration times when updating a particular piece of code or set of tiles. There are quite a few batch files in the source which run ROMX commands to upload specific files to specific places in PRG/CHR. Here’s one which tells us exactly how the entirety of PRG ROM is laid out:\n ROMX PB0.TSK[TS,M\\,%%0000,@0000-ffff]\rROMX PB1.TSK[%%0000,@4000-7fff]\rROMX PB2.TSK[%%0000,@8000-bfff]\rROMX PB3.TSK[%%0000,@C000-ffff]\rROMX PB4.TSK[%%0000,@10000-13fff]\rROMX PB7.tsk[%%0000,@1C000-1ffff]\rROMX CRASHL2.SND[%%0000,@1F000-1ffff]\rROMX SKIDF.SND[%%0030,@1FC80-1fff0,TE]\n The above tells us where to place the 6 code binaries (the ones I just talked about linking together earlier), along with 2 pre-generated sound binaries. When one of the developers wanted to produce a flat binary from PRG or CHR memory, instead of replicating all of this information in another PC-side process, they would just run ROMX with parameters to dump all of the data right from the hardware and store it to a file.\n At this point in building the game, it was clear that we’d need some kind of mapper based on the number of PRG banks alone, so I went looking through the source and saw some code which was explicitly working with  MMC1 registers. I constructed an iNES header with my 128KB PRG ROM, set the mapper bits accordingly, and just threw some random garbage into CHR ROM for testing. The game successfully booted up in an emulator, and started playing music over a big mess of random tile data which I figured was probably supposed to be a title screen.\n  From running the game with a bunch of random data in CHR ROM, I could see that we were looking at quite a bit of unique tile data. Some traces of this data remained in and around the source. In particular, there was a custom tool designed to parse tile blocks out of  Pictor CLP files, write them to a temporary file, and upload them to explicit CHR addresses via ROMX. This process was being invoked for some small car and wrench tile sets. For the most part, though, a whole lot of CHR data was unaccounted for, and there was no sign of how that CHR data was normally uploaded via ROMX.\n Up in another directory,  C:\\ROMX\\CHEDIT, I found a custom NES tile editor with remnants of data which appeared to belong to  Days of Thunder. I was able to match some of the .map and .pal data which had been exported here to data which was being assembled into PRG, and because that matched, I figured the .chr files in here were also going to be a match to whatever belonged in CHR. I started with a file named  CAR.CHR, and set about figuring out exactly where it belonged in CHR memory. The answer to that was 0x3000, which I managed to verify by looking at the title screen even with the rest of CHR filled with random data:\n  It was good to verify that this particular data belonged in CHR ROM, but I was still missing lots of data, and I’d discovered some references in scripts for an animation utility which pointed to track and tile images on drive paths which didn’t actually exist in the backup we’d restored. I feared the worst, which was that we were missing a whole bunch of CHR data along with the source data to reconstruct it.\n Knowing that I already had a likely candidate for a nice big chunk of CHR ROM, I took a unique string of bytes from  CAR.CHR and binary searched for it in every file in the backup, hoping I’d get lucky and hit a pre-built chunk of CHR ROM. No luck on the first attempt. At this point, I went for the nuclear option. I extracted every archive in every known format in every one of the drive backups, and did the same for every other disk image that we’d managed to recover. I ran another search over the whole thing, and there was a single hit on a 128KB binary file.  Oh yes.\n  I was cautious, not knowing if that conveniently-sized 128KB binary file would actually match the source and tile maps I was working with, particularly because the hit came from a separate set of disks. Seeing no other option at this point, though, I took the file and used it to occupy the whole of CHR ROM in my constructed NES ROM, and there it was. Everything seemed to be exactly where it should be!\n  At last, the long-lost  Days of Thunder, seen here for the first time in over thirty years!\n With that, we’d succeeded in our mission. It does seem that we’re missing a lot of source data, unfortunately, and I still suspect that said data lived somewhere on those other hard drive partitions which weren’t included in the main backup we restored. If not for the fact that we managed to get a hit on the CHR binary from a seemingly unrelated set of data, we may never have been able to restore this game in its entirety, or we might’ve ended up authoring our own tiles just to see some semblance of the intended playable experience. It just goes to show, every floppy matters!\n  With permission from Chris Oberth’s family, we will be publishing buildable source code on GitHub in the near future. In the mean time, a group of retro game enthusiasts has put together a small print run of  Days of Thunder cartridges, compatible with the Nintendo Entertainment System, as a fundraiser for Oberth’s widow. It is available  here.\n  We were able to spend weeks focusing on Oberth’s archives thanks to your generous charitable donations! This level of work really wouldn’t have been possible without people just like you. If you’re new to the VGHF, or if you just appreciate the work we’re doing, consider giving if you can. Every dollar helps.\n We’re preserving the history of video games, one byte at a time. Donate Now", "posttime": "2020-06-02 02:33:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,游戏,nes,lost,数据", "title": "从30年前的源代码盘重建丢失的NES游戏", "title_en": "Reconstructing a lost NES game from 30-year-old source code disks", "transed": 1, "url": "https://gamehistory.org/days-of-thunder-nes-unreleased/", "via": "", "real_tags": ["代码", "游戏", "nes", "lost", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004709, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IP地址很难记住，这就是我们有DNS的原因。但是，在大多数本地系统上，我们没有DNS服务器，我们必须记住系统的IP地址。更糟糕的是，让Mesay I拥有一个包含1000个节点的集群。如果没有名称服务器或自动发现工具，我应该记住群集节点的所有IP地址。\n现代集群体系结构支持的一件事是节点发现。现在，您有具有1000个节点的相同集群，您不必记住所有节点的IP地址，只需记住一个节点，并且该节点还充当到其他节点的服务发现。例如，如果您的应用程序要与Node4对话，而您只知道Node1的IP地址，则您可以像与Node4对话一样与Node1对话，由Node1将通信重定向到Node4，也可以向Node1请求Node4的IP地址。\n但一个主要问题是，如果node1由于某种原因关闭，即使群集仍将与其余999个节点一起工作，或者添加了一个具有不同IP地址的新节点，您也无法访问整个群集，因为您所拥有的只有node1的IP地址，而node1当前不在群集中。(=。因此，我们有一个集群IP地址。集群系统的核心是节点发现服务。您的应用程序连接到群集IP，您不必担心出现故障，因为群集IP与它没有任何关系，只是充当群集中节点和其他服务的发现工具。\n现在，我们又来了。现在我们必须记住群集的IP地址。如果是IPv6，几乎不可能记住地址。集群系统缺少人类可读的名称，即它缺少名称服务器。如果集群存在于云系统中，您不必担心记忆问题，因为外部DNS会出现在画面中，您可以设置域名。\n大多数本地系统都没有名称服务器。如果您查找网络以了解所有系统都连接到机器上的是什么，您会得到一堆IP地址。您有本地群集、打印机、手机、笔记本电脑、物联网等。\n让我们以打印机为例。您已连接到10台不同的打印机，每台打印机都属于不同的类型。如果您需要打印文件，并且您想要选择特定的打印机，让我们假设您不需要打印机的名称，而只需要IP地址。因此，您要做的是查找打印机的IP地址表，并获取正确的打印机的IP地址。不过，您仍只能键入或复制粘贴IP地址。要解决此问题，大多数专用网络会使用zeroconf技术在计算机的主机名末尾附加.local。现在，在打印机的示例中，如果您在网络中查找连接的打印机，您会得到。\n现在，您不必记住所需打印机的IP地址。你所要记住的就是一个人类可读的名字。\n集群也是如此。您可以通过my-awong-cluster.local访问您的集群。更棒的是，您可以在node1.my-awawy-cluster.local访问node1at，在node4.my-awawy-cluster.local访问node4。如果假设node1出现故障，并且如果群集使用不同的IP地址启动一个新节点来占据node1的位置，则可以在node1.my-awee-cluster.local上访问该新节点。(=。这称为FQDN。\n早些时候，您使用群集的IP地址连接到群集，它可以正常工作。现在，当您告诉您的应用程序使用.local连接到集群时，它根本不知道如何连接。问题是应用程序不知道如何将.local域名解析为群集IP地址。它没有ADNS服务器。由于群集是本地群集，因此您的DNS服务器无法解析它。\n在云系统的情况下，您将设置一个域名，并且您可以使用该域名访问集群。外部DNS帮助您将域名解析为集群IP地址。\n为了解决这个问题，我们有了mDNS。mDNS是一种协议，它将主机名解析为缺少名称服务器的小型网络中的IP地址。默认情况下，mDNS以独占方式解析以.local结尾的主机名。但是，实现.local不支持mDNS协议的主机将会出现问题，并且可以通过传统的单播DNS服务器找到这些主机。在这些情况下，应更改必要的网络配置。\nRedisLabs有一个Redis Enterprise docker映像，它可以做很多事情1，但我们这里需要的是企业集群。\n我之所以选择Redis Enterprise docker映像，是因为它与前面的集群示例非常吻合。使用Redis EnterprisecContainer，我们可以创建一个Redis数据库集群。群集将拥有一个带有.local的域名(即my-awawy-cluster.local)，并且群集中的每个节点都会收到一个FQDN(即node1.my-awawy-cluster.local)。\n总结以上段落，我们得到一个具有&lt；my-cluster&gt；.local地址的集群和具有&lt；my-node&gt；.&lt；my-cluster&gt；.local的节点。\n端口8443和9443应该强制暴露，以便容器为服务发挥其所有魔力。\n.更多日志.2020-05-30 05：10：03,048信息成功：mdns_server进入运行状态，进程已保持&gt；超过1秒(开始).更多日志.\n我们暴露的端口12000可以是任何空闲端口。这是我们创建的数据库将监听的端口。在当前的示例中，我只创建了一个节点。但是可以有很多种。\n您不必编辑任何内容，在群集配置下，您可以这样为群集提供FQDN。\n您可以跳过输入容器使用默认选项创建证书的证书。然后，您可以设置Redis企业容器要求您设置的一些凭据。一旦您设置了凭据，您的页面将被刷新，您将再次选择输入凭据。登录后，您就可以创建数据库了。\n您可以选择Redis&34；作为您的数据库，然后会给您一张表格，让您输入数据库的配置。\n我将该名称指定为node1，最重要的是，您必须将端口设置为12000，因为这是我们公开的唯一端口。单击打开显示高级选项，您可以找到您可以在其中输入端口的字段&#34；Endpoint portnumber&#34；。输入12000(因为这是我公开的端口)。单击激活以创建数据库。然后，您将被重定向到您创建的数据库的配置页面。\n您可以在Endpoint字段中找到数据库的.local地址和IP地址。\n现在，让我们创建示例应用程序，该应用程序只需连接到node1并ping数据库即可。\n我们已经拍摄了python buster映像，即Debian10，其中包含mdns包，稍后我们将安装这些包。\n$docker build-t py-mdns.将构建上下文发送到Docker后台进程3.072kB步骤1/3：从python：3.8-buster3.8-buster：正在从库中拉入/python376057ac6fa1：拉出完成5a63a0a859d8：拉出完成496548a8c952：拉出完成2adae3950d4d：拉出完成0ed5a9824906：拉出完成bb94ffe72389：在1d31f5312e3e中运行收集redis下载redis-3.5.2-py2.py3-one-any.whl(71 KB)安装收集的软件包：恢复成功安装redis-3.5.2删除中间容器1d31f5312e3e-&gt；c21a8bc34782步骤3/3：cmd[&#34；python3&#34；]-&gt；在7中运行。\n请记住，节点1的.local地址是redis-12000.mycluster.local，IP地址是172.17.0.2，端口是12000。\n$docker run-it py-mdnsPython 3.8.3(默认，May 16 2020，07：08：28)[GCC 8.3.0]在linuxType&34；Help&34；，&#34；版权所有&34；，&34；或&34；License&34；了解详细信息。&&gt;；&&gt;；导入Redis；&&gt;；&&gt;redis.Redis(HOST=#39。，port=12000).ping()回溯(最近一次调用)：文件&#34；/usr/local/lib/python3.8/site-packages/redis/connection.py&#34；，行550，在CONNECT SOCK=sel._connect()文件&#34；/usr/local/lib/python3.8/site-packages/redis/connection.py&#34；，行575，in_connect for res in socket.getaddrinfo(self.host，self.port，self.socket_type，file&#34；/usr/local/lib/python3.8/socket.py&#34；，第918行，在getaddrinfo for res in_socket.getaddrinfo(host，port，family，type，proto，flag)：socket.gaierror：[Errno-2]名称或服务未知在处理上述异常的过程中，出现另一个异常：traceback(最近一次调用)：file&#34；&lt；stdin&gt；&#。执行命令行/usr/local/lib/python3.8/site-packages/redis/client.py&#34；，=self.connection或pool.get_connection(命令名，**选项)文件&#34；文件&#34；/usr/local/lib/python3.8/site-packages/redis/client.py&#34；，行898，在EXECUTE_COMMAND CONN=self.connection或pool.get_connection(命令名，**选项)文件&#34；/usr/local/lib/python3.8/site-packages/redis/connection.py&#34；，第1183行，在Get_Connection connection.connect()文件&#34；/usr/local/lib/python3.8/site-packages/redis/connection.py&#34；，行554中，在CONNECT RAISE ConnectionError(self._error_message(e))redis.exceptions.ConnectionError：Error-2\\f25 Connecting to REDIS-12000.mycluster.local：12000。名称或服务未知。\n发生的情况是，您的应用程序缺少mDNS服务发现，以至于它不知道要询问谁以及如何将.localhostname解析为IP地址。\n默认情况下，libnss最多可以解析两个标签，这样它就可以解析mycluster.local的IP地址，但我们需要的是三标签。让我们也尝试配置添加该配置。\n运行set-ex\\&amp；&amp；apt-get update&amp；&amp；apt-get install-y--no-install-suggesavahi-daemon libnss-mdns\\#允许解析具有更多标签的主机名。这样我们就可以#解析node1.mycluster.local。#(https://github.com/lathiat/nss-mdns#etcmdnsallow)&amp；&amp；ECHO&*&39；&gt；/etc/mdns.allow\\#将NSSwitch配置为使用mdns4插件，以便尊重mdns.allow。&amp；&amp；sed-i&34；s/hosts：.*/hosts：files mdns4dns/g&34；/etc/nsswitch.conf。\n现在，我们已经完成了配置，可以在容器使用入口点脚本启动时启动avahi-daemon。这里是入口点脚本。\n这将启动dbus，它是avahi-daemon的依赖项。这就是Dockerfile的样子。\n在python中：3.8-buster WORKDIR/app copy entrypoint.sh/app/run set-ex\\&amp；&amp；apt-get update&amp；&amp；apt-get install-y--no-install-suggesavahi-daemon libnss-mdns\\#允许解析具有更多标签的主机名。这样我们就可以#解析node1.mycluster.local。#(https://github.com/lathiat/nss-mdns#etcmdnsallow)&amp；&amp；ECHO&*&39；&gt；/etc/mdns.Allow\\#将NSSwitch配置为使用mdns4插件，以便尊重mdns.allow：&amp；&amp；sed-i&34；s/hosts：.*/hosts：files mdns4DNS/g&34；/etc/nsswitch.conf\\&amp；&amp；&amp；PIP3install redis入口点[&#。，&#34；./entrypoint.sh&#34；]cmd[&#34；python3&#34；]。\n$docker run-it py-mdns[ok]正在linuxType&#34；Help&#34；，&#34；版权&#34；，&#34；Credits&#34；或&#34；License&#34；上启动avahi mdns/dns-sd后台进程：avahi-daemon.Python 3.8.3(默认，5月16日，07：08：28)[GCC 8.3.0]，了解详细信息。redis.redis(host=&#39；redis-12000.mycluster.local&#39；，port=12000).ping()True。\n现在让我们来谈谈这些安全问题。2许多容器平台只接受非根容器，例如：OpenShift。如果您希望您的应用程序部署在任何容器平台上，您可以尝试以非root用户身份运行容器。\n$docker run-it--user 1001 py-mdnsmkdir：无法创建目录‘/var/run/dbus’：权限被拒绝。\nUSER参数采用用户UUID。它说要以任何其他用户身份运行，而不是以root用户身份运行。`1001`不是特殊用户。它可能只是与映像中的现有用户不匹配的任何UUID。您还可以将USER命令放入Dockefile中。\n它需要root权限才能启动应用程序。您可以通过连接到容器进行检查。\n$docker exec-it a701fb0d30e2bashroot@a701fb0d30e2：/app#ps-aux USER PID%CPU%MEMVSZ RSS TTY stat start time COMMANDroot 1 0.8 0.0 13340 8276pt/0 ss+06：27 0：00 python3message+19 0.0 0.08552 2368？SS 06：27 0：00/usr/bin/dbus-daemon--systemavahi 46 0.0 0.0 7868 2564？s 06：27 0：00 avahi-daemon：正在运行[a701fb0d30e2.local]avahi 47 0.0 0.0 7868 296？s 06：27 0：00 avahi-daemon：chroot helperroot 71 7.0 0.0 5748 3636分/1 SS 06：27 0：00 bashroot 76 0.0 0.0 9388 3092分/1 R+06：27 0：00 ps-aux root@a701fb0d30e2：/app#。\n应用程序不能以非root用户身份启动的原因是，数据库(Avahi；的依赖项)需要root权限才能启动。\n有一种方法可以在没有dbus的情况下运行Avahi，方法是将enable-dbus=no添加到avahi-daemon.conf文件的[server]部分。该文件位于/etc/avahi/avahi-daemon.conf中。\n默认情况下，Avahi需要root权限才能启动。我们可以通过提供--no-drop-rootflag来绕过它。3您可以在这里查看所有的选项。让我们删除dbus。另外，让我们在不使用服务的情况下手动启动该过程。\n#Dockerfile&amp；&amp；sed-i&#34；s/hosts：.*/hosts：files mdns4 dns/g&#34；/etc/nsswitch.conf\\+&amp；&amp；printf&#34；[server]\\nenable-dbus=no\\n&#34；&gt；&gt；/etc/avahi/avahi-daemon.conf\\&amp；&amp；pip3安装redis。\n#entrypoint.sh-#start avahi&-service dbus start#start avahi-service avahi-daemon start+avahi-daemon--daemonize--no-drop-root。\n$docker run-it--等待返回值时达到用户1001 py-mdns bashTimeout无法从后台进程接收返回值。\n然后集装箱离开。我们仍然不能以非根用户身份运行容器。实际问题在于avahi-daemon正在访问的文件和文件夹。这些文件应该具有root或avahi权限才能访问它。\n#Dockerfile&amp；&amp；printf&#34；[server]\\nenable-dbus=no\\n&#34；&gt；&gt；/etc/avahi/avahi-daemon.conf\\&&amp；&amp；chmod 777/etc/avahi/avahi-daemon.conf\\+&amp；&amp；mkdir-p/var/run/avahi-daemon\\+&amp；PIP3安装Redis。\n我们更改文件/etc/avahi-daemon.conf的权限，以便avahi守护进程可以访问该文件。我们还创建了/var/run/avahi-daemon目录，因为avahi守护进程需要。我们还会在创建后更改它们的权限。我们还可以添加用户标志，以便默认情况下它按照指定的UUID运行。\n在python中：3.8-buster WORKDIR/app copy entrypoint.sh/app/run set-ex\\&amp；&amp；apt-get update&amp；&amp；apt-get install-y--no-install-suggesavahi-daemon libnss-mdns\\#允许解析具有更多标签的主机名。这样我们就可以#解析node1.mycluster.local。#(https://github.com/lathiat/nss-mdns#etcmdnsallow)&amp；&amp；ECHO&*&39；&gt；/etc/mdns.allow\\#将NSSwitch配置为使用mdns4插件，以便尊重mdns.allow：&amp；&amp；sed-i&34；s/hosts：.*/hosts：files mdns4DNS/g#34；/etc/nsswitch.conf\\&amp；&amp；printf&#34；[服务器]\\nenable-dbus=no\\n&#34；&gt；&gt；/etc/avahi/avahi-daemon.conf\\&amp；&amp；chmod 777/etc/avahi/avahi-daemon.conf\\&amp；&amp；&amp；mkdir-p/var/run/avahi-daemon\\&amp；&amp；chown avahi：avahi/var/run/avahi。PIP3安装redis用户1001入口点[&#34；bash&#34；，&#34；./entrypoint.sh&#34；]cmd[&#34；python3&#34；]。\n现在让我们启动容器。现在我们不必传递--user标志，因为我们已经将user命令放在Dockerfile中。\n$docker run-it--user1001py-mdnsPython 3.8.3(Default，May 16 2020，07：08：28)[GCC 8.3.0]linuxType&#34；Help&#34；，&#34；版权所有&34；，&34；或&#34；License&34；有关详细信息，&&gt;；&&gt;；&&gt;导入Redis；&&gt;；&&gt;redis.Redis(。，port=12000).ping()True。\n$docker exec-it c641eeb8559f Bashi没有名字！@c641eeb8559f：/app$ps-aux USER PID%CPU%MEMVSZ RSS TTY STAT STAT开始时间COMMAND1001 1 0.4 0.0 27248 16220分/0 SS+08：22 0：00 python31001 8 0.0 0.0 80122524？s 08：22 0：00 Avahi-daemon：正在运行[c641eeb8559f.local]1001 10 11.0 0.0 5748 3612分/1 SS 08：23 0：00 bash1001 15 0.0 9388 3072分/1 R+08：23 0：00 ps-aux。\n我们已经到了邮筒的尽头。您可以在此存储库中找到代码示例。\n1 Redis Enterprise Software是企业级、分布式、内存中的NoSQL数据库服务器，完全兼容Redis Labs的开源Redis。\n3avahi-daemon.conf有很多配置，我们的应用程序中不需要它，所以我只是将enable-dbus设置为no。", "note_en": "IP addresses are hard to remember and that&#39;s why we have DNS. Butstill, on most of the local systems, we don&#39;t have a DNS server and wehave to remember the IP addresses of the systems. Even worse, let mesay I have a cluster with 1000 nodes. Without a  nameserver orauto-discovery tool, I should remember all the IP addresses of thecluster nodes.\n One thing the modern cluster architecture supports is nodediscovery. Now, you have the same cluster with 1000 nodes, you don&#39;thave to remember all the nodes IP addresses but just one node and thatone node also acts as a service discovery to other nodes. For example,if your application wants to talk to  node4 and you know only node1&#39;s IP address, you can either talk to  node1 as if you aretalking to  node4 which  node1 redirects the communication to node4 or you can ask  node1 for  node4&#39;s IP address.\n But one major problem is that if  node1 goes down for some reason,even though the cluster will still be working with the rest of the 999nodes or one new node with different IP address gets added up, youlose the access to the entire cluster because all you have got is node1&#39;s IP address and  node1 is currently not in the cluster. Forthis reason, we have a cluster IP address. What exists at the core ofthe cluster system is a node discovery service. Your applicationconnects to the cluster IP, and you don&#39;t have to worry about somenodes being down since the cluster IP is nowhere related to it andonly acts as a discovery tool for the nodes and other services in thecluster.\n And now, we are at it again. We now have to remember the IP address ofthe cluster. If it is IPv6, it&#39;s nearly impossible to remember theaddress. The cluster system lacks a human-readable name, i.e., itlacks a name server. If the cluster exists in a cloud system, youdon&#39;t have to worry about remembering since the external DNS comesinto the picture and you can set up a domain name.\n Most of the local systems don&#39;t have a name server. If you look up thenetwork to know what all systems are connected to the machine, you geta bunch of IP addresses. You have a local cluster, printer, mobilephones, laptops, IoT etc.\n Let us take the printer example. You are connected to 10 differentprinters, each one is of a different type. And if you need to print afile and you want to select a particular printer, and let&#39;s say youdon&#39;t the name of the printers but just the IP addresses. So what youhave to do is to look up a printer IP addresses table and take theright printer&#39;s IP address. Still, you are limited to type it out orcopy-paste the IP address. To solve this, most of the private networksappend  .local at the end of the machine&#39;s  hostname using the  zeroconftechnique. Now in the printer&#39;s example, if you look up the networkfor the connected printers, you get\n  Now you don&#39;t have to remember the IP address of the printer youwant. All you have to remember is a human-readable name.\n Same goes for the cluster too. You can reach your cluster at my-awesome-cluster.local. Even better, you can access to a  node1at  node1.my-awesome-cluster.local and  node4 at node4.my-awesome-cluster.local. If say  node1 goes down and if thecluster starts a new node with a different IP address to take up node1&#39;s position, the new node will be reachable at node1.my-awesome-cluster.local. This is called  FQDN.\n Earlier you used to connect to the cluster using the IP address of thecluster and it worked. Now when you tell your application to connectto the cluster using the  .local, it simply doesn&#39;t know how toconnect. The problem is that the application doesn&#39;t know how toresolve the  .local domain name to the cluster IP address. It lacks aDNS server. And since the cluster is a local one, your DNS servercan&#39;t resolve it.\n In the case of the cloud system, you would have set up a domain nameand you can reach the cluster using the domain name. And the externalDNS helps you to resolve the domain name to the cluster IP address.\n To solve this problem we have  mDNS. mDNS is a protocol that resolveshostname to IP addresses within a small network that lacks the nameserver. By default, mDNS exclusively resolves hostnames ending with .local. But there will be a problem with the hosts that implement .local doesn&#39;t support mDNS protocol and can be found via aconventional unicast DNS sever. In those cases, necessary networkconfiguration should be changed.\n RedisLabs has a Redis Enterprise docker  image that does manythings  1 but what we want here is theEnterprise cluster.\n The reason why I have chosen Redis Enterprise docker image is that italigns well with the previous cluster example. With Redis Enterprisecontainer, we can create a redis database cluster. And the clusterwill have a domain name with  .local (i.e., my-awesome-cluster.local) and each node in the cluster receives a FQDN (i.e.,  node1.my-awesome-cluster.local).\n To sum up the above paragraph, we get a cluster which has a &lt;my-cluster&gt;.local address and nodes with &lt;my-node&gt;.&lt;my-cluster&gt;.local.\n    Ports  8443 and  9443 should be exposed compulsorily for thecontainer to do all its magic for services.\n  ...more logs...2020-05-30 05:10:03,048 INFO success: mdns_server entered RUNNING state, process has stayed up for &gt; than 1 seconds (startsecs)...more logs...\n The port  12000 we have exposed can be any free port. This is theport where the database we create will be listening on. In the currentexample, I&#39;m creating just one node. But it can be many.\n  You don&#39;t have to edit anything and under &#34;Cluster configuration&#34; youcan give your cluster FQDN like this.\n  You can skip entering the certificates to which the container createsthe certificates with default options. And then you can set somecredentials the redis enterprise container requires you to. Once youset the credentials your page will be refreshed and you&#39;ll again betold to enter the credentials. Once you sign in, you are ready tocreate a database.\n You can select &#34;Redis&#34; as your database, and you&#39;ll be given a form toenter the configuration of the database.\n I&#39;m giving the name as  node1 and most importantly, you must set theport to  12000 since that&#39;s the only port that we have exposed. Clickon &#34;show advanced options&#34; and you can find the field &#34;Endpoint portnumber&#34; where you can enter the port. Enter it as  12000 (sincethat&#39;s the port I have exposed). Click &#34;Activate&#34; to create thedatabase. You&#39;ll then be redirected to your created DB&#39;s configurationpage.\n  You can find the  .local address and IP address of the DB in the Endpoint field.\n Let us now create our sample application that simply connects to node1 and pings the database.\n  We have taken the python  buster image which is Debian 10 that hasthe mdns packages which we will install later.\n  $ docker build -t py-mdns .Sending build context to Docker daemon 3.072kBStep 1/3 : FROM python:3.8-buster3.8-buster: Pulling from library/python376057ac6fa1: Pull complete 5a63a0a859d8: Pull complete 496548a8c952: Pull complete 2adae3950d4d: Pull complete 0ed5a9824906: Pull complete bb94ffe72389: Pull complete 241ada007777: Pull complete be68aa7d1eeb: Pull complete 820ffc2e28ca: Pull complete Digest: sha256:ebe8df5c3e2e10a7aab04f478226979e3b8754ee6cd30358379b393ef8b5321eStatus: Downloaded newer image for python:3.8-buster ---&gt; 659f826fabf4Step 2/3 : RUN pip3 install redis ---&gt; Running in 1d31f5312e3eCollecting redis Downloading redis-3.5.2-py2.py3-none-any.whl (71 kB)Installing collected packages: redisSuccessfully installed redis-3.5.2Removing intermediate container 1d31f5312e3e ---&gt; c21a8bc34782Step 3/3 : CMD [&#34;python3&#34;] ---&gt; Running in 711a17a97211Removing intermediate container 711a17a97211 ---&gt; 27b0d68b69fcSuccessfully built 27b0d68b69fcSuccessfully tagged py-mdns:latest$ docker run --it py-mdns\n   Remember that the  .local address of  node1 is redis-12000.mycluster.local, IP address is  172.17.0.2 and the portis  12000.\n  $ docker run -it py-mdnsPython 3.8.3 (default, May 16 2020, 07:08:28) [GCC 8.3.0] on linuxType  &#34;help&#34;,  &#34;copyright&#34;,  &#34;credits&#34; or  &#34;license&#34; for more information.&gt;&gt;&gt; import redis&gt;&gt;&gt; redis.Redis( host= &#39;redis-12000.mycluster.local&#39;,  port=12000).ping() Traceback (most recent call last): File  &#34;/usr/local/lib/python3.8/site-packages/redis/connection.py&#34;, line 550,  in connect sock = self._connect() File  &#34;/usr/local/lib/python3.8/site-packages/redis/connection.py&#34;, line 575,  in _connect  for res  in socket.getaddrinfo(self.host, self.port, self.socket_type, File  &#34;/usr/local/lib/python3.8/socket.py&#34;, line 918,  in getaddrinfo  for res  in _socket.getaddrinfo(host, port, family, type, proto, flags):socket.gaierror: [Errno -2] Name or service not knownDuring handling of the above exception, another exception occurred: Traceback (most recent call last): File  &#34;&lt;stdin&gt;&#34;, line 1,  in &lt;module&gt; File  &#34;/usr/local/lib/python3.8/site-packages/redis/client.py&#34;, line 1378,  in ping  return self.execute_command( &#39;PING&#39;) File  &#34;/usr/local/lib/python3.8/site-packages/redis/client.py&#34;, line 898,  in execute_command conn = self.connection or pool.get_connection(command_name, **options) File  &#34;/usr/local/lib/python3.8/site-packages/redis/connection.py&#34;, line 1183,  in get_connection connection.connect() File  &#34;/usr/local/lib/python3.8/site-packages/redis/connection.py&#34;, line 554,  in connect raise ConnectionError(self._error_message(e))redis.exceptions.ConnectionError: Error -2 connecting to redis-12000.mycluster.local:12000. Name or service not known.\n What happened is that your application lacks an mDNS service discoverysuch that it doesn&#39;t know whom to ask and how to resolve the  .localhostname to IP address.\n libnss by default can resolve up to two-label such that it canresolve the IP address of  mycluster.local but what we need isthree-label. Let&#39;s try to configure add that configuration too.\n RUN set -ex  \\ &amp;&amp; apt-get update &amp;&amp; apt-get install -y --no-install-recommends avahi-daemon libnss-mdns  \\  #  allow hostnames with more labels to be resolved. so that we can  #  resolve node1.mycluster.local.  #  (https://github.com/lathiat/nss-mdns#etcmdnsallow) &amp;&amp;  echo  &#39;*&#39; &gt; /etc/mdns.allow  \\  #  Configure NSSwitch to use the mdns4 plugin so mdns.allow is respected &amp;&amp; sed -i  &#34;s/hosts:.*/hosts: files mdns4 dns/g&#34; /etc/nsswitch.conf\n Now, we have the configuration, we can start the  avahi-daemon whenour container start using the  ENTRYPOINT script. Here&#39;s theentrypoint script.\n  This starts  dbus which is a dependency of  avahi-daemon. Now this ishow the  Dockerfile looks like.\n FROM  python:3.8-buster WORKDIR /app COPY entrypoint.sh /app/ RUN set -ex  \\ &amp;&amp; apt-get update &amp;&amp; apt-get install -y --no-install-recommends avahi-daemon libnss-mdns  \\  #  allow hostnames with more labels to be resolved. so that we can  #  resolve node1.mycluster.local.  #  (https://github.com/lathiat/nss-mdns#etcmdnsallow) &amp;&amp;  echo  &#39;*&#39; &gt; /etc/mdns.allow  \\  #  Configure NSSwitch to use the mdns4 plugin so mdns.allow is respected &amp;&amp; sed -i  &#34;s/hosts:.*/hosts: files mdns4 dns/g&#34; /etc/nsswitch.conf  \\ &amp;&amp; pip3 install redis ENTRYPOINT [ &#34;bash&#34;,  &#34;./entrypoint.sh&#34;] CMD [ &#34;python3&#34;]\n  $ docker run -it py-mdns[ ok ] Starting system message bus: dbus.[ ok ] Starting Avahi mDNS/DNS-SD Daemon: avahi-daemon.Python 3.8.3 (default, May 16 2020, 07:08:28) [GCC 8.3.0] on linuxType  &#34;help&#34;,  &#34;copyright&#34;,  &#34;credits&#34; or  &#34;license&#34; for more information.&gt;&gt;&gt; import redis&gt;&gt;&gt; redis.Redis( host= &#39;redis-12000.mycluster.local&#39;,  port=12000).ping()True\n Now let&#39;s talk about thesecurity.  2 Many containerplatforms accept only non-root containers, Ex: openshift. If you wantyour application to be deployed at any container platform, youcan&#39;t. Let us try to run the container as a non-root user.\n $ docker run -it --user 1001 py-mdnsmkdir: cannot create directory ‘/var/run/dbus’: Permission denied\n The user argument takes a user UUID. It says to run as any other userrather than root. `1001` is not a special user. It might just bewhatever UUID that doesn&#39;t match an existing user in the image. Youcan also put  USER command inside the  Dockefile.\n It requires root permission to start the application. You can checkthe same by connecting to the container.\n $ docker exec -it a701fb0d30e2 bashroot@a701fb0d30e2:/app# ps -auxUSER PID %CPU %MEM VSZ RSS TTY STAT START TIME COMMANDroot 1 0.8 0.0 13340 8276 pts/0 Ss+ 06:27 0:00 python3message+ 19 0.0 0.0 8552 2368 ? Ss 06:27 0:00 /usr/bin/dbus-daemon --systemavahi 46 0.0 0.0 7868 2564 ? S 06:27 0:00 avahi-daemon: running [a701fb0d30e2.local]avahi 47 0.0 0.0 7868 296 ? S 06:27 0:00 avahi-daemon: chroot helperroot 71 7.0 0.0 5748 3636 pts/1 Ss 06:27 0:00 bashroot 76 0.0 0.0 9388 3092 pts/1 R+ 06:27 0:00 ps -auxroot@a701fb0d30e2:/app#\n The reason why the application can&#39;t start as a non-root user is that dbus,  avahi&#39;s dependency, requires root permissions to start.\n There&#39;s a way to run  avahi without  dbus by adding  enable-dbus=noto the  [server] section of  avahi-daemon.conf file. The file existsin  /etc/avahi/avahi-daemon.conf.\n avahi by default requires root permissions to start. We can bypassthat by providing  --no-drop-rootflag.  3 You can check out all the options here. Let us remove  dbus. Also, let&#39;s start the process manuallywithout using  service.\n  # Dockerfile  &amp;&amp; sed -i &#34;s/hosts:.*/hosts: files mdns4 dns/g&#34; /etc/nsswitch.conf \\ +  &amp;&amp; printf &#34;[server]\\nenable-dbus=no\\n&#34; &gt;&gt; /etc/avahi/avahi-daemon.conf \\ &amp;&amp; pip3 install redis\n  # entrypoint.sh -  # start avahi&#39;s dependency -  service dbus start  # start avahi -  service avahi-daemon start +  avahi-daemon --daemonize --no-drop-root\n  $ docker run -it --user 1001 py-mdns bashTimeout reached while wating for return valueCould not receive return value from daemon process.\n And the container exits. We still can&#39;t run the container asnon-root. The actual problem is with the files and folders the avahi-daemon is accessing. These files should have either  root or avahi permissions to access it.\n    # Dockerfile  &amp;&amp; printf &#34;[server]\\nenable-dbus=no\\n&#34; &gt;&gt; /etc/avahi/avahi-daemon.conf \\ +  &amp;&amp; chmod 777 /etc/avahi/avahi-daemon.conf \\ +  &amp;&amp; mkdir -p /var/run/avahi-daemon \\ +  &amp;&amp; chown avahi:avahi /var/run/avahi-daemon \\ +  &amp;&amp; chmod 777 /var/run/avahi-daemon &amp;&amp; pip3 install redis\n We change the permissions of the file  /etc/avahi-daemon.conf so thatthe  avahi daemon can access the file. We also create /var/run/avahi-daemon directory since the  avahi daemon requiresit. We also change the permissions of them after creating. Lets alsoadd  USER flag so by default it runs as the UUID specified.\n  FROM  python:3.8-buster WORKDIR /app COPY entrypoint.sh /app/ RUN set -ex  \\ &amp;&amp; apt-get update &amp;&amp; apt-get install -y --no-install-recommends avahi-daemon libnss-mdns  \\  #  allow hostnames with more labels to be resolved. so that we can  #  resolve node1.mycluster.local.  #  (https://github.com/lathiat/nss-mdns#etcmdnsallow) &amp;&amp;  echo  &#39;*&#39; &gt; /etc/mdns.allow  \\  #  Configure NSSwitch to use the mdns4 plugin so mdns.allow is respected &amp;&amp; sed -i  &#34;s/hosts:.*/hosts: files mdns4 dns/g&#34; /etc/nsswitch.conf  \\ &amp;&amp;  printf  &#34;[server]\\nenable-dbus=no\\n&#34; &gt;&gt; /etc/avahi/avahi-daemon.conf  \\ &amp;&amp; chmod 777 /etc/avahi/avahi-daemon.conf  \\ &amp;&amp; mkdir -p /var/run/avahi-daemon  \\ &amp;&amp; chown avahi:avahi /var/run/avahi-daemon  \\ &amp;&amp; chmod 777 /var/run/avahi-daemon  \\ &amp;&amp; pip3 install redis USER 1001 ENTRYPOINT [ &#34;bash&#34;,  &#34;./entrypoint.sh&#34;] CMD [ &#34;python3&#34;]\n   Now lets start the container. Now we don&#39;t have to pass  --user flagsince we have put  USER command inside  Dockerfile.\n $ docker run -it --user 1001 py-mdnsPython 3.8.3 (default, May 16 2020, 07:08:28) [GCC 8.3.0] on linuxType  &#34;help&#34;,  &#34;copyright&#34;,  &#34;credits&#34; or  &#34;license&#34; for more information.&gt;&gt;&gt; import redis&gt;&gt;&gt; redis.Redis( host= &#39;redis-12000.mycluster.local&#39;,  port=12000).ping()True\n  $ docker exec -it c641eeb8559f bashI have no name!@c641eeb8559f:/app$ ps -auxUSER PID %CPU %MEM VSZ RSS TTY STAT START TIME COMMAND1001 1 0.4 0.0 27248 16220 pts/0 Ss+ 08:22 0:00 python31001 8 0.0 0.0 8012 2524 ? S 08:22 0:00 avahi-daemon: running [c641eeb8559f.local]1001 10 11.0 0.0 5748 3612 pts/1 Ss 08:23 0:00 bash1001 15 0.0 0.0 9388 3072 pts/1 R+ 08:23 0:00 ps -aux\n We have reached the end of the post. You can find the code samples inthis  repository.\n 1  Redis Enterprise Software is enterprise grade,distributed, in-memory NoSQL database server, fully compatible withopen source Redis by Redis Labs.\n  3  avahi-daemon.conf has manyconfigurations and we don&#39;t need it in our application, so I&#39;m justsetting the  enable-dbus to  no.", "posttime": "2020-06-02 02:33:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker,avahi,redis", "title": "MDNS、Avahi和Docker非根容器", "title_en": "MDNS, avahi and Docker non-root containers", "transed": 1, "url": "https://gnaneshkunal.github.io/avahi-docker-non-root.html", "via": "", "real_tags": ["docker", "avahi", "redis"]}, {"category": "", "categoryclass": "", "imagename": "62b7bb36b176aa66d66859238e80ee08.gif", "infoid": 1004708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月初，我在我们的编辑中写了一篇关于网格渲染的文章。在我们进入今天的主题之前，我想展示一下我自上一篇文章以来添加的网格渲染的一个小功能，即在启用捕捉的情况下渲染对象局部网格，以指导对象的移动：\n我认为结果相当不错，感觉像是一个很好的例子，说明了Mechanical的模块化在实践中是如何工作的-只需查询对tm_grid_renender_api的访问，并添加您的插件可能需要的任何网格渲染。\n不管怎样，我们继续吧。在今天的帖子中，我们将讨论如何挑选老鼠。\n当用户在视口内单击时，所有类型的3D编辑器都需要某种方法来确定鼠标指针下碰巧出现的任何对象的对象标识。我会把这个过程称为“挑选”。\n拾取，就像网格渲染一样，通常被认为是图形程序员关心的或者不重要的问题之一。相反，有些工具程序员往往会以这样或那样的方式提出解决方案。通常，通过鼠标指针将某种形式的光线从视口摄影机的位置投射到摄影机的近平面上。\n整个情况，渲染和工具人员之间截然不同的竖井，渲染程序员的首要态度，以及两个最常见的问题解决方案，在很多方面都很糟糕，让我想哭。\n例如，当您需要拾取不具有形而上学表示的对象时，物理系统就会崩溃，并且通常在视口中渲染的许多对象不需要形而上学表示。一种常见的用户解决方法是开始添加物理表示，仅仅是为了使编辑器中的内容可拾取。不理想的…。\n另一方面，实现仅用于编辑拾取的特定光线投射系统可能需要大量的工作。当然，该实现不一定是世界上最快的，因为您通常每帧(或更少)只投射一条光线，但是，您肯定需要某种加速结构(如BVH-tree)，因为您肯定希望拾取实际渲染的三角形，而不是某个代理。这种结构既会消耗内存，又要花一些时间来烹饪，一旦您开始处理包含大量对象(&gt；10K)的稍微复杂的场景，您可能就需要添加另一个级别的加速结构。(&lt;##**$$}{##**$$})\n更不用说，这两种方法都不太可能处理对可变形对象(如蒙皮角色)的拾取，或对Alpha蒙版对象(例如，树上树叶之间的对象)的拾取，或处理纯粹基于体素的对象，或任何类型的“纳米”解决方案。\n很明显，这不是你想要的。即使在CPU上实现一个像样的解决方案是可行的，您真正想要的是一个基于GPU的拣选解决方案。您想知道鼠标光标下的像素的身份，而不是某个看不见的代理的身份。当您使用处理所有类型的几何体变形和曲面类型的象素完美解决方案时，您将永远不会再接受任何不太精确的解决方案。\n具有讽刺意味的是，实现基于GPU的拣选解决方案的基础实际上非常简单，比您能想到的任何基于CPU的拣选解决方案都容易得多。那么让我们来看看我们在“机械”中的实现。\n首先，我们的解决方案依赖于几个前提条件，所以让我们把它们去掉，因为我不会在这篇文章中更详细地介绍它们：\n首先，我们依赖于我们的着色器系统能够有效地为视口中所有绘制的对象选择不同的着色器变体。我们使用本文描述的“系统”概念来处理这个问题。\n其次，我们始终依赖于支持将无序访问视图(UAV)绑定到像素着色器的硬件。\n所以这个想法很简单。当用户在视口内单击时，我们将激活一个名为Pick_System的特殊着色器系统。这意味着实现对Pick_System支持的任何着色器将在用于在屏幕上渲染对象的像素(或计算)着色器中激活略有不同的代码路径。\n激活的着色器变体添加了对在PICKING_SYSTEM中定义的UPDATE_PICKING_BUFFER()的调用。实际的拾取缓冲区与一个12字节的缓冲区一样愚蠢，绑定为auav，包装了一个简单的结构：\n//`pos`应为SV_Position.xy(或CS类似的文字)。/`Identity`为渲染对象的唯一标识。在TM中，这通常是发布GPU工作的实体的ID。/`z`是着色点的Z深度值。/`opacity`是当前着色像素的不透明度值。void update_Pick_Buffers(uint2位置，uint2身份，浮动z，浮动不透明度){//如果像素的不透明度小于&#34；不透明度拾取阈值&#34；//--返回。if(opacity&lt；load_opacity_Threshold())返回；//如果该像素不在鼠标光标下--返回。uint2 CURSOR_POS=LOAD_CURSOR_POS()；IF(pos.x！=Cursor_pos.x||pos.y！=Cursor_pos.y)return；//将像素z与//PICKING_BUFFER中当前存储的z值进行比较。如果它大于或等于(后面)--返回。uint d=asuint(Z)；if(d&gt；=Pick_Buffer.Load(0))return；//更新拣货缓冲区。PICKING_Buffer.Store3(0，uint3(d，身份))；}。\n虽然这种幼稚的实现在大多数情况下会产生正确的拾取结果，但它有时会失败，并返回最近曲面后面的拾取结果。这是因为我们需要防止并发访问PICKING_BUFFER。\n我们可以结合使用原子和利用d的符号位来实现自旋锁定机制，以防止对PICKING_BUFFER进行并发更新。该实现是一个bithair，但看起来如下所示：\nuint d=asuint(Z)；uint current_d_or_lock=0；do{//`z`在存储的z值后面，立即返回。if(d&gt；=PickingBuffer.Load(0))返回；//执行原子min。`current_d_or_locked`保存当前存储的//值。PICKING_Buffer.InterlockedMin(0，d，CURRENT_d_OR_LOCKED)；//我们依靠符号位来指示拣选缓冲区是否//当前被锁定。这意味着只有当//缓冲区解锁并且`d`小于当前存储的`d`时，才会进入此分支。if(d&lt；(Int)current_d_or_lock){uint last_d=0；//尝试通过设置符号位获取写锁定。PICKING_Buffer.InterlockedCompareExchange(0，d，asuint(-(Int)d)，last_d)；//只有写锁成功才会执行此分支。if(last_d==d){//更新对象标识。PICKING_Buffer.Store2(4，Identity)；uint虚拟；//释放写锁。Pick_Buffer.InterlockedExchange(0，d，ummy)；}}//旋转直到释放写锁定。}While((Int)Current_d_or_Locked&lt；0)；\n自旋锁定更新到位后，您应该始终在拾取缓冲区中获得最近的曲面。\n这就是着色器方面的内容，现在让我们转到CPU端，看看我们为调度和将PICKING_BUFFER的结果从GPU读回CPU而准备的C-API。它名为tm_gpu_Pick_api，如下所示：\nstruct tm_GPU_PICKING_API{struct tm_GPU_PICKING_O*(*CREATE)(struct tm_allocator_i*allocator，struct tm_renender_resource_command_buffer_o*res_buf，struct tm_shader_system_o*Pick_system，struct tm_shader_o*clear_Pick_Buffer_shader)；void(*DESTORY)(structm_gpu_Pick_o*。bool(*update_cpu)(struct tm_GPU_PICKING_o*inst，struct tm_renender_backend_i*rb，bool activate_system，const tm_ve2_t Cursor_position，Float Opacity_Threshold，uint64_t*result)；void(*update_GPU)(struct tm_GPU_Pick_o*inst，struct tm_shader_system_context_o*context，struct tm_renent。}；\nCreate()和Destroy()只负责创建和销毁拾取对象。每个支持拾取的视口都有自己的tm_GPU_PICKING_O。在内部，tm_GPU_PICKING_O拥有PICKING_BUFFER和一些状态。\n检查是否有新的回读结果可用于PICKING_BUFFER。如果是，则在RESULT中返回PICKING_BUFFER的标识部分，并且函数返回TRUE。机械中的ObjectSelection跟踪是基于实体ID的，因此我们可以简单地将实体ID作为常量缓冲区的一部分传递给所有绘制和调度调用，这意味着可以直接使用返回的ValueIn结果，而无需任何额外的查找。\n如果用户在视口内的某个地方单击了鼠标按钮，则应将true与光标位置和任意不透明度阈值一起传递给activate_system。这将准备将通过常量缓冲区传递给PICKING_SYSTEM的状态，并将其排队以供激活。不透明度阈值控制应在哪个曲面不透明度值处单击(即，拒绝)像素。我有计划在编辑器中公开对不透明阈值的控制，但还没有抽出时间，现在我们只通过了0.5，这感觉像是一个像样的默认值。任何不透明度小于0.5的像素都将被单击。\n每当我们要渲染视口时，都会调用update_gpu()。它执行以下操作：\n如果在最后一次调用update_cpu()时没有激活PICKING_SYSTEM，它会立即旋转。\n将计算调度调用排队以清除PICKING_BUFFER，该调用计划在视口中发生任何其他渲染之前执行。\n使用传递给update_cpu()的鼠标光标位置和不透明度阈值更新与PICKING_SYSTEM关联的常量缓冲区。\n将PICKING_BUFFER的异步读回操作从GPU排队到CPU，计划在视口中所有渲染完成后运行。\n由于我们不希望在回读PICKING_BUFFER的过程中使GPU停滞，因此它可能需要几个帧，直到结果可用并且从update_cpu()返回true。但在实践中，从用户的角度来看，这种延迟并不明显。\n使用基于GPU的拾取解决方案，您再也不必在CPU端纠结复杂的拾取代码，只要着色器实现了不超过几行代码的PICKING_SYSTEM，屏幕上可视化的任何东西都可以拾取。\n还要注意的是，虽然上面的代码示例只涵盖像素完美的选择，但没有什么能阻止您将其扩展为执行更多的模糊选择，只需计算光标与当前像素之间的距离并接受小于n像素的距离值。这在处理编辑器小工具和类似工具的选择时会很有用。", "note_en": "In early March I wrote a  post about the rendering ofgrids in our editor.Before we dive into today’s topic, I wanted to show off a trivial addition to the grid rendering I’veadded since the last post, rendering of an object local grid to guide moving of objects whensnapping is enabled:\n   I think it turned out quite nice and it feels like a good example of how well the modularity aspectsof The Machinery work in practice — just query access to the  tm_grid_renderer_api and add whatevergrid rendering your plugin might need.\n Anyway, let’s move on. In today’s post, we’ll talk about mouse picking.\n  All types of 3D-editors tend to need some way to determine the object identity of whatever objectthat happens to be under the mouse pointer when the user clicks inside a viewport. I’ll be referringto this process as “picking”.\n Picking, just like grid rendering, is one of those problems that typically are considered tooboring, or unimportant, for graphics programmers to even care about. Instead, it tends to end up inthe lap of some tools programmer to come up with a solution in one way or another. Usually, by doingsome form of ray cast from the position of the viewport camera through the mouse pointer coordinateprojected on the camera’s near plane.\n   The whole situation with distinct silos between rendering and tools folks, the prima donna attitudeamong rendering programmers, and the two most common solutions to the problem are bad in so manyways it makes me wanna cry.\n Relying on e.g. the physics system will break as soon as you need to pick stuff that doesn’t have aphysics representation, and there are typically lots of objects rendered in a viewport that don’tneed one. A common user workaround is to start adding physics representations just for the sake ofmaking stuff pickable in the editor. Not ideal…\n On the other hand, implementing a specific ray casting system only used for doing editor picking canbe a significant amount of work. Sure, the implementation doesn’t have to be the fastest in theworld since you will typically only be casting a single ray per frame (or less), but still, you’lldefinitely need some kind of acceleration structure (like a BVH-tree) as you definitely want to pickagainst the actual rendered triangles and not some proxy. That structure will consume both memoryand take some time to cook, and as soon as you start dealing with somewhat more complicated sceneswith lots of objects (&gt;10K) you’ll probably need to add another level of acceleration structure.\n Not to mention the fact that neither of these approaches will likely handle picking againstdeformable objects (like skinned characters), or picking through alpha masked objects (e.g.in-between the leaves on a tree), or handle purely voxel-based objects, or any kind of “Nanite”-solution.\n Clearly, this is not what you want. Even if it’s doable to implement a decent solution on the CPU,what you really want is a GPU based picking solution. You want to know the identity of the pixelunder the mouse cursor, not the identity of some invisible proxy. The second you’ve worked with apixel-perfect solution that handles all kinds of geometry deformations and surface types, you willnever again be okay with anything that’s less accurate.\n Ironically, implementing the foundations of a GPU-based picking solution is really straight forward,much easier than any CPU-based picking solution you can think of. So let’s take a look at theimplementation we have in The Machinery.\n  First of all, our solution relies on a few prerequisites, so let’s get them out of the way as Iwon’t cover them in more detail in this post:\n First of all, we rely on our shader system being able to efficiently select a different shadervariation for all drawn objects in the viewport. We handle this using the “Systems”-conceptdescribed in  this post.\n Secondly, we rely on always running on hardware that supports binding Unordered Access Views(UAVs) to the pixel shader.\n So the idea is very simple. When the user clicks inside a viewport, we activate a special shadersystem called  picking_system. That means that any shader that implements support for the picking_system will activate a slightly different code path in the pixel (or compute) shader usedfor rendering the object on screen.\n The activated shader variation adds a call to  update_picking_buffer() which is defined in the picking_system. The actual picking buffer is something as silly as a 12 bytes buffer, bound as aUAV, wrapping a simple struct:\n   // `pos` should be SV_Position.xy (or comparable writing from a CS).//// `identity` is a unique identifier of the rendered object. In TM this is// typically the ID of the entity issuing the GPU work.// // `z` is the Z depth value of the shaded point.//// `opacity` is the opacity value of the currenly shaded pixel. void update_picking_buffers(uint2 pos, uint2 identity, float z, float opacity) { // If the opacity of the pixel is less than the &#34;opacity picking threshold&#34; // -- return. if (opacity &lt; load_opacity_threshold()) return; // If this pixel is not under the mouse cursor -- return. uint2 cursor_pos = load_cursor_pos(); if (pos.x != cursor_pos.x || pos.y != cursor_pos.y) return; // Compare pixel z against the currently stored z-value in the // picking_buffer. If it&#39;s greater or equal (behind) -- return. uint d = asuint(z); if (d &gt;= picking_buffer.Load(0)) return; // Update picking buffer. picking_buffer.Store3(0, uint3(d, identity));}\n While this naive implementation will produce the correct picking result most of the time, it willoccasionally fail and return a picking result that is behind the closest surface. This is because weneed to protect against concurrent access to the  picking_buffer.\n We can use atomics together with exploiting the sign bit of  d to implement a spinlock mechanismthat prevents concurrent updates to the  picking_buffer from happening. The implementation is a bithairy, but looks something like this:\n uint d = asuint(z);uint current_d_or_locked = 0;do { // `z` is behind the stored z value, return immediately. if (d &gt;= picking_buffer.Load(0)) return; // Perform an atomic min. `current_d_or_locked` holds the currently stored // value. picking_buffer.InterlockedMin(0, d, current_d_or_locked); // We rely on using the sign bit to indicate if the picking buffer is // currently locked. This means that this branch will only be entered if the // buffer is unlocked AND `d` is the less than the currently stored `d`. if (d &lt; (int)current_d_or_locked) { uint last_d = 0; // Attempt to acquire write lock by setting the sign bit. picking_buffer.InterlockedCompareExchange(0, d, asuint(-(int)d), last_d); // This branch will only be taken if taking the write lock succeded. if (last_d == d) { // Update the object identity. picking_buffer.Store2(4, identity); uint dummy; // Release write lock. picking_buffer.InterlockedExchange(0, d, dummy); } }// Spin until write lock has been released.} while((int)current_d_or_locked &lt; 0);\n With the spinlock-update in place, you should always be getting the closest surface in the pickingbuffer.\n So that’s it on the shader side of things, now let’s move over to the CPU side and take a look atthe C-API we have in place for scheduling and reading back the result of the  picking_buffer fromthe GPU to the CPU. It’s called  tm_gpu_picking_api and looks like this:\n struct tm_gpu_picking_api{ struct tm_gpu_picking_o *(*create)(struct tm_allocator_i *allocator, struct tm_renderer_resource_command_buffer_o *res_buf, struct tm_shader_system_o *picking_system, struct tm_shader_o *clear_picking_buffer_shader); void (*destroy)(struct tm_gpu_picking_o *inst, struct tm_renderer_resource_command_buffer_o *res_buf); bool (*update_cpu)(struct tm_gpu_picking_o *inst, struct tm_renderer_backend_i *rb, bool activate_system, const tm_vec2_t cursor_position, float opacity_threshold, uint64_t *result); void (*update_gpu)(struct tm_gpu_picking_o *inst, struct tm_shader_system_context_o *context, struct tm_renderer_resource_command_buffer_o *res_buf, struct tm_renderer_command_buffer_o *cmd_buf, uint32_t device_affinity_mask);};\n create() and  destroy() are simply responsible for creating and destroying a picking object. Eachviewport that supports picking has its own  tm_gpu_picking_o. Internally,  tm_gpu_picking_o ownsthe  picking_buffer and some state.\n  Checks if there’s a new read-back result available for the  picking_buffer. If so the  identitypart of the  picking_buffer is returned in  result and the function returns  true. Objectselection tracking in The Machinery is based on the entity ID so we can simply pass the entity IDas part of a constant buffer to all draw and dispatch calls which means that the returned valuein  result can be used directly without any additional lookup.\n If the user clicked the mouse button somewhere inside a viewport,  true should be passed to activate_system together with the cursor position and an arbitrary opacity threshold. Thisprepares the state that will be passed to the  picking_system through a constant buffer andqueues it for activation. The opacity threshold controls at which surface opacity value a pixelshould be clicked-through (i.e., rejected). I have plans exposing control over the opacitythreshold in the editor but haven’t got around to it, right now we only pass 0.5 which feels likea decent default value. Any pixel with opacity less than 0.5 will be clicked through.\n update_gpu() is called whenever we’re about to render a viewport. It does the following:\n If the  picking_system wasn’t activated when the last call to  update_cpu() was made, it justreturns immediately.\n Queues a compute dispatch call to clear the  picking_buffer, scheduled to execute before anyother rendering happens in the viewport.\n Updates the constant buffer associated with the  picking_system with the mouse cursor positionand opacity threshold passed to  update_cpu().\n Queues an asynchronous read-back operation of the  picking_buffer from the GPU to CPU, scheduledto run after all rendering has finished in the viewport.\n As we don’t want to stall the GPU with the read-back of the  picking_buffer, it can take a fewframes until the result is available and  true is returned from  update_cpu(). In practice though,this delay hasn’t been noticeable from a user’s perspective.\n    With a GPU-based picking solution you’ll never again have to struggle with complicated picking codeon the CPU-side, anything that’s visualized on screen can be picked as long as the shader implementsthe  picking_system which isn’t more than a couple of lines of code.\n Also note that while the code examples from above only cover pixel-perfect selection, there’snothing preventing you from extending it to do more of a fuzzy selection, just calculating thedistance between the cursor and the current pixel and accept a distance value less than  n pixels.This can be useful when dealing with selection of editor gizmos and similar.", "posttime": "2020-06-02 02:32:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "渲染,rendering,对象", "title": "渲染和编辑器之间的边界-第2部分：拾取", "title_en": "Borderland Between Rendering and Editor – Part 2: Picking", "transed": 1, "url": "https://ourmachinery.com/post/borderland-part-2-picking/", "via": "", "real_tags": ["渲染", "rendering", "对象"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了保护我们的客户，苹果不会披露、讨论或确认安全问题，直到调查已经发生，补丁或版本可用。最近发布的版本列在苹果安全更新主页上。\n适用于：iPhone 6s及更高版本、iPad Air 2及更高版本、iPad mini 4及更高版本以及iPod touch 7代。\n关于非由苹果公司生产的产品的信息，或未被苹果公司控制或测试的独立网站的信息，是在没有推荐或认可的情况下提供的。对于第三方网站或产品的选择、性能或使用，苹果不承担任何责任。对于第三方网站的准确性和可靠性，苹果没有提出任何声明。有关其他信息，请与供应商联系。", "note_en": "For our customers&#39; protection, Apple doesn&#39;t disclose, discuss, or confirm security issues until an investigation has occurred and patches or releases are available. Recent releases are listed on the  Apple security updates page.\n    Available for: iPhone 6s and later, iPad Air 2 and later, iPad mini 4 and later, and iPod touch 7th generation\n  Information about products not manufactured by Apple, or independent websites not controlled or tested by Apple, is provided without recommendation or endorsement. Apple assumes no responsibility with regard to the selection, performance, or use of third-party websites or products. Apple makes no representations regarding third-party website accuracy or reliability.  Contact the vendor for additional information.", "posttime": "2020-06-02 02:32:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,苹果,app,apple,补丁", "title": "苹果补丁CVE-2020-9859(Un0ver)", "title_en": "Apple patches CVE-2020-9859 (unc0ver)", "transed": 1, "url": "https://support.apple.com/en-us/HT211214", "via": "", "real_tags": ["2020", "苹果", "app", "apple", "补丁"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你们中的许多人一直在问我，什么时候我会出版Debian Handbook…的更新版。最后一个合适的发行版可以追溯到Debian 8 Jessie！\n是的，我完全跳过了Debian 9，我不希望这种情况再次发生，所以我雇了两个外部贡献者来更新Debian 10的图书(谢谢Daniel Leidert和Jorge Maldonado Ventura)。\n内容在git中已经准备好一段时间了，但我有太多的其他职责，以至于我从来没有发布过合适的版本。我想自己复习所有的东西，但是我没能做到这一点。与其总是拖延到我找到所需的时间，我发现更好的做法是发布我们现在拥有的东西，让社区发挥它的魔力(包括翻译人员将审查他们必须翻译的内容！)。\n所以你来了。您可以获得Debian 10的Debian手册。如果您发现问题，请报告(最好是在salsa.debian.org上)。\n目前还没有平装本。lulu.com上的印刷版仍然是Debian 8版本。我会在接下来的几周里试着解决这个问题。", "note_en": "Many of you have been asking me when I will publish an updated version of the Debian Handbook… the last proper release dates back to Debian 8 Jessie !\n Yes I entirely skipped Debian 9. I didn’t want this to happen again so I hired two external contributors to update the book for Debian 10 (thank you Daniel Leidert and Jorge Maldonado Ventura).\n The content has been ready for a while in git but I’m so swamped with other duties that I never put out a proper release. I wanted to review everything myself but I failed at doing this. And instead of always postponing until I find the required time, I figured out it would be better just to release what we have right now and let the community do its magic (including translators that will review what they have to translate!).\n So here you are. You can get the  Debian Handbook for Debian 10. If you find out issues, please  report them (on salsa.debian.org preferably).\n There’s no paperback version yet. The print version on lulu.com is still the Debian 8 version. I will try to fix this in the coming weeks.", "posttime": "2020-06-02 02:32:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "debian", "title": "Debian 10 Buster的Debian手册，现已上线", "title_en": "Debian Handbook for Debian 10 Buster, now live", "transed": 1, "url": "https://debian-handbook.info/2020/debian-handbook-for-debian-10-buster-now-live/", "via": "", "real_tags": ["debian"]}, {"category": "", "categoryclass": "", "imagename": "30a38111f3ea43e01a491ef8facfcb46.jpg", "infoid": 1004705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周末，SpaceX公司的猎鹰9号火箭成功地将机组人员“龙”飞船和机上的两名宇航员从佛罗里达安全送入太空，这场发射令人惊叹，令人敬畏，坦率地说，看起来真的很酷。在这个廉价的微型高清摄像头和流媒体内容的时代，如果你错过了它，或者即使你只是想再看一遍来娱乐，也应该很容易赶上它。但在周末的大部分时间里，直到今天早上，你根本看不到它，这要归功于版权内容ID机器人的加班工作。\n5月30日的发射在NASA的YouTube频道进行了现场直播，然后进行了存档，并附上了几个较短的视频片段和从为期一天的直播中提取的亮点。NASA的镜头，就像来自其他政府机构的照片和视频一样，通常发布到公共领域，而不是受版权保护，其他实体可以对其进行镜像或转播。国家地理杂志也报道了这次发射，它的镜头包含了美国国家航空航天局的一些内容。然后事情变得很愚蠢。\nTwitter用户发现，到周日，由于国家地理的版权主张，NASA的档案视频不再可以观看。当时试图播放美国国家航空航天局的一些视频时，出现了一条错误消息：视频不可用：此视频包含来自国家地理杂志的内容，国家地理以版权为由已将其屏蔽。\n美国国家航空航天局(NASA)周日介入，并敦促这些公司解决问题。NASA通讯总监Bettina Inclán周日晚间在推特上说，在过去的几天里，我们NASA的团队一直在与YouTube保持联系，YouTube加剧了这一问题。&#34；我们也一直在与NatGeo联系，该公司致力于发布演示-2保险的索赔。&#34；\n最后，YouTube、NASA和国家地理似乎解决了他们的问题。到美国东部时间今天上午9：30，视频已经恢复并可以播放，您可以再次尽情观看发射仪式。\n然而，与周六的发布不同的是，这一内容ID声明并不是历史性的第一次，而是一种熟悉的模式的一部分。几乎就是这个问题发生在2012年，当时其他企业-在那个案例中，是斯克里普斯广播公司-不正当地向NASA提出了托管自己视频的版权要求。同样的情况也发生在使用美国国家航空航天局(NASA)公共领域胶片的独立第三方身上。\nYouTube在2012年末引入了自动内容ID索赔的上诉程序。对于那些视频被标记的用户-即使这些视频使用公共领域内容-恢复它们的过程仍然可能是具有挑战性和深奥的。\n该系统也是可利用的。去年，YouTube与内布拉斯加州的一名男子达成了2.5万美元的和解协议，原因是他被指控滥用版权主张敲诈其他YouTube用户，威胁他们提出虚假的下架请求，除非他们付钱给他。", "note_en": "This weekend&#39;s  launch, in which SpaceX&#39;s Falcon 9 rocket successfully propelled the Crew Dragon spacecraft and the two astronauts on board from Florida safely into space, was  amazing, awe-inspiring, and frankly, just plain cool to watch. And here in the age of inexpensive, tiny high-definition cameras and streaming content, it  should be easy to catch up on it if you missed it—or even if you just want to watch it again for fun. But for most of the weekend and into this morning, you couldn&#39;t watch it at all, thanks to copyright content ID bots working overtime.\n The May 30 launch was streamed live to NASA&#39;s YouTube channel and then  archived, along with several shorter clips and highlights taken from the day-long livestream. NASA footage, like photo and video from other government agencies, is generally  published into the public domain, not under copyright, and other entities can mirror or rebroadcast it. National Geographic  also covered the launch, and its footage incorporated some of the NASA content. Then things got stupid.\n By Sunday, the archival NASA video was no longer available to view, Twitter users  spotted, because of a copyright claim from National Geographic. Attempts at that time to play back some of the NASA videos resulted in an error message saying, &#34;Video unavailable: This video contains content from National Geographic, who has blocked it on copyright grounds.&#34;\n NASA got involved by Sunday and pushed the companies for a fix. &#34;Over the last few days our team at NASA has been in touch with YouTube who escalated the issue,&#34; NASA Communications Director Bettina Inclán said  on Twitter Sunday night. &#34;We also have been in contact with NatGeo who is committed to releasing the claims for Demo-2 coverage.&#34;\n In the end, it appears that YouTube, NASA, and National Geographic got their issues sorted out. By 9:30am Eastern time this morning, the videos were restored and playable, and you can once again watch the launch to your heart&#39;s content.\n   Unlike Saturday&#39;s launch, however, this content ID claim was not a historic first but instead part of a familiar pattern. Almost this exact problem  occurred back in 2012, when other businesses—in that case, the Scripps broadcast companies—improperly filed copyright claims against NASA hosting its own videos. The same happens to  independent third parties who use public domain NASA footage.\n YouTube introduced an  appeals process for automated content ID claims in late 2012. For users whose videos get flagged—even when those videos use  public domain content—the process for having them restored can still be challenging and esoteric.\n That system is also exploitable. Last year, YouTube reached a  $25,000 settlement with a Nebraska man over allegations that he abused copyright claims to extort other YouTubers by threatening them with bogus takedown requests unless they paid him money.", "posttime": "2020-06-02 02:32:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "主张,launch,nasa", "title": "SpaceX发射片段因虚假版权主张而被撤下", "title_en": "SpaceX launch footage was taken down thanks to bogus copyright claim", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/false-natgeo-copyright-claim-took-nasas-launch-video-down-this-weekend/", "via": "", "real_tags": ["主张", "launch", "nasa"]}, {"category": "", "categoryclass": "", "imagename": "a07e2d84a07dc074b717d6e4b03c79ce.jpg", "infoid": 1004703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着反对警察暴行和种族主义的抗议活动在美国许多大城市发生，达拉斯警察局周日要求公众通过该市的智能手机应用程序提交抗议活动中非法活动的视频。事情并不顺利，据报道，该应用程序被韩国流行音乐视频等无关内容淹没，不到一天，由于技术问题，该应用程序停止运行。\nBuzzFeed新闻写道，为了回应达拉斯警方的推特请求，数百名韩国流行歌迷回复了他们最喜欢的艺术家的照片和视频。许多人还声称，他们在iWatch Dallas应用程序上提交了警察伤害抗议者的视频，以及韩国流行歌手的粉丝剪辑视频。&#34；许多人还声称，他们向iWatch Dallas应用提交了警察伤害抗议者的视频，以及韩国流行歌手的粉丝剪辑。\n该部门在美国东部时间周日凌晨12点48分提出了提供抗议者视频的要求。如果你有抗议活动中非法活动的视频，并试图将其分享给@DallasPD，你可以将其下载到我们的iWatch Dallas应用程序上。推特上写道，你可以保持匿名。\n到周日晚上，警察局的推特账号说，由于技术问题，iWatch达拉斯应用程序将暂时关闭。我们今天联系了警察局，了解该应用程序的状态，如果得到回应，我们将更新这篇文章。我今天无法在iPhone应用程序中提交，但这可能是因为我不在达拉斯地区-该应用程序要求启用您手机的定位服务，并告诉我由于验证错误，我的设备被阻止。\nBuzzFeed写道，目前还不清楚推特上的韩国流行歌迷是因为流量过大而导致该应用程序停止运行，还是警方只是想让人们停止通过该应用程序上传照片和视频。\n一名推特用户敦促韩国流行乐迷下载这款应用，并发送你所有的幻想曲，让他们的工作变得尽可能艰难，让他们撤下这款应用。之后，这条以韩流为主题的帖子蜂拥而至。另一条被广泛转发的推文则敦促人们在那些狗屎里充斥着幻想曲，让他们很难找到除了我们最喜欢的舞蹈之外的其他任何东西。这条推文在推特上广为流传，让他们很难找到除了我们最喜欢的舞蹈之外的任何东西。这条推特被广为流传的另一条推文呼吁人们用Fancam充斥那些狗屎，让他们很难找到除了我们最喜欢的舞蹈之外的任何东西。\n适用于iPhone和Android的iWatch Dallas应用程序自去年10月以来一直可用，最后一次更新是在3月份。在周日收到数百条负面评论后，这款应用在两个应用商店的平均评分都是1星。一些评论很好笑，比如这款应用射杀了我的狗，杀死了我的狗，偷走了我的狗，吃掉了我的妻子，或者说这款应用给了它们病毒。其他评论是严肃的，他们说，我们不应该生活在一个警察国家，这款应用程序宣扬种族主义和压迫行为，我不想仅仅因为我是黑人就被杀，因为乔治·弗洛伊德(George Floyd)的正义很重要。\n最近几乎每一条评论都给这款应用打了一颗星，尽管一位iOS用户给了它五星，并称iWatch Dallas是举报共产主义煽动者试图摧毁我们城市的绝妙方式。与此同时，推特上充斥着警察袭击抗议者的视频，Slate在一篇题为“全国警察爆发暴力事件”的文章中详细描述了这一点。\n达拉斯警方周六表示，他们逮捕了74人，并将以煽动骚乱罪起诉他们。该市发布了宵禁，警察局长蕾妮·霍尔(Renee Hall)表示，警方将逮捕违反宵禁的个人，不会容忍我们城市再有任何破坏行为。周日晚上，警方表示，到目前为止，达拉斯市中心几乎没有活动发生。\n互联网已经存在很长一段时间了，政府对围绕它建立起来的文化仍然有着如此悲惨的理解，这总是让我感到惊讶。", "note_en": "With protests against police brutality and racism happening in many major US cities, the Dallas Police Department on Sunday  asked the public to submit videos of &#34;illegal activity from the protests&#34; through the city&#39;s smartphone app. It didn&#39;t go well, as the app was reportedly inundated with unrelated content, such as K-pop videos, and within less than a day, the app had stopped working due to &#34;technical difficulties.&#34;\n &#34;In response to the tweeted request from Dallas Police, hundreds of K-pop fans replied with photos and videos of their favorite artists,&#34;  BuzzFeed News wrote. &#34;Many people also claimed to have submitted videos of the police harming protestors, as well as fan edits of K-pop artists, to the iWatch Dallas app.&#34;\n The department made its request for video of protesters at 12:48am CT Sunday. &#34;If you have video of illegal activity from the protests and are trying to share it with @DallasPD, you can download it to our iWatch Dallas app. You can remain anonymous,&#34; the tweet said.\n By Sunday evening, the department&#39;s Twitter account  said, &#34;Due to technical difficulties iWatch Dallas app will be down temporarily.&#34; We contacted the police department about the status of the app today and will update this article if we get a response. I was unable to make a submission in the iPhone app today, but that may be because I&#39;m not in the Dallas area—the app asks for your phone&#39;s location services to be enabled and told me that my &#34;device is blocked&#34; due to a &#34;validation error.&#34;\n &#34;It&#39;s unclear if K-pop fans from Twitter overwhelmed the app with traffic, causing it to stop working or if the police department simply wanted people to stop submitting photos and videos through the app,&#34; BuzzFeed wrote.\n  K-pop-themed  submissions apparently flooded in after a Twitter user  urged K-pop fans to &#34;download the app and send all your fancams&#34; in order to &#34;make their jobs as hard as possible&#34; and &#34;make them take down the app.&#34; Another  widely shared tweet urged people to &#34;FLOOD that shit with fancams [and] make it SO HARD for them to find anything besides our faves dancing.&#34;\n The iWatch Dallas app for  iPhone and  Android has been available since October and was last updated in March. The app has a 1-star average rating on both app stores after getting hundreds of negative reviews on Sunday. Some reviews were facetious, saying things like &#34;this app shot my dog,&#34; &#34;killed my dog,&#34; &#34;stole my dog and ate my wife,&#34; or that the app gave them a virus. Other reviews were serious, saying, &#34;we shouldn&#39;t live in a police state,&#34; that the &#34;app promotes racist and oppressive behavior,&#34; &#34;I don&#39;t wanna get killed just because I&#39;m black,&#34; &#34;Justice for George Floyd,&#34; and &#34;Black Lives Matter.&#34;\n Nearly every single recent review gave the app one star, though one iOS user gave it five stars and called iWatch Dallas a &#34;Fantastic way to report communist agitators trying to destroy our city.&#34; Meanwhile, Twitter has been flooded with videos of police officers assaulting protesters, as Slate detailed in an article titled &#34; Police Erupt in Violence Nationwide.&#34;\n Dallas police on Saturday  said they arrested 74 people and will charge them with &#34;inciting a riot.&#34; The city issued a curfew, and Police Chief Renee Hall  said police will &#34;make arrests of individuals violating curfew&#34; and &#34;will not tolerate any more  vandalism of our city.&#34; On Sunday night, police  said, &#34;As of now, there is very little activity occurring in the downtown Dallas area.&#34;\n  The internet has been around for a long time, it always surprises me that governments  still have such a miserable comprehension of the culture that&#39;s built up around it.", "posttime": "2020-06-02 02:31:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "police,应用程序", "title": "达拉斯警方要求公众提供示威者的视频-进展不顺利", "title_en": "Dallas Police asked public for videos of protesters–it didn’t go well", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/dallas-police-asked-public-for-videos-of-protestors-it-didnt-go-well/", "via": "", "real_tags": ["police", "应用程序"]}]