[{"category": "", "categoryclass": "", "imagename": "6e1bd5a33b61b998caacc640a616f070.jpeg", "infoid": 1007822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "社交媒体改变了营销人员接近目标受众的方式。过去，营销人员会创建一条消息，然后将其分发到多个渠道。\n随着社交媒体的兴起，以及每个平台都建立在不同的上下文框架内，营销人员转向了一种更专注于为他们通过各种渠道分发的单个活动创建多条消息的方法。\n所有这些努力都是为了吸引“合适的客户”。很容易看出，这可能会导致营销人员争先恐后地跟上形势。\n但如果有更简单的方法呢？如果一个品牌不需要如此严重地依赖于大众信息，而是决定针对个别客户调整他们的个性化方法，那会怎么样？\n如果你对此很感兴趣，你可能只想看看客户参与营销。\n客户参与营销是使用个性化消息传递公司的理想潜在客户通过销售漏斗进行营销的营销方式。\n你把他们吸引到漏斗里，培养他们，然后把他们变成忠诚的品牌宣传者的客户。\n今天，一家公司需要超越简单的品牌承诺，真正开始在关键的营销、信息收集和转换点为消费者履行承诺。\n客户参与营销在整个销售漏斗过程中与潜在客户和客户建立了独特的互动关系。\n无论您是给客户发电子邮件还是与潜在客户在线互动，您都是在执行参与策略。\n当谈到客户参与营销时，你想要鼓励你的客户通过所有渠道与你的品牌互动。\n您希望提供一个双边对话的机会，让您倾听他们的问题或需求，然后为他们提供满足这些需求的优质客户服务。\n你的参与度越高，你对这些问题和需求的处理越彻底，消费者就越有可能成为你的品牌的布道者。\n让我们来看一个真实世界的场景。想象一下，你从创始人/设计师或你最喜欢的网上精品鞋店收到了一封个性化的电子邮件。\n您收到的电子邮件是通知您，本周将推出一个新的凉鞋系列，他们认为您会有兴趣看看该系列的一些照片和细节。这就是客户参与营销。\n事实是，这只是你可以个性化品牌与消费者联系的多种方式中的一个例子。\n事实上，有如此多的方式，消费者参与营销实际上是一种对几乎任何类型的行业都很好的方法。\nCEM是一种高度集中的营销，它将你的品牌与已经从你那里购买过的人，或者你知道的正在积极购买你提供的产品/服务的人联系起来。\n换句话说，过去主导品牌营销努力的不是大众营销的鸟枪式方法。\n无论您的业务是B2B还是B2C，您都希望与客户建立并保持积极的关系和联系。客户参与营销是实现这一目标的绝佳方式。\n通过关注个性化的接触点，客户参与营销建立了关系，因为它改善了你的品牌的整体客户体验。\n您的客户不再简单地感觉自己是浩瀚的数字海洋中的一个数字。\n相反，你是在与他们接触，以一种让他们感觉自己没有被“谈论”的方式，一对一地与他们接触，而是对话中经过验证的一部分。\n这种额外的关怀和关注得到了他们的赞赏，并帮助他们转变为品牌传道者。\n客户参与营销关注的是客户关系的长期价值，而不是简单地试图通过转换获得“速胜”的前景。\n以下是Salesforce的乔恩·苏亚雷斯-迪亚兹(Jon Suarez-Diaz)关于使用客户参与营销的看法，以及它在当今营销格局中的意义-这是在AdExchange大会上说的。\n消费者会意识到这一点，并将重点放在客户参与战略上，将其作为日常营销工作的一部分，这将带来更好的客户体验，更多的消费者会称赞你，最终更有可能你会被认为是市场领域的思想领袖。\n如果您需要任何关于制定客户参与策略的提示，请在下面的评论中与我们联系，我们将提供更多提示。", "note_en": "Social media has changed how marketers are approaching their target audiences. It used to be that marketers would create a single message and distribute it across multiple channels.\n With the rise of social media and the fact that each platform is built within a different contextual framework, marketers moved to an approach more focused on creating multiple  messages for a single campaign that they distribute over various channels.\n  All these efforts are done in the hopes of attracting  “the right customer”. It’s pretty easy to see how this could set up a scenario where marketers are scrambling to keep up.\n But what if there were an easier way? What if a brand didn’t have to rely so heavily on a mass message, but instead decided to tune into personalizing their approach for individual customers?\n If that sounds interesting to you, you may just want to check out  customer engagement marketing.\n  Customer engagement marketing is marketing that uses personalized messaging to move a company’s ideal prospects through the sales funnel.\n You attract them into the funnel, nurture them and then turn them into customers that are loyal brand evangelists.\n  Today, a company needs to move beyond simply communicating its brand promise and actually start to fulfill that promise for its consumers at key marketing, information gathering and conversion points.\n Customer engagement marketing creates a unique engagement with leads and customers throughout the entire journey of the sales funnel.\n   Whether you are emailing customers or interacting with prospects online, you are carrying out an engagement strategy.\n When it comes to customer engagement marketing, you want to encourage your customers to interact with your brand across all it’s channels.\n  You want to provide an opportunity for a two-sided conversation that allows you to listen to their questions or needs and then provide them excellent customer service that addresses those needs.\n The stronger your engagement and the more thoroughly you handle these questions and needs, the more likely consumers are to become your brand’s evangelists.\n   Let’s look at a real-world scenario. Imagine you get a personalized email message from the founder/designer or your favorite online boutique shoe store.\n The email you received is to notify you that there is a new line of sandals coming out this week and they thought you would be interested in seeing some photos and details about the line. That is customer engagement marketing.\n  The truth is this is just one example of many types of ways you can personalize the brand to consumer connection.\n There are so many ways, in fact, that  consumer engagement marketing is actually an approach that is a great one for just about any type of industry.\n CEM is hyper-focused marketing that connects your brand with people who have already bought from you, or who you know are actively shopping for the product/service you offer.\n In other words, it’s not a shotgun approach of mass marketing that used to dominate brand’s marketing efforts.\n  Whether your business is B2B or B2C, you want to build and maintain positive relationships and connections with your customers. Customer Engagement Marketing is an excellent way to achieve this.\n  With a focus on personalized touchpoints, customer engagement marketing builds relationships because it is improving your brand’s overall customer experience.\n Your customers no longer feel simply like a number in a vast sea of other numbers.\n  Instead, you are engaging with them, one-on-one in a fashion that allows them to feel like they aren’t being “talked at”, and rather a validated part of the conversation.\n This extra care and attention are appreciated by them and helps convert them into brand evangelists.\n  Customer engagement marketing focuses on the long-term value of the customer relationship, rather than the prospect of simply trying to get a “quick win” for a conversion.\n Here’s what  Jon Suarez-Diaz of Salesforce had to say about using customer engagement marketing and how meaningful it is in today’s marketing landscape —  this was at the AdExchanger conference.\n  Consumers pick up on this and focusing on a customer engagement strategy as part of your daily marketing efforts will lead to better customer experiences, more consumers singing your praises, and ultimately more of a likelihood you will be considered the thought leader in your market space.\n  If you need any tips on coming up with a customer engagement strategy, let us know in the comments below and we’ll provide some more pointers.", "posttime": "2020-06-24 00:30:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "客户,customer,营销", "title": "投资于客户体验可提高参与度和知名度", "title_en": "Investing in the customer experience increases engagement and awareness", "transed": 1, "url": "https://medium.com/newtheory/what-is-customer-engagement-marketing-1f90223cc9ec", "via": "", "real_tags": ["客户", "customer", "营销"]}, {"category": "", "categoryclass": "", "imagename": "09220b99e517d66844106723f55a7192.jpeg", "infoid": 1007821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊公司(Amazon.com Inc.)。正在推出一只20亿美元的内部风险投资基金，专注于技术投资，以减少气候变化的影响，这是这家科技巨头在其环境记录受到批评后推出的最新可持续发展举措。\n据该公司称，这只新基金将被称为气候承诺基金(Climate Pledge Fund)，将投资于多个行业的公司，包括交通运输、能源生产、电池储存、制造业以及食品和农业。其目的是帮助亚马逊和.", "note_en": "Amazon.com Inc. is launching a $2 billion internal venture-capital fund focused on technology investments to reduce the impact of climate change, the latest sustainability initiative from the technology giant after criticism of its environmental record.\n  The new fund, which will be called The Climate Pledge Fund, will invest in companies across a number of industries, including transportation, energy generation, battery storage, manufacturing and food and agriculture, according to the company. The aim is to help Amazon and...", "posttime": "2020-06-24 00:29:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,风险投资,亚马逊,基金,capital", "title": "亚马逊将推出20亿美元风险投资基金投资清洁能源", "title_en": "Amazon to Launch $2B Venture Capital Fund to Invest in Clean Energy", "transed": 1, "url": "https://www.wsj.com/articles/amazon-to-launch-2-billion-venture-capital-fund-to-invest-in-clean-energy-11592910001", "via": "", "real_tags": ["amazon", "风险投资", "亚马逊", "基金", "capital"]}, {"category": "", "categoryclass": "", "imagename": "fabfcc04959bf15784b8787678075823.jpg", "infoid": 1007820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近针对乔治·弗洛伊德(George Floyd)、布雷娜·泰勒(Breonna Taylor)和其他美国黑人死亡的抗议活动中，全国各地的警察部队使用了被归类为“不那么致命”的武器来驱散人群和制服个人。但是，尽管有标签，这些工具仍然可以超越肉体和骨骼的固有限制。听起来无害的设备-橡皮子弹，催泪瓦斯-被设计成通过武力和化学来迅速改变人类的行为。它们被作为一种可以立即杀死人的力量的替代品出售。然而，这样的武器并不是无害的。\n约翰·霍普金斯大学(Johns Hopkins University)社会学助理研究科学家、“徽章无国界”(Badges Without Borders)一书的作者斯图尔特·施雷德(Stuart Schrader)指出，首先，它们经常被用作采取更严厉措施的前奏。他说：“称(武器)‘非致命’或‘不致命’是完全用词不当的一个原因是，如果它被用来强迫人们进入手持警棍的警察或手持步枪的士兵的[攻击范围]。”“只有在最严格的技术解读中，你才能称之为‘不那么致命’或‘非致命’。”而且，除了与致命武器结合使用外，这些工具本身仍可能造成重伤和死亡。\n这类装置大致分为三类：钝力武器，旨在通过物理冲击伤害人，以及化学制剂，旨在刺激或使人丧失行动能力。第三组包括专门的技术，从手持泰瑟枪的电击到武器化的声波。\n警察通常携带手持式工具-如警棍和盾牌-可以用来伤害人。在激烈的抗议活动中，一种更华丽的物品长期以来一直被广泛使用：包裹在橡胶中的金属弹，委婉地称之为橡胶子弹。从它们最早的使用开始，这些子弹就有造成持久伤害的历史。虽然官方指定的子弹可以向地面发射，然后反弹到人的腿上，但橡胶包裹的炮弹经常直接击中头骨、胸部或眼睛。在2009年的一项研究中，韦恩州立大学(Wayne State University)的研究人员发现，橡皮子弹击中的力量可以超过3500牛顿-比职业拳击手击中头部侧面的力量的两倍还多-这足以导致身体头骨骨折。\n军队和警察在许多情况下都使用了橡皮子弹，从20世纪70年代的北爱尔兰开始，本月包括华盛顿特区。但它们只是一系列炮弹中的一个例子，有时被称为“指挥棒子弹”，长期以来一直被用作标准子弹的替代品。1969年12月的FBI执法公报描述了英国政府在香港控制骚乱时使用的一种这样的物品。香港当时是英国的附属领土。子弹有一个柚木弹壳，上面有一个小铅插件，由压缩气体发射。现在的木制指挥棒子弹更宽，更像冰球形状。从西雅图到弗格森，警方都在使用它们。除了橡胶和木头，还在使用的其他杀伤力较低的投射物包括塑料子弹，它也造成了伤亡，以及装满铅弹的枪支推进背包，被称为“豆袋子弹”，它以大致相同的方式使人丧失行动能力。\n在过去的几周里，像这样的钝力投射物导致头骨骨折，颌骨骨折，并将伤势严重的人送往医院。一些人表示，他们在参与或报道乔治·弗洛伊德(George Floyd)抗议活动时，眼睛被警棍击中，他们表示正在组建一个支持小组。眼科医生专业协会写了一封公开信，要求警方停止使用包括橡皮子弹在内的损害眼睛的技术。\n被广泛称为催泪剂的化学武器被正式归类为“催泪剂”，因为它们会导致泪水-伴随着恶心、灼热感、流泪和呼吸困难的感觉。投掷的催泪瓦斯罐和手榴弹会产生外观类似烟雾的粉末云，像薄雾一样在空中翻滚。当与身体接触时，这种粉末会产生上述反应，使人丧失行为能力，因此他们不能自愿抵抗警察。\n催泪瓦斯最古老的类型之一是化合物CS(2-氯苄基丙二腈)，它形成于1928年，在20世纪60年代得到普及，主要有两个用途：一是作为支持美军在越南采取致命行动的武器，二是作为一种非致命性的方式来控制美国的人群-其中许多人抗议警察的暴行和越南战争。施雷德在无国界徽章上写道：“像美军那样称CS[a]为‘暴乱控制剂’，是为了使其在越南的使用合法化，使其不再引起争议。”\n20世纪50年代进行的军事研究将CS归类为非致命性疾病。但今天的专家表示，这些研究在设计和适用性方面存在局限性，应该持怀疑态度对待。“催泪瓦斯是用来驱散和刺激的。但它的设计和首次使用是在人们认为它将被用来对付健康的工作年龄男性的时代，“丹·卡泽塔(Dan Kaszeta)说，他研究对化学和生物武器的防护，在他30年的职业生涯中，有一些时间是在美国陆军化学军和特勤局度过的。实验室研究还没有揭示催泪瓦斯对其他人口统计数据或有既往疾病的人的影响。Kaszeta说：“没有办法构建一项伦理实验室研究来调查儿童、哮喘患者、COPD(慢性阻塞性肺疾病)患者、[结核病]患者或孕妇。”他补充说，女性对催泪瓦斯的反应也没有得到很好的研究。\n在实验室之外，催泪瓦斯已经被证明会对哮喘患者造成长期的损害，并可能导致流产。当在狭小和通风不良的空间使用时，它也被认为与死亡有关。催泪瓦斯如果射向抗议者的头部，本身就可能是致命的，就像2019年10月和11月在伊拉克发生的那样。\n其他最常见的用于平民的化学武器是胡椒喷雾。它们最初是作为一种动物驱避剂而设计的，源自辣椒植物对哺乳动物的天然防御。警方从20世纪80年代开始将这种喷雾剂用于人体。理论上，警方手册将喷雾概括为一种非常短距离的工具，用于驱散人群或防止对警察、旁观者或财产的直接伤害。但在实践中，警方也使用这些武器对付坐着的和手无寸铁的抗议者。它们会引起皮肤的灼热感，产生类似催泪瓦斯的效果，包括流泪和呼吸困难。\n远程声学设备(LRAD)是作为警察扩音器和扩音器的替代品而销售的。虽然它当然能够大声传输信息，但它的设计初衷是先警告人们，然后使他们丧失行动能力：该设备产生的声波被刻意设计成能够携带远距离和高音量。它击中的目标高达152分贝-足以造成永久性听力损伤。LRAD大小不一，通常类似于一个大而平的扬声器。它们可以安装在三脚架上，但最常见的是安装在车辆上，包括专用卡车和直升机。\nLRAD对抗议者的使用至少可以追溯到2009年匹兹堡G20抗议活动。2014年，纽约市警察局因使用LRAD对付抗议者而被起诉，美国第二巡回上诉法院(U.S.Court of Appeals for the Second Circuit)裁定，“根据明确确立的法律，故意使用LRAD的方式能够造成严重伤害，将非暴力抗议者转移到人行道上，违反了第十四修正案。”记者安德鲁·尼夫(Andrew Neef)在匹兹堡抗议活动中经历了LRAD，他在2018年的一篇文章中描述了这一影响。“你的大脑感觉就像在桌子上的一碗果冻里震动，”他告诉“亚利桑那镜报”。\n闪光手榴弹，也被称为眩晕手榴弹，起源于1977年由英国特种部队支持的人质营救任务。闪光刘海既可以作为手榴弹类装置存在，也可以作为标准40毫米榴弹发射器中的弹丸存在。“闪光”是一种突如其来的强光，会导致眼睛疼痛、混乱和暂时性失明。“砰”声超过165分贝(比猎枪还响)。\n这些工具的设计是为了让附近任何没有准备好接受声音或光线的人丧失行动能力，并为扔它们的警察或士兵的行动提供便利。除了作为人群控制措施外，警方还利用手榴弹在强行进入建筑物和住宅时获得突击元素。\n据报道，一名上个月在西雅图遭遇闪光弹的抗议者被弹片打伤。总体而言，警察的闪光刘海造成了伤亡，包括烧伤和致命的心脏病发作。\n泰瑟枪是一个著名的品牌，已经成为正式名称为“电子控制武器”的设备的统称。它们是一种手持工具，可以发射一对飞镖，目的是在35英尺外的目标将飞镖钩入人的皮肤。细铜线从省道延伸回设备，使持用者能够发出强大的电击。\n虽然正式被描述为明显致命的子弹的一种不那么致命的替代品，但路透社(Reuters)2017年对700多名被这种武器震惊后死亡的人进行的调查发现，在这些死亡中，有五分之一是由这种武器造成的。亚特兰大的六名警察在5月30日的抗议活动中使用这些装置迫使两名学生下车，他们被控咄咄逼人使用武力。", "note_en": "During the recent protests over the deaths of George Floyd, Breonna Taylor and other Black Americans, police forces across the country have used weapons categorized as          “less lethal” to disperse crowds and subdue individuals. But despite their label, these tools can still overstep the inherent limitations of flesh and bone. Devices that sound innocuous— rubber bullets, tear gas—are designed to quickly change human behavior through force and chemistry. And they are sold as an alternative to the kind of force that immediately kills. Such weapons are not harmless, however.\n  For starters, they are often used as a prelude to more severe measures, notes Stuart Schrader, an assistant research scientist in sociology at Johns Hopkins University and author of the book  Badges without Borders.          “One of the reasons it’s a complete misnomer to call [a weapon]          ‘nonlethal         ’ or          ‘less lethal’ [is] if it         ’s being used to force people into the [attack range] of cops with batons—or soldiers with rifles,” he says.          “In only the most strict technical reading could you call that          ‘less lethal         ’ or          ‘nonlethal.’” And in addition to their use in combination with lethal weapons, these tools can still cause serious injury and death on their own.\n  Such devices fall roughly into three categories: There are blunt-force weapons, which are designed to hurt people with a physical impact, and chemical agents, which are meant to irritate or incapacitate. A third group comprises specialized technologies ranging from the electric shocks of handheld Tasers to weaponized sound waves.\n    Police commonly carry handheld implements—such as batons and shields—that can be employed to injure people. During intense protests, a flashier item has long seen widespread use: metal projectiles encased in rubber, euphemistically termed rubber bullets. From their earliest uses,  these bullets have a history of  causing lasting injury. While officially designated as rounds that can be  fired at the ground to then bounce into  people         ’s  legs, the rubber-encased projectiles often directly hit skulls, chests or eyes. In a 2009 study, researchers at Wayne State University found rubber bullets can hit with a force greater than 3,500 newtons—more than  twice as hard as being punched in the side of the head by a professional boxer—which was enough to  fracture cadaver skulls.\n  Militaries and police have employed rubber bullets in many situations, beginning in  Northern Ireland in the 1970s and including  Washington, D.C., this month. But they are just one example of a family of projectiles, sometimes called          “baton rounds,” that have long been used as an alternative to standard bullets. The  December 1969 issue of the  FBI Law Enforcement Bulletin described one such item used by the British government for riot control in Hong Kong, then a dependent territory of the U.K. The bullet had a teak shell with a small lead insert and was fired by compressed gas. Present-day wooden baton rounds are broader and more puck-shaped. And they have been used by police from  Seattle to  Ferguson. Beyond rubber and wood, other less lethal projectiles still in use include plastic bullets, which have also  caused injuries and deaths, as well as gun-propelled satchels full of lead shot, called          “beanbag rounds,” which incapacitate people in much the same way.\n  In the past couple of weeks, blunt-force projectiles like these have fractured skulls, broken jaws and sent people to the hospital in  critical condition. A number of people who say they have lost eyes to baton rounds while participating in or covering the George Floyd protests have indicated they are  forming a support group. And a professional association of ophthalmologists has written an open letter asking police to stop using eye-damaging techniques, including rubber bullets.\n    The chemical weapons broadly termed tear gas are officially classified as          “lachrymatory agents” because they result in tears—along with nausea, burning sensations, watering eyes and a feeling of breathing difficulty. Thrown canisters and grenades of tear gas produce clouds of powder with an appearance akin to smoke that billow in the air like a mist. On contact with the body, the powder produces the aforementioned reactions, which incapacitate people so they cannot voluntarily resist police.\n  One of the oldest types of tear gas is the compound CS (2-chlorobenzalmalononitrile), which was formulated in 1928 and popularized in the 1960s for two main uses: as a weapon in support of lethal action by the U.S. military in Vietnam and as a nonlethal way to control crowds—many of them protesting police brutality and the Vietnam War—in the U.S.          “To call CS [a]          ‘riot control agent,’ as the US military did,” Schrader wrote in  Badges without Borders,          “was to legitimize its use in Vietnam and make it uncontroversial,” despite the fact that          “CS was not used in riot control as much as in combat.”\n  Military studies performed in the 1950s classified CS as nonlethal. But experts today say these studies had limitations in design and applicability and should be treated with some skepticism.          “Tear gas is designed to disperse and irritate. But it was designed and first used in an era when it was assumed it would be used against healthy, working-age males,” says Dan Kaszeta, who studies protection against chemical and biological weapons and has spent some of his 30-year career in the U.S. Army’s Chemical Corps and the Secret Service. Lab studies have not revealed the effects tear gas can have on other demographics or people with preexisting conditions.          “There         ’s no way to structure an ethical lab study to investigate children, asthmatics, COPD [chronic obstructive pulmonary disease] sufferers, [tuberculosis] patients or pregnant women,” Kaszeta says. He adds that  women         ’s reactions to tear gas are also not well-studied.\n  Outside of the lab, tear gas has been shown to cause prolonged damage in  people with asthma and to potentially contribute to miscarriages. It has also been linked to death when used in confined and poorly ventilated spaces. Tear gas canisters themselves can be lethal if fired at  protesters’ head, as they were in Iraq in October and November 2019.\n  The other most common kinds of chemical weapons used on civilians are  pepper sprays. They were originally devised as an animal repellent, derived from chili plants’ natural defense against mammals. Police adopted the sprays for use on humans  starting in the 1980s. In theory, police manuals outline the sprays as a very short-range tool to disperse crowds or prevent immediate harm to officers, bystanders or property. But in practice, police have also used these weapons against  sitting and unarmed protesters. They can cause a burning sensation on the skin and produce effects similar to tear gas, including watering eyes and breathing difficulty.\n    The long-range acoustic device (LRAD) is marketed as an alternative to police bullhorns and loudspeakers. While it is certainly capable of transmitting messages loudly, it was designed to first warn people and then incapacitate them: The device produces soundwaves deliberately shaped to carry far and at a high volume. It hits a target at up to 152 decibels—enough to cause  permanent hearing damage. LRADs come in a range of sizes, most often resembling a large, flat speaker. They can be mounted on a tripod but are most commonly incorporated in vehicles, including dedicated trucks and helicopters.\n  LRAD use against protesters dates at least as early as the G20 protests in Pittsburgh in 2009. In 2014 the New York City Police Department was sued for turning LRADs against protesters, and the U.S. Court of Appeals for the Second Circuit held that          “   purposefully using a LRAD in a manner capable of causing serious injury to move non-violent protesters to the sidewalks violates the Fourteenth Amendment under clearly established law.” Journalist Andrew Neef, who  experienced an  LRAD in the Pittsburgh protests, described the effect in a 2018 article.          “Your brain feels like it         ’s vibrating in a bowl of jelly on the table,” he told the Arizona Mirror.\n    Flash bang grenades, also known as stun grenades, have their origins in a  hostage rescue mission supported by British special forces in 1977. Flash bangs exist as both hand-thrown grenadelike devices and projectiles that fit into standard 40-millimeter grenade launchers. The          “flash” is a sudden bright light that causes ocular pain, confusion and  temporary blindness. The          “bang” is more than 165 decibels (louder than a shotgun).\n  These tools are designed to incapacitate anyone nearby who is not prepared for the sound or light and to facilitate the movement of the police or soldiers who toss them. In addition to their use as crowd-control measures, police have also utilized the grenades to gain the element of surprise when entering buildings and  homes by force.\n  A protestor encountering a flash bang in Seattle last month was  reported to have been injured by shrapnel. And in general, police flash bangs have caused injuries and deaths, including  burns and fatal  heart attacks.\n    Taser is a well-known brand name that has become the catch-all term for devices formally known as          “electronic control weapons.”         They are handheld tools that launch a pair of darts designed to hook into a person         ’s skin at a target  up to 35 feet away. Thin copper wires extend from the darts back to the device, allowing the wielder to deliver a powerful electric shock.\n  While formally described as a less lethal alternative to explicitly lethal bullets, a  2017 Reuters investigation of more than 700 people who died after being shocked with the weapon found it to be a contributing factor in one fifth of those deaths. Six police officers in Atlanta who used these devices on a pair of students to force them out of their car during  protests on May 30 have been charged for an aggressive use of force.", "posttime": "2020-06-24 00:10:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "武器,lethal", "title": "“不那么致命”的武器有什么作用？", "title_en": "What ‘Less Lethal’ Weapons Do", "transed": 1, "url": "https://www.scientificamerican.com/article/what-less-lethal-weapons-actually-do/", "via": "", "real_tags": ["武器", "lethal"]}, {"category": "", "categoryclass": "", "imagename": "08d3ff7e17623bab2d93410308aadae4.png", "infoid": 1007818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想这一次将是一个公平的性能比较，因为这两种语言都是编译和静态类型的。\n我很想知道围棋和克里斯托的表现如何比较。\n对于测试，我们将运行以前编译的程序。我们将使用发布标志在Crystal中启用优化：\nGo二进制文件没有发布版本，我们也不会使用任何标志。所以，它只是：\n好的，首先我们将编写代码来生成给定数字的斐波纳契数列。让我们找出第47个数字，它是2,971,215,073。\n软件包main import&#34；fmt&#34；func Fibonacci(N Uint32)uint32{if n&lt；2{return n}return Fibonacci(n-1)+Fibonacci(n-2)}func main(){fmt。Println(费波纳奇(47))}。\n如果n&lt；2 Fibonacci(n-1)+Fibonacci(n-2)end放入Fibonacci(47)，则def Fibonacci(n：UInt32)返回n。\nCrystal的二进制大小是Go的5倍，不过，如果我们省略调试信息，它们的大小可以略微减小：\n此外，不是在这个特定的示例中，但通常Go的编译时间比Crystal快得多。\n现在，让我们使用标准库创建一个简单的HTTP服务器。Go的net/http和Crystal的http/server都使用并发：Go使用goroutine，Crystal使用纤程。\n包主要导入(&#34；fmt&#34；&#34；net/http&34；)func main(){http.。HandleFunc(&#34；/&#34；，HelloServer)http。ListenAndServe(&#34；：8080&#34；，nil)}func HelloServer(带http。ResponseWriter，r*http。请求){fmt。Fprintf(w，&34；Hello from%s！&#34；，r.。URL。路径[1：])}。\n要求&#34；http/server&#34；server=HTTP：：server。新建DO|Context|Context。回应。content_type=&#34；文本/纯文本&#34；上下文。回应。从#{context打印&#34；Hello。请求。PATH}！&#34；END PUT&#34；侦听http://127.0.0.1:8080&#34；服务器。聆听(8080)。\n对于基准测试，我们将使用WRK。如果您不熟悉这个工具，它就像一个非常有名的ApacheBench(Ab)，但它是一个现代版本。\n下面是我们如何运行基准测试60秒，使用8个线程，并保持400个HTTP连接打开：\n运行1M测试@http://localhost:8080/hello 8线程和400个连接线程统计平均标准开发V最大+/-标准开发延迟3.56ms 2.26ms 95.31ms 92.00%Req/Seq 8.77k 2.24k 15.75k 64.66%1.00M中的4190457个请求，535.51MB读套接字错误：CONNECT157，READ 100，WRITE 0，TIMEOUT 0请求/秒：69757.81传输/秒：8.91MB。\n运行1M测试@http://localhost:8080/hello 8线程和400个连接线程统计平均标准开发V最大+/-标准开发延迟2.89ms 0.97ms 19.01ms 80.34%Req/Seq 10.54k 3.41k 18.14k 60.85%1.00M中的5035284个请求，513.82MB读套接字错误：CONNECT157，READ 85，WRITE 0，TIMEOUT 0请求/秒：83917.26传输/秒：8.56MB\n表中超过100%的CPU利用率可能看起来令人困惑。但这仅仅意味着系统使用多个内核。最大一个核心是100%。\n我的机器有8个内核，可以在MacOS上使用以下命令看到：\n坦率地说，我们只做了几次小测试来得出任何结论，但我仍然为Crystal作为一种年轻的语言而感到兴奋，但显示出了很好的结果。", "note_en": "I guess this time it will be a fair performance comparison as both languages are compiled and statically typed.\n     I’m curious to find out how Go and Crystal perform in comparison to each other.\n  For the tests we will be running previously compiled programs. We will use the release flag to enable optimizations in Crystal:\n  Go binaries don’t have a release version and we won’t be using any flags. So, it’s just:\n   Alright, first we will write code to generate a Fibonacci sequence for a given number. Let’s find the 47th number which is 2,971,215,073.\n  package  main import  &#34;fmt&#34; func  fibonacci ( n  uint32 )  uint32  {  if  n  &lt;  2  {  return  n  }  return  fibonacci ( n - 1 )  +  fibonacci ( n - 2 ) } func  main ()  {  fmt . Println ( fibonacci ( 47 )) }\n  def  fibonacci ( n  :  UInt32 )  return  n  if  n  &lt;  2  fibonacci ( n - 1 )  +  fibonacci ( n - 2 )  end puts  fibonacci ( 47 )\n     Crystal’s binary size is 5 times smaller than Go’s. Though, they can be slightly reduced in size when we omit the debug information:\n   Also, not in this particular example, but generally Go’s compilation time is much much faster than Crystal’s.\n  Now, let’s create a simple HTTP server using standard libraries. Both Go’s  net/http and Crystal’s  http/server employ concurrency: Go uses goroutines and Crystal uses fibers.\n  package  main import  (\t &#34;fmt&#34;\t &#34;net/http&#34; ) func  main ()  {\t http . HandleFunc ( &#34;/&#34; ,  HelloServer )\t http . ListenAndServe ( &#34;:8080&#34; ,  nil ) } func  HelloServer ( w  http . ResponseWriter ,  r  * http . Request )  {\t fmt . Fprintf ( w ,  &#34;Hello from %s!&#34; ,  r . URL . Path [ 1 : ]) }\n  require  &#34;http/server&#34; server  =  HTTP :: Server . new  do  | context |  context . response . content_type  =  &#34;text/plain&#34;  context . response . print  &#34;Hello from  #{ context . request . path } !&#34; end puts  &#34;Listening on http://127.0.0.1:8080&#34; server . listen ( 8080 )\n For benchmarking we will be using  wrk. If you’re not familiar with this tool it’s like a pretty well known ApacheBench (ab) but a modern version.\n Here is how we can run a benchmark for 60 seconds, using 8 threads, and keeping 400 HTTP connections open:\n   Running 1m test @ http://localhost:8080/hello 8 threads and 400 connections Thread Stats Avg Stdev Max +/- Stdev Latency 3.56ms 2.26ms 95.31ms 92.00% Req/Sec 8.77k 2.24k 15.75k 64.66% 4190457 requests in 1.00m, 535.51MB read Socket errors: connect 157, read 100, write 0, timeout 0Requests/sec: 69757.81Transfer/sec: 8.91MB\n  Running 1m test @ http://localhost:8080/hello 8 threads and 400 connections Thread Stats Avg Stdev Max +/- Stdev Latency 2.89ms 0.97ms 19.01ms 80.34% Req/Sec 10.54k 3.41k 18.14k 60.85% 5035284 requests in 1.00m, 513.82MB read Socket errors: connect 157, read 85, write 0, timeout 0Requests/sec: 83917.26Transfer/sec: 8.56MB\n    CPU utilization over 100% in the table might seem confusing. But it simply means the system uses multiple cores. One core at max is 100%.\n My machine has 8 cores as it can be seen with the following command on macOs:\n   Frankly speaking, we have only performed a couple of small tests to make any conclusions but I’m still excited for Crystal as a young language but showing great results.", "posttime": "2020-06-24 00:09:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,crystal", "title": "围棋VS Crystal性能", "title_en": "Go vs. Crystal Performance", "transed": 1, "url": "https://ptimofeev.com/go-vs-crystal-perfomance/", "via": "", "real_tags": ["性能", "crystal"]}, {"category": "", "categoryclass": "", "imagename": "f557b4de522845e8e955a715b4a5fa00.jpg", "infoid": 1007817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊周二启动了气候承诺基金(Climate Pledge Fund)，这是一项新的风险投资计划，将向初创企业注入20亿美元的初始资金，这些初创企业将在交通、食品、制造业等不同行业构建可持续技术。\n该基金是这家科技巨头亚马逊去年宣布的气候承诺的一部分，当时该公司承诺到2040年实现净碳中性。\n亚马逊首席执行官杰夫·贝佐斯在一份声明中表示：“气候承诺基金将寻求投资于有远见的企业家和创新者，他们正在开发产品和服务，帮助公司减少碳影响，实现更可持续的运营。”“将考虑来自世界各地各种规模和阶段的公司，从产品推出前的初创公司到成熟的企业。每一项预期投资都将根据其加速实现零碳之路的潜力进行评判，并帮助为子孙后代保护地球。“。\n气候承诺旨在提前10年实现《巴黎气候变化协定》的目标。\n亚马逊去年的声明是在亚马逊员工争取气候正义组织(Amazon Employees For Climate Justice)向公众施压的情况下发布的，该组织敦促该公司在气候变化问题上设定更具体的目标。贝佐斯在宣布这一承诺时表示，该公司“在这个问题上已经不再处于同流合污的状态了。”\n亚马逊今天还发布了2019年可持续发展报告，并表示到2025年将100%使用可再生能源，比之前的目标提前了五年。\n本月早些时候，电信巨头威瑞森(Verizon)、科技巨头印孚瑟斯(Infosys)以及莱索尔(Lysol)和卡尔贡母公司利洁时(Reckitt Benckier)成为首批加入亚马逊气候承诺的全球公司。\n亚马逊表示，它将寻求让“其他气候承诺签署国”参与该基金的投资。\n今年4月，亚马逊推出了一项1000万美元的赠款计划，旨在帮助家庭森林所有者保护他们的土地，并参与碳信贷市场。这是亚马逊1亿美元气候基金的第一笔捐款，该基金是气候承诺倡议的一部分。\n今年2月，贝佐斯启动了自己的100亿美元贝佐斯地球基金(Bezos Earth Fund)，该基金将发放旨在应对气候变化的赠款。\n今年1月，微软宣布计划到2030年实现碳负值，从环境中移除的碳比每年排放的碳更多，并表示计划到2050年消除足够的碳，以弥补自45年前成立以来的所有排放和电力消耗。\nGeekWire Space&amp；Science-获奖航空航天和科学编辑艾伦·博伊尔(Alan Boyle)每周头条", "note_en": "Amazon on Tuesday launched  The Climate Pledge Fund, a new venture capital investment program that will funnel an initial $2 billion into startups building sustainable technologies across various industries such as transportation, food, manufacturing, and more.\n The fund is part of Amazon’s Climate Pledge  announced by the tech giant last year as the company promised to become net carbon neutral by 2040.\n “The Climate Pledge Fund will look to invest in the visionary entrepreneurs and innovators who are building products and services to help companies reduce their carbon impact and operate more sustainably,” Amazon CEO Jeff Bezos said in a statement. “Companies from around the world of all sizes and stages will be considered, from pre-product startups to well-established enterprises. Each prospective investment will be judged on its potential to accelerate the path to zero carbon and help protect the planet for future generations.”\n  The Climate Pledge aims to meet the goals of the Paris Agreement on climate change 10 years ahead of schedule.\n Amazon’s announcement last year came amid public pressure from the group  Amazon Employees for Climate Justice, which urged the company to set more specific goals on climate change.  Bezos said in announcing the pledge that the company was “done being in the middle of the herd on this issue.”\n Amazon today also released its  2019 sustainability report and said it would run on 100% renewable energy by 2025, five years ahead of its previous goal.\n Earlier this month telecom giant  Verizon, tech powerhouse  Infosys, and Lysol and Calgon parent Reckitt Benckiser (RB)  became the first global companies to join Amazon in the Climate Pledge.\n  Amazon said it will look to involve “other Climate Pledge signatories” for the fund’s investments.\n This past April Amazon  launched a $10 million grant program designed to help family forest owners conserve their land and participate in carbon credit markets. It was the first donation from Amazon’s $100 million Right Now Climate Fund, part of the Climate Pledge initiative.\n    Bezos in February  launched his own $10 billion Bezos Earth Fund that will issue grants aimed at addressing climate change.\n  In January,  Microsoft announced that it intends be carbon negative by 2030, removing more carbon from the environment than it emits each year, and said it plans to remove enough carbon by 2050 to make up for all of its emissions and electrical consumption since its founding 45 years ago.\n      GeekWire Space &amp; Science - Weekly headlines from Alan Boyle, award-winning aerospace and science editor", "posttime": "2020-06-23 23:52:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,持续,unveils", "title": "亚马逊公布20亿美元基金投资初创企业打造可持续技术", "title_en": "Amazon Unveils $2 Billion Fund To Invest in Startups Building Sustainable Technology", "transed": 1, "url": "https://www.geekwire.com/2020/amazon-unveils-2-billion-fund-invest-startups-building-sustainable-technology/", "via": "", "real_tags": ["amazon", "亚马逊", "持续", "unveils"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开始选择一些内置样式，然后使用侧栏中提供的各种样式控件自己定制它们。\nUI中提供了所有功能，但有一套全面的键绑供高级用户使用。很快，绑定就可以自定义了。\n以英寸或厘米为单位设置真实世界的网格大小，您就可以导出一个大小合适的PDF，将地下城分布在多个页面上。您可以根据自己的喜好定制页边距和纸张大小。\n由于文件名中每个单元格的像素和网格尺寸可自定义，因此导出地图以在现有的VTT(如Roll20)中使用非常容易。\n使用TSV导入，您可以使用Donjon：随机地下城生成器生成一个地下城，导入到地下城涂鸦，然后在此基础上进行构建、编辑和导出。\n从两分钟桌面导入这样的资源来填充您的地下城。设置每个单元格的像素，它们将自动缩放以适合地图。很快就会有一个包含在该工具中的图像库。\n从选择的笔刷和工具中进行选择，从规则多边形到自动创建粗糙洞穴和隧道的笔刷。使用复制-粘贴和镜像工具可以轻松创建重复部分。\n为地下城区域和图像添加图层，并更改它们的不透明度和混合模式以获得有创意的效果。此示例以具有倍增混合模式的纸张纹理为特色。\n熟悉该工具后，可以使用此视图模式创建等轴测贴图。\n有多种内置字体可以为您的地下城添加标题和标签。您甚至可以构建符号并使用Unicode符号。", "note_en": "Get started with a selection of inbuilt styles, then customise them yourself using the various styles controls available in the sidebar.\n  Functionality is all available in the UI, but there&#39;s a comprehensive set of keybinds for power users. Soon, bindings will be customisable.\n  Set the real-world grid size in inches or cm, and you can export a properly-scaled PDF that spreads the dungeon over multiple pages. You can customise the margins and paper size to your liking.\n  With customisable pixels per cell and grid dimensions in the filename, it&#39;s easy to export maps to use in existing VTTs such as Roll20.\n  With TSV import, you can generate a dungeon using  Donjon: Random Dungeon Generator, import into Dungeon Scrawl, then build upon, edit, and export it.\n  Import assets like these from  Two Minute Tabletop to populate your dungeons. Set the pixels per cell, and they&#39;ll automatically be scaled to fit the map. Soon there&#39;ll be a library of images included with the tool.\n  Pick from a selection of brushes and tools, from regular polygons to brushes that automatically make rough caves and tunnels. Use the copy-paste and mirror tools to easily create repeating sections.\n  Add layers for dungeon areas and images, and change their opacity and blend mode for creative results. This example features a paper texture with the &#39;multiply&#39; blend mode.\n  Once you have some familiarity with the tool, you can use this view mode to create isometric maps.\n   There are a variety of inbuilt fonts to add titles and labels to your dungeon. You can even build sigils and use unicode symbols.", "posttime": "2020-06-23 23:50:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地牢,scrawl", "title": "地牢涂鸦-在几分钟内创建旧的学校地图", "title_en": "Dungeon Scrawl – Create old school maps in minutes", "transed": 1, "url": "https://dungeonscrawl.com/", "via": "", "real_tags": ["地牢", "scrawl"]}, {"category": "", "categoryclass": "", "imagename": "9e1f6f830cdcd2ba704157206a7f27c4.jpg", "infoid": 1007815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "免责声明：我不是医学专业人士，这不是医学建议。这篇帖子是对我个人经历的总结，也是我对其背后科学的最好理解。\n我女朋友问我是否有兴趣尝试一下模拟禁食饮食(FMD)。\n方法：1个FMD周期=连续5天限制进食(正常卡路里需要量的25-35%)。\n世卫组织：Valter Longo博士通过他的书“长寿饮食”和一系列临床研究(例如：(模仿禁食饮食和衰老、糖尿病、癌症和心血管疾病的标志物/风险因素)。\n研究论文中写道：“限制卡路里摄入或改变饮食结构可以促进健康衰老，但大多数受试者无法坚持长期和极端的饮食，以及潜在的不良影响，限制了它们的应用。”\n因此，隆戈博士开发出口蹄疫可以增加饮食的依从性/成功率，同时允许身体激活自噬。\n自噬“是细胞的一种自然的、受调控的机制，它可以清除不必要的或功能失调的成分。”\n酮病是一种代谢状态，其特征是血液或尿液中酮体水平升高。[1]生理性酮病是对低糖供应的正常反应，如低碳水化合物饮食或禁食，它以酮的形式为大脑提供额外的能量来源。[1]生理性酮病是对低糖供应的正常反应，如低碳水化合物饮食或禁食，以酮的形式为大脑提供额外的能量来源。\n在最佳条件下，你的身体会在口蹄疫期间切换到营养酮症，从可用的资源中产生能量。\n口蹄疫是一种复杂的饮食，因为它的组件是相互关联的，误差幅度很小：\n测量如果你想知道实际发生了什么，饮食是否有效，你需要测量。\n我们决定制定我们自己的用餐计划，因为它更便宜，而且可以说更美味。我们在Google工作表中预先计划了我们的用餐(您可以复制工作表并创建/使用/编辑您自己的版本)。\n配料：配料及其营养价值一览表。此表用于将数据输入到用餐计划中。\n饮食计划：对于每一天的饮食，我们都会想出一个食谱(见下面的gif)，以尽可能接近卡路里/营养目标值。\n测量：记录测量的纸张。在我们的案例中，数据主要来自我们的智能秤、血糖测量设备和一套酮条。\n因为我们是两个人，所以我们在每天的餐饮计划表上都有我们的目标值。在为我们的卡路里/营养目标的∑准备好膳食计划后，我们将按照相对百分比将食物分开，并相应地称重/分配。\n蔬菜炖菜/汤：易于批量准备。大量的食物/体积，但卡路里含量低。\n蔬菜沙拉：菠菜+西兰花+鳄梨+调味汁//有助于改变口味。\n我们根据FMD添加了omega-3鱼油、镁、绿色超级食品粉和甘油。\n如果你不想“盲目飞行”，你应该测量某些指标，以量化衡量你的饮食是否成功(或缺乏)。\n智能秤：体重；体脂百分比；内脏脂肪；瘦体重等等。//总的来说，我们的秤似乎不是百分之百精确的，因为体脂似乎是体重的函数，但至少你可以得到一个方向正确的指标。\n酮条：显示您的尿中酮水平是否超过0.5 mmol/l-如果是这样，则意味着您进入了营养性酮症。\n因为我们想避免每周工作期间的能量下降，所以我们决定在周六开始5天的周期。\n我开始有轻微但持续的头痛，这很可能是由咖啡因的戒断引起的。通常我每天喝1-2杯过滤咖啡。\n在节食期间，我们改喝茶(Rooibos茶；草药茶)和无咖啡因咖啡。将无咖啡因咖啡与MCT/椰子油和少量海盐混合，尝起来就像防弹咖啡。至少你有一个美味的替代品来代替真正的东西。\n我们注意到，在最初的48小时内，能量逐渐下降。常规任务(内务、做饭等)。很容易，但任何涉及体力活动的事情(长时间的步行、爬楼梯等)。显然要困难得多。我们决定呆在家里，看电视节目，放松一下。\n在节食36-48小时后，我们都注意到明显的变化。我们感觉更专注了，不那么饿了，也不那么累了。\n根据我们的酮体水平，我们已经进入了营养酮症。但总而言之，我们感觉比预期的要好得多，我们并没有真的有疯狂的食物渴望。\n节食之后，你应该从肉汤和简单的食物(意大利面、土豆等)开始。不让你的消化系统超载。\n坚持节食：我发现和别人一起做口蹄疫很有帮助。它会激励你，帮助你坚持计划。\n短期好处：我们两人都记录了一些体重减轻，从心理角度来看，这是一项有趣的运动。\n下一轮的学习：下一次我们将在口蹄疫前后做血液检查，以评估对其他健康标志物的影响。\n既然我们都很健康，口蹄疫的建议是每年做1-2个周期。我们可以想象自己每年一月都会这么做--在假期之后，甚至在夏天的某个时候。\n它很容易/足够短，可以经常做这件事。我们会再做一次的。\nValter Longo博士关于禁食、长寿、癌症和多发性硬化症的禁食：朗达·帕特里克博士采访。很好的口蹄疫底漆。\n蒂姆·费里斯秀文字稿：多姆·达戈斯蒂诺-生酮饮食的力量(#172)：生酮饮食的坚实介绍。不是专门关于口蹄疫的。\n模仿禁食模仿饮食-我的5天实验：DIY FMD工具和资源的很好参考。", "note_en": "Disclaimer: I’m not a medical professional and this is  not medical advice. This post is a summary of my personal experience and my best understanding of the science behind it.\n   My girlfriend asked me if I’d be interested to try the Fasting-Mimicking Diet  (FMD).\n         How: 1 FMD cycle = 5 consecutive days of restricted feeding  (25-35% of normal calorie needs)\n  Who: Popularized by  Dr. Valter Longo via his book  ‘The Longevity Diet’ and a series of clinical studies (e.g.   “Fasting-mimicking diet and markers/risk factors for aging, diabetes, cancer, and cardiovascular disease”)\n  From the research paper:  “Calorie restriction or changes in dietary composition can enhance healthy aging, but the inability of most subjects to adhere to chronic and extreme diets, as well as potentially adverse effects, limits their application.”\n As a result Dr. Longo developed FMD increase adherence/success of the diet, while allowing the body to activate autophagy.\n  Autophagy  ‘is the natural, regulated mechanism of the cell that removes unnecessary or disfunctional components.’\n   Ketosis is a metabolic state characterized by elevated levels of ketone bodies in the blood or urine.[1] Physiologic ketosis is a normal response to low glucose availability, such as low-carbohydrate diets or fasting, that provides an additional energy source for the brain in the form of ketones.\n Under optimal conditions, your body will switch to nutritional ketosis during FMD to generate energy from available resources.\n    FMD is a  complex diet, since its components are interconnected and have a small margin of error:\n Measurement If you want to know what is actually going on and if the diet is effective you need to measure\n     We decided to create our own meal plan, since it was cheaper and arguably tastier. We pre-planned our meals in a  google sheet  (you can copy the sheet and to create/use/edit your own version).\n  Ingredients: List of ingredients and their nutritional values. This sheet is used to feed data into the meal plans.\n Meal plans: For each day of the diet we would come up with a recipe  (see gif below) to arrive as close as possible at the caloric/nutritional target values.\n Measurements: Sheet to record measurements. In our case it was primarily data from our smart scale, the glucose measuring device, and a set of ketone strips.\n  Since we were 2 people we had both of our target values on each day’s meal planning sheets. After preparing a meal plan for the ∑ of our caloric/nutritional targets we would split the food out by the relative percentages and weigh/distribute it accordingly.\n    Vegetable Stews/Soups: Easy to prepare in batch. Large amount of food/volume while low in calories.\n   Vegetable Salads: Spinach + Broccoli + Avocado + Dressing // Helps to change up the taste palette.\n We supplemented omega-3 fish oil, magnesium, green superfood powder, and  glycerol in accordance with FMD.\n  If you don’t want to  ‘fly blindly’ you should measure certain markers to get a quantifiable measure of your diet’s success  (or lack thereof).\n  Smart scale: Body weight; body fat %; visceral fat; lean body mass; etc. // Overall it feels like the scale we have is not 100% precise since body fat seems to be a function of body weight, but at least you can get a directionally-correct indicator.\n  Ketone strips: Shows if ketone levels in your urine exceed 0.5 mmol/l – if so, it means you entered into nutritional ketosis.\n  Since we wanted to avoid an energy dip during the work week we decided to start the 5-day cycle on a Saturday.\n       I started having a mild but persistent headache, which was most likely caused by caffeine withdrawal. Usually I drink 1-2 cups of filter coffee per day.\n During the diet we switched over to tea  (rooibos tea; herbal teas) and decaf coffee. Mix decaf coffee with MCT/Coconut oil and a pinch of sea salt and it tastes like a bullet-proof coffee. At least you have a tasty substitute for the real thing.\n  We noticed a gradual decline in energy over the course of the first 48 hours. Regular tasks  (housekeeping; cooking; etc.) was easy but anything involving physical activity  (extended walks; climbing stairs; etc.) was noticeably more difficult. We decided to stay in, watch TV shows, and take it easy.\n   At around 36-48 hours into the diet both of us noticed a clear shift. We felt more focused, less hungry, less tired.\n According to our ketone levels we had entered nutritional ketosis. All in all it felt much bette than expected and we didn’t really have crazy food cravings.\n    After the diet you are supposed to start easy with broths and simple foods  (pasta; potatoes; etc.) to not overload your digestive system.\n   Adherence to diet: I found it helpful to do FMD with someone else. It motivates you and helps you stick to the plan.\n Short-term benefits: Both of us recorded some weight loss and it is an interesting exercise from a mental perspective.\n Learnings for next round: Next time around we will do blood work before and after FMD to evaluate impact on additional health markers.\n Since both of us are healthy the recommendation for FMD would be to do 1-2 cycles per year. We can see ourselves doing it each January – after holiday season and at some point during the summer.\n It’s easy/short enough to do it on a regular basis. We will do it again.\n   Valter Longo, Ph.D. on the Fasting-Mimicking Diet &amp; Fasting for Longevity, Cancer &amp; Multiple Sclerosis: Interviewed by Dr. Rhonda Patrick. Good primer for FMD.\n  The Tim Ferriss Show Transcripts: Dom D’Agostino — The Power of the Ketogenic Diet (#172): Solid introduction into the Ketogenic diet. Not specifically about FMD.\n  Mimicking the Fasting Mimicking Diet – My 5-Day Experiment: Good reference for tools and resources for DIY FMD.", "posttime": "2020-06-23 23:48:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模仿,health,饮食", "title": "为健康而挨饿：模仿禁食的饮食", "title_en": "Starving to Health: Fasting-Mimicking Diet", "transed": 1, "url": "https://artlapinsch.com/2020/06/23/starving-to-health-fasting-mimicking-diet/", "via": "", "real_tags": ["模仿", "health", "饮食"]}, {"category": "", "categoryclass": "", "imagename": "2b59e37b909ec7a7690ce1a37cc8327d.jpg", "infoid": 1007814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一个调查滥用权力的非营利性新闻编辑室。注册后即可收到我们最重要的新闻。\n去年万圣节，我的妻子和当时6岁的女儿在布鲁克林玩完“不给糖就捣蛋”后回家。突然，一辆响起警笛的没有标志的纽约警车开始在我们街区的主干道单行道上超速行驶。这位警官似乎在追杀几个十几岁的男孩。\n这是我的家人那天晚上看到纽约警察局做的许多令人不快的事情中的第一件。之后，我试着了解更多关于究竟发生了什么，以及警察是否会受到纪律处分的更多情况。有录像和大量目击者，而我碰巧是一名调查记者。我以为我至少有机会得到答案。相反，这一事件明确了纽约警察局逃避责任的所有方式。\n这发生在我的社区，卡罗尔花园，那里绝大多数是白人。居民们在20世纪60年代将它命名为红钩，以区别于附近的红钩，那里的人口主要是黑人。几十年来，这个地区发生了巨大的变化。但即使是现在，它几乎是一个街区一个街区地隔离。\n万圣节是让它看起来像一个综合社区的一天。有很多门廊和店面，总有很多糖果可吃。从整个地区来的孩子们都是为了收获。\n警方说，那天晚上，一群十几岁的男孩在附近的操场上拳打脚踢另一名青少年，并偷走了他的手机。这名少年招呼了一名警官，并被驱车在附近四处寻找男孩。他指出了一群人，警察从不同的方向下来。一辆车在车流中飞驰，直到撞到一个孩子；男孩滑过引擎盖，撞到地上，然后突然出现，和其他人一起逃跑了。", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  Last Halloween, my wife and then-6-year-old daughter were making their way home after trick-or-treating in Brooklyn. Suddenly, an unmarked NYPD car with sirens wailing began speeding against traffic up a one-way street, our neighborhood’s main thoroughfare. The officer seemed to be going after a few teenage boys.\n    It was the first of many jarring things my family saw the NYPD do that night. Afterward, I tried to find out more about what exactly had happened and whether officers would be disciplined. There was footage and plenty of witnesses, and I happen to be an investigative journalist. I thought there was at least a chance I could get answers. Instead, the episode crystallized all of the ways in which the NYPD is shielded from accountability.\n  This happened in my neighborhood, Carroll Gardens, which is overwhelmingly white. Residents named it that in the 1960s to distinguish it from nearby Red Hook, where the population was largely Black. The area has changed enormously over the decades. But even now, it’s segregated almost block by block.\n  Halloween is the one day that it can  seem like an integrated neighborhood. With lots of stoops and storefronts, there’s always plenty of candy to be had. Kids from the whole area come for the haul.\n  The police said a group of teenage boys that night had punched and kicked another teenager at a nearby playground and stolen his cellphone. The teen flagged down an officer and was driven around the neighborhood looking for the boys. He pointed out a group, and police descended from different directions. One car sped against traffic until it hit a kid; the boy slid over the hood, hit the ground, and then popped up and ran away along with the others.", "posttime": "2020-06-23 23:30:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警局,impunity,纽约", "title": "我家人看到一辆警车撞上了一个孩子。然后我了解了纽约警局是如何逍遥法外的", "title_en": "My Family Saw a Police Car Hit a Kid. Then I Learned How NYPD Impunity Works", "transed": 1, "url": "https://www.propublica.org/article/my-family-saw-a-police-car-hit-a-kid-on-halloween-then-i-learned-how-nypd-impunity-works", "via": "", "real_tags": ["警局", "impunity", "纽约"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007813, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我很幸运。如果我那天没有赢得互联网关注彩票，我们可能已经关机了，让我们的用户陷入了一个日常生活所依赖的无人维护的工具的困境中。数以千计的残疾人的网页可访问性的命运，以及我们的业务掌握在一个犯了错误的无名看门人手中。\n这个故事听起来可能耳熟能详。简而言之：我们的Chrome扩展被撤下是因为它被认为不符合政策。在经历了大量的开发工作，无数次失败的重新提交，以及一周没有沟通的情况下，我们从商店退市-我们在Reddit上大声抱怨。注意到我们的帖子后，某个拥有Chrome网络商店内部访问权限的人在Twitter上联系了我们，他们说这是个错误，并表示道歉。我们重新提交，并在当天晚些时候恢复。\n在互联网上抱怨不应该是一种支持渠道。开发商不应该依赖互联网关注彩票。Chrome网络商店已经有大约10年的历史了，需要重新行动起来。在LipSurf，我们希望利用我们的临时关注点特权来改进系统，并帮助其他扩展开发者。\n首先，我们非常感谢毫不含糊的英雄@DotProto。他不仅救了我们，最近还救了PushBullet等人。此外，他在空闲时间做这件事。\n虽然@dotproto说cws正在努力改进内部，但如果我们袖手旁观，只是等待 ， 的希望，那将是愚蠢的。这个问题显然是系统性的，CWS论坛上到处都是求救的呼声，我们的Reddit帖子里满是“我也是”的故事。\n因此，我们今天成立了一个Chrome扩展开发者小组，与CWS合作。它不是一个技术支持渠道，也不是一个在CWS反应迟钝时引起注意的平台。它是Chrome扩展开发者团结在一起讨论改善我们所站的基础的地方(它也不会被谷歌托管或管理)。\n这将打破扩展的围墙花园，给扩展开发者一个更公平的竞争环境，并降低因CWS的突发奇想而被消灭的风险。\n对出版商和CWS来说，只有一般政策信息的关于拒绝的预装电子邮件都是“双输”的。双方都在浪费时间，因为目前 - 涉及的所有猜测工作都很繁琐，尤其是当CWS犯了错误的时候。\n我们需要从今天开始建立我们的防御和建立关系。如果我们不团结起来，一起说话，我们将永远无能为力，任由我们的守门人摆布。我们还向CWS员工和@DotProto等扩展倡导者开放我们的论坛。毕竟，我们不想彼此对立-一个好的平台应该与我们合作，而不是反对我们。\n如果您是一名扩展开发人员，或者认识任何扩展开发人员，请通过填写下面的表格与我们分享或加入我们。一旦我们知道有足够的兴趣，我们就计划开放这个论坛。\n开始培养意识。我们将争取其他开发人员和最终用户的支持。一个极端的例子可能是协调的a Chrome延长停电日期。一个不那么极端的例子是作为一个团队提出想法，而不是作为个人向Google Chrome提出想法，这将改善扩展的体验(例如。改进的权限)。\n如果第三方扩展商店是可能的，他们将可以自由设置自己的障碍-金钱或其他方面。第三方扩展商店很有可能在拦截恶意扩展方面比谷歌做得更好。", "note_en": "I got lucky. If I didn’t win the  internet attention lottery that day, we may have shutdown and left our users stranded with an unmaintained tool that their daily lives depend on. The fate of web accessibility for thousands of people with disabilities, and our business lie in the hands of a single faceless gatekeeper who made a mistake.\n The story may sound familiar. In short: our Chrome Extension was taken down because it supposedly didn&#39;t meet policy. After lots of development work, numerous failed resubmissions, and a week delisted from the store without communication – we complained loudly on  Reddit. Noticing our post, someone with internal access to the Chrome Webstore reached out to us on  Twitter, they said that it was a mistake and apologized. We resubmitted and were restored later that day.\n Complaining on the internet should not be a support channel. Developers should not have to rely on the internet attention lottery. The Chrome Webstore has been around 10 years and needs to get its act together. We, at  LipSurf, want to use our temporary position of attention privilege to improve the system and help other extension developers.\n Firstly, we are very thankful to the unequivocal hero,  @DotProto. He not only saved  us, but has saved  PushBullet recently, among others. Furthermore, he does it in  his free time.\n Although  @DotProto says CWS is working to  improve internally, it would be foolish for us to stand on the sidelines, just waiting ,  hoping. The issues are clearly systemic, as cries for help  litter the CWS forums, and our Reddit post was  full  of  “me too”  stories.\n  Therefore, we are starting a group today for Chrome Extension developers to work together in check with CWS. It&#39;s not a technical support channel, nor a platform to get attention when CWS is unresponsive. It&#39;s a place for Chrome Extension developers to rally together and discuss improving the foundation we stand on (it also won&#39;t be hosted nor managed by Google).\n   This would break down the walled garden of extensions, give extension developers a leveler playing field, and lower the risk of getting wiped out on CWS&#39;s whim.\n  Canned emails about rejections with only general policy information are “lose-lose” for publishers and CWS alike. Both parties waste time because of all the guesswork involved currently — especially when CWS makes a mistake.\n  We need to start building our defenses and forging relationships today. If we don’t unite and speak together, we will forever be powerless and at the mercy of our gatekeeper. We also open our forum to CWS staff, and extension advocates like  @DotProto. We don’t want to work against each other, after all – a good platform should  work   with us  not   against us.\n If you are a extension developer, or know any extension developers, please share or start by joining us by filling out the form below. We plan to open the forum once we know that there&#39;s enough interest.\n   Building awareness to start. We will rally support from other developers and end users alike. One extreme example could be a coordinated a Chrome Extension blackout date. A less extreme example would be proposing ideas as a group, instead of as individuals to Google Chrome that would improve the experience for extensions (eg. improved permissions).\n  If 3rd party extension stores were possible, they would be free to setup their own barriers – monetary or otherwise. It&#39;s very possible for a 3rd party extension store to do a  better job  than Google at blocking malicious extensions.", "posttime": "2020-06-23 23:29:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,ii,扩展", "title": "第二部分：工作3年后，Chrome终止了我的扩展，并且不告诉我为什么", "title_en": "Part II: After 3 years of work, Chrome killed my extension and won’t tell me why", "transed": 1, "url": "https://blog.lipsurf.com/part-ii-after-3-years-of-work-chrome-killed-my-extension-and-wont-tell-me-why/", "via": "", "real_tags": ["chrome", "ii", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-06-23 23:29:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "具有,blurry,创建", "title": "使模糊面孔具有照片真实感的效果仅限于此", "title_en": "Making Blurry Faces Photorealistic Goes Only So Far", "transed": 1, "url": "https://spectrum.ieee.org/tech-talk/computing/software/making-blurry-faces-photorealistic-goes-only-so-far", "via": "", "real_tags": ["具有", "blurry", "创建"]}, {"category": "", "categoryclass": "", "imagename": "807275f02b87f01e0bb9c9b4e87b2649.jpg", "infoid": 1007811, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿--周一，特朗普总统暂时暂停了新的工作签证，并禁止数十万外国人在美国寻找工作，这是限制移民进入美国的广泛努力的一部分。\n在一项至少将持续到今年年底的全面命令中，特朗普阻止了各种工作的签证，包括以H-1B签证进入美国的计算机程序员和其他熟练工人的签证，以及酒店业季节性工人、参加勤工俭学暑期项目的学生和在其他赞助下抵达的互助生的签证。\n该命令还限制了拥有全球业务的美国公司和在美国设有分支机构的国际公司将外国高管和其他员工转移到美国数月或数年的能力。它还阻止受雇于美国公司的外国人的配偶。\n官员们表示，禁止工人签证，加上延长对新绿卡发放的限制，将使多达52.5万名外国工人在今年剩余时间内无法入境。\n白宫助手、特朗普移民政策的设计者斯蒂芬·米勒(Stephen Miller)多年来一直在推动限制或取消工人签证，他认为这些签证损害了美国人的就业前景。近几个月来，米勒先生辩称，病毒造成的经济困境使得关闭水龙头变得更加重要。\n但这项期待了几周的指令遭到了商界领袖的强烈反对，他们表示，这将阻止他们从海外国家招聘急需的工人，从事美国人不愿做或没有能力履行的工作。\n科技公司支持的亲移民组织FWD.us的总裁托德·舒尔特(Todd Schulte)说，“这是对美国创新的全面攻击，也是对我们国家从吸引世界各地人才中获益的能力的全面攻击。”\n美国商会(U.S.Chamber of Commerce)首席执行官托马斯·J·多诺霍(Thomas J.Donohue)说，“给工程师、高管、IT专家、医生、护士和其他工人竖起‘不受欢迎’的牌子，无助于我们的国家，只会阻碍我们前进。”“对我们国家移民制度的限制性改变将推动海外投资和经济活动，减缓增长并减少创造就业机会.”\n政府官员表示，总统的命令不会影响已经拥有有效签证的美国以外的人或季节性农场工人，过去15年，他们的年人数从最低的约5万人到最高的约25万人不等。官员们说，某些专门从事冠状病毒研究的医务人员也将是一个狭窄的例外。\n这项命令将禁止来美国照顾儿童的互助者，尽管官员们最初告诉记者，他们将被豁免。后来，两名高级政府官员表示，家长可以根据具体情况寻求禁令的豁免，但不能保证他们会获得批准。\n在命令中，特朗普将暂停签证描述为确保美国人优先获得稀缺工作的一种方式--移民倡导者称，这一断言没有反映出劳动力充满活力和不断变化的现实。\n特朗普在命令中写道，“在新冠肺炎疫情导致经济萎缩的特殊情况下，某些授权此类就业的非移民签证项目对美国工人的就业构成了不同寻常的威胁。”\n限制外国人进入美国的努力是总统在2016年竞选期间的一项关键承诺的核心，随着特朗普在今年的连任竞选期间寻求激励他的核心支持者，这一努力肯定会发挥核心作用。\n虽然总统承诺修建一堵“又大又美的墙”以防止非法越境已经引起了更多的关注，但他减缓合法移民流动的努力甚至更加有效，而且可能会持续很长时间。\n今年4月，总统签署了一项行政命令，在60天内暂停向大多数希望居住在美国的外国人发放绿卡。但当时，米勒和总统屈从于商界的压力，避免对工人签证施加限制。\n周一的命令除了暂停发放许多工人签证外，还延长了绿卡禁令。\n听到特朗普政府声音的移民限制人士对这一声明表示赞赏。结合最近的措施，“暂停工作签证将使劳动力市场的规模有利于美国工人，”倡导限制移民的移民研究中心的政策主管杰西卡·沃恩(Jessica Vaughan)说。\n“看到总统不遗余力地为这些签证项目游说的特殊利益集团挺身而出，真的很令人振奋，”沃恩说。她说，白宫助手经常就这个问题征求她的意见。\n除了暂停外，政府官员表示，特朗普正在指示政府对一系列移民法规进行永久性修改，以阻止他们所说的来自希望来到美国的外国人对美国工作岗位的不公平竞争。\n在这些变化中，将包括新的方法，以确保未来向收入最高的工人发放高技能签证，并防止公司与大量中层外国工人签订合同，让他们从事会计、编程和其他美国人可能能够从事的技术辅助工作。\n其他变化将旨在阻止移民申请庇护，以此作为在美国获得工作许可的一种方式。目前尚不清楚这些监管改革将于何时生效。\n政府可以尝试发布紧急规则来加快这些变化，而不是经历正常的过程，这可能需要几个月甚至几年的时间，因为在最终规则颁布之前，必须允许公众发表评论。\n但是，快速追踪针对外国工人的规则制定过程可能会招致反对者的法律挑战，他们认为政府没有遵守规则。上周，最高法院裁定，特朗普试图终止奥巴马时代的一个旨在保护年轻移民不被驱逐出境的项目，违反了《行政程序法》。\n移民律师、美国公民和移民局前首席法律顾问林登·梅尔梅德(Lynden Melmed)说，“政府可以尝试加快这一过程，不让公众在变化生效之前发表意见，但很难看到这个过程在法庭审查中幸存下来。”林登·梅尔梅德(Lynden Melmed)是一名移民律师，曾担任美国公民和移民局首席法律顾问。\n英国运动医学杂志(British Journal Of Sports Medicine)网站本月发表的一篇评论文章指出，运动时遮住脸“会带来潜在的呼吸受限和不适问题”，需要“权衡益处和可能的不良事件”。美国运动理事会(American Council On Exercise)主席兼首席科学官塞德里克·X·布莱恩特(Cedric X.Bryant)说，口罩确实会改变运动。美国运动理事会是一个非营利性组织，为运动研究提供资金，并为健身专业人士提供认证。“根据我的个人经验，”他说，“当你戴上口罩时，心率会在相同的相对强度下更高。”新墨西哥大学运动科学教授Len Kravitz说，有些人在戴着面具进行熟悉的锻炼时也会感到头晕目眩。\n根据英国科学家的说法，类固醇地塞米松是第一种被证明可以降低重病患者死亡率的治疗方法。这种药物似乎可以减少免疫系统引起的炎症，保护组织。在这项研究中，地塞米松使使用呼吸机的患者的死亡人数减少了三分之一，使用氧气的患者的死亡人数减少了五分之一。\n冠状病毒紧急救援方案给了许多美国工人带薪假期，如果他们因为病毒需要休假的话。它给合格的工人两周的带薪病假，如果他们生病，被隔离，或者寻求冠状病毒的诊断或预防性护理，或者如果他们正在照顾生病的家庭成员。它给那些照顾孩子的人12周的带薪假期，这些孩子的学校关闭了，或者因为冠状病毒而无法提供托儿服务。这是美国第一次有广泛的联邦授权带薪休假，包括通常不会获得这种福利的人，比如兼职和零工经济工作者。但这项措施至少排除了一半的私营部门员工，包括美国最大雇主的员工，并给予小雇主拒绝休假的巨大回旋余地。\n到目前为止，证据似乎表明确实如此。4月份发表的一篇被广泛引用的论文表明，人们在冠状病毒症状出现前两天左右传染性最强，并估计44%的新感染是由于尚未显示出症状的人传播的。最近，世界卫生组织的一位顶级专家表示，没有症状的人传播冠状病毒的情况“非常罕见”，但她后来收回了这一说法。\n接触受污染的物体，然后将细菌感染我们自己，这并不是典型的病毒传播方式。但这是有可能发生的。对流感、鼻病毒、冠状病毒和其他微生物的多项研究表明，包括新型冠状病毒在内的呼吸道疾病可以通过接触受污染的表面传播，特别是在日托中心、办公室和医院等地方。但是，要让这种疾病以这种方式传播，必须发生一系列漫长的事件。保护自己免受冠状病毒感染的最好方法--无论是表面传播还是密切的人类接触--仍然是社交距离、洗手、不碰脸和戴口罩。\n欧洲科学家的一项研究首次证明了基因变异和新冠肺炎(冠状病毒引起的疾病)之间存在强烈的统计联系。根据这项新的研究，拥有A型血的患者需要氧气或使用呼吸机的可能性增加了50%。\n美国劳工部6月5日表示，5月失业率降至13.3%，这是美国就业市场的意外改善，因为就业反弹的速度快于经济学家的预期。4月份失业率达到14.7%，是二战后政府开始记录官方统计数据以来的最高水平，经济学家此前预测失业率将增加到20%。但失业率反而下降，雇主在4月份失去了2000多万个工作岗位后，又增加了250万个工作岗位。\n各州正在一点一滴地重新开放。这意味着有更多的公共空间可供使用，越来越多的企业被允许重新开业。联邦政府在很大程度上把决定权留给了各州，一些州的领导人把决定权留给了地方当局。即使你没有被告知呆在家里，限制外出旅行和你与其他人的互动仍然是一个好主意。\n常见症状包括发烧、干咳、疲劳、呼吸困难或呼吸急促。这些症状中的一些与流感的症状重叠，使检测变得困难，但流鼻涕和鼻窦堵塞不太常见。疾控中心还增加了寒战、肌肉疼痛、喉咙痛、头痛和新的味觉或嗅觉丧失作为要注意的症状。大多数人在接触后五到七天就会生病，但症状可能会在短短两天或长达14天内出现。\n如果航空旅行是不可避免的，你可以采取一些措施来保护自己。最重要的是：勤洗手，不要再摸你的脸。如果可能的话，选择靠窗的座位。埃默里大学的一项研究发现，在流感季节，坐在飞机上最安全的地方是靠窗的，因为坐在靠窗座位的人与可能生病的人接触较少。对坚硬的表面进行消毒。当你坐到座位上，双手干净后，用消毒湿巾清洁座椅的硬表面，如头枕和扶手、安全带扣、遥控器、屏幕、座椅靠背口袋和托盘桌子。如果座椅很硬，不透气，或者是皮革或人造革的，你也可以把它擦干净。(在软垫座椅上使用湿巾可能会导致座椅湿润，传播细菌，而不是杀死他们。)。\n如果你接触过冠状病毒或认为自己感染了冠状病毒，并出现发烧或咳嗽或呼吸困难等症状，请打电话给医生。他们应该就你是否应该接受检测，如何检测，以及如何在不潜在感染或暴露他人的情况下求医给你提供建议。\n如果你生病了，你认为你已经接触了新的冠状病毒，疾控中心建议你打电话给你的医疗保健提供者，解释你的症状和恐惧。他们会决定你是否需要检查。请记住，有一种可能性--例如，因为缺乏检测工具，或者因为你没有症状--你可能无法接受检测。\n在大流行期间，特朗普政府以对公共卫生的威胁为借口，发布了一系列政策变化，几乎影响到移民系统的方方面面，包括庇护和绿卡。虽然许多变化已经被宣布为临时性的，但它们可能会无限期地保持不变。\n但批评人士说，政府利用健康危机及其造成的经济崩溃作为借口，实施限制措施，以推进其移民议程。\n虽然特朗普和他的助手表示，暂停签证是为了应对疫情，但多年来，政府一直在寻求同样广泛地减少合法移民政策，包括在失业率处于数十年来最低水平的时期。2017年，总统支持了参议院共和党法案“提高法案”(Raise Act)，该法案将把包括商务签证在内的合法移民削减约50%。\n在周一宣布这一消息之前的几周里，一个由企业和研究型大学组成的多元化联盟进行了激烈的游说，白宫充斥着信件和电话，试图限制行政命令的范围。\n康奈尔大学法学教授史蒂夫·耶尔-勒尔(Steve Yale-Loehr)说：“这是我从业35年来看到的最大规模的工作签证打击行动。”“数以千计的企业和大学将受到这些限制的伤害。同样，个人也会被困在海外，无法帮助美国经济复苏。“。\n但反对者未能阻止这些措施，他们认为这些措施对经济复苏适得其反。\n保守的卡托研究所(Cato Institute)移民研究主任亚历克斯·诺拉斯特(Alex Nowrasteh)说，“特朗普政府辩称，它希望建立一个基于功绩的移民制度，优先考虑受过教育的有技能的移民。”“随着H-1B签证计划的暂停，他们再次表明，他们真的想要更少的移民。”\n“这些移民禁令更多的是红肉，而不是基地的就业机会，”芝加哥美国商业移民联盟的丽贝卡·施(Rebecca Shih)说。“他们甚至不为特朗普自己的商业利益服务。”\n特朗普曾使用H-2B签证为他的度假村雇佣季节性员工，让他们担任厨师和服务员。", "note_en": "WASHINGTON — President Trump on Monday temporarily suspended new work visas and barred hundreds of thousands of foreigners from seeking employment in the United States, part of a broad effort to limit the entry of immigrants into the country.\n In a sweeping order, which will be in place at least until the end of the year, Mr. Trump blocked visas for a wide variety of jobs, including those for computer programmers and other skilled workers who enter the country under the H-1B visa, as well as those for seasonal workers in the hospitality industry, students on work-study summer programs and au pairs who arrive under other auspices.\n The order also restricts the ability of American companies with global operations and international companies with U.S. branches to transfer foreign executives and other employees to the United States for months or yearslong stints. And it blocks the spouses of foreigners who are employed at companies in the United States.\n Officials said the ban on worker visas, combined with extending restrictions on the issuance of new green cards, would keep as many as 525,000 foreign workers out of the country for the rest of the year.\n Stephen Miller, the White House aide and the architect of Mr. Trump’s immigration policy, has pushed for years to limit or eliminate the worker visas, arguing that they harm employment prospects for Americans. And in recent months, Mr. Miller has argued that the economic distress caused by the virus has made it even more important to turn off the spigot.\n But the directive, which has been expected for several weeks, is fiercely opposed by business leaders, who say it will block their ability to recruit critically needed workers from countries overseas for jobs that Americans are not willing to do or are not capable of performing.\n “This is a full-frontal attack on American innovation and our nation’s ability to benefit from attracting talent from around the world,” said Todd Schulte, the president of FWD.us, a pro-immigration group supported by technology companies.\n “Putting up a ‘not welcome’ sign for engineers, executives, IT experts, doctors, nurses and other workers won’t help our country, it will hold us back,” said Thomas J. Donohue, the chief executive of the U.S. Chamber of Commerce. “Restrictive changes to our nation’s immigration system will push investment and economic activity abroad, slow growth and reduce job creation.”\n Administration officials said the president’s order would not affect people outside the United States who already have valid visas or seasonal farm workers, whose annual numbers have ranged from a low of about 50,000 to a high of about 250,000 in the past 15 years. There will also be a narrow exception for certain medical workers dealing specifically with coronavirus research, officials said.\n  The order will ban au pairs who come to the United States to care for children, though officials initially told reporters they would be exempt. Later, two senior administration officials said parents could seek waivers to the ban on a case-by-case basis, with no assurance that they would be approved.\n  In the order, Mr. Trump described suspension of the visas as a way to ensure that Americans are first in line for scarce jobs — an assertion that immigration advocates say does not reflect the reality of a dynamic and changing work force.\n “Under the extraordinary circumstances of the economic contraction resulting from the Covid-19 outbreak, certain nonimmigrant visa programs authorizing such employment pose an unusual threat to the employment of American workers,” Mr. Trump wrote in the order.\n The effort to restrict entry from foreigners into the United States was at the heart of one of the president’s key promises during the 2016 campaign and is certain to play a central role as Mr. Trump seeks to energize his core supporters during his re-election campaign this year.\n While the president’s pledge to build a “big, beautiful wall” to prevent illegal border crossings has attracted more attention, his efforts to slow down the flow of legal immigration have been even more effective and potentially long-lasting.\n In April, the president signed an executive order that  suspended for 60 days the issuance of green cards to most foreigners looking to live in the United States. But at the time, Mr. Miller and the president bowed to pressure from the business community to avoid imposing limits on the worker visas.\n Monday’s order extends the green-card prohibition in addition to suspending the issuance of many of the worker visas.\n Immigration restrictionists who have had the ear of the Trump administration applauded the announcement. Combined with recent measures, “the work visa suspensions will put the thumb on the labor market scale in favor of U.S. workers,” said Jessica Vaughan, the policy director at the Center for Immigration Studies, which advocates curbing immigration.\n “It’s really heartening to see the president stand up to the special interests that pull out the stops to lobby for these visa programs,” said Ms. Vaughan, who said she had been regularly consulted by White House aides on the issue.\n In addition to the temporary suspensions, administration officials said Mr. Trump was directing the government to make permanent changes to a broad array of immigration regulations in order to discourage what they said was unfair competition for American jobs from foreigners looking to come to the United States.\n Among those changes will be new methods of ensuring that high-skill visas in the future are awarded to the highest-paid workers and of preventing companies from contracting large numbers of midlevel foreign workers to perform accounting, programming and other technology-assisted jobs that Americans might be able to do.\n Other changes would be aimed at discouraging immigrants from applying for asylum as a way of obtaining a work permit in the United States. It was unclear when those regulatory changes would go into effect.\n The administration could try to issue emergency rules to expedite such changes rather than go through the normal process, which can take months or even years because the public must be allowed to comment before a final rule is enacted.\n But fast-tracking the rule-making process on foreign workers could invite legal challenges from opponents who say the administration did not follow the rules. Last week,  the Supreme Court ruled that Mr. Trump violated the Administrative Procedure Act when he tried to terminate an Obama-era program aimed at protecting young immigrants from deportation.\n “The government could try and fast-track that process by not allowing the public to weigh in on the changes before they go into effect, but it is difficult to see that process surviving court review,” said Lynden Melmed, an immigration lawyer and the former chief counsel of the U.S. Citizenship and Immigration Services.\n A  commentary published this month on the website of the British Journal of Sports Medicine points out that covering your face during exercise “comes with issues of potential breathing restriction and discomfort” and requires “balancing benefits versus possible adverse events.”  Masks do alter exercise, says Cedric X. Bryant, the president and chief science officer of the American Council on Exercise, a nonprofit organization that funds exercise research and certifies fitness professionals. “In my personal experience,” he says, “heart rates are higher at the same relative intensity when you wear a mask.” Some people also could experience lightheadedness during familiar workouts while masked, says Len Kravitz, a professor of exercise science at the University of New Mexico.\n  The steroid, dexamethasone, is  the first  treatment shown to reduce mortality in severely ill patients, according to scientists in Britain. The drug appears to reduce inflammation caused by the immune system, protecting the tissues. In the study, dexamethasone reduced deaths of patients on ventilators by one-third, and deaths of patients on oxygen by one-fifth.\n  The coronavirus emergency relief package gives many American workers paid leave if they need to take time off because of the virus. It gives qualified workers two weeks of paid sick leave if they are ill, quarantined or seeking diagnosis or preventive care for coronavirus, or if they are caring for sick family members. It gives 12 weeks of paid leave to people caring for children whose schools are closed or whose child care provider is unavailable because of the coronavirus.  It is the first time the United States has had widespread federally mandated paid leave, and includes people who don’t typically get such benefits, like part-time and gig economy workers. But  the measure excludes at least half of private-sector workers, including those at the country’s largest employers, and gives small employers significant leeway to deny leave.\n  So far, the evidence seems to show it does. A widely cited  paper published in April suggests that people are most infectious about two days before the onset of coronavirus symptoms and estimated that 44 percent of new infections were a result of transmission from people who were not yet showing symptoms. Recently, a top expert at the World Health Organization stated that transmission of the coronavirus by people who did not have symptoms was “very rare,”  but she later walked back that statement.\n  Touching contaminated objects and then infecting ourselves with the germs is not typically how the virus spreads. But it can happen. A number  of studies of flu, rhinovirus, coronavirus and other microbes have shown that respiratory illnesses, including the new coronavirus, can spread by touching contaminated surfaces, particularly in places like day care centers, offices and  hospitals. But a long chain of events has to happen for the disease to spread that way. The best way to protect yourself from coronavirus — whether it’s surface transmission or close human contact — is still social distancing, washing your hands, not touching your face and wearing masks.\n  A study by European scientists is the first to document a strong statistical link between  genetic variations and Covid-19, the illness caused by the coronavirus.  Having Type A blood was linked to a 50 percent increase in the likelihood that a patient would need to get oxygen or to go on a ventilator, according to the new study.\n  The unemployment rate fell to 13.3 percent in May, the Labor Department said on June 5, an unexpected improvement in the nation’s job market as hiring rebounded faster than economists expected. Economists had forecast the unemployment rate to increase to as much as 20 percent, after it hit 14.7 percent in April, which was the highest since the government began keeping official statistics after World War II. But the unemployment rate dipped instead, with employers adding 2.5 million jobs, after more than 20 million jobs were lost in April.\n  States are reopening bit by bit. This means that more public spaces are available for use and more and more businesses are being allowed to open again. The federal government is largely leaving the decision up to states, and some state leaders are leaving the decision up to local authorities. Even if you aren’t being told to stay at home, it’s still a good idea to limit trips outside and your interaction with other people.\n  Common symptoms  include fever, a dry cough, fatigue and difficulty breathing or shortness of breath. Some of these symptoms overlap with those of the flu, making detection difficult, but runny noses and stuffy sinuses are less common.  The C.D.C. has also added chills, muscle pain, sore throat, headache and a new loss of the sense of taste or smell as symptoms to look out for. Most people fall ill five to seven days after exposure, but symptoms may appear in as few as two days or as many as 14 days.\n  If air travel is unavoidable,  there are some steps you can take to protect yourself. Most important: Wash your hands often, and stop touching your face. If possible, choose a window seat. A  study from Emory University found that during flu season, the safest place to sit on a plane is by a window, as people sitting in window seats had less contact with potentially sick people. Disinfect hard surfaces. When you get to your seat and your hands are clean, use disinfecting wipes to clean the hard surfaces at your seat like the head and arm rest, the seatbelt buckle, the remote, screen, seat back pocket and the tray table. If the seat is hard and nonporous or leather or pleather, you can wipe that down, too. (Using wipes on upholstered seats could lead to a wet seat and spreading of germs rather than killing them.)\n  If you’ve been exposed to the coronavirus or think you have, and have a fever or symptoms like a cough or difficulty breathing, call a doctor. They should give you advice on whether you should be tested, how to get tested, and how to seek medical treatment without potentially infecting or exposing others.\n  If you’re sick and you think you’ve been exposed to the new coronavirus,  the C.D.C. recommends that you call your healthcare provider and explain your symptoms and fears. They will decide if you need to be tested. Keep in mind that there’s a chance — because of a lack of testing kits or because you’re asymptomatic, for instance — you won’t be able to get tested.\n Amid the pandemic, the Trump administration has seized on the threat to public health as a pretext to issue a series of policy changes affecting almost every aspect of the immigration system, including asylum and green cards. While many changes have been announced as temporary, they could remain in place indefinitely.\n But critics say the administration has used the health crisis and the economic meltdown it has caused as pretext to put in place restrictions that further its immigration agenda.\n While Mr. Trump and his aides said the suspension of visas was in response to the pandemic, the administration has been pursuing the same broad reductions to legal immigration policies for years, including during times when unemployment was at its lowest in decades. In 2017, the president endorsed the RAISE Act, a Republican Senate bill that would have cut legal immigration, including business visas, by about 50 percent.\n In the weeks leading up to the announcement on Monday, a diverse coalition of businesses and research universities had lobbied fiercely, flooding the White House with letters and phone calls, in an attempt to limit the scope of the executive order.\n “It’s the largest crackdown on work visas that I have seen in my 35 years of practice,” said Steve Yale-Loehr, a Cornell law professor. “Thousands of businesses and universities will be hurt by these restrictions. Similarly, individuals will be stuck overseas unable to help the U.S. economy recover.”\n But the opponents failed to block the measures, which they had argued were counterproductive to economic recovery.\n “The Trump administration has argued that it wants to create a merit-based immigration system that prioritizes educated immigrants with skills,” said Alex Nowrasteh, the director of immigration studies at the conservative Cato Institute. “With this suspension of the H-1B visa program, they have shown, once again, that they really mean they want fewer immigrants.”\n “These immigration bans are more red meat and not jobs for the base,” said Rebecca Shi from the American Business Immigration Coalition in Chicago. “They don’t even serve Trump’s own business interests.”\n Mr. Trump has used H-2B visas to hire seasonal staff for his resorts to work as cooks and waiters.", "posttime": "2020-06-23 23:28:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "移民,suspends,美国", "title": "特朗普暂停H1B和非移民签证", "title_en": "Trump suspends H1B and non-immigrant visas", "transed": 1, "url": "https://www.nytimes.com/2020/06/22/us/politics/trump-h1b-work-visas.html", "via": "", "real_tags": ["移民", "suspends", "美国"]}, {"category": "", "categoryclass": "", "imagename": "7171587db0fc08db35421018bb08d02a.jpg", "infoid": 1007810, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚洲网纽约州佩奇--(美国商业资讯)--万事达卡(纽约证券交易所市场代码：MA)今天宣布，它已经达成一项协议，收购北美领先的实时访问财务数据和洞察力的供应商Finicity。收购价格为8.25亿美元，如果实现业绩目标，Finicity的现有股东有可能额外获得1.6亿美元的收益。\nFinicity补充技术和团队的加入加强了现有的万事达卡开放银行平台，以实现和保障更多的金融服务选择，加强了该公司与全球金融机构和金融技术公司的长期伙伴关系和承诺。\n开放银行使个人和企业能够更好地控制他们的财务数据。这包括确定第三方-如金融技术公司或其他银行-可以如何以及在哪里访问这些信息，以提供资金管理计划等新服务，或代表他们发起支付。\n几年来，万事达卡在这一领域的投资越来越多，包括2019年在欧洲推出了一套全面的开放银行解决方案。这些努力与Finicity技术支持的平台(如Quicken Loans、Rocket Mortgage和Experian Boost)相结合，有可能塑造下一代开放银行服务。\n“开放银行业务是一种日益增长的全球趋势，对我们来说是一个具有重要战略意义的空间。随着Finicity的加入，我们预计不仅将推进我们的开放银行战略，还将加强我们在几个市场支持和加速当今数字经济的方式。“万事达卡总裁迈克尔·米巴赫说。Finicity拥有一项经过验证的业务，建立在与数千家银行和金融技术公司的伙伴关系基础上，与我们类似。Finicity还分享了我们对以消费者为中心的数据实践的承诺，确保消费者在如何以及在哪里使用他们的信息方面拥有发言权。正是通过使用下一代开放式银行应用编程接口和明确的消费者批准，这些财务信息才能提供简化的贷款和抵押流程、快速启动基于账户的支付和个人财务管理解决方案。“。\nFinicity首席执行官兼联合创始人史蒂夫·史密斯说：“自我们成立以来，尼克·托马斯和我一直专注于开发业界领先的技术，并建立一个组织，使消费者和组织能够更好地理解、管理和使用他们的财务数据，以改善他们的财务生活。”“使人们能够访问和控制他们的数据，同时确保保护这些数据的最佳做法，将继续推动巨大的创新，提高金融知识、包容性和健康。与万事达卡的这种伙伴关系帮助我们在全球加速这一使命。“。\nAdvance Mastercard成为金融技术公司和金融机构强大的开放银行合作伙伴。Finicity的技术和敬业的员工将增强万事达卡现有的开放式银行解决方案，使其能够在北美和其他关键地区扩张。今天，万事达卡在欧洲的开放银行服务与1800多家金融机构建立了联系。通过与北美银行、贷款和财富管理生态系统的直接连接，万事达卡将扩大Finicity的覆盖范围，成为任何消费者、银行、商家、金融科技或政府的数据、支付和开放银行需求的一站式合作伙伴。\n增强面向消费者和企业的功能和产品。交易完成后，万事达卡的现有技术和专业知识与Finicity的新分析平台相结合，将有助于简化消费者和小企业的信贷决策过程。此外，Finicity的帐户所有者验证工具与万事达卡的新支付平台功能的集成将为消费者、商家和企业提供改进的ACH和实时支付体验。\n加强对负责任的数据实践的承诺。Finicity与万事达卡一样致力于以个人为中心的安全数据实践。Finicity的联合创始人在推动多个行业的最佳实践讨论方面发挥了关键作用。Finicity坚定地致力于通过与银行及其客户合作，确保建立安全的连接，从而提供一流的数据管理实践。\n美国银行企业支付部主管马克·摩纳哥(Mark摩纳哥)表示：“美国银行坚定地认为，应该让人们控制自己的财务信息，并有能力安全地分享这些信息。”我们已经与Finicity和万事达卡以及金融数据交换公司等行业团体合作，以加快数据共享的最高隐私和安全标准的采用，并消除第三方保留和存储个人财务细节的情况。我们期待着继续与Finicity和万事达卡合作，进一步改善客户体验。“。\n在抵押贷款行业的技术革命期间，Finicity一直是Rocket Mortgage的强大合作伙伴。快速、轻松地访问消费者许可的数据对于做出知情的抵押贷款实时决策的贷款人来说至关重要。我们为Finicity团队加入万事达卡感到高兴，并期待着继续合作。“Rocket Mortgage负责投资的高级副总裁斯科特·埃尔金斯(Scott Elkins)说。\nBrex首席执行官恩里克·杜布格拉斯(Henrique Dubugras)说：“Brex的创新产品利用Finicity的连通性，使我们能够获得最高质量的商业许可数据，为我们的平台提供动力。”Finicity的能力与万事达卡的产品和服务的结合将使我们能够创造创新的解决方案，以增强我们的Brex产品。“。\n益百利北美公司首席执行官克雷格·邦迪说：“我们很高兴看到Finicity和万事达卡的结合。我们期待着在我们帮助消费者的持续使命中与他们合作。“。\n与以往的收购一样，万事达卡预计此次收购不会在超过24个月的时间内逐步稀释其业务。这种稀释是由对业务的投资推动的，包括其国际扩张，以及与采购会计和整合相关的成本的影响。\n这笔交易预计将在年底前完成，需要接受监管审查和其他惯常的完成条件。\n万事达卡是支付行业的全球性科技公司。我们的使命是连接和推动一个包容的数字经济，通过使交易安全、简单、智能和可访问，使每个人在任何地方都受益。利用安全的数据和网络、合作伙伴关系和激情，我们的创新和解决方案帮助个人、金融机构、政府和企业实现其最大潜力。我们的正派商数，或称DQ，推动着我们的文化，以及我们在公司内外所做的一切。我们的联系遍及210多个国家和地区，我们正在建设一个可持续发展的世界，为所有人释放无价的可能性。\nFinicity的使命是通过安全可靠地访问快速、高质量的数据，帮助个人、家庭和组织做出更明智的财务决策。该公司于2000年推出了第一款金融产品，自那以来已经成长为提供金融数据API、信贷决策工具和金融健康解决方案。Finicity与有影响力的金融机构和颠覆性的金融科技提供商合作，在复杂的金融世界中为消费者提供帮助。它在诸如益百利的Boost™这样的创新解决方案中发挥了关键作用，它还帮助火箭抵押贷款公司通过快速贷款访问消费者允许的数据，以做出抵押贷款决策。Finicity被授予API World年度最佳金融API，并在过去三年中一直被评为美国银行家金融科技的最佳工作地点。Finicity总部设在德克萨斯州盐湖城，在全球拥有约500名员工。要了解更多信息或试运行其API，请访问www.findity.com。\n本新闻稿包含根据“1995年私人证券诉讼改革法”的安全港条款作出的前瞻性陈述。除历史事实以外的所有陈述都可能是前瞻性陈述。本新闻稿中使用的“相信”、“预期”、“可能”、“可能”、“将会”、“将会”、“趋势”和类似的词语旨在识别前瞻性陈述。前瞻性陈述的例子包括但不限于与万事达卡的未来前景、发展和业务战略有关的陈述，以及万事达卡对Finicity的收购和运营。我们告诫您不要过度依赖这些前瞻性陈述，因为它们只在发表之日发表。除了公司根据美国联邦证券法承担的持续义务外，公司不打算更新或以其他方式修改前瞻性信息，以反映自准备本新闻稿以来出现和/或存在的实际经营结果、财务状况的变化、估计、预期或假设的变化、一般经济或行业状况或其他情况的变化，或反映任何意想不到的事件的发生。\n与拟议中的交易、我们的运营和我们的商业环境有关的许多因素和不确定因素都很难预测，其中许多因素不在我们的控制范围之内，这些因素和不确定性影响着是否能够或将会实现任何前瞻性陈述。这些因素中的任何一个都可能导致我们的实际结果或收购的影响与万事达卡或代表万事达卡发表的任何前瞻性声明中的书面明示或暗示大不相同。该等与收购完成及影响有关的因素包括但不限于是否会满足所有必要条件，以及交易是否会按协议条款及时完成。\n有关可能导致万事达卡的实际结果与预期结果大不相同的其他与万事达卡整体业务相关的因素的更多信息，请参阅该公司提交给证券交易委员会的文件，包括该公司截至2019年12月31日的Form 10-K年度报告，以及任何后续的Form 10-Q和8-K报告。\n万事达卡投资者关系部吉娜·阿科迪诺(Gina Accordino)电话：914-249-4565 Investor.Relationship@Master card.com万事达卡通讯部Seth Eisen，电话：914-249-3153电子邮件：Seth.Eisen@master card.com Finicity Communications安迪·卡普纳(Andy Capener)电话：801-984-4231 andy.capener@finity.com", "note_en": "PURCHASE, N.Y.--(   BUSINESS WIRE)--Mastercard (NYSE: MA) today announced it has entered into an agreement to acquire Finicity, a leading North American provider of real-time access to financial data and insights. The purchase price is US$825 million, and Finicity’s existing shareholders have the potential for an earn-out of up to an additional $160 million, if performance targets are met.\n  The addition of Finicity’s complementary technology and teams strengthens the existing Mastercard open banking platform to enable and safeguard a greater choice of financial services, reinforcing the company’s long-standing partnerships with and commitment to financial institutions and fintechs across the globe.\n Open banking gives people and businesses more control over their financial data. This includes determining how and where third parties – such as fintechs or other banks – can access that information to provide new services like money management programs or initiate payments on their behalf.\n Mastercard has increasingly invested in this space over several years, including the 2019 launch of a set of comprehensive open banking solutions in Europe. The combination of these efforts with the Finicity technology powering platforms such as Quicken Loans Rocket Mortgage and Experian Boost has the potential to shape the next generation of open banking services.\n “Open banking is a growing global trend and a strategically important space for us. With the addition of Finicity, we expect to not only advance our open banking strategy, but enhance how we support and accelerate today’s digital economy across several markets,” said Michael Miebach, president of Mastercard. “Finicity has a proven business, built on partnerships with thousands of banks and fintechs, similar to us. Finicity also shares our commitment to consumer-centric data practices, ensuring consumers have a say in how and where their information should be used. It’s through the use of next generation open banking APIs and clear consumer approvals that this financial information can deliver streamlined loan and mortgage processes, rapid account-based payment initiation and personal financial management solutions.”\n “Since our founding, Nick Thomas and I have focused on developing industry-leading technology and building an organization that empowers consumers and organizations to better understand, manage and use their financial data to improve their financial lives,” said Steve Smith, chief executive officer and co-founder of Finicity. “Enabling people to access and control their data, while ensuring best practices to protect that data, will continue to drive tremendous innovation that increases financial literacy, inclusion and health. This partnership with Mastercard helps us accelerate this mission globally.”\n  Advances Mastercard as a Strong Open Banking Partner for Fintechs, Financial Institutions. Finicity’s technology and dedicated employees will enhance Mastercard’s existing open banking solutions by enabling them to expand in North America and other key geographies. Today, Mastercard open banking services in Europe feature connections to more than 1,800 financial institutions. With a direct connection to the North American banking, lending and wealth management ecosystem, Mastercard will extend Finicity’s reach to be a one-stop partner for any consumer, bank, merchant, fintech or government’s data, payment and open banking needs.\n Strengthens Capabilities and Offerings to Consumers and Businesses. Following the completion of the transaction, Mastercard’s existing technology and expertise combined with Finicity’s new analytics platforms, will help streamline the credit decisioning process for consumers and small businesses. Additionally, the integration of Finicity’s account owner verification tools to Mastercard’s New Payment Platform capabilities will deliver an improved ACH and real-time payments experience to consumers, merchants and businesses.\n Enhances Commitment to Responsible Data Practices. Finicity shares Mastercard’s commitment to safe and secure data practices centered around the individual. Finicity’s co-founders have played a critical role in the advancing the discussion of best practices across multiple industries. Finicity has a strong commitment to deliver best-in-class data management practices by partnering with banks and their customers to ensure secure connectivity is established.\n “Bank of America is a strong believer in giving people control over their financial information and the ability to share it securely,” said Mark Monaco, head of Enterprise Payments at Bank of America. “We’ve worked with both Finicity and Mastercard, as well as industry groups such as Financial Data Exchange, to accelerate the adoption of the highest standards of privacy and security for data sharing, and to eliminate the retention and storage of individuals’ financial details by third parties. We look forward to continuing our work with Finicity and Mastercard to further improve the customer experience.”\n “Finicity has been a strong partner of Rocket Mortgage during the mortgage industry’s tech revolution. Fast, easy access to consumer-permissioned data is critical to lenders who are making well-informed mortgage real time decisions. We are happy for the Finicity team in joining Mastercard and look forward to a continued partnership,” said Scott Elkins, senior vice president of Investments at Rocket Mortgage.\n “Brex’s innovative offering uses Finicity’s connectivity, giving us access to the best quality business-permissioned data to power our platform,” said Henrique Dubugras, chief executive officer, Brex. “The combination of Finicity’s capabilities with Mastercard’s products and services will enable us to create innovative solutions to enhance our Brex offerings.”\n “We are pleased to see the combination of Finicity and Mastercard,” said Craig Boundy, chief executive officer of Experian North America. “We look forward to collaborating with them in our ongoing mission to help consumers.”\n As with past acquisitions, Mastercard does not expect this acquisition to be incrementally dilutive to its business for greater than 24 months. This dilution is driven by investments in the business, including its international expansion, as well as the impact of purchase accounting and integration related costs.\n The transaction, which is anticipated to close by year’s end, is subject to regulatory review and other customary closing conditions.\n  Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.\n  Finicity’s mission is to help individuals, families and organizations make smarter financial decisions through safe and secure access to fast, high-quality data. The company, which launched its first financial product in 2000, has since grown to provide financial data APIs, credit decisioning tools and financial wellness solutions. Finicity partners with influential financial institutions and disruptive fintech providers alike to give consumers a leg up in a complicated financial world. It has played a key role in innovative solutions like Experian’s Boost™ and it helps Rocket Mortgage by Quicken Loans access consumer-permissioned data for mortgage decisions. Finicity was awarded API World’s Finance API of the Year and has been an American Banker Best Places to Work in Fintech the past three years. Finicity is headquartered in Salt Lake City, UT and has approximately 500 employees worldwide. To learn more or test drive its API, visit  www.finicity.com.\n  This press release contains forward-looking statements pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical facts may be forward-looking statements. When used in this press release, the words “believe,” “expect,” “could,” “may,” “would,” “will,” “trend” and similar words are intended to identify forward-looking statements. Examples of forward-looking statements include, but are not limited to, statements that relate to Mastercard’s future prospects, developments and business strategies, as well as Mastercard’s acquisition and operation of Finicity. We caution you to not place undue reliance on these forward-looking statements, as they speak only as of the date they are made. Except for the company’s ongoing obligations under the U.S. federal securities laws, the company does not intend to update or otherwise revise the forward-looking information to reflect actual results of operations, changes in financial condition, changes in estimates, expectations or assumptions, changes in general economic or industry conditions or other circumstances arising and/or existing since the preparation of this press release or to reflect the occurrence of any unanticipated events.\n Many factors and uncertainties relating to the proposed transaction, our operations and our business environment, all of which are difficult to predict and many of which are outside of our control, influence whether any forward-looking statements can or will be achieved. Any one of these factors could cause our actual results or the impact of the acquisition to differ materially from those expressed or implied in writing in any forward-looking statements made by Mastercard or on its behalf. Such factors related to the completion and impact of the acquisition include, but are not limited to, whether all necessary conditions will be met, and whether the transaction will close on agreed terms and in a timely manner.\n For additional information on other factors related to Mastercard’s overall business that could cause Mastercard’s actual results to differ materially from expected results, please see the company’s filings with the Securities and Exchange Commission, including the company’s Annual Report on Form 10-K for the year ended December 31, 2019, and any subsequent reports on Forms 10-Q and 8-K.\n  Mastercard Investor Relations   Gina Accordino, 914-249-4565    investor.relations@mastercard.com     Mastercard Communications   Seth Eisen, 914-249-3153    Seth.Eisen@mastercard.com     Finicity Communications   Andy Capener, 801-984-4231    andy.capener@finicity.com", "posttime": "2020-06-23 23:27:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "收购,acquire,万事达卡", "title": "万事达卡将收购Finicity推进开放银行战略", "title_en": "Mastercard to Acquire Finicity to Advance Open Banking Strategy", "transed": 1, "url": "https://www.businesswire.com/news/home/20200623005496/en/Mastercard-Acquire-Finicity-Advance-Open-Banking-Strategy", "via": "", "real_tags": ["收购", "acquire", "万事达卡"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Python的Pickle模块是序列化和反序列化对象的一种非常方便的方式。它不需要模式，可以处理任意的Python对象。但它也有问题。这篇文章简要解释了这些问题。\n有些人会告诉你永远不要用泡菜，因为它不好。我不会走那么远的。我要说的是，只有当你对泡菜的九个缺点没有意见的时候，才可以使用泡菜：\n泡菜可以是手工制作的，当你解开泡菜时，会有恶意的影响。因此，您永远不应该取消选择不信任的数据。\n不安全不是因为Pickle包含代码，而是因为它们通过调用在Pickle中命名的构造函数来创建对象。任何可调用对象都可以用来代替您的类名来构造对象。恶意的Pickles将使用其他Python可调用函数作为“构造函数”。例如，危险的Pickle可能会执行“os.system(‘rm-rf/’)”，而不是执行“mods.MyObject(17)”。UnPickler无法区分“mods.MyObject”和“os.system”。这两个名字都是它可以解析的，产生了它可以称之为的东西。解拣器按照酸菜的指示执行它们中的任何一个。\n更多细节，包括一个例子，请参阅Supaken在Python标准库中的POST DISKINGS。\n因为泡菜存储对象的结构，所以当它们未泡菜时，它们的结构与您泡菜时的结构相同。这听起来像是一件好事，也正是泡菜的设计初衷。但是，如果您的代码在制作泡菜的时间和使用它的时间之间发生更改，则您的对象可能与您的代码不一致。对象仍将具有由旧代码创建的结构，但它们将与新代码一起运行。\n例如，如果您在制作泡菜后添加了一个属性，则泡菜中的对象将不会具有该属性。您的代码将需要该属性，从而导致问题。\nPickles的最大便利在于它们将序列化您的对象具有的任何结构。创建序列化结构不需要额外的工作。但这也带来了自身的问题。您真的希望将DateTime序列化为DateTime吗？或者作为iso8601字符串？你别无选择：他们将是约会时间。\n您不仅不必指定序列化形式，而且也不能指定它。\nPickle是隐式的：它们序列化对象中的所有内容，甚至是您不想序列化的数据。例如，您可能有一个属性是您不想序列化的计算缓存。Pickle没有跳过该属性的便捷方法。\n更糟糕的是，如果您的对象包含不能进行PICLE的属性，比如打开的文件对象，PICLE不会跳过它，它会坚持尝试PICLE，然后抛出异常。\n泡菜存储对象的整个结构。当Pickle模块重新创建您的对象时，它不会调用您的__init__方法，因为该对象已经创建。\n这可能令人惊讶，因为在其他任何地方，对象都会在不调用__init__的情况下产生。这里的逻辑是，在制作泡菜的进程中首次创建对象时，已经调用了__init__。\n但是您的__init__方法可能会执行一些重要的工作，比如打开文件对象。您的未酸洗对象将处于与您的__init__方法不一致的状态。或者，您的__init__可能会记录有关正在创建的对象的信息。未酸洗的对象不会出现在日志中。\nPickle特定于Python，并且只能由其他Python程序使用。严格说来并非如此，您可以找到可以使用泡菜的其他语言的包，但它们很少见。它们自然会局限于跨语言的通用列表/字典对象结构，在这一点上，您也可以只使用JSON。\nPickle是一个二进制数据流(实际上是抽象执行引擎的指令)。如果将泡菜作为纯文件打开，则无法读取其内容。知道酸菜中有什么的唯一方法是使用酸菜模块加载它。这可能会使调试变得困难，因为您可能无法在PICLE文件中搜索您感兴趣的数据：\n函数和类是Python中的一级对象：您可以将它们存储在列表、字典、属性等中。Pickle将很乐意序列化包含函数和类等可调用对象。但它不会将代码存储在Pickle中，只存储函数或类的名称。\nPickle不是一种移动或存储代码的方式，尽管它们看起来可能是。当您取消挑选数据时，函数的名称用于查找正在运行的进程中的现有代码。\n与其他序列化技术相比，PICLE可能会很慢，正如Ben Frederickson在Don‘t Pickle Your Data中所展示的那样。\n其中一些问题可以通过向您的类添加特殊方法来解决，如__getstate__或__Reduce__。但是，一旦您开始沿着这条路走下去，您不妨使用另一种从一开始就没有这些缺陷的序列化方法。\n有很多其他方法可以序列化对象，从普通的JSON到更时髦的替代方法，如棉花糖、cattrs、协议缓冲区等等。\n我对其中任何一个都没有强烈的推荐。正确的答案将取决于您问题的细节。甚至可能是泡菜。\n名称是必填项。电子邮件或Web为必填项。电子邮件不会显示，我不会给您发送垃圾邮件。您的网站不会被搜索引擎编入索引。", "note_en": "Python’s  pickle\rmodule is a very convenient way to serialize and de-serialize objects. It needs\rno schema, and can handle arbitrary Python objects. But it has problems. This\rpost briefly explains the problems.\n Some people will tell you to never use pickle because it’s bad. I won’t go\rthat far. I’ll say, only use pickle if you are OK with its nine flaws:\n     Pickles can be hand-crafted that will have malicious effects when you\runpickle them. As a result, you should never unpickle data that you do not\rtrust.\n The insecurity is not because pickles contain code, but because they create\robjects by calling constructors named in the pickle. Any callable can be used\rin place of your class name to construct objects. Malicious pickles will use\rother Python callables as the “constructors.” For example, instead of executing\r“models.MyObject(17)”, a dangerous pickle might execute “os.system(‘rm -rf /’)”.\rThe unpickler can’t tell the difference between “models.MyObject” and\r“os.system”. Both are names it can resolve, producing something it can call.\rThe unpickler executes either of them as directed by the pickle.\n More details, including an example, are in Supakeen’s post\r Dangers\rin Python’s standard library.\n  Because pickles store the structure of your objects, when they are unpickled,\rthey have the same structure as when you pickled them. This sounds like a good\rthing and is exactly what pickle is designed to do. But if your code changes\rbetween the time you made the pickle and the time you used it, your objects may\rnot correspond to your code. The objects will still have the structure created\rby the old code, but they will be running with the new code.\n For example, if you’ve added an attribute since the pickle was made, the\robjects from the pickle won’t have that attribute. Your code will be expecting\rthe attribute, causing problems.\n  The great convenience of pickles is that they will serialize whatever\rstructure your object has. There’s no extra work to create a serialization\rstructure. But that brings problems of its own. Do you really want your\rdatetimes serialized as datetimes? Or as iso8601 strings? You don’t have a\rchoice: they will be datetimes.\n Not only don’t you have to specify the serialization form, you can’t specify\rit.\n  Pickles are implicit: they serialize everything in your objects, even data\ryou didn’t want to serialize. For example, you might have an attribute that is\ra cache of computation that you don’t want serialized. Pickle doesn’t have a\rconvenient way to skip that attribute.\n Worse, if your object contains an attribute that can’t be pickled, like an\ropen file object, pickle won’t skip it, it will insist on trying to pickle it,\rand then throw an exception.\n  Pickles store the entire structure of your objects. When the pickle module\rrecreates your objects, it does not call your __init__ method, since the object\rhas already been created.\n This can be surprising, since nowhere else do objects come into being without\rcalling __init__. The logic here is that __init__ was already called when the\robject was first created in the process that made the pickle.\n But your __init__ method might perform some essential work, like opening file\robjects. Your unpickled objects will be in a state that is inconsistent with\ryour __init__ method. Or your __init__ might log information about the object\rbeing created. Unpickled objects won’t appear in the log.\n  Pickles are specific to Python, and are only usable by other Python programs.\rThis isn’t strictly true, you can find packages for other languages that can use\rpickles, but they are rare. They will naturally be limited to the cross-language\rgeneric list/dict object structures, at which point you might as well just use\rJSON.\n  A pickle is a binary data stream (actually instructions for an abstract\rexecution engine.) If you open a pickle as a plain file, you cannot read its\rcontents. The only way to know what is in a pickle is to use the pickle module\rto load it. This can make debugging difficult, since you might not be able to\rsearch your pickle files for data you are interested in:\n   Functions and classes are first-class objects in Python: you can store them\rin lists, dicts, attributes, and so on. Pickle will gladly serialize objects\rthat contain callables like functions and classes. But it doesn’t store the\rcode in the pickle, just the name of the function or class.\n Pickles are not a way to move or store code, though they can appear to be.\rWhen you unpickle your data, the names of the functions are used to find\rexisting code in your running process.\n  Compared to other serialization techniques, pickle can be slow as Ben\rFrederickson demonstrates in\r Don’t pickle\ryour data.\n  Some of these problems can be addressed by\r adding\rspecial methods to your class, like __getstate__ or __reduce__. But once\ryou start down that path, you might as well use another serialization method\rthat doesn’t have these flaws to begin with.\n  There are lots of other ways to serialize objects, ranging from plain-old\rJSON to fancier alternatives like  marshmallow,  cattrs,  protocol buffers, and\rmore.\n I don’t have a strong recommendation for any one of these. The right answer\rwill depend on the particulars of your problem. It might even be pickle...\n Name is required. Either email or web are required.\r Email won&#39;t be displayed and I won&#39;t spam you.\r Your web site won&#39;t be indexed by search engines.", "posttime": "2020-06-23 23:27:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,泡菜,pickle,对象", "title": "巨蟒泡菜的缺陷", "title_en": "Python Pickle’s Flaws", "transed": 1, "url": "https://nedbatchelder.com/blog/202006/pickles_nine_flaws.html", "via": "", "real_tags": ["python", "泡菜", "pickle", "对象"]}, {"category": "", "categoryclass": "", "imagename": "3ed1d136a37d0184b585b95b8beb7efb.jpeg", "infoid": 1007808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "带条码登录和32个可编程产品按钮的收银机-DirkJanJansen/Sales", "note_en": "Cash Register with barcode logon and 32 programmable product buttons - DirkJanJansen/Sales", "posttime": "2020-06-23 23:26:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,条形码,pyqt5,条码", "title": "PyQt5中的收银机，带条形码登录和32个可编程按钮", "title_en": "CashRegister in PyQt5 with barcode logon and 32 programmable buttons", "transed": 1, "url": "https://github.com/DirkJanJansen/Sales", "via": "", "real_tags": ["编程", "条形码", "pyqt5", "条码"]}, {"category": "", "categoryclass": "", "imagename": "634ddc767cd0bd4d56588a0be4df15b5.png", "infoid": 1007807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数学是什么？我认为基本上可以分为四类。有定义、真/假陈述、证据和想法。\n定义(例如实数或π)和真/假陈述(例如费马大定理的陈述或黎曼假设的陈述)是数学科学的一部分：这些都是黑白的东西，在某些基本系统中具有完全严格的意义。\n从某种意义上说，证明是数学的通货：证明赢得奖品。建造它们是一门艺术，检查它们是一门科学。这非常简单地解释了为什么计算机验证系统，如精益、Coq、Isabelle/HOL、AGDA…。更擅长检查证据而不是构建证据。\n而思想是数学中纯粹的艺术部分。那个“电灯泡”时刻，使你能够解决问题的洞察力--这就是难以捉摸的数学概念。\n从形式上讲，思想是我对数学理解最少的部分。这里有两个问题：\n第一个问题是一个精确的“科学”问题。群是具有某种额外结构并满足某些公理的集合。正式的答案在维基百科的群组页面上。组是一个定义。但是第二个问题是一个不同类型的问题。不同的人对群体有不同的看法。比方说是由满足条件的元素生成的群。你能说些什么呢？如果你是一名刚刚看到组的正式定义的数学本科生，你可能什么都不会说。如果你对群论有了更成熟的理解，你马上就会知道这个群体是微不足道的，因为你对正在发生的事情有一个更复杂的模型。想法是复杂的，而且依赖于人类。计算机对群的概念，实际上是维基百科中定义的副本，这也是目前计算机不善于自己证明新定理的原因之一。你可以通过教计算机关于群的定理，或者教它群的例子，或者尝试编写自动计算群论定理或群的例子的人工智能来发展它的直觉。但是直觉是一个非常微妙的东西，我一点也不理解，所以我在这里就不再多说这些想法了。我认为地图是“规范”的概念是一种想法，而不是定义--我认为不同的数学家对这个黄鼠狼这个词有不同的思考方式。在这篇文章中，我将讨论其他三个概念是如何在类型理论、精益定理证明器中实现的。\n与思想相反，数学的其他部分(定义、定理/猜想和证明)可以在一个基本系统中形式化，因此可以以精确的方式在计算机上创建和存储。这里，我不是指pdf文件！PDF文件正是我想要离开的地方！我的意思是，人们设计了理解各种数学基础(集合论、类型论、范畴论)之一的计算机编程语言，然后数学家可以用这种语言编写代码来表示所讨论的定义、对/错陈述或证明。\n我当然没有资格用范畴论来解释这一切是如何运作的。在集合论中，我只做一个观察。集合论中的定义，例如实数或的定义是一个集合。而证明是逻辑上的一系列步骤。在我看来，定义和证明在集合论中是完全不同的两件事。群是这些东西的混合体-群是满足一些公理的有序四元组，所以它是一个附加了一些逻辑的集合。\n然而，在类型理论中，情况却出人意料地不同。所有三件事--定义、真/假陈述和证据--都是一回事！这些都是条款。一组，一个证明，实数--它们都是术语。这种定义和证明的统一-集合和逻辑-似乎使类型理论成为向计算机教授所有本科生水平的数学的实用基础系统。\n在类型理论中，一切都是一个术语。但有些术语是类型。不是每个术语都是一种类型，但每个术语都有一种类型。冒号用于表示精益中术语的类型-符号x：t表示x是T类型的术语。例如，实数π(Pi)是精益中的术语，实数ℝ是一种类型，我们有π:ℝ，即π是ℝ类型的术语。在集合论中我们写的是π∈ℝ，在类型论中我们写的是π:ℝ。它们都表达了相同的数学概念--“π是一个实数”。\n现在，π是一个术语，但它不是一种类型。在精益中，x：π毫无意义。在集合论中，x∈π碰巧是有意义的，但这是一个奇怪的巧合，因为一切都是一个集合。此外，π的实际元素将取决于实数是如何实现的(例如，DedekindCuts或Cauchy序列)，因此在集合论中x∈π没有数学意义；它碰巧是有意义的，但这是系统的一个奇特现象。\n我在上面声称，每个学期都有一种类型。那么ℝ的类型是什么呢？事实证明，ℝ：TYPE。实数是一个被称为类型的“宇宙”类型的术语，类型理论类似于所有集合的类别。\n许多数学家认为是定义的数学对象要么有类型Type，要么有类型T，其中T：type。作为一个模糊的经验法则，我们用大写字母书写的东西(组、环、…)。或者花哨的字母(实数，有理数)的类型是Type，而我们用小写字母(组中的元素g，实数r或整数n)写的东西都有类型T，其中T是我们认为的包含这些元素的集合。例如，2：ℕ和ℕ：Type，或者如果是组的一个元素，那么在Lean中我们有g：g和g：Type。你可以看到这里有一个三层的层次结构--术语在底部，类型在它们上面，宇宙在顶部。\n类型的例子有：ℝ，ℕ、G(群)、R(环)、X(集合论者称之为集合)、Banach空间等等。形式上，我们说ℝ：TYPE。\n术语的例子：π(ℝ类型的术语)，g(群G的元素，所以是G类型的术语)，x(X的元素，所以是X类型的术语)。正式地说，我们说g：g。\n这种层次结构比集合论中的层次结构更具表现力，集合论中的层次结构只有两个级别：类(例如，所有集合的类)和集合。\n冒号在数学中有一个标准用法--在函数的表示法中。如果X和Y是集合(如果你在做集合论)或类型(如果你在做类型论)，那么从X到Y的函数的符号是f：X→Y。这实际上与Lean对冒号的使用是一致的；Lean对从X到Y的函数集合的符号是X→Y，它是一种类型(即X→Y：TYPE，对应于集合论者认为是集合的事实)，f：X→Y意味着f是类型X→Y的术语，是的类型理论版本，也就是说f是类型理论中从X到Y的函数。\n(不是为了考试)严格地说，宇宙是类型，类型是术语，但这是一个语言问题：人们谈到类型，往往是指不是宇宙的类型，当人们谈到术语时，他们指的是不是类型的术语。但并不总是这样。当我还是个初学者的时候，这让我很困惑。\n这就是有趣的开始。到目前为止，看起来类型就是类型理论家所说的集合，而术语就是他们所说的元素。但现在让我们看看Lean的类型理论中的另一个宇宙，真/假陈述的宇宙支柱，在这个宇宙中，我们对正在发生的事情的传统心理模型是完全不同的。我们将了解定理和证明如何以与类型和项相同的方式建模。\n那么，这一切是怎么运作的呢？除了宇宙类型，在利恩的类型理论中还有第二个宇宙，称为道具。Prop类型的术语是真/假陈述。这里有一个不幸的符号冲突。在数学中，命题这个词经常被用来表示婴儿定理，而定理是真的(否则它们就是猜想或反例之类的)。在这里，我们用与逻辑学家相同的方式使用命题-命题是一种通用的真/假陈述，其真值是无关紧要的。\n有了例子，这一切都会变得更加清楚。2+2=4是一个命题，所以我们可以写2+2=4：命题。但是2+2=5也是一个命题，所以2+2=5也是命题。我再说一遍--命题不一定是真的！命题是对/错的陈述。让我们来看一些更复杂的例子。\n对于所有自然数的真/假陈述是一个命题：在精益中，这可以表示为(∀x：ℕ，x+0=x)：prop。命题是一个Prop类型的术语(就像我们前面看到的类型是类型术语一样)。设RH表示黎曼假设的陈述。那么RH：道具。我们不在乎它是真是假，独立于数学公理，不可判定，等等。命题是对/错的陈述。让我们看看Lean的类型理论层次结构中的一部分，它生活在道具宇宙中。\n类型的例子：2+2=4，2+2=5，费马大定理的陈述，黎曼假设的陈述。\n这就是类型理论的世界与集合论中的事物设置方式严重背离的地方，也是直到三年前我大脑中的事物设置方式的严重背离。在试图理解这里发生的事情时，我甚至意识到，数学家们在这里的语言上有一些自由。在我们开始之前，先考虑一下这一点。Bolzano-Weierstrass定理是对具有收敛子序列的有界序列进行分析时的某种表述。我想谈谈数学家在实践中是如何使用“玻尔扎诺-魏尔斯特拉斯定理”这一短语的。数学家会说，Bolzano-Weierstrass定理是关于具有收敛子序列的序列的这一陈述。但是如果他们在证明过程中，需要应用它来继续他们的证明，他们会说，“根据Bolzano-Weierstrass定理，我们推导出有一个收敛的子序列”。这一切似乎一点都不好笑。但我想指出的是，数学家们正在以两种不同的方式使用“玻尔扎诺-魏尔斯特拉斯定理”。当他们说它是什么的时候，他们指的是定理的陈述。但当他们说他们在使用玻尔扎诺·魏尔斯特拉斯定理时，他们实际上使用的是它的证明。Birch和Swinnerton-Dyer猜想是一个完美的真/假陈述，你当然可以说它是什么。但是如果你想要你的证明是完整的，你不能在证明其他东西的过程中使用Birch和Swinnerton-Dyer猜想，因为在写这篇文章的时候，这个猜想还是一个悬而未决的问题。在这里，明确区分定理的陈述和定理的证明是很重要的。数学家可能会用短语“博尔扎诺-魏尔斯特拉斯定理”来表示这两个概念中的任何一个。这种非正式的记号滥用可能会让初学者感到困惑，因为在下面的内容中，能够区分定理陈述和定理证明是非常重要的；它们是完全不同的两件事。\n在自然数游戏中，我使用这种记数法的滥用，因为我试图与数学家交流。语句∀x：ℕ，x+0=x是真的，我会说“这在精益中叫做ADD_ZERO”。在自然数游戏中，我编写了诸如ADD_ZERO：∀x：ℕ，x+0=x的语句，但这意味着在精益中称为ADD_ZERO的术语是∀x：ℕ，x+0=x的证明！冒号正以类型论的方式使用。在自然数游戏中，我故意对这个概念含糊其辞。我让数学家相信ADD_ZERO在某种程度上等于所有人的“想法”。但是在幕后，∀x：ℕ，x+0=x是一个命题，它是一个类型，而Add_Zero是它的证明，这是一个术语。在这里，明确区分定理的陈述和证明是很重要的。陈述是类型，证据是术语。\n类型的例子：2+2=4，2+2=37，费马大定理的陈述-∀x y z：ℕ，n&gt；2∧x^n+y^n=z^n→x*y=0。\n项的例子：2+2=4的证明(类型为2+2=4的项)，费马大定理的证明(类型为∀x y z：ℕ，n&gt；2∧x^n+y^n=z^n→x*y=0)。\n因此，我们对声明π:ℝ的心智模型是，类型ℝ是“东西的集合”，而术语π是该集合的成员。如果我们继续这个类比，它说语句2+2=4是某种集合，并且2+2=4的证明是该集合的成员。换句话说，Lean建议我们将真/假陈述2+2=4建模为某种集合，2+2=4的证明是该集合的一个元素。在精益理论中，命题的所有证明都是平等的，这是一个固有的公理。所以，如果a：2+2=4，b：2+2=4，那么a=b，这是因为我们在Prop宇宙中工作，这就是命题在精益中的表现。在类型宇宙中，这个类比一点也不正确--我们有π:ℝ和37：ℝ，当然还有π≠37。道具宇宙的这种特殊怪癖被称为“证据无关”。形式上我们可以说，如果P：Prop，如果a：P，如果b：P，那么a=b。当然，如果一个命题是假的，那么它根本没有证据！就像是空集。所以Lean的命题模型是，真的就像有1个元素的集合，而假的就像有0个元素的集合。\n回想一下，如果f：x，→，Y，那么这意味着f是从X到Y的函数，现在，假设和是命题，假设我们知道。这是什么意思？这意味着这意味着。它的意思是，如果是真的，那么就是真的。这意味着如果我们有证据，我们就可以证明。它是从证明到证明的函数。它是将的元素发送到的元素的函数。它是一个P-→，Q类型的项。同样，证明是一项h：P，→，Q。这就是为什么在自然数博弈中，我们用→符号来表示蕴涵。\n让false表示一般的false语句(认为是有0个元素的集合)，让true表示一般的true语句(认为是有1个元素的集合)。我们能构造一个类型为False→False或类型为True→True的项吗？当然可以--只需使用身份识别功能即可。事实上，在这两种情况下都有一个唯一的函数-HOM集的大小为1。我们能构造一个类型为False→True的项吗？当然，有一个函数，从有0个元素的集合到有1个元素的集合，而且这个函数也是唯一的。但是我们能构造一个True→False类型的项吗？不，我们不能，因为我们要把真实性的证明寄到哪里？没有假的证据可以寄给你。所以True，→，False是一个大小为0的集合。这与→的标准真值表相对应，在该表中，我们分析的前三个陈述是真的，最后一个是假的。\n那么∀x y z：ℕ，n&gt；2∧x^n+y^n=z^n→x*y=0的证明是什么样子呢？在这个命题中有一个箭头，所以费马大定理的陈述是某种形式的集合，这意味着在Lean中，费马大定理的证明实际上是一个函数！。下面是该函数的功能。它有四个输入。前三个输入是自然数x，y和z。第四个输入是证明：它是命题n&gt；2∧x^n+y^n=z^n的证明。该函数的输出是命题x*y=0的证明。这是一种相当非常规的方式来思考费马大定理的证明是什么，我要强调的是，这对实际试图理解证明毫无帮助-但这是一个完全一致的数学工作方式的心理模型。将数字和证明的概念统一起来-将它们都视为术语-使您能够将证明视为函数。LEAN是一种函数式编程语言，特别是它是以函数为核心进行设计的。我相信，这就是为什么像Lean、Coq和Isabelle/HOL这样的定理证明者使用", "note_en": "What  is maths? I think it can basically be classified into four types of thing. There are definitions, true/false statements, proofs, and ideas.\n Definitions (for example the real numbers, or pi) and  true/false statements (for example the statement of Fermat’s Last Theorem or the statement of the Riemann Hypothesis) are part of the  science of mathematics: these are black and white things which have a completely rigorous meaning within some foundational system.\n Proofs are in some sense the currency of mathematics: proofs win prizes. Constructing them is an art, checking them is a science. This explains, very simply, why computer proof verification systems such as Lean, Coq, Isabelle/HOL, Agda… are much better at checking proofs than constructing them.\n And  ideas are the purely artistic part of mathematics. That “lightbulb” moment, the insight which enables you to solve a problem — this is the elusive mathematical idea.\n Ideas are the part of mathematics that I understand the least, in a formal sense. Here are two questions:\n  The first one is a precise “scientific” question. A group is a set equipped with some extra structure, and which satisfies some axioms. The formal answer is on  Wikipedia’s page on groups. A group is a definition. But the second question is a different kind of question. Different people think about groups in different ways. Say   is a group generated by an element   satisfying  . What can you say about  ? If you are a mathematics undergraduate who has just seen the formal definition of a group, you can probably say nothing. If you have a more mature understanding of group theory, you instantly know that this group is trivial, because you have a far more sophisticated model of what is going on. Ideas are complicated, and human-dependent. A computer’s idea of what a group is, is literally a copy of the definition in Wikipedia, and this is one of the reasons that computers are currently bad at proving new theorems by themselves. You can develop a computer’s intuition by teaching it theorems about groups, or teaching it examples of groups, or trying to write AI’s which figure out group theory theorems or examples of groups automatically. But intuition is a very subtle thing, and I do not understand it at all well, so I will say no more about these ideas here. I think that the concept of a map being “canonical” is an idea rather than a definition — I think different mathematicians have different ways of thinking about this weasel word. In this post I’m going to talk about how the three other concepts are implemented in type theory, in the Lean theorem prover.\n  In contrast to ideas, the other parts of mathematics (the definitions, theorems/conjectures, and proofs) can be formalised in a foundational system, and hence can be created and stored on a computer in a precise way. By this, I don’t mean a pdf file! Pdf files are exactly what I want to move away from! I mean that people have designed computer programming languages which understand one of the various foundations of mathematics (set theory, type theory, category theory) and then mathematicians can write code in this language which represents the definition, true/false statement or proof in question.\n I am certainly not qualified to explain how all this works in category theory. In set theory, let me just make one observation. A definition in set theory, for example the definition of the real numbers, or  , is a  set. And a proof is a sequence of steps in  logic. A definition and a proof seem to me to be two completely different things in set theory. A group is a mixture of these things — a group is an ordered quadruple   satisfying some axioms, so it’s a set with some logic attached.\n In type theory however, things are surprisingly different. All three things — definitions, true/false statements, and proofs — are  all the same kind of thing! They are all  terms. A group, a proof, the real numbers — they are all terms. This unification of definitions and proofs — of sets and logic — are what seems to make type theory a practical foundational system for teaching all undergraduate level mathematics to computers.\n  In type theory,  everything is a term. But some terms are types. Not every term  is a type, but every term  has a type. A colon is used to express the type of a term in Lean — the notation  x : T means that  x is a term of type  T. For example, the real number  π (pi) is a term in Lean, and the real numbers  ℝ is a type, and we have  π : ℝ , that is,  π is a term of type  ℝ. In set theory one writes  π ∈ ℝ, in type theory we write  π : ℝ. They both express the same mathematical concept — “ π is a real number”.\n Now  π is a term but it’s not a type. In Lean,  x : π  makes no sense. In set theory,  x ∈ π does happen to make sense, but this is a weird coincidence because everything is a set. Furthermore, the actual elements of  π will depend on how the real numbers are implemented (as Dedekind cuts or Cauchy sequences, for example), and hence in set theory  x ∈ π has no  mathematical meaning; it happens to make sense, but this is a quirk of the system.\n I claimed above that every term has a type. So what is the type of  ℝ? It turns out that  ℝ : Type. The real numbers are a term of a “universe” type called  Type — the type theory analogue of the class of all sets.\n Many of the mathematical objects which mathematicians think of as definitions either have type  Type, or have type  T where  T : Type. As a vague rule of thumb, things we write using capital letters (a group, a ring,…) or fancy letters (the reals, the rationals) have type  Type, and things we write using small letters (an element  g of a group, a real number  r or an integer  n) have got type  T where  T is what we think of as the set which contains these elements. For example  2 : ℕ and  ℕ : Type, or if   is an element of the group   then in Lean we have  g : G and  G : Type. You can see that there is a three-layer hiearchy here — terms at the bottom, types above them, and the universe at the top.\n Examples of types :  ℝ,  ℕ,  G (a group),  R (a ring),  X (something a set theorist would call a set), a Banach space, etc. Formally, we say  ℝ : Type.\n Examples of terms:  π (a term of type  ℝ),  g (an element of the group  G, so a term of type  G),  x (an element of  X, so a term of type  X). Formally, we say  g : G.\n This hierarchy is more expressive than the hierarchy in set theory, where there are only two levels: classes (e.g. the class of all sets), and sets.\n There is a standard use of the colon in mathematics — it’s in the notation for functions. If  X and  Y are sets (if you’re doing set theory) or types (if you’re doing type theory), then the notation for a function from  X to  Y is  f : X → Y. This is actually consistent with Lean’s usage of the colon; Lean’s notation for the collection   of functions from  X to  Y is  X → Y , which is a type (i.e.  X → Y : Type, corresponding to the fact that set theorists think of   as a set), and  f : X → Y means that  f is a term of type  X → Y, the type-theoretic version of  , and the way to say that  f is a function from  X to  Y in type theory.\n (Not for exam) Strictly speaking, universes are types, and types are terms, but this is a linguistic issue: often when people speak of types, they mean types which are not universes, and when people speak of terms they mean terms which are not types. But not always. This confused me when I was a beginner.\n  This is where the fun starts. So far, it just looks like a type is what a type theorist calls a set, and a term is what they call an element. But let’s now look at another universe in Lean’s type theory, the universe  Prop of true/false statements, where our traditional mental model of what’s going on is quite different. We will see how theorems and proofs can be modelled in the same way as types and terms.\n So, how does this all work? As well as the universe  Type, there is a second universe in Lean’s type theory called  Prop. The terms of type  Prop are true/false statements. There is an unfortunate notation clash here. In mathematics, the word proposition is often used to mean a baby theorem, and theorems are true (or else they would be conjectures or counterexamples or something). Here we are using the the word Proposition in the same way as the logicians do — a Proposition is a generic true/false statement, whose truth value is of no relevance.\n This will all be clearer with examples.  2 + 2 = 4 is a Proposition, so we can write  2 + 2 = 4 : Prop. But  2 + 2 = 5 is also a Proposition, so  2 + 2 = 5 : Prop as well. I’ll say it again — Propositions do not have to be true! Propositions are true/false statements. Let’s see some more complex examples.\n The true/false statement that   for all natural numbers   is a Proposition: in Lean this can be expressed as  (∀ x : ℕ, x + 0 = x) : Prop . A Proposition is a term of type  Prop (just like the types we saw earlier were terms of type  Type). Let  RH denote the statement of the Riemann Hypothesis. Then  RH : Prop. We don’t care if it’s true, false, independent of the axioms of mathematics, undecidable, whatever. A Proposition is a true/false statement. Let’s look at the part of Lean’s type theory hierarchy which lives in the  Prop universe.\n Examples of types :  2 + 2 = 4,  2 + 2 = 5, the statement of Fermat’s Last Theorem, the statement of the Riemann Hypothesis.\n   This is where the world of type theory seriously diverges from the way things are set up in set theory, and also the way things were set up in my brain up until three years ago. In trying to understand what was going on here, I even realised that mathematicians take some liberties with their language here. Before we start, consider this. The  Bolzano-Weierstrass theorem is some statement in analysis about a bounded sequence having a convergent subsequence. I want to talk a little bit about how mathematicians use the phrase “Bolzano-Weierstrass theorem” in practice. A mathematician would say that the Bolzano-Weierstrass theorem is this statement about sequences having convergent subsequences. But if they are in the middle of a proof and need to apply it in order to continue with their proof, they say “by the Bolzano-Weierstrass theorem we deduce that there’s a convergent subsequence”. Nothing seems at all funny about any of this. But what I want to point out is that mathematicians are using the phrase “the Bolzano-Weierstrass theorem” in two different ways. When they say what it  is, they are referring to the  statement of the theorem. But when they say they’re  using the Bolzano Weierstrass theorem, what they are actually using is its  proof. The Birch and Swinnerton-Dyer conjecture is a perfectly well-formed true/false statement, you can certainly  say what it is. But you can’t  use the Birch and Swinnerton-Dyer conjecture in the middle of a proof of something else if you want your proof to be complete, because at the time of writing the conjecture is an unsolved problem. Making a clear distinction between the statement of a theorem, and the proof of a theorem, is important here. A mathematician might use the phrase “the Bolzano-Weierstrass theorem” to mean either concept. This informal abuse of notation can confuse beginners, because in the below it’s really important to be able to distinguish between a theorem statement, and a theorem proof; they are two very different things.\n In the  natural number game, I use this abuse of notation because I am trying to communicate to mathematicians. The statement  ∀ x : ℕ, x + 0 = x is a true statement, and I say things like “this is called  add_zero in Lean”. In the natural number game I write statements such as  add_zero : ∀ x : ℕ, x + 0 = x. But what this  means is that the term called  add_zero in Lean is a  proof of  ∀ x : ℕ, x + 0 = x! The colon is being used in the type theory way. I am intentionally vague about this concept in the natural number game. I let mathematicians believe that  add_zero is somehow equal to the “idea” that   for all  . But what is going on under the hood is that  ∀ x : ℕ, x + 0 = x is a Proposition, which is a type, and  add_zero is its proof, which is a term. Making a clear distinction between the statement of a theorem, and its proof, is important here. The statements are the types, the proofs are the terms.\n Examples of types:  2 + 2 = 4,  2 + 2 = 37, the statement of Fermat’s Last Theorem —  ∀ x y z : ℕ, n &gt; 2 ∧ x^n + y^n = z^n → x*y = 0.\n Examples of terms: the proof that  2 + 2 = 4 (a term of type  2 + 2 = 4), the proof of Fermat’s Last Theorem (a term of type  ∀ x y z : ℕ, n &gt; 2 ∧ x^n + y^n = z^n → x*y = 0)\n  So our mental model of the claim  π : ℝ is that  ℝ, the type, is “a collection of stuff”, and  π, the term, is a member of that collection. If we continue with this analogy, it says that the statement  2 + 2 = 4 is some kind of collection, and a proof of  2 + 2 = 4 is a member of that collection. In other words, Lean is suggesting that we model the true/false statement  2 + 2 = 4 as being some sort of a set, and a proof of  2 + 2 = 4 is an element of that set. Now in Lean, it is an inbuilt axiom that all proofs of a proposition are  equal. So if  a : 2 + 2 = 4 and  b : 2 + 2 = 4 then  a = b. This is because we’re working in the  Prop universe — this is how Propositions behave in Lean. In the  Type universe the analogue is not  remotely true — we have  π : ℝ and  37 : ℝ and certainly  π ≠ 37. This special quirk of the  Prop universe is called “proof irrelevance”. Formally we could say that if  P : Prop, if  a : P and if  b : P then  a = b. Of course if a Proposition is false, then it has no proofs at all! It’s like the empty set. So Lean’s model of Propositions is that the true ones are like sets with 1 element, and the false ones are like sets with 0 elements.\n Recall that if  f : X → Y then this means that  f is a function from  X to  Y. Now say   and   are Propositions, and let’s say that we know  . What does this  mean? It means that   implies  . It means that if   is true, then   is true. It means that if we have a proof of   we can make a proof of  . It is a function from the proofs of   to the proofs of  . It is a function sending an element of   to an element of  . It is a term of type  P → Q. Again: a proof   of   is a term  h : P → Q. This is why in the natural number game we use the  → symbol to denote implication.\n Let  false denote a generic false statement (thought of as a set with 0 elements), and let  true denote a generic true statement (thought of as a set with 1 element). Can we construct a term of type  false → false or a term of type  true → true? Sure — just use the identity function. In fact, in both cases there is a unique function — the hom sets have size 1. Can we construct a term of type  false → true? Sure, there is a function from the set with 0 elements to a set with 1 element, and again this function is unique. But can we construct a term of type  true → false? No we can’t, because where do we send a proof of  true? There are no proofs of  false to send it to. So  true → false is a set of size 0. This corresponds to the standard truth table for  →, where the first three statements we analysed were true and the last was false.\n  So what does a proof of  ∀ x y z : ℕ, n &gt; 2 ∧ x^n + y^n = z^n → x*y = 0 look like? Well, there is an arrow involved in that Proposition, so the statement of Fermat’s Last Theorem is some kind of set of the form  , which means that in Lean, a proof of Fermat’s Last Theorem is actually a function! And here is what that function does. It has four inputs. The first three inputs are natural numbers  x,  y and  z. The fourth input is a proof: it is a proof of the Proposition  n &gt; 2 ∧ x^n + y^n = z^n. And the output of this function is a proof of the Proposition  x*y = 0. This is quite an unconventional way to think about what the proof of Fermat’s Last Theorem is, and let me stress that it does not help at all with actually trying to understand the proof — but it is a completely consistent mental model for how mathematics works. Unifying the concept of a number and a proof — thinking of them both as terms — enables you to think of proofs as functions. Lean is a functional programming language, and in particular it is designed with functions at its heart. This, I believe, is why theorem provers such as Lean, Coq and Isabelle/HOL, which use type theory, are now moving ahead of provers such as Metamath and Mizar, which use set theory.\n  2 + 2 = 5,  (∀ a : ℕ, a + 0 = a)", "posttime": "2020-06-23 23:08:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "类型论,type,证明", "title": "类型论中的数学", "title_en": "Mathematics in Type Theory", "transed": 1, "url": "https://xenaproject.wordpress.com/2020/06/20/mathematics-in-type-theory/", "via": "", "real_tags": ["类型论", "type", "证明"]}]