[{"category": "", "categoryclass": "", "imagename": "411ae869493858146088f37087a3779f.jpg", "infoid": 1069628, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "评论：按照 Google 的标准，DuckDuckGo 很小，但该公司正在证明，只要有更多的隐私，就很有可能赚到很多钱。我离不开 DuckDuckGo 的广告牌。在犹他州的 I-15 州际公路上，DuckDuckGo 的广告牌宣扬和平、爱和隐私（这里有一个 DuckDuckGo 广告牌的例子）。尽管浏览器市场份额微不足道，但 DuckDuckGo 自 2014 年以来一直盈利，去年创造了超过 1 亿美元的收入。尽管 StatCounter 将 DuckDuckGo 的移动市场份额（其最强大的平台）在 2021 年 6 月定为 0.04%。事实证明，您不需要拥有霸权的市场份额就可以在搜索引擎领域过上舒适的生活。您也不必出售用户隐私。谁知道？尽管我们可能会抵制在线跟踪的想法，但我们经常被告知有必要为我们提供个性化的结果。 DuckDuckGo 首席执行官 Gabriel Weinberg 不同意：搜索引擎需要跟踪您的个人搜索历史以赚钱或提供高质量的搜索结果，这实际上是一个很大的神话。几乎所有搜索引擎（包括谷歌）的收入都是基于你输入的关键字，而不知道你的任何信息，包括你的搜索历史或他们收集的关于注册和非注册用户的看似无穷无尽的额外数据点一样。事实上，搜索广告商通过对关键字而不是人进行出价来购买搜索广告……这种基于关键字的广告是我们的主要商业模式。此外，温伯格认为，没有人需要在线跟踪的大量数据来提供出色的客户体验或赚钱。 “事实是，例如，如果这些公司在网络上删除所有这些隐藏的跟踪器并将其保留的数据量限制在最必要的范围内，它们仍然会获得巨额利润。”支持这一说法的是 DuckDuckGo 的财务成功。不，这不是 1470 亿美元，这是 Google 去年的广告收入。但 DuckDuckGo 以极少的市场份额净赚了 1 亿美元。图 A 显示了移动设备的 StatCounter 数据，这是 DuckDuckGo 最强大的市场。它在台式机上的市场份额仍然可以忽略不计。\n谷歌当然是这里的佼佼者。但令人印象深刻的是 DuckDuckGo 拥有比 Bing 更大的市场份额，尽管它背后没有大公司的利益。如果我们将自己限制在美国的移动市场份额，那么 DuckDuckGo 仅次于谷歌（尽管遥遥领先）。 DuckDuckGo 搜索流量在过去一年中增长了 55%，估计有 70 到 1 亿用户。这可能就是为什么该公司吸引了个人投资者名人录的原因：万维网的创始人蒂姆·伯纳斯·李、Lotus 和后来的 Mozilla 的创始人米奇·卡波尔，以及 WhatsApp 的联合创始人布赖恩·阿克顿。这就是为什么我只是将 Chrome（笔记本电脑和 iPhone）上的默认搜索引擎切换到 DuckDuckGo，看看我是否通过收回一些隐私来放弃任何东西。这可能也是你想要考虑的事情。如果您每天只能阅读一个技术故事，就是这样。已送达 工作日 今天注册", "note_en": "Commentary: DuckDuckGo is small by Google&#39;s standards, but the company is proving it&#39;s very possible to make a lot of money with just a bit more privacy.\n  I can&#39;t get away from DuckDuckGo&#39;s billboards. All along I-15 in Utah, DuckDuckGo&#39;s billboards proclaim peace, love and privacy ( here&#39;s an example of a DuckDuckGo billboard). Despite negligible browser market share,  DuckDuckGo has been profitable since 2014 and generated over $100 million in revenue last year. This is despite StatCounter pegging  DuckDuckGo&#39;s mobile market share (its strongest platform) at .04% in June 2021.\n It turns out you don&#39;t need to have hegemonic market share to make a comfortable living in search engine land. Nor do you have to sell user privacy. Who knew?\n   As much as we may resist the idea of being tracked online, we&#39;re often told it&#39;s necessary to give us personalized results.  DuckDuckGo CEO Gabriel Weinberg disagrees:\n It&#39;s actually a big myth that search engines need to track your personal search history to make money or deliver quality search results. Almost all of the money search engines make (including Google) is based on the keywords you type in, without knowing anything about you, including your search history or the seemingly endless amounts of additional data points they have collected about registered and non-registered users alike. In fact, search advertisers buy search ads by bidding on keywords, not people….This keyword-based advertising is our primary business model.\n  Furthermore, Weinberg contends, no one needs the volume of data tracked online to deliver a great customer experience or make money. &#34;The fact is, these companies would still be wildly profitable if, for example, they dropped all of these hidden trackers across the web and limited the amount of data they keep to only what is most necessary.&#34;\n  Supporting this claim is DuckDuckGo&#39;s financial success. No, it&#39;s not $147 billion, which is  what Google generated last year in advertising revenue. But DuckDuckGo netted its $100 million with dramatically less market share.  Figure A shows StatCounter data for mobile, which is DuckDuckGo&#39;s strongest market. Its market share on the desktop is still negligible.\n   Google is, of course, the standout here. But it&#39;s impressive that DuckDuckGo has greater market share than Bing, despite not having the benefit of a big corporation behind it. And if we restrict ourselves to U.S. market share in mobile, DuckDuckGo is second only to Google (albeit a distant second). DuckDuckGo search traffic has jumped 55% over the past year, with an  estimated 70 to 100 million users.\n This may be why the company has attracted a who&#39;s who of individual investors: Tim Berners-Lee, creator of the World Wide Web, Mitch Kapor, founder of Lotus and later Mozilla, and Brian Acton, cofounder of WhatsApp. And it&#39;s why I just switched my default search engine on Chrome (laptop and iPhone) to DuckDuckGo to see if I give anything up by reclaiming a bit of my privacy. It might be something you&#39;ll want to consider, too.\n  If you can only read one tech story a day, this is it. Delivered Weekdays\n        Sign up today", "posttime": "2021-07-25 16:23:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "销售,money,duckduckgo", "title": "DuckDuckGo 如何通过销售搜索而不是隐私来赚钱", "title_en": "How DuckDuckGo makes money selling search, not privacy", "transed": 1, "url": "https://www.techrepublic.com/article/how-duckduckgo-makes-money-selling-search-not-privacy/", "via": "", "real_tags": ["销售", "money"]}, {"category": "", "categoryclass": "", "imagename": "68bbc6479fd614b4a23e5bede0e593a6.jpeg", "infoid": 1069626, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Eddie Darwich 和他的妻子 Abeer 在北卡罗来纳州威尔明顿的 Castle Hayne 路经营 EZ Mart 加油站已经十一年了，直到汽油干涸的那一天。起初，他对其他加油站老板表示怀疑，他们打电话给他，称Colonial Pipeline 发生了一场奇怪的计算机黑客攻击，该公司经营着为美国东海岸大部分地区提供服务的燃料管道网络。管道已经关闭，由于惊慌失措的司机购买了额外的燃料，燃气热潮正在酝酿之中。 “我不相信，”他在最近的电话采访中说。 “在地狱里不可能在美国发生这样的事情。”但这是真的。 5 月 12 日，在 Colonial 控制室的一名员工发现黑客行为五天后，Darwich 的泵就干涸了。他拼命地打电话给他的供应商，供应商告诉他唯一能做的就是等待。达里奇并不是唯一需要加油的人：十几个州的数千个加油站都处于同样的境地。 “一个多月以来，我没有见到我的客户，”他说。 “疼得很厉害。”勒索软件攻击的剖析 现在，他起诉 Colonial Pipeline，指责其安全松懈，以收回部分资金。他和他的律师还希望代表其他数百个受到黑客攻击的小型加油站。这只是在备受瞩目的勒索软件攻击之后出现的几起集体诉讼之一。 5 月份在佐治亚州对 Colonial 提起的另一起诉讼旨在为不得不支付更高汽油价格的普通消费者获得赔偿。第三个正在制定中，律师事务所 Chimicles Schwartz Kriner &amp; Donaldson-Smith LLP 正在寻求进行类似的努力。 Colonial 并不是唯一一家成为攻击目标的公司。在受到勒索软件攻击后，另一起诉讼于 6 月针对位于圣地亚哥的医院系统 Scripps Health 发起。\n大公司的网络安全失误导致了数亿美元的大型集体诉讼和和解。在 2013 年黑客入侵其系统并窃取个人信息后，零售商 Target 最终向消费者支付了 1000 万美元，向银行支付了 3900 万美元。 Home Depot 与从家装店的电脑中窃取信用卡信息的购物者达成了类似的和解。但勒索软件攻击有可能以远远超出简单的个人信息被盗和在线销售的方式影响人们。勒索软件黑客部署的软件将目标计算机系统的所有者锁定在他们的机器之外，并要求支付加密货币以换取控制权。在一个一切都在计算机上运行的世界中，这些攻击可能会造成严重破坏。医院不得不推迟手术。马里兰州的一个小镇遭受了庞大的 Kaseya IT 软件黑客攻击，其 19 台计算机中的 17 台丢失，迫使他们停止向居民收取电费，并阻止向镇上的员工发放薪水。在殖民地管道的情况下，数百个加油站被关闭，导致大量汽车等待剩余的燃料。拜登告诉普京，在最近的勒索软件攻击后，美国将采取“任何必要的行动”，白宫表示，诉讼的增加可能意味着被黑客入侵的公司和组织不再只是为了赔偿数据被盗的人。他们现在可以对各种损害承担责任，这些损害远远超出了身份盗用或信用卡欺诈风险的增加。 “这是一个非常发展和不断增长的领域，”摩根和摩根的资深集体诉讼律师约翰·扬丘尼斯说，他曾处理过针对雅虎、Equifax 和 Target 的数据泄露诉讼。他的公司参与了针对 Colonial 的诉讼，该诉讼旨在代表受黑客攻击影响的加油站所有者。 Yanchunis 说，美国公司很擅长销售东西。但他说，大多数公司的网络安全保护水平，即使是处理数百万人信息的大型公司，仍然没有达到应有的水平。\n“他们没有做的一件事和他们不擅长的一件事是保护他们的信息系统，因为它要花钱，而钱不是用来增加利润的，”他说。乔治华盛顿大学法学院教授、网络安全创始人丹尼尔·索洛夫 (Daniel Solove) 表示，在大数据泄露的早期，法院本身不愿意承认从公司的计算机系统中窃取个人信息可能会导致实际伤害。和隐私培训公司 TeachPrivacy。但他说，经过多年的反复黑客攻击，越来越多的法院开始认识到网络安全失误会以真实的方式伤害真实的人。网络安全 202：学校是勒索软件的另一个主要目标 无论哪种方式，大多数案件最终都会以和解告终，因为公司选择偿还黑客受害者的钱，而不是试图与代价高昂、旷日持久的官司作斗争。 “即使你要赢，安定下来也比打架便宜很多，”索洛夫说。勒索软件攻击的数量在过去一年激增，因为越来越多的犯罪分子意识到赚钱的潜力，并且勒索软件组织开始将他们的技术出售给其他技术不太复杂的犯罪分子。传统的网络攻击意味着黑客必须为他们窃取的信息找到买家才能赚钱，而勒索软件攻击可以让黑客更快、更可靠地获得报酬，因为绝望的公司试图重新获得对其系统的访问权。立法者正在讨论潜在的解决方案，例如通过向受害者提供政府资金来重建他们的网络来劝阻受害者不要付钱给黑客。前网络安全和基础设施安全局局长克里斯·克雷布斯（Chris Krebs）表示，政府可能要求在公用事业等关键领域工作的公司提供一定程度的安全保障。\n但即使对于安全性相对较好的公司，黑客也很难完全避免。只需要一名员工点击虚假链接或下载可疑附件，黑客就可以闯入原本安全的系统。在长周末前夕，广泛的勒索软件攻击可能袭击了“数千家”公司“安全性良好的公司有时会出现失误，”索洛夫说。如果公司丢失客户信息或遭受勒索软件攻击，则没有统一的法律标准规定公司需要什么样的安全措施才能使其免于承担责任。 “目前还不清楚护理标准是什么。这很棘手，你所要做的就是在一件事情上失败，”他说。这意味着诉讼的可能性将随着勒索软件攻击的增加而不断增加。如果律师能够合理地证明一家公司在保护其系统方面犯了某种错误，那么受害者就有了起诉的途径。在 Darwich 的案例中，他花了 10 天的时间才重新开始加油，同时看着路边的大品牌连锁加油站从其他地方用卡车运来的燃料。 EZ Mart 的大部分收入来自店内销售香烟、咖啡和小吃，如果没有汽油来吸引人们，他们的收入就会下降。当 Darwich 再次获得燃料时，他的一些老主顾已经开始去其他地方了。如果您通过本文中的推荐链接购买商品，Microsoft 和合作伙伴可能会获得补偿。在新窗口中打开 打开外部站点 在新窗口中打开外部站点", "note_en": "Eddie Darwich and his wife Abeer had been running the EZ Mart fuel station on Castle Hayne Road in Wilmington, N.C. for eleven years the day the gas dried up.\n       At first he was skeptical of the other gas station owners who were calling him with news of a strange computer hack attack on Colonial Pipeline, the company that ran the network of fuel pipes serving much of the U.S. East Coast. The pipeline had been shut down, and a rush on gas was brewing as panicked drivers bought extra fuel.\n    “I didn’t believe it,” he said in a recent phone interview. “There’s no way in hell something like this would happen in the United States.”\n But it was true. On May 12, five days after an employee in Colonial’s control room discovered the hack, Darwich’s pumps ran dry. He desperately called his supplier, who told him the only thing he could do was wait. Darwich wasn’t the only one who needed gas: thousands of stations in a dozen states were in the same bind.\n “For more than a month I did not see my customers,” he said. “It hurt a lot.”\n The anatomy of a ransomware attack Now he’s suing Colonial Pipeline, accusing it of lax security, to get some of that money back. He and his lawyers are hoping to also represent the hundreds of other small gas stations that were hurt by the hack. It’s just one of several class-action lawsuits that are popping up in the wake of high-profile ransomware attacks.\n Another lawsuit filed  against Colonial in Georgia in May seeks to get damages for regular consumers who had to pay higher gas prices. A third is in the works, with law firm Chimicles Schwartz Kriner &amp; Donaldson-Smith LLP seeking to mount a similar effort. Colonial isn’t the only company that’s been targeted. Another suit was  launched in June against the San Diego based hospital system Scripps Health after it was hit by a ransomware attack.\n Cybersecurity lapses at major companies have led to big class-action lawsuits and settlements in the hundreds of millions of dollars. Retailer Target eventually paid $10 million to consumers and $39 million to banks after  hackers broke into its systems and stole personal information in 2013. Home Depot  brokered a similar settlement with shoppers who had their credit card info stolen from the home improvement store’s computers.\n But ransomware attacks have the potential to affect people in ways that go far beyond simply having their personal information stolen and sold online.\n Ransomware hackers deploy software that locks the owner of the targeted computer system out of their machines, and demands a cryptocurrency payment in return for handing back control.\n In a world where everything runs on computers, these attacks can cause havoc. Hospitals have had to postpone surgeries. A small Maryland town  hit by the sprawling Kaseya IT software hack lost 17 of its 19 computers, forcing them to stop billing residents for their electricity and blocking paychecks from going out to town employees. And in the case of Colonial Pipeline, hundreds of gas stations were shut down, leading to huge lines of cars waiting for what little fuel remained.\n         Biden tells Putin the U.S. will take ‘any necessary action’ after latest ransomware attack, White House says The rise in suits may mean companies and organizations that are hacked are no longer just on the hook for reimbursing people who had their data stolen. They could now be liable for all kinds of damages that go well beyond a heightened risk of identity theft or credit card fraud.\n “This is an extremely developing and increasing area,” said  John Yanchunis, a veteran class action lawyer with Morgan and Morgan who worked on data breach lawsuits against Yahoo, Equifax and Target. His firm is involved in the lawsuit against Colonial which seeks to represent gas station owners affected by the hack.\n American companies are great at selling things, said Yanchunis. But the level of cybersecurity protection at most firms, even giant ones that handle millions of peoples’ information, is still not where it needs to be, he said.\n “One thing they have not done and one thing they’re not good at is protecting their information system because it costs money, and it’s not money that goes to increase profit,” he said.\n In the early years of big data breaches, courts themselves were reluctant to acknowledge that having ones’ information stolen off a companies’ computer system could lead to actual harm, said  Daniel Solove, a professor at George Washington University Law School and the founder of cybersecurity and privacy training firm TeachPrivacy. But after years of repeated hacks, more courts have begun to recognize that cybersecurity lapses can hurt real people in real ways, he said.\n The Cybersecurity 202: Schools are another prime ransomware target Either way, most cases end up in settlements, as companies opt to pay off hack victims instead of trying to fight costly, protracted court battles.\n “Even if you’re going to win it’s a lot cheaper to settle than it is to fight,” Solove said.\n The number of ransomware attacks has ballooned over the last year as more criminals realize the potential for making money and ransomware groups start selling their tech to other, less technically-sophisticated criminals.\n Whereas traditional cyber attacks meant hackers had to find a buyer for the information they stole to make money, ransomware attacks allow hackers to get paid more quickly and reliably as desperate companies try to regain access to their systems.\n Legislators are debating potential solutions, like dissuading victims from paying hackers by providing them government money to rebuild their networks. Former Cybersecurity and Infrastructure Security Agency director Chris Krebs has  suggested the government could require a certain level of security from companies that work in critical fields, like utilities.\n But even for companies with relatively good security, hacks can be difficult to completely avoid. It only takes one employee clicking on a fake link or downloading a shady attachment for hackers to break into an otherwise secure system.\n        Widespread ransomware attack likely hit ‘thousands’ of companies on eve of long weekend “Companies with good security sometimes have lapses,” Solove said. There isn’t a unified legal standard laying out what sort of security a company needs to have to keep it from liability if it loses its customers’ information or suffers a ransomware attack.\n “It really isn’t clear what the standard of care is. It’s tricky, all you have to do is fail on one thing,” he said.\n That means the potential for lawsuits will keep growing as ransomware attacks do. And if lawyers can reasonably show that a company made some kind of mistake in protecting its system, victims will have an avenue to sue.\n In Darwich’s case, it took 10 days before he started getting gas again, all the while watching the big-brand chain gas station down the road from him getting fuel trucked in from elsewhere. The EZ Mart makes most of its money from in-store sales of cigarettes, coffee and snacks, and without gas to draw people, their revenue dropped. By the time Darwich had fuel again, some of his longtime patrons had started going elsewhere.\n  Microsoft and partners may be compensated if you purchase something through recommended links in this article.\n                Opens in a new window  Opens an external site  Opens an external site in a new window", "posttime": "2021-07-25 16:14:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,colonial,pipeline", "title": "受勒索软件事件影响的客户起诉 Colonial Pipeline", "title_en": "Colonial Pipeline Sued by Customers Affected by Its Ransomware Incident", "transed": 1, "url": "https://www.msn.com/en-us/news/us/first-came-the-ransomware-attacks-now-come-the-lawsuits/ar-AAMxd5i", "via": "", "real_tags": ["软件", "colonial", "pipeline"]}, {"category": "", "categoryclass": "", "imagename": "fb232d1a582a2219219baaba42052fed.jpg", "infoid": 1069625, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "受人尊敬的彭博社记者马克·古尔曼今天在最新一期的 Power On 通讯中表示，苹果计划在未来“几年”内​​将 Face ID 引入 Mac。在时事通讯中，古尔曼表示，他相信苹果的最终目标是将其所有产品都转移到 Face ID，包括 iPhone SE 和 iPad Air 等低端 iPhone，它们都具有 Touch ID。 Gurman 表示，“Touch ID”仍然是 Apple 产品阵容的重要组成部分，尤其是对于低端机型，因为它是 Face ID 的“更便宜的替代品”，同时继续为用户提供安全保障。但我希望这最终会改变。今年不会发生，但我敢打赌 Mac 上的 Face ID 会在几年内推出。我希望所有 iPhone 和 iPad 也能在这段时间内过渡到 Face ID。最终，嵌入屏幕的摄像头将通过消除顶部的缺口来帮助区分苹果价格更高的设备。面部识别传感器为 Apple 提供了两个核心功能：安全性和增强现实。 Touch ID，方便与否，只提供前者。 Gurman 此前曾报道称，由于苹果计划最近推出重新设计的 24 英寸 iMac，它最初计划包含 Face ID，但 Face ID 的实施已推迟到即将到来的 iMac 重新设计。 Gurman 指出，与 iPhone 和 iPad 不同，Mac 笔记本电脑的屏幕明显更薄，因此更难安装面部识别所需的深度传感器。更进一步，Gurman 表示，苹果最终将把 Face ID 嵌入到屏幕中，而不再需要 iPhone 上的刘海。苹果分析师郭明錤认为，这种“iPhone”最早可能会在 2023 年问世。 至于 Mac 台式机，苹果正在继续开发 27 英寸 iMac 的替代品，它可能具有更大的屏幕和更强大的“M2X”芯片.今年早些时候，苹果公司暂停了更大的‌iMac‌的工作，专注于今年四月发布的24英寸‌iMac‌。不明白为什么这需要苹果这么长时间。 Mac 可以说是 FaceID 最强大的用例。我觉得古尔曼在这些时事通讯中比实际提供新信息更具预测性。\n我预测这将与苹果一直在构建的 macOS 的“iOS 风格”锁定密切相关。 Hazel、小飞贼、Rogue Ameoba 都将处于危险之中，但围墙花园羊会很高兴。把持不同意见的人称为绵羊是不好的论据和彻头彻尾的粗鲁人，你首先从我这里听到的： - 新 Mac 将在未来几年内不断推出 - 他们将拥有更薄的挡板和更新的屏幕技术 - 因为它们将推出，它们将是迄今为止最好的 Mac 我很惊讶 Mac 还没有它。使用电脑的人总是盯着它看，很少戴面罩，所以看起来 FaceID 效果很好，会让整个体验更加愉快。完全胡说八道。诚实的标题：“Gurman 对立即被证明是错误的预测感到不满，因此将预测延长到数年而不是数月”，根据 9to5Mac 的新传闻，苹果正在开发一种外部显示器，其中包括带有神经引擎的 A13 芯片。带有神经引擎的 A13 芯片可能会用作 eGPU，但目前细节尚不清楚。在外部显示器中内置 CPU/GPU 可以帮助 Mac 提供高分辨率图形，而无需使用计算机内部芯片的所有资源......周四 Apple Music 将为 Kanye West 的第十张录音室专辑的首映举办全球直播，名为“唐达”。售罄的活动将在佐治亚州亚特兰大的梅赛德斯-奔驰体育场举行，Apple Music 的直播将于东部时间晚上 8:00 开始。直播是在 NBA 总决赛期间播出的 Beats Studio Buds 广告中披露的。该广告以美国曲目...\n根据 DigiTimes 的一份报告，第三代 AirPods 可能会在同一场发布会上发布，展示苹果即将推出的 iPhone 13 系列，该报道援引熟悉此事的消息人士的话称。该报告总体上与之前的报道相呼应，即第三代 AirPods 的生产将于 8 月开始，这意味着很容易预计不久之后就会推出。 DigiTi... iDOS 2 是一款旨在让用户玩经典 DOS 游戏的应用程序，该应用程序的创建者今天表示，该应用程序将很快从 App Store 下架。据 iDOS 开发者李超吉称，他试图向 App Store 提交带有错误修复的 iDOS 更新，但被告知更新被拒绝，因为它违反了 App Store 2.5.2 指南，即应用程序无法安装或启动可执行代码。 Durin... 昨天，DigiTimes 声称即将推出的 iPad mini 将配备 mini-LED 显示屏，但现在，显示器分析师 Ross Young 对该报告提出异议，声称虽然更新后的 iPad mini 继续按计划进行今年发布，它不会配备迷你 LED 显示屏。 Young 说他与 Radiant Opto-Electronics 进行了“确认”，DigiTimes 声称该公司将为 Apple 提供......即将推出的 AirPods Pro 固件更新现在可以作为测试版提供给 Apple Developer Program 成员。 AirPods Pro 固件测试版一具有 FaceTime 空间音频和环境降噪功能。自定义透明度模式，包括对话增强，最初预计将包含在测试版中，但似乎已推迟到更高版本。苹果公司宣布了这一消息……有传言称，苹果公司计划推出一款经过重大重新设计的新 iPad mini，包括更大的 8.5 英寸至 9 英寸显示屏，边框更窄，Touch ID 电源按钮取代 Home 按钮，以及USB-C 端口而不是 Lightning 连接器，等等。根据今天 DigiTimes 报告的付费预览，第六代 iPad mini 还将配备一个 mini-LED 显示屏：BLU……Apple 的 MacBook Pro 和 MacBook Air 系列今天全面看到了历史最低折扣，包括2019 年 16 英寸 MacBook Pro、2020 年 13 英寸 MacBook Air 和 2020 年 13 英寸 MacBook Pro。注意：MacRumors 是其中一些供应商的附属合作伙伴。当您单击链接并进行购买时，我们可能会收到一笔小额付款，这有助于我们保持网站的运行。 13 英寸 M1... 继今天早上 iPadOS 14.7 发布后，Apple 分享了 iOS 14.7、iPadOS 14.7、macOS Big Sur 11.5、watchOS 7.6 和 tvOS 14.7 中包含的安全更新的详细信息，所有这些更新都已发布这周出去。值得注意的是，Apple 的文档确认 iOS 14.7 和 iPadOS 14.7 更新解决了一个与 WiFi 相关的漏洞，该漏洞可能会在加入...\nApple 今日发布了 macOS Big Sur 11.5，这是 2020 年 11 月推出的 macOS Big Sur 操作系统的第五次重大更新。macOS Big Sur 11.5 是在 macOS Big Sur 11.4 发布两个月后发布的。新的 ‌‌‌‌‌macOS Big Sur‌‌‌‌ 11.5 更新可以在所有符合条件的 Mac 上使用系统偏好设置的软件更新部分免费下载。 macOS 大屏幕...", "note_en": "Apple plans to bring Face ID to the Mac within the next &#34;couple of years,&#34; respected  Bloomberg journalist Mark Gurman said today in the latest edition of his Power On newsletter.\n In the newsletter, Gurman says that he believes Apple&#39;s ultimate goal is to shift all of its products to Face ID, including the lower-end iPhones such as the  iPhone SE and the  iPad Air, which feature  Touch ID. Gurman says ‌Touch ID‌ remains an important part of Apple&#39;s product lineup, especially for lower-end models, thanks to it being a &#34;cheaper alternative&#34; to Face ID while continuing to provide security to users.\n But I expect that to eventually change. It won’t happen this year, but I’d bet Face ID on the Mac is coming within a couple of years. I expect all iPhones and iPads to transition to Face ID within that timeframe, too. Eventually, a camera embedded in the screen would help differentiate Apple’s pricier devices by eliminating the notch at the top. The facial recognition sensor gives Apple two central features: security and augmented reality. Touch ID, more convenient or not, only provides the former.\n Gurman had  previously reported that as Apple was planning its recently launched redesigned 24-inch  iMac, it had initially planned to include Face ID, but that Face ID implementation has been delayed to an upcoming ‌iMac‌ redesign instead. Unlike iPhones and iPads, Mac laptop screens are significantly thinner, making it harder to fit the necessary depth sensors for Face ID, Gurman notes.\n Further down the line, Gurman says Apple will eventually embed Face ID into the screens themselves, abandoning the need for a notch on the  iPhone. Apple analyst  Ming-Chi Kuo believes such an ‌iPhone‌  may debut as early as 2023. As for the Mac desktop, Apple is  continuing to develop a replacement for the 27-inch iMac which may feature a larger screen and a more powerful &#34;M2X&#34; chip. Apple earlier this year paused work on the larger ‌iMac‌ to focus on the 24-inch ‌iMac‌, which was released this past April.\n Don’t understand why this is taking Apple so long. The Mac is arguably the strongest use case for FaceID.\n I&#39;m feel like Gurman is more predicting than actually giving new information in these newsletters.\n I predict this will go hand in hand with the &#34;iOS Style&#34; lockdown of macOS which apple has been building toward.  Hazel, Little Snitch, Rogue Ameoba will all be in jeopardy but the walled garden sheep will be happy.\nCalling people with a different opinion sheep is bad argumentation and downright rude\n Folks, you heard it from me first:  - new Mac will keep coming in the next couple of years  - they will have thinner bazels and newer screen tech  - As they will be launched, they will be the best Mac to date\n I&#39;m amazed the Mac doesn&#39;t have it already. A person using their computer is always looking at it and rarely masked, so it seems like FaceID would work well and would make the entire experience more pleasant.\n Complete nonsense.  Honest headline: “Gurman upset with predictions being instantly proven wrong so extends predictions to years rather than months”\n  Apple is developing an external display that includes an A13 chip with Neural Engine, according to a new rumor from 9to5Mac. The A13 chip with Neural Engine would presumably serve as an eGPU, though details are light at this time.\rHaving a CPU/GPU built into the external display could help Macs deliver high-resolution graphics without using all the resources of the computer&#39;s internal chip....\n Apple Music on Thursday will host a global livestream for the premiere of Kanye West&#39;s tenth studio album, titled &#34;Donda.&#34;\rThe sold-out event will take place at the Mercedes-Benz Stadium in Atlanta, Georgia, and Apple Music&#39;s livestream will start at 8:00 p.m. Eastern Time. The livestream was revealed in a Beats Studio Buds ad that aired during the NBA Finals. The ad features U.S. track...\n The third-generation AirPods will likely launch at the same event revealing Apple&#39;s upcoming iPhone 13 lineup, according to a report from DigiTimes, which makes the claim citing sources familiar with the matter.\rThe report as a whole echoes previous reporting that production of the third-generation AirPods will kickstart in August, meaning a launch shortly after can be easily expected. DigiTi...\n iDOS 2, an app designed to allow users to play classic DOS games, will soon be pulled from the App Store, the app&#39;s creator said today.\rAccording to iDOS developer Chaoji Li, he tried to submit an iDOS update with bug fixes to the App Store, but was told that the update was rejected because it violated the 2.5.2 App Store guideline that says apps cannot install or launch executable code.Durin...\n Yesterday, DigiTimes claimed that the upcoming iPad mini will feature a mini-LED display, but now, display analyst Ross Young is going at odds with that report, claiming that while the updated iPad mini continues to be on track for a release this year, it won&#39;t feature a mini-LED display.\rYoung says he &#34;confirmed&#34; with Radiant Opto-Electronics, who DigiTimes claims would provide Apple with...\n Upcoming AirPods Pro firmware updates are now available to Apple Developer Program members as beta versions.\rAirPods Pro firmware beta one features FaceTime Spatial Audio and Ambient Noise Reduction. Custom Transparency mode, including Conversation Boost, was initially expected to be included in the beta but appears to have been delayed for a later version.\rApple made the announcement...\n Apple is widely rumored to be planning a new iPad mini with a significant redesign, including a larger 8.5-inch to 9-inch display with slimmer bezels, a Touch ID power button instead of a home button, a USB-C port instead of a Lightning connector, and more.\rAccording to a paywalled preview of a DigiTimes report today, the sixth-generation iPad mini will also feature a mini-LED display:BLU...\n Apple&#39;s MacBook Pro and MacBook Air lineup is seeing all-time low discounts across the board today, including the 2019 16-inch MacBook Pro, 2020 13-inch MacBook Air, and 2020 13-inch MacBook Pro.\rNote: MacRumors is an affiliate partner with some of these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.\r13-Inch M1...\n Following the release of iPadOS 14.7 this morning, Apple has shared details on the security updates that are included in iOS 14.7, iPadOS 14.7, macOS Big Sur 11.5, watchOS 7.6, and tvOS 14.7, all of which came out this week.\rNotably, Apple&#39;s documentation confirms that the iOS 14.7 and iPadOS 14.7 updates address a WiFi-related vulnerability that could impact iOS devices when joining a...\n Apple today released macOS Big Sur 11.5, the fifth major update to the macOS Big Sur operating system that launched in November 2020. macOS Big Sur 11.5 comes two months after the release of macOS Big Sur 11.4.\rThe new ‌‌‌‌‌macOS Big Sur‌‌‌‌ 11.5 update can be downloaded for free on all eligible Macs using the Software Update section of System Preferences.\rmacOS Big Sur...", "posttime": "2021-07-25 16:13:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,gurman,id,苹果", "title": "Mark Gurman：Mac 上的 Face ID 可能会在几年内推出，所有 iPhone 和 iPad 也将在那个时间段内过渡到 Face ID", "title_en": "Mark Gurman: Face ID on the Mac is likely coming within a couple of years, and all iPhones and iPads will transition to Face ID within that timeframe, too", "transed": 1, "url": "https://www.macrumors.com/2021/07/25/face-id-for-mac-couple-of-years/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["iphone", "gurman", "id", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "f5d67df69658fd8b352d54faf64fd0ea.jpg", "infoid": 1069624, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克（Elon Musk）证实，特斯拉不会在新的 Model S 和 Model X 车辆上提供常规方向盘选项。当特斯拉推出带有“轭”蝶形方向盘的新款Model S时，引起了争议。有些人担心车轮的实际形状有问题，而另一些人则担心缺少驱动杆来选择驱动模式。然而，当特斯拉上个月开始交付新的 Model S Plaid 时，我们惊讶地发现车轮的转向比为 14.0:1 是正常的，事实证明它在较低的速度下是不切实际的。首席执行官埃隆马斯克后来证实，特斯拉确实在致力于渐进式转向，但还有几年的时间。在那之前，一些人认为特斯拉可能会提供标准的圆形方向盘作为一种选择，但首席执行官今天证实不会：马斯克坚持认为轭式方向盘值得它提供更好的仪表盘及其驾驶可视化的可见​​性.\n如果您快速列出轭轮的优缺点，那就很简单了。至于缺点，它显然不适合低速和打滑时的快速机动：作为我一生都在结冰的道路上行驶的人（魁北克出生和长大），我可以看到这是一个真正的问题对于某些操作，以在某些滑倒中重新获得控制权。 pic.twitter.com/ybJ5DOKRjJ 老实说，我不明白为什么特斯拉不把它作为一个选择，特别是因为我们知道他们开发了一个新的普通圆形轮，带有新的力触摸按钮并且没有柄。我已经听说一些售后公司正在研究第三方选项，所以至少特斯拉为此创造了一个市场。您正在阅读 Electrek — 日复一日地发布有关特斯拉、电动汽车和绿色能源新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 Electrek 以了解最新消息。不知道从哪里开始？查看我们的 YouTube 频道以获取最新评论。", "note_en": "Elon Musk has confirmed that Tesla will not offer a regular steering wheel option on new Model S and Model X vehicles.\n  When Tesla unveiled the new Model S with the “yoke” butterfly steering wheel, it was controversial.\n Some were worried about the actual shape of the wheel being problematic and others about the lack of drive stalk to choose the drive mode.\n   However, as Tesla started deliveries of the new Model S Plaid last month, we were surprised to see that the wheel had a normal 14.0:1 steering ratio, and it is proving to be  impractical at lower speeds.\n CEO Elon Musk later confirmed that Tesla is indeed working on  progressive steering, but it’s still years away.\n Until then, some believed that Tesla might offer a standard round steering wheel as an option, but the CEO confirmed today that it will not:\n  Musk insists that the yoke steering wheel is worth it for offering better visibility of the instrument cluster and its driving visualizations.\n  If you do a quick pros and cons list for the yoke wheel, it’s pretty simple.\n  As for the cons, it is obviously not ideal for low speeds and for quick maneuvers in case of slipping:\n As someone who has been driving on icy roads all of my life (Quebec born and bred), I can see it be a real problem for some maneuvers to regain controls in some slips.  pic.twitter.com/ybJ5DOKRjJ\n  Honestly, I don’t get why Tesla doesn’t make it an option, especially since we know that they developed a new regular round wheel with the new force touch buttons and no stalk.\n I’ve already heard that some aftermarket companies are working on third-party options, so at least Tesla created a market for that.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2021-07-25 16:13:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,常规,offer,方向盘", "title": "特斯拉不会在新 Model S/X 上提供常规方向盘", "title_en": "Tesla will not offer a regular steering wheel on new Model S/X", "transed": 1, "url": "https://electrek.co/2021/07/23/elon-musk-confirms-tesla-not-offer-regular-steering-wheel-model-s-x/", "via": "", "real_tags": ["特斯拉", "常规", "offer", "方向盘"]}, {"category": "", "categoryclass": "", "imagename": "2fd9de78eded3b13973c78f6403727a9.jpg", "infoid": 1069622, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一名业余骑手，安娜·基森霍夫 (Anna Kiesenhofer) 在奥运会上的胜利可能是一个惊喜，但她并不是一个被低估的骑手。在一个非凡的复出故事中，东京奥运会公路赛的冠军在 2017 年底发现自己失去了合同而退出了这项运动。她在没有职业球队的情况下来到东京，并以奥运冠军的身份离开。这位 30 岁的年轻人在跑步受伤后，于 2014 年开始了她的自行车生涯，这使她无法继续对铁人三项和铁人三项的追求。后来她加入了一支位于赫罗纳附近的加泰罗尼亚业余队，并在 2016 年赢得了西班牙国家杯的总冠军。同年，基森霍夫参加了 2.2 环 Féminin International de l&#39;Ardèche，她未能完成上个赛季的比赛在第三阶段崩溃。在 2016 年第三阶段的比赛中，Kiesenhofer 将在 Mont Ventoux 登顶，其中包括波兰车手 Anna Plichta，她后来成为她在东京的脱离伙伴。桥接后，Keisenhofer 继续攻击位于 Ventoux 底部的小组，并以 3:53 赢得 94.9 公里赛段。 Kiesenhofer 最终在比赛中获得第二名。这位当时 26 岁的球员与 Lotto Soudal Ladies 签下了她在下个赛季的第一份职业合同。然而，在一系列 DNF 之后，她于 4 月结束了 2017 年的竞选活动，并没有签署 2018 年的合同，最终离开自行车一年。 2019 年，基森霍夫以业余车手的身份重返这项运动，赢得了奥地利国家公路赛和计时赛冠军，并在世界锦标赛计时赛中排名第 20。自那以后，包括 2021 年在内，她每年都在复制她的计时赛冠军。尽管取得了成绩，但基森霍夫仍然没有参加奥运会的职业合同。\n在自行车之外，这位新的奥运冠军在维也纳技术大学和剑桥大学学习后获得了数学博士学位，然后于 2016 年在加泰罗尼亚完成了她的赛车生涯博士学位。她目前在洛桑大学工作，将研究与教学相结合。 Kiesenhofer 在计时赛方面的专长加上她在数学方面的专长，使得这位奥地利人凭借单人突破和其他车队的计算错误而获胜更加合适。在比赛之前，基森霍夫也一直在利用她的研究为奥运会做准备：本月早些时候，她在推特上发布了一张图表，展示了她为东京气温做准备的细致热适应过程。 Kiesenhofer 是第一个在奥林匹克公路赛中发起进攻的车手，最终与 Carl Oberholzer（南非）、Omer Shapira（以色列）、Vera Looser（纳米比亚）和 Anna Plichta（波兰）形成了突破，并最终达到了间隔11分钟。在 Looser 和 Oberholzer 被淘汰后，Kiesenhofer 攻击了她剩下的两个脱离同伴，并通过计时赛跑了 40 多公里到达终点。在 Shapira 和 Plichta 被其余的大部队抓住后，其余的车手似乎相信他们正在争夺金牌，而没有意识到 Kiesenhofer 仍在前面。然而，虽然基森霍夫可能是其他主力部队的一个误判让基森霍夫保持了两分钟以上的领先优势，但她的对手的失误不应该减损奥地利人的努力和最终的胜利。", "note_en": "As an amateur rider,  Anna Kiesenhofer’s  Olympics victory might have been a surprise, but she was not a rider to be underestimated.\n  In an extraordinary comeback story, the winner of the road race at the  Tokyo Olympics left the sport at the end of 2017 when she found herself out of contract. She came into Tokyo without a pro team and left as Olympic Champion.\n  The 30-year-old began her cycling career in 2014 after sustaining running injuries that prevented her from continuing her pursuits of triathlon and duathlon. She later joined a Catalan amateur team based near Girona and went on to win the Spanish National Cup overall in 2016.\n  That same year, Kiesenhofer entered the 2.2 Tour Cycliste Féminin International de l&#39;Ardèche, which she had failed to finish the previous season due to a crash on the third stage. On the third stage of the 2016 edition, which featured a summit finish on Mont Ventoux, Kiesenhofer bridged to a breakaway group which, amongst others, contained the Polish rider Anna Plichta, who would later become her breakaway companion in Tokyo.\n   After bridging, Keisenhofer then went on to attack the group at the bottom of Ventoux and won the 94.9km stage by 3:53. Kiesenhofer eventually took second overall in the race.\n  The then-26-year-old signed her first professional contract with Lotto Soudal Ladies for the following season. However, after a series of DNFs, she ended her 2017 campaign in April and did not sign a contract for 2018, eventually taking a year off the bike.\n In 2019, Kiesenhofer came back to the sport as an amateur rider, winning the Austrian national road race and time trial championships and placing 20th in the World Championship time trial. She has gone on to replicate her time trial win every year since, including 2021. Despite her results, Kiesenhofer was still without a professional contract going into the Olympics.\n Off the bike, the new Olympic Champion has a PhD in mathematics after studying at the Technical University of Vienna as well as at Cambridge University before completing her doctorate in Catalonia in 2016 alongside her racing career. She currently works at the University of Lausanne, combining research with teaching.\n  Kiesenhofer’s specialism in time trialling coupled with her mathematics expertise make it all the more fitting that the Austrian won by solo breakaway and after a calculation error from the rest of the peloton.\n Before the race, Kiesenhofer had also been using her studies to prepare for the Games: earlier this month, she  Tweeted a graph demonstrating her meticulous heat acclimation process in preparation for the temperatures in Tokyo.\n Kiesenhofer was the very first rider to attack in the Olympic road race, eventually forming a breakaway alongsize Carl Oberholzer (South Africa), Omer Shapira (Israel), Vera Looser (Namibia), and Anna Plichta (Poland) which went on to reach a gap of 11 minutes. After Looser and Oberholzer were dropped, Kiesenhofer attacked her two remaining breakaway companions and time-trialled her way to the finish for over 40km.\n After Shapira and Plichta were caught by the remainder of the peloton the rest of the riders seemed to believe that they were racing amongst themselves for Gold, unaware that Kiesenhofer was still in front.\n However, while it might have been a miscalculation from the rest of the peloton that allowed Kiesenhofer to maintain her lead of more than two minutes, her rivals&#39; mistakes should not detract from the Austrian’s efforts and eventual win.", "posttime": "2021-07-25 16:12:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "自行车,kiesenhofer,计时赛", "title": "数学家安娜·基森霍夫 (Anna Kiesenhofer) 在东京赢得公路自行车金牌", "title_en": "Anna Kiesenhofer, Mathematician, wins road cycling gold In Tokyo", "transed": 1, "url": "https://www.cyclingnews.com/features/anna-kiesenhofer-mathematician-amateur-cyclist-olympic-champion/", "via": "", "real_tags": ["自行车", "计时赛"]}, {"category": "", "categoryclass": "", "imagename": "f46c271a56aefb1594b45bbbcc22bede.png", "infoid": 1069620, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "疫苗正在通过两种方式应对 COVID-19 大流行：降低感染的严重程度，并防止其传播。这两种机制都可以挽救生命，但利用每种机制的疫苗接种策略可能会相互冲突。前者鼓励社会最弱势群体接种疫苗，否则他们可能会死于严重感染。后者鼓励为可能对病毒传播做出最大贡献的高度联系的人接种疫苗，即不是在家中的体弱者。许多国家已经实施了分阶段的疫苗接种策略。这些通常从老年人和一线医疗工作者开始，然后再通过更年轻的年龄组工作。老年人符合最容易受到感染的人群，而一线医护人员则是最有可能广泛传播的人群（特别是：传播给最危险的人群）。但阻断传播策略的支持者可能会提倡在老年人之前为其他群体（例如年轻人或送货司机）接种疫苗。本文调查了在较脆弱但疾病传播较少的群体之前为较不脆弱但疾病传播较多的群体接种疫苗的影响。后续部分解释了构建简单隔室模型的过程，以及如何使用它们来模拟不同人群中的不同疫苗接种策略。房室模型是对传染病建模的简单、确定性方法。在 SIRD 模型中，人口分布在四个“隔间”中 - 易感、传染性、已移除、已死亡。 SIRD 模型有很多变体，但出于我们的目的，我们假设没有出生或死亡不是感染的结果，并且被移除的个体仍然处于免疫状态（即他们不会再次变得易感）。随着时间的推移，个人在这些隔间之间取得进展，如下所示（图 2）。在每个时间步长，感染者分别根据恢复率和死亡率 γ 和 ω 进入移除（也称为“恢复”）和死亡状态： \\( R_{t+1} = R_{t} + \\gamma I_{t} \\) 和 \\( D_{t+1} = D_{t} + \\omega I_{t} \\)。从易感状态转移到感染状态的人数由感染率\\(\\beta\\)乘以易感人数\\(S\\)，再乘以遇到的人数比例决定被感染的人数，\\( \\frac{I}{N} \\)，其中\\( N \\) 是活着的人数， \\( S + I + R \\)。更正式地：\\( S_{t+1} = S_{t} - \\frac{\\beta S_{t}I_{t}}{N_{t}} \\) 和 \\( I_{t+1} = I_ {t} + \\frac{\\beta S_{t}I_{t}}{N_{t}} - \\gamma I_{t} - \\omega I_{t} \\)。上面显示了一个示例 SIRD 模型（图 3），大致基于英国。我们的总体起始人口为 6700 万，我们假设 20% 的人口已经从 COVID-19 中恢复过来，这样 \\( R_0 = 13.4M \\)。我们还假设目前有 1/160 人患有 COVID-19，因此 \\( I_0 = 419k \\)。这给我们留下了\\（S_0 = 53.2M \\）的剩余易感人群。\n对于费率，我们选择 \\( \\gamma = 0.1 \\)，这相当于 10 天的恢复时间。对于死亡率，\\( \\omega = 0.00075 \\) 相当于 0.75% 的感染者死亡（由 \\( 0.75 = \\frac{\\omega}{\\omega + \\gamma} \\times 100\\) 计算）。最后，我们设置 \\( \\beta = 0.5 \\)，因为这给出了一个夸大的感染曲线，出于说明目的，它在 ~17.4M 处达到了很好的峰值。这种情况或许可以解释为在没有社会疏远措施的情况下，由于 COVID-19 的快速传播而可能出现的那种失控的流行病。表 1 显示了上述 100 天模拟的结果，5320 万初始易感人群中有 98.7% 被感染，其中 38 万人死亡。在最简单的形式中，SIRD 模型假设一个同质的群体，但我们可以扩展它来模拟子群体的组合。我们通过为每个组设置不同的 S、I、R、D、隔间（例如 \\（S = S^A + S^B + S^C \\），\\（ I = I^A + I^B + I^C \\) 等），我们指定它们自己的恢复率和死亡率（\\( \\gamma^A \\) , \\( \\gamma^B \\) , \\( \\gamma^C \\) , \\( \\ omega^A \\) , \\( \\omega^B \\) , \\( \\omega^C \\))。感染率 \\(\\beta\\) 稍微复杂一些，可以指定为每组内部和之间的感染率矩阵，如下所示（图 4）。在这个框架内，两组之间的感染率可以反映它们之间的混合程度。例如，在年龄结构模型中，老年人和年轻人之间的感染率将远低于年轻人内的感染率。为简单起见，我们将使这个矩阵对称，假设两个组之间对感染的敏感性在两个方向上相等（尽管模型不需要这样做）。有了这个简单的模型，我们可以重复英国的模拟，但将人口分为不同的年龄组。我们估计了三个年龄组 - &lt;40、40-80、&gt; 80 - 每个年龄组的起始人口分别为 31M、31M 和 5M。我们再次假设 1/160 人被感染，20% 的人已经从 COVID-19 中康复，并且从感染中恢复的时间为 10 天（\\( \\gamma = 0.1 \\)）。很难找到这些年龄组死亡率的可靠数据，但根据 gov.uk，将 &gt;80 的死亡率近似为 40-80 的八倍似乎是合理的，而 40-80 的死亡率本身是 &lt; 的八倍40.下面显示的值（表 2）产生的总死亡率为 0.77%，与我们上面的标准 SIRD 模型相当。很难找到具有科学依据的 \\( \\beta \\) 值，但与年轻人群中传播率较高的假设一致，我们假设年龄组内的传播率随着年龄的增长而降低。我们还假设年龄组内的传播率高于年龄组之间的传播率。上表中的值完全是主观的，但为探索手头的问题产生了合理的结果。年龄结构结果（图 5 和表 3）与我们最初的英国 SIRD 模型相当，但我们现在可以看到划分为三个年龄组的隔间。\n最后一步是将疫苗接种推广纳入模型。这可以通过在每个时间步简单地将固定数量的易感人群 \\( n_v \\) 移动到接种状态 \\( V \\) 来实现。在结构化模型中，我们可以指定每个组应优先接种疫苗的顺序。对于每天为 10 万人接种疫苗的疫苗接种活动，按照年龄组从大到小的顺序，我们得到了图 7 所示的结果。就在模拟开始前 50 天，没有更多易感人群可供接种。那么哪种策略可以挽救更多生命——先接种疫苗还是先接种疫苗？根据表 4，答案很明确：从社会最古老的开始。但这是我们量化成功的最佳指标吗？有些人坚持认为你不能为人的生命赋予价值。这些人从未与经济学家交谈过。事实上，经济学家一直在这样做，而且方便的是，有些经济学家已经在 COVID-19 和英国的背景下这样做了。通过考虑贴现的质量调整生命年 (dQALYs) 而不是原始死亡人数，我们可以以经济学家非常喜欢的那种冷酷但不可否认的务实方式贬低老年人的价值。也许这种观点有利于先给年轻人接种疫苗？表 5 显示了与表 4 等效的模拟结果，但这次基于 dQALYs 丢失。 1对于 &lt;40、40-80 和 &gt;80 岁的年龄组，一次死亡分别相当于 16.62、7.04 和 2.00 dQALYs 的损失。表 5. 三个年龄组因不同疫苗接种而损失的 dQALY 计数。尽管两种疫苗接种策略损失的总 dQALY 现在相对接近，但即使按照这种措施，先给老年人接种疫苗仍然是更好的选择。 COVID-19 大流行在很大程度上是由超级传播者事件驱动的，这已经不是什么秘密了。诸如基本繁殖数 R 之类的人口级别测量掩盖了感染传播方式的真实复杂性（注意：这与我们模拟中讨论的“已移除”隔间不同的 R）。\n受感染人群的传播并不统一和平等：适用类似帕累托原理的效应，其中大部分传播是由少数个体引起的。至关重要的是，超级传播者的影响比最初的超级传播事件持续时间更长——它在整个大流行中传播并不可逆转地复合。无数 COVID-19 超级传播事件已被记录在案，包括韩国教堂、白宫和比利时圣诞老人，仅举几例。到目前为止，我们简单的英国启发模型的结果显然支持首先为老年人接种疫苗。我们传播最多的 &lt;40 岁年龄组存活率太高且疾病传播不足，无法证明优先接种疫苗是合理的。但是，是否存在超级传播者场景，即对极少数极易传播的个体进行有针对性的疫苗接种会取得更好的流行结果？对于这个最后的实验，我们保留了与之前相同的 &lt;40、40-80、&gt; 80 年龄组，再次分别使用了 31M、31M 和 5M 的人群。但是现在，我们还插入了一组 10k 超级传播者。鉴于超级传播者在流行病的早期具有更大的影响，我们将通过假设每组中只有 1% 的人已经从感染中康复（以前为 20%）来模拟这一点，并且每组中只有 1/1600 目前受到感染（以前是 1/160）。我们将保持与以前相同的恢复率和道德水平。表 6. 用于具有超级传播者的 SIRVD 模型的参数，松散地基于英国在封锁的早期流行情况下。在这种情况下，我们还将通过将我们之前的年龄组之间的传播率降低三倍来模拟类似锁定的条件。我们将假设新添加的超级传播者组与所有组都有 \\( \\beta=20 \\) ，这比所有其他配对高 67-250 倍。同样，通过模仿封锁来减缓流行病会使超级传播者的影响更加明显。最后，我们在 365 天的时间段内运行此模拟，而不是像以前一样的 100 天，因为类似锁定的流行病场景会在更长的时间内发生。从图 9 中的结果中，我们看到，通过在更脆弱的个体之前接种疫苗来减轻超级传播者的影响，通过拉平曲线™ 并允许更多人在被感染之前接种疫苗，从而减少了总死亡人数。 10k 超级传播者的优先和立即接种导致死亡人数减少 10k，dQALYs 损失比首先接种老年人少 420k（表 7）。\n1对于超级传播者组，&lt;40、40-80 和 &gt;80，一个死亡分别等于 16.62、16.62、7.04 和 2.00 dQALYs 损失。表 7. 三个年龄组因不同疫苗接种而损失的 dQALY 计数。精明的读者可能会怀疑建模参数的强烈偏差以及为该模拟构建的假设场景的变化——这是正确的。这些是设计有利于在最脆弱的人群之前接种最易传播的疫苗的结果所必需的剧烈变化。除了最人为设计的情况外，COVID-19 对老年人的致命性比对年轻人来说要高得多，因此首先给最年长的人接种疫苗无疑是最好的选择。就其性质而言，超级传播者可能比大多数人更早被感染，因此在流行病早期进行干预的机会窗口很小。到流行的中后期阶段，绝大多数超级传播者已经被感染，他们的超大疾病传播已经实现。除了最人为设计的情况外，COVID-19 对老年人的致命性比对年轻人来说要高得多，因此首先给最年长的人接种疫苗无疑是最好的选择。当然，这个提议的疫苗推出策略存在实际和伦理问题。首先，您如何立即识别这一小群有毒的超级传播者？即使你能以某种方式，你能不能给他们接种疫苗？如果他们不遵守怎么办？人们可能会怀疑“恶性超级传播者”和“反vaxxer”是同一枚硬币的两个方面。我们也没有理由把老人留到最后。该模拟的最佳策略是首先为超传播超级传播者接种疫苗，然后按照从最老到最年轻的顺序对其余年龄组进行疫苗接种。这类似于现实世界中看到的策略，例如英国的推出（图 10）。这些模型的局限性不胜枚举。它们满足探索疫苗接种优先顺序问题所需的最低复杂程度，但仅此而已。可以说，这些模型对于应用于现实世界来说过于简单了——但它们确实让我们能够得出一些简单的结论。\n我们从一个假设开始，即与优先接种更脆弱但疾病传播程度较低的人群相比，对较不脆弱但疾病传播较多的个体进行疫苗接种可能会取得更好的流行结果。我们假设这些配置文件分别映射到年轻人和老年人群，但发现优先为老年人和弱势群体接种疫苗会导致更少的死亡和 dQALYs 损失。有了这些令人印象深刻的结果，我们然后将这个想法夸大为一个成熟的超级传播者场景，并发现在更戏剧性的一组条件下，假设优先接种（以某种方式）一小群超级传播者会更好。即便如此，与这些超级传播者一起为最脆弱的人群接种疫苗仍然是有意义的。这有什么实际的收获吗？撇开负面含义不谈，超级传播个体的特征千差万别。一名治疗 COVID 感染患者的 ICU 护士是一个潜在的超级传播者，纯粹是因为他的职业，因为他会受到大量高风险暴露事件的影响。未经批准的封锁狂欢的推动者也是一个明显的超级传播者候选人，因为非法狂欢是高风险的，尽管事件相对罕见。相反，Deliveroo 司机将有许多潜在的暴露事件，但由于互动期间的接触时间有限，每个事件的风险都较低。我们可以将这些配置文件映射到一个超级传播者矩阵（图 11），其中右上象限中的组具有最高的超级传播潜力，而左下象限中的组传播疾病的可能性最低。然而，正如我们所确定的，仅这两个维度不足以设计疫苗接种策略。我们还必须考虑死亡率，以及针对这些群体进行疫苗接种的实际和伦理影响。这两个因素都与暴露事件轴的频率和风险正交。因此，考虑到所有因素，我们得出的结论反映了在现实世界中看到的疫苗推出情况。也就是说，您应该优先接种以下人群： 死亡率远高于其他人群（老年人和临床易感人群） 死亡率较低但经常接触高风险事件的人群 - 特别是与易感人群互动的人群（前线医护人员）\n也许 - 至少在流行病的最初阶段：高度联系的个人，无论死亡率如何，都有频繁但低风险的暴露事件（“基本工人”：送货司机、超市员工等）", "note_en": "Vaccines are tackling the COVID-19 pandemic in two ways: reducing the severity of infections, and preventing their transmission. Both mechanisms save lives, but the vaccination strategies that leverage each can be conflicting. The former encourages vaccination of society&#39;s most vulnerable, who may otherwise succumb to severe infections. The latter encourages vaccinating highly connected people who would potentially contribute most to the spread of the virus - i.e. not the homebound infirm.\n Many countries have implemented phased vaccination strategies. These typically start with the elderly and frontline healthcare workers, before working their way through younger age groups. The elderly fit the brief of those most vulnerable to infection, whereas frontline healthcare workers are amongst those with the greatest potential to transmit extensively (and specifically: transmit to the most at risk).\n  But supporters of a transmission-interrupting strategy might advocate for the vaccination of other groups - such as young people or delivery drivers - before the elderly. This article investigates the implications of vaccinating  less vulnerable but more disease-spreading groups ahead of  more vulnerable but less disease-spreading groups. The proceeding sections explain the process of constructing simple compartmental models, and how they can be used to simulate different vaccination strategies amongst various populations.\n   Compartmental models are simple, deterministic approaches for modelling infectious diseases. In an  SIRD model, a population is distributed amongst four &#39;compartments&#39; -  Susceptible,  Infectious,  Removed,  Deceased. There are many variants of the SIRD model, but for our purposes, we assume that there are no births, nor deaths that aren&#39;t a result of infection, and removed individuals remain in a state of immunity (i.e. they do not become susceptible again). Individuals progress between these compartments over time, as shown below (Figure 2).\n  At each time step, infected people move to removed (also referred to as &#39;recovered&#39;) and deceased states according to the rates of recovery and mortality,  γ and  ω, respectively: \\( R_{t+1} = R_{t} + \\gamma I_{t} \\) and \\( D_{t+1} = D_{t} + \\omega I_{t} \\).\n The number of people who move from a susceptible to an infected state is determined by the rate of infection, \\( \\beta \\), multiplied by the number of susceptible people, \\( S \\), multiplied by the proportion of people they encounter that are infected, \\( \\frac{I}{N} \\), where \\( N \\) is the number of living people, \\( S + I + R \\). More formally: \\( S_{t+1} = S_{t} - \\frac{\\beta S_{t}I_{t}}{N_{t}} \\)  and \\( I_{t+1} = I_{t} + \\frac{\\beta S_{t}I_{t}}{N_{t}} - \\gamma I_{t} - \\omega I_{t} \\).\n   An example SIRD model is shown above (Figure 3), loosely based on the UK. We have an overall starting  population of 67M, and we assume  20% of the population have already recovered from COVID-19, such that \\( R_0 = 13.4M \\).  We also assume  1/160 people currently have COVID-19, such that \\( I_0 = 419k \\). This leaves us with a remaining susceptible population of \\( S_0 = 53.2M \\).\n For the rates, we opt for \\( \\gamma = 0.1 \\), which is equivalent to a 10-day recovery time. For the mortality rate, \\( \\omega = 0.00075 \\) is equivalent to  0.75% of infected people dying (calculated from \\( 0.75 = \\frac{\\omega}{\\omega + \\gamma} \\times 100\\)). Finally, we set \\( \\beta = 0.5 \\), as this gives an exaggerated infection curve that peaks nicely at ~17.4M for illustrative purposes. This scenario could perhaps be interpreted as the sort of runaway epidemic that might arise due to rapid spread of COVID-19 in the absence of social distancing measures.\n   Table 1 shows the result of the above 100-day simulation, with 98.7% of the 53.2M starting susceptible population become infected, of whom 380k die.\n  In its simplest form, an SIRD model assumes a homogenous population, but we can extend it to simulate a combination of sub-populations. We do so by having distinct  S, I, R, D, compartments for each group (e.g. \\( S = S^A + S^B + S^C \\), \\( I = I^A + I^B + I^C \\)  etc.) for which we specify their own rates of recovery and mortality (\\( \\gamma^A \\) , \\( \\gamma^B \\) , \\( \\gamma^C \\) , \\( \\omega^A \\) , \\( \\omega^B \\) , \\( \\omega^C \\)). The rate of infection, \\( \\beta \\), is only slightly more complex, and can be specified as a matrix of infection rates within and between each group, as below (Figure 4).\n  Within this framework, the rate of infection between two groups can reflect the degree of intermixing between them. For instance, in an age-structured model, the infection rate between old and young populations will be much lower than within the young population. For simplicity, we&#39;ll make this matrix symmetric, assuming that susceptibility towards infection between two groups is equal in both directions (although the model doesn&#39;t necessitate this).\n Armed with this simple model, we can repeat the UK simulation but with the population split across separate age groups. We approximate three age groups -  &lt;40,  40-80,  &gt;80 - each with starting  populations of 31M, 31M, and 5M, respectively. We assume once again that 1/160 people are infected, 20% have already recovered from COVID-19, and that the recovery time from infection is 10 days (\\( \\gamma = 0.1 \\)). It&#39;s difficult to find reliable data for mortality rates across these age groups, but based on  gov.uk, it seems reasonable to approximate the mortality rate for  &gt;80 as eight times greater than for  40-80, which itself is eight times greater than  &lt;40. The values shown below (Table 2) produce an overall mortality rate of 0.77% that is comparable to our standard SIRD model above.\n   It&#39;s hard to find scientifically grounded values for \\( \\beta \\), but in keeping with the hypothesis that transmission rates are higher in the young population, we assume that the transmission rate within age groups decreases with age. We also assume that the transmission rate within age groups is higher than between age groups. The values in the above table are entirely subjective but produce reasonable results for exploring the question at hand.\n  The age-structured results (Figure 5 and Table 3) are comparable to our original UK SIRD model, but we can now see the compartments split across the three age groups.\n    The final step is to incorporate a vaccination rollout into the model. This can be implemented by simply moving a fixed number of susceptible people, \\( n_v \\), to a vaccinated state, \\( V \\), at each timestep. Within a structured model, we can specify the order in which each group should be prioritised for vaccination.\n  For a vaccination campaign that vaccinates 100k people per day, in the order of oldest-to-youngest age group, we get the results shown in Figure 7. Just before 50 days into the simulation, there are no more susceptible people available for vaccination.\n    So which strategy saves more lives - vaccinating the young or the elderly first? Based on Table 4, the answer is clear: start with society&#39;s oldest.\n   But is this the best metric by which we should quantify success? Some people insist that you cannot put a value on a human life. These people have never spoken to an economist. In fact, economists do this all the time, and conveniently,  some have already done so within the context of COVID-19 and the UK. By considering discounted quality-adjusted life-years (dQALYs) instead of the raw count of deaths, we can devalue older lives in the sort of coldhearted but undeniably pragmatic way that economists are so fond of. Perhaps this perspective will favour vaccinating the young first? Table 5 shows the equivalent simulation results as Table 4, but this time based on  dQALYs lost.\n  1For age groups &lt;40, 40-80, and &gt;80, one death equals  16.62, 7.04, and 2.00 dQALYs lost, respectively.   Table 5. Count of dQALYs lost across the three age groups for different vaccination rollouts.\n Although the total dQALYs lost for the two vaccination strategies are relatively close now, vaccinating the elderly first is still the better option, even by this measure.\n   It&#39;s no secret that the COVID-19 pandemic is in large part  driven by superspreader events. Population-level measures like the  basic reproduction number,  R, mask the true complexity of how infection spreads  (note: this is a different  R to the &#39;removed&#39; compartment discussed in our simulations).\n Transmission isn&#39;t uniform and equal across the infected population: a Pareto Principle-like effect applies, where the majority of transmission is due to a minority of individuals. Crucially, the impact of superspreaders outlasts the initial superspreading event - it propagates and irreversibly compounds throughout the entire pandemic. Countless COVID-19 superspreading incidents have been documented, including  a South Korean church,  the White House, and  a Belgian Father Christmas, to name but a few.\n  The results of our simple UK-inspired models so far are clearly in support of vaccinating the elderly first. Our most-transmitting  &lt;40 age group is too surviving and insufficiently disease-spreading to justify prioritised vaccination. But are there superspreader scenarios where the targetted vaccination of small groups of extremely disease-transmitting individuals would achieve a better epidemic outcome?\n For this final experiment, we retain the same  &lt;40,  40-80,  &gt;80 age groups as before, once again with populations of 31M, 31M, and 5M, respectively. But now, we also insert a group of 10k superspreaders. Given that superspreaders have a larger impact early on in an epidemic, we&#39;ll simulate this by assuming that only 1% of each group has already recovered from infection (previously 20%), and only 1/1600 of each group currently has the infection (previously 1/160). We&#39;ll keep the same rates of recovery and morality as before.\n  Table 6. Parameters used for SIRVD model with superspreaders, loosely based on the UK in an early epidemic scenario under lockdown.\n In this scenario, we&#39;ll also simulate lockdown-like conditions by reducing our previous \\( \\beta \\) transmission rates between age groups by a factor of three. We&#39;ll assume the newly-added group of superspreaders have \\( \\beta=20 \\) with all groups, which is 67-250 times higher than all other pairings. Again, slowing the epidemic by emulating a lockdown makes the impact of superspreaders more pronounced. Finally, we run this simulation over a 365-day period rather than 100 days as before, as the lockdown-like epidemic scenario plays out over a longer timeline.\n From the results in Figure 9, we see that mitigating the impact of superspreaders by vaccinating them ahead of more vulnerable individuals reduces the overall number of deaths, by   flattening the curve™ and allowing for more people to be vaccinated before they become infected.\n  The prioritised and immediate vaccination of the 10k superspreaders results in 10k fewer deaths and 420k fewer dQALYs lost than vaccinating the elderly first (Table 7).\n  1For groups Superspreaders, &lt;40, 40-80, and &gt;80, one death equals 16.62, 16.62, 7.04, and 2.00 dQALYs lost, respectively.   Table 7. Count of dQALYs lost across the three age groups for different vaccination rollouts.\n The astute reader might be suspicious of the strong deviations in modelling parameters and the change in hypothetical scenario constructed for this simulation - and rightly so. These are the sorts of drastic changes that are necessary to engineer a result that favours vaccinating the most transmitting ahead of the most vulnerable. In all but the most contrived of scenarios, COVID-19 is so much deadlier for the elderly than for the young that vaccinating the oldest people first is unequivocally the best option.\n By their nature, superspreading individuals are likely to become infected sooner than most, so there&#39;s only a narrow opportunity window early on in an epidemic to intervene. By the middle-to-late stages of an epidemic, the vast majority of superspreaders will have already become infected and their outsized disease-spreading will have been actualised.\n In all but the most contrived of scenarios, COVID-19 is so much deadlier for the elderly than for the young that vaccinating the oldest people first is unequivocally the best option.\n Of course, there are practical and ethical issues with this proposed vaccine rollout strategy. For one, how can you immediately identify this tiny group of virulent superspreaders? And even if you somehow could, would you be able to vaccinate them? What if they don&#39;t comply? One might suspect that &#34;virulent superspreader&#34; and &#34;anti-vaxxer&#34; are two sides of the same coin.\n There&#39;s also no reason why we have to leave the elderly until last. The optimal strategy for this simulation would be to vaccinate the hyper-transmitting superspreaders first, followed by the remaining age groups in the order of oldest to youngest. This resembles strategies seen in the real world, such as the UK&#39;s rollout (Figure 10).\n    The limitations of these models are too numerous to list. They meet the minimum level of sophistication required to explore the question of vaccination prioritisation, but nothing more. Suffice to say, these models are far too simplistic for application to the real world - but they do allow us to arrive at some simple conclusions.\n We started with a hypothesis that vaccinating  less vulnerable but more disease-spreading individuals may achieve a better epidemic outcome than prioritising the vaccination of the  more vulnerable but less disease-spreading. We assumed that these profiles mapped to young and old populations respectively, but found that vaccinating the old and vulnerable as a priority resulted in fewer deaths and dQALYs lost.\n With these underwhelming results, we then exaggerated the idea into a full-blown superspreader scenario and found that under a more dramatic set of conditions, it would be preferable to hypothetically vaccinate ( somehow) the small group of superspreaders as a priority. Even so, it still makes sense to vaccinate the most vulnerable in conjunction with these superspreaders.\n  Are there any practical takeaways from this? Negative connotations aside, the characteristics of superspreading individuals are highly varied. An ICU nurse treating COVID-infected patients is a potential superspreader purely as a result of his vocation, as he is subject to a high number of high-risk exposure events. A promoter of unsanctioned lockdown raves is also an obvious superspreader candidate, as illegal raves are high-risk albeit relatively infrequent events. Conversely, a Deliveroo driver will have many potential exposure events, but each would be of low risk due to the limited contact time during interactions. We can map these profiles onto a  superspreader matrix (Figure 11), where groups in the top right quadrant have the highest potential for superspreading, whereas groups in the bottom left quadrant are the least disease-transmitting.\n However, as we&#39;ve established, these two dimensions alone are insufficient to devise a vaccination strategy. We must also consider mortality rates, as well as the practical and ethical implications of targetting vaccination towards these groups. Both of these factors are orthogonal to the frequency and risk of exposure events axes.\n So all things considered, we arrive at conclusions that reflect the vaccine rollouts seen in the real world. Namely, you should prioritise the vaccination of:\n Groups with considerably higher mortalities than the rest of the population (the elderly and the clinically vulnerable)\n Groups of lower mortality, but with frequent exposure to high-risk events - particularly those that interact with vulnerable individuals (frontline healthcare workers)\n And perhaps - at least during the earliest stages of an epidemic: highly-connected individuals, regardless of mortality, with frequent but low-risk exposure events (&#34;essential workers&#34;: delivery drivers, supermarket employees, etc.)", "posttime": "2021-07-25 16:11:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "疫苗,people", "title": "在老年人之前接种疫苗可以挽救更多生命吗？", "title_en": "Could Vaccinating Young People Before Old People Save More Lives?", "transed": 1, "url": "https://www.aidancooper.co.uk/could-vaccinating-young-people-before-old-people-save-more-lives/", "via": "", "real_tags": ["疫苗", "people"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069616, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Purism 的投资产品 SPC 是一种简单有效的可转换票据，您的资金是 Purism 欠您的债务，在某些事件（到期、股权融资、董事会批准等）时转换为股权——此时您的信贷成为 Purism, SPC 的股权。我们将把投资资金用于额外零件采购，为大量生产库存做准备，继续为我们所有尊重革命性软件开发的自由提供资金，并为 Librem 5 手机的 PureOS 中更融合的应用程序提供新资金。该票据将每年赚取 3% 的利息，并在转换为股权时额外应用 8%，无需采取任何进一步行动。您的投资金额和确认信息将显示在 Purism 商店的“我的账户”中。根据 1933 年《证券法》第 501 条规定，投资者声明为合格投资者。收到投资和资金后，您即同意 2021 年 2021 年可转换本票系列的条款，日期为 2021 年 7 月 15 日。询问有关产品的条款和条件或任何其他必要信息的问题，请发送电子邮件至 ir@puri.sm 是的，如上所述；您同意的条款是日期为 2021 年 7 月 15 日的 2021 年可转换本票系列。\n可转换票据是一种投资，其中投资者将投资金额作为债务，赚取利息并在任何列出的转换事件中转换为带有红利的股权。之所以称为“可转换票据”，是因为它是可以转换为股权的本票。这是一个善意的要求，因为 Purism 无法验证您的合格投资者身份，通过投资，您表明您是合格的投资者，并且满足以下任一条件： 收入超过 200,000 美元（或 300,000 美元）与配偶或同等配偶一起）在前两年中的每一年，并且合理地预期今年相同；或 单独或与配偶或同等配偶的净资产超过 100 万美元（不包括该人主要住所的价值）；或 持有 7、65 或 82 系列许可证的良好信誉；或任何总资产超过 500 万美元的信托，不是专门为购买标的证券而设立的，其购买是由资深人士指导的；或总投资超过 500 万美元的某些实体，并非专门为购买标的证券而成立；或所有股权所有者均为合格投资者的任何实体。这被视为早期投资，通常在成长型科技公司中，您希望尽早投资并看到在转换事件（您成为股东）之后持有该投资的所有好处，并进入未来的股权事件，例如股息支付， IPO，或收购。这个过程通常以年为单位，不应被视为短期投资。不，关于可转换票据的一个简单的事情是它们是在预定事件自动转换为股权的债务工具。发生任何自动事件时，您将通过电子邮件收到通知。是的，Purism 在其网站上定期发布有关公司进展的博客文章，这是更新的权威来源。此外，还有一个面向投资者的半定期文本电子邮件通讯发送到您将自动订阅的列表（如果需要，可以取消订阅）。 Purism 的增长主要来自收入，但是，Purism 宣布在 2019 年 12 月以 250 万美元的票据结算。这体现在总投资中。我们将把投资资金用于额外零件采购，为大量生产库存做准备，继续为我们所有尊重革命性软件开发的自由提供资金，并为 Librem 5 手机的 PureOS 中更融合的应用程序提供新资金。\n我可以与我的朋友分享这个投资机会或在社交媒体上发布它吗？是的，虽然这不是公开发售，但它是向朋友、支持者以及他们的朋友和支持者提供的。除了我们的支持者和客户之外，我们不会直接向任何其他团体提供此信息，我们也不会从我们的网站或论坛链接到此活动，但我们非常欢迎您以个人身份或在您的个人社交媒体上分享媒体转载。我们希望向那些支持我们的社会目标运动并了解 Purism 带来的价值的人提供优惠及其潜在回报。这张纸币值你投资的金额，它是欠你的债。它还每年赚取 3%，转换后将额外赚取 8%，届时您将成为 Purism, SPC 的股东。不容易。查看可转换票据的最佳方式是将它们视为对您希望看到的社会目的公司未来发展的长期投资，并从其成功中获得未来收益。可以将票据转让（例如出售）给其他方，但这将由您单独和独立完成，通知 Purism 所有权的合法转让。可转换票据直到转换后才转换为公司的百分比（此时计算百分比），考虑这一点的最佳方式是您以最早的投资条款进入，未来所有权百分比打折，即比下一级投资更好的条件。只有在转换后，这才会转化为已知百分比的股东。股权是后期投资，您拥有公司的一部分。可转换票据处于早期阶段，按投入的美元兑美元投资估值，加上每年 3% 的收益，再加上成为股东的 8% 奖金（例如拥有股票）。如上所述;我们将把投资资金用于额外零件采购，为大量生产库存做准备，继续为我们所有尊重革命性软件开发的自由提供资金，并为 Librem 5 手机的 PureOS 中更融合的应用程序提供新资金。\n我想投资，但还有几个问题，我能回答吗？是的，要询问有关产品条款和条件的问题或任何其他必要信息，请发送电子邮件至 ir@puri.sm", "note_en": "The investment offering in Purism, SPC is a simple and effective convertible note, whereby your funds are debt owed to you from Purism that converts into equity at certain events—at maturity, upon equity financing, board approval, etc.—at which point your credit becomes equity in Purism, SPC.\n We will use the investment funds for additional parts procurement in preparation for large production run of stock, continuing funding of all our freedom respecting revolutionary software development, and new funding for more convergent applications in PureOS for the Librem 5 phone.\n This note will earn 3% interest annually and have an additional 8% applied upon conversion into equity without any further action required. Your investment amount and confirmation will be visible in  My Account on the  Purism shop.\n The investor is stating to be an accredited investor according to Rule 501 under the  Securities Act of 1933.\n Upon investment and funds being received you are agreeing to the terms of the  Convertible Promissory Note Series 2021 dated 2021-07-15.\n    To ask questions regarding the terms and conditions of the offering or any additional information necessary email  ir@puri.sm\n Yes, as stated above; the terms you agree to are the  Convertible Promissory Note Series 2021 dated 2021-07-15.\n  A Convertible Note is a type of investment where the investor is owed the investment amount as debt, it earns interest and converts to equity with a bonus at any of the listed conversion events. It is called “convertible note” because it is a promissory  note that  converts to equity.\n    This is a good faith requirement, since there is no way for Purism to validate your accredited investor status, by investing you are stating you are an  accredited investor that is defined as meeting any one of the following: earned income that exceeded $200,000 (or $300,000 together with a spouse or spousal equivalent) in each of the prior two years, and reasonably expects the same for the current year; OR has a net worth over $1 million, either alone or together with a spouse or spousal equivalent (excluding the value of the person’s primary residence); OR holds in good standing a Series 7, 65 or 82 license; OR any trust, with total assets in excess of $5 million, not formed specifically to purchase the subject securities, whose purchase is directed by a sophisticated person; OR certain entity with total investments in excess of $5 million, not formed to specifically purchase the subject securities; OR any entity in which all of the equity owners are accredited investors.\n    This is considered early stage investment, typically in growing technology companies, whereby you desire to invest early and see all the upside of holding that investment past the conversion event—where you become a shareholder—and into future equity events, such as dividend payments, IPO, or acquisition. This process is typically measured in years, and should not be considered a short-term investment.\n    No, one of the easy things about convertible notes is that they are debt instruments that automatically convert into equity at predetermined events. You will be notified—via email—upon any automatic event occurring.\n    Yes, Purism posts to its website regular blog posts about company progress, that is the definitive source for updates. In addition, there is a semi-regular text email newsletter for investors sent to a list that you will be automatically subscribed to (and can unsubscribe if desired).\n    Purism has grown mostly from revenue, however, Purism announced  closing $2.5m in notes in December 2019. This is represented in the Total Investment.\n            We will use the investment funds for additional parts procurement in preparation for large production run of stock, continuing funding of all our freedom respecting revolutionary software development, and new funding for more convergent applications in PureOS for the Librem 5 phone.\n   Can I share this investment opportunity with my friends or post about it on social media?\n Yes, while this is not a public offering, it is an offering to friends, supporters, and their friends and supporters. We will not be offering this to any other groups besides our supporters and customers directly, we also will not be linking to this campaign from our site nor forums, but you are more than welcome to share that in your personal capacity or on your personal social media outlets. We desire to extend the offer—and its potential return—to those that are supportive of our Social Purpose movement and whom know the value that Purism brings.\n    The note is worth the amount you invested, it is debt owed to you. It also earns 3% annually, and upon conversion will earn an additional 8%, at which point you will be a shareholder of Purism, SPC.\n    Not easily. The best way to look at convertible notes is to consider them long term investment in the future growth of a social purpose company you desire to see grow and reap the future benefits from its success. It is possible to transfer (e.g. sell) the note to other parties but that would be done separately and independently by you, notifying Purism of the legal transfer of ownership.\n    Convertible notes do not translate to percentage of the company until after conversion (at which time the percentage is calculated), the best way to think about this is that you are getting in at the earliest investment terms, with discounted future ownership percentage, that are better terms than the next level of investment. Only upon conversion does this translate to a shareholder with a percentage that is known.\n    Stock ownership is later stage investment whereby you own a part of the company. Convertible notes are earlier stage and are valued at the dollar-for-dollar investment put in, plus 3% annual, plus 8% bonus into becoming a shareholder (e.g. owning stock).\n    As stated above; We will use the investment funds for additional parts procurement in preparation for large production run of stock, continuing funding of all our freedom respecting revolutionary software development, and new funding for more convergent applications in PureOS for the Librem 5 phone.\n       I’d like to invest, but have a few more questions, can I get those answered?\n Yes, to ask questions regarding the terms and conditions of the offering or any additional information necessary email  ir@puri.sm", "posttime": "2021-07-25 15:23:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "seeking,投资", "title": "Purism 正在寻求个人投资", "title_en": "Purism is seeking investment from individuals", "transed": 1, "url": "https://puri.sm/ir/convertible-note/", "via": "", "real_tags": ["seeking", "投资"]}, {"category": "", "categoryclass": "", "imagename": "793a023d499bf4560b198a8bfc0bc6e0.png", "infoid": 1069615, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎所有拉取请求！如果您想添加语言，请执行以下操作： 在新文件夹中创建一个名为“jello.ext”的文件，其中“ext”是该语言的文件扩展名。编辑 README.md 文件以将语言包含在“当前列表”中。它应该大写并包含一个降价“任务列表” 使用 - [ ] &lt;Language&gt; 编辑 README.md 文件的“请求”，其中 &lt;Language&gt; 是语言的名称。应该大写。", "note_en": "All pull requests are welcome! Please do the following if you&#39;d like to add a language:\n Create a file name &#34;jello.ext&#34; in the new folder, where &#34;ext&#34; is the language&#39;s file extension.\n  Edit the README.md file to include the language in the &#34;Current List&#34;. It should be capitalized and include a markdown &#34;task list&#34;\n    Edit the README.md file&#39;s &#34;Requests&#34; with  - [ ] &lt;Language&gt;, where &lt;Language&gt; is the language&#39;s name. It should be capitalized.", "posttime": "2021-07-25 15:23:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,打印,jello,语言", "title": "Jello：在每种编程语言中打印“jello”", "title_en": "Jello: Print “jello ” in every programming language", "transed": 1, "url": "https://github.com/IThinkImOKAY/jello", "via": "", "real_tags": ["编程", "打印", "jello", "语言"]}, {"category": "", "categoryclass": "", "imagename": "311549a5ac2d8a2367ee4b4fba22240c.jpg", "infoid": 1069614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿特区——6 月份，在盖洛普的实时评估指数中，对自己的生活评估得足以被视为“蓬勃发展”的美国人的百分比达到了 59.2%，这是 13 多年来持续衡量的最高水平，并超过了之前的高点 57.3%。 2017 年 9 月。在最初的 COVID-19 爆发和经济停摆期间，到 2020 年 4 月下旬，繁荣的百分比下降了近 10 个百分点，至 46.4%，追平了大萧条期间上次衡量的历史低点。线形图。从 2008 年到 2021 年 6 月，对自己的生活高度评价足以被视为繁荣的美国人的百分比。目前，创纪录的 59.2% 的美国人认为自己的生活高度足以被视为繁荣。最近的结果是在 2021 年 6 月 14 日至 20 日捕获的，基于网络调查的 4,820 名美国成年人作为盖洛普小组的一部分，盖洛普小组是一个基于概率的非选择加入小组，由所有 50 个州和哥伦比亚特区。对于其生活评估指数，盖洛普根据 Cantril 自我锚定指数，根据美国人对当前和未来生活的评价，将他们当前和未来的生活分为 0 到 10 级，分为“繁荣”、“挣扎”或“痛苦”。努力的规模。那些将目前的生活评分为 7 分或更高，并将五年后的预期寿命评分为 8 分或更高的人被归类为繁荣。在更广泛的背景下，根据盖洛普全球工作场所状况：2021 年报告，根据 2018-2020 年的数据收集，被认为正在蓬勃发展的美国工人的百分比估计为 58%，与 18 个西欧国家相比，排名第 14国家加加拿大。在整个大流行期间，估计“受苦”的美国人的百分比一直保持在较低水平，并且与 COVID 之前的估计一致。 6 月份，3.4% 的受访者被归类为受苦。 2020 年繁荣百分比的大幅下降的特点是当前生活满意度评分严重下降。到 4 月下旬，将当前生活评为“7”或更高的美国成年人的百分比下降了约 11 个百分点，尽管五年后的预期生活满意度有所提高。与早先的繁荣百分比下降一样，其随后的反弹主要是由当前生活满意度的变化驱动的。\n值得注意的是，尽管最近几个月当前的生活满意度有所提高，但与 COVID 之前的水平相比，预期的生活满意度仍然较高。当前生活满意度的快速恢复，加上预期生活满意度的持续升高，推动了当前生活满意度的增长。线形图。对当前生活的满意度评分为 7-10 的美国人的百分比以及对预期生活的满意度评分为 8-10 的美国人的百分比。目前，70.5% 的美国人预计他们将在五年内对自己的生活进行 8-10 的评分，而 69% 的人现在对他们的生活评分为 7-10。除了一般的生活评级外，盖洛普还跟踪美国人最近是否在日常生活中经历了特定的情绪，包括压力和担忧。在 2020 年 3 月上半月，报告“昨天很多时间”经历过重大压力和担忧的人的比例出现了前所未有的增长，压力上升了 14 个百分点至 60%，担忧上升了 20 个百分点至 58%。由于大萧条，这些峰值大约是 2008 年期间测得的峰值的四倍。在这两种情况下，经历这些情绪的报告随后都降至大流行前的水平。 1 月份每日压力下降至 45%，此后一直保持在 40 年代中期，而每日担忧自年初以来进一步下降，从 1 月份的 43% 降至 4 至 6 月份的 38%。线形图。报告他们经历压力的美国人的百分比和报告他们昨天经历了很多担忧的百分比。目前，44% 的美国人表示他们昨天一天中经历了很多压力，38% 的人表示他们昨天经历了很多担忧。显着的日常享受也显着改善，尽管程度低于担忧和压力的下降。在 2018-2019 年，大约 80% 的美国成年人在前一天表示很享受，在大流行开始时下降到 61%。到 6 月，享乐的成年人口已恢复到 73%。线形图。表示昨天感到非常快乐的美国人的百分比。目前，有 73% 的美国人报告说昨天一天中的大部分时间都非常享受。\n与此同时，另一种在大流行期间减少的日常体验是无聊。近一半的成年人在 2020 年 3 月下旬报告了这种情绪，在 4 月中旬达到了 47% 的峰值。随着经济在去年春天开始重新开放，并且随着 2021 年 COVID-19 疫苗的普及，社会疏远已显着缓解，这一数字在 6 月已下降至 26%。 2021 年迄今为止，关键健康指标的显着改善归因于多种因素，这可能是由于 COVID-19 疫苗的广泛可用性和推出所致。到 6 月底，大约 54% 的美国人（包括尚未批准疫苗的年幼儿童）至少接种过一剂疫苗，其中 93% 的 65 岁及以上人群和 60% 的 18-64 岁人群.与疫苗的推出相吻合的是经济重新开放，这种情况在全国范围内发生的情况不均衡，但现在在所有 50 个州和哥伦比亚特区都是如此。更广泛的经济复苏也不一致。 6 月份新增 850,000 个工作岗位的就业报告比前两个月有所改善，均低于大多数经济学家的预期。尽管工资迅速上涨，但由于劳动力短缺问题，美国经济仍比 2020 年 2 月减少了超过 700 万个工作岗位。然而，除了接种疫苗和改善经济状况之外，重新进行社会互动还有重要的心理好处。与家人和朋友亲自团聚并参加体育赛事等大型聚会是社会福祉的重要组成部分。过去的研究表明，那些每天花 6 到 7 小时社交时间的人在任何一天所经历的压力和担忧是完全没有社交时间的人的五分之一。随着最近几个月这些负面情绪的水平提高到大流行前的水平，这些影响可能会显现出来。近期福利方面的积极趋势能否持续还有待观察。 Delta 变种在美国的相关传播，现在占全国新确诊病例的一半以上，有可能减缓社会和经济进步。 Delta 变体和其他变异形式的冠状病毒，例如 Gamma 变体，让健康专家担心秋季高峰会再次导致疫苗接种率低的地区部分经济、社会和学校停课。根据 2020 年的经验，此类事件可能会导致全国范围内的福祉再次下滑，但鉴于美国许多地区的疫苗接种规模很大，可能不会达到 2020 年春季美国人遭受的程度。在盖洛普 (Gallup) 最近的《全球工作场所状况：2021 年报告》和即将于 7 月 20 日发布的《2021 年全球情绪报告》中了解有关全球情绪健康的更多信息。美国 COVID-19 的 Delta 变体\n要及时了解最新的盖洛普新闻见解和更新，请在 Twitter 上关注我们。 2021 年 6 月 14 日至 20 日、5 月 17 日至 23 日和 2021 年 4 月 19 日至 25 日进行的最新调查的结果（分别）基于 4,802、3,731 和 3,572 名 18 岁以上成年人的回答，他们生活在所有 50美国各州和哥伦比亚特区作为盖洛普小组的一部分。对于基于此全国成年人样本的结果，在 95% 置信水平下，抽样误差幅度约为 +2.0 个百分点。 2020 年 7 月 31 日至 9 月 3 日的结果基于通过邮件和网络进行的调查，作为盖洛普国家健康与幸福指数的一部分，随机抽样调查了居住在美国所有 50 个州的 2,321 名成年人和哥伦比亚特区。在 2018 年和 2019 年完成的所有调查中，约有 80% 是通过邮件完成的。从3月开始，3,905, 3,759, 4,098, 3,089, 2,954, 2,963, 2,691 10,779, 11,221, 16,584, 4,357, 9,155, 2,09, 3,09, 3,09, 3,09, 3,09, 10, 3,7,10的之前样本也是2018 年 1 月至 2019 年 8 月的结果基于通过邮件和网络进行的调查，作为盖洛普国家健康与幸福指数的一部分，2019 年随机抽样了 9,645 名成年人，他们住在美国所有 50 个州和特区Columbia 和 2018 年的另外 115,929 人。 2018 年和 2019 年完成的所有调查中约有 80% 是通过邮件完成的。之前几年的测量是基于 1 月 2 日至 12 月每天进行的电话采访。每年 30 个，每个月的样本大小大致相同。 2017年、2016年、2015年、2014年共计160498人； 177,192； 177,281；分别完成了 176,702 次访谈。 2014 年 1 月 2 日至 2015 年 9 月 1 日期间收集的全国成年人数据的每个每日样本，包括 50% 的手机受访者和 50% 的座机受访者。 2015 年 9 月 1 日至 12 月期间的每个每日样本。 2016 年 1 月 30 日，包括 60% 的手机受访者和 40% 的座机受访者。 2017 年的每日样本包括 70% 的手机受访者和 30% 的座机受访者。抽样方法包括按时区和地区划分的额外最低配额。对样本进行加权以校正两个抽样框架中固定电话和蜂窝用户的不等选择概率、无响应和双重覆盖。它们还被加权以匹配性别、年龄、种族、西班牙裔、教育、地区、人口密度和电话状态（仅限手机/仅限固定电话/主要是手机和手机）的国家人口统计数据。人口权重目标基于 2019 年 3 月美国 18 岁及以上人口的当前人口调查数据。人口密度目标基于 2010 年人口普查。所有报告的抽样误差幅度都包括计算的加权设计效果。\n数据收集方式（例如，邮件/网络与电话）可能会导致对随机大人口调查中某些指标的不同估计。盖洛普对这些影响进行了广泛的研究，并确定生活评估（繁荣百分比）在不同模式之间具有可比性，因此有效地保留了过去的趋势，而无需因模式变化而进行调整。盖洛普全国家庭调查组和盖洛普全国健康与福祉指数在相似时间段对样本的全国加权估计进行比较，结果显示出高度趋同的结果，统计上的差异不显着。", "note_en": "WASHINGTON, D.C. -- The percentage of Americans who evaluate their lives well enough to be considered &#34;thriving&#34; on Gallup&#39;s Live Evaluation Index reached 59.2% in June, the highest in over 13 years of ongoing measurement and exceeding the previous high of 57.3% from September 2017. During the initial COVID-19 outbreak and economic shutdown, the thriving percentage plunged nearly 10 percentage points to 46.4% by late April 2020, tying the record low last measured during the Great Recession.\n    Line graph. The percentage of Americans who evaluate their lives highly enough to be considered thriving from 2008 until June 2021. Currently, a record-high 59.2% of Americans rate their lives highly enough to be considered thriving.\n    The most recent results, captured June 14-20, 2021, are based on 4,820 U.S. adults surveyed by web as a part of the  Gallup Panel, a probability-based, non-opt-in panel of about 120,000 adults across all 50 states and the District of Columbia.\n  For its Life Evaluation Index, Gallup classifies Americans as &#34;thriving,&#34; &#34;struggling&#34; or &#34;suffering&#34; according to how they rate their current and future lives on a ladder scale with steps numbered from 0 to 10, based on the  Cantril Self-Anchoring Striving Scale. Those who rate their current life a 7 or higher and their anticipated life in five years an 8 or higher are classified as thriving.\n  In a broader context, according to the   Gallup State of the Global Workplace: 2021 report, the percentage of U.S. workers considered to be thriving was estimated at 58% based on 2018-2020 data collection, which ranks 14 th when compared with 18 Western European countries plus Canada.\n  The percentage of Americans estimated to be &#34;suffering&#34; has remained steadily low throughout the pandemic and in line with pre-COVID estimates. In June, 3.4% of respondents were classified as suffering.\n    The major drop in the thriving percentage in 2020 was characterized by a severe drop in current life satisfaction ratings. By late April, the percentage of U.S. adults who rated their current lives a &#34;7&#34; or higher had plunged about 11 percentage points, even as the anticipated life satisfaction five years forward had improved. As with the earlier decline in the thriving percentage, its subsequent rebound is driven primarily by changes in current life satisfaction.\n  Notably, even as current life satisfaction has increased in recent months,  anticipated life satisfaction remains elevated compared with pre-COVID levels. The rapid recovery of current life satisfaction, coupled with the sustained elevated level of anticipated life satisfaction, has fueled the thriving percentage to its current heights.\n    Line graph. The percentages of Americans who rate their satisfaction with their current lives from 7-10 and the percentages of Americans who rate their satisfaction with their anticipated lives 8-10. Currently, 70.5% of Americans anticipate they will rate their lives 8-10 in five years, while 69% rate their lives 7-10 right now.\n    In addition to the general life ratings, Gallup tracks whether Americans have recently experienced specific emotions, including stress and worry, in their daily lives.\n  The percentage of people who reported experiencing significant stress and worry &#34;a lot of the day yesterday&#34; showed unprecedented increases in the first half of March 2020, with stress rising 14 percentage points to 60% and worry rising 20 points to 58%. These spikes were about  four times greater than what was measured over the course of 2008 as a result of the Great Recession. Reports of experiencing these emotions have subsequently fallen to pre-pandemic levels in both cases. Daily stress eased to 45% in January and has remained in the mid-40s since, while daily worry has declined further since the start of the year, to just 38% in April through June, down from 43% in January.\n    Line graph. The percentages of Americans who reported they experienced stress and the percentages who reported they experienced worry a lot of the day yesterday. Currently, 44% of Americans report they experienced stress a lot of the day yesterday and 38% say they experienced worry a lot of yesterday.\n  Significant daily enjoyment has also markedly improved, although to a lesser degree than the declines seen in worry and stress. In 2018-2019, about 80% of U.S. adults reported significant enjoyment the day before, which plunged to 61% at the onset of the pandemic. By June, enjoyment was back up to 73% of the adult population.\n    Line graph. The percentage of Americans who report having felt joy a lot of yesterday. Currently, 73% of Americans report having experienced enjoyment a lot of the day yesterday.\n  Meanwhile, another daily experience that has declined over the course of the pandemic is boredom. Close to half of adults reported this emotion in late March 2020, peaking at 47% in mid-April. As the economy started to reopen last spring and social distancing has eased significantly with the uptake of the COVID-19 vaccine in 2021, that figure has declined to 26% in June.\n    The marked improvement of key wellbeing metrics thus far in 2021 is due to a variety of factors, likely led by the widespread availability and rollout of the COVID-19 vaccines. By the end of June, about 54% of all Americans (including younger children for whom no vaccines have yet been approved) have had at least one dose, including 93% of those aged 65 and older and 60% of those aged 18-64.\n  Dovetailing with the rollout of the vaccine is the economic reopening, which has occurred unevenly nationwide but is now the case in all 50 states and the District of Columbia. The broader economic recovery has also been inconsistent. June&#39;s job report of 850,000 new jobs was an improvement over the two prior months, both of which fell below most economists&#39; expectations. And while wages are rapidly rising, the U.S. economy still has over 7 million fewer jobs than in February 2020 amidst a problematic labor shortage.\n  Beyond the vaccination rollout and improving economic conditions, though, is the critical psychological benefit of renewed social interaction. Reuniting in person with family and friends and joining in large gatherings of people such as at sporting events is a crucial part of  social wellbeing. Past research has shown that those who spend six to seven hours a day in  social time experience about one-fifth the stress and worry on any given day as those with no social time at all. These effects are likely on display as the levels of these negative emotions have improved to pre-pandemic levels in recent months.\n  Whether or not the recent positive trends in wellbeing are sustained remains to be seen. The concerning propagation of the Delta variant in the U.S., which now makes up over one-half of new confirmed cases nationwide, has the potential to slow social and economic progress. The Delta variant and other mutated forms of the coronavirus, such as the Gamma variant , have led health experts to fear a fall surge that could again lead to partial economic, social and school shutdowns in areas with low vaccination rates. Based on learnings from 2020, such occurrences could lead to another downturn in wellbeing nationally, though likely not at the same level of magnitude suffered by Americans in the spring of 2020 given the sizable extent of the vaccinations in many parts of the country.\n  Find out more about emotional wellbeing around the world in Gallup&#39;s recent   State of the Global Workplace: 2021  report and the coming 2021 Global Emotions report on July 20.\n  Editor&#39;s Note: This story has been updated to reflect the most recent assessment of the spread of the Delta variant of COVID-19 in the U.S.\n  To stay up to date with the latest Gallup News insights and updates,   follow us on Twitter .\n  Results from the most recent survey conducted from June 14-20, May 17-23, and Apr. 19-25, 2021, are based on responses (respectively) from 4,802, 3,731 and 3,572 adults, ages 18+, living in all 50 U.S. states and the District of Columbia as a part of the Gallup Panel. For results based on this sample of national adults, the margin of sampling error is about +2.0 percentage points at the 95% confidence level.\n Results from Jul. 31 to Sept. 3, 2020, are based on a survey conducted by mail and web as a part of the Gallup National Health and Well-Being Index, with a random sample of 2,321 adults, living in all 50 U.S. states and the District of Columbia. About 80% of all surveys completed in 2018 and 2019 were done so by mail.\n Beginning in March, previous samples of 3,905, 3,759, 4,098, 3,089, 2,954, 2,963, 2,691 10,779, 11,221, 16,584, 4,357, 9,155, 9,082, 20,006, 9,317, and 33,451 dating to October 2019 are also from the Panel.\n Results from January 2018 through August 2019 are based on surveys conducted by mail and web as a part of the Gallup National Health and Well-Being Index, with a random sample of 9,645 adults in 2019, living in all 50 U.S. states and the District of Columbia and another 115,929 in 2018. About 80% of all surveys completed in 2018 and 2019 were done so by mail.\n Prior years of measurement were based on telephone interviews conducted daily from Jan. 2-Dec. 30 of each year with roughly equally sized samples each month. In 2017, 2016, 2015, and 2014, a total of 160,498; 177,192; 177,281; and 176,702 interviews were completed, respectively. Each daily sample of national adults for data collected between Jan. 2, 2014, and Sept. 1, 2015, comprised 50% cellphone respondents and 50% landline respondents. Each daily sample from Sept. 1, 2015-Dec. 30, 2016, comprised 60% cellphone respondents and 40% landline respondents. Daily samples in 2017 comprised 70% cellphone respondents and 30% landline respondents. Additional minimum quotas by time zone and within region are included in the sampling approach.\n Samples are weighted to correct for unequal selection probability, non-response, and double coverage of landline and cell users in the two sampling frames. They are also weighted to match the national demographics of gender, age, race, Hispanic ethnicity, education, region, population density, and phone status (cell phone-only/landline only/both and cell phone mostly). Demographic weighting targets are based on the March 2019 Current Population Survey figures for the aged 18 and older U.S. population. Population density targets are based on the 2010 census. All reported margins of sampling error include the computed design effects for weighting.\n The means of data collection (e.g., mail/web versus phone) can result in differing estimates for some metrics in randomized large population polling. Gallup has extensively studied these effects and has determined that Life Evaluation (% thriving) is comparable across modes, thus effectively preserving past trending without need for an adjustment due to the change in mode.\n Comparisons of national weighted estimates from samples that fielded at similar time periods between Gallup’s National Panel of Households and the Gallup National Health and Well-Being Index demonstrated highly convergent results with statistically insignificant differences.", "posttime": "2021-07-25 15:23:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,历史,life,生活", "title": "美国人的生活评分创历史新高", "title_en": "Americans' Life Ratings Reach Record High", "transed": 1, "url": "https://news.gallup.com/poll/351932/americans-life-ratings-reach-record-high.aspx", "via": "", "real_tags": ["美国", "历史", "life", "生活"]}, {"category": "", "categoryclass": "", "imagename": "3e3bc8beb628ca9c993aa17784927a06.jpg", "infoid": 1069613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在芬兰，无家可归的人数急剧下降。原因：该国采用“住房第一”的概念。那些受无家可归影响的人可以在没有任何先决条件的情况下获得一间小公寓和咨询服务。因此，每 5 个受影响的人中就有 4 个重新过上稳定的生活。并且：所有这些都比接受无家可归便宜。 2008 年，您可以在赫尔辛基公园的树木之间看到帐篷村和小屋。无家可归的人在芬兰首都市中心建造了临时房屋。他们暴露在恶劣的天气条件下。自 1980 年代以来，芬兰政府一直在努力减少无家可归者。建造了短期庇护所。然而，长期无家可归的人仍然被排除在外。紧急避难所太少，许多受影响的人无法摆脱无家可归的境地：他们找不到工作——没有住所地址。没有任何工作，他们找不到公寓。这是一个恶性循环。此外，他们在申请社会福利方面也遇到问题。总而言之，无家可归的人发现自己被困住了。但在 2008 年，芬兰政府推出了一项针对无家可归者的新政策：它开始实施“住房第一”的概念。从那以后，受影响的人数急剧下降。芬兰为自己设定了一个目标：任何人都不应该流落街头——每个公民都应该有一个住所。这个国家是成功的：它是唯一一个无家可归者人数正在下降的欧盟国家。正是“Y-Foundation”等非政府组织为有需要的人提供住房。他们自己负责建筑，在私人住房市场上购买公寓并翻新现有公寓。公寓拥有一到两个房间。除此之外，以前的紧急避难所已被改造成公寓，以提供长期住房。\n“每个人都清楚旧系统不起作用；我们需要彻底的改变，”Y 基金会主任 Juha Kaakinen 说。无家可归的人通过租赁协议变成租户。他们还必须支付租金和运营成本。在住宅楼设有办公室的社会工作者帮助解决财务问题，例如申请社会福利。 Juha Kaakinen 是 Y 基金会的负责人。非政府组织从国家获得贴息贷款购买住房。此外，照顾无家可归者和未来租户的社会工作者由国家支付。另一方面，芬兰彩票支持非政府组织在私人住房市场上购买公寓。 Y-Foundation 还定期从银行获得贷款。该非政府组织后来使用租金收入偿还贷款。 “我们不得不摆脱当时仍然存在的夜间避难所和短期旅馆。他们在芬兰有着悠久的历史，每个人都可以看到他们并没有让人们摆脱无家可归的境地。我们决定扭转这些假设。” (Juha Kaakinen, Y-Foundation 主任) 芬兰采用的政策称为“住房优先”。它颠覆了传统的无家可归者援助。更常见的是，受影响的人应该寻找工作并摆脱心理问题或成瘾。只有这样，他们才能在寻找住宿方面得到帮助。另一方面，“住房优先”则颠倒了道路：无家可归的人获得了公寓——没有任何先决条件。社会工作者帮助他们申请社会福利，并且可以接受一般咨询。在这种新的、安全的情况下，受影响的人更容易找到工作并照顾好自己的身心健康。结果令人印象深刻：五分之四的无家可归者将能够通过“住房第一”长期拥有自己的公寓并过上更稳定的生活。\n在过去 10 年中，“住房优先”计划在芬兰提供了 4,600 套住房。虽然 2017 年仍有大约 1,900 人流落街头，但该计划可能会在 2019 年之前将这一数字减少到不到 1000 名长期无家可归者——但紧急避难所里有足够的地方供他们使用，因此他们至少没有睡在外面了。为人们建造住房需要花钱。在过去 10 年中，作为“住房优先”计划的一部分，2.7 亿欧元用于住房的建造、购买和翻新。然而，Juha Kaakinen 指出，这远远低于无家可归本身的成本。因为当人们处于紧急情况时，紧急情况会更加频繁：袭击、受伤、故障。警察、医疗保健和司法系统经常被要求介入——这也需要花钱。相比之下，“住房优先”比接受无家可归者要便宜：现在，国家每年每名无家可归者的支出比以前少 15,000 欧元。每 5 个人中就有 4 人保留他们的公寓，从长远来看，“住房优先”是有效的。在 20% 的案例中，人们搬出去是因为他们更喜欢和朋友或亲戚住在一起——或者因为他们付不起房租。但即使在这种情况下，它们也不会被丢弃。如果他们愿意，他们可以再次申请公寓，并再次获得支持。当然，没有成功的保证。尤其是无家可归的妇女更难接触到：她们更频繁地隐瞒自己的紧急情况：她们较少流落街头，而是与朋友或熟人待在一起。", "note_en": "In Finland, the number of homeless people has fallen sharply. The reason: The country applies the “Housing First” concept. Those affected by homelessness receive a small apartment and counselling – without any preconditions. 4 out of 5 people affected thus make their way back into a stable life. And: All this is cheaper than accepting homelessness.\n      In 2008 you could see tent villages and huts standing between trees in the parks of Helsinki. Homeless people had built makeshift homes in the middle of Finland’s capital city. They were exposed to harsh weather conditions.\n Since the 1980s, Finnish governments had been trying to reduce homelessness. Short-term shelters were built. However, long-term homeless people were still left out. There were too few emergency shelters and many affected people did not manage to get out of homelessness: They couldn’t find jobs – without a housing address. And without any job, they couldn’t find a flat. It was a vicious circle. Furthermore, they had problems applying for social benefits. All in all, homeless people found themselves trapped.\n But in 2008 the Finnish government introduced a new policy for the homeless: It started implementing the “Housing First” concept. Since then the number of people affected has fallen sharply.\n Finland has set itself a target: Nobody should have to live on the streets – every citizen should have a residence.\n And the country is successful: It is the only EU-country where the number of homeless people is declining.\n  It is NGOs such as the “Y-Foundation” that provide housing for people in need. They take care of the construction themselves, buy flats on the private housing market and renovate existing flats. The apartments have one to two rooms. In addition to that, former emergency shelters have been converted into apartments in order to offer long-term housing.\n “It was clear to everyone that the old system wasn’t working; we needed radical change,” says Juha Kaakinen, Director of the Y-Foundation.\n Homeless people turn into tenants with a tenancy agreement. They also have to pay rent and operating costs. Social workers, who have offices in the residential buildings, help with financial issues such as applications for social benefits.\n  Juha Kaakinen is head of the Y-Foundation. The NGO receives discounted loans from the state to buy housing. Additionally, social workers caring for the homeless and future tenants are paid by the state. The Finnish lottery, on the other hand, supports the NGO when it buys apartments on the private housing market. The Y-Foundation also receives regular loans from banks. The NGO later uses the rental income to repay the loans.\n “We had to get rid of the night shelters and short-term hostels we still had back then. They had a very long history in Finland, and everyone could see they were not getting people out of homelessness. We decided to reverse the assumptions.” (Juha Kaakinen, Director of the Y-Foundation)\n  The policy applied in Finland is called “HousingFirst”. It reverses conventional homeless aid. More commonly, those affected are expected to look for a job and free themselves from their psychological problems or addictions. Only then they get help in finding accommodation.\n “Housing First”, on the other hand, reverses the path: Homeless people get a flat – without any preconditions. Social workers help them with applications for social benefits and are available for counselling in general. In such a new, secure situation, it is easier for those affected to find a job and take care of their physical and mental health.\n The result is impressive: 4 out of 5 homeless people will be able to keep their flat for a long time with “Housing First” and lead a more stable life.\n In the last 10 years, the “Housing First” program provided 4,600 homes in Finland. While in 2017 there were still about 1,900 people living on the streets, the program could reduce this number to  less than 1000 long-term homeless by 2019 – but there were enough places for them in emergency shelters so that they at least didn’t have to sleep outside anymore.\n  Creating housing for people costs money. In the past 10 years, 270 million euros were spent on the construction, purchase and renovation of housing as part of the “Housing First” programme. However, Juha Kaakinen points out, this is far less than the cost of homelessness itself. Because when people are in emergency situations, emergencies are more frequent: Assaults, injuries, breakdowns. The police, health care and justice systems are more often called upon to step in – and this also costs money. In comparison, “Housing First” is cheaper than accepting homelessness: Now, the state spends 15,000 euros less per year per homeless person than before.\n  With 4 out of 5 people keeping their flats, “Housing First” is effective in the long run. In 20 percent of the cases, people move out because they prefer to stay with friends or relatives – or because they don’t manage to pay the rent. But even in this case they are not dropped. They can apply again for an apartment and are supported again if they wish.\n Of course, there is no guarantee for success. Especially homeless women are more difficult to reach: They conceal their emergency situation more often: They live on the streets less frequently and rather stay with friends or acquaintances.", "posttime": "2021-07-25 15:22:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "结束,ends,住房", "title": "芬兰结束无家可归并为所有有需要的人提供住所", "title_en": "Finland ends homelessness and provides shelter for all in need", "transed": 1, "url": "https://scoop.me/housing-first-finland-homelessness/", "via": "", "real_tags": ["结束", "ends", "住房"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ncdu (NCurses Disk Usage) 是一个基于终端的磁盘使用分析器，用于 Linux 和其他 POSIX-y 系统，（以前）用 C 编写，在大多数发行版的包存储库中可用。在过去的几个月里，我一直致力于完全重写 ncdu，并且刚刚发布了 2.0-beta1。 Ncdu 2 是 ncdu 1.x 的完全替代品，保留了所有相同的功能、相同的 UI、键绑定和命令行标志，所有这些都使其成为合适的替代品。毕竟，没有什么比每次决定更新时都必须重新熟悉已安装的每个软件更烦人的了。当然，如果新版本至少没有改进某些东西，那么重写 ncdu 就没有任何意义。这次改写，其实是我苦恼了很久的ncdu 1.x的几个主要缺点的结果： 一直有点内存占用。这部分是它所做的工作所固有的：分析完整的目录树并使其可顺利浏览需要跟踪该树中的每个节点，并且大型目录包含数百万个文件......是的，这需要一些内存。当然，我已经实现了所有容易实现的成果，以确保 ncdu 的内存不会过于低效，但肯定还有改进的空间。 Ncdu 1.x 不能非常有效地处理硬链接计数，并且在某些（幸运的是很少见）情况下会陷入 O(n²) 循环。在不增加内存使用的情况下修复这个问题特别麻烦。另一个与硬链接相关的问题：硬链接在目录的累积大小中只计算一次，这与大多数其他支持硬链接的磁盘使用分析器所做的一致。这很有用，因为通过硬链接“复制”的文件只在磁盘上真正出现一次，文件的数据实际上并没有被复制。但与此同时，此功能可能会产生误导：删除目录不一定会回收 ncdu 指示的磁盘空间，因为该目录外的硬链接可能指向相同的文件数据，因此数据保留在磁盘上。关于如何更好地呈现此类场景，我有一个好主意，但我始终无法实现有效的实现。上述问题在 ncdu 1.x 的数据模型中都不容易解决，甚至不可能解决，因此需要对核心数据模型进行重大更改。由于 ncdu 的每个方面——UI 和所有算法——都与数据模型密切相关，这实际上归结为完全重写。正是在穿越当地森林的徒步旅行中，我终于找到了一个解决所有三个问题的有希望的解决方案。\n抱歉。我很想尝试我的“有希望的解决方案”，而 C 并不是那种使快速原型设计变得非常容易或令人愉快的语言。所以我最终使用 Zig 进行原型设计，它最终不仅仅是一个原型。 Zig 是一种优秀的编程语言，非常适合像 ncdu 这样的小工具，但它目前有一个主要缺陷：它甚至还没有接近稳定。该语言、标准库和编译器都没有稳定版本，而且每个新版本都存在左右重大缺陷。它也有相当多的（已知的）错误和它的可移植性故事，虽然该语言所处的阶段令人印象深刻，但还没有与 C 相提并论。该语言看起来非常有前途，我毫不怀疑 Zig 最终会达到稳定性和可移植性水平使其成为 ncdu 的良好目标。但是，从局外人的角度来看，这可能还需要几年时间。没关系，毕竟每种语言都需要时间来成熟。但这对 ncdu 意味着什么？对于普通用户来说，可能没有那么多。我像往常一样为 Linux 提供静态二进制文件，因此您可以像往常一样获取这些文件并运行花哨的新 ncdu。如果你想从源代码编译，你只需要获取正确的 Zig 版本并运行 zig build。假设您没有遇到错误，也就是说，在大多数情况下，事情往往开箱即用。对于发行版来说，Zig 的情况更成问题，主要是因为 ncdu 的版本现在与 Zig 的版本紧密相关，这反过来意味着发行版无法相互独立地升级这些包。如果他们打包 Zig 8.0，那么他们可能还需要打包一个可以使用 Zig 8.0 编译的 ncdu 版本。如果他们想升级到更新版本的 Zig，他们可能无法在不等待我发布适用于该特定 Zig 的新版本或维护他们自己的 ncdu 本地补丁的情况下这样做。另一种选择是发行版必须同时支持多个版本的 Zig，但很少有人有时间和基础设施来做到这一点。任何一种解决方案都是混乱的，为此我深表歉意。综上所述，只要有人用，我就会继续维护ncdu的C版。维护几乎意味着我过去几年一直在做的事情：在开发方面不是特别活跃，只是偶尔的改进和修复。我还可能将未来 2.x 版本中的一些新增内容向后移植回 C 版本，特别是关于可见界面（CLI 标志、键绑定、UI 等），以抑制在碰巧有的系统之间切换时出现的不可避免的痛苦安装了不同的版本，但在 1.x 代码库中实现起来似乎很麻烦的功能可能仍然是 Zig 版本独有的。只要 Zig 还没有稳定版本，我将尝试使 ncdu 2.x 与大多数发行版都有软件包的 Zig 版本保持最新，这实际上通常意味着最新的标记版本。从好的方面来说，ncdu 2.0 只需要 Zig 编译器（加上它附带的标准库）和 ncurses。没有其他外部依赖项，也没有那些困扰用其他花哨的新语言编写的项目的销售、捆绑和疯狂的包管理东西。 1 Ncdu 2 在普通场景中使用不到一半的内存，但如果有很多硬链接，在某些情况下可能会使用更多的内存。与几个真实世界的目录进行快速比较：\n我必须在这里声明一个免责声明，我的桌面根文件系统和我的备份都发挥了 ncdu 2.0 的优势：每个目录的文件数量相对较多，平均约 10 个字节，文件名相当短。尽管如此，如果您的目录树遵循不同的发行版，您仍然应该看到显着的改进。这里最大的例外是当你有很多硬链接时。我上面测试的“许多硬链接”目录代表了大约 43k 文件的基于硬链接的增量备份，“复制”了 30 次。当您查看表示树中的每个节点需要多少字节时，内存使用方面的这些差异的原因就很清楚了：（这些数字假定为 64 位指针，不包括文件名的存储以及内存分配和哈希表的开销。扩展模式 (-e) 在两个版本中每个节点使用额外的 18 个字节，并且两个版本对文件名使用相同的内存分配策略。）虽然在硬链接情况下有改进的空间，但 ncdu 1 中的性能问题如果不增加内存，我之前提到的 .x 就无法真正修复。我一直对接受完全禁用硬链接检测的选项持谨慎态度，因为结果可能不是很有用，但也许我会在未来的版本中重新考虑这一点。由于内存不足而根本无法分析的目录也不是很有用。另一个值得一提的区别是：当从浏览器中刷新目录时，ncdu 1.x 将为新树分配一个新结构，然后在扫描完成后释放旧结构。如果刷新最顶层目录，这可能会导致 ncdu 1.x 临时使用两倍的内存。 Ncdu 2.0 而是对现有的内存树进行就地更新，从而避免了这种重复。另一方面，ncdu 2.0（当前）无法重用已重命名或删除的树节点，因此频繁刷新具有许多重命名或删除的目录会随着时间的推移增加内存使用。我不认为这是一个很常见的情况，但如果它成为一个问题，它可以被修复。正如我在介绍中提到的，计算硬链接可能会非常混乱，因为它们会导致数据在目录之间共享。因此，与其尝试将目录的累积大小显示为单个数字，不如用单独的列来更好地表示这些情况。这是 ncdu 2.0 中的样子：据我所知，没有其他磁盘使用分析器具有此功能（但如果我错了，请纠正我！）\n目前，您可以通过按“u”在两个视图之间切换。但是，如果我继续为每个新功能分配密钥，我可能很快就会用完可用的密钥，所以也许我会在稳定的 2.0 版本之前收回该密钥，并改为实施快速配置菜单。此功能确实带有一个很大的免责声明：如果特定文件的链接计数在扫描期间发生更改，或者目录刷新或删除导致缓存链接计数发生更改，则显示的共享/唯一大小将不正确。发生这种情况时获得正确大小的唯一方法是退出 ncdu 并开始新的扫描，从浏览器刷新不会修复它。当发生这种情况时，目前没有任何指示或警告，需要在我进行稳定版本之前修复。作为重写的一部分，ncdu 2 中还有许多其他变化。有些变化是好的，有些则可能不太好。改进了对 Unicode 文件名的处理。它仍然不处理 Unicode 组合标记，但至少它现在可以识别全角字符，并且不会在 UTF-8 序列的中间截断文件名。由于缓存 statfs() 调用的结果，提高了使用 --exclude-kernfs 时的性能。我尝试对其进行测量，但最多只注意到了大约 2% 的改进，但确实如此。在硬链接信息窗口的“链接”选项卡中，现在可以直接跳转到所选路径。文件浏览器现在可以更好地记住切换目录时所选项目在屏幕上的位置。\nNcdu 2.0 不再适用于非 UTF-8 语言环境，但我认为现在这不会成为问题。它仍然可以很好地处理非 UTF-8 文件名，但是这些将在输出之前被转义，而不是像 ncdu 1.x 那样直接抛出到您的终端。项目信息窗口组织略有不同。只是一点点，我保证。 Ncdu 2 现在使用 openat() 系列系统调用来扫描目录。这通常是对 ncdu 1.x 的 chdir() 和 opendir() 方法的改进，但确实需要更多的文件描述符（大问题）并且对古代系统的可移植性较差（Zig 甚至可以在这些系统上工作？）。在硬链接的信息窗口中打开“链接”选项卡现在需要扫描内存树，因此速度明显变慢。然而，令我惊讶的是，在我的系统上完全扫描具有 30 多万个文件的树只需要不到一秒钟的时间，因此实际上这可能不会成为问题（无论如何谁使用了“链接”选项卡？）。刷新或删除目录时，浏览器 UI 不再可见。问题是浏览器会缓存有关打开目录的信息，并且在运行刷新/删除时该缓存可能会失效。这也是 ncdu 1.x 中的一个问题，但不那么明显。有人要求在 ncdu 仍在扫描时允许交互式浏览，所以如果我有时间实现它，这不会成为问题，但这对我来说并不是什么优先事项。在每次 UI 绘制时更新浏览器的缓存成本太高，所以我还不确定如何处理。给自己拿一个 ncdu-2.0-beta1 并进行测试！源代码可在存储库的“zig”分支中找到。我的首要任务是让 2.0 为“稳定”版本做好准备，这意味着它需要在野外进行一些严肃的测试，以评估它的工作情况并充实不可避免的错误。我仍然有点不清楚，当它所建立的基础本质上不稳定时，发布稳定版本是否有意义，但让我们看看事情的进展。\n从更长远的角度来看，对 Zig 的重写为更多我一直想看到的功能开辟了可能性，但这在 1.x 中实现起来似乎很棘手。多线程扫描。这对于老式的旋转硬盘驱动器是无用的，但是对于 SSD，尤其是 NVMe，通过跨多个线程分配工作可以大大提高扫描性能。在重写代码时，我想出了一个关于如何实现这一点的有前途的想法，所以我很乐意在未来的版本中进行试验（io_uring 也是一个有趣的目标，但可能更复杂）。更快的 --exclude-pattern 匹配。老实说，这个功能目前在两个版本中都太慢了，我很惊讶没有人抱怨过它（无论如何对我来说不是）。只需要几个模式就可以将 ncdu 的扫描性能降低到爬行，更聪明的匹配实现可以提供重大改进。将内存树导出到文件。 Ncdu 已经有导出/导入选项，但导出需要一个单独的命令调用 - 当前无法在目录浏览器中编写导出。新的数据模型可以支持此功能，但我仍然不确定如何在 UI 中使用它。透明导出压缩。导出函数转储未压缩的 JSON 数据，旨在通过 gzip 或类似命令进行管道传输。虽然这在手册页中有记录，但我仍然看到很多人将导出写入磁盘而没有任何压缩。这是一个相当大的空间浪费，所以如果 ncdu 可以通过外部（解）压缩工具透明地运行导出的数据以使其更容易和更容易发现，那就太好了。这些功能是我过去十年来一直致力于进行的一长串其他可能改进的补充，所以不要期望太多。 :) 这并不是说 Zig 不受使用数百个微小依赖项的项目问题的影响，但是在当前状态下，这种开发风格并没有受到强烈鼓励：标准库已经涵盖了很多领域，包管理解决方案仍然存在正在开发中，使用现有的 C 库很容易。 ↩\n我绝对希望像这样的目录级报告可用于其他形式的数据共享，例如 reflinks 或 btrfs/ZFS 快照。但是，唉，我怀疑我是否能够在 ncdu 中实现它。即使我能以某种方式抓取和解开底层数据，跟踪大型文件系统中的每个块无疑在 CPU 和内存方面都会非常昂贵。前段时间我确实写了一个小工具来为启用配额的 btrfs 子卷生成此类报告，但后来我最终禁用了配额功能，因为即使这样也非常昂贵。还有 btdu，它采用一种非常有趣的方法来分析 btrfs 文件系统。 ↩", "note_en": "Ncdu (NCurses Disk Usage) is a terminal-based disk usage analyzer for Linux and other POSIX-y systems, (formerly) written in C and available in the package repositories of most distributions.\n Over the past months I have been working on a complete rewrite of ncdu and just released 2.0-beta1. Ncdu 2 is a full replacement of ncdu 1.x, keeping all the same features, the same UI, keybindings and command-line flags, all to make it a proper drop-in replacement. There is, after all, nothing more annoying than having to get re-acquainted with every piece of software you&#39;ve installed every time you decide to update.\n  Of course, there wouldn&#39;t really be a point in rewriting ncdu if the new version doesn&#39;t improve at least  something. This rewrite is, in fact, the result of me agonizing for a long time about several major shortcoming of ncdu 1.x:\n It has always been a bit of a memory hog. Part of this is inherent to what it does: analyzing a full directory tree and making it smoothly browsable requires keeping track of every node in that tree, and with large directories containing millions of files... yeah, that&#39;ll require some memory. I had, of course, already implemented all the low-hanging fruit to ensure that ncdu wasn&#39;t  overly inefficient with memory, but there was certainly room for improvements.\n Ncdu 1.x does not handle hard link counting very efficiently and can in some (fortunately rare) cases  get stuck in an  O(n²) loop. This one is particularly nasty to fix without increasing memory use.\n Another hard link-related problem: hard links are counted only once in a directory&#39;s cumulative size, as is consistent with what most other hard link-supporting disk usage analyzers do. This is useful, since a file that has been &#34;duplicated&#34; by means of hard links only really occurs on disk once, the file&#39;s data is not actually duplicated. But at the same time this feature can be misleading: deleting a directory does not necessarily reclaim as much disk space as was indicated by ncdu, since it&#39;s possible for hard links  outside of that directory to point to the same file data, and hence for that data to remain on disk. I&#39;ve had a good idea on how to better present such scenarios, but an efficient implementation always eluded me.\n None of the above issues are easy, or even possible, to solve within the data model of ncdu 1.x, so major changes to the core data model were necessary. Since each and every aspect of ncdu - both the UI and all algorithms - are strongly tied to the data model, this effectively comes down to a full rewrite. It was during a hike through the local forests that I finally came to a promising solution that addresses all three points.\n  I&#39;m sorry. I was anxious to try out that &#34;promising solution&#34; of mine and C isn&#39;t the kind of language that makes quick prototyping very easy or pleasurable. So I ended up prototyping with  Zig instead and it ended up being more than just a prototype.\n Zig is an excellent programming language and uniquely well suited for little tools like ncdu, but it currently has a  major flaw: It&#39;s not even close to stable. There&#39;s no stable version of the language, the standard library nor of the compiler, and each new release comes with major breakage left and right. It also has a fair amount of (known) bugs and its portability story, while impressive for the stage the language is in, is not yet on par with C. The language is looking very promising and I have no doubt that Zig will eventually reach the level of stability and portability to make it a good target for ncdu. But, judging from an outsider&#39;s perspective, that&#39;s likely to take a few more years. And that&#39;s okay, after all, every language needs time to mature.\n But what does that mean for ncdu? For regular users, probably not that much. I provide static binaries for Linux as I&#39;ve always done, so you can just grab those and run the fancy new ncdu as usual. If you want to compile from source, you only need to grab the right Zig version and run  zig build. Assuming you don&#39;t run into bugs, that is, but for the most part things tend to work just fine out of the box. For distributions, the Zig situation is rather more problematic, primarily because the version of ncdu is now strongly tied to the version of Zig, which in turn means that distributions are unable to upgrade these packages independently from each other. If they package Zig 8.0, then they may also have to package a version of ncdu that can be compiled with Zig 8.0. If they want to upgrade to a newer version of Zig, they may not be able to do so without waiting for me to release a new version that works with that particular Zig, or maintain their own local patches for ncdu. The alternative is that distributions will have to support multiple versions of Zig at the same time, but few have the time and infrastructure to do that. Either solution is messy, and for that I apologize.\n Considering the above, I will continue to maintain the C version of ncdu for as long as there are people who use it.  Maintenance meaning pretty much what I&#39;ve been doing for the past few years: not particularly active in terms of development, just occasional improvements and fixes here and there. I may also backport some additions from future 2.x versions back into the C version, especially with regards to visible interfaces (CLI flags, keybindings, UI, etc), to dampen the inevitable agony that arises when switching between systems that happen to have different versions installed, but features that seem like a pain to implement in the 1.x codebase will likely remain exclusive to the Zig version.\n As long as there is no stable version of Zig yet, I will  try to keep ncdu 2.x current with the Zig version that  most distributions have packages for, which in practice generally means the latest tagged release.\n On the upside, ncdu 2.0 only requires the Zig compiler (plus the standard library that comes with it) and ncurses. There&#39;s no other external dependencies and none of that vendoring, bundling and insane package management stuff that haunts projects written in other fancy new languages.  1\n  Ncdu 2 uses less than half the memory in common scenarios, but may in some cases use  more memory if there are a lot of hard links. Quick comparison against a few real-world directories:\n  I have to put a disclaimer here that both my desktop&#39;s root filesystem and my backups play into the strengths of ncdu 2.0: relatively many files per directory and, with ~10 bytes on average, fairly short file names. Nonetheless, you should still see significant improvements if your directory tree follows a different distribution. The big exception here is when you have a lot of hard links. The &#34;many hard links&#34; directory I tested above represents a hard link-based incremental backup of ~43k files, &#34;duplicated&#34; 30 times.\n The reason for these differences in memory use are clear when you look at how many bytes are needed to represent each node in the tree:\n  (These numbers assume 64-bit pointers and exclude storage for file names and overhead from memory allocation and hash tables. Extended mode (-e) uses an extra 18 bytes per node in both versions, and both versions use the same memory allocation strategy for the file names.)\n While there is room for improvements in the hard link situation, the performance issue in ncdu 1.x that I mentioned earlier isn&#39;t really fixable without a memory increase. I&#39;ve always been cautious with accepting an option to disable hard link detection altogether as the results may not be very useful, but maybe I&#39;ll reconsider that for a future release. A directory that can&#39;t be analyzed at all because you&#39;ve ran out of memory isn&#39;t very useful, either.\n Another difference that is worth mentioning: when refreshing a directory from within the browser, ncdu 1.x will allocate a fresh structure for the new tree and then, after the scan is complete, free the old structure. This may cause ncdu 1.x to temporarily use twice as much memory if you refresh the top-most directory. Ncdu 2.0 instead does an in-place update of the existing in-memory tree and thereby avoids this duplication. On the other hand, ncdu 2.0 is (currently) unable to re-use tree nodes that have been renamed or deleted, so frequently refreshing a directory that has many renames or deletions will increase memory use over time. I don&#39;t think this is a very common scenario, but should it become a problem, it  can be fixed.\n  As I mentioned in the introduction, counting hard links can be very confusing because they cause data to be shared between directories. So rather than try and display a directory&#39;s cumulative size a single number, these cases are better represented by a separate column. Here&#39;s what that looks like in ncdu 2.0:\n     To my knowledge, no other disk usage analyzer has this feature (but please do correct me if I&#39;m wrong!)\n You can, for the time being, switch between the two views by pressing &#39;u&#39;. But if I keep assigning keys to each new feature I may be running out of available keys rather soon, so maybe I&#39;ll reclaim that key before the stable 2.0 release and implement a quick-configuration menu instead.\n This feature does come with a large disclaimer: the displayed shared/unique sizes will be incorrect if the link count for a particular file changes during a scan, or if a directory refresh or deletion causes the cached link counts to change. The only way to get correct sizes when this happens is to quit ncdu and start a new scan, refreshing from the browser isn&#39;t going to fix it. There is currently no indicator or warning when this happens, that&#39;ll need to be fixed before I do a stable release.\n  There&#39;s a bunch of other changes in ncdu 2 that came naturally as part of the rewrite. Some changes are good, others perhaps less so.\n  Improved handling of Unicode filenames. It still doesn&#39;t handle Unicode combining marks, but at least it can now recognize full-width characters and it won&#39;t cut off filenames in the middle of a UTF-8 sequence.\n Improved performance when using  --exclude-kernfs thanks to caching the result of  statfs() calls. I tried to measure it and only noticed a ~2% improvement at best, but it&#39;s something.\n In the &#39;Links&#39; tab in the info window for hard links, it is now possible to jump directly to the selected path.\n The file browser now does a better job at remembering the position of the selected item on your screen when switching directories.\n  Ncdu 2.0 doesn&#39;t work well with non-UTF-8 locales anymore, but I don&#39;t expect this to be a problem nowadays. It can still deal with non-UTF-8 filenames just fine, but these will be escaped before output rather than directly thrown at your terminal as ncdu 1.x does.\n The item information window organization is a little bit different. Just a tiny little bit, I promise.\n Ncdu 2 now uses the  openat() family of system calls to scan directories. This is generally an improvement over the  chdir() and  opendir() approach of ncdu 1.x, but does require a few more file descriptors (big deal) and is less portable to ancient systems (would Zig even work on those?).\n  Opening the &#39;Links&#39; tab in the info window for hard links now requires a scan through the in-memory tree, so it&#39;s noticeably slower. To my surprise, though, a full scan through a tree with 30+ million files takes less than a second on my system, so in practice this probably isn&#39;t going to be a problem (and who uses that &#39;Links&#39; tab, anyway?).\n  The browser UI is not visible anymore when refreshing or deleting a directory. The problem is that the browser keeps cached information about the opened directory, and this cache may be invalidated while the refresh/deletion is running. This is also kind-of a problem in ncdu 1.x, but it&#39;s less pronounced. There have been requests for allowing interactive browsing while ncdu is still scanning, so this won&#39;t a problem if I ever get around to implementing that, but it&#39;s not much of a priority on my end. Updating the browser&#39;s cache on each UI draw is going to be too expensive, so I&#39;m not yet sure how to handle it.\n  Grab yourself an ncdu-2.0-beta1 and test! The source code is available in the  &#39;zig&#39; branch in the repository.\n My first priority is to get 2.0 ready for a &#34;stable&#34; release, which means it needs to get some serious testing in the wild to evaluate how well it works and to flesh out the inevitable bugs. It&#39;s still a bit unclear to me if it even makes sense to release a stable version when the foundation it&#39;s built on is inherently unstable, but let&#39;s just see how things go.\n On the slightly longer term, the rewrite to Zig opened up the possibility for a few more features that I&#39;ve been wanting to see for a while, but that seemed tricky to implement in 1.x.\n Multithreaded scanning. This will be useless for old fashioned rotating hard drives, but for SSDs and especially NVMe, scanning performance can be greatly improved by distributing the work across multiple threads. While rewriting the code I came up with a promising idea on how to implement this, so I&#39;d love to experiment with that in future versions (io_uring is also an interesting target, but potentially even more complex).\n Faster  --exclude-pattern matching. Honestly, this feature is currently so slow in both versions that I&#39;m surprised nobody has ever complained about it (not to me, in any case). It&#39;s possible to slow ncdu&#39;s scanning performance down to a crawl with just a few patterns, a more clever matching implementation could provide major improvements.\n Exporting an in-memory tree to a file. Ncdu already has export/import options, but exporting requires a separate command invocation - it&#39;s not currently possible to write an export while you&#39;re in the directory browser. The new data model  could support this feature, but I&#39;m still unsure how to make it available in the UI.\n Transparent export compression. The export function dumps uncompressed JSON data and is designed to be piped through  gzip or similar commands. While this is documented in the manual page, I still see many people writing the export to disk without any sort of compression. That&#39;s a pretty big waste of space, so it would be nice if ncdu could transparently run the exported data through external (de)compression tools to make this easier and more discoverable.\n These features are in addition to a long list of other possible improvements that I&#39;ve been meaning to work on for the past decade, so don&#39;t expect too much. :)\n That&#39;s not to say Zig is immune to the problem of projects using hundreds of tiny little dependencies, but that development style isn&#39;t strongly encouraged in its current state: the standard library already covers a lot of ground, package management solutions are still being worked on and it&#39;s easy enough to just use existing C libraries instead. ↩\n I would absolutely  love for directory-level reports like these to be available for other forms of data sharing, such as reflinks or btrfs/ZFS snapshots. But alas, I doubt I&#39;ll ever be able to implement that in ncdu. Even if I could somehow grab and untangle the underlying data, keeping track of every block in a large filesystem is no doubt going to be very costly in both CPU and memory. I did write a  little tool some time ago to generate such reports for quota-enabled btrfs subvolumes, but I ended up disabling the quota feature later on because even that is pretty costly. There&#39;s also  btdu, which takes a very interesting approach to analyze btrfs filesystems. ↩", "posttime": "2021-07-25 14:35:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ncdu,hungry", "title": "Ncdu 2：不那么饥饿，更加 Ziggy", "title_en": "Ncdu 2: Less hungry and more Ziggy", "transed": 1, "url": "https://dev.yorhel.nl/doc/ncdu2", "via": "", "real_tags": ["ncdu", "hungry"]}, {"category": "", "categoryclass": "", "imagename": "c7a6f5f3f2cc91279bafe604925d38c2.jpg", "infoid": 1069610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新研究显示，番茄果实在被毛毛虫吃掉时会通知母株。关于水果是否可以与它所附着的植物进行交流，我们知之甚少，这对于警告植物受到威胁可能很重要。这一早期证据表明，害虫袭击确实会触发整个植物的防御性电和生化反应。这可以为未来检测农业害虫提供更有效的监测策略。最近发表在《可持续食品系统前沿》上的一项研究表明，一种番茄植物的果实在被毛毛虫侵扰时会向植物的其余部分发送电信号。植物有多种化学和激素信号通路，它们通常通过树液（流经植物的富含营养的水）传播。就水果而言，营养物质只流向水果，而且很少研究是否存在相反方向的交流——即从水果到植物。 “我们通常会忘记，植物的果实是其母株的活的半自主部分，远比我们现在想象的要复杂！既然果实是植物的一部分，由叶子和茎的相同组织组成，为什么它们不能像普通叶子一样与植物交流，告诉它他们正在经历什么？”巴西佩洛塔斯佩洛塔斯联邦大学的第一作者 Gabriela Niemeyer Reissig 博士说。 “我们发现，水果可以与植物的其他部分共享重要信息，例如毛虫攻击——这对植物来说是一个严重的问题——这可能可以让植物的其他部分为同样的攻击做好准备。”为了验证水果通过电信号进行交流的假设，Niemeyer Reissig 和她的合作者将番茄植株放置在法拉第笼中，在将果实与植株相连的树枝末端设有电极。然后，他们测量了果实被棉铃虫毛虫攻击 24 小时之前、之中和之后的电响应。该团队还使用机器学习来识别信号中的模式。结果显示攻击前后的信号之间存在明显差异。此外，作者还测量了植物其他部分的生化反应，例如过氧化氢等防御性化学物质。这表明，即使在远离毛虫造成损害的植物部分，这些防御也被触发。作者强调，这些仍是早期结果。他们的测量提供了所有电信号的“大图”视图，而不是更精确地区分单个信号。看看这种现象是否适用于其他植物物种以及不同类型的威胁也很有趣。也就是说，机器学习的这种新颖用途似乎具有回答这些和其他未来问题的巨大潜力。该技术还可能为农业昆虫控制提供新的——可能更环保——的方法。\n“如果像我们这样的研究继续推进，并且在开放环境中测量电信号的技术不断改进，就有可能很早就发现农业害虫的侵染，从而采取不那么激进的控制措施和更准确的昆虫管理，”尼迈耶解释说赖西格。 “了解植物如何与其果实相互作用，以及果实之间如何相互作用，可能会带来关于如何&#39;操纵&#39;这种交流以提高果实质量、对害虫的抵抗力和收获后的保质期的见解。”重新出版指南：开放获取和共享研究是 Frontiers 使命的一部分。除非另有说明，否则您可以重新发布在 Frontiers 新闻博客中发布的文章——只要您包含返回原始研究的链接。不允许出售物品。", "note_en": "Tomato fruits inform the mother plant when they are being eaten by caterpillars, shows a new study. Little is known about whether a fruit can communicate with the plant to which it’s attached, which could be important for warning the plant of threats. This early evidence shows that pest attacks do trigger defensive electrical and biochemical responses across the plant. This could provide more effective monitoring strategies for detecting agricultural pests in the future.\n A recent study in   Frontiers in Sustainable Food Systems shows that the fruits of a type of tomato plant send electrical signals to the rest of the plant when they are infested by caterpillars. Plants have a multitude of chemical and hormonal signaling pathways, which are generally transmitted through the sap (the nutrient-rich water that moves through the plant). In the case of fruits, nutrients flow exclusively  to the fruit and there has been little research into whether there is any communication in the opposite direction–i.e. from fruit to plant.\n    “We usually forget that a plant’s fruits are living and semiautonomous parts of their mother-plants, far more complex than we currently think! Since fruits are part of the plant, made of the same tissues of the leaves and stems, why couldn’t they communicate with the plant, informing it about what they are experiencing, just like regular leaves do?” says first author  Dr Gabriela Niemeyer Reissig, of the Federal University of Pelotas, in Pelotas, Brazil. “What we found is that fruits can share important information such as caterpillar attack–which is a serious issue for a plant–with the rest of the plant, and that can probably prepare other parts of the plant for the same attack.”\n  To test the hypothesis that fruits communicate by electrical signals, Niemeyer Reissig and her collaborators placed tomato plants in a Faraday’s cage with electrodes at the ends of the branches connecting the fruits to the plant. They then measured the electrical responses before, during and after the fruits had been attacked by  Helicoverpa armigera caterpillars for 24 hours. The team also used machine learning to identify patterns in the signals.\n  The results showed a clear difference between the signals before and after attack. In addition, the authors measured the biochemical responses, such as defensive chemicals like hydrogen peroxide, across other parts of the plant. This showed that these defenses were triggered even in parts of the plant that were far away from the damage caused by the caterpillars.\n The authors emphasize that these are still early results. Their measurements provide a “big picture” view of all of the electrical signals, rather than distinguishing individual signals more precisely. It will also be interesting to see whether this phenomenon holds true for other plant species, as well as different types of threats.\n That said, this novel use of machine learning appears to have very high potential for answering these and other future questions. The technique may also provide new–and possibly more environmentally friendly–approaches for insect control in agriculture.\n “If studies like ours continue to advance and the techniques for measuring electrical signals in open environments continue to improve, it will be possible to detect infestation of agricultural pests quite early, allowing for less aggressive control measures and more accurate insect management,” explains Niemeyer Reissig. “Understanding how the plant interacts with its fruits, and the fruits among themselves, may bring insights about how to ‘manipulate’ this communication for enhancing fruit quality, resistance to pests and shelf life after harvest.”\n REPUBLISHING GUIDELINES: Open access and sharing research is part of  Frontiers’ mission. Unless otherwise noted, you can republish articles posted in the Frontiers news blog — as long as you include a link back to the original research. Selling the articles is not allowed.", "posttime": "2021-07-25 14:35:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "攻击,fruits,植物", "title": "番茄果实在受到攻击时会向植物的其余部分发出电气警告", "title_en": "Tomato fruits send electrical warnings to the rest of the plant when attacked", "transed": 1, "url": "https://blog.frontiersin.org/2021/07/20/tomato-fruits-send-electrical-warnings-to-the-rest-of-the-plant-when-attacked-by-insects/", "via": "", "real_tags": ["攻击", "fruits", "植物"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "专家警告，如果接受加密货币付款的公司破产，将有无法追踪资金的危险 一位破产专家警告说，由于接受未征税和无法追踪的加密货币付款的企业破产，政府可能面临“无限”损失。越来越多的公司，包括道德化妆品公司 Lush 和办公室共享公司 WeWork，已经开始以比特币等加密货币以及债务、信贷或现金支付商品和服务的费用。但是，尽管这种转变受到了加密爱好者的欢迎，但专家表示，这可能是董事向当局隐瞒现金的一种简单方式，尤其是在公司破产时。破产公司 Begbies Traynor 的董事总经理 Julie Palmer 表示，加密货币支付的日益普及将使负责在企业倒闭后关闭业务的管理人员更难追踪资金来自何处，以及所有者是否拥有，员工或董事非法从业务中剥离资金。这意味着犯罪分子可以带走通常会被追回并分配给债权人的收入，包括英国税务海关总署和地方当局的税务员。帕尔默表示，如果没有新的法规和税收计划，政府可能面临巨大损失。 “潜力是无限的，这取决于它变得多么受欢迎，”她警告说。\n这是加密货币日益流行的最新威胁，加密货币与洗钱和黑市交易有关。希望向税务员和管理人员隐瞒财富的犯罪分子传统上必须经历设立投资工具（例如离岸信托）以隐藏现金的繁琐过程。近年来，通过在线设置“虚拟钱包”，小企业、商人和犯罪分子更容易接受加密货币支付。有了信托，“至少我们可以看到这笔钱的来源和去向”，帕尔默说。但是对于更难追踪的加密货币，“我们实际上追踪它并看到被取出的钱的机会更少”。帕尔默表示，破产行业无法独自解决这个问题，并认为英国当局——在这个问题上落后美国“一两年”——应该采取行动并制定法律，以确保加密资产得到妥善处理。受监管和征税。 “这可能是所得税收入的重大损失，”她说。 HMRC 表示，它最近发布了一份手册，概述了不同类型的加密资产交易的税收后果。 HMRC 发言人说：“我们采取行动，包括利用议会赋予的权力从一系列信息来源收集数据，以识别和调查那些未能申报所有收入和收益的人，包括在隐蔽经济中经营的个人，通过复杂的有组织犯罪集团和用于隐藏收入和其他资产的离岸结构。”审查是在英格兰银行和财政部权衡数字资产被整合到英国货币体系的可能性的同时进行的，这可能是通过银行发行的资产，有时被称为“英国币”。\n尽管该银行已表示对该想法持开放态度，但其首席经济学家安迪·霍尔丹 (Andy Haldane) 认为比特币等现有加密货币可以成为标准支付机制的想法是空想的。", "note_en": "Experts warn of danger of untraceable funds if companies accepting payments in cryptos go bust\n    The government could face “limitless” losses as a result of businesses that accept payments in untaxed and untraceable cryptocurrencies going bust, an insolvency expert has warned.\n A growing number of companies, including the ethical cosmetics firm Lush and office-sharing firm WeWork, have begun taking payments for goods and services in cryptocurrencies such as bitcoin, alongside debt, credit or cash.\n   But while the shift has been welcomed by crypto-enthusiasts, experts say it could be an easy way for directors to hide cash from authorities, particularly when companies go bust.\n Julie Palmer, a managing director at insolvency firm Begbies Traynor, said the growing popularity of cryptocurrency payments would make it harder for administrators – who are in charge of winding down a business after it fails – to track where money has come from, and whether owners, staff or directors are stripping funds out of the business illegally.\n It means criminals could walk away with income that would usually be clawed back and distributed to creditors, including the tax collectors at HM Revenue and Customs and local authorities.\n Palmer said that without new regulations and taxation plans, the government could face huge losses. “The potential is limitless, depending on how popular this becomes,” she warned.\n It is the latest threat emerging from the rising popularity of cryptocurrencies, which have been linked to money laundering and black market dealings.\n Criminals hoping to conceal wealth from tax collectors and administrators have traditionally had to go through the onerous process of setting up an investment vehicle, such as an offshore trust, to hide cash. In recent years, it has become easier for small businesses, tradespeople and criminals to accept payment in cryptocurrency by setting up “virtual wallets” online.\n With trusts, “at least we could see the source of that money and where it’s gone”, Palmer said. But with cryptocurrencies, which are harder to trace, “we’ve got even less of a chance of actually tracing that and seeing the money that’s been taken out”.\n Palmer said there was nothing the insolvency profession could do to tackle the issue on its own and believes UK authorities – who are a “year or two behind” the US on the issue – should take action and introduce laws to ensure crypto-assets are properly regulated and taxed. “It’s potentially a major loss of income tax revenue,” she said.\n HMRC said it recently released a manual outlining the tax consequences of different types of crypto-asset transactions.\n An HMRC spokesperson said: “We take action, including using powers provided by parliament to gather data from a range of information sources, to identify and investigate those that have failed to declare all their income and gains, ranging from individuals operating in the hidden economy, through to sophisticated organised crime groups and offshore structures used to hide earnings and other assets.”\n   The review is taking place at the same time as the  Bank of England and the Treasury weigh up the possibility of digital assets being integrated into the UK’s monetary system, potentially via a Bank-issued asset sometimes dubbed “Britcoin”.\n While the Bank has signalled that it is open to the idea, its chief economist Andy Haldane has  dismissed as fanciful the idea that existing cryptocurrencies such as bitcoin could become a standard payments mechanism.", "posttime": "2021-07-25 14:35:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "货币,lead,加密", "title": "加密货币可能给英国政府带来“无限”损失", "title_en": "Cryptocurrencies could lead to ‘limitless’ losses for UK government", "transed": 1, "url": "https://www.theguardian.com/technology/2021/jul/25/cryptocurrencies-could-lead-to-limitless-losses-for-uk-government", "via": "", "real_tags": ["货币", "lead", "加密"]}, {"category": "", "categoryclass": "", "imagename": "8d5ce9b134bbd239511ff7bc52b7305a.jpg", "infoid": 1069606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "流行的移动支付服务 Venmo 重新设计了其应用程序。这通常是您可以放心忽略的新闻，但此公告值得仔细研究。除了进行一些导航调整和添加新的购买保护之外，PayPal 拥有的平台最终关闭了其全球社交源，该应用程序在其中发布了来自世界各地的人们的交易。这是解决应用程序世界中最突出的隐私问题之一的重要一步，但工作尚未完成。多年来，Venmo 的全球动态一直是对完全陌生的人的财务习惯进行窥探的洞察的字体。提要不显示给定交易的金额，但包括名称和注释表情符号和喜欢。点按姓名即可进入该用户的个人资料，一个有进取心的忙碌人士（或更糟）可以很快建立一个小档案，记录该人的朋友、他们的爱好以及他们滑入信息流中的任何其他内容——也许没有意识到该信息的公开程度。在写这些段落的时间里，亲戚们互相报销费城人队的门票，有人支付了“液体黄金😍”，不止一组室友平分了他们的网费。多年来，Venmo 交易和其他用户数据的可见性一直受到隐私和消费者权益倡导者的批评。数字权利组织电子前沿基金会的激进主义主管 Gennie Gebhart 说：“这种对社会支付应用程序的这种奇怪的企业位、这种企业 DNA 的承诺是一个巨大的负担。” “这不是一场等待发生的灾难，而是一场已经发生在这么多人身上的灾难。”最近和最引人注目的公开可能出错的例子发生在 5 月，当时 Buzzfeed 的一组记者找到了乔·拜登总统的 Venmo 帐户，以及他的家人和密友的帐户，只需在应用程序中搜索即可。他们花了10分钟。当时，即使您的交易记录被锁定，您的好友列表也是任何人都可以找到的公平游戏。对于围绕通常敏感的汇款和收款业务而构建的应用程序而言，这似乎有点不明智。然而，在 Buzzfeed 报告发布两周后，Venmo 添加了新的隐私控制，让您首次将应用程序上的联系人列表设为私有。删除全局提要扩展了这项工作，使窥探完全陌生的人变得越来越困难。很快，该应用程序的社交元素将仅限于您的 Venmo 联系人所做的事情。该公司在宣布重新设计的博客文章中表示：“这一变化使客户能够与最重要的人联系并分享有意义的时刻和体验。”虽然这当然算作进步，但隐私倡导者认为这还远远不够。 “Venmo 终于意识到，在金融应用程序上进行最大程度的宣传是一个糟糕的主意，”专注于互联网开放性和可访问性的非营利组织 Mozilla 基金会的高级活动家 Kaili Lambe 说。 “然而，从一开始我们就一直呼吁 Venmo 默认是私有的，因为如此多的 Venmo 用户实际上并不知道他们的交易是公开的。”\nVenmo 的一位发言人表示，该公司目前没有计划考虑将这些交易默认设为私有。这意味着用户仍然需要竭尽全力确保他们的每个点对点交易不会向全世界广播。很难看出维持现状的好处。 “你会想到很多非常敏感的用例，”Gebhart 说。 “你想到治疗师，你想到性工作者。你想想美国总统。想象一下这些默认设置可能会出现严重错误并对真实的人造成真正伤害的地方，并不需要很大的想象力。” Venmo 公开默认立场的影响已经超出了拜登账户的发现。 2018 年，隐私倡导者和设计师 Hang Do Thi Duc 使用 Venmo 的公共 API 整理了平台上近 2.08 亿笔交易，仅根据他们在应用程序中的活动，拼凑出五名用户的详细画像。第二年，程序员 Dan Salmon 编写了一个 20 行的 Python 脚本，让他在几周内获得了数百万的 Venmo 付款。此后，Venmo 对您通过公共 API 访问交易数据的速度进行了限制，但 Salmon 表示，该公司做得还不够。 “Venmo 基本上有一个我可以连接到交易数据的消防水管，”他说。 “现在这被切断了，交易仍然存在；只需要多走几步就可以得到它们。”他说构建一个新的抓取工具需要大约一个小时的工作。 “在 Venmo，我们会定期评估我们的技术协议，作为我们对平台安全和不断改善客户的 Venmo 体验的承诺的一部分。抓取 Venmo 违反了我们的服务条款，我们积极努力限制和阻止违反这些政策的活动，”Venmo 发言人 Jaymie Sinlao 在一封电子邮件声明中写道。 “我们继续为获得批准的开发人员提供对我们现有 API 的选择性访问，以继续在 Venmo 平台上进行创新和构建。” Venmo 远不是唯一一个让您选择退出共享而不是主动寻求共享的应用程序。但是因为它的用例完全是金融的，所以赌注要高得多，而且其用户的假设可能会放错地方。 Venmo 并没有让用户特别容易弄清楚他们正在分享什么或没有分享什么。 2018 年，它与联邦贸易委员会达成和解，部分原因是其令人困惑的隐私设置。 “有趣的是，人们非常惊讶地发现金融服务应用程序默认是公开的，”Mozilla 基金会的兰贝说。 “即使是使用 Venmo 多年的人也可能不知道他们的设置是公开的。”\n为确保您不会继续前进，请前往“设置”&gt;“隐私”并选择“私人”。然后点击过去的交易，然后点击全部更改为私人以追溯锁定。在此期间，请继续点击好友列表，然后点击私人并关闭出现在其他用户的好友列表中。否则，您将与您认识的每个人以及许多您不认识的人分享您的信用卡购买的数字等价物。或者考虑使用 Square 的 Cash App 之类的东西，默认情况下是私有的。对于 Venmo 及其用户而言，失去全球供稿是迈向隐私的重要一步。希望还有更多步骤。", "note_en": "Venmo, the popular mobile payment service, has redesigned its app. That&#39;s normally news you could safely ignore, but this announcement is worth a closer look. In addition to making some navigational tweaks and adding new purchase protections, the PayPal-owned platform is finally shutting down its global social feed, where the app published transactions from people around the world. It&#39;s an important step toward resolving one of the most prominent privacy issues in the world of apps, but the work isn&#39;t finished yet.\n Venmo’s global feed has for years been a font of voyeuristic insights into the financial habits of total strangers. The feed doesn&#39;t display amounts for a given transaction, but names and notes emoji and likes are included. Tapping on a name brings you to that user&#39;s profile, and an enterprising busybody (or worse) could pretty quickly build a small dossier of that person&#39;s friends, their hobbies, and anything else they’ve slipped into the stream—without, perhaps, realizing how public that info can be. In the time it took to write these paragraphs, relatives reimbursed each other for Phillies tickets, someone made a payment for “liquid gold 😍,” more than one set of roommates split their internet bill.\n The visibility of Venmo transactions and other user data has been criticized by privacy and consumer advocates for years. “This commitment to this weird corporate bit, this corporate DNA, of a social payment app is a huge liability,” says Gennie Gebhart, activism director at the Electronic Frontier Foundation, a digital rights group. “It’s not a disaster waiting to happen, it’s a disaster that’s already happened so many times to so many people.”\n The most recent and most high-profile instance of where that openness can go wrong came in May, when a team of  Buzzfeed reporters found President Joe Biden’s Venmo account, along with those of his family and close friends, simply by searching within the app. It took them 10 minutes.\n At the time, even if your transaction history was locked down, your friends list was fair game for anyone to find. Which, again, seems a little unwise for an app built around the often sensitive business of sending and receiving money. Two weeks after the Buzzfeed report, however, Venmo added new privacy controls, letting you make your list of contacts on the app private for the first time.\n The removal of the global feed extends that work, by making it incrementally harder to snoop on total strangers. Soon, the social element of the app will be limited to what your Venmo contacts are up to. “This change allows customers to connect and share meaningful moments and experiences with the people who matter most,” the company said in a blog  post announcing the redesign. While it certainly counts as progress, privacy advocates believe it doesn’t go far enough.\n “Venmo’s finally getting the message that maximum publicity on a financial app is a terrible idea,” says Kaili Lambe, senior campaigner at the Mozilla Foundation, a nonprofit focused on internet openness and accessibility. “However, from the beginning we have been calling on Venmo to be private by default, because so many Venmo users don’t actually know that their transactions are public to the world.”\n A Venmo spokesperson said the company has no plans at this time to consider making those transactions private by default. That means users will still need to go out of their way to make sure their every peer-to-peer transaction isn&#39;t broadcast to the world. It&#39;s hard to see the benefit of maintaining the status quo.\n “You think of a lot of really sensitive use cases,” says Gebhart. “You think about therapists, you think about sex workers. You think about the president of the United States. It doesn’t take a big imagination to imagine places where these defaults could go horribly wrong and cause real harm to real people.”\n The implications of Venmo’s public-by-default stance have played out beyond the discovery of Biden’s account. In 2018, privacy advocate and designer Hang Do Thi Duc used Venmo’s public API to  sort through nearly 208 million transactions on the platform, piecing together alarmingly  detailed portraits of five users based only on their activity in the app. The following year, programmer Dan Salmon wrote a 20-line Python script that  let him scrape millions of Venmo payments in a matter of weeks.\n Venmo has since placed restrictions on the rate at which you can access transaction data through the public API, but Salmon says the company hasn’t gone far enough. “Venmo basically had a firehose I could connect to of transaction data,” he says. “Now that that is cut off, the transactions are still out there; it will just take a few more steps to go get them.” He says it would take about an hour of work to build a new scraping tool.\n “At Venmo, we routinely assess our technical protocols as part of our commitment to platform security and continually improving the Venmo experience for our customers. Scraping Venmo is a violation of our terms of service, and we actively work to limit and block activity that violate these policies,” Venmo spokesperson Jaymie Sinlao wrote in an emailed statement. “We continue to enable select access to our existing APIs for approved developers to continue innovating and building upon the Venmo platform.”\n Venmo is far from the only app that  makes you opt out of sharing rather than actively seeking it out. But because its use case is exclusively financial, the stakes are significantly higher, and the assumption of its users potentially misplaced. Venmo hasn’t made it especially easy for users to figure out what they are or are not sharing; in 2018 it  reached a settlement with the Federal Trade Commissions related in part to its confusing privacy settings.\n “Anecdotally, people are very surprised to find that a financial services app is public by default,” says the Mozilla Foundation’s Lambe. “Even people who’ve been using Venmo for years might not know that their settings are public.”\n To make sure that yours aren’t going forward, head to  Settings &gt; Privacy and select  Private. Then tap  Past Transactions, and tap  Change All to Private to lock things down retroactively. And while you’re at it, go ahead and tap  Friends List, then tap  Private and toggle off  Appear in other users’ friends list. Otherwise, you’re sharing the digital equivalent of your credit card purchases with everyone you know, and lots of people you don’t. Or consider using something like Square’s Cash App instead, which is private by default.\n Losing the global feed is an important step toward privacy for Venmo and its users. Hopefully, more steps are still to come.", "posttime": "2021-07-25 13:56:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "venmo,private", "title": "Venmo 变得更加私密——但它仍然不完全安全", "title_en": "Venmo gets more private—but it’s still not fully safe", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/venmo-gets-more-private-but-its-still-not-fully-safe/", "via": "", "real_tags": ["venmo", "private"]}, {"category": "", "categoryclass": "", "imagename": "f4915edbe553c8739a9cb93f908e4e32.jpeg", "infoid": 1069605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过跟踪地震释放的地震能量如何穿过或反射地球表面下的不同层，我们已经了解了很多关于我们星球内部的信息。火星上的一年多来，我们在火星上安装了地震仪，希望它能帮助我们弄清楚这颗红色星球的内部。但是火星在地震方面相对安静，我们只有一个地震仪而不是整个网络。尽管如此，有了少数重大地震的记录，我们现在对火星内部的样子有了一些了解。一组新的研究表明它非常奇怪，有一个大而轻的核心和一个意外温暖的地壳。计算行星的结构涉及读取地震波，地震波分为两类：剪切波和压缩波（S 和 P，在地质学术语中）。根据地震（或地震）的位置，海浪可能会直接到达。但许多其他人在到达接收器之前从行星表面反弹，有时多次。所以P波之后会是PP波，然后是PPP波。美国地质调查局有一个很好的图表，说明了这可能产生的复杂性，我们已将其包含在右侧。但这远没有结束并发症。波的速度，以及 P 和 PP 和 PPP 信号之间的时间间隔，将根据波传播的材料而变化。材料的成分、密度甚至温度都会影响地震信号穿过地球的速度。这些特性通常在行星的特定层之间存在显着差异，例如固体地壳和半熔融地幔。这些差异会折射一些地震波，从而弯曲它们穿过行星内部的路径。其他波会从内部层之间的边界反射。所有这些都使得从地震事件中重建内部变得复杂。通常有不止一种属性组合，例如距离、材料和温度与事件产生的地震信号兼容。在地球上，这不是问题。我们有大量的地震仪，可以让我们将信号的最可能解释归零。我们有很多单独的事件，这使我们能够识别我们星球内部的典型行为。在火星上，这些都不是真的。我们总共有一台地震仪，因此即使距离估计充其量也是不确定的。而且我们对行星的内部温度知之甚少。在阅读这些研究时，有些观点几乎让人觉得他们在哀悼因洞察号测量火星内部温度的尝试失败而导致的数据缺失。火星在地震中也非常安静。没有震级超过4.0级的地震，也没有多少震级。总而言之，从洞察号着陆点的背景噪音中可以清楚地看出不到十二个事件。因此，您应该将这些论文中的结果视为火星内部的初始模型：随着更多数据的出现，它们可能会得到改进，甚至可能会进行相当大的修改。\n鉴于我们已经获得了大量起源于火星的陨石，从轨道上对其进行了研究，并在其上着陆了硬件，因此我们对火星最外层地壳的样子有很好的了解。然而，根据地震波，其中一项研究表明，在洞察号着陆点，外地壳仅延伸到地球表面以下约 10 公里处。但是有一个下地壳向下延伸到地幔，这项研究表明它开始于大约 50 公里深。第一个结果与第二项研究一致，该研究显示了向下 6 到 11 公里之间的某处边界。但它显示了介于 15 和 25 公里之间的第二个边界，这比第一个要高得多。尽管如此，它还看到一些迹象表明第三个边界在 27 到 47 公里之间——这个数字与第一篇论文中的 50 公里数字一致。所以实际上，两者之间的最大区别在于存在多少层地壳。这两项研究一致认为地壳比预期的要温暖。这意味着存在的放射性元素比我们根据我们对表面成分的了解所预测的要多。为什么会出现这种情况尚不清楚，过量放射性的数量还取决于地壳的确切厚度。同样，按照最初的意图，测量通过地壳的热流可能会产生很大的不同。最后一篇论文深入探讨了火星地幔与其核心之间的边界。结果是半径在 1,800 公里以北。这出乎意料地大：它超过了整个星球半径的一半。大核心的后果之一是，为了与行星的整体密度兼容，核心必须比预期的要轻（它也是液体）。这意味着存在较轻的元素。硫是最合理的候选物，但预计火星没有足够的硫来解释这一切。因此，碳、氧和氮也可能存在于地核中。这样做的一个后果是地核外边缘的压力会降低，这意味着火星不可能像地球一样形成一种有助于在地核中吸收热量的矿物。这可能导致这颗行星更快地失去其形成过程中留下的热量。 InSight 的使命已经扩展，因此我们将继续从未来的地震中获取更多数据。虽然初始数据与各种潜在条件兼容——各种层的密度、温度和厚度的误差线很大——但进一步的数据应该有助于缩小范围。但事实证明，就洞察号的着陆位置而言，巨大的液态核心相当不幸。核心本身在火星上投下了地震“阴影”，阻挡了来自地震仪的地球另一侧的地震波。核心越大，洞察力看不见的行星就越多。而且，不幸的是，这个阴影包括塔尔西斯地区，那里有火星最大的火山，被认为最近才活跃起来。\n无法“看到”塔尔西斯意味着我们登记的地震总数可能会减少。尽管如此，只要硬件支持，我们就有可能拥有稳定增长的数据收集，这些数据将逐渐让我们更清楚地了解这颗红色行星的组成和演化——这将有助于我们了解行星内部和外部的形成我们的太阳系。", "note_en": "We&#39;ve learned a lot about our planet&#39;s interior simply by tracking how the seismic energy released by earthquakes moves through or reflects off the different layers present beneath Earth&#39;s surface. For over a Martian year,  we&#39;ve had a seismograph on Mars in the hope that it would help us to figure out the red planet&#39;s interior.\n But Mars is relatively quiet seismically, and we&#39;ve only got a single seismograph instead of an entire network. Still, with records of a handful of significant marsquakes, we now have some sense of what Mars&#39; interior looks like. And a set of new studies indicates that it&#39;s pretty weird, with a large, light core and an unexpectedly warm crust.\n  Working out the structure of a planet involves reading seismic waves, which come in two categories: shear and compressional (S and P, in geological parlance). Depending on the location of the earthquake (or marsquake), the waves may arrive directly. But many others bounce off the surface of the planet before reaching the receiver, sometimes multiple times. So P waves will be followed by PP waves, and later by PPP waves. The US Geological Survey has  a great diagram of the complexity this can produce, which we&#39;ve included at right.\n But that&#39;s far from the end of the complications. The speed of the waves, and thus the time gaps between P and PP and PPP signals, will vary based on the material the waves are traveling through. The composition, density, and even temperature of the material can all make a difference in the speed at which seismic signals move through the planet. These properties often differ dramatically between specific layers of the planet, such as the solid crust and the semi-molten mantle. These differences will refract some of the seismic waves, bending their path through the planet&#39;s interior. Other waves will reflect off the boundary between internal layers.\n    All of that makes reconstruction of the interior from seismic events complicated; there are generally more than one combination of properties like distance, materials, and temperatures that are compatible with the seismic signals produced by an event. On Earth, this isn&#39;t a problem. We have a huge collection of seismographs that allows us to zero in on the most likely interpretation of the signals. And we have lots of individual events, which allow us to identify the typical behavior of our planet&#39;s interior.\n On Mars, none of that is true. We have a grand total of one seismograph, and so even distance estimates are iffy at best. And we have very little sense of the internal temperature of the planet. There are points in reading the studies that almost feel like they&#39;re mourning the absence of data from  the failed attempt to have InSight take Mars&#39; internal temperature.\n Mars also turns out to be very seismically quiet. There were no marsquakes with a magnitude above 4.0, and there weren&#39;t many of any magnitude. All told, fewer than a dozen events stood out clearly from the background noise at InSight&#39;s landing site. So, you should view the results in these papers as an initial model of Mars&#39; interior: they&#39;re likely to be refined as more data comes in and may even be revised considerably.\n  We have a good sense of what the outermost Martian crust looks like, given that we&#39;ve obtained plenty of meteorites that originated on Mars, studied it from orbit, and landed hardware on it. Based on seismic waves, however, one of those studies suggest that the outer crust only extends to about 10 km beneath the planet&#39;s surface at the InSight landing site. But there&#39;s a lower crust, which extends down the mantle, which this study suggests starts at about 50 km deep.\n The first result is in keeping with a second study, which shows a boundary somewhere between six and 11 km down. But it shows a second boundary somewhere between 15 and 25 km, which is much higher than the first. Still, it also sees some indication of a  third boundary somewhere between 27 and 47 km—a figure that&#39;s consistent with the 50 kilometer figure in the first paper. So really, the big difference between the two is about how many layers of crust are present.\n    The things both these studies agree on is that the crust is warmer than expected. This implies that there are more radioactive elements present than we would have predicted based on what we know about the surface composition. Why that&#39;s the case is unclear, and the amount of excess radioactivity also depends on the exact thickness of the crust. Again, having a measure of the heat flow through the crust, as was originally intended, could have made a big difference here.\n The final paper goes deep and looks for the boundary between Mars&#39; mantle and its core. The result is a radius just north of 1,800 km. This is unexpectedly large: it&#39;s over half the radius of the entire planet. One of the consequences of the large core is that, to be compatible with the planet&#39;s overall density, the core has to be lighter than expected (it&#39;s also liquid). That implies the presence of lighter elements. Sulfur is the most reasonable candidate, but Mars isn&#39;t expected to have enough sulfur to account for it all. So carbon, oxygen, and nitrogen can probably be found in the core as well.\n One consequence of this is that the pressures at the outer edge of the core will be lower, meaning that Mars couldn&#39;t have formed a mineral that helps trap heat in the core like Earth. This may have caused the planet to lose the heat left over from its formation more rapidly.\n  InSight has seen its mission extended, so we&#39;ll continue to get more data from future marsquakes. While the initial data is compatible with a variety of potential conditions—the error bars on the density, temperature, and thickness of various layers are large—further data should help narrow things down.\n But the large, liquid core turns out to be rather unfortunate in terms of InSight&#39;s landing location. The core itself casts a seismic &#34;shadow&#34; across Mars, blocking waves from marsquakes on the opposite side of the planet from the seismograph. The larger the core, the more of the planet that&#39;s invisible to InSight. And, unfortunately, that shadow includes the Tharsis region, which contains Mars&#39; largest volcanoes and is thought to have been active relatively recently.\n Not being able to &#34;see&#34; Tharsis means we&#39;re likely to register fewer marsquakes in total. Still, as long as the hardware holds up, we&#39;re likely to have a steadily growing collection of data that will gradually give us a clearer picture of the red planet&#39;s composition and evolution—something that will help us understand planet formation both within and outside of our Solar System.", "posttime": "2021-07-25 13:55:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "rust,星球,planet,地震", "title": "红色星球地核大，地壳复杂", "title_en": "Red planet has a big core, complex crust", "transed": 1, "url": "https://arstechnica.com/science/2021/07/marsquakes-illuminate-what-lies-beneath-the-sands-of-mars/", "via": "", "real_tags": ["rust", "星球", "planet", "地震"]}]