[{"category": "", "categoryclass": "", "imagename": "16d079da1049492cd2826ba24a22a667.jpg", "infoid": 1031524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "需要澄清的是，首席执行官亚历克斯·陶布告诉我，他并不是想要取代LinkedIn--他承认，由于网络效应，“如果你想要关闭LinkedIn，你是无法做到的。”\n相反，我们的目标是创造一些满足不同需求的东西。LinkedIn主要作为在线简历和关系网工作，而Upstream的目标是帮助用户建立对他们的职业生涯很重要的人脉和人际关系--这在大规模聚会和会议并不是真的可能的时候是非常需要的(尽管我们肯定在TechCrunch上尝试创建虚拟的等价物)。\nUpstream的第一个产品专注于专业团体和社区，允许用户发布公司所谓的专业要求，比如他们是否想要招聘某个职位的人，或者需要在另一家公司进行介绍。\n陶布表示，Upstream的下一款产品Upstream Events真正实现了这一点，Upstream将主持一位嘉宾演讲者，然后与会者与活动中的其他人进行5分钟的一对一视频聊天。\nUpstream表示，它已经举办了100多场活动，参加一场活动的人中有72%随后会参加另一场活动。\n虽然团队已经构建了多个产品(我们已经介绍了其中的一些)，但他们今天正在勾勒出更广阔的愿景，同时推出一些新功能。\n首先，虽然社区以前是通过私有的、未列出的链接共享的，但现在您可以在Discovery部分浏览所有不同的社区。与此同时，社区组织者仍然可以通过批准或拒绝新成员来控制谁加入了社区。\n还有一个叫做办公时间的新活动，允许用户留出结构化的时间，与任何有兴趣与他们交谈的人进行虚拟的一对一会谈。这些会话可以公开列出，也可以不列出，这样您就只能通过电子邮件或在某个社区内共享它们。\n在一篇博客文章中，陶布指出，他通过Ohours.org认识了他的SocialRank/Upstream联合创始人兼首席技术官迈克尔·申菲尔德，他们正试图在这里复制这种经历：\n假设您是一家大公司的首席营销官，您想让您的员工有机会1：1会面。使用您的Outlook日历和电子邮件协调10分钟的个人日程安排的想法并不吸引人。但是使用Upstream，您可以选择您想要提供的30分钟块，以及您希望会话的时间长度。你决定在今年剩下的时间里每隔一个周五美国东部时间下午2点上班。活动已构建，并且可以无缝共享给您选择向其提供办公时间的任何人。\n事实上，Taub的帖子列出了30多个已经在Upstream上提供办公时间的人，包括“纽约时报”记者泰勒·洛伦茨、Foursquare联合创始人/Expa合伙人Naveen Selvadurai和亚马逊图片产品主管Nate Wesiemer。\n上游还宣布，它已经从8-bit Capital、Human Ventures、BaseFund、NYVP和各种天使投资者那里筹集了一笔数额不详的预种子资金。\n展望未来，Taub表示，下一个最重要的任务是推出Upstream的网络版(目前可以通过移动应用程序获得)，并继续构建实时体验、异步体验和提供真正实用的功能。\n他写道：“我们设想的未来是，专业人士来到上游参加活动或询问，并留下来寻找令人信服的机会，使上游成为他们充满活力和有益的体验。”", "note_en": "To be clear, CEO Alex Taub told me that he’s not trying to replace LinkedIn — he acknowledged that thanks to network effects,”If you want to go and try to take down LinkedIn, you’re not going to be able to take them down.”\n Instead, the goal is to create something that fulfills a different need. Where LinkedIn works primarily as an online résumé and rolodex,  Upstream   aims to help users build the connections and relationships that are important to their careers — something that’s sorely needed at a time when large-scale meetups and conferences aren’t really possible (though we’re certainly trying to create the virtual equivalent  at TechCrunch).\n   Upstream’s first product focused on professional groups and communities, allowing users to post what the company called Professional Asks, like if they’re looking to hire someone for a certain position or need an introduction at another company.\n Taub suggested that things really took off with Upstream’s next product, Upstream Events, where Upstream would host a guest speaker, then attendees were matched up for five-minute, one-on-one video chats with the other people at the event.\n  Upstream says it’s already hosted more than 100 events, with 72% of people who who attend one event subsequently attending another.\n While the team has built multiple products (and  we’ve covered some of them already), they’re outlining the broader vision today and launching some new features at the same time.\n For one thing, while communities were previously shared via a private, unlisted link, you can now browse all the different communities in a Discovery section. At the same time, community organizers will be still be able to control who joins by approving or rejecting new members.\n There’s also a new spin on Events called Office Hours, allowing users to set aside structured time for virtual one-on-one sessions with anyone who’s interested in speaking to them. These sessions can be listed publicly, or they can be unlisted, so that you only share them via email or within a certain community.\n  In  a blog post, Taub noted that he met his SocialRank/Upstream co-founder and CTO Michael Schonfeld via Ohours.org, and they’re trying to replicate that experience here:\n Let’s say you are the CMO of a large company and you want to give your people the opportunity to meet 1:1. The thought of coordinating the individual scheduling of ten minute blocks using your Outlook calendar and email is not attractive. But with Upstream, you are able to choose the 30min block you want to offer and how long you want the sessions to be. You decide you want to run your office hours every other Friday at 2pm ET for the rest of the year. The event is built and able to be shared seamlessly to whoever you choose to offer the Office Hours to.\n In fact, Taub’s post lists more than 30 different people who are already offering office hours on Upstream, including New York Times reporter  Taylor Lorenz, Foursquare co-founder/Expa partner  Naveen Selvadurai and Amazon Photo Head of Product  Nate Westheiemer.\n Upstream is also announcing that it has raised an undisclosed amount of pre-seed funding from 8-Bit Capital, Human Ventures, Basement Fund, NYVP and various angel investors.\n Looking ahead, Taub said that the next big priority is launching a web version of Upstream (which is currently available via mobile app), and to continue building live experiences, asynchronous experiences and features that provide real utility.\n “We imagine a future when professionals come to Upstream for an event or Ask, and stay for the compelling opportunities that make Upstream an energizing and beneficial experience for them,” he wrote.", "posttime": "2020-10-28 00:10:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "成为,aims,upstream", "title": "\n上游的目标是成为您职业社交生活的新家。", "title_en": "\n\t\t\t\tUpstream aims to be the new home for your professional social life\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/upstream/", "via": "", "real_tags": ["成为", "aims", "upstream"]}, {"category": "", "categoryclass": "", "imagename": "786054941abf0bc6d1e6357f8d6b1e73.jpg", "infoid": 1031523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于智能家居大赛来说，这是忙碌的几周。亚马逊(Amazon)、谷歌(Google)和苹果(Apple)都发布了新的智能扬声器，目的之一是巩固它们各自在用户联网家庭中心的地位。\n除了推出一系列新的Echo设备外，亚马逊还在改进其以廉价著称的Fire平板电脑的功能。今天，该公司将推出一项免费软件更新，以选择带智能家居设备仪表盘的石板。该系统本质上是支持Alexa的联网设备的一站式商店。\n它类似于谷歌和苹果通过各自的Home应用程序提供的各种控制中心，可以访问智能灯、插头、相机、恒温器等，应有尽有。在Echo Show设备上也可以找到类似的功能。Fire平板电脑提供了一种相当便宜的方式来实现这一功能(未来Fire TV也可能如此)。当然，亚马逊也在努力改进这些设备上的Alexa功能，实质上是让它们成为廉价智能显示屏的两倍。\n然而，也许最大的谜团是在新的Echo上增加了智能家居集线器功能。这一事实被报道得有点少(毕竟，亚马逊在之前的Echo Plus机型中开始添加这一功能)，但为这款99美元的设备添加ZigBee功能应该会在一定程度上降低进入门槛。", "note_en": "It’s been a busy few weeks for the smart home race.  Amazon,   Google and Apple have all announced new smart speakers aimed at — among other things — cementing their respective positions at the center of users’ connected households.\n Adding onto the introduction of a whole bunch of new  Echo   devices, Amazon is also improving what its famously inexpensive Fire Tablets can do. Today the company will be rolling out a free software update to select slates that brings a smart home device dashboard. The system essentially serves as a one-stop shop for connected devices that work with Alexa.\n  It’s similar to the sorts of control centers Google and Apple offer with their respective Home apps, with access to things like smart lights, plugs, cameras, thermostats, you name it. Similar functionality can also be found on the Echo Show devices. Fire tablets offer a pretty cheap way in to that functionality (so, too, might Fire TVs, going forward). And, of course, Amazon has also made efforts to improve Alexa functionality on the devices, essentially letting them double as inexpensive smart displays.\n Perhaps the biggest piece of the puzzle, however, is the addition of smart home hub functionality on the new Echo. The fact was a bit under reported (Amazon, after all, started adding this functionality with previous Echo Plus models), but adding zigbee functionality for the $99 device should go a ways toward lowering that barrier of entry.", "posttime": "2020-10-28 00:09:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电脑,amazon,亚马逊,设备,control", "title": "\n亚马逊增加设备仪表盘，努力使Fire平板电脑成为智能家居控制中心", "title_en": "\n\t\t\t\tAmazon adds device dashboard in bid to make Fire tablets a smart home control center\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/amazon-adds-device-dashboard-in-bid-to-make-fire-tablets-a-smart-home-control-center/", "via": "", "real_tags": ["电脑", "amazon", "亚马逊", "设备", "control"]}, {"category": "", "categoryclass": "", "imagename": "ebd54d4c321aa9ff0cd355867caa9652.jpg", "infoid": 1031522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如联合创始人兼首席执行官文卡特·文卡塔拉马尼(Venkat Venkataramani)在2018年首轮比赛时告诉我的那样，让数据准备好使用需要大量的人工工作，这是获得真正洞察力的障碍。他希望用Rockset来改变这一点。\n我们正在用创新的架构和独特的功能来构建我们的服务，这些功能可以直接在原始数据上实现全功能的FAST SQL。我们把这个作为一项服务来提供。因此，开发人员和数据科学家可以在几分钟内从任何形式、任何形式的有用数据转变为有用的应用程序。今天需要几个月的时间，“他在2018年告诉我。\n事实上，“Rockset自动在任何数据上建立一个聚合索引--包括结构化、半结构化、地理和时间序列数据--用于大规模的高性能搜索和分析，”该公司解释说。\n这似乎引起了投资者和客户的共鸣，因为该公司筹集了健康的B轮融资，业务正在蓬勃发展。Rockset提供了一些指标来说明这一点。首先，上个季度的收入增长了290%。虽然他们没有为这一百分比增长提供任何基础数据，但这显然是相当可观的。\n此外，这家初创公司报告称增加了数百名新用户，同样没有确定任何具体数字，该平台上的查询量增长了313%。如果没有具体细节，很难知道这意味着什么，但对于处于早期阶段的初创公司来说，这似乎是健康的增长，特别是在当前的经济形势下。\n红杉资本(Sequoia)合伙人迈克·弗纳尔(Mike Veronal)认为，一家公司帮助数据工作的速度比其他解决方案更快，因为其他解决方案首先需要大量处理。Rockset凭借其创新的数据索引新方法，迅速成为云中实时分析的真正领导者。弗纳尔在一份声明中表示：“我很高兴能与该公司合作，共同度过下一阶段的增长。”\n该公司由RocksDB的创建者于2016年创立。这家初创公司此前在成立公司时筹集了300万美元的种子轮，并在2018年筹集了1850万美元的A轮。", "note_en": "As co-founder and CEO Venkat Venkataramani told me  at the time of the Series A in 2018, there is a lot of manual work involved in getting data ready to use and it acts as a roadblock to getting to real insight. He hoped to change that with Rockset.\n “We’re building out our service with innovative architecture and unique capabilities that allows full-featured fast SQL directly on raw data. And we’re offering this as a service. So developers and data scientists can go from useful data in any shape, any form to useful applications in a matter of minutes. And it would take months today,” he told me in 2018.\n  In fact, “ Rockset   automatically builds a converged index on any data — including structured, semi-structured, geographical and time series data — for high-performance search and analytics at scale,” the company explained.\n It seems to be resonating with investors and customers alike as the company raised a healthy B round and business is booming. Rockset supplied a few metrics to illustrate this. For starters, revenue grew 290% in the last quarter. While they didn’t provide any foundational numbers for that percentage growth, it is obviously substantial.\n  In addition, the startup reports adding hundreds of new users, again not nailing down any specific numbers, and queries on the platform are up 313%. Without specifics, it’s hard to know what that means, but that seems like healthy growth for an early stage startup, especially in this economy.\n Mike Vernal, a partner at Sequoia, sees a company helping to get data to work faster than other solutions, which require a lot of handling first. “Rockset, with its innovative new approach to indexing data, has quickly emerged as a true leader for real-time analytics in the cloud. I’m thrilled to partner with the company through its next phase of growth,” Vernal said in a statement.\n The company was founded in 2016 by the creators of RocksDB. The startup had previously raised a $3 million seed round when they launched the company and the $18.5 million A round in 2018.", "posttime": "2020-10-28 00:09:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "宣布,data,数据", "title": "\nRockset宣布投资4000万美元B系列，数据分析解决方案势头强劲", "title_en": "\n\t\t\t\tRockset announces $40M Series B as data analytics solution gains momentum\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/rockset-announces-40m-series-b-as-data-analytics-solution-gains-momentum/", "via": "", "real_tags": ["宣布", "data", "数据"]}, {"category": "", "categoryclass": "", "imagename": "01c477e43ff90f2fe57ab1da9d6df48f.jpg", "infoid": 1031521, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部位于洛杉矶的运营和安全管理软件服务公司Replicate已经筹集了2500万美元，以增加人员配备，扩大销售和营销努力。\n这笔融资由Two Sigma Ventures牵头，包括Plexo Capital、Amplify和Boldstart等现有投资者，对该公司的估值超过1亿美元。\nRepliced最初是一家为Docker集装箱开发工具提供软件安全和管理服务的开发商，但随着市场转向Kubernetes，该公司转向为这些应用程序提供服务。\n去年，该公司推出了管理Kubernetes部署的工具，并立即看到销售额增加。\n“新的发行改变了公司的方向，增加了速度和客户，市场对此反应良好，”复制的首席执行官格兰特·米勒(Grant Miller)说。“一旦我们开始在这一成功的基础上再接再厉..。我们请来了UIPath，Puppet，他创造了软件自动化产品Tripwire，然后是FlatFile和Fishtown Analytics等很酷的新兴软件公司。\nRepliced现在拥有85名客户，他们为访问该平台以及客户通过该平台开发的每个内部部署付费。“如果你是一家像木偶这样的公司，你就有数百名内部客户。”\n该公司已经在招聘关键的高管，包括一名首席产品官、一名首席营收官以及负责营销和销售的副总裁。其中一部分资金将用于支持Replicated的持续招聘，另一大部分资金将用于产品开发。\n米勒说：“我们正在自动化许多需要IT管理员将手放在键盘上来调整和优化的手动软件过程。”通过复制，一半的服务用于软件供应商管理发布和许可的工具，另一半用于IT管理员。这是关于他们如何自动化应用程序集成的问题。“。\n米勒说，该公司目前有28名员工，预计到2021年底将增长到75名员工。\n米勒在一份声明中说：“本地软件市场比SaaS市场大四倍。”复制使软件销售商能够以更低的工程费用和更快的上市时间释放本地软件类别的机会。这是云原生计算和Kubernetes的融合使这一市场变革成为可能。“", "note_en": "The Los Angeles-based operations and security management software service, Replicated has raised $25 million to ramp up its staffing and scale its sales and marketing efforts.\n The funding, which was led by  Two Sigma Ventures   and included existing investors like Plexo Capital, Amplify, and BoldStart values the company at over $100 million.\n Replicated began as a developer of software security and management services for Docker containerized development tools, but as the market shifted to Kubernetes,  the company shifted to service those applications.\n   Last year, the company unveiled its tools for managing Kubernetes deployments and immediately saw sales increase.\n “That new offering changed the direction of the company and added velocity and customers and the market responded so well to it,” said Replicated chief executive, Grant Miller. “Once we started building on that success.. We brought on UIPath, Puppet, who created the software automation stuff, TripWire, and then these cool emerging software companies like FlatFile and Fishtown Analytics.”\n Replicated now counts 85 customers who pay for access to the platform and for every on-premise deployment that customers develop through the platform. “If you are a company like Puppet, you have hundreds of on-premise customers.”\n The company has already been staffing up with key c-suite hires including a chief product officer, a chief revenue officer and vice presidents of marketing and sales. Some of the money will support Replicated’s continued hiring push, while another chunk will go into product development.\n “We’re automating as much of the manual software processes that require IT admins to put their hands on keyboards to adjust and optimize things,” said Miller. “With Replicated, half of the services are for tooling for the software vendor to manage release and licensing and the other half is for the IT admin. It’s about how they automate the integration of the applications.”\n The company, which currently has 28 employees expects to grow to 75 staff members by the end of 2021, Miller said.\n “The on-prem software market is four times larger than the SaaS market,” Miller said in a statement. “Replicated lets software vendors unlock the opportunity of the on-prem software category with lower engineering overhead and faster time to market. This is a market change made possible by the convergence of cloud native computing and Kubernetes.”", "posttime": "2020-10-28 00:09:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,增加,replicated", "title": "\n洛杉矶在筹集2500万美元后，希望增加运营管理软件的研发和招聘", "title_en": "\n\t\t\t\tLA’s Replicated looks to increase R&D and hiring for its operations management software after raising $25 million\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/las-replicated-looks-to-increase-rd-and-hiring-for-its-operations-management-software-after-raising-25-million/", "via": "", "real_tags": ["软件", "增加"]}, {"category": "", "categoryclass": "", "imagename": "c7ea40389f98751b8f1f3b3a9f85505b.png", "infoid": 1031520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "主干一控制器就是其中一种情况。这是一款iPhone游戏控制器，具有圆滑的人体工程学、坚实的按钮手感、灵敏的模拟触发器和出色的构建质量。但Backone One的特别之处在于它附带的配套应用程序和服务，并启用了一个真正智能的软件层，可以跨应用程序多人玩、游戏录制、精彩编辑和快速交换。\n来自Ideo和Astro Studios的设计师帮助实现了主心骨和制作过像Xbox360控制器这样的设备的人的血统，在这里真正展示了这一点。宽阔的L1/R1按钮使您可以轻松地在移动设备上轻触。模拟L2/R2触发器感觉很深但很紧。最新的Lightning连接器标准意味着控制信号的延迟极低。\n控制器在紧凑的状态下大约有7“长，并使用了一个巧妙的滑动机构来向外扩展到10”大小。它很容易适合苹果“Plus”大小的手机，当你使用其中一款时，感觉就像是我第一次记得的完全开启的游戏机。\n在内部边缘有声学隧道勺子，将声音从电话扬声器向前引导，幕后正在进行工作，以抵消主干按钮发出的特定声音，这样你在玩游戏时就听不到这些声音了。\n套用圣经的一句话，没有软件的硬件是死的。主心骨是真的，真的活着。\n骨干网的背后是骨干网本身，它是一款“同伴应用”，但实际上是一款直播游戏服务。它集成了跨游戏语音聊天、游戏切换、派对和朋友列表。它可以让你在朋友在线的时候收到推送通知，只需轻轻一点，就可以和他们一起滑入游戏。它非常光滑，感觉就像你能做的不是第一派对感觉的东西一样。\n骨干网是由马尼特·海拉于2018年夏天创立的，当时他在YouTube实习，并在哥伦比亚大学结束了工作。\n海拉指出，手机游戏中最大的问题之一是，当跳到游戏中和朋友一起玩时，会有大量的激活能量。主要的游戏有：使命召唤，堡垒之夜(最终，再次)，绝地求生-但最后一英里的问题是主要的。\n海拉指出，虽然iPhone上有很多顶级游戏的例子，但在Twitch或YouTube上可以观看的这些平台上创建的内容只有一个沙漠。他将其比作滞后--滞后于其原因造成的结果。有如此多的手机游戏玩家，应该有大量的手机内容被分享，但由于这样做的机制如此之差，如此低劣，我们几乎什么都没有。\n内容创作。捕捉亮点、剪辑和镜头并将其共享到您的首选平台必须简单且无缝。\n和朋友一起玩必须是瞬间的。Backbone使用朋友何时开始玩任何游戏的通知，你可以从一个中央朋友列表中这样做。\n因为Backbone是一个支持应用程序，所以它获得了一系列通常不会授予“常规”类应用程序的特殊权限。Backbone One在连接时总是打开的，这意味着无论你使用什么应用程序或使用多长时间，该应用程序都可以做任何它需要做的事情。这很重要，因为它使控制器上的主干按钮可以将游戏添加到你的仪表板上，轻松地在它们之间切换，并让你获得主干中包含的朋友列表。\n将主干连接到手机上并开始在多人游戏中玩游戏的秒表时间是以秒为单位的，而不是以分钟为单位的。这正是您在移动环境中所需要的。\n它还可以随时录制本地存储在您设备上的剪辑和亮点，但可以以1080p/30fps HEVC的速度上传到任何地方。当你在游戏中时，你只需按下捕捉按钮就可以开始录制，然后点击它就可以截图了。主干应用程序也有一些ML工作正在进行，以识别值得突出的剪辑并自动标记它们。你也可以在玩的时候自己给它们加标签。\n而且主干耳机比(过去)装在iPhone盒子里的破旧耳塞耗电更少。您不会注意到配件本身的任何主要功耗。\n如果Backbone能够设法与一两家大公司建立合作伙伴关系，拥有一个内置的控制方案，利用适当的死区和时机，这可能是手机游戏的一个真正的分水岭时刻。\n但目前，它适用于大多数开箱即用的支持控制器的游戏。任何游戏都不需要做任何特殊的事情来利用大多数主干功能。这基本上增加了一层游戏间的社交和剪辑共享。\n它集游戏中心、Twitch、PSN和Xbox Live的所有基本功能于一身-但在iPhone上。当然，Backbone One在Xbox和PlayStation远程播放应用程序上也运行得很好。\n有时，一份投资者名单可以告诉你，一家公司对获得合适的资金有多认真。对于一家建立游戏服务和外围硬件的公司来说，Backbone没有比这更可靠的专栏了。Backbone得到了Mr Beast、Preston、Kwebbelkop、Typical Gamer、Night Media、Nadeshot和Ludlow Ventures的支持，以及Ashton Kutcher和Guy Oseary的Sound Ventures。这几乎就是我希望看到的一家认真关注社交和手机游戏的公司的个人资料。\n在很多方面，Backbone感觉像是OpenFeint的精神继承者。如果你不熟悉，OpenFeint是第一个现代手机游戏网络。它是在iPhone应用商店之后的一年推出的，是一款名为Aurora Feint的游戏的一部分。它支持多人游戏、记分板和消息传递。OpenFeint的创始人？杰森·西特隆。Jason目前的初创公司，也与OpenFeint分享了很多精神包袱？不和谐。\nOpenFeint在当时的重要性怎么说都不为过。随着应用生态系统的出现，很明显，游戏将是iPhone成功的重要因素，这是第一个允许人们利用首批手机之一拥有持久、高质量(或者说)互联网连接的跨游戏网络。苹果推出了游戏中心，作为对这一需求的基本回应，但从那以后，它再也没有投入过任何真正的投资。Backbone是如此之好，以至于我实际上可以看到苹果拿出了回购，并指派了工程人才来让它再次正常工作。这个想法的时机已经到了，而骨干的执行在这里是如此的一流，这使得这个案件既可以打开又可以关闭。\n我已经用各种游戏测试这个控制器好几个星期了。我和海拉玩了一场“使命召唤战争地带”的快速比赛，尽管我们没有获得配音，但它比使用触控运行的可玩性要强得多。在我第一次参加Cod游戏时，我在Cod Mobile上玩了一款28杀游戏，尽管我被放在了一个优先考虑控制器用户的大厅里，但其他玩家每个人都有5个杀。虽然你现在可以将控制台控制器与iPhone配对，但主干比市场上任何其他集成控制器都要好得多，以至于它很快就会成为任何真正想要具有竞争力的移动玩家的必备品。我花在苹果移动硬件和创造它的人身上的时间可能和这个星球上的任何人一样多，所以请理解，我这么说不是轻率的，但这真的感觉像是如果苹果理解竞技游戏，它就会制作游戏控制器和网络。\nBackbone One控制器售价99美元，现在可以通过免费的Backbone应用程序购买。", "note_en": "The Backbone One controller is one of those situations. It’s a game controller for iPhones that has slick ergonomics, solid button feel, sensitive analog triggers and great build quality. But what makes Backbone One special is the companion app and service that ships with it and enables a truly clever software layer enabling cross-app multiplayer, game recording, highlight editing and quick swap.\n Designers from Ideo and Astro Studios helped realize Backbone and the pedigree of people who have crafted devices like the Xbox 360 controller really show here. Wide L1/R1 buttons make it easy to tap on mobile. Analog L2/R2 triggers feel deep but tight. The latest Lightning connector standard means extremely low latency for control signals.\n  The controller is around 7” long in its compact state and uses a clever sliding mechanism to expand outwards to up to 10” in size. It easily fits Apple’s “Plus” sized phones and when you’re using one of those it feels like a full on game console for the first time I can remember.\n There are acoustic tunneling scoops at the inside edges that direct sound forward from the phone speakers and there is work being done behind the scenes to cancel out the specific sounds the Backbone One’s buttons make so that you don’t hear those while you’re playing.\n  To co-opt a biblical phrase, hardware without software is dead. And the Backbone One is really, really alive.\n Behind the Backbone One is Backbone itself, which is a ‘companion app’ but is really a live gaming service. It has integrated cross-game voice chat, game switching, parties and a friends list. It lets you get push notifications when your friends are on and slide right into a game with them with a single tap. It’s remarkably slick and feels as first-party as you could make something that is literally not first-party feel.\n Backbone was founded by Maneet Khaira in the summer of 2018 while interning at YouTube and wrapping up at Columbia.\n Khaira notes that one of the biggest issues in mobile gaming is that there is a ton of activation energy when it comes to jumping in and playing with friends. The major games are there: Call of Duty, Fortnite (eventually, again), PUBG — but the last mile issue is major.\n  Khaira points out that while there are plenty of examples of top-tier gaming titles on iPhone, there is just a desert of content created on these platforms available to watch on Twitch or YouTube. He likens it to a hysteresis — a lagging behind of an effect from its cause. There are   so many  mobile gamers that there should be a   ton  of mobile content shared, but because the mechanisms to do so have been so poor and so under-crafted, we have next to nothing.\n   Content creation. It had to be easy and seamless to capture highlights, clips and footage and share them to your preferred platform.\n Playing with friends has to be instantaneous. Backbone uses notifications about when friends start playing across any game and you can do so from one central friends list.\n Because Backbone is a support app, it gets a bunch of special privileges that would normally not be granted to a ‘regular’ class of app. Backbone One is always on while it’s attached, which means that the app can do whatever it needs to do no matter what app you’re in or for how long. This is huge because it enables the Backbone button on the controller to add games to your dashboard, swap easily between them and lets you get at your friends list contained in Backbone.\n The stopwatch time for attaching the Backbone One to your phone and beginning to play a game in multiplayer is measured in seconds, not minutes. It’s exactly what you need in the mobile context.\n  It also enables any-time recording of clips and highlights that store locally on your device but can be uploaded anywhere at 1080p/30fps HEVC. When you’re in game you can just smash the Capture button to start recording and tap it to screenshot. The Backbone app also has some ML work going on to identify highlight-worthy clips and mark them automatically. You can also tag them yourself while you play.\n And Backbone One does this on less power than the crap earbuds that (used to) come in an iPhone box. You won’t notice any major power drain from the accessory itself.\n If Backbone can manage to get a partnership with one or two majors to have a built-in control scheme that takes advantage of the proper dead zones and timing it could be a real watershed moment for mobile gaming.\n But right now it works with   most  games that have controller support right out of the box. No game needs to do anything special to take advantage of the majority of Backbone features. This basically adds on a layer of inter-game social and clip sharing.\n It’s all of the basic features of Game Center, Twitch, PSN and Xbox Live rolled into one — but on iPhone. And, of course, the BackBone one works just fine with Xbox and PlayStation remote play apps.\n  Sometimes a list of investors can tell you a lot about how serious a company is about getting the right kind of money. For a company building a gaming service and peripheral hardware, Backbone couldn’t have a more solid column. Backbone is backed by MrBeast, Preston, Kwebbelkop, Typical Gamer, Night Media, Nadeshot, and Ludlow Ventures, as well as Ashton Kutcher and Guy Oseary’s Sound Ventures. Pretty much exactly the profile I would want to see for a company serious about social and mobile gaming.\n In many ways, Backbone feels like a spiritual successor to  OpenFeint. If you’re not familiar, OpenFeint was the first modern mobile gaming network. It launched the year after the iPhone App Store and was part of a game called Aurora Feint. It enabled multiplayer, scoreboards and messaging. The founder of OpenFeint? Jason Citron. Jason’s current startup, that also shares a lot of spiritual luggage with OpenFeint? Discord.\n It’s hard to overstate how important OpenFeint was at the time. As the app ecosystem was emerging it was clear that games would be a big part of what made the iPhone successful and this was the first cross-game network that allowed people to take advantage of one of the first phones to have a persistent, high-quality (ish) internet connection. Apple launched Game Center as a basic response to this need but it has never put any real investment behind it since. Backbone is so good that I could actually see Apple hauling out the repo and assigning engineering talent to get it working well again. The time has come for this idea and Backbone’s execution is so top notch here that it makes the case open and shut.\n  I’ve been testing the controller for a few weeks now with a variety of games. I played a quick match of Call of Duty Warzone with Khaira and even though we didn’t secure the dub it was massively more playable than running with touch controls. My very first session of CoD I had a 28 kill game in cod mobile and, even though I was put into a lobby that prioritizes controller users the other players had like 5 kills each. Though you can now pair console controllers to iPhone, the Backbone is so much better than any of the other integrated controllers on the market that it will quickly become a must have for any mobile player that actually wants to be competitive. I have spent as much time with Apple mobile hardware and the people that have created it as probably anyone on the planet so please understand that I don’t say this lightly but this really feels like the game controller and network Apple would have made if it understood competitive games.\n The Backbone One controller runs $99 and can be   purchased via the free Backbone app today .", "posttime": "2020-10-28 00:08:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "破解,游戏,手机,先生,mobile", "title": "\n在Beast先生和Nadesshoe的支持下，Backbone One终于可以破解手机游戏了", "title_en": "\n\t\t\t\tBacked by Mr. Beast and Nadeshot, Backbone One could finally crack mobile gaming\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/with-backing-from-mr-beast-and-nadeshot-backbone-one-could-finally-crack-competitive-mobile-gaming/", "via": "", "real_tags": ["破解", "游戏", "手机", "先生", "mobile"]}, {"category": "", "categoryclass": "", "imagename": "eefd2b1f20070833155b18e4b1c502a4.jpeg", "infoid": 1031519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌知道很多人会使用YouTube来跟上11月3日的美国大选。许多政客利用这个平台与选民沟通，一些新闻机构可能会全天候直播报道。不过，跟上选举日可能很困难，所以YouTube正在准备一个小型但有用的信息面板，它将出现在搜索结果和以选举为中心的视频的顶部。它将提醒用户“结果可能不是最终的”，并使用一个巨大的“显示我”按钮，将他们指向一个由谷歌运营的选举中心。\n这已经不是YouTube第一次使用这一功能了。早在2019年3月，谷歌旗下的业务就添加了一个警报，该警报与有争议的搜索查询一起出现。例如，如果有人输入了“扑热息痛中的病毒”，YouTube就会抛出一张小卡片，上面详细说明了这场骗局，更重要的是，还会抛出昆特等事实核查合作伙伴的可信评估。它最初在印度推出，但后来扩展到包括美国在内的其他国家。上个月，YouTube还推出了一些与选举相关的问题旁边出现的面板-比如如何投票，以及如何在你所在的州登记投票-并链接到两党政策中心(Biparty Policy Center)智库等权威来源的信息。\n在一篇博客文章中，YouTube解释了它将在选举日打击错误信息的许多其他方式。其中大多数并不新鲜-该公司致力于提升权威新闻来源并删除欺骗性内容已经有一段时间了-YouTube也不太可能完全杜绝错误信息。不过，很高兴知道该公司正在积极考虑并为11月3日做准备。", "note_en": "Google knows that many people will be using YouTube to keep up with the US election on November 3rd. Many politicians use the platform to communicate with voters, and some news organizations will likely livestream round-the-clock coverage. Keeping up with Election Day can be difficult, though, so YouTube is preparing  a small but useful information panel that will appear at the top of search results and election-centric videos. It will remind users that “results may not be final” and, using a massive ‘SHOW ME’ button, point them toward a Google-run election hub.\n It’s not the first time that YouTube has used this feature. Back  in March 2019, the Google-owned operation added an alert that appeared alongside controversial search queries. If someone had typed ‘virus in paracetamol,’ for instance, YouTube would throw up a small card that details the hoax and, more importantly, a trustworthy assessment from a fact-checking partner such as The Quint. It was launched in India but has since expanded to other countries  including the US. Last month, YouTube also introduced some panels that appear alongside election-related queries — such as how to vote, and how to register to vote in your state — and link to information by authoritative sources such as the Bipartisan Policy Center think tank.\n  In  a blog post, YouTube explained many of the other ways it will be fighting misinformation on Election Day. Most of them aren’t new — the company has been working to elevate authoritative news sources and remove deceptive content for some time now — and it’s unlikely that YouTube will be able to stamp out misinformation completely. Still, it’s nice to know the company is actively thinking about and preparing for November 3rd.", "posttime": "2020-10-28 00:08:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,警告,warn", "title": "YouTube将警告用户选举日结果可能不是最终结果", "title_en": "YouTube Will Warn Users That Election Day Results 'May Not Be Final'", "transed": 1, "url": "https://www.engadget.com/google-youtube-information-panel-election-day-november-3-140409652.html", "via": "", "real_tags": ["youtube", "警告", "warn"]}, {"category": "", "categoryclass": "", "imagename": "153c8c50e8930a3bed14b91c927064fd.jpg", "infoid": 1031518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由S.R.韦恩·陈博士领导的卡尔加里大学卡明医学院(CSM)的一个研究小组取得了一项令人兴奋的突破，有可能预防和逆转阿尔茨海默氏症的影响。\n研究小组发现，在动物模型中，限制一种名为ryanodine受体的通道的开放时间可以逆转并防止阿尔茨海默病的进展，该通道的作用就像通往心脏和大脑中的细胞的门户。他们还确定了一种可以中断疾病进程的药物。\n给动物模型用药的效果是显著的：经过一个月的治疗，这些模型中的记忆丧失和认知障碍消失了。\n李斌心血管研究所和CSM霍奇基斯脑研究所的成员陈博士说：“确定一种临床使用的药物，作用于确定的目标，提供抗阿尔茨海默病的益处，其重要性怎么强调都不为过。”陈博士是陈的学生，姚金晶博士，是这项研究的第一作者。这项研究的第一作者是李斌心血管研究所和CSM霍奇基斯脑研究所的成员姚金晶博士。他的学生姚金晶博士是这项研究的第一作者。\n这项开创性的研究结果最近发表在同行评议期刊“细胞报告”(Cell Reports)上。\n这项工作可能影响很大，因为超过50万加拿大人患有阿尔茨海默氏症和其他痴呆症，遭受记忆力丧失和其他认知障碍，对生活质量产生负面影响。\n之前的研究表明，阿尔茨海默病的进展是由蛋白质淀粉样蛋白(Aβ，Aβ)诱导神经元水平的过度活动的恶性循环推动的。然而，这背后的机制还没有完全理解，也没有有效的治疗方法来停止这个周期。\n陈的团队使用了一种用于心脏病患者的现有药物卡维地洛的一部分，来治疗有阿尔茨海默氏症症状的小鼠模型。经过一个月的治疗，研究人员对动物模型进行了测试，结果非常有希望。\n“我们治疗了他们一个月，效果相当惊人，”陈说，他解释说，这种药物成功地逆转了阿尔茨海默病的主要症状。“我们无法区分药物治疗的疾病模型和健康模型。”\n被高度引用的Clarivate研究员陈对这项研究的未来持乐观态度，并指出下一步将是人体临床试验。\n韦恩·陈(Wayne Chen)是CSM生理药理学、生物化学和分子生物学系的教授，由美国霍奇基斯脑研究所领导的大脑和心理健康研究所是指导卡尔加里大学实现其高眼界目标的六项研究战略之一。该战略为该大学的大脑和心理健康研究提供了一个统一的方向。", "note_en": "A research team at the University of Calgary’s  Cumming School of Medicine (CSM) led by Dr. S.R. Wayne Chen, PhD, has made an exciting breakthrough with the potential to prevent and reverse the effects of Alzheimer’s disease.\n  The team discovered that limiting the open time of a channel called the ryanodine receptor, which acts like a gateway to cells located in the heart and brain, reverses and prevents progression of Alzheimer’s disease in animal models. They also identified a drug that interrupts the disease process.\n  The effect of giving the drug to animal models was remarkable: After one month of treatment, the memory loss and cognitive impairments in these models disappeared.\n  “The significance of identifying a clinically used drug that acts on a defined target to provide anti-Alzheimer’s disease benefits can’t be overstated,” says Chen, a member of the  Libin Cardiovascular Institute and the  Hotchkiss Brain Institute at the CSM.     Dr. Jinjing Yao, PhD, a student of Chen, is the first author of the study.\n  The results of this groundbreaking study were recently published in the peer-reviewed journal,   Cell Reports.\n  This work is potentially highly impactful as more than half a million Canadians live with Alzheimer’s disease and other dementias, suffering memory loss and other cognitive impairments with a negative impact on quality of life.\n    Previous research has shown that the progression of Alzheimer’s disease is driven by a vicious cycle of the protein amyloid β (Aβ) inducing hyperactivity at the neuron level. However, the mechanism behind this wasn’t fully understood nor were there effective treatments to stop the cycle.\n  Chen’s team used a portion of an existing drug used for heart patients, carvedilol, to treat mice models with Alzheimer’s symptoms. After a month of treatment, researchers tested animal models with very promising results.\n  “We treated them for a month and the effect was quite amazing,” says Chen, explaining the drug was successful in reversing major symptoms of Alzheimer’s disease. “We couldn’t tell the drug-treated disease models and the healthy models apart.”\n  Chen, a Clarivate Highly Cited Researcher, is optimistic about the future of this research, noting the next step will be clinical trials in people.\n  Wayne Chen is a professor in the Department of Physiology and Pharmacology, Biochemistry and   Molecular Biology at the CSM.       Led by the        Hotchkiss Brain Institute    ,        Brain and Mental Health     is one of six research strategies guiding the University of Calgary toward its Eyes High goals. The strategy provides a unifying direction for brain and mental health research at the university.", "posttime": "2020-10-27 23:58:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小组,team,研究", "title": "研究小组发现具有逆转阿尔茨海默氏症潜力的突破", "title_en": "Research team discovers breakthrough with potential to reverse Alzheimer's", "transed": 1, "url": "https://news.ucalgary.ca/news/research-team-discovers-breakthrough-potential-prevent-reverse-alzheimers", "via": "", "real_tags": ["小组", "team", "研究"]}, {"category": "", "categoryclass": "", "imagename": "73d4fda3e58a4902a4bc99f953592b74.gif", "infoid": 1031517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自动卡车运输将改善道路安全，并在整个物流行业提供更高的效率。在我们配置Waymo司机来操作Class 8卡车并释放这些优势时，我们很高兴地告诉大家，Waymo已经与全球大型商用车市场领先者戴姆勒卡车建立了广泛的全球战略合作伙伴关系。\n我们最初的努力将把世界上最有经验的司机™与戴姆勒的Freightliner Cascadia结合起来，实现完全自动驾驶。这些配备了Waymo司机的全自动卡车将在未来几年向美国客户供应，我们将在不久的将来探索向其他地区和品牌扩张。我们期待着与戴姆勒合作，为车队客户实现提高道路安全和效率的共同目标。\nWaymo首席执行官John Krafcik：“我们最尊重戴姆勒的工程技能和广泛的全球卡车产品组合，因此我们期待着与我们的新合作伙伴一起扩展Waymo Driver，以提高世界道路上的道路安全和物流效率。”戴姆勒卡车股份公司(Daimler Truck AG)董事会主席兼董事会成员马丁·道姆(Martin Daum)说：“作为我们行业的领导者，戴姆勒卡车是自动化卡车运输的先驱。近年来，我们在将系列生产的高度自动化卡车带上道路的全球路线图上取得了重大进展。随着我们与Waymo作为自动驾驶领域的领先者建立战略合作伙伴关系，我们朝着这一目标又迈出了重要的一步。这一伙伴关系补充了戴姆勒卡车公司的双重战略方法，即与两个强大的合作伙伴合作，向我们的客户提供与我们最好的卡车无缝集成的自动L4解决方案。“。戴姆勒卡车股份公司(Daimler Truck AG)董事会成员、戴姆勒卡车北美公司总裁兼首席执行官罗杰·尼尔森(Roger Nielsen)表示：“道路货运量的增加与车队运营商对高度自动化卡车的需求和愿景相结合，是我们不懈追求创新的动力。我们正在推动工程解决方案，这些解决方案首先致力于提高安全性，并帮助我们的客户提高业务效率。基于我们与Waymo的合作，我们将处于独特的地位，能够为我们的船队客户提供满足他们个人需求的最佳解决方案选择。“。欲了解更多信息，您可以在此处阅读联合新闻稿。", "note_en": "Autonomous trucking is poised to improve road safety and offer greater efficiency across the logistics industry. As we configure the Waymo Driver to operate Class 8 trucks and unlock these benefits, we’re pleased to share that Waymo has entered a broad, global, strategic partnership with Daimler Trucks, the global market leader in large commercial vehicles.\n  Our initial effort will combine The World’s Most Experienced Driver ™ with Daimler’s Freightliner Cascadia to enable fully autonomous driving. These fully autonomous trucks, equipped with the Waymo Driver, will be available to U.S. customers in the coming years, and we’ll explore expansion into other geographies and brands in the near future. We look forward to working with Daimler to achieve our common goal of improving road safety and efficiency for fleet customers.\n John Krafcik, Chief Executive Officer, Waymo: “We have the highest regard for Daimler’s engineering skills and broad global truck product portfolio, and so we look forward to scaling the Waymo Driver, together with our new partner, to improve road safety and logistics efficiency on the worlds’ roadways.”   Martin Daum, Chairman of the Board of Management of Daimler Truck AG and Member of the Board of Management of Daimler AG: “As leader of our industry, Daimler Trucks is the pioneer of automated trucking. In recent years, we have achieved significant progress on our global roadmap to bringing series-produced highly automated trucks to the road. With our strategic partnership with Waymo as the leader in autonomous driving, we are taking another important step towards that goal. This partnership complements Daimler Trucks’ dual strategy approach, of working with two strong partners to deliver autonomous L4 solutions that are seamlessly integrated with our best-in class trucks, to our customers.”    Roger Nielsen, Member of the Board of Management of Daimler Truck AG, President and CEO of Daimler Trucks North America: “The combination of increased road freight volumes and the need and vision of fleet operators for highly automated trucks, is what fuels our relentless pursuit of innovation. We are pushing engineering solutions that strive above all to increase safety and help our customers improve business efficiencies. Based on our collaboration with Waymo, we will be in the unique position to be able to provide our fleet customers with a choice among the best solutions for their individual requirements.”   For more information, you can read the joint press release  here.", "posttime": "2020-10-27 23:53:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,卡车,trucks", "title": "Waymo和戴姆勒卡车合作开发全自动卡车", "title_en": "Waymo and Daimler Trucks partner on the development of fully autonomous trucks", "transed": 1, "url": "https://blog.waymo.com/2020/10/waymo-and-daimler-trucks-partner-on.html?m=1", "via": "", "real_tags": ["开发", "卡车", "trucks"]}, {"category": "", "categoryclass": "", "imagename": "c9773914022fc976af3b928521f85058.jpg", "infoid": 1031516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IRCTC的火车票预订经验堪称传奇！虽然该网站多年来一直在改进，但有大量在线火车票预订应用程序的事实证明，IRCTC的基本体验可以更好。\n也许这就是S Yuvarajaa的想法。S Yuvarajaa是一名IITian人，在为Android手机开发火车票务应用时，他从IIT Kharagpur毕业了。但现在它已经把应用程序的创建者送进了监狱。\n据TOI报道，Tirupur土生土长的S Yuvarajaa开发了Super Tatkal Pro和Super Tatkal Pro火车票预订应用，他也因同样的原因被捕。\n据报道，他被指控绕过了IRCTC的门票预订系统，创建了一个在线平台，让顾客通过基于硬币的系统预订门票以换取付款。\nYuvarajaa据信在2016年开发了这两款基于Android的在线售票应用，当时它们很受欢迎-但自那以后，这些应用已经从Google Play商店下架，无法下载。\n根据TOI的报告，金奈铁路保护部队(RPF)的网络小组使用服务器源代码、应用程序源代码、最终用户列表和他的银行对账单追踪到了他。\n此外，在描述这名年轻人被捕的过程中，南方铁路首席安全专员比兰德拉·库马尔(Birendra Kumar)表示，“他开发了一款软件，可以更快地订票，而他甚至不是IRCTC的授权代理人。”\n绕过铁路系统和非法赚钱是犯罪行为，对Yuvarajaa的指控证实了这一点--RPF已根据“铁道法”第143(2)条(对未经授权从事购买和供应火车票业务的处罚)登记立案。\nTOI报告援引一些铁路官员的话说，由于这种更快的在线订票应用，试图在IRCTC网站上订票的人被剥夺了公平的机会。\nYuvarajaa被捕后，一名自称是他朋友的Twitter用户在微博平台上发布了一条评论。\n你对整个发展有什么看法？请在下面的评论区让我们知道...", "note_en": "IRCTC&#39;s rail ticket booking experience is the stuff of legends! While the website has improved over the years, the fact that there&#39;s a host of online rail ticket booking apps out there proves the fundamental IRCTC experience can be much better.\n Maybe that was the idea in S Yuvarajaa&#39;s mind, an IITian who passed out of IIT Kharagpur, when he built his rail ticketing apps for Android phones. But it has now landed the app creator in jail.\n   According to a TOI report, Tirupur native S Yuvarajaa who created the &#39;Super Tatkal&#39; and &#39;Super Tatkal Pro&#39; railway ticket booking apps has been arrested for the same.\n He&#39;s accused of bypassing the IRCTC&#39;s ticket booking system by creating an online platform for customers to book tickets in exchange for payments through a &#39;coin&#39; based system, according to reports.\n Yuvarajaa is believed to have created both the Android-based online ticket booking apps in 2016, when they garnered popularity -- but the apps have since been removed from Google Play store and are unavailable for download.\n According to the TOI report, the Cyber Cell of Railway Protection Force (RPF) in Chennai tracked him down using server source code, application source code, end-users list and his bank statements.\n   Furthermore, while describing the youth&#39;s arrest, the Southern Railway principal chief security commissioner Birendra Kumar said, “He created a software to book tickets faster and he was not even an authorised agent of IRCTC.”\n Bypassing the railway system and making money illegally was the crime, as is confirmed by the charges labelled against Yuvarajaa -- RPF has registered a case under section 143 (2) of the Railways Act (penalty for unauthorised carrying on of business of procuring and supplying of railway tickets).\n Because of this faster online ticket booking app(s), people trying to book tickets on IRCTC&#39;s website were deprived of a fair chance, according to some rail officials cited in the TOI report.\n After Yuvarajaa&#39;s arrest, a Twitter user claiming to be his friend has posted a thread of comments on the micro-blogging platform.\n  What do you think about this whole development? Let us know in the comments section below...", "posttime": "2020-10-27 23:38:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "毕业生,graduate,irctc", "title": "IIT毕业生因创建更快的火车票预订应用而被捕", "title_en": "IIT Graduate Gets Arrested For Creating Faster Rail Ticket Booking App", "transed": 1, "url": "https://www.indiatimes.com/technology/news/iit-guy-arrested-rail-ticket-booking-app-526068.html", "via": "", "real_tags": ["毕业生", "graduate", "irctc"]}, {"category": "", "categoryclass": "", "imagename": "8826af3a1e7881bcbc90d7c4b7eb1600.jpg", "infoid": 1031515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "西格勒的创业生涯始于2005年，在一家专注于科技客户的创业机构从事网络开发工作。他后来报道了VentureBeat和后来的TechCrunch的初创公司，然后成为CrunchFund的创始合伙人，然后最终加入GV(当时的谷歌风险投资公司)，专注于初创公司。除了上面列出的公司，西格勒还牵头投资了其他成功的早期公司，包括宇宙公司、Giphy公司、玩家论坛公司、CTRL-Labs公司和AltspaceVR公司。\n在当前的全球大流行开始时，Siegler与我们自己的Lucas Matney聊了聊GV对移动网站创建者宇宙的投资，以及鉴于旅行和社交距离限制，管理投资组合的方式发生了怎样的变化。我们将从西格勒那里了解到，在接下来的几个月里，在新冠肺炎的背景下生活和工作，他的视角以及他正在与之合作和寻找潜在投资的早期公司发生了哪些变化。\n更广泛地说，西格勒在早期创业和讲故事方面也有独特的视角和丰富的经验。作为一名记者，他的工作重点是关注新兴的技术公司，评估它们传达抱负的能力，它们正在解决的问题，以及它们正在建设的技术。他将这段经历带到了他对初创公司及其创始人投资潜力的评估中，以及他们讲述自己正在做的事情及其原因的好故事和令人信服的故事的能力。\n所有这些话题，再加上我们的观众您提出的更多问题。所以，如果你是Ccrch的额外会员，那就加入我们吧，了解金融科技正在进行的所有善事。如果您不是额外的Crunch会员，请务必在我们开始之前查看订阅选项。", "note_en": "Siegler’s career in startups began in 2005, working in web development at a startup agency focused on tech clients. He later reported on startups at both VentureBeat and later TechCrunch, before becoming a founded partner at CrunchFund and then eventually joining GV (then Google Ventures) to focus on early-stage companies. In addition to the companies listed above, Siegler has led investments in other successful early-stage companies including Universe, Giphy, The Players’ Tribune, CTRL-Labs and AltspaceVR.\n At the outset of the current global pandemic, Siegler chatted with our own Lucas Matney about GV’s investment in mobile website-builder Universe and about how managing a portfolio changes in light of travel and social distancing restrictions. We’ll find out from Siegler what the ensuing months of living and working in the context of COVID-19 have changed about his perspective and about the early-stage companies he’s working with and scouting for potential investment.\n More broadly, Siegler also has a unique perspective and ample experience when it comes to early-stage startups and storytelling. His work as a journalist focused specifically on looking at new and emerging technology companies and assessing their ability to communicate their ambitions, the problems they’re solving and the technology they’re building. He brings that experience to his assessment of the investment potential of startups and their founders, and their ability to tell good and compelling stories about what they’re doing and why.\n All these topics, plus more questions from you, our audience. So join us if you’re an Extra Crunch member and get caught up on all the fintech goodness going on. And if you aren’t an Extra Crunch member, be  sure to check out subscription options before we get started.", "posttime": "2020-10-27 23:27:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,crunch,extra", "title": "\n今天美国东部时间下午2点/上午11点，在Extra Crunch Live节目中，与GV的M.G.Siegler讨论投资组合管理和精彩的故事讲述", "title_en": "\n\t\t\t\tDiscuss portfolio management and great storytelling with GV’s M.G. Siegler on Extra Crunch Live today at 2pm ET/11 am\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/join-extra-crunch-live-today-to-talk-about-managing-portfolios-during-a-pandemic-and-good-storytelling-with-gvs-m-g-siegler/", "via": "", "real_tags": ["美国", "crunch", "extra"]}, {"category": "", "categoryclass": "", "imagename": "00cd1de51a2bce4474596e7f50fbe35a.jpg", "infoid": 1031514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与其他选择相比，LeoLabs的优势在于它能以多快的速度从一整批新轨道的Starlink卫星上获取信号，SpaceX已经分批发射了60颗卫星。以下是LeoLabs通过这一安排直接从公司本身为SpaceX做了什么的简要介绍：\nLeoLabs跟踪所有Starlink卫星(每次发射最多60颗)，并在集群的正面和背面快速生成数据产品，为卫星列车提供一个包围盒。这在启动和部署后的最初几个小时内开始。在接下来的几个小时和几天里，我们将继续监测卫星的散开情况，并开始它们的轨道提升序列。\n自今年3月以来，实际的操作伙伴关系一直很活跃，这意味着到目前为止，LeoLabs已经跟踪了许多任务的这些部署。在未来的发射中，它也将继续这样做。通过他们的平台，SpaceX在发射几个小时后就能及时获得关于Starlink卫星及其轨道的数据，这家初创公司表示，它通常可以在Starlink卫星经过其一个雷达站的一小时内提供数据。\nLeoLabs最近登上了新闻头条，追踪低地球轨道上物体之间的潜在碰撞，包括最近一次在本月早些时候与两个物体相撞11米的险些相撞事件。随着近地轨道变得更加拥挤-这在很大程度上是由于SpaceX计划大幅增加其Starlink机队规模-该公司的服务可能只会增加需求，以帮助进行有效的空间交通控制。", "note_en": "LeoLabs’ provides an advantage vs. any other options out there in terms of how fast it can acquire signal from a whole batch of newly orbital Starlink satellites, which SpaceX has been sending up in batches of 60. Here’s a brief synopsis of what exactly LeoLabs is doing for SpaceX through this arrangement,  straight from the company itself:\n LeoLabs tracks all Starlink satellites (up to 60 per launch) and rapidly generates data products on the front and back of the cluster to provide a bounding box on the train of satellites. This begins within the first few hours following launch and deployment. We continue to monitor the satellites in the following hours and days as they disperse and begin their orbit raising sequences.\n  The actual operational partnership has been active since March of this year, which means that LeoLabs has been tracking these deployments for a number of missions thus far. It’s also going to continue to do this for future launches going forward. Through their platform, SpaceX gets timely data on Starlink satellites and their orbits just a few hours post-launch, and the startup says it can typically deliver data within one hour of a Starlink satellite passing over one of its radar stations.\n  LeoLabs has made headlines recently tracking potential collisions among objects in low Earth orbit, including most recently a near-collision with an 11-meter miss of two objects earlier this month. As low Earth orbit becomes more crowded – in no small part due to SpaceX’s planned massive increase in its Starlink fleet size – the company’s services are likely to only grow in demand in order to help with effective space traffic control.", "posttime": "2020-10-27 23:27:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "leolabs,轨道", "title": "\nSpaceX和LeoLabs合作跟踪Starlink卫星部署", "title_en": "\n\t\t\t\tSpaceX and LeoLabs partner up for tracking of Starlink satellite deployments\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/spacex-and-leolabs-partner-up-for-tracking-of-starlink-satellite-deployments/", "via": "", "real_tags": ["leolabs", "轨道"]}, {"category": "", "categoryclass": "", "imagename": "bd6ebdbbcbee8b764fc807eec4a5fc58.jpg", "infoid": 1031512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司由or Arbel(Yo！的联合创始人)、Avishay Cohen(领导Mobli的研发)和Michal Cohen创立。它在三年前推出了一个平台，允许Figma、Sketch和Adobe XD的设计师将他们的设计转换成HTML代码。有了今天的发布，这些设计(目前只有Figma)可以转化为Reaction组件，让开发人员能够用他们已经在使用的编码语言来调整和润色各个组件。\n在过去的几年里，企业设计工具绝对是爆炸式的。与设计师只能选择在Photoshop中工作，开发人员不得不花费时间将这些静态图像转换为代码的时代相反，公平地说，2020年的设计景观是拥挤的。\n像Sketch、Invision和Figma这样的平台旨在缩小设计师和开发者之间的差距，在最新的情况下，设计师和其他设计师也是如此。Adobe也响应了日益激烈的竞争的号召，推出了Adobe XD。\nAnima 4.0代表着又一次转变。该公司正在乘着企业设计工具增长的浪潮，同时将自己定位于无代码领域，这是另一个高增长的垂直领域。\n阿贝尔告诉TechCrunch，大约在Yo关闭的时候，他知道他的下一次冒险将是一种从第一天起就收费的产品。他还说，他和他的联合创始人长期以来一直对设计师和开发人员之间的脱节感到沮丧。\n于是，阿尼玛诞生了。使用Anima的费用为每月40美元，或每年约370美元。Arbel向TechCrunch证实，Anima4.0的发布不会改变价格，但未来可能会改变。原因是Anima最初将开发人员排除在外，允许设计者构建他们的设计，并自动将其转换为运行的HTML代码。\n通过这次发布，Anima希望将开发者带回圈子，用Reaction(如果你愿意，可以用他们的母语)与他们交谈。这为每个座位收取更高的费用或引入新的收入来源打开了大门。\nArbel表示，Anima在收到第一笔资金之前就已经盈利了，这笔资金是2018年夏天以Y Combinator开出的12万美元支票的形式提供的。今年，该公司筹集了250万美元的种子资金，由Hetz Ventures、Zohar Gilon和Ed Lando牵头。\n如今，来自谷歌(Google)、亚马逊(Amazon)、星巴克(Starbucks)和沃尔玛(Walmart)等公司的30万名设计师、开发人员和产品经理使用Anima。每周，Anima社区都会将4000多个设计转换成代码。\nAnima团队已经从大流行开始时的4个增加到现在的17个，男性和女性的比例为70：30。\n“最大的挑战是编写开发人员友好的代码，”Arbel说。“开发人员不是一个容易接受的受众--我之所以知道，是因为我自己就是一名开发人员。我们已经听说过关于代码生成和。自从互联网出现以来，已经有无数的产品尝试过，但是没有一个能够成功地生成开发人员友好的代码。它们产生大量臃肿且难以理解的代码。现在，技术终于可以实现这一目标了。“", "note_en": "The company was founded by  Or Arbel   (cofounder of Yo!), Avishay Cohen (who led R&amp;D at Mobli) and Michal Cohen. It launched three years ago with a platform that allowed designers in Figma, Sketch and Adobe XD to translate their designs into HTML code. With today’s launch, those designs (in  Figma   only, for the moment) can be turned into React components, giving developers the ability to tweak and polish individual components in a coding language that they’re already using.\n Enterprise design tools have absolutely blown up over the past several years. As opposed to a time where designers really only had the option to work in Photoshop and developers then had to spend time turning those static images into code, it’s fair to call the design landscape of 2020 crowded.\n   Platforms like Sketch, InVision, and Figma have aimed to close the gap between designers and developers, and in the lattermost case, designers and other designers, as well. Adobe has also answered the call of growing competition with the launch of Adobe XD.\n Anima 4.0 represents yet another shift. The company is riding the wave of enterprise design tool growth, while simultaneously positioning itself in the realm of no-code, another high-growth vertical.\n  Arbel told TechCrunch that, around the time that  Yo   was shuttering, he knew that his next venture would be a product that charges money from day one. He also said that he and his cofounders had been frustrated for a long time by the disconnect between designers and developers.\n Thus, Anima was born. It costs $40/month to use Anima, or approximately $370 annually. Arbel confirmed to TechCrunch that pricing wouldn’t change with the launch of Anima 4.0 but that it may in the future. The reason for that is that Anima originally took developers out of the picture, allowing designers to build out their designs and translate it automatically into running HTML code.\n With this launch, Anima is looking to bring developers back into the fold, speaking to them in React (their native tongue, if you will). That opens the door to charging more per seat or introducing new revenue streams.\n Arbel said that Anima was profitable before it ever received its first funding, which came in the form of a $120K check from Y Combinator in the summer of 2018. This year, the company raised $2.5 million in seed funding led by Hetz Ventures, Zohar Gilon, and Ed Lando.\n  Today, Anima is used by 300,000 designers, developers and product managers from companies like Google, Amazon, Starbucks, and Walmart, among others. Each week, the Anima community converts more than 4,000 designs into code.\n The Anima team has grown from four at the onset of the pandemic to 17 now, with a 70/30 split between men and women.\n “The greatest challenge is making developer-friendly code,” said Arbel. “Developers are not an easy audience — I know because I’m a developer myself. We’ve been hearing about code generation and. the like since the beginning of the internet, and endless amounts of products have tried and none of them have managed to produce developer-friendly code. They product huge amounts of code that is bloated and hard to understand. Now, there is finally technology can actually make that happen.”", "posttime": "2020-10-27 23:26:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,代码,最新更新,latest,anima", "title": "\nAnima的最新更新利用了设计和无代码工具的流行", "title_en": "\n\t\t\t\tAnima’s latest update draws on the popularity of design and no-code tools\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/animas-latest-update-draws-on-the-popularity-of-design-and-no-code-tools/", "via": "", "real_tags": ["设计", "代码", "最新更新", "latest", "anima"]}, {"category": "", "categoryclass": "", "imagename": "17cb0f92940090362b70aa6bcb0c8abb.jpg", "infoid": 1031511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家成立于2015年的公司在很大程度上坚持了其最初的愿景，即始终致力于将数据仓库的访问民主化，以及与之齐头并进的分析能力。在过去的几年里，它还在平台中构建了更多的无代码数据集成，使企业更容易从各种来源获取数据，包括Salesforce、HubSpot、NetSuite、Xero、Quickbook、FreshWorks等。它还集成了其他数据仓库服务，如谷歌的BigQuery和亚马逊的RedShift，以及所有主要的商业智能和分析工具。\n该公司表示，将利用新资金扩大销售和营销努力。\n首席执行官兼联合创始人亚尼夫·利文在今天的声明中表示：“我们希望通过让分析师更容易地同步、存储和访问他们的数据，让他们的生活变得更简单、更有效率，而这笔资金将大大有助于实现这一使命，”首席执行官兼联合创始人亚尼夫·利文(Yaniv Leven)在今天的声明中表示。\n在某些方面，Panoply上市可能有点早。然而，今天，毫无疑问，我们正处于一个蓬勃发展的数据仓储和分析服务市场。毕竟，没有一家企业不想从他们现在每天收集的海量数据中获得更多的洞察力。这个市场现在的竞争也比以往任何时候都更加激烈，雪花(Snowflake)、Databricks和其他(包括所有的超级云)等现有公司都瞄准了自己的市场份额。不过，Panoply及其投资者显然认为，该公司的一体化平台使其具有竞争优势。", "note_en": "The company, which  launched back in 2015, has mostly stuck to its original vision, which was always about democratizing access to data warehousing and the analytics capabilities that go hand-in-hand with that. Over the last few years, it also built more  code-free data integrations into the platform that make it easier for businesses to pull in data from a wide variety of sources, including the likes of Salesforce, HubSpot, NetSuite, Xero, Quickbooks, Freshworks and others. It also integrates with other data warehousing services like Google’s BigQuery and Amazon’s Redshift and all of the major BI and analytics tools.\n The company says it will use the new funding to expand its sales and marketing efforts.\n  “We aspire to make analysts’ lives simpler and more productive by making it easier for them to sync, store, and access their data, and this funding will go a long way toward that mission,” says CEO and co-founder Yaniv Leven in today’s announcement.\n In some ways, Panoply was maybe just a bit early to the market. Today, though, there can be little doubt that we’re in a booming market for data warehousing and analytics services. There’s nary a business left, after all, that isn’t looking to gain more insights from the copious amounts of data they gather every single day now. That market is now more competitive than ever, too, with incumbents like Snowflake,  Databricks   and others (including all of the hyper clouds) all aiming for their slice of the market. Panoply and its investors clearly believe that the company’s all-in-one platform gives it a competitive edge, though.", "posttime": "2020-10-27 23:25:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "平台,data,数据", "title": "\nPanoply为其云数据平台筹集1000万美元", "title_en": "\n\t\t\t\tPanoply raises $10M for its cloud data platform\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/panoply-raises-10m-for-its-cloud-data-platform/", "via": "", "real_tags": ["平台", "data", "数据"]}, {"category": "", "categoryclass": "", "imagename": "00befcc8db73158807fa8e6da847cf45.jpg", "infoid": 1031510, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX正在扩大其Starlink卫星互联网服务的Beta测试，周一通过电子邮件联系那些表示有兴趣注册这项服务的人。\n根据CNBC看到的多个电子邮件截图，这项名为“Beta&34；Beta；Test”的测试初始价格为每月99美元，外加订购Starlink套件的499美元预付费用。\n该套件包括一个连接卫星的用户终端、一个安装三脚架和一个wifi路由器。\nSpaceX正在扩大其Starlink卫星互联网服务的Beta测试，周一通过电子邮件联系那些表示有兴趣注册这项服务的人。\n根据CNBC看到的多个电子邮件截图，这项名为“Beta&34；Beta；Test”的测试初始价格为每月99美元，外加订购Starlink套件的499美元预付费用。该套件包括一个连接到卫星的用户终端，一个安装三脚架和一个WiFi路由器。现在，SpaceX在Google Play和Apple iOS应用程序商店上也列出了一款Starlink应用程序。\n正如你从标题中可以看出的那样，我们正在努力降低你最初的期望值，电子邮件中写道，签署了Starlink团队。随着我们加强Starlink系统，预计在接下来的几个月里，数据速度将从50Mb/s到150MB/s变化，延迟从20ms到40ms。还会有短暂的一段时间根本没有连接。&#34；\n这些电子邮件发送给了数量不详的用户，标志着SpaceX启动了对这项新兴互联网服务的公开测试版测试。在过去的几个月里，SpaceX在员工中进行了一次有限的私人Beta测试-该公司表示，这一测试在延迟和下载速度方面都显示出强劲的结果，这是互联网服务提供商的关键指标。\n那些收到电子邮件的人会在Starlink网站上填写一张表格，上面要求提供潜在订户的联系信息和位置。埃隆·马斯克(Elon Musk)的公司在6月份发布了这份表格，不到两个月后，SpaceX表示，全美有近70万人表示对这项服务感兴趣。\nStarLink是SpaceX的计划，该公司计划建立一个由数千颗卫星互连的互联网网络，旨在为地球上任何地方提供高速互联网。该网络是一项雄心勃勃的努力，SpaceX曾表示，建设该网络将耗资约100亿美元或更多。但该公司领导层估计，Starlink每年可带来高达300亿美元的收入，相当于其火箭业务年收入的10倍以上。\n到目前为止，SpaceX已经发射了近900颗Starlink卫星-这只是全球覆盖所需卫星总数的一小部分，但足以开始在一些地区提供服务，包括在美国西北部。该公司已经开始与华盛顿州等轨道上的Starlink卫星目前覆盖的农村地区的少数组织合作。\nSpaceX在其Starlink移动应用程序的描述中表示，根据Starlink的“总比没有好”的Beta计划，最初的服务将于2020年针对美国和加拿大，到2021年将迅速扩大到几乎覆盖全球人口的范围。\nSpaceX公司本月早些时候宣布与微软(Microsoft)合作，将科技巨头微软的Azure云计算网络连接到Starlink网络。近几个月来，SpaceX和微软一直在测试连接Starlink和Azure所需的软件。这一合作关系对微软新的移动数据中心尤为关键，该公司表示，这些数据中心是为在混合或具有挑战性的环境(包括偏远地区)中需要云计算能力的客户设计的。\n订阅CNBC PRO，获得独家见解和分析，以及来自世界各地的实时工作日节目。", "note_en": "SpaceX is expanding the beta test of its Starlink satellite internet service, reaching out via email on Monday to people who expressed interest in signing up for the service.\n Called the &#34;Better Than Nothing Beta&#34; test, according to multiple screenshots of the email seen by CNBC, initial Starlink service is priced at $99 a month – plus a $499 upfront cost to order the Starlink Kit.\n That kit includes a user terminal to connect to the satellites, a mounting tripod and a wifi router\n SpaceX is expanding the beta test of its Starlink satellite internet service, reaching out via email on Monday to people who expressed interest in signing up for the service.\n Called the &#34;Better Than Nothing Beta&#34; test, according to multiple screenshots of the email seen by CNBC, initial Starlink service is priced at $99 a month – plus a $499 upfront cost to order the Starlink Kit. That kit includes a user terminal to connect to the satellites, a mounting tripod and a wifi router. There is also now a Starlink app listed by SpaceX on the  Google Play and  Apple iOS app stores.\n  &#34;As you can tell from the title, we are trying to lower your initial expectations,&#34; the emails said, signed Starlink Team. &#34;Expect to see data speeds vary from 50Mb/s to 150Mb/s and latency from 20ms to 40ms over the next several months as we enhance the Starlink system. There will also be brief periods of no connectivity at all.&#34;\n The emails, sent to an unspecified number of users, marks the launch of SpaceX&#39;s public beta test of the emerging internet service. For the last few months SpaceX has conducted a limited private beta test with employees – which  the company has said showed strong results in both latency and download speeds, key measures for an internet service provider.\n  Those who received the emails would have filled out a form on the Starlink website, which asked for potential subscribers&#39; contact information and location.  Elon Musk&#39;s company posted that form in June and, less than two months later, SpaceX said that &#34;nearly 700,000 individuals&#34; across the United States had indicated interest in the service.\n Starlink is SpaceX&#39;s plan  to build an interconnected internet network with thousands of satellites, designed to deliver high-speed internet to anywhere on the planet. The network is an ambitious endeavor, which SpaceX has said will cost about $10 billion or more to build. But the company&#39;s leadership estimate that Starlink could bring in as much as $30 billion a year, or more than 10 times the annual revenue of its rocket business.\n  To date, SpaceX has launched nearly 900 Starlink satellites – a fraction of the total needed for global coverage but enough to begin providing service in some areas, including in the northwest United States. The company has begun to work with a handful of  organizations in rural regions which Starlink satellites in orbit currently cover, such as Washington state.\n &#34;Under Starlink&#39;s Better Than Nothing Beta program, initial service is targeted for the U.S. and Canada in 2020, rapidly expanding to near global coverage of the populated world by 2021,&#34; SpaceX said in the description of its Starlink mobile app.\n SpaceX  earlier this month announced a partnership with  Microsoft, to connect the tech giant&#39;s Azure cloud computing network to the Starlink network. SpaceX and Microsoft in recent months have been testing the software needed to connect Starlink and Azure. The partnership is especially key to Microsoft&#39;s new mobile datacenters, which the company says are designed &#34;for customers who need cloud computing capabilities in hybrid or challenging environments, including remote areas.&#34;\n  Subscribe to CNBC PRO  for exclusive insights and analysis, and live business day programming from around the world.", "posttime": "2020-10-27 23:24:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发给,emails,starlink", "title": "SpaceX在发给感兴趣的客户的电子邮件中表示，Starlink卫星互联网服务的测试版最初每月费用为99美元，外加499美元的预付费用", "title_en": "SpaceX, in emails to interested customers, says the beta of the Starlink satellite internet service will initially cost $99/month plus a $499 upfront cost", "transed": 1, "url": "https://www.cnbc.com/2020/10/27/spacex-starlink-service-priced-at-99-a-month-public-beta-test-begins.html", "via": "", "real_tags": ["发给", "emails", "starlink"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本文通过研究C标准库中setjmp和long jmp函数的实现来探索RISC-V汇编。我经常发现，当我有可以反汇编的实际代码时，我会更快地掌握概念，因为它允许我将信息与意图联系起来。我相信RISC-V和类似的努力将从根本上改变计算机的制造和编程方式。我希望分享我的知识会给别人带来和我想象开放硬件未来时一样的快乐。\n注意：在这篇文章中，我们将使用RISC-V GNU工具链。如果您想要学习，可以交叉编译RISC-V目标的工具链，也可以下载预先构建的工具链和仿真器。您也可以使用不同的目标工具链编译和运行程序，但是程序集转储将特定于该体系结构。如果您更熟悉不同的ISA，这可能是了解RISC-V的有用方式！\n跳转是编程中控制流的基本组件之一。几乎任何指令集体系结构(ISA)都会有一个跳转指令，它允许您修改程序计数器，以便从内存中指定的位置执行下一条指令。我们还可以看到提供类似逻辑的高级语言中的控制流语句。这方面的一个例子是C中的goto语句，由于能够创建极其复杂的代码，许多C程序员不赞成使用goto，但它确实有一些有用的应用程序，如Linux内核编码风格指南中所述的集中执行函数。它允许您定义一个标签，然后“转到”程序中的那个位置并从那里继续执行。例如，下面的程序将在这里反复打印一个换行符。\n0000000000010158&lt；Main&gt；：10158：1141 addi sp，sp，-16 1015a：e406 SD ra，8(Sp)1015c：e022 SD s0，0(Sp)1015e：0800 addi s0，sp，16 10160：67c9 lui a5，0x12 10162：6c078513 addi a0，a5,1728#126c0&lt；__errno+0xE&gt；10166：1fc000ef JAL ra，10362&lt；put&gt；1016a：bfdj 10160&lt；main+0x8&gt；\n如您所见，在程序中使用goto直接转换为jRISC-V指令，该指令跳转到内存地址10160，导致处理器连续执行我们的printf语句。对于我们来说，在这里使用WHILE语句会清楚得多，但实际上我们将通过无限循环获得完全相同的汇编输出：\n0000000000010158&lt；Main&gt；：10158：1141 addi sp，sp，-16 1015a：e406 SD ra，8(Sp)1015c：e022 SD s0，0(Sp)1015e：0800 addi s0，sp，16 10160：67c9 lui a5，0x12 10162：6c078513 addi a0，a5,1728#126c0&lt；__errno+0xE&gt；10166：1fc000ef JAL ra，10362&lt；put&gt；1016a：bfdj 10160&lt；main+0x8&gt；\n但是，GOTO可以提供比循环更多的功能，并且对于打破一组深度嵌套的循环特别有用。前面提到的Linux内核风格指南提供了以下示例，以便正确使用goto：\nInt Fun(Int A){int result=0；char*buffer；buffer=kmalloc(size，gfp_kernel)；if(！buffer)return-ENOMEM；if(Condition1){While(Loop1){...}result=1；GOTO OUT_FREE_BUFFER；}...OUT_FREE_BUFFER：kfree(Buffer)；Return Result；}\n在这种情况下，描述性标签用于定义特定的错误路径。虽然这里只包含函数体的一小部分，但您可以想象可能会有多个阶段，在这些阶段中分配的缓冲区可能会变满，您可以通过释放内存并返回结果来处理所有这些阶段。虽然有些人可能仍然主张永远不要使用goto，但这表明这样做有一些好处，这样就不需要在整个函数体中复制冗余代码。\n不幸的是(或者幸运的是，如果您是从不使用goto的坚定支持者)，它只在本地上下文中有效。不能跳到当前正在执行的函数之外的标签。为此，在C标准库中添加了setjmp和long jmp，以支持非本地跳转。让我们看一个使用这些函数的最小示例。\n#include&lt；stdio.h&gt；#include&lt；setjmp.h&gt；static JMP_buf buf；void b(){printf(&#34；in function b\\n&#34；)；long jmp(buf，1)；}void a(){printf(&#34；in function a\\n&#34；)；if(setjmp(Buf))printf(&#34；back in function a\\n&#34；)；Else b()；}int main(){a()；}。\n通过查看setjmp Linux手册页面，我们可以很好地理解这里发生的事情。特别是对于本计划，说明的以下部分非常重要：\nLong jmp()函数使用env中保存的信息将控制转移回调用setjmp()的位置，并将堆栈恢复(“回绕”)到setjmp()调用时的状态。\n在一个成功的long jmp()之后，继续执行，就像setjmp()第二次返回一样。\n最简单地说，这两个函数允许我们保存地址并在稍后执行时返回该地址。在幕后，其他值也被保存到BUF中，我们稍后将看到这一点。首先，让我们看看64位RISC-V目标的实际汇编输出是什么样子。\n00000000000103c4&lt；setjmp&gt；：103c4：00153023 sd ra，0(A0)103c8：e500 sd s0，8(A0)103ca：e904 sd s1，16(A0)103cc：01253c23 s2，24(A0)103d0：03353023 sd s3，32(A0)103d4：03453423 s4，40(A0)103d8：03553823 sd s5，48(A0)103dc：03653c23 sd s6，56(A0)103e0：05753023 sd s7，64(A0)103e4：05953823 sd s8，72(A0)103e8：05953823 s8,103ec：05a53c23 s10,103d8：07b53023 sd s6，56(A0)103e4：05753023 sd s7，64(A0)103e4：05953823 sd s80(A0)103ec：05a53c23 sd s10,103f0：07b53023 sd s6，64(A0)103e4：05953823 sd s8，72(A0)103e8：05953823 sd s80(A0)103ec：05a53c23 sd s88。104(A0)103f8：B920FSD fs0,112(A0)103fa：bd24 FSD fs1,120(A0)103fc：09253027 FSD fs2,128(A0)10400：09353427 FSD fs3,136(A0)10404：09453827 FSD fs4,144(A0)10408：09553c27 FSD fs5,152(A0)1040C：0b653027 FSD fs6,160(A0)10410：0b753427 FSD fs7,176(A0)10414：0b853827 FSD fs8,168(A0)10418：0b853827 FSD fs8,1041c：0da53027 FSD fs10,192(A0)10420：db053427 fsd 11,200(A0)10424：10424：504ret(A0)10414：0b853827 FSD fs8,168(A0)10418：0b853827 FSD fs8,1041c：0da53027 FSD fs10,192(A0)10420：db053427 fs11,200(A0)10424：504ret\n下面是RISC-V汇编中setjmp的实现。在深入研究之前，了解RISC-V架构中的寄存器非常重要。由于我们使用的是64位机器，因此32个通用寄存器中的每个都是64位宽。虽然每个寄存器都被归类为通用寄存器，但是大多数编译器都会遵循一些调用约定。\n除了寄存器之外，我们还必须了解setjmp使用的几条伪指令。\nSD：存储双字(将第一个操作数指定的寄存器中的值存储到第二个操作数指定的地址中)。\nLI：立即加载(将第二个操作数直接加载到第一个操作数指定的寄存器中)。\n如果您有兴趣查看编写RISC-V汇编时可用的所有指令，请参阅程序员手册。\n那么我们到底在这里做什么呢？Setjmp的行为被指定为将有关调用函数的环境的信息存储到缓冲区中。如果回顾minimal.c的源代码，您将看到我们正在将jmp_buf类型的缓冲区传递给a()中的setjmp函数。如果我们查看a()的转储，您可以看到我们正在跳转并链接(JAL)到setjmp函数的地址：\n0000000000010174&lt；a&gt；：10174：1141 addi sp，sp，-16 10176：e406 SD ra，8(Sp)10178：e022 SD s0，0(Sp)1017a：0800 addi s0，sp，16 1017c：67c9 lui a5，0x12 1017e：7f078513 addi a0，a5,2032#127f0&lt；__errno+0x1a&gt；__errno+0x1a&gt；10182：238000ef JAL ra，103ba&lt；put&gt；10186：70018513 addi a0,103ba&lt，1792#14830&lt；UF&gt；1018a：23a000ef Jra，103c4&lt；setjmp&gt；1018e：87a5,103a&gt；10182：238000ef JAL ra，103ba&lt；put&gt；10186：70018513 addi a0,103c4&lt；1018a：23a000ef jra，103c4&lt；setjmp&gt；1018a：87a5,10190：103ba&lt；put&gt；10186：70018513 addi a0,103c4&lt；A+0x2a&gt；10192：67cd lui a5，0x13 10194：80078513 addi a0，a5，-2048#12800&lt；__errno+0x2a&gt；10198：222000ef JAL ra，103ba&lt；Put&gt；1019c：a019 j 101a2&lt；a+0x2e&gt；a+0x2e&gt；1019e：fbbff0ef JAL ra，10158&lt；b&gt；101a2：0001 NOP 101a4：60a2 ld，8(Sp)101a6：6402 ld s0，0(Sp)101a8：0141 addi sp，sp，16 101aa：8082 ret，10158&lt；b&gt；101a2：0001 NOP 101a4：60a2 ld，8(Sp)101a6：6402 ld s0，0(Sp)101a8：0141 addi sp，sp，16 101aa：8082 ret。\n跳转和链接只是意味着在我们跳转到完成执行之后，它将返回到它被调用的地方(这是通过将当前地址存储到寄存器x1(Ra)，即返回地址寄存器来实现的)。当我们跳到setjmp时，它将把有关环境的信息保存到buf中，稍后调用long jmp时将使用buf来恢复环境。\n\n它看起来很像setjmp，但是我们现在不是存储到buf中，而是重新加载到寄存器中。我们的返回地址将被设置为10198(buf中的第一个条目，0(A0))，这是我们最初调用setjmp的a()中的点。类似地，我们的堆栈指针(Sp)和帧指针(S0)将指向与我们最初调用setjmp时相同的地址。\n注意：重置框架和堆栈指针可能会导致令人惊讶的行为。想一想，在返回到内部执行之前，从调用setjmp的函数返回可能会导致堆栈上出现错误。当函数返回时，堆栈指针恢复为帧指针，这意味着堆栈上存储的值可以被覆盖。事实上，我们的最小示例容易受到此行为的影响，但它不会出现，因为我们的两个函数的行为不依赖于堆栈。\n最后三条指令再次实现了Linux手册页中的部分规范：\n这个“假”返回可以与真正的setjmp()调用区分开来，因为“假”返回返回val中提供的值。如果程序员错误地将值0传递给val，则“假”返回将返回1。\nSEQZ：如果等于零则设置(如果第二个操作数等于0，则将第一个操作数的值设置为1，否则设置为0)。\n它们有效地协同工作，以确保long jmp要么返回传递给它的int(在寄存器A1中)，要么返回1。如果a1等于0，则seqz会将a0设置为1，然后add会将a0(1)和a1(0)相加，并将结果(1)存储在a0中。如果a1不等于0，则seqz会将a0设置为0，然后add会将a0(0)和a1(传递的值)相加，并将结果(传递的值)存储在a0中。然后，我们将返回到ra中指定的地址，该地址是我们从buf恢复的。\n非本地跳转不太可能在大多数项目中广泛使用。但是，他们在演示高级编程概念如何转换为机器代码方面做了适当的工作。它们还介绍了如何实现并发的初始概念。事实上，setjmp和long jmp已经用于实现基本的协程。", "note_en": "This post explores RISC-V assembly by examining the implementation of the  setjmp and  longjmp functions from the C standard library. I frequently find that I grasp concepts more quickly when I have actual code that I can disassemble because it allows me to connect information with intent. I believe RISC-V and similar efforts will fundamentally shift how computers are made and programmed. I hope that sharing my knowledge will inspire the same joy in others that I feel when imagining a future of open hardware.\n Note: We will be using the RISC-V GNU toolchain throughout this post. If you would like to follow along, you can cross-compile the toolchain for a RISC-V target, or you can download a  prebuilt toolchain and emulator. You can also compile and run the programs using a different target toolchain, but the assembly dump will be specific to that architecture. If you are more familiar with a different ISA, this may be a useful way to learn about RISC-V!\n  Jumps are one of the fundamental components of control flow in programming. Nearly any  Instruction Set Architecture (ISA) is going to have a jump instruction that lets you modify the program counter to execute the next instruction from the specified location in memory. We also see control flow statements in higher level languages that provide similar logic. An example of this would be the  goto statement in C. Using  goto is frowned upon by many C programmers due to the ability to create horribly complex code, but it does have useful applications, such as centralized executing of functions, as described in the  Linux kernel coding style guide. It allows you to define a label, then “go to” that place in your program and resume execution from there. For example, the following program will print  Here followed by a newline character over and over again.\n      0000000000010158 &lt;main&gt;: 10158: 1141 addi sp,sp,-16 1015a: e406 sd ra,8(sp) 1015c: e022 sd s0,0(sp) 1015e: 0800 addi s0,sp,16 10160: 67c9 lui a5,0x12 10162: 6c078513 addi a0,a5,1728 # 126c0 &lt;__errno+0xe&gt; 10166: 1fc000ef jal ra,10362 &lt;puts&gt; 1016a: bfdd j 10160 &lt;main+0x8&gt;\n As you can see, using  goto in the program translates directly to the  j RISC-V instruction, which jumps to memory address 10160, causing the processor to continuously execute our  printf statement. It would be much more clear for us to use a  while statement here, but we will actually get the exact same assembly output with an infinite loop:\n     0000000000010158 &lt;main&gt;: 10158: 1141 addi sp,sp,-16 1015a: e406 sd ra,8(sp) 1015c: e022 sd s0,0(sp) 1015e: 0800 addi s0,sp,16 10160: 67c9 lui a5,0x12 10162: 6c078513 addi a0,a5,1728 # 126c0 &lt;__errno+0xe&gt; 10166: 1fc000ef jal ra,10362 &lt;puts&gt; 1016a: bfdd j 10160 &lt;main+0x8&gt;\n However,  goto can provide more functionality than a loop, and is specifically useful for breaking out of a set of deeply nested loops. The aforementioned Linux kernel style guide gives the following example for an appropriate use of  goto:\n int fun( int a){  int result =  0;  char *buffer; buffer = kmalloc(SIZE, GFP_KERNEL);  if (!buffer)  return -ENOMEM;  if (condition1) {  while (loop1) { ... } result =  1;  goto out_free_buffer; } ...out_free_buffer: kfree(buffer);  return result;}\n In this case, a descriptive label is being used to define a specific error path. Though only a small part of the function body is included here, you can imagine that there could be multiple stages in which the allocated buffer could become full, all of which you would handle by freeing the memory and returning the result. While some may still advocate for never using  goto, this demonstrates that there are some benefits, such has not needing to duplicate redundant code throughout the function body.\n  Unfortunately (or fortunately if you are a strong proponent of never using  goto), it only is valid in a local context. You cannot jump to a label outside of the function in which you are currently executing. For this reason,  setjmp and  longjmp were added to the C standard library to support non-local jumps. Let’s take a look at a minimal example of using these functions.\n  #include  &lt;stdio.h&gt;  #include  &lt;setjmp.h&gt;   static jmp_buf buf; void b(){ printf( &#34;in function b \\n &#34;); longjmp(buf,  1);} void a(){ printf( &#34;in function a \\n &#34;);  if (setjmp(buf)) printf( &#34;back in function a \\n &#34;);  else b();} int main(){ a();}\n    We can get a good understanding of what is going on here by taking a look at the  setjmp Linux manual page. Specifically for this program, the following portions of the description are important:\n  The longjmp() function uses the information saved in env to transfer control back to the point where setjmp() was called and to restore (“rewind”) the stack to its state at the time of the setjmp() call.\n Following a successful longjmp(), execution continues as if setjmp() had returned for a second time.\n In the simplest of terms, these two functions allow us to save an address and return to it at a later point in execution. Behind the scenes, other values are also being saved into the  buf, which we will look at momentarily. First, let’s see what the actual assembly output for a 64-bit RISC-V target looks like.\n  00000000000103c4 &lt;setjmp&gt;: 103c4: 00153023 sd ra,0(a0) 103c8: e500 sd s0,8(a0) 103ca: e904 sd s1,16(a0) 103cc: 01253c23 sd s2,24(a0) 103d0: 03353023 sd s3,32(a0) 103d4: 03453423 sd s4,40(a0) 103d8: 03553823 sd s5,48(a0) 103dc: 03653c23 sd s6,56(a0) 103e0: 05753023 sd s7,64(a0) 103e4: 05853423 sd s8,72(a0) 103e8: 05953823 sd s9,80(a0) 103ec: 05a53c23 sd s10,88(a0) 103f0: 07b53023 sd s11,96(a0) 103f4: 06253423 sd sp,104(a0) 103f8: b920 fsd fs0,112(a0) 103fa: bd24 fsd fs1,120(a0) 103fc: 09253027 fsd fs2,128(a0) 10400: 09353427 fsd fs3,136(a0) 10404: 09453827 fsd fs4,144(a0) 10408: 09553c27 fsd fs5,152(a0) 1040c: 0b653027 fsd fs6,160(a0) 10410: 0b753427 fsd fs7,168(a0) 10414: 0b853827 fsd fs8,176(a0) 10418: 0b953c27 fsd fs9,184(a0) 1041c: 0da53027 fsd fs10,192(a0) 10420: 0db53427 fsd fs11,200(a0) 10424: 4501 li a0,0 10426: 8082 ret\n Here is the implementation of  setjmp in RISC-V assembly. Before diving too far in, it is important to understand the registers in the RISC-V architecture. Since we are using a 64-bit machine, each of the 32 general purpose registers is 64 bits wide. Though each of the registers is classified as general purpose, there are calling conventions that most compilers will adhere to.\n  In addition to the registers, we must understand the few pseudo instructions that  setjmp makes use of.\n sd: store doubleword (stores the value in the register specified by the first operand into the address specified by the second)\n  li: load immediate (loads the second operand directly into the register specified by the first)\n If you are interested in checking out all of the instructions available when writing RISC-V assembly, take a look at the  programmer’s manual.\n So what exactly are we doing here? The behavior of  setjmp is specified as storing information about the calling function’s environment into the buffer. If you look back to the source code of  minimal.c, you’ll see that we are passing the buffer of type  jmp_buf into the  setjmp function in  a(). If we look at the dump of  a() you can see that we are jumping and linking ( jal) to the address of the  setjmp function:\n 0000000000010174 &lt;a&gt;: 10174: 1141 addi sp,sp,-16 10176: e406 sd ra,8(sp) 10178: e022 sd s0,0(sp) 1017a: 0800 addi s0,sp,16 1017c: 67c9 lui a5,0x12 1017e: 7f078513 addi a0,a5,2032 # 127f0 &lt;__errno+0x1a&gt; 10182: 238000ef jal ra,103ba &lt;puts&gt; 10186: 70018513 addi a0,gp,1792 # 14830 &lt;buf&gt; 1018a: 23a000ef jal ra,103c4 &lt;setjmp&gt; 1018e: 87aa mv a5,a0 10190: c799 beqz a5,1019e &lt;a+0x2a&gt; 10192: 67cd lui a5,0x13 10194: 80078513 addi a0,a5,-2048 # 12800 &lt;__errno+0x2a&gt; 10198: 222000ef jal ra,103ba &lt;puts&gt; 1019c: a019 j 101a2 &lt;a+0x2e&gt; 1019e: fbbff0ef jal ra,10158 &lt;b&gt; 101a2: 0001 nop 101a4: 60a2 ld ra,8(sp) 101a6: 6402 ld s0,0(sp) 101a8: 0141 addi sp,sp,16 101aa: 8082 ret\n Jump and link just means that after the function we are jumping to finishes execution that it will return to where it was called (this is achieved by storing the current address into register  x1 ( ra), the return address register). When we jump to  setjmp it is going to save information about the environment into  buf, which will later be used to restore the environment when  longjmp is called.\n In  setjmp, we see a long sequence of store instructions ( sd /  fd). Each is taking a value from a register and storing it into  buf, which is essentially a sequence of  long int values, defined per target architecture in the C standard library. You can see the RISC-V implementation  here (you can also see where our  setjmp and  longjmp assembly is coming from  here). Most of these store operations are just moving saved registers into  buf, but three are of primary importance in our simple example:\n  The first instruction is storing the  ra register into the first entry in  buf (the number preceding  (a0) is the address offset in bytes; remember that  buf values are stored sequentially). Our  jal instruction in  a() set  ra to the calling address, meaning the first entry in  buf will have the information to return execution to the exact location that we called  setjmp in the future. The second two instructions are storing the frame pointer and the stack pointer into  buf. This will be important because we will also want our stack restored when we return with  longjmp.\n We finish up by setting the  a0 register to 0, as we previously saw detailed in the specification that  setjmp must return with value 0 on direct invocation, then we return ( ret), which will take us back to where we called  setjmp.\n Our  a() function will continue execution with an evaluation of the return value of  setjmp. Since it is 0, our  if statement will evaluate to  false, and we will call  b().\n  Now in  b(), we print our statement, then call  longjmp with  buf and our desired return value (1). Let’s take a look at the assembly for  b():\n 0000000000010158 &lt;b&gt;: 10158: 1141 addi sp,sp,-16 1015a: e406 sd ra,8(sp) 1015c: e022 sd s0,0(sp) 1015e: 0800 addi s0,sp,16 10160: 67c9 lui a5,0x12 10162: 7e078513 addi a0,a5,2016 # 127e0 &lt;__errno+0xa&gt; 10166: 254000ef jal ra,103ba &lt;puts&gt; 1016a: 4585 li a1,1 1016c: 70018513 addi a0,gp,1792 # 14830 &lt;buf&gt; 10170: 2b8000ef jal ra,10428 &lt;longjmp&gt;\n As you can see, the final instruction is to jump and link to  longjmp. However, we will not return to the address that we called from because we are going to overwrite  ra in  longjmp (you can test that we do not return to  b() by placing another print statement after the call to  longjmp). Now let’s take a closer look at our  longjmp implementation.\n 0000000000010428 &lt;longjmp&gt;: 10428: 00053083 ld ra,0(a0) 1042c: 6500 ld s0,8(a0) 1042e: 6904 ld s1,16(a0) 10430: 01853903 ld s2,24(a0) 10434: 02053983 ld s3,32(a0) 10438: 02853a03 ld s4,40(a0) 1043c: 03053a83 ld s5,48(a0) 10440: 03853b03 ld s6,56(a0) 10444: 04053b83 ld s7,64(a0) 10448: 04853c03 ld s8,72(a0) 1044c: 05053c83 ld s9,80(a0) 10450: 05853d03 ld s10,88(a0) 10454: 06053d83 ld s11,96(a0) 10458: 06853103 ld sp,104(a0) 1045c: 3920 fld fs0,112(a0) 1045e: 3d24 fld fs1,120(a0) 10460: 08053907 fld fs2,128(a0) 10464: 08853987 fld fs3,136(a0) 10468: 09053a07 fld fs4,144(a0) 1046c: 09853a87 fld fs5,152(a0) 10470: 0a053b07 fld fs6,160(a0) 10474: 0a853b87 fld fs7,168(a0) 10478: 0b053c07 fld fs8,176(a0) 1047c: 0b853c87 fld fs9,184(a0) 10480: 0c053d07 fld fs10,192(a0) 10484: 0c853d87 fld fs11,200(a0) 10488: 0015b513 seqz a0,a1 1048c: 952e add a0,a0,a1 1048e: 8082 ret\n It looks a lot like  setjmp, but instead of storing into  buf, we are now loading back into registers. Our return address will be set to  10198 (the first entry in  buf,  0(a0)), the point in  a() where we originally called  setjmp. Similarly, our stack pointer ( sp) and frame pointer ( s0) are going to point to the same addresses as they did when we initially called  setjmp.\n Note: Resetting the frame and stack pointers can cause surprising behavior. Think about how returning from the function that calls  setjmp before returning to execution inside of it could lead to errors on the stack. When a function returns, the stack pointer is restored to the frame pointer, meaning values stored on the stack can be overwritten. In fact, our minimal example is susceptible to this behavior, but it does not appear because our two functions’ behavior is not dependent on the stack.\n The last three instructions once again implement part of the specification in the Linux manual page:\n This “fake” return can be distinguished from a true setjmp() call because the “fake” return returns the value provided in val. If the programmer mistakenly passes the value 0 in val, the “fake” return will instead return 1.\n  seqz: set if equal to zero (sets value of first operand to 1 if second operand equals 0, otherwise sets to 0)\n These effectively work together to make sure that  longjmp either returns the  int passed to it (in register  a1) or 1. If  a1 is equal to 0, the  seqz will set  a0 to 1, then  add will add  a0 (1) and  a1 (0) and store the result (1) in  a0. If  a1 does not equal 0,  seqz will set  a0 to 0, then  add will add  a0 (0) and  a1 (passed value) and store the result (passed value) in  a0. Then we will return to the address specified in  ra, which we restored from  buf.\n  Non-local jumps are not likely to be used extensively in most projects. However, they do a suitable job of demonstrating how higher-level programming concepts translate to machine code. They also introduce the beginning concepts of how concurrency can be implemented. In fact,  setjmp and  longjmp have been used to implement basic  coroutines.", "posttime": "2020-10-27 23:19:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "risc,local,fsd", "title": "了解RISC-V组件中的非本地跳转(Setjmp/Longjmp)", "title_en": "Understanding Non-Local Jumps (Setjmp/Longjmp) in RISC-V Assembly", "transed": 1, "url": "https://danielmangum.com/posts/non-local-jumps-riscv/", "via": "", "real_tags": ["risc", "local", "fsd"]}]