[{"category": "", "categoryclass": "", "imagename": "062e799c072d9338567c438edb433086.jpg", "infoid": 1003174, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "版权局周四在一份内容广泛的报告中表示，从互联网上删除未经许可版本的电影、音乐和其他内容的过程没有按预期进行，应该进行更新。\n大局是：更新这个系统需要国会的一项法案，现在国会可以在考虑就此事立法时参考版权局的结论。\n推动新闻：该办公室在其报告中发现，通知和删除侵权材料的制度不平衡，与国会在1998年“数字千年版权法”(Digital Millennium Copy版权法)中确立这一程序时的意图不符。\nDMCA包括对其用户非法上传受版权保护的材料的在线公司的责任保护，如果在线公司在接到权利人的通知时删除这些材料的话。\n版权持有者抱怨说，这一过程并没有主动保护他们的知识产权免受网络侵权，这份报告似乎也同意这一点，结论是国会最初打算的平衡被歪曲了。\n该报告不建议对流程进行大规模更改，但强调了DMCA可能需要更新的领域。\n其中包括确定谁可以免于责任的标准，以及旨在威慑反复违法者的政策，版权局得出的结论是，这些政策可能不起作用。\n下一步是什么：参议院司法知识产权小组委员会今年早些时候开始了一系列听证会，审查DMCA，并计划在2020年底之前起草对该法律的修改。", "note_en": "The process to get unlicensed versions of movies, music and other content taken off the internet isn&#39;t working as intended and should be updated, the Copyright Office said in an  expansive report Thursday.\n The big picture: Updating that system would require an act of Congress, which can now look to the Copyright Office&#39;s conclusions as it considers legislating on the matter.\n Driving the news: In its report, the office found the system for notice and takedown of infringing materials is unbalanced and out of sync with Congress&#39; intent when it established the process in the 1998 Digital Millennium Copyright Act.\n The DMCA includes liability protection for online companies whose users illegally upload copyrighted material if the online companies take down the material when they are notified by the rights-holder.\n Copyright holders have complained that this process doesn&#39;t proactively protect their intellectual property against online infringement, and the report appears to agree, concluding &#34;Congress’ original intended balance has been tilted askew.&#34;\n The report doesn&#39;t recommend wholesale changes to the process, but does highlight areas of the DMCA that may need updating.\n They include the criteria for determining who gets to be immune from liability and policies intended to deter repeat offenders, which the Copyright Office concluded may not be working.\n What&#39;s next: The Senate Judiciary intellectual property subcommittee began a series of hearings examining the DMCA earlier this year, with plans to draft changes to the law by the end of 2020.", "posttime": "2020-05-22 02:57:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "离线,office,dmca", "title": "版权局：离线拉取内容的系统不工作", "title_en": "Copyright Office: System For Pulling Content Offline Isn't Working", "transed": 1, "url": "https://www.axios.com/copyright-office-system-for-pulling-content-offline-isnt-working-ed78fe62-eec4-44dc-bcdd-1c593e888fb8.html", "via": "", "real_tags": ["离线", "office", "dmca"]}, {"category": "", "categoryclass": "", "imagename": "cd8b0d283c5cc31412745b7adea28ca6.jpg", "infoid": 1003173, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三星今天宣布了一款全新的旗舰传感器，其形式为ISOCELL GN1。新的传感器似乎是我们看到的小米设备和Galaxy S20 Ultra采用的108MP ISOCELL HMX和HM1传感器的后续产品。\n新的GN1最大的变化是它使用了与现有的更大的百万像素传感器不同的光学公式。在最大5000万像素的情况下，分辨率仅略低于一半，但每像素间距从0.8µm增长到1.2µm。\n看起来，三星提高像素间距的主要原因不仅仅是增加了每像素的光收集能力，而且还使得重新引入全传感器双像素相位检测成为可能。目前市场上已上市的108MP传感器一直采用2x1分布式片上镜头相位检测自动调焦像素，自动调焦性能远不如双像素PD解决方案。理论上，使用双像素PD像素的GN1意味着它使用成对的0.6µm x 1.2µm照片点。\nGN1也是第一个将双像素技术与四元拜耳滤色器阵列(三星称之为Tetracell)配对的传感器。实际上，50MP传感器本身就会将2x2像素捆绑在一起，产生1250万像素的图像，有效像素间距为2.4µm。有趣的是，三星还谈到提供软件算法，通过使用来自每个光电二极管的信息来生成100MP图像-这听起来都像是像素偏移的超分辨率技术。\n传感器的大小仍然保持在1/1.33“-本质上它与华为目前在P40系列手机上发现的50MP传感器最接近-增加了双像素PD。\n传感器仍然支持8K30视频录制，但我们希望与S20Ultra中当前的HM1实现相比，它能够以更小的图像裁剪实现这一点。\n这些新一代传感器的正确使用对供应商来说是极具挑战性的-除了实际使用全分辨率增加的计算工作量(从108MP减少到50MP将对此有所帮助)外，还面临提供充分利用分辨率的足够光学器件的挑战。似乎这里的GN1在它的要求上更合理一些，而不是它的纯粹的大尺寸。\n发帖评论手机的MP上限在哪里？在某种程度上，你需要一个更大的镜头，而这在手机里是做不到的。回覆\n镜头越多无助于越过某个点-镜头元素的小型化带来了一系列问题(色差、昏迷、各种扭曲等，更不用说镜头越小，最终图像中的任何生产误差都会变得越大)。即使考虑到S20 Ultra巨大的隆起，它们在S20 Ultra上的感应器+镜头组合如此之大，我已经感到震惊了-我怀疑哪里都能去，而不会在本世纪头十年末造成相机颠簸，一度让手机变得非常厚实。而且，增加像素数仍然存在与实际和图像相关的问题(这并不是说这样做可以做到这一点)。回覆。\n这是10年前、20年前、30年前每个人都相信的，看看我们今天的处境。总会有改进的空间，技术挑战只是未知的，并不是不可能的。回覆。\n诺基亚最近尝试过，但惨败。他们使用了5个没有OIS的微型传感器，在微弱的光线下，所有的传感器都分崩离析了。如果图像太过嘈杂，软件就不能将它们组合在一起，从而放弃留下一团糟的局面。还有其他问题，比如动态照片的画面元素变得模糊，但如果诺基亚麻烦的话，这些问题是完全可以解决的。这可能是更好的有一组小视场的图像，并缝合它们，因为它绕过了光线不足的问题，但组装将是有趣的。\n回覆。\n不，光学分辨率在理论上是有极限的。当我们到达他们那里时，我们几乎就在那里，智能手机上的微型传感器，我们将不能再走得更高了。100多年来，我们已经用显微镜看到了这一点。当你接近光的波长时，你就不能再分辨了。这就是所谓的“空决议”。回覆。\n你可以达到分辨率的极限，但你不必把所有的感应区都放在一个相机里。想想看，一张全景照片是如何通过将许多较小的照片缝合在一起而生成的。回覆。\n仅仅提高分辨率是远远达不到进步的。由于这些传感器的像素间距非常小，因此噪声非常大，因此需要相当积极的降噪(要么是传统降噪，要么是通过神经网络降噪，就像现在更经常做的那样)。除了分辨率提高之外，还有其他缺点。增加分辨率只会增加图像的“大小”(*而不是*其质量)，而其他一切都是相同的，或者通常是更差的。50MP或.108MP(！)。因为不存在具有这种分辨率监视器或其他设备，所以人们可以查看该图像。既然没有办法查看，这些图片的唯一目的就是为了吹嘘自己的权利，它们只是浪费了存储空间。108MP图像可能具有的唯一价值是用于放大以查看从远处拍摄的图像的微小细节(也就是说，假设其内存占用不会导致缓冲区溢出)。换句话说，对于天文学、卫星拍摄的地球上某些地点的照片、观赏鸟类和大自然等领域，你认为有多少人会为这些目的购买一部108MP感应器的手机？回覆。\n&lt；头爆炸&gt；你没听说过放大吗？也许我可以给我的孩子的毕业班拍一张50MP的照片，然后我们走在回忆的小路上，看一看每个孩子的脸。更不用说显示器从8K发展到32K的未来，并且变得能够显示更高分辨率的图像。你只在同一天看过你们的照片吗？为什么要费心去吃呢？回覆\n你曾经放大过这种分辨率的智能手机照片吗？要做到这一点的质量根本不在那里-一切看起来都像是污迹斑斑的垃圾。即使在智能手机上拍摄的99%的照片从未在其他地方观看过，但分辨率在12像素以上，分辨率高于1-2MP的照片肯定是有用处的。不。一张高质量的1200万像素照片可以打印为A3大小甚至更大(通过允许它不被非常近地查看，或者通过使用高质量的放大算法)。这种大小的传感器已经达到了在这一点附近质量回报急剧下降的地步，因此进一步提高分辨率通常只会对实际图像质量产生不利影响。当然，有一些方法可以缓解这一问题，但没有一种方法比让像素保持合理的大小更好。当然，还有文件大小和数据处理的问题，5000万像素的图片甚至会让压缩得离谱的jpeg文件变得巨大而笨重。回覆", "note_en": "Samsung today has announced a brand-new flagship sensor in the form of the ISOCELL GN1. The new sensor is seemingly a follow-up to the 108MP ISOCELL HMX and HM1 sensors that we’ve seen employed by Xiaomi devices and the Galaxy S20 Ultra.\n  The big changes in the new GN1 is that it uses are different optical formula to the existing larger megapixel sensors. It’s only a bit less than half the resolution at a maximum of 50 megapixels, however the per-pixel pitch grows from 0.8µm to 1.2µm.\n  It seems that Samsung’s main rationale to grow to a larger pixel pitch wasn’t just the per-pixel increased light gathering ability, but rather the enablement to re-introduce full sensor dual-pixel phase-detection. The existing 108MP sensors that have been out in the market have been using 2x1 distributed on-chip lens phase detection autofocus pixels on the sensor, with the autofocus performance not been nearly as performant and a dual-pixel PD solution. In theory, the GN1 using dual-pixel PD pixels means that it uses pairs of 0.6µm x 1.2µm photo sites.\n    The GN1 is also the first sensor to pair the dual-pixel technology with a quad-bayer colour filter array, which Samsung calls Tetracell. In effect, the 50MP sensor will natively bin 2x2 pixels to produce a 12.5MP image with effective pixel pitches of 2.4µm. Interestingly, Samsung also talks about providing software algorithms to be able to produce 100MP images by using information from each individual photodiode – which all sounds like pixel-shift super resolution techniques.\n  The size of the sensor remains at a large 1/1.33” – in essence it’s most comparable to Huawei’s  current 50MP sensor that is found in the P40 series phones – with the addition of Dual Pixel PD.\n  The sensor still supports 8K30 video recording, but we hope it’s able to achieve this with a smaller image crop compared to the current HM1 implementation in the S20 Ultra.\n  These new generation sensors are extremely challenging for vendors to properly use – besides the increased computational workload to actually use the full resolutions (the reduction from 108MP to 50MP will help there), there’s also the challenge of providing adequate optics that can take advantage of the resolution. It seems the GN1 here is a bit more reasonable in its demands, other than its sheer large size.\n  POST A COMMENT      Where is the MP ceiling for phones? At some point you&#39;ll need a bigger lens that just won&#39;t do in a phone.   Reply\n    More lenses won&#39;t help past a certain point - miniaturization of lens elements brings with it a series of issues (chromatic aberration, coma, various distortions, etc., not to mention that the smaller the lens, the larger any production error will become in the final image). I&#39;m already shocked that they fit as large a sensor+lens combo in the S20 Ultra as they did even considering its huge hump - I doubt there&#39;s anywhere to go without making some kind of late-2000s camera bump making the phone massively thick at one point. And still there&#39;s both practical and image related issues to increasing pixel counts (not that this does that though).  Reply\n  That is what everyone believe 10, 20, 30 years ago and look where we are today. There will always be rooms for improvement and technical challenges are just an unknown, not an impossibility.  Reply\n  Nokia tried it recently and failed dismally. They used 5 tiny sensors without OIS, and it all fell apart in low light. If the images were too noisy the software couldn&#39;t combine them and gave up leaving a hopeless mess. There were other issues such as the picture element of motion photos being out of focus but they were entirely fixable if Nokia had bothered. It may be better to have a set of small field of view images and stitch them as it gets around the low light issue, but the assembly would be interesting.\n  Reply\n  No, there are theoretical limits to optical resolution. As we reach them, and we’re pretty much there with the tiny sensors in smartphones, we won’t be able to go any higher. We’ve seen that with microscopes for well over 100 years. As you approach the wavelength of light, you simply can’t resolve any more. Then its called “empty resolution”.  Reply\n  You can reach the limits of resolution but you don&#39;t have to put all of the sensing area in one camera. Think about how a panorama photo is generated by stitching lots of smaller photos together.  Reply\n  Merely increasing resolution is nowhere close to an &#34;improvement&#34;. These sensors are super noisy due to their very small pixel pitch and thus require quite aggressive noise reduction (either conventional or, as is more often done nowadays, via neural networks). There are other drawbacks as well as resolution increases. Increasing resolution merely increases the *size* of the image (*not* its quality) with everything else being equal or -usually- worse.  There is no point to a 50 MP or a ... 108 MP (!) image because no monitor or other device exists with such a resolution so that someone can view that image. Since there is no way to view it the sole purpose of such images is for bragging rights and they only just waste storage. The only value a 108 MP image might have is for zooming in to see minute details of images shot from afar (assuming its memory footprint does not cause a buffer overflow, that is). In other words for fields like astronomy, photos taken by satellites of certain spots on Earth, bird &amp; nature watching etc etc How many people do you thing bought a phone with a 108 MP sensor for such purposes?  Reply\n  &lt;head explodes&gt; You&#39;ve never heard of zooming in? Maybe I take a 50MP picture of my kid&#39;s graduation group, and then we take a look at each kid&#39;s face as we walk down memory lane? Which is not to mention a future in which displays evolve from 8k to 32k, and become capable of displaying much higher resolution images. Do you only ever look at your photos the same day? Why bother to take them?  Reply\n  Have you ever zoomed into a smartphone photo of this type of resolution? The quality to do so simply isn&#39;t there - everything looks like blotchy garbage. There are definitely uses for resolutions above 1-2mp even if &gt;99% of photos shot on a smartphone are never viewed elsewhere, but above 12? Nah. A good quality 12mp photo can be printed in A3 size or even larger (either by allowing for it not being viewed very close, or by using a high quality upscaling algorithm). Sensors this size have already hit the point of dramatically diminishing returns for quality around this point, so increasing resolution further will typically only have detrimental effects on actual image quality. There are of course ways of alleviating this, but none that are any better than leaving the pixels reasonably large. There&#39;s also the issue of file sizes and data handling, of course, with 50mp pictures making even ridiculously compressed jpegs huge and unwieldy.  Reply", "posttime": "2020-05-22 02:49:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宣布,dual,像素", "title": "三星宣布推出新款50MP双像素和四拜耳等效传感器", "title_en": "Samsung Announces New 50MP Dual-Pixel and Quad-Bayer Isocell Sensor", "transed": 1, "url": "https://www.anandtech.com/show/15808/samsung-announces-new-50mp-dualpixel-and-quadbayer-sensor", "via": "", "real_tags": ["宣布", "dual", "像素"]}, {"category": "", "categoryclass": "", "imagename": "b5d0f1167a86fdbbb8945644fc4c54f6.png", "infoid": 1003172, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "戴利：作为亚马逊的一名开发人员，我在第二年末就精疲力尽了。从那以后，我找到了健康和可持续的工作和生活平衡，并再次享受工作。我写这篇文章是为了提高人们的意识，特别是对新员工和他们的家人，以及B)帮助亚马逊或其他公司经历同样经历的人带来希望和建议。\n最近，关于亚马逊企业文化的轶事、观点和反驳不绝于耳。我写这篇文章不是为了利用最新的新闻馈送时尚，而是为了分享我已经写好并迅速删除的内容。我认为没有人会想听我的故事，但很明显，人们正在经历类似的经历，没有发言权。\n我是亚马逊的软件开发工程师II；SDE II基本上指的是具有至少2-3年行业经验的软件开发人员。我以SDE I的身份开始在亚马逊工作。\n在五大之一工作对于大多数开发人员来说并不少见，但这是我分享的一个梦想。在通过了一次计时的在线编程测验后，我被空运到西雅图参加面试。飞回来不到一周，我就接到了一个电话祝贺我，并讨论了通常的(薪酬和福利)，以及特殊的(搬家奖金、签约奖金和授予股票期权)。记住那些“特殊”的部分，因为它们在以后很重要。\n在最初的几个月里，情况相当正常：典型的公司座右铭(这一次称为“原则”)和“你的工作不仅仅是工作”的演讲。我现在看透了，但在当时，像“世界上最以客户为中心的公司”这样的短语对一个睁大眼睛的新员工来说是糖果。\n在队里待了几个月后，我被安排在随叫随到的轮换名单上。以下是随叫随到的含义：\n您每X周随叫随到1周，其中X是您团队中的成员数量。\n在待命时，您的其他项目在工作日最多占用您一半的时间\n如果你的团队拥有的一件“东西”“进入警报”，就会传呼你。这是故意含糊的，因为它对不同的团队意味着不同的事情。\n如果你不这样做，你的经理就会被呼叫。你不会希望这种事发生的。\n随叫随到对我的团队来说不是(现在也不是)太糟糕。起初，我们平均每2周浏览1页；现在，我们大约每周阅读1页。其他球队的情况要糟糕得多。不过，它是一种社会阻尼器。如果你必须能够在一秒钟的通知下“跳出困境”，你就不能真的计划出去任何地方。\n我提到随叫随到的工作，是因为它是“特殊的”，因为唯一需要这种反应的其他职业是医生，字面上的救命稻草。当你第一次接听电话时，你会感到恐惧，并告诉你“天哪，这件事很严重。”\n在招聘过程中，除了通常的受薪一概而论之外，不会以任何方式提到随叫随到。你愿意在晚上和/或周末工作吗？\n有时，为了完成大型项目，其他团队可能需要更改代码。当然，另一个团队可能无法腾出所需的开发人员，所以您就被借出去了。在项目完成之前，你要在团队之间奔波，为两位经理服务。\n在某些情况下，另一个团队认为他们可以腾出开发时间来完成代码更改。当他们不这样做的时候，他们就会落后，所以你就会被贷款出去。\n任何人读了神话中的男人月，都会竖起耳朵。对于那些还没有读过它的人来说，这里的要点是，通过维基百科：给一个迟到的软件项目增加人力，让它变得更晚。\n我在亚马逊最糟糕的日子是我被借出去的时候；事实上，我一生中最糟糕的日子是我被借出去的时候。\n在亚马逊工作的第二年接近尾声时，我被拉进了X项目(显然是改名了)。它具备了一个前景不佳的项目的所有基础：\n我不会逐日叙述，而是直截了当地说：事情变得紧张起来。\n由于项目落后，来自上级的压力和审查越来越大。项目经理希望以尽可能多产的方式传递紧迫性，以取得适度的成功。\n长的工作日变成了周末的工作。我觉得事情的落后程度在很大程度上是我的责任。到目前为止，我不知道这有多真实。不管是什么原因，无论是需要证明我的价值，还是出于对失败的恐惧，结果都是一样的：我不停地工作。醒着的每一个小时都被投入到编写代码和修复错误上。\n起初我还是有一些自我意识的。我客观地知道，工作越多只会降低人的工作效率，但这是必须要做的。\n精疲力竭最终占据了上风。我的代码变得越来越糟。我以为我可以用几行代码就能超过我的错误计数。死亡螺旋的内环已经开始旋转。\n最终，压力改变了我的个性，让别人看得见。我很粗鲁，而我平时很外向，很善解人意。当我通常是那个开玩笑的人时，我是没有幽默感的。我的同事们开始注意到这一点，尽管我试图伪装起来。我开始选择工作而不是和朋友在一起。起初他们明白了。很抱歉，我需要工作，这是可以理解的。最终，他们也开始担心起来。再一次，为了不给他们增加负担，我又一次误入歧途，开始孤立自己=&gt；死亡螺旋的第二个环路。\n还记得我提到亚马逊的搬家和签约奖金吗？一点小小的警告，如果你在两年内离开或被解雇，你必须偿还这笔钱。\n当时我刚从大学毕业，我的积蓄比我欠下的钱要少得多。因此，如果我离开亚马逊，我不会只是失业，我将会有超过三个月的收入。\n所以现在我不能就这样离开。随之而来的是令人瘫痪的绝望。如果我失败了，被解雇了，那么我可能会在很长一段时间内找不到另一份工作。千禧一代中未充分就业是一件事。现在我有压力要把工作放在所有事情的首位=&gt；第三个循环。\n在这一点上，我的自我照顾是不存在的。为了最大化代码输出，我靠源源不断的垃圾食品和咖啡因为生。我一直有一定程度的失眠，但情况变得更糟了。最后一根稻草是当我用睡眠换取代码的时候。\n在这一点上，压力在我的脑海里变成了一个巨大的黑洞。没有其他的类比符合。它的身体感觉压垮了。没有情感，没有思想可以逃脱。我只能一遍又一遍地说它有多痛，我希望它停止。当我听到亚马逊时，我想到的就是这种状态。\n在这段时间里，我哭了。很多。通常是在睡觉的时候，因为我知道第二天一切都会重新开始。有时和我妻子在一起。在卫生间隔间待过几次。但是不，(你们这些受虐狂)不能在我的办公桌前。\n我的大脑只产生两种类型的想法(痛苦和请停止痛苦)，没过多久，自杀的念头就悄悄出现了。\n需要说明的是：我从未对这些想法采取任何行动。我不想自杀。我保留了尽可能多地计划的想法。但这正是自杀念头的本质：不管你真的想要什么，这种想法一次又一次地出现，最终以“请停止痛苦”取代“请停止一切。”=&&gt;“最后一圈”。\n我最终寻求精神上的帮助。我记得那个决定是如此实事求是。几乎带着你雇了个杂工修理东西的热情。&#34；嗯。漏水的管道。最好找个水管工来。考虑一下结束这件事的想法吗？我应该找个人来看看这个。\n直到现在，唯一知道事情真相的人是我的妻子。在这段时间里，我不能(但会试着)向她表达我的感激之情。她恰好在我需要她的时候出现了。即使在她不明白我为什么要让自己经历这件事的时候，她也会帮助我。她比我早得多地看到了这些迹象，并试图告诉我。当我意识到我需要帮助时，她让我与她取得联系。\n我被安排服用塞莱克斯。最终，死亡螺旋的循环解开了。项目启动了。一切都回到了基本正常的状态。几个月后我离开了塞莱克萨。直到几个月后，我才感觉完全康复。我摸到蛋壳上了。我严格地把自我照顾放在首位，在8小时内准时下班。我开始联系我的朋友，一起出去玩。\n我的经理给了我几天额外的假期作为我努力的回报。我被提拔到二级SDE，甚至还很健康，可以庆祝和享受它。\n那又怎么样？所以你把自己烧得精疲力尽，然后就精疲力尽了。你想要什么？我写这篇文章是因为我需要把我的故事写下来，作为一个警示故事。我来这里不是为了给一个真正的程序员设置一些愚蠢的标准，让他们把事情做好。我不是来妖魔化亚马逊的。\n就我要对亚马逊/杰夫·贝佐斯(Jeff Bezos)说的话而言，我只有几件事：\n重新审视您的奖金/搬迁回报策略。我不知道什么是正确的解决方案，但如果这是你留住员工所需要的，那就完蛋了。\n对于一个职位所需要的内容，要坦率地、尽可能准确地表达出来。与聪明人和热情的人一起工作是懒惰的招聘。\n鼓励员工不仅要批判性地对待想法，还要批判性地对待期望。让他们相信他们必须放弃一切才能得到你的认可，这是一种辱骂。\n要意识到生产力和快乐的员工不是零和游戏。顾客不是一个要求牺牲的愤怒的神。\n这个警示故事并不是亚马逊独有的。这可能发生在几乎任何人身上，但尤其是在紧张的工作场所工作的人，特别是在紧张的工作场所工作的开发人员。\n有一句话我在论坛和博客上看了一遍又一遍，但直到我亲身经历后才相信：\n回击不合理的期望是你的职业义务。你的老板一开始可能不喜欢，但他们会因此尊重你。\n我知道匿名发布这篇文章并不是在促进讨论。一个匿名帖子是我在跟你说话。\n然而，如果我不是真的害怕丢掉工作，我就不会以这种方式发帖。我们从现任员工那里听到的唯一其他声音都是支持亚马逊的，那就是https://www.linkedin.com/pulse/amazonians-response-inside-amazon-wrestling-big-ideas-nick-ciubotariu，https://www.linkedin.com/pulse/my-name-brittan-im-amazonian-brittan-cole-ma。\n他们在LinkedIn上。我讨厌在LinkedIn上发布的任何东西。所有的批评都是没有说服力的，所有的话都被淡化了。因为一切都是由未来的雇主来清理的，所以每个人都害怕真正说出任何有争议的话。\n他们来自当地的员工，而不是经理经理和人力资源代表。\n难道没有其他人觉得有趣的是，我们没有看到现任员工提出任何负面批评吗？我不在乎你为哪家公司工作，从来不缺少愿意抱怨的人。那么，为什么现在的员工没有负面文章呢？\n我看到了一些对文章的常见回应，我想在这里先发制人：\n工作超过40个小时是成为专业人士的一部分。(及其变体)我完全同意，但这些应该是偶发事件。每周70小时以上不应该是固定模式。他们应该得到管理层的赏识。见鬼，如果你要为了一张门桌而操我们，那就请我们吃饭吧。\n你为什么不干脆少干点呢？这似乎很大程度上是你自己的错。&#34；我在自己的脑海里反复考虑这个问题。除了前面提到的原因，我只是觉得有必要推动它。我觉得，在受雇于这样一家大名鼎鼎的公司后，如果我不尽我所能，我就是在伤害所有帮助我走到今天这一步的人。我没有意识到的是，事实恰恰相反：通过打破自己，我确实表明了我在某种程度上还没有准备好。谢天谢地，我确实挺过了难关，因为我能从中学到东西。\n你就是一个消极球，难怪你情绪低落，这就把我带到了我的下一节课。\n除了我的故事，我还想列举我喜欢在亚马逊工作的事情。毕竟我还在这里工作，我也没有把我的通知放进去的计划。\n不严格的工作时间&amp；可以在家工作“什么？！？在你刚才说了这么多之后？！？“。但说真的，当事情没有陷入危机时(80%以上的情况下)，开发人员的一天很少在上午9点之前开始。你通常大约一周可以在家工作一次。如果你有充分的理由需要提早下班，那也没问题(尽管下班后在家工作通常是一种常见的礼节)。\n没有着装规范这在大多数地方可能是既定的，但来自仅限商务休闲的地方的T恤是天赐之物。\n必须提一下。我不会给出数字，因为这可能是身份识别，但GlassDoor.com可以满足你的好奇心。当我的很大一部分朋友努力保持有报酬的工作时，这是件好事。尽管我上面提到了这些问题，但我仍然处于经济稳定的有利地位，现在有了很好的工作保障。\n与巨人共事，并在巨人的基础上发展壮大科技公司的招聘口号之一就是与聪明人并肩工作。虽然我通常对此不屑一顾，但对于一个开发人员的成长而言，不一定总是最聪明的人是很重要的一件事。这句话是科技公司招聘中最常见的格言之一。虽然我通常对此不屑一顾，但实际上，对于开发者的成长而言，不要总是最聪明的人是很重要的。\n杰夫·贝佐斯(Jeff Bezos)的电子邮件中提到，招聘人员总是与我们联系，这方面与我们的实际情况相吻合。我已经收到谷歌、Facebook、Netflix和其他公司的来信。我在西雅图的第一个月收到的招聘电子邮件比我以前工作的地方一年里收到的都多。\n近乎即时的通过化让你写的代码每天被成千上万的人实际执行，这是一件很棒的事情。很少有人有机会向他们的朋友和家人展示他们经常访问的网站，并说我在那里做了那件事。也许它最终会消失，但它仍然是我的最爱。\n我现在正在做一个新的贷款项目。另一个DEFCON ZEROMG！&34；项目，但现在我有了界限，我知道如果我不每周工作70小时，亚马逊就不会倒闭。工作和生活的平衡可能在很大程度上是主观的，但我现在知道这种平衡对我来说是什么样子，并在仍然尽我最大努力工作的同时强制执行这一点，我必须以艰难的方式学习这一点。我只能希望你不必这么做。", "note_en": "tl;dr: I burned out as a developer at Amazon at the end of my second year. I’ve since found a healthy and sustainable work-life balance and enjoy work again. I write this to A) raise awareness, especially for new-hires and their families, and B) help give hope and advice to people going through the same at Amazon or other companies.\n  There’s been no shortage of anecdotes, opinions, and rebuttals regarding Amazon’s corporate culture as of late. I write this not to capitalize on the latest news-feed fad, but to share what I had already written and promptly deleted. I didn’t think anyone would want to hear my story, but it’s apparent people are going through a similar experience and don’t have a voice.\n I’m a Software Development Engineer II at Amazon; SDE II basically means a software developer with at least 2–3 years of industry experience. I started at Amazon as an SDE I.\n To work at one of the Big 5 is no uncommon dream for most devs, but it was one that I shared. After passing a timed online coding quiz, I was flown to Seattle for an interview. Within a week of flying back, I got a call to congratulate me as well as discuss the usual (compensation, and benefits), as well as the exceptional (moving bonus, signing bonus, and vesting stock options). Remember those “exceptional” bits, as they matter later.\n For the first few months, things were fairly standard: typical corporate mottos (this time called “Principles”) and “your work is more than just work” speeches. I see through it now but at the time phrases like “World’s Most Customer-Centric Company” are candy to a wide-eyed new-hire.\n  After being on the team for a couple of months, I was put on the on-call rotation. Here’s what being on-call means:\n You are on-call for 1 week every X weeks, where X is the number of members on your team\n While on-call, your other projects take up at most half your time during the workday\n  You are paged if a “thing” your team owns goes “into alarm.” This is intentionally vague because it means different things for different teams.\n  If you don’t, your manager is paged. You do NOT want this to happen\n On-call wasn’t (and isn’t) too terrible for my team. At first we averaged 1 page every 2 weeks; now we’re up to about 1 a week. Other teams have it much, much worse. It is a social damper though. If you have to be able to “bail out” at a second’s notice, you can’t really make plans to go out anywhere.\n I mention on-call duty because it is “peculiar” in that the only other profession requiring this kind of responsiveness is doctors, literal lifesavers. When you go on-call for the first time, it’s terrifying and tells you “holy crap, this is serious.”\n During the hiring process, on-call is not mentioned in any way other than the usual salaried catch-all &#34;are you willing to work nights and/or weekends.&#34;\n  Occasionally in order to complete a large project, some other team may need to make code changes. That other team, naturally, may not be able to spare the developers required, so you get loaned out. Until the project is done, you&#39;re between teams and serving two managers.\n In some cases, that other team thought they could spare the dev-hours and complete the code changes. When they don’t, at some point they fall behind, so you get loaned out.\n Anyone who&#39;s read &#34;The Mythical Man-Month&#34; has their ears perking up. For those who haven&#39;t read it, here&#39;s the gist, via Wikipedia: &#34;adding manpower to a late software project makes it later&#34;.\n My worst days at Amazon have been when I was loaned out; in fact, the worst days of my life were when I was loaned out.\n Near the end of my second year at Amazon, I was pulled into &#34;Project X&#34; (obviously renamed). It had all the underpinnings of a project with a bad future:\n  I won&#39;t give a day-by-day account, but to cut to the chase: things got intense.\n As the project fell behind, the pressure and scrutiny from above grew. The project managers wanted to pass down the urgency in the most productive way possible, to moderate success.\n Long weekdays turned into working over the weekend. I felt largely responsible for how behind things were. As of now, I have no idea how true that is. Whatever the cause, whether through the need to prove my worth or out of fear of failure, the result was the same: I worked non-stop. Every waking hour was put into write code and fixing bugs.\n At first I still had some self-awareness. I knew objectively that working more only makes one less productive, but It Had To Be Done.\n Exhaustion eventually took over. My code got worse and worse. I thought I could outrace my bug-count with lines of code. The Inner Loop of the Death Spiral had begun to spin.\n Eventually the stress changed my personality in ways that became visible to others. I was rude, when I’m normally out-going and understanding. I was humorless when I’m usually the one who makes jokes. My co-workers starting noticing it, despite the guise I tried to put on. I started choosing work over being with my friends. At first they understood. Some amount of &#34;sorry I need to work&#34; is understandable. Eventually they started to worry too. Again, in a misguided attempt to not burden them, I began to isolate myself =&gt; The Second Loop of the Death Spiral.\n   Remember when I mentioned Amazon&#39;s moving and signing bonus? Little caveat on that, if you leave or are fired within 2 years, you have to pay it back.\n Still fresh out of college, my savings were significantly less than how much I would&#39;ve owed. So if I were to quit Amazon, I wouldn&#39;t just be out of a job, I would be in the hole more than three months&#39; income.\n So now I cannot &#34;just leave.&#34; With that realization came paralyzing hopelessness. If I failed and got fired, then I may not be able to find another job for quite a while. Un/Underemployment among Millennials is kind of A Thing. Now I have the stress of staying employed on top of everything =&gt; The Third Loop.\n  At this point, my self-care was non-existent. All to maximize code output, I lived off a steady stream of junk food and caffeine. I&#39;ve always had some level of insomnia, but it got much worse. The final straw was when I traded sleep for code.\n At this point the stress became a massive black hole in my mind. No other analogy fits. It physically felt crushing. No emotions and no thoughts could escape. I could only go over and over how much it hurt and that I wanted it to stop.This state is what I think of when I hear &#34;Amazombie.&#34;\n During this time I cried. A lot. Usually when going to sleep, as I knew it would just all start again the next day. Sometimes with my wife. A couple of times in the bathroom stall. But no, (you masochists) not at my desk.\n With my brain producing only two thought types (&#34;Pain&#34; and &#34;Please stop pain&#34;), it wasn&#39;t long before thoughts of suicide crept in.\n To be clear: I never took any action on these thoughts. I did not want to kill myself. I kept thoughts of planning away as much as I could. But that&#39;s the thing with suicidal ideation: despite what you really want, the thought comes back again and again and finally replaces &#34;Please stop pain&#34; with &#34;Please stop Everything.&#34; =&gt; The Final Loop.\n  I finally sought psychiatric help. I remember the decision coming so matter-of-fact. Almost with the enthusiasm that you hire a handyman to fix something. &#34;Hm. A leaky pipe. Better get a plumber.&#34; &#34;Ruminating thoughts of ending it? I should have someone to look at that.&#34;\n Up until this point, the only person who knew what was really going on was my wife. I cannot (but will try to) express my gratitude to her during this time. She was there exactly when I needed her. She helped even when she didn&#39;t understand why I was putting myself through it. She saw the signs much sooner than I did and tried to tell me. When I did realize I needed help, she put me in touch.\n I was put on Celexa. Eventually the Death Spiral&#39;s loops unwound. The project launched. Things went back to mostly normal. I went off of Celexa after a couple of months. I didn&#39;t feel fully recovered until months later. I felt on eggshells. I rigorously prioritized self-care by leaving work at 8 hours in, on the dot. I started reaching back out to my friends for hangouts.\n My manager gave me a couple of extra vacation days in return for my efforts. I was promoted to SDE II and was even healthy enough to celebrate and enjoy it.\n  &#34;So what? So you burned yourself out and got burned out. What did you expect?&#34; I wrote this because I needed to put my story down and as a cautionary tale. I am NOT here to set some silly bar of what a &#34;real&#34; programmer does to get things done. I am NOT here to demonize Amazon.\n As far as what I have to say to Amazon/Jeff Bezos, I only have a few things:\n Revisit your bonus/relocation payback strategy. I don&#39;t know what the &#34;right&#34; solution is, but if that&#39;s what you need to keep employees, that&#39;s fucked.\n Be upfront and as precise as possible with what a position entails. &#34;Working alongside smart and passionate people&#34; is lazy hiring.\n Encourage employees to be critical not just of ideas, but also of expectations. Getting them to buy into the idea that they have to give up everything else to get validation from you is abusive.\n Realize that productivity and happy employees is not a zero-sum game. The customer is not a wrathful god that demands a sacrifice\n This cautionary tale is not Amazon-specific. This could happen to nearly anyone, but especially people working in intense workplaces and especially developers working in intense workplaces.\n There&#39;s a saying that I saw over and over again in forums and subreddits, but never believed until I lived it:\n It&#39;s your professional obligation to push back on unreasonable expectations. Your bosses may not like it at first, but they will respect you for it.\n   I know that by posting this anonymously I&#39;m not facilitating a discussion. An anon post is me talking at you.\n However, I wouldn&#39;t be posting in this manner if I wasn&#39;t authentically afraid of losing my job. The only other voices we&#39;ve heard from current employees have been gag-worthy in favor of Amazon:  https://www.linkedin.com/pulse/amazonians-response-inside-amazon-wrestling-big-ideas-nick-ciubotariu,  https://www.linkedin.com/pulse/my-name-brittan-im-amazonian-brittan-cole-ma\n  They&#39;re on LinkedIn. I abhor anything posted on LinkedIn. All criticism is toothless; all words watered down. Because everything is scoured by future employers, everyone is afraid of actually saying anything controversial.\n They&#39;re from employees that aren&#39;t &#34;on the ground,&#34; but rather a manager-of-managers and an HR-rep respectively.\n Does no one else find it interesting that we&#39;re not seeing any negative criticism from current employees? I don&#39;t care what company you work for, there is never any shortage of people willing to complain. So why no negative articles from current employees?\n  There are a few common responses I&#39;ve seen to articles and I would like to pre-empt those here:\n &#34;Working more than exactly 40 hours is part of being a professional.&#34; (and variants thereof)I agree wholeheartedly, but these should be occasional events. 70+ hour weeks shouldn&#39;t be the holding pattern. They should be appreciated by management. Hell, buy us dinner if you&#39;re going to fuck us over a door desk.\n &#34;Why didn&#39;t you just work less? It seems like a lot of it was your own fault.&#34;I go over this question again and again in my own head. Along with the reasons mentioned before, I just felt compelled to push through it. I felt that after getting hired at such a &#34;big name&#34; company, that if I didn&#39;t put everything I could into it that I was doing a disservice to all those who helped me get here. What I didn&#39;t realize was that the opposite was true: that by breaking myself, I did show that I wasn&#39;t ready in a way. Thankfully I did make it through as was able to learn from it.\n &#34;You&#39;re just a ball of negativity, no wonder you got depressed&#34;Which brings me to my next section...\n  In addition to my story, I do want to enumerate the things I enjoy about working at Amazon. I am still working here after all and I have no plans of putting in my notice.\n Lax working hours &amp; can work from home“What?!? After all you just said?!?” But seriously, when things are not in crisis, which is 80%+ of the time, a developer&#39;s day rarely starts before 9am. You can usually work from home about once a week. If you need to leave work early for a good reason, that&#39;s fine (though it&#39;s usually common courtesy to work from home afterward).\n No Dress CodeThis may be a given in most places, but coming from a business-casual-only place, t-shirts are a godsend.\n PayIt has to be mentioned. I won’t give out numbers, as that could be identifying, but Glassdoor.com can satisfy your curiosity. When a good portion of my friends struggle to stay gainfully employed, it is nice. Despite the issues I described above, I still come from a privileged position of being financially stable and now have a good amount of job security.\n Work with and build on top of &#34;giants&#34;One of the common hiring catch phrases of tech companies is to &#34;work alongside smart people.&#34; While I usually roll my eyes at that, it actually is important to a developer&#39;s growth to not always be the smartest one in the room.\n RecruitingJeff Bezos&#39;s email mentioned how we get contacted by recruiters all the time; with that aspect was in touch with our reality. I&#39;ve heard from Google, Facebook, Netflix, and others. I got more recruiting emails in my first month in Seattle than I did in a year in my previous location.\n Near-Instant GratificationThere is something great about having code you wrote be actually executed by thousands of people every day. So few people get to show their friends and family a site they visit often and say &#34;I did that thing there.&#34; Maybe it will wear off eventually, but it&#39;s still my favorite.\n  I&#39;m on a new loaner project now. Another &#34;DEFCON ZEROMG!&#34; project, but now I have boundaries,and the knowledge that Amazon will not topple over if I don’t work 70-hour weeks. Work-life balance can be largely subjective, but I now know what that balance looks like for me and enforce that while still putting my best efforts into my work I had to learn that the hard way. I can only hope you don&#39;t have to as well.", "posttime": "2020-05-22 02:48:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,亚马逊,amazon", "title": "一位亚马逊程序员对在亚马逊工作的看法", "title_en": "An Amazon Programmer's Perspective on Working at Amazon", "transed": 1, "url": "https://gist.github.com/bricker/cb811b3b86d767124801", "via": "", "real_tags": ["程序", "亚马逊", "amazon"]}, {"category": "", "categoryclass": "", "imagename": "5c84145a8365d900d1f3b2014fcb4c0e.png", "infoid": 1003171, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "The Intercept发表了一篇报道，将现实获胜者送进了监狱，烧毁了它的第三个来源。这篇文章是由理查德·埃斯波西托(Richard Esposito)合著的，他是一名嵌入式警察记者，现在是纽约警察局的最高发言人。\n“拦截报”的一篇有争议的报道的合著者将其消息来源送进了监狱，现在他是纽约警察局新闻办公室的负责人。\n这位前记者理查德·埃斯波西托(Richard Esposito)在纽约警察局工作了很长一段时间，与美国警察机构发展了密切的关系，这种关系在拦截行动选择与他合作之前就已经很明显了。然而，新闻网站显然并不认为埃斯波西托的警察友好行为是取消资格，甚至是可疑的。\n埃斯波西托和他的老朋友兼同事马修·科尔(Matthew Cole)是2017年一份关于美国国家安全局(National Security Agency)指控俄罗斯干预2016年美国总统选举的报告的合著者。科尔是The Intercept的全职记者。这些记者向美国政府机构披露了敏感信息，这导致他们的机密消息来源、前美国国家安全局承包商真人秀获得者被曝光，并最终被判入狱五年。\n虽然这个丑闻故事是埃斯波西托在The Intercept上发表的唯一一篇文章，但不知何故，他被分配了一个公司的官方电子邮件地址和一个作者页面，后来在没有任何解释的情况下，这个页面被从网站上删除了。\n同样的二人组，埃斯波西托和科尔，在逮捕和监禁另一名消息来源中央情报局告密者约翰·基里亚库的过程中发挥了不可或缺的作用，几年后他们与拦截组织合作。\n“拦截者”焚烧消息来源的记录远远超出了真人秀获胜者的范畴。2018年，前联邦调查局特工特里·奥尔伯里(Terry Albury)被判处四年监禁，此前他向新闻网站泄露了揭露警察局普遍存在的种族主义和反穆斯林监控做法的文件。揭露FBI的报道的合著者之一科拉·柯里尔(Cora Currier)仍然是The Intercept的编辑。另一位合著者詹娜·麦克劳克林(Jenna McLaughlin)继续与CNN、外交政策(Foreign Policy)和雅虎新闻(Yahoo News)合作。\n接下来，2019年，前美国国家安全局官员丹尼尔·黑尔(Daniel Hale)被大陪审团起诉，罪名是涉嫌泄露文件，显然也是向拦截部门泄露。他将面临长达50年的监禁。\n这种令人不安的模式提出了一个严重的问题，即为什么拦截的来源理查德·埃斯波西托(Richard Esposito)和马修·科尔(Matthew Cole)不断被烧死。是记者们的粗心大意，还是美国政府机构发挥了作用？\n给“拦截”号一个严肃的问题：你是不是秘密为联邦调查局工作？大卫·黑尔，真人秀冠军和特里·奥尔伯里都因为你入狱了。是无能还是你妥协了？你欠很多人一个解释。还有一个道歉。\n由亿万富翁eBay创始人皮埃尔·奥米迪亚(Pierre Omidyar)拥有和资助的Intercept因其对爱德华·斯诺登(Edward Snowden)泄密事件的处理而受到严厉批评。该网站在可疑情况下关闭了对这位著名举报人的国安局文件宝藏的访问，此前只发布了其中的一小部分。奥米德亚是一位与美国政府支持的政权更迭网络有广泛联系的大型科技寡头，他似乎已经有效地将斯诺登的泄密事件私有化，其中绝大多数永远不会曝光。\n奥米德亚自己的观点与一位激进的公民自由主义者的观点并不完全一致。2009年，这位亿万富翁在推特上表示，科技新闻网站“TechCrunch”和任何发布被盗信息的人都应该帮助抓获窃贼。我不应该把酒吧放在第一位。“。维基解密和其他透明组织已经注意到了这一点。\n皮埃尔·奥米迪亚(Pierre Omidyar)在2009年：“任何发布被盗信息的人都应该帮助抓住窃贼”http://t.co/CoaSUoreG4。\n美国政府情报机构也在“拦截”的报告中发现了用处。早在2017年，中情局局长迈克·庞皮欧(Mike Pompeo)在对维基解密(WikiLeaks)及其现已入狱的出版商朱利安·阿桑奇(Julian Assange)进行猛烈攻击时，引用了中情局局长迈克·庞皮欧(Mike Pompeo。\n在鹰派智库战略与国际研究中心(CSIS)的一次演讲中，庞皮欧两次引用了拦截的比德尔的话，将维基解密描绘成不可靠的，并淡化其出版物的重要性。\n比德尔是截取文章的另一位合著者，这篇文章导致真人秀获胜者入狱。\n他的前同事从记者过渡到纽约警察局的公关主管，这让人进一步担心“拦截”、它的编辑判断，以及它的一些撰稿人与美国警察机构培育的关系。\n2017年6月5日，The Intercept公布了一份从美国国家安全局(National Security Agency)泄露的绝密文件，其中声称俄罗斯军事情报机构试图通过涉嫌黑客和网络钓鱼来干预2016年11月的美国大选。\n批评人士认为，这篇文章被过度炒作，缺乏确凿的证据，是由理查德·埃斯波西托(Richard Esposito)和三名全职拦截工作人员共同撰写的：马修·科尔(Matthew Cole)、萨姆·比德尔(Sam Bdle)和瑞安·格里姆(Ryan Grim)。\n就在新闻网站发布这篇报道的几分钟后，美国司法部宣布在发布前两天逮捕了被指控的泄密者。它确认她是一名情报专家和美国国家安全局承包商，名为Reality Leigh Winner。\n由于截获的粗心大意，联邦调查局很容易就能证明文件来自温纳的工作电脑，她曾用这台电脑与记者直接沟通。温纳认罪；2018年8月，她被判处五年以上监禁。\n安全专家和记者严厉批评拦截计划的草率和未能采取基本措施保护其来源。原来，与该网站合作的一名记者已经联系了NSA承包商和NSA本身，希望确认泄露文件的真实性。这位记者鲁莽地披露了联邦执法部门立即用来识别获胜者的关键信息，包括她的居住城市、情报报告编号，以及文件的物理打印输出，其中包含识别其来源的Microdot元数据信息。\n维基解密对截获行动的疏忽感到愤怒，悬赏1万美元，“悬赏10,000美元，以获得导致这名‘记者’被公开曝光和解职的信息。”\n在监狱里，Winner似乎过得不太好。她的母亲Billie Winner-Davis说，由于冠状病毒大流行而导致的监狱封锁“对她和所有囚犯都产生了最糟糕的影响”。\n我女儿#RealityWinner今天已经打了2次电话了。她不太好。监狱的封锁对她和所有囚犯造成了最坏的影响。想象一下被锁在里面，看不到尽头的情景。她被拒绝接受心理治疗。她没有吃东西。我很害怕。pic.twitter.com/bKMpqe72v5。\n灰色地带联系了Winner-Davis，让她知道帮助她女儿入狱的一名拦截记者现在是纽约警察局的一名高级官员。听到这个消息，她大吃一惊，同时也惊讶地得知，合著者理查德·埃斯波西托(Richard Esposito)和马修·科尔(Matthew Cole)在中情局泄密者约翰·基里亚库(John Kiriakou)入狱的事件中也发挥了关键作用。\n“这是非常令人震惊的，”赢家-戴维斯告诉“灰色地带”。“我知道，参与现实案件的同一批记者还揭露了另一个消息来源。我不知道那是约翰·基里亚库。“。\n温纳-戴维斯补充说：“听说埃斯波西托现在是纽约警察局的人非常令人不安，这确实让我想知道，在处理她匿名发送的信息时，他站在哪一边。”“事后看来，我也很想知道”拦截者“是否知道，以及他们的印象如何。”\n灰色地带通过电子邮件截获了一份请求置评的邮件。截至发稿时，它没有回复。\n在真人秀获胜者在监狱中受苦受难的同时，让她入狱的那篇拦截文章的四名合著者之一、前记者理查德·埃斯波西托(Richard Esposito)被提升为纽约市警察局的最高公关职位。\n埃斯波西托在成为美国最大的警察部队之前，曾在主流企业媒体工作过很长时间(前市长迈克尔·布隆伯格(Michael Bloomberg)曾吹嘘过，美国警察部队实际上是“世界第七大军队”)。埃斯波西托作为一名自称的调查记者成名，专注于犯罪和国家安全，在警察和情报机构内部拥有一系列消息来源。他在NBC新闻、ABC新闻、纽约每日新闻和纽约邮报工作了几年。\n埃斯波西托的报道在很大程度上依赖于美国国家安全州的消息来源，并倾向于服务于他们的利益。它得到了奖励，获得了五项艾美奖和一项普利策奖。\n到2020年1月，埃斯波西托宣布他已经换了一份新工作：纽约警察局负责公共信息的副局长。纽约市政府官方网站指出，埃斯波西托的办公室“与当地、国家和国际媒体组织合作”，致力于“与媒体建立牢固的关系，向记者通报情况”。\n我很荣幸地欢迎理查德·埃斯波西托来到纽约警察局，他今天下午宣誓就任我们警察局的首席发言人：@NYPDDCPI。\n前纽约警察局局长、“破窗”警务先驱比尔·布拉顿(Bill Bratton)庆祝埃斯波西托的新任命，祝贺他的“30多年的朋友”-明确表示他与这位前记者的亲密关系可以追溯到几十年前。\n很高兴在今天上午的公民犯罪委员会早餐会上见到新任命的纽约市警察局公共信息副局长理查德·埃斯波西托(@REspositoNYC)，并祝贺我交往了30多年的朋友获得任命。pic.twitter.com/U5oaIW4IM8。\n埃斯波西托在推特上发布了一张自己与纽约警察局情报和反恐主管约翰·米勒(John Miller)的照片，以纪念这一新职位。他指出，米勒也是他的“30多年的朋友”。\n这条推文特别具有象征意义，因为两人都是美国企业媒体圈和警察部门之间旋转门的教科书例子。\n和埃斯波西托一样，约翰·米勒也是一名前记者，与警察机构有着广泛的亲密关系。米勒曾担任纽约警察局的首席发言人，然后转到ABC新闻担任记者和主播(这让他来到阿富汗接受奥萨马·本·拉登(Osama Bin Laden)的采访)。米勒还曾在联邦调查局、国家情报总监办公室和洛杉矶警察局工作过，然后转到哥伦比亚广播公司新闻频道，最后又回到了纽约警察局。\n宣誓就任纽约警察局公共信息副局长。讲台上坐在我30多年的朋友约翰·米勒(John Miller)旁边，他是反恐与情报公司的华盛顿特区。当日颜色：显然是纽约警察局的蓝色pic.twitter.com/8rQYswmkMz\n这段历史提出了一个问题：埃斯波西托、他的老朋友米勒和其他经常光顾旋转门的人是真正的独立记者，还是警察的公关侧翼？而“拦截”(The Intercept)这份自称出版“无畏、敌对、追究权势人物责任的新闻”的刊物，为什么会与美国警察机构在媒体上最亲密的盟友之一合作呢？\n埃斯波西托是“拦截”记者马修·科尔的长期同事。早在2009年，两人就在ABC新闻一起工作，撰写了一些不加批判地呼应美国军方和情报官员的报道，并证明了中情局在海外的行动是合理的。\n他们的报告清楚地表明，埃斯波西托和科尔在中央情报局和其他警察和情报机构有非常高级别的消息来源。他们几乎所有的独家新闻都来自这些匿名官员，记者们倾向于避免咬牙切齿。\n2013年，当埃斯波西托转到NBC新闻领导其调查部门时，他把科尔也带来了。\n在NBC，埃斯波西托和科尔的合作产生了一系列故事，令人喘不过气来呼应匿名的美国军方和情报官员，炒作所谓的恐怖主义威胁，粉饰奥巴马政府的无人机暗杀计划。\n与美国广播公司的情况一样，埃斯波西托和科尔在NBC发表的绝大多数故事都是由美国情报官员提供给他们的。\n也就是说，直到一位名为爱德华·斯诺登(Edward Snowden)的美国国家安全局泄密者揭露了一个全球大规模监控项目，震惊了世界。\n但在2014年，他们与记者格伦·格林沃尔德(Glenn Greenwald)合作，在NBC发布了揭露英国情报机构如何监视社交媒体网站的文件。格林沃尔德可以接触到斯诺登的文件。\n格林沃尔德、埃斯波西托和科尔随后发表了一份关于英国间谍如何使用病毒、黑客和诱捕蜜罐等“肮脏伎俩”来追捕目标的报告。\n当时，格林沃尔德刚刚将拦截器送入地面。科尔随后被聘为特约调查记者，这一职位他至今仍保持不变。\n2015年，当科尔离开美国全国广播公司新闻频道(NBC News)前往The Intercept时，他在推特上写了一篇帖子，对他的前老板埃斯波西托赞不绝口，他称埃斯波西托是“我认识的最好的记者&一个伟大的朋友。”\n作为回报，埃斯波西托写道：“祝你下一章一切顺利！”\n尽管他们多年来第一次没有在同一个办公室工作，但埃斯波西托和科尔再次合作只是个时间问题。\n2016年10月，埃斯波西托离开了NBC新闻。他成立了自己的公司Roundhouse Productions，并开始从事自由职业。埃斯波西托的密友兼同事马修·科尔(Matthew Cole)似乎在2017年把他带到了拦截行动，以撰写一个让真人秀获胜者入狱五年的故事。\n事实上，这是埃斯波西托和科尔第二次焚烧他们的线人，并将他们关进监狱。早在2012年，这两人就参与了对约翰·基里亚库(John Kiriakou)的逮捕，基里亚库是一名揭露中情局酷刑的举报人-他是中情局唯一名因残酷的“强化审讯”计划而服刑的间谍机构成员。\n根据Politico 2012年的一篇报道，在ABC新闻的日子里，美国政府确认埃斯波西托和科尔是基里亚库泄露信息的记者。由于他们的疏忽，Kiriakou最终被判入狱30个月(尽管他在服刑近24个月后于2015年初获释)。\n自那以后，基里亚库明确表示，他认为科尔应该为自己在监狱里的时间负责，他说：“我是因为马修·科尔而入狱的。”\n基里亚库在推特上写道：“”拦截“的马修·科尔(Matthew Cole)烧我是为了[保全]他自己的皮。”“要不然，他为什么要向联邦调查局出卖我，在大陪审团面前指证我呢？”\n当“拦截”发表了NSA的报道，真人秀冠军被逮捕时，Kiriakou公开谴责该新闻网站，说它“应该为自己感到羞耻”。马修·科尔烧了另一个来源。这会让你的整个组织变得不值得信任。“。\n他告诉“拦截报”，“如果你是认真的，你今天就解雇马修·科尔。”\n。@theintercept应该为自己感到羞耻。马修·科尔烧了另一个来源。这会让你的整个组织变得不可信赖。\n灰色地带联系了基里亚库，告诉他埃斯波西托现在与纽约警察局合作。“读到这个，我大吃一惊。我的嘴真的张开了，“基里亚库回答说。\n基里亚库透露，当记者揭露基里亚库时，他之前担任分析师的ABC新闻实际上已经解雇了马修·科尔(Matthew Cole)。ABC新闻并不知道科尔在一边秘密与关塔那摩湾在押人员的律师合作，双重引用他的信息。Politico证实了这一点，当时报道说，科尔一直“横跨传统新闻工作和为关塔那摩在押人员代理律师收集信息之间的界限”。\n在失去在ABC的工作后，正是埃斯波西托把科尔带到了NBC。(埃斯波西托显然每年获得近100万美元的报酬，以领导那里的调查单位。)\nKiriakou补充说，在埃斯波西托背叛他并将他送进监狱之前，他实际上一直是埃斯波西托的朋友。\n基里亚库说，埃斯波西托与美国警察部队关系密切，这是众所周知的事情。基里亚库在谈到埃斯波西托时说，“他的心一直放在执法上。”“他认为自己尽可能接近成为一名警察，而不是真正成为一名警察。”\n埃斯波西托的职业生涯始于报道警察；他最好的朋友是警察；他经常与高级警官出去喝酒。基里亚库回忆说，每个认识埃斯波西托的人都知道这一点。\n基里亚库指出，埃斯波西托和科尔在安全方面都很草率，也没有保护他们的消息来源。但他表示，科尔的行为特别可疑。\n基里亚库说，他认为科尔与美国情报机构关系太近，并重申了他要求拦截局解雇他的呼吁。\n目前尚不清楚哪位记者真人秀获胜者将美国国家安全局的文件泄露给了谁。但考虑到理查德·埃斯波西托(Richard Esposito)是被邀请单独发表这篇报道的，他似乎是一个很好的候选人。\n获胜者的故事仍然在“拦截”网站上发布。然而，奇怪的是，埃斯波西托的个人资料却被从网站上删除了。\n这篇文章的其他三位合著者有The Intercept的简历，但没有Esposito。\nGrayzone搜索了Wayback Machine，发现Esposito之前在Intercept上有一个作者页面，但它被删除了。\n这很奇怪，因为每个为“拦截”撰稿的人，甚至是自由职业者，都会得到一个作者页面，上面有个人简介和一系列文章，这几乎是所有主要新闻网站的惯例。(例如，几年前，我曾为The Intercept做过几次自由撰稿人，现在仍然有一份个人简介，尽管我从未在那里担任过工作人员。)。\nEsposito不仅有一个作者页面，他还拥有一个官方的Intercept电子邮件账户：richard.esposito@theintercept.com，这一事实进一步加剧了谜团。该账号在他现已删除的作者页面上公开列出。纯粹的自由职业者无法在The Intercept获得电子邮件帐户；Esposito显然与该出版物有更深的关系。\nGrayzone联系了The Intercept，询问为什么埃斯波西托的个人资料被删除，为什么他有一封官方电子邮件，以及他与该网站的关系。拦截号没有回复。\n围绕着真人秀获胜者的泄密和“拦截”拙劣的故事，有许多警告信号和悬而未决的问题。\n早在2017年，Winner被捕后，一名前美国政府举报人立即敲响了警钟。前国务院官员彼得·范布伦揭露了伊拉克战争中的腐败行为，随后经历了一场恶毒的恐吓运动，他发表了一篇博客文章，题为“嘿，拦截，真人秀获胜者和美国国家安全局的泄密事件出了很大的问题。”\n范布伦指出，美国情报界几乎将从这起丑闻的一切中受益。他指出，温纳是一名年轻的分析师，在空军有阿富汗事务的背景，他可以接触到所谓的俄罗斯黑客行为的绝密信息，这是多么奇怪。\n范布伦还觉得奇怪的是，美国国家安全局兴高采烈地向“拦截”确认了这份文件的真实性。爱德华·斯诺登和切尔西·曼宁泄露的材料官方未经核实。但“美国国家安全局非常希望你知道这是真的，”范布伦说，他指的是获胜者的文件。在没有提供任何证据的情况下，美国国家安全局的这份单独的报告帮助助长了俄罗斯据称干预2016年美国大选的歇斯底里情绪。\n在这篇文章发表的时候，也有很多关于理查德·埃斯波西托本人的警告信号。\n虽然埃斯波西托直到2020年1月才正式加入纽约警察局，但早在那之前就有堆积如山的证据表明，他与美国警察部队的线人关系异常密切。\n埃斯波西托丝毫没有掩饰他与警察的亲密关系。事实上，他几乎是在炫耀。\n埃斯波西托花了一年的时间。\n..", "note_en": "The Intercept published a story that landed Reality Winner in prison, burning its third source. That article was co-authored by Richard Esposito, an embedded police reporter who is now the NYPD’s top spokesperson.\n   A co-author of a controversial report at The Intercept that landed its source in prison now works as the head of the New York Police Department’s press office.\n The former journalist, Richard Esposito, had embedded for a long period inside the NYPD, developing close ties to US police agencies that were clear before The Intercept chose to work with him. However, the news website apparently did not see Esposito’s cop-friendly behavior as disqualifying or even suspicious.\n Esposito and his longtime friend and colleague, Matthew Cole, a full-time reporter at The Intercept, were co-authors of a  2017 report on National Security Agency allegations of Russian meddling in the 2016 US presidential election. The reporters disclosed sensitive information to US government agencies, which led to the outing of their confidential source, former NSA contractor Reality Winner, and her eventual imprisonment for five years.\n Although this scandalous story was the only piece Esposito published at The Intercept, he was somehow assigned an official company email address as well as an author page that has since been removed from the website without explanation.\n The same duo, Esposito and Cole, played an integral role in the arrest and imprisonment of another source,  CIA whistleblower John Kiriakou, several years before they worked with The Intercept.\n  The Intercept’s record of burning sources extends well beyond Reality Winner. In 2018, former FBI agent  Terry Albury was sentenced to  four years in prison, after he leaked documents to the news website exposing the police agency’s widespread racism and anti-Muslim surveillance practices. One of the co-authors of the reports exposing the FBI, Cora Currier, remains an editor at The Intercept. The other co-author, Jenna McLaughlin, went on to work with CNN, Foreign Policy, and Yahoo News.\n Next, in 2019, former  NSA official Daniel Hale was indicted by a grand jury for allegedly leaking documents, also apparently to The Intercept. He faces up to  50 years in prison.\n The troubling pattern raises serious questions about why sources of The Intercept, Richard Esposito, and Matthew Cole keep getting burned. Is it mere carelessness on the part of the reporters, or have US government agencies played a role?\n Serious question for The Intercept: Do you secretly work for the FBI? David Hale, Reality Winner and Terry Albury are all in prison because of you. Is it incompetence or are you compromised? You owe a lot of people an explanation. And an apology.\n  The Intercept, which is owned and financed by billionaire eBay founder Pierre Omidyar, was heavily criticized for its handling of the Edward Snowden leaks. The website  shut down access to the renowned whistleblower’s trove of NSA documents under  suspicious circumstances, after publishing just a small fraction of them. Omidyar, a Big Tech oligarch with extensive  links to US government-backed regime-change networks, appears to have effectively privatized Snowden’s leaks, the vast majority of which will never see the light of day.\n Omidyar’s own views do not exactly match those of a radical civil libertarian. In 2009, the billionaire tweeted that the technology news website “TechCrunch and anybody else who pubs stolen info  should help catch the thief. Shldnt pub in the 1st place.”  WikiLeaks and other transparency organizations have taken notice.\n Pierre Omidyar in 2009: “Anybody who publishes stolen info should help catch the thief”  http://t.co/CoaSUoreG4\n  US government intelligence agencies have also found utility in The Intercept’s reporting. Back in 2017, none other than  CIA Director Mike Pompeo cited The Intercept, quoting an article by its reporter Sam Biddle, in his withering attack on WikiLeaks and its now imprisoned publisher Julian Assange.\n In a  speech at the hawkish think tank the Center for Strategic and International Studies (CSIS), Pompeo twice quoted The Intercept’s Biddle to portray WikiLeaks as unreliable and downplay the importance of its publications.\n  Biddle is another co-author of The Intercept article that resulted in Reality Winner’s imprisonment.\n His former colleague’s transition from journalist to the head of PR for the NYPD brings up further concerns about The Intercept, its editorial judgement, and the relationships some of its contributors nurtured with US police agencies.\n  On June 5, 2017, The Intercept published a top-secret document leaked from the National Security Agency, which claimed that  Russia’s military intelligence services attempted to meddle in the November 2016 US election through alleged hacking and phishing.\n The article, which critics argued was  over-hyped and  lacked firm evidence, was co-authored by Richard Esposito and three full-time The Intercept staffers: Matthew Cole, Sam Biddle, and Ryan Grim.\n Mere minutes after the news website released the story, the US Department of Justice announced that it had arrested the alleged leaker two days before publication. It identified her as an intelligence specialist and NSA contractor named Reality Leigh Winner.\n Due to the  carelessness of The Intercept, the FBI was easily able to prove the document came from Winner’s work computer, which she had used to directly communicate with the journalists. Winner pleaded guilty; in August 2018, she was sentenced to more than five years in prison.\n Security experts and journalists harshly criticized The Intercept for its sloppiness and failure to take basic measures to protect its source. It turned out that a reporter working with the website had contacted both an NSA contractor and the NSA itself in hopes of confirming the authenticity of the leaked document. The journalist recklessly  disclosed critical information that federal law enforcement immediately used to identify Winner, including her city of residence, the intelligence report number, and a physical printout of the document with microdot metadata information that identified its origin.\n In outrage at The Intercept’s negligence, WikiLeaks offered a  $10,000 reward “for information leading to the public exposure &amp; termination of this ‘reporter.&#39;”\n In prison, Winner does not appear to be faring well. Her mother, Billie Winner-Davis, has said the lockdown of the prison due to the coronavirus pandemic “is having the worst possible impact on her &amp; all inmates.”\n  My daughter  #RealityWinner called 2x already today. SHE IS NOT OK.  The lockdown of the prison is having the worst possible impact on her &amp; all inmates. Imagine being locked inside with no end in sight.  She has been denied psych treatment. She is not eating. I am scared.  pic.twitter.com/bKMpqe72v5\n  The Grayzone contacted Winner-Davis to let her know that one of The Intercept journalists that helped land her daughter in prison is now a top official at the New York Police Department. She was flabbergasted to hear the news, and was also surprised to learn that the co-authors Richard Esposito and Matthew Cole had played a key role in CIA whistleblower John Kiriakou’s imprisonment as well.\n “ That is very shocking,” Winner-Davis told The Grayzone. “ I knew that the same journalists involved in Reality’s case had also exposed another source. I was not aware that it was John Kiriakou.”\n “ Hearing that Esposito is now NYPD is very troubling and does make me wonder which side he was on during the handling of the information she sent anonymously,” Winner-Davis added. “I also would be curious to know if the Intercept knows and what their impression is, in hindsight.”\n The Grayzone emailed The Intercept with a request for comment. It did not reply as of publication.\n  While Reality Winner languished in prison, one of the four co-authors of The Intercept article that landed her behind bars, former journalist Richard Esposito, was promoted to the top communications position in the New York City Police Department.\n Esposito had a long career in mainstream corporate media before his move to the largest police force in the US (which former Mayor Michael Bloomberg once boasted is effectively “the  seventh largest army in the world“). Esposito made his name as a self-described investigative reporter focused on crime and national security, boasting an array of sources within police and intelligence agencies. He worked several for years at NBC News, ABC News, the New York Daily News, and the New York Post.\n Esposito’s reporting relied heavily on sources within the US national security state, and tended to serve their interests. And it was rewarded, with five Emmy Awards and a shared Pulitzer Prize.\n By January 2020, Esposito announced that he had moved on to a new job: the  NYPD’s deputy commissioner for public information. The official New York City government website notes that  Esposito’s office “works with local, national, and international media organizations,” and is dedicated to “building strong relationships with the media, briefing reporters.”\n It’s my honor to welcome Richard Esposito to the NYPD as he’s sworn in this afternoon as our police department’s chief spokesman:  @NYPDDCPI.\n  Former NYPD commissioner, and  “Broken Windows” policing pioneer, Bill Bratton celebrated Esposito’s new appointment, congratulating his “friend of over 30 years” – making it clear that his cozy relationship with the former reporter goes back decades.\n Nice to see newly appointed NYPD Deputy Commissioner of Public Information Richard Esposito ( @REspositoNYC) at this morning’s Citizen Crime Commission Breakfast and congratulate my friend of over 30 years on his appointment.  pic.twitter.com/U5oaIW4IM8\n  Esposito marked the new position by tweeting a photo of himself next to John Miller, the head of intelligence and counter-terror for the NYPD, whom he noted was also his “friend of more than 30 years.”\n This tweet is particularly emblematic, because both men are textbook examples of the  revolving door between US corporate media circles and police departments.\n Like Esposito,  John Miller is a former journalist with an extensive history of intimate relations with police agencies. Miller served as the NYPD’s chief spokesman, then moved to ABC News to work as a reporter and anchor (which brought him to Afghanistan for an  interview with Osama bin Laden). Miller also worked at the FBI, the office of the Director of National Intelligence, and the LAPD, before moving to CBS News, and then finally back again to the NYPD.\n Sworn in as Deputy Commissioner Public Information NYPD. On the dais next to my friend of more than 30 years: John Miller, DC of Counterterror &amp; Intell. Color of the day: apparently NYPD Blue  pic.twitter.com/8rQYswmkMz\n  This history raises the question: Are Esposito, his longtime friend Miller, and other frequenters of the revolving door actual independent journalists, or PR flacks for the cops? And why would The Intercept, a publication that markets itself as publishing “fearless, adversarial journalism that holds the powerful accountable,” collaborate with one of US police agencies’ closest allies in the media?\n   Esposito is a longtime colleague of The Intercept reporter Matthew Cole. The two worked together at ABC News as far back as  2009, filing stories that uncritically echoed US military and  intelligence officials and justify  CIA operations abroad.\n Their reports made it clear that Esposito and Cole had very  high-level sources in the  CIA and other police and intelligence agencies. Virtually all of their scoops came from these  anonymous officials, and the reporters tended to avoid biting the hand that fed them.\n When Esposito moved over to NBC News in 2013 to lead its investigative unit, he brought Cole with him.\n At NBC, the Esposito-Cole partnership produced a string of stories that breathlessly echoed anonymous US military and intelligence officials, hyping up supposed  terrorist threats and whitewashing the  Obama administration’s drone assassination program.\n As had been the case at ABC, the vast majority of stories Esposito and Cole published at NBC were fed to them by  US intelligence officials.\n That is, until an NSA whistleblower named Edward Snowden shocked the world with leaks exposing a global mass surveillance program.\n  But in 2014, they collaborated with journalist Glenn Greenwald, who had access to the Snowden files, to publish documents at NBC that exposed how British intelligence agencies were  spying on social media websites.\n Greenwald, Esposito, and Cole then followed up with a report on how  British spies used “dirty tricks” like viruses, hacking, and honey traps to go after their targets.\n   At the time, Greenwald was just getting The Intercept off the ground. Cole was subsequently brought on board as a staff investigative reporter, a position he maintains today.\n When Cole left NBC News for The Intercept in 2015, he wrote a Twitter thread  heaping praise on his former boss Esposito, whom he called “the finest reporter I’ve known &amp; a great friend.”\n Esposito returned the favor, writing, “wish you the best on this next chapter!”\n Although they weren’t working in the same office for the first time in years, it was only a matter of time until Esposito and Cole collaborated again.\n    In October 2016, Esposito left NBC News. He formed his own company, Roundhouse Productions, and began freelancing. Esposito’s close friend and colleague Matthew Cole appeared to bring him over to The Intercept in 2017 to work on the story that put Reality Winner in prison for five years.\n This was in fact the second time that Esposito and Cole had burnt their sources and landed them behind bars. Back in 2012, the duo were involved in the arrest of John Kiriakou, a whistleblower who exposed CIA torture – and who was the only member of the spy agency to serve time over the brutal “enhanced interrogation” program.\n According to a 2012 report in  Politico, Esposito and Cole were identified by the US government, during their ABC News days, as the journalists to whom Kiriakou leaked information. Due to their negligence, Kiriakou ended up in prison on a 30-month sentence (although he was released early in 2015, after serving nearly 24 months).\n Kiriakou has since made it clear that he holds Cole responsible for his time in prison, stating, “I went to  prison courtesy of Matthew Cole.”\n “Matthew Cole of The Intercept burned me to [save] his own skin,”  Kiriakou has tweeted. “Why else would he rat me out to the FBI and put a cherry on top by testifying against me before the grand jury?”\n When The Intercept published its NSA story and Reality Winner was arrested, Kiriakou publicly condemned the news website, saying it “should be ashamed of itself.  Matthew Cole burns yet another source. It makes your entire organization untrustworthy.”\n He told The Intercept, “If you’re serious, you’ll fire Matthew Cole today”\n . @theintercept should be ashamed of itself. Matthew Cole burns yet another source. It makes your entire organization untrustworthy.\n  The Grayzone reached out to Kiriakou to inform him that Esposito now works with the NYPD. “I was flabbergasted to read this. My mouth was literally hanging open,” Kiriakou responded.\n Kiriakou revealed that ABC News, where he had previously worked as an analyst, had in fact fired Matthew Cole when the reporter outed Kiriakou. ABC News had not known that Cole was secretly working with the attorneys of Guantánamo Bay detainees on the side, double-dipping his information.  Politico confirmed this, reporting at the time that Cole had been “straddling the line between traditional journalism and information gathering for lawyers representing Guantánamo detainees.”\n After he lost his job at ABC, it was Esposito that brought Cole over to NBC. (Esposito had apparently been offered nearly $1 million per year to lead the investigative unit there.)\n Kiriakou added that he had in fact been a friend of Esposito – before the journalist betrayed him and sent him to prison.\n Kiriakou said it was public knowledge that Esposito was close to US police forces. “His heart was always in law enforcement,” Kiriakou said of Esposito. “He considered himself as close to being a cop as he could without actually being a cop.”\n Esposito started his career reporting on police; his best friends were cops; and he regularly went out drinking with top police officials. Kiriakou recalled that everyone who knew Esposito knew this.\n  Kiriakou noted that both Esposito and Cole were sloppy with security, and did not protect their sources. But he said Cole’s behavior was especially suspicious.\n Kiriakou said he believes Cole is too close to US intelligence agencies, and reiterated his call for The Intercept to fire him.\n  It remains unclear which reporter Reality Winner leaked the NSA document to. But given that Richard Esposito was brought on to publish that story alone, he seems like a good candidate.\n The Winner story is still online at The Intercept. Curiously, however, Esposito’s bio has been removed from the website.\n The other three co-authors of the article have bios at The Intercept, but not Esposito.\n The Grayzone searched through the Wayback Machine and found that  Esposito previously had an author page at The Intercept, but it was removed.\n  This is strange, because everyone who contributes pieces to The Intercept, even freelancers, gets an author page with a bio and a list of articles, as is customary for virtually all major news websites. (I, for instance, freelanced a few times for The Intercept several years ago, and still have a bio, although I have never been on staff there.)\n Further compounding the mystery is the fact that Esposito did not just have an author page; he also held an official Intercept email account: richard.esposito@theintercept.com. The account was publicly listed at his now-removed author page. Mere freelancers don’t get email accounts at The Intercept; Esposito clearly had a deeper relationship with the publication.\n The Grayzone contacted The Intercept to ask why Esposito’s bio was removed, why he had an official email, and what his relationship was with the website. The Intercept did not reply.\n  There are many warning signs and unanswered questions surrounding the Reality Winner leak and The Intercept’s bungling of the story.\n Back in 2017, immediately after Winner was arrested, a former US government whistleblower rang alarm bells. Peter van Buren, an ex-State Department official who exposed corruption in the Iraq War, and subsequently endured a  vicious intimidation campaign, published a blog post titled “ Hey Intercept, Something is Very Wrong with Reality Winner and the NSA Leak.”\n Van Buren noted that the US intelligence community stood to benefit from virtually everything about the scandal. He noted how strange it was that Winner, a young analyst with a background in Afghan affairs in the Air Force, would have access to top-secret information on alleged Russian hacking.\n Van Buren also found it odd that the NSA gleefully confirmed the authenticity of the document to The Intercept. The materials leaked by Edward Snowden and Chelsea Manning are officially unverified. But the “NSA wants you to very much know it is real,” Van Buren said, referring to Winner’s document. Without providing any evidence, the lone NSA report helped feed the hysteria that Russia purportedly meddled in the 2016 US election.\n At the time of the article’s publication, there had also been many warning signs about Richard Esposito himself.\n While Esposito did not officially join the NYPD until January 2020, there was a mountain of evidence well before then that he was unusually close to his sources in US police forces.\n Esposito did nothing to conceal his cozy relationship with the cops. In fact, he practically flaunted it.\n Esposito spent a year working \n......", "posttime": "2020-05-22 02:46:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新闻官,press,拦截", "title": "纽约警察局新闻官与人共同撰写了拦截真人秀获胜者的故事", "title_en": "New NYPD press officer co-wrote The Intercept Reality Winner story", "transed": 1, "url": "https://thegrayzone.com/2020/05/20/the-intercept-reality-winner-richard-esposito-nypd/", "via": "", "real_tags": ["新闻官", "press", "拦截"]}, {"category": "", "categoryclass": "", "imagename": "780abc20a95dff06cf0f090a7a616604.jpg", "infoid": 1003169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特(Twitter)首席执行官杰克·多尔西(Jack Dorsey)捐赠的500万美元将用于前民主党总统候选人安德鲁·杨环球基本收入(Andrew Yang Universal Basic Income)发起的冠状病毒救济项目发放的数千笔“小额赠款”，共和国民主党人团结在每月1000张救济支票的背后，佩洛西试图为下一项冠状病毒法案More的非营利组织“人道前进”(Human Forward)争取党团会议。\n多尔西在杨致远周四推出的播客“杨致远说”中宣布了他的捐款。\n多尔西的捐款将用于人类前进的直接现金援助计划，在冠状病毒大流行期间向近2万人提供250美元的小额赠款，该非营利性组织周四宣布。\n向@HumanityForward捐赠500万美元，立即向近2万名因冠状病毒大流行而失去工作或遭受经济打击的人发放250美元的小额现金赠款。感谢@AndrewYang！&#34；他在推特上写道。\n500万美元给@HumanityForward，立即向近2万名因冠状病毒大流行而失去工作或遭受经济打击的人发放250美元的小额现金赠款。谢谢你@AndrewYang！https://t.co/ABTJDpAcLx。\n-Jack(@jack)2020年5月21日。\n这笔捐款是多尔西的Start Small LLC的一部分，这是他上个月发起的一个10亿美元的基金会，以支持全球冠状病毒救援工作。\n杨在一份声明中说：“杰克的捐赠不仅将直接影响当前经济低迷时期数以万计的有需要的人，还将帮助人类向前发展，我们的运动将继续为美国的普遍基本收入(UBI)辩护。”我们知道，每个美国人的UBI都是可能的，这笔500万美元的从小开始将有助于展示全国各地的家庭都有可能实现的目标。“。\n据非营利组织仁人前进(Human Forward)的网站称，该组织的冠状病毒救济基金计划向受冠状病毒危机影响最严重的个人和家庭提供一次性和经常性的基本收入支付。\n该计划与杨致远对全民基本收入的支持是一致的，这是他总统初选的核心提议。\n在周四的播客中，多尔西在企业家们的一次对话中表示支持杨的竞选提议。\n“每一个领域都将被自动化触及，而UBI对我来说代表着一层楼。一层楼，人们可以站在上面，拥有知识和内心的平静，在他们学习如何过渡到这个新世界的同时，他们可以生存，吃饭和喂养他们的孩子，“多尔西说。", "note_en": "A $5 million donation from Twitter CEO  Jack Dorsey will go toward thousands of “micro-grants” distributed by a  COVID-19 relief program launched by former Democratic presidential candidate   Andrew Yang      Universal basic income and the end of the republic   Democrats rally behind monthly ,000 relief checks  Pelosi seeks to wrangle caucus behind next COVID-19 bill  MORE ’s nonprofit Humanity Forward.\n Dorsey announced his donation on an episode of Yang’s podcast, “Yang Speaks,” that launched Thursday.\n Dorsey’s donation will go toward Humanity Forward’s direct cash assistance program, providing $250 micro-grants to nearly 20,000 people amid the coronavirus pandemic, the nonprofit announced Thursday.\n   &#34;$5mm to   @HumanityForward to immediately distribute small cash grants of $250 to nearly 20,000 people who’ve lost their jobs or taken an economic hit as a result of the COVID-19 pandemic. Thank you   @AndrewYang  !&#34; he tweeted.\n  $5mm to  @HumanityForward to immediately distribute small cash grants of $250 to nearly 20,000 people who’ve lost their jobs or taken an economic hit as a result of the COVID-19 pandemic. Thank you  @AndrewYang!  https://t.co/ABTJDpAcLx\n— jack (@jack)  May 21, 2020\n  The donation is part of Dorsey’s Start Small LLC, a $1 billion foundation he  launched last month to support global COVID-19 relief efforts.\n  “Not only will Jack’s donation directly impact tens of thousands of people in need during the current economic downturn, it will help Humanity Forward and our movement continue to make a case for Universal Basic Income (UBI) in the United States,” Yang said in a statement. “We know UBI for every American is possible, and this $5 million from Start Small is going to help demonstrate what is possible for families across the country.”\n Humanity Forward’s coronavirus relief fund plans to delivering both one-time and recurring basic income payments to individuals and families most impacted by the coronavirus crisis, according to the nonprofit&#39;s website.\n  The program is in line with Yang’s support for universal basic income, which was a central proposal of his presidential primary campaign.\n Dorsey showed support for Yang’s campaign proposal during a conversation the entrepreneurs had on the Thursday podcast.\n “Every single field is going to be touched by automation, and UBI to me represents a floor. A floor that people can stand on, and have the knowledge and peace of mind that they could survive and eat and feed their children while they are learning how to transition into this new world,” Dorsey said.", "posttime": "2020-05-22 02:31:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收入,basic,冠状病毒", "title": "杰克·多尔西(Jack Dorsey)将给安德鲁·杨(Andrew Yang)500万美元，以支持全民基本收入计划", "title_en": "Jack Dorsey Is Giving Andrew Yang $5 Million To Build the Case for Universal Basic Income", "transed": 1, "url": "https://thehill.com/policy/technology/498925-jack-dorsey-giving-5-million-to-andrew-yang-to-distribute-micro-grants", "via": "", "real_tags": ["收入", "basic", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "52b03383f830f67c707d01d620371549.png", "infoid": 1003168, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开源BIT：探索计算机视觉的大规模预培训", "note_en": "Open-Sourcing BiT: Exploring Large-Scale Pre-training for Computer Vision", "posttime": "2020-05-22 02:23:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,bit,sourcing", "title": "开源BIT：探索计算机视觉的大规模预培训", "title_en": "Open-Sourcing Bit: Exploring Large-Scale Pre-Training for Computer Vision", "transed": 1, "url": "https://ai.googleblog.com/2020/05/open-sourcing-bit-exploring-large-scale.html", "via": "", "real_tags": ["开源", "bit", "sourcing"]}, {"category": "", "categoryclass": "", "imagename": "835969e572c1e6d3ac931d4f81d8e342.jpg", "infoid": 1003166, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新的研究表明，曼彻斯特大学约翰·莱兰兹图书馆收藏的四个死海古卷手稿碎片，以前被认为是空白的，实际上确实含有文字。这一发现意味着曼彻斯特大学是英国唯一拥有经过鉴定的死海古卷文本片段的机构。这项研究是Leverhulme资助的伦敦国王学院研究的一部分，该研究是琼·泰勒教授(伦敦国王学院)、Marcello Fidanzio教授(卢加诺神学院)和Dennis Mizzi博士(马耳他大学)合作进行的。与最近被认为是死海古卷碎片的伪造案件不同，这些小碎片都是在昆兰洞穴的官方发掘中出土的，从未经过文物市场。在20世纪50年代，这些碎片由约旦政府赠送给利兹大学的皮革专家罗纳德·里德(Ronald Reed)，这样他就可以研究它们的物理和化学成分。人们认为这些碎片是科学测试的理想之选，因为它们是空白的，相对没有价值。这些资料由里德和他的学生约翰·普尔研究并出版，然后安全地保存起来。1997年，在瑞兰德圣经批评和训诂教授乔治·布鲁克的倡议下，芦苇收藏捐赠给了曼彻斯特大学。这些碎片一直储存在约翰·瑞兰德图书馆里里德自己贴标签的盒子里，从那以后就一直没有被碰过。在为这项新的研究检查碎片时，泰勒教授认为其中一个碎片可能确实包含一个字母，因此决定使用多光谱成像技术拍摄肉眼看起来空白的超过1厘米的所有现存碎片。51个碎片正反两面成像。其中六个被确定用于进一步的详细调查，其中四个被确定为用碳基墨水写成的可读的希伯来语/阿拉姆语文本。这项研究还发现了其他碎片上的线条和字母的小痕迹。最实质性的片段有四行文字的遗迹，有15-16个字母，其中大部分只被部分保存下来，但安息日(安息日)这个词可以清楚地读出来。这段经文(如图)可能与“以西结书”(46：1-3)有关。一块有文字的是羊皮纸卷轴的边缘，有缝纫的线，在这个装订的左边可以看到两行文字的第一个字母。泰勒教授说：“用放大镜看其中一个碎片，我想我看到了一个褪色的小字母--一个残缺的希伯来语字母。”“坦率地说，由于所有这些碎片都应该是空白的，甚至是为了皮革研究而切割的，我也认为我可能是在想象事情。但后来似乎其他碎片也可能有非常褪色的字母。“。“现在有了揭示古文的新技术，我觉得我们必须知道这些信件是否可以曝光。每一块碎片上只有几块，但它们就像你在沙发下找到的拼图遗失的几块一样。“。研究小组目前正在与约翰·里兰图书馆和布鲁克教授协商，对这些碎片进行进一步的调查，这是约翰·里兰图书馆研究各种库姆兰文物的更大项目的一部分。研究结果将在即将发布的报告中公布。\n我非常感谢琼·泰勒教授和她的同事，以及我们的成像专家的出色工作，他们将这一惊人的发现公之于众。我们的大学现在是英国唯一拥有死海古卷真迹的机构。约翰·里兰兹图书馆是世界上最伟大的犹太教-基督教经文储存库之一，这里保存着这些片段，这是特别合适的。\n克里斯托弗·普雷斯勒(Christopher Pressler)教授，约翰·莱兰兹大学图书馆员兼曼彻斯特大学图书馆馆长", "note_en": "New research has revealed that four Dead Sea Scroll manuscript fragments housed at The University of Manchester’s John Rylands Library, which were previously thought to be blank, do in fact contain text.  The discovery means that The University of Manchester is the only institution in the UK to possess authenticated textual fragments of the Dead Sea Scrolls.  The study was undertaken as part of a  Leverhulme-funded study held at King’s College London, a collaboration between Professor Joan Taylor (King’s College London), Professor Marcello Fidanzio (Faculty of Theology of Lugano) and Dr Dennis Mizzi (University of Malta).  Unlike the recent cases of forgeries assumed to be Dead Sea Scrolls fragments, all of these small pieces were unearthed in the official excavations of the Qumran caves, and were never passed through the antiquities market.  In the 1950s, the fragments were gifted by the Jordanian government to Ronald Reed, leather expert at the University of Leeds, so he could study their physical and chemical composition. It was assumed that the pieces were ideal for scientific tests, as they were blank and relatively worthless. These were studied and published by Reed and his student John Poole, and then stored safely away.  In 1997 the Reed Collection was donated to The University of Manchester through the initiative of Rylands Professor of Biblical Criticism and Exegesis, George Brooke. These fragments have been stored in Reed’s own labelled boxes in The John Rylands Library, and have been relatively untouched since then.  When examining the fragments for the new study, Professor Taylor thought it possible that one of them did actually contain a letter, and therefore decided to photograph all of the existing fragments over 1 cm that appear blank to the naked eye, using multispectral imaging.  51 fragments were imaged front and back. Six were identified for further detailed investigation - of these, it was established that four have readable Hebrew/Aramaic text written in carbon-based ink. The study has also revealed ruled lines and small vestiges of letters on other fragments.  The most substantial fragment has the remains of four lines of text with 15-16 letters, most of which are only partially preserved, but the word  Shabbat (Sabbath) can be clearly read. This text (pictured) may be related to the biblical book of Ezekiel (46:1-3). One piece with text is the edge of a parchment scroll section, with sewn thread, and the first letters of two lines of text may be seen to the left of this binding.  “Looking at one of the fragments with a magnifying glass, I thought I saw a small, faded letter - a lamed, the Hebrew letter &#39;L&#39;,” said Professor Taylor. “Frankly, since all these fragments were supposed to be blank and had even been cut into for leather studies, I also thought I might be imagining things. But then it seemed maybe other fragments could have very faded letters too.”  “With new techniques for revealing ancient texts now available, I felt we had to know if these letters could be exposed. There are only a few on each fragment, but they are like missing pieces of a jigsaw puzzle you find under a sofa.”  The research team is currently undertaking further investigations of these fragments in consultation with The John Rylands Library and Professor Brooke, as part of a larger project studying the various Qumran artefacts at the John Rylands Library. The results will be published in a forthcoming report.\n I am hugely grateful to Professor Joan Taylor and her colleagues, and to the brilliant work of our imaging specialists, for bringing this astonishing discovery to light. Our University is now the only institution in the United Kingdom to hold authenticated textual fragments of the Dead Sea Scrolls. It is particularly fitting that these fragments are held here at The John Rylands Library, one of the world’s greatest repositories of Judaeo-Christian texts.\n  Professor Christopher Pressler, John Rylands University Librarian and Director of The University of Manchester Library", "posttime": "2020-05-22 02:00:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "古卷,sea,碎片", "title": "死海古卷碎片被认为是空白的揭示文本", "title_en": "Dead Sea Scroll fragments thought to be blank reveal text", "transed": 1, "url": "https://www.manchester.ac.uk/discover/news/dead-sea-scroll-fragments-thought-to-be-blank-reveal-text/", "via": "", "real_tags": ["古卷", "sea", "碎片"]}, {"category": "", "categoryclass": "", "imagename": "469ffa316249ea5ca145e6df4e998d07.jpg", "infoid": 1003164, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一份新的报告，在3月中旬至5月中旬期间，美国亿万富翁的财富飙升了4340亿美元。\n根据一份新的报告，美国的亿万富翁们在3月中旬至5月中旬的美国经济停摆期间，他们的财富飙升了4340亿美元。\n根据美国税收公平协会和政策研究所不平等项目的报告，亚马逊的杰夫·贝佐斯和Facebook的马克·扎克伯格的财富增幅最大，贝佐斯的财富增加了346亿美元，扎克伯格的财富增加了250亿美元。这份报告基于福布斯对美国600多位亿万富翁的数据，从3月18日大多数州都处于封锁状态，一直到5月19日。\n亿万富翁的收益突显了冠状病毒大流行是如何奖励了规模最大、最专注于科技的公司，尽管经济和劳动力正在努力应对近代史上最严重的经济危机。\n根据这份报告，美国亿万富翁的净资产在这两个月内增长了15%，从2.948万亿美元增至3.382万亿美元。最大的财富增长出现在亿万富翁金字塔的顶端，最富有的五位亿万富翁--贝佐斯、比尔·盖茨、扎克伯格、沃伦·巴菲特和拉里·埃里森--总共获得了760亿美元的财富增长。\n埃隆·马斯克(Elon Musk)是这两个月涨幅最大的亿万富翁之一，他的净资产在这两个月里跃升了48%，达到360亿美元。扎克伯格紧随其后，他的财富在这两个月里飙升了46%，达到800亿美元。贝佐斯的财富增长了31%，达到1470亿美元。贝佐斯的前妻麦肯齐·贝佐斯(MacKenzie Bezos)在离婚时获得了亚马逊的股份，她的财富也增加了三分之一，达到480亿美元。\n因为这项研究的时间表捕捉到了股市的底部和快速反弹，它为亿万富翁创造了一幅比全年略有阳光的图景。根据彭博社的亿万富翁指数，今年，巴菲特的财富减少了200亿美元，而盖茨的财富减少了43亿美元。今年，杰夫·贝佐斯增加了355亿美元，而扎克伯格增加了90亿美元。\n在这两个月的时间里，有一些输家，特别是对于旅游、酒店或零售业务的亿万富翁来说，他们还没有看到自己的股票和公司复苏。拉尔夫·劳伦(Ralph Lauren)的财富减少了1亿美元，至56亿美元，而酒店经营者约翰·普利兹克(John Pritzker)的财富减少了3400万美元，至25.6亿美元。", "note_en": "U.S. billionaires saw their fortunes soar by $434 billion during the nation&#39;s lockdown between mid-March and mid-May, according to a new report.\n America&#39;s billionaires saw their fortunes soar by $434 billion during the U.S. lockdown between mid-March and mid-May, according to a new report.\n Amazon&#39;s Jeff Bezos and  Facebook&#39;s Mark Zuckerberg had the biggest gains, with Bezos adding $34.6 billion to his wealth and Zuckerberg adding $25 billion, according to the report from Americans for Tax Fairness and the Institute for Policy Studies&#39; Program for Inequality. The report is based on Forbes data for America&#39;s more than 600 billionaires between March 18, when most states were in lockdown, and May 19.\n  The billionaire gains highlight how the  coronavirus pandemic has rewarded the largest and most tech-focused companies, even as the economy and labor force grapples with the worst economic crisis in recent history.\n According to the report, the net worth of America&#39;s billionaires grew 15% during the two-month period, to $3.382 trillion from $2.948 trillion. The biggest gains were at the top of the billionaire pyramid, with the richest five billionaires -- Bezos, Bill Gates, Zuckerberg, Warren Buffett, and Larry Ellison -- seeing combined wealth gains of $76 billion.\n Elon Musk had among the largest percentage gain of billionaires during the two months, seeing his net worth jump by 48% in the two months to $36 billion. Zuckerberg was close behind, seeing his wealth surge by 46% in the two months, to $80 billion. Bezos&#39; wealth increased by 31% to $147 billion. Bezos&#39; ex-wife, MacKenzie Bezos, who received Amazon shares in their divorce, also saw her wealth increase by a third, to $48 billion.\n Because the study timeline captures the stock market bottom and quick rebound, it creates a slightly sunnier picture for billionaires than the full year. For the year, Buffett&#39;s wealth has declined by $20 billion, according to the Bloomberg Billionaire&#39;s Index, while Gates is down by $4.3 billion. For the year, Jeff Bezos has gained $35.5 billion while Zuckerberg is up by $9 billion.\n There were some losers during the two-month period, especially for billionaires in the travel,  hospitality or retail business who have yet to see their stocks and companies recover. Ralph Lauren saw his wealth drop by $100 million to $5.6 billion, while hotelier John Pritzker saw his wealth drop by $34 million to $2.56 billion.", "posttime": "2020-05-22 01:59:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亿万富翁,american", "title": "在大流行期间，美国亿万富翁增加了4340亿美元的财富", "title_en": "American billionaires got $434B richer during the pandemic", "transed": 1, "url": "https://www.cnbc.com/2020/05/21/american-billionaires-got-434-billion-richer-during-the-pandemic.html", "via": "", "real_tags": ["亿万富翁", "american"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003163, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索麦当劳公司诉钢铁和莫里斯[1997]EWHC QB 366，也就是众所周知的麦克利贝尔案，是麦当劳公司针对环保活动人士海伦·斯蒂尔(Helen Steel)和大卫·莫里斯(David Morris)(通常被称为麦克利贝尔夫妇)就一份批评该公司的情况说明书提起的诽谤英国诉讼。在英国法庭的两次听证会中，每一次都发现传单上的一些有争议的指控是诽谤的，另一些是真实的。\n据BBC报道，最初的案件持续了近十年，使其成为英国历史上持续时间最长的诽谤案。[1]麦当劳宣布，它不打算收取法院判给它的4万英镑。[2]在裁决之后，欧洲人权法院在Steel&amp；Morris诉联合王国一案中裁定，这两人被剥夺了公平审判的权利，这违反了《欧洲人权公约》第6条(公平审判权)，他们的行为本应受到《公约》第10条的保护，该条保护言论自由权。法院判决英国政府败诉，赔偿金为57000英镑。[3]麦当劳本身并不参与或参与这一行动，因为向欧洲人权委员会提出的申请是针对相关州提出的独立案件。\n海伦·斯蒂尔(Helen Steel)和大卫·莫里斯(David Morris)是伦敦绿色和平组织(London GreenPeace)的两名环保活动家，该组织成立于1972年至2001年之间，是一个小型。1986年，他们合著了一份长达6页的传单，题为“麦当劳有什么问题：他们不想让你知道的一切”，他们在伦敦斯特兰德分发了几百份。[4][5]传单指责该公司支付低工资，残酷对待其产品中使用的动物和其他不当行为。[6]该组织并不隶属于规模更大的绿色和平国际组织，他们拒绝加入该组织，因为他们认为该组织也是集中化的主流组织。[7]。\n1990年，麦当劳对伦敦绿色和平组织的五名支持者保罗·格拉维特(Paul Gravett)、安德鲁·克拉克(Andrew Clarke)和乔纳森·O·法雷尔(Jonathan O&39；Farrell)以及斯蒂尔和莫里斯(Steel And Morris)提起诽谤诉讼，指控他们在伦敦街头分发这张纸。在此之前，麦当劳曾威胁要以诽谤罪起诉50多家机构，包括第四频道电视和几家主要出版物。在所有这类案件中，媒体都达成了和解并道歉。[8]。\n根据英国诽谤法，被告必须证明所作的每一项诽谤声明都是真实的。这可能是一个昂贵且耗时的过程。Gravett、Clarke和O&#39；Farrell应麦当劳的要求道歉，但斯蒂尔和莫里斯选择为此案辩护。[9]。\n这两人被拒绝提供法律援助，诽谤案件的政策也是如此，尽管他们的收入有限。[10]因此，他们必须为自己辩护，尽管他们得到了包括基尔·斯塔默在内的大量无偿援助。斯蒂尔和莫里斯传唤了180名证人，试图证明他们关于食物中毒、无薪加班、关于麦当劳回收数量的误导性说法，以及派来渗透伦敦绿色和平组织队伍的企业间谍的说法。[11]麦当劳花费了数百万英镑，而斯蒂尔和莫里斯花费了30,000英镑；资金上的差异意味着斯蒂尔和莫里斯无法传唤他们想要的所有证人，特别是来自南美的证人，他们打算支持他们关于麦当劳在该大陆热带雨林活动的说法。[12]。\n在诽谤指控中，麦当劳声称小册子中的所有指控都是虚假的。[13]他们发现，尽管有些主张是间接的，但很难支持这一立场。此案最终成为媒体的马戏团。包括雷·塞斯卡(Ray Cesca)在内的麦当劳高管进入证人席，允许被告进行盘问。[14]。\n1995年6月，麦当劳提出将一大笔钱捐给两人选定的一家慈善机构，以了结此案(当时麦当劳在法庭上即将迎来其[10]周年纪念日)。他们进一步明确表示，如果斯蒂尔和莫里斯同意停止批评麦当劳，他们将撤销此案。[15]斯蒂尔和莫里斯秘密录制了这次会议，麦当劳在会上表示，两人可以私下对朋友批评麦当劳，但必须停止与媒体交谈或分发传单。斯蒂尔和莫里斯写了一封信回应说，如果麦当劳不再为其产品做广告，而只是私下向朋友推荐这家餐厅，他们将同意这些条款。[12]\n此案由大法官罗杰·贝尔先生裁决。[16]1997年6月19日，Bell J在法庭上宣读了一份45页的文件，总结了他1000多页的判决，主要是支持麦当劳[17]。[18]斯蒂尔和莫里斯被判在几点上负有责任，但法官也发现情况说明书中的一些点是真实的。[12]麦当劳认为这是一个法律上的胜利，尽管法官认可了传票中的一些指控，这一胜利有所缓和。具体地说，贝尔·J裁定麦当劳通过误导性广告危及员工和顾客的健康，他们剥削儿童，他们在对动物施加不必要的残酷对待方面负有罪责，他们与工会格格不入，给工人支付的工资很低。[20]此外，尽管判决判给该公司6万英镑，但麦当劳的法律费用要高得多，被告缺乏支付这笔费用的资金。斯蒂尔和莫里斯立即对这一决定提出上诉。[21]。\n1998年，拍摄了一部关于此案的纪录片，也名为麦克利贝尔(McLibel)。这是在2005年终审判决后更新的。\n1998年9月，这两人起诉大都会警察局向麦当劳雇佣的调查人员泄露机密信息，并收到了1万英镑的赔偿和对所称披露的道歉。[21]。\n上诉于1999年1月12日开始，历时23天，于2月26日结束。[22]此案在皇家法院上诉法院第一法庭开庭审理。此案由大法官皮尔和梅以及法官基恩先生裁决。被告在法庭上为自己辩护，由法律系一年级学生卡尔文·P·查普曼(伦敦国王学院)协助。麦当劳的代理律师是诽谤律师理查德·兰普顿(Richard Rampton QC)[23]、初级大律师蒂莫西·阿特金森(Timothy Atkinson)[24]和Barlow，Lyde&Amp；Gilbert的帕蒂·布林利-科德(Pattie Brinley-Codd)女士。[25]斯蒂尔和莫里斯提出了63点上诉。他们曾要求延长时间，但遭到拒绝。上诉判决于3月31日在皇家法院第一法庭作出。[26][26]。\n法官们裁定，说麦当劳全球员工在薪酬和工作条件方面表现不佳是公平的，如果一个人吃了足够的麦当劳食物，那么他的饮食很可能会变得脂肪含量高等，并有非常真实的心脏病风险。\n由于他们对该公司的进一步调查结果，三位大法官将贝尔法官判给麦当劳的60,000英镑的赔偿金减少了20,000英镑。法院驳回了斯蒂尔和莫里斯的论点，即跨国公司不应该再能够就公共利益问题起诉诽谤。斯蒂尔和莫里斯宣布，他们打算就这些和其他问题向上议院提出上诉，然后在必要时将英国政府告上欧洲人权法院(European Court Of Human Rights)。\n作为对判决的回应，英国皇家御用大律师大卫·帕尼克(David Pannick)在“泰晤士报”上表示：麦克利贝尔一案实现了许多律师认为不可能的事情：进一步降低我们的诽谤法在所有思想正常的人心目中的声誉。\n斯蒂尔和莫里斯向上议院提出上诉，辩称他们获得法律援助的权利被不公正地剥夺了。当上议院拒绝受理此案时，两人正式聘请律师马克·斯蒂芬斯(Mark Stephens)和大律师基尔·斯塔默(Keir Starmer QC)(后来的检察官(英格兰和威尔士)、皇家检察院局长和工党领袖)向欧洲人权法院(ECHR)提起诉讼，质疑英国政府在诽谤案件中不提供法律援助的政策，并就他们认为是压迫和不公平的案件提出了一个非常详细的案件。[30]2004年9月，欧洲人权委员会听取了这一行动。斯蒂尔和莫里斯的律师辩称，缺乏法律援助侵犯了这两人言论自由和公平审判的权利。\n2005年2月15日，欧洲人权法院裁定[31]原案违反了“欧洲人权公约”第6条(公平审判权)和第10条(言论自由权)，命令联合王国政府向Steel和Morris GB赔偿57000英镑。在裁决中，欧洲人权法院批评英国法律未能保护公众批评那些商业行为影响人们生活和环境(这违反了第10条)的公司的权利；他们还裁定，由于被告相对缺乏资源，以及他们认为英国复杂而压迫性的诽谤法，审判是有偏见的。\n在民主社会中，即使是伦敦绿色和平等小型和非正式的运动团体也必须能够有效地开展其活动，而且在使主流之外的这些团体和个人能够通过传播关于健康和环境等普遍公众关心的问题的信息和想法来促进公众辩论方面，存在着强烈的公众利益。\n第10条向记者提供的关于报道普遍感兴趣的问题的保障须遵守这样的条件，即他们本着诚意行事，以便根据新闻道德提供准确可靠的信息(……)，同样的原则也必须适用于其他参与公开辩论的人。\n诚然，大型上市公司无可避免地在知情的情况下，让自己的行为受到严密的审查，而正如管理这些公司的商人和妇女一样，对这类公司来说，可以接受的批评范围更广。\n作为对欧洲人权法院裁决的回应，斯蒂尔和莫里斯发布了以下新闻稿：\n在很大程度上击败了麦当劳之后。我们现在揭露了臭名昭著的压迫和不公平的英国法律。由于……。如果今天做出裁决，政府可能会被迫修改或废除一些现有的英国法律。我们希望这将导致公众对那些对社会和环境造成有害影响的强大组织进行更多的公众监督和批评。麦克利贝尔运动已经证明，坚定而广泛的草根抗议和挑衅可以削弱那些试图压制批评者的人，也会使压迫的法律行不通。对麦当劳和它所代表的一切不断增长的反对是对世界各地那些一直在揭露和挑战该公司商业实践的人所做的所有努力的证明。[32][font=宋体]。\n在英国卧底警务关系丑闻的过程中，麦克利贝尔传单的作者之一鲍勃·兰伯特(Bob Lambert)被披露，他是一名渗透到伦敦绿色和平组织的卧底警官；另一名卧底警官约翰·迪恩斯(John Dines)也是海伦·斯蒂尔(Helen Steel)的两年合作伙伴。[33][34]。\n2013年的“诽谤法”给诽谤案件带来了一些变化[35]，预计这将使企业更难滥用诽谤法。[36]\nMcLibel案还提高了人们对诽谤诉讼如何损害提出诽谤诉讼的公司的声誉的认识[37]，类似于史翠珊效应(Streisand Effect)。\nMcLibel的这部电影援引麦当劳对欧洲法院的裁决几乎没有发表评论，只是指出败诉的是政府，而不是麦当劳，时代已经变了，麦当劳也变了。\n麦当劳在一家旨在阐述其对相关问题的看法的网站上表示，此案已成为过去，问题更是如此，双方都已向前看(尽管莫里斯和斯蒂尔确实还在继续相关诉讼)。[38][39][39]。\n1997年，弗兰尼·阿姆斯特朗(Franny Armstrong)和肯·洛奇(Ken Loach)拍摄了一部关于此案的长篇纪录片“麦克利贝尔”(McLibel)。2005年制作了加长版。\nGunns Limited诉Marr&amp；Ors-Forest Company对20名个人和组织提起诉讼，指控其名誉受损。\n利贝克诉麦当劳餐厅案--1994年，一名女子被热咖啡烫伤自己的案件。\n麦克利贝尔一对获得了警方的赔偿。英国广播公司。2000年7月5日。McLibel&#34；&#39；在新的法庭竞标中配对。英国广播公司。2004年9月7日。麦克利贝尔：英国历史上最长的案例。英国广播公司。2005年2月15日。\n麦当劳(McDonald‘s)让麦克利贝尔(McLibel)的案子休庭。美联社。1997年7月19日。2008年10月6日从原件存档。\n^注册官发布的新闻稿。分庭判决斯蒂尔和莫里斯诉联合王国，欧洲人权法院，2005年2月15日。2008年9月1日收到。\n长达20年的斗争以被告席上的诽谤法结束。卫报。2005年2月16日。\n在过去的15年里，麦当劳威胁要对英国的90多家机构采取法律行动，其中包括BBC、第四频道、“卫报”、“太阳报”、苏格兰工会联合会、“新叶商店”、学生报纸和一个儿童戏剧团体。就连菲利普亲王也收到了一封生硬的信。所有人都做出了让步，许多人在法庭上正式道歉。摘自“为什么赢不了英国电视节目一部关于麦克利贝尔的电影？”，弗兰妮·阿姆斯特朗(Franny Armstrong)，1998年6月19日，“卫报”(The Guardian)，引用“No Logo”中的话。\n一名失业的邮政工人(莫里斯)和一名社区园丁(钢铁)在法庭上持续了313天，这是英国历史上时间最长的审判，他们与世界上最大的食品帝国的首席执行官们发生了战争。No Logo的第389页。\n约翰·维达尔(1997)。麦克利贝尔：英国文化正在受审。新报社。第11-20页。\n贝尔·J从未在诽谤案中受审或作为律师出庭。他的做法主要是刑法和职业疏忽，一些人认为，在整个案件的大部分时间里，他都是由理查德·兰普顿(Richard Rampton)QC领导的，为麦当劳工作。[需要引用]。\n1997年6月19日，法官终于做出了判决……当罗杰·贝尔法官宣读他长达45页的裁决时，对于坐在那里的大多数人来说，这感觉就像是永无止境……这是长达1000多页的实际裁决的摘要。尽管法官认为情况说明书中的大部分说法过于夸张，令人无法接受(他尤其不相信它将麦当劳与第三世界的饥饿直接联系在一起)，但他认为其他说法是基于纯粹的事实。“No Logo”第389-390页。\n^&34；One Brick Court--律师。onebrickCourt.com。2008年12月20日从原件存档。\n弗朗西斯·吉布(2005年2月16日)。麦当劳尝到了失败的滋味，因为欧洲支持McLibel Two。泰晤士报。伦敦。\n^刘易斯，保罗；埃文斯，罗布(2013年6月21日)。麦克利贝尔传单是由卧底警官鲍勃·兰伯特共同撰写的。卫报。\n^Paul Farrell和Rob Evans(2016年3月9日)。卧底英国警方间谍在被他欺骗的女子追踪后道歉。卫报。\n麦克利贝尔：约翰·维达尔试用的汉堡文化(麦克米伦出版社，1997年；新出版社，1998年)，ISBN电话：0-333-69461-9(精装本)，ISBN电话：0-330-35237-7(平装本)，ISBN电话：1-56584-411-4(美国)。斯蒂尔和莫里斯的后记。\n“麦克世界的审判”，一篇从戴夫·莫里斯和海伦·斯蒂尔的角度对此案进行广泛报道的文章出现在“乌鸦：无政府主义者季刊”第43期上(由自由出版社出版)。\n“快餐之国”(Eric Schlosser著)，关于快餐及其创造的文化的揭露，在最后几章提到了麦克利贝尔。\n没有标识，Naomi Klein，490页，封面设计Bruce Mau&&Barr Gilmore，1999。在美国出版由圣马丁出版社，斗牛士美国阅读集团印记，在加拿大由加拿大兰登书屋有限公司的阿尔弗雷德·A·克诺夫加拿大出版。国际标准书号0-312-20343-8(精装本)；国际标准书号0-312-27192-1(平装本)。\n积极分子赢得上诉麦当劳诽谤案的部分胜利，1999年3月31日，美联社。", "note_en": "Jump to navigation  Jump to search  McDonald&#39;s Corporation v Steel &amp; Morris [1997] EWHC QB 366, known as &#34;the  McLibel case&#34;, was an English  lawsuit for  libel filed by  McDonald&#39;s Corporation against  environmental activists  Helen Steel and David Morris (often referred to as &#34;The McLibel Two&#34;) over a factsheet critical of the company. Each of two  hearings in English courts found some of the leaflet&#39;s contested claims to be libellous and others to be true.\n The original case lasted nearly ten years which, according to the  BBC, made it the longest-running libel case in English history.  [1] McDonald&#39;s announced it did not plan to collect the £40,000 it was awarded by the courts.  [2] Following the decision, the  European Court of Human Rights (ECHR) ruled in  Steel &amp; Morris v United Kingdom the pair had been denied a fair trial, in breach of Article 6 of the  European Convention on Human Rights (right to a fair trial) and their conduct should have been protected by Article 10 of the Convention, which protects the right to freedom of expression. The court awarded a judgement of £57,000 against the UK government.  [3] McDonald&#39;s itself was not involved in, or a party to, this action, as applications to the ECHR are independent cases filed against the relevant  state.\n       Helen Steel and David Morris were two  environmental activists of  London Greenpeace, a small environmental campaigning group that existed between 1972 and 2001. In 1986, they co-authored a six-page leaflet titled  &#34;What&#39;s wrong with McDonald&#39;s: everything they don&#39;t want you to know&#34; of which they distributed &#34;a few hundred copies&#34; in  Strand, London.  [4]  [5] The leaflet accused the company of paying low wages, of cruelty to animals used in its products and other malpractices.  [6] The group were not affiliated with the larger  Greenpeace International organisation, which they declined to join as they saw it as too &#34;centralised and mainstream&#34;.  [7]\n  In 1990, McDonald&#39;s brought  libel proceedings against five London Greenpeace supporters, Paul Gravett, Andrew Clarke and Jonathan O&#39;Farrell, as well as Steel and Morris, for distributing the sheet on the streets of London. This case followed past instances in which McDonald&#39;s threatened to sue more than fifty organisations for libel, including  Channel 4 television and several major publications. In all such cases, the media outlets  settled and apologised.  [8]\n Under  English defamation law, the defendant must show that each disparaging statement made is substantively true. This can be an expensive and time-consuming process. Gravett, Clarke and O&#39;Farrell apologised as requested by McDonald&#39;s, but Steel and Morris chose to defend the case.  [9]\n The two were denied  Legal Aid, as was policy for libel cases, despite having limited income.  [10] Thus, they had to represent themselves, though they received significant  pro bono assistance, including from  Keir Starmer. Steel and Morris called 180 witnesses, seeking to prove their assertions about  food poisoning, unpaid  overtime, misleading claims about how much McDonald&#39;s  recycled, and &#34;corporate spies sent to infiltrate the ranks of London Greenpeace&#34;.  [11] McDonald&#39;s spent several million pounds, while Steel and Morris spent £30,000; this disparity in funds meant Steel and Morris were not able to call all the witnesses they wanted, especially witnesses from South America who were intended to support their claims about McDonald&#39;s activities in that continent&#39;s rainforests.  [12]\n In its libel allegation, McDonald&#39;s asserted all claims in the pamphlet as being false.  [13] They found it difficult to support this position despite the indirectness of some of the claims. The case eventually became a  media circus. McDonald&#39;s executives, including Ray Cesca, entered the witness box, enabling cross-examination by the defendants.  [14]\n In June 1995 McDonald&#39;s offered to settle the case (which &#34;was coming up to its [tenth] anniversary in court&#34;  [15]) by donating a large sum of money to a charity chosen by the two. They further specified they would drop the case if Steel and Morris agreed to &#34;stop criticising McDonald&#39;s&#34;.  [15] Steel and Morris secretly recorded the meeting, in which McDonald&#39;s said the pair could criticise McDonald&#39;s privately to friends but must cease talking to the media or distributing leaflets. Steel and Morris wrote a letter in response saying they would agree to the terms if McDonald&#39;s ceased advertising its products and instead only recommended the restaurant privately to friends.  [12]\n   The case was adjudicated by the Hon. Mr. Justice Rodger Bell.  [16] On 19 June 1997, Bell J delivered his more than 1,000-page judgment largely in favour of McDonald&#39;s,  [17] summarised by a 45-page paper read in court.  [18] Steel and Morris were found liable on several points, but the judge also found some of the points in the factsheet were true.  [12] McDonald&#39;s considered this a legal victory, though it was tempered by the judge&#39;s endorsement of some of the allegations in the sheet. Specifically, Bell J ruled that McDonald&#39;s endangered the  health of their workers and customers by &#34;misleading advertising&#34;, that they &#34;exploit children&#34;, that they were &#34;culpably responsible&#34; in the infliction of unnecessary  cruelty to animals, and they were &#34;antipathetic&#34;  [19] to  unionisation and paid their workers low wages.  [20] Furthermore, although the decision awarded £60,000 to the company, McDonald&#39;s legal costs were much greater, and the defendants lacked the funds to pay it. Steel and Morris immediately appealed against the decision.  [21]\n In 1998 a documentary film was made about the case, also titled   McLibel. This was updated in 2005 after the verdict of the final appeal.\n In September 1998, the pair sued the  Metropolitan Police for disclosing confidential information to investigators hired by McDonald&#39;s and received £10,000 and an apology for the alleged disclosure.  [21]\n  An appeal began on 12 January 1999 and lasted 23 court days, ending on 26 February.  [22] The case was heard in Court 1 of the Court of Appeal in the  Royal Courts of Justice. The case was adjudicated by  Lord Justices Pill and  May and  Mr Justice Keene. The defendants represented themselves in court, assisted by first year law student Kalvin P. Chapman ( King&#39;s College London). McDonald&#39;s were represented by libel lawyer  Richard Rampton QC,  [23] and a junior barrister, Timothy Atkinson,  [24] and Ms Pattie Brinley-Codd of Barlow, Lyde &amp; Gilbert.  [25] Steel and Morris filed a 63-point appeal. They had requested a time extension, but were denied. The verdict for the appeal was handed down on 31 March, in Court 1 at the Royal Courts of Justice.  [26]\n The judges ruled it was fair comment to say that McDonald&#39;s employees worldwide &#34;do badly in terms of pay and conditions&#34;  [27] and true &#34;if one eats enough McDonald&#39;s food, one&#39;s diet may well become high in fat, etc., with the very real risk of heart disease&#34;.\n As a result of their further findings against the Corporation, the three Lord Justices reduced Mr Justice Bell&#39;s award of £60,000 damages to McDonald&#39;s by £20,000. The court ruled against the argument by Steel and Morris that multinational corporations should no longer be able to sue for libel over  public interest issues. Steel and Morris announced their intention to appeal over these and other points to the  House of Lords, and then take the  UK government to the  European Court of Human Rights if necessary.\n In response to the verdict,  David Pannick QC said in   The Times: &#34;The McLibel case has achieved what many lawyers thought impossible: to lower further the reputation of our law of defamation in the minds of all right thinking people.&#34;  [28]\n Steel and Morris appealed to the  Law Lords, arguing that their right to legal aid had been unjustly denied. When the Law Lords refused to accept the case, the pair formally retained  solicitor  Mark Stephens  [29] and  barrister  Keir Starmer QC (later  Director of Public Prosecutions (England and Wales), Head of the Crown Prosecution Service and Leader of the  Labour Party) to file a case with the  European Court of Human Rights (ECHR), contesting the UK government&#39;s policy that legal aid was not available in libel cases, and setting out a highly detailed case for what they believed to be the oppressive and unfair nature of UK libel laws in general, and in their case in particular.  [30] In September 2004, this action was heard by the ECHR. Lawyers for Steel and Morris argued that the lack of legal aid had breached the pair&#39;s right to freedom of expression and to a fair trial.\n   On 15 February 2005, the European Court of Human Rights ruled  [31] that the original case had breached Article 6 (right to a fair trial) and Article 10 (right to freedom of expression) of the  European Convention on Human Rights and ordered that the UK government pay Steel and Morris £57,000 in compensation. In their ruling, the ECHR criticised the way in which UK laws had failed to protect the public right to criticise corporations whose business practices affect people&#39;s lives and the environment (which violates Article 10); they also ruled that the trial was biased because of the defendants&#39; comparative lack of resources and what they believed were complex and oppressive UK libel laws.\n  in a democratic society even small and informal campaign groups, such as London Greenpeace, must be able to carry on their activities effectively and that there exists a strong public interest in enabling such groups and individuals outside the mainstream to contribute to the public debate by disseminating information and ideas on matters of general public interest such as health and the environment.\n  The safeguard afforded by Article 10 to journalists in relation to reporting on issues of general interest is subject to the proviso that they act in good faith in order to provide accurate and reliable information in accordance with the ethics of journalism (...), and the same principle must apply to others who engage in public debate.\n  It is true that large public companies inevitably and knowingly lay themselves open to close scrutiny of their acts and, as in the case of the businessmen and women who manage them, the limits of acceptable criticism are wider in the case of such companies.\n In response to the European Court of Human Rights&#39; decision, Steel and Morris issued the following press release:\n Having largely beaten McDonald&#39;s... we have now exposed the notoriously oppressive and unfair UK laws. As a result of the... ruling today, the government may be forced to amend or scrap some of the existing UK laws. We hope that this will result in greater public scrutiny and criticism of powerful organisations whose practices have a detrimental effect on society and the environment. The McLibel campaign has already proved that determined and widespread grass roots protests and defiance can undermine those who try to silence their critics, and also render oppressive laws unworkable. The continually growing opposition to McDonald&#39;s and all it stands for is a vindication of all the efforts of those around the world who have been exposing and challenging the corporation&#39;s business practices.  [32]\n  In the course of the  UK undercover policing relationships scandal it was revealed that one of the authors of the &#34;McLibel leaflet&#34; was  Bob Lambert, an undercover police officer who infiltrated  London Greenpeace; John Dines, another undercover officer, was also Helen Steel&#39;s partner for two years.  [33]  [34]\n The  Defamation Act 2013 brought some changes to libel cases,  [35] which were expected to make it harder for corporations to abuse libel law.  [36]\n The McLibel case also raised awareness about how defamation proceedings can harm the reputation of companies that raise them,  [37] similar to the  Streisand effect.\n  The  McLibel film quoted McDonald&#39;s as offering little comment on the European Court decision, other than to point out that it was the Government and not McDonald&#39;s who was the losing party and that &#34;times have changed and so has McDonald&#39;s&#34;.\n On a website aiming to state its view on issues raised about it, McDonald&#39;s stated that the case is in the past and the issues more so, and that both sides in it have moved on (although Morris and Steel did continue related litigation).  [38]  [39]\n  A feature-length documentary film,   McLibel, was made about the case by  Franny Armstrong and  Ken Loach in 1997. An extended version was produced in 2005.\n  Gunns Limited v Marr &amp; Ors – forestry company filed writ against 20 individuals and organisations for loss of reputation\n   Liebeck v. McDonald&#39;s Restaurants – 1994 case about a woman who scalded herself with hot coffee\n  ^    &#34;McLibel pair get police payout&#34;. BBC. 5 July 2000.    &#34; &#39;McLibel&#39; pair in fresh court bid&#34;. BBC. 7 September 2004.     &#34;McLibel: Longest case in English history&#34;. BBC. 15 February 2005.\n ^    &#34;McDonald&#39;s lets McLibel case rest&#34;. AP. 19 July 1997. Archived from  the original on 6 October 2008.\n ^  Press release issued by the Registrar. &#34; Chamber Judgment Steel and Morris v. The United Kingdom&#34; The  European Court of Human Rights, 15 February 2005. Received 1 September 2008.\n ^    &#34;20-year fight ends with libel law in the dock&#34;.  The Guardian. 16 February 2005.\n    ^  &#34;Over the past 15 years, McDonald&#39;s has threatened legal action against more than 90 organisations in the U.K., including the  BBC,  Channel 4, the  Guardian,   The Sun, the  Scottish TUC, the New Leaf Shop, student newspapers, and a children&#39;s theatre group. Even  Prince Philip received a stiff letter. All of them backed down and many formally apologised in court.&#34; from &#34;Why Won&#39;t British TV Show a Film about McLibel?&#34;, Franny Armstrong, 19 June 1998,   The Guardian; as quoted in  No Logo.\n  ^  &#34;For 313 days in court - the longest trial in English history - an unemployed postal worker (Morris) and a community gardener (Steel) went to war with chief executives from the largest food empire in the world.&#34; pg 389 of  No Logo\n    ^   Vidal, john (1997).    McLibel: British Culture on Trial. The New Press. pp.  11–20.\n  ^  Bell J had never tried or appeared as counsel in a libel case. His practice had been primarily criminal law and professional negligence, and some felt that he was &#34;led&#34; by Richard Rampton QC, for McDonald&#39;s, throughout most of the case. [   citation needed]\n  ^  &#34;On 19 June 1997, the judge finally handed down the verdict....It felt like an eternity to most of us sitting there, as Mr Justice Rodger Bell read out his forty-five-page ruling - a summary of the actual verdict, which was over a thousand pages long. Although the judge deemed most of the factsheet&#39;s claims too hyperbolic to be acceptable (he was particularly unconvinced by its direct linking of McDonald&#39;s to &#34;hunger in the &#39;Third World&#39;&#34;), he deemed others to be based on pure fact.&#34; pg 389-390 of  No Logo.\n     ^    &#34;One Brick Court - Barristers&#34;.  onebrickcourt.com. Archived from  the original on 20 December 2008 .\n      ^   Gibb, Frances (16 February 2005).  &#34;McDonald&#39;s gets a taste of defeat as Europe backs the McLibel Two&#34;.  The Times. London .\n    ^   Lewis, Paul; Evans, Rob (21 June 2013).  &#34;McLibel leaflet was co-written by undercover police officer Bob Lambert&#34;.  The Guardian .\n ^   Paul Farrell and Rob Evans (9 March 2016).  &#34;Undercover UK police spy apologises after being tracked down by woman he deceived&#34;.  The Guardian.\n  McLibel: burger culture on trial by John Vidal (Macmillan, 1997; New Press, 1998)   ISBN  0-333-69461-9 (hardcover),   ISBN  0-330-35237-7 (paperback),   ISBN  1-56584-411-4 (US). Afterword by Steel and Morris\n  McWorld on Trial, an extensive article on the case from the point of view of Dave Morris and Helen Steel appears in   The Raven: Anarchist Quarterly, issue 43 (published by  Freedom Press)\n Fast Food Nation (by  Eric Schlosser), an exposé on fast food and the culture it has created, which mentions McLibel in its last few chapters.\n No Logo,  Naomi Klein, 490 pages, cover design Bruce Mau &amp; Barr Gilmore, 1999. Published in USA by  St. Martin&#39;s Press, Picador USA Reading Group imprint, and in Canada by Alfred A. Knopf Canada of Random House Canada Limited.   ISBN  0-312-20343-8 (hardcover);   ISBN  0-312-27192-1 (softcover)\n   &#34;Activists Win Partial Victory in Appeal Over McDonald&#39;s Libel Case&#34;, 31 March 1999,  Associated Press.", "posttime": "2020-05-22 01:48:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "贝尔,mclibel,莫里斯", "title": "麦克利贝尔案", "title_en": "McLibel Case", "transed": 1, "url": "https://en.wikipedia.org/wiki/McLibel_case", "via": "", "real_tags": ["贝尔", "mclibel", "莫里斯"]}, {"category": "", "categoryclass": "", "imagename": "03b6350630d9bcb2e803faaf6ff71c8d.png", "infoid": 1003162, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apache Druid社区在2020年4月20日发布了Druid 0.18。此版本包含来自42个贡献者的200多个新功能、性能增强、错误修复和主要文档改进。\n像往常一样，您可以访问Apache Druid下载页面下载该软件，并阅读详细介绍每个更改的完整发行说明。这个德鲁伊版本也可以作为Impline发行版的一部分提供，该发行版还包括Impline Pivot。\n在成为一个全面的分析引擎的道路上，Druid在0.18中获得了一些新功能，包括改进的子查询、连接和分组集。\n具有多个计算阶段的查询更容易使用子查询表示。Druid引擎在0.18中改进了对子查询的支持。您可以在Druid文档中找到关于子查询支持的更多详细信息。\n请注意，默认情况下，单个查询中的所有子查询共享相同的限制，即100,000行。这是因为中间表位于代理内存中。代理上的内存是共享的有限资源。因此，您应该避免创建输出大型结果集的子查询。\n在关系数据库中，规范化模式很常见。这意味着分析引擎必须能够跨表合并数据。SQL JOINS提供了此功能。\n在0.18.0之前，Druid支持一些连接特性，比如SQL中的查找或半连接。Druid 0.18.0在其历史上首次支持真正的联接，包括支持内部联接、左联接和交叉联接。\n使用联接和子查询，您现在可以表达商业智能用例中使用的许多常见查询。\n在0.18中，联接支持仅限于查找、内联查询和子查询数据源。我们计划在未来增加对更多数据源的支持。让我们知道你想在社区里看到什么。\n具有多个计算阶段的查询更容易使用子查询表示。Druid引擎在0.18中改进了对子查询的支持。您可以在Druid文档中找到关于子查询支持的更多详细信息。\n在0.18中，Druid还引入了分组集。例如，GROUP BY GROUPING SETS((COUNTRY，CITY)，(COUNTRY)，())将创建一个包含3个数据集的结果集，先是在国家-城市级别细分的聚合(例如，SUM)，然后是国家级别(城市为空)，然后是总计。\n例如，当您在报告中执行从地区、城市到州级别的多层汇总时，这尤其有用。这是非常高效的，因为数据只需要扫描一次。\n在具有异构工作负载的多租户环境中，资源争用可能导致短时间运行的查询必须在队列中等待很长时间。在Druid0.18中，我们引入了查询通道和动态优先级排序，让您可以更好地控制如何分配集群中的资源。请在此处查看更多详细信息。\n使用通道，代理检查查询并对其进行分类，并为其分配通道。您还可以选择手动指定车道。您可以指定通道可以使用的最大资源量，确保留出一些容量来处理其他工作负载，例如短时间运行的查询。\n自动查询优先顺序根据查询的开销确定查询优先级。它考虑了扫描了多少数据、查询试图从多远的历史中读取数据，以及估计查询成本的其他一些因素。\n这是朝着更智能的资源分配迈出的又一步，它为集群管理员提供了工具箱中的另一个工具。\nDruid现在支持SQL的动态参数。这可以用来增强安全性。因为它将正确转义参数字符串以避免SQL注入。它还减少了将大量数据传递到查询规划器的需要。因为数据BLOB在规划期间不需要规划者解析，所以它将提高查询规划的性能，并降低查询规划的内存需求。\nDruid支持两种位图类型，咆哮和简明。由于咆哮位图提供了更好的开箱即用体验(通常查询速度更快)，因此默认的位图类型已切换为咆哮位图。\n有关Druid 0.18.0中所有新功能的完整列表，请访问Apache Druid下载页面并查看发行说明！\n返回博客", "note_en": "The Apache Druid community released Druid 0.18 on April 20th, 2020. This release contains over 200 new features, performance enhancements, bug fixes, and major documentation improvements from 42 contributors.\n As always, you can visit the  Apache Druid download page to download the software and read the full release notes detailing every change. This Druid release is also available as part of the  Imply distribution, which includes Imply Pivot as well.\n  On the path towards being a comprehensive analytics engine, Druid has picked up a few new capabilities in 0.18, including improved subqueries, JOINs, and GROUPING SETS\n  Queries that have multiple stages of calculations are easier to express with subqueries. Druid engine has improved support for subqueries in 0.18. You can find more details about subquery support in  Druid documentation.\n   Note that all subqueries in a single query share the same limit of 100,000 rows by default. This is because the intermediate table lives in the broker memory. The memory on the broker is a shared, limited resource. Thus you should avoid creating subqueries that output large result sets.\n  In relational databases, normalized schemas are commonplace. This means that analytical engines must be able to merge data across tables.  SQL JOINs provides this capability.\n Prior to 0.18.0, Druid supported some JOIN features, such as Lookups or semi-joins in SQL. Druid 0.18.0 supports real joins for the first time ever in its history including support for INNER, LEFT, and CROSS joins.\n With JOIN and subqueries, you can now express many common queries used in business intelligence use cases.\n  In 0.18, JOIN support is limited to lookups, inline queries and subquery data sources. We are planning on adding support for more data sources in the future. Let us know what you want to see  in the community.\n  Queries that have multiple stages of calculations are easier to express with subqueries. Druid engine has improved support for subqueries in 0.18. You can find more details about subquery support in  Druid documentation.\n In 0.18, Druid has also introduced GROUPING SETS. For example,  GROUP BY GROUPING SETS ( (country, city), (country), () ) will create a resultset that contains 3 sets of data, an aggregation (e.g., sum) breaking down at country-city level, then country-level, where the city is null, and followed by a grand total.\n This is especially useful when you are doing multiple layers of roll up in reporting, from region, to city, to state level, for example. This is very efficient as the data only needs to be scanned once.\n   In multi-tenant environments with heterogeneous workloads, resource contention can lead to short-running queries having to wait in a queue for a long time. In Druid 0.18, we’ve introduced query laning and dynamic prioritization, giving you more control over how resources in a cluster are allocated.  See more details here.\n With laning, the broker examines and classifies a query and assigns it a lane. You also have the option to manually assign a lane. You can specify the maximum amount of resources a lane can use, ensuring some capacity is left to handle other workloads, such as short-running queries.\n Automatic query prioritization determines the query priority based on how expensive a query is. It takes account of how much data is scanned, how far back in history the query is trying to read from, and a few other factors to estimate the cost of a query.\n This is another step towards smarter resource allocation and it gives cluster administrators another tool in their toolbox.\n  Druid now supports dynamic parameters for SQL. This can be used to enhance security. Because it will correctly escape parameter strings to avoid SQL injections. It also reduces the need to pass large blobs of data into the query planner. Because data blobs don’t need to be parsed by the planner during planning time, it’ll improve the query planning performance and reduce the memory requirement for query planning.\n  Druid supports two bitmap types,  Roaring and  CONCISE. Since Roaring bitmaps provide a better out-of-box experience (faster query speed in general), the default bitmap type has been switched to Roaring bitmaps.\n  For a full list of all new functionality in Druid 0.18.0, head over to the  Apache Druid download page and check out the release notes!\n   Back to blog", "posttime": "2020-05-22 01:47:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apache,查询", "title": "Apache Druid 0.18.0简介", "title_en": "Introducing Apache Druid 0.18.0", "transed": 1, "url": "https://imply.io/post/introducing-apache-druid-0-18-0", "via": "", "real_tags": ["apache", "查询"]}, {"category": "", "categoryclass": "", "imagename": "09ff9d1f763333a9543cda4e92007d1a.png", "infoid": 1003161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昆士兰的一群海豚一直在从海里带着礼物上岸，显然是因为它们缺少与人类的互动。\n座头海豚通常在阳光海岸以北的锡罐湾的藤壶咖啡馆和海豚一起与游客打成一片。\n但由于冠状病毒的限制，游客已经几周没有排队喂食这些动物了。\n海洋生物提供的珍宝包括海绵、覆盖藤壶的瓶子和珊瑚碎片。\n咖啡馆Facebook页面上的一篇帖子写道：“这个豆荚一直在给我们带来常规礼物，告诉我们他们有多想念公众的互动和关注。”\n一名志愿者告诉美国广播公司，虽然豆荚以前也表现出了这种行为，但随着场馆的关闭，这种行为有所增加。\n海豚行为专家巴里·麦戈文(Barry McGoven)表示，海豚送礼可能是因为它们错过了人类，但可能性不大。\n“海豚和它们的行为再也不会让我感到惊讶了，”密歇根大学博士生麦戈文告诉7NEWS.com.au。\n“他们什么都做--他们使用工具，他们有文化，他们有一些与招牌口哨中的名字相似的东西。\n“很可能，它们本身并不怀念人类。他们可能会错过一顿免费的饭菜和例行公事。“。\n他说：“他们经常玩弄杂草、珊瑚和各种各样的东西，然后就把它们放在主席台(鼻子)上。”\n“它们现在已经习惯了进食，所以它们习惯了人类的到来。\n“当它没有发生的时候，也许只是出于无聊。”", "note_en": "A pod of dolphins in Queensland has been bringing ashore gifts from the sea - apparently because they’re missing interaction with humans.\n The humpback dolphins usually mingle with visitors at Barnacles Cafe &amp; Dolphin Feeding at Tin Can Bay, north of the Sunshine Coast.\n But it’s been weeks since visitors lined up to feed the animals due to coronavirus restrictions.\n  Among the treasures the marine creatures have provided are sea sponges, barnacle-encrusted bottles and pieces of coral.\n  “The pod has been bringing us regular gifts, showing us how much they’re missing the public interaction and attention,” said a post on the cafe’s Facebook page.\n  A volunteer told the ABC while the pod has displayed the behaviour before, it had increased while the venue was closed.\n   Barry McGovern, an expert in dolphin behaviour, said it was possible the dolphins were giving gifts because they missed humans, but unlikely.\n “Nothing surprises me with dolphins and their behaviour anymore,” McGovern, a UQ PhD student, told 7NEWS.com.au.\n “They do everything - they use tools, they have culture, they have something similar to names in signature whistles.\n “In all likelihood, they probably don’t miss humans per se. They probably miss a free meal and the routine.”\n   “They often play with bits of weed and coral and all sorts of things and just leave it on their rostrum (nose),” he said.\n “They’re used to getting fed now, so they’re used to humans coming in.\n “When it’s not happening, maybe it’s just out of boredom.”", "posttime": "2020-05-22 01:47:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "景点,popular,人类", "title": "热门景点的海豚错过了游客，不断在岸上留下“礼物”", "title_en": "Dolphins at popular spot miss tourists and keep leaving 'gifts' on shore", "transed": 1, "url": "https://7news.com.au/news/wildlife/dolphins-bring-gifts-from-sea-in-apparent-response-to-lack-of-human-interaction-c-1049565", "via": "", "real_tags": ["景点", "popular", "人类"]}, {"category": "", "categoryclass": "", "imagename": "773a505d78e45e746b5413ef693c70ca.jpeg", "infoid": 1003160, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马克·扎克伯格(Mark Zuckerberg)计划将Facebook Inc.。在接下来的十年里，朝着远程劳动力的方向发展，永久地重新配置这家科技巨头围绕冠状病毒大流行强加给它的分散结构的运营。\n这位Facebook首席执行官周四向员工概述了这项计划，这是商界领袖承诺扩大公司迅速接受的做法以适应危机的最引人注目的例子之一。在从工作场所到战略的问题上，经理们正在重新考虑……", "note_en": "Mark Zuckerberg plans to shift Facebook Inc. toward a substantially remote workforce over the next decade, permanently reconfiguring the tech giant’s operations around the dispersed structure that the coronavirus pandemic forced on it.\n  The plan, which the Facebook chief executive outlined to employees on Thursday, is one of the highest-profile examples of business leaders committing to extend the practices their companies quickly embraced to adjust to the crisis. On matters from workplace to strategy, managers are rethinking...", "posttime": "2020-05-22 01:46:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,facebook,远程", "title": "在冠状病毒之后，Facebook将永久转向更远程的工作", "title_en": "Facebook to Shift Permanently Toward More Remote Work After Coronavirus", "transed": 1, "url": "https://www.wsj.com/articles/facebook-to-shift-permanently-toward-more-remote-work-after-coronavirus-11590081300", "via": "", "real_tags": ["冠状病毒", "病毒", "facebook", "远程"]}, {"category": "", "categoryclass": "", "imagename": "57a70c9849a2a8d81646db2b821c5d51.jpg", "infoid": 1003158, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "也许你很伤心，垂头丧气，步履蹒跚。也许你是愤怒和警觉，直挺挺地匆匆前行。或者，也许你在街上蹦蹦跳跳，快乐得令人恼火。无论你的步态是什么，再加上你的面部表情，这都是在非语言上向其他人发出信号，他们应该给你多少空间--能够准确地阅读这些暗示是我们社会物种的一项基本技能。\n也许对机器人来说也是如此。马里兰大学的研究人员开发了一种名为ProxEmo的算法，这种算法使小型轮式机器人能够实时分析你的步态，并猜测你的感觉。根据感知到的情感，机器人可以选择自己的路线，给你或多或少的空间。对于机器人与人类的互动来说，这似乎是一件小事，但我们也可能会想象，有一天，当机器足够复杂时，它们可能会读懂一个悲伤的人的步态，并试图帮助他们。\n“如果有人感到悲伤或困惑，机器人可以走到那个人面前说，哦，你今天看起来很难过，需要帮助吗？”帮助开发ProxEmo的马里兰大学机器人和人工智能研究员阿尼基特·贝拉(Aniket Bera)说。或者，解释步态的能力可能会帮助机器人在不想与其互动的人周围导航。“就像如果一个愤怒的人走向它，它会给你更多的空间，而不是一个悲伤的人，甚至是一个快乐的人，”他说。\n直截了当地提醒一下：这个情感智能的机器人是基于感知到的情感来行动的。它不能真正读懂任何人的内心状态。即使是人类也不能百分之百肯定地看着另一个人，说他们知道那个人是高兴的、悲伤的还是生气的。但是，作为一个社会物种，我们已经学会了从一个人的步态中读出表明他们情绪状态的蛛丝马迹。这对不惹恼已经被激怒的人类同胞很有用。\n因此，为了建立这个系统，机器人研究人员从人类开始。他们让一群人看着其他人走路，并问了他们一系列关于他们认为步行者的情绪状态是什么的问题。当然，这个练习在很大程度上是主观的。但研究人员从观察同伴的人那里获取了这些数据，然后将其与每个人的步态数据相关联。\n然而，为了理解步态的样子，机器人需要客观的数据，而不是主观的判断。因此，研究人员使用算法分析了人们行走的视频，每个人的图像都覆盖了一个有16个关节的骨骼，包括颈部、肩膀和膝盖。然后，他们使用深度学习算法让系统将某些骨骼步态与人类志愿者与那些行走的人联系在一起的情绪联系起来。\n他们最终采用了新的ProxEmo算法。他们把它装进一个可爱的黄色四轮机器人(来自机器人公司Clearpath的Jackal)，上面安装了一个摄像头。当机器人滚动时，摄像头会观察路过的行人，而ProxEmo会在每个人身上覆盖16个关节的骨骼-这是对步态的客观测量，算法已经学会了将其与某些情绪联系起来。这就是ProxEmo猜测你的情绪状态，并引导机器人尊重你的个人泡沫的方式。如果系统认为你生气了，这个泡沫可能会变大，如果它认为你很高兴，这个泡沫可能会缩小。\n但是这个气泡并不是一个完美的圆形球体--它是长方形的，一种椭球体。贝拉说：“所以你前面有更多的空间，两边有一些空间，而你后面的个人空间更少。”当机器人迎面接近人类时，它需要在前面给出很大的空间，但当它从侧面经过或一旦它在人类后面恢复原来的路线时，就不需要这么做了。\n然而，棘手的是，机器人是根据从实验室环境中行走的人提取的干净数据进行训练的-也就是说，他们的四肢在任何时候都是可见的。但在现实世界中，情况并不总是如此。因此，为了让机器人为一个混乱的世界做好准备，研究人员不得不以“噪音”的形式融入一点混沌。在这种情况下，它不是指声音，而是训练它处理各种变量，比如衣服和人是否携带可能遮住手的东西。贝拉说：“增加噪音不会改变人们的情绪，但我们已经添加了不同种类的噪音，然后训练系统即使一只手不见了，你也会盯着那个人看一段时间。”\n有朝一日，ProxEmo可能会与另一个能读懂面部暗示的系统配对，建立一个更复杂的情商，这使得它更有可能知道它是应该请求帮助，还是应该对这个人敬而远之。如果我们想让机器人在不伤害人或自己的情况下在我们中间行走和滚动，那么它们必须在识别这些细微差别方面做得更好。\n麻省理工学院计算机科学家迪娜·卡塔比(Dina Katabi)没有参与这项研究，她说：“当机器人以不自然的方式行事时，不仅会让人感到不舒服，还可能导致碰撞，因为人无法猜测这个机器人是如何移动的。”“因此，举个例子，如果一个机器人可以避免因为它离得太近而让人感到不舒服，那将是有益的。”\n毕竟，把一个花哨的机器人变成一个非常昂贵的出气筒是没有意义的。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Maybe you’re sad, plodding along with your head slumped and shoulders sagging. Maybe you’re angry and alert, hurrying along upright. Or maybe you’re annoyingly happy, skipping down the street. Whatever your gait, that combined with your facial expression is nonverbally signaling to other people how much space they should give you—and being able to accurately read these cues is an essential skill for our social species.\n And perhaps for robots, too. Researchers at the University of Maryland have developed an algorithm called  ProxEmo, which gives a little wheeled robot the power to analyze your gait in real time, and to take a guess at how you might be feeling. Based on that perceived emotion, the robot can choose its route to give you more or less space. This might seem like a small matter for robot-human interactions, but we might also imagine that one day, when machines are sophisticated enough, they might read a sad person’s gait and try to help them.\n “If somebody&#39;s feeling sad or confused, the robot can go up to the person and say,  Oh you&#39;re looking sad today, do you need help?” says Aniket Bera, a robotics and AI researcher at the University of Maryland, who helped develop ProxEmo. Or, the ability to interpret gait might help the robot navigate around a person who wouldn’t want to interact with it. “Like if an angry person were to walk towards it, it would give more space, as opposed to a sad person or even a happy person,” he says.\n  A caveat right off the bat: This emotionally intelligent robot is basing its actions on  perceived emotions. It can’t truly read anyone’s inner state. Not even a human can look at another and say with 100 percent confidence that they know if that person is happy, sad, or angry. But as a social species, we’ve learned to read telltale clues in a person’s gait that indicate their emotional state. That’s useful for not pissing off an already pissed-off fellow human.\n  So to build this system, the robotics researchers began with humans. They had a group of people look at other people walking, and asked them a series of questions about what they thought the walker’s emotional state was. This exercise was largely subjective, of course. But the researchers took this data from people observing their fellow humans and then correlated it with data about each person’s gait.\n  In order to understand how a gait looks, though, the robot needs objective data, not subjective judgements. So the researchers used algorithms that analyzed videos of the people walking, with each person’s image overlaid by a skeleton with 16 joints, including at the neck, shoulders, and knees. Then, they used deep learning algorithms to get the system to associate certain skeletal gaits with the emotions that the human volunteers associated with those walking people.\n  They ended up with the new ProxEmo algorithm. They load this into a cute little yellow four-wheeled robot (the Jackal, from the robotics company Clearpath) with a camera mounted on it. As the robot rolls along, the camera watches passing pedestrians, while ProxEmo overlays each human with that 16-joint skeleton—the objective measurement of gaits, which the algorithm has learned to associate with certain emotions. That’s how ProxEmo can take a guess at your emotional state, and direct the robot to respect your personal bubble, which may grow larger if the system thinks you’re angry, and shrink if it thinks you’re happy.\n  But this bubble isn’t a perfectly rounded sphere—it’s oblong, a kind of ellipsoid. “So there&#39;s more space ahead of you, there&#39;s some space at the sides, and there&#39;s less personal space behind you,” says Bera. When the robot is approaching a human head-on, it needs to give a lot of space up front, but less so as it passes on the side or when it resumes its original course once it’s behind the human.\n  The tricky bit, though, is that the robot trained on clean data extracted from people walking in a lab environment—that is, their limbs were all visible at all times. But that isn’t always the case in the real world. So to prepare the robot for a chaotic world, the researchers had to incorporate a little bit of chaos in the form of “noise.” In this context, it doesn’t mean sound, but training it to handle variables like clothing and if the person is carrying something that might cover their hand. “Adding noise won&#39;t change the emotion, but we&#39;ve added different kinds of noises, and then trained the system to understand even if one hand is missing, you&#39;ve still been looking at that person for a while,” says Bera.\n One day, ProxEmo might be paired with another system that reads facial cues, building an even more complex emotional intelligence, which makes it more likely to know if it should ask to be of assistance, or give the person a wide berth. Robots have to get much, much better at picking up such nuances, if we want them to walk and roll among us without hurting people or themselves.\n “When robots behave in an unnatural way, not only can people become uncomfortable, but also it can lead potentially to collisions, because the person cannot guess how this robot is moving,” says MIT computer scientist Dina Katabi, who wasn’t involved in this work. “So if a robot, for example, can avoid making people uncomfortable because it&#39;s getting too close, that would be beneficial.”\n No sense, after all, in turning a fancy robot into a very expensive punching bag.\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-05-22 01:45:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,走路,guess", "title": "机器人可以通过你走路的方式猜出你的感觉", "title_en": "Robot Can Guess How You're Feeling by the Way You Walk", "transed": 1, "url": "https://www.wired.com/story/proxemo-robot-guesses-emotion-from-walking/", "via": "", "real_tags": ["机器人", "走路", "guess"]}, {"category": "", "categoryclass": "", "imagename": "b26fcc2ec79ab33170f4cf1b79d33806.jpeg", "infoid": 1003157, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，我希望你们都做得很好，今天一如既往地保持健康、安全和脚踏实地，我将用我们每周内部问答的大部分时间来谈论远程工作，我们到目前为止学到了什么，我们正在计划做什么，我现在分享这些是为了让你们所有的员工都清楚，同时也要现场直播。今天，你知道，通常不会这样做，但我会这样做以防万一。这对其他机构来说很有帮助，他们正在考虑未来的工作，以及他们的公司将如何发展。现在，我认为很明显，Covet改变了我们的生活，这当然包括我们大多数人现在的工作方式，我们在Facebook的绝大多数人，大约95%或更多的公司目前正在远程工作，我们已经告诉人们，到2020年，如果他们能够完成工作，他们可以选择在家工作。他们的工作效率很高，也符合社交距离的要求。由于我们正在考虑开设办事处，我们认为我们最初只会达到大约25%的密度和容量。因此，我们中的许多人将不得不在一段时间内远程工作，在这段时间内来来去去。我预计远程工作将成为一种日益增长的趋势。另外，所以今天，我想花点时间来回顾一下我们到目前为止从我们进行的谈话和研究中学到的一些教训。我想总结这次调查的结果，我们要求你们所有人在内部进行，而且我们有相当好的参与度，所以我为你们所有人提供了一些关于人们正在进行哪些挑战的统计数据，并提出了一些问题，嗯，因为我们是孩子最多的一半。我想要为你们所有人提供一些统计数据，了解人们在做什么挑战，并提出问题，嗯，因为我们是最大的孩子，一半的人都参与了这项调查，所以我为你们所有人提供了一些统计数据，告诉你们人们在做什么挑战，并提出问题，呃，因为我们是最大的孩子，一半是孩子。前面没有水啊，开放的基督徒们，我们在哪里可以引进国会，嗯，在今天的基本总结中，我想一个啊基本的曲折瞬间，我想我们将是最多的", "note_en": "Hey everyone I hope you&#39;re all doing well and staying healthy and safe and grounded as always today, I&#39;m gonna take most of this hour that we have for our internal weekly Q and A to talk about remote work and what we&#39;ve learned so far and what we&#39;re planning on doing and I&#39;m sharing this now to give clarity to to all of you our employees but but also live streaming this. Today, which you know, usually don&#39;t do but I&#39;m doing this in case. it&#39;s helpful to other organs out there who are thinking about the future of work and how their companies are gonna evolve as well. Now, I think it&#39;s clear that that that covet has changed a lot about our lives and that&#39;s certainly includes the way that most of us work at this point, the vast majority of us here at Facebook, about 95 percent of the company or more are working remotely at this point and We we&#39;ve already told people that through 2020 they can choose to work from home if they can do their job. They&#39;re productively and also with social distancing requirements. as we&#39;re looking at opening up offices, we think we&#39;re gonna get initially to about only 25 percent density and capacity. so a lot of us are gonna have to work remotely for some time to come and coming out of this period. I expect that that remote work is going to be a growing trend. As well, so today, I wanna take some time to go through some of the lessons that we&#39;ve learned so far both from conversations that we&#39;ve had and the research that we&#39;ve done I wanna summarize the results of this survey that we&#39;ve that we&#39;ve asked all of you to take internally and that we have pretty good participation on so I have some stats for all of you on what what people are looking at doing challenges and open the questions uh because we were the one most child half months service uhm but there&#39;s no water ah open christians ahead there network where is we we can import congress that&#39;s face uhm by in the the the basic summary for today i think one ah basic sinuway instant of i think we&#39;re going to be the most for", "posttime": "2020-05-22 01:44:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "市政厅,zuckerberg", "title": "马克·扎克伯格市政厅直播流", "title_en": "Mark Zuckerberg Townhall Live Stream", "transed": 1, "url": "https://www.facebook.com/zuck/videos/10111936118050541", "via": "", "real_tags": ["市政厅"]}, {"category": "", "categoryclass": "", "imagename": "a681b9d4cd5f00450ccb72bd6ab2e223.jpeg", "infoid": 1003156, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着冠状病毒导致的经济余波进一步蔓延，数百万美国人正在努力偿还债务。\n信用报告机构TransUnion的最新报告显示，4月份进入财务困境状态的信用卡账户比例飙升至3.2%，即1,470万个账户。这一比例在4月份飙升，而2020年3月仅为0.01%，去年同期为0.03%。\n汽车贷款也陷入了类似的困境，上个月有3.5%，即近300万个账户无法支付月度还款。\nTransUnion表示，目前约有270万笔抵押贷款，即此类贷款的5%处于财务困境。住房贷款违约率较一年前有所下降，尽管使用忍耐计划可能会推迟违约率的上升。\n包括忍耐和延期计划在内的救济计划允许借款人推迟一些付款，并优先偿还哪些债务。TransUnion负责研究和咨询的副总裁马特·科莫斯(Matt Komos)说，政府的2万亿美元刺激法案为那些苦苦挣扎于信贷产品的人提供了一些选择，但国会可能需要采取进一步行动。\n他在周三的报告中表示，虽然这些计划为消费者提供了暂时的缓解，但银行和贷款人正在寻找进一步的监管指导，以确定一旦刺激计划枯竭，下一步应该采取什么措施。\n虽然冠状病毒大流行最初是作为全球生产商的供应链问题出现的，但它很快就成为近一个世纪以来最大的经济威胁。飙升的失业率使得更多的美国人每月支付利息的能力下降，而长达数年的借款增加趋势势必加剧这个问题。\n根据TransUnion的数据，第一季度每个借款人的平均信用卡债务达到5,653美元，比去年同期增加了近100美元。拖欠率和信用卡总数也比2019年第一季度大幅上升。\n借款人没有帮助就无法生存。在美国疫情爆发后，几家贷款机构为贷款和信用卡提供了免费忍耐选项。然而，短期解决方案给贷款人带来了压力，并有可能在最后期限恢复后引发一波违约浪潮。", "note_en": "Millions of Americans are struggling to pay off debt as coronavirus-led economic fallout spreads further.\n The share of credit-card accounts entering &#34;financial hardship&#34; status spiked to 3.2%, or 14.7 million accounts, in April, according to a new  report from credit-reporting agency TransUnion. The proportion spiked higher in April from just 0.01% in March 2020 and 0.03% in the year-ago period.\n Auto loans posted a similar slide into hardship, with 3.5%, or nearly three million accounts, unable to cover monthly payments last month.\n About 2.7 million mortgages, or 5% of such loans, are currently in financial hardship, TransUnion said. Home loan delinquencies have dropped from their year-ago readings, though usage of forbearance programs could delay an uptick in defaults.\n   Relief programs including forbearance and deferment plans allow borrowers to delay some payments and prioritize which debts to pay off first. The government&#39;s $2 trillion stimulus bill opened some options for those struggling with credit products, but Congress will likely need to act further, Matt Komos, vice president of research and consulting at TransUnion, said.\n  &#34;While these programs are providing consumers with temporary relief, banks and lenders are looking for further regulatory guidance as to what next steps should be taken once stimulus packages dry up,&#34; he said in the Wednesday report.\n While the coronavirus pandemic first emerged as a supply-chain issue for global producers, it&#39;s quickly emerged as the biggest economic threat in nearly a century. Soaring unemployment left more Americans less able to make monthly interest payments, and a years-long trend in increased borrowing stands to exacerbate the problem.\n   The average credit card debt per borrower reached $5,653 in the first quarter, up nearly $100 from the year-ago period, according to TransUnion. Delinquency rates and the gross number of credit cards have also jumped from the first quarter of 2019.\n Borrowers aren&#39;t without help. Several lenders have offered free forbearance options for loans and credit cards in the wake of the US outbreak. Yet the short-term solution places pressure on lenders and risks a wave of defaults once deadlines are reinstated.", "posttime": "2020-05-22 01:44:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上个月,card,计划", "title": "美国人上个月拖欠了1800万张信用卡/汽车贷款。", "title_en": "Americans fell behind on 18M credit-card / auto-loan payments last month", "transed": 1, "url": "https://www.businessinsider.com/debt-credit-card-auto-loan-payments-missed-april-coronavirus-economy-2020-5", "via": "", "real_tags": ["上个月", "card", "计划"]}]