[{"category": "", "categoryclass": "", "imagename": "1b11fa48531541054bf8b7976a11f5f9.jpg", "infoid": 1028574, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于已经购买了苹果生态系统的家庭来说，这项功能最有意义，因为你可以在iPhone、iPad、Apple Watch、Mac甚至AirPods和CarPlay上使用对讲机。\n例如，正如苹果今天演示的那样，父母可以宣布，是时候通过苹果设备下楼了，然后联系到家里各处的家人，然后家人可以使用离他们最近的苹果设备做出回应。\n要使用对讲机，用户会说“嘿，Siri，告诉所有人…”然后是他们想要发送的信息。然后，消息接收者可以说“嘿，Siri，回复…”来回答。他们的反应。\n从技术上讲，你并不是在所有的设备上“大喊大叫”。苹果公司表示，内部通信信息将在家里的HomePod扬声器和用户的AirPods上播放，而通知将出现在个人设备上。\n苹果利用其整个生态系统使对讲机等功能更有用的能力，可能会被证明是智能扬声器领域相对于市场领先者亚马逊(Amazon)和谷歌(Google)的竞争优势，这两家竞争对手已经在智能扬声器和显示器上提供了类似对讲机的功能。\n新款HomePod Mini的99美元价位将使其更容易为更广泛的受众所接受。消费者可能也会动摇从苹果购买，因为当涉及到如何处理语音录音时，苹果支持隐私。", "note_en": "The feature will make the most sense for households that have already bought into the Apple ecosystem, as you’ll be able to use Intercom across iPhone, iPad, Apple Watch, Mac and even AirPods and CarPlay.\n For example, as Apple demoed today, a parent could announce that it was time to go via an Apple device downstairs, and reach family throughout the home, who could then respond using the Apple device nearest them.\n  To use Intercom, users would say “Hey Siri, tell everyone…” followed by the message they want to send. Message receivers could then answer by saying “Hey Siri, reply…” with their response.\n Technically speaking, you aren’t “shouting” across all your devices. Apple says Intercom messages will play on HomePod speakers in the home and on users’ AirPods, while notifications will appear on personal devices instead.\n Apple’s ability to leverage its entire ecosystem to make a feature like Intercom more useful could prove to be a competitive advantage in the smart speaker space versus market leaders Amazon and Google — rivals that already offer Intercom-like features on their smart speakers and displays.\n The $99 price point for the new HomePod Mini will make it more accessible to a wider audience. Consumers may also be swayed to buy from Apple because of its support for privacy when it comes to how it handles voice recordings.", "posttime": "2020-10-14 02:22:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,homepod,debuts", "title": "苹果首次推出对讲机，让用户通过HomePod扬声器快速通话，类似于Alexa的“宣布”功能", "title_en": "Apple debuts Intercom, letting users quickly talk across their HomePod speakers, similar to Alexa's “announce” feature", "transed": 1, "url": "https://techcrunch.com/2020/10/13/apples-new-intercom-feature-will-let-you-shout-across-your-apple-devices/", "via": "", "real_tags": ["apple", "苹果", "homepod", "debuts"]}, {"category": "", "categoryclass": "", "imagename": "2ff4860a5cdbe5ec1cbd5973d087fa1b.jpg", "infoid": 1028573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司(Apple)发布了新版HomePod智能扬声器，售价99美元的HomePod mini--这是一款更小的扬声器，将原来的型号缩小到更紧凑的尺寸。\n与全尺寸HomePod一样，HomePod Mini的特点仍然是黑白两种颜色的网状织物外观，顶部还有一个小显示屏，以显示Siri波形和音量控制。然而，新的型号更像是一个短小的球形，而不是原来的长方形设计。HomePod Mini的特点是一个主驱动器，两个被动辐射器，底部有一个“声波导”。\n新的HomePod mini还配备了苹果S5芯片，苹果公司表示，该芯片允许“计算音频”处理，以调整你的音乐每秒180次的声音。多个HomePod迷你扬声器可以同步播放音乐，并“智能”地创建立体声配对。苹果还在使用去年在iPhone上首次亮相的U1芯片，以在今年晚些时候创造更好的切换体验。\n同样在今年晚些时候，苹果承诺支持第三方音乐服务，其中将包括Pandora，Amazon Music和iHeartRadio-但值得注意的是，Spotify不会。\n苹果公司首次推出了一项新的“对讲”功能，允许在不同房间拥有多台HomePod设备的客户在整个房间内进行通信。对讲信息也将出现在联网的iPhone、iPad和Apple手表上(尽管它们不会像在HomePod mini上那样立即大声播放)。\n最初的HomePod在2018年首次发布时售价为349美元，比亚马逊的Echo或谷歌的家庭扬声器贵得多。高昂的价格，再加上原版只能在苹果上使用的限制(它只适用于Apple Music，苹果直到今年秋天才用iOS 14解决这个问题)，这使得它很难卖出去，特别是与更便宜、更强大的谷歌和亚马逊(Amazon)替代产品相比。\n虽然苹果最终会继续降低最初的HomePod的价格(现在它的常规售价为199美元)，但它仍然很贵。新的HomePod mini应该有助于改变这一点，它提供了与原来类似的功能，但价格要便宜得多。\n这也是一个大问题，因为HomePod不仅仅是一款智能扬声器--它还是任何HomeKit设备的中央枢纽，使用户能够在不在家的时候控制灯或门等东西，并为苹果的Home应用程序启用自动化功能。一个更容易使用的HomePod不仅为苹果公司提供了更多的方式将Siri和Apple Music带入人们的家庭，而且还有助于扩大苹果作为智能家居设置的一部分的整个存在。\nHomePod迷你售价为99美元。11月6日开始预订，11月16日开始发货。", "note_en": "Apple has announced a new version of its HomePod smart speaker, the $99 HomePod mini — a smaller version of the speaker that shrinks down the original model into a more compact size.\n Like the full-size HomePod, the HomePod mini still features a mesh fabric exterior in both black and white colors, along with a small display on top to show the Siri waveform and volume controls. The new model is more of a short, spherical shape, however, instead of the oblong design of the original. The HomePod mini features one main driver, two passive radiators, and an “acoustic waveguide” on the bottom.\n   The new HomePod mini also features an Apple S5 chip, which Apple says allows for “computational audio” processing to adjust how your music sounds 180 times per second. Multiple HomePod mini speakers can play music in sync and “intelligently” create stereo pairing when placed in the same room. Apple is also using the U1 chips that it debuted in last year’s iPhones to create a better Handoff experience later this year.\n Also coming later this year: Apple’s promised support for third-party music services, a list that will include Pandora, Amazon Music, and iHeartRadio — but notably, not Spotify.\n   Apple debuted a new “Intercom” feature that allows for customers with multiple HomePod devices in different rooms to communicate throughout the house. Intercom messages will also appear on connected iPhones, iPads, and Apple Watches (although they won’t immediately play out loud like they do on the HomePod mini).\n The original HomePod cost $349 when it first launched in 2018, making it far more expensive than any of Amazon’s Echo or Google’s Home speakers. That high price, combined with the Apple-only limitations of the original (which only worked with Apple Music, a problem that Apple is only now fixing with iOS 14 this fall), made it a tough sell, especially when compared to cheaper and more capable Google and Amazon alternatives.\n And while Apple would eventually go on to cut the price of the original HomePod (it now routinely costs $199 on sale), it’s still pricey. The new HomePod mini should help change that by offering similar features to the original but at a far more palatable price point.\n That’s a big deal, too, because the HomePod isn’t just a smart speaker —  it serves as a central hub for any HomeKit devices, enabling users to control things like their lights or doors when they’re not at home, as well as enabling automation features for Apple’s Home app. A more accessible HomePod doesn’t just provide more ways for Apple to get Siri and Apple Music into people’s homes, it helps expand Apple’s entire presence as part of your smart home setup.\n   The HomePod mini will cost $99. Preorders start on November 6th and shipping begins on November 16th.", "posttime": "2020-10-14 02:22:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,芯片,apple,苹果,网状", "title": "苹果首次推出HomePod mini，球形设计，S5芯片，织物网状外观，黑白选项，顶部有小屏幕；预购11月6日起，99美元起", "title_en": "Apple debuts HomePod mini with spherical design, S5 chip, fabric mesh exterior, black and white options, a small screen on top; pre-orders start Nov. 6 from $99", "transed": 1, "url": "https://www.theverge.com/2020/10/13/21432979/apple-homepod-mini-features-specs-price?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["设计", "芯片", "apple", "苹果", "网状"]}, {"category": "", "categoryclass": "", "imagename": "450bcf3649af42b648e20c2d206ebd2f.jpg", "infoid": 1028572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在争先恐后地成为世界上第一家推出商用5G服务的运营商后，美国顶级蜂窝公司Verizon花了两年时间在美国大片土地上推广5G网络硬件，危及下一代技术的国内前景。今天，Verizon终于准备推出其全国性的5G网络-5G Nationwide-但有一个重要的警告：用户体验可能不会比4G级别的性能更好。\n虽然理想的5G网络应该有专门为最新、最快蜂窝标准的设备提供服务的塔楼，但Verizon押注于一种新的5G技术-毫米波小蜂窝-由于其短广播范围和与安装相关的监管批准，该技术很快就遇到了麻烦。该运营商之前的5G超宽带网络现在30多个城市的部分地区都可以找到，但非常强调“部分”，因为在某些情况下，5G连接只在少数几个特定的城市街区之外才能使用，通常甚至不能在位于那里的建筑物内使用。幸运地连接到Verizon简略得令人尴尬的5G UWB塔楼的用户可能会体验到变革性的4Gbps峰值速度，但可能会因为步行几步远或在室内而失去信号。在今天举行的苹果“Hi，Speed”iPhone 12活动中，Verizon首席执行官汉斯·维斯特伯格表示，5G UWB将在年底前在60个城市开通。\n相比之下，5G Nationwide提供了5G覆盖毯子，可以在室内和室外访问-足以在手机屏幕上保持“5G”标志-但不能访问5G支持的高速毫米波。这在很大程度上是因为Verizon Inc正在使用一种名为动态频谱共享(DSS)的技术，将其一些较老的4G塔楼拆分成混合4G-5G无线电系统，根据当前需求将每个塔楼不断变化的部分容量分配给4G和5G设备。如果设置得当，DSS可能会使200台4G设备每台保持10 Mbps的下载速度，而50台5G设备每台可以享受40 Mbps的下载速度，但在现实中，5G设备可能没有那么慷慨的分配。5G设备可能只会看到30%的提升，而不是400%的性能，而4G设备可能会看到不必要的峰值上限。\nVerizon的推出与美国电话电报公司(AT&amp；T)类似，后者最初面向企业推出“5G+”毫米波服务，7月下旬扩展到使用DSS的“全国5G”服务。尽管AT&amp；的5G覆盖图参差不齐，而且远远小于其4G覆盖范围，但它能够在395个覆盖市场中宣称可为2.05亿潜在客户提供服务。相比之下，竞争对手T-Mobile有一些完全专用于5G的中低频段塔楼，根据具体市场的不同，提供的服务速度从平淡无奇的4G到几倍的速度不等。T-Mobile声称将继续利用技术进步来提升其中低频段5G性能。\nVerizon推出5G Nationwide恰逢苹果宣布推出iPhone 12系列，该系列普遍包括中低频段5G支持，以及美国机型对高频段的支持。在最近的一项研究中，许多Android手机之前都有不同类型的5G支持，总共占美国智能手机总销量的13.5%。", "note_en": "After rushing to become the first carrier to launch commercial 5G services anywhere in the world, top U.S. cellular company Verizon has spent two years  struggling to spread 5G network hardware across the large American land mass, imperiling the next-generation technology’s domestic prospects. Today, Verizon is finally ready to launch its national 5G network — 5G Nationwide — but there’s an important caveat: Users  might not experience better than 4G-level performance.\n While the ideal 5G network would have towers dedicated solely to serving devices on the latest and fastest cellular standard, Verizon bet on a new 5G technology — millimeter wave small cells — that quickly ran into trouble thanks to its short broadcasting range and installation-related regulatory approvals. The carrier’s prior 5G Ultra Wideband network is now found in parts of over 30 cities, but with heavy emphasis on “parts,” as 5G connectivity is in some cases available only outside at a handful of specific city blocks, and generally not even inside buildings located there. Users lucky enough to connect to Verizon’s awkwardly-abbreviated 5G UWB towers may experience transformative-class 4Gbps peak speeds, but might lose signal by walking steps away or indoors. During  Apple’s “Hi, Speed” iPhone 12 event today, Verizon CEO Hans Vestberg said that 5G UWB will be available in 60 cities by year’s end.\n  By contrast, 5G Nationwide provides a 5G coverage blanket that can be accessed indoors and outdoors — enough to keep a “5G” logo on a phone’s screen — but without access to the high speeds millimeter wave 5G enables. That’s largely because Verizon is splitting some of its older 4G towers into hybrid 4G-5G radio systems using a technology called dynamic spectrum sharing (DSS), allocating shifting parts of each tower’s capacity to 4G and 5G devices based on current demand. Set up properly, DSS might enable 200 4G devices to each retain 10Mbps download speeds while 50 5G devices each enjoy 40Mbps download speeds, but in reality, the 5G devices might not have as generous an allotment. Rather than 400% performance, 5G devices might only see a 30% uptick, and 4G devices could see their peaks unnecessarily capped.\n  Verizon’s launch parallels AT&amp;T’s, which began with the debut of “5G+” millimeter wave service to businesses, and in late July expanded to a  “5G nationwide” service using DSS. Though spotty and far smaller than its 4G footprint, AT&amp;T’s 5G coverage map enabled it to claim availability for 205 million potential customers across 395 coverage markets. Rival T-Mobile, by comparison, has some low and mid band towers dedicated fully to 5G, delivering service that ranges from unimpressively 4G-like to several times faster, depending on the specific market. T-Mobile has claimed that it will  continue to leverage technology improvements to boost its low and mid band 5G performance.\n Verizon’s launch of 5G Nationwide coincides with Apple’s announcement of the  iPhone 12 family, which universally includes low and mid band 5G support, as well as high band support on U.S. models. Numerous Android phones were previously available with varying types of 5G support,  collectively representing 13.5% of the total smartphone sales in the United States in a recent study.", "posttime": "2020-10-14 02:22:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "性能,iphone,apple,苹果,5g", "title": "Verizon推出了5G全国网络，尽管用户可能不会体验到比4G更好的性能，因为苹果将5G引入了新款iPhone", "title_en": "Verizon launches its 5G Nationwide network, though users might not experience better performance than 4G, as Apple brings 5G to its new iPhones", "transed": 1, "url": "https://venturebeat.com/2020/10/13/verizon-finally-launches-5g-nationwide-network-splitting-4g-spectrum/", "via": "", "real_tags": ["性能", "iphone", "apple", "苹果", "5g"]}, {"category": "", "categoryclass": "", "imagename": "31e37f3d5f32bb15fa94a1bd47e16cc2.jpg", "infoid": 1028571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果重振了其MagSafe充电品牌：它不再是MacBook系列，而是新的iPhone12系列。这一声明是在苹果公司一年一度的iPhone发布会上发布的，证实了上周的传言，即苹果将重新推出磁充电电缆，该电缆从2016年开始逐步淘汰笔记本电脑系列，推出第一款USB-C MacBook。\n笔记本电脑的MagSafe在很大程度上是一项安全功能，可以确保你不会因为被电源线绊倒而损坏电缆或充电端口，或者让你的MacBook从桌子上飞起来。这是因为磁铁在用任何相当大的力拉动时都可以很容易地断开连接。\n新的MagSafe品牌完全是关于移动的，它将配备一套全新的以智能手机为中心的配件。其中包括一个连接到新款iPhone背面的磁性钱包，一个新的皮套，它可以将手机切换到似乎是iOS的新时钟模式，只显示时间，以及iPhone和Apple Watch的组合式折叠充电器。\n值得一提的是，与之前的MagSafe版本不同，MagSafe使用磁铁将电缆夹在苹果笔记本电脑的端口上，这一新版本是为无线充电更加普及的世界量身定做的。\n在这种情况下，适用于iPhone的MagSafe将使您的iPhone更容易连接到支持的无线充电器(从iPhone8/iPhone X开始支持)，包括来自第三方的充电器。苹果关于MagSafe的最新新闻稿写道：“客户还可以期待来自第三方制造商的创新MagSafe配件，这应该会消除人们对公司将锁定这一产品的担忧。”贝尔金已经被确认为合作伙伴之一，这在苹果演示期间的幻灯片上可以看到。\n不过，苹果将拥有自己的充电器，包括独立的MagSafe iPhone充电器和苹果确认的Apple Watch-iPhone组合充电器，名为MagSafe Duo Charger。两者都将支持15W的功率。\n目前还不清楚这四款新iPhone将捆绑哪些类型的充电器或线缆，其中包括标准iPhone 12，新款iPhone 12 Mini，iPhone 12 Pro和12 Pro Max。但苹果新的在线商店现在有了MagSafe部分，确认MagSafe iPhone充电器的价格为39.99美元，以及MagSafe保护套的价格，但尚未确定两人充电器的产品上市。", "note_en": "Apple has revived its MagSafe charging brand with a twist: it’s no longer for its MacBook line but instead for the  new iPhone 12 line. The announcement, made during the company’s annual iPhone reveal,  confirmed rumors from last week that Apple would be bringing back its magnetic charging cable that it began phasing out of its laptop line starting in 2016 with the first USB-C MacBook.\n MagSafe for laptops was mostly a safety feature, ensuring you couldn’t ruin your cable or charging port — or send your MacBook flying off a table — by tripping over the cord. That’s because the magnets allowed for easy disconnection when pulled with any considerable amount of force.\n The new MagSafe brand is all about mobile, and it will come with a whole new set of smartphone-centric accessories. Those include a magnetic wallet that connects to the back of the new iPhones, a new leather cover that switches the phone into what appears to be a new clock mode for iOS with just the time showing, and a combo folding charger for both the iPhone and Apple Watch.\n  It’s important to note that unlike the prior version of MagSafe, which used magnets to grip cables to the ports on Apple laptops, this new version is tailored for a world where wireless charging is much more widely available.\n In this case, MagSafe for iPhone will make it easier to connect your iPhone to supported wireless chargers (supported since the iPhone 8 / iPhone X), including those from third-parties. “Customers can also expect innovative MagSafe accessories from third-party manufacturers,”  reads Apple’s new press release regarding MagSafe, which should eliminate fears the company was going to lock this down. Belkin is already confirmed as one of the partners, as seen on slides during Apple’s presentation.\n Apple will have chargers of its own, though, including a standalone MagSafe iPhone charger and that combo Apple Watch-iPhone charger the company has confirmed is called the MagSafe Duo Charger. Both will support 15W of power.\n It’s not yet clear what kinds of chargers or cables will be bundled with the four new iPhones, which include the standard iPhone 12, the new iPhone 12 Mini, the iPhone 12 Pro, and the 12 Pro Max. But Apple’s new online store now has a  MagSafe section, confirming a price for the  MagSafe iPhone charger at $39.99, as well as prices for MagSafe cases but no product listing yet for the Duo Charger.", "posttime": "2020-10-14 02:22:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,apple,苹果,发布,announces", "title": "苹果发布了iPhone12的MagSafe，让用户可以磁性地连接充电器、钱包和其他配件", "title_en": "Apple announces MagSafe for iPhone 12, letting users magnetically attach chargers, wallets, and other accessories", "transed": 1, "url": "https://www.theverge.com/2020/10/13/21509659/apple-iphone-12-magsafe-charging-magnetic-charger-return?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["iphone", "apple", "苹果", "发布", "announces"]}, {"category": "", "categoryclass": "", "imagename": "b9ef919ef817102e06b90a21e715b557.png", "infoid": 1028570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司今天发布了一款新的iPhone12迷你手机。继之前在iPod mini、iPad mini和Mac mini上使用“mini”之后，这是苹果首次在其iPhone系列上使用“mini”这个绰号。新的iPhone12迷你手机有5.4英寸的屏幕，这意味着苹果公司将比今年iPhoneSE的4.7英寸屏幕更大的显示屏挤进了整体较小的iPhone 12迷你手机中。\n苹果公司(Apple)将售价699美元的iPhone12迷你手机变得更小，取消了Touch ID，取而代之的是面部ID，同时大幅减少了显示屏周围的边框。苹果声称这是世界上最小、最薄、最轻的5G手机。\n和iPhone 12一样，iPhone 12 mini也使用了苹果的A14仿生芯片，这是一款5纳米的芯片，能效和性能都比A13更好。它包括一个六核CPU(两个高，四个低)，苹果声称比A13芯片快50%。它还包括一个四核GPU，苹果声称这将支持“控制台质量的游戏”。\nIPhone12迷你也分享了iPhone12的其他主要规格。这包括一个1200万像素的f/1.6主摄像头迄今所有iphone中光圈最快的一个和一个1200万像素的超宽相机。苹果改进了iPhone 12 mini的微光性能，前置摄像头也将包括自己的夜间模式。\nIPhone12 mini的显示玻璃也涂上了苹果所说的“陶瓷盾牌”，以提高耐用性。耐水性和防尘性也已提高到IP68级。\n苹果还在iPhone12上使用了新的MagSafe磁铁系统。它支持无线充电器(包括支持QI的设备)、表壳配件，甚至可以贴在设备后面的皮钱包。\n苹果的iPhone12 mini起价699美元，有蓝色、绿色、黑色、白色和红色五种颜色可供选择，iPhone 12 mini的预订将于11月6日太平洋时间上午5点/美国东部时间上午8点开始，手机将于11月13日发货。", "note_en": "Apple is announcing a new iPhone 12 mini today. It’s the first time Apple has used the “mini” moniker on its iPhone line, after using it on the iPod mini, iPad mini, and Mac mini previously. The new iPhone 12 mini has a 5.4-inch screen, which means Apple has squeezed a larger display than the 4.7-inch screen found on this year’s iPhone SE into an iPhone 12 mini handset that’s smaller overall.\n Apple has made the $699 iPhone 12 mini smaller by removing Touch ID and replacing it with Face ID, alongside a significant reduction in bezels around the display. Apple claims it’s the smallest, thinnest, and lightest 5G phone in the world.\n   Like  the iPhone 12, the iPhone 12 mini uses Apple’s A14 Bionic, a 5nm chip with better energy efficiency and performance than the A13. It includes a six-core CPU (two high and four low) that Apple claims is 50 percent faster than the A13 chip. It also includes a four-core GPU, that Apple claims will enable “console quality games.”\n The iPhone 12 mini shares the rest of the main iPhone 12 specs, too. That includes a 12-megapixel f/1.6 main camera — the fastest aperture in any iPhone yet — and a 12MP ultra-wide. Apple has improved low-light performance on the iPhone 12 mini, and the front-facing camera will also include its own Night Mode.\n  The display glass on the iPhone 12 mini is also coated with what Apple describes as a “Ceramic Shield” for better durability. Water and dust resistance has also been improved to an IP68 rating.\n Apple is also using the new MagSafe magnet system on the iPhone 12. It supports wireless chargers (including Qi-enabled devices), case accessories, and even leather wallets that all snap onto the rear of the device.\n Apple’s iPhone 12 mini is priced starting at $699, and will be available in five color options: blue, green, black, white, and red, Preorders for the iPhone 12 mini will begin on November 6th at 5AM PT / 8AM ET, with the handset shipping on November 13th.", "posttime": "2020-10-14 02:21:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,apple,苹果,发布,oled", "title": "苹果发布售价699美元的迷你iPhone 12，配备5.4英寸OLED显示屏，五色，规格与iPhone 12相似", "title_en": "Apple announces the $699 iPhone 12 mini with 5.4-inch OLED display, five colors, and similar specs to the iPhone 12", "transed": 1, "url": "https://www.theverge.com/2020/10/13/21507425/apple-iphone-12-mini-new-model-features-price-release-date-size?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["iphone", "apple", "苹果", "发布", "oled"]}, {"category": "", "categoryclass": "", "imagename": "71555cf958369999b8de4db00805b431.png", "infoid": 1028569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这可能会比往常晚一点，但苹果刚刚发布了iPhone 12。这款最新的“主”iPhone正在从液晶屏向OLED过渡，其屏幕尺寸与iPhone 11和之前的iPhone XR一样，为6.1英寸。这款“主”iPhone很可能是大多数人会青睐的机型。正如传言所说，这款手机的整体外观是扁平的铝制，与iPad Pro和iPad Air(加上几年前的iPhone4)更接近。\nIPhone12将有黑、白、蓝、红、绿五种颜色。起价为799美元。本周五开始预订，iPhone 12将于10月23日上市。除了平坦的侧面，它在很大程度上仍然与iPhone11相似。顶部仍然有一个凹槽，里面安装了苹果的Face ID技术，尽管屏幕周围的边框有所减少--这是OLED开关的另一个好处。在背面，iPhone12有两个摄像头安装在一个哑光玻璃漩涡中，这与其他光滑的后面板形成了良好的对比。\nIPhone12的OLED屏幕的峰值亮度为1200 nit，并支持杜比视觉、HDR 10和HLG。玻璃上涂有苹果公司所说的“陶瓷盾牌”，以提高耐用性。耐水性也有所提高。\n苹果最新款iPhone搭载该公司新款A14仿生处理器，该公司称这是首款基于5纳米制程的智能手机芯片，性能和效率都有所提升。苹果声称，它比Android智能手机中的领先芯片“快了50%”。GPU也是如此，苹果称它是所有手机中最好的。\nIPhone 12代表着苹果首次大举进军5G蜂窝技术。Verizon首席执行官汉斯·维斯特伯格(Hans Vestberg)在活动期间在场，宣布在全国范围内推出该运营商的sub6 5G网络。苹果公司表示，他们设计iPhone 12阵容是为了在平衡电池续航时间的同时实现理想的网络性能。当你当前的活动不需要5G速度时，“智能数据模式”就会使用LTE。苹果公司表示，它已经与30个国家的100家运营商一起测试了5G性能，以确保顺利发布。\nIPhone12拥有1200万像素的f/1.6主摄像头和1200万像素的超宽摄像头，这是迄今为止iphone中最快的光圈。苹果公司表示，微光性能有所改善，该公司继续在计算摄影方面取得进步，以最大限度地提高细节和动态范围。IPhone12的前置摄像头也进入了夜间模式。\n苹果还试图改善iPhone12的无线充电，该手机包含一个内置磁铁的“MagSafe”系统，以保证iPhone与受支持的MagSafe配件正确对准。保护套、充电器和其他配件可以磁性地卡在iPhone12上。苹果公司正在为iPhone和Apple Watch推出一款双无线充电器，该充电器采用了新的MagSafe技术。\n正如传言所说，苹果正在拆除iPhone12盒的充电砖，称此举是为了推动公司的环境目标。\n除了6.1英寸的iPhone12，苹果还推出了一款较小的5.4英寸机型，名为iPhone12 mini。\n正在开发的…。我们在这篇文章中增加了更多内容，但你可以关注我们的苹果iPhone12直播博客，更快地获取新闻。", "note_en": "It might be happening a bit later than usual, but Apple has just announced the iPhone 12. Featuring the same 6.1-inch display size as the iPhone 11 and iPhone XR before it, the latest “main” iPhone — and likely the model most people will gravitate toward — is making the transition from an LCD screen to OLED. And as rumored, the phone has flat aluminum sides for an overall look that more closely matches the iPad Pro and iPad Air (plus the iPhone 4 from years ago).\n The iPhone 12 will come in black, white, blue, red, and green. Pricing starts at $799. Preorders start this Friday, and the iPhone 12 will be available on October 23rd. Aside from the flat sides, it still largely resembles the iPhone 11. There’s still a notch at the top that houses Apple’s Face ID technology, though the bezels around the screen have been reduced — another perk of the OLED switch. Around back, the iPhone 12 has two cameras housed in a matte glass squircle, which makes for a nice contrast with the rest of the glossy back panel.\n   The iPhone 12’s OLED screen has a peak brightness of 1200 nits and supports Dolby Vision, HDR 10, and HLG. The glass is coated with what Apple describes as a “ceramic shield” for better durability. Water resistance has also been improved.\n Apple’s latest iPhone is powered by the company’s new A14 Bionic processor, which the company says is the first smartphone chip built on a 5nm process, leading to improved performance and efficiency. Apple claims it’s “up to 50 percent faster” than the leading chips in Android smartphones. Same goes for the GPU, which Apple says is the best in any mobile phone.\n The iPhone 12 represents Apple’s first major foray into 5G cellular technologies. Verizon CEO Hans Vestberg was on hand during the event to announce the nationwide launch of the carrier’s sub-6 5G network. Apple says it has designed the iPhone 12 lineup to achieve ideal network performance while balancing battery life. A “smart data mode” uses LTE when your current activity doesn’t demand 5G speeds. Apple says it has tested 5G performance with 100 carriers across 30 countries to ensure a smooth launch.\n   The iPhone 12 has a 12-megapixel f/1.6 main camera — the fastest aperture in any iPhone yet — and a 12MP ultra-wide. Apple says low-light performance has improved, and the company has continued its advancements in computational photography to maximize detail and dynamic range. The front camera on the iPhone 12 is gaining Night Mode, as well.\n Apple has also sought to improve wireless charging on the iPhone 12, which contains a “MagSafe” system with built-in magnets to guarantee that the iPhone properly lines up with supported MagSafe accessories. Cases, charges, and other accessories snap onto the iPhone 12 magnetically. Apple is introducing a dual wireless charger for the iPhone and Apple Watch that utilizes the new MagSafe tech.\n  As rumored, Apple is removing the charging brick from its iPhone 12 boxes, a move it says is meant to push forward the company’s environmental goals.\n Alongside the 6.1-inch iPhone 12, Apple also introduced a smaller 5.4-inch model that it calls the iPhone 12 mini.\n   Developing… we’re adding more to this post, but you can follow along with   our Apple iPhone 12 live blog  to get the news even faster.", "posttime": "2020-10-14 02:21:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,iphone,apple,苹果,5g", "title": "苹果发布iPhone12，配备6.1英寸OLED显示屏和每英寸460像素，A14，更薄更轻的设计，5G，改进的耐用性，以及五种颜色选项", "title_en": "Apple announces iPhone 12 with 6.1-inch OLED display and 460 pixels-per-inch, A14, thinner and lighter design, 5G, improved durability, and five colors options", "transed": 1, "url": "https://www.theverge.com/2020/10/13/21509893/apple-iphone-12-5g-oled-screen-features-specs-price?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["设计", "iphone", "apple", "苹果", "5g"]}, {"category": "", "categoryclass": "", "imagename": "47332e4a8fa9fac0ec081ead21275e34.png", "infoid": 1028567, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple电视+免费试用后的价格为4.99美元/月。每个家庭共享组一个订阅。在符合条件的设备激活后提供3个月的有效期限。计划将自动续订，直到取消。适用限制和其他条款。\n更多的购物方式：找一家离你很近的苹果专卖店或其他零售商。或者拨打1-800-My-Apple电话。", "note_en": "Apple TV+ is $4.99/month after free trial. One subscription per Family Sharing group. Offer good for 3 months after eligible device activation. Plan automatically renews until cancelled. Restrictions and other  terms apply.\n   More ways to shop:  Find an Apple Store or  other retailer near you.  Or call 1-800-MY-APPLE.", "posttime": "2020-10-14 01:55:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,apple,苹果,限制", "title": "苹果：iPhone 12活动[现场直播]", "title_en": "Apple: iPhone 12 Event [live]", "transed": 1, "url": "https://www.apple.com/", "via": "", "real_tags": ["iphone", "apple", "苹果", "限制"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你如何看待广告擦除Pi-Hole，并将其变成一个全球可用的应用程序？快速而简单地使用Fly，在本文中，我们将向您展示如何操作。\n圆周率洞可能是你网络连接的英雄。它从根本上阻止广告；即DNS根。通过设置您自己的PI-Hole，您可以将您的本地网络对已知广告域的所有请求都向下倾斜。\n可以把Pi-Hole看作是弹出窗口、覆盖层、横幅和其他精神焦点窃取和占用带宽的广告的防火墙。与过滤所有流量的防火墙不同，Pi-Hole通过充当不同的DNS服务器来工作，DNS服务器是一个广告和跟踪主机和域的数据库。\n当机器向Pi-Hole DNS查询与数据库中的某个条目匹配的内容时，Pi-Hole会礼貌地不解析它，并返回一个虚拟地址。广告提供商提供的广告无法加载，而嵌入的广告则被阻止下载其资产。即使是动态插入的广告也会被这种技术捕获。\n一旦你开始把东西塞进你的圆周率洞里，你会希望你能把它带到任何地方。\n典型的Pi-Hole是在隐藏在家庭网络某处的同名单板计算机上运行的。这样做有很多很好的理由。例如，PI-Hole也可以是您网络的DHCP服务器。这意味着它可以自动将其DNS解析地址提供给您的所有笔记本电脑、手机、老化的台式机、智能电视和亚马逊监控设备，几乎可以将您的所有家庭设备配置为使用它。\n但是，即使你是最有组织的旅途勇士，也很难带着你一起上路。你在一家咖啡馆停下来，然后花一个小时将Pi-Hole连接到用餐者的Wi-Fi上，并根据新的环境重新配置它，嗯，你不会有太多的浏览。\n当然，你只需要将你的DNS指向Pi-Hole，如果你家里有一台运行Pi-Hole的服务器，你只需将你的移动设备指向那里，这些广告就会消失。为了简化这一点，Pi-Hole的挖掘者将其打包为Docker映像，您可以在网络边缘的机器上运行。此外，还有一份使用VPN对其进行配置的指南，可以让事情变得更简单。\n还记得旅行吗？我们确实是这样做的，而且我们还记住，您离家越远，离您的家庭服务器就越远。这就意味着等待时间。而且我们讨厌飞行中的延迟。物理学规定，虽然这个距离意味着延迟，而且考虑到现代浏览器或应用程序可以进行多少DNS查找，这一切都会积累起来。\n啊，您会说，我有一个巧妙的计划；我将在单个服务器上的某个数据中心运行我的PI-Hole。您可能会这样做，但您所改变的只是延迟取决于您与数据中心之间的距离，而不是您与家庭之间的距离。\n一个全球性的PI-Hole可以让你远离广告，让你的连接免于占用带宽，这将是很棒的，但是你怎么才能建造它呢？\n想象一下，您有一个连接到世界各地数十个数据中心的全球边缘网络。您可以将PI-Hole作为边缘应用部署到该网络，并获得自动低延迟和全球可用性的优势。Fly&#39；的网络是一个拥有遍布世界各地的数据中心的全球边缘网络。所以我们用它建立了一个全局PI-Hole。\n经验丰富的Fly用户将知道DNS使用UDP，这是TCP的姊妹协议，也是迄今为止在Fly上还不支持的协议。嗯，不要告诉任何人，但是我们在测试版中有UDP支持，所以建立一个全球Pi-Hole是一个很好的锻炼方式。\n让PI-Hole准备好进行全局过滤不需要对PI-Hole本身进行任何更改。我们甚至使用官方的Pi-Hole Docker映像进行飞行部署。这是我们的文档文件：\n它只是获取该映像并设置要侦听哪个接口的环境变量，并允许DNSMasq(PI-Hole的一个组件)侦听所有子网上的DNS流量。\n配置的另一部分是fly.toml文件，它定义了我们的应用程序应该如何部署到Fly平台。您可以使用命令Fly init生成该文件的核心，当被要求时，让它生成一个名称，使用Dockerfile构建器，并将内部端口设置为80。\n这几乎就是完成的所有配置。最后一步是在Pi-Hole的Web界面上设置密码。这是从环境变量WEBPASSWORD中提取的。Fly的秘密作为环境变量传递给正在运行的应用程序，因此设置它的安全方法是运行：\nFly会将Fli-Hole的一个实例放置在您要运行命令的区域附近。如果要查看应用程序仪表板，请运行：\n这将打开仪表盘。从那里，您可以使用您在机密中设置的密码登录，以查看PI-Hole收集的其他设置和日志。\n现在，你可以在地球上的每个飞行区域部署飞洞，但这不是明智的做法。假设你是在旅行，当然是在完全假设的意义上，去欧洲。您需要做的就是运行：\n这将把法兰克福数据中心和相关区域添加到池中，并开始通过那里路由附近的流量。现在你已经准备好和你的少年派-霍尔一起去欧洲度假了。例如，如果你在英国，那么边缘网络会通过英国的边缘节点将你的请求发送给Fra，以获得最快的响应。\n值得指出的是，PI-Hole的这些实例没有持久化或共享设置。每一个都是一个独立的PI-Hole。这是一个优点，也是一个很容易缓解的缺点；只需更新Dockerfile以更改设置和配置文件，然后重新部署应用程序即可获得永久性全局更新。\n我们在这里展示的是，配置应用程序以在运行平台上运行可以有多快，从货架上取出Docker映像，将其连接到Web和UDP，设置配置和机密，然后将其发送到世界各地。您可能不需要到处都有PI-Hole，但您的下一个大应用程序可能需要在瞬间随处可见。", "note_en": "How do you take the ad-scrubbing Pi-Hole and turn it into a globally available app? Quickly and simply with Fly and in this article, we&#39;ll show you how.\n A Pi-Hole could be the hero of your web connection. It blocks advertising at the roots; the DNS roots that is. By setting up your own Pi-Hole, you can tip all your local network&#39;s requests for known advertising domains down it.\n   Think of Pi-Hole as a firewall for popups, overlays, banners and other mental focus-stealing and bandwidth-eating advertising. Unlike a firewall which filters through all your traffic, Pi-Hole does its work by acting as your DNS server with a difference, a database of advertising and tracking hosts and domains.\n  When a machine queries the Pi-Hole DNS for something that matches one of the entries in the database, Pi-Hole politely doesn&#39;t resolve it and returns a dummy address. Ads that are served from ad providers just can&#39;t load, while embedded ads are blocked from downloading their assets. Even dynamically inserted ads get caught by this technique.\n  Once you start stuffing things in your Pi-Hole, you&#39;ll wish you could take it with you everywhere.\n   The typical Pi-Hole is running on the eponymous single-board computer, tucked away somewhere on the home network. There are a lot of good reasons to do that. For example, a Pi-Hole can also be a DHCP server for your network. That means it can automatically give out its address for DNS resolution to all your laptops, phones, aging desktops, smart TVs, and Amazon surveillance devices, practically configuring all your home devices to use it.\n  But then that makes it somewhat hard to take on the road with you, even if you are the most organized road warrior to ride the roads. You stop at a coffee shop and then the next hour is spent connecting the Pi-Hole to the diner Wi-Fi and reconfiguring it for its new environment and, well, you aren&#39;t going to get a lot of browsing done.\n  Of course, you only need to point your DNS at the Pi-Hole and if you have a server at home which is running Pi-Hole, you could just point your mobile devices at that and vanish those ads. To make that easier, the diggers of the Pi-Hole have packaged it up as a Docker image that you can run on a machine on the edge of your network. There&#39;s also a guide for  configuring it with a VPN to make things easier.\n   Remember traveling? We do, and we also remember that the further you go from home, the further you are from your home server. And that means latency. And we hate latency at Fly. Physics dictates though that distance means latency and given how many DNS lookups a modern browser or app could be doing, that all mounts up.\n  Ah, you say, I have a cunning plan; I will run my Pi-Hole in a datacenter somewhere on a singular server. And so you might, but all you are changing then is that the latency depends on the distance between you and the datacenter, rather than the distance between you and your home.\n   A global Pi-Hole to keep you free from adverts and your connection free from the bandwidth hogs would be wonderful but how could you build it?\n  Well, imagine you had a global edge network connected to dozens of data centers around the world. You could deploy Pi-Hole as an edge application to that network and get the benefits of automatically low latency and global availability. Fly&#39;s network is a global edge network with data centers around the world... so we built a global Pi-Hole using it.\n  Seasoned Fly users will know that DNS uses UDP, a sister protocol of TCP and a protocol which has not been supported on Fly to date. Well, don&#39;t tell anyone, but we have UDP support in beta so building a global Pi-Hole was a great way to give this a workout.\n   Getting Pi-Hole ready for global filtering doesn&#39;t require any changes to Pi-Hole itself. We even use the official  Pi-Hole Docker image for Fly deployment. Here&#39;s our  Dockerfile:\n   It simply takes that image and sets environment variables for which interface to listen on, and to allow DNSMasq (a component of Pi-Hole) to listen on all subnets for DNS traffic.\n  The other part of the configuration is the   fly.toml file which defines how our application should be deployed to the Fly platform. You generate the core of this file with the command  fly init and when asked, let it generate a name, use the Dockerfile builder and set the internal port to 80.\n       That&#39;s nearly all the configuration done. The last step is to set the password on Pi-Hole&#39;s web interface. This is picked up from an environment variable  WEBPASSWORD. Fly&#39;s secrets are passed to running applications as environment variables, so the secure way to set this is to run:\n        And Fly will place an instance of Fli-Hole in a region close to where you are running the commands. If you want to check out the App dashboard, run:\n   Which will open the dashboard. From there you can log in, using the password you set in secrets, to look at the other settings and logs gathered by Pi-Hole.\n   Now, you could deploy Fli-Hole to  every Fly region on the planet, but that&#39;s not the smart way of doing it. Say you were traveling, in an entirely hypothetical sense of course, to Europe. All you need to do is run:\n   And that would add the Frankfurt data center and associated region to the pool and start routing nearby traffic through there. Now you are ready to go on a European vacation with your Pi-Hole. If you were in the UK, for example, then the edge network would send your requests to Fra, via the UK&#39;s edge nodes, for the fastest response.\n  It&#39;s worth pointing out these instances of Pi-Hole have no persistence or sharing of settings. Each one is an independent Pi-Hole. It&#39;s a strength and an easily mitigated weakness; just update the Dockerfile to change settings and configuration files and redeploy the application to get permanent global updates.\n   What we&#39;ve shown here is how quick it can be to configure an application to run on the Fly platform, from taking a Docker image off the shelf, connecting it to the web and UDP, setting configuration and secrets, and then sending it out into the world. You may not need a Pi-Hole everywhere, but your next big app might need to be everywhere at the drop of a hat.", "posttime": "2020-10-14 01:55:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "填充,pi,hole", "title": "从任何地方填充您的圆周率孔", "title_en": "Stuff Your Pi-Hole from Anywhere", "transed": 1, "url": "https://fly.io/blog/stuff-your-pi-hole-from-anywhere/", "via": "", "real_tags": ["填充", "pi", "hole"]}, {"category": "", "categoryclass": "", "imagename": "5a9d1e3b6b94b9f11a21ee240b2e90a0.jpg", "infoid": 1028565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "唐纳德·特朗普总统声称西弗吉尼亚州的邮递员正在销售选票，邮政服务正在损失(邮寄选票的)30%和40%。这些都是谎言。这一切都是试图在选举中散布恐惧、不确定性和疑虑的一部分。与此同时，加州共和党已经安装了非官方的选票投放箱，州官员称这些投放箱是非法的。你认为如果你把选票投到这些地方之一，你的选票就会被计算出来吗？我怀疑。\n那么，你能做什么呢？你如何确保你的递送选票或提前投票不会消失在黑洞中？来自谷歌、微软和其他公司的人已经给出了他们自己的答案：WeVoteSafely.org。\nWeVoteSafely是一个无党派网站，由志愿者运营，没有公司支持，面向那些担心11月3日当面投票并担心美国邮政服务会失去选票的美国公民。\n为了帮助第三种投票选项--选票投递--WeVoteSafely提供了合法授权的选票投递地点的可搜索列表。用户可以通过输入地址或使用定位服务来定位最近的选票投递箱。然后，他们会看到一张地图，显示真正的投递箱的确切位置。该地图还提供返回到收集箱信息来源的链接，以提供对数据的信任。\n微软研究外展总监Tara Grumm解释说，WeVoteSafely.org是一项公共服务，除了提供准确投票信息所需的位置数据外，该网站不会显示广告、跟踪用户或收集任何个人信息。位置数据在使用后被丢弃，该网站只跟踪有关使用情况的县级信息，以确定数据中的差距或其他需要修复的问题。\n这些数据是由志愿者收集的，其来源可以逐县找到。这些数据随后被收集到Google Sheets和Excel工作簿中。志愿者收集了以下信息：安全投票地点的类型(例如，选票投递箱与提前投票)；地点；实际地址；以及信息的权威市/县/州来源的URL。其他元素--如可用日期/时间和位置备注--也被捕获(如果可用)。\n不相信这些数据吗？团队理解你的怀疑。根据他们的常见问题解答：不要盲目相信你在互联网上读到的东西总是最好的做法。这是平均的(特别是！)。关于投票的信息为真。我们地图上的每个位置都包含一个链接，指向最初的市/县/州官方信息来源。\n该网站使用的是人工策划的众包搜索引擎，FAQ指出，虽然在建立这个网站的过程中进行了大量的剪切/粘贴，但我们可能在这个过程中遗漏了一些东西。因此，如果你发现错误/遗漏或有更新的信息，他们会希望你告诉他们，这样他们就可以修复问题。\n然后对每个合法落车点的数据进行地理编码。仍然有可能混淆--例如，LaGrange，IL与La Grange，IL--因此，对数据进行了一些手动更正。\n然后，这些数据被加载到微软的Power BI中，这是一项在微软Azure云上运行的商业分析服务。前端使用谷歌地图。\n即使是现在，也有一些悬而未决的问题。一些州和县还没有确定他们的投放点和提前投票点。例如，弗吉尼亚州的费尔法克斯市和费尔法克斯县仍然很麻烦。尽管如此，该数据库覆盖了全国98%的地区，拥有超过16,000个地点。\n担心你自己的数据吗？该组织希望您知道：该服务不收集个人身份信息。这意味着：\n我们不使用Cookie我们不使用任何第三方分析工具或插件我们不会记录/跟踪您的特定地址或最新/最长位置信息(但是，我们会跟踪用户查询的城市、县和州，以帮助确定我们Dropbox/提前投票位置研究工作的优先顺序)我们不会在网站上使用唯一的用户标识符没有花招、没有问题、没有例外。\n我用我自己的隐私工具检查了这个网站，它一尘不染。我还查看了我自己的家乡北卡罗来纳州邦科姆县的数据，发现它是准确的。如果你想提前投票，并想确保你的选票被计算在内，我强烈推荐这个网站。", "note_en": "President Donald Trump claims mail carriers in West Virginia are &#34;selling the ballots&#34; and that the postal service &#34;is losing 30 and 40 percent [of mailed-in ballots].&#34;  These are lies. It&#39;s all part of an attempt to cast fear, uncertainty, and doubt around the election. Meanwhile, the California GOP has  installed unofficial ballot drop-off boxes that state officials say are illegal. Think your vote will be counted if you were to drop your ballot off in one of these? I doubt it.\n    So, what can you do? How do you make sure your drop-off ballot or early vote doesn&#39;t disappear into a black hole? People from Google, Microsoft, and other companies have come up with their own answer:  WeVoteSafely.org.\n WeVoteSafely is a non-partisan site, run by volunteers and without corporate support, for US citizens who are worried about voting in-person on November 3 and concerned that the US Postal Service will lose their ballots.\n To help with the third option for voting -- ballot drop-off -- WeVoteSafely offers a searchable listing of legitimate authorized ballot drop-off locations. Users can locate their nearest ballot drop box by entering their address or using a location service. They will then see a map showing exactly where real drop-off boxes are located. The map also provides a link back to the source of the collection box information to provide trust in the data.\n Tara Grumm, Director of Microsoft Research Outreach, explained, &#34;WeVoteSafely.org is a public service, the site does not display ads, track users or collect any personal information other than the location data needed to provide accurate voting information. The location data is discarded after use, and the site only tracks county-level information about usage to identify gaps in data or other issues to fix.&#34;\n The data has been collected by volunteers and its  sources can be found on a county-by-county basis. This data was then gathered into Google Sheets and Excel workbooks. Volunteers collected information on the type of safe voting location (e.g. ballot drop box versus early voting); the location&#39;s physical address; and the URL of the authoritative city/county/state source for the information. Additional elements -- such as dates/times of availability and location notes -- were also captured, where available.\n Don&#39;t trust the data? The group understands your skepticism. From their FAQ: &#34;It is  ALWAYS a best practice to NOT blindly believe something you happen to read on the Internet. That is even (especially!) true with information on voting. Every location on our maps include a link back to the original city/county/state source of official information.&#34;\n   The site uses a human-curated, crowd-sourced search engine and the FAQ notes that while &#34;there is a LOT of cutting/pasting that went into building this site, we might have missed something along the way.&#34; So, if you find an error/omission or have updated information,  they want you to tell them so they can fix the problem.\n The data for each legal drop-off site is then  geocoded. Confusion is still possible -- for example, LaGrange, IL vs La Grange, IL -- therefore, some manual corrections were made to the data.\n This data is then loaded into  Microsoft&#39;s Power BI, a business analytics service running on  Microsoft&#39;s Azure cloud. The front-end uses Google Maps.\n Even now there are a few outstanding issues. Some states and counties haven&#39;t finished nailing down their drop-off and early voting sites. Fairfax City and Fairfax County in Virginia, for example, is still proving troublesome. Still, the database covers 98% of the country with over 16,000 locations.\n Worried about your own data? The group wants you to know: The service collects no personally identifiable information. That means:\n We do NOT use cookies  We do NOT use any third-party analytics tools or plug-ins  We do NOT log/track your specific address or lat/long location information (however, we DO  track the city, county, and state that users are querying for to help prioritize our dropbox/early  voting location research efforts)  We do NOT use unique user identifiers on sites across the web  No tricks, no gotchas, no exceptions\n I checked the site with my own  privacy tools and it&#39;s as clean as a whistle. I also looked at its data for my own home county, Buncombe county in North Carolina, and found it was accurate. If you want to vote early and you want to make sure your vote is counted, I highly recommend this site.", "posttime": "2020-10-14 01:54:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,投票,safely,选票", "title": "安全投票：如何找到值得信赖的选举投票地点", "title_en": "Vote safely: How to find a trustworthy election ballot drop-off location", "transed": 1, "url": "https://www.zdnet.com/article/how-to-find-trustworthy-drop-in-election-ballot-drop-off-locations/", "via": "", "real_tags": ["rust", "投票", "safely", "选票"]}, {"category": "", "categoryclass": "", "imagename": "b53317d0f1b057ecfcf3cea2e5275457.png", "infoid": 1028564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果将不会在iPhone12中配备电源充电器或耳机，理由是环境原因。苹果公司表示，除了缩小每部iPhone的发货箱尺寸外，它还将能够通过不必首先制造配件来大幅减少碳排放。\n苹果副总裁丽莎·杰克逊(Lisa Jackson)表示，世界上已经有超过20亿个电源适配器，所以继续将它们与iPhone一起放在盒子里是浪费的。该公司还表示，越来越多的客户正在转向无线充电方式。\nIPhone12的盒子将继续使用USB-C to Lightning充电线，但EarPod耳塞和电源适配器将不再使用USB-C到Lightning充电线。这些配件现在将只单独出售。\n这一举措将对环境产生好处，但该公司将因吝啬的客户而招致批评。\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "Apple will not include a power charger or earbuds with the  iPhone 12, citing environmental reasons. Apple said it will be able to significantly reduce carbon emissions by not having to make the accessories in the first place, in addition to reducing the shipping box size of each iPhone sold.\n   Apple VP Lisa Jackson said that there are more than 2 billion power adapters in the world already, so continuing to include them in the box with the iPhone was wasteful. The company also said that more and more customers are switching to wireless charging methods.\n The iPhone 12 box will continue to feature the USB-C to Lightning charging cable, but the EarPod earbuds and power adaptor will not. Those accessories will now only be sold separately.\n This move will have environmental benefits but the company will draw criticism for penny-pinching customers.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-10-14 01:54:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,电源,charger,环境", "title": "IPhone12的包装盒中没有电源充电器或耳塞", "title_en": "iPhone 12 does not come with power charger or earbuds in the box", "transed": 1, "url": "https://9to5mac.com/2020/10/13/iphone-12-does-not-come-with-power-charger-or-earbuds-in-the-box/", "via": "", "real_tags": ["iphone", "电源", "charger", "环境"]}, {"category": "", "categoryclass": "", "imagename": "b5813e0986392e245073d22954226f3f.jpg", "infoid": 1028563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Ars，我们从想要谈论他们的产品的初创公司那里得到了很多推介。至少对这位科学记者来说，这种感觉很少是相互的。但偶尔也会有一些事情激起我的好奇心。像…这样的东西。办公室暖通空调系统的碳捕获。\n通过视频通话，芬兰初创企业Soletair Power最近展示了其办公室内运行的一个装置。它是为2020年迪拜世博会而建的，但是，你知道世博会发生了什么。由于这台机器将二氧化碳转化为甲烷燃料，而不是为世博会展台提供动力，而是将一个天然气动力的浓缩咖啡机固定在展台上。\n该设备第一部分的价值主张相当简单。二氧化碳会积聚在挤满人的建筑物中，较高的二氧化碳浓度可能会影响你清晰思考的能力。解决这一问题的通常方法是引入更多的新风(可能需要加热/冷却)。另一种方法是选择性地过滤掉二氧化碳，这种设备可以帮你完成后者。\n二氧化碳可以简单地排到外面，或者用来生产大量的苏打水。相反，让Soletair的想法更有趣的是，其设备的其余部分将二氧化碳转化为燃料。该公司展示的配置制造甲烷，但可以换成液体燃料过程。根据运行机器的能源的不同，这些燃料可能是碳中性的，因为碳来自空气。它在经济上是否可行则是另一个问题。\n他们正在使用的二氧化碳捕获技术是为燃烧发电厂设计的技术的缩小版。空气通过一个装满含有胺的小颗粒的房间，胺是一种与二氧化碳分子结合的化合物。颗粒周期性地通过加热步骤循环。Soletair的Petri Laakso和Cyril Bajamody告诉ARS，温度只需要上升到120摄氏度以下，所以来自当地供热系统和/或电加热元件的蒸汽就足够了。这使得胺颗粒释放出它们持有的二氧化碳，这些二氧化碳积聚在一个储存罐中。然后这些颗粒就可以吸收更多的二氧化碳了。\n机器的另外三分之二，高约2米，长约5米，宽约1米，负责将二氧化碳转化为可用燃料。首先，有一个电解槽，可以把水分解成氢气。然后，在甲烷化反应器中，氢气与二氧化碳结合，生成纯甲烷气体。\nSoletair在这次演示中有一个本生燃烧器在咆哮，该公司提到之前曾在办公室里运行过厨灶。(当然还有那台浓缩咖啡机…)。整个概念的可行性取决于燃料在某处提供的价值。\n作为二氧化碳过滤器，该装置可处理每秒约3立方米的标准暖通空调流量。Soletair说，这可以为一座有几百人居住的写字楼服务。在该公司自己较小的办公室里，过滤器吸入的空气中二氧化碳含量约为百万分之500，并将浓度降低了一半。\n不过，产生燃料并不是办公楼的常见功能。如果您有现场使用(供暖？车辆？)，您可能会对潜在客户感兴趣。但Soletair也表示，其当地的天然气公用事业公司愿意将其送入公共供应网络-就像太阳能电力的净计量一样，但不是天然气。这个计划听起来不像是在冒险盈利，但它可以抵消一些成本。\n碳工程公司等正在设计工业规模的碳捕获设施的公司正在追求“空气转化为燃料”的想法。有趣的是，尽管焦点从燃料生产转移到室内空气质量上，但尝试在一个小得多的一揽子计划中进行了尝试。与所有形式的碳捕获一样，对碳排放进行成本计算可以提高减少排放的支出的经济性。但在这种情况下，Soletair主要销售的不是社会气候效益-尽管自己制造燃料是一项有趣的附加服务。", "note_en": "At Ars, we get a  lot of pitches from start-ups that want to talk about their products. At least for this science reporter, the feeling is rarely mutual. But once in a while, something piques my curiosity. Something like… carbon capture for an office HVAC system.\n Over a video call, Finnish start-up Soletair Power recently showed off a unit operating in its office. It had been built for the 2020 World Expo in Dubai, but, well, you know what has happened to expos. Instead of powering an expo booth, there was a gas-powered espresso maker bolted onto the unit—since this machine turns CO 2 into methane fuel.\n The value proposition for the first part of the device is pretty straightforward. Carbon dioxide accumulates in buildings full of people, and higher CO 2 concentrations  may impact your ability to  think clearly. The usual way to manage that is to introduce more outside air (which may need to be heated/cooled). Another could be to selectively filter out CO 2. This device could do the latter for you.\n That CO 2 could simply be vented outside or used to produce an unwieldy amount of seltzer. Instead, what makes Soletair’s idea more interesting is that the rest of its device turns the CO 2 into fuel. The configuration the company demonstrated makes methane but could be swapped for a liquid fuel  process. Depending on the source of the energy running the machines, these fuels could be carbon-neutral since the carbon comes from the air. Whether it’s economically viable is another question.\n  The CO 2 capture technique they’re using is a scaled-down version of those designed for combustion power plants. Air goes through a chamber full of small granules that contain amines—compounds that bind with CO 2 molecules. Periodically, the granules are cycled through a heating step. The temperature only needs to rise to shy of 120°C, Soletair’s Petri Laakso and Cyril Bajamundi told Ars, so steam from the local heat system and/or an electric heating element is sufficient. This makes the amine granules release the CO 2 they’re holding, which accumulates in a storage tank. The granules are then ready to absorb more CO 2.\n The other two-thirds of the machine, which measures about 2 meters tall, 5 meters long, and 1 meter wide, deal with turning that CO 2 into a usable fuel. First, there’s an electrolyzer that splits water to make hydrogen gas. Then hydrogen is combined with CO 2 in a methanation reactor to produce pure methane gas.\n The Soletair had a Bunsen burner roaring for this demonstration, and the company mentioned having run a cook stove in the office previously. (And of course there’s that espresso maker…) The viability of this whole concept pivots on the fuel providing value somewhere.\n As a CO 2 filter, this unit is built to handle a standard HVAC flow of about 3 cubic meters of air per second. That can serve an office building with a few hundred occupants, Soletair says. In the company&#39;s own, smaller office, the filter was taking in air with about 500 parts per million CO 2 and cutting that concentration in half.\n Generating fuel is not a common office building function, though. If you have an on-site use for it (heating? vehicles?), the prospect might interest you. But Soletair also said that its local gas utility is amenable to having it sent into the public supply network—like net metering of solar electricity but for gas. It doesn’t sound like that scheme risks running a profit, but it could offset some cost.\n  The “air to fuels” idea is being pursued by companies  like Carbon Engineering that are designing industrial-scale carbon-capture facilities. It’s interesting to see that attempted in a much smaller package, albeit with the focus shifted away from fuels production and toward indoor air quality. As with all forms of carbon capture, placing a cost on carbon emissions could improve the economics of expenditures that reduce emissions. But in this case, Soletair is primarily selling something other than the societal climate benefit—though making your own fuel is a fun add-on.", "posttime": "2020-10-14 01:15:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "办公室,takes,二氧化碳", "title": "这台机器将办公室空气中的CO₂转化为燃料", "title_en": "This machine takes office-air CO₂ and turns it into fuel", "transed": 1, "url": "https://arstechnica.com/science/2020/10/start-up-wants-to-do-carbon-capture-on-stale-indoor-air-turn-it-into-fuel/", "via": "", "real_tags": ["办公室", "takes", "二氧化碳"]}, {"category": "", "categoryclass": "", "imagename": "5a39899b2102e67167258f2bc3bfd19a.jpg", "infoid": 1028561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DroneDeploy首席执行官迈克·温(Mike Winn)表示，在今天的声明之前，DroneDeploy可以使用任何无人机的无人机镜头来获取网站外部的照片，上传这些照片并将它们缝合成一个精确到一英寸的3D模型。\n温恩说，虽然获得工作地点外部的这种类型的视图有很大的价值，但客户渴望获得包括内部和外部的整体照片，而且这个简单地处理从无人机传输的照片的平台可以相当容易地进行调整，以容纳来自其他设备上的摄像头的照片。\n“我们的客户也希望从内部获得数据，他们正在寻找一个数字孪生兄弟，一个对他们整个网站的数字重建，以了解整个公司正在与安全团队和高管分享什么，这就是今天工作网站的状况，”温恩解释说，“我们的客户也在寻找一个数字孪生兄弟，一个是他们整个网站的数字重建，以了解整个公司正在与安全团队和高管分享什么，这就是今天工作网站的状况。”\n他补充说，在COVID期间，当工作网站的访问受到限制时，这一点更加重要，这使得定期了解网站的状态变得更加重要。\n“他们希望那些工地上的人少一些，只想让重要的工人来做这项工作。”因此，对于任何需要网站信息的人来说，如果他们能从桌面、3D模型或工作网站的街景中获得这些信息，这真的可以在这种COVID环境中提供帮助，但也会使其效率大大提高。“Winn说。\n他说，虽然公司可以将这种能力与安装在工地内部的固定摄像头结合起来，但它们不能提供地面机器人所能提供的那种覆盖范围，而且波士顿动力公司的机器人能够在散落着碎片的粗糙工地周围移动。\n虽然温恩认为使用波士顿动力公司的机器人更多的是一个最终目标，但他表示，在不久的将来，更有可能的是，你将有一个人带着相机穿过工作现场，捕捉镜头，为DroneDeploy软件完成由内到外的画面。\n“所有客户都已经希望采用机器人来收集这些数据，你可以想象波士顿动力公司的机器人(做这件事)，但这当然是最终的状态。今天，我们也支持人类穿行，一个人带着360摄像机穿行在工作地点，可能每周都会这样做一次，以记录工作地点的状况。“他说。\n据Winn称，DroneDeploy于2013年推出，已经筹集了超过1亿美元。他报告说，他的公司有5000多名客户，随着越来越多的公司采用无人机作为应对COVID的一种方式，无人机的飞行时间今年同比增加了2.5倍。", "note_en": "Up until today’s announcement,  DroneDeploy   could use drone footage from any drone to get a picture of what a site looked like outside, uploading those photos and stitching them together into a 3D model that is accurate within an inch, according to DroneDeploy CEO Mike Winn.\n Winn says that while there is great value in getting this type of view of the outside of a job site, customers were hungry for a total picture that included inside and out, and the platform which is simply processing photos transmitted from drones could be adapted fairly easily to accommodate photos coming from cameras on other devices.\n  “Our customers are also looking to get data from the interiors, and they’re looking for one digital twin, one digital reconstruction of their entire site to understand what’s going on to share across their company with the safety team and with executives that this is the status of the job site today,” Winn explained.\n  He adds that this is even more important during COVID when access to job sites has been limited, making it even more important to understand the state of the site on a regular basis.\n “They want fewer people on those job sites, only the essential workers doing the work. So for anyone who needs information about the site, if they can get that information from a desktop or the 3D model or a kind of street view of the job site, it can really help in this COVID environment, but it also makes it much more efficient,” Winn said.\n He said that while companies could combine this capability with fixed cameras on the inside of a site, they don’t give the kind of coverage a ground robot could, and the  Boston Dynamics   robot is capable of moving around a rough job site with debris scattered around.\n  While Winn sees the use of the Boston Dynamics robot as more of an end goal, he says that more likely for the immediate future, you will have a human walking through the job site with a camera to capture the footage to complete the inside-outside picture for the DroneDeploy software.\n “All customers already want to adopt robots to collect this data, and you can imagine a Boston Dynamics robot [doing this], but that’s the end state of course. Today we’re supporting the human walk-through as well, a person with a 360 camera walking through the job site, probably doing it once a week to documents the status of the job sites,” he said.\n DroneDeploy launched in 2013 and has raised over $100 million, according to Winn. He reports his company has over 5000 customers with drone flight time increasing by 2.5x YoY this year as more companies adopt drones as a way to cope with COVID.", "posttime": "2020-10-14 01:10:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "波士顿,teams,网站", "title": "\nDroneDeploy与波士顿动力公司合作提供工作现场内外视图", "title_en": "\n\t\t\t\tDroneDeploy teams with Boston Dynamics to deliver inside-outside view of job site\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/13/dronedeploy-teams-with-boston-dynamics-to-deliver-inside-out-view-of-target-site/", "via": "", "real_tags": ["波士顿", "teams", "网站"]}, {"category": "", "categoryclass": "", "imagename": "33fd59cea0c9701aa01f2277d1db9e8a.jpeg", "infoid": 1028559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要么全力以赴，要么全退出Netflix，因为这家流媒体巨头已经取消了他们的免费试用。\n正如菲尔·斯旺(Phil Swann)最先发现的那样，流媒体不再让用户有机会免费试用这项服务。取而代之的是，你必须注册他们的计划之一，尽管你没有合同约束，可以随时取消这项服务。\n根据Netflix帮助中心的说法，“虽然不提供免费试用，但您仍然可以注册并利用Netflix提供的所有服务。没有合同，没有取消费用，也没有承诺。如果你认为Netflix不适合你，你可以随时改变计划或在线取消。“。\n该公司似乎从去年开始减少免费试用。在某些国家，Netflix早在2019年3月就取消了30天免费试用选项，但随后在5月份恢复了只有14天免费试用的优惠。在西班牙等国，至少从本月初开始就没有这个选项了。目前，该选项并不适用于所有市场。\n今年7月，这家流媒体巨头的全球订户达到近1.93亿，比年初增加了2500万以上。鉴于今年上半年增长如此之快，他们似乎愿意尝试取消免费试用，看看其影响。\n看起来这可能是大流媒体中出现的一种新趋势。今年6月，迪士尼+也取消了7天的免费试用选项。当新用户现在通过注册过程导航时，他们会被提示立即开始支付每月6.99美元的服务(这项服务作为Hulu和ESPN+12.99美元捆绑包的一部分进行了大量营销)。\n对于流媒体用户来说，虽然免费试用是获得客户的一种很好的方式，但有时只是试一试、大吃大喝，然后取消就太容易了。", "note_en": "It’s either you’re all in or you’re all out with  Netflix as the streaming giant has removed their free trial.\n As first  spotted by Phil Swann, the streamer is no longer giving users a chance to try the service for free. Instead, you have to sign-up for one of their plans, though you are not contractually bound and can cancel the service at any time.\n According to the Netflix  Help Center, “Free trials are not available, but you can still sign up and take advantage of all Netflix has to offer. There are no contracts, no cancellation fees, and no commitments. You have the freedom to change your plan or cancel online at any time if you decide Netflix isn’t for you.”\n It seems the company started drawing back on free trials last year. In certain countries, Netflix  removed the 30-day free trial option as early as March 2019, but then restored the offer with only 14-day free trials in May. In countries such as Spain, the option hasn’t been available since at least the beginning of this month. Currently, the option isn’t available across all markets.\n In July, the streaming giant  reached nearly 193 million global subscribers, up over 25 million from the beginning of the year. Given such rapid growth in the first half of the year, they seem to be willing to try out removing the free trial to see its impact.\n It looks like this may be a new trend surfacing amongst the big streamers.  In June,  Disney+ also axed their seven-day free trial option. When new subscribers navigate through the sign-up process now, they are prompted to immediately begin paying for the $6.99 per month service (which is heavily marketed as part of a $12.99 bundle with  Hulu and  ESPN+).\n For streamers, while free trials are a great way to acquire customers, it sometimes makes it too easy to just try it, binge, and cancel.", "posttime": "2020-10-14 01:09:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,市场,stopped,netflix", "title": "Netflix已经停止在所有市场提供30天的免费试用", "title_en": "Netflix has stopped offering its 30-day free trial across all markets", "transed": 1, "url": "https://thestreamable.com/news/netflix-removes-30-day-free-trial-across-markets", "via": "", "real_tags": ["免费", "市场", "stopped", "netflix"]}, {"category": "", "categoryclass": "", "imagename": "6f068a8e46c0e0fb578acbbdc309a7ba.jpg", "infoid": 1028558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Point Pickup的首席执行官汤姆·菲奥里塔(Tom Fiorita)不遗余力地将这家最后一英里的快递公司与硅谷的技术平台区分开来。\n这家总部位于康涅狄格州的初创公司的菲奥莉塔说：“我们是东海岸的一家公司，我不会称我们为帕洛阿尔托类型的组织。”\n他说，Point Pickup“也不只是建立技术，希望人们追随或试图推动销售，而不是能够迎头赶上。”\n菲奥莉塔说，Point Pickup所做的就是为零售商提供一个送货平台，让他们能够为客户服务，这是“他们的金块”。\n“我们是企业最好的朋友，”他说。“我们是他们控制技术的推动者。”\n周四，Point Pickup宣布从BBH Capital Partners筹集3000万美元。这笔首轮投资加入了私人投资者和CT Innovation的前几轮种子轮投资，CT Innovation是一家支持康涅狄格州初创企业的风险投资集团。\nFiorita说，资本将允许Point Pickup按照客户和他们的客户要求的速度进行扩张，这包括创新、人才、技术和扩张。\nPoint Pickup成立于2015年，为所有50个州的零售商提供当天最后一英里的送货服务。它的客户名单包括沃尔玛、克罗格、艾伯森、巨鹰和Fresh Direct。\n该公司的技术通过API集成，允许客户完全监督其URL。该公司断言，其与众不同之处之一是，Point Pickup是唯一一个提供预先计划送货的平台，其中包括最喜欢的司机，同时满足按需请求。\n菲奥莉塔说：“我们基本上是在把送奶人重新引入美国的每个社区。”他解释说，信任是成功送货上门的关键指标，“我们认为可预测性很重要。当你可以开始将司机与相同的客户相匹配时，这将是令人难以置信的强大之处。“。\n随着电子商务需求的加剧，最后一英里的快递公司看到了需求和增长机会的繁荣。就在上周，优步(纽约证券交易所股票代码：UBER)宣布将其新的最后一英里送货服务Uber Direct整合到其Uber货运发货人平台中。\n随着电子零售巨头亚马逊(纳斯达克股票代码：AMZN)设定(并提高)快速当天送货的标准，全国各地的零售商都在寻找每一个机会来提高与在线购物相关的效率。\n“我们考虑建立我们的平台，帮助所有的企业成为亚马逊非常强大的竞争对手，”菲奥莉塔说。\n至于Point Pick的东海岸诚意，菲奥莉塔认为冠状病毒大流行将导致企业家离开西海岸。“你将开始看到全国各地的动向，”他说。", "note_en": "Point Pickup’s CEO, Tom Fiorita, goes to considerable lengths to distinguish the final-mile delivery company from Silicon Valley tech platforms.\n “We’re an East Coast firm — I wouldn’t call us a Palo Alto type of an organization,” said Fiorita of the Connecticut-based startup.\n Nor does Point Pickup “just build technology,” he said, “and hope that people follow or try to drive sales and not be able to catch up.”\n What Point Pickup  does do is provide a delivery platform for retailers that allows them to serve the customer, “their golden nugget,” said Fiorita.\n “We’re an enterprise’s best friend,” he said. “We’re an enabler for them to control the technology.”\n  On Thursday, Point PIckup announced a raise of $30 million from BBH Capital Partners. The Series A investment joins previous seed rounds from private investors and CT Innovations, a venture capital group that supports startups in Connecticut.\n The capital will allow Point Pickup to scale at the rate customers and  their customers are requiring, Fiorita said, and that includes innovation, talent, technology and expansion.\n Founded in 2015, Point Pickup provides a same-day last-mile delivery service for retailers in all 50 states. Its customer list includes Walmart, Kroger, Albertsons, Giant Eagle and Fresh Direct.\n The company’s tech integrates via API, allowing the client to have full oversight of its URL. Among its differentiators, the company asserts, is that Point Pickup is the only platform offering pre-scheduled deliveries with favorite drivers while accommodating on-demand requests.\n “We’re basically reintroducing the milkman to every neighborhood in America,” said Fiorita. Trust is a key metric for successful home delivery, he explained, and “we believe predictability matters. When you can start matching up drivers to the same customers, this is incredibly powerful.”\n As demand for e-commerce intensifies, last-mile delivery companies are seeing a boom in demand and growth opportunities. Just last week, Uber ( NYSE: UBER) announced the integration of  its new last-mile delivery service, Uber Direct, into its Uber Freight shipper platform.\n  And with e-retailing giant Amazon ( NASDAQ: AMZN) setting (and raising) the bar for fast, same-day delivery, retailers around the country are looking for every opportunity to improve efficiencies tied to online shopping.\n “We look at building our platform to help all the enterprises to become very strong competitors of Amazon,” observed Fiorita.\n As for Point Pickup’s East Coast bona fides, Fiorita believes the coronavirus pandemic will lead to entrepreneurs migrating away from the West Coast. “You’re going to start to see movement across the country,” he said.", "posttime": "2020-10-14 01:08:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,bbh,平台", "title": "当天最后一英里送货初创公司Point Pickup在所有50个州都有业务，从BBH Capital Partners筹集了3000万美元的首轮融资", "title_en": "Same-day last-mile delivery startup Point Pickup, which operates in all 50 states, raises $30M Series A from BBH Capital Partners", "transed": 1, "url": "https://www.freightwaves.com/news/point-pickup-raises-30m-to-grow-e-commerce-platform", "via": "", "real_tags": ["初创", "bbh", "平台"]}, {"category": "", "categoryclass": "", "imagename": "c9e0d0e7d35266747214f6cbf414134a.jpg", "infoid": 1028557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络即服务初创公司Alkira Inc.。今天表示，它已经在一轮融资中筹集了5400万美元，使其筹集的总金额达到7600万美元。\n科赫颠覆技术公司(Koch Disruptive Technologies)领导了B轮融资，之前的投资者凯鹏华盈(Kleiner Perkins)和红杉资本(Sequoia Capital)以及新的投资者GV Management Co.LLC参与了这轮融资，GV Management Co.LLC的母公司谷歌(Google LLC)是其唯一的有限合伙人。\nAlkira第一次引起人们的注意是在4月份，当时它以3000万美元的资金摆脱了隐形模式，推出了云服务交易所(Cloud Services Exchange)，称这将使云架构师能够在几分钟内构建和部署多云网络。该公司将该平台标榜为全球首个“统一的、按需提供的多云产品”，并表示其目标是帮助公司与其公共云提供商以及这些提供商之间的连接，以实现更高效的数据交换和分布式应用开发。\nAlkira云服务交换使用该公司所称的“云交换点”，这是全球分布的多云入网点，可提供完整的路由堆栈和网络服务功能。这项基于软件的服务在主要云提供商构建的现有区域基础设施上运行，并使用自己的网络协议和应用程序，如负载均衡器和防火墙。\n借助Alkira Cloud Services Exchange，公司可以使用简单的点击式界面来选择要连接的网络、网络服务和云。这项服务可与Equinix Inc.等大型主机托管提供商提供的互联服务相媲美，Equinix Inc.为各种云提供商提供预置的接入点。\nAlkira首席执行官阿米尔·汗(Amir Khan)在4月份的一次采访中告诉SiliconANGLE的视频工作室The CUBE：“40分钟后，你的整个云基础设施就启动并运行了。”\n科赫颠覆性技术公司总裁蔡斯·科赫说，他的公司是Alkira的客户，它已经亲眼目睹了如何简化公司向云计算的过渡。\n他说：“以科赫公司的规模，一个灵活的、全球的、端到端的网络对我们的竞争力和增长至关重要，我们很高兴能领导阿尔基拉公司的B系列投资。”\nAlkira表示，计划利用新资金进行规模扩张，以满足全球市场对其云服务交易所日益增长的需求。Khan在一份声明中说：“Alkira在部署和交付Alkira网络云方面得到了客户、技术和GTM合作伙伴的巨大响应。”\n今年4月，可汗和他的兄弟阿蒂夫·汗(Atif Khan)一起出现在CUBE上，阿蒂夫·汗担任这家初创公司的首席技术官，他们讨论了他们对公司的未来计划：\n通过一键订阅我们的YouTube频道(如下所示)，显示您对我们使命的支持。我们的订阅用户越多，YouTube向您推荐的相关企业和新兴技术内容就越多。谢谢!。\n…。我们还想告诉您我们的使命，以及您如何帮助我们完成它。SiliconANGLE Media Inc.的商业模式是基于内容的内在价值，而不是广告。与许多在线出版物不同的是，我们没有付费墙或投放横幅广告，因为我们想让我们的新闻保持开放，不受影响，也不需要追逐流量。关于SiliconANGLE的新闻、报道和评论-以及我们的硅谷演播室和CUBE的全球巡回视频团队提供的现场无脚本视频-需要大量的辛勤工作、时间和金钱。要保持高质量，需要赞助商的支持，这些赞助商与我们对无广告新闻内容的愿景保持一致。\n如果您喜欢这里的报道、视频采访等无广告内容，请花点时间查看一下我们赞助商支持的视频内容样本，发推特表示支持，并不断回到SiliconANGLE。", "note_en": "Networking-as-a-service startup  Alkira Inc. said today it has raised $54 million in a funding round that brings its total amount raised to $76 million.\n Koch Disruptive Technologies led the Series B round, with participation from previous investors Kleiner Perkins and Sequoia Capital, plus a new investor, GV Management Co. LLC, which has Google LLC parent as its sole limited partner.\n Alkira first came to attention when it  emerged from stealth mode with $30 million funding in April, launching a Cloud Services Exchange that it said would enable cloud architects to build and deploy multicloud networks in a matter of minutes. The company billed the platform as the world’s first “unified, on-demand multicloud offering” and said its aim was to help connect companies to their public cloud providers, and those providers to each other, to enable more efficient data exchange and distributed application development.\n The Alkira Cloud Services Exchange uses what the company calls “Cloud Exchange Points,” which are globally distributed multicloud points of presence that provide a full routing stack and network service capabilities. The software-based service runs on the existing regional infrastructure built by major cloud providers and uses its own network protocols and applications such as load balancers and firewalls.\n With the Alkira Cloud Services Exchange, companies can use a simple point-and-click interface to choose the network, network services and clouds they want to connect. The service is comparable to the interconnections offered by large colocation providers such as Equinix Inc., which provide pre-built onramps to various cloud providers.\n “After 40 minutes your whole cloud infrastructure is up and running,” Alkira Chief Executive Officer Amir Khan (pictured) told SiliconANGLE’s video studio theCUBE in an interview in April.\n Koch Disruptive Technologies President Chase Koch said his company was a customer of Alkira, and that it had seen first-hand how it can simplify a company’s transition to the cloud.\n “At Koch’s scale an agile, global, end-to end network is critical to our competitiveness and growth and we are excited to lead Alkira’s Series B investment,” he said.\n Alkira said it plans to use the new funds to scale to meet the growing global market demand for its Cloud Services Exchange. “Alkira has seen a tremendous response from customers, and technology and GTM partners to deploy and deliver the Alkira Network Cloud,” Khan said in a statement.\n Khan appeared on theCUBE in April alongside his brother Atif Khan, who serves as the startup’s chief technology officer, and they discussed their future plans for the company:\n   Show your support for our mission with our one-click subscription to our YouTube channel (below). The more subscribers we have, the more YouTube will suggest relevant enterprise and emerging technology content to you. Thanks!\n  … We’d also like to tell you about our mission and how you can help us fulfill it. SiliconANGLE Media Inc.’s business model is based on the intrinsic value of the content, not advertising. Unlike many online publications, we don’t have a paywall or run banner advertising, because we want to keep our journalism open, without influence or the need to chase traffic. The journalism, reporting and commentary on  SiliconANGLE — along with live, unscripted video from our Silicon Valley studio and globe-trotting video teams at   theCUBE — take a lot of hard work, time and money. Keeping the quality high requires the support of sponsors who are aligned with our vision of ad-free journalism content.\n If you like the reporting, video interviews and other ad-free content here, please take a moment to check out a sample of the video content supported by our sponsors,   tweet your support, and keep coming back to   SiliconANGLE.", "posttime": "2020-10-14 01:08:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "technologies,led", "title": "Alkira提供快速构建和部署多云网络的工具，在科赫颠覆技术公司(Koch Disruptive Technologies)的带领下筹集了5400万美元的B系列资金", "title_en": "Alkira, which offers tools to quickly build and deploy multicloud networks, raises $54M Series B led by Koch Disruptive Technologies", "transed": 1, "url": "https://siliconangle.com/2020/10/13/multicloud-networking-startup-alkira-raises-54m-series-b-round/", "via": "", "real_tags": ["led"]}]