[{"category": "", "categoryclass": "", "imagename": "299765ac255c94a6c2c8e299e7e426db.jpg", "infoid": 1002138, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Zerodium本周宣布，由于提交的数量很多，它在未来两三个月内不会购买任何iOS漏洞。换句话说，该公司拥有如此多的安全漏洞可供其使用，因此它不再需要更多的漏洞。\nZerodium是一个漏洞获取平台，它向研究人员支付零日安全漏洞的费用，然后将其出售给政府组织和执法机构等机构客户。该公司专注于高风险漏洞，通常为每个全功能iOS漏洞提供10万至200万美元。\n在接下来的2到3个月内，我们将不会获得任何新的Apple iOS LPE、Safari RCE或沙盒转义，因为与这些向量相关的提交数量很高。没有持久性的iOS一键链接(例如，通过Safari)的价格在不久的将来可能会下降。", "note_en": "Zerodium this week announced that it will not be purchasing any iOS exploits for the next two to three months due to a high number of submissions. In other words, the company has so many security vulnerabilities at its disposal that it does not need any more.\n Zerodium is an exploit acquisition platform that pays researchers for zero-day security vulnerabilities and then sells them to institutional customers like government organizations and law enforcement agencies. The company focuses on high-risk vulnerabilities, normally offering between $100,000 and $2 million per fully functional iOS exploit.\n  We will NOT be acquiring any new Apple iOS LPE, Safari RCE, or sandbox escapes for the next 2 to 3 months due to a high number of submissions related to these vectors.  Prices for iOS one-click chains (e.g. via Safari) without persistence will likely drop in the near future.", "posttime": "2020-05-15 04:09:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,ios,数量,stops", "title": "由于提交数量过多，Zerodium停止购买iOS漏洞", "title_en": "Zerodium Stops Purchasing iOS Exploits Due to High Number of Submissions", "transed": 1, "url": "https://www.macrumors.com/2020/05/14/zerodium-pauses-acquiring-ios-exploits/", "via": "", "real_tags": ["漏洞", "ios", "数量", "stops"]}, {"category": "", "categoryclass": "", "imagename": "e50efdeb9311346020ded31ffffe56bc.jpg", "infoid": 1002137, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，美国联邦调查局(FBI)特工周三查获了参议院情报委员会(Senate Intelligence Committee)主席理查德·伯尔(Richard Burr)的手机，这是对他在冠状病毒大流行导致市场暴跌之前进行的股票交易调查的一部分。据“洛杉矶时报”报道，为了获得对这位参议员手机的搜查令，联邦调查局首先求助于苹果公司。\n“泰晤士报”援引一位不愿透露姓名的执法官员的话说，该机构最近向苹果公司发出逮捕令，要求其从Burr&#39；的iCloud账户获取信息。根据“泰晤士报”的报道，联邦调查局特工从苹果公司获得的数据随后被用作获得对伯尔手机的搜查令所需的证据的一部分。\n据哥伦比亚广播公司新闻(CBS News)报道，1月下旬至2月中旬，伯尔和他的妻子在30笔交易中出售了60万至170万美元的股票。许多交易的股票都是受冠状病毒重创的行业。据报道，FBI正在调查伯尔是否违反了一项法律，该法律禁止国会议员根据他们通过官方工作获得的、公众无法获得的信息进行股票交易。(编辑注：CNET和CBS新闻均为维亚康姆CBS所有。)。\n据CBS新闻报道，伯尔曾公开为这些交易辩护，称他完全依赖公共新闻报道。他还要求参议院道德委员会对此事进行审查。\n周四，参议院多数党领袖米奇·麦康奈尔(Mitch McConnell)表示，伯尔将在调查期间辞去情报委员会主席一职。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "FBI agents reportedly  seized the cellphone of Sen. Richard Burr, chairman of the Senate Intelligence Committee, on Wednesday as part of an investigation into stock trades he made before the market plunged due to the   coronavirus pandemic. In order to get a warrant for the senator&#39;s phone, the FBI first turned to  Apple, according to a report from the  Los Angeles Times.\n The agency recently served a warrant to Apple to get information from Burr&#39;s iCloud account, according to the Times, citing an unnamed law enforcement official. The data that the FBI agents got from Apple was then used as part of the evidence needed to obtain a warrant for Burr&#39;s phone, according to the Times.\n  Between late January and mid-February, Burr and his wife sold between $600,000 and $1.7 million in stocks over 30 transactions, according to CBS News. Many of the stocks traded were in industries hit hard by the coronavirus. The FBI is reportedly investigating whether Burr violated a law preventing members of Congress from trading stocks based on information they receive through official work that isn&#39;t available to the public. (Editors&#39; note: CNET and CBS News are both owned by ViacomCBS.)\n  Burr has publicly defended the transactions, according to CBS News, saying he relied solely on public news reports. He&#39;s also asked the Senate Ethics Committee to review of the matter.\n On Thursday, Senate Majority Leader Mitch McConnell said  Burr would step aside as chairman of the Intelligence Committee during the investigation.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-05-15 03:54:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,apple,icloud,伯尔", "title": "FBI向苹果发出逮捕令，要求从参议员伯尔的iCloud账户中获取数据", "title_en": "FBI issued warrant to Apple to get data from Sen. Burr's iCloud account", "transed": 1, "url": "https://www.cnet.com/news/fbi-reportedly-issued-warrant-to-apple-to-get-data-from-sen-burrs-icloud-account/", "via": "", "real_tags": ["苹果", "app", "apple", "icloud", "伯尔"]}, {"category": "", "categoryclass": "", "imagename": "104b54f2aea317c01ab472469c59e81b.png", "infoid": 1002136, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果和Eero正在合作，通过苹果的在线商店直接销售网状网络设备。Eero在今天的一篇博客中宣布了这一消息，今年早些时候，Eero是第一个增加HomeKit路由器支持的公司。\n苹果正在销售Eero的全系列网状网络配件。这包括Eero Pro Mesh本身和各种不同的捆绑包和信标，以及标准的Eero Mesh WiFi系统。目前，这些产品只能通过苹果在线商店购买，而且似乎没有计划将Eero Gear带到苹果实体店。\nEero表示，其产品可通过苹果在美国、加拿大、英国、德国、法国、意大利和西班牙的在线商店购买：\n这是朝着实现我们的愿景迈出的令人兴奋的一步，我们的愿景是将eero带给世界各地的更多客户和家庭，为他们的智能家居提供安全可靠的网络。今天的声明是在eero对Apple HomeKit的支持之后发布的，Apple HomeKit是我们日益增长的智能家居集成阵容中的一个关键成员。\n亚马逊的Eero是第一家增加对HomeKit路由器支持的网络公司，将这一功能引入Eero和Eero Pro系统。HomeKit路由器为智能家居配件提供增强的安全性。苹果公司将HomeKit路由器支持描述为“通过控制您的家庭Wi-Fi网络和互联网上与哪些服务和设备通信，为您的家庭附件增加了更多的保护。”\n你可以在这里的苹果在线商店查看支持HomeKit的Eero配件的完整阵容。苹果和亚马逊的价格略有不同，你也可以通过亚马逊找到一些翻新的选择。\n您有没有试用过Eero的HomeKit支持？如果是这样的话，您觉得它的功能怎么样？请在评论中让我们知道！\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "Apple and Eero are teaming up to sell the mesh networking gear directly through Apple’s Online Store. Eero made the announcement in a  blog post today, with the partnership coming after Eero was the first to add HomeKit router support earlier this year.\n  Apple is selling  Eero’s complete lineup of mesh networking accessories. This includes the Eero Pro Mesh itself and various different bundles and beacons, alongside the standard Eero Mesh WiFi System. At this point, the products are only available through the Apple Online Store, and it does not appear there are plans to bring Eero gear to physical Apple Stores.\n Eero says its products are available through Apple’s Online Store in the United States, Canada, UK, Germany, France, Italy, and Spain:\n This is an exciting step towards delivering our vision to bring eero to more customers and homes around the world, providing them with a safe and reliable network for their smart home. Today’s announcement follows eero’s support for Apple HomeKit, a key addition to our growing line-up of smart home integrations.\n Amazon’s Eero  was the first networking company to add support for HomeKit routers, bringing the feature to the  Eero and  Eero Pro systems. HomeKit routers offer enhanced security for smart home accessories. Apple describes HomeKit router support as adding “more protection to your home accessories by controlling which services and devices they communicate with on your home Wi-Fi network and over the Internet.”\n You can check out the full lineup of HomeKit-capable Eero accessories at  Apple’s Online Store here. Prices vary slightly between Apple and  Amazon, and you can find some  refurbished options through Amazon as well.\n Have you tried out HomeKit support with Eero yet? If so, what do you think of the functionality? Let us know down in the comments!\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-05-15 03:54:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,苹果,app,apple", "title": "苹果开始销售亚马逊的eero网状路由器", "title_en": "Apple begins selling Amazon's eero mesh routers", "transed": 1, "url": "https://9to5mac.com/2020/05/13/apple-eero-selling-homekit/", "via": "", "real_tags": ["amazon", "亚马逊", "苹果", "app", "apple"]}, {"category": "", "categoryclass": "", "imagename": "fe27e707b665aed562798765d338b32d.jpg", "infoid": 1002135, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一家允许中小型公司比较不同商业产品的公司，世界上第一位万亿富翁很可能是亚马逊创始人兼首席执行官杰夫·贝佐斯。\n他们的预测显示，贝佐斯到2026年将达到万亿富翁的地位。该公司表示，他们的预测是基于过去五年的年均增长百分比，并将其应用于未来几年。\n比较显示，贝佐斯的净资产在过去五年中平均增长了34%。\n根据彭博亿万富翁指数(Bloomberg‘s Billionaire Index)，截至周四上午，贝佐斯的净资产估计为1430亿美元，同时每天都在追踪世界上最富有的人的资产。与去年相比，贝佐斯的身价飙升了280亿美元。\n这一预测在推特上引发了愤怒，指出有多少人在冠状病毒大流行期间陷入财务困境，因为贝佐斯赚了数十亿美元。\n推特用户@Thomas_A_Moore说，杰夫·贝佐斯即将成为世界上第一位万亿富翁，而我们即将步入萧条。\n在亚马逊员工在冠状病毒流行期间继续工作期间，亚马逊员工对他们的安全进行了公开抗议，之后人们开始谈论贝佐斯潜在的万亿富翁身份。5月1日，亚马逊和包括Insta在内的其他公司的工人举行罢工，抗议工作场所缺乏足够的保护。\n亚马逊表示，2020年上半年，该公司在包括口罩、洗手液和仓库增加洗手站在内的安全措施上花费了超过8亿美元。该公司还雇佣了17.5万名新工人来跟上需求，因为数百万消费者依赖亚马逊在滞留在家的情况下送货。\n本月早些时候，亚马逊副总裁、亚马逊网络服务(Amazon Web Services)杰出工程师蒂姆·布雷(Tim Bray)宣布，由于解雇了公开反对员工在仓库中受到的待遇的高管，他将离开公司。\n这并不是这位亚马逊首席执行官的巨额财富第一次受到密切关注。今年1月，贝佐斯透露，亚马逊将捐赠100万澳元-或69万美元-用于澳大利亚的野火恢复工作。然而，批评人士抨击贝佐斯在考虑到他的财富方面做得不够。", "note_en": "According to  Comparisun, a company which allows small- to medium-sized firms to compare different business products, the world&#39;s first trillionaire will likely be Amazon founder and CEO Jeff Bezos.\n Their projection shows Bezos reaching trillionaire status by 2026. The company said their projection is based on taking the average percentage of yearly growth over the past five years and applying it to future years.\n Comparisun shows Bezos&#39; net worth grew an average of 34% over the last five years.\n  As of Thursday morning, Bezos&#39; net worth was estimated at $143 billion, according to  Bloomberg&#39;s Billionaires Index, whilch tracks the worth of the world&#39;s richest people daily. Compared to last year, Bezos&#39; worth has surged by more than $28 billion.\n The projection has sparked anger on Twitter, noting how many people are financially struggling during the coronavirus pandemic as Bezos rakes in billions of dollars.\n &#34;Jeff Bezos is about to become the world&#39;s first trillionaire while we&#39;re about to enter a depression,&#34; said Twitter user @Thomas_A_Moore.\n    Talk of Bezos&#39; potential trillionaire status  follows public protests by Amazon employees over their safety as they continue to work during the coronavirus pandemic. On May 1, workers for Amazon and other companies including Instacart held a strike protesting a lack of &#34;adequate protection in the workplace.&#34;\n Amazon said it spent more than $800 million in the first half of 2020 on safety measures including masks, hand sanitizer and additional hand-washing stations at warehouses. The company also hired 175,000 new workers to keep up with demand as millions of consumers lean on Amazon to have goods delivered while stuck at home.\n  Earlier this month, Tim Bray, Amazon&#39;s vice president and &#34;Distinguished Engineer&#34; at Amazon Web Services,  announced he was leaving the company over the firing of executives who spoke out against how workers were treated in their warehouses.\n This is not the first time the Amazon CEO&#39;s immense fortune has faced scrutiny. In January,  Bezos revealed Amazon would donate $1 million Australian dollars – or $690,000 in U.S. dollars – to wildfire recovery efforts in Australia. However, critics blasted Bezos for not doing enough in light of his wealth.", "posttime": "2020-05-15 03:39:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "贝佐斯,可能,bezos", "title": "杰夫·贝佐斯可能成为世界上第一位万亿富翁", "title_en": "Jeff Bezos could become world's first trillionaire", "transed": 1, "url": "https://www.usatoday.com/story/tech/2020/05/14/jeff-bezos-worlds-first-trillionaire-sparks-heated-debate/5189161002/", "via": "", "real_tags": ["贝佐斯", "可能", "bezos"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日本4月自杀率较去年同期下降20%，为五年来最大降幅，尽管担心冠状病毒大流行会造成压力增加，而且许多预防求助热线要么没有开通，要么人手不足。\n人们花更多的时间在家里陪伴家人，减少通勤上班的人数，以及推迟到开学时间，这些都被视为秋季的因素。\n4月份，日本有1455人自杀，比2019年4月减少了359人。自2003年达到每年3.4万多起的峰值以来，日本的自杀率一直呈下降趋势。去年仅略高于2万人，上个月的大幅下降发生在人们对新一轮飙升的担忧之时。\n日本新感染冠状病毒的人数在4月中旬达到顶峰，每天超过500人，导致政府在4月16日宣布进入紧急状态，尽管限制没有其他国家那么严格。\n居家措施影响了预防自杀的组织，其中约40%的组织要么关闭，要么减少工作时间，导致对弱势群体的担忧。\n近年来，在自杀率下降的同时，儿童自杀率有所上升，学校欺凌和其他问题是经常被提及的原因。对于一些人来说，4月份的学年开始对一些人来说是一个特别紧张的时期，但由于大流行而推迟可能拯救了生命，至少是暂时的。\n“学校对一些年轻人来说是一种压力，但今年4月就没有这样的压力了，”日本猪内义社联合会(Japan Federation of Inochi-no-Denwa)前电话咨询服务负责人斋藤由纪夫(Yukio Saito)说。“在家里和家人在一起，他们感到安全。”至于成年人，齐藤说，在国家危机和灾难发生的时候，“传统上，人们不会想到自杀”。齐藤指出，2011年，也就是福岛大地震、海啸和核熔毁的那一年，自杀病例有所下降。。上下班人数的大幅下降也被视为自杀率较低的另一个因素，因为他们经常在办公室工作很长时间。\n然而，经济和工作压力是因素。1997年亚洲金融危机后的一年，创纪录的涨幅接近35%。齐藤说，大流行造成的长期经济低迷可能会导致病例反弹，他也曾担任日本自杀预防协会主席。", "note_en": "The suicide rate in  Japan fell by 20% in April compared with the same time last year, the biggest drop in five years, despite fears the coronavirus pandemic would cause increased stress and many prevention helplines were either not operating or short-staffed.\n People spending more time at home with their families, fewer people were commuting to work and delays to the start of the school year are seen as factors in the fall.\n In April, 1,455 people took their lives in Japan, 359 fewer than in April 2019. Suicide has been on a downward trend in Japan since peaking at more than 34,000 cases annually in 2003. Last year saw just over 20,000, and the large drop last month came at a time when there were fears of a fresh spike.\n  New coronavirus infections reached their peak in mid-April in Japan at more than 500 a day, leading the government to declare a state of emergency on 16 April, though the restrictions were less strict than those of other countries.\n The stay-at-home measures affected suicide prevention organisations, with about 40% of them either shut down or working reduced hours, leading to worries about vulnerable people.\n Amid the decline in suicide of recent years, there has been an increase among children, with bullying and other problems at school a frequently cited cause. The start of the academic year, in April in Japan, is a particularly stressful time for some, but its postponement due to the pandemic may have saved lives, at least temporarily.\n “School is a pressure for some young people, but this April there is no such pressure,” said Yukio Saito, a former head of telephone counselling service the Japanese Federation of Inochi-no-Denwa. “At home with their families, they feel safe.”  As for adults, at times of national crisis and disasters, “traditionally, people don’t think about suicide”, said Saito, pointing to a drop in cases in 2011, the year of the giant earthquake, tsunami and nuclear meltdowns at Fukushima.  . A large drop in the number of people commuting to offices, where they often work long hours, is also being seen as another contributing factor in the lower suicide rate.\n However, economic and work pressures are factors. The year after the 1997 Asian financial crisis saw a record rise of nearly 35%. A prolonged economic downturn caused by the pandemic could lead to a rebound in cases, said Saito, who also served as chair of the Japanese Association for Suicide Prevention.", "posttime": "2020-05-15 03:37:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,日本,冠状病毒,自杀,suicides", "title": "日本自杀率下降，冠状病毒封锁导致压力因素发生变化", "title_en": "Japan suicides decline as Covid-19 lockdown causes shift in stress factors", "transed": 1, "url": "https://www.theguardian.com/world/2020/may/14/japan-suicides-fall-sharply-as-covid-19-lockdown-causes-shift-in-stress-factors", "via": "", "real_tags": ["病毒", "日本", "冠状病毒", "自杀", "suicides"]}, {"category": "", "categoryclass": "", "imagename": "69db3e2bf1545a9fa241caa3a1439232.jpg", "infoid": 1002132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SAFE旨在帮助您更快地重新开放建筑物，并在不侵犯隐私的情况下保护您的团队、员工和访客的安全。SAFE有三个关键功能-显示、分析和警报。\n如果您是现有的Density客户，则此升级是免费的。如果您是新客户，请发送电子邮件至safe@density.io开始。\n设置任何房间、楼层或建筑物的最大容量，保险箱将自动确定是否有足够的空间供人进入。\n人们都很聪明。使用安全显示为他们提供所需的数据，以确定他们是否愿意进入空间。安全显示针对任何数字标牌进行了优化。尤其是您已经拥有的标牌-平板电脑、电视、移动设备、网络等。\n我们知道管理团队希望将他们的员工安全带回来。Safe Analytics跟踪数百万平方英尺空间的安全合规性。有关您所有地区的数据可从世界任何地方实时获得。\n如果你缺乏可见性，快速反应是不可能的。当员工人数达到不安全水平时，安全警报将实时通知安全、安全和工作场所团队。我们在本地集成了Density的实时通知系统，以便在紧急情况下向您推送数据。安全警报支持短信、原生推送和电子邮件。所有你需要做的就是设置一个最大值，密度会完成剩下的事情。\nSAFE正被部署到世界各地的制造工厂、食品杂货连锁店、配送中心、便利店、餐馆和企业房地产。", "note_en": "Safe is designed to help you re-open buildings sooner and keep your teams, employees, and visitors safe without invading privacy. Safe has three key features — Display, Analytics, and Alerts.\n If you are an existing Density customer, this upgrade is free. If you’re a new customer, please email  safe@density.io to get started.\n  Set your maximum capacity for any room, floor, or building and Safe will automatically determine if there’s enough space for people to enter.\n    People are smart. Use Safe Display to give them the data they need to decide if they’re comfortable entering a space. Safe Display is optimized for any digital signage. Especially the signage you already have — tablet, tv, mobile, web, etc.\n    We know management teams want to bring their employees back safely. Safe Analytics keeps track of safety compliance across millions of sqft of space. Data about all your regions is available in real-time from anywhere in the world.\n    Rapid response is impossible if you lack visibility. When headcount reaches unsafe levels, Safe Alerts will notify security, safety, and workplace teams in real-time. We’ve natively integrated Density’s real-time notification system to push you data when it’s urgent. Safe Alerts support SMS, native push, and email. All you need to do is set a maximum and Density will do the rest.\n  Safe is being deployed into manufacturing plants, grocery chains, fulfillment centers, convenience stores, restaurants, and corporate real estate all around the world.", "posttime": "2020-05-15 03:23:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密度,safe,安全", "title": "简介：按密度安全", "title_en": "Introducing: Safe by Density", "transed": 1, "url": "https://www.density.io/blog/safe-by-density/", "via": "", "real_tags": ["密度", "safe", "安全"]}, {"category": "", "categoryclass": "", "imagename": "8b32d45a727bba26e78998681f5425f3.jpg", "infoid": 1002131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "互联互通是我们使命的核心，我们的使命是让人们有能力建立社区。我们致力于让更多的人上网，享受更快的互联网-在全球35亿人没有联网的情况下，还有很多事情要做。非洲目前是连接最少的大陆，其13亿人口中只有四分之一多一点连接到了互联网。作为我们承诺的一部分，我们自豪地宣布，Facebook已经与非洲和全球领先的运营商合作，建设2Africa，这是服务于非洲大陆和中东地区的最全面的海底电缆。作为一条变革性的电缆，2Africa是世界上最大的海底电缆项目之一，将连接非洲、中东和欧洲的23个国家。非洲全长37000公里，几乎相当于地球的周长。仅就长度而言，该项目就令人印象深刻：它将提供今天服务于非洲的所有海底电缆总网络容量的近三倍。建成后，这条新线路将在整个非洲提供急需的互联网容量、冗余和可靠性，补充中东地区迅速增长的容量需求，并支持数亿人4G、5G和宽带接入的进一步增长。\n像我们所有的投资一样，2非洲正在完成，这是我们努力建立一个开放和包容的互联网生态系统的一部分，这是非洲大陆数字经济增长的重要组成部分。在2Africa电缆落地的国家，服务提供商将在公平和公平的基础上获得运营商中立数据中心和开放接入电缆着陆站的容量。作为第一个通过单一开放系统无缝连接东非和西非的海底电缆系统，2非洲将提供新的从东海岸到西海岸的通信途径。此外，我们正在开发一条连接红海和地中海的新通道，这是该地区十多年来的第一条通道。\n这种扩展的容量将通过极大地改善个人和企业的可访问性，促进健康的互联网生态系统。我们亲眼目睹了加强互联互通对从教育到医疗保健等社区的积极影响。我们知道，当企业有广泛可访问的互联网时，经济就会蓬勃发展。该项目建立在我们与互联网协会的伙伴关系基础上，以发展互联网交流，并在非洲提供技术培训、支持和设备。我们将非洲视为支持互联网大规模扩张的重要支柱，作为非洲不断增长的数字经济的一部分。\n在非洲的投资建立在我们在该地区的其他投资基础上，包括在南非、乌干达、尼日利亚和刚果民主共和国的基础设施投资。正在进行的冠状病毒大流行突显了互联的重要性，因为世界各地数十亿人依靠互联网工作、上学，并与他们关心的人保持联系。2非洲将不仅是推进整个非洲大陆互联互通基础设施的重要因素，也是在经济复苏的关键时刻进行的重大投资。\n技术的进步提高了这个项目的效率。这是第一个将创新的铝导体用于海底电缆系统的系统。此外，通过实施空分复用(SDM 1)技术，我们将旧技术支持的最多8对光纤对翻了一番，以实现明显更具资源效率的光缆。SDM1是目前可用于海底电缆的最新创新技术。多达16对光纤，2非洲将允许更大的容量。这也将是波长选择交换(WSS)-ROADM首次在非洲使用，从而实现更灵活的容量管理。\n2Africa电缆最重要的特点之一是，它在设计时考虑了弹性，以获得最佳性能。电缆设计本身增加了50%的埋深-最高可达3米-以确保最高的可用性，并提供更好的保护以防止损坏。此外，我们使用先进技术设计电缆布线，以避免已知海底干扰区域，以确保最高级别的可用性。\n2非洲是我们不断努力扩大全球网络基础设施的延续。我们与世界各地的合作伙伴合作建造了几条海底光缆，这些光缆在覆盖范围、容量和灵活性方面处于行业领先地位。2非洲是我们创新伙伴关系模式的最新例子，在这种模式下，每个人都从发展大规模基础设施和共享技术专业知识中受益。", "note_en": "Connectivity is at the heart of our mission to give people the power to build community. We are committed to bringing more people online to a faster internet — and with   3.5 billion people globally unconnected , there is still a lot to do. Africa is currently the least connected continent, with just over a quarter of its 1.3 billion people connected to the internet. As part of our commitment, we’re proud to announce that Facebook has partnered with leading African and global operators to build 2Africa, the most comprehensive subsea cable to serve the African continent and Middle East region. A transformational cable, 2Africa is one of the largest subsea cable projects in the world and will interconnect 23 countries in Africa, the Middle East, and Europe.     At 37,000 kilometers long, 2Africa will be nearly equal to the circumference of the Earth. The project is impressive for more than length alone: It will provide nearly three times the total network capacity of all the subsea cables serving Africa today. When completed, this new route will deliver much-needed internet capacity, redundancy, and reliability across Africa; supplement a rapidly increasing demand for capacity in the Middle East; and support further growth of 4G, 5G, and broadband access for hundreds of millions of people.\n   Like all of our investments, 2Africa is being completed as part of our efforts toward an open and inclusive internet ecosystem, which is a vital part of the continent’s digital economic growth. In the countries where the 2Africa cable lands, service providers will obtain capacity in carrier-neutral data centers and open-access cable landing stations on a fair and equitable basis. The first subsea cable system to seamlessly connect East and West Africa across a single open system, 2Africa will enable new avenues of communication from coast to coast. In addition, we are developing a new crossing that links the Red Sea and the Mediterranean Sea, the first in this region in over a decade.\n This expanded capacity will facilitate a healthy internet ecosystem by enabling greatly improved accessibility for people and businesses alike. We have seen firsthand the positive impact that increased connectivity has on communities, from education to health care. We know that economies flourish when there is widely accessible internet for businesses. This project builds on our partnership with the   Internet Society  to develop internet exchanges and provide technical training, support, and equipment in Africa. We see 2Africa as an important pillar supporting tremendous internet expansion as part of Africa’s growing digital economy.\n The investment in 2Africa builds on other investments we have made in the region, including   infrastructure investments  in South Africa, Uganda,   Nigeria , and the   Democratic Republic of the Congo . The ongoing COVID-19 pandemic has highlighted the importance of connectivity as billions of people around the world rely on the internet to work, attend school, and stay connected to those they care about. 2Africa will be not only an important element for advancing connectivity infrastructure across the African continent, but also a major investment that comes at a crucial time for economic recovery.\n  Technological advancements have increased the efficiency of this project. This is the first system of its size to make use of an innovative   aluminum conductor for submarine cable systems . In addition, we have doubled the maximum eight fiber pairs supported by older technology for significantly more resource-efficient fiber optic cable by implementing   Spatial Division Multiplexing (SDM 1)  technology. SDM1  is the latest innovative technology currently available for submarine cables. With up to 16 fiber pairs, 2Africa will allow for far greater capacity. It will also be the first time Wavelength Selective Switching (WSS)-ROADM is utilized in Africa, allowing for more flexible capacity management.\n One of the most important features of the 2Africa cable is that it was designed with resiliency in mind to attain optimal performance. The cable design itself provides an increase of 50 percent in burial depth — up to three meters — to ensure the highest availability with greater protection against damage. In addition, we designed the cable routing using advanced techniques to avoid areas of known subsea disturbance to ensure the highest levels of availability.\n 2Africa is a continuation of our ongoing efforts to expand global network infrastructure. We have collaborated with partners all over the world to build several subsea fiber-optic cables that are leading the industry in terms of reach, capacity, and flexibility. 2Africa is the latest example of our innovative partnership model, in which everyone benefits from developing scale infrastructure and shared technology expertise.", "posttime": "2020-05-15 03:23:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "非洲,连接,subsea", "title": "建造一条海底电缆，更好地连接非洲", "title_en": "Building a subsea cable to better connect Africa", "transed": 1, "url": "https://engineering.fb.com/connectivity/2africa/", "via": "", "real_tags": ["非洲", "连接", "subsea"]}, {"category": "", "categoryclass": "", "imagename": "1f3437cb22ac712ff5b1690e2c568ec7.png", "infoid": 1002130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您是否希望从事网络管理员或网络工程师的职业？这将是一个非常有帮助的指南，因为我们将分享一些免费的网络认证和课程。\n网络管理是信息技术的核心领域之一。全世界每年诞生数以千计的网络管理员。这是一个极其多样化的领域，但对专家和专家的需求仍然很大。\n在网络领域有许多认证路径，CCNA、CCNP和CCIE是最受欢迎的。\n以下是您作为网络专家可以擅长的不同专业化认证领域：\n然后在这些专业领域下有更多的子类别。如果您是这个领域的新手，您应该首先学习网络的基础知识，然后再决定要走哪条路。\n以下是您现在可以参加的最佳网络认证和课程的综合列表：\nIT大师是查尔斯斯特特大学附属的最受认可的在线培训机构之一。幸运的是，他们还为有志成为网络管理员的学生提供专门的网络课程/认证路径。\n课程非常详细，大约需要5周时间才能完成。完成培训课程后，您将有资格获得免费证书。\n主要主题包括基本网络、IP编址、路由、安全和故障排除。这是一门每个网络专业学生都应该学习的完整实践课程。\nCoursera是最大的在线教育提供商之一。他们有一门关于网络基本概念的很棒的免费课程。在本课程中，您将学习如何使用有限的设备和配置构建基于家庭的小型网络。\n在本课程中，您还将学习如何使用Packet Tracer等网络模拟工具。它使您可以在PC上近乎真实的环境中实施和练习。\n这门课程的反馈率很高，讲师讲得很清楚，也很理解。\n证书不是免费的。然而，你可以很容易地通过申请经济援助来申请免费证书。\nFortinet是全球领先的网络安全产品提供商之一。无论是大公司还是小公司，其专家对于保护其网络基础设施的需求总是很高。\n最近，Fortinet推出了他们的免费网络安全认证计划，让您有机会学习并获得助理级别的认证。\n您所需要做的就是创建您的帐户作为“公共”成员并开始学习。\n此认证课程路径可能是我们共享的所有课程中最有价值的。原因是这个范围广泛的免费课程为您准备了多种国际认可的认证，包括Google IT支持专业证书、CompTIA A+和Net+。\n这是一个连续15天的全日制课程。注册此课程不需要任何先前的经验。申请全年接受。\n一旦课程完成，PER Scholas将赞助谷歌和CompTIA认证的所有考试。你不需要付一分钱。\n唯一的问题是，只有当你被授权在美国工作时，你才有资格申请这门课程。\nOpen.edu是一所全球开放大学，允许来自所有国家的所有人不受任何歧视地进入。他们有几乎所有研究领域的优秀课程。\nOpen.edu有一个专门的网络安全课程轨道，需要大约25个小时的学习时间。这是一门高级课程，要求您具备网络方面的中级知识。您将了解威胁范围、加密算法、访问控制和身份验证机制。\n完成课程后，您将获得一份免费的参与声明或数字徽章，具体取决于是否可用。\nSaylor.org是2008年发起的一个全球性非营利组织。他们的使命是用免费的在线课程教育尽可能多的学生。\n如果你是计算机科学专业的学生，你可以免费参加他们的CS402：计算机通信与网络课程。在本课程中，您将学习网络基础知识，最重要的是了解OSI层。\n课程持续时间为60小时，完成后您将获得一份免费的结业证书。\n这些免费课程肯定会给您的网络职业生涯带来启迪。最好的方法是从基本的入门课程开始，然后进入高级课程。同时，这里有一些其他领域的免费在线课程和证书。", "note_en": "Are you looking to pursue a career as Network Administrator or Network Engineer? This is going to be an extremely helpful guide for you because we are going to share a number of free Network certification and courses.\n Network Administration is one of the core fields of Information Technology. Thousands of Network Administrators are born each year worldwide. It’s an extremely diversified field and yet there is still huge demand for experts and specialists.\n There are a number of certification tracks in the Networks field, CCNA, CCNP and CCIE being the most popular ones.\n Here are the different specialization areas that you can excel in as a Networks expert:\n  And then there are more sub-categories under these specialized areas. If you are new to this field, you should first learn the basics of Networking and then decide which path you want to pursue.\n  Here’s a comprehensive list of the best Network certifications and courses you can take right now:\n   IT Masters is one of the most recognized online training institute affiliated with Charles Sturt University. Luckily, they are also offering a dedicated Network course / certification track for students aspiring to become Network Administrators.\n The course is very detailed and takes around 5 weeks to complete. Once you complete the training course you will be eligible for a free certificate.\n Major topics include Basic Networking, IP Addressing, Routing, Security and Troubleshooting. It’s a complete hands-on course which every Networking student should take.\n    Coursera is one of the biggest online Education providers. They have a great free course on the Basic concepts of Networking. In this course, you will learn to build small scale home based networks with limited devices and configuration.\n In the course you will also learn how to use Network simulation tools like Packet Tracer. It gives you the benefit of implementing and practicing in an almost realistic environment on your PC.\n The course has great feedback rating and the instructor has delivered the lectures with clarity and understanding.\n The certificate does not come free. However, you can easily apply for a free certificate by applying for  financial aid.\n    Fortinet is one of the leading Network security products provider all over the world. Its experts are always high in demand in small and large corporations for securing their Network infrastructures.\n Recently Fortinet has rolled out their Free Network Security certification program that offers you the opportunity to learn and get certified up to Associate level.\n All you need to do is to create your account as a “Public” member and start learning.\n    This certification course track is probably the most valuable of all courses we have shared. Reason being that this extensive free course prepares you for multiple Internationally recognized certifications including Google IT Support Professional Certificate, CompTIA A+ and Net+.\n It’s a full-time course which goes on for 15 days straight. No prior experience is needed to enroll for this course. Applications are accepted throughout the year.\n Once the course is completed, Per Scholas sponsors all the exams for the Google and CompTIA certifcations. You don’t have to pay a single penny.\n The only catch is you are only eligible to apply for this course if you’re authorized to work in the U.S.\n    Open.edu is a Global Open University that allows access to all people from all countries without any discrimination. They have excellent courses belonging to almost all study areas.\n Open.edu has a dedicated course track for Network Security which takes approximately 25 hours of study time. It’s an advanced course that requires you to have Intermediate knowledge on Networking. You will learn about the Threat spectrum, Encryption algorithms, Access control and Authentication mechanisms.\n Upon completion of the course, you will get a Free statement of participation or a Digital badge depending on availability.\n    Saylor.org is a global non-profit initiative launched in 2008. Their mission is to educate as many students as possible with free online courses.\n If you are a Computer Science student, you can enroll in their CS402: Computer Communications and Networks course for free. In this course you will learn about Networking fundamentals and most importantly, the OSI Layer.\n The course duration is 60 hours and you will get a free certificate of completion when it’s complete.\n  These free courses will definitely give you a jump-start in your Networking career. The best approach would be to start with the basic introductory courses and moving on to the advanced ones. Meanwhile, here are some  Free online courses and certifications for other fields.", "posttime": "2020-05-15 03:22:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,free,网络", "title": "提供免费认证的免费网络课程列表", "title_en": "A List of Free Networking courses that offer free certification", "transed": 1, "url": "https://www.helpmegeek.com/free-network-certifications-and-courses/", "via": "", "real_tags": ["免费", "free", "网络"]}, {"category": "", "categoryclass": "", "imagename": "d0650c81885adc44760351940e500d90.jpg", "infoid": 1002128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用lyrics.lip抓取Genius歌词数据库，我制作了一个马尔科夫链来写AC/DC歌词。这就是最终的结果--“大舞会”。多亏了这位天才。", "note_en": "Using lyrics.rip to scrape the Genius Lyrics Database, I made a Markov Chain write AC/DC lyrics. This is the end result- \"Great Balls\". Thanks to the geniuse...", "posttime": "2020-05-15 03:21:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制作,dc,歌词", "title": "用马尔科夫链制作AC/DC歌曲", "title_en": "AC/DC Song Made with a Markov Chain", "transed": 1, "url": "https://www.youtube.com/watch?v=vpEVsDN84Hc&feature=emb_logo", "via": "", "real_tags": ["制作", "dc", "歌词"]}, {"category": "", "categoryclass": "", "imagename": "a1ea635e6439f4c7883074ee27c3eae0.png", "infoid": 1002127, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于冠状病毒爆发，GTC 2020被转移到全虚拟会议，期待已久的下一代NVIDIA特斯拉GPU发布随后被推迟。然而，今天，NVIDIA首席执行官Jensen Huang的主旨演讲走上了虚拟舞台，宣布了NVIDIA全新的GPU架构Ampere，以及将使用它的首批产品。最重要的是新款特斯拉图形处理器NVIDIA A100。\nNVIDIA安培架构--A100的核心是NVIDIA安培GPU架构，该架构包含超过540亿个晶体管，是全球最大的7纳米处理器。\n采用TF32的张量磁芯-NVIDIA广泛采用的张量磁芯现在更灵活、更快速、更易于使用。它们的扩展功能包括新的TF32 for AI(TensorFloat)，无需任何代码更改，AI性能最高可达FP32精度的20倍。此外，张量内核现在将支持FP64，提供比上一代HPC应用程序多2.5倍的计算。\n多实例GPU-MIG是一项新的技术功能，可以将单个A100 GPU分区为多达七个独立的GPU，以便为不同规模的作业提供不同程度的计算，从而提供最佳利用率和最大投资回报。\n第三代NVIDIA NVLink可将GPU之间的高速连接速度提高一倍，从而在服务器中提供高效的性能扩展。\n结构稀疏性-这项新的效率技术利用了AI数学固有的稀疏性，将性能提高了一倍。\nNVIDIA A100张量酷睿GPU实现了NVIDIA加速数据中心平台的下一个巨大飞跃，在各个规模提供无与伦比的加速，并使这些创新者能够在一生中完成他们毕生的工作。A100推动了许多应用领域，包括HPC、基因组学、5G、渲染、深度学习、数据分析、数据科学和机器人技术。\nNVIDIA今天提出了下一代计算的愿景，将全球信息经济的重点从服务器转移到新一类强大、灵活的数据中心。\n1)峰值速率基于GPU Boost时钟。2)A100 SM中的4个张量核的FMA计算能力是GV100 SM中8个张量核的2倍。3)使用新的稀疏功能实现有效的TOPS/TFLOPS。\n人工智能模型的复杂性正在爆炸式增长，因为它们面临着更高层次的挑战，如准确的对话式人工智能和深度推荐系统。培训他们需要强大的计算能力和可扩展性。\nNVIDIA A100具有张量浮点(TF32)精度的第三代张量芯在零代码更改的情况下提供比上一代高达20倍的性能，并通过自动混合精度和FP16额外提高2倍的性能。当与第三代NVIDIA®NVLink®、NVIDIA NVSwitch™、PCIGen4、NVIDIA Mellanox Infiniband和NVIDIA Magnum IO™软件SDK结合使用时，可以扩展到数以千计的A100 GPU。这意味着像Bert这样的大型人工智能模型可以在短短37分钟内在1024架A100的群集上进行培训，提供前所未有的性能和可扩展性。\nA100引入了突破性的新功能来优化推理工作负载。它加速了从FP32到FP16再到INT8再到INT4的全系列精度，带来了前所未有的多功能性。多实例GPU(MIG)技术允许多个网络在单个A100 GPU上同时运行，以实现计算资源的最佳利用。结构稀疏支持在A100的其他推理性能提升的基础上提供了高达2倍的性能。\n为了解开下一代的发现，科学家们希望通过模拟来更好地理解复杂分子来进行药物发现，通过物理来寻找潜在的新能源，并通过大气数据来更好地预测和准备应对极端天气模式。\nA100引入了双精度张量内核，这是自用于HPC的GPU中引入双精度计算以来的最大里程碑。这使得研究人员能够将在NVIDIA V100张量核心图形处理器上运行的10小时双精度模拟减少到在A100上运行仅4小时。高性能计算应用还可以利用A100张量内核中的TF32精度，实现高达10倍的单精度密集矩阵乘法运算吞吐量。\nNVIDIA还发布了最新的NVIDIA DGX A100服务器，这是世界上第一款5petaflops服务器。\nNVIDIA GPU将为软件应用程序提供动力，以加速三个关键用途：管理大数据、智能推荐系统和对话式人工智能。", "note_en": "Due to the COVID-19 outbreak, GTC 2020 was shifted to an all virtual conference, and the long anticipated next generation NVIDIA Tesla GPU announcement was subsequently delayed. However today, NVIDIA CEO Jensen Huang’s keynote took the virtual stage to announce NVIDIA’s all new GPU architecture, Ampere, and the first products that will be using it. At the center of this is the new Tesla GPU, the NVIDIA A100.\n   NVIDIA Ampere  architecture — At the heart of A100 is the NVIDIA Ampere GPU architecture, which contains more than 54 billion transistors, making it the world’s largest 7-nanometer processor.\n Tensor Cores with TF32 — NVIDIA’s widely adopted Tensor Cores are now more flexible, faster and easier to use. Their expanded capabilities include new TF32 for AI (TensorFloat), which allows for up to 20x the AI performance of FP32 precision, without any code changes. In addition, Tensor Cores now support FP64, delivering up to 2.5x more compute than the previous generation for HPC applications.\n Multi-instance GPU — MIG, a new technical feature, enables a single A100 GPU to be partitioned into as many as seven separate GPUs so it can deliver varying degrees of compute for jobs of different sizes, providing optimal utilization and maximizing return on investment.\n Third-generation NVIDIA NVLink — Doubles the high-speed connectivity between GPUs to provide efficient performance scaling in a server.\n Structural sparsity — This new efficiency technique harnesses the inherently sparse nature of AI math to double performance.\n The NVIDIA A100 Tensor Core GPU delivers the next giant leap in NVIDIA’s accelerated data center platform, providing unmatched acceleration at every scale and enabling these innovators to do their life’s work within their lifetime. A100 powers numerous application areas including HPC, genomics, 5G, rendering, deep learning, data analytics, data science, and robotics.\n  NVIDIA today set out a vision for the next generation of computing that shifts the focus of the global information economy from servers to a new class of powerful, flexible data centers.\n    1) Peak rates are based on the GPU boost clock.  2) Four Tensor Cores in an A100 SM have 2x the raw FMA computational power of eight Tensor Cores in a GV100 SM.  3) Effective TOPS / TFLOPS using the new Sparsity feature.\n   AI models are exploding in complexity as they take on next-level challenges such as accurate conversational AI and deep recommender systems. Training them requires massive compute power and scalability.\n NVIDIA A100’s third-generation Tensor Cores with Tensor Float (TF32) precision provide up to 20x higher performance over the prior generation with zero code changes and an additional 2x boost with automatic mixed precision and FP16. When combined with third-generation NVIDIA® NVLink®, NVIDIA NVSwitch™, PCI Gen4, NVIDIA Mellanox InfiniBand, and the NVIDIA Magnum IO™ software SDK, it’s possible to scale to thousands of A100 GPUs. This means that large AI models like BERT can be trained in just 37 minutes on a cluster of 1,024 A100s, offering unprecedented performance and scalability.\n   A100 introduces groundbreaking new features to optimize inference workloads. It brings unprecedented versatility by accelerating a full range of precisions, from FP32 to FP16 to INT8 and all the way down to INT4. Multi-Instance GPU (MIG) technology allows multiple networks to operate simultaneously on a single A100 GPU for optimal utilization of compute resources. And structural sparsity support delivers up to 2x more performance on top of A100’s other inference performance gains.\n   To unlock next-generation discoveries, scientists look to simulations to better understand complex molecules for drug discovery, physics for potential new sources of energy, and atmospheric data to better predict and prepare for extreme weather patterns.\n A100 introduces double-precision Tensor Cores, providing the biggest milestone since the introduction of double-precision computing in GPUs for HPC. This enables researchers to reduce a 10-hour, double-precision simulation running on NVIDIA V100 Tensor Core GPUs to just four hours on A100. HPC applications can also leverage TF32 precision in A100’s Tensor Cores to achieve up to 10x higher throughput for single-precision dense matrix multiply operations.\n   NVIDIA also announced the NVIDIA DGX A100 — the world’s first 5-petaflops server.\n NVIDIA GPUs will power software applications for accelerating three critical usages: managing big data,  recommender systems and conversational AI.", "posttime": "2020-05-15 03:20:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,安培,ampere", "title": "NVIDIA安培A100：将规格与前一代GPU进行比较", "title_en": "Nvidia Ampere A100: Comparing Specs to Previous Gen GPUs", "transed": 1, "url": "https://blog.exxactcorp.com/nvidia-debuts-ampere-with-the-a100-a-game-changer-for-ai-hpc-workloads/", "via": "", "real_tags": ["nvidia", "安培", "ampere"]}, {"category": "", "categoryclass": "", "imagename": "84061656f1d5239bc41f4e8ed151f816.png", "infoid": 1002126, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年，我在基于Raspberry PI CM3L的BalenaFin硬件上评论了BalenaOS和BalenaCloud。该解决方案生成具有坞站支持的操作系统映像，以便通过Web界面或客户端程序远程轻松管理和更新设备群。\nBalena.io官方或由于社区的工作支持60多个板，但Pavel BurGR正在与DEVICE.FARM一起开发替代方案。FARM支持近100个ARM SBC，包括Raspberry Pi板，而大多数Armbian支持ARM SBC。\nDEVICE.FARM仍处于测试阶段，但该网站的MVP(最低可行产品)版本提供：\n这是有功能的，但可能会有错误，文档仍需要最终确定。我身上没有黑板，但我试着为Orange Pi Zero SBC生成一个图像。\n一旦你点击列表中的任何一块板，你将被要求使用Facebook、Google、Github或通过SSH密钥登录。\n登录后，我可以进入Linux映像配置页面，在那里我为设备命名，设置根密码(一个密码也会自动生成)，选择是否要通过以太网或/和WiFi连接，并在字段中输入接入点凭据。您还可以覆盖根文件系统中的文件。请注意，Raspberry PI依赖于Armbian无头图像上的Raspbian Buster Lite和其他SBC。单击“注册设备并构建映像”按钮进入下一步。\n生成图像需要几秒钟或几分钟的时间，然后您可以下载该图像，或者使用BalenaEtcher或其他类似的实用程序进行刷新。\n还将向您提供用于执行多个操作的CLI命令列表，包括：\n[更新：这是一个屏幕截图，显示了几个在线/离线设备，以及从互联网访问容器的服务是多么容易，因为一旦容器被贴上“farm.device.services”标签，DEVICE.FARM就会创建一个从https://&lt；service-name&gt；-&lt；device-id&gt；.device.farm格式的url到容器的HTTP代理链接。\n这是通过设备发起的VPN链路(Openconnect)实现的。并解释了为什么需要用户身份验证。这样，用户可以安全地远程访问设备，如家庭自动化系统、3D打印机的Octoprint UI或磁盘存储…]。\nJean-Luc在2010年开始了CNX Software的兼职工作，之后他辞去了软件工程经理的工作，开始撰写每日新闻，并在2011年晚些时候全职撰写评论。", "note_en": "Last year, I  reviewed BalenaOS and BalenaCloud on  Raspberry Pi CM3L based BalenaFin hardware. The solution generates OS images with docker support in order to easily manage and update a fleet of devices remotely over a web interface or client program.\n Balena.io supports  over 60 boards either officially, or thanks to the work of the community, but Pavel Burgr is developing an alternative with  DEVICE.FARM supporting close to 100 Arm SBC’s including Raspberry Pi boards, and most Armbian supported Arm SBC’s.\n  DEVICE.FARM is still beta, but the MVP (Minimum Viable Product) version of the website provides:\n  This is functional, but bugs are likely, and documentation still needs to be finalized. I don’t have a board with me, but I tried to generate an image for Orange Pi Zero SBC.\n Once you click on any of the board from the list, you’ll be asked to login with Facebook, Google, Github, or via SSH key.\n  After login, I could get to the Linux image configuration page, where I gave a name for the device, set a root password (one is also automatically generated), select whether you want to connect through Ethernet or/and WiFi with fields to enter the access point credential. You can also overwrite files from the root file system. Note that Raspberry Pi relies on Raspbian Buster Lite and other SBCs on Armbian headless images. Click on the “ Register device and build the image” button for the next step.\n It will take a few seconds or many a minute to generate the image, which you can then download, or flash with BalenaEtcher or other similar utility.\n You’ll also be provided a list of CLI commands to perform several actions including:\n  [ Update: here’s a screenshot showing several ONLINE/OFFLINE devices and how easy it is to access a container’s service from the internet since once the container is tagged with “farm.device.services” label, DEVICE.FARM creates a HTTP proxy link from URL in form https://&lt;service-name&gt;-&lt;device-id&gt;.device.farm to the container.\n  This is achieved by a VPN link (openconnect) initiated by the device. and explains why user authentication is required. This way users can securely access devices remotely such as home automation system, 3D printer’s Octoprint UI, or disk storage…]\n  Jean-Luc started CNX Software in 2010 as a part-time endeavor, before quitting his job as a software engineering manager, and starting to write daily news, and reviews full time later in 2011.", "posttime": "2020-05-15 03:06:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker,linux,设备", "title": "Device.arm为大约100个ARM Linux SBC生成Linux+Docker映像", "title_en": "Device.farm Generates Linux+Docker Images for about 100 Arm Linux SBCs", "transed": 1, "url": "https://www.cnx-software.com/2020/05/13/device-farm-generates-raspbian-armbian-docker-images-for-about-100-arm-linux-sbcs/", "via": "", "real_tags": ["docker", "linux", "设备"]}, {"category": "", "categoryclass": "", "imagename": "7655c720cbc93673844a15882ceba9df.jpg", "infoid": 1002125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的两年里，我们一直听说NVIDIA的下一代安培，但该公司终于准备好谈论它的下一代GPU架构了。虽然您今天不会听到任何有关GeForce RTX 30系列消费级游戏显卡的信息，但NVIDIA正在讨论有关机器学习数据中心和HPC市场的安培的详细信息。简而言之，这个版本的安培是NVIDIA有史以来最大、最强大的图形处理器，该公司表示，它也是世界上最大的7 nm芯片。毫无疑问，它是巨大的。据NVIDIA报道，其基于安培的A100图形处理器已经全面生产并交付给客户，该公司声称A100代表着其历史上最大的一代图形处理器性能提升。鉴于规格，我们没有理由怀疑该公司。\nA100拥有高达540亿个晶体管，这无疑使它成为世界上最大的基于7纳米技术的处理器。总共有6912个FP32 CUDA核心、432个张量核心和108个SMS。板载是40 GB的HBM2e内存，最大内存带宽为1.6TB/秒。FP32计算的TLFLOPS达到了惊人的19.5 TLFLOPS，相比之下，特斯拉V100的TFLOPS为16.4 TFLOPS。FP64计算的TFLOPS为9.7 TFLOPS，而特斯拉V100的TFLOPS为8.2 TFLOPS。此外，其张量芯采用FP32精度，可将人工智能性能提升20倍。在FP64性能方面，与其前身Volta相比，这些张量内核在高性能计算(High Performance Compute)应用方面也提供了2.5倍的性能提升。\n其他一些安培专用功能包括多实例GPU(又名MIG)，它允许将一个A100 GPU分割为最多七个独立实例。这样，就可以为多个离散的专用工作负载提供芯片的原始功率。安培还集成了第三代NVLink设计，可将多个GPU之间的互连性能提高一倍，从而提高可扩展性。\nNVIDIA创始人兼首席执行官Jensen Huang表示：“NVIDIA A100图形处理器是20倍的人工智能性能飞跃，是端到端的机器学习加速器-从数据分析到培训再到推理，”NVIDIA创始人兼首席执行官简森·黄(Jensen Huang)说。&#34；第一次可以在一个平台上加速纵向扩展和横向扩展工作负载。NVIDIA A100将同时提高吞吐量并降低数据中心的成本。“。\n这些A100图形处理器也将进入NVIDIA的第三代DGX人工智能超级计算机，具有5千万亿次的人工智能性能。周二，当詹森从他的私人家庭烤箱中拿出一台新鲜出炉的钻机时，他给了我们一个很早的DGX A100的味道。当时，他宣称它是“世界上最大的显卡，但不幸的是，它的目标职责不是游戏。\nDGX A100共有8个A100 GPU，以及320 GB内存(带宽为12.4 TB/秒)。该系统还配备了Mellanox HDR 200Gbps互连。如前所述，每个A100 GPU最多可以支持7个实例，这意味着如果板载8个GPU，DGX A100总共可以支持56个实例来攻击手头的工作负载。\n然而，NVIDIA也在考虑不仅仅是DGX A100，并宣布开发DGX SuperPod，它结合了使用前述Mellanox互连连接的140个DGX A100系统的功能。加在一起，你将看到700千万亿次的人工智能计算能力，可以用于从医学研究到帮助分析冠状病毒的任何事情，就像我们在Folding@Home项目中看到的那样。\nNVIDIA看起来在安培和A100上有了一个强劲的开端，但我们当然也期待着看到该公司为爱好者市场准备了什么。自从NVIDIA与GeForce RTX 20系列推出图灵架构以来，已经过去了18个多月，人们对GeForce RTX 30系列的期望值高得令人难以置信。", "note_en": "We&#39;ve been hearing about  NVIDIA&#39;s next-generation Ampere for the past two years, but the company is finally ready to talk about its next-generation GPU architecture. Though you won&#39;t hear any info today about  GeForce RTX 30 Series of consumer gaming graphics cards, NVIDIA is discussing details about Ampere for machine learning data center and HPC markets. In short, this version of Ampere is the biggest most powerful GPU NVIDIA has ever made, and the company offers that it&#39;s also the world&#39;s biggest 7nm chip. There&#39;s no doubt, it&#39;s massive.    According to NVIDIA, its  Ampere-based A100 GPU is already in full production and shipping to customers, and it is claiming that the A100 represents the single largest generational uplift in GPU performance in its history. Given the specs, we have no reason to doubt the company.\n   The A100 features a whopping 54 billion transistors, which definitely allows it to take the crown as the world&#39;s largest processor built on 7nm tech. There are a total of 6,912 FP32 CUDA cores, 432 Tensor cores, and 108 SMs. Onboard is 40GB of HBM2e memory with maximum memory bandwidth of 1.6TB/sec. FP32 compute comes in at a staggering 19.5 TLFLOPs, compared to 16.4 TFLOPs for Tesla V100s. FP64 compute stands at 9.7 TFLOPs, compared to 8.2 TFLOPs for Tesla V100s. In addition, its Tensor Cores employ FP32 precision that allows for a 20x uplift in AI performance. When it comes to FP64 performance, these Tensor Cores also provide a 2.5x performance boost, compared to its predecessor, Volta, with respect to  HPC (High Performance Compute) applications.\n   Some other Ampere-specific features include Multi-instance GPU, aka MIG, which allows an A100 GPU to be sliced up into up to seven discrete instances. That way, the raw power of the chip can be provisioned for multiple discrete specialized workloads. Ampere also integrates a third-generation  NVLink design, which doubles the performance of interconnect between multiple GPUs for improved scaling.\n  “NVIDIA A100 GPU is a 20x AI performance leap and an end-to-end machine learning accelerator — from data analytics to training to inference,&#34; said NVIDIA founder and CEO  Jensen Huang. &#34;For the first time, scale-up and scale-out workloads can be accelerated on one platform. NVIDIA A100 will simultaneously boost throughput and drive down the cost of data centers.”\n   Those A100 GPUs will also make their way into NVIDIA&#39;s third-generation  DGX AI supercomputer, with 5 PetaFLOPs of AI performance. Jensen gave us an  early &#34;taste&#34; of DGX A100 when he pulled a freshly-baked rig out of his personal home oven on Tuesday. At the time, he declared it to be “the world’s largest graphics card,&#34; but unfortunately its targeted duties aren&#39;t for gaming.\n  The  DGX A100 has a total of eight A100 GPUs, along with 320GB of memory (12.4TB per second in bandwidth). The system is also equipped with  Mellanox HDR 200Gbps interconnects. As we mentioned before, each A100 GPU can support up to 7 instances, which means that with 8 GPUs onboard, the DGX A100 can support a grand total of 56 instances to attack the workload at hand.\n   However, NVIDIA is also thinking  beyond just the DGX A100, and has announced the development of the DGX SuperPOD, which combines the power of 140 DGX A100 systems linked using the aforementioned Mellanox interconnects. Together, you&#39;re looking at 700 petaflops of AI compute power, which can be used for anything from medical research to helping analyze COVID-19, as we&#39;ve seen with the  Folding@Home project.\n NVIDIA looks to be getting off to a strong start with Ampere and the A100, but we&#39;re of course also looking forward to seeing what the company has in store for the enthusiast market. It&#39;s been over 18 months since NVIDIA launched its Turing architecture with the GeForce RTX 20 family, and  expectations for the GeForce RTX 30 family are incredibly high.", "posttime": "2020-05-15 02:51:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nvidia,芯片,亮相,chip", "title": "面向AI的NVIDIA安培A100图形处理器亮相，有史以来最大的7 nm芯片", "title_en": "NVIDIA Ampere A100 GPU For AI Unveiled, Largest 7nm Chip Ever Produced", "transed": 1, "url": "https://hothardware.com/news/nvidia-ampere-dgx-a100-ai-machine-learning", "via": "", "real_tags": ["nvidia", "芯片", "亮相", "chip"]}, {"category": "", "categoryclass": "", "imagename": "e113636a761397328865bd16daeb89ae.png", "infoid": 1002124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-根据一封内部电子邮件，通用汽车(GM.N)自动驾驶汽车部门Cruise周四宣布裁员约8%。\n这使其成为最新一家裁员的自动驾驶汽车技术公司，因为冠状病毒大流行已经关闭了经济，并导致资金枯竭。\n“在这个巨大变革的时代，我们很幸运有一个明确的使命和数十亿美元的银行资金。我们今天采取的行动反映出我们在工程工作和工程人才上加倍下注，“邮轮发言人米林·梅塔告诉路透社。\n根据Cruise首席执行官丹·安曼(Dan Ammann)发给员工的内部电子邮件，此次裁员包括加利福尼亚州帕达塞德纳(Padasedna)激光雷达工程团队的员工。", "note_en": "(Reuters) - General Motors Co’s (  GM.N) self-driving car unit Cruise on Thursday announced it was laying off about 8% of its staff, according to an internal e-mail.\n That makes it the latest autonomous vehicle technology firm to cut staff as the coronavirus pandemic has shut down the economy and led to funding to dry up.\n “In this time of great change, we’re fortunate to have a crystal clear mission and billions in the bank. The actions we took today reflect us doubling down on our engineering work and engineering talent,” Cruise spokesperson Milin Mehta told Reuters.\n According to the internal e-mail to staff by Cruise chief executive Dan Ammann, the layoff includes staff at a Lidar engineering team in Padasedna, California.", "posttime": "2020-05-15 02:51:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "通用汽车,自动,driving,工程", "title": "通用汽车自动驾驶技术部门Cruise裁员约8%", "title_en": "GM self-driving tech unit Cruise laying off about 8% of staff", "transed": 1, "url": "https://www.reuters.com/article/us-gm-autonomous-layoffs/gm-self-driving-tech-unit-cruise-laying-off-about-8-of-staff-idUSKBN22Q34W", "via": "", "real_tags": ["通用汽车", "自动", "driving", "工程"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "反冲起作用，并且像反应一样思考。将一些添加到您的应用程序中，并获得快速灵活的共享状态。\n在不影响代码拆分的情况下，通过观察整个应用程序的所有状态更改来实施持久性、路由、时间旅行调试或撤消。", "note_en": "Recoil works and thinks like React. Add some to your app and get fast and flexible shared state.\n  Implement persistence, routing, time-travel debugging, or undo by observing all state changes across your app, without impairing code-splitting.", "posttime": "2020-05-15 02:08:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "反应,state,作用", "title": "反冲--一个用于反应的状态管理库", "title_en": "Recoil – A state management library for React", "transed": 1, "url": "https://recoiljs.org/", "via": "", "real_tags": ["反应", "state", "作用"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002122, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索0的0次方，用0 0表示，这是一个没有达成一致的值的数学表达式。最常见的可能性是1或不定义表达式，根据上下文，每个表达式都有理由。在代数和组合学中，通常商定的值是0 0=1，而在数学分析中，表达式有时不定义。计算机程序也有不同的方式来处理这个表达式。\n有许多广泛使用的公式，其术语涉及自然数指数，要求0 0求值为1。例如，将b0视为空积，即使当b=0时，也会为其赋值1。或者，b0的组合解释是具有b个元素的集合中元素的空元组的数目；即使b=0，也恰好有一个空元组。等价地，0 0的集合论解释是从空集到空集的函数的个数；这样的函数恰好只有一个，即空函数。[1]。\n同样，在使用多项式时，将0定义为值为1也很方便。多项式是以下形式的表达式：a 0 x 0+⋯+a n x n{\\displaystyle a_{0}x^{0}+\\cdots+a_{n}x^{n}}其中x是不确定的，系数a{\\displaystyle a_{n}}是实数(或者，更一般地，某些环的元素)。x中所有实多项式的集合由R[x]{\\displaystyle\\mathbb{R}[x]}表示。多项式按项相加，然后乘以不定x中指数的通常规则(参见柯西乘积)。有了这些操作的代数规则，多项式就形成了多项式环。多项式x0{\\displaystyle x^{0}}是多项式环的单位元，这意味着它是使得x0{\\displaystyle x^{0}}与任何多项式p(X){\\displaystyle p(X)}的乘积仅为p(X){\\displaystyle p(X)}的(唯一)元。[2]多项式可以通过将不定x专门化为实数来计算。更准确地说，对于任何给定的实数x 0{\\displayStyle x_{0}}，存在唯一的单位环同态Ev x 0：R[x]→R{\\DisplayStyle\\OperatorName{ev}_{x_{0}}：\\mathbb{R}[x]\\to\\mathbb{R}}使得ev x 0。⁡(X 1)=x 0{\\DisplayStyle\\OperatorName{ev}_{x_{0}}(x^{1})=x_{0}}。[3]这称为赋值同态。因为它是一个单位同态，所以我们有ev x 0⁡(X 0)=1.{\\DisplayStyle\\OperatorName{ev}_{x_{0}}(x^{0})=1。}也就是说，对于x到实数(包括零)的所有特化，x0=1{\\displaystyle x^{0}=1}。\n这一观点对于组合学中出现的许多多项式恒等式是有意义的。例如，二项式定理(1+x)n=∑k=0n(Nk)xk{\\displaystyle(1+x)^{n}=\\sum_{k=0}^{n}{\\binom{n}{k}}x^{k}}对于x=0无效，除非0=1。[4]类似地，幂级数环要求x 0=1{\\displaystyle x^{0}=1}对于x的所有特殊化都为真。因此，像1 1−x=∑n=0∞x n{\\displaystyle{\\frac{1}{1-x}}=\\sum_{n=0}^{\\infty}x^{n}}和e这样的恒等式。x=∑n=0∞x n n！{\\DisplayStyle e^{x}=\\sum_{n=0}^{\\infty}{\\frac{x^{n}}{n！}}仅当0=1时，函数恒等式(包括x=0处)才为真。\n在微积分中，幂规则ddxxn=nxndisplaystyle 1{\\−{\\frac{d}{dx}}x^{n}=nx^{n-1}对于x=0的n=1是无效的，除非0 0=1。\n涉及代数运算的极限通常可以通过将子表达式替换为它们的极限来计算；如果结果表达式不确定原始极限，则该表达式称为不确定形式。[5]实际上，当f(T)和g(T)都是逼近0的实值函数(当t逼近实数或±∞)时，对于f(T)和gt；0，函数f(T)g(T)不必逼近1；取决于f和g，f(T)g(T)的极限可以是任何非负实数或+∞，也可以发散。例如，下面的函数形式为f(T)g(T)，其中f(T)，g(T)→0 as t→0+(单边限制)，但是限制是不同的：\nLIM t→0+t t=1，LIM t→0+(e−1 t 2)t=0，LIM T→0+\n在复数域中，可以通过选择logz的分支并将zw定义为e w logz来为非零z定义函数zw。这不定义0w，因为在z=0处没有定义logz的分支，更不用说在0的邻域中了。[10][11][12]。\n关于0 0{\\displaystyle 0^{0}}的定义的争论至少从19世纪初就开始了。当时，大多数数学家都同意0 0=1{\\displaystyle 0^{0}=1}，直到1821年柯西[13]将0 0{\\displaystyle 0^{0}}以及像0 0{\\displaystyle\\textstyle{\\frac{0}{0}这样的表达式一起列在一个不确定形式的表中。在19世纪30年代，Guglielmo Libri Carucci Carucci Dalla SomMaja[14][15]发表了一个关于0 0=1{\\displaystyle 0^{0}=1}的不令人信服的论点，而莫比乌斯[16]站在他一边，错误地声称LIM t→0+f(T)g(T)=1{\\DisplayStyle\\TextStyle\\LIM_{t\\to 0^{+}}f(T)^{g(T)}\\；=\\；1}每当LIM t→0+f(T)=LIM t→0+g(T)=0{\\DisplayStyle\\TextStyle\\LIM_{t\\to 0^{+}}f(T)\\；=\\；\\LIM_{t\\to 0^{+}}g(T)\\；=\\；0}。一位署名为&#34；S&34；的评论员提供了(e−1/t)t{\\displaystyle\\textstyle(e^{-1/t})^{t}}的反例，这让辩论平息了一段时间。更多的历史细节可以在Knuth(1992)中找到。[17]。\n有些人认为0 0{\\displaystyle 0^{0}}的最佳值取决于上下文，因此一次性定义它是有问题的。[18]根据Benson(1999)，&#34；是否定义0 0{\\displaystyle 0^{0}}的选择是基于便利性，而不是正确性。如果我们不定义0 0{\\displaystyle 0^{0}}，那么某些断言就会变得不必要地笨拙。[.]。共识是使用定义0 0=1{\\displaystyle 0^{0}=1}，尽管有些教科书没有定义0 0{\\displaystyle 0^{0}}。&#34；[19]。\n也有人认为0 0{\\displaystyle 0^{0}}应该定义为1。Knuth(1992)强烈主张0{\\displaystyle 0^{0}}&#34；必须是1&#34；在值0 0{\\DisplayStyle 0^{0}}和极限形式0{\\DisplayStyle 0^{0}}(f(X)g(X){\\DisplayStyle\\textStyle f(X)^{g(X)}}的缩写)之间画出区别，其中f(X)，g(X)→0{\\DisplayStyle\\TextStyle f(X)，g(X)\\to 0})，它必须是Cauchy：&#34所列出的不确定形式；柯西和Libri都是对的，但是Libri和他的捍卫者不明白为什么真理站在他们这边。&#34；[17]沃恩给出了其他几个定理的例子，这些定理的(最简单的)表述需要0 0=1作为约定。[20]。\n大多数浮点库的设计都使用IEEE754-2008浮点标准。它推荐了一些计算幂的操作：[21]。\nPOW将0 0视为1。如果幂是精确整数，则结果与POWN相同，否则，结果与POWR相同(除某些例外情况外)。\nPOWN将0 0视为1。幂必须是精确整数。该值是针对负基定义的；例如，POWN(−3，5)是−243。\nPOWR将0视为NaN(非数字未定义)。对于POWR(−3，2)这样基数小于零的情况，该值也是NaN。该值由e次方×log(基)定义。\nPOWER变体的灵感来自C99的POW函数，主要是为了兼容。[22]它主要用于具有单一幂函数的语言。POWN和POWR变体的引入是由于POWER函数的使用冲突和不同的观点(如上所述)。[23]。\nC和C++标准没有指定0 0的结果(可能会发生域错误)，但从C99开始，如果支持标准附件F，则结果需要为1，因为对于某些重要的应用程序，此值比NaN[24]更有用(例如，使用离散指数)。Java标准、[25].NET框架方法System.Math.Pow[26]和Python[27][28]也将0视为1。一些语言记录了它们的求幂运算对应于C数学库中的幂函数；Lua[29]和Perl的**运算符[30]就是这种情况(其中明确提到0**0的结果与平台相关)。\nSageMath将b0简化为1，即使没有对b施加约束。它将0 0简化为1，但不会简化其他x的0 x。[需要引用]。\n枫叶区分整数0，1，.。以及相应的浮点数0.0，1.0，.。(通常表示为0.，1.，.)。如果x的计算结果不是数字，则x 0和x 0.0的计算结果分别为1(整数)和1.0(浮点数)；另一方面，0 x的计算结果为整数0，而0.0 x的计算结果为0。如果基数和指数都为零(或求值为零)，则如果指数为浮点数0.0，则结果为浮点型(未定义)；以整数为指数时，0 0的求值结果为整数1，而0的求值结果为0。0表示浮点数为1.0。[需要引用]。\n即使没有对b施加约束，Macsyma也会将b 0简化为1，但会发出0 0的错误。对于x&gt；0，它将0 x简化为0。[需要引用]。\nMATHEMICAL将整数区分为精确数字，将浮点数区分为近似数字。它将b0简化为1，即使没有对b施加约束，也不会简化0x，并且将00简化为&#34；不确定&#34；。[31][31]。\nPARI/GP还区分整数和浮点类型：当指数0是整数类型时，表达式(如0^0或0.^0)被简化为1。[32]当指数不是整数类型时，PARI/GP将x^n视为超越函数e n⁡x{\\displaystyle e^{n\\log x}}，因此0^0。生成域错误。[33][33]。\nStata将0 0{\\displaystyle 0^{0}}评估为1{\\displaystyle 1}，但官方文档中没有对此行为的引用。\n尼古拉斯·布尔贝基(1970)。阿尔热布雷。斯普林格。，§III.2 No.9：&#34；L&#39；Unique Monôme de Degré0 Est l&#39；élément Unitéde A[(Xi)i∈i]{\\displaystyle A[(X_{i})_{i\\in i}]}}；在l&#39；身份证明文件上。\n一些教科书没有定义数量0，因为当x减小到0时，函数x0和0x有不同的极限值。但这是个错误。如果二项式定理在x=0，y=0和/或x=−y时有效，我们必须对所有x定义x0=1。二项式定理太重要了，不能被任意限制！相比之下，函数0x非常不重要&#34；。罗纳德·格雷厄姆；唐纳德·努斯；奥伦·帕塔什尼克(1989-01-05)。&#34；二项式系数&#34；。“具体数学”(第一版)。“艾迪森·韦斯利·朗曼出版公司”，第162页。ISBN电话：0-201-14236-8。\n马利克，南卡罗来纳州；阿罗拉，萨维塔(1992)。数学分析。纽约：威利。第223页。ISBN电话：978-81-224-0323-7。通常，在两个函数的极限都存在的情况下，当x=a时，φ(X)/ψ(X)的极限等于分子除以分母的极限。但是，当两个限制都为零时会发生什么呢？然后除法(0/0)变得没有意义。像这样的情况被称为不确定形式。其他这样的形式是∞/∞、0×∞，∞−∞、0 0、1∞和∞0。\n^L.J.Paige(1954年3月)。关于不定形式的注记&#34；。“美国数学月刊”。61(3)：189-190。10.2307/2307224。联合包裹服务公司股价上涨2307224。\n路易·M·罗坦多；亨利·科恩(1977)。不定式0 0&#34；。数学杂志。美国数学协会。50(1)：41-42。10.2307/2689754。联合包裹服务公司股价上涨2689754。\n李普金，伦纳德·J(2003)。&#34；在不确定形式0&#34；上。“大学数学杂志”。美国数学协会。34(1)：55-56。10.2307/3595845。联合包裹服务公司股价上涨3595845。\n^&#34；由于log(0)不存在，0 z未定义。对于Re(Z)&gt；0，我们将其任意定义为0。乔治·F·卡里尔、马克斯·克鲁克和卡尔·E·皮尔森，《复变量的函数：理论与技术》，2005年，第15页ISBN：0-89871-595-4。\n对于z=0，w≠0，我们定义0 w=0，而0 0没有定义。&#34；Mario Gonzalez，经典复变分析，Chapman&Amp；Hall，1991年，第2.56页。ISBN电话：0-8247-8415-4\n^&#34；.。让我们从x=0开始。这里x x是未定义的。&#34；Mark D.Meyerson，The x x Spindle，数学杂志69，第3期(1996年6月)，198-206页。DOI：10.1080/0025570X.1996.11996428。\n奥古斯丁-路易斯·柯西，课程分析l&#39；皇家理工学院(1821)。在他的全部作品Comlètes中，系列2，卷3。\n“纪尧姆·库斯利”，“功能与价值笔记”0x，“数学与数学学报”6(1830)，67-72页。\n“纪尧姆·库利”，Mémoire sur les Functions DisContinuations，“数学与数学学报”10(1833)，303-316页。\n^A.F.Möbius(1834年)。Beweis der Gleichung 0 0=1，nach J.F.Pfaff&#34；[根据J.F.Pfaff证明等式0=1]。Für die reine and Angewandte Mahematik杂志。12：134-136。\n^a b Donald E.Knuth，关于符号的两个注解，AMER。数学课。月刊99第5期(1992年5月)，第403-422号(arxiv：MATH/9205211)。\n例子包括爱德华兹和佩妮(1994)。微积分，第4版，Prentice-Hall，第466页，以及Kedy，Bittinger和Smith(1982)。代数二。Addison-Wesley，第32页。\n^唐纳德·C·本森(Donald C.Benson)，证明的时刻：数学顿悟。纽约牛津大学出版社(英国)，1999年。ISBN978-0-19-511721-9\n穆勒，让-米歇尔；布里斯巴尔，尼古拉；德迪内钦，佛罗伦萨；让内罗德，克劳德-皮埃尔；勒菲弗，文森特；梅尔奎德，纪尧姆；雷沃尔，纳塔利；斯特莱，达米安；托雷斯，塞尔日(2010)。“浮点算术手册”(第1版)。Birkhäuser.。第216页。电话：10.1007/978-0-81764705-6.。ISBN电话：978-0-8176-4704-9。LCCN上涨2009939668。ISBN电话：978-0-8176-4705-6(在线)，ISBN电话：0-8176-4704-X(打印)。\n^#34；更超前的问题。grouper.ieee.org。从原件存档于2017-11-14。(关于IEEE754标准修订的幂函数的讨论，2007年5月开始。)。\n^#34；Re：模糊的规格。grouper.ieee.org。从原件存档于2017-11-14。(关于IEEE754标准修订的幂函数的讨论中的变体建议，2007年5月。)。\n？国际标准的基本原理-编程语言-C(PDF)(报告)。修订版5.10。2003年4月。第182页。\n^&#34；内置类型-Python 3.8.1文档&#34；。Python将power(0，0)和0**0定义为1，这在编程语言中很常见。\n^&#34；数学-数学函数-Python 3.8.1文档&#34；。例外情况尽可能遵循C99标准的附件‘F’。具体地说，即使当x是零或NaN时，POW(1.0，x)和POW(x，0.0)也总是返回1.0。\n^Pari Group(2018年)。&#34；用户&#39；PAI/GP指南(版本2.11.0)&#34；(PDF)。第10页，122页。当指数是整数类型时，还有指数运算符^；否则，它被认为是超越函数。[.]。如果指数n是整数，则使用二进制(左移)幂技术执行精确运算。[.]。如果指数n不是整数，则幂函数被视为超越函数exp(Nlogx)。\n^&#34；语言参考指南&#34；。如果Y为零，则R被定义为1。\n^R核心团队(2019-07-05)。R：统计计算的语言和环境-参考索引(PDF)。版本3.6.1。23号页。1^y和y^0始终为1。", "note_en": "Jump to navigation  Jump to search  Zero to the power of zero, denoted by  0 0, is a  mathematical expression with no agreed-upon  value. The most common possibilities are  1 or leaving the expression undefined, with justifications existing for each, depending on context.In  algebra and  combinatorics, the generally agreed upon value is  0 0 = 1, whereas in  mathematical analysis, the expression is sometimes left undefined.  Computer programs also have differing ways of handling this expression.\n   There are many widely used formulas having terms involving  natural-number exponents that require  0 0 to be evaluated to  1. For example, regarding   b 0 as an  empty product assigns it the value  1, even when   b = 0. Alternatively, the  combinatorial interpretation of   b 0 is the number of  empty tuples of elements from a set with   b elements; there is exactly one empty tuple, even if   b = 0. Equivalently, the  set-theoretic interpretation of  0 0 is the number of functions from the empty set to the empty set; there is exactly one such function, the  empty function.  [1]\n  Likewise, when working with  polynomials, it is convenient to define  0 0 as having the value 1. A polynomial is an expression of the form              a    0      x    0    +  ⋯  +    a    n      x    n      {\\displaystyle a_{0}x^{0}+\\cdots +a_{n}x^{n}}   where   x is an indeterminate, and the coefficients              a    n      {\\displaystyle a_{n}}   are real numbers (or, more generally, elements of some  ring). The set of all real polynomials in   x is denoted by              R   [  x  ]    {\\displaystyle \\mathbb {R} [x]}  . Polynomials are added termwise, and multiplied by the applying the usual rules for exponents in the indeterminate   x (see  Cauchy product). With these algebraic rules for manipulation, polynomials form a  polynomial ring. The polynomial              x    0      {\\displaystyle x^{0}}   is the  identity element of the polynomial ring, meaning that it is the (unique) element such that the product of              x    0      {\\displaystyle x^{0}}   with any polynomial            p  (  x  )    {\\displaystyle p(x)}   is just            p  (  x  )    {\\displaystyle p(x)}  .  [2] Polynomials can be evaluated by specializing the indeterminate   x to be a real number. More precisely, for any given real number              x    0      {\\displaystyle x_{0}}   there is a unique unital  ring homomorphism              ev      x    0      :    R   [  x  ]  →    R     {\\displaystyle \\operatorname {ev} _{x_{0}}:\\mathbb {R} [x]\\to \\mathbb {R} }   such that              ev      x    0      ⁡  (    x    1    )  =    x    0      {\\displaystyle \\operatorname {ev} _{x_{0}}(x^{1})=x_{0}}  .  [3] This is called the  evaluation homomorphism. Because it is a unital homomorphism, we have              ev      x    0      ⁡  (    x    0    )  =  1.    {\\displaystyle \\operatorname {ev} _{x_{0}}(x^{0})=1.}   That is,              x    0    =  1    {\\displaystyle x^{0}=1}   for all specializations of   x to a real number (including zero).\n This perspective is significant for many polynomial identities appearing in combinatorics. For example, the  binomial theorem            (  1  +  x    )    n    =    ∑    k  =  0     n          (     n  k     )       x    k      {\\displaystyle (1+x)^{n}=\\sum _{k=0}^{n}{\\binom {n}{k}}x^{k}}   is not valid for   x = 0 unless  0 0 = 1.  [4] Similarly, rings of  power series require              x    0    =  1    {\\displaystyle x^{0}=1}   to be true for all specializations of   x. Thus identities like                1    1  −  x     =    ∑    n  =  0     ∞      x    n      {\\displaystyle {\\frac {1}{1-x}}=\\sum _{n=0}^{\\infty }x^{n}}   and              e    x    =    ∑    n  =  0     ∞          x    n      n  !       {\\displaystyle e^{x}=\\sum _{n=0}^{\\infty }{\\frac {x^{n}}{n!}}}   are only true as functional identities (including at   x = 0) if  0 0 = 1.\n In  differential calculus, the  power rule                d    d  x       x    n    =  n    x    n  −  1      {\\displaystyle {\\frac {d}{dx}}x^{n}=nx^{n-1}}   is not valid for   n = 1 at   x = 0 unless  0 0 = 1.\n   Limits involving algebraic operations can often be evaluated by replacing subexpressions by their limits; if the resulting expression does not determine the original limit, the expression is known as an  indeterminate form.  [5] In fact, when   f( t) and   g( t) are real-valued functions both approaching  0 (as   t approaches a real number or  ±∞), with   f( t) &gt; 0, the function   f( t)  g( t) need not approach  1; depending on   f and   g, the limit of   f( t)  g( t) can be any non-negative real number or  +∞, or it can  diverge. For example, the functions below are of the form   f( t)  g( t) with   f( t),  g( t) → 0 as   t → 0 + (a  one-sided limit), but the limits are different:\n lim    t  →    0    +          t     t    =  1  ,      lim    t  →    0    +          (    e    −      1    t    2        )     t    =  0  ,      lim    t  →    0    +          (    e    −      1    t    2        )     −  t    =  +  ∞  ,      lim    t  →    0    +          (    e    −      1  t      )     a  t    =    e    −  a      {\\displaystyle \\lim _{t\\to 0^{+}}{t}^{t}=1,\\quad \\lim _{t\\to 0^{+}}\\left(e^{-{\\frac {1}{t^{2}}}}\\right)^{t}=0,\\quad \\lim _{t\\to 0^{+}}\\left(e^{-{\\frac {1}{t^{2}}}}\\right)^{-t}=+\\infty ,\\quad \\lim _{t\\to 0^{+}}\\left(e^{-{\\frac {1}{t}}}\\right)^{at}=e^{-a}}  .\n Thus, the two-variable function   x  y, though continuous on the set  {( x,  y) :  x &gt; 0},  cannot be extended to a  continuous function on            {  (  x  ,  y  )  :  x  &gt;  0  }  ∪  {  (  0  ,  0  )  }    {\\displaystyle \\{(x,y):x&gt;0\\}\\cup \\{(0,0)\\}}  , no matter how one chooses to define  0 0.  [6] However, under certain conditions, such as when   f and   g are both  analytic functions and   f is positive on the open interval  (0,  b) for some positive   b, the limit approaching from the right is always  1.  [7]  [8]  [9]\n  In the  complex domain, the function   z   w may be defined for nonzero   z by choosing a  branch of  log  z and defining   z   w as   e   w log  z. This does not define  0  w since there is no branch of  log  z defined at   z = 0, let alone in a neighborhood of  0.  [10]  [11]  [12]\n  The debate over the definition of              0    0      {\\displaystyle 0^{0}}   has been going on at least since the early 19th century. At that time, most mathematicians agreed that              0    0    =  1    {\\displaystyle 0^{0}=1}  , until in 1821  Cauchy  [13] listed              0    0      {\\displaystyle 0^{0}}   along with expressions like                  0  0       {\\displaystyle \\textstyle {\\frac {0}{0}}}   in a  table of indeterminate forms. In the 1830s  Guglielmo Libri Carucci dalla Sommaja  [14]  [15] published an unconvincing argument for              0    0    =  1    {\\displaystyle 0^{0}=1}  , and  Möbius  [16] sided with him, erroneously claiming that                lim    t  →    0    +      f  (  t    )    g  (  t  )      =    1     {\\displaystyle \\textstyle \\lim _{t\\to 0^{+}}f(t)^{g(t)}\\;=\\;1}   whenever                lim    t  →    0    +      f  (  t  )    =      lim    t  →    0    +      g  (  t  )    =    0     {\\displaystyle \\textstyle \\lim _{t\\to 0^{+}}f(t)\\;=\\;\\lim _{t\\to 0^{+}}g(t)\\;=\\;0}  . A commentator who signed his name simply as &#34;S&#34; provided the counterexample of              (    e    −  1    /   t      )    t       {\\displaystyle \\textstyle (e^{-1/t})^{t}}  , and this quieted the debate for some time. More historical details can be found in Knuth (1992).  [17]\n  Some argue that the best value for              0    0      {\\displaystyle 0^{0}}   depends on context, and hence that  defining it once and for all is problematic.  [18] According to Benson (1999), &#34;The choice whether to define              0    0      {\\displaystyle 0^{0}}   is based on convenience, not on correctness. If we refrain from defining              0    0      {\\displaystyle 0^{0}}  , then certain assertions become unnecessarily awkward. [...] The consensus is to use the definition              0    0    =  1    {\\displaystyle 0^{0}=1}  , although there are textbooks that refrain from defining               0    0      {\\displaystyle 0^{0}}  .&#34;  [19]\n Others argue that              0    0      {\\displaystyle 0^{0}}   should be defined as 1.  Knuth (1992) contends strongly that              0    0      {\\displaystyle 0^{0}}   &#34; has to be 1&#34;, drawing a distinction between the  value              0    0      {\\displaystyle 0^{0}}  , which should equal 1 as advocated by Libri, and the  limiting form              0    0      {\\displaystyle 0^{0}}   (an abbreviation for a limit of              f  (  x    )    g  (  x  )       {\\displaystyle \\textstyle f(x)^{g(x)}}   where              f  (  x  )  ,  g  (  x  )  →  0     {\\displaystyle \\textstyle f(x),g(x)\\to 0}  ), which is necessarily an indeterminate form as listed by Cauchy: &#34;Both Cauchy and Libri were right, but Libri and his defenders did not understand why truth was on their side.&#34;  [17] Vaughn gives several other examples of theorems whose (simplest) statements require 0 0 = 1 as a convention.  [20]\n   The  IEEE 754-2008 floating-point standard is used in the design of most floating-point libraries. It recommends a number of operations for computing a power:  [21]\n pow treats 0 0 as 1. If the power is an exact integer the result is the same as for  pown, otherwise the result is as for  powr (except for some exceptional cases).\n pown treats 0 0 as 1. The power must be an exact integer. The value is defined for negative bases; e.g.,  pown(−3,5) is −243.\n powr treats 0 0 as  NaN (Not-a-Number – undefined). The value is also NaN for cases like  powr(−3,2) where the base is less than zero. The value is defined by  e power×log(base).\n The  pow variant is inspired by the  pow function from  C99, mainly for compatibility.  [22] It is useful mostly for languages with a single power function. The  pown and  powr variants have been introduced due to conflicting usage of the power functions and the different points of view (as stated above).  [23]\n  The C and C++ standards do not specify the result of 0 0 (a domain error may occur), but as of  C99, if the  normative annex F is supported, the result is required to be 1 because there are significant applications for which this value is more useful than  NaN  [24] (for instance, with  discrete exponents). The  Java standard,  [25] the  .NET Framework  method  System.Math.Pow,  [26] and  Python  [27]  [28] also treat 0 0 as 1. Some languages document that their exponentiation operation corresponds to the  pow function from the  C mathematical library; this is the case of  Lua  [29] and  Perl&#39;s  ** operator  [30] (where it is explicitly mentioned that the result of  0**0 is platform-dependent).\n  SageMath simplifies  b 0 to 1, even if no constraints are placed on  b. It takes 0 0 to be 1, but does not simplify 0  x for other  x. [   citation needed]\n Maple distinguishes between  integers 0, 1, ... and the corresponding   floats 0.0, 1.0, ... (usually denoted 0., 1., ...). If  x does not evaluate to a number, then  x 0 and  x 0.0 are respectively evaluated to 1 ( integer) and 1.0 ( float); on the other hand, 0  x is evaluated to the integer 0, while 0.0  x is evaluated as 0.  x. If both the base and the exponent are zero (or are evaluated to zero), the result is  Float(undefined) if the exponent is the  float 0.0; with an integer as exponent, the evaluation of 0 0 results in the  integer 1, while that of 0. 0 results in the  float 1.0. [   citation needed]\n Macsyma also simplifies  b 0 to 1 even if no constraints are placed on  b, but issues an error for 0 0. For  x &gt; 0, it simplifies 0  x to 0. [   citation needed]\n Mathematica distinguishes between integers as exact, and floating point numbers as approximate. It simplifies  b 0 to 1, even if no constraints are placed on  b, does not simplify 0  x, and takes 0 0 to be &#34;Indeterminate&#34;.  [31]\n PARI/GP also distinguishes between integer and floating-point types: When the exponent 0 is of integer type, the expression, such as 0^0 or 0.^0, is simplified to 1.  [32] When the exponent is not of integer type, PARI/GP treats  x^ n as the transcendental function              e    n  log  ⁡  x      {\\displaystyle e^{n\\log x}}  , so that 0^0. yields a domain error.  [33]\n    Stata evaluates              0    0      {\\displaystyle 0^{0}}   as            1    {\\displaystyle 1}   but no reference to this behaviour appears in the official documentation.\n  ^    Nicolas Bourbaki (1970).  Algèbre. Springer. , §III.2 No. 9: &#34;L&#39;unique monôme de degré 0 est l&#39;élément unité de            A  [  (    X    i      )    i  ∈  I    ]    {\\displaystyle A[(X_{i})_{i\\in I}]}  ; on l&#39;identifie souvent à l&#39;élément unité 1 de   A&#34;.\n  ^  &#34;Some textbooks leave the quantity  0 0 undefined, because the functions   x 0 and  0  x have different limiting values when   x decreases to 0. But this is a mistake. We must define   x 0 = 1, for all   x, if the binomial theorem is to be valid when   x = 0,   y = 0, and/or   x = − y. The binomial theorem is too important to be arbitrarily restricted! By contrast, the function  0  x is quite unimportant&#34;.  Ronald Graham;  Donald Knuth;  Oren Patashnik (1989-01-05). &#34;Binomial coefficients&#34;.   Concrete Mathematics (1st ed.). Addison Wesley Longman Publishing Co. p. 162.  ISBN   0-201-14236-8.\n ^   Malik, S. C.; Arora, Savita (1992).  Mathematical Analysis. New York: Wiley. p. 223.  ISBN   978-81-224-0323-7.  In general the limit of   φ( x)/ ψ( x) when   x =  a in case the limits of both the functions exist is equal to the limit of the numerator divided by the denominator. But what happens when both limits are zero? The division ( 0/0) then becomes meaningless. A case like this is known as an indeterminate form. Other such forms are  ∞/∞,  0 × ∞,  ∞ − ∞,  0 0,  1 ∞ and  ∞ 0.\n ^   L. J. Paige (March 1954). &#34;A note on indeterminate forms&#34;.  American Mathematical Monthly.  61 (3): 189–190.  doi: 10.2307/2307224.  JSTOR  2307224.\n  ^   Rotando, Louis M.; Korn, Henry (1977). &#34;The Indeterminate Form  0 0&#34;.   Mathematics Magazine.  Mathematical Association of America.  50 (1): 41–42.  doi: 10.2307/2689754.  JSTOR  2689754.\n ^   Lipkin, Leonard J. (2003). &#34;On the Indeterminate Form  0 0&#34;.   The College Mathematics Journal.  Mathematical Association of America.  34 (1): 55–56.  doi: 10.2307/3595845.  JSTOR  3595845.\n ^  &#34;Since  log(0) does not exist,  0  z is undefined. For  Re( z) &gt; 0, we define it arbitrarily as  0.&#34; George F. Carrier, Max Krook and Carl E. Pearson,  Functions of a Complex Variable: Theory and Technique, 2005, p. 15   ISBN  0-89871-595-4\n ^  &#34;For   z = 0,   w ≠ 0, we define  0  w = 0, while  0 0 is not defined.&#34; Mario Gonzalez,  Classical Complex Analysis, Chapman &amp; Hall, 1991, p. 56.   ISBN  0-8247-8415-4\n ^  &#34;... Let&#39;s start at   x = 0. Here   x  x is undefined.&#34; Mark D. Meyerson, The   x  x Spindle,  Mathematics Magazine  69, no. 3 (June 1996), 198-206.  doi: 10.1080/0025570X.1996.11996428\n ^  Augustin-Louis Cauchy,  Cours d&#39;Analyse de l&#39;École Royale Polytechnique (1821). In his  Oeuvres Complètes, series 2, volume 3.\n ^  Guillaume Libri, Note sur les valeurs de la fonction 0 0 x,   Journal für die reine und angewandte Mathematik  6 (1830), 67–72.\n ^  Guillaume Libri, Mémoire sur les fonctions discontinues,  Journal für die reine und angewandte Mathematik  10 (1833), 303–316.\n ^   A. F. Möbius (1834).  &#34;Beweis der Gleichung 0 0 = 1, nach J. F. Pfaff&#34; [Proof of the equation 0 0 = 1, according to J. F. Pfaff].  Journal für die reine und angewandte Mathematik.  12: 134–136.\n ^     a     b  Donald E. Knuth, Two notes on notation,   Amer. Math. Monthly  99 no. 5 (May 1992), 403–422 ( arXiv: math/9205211).\n ^  Examples include Edwards and Penny (1994).  Calculus, 4th ed, Prentice-Hall, p. 466, and Keedy, Bittinger, and Smith (1982).  Algebra Two. Addison-Wesley, p. 32.\n ^  Donald C. Benson,  The Moment of Proof : Mathematical Epiphanies. New York Oxford University Press (UK), 1999.   ISBN  978-0-19-511721-9\n  ^   Muller, Jean-Michel; Brisebarre, Nicolas; de Dinechin, Florent; Jeannerod, Claude-Pierre; Lefèvre, Vincent; Melquiond, Guillaume; Revol, Nathalie; Stehlé, Damien; Torres, Serge (2010).   Handbook of Floating-Point Arithmetic (1 ed.).  Birkhäuser. p. 216.  doi: 10.1007/978-0-8176-4705-6.  ISBN   978-0-8176-4704-9.  LCCN  2009939668.     ISBN  978-0-8176-4705-6 (online),   ISBN  0-8176-4704-X (print)\n ^    &#34;More transcendental questions&#34;.  grouper.ieee.org. Archived from  the original on 2017-11-14 .   (Beginning of the discussion about the power functions for the revision of the IEEE 754 standard, May 2007.)\n ^    &#34;Re: A vague specification&#34;.  grouper.ieee.org. Archived from  the original on 2017-11-14 .   (Suggestion of variants in the discussion about the power functions for the revision of the IEEE 754 standard, May 2007.)\n ^    Rationale for International Standard—Programming Languages—C  (PDF) (Report). Revision 5.10. April 2003. p. 182.\n   ^    &#34;Built-in Types — Python 3.8.1 documentation&#34; .  Python defines pow(0, 0) and 0 ** 0 to be 1, as is common for programming languages.\n ^    &#34;math — Mathematical functions — Python 3.8.1 documentation&#34; .  Exceptional cases follow Annex ‘F’ of the C99 standard as far as possible. In particular, pow(1.0, x) and pow(x, 0.0) always return 1.0, even when x is a zero or a NaN.\n     ^   The PARI Group (2018).  &#34;Users&#39; Guide to PARI/GP (version 2.11.0)&#34;  (PDF). pp. 10, 122 .  There is also the exponentiation operator ^, when the exponent is of type integer; otherwise, it is considered as a transcendental function. [...] If the exponent  n is an integer, then exact operations are performed using binary (left-shift) powering techniques. [...] If the exponent  n is not an integer, powering is treated as the transcendental function exp( n log  x).\n ^    &#34;Language Reference Guide&#34;. Dyalog Ltd.  If  Y is zero,  R is defined to be 1.\n  ^   The R Core Team (2019-07-05).  &#34;R: A Language and Environment for Statistical Computing – Reference Index&#34;  (PDF). Version 3.6.1. p. 23 .  1 ^ y and y ^ 0 are 1, always.", "posttime": "2020-05-15 02:07:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "power,displaystyle", "title": "零的零次方", "title_en": "Zero to the Power of Zero", "transed": 1, "url": "https://en.wikipedia.org/wiki/Zero_to_the_power_of_zero", "via": "", "real_tags": ["power"]}]