[{"category": "", "categoryclass": "", "imagename": "f50c94725b7e70c7796f2a1bb610efe4.png", "infoid": 1068458, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lyra版本0.0.2现已在GitHub上提供。 此版本的主要改进是Sparse_Matmul库代码的开源发布，该库代码由Google和DeepMind共同开发。 这意味着没有更多预编译的“.so”动态库二进制文件，并且没有更多限制工具链的使用，从而为港口Lyra开辟了不同的平台。 功能和修复的完整列表包括：  添加对Linux上的Bazel默认GCC Toolchain的支持，并使此默认代替Clang Toolchain。 ", "note_en": "Lyra version 0.0.2 is now available on  GitHub. The main improvement of this version is the open-source release of the sparse_matmul library code, which was co-developed by Google and DeepMind. That means no more pre-compiled “.so” dynamic library binaries and no more restrictions on which toolchain to use, which opens up the door to port Lyra onto different platforms. The full list of features and fixes include:\n Add support for the Bazel default gcc toolchain on linux, and make this the default instead of the clang toolchain.", "posttime": "2021-06-29 22:38:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,lyra", "title": "谷歌的Lyra语音编解码器现在是完全开放的 ", "title_en": "Google's Lyra speech codec is now fully open-source", "transed": 1, "url": "https://github.com/google/lyra/releases/tag/v0.0.2", "via": "", "real_tags": ["google", "谷歌", "lyra"]}, {"category": "", "categoryclass": "", "imagename": "d023864eb4742061dac9614e308f4050.jpg", "infoid": 1068457, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，Google将在其顶级新闻旋转木马中停止优先顺序加速移动页面（AMP）格式。这意味着网站所有者不再需要发布以AMP格式编写的额外一组页面。而是网站需要满足谷歌呼叫和＃34;核心网络毒品。＆＃34;\n 这听起来像很棒的消息。作为谷歌放大器的长期批评，我希望我能说谷歌放大器结束并完成，但我不相信。\n 正如我在几年前写的那样，它在推出时，谷歌＆＃39; SAMP是糟糕的 - 以可能的网络销毁方式不好。它＆＃39;对于如何建造的网络，它对可靠的在线内容的出版商以及它的消费者的消费者不好而不好。谷歌放大器对一方有利：谷歌。\n   并毫无误，放大器格式页面不仅从网络中消失。它＆＃39;很好的是，放大器不再需要在谷歌＆＃39;令人垂涎的顶级新闻旋转木马，但这并不是意味着放大器消失了。\n   要求发布者使用News的AMP格式是一个Moot Point。新闻的所有主要供应商已经使用了AMP。 Google不需要要求放大器，因为没有人留下武力。回滚放大器要求ISN＆＃39; t的胜利胜利的标志，它＆＃39;是失败的迹象。\n     另一个问题是，如果您是一个对Dropping支持对放大器的出版商，谷歌新闻ISN＆＃39; T唯一要考虑的游戏。\n AMP链接广泛使用其他Google服务，包括Gmail，Google Images和Google搜索。即使是谷歌新闻，谷歌和＃39的谷歌新闻中不再需要谷歌新闻，谷歌的变化发生了效果，目前在谷歌新闻旋转木马上的几乎每个故事都仍在使用安培。 \n所有这些都可以说谷歌放大器被迫在出版商上被迫，否则别无选择，出版商拥抱它 - 所以不要因为它而不是所要求的，所以不要因为它不再需要而离开。大媒体出版商采用缓慢甚至放弃慢。\n 不幸的是，我不希望AMP链接尽快消失。您可以始终通过安装浏览器插件来折腾放大器URL并为您提供实际URL的链接来完成Web的支持（我喜欢这个）。它＆＃39;痛苦，但如果我们希望将网络保留为尽可能无关，我们＆＃39;重新努力做一点工作。\n  在我进入为什么AMP＆＃39;替换可能更糟糕的时候，它将有助于备份并定义AMP是什么，因为它自推出以来的情况发生了变化。 AMP现在是由AMP开源项目开发的开源Web组件框架。在那句话中查看谷歌？不，不，你不要和＃39; t。多年来，谷歌从AMP扩展了差不多，但它没有给予控制权。\n 谷歌放大器始于加快网站的规定目标。 AMP背后的逻辑如下：Web开发人员吮吸快速网站，让＆＃39; s剥离所有的东西，人们不需要并将其缓存在我们的超快速服务器上。听起来不错。它＆＃39;不难看出人们如何落后于这个想法。问题是快速isn＆＃39; t是什么让网络变得伟大。它＆＃39; s的一部分，但它不是最重要的部分。\n AMP You＆＃39的另一个常见防御; LL听到的是它＆＃39; S开源。这是真的，也是一个非单数码。关于开源的东西，没有任何内容。随着Web开发人员Ferdy Christant在2018年将其归还，开源防御＆＃34; isn＆＃39; t只是一个弱的防御，它根本没有防御。我可以开源进行种族灭绝的计划。术语＆＃39;开源＆＃39;如果开源有害的东西是毫无意义的。＆＃34;相当。\n   自从我们＆＃39;现在调用类似于Godwin＆＃39;法律的东西，让＆＃39; s暂停解决问题，是谷歌或AMP＆＃34;邪恶＆＃34 ;??我不知道。它并不重要。放大器背后的人可能有良好的意图，他们可能没有。谷歌不必是＆＃34;邪恶＆＃34;为了做伤害开放网的事情。\n  无论动机如何，AMP开发人员都为开放的Web生态系统产生了糟糕的东西，因为它会破坏网络的三个Sac鱼科元素：URL，HTML的开放网标准以及Web的分散化。 \nURL被销毁，因为当您访问AMP页面时，您访问缓存的URL。分享该URL和访问它的人也将访问Google缓存，而不是发布者＆＃39; s网址。发生时没有网站。只有交通兑换谷歌，这对...谷歌有利。在我的脑海里，这是放大器的最大问题。 URL是网络。字面上地。没有你没有的网址。\n 放大器没有停在那里;它还耗尽了各种完美的有效，批准的标准主体HTML。程序员讨厌HTML。它＆＃39; s凌乱，模糊，不精确和用户代理商必须处理那个，这对程序员来说是一个巨大的痛苦。在许多方面，它有一个有效的批评，但它也错过了这些是究竟能够使数百万人使用HTML的品质。它＆＃39; s凌乱，模糊，不精确，完美地创建网络。什么＆＃39;更好的是，许多人都是非常缓慢的，代表许多观点，许多需要。 AMP是一系列编程指南，通过谷歌推动了您的喉咙。\n AMP的第三个问题是它破坏了Web和＃39;分散的设计。这是两件事的生长，但是当我们开始考虑谷歌AMP＆＃39时，这是一个很重要的事情。＆＃34;核心网络毒品。＆＃34;\n 分权意味着没有一个实体控制Web内容。使用放大器，Google获得了对内容的完全控制。谷歌主持它，谷歌仅知道谁访问它。\n 最后一点是讽刺意味的是，如果你倾向于阴谋，谷歌就可以确切地知道它是什么＆＃39;在这里做什么 - 即锁定谷歌可以控制它和矿山用户的内容。你准备好了吗？谷歌放大器页面＆＃39; t比常规HTML页面更快。更糟糕的是，他们经常慢一点。不，不是在开玩笑。当放大器页面更快，它＆＃39; s是因为谷歌预加载了它们，谷歌可以为Web上的任何页面做。\n 尽管如此，在谷歌新闻的顶级新闻旋转木马中仍然存在一个强大的胡萝卜，它奏效了。几乎所有Web上的主要发布商（包括这一个）发布了他们的页面的放大器版本。\n 现在放大器不再需要出版商，那些我们呼喊如何糟糕的人现在可以闭嘴，对吗？ \n不幸的是，amp＆＃39的替代品存在问题。这些问题首先回到了AMP出现问题：谷歌负责它。\n 由于Web开发人员Ethan Marcotte指出：＆＃34;虽然转向核心Web Vitals是一个朝着正确方向的一步，但它也意味着Google独自决定了什么A＆＃39;伟大的页面体验＆＃39;意思是。＆＃34;\n 目前它意味着您的页面应大多数在2.5秒内加载。那个＆＃39;不是一个非常高的酒吧要诚实，但它仍然是一个酒吧，网站不做酒吧。更糟糕的是，明天要求可能会改变。 Marcotte明确表示他认为剥夺核心Web Vitals的Deviorising AMP是一件非常好的事情，但我并不是如此，我不太确定＆＃39;真的。似乎都没有是Marcotte，他们继续注意到谷歌拥有＆＃34;采取了专有的文件格式，并换了一组专有的性能统计数据，这些统计数据具有更少的外部监督。＆＃34;\n  在最终的放大器和核心Web中，Virtals沸腾到了一个非常简单的现实：谷歌再次在搜索业务中使用其优势来强迫每个人都在其术语。无论是＆＃39; s专有的标记语言还是一些任意的性能标准，最终结果是相同的。谷歌是一个垄断，它正在利用其垄断地位，强迫其余的网站做它想要的东西。\n Google AMP及其继任者是经典的例子，可以从另一个垄断和＃39; S Playbook中拉出：拥抱，延伸和熄灭。不同之处在于谷歌更聪明地扼杀它是如何熄灭的东西而不是微软。谷歌拥抱HTML，然后用AMP扩展它，现在，在声称已经熄灭放大器，它得到了没有坏的压力所需的控制。熄灭移动中的轻微扭曲是一个很好的触感，谷歌。打的好。\n 我之前说过，我再说一遍。网络的力量在于它的分散化，它呈现到它的混乱，它与其边缘节点有关 - 也就是说，与你和我在一起。我们拒绝了放大器，可能会褪色，但我们需要继续拒绝。如果我们拒绝核心网络威力，它也会死。 ®\n     英国艺术家寻求＆＃39; luvvie levy＆＃39;在新的小工具上弥补消费者在线访问的所有媒体 \n世界领先的灯光＆＃34;艺术＆＃34; 已呼吁在手机，笔记本电脑和电脑上征税，以帮助融资创意产业，他们声称因缺乏收入和资金而被蹂躏。  DACS  - 视觉艺术家＆＃39; 权利管理非营利资料 - 估计新技术小工具销售1-2％的征收可以帮助每年提高250万英镑300米。  它说，一部分推理的一部分是倡议，是它将有助于纠正通过直接支付的人们访问音乐，电影和其他创意物料的人们造成的平衡。  继续阅读  Panasonic＆＃39; STARGBook G2平板电脑即使使用手套和完整的Windows 11兼容性也会有10张手指触摸。  继续阅读  Bezos V Branson：Wannabe Space Barons的战斗，作为FAA的处女银河，开始飞行客户 \n一对富有的白人看起来在靠在的银河被联邦航空管理局（FAA）给予顾客到空间之后，在空间的边缘看它在空间边缘。\n  继续阅读\n  富士通赢得了900万英镑的合同徒步旅行，为北爱尔兰教育管理局近3年运行近3年\n     富士通已被北爱尔兰教育机构授予£9,200万英镑的合同延期，以改变近三年的甲骨文人力资源和工资系统的实施。\n  该项目 - 首先被称为EA综合财务管理信息系统，现在被称为EA一个项目 -  2015年始于2015年，返回日本供应商2000万英镑的合同奖。但是，根据上周发布的投标奖颁发通知，该权威表示，新奖项是必要的＆＃34;促进功能变化，以有效地满足学校＆＃39;要求，数据迁移问题由于员工条款和条件的变化的复杂性，以及Covid-19锁定导致的项目延迟。＆＃34;\n  通知续：＆＃34;此修改将能够继续执行现有的单一承包商管理服务安排，其中包括提供广泛的计算机和相关服务，信息技术咨询服务以及计算机硬件，软件和相关的电源产品。\n  继续阅读 \n当自由和开放的来源实际上意味着每包600万英镑 - £8£8,8,800; atos＆＃39;与NHS英国合同136亿英镑\n  ＆＃39;所有软件都必须安全且安全地部署在我们提供的指南内，＆＃39;外包说\n     法国外包员ATOS在非部门政府机构的工人请求的流行和开源软件中，From French Outsourcer Atos每一直在为NHS英格兰充电。\n  根据登记册看到的文件，NHS英国的数据工作人员必须通过他们的线路管理要求FOSS包。这些是由外包员履行的，作为其2019年6月签署的卫生和社会护理部的136万英镑协议的一部分。\n  NHS英格兰的分析师，他们致力于世界上世界性之一的战略规划，以及协助Covid-19回应，已要求普通，自由可用的开源包，如r，统计语言和Python，通用语言。\n  继续阅读\n  英国＆＃39;金融看门狗在二明团的弓箭中发射了警告，并命令它在Binance.com上留下通知，吓跑英国加密粉丝。 \n这似乎是由于指数，最终是在开曼群岛，希望在英国在英国发布交易所，以来，自今年年初以来，英国的加密货币公司必须注册全国＆＃39;金融行为权，符合其反洗钱和反恐资助需求。\n  本金Hasn＆＃39; T完成这一点，或者因为FCA本身置于它，但BINANCE已经展示了一个＆＃34;拼版＆＃34;对监管机构＆＃39;规则。\n  继续阅读\n  我们希望这家酒店有一个漂亮的水疗中心，因为Windows确定看起来需要一些R＆amp; r\n     Bork！Bork！Bork！微软Windows的能力对于它的能力来说是偏离任何地方，但这是我们认为，它第一次在酒店的一侧羞辱。\n  ＆＃34; 4星级酒店正在使用2星级操作系统，似乎，＆＃34;我们的读者说，周末发现了博格，在英国萨默塞特·布里奇沃特的墙壁上涂抹了。\n  继续阅读 \n佛罗里达州的淡水甲壳类动物Boffins的一项研究表明，将抗抑郁药喂养到小龙虾可以使它们更加开除和冒险 - 或多或少是如何定义抗抑郁药应该如何工作的定义。在人类，至少。\n  该实验提出了研究抗抑郁药的接触程度可能影响野外小龙虾行为，因为人类药物污染物是淡水环境中的增加因素。\n  为此，它们创造了“20个椭圆形循环的人工流”，每个流是它们充满60升无化学地下水。在每个人造溪流中，他们在一端为小龙虾造成了避难所，开始进入，这导致了两个单独的路径：用鱼明胶调味以发出食物来源;另一个小龙虾填充的另一个潜在挑起了激进的反应。\n  继续阅读\n  M1中的m是呻吟：如何将新的MacBook Pro转换为桌面主控？\n     M1 MacBook Pro就像那个辉煌的同事，他们坚持在办公室小厨房里的微波。善于工作，当然，也是深深的烦人。\n  一方面，这台机器是一个名副其实的野兽。它快速，安静，并拥有此评论家使用的任何机器的最佳电池寿命。然而，它遭受了两个不同的缺陷。首先，它依赖于两个USB-C（在这种情况下，Thunderbolt 4）端口进行外部可扩展性。其次，无论出于何种原因，它本地只支持一个外部显示器。 \n幸运的是，这些是非常简单的，因为你提供了一些深口袋。几周前，anker向我们发送了它的Powerexpand 5-In-1霹雳4码头审查。价格为200英镑，＆＃39;不便宜。\n  继续阅读\n  赞助云的进度，组织IT基础设施比组织披萨交付更难。\n  根据MarketsandMarkets，到2021年底，云数据中心将处理超过总工作量的94％。这很容易解释为什么企业迁移到云：像如何简单的公司从提供者租用能力和解决方案。但是，所有与虚拟机更相关的所有内容。\n  专用服务器周围的情况并不像简单。然而，它们仍然对某些任务仍然不可或缺，并允许客户的业务充分利用其基础架构。我们对裸裸金属服务器的审查将显示它们的优势，当它们是必不可少的，如何将它们无缝地集成到公司IT基础架构中。\n  继续阅读\n  哈勃望远镜在另一个紧张的地方：在天体物理学家之间争吵在一个＆＃39;暗物质缺乏＆＃39;星系 \n一支球队称，DF2是72米的人，另一个不同意 - 我们与双方说话\n     毫无介意辐射的记忆错误。几十年古老的哈勃太空望远镜的另一部分变化已经发现了果酱。这次其相机单元再次在科学家之间的冲突中，无论是Galaxy NGC 1052-DF2是否包含任何暗物质。\n  当DF2在2018年在自然纸上写出时，研究立即抬起眉毛。本文得出结论，星系缺乏暗物质。怎么可能？\n  神秘的物质被认为是在所有星系中存在，持有闪闪发光的星星，粉尘和天然气的漩涡，更多，给星系结构和形状。暗物质是银河形成理论的重要组成部分，并在没有这种隐藏的东西的情况下找到星系，或者它的数量非常低，打破所有规则。 DF2被告警，作为一个重要的奇怪。\n  继续阅读\n  注册 - 对科技界的独立新闻和意见。部分情况出版 ", "note_en": "Feature Google stopped prioritising Accelerated Mobile Pages (AMP) format in its Top News carousel last month. This means website owners no longer need to publish an extra set of pages written in the AMP format. Instead sites need to meet what Google calls &#34;Core Web Vitals.&#34;\n This sounds like great news. As a  long-time critic of Google AMP, I wish I could say that Google AMP is over and done with, but I&#39;m not convinced.\n As I wrote years ago when it launched, Google&#39;s AMP is bad – bad in a potentially web-destroying way. It&#39;s bad for how the web is built, it&#39;s bad for publishers of credible online content, and it&#39;s bad for consumers of that content. Google AMP is only good for one party: Google.\n   And make no mistake, AMP format pages did not just disappear from the web. It&#39;s great that AMP is no longer required to get in Google&#39;s coveted Top News carousel, but that doesn&#39;t mean AMP is gone.\n   Requiring publishers to use the AMP format for news is a moot point. All of the major purveyors of news already use AMP. Google doesn&#39;t need to require AMP because there&#39;s no one left to force into using it. Rolling back the AMP requirement isn&#39;t a sign of victory for the open web, it&#39;s a sign of defeat.\n     The other problem is that if you were a publisher interested in dropping support for AMP, Google News isn&#39;t the only game to consider.\n AMP links are widely used throughout other Google services, including Gmail, Google Images, and Google Search. Even though it&#39;s no longer required for Google News, around a month after Google&#39;s ranking changes took effect, almost every story currently in the Google News carousel is still using AMP.\n   All of which is to say that Google AMP was forced on publishers and, given no choice, publishers embraced it – so don&#39;t expect it to go away now just because it&#39;s no longer required. Big media publishers are slow to adopt and even slower to abandon.\n Unfortunately, I don&#39;t expect AMP links to disappear any time soon. You can always do the web a favour by installing a browser plugin to toss out the AMP URL and give you the link to the actual URL (I like  this one). It&#39;s a pain, but if we want to keep the web as AMP-free as possible, we&#39;re all going to have to do a little work.\n  Before I get into why AMP&#39;s replacement might be worse, it would help to back up and define what AMP is, because things have changed since it launched. AMP is now an open-source web component framework developed by the AMP Open Source Project. See Google anywhere in that sentence? No, no you don&#39;t. Google has distanced itself from AMP considerably over the years, but it hasn&#39;t given up control.\n Google AMP began with the stated goal of speeding up the web. The logic behind AMP goes like this: web developers suck at making fast websites, let&#39;s strip out all the stuff people don&#39;t need and cache it on our super-fast servers. That  sounds good. It&#39;s not hard to see how well-meaning people would get behind that idea. The problem is that being fast isn&#39;t what makes the web great. It&#39;s part of it, but it&#39;s not the most important part.\n Another common defence of AMP you&#39;ll hear is that it&#39;s open source. This is true, but also a non sequitur. There is nothing inherently good about something being open source. As web developer  Ferdy Christant put it back in 2018, the open source defence &#34;isn&#39;t just a weak defense, it&#39;s no defense at all. I can open-source a plan for genocide. The term &#39;open source&#39; is meaningless if the thing that is open source is harmful.&#34; Quite.\n   Since we&#39;ve now invoked something akin to  Godwin&#39;s Law, let&#39;s pause for a moment to address the question, is Google or AMP &#34;evil&#34;? I don&#39;t know. It doesn&#39;t matter. The people behind AMP might have had good intentions, they might not have. Google does not have to be &#34;evil&#34; for it to do things that harm the open web.\n  Regardless of motivation, the fact remains that the AMP developers produced something that is bad for the open web ecosystem because it destroys three sacrosanct elements of the web: the URL, the open web standard of HTML, and the decentralisation of the web.\n The URL is destroyed because when you visit an AMP page you visit a cached URL. Share that URL and the people who visit it will also visit the Google cache, not the publisher&#39;s URL. There is no web when that happens. There is just traffic coming to Google, which is good for... Google. To my mind this the biggest problem with AMP. The URL is the web. Literally. Without the URL you have nothing.\n AMP doesn&#39;t stop there; it also strips out all kinds of perfect valid, approved-by-standards-bodies HTML. Programmers hate HTML. It&#39;s messy, vague, imprecise, and user agents must deal with that, which is a huge pain for programmers. It&#39;s a valid criticism in many ways, but it also misses the fact that these are exactly the qualities that have enabled millions of people to use HTML. It&#39;s messy, vague, imprecise, and perfect for creating the web. What&#39;s more, it is developed very slowly, by many people, representing many points of view, many needs. AMP is a set of programming guidelines shoved down your throat by Google.\n The third problem with AMP is that it disrupts the web&#39;s decentralised design. This is really an outgrowth of the two things, but important in its own right when we start considering Google AMP&#39;s ostensible replacement, &#34;Core Web Vitals.&#34;\n Decentralisation means that no one entity controls web content. With AMP, Google gets total control of the content. Google hosts it, and Google alone knows who visits it.\n The final point is either ironic or, if you lean towards conspiracy, proof that Google knows exactly what it&#39;s doing here – namely, locking up content where Google can control it and mine users for data. Are you ready for it? Google AMP pages aren&#39;t any faster than regular HTML pages. Worse, they&#39;re often slower. Nope, not kidding. When AMP pages are faster, it&#39;s because Google is pre-loading them, which Google could do for any page on the web.\n Still, getting a spot in the Top News carousel of Google News is a powerful carrot, and it worked. Nearly every major publisher on the web (including this one) publishes AMP versions of their pages.\n Now AMP is no longer required of publishers, those of us shouting about how this is bad can just shut up now, right?\n Unfortunately, there are problems with AMP&#39;s replacement as well. And those problems go right back to what was wrong with AMP in the first place: Google is in charge of it.\n As web developer Ethan Marcotte  points out: &#34;While the shift to Core Web Vitals is a step in the right direction, it also means that Google alone determines what a &#39;great page experience&#39; means.&#34;\n Currently it  means your page should mostly load in 2.5 seconds. That&#39;s not a very high bar to be honest, but it is still a bar and the web does not do bars. Worse, that requirement might change tomorrow. Marcotte makes it clear that he thinks deprioritising AMP in favour of Core Web Vitals is a very good thing, but I&#39;m not so sure that&#39;s true. Neither, it seems, is Marcotte, who goes on to note that Google has &#34;taken its proprietary document format, and swapped it out for a proprietary set of performance statistics that has even less external oversight.&#34;\n  In the end AMP and Core Web Vitals boil down to a very simple reality: Google is again using its dominance in the search business to force everyone to play on its terms. Whether that&#39;s a proprietary markup language or some arbitrary set of performance standards, the end result is the same. Google is a monopoly and it is using its monopoly position to force the rest of the web into doing what it wants.\n Google AMP and its successor are classic examples that could have been pulled from another monopoly&#39;s playbook: embrace, extend, and extinguish. The difference is that Google is being much more clever about how it extinguishes things than Microsoft ever was. Google embraced HTML, then extended it with AMP and now, in claiming to have extinguished AMP, it gets the control it wants without the bad press. The slight twist in the extinguish move is a nice touch, Google. Well played.\n I&#39;ve said it  before, I&#39;ll say it again. The power of the web lies in its decentralisation, it lies with its messiness, it lies with its edge nodes – that is, with you and me. We rejected AMP, it may be fading, but we need to keep rejecting. If we reject Core Web Vitals, it too will die. ®\n     UK artists seek &#39;luvvie levy&#39; on new gadgets to make up for all the media that consumers access online\n     Leading lights in the world of &#34;the arts&#34; have called for a techy tax on mobiles, laptops, and PCs to help finance creative industries they claim have been ravaged by lack of revenue and funding.\n  DACS – the visual artists&#39; rights management nonprofit – reckons a levy of 1-2 per cent on the sale of new tech gadgets could help raise £250m-£300m a year.\n  Part of the reasoning behind the initiative, it said, is that it would help redress the balance caused by people accessing music, films, and other creative material online without paying for it directly.\n  Continue reading\n  Panasonic&#39;s Toughbook G2 tablet will feature 10-finger touch even with gloves on and full Windows 11 compatibility.\n  Continue reading\n  Bezos v Branson: Battle of the wannabe Space Barons as Virgin Galactic cleared by FAA to start flying customers\n     A pair of rich white men look set to duke it out at the edge of space after Virgin Galactic was given the green light by the Federal Aviation Administration (FAA) to fly customers to space.\n  Continue reading\n  Fujitsu wins £9m contract hike for Oracle HR system running nearly 3 years late at Northern Ireland Education Authority\n     Fujitsu has been awarded a £9.2m contract extension by the Northern Ireland Education Authority for changes to the implementation of an Oracle HR and payroll system that is already nearly three years late.\n  The project – first known as the EA Integrated Financial Management Information System, now dubbed EA One Project – began in 2015 with a £20m contract award to the Japanese supplier. But, according to  a tender award notice published last week, the authority said the new award was necessary to &#34;facilitate functionality changes to effectively meet schools&#39; requirements, data migration issues due to the complexity of the variations in employee terms and conditions, and project delays due to COVID-19 lockdowns.&#34;\n  The notice continued: &#34;This modification will enable the continuation of the existing single contractor managed service arrangement which includes the supply of a broad range of computer and related services, information technology consultancy services and the supply of computer hardware, software and associated products.\n  Continue reading\n  When free and open source actually means £6k-£8k per package: Atos&#39;s £136m contract with NHS England\n  &#39;All software must be safely and securely deployed within guidelines provided to us,&#39; says outsourcer\n     French outsourcer Atos has been charging NHS England between £6,000 and £8,000 for packing up popular free and open-source software requested by workers in the non-departmental government body.\n  According to documents seen by  The Register, data workers in NHS England have to request FOSS packages via their line management. These are fulfilled by outsourcer Atos, as part of  its £136m agreement with the Department of Health and Social Care signed in June 2019.\n  Analysts within NHS England who work on strategic planning of one of the world&#39;s largest public health systems, as well as assisting with the COVID-19 response, have requested common, freely available open-source packages such as R, the statistical language, and Python, the general-purpose language.\n  Continue reading\n  The UK&#39;s financial watchdog has fired a warning shot across the bow of Binance, and ordered it to place a notice on binance.com scaring off Brit crypto fans.\n  This seems to have come about because Binance, which is ultimately based in the Cayman Islands, wanted to launch an exchange in the UK using its London-based affiliate Binance Markets Ltd. Since the start of the year, cryptocurrency firms in Britain have had to register with the nation&#39;s Financial Conduct Authority and meet its anti-money-laundering and anti-terrorism-funding requirements.\n  Binance hasn&#39;t done this yet, or as the FCA itself put it, Binance has demonstrated an &#34;imposition&#34; to the regulator&#39;s rules.\n  Continue reading\n  We hope this hotel has a nice spa because Windows sure looks like it needs some R&amp;R\n     Bork!Bork!Bork! Microsoft Windows is notable for its ability to fall over pretty much anywhere, but this is, we think, the first time it has disgraced itself over the side of a hotel.\n  &#34;The 4 star hotel is using a 2 star OS for its signage, it seems,&#34; said our reader, who spotted the borkage over the weekend, smeared up against the wall of the Mercure Bridgwater in Somerset, England.\n  Continue reading\n  A study by freshwater crustacean boffins in Florida has revealed that feeding antidepressants to crayfish can make them more outgoing and adventurous — which is more or less a definition of how antidepressants are supposed to work. On humans, at least.\n  The experiment set out to investigate how exposure to antidepressants might affect crayfish behaviour in the wild, since human pharmaceutical pollutants are an increasing factor in freshwater environments.\n  To do this, they created “20 oval-shaped recirculating artificial streams,” each of which they filled with 60 litres of chemical-free groundwater. In each artificial stream, they built a shelter at one end for the crayfish to start in, which led to two separate paths: one flavoured with fish gelatin to signal a source of food; the other populated by another crayfish to potentially provoke an aggressive response.\n  Continue reading\n  The M in M1 is for moans: How do you turn a new MacBook Pro into a desktop workhorse?\n     The M1 MacBook Pro is like that brilliant colleague who insists on microwaving fish in the office kitchenette. Good at its job, certainly, but also deeply annoying.\n  On one hand, this machine is a veritable beast. It&#39;s fast, quiet, and has the best battery life of any machine this reviewer has used. Yet it suffers from two distinct flaws. First, it is reliant on just two USB-C (in this case, Thunderbolt 4) ports for external expandability. Secondly, for whatever reason, it natively supports just one external display.\n  Fortunately, these are fairly straightforward to circumvent, provided you&#39;ve got some deep pockets. A few weeks ago, Anker sent us  its PowerExpand 5-in-1 Thunderbolt 4 dock to review. Priced at £200, it&#39;s not cheap.\n  Continue reading\n  Sponsored With the progress of clouds, organizing IT infrastructure is no harder than organizing pizza delivery.\n  According to MarketsandMarkets, by the end of 2021, cloud data centers will process over 94% of the total workload. It’s easy to explain why businesses migrate to clouds: companies like how simple it is to rent capacities and solutions from providers. However, all that is more relevant to virtual machines.\n  The situation around dedicated servers is not as simple. They are, however, still indispensable for certain tasks, and allow client’s business to get the most out of its infrastructure. Our review of bare metal servers will show their advantages, when they are indispensable and how to seamlessly integrate them into corporate IT infrastructure.\n  Continue reading\n  Hubble telescope in another tight spot: Between astrophysicists sparring over a &#39;dark matter deficient&#39; galaxy\n  One team says DF2 is 72m LY away, another disagrees – we speak to both sides\n     Never mind memory errors from radiation. Another deteriorating part of the decades-old Hubble Space Telescope has found itself in a jam. This time its camera unit is once again in the middle of a clash between scientists over whether or not the galaxy NGC 1052-DF2 contains any dark matter.\n  When DF2 was  written up in a  Nature paper in 2018, the study immediately raised eyebrows. The paper concluded the galaxy was devoid of dark matter. How could that be possible?\n  The mysterious substance is thought to be present in all galaxies, holding together glittering stars, swirls of dust and gas, and more, giving the galaxies structure and shape. Dark matter is a crucial component in theories of galactic formation, and finding a galaxy without this hidden stuff, or a very low quantity of it, breaks all the rules. DF2 was heralded as a significant oddball.\n  Continue reading\n  The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2021-06-29 22:37:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,放大器,longer", "title": "谷歌不再需要放大器，但更换可能更糟 ", "title_en": "Google no longer requires AMP, but the replacement might be worse", "transed": 1, "url": "https://www.theregister.com/2021/06/28/google_amp_core_web_vitals/", "via": "", "real_tags": ["google", "谷歌", "放大器", "longer"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068456, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为开发人员和分散世界的爱好者，我们为像我们这样的其他人的人提供了必要性，可以通过人类可读的URL格式与IPF分享他们的DAPP，而不会失去隐私，匿名，仍然是自由的 酷名称（很快管理） ", "note_en": "We, as developers and as enthusiasts of a decentralized world, saw the necessity for the others like us, to have a way to share their dapps from IPFS in a human-readable URL format, without losing their privacy, anonymity and still being free and with a cool name(manageable soon)", "posttime": "2021-06-29 22:37:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,ipfs,subdomains,分散", "title": "IPFS的子域名 ", "title_en": "Subdomains for IPFS", "transed": 1, "url": "https://ipds.io/", "via": "", "real_tags": ["域名", "ipfs", "分散"]}, {"category": "", "categoryclass": "", "imagename": "f08056feb87c4ea04cc205365e49149c.jpg", "infoid": 1068455, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Linux内核的最新更新版本5.13已被释放，支持Apple Silicon系统的M1。\n  以前可以作为公开测试的候选人提供的，Linux 5.13的最终版本已被释放。 Linus Torvolds周一宣布，最新版本被称为版本5系列的更大版本之一，超过2,000多个开发人员提出了超过16,000个提交。\n 对于Mac用户，内核的密钥是支持多个基于ARM的芯片，这令人遗憾地包括M1。因此，新内核能够在Apple Silicon硬件上自然地运行，包括M1 Mac Mini和24英寸IMAC。\n 虽然包括使用M1的能力，但Phoronix报告那里＆＃39; s还有更多的工作要做，包括为加速图形添加支持。其他更改包括各种更新的驱动程序，体系结构和文件系统改进，并更改处理处理和工具。\n  Linux 5.13不是与M1合作的操作系统的第一个版本。 1月份，Corellium的安全研究人员将一个版本的Ubuntu向芯片移植到芯片中，一个过程需要许多解决方法来进入，部分原因是苹果＆＃39;缺乏关于芯片如何运行的文档。\n 在每周AppleInsider播客中跟上Apple  - 并每天从AppleInsider获得快速新闻更新。刚说，＆＃34;嘿，西里，＆＃34;到您的HomePod Mini并询问这些播客，以及我们最新的HomeKit Insider Enisode。\n 如果您想要一个免费的主要AppleInsider播客体验，您可以通过苹果＆＃39; s vodcasts应用程序订阅5美元，或者通过Patreon来支持AppleInsider Podcast，如果您喜欢任何其他播客播放器。 \nAppleInsider已经提交伙伴关系，可以通过联盟链接购买的产品培训委员会。 这些伙伴关系不会影响我们的编辑内容。 ", "note_en": "The newest update of the Linux kernel, version 5.13, has been released with support for the  Apple Silicon system-on-chip, the M1.\n  Previously available in May as a  release candidate for public testing, the final version of Linux 5.13 has been released.  Announced by Linus Torvolds on Monday, the newest version is said to be one of the bigger releases in the version 5 range, with over 16 thousand commits made by over 2 thousand developers.\n For Mac users, the key addition to the kernel is support for a number of ARM-based chips, which crucially includes the  M1. The new kernel is therefore able to be run natively on Apple Silicon hardware, including the M1  Mac mini and the  24-inch iMac.\n While the ability to use M1 is included,  Phoronix  reports there&#39;s still more work to be done, including adding support for accelerated graphics. Other changes include a variety of updated drivers, architecture and file system improvements, and changes to process handling and tooling.\n  Linux 5.13 is not the first version of the operating system that works with the M1. In January,  security researchers at Corellium ported a version of Ubuntu to the chip, a process that required  many workarounds to get going, in part due to Apple&#39;s lack of documentation on how the chip functioned.\n Keep up with everything Apple in the weekly AppleInsider Podcast — and get a fast news update from AppleInsider Daily. Just say, &#34;Hey, Siri,&#34; to your HomePod mini and ask for these podcasts, and our latest HomeKit Insider episode too.\n If you want an ad-free main AppleInsider Podcast experience, you can support the AppleInsider podcast by subscribing for $5 per month  through Apple&#39;s Podcasts app, or  via Patreon if you prefer any other podcast player.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2021-06-29 22:37:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,apple,m1,包括", "title": "Apple的M1现在由Linux内核支持5.13版 ", "title_en": "Apple's M1 now supported by Linux kernel in version 5.13", "transed": 1, "url": "https://appleinsider.com/articles/21/06/28/apples-m1-now-supported-by-linux-kernel-in-version-513", "via": "", "real_tags": ["linux", "apple", "m1", "包括"]}, {"category": "", "categoryclass": "", "imagename": "1211ef5539351580076fa3c978d11d20.png", "infoid": 1068454, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Winix是Waikato RISC架构微处理器（WROMP）的最小，爱好者，教育和UNIX风格的操作系统。 它是一个具有可用性和表现的混合内核。 Winix主要由Minix1启发，这是我在大学时学到的操作系统。  Winix包括具有流程和内存管理，内存文件系统，异常控制和用户空间Bourne shell的全功能内核，具有交互式命令行。 是的，您甚至可以通过在命令行中键入蛇来玩蛇  类似于Linux Kbuild，Winix支持verbose选项，可以通过将verbose设置为1来调试makefile  追踪：＆＃34; 在Bash中键入Trace以在串行端口2中打印所有SYSCALL ", "note_en": "Winix is a minimal, hobbyist, educational and UNIX-style Operating System for the Waikato RISC Architecture Microprocessor (WRAMP). It is a hybrid kernel with usability and performance in mind. Winix is mainly inspired by Minix1, which is the OS I learnt when I was in university.\n Winix includes full-featured kernel with process and memory management, in-memory file system, exception control and user space bourne shell with interactive command line. Yes, you can even play snake on it by typing  snake in the command line\n                             Similar to linux kbuild,  Winix supports verbose option, you can debug Makefile by setting verbose to 1\n    trace: &#34; type trace in bash to print all the syscalls in serial port 2", "posttime": "2021-06-29 22:36:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,years,具有", "title": "我花了5年写自己的操作系统 ", "title_en": "I spent 5 years writing my own operating system", "transed": 1, "url": "https://github.com/halfer53/winix", "via": "", "real_tags": ["操作系统", "years", "具有"]}, {"category": "", "categoryclass": "", "imagename": "32953c5ed60201da5c5c3f840297db63.jpg", "infoid": 1068453, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着关于Covid-19起源的主流叙事分开，现在是时候将其它广泛接受的事实置于病毒 - 以及他们用于合理的破坏性措施 - 在同样的审查下 ", "note_en": "As the mainstream narrative about the origin of COVID-19 falls apart, it’s time to put other widely accepted facts about the virus—and the devastating measures they were used to justify—under the same scrutiny", "posttime": "2021-06-29 22:36:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,questions,分开", "title": "更新有关病毒的问题，以及难以面对的答案 ", "title_en": "Renewed questions about the virus, and hard-to-face answers", "transed": 1, "url": "https://www.tabletmag.com/sections/news/articles/the-war-on-reality-gutentag", "via": "", "real_tags": ["病毒", "questions", "分开"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068452, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "齐森的核心思想是，代码是不可变的，并通过其内容来识别。 这让我们恢复了编程语言如何工作的许多方面。 我们简化了CodeBase Management  -  Unison没有构建，没有依赖性冲突，并重命名事物是微不足道的。 同一核心思想构成了运行时强大支持动态代码部署的运行时的基础，允许单一协定的程序来描述整个弹性分布式系统。  虽然齐声齐声仍然是实验性和正在进行的，但我们正在分享早期的Alpha发布您的语言供您测试。 我们将在很快推出一般提供更新的释放。 与此同时，欢迎任何人帮助alpha测试。 ", "note_en": "Unison’s core idea is that code is immutable and identified by its content. This lets us reimagine many aspects of how a programming language works. We simplify codebase management — Unison has no builds, no dependency conflicts, and renaming things is trivial. The same core idea forms the basis for a runtime that robustly supports dynamic code deployment, allowing a single Unison program to describe entire elastic distributed systems.\n Though a lot of the work on Unison is still experimental and ongoing, we’re sharing an early alpha release of the language for you to test out. We’ll make a more finished release generally available soon. In the meantime, anyone is welcome to  help with alpha testing.", "posttime": "2021-06-29 22:36:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,齐声,alpha", "title": "齐声编程语言 ", "title_en": "Unison Programming Language", "transed": 1, "url": "https://www.unisonweb.org/", "via": "", "real_tags": ["编程", "齐声", "alpha"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068451, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自OO革命敲门以来，软件开发中最大的海洋变化，其名称是并发。\n 这篇文章出现在2005年3月30日，30（3）岁的Journal博士中出现在Title＆＃34下的一个很多Briefer版本;并发革命和＃34;在2005年2月23日，23（2）中出现在C / C ++用户期刊中。\n 更新注意：CPU趋势图上次更新了2009年8月以包括当前\r数据并显示趋势继续如预测。本文的其余部分\r包括所有文本仍然是2004年12月首次发布的原始文本。\n   您的免费午餐将很快结束。你能为这个做什么？你在做什么？\n 主要的处理器制造商和架构，从Intel和AMD到SPARC和PowerPC，大多数传统方法都耗尽了促进CPU性能的空间。他们代替驾驶时钟速度和直线指令吞吐量，而是转向enmasse到超线程和多核架构。这两个功能都在今天的芯片上提供;特别是，Multicore可在当前PowerPC和SPARC IV处理器上提供，并于2005年从英特尔和AMD推出。实际上，2004年IN-STAT / MDR秋季处理器论坛的大主题是多核设备，因为许多公司都显示了新的或更新的多核处理器。回顾一下，它并不大部分延伸到2004年多夜的年。\n 这让我们在软件开发中的一个基本转折点，至少在未来几年内，针对通用桌面计算机和低端服务器的应用程序（恰好占销售的软件的广泛大部分美元价值）今天）。在这篇文章中，生病描述了硬件的变化面，为什么它突然对软件有关，并具体康全革命对您的事项有何重要，并将改变您将来可能是在未来编写软件的方式。\n 可以说，自由午餐已经过了一两年或两个人，才刚刚刚刚注意到。 \n这是一个有趣的现象，被称为Andy Giveth和Bill Taketh离开。无论处理器如何快速，软件一直发现新的进食额外速度的方法。将CPU速度制作十倍，软件通常会找到十倍的时间（或者，在某些情况下，在某些情况下会感到自由，以便有效地减少十倍）。大多数阶段的应用程序已经享受了几十年的自由和定期的性能提升，即使没有发布新版本或做任何特殊的东西，因为CPU制造商（主要）和内存和磁盘制造商（其次）可靠地启用了更新，更新主流系统。时钟速度是唯一的性能衡量标准，甚至必然是一个好的，但它是一个有益的人：被习惯看到500MHz的CPU让位于1GHz CPU，让位于2GHz CPU，等等。今天在主流电脑上的3GHz范围内。\n 关键问题是：它什么时候结束？毕竟，摩尔人法律预测指数增长，并且在达到硬物质限制之前，明显的指数增长无法继续;光不得不变得更快。增长最终必须减速甚至结束。 （警告：是的，Moores法则主要适用于晶体管密度，但在钟表速度等相关领域发生了同样的指数增长。其他空间的增长甚至更快，最重要的是数据存储爆炸，但重要趋势属于数据存储爆炸在不同的文章中。）\n 如果您是软件开发人员，可能已经乘坐免费午餐浪潮的桌面计算机性能。您的应用程序性能是否为某些本地操作界限？不担心，传统（如果怀疑）智慧就会去;明天处理器将具有更多的吞吐量，无论如何，今天的应用程序越来越逐渐被CPU吞吐量和内存速度以外的因素痉挛（例如，它们通常是I / O绑定，网络绑定，数据库绑定）。正确的？\n  好消息是，处理器将继续变得更加强大。坏消息是，至少在短期内，增长将主要是在不采取大多数目前的应用程序的方向前往他们习惯的自由骑行。\n 在过去的30年中，CPU设计师在三个主要领域取得了性能提升，其中前两个专注于直线执行流程：\n     增加时钟速度是关于获得更多周期。更快地运行CPU或更少直接意味着更快地执行相同的工作。\n 优化执行流程是关于每周期执行更多工作。今天的CPUS体育一些更强大的指示，它们执行优化，从行人到异国情调，包括流水线，分支预测，在同一时钟周期中执行多个指令，甚至重新排序指令流up-订单执行。这些技术旨在使指令更好地流动和/或更快地流动，并通过减少延迟并最大化每个时钟周期所完成的工作来挤出每个时钟周期的最大部分工作。 \n芯片设计人员在这么大的压力下，提供了更快的CPU，他们会导致更改程序的含义，并可能打破它，以便使其运行更快\n  在除教学重新排序和内存模型之外：请注意，我刚才被称为优化的一些实际上远远超过优化，因为它们可以改变程序的含义并导致可能破坏合理的程序员期望的可见效果。这是显着的。 CPU设计师通常是明智的，并且通常会伤害飞行的良好的人，并且不会想到通常伤害你的代码。但近年来，他们一直愿意追求积极的优化，只是为了拧出每个周期的速度，甚至知道这些激进重排可以危及代码的语义。这是海德先生的外表吗？一点也不。这种意愿只是一个明确的指标，芯片设计师面临的极限压力，旨在提供更快的CPU;在这么大的压力下，他们会冒险改变程序的含义，并可能打破它，以便使其运行更快。在这方面的两个值得注意的例子是编写重新排序和读取重新排序：允许处理器重新排序写入操作对此令人惊讶的后果，并且打破了许多程序员期望，这通常必须关闭，因为程序员太难了在任意写入重新排列的情况下正确地正确地了解其计划的意义。重新排序的读取操作也可以产生惊人的可见效果，但是这更常见于启用，因为它在程序员上不太努力，以及对操作系统和操作环境的性能设计人员的需求妥协，并选择更大的型号的模型在程序员上，因为这被视为较小的邪恶，而不是放弃优化机会。\n 最后，增加片上缓存的大小是远离RAM的。主要内存比CPU更慢，使得将数据更近于处理器和较近的CPU比在模具上更近得多。 On-Die缓存大小已经飙升，今天大多数主要芯片供应商都会销售您的CPU，具有2MB，更多的板载L2缓存。 （在这三种主要的历史方法中提高了CPU性能，增加了缓存是唯一一个将在近期继续的方法。稍后会更加关于缓存的重要性。）\n  关于该列表的根本重要的是，所有这些领域都是并发 - 不可知的。任何这些区域的加速将直接导致顺序（非平行，单线程，单程）应用程序的加速，以及使用并发性的应用程序。这是重要的，因为绝大多数今天的应用是单线程的，出于恶劣的原因，弊病进一步进一步。\n 当然，编制者必须跟上;有时您需要重新编译您的应用程序，并针对特定的最低限度级别的CPU，以便受益于新的指示（例如MMX，SSE）和一些新的CPU功能和特性。但是，甚至旧应用程序始终在不被重新编译的情况下始终运行大量的FastEreven，以利用最新CPU提供的所有新指令和功能。\n    CPU性能增长，因为我们已知它两年前击中了一堵墙。大多数人最近只开始注意到。\n 您可以获得其他芯片的类似图形，但我将在此处使用英特尔数据。图1通过时钟速度和晶体管数来图表英特尔芯片介绍的历史。至少现在，晶体管的数量继续攀升。然而，时钟速度是一个不同的故事。 \n图1：\r英特尔CPU介绍（图2009年8月更新;文本原创\r2004年12月）\n    在2003年初，您将注意到以前趋势的令人不安的急剧转向更快的CPU时钟速度。 IVE添加的线条以最大时钟速度显示限制趋势;如薄虚线所示，代替继续前一条路径，而不是薄虚线所示。由于不仅仅是一个但几个物理问题，较高的时钟速度越来越难以努力，显着的热量（太多并且太难以消散），功耗（太高）和电流泄漏问题。\n 快速：当前工作站中CPU上的时钟速度是什么？你在10GHz上运行吗？在英特尔筹码上，我们很久以前达到了2GHz（2001年8月），并根据2003年之前的CPU趋势，现在在2005年初，我们应该拥有第一个10GHz Pentium-Family Chips。快速环顾四周，嗯，实际上，我们没有。更重要的是，这种筹码甚至在地平线上都没有好主意，当我们可能看到它们出现时都没有好主意。\n 那么，那么4GHz怎么样？在3.4ghz alreadysurely 4ghz不远处？唉，甚至4GHz似乎是遥远的。 2004年中期，正如您所知，英特尔首先延迟了计划引入4GHz芯片，直到2005年，然后在2004年秋季完全抛弃了4GHz计划。根据本文，英特尔计划在2005年初开始进一步升至3.73GHz（已包含在图1中作为最右上大点），但时钟竞赛确实结束，至少现在; Intels和大多数处理器供应商的未来在其他地方成为芯片公司积极追求相同的新的多核方向。\n 有一天，可能会在主流桌面机上看到4GHz CPU，但它不会在2005年。当然，英特尔只有在劳动力的速度下运行的芯片的样品，才能通过英勇的工作，例如安装完全不切实际的冷却设备。您不会很快在您的办公室内使用那种冷却硬件，在平面上计算时，请在圈子上孤立在膝盖上。\n  没有免费午餐的东西。 R. A. Heinlein，月亮是一个苛刻的情妇\n 这是否均衡了这一意味着什么？有趣的是，一般答案似乎是没有。当然，就像所有指数进展一样，Moores法定必须结束一天，但似乎似乎还有几年了。尽管芯片工程师遭遇了果实的玉米果实，但晶体管计数继续爆炸，似乎CPU将继续追随Moores Law Live吞吐量的吞吐量超过一年时间。 \n因此，组合两个3GHz核心的双核CPU实际上提供了6GHz的处理能力。正确的？\n 错误的。即使在两个物理处理器上运行的两个线程也不意味着达到两倍性能。同样，大多数多线程应用程序不会在双核框上运行两倍。它们应该比单核CPU更快地运行;性能增益只是线性，即所有的。\n 为什么不？首先，核心之间存在开销，以确保高速缓存一致性（高速缓存的一致视图，以及主存储器）并执行其他握手。今天，即使对于多线程应用，两种或四个处理器机器也不是单个CPU的两到四倍。即使问题所讨论的CPU坐在同一个骰子上，问题也存在于此相同。\n 其次，除非两个核心正在运行不同的进程，或者单个过程的不同线程是单独的单独运行，否则单独运行以独立运行并且几乎从不等待彼此，但它们不会很好地利用。 （尽管如此，我会推测今天的单线程应用程序，如实际使用的单线程应用程序实际上可以通过进入双核芯片来实际上看到大多数用户的性能提升，而不是因为额外的核心实际上是有用的，但是因为它正在运行诸多用户系统的广告软件和间谍软件，否则否则缩小用户今天的单个CPU。我留给您来决定添加CPU是否运行间谍软件是该问题的最佳解决方案。）\n 如果您正在运行单线程应用程序，则应用程序只能使用一个核心。应该有一些加速作为操作系统，并且应用程序可以在单独的核心上运行，但通常操作系统无法达到CPU的最大化，所以其中一个核心将主要是空闲的。 （再次，间谍软件大部分时间都可以共享OSS核心。）\n  关键差异是这篇文章的核心，是，至少是下一对处理器代来以根本不同的方式完成性能提升。大多数当前应用程序将不再受益于自由骑行，而无需重新设计。\n 对于近期未来，意味着未来几年，新芯片的性能收益将被三种主要方法推动，其中一个与过去相同。近期未来性能增长司机是： \nWarning: Can only detect less than 5000 characters\n从今天开始，性能午餐不再是免费的。 当然，每个人都可以继续适用的绩效增长，每个人都可以接收，主要感谢高速缓存大小改进。 但是，如果您希望您的应用程序受益于新处理器的持续指数吞吐量的进步，则需要成为一款写成良好的并发（通常是多线程）的应用程序。 而且，这比完成更容易，因为并非所有问题都是并行化的，因为并发编程很难。  我可以听到抗议的嚎叫：并发？ 那不是新闻！ 人们已经在编写并发应用程序。 这是真的。 一小部分开发人员。  请记住，人们在20世纪60年代后期至少在Simula的日子以来一直在做面向对象的编程。 但Oo没有成为一场革命  ...... ", "note_en": "The biggest sea change in software development since the OO revolution is knocking at the door, and its name is Concurrency.\n This article appeared in   Dr. Dobb&#39;s Journal, 30(3), March 2005. A much briefer version under the title  &#34;The Concurrency Revolution&#34; appeared in   C/C++ Users Journal, 23(2), February 2005.\n Update note: The CPU trends graph last updated August 2009 to include current \rdata and show the trend continues as predicted. The rest of this article \rincluding all text is still original as first posted here in December 2004.\n   Your free lunch will soon be over. What can you do about it? What  are you doing about it?\n The major processor manufacturers and architectures, from Intel and AMD to Sparc and PowerPC, have run out of room with most of their traditional approaches to boosting CPU performance. Instead of driving clock speeds and straight-line instruction throughput ever higher, they are instead turning  en masse to hyperthreading and multicore architectures. Both of these features are already available on chips today; in particular, multicore is available on current PowerPC and Sparc IV processors, and is coming in 2005 from Intel and AMD. Indeed, the big theme of the 2004 In-Stat/MDR Fall Processor Forum was multicore devices, as many companies showed new or updated multicore processors. Looking back, its not much of a stretch to call 2004 the year of multicore.\n And that puts us at a fundamental turning point in software development, at least for the next few years and for applications targeting general-purpose desktop computers and low-end servers (which happens to account for the vast bulk of the dollar value of software sold today). In this article, Ill describe the changing face of hardware, why it suddenly does matter to software, and how specifically the concurrency revolution matters to you and is going to change the way you will likely be writing software in the future.\n Arguably, the free lunch has already been over for a year or two, only were just now noticing.\n  Theres an interesting phenomenon thats known as Andy giveth, and Bill taketh away. No matter how fast processors get, software consistently finds new ways to eat up the extra speed. Make a CPU ten times as fast, and software will usually find ten times as much to do (or, in some cases, will feel at liberty to do it ten times less efficiently). Most classes of applications have enjoyed free and regular performance gains for several decades, even without releasing new versions or doing anything special, because the CPU manufacturers (primarily) and memory and disk manufacturers (secondarily) have reliably enabled ever-newer and ever-faster mainstream systems. Clock speed isnt the only measure of performance, or even necessarily a good one, but its an instructive one: Were used to seeing 500MHz CPUs give way to 1GHz CPUs give way to 2GHz CPUs, and so on. Today were in the 3GHz range on mainstream computers.\n The key question is: When will it end? After all, Moores Law predicts exponential growth, and clearly exponential growth cant continue forever before we reach hard physical limits; light isnt getting any faster. The growth must eventually slow down and even end. (Caveat: Yes, Moores Law applies principally to transistor densities, but the same kind of exponential growth has occurred in related areas such as clock speeds. Theres even faster growth in other spaces, most notably the data storage explosion, but that important trend belongs in a different article.)\n If youre a software developer, chances are that you have already been riding the free lunch wave of desktop computer performance. Is your applications performance borderline for some local operations? Not to worry, the conventional (if suspect) wisdom goes; tomorrows processors will have even more throughput, and anyway todays applications are increasingly throttled by factors other than CPU throughput and memory speed (e.g., theyre often I/O-bound, network-bound, database-bound). Right?\n  The good news is that processors are going to continue to become more powerful. The bad news is that, at least in the short term, the growth will come mostly in directions that do not take most current applications along for their customary free ride.\n Over the past 30 years, CPU designers have achieved performance gains in three main areas, the first two of which focus on straight-line execution flow:\n     Increasing clock speed is about getting more cycles. Running the CPU faster more or less directly means doing the same work faster.\n Optimizing execution flow is about doing more work per cycle. Todays CPUs sport some more powerful instructions, and they perform optimizations that range from the pedestrian to the exotic, including pipelining, branch prediction, executing multiple instructions in the same clock cycle(s), and even reordering the instruction stream for out-of-order execution. These techniques are all designed to make the instructions flow better and/or execute faster, and to squeeze the most work out of each clock cycle by reducing latency and maximizing the work accomplished per clock cycle.\n Chip designers are under so much pressure to deliver ever-faster CPUs that theyll risk changing the meaning of your program, and possibly break it, in order to make it run faster\n  Brief aside on instruction reordering and memory models: Note that some of what I just called optimizations are actually far more than optimizations, in that they can change the meaning of programs and cause visible effects that can break reasonable programmer expectations. This is significant. CPU designers are generally sane and well-adjusted folks who normally wouldnt hurt a fly, and wouldnt think of hurting your code normally. But in recent years they have been willing to pursue aggressive optimizations just to wring yet more speed out of each cycle, even knowing full well that these aggressive rearrangements could endanger the semantics of your code. Is this Mr. Hyde making an appearance? Not at all. That willingness is simply a clear indicator of the extreme pressure the chip designers face to deliver ever-faster CPUs; theyre under so much pressure that theyll risk changing the meaning of your program, and possibly break it, in order to make it run faster. Two noteworthy examples in this respect are write reordering and read reordering: Allowing a processor to reorder write operations has consequences that are so surprising, and break so many programmer expectations, that the feature generally has to be turned off because its too difficult for programmers to reason correctly about the meaning of their programs in the presence of arbitrary write reordering. Reordering read operations can also yield surprising visible effects, but that is more commonly left enabled anyway because it isnt quite as hard on programmers, and the demands for performance cause designers of operating systems and operating environments to compromise and choose models that place a greater burden on programmers because that is viewed as a lesser evil than giving up the optimization opportunities.\n Finally, increasing the size of on-chip cache is about staying away from RAM. Main memory continues to be so much slower than the CPU that it makes sense to put the data closer to the processorand you cant get much closer than being right on the die. On-die cache sizes have soared, and today most major chip vendors will sell you CPUs that have 2MB and more of on-board L2 cache. (Of these three major historical approaches to boosting CPU performance, increasing cache is the only one that will continue in the near term. Ill talk a little more about the importance of cache later on.)\n  A fundamentally important thing to recognize about this list is that all of these areas are concurrency-agnostic. Speedups in any of these areas will directly lead to speedups in sequential (nonparallel, single-threaded, single-process) applications, as well as applications that do make use of concurrency. Thats important, because the vast majority of todays applications are single-threaded, for good reasons that Ill get into further below.\n Of course, compilers have had to keep up; sometimes you need to recompile your application, and target a specific minimum level of CPU, in order to benefit from new instructions (e.g., MMX, SSE) and some new CPU features and characteristics. But, by and large, even old applications have always run significantly fastereven without being recompiled to take advantage of all the new instructions and features offered by the latest CPUs.\n    CPU performance growth as we have known it hit a wall two years ago. Most people have only recently started to notice.\n You can get similar graphs for other chips, but Im going to use Intel data here. Figure 1 graphs the history of Intel chip introductions by clock speed and number of transistors. The number of transistors continues to climb, at least for now. Clock speed, however, is a different story.\n   Figure 1: \r\tIntel CPU Introductions (graph updated August 2009; article text original \r\tfrom December 2004)\n    Around the beginning of 2003, youll note a disturbing sharp turn in the previous trend toward ever-faster CPU clock speeds. Ive added lines to show the limit trends in maximum clock speed; instead of continuing on the previous path, as indicated by the thin dotted line, there is a sharp flattening. It has become harder and harder to exploit higher clock speeds due to not just one but several physical issues, notably heat (too much of it and too hard to dissipate), power consumption (too high), and current leakage problems.\n Quick: Whats the clock speed on the CPU(s) in your current workstation? Are you running at 10GHz? On Intel chips, we reached 2GHz a long time ago (August 2001), and according to CPU trends before 2003, now in early 2005 we should have the first 10GHz Pentium-family chips. A quick look around shows that, well, actually, we dont. Whats more, such chips are not even on the horizonwe have no good idea at all about when we might see them appear.\n Well, then, what about 4GHz? Were at 3.4GHz alreadysurely 4GHz cant be far away? Alas, even 4GHz seems to be remote indeed. In mid-2004, as you probably know, Intel first delayed its planned introduction of a 4GHz chip until 2005, and then in fall 2004 it officially abandoned its 4GHz plans entirely. As of this writing, Intel is planning to ramp up a little further to 3.73GHz in early 2005 (already included in Figure 1 as the upper-right-most dot), but the clock race really is over, at least for now; Intels and most processor vendors future lies elsewhere as chip companies aggressively pursue the same new multicore directions.\n Well probably see 4GHz CPUs in our mainstream desktop machines someday, but it wont be in 2005. Sure, Intel has samples of their chips running at even higher speeds in the labbut only by heroic efforts, such as attaching hideously impractical quantities of cooling equipment. You wont have that kind of cooling hardware in your office any day soon, let alone on your lap while computing on the plane.\n  There aint no such thing as a free lunch. R. A. Heinlein,  The Moon Is a Harsh Mistress\n Does this mean Moores Law is over? Interestingly, the answer in general seems to be no. Of course, like all exponential progressions, Moores Law must end someday, but it does not seem to be in danger for a few more years yet. Despite the wall that chip engineers have hit in juicing up raw clock cycles, transistor counts continue to explode and it seems CPUs will continue to follow Moores Law-like throughput gains for some years to come.\n So a dual-core CPU that combines two 3GHz cores practically offers 6GHz of processing power. Right?\n Wrong. Even having two threads running on two physical processors doesnt mean getting two times the performance. Similarly, most multi-threaded applications wont run twice as fast on a dual-core box. They should run faster than on a single-core CPU; the performance gain just isnt linear, thats all.\n Why not? First, there is coordination overhead between the cores to ensure cache coherency (a consistent view of cache, and of main memory) and to perform other handshaking. Today, a two- or four-processor machine isnt really two or four times as fast as a single CPU even for multi-threaded applications. The problem remains essentially the same even when the CPUs in question sit on the same die.\n Second, unless the two cores are running different processes, or different threads of a single process that are well-written to run independently and almost never wait for each other, they wont be well utilized. (Despite this, I will speculate that todays single-threaded applications as actually used in the field could actually see a performance boost for most users by going to a dual-core chip, not because the extra core is actually doing anything useful, but because it is running the adware and spyware that infest many users systems and are otherwise slowing down the single CPU that user has today. I leave it up to you to decide whether adding a CPU to run your spyware is the best solution to that problem.)\n If youre running a single-threaded application, then the application can only make use of one core. There should be some speedup as the operating system and the application can run on separate cores, but typically the OS isnt going to be maxing out the CPU anyway so one of the cores will be mostly idle. (Again, the spyware can share the OSs core most of the time.)\n  The key difference, which is the heart of this article, is that the performance gains are going to be accomplished in fundamentally different ways for at least the next couple of processor generations. And most current applications will no longer benefit from the free ride without significant redesign.\n For the near-term future, meaning for the next few years, the performance gains in new chips will be fueled by three main approaches, only one of which is the same as in the past. The near-term future performance growth drivers are:\n     Hyperthreading is about running two or more threads in parallel inside a single CPU. Hyperthreaded CPUs are already available today, and they do allow some instructions to run in parallel. A limiting factor, however, is that although a hyper-threaded CPU has some extra hardware including extra registers, it still has just one cache, one integer math unit, one FPU, and in general just one each of most basic CPU features. Hyperthreading is sometimes cited as offering a 5% to 15% performance boost for reasonably well-written multi-threaded applications, or even as much as 40% under ideal conditions for carefully written multi-threaded applications. Thats good, but its hardly double, and it doesnt help single-threaded applications.\n Multicore is about running two or more actual CPUs on one chip. Some chips, including Sparc and PowerPC, have multicore versions available already. The initial Intel and AMD designs, both due in 2005, vary in their level of integration but are functionally similar. AMDs seems to have some initial performance design advantages, such as better integration of support functions on the same die, whereas Intels initial entry basically just glues together two Xeons on a single die. The performance gains should initially be about the same as having a true dual-CPU system (only the system will be cheaper because the motherboard doesnt have to have two sockets and associated glue chippery), which means something less than double the speed even in the ideal case, and just like today it will boost reasonably well-written multi-threaded applications. Not single-threaded ones.\n Finally, on-die cache sizes can be expected to continue to grow, at least in the near term. Of these three areas, only this one will broadly benefit most existing applications. The continuing growth in on-die cache sizes is an incredibly important and highly applicable benefit for many applications, simply because space is speed. Accessing main memory is expensive, and you really dont want to touch RAM if you can help it. On todays systems, a cache miss that goes out to main memory often costs 10 to 50 times as much getting the information from the cache; this, incidentally, continues to surprise people because we all think of memory as fast, and it is fast compared to disks and networks, but not compared to on-board cache which runs at faster speeds. If an applications working set fits into cache, were golden, and if it doesnt, were not. That is why increased cache sizes will save some existing applications and breathe life into them for a few more years without requiring significant redesign: As existing applications manipulate more and more data, and as they are incrementally updated to include more code for new features, performance-sensitive operations need to continue to fit into cache. As the Depression-era old-timers will be quick to remind you, Cache is king.\n (Aside: Heres an anecdote to demonstrate space is speed that recently hit my compiler team. The compiler uses the same source base for the 32-bit and 64-bit compilers; the code is just compiled as either a 32-bit process or a 64-bit one. The 64-bit compiler gained a great deal of baseline performance by running on a 64-bit CPU, principally because the 64-bit CPU had many more registers to work with and had other code performance features. All well and good. But what about data? Going to 64 bits didnt change the size of most of the data in memory, except that of course pointers in particular were now twice the size they were before. As it happens, our compiler uses pointers much more heavily in its internal data structures than most other kinds of applications ever would. Because pointers were now 8 bytes instead of 4 bytes, a pure data size increase, we saw a significant increase in the 64-bit compilers working set. That bigger working set caused a performance penalty that almost exactly offset the code execution performance increase wed gained from going to the faster processor with more registers. As of this writing, the 64-bit compiler runs at the same speed as the 32-bit compiler, even though the source base is the same for both and the 64-bit processor offers better raw processing throughput. Space is speed.)\n But cache is it. Hyperthreading and multicore CPUs will have nearly no impact on most current applications.\n So what does this change in the hardware mean for the way we write software? By now youve probably noticed the basic answer, so lets consider it and its consequences.\n  In the 1990s, we learned to grok objects. The revolution in mainstream software development from structured programming to object-oriented programming was the greatest such change in the past 20 years, and arguably in the past 30 years. There have been other changes, including the most recent (and genuinely interesting)  naissance of web services, but nothing that most of us have seen during our careers has been as fundamental and as far-reaching a change in the way we write software as the object revolution.\n  Starting today, the performance lunch isnt free any more. Sure, there will continue to be generally applicable performance gains that everyone can pick up, thanks mainly to cache size improvements. But if you want your application to benefit from the continued exponential throughput advances in new processors, it will need to be a well-written  concurrent (usually multithreaded) application. And thats easier said than done, because not all problems are inherently parallelizable and because concurrent programming is hard.\n I can hear the howls of protest: Concurrency? Thats not news! People are already writing concurrent applications. Thats true. Of a small fraction of developers.\n Remember that people have been doing object-oriented programming since at least the days of Simula in the late 1960s. But OO didnt become a revolution\n......", "posttime": "2021-06-29 22:35:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,软件,午餐,lunch,cpu", "title": "免费午餐结束：在软件中对并发的根本转向（2005） ", "title_en": "The free lunch is over: a fundamental turn toward concurrency in software (2005)", "transed": 1, "url": "http://www.gotw.ca/publications/concurrency-ddj.htm", "via": "", "real_tags": ["免费", "软件", "午餐", "lunch", "cpu"]}, {"category": "", "categoryclass": "", "imagename": "77439563f3226e3623b6ec7772bd0d99.png", "infoid": 1068450, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它可以处理MKDIR / RMDIR / LN等常规文件操作，但写入FileSdoes不存储任何数据。但是，文件大小保存，因此从文件读取的读取表现类似于/ dev / zot feed的固定大小。\n 写作和读数基本上是一个笨蛋，因此它可以用于使用需要目录结构的应用程序进行性能。实现了arkernel模块，而不是使用熔丝，绝对没有从用户到内核空间的开销福音应用数据，同时执行写入orread操作。\n   ＃makemake -c /llib/modules/4.18.5/build m = / home / abi / lwnfs modulesmake [1]：输入目录＆＃39; /usr/src/linux-headers-4.18.5&#39;构建模块，阶段2. ModPost 1 ModulesMake [1]：离开目录＆＃39; /usr/src/linux-headers-4.18.5&#39; #sinmod nullfs.ko＃mkdir / sinkhole＃mount -t nullfs none /污水孔/ #mkdir / sinkhole / testdir＃touch / sinkhole / testdir / myfile＃echo foobar＆gt; / sinkhole / testdir / myfile＃ls -lah / sinkhole / testdir / myfile-rw-r  -  r-- 1根root 0 11月20:17 / sinkhole / testdir / myfile＃cat / sinkhole / testdir / myfile #pv ＆lt; / dev / zero＆gt; /sinkhole/testdir/myfile11.1gib 0:00:04 [3.85GIB / s] [＆lt; =＆gt; ]＃cat / sinkhole / testdir / myfile＃\n  ＃dd if = / dev / zer = / nullfs / data bs = 1m count = 20＃20 + 0记录＃20 + 0记录掉＃20971520字节（21 MB，20 MIB）复制，0.00392452 s，5.3 gb / s＃stat -c％s / nullfs / data＃20971520\n 从文件中读取不会将任何内容复制到用户空间，并且是一个难道;使它表现得像读取/ dev / zero：\n ＃dd if = / nullfs / data of = / tmp / realfile＃40960 + 0记录在＃40960 + 0记录＃20971520字节（21 MB，20 MIB）复制，0.0455288 S，461 MB / S＃Hexdump -C / TMP / REALFILE＃00000000 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 | ................ |\n  有可能从野兔中排除发送到void的某些文件。例如，如果文件匹配＆＃34; fstab＆＃34;应该保存在记忆中，一个可以用＆＃34坐在纽伦布;写=＆＃34;选项。 \n＃mount -t nullfs none / sinkhole / -o write = fstab＃cp / etc / fstab / sinkhole / #wc -l / sinkhole / fstab 14 / sinkhole / fstab #cp / etc / passwd / sinkhole /＃wc -l / 污水/通过0 /污水/段  另一种选择是使用sysfs界面来更改Fallude String，模块已加载：  请记住，文件数据保存在内存中，没有完成边界检查，因此这可能会填满您的RAM，以防您将BeeingNulled的大文件排除在内。  -O mode =在挂载目录上设置权限（mount .. -o mode = 777）-o uid =在挂载目录上设置uid（mount .. -o uid = 1000）-o gid =在挂载目录上设置gid（挂载。 。-o gid = 1000）  用真实的替换simple_statfs呼叫，显示在内核模块负载期间通过的目录的可用空间 ", "note_en": "It can handle regular file operations like mkdir/rmdir/ln but writing to filesdoes not store any data. The file size is however saved, so reading from thefiles behaves like reading from /dev/zero with a fixed size.\n Writing and reading is basically an NOOP, so it can be used for performancetesting with applications that require directory structures. Implemented askernel module, instead of using FUSE, there is absolutely no overhead forcopying application data from user to kernel space while performing write orread operations.\n   # makemake -C /lib/modules/4.18.5/build M=/home/abi/lwnfs modulesmake[1]: Entering directory &#39;/usr/src/linux-headers-4.18.5&#39; Building modules, stage 2. MODPOST 1 modulesmake[1]: Leaving directory &#39;/usr/src/linux-headers-4.18.5&#39;# insmod nullfs.ko # mkdir /sinkhole# mount -t nullfs none /sinkhole/# mkdir /sinkhole/testdir# touch /sinkhole/testdir/myfile# echo foobar &gt; /sinkhole/testdir/myfile# ls -lah /sinkhole/testdir/myfile-rw-r--r-- 1 root root 0 Nov 8 20:17 /sinkhole/testdir/myfile# cat /sinkhole/testdir/myfile# pv &lt; /dev/zero &gt; /sinkhole/testdir/myfile11.1GiB 0:00:04 [3.85GiB/s] [ &lt;=&gt; ] # cat /sinkhole/testdir/myfile#\n  # dd if=/dev/zero of=/nullfs/DATA bs=1M count=20# 20+0 records in# 20+0 records out# 20971520 bytes (21 MB, 20 MiB) copied, 0.00392452 s, 5.3 GB/s# stat -c%s /nullfs/DATA# 20971520\n Reading from the files does not copy anything to userspace and is an NOOP;makes it behave like reading from /dev/zero:\n # dd if=/nullfs/DATA of=/tmp/REALFILE# 40960+0 records in# 40960+0 records out# 20971520 bytes (21 MB, 20 MiB) copied, 0.0455288 s, 461 MB/s# hexdump -C /tmp/REALFILE# 00000000 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 |................|\n  There is the possiblity to exclude certain files from beeing sent into the void.For example if the file matching &#34;fstab&#34; should be kept in memory, one can mountnullfs with the &#34;write=&#34; option.\n # mount -t nullfs none /sinkhole/ -o write=fstab# cp /etc/fstab /sinkhole/# wc -l /sinkhole/fstab 14 /sinkhole/fstab# cp /etc/passwd /sinkhole/# wc -l /sinkhole/passwd 0 /sinkhole/passwd\n Another option is using the sysfs interface to change the exclude stringafter the module has been loaded:\n  Keep in mind that file data is kept in memory and no boundary checks are done,so this might fill up your RAM in case you exclude big files from beeingnulled.\n       -o mode= set permissions on mount directory ( mount .. -o mode=777 ) -o uid= set uid on mount directory ( mount .. -o uid=1000 ) -o gid= set gid on mount directory ( mount .. -o gid=1000 )\n  replace simple_statfs call with real one, show free space of a directory thatcan be passed during kernel module load", "posttime": "2021-06-29 22:35:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟,virtual,sinkhole", "title": "nullfs：虚拟黑洞文件系统，其行为如/ dev / null ", "title_en": "Nullfs: A virtual black hole file system that behaves like /dev/null", "transed": 1, "url": "https://github.com/abbbi/nullfsvfs", "via": "", "real_tags": ["虚拟", "virtual", "sinkhole"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068449, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创造  帐户 ", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2021-06-29 22:35:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "扰乱,disrupt,创造", "title": "工程师可以扰乱气候变化 ", "title_en": "Engineers can disrupt climate change", "transed": 1, "url": "https://spectrum.ieee.org/energy/renewables/engineers-you-can-disrupt-climate-change", "via": "", "real_tags": ["扰乱", "disrupt", "创造"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068448, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于YouTube是主导的视频平台，因此对其版权声明系统已经有很多。大多数人都与关于构成公平使用的问题（例如，在电影评论中）。 Google的AI主要培训，以认识到您的视频中内容的存在或非存在，而不是您的使用是否公平（顺便说一下司法管辖区之间的东西）。但是我将在这里讨论的是更清晰的：公共领域音乐的表现。\n 虽然新的组合物肯定是艺术的优点，但也有很多我们喜欢表演现有的古典音乐。幸运的是，在美国，在公共领域有很多。堕落的版权依赖于该国的界限，但几乎在十九世纪和早些时候发表的一切都是免费的，因为每个人都可以使用。\n 不幸的是，谷歌似乎不知道这一事实。最近，我上传了陪审团向youtube制作了吉尔伯特和沙利文的审判，它立即受到四个版权索赔的命中。我去比赛他们 - 我以前做过这种事情，始终为公共领域的音乐成功 - 但这真的不应该是必要的。审判是在19世纪70年代发表的第一次出版。吉尔伯特和沙利文分别于1911年和1900年去世。据我所知，这个歌剧不是世界上任何地方的版权。\n 当然，虽然音乐肯定在公共领域，但新录音肯定是版权。如果我上传了一个受版权保护的D'Oyly Carte公司的审判，我会期待版权声明 - 这是完全合理的。但这不是我做的！事实上，我上传的录音是一个完全新的（我涉及的人）。也许它与另一种表现感到困惑？不！ YouTube将四个部分标记为使用“受版权保护的”歌曲的旋律 - 但我所谓的侵犯的所有组合都只是审判的数字！\n 所以AI很好。它正确识别了我使用的内容，并且我使用谷歌版权组成数据库的旋律上传了新的录音。唯一的问题是这些旋律尚未得到版权。\n 谷歌可以解决这个问题吗？大概。这样做的一种方法可以是通过制作公共领域的组成数据库（一种用于攻击版权标记器的公共域名标记），但这将是一个艰难的事业。更简单的是从贡献者到受版权保护的组合数据库的一些最小信息，例如Composer，店主（适用），出版日期等。\n 当然，谷歌不太可能做任何类型的事情，因为他们没有真正的理由公平地对待公共领域音乐的表演者：我们无法苏因为我们对我们的视频进行了版权声明，而出版商可以起诉由于版权侵权（并且足够公平，当他们实际上拥有版权）。因此，直到30天的上诉期限（上诉到索赔人！）到期，一些版权巨魔正在赚钱，从我们的新生产公共领域歌剧运行。甚至更具版权的巨魔肯定是在那里制作可能是一个可能的金额，他们绝对不拥有不对此索赔（或者不知道如何）的人。多可惜。 ", "note_en": "Since YouTube is the dominant video platform, a lot has already been said about its copyright claims system. Most of that has had to do with questions about what constitutes fair use (in movie reviews, for instance). Google’s AI is mostly trained to recognize the presence or non-presence of content in your video, not whether or not your use is fair (something that varies between jurisdictions, by the way). But what I’m going to discuss here is much more clear-cut: the performance of public domain music.\n While there’s certainly artistic merit in new compositions, there are also a lot of us who enjoy performing existing classical music. Luckily for us, there’s lots of that in the public domain. The boundaries of what’s fallen out of copyright depend on the country, but virtually everything published in the nineteenth century and earlier is free for everyone to use.\n Unfortunately, Google seems not to be aware of this fact. Recently, I uploaded a production of Gilbert and Sullivan’s   Trial by Jury to YouTube, and it instantly got hit by four copyright claims. I went to go contest them — something I’ve done before for this kind of thing, and always with success for public domain music — but that really shouldn’t be necessary.  Trial was first published in the 1870s. Gilbert and Sullivan died in 1911 and 1900, respectively. As far as I know, this opera isn’t under copyright anywhere in the world.\n Of course, while the music is definitely in the public domain, new recordings can definitely be under copyright. If I’d uploaded a copyrighted D’Oyly Carte Company performance of  Trial, I’d expect a copyright claim — it’d be totally justified. But that’s not what I did! In fact, the recording I uploaded was an entirely new one (in which I was myself involved). Maybe it got confused with another performance? Nope! YouTube flagged four segments as  using the melody of “copyrighted” songs — but all the compositions on which I had supposedly infringed were just numbers from  Trial!\n So the AI is good. It correctly identified what I was using, and that I’d uploaded a new recording using a melodies from Google’s database of copyrighted compositions. The only problem is that these melodies  aren’t copyrighted.\n Could Google fix this? Probably. One way to do this could be by producing a database of public domain compositions (a sort of public domain flagger to face off against the copyright flagger), but this would be a difficult undertaking. Much simpler would be requiring some minimal information from contributors to the database of copyrighted compositions, such as composer, librettist (when applicable), publication date and so on.\n Of course, Google isn’t likely to do anything of the sort, since they have no real reason to treat performers of public domain music fairly: we can’t sue just because we got a copyright claim against our video, while publishers can sue for copyright infringement (and fair enough, when they actually hold a copyright). So, until the 30-day appeal period (appeals are to the claimant!) expires, some copyright troll is making money off of ads running on our new production of a public domain opera. And even more copyright trolls are definitely out there making what is likely a substantial amount of money off of stuff they definitely don’t own from people who don’t contest the claims (or don’t know how to). What a shame.", "posttime": "2021-06-29 22:35:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,版权", "title": "亲爱的谷歌：存在公共领域的作品 ", "title_en": "Dear Google: Public domain compositions exist", "transed": 1, "url": "https://blog.dbmiller.org/2021-06-28-dear-google-public-domain-compositions-exist", "via": "", "real_tags": ["google", "谷歌", "版权"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068447, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个博客文章中我们＆＃39; ll涵盖系统如何形成集群，实际上是什么集群以及他们的职责是什么。我们＆＃39; LL还呈现了不同的协议，以满足与他们相关的各种权衡的群集的需求。\n 为了使这个博客发表一点更实用，我们也会深入了解了众议员协议之一 - 从游泳首字母缩略词中的一个隶属协议 - 从理论上的角度来看，在F＃中实现了示例。\n  从用户的角度来看，群集应该用作A＆＃34;单机＆＃34的幻觉;并将其免于与 - 通常动态变化 - 互联服务器网络的所有复杂性安全。\n 正如事实证明，那里的一系列协议和责任是群集的一部分需要解决以维持这种幻觉。走下自下而上，这里是我们集群通常需要知道如何回答的一些问题：\n 如何加入群集？通常，当我们有一个我们想要加入群集的新服务器节点时，它需要知道如何与已有群集本身的一部分的另一个节点通信。哪里可以找到这个信息？它＆＃39;是需要回答的问题：最简单的诀窍是为新服务开始时提供的配置参数提供静态的联系点列表。\n 另一种方法是使用第三方服务（如数据库，Scenul，etcd或zookeeper）用作节点注册表。我们的集群通常不会生活在真空中，有时我们可以重复使用其他已经建立的服务以获得优势。\n 在某些情况下，我们可以利用低层Kubernetes DNS服务或MDNS的功能 - 特定于主机环境，以动态发现生活在同一网络中的其他设备。 \n我们如何知道其他节点是群集的一部分？这是所谓的会员协议的区域，我们＆＃39; ll焦点在本博客文章的第二部分。在动态集群中，它通常通过跟踪活动发现的节点来完成，然后在节点连接/离开群集时更新和闲置它们。这里的许多决定依赖于部署方案 - 在同一数据中心内形成群集的服务具有不同的特征，从例如eg。移动设备的网格。在托管在同一数据中心托管的常见后端服务的情况下，每个节点都会保持有关群集状态的完整信息。这就是游泳操作的协议。\n 其他成员资格协议（如hyparview）启用只能在群集中映像。如果我们的群集在更高的尺度上操作时，则这是优选的。成千上万的节点（通常生活在数据中心的大多数集群服务Don＆＃39; t达到几十多个服务器）。\n 我们如何将消息从一个节点发送到另一个节点？这通常也与隶属协议有关。大多数以数据中心为导向的系统可以保守假设系统中每个节点都可以连接到每个其他节点，形成（潜在地）完全连接的网格。\n 在其他场景中，我们需要考虑到某些节点可能无法连接到其他节点 - 因为网络特征潜在的网络特征。虽然当我们谈论群集协议时，最常见的情况是客户服务器架构，但常常需要应用更高级的方案（如我们所提到的，＆＃34;服务器＆＃34;本身不是单一的实体）。\n 我们如何检测到死区？也称为失败检测。该领域最古老的知识是每立即在预期超时边界内的Ping🡘ACK消息的简单交换，或者只是期望在给定时间间隔内发送心跳消息。心跳通常直接进入运输层（如TCP），有时是我们＆＃39;重新能够直接捎带失败探测器。该解决方案的缺点是，虽然运输层本身是响应的 - 因为它通常由底层操作系统管理 - 我们的应用层实际上不是（例如，因为它无限期地挂起了僵化的僵局）。另一件事是网络连接的时间失败并不是意味着，那个节点赢得了＆＃39; t试着重新启动并继续工作。\n 更常见的是，会员协议促进自己的心跳算法。什么＆＃39;在这里值得注意，缺少心跳并不一定意味着，我们的节点已经死亡。它也可能不堪重负，提供其他传入请求。像Phi Accuctuct Dector或Lifeguard这样的现代算法（上面提到的游泳协议的扩展）考虑到这一行为。\n 这些是最基本的问题需要知道如何回答。我们可以称之为任何群集的第0层。本博客文章的主要部分将涵盖如何实施解决这些问题的协议。在它之上，还有许多其他更高的级别功能，旨在解决以下问题： \n我们如何检测/响应定期网络分区？通常被称为分裂性情景的问题。它来自基本观察，即它＆＃39;■不可能在网络边界中区分死区。它可以导致风险非常危险的情况，比如将我们的集群分成两个，每个人都相信，它＆＃39;唯一一个活着，导致数据不一致甚至腐败。没有一个简单的治疗方法，那就是为什么一些系统（如akka.net分裂大脑resolvers）根据我们关心的权衡提供不同的策略。\n 不同的节点如何推理和决定群集中的状态？这种情况通常在负责数据管理（如分布式数据库）的系统中是常见的。由于节点必须能够为传入请求提供服务，因此有时它们可​​能会遇到对系统状态的冲突决策。在没有过多的细节中，两个通用方法两个问题是：避免冲突，这通常假设节点必须在提交决策之前建立关于系统状态的共识。它通常需要建立（和维护）节点之间的一些领导者，通过仲裁节点或两者组合同步。这是筏，ZAB或Paxo等流行协议的区域。\n 解决接受国家冲突的可能性出现的冲突 - 主要是在长期延迟或周期性地发生的权衡或定期无法访问的服务器中进行的权衡 - 但是以足够的元数据丰富，使得所有节点可以单独达到与结果状态的相同结论共识。这是一个主导地区的免除自由复制数据类型，您可以读取eg。在这里发布的博客文章中。\n 如何将请求路由到集群内部的给定资源？我们的系统状态通常由多种可寻址实体组成 - 通常复制，以便更高的可用性和弹性。然而，通常整个状态太大，无法适合任何一个节点。出于这个原因，它经常动态地在整个群集中划分。现在恳求一个问题：如何告诉，哪个节点包含一些虚拟键标识的实体？天真的方法是询问一些节点的子集希望，其中至少有一个将有我们希望的数据。给定群集的N个节点和实体复制了R次，我们应该能够在调用（n / r）+1节点后到达我们的资源。\n 更常见的方式是保留注册表，该注册表具有有关系统中每个单个实体的当前本地化的信息。由于这种方法并不展示，在实践中，我们在实践中，在分区中组合并将实体共同定位在一起，因此压缩了注册表以存储有关整个分区的信息而不是单个实体。在这种情况下，资源ID是（PartitionD，EntityID）的复合键。这是如何。 akka.cluster.arding或Riak核心作品。通常可以在每个节点上缓存一些热（常用）分区的一些子集，以便减少询问中央注册表甚至注册表本身可以是复制的商店。\n 我们还可以使用分布式哈希表 - 散列我们的实体密钥，然后映射到特定节点，该节点负责将属于关键空间的特定空间子集的资源（所有可能的哈希值的范围）。有时这可能意味着，首先尝试我们错过节点。因为群集状态正在发生变化，因此需要应用更多跳跃。 Microsoft Orleans和Cassandra使用该方法是流行的解决方案。\n 正如你所看到的，即使我们没有问过所有的问题，那里有很多事情发生了很多事情，并且可以根据我们的系统愿意采取的权衡来解决不同的方法。 \n在那里＆＃39;今天的机会在未来做出一个单独的文章，今天我们＆＃39; ll完全专注于游泳 - 在领事和持续几年中的系统中的系统中使用 - 如它＆＃39 ;很容易实现良好的开始。为了提高其弹性，减少假阳性故障检测，结账关于救生员的谈判 - 一系列关于原始游泳协议的扩展和观察。\n   新节点想要加入群集 - 如何使其发生，以及如何在群集中通知关于该事件的其他节点？\n  节点突然终止或者无法达到任何更长。如何检测到其他事实的信息？\n 虽然前两种情况很容易，但所有的复杂性都带有第三种情况。我们需要发现节点是否无法达到，但是＆＃39; s还不够 - 由于临时网络故障可能发生在同一数据中心内，他们通常会迅速愈合。我们不想恐慌并将节点扔出群集，因为我们可以在分开第二个中达到它。这将导致非常摇摇欲坠和脆弱的集群。\n 我们已经提到了心跳机制 - 每一个现在，然后我们将ping消息发送到其他随机节点。预计此节点将在预期超时之前用ACK回答。简单的。\n  现在，如果节点没有在超时回应的情况下会发生什么？正如我们所说，我们不想过度反应。所以我们不要考虑这个节点已经死了。相反，我们认为它是怀疑并告知别人我们的怀疑。接收嫌疑八卦的其他节点预计它将在指定的超时中确认 - 否则他们将考虑一个恶作剧，并从其疑似列表中删除节点。\n  现在我们所需要的只是确认 - 为了这样做，我们需要向别人询问别人进行验证。所以我们＆＃39;重新选择另一个未经用的节点，并要求它为我们的ping嫌疑人（此请求被称为ping-req）。现在，如果该调解员从嫌疑人那里收到ACK，我们知道节点是活着的，只是我们的网络连接被切断了原因： \n在另一边，如果我们的调解员也没有收到Ack，我们现在有两只手验证，节点对大量时间框架无响应 - 因此它可以确认为每个人死亡。\n  当然这一点并不意味着节点确实死了 - 一个转义机制是，如果怀疑将获得关于自己的可疑通知，它可以通过广播活动来覆盖它。可能有不同的原因，为什么怀疑＆＃39; t按时回应：它可能太占用（由其他请求的积压或ev。停止 - 世界垃圾收集的底层VM）。也可能发生，我们的网络分开了分开的集群 - 这种现象被称为分裂性。\n 最终没有办法保证100％可靠的故障检测。我们＆＃39;重新交易合理的错误失败比，我们如何迅速地检测到节点作为死亡 - 通常这两个目标相互互相努力。在游泳方面，我再次建议查找救生员，该救生员地解决了一些提到的方案。然而，我们＆＃39; LL在下面的实施中没有涵盖它，以保持简洁。\n  现在，我们＆＃39;重新实际实施该协议。为了这样做＆＃39;重新应用一些简化 - 我们＆＃39; ll这样做，使协议更容易理解：\n 一般来说要关联特定请求/响应消息，我们应该使用某种形式的序列号。这可能导致场景，当A向B发送Ping1请求时，其与Ack1响应，一段时间后者将另一个Ping2发送到B并接收Ack1回来 - 问题是它不能告诉该消息的问题是为了确认这条消息。这种情况非常罕见，但不是不可能的。如果也可能导致＆＃34;复活和＃34;死亡节点。\n 虽然我们＆＃39;重新进入肩背上的肩带 - 像纸张暗示 - 我们每次都只是八卦整个会员国。它不是最优越的方式，但它＆＃39; ll工作足够好。\n PS：避免使用每个八卦发送整个状态的其他方式是计算当前节点成员身份视图的一致哈希，并将该散列放在ping内而不是完整视图。这样我们的ping就会携带哈希值，这是响应者可以与自己状态的哈希相比。只有当哈希不同（大多数时间都有大部分时间的集群，他们在他们不时的时间和＃39; t），我们＆＃39;重新将会员状态放在Ack之上。 \n此处使用的代码可在本发明员中提供，我建议使用，如我们＆＃39; LL在这里不涵盖所有内容。\n  由于我们不想处理节点到节点通信的所有复杂性，我们＆＃39; LL只是在抽象之上构建一个模型，这将让我们评估算法，而不会导致解决其他问题。以下基本先决条件是：\n 一个传输层，让我们向另一个（可能远程）端点发送消息。我们希望处理管理网络连接或序列化详细信息。\n 可访问端点后面的代理，能够为多个请求提供服务并以线程安全方式更改其状态。\n 由于这些原因，我将使用Akka.net/Kkling和模拟我们的节点使用生活在同一过程中的演员。您可以轻松地采用它以通过Akka.Remote连接的不同演员系统。我们将此作为培训练习 - 在实践中，如果您想在Akka中使用群集，您已经在Akka.Cluster顶部建立了整个生态系统，这些生态系统都在处理会员资格 - 以及引言中提到的其他问题 - 适合您。\n 我们的演员将通过提供它的初始联系点列表来创建：这些是已知为群集的一部分的端点：\n 打开akklinguse sys = system.create＆＃34;游泳群和＃34; ＆lt; | configuration.parse config //在此示例中，其他//`b`是生活在其他节点上的其他//游泳集群成员的演员​​refs。让C =产卵系统＆＃34;节点B＆＃34; ＆lt; |道具（游泳.Membership [A; B]） \n为了创建该演员，我们需要处理加入过程。这个想法是我们＆＃39; ll尝试从提供的列表中挑选端点（它对应于Akka.Cluster中的种子节点地址）并向它们发送加入请求。如果群集节点演员将接收这样的请求，则＆＃39; s义务通过向所有群集成员发送加入响应（包括请求者）来接受它。\n 如果加入WORN和＃39; T到达，例如。因为我们错误地配置了我们的群集和其他端点，所以达到了＆＃39; t and＃39;我们等待一段时间并从列表中尝试另一个节点。这可以表示为：\n 让成员身份（种子：端点列表）（CTX：Actor＆lt; _＆gt;）=设态= {mylising = {endpoint = ctx.self} Active = set.empty嫌疑人= map.empty}（* actor代码的其余部分.. 。*）让REC加入州取消=演员{匹配！ ctx.receive（）与|职工[]  - ＆gt;返回停止//未能加入任何会员|职工（下一个::剩下） - ＆gt;下一个＆lt;加入State.Myself让Call取消= CTX.schedule Connectimeout CTX.Self（剩余剩余）返回！加入州取消|加入八卦 - ＆gt; CANCEL.CANCEL（）//取消加入超时返回！成为州八卦|当peer = statem.myself  - ＆gt; //建立新群集取消.Cancel（）//取消加入超时返回！成为州（set.singleton state.myself）| _  - ＆gt;返回未处理的}匹配种子| []  - ＆gt;成为州（set.singleton state.myself）|种子::剩下 - ＆gt;种子＆lt;加入State.Myself让Call = CTX.Schedule Connectimeout CTX.Self（剩余剩余）加入州取消\n 接收到加入的请求Actor将自己视为群集的操作成员，准备工作。从现在开始，它将触发自身，以定期检查其他人是否保持响应：\n 让合并八卦状态= {youst active = state.active + gossip}让berseready状态gossip = ctx.schedule pinginterval ctx.self nextround |＆gt;忽略就绪（合并八卦状态）\n 如前所述，在这种情况下，八卦只是一整套活动集群成员，而准备好是用于标准群集活动的演员行为：\n 让Recrade State =演员{匹配！ ctx.receive（）使用//其他消息处理程序| _  - ＆gt;返回未处理} \n由于我们从请求者方面覆盖了加入程序，因此为操作集群成员提供了：\n 比赛！ ctx.receive |.加入peer  - ＆gt;让Gossip = Set.Add Peer状态。Active Let Msg =加入八卦八卦|＆gt; set.remove state.myself |＆gt; set.iter（有趣的peer  - ＆gt; peer.endpoint＆lt; msg）返回！准备就绪{状态与active = gossip} |加入八卦 - ＆gt;返回！准备好（合并八卦状态）//其他处理程序\n 正如我们所说，一旦新成员试图加入，我们只需将我们的活动成员状态更新并将其汇报到加入消息中的所有其他成员，因此它们也可以更新。\n 现在，让＆＃39; s覆盖ping过程。首先，我们提到我们现在想要触发我们的会员，然后 - 当我们计划成比赛中的Nextround事件时，您可以看到。现在它如何工作？我们＆＃39;重新选择一个节点随机 - 除了当前的一个没有疑似（嫌疑人是＆＃39; t按时回复ping的节点） - 并向它发送ping请求。与此同时，我们还安排了该请求完成的超时：\n 让选择同行=匹配set.count对等体0  - ＆gt;没有|数 - ＆gt;让idx = threadlocalrandom.current.next计数一些（SEQ.ITEM IDX对等体）让就绪状态= ACTOR {匹配！ ctx.receive（）与| nextround  - ＆gt; ctx.schedule pinginterval ctx.self nextround |＆gt;忽略让嫌疑人= state.suspects |＆gt; Map.Toseq |＆Gt; seq.map fst |＆gt; set.ofseq让别人=（set.remove state.myself state.active） - 嫌疑人//随意选择一个成员，除了自我而不是标记为怀疑匹配选择没有 - ＆gt;返回！就绪状态|一些同伴 - ＆gt; //将ping请求发送到该对等体和调度超时peer.endpoint＆lt; ping（state.active，ctx.self）让取消= ctx.schedule pingtimeout ctx.self（pingtimeout peer）让skiplist = set.ofArray [|州。同伴|]回来！准备{state with suspects = map.add peer（取消，waitpingack skiplist）state.suspects} | ping（八卦，发件人） - ＆gt; //回复传入ping ricking sender＆lt ;! Pingack（州.MYSELF，State.active）返回！准备好（合并八卦状态）//其他处理程序}\n 在这里，我们使用我们的嫌疑人映射来跟踪超时取消和跳过列表。什么＆＃39;跳过列表？我们很快掩盖了。正如我们所提到的那样，当Pingack＆＃39; t准时到达时，我们会选择另一个成员（随意）并要求它使用pingreq消息来为我们审视我们的嫌疑人。这样，我们试图在我们的故障检测算法中减轻假否定的风险：\n 让准备状态=演员{匹配！ ctx.receive（）与| Pingreq（嫌疑人，八卦，发件人） - ＆gt;让取消= ctx.schedule IndirectpingTimeout CTX.Self（PingTimeout Suspect）嫌疑次数.EndPoint＆lt; ping（state.active，ctx.self）退货！准备{Merge Gossip州与嫌疑人= map.add嫌疑人（取消，等待，等待reqack）state.suspects \n...... ", "note_en": "In this blog post we&#39;ll cover how systems form clusters, what clusters actually are and what are their responsibilities. We&#39;ll also present different protocols responsible to serve the needs of the clusters with a various tradeoffs associated with them.\n To make this blog post a bit more practical, we&#39;ll also go in depth of one of the membership protocols - known as under SWIM acronym - from theoretical standpoint up to example implementation in F#.\n  From a user perspective, cluster is supposed to serve as an illusion of a &#34;single machine&#34; and keep it  safe from all of complexity coming from communicating with - usually dynamically changing - network of interconnected servers.\n As it turns out, there&#39;s a multitude of protocols and responsibilities that services being a part of cluster need to solve to maintain that illusion. Going bottom-up, here are some of the questions our cluster usually needs to know how to answer for:\n How to join the cluster? Usually when we have a new server node, which we want to join to the cluster, it needs to know how to communicate with another node that&#39;s already part of the cluster itself. Where can it find that information? It&#39;s the question that needs to be answered: The simplest trick is to provide a static list of contact points as a configuration parameter provided at the start of new service.\n Another way is to use 3rd party service (like database,  Consul,  etcd or  ZooKeeper) to serve as a node registry. Our cluster usually doesn&#39;t live in vacuum, and sometimes we can reuse other already established services for our advantage.\n In some situations, we could leverage capabilities of lower layers - like  Kubernetes DNS service or  mDNS - that are specific to a host environment to dynamically discover other devices living in the same network.\n How do we know what other nodes are part of the cluster? This is area of so called membership protocols on which we&#39;ll focus in second part of this blog post. In dynamic clusters it&#39;s usually done by keeping track of a active discovered nodes, then updating and gossiping them once a node joins/leaves the cluster. A lot of decisions here depend on deployment scenario - services forming a cluster within the same datacenter have different characteristics from eg. meshes of mobile devices. In cases of common backend services hosted in the same datacenter, each node keeps a full information about the state of the cluster. This is how protocols like  SWIM operate.\n Other membership protocols (like  HyParView) enable to have only partial view on the cluster. This is preferable in cases when our cluster operates on much higher scale eg. thousands of nodes (usually most clustered services living in datacenters don&#39;t reach over dozens-to-hundreds of servers).\n How do we send messages from one node to another? This usually is also related to a membership protocol. Most datacenter-oriented systems can make conservative assumption that every node in the system can connect to every other node, forming (potentially) a fully connected mesh.\n In other scenarios, we need to take into account that some of the nodes may not be able to connect to others - because of the underlying network characteristics. While the most common case of that is client-server architecture, when we&#39;re talking about cluster protocols, often more advanced scenarios need to be applied (as we mentioned, &#34;server&#34; itself is not a single entity).\n How do we detect dead nodes? Also known as failure detection. The oldest known trick in that area is a simple exchange of PING 🡘 ACK messages within expected timeout boundaries every now and then, or simply expecting every connection to send a heartbeat message within given time interval. Heartbeats are often implemented directly into transport layer (like TCP), sometimes we&#39;re able to piggyback failure detector directly on top of it. Downside of that solution is that while transport layer itself is responsive - because it&#39;s usually managed by underlying OS - our application layer could in fact be not (eg. because it hangs deadlocked indefinitely). Another thing is that temporal failure of network connection doesn&#39;t has to mean, that node won&#39;t try to restart it and continue to work.\n More often, membership protocols promote their own heartbeat algorithms. What&#39;s worth noticing here, missing heartbeat doesn&#39;t necessarily mean, that our node is dead. It could as well be overwhelmed with serving other incoming requests. Modern algorithms like  Phi accural failure dector or  Lifeguard (an extension to SWIM protocol mentioned above) take that behavior into account.\n These are the most basic questions cluster needs to know how to answer. We could call it a layer 0 of any cluster. The main part of this blog post will cover how to implement protocol addressing these issues. On top of it, there are many other higher level features, aiming to solve problems like:\n How can we detect/respond to periodic network partitions? A problem often known as  split-brain scenario. It comes from basic observation that  it&#39;s not possible to differentiate dead node from unresponsive one over network boundary. It can lead to very risky situations, like splitting our cluster in two, each one believing, it&#39;s the only one alive and causing data inconsistency or even corruption. There&#39;s no one simple cure for that, that&#39;s why some systems (like  Akka.NET split brain resolvers) offer different strategies depending on the tradeoffs, that we care for.\n How different nodes can reason and decide about the state in the cluster? This case is usually common in systems that are responsible for data management (like distributed databases). Since nodes must be able to serve incoming requests, sometimes they may possibly run into making conflicting decisions about the state of the system. Without going into too much details, two generic approaches two this problem are: Avoiding conflicts, which usually assumes that nodes must establish consensus about state of the system before committing to their decisions. It usually requires establishing (and maintaining) some leader among the nodes, synchronizing via quorum of nodes or combination of two. This is area of popular protocols such as  Raft,  ZAB or Paxos.\n Resolving conflicts which accepts the possibility of state conflict to appear - mostly as a tradeoff happening in face of long latencies or periodically unreachable servers - but enriches it with enough metadata so that all nodes individually can reach the same conclusion about the result state without need of consensus. This is a dominant area of Conflict Free Replicated Data Types, which you could read about eg. in a  blog post series published here.\n How to route requests to a given resource inside of cluster? The state of our system usually consists of multiple addressable entities - which are often replicated for higher availability and resiliency. However usually the entire state is too big to fit into any single node. For this reason it&#39;s often partitioned all over the cluster  dynamically. Now this begs a question: how to tell, which node contains an entity identified by some virtual key? Naive approach would be to ask some subset of nodes in hope that at least one of them will have a data we hope for. Given cluster of  N nodes and entity replicated  R times, we should be able to reach our resource after calling  (N/R)+1 nodes.\n More common way is to keep a registry having an information about current localization of every single entity in a system. Since this approach doesn&#39;t scale well, in practice we group and co-locate entities together within partitions and therefore compress the registry to store information about entire partition rather than individual entity. In this case resource ID is composite key of  (partitionID, entityID). This is how eg.  Akka.Cluster.Sharding or  riak core works. Frequently some subset of hot (frequently used) partitions may be cached on each node for to reduce asking central registry or even the registry itself may be a replicated store.\n We could also use  distributed hash tables - where our entity key is hashed and then mapped into specific node that is responsible for holding resources belonging to that specific subset of key space (a range of all possible hash values). Sometimes this may mean, that we miss node at first try eg. because cluster state is changing, and more hops need to apply.  Microsoft Orleans and Cassandra are popular solutions using that approach.\n As you can see, even though we didn&#39;t asked all questions, there&#39;s already a lot of things happening here and the same problems may be solved with different approaches depending on the tradeoffs our system is willing to take.\n While there&#39;s a chance to make a separate article about each of these in the future, today we&#39;ll focus solely on a  SWIM - used in systems such as Consul and hugely popularized over last few years - as it&#39;s easy to implement for a good start. To improve its resiliency and reduce false positive failure detection, checkout this talk about  Lifeguard - a set of extensions and observations about original SWIM protocol.\n   New node wants to join the cluster - how to make that happen and how to inform other nodes in the cluster about that event?\n  Node was abruptly terminated or cannot be reached any longer. How to detect that an inform others about the fact?\n While first two cases are pretty easy, all of the complexity comes with the third case. We need to discover if node cannot be reached, but that&#39;s not enough - since temporary network failures may happen even inside the same datacenter, they usually get healed fairly fast. We don&#39;t want to panic and throw the node out of the cluster just because we couldn&#39;t reach it in split second. This would lead to very shaky and fragile cluster.\n We&#39;ve already mentioned heartbeat mechanism - every now and then we&#39;re going to send a PING message to other random node. This node is expected to answer with ACK before expected timeout. Easy.\n  Now, what happens if node didn&#39;t respond under timeout? As we said, we don&#39;t want to overreact. So we don&#39;t consider this node dead yet. Instead we consider it to be  suspect and inform others about our suspicion. Other nodes that received suspect gossip expect it to be confirmed within specified timeout - otherwise they will consider it a hoax, and remove node from their suspected list.\n  Now all we need is confirmation - in order to do so, we need to ask someone else for verification. So we&#39;re going pick another unsuspected node and ask it to ping  suspect for us (this request is known as PING-REQ). Now if that mediator managed to receive ACK from the  suspect, we know that node is alive, just our network connection was severed for some reason:\n  On the other side, if our mediator didn&#39;t received ACK either, we now have two-hand verification that node is unresponsive for significant time frame - therefore it can be confirmed as dead to everyone.\n  Of course this doesn&#39;t mean that node is indeed dead - one escape mechanism is that if suspect will get a suspect notification about itself, it can override it by broadcasting alive message. There maybe different reasons, why  suspect didn&#39;t respond on time: it may be too occupied (either by backlog of other requests or eg. stop-the-world garbage collection of underlying VM). It may also happen, that our network have split the cluster apart - this phenomenon is known as a split-brain.\n Ultimately there&#39;s no way to ensure 100% reliable failure detection. We&#39;re just trading reasonable ratio of false failure and how quickly can we detect node as dead - usually these two goals work against each other. In terms of SWIM, I again recommend to lookup for  Lifeguard, which addresses some of the mentioned scenarios. However we&#39;ll not cover it in our implementation below to keep it succinct.\n  Now, we&#39;re going to actually implement that protocol. In order to do so we&#39;re going to apply some simplifications - we&#39;ll do so to make protocol easier to comprehend:\n In general to associate specific request/response messages, we should use some form of sequence numbers. This can result in scenario, when A sends PING1 request to B for which is responds with ACK1, some time later A sends another PING2 to B and receives ACK1 back - the problem was that it cannot tell which PING this message was acknowledgment for. This kind of situation is very rare, but not impossible. If may also lead to &#34;resurrecting&#34; dead nodes.\n While we&#39;re going to piggyback gossip on top of pings - like the paper suggests - we&#39;re simply  gossip entire membership state every time. It&#39;s not the most optimal way, but it&#39;ll work good enough.\n PS:  Other way of avoiding sending entire state with every gossip is to compute consistent hash of current node membership view and put that hash inside of ping instead of full view. This way our PING will carry just a hash value, which responder may compare with hash of its own state. Only if hashes differ (in clusters with small churn of nodes most of the time they don&#39;t), we&#39;re putting membership state on top of ACK.\n The code used here is available in  this gist, which I recommend to use, as we&#39;ll not cover everything here.\n  Since we don&#39;t want to deal with all complexities of node-to-node communication, we&#39;ll just build a model on top of abstractions, that will let us evaluate the algorithm without derailing into solving other problems. The basic prerequisites here are:\n A transport layer that will just let us send message to another (possibly remote)  endpoint. We don&#39;t want to deal with managing network connections or serialization details.\n An agent accessible behind the  endpoint, able to serve multiple requests and change its state in thread safe manner.\n For these reasons, I&#39;m going to use Akka.NET/Akkling and model our nodes using actors living in the same process. You can easily adopt it to different actor systems connected over Akka.Remote. We keep this as a training exercise - in practice if you want to use clusters in akka, you already have entire ecosystem built on top of Akka.Cluster, which handles membership - and other problems mentioned in introduction - for you.\n Our actor will be created by providing it an initial list of contact points: these are the endpoints known to be part of the cluster:\n open Akklinguse sys = System.create &#34;swim-cluster&#34; &lt;| Configuration.parse config// In this example `a` and `b` are actor refs for other // SWIM cluster members living on other nodes. let c = spawn sys &#34;node-b&#34; &lt;| props (Swim.membership [a; b])\n In order to create that actor first we need to deal with a joining process. The idea is that we&#39;ll try to pick endpoints from the provided list (it corresponds to seed node addresses in Akka.Cluster ) and send a  Join request to them. If cluster node actor will receive such request, it&#39;s obliged to accept it by sending  Joined response to ALL cluster members (including requester).\n In case when  Joined wouldn&#39;t arrive eg. because we misconfigured our cluster and other endpoint couldn&#39;t be reached, we wait for some time and try another node from the list. This could be represented as:\n let membership (seeds: Endpoint list) (ctx: Actor&lt;_&gt;) = let state = { Myself = { Endpoint = ctx.Self } Active = Set.empty Suspects = Map.empty } (* rest of the actor code... *) let rec joining state cancel = actor { match! ctx.Receive() with | JoinTimeout [] -&gt; return Stop // failed to join any members | JoinTimeout (next::remaining) -&gt; next &lt;! Join state.Myself let cancel = ctx.Schedule joinTimeout ctx.Self (JoinTimeout remaining) return! joining state cancel | Joined gossip -&gt; cancel.Cancel() // cancel join timeout return! becomeReady state gossip | Join peer when peer = state.Myself -&gt; // establish new cluster cancel.Cancel() // cancel join timeout return! becomeReady state (Set.singleton state.Myself) | _ -&gt; return Unhandled } match seeds with | [] -&gt; becomeReady state (Set.singleton state.Myself) | seed::remaining -&gt; seed &lt;! Join state.Myself let cancel = ctx.Schedule joinTimeout ctx.Self (JoinTimeout remaining) joining state cancel\n After receiving the  Joined request actor associates itself as a operating member of the cluster, ready to work. From now on it will trigger itself to periodically check if others remain responsive:\n let merge gossip state = { state with Active = state.Active + gossip }let becomeReady state gossip = ctx.Schedule pingInterval ctx.Self NextRound |&gt; ignore ready (merge gossip state)\n As mentioned before, in this case  gossip is just a full set of active cluster members, while  ready is actor behavior used for standard cluster activities:\n let rec ready state = actor { match! ctx.Receive() with // other message handlers | _ -&gt; return Unhandled}\n Since we covered joining procedure from requestor side, let&#39;s do that for operating cluster member as well:\n match! ctx.Receive with| Join peer -&gt; let gossip = Set.add peer state.Active let msg = Joined gossip gossip |&gt; Set.remove state.Myself |&gt; Set.iter (fun peer -&gt; peer.Endpoint &lt;! msg) return! ready { state with Active = gossip } | Joined gossip -&gt; return! ready (merge gossip state)// other handlers\n As we said, once new member tries to join, we simply update our active members state and gossip it to all other members in  Joined message, so they could update it as well.\n Now, let&#39;s cover pinging process. First we mentioned that we want to trigger our member every now and then - you could already see that when we scheduled  NextRound event in  becomeReady function. Now how it will work? We&#39;re going to pick one node at random - other than current one and not being suspected (suspects are nodes that didn&#39;t reply to pings on time) - and send a  Ping request to it. In the meantime we also schedule a timeout for that request to complete:\n let pick peers = match Set.count peers with | 0 -&gt; None | count -&gt; let idx = ThreadLocalRandom.Current.Next count Some (Seq.item idx peers) let ready state = actor { match! ctx.Receive() with | NextRound -&gt; ctx.Schedule pingInterval ctx.Self NextRound |&gt; ignore let suspects = state.Suspects |&gt; Map.toSeq |&gt; Seq.map fst |&gt; Set.ofSeq let others = (Set.remove state.Myself state.Active) - suspects // pick one member at random, other than self and not marked as suspected match pick others with | None -&gt; return! ready state | Some peer -&gt; // send Ping request to that peer and schedule timeout peer.Endpoint &lt;! Ping(state.Active, ctx.Self) let cancel = ctx.Schedule pingTimeout ctx.Self (PingTimeout peer) let skipList = Set.ofArray [| state.Myself; peer |] return! ready { state with Suspects = Map.add peer (cancel, WaitPingAck skipList) state.Suspects } | Ping (gossip, sender) -&gt; // reply to incoming ping right away sender &lt;! PingAck(state.Myself, state.Active) return! ready (merge gossip state) // other handlers}\n Here we&#39;re using our suspects map to keep track of timeout cancellation and skip list. What&#39;s a skip list? We&#39;ll cover it soon. As we mentioned, when  PingAck doesn&#39;t arrive on time, we&#39;re going to pick another member (at random) and ask it to ping our suspect for us using  PingReq message. This way we try to mitigate risk of false negatives in our failure detection algorithm:\n let ready state = actor { match! ctx.Receive() with | PingReq (suspect, gossip, sender) -&gt; let cancel = ctx.Schedule indirectPingTimeout ctx.Self (PingTimeout suspect) suspect.Endpoint &lt;! Ping(state.Active, ctx.Self) return! ready { merge gossip state with Suspects = Map.add suspect (cancel, WaitPingReqAck) state.Suspects\n......", "posttime": "2021-06-29 22:34:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,群集,cluster,节点", "title": "让你的群集游泳（2020） ", "title_en": "Make your cluster SWIM (2020)", "transed": 1, "url": "https://bartoszsypytkowski.com/make-your-cluster-swim/", "via": "", "real_tags": ["2020", "群集", "cluster", "节点"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068445, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "毫混客户端有多种语言。对于翻译过程，我们最近从Transifex Online Platform移动到WebLate。在这篇文章中，我们描述了我们的翻译历史，推理和目前的方法。\n  在最后一个快照之后，我们自豪地介绍即将到来的1.4.0 stablerelelease的第六次开发快照。请注意，此快照旨在成为最后一个释放之前的最后一个，并与其发布一样，我们正在引入1.4.x系列的Freature-Freeze。从现在开始，只有错误修复将进入这个系列。\n 在理解释放的意义之后是快照版本（见下文），您可以从下载空间下载新版本。\n      犬歌是第一个在十年前建立真正的低延迟语音通信的VoIP应用程序。但低延迟和游戏不是它闪耀的唯一用例。\n  我们听到录制播客与我们的多通道音频录音机，寻求与我们的位置音频在游戏中寻求现实主义的播放器，Eve在线球员拥有超过100多个同步语音参与者的巨大社区（我打赌他们熟悉我们广泛的许可系统😄 ），竞争团队堡垒2社区使我们成为他们所需的语音通信平台，爱好无线电传输用户，以及各种工作场所适应咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜咕噜声\n  管理员欣赏能够自我主持并控制数据安全性和隐私性的腮腺。有些人利用广泛的权限系统进行复杂场景（例如分隔两组，但领导者能够与两者交谈）。有些人喜欢为他们的用户提供具有使用服务器API的脚本或连接到服务器的主机音乐机器人等脚本的附加功能。具有现有用户数据库的人通常使用身份验证器允许使用现有帐户登录数据进行身份验证。\n    不同的用户组对不同的功能感兴趣，因此我们描述了对每种用户特定的一些功能。 \n要开始只需下载，安装和启动嘟嘟声并连接到公共服务器，或者您知道的特定一个。  通过ICE协议渠道观众延伸 - 即使没有直接的ICE访问，如果HOSTES提供CVP，则轻松设置您的频道查看器  对于配置选项，请参阅Murmur.ini以及我们关于第三方管理软件，脚本和机器人的文档。 ", "note_en": "The Mumble client is available in many languages. For the translation process we recently moved from the  Transifex online platform to  Weblate. In this post we describe our translation history, reasoning, and current approach.\n  Following the  last snapshot we proudly present our sixth development snapshot of the upcoming 1.4.0 stablerelease. Note that this snapshot is intended to be the last one before the final release and as such with its publication we are introducing afeature-freeze of the 1.4.x series. From now on only bug fixes will make it into this series.\n After having understood what it means for a release to be a  snapshot release (see below), you can download the new version from our   Downloadspage.\n      Mumble was the first VoIP application to establish true low latency voice communication over a decade ago. But low latency and gaming are not the only use cases it shines in.\n  We heard from users who record podcasts with our multi-channel audio recorder, players seeking realism with our positional audio in games, Eve Online players with huge communities of over 100 simultaneous voice participants (I bet they make good use of our extensive permission system 😄), the competitive Team Fortress 2 community making us their required voice communication platform, hobby radio transmission users, and a variety of workplaces adapting Mumble to fit their needs - be it on-head mobile devices or communicating across countries or into airplanes.\n  Administrators appreciate Mumble for being able to self host and have  control over data security and privacy. Some make use of the extensive permission system for complex scenarios (for example separating two groups but leaders being able to talk to both). Some love to provide their users with additional functionality with scripts making use of server APIs, or host music bots and the like that connect to the server. Those that have an existing user database often make use of authenticators to allow authenticating with existing account login data.\n    Different user groups are interested in different capabilities and so we describe some of the features specific to each kind of user.\n        To get started simply  download, install and start Mumble and connect to a public server, or a specific one you know of.\n    Extendible through Ice protocols\t\t\t Channel viewers - even without direct Ice access, if the hoster provides the CVP, easily set up your channel viewer of choice\n    For configuration options see  Murmur.ini and our documentation on third party administration software, scripts, and bots.", "posttime": "2021-06-29 22:34:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,高质量,open,脚本", "title": "喃：开源，低延迟，高质量的语音聊天 ", "title_en": "Mumble: Open-Source, Low Latency, High Quality Voice Chat", "transed": 1, "url": "https://www.mumble.info/", "via": "", "real_tags": ["开源", "高质量", "open", "脚本"]}, {"category": "", "categoryclass": "", "imagename": "6135cca9843ba6e754c29dc083785da7.jpg", "infoid": 1068444, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无效的电子邮件出现问题，请稍后再试。订阅时，我们将使用您提供的信息向您发送这些新闻稿。您的信息将根据我们的隐私声明使用。\n 鸽子鸽友正试图制定大约5,000只鸟类在一场比赛中消失在一个“百慕大三角形”中所谓的这项运动的最糟糕的日子之一。\n  从彼得堡到东北地区的比赛锯9,000只鸽子参与通常是三小时的比赛，但超过一半才到达。\n  大气条件是迄今为止提出的唯一解释，报道了Teesside Live。\n  鸽子在从南方的比赛中回到了东克利夫兰的回家。\n  在Skinnningrove的鸽舍估计的300只鸟在比赛中消失了，鸽子鸽友认为可能是由于怪灾天气状况。\n                             SkinnningRove Pigeon Fancier Richard Sayers对他的社交媒体渠道分享了呼吁，敦促人们向他们留意，并在您的花园里的丢失的赛鸽陆地占据了该怎么办。 \n赛车鸽是可识别的，标签周围的标签。如果他们被喂养和浇水，他说，疲惫的归巢鸟最终会回到他们的鸽舍。\n    ＆＃34;它是一个非常糟糕的周末赛车，不仅仅是在英国的西北，＆＃39;在英国。目前，人们非常不确定发生了什么，仍然存在很多很多，并且在行动中仍然缺少很多鸽子，而＃34;理查德说。\n  ＆＃34;很多人认为这是由于大气中的东西 - 就像云上方的太阳风暴一样。\n  ＆＃34;我只是想向遇到赛鸽喂养，水和让它休息和那里的任何人提高认识，并且在几天后鸟类将在途中达到80％的机会。每只鸽子都有一个识别戒指，其中代码和数字。＆＃34;\n  ＆＃34;我们需要我们的小鸟类在重大冲突中有助于他们挽救了1000多人的生命，现在我们可以做我们的一点点来帮助他们，＆＃34;他在他的社交媒体帖子中说。\n    他将他的归巢鸟飞到兄弟们的兄弟＆amp;来自Skinningrove的儿子在东部克利夫兰联邦。合作伙伴关系保持鸟类大约50年。\n  他说，大约在30％到40％的皮肤鸟类缺失，大约300岁的鸟类。在东方克利夫兰联邦，该数字估计为1,000。横跨东北部，估计介于3,500和5,500之间。 \n理查德说，惠特比鸽友凯尔·杜格拉斯凯尔·杜格拉斯有很多工作来帮助拯救失去的鸟类。  还有网站，人们可以在这里和这里报告可以在这里找到的杂散。 ", "note_en": "Invalid Email Something went wrong, please try again later.   When you subscribe we will use the information you provide to send you these newsletters. Your information will be used in accordance with our Privacy Notice.\n Pigeon fanciers are trying to work out how around 5,000 birds have disappeared into a “Bermuda triangle” in a single race in what is being called one of the worst days ever for the sport.\n  A race from Peterborough to the North East saw 9,000 pigeons taking part in what would normally be a three-hour competition but more than half have yet to arrive.\n  Atmospheric conditions are the only explanation that has been put forward so far,  reports Teesside Live.\n  The pigeons have vanished while making their way home to east Cleveland from a race down south.\n  An estimated 300 birds from lofts in Skinningrove alone have disappeared during the race which pigeon fanciers believe has possibly been due to freak weather conditions.\n                             Skinningrove pigeon fancier Richard Sayers shared an appeal on his social media channels urging people to look out for them and giving advice on what to do if a lost racing bird lands in your garden.\n  Racing pigeons are recognisable by the tags around their legs. If they are fed and watered, he says, the tired homing birds will eventually return to their lofts.\n    &#34;It&#39;s been a really bad weekend racing not just here in the North East, it&#39;s right across the UK. At present people are very unsure what has happened there are still lots and lots of pigeons still missing in action,&#34; said Richard.\n  &#34;A lot of people think this is due to something in the atmosphere - like a solar storm above the clouds.\n  &#34;I just wanted to raise awareness for anyone who comes across a racing pigeon to feed, water and let it rest and there&#39;s an 80% chance the birds will get on their way after a few days. Each pigeon has an identification ring on with a code and number.&#34;\n  &#34;We needed our little birds help in the major conflicts and they saved 1000s of lives, now we can do our little bit to help them,&#34; he said in his social media post.\n    He flies his homing birds as Sayers Bros &amp; son from Skinningrove in the East Cleveland Federation. The partnership has kept birds for around 50 years.\n  Roughly between 30% and 40% of the Skinningrove birds are missing, around 300 birds, he said. In the East Cleveland Federation the figure is estimated to be 1,000. Across the North East section, the estimate is between 3,500 and 5,500.\n  Whitby pigeon fancier Kyle Douglass, 20, does a lot of work to help rescue lost birds, said Richard.\n  There are also websites where people can report strays which can be found  here and  here.", "posttime": "2021-06-29 22:34:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "鸽子,pigeons,比赛", "title": "谜团作为5k归巢鸽子变成薄薄的空气 ", "title_en": "Mystery as 5k homing pigeons vanish into thin air", "transed": 1, "url": "https://www.walesonline.co.uk/news/uk-news/mystery-5000-homing-pigeons-birds-20907818", "via": "", "real_tags": ["鸽子", "pigeons", "比赛"]}, {"category": "", "categoryclass": "", "imagename": "14a5fbb20edbc32e5c5d925a11c3b914.png", "infoid": 1068443, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几十年来，我想要一种简单的方法来跟踪我的车库门是开放还是关闭。我于2015年开始这个项目，它确实确实是我需要的。该项目最终变成了我来调用我的豹子的一个组成部分，覆盆子PI的网络＆＃39;在我的财产周围执行各种有用的功能。\n  ＆＃39; OHD＆＃39;监视覆盆子PI上指定的GPIO引脚，并根据这些引脚的状态的变化进行响应。它将电子邮件（或短信）消息发送到其配置文件中的数字。\n  2019年11月，我将PIR运动探测器添加到我的前廊。让Ohdhandle监测其地位是自然的。当该运动检测器跳闸时，OHD响铃我的门铃响了三次，然后向已配置的电子邮件/短信网关发送通知，并且Zoneminder被告知Torecord视频，以便配置的时间长度。\n  PI是B型号B + B +，以及PINS DO的示意图详细信息.I还添加了实时时钟模块和不间断电源，以保持其在线和谐。 UPS是一个带12V密封电池的家用制作作业，将DROK 12V为5V降压转换器供电。该转换器为PI供电。像冠军一样工作。\n  我重新使用了一个平方绿色按钮开关，我将旧的PC盒销售为旁路按钮。此按钮具有内置LED，当旁路啮合时亮起。旁路函数使我能够让车库门打开，而我在那里工作而没有得到的人。\n  软旁路功能允许我在需要时过度乘坐硬件旁路交换机的状态。当软旁路啮合时，旁路按钮＆＃39; S LED闪烁，提醒我启用软旁路模式。\n  OHD使用Gmail与外部世界沟通。我为此PI创建了一个帐户，并且当门或绕过开关的状态时，它将电子邮件发送到指定的收件人列表。通过使用Cell ServiceProvider的SMS网关地址，SMS也可以通过SMS发送通知。我是verizon，所以OHD发了一封电子邮件到＆＃39; mycellnumber@vzwpix.com&#39;这符合短信并在我的手机上显示任何其他文字。 \nOHD还可以通过电子邮件接收说明。 有时候大门打开了大多数人，那么谁没有按下旁路按钮。 就像我们在奥特屋工作的地板承包商一样。 我们无法联系到他们，但我能够送一个＆＃34;安静＆＃34; 消息到PI＆＃39; S Gmail地址，以及OHD检索并停止发送＆＃39;门打开＆＃39; 通知。 非常便利。 目前，这是Aonly命令OHD的行为。  我提供了一些指示，从一个全新的pi到一个运作的OHD系统。正常的警告适用。 。 。 你的旅费可能会改变。 ", "note_en": "For decades, I wanted a simple way to keep track of whether my garage door was open or closed. I started this project in 2015 and it does exactly what I need. The project eventually morphed into a component ofwhat I have come to call my PiNet, a network of Raspberry Pi&#39;s that perform various useful functions around my property.\n  &#39;ohd&#39; monitors specified GPIO pins on a Raspberry Pi and responds based on changes tothe status of those pins. It sends email (or SMS) messages to numbers in its config file.\n  In November of 2019 I added a PIR motion detector to my front porch. It was natural to let  ohdhandle the monitoring of its status. When that motion detector is tripped,  ohd rings my doorbell rings three times,then sends notification to the configured emails/SMS gateways, and  Zoneminder is told torecord video for the configured length of time.\n  The Pi is a 3 Model B+, and the  schematic diagram details which pins do what.I also added a real-time clock module and an Uninterruptable Power Supply to keep it online andon time. The UPS is a home-brew job with a 12V sealed battery that powers a DROK 12V to 5V buck converter.That converter powers the Pi. Works like a champ.\n  I re-used a square green pushbutton switch I salvaged off an old PC case as my ByPass button. This button has a built-in LED which lights up when the ByPass is engaged. The ByPass functionallows me to keep the garage door open while I&#39;m working in there without getting notifiedevery minute.\n  The Soft Bypass function allows me to over-ride the status of the hardware bypass switch when needed.When Soft Bypass is engaged, the bypass button&#39;s LED flashes to remind me Soft Bypass mode is enabled.\n  ohd uses Gmail to communicate with the outside world. I created an account just for this Pi,and it sends emails to a specified list of recipients when the status of the door or ByPass switchchanges. Notifications can also be sent by SMS by using the SMS gateway address of the cell serviceprovider. Mine is Verizon, and so  ohd sends an email to &#39; mycellnumber@vzwpix.com&#39;. That getstranslated to SMS and shows up on my phone like any other text.\n ohd also can receive instructions by email. There have been times when the door was opened bysomeone who then failed to press the bypass button. Like when we had flooring contractors working atour house. We could not reach them, but I was able to send a &#34;quiet&#34; message to the Pi&#39;s Gmail address,and ohd retrieved that and stopped sending &#39;door open&#39; notifications. Very handy. Currently this is theonly command  ohd acts on.\n I provided some  instructions to go from a brand new Pi to a functioning  ohd system.The normal caveats apply . . . your mileage may vary.", "posttime": "2021-06-29 22:33:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "车库,door,ohd", "title": "车库由Monitor. ", "title_en": "Garage Door Monitor", "transed": 1, "url": "https://github.com/casspop/ohd", "via": "", "real_tags": ["车库", "door", "ohd"]}]