[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1067039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Covid-19中的脑与脑相关病症有很大的证据，其中一些可能是病毒神经营养的结果。绝大多数脑成像研究到目前为止侧重于定性，中度至严重病例的定性，通常对住院患者进行。然而，它仍然未知，但是，是否可以以定量和自动的方式在升高的情况下检测Covid-19的影响，以及这是否可以揭示疾病传播的可能机制。在Covid-19大流行开始之前，英国Biobank扫描了超过40,000名参与者，使其可以邀请2021百个以前的成像参与者进行第二次成像访问。在这里，我们使用来自英国Biobank Covid-19重新成像研究的782名参与者的多模式数据研究了疾病在大脑中的影响，394名参与者在其两次扫描之间进行了SARS-COV-2感染的阳性。我们在感染前后使用结构和功能性脑扫描，比较这394个Covid-19患者和388名对照之间的纵向脑变化，他与年龄，性别，种族和间隔相匹配。我们在左半产卵疫苗中，左侧眶内皮层和左侧insula在左侧嗜疗疫苗中丢失了Covid-19在大脑中对大脑的显着影响。在查看整个皮质表面时，这些结果延伸到前铰接皮质，穗敷过渡和颞杆。我们进一步比较了与没有（n = 379）的人住院（n = 15）的Covid-19患者，而结果不显着，我们发现对Covid-19 VS对照组比较的比较相似的发现另外，施用皮质中的灰质损失，杏仁达拉和海马玉米氨基的中央核（全部| Z |＆gt; 3）中较大的灰质。我们的研究结果始终如一地涉及与主要嗅觉和味觉系统直接连接的肢体皮质区域中灰质的损失。与HOC疾病研究不同，预接种成像数据的可用性有助于避免预先存在的风险因素或临床状况被解释为疾病影响的危险。由于病毒对中枢神经系统的可能入口点可能是通过嗅觉粘膜和嗅灯泡的，因此这些脑成像结果可能是通过嗅觉和味道的疾病（或病毒本身）传播的体内标志途径。\n    这项工作主要由惠康信托协作奖215573 / z / 19 / z支持。 KLM受惠康信托高级研究奖学金202788 / z / 16 / z的支持。来自惠康信托（203139 / z / 16 / z）的中心资金支持富集的神经影像学（Win FMRIB）的惠康中心。本研究部分是在申请号8107下的英国Biobank资源进行的。\n  我确认了所有相关的道德准则所遵循，并获得了任何必要的IRB和/或伦理委员会批准。\n  提供了为所描述的研究提供批准或豁免的IRB /监督机构的细节：\n 人类主题：英国Biobank已从西北部多中心研究伦理委员会（MREC）批准，以获得和传播与会者的数据和样本（http://www.ukbiobank.ac.uk/ethics/），以及这些道德法规涵盖了本研究的工作。从所有参与者获得书面知情同意书。\n 已获得所有必要的患者/参与者同意，并已存档适当的机构表格。\n  我理解，所有临床试验和任何其他前瞻性介入研究必须在ICMJE批准的注册处登记，例如Clinicaltrials.gov。我确认已注册稿件中报告的任何此类研究并提供了审判登记ID（注：如果回顾性注册了潜在研究，请在试验ID现场提供陈述，解释为什么预先登记该研究的原因） 。 \n我遵循所有适当的研究报告指南，并将相关赤道网络研究报告报告清单和其他相关材料作为补充文件，如适用，如适用。 ", "note_en": "There is strong evidence for brain-related pathologies in COVID-19, some of which could be a consequence of viral neurotropism. The vast majority of brain imaging studies so far have focused on qualitative, gross pathology of moderate to severe cases, often carried out on hospitalised patients. It remains unknown however whether the impact of COVID-19 can be detected in milder cases, in a quantitative and automated manner, and whether this can reveal a possible mechanism for the spread of the disease. UK Biobank scanned over 40,000 participants before the start of the COVID-19 pandemic, making it possible to invite back in 2021 hundreds of previously-imaged participants for a second imaging visit. Here, we studied the effects of the disease in the brain using multimodal data from 782 participants from the UK Biobank COVID-19 re-imaging study, with 394 participants having tested positive for SARS-CoV-2 infection between their two scans. We used structural and functional brain scans from before and after infection, to compare longitudinal brain changes between these 394 COVID-19 patients and 388 controls who were matched for age, sex, ethnicity and interval between scans. We identified significant effects of COVID-19 in the brain with a loss of grey matter in the left parahippocampal gyrus, the left lateral orbitofrontal cortex and the left insula. When looking over the entire cortical surface, these results extended to the anterior cingulate cortex, supramarginal gyrus and temporal pole. We further compared COVID-19 patients who had been hospitalised (n=15) with those who had not (n=379), and while results were not significant, we found comparatively similar findings to the COVID-19 vs control group comparison, with, in addition, a greater loss of grey matter in the cingulate cortex, central nucleus of the amygdala and hippocampal cornu ammonis (all |Z|&gt;3). Our findings thus consistently relate to loss of grey matter in limbic cortical areas directly linked to the primary olfactory and gustatory system. Unlike in  post hoc disease studies, the availability of pre-infection imaging data helps avoid the danger of pre-existing risk factors or clinical conditions being mis-interpreted as disease effects. Since a possible entry point of the virus to the central nervous system might be via the olfactory mucosa and the olfactory bulb, these brain imaging results might be the  in vivo hallmark of the spread of the disease (or the virus itself) via olfactory and gustatory pathways.\n    This work was primarily supported by a Wellcome Trust Collaborative Award 215573/Z/19/Z. KLM is supported by a Wellcome Trust Senior Research Fellowship 202788/Z/16/Z. The Wellcome Centre for Integrative Neuroimaging (WIN FMRIB) is supported by centre funding from the Wellcome Trust (203139/Z/16/Z). This research has been conducted in part using the UK Biobank Resource under Application Number 8107.\n  I confirm all relevant ethical guidelines have been followed, and any necessary IRB and/or ethics committee approvals have been obtained.\n  The details of the IRB/oversight body that provided approval or exemption for the research described are given below:\n Human subjects: UK Biobank has approval from the North West Multi-centre Research Ethics Committee (MREC) to obtain and disseminate data and samples from the participants ( http://www.ukbiobank.ac.uk/ethics/), and these ethical regulations cover the work in this study. Written informed consent was obtained from all participants.\n All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.", "posttime": "2021-06-20 22:29:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "biobank,imaging,研究", "title": "在英国Biobank的Covid-19之前和之后的脑成像 ", "title_en": "Brain imaging before and after Covid-19 in UK Biobank", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2021.06.11.21258690v1", "via": "", "real_tags": ["biobank", "imaging", "研究"]}, {"category": "", "categoryclass": "", "imagename": "6f44742d801cb6abede042ac27b7f1dc.jpg", "infoid": 1067037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Netflix＆＃39;新的幻想系列，甜食，首先看起来像2020年的粗糙虚构的版本。一种疾病，随着病人在人类中迅速传播，同时压倒性地，磨削日常生活，并撞到一个身体数数。当这个故事开始时，社会试图再次把自己放在一起。一个未命名的叙述者称之为它＆＃34;伟大的崩溃。＆＃34;\n 然而，这场灾难可以＆＃39;甚至可以包含Covid-19的程度。没有发现固化或疫苗接种，因此大多数人选择以单独的单独生活或无病群体生活。这种撤回使得本质上基本上迈出了以前只在动物园漫游之前看到的空隙动物，并且景观充分增长，以补充以前为资源被破坏的社会。\n 哦，在甜食中，下一代孩子似乎包括称为杂种的半动物/半人类个体。 a to table b的列与b的比率变化 - 有些谈话，一些唐＆＃39; t;许多看起来像传统的动物特征;所有保留能力都可以提高听力或嗅觉 - 但似乎没有人肯定会知道任何东西。为什么这种进化发生了？那里有多少？而且，最相关的，是什么，使杂种免受病人的影响？面对所有的神秘，这个新世界的一些部分看着杂交种作为一种充满希望的人类演变，一群个体社会应该保护和帮助茁壮成长。然而，其他人将杂交种视为人类的障碍，从生病和恢复正常。特别是杂交种＆＃39;对病人的免疫力有这种新世界的声音，这对他们是否可以收获他们的DNA以进行治疗或预防。\n 在这个整个混乱的中间坐着Gus，一个Deerboy Hybrid，他只是在一个孤立的黄石舱内和他的父亲身上生活了一个安静的生活，直到，嗯，你可能会看到这在哪里。幸运的是，这种可预测性并不是让旅程前进任何乐趣。\n     所以，我们的汤姆索马尔爱的德德基德必须在一个遍历他自己的国家冒险，整个冒险，整个人，他遇到了许多有未知动机的人，他们可能希望他死或可以伴随成为一个被发现的家庭各种各样的。我用青少年兄弟姐妹看了一大部分系列，不用说他们能够召唤许多个别剧集＆＃39; s曲折。甜食覆盖了很多磨损的电影和电视领域，但如果你＆＃39;喜欢任何众多的孩子 - 与世界古代冒险的任何孩子（来自哈利波特的Goonies）。\n    那说，我被系列乐于魅力。与其交叉类型的一些共同方面的独特方法（孩子冒险，后启动型）。当Gus和他的第一个新的伴侣（一位前足球运动员变成猎人/刺客被命名为Tommy Jeppard，Aka Big Man）不可避免地遇到了一群民兵，那个社区＆＃39; T for Fire Ariger Cadets或Marines。相反，这个业余军队学会了它的策略，因为他们以前是一群献身的朋友，他们播放了像透明或光环这样的游戏。和留下的科学家们留下了这种疾病乱七八糟的疾病＆＃39; t前政府实验室jockeys;他们曾经是常规的医疗服务提供者。他们非常继续抓住观看所有这些病人的创伤，因为这个新世界要求他们升级并领导，所以这些文档的人性与一些＆＃34只能运作;任何东西更大的好的＆＃34;心理。\n  对于甜食来说，非常非常容易变得过于黑暗，太情绪沉重，或者对于在过去的16个月里生活了一些这个东西的观众太烦躁了。再次又一次，当我常常追随行走的死者时，展示给了我闪回，我在几个小时和时间绝望后戒掉了。像Twd一样，甜食让我们的英雄经历了许多不同的人，他们遇到了许多不同的人，他们最初看起来很好，只有透露自己在以后的别人，往往具有悲惨的结果。 （电视和电影的人们什么时候会知道可能没有比白栅栏围栏郊区郊区的更危险，更危险的地方更加危险的地方？叹了口气。）在另一个值得注意的僵尸大脑中，糟糕的家伙（无论是＆＃39; SA疾病或分离的疯鼠）似乎比在这些前八集中更频繁地出现在上面。 \n尽管如此，甜食永远不会完全进入毁灭色情或虚无主义。主要是，因为它的中央人物，而且是＃39;与Rick Grimes（行走死亡）不同，6月（手工＆＃39; STALE），或者在世界末日的新现实中存在的许多其他人物，GUS仍然是个孩子。世界哈斯队＆＃39;而殴打他一直期待最糟糕的是，他的一般乐观和奇迹让这个故事不够轻松，尽管沿途很多肠道拳。甜牙＆＃39; S源漫画于2013年包装，并在Covid-19接管之前，这一Netflix系列的生产开始了。创意团队已经制定了一些决定，用于调整源材料的凄凉，这些选择的好处仅被上下文观众放大到夏季2021年夏季。\n    我还没有积极寻求任何与大流行相关的流行文化。也许我对它的胃口最终会改变，虽然让＆＃39;在十年中重新审视。但是，鉴于这种持续的全球局面的全部局面，当然你可以＆＃39;甚至偶然消耗一些。对我来说，到目前为止工作的东西在逆境，混乱和悲剧下面有一定程度的乐观情绪或希望。例如，如何与John Wilson如何与医院的超额杂货店和场景，但它通过强调我们对人类互动的需求以及新实现的巨大价值来结束。\n 在表面上，甜食isn＆＃39; t关于大流行。这个节目适用于青少年，并没有关于锤击家庭人类的核心观念并不是微妙的。通过气候变化和贪得无厌的渴望，在摧毁我们的星球中的角色。然而，节目＆＃39;剧情突出了全球大流行，使得无法通过这八集的镜头来考虑这一点。最终，在疾病黑暗中，甜食指向几个正消息。\n 首先，不要成为最年轻一代的混蛋。我们不知道这将如何影响它们，他们是未来会解开这种混乱并导航其持久的影响。此外，推进需要向他人延伸善意。世界的重量在情绪上对每个人都在情感上＆＃39;肩膀（如果没有身体，在很大程度上）。当它＆＃39是不可能知道你的下一个事件，旅行，家庭团聚或你期待将发生的事情时，如果你想要情绪化的任何机会，你必须存在一些其他任何一种希望心理生存。 Gus认为希望像大人一样宣布打破个人，而且它很容易想象他在S2中传播乐观的展望越来越多，因为这次悲观的方式包装。\n 传统上，夏天总是觉得像网络一样倾倒地面，以便人们度假或普遍赶上更多的东西;较大的系列头条内衬往往等待秋季返回或首演（参见Y：在2021年的最后一个人或基金会）。但近年来，春天结束时出现了惊喜，成为他们自己的关键宠儿（HBO＆＃39; S LOS Espookys）或MegaFranches（陌生人）。甜食是否可以行进与明星的同样的惊喜路径仍然可以看出，但它至少很高兴有一个值得关注的新节目，因为我们进入另一个夏天，旅行可能复杂的地方（虽然，仁慈地，并不像复杂因为它在甜食中）。 ", "note_en": "Netflix&#39;s new fantasy series,  Sweet Tooth, first looks like a crudely fictionalized version of 2020. A disease colloquially referred to as The Sick spreads rapidly among humans while overwhelming infrastructure, grinding daily life to a halt, and racking up a body count. When this story begins, society tries to put itself together again. An unnamed narrator calls it &#34;The Great Crumble.&#34;\n This disaster, however, can&#39;t be contained even to the extent of COVID-19. No cure or vaccination has been discovered, so most humans opt to live in isolation either as individuals or as disease-free groups. This withdrawal has allowed nature to essentially step into the void—animals previously only seen in a zoo roam free, and landscapes grow out in full to replenish what society previously destroyed for resources.\n Oh, and in  Sweet Tooth, the next generation of kids appears to include half-animal/half-human individuals called Hybrids. The ratio of column A to column B varies—some talk, some don&#39;t; many look like traditional kids with small animal features; all retain abilities like heightened hearing or smell—but no one seems to know anything for sure . Why did this evolution happen? How many are there? And, most pertinent, what makes Hybrids immune to The Sick? In the face of all that mystery, some portions of this new world look at Hybrids as a hopeful evolution of humanity, a group of individuals society should protect and help thrive. Others, though, see Hybrids as a hindrance to humanity getting past The Sick and returning to normalcy. In particular, Hybrids&#39; immunity to The Sick has swaths of this new world curious about whether their DNA can be harvested for treatment or prevention.\n In the middle of this whole mess sits Gus, a deerboy Hybrid who simply lived a quiet life in an isolated Yellowstone cabin with his father until, well, you can probably see where this is headed. Luckily, that predictability doesn&#39;t make the journey ahead any less fun.\n     So, our  Tom Sawyer-loving deerkid has to set off on a country-traversing adventure of his own, and throughout, he&#39;ll encounter numerous individuals with unknown motives who may want him dead or may partner up to become a  found family of sorts. I watched a large portion of the series with a teen sibling, and needless to say they were able to call out many of the individual episode&#39;s twists and turns.  Sweet Tooth covers  a lot of well-worn movie and TV territory, but it will still likely have you in for the long haul if you&#39;re fond of any of the numerous kids-versus-the-world adventures of yore (from  The Goonies to  Harry Potter).\n    That said, I was amused by the series&#39; unique approach to some common aspects of its intersecting genres (kid adventure, post-apocalypse). When Gus and his first new partymate (a former football player turned hunter/assassin named Tommy Jeppard, aka Big Man) inevitably encounter a militarized group of people, that community  isn&#39;t full of former cadets or marines. Instead, this amateur army learned its tactics because they were previously a devoted group of friends who played games like  Overwatch or  Halo. And the scientists who remain and must sort out this disease mess aren&#39;t former government lab jockeys; they used to be regular-old medical care providers. They very much continue to grapple with the trauma of watching all these patients of The Sick deteriorate as this new world asks them to step up and lead, so these docs have their humanity in tact rather than operating only with some &#34;anything for the greater good&#34; mentality.\n  It would be very, very easy for  Sweet Tooth to become too dark, too emotionally heavy, or too tiresome for viewers who have lived some of this stuff IRL in the last 16 months. Again and again, the show gave me flashbacks to when I used to follow   The Walking Dead , which I had quit watching entirely after hours and hours of despair. Like  TWD,  Sweet Tooth has our heroes going through cycles where they encounter many different groups of people who initially seem nice and helpful only to reveal themselves to be something else later on, often with tragic results. (When will people in TV and film learn that there may be no scarier, more dangerous place than white picket fence-lined suburban neighborhoods?  Sigh.) In another notable zombie-brains-show similarity, the bad guys (whether that&#39;s a disease or a disassociated lunatic military man) seem to come out on top more often than not, at least in these first eight episodes.\n Despite that,  Sweet Tooth never veers entirely into ruin porn or nihilism. Mostly, that&#39;s because of its central figure. Unlike Rick Grimes ( The Walking Dead), June (  Handmaid&#39;s Tale), or many other characters existing in an apocalyptic new reality, Gus is still a kid. The world hasn&#39;t beaten him down into expecting the worst all the time, and his general optimism and wonder keep this story feeling light enough despite many gut punches along the way.  Sweet Tooth&#39;s source comic wrapped in 2013, and production on this Netflix series  began long before COVID-19 took over. The creative team had already made a few decisions to tone down the bleakness of the source material, and the benefits of those choices are only amplified by the context viewers bring to the show in summer 2021.\n    I have yet to actively seek out any pandemic-related pop culture. Maybe my appetite for it will eventually change, though let&#39;s revisit that in a decade. But given how all-encompassing this ongoing global situation has been, of course you can&#39;t help but consume some of it, even by accident. For me, the stuff that works so far has had some degree of optimism or hope underneath the adversity, chaos, and tragedy. The risotto episode of   How to With John Wilson, for instance, includes overrun grocery stores and scenes from hospitals, but it ends by underscoring our need for human interaction and the newly realized immense value in it.\n On the surface,  Sweet Tooth isn&#39;t about the pandemic at all. This show is for teens, and it is not subtle about hammering home a central idea regarding humanity&#39;s role in destroying our planet through climate change and an insatiable thirst for more. However, the show&#39;s plot prominently features a worldwide pandemic, making it impossible to not think about that through the lens of these eight episodes. Ultimately,  Sweet Tooth points to a few positive messages amid the disease darkness.\n First, don&#39;t be jerks to the youngest generation. We don&#39;t yet know how this will impact them, and they are the future who will unravel this mess and navigate its lasting impact. Additionally, pushing forward necessitates extending kindness to others. The weight of the world is emotionally on everyone&#39;s shoulders (if not physically, to a large extent). And when it&#39;s impossible to know when your next event, trip, family reunion, or whatever thing you look forward to will happen, some other kind of hope must exist for you to believe in if you want any chance at emotional and mental survival. Gus gives that hope to admittedly broken-down individuals like Big Man, and it&#39;s easy to imagine him spreading that optimistic outlook wider in S2 given the pessimistic way things wrap this time around.\n Traditionally, summer always felt like a dumping ground for networks to try unusual things as people vacation or generally get out more; bigger series headliners tend to wait for fall returns or premieres accordingly (see   Y: The Last Man or   The Foundation in 2021). But recent years have seen surprises emerge at the end of spring and become their own critical darlings (HBO&#39;s   Los Espookys) or megafranchises (  Stranger Things). Whether  Sweet Tooth can travel the same surprise path to stardom remains to be seen, but it&#39;s at least nice to have a new show worth following as we enter another summer where travel might be complicated (though, mercifully, not as complicated as it is in  Sweet Tooth).", "posttime": "2021-06-20 21:52:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "充满希望,tooth,甜食", "title": "甜食是充满希望的后期的票价 - 但要注意它的行走的死人氛围 ", "title_en": "Sweet Tooth is hopeful post-apocalyptic fare—but beware its Walking Dead vibes", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/sweet-tooth-is-hopeful-post-apocalyptic-fare-but-beware-its-walking-dead-vibes/", "via": "", "real_tags": ["充满希望", "tooth", "甜食"]}, {"category": "", "categoryclass": "", "imagename": "616bcf9b1e3489cbb30a1f698bb931d1.png", "infoid": 1067036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "@VM_CALL：将我的个人wifi与ssid“％p％s％s％s％s％n”加入后，我的iPhone永久禁用它是WiFi功能。既不重新启动也不改变SSID修复它：〜）\n  现在使用相同的SSID设置热点并使用我的测试设备加入，Wifid即将崩溃。\n  线程2名：调度队列：com.apple.wifid.managerQueueThread 2毁损：0 libsystem_platform.dylib 0x00000001ebcb9724 _platform_strlen + 41的CoreFoundation 0x00000001a381d84c __CFStringAppendFormatCore + 88122的CoreFoundation 0x00000001a381efa8 _CFStringCreateWithFormatAndArgumentsReturningMetadata + 1603 WiFiPolicy 0x00000001d0895f8c  -  [WFLogger WFLog：消息：] + 1924 ??? 0x000000010692C00C 0 + 44052480125 Wifid 0x0000000100f58a74 0x100e40000 + 11495566 wifid 0x0000000100f58c74 0x100e40000 + 1150068\n   v7 = j__cfstringcreatewithcstring_107（0ll，a4,0x8000100u）; //格式字符串如果（v7 ||（v7 = j__cfstringcreatewithcstring_107（0ll，a4,0））！= 0ll）{if（self-＆gt; _destination == 2）{v8 = j__cfstringcreatewithformatandarguments_26（0ll，0ll，v7，v21 ）; V18 [3] =（__int64）v8; }\n  如果（自我和gt; _destination！= 2＆amp;＆amp;（！self-＆gt; _wflrunningonwatchclassdevice || self-＆gt; _wflenabledualloggingonwatchclassdevice））{*（_qword *）＆amp; v16。 tm_sec = 0ll; *（_qword *）＆amp; v16。 tm_hour =＆amp; v16; *（_qword *）＆amp; v16。 tm_mon = 0x2020000000LL; *（_qword *）＆amp; v16。 tm_wday = 0ll; v10 = j__cfstringcreatewithformatandarguments_26（0ll，0ll，v7，v21）; //＆lt;  - 这里\n 使用LLDB调试此问题将是痛苦的，因为这种方法经常击中。相反，将Frida连接到它：Frida-Trace -U Wifid -M＆＃39;  -  [WFlogger WFLOG：消息：]＆＃39;并修改自动生成的脚本一点：\n OnEner（日志，args，州）{const msg =＆＃39;＆＃39; + args [3]。 readutf8string（）;日志（` -  [wflogger wflog：$ {args [2]}消息：$ {msg}]`）; if（msg。索引（＆＃39;％p％s％s％s％s％n＆＃39;）＆gt;  -  1）{（让我= 3; i＆lt; 10; i ++）{日志（args [i]，JSON。stryify（进程。findrangebyaddress（args [i]）））; }日志（＆＃39;从：\\ n＆＃39调用; +线程。backtrace（此。上下文，backtracer。准确）。地图（debugsymbol。fromaddress）。加入（＆＃39; \\ n＆＃39;＆＃39;） +＆＃39; \\ n＆＃39;）; }}， \nV27 = Sub_1000A25D4（V21）; v28 = objc_msgsend（＆amp; objc_class____nsstring，＆＃34; stringwithformat：＆＃34; cfstr（＆＃34;尝试apple80211associateasync到％@＆＃34;），v27）; v29 = objc_msgsend（＆amp; objc_class___nsstring，＆＃34; stringwithformat：＆＃34;，cfstr（＆＃34; {％@ +}％@＆＃34;），cfstr（＆＃34;＆＃34; assoc＆＃34;）， v28）; v30 = objc_autoreleasepoolpush（）; v31 =（void *）qword_100251888; if（qword_100251888）{v32 = objc_msgsend（v29，＆＃34; utf8string＆＃34;）; objc_msgsend（v31，＆＃34; wflog：消息：＆＃34;，3ll，v32）; } objc_autoreleasepoolpop（v30）;\n 它将SSID调匀到格式字符串并将其传递给WFLOG：消息：方法。目的地是3所以它是触发拒绝服务的CFStringCreatewithFormArgument的第二个XREF。\n 为了剥削性，它不会回显，参数的其余部分似乎不像是可控的。因此，我认为这种情况不会被利用。毕竟，要触发此错误，您需要连接到该WiFi，其中SSID对受害者可见。网络钓鱼Wi-Fi门户网站可能更有效。 ", "note_en": "@vm_call:After joining my personal WiFi with the SSID “%p%s%s%s%s%n”, my iPhone permanently disabled it’s WiFi functionality. Neither rebooting nor changing SSID fixes it :~)\n  Now set up a hotspot with the same SSID and use my test device to join, the wifid crashes soon.\n  Thread 2 name: Dispatch queue: com.apple.wifid.managerQueueThread 2 Crashed:0 libsystem_platform.dylib \t0x00000001ebcb9724 _platform_strlen + 41 CoreFoundation \t0x00000001a381d84c __CFStringAppendFormatCore + 88122 CoreFoundation \t0x00000001a381efa8 _CFStringCreateWithFormatAndArgumentsReturningMetadata + 1603 WiFiPolicy \t0x00000001d0895f8c -[WFLogger WFLog:message:] + 1924 ??? \t0x000000010692c00c 0 + 44052480125 wifid \t0x0000000100f58a74 0x100e40000 + 11495566 wifid \t0x0000000100f58c74 0x100e40000 + 1150068\n   v7  =  j__CFStringCreateWithCString_107 ( 0LL ,  a4 ,  0x8000100u );  // the format string  if  (  v7  ||  ( v7  =  j__CFStringCreateWithCString_107 ( 0LL ,  a4 ,  0 ))  !=  0LL  )  {  if  (  self -&gt; _destination  ==  2  )  {  v8  =  j__CFStringCreateWithFormatAndArguments_26 ( 0LL ,  0LL ,  v7 ,  v21 );  v18 [ 3 ]  =  ( __int64 ) v8 ;  }\n  if  (  self -&gt; _destination  !=  2  &amp;&amp;  ( ! self -&gt; _wflRunningOnWatchClassDevice  ||  self -&gt; _wflEnableDualLoggingOnWatchClassDevice )  )  {  * ( _QWORD  * ) &amp; v16 . tm_sec  =  0LL ;  * ( _QWORD  * ) &amp; v16 . tm_hour  =  &amp; v16 ;  * ( _QWORD  * ) &amp; v16 . tm_mon  =  0x2020000000LL ;  * ( _QWORD  * ) &amp; v16 . tm_wday  =  0LL ;  v10  =  j__CFStringCreateWithFormatAndArguments_26 ( 0LL ,  0LL ,  v7 ,  v21 );  // &lt;-- here\n Debugging this issue with lldb will be painful because this method hits too often. Instead, attach frida to it:  frida-trace -U wifid -m &#39;-[WFLogger WFLog:message:]&#39; and modify the auto-generated script a little:\n onEnter ( log ,  args ,  state )  {  const  msg  =  &#39;&#39;  +  args [ 3 ]. readUtf8String ();  log ( `-[WFLogger WFLog: ${ args [ 2 ]}  message: ${ msg } ]` );  if  ( msg . indexOf ( &#39; %p%s%s%s%s%n &#39; )  &gt;  - 1 )  {  for  ( let  i  =  3 ;  i  &lt;  10 ;  i ++ )  {  log ( args [ i ],  JSON . stringify ( Process . findRangeByAddress ( args [ i ])));  }  log ( &#39; called from: \\n &#39;  +  Thread . backtrace ( this . context ,  Backtracer . ACCURATE )  . map ( DebugSymbol . fromAddress ). join ( &#39; \\n &#39; )  +  &#39; \\n &#39; );  }  },\n    v27  =  sub_1000A25D4 ( v21 ); v28  =  objc_msgSend (  &amp; OBJC_CLASS___NSString ,  &#34;stringWithFormat:&#34; ,  CFSTR ( &#34;Attempting Apple80211AssociateAsync to %@&#34; ),  v27 ); v29  =  objc_msgSend ( &amp; OBJC_CLASS___NSString ,  &#34;stringWithFormat:&#34; ,  CFSTR ( &#34;{ %@+} %@&#34; ),  CFSTR ( &#34;ASSOC&#34; ),  v28 ); v30  =  objc_autoreleasePoolPush (); v31  =  ( void  * ) qword_100251888 ; if  (  qword_100251888  ) {  v32  =  objc_msgSend ( v29 ,  &#34;UTF8String&#34; );  objc_msgSend ( v31 ,  &#34;WFLog:message:&#34; ,  3LL ,  v32 ); } objc_autoreleasePoolPop ( v30 );\n It concats the SSID to a format string and pass it to  WFLog:message: method. Destination is 3 so it was the second xref of  CFStringCreateWithFormatAndArguments that triggered the denial of service.\n For the exploitability, it doesn’t echo and the rest of the parameters don’t seem like to be controllable. Thus I don’t think this case is exploitable. After all, to trigger this bug, you need to connect to that WiFi, where the SSID is visible to the victim. A phishing Wi-Fi portal page might as well be more effective.", "posttime": "2021-06-20 21:46:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "格式,analysis,objc", "title": "SSID格式字符串错误的快速分析 ", "title_en": "Quick Analysis for the SSID Format String Bug", "transed": 1, "url": "https://blog.chichou.me/2021/06/20/quick-analysis-wifid/", "via": "", "real_tags": ["格式", "analysis", "objc"]}, {"category": "", "categoryclass": "", "imagename": "423eab2adb2d3dec26b24993299dd876.png", "infoid": 1067035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此工具的目标是使其尽可能简单地通过Python或命令行修复无效的Geojson对象。\n      修复所有类型的Geojson对象，包括FeatuleCollection和Geometry Collection。如果没有什么可以修复该对象，就会返回。\n         您还可以通过调用有效性检查Geojson对象是否有效\n     GJF将默认情况下将文件固定到文件，并输出到Invalid_fixed.geojson。如果您需要以另一种方式引导的输出，则可以使用以下方式使用 - 小图方法。也可以修复多个文件，如下所示。\n    --validate validate geojson文件，并在不试图修复它的情况下打印错误消息如果无效。\n  -o，--output-方法[覆盖| new_file | print]默认为new_file，其中gjf将通过postfix _fixed输出固定的geojson对象。 upereas将将固定的geojson对象写入源文件，覆盖进程中的原始文件。最后，打印将在终端上输出固定的Geojson对象 ", "note_en": "The goal of this tool is to make it as easy as possible to fix invalid GeoJSON objects through Python or Command Line.\n      Fix all types of GeoJSON objects, including FeatureCollection and Geometry Collection. If there is nothing to fix the object will be returned as is.\n         You can also check whether a GeoJSON object is valid or not by calling  validity\n     gjf will fix the file, and output to  invalid_fixed.geojson by default. If you need the output directed in another way you can use  --output-method as directed below. It is also possible to fix multiple files, as below.\n    --validate validate GeoJSON file, and print the error message if it is not valid, without attempting to fix it.\n  -o, --output-method [overwrite|new_file|print] Default is  new_file, where  gjf will output fixed GeoJSON object to file with the postfix  _fixed. Whereas  overwrite will write the fixed GeoJSON object to the source file, overwriting the original file in process. Lastly,  print will output the fixed GeoJSON object on the terminal", "posttime": "2021-06-20 21:46:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "修复,tool,对象", "title": "GJF  - 修复无效地Geojson对象的工具 ", "title_en": "Gjf – A tool to fix invalid GeoJSON objects", "transed": 1, "url": "https://github.com/yazeed44/gjf", "via": "", "real_tags": ["修复", "tool", "对象"]}, {"category": "", "categoryclass": "", "imagename": "752403b4e7ba55e1976a2fb4c830c28a.jpg", "infoid": 1067034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让您忙碌的日子与Axios Am / PM更简单。 赶上什么＆＃39;新的，为什么它只是在5分钟内重要。  订阅AXIOS更接近的洞察洞察日的商业新闻和趋势以及为何重要  订阅Axios Markets，了解最新的市场趋势和经济洞察力。 免费注册。  讨论统计数据和故事，让运动世界与Axios Sports。 免费注册。  从山谷和D.C.使用Axios登录来实现我们的智能技术。 免费注册。  通过Axios Sneak Peek获取内部内幕和第39页的新白宫指南。 免费注册。  每天摘要最重要的故事，影响你的家乡的斧头丹佛 \n获得影响您家乡的最重要故事的日常摘要\n 获得每天消化最重要的故事，影响您的家乡的Axios Twin City\n 获得影响您家乡的最重要的故事的日常摘要，Axios Tampa Bay\n 每天摘要最重要的故事，影响您的家乡的夏洛夏洛特\n 保持最新的最重要和最有趣的故事，影响NW Arkansas，由当地记者撰写\n   根据华尔街日记，在最近的职位上，主要公司在最近的职位上申请了科罗拉多州居民没有资格申请某些偏远职位，因为新的州法律要求企业披露预期的薪资或支付职位的薪酬范围，根据Wall Street Journal。\n 为什么重要：1月份生效的法律旨在帮助接近性别工资差距，并促进员工的工资透明度，但公司已表示无需申请科罗拉多人才能申请避免披露信息。 \n约翰逊＆amp; 根据期刊，Johnson，Cbre，McKesson和Conshiphor和Conshinal Health是在最近的在线列表中添加了此类警告的业务中，根据期刊。  这部大局：企业认为，工资披露法对雇主过于繁琐，而劳工处正在调查排除科罗拉多人的邮资的投诉。  科罗拉多居民仍然可以申请职位，但它＆＃39;如果公司实际认为他们作为候选人，则为未知。 ", "note_en": "Make your busy days simpler with Axios AM/PM. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to Axios Closer for insights into the day’s business news and trends and why they matter\n Subscribe to Axios Markets for the latest market trends and economic insights. Sign up for free.\n Binge on the stats and stories that drive the sports world with Axios Sports. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with Axios Des Moines\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with Axios Tampa Bay\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n   Major companies have said in recent job postings that Colorado residents are ineligible to apply for certain remote positions because a new state law requires businesses to disclose the expected salary or pay range for positions, according to the  Wall Street Journal.\n Why it matters: The law, which went into effect in January, is meant to help close the gender wage gap and to promote wage transparency for employees, but companies have said Coloradans need not apply to avoid disclosing the information.\n Johnson &amp; Johnson, CBRE, McKesson and Cardinal Health are among businesses that have added such caveats in recent online listings for remote positions, according to the Journal.\n The big picture: Businesses have argued that the wage disclosure law is overly burdensome for employers, while the state&#39;s labor department is investigating complaints of postings excluding Coloradans.\n Colorado residents can still apply for the positions, but it&#39;s unknown if companies would actually consider them as candidates.", "posttime": "2021-06-20 21:45:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程,companies,axios", "title": "主要公司要求科罗拉多居民不适用于远程职位 ", "title_en": "Major companies ask Colorado residents not to apply for remote positions", "transed": 1, "url": "https://www.axios.com/remote-jobs-colorado-salary-discloser-law-33ce8a79-1465-44c4-a311-dd1aebfe8921.html", "via": "", "real_tags": ["远程", "companies", "axios"]}]