[{"category": "", "categoryclass": "", "imagename": "8d830fb2b2b33029a548c72ef94be3f6.jpeg", "infoid": 1071858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据 CNBC 获得的初步计划，谷歌正在规划另一个硅谷园区，该园区将毗邻一个部分致力于硬件的新中心。从 2018 年开始，谷歌在加利福尼亚州圣何塞北部的土地上花费了超过 3.89 亿美元，该公司此后提交了详细的初步提案，显示了其对该空间的计划的先见之明。这些作为“研发”设施提交的计划显示了一个硬件运营中心和一个可供公众访问的独立新技术园区，位于其目前位于山景城的总部和最近批准的大型混合用途园区之间在圣何塞。被称为“中点”的未来科技园区将包括五座办公楼，这些办公楼通过一条道路上的人行天桥相连。根据几份规划文件，它将毗邻三座工业建筑，这些建筑将为其硬件部门提供一些业务，包括 Nest 产品。谷歌已经提交了一个“研发”中心的计划，其中包括对三座工业建筑的数百次更新。根据 CNBC 查看的计划和许可，包括会议室、休息区、微型厨房、设备平台、传送带和运输仓库。这些计划提到了“谷歌硬件”和“Nest”，它们指的是该公司的联网家庭业务。据公司发言人称，这些建筑还将存放一般用品和存放当地校园家具等物品。新空间出现之际，谷歌似乎在执行官里克·奥斯特洛 (Rick Osterloh) 的领导下进行了更多的内部硬件工作，他负责监督设备和服务，包括 Nest、谷歌 Home 智能扬声器、其旗舰 Pixel 智能手机和 PixelBook 笔记本电脑。与搜索、YouTube 和谷歌云等核心互联网服务相比，硬件部门为该公司带来的收入微乎其微，但高管们最近表示，今年将试图抢占更多市场份额。谷歌本周宣布了它在硬件方面最认真的尝试，当时它表示将放弃高通芯片并创建自己的芯片，包括用于其旗舰 Pixel 手机的芯片。它还一直在为全国越来越多的数据中心使用自己的芯片。今年 1 月，它完成了对健身追踪硬件公司 Fitbit 的收购，该公司在监管审查中被搁置了​​一年多。特别是一栋建筑正在进行大修。根据计划，该建筑的 20% 被指定为办公空间，80% 被指定为制造、存储、分销和其他用途。文件显示，该公司至少从 2018 年就开始规划该网站。\n“新的内部空间将用于设备仓库、配送和支持办公功能，”该计划指出。计划显示该空间最多可容纳 169 人，但谷歌发言人拒绝透露将容纳多少员工。一份规划文件描述了用海洋主题的物品装饰室内，包括艺术装置、壁画、漂流木口音、来自 Etsy 的贝壳声明件以及悬挂在会议室和培训室天花板上的冲浪板，计划显示。会议室以加利福尼亚州蒙特雷及其周边的海滨地区命名，包括罐头厂街、太平洋格罗夫、渔人码头和德尔蒙特。对场地的其他拟议修改包括停车场重新配置、新设备垫、屋顶设备外壳、ADA 升级和建筑物表面的更新。该公司的计划显示，整个场地有 794 个停车位，其中包括 20 多辆大型或半卡车以及几个电动汽车充电站和一个现场丙烷罐。坐落在工业中心旁边的是一个更传统的科技园区，被称为“中点”，最多可容纳 3,500 名员工。根据 CNBC 查看的计划，该园区需要对现有办公室进行景观美化和建筑更新，而不是全新的开发。该公司没有给出预计 Midpoint 何时完成的时间表。 Mercury News 此前曾报道过其中的一些功能。谷歌房地产和工作场所服务项目主管维尼·巴尔加瓦 (Vini Bhargava) 在今年夏天提交的初步审查请求中写道：“拟议项目的目标是提高行人和自行车的安全性以及建筑物与周围社区之间的连通性。”\n新园区也符合该公司在担心流离失所的情况下向非技术邻居开放的转变。拟议的升级也是因为该公司计划在大流行后时代让更多员工在办公室工作。 Bhargava 补充说，它希望将景观纳入“户外聚会和会议区，为现场员工提供服务”。为此，她提议将混凝土停车场变成绿色的景观场地，使用再生水并种植树木作为自然冷却系统和遮荫处。巴尔加瓦在她的信中补充说，这些新功能旨在“改善野生动物栖息地和授粉机会”​​。初步要求还提出了一个新的“交通枢纽”，为员工提供班车、自行车停放处和过境通行证，以减少单人乘车次数。该枢纽还将包括供通勤者使用的淋浴间、储物柜和更衣室。它将提供通勤班车服务，为来自整个湾区的员工提供巴士服务，Bhargava 表示，“事实证明，与地区平均水平相比，单独开车上班的员工数量显着减少。”", "note_en": "Google is planning yet another Silicon Valley campus, which will sit adjacent to a new center partly devoted to hardware, according to preliminary plans obtained by CNBC.\n Beginning in 2018,  Google spent more than $389 million on land in north San Jose, Calif., and the company has since filed detailed preliminary proposals showing a sneak peak of its plans for the space. The plans, which are filed as an &#34;R&amp;D&#34; facility, show a center for hardware operations and a separate new tech campus that would be accessible to the public, sitting between its current headquarters in Mountain View and its recently approved  mega mixed-use campus in San Jose.\n  Dubbed &#34;Midpoint,&#34; the future tech campus will include five office buildings connected via a pedestrian bridge over a road. It will sit adjacent to three industrial buildings that will house some operations for its hardware division, including Nest products, according to several planning documents.\n  Google has filed plans for an &#34;R&amp;D&#34; center that includes hundreds of updates to three industrial buildings. including meeting rooms, lounge areas, micro kitchens, equipment platforms, conveyor belts and a shipping warehouse, according to plans and permits viewed by CNBC. The plans mention &#34;Google Hardware&#34; and &#34;Nest,&#34; which refers to the company&#39;s connected home business. These buildings will also house general supplies and store items like furniture for local campuses, according to a company spokesperson.\n The new space comes as Google appears to be bringing more hardware efforts in-house under executive Rick Osterloh, who oversees devices and services, including Nest, the Google Home smart speakers, its flagship Pixel smartphone, and the PixelBook laptops. The hardware unit has produced minimal revenue for the company compared with its core internet services like Search, YouTube, and Google Cloud, but executives recently said it would be attempting to  grab more market share this year.\n  Google announced arguably its most serious attempt at hardware this week when  it said it will be ditching Qualcomm chips and creating its own, including those used for its flagship Pixel phone. It also has been using its own chips for its growing number of data centers across the country. In January, it  completed the acquisition of fitness tracking hardware company Fitbit, which had been held up in regulatory review for more than a year.\n One building in particular is getting a major overhaul . 20% of that building is designated for office space and 80% for manufacturing, storage, distribution, and other purposes, according to plans. The company has been planning the site since at least 2018, according to documents.\n  &#34;New interior space will be used for device warehouse, distribution and supporting office functions,&#34; the plans state. Plans show the space can hold up to 169 people but a Google spokesperson declined to specify how many employees it will house.\n  One planning document describes dressing the interior in ocean-themed items, including with art installations, murals, drift wood accents, seashell statement pieces from Etsy and a surfboard suspending on ceilings of meeting and training rooms, plans show. Meeting rooms are named after seaside areas in and around Monterey, Calif., including Cannery Row, Pacific Grove, Fisherman&#39;s Wharf and Del Monte.\n Other proposed modifications to the site include parking lot reconfigurations, new equipment pads, rooftop equipment enclosures, ADA upgrades, and updates to the faces of the buildings.\n The company&#39;s plans show the overall site features 794 parking spaces, including spaces for more than 20 large or semi trucks as well as several EV charging stations and an on-site propane tank.\n   Sitting beside the industrial center is a more traditional tech campus dubbed &#34;Midpoint&#34; that will accommodate up to 3,500 employees. That campus will require landscaping and construction updates to existing offices as opposed to totally new development, according to plans viewed by CNBC.\n The company did not give a timeline for when it expects Midpoint to be completed. The Mercury News previously  reported on some of the features.\n &#34;The goal of the proposed project is to enhance pedestrian and bicycle safety and connectivity between the buildings and the surrounding community,&#34; Vini Bhargava, a project executive with Google&#39;s real estate and workplace services, wrote in a preliminary review request filed this summer.\n  The new campus also falls in line with the company&#39;s shift to  open itself up to its non-tech neighbors amid concerns of displacement. The proposed upgrades also come as the company plans for more employees to work in offices in the post-pandemic era.\n Bhargava added that it wants to incorporate landscaping for &#34;outdoor gathering and meeting areas to serve on-site employees.&#34; To do so, she proposed turning concrete parking lots into green, landscaped sites that uses recycled water as well as planting trees to act as natural cooling systems and shade. The new features aim to &#34;enhance wildlife habitat and pollination opportunities,&#34; Bhargava added in her letter.\n  The preliminary request also proposes a new &#34;transit hub&#34; with shuttles, bike parking and transit passes for employees to reduce single occupant vehicle trips. The hub will also include showers, lockers and changing rooms for commuters.\n It will have a commuter shuttle service that will bus in employees from throughout the Bay Area, which Bhargava said is &#34;proven to significantly reduce the number of employees that drive alone to work compared to the regional average.&#34;", "posttime": "2021-08-07 04:16:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "硬件,谷歌,google,planning,计划", "title": "计划显示，谷歌正在规划一个带有硬件中心的新硅谷园区", "title_en": "Google is Planning a New Silicon Valley Campus With Hardware Hub, Plans Show", "transed": 1, "url": "https://www.cnbc.com/2021/08/06/google-planning-silicon-valley-campus-hardware-lab.html", "via": "", "real_tags": ["硬件", "谷歌", "google", "planning", "计划"]}, {"category": "", "categoryclass": "", "imagename": "6b34abd8de87ec5dd87b1cf4d6923989.jpeg", "infoid": 1071857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook Inc. 的 WhatsApp 消息传递部门抨击 Apple Inc. 计划在 iPhone 上监控儿童的性剥削图片，认为这不利于隐私，从而在全球两家最大的科技公司之间开辟了新战线。 WhatsApp 负责人威尔·卡斯卡特 (Will Cathcart) 周五表示：“这种方法给世界带来了一些非常令人担忧的事情。” “我们不会在 WhatsApp 上采用它。”一天前，苹果公司表示，它计划在今年晚些时候为美国用户发布一个更新，旨在识别和报告儿童性剥削图像的集合，作为它为 iPhone 准备的一系列变化的一部分，以保护儿童免受性侵犯。 WhatsApp 的立场加深了 Facebook 和苹果之间关于数据的斗争。 Facebook 首席执行官马克·扎克伯格 (Mark Zuckerberg) 长期以来一直哀叹他认为苹果对这家社交媒体巨头的业务拥有过大的权力。 Apple 已将保护 iPhone 和其他一些设备上的用户信息作为其向消费者宣传的关键部分，并因 Facebook 的数据收集做法而对其进行了抨击。 《华尔街日报》将向您收取 $ + 税款（如果适用）。您可以随时在客户中心更改您的计费偏好或致电客户服务。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客户服务部取消订阅。", "note_en": "Facebook Inc.’s WhatsApp messaging unit blasted Apple Inc.’s plan to monitor sexually exploitative images of children on iPhones as bad for privacy, opening a new front in the battle between two of the world’s biggest tech companies.\n  “This approach introduces something very concerning into the world,” Will Cathcart, the head of WhatsApp, said Friday. “We will not adopt it at WhatsApp.”\n  Apple a day earlier said it  planned to release an update for U.S. users later this year designed to identify and report collections of sexually exploitative images of children, as part of a series of changes it is preparing for the iPhone to protect children from sexual predators.\n  WhatsApp’s position deepens  the battle between Facebook and Apple about data. Facebook Chief Executive Mark Zuckerberg has long bemoaned what he sees as too much power Apple has over the social-media giant’s business.\n  Apple has made the protection of user information on the iPhones and some other devices a key part of its pitch to consumers and  taken shots at Facebook for its data-collection practices.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-08-07 04:16:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,软件,苹果,apple,安全软件", "title": "Facebook的WhatsApp针对儿童安全软件计划瞄准苹果", "title_en": "Facebook's WhatsApp Takes Aim At Apple Over Child Safety Software Plan", "transed": 1, "url": "https://www.wsj.com/articles/whatsapp-rejects-apples-approach-on-exploitative-images-of-children-11628273991", "via": "", "real_tags": ["facebook", "软件", "苹果", "apple", "安全软件"]}, {"category": "", "categoryclass": "", "imagename": "3e20745a0c4bebe39b7e77e11333c940.jpg", "infoid": 1071856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容 PC 游戏巨头 Valve 出人意料地宣布推出自己的 400 美元便携式游戏机三周后，我飞往该公司位于华盛顿贝尔维尤的总部，旋风式地参观了该公司的最新原型——并有机会将它们与Nintendo Switch 和早期的 AMD 驱动的手持游戏系统 Aya Neo。我使用我的 Steam 帐户登录，在几周或几个月前我在台式游戏 PC 上停下来的地方拿起了《巫师 3》和《控制》，并用拇指杆、精确触摸板和陀螺仪瞄准在《毁灭战士永恒》中咀嚼了几个恶魔。虽然我没有得到诸如如何无缝地安装自己的游戏、具有较慢 eMMC 存储的模型如何工作，或者它在户外工作如何等紧迫问题的答案，但我绝对能够感受到这款便携式设备的舒适度以及如何它拥有强大的力量。进入之后，我们知道预计性能远远领先 Nintendo Switch，但与下一代游戏机的性能相差甚远，因为 Steam Deck 的原始图形功能甚至不到微软入门级 Xbox Series S 的一半。但自从它只需要支持 720p 游戏，而不是 1440p 甚至 1080p，你可能会以四百美元的价格获得惊人的收益：我能够将 The Witcher 3 和 Control 的要求部分调至中等规格而不会感到不舒服。这是比创始人版本 Aya Neo 更高的完整图形层，我通常在最低设置下玩这些游戏，有时仍然陷入困境。当我走进 Valve 的大厅时，我并不一定想到：Steam Deck 在 Nintendo Switch 旁边看起来有多么巨大——然而，它握起来有多舒服。虽然它勉强能放进一个很深的工装裤口袋里（如果你能把“向各个方向凸出”称为合身的话），但我现在相信 Valve，它说 Deck 是为长时间游戏而设计的。我第一次拿起它时，感觉就像我的手指刚刚融入它的把手和凹槽中，将所有控件都放在我的指尖——包括更丰富的操纵杆和比我使用过的僵硬、咔嗒声的控件更深、更柔软的触发器期待来自 Switch 和类似 Switch 的 PC 竞争对手。不过，我不确定我是否喜欢光滑、平顶的操纵杆。即使您可以通过将手指放在隐藏的电容式传感器上来进行一些很棒的陀螺仪瞄准，但您已经可以使用精密触摸板实现相同的技巧，而且我不确定是否值得在操纵杆抓地力方面进行权衡。不过，我需要进行更多测试。虽然我立即注意到与 Switch 相比重量增加了半磅，但在我的简短会议期间并没有让我感到困扰。 Deck 可能更重，但这些原型相对于它们的尺寸来说似乎很轻，有点空洞的感觉——想想看——可能会两极分化。我想知道 Valve 是否会保持这种状态，以及屏幕表面处理和塑料是否会有所改善。在室内，我在 Valve 的光面屏幕和优质蚀刻防眩光处理之间并没有明显的偏好——因为你在防眩光中获得了活力，但我在底盘上发现了一些划痕。我也确实感觉到了一些热量和电池消耗，在我们会话开始时插入的一个单元在一个半小时后几乎没电了。由于 Valve 承诺在玩《传送门 2》时实际电池续航时间为 4 小时，而票价要求较低则可达 8 小时，因此我认为这不正常。 Valve 无法说明这些 EV2 开发人员单元和最终版本之间会有什么具体变化，但构建质量仍在改进中。\n（Valve 在发布后告诉我们，这些单元刚从之前与另一组记者的 1.5 小时会议中出来，这肯定有助于解释这一点，而且我在开始时拍摄的第一张 Steam Deck 照片确实是我的会话显示一个电池指示器没有完全关闭。）Valve 预先表示它肯定仍在解决一些软件错误，例如偶尔冻结或 Prey 如何突然决定我将在我的屏幕上放置一个鼠标光标游戏的中间。昨天在 Valve 总部的一个半小时内，我确实有很多事情无法做，比如深入研究新的 SteamOS（尽管我确实喜欢它看起来更加精简，以及如何轻松地看到哪些游戏是你喜欢的）有 SD 卡和内部驱动器），尝试任何在线或多人游戏，或将其连接到更大的显示器。团队也不会让我们拆掉它——我问过！但是我能够得到一些悬而未决的问题的部分答案，并承诺这不会是 Steam 甲板在 2021 年末/2022 年初发布之前的最后一次观察。作为一个例子，Valve 表示它计划制作自己的视频来准确解释打开 Steam 平台并访问内部结构的含义，因为这绝对是公司计划让你做的事情。 （它有飞利浦头螺钉。）我们已经听说您可以更换 SSD，但公司也非常重视可修复性。 Valve 的 Greg Coomer 说，该公司有一套完整的、细致入微的答案，可以解决您在那里提出的紧迫问题。您可能还记得 Valve 计划为 Steam Deck 提供一个扩展坞，以便轻松输出到电视，虽然这仍在进行中，但该团队表示希望将其与便携式设备一起发货。您可能可以在 Deck 旁边订购一个，但不确定。您将能够从 Steam 平台浏览网站，将您最喜欢的图标添加到您的 Steam 库中，就像您今天在技术上将任何通用 Windows 应用程序添加到 Steam 启动器一样。虽然 Valve 并没有做出肯定的承诺，但该团队表示正在与反作弊制造商“积极讨论”与 Proton 的兼容性，解锁 Apex Legends、Destiny 2、Fortnite、PUBG 和其他不会的游戏在没有那个反作弊软件的情况下运行。 “我们认为我们将推出这款产品，”Valve 的 Erik Peterson 说。\n精确的触摸板仍然具有与 Steam 控制器中相同的古怪的、可听的触觉反馈。 “我们没有尝试让他们播放歌曲，但我相信如果你尝试过，你可以，”一位 Valve 团队成员说。对于依赖 Vulkan API 来实现图形性能的游戏，Valve 将预编译着色器，并在您首次下载和安装游戏文件时将其包含在内，这可以加快首次游戏的启动速度。在这个原型阶段，这可能需要一段时间。团队对 Valve 是否会为 Steam 平台带来任何新游戏或是否会盈利的问题置之不理——“我们不会一头扎进这个领域并损失一大笔钱”——但他们确实向我强烈建议他们不会像制作《半条命：爱莉克斯》那样为 VR 制作专属于便携式设备的游戏，并表示他们不会以同样的方式考虑 Steam 平台的输入。虽然该团队认为一些游戏制造商可能会专门针对便携式设备优化他们的控制，但 Valve 表示，它并没有根据让玩家的手来设计 Steam 平台，即使平台在你的八个手指下方有按钮并且可以感知你的拇指位置.更多的是为 PC 游戏玩家和开发人员提供更多按钮来映射，一位团队成员提出了 Xbox Elite 控制器如何为您提供额外的拨片，这样您就不必将手指从操纵杆上移开。 “更多的是关于投入的质量和投入的数量，”一位团队成员说。但是当我建议我们可以在独立 VR 耳机（如 Oculus Quest）中看到 Steam Deck 的定制 APU 时，Coomer 确实亮了。他说他喜欢这个问题。 “我们还没有准备好对此发表任何意见，但它会在那种环境下运行良好，需要 TDP……这与我们和我们的未来计划非常相关，”他说。更新，美国东部时间下午 2 点 22 分：Valve 告诉我们，我们看到电池寿命低的原因是因为早先的小组简报，所以当我们开始时，他们没有充满电。更正：我们玩的是《毁灭战士永恒》，而不是《毁灭战士终极》，这将是一个不那么令人印象深刻的表现。", "note_en": "Skip to main content                                                                                                                Three weeks after PC gaming giant  Valve surprise-announced its own $400 portable game console, I flew to the company’s headquarters in Bellevue, Washington, for a whirlwind tour of the company’s latest prototypes — and a chance to compare them to the Nintendo Switch and an earlier AMD-powered handheld gaming system,  the Aya Neo.\n I logged in with my Steam account, picked up  The Witcher 3 and  Control right where I left off weeks or months ago on my desktop gaming PC, and chewed through a few demons in  Doom Eternal with thumbsticks, precision touchpads, and gyroscopic aiming. While I didn’t get answers to burning questions like how seamlessly you can install your own games, how the model with slower eMMC storage works, or how well it works outdoors, I was absolutely able to feel how comfortable this portable might be and how much power it has on tap.\n Going in, we knew to expect performance far ahead of a Nintendo Switch but not nearly that of a next-gen game console  since the Steam Deck has slightly less than half the raw graphical muscle of even Microsoft’s entry-level Xbox Series S. But since it only has to power 720p gaming, not 1440p or even 1080p, you may get a surprising amount of bang for your four hundred bucks: I was able to turn up demanding sections of  The Witcher 3 and  Control to medium spec without feeling uncomfortable. That’s a full graphical tier higher than the founder’s edition Aya Neo, where I’m typically playing those games on lowest settings and sometimes still bogging down.\n  What I didn’t necessarily envision when I walked into Valve’s lobby: just how gigantic the Steam Deck looks next to a Nintendo Switch — and yet, how much more comfortable it is to hold. While it just barely fits into a deep cargo pants pocket (if you can call “bulges out in every direction” a fit), I now believe Valve when it says the Deck was sculpted for long play sessions.\n The first time I picked it up, it felt like my fingers just melted into its grips and grooves, placing every control at my fingertips — including far meatier joysticks and a deeper, softer throw to its triggers than the stiff, clicky controls I’ve come to expect from the Switch and Switch-like PC competitors. I’m not sure I’m a fan of the smooth, flat-topped joysticks, though. Even though you can do some awesome gyroscopic aiming by leaving your finger on the hidden capacitive sensor there, you can already pull that same trick with the precision touchpad, and I’m not sure it’s worth the trade-off in joystick grippyness. I’d need to test more, though.\n  While I immediately noticed the extra half-pound of weight compared to the Switch, it didn’t bug me during my brief session. The Deck may be heavier, but these prototypes seem light for their size, with a slightly hollow feeling that — come to think of it — might be polarizing. I wonder if Valve will keep it that way and if the screen finish and the plastics might improve. Indoors, I didn’t really have a clear preference between Valve’s glossy screen and the premium etched anti-glare treatment — since what you gain in anti-glare you lose in vibrancy — and I spotted a few scratches on the chassis.\n I also definitely felt some heat and battery drain, with one unit that was plugged in at the beginning of our session nearly dead after an hour and a half. Since Valve promised four hours of real-world battery life playing  Portal 2 and up to eight hours with less demanding fare, I imagine that’s not normal. Valve couldn’t say what will specifically change between these EV2 developer units and final, but that build quality is still being improved.\n (Valve told us after publish that these units just came out of a previous 1.5 hour session with a different group of journalists, which would definitely help explain that, and it’s true that the very first photo I shot of the Steam Deck at the beginning of my session showed a battery indicator that wasn’t completely topped off.)\n And Valve was upfront that it’s definitely still working out some software bugs, like the occasional freeze or how  Prey suddenly decided I was going to have a mouse cursor atop my screen in the middle of the game.\n  There’s a lot I really wasn’t able to do in an hour and a half at Valve’s HQ yesterday, like dig in deep on the new SteamOS (though I do like how much more streamlined it looks and how you can easily see which games you’ve got on an SD card and the internal drive), try any online or multiplayer gaming, or hook it up to a bigger monitor. The team also wouldn’t let us tear it down — I asked!\n But I was able to get some partial answers to some lingering questions and a promise that this won’t be the last look at the Steam Deck ahead of its late-2021 / early-2022 launch.\n As one example, Valve says it’s planning to produce its own video to explain exactly what it means to open up the Steam Deck and access the internals, because that’s definitely a thing the company’s planning to let you do. (It has Philips-head screws.) We’d already heard  you can swap the SSD, but reparability is very much on the company’s mind as well. Valve’s Greg Coomer says the company has a complete set of nuanced answers to your burning questions there.\n You might also remember that Valve plans to offer a docking station for the Steam Deck to easily output to a TV, and while that’s still in the works, the team says it’s hoping to ship that alongside the portable. It’s possible you might be able to order one alongside the Deck, though not for certain.\n  You’ll be able to browse websites from the Steam Deck, adding icons for your favorites to your Steam library the same way you can technically add any generic Windows app to the Steam launcher today. And while Valve isn’t promising it for sure, the team says it’s “in active discussions” with anti-cheat makers about getting compatibility with Proton,  unlocking games like  Apex Legends, Destiny 2, Fortnite, PUBG, and others that won’t run without that anti-cheat software. “We think we’re going to have that for launch,” said Valve’s Erik Peterson.\n The precision touchpads still have the same kind of quirky, audible haptic feedback as they did in the Steam Controller. “We haven’t tried to make them play songs, but I’m sure you could if you tried,” said one Valve team member.\n With games that rely on the Vulkan API for graphics performance, Valve will be pre-compiling the shaders and including them when you first download and install game files, which could speed up first-time game launches. In this prototype phase, that can take a while.\n  The team brushed off questions about whether Valve would bring any new games to the Steam Deck or whether it’s going to be profitable — “We’re not going to dive into this and lose a bunch of money” — but they did  strongly suggest to me that they wouldn’t make any games exclusive to portables the way they made  Half-Life: Alyx exclusive to VR, saying they don’t think about the Steam Deck’s inputs the same way.\n While the team believes some game manufacturers might specifically optimize their controls for portables, Valve says it didn’t design the Steam Deck in terms of giving the player  hands, even though the Deck has buttons under eight of your fingers and can sense your thumb position. It was more about having more buttons for PC gamers and developers to map, and one team member brought up how the Xbox Elite controller gives you extra paddles so you don’t have to take your fingers off the sticks. “It’s more about quality of inputs and quantity of inputs,” said one team member.\n But Coomer did light up when I suggested maybe we could see the Steam Deck’s custom APU in a standalone VR headset, like the Oculus Quest. He said he loved the question. “We’re not ready to say anything about it, but it would run well in that environment, with the TDP necessary... it’s very relevant to us and our future plans,” he said.\n  Update, 2:22PM ET:  Valve tells us the reason we saw low battery life was because of an earlier group briefing, so they weren’t at full charge when we began.\n Correction:  We played Doom Eternal, not Doom Ultimate, which would be   a far less impressive showing.", "posttime": "2021-08-07 04:15:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,设计,电脑,steam,valve", "title": "Valve Steam Deck 动手操作：比其他掌上电脑游戏设备更好地处理资源密集型游戏，出色的人体工程学设计，陀螺仪瞄准功能运作良好", "title_en": "Valve Steam Deck hands-on: handles resource-intensive games better than other handheld PC gaming devices, great ergonomics, gyroscopic aiming feature works well", "transed": 1, "url": "https://www.theverge.com/2021/8/6/22612886/valve-steam-deck-handheld-gaming-pc-hands-on-preview?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["游戏", "设计", "电脑", "steam", "valve"]}, {"category": "", "categoryclass": "", "imagename": "c9a7e0c0c27b4df4bbcfda59ac239611.jpeg", "infoid": 1071855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "爱荷华州司法部门雇佣的两名黑客闯入法院以测试安全措施，他们正在起诉一名以盗窃罪逮捕他们的警长，声称他无视他们的“免费出狱”信并错误地拘留了他们。根据 7 月 30 日提起的诉讼，Gary DeMercurio 和 Justin Wynn 于 2019 年受雇于网络安全公司 Coalfire，当时该公司接受了与州政府的合同，对五座不同的建筑物进行“网络安全测试活动，包括物理渗透”。在爱荷华州地方法院。诉讼称，两人负责于 2019 年 9 月 10 日晚在达拉斯县法院进行“物理攻击”，例如撬锁。因此，当 DeMercurio 和 Wynn 闯入并触发警报，促使治安官的副手到达时，他们迅速出示了爱荷华州政府的授权书，并向副手保证他们应该在那里。代表们甚至打电话给爱荷华州司法部门的代表进行确认，似乎对“免费出狱”的信感到满意，但诉讼称，“当 [Sheriff Chad] Leonard 到达时，情况发生了变化。”诉讼称，伦纳德拒绝接受这封信，并命令他的副手逮捕 DeMercurio 和 Wynn。最终，这对夫妇被戴上手铐，财产被没收，以 50,000 美元的保释金被关押在监狱中 20 小时，并被指控犯有三级盗窃罪和拥有窃贼工具。但他们的律师 Marty Diaz 告诉 Insider，除了在监狱里度过一个不舒服的夜晚之外，他的客户还因被捕而遭受了公民权利的侵犯、羞辱、精神痛苦和情绪困扰。迪亚兹说，两年后，他的客户继续受到这起事件的影响。他说，他们错过了潜在的工作机会，因为在谷歌上搜索他们的名字会显示潜在雇主关于他们被捕的新闻报道以及他们的面部照片。\n迪亚兹补充说，伦纳德利用他的客户作为他对州政府的抱怨的“替罪羊”，州政府聘请了煤火公司担任这项工作。迪亚兹说：“警长的立场是，这是一座县建筑，因此只有县才能授权这项服务。”但他辩称，法院由爱荷华州经营，该州有权授权闯入。 “警长不知道这一点。警长只相信一件事——无论是真实的，还是骄傲或傲慢，这是必须解决的问题，”迪亚兹说。 “他对国家可以在他认为是县级财产上这样做的态度持一种态度。” DeMercurio 和 Wynn 的诉讼寻求未指明的损害赔偿，“其数额将阻止 [伦纳德] 和其他类似的人，从这种行为的未来。”达拉斯县警长办公室没有向 Insider 提供评论，但在一份声明中告诉 Des Moines Register，“我们否认请愿书中提出的主张，并随时准备在法庭上为自己辩护。”如果您通过本文中的推荐链接购买商品，Microsoft 和合作伙伴可能会获得补偿。在新窗口中打开 打开外部站点 在新窗口中打开外部站点", "note_en": "Two hackers who were hired by Iowa&#39;s judicial branch to break into courthouses to test security measures are suing a sheriff who arrested them on burglary charges, alleging that he ignored their &#34;get out of jail free&#34; letter and wrongfully detained them.\n    Gary DeMercurio and Justin Wynn were employed by the cybersecurity firm Coalfire in 2019 when the company accepted a contract with the state government to conduct &#34;cybersecurity testing activities, including physical penetration&#34; on five different buildings, according to the lawsuit, which was filed July 30 in Iowa District Court.\n The pair were responsible for conducting &#34;physical attacks,&#34; such as lockpicking, on the Dallas County Courthouse on the evening of September 10, 2019, the lawsuit said. So when DeMercurio and Wynn broke in and tripped an alarm, prompting sheriff&#39;s deputies to arrive, they quickly produced an authorization letter from the Iowa government and reassured the deputies they were meant to be there.\n The deputies even phoned an Iowa Judicial Branch representative for confirmation and seemed satisfied with the &#34;get out of jail free&#34; letter, but the lawsuit said, &#34;when [Sheriff Chad] Leonard arrived, the situation changed.&#34;\n Leonard refused to accept the letter, and ordered his deputies to arrest DeMercurio and Wynn, the lawsuit said. Ultimately, the pair were handcuffed, had their property seized, were held in jail for 20 hours on a $50,000 bond, and were charged with third-degree burglary and possession of burglar tools.\n         But their lawyer, Marty Diaz, told Insider that beyond just one uncomfortable night in jail, his clients suffered a violation of their civil rights, humiliation, mental anguish, and emotional distress as a result of the arrests.\n Diaz said his clients continue to be affected by the incident two years later. They have missed out on potential job opportunities, he said, because Googling their names shows prospective employers news stories of their arrests paired with their mugshots.\n Diaz added that Leonard used his clients as &#34;scapegoats&#34; for his gripe with the state government, which had hired Coalfire for the job.\n &#34;The sheriff&#39;s position was that this is a county building, and therefore only the county can authorize the service,&#34; Diaz said. But the courthouse is operated by the state of Iowa, which had the right to authorize the break-in, he argues.\n &#34;The sheriff didn&#39;t know that. The sheriff believed only one thing - whether it was genuine or whether it was pride or hubris, that&#39;s something that will have to be ironed out,&#34; Diaz said. &#34;He had an attitude about the fact that the state could do this on what he considered to be county property.&#34;\n DeMercurio and Wynn&#39;s lawsuit seeks unspecified damages &#34;in an amount that will deter [Leonard], and others similarly situated, from such conducting the future.&#34;\n The Dallas County Sheriff&#39;s Office did not provide Insider with a comment,  but told the Des Moines Register in a statement that &#34;we deny the claims made in the petition and stand ready to defend ourselves in court.&#34;\n  Microsoft and partners may be compensated if you purchase something through recommended links in this article.\n                Opens in a new window  Opens an external site  Opens an external site in a new window", "posttime": "2021-08-07 04:15:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,起诉,suing,爱荷华州", "title": "2 黑客起诉爱荷华州警长，他们因渗透测试而监禁他们", "title_en": "2 Hackers are suing the Iowa sheriff who imprisoned them for pentesting", "transed": 1, "url": "https://www.msn.com/en-us/news/crime/dbhub.io-is-awesome/ar-AAMZ9oD", "via": "", "real_tags": ["黑客", "起诉", "suing", "爱荷华州"]}, {"category": "", "categoryclass": "", "imagename": "08ac3c0b974355ed48e0e78723e6f5d4.png", "infoid": 1071854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apple 宣布了新的客户端内容扫描（基于从中心收到的参数），以查找要报告给执法人员的儿童性虐待材料。根据 Apple 的公告，将这些内容上传到 iCloud（Apple 的云）时会发生这种情况，并且当使用仅限于设备时（即不是上传到 iCloud 时，但例如在发送包含这些内容的消息时），它将选择加入）。我想强调的是，这是 Apple 当前的公告。会永远这样吗？不太可能：如果目的是分析存储在 iCloud 上的内容，鉴于它没有加密，一旦将其上传到服务器，分析它会容易得多，就像 Dropbox、Microsoft 等一样。不是犯罪分子不是无论如何都会接触到这样的内容（你最近收到过这样的材料吗？？）。儿童安全组织对苹果的举措表示赞赏，认为它们取得了必要的平衡，“让我们更接近于为那些最痛苦的时刻在网上传播的幸存者伸张正义”。尽管这些材料很可恶，但我们真的相信选择加入客户端扫描会消除这些行为吗？犯罪分子会选择加入吗？我们真的相信客户端扫描上传到 iCloud 的内容会根除它们吗？我们认为犯罪分子会使用 iCloud 进行交易吗？我想再次强调，这是当前宣布的功能。很容易预见，随着时间的推移，执法人员的压力会越来越大，以超越选择加入制度，因此不仅限于 iCloud。如果您可以像所有其他提供商一样集中进行，那么仅针对 iCloud 进行客户端扫描还有什么意义呢？很明显，客户端扫描是为了客户端扫描。一旦有了这个功能，使用它的请求就会增加。\n立即开始使用一般客户端扫描可能不会被用户和法律社区接受。但是仅针对 iCloud 开始，针对所有可能的犯罪中最可恶的，使客户端扫描更容易被接受。而那些反对它的人似乎是在与犯罪分子纵容。这与我们一次又一次听到的关于压缩隐私权以支持增加安全性的论点相同。但是这个等式（更少的隐私=更多的安全性）只是表面上成立的。更少的隐私意味着更多的数据，更多的数据并不意味着更多的信息，更多的信息并不意味着更多的安全。 （还记得情报机构知道 9.11 攻击的威胁吗？还有许多其他的……（几乎全部，在欧洲））。我们真的认为犯罪分子在普通网站上交易 CSAM 吗？还是通过普通消息？或者将它们存储在由大公司运营的公共云服务器上？......但这个想法对执法人员非常有吸引力，明天就有可能挖掘用户的内容，而不必让他们的生活复杂化安装木马。这是执法部门可以使用的后门的梦想。但是当安装了后门时，后门就存在了，历史告诉我们，它也被坏人和专制政权使用只是时间问题。以上问题也有其他重要评论家提出过，比我做的更好。但我还想补充一个角度：考虑到他们以前在隐私保护方面的立场，苹果为什么要这样做，为什么现在要这样做？然后转到此链接，点击“浏览”并选择您刚刚保存的文件；将“隐藏位”仪表移至 3 并查看输出。这不是魔术，而是非常简单的、有五个世纪历史的数学。您甚至可以使用密码对其进行加密以获取有效负载，如果您不知道这个小秘密，则可能无法分辨。客户端扫描几乎无法阻止犯罪分子，除非您完全控制用户可以在其设备上安装哪些应用程序。 （以及他们如何使用它们）。\n但这正是现在针对 Apple 提起的一些反垄断诉讼的情况，理由是他们据称通过严格控制 App Store 来剥夺平台上的垄断权力，他们是决定哪些应用程序可以使用的看门人。或者用户无法在他们的设备上安装。 Apple 过去可以随时引入客户端扫描，但现在，由于这一举措，Apple 将能够告诉最高法院和 FTC 的叙述，例如……他们刚刚发布了这个漂亮的工具，这将有助于执法人员打击这些可恶的罪行，但前提是他们可以严格控制用户安装的应用程序如果你站在设备中立一边，你就是站在犯罪分子一边最终，为了有一个有效的（？）执法，唯一的可能性是硬件和软件制造公司对用户可以使用的软件进行全面控制，事实上成为各州的数字执法机构。如果这不是完全的反乌托邦，我不知道什么是反乌托邦……", "note_en": "Apple has announced the new client-side content scanning (based on parameters received from the center) to find child sexual abuse materials to be reported to law enforcers.\n As per Apple’s announcement, that will happen when uploading those content to iCloud (Apple’s cloud) and it will be opt-in when usage is limited to the device (i.e. not when uploading to iCloud, but for example when sending a message with those contents).\n I want to stress that this is  Apple’s current announcement. Is it going to be forever so ? Quite unlikely: if the purpose is to analyze content stored on iCloud, given it’s not encrypted, it would be much easier to analyze it once it’s uploaded to the servers, as it is the case with Dropbox, Microsoft, etc.\n  not criminals are not exposed to such content anyway (have you received such material recently ??).\n Children’s safety groups praised Apple’s moves, arguing that they strike a necessary balance which “brings us a step closer to justice for survivors whose most traumatic moments are disseminated online”.\n As abominable as these materials can be, do we  really believe that opt-in client-side scanning will do something to eradicate those behaviors ? Do we thing criminals will opt in ? Do we really believe that client side scanning of content uploaded to iCloud will eradicate them ? Do we think criminals use iCloud for their trades ?\n I want to stress again that this is the  current announced feature. It is easily forseeable that over time pressure by law enforcers will increase to move  past the opt-in regime and thus not only for iCloud. What else would be the point of having client side scanning just for iCloud if you could do it centrally as all other providers do ? Quite obviously, client side scanning is for client side scanning. And once there’s that feature, requests to use it will increase.\n Having started  right away with general client side scanning would  likely not have been  acceptable by the user and by legal communities. But starting just for iCloud, just for the most abominable of all possible crimes, makes client side scanning more acceptable. And those who oppose it appear to be conniving with criminals. This is the same argument we have heard time and again for the compression of privacy rights in favor of a supposed increase of security. But this equation (less privacy = more security) is only apparently founded. Less privacy equals more data, more data does not equal more information and more information does not equal more security. (remember intel agencies knew the menace of 9.11 attacks ? And many others… (almost all, in Europe)).\n Do we really think criminals trade CSAM in plain-sight web sites ? Or via ordinary messages ? Or store them on public cloud servers run by major corporations ?…\n But the idea is very attractive to law enforcers, tomorrow’s possibility to dig into users’ content without having to complicate their lives installing trojans. It’s the dream of a backdoor available to law enforcement. But when a backdoor is installed, the backdoor exists and history teaches that it’s only a matter of time before it’s also used by the bad guys and authoritarian regimes.\n The above issues have also been raised by other important commentators and better than I have done. But there’s one more angle I want to add:   Why is Apple doing it, given their previous stances on privacy safeguards,   and why are they doing it now ?.\n  then go to  this link , hit ‘browse’ and select the file you just saved; move the “hidden bits” gauge to 3 and see the output.\n This ain’t magic, but  very simple, five centuries old mathematics. You could even encrypt it with a password to obtain the payload and it may be impossible to tell, if you don’t know the little secret.\n  Client side scanning can do little to stop criminals, unless you have a full control of what apps users can install on their devices. (and how they can use them).\n But this is precisely the case of some antitrust actions that are now being brought forward against Apple on the basis that they purportedly excise a monopolistic power on the platform, by their tight control of the App Store where they are the gatekeepers who decide which apps can or can’t be installed by users on their devices.\n Apple could have introduced client-side scanning anytime in the past, but now, thanks to this move, Apple will be able to tell the supreme court and the FTC narratives like…\n They have just released this beautiful tool, that will help law enforcers combat these abominable crimes, but only if they can tightly control apps installed by users\n If you’re siding with  device neutrality you’re siding with the criminals\n Eventually, in order to have an effective (?) law enforcement, the only possibility is that hardware and software manufacturing companies exercise a total control on the software users can use, de facto becoming states’ digital-law-enforcement  agencies.\n If this isn’t a total dystopia, I don’t know what dystopia is…", "posttime": "2021-08-07 04:14:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,预防,abuse", "title": "Apple 新的滥用预防系统：反垄断/竞争的观点", "title_en": "Apple’s new abuse prevention system: an antritust/competition point of view", "transed": 1, "url": "https://blog.quintarelli.it/2021/08/apples-child-new-abuse-prevention-system-an-antritustcompetition-point-of-view.html", "via": "", "real_tags": ["apple", "预防", "abuse"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在他们在毒气室被谋杀或被枪杀 75 多年后，纳粹迫害的同性恋受害者本周在阿姆斯特丹被放置了“绊脚石”。荷兰大约有 8,500 块 Stolpersteine，（绊脚石），这些黄铜纪念牌镶嵌在街道上，呼吁路人记住纳粹种族灭绝和压迫的个别受害者，这是一种迫使行人回忆过去的精神“绊脚石” .据在该项目中发挥主导作用的荷兰历史学家朱迪思·舒伊夫 (Judith Schuyf) 称，本周安放的四块石头是荷兰第一块纪念犹太人和已知同性恋者的抵抗战士。 “在荷兰，一直在讨论同性恋者并没有在战争中真正受到迫害，”她说。她知道并非如此，已经确定了几名犹太人和抵抗战士，他们在警察档案中被确定为同性恋者。 “他们被捕是因为他们是同性恋；他们被送到集中营是因为他们是犹太人，”她说。 “他们死得更早，他们没有机会让许多犹太人不得不躲藏起来。这很复杂，但我很确定他们被捕是因为他们是同性恋。”对非犹太抵抗运动工作者的审判也提到了性行为，其中包括本周与 Sto lperstein 一起纪念的 Karel Pekelharing。他是一名艺术家，他加入了抵抗运动，通过伪造身份证件和帮助犹太人躲藏来破坏对犹太人的迫害。 1944 年 3 月，Pekelharing 参加了对 Weteringschans 监狱的大胆突袭，目的是解放抵抗战士。攻击失败。一周后，他被捕并遭受酷刑。 1944 年 6 月，他和六名战友在北海的沙丘中被枪杀。另一块石头让人想起米娜·斯鲁伊特 (Mina Sluijter)，她是一名裁缝，她于 1942 年 7 月在荷兰犹太人开始驱逐出境时被捕。她的警方档案称她“因同性恋而被拘留......也是犹太人”。被捕两个月后，她在奥斯威辛集中营被谋杀。\n总共有九名纳粹迫害的同性恋受害者正在被铭记。十月初，还将在街上铺设另外五块手工制作的黄铜牌匾。九人中有六人是犹太人，四人是抵抗运动的工人。九位乐团指挥和大提琴家弗里达·贝林凡特 (Frieda Belinfante) 中的一位是犹太抵抗运动工作者。在逃到瑞士后，她是战争中幸存下来的九个人中唯一的一个。荷兰犹太人的生存机会低于邻国比利时和法国。荷兰四分之三的犹太人被杀。大约 102,000 人在死亡集中营被谋杀，2,000 人自杀或在试图逃跑时死亡。当地活动人士认为，同性恋受害者被忽视了。 “我们认为这些人通常没有任何可以为他们申请 Stolperstein 的孩子、伴侣或亲戚，这让我们感到非常难过。我们想给他们起个名字，”组织人行道纪念碑的荷兰 COC 发言人菲利普·蒂斯马 (Philip Tijsma) 说。 COC 荷兰是一个 LGBTQ+ 权利组织，由前抵抗运动的工人于 1946 年创立，他们说“永远不再受压迫”。 Tijsma 说，看到周二安放的前四个 Stolpersteine 是“一个非常激动人心的时刻”。 “因为你站在房子前面，他们住在房子前，直到他们被运送到奥斯威辛或索比堡被摧毁或被枪杀的前一天……这就是斯托尔珀斯坦的事情；它使历史变得非常接近，它使它几乎有形，这就是他们走过的地方，就在这条人行道上。”", "note_en": "More than 75 years after they were murdered in the gas chambers or shot, gay victims of Nazi persecution were remembered with “stumbling stones” laid in Amsterdam this week.\n The Netherlands has about 8,500   Stolpersteine, (stumbling stones), the brass memorial plaques embedded in the street that call on passers-by to remember individual victims of the Nazi genocide and oppression, a mental “stumbling” that forces pedestrians to reckon with the past.\n  Four stones laid this week are the first in the  Netherlands to commemorate Jews and resistance fighters who were known to be gay, according to the Dutch historian Judith Schuyf, who played a leading role in the project.\n “There was always a discussion in the Netherlands that gays and lesbians hadn’t been really persecuted in the war,” she said. She knew otherwise, having identified several Jews and resistance fighters, who were identified as gay or lesbian in police files.\n “They were arrested because they were gay; they were sent to the camps because they were Jewish,” she said. “They died earlier and they didn’t have the opportunity that many Jews had to go into hiding. It is complicated but I am quite sure they were arrested because they were gay.”\n Sexuality was also cited in the trial of non-Jewish resistance workers, including Karel Pekelharing, who was commemorated with a  Sto lperstein this week. He was an artist who joined the resistance and worked to sabotage the persecution of the Jews by forging ID papers and helping Jews in hiding. In March 1944, Pekelharing took part in a daring raid on the Weteringschans prison with the aim of freeing resistance fighters. The attack failed. A week later he was arrested and tortured. In June 1944 he and six fellow fighters were shot in dunes by the North Sea.\n Another stone remembers Mina Sluijter, a seamstress who was arrested in July 1942, as the deportation of Dutch Jews was starting. Her police file states she was “in detention for homosexuality … also Jewish”. She was murdered at Auschwitz two months after her arrest.\n Altogether, nine gay victims of Nazi persecution are being remembered. A further five brass handmade plaques will be laid in the street in early October. Six of the nine were Jewish and four were resistance workers. One of the nine, orchestra conductor and cellist Frieda Belinfante was a Jewish resistance worker. She was the only one of the nine who survived the war, after escaping to Switzerland.\n The chances of survival for Dutch Jews were lower than in neighbouring Belgium and France. Three-quarters of the Jewish population of the Netherlands were killed. About 102,000 were murdered in death camps and 2,000 committed suicide or died attempting to escape.\n Local activists believe gay victims have been overlooked. “We thought it was very sad that these people, who often didn’t have any children or partners or relatives who could request a  Stolperstein for them just disappeared. We wanted to give them a name,” said Philip Tijsma, a spokesman for COC Netherlands, which organised the pavement memorials.\n COC Netherlands is an LGBTQ+ rights group, which was founded in 1946 by former resistance workers, who said “never again to oppression”.\n Seeing the first four  Stolpersteine laid on Tuesday was “quite an emotional moment,” Tijsma said. “Because you are standing in front of the houses were they lived until just the day before they were either transported to Auschwitz or Sobibor to be destroyed, or were shot … That’s the thing about the  Stolperstein; it brings history very close, it makes it almost tangible, this is where they walked, on this very sidewalk.”", "posttime": "2021-08-07 04:13:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "绊脚石,stumbling,犹太人", "title": "阿姆斯特丹“绊脚石”纪念纳粹的同性恋受害者", "title_en": "Amsterdam ‘stumbling stones’ commemorate gay victims of Nazis", "transed": 1, "url": "https://www.theguardian.com/world/2021/aug/06/amsterdam-stumbling-stones-commemorate-gay-victims-of-nazis", "via": "", "real_tags": ["绊脚石", "stumbling", "犹太人"]}, {"category": "", "categoryclass": "", "imagename": "7bb08f949e83d2af176d039845be0347.png", "infoid": 1071851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自 Napster 时代以来，数字音乐领域已经走过了漫长的道路，如今，这意味着大量付费订阅服务正在努力以合法的方式提供您能想象到的所有音乐。但是让您最喜欢的音乐家获得音乐订阅费用仍然是一个症结所在。就音乐家而言，Apple Music 仍然是更好的支付服务之一，该公司官方估计每首流媒体歌曲最多支付一美分，而 Spotify 每流支付不到半美分——而这些支出可以删除基于每个服务在后台运行的任何古怪的电子表格演算。无论哪种方式，数学都可以证明；到目前为止，您每月 10 美元或 15 美元只能在数百首歌曲流之间分配。如果您愿意为下载的音乐打开钱包，那么今天 Bandcamp Fridays 促销活动的回归是对支付不足的订阅服务的巨大平衡。这是一个很好的借口，可以将 Bandcamp 作为在线购买音乐的功能丰富、适合移动设备的选择。 Bandcamp Fridays 于 2020 年初推出，旨在为乐队和艺人带来更多资金，尤其是在如此多的 COVID-19 巡演取消之后。在促销活动进行的一个月的第一个星期五通过 Bandcamp 购买任何纯数字内容，该服务将放弃其正常的艺人收入分成（默认情况下为 15%，一旦用户收入超过 5,000 美元，则为 10%）过去 12 个月）。近一年来，促销活动一直保持每个第一个星期五的节奏，然后以看似不可预测的方式跳过了几个月。本周，Bandcamp 已确认 Bandcamp Friday 促销活动将在 2021 年余下时间继续进行。从数字版权的角度来看，很容易推荐 Bandcamp 作为店面，因为任何购买都包括无限制下载无 DRM 的音频文件 - 而且您可以在无损 FLAC、未压缩 WAV 和各种其他有损和无损格式之间进行选择。如果您还没有准备好购买，Bandcamp 还可以让艺术家们轻松地启用不间断预览听他们的歌曲和专辑，以及在一台机器使用预览后可选的“您已经听够了，也许会买”的唠叨特色几次。一旦你通过 Bandcamp 购买了任何东西，你就可以在 Android 和 iOS 上使用该服务的移动应用程序下载离线副本，查看你以前购买的艺术家的新闻更新，并访问 Bandcamp 策划的播放列表。尤其是这个应用程序，在过去的一年里在功能和稳定性方面都非常成熟。与其他流行的数字店面（包括 Steam 和 Epic Games Store 等游戏服务）相比，Bandcamp 正常的 15% 收入削减肯定具有竞争力。这让我更有可能在一个月的第一个星期五以外的日子购买，尽管我承认 Bandcamp Fridays 驱使我参加这项服务，作为一种在我看不到他们的音乐会时支付我最喜欢的艺术家的方式。从那时起，Bandcamp 赢得了我的青睐，成为首选的音乐服务和日常使用的应用程序。 （如果您是国际用户，您可以使用各种兼容货币在 Bandcamp 购物，无论是使用其内置的付款处理程序还是 Paypal，我很欣赏。）今天太平洋时间午夜之前，您可以充分利用本月的免费促销活动。巨大的 Bandcamp 用户在这里。喜欢支持我最喜欢的艺术家是多么容易，而且似乎平台上的艺术家比以往任何时候都多。好久没有在别处买专辑了。值得指出的一件事是，如果您要从某人那里订购实体记录，您也可以立即下载数字文件。", "note_en": "The digital music universe has come a long way since the  Napster era, and these days, that means a good number of paid subscription services are angling to serve all the music you could imagine in a legally acceptable package. But getting music-subscription dollars into your favorite musicians&#39; hands remains a sticking point. As far as musicians are concerned,  Apple Music is still one of the better payout services, with the company officially estimating  as much as one penny paid per streamed song, while  Spotify maxes out at less than half a penny per stream—and those payouts can drop based on whatever wacky spreadsheet-calculus each service runs in the background. Either way, that math checks out; your $10 or $15 per month can only be divided so far between hundreds of song streams.\n If you&#39;re willing to open your wallet a little wider for downloaded music, today&#39;s return of the  Bandcamp Fridays promotion is a massive counterbalance to underpaying subscription services. And it&#39;s a good excuse to point to  Bandcamp as a feature-rich, mobile-friendly option for buying music online.\n  Bandcamp Fridays launched in early 2020 as a way to drive more money into bands&#39; and artists&#39; pockets, especially after so many COVID-19 tour cancellations. Buy any digital-only content via Bandcamp on the first Friday of a month when the promotion is active, and the service waives  its normal cut of artist revenue (which is 15 percent by default and 10 percent once a user exceeds $5,000 USD in revenue over the past 12 months). The promotion stuck to its every-first-Friday cadence for nearly a year before skipping some months in seemingly unpredictable fashion. This week, Bandcamp has confirmed that the Bandcamp Friday promotion will resume for the rest of 2021.\n      From a digital-rights perspective, it&#39;s easy to recommend Bandcamp as a storefront, since any purchase includes unlimited downloads of DRM-free audio files—and you can choose between lossless FLAC, uncompressed WAV, and a variety of other lossy and lossless formats. If you&#39;re not ready to buy, Bandcamp also makes it easy for artists to enable uninterrupted preview listens of their songs and albums, along with an optional &#34;you&#39;ve listened enough, maybe buy it&#34; nag after a single machine uses the preview feature a few times. And once you buy anything via Bandcamp, you can use the service&#39;s mobile app on Android and iOS to download offline copies, see news updates from artists you&#39;ve bought from previously, and access Bandcamp-curated playlists. This app, in particular, has matured greatly over the past year on both feature and stability fronts.\n Bandcamp&#39;s normal 15 percent revenue cut is certainly competitive compared to other popular digital storefronts, including gaming services like Steam and Epic Games Store. That&#39;s made me more likely to buy on days other than the first Friday of a month, though I&#39;ll admit that Bandcamp Fridays drove me to the service as a way to pay my favorite artists when I can&#39;t see them in concert. Since then, Bandcamp has won me over as a preferred music service and app for daily use. (And if you&#39;re an international user, you can shop at Bandcamp using  a wide range of compatible currencies, whether using its built-in payment processing or Paypal, which I appreciate.) You have until midnight Pacific Time today to take advantage of this month&#39;s waived-fee promotion.\n  Huge Bandcamp user here. Love how easy it is to support my favorite artists, and it seems as if more of them than ever are on the platform. Haven&#39;t had to buy an album from anywhere else in a while.   One thing not mentioned that&#39;s worth pointing out is that if you were to order a physical record from someone, you also get access to download digital files immediately as well.", "posttime": "2021-08-07 03:34:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,bandcamp", "title": "我喜欢 Bandcamp 的原因：周五免收费用，可靠的应用程序，无 DRM，更多", "title_en": "Why I love Bandcamp: Waived-fee Fridays, solid app, no DRM, more", "transed": 1, "url": "https://arstechnica.com/gaming/2021/08/today-is-bandcamp-friday-put-100-of-your-music-purchases-in-bands-hands/", "via": "", "real_tags": ["程序", "bandcamp"]}, {"category": "", "categoryclass": "", "imagename": "6acc550c71e4a623f5523bd0551481f7.jpg", "infoid": 1071849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这会很有趣，而且因为是周五，既轻松又亲切。 （为了好玩，这是我去年与 Lessin 一起参加的一个长篇播客。）Lessin 指出，风险投资家曾经对经常倒闭的公司进行了冒险的押注。高于平均水平的投资风险意味着赢得赌注的回报必须非常丰厚，否则风险投资模式就会失败。因此，风险资本家将他们的资本高价出售给创始人。风险资本家历来为高增长科技新贵的创业股权支付的价格使 IPO 流行显得微不足道；当一家科技公司上市时，是风投们表现得像强盗，而不是银行家。华尔街的工作人员刚刚在奶碟上跑了最后一圈。然而，随着时间的推移，事情发生了变化。创始人可以依靠 AWS 而不必在服务器机架和托管上花费股权。更多人更好地理解了构建软件并将其推向市场的过程。更重要的是，经常性费用超过了以一次性价格销售软件的传统方法。这使得软件公司的收入不像视频游戏公司的收入那样，受情节发布的驱动并取决于市场对任何特定产品的下一个版本的接受程度。随着 SaaS 的接管，软件收入保持了利润丰厚的毛利率，但变得更持久、更可靠。他们变得更好了。并且更容易预测开机。软件构建和分发革命的另一个结果——更高级的编程语言、智能手机、应用程序商店、SaaS 以及如今与 API 交付相结合的按需定价——是更多的资金可以投入到忙于编写代码的公司中。较低的风险意味着其他形式的资本发现创业投资——开始时处于超后期阶段，但在创业生命周期中越来越早——不仅可能，而且相当有吸引力。\n随着越来越多的资本品种对私营科技公司产生兴趣，部分原因是风险降低，定价发生了变化。或者，正如莱辛所说，由于有更好的市场能力来衡量创业机会和风险，“所有投资者[现在]对[创业公司]的定价或多或少都差不多。”你可以看到这是怎么回事：如果是这样的话，那么出售昂贵的资本以获得巨大的上涨空间的模型就会变得有点潮湿。如果风险较小，那么风险投资家就不能对他们的资本收取那么多的费用。他们的回报状况可能会发生变化，随着更便宜、更充裕的资金追逐交易，导致更高的价格和更低的回报。以上所有的结果都是莱辛的结论：“所有迹象似乎都表明，到 2022 年，非传统科技投资者——包括对冲基金、共同基金等——将首次投资于私营科技公司，而不是传统的硅谷。硅谷式的风险投资家会。”资本涌入曾经为风险投资界的高官保留的金融领域，这意味着世界上的风险投资公司发现自己经常与各种新的、更富有的参与者争夺交易。根据莱辛的说法，这样做的结果是风险投资“围绕软件和互联网投资成长起来并认为自己是风险投资家的公司”必须“像一条小鱼一样进入更大的池塘，或者去寻找另一个小池塘。”对Lessin 论点的明显批评是他自己提出的，即他所讨论的内容与种子投资无关。正如莱辛所说，他的论点对种子投资的影响“远不那么清楚”。同意。当然，正如我们所知，这是风险投资的终结。但这并不是风险投资的终结，因为如果资本主义要继续下去，风险投资总是需要冒险押注在底部。\n使后期 SaaS 投资一些即使是白痴也能赚几美元的因素在初创公司的早期看起来变得稀缺。投资于软件以外的领域会加剧这种影响；如果您仅仅因为存在公共云而试图将生物技术初创公司视为比以前风险更低，那么您将一事无成。因此，Lessin 的论点在种子阶段和早期投资中的重要性不如在初创公司支持的后期阶段重要，而在早期投资非软件公司时则更不重要。虽然这是一个鲜为人知的事实，但一些风险投资家仍然投资于不以软件为重点的初创公司。当然，几乎每家初创公司都涉及代码，但你可以通过建立初创公司，尤其是科技初创公司，以多种方式赚到很多钱。搞清楚 SaaS 投资并不意味着投资市场，例如，风险也有类似的下降。那么，Lessin 是否正确，游戏中后期软件投资真的发生了变化？当然有，但我认为他将风险较低的私人市场软件投资的概念带入了错误的方向。首先，即使私募市场投资软件的风险比以前低，但也不是零。许多软件初创公司将失败或停滞不前，充其量只能以适度的价格出售。今天的市场和以前一样多吗？可能不是，但仍有一些。这意味着采摘行为仍然很重要；只要我们想知道风险投资家将如何为交易支付更具竞争力的价格，我们就可以随意修改，但风投可以在初创公司选择方面保持优势。这可以限制不利因素，但也可能做得更多。 Skyflow 的 Anshu Sharma——我之前在 Salesforce 和 Storm Ventures 工作，我第一次见到他的地方——在本周早些时候就这个特别的观点提出了论点，我对此表示同情。\nSharma 认为，我也同意，风险投资的赢家越来越大。回想一下，一家价值 10 亿美元的私人公司曾经是一件罕见的事情。现在他们每天都在建造。最大的软件公司不值微软在 1998 年至 2019 年间的估值中的几千亿美元。今天，它们价值数万亿美元。更简单地说，在风险和价值创造方面更具吸引力的软件市场意味着异常值比以前更加异常。这意味着那些选择得很好的风险投资家，是的，比以前更早，仍然可以产生疯狂的回报。也许比以前更是如此。这就是我听到的关于某些基金目前表现的信息。如果Lessin 的观点像他所说的那样有力，我认为我们会看到顶级风险投资公司的回报率下降。我们不是，至少根据我所听到的。 （如果我错了，请随时告诉我。）是的，风险投资正在发生变化，与过去的风投相比，大型基金确实越来越像完全不同类型的资本经理。资本主义正在发生在风险投资中，随着货币世界本身的发展而改变它。服务是 VC 试图区分彼此的一种方式，可能与非风险资本来源区分开来，尽管在服务战争开始时讨论较少。但即使是速战速决的老虎也不能投资每家公司，也不是所有的赌注都会得到回报。您可能会决定，最好将资金投入规模较小、交易节奏稍有节制的基金中，让您信任的基金经理选择将您的资金分配到其他集合资本中，为您下注。这样您就可能获得高于平均水平的回报。", "note_en": "This will be fun, and, because it’s Friday, both relaxed and cordial. (For fun, here’s a  long-ass podcast I participated in with Lessin last year.)\n  Lessin notes that venture capitalists once made risky wagers on companies that often withered away. Higher-than-average investment risk meant that returns from winning bets had to be very lucrative, or else the venture model would have failed.\n Thus, venture capitalists sold their capital dearly to founders. The prices that venture capitalists have historically paid for startup equity in high-growth tech upstarts make IPO pops appear de minimis; it’s the VCs who make out like bandits when a tech company floats, not the bankers. The Wall Street crew just gets a final lap at the milk saucer.\n Over time, however, things changed. Founders could lean on AWS instead of having to spend equity capital on server racks and colocation. The process of building software and taking it to market became better understood by more people.\n Even more, recurring fees overtook the traditional method of selling software for a one-time price. This made the revenues of software companies less like those of video game companies, driven by episodic releases and dependent on the market’s reception of the next version of any particular product.\n As SaaS took over, software revenues kept their lucrative gross margin profile but became both longer-lasting and more dependable. They got better. And easier to forecast to boot.\n   Another result of the revolution in both software construction and distribution — higher-level programming languages, smartphones, app stores, SaaS and, today, on-demand pricing coupled to API delivery — was that more money could pile into the companies busy writing code. Lower risk meant that other forms of capital found startup investing — super-late stage to begin with, but increasingly earlier in the startup lifecycle — not just possible, but rather attractive.\n With more capital varieties taking interest in private tech companies thanks in part to reduced risk, pricing changed. Or, as Lessin puts it, thanks to better market ability to metricize startup opportunity and risk, “investors across the board [now] price [startups] more or less the same way.”\n You can see where this is going: If that’s the case, then the model of selling expensive capital for huge upside becomes a bit soggy. If there is less risk, then venture capitalists can’t charge as much for their capital. Their return profile might change, with cheaper and more plentiful money chasing deals, leading to higher prices and lower returns.\n The result of all of the above is Lessin’s lede: “All signs seem to indicate that by 2022, for the first time, nontraditional tech investors — including hedge funds, mutual funds and the like — will invest more in private tech companies than traditional Silicon Valley-style venture capitalists will.”\n Capital crowding into the parts of finance once reserved for the high priests of venture means that the VCs of the world are finding themselves often fighting for deals with all sorts of new, and wealthier, players.\n The result of this, per Lessin, is that venture “firms that grew up around software and internet investing and consider themselves venture capitalists” must “enter the bigger pond as a fairly small fish, or go find another small pond.”\n  The obvious critique of Lessin’s argument is one that he makes himself, namely that what he is discussing is not as relevant to seed investing. As Lessin puts it, his argument’s impact on seed investing is “far less clear.”\n Agreed. Sure, it’s the end of venture capital as we know it. But it’s not the end of venture capital, because if capitalism is going to continue, there’s always going to need to be risky-ass shit for VCs to bet on at the bottom.\n The factors that made later-stage SaaS investing something that even idiots can make a few dollars doing become scarce the earlier one looks in the startup world. Investing in areas other than software compounds this effect; if you try to treat biotech startups as less risky than before simply because public clouds exist, you are going to fuck up.\n So the Lessin argument matters less in seed-stage and earlier investing than it does in the later stages of startup backing, and doubly less when it comes to earlier investing in non-software companies.\n While it’s a little-known fact, some venture capitalists still invest in startups that are not software-focused. Sure, nearly every startup involves code, but you can make a lot of money in a lot of ways by building startups, especially tech startups. The figuring-out of SaaS investing does not mean that investing in marketplaces, for example, has enjoyed a similar decline in risk.\n  Is Lessin correct, then, that the game really has changed for middle- and late-stage software investing? Of course it has, but I think that he takes the concept of less risky, private-market software investing in the wrong direction.\n First, even if private-market investing in software has a lower risk profile than before, it’s not zero. Many software startups will fail or stall out and sell for a modest sum at best. As many in today’s market as before? Probably not, but still some.\n This means that the act of picking still matters; we can vamp as long as we’d like about how venture capitalists are going to have to pay more competitive prices for deals, but VCs could retain an edge in startup selection. This can limit downside, but may also do quite a lot more.\n Anshu Sharma of  Skyflow — and formerly of Salesforce and Storm Ventures, where I first met him — made an argument about this particular point earlier this week with which I am sympathetic.\n Sharma thinks, and I agree, that venture winners are getting bigger. Recall that a billion-dollar private company was once a rare thing. Now they are built daily. And the biggest software companies aren’t worth the few hundred billion dollars that Microsoft was largely valued at between 1998 and 2019. Today they are worth several trillion dollars.\n More simply, a more attractive software market in terms of risk and value creation means that outliers are even more outlier-y than before. This means that venture capitalists that pick well, and, yes, go earlier than they once did, can still generate bonkers returns. Perhaps even more so than before.\n This is what I am hearing about certain funds regarding their present-day performance. If Lessin’s point held up as strongly as he states it, I reckon that we’d see declining rates of return at top VCs. We’re not, at least based on what I am hearing. (Feel free to tell me if I am wrong.)\n  So yes, venture capital is changing, and the larger funds really are looking more and more like entirely different sorts of capital managers than the VCs of yore. Capitalism is happening to venture capital, changing it as the world of money itself evolves. Services were one way that VCs tried to differentiate from one another, and probably from non-venture capital sources, though that was discussed less when The Services Wars were taking off.\n But even the rapid-fire Tiger can’t invest in every company, and not all its bets will pay out. You might decide that you’d be better off putting capital into a slightly smaller fund with a slightly more measured cadence of dealmaking, allowing selection at the hand of fund managers that you trust to allocate your funds among other pooled capital to bet for you. So that you might earn better-than-average returns.", "posttime": "2021-08-07 03:33:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,capital", "title": "风险投资可能还没死", "title_en": "\n\t\t\t\tVenture capital probably isn’t dead\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/venture-capital-probably-isnt-dead/", "via": "", "real_tags": ["风险投资", "capital"]}, {"category": "", "categoryclass": "", "imagename": "55a975a2de3d9cda7e0e82b898c9b995.jpg", "infoid": 1071848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Kenny Small 是全球领先的 AI 驱动的质量工程公司 Qualitest Group 的 SAP 和企业副总裁。选择开辟自己的道路来产生销售的在线零售商经常想知道他们如何与亚马逊竞争。现实情况是，亚马逊真正独特的销售主张是其分销网络。在线零售商将无法​​在这一点上竞争，因为亚马逊的分销网络太快了。相反，重要的是专注于他们可以擅长的领域——而不必成为亚马逊平台上的第三方卖家。以下是与在线零售商相关的七个关键提示，这些在线零售商希望吸引和留住客户，而不必与亚马逊合作或试图在自己的游戏中击败它。在线零售商需要考虑它想要创造什么样的体验；客户希望在线购物旅程的每一步都能顺利进行。一个想法是实施一个消费者数据平台，帮助零售商深入了解他们的客户：他们是谁，他们喜欢什么，他们经常访问哪些网站以及其他相关信息。零售商可以使用这些数据，然后针对客户实际想要购买的产品投放广告。消费者数据平台甚至可以帮助在线零售商跨平台以及店内定位消费者。在线零售商最大的挫折之一是网站的性能，从进入网站到销售结束。如果在搜索产品和付款过程中的任何时候出现故障或小故障，客户将离开而不会回来。\n此问题的解决方案涉及对用户界面的大量测试，以确保良好的用户体验。应该对网站上的所有电子商务细分市场进行测试，包括购物篮和广告横幅。通过在客户旅程中插入标签，零售商可以跟踪销售损失并查看其网站上发生的问题。作为一种支付方式，PayPal 最近在 2019 年第三季度和 2020 年第三季度之间的支付量同比增长了创纪录的 36%。 尽管 PayPal 很受欢迎，但亚马逊并不接受它作为一种支付方式。", "note_en": "Kenny Small is vice president SAP and Enterprise at  Qualitest Group, the world’s leading AI-powered quality engineering company.\n  Online retailers that have opted to forge their own path to generate sales often wonder how they can compete with Amazon.\n  The reality is that Amazon’s true unique selling proposition is its distribution network. Online retailers will not be able to compete on this point because Amazon’s distribution network is so fast. Instead, it’s important to focus on areas where they can excel — without having to become a third-party seller on Amazon’s platform.\n The following are seven key tips that are relevant for online retailers that want to attract and retain customers without having to partner with Amazon or to try to beat it at its own game.\n  An online retailer needs to consider what kind of experience it wants to create; customers expect smooth processes on every step of their online shopping journey.\n One idea is to implement a consumer data platform that will help the retailer gain the best insights into their customers: who they are and what they like, which websites they frequent and other relevant information. Retailers can use this data to then target customers with ads for products they’ll actually want to buy. Consumer data platforms can even help online retailers target consumers across platforms as well as in the store.\n  One of the biggest frustrations with online retailers is the performance of a website, from getting on the site through the closing of the sale. If something fails or glitches at any point in the process of searching for a product and paying for it, the customer will leave and not come back.\n The solution to this problem involves a lot of testing of the user interface to ensure a good user experience. Tests should be done on all e-commerce segments on a site, including the basket and ad banners. By inserting tags along the customer journey, a retailer can track lost sales and see where problems happen on their website.\n  As a payment option, PayPal recently experienced a record  36% year-on-year growth in payment volume between the third quarter of 2019 and Q3 2020. Despite PayPal’s popularity, Amazon does not accept it as a form of payment.", "posttime": "2021-08-07 03:33:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,停止,retailers,零售商", "title": "在线零售商：停止试图击败亚马逊", "title_en": "\n\t\t\t\tOnline retailers: Stop trying to beat Amazon\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/online-retailers-stop-trying-to-beat-amazon/", "via": "", "real_tags": ["amazon", "亚马逊", "停止", "retailers", "零售商"]}, {"category": "", "categoryclass": "", "imagename": "2621e56d877fdfd85ca2a2f15fd5a932.jpg", "infoid": 1071847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在每年将 ARR 增长 100% 或更多的企业中，增长团队出现的可能性是其两倍。更重要的是，在实现产品市场匹配之后，它们似乎也更常见——通常是在一家公司的收入达到约 500 万至 1000 万美元之后。我不是要告诉你为什么需要一个增长团队，但我会指出，拥有增长团队的产品主导型企业会看到显着的结果——免费到付费转化率中位数的两倍。根据产品基准调查的回应，增长团队已经从向营销和销售的报告转变为直接向 CEO 报告。一些关于增长团队的早期文章说，他们可以单独构建为自己的独立团队，也可以作为特警模型，组织中其他各个部门的专家会聚在一起以固定的节奏来解决增长问题。我的经验以及我从以业务用户为中心的软件公司收集的数据使我得出结论，业务软件中的增长团队不应该被构建为“特警”团队，跨职能领导聚集在一起进行批判性思考关于企业面临的增长问题。我发现如果问题没有真正的主人，它们就不会得到解决。增长问题也不例外，除非有人的工作是考虑这些问题，否则通常会被优先考虑。注重产品的增长专家：这些人都是关于优化用户体验、减少摩擦和扩大使用。他们通常具有很强的分析能力，并且可能具有产品、数据或 MarketingOps 背景。", "note_en": "Growth teams are twice as likely to appear among businesses growing their ARR by 100% or more annually. What’s more, they also seem to be more common after product-market fit has been achieved — usually after a company has reached about $5 million to $10 million in revenue.\n  I’m not here to sell you on why you need a growth team, but I will point out that product-led businesses with a growth team see dramatic results — double the median free-to-paid conversion rate.\n   According to responses from  product benchmarks surveys, growth teams have transitioned dramatically from reporting to marketing and sales to reporting directly to the CEO.\n Some of the early writing on growth teams says that they can be structured individually as their own standalone team or as a SWAT model, where experts from various other departments in the organization converge on a regular cadence to solve for growth.\n  My experience, and the  data I’ve collected from business-user focused software companies, has led me to the conclusion that growth teams in business software should not be structured as “SWAT” teams, with cross-functional leadership coming together to think critically about growth problems facing the business. I find that if problems don’t have a real owner, they’re not going to get solved. Growth issues are no different and are often deprioritized unless it’s someone’s job to think about them.\n   Product-minded growth experts: These folks are all about optimizing the user experience, reducing friction and expanding usage. They’re usually pretty analytical and might have product, data or MarketingOps backgrounds.", "posttime": "2021-08-07 03:32:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "构建,structure,增长", "title": "如何雇用和构建增长团队", "title_en": "\n\t\t\t\tHow to hire and structure a growth team\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/how-to-hire-and-structure-a-growth-team/", "via": "", "real_tags": ["构建", "structure", "增长"]}, {"category": "", "categoryclass": "", "imagename": "2d30c840f8a2c540a6cd1f7ef9da2567.jpg", "infoid": 1071846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能驱动的声音在你耳边能帮助缩小这个差距吗，哪怕只是一点点？ SenpAI.GG 是 Y Combinator 最新一批中的一家公司，也是这么认为的。大部分上述差距归结为练习、肌肉记忆和——让我们面对现实——自然能力。但是随着游戏变得更老/更大/更复杂，最好的玩家往往拥有丰富的一种资源，这些资源非常重要，如果收集起来不是非常有趣的话：信息。哪些枪在这个范围内造成的伤害最大？哪个角色最适合对抗这张地图上的那个角色？见鬼，当您启动游戏时，屏幕上闪过的“小更新”发生了什么变化？等等，为什么我最喜欢的武器突然变得更难控制了？在玩家发现新战术和更新时掌握所有这些信息，改变“元”本身就是一个挑战。它通常涉及大量 Twitch 流、大量围绕 Reddit 线程的挖掘以及大量研究补丁说明。 SenpAI.GG 正在寻求自动显示更多此类信息并帮助新玩家更快地变得更好。他们的桌面客户端为您提供它认为可以提供帮助的信息、对您的策略的赛后分析，以及您可能还不太擅长跟踪的游戏内音频提示。它目前支持少数游戏——英雄联盟、Valorant 和 Teamfight Tactics——它提供的信息因游戏而异。例如，在 LoL 中，它会查看两支队伍选择的冠军，并尝试推荐您可以选择最能帮助您的英雄；与此同时，在《Valorant》中，当您忘记重新加载或忘记重装多久时，它可以为您提供音频提示，提示您的一位队友健康状况不佳（在该队友开始对您大喊大叫之前）在 Spike（阅读：游戏结束炸弹）爆炸之前得到。与它提供的信息一样重要的是它不会提供的信息。在我和他的聊天中，SenpAI.GG 创始人 Olcay Yilmazcoban 似乎很清楚这里有一条难以定义的界限，其中“助手”模糊为“作弊工具”——但公司遵循某些规则来保持正确的一面并防止他们的球员被禁止。\n例如，他们永远不会代表玩家采取行动——他们可能会发出音频提示说“嘿，你应该治愈那个队友”，但他们不会为你按下按钮。他们只会根据您屏幕上的内容生成实时洞察，而不是运行过程中隐藏的任何内容。他们也不会仅仅因为您的队友也在运行该应用程序并且可以看到他们而做诸如透露敌人位置之类的事情。想想“站在你的肩膀上的好球员”，而不是“墙上的黑客”。该公司表示，他们始终遵守每个游戏开发商的竞争公平准则，并且只使用经批准/提供的 API。这是一个好主意，因为它可以说是永远不会过时的。他们支持的每款新游戏都会为新的潜在受众提供服务。与此同时，旧游戏/见解似乎不会过期——游戏的大书你需要知道的东西往往只会随着游戏年龄的增长和补丁的堆积而变得更大和更复杂。有些游戏我已经玩了很多年了，我仍然喜欢语音助手说“哦，嘿，你刚拿起枪的后坐力自上次玩以来变得更加强烈。” SenpAI.GG 还没有出现，但有很大的自然增长空间。 Yilmazcoban 告诉我，他们目前有超过 400,000 名活跃用户，有一个由 11 人组成的团队在努力。基本应用程序是免费的，并计划以每月几美元的价格提供高级功能。", "note_en": "Could an AI-driven voice in your ear help close that gap, if only a bit?  SenpAI.GG, a company out of Y Combinator’s latest batch, thinks so.\n Much of that aforementioned gap boils down to practice, muscle memory and — let’s face it — natural ability. But as a game gets older/bigger/more complex, the best players tend to have a wealth of one resource that’s oh-so-crucial, if not oh-so-fun to gather: information.\n Which guns do the most damage at this range? Which character is best suited to counter that character on this map? Hell, what changed in that “minor update” that flashed across your screen as you were booting up the game? Wait, why is my favorite weapon suddenly so much harder to control?\n Staying on top of all this information as players discover new tactics and updates shift the “meta” is a challenge in its own right. It usually involves lots of Twitch streams, lots of digging around Reddit threads and lots of poring over patch notes.\n SenpAI.GG is looking to surface more of that information automatically and help new players get good, faster. Their desktop client presents you with information it thinks can help, post-game analysis on your strategies, plus in-game audio cues for the things you might not be great at tracking yet.\n It currently supports a handful of games — League of Legends, Valorant and Teamfight Tactics — with the info it provides varying from game to game. In LoL, for example, it’ll look at both teams’ selected champions and try to recommend the one you could pick to help most; in Valorant, meanwhile, it can give you an audio heads-up that one of your teammates is running low on health ( before said teammate starts yelling at you to heal them), when you’ve forgotten to reload or how long you’ve got before the Spike (read: game-ending bomb) explodes.\n   Just as important as the information it provides is the information it  won’t provide. In my chat with him, SenpAI.GG founder Olcay Yilmazcoban seemed very aware that there’s a hard-to-define line here where “assistant” blurs into “cheating tool” — but the company follows certain rules to stay on the right side of things and prevent their players from getting banned.\n They won’t, for example, ever take action on a player’s behalf — they might fire an audio cue to say “hey, you should heal that teammate,” but they won’t press the button for you. They’ll only generate their real-time insights from what’s on  your screen — not anything hidden within the running process. They also won’t do things like reveal an enemy’s location just because your teammate is also running the app and can see them. Think “good player standing over your shoulder,” not “wall hack.” The company says that they’re always within each game developer’s competitive fairness guidelines, and only work with approved/provided APIs.\n It’s a good idea because it’s one that, arguably, never gets old. With each new game they support, they’ve got a new potential audience to serve. Meanwhile, it’s not as if the old games/insights will expire — a game’s big ol’ book-of-stuff-you-need-to-know tends to only get bigger and more complex as a game ages and the patches pile up. There are games I’ve been playing for  years where I’d still love a voice assistant that says “Oh hey, the recoil on the gun you just picked up has gotten way more intense since the last time you played.” SenpAI.GG isn’t there yet, but there’s a ton of natural room for growth.\n Yilmazcoban tells me that they currently have over 400,000 active users, with a team of 11 people working on it. The base app is free, with plans to offer advanced features for a couple bucks a month.", "posttime": "2021-08-07 03:32:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,游戏,ai", "title": "SenpAI.GG 想成为你的人工智能视频游戏教练", "title_en": "\n\t\t\t\tSenpAI.GG wants to be your AI-powered video game coach\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/senpai-gg-wants-to-be-your-ai-powered-video-game-coach/", "via": "", "real_tags": ["人工智能", "游戏", "ai"]}, {"category": "", "categoryclass": "", "imagename": "1ed3ddd9272f13d0d927b620993f4846.jpg", "infoid": 1071845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "天基太阳能项目至少从 2013 年开始就一直在进行，当时唐纳德和布伦的第一笔捐款通过了。唐纳德·布伦 (Donald Bren) 是尔湾公司 (Irvine Company) 的董事长和加州理工学院董事会成员，在《大众科学》(Popular Science) 中听说了太空太阳能的想法后，他提议资助该大学的一个研究项目——从那时起，他已经捐赠了超过 1 亿美元为目的。直到本周加州理工学院将其公开时，资金来源一直保持匿名。这个想法是从当前可再生能源的局限性中自然产生的。太阳能在地表上无处不在，但当然高度依赖于天气、季节和一天中的时间。没有太阳能电池板，即使在理想情况下，也不能一直满负荷工作，因此问题就变成了在智能电网中传输和存储能量的问题。地球上没有太阳能电池板，就是这样。然而，在轨道上的太阳能电池板可能几乎一直都暴露在太阳的全部光线下，并且不会因为光线穿过行星的保护性大气层和磁层而降低其功率。 SSPP 研究员 Harry Atwater 在加州理工学院发布的新闻稿中说：“这个雄心勃勃的项目是为地球收集大规模太阳能的一种变革性方法，它克服了这种间歇性和储能需求。”当然，您首先需要收集足够的能量，这是值得做的，并且您需要一种方法将能量向下发射到表面，同时不会将大部分能量损失到上述保护层中不会煎炸任何经过其路径的东西。这些基本问题在过去十年中得到了系统的研究，团队很清楚，如果没有 Bren 的支持，这个项目是不可能实现的。试图在争取资助和轮换研究生的同时完成这项工作可能根本无法完成，但稳定的资金意味着他们可以聘请长期研究人员并克服可能阻碍他们前进的早期障碍。该小组已经制作了数十项已发表的研究和原型（您可以在此处仔细阅读），包括一个数量级制造的最轻的太阳能收集器-发射器，现在即将发射其第一颗天基测试卫星。\n“[Launch] 目前预计将在 2023 年第一季度，”该项目的联合主管 Ali Hajimiri 告诉 TechCrunch。 “它涉及几个用于空间验证工作的关键技术的演示者，即远距离无线电力传输、轻量级柔性光伏和灵活的可部署空间结构。”这些将是小规模的测试（大约 6 英尺宽），但愿景是更大的。事实上，它比目前太空中的任何东西都大。 Hajimiri 说：“最终的系统预计由多个可部署的模块组成，以紧密编队飞行并相互同步运行。” “每个模块的侧面都有几十米，随着时间的推移，可以通过添加更多模块来构建系统。”最终，这个概念需要一个可能大到 5-6 公里的结构。别担心——它离地球足够远，你不会看到一个巨大的六边形挡住星星。电力将使用定向的、可控的微波传输发送到地表的接收器。其中一些在轨道上可以全时向地球上的任何位置发射能量。当然，这是远景，如果要实现的话，还需要很多很多年。但是不要错误地认为这是有一个雄心勃勃的，甚至可以说是宏伟的目标。对这一想法的追求在太阳能电池、灵活的太空结构和无线电能传输方面取得了进展，每一项都可以应用于其他领域。愿景可能是科幻小说中的东西，但科学正在以一种非常扎实的方式进步。就他而言，布伦似乎很高兴能够将球推进到他认为可能根本不会尝试的重要任务上。 “多年来，我一直是一名研究太空太阳能可能应用的学生，”他告诉加州理工学院。 “我对支持加州理工学院世界级科学家的兴趣源于我相信利用太阳的自然力量造福所有人。”", "note_en": "The Space-based Solar Power Project has been underway since at least 2013, when the first donation from Donald and Brigitte Bren came through. Donald Bren is the chairman of Irvine Company and on the Caltech board of trustees, and after hearing about the idea of space-based solar in Popular Science, he proposed to fund a research project at the university — and since then has given over $100M for the purpose. The source of the funds has been kept anonymous until this week,  when Caltech made it public.\n The idea emerges naturally from the current limitations of renewable energy. Solar power is ubiquitous on the surface, but of course highly dependent on the weather, season, and time of day. No solar panel, even in ideal circumstances, can work at full capacity all the time, and so the problem becomes one of transferring and storing energy in a smart grid. No solar panel  on Earth, that is.\n A solar panel in orbit, however, may be exposed to the full light of the sun nearly all the time, and with none of the reduction in its power that comes from that light passing through the planet’s protective atmosphere and magnetosphere.\n  “This ambitious project is a transformative approach to large-scale solar energy harvesting for the Earth that overcomes this intermittency and the need for energy storage,” said SSPP researcher Harry Atwater in the Caltech release.\n Of course, you would need to collect enough energy that it’s worth doing in the first place, and you need a way to beam that energy down to the surface in a way that doesn’t lose most of it to the aforementioned protective layers but also doesn’t fry anything passing through its path.\n  These fundamental questions have been looked at systematically for the last decade, and the team is clear that without Bren’s support, this project wouldn’t have been possible. Attempting to do the work while scrounging for grants and rotating through grad students might have prevented its being done at all, but the steady funding meant they could hire long-term researchers and overcome early obstacles that might have stymied them otherwise.\n The group has produced dozens of published studies and prototypes (which you can peruse  here), including the lightest solar collector-transmitter made by an order of magnitude, and is now on the verge of launching its first space-based test satellite.\n “[Launch] is currently expected to be Q1 2023,” co-director of the project Ali Hajimiri told TechCrunch. “It involves several demonstrators for space verification of key technologies involved in the effort, namely, wireless power transfer at distance, lightweight flexible photovoltaics, and flexible deployable space structures.”\n  These will be small-scale tests (about 6 feet across), but the vision is for something rather larger. Bigger than anything currently in space, in fact.\n “The final system is envisioned to consist of multiple deployable modules in close formation flight and operating in synchronization with one another,” Hajimiri said. “Each module is several tens of meters on the side and the system can be build up by adding more modules over time.”\n  Eventually the concept calls for a structure perhaps as large as 5-6 kilometers across. Don’t worry — it would be far enough out from Earth that you wouldn’t see a giant hexagon blocking out the stars. Power would be sent to receivers on the surface using directed, steerable microwave transmission. A few of these in orbit could beam power to any location on the planet full time.\n Of course that is the vision, which is many, many years out if it is to take place at all. But don’t make the mistake of thinking of this as having that single ambitious, one might even say grandiose goal. The pursuit of this idea has produced advances in  solar cells, flexible space-based structures, and  wireless power transfer, each of which can be applied in other areas. The vision may be the stuff of science fiction, but the science is progressing in a very grounded way.\n For his part, Bren seems to be happy just to advance the ball on what he considers an important task that might not otherwise have been attempted at all.\n “I have been a student researching the possible applications of space-based solar energy for many years,” he told Caltech. “My interest in supporting the world-class scientists at Caltech is driven by my belief in harnessing the natural power of the sun for the benefit of everyone.”", "posttime": "2021-08-07 03:32:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "计划,power,可能", "title": "1 亿美元的捐款为长达十年的登月计划提供动力，以制造向地球发射能量的太阳能卫星", "title_en": "\n\t\t\t\t$100M donation powers decade-long moonshot to create solar satellites that beam power to Earth\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/06/100m-donation-powers-decade-long-moonshot-to-create-solar-satellites-that-beam-power-to-earth/", "via": "", "real_tags": ["计划", "power", "可能"]}, {"category": "", "categoryclass": "", "imagename": "9014f9e9ec0c2722d70f334a20334d20.jpg", "infoid": 1071844, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国证券交易委员会周五首次对去中心化金融行业提出指控，指控两人在未注册的发行中非法出售超过 3000 万美元的证券。美国证券交易委员会周五的命令发现，Blockchain Credit Partners 公司的两名高管使用以太坊区块链向投资者出售加密货币，同时在公司盈利能力方面误导他们。具体来说，投资者使用以太币等数字资产购买加密货币。该公司随后承诺向投资者支付超过 6% 的利息，并将这些资金用于汽车贷款等实物投资，以创造额外收入。美国证券交易委员会确定这些“真实世界”的投资不会产生广告中的收入。 “完整和诚实的披露仍然是我们证券法的基石——无论使用什么技术来提供和销售这些证券，”美国证券交易委员会执法部门主管古比尔 S.格鲁瓦尔周五在一份声明中表示。 “这使投资者能够做出明智的决定，并防止发行人在业务运营方面误导公众。”周五对该公司提出指控之际，联邦政府正准备为去中心化金融和加密货币市场发布新规定。本周早些时候，SEC 主席 Gary Gensler 呼吁国会授予该机构更多监管加密货币、贷款和平台的权力。 “如果我们不解决这些问题，我担心很多人会受到伤害，”Gensler 周二表示。迄今为止，国会未能在加密货币市场赋予美国证券交易委员会更多权力，本周选择在两党基础设施​​方案中纳入重点关注数字资产税收的措辞。周日，参议院谈判代表达成了一项 1 万亿美元的基础设施协议，其中包括要求加密货币经纪人在其纳税申报表上报告交易的条款。但“经纪人”的定义含糊不清，可能会使矿工面临更高的税收。目前尚不清楚加密货币在新基础设施法案下的表现如何。参议院有双重修正案希望澄清语言。由 Sens. Ron Wyden (D-OR)、Cynthia Lummis (R-WY) 和 Pat Toomey (R-PA) 撰写的修正案将豁免矿工。参议员马克华纳 (D-VA) 的另一项修正案在立法者中越来越受欢迎，但加密货币倡导者担心，它会通过制定不均衡的报告要求来损害行业。", "note_en": "The Securities and Exchange Commission issued  its first charges against the decentralized finance industry Friday, accusing two people of illegally selling over $30 million of securities in unregistered offerings.\n The SEC’s Friday order found that two executives from the Blockchain Credit Partners company used the Ethereum blockchain to sell cryptocurrencies to investors while misleading them about the company’s profitability. Specifically, investors purchased cryptocurrencies using digital assets like ether. The company then promised to pay investors over 6 percent in interest and that the funds would go toward physical investments like car loans to create additional income. The SEC determined that these “real-world” investments wouldn’t generate the income advertised.\n  “Full and honest disclosure remains the cornerstone of our securities laws – no matter what technologies are used to offer and sell those securities,” Gurbir S. Grewal, SEC Enforcement Division director, said in a statement Friday. “This allows investors to make informed decisions and prevents issuers from misleading the public about business operations.”\n Friday’s charges against the company come as the federal government is preparing to issue new regulations for the decentralized finance and cryptocurrency markets. Earlier this week, SEC Chair Gary Gensler  called on Congress to grant the agency more authority in regulating cryptocurrency, lending, and platforms.\n “If we don’t address these issues, I worry a lot of people will be hurt,” Gensler said on Tuesday.\n Congress has so far failed to give the SEC more authority in the cryptocurrency market, opting this week to include language in the bipartisan infrastructure package focusing on taxation of digital assets. On Sunday, Senate negotiators reached a $1 trillion infrastructure deal, including language that would require cryptocurrency brokers to report transactions on their tax returns. But the definition of “broker” was vague and could potentially open miners up to greater taxation.\n It’s unclear  how cryptocurrency will fare under the new infrastructure bill. There are dual amendments in the Senate looking to clarify the language. An amendment authored by Sens. Ron Wyden (D-OR), Cynthia Lummis (R-WY), and Pat Toomey (R-PA) would exempt miners. Another amendment from Sen. Mark Warner (D-VA) has gained more popularity amongst lawmakers, but cryptocurrency advocates fear it would hurt the industry by creating uneven reporting requirements.", "posttime": "2021-08-07 03:22:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "指控,charges,加密", "title": "SEC 指控 Blockchain Credit Partners 涉嫌非法出售 3000 万美元的未注册证券，这是 SEC 首次对去中心化金融行业提出指控", "title_en": "SEC charges Blockchain Credit Partners for alleged illegal sales of $30M in unregistered securities, first SEC charges related to decentralized finance industry", "transed": 1, "url": "https://www.theverge.com/2021/8/6/22613195/sec-cryptocurrency-blockchain-gensler-charge-illegal-fraud-tokens?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["指控", "charges", "加密"]}, {"category": "", "categoryclass": "", "imagename": "f5e68c89e2924af9599aecef0b63b4fd.png", "infoid": 1071843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在阅读 Yan Zhu 关于她在 OkCupid 中发现的 JSON CSRF 漏洞的优秀文章时，一件事让我感到困惑：我的印象是，现在的浏览器默认将 cookie 视为 SameSite=Lax，所以我希望像 Yan 描述的那样进行攻击不适用于现代浏览器。这让我陷入了探索 SameSite 实际工作方式的困境，包括在此过程中构建交互式 SameSite cookie 探索工具。这是我学到的。快速回顾：假设您的应用程序中有一个页面允许用户删除其帐户，网址为 https://www.example.com/delete-my-account。用户必须使用 cookie 登录才能激活该功能。如果您创建该页面来响应 GET 请求，我作为一个邪恶的人可以在 https://www.evil.com/force-you-to-delete-your-account 上创建一个页面来执行以下操作：如果我能得到你访问我的页面，我可以强制你删除你的账号！但是您比这更聪明，并且您知道 GET 请求应该是幂等的。您实现端点以要求 POST 请求。事实证明，如果我可以诱使用户访问带有以下恶意 HTML 的页面，我仍然可以强制删除帐户：\nCSRF 是一个极其常见和令人讨厌的漏洞——特别是因为它默认是一个漏洞：如果你不知道 CSRF 是什么，你的应用程序中可能就有它。传统上，解决方案是使用 CSRF 令牌——隐藏的表单字段，它们“证明”用户来自您自己网站上的表单，而不是托管在其他地方的表单。 OWASP 将此称为双重提交 Cookie 模式。 Django 等 Web 框架为您实现 CSRF 保护。我构建了 asgi-csrf 来帮助向 ASGI 应用程序添加 CSRF 令牌保护。显然，如果我们根本不必担心 CSRF 会更好。据我所知，从 2016 年 6 月开始指定 SameSite cookie 属性的工作。这个想法是向 cookie 添加一个额外的属性，指定是否应该将它们包含在从托管在另一个域上的页面向域发出的请求中领域。 SameSite=None——cookie 在“所有上下文”中发送——或多或少是在 SameSite 被发明之前的工作方式。 SameSite=Strict — 仅针对源自同一域的请求发送 cookie。即使从站外链接到达站点也不会看到 cookie，除非您随后刷新页面或在站点内导航。\nSameSite=Lax — 如果您通过跟随来自另一个域的链接导航到该站点，则会发送 cookie，但如果您提交表单，则不会发送 cookie。这通常是您想要防止 CSRF 攻击的内容！该属性由服务器在 set-cookie 标头中指定，如下所示： 为什么不习惯性地使用 SameSite=Strict？因为如果有人点击您网站的链接，他们的第一个请求将被视为他们根本没有登录。那很糟！因此，使用 SameSite=Lax 显式设置 cookie 应该足以保护您的应用程序免受 CSRF 漏洞的影响……前提是您的用户拥有支持它的浏览器。 （我可以使用报告 93.95% 的属性的全球支持 - 不足以让我停止习惯性地使用 CSRF 令牌，但我们正在到达那里。）这就是事情变得有趣的地方。如果设置的 cookie 完全没有 SameSite 属性，浏览器应该如何处理？在过去的一年里，所有主要浏览器都在改变它们的默认行为。目标是将缺失的 SameSite 属性视为 SameSite=Lax——默认提供 CSRF 保护。\n我发现很难追踪是否以及何时进行了这种更改：Chrome/Chromium 提供了最好的文档——他们声称已在 2020 年 8 月将新的默认值提高到 100% 的用户。Android 中的 WebViews 仍然具有旧的默认行为，计划在 Android 12（尚未发布）中修复。 Firefox 有一个自 2020 年 8 月起的博客条目，上面写着“从 Firefox 79（2020 年 6 月）开始，我们将其推广到 50% 的 Firefox Beta 用户群”——但我找不到任何后续更新。我启动了一个 Twitter 线程来尝试收集更多信息，所以如果你知道发生了什么更详细的情况，请在那里回复。假设以上所有，谜团仍然存在：Yan 的漏洞如何未能被浏览器阻止？在 Twitter 上反复讨论之后，Yan 提出答案可能就是这个细节，隐藏在功能的 Chrome 平台状态页面上：Cookies 默认为 SameSite=Lax。注意：Chrome 将对不到 2 分钟前没有 SameSite 属性的 cookie 设置例外。尽管正常的 SameSite=Lax cookie 要求顶级跨站点请求具有安全（例如 GET）HTTP 方法，但此类 cookie 也将与非幂等（例如 POST）顶级跨站点请求一起发送。未来将取消对这种干预（“Lax + POST”）的支持。\n看起来 OkCupid 正在设置他们的身份验证 cookie 没有 SameSite 属性......这让他们受到基于表单的 CSRF 攻击，但仅在设置 cookie 后的 120 秒内！服务器端 Python (Starlette) Web 应用程序，用于设置具有不同 SameSite 属性的 cookie。这是托管在 Vercel 上的 https://samesite-lax-demo.vercel.app/ 不同域上的 HTML 页面，链接到该 cookie 站点，提供针对它的 POST 表单，从中嵌入图像并执行一些获取() 请求反对它。这是在 https://simonw.github.io/samesite-lax-demo/ 托管在两个不同的域上对于该工具显示正在发生的事情至关重要。我选择了 Vercel 和 GitHub Pages，因为它们都可以轻松设置以从 GitHub 存储库持续部署更改。在不同浏览器中使用该工具有助于准确显示跨域 cookie 的情况。 SameSite=Strict 像您期望的那样工作。遵循从静态站点到应用程序的常规 &lt;a href=...&gt; 链接并查看严格 cookie 在到达时如何不可见 — 但在您刷新该页面时变得可见，这一点特别有趣。我在 &lt;img src=&quot;/cookies.svg&quot;&gt; 图像标签中包含了一个动态生成的 SVG，它显示了对请求可见的 cookie（使用 SVG &lt;text&gt;）。该图像显示了嵌入 Vercel 域时的所有四种类型的 cookie，但是当嵌入 GitHub pages 域时，它就大不相同了：\n如果不包含 Secure 属性，Chrome 将不允许您设置 SameSite=None cookie。我还添加了一些 JavaScript，可以对 /cookies.json 端点进行跨域 fetch(..., {credentials: &quot;include&quot;}) 调用。在我添加服务器端标头 access-control-allow-origin: https://simonw.github.io 和 access-control-allow-credentials: true 之前，这根本没有发送任何 cookie。完成后，我在三个浏览器中得到了与上述 &lt;img 测试相同的结果。 Safari 忽略 SameSite=None 原来是这个错误：SameSite=None 或 SameSite=invalid 的 Cookie 被视为严格 - 它被标记为已修复但我不确定修复是否已经发布 - 它似乎没有被修复在我的 macOS 10.15.6 笔记本电脑或我的 iOS 14.7.1 iPhone 上。最令人兴奋的是，我能够使用该工具复制 Chrome 两分钟窗口错误！每个 cookie 的值都设置为创建时的时间戳，我添加了代码来显示 cookie 是在多少秒前设置的。这是一个动画，展示了表单提交导航上的 Chrome 如何看到在 114 秒前设置为 SameSite 的 cookie，但该 cookie 在 120 秒后不再可见。关于 CSRF，您应该考虑的最后一个注意事项：SameSite=Lax 仍然允许来自主域子域的表单提交携带其 cookie。这意味着，如果您的子域之一存在 XSS 漏洞，则主域的安全性将受到威胁。由于子域托管其他可能有自己安全问题的应用程序是很常见的，因此为 Lax cookie 放弃 CSRF 令牌可能不是一个明智的步骤！\n作为应用程序开发人员，您应该使用 SameSite=Lax 设置所有 cookie，除非您有很好的理由不这样做。大多数 Web 框架现在默认执行此操作 - Django 在 2018 年 8 月在 Django 2.1 中提供了对此的支持。您还需要 CSRF 令牌吗？我是这样认为的：我不喜欢启动旧浏览器（可能借用过时的计算机）的用户容易受到这种攻击的想法，我担心上述子域问题。如果您为浏览器供应商工作，请更轻松地找到有关默认行为是什么以及何时发布的信息！", "note_en": "In reading Yan Zhu’s excellent write-up of the  JSON CSRF vulnerability she found in OkCupid one thing puzzled me: I was under the impression that browsers these days default to treating cookies as  SameSite=Lax, so I would expect attacks like the one Yan described not to work in modern browsers.\n This lead me down a rabbit hole of exploring how SameSite actually works, including building  an interactive SameSite cookie exploration tool along the way. Here’s what I learned.\n   A quick review: let’s say you have a page in your application that allows a user to delete their account, at  https://www.example.com/delete-my-account. The user has to be signed in with a cookie in order to activate that feature.\n If you created that page to respond to  GET requests, I as an evil person could create a page at  https://www.evil.com/force-you-to-delete-your-account that does this:\n  If I can get you to visit my page, I can force you to delete your account!\n But you’re smarter than that, and you know that GET requests should be idempotent. You implement your endpoint to require a POST request instead.\n Turns out I can still force-delete accounts, if I can trick a user into visiting a page with the following evil HTML on it:\n   CSRF is an extremely common and nasty vulnerability—especially since it’s a hole by default: if you don’t know what CSRF is, you likely have it in your application.\n Traditionally the solution has been to use CSRF tokens—hidden form fields which “prove” that the user came from a form on your own site, and not a form hosted somewhere else. OWASP call this the  Double Submit Cookie pattern.\n Web frameworks like Django implement  CSRF protection for you. I built  asgi-csrf to help add CSRF token protection to ASGI applications.\n  Clearly it would be better if we didn’t have to worry about CSRF at all.\n As far as I can tell, work on specifying the  SameSite cookie attribute started  in June 2016. The idea was to add an additional attribute to cookies that specifies the policy for if they should be included in requests made to a domain from pages hosted on another domain.\n  SameSite=None—the cookie is sent in “all contexts”—more-or-less how things used to work before SameSite was invented.\n SameSite=Strict—the cookie is only sent for requests that originate on the same domain. Even arriving on the site from an off-site link will not see the cookie, unless you subsequently refresh the page or navigate within the site.\n SameSite=Lax—cookie is sent if you navigate to the site through following a link from another domain but  not if you submit a form. This is generally what you want to protect against CSRF attacks!\n The attribute is specified by the server in a  set-cookie header that looks like this:\n  Why not habitually use  SameSite=Strict? Because then if someone follows a link to your site their first request will be treated as if they are not signed in at all. That’s bad!\n So explicitly setting a cookie with  SameSite=Lax should be enough to protect your application from CSRF vulnerabilities... provided your users have a browser that supports it.\n (Can I Use reports  93.95% global support for the attribute—not quite high enough for me to stop habitually using CSRF tokens, but we’re getting there.)\n  Here’s where things get interesting. If a cookie is set without a SameSite attribute at all, how should the browser treat it?\n Over the past year, all of the major browsers have been changing their default behaviour. The goal is for a missing SameSite attribute to be treated as if it was  SameSite=Lax—providing CSRF protection by default.\n I have found it infuriatingly difficult to track down if and when this change has been made:\n Chrome/Chromium offer  the best documentation—they claim to have ramped up the new default to 100% of users in August 2020. WebViews in Android still have the old default behaviour, which is scheduled to be fixed in Android 12 ( not yet released).\n Firefox have a  blog entry from August 2020 which says “Starting with Firefox 79 (June 2020), we rolled it out to 50% of the Firefox Beta user base”—but I’ve not been able to find any subsequent updates.\n I started  a Twitter thread to try and collect more information, so please reply there if you know what’s going on in more detail.\n  Assuming all of the above, the mystery remained: how did Yan’s exploit fail to be prevented by browsers?\n After some back-and-forth about this on Twitter  Yan proposed that the answer may be this detail, tucked away on the  Chrome Platform Status page for Feature: Cookies default to SameSite=Lax.\n Note: Chrome will make an exception for cookies set without a SameSite attribute less than 2 minutes ago. Such cookies will also be sent with non-idempotent (e.g. POST) top-level cross-site requests despite normal SameSite=Lax cookies requiring top-level cross-site requests to have a safe (e.g. GET) HTTP method. Support for this intervention (“Lax + POST”) will be removed in the future.\n It looks like OkCupid were setting their authentication cookie without a  SameSite attribute... which opened them up to a form-based CSRF attack but only for the 120 seconds following the cookie being set!\n     A server-side Python ( Starlette) web application for setting cookies with different  SameSite attributes. This is hosted on Vercel at  https://samesite-lax-demo.vercel.app/\n An HTML page on a different domain that links to that cookied site, provides a POST form targetting it, embeds an image from it and executes some  fetch() requests against it. This is at  https://simonw.github.io/samesite-lax-demo/\n Hosting on two separate domains is critical for the tool to show what is going on. I chose Vercel and GitHub Pages because they are both trivial to set up to continuously deploy changes from a GitHub repository.\n Using the tool in different browsers helps show exactly what is going on with regards to cross-domain cookies.\n  SameSite=Strict works as you would expect. It’s particularly interesting to follow the regular  &lt;a href=...&gt; link from the static site to the application and see how the strict cookie is NOT visible upon arrival—but becomes visible when you refresh that page.\n I included a dynamically generated SVG in a  &lt;img src=&#34;/cookies.svg&#34;&gt; image tag, which shows the cookies (using SVG  &lt;text&gt;) that are visible to the request. That image shows all four types of cookie when embedded on the Vercel domain, but when embedded on the GitHub pages domain it differs wildly:\n Chrome won’t let you set a  SameSite=None cookie without including the  Secure attribute.\n I also added some JavaScript that makes a cross-domain  fetch(..., {credentials: &#34;include&#34;}) call against a  /cookies.json endpoint. This didn’t send any cookies at all until I added server-side headers  access-control-allow-origin: https://simonw.github.io and  access-control-allow-credentials: true. Having done that, I got the same results across the three browsers as for the  &lt;img test described above.\n Safari ignoring  SameSite=None turns out to be this bug:  Cookies with SameSite=None or SameSite=invalid treated as Strict—it’s marked as fixed but I’m not certain the fix has been released yet—it doesn’t seem to be fixed on my macOS 10.15.6 laptop or my iOS 14.7.1 iPhone.\n Most excitingly, I was able to replicate the Chrome two minute window bug using the tool! Each cookie has its value set to the timestamp when it was created, and I added code to display how many seconds ago the cookie was set. Here’s an animation showing how Chrome on a form submission navigation can see the cookie that was set with  SameSite missing at 114 seconds old, but that cookie is no longer visible once it passes 120 seconds.\n   One last note about CSRF that you should consider:  SameSite=Lax still allows form submissions from subdomains of your primary domain to carry their cookies.\n This means that if you have a XSS vulnerability on one of your subdomains the security of your primary domain will be compromised.\n Since it’s common for subdomains to host other applications that may have their own security concerns, ditching CSRF tokens for Lax cookies may not be a wise step!\n  As an application developer, you should set all cookies with  SameSite=Lax unless you have a very good reason not to. Most web frameworks do this by default now—Django shipped  support for this in  Django 2.1 in August 2018.\n Do you still need CSRF tokens as well? I think so: I don’t like the idea of users who fire up an older browser (maybe borrowing an obsolete computer) being vulnerable to this attack, and I worry about the subdomain issue described above.\n And if you work for a browser vendor, please make it easier to find information on what the default behaviour is and when it was shipped!", "posttime": "2021-08-07 03:21:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "防止,samesite,cookie", "title": "探索防止 CSRF 的 SameSite cookie 属性", "title_en": "Exploring the SameSite cookie attribute for preventing CSRF", "transed": 1, "url": "https://simonwillison.net/2021/Aug/3/samesite/", "via": "", "real_tags": ["防止", "samesite", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "8431404693ecffa56c44f10a94da95c1.jpg", "infoid": 1071842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦，8 月 5 日（路透社）——一项科学研究周四表示，作为北半球气候引擎的大西洋当前系统可能正在减弱到这样的程度，它可能很快会给世界天气带来巨大变化。大西洋经向翻转环流 (AMOC) 是一个大型洋流系统，它将温暖的水从热带地区向北输送到北大西洋。随着温室气体排放增加导致大气变暖，下面的地表海洋保留了更多的热量。该系统的潜在崩溃可能对世界天气系统产生严重后果。气候模型显示，AMOC 处于 1000 多年来最弱的状态。然而，目前尚不清楚减弱是由于环流的变化还是与稳定性的丧失有关。 “动态稳定性的丧失意味着 AMOC 已接近其临界阈值，超过该阈值可能会发生实质性且实际上可能不可逆转地过渡到弱模式，”波茨坦气候影响研究所的 Niklas Boers 说，他也是该研究的作者。学习。通过分析大西洋的海面温度和盐度模式，该研究表明，上个世纪的减弱可能与稳定性的丧失有关。 “研究结果支持这样的评估，即 AMOC 下降不仅是对温度升高的波动或线性响应，而且可能意味着接近临界阈值，超过该临界阈值，循环系统可能会崩溃，”布尔斯说。\n英国气象局表示，如果 AMOC 崩溃，将导致北半球变冷、大西洋海平面上升、欧洲和北美降水总体下降以及南美和非洲季风转变。其他气候模型表示，AMOC 将在下个世纪减弱，但不太可能在 2100 年之前崩溃。", "note_en": "LONDON, Aug 5 (Reuters) - The Atlantic Ocean&#39;s current system, an engine of the Northern Hemsiphere&#39;s climate, could be weakening to such an extent that it could soon bring big changes to the world&#39;s weather, a scientific study said on Thursday.\n The Atlantic Meridional Overturning Circulation (AMOC) is a large system of ocean currents which transports warm water from the tropics northwards into the North Atlantic.\n As the atmosphere warms due to increased greenhouse gas emissions, the surface ocean beneath retains more of heat. A potential collapse of the system could have severe consequences for the world&#39;s weather systems.\n Climate models have shown that the AMOC is at its weakest in more than a 1,000 years. However, it has not been known whether the weakening is due to a change in circulation or it is to do with the loss of stability.\n  &#34;The loss of dynamical stability would imply that the AMOC has approached its critical threshold, beyond which a substantial and in practice likely irreversible transition to the weak mode could occur,&#34; said Niklas Boers at the Potstdam Insitute for Climate Impact Research and author of the study.\n By analysing the sea-surface temperature and salinity patterns of the Atlantic Ocean, the study said the weakening of the last century is likely to be associated with a loss of stability.\n &#34;The findings support the assessment that the AMOC decline is not just a fluctuation or a linear response to increasing temperatures but likely means the approaching of a critical threshold beyond which the circulation system could collapse,&#34; Boers said.\n If the AMOC collapsed, it would increase cooling of the Northern Hemisphere, sea level rise in the Atlantic, an overall fall in precipitation over Europe and North America and a shift in monsoons in South America and Afria, Britain&#39;s Met Office said.\n Other climate models have said the AMOC will weaken over the coming century but that a collapse before 2100 is unlikely.", "posttime": "2021-08-07 03:21:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变化,ocean,可能", "title": "大西洋洋流减弱，预示着巨大的天气变化：研究", "title_en": "Atlantic Ocean currents weaken, signalling big weather changes: study", "transed": 1, "url": "https://www.reuters.com/business/environment/atlantic-ocean-currents-weaken-signalling-big-weather-changes-study-2021-08-05/", "via": "", "real_tags": ["变化", "ocean", "可能"]}]