[{"category": "", "categoryclass": "", "imagename": "61d7b461bee554186192fdd876ca90b6.jpg", "infoid": 1030029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Photoshop并不是第一个提供Sky替换功能的工具。例如，Lumar已经提供这一服务一年多了，但看起来Adobe在这一点上花了很长时间才做好。这个想法本身非常简单：Photoshop现在可以自动识别图像中的天空，然后用你选择的天空替换它。因为天空的颜色也会影响整个场景，这显然会产生一个相当奇怪的图像，所以Adobe的AI也相应地调整了图像其余部分的颜色。\n这一切的效果如何也可能在一定程度上取决于图像。我们自己还没能试一试，而且Adobe的演示显然工作得无懈可击。\nPhotoshop将附带25个天空替换组件，但您也可以自带。\n神经过滤器是此版本的另一个亮点。例如，它们为您提供了新的艺术性和恢复性滤镜，用于改善肖像，或快速更换图像的背景颜色。肖像功能可能会得到最直接的使用，因为它可以让你改变人们看的方向，改变光源的角度，“改变头发的厚度，微笑的强度，或者增加惊喜，愤怒，或者让人变得更老或更年轻。”其中一些比其他的更花哨，Adobe表示，它们最适合进行微妙的更改，但无论哪种方式-进行这些更改通常都是大量的体力劳动，现在只需点击一两下即可。\n在其他有趣的新滤镜中，还有一个样式转换工具和一个帮助您给黑白图像上色的滤镜。更有用的新滤镜包括移除JPEG瑕疵的功能。\n正如Adobe指出的，它与NVIDIA在这些神经过滤器上进行了合作，虽然它们可以在所有运行Photoshop 22.0的设备上运行，但在具有内置图形加速的机器上使用它们确实会带来性能上的好处。这并不令人惊讶，因为其中很多都是计算密集型的。\n虽然改进的对象选择可能不像Sky Replace和新的滤镜那样华丽，但正如Adobe所说的那样，“智能细化边缘”可能只会让一些照片编辑保持理智。如果你曾经尝试过使用Photoshop当前的工具来选择拥有复杂毛发的人或动物-特别是在复杂的背景下-你就知道目前的工具仍然需要多少人工干预。现在，有了新的“细化头发”和“对象感知细化模式”，很多手工工作应该变得不必要了。\nPhotoshop的其他新功能包括创建图案的新工具，改进了搜索、帮助和上下文操作的新发现面板，更快的插件等等。\n另外一个新功能是为所有Creative Cloud应用提供一个插件市场，让开发者更容易销售他们的插件。", "note_en": "Photoshop isn’t the first tool to offer a Sky Replacement feature.  Luminar,   for example, has  offered that for more than a year already, but it looks like Adobe took its time to get this one right. The idea itself is pretty straightforward: Photoshop can now automatically recognize the sky in your images and then replace it with a sky of your choosing. Because the colors of the sky also influence the overall scene, that would obviously result in a rather strange image, so Adobe’s AI also adjusts the colors of the rest of the image accordingly.\n   How well all of this works probably depends a bit on the images, too. We haven’t been able to give it a try ourselves, and Adobe’s demos obviously worked flawlessly.\n Photoshop will ship with 25 sky replacements, but you can also bring in your own.\n Neural Filters are the other highlight of this release. They provide you with new artistic and restorative filters for improving portraits, for example, or quickly replacing the background color of an image. The portrait feature will likely get the most immediate use, given that it allows you to change where people are looking, change the angle of the light source and “change hair thickness, the intensity of a smile, or add surprise, anger, or make someone older or younger.” Some of these are a bit more gimmicky than others, and Adobe says they work best for making subtle changes, but either way — making those changes would typically be a lot of manual labor, and now it’s just a click or two.\n  Among the other fun new filters are a style transfer tool and a filter that helps you colorize black and white images. The more useful new filters include the ability to remove JPEG artifacts.\n As Adobe noted, it collaborated with Nvidia on these Neural Filters, and, while they will work on all devices running Photoshop 22.0, there’s a real performance benefit to using them on machines with built-in graphics acceleration. No surprise there, given how computationally intensive a lot of these are.\n  While improved object selection may not be quite as flashy as Sky Replacement and the new filters, “intelligent refine edge,” as Adobe calls it, may just save a few photo editors’ sanity. If you’ve ever tried to use Photoshop’s current tools to select a person or animal with complex hair — especially against a complex backdrop — you know how much manual intervention the current crop of tools still need. Now, with the new “Refine Hair” and “Object Aware Refine Mode,” a lot of that manual work should become unnecessary.\n Other new Photoshop features include a new tool for creating patterns, a new Discover panel with improved search, help and contextual actions, faster plugins and more.\n Also new is a plugin marketplace for all Creative Cloud apps that makes it easier for developers to sell their plugins.", "posttime": "2020-10-20 22:14:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "adobe,photoshop", "title": "\nAdobe Photoshop通过神经过滤器、天空替换等功能获得新的AI智能", "title_en": "\n\t\t\t\tAdobe Photoshop gets new AI smarts with neural filters, sky replacement and more\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/adobe-photoshop-gets-new-ai-smarts-with-neural-filters-sky-replacement-and-more/", "via": "", "real_tags": ["adobe", "photoshop"]}, {"category": "", "categoryclass": "", "imagename": "8e49cc644635df17ef3f4e528fc83497.jpg", "infoid": 1030028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但即使是浏览器的反钓鱼功能-通常是潜在的钓鱼受害者的最后一道防线-也不是完美的。\n安全研究人员Rafay Baloch在一些使用最广泛的移动浏览器中发现了几个漏洞-包括苹果的Safari、Opera和Yandex-如果利用这些漏洞，攻击者可以诱使浏览器显示与用户实际所在网站不同的网址。这些地址栏欺骗漏洞使攻击者更容易让他们的钓鱼页面看起来像合法网站，从而为试图窃取密码的人创造了完美的条件。\n这些漏洞通过利用易受攻击的浏览器加载网页所需时间的弱点来工作。一旦受害者被诱骗打开钓鱼电子邮件或文本消息中的链接，恶意网页就会使用隐藏在页面上的代码将浏览器地址栏中的恶意网址有效地替换为攻击者选择的任何其他网址。\n在至少一个案例中，易受攻击的浏览器保留了绿色挂锁图标，表明带有欺骗网址的恶意网页是合法的-而实际上是不合法的。\nRapid7的研究总监托德·比尔兹利(Tod Beardsley)帮助Baloch向每个浏览器制造商披露了这些漏洞，他表示，地址栏欺骗攻击将移动用户置于特别危险的境地。\n“在移动设备上，空间是绝对重要的，所以每一英寸都很重要。因此，没有太多空间可用来放置安全信号和标志。“比尔兹利告诉TechCrunch。“在桌面浏览器上，您可以查看您所在的链接，将鼠标悬停在链接上以查看您要访问的位置，甚至可以单击锁以获取证书详细信息。这些额外的资源在移动设备上并不存在，所以地址栏不仅会告诉用户他们在哪个网站上，而且应该明确而确定地告诉用户这一点。如果你使用的是palpay.com，而不是预期的paypal.com，那么在输入密码之前，你可能会注意到这一点，并知道自己是在一个假网站上。\n他说：“像这样的欺骗攻击会使位置栏变得模糊不清，从而让攻击者对他们的虚假网站产生一定的可信度和可信度。”\n到目前为止，只有苹果和Yandex在9月和10月推出了修复程序。Opera发言人Julia Szyndzielorz表示，其Opera Touch和Opera Mini浏览器的修复程序正在“逐步推出”。\n但UC浏览器、Bolt浏览器和RITS浏览器的制造商-它们总共安装了超过6亿台设备-没有回应研究人员，也没有修补漏洞。\nTechCrunch联系了每一家浏览器制造商，但截至发布时，没有一家提供声明。", "note_en": "But even the browser’s anti-phishing features — often the last line of defense for a would-be phishing victim — aren’t perfect.\n Security researcher Rafay Baloch found several vulnerabilities in some of the most widely used mobile browsers — including Apple’s Safari, Opera, and Yandex — which if exploited would allow an attacker to trick the browser into displaying a different web address than the actual website that the user is on. These address bar spoofing bugs make it far easier for attackers to make their phishing pages look like legitimate websites, creating the perfect conditions for someone trying to steal passwords.\n The bugs worked by exploiting a weakness in the time it takes for a vulnerable browser to load a web page. Once a victim is tricked into opening a link from a phishing email or text message, the malicious web page uses code hidden on the page to effectively replace the malicious web address in the browser’s address bar to any other web address that the attacker chooses.\n In at least one case, the vulnerable browser retained the green padlock icon, indicating that the malicious web page with a spoofed web address was legitimate — when it wasn’t.\n  Rapid7’s research director Tod Beardsley, who helped Baloch with disclosing the vulnerabilities to each browser maker, said address bar spoofing attacks put mobile users at particular risk.\n “On mobile, space is at an absolute premium, so every fraction of an inch counts. As a result, there’s not a lot of space available for security signals and sigils,” Beardsley told TechCrunch. “While on a desktop browser, you can either look at the link you’re on, mouse over a link to see where you’re going, or even click on the lock to get certificate details. These extra sources don’t really exist on mobile, so the location bar not only tells the user what site they’re on, it’s expected to tell the user this unambiguously and with certainty. If you’re on  palpay.com instead of the expected  paypal.com, you could notice this and know you’re on a fake site before you type in your password.”\n “Spoofing attacks like this make the location bar ambiguous, and thus, allow an attacker to generate some credence and trustworthiness to their fake site,” he said.\n  So far, only Apple and Yandex pushed out fixes in September and October. Opera spokesperson Julia Szyndzielorz said the fixes for its Opera Touch and Opera Mini browsers are “in gradual rollout.”\n But the makers of UC Browser, Bolt Browser, and RITS Browser — which collectively have more than 600 million device installs — did not respond to the researchers and left the vulnerabilities unpatched.\n TechCrunch reached out to each browser maker but none provided a statement by the time of publication.", "posttime": "2020-10-20 22:14:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,漏洞,opera,浏览器", "title": "\n苹果、Opera和Yandex修复了浏览器地址栏欺骗漏洞，但仍有数百万人易受攻击", "title_en": "\n\t\t\t\tApple, Opera, and Yandex fix browser address bar spoofing bugs, but millions more still left vulnerable\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/apple-opera-fix-browser-address-bar-spoofing/", "via": "", "real_tags": ["apple", "苹果", "漏洞", "opera", "浏览器"]}, {"category": "", "categoryclass": "", "imagename": "551c783d5d0b018a99ffb2c230a79b6d.jpg", "infoid": 1030027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "只能回顾新iPhone阵容的一半，这让人感到一种奇怪的紧张。虽然这篇评论的重点是分解iPhone12和iPhone12Pro，但我们都知道iPhonemini和iPhone12Pro Max正坐在机翼上。*幸运的是，我们可以推断[…]", "note_en": "There’s an odd tension in only being able to review half of the new iPhone lineup. Though this review is focused on breaking down the iPhone 12 and iPhone 12 Pro, we all know that the iPhone mini and the iPhone 12 Pro Max are sitting out there in the wings.  Fortunately, we can extrapolate […]", "posttime": "2020-10-20 22:13:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,评论,gems,iphone12pro", "title": "\n评论：iPhone 12和iPhone 12 Pro，两颗宝石，一颗宝石", "title_en": "\n\t\t\t\tReview: iPhone 12 and iPhone 12 Pro, two gems, one jewel\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/review-iphone-12-and-iphone-12-pro-two-gems-one-jewel/", "via": "", "real_tags": ["iphone", "评论", "gems"]}, {"category": "", "categoryclass": "", "imagename": "3ff848c20fca8e64b4da0a4830404ee8.jpg", "infoid": 1030026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pocket 2是一种让我希望自己能走得更远的设备。我已经对它进行了几天的测试，虽然它做得相当不错，让我的生活看起来更有趣了，但在这次封锁期间，这样的一个小设备能做的事情也就这么多了。当然，这不是大疆的错。我们能做的只有这么多--归根结底，相机只能真正处理你给它的内容。\n尽管如此，我还是很享受使用这款产品的时光。就像我对它的前身DJI Osmo Pocket所做的那样。本周，这款设备将带着一个截短的名称和几项改进措施回归。机上没有什么特别革命性的东西，但最初的设备在大约两年前首次上市时是如此酷和创新的产品，该公司主要专注于精细化是可以原谅的。\n该系列建立在DJI的技术诀窍基础上，该技术是通过多年的无人机成像和万向架专业知识开发的。然而，与罗宁或Osmo Mobile系列不同的是，这款产品作为一个独立的产品工作，有一个小的内置显示屏，可以直接记录到microSD卡上。但与原版一样，当你有一部Android或iOS手机可以使用时，整个设置的效果要好得多。Pocket仍然承担着大部分繁重的图像提升工作，但你的手机只是作为一个比设备内置的微不足道的屏幕和控制中心更好的预览屏幕和控制中心。\n系统附带一对接口：USB-C和Lightning，具体取决于您的设备。这是一个坚实的设置，最好用两只手来控制。我没有任何问题，但我不完全信任连接器的完整性，不足以将其与连接器连接在一起。更好的是，有无线配件可以让你通过电话远程控制系统。说到配饰，我强烈建议你买一个迷你三脚架，或者挥霍一下包括一个的奖金包。对于那些需要几分钟长的记录时间的模式，正确地支撑系统可能是很棘手的。一段视频不止一次在设备因强风而倾倒时结束。\n底层成像硬件在整个过程中都得到了改进。这款相机现在配备了更大的传感器(6400万像素)和更宽的镜头，拍摄的视频和剧照比原来的更好。这款设备最高可放大8倍--不过我建议你坚持使用4倍无损光学镜头，这样就不会降低你正在拍摄的照片的质量。(顺便说一句，HDR将在晚些时候到来。)。\n麦克风也进行了升级。机上共有四人。一定要使用可选的风降噪功能。为了获得更好的质量，组合包还包括一个带挡风玻璃的无线麦克风，因此，根据您计划拍摄的内容和地点，可能也值得研究一下。三轴万向节很好地保持了物体的稳定-并且移动平稳，可以完成各种不同的图像和视频捕获任务。与上一版本一样，我发现电池不足-默认情况下，万向节为连接的手机充电时情况加倍。\n和往常一样，拍摄模式才是真正的秘诀。特别是，我真的被时间流逝和超脱迷住了。前者提供加速的图像，在您移动时使用万向节来稳定镜头：\nHyperLapse更进一步，以缓慢的增量机械地将万向节从左向右移动，从而在一段时间内提供空间的扫掠镜头：\n该系统还从无人机线路借用了主题跟踪。在智能手机显示屏上围绕对象绘制一个矩形，万向架就会随之移动。跟踪被证明是相当准确的，尽管我在阴影中和有很多不同运动发生的情况下遇到了一些问题-比如当我试图在垒球比赛中捕捉跑步者时。然而，总的来说，它对人和动物都做了相当扎实的工作。\n万向节也很适合拼接全景照片-这在标准的智能手机上可能是一件令人头疼的事情。它既可以将标准的超宽180度镜头拼接在一起，也可以通过将9幅图像拼接在一起来创建高细节的3×3图像：\nPocket 2占据了一个奇怪的领域。它本质上是一款售价349美元的附加功能，旨在增强智能手机的拍照功能。这是一个很容易抓取一些非常酷的照片的捷径，但专业人士会对拍摄更感兴趣，比方说，用罗宁和单反。这使得业余爱好者有钱花在一些东西上，比如说，这些东西会让他们的社交媒体上的朋友们惊叹不已。这是一种无需离开地面就能捕捉到一些无人机风格的镜头的方法。", "note_en": "The  Pocket 2 is the kind of device that makes me wish I got out a bit more. I’ve been testing it out for a few days, and, while it’s done a reasonably good job making my life look a bit more interesting, there’s only so much such a little device can do during this lockdown. That’s no fault of DJI’s of course. There’s only so much that can be done — and at the end of the day, a camera can only really work with the content you give it.\n Even so, I’ve enjoyed my time with the product. As I did with its predecessor, the  DJI   Osmo Pocket. The device returns this week with a truncated name and a handful of improvements. Nothing on board is particularly revolutionary, but the original device was such a cool and innovative product when it first arrived roughly two years ago, the company can be forgiven for mostly focusing on refinement.\n   The line builds on DJI’s know-how, developed with years of drone imaging and gimbal expertise. Unlike, say the Ronin or  Osmo   Mobile lines, however, the product works as a standalone, with a small built-in display that records directly onto a microSD card. But as with the original, the whole getup works a heck of a lot better when you’ve got an Android or iOS handset to work with. The Pocket still does the majority of the heavy imaging lifting, but your phone just works as a much better preview screen and control center than the measly one built into the device.\n  The system ships with a pair of connectors: USB-C and Lightning, depending on your device. It’s a solid setup, best controlled with two hands. I didn’t have any issues, but I don’t entirely trust the integrity of a connector enough to hold it with one. Better yet, there are wireless accessories that allow for you to control the system remotely via phone. And speaking of accessories, I highly recommend getting a mini tripod or splurging for the bonus pack that includes one. It can be tricky propping the system up correctly for those modes that require minutes-long record times. More than once a video ended when the device fell over due to a strong gust.\n  The underlying imaging hardware has been improved throughout. The camera now sports a larger sensor (64-megapixels) and wider lens, shooting better videos and stills than the original. The device can zoom up to 8x — though I’d recommend sticking with the 4x lossless optical, so as to not degrade those shots you’re taking. (HDR, incidentally, is coming at a later date.)\n The mics, too, have been upgraded. There are four in total on board. Definitely use that optional wind noise reduction. For even better quality, the combo pack also includes a wireless microphone with windscreen, so that, too, may be worth investigating depending on what and where you plan to shoot. The three-axis gimbal does a good job keep things steady — and moves smoothly for a variety of different image and video capturing tasks. As with the last version, I found the battery to be lacking — that’s doubly the case for the gimbal charging up an attached phone by default.\n As usual, the shooting modes are the real secret sauce. In particular, I’m really smitten with timelapse and hyperlapse. The former offers a sped-up image, using the gimbal to stabilize the shot as you move:\n  Hyperlapse takes it a step further, mechanically moving the gimbal from left to right in slow increments that give a sweeping shot of a space over time:\n  The system also borrows subject tracking from the drone line. Draw a rectangular around an object on the smartphone display and the gimbal will move along with it. The tracking proved to be pretty accurate, though I ran into some issues in the shadows and in situations when there’s a lot of divergent movement happening — like when I attempted to capture the runner in a softball game. On the whole however, it does a pretty solid job with people and animals alike.\n The gimbal is also great for stitching together panorama shots — something that can be a pain on a standard smartphone. It can either do together a standard ultra wide 180-degree shot or create a highly detailed 3×3 image by essentially stitching together nine images in one:\n  The Pocket 2 occupies a strange territory. It’s essentially a $349 add-on designed to augment smartphone photography. It’s an easy shortcut for grabbing some really cool shots, but pros are going to be much more interested in shooting with, say, a Ronin and an SLR. That leaves hobbyists with cash to spend on something that will, say, really wow their friends on social media. It’s a way to capture some drone-style shots without ever having to leave the ground.", "posttime": "2020-10-20 22:13:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,pocket,拍摄", "title": "\nDJI的Pocket 2万向节是一种非常有趣的抓拍令人印象深刻的智能手机照片的方式", "title_en": "\n\t\t\t\tDJI’s Pocket 2 gimbal is an extremely fun way to grab impressive smartphone shots\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/djis-pocket-2-gimbal-is-an-extremely-fun-way-to-grab-impressive-smartphone-shots/", "via": "", "real_tags": ["手机", "pocket", "拍摄"]}, {"category": "", "categoryclass": "", "imagename": "ecd60b74e5a7859f5bf3b4ead6762dee.jpg", "infoid": 1030025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国司法部表示，司法部副部长杰弗里·A·罗森(Jeffrey A.Rosen)将于今天东部时间上午9点45分发表正式演讲。\n在诉讼中，司法部预计将辩称，谷歌使用反竞争行为来维护其作为搜索和搜索广告领域主导力量的垄断地位，这是该公司广泛的广告、数据挖掘、视频分发和信息服务集团的基础。\n这将是谷歌面临美国监管机构的第一个重大法律挑战，尽管该公司的行为已被调查多年。\n2012年，该公司曾试图将反竞争行为告上法庭，但最终以失败告终，因为当时的监管机构不确定他们能否胜诉。从那时起，Alphabet的价值已经飙升到超过1万亿美元(截至今天的股价)。\n谷歌的母公司Alphabet在搜索和视频领域都占据着压倒性的领先地位。据“华尔街日报”报道，该公司主导着搜索市场-全球约90%的互联网搜索是在其平台上进行的-大约四分之三的美国成年人转向YouTube观看视频。\n在诉讼中，司法部将表示Alphabet的谷歌子公司利用排他性商业协议网络将竞争对手拒之门外。这家搜索巨头筹集的数十亿美元最终支付给手机公司、运营商和浏览器，使谷歌搜索引擎成为预设的默认设置。这阻止了竞争对手访问他们改进自己的搜索引擎所需的查询和流量类型。\n“华尔街日报”援引司法部官员的话说，正是这些关系--以及谷歌坚持要求其搜索引擎在使用Android操作系统的手机上预加载(且不可删除)，以及其他搜索引擎明确不预加载--将构成政府案件的一部分。\n在这起反垄断诉讼之前，谷歌还采取了其他一些涉及谷歌的监管行动。谷歌不仅是占主导地位的在线搜索提供商，也是在线广告和Android移动技术领域的领先者，在地图、在线生产力软件、云计算等其他互联服务网络中也是一个强大的参与者。\n上周五发表在Politico上的一篇报道指出，民主党司法部长将不会签署这起诉讼。该报告称，这些AG转而致力于两党合作、国家主导的方法，涵盖搜索以外的更广泛问题-其想法也是，更多的诉讼可能会让政府在对抗这家科技巨头时拥有更强大的讨价还价地位。\n德克萨斯州正在组装第三起诉讼，尽管这也面临着自己的问题。\n虽然一些科技精英正面临来自华盛顿越来越多的审查，美国现在距离选举日只有两周时间，但在此之前，我们不太可能看到围绕这起案件和其他案件的许多进展。在这起谷歌诉讼的案例中，如果特朗普不能连任，美国司法部也将进行更大规模的人事变动，这也可能改变此案的概况和时间表。\n无论如何，与这些监管案件的斗争总是一个漫长而旷日持久的过程。在欧洲，谷歌因几年前的反垄断违规行为而面临一系列罚款，包括谷歌购物罚款27亿美元；安卓主导地位罚款50亿美元；搜索广告经纪罚款17亿美元。虽然谷歌在上诉过程中进展缓慢，但在欧洲和其他地方也有更多针对该公司的案件正在进行中。\n谷歌并不是唯一引起华盛顿注意的公司。10月初，众议院司法委员会发布了一份长达400多页的报告，其中概述了科技巨头苹果(Apple)、亚马逊(Amazon)、Alphabet(谷歌的母公司)和Facebook是如何滥用权力的，涵盖了从它们占据主导地位的领域到如何解决这种情况的建议(包括缩减收购战略)的方方面面。\n这似乎主要是在规划事态，反过来可以用来为进一步的行动提供信息，尽管与美国司法部的诉讼不同，众议院的报告本身在执法或补救方面缺乏效力。", "note_en": "The DoJ  said it that Jeffrey A. Rosen, deputy Attorney General, will be making a formal speech at 9:45am Eastern today.\n In the suit, the Justice Department is expected to argue that  Google   used anticompetitive practices to safeguard its monopoly position as the dominant force in search and search-advertising, which sit at the foundation of the company’s extensive advertising, data mining, video distribution, and information services conglomerate.\n  It would be the first significant legal challenge that Google has faced from U.S. regulators despite years of investigations into the company’s practices.\n A 2012 attempt to bring the company to the courts to answer for anti-competitive practices was ultimately scuttled because regulators at the time weren’t sure they could make the case stick. Since that time  Alphabet’s   value has skyrocketed to reach over $1 trillion (as of today’s share price).\n Alphabet, Google’s parent company, holds a commanding lead in both search and video. The company dominates the search market — with roughly 90% of the world’s internet searches conducted on its platform — and roughly three quarters of American adults turn to YouTube for video, as the Journal reported.\n In the lawsuit, the Department of Justice will say that Alphabet’s Google subsidiary uses a web of exclusionary business agreements to shut out competitors. The billions of dollars that the search giant collects wind up paying mobile phone companies, carriers and browsers to make the Google search engine a preset default. That blocks competitors from being able to access the kinds of queries and traffic they’d need to refine their own search engine.\n It will be those relationships — alongside Google’s insistence that its search engine come pre-loaded (and un-deletable) on phones using the  Android   operating system and that other search engines specifically not be pre-loaded — that form part of the government’s case, according to Justice Department officials cited by the Journal.\n The antitrust suit comes on the heels of a number of other regulatory actions involving Google, which is not only the dominant online search provider, but also a leader in online advertising and in mobile technology by way of Android, as well as a strong player in a web of other interconnected services like mapping, online productivity software, cloud computing and more.\n  A report last Friday in  Politico noted that Democrat Attorneys General would not be signing the suit. That report said those AGs have instead been working on a bipartisan, state-led approach covering a wider number of issues beyond search — the idea being also that more suits gives government potentially a stronger bargaining position against the tech giant.\n A third suit is being put together by the state of Texas, although that has  faced its own issues.\n While a number of tech leviathans are facing increasing scrutiny from Washington, with the US now just two weeks from Election Day, it’s unlikely that we are going to see many developments around this and other cases before then. And in the case of this specific Google suit, in the event that Trump doesn’t get re-elected, there will also be a larger personnel shift at the DoJ that could also change the profile and timescale of the case.\n In any event, fighting these regulatory cases is always a long, drawn-out process. In Europe, Google has faced a series of fines over antitrust violations stretching back several years, including a  $2.7 billion fine over Google shopping; a  $5 billion fine over Android dominance; and a  $1.7 billion fine over search ad brokering. While Google  slowly works through appeals, there are also  more cases ongoing against the company in Europe and elsewhere.\n Google is not the only one catching the attention of Washington. Earlier in October, the House Judiciary Committee  released a report of more than 400 pages in which it outlined how tech giants Apple, Amazon, Alphabet (Google’s parent company) and Facebook were abusing their power, covering everything from the areas in which they dominate, through to suggestions for how to fix the situation (including curtailing their acquisitions strategy).\n  That seemed mainly to be an exercise in laying out the state of things, which could in turn be used to inform further actions, although in itself, unlike the DoJ suit, the House report lacks teeth in terms of enforcement or remedies.", "posttime": "2020-10-20 22:13:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,rust,提起,department", "title": "\n司法部已对谷歌提起反垄断诉讼", "title_en": "\n\t\t\t\tThe Justice Department has filed its antitrust lawsuit against Google\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/justice-department-will-reportedly-file-its-antitrust-lawsuit-against-google-today/", "via": "", "real_tags": ["谷歌", "google", "rust", "提起"]}, {"category": "", "categoryclass": "", "imagename": "02248cd94900ae34b729f94fe7f0b1d8.png", "infoid": 1030024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "流媒体网络Venn希望成为游戏文化对MTV的回应，它已经筹集了2600万美元，将其视频游戏主题娱乐和流媒体名人功能的组合带给大众。\nNexstar的投资使Venn在当地广播领域站稳了脚跟，可能会看到该电视网的节目出现在美国大多数主要城市的常规广播电视上，并增加了Nexstar旗下的资产，包括CourtTV、Boss和Ion TV。根据Venn的联合创始人兼首席执行官本·库辛(Ben Kusin)的一份声明，该公司拥有197多家电视台和一个网站网络，平均每月活跃用户超过1亿，页面浏览量超过10亿。\nNexstar Media Group总裁、首席运营官兼首席财务官托马斯·E·卡特(Thomas E.Carter)在一份声明中表示：“Venn是一种为流媒体和数字一代打造的新型电视网络，它正在为痴迷于游戏的千禧一代和Z世代文化开发尖端内容，”Nexstar Media Group总裁、首席运营官兼首席财务官托马斯·E·卡特(Thomas E.Carter)在一份声明中表示。游戏和体育是两个快速增长的行业，通过我们的投资，我们计划在我们的广播平台上分销Venn内容，以满足年轻观众的需求；利用Venn提前获得与游戏相关的内容；并向当地和全国品牌提供广播和数字营销以及广告机会，以接触到年轻观众。“。\n目前还不清楚维恩在年轻观众中有多大的吸引力。该公司的YouTube频道拥有1.4万订户，其Twitch频道拥有略令人印象深刻的577千订户。尽管如此，这家流媒体网络现在还为时过早，它在9月份才开始播出第一个节目。\n自一年多前推出以来，Venn成功地从维亚康姆(Viacom)的MTV和MTV音乐娱乐集团(MTV Music Entertainment Group)挖来了一些前高级领导层，这一直是这家专注于游戏的流媒体网络为自己设定的模式。杰夫·雅各布斯(Jeff Jacobs)是MTV母公司维亚康姆(Viacom)负责生产规划、战略和运营的前高级副总裁，最近担任维亚康姆、NBA、全球公民和ACE宇宙的独立制片人。\nVenn目前可以在自己的网站和各种流媒体服务上使用，也可以通过与Roku Channel、Plex、Xumo、Samsung TV Plus和Vizio合作获得。\n该公司还设法与赛百味(Subway)、选秀国王(Draft Kings)、Alienware、阿迪达斯(Adidas)和美国鹰(American Eagle)等公司建立了一些早期的品牌合作伙伴关系。", "note_en": "VENN , the streaming network hoping to be gaming culture’s answer to MTV, has raised $26 million to bring its mix of video game-themed entertainment and streaming celebrity features to the masses.\n   The investment from Nexstar gives Venn a toehold in local broadcast that could see the network’s shows appear on regular broadcast televisions in most major American cities, and adds to a roster of Nexstar properties including CourtTV, Bounce, and Ion Television. The company has over 197 television stations and a network of websites that average over 100 million monthly active users and 1 billion page views, according to a statement from Ben Kusin, Venn’s co-founder and chief executive.\n “VENN is a new kind of TV network built for the streaming and digital generation, and it’s developing leading-edge content for the millennial and Gen Z cultures who are obsessed with gaming,” Nexstar Media Group President, Chief Operating Officer and Chief Financial Officer, Thomas E. Carter said in a statement. “Gaming and esports are two fast growing sectors and through our investment we plan to distribute VENN content across our broadcast platform to address a younger audience; utilize VENN to gain early access to gaming-adjacent content; and present local and national brands with broadcast and digital marketing and advertising opportunities to reach younger audiences.”\n It’s unclear how much traction with younger audiences Venn has. The company’s  YouTube channel has 14,000 subscribers and its  Twitch Channel boasts a slightly more impressive 57.7 thousand subscribers. Still, it’s early days for the streaming network, which only began airing its first programming in September.\n Since  its launch a little over a year ago, Venn has managed to poach some former senior leadership from Viacom’s MTV and MTV Music Entertainment Group, which has been the model the gaming-focused streaming network has set for itself. Jeff Jacobs, the former senior vice president for production planning, strategies and operations at MTV’s parent company,  Viacom   and most recently an independent producer for  Viacom, the NBA, Global Citizen and ACE Universe.\n Venn is currently available on its own website and various streaming services as well as through partnerships with the  Roku   Channel, Plex, Xumo, Samsung TV Plus and Vizio.\n The company has also managed to pick up some early brand partnerships with companies including Subway, Draft Kings,  Alienware,    Adidas   and American Eagle.", "posttime": "2020-10-20 22:12:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,电视网,mtv", "title": "\nVenn，一家希望成为游戏版MTV的电视网，筹集了2600万美元", "title_en": "\n\t\t\t\tVenn, a network hoping to be gaming’s answer to MTV, raises $26 million\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/venn-a-network-hoping-to-be-gamings-answer-to-mtv-raises-26-million/", "via": "", "real_tags": ["游戏", "电视网", "mtv"]}, {"category": "", "categoryclass": "", "imagename": "f624454e8da9374069994915ea771e22.jpg", "infoid": 1030023, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据欧盟委员会的数据，公共部门到私营部门的业务占全球GDP的14%，即使是1%的改善也可以为纳税人每年节省200亿欧元。\nStalles是一项新的英国创业技术，它可以将支离破碎的公共部门数据-如支出、招标、合同、会议纪要或新闻发布-转变为对市场的更清晰的看法，并提取有关潜在机会的相关早期信号。\n它现在已经筹集了140万GB的种子融资，由SpeedInvest牵头，参与融资的有7%的风险投资公司、FJLabs，以及包括GoCarless联合创始人兼Nest首席执行官马特·罗宾逊(Matt Robinson)、Go-Carless首席运营官卡洛斯·冈萨雷斯-卡德纳斯(Carlos Gonzalez-Cdenas)、微软前企业战略主管查理·宋赫斯特(Charlie Songhurst)、Grabyo创始人威尔·尼尔(Will Neale)和阿基尔·保罗(Akhil Paul)在内的知名天使。它去年收到了SeedCamp之前的一笔投资。\nStotles的创始人说，他们之前在波士顿咨询集团(Boston Consulting Group)和世界经济论坛(World Economic Forum)等组织任职期间，曾在公共采购方面拥有“严酷”的经验。\n私人测试版已经开放了9个月，包括UiPath、FreshWorks、Rackspace和Couchbase在内的公司都在使用。有了这项资金声明，他们将开启一个早期访问计划。\n竞争对手包括：Global Data、Contracts Advance、BIP Solutions、Spend Network/Open Opps、Tussel、TenderLake。然而，大多数参与者都专注于跟踪冷标，或者为定期的仿制药市场研究提供合同数据。", "note_en": "And public-to-private sector business makes up 14% of global GDP, and even a 1% improvement could save €20B for taxpayers per year, according to the  European Commission  .\n Stotles is a new UK startup technology that turns fragmented public sector data — such as spending, tenders, contracts, meeting minutes, or news releases — into a clearer view of the market, and extracts relevant early signals about potential opportunities.\n  It’s now raised a £1.4m seed round led by Speedinvest, with participation from 7Percent Ventures, FJLabs, and high-profile angels including  Matt Robinson,   co-founder of  GoCardless   and CEO at  Nested;   Carlos Gonzalez-Cadenas, COO at  Go  -Cardless; Charlie Songhurst, former Head of Corporate Strategy at Microsoft; Will Neale, founder of Grabyo; and Akhil Paul. It received a previous investment from  Seedcamp   last year.\n Stotles’ founders say they had “scathing” experiences dealing with public procurement in their previous roles at organizations like Boston Consulting Group and the World Economic Forum.\n The private beta has been open for nine months, and is used by companies including  UiPath,   Freshworks, Rackspace, and Couchbase. With this funding announcement, they’ll be opening up an early access program.\n Competitors include: Global Data, Contracts Advance, BIP Solutions, Spend Network/Open Opps, Tussel, TenderLake. However, most of the players out there are focused on tracking cold tenders, or providing contracting data for periodic generic market research.", "posttime": "2020-10-20 22:12:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "平台,secures,创始人", "title": "\nSTOTLES为平台获得资金，这将为政府招标和合同带来透明度", "title_en": "\n\t\t\t\tStotles secures funding for platform which brings transparency to government tenders, contracts\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/stotles-secures-funding-for-platform-which-brings-transparency-to-government-tenders-contracts/", "via": "", "real_tags": ["平台", "secures", "创始人"]}, {"category": "", "categoryclass": "", "imagename": "9609adeb0349da9823cd76aa6a554be5.jpg", "infoid": 1030022, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于得克萨斯州奥斯汀的公司去年10月被私募股权公司Continental悄悄收购。但据最先报道该公司关闭消息的Dark read称，上周该公司据报道正在准备裁员。\nNSS Labs的首席执行官Jason Brvenik在LinkedIn上发布了一篇简短的帖子，暗示可能会裁员，并补充道：“如果您需要超过我高标准的优秀人才，请与我联系。”(Brvenik在他的LinkedIn个人资料中将自己列为前首席执行官。)。\n前员工告诉TechCrunch，由于公司倒闭，他们已经被解雇。\nNSS Labs成立于2007年，是最知名的产品安全测试公司之一，允许客户使用真实的威胁数据对其产品进行压力测试，并发现潜在的漏洞和安全问题。\n但过去几年一直举步维艰。NSS Labs在2019年撤销了CrowdStrike的Falcon平台的“谨慎”评级，此前两家公司秘密和解了一项挑战这一结果的诉讼。NSS Labs还撤销了对反恶意软件测试标准组织(AMTSO)、赛门铁克(Symantec)和ESET的反垄断诉讼，此前这家测试巨头声称发现了这些公司涉嫌合谋提高产品测试难度的证据。", "note_en": "The Austin, Texas-based company was  quietly acquired by private equity firm Consecutive last October. But last week, the company was reportedly preparing for layoffs, according to Dark Reading, which  first reported news of the company’s shuttering.\n In a brief post on LinkedIn, NSS Labs’ chief executive Jason Brvenik hinted at layoffs, adding: “If you are in need of excellent people that exceed my high standards, please get in touch.” (Brvenik listed himself as a former chief executive on his LinkedIn profile.)\n Former employees told TechCrunch that they had been laid off as a result of the company’s closure.\n NSS Labs, founded in 2007, was one of the most well-known product security testing companies, allowing customers to use real threat data to stress-test their products and discover potential vulnerabilities and security issues.\n But the last few years have been rocky. NSS Labs retracted its “caution” rating for CrowdStrike’s Falcon platform in 2019, after the two companies confidentially settled a lawsuit challenging the results. NSS Labs also dropped its antitrust suit against the Anti-Malware Testing Standards Organization (AMTSO), Symantec and ESET, after the testing giant claimed it had discovered evidence of the companies allegedly conspiring to make it harder to test their products.", "posttime": "2020-10-20 22:12:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,冠状病毒,coronavirus,测试,testing", "title": "\n安全测试公司NSS Labs以冠状病毒为由停止运营", "title_en": "\n\t\t\t\tSecurity testing firm NSS Labs ceases operations, citing coronavirus\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/nss-labs-ceases-operations-coronavirus/", "via": "", "real_tags": ["病毒", "冠状病毒", "测试", "testing"]}, {"category": "", "categoryclass": "", "imagename": "99d3e79191ab57ee87a3b0109df5d3e9.jpg", "infoid": 1030021, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "精灵，已经更新了它的软件开发工具包，并增加了Giphy和Gucci作为新的合作伙伴，使他们的用户能够创建个性化的Genie头像。\n该公司在2018年发布了第一版SDK，当时它筹集了1000万美元，直接挑战Snap和苹果对阿凡达主导地位的挑战。现在，随着最新的更新，该公司表示，它已经成功地创建了一种新的三维渲染，可以跨平台使用-如果开发人员让Genies处理动画的话。\n精灵已经设法签约了许多娱乐界的大牌，通过他们的精灵经纪公司担任他们的官方经纪人。其中包括肖恩·门德斯、贾斯汀·比伯、卡迪·B和蕾哈娜等名人。精灵们还与美国国家橄榄球联盟(National Football League)的球员协会以及美国职业棒球大联盟(Major League Baseball)和美国国家篮球协会(National BaseAssociation)达成了协议。\n现在，这些名人和运动员可以在古驰(Gucci)和吉菲(Giphy)等平台上将Genies制造的独家数字商品货币化，这家时尚品牌和模因生成器现在可以给用户提供自己的数字身份来玩耍。\n在过去的一年里，我们的技术被名人们苛刻的创意要求磨砺了。Genies首席执行官兼联合创始人阿卡什·尼加姆(Akash Nigam)在一份声明中表示：“这推动了Genies成为全球首选头像的进军。“以前只有名人专属的体验，现在消费者可以广泛使用，作为他们的虚拟便携身份。通过向大众开放，我们现在为时尚引领者创造了一个机会，通过阿凡达数字产品与他们的观众建立新的、独特的关系。“。\nSDK集成仍然是高度精心策划和量身定做的(Genies需要对每个集成进行大量繁重的工作)。例如，古驰的用户可以试穿最新的设计，该公司将在其由Genies创建的平台上销售数字商品。Giphy用户将在其网站上和通过其分销网络将他们的头像用作gif。\nGenies阿凡达SDK总监伊兹·波拉克说：“我们的阿凡达经纪公司已经成为数千名艺术家的首选平台，有了我们的下一代、高表现力和动态的3D精灵，我们将进一步巩固我们作为通用数字身份的地位。”对于名人和日常用户来说，它打开了新的领域和垂直领域，让用户可以在其中培养他们的化身。在移动应用和网站等传统2D环境的基础上，Genies现在可以生活在AR/VR平台、游戏和需要360度渲染其购买的数字商品的用例或SDK合作伙伴平台中。“", "note_en": "Genies, has updated its software development kit and added Giphy and Gucci as new partners to enable their users to create personalized Genie avatars.\n The company released the first version of its sdk in 2018 when it raised a $10 million to directly challenge  Snap   and Apple for avatar dominance. Now, with the latest update, the company said it has managed to create a new three dimensional rendering that can be used across platforms — if developers let Genies handle the animation.\n  Genies   has already managed to sign up many of the biggest names in entertainment to act as their official manager through their Genies talent agency. These include celebrities like Shawn Mendes, Justin Bieber, Cardi B, and Rihanna. Genies also locked in deals with the National Football League’s player’s association along with  Major League Baseball   and the National Basketball Association.\n Now, those celebrities and athletes can monetize exclusive digital goods made by Genies on platforms like  Gucci   and  Giphy   and the fashion house and meme generator can now give users their own digital identity to play around with.\n “Over the past year, our technology has been sharpened by the exacting creative demands of celebrities. This advanced  Genies’ march to be the go-to avatar globally,” said Akash Nigam,  Genies CEO and co-founder, in a statement. “What was previously a celebrity exclusive experience, is now broadly available for consumers to use as their virtual portable identities. By opening up to the masses, we’ve now created an opportunity for tastemakers to forge new, unique relationships with their audiences through avatar digital goods.”\n The SDK integrations are still highly curated and tailored (there’s a lot of heavy lifting that Genies needs to do with each one). For instance, Gucci users can try on the latest designs and the company will sell digital goods on its platform created by Genies. Giphy users will use their avatars as gifs on its site and through its distribution network.\n “Our  Avatar   Agency has served as the go-to platform for thousands of artists, and with our next-gen, highly expressive and dynamic 3D  Genie, we will further solidify our position as the universal digital identity,” said Izzy Pollak, Director of Avatar SDK at  Genies. “For celebrities and everyday users alike, it unlocks new arenas and verticals for users to cultivate their avatars in. On top of traditional 2D environments like mobile apps and websites,  Genies can now live in AR/VR platforms, games, and in use cases or SDK partner platforms that demand a 360-degree rendering of the digital goods they purchase,”", "posttime": "2020-10-20 22:12:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,开发,工具包,updates,genies", "title": "\nGenies更新其软件开发工具包，并与Gucci，Giphy合作", "title_en": "\n\t\t\t\tGenies updates its software development kit and partners with Gucci, Giphy\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/genies-updates-its-software-development-kit-and-partners-with-gucci-giphy/", "via": "", "real_tags": ["软件", "开发", "工具包", "updates", "genies"]}, {"category": "", "categoryclass": "", "imagename": "c2d835238923419513d45c1780f39d1e.jpg", "infoid": 1030020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TechCrunch的长期读者可能还记得，这家初创公司是一款雄心勃勃的消费者社交应用，曾让硅谷投资者感到兴奋，但在2011年最终以300万美元的价格收购Foursquare将该公司的人才带到Facebook之前，它在与Foursquare展开竞争的努力中最终受挫。\n这个故事似乎注定要到此为止，但创始人乔希·威廉姆斯(Josh Williams)告诉TechCrunch，他已经决定重振Gowalla这个名字，并通过依赖增强现实技术来构建其终极愿景。\n威廉姆斯告诉TechCrunch：“我真的认为(Gowalla的愿景)根本没有完全实现，这就是为什么我仍然想要挠这个痒。”“坦率地说，看到它关闭真的很难。”\n在Facebook、另一家风险投资支持的初创公司Facebook和其他几场演出之后，威廉姆斯重新获得了Gowalla的名字，并在联合创始人帕特里克·皮蒙特(Patrick Piemonte)的指导下重振了公司。皮埃蒙特曾是苹果的界面设计师，之前创立了一家名为Mige的AR初创公司。这家新公司是在Form Capital内部孵化出来的，Form Capital是一家由威廉姆斯和博比·古德拉特运营的以设计为中心的小型风险投资基金。\n尽管Facebook、苹果和谷歌进行了大量投资，但增强现实仍然被视为一场赌博，许多支持者估计大规模采用还需要几年时间。苹果的ARKit开发者平台尽管投入巨资，但收效甚微，该领域唯一的热门消费者产品“精灵宝可梦Go”(Pokémon Go)正在老化。\n威廉姆斯说：“最大的AR体验是精灵宝可梦Go，现在它已经有六年多的历史了。”“它已经将空间向前推进了很多，但就我们将要看到的情况而言，还为时过早。”\n当谈到新的增强现实平台发布时到底会是什么样子的细节时，威廉姆斯含糊其辞。他确实明确指出，它给人的感觉更像是一款游戏化的社交应用，而不是一款社交游戏，不过他也将任天堂特许经营的“动物穿越”列为该平台的基本灵感之一。\n威廉姆斯说：“这不是一个有老板、任务或级别的游戏，而是一些你可以体验的东西。”“你如何将增强现实和定位融合在一起？你怎么通过别人的眼睛看世界呢？“。\n基于位置的社交平台很可能依赖于用户的实际出行，而这场流行病在很大程度上决定了这款应用的发布时间。今天，Gowalla推出了一个等待名单，威廉姆斯表示，这款应用本身将在明年上半年的某个时候“在多个城市”以测试版发布。该团队还在尝试一些独特的东西，比如一个名为“街道团队”(Street Team)的较小的付费测试组，用户只需支付49美元的固定费用，就可以提前进入Gowalla，还可以成为“VIP会员”，成为一个私人不和谐团体的会员，以及一些品牌礼品。一款专门的街队应用程序也将在12月推出。", "note_en": "The startup,  which longtime TechCrunch readers will likely recall, was an ambitious consumer social app that excited Silicon Valley investors but ultimately floundered in its quest to take on Foursquare before an eventual  $3 million acquihire in 2011 brought the company’s talent to Facebook.\n The story certainly seemed destined to end there, but founder  Josh Williams   tells  TechCrunch   that he has decided to revive the Gowalla name and build on its ultimate vision by leaning on augmented reality tech.\n  “I really don’t think [ Gowalla’s   vision] has been fully realized at all, which is why I still want to scratch this itch,” Williams tells TechCrunch. “It was frankly really difficult to see it shut down.”\n  After a stint at  Facebook,   another venture-backed startup and a few other gigs, Williams has reacquired the Gowalla name, and is resurrecting the company with the guidance of co-founder Patrick Piemonte, a former Apple interface designer who previously founded an AR startup called Mirage. The new company was incubated inside Form Capital, a small design-centric VC fund operated by Williams and  Bobby Goodlatte  .\n   Despite significant investment from Facebook,  Apple   and  Google,   augmented reality is still seen as a bit of a gamble with many proponents estimating mass adoption to be several years out. Apple’s ARKit developer platform has yielded few wins despite hefty investment and Pokémon Go — the space’s sole consumer smash hit — is growing old.\n “The biggest AR experience out there is Pokémon Go, and it’s now over six years old,” Williams says. “It’s moved the space forward a lot but is still very early in terms of what we’re going to see.”\n Williams was cryptic when it came to details for what exactly the new augmented reality platform would look like when it launches. He did specify that it will feel more like a gamified social app than a social game, though he also lists the  Nintendo   franchise Animal Crossing as one of the platform’s foundational inspirations.\n  “It’s not a game with bosses or missions or levels, but rather something that you can experience,” Williams says. “How do you blend augmented reality and location? How do you see the world through somebody else’s eyes?”\n A location-based social platform will likely rely on users actually going places, and the pandemic has largely dictated the app’s launch timing. Today, Gowalla is launching a waitlist, Williams says the app itself will launch in beta “in a number of cities” sometime in the first-half of next year. The team is also trying something unique with a smaller paid beta group called the “Street Team,” which will give users paying a flat $49 fee early access to Gowalla as well as “VIP membership,” membership to a private Discord group and some branded swag. A dedicated Street Team app will also launch in December.", "posttime": "2020-10-20 22:12:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "现实,resurrected,gowalla", "title": "\nGowalla作为一款增强现实社交应用正在复兴", "title_en": "\n\t\t\t\tGowalla is being resurrected as an augmented reality social app\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/gowalla-is-getting-resurrected-as-an-augmented-reality-social-app/", "via": "", "real_tags": ["现实", "gowalla"]}, {"category": "", "categoryclass": "", "imagename": "ce5085d2b03d6dfb28767c0ccafe8b02.jpg", "infoid": 1030019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Robin.io承诺，它将为集装箱化的应用程序带来云原生数据管理功能，并支持备份和恢复、快照、回滚等标准操作。它可以做到所有这些，同时提供裸机性能和对所有主要云的支持。该服务本质上与实际使用的数据库无关，并支持PostgreSQL、MySQL、MongoDB、Redis、MariaDB、Cassandra、Elasticsearch等。\n罗宾创始人兼首席执行官帕塔·西塔拉(Partha Seetala)说：“罗宾云本地存储可以在任何基于库伯内斯的平台和任何云上处理任何工作负载。”凭借存储、拍摄快照、备份、克隆、迁移和保护数据的功能-所有这些功能都只需使用最简单的命令-Robin Cloud Native Storage为开发人员和DevOps团队提供了一个超级简单但高性能的工具，用于在Kubernetes上快速部署和管理他们的企业工作负载。“。\n新的免费版本允许团队管理多达5个节点和5TB的存储。这里的承诺是，这是一个终身免费的服务，该公司显然希望它能让企业感受到这项服务，然后随着时间的推移升级到付费企业计划。\n在谈到这些企业计划时，该公司今天还宣布，它将转向基于消费的定价计划，起步价为每节点小时0.42美元(尽管它也提供年度订阅)。企业计划包括全天候支持，不限制节点数量或存储容量。\nRobin核心存储服务的新特性包括对Helm Charts(其中Helm是Kubernetes包管理器)的数据管理支持、指定数据应该确切驻留的位置(主要是为了使其接近计算资源)的能力，以及确保依赖于分布式数据库和数据平台的有状态应用程序的可用性的关联策略。", "note_en": "Robin  .io promises that it brings cloud-native data management capabilities to containerized applications with support for standard operations like backup and recovery, snapshots, rollbacks and more. It does all of that while offering bare-metal performance and support for all major clouds. The service is essentially agnostic to the actual database being used and offers support for the likes of PostgreSQL,  MySQL,   MongoDB, Redis, MariaDB, Cassandra, Elasticsearch and others.\n   “Robin Cloud Native Storage works with any workload on any Kubernetes-based platform and on any cloud,” said Robin founder and CEO Partha Seetala. “With capabilities for storing, taking snapshots, backing up, cloning, migrating and securing data — all with the simplest of commands —  Robin Cloud Native Storage offers developers and DevOps teams a super simple yet highly performant tool for quickly deploying and managing their enterprise workloads on Kubernetes.”\n The new free version lets teams manage up to 5 nodes and 5TB of storage. The promise here is that this a free-for-life offering and the company obviously expects that it allows enterprises to get a feel for the service and then upgrade to its paid enterprise plans over time.\n Talking about those enterprise plans, the company also today announced that it is moving to a consumption-based pricing plan, starting at $0.42 per node-hour (though it also offers annual subscriptions). The enterprise plan includes 24×7 support and doesn’t limit the number of nodes or storage capacity.\n Among the new features to Robin’s core storage service are data management support for Helm Charts (where  Helm is the Kubernetes package manager), the ability to specify where exactly the data should reside (which is mostly meant to keep it close to the compute resources) and affinity policies that ensure availability for stateful applications that rely on distributed databases and data platforms.", "posttime": "2020-10-20 22:12:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,发布,launches,企业", "title": "\nRobin.io发布其云原生Kubernetes存储解决方案的免费版本", "title_en": "\n\t\t\t\tRobin.io launches a free version of its cloud-native Kubernetes storage solution\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/robin-io-launches-a-free-edition-of-its-cloud-native-kubernetes-storage-solution/", "via": "", "real_tags": ["免费", "发布", "launches", "企业"]}, {"category": "", "categoryclass": "", "imagename": "4c09402fcb41c2b3434935dd76c647a4.png", "infoid": 1030018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家初创公司成立于2015年，其使命是通过协作(以及少量人工智能)简化发票管理。有趣的是，斯坦普利表示，它当时对在协作套件之外提供支付产品不感兴趣，而是专注于采购支付的过程。\n这一最新声明标志着该公司思路的转变。联合创始人兼首席执行官埃亚尔·费尔德曼(EYAL Feldman)解释说，与客户的对话显示，许多组织对目前的B2B支付格局感到失望。\n组织有几种选择：剪切并邮寄自己的纸质支票，使用ACH，或者与支付提供商签约使用“电子支付”。\n剪切和邮寄支票是一项史前的、耗时的活动，并不真正属于2020年，而ACH(成本非常低、固定成本)通常将多笔交易分组为一笔金额，这使得会计很难对单个行项目的购买进行对账。\n“在‘电子支付’的误导性旗帜下，[支付提供商]向AP部门提供回扣，并承诺供应商更快地付款，”费尔德曼在一篇博客文章中解释道。然而，为了让卖家获得付款，他们必须接受虚拟信用卡支付，每笔交易最高可收取3.5%的信用卡手续费。\n许多支付提供商不会将从发票和交易中提取的数据提供给组织，以此作为保持粘性的一种方式。\n斯坦普利的客户为这家过去与支付无关的初创公司阐明了这些问题。随着Stampli Direct Pay的推出，该公司的支付仍然很灵活，允许组织与其现有的或不同的支付提供商合作。但斯坦普利现在提供了一个旨在解决其中许多行业问题的选择。\n因为Stampli的核心产品已经跟踪了每笔交易的所有上下文和相关信息，所以这些信息在支付审批过程中很容易获得。Direct Pay还提供ACH作为支付选项，但将单独的交易分开以便于对账。对于那些想要坚持使用支票的客户，Stampli Direct Pay提供了一项服务，允许客户批准直接来自他们的银行账户并带有签名的数字支票，Stampli负责打印、盖章和邮寄。\nStampli还提供了一个供应商支付门户网站，该门户网站提取每个供应商所需的数据，并让客户拥有这些数据，这些数据可以下载并带给另一个支付提供商。\n通常，团队购买产品或服务，这些发票最终进入财务部门，几乎没有上下文，在组织内部引发了一场鸭子鹅游戏，因为会计师试图获得他们向供应商付款所需的信息和批准。\n到目前为止，斯坦普利已经筹集了3200万美元，它建立了一个协作平台，允许非会计师以一种简单明了的方式参与发票管理流程。每一张发票都成了沟通的枢纽，让不同部门的人都可以填空。回答有关购买的问题。Stampli还使用机器学习来识别与成本分配、管理审批工作流以及需要从发票中提取的数据相关的模式。\n每一张发票都变成了自己的通信枢纽，允许跨部门的人填写空白处并回答问题，以便尽可能高效地处理付款。此外，Stampli使用机器学习来识别组织如何分配成本、管理审批工作流程以及从发票中提取哪些数据的模式。\n随着Direct Pay的推出，斯坦普利准备与各种具有明显差异化优势的新竞争对手展开竞争。该公司每年处理的发票超过130亿美元。\n团队也已经发展到100多名员工。根据费尔德曼的数据，该公司56%的美国劳动力是非白人，33%的高管领导团队是女性。", "note_en": "The startup launched back in 2015 with a mission to simplify invoice management through collaboration (and a dash of AI). Interestingly, Stampli said it was uninterested at the time in providing a payments product alongside its collaborative suite, focusing instead on the process of procure to pay.\n This latest announcement marks a shift in the company’s thinking. Cofounder and CEO  Eyal Feldman explained that conversations with customers revealed just how frustrated many organizations are with the current B2B payments landscape.\n  Organizations have several options: cut and mail their own paper checks, use ACH, or sign on with a payments provider to use ‘e-payments.’\n Cutting and mailing checks is a pre-historic, time-intensive activity that doesn’t really belong in 2020, while ACH (which comes at a very low, flat cost) often groups multiple transactions into a single sum, making it difficult for accounting to reconcile individual line item purchases.\n “Under the misleading banner of “e-payments,” [payments providers] offer AP departments a rebate and promise vendors faster payment,” explained Feldman in a blog post. “However, in order for vendors to get the payment, they must accept payments as virtual credit cards, which come with up to a 3.5% credit card fee per transaction.”\n And many payments providers do not provide the data extracted from invoices and transactions back to the organization as a way to stay sticky.\n Stampli’s customers illuminated these problems for the startup, which used to be payments agnostic. With the launch of Stampli Direct Pay, the company is still payments flexible, letting organizations work with their existing or different payments providers. But Stampli now offers an option that aims to resolve many of these industry issues.\n Because Stampli’s core product already tracks all the contextual and relevant info for every transaction, that information is readily available during payment approval. Direct Pay also offers ACH as a payment option, but separates individual transactions out for easy reconciliation. And for customers who want to stick with checks, Stampli Direct Pay offers a service that allows customers to approve digital checks which come directly from their bank account with their signature, with Stampli handling printing, stamping, and mailing.\n Stampli also offers a vendor payment portal that extracts the needed data for each vendor and lets the customer own that data, which can be downloaded and taken to another payment provider.\n  Usually, teams purchase products or services and those invoices end up in the finance department with little to no context, setting off a game of duck duck goose within the organization as accountants try to get the information and approvals they need to pay out that vendor.\n Stampli, which has raised  $32 million to date, built out a collaborative platform that allows non-accountants to participate in the invoice management process in a way that’s straightforward and simple. Each invoice becomes a communications hub, allowing folks across various departments fill in the blanks and. answer questions about the purchase. Stampli also uses machine learning to recognize patterns around allocating costs, managing approval workflows, and the data that needs to be extracted from invoices.\n Each invoice is turned into its own communications hub, allowing people across departments to fill in the blanks and answer questions so that payments are handled as efficiently as possible. Moreover, Stampli uses machine learning to recognize patterns around how the organization allocates cost, manages approval workflows and what data is extracted from invoices.\n With the launch of Direct Pay, Stampli is poised to take on a variety of new competitors with an obvious differentiator. The company has processed more than $13 billion in invoices annually.\n The team has also grown to more than 100 employees. Fifty-six percent of the company’s US workforce is non-white and 33 percent of the executive leadership team is female, according to Feldman.", "posttime": "2020-10-20 22:11:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,管理软件,invoice,支付", "title": "\nStampli是一家发票管理软件初创公司，它推出了一款支付产品", "title_en": "\n\t\t\t\tStampli, an invoice management software startup, launches a payments product\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/stampli-an-invoice-management-software-startup-launches-a-payments-product/", "via": "", "real_tags": ["软件", "管理软件", "invoice", "支付"]}, {"category": "", "categoryclass": "", "imagename": "b0abf99775dca95d5abda7649644443e.jpg", "infoid": 1030017, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如今，在大卫·萨克斯(David Sacks)、Slake、Gradient Ventures、Y Combinator和其他个人投资者的260万美元种子投资的帮助下，他们可以继续实现这个梦想。\n吸引这项投资的是几位年轻的创始人，他们热衷于让构建数据仪表盘变得简单，而不需要工程师或数据分析师等专家的帮助。\n“从本质上说，我们所做的就是帮助公司用尽可能少的代码或技术知识建立他们的业务指标仪表盘。这样做的副产品是，公司中的任何人都可以为他们的团队建立自己的指标，“联合创始人Xavier Pladevall告诉TechCrunch。\n最终用户可以连接到越来越多的数据源，Index处理构建查询并为用户显示数据，而无需数据科学家或数据分析师的帮助。目前，这包括用于CRM数据的Salesforce和Hubpot，条带支付数据，以及Postgres和MongoDB的某些数据库。\n当创始人构建产品时，他们希望只有两名创始人，也许还有两名额外的工程师，这样他们就能保持精简。他说：“我们实际上希望招聘两名全职员工，这将把我们带到甲级联赛，我们已经与投资者非常明确地谈到了这一点。”\n作为拉丁裔移民的创始人，他们希望建立一家多元化和包容性的公司。他说，对他和他的联合创始人来说，找到有色人种并不难，因为他们已经与他们可以利用的不同的社交网络建立了友谊。\n他说：“我们的工作是继续做我们正在做的事情，即与一群不同的人做朋友，因为这是真诚的，人们绝对可以告诉你，你正在努力完成一些多样性配额，而不是当你通常是一家以多元化为导向的公司时，因为这归根结底是创始人本身。”\n这两位创始人和他们的家人从小就是朋友。他们在多米尼加共和国长大，没有机会上计算机科学课，但他们确实可以上网，他们通过阅读像这样的美国科技出版物而感染了创业漏洞，并从YouTube视频和StackOverflow中学会了编程。他们都是在美国上的大学，都在大公司实习-Facebook的Pladevall和纽约的Portet在Metadata工作。\n之所以有这个想法，是因为Pladevalll是Facebook团队的一员，该团队构建了一个类似的工具供内部使用。他认为，对于没有Facebook资源的公司来说，这将是一个可行的商业想法。随着大流行的来袭，他和儿时的朋友走到了一起，并于1月份开始创建公司。\n他承认今年的困难，但他说，这真的帮助他们集中精力，因为没有其他事情可做。虽然他们对银行里有260万美元感到惊讶，但他说，他们仍然有一种渴望，他认为这是移民创始人精神的一部分。\n“我只是渴望证明自己，如果编码是必需的，那就学习如何编码吧。”如果是通过早期签证程序，顺便说一句，这比筹集数百万美元和通过YC要难得多，在我看来，(你可以这么做)。他说要不惜一切代价。\n随着这两位朋友迈出公司的第一步，他们拥有了一些早期客户，并不断完善产品。有了今天的资金，他们对下一年有了一些远大的目标，其中包括打造该产品，达到100万美元的ARR，以及建立仪表盘的分销。\n普拉德瓦尔说，如果他们能实现这些目标，他们应该能拿到甲级联赛冠军。我不会打赌他们不会这么做。", "note_en": "Today they get to keep building on that dream with the help of a $2.6 million seed investment from David Sacks, Slack, Gradient Ventures,  Y Combinator   and other individual investors.\n What has attracted this investment is a couple of young founders who are passionate about making it simple to build a data dashboard without help from experts like engineers or data analysts.\n  “Essentially what we do is we help companies build their business metrics dashboards with as little code or technical knowledge as possible. The byproduct of that is that anyone in the company can build their own metrics for their teams,” co-founder Xavier Pladevall told TechCrunch.\n End users can connect to a growing list of data sources and  Index   deals with building the queries and displaying the data for the users without data scientists or data analysts to help. For now, that includes Salesforce and Hubspot for CRM data, Stripe payments data and certain databases from Postgres and MongoDB.\n  As the founders build out the product, they want to stay lean with just the two founders and perhaps two additional engineers. “We’re actually looking to hire two people full time, and that’s going to take us to the Series A, and we’ve been very clear with investors about that,” he said.\n As Latino immigrant founders, they want to build a company that’s diverse and inclusive. He says that’s it’s not hard for him and his co-founder to find people of color because they have formed friendships with a diverse  network of people they can tap into.\n “Our job is to keep doing what we’re doing, which is to be friends with a bunch of different people because that is genuine and people can definitely tell you’re trying to meet some diversity quota versus when you’re generally a diversity-oriented type of company because it comes back to the founders themselves,” he said.\n  The two founders and their families have been friends since they were children. Growing up in the Dominican Republic, they didn’t have access to computer science classes, but they did have access to the internet and they got the startup bug from reading U.S. tech publications like this one, and learned to code from YouTube videos and StackOverflow. They both came to college in the U.S. and both interned at large companies — Pladevall at Facebook and Portet worked at Metadata in New York.\n The idea came together because Pladevalll was part of a team at Facebook building a similar tool for internal use. He decided that it would be a viable commercial idea for companies without the resources of Facebook. He came together with his childhood friend and began building the company in January as the pandemic hit.\n He acknowledges the hardship of this year, but says it really helped them focus because there wasn’t anything else to do. While they are amazed at having $2.6 million in the bank, he says they still have the hunger that he believes is part of the immigrant founder ethos.\n “It’s just hunger to just prove yourself and if coding is what it takes, learn how to code. If it’s going through an early visa process, which is by the way, way harder than raising millions of dollars and going through YC, in my opinion, [you do that]” he said. He said it’s about doing whatever it takes.\n As the two friends take their first steps as a company, they have some early customers and continue to refine the product. With today’s funding they have some lofty goals for the next year, which include building out that product, reaching $1 million in ARR and building distribution for the dashboard.\n If they can meet those goals, Pladevall says, they should be able to get their Series A. I wouldn’t bet against them.", "posttime": "2020-10-20 22:11:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "用于,create,数据", "title": "\n索引NABS$260万种子，用于创建无编码的BI仪表板", "title_en": "\n\t\t\t\tIndex nabs $2.6M seed to create BI dashboards without coding\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/index-nabs-2-6m-seed-to-create-bi-dashboards-without-coding/", "via": "", "real_tags": ["用于", "create", "数据"]}, {"category": "", "categoryclass": "", "imagename": "0106fd960176799038350a08ff14069b.png", "infoid": 1030016, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用粉丝徽章赚钱的想法并不是Instagram独有的。包括Twitch和YouTube在内的其他直播平台也有类似的系统。Facebook Live还允许粉丝在直播视频中购买明星，作为一种虚拟的小费机制。\nInstagram用户将在直播视频中看到三种购买徽章的选择：售价0.99美元、1.99美元或4.99美元的徽章。\nInstagram表示，在Instagram Live上，徽章不仅会引起人们对粉丝评论的关注，还会释放出特殊的功能。这包括在创建者的徽章持有者名单上放置一个位置，以及获得一个特殊的心形徽章。\n徽章和名单让创作者更容易快速看到哪些粉丝支持他们的努力，如果需要的话，还可以给他们大喊一声。\nInstagram表示，为了启动徽章的推出，它还将从11月开始，暂时匹配创作者在直播视频中购买徽章的收入。创建者@ronneBrown和@Young gezee都在测试徽章的人之列。\n该公司表示，它在发布时不会收取收入份额，但随着徽章测试的扩大，它将在未来探索收入份额。\n“创作者推动文化向前发展。Instagram首席运营官贾斯汀·奥索夫斯基在一份声明中表示：“他们中的许多人都为此奉献了一生，这对我们来说非常重要，他们有很容易的方式从内容中赚钱。”“这些都是我们工作中的额外步骤，目的是让Instagram成为创作者讲述故事、扩大受众和谋生的最佳场所，”她补充道。\n此外，Instagram今天正在将其IGTV广告测试的访问范围扩大到更多的创作者。今年春天推出的这项计划，允许创作者通过在视频中添加广告来赚钱。Instagram说，如今，创作者至少保留了55%的收入。\n此前曾宣布推出徽章和IGTV广告，Instagram表示将在今年早些时候与一小群创作者测试前者。\n在这些变化之前，Instagram的直播视频平台经历了一段时间的快速增长，在冠状病毒大流行期间，创作者和粉丝在家里避难，取消了现场活动、大型聚会、音乐会等。\n例如，在疫情爆发期间，Instagram表示，从2020年2月到3月，Live创作者的视频浏览量增加了70%。在第二季度，Facebook还报告了月度活跃用户增长(从第一季度的29.9亿增长到31.4亿)，称这反映了更多时间呆在家里的消费者参与度的增加。", "note_en": "The idea to monetize using fan badges is not unique to Instagram. Other live streaming platforms, including  Twitch and  YouTube, have similar systems.  Facebook Live also allows fans to purchase stars on live videos, as a virtual tipping mechanism.\n Instagram users will see three options to purchase a badge during live videos: badges that cost $0.99, $1.99, or $4.99.\n  On Instagram Live, badges will not only call attention to the fans’ comments, they also unlock special features, Instagram says. This includes a placement on a creator’s list of badge holders and access to a special heart badge.\n The badges and list make it easier for creators to quickly see which fans are supporting their efforts, and give them a shout-out, if desired.\n  To kick off the roll out of badges, Instagram says it will also temporarily match creator earnings from badge purchases during live videos, starting in November.  Creators    @ronnebrown and  @youngezee are among those who are testing badges.\n The company says it’s not taking a revenue share at launch, but as it expands its test of badges it will explore revenue share in the future.\n “Creators push culture forward. Many of them dedicate their life to this, and it’s so important to us that they have easy ways to make money from their content,” said Instagram COO Justin Osofsky, in a statement. “These are additional steps in our work to make Instagram the single best place for creators to tell their story, grow their audience, and make a living,” she added.\n Additionally, Instagram today is expanding access to  its IGTV ads test to more creators. This program,  introduced this spring, allows creators to earn money by including ads alongside their videos. Today, creators keep at least 55% of that revenue, Instagram says.\n The introduction of badges and IGTV ads were  previously announced, with Instagram saying it would test the former with a small group of creators earlier this year.\n The changes follow what’s been a period of rapid growth on Instagram’s live video platform, as creators and fans sheltered at home during the coronavirus pandemic, which had cancelled live events, large meetups, concerts, and more.\n During the pandemic’s start, for example, Instagram said Live creators saw a 70% increase in video views from Feb. to March, 2020. In Q2,  Facebook also reported monthly active user growth (from 2.99B to 3.14B in Q1) that it said reflected increased engagement from consumers who were spending more time at home.", "posttime": "2020-10-20 22:11:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,直播,rolls,徽章", "title": "\nInstagram为直播视频推出粉丝徽章，扩大IGTV广告测试", "title_en": "\n\t\t\t\tInstagram rolls out fan badges for live videos, expands IGTV ads test\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/instagram-rolls-out-fan-badges-for-live-videos-expands-igtv-ads-test/", "via": "", "real_tags": ["广告", "直播", "rolls", "徽章"]}, {"category": "", "categoryclass": "", "imagename": "f1d0746230d5bb7deaf9754f20eb141f.jpeg", "infoid": 1030014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "握手为大学年龄的学生提供了一个平台，让他们登记自己的兴趣和技能，寻找合适的工作，招聘人员也可以搜索候选人，发布入门级职位空缺的广告。在一轮增长融资中，该公司已经筹集了8000万美元。\n握手没有透露其估值，但一位接近这家初创公司的可靠消息人士表示，自上一轮融资以来，估值已经翻了一番以上。当时的估值为2.75亿美元，现在可能的估值在5.5亿至6亿美元之间。\n该公司自2014年成立以来，在一定程度上建立了自己的形象，部分原因是它是一个更具包容性的LinkedIn版本，针对的是刚刚开始进入就业市场的人，它正在利用这笔资金加倍努力。\n它现在覆盖了1,700万名求职者、1,000所高等教育机构和近50万名雇主，并与大约120家为少数族裔服务的机构建立了合作伙伴关系，其中包括历史上一直是黑人的学院和大学，以及美国的拉美裔服务机构，以帮助它们和他们的学生更好地应对求职招聘市场。\n今年，握手一直在利用其最新的资金-实际上已于2019年11月关闭-扩大到其网络中也包括社区大学，并扩大其虚拟活动服务。\nD系列由GGV牵头，还包括所有现有投资者的参与。握手已经有了一批杰出的支持者：它的上一轮融资是在2018年进行的4000万美元的C系列融资，由EQT牵头，还包括Chan Zuckerberg Initiative、Omidyar Network和REACH Capital，以及True Ventures、凯鹏华盈(Kleiner Perkins)、LightSpeed Venture Partners、星火资本(Spark Capital)和KPCB Edge。\n握手公司首席执行官加勒特·洛德与斯科特·林韦尔斯基(CTO)和本·克里斯滕森(董事会成员)共同创立了这家公司，他表示，冠状病毒不仅影响了就业市场，也影响了求职市场。\n他说：“正如你可以想象的那样，这场流感大流行真的重塑了招聘经济。”“公司不能再去校园招聘了”--传统上，公司与刚进入就业市场的人建立联系的方式很大一部分是通过活动，让他们可以集体会见许多人--“因此，我们看到了前所未有的虚拟招聘转变。”\n他补充说，“在Covid出现之前”，虚拟活动变得越来越受欢迎，但突然之间，它成了镇上唯一的游戏。他说，目前约有2万名雇主使用握手平台在机构管理虚拟招聘活动。这些活动采取在线交流会和交易会的形式，提供5次30分钟的小组会议，每次最多50名学生，由招聘人员提供演示并与学生交谈；和/或与学生进行10分钟的1：1会议，最多15名招聘人员。\n一切都很好，除了就业市场本身仍然不稳定。洛德说，在疫情爆发之初，招聘人数下降了20-30%，酒店业等特定行业领跌，那些仍在招聘的行业放弃了积极主动的校园招聘。现在，七个月过去了，其中许多人意识到，他们必须继续保持可见性，并正在慢慢回归。\n洛德说：“他们比以往任何时候都更需要握手，用数字化和身临其境的体验取代地面体验。”\n在管理宏观经济收缩的同时，今年将社区学院纳入握手范围是一件巨大的事情。\n长期以来，人们一直认为两年制和四年制院校之间存在着声望和专业知识的差异，但随着我们对高等教育概念的不断发展，许多学生完全放弃了大学，或者选择了不能延伸到大学或学院四年学习的职业学位，大学变得越来越昂贵，是时候让帮助一层学生的平台也帮助另一层学生了。\n对于它的投资者来说，当公司不仅在谈论想要建立更多样化的劳动力队伍，而是把钱放在嘴边，并将这种变化内在化是你有时需要积极主动才能实现的事情时，握手是一家令人信服的初创公司，值得投资。\nGGV管理合伙人杰夫·理查兹在一份声明中表示：“自成立以来，握手一直专注于通过将雇主与高等教育机构的求职学生联系起来，实现其实现就业机会民主化的愿景，并建立了一个由1700万名求职者、1000所高等院校和近50万名雇主组成的丰富网络，”GGV管理合伙人杰夫·理查兹(Jeff Richards)在一份声明中表示。我们很高兴与握手团队联手，通过提供创新的、行业领先的招聘解决方案并向新市场扩张，帮助公司进一步扩大影响力。“", "note_en": "Handshake, which provides a platform for college-aged students to register their interest and skills and search for suitable work, and for recruiters to search for candidates and advertise entry-level openings, has raised $80 million in a growth round of funding.\n Handshake   is not disclosing its valuation but a reliable source close to the startup said that the valuation has more than doubled since its last round. That was at $275 million, putting the likely valuation now between $550 million and $600 million.\n  The company has been around since 2014 and has built its profile in part as a more inclusive version of LinkedIn aimed at people only start starting out in the job market, and it’s using the funding to double down on that.\n It now covers 17 million job seekers, 1,000 institutions of higher learning and nearly 500,000 employers, with partnerships with some 120 minority-serving institutions, which include Historically Black Colleges and Universities, and Hispanic Serving Institutions in the U.S., to help them and their students better tackle the job-hunting-recruitment market.\n And in this year, Handshake has been using its latest funding — which actually closed in November 2019 — to expand to also including community colleges in its network, and expand its  virtual events services.\n The Series D is being led by GGV and also includes participation from all of its existing investors. Handshake already had an illustrious list of backers: its last round, a  $40 million Series C in 2018, was led by EQT and also included the Chan Zuckerberg Initiative, Omidyar Network and Reach Capital, as well as True Ventures, Kleiner Perkins, Lightspeed Venture Partners, Spark Capital and KPCB Edge.\n Garrett Lord, Handshake’s CEO who co-founded the company with Scott Ringwelski (CTO) and Ben Christensen (a board member), said that the coronavirus has not just impacted the job market, but also the job-hunting market.\n “The pandemic, as you can imagine, has really reshaped the hiring economy,” he said. “Companies can no longer go to campus to recruit” — traditionally a huge part of how companies connect with those just entering the job market, by way of events where they can meet many people en masse — “so we’ve seen an unprecedented shift to virtual recruiting.”\n Virtual events had, he added, been gaining more popularity “prior to Covid,” but suddenly it became the only game in town. He said that currently some 20,000 employers have managed virtual recruitment events at institutions using the Handshake platform. These take the form of online mixers and fairs, where it provides five 30-minute group meetings with up to 50 students in each, with recruiters providing presentations and talking with students; and/or 10-minute 1:1 meetings with students with up to 15 recruiters.\n All well and good, except that the job market itself is still rocky. Lord said that there was a 20-30% drop in listings at the start of the pandemic, with particular sectors like hospitality leading that decline, with those still hiring pulling away from proactive campus recruitment. Now, seven months on, many of those realize that they have to continue to be visible and are slowly coming back.\n “They need Handshake more than ever before, to replace boots on ground experience with digital and immersive experiences,” Lord said.\n While managing the macroeconomic contraction, the expansion this year to including community colleges on Handshake has been a huge deal.\n There has long been a perceived prestige and expertise divide between 2-year and 4-year institutions, but as our concept of higher education continues to evolve, with many students foregoing college altogether, or opting for vocational degrees that do not extend to four years of study at a university or college, and college becomes ever more expensive, it’s about time that platforms that are helping one tier of students also helps the other.\n And for its investors, at a time when companies are not just talking about wanting to build more diverse work forces, but putting money where their mouths are, and internalizing that change is something that you sometimes need to be proactive to effect, Handshake is a compelling startup to invest in.\n “Since its founding, Handshake has been laser focused on delivering on its vision to democratize job opportunity by connecting employers with job seeking students at institutions of higher education, and has built a rich network of 17 million job seekers, 1,000 institutions of higher learning and nearly 500,000 employers,” said Jeff Richards, Managing Partner of GGV, in a statement. “We’re delighted to join forces with the Handshake team to help the company further expand its impact by delivering innovative, industry-leading recruitment solutions and expanding into new markets.”", "posttime": "2020-10-20 22:09:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大学,消息人士,ggv,招聘", "title": "握手是一款面向大学生的多元化LinkedIn，由GGV牵头筹集了8000万美元的D系列资金，消息人士称，估值在5.5亿-6亿美元之间", "title_en": "Handshake, a diversity-focused LinkedIn for college students, raises $80M Series D led by GGV, source says at a $550M-$600M valuation", "transed": 1, "url": "https://techcrunch.com/2020/10/20/handshake-raises-80m-more-to-build-a-more-diversity-focused-linkedin-for-college-students/", "via": "", "real_tags": ["大学", "消息人士", "ggv", "招聘"]}]